{"id": "http://arxiv.org/abs/0904.0848v1", "guidislink": true, "updated": "2009-04-06T05:51:45Z", "updated_parsed": [2009, 4, 6, 5, 51, 45, 0, 96, 0], "published": "2009-04-06T05:51:45Z", "published_parsed": [2009, 4, 6, 5, 51, 45, 0, 96, 0], "title": "On the existence of ergodic automorphisms in ergodic ${\\mathbb Z}\n  ^d$-actions on compact groups", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0904.3414%2C0904.4676%2C0904.0280%2C0904.4708%2C0904.4691%2C0904.1956%2C0904.2511%2C0904.1741%2C0904.3498%2C0904.0032%2C0904.2526%2C0904.0706%2C0904.0147%2C0904.1885%2C0904.2193%2C0904.4223%2C0904.4252%2C0904.2852%2C0904.1768%2C0904.2583%2C0904.3397%2C0904.1731%2C0904.0697%2C0904.2107%2C0904.4755%2C0904.0974%2C0904.2706%2C0904.4757%2C0904.4703%2C0904.1487%2C0904.4717%2C0904.3028%2C0904.3807%2C0904.3170%2C0904.1438%2C0904.3799%2C0904.1444%2C0904.3319%2C0904.1531%2C0904.3314%2C0904.0282%2C0904.3010%2C0904.0890%2C0904.3317%2C0904.0384%2C0904.3561%2C0904.3571%2C0904.4215%2C0904.3887%2C0904.4796%2C0904.2170%2C0904.1881%2C0904.1311%2C0904.1305%2C0904.1042%2C0904.4422%2C0904.3662%2C0904.4784%2C0904.2051%2C0904.2850%2C0904.4666%2C0904.1236%2C0904.1435%2C0904.2772%2C0904.2273%2C0904.0287%2C0904.0204%2C0904.3398%2C0904.4239%2C0904.0846%2C0904.3642%2C0904.4035%2C0904.3434%2C0904.2230%2C0904.1390%2C0904.2794%2C0904.2859%2C0904.4132%2C0904.3793%2C0904.3733%2C0904.0414%2C0904.2590%2C0904.3835%2C0904.4693%2C0904.0917%2C0904.0278%2C0904.0329%2C0904.3411%2C0904.1889%2C0904.2122%2C0904.0643%2C0904.2674%2C0904.0848%2C0904.2677%2C0904.0702%2C0904.1256%2C0904.2737%2C0904.4687%2C0904.0584%2C0904.2489%2C0904.2566&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "On the existence of ergodic automorphisms in ergodic ${\\mathbb Z}\n  ^d$-actions on compact groups"}, "summary": "Let $K$ be a compact metrizable group and $\\Ga$ be a finitely generated group\nof commuting automorphisms of $K$. We show that ergodicity of $\\Ga$ implies\n$\\Ga$ contains ergodic automorphisms if center of the action, $Z(\\Ga) = \\{\\ap\n\\in {\\rm Aut}(K) \\mid \\ap {\\rm commutes with elements of \\rm} \\Ga \\}$ has DCC.\nTo explain that the condition on the center of the action is not restrictive,\nwe discuss certain abelian groups which in particular, retrieves Theorems of\nBerend \\cite{Be} and Schmidt \\cite{Sc1} proved in this context.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0904.3414%2C0904.4676%2C0904.0280%2C0904.4708%2C0904.4691%2C0904.1956%2C0904.2511%2C0904.1741%2C0904.3498%2C0904.0032%2C0904.2526%2C0904.0706%2C0904.0147%2C0904.1885%2C0904.2193%2C0904.4223%2C0904.4252%2C0904.2852%2C0904.1768%2C0904.2583%2C0904.3397%2C0904.1731%2C0904.0697%2C0904.2107%2C0904.4755%2C0904.0974%2C0904.2706%2C0904.4757%2C0904.4703%2C0904.1487%2C0904.4717%2C0904.3028%2C0904.3807%2C0904.3170%2C0904.1438%2C0904.3799%2C0904.1444%2C0904.3319%2C0904.1531%2C0904.3314%2C0904.0282%2C0904.3010%2C0904.0890%2C0904.3317%2C0904.0384%2C0904.3561%2C0904.3571%2C0904.4215%2C0904.3887%2C0904.4796%2C0904.2170%2C0904.1881%2C0904.1311%2C0904.1305%2C0904.1042%2C0904.4422%2C0904.3662%2C0904.4784%2C0904.2051%2C0904.2850%2C0904.4666%2C0904.1236%2C0904.1435%2C0904.2772%2C0904.2273%2C0904.0287%2C0904.0204%2C0904.3398%2C0904.4239%2C0904.0846%2C0904.3642%2C0904.4035%2C0904.3434%2C0904.2230%2C0904.1390%2C0904.2794%2C0904.2859%2C0904.4132%2C0904.3793%2C0904.3733%2C0904.0414%2C0904.2590%2C0904.3835%2C0904.4693%2C0904.0917%2C0904.0278%2C0904.0329%2C0904.3411%2C0904.1889%2C0904.2122%2C0904.0643%2C0904.2674%2C0904.0848%2C0904.2677%2C0904.0702%2C0904.1256%2C0904.2737%2C0904.4687%2C0904.0584%2C0904.2489%2C0904.2566&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Let $K$ be a compact metrizable group and $\\Ga$ be a finitely generated group\nof commuting automorphisms of $K$. We show that ergodicity of $\\Ga$ implies\n$\\Ga$ contains ergodic automorphisms if center of the action, $Z(\\Ga) = \\{\\ap\n\\in {\\rm Aut}(K) \\mid \\ap {\\rm commutes with elements of \\rm} \\Ga \\}$ has DCC.\nTo explain that the condition on the center of the action is not restrictive,\nwe discuss certain abelian groups which in particular, retrieves Theorems of\nBerend \\cite{Be} and Schmidt \\cite{Sc1} proved in this context."}, "authors": ["C. R. E. Raja"], "author_detail": {"name": "C. R. E. Raja"}, "author": "C. R. E. Raja", "links": [{"href": "http://arxiv.org/abs/0904.0848v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0904.0848v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "math.DS", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "math.DS", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "math.RT", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "37A15; 37B05", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0904.0848v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0904.0848v1", "arxiv_comment": null, "journal_reference": null, "doi": null, "fulltext": "arXiv:0904.0848v1 [math.DS] 6 Apr 2009\n\nisibang/ms/2009/2\nApril 6th, 2009\nhttp://www.isibang.ac.in/e statmath/eprints\n\nOn the existence of ergodic automorphisms\nin ergodic Zd-actions on compact groups\nC. R. E. Raja\n\nIndian Statistical Institute, Bangalore Centre\n8th Mile Mysore Road, Bangalore, 560059 India\n\n\f\fOn the existence of ergodic automorphisms in\nergodic Zd-actions on compact groups\nC. R. E. Raja\nAbstract\nLet K be a compact metrizable group and Γ be a finitely generated group\nof commuting automorphisms of K. We show that ergodicity of Γ implies Γ\ncontains ergodic automorphisms if center of the action, Z(Γ) = {α ∈ Aut (K) |\nα commutes with elements of Γ} has DCC. To explain that the condition\non the center of the action is not restrictive, we discuss certain abelian groups\nwhich in particular, retrieves Theorems of Berend [Be] and Schmidt [Sc1] proved\nin this context.\n\n2000 Mathematics Subject Classification: 22B05, 22C05, 37A15, 37B05.\nKey words. Compact groups, automorphisms, ergodic, descending chain condition,\ndistal.\n\n1\n\nIntroduction\n\nWe shall be considering actions on compact groups. All compact groups considered\nin this article are assumed to be metrizable and all automorphisms are assumed to be\ncontinuous. Let K be a compact group and Aut (K) be the group of all continuous\nautomorphisms of K.\nDefinition 1 Let K be a compact group and ωK be the normalized Haar measure\non K. Let Γ be a group of automorphisms of K. We say that Γ is ergodic on K if\nany Γ-invariant Borel set A of K satisfies ωK (A) = 0 or ωK (A) = 1. We say that\nα ∈ Aut (K) is ergodic on K if the action of {αn | n ∈ Z} on K is ergodic.\nErgodic action has been characterized in many forms, we now recall two such\ncharacterizations due to Berend (cf. Theorem 2.1 of [Be]): Γ is ergodic on K if and\nonly if there exists x ∈ K such that the orbit Γ(x) is dense in K if and only if\nfor any non-trivial irreducible unitary representation π, the orbit {α(π) | α ∈ Γ} has\n1\n\n\finfinitely many inequivalent unitary representations where α(π) is given by α(π)(x) =\nπ(α−1 (x)) for all x ∈ K. Also, Berend [Be] proved the following result.\nBerend's Theorem: Ergodic action of a group Γ of commuting epimorphisms on a\ncompact connected finite-dimensional abelian group contains ergodic automorphisms.\nRecently Berend's Theorem was proved for certain hereditarily ergodic actions of\nsolvable groups on compact connected finite-dimensional abelian groups (cf. [BG])\nand for ergodic actions of nilpotent groups on compact connected finite-dimensional\nabelian groups (cf. [Ra]): this type of result was called a local to global correspondence in [Ra] as no α in a group Γ is ergodic implies the whole group Γ is not ergodic.\nNo analogue of Berend's Theorem is known for actions on general compact groups.\nWe will now look at the following examples in this context.\nExample 1.1 Let M be a compact group and Γ be a countably infinite group. Then\nthe (left) shift action of Γ on M Γ is defined for α ∈ Γ and f ∈ M Γ , by\nαf (β) = f (α−1 β)\nfor all β ∈ Γ. Then it can be seen that the shift action of Γ on M Γ is ergodic (cf.\n[Ra] when M is abelian). If Γ is a torsion group (for example, we may take Γ to be\nthe group of all finite permutations), then no element of Γ is ergodic. Thus, there are\nergodic actions without having any ergodic automorphisms.\nIf Γ is assumed to be a finitely generated solvable group, then Γ is torsion implies\nΓ is finite. Hence actions as in Example 1.1 does not exist if Γ is assumed to be a\nfinitely generated solvable group. However the following example shows that even if\nwe assume Γ to be finitely generated abelian, Berend's Theorem need not be true for\nany compact group.\nExample 1.2 Let M be a compact group with an ergodic automorphisms τ . For any\n(i, j) ∈ Z2 \\ (0, 0), define Ki,j = M with Z2 -action defined\nby (n, m) 7→ τ mi−nj and\nQ\n2\ndefine K0,0 = M Z with shift action of Z2 . Let K = i,j Ki,j and define coordinatewise Z2 -action on K. Then it can be verified that this action is faithful, that is no\nnon-zero (n, m) acts trivially on K. We first claim that Z2 -action on K is ergodic.\nIt is sufficient to claim that Z2 -action on each Ki,j is ergodic. Let (i, j) ∈ Z2 \\ (0, 0).\nSince τ is ergodic on M, if j 6= 0, then (i + 1, j) whose action on Ki,j is by τ −j is\nergodic on Ki,j and if i 6= 0, then (i, j + 1) whose action on Ki,j is by τ i is ergodic on\n2\nKi,j . We know that the shift action of Z2 on K0,0 = M Z is ergodic. Thus, Z2 -action\non K is ergodic.\nWe next claim that no element (i, j) of Z2 is ergodic on K. It is clear that (0, 0)\nis not ergodic on K. Now take any (i, j) ∈ Z2 \\ (0, 0). Now, (i, j)-action on Ki,j is\n2\n\n\fgiven by τ ji−ij , identity. That is, (i, j) is not ergodic on Ki,j . Since Ki,j is a factor of\nK, we get that (i, j) is not ergodic on K. Thus, no (n, m) ∈ Z2 is ergodic on K.\nIn the above example the Z2 -action on the compact group has infinitely many\ninvariant normal subgroups resulting in infinite chain of closed normal invariant subgroups. Motivated by example 1.2 we are lead to consider the following type of\nactions.\nDefinition 2 Action of a group Γ on a compact group K is said to have descending\nchain condition (abbr. as DCC) if any decreasing sequence (Ki )i≥1 of Γ-invariant\nclosed subgroups is finite, that is, there exists a n ≥ 1 such that Kn = Kn+i for all i.\nThe condition DCC was studied in the context of ergodic actions and other type of\ngroup actions (cf. [KS]). Kitchens and Schmidt [KS] proved that action of countable\nabelian groups is a projective limit of actions having DCC and action of a finitely\ngenerated abelian group Γ on a compact group K has DCC if and only if K is\nisomorphic to a shift-invariant subgroup of M Γ for some compact real Lie group M\n(cf. Theorems 3.2 and 3.16 of [KS]): see Example 1.1 for definition of the shift action\nof Γ on M ΓQ\n. It can be easily seen that K and Γ in Example 1.2 does not satisfy DCC:\ntake Kn = i+j≥n Ki+j , (Kn ) is a decreasing sequence of closed (normal) Γ-invariant\nsubgroups but Kn 6= Km for all n 6= m.\nSchmidt [Sc1] proved that if Γ is a finitely generated abelian group of automorphisms of a compact abelian group K such that Γ has DCC on K, then Γ is ergodic\non K if and only if Γ contains ergodic automorphisms (cf. Theorem 3.3 and Corollary\n3.4 of [Sc1]).\nWe now introduce center of actions. If a group Γ acts on a compact group K,\nthen center of the action denoted by Z(Γ) is defined to be Z(Γ) = {α ∈ Aut (K) |\nαβ = βα for all β ∈ Γ}. If Γ is generated by α1 , * * * , αn ∈ Γ we may write\nZ(α1 , α2 , * * * , αn ) instead of Z(Γ).\nIn this article we study ergodic actions on compact groups and prove that ergodic\nactions of finitely generated abelian groups on compact groups contain ergodic automorphisms, hence extending Berend's Theorem provided that center of the action\nhas DCC. Since a finitely generated abelian group Γ has a subgroup Γ of finite index\nisomorphic to Zd for some d ≥ 0 and Γ is ergodic if and only if any subgroup of finite\nindex is ergodic, our results are about ergodic Zd -actions.\nWe provide examples of compact groups where the center of certain type of automorphisms have DCC, as a consequence ergodic actions of finitely generated abelian\ngroups of automorphisms of such type contain ergodic automorphisms. This in particular, retrieves Berend's Theorem quoted above and Theorem 3.3 of Schmidt [Sc1]\nwhich explains that the condition on center of the action is not restrictive.\nWe will now see certain type of action which is needed for our purpose.\n3\n\n\fDefinition 3 We say that the action of a group Γ on a compact group K is distal if\nfor any x ∈ K \\ (e), e is not in the closure of the orbit Γ(x) = {α(x) | α ∈ Γ}. We\nsay that α ∈ Aut (K) is distal on K if the action of {αn | n ∈ Z} on K is distal.\nDistal actions were studied by many in different contexts (cf. [El], [Fu] and [Ra]).\nAs in [Ra] distality plays a useful role in our proofs. It is a well-known interesting fact\nthat if Γ is distal on K, then Γ is distal on K/L for any Γ-invariant normal subgroup\nL of K (cf. [El]) and we quote this result as we use this result often without quoting.\n\n2\n\nErgodic actions\n\nIn this section we prove a few basic results on ergodic actions that are needed for our\npurpose and we provide a proof of these results as we could not locate these results\nin the literature.\nLet K be a compact group. If π is a continuous unitary representation of K, then\nfor any automorphism α of K, απ is defined by\nαπ(x) = π(α−1 (x))\nfor all x ∈ K. It can be easily seen that if π and π ′ are equivalent unitary representations, then α(π) and α(π ′ ) are equivalent. Let [π] be denote the equivalent class of\nunitary representations containing π. Define α[π] = [α(π)] for any automorphism α\non K and any unitary representation π of K. Let K̂ be denote the equivalent classes\nof continuous irreducible unitary representations of K. Then (α, [π]) 7→ α[π] = [α(π)]\ndefines an action of Aut (K) on K̂ and this action is known as the dual action.\nWe now extend Berend's criterion Theorem 2.1 of [Be] to finite-dimensional unitary representations.\nLemma 2.1 Let K be a compact group and Γ be a group of automorphisms of K.\nThen the following are equivalent:\n(i) Γ is ergodic on K;\n(ii) Γ[π] is infinite for any non-trivial [π] ∈ K̂;\n(iii) Γ[π] is infinite for any non-trivial finite-dimensional unitary representation π\nof K.\nProof Equivalence of (i) and (ii) is proved in Theorem 2.1 of [Be] and since all irreducible unitary representation of compact groups are finite-dimensional, (iii) implies\n(ii). So, it is sufficient to prove that (ii) implies (iii). Let π be a finite-dimensional\n4\n\n\funitary representation of K such that Γ[π] is finite. Let Γ1 be the subgroup of Γ\nconsisting of all α ∈ Γ such that α(π) is equivalent to π. Then Γ1 is a subgroup of\nfinite index.\nr\nLet π = ⊕1≤j≤m πj j be the decomposition of π into irreducible unitary representations πj of K. Then for any automorphism α of K, α(π) = ⊕1≤j≤m α(πj )rj and\neach α(πj ) is also irreducible. By uniqueness of decomposition, each α ∈ Γ1 , defines\na permutation on the set of equivalent classes of πj , 1 ≤ j ≤ m (cf. 27.30 of [HR2]).\nThus, there is a subgroup Γ2 of finite index in Γ1 such that α(πj ) is equivalent to πj\nfor all α ∈ Γ2 and all j. Since Γ1 has finite index in Γ and Γ2 has finite index in Γ1 ,\nwe get that Γ2 has finite index in Γ. Using (ii) this implies that each πj is trivial and\nhence π is trivial. Thus, (ii) implies (iii) is proved.\nThe following shows stage ergodicity implying ergodicity.\nLemma 2.2 Let K be a compact group and Γ be a group of automorphisms of K.\nSuppose there is a decreasing sequence (Ki )i≥0 of closed Γ-invariant subgroups with\nK0 = K and ∩Ki = (e) such that Ki is normal in Ki−1 and Γ is ergodic on Ki−1 /Ki .\nThen Γ is ergodic on K.\nProof Let π be an irreducible unitary representation of K such that Γ[π] is finite.\nThen π is finite-dimensional. Suppose π is trivial on Ki . Then let π̃ be the restriction\nof π to Ki−1 . Then π̃ is a unitary representation of Ki−1 /Ki of finite-dimension and\nΓ[π̃] is finite. Since Γ is ergodic on Ki−1 /Ki , it follows from Lemma 2.1 that π̃ is\ntrivial. Thus, π is trivial on Ki−1 if π is trivial on Ki and hence it is sufficient to\nclaim that π is trivial on some Ki .\nSince π is finite-dimensional, there exists n ≥ 1 such that π(K) is a compact and\nhence a closed subgroup of GLn (C). Then by Cartan's Theorem π(K) is a real Lie\ngroup (cf. Part II, Chapter V, Section 9, [Se]). Since each Ki is compact, we get that\n(π(Ki )) is a decreasing sequence of closed subgroups of π(K). Considering dimension\nand using the fact that compact real Lie groups have only finitely many connected\ncomponents, we get that there exists i0 such that π(Ki ) = Ki0 for all i ≥ i0 . Since\n∩Ki = (e), π(Ki ) is trivial for all i ≥ i0 . Thus, π is trivial on Ki0 .\nLemma 2.3 Let K be a compact group and Γ be a group of automorphisms of K.\nSuppose there exists a collection (Ki )i∈I of closed Γ-invariant subgroups K such that\n∪i∈I Ki = K and Γ is ergodic on Ki for all i ∈ I. Then Γ is ergodic on K.\nProof Let π be an irreducible unitary representation of K such that Γ[π] is finite.\nFor i ∈ I, let πi be the restriction of π to Ki . Then πi is a finite-dimensional unitary\nrepresentation of Ki and Γ[πi ] is finite for all i ∈ I. Since Γ is ergodic on Ki , by\nLemma 2.1, we get that πi is trivial and hence π is trivial on Ki for all i ∈ I. Since\n∪Ki = K, π is trivial on K.\n5\n\n\fLemma 2.4 Let K be a compact group and Γ be a group of automorphisms of K.\nSuppose there exist subgroups Γ1 and Γ2 of Γ such that Γ2 is a compact normal subgroup of Γ and Γ = Γ1 Γ2 . Then we have the following:\n(i) Γ2 [π] is finite for any irreducible unitary representation π of K;\n(ii) Γ is ergodic on K if and only if Γ1 is ergodic on K.\nProof Let π be an irreducible unitary representation of K. Let H be the Hilbert\nspace on which π is defined. Let n be the dimension of H. Let Rn be the space of\nall irreducible unitary representations of K of dimension n and An be the equivalent\nclasses of irreducible unitary representations of K of dimension n. Equip Rn with the\nsmallest topology for which the functions π 7→< π(x)u, v > are continuous on Rn for\nall x ∈ K and all u, v ∈ H. Consider the quotient map π 7→ [π] of Rn onto An and\nequip An with the quotient topology from Rn . It is well-known that An is discrete\n(cf. 3.5.8 and 18.4.3 of [Di]). Let αn → α in Aut (K). Then for x ∈ K and u, v ∈ H,\nwe have\n< αn π(x)u, v >=< π(αn−1 x)u, v >→< π(α−1 x)u, v >=< απ(x)u, v >\nas π is continuous and αn−1 (x) → α−1 (x). Thus, αn [π] → α[π] in An . Since Γ2 is\ncompact, we get that Γ2 [π] is compact in An . Since An is discrete, Γ2 [π] is finite.\nThus, proving (i).\nSuppose Γ is ergodic on K. If π is an irreducible unitary representation of K such\nthat Γ1 [π] is finite, then since Γ2 is normal, (i) implies that Γ[π] = Γ2 Γ1 [π] is finite.\nSince Γ is ergodic, π is trivial. Thus, Γ1 is ergodic. This proves (ii).\nWe next prove the existence of largest ergodic subgroup for Γ-actions.\nProposition 2.1 Let K be a compact group and Γ be a group of automorphisms of\nK. Then there is a Z(Γ)-invariant (largest) closed normal subgroup L of K such that\nΓ is ergodic on L and Γ is distal on K/L.\nProof Let A be the collection of all closed normal Γ-invariant subgroups L such\nthat Γ is ergodic on L and elements of A are ordered by inclusion. Since the trivial\nsubgroup is in A, A is non-empty. Let B be a chain in A. Let M = ∪L∈B L. Since\nB is a chain, M is a closed normal Γ-invariant subgroup of K. By Lemma 2.3, Γ is\nergodic on M and hence M ∈ A and L ⊂ M for all L ∈ B. Thus, every chain in\nA has upper bound. By Zorn's Lemma A has a maximal element and let N be the\nmaximal element of A.\nLet Inn (K) be the group of all inner automorphisms of K. Then Inn (K) is a\ncompact normal subgroup of Aut (K). Let Γ̃ be the group generated by Γ and all\n6\n\n\finner automorphisms of K. Then N is Γ̃-invariant and Γ̃ = ΓInn (K). Suppose Ñ\nis a closed Γ̃-invariant subgroup of K containing N such that Γ̃ is ergodic on Ñ /N.\nSince Γ is ergodic on N and Γ ⊂ Γ̃, Γ̃ is ergodic on N. Thus, Γ̃ is ergodic on Ñ (cf.\nLemma 2.2). Now Lemma 2.4 implies that Γ is ergodic on Ñ . Since Ñ is Γ̃-invariant,\nÑ is normal in K and hence Ñ ∈ A and N ⊂ Ñ. Since N is a maximal element in\nA, N = Ñ. By Proposition 2.1 of [Ra], we get that Γ̃ is distal on K/N. Since Γ ⊂ Γ̃,\nΓ is distal on K/N.\nLet β ∈ Z(Γ). Since Γ is ergodic on N, by Theorem 2.1 of [Be], there exists a\nx ∈ N such that Γ(x) is dense in N. So, there exists a sequence (αn ) in Γ such that\nαn (x) → e. Now αn (β(x)) = βαn (x) → e. Since Γ is distal on K/N, β(x) ∈ N. Since\nN is Γ-invariant, this implies that β(α(x)) = α(β(x)) ∈ α(N) = N for all α ∈ Γ.\nSince Γ(x) is dense in N, β(N) ⊂ N. Thus, N is Z(Γ)-invariant.\nIf H is a closed Γ-invariant subgroup of K such that Γ is ergodic on H, then since\nN is normal in K, HN is also a closed Γ-invariant subgroup and hence Γ is ergodic on\nthe closed subgroup HN (cf. Lemma 2.2). This implies that Γ is ergodic on HN/N\nbut Γ is distal on K/N and hence distal on HN/N. Thus, N = HN ⊃ H.\n\n3\n\nDistal actions\n\nIn this section we prove that distality of generating elements is sufficient for distality\nof finitely generated abelian group actions on compact groups which is needed for our\npurpose and which may be of independent interest.\nWe first consider zero-dimensional compact groups. It may be noted that a compact group is zero-dimensional if and only if it is totally disconnected (see 3.5 and\n7.7 of [HR1]).\nLemma 3.1 Let Γ be a finitely generated abelian group of automorphisms of a compact zero-dimensional group K. Suppose α1 , α2 , * * * , αm ∈ Γ generate Γ. Then the\nfollowing are equivalent:\n(i) Γ action on K is distal;\n(ii) αi is distal on K for i = 1, 2, * * * , m;\n(iii) K has arbitrarily small Γ-invariant compact open subgroups.\nProof It is sufficient to prove that (ii) implies (iii). We prove (iii) by induction on\nthe number of generators of Γ. If Γ has only one generator, the result follows from\nProposition 2.1 of [JR] (see also [BW]). If m > 1, then by induction assumption, for\nany compact open subgroup W of K, there exists a compact open subgroup U ⊂ W\n7\n\n\fthat is invariant under α1 , α2 , * * * , αn−1 . By Proposition 2.1 of [JR], there exists a\nk such that ∩ki=0 αni (U) is αn -invariant. Let V = ∩ki=0 αni (U). Then V is invariant\nunder α1 , α2 , * * * , αn−1 as αi s commute and V is invariant under αn also, hence V is\ninvariant under the group generated by α1 , α2 , * * * , αn−1 and αn which is Γ. Thus,\nproving (iii).\nWe next consider abelian groups and we recall a few results on duality of locally\ncompact abelian groups. Let G be a locally compact abelian group. Then any continuous homomorphism of G into the circle group {z ∈ C | |z| = 1} is known as\ncharacter of G. Let Ĝ be the group of characters on G. Then Ĝ with compact-open\ntopology is known as the dual group of G. It is well-known that Ĝ is discrete if and\nd\nonly if G is compact, (Ĝ) ≃ G, and G is metrizable if and only if Ĝ is σ-compact (cf.\nTheorems 12, 23 and 29 of [Mo]). Thus, K is a compact (metrizable) abelian group\nif and only if K̂ is a countable discrete group.\nFor any closed subgroup M of G, consider the subgroup M ⊥ of Ĝ defined by\n⊥\nM = {χ ∈ Ĝ | χ is trivial on M}. It follows from Pontryagin duality theory that\n\\ (cf. Theorem 27 of [Mo]).\nM̂ ≃ Ĝ/M ⊥ and M ⊥ ≃ (G/M)\nFor any bi-continuous automorphism α of G and χ ∈ Ĝ, we define αχ by αχ(g) =\nχ(α−1 (g)) for all g ∈ G and hence χ 7→ αχ defines a bi-continuous automorphism\nof Ĝ which would be called dual automorphism of α. Also, (α, χ) 7→ αχ defines an\naction of Aut (G) on Ĝ and it is known as the dual action.\nWe now apply duality theory of compact abelian groups to obtain the following.\nLemma 3.2 Let K be a compact abelian group and Γ be a group of automorphisms\nof K. Suppose there is compact normal subgroup ∆ of Γ and α1 , * * * , αn are in Γ such\nthat Γ/∆ is abelian and Γ is generated by ∆ and α1 , * * * , αn . Then the following are\nequivalent:\n1. Γ is distal on K;\n2. each αi is distal on K.\nProof Assume that each αi is distal on K. Proof is based on induction on n.\nSuppose L is a non-trivial Γ-invariant subgroup of K. Let A be the dual of L. Let\nΓ1 be the group generated by ∆ and α1 , * * * , αn−1 . Then by induction hypothesis, Γ1\nis distal on K and hence the subgroup A1 = {χ ∈ A | Γ1 (χ) is finite } is non-trivial\n(cf. Proposition 2.1 of [Ra]). Since Γ/∆ is abelian and Γ1 contains ∆, we get that\nαn normalizes Γ1 and hence A1 is αn -invariant. Since αn is distal on K, there is a\nnon-trivial χ ∈ A1 such that αnm (χ) = χ for some m 6= 0 (cf. Proposition 2.1 of [Ra]).\ni\nThis implies that Γ1 αnj (χ) ⊂ ∪m\ni=1 Γ1 (αn (χ)) for all j and hence since χ ∈ A1 and A1\n8\n\n\fis αn -invariant, the orbit Γ(χ) is finite. Thus, Γ is not ergodic on L. It follows from\nProposition 2.1 of [Ra] that Γ is distal on K.\nWe now consider connected groups.\nLemma 3.3 Suppose α1 , * * * , αn ∈ Aut (K) are commuting automorphisms on a\ncompact connected group K. Then the following are equivalent:\n1. each αi is distal on K;\n2. the group generated by α1 , * * * , αn is distal on K.\nProof Assume that each αi is distal on K. Let Γ be the group generated by\nα1 , α2 , * * * , αn . Let x ∈ K be such that e is in the closure of Γ(x). Let T be a maximal\npro-torus in K containing x (cf. Theorem 9.32 of [HM]). Then Aut (K) = Inn (K)Ω\nwhere Inn (K) is the group of inner automorphisms of K and Ω = {τ ∈ Aut (K) |\nτ (T ) = T } (cf. Corollary 9.87 of [HM]). Let βi ∈ Ω be such that αi ∈ Inn (K)βi .\nIf y ∈ K is such that βikn (y) → e, then for each n ≥ 1, αikn = σkn βikn for some\nσkn ∈ Inn (K) as Inn (K) is normal in Aut (K). Since K is compact, Inn (K)\nis compact, hence by passing to a subsequence, if necessary, we may assume that\nσkn → σ ∈ Inn (K) and hence αikn (y) = σkn βikn (y) → σ(e) = e. Since αi is distal,\ny = e. Thus, βi is distal on K and hence in particular, βi is distal on T .\nLet Ω′ be the group generated β1 , * * * , βn . Since Inn (K) is normal, Inn (K)Ω′ is a\ngroup containing αi . Also Ω′ ⊂ Inn (K)Γ, we get that Inn (K)Γ = Inn (K)Ω′ . This\nimplies that\nΩ′ /Inn (K) ∩ Ω′ ≃ Inn (K)Ω′ /Inn (K) ≃ ΓInn (K)/Inn (K) ≃ Γ/Γ ∩ Inn (K).\nSince Γ is abelian, Ω′ /Inn (K) ∩ Ω′ is abelian. It follows since each βi is distal on T\nand from Lemma 3.2 that Ω′ is distal on T .\nSince e is in the closure of Γ(x), there exists ηn ∈ Γ such that ηn (x) → e. Since\nΓ ⊂ Inn (K)Ω′ , there exist τn ∈ Inn (K) and γn ∈ Ω′ such that ηn = τn γn . Since\nInn (K) is compact, we may assume by passing to a subsequence, if necessary that\nτn → τ ∈ Inn (K). Then γn (x) = τn−1 (ηn (x)) → τ −1 (e) = e. Since x ∈ T , γn ∈ Ω′\nand Ω′ is distal on T , we get that x = e. This shows that Γ is distal on K\nWe now consider the general case.\nLemma 3.4 Suppose α1 , * * * , αn ∈ Aut (K) are commuting automorphisms on a\ncompact group K. Then the following are equivalent:\n1. each αi is distal on K;\n9\n\n\f2. the group generated by α1 , * * * , αn is distal on K.\nProof Suppose each αi is distal on K. Let Γ be the group generated by α1 , α2 , * * * , αn .\nLet x ∈ K be such that e is in the closure of Γ(x). Let K0 be the connected component of e in K. Then K0 is a closed normal Γ-invariant subgroup of K and K/K0\nis a zero-dimensional compact group. Each αi is distal on K implies that each αi is\ndistal on K/K0 . It follows from Lemma 3.1 that Γ is distal on K/K0 . Since e is in\nthe closure of Γ(x), x ∈ K0 . Now it follows from Lemma 3.3 that x = e.\nThe following example shows that Lemma 3.4 is not true for any acting group.\nExample 3.1 Let M be any compact group and Γ be a countably infinite group.\nConsider the shift action of Γ on M Γ defined for α ∈ Γ and f ∈ M Γ by αf (β) =\nf (α−1β) for all β ∈ Γ. Suppose f ∈ M Γ is such that f (β) is identity in M for all\nbut finitely many β ∈ Γ. We claim that identity in M Γ is a limit point of Γ(f ). Let\nβ1 , * * * , βn be such that f (β) is identity in M if β 6= βi . Let U be a neighborhood of\nidentity in M. Then for any α1 , * * * , αm , since Γ is infinite, there is a α ∈ Γ such that\nα−1 αi 6∈ {βi } and hence αf (αi ) ∈ U. This shows that the shift action of Γ on M Γ is\nnot distal. If we choose Γ to be finitely generated, infinite and torsion, we get that\neach α ∈ Γ is distal but Γ is not distal (cf. [Go] for existence of such Γ.)\n\n4\n\nBerend's Theorem\n\nWe now prove Berend's Theorem for ergodic Zd -actions on compact groups provided\nthat center of the action has DCC.\nTheorem 4.1 Let K be a compact group and Γ be a finitely generated abelian group\nof automorphisms of K. Suppose Γ is ergodic on K and Z(Γ) has DCC on K. Then\nthere exists α ∈ Γ such that α is ergodic on K. Furthermore, if Γ is generated by\nα1 , * * * , αn , then there exist positive integers i1 , * * * , in such that α1i1 * * * αnin is ergodic\non K.\nWe need the following results.\nLemma 4.1 Let K be a compact group and α, β be two commuting automorphisms\nof K. Suppose α is ergodic on K and β is distal on K. Then αi β j is ergodic on K\nfor all integers i and j with i 6= 0.\nProof Since αi is ergodic on K for any i 6= 0 and β j is distal on K for all j, it\nis sufficient to prove that αβ is ergodic on K. Applying Proposition 2.1 to αβ on\nK, we get that there exists a closed normal Z(α, β) ⊂ Z(αβ)-invariant subgroup K1\n10\n\n\fsuch that αβ is ergodic on K1 and αβ is distal on K/K1. Since α and β commute,\nα, β ∈ Z(α, β), hence K1 is invariant under both α and β. Since β is distal on K, β\nis distal on K/K1 . By Lemma 3.4, the group generated by both αβ and β is distal\non K/K1 . It is easy to see that α is in the group generated by αβ and β, hence α\nis also distal on K/K1 but since α is ergodic on K, α is ergodic on K/K1 and hence\nK = K1 (cf. Proposition 2.1 of [Ra]).\nLemma 4.2 Let α, β be two commuting automorphisms of K such that Z(α, β) has\nDCC. If α is ergodic on K, then αi β is ergodic for all but finitely many i > 0.\nProof We first note that since α and β commute, α, β ∈ Z(α, β). Let K0 = K. We\nnow inductively construct a decreasing sequence (Ki )i≥1 of Z(α, β)-invariant closed\nsubgroups such that Ki is normal in Ki−1 , αj β is ergodic on Ki−1 /Ki for all j 6= i\nand αi β is ergodic on Ki .\nApplying Proposition 2.1 to αβ on K, we get that there exists Z(α, β) ⊂ Z(αβ)invariant closed subgroup K1 such that αβ is ergodic on K1 and αβ is distal on K/K1 .\nSince α is ergodic on K, α is ergodic on K/K1 and hence by Lemma 4.1, we get that\nαi β is ergodic on K/K1 for all i 6= 1.\nIf for j ≤ i, Z(α, β)-invariant closed subgroups Kj are chosen so that αl β is ergodic\non Kj−1 /Kj for all l 6= j and αj β is ergodic on Kj . We now choose Ki+1 . Applying\nProposition 2.1 to αi+1 β on Ki , we get that there exists a Z(α, β) ⊂ Z(αi+1 β)invariant normal subgroup Ki+1 of Ki such that αi+1 β is ergodic on Ki+1 and distal\non Ki /Ki+1 . Since αi β is ergodic on Ki , αi β is ergodic on Ki /Ki+1 and hence β −1α−i is\nergodic on Ki /Ki+1 . Since αi+1 β is distal Ki /Ki+1 , by Lemma 4.1, α = β −1 α−i αi+1 β\nis ergodic on Ki /Ki+1 . Again by Lemma 4.1, we get that αj β is ergodic on Ki /Ki+1\nfor all j 6= i + 1. Thus, there exists a decreasing sequence (Ki )i≥1 of Z(α, β)-invariant\nclosed subgroups such that Ki is normal in Ki−1 , αj β is ergodic on Ki−1 /Ki for all\nj 6= i and αi β is ergodic on Ki .\nSince Z(α, β) has DCC on K, there exists a i such that Ki = Kj for all j > i.\nThis implies that for j > i, αj β is ergodic on Km−1 /Km for 1 ≤ m ≤ i and αj β is\nergodic on Kj = Ki . Thus, by Lemma 2.2 we get that αj β is ergodic on K for all\nj > i.\nProposition 4.1 Let K be a compact group and Γ be a finitely generated group of\ncommuting automorphisms of K generated by α1 , * * * , αn . Then there exists a series\n(e) = K0 ⊂ K1 ⊂ * * * ⊂ Kn ⊂ K of closed normal Z(Γ)-invariant subgroups such that\n1. αi is ergodic on Ki /Ki−1 and distal on K/Ki ,\n2. Γ is ergodic on Kn and distal on K/Kn .\nMoreover, if Γ is ergodic on K, K = Kn .\n11\n\n\fProof We first observe that since Γ is abelian, Γ ⊂ Z(Γ) and hence any Z(Γ)invariant subgroup is also Γ-invariant. It follows from Proposition 2.1 that there\nexists a closed normal Z(Γ) ⊂ Z(α1 )-invariant subgroup K1 such that α1 is ergodic\non K1 and distal on K/K1 . For i ≥ 1 and for all 1 ≤ j ≤ i, if closed normal Z(Γ)invariant subgroups Kj are chosen such that αj is ergodic on Kj /Kj−1 and distal\non K/Kj . We now choose Ki+1 . Applying Proposition 2.1 to αi+1 on K/Ki , there\nexists a closed normal Z(Γ) ⊂ Z(αi+1 )-invariant subgroup Ki+1 containing Ki such\nthat αi+1 is ergodic on Ki+1 /Ki and αi+1 is distal on K/Ki+1 . Thus, we have closed\nnormal Z(Γ)-invariant subgroups (e) = K0 ⊂ K1 ⊂ * * * ⊂ Kn ⊂ K such that αi is\nergodic on Ki /Ki−1 and distal on K/Ki .\nSince αi ∈ Γ, Γ is ergodic on Ki /Ki−1 for all 1 ≤ i ≤ n, hence by Lemma 2.2, Γ\nis ergodic on Kn .\nSince K/Kn is a quotient of K/Ki for all 1 ≤ i ≤ n, each αi is distal on K/Kn .\nThus by Lemma 3.4, Γ is distal on K/Kn .\nIf Γ is ergodic on K, then Γ is ergodic on K/Kn but Γ is distal on K/Kn , hence\nK = Kn (cf. Proposition 2.1 of [Ra]).\nProof of Theorem 4.1 Let α1 , α2 , * * * , αn ∈ Γ be a set of generators of Γ. The\nproof is by induction on n. Suppose Γ has more than one-generator. By Proposition\n4.1, there exist closed normal Γ-invariant subgroups (e) = K0 ⊂ K1 ⊂ * * * ⊂ Kn = K\nsuch that αi is ergodic on Ki /Ki−1 and αi is distal on K/Ki .\nSince αn is ergodic on K/Kn−1 and αn−1 is distal on K/Kn−1, Lemma 4.1 implies\nj\nj\nis\nis ergodic on K/Kn−1 for all i and j with i 6= 0. In particular, αn αn−1\nthat αni αn−1\nergodic on K/Kn−1 for all j.\nSince Z(Γ) ⊂ Z(αn , αn−1 ), Z(αn , αn−1 ) has DCC on K. Since αn−1 is ergodic on\nj\nKn−1 /Kn−2 , applying Lemma 4.2 to αn−1 and αn on Kn−1 /Kn−2 , we get that αn αn−1\nj\nis ergodic\nis ergodic on Kn−1 /Kn−2 for all but finitely many j > 0. Since αn αn−1\nj\non K/Kn−1 for all j, we get that αn−1\nαn is ergodic on K/Kn−2 for some j > 0 (cf.\nLemma 2.2).\nj\nLet ∆ be the group generated by α1 , * * * , αn−2 , αn−1\nαn . Then Z(∆) contains Z(Γ)\nand hence Z(∆) has DCC on K. Since each αi is ergodic on Ki /Ki−1 , we get that\n∆ is ergodic on Ki /Ki−1 for all 1 ≤ i ≤ n − 2, hence by Lemma 2.2, ∆ is ergodic\nj\non Kn−2 . Since αn−1\nαn is ergodic on K/Kn−2 , we get that ∆ is ergodic on K (cf.\nLemma 2.2). Since ∆ is generated by n − 1 elements, result follows from induction\nassumption.\nThe next result is a consequence of a classical result of Rokhlin [Ro] and Theorem\n4.1.\n\n12\n\n\fCorollary 4.1 Let K be a compact group and Γ be a finitely generated group of\ncommuting automorphisms of K. Suppose Z(Γ) has DCC on K. Then the following\nare equivalent:\n(1) Γ is ergodic on K;\n(2) there exists α ∈ Γ such that α is mixing of all orders.\nThe following results and results in section 5 show that the additional condition\non Z(Γ) in Theorem 4.1 is not restrictive.\nCorollary 4.2 Let K be a compact group. If the center of Aut (K) has DCC on K,\nthen any ergodic action of finitely generated abelian group contains ergodic automorphisms.\nProof Since the center of Aut (K) is contained in Z(Γ) for any subgroup Γ of\nautomorphisms, Z(Γ) has DCC on K if the center of Aut (K) has DCC on K. Now\nthe result follows from Theorem 4.1.\nLet M be a compact group and Γ be a countably infinite group. Consider the\nshift action of Γ on M Γ defined for α ∈ Γ and f ∈ M Γ by αf (β) = f (α−1 β) for all\nβ ∈ Γ. In this situation we have the following:\nTheorem 4.2 Let Γ be a finitely generated abelian group and M be a compact Lie\ngroup. Let K be a shift-invariant subgroup M Γ . Suppose the action of a finitely\ngenerated abelian group ∆ on K commutes with the shift action of Γ on K. Then ∆\nis ergodic on K implies that ∆ contains ergodic automorphisms.\nProof By Theorem 3.2 of [KS] we get that the shift action of Γ has DCC on M Γ\nand hence on K. Since the action of ∆ on K commutes with the shift action on K,\nZ(∆) has DCC. Now the result follows from Theorem 4.1.\n\n5\n5.1\n\nSome compact abelian groups\nDuals of countable vector spaces\n\nLet F be a countable field with discrete topology. Let F∗ denote the multiplicative\ngroup of non-zero elements in F and Fr be the vector space over F of dimension r ≥ 1.\nThen Fr is countable discrete group. Let Kr be the dual of Fr . Then Kr is a compact\ngroup. Let AutF (Fr ) be the group of all F-linear transformation on Fr and AutF (Kr )\nbe the corresponding group of dual automorphisms on Kr . In this situation we have\nthe following:\n13\n\n\fTheorem 5.1 Let F be a countable field with discrete topology. Let Kr be the dual\nof Fr for some integer r > 0. Then we have the following:\n(1) the center of AutF (Kr ) has DCC;\n(2) if Γ is a finitely generated abelian subgroup of AutF (Kr ) such that Γ is ergodic,\nthen Γ contains ergodic automorphisms.\nRemark We will now show by an example that finite generation condition on Γ in\nTheorem 5.1 (2) can not be relaxed. Let p be a prime number. Then for any n ≥ 1,\nwe can find a unique finite field Fn with pn number of elements and Fn contains Fm if\nand only if m divides n (cf. Corollary 2, Section 1, Chapter 1, [We]). Let F = ∪∞\nk=1 Fnk\nfor some fixed n > 1. Then F is a countably infinite field. Consider the F∗ -action on\nF by scalar multiplication. Then for any non-zero a ∈ F, F ∗ a is infinite. Thus, the\ndual action of F∗ on the dual K1 of F is ergodic but every element in F∗ has finite\norder and hence no element of F∗ is ergodic.\nProof Consider the F∗ -action on Fr given by q(qi ) = (qqi ) for all q ∈ F∗ and\n(qi ) ∈ Fr . It can be easily seen that F∗ is in the center of AutF (Fr ). If (Ln )\nis a decreasing sequence of closed subgroups in Kr that are F∗ -invariant, then let\nAn = {χ ∈ Fr | χ is trivial on Ln }. Then (An ) is a increasing sequence of\nsubgroups of Fr that are F∗ - invariant. Since any subgroup that is F∗ -invariant is\na F-subspace of Fr , (An ) is a increasing sequence of F-subspaces of Fr . Since Fr is\nr /A ), we get that\nfinite dimensional, An = Am for all large n and m. Since Ln = (F\\\nn\nLn = Lm for all large n and m. Thus, the center of AutF (Kr ) has DCC on Kr .\nLet Γ be a finitely generated abelian subgroup of AutF (Kr ). Then Z(Γ) contains\nthe center of AutF (Kr ). Since the center of AutF (Kr ) has DCC, we get that Z(Γ)\nhas DCC. Now the result follows from Theorem 4.1.\nIf we take K = Q, we may obtain Berend's Theorem of [Be] for actions of automorphisms as shown below.\nTheorem 5.2 Let K be a compact connected finite-dimensional abelian group and Γ\nbe a group of commuting automorphisms of K. If Γ is ergodic on K, then there exists\nα ∈ Γ such that α is ergodic on K.\nProof Let K be a compact connected abelian group of finite-dimension. Let r be\nthe dimension of K. Let Br be the dual of the discrete group Qr . Then K is a\nquotient of Br and any automorphism of K lifts to an automorphism of Br . A group\nof automorphisms is ergodic on K if and only if the corresponding group of lifts is\nergodic on Br (cf. [Be] or [Ra]). Thus, we may assume that K = Br .\n14\n\n\fLet Γ be a group of commuting automorphisms of Br and Γ is ergodic on Br . By\nLemma 5.9 of [Ra], there exist a series (e) = K0 ⊂ K1 ⊂ * * * ⊂ Km = Br of closed\nconnected Γ-invariant subgroups with each Ki ≃ Bri and automorphisms α1 , * * * , αm\nin Γ such that αi is ergodic on Ki /Ki−1 . This implies that the group generated by\nα1 , * * * , αm is ergodic on Km = Br (cf. Lemma 2.2). Thus, replacing Γ by its subgroup\ngenerated by α1 , * * * , αm , if necessary, we may assume that Γ is a finitely generated\nabelian group.\nIt is easy to see that any homomorphism of Qr into Qr is a Q-linear transformation.\nThis shows that Aut (Br ) ≃ AutQ (Br ). Now the result follows from Theorem 5.1.\nRemark Using the results proved here we can prove Theorem 5.2 for commuting\nsemigroup of epimorphisms of compact connected finite-dimensional abelian groups\n(as lifts of epimorphisms are automorphisms) which would retrieve Berends result\nin its full generality but as this would cause a digression we would not go into the\ndetails.\n\n5.2\n\nDuals of modules\n\nWe now discuss compact abelian groups arising as duals of modules over rings: see\n[Sh] for any details on rings and modules. Let R be a commutative ring and for\n±1\nany d ≥ 1, let R = Rd = R[u±1\n1 , * * * , ud ] be the ring of Laurent polynomials in the\ncommuting variables u1 , * * * , ud with coefficients in R. Let M be a R-module. Let\nX M be the dual of M. Then X M is a compact abelian group.\nFor n = (n1 , * * * , nd ) ∈ Zd we define an automorphism αn of M by\nαn a = un1 1 . . . und d a\nfor all a ∈ M. By considering the dual we obtain an automorphism αn of X M . It\ncan be easily seen that n 7→ αn defines a Zd -action on X M .\nSuppose the additive structure of R is cyclic. Then it can be easily seen that the\nafore-defined Zd -action has DCC on X M if and only if M is a Noetherian R-module:\na module A over a ring Q is called a Noetherian module if any increasing sequence\nA1 ⊂ A2 ⊂ * * * ⊂ An ⊂ An+1 ⊂ * * * of submodules is finite, that is, An = Am for large\nn and m and a ring Q is called a Noetherian ring if Q is a Noetherian Q-module.\nIf R = Z, Theorem 11.2 of [KS] proved that Zd -action defined as above has DCC\non X M if (and only if) M is a finitely generated R-module. Theorem 3.3 of [Sc1] has\nshown that if R = Z, M is a finitely generated R-module and the Zd -action defined\nas above is ergodic on X M , then there is a n such that αn is ergodic on X M . In this\nrespect we prove the following using Theorem 4.1 when the additive group structure\nof R is a cyclic group.\n15\n\n\fTheorem 5.3 Assume that the additive group structure of R is cyclic and M is a\nfinitely generated R-module. Then we have the following:\n(1) {αn | n ∈ Zd } has DCC on X M ;\n(2) if Γ is a finitely generated abelian group of R-module homomorphisms of M and\nthe dual action of Γ is ergodic on X M , then there is a α ∈ Γ such that the dual\naction of α is ergodic on X M .\nRemark If we take R = Z and Γ = {αn | n ∈ Zd }, we retrieve Theorem 3.3 of [Sc1].\nProof We first claim that M is Noetherian. Since the additive structure of R is\ncyclic, R is either finite or R = Z, hence R is Noetherian. By Hilbert's Basis Theorem,\nthe polynomial ring R[X1 , * * * , Xd , Y1 , * * * , Yd ] is also Noetherian (cf. 8.7 and 8.8 of\n[Sh]). Let f : R[X1 , * * * , Xd , Y1 , * * * , Yd ] → R be the map defined f (Xi ) = ui and\nf (Yi ) = u−1\nfor all 1 ≤ i ≤ d. Then f is a surjective ring homomorphism and hence\ni\nby Lemma 8.2 of [Sh], we get that R is a Noetherian ring. Since M is a finitely\ngenerated R-module, we get from Corollary 7.22 (i) of [Sh] that M is Noetherian.\nSince Zd -action having DCC on X M is equivalent to M being Noetherian, (1) is\nproved.\nLet α be a R-module homomorphism. Then for any n = (n1 , * * * , nd ) ∈ Zd ,\nααn (a) = α(un1 1 * * * und d a) = un1 1 * * * und d α(a) = αn α(a)\nfor all a ∈ M. Thus, Z(Γ) contains all αn and hence by (1), Z(Γ) has DCC. Now (2)\nfollows from Theorem 4.1.\nRemark Let M be free R-module of rank k (we may take M to be direct sum of\nk-copies of R). Then the group of invertible R-module homomorphisms of M, can\nbe realized as invertible matrices with coefficients from the ring R. Thus, Γ in (2) of\nTheorem 5.3 may be taken as a finitely generated abelian group of invertible matrices\nwith coefficients from R.\nWe now give one more variation of examples considered in [KS]. Let F be a\n±1\ncountable field and for any d ≥ 1, let S = F[u±1\n1 , * * * , ud ] be the ring of Laurent\npolynomials in the commuting variables u1 , * * * , ud with coefficients in F. Let N be a\nS-module. Let K N be the dual of N . Then K N is a compact abelian group.\nConsider the Zd -action defined as above, that is, for any n = (n1 , * * * , nd ) ∈ Zd we\ndefine an automorphism αn of N by\nαn a = un1 1 . . . und d a\nfor all a ∈ N .\n16\n\n\fLet ∆ = F∗ × Zd . For (q, n) ∈ ∆ = F∗ × Zd , we define α(q,n) by\nα(q,n) (a) = qαn a\nfor all a ∈ N . By considering the dual, we get an automorphism of K N . Thus, we\nget an action of ∆ on K N .\nIt can be easily seen that ∆ having DCC on K N is equivalent to N being a\nNoetherian S-module. In this situation we have the following.\nTheorem 5.4 Suppose N is finitely generated as a S-module. Then we have the\nfollowing:\n(1) ∆ has DCC on K N , the dual of N .\n(2) If Γ is a finitely generated abelian group of S-module homomorphisms of N and\nthe dual action of Γ is ergodic on K N , then there is a α ∈ Γ such that the dual\naction of α is ergodic on K N .\n(3) If Γ = {αn | n ∈ Zd }, then the dual action of Γ is ergodic on K N implies that\nthere is a n ∈ Zd such that the dual action of αn is ergodic on K N .\nProof Since ∆ having DCC on K N is equivalent to N being Noetherian, it is\nsufficient to show that N is a Noetherian module over the ring S if N is finitely\ngenerated.\nSince F is a field, it is easy to see that F is a Noetherian ring as F is the only nonzero ideal. By Hilbert's Basis Theorem, the polynomial ring F [X1 , * * * , Xd , Y1, * * * , Yd ]\nis also Noetherian (cf. 8.7 and 8.8 of [Sh]). Now Xi 7→ ui and Yi 7→ u−1\ni induces a ring\n±1\n±1\nhomomorphism of F [X1 , * * * , Xd , Y1, * * * , Yd ] onto S = F[u1 , * * * , ud ] and hence by\nLemma 8.2 of [Sh], we get that S is a Noetherian ring. Since N is a finitely generated\nS-module, Corollary 7.22 (i) of [Sh] implies that N is Noetherian. This proves (1).\nIt is easy to see that any S-module homomorphism commutes with ∆-action and\nhence by (1) Z(Γ) has DCC if Γ is a group of S-module homomorphisms. Thus, (2)\nfollows from Theorem 4.1.\nSince each αn is a S-module homomorphism, (3) follows from (2).\nWe would like to note that compact groups considered in Theorem 5.1 are finitedimensional whereas compact groups considered in this subsection need not be of\nfinite-dimension. In fact, if R = Z or F = Q and modules are free-modules, then\ncompact groups in Theorems 5.3 and 5.4 are infinite-dimensional.\n\n17\n\n\fReferences\n[BW]\n\nU.Baumgartner and G. Willis, Contraction groups and scales of automorphisms of totally\ndisconnected locally compact groups, Israel J. Math. 142 (2004), 221–248.\n\n[Be]\n\nD. Berend, Ergodic semigroups of epimorphisms, Trans. Amer. Math. Soc. 289 (1985), no.\n1, 393–407.\n\n[BG]\n\nV. Bergelson and A. Gorodin, Ergodicity and mixing of non-commuting epimorphisms. Proc.\nLond. Math. Soc. (3) 95 (2007), 329–359.\n\n[Di]\n\nJ. Dixmier, C ∗ -algebras. Translated from the French by Francis Jellett. North-Holland Mathematical Library, Vol. 15. North-Holland Publishing Co., Amsterdam-New York-Oxford,\n1977.\n\n[El]\n\nR. Ellis, Distal transformation groups. Pacific J. Math. 8 1958 401–405.\n\n[Fu]\n\nH. Furstenberg, The structure of distal flows. Amer. J. Math. 85 (1963), 477–515.\n\n[Go]\n\nE. S. Golod, On nil-algebras and finitely approximable p-groups, Izv. Akad. Nauk SSSSR\n28 (1964), 273-276.\n\n[HR1]\n\nE. Hewit and K. A. Ross, Abstract harmonic analysis. Vol. I: Structure of topological\ngroups. Integration theory, group representations. Die Grundlehren der mathematischen\nWissenschaften, Bd. 115 Academic Press, Inc., Publishers, New York; Springer-Verlag,\nBerlin-Gttingen-Heidelberg, 1963\n\n[HR2]\n\nE. Hewit and K. A. Ross, Abstract harmonic analysis. Vol. II: Structure and analysis for\ncompact groups. Analysis on locally compact Abelian groups. Die Grundlehren der mathematischen Wissenschaften, Band 152 Springer-Verlag, New York-Berlin 1970.\n\n[HM]\n\nK. H. Hofmann and S. A. Morris, The structure of compact groups. A primer for the\nstudent-a handbook for the expert. de Gruyter Studies in Mathematics, 25. Walter de\nGruyter & Co., Berlin, 1998.\n\n[JR]\n\nW. Jaworksi and C. R. E. Raja, The Choquet-Deny theorem and distal properties of totally\ndisconnected locally compact groups of polynomial growth, New York J. Math. 13 (2007),\n159-174.\n\n[KS]\n\nB. Kitchens and K. Schmidt, Automorphisms of compact groups, Ergodic Theory Dynam.\nSystems 9 (1989), 691–735.\n\n[Mo]\n\nS. A. Morris, Pontryagin duality and the structure of locally compact abelian groups. London\nMathematical Society Lecture Note Series, No. 29. Cambridge University Press, CambridgeNew York-Melbourne, 1977.\n\n[Ra]\n\nC. R. E. Raja, Distal actions and ergodic actions on compact groups, preprint, avilable at\nhttp://www.isibang.ac.in/∼creraja/pp/de.pdf\n\n[Ro]\n\nV. A. Rohlin, On endomorphisms of compact commutative groups, Izvestiya Akad. Nauk\nSSSR. Ser. Mat. 13 (1949), 329–340.\n\n18\n\n\f[Sc1]\n\nK. Schmidt, Automorphisms of compact abelian groups and affine varieties, Proc. London\nMath. Soc. 61 (1990), 480–496.\n\n[Sc2]\n\nK. Schmidt, Algebraic ideas in ergodic theory, CBMS Regional Conference Series in Mathematics, 76. Published for the Conference Board of the Mathematical Sciences, Washington,\nDC; by the American Mathematical Society, Providence, RI, 1990.\n\n[Sc3]\n\nK. Schmidt, Dynamical systems of algebraic origin. Progress in Mathematics, 128. Birkhuser\nVerlag, Basel, 1995.\n\n[Se]\n\nJ. P. Serre, Lie algebras and Lie groups. 1964 lectures given at Harvard University. Second\nedition. Lecture Notes in Mathematics, 1500. Springer-Verlag, Berlin, 1992.\n\n[Sh]\n\nR. Y. Sharp, Steps in commutative algebra. London Mathematical Society Student Texts,\n19. Cambridge University Press, Cambridge, 1990.\n\n[We]\n\nA. Weil, Basic number theory. Reprint of the second (1973) edition. Classics in Mathematics.\nSpringer-Verlag, Berlin, 1995.\n\nC. Robinson Edward Raja\nStat-Math Unit\nIndian Statistical Instittue\n8th Mile Mysore Road\nBangalore 560 059. India\ne-mail: creraja@isibang.ac.in\n\n19\n\n\f"}