{"id": "http://arxiv.org/abs/1009.4769v1", "guidislink": true, "updated": "2010-09-24T06:38:15Z", "updated_parsed": [2010, 9, 24, 6, 38, 15, 4, 267, 0], "published": "2010-09-24T06:38:15Z", "published_parsed": [2010, 9, 24, 6, 38, 15, 4, 267, 0], "title": "Investigating The Uncertainty On The BAO Scale Measured From Future\n  Photometric And Spectroscopic Surveys", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1009.0465%2C1009.5834%2C1009.3787%2C1009.2350%2C1009.2627%2C1009.0266%2C1009.5288%2C1009.1590%2C1009.0575%2C1009.6014%2C1009.3658%2C1009.4216%2C1009.3762%2C1009.2002%2C1009.0018%2C1009.2546%2C1009.2474%2C1009.2194%2C1009.1987%2C1009.0151%2C1009.1438%2C1009.3706%2C1009.4689%2C1009.4686%2C1009.2380%2C1009.6017%2C1009.3133%2C1009.0397%2C1009.6196%2C1009.1652%2C1009.6190%2C1009.4248%2C1009.3002%2C1009.5177%2C1009.4134%2C1009.3324%2C1009.4811%2C1009.5914%2C1009.0619%2C1009.0782%2C1009.4501%2C1009.0354%2C1009.5118%2C1009.4086%2C1009.3695%2C1009.5940%2C1009.1564%2C1009.1505%2C1009.5815%2C1009.3718%2C1009.0047%2C1009.3303%2C1009.2805%2C1009.3196%2C1009.4000%2C1009.1856%2C1009.4769%2C1009.6011%2C1009.3095%2C1009.2927%2C1009.2383%2C1009.6021%2C1009.3031%2C1009.1325%2C1009.2563%2C1009.2728%2C1009.4651%2C1009.5186%2C1009.3527%2C1009.1141%2C1009.0829%2C1009.3770%2C1009.2011%2C1009.3636%2C1009.0970%2C1009.5941%2C1009.5585%2C1009.1043%2C1009.0747%2C1009.0291%2C1009.5901%2C1009.3887%2C1009.2799%2C1009.4756%2C1009.1487%2C1009.0303%2C1009.2255%2C1009.5104%2C1009.2140%2C1009.4445%2C1009.0653%2C1009.6116%2C1009.2581%2C1009.0772%2C1009.2975%2C1009.3648%2C1009.4706%2C1009.3444%2C1009.2089%2C1009.2416%2C1009.2246&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Investigating The Uncertainty On The BAO Scale Measured From Future\n  Photometric And Spectroscopic Surveys"}, "summary": "The Large Synoptic Survey Telescope (LSST) is a wide (20,000 sq.deg.) and\ndeep ugrizy imaging survey which will be sited at Cerro Pachon in Chile. A\nmajor scientific goal of LSST is to constrain dark energy parameters via the\nbaryon acoustic oscillation (BAO) signal. Crucial to this technique is the\nmeasurement of well-understood photometric redshifts, derived from the survey\nugrizy imaging. Here we present the results of the effect of simulated\nphotometric redshift (PZ) errors on the reconstruction of the BAO signal. We\ngenerate many \"Monte Carlo\" simulations of galaxies from a model power spectrum\nusing Fast Fourier Transform techniques. Mock galaxy properties are assigned\nusing an algorithm that reproduces observed luminosity-color-redshift\ndistributions from the GOODS survey. We also compare these results to those\nexpected from a possible future spectroscopic survey such as BigBOSS.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1009.0465%2C1009.5834%2C1009.3787%2C1009.2350%2C1009.2627%2C1009.0266%2C1009.5288%2C1009.1590%2C1009.0575%2C1009.6014%2C1009.3658%2C1009.4216%2C1009.3762%2C1009.2002%2C1009.0018%2C1009.2546%2C1009.2474%2C1009.2194%2C1009.1987%2C1009.0151%2C1009.1438%2C1009.3706%2C1009.4689%2C1009.4686%2C1009.2380%2C1009.6017%2C1009.3133%2C1009.0397%2C1009.6196%2C1009.1652%2C1009.6190%2C1009.4248%2C1009.3002%2C1009.5177%2C1009.4134%2C1009.3324%2C1009.4811%2C1009.5914%2C1009.0619%2C1009.0782%2C1009.4501%2C1009.0354%2C1009.5118%2C1009.4086%2C1009.3695%2C1009.5940%2C1009.1564%2C1009.1505%2C1009.5815%2C1009.3718%2C1009.0047%2C1009.3303%2C1009.2805%2C1009.3196%2C1009.4000%2C1009.1856%2C1009.4769%2C1009.6011%2C1009.3095%2C1009.2927%2C1009.2383%2C1009.6021%2C1009.3031%2C1009.1325%2C1009.2563%2C1009.2728%2C1009.4651%2C1009.5186%2C1009.3527%2C1009.1141%2C1009.0829%2C1009.3770%2C1009.2011%2C1009.3636%2C1009.0970%2C1009.5941%2C1009.5585%2C1009.1043%2C1009.0747%2C1009.0291%2C1009.5901%2C1009.3887%2C1009.2799%2C1009.4756%2C1009.1487%2C1009.0303%2C1009.2255%2C1009.5104%2C1009.2140%2C1009.4445%2C1009.0653%2C1009.6116%2C1009.2581%2C1009.0772%2C1009.2975%2C1009.3648%2C1009.4706%2C1009.3444%2C1009.2089%2C1009.2416%2C1009.2246&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The Large Synoptic Survey Telescope (LSST) is a wide (20,000 sq.deg.) and\ndeep ugrizy imaging survey which will be sited at Cerro Pachon in Chile. A\nmajor scientific goal of LSST is to constrain dark energy parameters via the\nbaryon acoustic oscillation (BAO) signal. Crucial to this technique is the\nmeasurement of well-understood photometric redshifts, derived from the survey\nugrizy imaging. Here we present the results of the effect of simulated\nphotometric redshift (PZ) errors on the reconstruction of the BAO signal. We\ngenerate many \"Monte Carlo\" simulations of galaxies from a model power spectrum\nusing Fast Fourier Transform techniques. Mock galaxy properties are assigned\nusing an algorithm that reproduces observed luminosity-color-redshift\ndistributions from the GOODS survey. We also compare these results to those\nexpected from a possible future spectroscopic survey such as BigBOSS."}, "authors": ["Alexandra Abate", "Alexia Gorecki", "Reza Ansari", "Aurelien Barrau", "Sylvain Baumont", "Laurent Derome", "Marc Moniez"], "author_detail": {"name": "Marc Moniez"}, "author": "Marc Moniez", "arxiv_comment": "5 pages, 3 figures, Proceedings of the conference \"45th Rencontres de\n  Moriond\" - Cosmology Session, La Thuile, Val d'Aosta, Italy, March 13 - 20,\n  2010", "links": [{"href": "http://arxiv.org/abs/1009.4769v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1009.4769v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "astro-ph.CO", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph.CO", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1009.4769v1", "affiliation": "LAL, Orsay", "arxiv_url": "http://arxiv.org/abs/1009.4769v1", "journal_reference": null, "doi": null, "fulltext": "arXiv:1009.4769v1 [astro-ph.CO] 24 Sep 2010\n\nInvestigating The Uncertainty On The BAO Scale Measured From Future\nPhotometric And Spectroscopic Surveys\nAlexandra Abate, Reza Ansari & Marc Moniez\nLaboratoire de l'Accélérateur Linéaire, IN2P3-CNRS, Université de Paris-Sud, BP. 34, 91898 Orsay\nCedex, France\nAlexia Gorecki, Aurélien Barrau, Sylvain Baumont & Laurent Derome\nLaboratoire de Physique Subatomique et de Cosmologie, CNRS/UJF/INPG 53, rue des Martyrs 38026\nGrenoble Cedex, France\nThe Large Synoptic Survey Telescope (LSST) is a wide (20,000 sq.deg.) and deep ugrizy\nimaging survey which will be sited at Cerro Pachon in Chile. A major scientific goal of LSST is\nto constrain dark energy parameters via the baryon acoustic oscillation (BAO) signal. Crucial\nto this technique is the measurement of well-understood photometric redshifts, derived from\nthe survey ugrizy imaging. Here we present the results of the effect of simulated photometric\nredshift (PZ) errors on the reconstruction of the BAO signal. We generate many \"Monte\nCarlo\" simulations of galaxies from a model power spectrum using Fast Fourier Transform\ntechniques. Mock galaxy properties are assigned using an algorithm that reproduces observed\nluminosity-color-redshift distributions from the GOODS survey. We also compare these results\nto those expected from a possible future spectroscopic survey such as BigBOSS.\n\n1\n\nIntroduction\n\nIn the early universe, when the temperature is high enough so the photons and baryons are\ncoupled through Compton scattering in a plasma, the cosmological density fluctuations create\nsound waves which propagate through this plasma. At around a redshift of 1000 the temperature\nof the universe drops to a level at which the Compton scattering is no longer efficient, effectively\nstalling the sound waves at the epoch of recombination. The distance these sound waves could\ntravel in the time between the formation of the perturbations and the epoch of recombination\nimprinted a characteristic scale into the spectrum of density perturbations. Because the universe\nhas a significant fraction of baryons, theory predicts that this characteristic scale will also be\nimprinted in the late-time spectrum of density perturbations. Since galaxies are expected to\nform in the regions that are overdense in baryons and dark matter, and because this is driven\nby where the initial perturbations were, there should be an small excess of galaxies at this\ncharacteristic scale away from other galaxies. At recombination this scale is roughly 150 Mpc,\nand it appears in the power spectrum of density fluctuations as a damped harmonic sequence, a\nseries of wiggles, which are what is known as the baryon acoustic oscillations (BAO).The position\nof these wiggles measured as a function of redshift reveals information about dark energy.\nIt has been shown1,2 that it is possible to measure BAO using a photometric redshift survey.\nThe advantage of using photometric redshifts over spectroscopic redshifts is that they are much\nless expensive (time consuming) to obtain and so a much larger volume of the universe can be\n\n\f−2\n\n0.07\n\n10\n\n6\n\n0.06\n\n5\n\n−3\n\n0.05\n\n4\n3\n\n0.04\nσz\n\nφ(M)\n\nrelative flux\n\n10\n\n−4\n\n10\n\n0.03\n\n2\n\n0.02\n\n−5\n\n10\n\nAll\nEarly\nLate\nStarburst\n\n1\n0\n\n−6\n\n−7\n\n−6\n\n10\n\n10\nwavelength (m)\n\n10\n−24\n\n−22\n−20\n−18\n−16\nabsolute magnitude (B band)\n\n0.01\n0\n0.6\n\n0.8\n\n1\n\nzc\n\n1.2\n\n1.4\n\nFigure 1: LHS : Interpolated SED library, all normalised to the same value at 0.4μm; Center : GOODS typespecific luminosity functions at 0.75 < z < 1; RHS : Fitted standard deviation of photometric redshift errors in\neach redshift slice of the simulation.\n\nsurveyed. Since the BAO feature is observed on fairly large scales, a volume even larger than\nthis must be surveyed in order to obtain a measurement with enough statistical significance\nto measure the cosmological parameters precisely. The disadvantage of photometric redshifts\nis that they have large errors and the exact distribution of these errors is currently not well\nunderstood. Here we present an early result from our simulations of the performance of LSST,\na future photometric wide-field survey, in measuring the BAO signal.\n2\n\nThe Large Synoptic Survey Telescope\n\nThe Large Synoptic Survey Telescope (LSST) will be the first of a next generation of ground\nbased optical telescopes. It seeks to investigate important scientific problems of the next decade:\nprobing dark energy and dark matter, taking an inventory of the Solar System, exploring the\ntransient optical sky, and understanding galaxy formation and the structure of the Milky Way.\nAll these diverse science goals require wide-field repeated deep imaging of the sky in many optical\nbands.\nLSST will carry out such a survey by imaging 20,000 deg2 of the sky in six broad photometric\nbands ugrizy, imaging each region of sky roughly 2000 times (1000 pairs of back-to-back 15-sec\nexposures) over a ten-year survey lifetime. After 10 years, with 1000 visits (2x15s exposures),\nit is anticipated LSST will yield a coadded map of the sky with a 5-σ depth for point sources of\nr ∼ 27.5. For more details on the science goals and capabilities that will be provided by LSST,\nsee the LSST Science Book3 .\n3\n\nSimulation of mock galaxy catalogs\n\nWe take a model linear theory matter power spectrum and generate Gaussian realisations of\nover-densities. Each over-density is assigned Ni galaxies where Ni depends on the value of\nthe over-density and the expected mean number density of galaxies at the relevant redshift.\nThe mean number density of galaxies as a function of redshift is calculated by integrating the\nGOODS luminosity functions (LFs)4 , shown in the center panel of Fig. 1.\nEach galaxy in the simulation is assigned an absolute magnitude and a broad spectral type:\nearly-type, late-type or starburst. This is done by creating a probability distribution using the\ngalaxy-type specific LFs measured from GOODS4 , again see the center panel of Fig. 1. We then\ncreate a library of spectral energy densities (SEDs) of different galaxy types by interpolating\nthe CWW5 and Kinney6 empirical galaxy templates, which cover the range of galaxy types from\nearly to starburst, shown in the left-hand panel of Fig. 1. We randomly assign each galaxy an\nSED with a prior based on its original broad spectral type. Using the information simulated\nso far for each galaxy (specifically: z, absolute magnitude and SED) we calculate the observed\n\n\f4\n\nP(k)\n\n10\n\n3\n\n10\n\n2\n\n10\n\n−2\n\n−1\n\n10\n\n10\nk (Mpc−1)\n\nFigure 2: Power spectrum measured from the simulation described in Sections 3 and 4.\n\napparent magnitudes in each LSST filter including the expected photometric and systematic\nerrors3 . We verify the simulation method by comparing our own simulation of the GOODS data\nto the real GOODS data.\nPhotometric redshifts are reconstructed using a χ2 fitting technique using the galaxy luminosity function as a prior. Our code produces reasonable distributions of the photometric\nredshift errors: zphot − zspec . The right-hand panel of Fig. 1 shows the fitted standard deviation\nof zphot − zspec in different redshift slices of ∆z = 0.05 in the simulation. The precision after\nz = 1 worsens as expected due to the Balmer break having transitioned out of the y band and\nthe Lyman break having yet to enter the u band.\n4\n\nEarly simulation result\n\nWe have simulated just a small survey at this stage: 5 Gpc3 covering 0.7 < z < 1.4 and assuming\n100 visits of the simulated survey area.\nWe compute the power spectrum using a direct Fourier transform method as outlined in\nBlake et al. (2007)2 . To measure the precision on the BAO scale we use the \"wiggles only\" 7\nmethod: dividing the measured power spectrum by a smooth reference power spectrum given\nby the Eisenstein and Hu8 \"no-wiggles\" fitting formula. The \"wiggles only\" power spectrum is\nthen well approximated by a decaying sinusoid:\nk\nP (k)\n= 1 + Ak exp −\nPref\n0.1hMpc−1\n\u0014\n\n\u0012\n\n\u0013γ \u0015\n\n2πk\nsin\nka\n\u0012\n\n\u0013\n\n(1)\n\nwhere ka represents the acoustic scale.\nWe find the precision on the measurement of the acoustic scale from this simulation to be\n3%, corresponding to an error on the dark energy equation of state w (assumed constant) of\n16%. Performing a simple extrapolation to an equivalent simulation covering the LSST volume\nsuggests the precision of the acoustic scale measurement for LSST from BAO would be 0.4%,\ncorresponding to an error on w of about 2%.\n5\n\nLSST vs BigBOSS\n\nBigBOSS9 is a proposed spectroscopic survey to measure BAO. Though it will have more precise\nredshifts than LSST it will cover less volume and observe less galaxies, see Table 1. It is\ninteresting to compare the expected errors on the power spectrum for idealised versions of both\nsurveys.\nAn analytic expression for the expected fractional errors on the power spectrum under some\nsimplifying assumptions is given below:\nσP\n=\nP\n\ns\n\n2(2π)3\n1\nV 4πk2 dk\n\n\u0012\n\nP + 1/n\nP\n\n\u0013\n\n1\nhexp (−(kz σz )2 ik )\n\n(2)\n\n\f0\n\n0\n\n10\n\n10\n\nBigBOSS\nLSST σ =0.01\n\nBigBOSS\nLSST σ =0.03\n\nz\n\nz\n\nLSST σ =0\n\nLSST σ =0\n\nz\n\nz\n\n−1\n\n−1\n\nσ /P(k)\n\n10\n\n−2\n\n−2\n\n10\n\nP\n\n10\n\nP\n\nσ /P(k)\n\n10\n\n−3\n\n−3\n\n10\n\n10\n\n−4\n\n10\n\n−4\n\n−3\n\n10\n\n−2\n\n−1\n\n10\n\n10\n\n0\n\n10\n\n10\n\n−3\n\n10\n\nk (Mpc/h)\n\n−2\n\n−1\n\n10\n\n10\n\n0\n\n10\n\nk (Mpc/h)\n\nFigure 3: Expected power spectrum errors for BigBOSS and LSST as given by Eq. 2. On the left-hand side\noptimistic photometric redshift errors for LSST are assumed (σz = 0.01), and on the right-hand side, more\nconservative ones (σz = 0.03).\nTable 1: Comparison of BigBOSS and LSST\n\nSurvey\nBigBOSS\nLSST\n\nredshift range\n0.20< z <2.0\n0.15< z <3.0\n\nSky Area (sq.deg)\n14,000\n20,000\n\nVolume (Mpc/h)3\n3x1010\n1x1011\n\nN gals\n3x107\n1010\n\nThe above equation incorporates uncertainties due to sample variance, shot noise and the photometric redshift errors, assumed to have a Gaussian distribution with a standard deviation which\nis constant across the survey. For BigBOSS essentially σz = 0.\nFig. 3 shows Eq. 2 plotted for the LSST survey (blue/dark solid line) and the BigBOSS\nsurvey (green/light solid line). On the left-hand side optimistic photometric redshift errors for\nLSST are assumed (σz = 0.01), and on the right-hand side, conservative ones (σz = 0.03).\nThe blue dashed line is for LSST with zero photometric redshift errors. The figure shows\nthat BigBOSS becomes shot noise dominated around the BAO scale. To produce competitive\nconstraints with BigBOSS LSST must achieve a photometric redshift precision of σz = 0.01,\nthough LSST performs far superior to BigBOSS on large scales for both assumed error models.\n6\n\nConclusions\n\nFrom our current simulations we find that:\n• Our simulation produces a realistic observed galaxy catalog.\n• Computation of photometric redshifts produces expected error distribution.\n• Using our current small survey simulation we have shown that a direct 3D power spectrum\nestimation with photometric redshifts can produce a reasonable constraint on kBAO :\n∆ka /ka = 3%\n• LSST is competitive with BigBOSS even on the BAO scale, it is superior at large scales.\n∆ka /ka = 0.3% (BigBOSS/LSST optimistic)\n∆ka /ka = 0.6% (LSST conservative)\n\nReferences\n1. C. Blake, and S. Bridle MNRAS 363, 1329 (2005).\n2. C. Blake, A. Collister, S. Bridle and O. Lahav MNRAS 374, 1527 (2007).\n3. LSST Science Collaborations: The LSST Science Book, arXiv:astro-ph 0912.0201v1,\nhttp://www.lsst.org/lsst/scibook (2009).\n4. T. Dahlen et al. ApJ 631, 126 (2005).\n5. G.D. Coleman, C.C. Wu and D.W. Weedman ApJS 43, 393 (1980)\n\n\f6.\n7.\n8.\n9.\n\nA.L. Kinney et al. ApJ 467, 38 (1996).\nC. Blake, and K. Glazebrook ApJ 594, 665 (2003).\nD.J. Eisenstein and W. Hu ApJ 496, 605 (1998).\nD.J. Schlegel et al. arXiv:astro-ph 0904.0468, (2009)\n\n\f"}