{"id": "http://arxiv.org/abs/1110.3266v3", "guidislink": true, "updated": "2011-12-11T16:56:00Z", "updated_parsed": [2011, 12, 11, 16, 56, 0, 6, 345, 0], "published": "2011-10-14T17:07:34Z", "published_parsed": [2011, 10, 14, 17, 7, 34, 4, 287, 0], "title": "Off-shell OPERA neutrinos", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1110.2073%2C1110.0557%2C1110.3518%2C1110.5842%2C1110.1349%2C1110.5884%2C1110.4933%2C1110.2231%2C1110.3762%2C1110.3843%2C1110.2490%2C1110.0626%2C1110.1461%2C1110.1539%2C1110.0332%2C1110.1969%2C1110.0489%2C1110.4907%2C1110.5590%2C1110.5270%2C1110.4816%2C1110.5989%2C1110.5380%2C1110.3177%2C1110.5530%2C1110.4763%2C1110.6589%2C1110.5223%2C1110.5985%2C1110.5936%2C1110.0827%2C1110.3150%2C1110.0978%2C1110.6230%2C1110.6920%2C1110.0307%2C1110.2493%2C1110.3622%2C1110.6681%2C1110.5538%2C1110.3773%2C1110.1976%2C1110.5726%2C1110.6912%2C1110.2275%2C1110.1071%2C1110.2541%2C1110.5642%2C1110.1807%2C1110.6168%2C1110.5567%2C1110.0944%2C1110.1598%2C1110.1649%2C1110.2506%2C1110.2689%2C1110.4548%2C1110.2436%2C1110.3332%2C1110.1034%2C1110.1888%2C1110.3748%2C1110.2042%2C1110.3904%2C1110.5580%2C1110.2690%2C1110.6852%2C1110.3778%2C1110.4960%2C1110.1084%2C1110.6061%2C1110.5714%2C1110.5631%2C1110.4589%2C1110.4859%2C1110.6654%2C1110.4746%2C1110.5755%2C1110.3021%2C1110.1583%2C1110.4385%2C1110.0505%2C1110.4103%2C1110.6105%2C1110.4604%2C1110.3266%2C1110.1493%2C1110.6113%2C1110.1551%2C1110.1600%2C1110.4199%2C1110.4632%2C1110.3037%2C1110.5169%2C1110.2176%2C1110.0863%2C1110.5317%2C1110.2663%2C1110.3465%2C1110.5762%2C1110.4096&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Off-shell OPERA neutrinos"}, "summary": "In the OPERA experiment, superluminal propagation of neutrinos can occur if\none of the neutrino masses is extremely small. However the effect only has\nappreciable amplitude at energies of order this mass and thus has negligible\noverlap with the multi-GeV scale of the experiment.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1110.2073%2C1110.0557%2C1110.3518%2C1110.5842%2C1110.1349%2C1110.5884%2C1110.4933%2C1110.2231%2C1110.3762%2C1110.3843%2C1110.2490%2C1110.0626%2C1110.1461%2C1110.1539%2C1110.0332%2C1110.1969%2C1110.0489%2C1110.4907%2C1110.5590%2C1110.5270%2C1110.4816%2C1110.5989%2C1110.5380%2C1110.3177%2C1110.5530%2C1110.4763%2C1110.6589%2C1110.5223%2C1110.5985%2C1110.5936%2C1110.0827%2C1110.3150%2C1110.0978%2C1110.6230%2C1110.6920%2C1110.0307%2C1110.2493%2C1110.3622%2C1110.6681%2C1110.5538%2C1110.3773%2C1110.1976%2C1110.5726%2C1110.6912%2C1110.2275%2C1110.1071%2C1110.2541%2C1110.5642%2C1110.1807%2C1110.6168%2C1110.5567%2C1110.0944%2C1110.1598%2C1110.1649%2C1110.2506%2C1110.2689%2C1110.4548%2C1110.2436%2C1110.3332%2C1110.1034%2C1110.1888%2C1110.3748%2C1110.2042%2C1110.3904%2C1110.5580%2C1110.2690%2C1110.6852%2C1110.3778%2C1110.4960%2C1110.1084%2C1110.6061%2C1110.5714%2C1110.5631%2C1110.4589%2C1110.4859%2C1110.6654%2C1110.4746%2C1110.5755%2C1110.3021%2C1110.1583%2C1110.4385%2C1110.0505%2C1110.4103%2C1110.6105%2C1110.4604%2C1110.3266%2C1110.1493%2C1110.6113%2C1110.1551%2C1110.1600%2C1110.4199%2C1110.4632%2C1110.3037%2C1110.5169%2C1110.2176%2C1110.0863%2C1110.5317%2C1110.2663%2C1110.3465%2C1110.5762%2C1110.4096&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "In the OPERA experiment, superluminal propagation of neutrinos can occur if\none of the neutrino masses is extremely small. However the effect only has\nappreciable amplitude at energies of order this mass and thus has negligible\noverlap with the multi-GeV scale of the experiment."}, "authors": ["Tim R. Morris"], "author_detail": {"name": "Tim R. Morris"}, "author": "Tim R. Morris", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1088/0954-3899/39/4/045010", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1110.3266v3", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1110.3266v3", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "Typos corrected. Expanded to include discussion of boosted wave\n  packets similar to Naumov & Naumov, and explanation for why causality is not\n  threatened. References added", "arxiv_primary_category": {"term": "hep-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "hep-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "hep-ex", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1110.3266v3", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1110.3266v3", "journal_reference": "J. Phys. G: Nucl. Part. Phys. 39 (2012) 045010", "doi": "10.1088/0954-3899/39/4/045010", "fulltext": "SHEP 11-31\n\nOff-shell OPERA neutrinos\nTim R. Morris\nSchool of Physics and Astronomy, University of Southampton\n\narXiv:1110.3266v3 [hep-ph] 11 Dec 2011\n\nHighfield, Southampton, SO17 1BJ, U.K.\nT.R.Morris@soton.ac.uk, Tim.Morris@cern.ch\nAbstract\nIn the OPERA experiment, superluminal propagation of neutrinos can occur if one\nof the neutrino masses is extremely small. However the effect only has appreciable\namplitude at energies of order this mass and thus has negligible overlap with the multiGeV scale of the experiment.\n\n\f1\n\nIntroduction\n\nRecently the OPERA collaboration reported reported a measurement of the average time\ntaken for neutrinos (νμ up to % level contamination) created at CERN (CN) to arrive at the\nGran Sasso Laboratory (GS) compared to the time taken travelling at the speed of light in\nvacuo (c). They found an early arrival time of approximately δt = 60 ns, which corresponds,\nat a significance of 6.0σ, to faster-than-light travel with speed (v − c)/c = 2.48 × 10−5 [1].\nSince their announcement, a large number of papers have written that variously seek\nto explain it with or without new physics, question the experimental setup, or point out\ndifficulties with new physics explanations (a selection is [2, 3, 4, 5, 6]).\nHere, we work entirely within the framework of standard relativistic quantum field\ntheory and within the Standard Model (suitable modified to allow for neutrino masses and\nmixing matrix). We note that effective superluminal propagation of νμ (both for individual\nevents and, as we will later see, on average), is possible if the mass m of one of the masseigenstates is extremely small, so small in fact that space-like propagation can take place\nwith appreciable probability even over the L = 730 km distance between CN and GS.\nTo see that this is possible in principle, consider a neutrino of such a mass created at\nCN at time x0 = 0 and position x = 0, and arriving at GS with space-time coordinates\n(y 0 , y) = (L − δt, L).1 To describe this we should use the Feynman propagator for spinors.\nHowever the neutrino beam has average energy hEi = 17 GeV [1]. The neutrinos are created\nleft handed (by weak decay of mesons in the decay tunnel) and being ultra-relativistic, will\nstay that way to very good approximation throughout their flight. Therefore we need only\nthe left handed component, which effectively reduces the propagator to that of a scalar\nparticle:\nS(y − x) = lim\n\nǫ→0\n\nZ\n\ne−ip*(y−x)\nd4 p\n(2π)4 p2 − m2 + iǫ\n\n(1)\n\n(Here pμ is the four-momentum.) When the interval s := (x0 − y 0 )2 − (x − y)2 is negative\nas is measured by OPERA, i.e. is space-like, then we have that\nS(y − x) = −\n\n√\nim\n√\nK\n(m\n−s),\n1\n4π 2 −s\n\n(2)\n\nwhere K1 is a modified Bessel function. For large value of its argument it decays exponen1\n\nWe can neglect the two transverse spatial coordinates. From hereon we work in units with h̄ = c = 1,\n\ntranslating back as necessary.\n\n1\n\n\ftially as:\n\n√\nK1 (m −s) ∼\n\nr\n\n√\nπm 1\n−m −s .\ne\n2 (−s) 41\n\n(3)\n\nOn the other hand for small values, K1 diverges:\nK1 ∼\n\n2i\n√ .\nπm −s\n\n(4)\n\nWe see that if we choose\n1\n1\nm∼ √\n≈√\n= 3.8 × 10−11 eV,\n−s\n2Lδt\n\n(5)\n\nthen a substantial fraction of the neutrinos can propagate superluminally.\nOf course it is not the case here that the neutrinos are really tachyonic. The effect\noccurs because the neutrino remains off shell.2 The Feynman propagator arises from the\nLorentz covariant time-ordered expectation of the νμ and ν̄μ fields\nS(y − x) = h0|T ν(x)ν̄(y)|0i\n= θ(x0 − y 0 )h0|ν(x)ν̄(y)|0i − θ(y 0 − x0 )h0|ν̄(y)ν(x)|0i.\n\n(6)\n\nThe propagator arises as an intermediate step in a chain of reactions, for example being\ncreated at CN through the decay π + → μ+ νμ , and absorbed at GS through νμ n → μ− p.\n\nWe can interpret this as the νμ being created with energy-momentum pμ = hEi(1, v).\n\nThe faster-than-light propagation occurs because the field operators are not localised but\nhave a spread of order the Compton wavelength 1/m, which in our case is large enough to\nstretch from CN to GS.\nSince we know that y 0 − x0 > 0, i.e. that the neutrino arrives in GS after being created\nat CN, the first term currently plays no rôle. The potential problems with causality and\nLorentz covariance arise when we view the propagation in a frame moving at speed vF\nsufficiently fast that the event at GS happens before the one at CN: y ′0 = γF (y 0 − vF y) =\nq\n\nγF y 0 (1 − vvF ) < 0 (where the dilation factor γF = 1/ 1 − vF2 ). Since the Feynman\n\npropagator is Lorentz covariant, it still takes the same form, but in this frame it is the first\nterm in (6) that now operates. It describes a superluminal antineutrino ν̄μ travelling from\nGS to CN. Energy and momentum conservation are preserved in the chain of reactions, and\n2\n\nIt follows that the constraints noted in ref.\n\n[3] do not apply:\n\nkinematically electron-positron\n\nbremsstrahlung would here require momentum transfer with constituents of rock, and is just one of many\ndiagrams heavily suppressed by the Fermi constant and the requirement that the neutrino remains off shell.\n\n2\n\n\fmoreover we see that the neutrino energy has also reversed sign: E ′ = γF E0 (1 − vvF ) < 0.\nTherefore we have a consistent interpretation in this new frame: a ν̄μ is created at GS with\nenergy −E ′ and momentum pointing from GS to CN, through the process n → pμ− ν̄μ , and\n\nabsorbed at CN through the process ν̄μ π + → μ+ . The kinematics of these processes are\nallowed because the anti-neutrino's 4-momentum is space-like.\nThis is of course just the standard argument due to Feynman with small adaptations to\nthis novel context, and demonstrates that the Feynman propagator allows an interpretation\nconsistent with Lorentz covariance. However, there still remains an issue of causality. In-\n\ndeed, in the new frame it seems the neutron at GS has somehow to know to decay beforehand\nso that the antineutrino can later be absorbed by the pion produced at CN.\nOnce we have understood the process in more detail quantum mechanically, we can see\nhow this issue with causality is resolved. We will return to this in the conclusions.\nWhile this paper was being prepared, ref. [4] appeared, where similar ideas are proposed\nas an explanation for the OPERA measurement. In fact, if we adapt this observation to\nthe setup in the OPERA experiment, we can see that the effect vanishes or at best is far\ntoo small to explain the measurement.\nThe reason our setup is not yet the pertinent one is that it is not true that the neutrinos\nare created at an exact time. By Heisenberg's uncertainty principle, such a particle would\nhave an infinite spread in energy. In sec. 2 we argue that the spread in energy for each\nneutrino's wave packet is 1/τ ∼ 0.2 eV about its central value E0 . In the ensemble of\nneutrinos that make up the neutrino bunches, these central values are spread over a wide\nrange [1, 7] but it is clear nevertheless that E0 is set at a much larger scale (GeV to multiGeV).\nGiven that each neutrino's energy is thus sharply peaked we can already expect that the\neffect must be heavily suppressed. From (3), the evanescent part of the propagator appears\ndominated by energies of order (5) – indeed we will see that it is a manifestation of quantum\nmechanical tunnelling, requiring energy to be less than m; this mismatch with the energies\nin the wavepacket ∼ E0 ± 1/τ , ensures that any remaining effect is consigned to any small\ntail in the wavepacket that reaches down to these small energies. For example, if we assume\nthat the wavepacket is a Gaussian of width 1/τ then this supplies a suppression factor\n∼ exp −τ 2 E02 ∼ exp −τ 2 hEi2 ∼\n\n1\n101010\n\n.\n\n(7)\n\nAlternatively, a wave packet with a lower cutoff > m on the neutrino energy would eliminate\n3\n\n\fthe effect entirely. Furthermore, the space-like neutrino then has to be detected at Gran\nSasso, which requires overlap of (3) with the typical wavefunction for a detected neutrino.3\nSuch a wavefunction has again an order GeV central energy and spread ∼ 1/τ . (At the\nmost optimistic we can note that a lower bound is set by the lowest threshold energy for\ndetection of νμ via charge current interactions in the Gran Sasso Laboratory. This is for\nthe process νμ n → μ− p, thus E0 > mμ + 12 m2μ /mn = 112 MeV.) This results in multiplying\n\nby another suppression factor ∼ exp −τ 2 E02 from the tail of its distribution.\n\nOne might try to resuscitate the proposal by bringing 1/τ and E0 closer to each other.\nThe relevant E0 could be as low as the threshold energy of 112 MeV and perhaps we have\nmissed something in our estimate of the energy spread 1/τ in the neutrino wave packet\nand the true spread is far larger. If we for the moment take this optimistic view, we note\nthat we still cannot fit the data. The dominance of the very low energy scale is not seen at\nOPERA: they repeated the analysis concentrating on only those νμ charged current events\noccurring in the OPERA target (where reliable energies could be measured). They split\nthis sample into bins of nearly equal statistics, taking events with energy higher or lower\nthan 20 GeV. With a significance of greater than 3σ, they still see a superluminal velocity\nin the higher energy sample of the same magnitude (within errors) [1].\nAnother way one might try nevertheless to use this effect to explain the OPERA measurement is to boost (1). In other words, we note that the neutrinos are neither created\nat an exact time nor at an exact location; in reality we need to integrate over position\nspace terms that supply the neutrino with the appropriate ultra relativistic momentum.\nOne could then hope that the behaviour (3) would be the correct one for directions transverse to the neutrino's momentum, corresponding to small deficits in the energy required by\nthe ultra relativistic on-shell energy-momentum relation. The amplitude would effectively\ntake the form of the kilometres-wide wave function assumed in ref. [5], where the OPERA\nresult is then explained without any adjustable parameters by the off-centre detection of\nthese wave packets. However we will see that this set-up does not result in such transverse\nevanescence.\nAlthough neutrino species oscillate into one another, we can ignore this effect in the\npresent paper. The known mass-squared differences [8] show that only one mass eigenstate\ncan be as light as (5). Therefore the effect we are looking for is entirely due to evanescence\n3\n\nmore accurately the amplitude constructed from the detected interaction products\n\n4\n\n\fin this mass eigenstate. The only effect of mixing is the multiplicative inclusion of mixing\nangles at the beginning where the CN νμ converts to this state, and at the end where it\nreverts to νμ , as detected in GS.\nThe structure of the paper is as follows. In the next section (sec. 2) we estimate\nthe initial spread in energy of the neutrino wavefunction at CN and the effective further\ndecoherence due to its detection at GS. In sec. 3, we construct the initial wavefunction\nand the amplitude for neutrinos as seen at the Gran Sasso Laboratory, and draw out the\npiece relevant for this effect, confirming and extending the arguments given above. Finally,\nin sec. 4, we present our conclusions and also argue why these results ensure there is no\nviolation of causality.\n\n2\n\nEstimating coherence\n\nWe have already noted that we cannot assume that the neutrino is created at a definite\ntime. Likewise however, it is not true that each neutrino has been created with a definite\nenergy. Such a particle would be completely delocalised in time, so the question of when it\narrives in Gran Sasso would become meaningless. We therefore have no choice but to take\ninto account the shape of its wavepacket, at least in its gross details, since the results will\ndepend on this.\nIt should be clear that here we are not discussing the energy spectrum of the ensemble\nof neutrinos in the beam, which is very broad, but rather the inherent quantum mechanical\nuncertainty in the momentum of a given neutrino when it is created at CN and any further\ninherent uncertainty imposed on it by being measured at GS.\nWe follow closely the analysis in ref. [6]. We start at CERN with a proton bunch\nextracted from the Super Proton Synchotron. The energy uncertainty inherent in an individual proton wavefunction can certainly can be no smaller than that set by ∆t ≈ 5 ns, the\nsmallest time features in the proton bunch [1]. This corresponds to ∆E = 1/∆t ≈ 1.3×10−7\neV.\nHowever, even if the proton beam is coherent at this level, it suffers decoherence on its\nway to becoming the νμ beam. Firstly, the protons impact the graphite target, producing\nthe mesons (mostly pions) that will decay to muon neutrinos. Initially these mesons are in\na quantum state together with the other products of the collision (including various nuclei),\nhowever they then suffer decoherence from thermalisation in a hot target, both directly and\n5\n\n\falso through their quantum mechanical coupling to the decay products. Assuming a target\ntemperature of, say 300◦ C, this limits the energy-momentum resolution to kB T ∼ 0.05 eV.\nFinally the mesons decay in the decay tunnel and here further decoherence takes place,\nagain through coupling to the decay products (in this case the muon). Consider for example\nthe decay of a π + to μ+ νμ . The resulting quantum state takes the form:\nψπ (q)\n\nZ\n\nM(p, q) |νμ (p)i |μ+ (q − p)i,\n\n(8)\n\np phase space\n\nwhere ψπ (q) is the wave function of the erstwhile pion, q and p are 3-momenta, and M\nstands for the matrix element for the decay. The muon is absorbed by a combination of rock,\na Hadron stop and two muon detectors [1, 9]. This allows the experimenters to measure\nthe transverse coordinates of the proton beam spot when it hits the target to a precision\nof ∼ 50 – 90 μm [9], however it is reasonable to assume that the rock itself localises the\nmuons at the μm level (similar to emulsion - see below), even if this is not recorded. This\ncorresponds to a momentum decoherence of order 0.2 eV/c. Through (8) this decoherence\nis transferred to the neutrino.\nWe conclude that the chief limiting factor on the coherence of the initial neutrino wave\npacket is through the decay of the mesons and results in a wave packet with an energy\nspread of 1/τ ∼ 0.2 eV.\nFor muon neutrinos that interact in the Gran Sasso detector, the impact spot is discernible in the emulsion at the μm level [10]; we can expect similar localisation in the rock\nin front of the detector for the external events. Therefore the act of measurement results\nin an effective energy spread in the wave packet of similar size to that in the initial packet.\n\n3\n\nTunnelling to Gran Sasso\n\nWe can thus regard our neutrino as being created at position x = 0 at an uncertain time\ncentred around t = 0, with energy localised to E = E0 with an accuracy 1/τ . Let us model\nthe shape as a Gaussian. Then we have for the initial wavefunction:\n(\n\n)\n\nt2\nΨ(0, t) ∝ exp − 2 − iE0 t .\n2τ\n\n(9)\n\nThe amplitude to find the neutrino at Gran Sasso at time t2 = y 0 is then\nA(t2 ) ∝\n\nZ\n\n∞\n\ndt Ψ(0, t) S(t2 − t, L),\n\n−∞\n\n6\n\n(10)\n\n\fwhere S is the Feynman propagator (1). Since we are dealing with a situation where we\nknow the neutrino arrives at Gran Sasso, we will choose the normalization factor so that\nthe probability distribution reflects this:\nZ\n\n∞\n\ndt2 |A|2 (t2 ) = 1.\n\n(11)\n\n−∞\n\nWe can now make a further simplification. We can drop the transverse momentum integrations in (1) since these will only result in ∼ 1/L2 losses that are scaled away when we\nnormalise. Therefore, substituting (1) and using (9), we have\nexp {−iE[t2 − t] + iqL}\nE 2 − q 2 − m2 + iǫ\n−∞\n−∞\n\b\nZ ∞\nexp −iEt2 − τ 2 ∆E 2 /2 + iqL\n∝\ndE dq\n,\nE 2 − q 2 − m2 + iǫ\n−∞\n\nA(t2 ) ∝\n\nZ\n\n∞\n\ndt Ψ(0, t)\n\nZ\n\n∞\n\ndE dq\n\n(12)\n\nwhere ∆E = E − E0 , and we have performed the t integration. Now we do the momentum\nintegration. Since we know that L > 0, the iǫ prescription tells us to close the contour over\nthe top. We obtain:\nA(t2 ) = N\n\nZ\n\n∞\n\ndE e−iEt2 −τ\n\n−∞\n\n2 ∆E 2 /2\n\neipL\n,\np\n\n(13)\n\n√\nwhere N is the normalisation constant, where p = E 2 − m2 has either a vanishing positive\n√\nimaginary part (the iǫ) for |E| > m, or p = i m2 − E 2 for |E| < m.\nWe see that the exponential decay in (3) indeed arises from energies of order m, as we\nclaimed. We also confirm that the exponential decay component is suppressed into the far\ntail of the probability distribution by ∼ exp −τ 2 E02 . The amount of evanescent component\nthus depends crucially on the unknown shape of this tail. If we had chosen a wave packet\nwith a sharp cutoff at some realistic minimum energy, we would eliminate the evanescent\ncontribution completely.\nFor completeness we note that (13) can be evaluated by the method of steepest descents.\nThe dominant term comes from E ≈ E0 giving:\n(\n)\n√\n\u0012\n\u0013\n1\nL 2\n2π\nexp −\nt2 −\n+ i(E0 t2 − p0 L) .\nA(t2 )|dominant ≈ N\np0 τ\n2τ 2\nv0\n(The approximation is valid providing |t2 − L/v0 | ≪ τ 2 p0 .) Here p0 =\n\n(14)\n\nq\n\nE02 − m2 is the\n\ncentral momentum and v0 = p0 /E0 is the classical velocity. We recognise this as nothing\nbut the expected result of propagating the wave packet to Gran Sasso without dispersion.\nThe evanescent part can also be evaluated. Writing E = m(1 − z) for small positive z at the\n7\n\n\ftop boundary, the integral can again be evaluated by steepest descents. Adding to this the\nterm from the bottom boundary E = −m(1−z), and similar size pieces from E = ±m(1+z)\n(which can again be evaluated by steepest descents), we get for the evanescent part\nA(t2 )|evanescent ≈ −2iN\n\ns\n\n2π −τ 2 E 2 /2\n0\ne\nexp i\nmt2\n\n(\n\nmL2\nπ\n− mt2 +\n2t2\n4\n\n)\n\n.\n\n(15)\n\nThis approximation is valid providing mt2 ≫ 1. We see again the damping by the tail of\nthe wave function. We can now carry this through to a computation of the superluminal\ncomponent of velocity. The evanescent term will provide one, but we do not present the\ncomputation since we have seen that it necessarily depends on a vanishingly small unknown\nquantity.\nFinally, we address the question raised in the introduction: whether, after taking into\naccount appropriate spatial dependence of Ψ and spatial integration in (10), so as to incorporate the fact that the neutrino has some momentum p̃0 (with associated small uncertainty)\nwhich is slightly larger in magnitude than the energetically allowed p0 =\n\nq\n\nE02 − m2 , the\n\nresulting amplitude could take the form similar to (14) in the direction of p̃0 but with transverse evanescent tails corresponding to imaginary transverse momenta? Recall that such an\namplitude would be very similar to the wave packet envisaged in ref. [5] where results consistent with the OPERA measurement were derived as a result of off-centre measurement\nof these wave packets.\nClearly in order to investigate this we now need to keep the transverse momentum\nintegrations in (1). The modified wave function and spatial integration incorporated in (10)\nresults in a momentum integral in (12) of the form:\nJ(L) =\n\nZ\n\nd3 q Φ(q)\n\nE2\n\nexp{iq * L}\n,\n− q2 − m2 + iǫ\n\n(16)\n\nwhere Φ, strongly peaked about q = p̃0 incorporates the momentum dependence induced\nby the initial wave function.\nNow we appeal to the Grimus-Stockinger theorem [11] which states that4\nJ(L) = −\nif p =\n\n√\n\n2π 2\nΦ (−pL/L) exp{ipL} + O(L−3/2 ),\nL\n\n(17)\n\nE 2 − m2 is real, and is O(1/L2 ) otherwise. We see that providing E > m we\n\nget only the analogous dependence to (14). Once we integrate over energy in (12), the\n4\n\nproviding Φ satisfies the reasonable conditions that it is three-times continuously differentiable and first\n\nand second derivatives decrease at least as 1/q2 for |q| → ∞\n\n8\n\n\fmismatch between p0 and p̃0 will result in suppression arising from the partial overlap of\nexp −τ 2 ∆E 2 /2 and Φ (−pL/L), however we do not generate evanescent tails as a result of\nthis mismatch. On the other hand, for E < m, J decays faster in L, which we can associate\nwith the evanescence. We see that even with this 'boosted' wave packet, it is still the case\nthat the evanescent behaviour responsible for superluminal propagation, is restricted to the\nregime E < m.\n\n4\n\nConclusions\n\nWe have seen that although superluminal propagation is possible over the 730 km from\nCERN to Gran Sasso if the mass of the lowest neutrino mass eigenstate is so small that it\nremains off shell, cf. (5), the effect does not survive projection on the relevant energy scales,\nbeing killed dead or by typically a huge suppression (7). This projection is required because\none must integrate over the initial neutrino wave function which carries a very rapidly\noscillating exponential, set by the multi-GeV energy of the created neutrino. One could\nreduce the suppression (i.e. increase the overlap with energy scale m) by concentrating on\nmuon neutrinos with energies only just higher than the threshold energy of 112 MeV. This is\nstill not enough: one would have to argue that the quantum-mechanical energy uncertainty\nin the neutrino wave packet was not of order 0.2 eV as we have argued but – implausibly –\ntens or hundreds of MeV. Even if one does this, the effect is still concentrated at energies\nof order m, resulting in the wrong energy dependence.\nOne could reduce the time for which the neutrino has to remain off shell by considering\ncases where it propagates on shell to a point near the detector and, due to interaction with\nthe rock, is then kicked off shell for the remaining part of its journey. Note that an off-shell\nneutrino can be passed from this point to the detector in principle almost instantaneously.\nIn this way we achieve the smallest negative interval s from the instantaneous jump (0, δt)\nfrom (L − δt, L − δt) to the detector. In (5) we then get the larger mass m ∼ 1/δt ∼ 10−8 eV\n[4]. This is still far too small to bridge the gap to the energy scales set by the experiment.\nAlthough the OPERA measurements cannot be explained by assuming very low mass\noff-shell neutrinos, it is still the case that such neutrinos can propagate superluminally. How\ncan this be reconciled with causality, in particular why does this not lead to faster-thanlight communication? Note that we have shown that these neutrinos must carry energy E\nless than m. Leaving aside practical issues involved in detecting such neutrinos, we note\n9\n\n\fthat even in principle, a detector for such neutrinos would have to be restricted to using\nwavelengths larger than or of order their Compton wavelength λ = 1/m, otherwise the\nobservation itself would disturb the system too much – for example by pair creating the\nvery neutrinos it was trying to measure. Thus we see that the restriction to E < m for\nsuperluminal neutrinos, which comes out from the detailed analysis, is in fact necessary to\nensure that they cannot be detected with sufficient spatial resolution to allow faster than\nlight signals.\n\nAcknowledgments\nThe author thanks the STFC for financial support and Konstantin Kuzmin and Bartolome\nAlles Salom for useful conversations.\n\nReferences\n[1] T. Adam et al. [ OPERA Collaboration ], \"Measurement of the neutrino velocity with\nthe OPERA detector in the CNGS beam,\"\n[arXiv:1109.4897 [hep-ex]].\n[2] D. Fargion and D. D'Armiento, \"Inconsistence of super-luminal Opera neutrino speed\nwith SN1987A neutrinos burst and with flavor neutrino mixing,\" arXiv:1109.5368\n[astro-ph.HE]; G. F. Giudice, S. Sibiryakov, A. Strumia, \"Interpreting OPERA results on superluminal neutrino,\" [arXiv:1109.5682 [hep-ph]]; V. K. Oikonomou, \"The\n2d Gross-Neveu Model for Pseudovector Fermions and Tachyonic Mass Generation,\"\narXiv:1109.6170 [hep-th]; J. Alexandre, J. Ellis, N. E. Mavromatos, \"On the Possibility\nof Superluminal Neutrino Propagation,\" [arXiv:1109.6296 [hep-ph]]; P. Wang, H. Wu\nand H. Yang, \"Superluminal neutrinos and domain walls,\" arXiv:1109.6930 [hep-ph];\nM. A. Anacleto, F. A. Brito and E. Passos, \"Supersonic Velocities in Noncommutative Acoustic Black Holes,\" arXiv:1109.6298 [hep-th]. G. Henri, \"A simple explanation\nof OPERA results without strange physics,\" [arXiv:1110.0239 [hep-ph]]; W. Winter,\n\"How large is the fraction of superluminal neutrinos at OPERA?,\" [arXiv:1110.0424\n[hep-ph]]; M. V. Berry, N. Brunner, S. Popescu and P. Shukla, \"Can apparent superluminal neutrino speeds be explained as a quantum weak measurement?,\" J. Phys. A 44\n(2011) 492001 [arXiv:1110.2832 [hep-ph]]. F. Giacosa, P. Kovacs and S. Lottini, \"Could\n10\n\n\fthe OPERA setup send a bit of information faster than light?,\" arXiv:1110.3642 [hepph]. J. Bramante, \"Sterile Neutrino Production Through a Matter Effect Enhancement\nat Long Baselines,\" arXiv:1110.4871 [hep-ph].\n[3] X. J. Bi, P. F. Yin, Z. H. Yu and Q. Yuan, \"Constraints and tests of the OPERA\nsuperluminal neutrinos,\" arXiv:1109.6667 [hep-ph]; A. G. Cohen, S. L. Glashow, \"New\nConstraints on Neutrino Velocities,\" [arXiv:1109.6562 [hep-ph]].\n[4] D. V. Ahluwalia, S. P. Horvath, D. Schritt, \"Probing neutrino masses with neutrinospeed experiments,\" [arXiv:1110.1162 [hep-ph]].\n[5] D. V. Naumov and V. A. Naumov, \"Neutrino Velocity Anomalies: A Resolution without a Revolution,\" arXiv:1110.0989 [hep-ph].\n[6] T. R. Morris, \"Superluminal group velocity through maximal neutrino oscillations,\"\n[arXiv:1110.2463 [hep-ph]].\n[7] Dario Autiero \"Measurement of the the neutrino velocity with the OPERA detector in\nthe CNGS beam,\" http://cdsweb.cern.ch/record/1384486\n[8] K. Nakamura et al. (Particle Data Group), J. Phys. G37, 075021 (2010) and 2011\npartial update for the 2012 edition.\n[9] A. E. Ball et al., \"CNGS muon monitoring: Why do we need both muon detector\nstations at the start-up of the CNGS neutrino beam?,\" CERN SL Division technical note SL-Note-2002-040 EA EMDS No. 36258 available on the CNGS website\nhttp://proj-cngs.web.cern.ch\n[10] N. Agafonova, A. Anokhina, S. Aoki, A. Ariga, T. Ariga, L. Arrabito, D. Autiero,\nA. Badertscher et al., \"The Detection of neutrino interactions in the emulsion/lead\ntarget of the OPERA experiment,\" JINST 4 (2009) P06020. [arXiv:0903.2973 [hepex]].\n[11] W. Grimus and P. Stockinger, \"Real oscillations of virtual neutrinos,\" Phys. Rev. D\n54 (1996) 3414 [arXiv:hep-ph/9603430].\n\n11\n\n\f"}