{"id": "http://arxiv.org/abs/0907.5173v2", "guidislink": true, "updated": "2009-10-05T10:42:07Z", "updated_parsed": [2009, 10, 5, 10, 42, 7, 0, 278, 0], "published": "2009-07-29T16:45:39Z", "published_parsed": [2009, 7, 29, 16, 45, 39, 2, 210, 0], "title": "Experimental evidence for water formation via ozone hydrogenation on\n  dust grains at 10 K", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0907.5173%2C0907.2928%2C0907.2598%2C0907.0190%2C0907.2978%2C0907.5258%2C0907.1995%2C0907.4151%2C0907.3246%2C0907.5254%2C0907.5101%2C0907.5165%2C0907.0600%2C0907.1846%2C0907.2040%2C0907.2655%2C0907.4916%2C0907.3902%2C0907.5603%2C0907.4935%2C0907.2574%2C0907.5038%2C0907.2018%2C0907.2249%2C0907.0475%2C0907.2605%2C0907.1618%2C0907.0644%2C0907.0632%2C0907.2515%2C0907.3532%2C0907.5497%2C0907.3893%2C0907.2350%2C0907.1514%2C0907.5545%2C0907.1664%2C0907.0877%2C0907.2568%2C0907.1133%2C0907.2004%2C0907.0534%2C0907.3640%2C0907.3261%2C0907.2490%2C0907.0655%2C0907.0460%2C0907.3594%2C0907.3180%2C0907.3797%2C0907.3407%2C0907.3590%2C0907.1912%2C0907.2815%2C0907.3366%2C0907.3463%2C0907.4138%2C0907.2877%2C0907.0033%2C0907.3793%2C0907.5294%2C0907.5481%2C0907.3076%2C0907.0329%2C0907.5247%2C0907.1792%2C0907.0479%2C0907.0268%2C0907.5273%2C0907.4781%2C0907.0380%2C0907.3114%2C0907.1032%2C0907.5073%2C0907.0263%2C0907.0529%2C0907.1583%2C0907.2948%2C0907.2701%2C0907.2924%2C0907.4652%2C0907.2846%2C0907.4555%2C0907.4022%2C0907.0379%2C0907.2447%2C0907.4613%2C0907.0505%2C0907.3253%2C0907.2725%2C0907.4495%2C0907.4464%2C0907.0324%2C0907.2331%2C0907.3878%2C0907.5077%2C0907.2654%2C0907.2806%2C0907.3703%2C0907.0188%2C0907.2987&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Experimental evidence for water formation via ozone hydrogenation on\n  dust grains at 10 K"}, "summary": "The formation of water molecules from the reaction between ozone (O3) and\nD-atoms is studied experimentally for the first time. Ozone is deposited on\nnon-porous amorphous solid water ice (H2O), and D-atoms are then sent onto the\nsample held at 10 K. HDO molecules are detected during the desorption of the\nwhole substrate where isotope mixing takes place, indicating that water\nsynthesis has occurred. The efficiency of water formation via hydrogenation of\nozone is of the same order of magnitude of that found for reactions involving O\natoms or O2 molecules and exhibits no apparent activation barrier. These\nexperiments validate the assumption made by models using ozone as one of the\nprecursors of water formation via solid-state chemistry on interstellar dust\ngrains.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0907.5173%2C0907.2928%2C0907.2598%2C0907.0190%2C0907.2978%2C0907.5258%2C0907.1995%2C0907.4151%2C0907.3246%2C0907.5254%2C0907.5101%2C0907.5165%2C0907.0600%2C0907.1846%2C0907.2040%2C0907.2655%2C0907.4916%2C0907.3902%2C0907.5603%2C0907.4935%2C0907.2574%2C0907.5038%2C0907.2018%2C0907.2249%2C0907.0475%2C0907.2605%2C0907.1618%2C0907.0644%2C0907.0632%2C0907.2515%2C0907.3532%2C0907.5497%2C0907.3893%2C0907.2350%2C0907.1514%2C0907.5545%2C0907.1664%2C0907.0877%2C0907.2568%2C0907.1133%2C0907.2004%2C0907.0534%2C0907.3640%2C0907.3261%2C0907.2490%2C0907.0655%2C0907.0460%2C0907.3594%2C0907.3180%2C0907.3797%2C0907.3407%2C0907.3590%2C0907.1912%2C0907.2815%2C0907.3366%2C0907.3463%2C0907.4138%2C0907.2877%2C0907.0033%2C0907.3793%2C0907.5294%2C0907.5481%2C0907.3076%2C0907.0329%2C0907.5247%2C0907.1792%2C0907.0479%2C0907.0268%2C0907.5273%2C0907.4781%2C0907.0380%2C0907.3114%2C0907.1032%2C0907.5073%2C0907.0263%2C0907.0529%2C0907.1583%2C0907.2948%2C0907.2701%2C0907.2924%2C0907.4652%2C0907.2846%2C0907.4555%2C0907.4022%2C0907.0379%2C0907.2447%2C0907.4613%2C0907.0505%2C0907.3253%2C0907.2725%2C0907.4495%2C0907.4464%2C0907.0324%2C0907.2331%2C0907.3878%2C0907.5077%2C0907.2654%2C0907.2806%2C0907.3703%2C0907.0188%2C0907.2987&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The formation of water molecules from the reaction between ozone (O3) and\nD-atoms is studied experimentally for the first time. Ozone is deposited on\nnon-porous amorphous solid water ice (H2O), and D-atoms are then sent onto the\nsample held at 10 K. HDO molecules are detected during the desorption of the\nwhole substrate where isotope mixing takes place, indicating that water\nsynthesis has occurred. The efficiency of water formation via hydrogenation of\nozone is of the same order of magnitude of that found for reactions involving O\natoms or O2 molecules and exhibits no apparent activation barrier. These\nexperiments validate the assumption made by models using ozone as one of the\nprecursors of water formation via solid-state chemistry on interstellar dust\ngrains."}, "authors": ["H. Mokrane", "H. Chaabouni", "M. Accolla", "E. Congiu", "F. Dulieu", "M. Chehrouri", "J. L. Lemaire"], "author_detail": {"name": "J. L. Lemaire"}, "author": "J. L. Lemaire", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1088/0004-637X/705/2/L195", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0907.5173v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0907.5173v2", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "16 pages, 2 figures, to be published on ApJL", "arxiv_primary_category": {"term": "astro-ph.GA", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph.GA", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0907.5173v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0907.5173v2", "journal_reference": null, "doi": "10.1088/0004-637X/705/2/L195", "fulltext": "Experimental evidence for water formation via ozone\nhydrogenation on dust grains at 10 K\n\narXiv:0907.5173v2 [astro-ph.GA] 5 Oct 2009\n\nH. Mokrane 1 , H. Chaabouni 1 , M. Accolla\n\n1,2\n\n, E. Congiu 1 , F. Dulieu1 , M. Chehrouri\n\n1,3\n\n,\n\nJ. L. Lemaire1\nReceived 12 May 2009 ;\n\n1\n\naccepted 17 September 2009\n\nLERMA/LAMAp, UMR 8112 du CNRS, de l'Observatoire de Paris et de l'Université\n\nde Cergy Pontoise, 5 mail Gay Lussac, 95000 Cergy Pontoise, France\n2\n\nDipartimento di Metodologie Fisiche e Chimiche, Università di Catania, Viale A. Doria\n\n6,95125 Catania, Sicily, Italy\n3\n\nUniversité de Saı̈da, BP 138 Enaser Saı̈da 2002, Algérie\n\n\f–2–\nABSTRACT\n\nThe formation of water molecules from the reaction between ozone (O3 ) and\nD-atoms is studied experimentally for the first time. Ozone is deposited on nonporous amorphous solid water ice (H2 O), and D-atoms are then sent onto the\nsample held at 10 K. HDO molecules are detected during the desorption of the\nwhole substrate where isotope mixing takes place, indicating that water synthesis\nhas occurred. The efficiency of water formation via hydrogenation of ozone is of\nthe same order of magnitude of that found for reactions involving O atoms or\nO2 molecules and exhibits no apparent activation barrier. These experiments\nvalidate the assumption made by models using ozone as one of the precursors of\nwater formation via solid-state chemistry on interstellar dust grains.\nSubject headings: astrochemistry -dust, extinction-ISM: molecules - molecular\nprocesses - methods: laboratory\n\n\f–3–\n1.\n\nIntroduction\n\nSolid water is a very abundant material. Indeed, it is believed to be the most abundant\ncondensed material in the Universe, thanks to its propensity for remaining as a deposit\non interstellar dust particles in dense clouds. Amorphous solid water ice, together with\na wealth of other condensed species, is widely observed spectroscopically via infra-red\nabsorption lines present in the spectrum of a field star or of the embedded object in star\nforming regions (Gibb et al. 2000; Boogert et al. 2004). Icy mantles covering dust grains\nare reputed to form after direct freeze out of gas phase species and after surface reactions\nof atoms and radicals.\nAlthough water ice is by far the most abundant species in icy mantles, the chemical\norigin of water molecules in interstellar icy mantles is still uncertain. Water molecule\nformation in the gas phase is not efficient enough to reproduce the observed abundances\nin dark clouds, especially in its solid form (Parise et al. 2005; Ceccarelli et al. 2007).\nTherefore, water ice is likely to form directly on the cold interstellar grains and not as a\ncondensate after formation in the gas phase.\nA reaction scheme including water formation on grain surfaces was proposed some years\nago by Tielens & Hagen (1982). They suggested that H2 O formation would be initiated by\nH-atoms reacting with O, O2 and O3 , although the O3 + H pathway was considered to be\nthe most effective and O2 would play a mere catalytic role.\nNonetheless, O2 and O3 molecules have not so far been detected in interstellar ices\non dust grains, although their presence is presumed. Ozone non-detection may be partly\nexplained because its strongest ν3 (O-O) vibrational transition band at 1040 cm−1 (9.6\nμm) is swamped by the strong infrared absorption band of silicates at 10 μm which has\nbeen observed by ISO (Infrared Space Observatory) in the 2.4-25 μm region (e.g., spectrum\ntoward the protostar W33A, resolution ∼ 500-1000, Gibb et al. 2000).\n\n\f–4–\nAstrochemical models of dark clouds predict that condensed oxygen is likely to be a\nmajor component of apolar dust grains within interstellar clouds at 10 K. Recently, the\nO + H pathway (Dulieu et al. 2009) and the O2 + H pathway (Miyauchi et al. 2008;\nIoppolo et al. 2008; Matar et al. 2008) have been explored experimentally. All these\nexperiments show that these reactions lead to water formation, even though the efficiencies\nof intermediate reactions are still under debate. Besides O and O2 , ozone too can be present\nin icy mantles chemically processed by irradiation from Galactic cosmic-ray particles and\ninternal secondary UV field (Tielens & Hagen 1982; Mathis et al. 1983; Greenberg 1984;\nStrazzulla & Johnson 1991). Several laboratory works confirm the efficient production of\nO3 following energetic electron irradiation of pure oxygen ices (Bennett & Kaiser 2005;\nSivaraman et al. 2007), and UV, proton and ion irradiation of ice mixtures simulating\nrealistic analogues of interstellar ices (Ehrenfreund et al. 1992; Strazzulla et al. 1997;\nCooper et al. 2008). In solid phase, O2 and CO2 are easily dissociated by UV radiations\n(λ < 240 nm) and cosmic rays (c.r.) producing atomic O in the electronic ground state\n(3 P) and in the first electronically excited (1 D) state (Sivaraman et al. 2007):\nhν,c.r.\n\n(1)\n\nhν,c.r.\n\n(2)\n\nO2 −−−→ O + O\nCO2 −−−→ CO + O\n\nIn the interstellar grain mantles, the O(3 P) atoms in the ground state, which are in thermal\nequilibrium with the ice surface, react with O2 molecules to form O3 via the following\nreaction pathway:\nO + O2 −→ O3\n\n(3)\n\nThe formation of ozone via equation (3) is exothermic (∆f H ◦ = −1.48 eV).\nWhile the main ozone destruction reactions are:\nO3 + H −→ OH + O2\n\n(4)\n\n\f–5–\nhν,c.r.\n\nO3 −−−→ O2 + O\n\n(5)\n\nIn addition, in dark clouds hydrogen is mainly in its molecular form so H-atoms are a rather\nrare reactant with H/H2 ∼ 10−3 (Li & Goldsmith 2003). The number density of H-atoms\nis mostly governed by the destruction of H2 due to cosmic rays. This value, whatever the\ndensity of the cloud, is about 1 cm−3 . The O/H2 ratio remains approximately constant\n(10−4 ), thus the number of atomic O, unlike H, is proportional to the density of the cloud.\nSee, for example, Table 1 of Caselli et al. (2002); for a cloud density of 104 cm−3 the H/O\nratio is ∼ 1/0.75 while for a denser cloud with a density of 105 cm−3 the H/O ratio is ∼ 1/7.\nTherefore, for very dense clouds, O is the most abundant species in atomic form and it can\naccrete on grains and subsequently form O2 and O3 .\nIn their model, using a Monte Carlo approach, Cuppen & Herbst (2007) showed that\nunder dense cloud conditions the (O3 + H) pathway is the most efficient route leading\nto the formation of H2 O. Finally, it should be noted that, in the diverse models, some\nbarriers can be raised in order to increase one of the competitive reactions (Lee et al. 1978;\nCaselli et al. 2002; Parise 2004). Yet, such barriers can only be experimentally probed,\nbecause extrapolations from the gaseous data are quite uncertain.\nThis Letter is the first report of water formation via ozone hydrogenation in the series\nof recent experiments that aim to investigate water synthesis in the ISM. We present the\nevidence for the formation of water molecules from the reaction of O3 with D-atoms on\nnon-porous amorphous solid water ice under conditions relevant to the dense interstellar\nclouds.\n\n\f–6–\n2.\n\nExperimental procedures\n\nOur experiments were performed using the FORMOLISM set-up developed to study\nthe reaction and the interaction of atoms and molecules on surfaces simulating dust grains\nunder interstellar conditions. The apparatus is composed of an ultrahigh-vacuum chamber\nwith a base operating pressure of around 10−10 mbar. The sample holder, a copper cylinder\nblock, is attached to the cold finger of a closed-cycle He cryostat. It can be cooled to\n8 K. The temperature of the sample is measured using a calibrated silicon diode and a\nthermocouple (Cromel-AuFe) clamped on the back of the sample holder. The copper surface\nis covered with 100 layers of non-porous amorphous solid water (np-ASW) by condensation\nof water vapor on the cold sample maintained at 120 K. Water is sprayed through a\nmicrochannel array doser located 2 cm in front of the surface. This ice is amorphous but\nnon porous (Kimmel et al. 2001). The water ice substrate is then cooled to 10 K. More\ndetails can be obtained in Amiaud et al. (2006).\nOzone can be synthesized by two methods. One is an ex-situ method: O3 is prepared\nfrom gaseous O2 introduced in a glass bottle at a pressure of about 30 mbar. The O2 gas\nis then excited by a radiofrequency electric discharge (∼ 2 MHz) through a copper coil\nplaced around the O2 container. The blue ozone gas produced by the recombination of\nO2 and O atoms during the discharge is condensed on the bottom wall plunged in liquid\nnitrogen (77 K). Residual O2 is then removed by primary pumping. The glass bottle is then\nmounted onto the main set-up. Ozone is introduced into the vacuum chamber via a triply\ndifferentially pumped beam line aimed at the cold surface covered with H2 O ice. Due to the\nmetallic parts of the inlet system on which O3 in part dissociates, the beam is composed of\n70 % ozone and 30 % O2 . However, O2 is easily removed from the surface when the sample\nis held at 50 K. By varying the exposure time of the ozone beam, it is possible to vary the\ninitial coverage of the surface. The O3 flux was previously calibrated using temperature\n\n\f–7–\nprogrammed desorption (TPD) by determining the exposure time of a pure O2 beam\nrequired to saturate the O2 monolayer (1 monolayer = 1015 molecules cm−2 ) on np-ASW\nice. In the experiments described below we have deposited a maximum of half a monolayer\nof ozone under the same beam conditions used for calibrating the O2 flux. Owing to the\nnon-pure O3 beam, however, ozone exposures had a relative accuracy of ∼ 20 % and an\nabsolute accuracy of ∼ 30 %. Nevertheless, we did not see any significant effect due to the\ninitial coverage (between 0.1 and 0.5 monolayers ± 30 %).\nAn alternative technique of ozone production was also used, namely by depositing an\natomic O on top of an O2 layer pre-adsorbed on the surface and then producing ozone\nin-situ. The disadvantage of this technique is that the control of the initial amount of ozone\nhave to be checked after each exposure. Whichever technique was used to deposit ozone\nonto the surface, we obtained the same final results.\nAfter depositing ozone, an atomic D-beam aimed at the surface of the sample irradiates\nthe O3 -H2 O film maintained at 10 K. The D-atoms are produced by the dissociation of D2\nmolecules in a quartz tube using a Surfatron microwave discharge at 2.45 GHz. The rate\nof dissociation is ∼ 60 %. After the irradiation of ∼ 5 × 1015 D-atoms cm−2 , a TPD is\nperformed up to 180 K so that all the water ice desorbs. The TPD heating rate is 10 K/min\nfrom 10 to 180 K. The desorbed species are detected using a quadruple mass spectrometer\n(QMS).\n\n3.\n\nResults and discussion\n\nThe spectrum (a) in Figure 1 shows the TPD curve of mass 32 obtained after the\nexposure of half a layer of O3 on a np-ASW substrate held at 10 K (ex-situ synthesis).\nWe observe two peaks: the desorption peak at low temperature (∼ 30 K) represents the\n\n\f–8–\ndesorption of O2 molecules. These molecules have been deposited by the O2 fraction in the\nO3 beam, probably due to ozone destruction on the metallic walls of the gas inlet system.\nThe high-temperature peak at ∼ 60 K is the desorption of ozone. Mass 48 of O3 is also\nsimultaneously detected in smaller amount and is always proportional to the signal at mass\n32. In fact, for the most part O+\n2 fragments are detected, as a result of the O3 cracking\nin the head of the QMS. Also, the desorption of ozone from ASW surfaces is known to\noccur at around 60 K (Chaabouni et al. 2000; Borget et al. 2001). Although this may\nbe seen as an indirect measure, mass 32 gives information about O2 (below 50 K) and O3\n(above 50 K) desorption. As shown in the spectrum (a) of Fig. 1, O3 desorption is about\nthree times larger than that of O2 . This indicates that the ozone fraction deposited with\nthe ex-situ method is ∼ 70 %, the rest being O2 molecules. In order to deposit only ozone\nmolecules on the cold surface, we performed the exposure step with the water ice substrate\nheld at 50 K. Thus O2 molecules desorbing at 30 K were eliminated. Then we cooled the\nsample to 10 K before proceeding with the TPD. As shown in the spectrum (b) of Fig. 1,\nthe TPD peak observed comes from O3 desorbing at 60 K. By using these procedures, we\nare sure that at 10 K only reactions involving ozone and D-atoms will occur.\nFor this work, we performed a set of experiments with various D-atom exposures. In\nthe first one, D-atoms were sent onto the ozone-free water ice surface to check that no\nreaction occurred between D and the H2 O substrate to produce deuterated water molecules.\nThis result is displayed in the mass 19 spectrum (b) of Fig. 2. There is neither HDO nor\nD2 O desorption peak when D-atoms alone are deposited on the ASW ice substrate at 10 K\nas was previously noticed by Nagaoka et al. (2005) and Dulieu et al. (2009).\nIn a second experiment we exposed the np-ASW sample held at 10 K to D-atoms\nbefore ozone deposition. In this experiment ozone desorbs as if no atoms had been sent\nto the surface. This is because D-atoms form promptly D2 on non-porous water ice (e.g.,\n\n\f–9–\nCongiu et al. 2009) and apparently because ozone does not react with D2 (see below).\nThis proves that hydrogenation reactions take place at around 10 K and not at higher\ntemperatures since D-atoms react promptly at 10 K and furthermore they will have\ncompletely desorbed above 13 K (Amiaud et al. 2007).\nIn another experiment, D-atoms were sent onto the np-ASW surface previously exposed\nto 0.5 monolayers of O3 . In the spectrum (c) of Figure 1 we firstly observe the disappearance\nof the O3 peak. This suggests that all the ozone molecules have reacted. We also note that\nthe reaction D + O3 is very efficient, because the number of D-atoms sent to the surface is\nonly 10 times the number of O3 on the surface. Consequently, we can conclude that the\nD + O3 reaction - which is in competition with the D + D reaction in our experiment -\nproceeds on the ice surface with a small energy barrier. An estimation of the reaction rate\ncan be made, for example, with the formula used by Cuppen & Herbst (2007) to simulate\nthe surface reactions in their model:\nRreact = νr exp (−\n\n2a p\n2Ea μ),\nh\n\n(6)\n\nwhere νr is the attempt frequency for reaction, a the width of the barrier, μ the reduced\nmass and Ea the activation barrier. By taking Ea /kB = 450 K for the D + O3 reaction\n(Lee et al. 1978; Cuppen & Herbst 2007), we found that this reaction is very rapid\n(∼ 1 ps) if compared with the diffusion time of D-atoms on an amorphous water ice\n(τdiff = ∼ 10 ms on porous ASW ice, Matar et al. 2008).\nIn passing, we would like to point out that, over the last years, we have performed\nexperiments on water formation in space starting from O, O2 and now O3 . Even though\nwe cannot infer absolute reaction rates which are very hard to estimate we can attempt to\nmake relative comparisons. It should be noted that the destruction rate of ozone following\nD exposures is as important as the one for O + D and D + O3 reactions within the error bar\nof our experimental data. Hence we conclude that the D + O3 reaction proceeds without a\n\n\f– 10 –\nmeasurable activation barrier in the solid phase.\nObtained subsequently to the D + O3 experiment, the spectrum (a) of Figure 2 shows\na desorption peak of mass 19 at 160 K attributed to the singly deuterated water (HDO).\nThis clearly indicates that the reaction of D-atoms with O3 molecules on the ice surface is\nefficient and produces deuterated water molecules detected upon desorption of the whole\nice film. We also notice that nearly no desorption peak of D2 O (mass 20) is detected. This\nis due to thermally activated H/D exchanges during the phase transition of the water ice\n(Smith et al. 1997). Therefore, even if D2 O is actually formed on the surface, mostly water\nmolecules in the form of HDO are likely to desorb and be detected.\nThe formation of deuterated water molecules at Ts = 10 K from D-atoms and O3\nmolecules may then follow the successive reaction pathways:\nO3 + D −→ OD + O2\n\n(7)\n\nOD + D −→ D2O\n\n(8)\n\nO2 + D −→ DO2\n\n(9)\n\nDO2 + D −→ D2O2\n\n(10)\n\nD2 O2 + D −→ D2 O + D\n\n(11)\n\nWhereas at Ts greater than 130 K, as mentioned above, the following isotope exchange\nreaction is active:\nH2 O + D2 O −→ 2 HDO\n\n(12)\n\nOf course, the reversal of reaction (12) is also possible, but in our case it is statistically\nnegligible.\nAs for what concerns the intermediate products of the reaction scheme, we performed\nagain the D + O3 experiment but with a low exposure of D-atoms (0.01 monolayers) on\n\n\f– 11 –\n0.15 monolayers of O3 , thus with a dose of D insufficient to go on with the hydrogenation\nreactions leading to water molecules. This experiment shows that O3 molecules are not\nthoroughly consumed and also that O2 molecules appear on the surface indicating that\nreaction (7) proceeds at 10 K and that the formation of D2 O can proceed as well from the\nintermediate reaction (9).\nThe studied mechanism for water formation from the hydrogenation of ozone might be\nan explanation for the non- detection of O3 in the interstellar ices. In fact, ozone reacts\nrapidly with hydrogen atoms to form water molecules on a water ice surface at 10 K and\nunder conditions similar to those found in dense interstellar clouds. Likewise, the lack of a\nclear detection of O2 in interstellar ices may be explained by the high reactivity between O2\nand H-atoms reported in Miyauchi et al. 2008, Ioppolo et al. 2008, and Matar et al. 2008.\nIn addition, the OH + H2 reaction could also be a key surface reaction in dark\nclouds, because H2 (and D2 ) is present on the surface of the grains in large amounts\n(Kristensen et al. 2009). In our experiments too, there is a large amount of molecular\ndeuterium because of the incomplete dissociation of D2 in the D beam. At the moment it\nis not possible to us to probe explicitly the OH + H2 reaction, but we can investigate the\nrole of D2, by testing the O3 + D2 reaction. In order to do that, we have deposited a very\nlarge amount of D2 (∼ 1017 cm−2 ) on np-ASW ice held at 10 K and previously dosed with\nO3 . In this experiment, we did not detect any HDO, even when the surface was held at\n50 K during D2 deposition in order to overcome a possible activation barrier. Therefore,\nwe can fairly conclude that the D2 + O3 reaction does not proceed under our experimental\nconditions.\nUnlike the O3 + D2 reaction, O3 + D shows no barrier under our experimental\nconditions and this result shows clearly that ozone is a likely precursor to water formation\non a water ice layer at 10 K as proposed by Cuppen & Herbst (2007). This pathway is to\n\n\f– 12 –\nbe preferred in environments where the number of O atoms exceeds the number of H atoms,\nwhich is supposed to be the case in dark clouds with a density higher than 104 cm−3\n(Caselli et al. 2002). Unfortunately, our present data do not allow us to disentangle the\ndifferent intermediate reactions that lead to the formation of water. In order to investigate\nin more detail the kinetics of water formation at 10 K via ozone, we are developing an\nadditional IR diagnostic on FORMOLISM. This will allow us to see the appearance of some\nof the intermediate reactants and to provide accurate quantitative results.\n\n4.\n\nConclusions\n\nIn this paper we have shown that it is possible to form efficiently water molecules from\nthe reaction of O3 with hydrogen atoms on non-porous water ice. This reaction exhibits\nno activation barrier at 10 K, and is about as efficient as the pathways having O or O2 as\nprecursors. This experimental result corroborates theoretical studies that consider ozone as\none of the major actors of water formation in dark clouds.\n\nWe acknowledge the support of the French PCMI program funded by the CNRS, as\nwell as the strong financial support from the Conseil Régional d'Ile de France (SESAME\nprogram I-07-597/R), the Agence Nationale de la Recherche (ref. 07-0129) and the Conseil\nGénéral du Val d'Oise.\nHenda.Chaabouni@u-cergy.fr.\n\n\f– 13 –\nREFERENCES\nAmiaud L., Fillion J. H., Baouche S., Dulieu F., Momeni A., Lemaire J. L. 2006, J. Chem.\nPhys, 124, 94702\nAmiaud, L., Dulieu, F., Fillion. J.-H., Momeni, A., Lemaire, J. L. 2007, J. Chem. Phys,\n127, 144709\nBennett, C. J., & Kaiser, R. I. 2005, ApJ, 635, 1362\nBoogert, A. C. A., Pontoppidan, K. M., Lahuis, F., Jørgensen, J. K., Augereau, J.-C.,\nBlake, G. A., Brooke, T. Y., Brown, J., Dullemond, C. P., Evans, II, N. J., Geers,\nV., Hogerheijde, M. R., Kessler-Silacci, J., Knez, C., Morris, P., Noriega-Crespo, A.,\nSchöier, F. L., van Dishoeck, E. F., Allen, L. E., Harvey, P. M., Koerner, D. W.,\nMundy, L. G., Myers, P. C., Padgett, D. L., Sargent, A. I. & Stapelfeldt, K. R. 2004,\nApJS, 154, 359\nBorget, F., Chiavassa, T., Allouche, A., Aycard, J. P. 2001, J. Phys. Chem. B, 105, 449\nCaselli, P., Stantcheva, T., Shalabiea, O. M., Shematovich, V. I., & Herbst, E. 2002,\nPlanetary and Space Science, 50, 1257\nCeccarelli, C., Caselli, P., Herbst, E., Tielens, A. G. G. M., & Caux, E. 2007, in Protostars\nand Planets, ed. V. B. Reipurth, D. Jewitt, & K. Keil (U. Arizona Press), 47\nChaabouni, H., Schriver-Mazzuoli, L., & Schriver, A. 2000, J. Phys. Chem. A, 104, 6962\nCongiu, E., Matar, E., Kristensen, L., Dulieu, F and Lemaire, J. L. 2009, MNRAS, 397, L96\nCooper, P. D., Moore, M. H., and Hudson, R. L. 2008, Icarus, 194, 379\nCuppen, H.M., & Herbst, E. 2007 ApJ, 668, 294\n\n\f– 14 –\nDartois, E. 2005, Space Science Reviews, 119, 293\nDulieu, F. Amiaud, L., Congiu, E., Fillion, J. H., Matar, E., Momeni, A., Pirronello V.,\nLemaire J. L., submitted to A&A. 2009:ArXiv 0903.3120v1\nEhrenfreund, P., Breukers., R. and D'Hendecourt, L. & Greenberg, J. M. 1992, A&A, 260,\n431\nGibb, E. L., Whittet, D. C. B., Schutte, W. A., Boogert, A. C. A., Chiar, J. E., Ehrenfreund,\nP., Gerakines, P. A., Keane, J. V., Tielens, A. G. G. M., van Dishoeck, E. F. &\nKerkhof, O. 2000, ApJ, 536, 347\nGreenberg, J. M. 1984, Sci. Am, 250, 124\nIoppolo, S., Cuppen, H. M., Romanzin, C., van Dishoeck, E. F., & Linnartz, H. 2008,\nAstrophysical Journal, 686, 1474\nKimmel, G. A., Stevenson, K. P., Dohnalek, Z., Smith, R. S., & Kay, B. D. 2001, J. Chem.\nPhys, 114, 5284\nKristensen, L. E., Amiaud, L., Dulieu, F., Lemaire, J. L. 2009 submitted to A&A\nLee, J. H., Michael, J. V., Payne, W. A., & Stief, L. J. 1978, J. Chem. Phys, 69, 350\nLi, D., & Goldsmith, P. F.2003, ApJ, 585, 823\nMatar, E., Congiu, E., Dulieu, F., Momeni, A., & Lemaire, J. L. 2008, A&A Lett, 492, L17\nMathis, J. S., Mezger, P., & Panagia, N. 1983, A&A, 128, 212\nMiyauchi, N., Hidaka, H., Chigai, T., Nagaoka, A., Watanabe, N., & Kouchi, A. 2008,\nChemical Physics Letters, 456, 27\nNagaoka, A., Watanabe, N., & Kouchi, A. 2005, ApJ, 624, L29\n\n\f– 15 –\nParise, B., Ceccarelli, C., & Maret, S. 2005, A&A, 441, 171\nParise, B. 2004, PhD Thesis, CESR (Toulouse, France)\nPontopiddan, K. M., van Dishoeck, E.F., Dartois, E. 2004, A&A, 426, 925\nSchmitt, B., de Bergh, C., Festou, M (Eds.). 1998, Solar System Ices, Kluwer, Dordrecht\nSivaraman, B., Jamieson, C. S., Mason, N. J., & Kaiser, R. I. 2007, ApJ, 669, 1414\nSmith, S. R., Huang, C., & Kay , B. D., 1997, J. Phys. Chem. B 101, 6123\nStrazzulla, G., & Johnson, R. E. 1991, in Comets in the Post-Halley Era, ed. R. L. Newburn,\nJr., M. Neugebauer, & J. Rahe (Dordrecht: Kluwer), 243\nStrazzulla, G., Brucato, J. R., Palumbo, M. E., & Satorre, M. A. 1997, A&A, 321, 618\nTielens, A. G. G. M., & Hagen, W. 1982, A&A, 114, 245\n\nThis manuscript was prepared with the AAS LATEX macros v5.2.\n\n\f– 16 –\n\nDesorption rate (a. u.)\n\nMass 32\n\n(a)\n\n(b)\n(c)\n\n0\n\n10\n\n20\n\n30\n\n40\n\n50\n\n60\n\n70\n\n80\n\n90\n\nTemperature (K)\n\nFig. 1.- TPD spectra of mass 32 obtained after depositing ∼ 5 × 1014 molecules cm−2 of\nO3 on np-ASW: (a) O3 deposited at 10 K, (b) O3 deposited at 50 K and cooled to 10 K, (c)\nO3 deposited at 50 K, cooled to 10 K and irradiated with 5 × 1015 cm−2 of D-atoms.\n\nDesorption rate (a. u.)\n\nMass 19\n\n(a)\n(b)\n\n90 100 110 120 130 140 150 160 170 180\nTemperature (K)\n\nFig. 2.- TPD spectra of mass 19 (HDO) obtained after: (a) deposition of 5 × 1015 cm−2 Datoms on the np-ASW substrate at 10 K previously exposed to 5 × 1014 molecules cm−2 of\nO3 , (b) deposition of 2 × 1016 cm−2 D-atoms on the ozone-free water ice surface at 10 K .\n\n\f"}