{"id": "http://arxiv.org/abs/0810.3844v1", "guidislink": true, "updated": "2008-10-21T14:30:00Z", "updated_parsed": [2008, 10, 21, 14, 30, 0, 1, 295, 0], "published": "2008-10-21T14:30:00Z", "published_parsed": [2008, 10, 21, 14, 30, 0, 1, 295, 0], "title": "Alexey Vasilyevich Pogorelov, the mathematician of an incredible power", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0810.0036%2C0810.2019%2C0810.4797%2C0810.1853%2C0810.0690%2C0810.3448%2C0810.2186%2C0810.2064%2C0810.5330%2C0810.4474%2C0810.2709%2C0810.5259%2C0810.0164%2C0810.1532%2C0810.3131%2C0810.4655%2C0810.4089%2C0810.3505%2C0810.4052%2C0810.5407%2C0810.5280%2C0810.2908%2C0810.3652%2C0810.2595%2C0810.1812%2C0810.1305%2C0810.1193%2C0810.5702%2C0810.3700%2C0810.4321%2C0810.4375%2C0810.0582%2C0810.4805%2C0810.3919%2C0810.0927%2C0810.4660%2C0810.4920%2C0810.2525%2C0810.5058%2C0810.2653%2C0810.2330%2C0810.0914%2C0810.5661%2C0810.3420%2C0810.4120%2C0810.0447%2C0810.5105%2C0810.4561%2C0810.1357%2C0810.3033%2C0810.1823%2C0810.4104%2C0810.2978%2C0810.4513%2C0810.2059%2C0810.4892%2C0810.2435%2C0810.0052%2C0810.5215%2C0810.0092%2C0810.1850%2C0810.1883%2C0810.3232%2C0810.2143%2C0810.3859%2C0810.0329%2C0810.1136%2C0810.0228%2C0810.3969%2C0810.1877%2C0810.2751%2C0810.4707%2C0810.5053%2C0810.2901%2C0810.1694%2C0810.2614%2C0810.4886%2C0810.3905%2C0810.4977%2C0810.5255%2C0810.3554%2C0810.2921%2C0810.0844%2C0810.3019%2C0810.0196%2C0810.0122%2C0810.0847%2C0810.1581%2C0810.3876%2C0810.2814%2C0810.3714%2C0810.4511%2C0810.3844%2C0810.3543%2C0810.4546%2C0810.0464%2C0810.0342%2C0810.1707%2C0810.2351%2C0810.1388%2C0810.4215&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Alexey Vasilyevich Pogorelov, the mathematician of an incredible power"}, "summary": "Life and the mathematical legacy of the great mathematician A.V. Pogorelov.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0810.0036%2C0810.2019%2C0810.4797%2C0810.1853%2C0810.0690%2C0810.3448%2C0810.2186%2C0810.2064%2C0810.5330%2C0810.4474%2C0810.2709%2C0810.5259%2C0810.0164%2C0810.1532%2C0810.3131%2C0810.4655%2C0810.4089%2C0810.3505%2C0810.4052%2C0810.5407%2C0810.5280%2C0810.2908%2C0810.3652%2C0810.2595%2C0810.1812%2C0810.1305%2C0810.1193%2C0810.5702%2C0810.3700%2C0810.4321%2C0810.4375%2C0810.0582%2C0810.4805%2C0810.3919%2C0810.0927%2C0810.4660%2C0810.4920%2C0810.2525%2C0810.5058%2C0810.2653%2C0810.2330%2C0810.0914%2C0810.5661%2C0810.3420%2C0810.4120%2C0810.0447%2C0810.5105%2C0810.4561%2C0810.1357%2C0810.3033%2C0810.1823%2C0810.4104%2C0810.2978%2C0810.4513%2C0810.2059%2C0810.4892%2C0810.2435%2C0810.0052%2C0810.5215%2C0810.0092%2C0810.1850%2C0810.1883%2C0810.3232%2C0810.2143%2C0810.3859%2C0810.0329%2C0810.1136%2C0810.0228%2C0810.3969%2C0810.1877%2C0810.2751%2C0810.4707%2C0810.5053%2C0810.2901%2C0810.1694%2C0810.2614%2C0810.4886%2C0810.3905%2C0810.4977%2C0810.5255%2C0810.3554%2C0810.2921%2C0810.0844%2C0810.3019%2C0810.0196%2C0810.0122%2C0810.0847%2C0810.1581%2C0810.3876%2C0810.2814%2C0810.3714%2C0810.4511%2C0810.3844%2C0810.3543%2C0810.4546%2C0810.0464%2C0810.0342%2C0810.1707%2C0810.2351%2C0810.1388%2C0810.4215&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Life and the mathematical legacy of the great mathematician A.V. Pogorelov."}, "authors": ["Alexander A. Borisenko"], "author_detail": {"name": "Alexander A. Borisenko"}, "author": "Alexander A. Borisenko", "links": [{"href": "http://arxiv.org/abs/0810.3844v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0810.3844v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "math.HO", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "math.HO", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "math.AP", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "01A70, 53C45, 35J60", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0810.3844v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0810.3844v1", "arxiv_comment": null, "journal_reference": null, "doi": null, "fulltext": "arXiv:0810.3844v1 [math.HO] 21 Oct 2008\n\nAlexey Vasilyevich Pogorelov,\nthe mathematician of an incredible power\nA.A.Borisenko\nKharkov Karazin National University,\ne-mail: borisenk@univer.kharkov.ua\nOctober 22, 2018\nAbstract\nLife and the mathematical legacy of the great mathematician A.V. Pogorelov.\n\n1\n\nMathematical Subject Classification 2000: 01A70, 53C45, 35J60\nKeywords: convex surface, elliptic differential equation\n\nIntroduction.\nBy the beginning of the 20th century, the local differential geometry of surfaces was very welldeveloped, mostly by the means of the local analysis. In contrast, there was an apparent lack of\nmethods and results in the global geometry, \"geometry in the large\", in which both geometry and\nanalysis were equally helpless. A typical example of such a question is the classical problem of the\nrigidity of a closed convex surface (ovaloid). The contribution to this problem was made by brilliant mathematicians, such as Liebmann, Minkowski, Hilbert, Weyl, Blaschke. A major progress was\nachieved by Cohn-Vossen at the beginning of the 1920-th. He proved that isomeric C 3 ovaloids of\npositive Gauss curvature are congruent. Meanwhile, by a classical result of Cauchy, isomeric closed\nconvex polyhedrons are congruent. It seemed that these two results are the particular cases of a\ngeneral theorem of congruency of any two (generally speaking, irregular) isomeric ovaloids. No approaches to the problem in such a generality were visible. Similarly, it was not clear how to prove an\nisometric deformability of an ovaloid with a part removed, and to estimate the deformability of an\nincomplete ovaloid. Under an assumption of a sufficient regularity, these problems can be formulated\nin the language of nonlinear PDE's, but the theory of such equations was far from being well developed\nat that time.\nIn many cases, analytic tools were specifically developed to study a particular geometric problem.\nThis is illustrated by the problem of the existence of a closed convex surface with a prescribed analytic metric of positive Gauss curvature defined on a topological sphere. The general approach given\nby Weyl in 1916 was successfully completed in the 1930-th by G.Levi who developed a very delicate\ntechniques from the analytic theory of the Monge-Ampère equations. However, in the G.Levi's papers,\nanalysis was developed separately from geometry and was applied to geometry as a ready-made tool.\nMany other papers just gave ad hoc methods for separate problems. In fact, at that time, the fundamental problems of deformation of surfaces and many other problems of global geometry remained\nunapproachable.\nAnother area of active research at the beginning of the 20th century was the theory of convex bodies\nin the Euclidean space, including various geometric properties, the mixed volumes and inequalities.\n1 This\n\npaper is the English translation of [25]\n\n1\n\n\fThe cornerstone book \"Theory of convex bodies\" by T.Bonnezen and T.Fenchel's published in 1934\nin German contained a complete up-to-date account of the research in that area and an extensive\nbibliography. This book has not lost its value till nowadays. In 2001, it was translated into Russian\nby V.A.Zalgaller. However, the study of convex surface was beyond the scope of this book, and most\nprobably, outside of the area of interest of researchers at that time.\n\n1\n\nIntrinsic geometry of convex surfaces.\n\nEarly papers of A.D.Aleksandrov were focused on the same questions. Starting with the classical\nresults of Minkowski, Alexander Danilovich Aleksandrov established new inequalities for the mixed\nvolumes of convex bodies. Curiously enough, forty years later, the algebraic analogues of his inequalities obtained as a byproduct of his study, were successfully applied to the well-known Van-der-Waerden\nproblem on the estimation of the permanent, posed in 1926. Aleksandrov's inequalities for the mixed\nvolumes also have interesting generalizations and applications in algebraic geometry, in the theory of\nnonlinear elliptic equations and even in stochastic processes.\nSimultaneously, A.D.Aleksandrov applied the tools from the measure theory and functional analysis\nto the theory of convex bodies. He introduced a functional space generated by the support functions\nand special measures on them, the \"surface functions\" and the related \"curvature functions\". He\nproved that a convex body is determined uniquely, up to translation, by the curvature function.\nThis theorem includes, as the limiting cases, the theorems of Christoffel and of Minkowski. In the\ncourse of proof, Alexander Danilovich introduced the concept of the generalized differential equation\nin measures and of the corresponding generalized solution.\nIn 1941, A.D.Aleksandrov began the study of the intrinsic geometry of convex surfaces. He widened\nthe class of regular convex surfaces to the class of arbitrary convex surfaces (defined as domains on the\nboundary of a convex body). The problems within that wider class required new techniques, beyond\nthe Gaussian geometry of regular surfaces. It was necessary to understand the intrinsic geometry of an\narbitrary convex surface (the properties depending on the measurements on the surface itself) and to\ndevelop the tools for studying these properties, and then to find the connection between the intrinsic\nand the extrinsic geometry of an arbitrary convex surface. A.D.Aleksandrov constructed the intrinsic\ngeometry of convex (and of arbitrary) surfaces starting from the general concept of the metric space.\nLet R be a metric space, a set such that for each pair of elements X, Y ∈ R there defined a number\nρ(X, Y ), the distance, satisfying the following axioms:\n1. ρ(X, Y ) > 0 and ρ(X, Y ) = 0 if and only if X = Y.\n2. ρ(X, Y ) = ρ(Y, X).\n3. ρ(X, Y ) + ρ(Y, Z) > ρ(X, Z) (the triangle inequality).\nFor example, the Euclidean space with the usual distance between the points is a metric space. A\ncurve γ in a metric space R is a continuous image of a segment [a, b] considered together with the\ncontinuous mapping F : [a, b] → R. Just as in the for the Euclidean space, one can introduce the\nconcept of the length of a curve in a metric space by defining\nlγ = sup Σ ρ(F (tk−1 ), F (tk )), a = t0 6 t1 6 t2 * * * 6 tn = b,\nwhere ρ(F (tk−1 ), F (tk )) is the distance between F (tk−1 ) and F (tk ) in R, and the supremum is taken\nover all finite partitions of the segment [a, b] by the tk 's. The length so defined is additive: if a curve\nγ is composed by the curves γ1 and γ2 , then l(γ) = l(γ1 ) + l(γ2 ). Similar to the Euclidean space, in a\nmetric space, the set of curves of bounded length in a compact domain is compact, that is, any infinite\nsequence of such curves contains a converging subsequence. Moreover, the length of the limiting curve\nis not greater than the lower limit of the lengths of curves of the subsequence. Suppose that any\ntwo points X, Y in R can be connected by a rectifiable curve. Then the intrinsic distance ρ∗ (X, Y )\n2\n\n\fbetween X, Y in R can be defined as the infimum of the lengths of all the rectifiable curves connecting\nX and Y . It is easy to see that ρ∗ satisfies the axioms 1,2,3. The metric ρ∗ is called the intrinsic\nmetric on R. If ρ(X, Y ) = ρ∗ (X, Y ) for any X and Y , then R is called a space with an intrinsic metric\n(the length space). For a metric space R to be isometric to a surface in the Euclidean space, its metric\nmust necessarily be intrinsic.\nLet R be a manifold with an intrinsic metric. A curve γ in R is called a shortest path if its length\nis equal to the distance between the endpoints, hence being not greater than the length of any other\ncurve joining the same points. Each segment of a shortest path is also a shortest path. The limiting\ncurve for a converging sequence of shortest paths is again a shortest path.\nIn general, not every two points on a manifold can be connected by a shortest path, but every\npoint of a manifold has a neighborhood such that any two points from it can be joined by a shortest\npath. If a manifold R is metric complete, that is, if any closed bounded subset of it is compact,\nthen any two points of R can be connected by a shortest path. In R, one can define a triangle, a\npolygon, a polygonal line, etc. in the usual way. The definition of the angle between shortest paths\nis fundamental for the theory. The idea is to compare a triangle in R to a triangle with the same\nsides on the plane. Let O ∈ R and let OA and OB be the shortest paths. Choose arbitrary points\nX ∈ OA and Y ∈ OB. Let O′ X ′ Y ′ be a triangle on the plane with the same sides as OXY . Let\nx = ρ(O, X), y = ρ(O, Y ) and let α(x, y) be the angle at O′ of O′ X ′ Y ′ . The upper angle between the\nshortest paths OX and OY is defined as the upper limit of α(x, y) when x, y → 0.\nUsing the notion of the angle, one can define the excess of a triangle as α + β + γ − π, where α, β, γ\nare the upper angles between the sides. At this point, one can already define two-dimensional spaces\nof non-negative curvature. Namely, R is called a space of non-negative curvature if any point of R has\na neighborhood such that excess of each triangle lying in it is non-negative. Each convex surface is a\nspace of non-negative curvature. The space R has non-negative curvature if and only if the function\nα(x, y) is non-increasing: if x1 6 x2 and y1 6 y2 , then α(x1 , y1 ) > α(x2 , y2 ). From the monotonicity\nof α it follows that the upper limit can be replaced by the usual limit, which gives the angle between\nthe shortest paths OX and OY .\nThe next step is to define the curvature. In the sense of A.D.Aleksandrov, the curvature is an\nadditive function of sets. The extrinsic curvature of a set M on a convex surface is the area of the\nspherical image of M . The intrinsic curvature, as an object of the intrinsic geometry of a convex\nsurface, is first defined for the three \"basic sets\": 1) the curvature of an open triangle is its excess;\n2) the curvature of an open shortest path is zero; 3) the curvature of a point equals 2π − θ, where\nθ is the full angle around the point. Then the curvature is (uniquely) defined by additivity for all\nBorel sets. A.D.Aleksandrov proved that the curvature of any Borel set on a convex surface equals\nthe area of its spherical image, the Gauss's Theorema Egregium for arbitrary convex surfaces. He\nestablished the fundamental connection between the intrinsic geometry and the extrinsic properties\nof a surface, which implies a series of important results. In particular, the relative curvature of a\ndomain on a convex surface (the ratio of the area of the spherical image to the area of the domain)\nis an isometric invariant. So the Aleksandrov's class of convex surfaces of bounded relative curvature\nadmits an intrinsic-geometric definition. A.D.Aleksandrov proved that a complete convex surface of\nbounded relative curvature whose metric is not everywhere Euclidean is smooth, and an incomplete\nsurface can be non-smooth only along straight edges with the endpoints on the boundary. This was the\nfirst result on the dependence of the regularity of a convex surface on the regularity of its intrinsic\nmetric.\nIn contrast to the Gauss theory of surfaces, where the analytic methods dominate, in the Aleksandrov's theory, the central role is played by the geometric methods. The main tool is the approximation\nof the surface by so-called manifolds with polyhedral metric (the corresponding method in extrinsic\ngeometry is the approximation of a general convex surface by convex polyhedra). A simple and natural idea of polyhedral approximation enabled one to prove the results first for polyhedra, and then,\npassing to the limit, in the general case. These are the main tools of the curvature theory of general\nconvex surfaces which was briefly sketched above.\nLet P be a closed convex polyhedron. Suppose that it is cut by polygonal lines into n parts, each\n3\n\n\fof which is then unfolded flat to a planar polygon Gi , 1 ≤ i ≤ n. The system of polygons G1 , . . . , Gn ,\nwith a given identification of their vertices and sides, is called\nF the net of the polyhedron P . Clearly,\neach net satisfies the following conditions: 1) the complex i Gi /identification is homeomorphic to\nthe sphere; 2) the identified edges are equal; 3) the sum of the angles at the identified vertices is at\nmost 2π.\nNow suppose that we are given planar polygons Gi and an identification of their sides and vertices,\nwhich satisfies the conditions 1),2) and 3). Then, by the Aleksandrov's \"polyhedron gluing theorem\",\nit is possible to glue a closed convex polyhedron (possibly bending the polygons G1 , . . . , Gn along\nstraight lines). This theorem gives the answer to the Weyl problem for polyhedral metrics. Its proof\nuses rather general methods based on the topological theorem on the invariance of domain. Using the\nsame method A.D.Aleksandrov solved the Minkowski problem of the existence of a convex polyhedron\nwith the prescribed areas and directions of the faces, the problem of the existence of a polyhedron\nwith the prescribed curvatures and many others. This method proved to be a very effective general\ntool to a wide class of problems in the area.\nUsing the \"polyhedron gluing theorem\" A.D.Aleksandrov gave a surprisingly simple solution to\nthe Weyl problem in the most general settings: a two-dimensional metric space of positive curvature\nhomeomorphic to the sphere is isomeric to a closed convex surface. This illustrates the power of the\ndirect geometric methods. Alexander Danilovich used the polyhedron gluing theorem as the first step\nin the deep development of the whole theory of deformations of convex surfaces. He introduced the\n\"gluing method\" based on his \"general gluing up theorem\". Below we briefly explain the main ideas\nof his method.\nSuppose we are given a finite number of domains in two-dimensional spaces of positive curvature.\nImagine that these domains are cut out from their spaces and some parts of their boundaries are\nidentified (\"glued together\") in such a way that the resulting space is a two-dimensional manifold\nM . If the identified parts of the boundaries have the same lengths, then we can define in a natural\nway an intrinsic metric on M . A.D.Aleksandrov gave necessary and sufficient conditions for M to\nbe a space of positive curvature. These conditions are simple, natural and effective. In particular,\nif M is homeomorphic to the sphere, then it can be realized as a closed convex surface. This is an\nextremely general theorem on the existence of a convex surface glued from the pieces of abstractly\ngiven manifolds or from the pieces of convex surfaces. Applying the gluing method A.D.Aleksandrov\nproved the following local theorem: every point of a two-dimensional space R has a neighborhood\nisomeric to a convex surface if and only if R is a space of positive curvature. This solves the main\nproblem of the intrinsic geometry of convex surfaces: the metrics of convex surfaces are characterized\nin a purely intrinsic way. Using the gluing method one can prove that an ovaloid with a piece removed\nadmits deformations by gluing in different pieces to close the ovaloid up. One can prove, for example,\nthat a half of an ellipsoid can be deformed to a closed convex surface, and many other similar results.\nIn essence, the gluing method combined with the theorems on realizability of a metric of positive\ncurvature by a convex surface allowed to solve, in the most general form, all the main problems of the\ntheory of deformation of convex surfaces [22, 23, 32].\nIt will not be an exaggeration to say that A.D.Aleksandrov has created a whole new Universe,\nthe geometry of general convex surfaces (a popular joke at the Conference on his 75th birthday in\nNovosibirsk was \"A.D.Aleksandrov is not the God, but is Godlike\", which also was a reference to his\nlarge beard). But the new Universe has to be inhabited, and this is where the difficulties and problems\nstarted.\nOne of the difficult open problems was the problem of congruency of closed isomeric convex surfaces\nand of complete noncompact isometric convex surfaces. Another problem concerned the regularity of\nthe convex surfaces: the isometric immersion of an analytic metric of a positive Gaussian curvature\ngiven by the Aleksandrov's theorem produces only a C 1 -regular surface. The \"gluing\" method applied\nto a regular convex surface of a positive Gauss curvature only guarantees the convexity and, by the\nAleksandrov's theorem on limited relative curvature, the C 1 -regularity.\nThe Minkowski problem asks whether there exists a closed convex surface whose Gauss curvature\nK(n) is a given function of the outer normal n. Minkowski himself proved that if the integral of\n4\n\n\fn/K(n) over the unit sphere is zero, then there exists a unique (up to translation) closed convex\nsurface with the Gauss curvature K(n). However, one can say nothing about the regularity of the\nsurface, even when K(n) is analytic. Later Levi showed that if K(n) is analytic, then the resulting\nsurface is also analytic. In connection with these results one may ask several questions on the regularity\nof the resulting surface. Namely, is it true that for a regular function K(n) the Minkowski problem\nhas a regular solution? More precisely, if the metric is of the class C k , what is the regularity class of\nthe surface? Is it true that the convex surface (not necessarily closed) is regular provided the function\nK(n) is regular?\nWithout the answers to these questions the new theory was not complete. And the person who\nfound the answers was A.V.Pogorelov.\n\n2\n\nEarly years of A.V.Pogorelov\n\nA.V.Pogorelov was born on March 3, 1919, in Korocha town near Belgorod (Russia). On his farther's\n\"farm\" there was just one cow and one horse. During the collectivization they were taken from him.\nOnce his father came to the collective-farm stable and found his horse exhausted, dying from thirst,\nwhile the groom was drank. Vasily Stepanovich hit the groom, a former pauper. This incident was\nreported as if a kulak has beaten a peasant, and Vasily Stepanovich was forced to escape the town,\nwith wife Ekaterina Ivanovna, without even taking the children. A week later Ekaterina Ivanovna\nhas secretly returned for the children. This is how A.V.Pogorelov came to Kharkov, where his father\nbecame a construction worker on the building of the tractor factory. A.V.Pogorelov told me the story\nof how his parents have suffered during the collectivization I have heard from him only in 2000. In\nmy opinion, these events had a strong influence on his life and on the way of his public behavior.\nHe was always very cautious in expressions and liked to quote his mother who kept saying: silence is\ngold. However, he never did the things contradicting his political views. Several times, he successfully\nescaped becoming a member of the Communist Party (which was almost compulsory for a person of\nhis scale in the USSR). As far as I know, he never signed any letters of condemnation of dissidents,\nbut, again, any letters in their support, as well. Several times he was elected to the Supreme Soviet\nof Ukraine (although, as he said later, against his will).\nThe mathematical abilities of A.V.Pogorelov became apparent already at school. His school nickname was Pascal. He became the winner of one of the first school mathematical competitions organized\nby the Kharkov University, and then of several All-Ukrainian Mathematical Olympiads. Another talent of A.V.Pogorelov was the painting. The parents did not know, which profession to choose for\nhim. His mother asked the son's mathematics teacher for advice. He had a look at the paintings\nand said that the boy has brilliant abilities, but in the time of industrialization the painting will not\ngive the resource for life. This advice determined their choice. In 1937, Alexey Vasilyevich became a\nstudent of the Department of Mathematics at the Faculty of Physics and Mathematics of the Kharkov\nUniversity.\nHis passion to mathematics immediately drew the attention of the teachers. Professor P.A.Solovjev\ngave him the book by T.Bonnezen and V.Fenchel \"Theory of convex bodies\". From that moment and\nfor the rest of his life, geometry became the main interest of Alexey Vasilyevich. His study was\ninterrupted by the War. He was conscripted and sent to study at the Air Force Zhukovski Academy.\nBut he still thinks about geometry. In August 1943, in a letter to Professor Ya.P.Blank he says: \"Very\nmuch I regret, that I left in Kharkov the abstracts of Bonnezen and Fenchel on the convex bodies.\nThere are many interesting problems in geometry \"in the large\"... Do you have any interesting problem\nof geometry \"in the large\" or of geometry in general in mind?\"\nAfter graduation from the Academy in 1945, A.V.Pogorelov starts his work as a designer engineer at\nthe Central Aero-Hydrodynamic Institute. But the desire to finish his university education (he finished\nfour out of five years) and to work in geometry brings him to Moscow University. A.V.Pogorelov asks\nacademician I.G.Petrovsky, the head of the Department of Mechanics and Mathematics, whether\nhe can finish his education. When Petrovski learnt that Alexey Vasilyevich has already graduated\n\n5\n\n\ffrom the Zhukovski Academy, he decided that there was no need in the formal completion of the\nuniversity. When A.V.Pogorelov expressed his interest in geometry, I.G.Petrovski advised him to\ncontact V.F.Kagan. V.F.Kagan asked, what area of geometry was Alexey Vasilyevich interested in,\nand the answer was: convex geometry. Kagan said that this is not his field of expertise and suggested to\ncontact A.D.Aleksandrov who was in Moscow at that time preparing to a mount climbing expedition\nat the B.N.Delone apartment (A.D.Aleksandrov was a Master of Sports on mount climbing, and\nB.N.Delone was the pioneer of Soviet mount climbing).\nThe first audition lasted for ten minutes. Sitting on a backpack, A.D.Aleksandrov asked Alexey\nVasilyevich the following question: is it true, that on a closed convex surface of the Gauss curvature\nK 6 1, any geodesic segment of lengths at most π is minimizing? It took A.V. a year to answer\nthis question (in affirmative) and to publish the result in 1946 in [1]. The multidimensional generalization of his theorem is a well-known theorem of Riemannian geometry, which was proved in 1959\nby W.Klingenberg: on a complete simply connected Riemannian\nmanifold M 2n of sectional curvature\n√\nsatisfying 0 < Kσ 6 λ, a geodesic of the length 6 π/ λ is minimizing. In the odd-dimensional case,\none needs a two-sided bound for the curvature to obtain the same result, namely 0 < 41 λ 6 Kσ 6 λ\n(and the inequality cannot be improved).\nFew years ago, I asked Alexey Vasilyevich, why the Soviet mathematicians at that time showed not\nmuch interest to the global Riemannian geometry. He answered: \"We had enough interesting problems\nto think about\". However, as V.A.Toponogov told me later, the first person who appreciated his\ncomparison theorem for triangles in a Riemannian space was A.V.Pogorelov (in my opinion, it would\nbe more correct to call this theorem the Aleksandrov-Toponogov theorem, since A.D.Aleksandrov\ndiscovered and proved it for general convex surfaces in the three-dimensional Euclidean space).\nAlexey Vasilyevich became a postgraduate-in-correspondence at Moscow State University under\nthe supervision of professor N.V.Efimov. Having read the manuscript of the A.D.Aleksandrov's book\n\"Intrinsic geometry of convex surfaces\", he starts his work in the geometry of general convex surfaces.\nOne of the main roles of a supervisor, in the opinion of N.V.Efimov, was to inspire a post-graduate\nstudent to solving difficult and challenging problems. I gave numerous talks both at the N.V.Efimov's\nand the A.V.Pogorelov's seminars. They were very different by style. The N.V.Efimov's seminar\nwas long gathered, then the talk lasted for two hours or more, and the talk was always praised very\nwarmly, so it was almost impossible to understand the real value of the result. A.V. always started\non time, very punctually. The report lasted for at most an hour. A.V. did not like to go through the\ndetails of the proof (probably because in many cases, after the theorem was stated, he could prove it\nimmediately).\nIn the estimation of the results he was strict and even severe. For example, in 1968, three applicants\nfor the Doctor degree presented their theses at the Pogorelov's seminar in Kharkov. He supported only\none of them, V.A.Toponogov, and rejected the other two, who went to Novosibirsk to A.D.Aleksandrov.\nAll three theses were later successfully defended.\nA.V. praised rarely, but when he did – that meant that the result was really good. He had a very\nfast thinking, an enormous geometric intuition, and grasped the essence of the result very fast. Many\nseminar participants were afraid to ask questions not to look foolish.\nIn 1947, A.V.Pogorelov defended his Candidate thesis. The main result of his thesis was the\nfollowing theorem: every general closed convex surface possesses three closed quasi-geodesics [2]. This\ntheorem generalizes the Lusternik - Shnirelman theorem on the existence of three closed geodesic on\na closed regular convex surface (a quasi-geodesic is a generalization of a geodesics; both the left and\nthe right \"turns\" of a quasi-geodesic are nonnegative; for instance, the union of two generatrices of a\nround cone dividing the cone angle in two halves is a quasi-geodesic).\nAfter defending his Candidate thesis, A.V. discharges from the military service and moves to\nKharkov (probably, this was not an easy thing to do at that time: he was discharges by the same\nOrder of the Defence Minister, as the son of M.M.Litvinov, the former Soviet Minister for Foreign\nAffairs). In one year, he defends his Doctor Thesis on the unique determination of a convex surface\nof bounded relative curvature. Soon after that, he proves the theorem on the unique determination\nin the most general settings [9].\n6\n\n\f3\n\nRigidity of Closed Convex Surfaces.\n\nIn 1813, Cauchy proved the following remarkable uniqueness theorem.\nCauchy Theorem. Two closed convex polyhedra, which are equally-composed (that is, whose faces\nare congruent and arranged in the same order) are congruent\nA.D.Aleksandrov proved that it is possible, without changing the Cauchy's proof, to replace the\nassumption of being equally composed with a weaker assumption of being isometric (it is easy to\nsee that the convexity assumption cannot be dropped: consider, for example, a cubic house with a\nfour-chute roof and the same house with the roof \"pushed inside\"). The fact that a convex surface is\nuniquely determined by its metric was proved for C 3 -regular closed convex surfaces of positive Gauss\ncurvature by S.Kohn-Fossen in 1923 and for C 2 -surfaces of non-negative Gauss curvature by Herglotz\nin 1942.\nA.V.Pogorelov proved the generalization of the Cauchy Theorem to the case of arbitrary convex\nsurfaces:\nTheorem 1 (A.V.Pogorelov, 1949, [5]). Two closed isomeric convex surfaces in the three-dimensional\nEuclidean space are congruent.\nThe incredible power of this theorem lies in the fact that it imposes no regularity assumptions on\nthe surfaces whatsoever. The surfaces can have edges, conic points, etc. The only extrinsic hypothesis\nis the convexity (which cannot be dropped: consider the sphere and the same sphere with a small\ncap cut out and reflected inside). The proof of the Cauchy Theorem in these most general settings\nrequired more than a century, and even now, after more than half-a-century after its publication, no\nsimpler or shorter proof is known.\nA.V.Pogorelov's proof goes as follows. Suppose that there are two non-congruent isomeric closed\nconvex surfaces F0 and F . Then, using the Aleksandrov's gluing theorem and his generalization of\nthe Cauchy theorem, it is possible to show that in an arbitrarily small neighbourhood of F0 , there\nexists a convex surface F1 isometric and non-congruent to F0 . The next step in the proof is the\n\"mixing\" of surfaces. The mixing of F0 and F1 is a family of surfaces Fλ , λ ∈ [0, 1], where the surface\nFλ consists of the points in the space which divide the segments, connecting the points of F0 and\nF1 corresponding by the isometry in the ratio λ : (1 − λ). Then for some λ close to 12 the surfaces\nFλ and F1−λ appeare to be isomeric. A convex surface is said to be in a canonical position if it is\na graph of a convex function over the xy-plane and all its support planes form an angle less than\nπ/2 with that plane. Two curves lying on two isometric surfaces in a canonical position, are called\nnormal equidistant curves, if they correspond to each other by the isometry and the corresponding\npoints of the curves are on the same distance from the xy-plane. The contradiction, which proves the\ntheorem, is as follows: on one hand, as it can be proved, non-congruent isometric convex surfaces in\na canonical position cannot contain normal equidistant curves; on the other hand, such curves can\nbe explicitly produced on Fλ and F1−λ . This requires the theory of curves of the bounded rotation\nvariation, developed by A.D.Aleksandrov and V.A.Zalgaller, and also numerous geometric synthetic\nconstructions introduced by A.V.Pogorelov. The need for these constructions arose from the lack of\nanalytic tools to study conic and edge points on a convex surface. All that makes the proof extremely\ndifficult to comprehend (in 1970, when I was giving my first talk on a seminar in Leningrad, one of\nthe questions was, whether I managed to go through all the details of the proof of the Pogorelov's\ntheorem). Another proof of this theorem follows from the rigidity theorem of closed convex surfaces,\nthat was also proved by A.V.Pogorelov [9]. Yet another proof can be deduced from the estimation of\na deformation of a closed convex surface under a deformation of its metric found by Yu.A.Volkov [42].\nFor solving the problem of the unique determination of a convex surface by its metric Alexey Vasilyevich was awarded the Stalin prize of the second degree. Once, in 1951, an unexpected telegram from\nKiev has arrived saying that the Academy of Sciences nominated A.V.Pogorelov as a Correspondent\nMember. N.I.Ahiezer said: \"Let us pretend that we did not receive the telegram. The University\nitself will nominate you\".\n7\n\n\fAn infinitesimal bending of a surface is an infinitesimal isometric deformation. The corresponding\ndeformation field is called the bending field. A bending field is called trivial if it is the derivative at\nzero of (a differentiable) rigid motion of a surface. A surface is called rigid, if every its bending field\nis trivial. W.Blaschke proved that a closed regular convex surface of a positive Gauss is rigid.\nLet F be a regular surface with the position vector r = r(u, v) and let τ (u, v) be a smooth vector\nfield. The deformation r = r(u, v) + tτ (u, v) is an infinitesimal bending if and only if\nhru , τu i = 0,\n\nhru , τv i + hrv , τu i = 0,\n\nhrv , τv i = 0.\n\nFor the z-component ζ of the field τ we obtain the equation\nzxx ζyy − 2zxy ζxy + zyy ζxx = 0,\n\n(1)\n\nwhich implies that the surface z = ζ(x, y) has non-positive Gauss curvature provided the curvature of\nF is positive.\nFor an infinitesimal bending of a general convex surface, equation (1) holds almost everywhere and\nwe have the following lemma.\nMain Lemma. If z = z(x, y) is a convex surface containing no plane domains and ζ(x, y) is the\nz-component of its infinitesimal bending field, then the surface z = ζ(x, y) has non-positive curvature,\nin the sense that it contains no points of the strict convexity.\nIn the regular case, this means that the Gauss curvature is non-positive. Using this fundamental\nfact A.V.Pogorelov proved the following theorem.\nTheorem 2. Every closed convex surface without plane domains is rigid, that is, the only possible\ninfinitesimal bending field are of the form τ = a × r + b, where r is the position vector of the surface,\nand a, b are constant vectors. A closed convex surface containing plane domains is rigid outside these\ndomains.\nA.V.Pogorelov's results on the unique determination and on the rigidity of convex surfaces formed\nthe basis of the geometric theory of shells. As far as I know, the physicists first disagreed with his\ntheory, some in quite an aggresive way. As E.P.Senkin (my PhD supervisor) was telling, when A. V.\nshowed them the results of the experiments which confirmed his theory on the bending of shells they\nsaid that the shells are \"pressed by a finger\".\nA.V.Pogorelov's moving to Kharkov was really successful. N.I.Ahiezer drawn A.V.'s attention to\nthe S.N.Bernstein's papers on the Dirichlet problem for elliptic equations [24]. Combining the analytic\nresults of S.N.Bernstein with the synthetic geometric methods A.V.Pogorelov managed to solve the\nproblem of the regularity of a convex surface with a regular metric of positive curvature and of the\nregularity of a convex surface obtained as the solution of the Minkowski problem, with a regular\npositive Gauss curvature K(n).\nUp to 1934, S.N.Bernstein worked in Kharkov, but then, after publishing a paper against the\ngroundless usage of Marxism in mathematics, he was forced to leave. After that, a public persecution\nof S. N. Bernstein began. It worse saying that the first All-Union Mathematical Congress was held in\nKharkov thanks to the fact that S.N.Bernstein worked here.\nOne may regard A.V.Pogorelov as an S.N.Bernstein's successor in the field of differential equations.\nQuite often, A.V. used the Bernstein's remarkable theorem which says that a non-parametric surface\nof non-positive Gauss curvature defined over the whole plane and with a slower than a linear growth,\nis a cylinder.\n\n4\n\nRegularity of convex surfaces with a regular metric the and\nMinkowski problem.\n\nThe regularity of a surface is equivalent to the regularity of the solutions of the Darboux equation\n(zuu − Γ111 zu − Γ211 zv )(zvv − Γ122 zu − Γ222 zv ) − (zuv − Γ112 zu − Γ212 zv )2 = K(E − zu2 )(G − zu2 ) − (F − zu zv )2 ,\n8\n\n\fwhere E, F, G are the coefficients of the first fundamental form, Γkij are the Christoffel symbols, and\nz is the z-coordinate of the position vector. Its coefficients are determined only by the metric of the\nsurface. This nonlinear equation is the Monge-Ampère elliptic equation provided the Gauss curvature\nis positive. The question is how the regularity of solutions, for a convex surface F , depends on the\nregularity of coefficients. A.V.Pogorelov split the solution into the three stages. At the first stage, he\nconsidered a cap C, the intersection of F with a closed half-space bounded by a plane L. He obtained\nthe estimates depending only on the metric for the angle between the tangent plane to C and the\nplane L, and also for the normal curvatures of C. The estimates for the normal curvatures at the\ninterior points of C depend only on the metric and on the distance to L. To estimate the normal\ncurvatures, he used the method of auxiliary functions going back to S.N.Bernstein. The main difficulty,\nwhich was successfully overcame by A.V., is to choose the correct auxiliary function for every specific\nproblem. These estimates correspond to the a priori estimates of the first and the second derivatives of\na solution of the Darboux equation depending on the coefficients of the equation and their derivatives.\nThis means that, assuming the regularity of a solution of the Darboux equation, one gives the estimates\nof the derivatives of that solution depending on the coefficients and their derivatives, the distance from\nthe boundary and the derivatives of the solution of lower orders. The key point is that the a priori\nestimates for the first and the second derivatives are obtained from the geometric arguments (similar\nestimations were obtained by A. V. in many other problems, as well). From this point on, one obtains\nthe a priori estimates for the higher derivatives using only analytic methods. Let a function z = z(x, y)\nin a domain G satisfies an elliptic PDE\nF (x, y, z, zx, zy , zxx , zyy , zxy ) = 0.\n\n(2)\n\nThen the estimates for the third derivatives of z at a point (x, y) depend on the distance from (x, y) to\nthe boundary of G, and also on the suprema of the modules of the function z and its derivatives up to\nthe second order, the suprema of the modules of the derivatives of the function F up to the third order,\nand the suprema of the modules of (Fr )−1 , (Ft )−1 , (Fr Ft − 14 Fs2 )−1 , where r = zxx , s = zxy , t = zyy .\nThe estimates for the fourth and the subsequent derivatives of z are based on the Schauder theory of\nthe linear elliptic PDE's. If G is the disc x2 + y 2 6 ε2 , then the estimates on the k-th derivatives of z\nwhen k ≥ 3 depend on the suprema of the module of z and its derivatives up to the second order in\nG, the suprema of the modules of (Fr )−1 , (Ft )−1 , (Fr Ft − 41 Fs2 )−1 , and the suprema of the modules\nof the derivatives of F up to order s, where s = 3 for k = 3 and s = k − 1 for k > 3. Moreover, the\nsame values allow one to obtain the estimates for the least Hölder's constants for the k-th derivatives\nof z, with an arbitrary exponent α (0 < α < 1).\nOn the second stage, an analytic metric g of positive Gauss curvature with positive geodesic\ncurvature of the boundary defined in a disc is realized as a convex analytic cap, which can then be\nanalytically extended over the boundary. To do that, A.V.Pogorelov uses the method of prolongation\nover parameter, the idea of which goes back to S.N.Bernstein, and which then was brilliantly applied\nby Alexey Vasilyevich in many other problems. Following this method one has to\n(I) prove that it is possible to include the metric g into a one-parameter family of analytic metrics\ngt , 0 6 t 6 1, g1 = g, where the metric g0 is realized as a convex analytic cap (in fact, g0 is the\nmetric of a spherical cap);\n(II) prove that if the metric gt0 can be realized as a convex analytic cap, then the same is true for\nclose metrics gt ;\n(III) prove that if the metrics gtn can be realized and tn → t0 , then the metric gt0 can also be\nrealized.\nThis will imply that the metric g = g1 can be also realized as an analytic convex cap. Problem (II)\nis equivalent to solving the boundary value problem for the Darboux equation inside a unit disk with\nthe zero boundary conditions. Let G be a bounded domain with an analytic boundary and let φ be a\nfunction analytic on ∂G with respect to the arc-length parameter. By a theorem of S.N.Bernstein, the\n9\n\n\fboundary value problem for an elliptic equation F = 0 in G with z|∂G = φ has a solution if and only\nif the equation can be included into a family of equations Ft = 0 depending on a parameter 0 6 t 6 1\nsuch that\n(1) F1 = F ;\n(2) the equation F0 = 0 with the same boundary conditions has an analytic solution;\n(3) for all 0 6 t 6 1, the existence of a solution zt to the boundary value problem for the equation\nFt = 0 with the same boundary conditions implies the uniform boundedness of zt and all its\npartial derivatives up to the second order.\nFrom the a priori estimates for the first and the second derivatives it follows that condition (3) of the\nBernstein theorem is satisfied, which solves (II).\nProblem (III) can be solved using the a priori estimates on the derivatives up to the fourth order.\nThis shows that the limiting surface is C 3 -regular. The analyticity of the limiting cap now follows\nfrom the Bernstein's theorem on analyticity of solutions of an elliptic equation.\nThe third stage of the proof of the regularity of a convex surface with a regular metric goes as\nfollows. A theorem of A.D.Aleksandrov, the regularity of the metric and the fact that the curvature\nis positive imply that any surface realizing the given metric is smooth and strictly convex. Therefore,\nat any point of the surface, one can cut off a cup F0 by a plane parallel to the tangent plane at that\npoint. Then one approximates the metric of a cap by analytic metrics in domains bounded by analytic\ncurves of positive geodesic curvature. These metrics can be realized as analytic caps, which converge\nto a limiting cap F1 isomeric to F0 . The a priori estimates imply the regularity of the cap F1 . For\nthe C 2 and the C 3 -regularity, one uses the Heintz's a priori estimates for the first and the second\nderivatives of the position vector of the surface. If, instead of the above a priori estimates for higher\nderivatives, one applies the Nirenberg's theorem on the regularity of a twice differentiable solution of\nan elliptic equation with regular coefficients to the Darboux equation, the results will be more precise.\nIt follows from the Nirenberg's theorem that a C 2 -surface F1 with a C n -metric belongs to the class\nC n−1,α , 0 < α < 1. As F0 and F1 are congruent, the cap F0 is also C n−1,α -regular.\nThis establishes the following theorem.\nTheorem 3 (A.V.Pogorelov, [3, 4, 10, 9]). A convex surface with a C n -regular metric, n > 2, of\npositive Gauss curvature is C n−1,α -regular, for all α ∈ (0, 1). If the metric is analytic, then the\nsurface is also analytic.\nA.V. published his first result on the regularity of convex surfaces in 1949 [3]. Later, in 1950, he\nproved Theorem 3 for n ≥ 4 [4]. The final result for n = 2, 3, was published in [10].\nLater, in 1953, L.Nirenberg (being familiar with the results of A.V.Pogorelov) proved the following\nregularity theorem [36]. A C m, α -metric of positive Gaussian curvature, with m > 4, 0 < α < 1, can\nbe realized by a C m, α -regular surface; a C 4 -metric of positive Gaussian curvature can be realized by\na C 3,α -regular surface, with 0 < α < 1. In the classes C k , the Nirenberg's results on the regularity\nof the surface are the same as the Pogorelov's ones, but in the Hölder classes they are more precise.\nThey are based on the a priori estimates of the Hölder class of the second derivatives of a solutions of\nan elliptic equation (2) obtained by L.Nirenberg in [37].\nNote that the Pogorelov's regularity theorem is fundamentally more general than the Nirenberg's\none, in the following sense. The fact that a two-dimensional manifold with an intrinsic metric of\nnon-negative curvature can be locally isometrically immersed as a convex surface follows from the\nA.D.Aleksandrov's theorem. Riemannian metrics of positive Gauss curvature are of that type. The\nPogorelov's theorem guarantees, that all these surfaces are regular provided the metric is regular,\nwhile the Nirenberg's theorem says that among them, one can find a regular surface. This more\ngeneral result was obtained with the help of the Pogorelov's theorem on the unique determination of\na convex cap, which was not used by Nirenberg.\nIf one considers metrics in a Hölder class, there is no loss of regularity at all:\n10\n\n\fTheorem (I.H.Sabitov [39]). A convex surface with a C n,α -regular metric of positive curvature, where\nn > 2, 0 < α < 1 is C n,α -regular.\nA natural question is whether the converse is true, more precisely, what is the connection between\nthe regularity class of a submanifold in a Riemannian space and the regularity class of the induced\nmetric. At first glance, the regularity of the metric should be lower. However, using the harmonic\ncoordinates I.H.Sabitov and S.Z.Shefel proved the following theorem.\nTheorem ([40]). Every C k,α (k > 2, 0 < α < 1) regular submanifold F l in a Riemannian space M n\nof the regularity not lower than that of F l , is a C k,α isometrically immersed Riemannian manifold\nM l of the class C k,α .\nThe Pogorelov's regularity theorem implied new results on the regularity of solutions of the MongeAmpère equation, which became a foundation of the geometric theory of both the two-dimensional\nand the multidimensional theory of the Monge-Ampère equation (which we will discuss in Section 7).\nOnce I said A.V. that in my opinion, the regularity theorem is his best result, but he answered\nthat he regards the theorem on the unique determination as the best.\nSimultaneously with the regularity theorem, in 1952 A.V. published the solution to the Minkowski\nproblem [6].\nTheorem 4. A convex surface whose Gauss curvature is positive and is a C m function of the outer\nnormal (m > 3), is C m+1 -regular.\nNote that this is a local theorem on a surface domain whose Gauss image is a small disc on the\nunit sphere. This theorem combined with the Minkowski uniqueness theorem implies the regularity\nof the solution to the Minkowski problem.\nTheorem 5. Let K(n) be a positive C k function on the unit sphere Ω, k > 3, such that\nZ\nn dω\n= 0,\nK(n)\nΩ\nwhere dω is the area density on Ω. Then there exists a C k+1 -regular surface F whose Gauss curvature\nat the point with the outer normal n is K(n). The surface F is unique up to a parallel translation.\nIn 1953, L.Nirenberg proved a similar result (using the prolongation over parameter and the a\npriori estimates of Miranda): if K ∈ C k,α , k > 2, 0 < α < 1, then the surface is C k+1,α -the regular.\nIf K ∈ C 2 , then the surface is C 2 -regular [36]. The Nirenberg's theorem is global, it requires the\nfunction K to be defined over the whole sphere, as he did not prove any local theorem. Note however\nthat the regularity is a local property. A.V.Pogorelov told me that by the R.Courant's opinion, his\nresults on the problem of regularity of a surface with a regular intrinsic metric and the problem of\nregularity of a solution to the Minkowski problem are more general and more natural than those of\nL.Nirenberg.\n\n5\n\nConvex surfaces in Riemannian space.\n\nPerhaps the greatest achievement of A.V.Pogorelov in the area of application of the analytic methods\nto the theory of convex surfaces is the following theorem.\nTheorem 6 ([9, 8]). Let R be a complete three-dimensional Riemannian space whose curvature is\nless than some constant C, and let M be a Riemannian manifold homeomorphic to the sphere whose\nGauss curvature is greater than C.\nThen M admits an isometric immersion in R. If the metrics of R and M are C n -regular, n > 3,\nthen all such immersions are C n−1,α -regular, with any α ∈ (0, 1).\n11\n\n\fMoreover, the isometric immersion is unique in the following sense: given any two points x ∈ M ,\ny ∈ R, a two-dimensional subspace L ⊂ Ty R and a unit normal n to L at y, there exists a unique\nisometric immersion f : M → R such that f (x) = y, df (Tx M ) = L, and a neighborhood of y on\nthe immersed surface f (M ) lies from the side of L defined by n (that is, the curvature vectors of all\ngeodesic of f (M ) at y are nonnegative multiples of n).\nThe proof of this theorem uses the prolongation over parameter and consists of three steps.\n(I) First, one proves the existence of a continuous family of Riemannian manifolds Mt , t ∈ [0, 1],\neach of the Gauss curvature greater than C, such that M1 = M and that M0 is isometrically\nimmersible in R. The manifold M0 is a geodesic sphere of a small radius in R. Using the\nAleksandrov's immersion theorem and the Pogorelov's theorem on the regularity of a convex\nsurface with a regular metric of the Gauss curvature greater than C, one can immerse both\nM0 and M in the space of constant curvature C as closed regular convex surfaces F0 and F\nrespectively. Then it is possible to include them in a continuous family of regular closed convex\nsurfaces Ft , t ∈ [0, 1], F1 = F , of Gauss curvature greater than C. Then for every t, the\nmanifold Mt is Ft , with the induced metric.\n(II) The next step is to show that if a manifold Mt0 is isometrically immersible in R, then the nearby\nmanifolds Mt also are. First, Pogorelov considers infinitesimal bending of a regular surface in\na Riemannian space. A vector field ξ on a surface F in a Riemannian space R is a field of\ninfinitesimal bending if\nDi ξj + Dj ξi = 0,\ni, j = 1, 2,\nwhere Di is the covariant derivative in R, and ξi are the covariant component the of ξ. If F is\nparameterized in such a way that its second fundamental form is ν((du1 )2 + (du2 )2 ), then the\nequations of the infinitesimal bending are of the form\n ∂ξ1\n∂ξ\n ∂u1 − ∂u22 − (Γ̃i11 − Γ̃i22 )ξi = 0,\n\n\n∂ξ1\n∂u2\n\n+\n\n∂ξ2\n∂u1\n\n− 2Γ̃i12 ξi = 0,\n\nwhere Γ̃ijk are the Christoffel symbols of F . The following theorem generalizes Theorem 2 for\nan arbitrary ambient space.\nTheorem 7 ([9, 8]). Let F be a convex surface homeomorphic to the sphere in a Riemannian\nspace. Suppose F has positive extrinsic curvature. Then any field of infinitesimal bending,\nwhich vanishes at some point of F together with its covariant derivatives at that point, vanishes\nidentically.\nLet F be a surface homeomorphic to the sphere, with positive extrinsic curvature in a Riemannian space R. Let Ft , t ∈ [0, 1], be a regular deformation of F = F0 , and let ds2t = ds2 +tdσt2 , be\nthe induced metric on Ft , where ds2 is the metric on F . When t → 0, dσt2 tends to some limit,\nwhich is uniquely determined by the deformation. We are interested in the inverse problem:\ngiven the limit limt→0 dσt2 = dσ 2 = σij dui duj , find the corresponding field of deformation ξ.\nThe components of ξ satisfy the following system of differential equations\n ∂ξ1\n∂ξ\n22\n,\n ∂u1 − ∂u22 − (Γ̃i11 − Γ̃i22 )ξi = σ11 −σ\n2\n\n\n∂ξ1\n∂u2\n\n+\n\n∂ξ2\n∂u1\n\n− 2Γ̃i12 ξi = σ12 ,\n\nwhich is precisely the system of differential equations for the generalized analytic functions\nstudied by I.N.Vekua. Using his theory Pogorelov proved that the solution ξ exists and is\nregular. The field ξ is then used in the iterative method to find isometric immersions of metrics\nMt close to the immersed one Mt0 .\n12\n\n\f(III) The last step is to prove that if every Mtn is isometrically immersible, and tn → t0 , then Mt0\nalso is.\nTo prove that, Pogorelov obtained the estimates on the normal curvatures of a convex surface\nhomeomorphic to the sphere of positive extrinsic curvature in a regular Riemannian space.\nThese estimates depend only on the metric of the surface and the metric of the space and, in\nturn, allow one to estimate the second derivatives of the position vector of the surface. Then\nthe estimates for the higher derivatives follow from the equation of isometric immersion, which\nis elliptic, as the extrinsic curvature is positive.\nCombining these three steps A.V.Pogorelov gives a solution to the generalized Weyl problem\nfor an isometric immersion in a Riemannian space.\nWhen a difficult problem is solved, then first everyone admires the solution, then gets used to it,\nand then, if the theorem is not an instrumental tool, people begin forgetting it. But this is not what\nhappened to Theorem 6: in 1997, in his talk on receiving the AMS prize for \"Pseudo-holomorphic\ncurves in symplectic manifolds\", M.Gromov said that the idea of the proof of the existence of pseudoholomorphic curves came to him when he was reading the A.V.Pogorelov's proof.\nAs far as I know, the problem of the regularity of a convex surface with a regular metric in\nRiemannian space, when the Gauss curvature of the surface is greater than the sectional curvature of\nthe ambient Riemannian space, is still open.\nA.V.Pogorelov liked concrete problems. A.L.Verner told that when A.V. was giving a talk on\nthe A.D.Aleksandrov's seminar in Leningrad, he repeated several times \"You Alexander Danilovich\nis who poses the problems, but I am who solves them\". After Pogorelov received the Lenin's prize,\nA.D.Aleksandrov said joking that \"we prove theorems together, but receive prizes separately\".\nAlexey Vasilyevich did not have many postgraduate students. He started to work with the postgraduates students when the Department of Geometry of the Institute of Low Temperatures was\nopened and the vacancies needed to be filled in. Often, he was giving to his student a problem, the\nanswer to which (and the method of obtaining the answer), was already known to him. Usually, the\nproblem concerned the improvement of some of his results. The last A.V.'s postgraduate defended\nhis thesis in 1970. The person who really supervised the A.V.'s postgraduates was E.P.Senkin (he\nmoved from Leningrad to Kharkov that time). He was a versatilely talented person who possessed a\ngift of praising the students, unlike A.V.Pogorelov. Unfortunately, Eugeny Polikarpovich was ill by\nthat time and could not help me with the choice the problem for my thesis. In 1970, when I was the\nfirst year postgraduate, after one of the seminars, I asked A.V., if he has a \"good\" question in mind\nfor me. He answered: \"I would be happy if you gave me the same advice\". In 1979, on the 60th\nanniversary of A.V., I reminded this answer to him and thanked for believing in me and not giving\nme a problem for the thesis which leads to nowhere.\nI never was a postgraduate student of A.V.Pogorelov, but was learning from him on his seminars\nwhat a good problem and what a good theorem is. During more than 30 years, I gave talks at his\nseminar and always expected the A.V.'s evaluation with thrill. In my 5-th year, I constructed an\nexample of an infinite convex polyhedron and a ray on it whose spherical image had an infinite length.\nThere was a conjecture that an interior point of a shortest geodesic has a neighborhood whose spherical\nimage has a finite length. My example provided a partial counterexample to this conjecture and I\nwanted to give a talk on it on the conference on \"geometry in the large\" in Petrozavodsk (Russia)\nin 1969. However, the organizers rejected my application on the ground that a similar example was\nconstructed by V.A.Zalgaller, and they suspected me in plagiarism. Finally, I was given a time for my\nreport. Probably, I reported badly, so A.V. just repeated my report completely. On that conference,\nI first met A.D.Aleksandrov who said to me that in his opinion, convex geometry is already \"closed\".\nHis words made a great impression on me, so I chose a completely different area for my postgraduate\nresearch. Actually, from that time, A.D.Aleksandrov stopped his research in this field and started to\ndo chronogeometry, school textbooks, ethics, philosophy, etc. It was always easier to talk and even\nto debate with A.D.Alexandrov rather than with A.V.Pogorelov, he was more liberal. At the 80th\n\n13\n\n\fanniversary of A.V.Pogorelov I said that he was more accessible at the conferences, but was grander\nin Kharkov.\n\n6\n\nSurfaces of bounded extrinsic curvature\n\nPerhaps the most conceptual results of A.V.Pogorelov are contained in his series of papers on smooth\nsurfaces of bounded extrinsic curvature. In my opinion, nowadays, after half a century, these works\nare his most cited ones.\nA.D.Aleksandrov founded the theory of the general metric manifolds, which are natural generalizations of Riemannian manifolds. In particular, he introduced a class of two-dimensional manifolds\nof bounded curvature. Every metric two-dimensional manifold which locally is a uniform limit of\nRiemannian manifolds whose total absolute curvatures (the integrals of the module of the Gauss\ncurvature) are uniformly bounded is an Alexandrov's manifold of bounded curvature.\nThere is a natural question, which surfaces in R3 carry such a metric? A partial answer was\nobtained by Pogorelov, who introduced the notion of surfaces of bounded curvature. A surface of\nbounded curvature is a C 1 -surface, the area of the spherical image of which (counting the multiplicity\nof the covering) is locally bounded.\nHe introduced the concept of a regular point of a C 1 - surface. A regular point can be elliptic,\nhyperbolic, parabolic, or a points of inflation depending on the type of the intersection of the surface\nwith the tangent plane. Any point on a surface of bounded curvature can be joined to any other\npoint in a sufficiently small neighbourhood by a rectifiable curve lying on the surface. This defines an\nintrinsic metric on the underlying manifold. Pogorelov proved that the manifold with this metric is of\nbounded intrinsic curvature and found connections between the intrinsic and the extrinsic curvature\nof the surface. For surfaces of bounded curvature, the analogue of the Gauss theorem holds: for every\nBorel set G, the area of the spherical image equals the intrinsic curvature ω(G) of the set G. The\nlatter is defined by ω(G) = ω + (G) − ω − (G), where ω + (G) (respectively ω − (G)) is the supremum\n(respectively the infimum) of the sums of the positive (respectively the negative) excesses of sets of\npairwise disjoint triangles in G.\nA very close connection was found between the intrinsic and the extrinsic geometry of a surface: a\ncomplete surface of bounded extrinsic curvature and non-negative not identically vanishing intrinsic\ncurvature is either a closed convex surface or an infinite convex surface. A complete surface of bounded\nextrinsic curvature whose intrinsic curvature vanishes identically is a cylinder.\nThe first Pogorelov's paper on surfaces of bounded extrinsic curvature was published in 1953 [7].\nOn the other hand, in 1954, J.Nash published a paper on C 1 isomeric immersions, which was improved\nby N.Kuiper in 1955. They proved that a two-dimensional Riemannian manifold, in rather general\nsettings, admits a C 1 isometric immersion (embedding) in R3 . Moreover, this immersion (embedding)\nis, in a sense, as free as is a topological immersion (embedding) of the underlying manifold. In\nparticular, these results have some \"counterintuitive\" corollaries: a unit sphere can be C 1 -isometrically\nembedded in an arbitrarily small ball in R3 ; there exists a closed C 1 -embedded locally Euclidean\nsurface in R3 homeomorphic to a torus, etc. [38]. These results show that for a C 1 -surface, even with\na \"good\" intrinsic metric, there is in general no apparent connection between the intrinsic and the\nextrinsic geometry. For instance, a C 1 -regular surface whose metric is C 2 -regular and is of positive\nGauss curvature, does not have to be convex even locally.\nPerhaps the class of surfaces of bounded extrinsic curvature introduced by Pogorelov is the most\nnatural and the widest possible one, in which the connection between the extrinsic and the intrinsic\ngeometry is preserved under the weakest smoothness assumptions possible. In my opinion, this is the\ndeepest and the most difficult series of results of Pogorelov. The proofs are the alloy of the measure\ntheory and brilliant synthetic geometric constructions.\n\n14\n\n\f7\n\nMultidimensional Minkowski problem and the multidimensional Monge-Ampère equation.\n\nMany problems of geometry \"in the large\", in the analytic form, are reduced to the existence and\nuniqueness problems for certain partial differential equations, in particular, for the Monge-Ampère\nequation, and conversely, the geometric methods and results can be used to prove the existence and\nuniqueness of solutions for differential equations.\nAs A.V.Pogorelov said about the Monge-Ampère equation, \"This is a great equation, which I had\na privilege to study\". He pioneered the study of the properties of solutions of the general multidimensional Monge-Ampère equation in the series of papers [15]– [19] published in 1983-1984, and later in\nthe monograph [20]. Earlier, he obtained the results in the case when the right-hand side is a function\nof the independent variables x1 , . . . , xn , but not of the unknown function z and its derivatives [14].\nThe Monge-Ampère equation is a partial differential equation of the form\ndet(zij ) = f (z1 , . . . , zn , z, x1 , . . . , xn ),\n\nf > 0,\n\n(3)\n\n2\n\n∂z\nz\nwhere zi = ∂x\n, zij = ∂x∂i ∂x\n. On convex solutions z(x1 , . . . , xn ), this equation is of elliptic type.\ni\nj\nRewrite equation (3) in the form\n\nθ(z1 , . . . , zn , z, x1 , . . . , xn ) det(zij ) = φ(x1 , . . . , xn ).\nEquation (4) can be written in equivalent form:\nZ\nZ\nφ(x1 , . . . , xn )dx1 . . . dxn ,\nθ(z1 , . . . , zn , z, x1 , . . . , xn ) det(zij )dx1 . . . dxn =\n\n(4)\n\n(5)\n\nm\n\nm\n\nwhere m is an arbitrary Borel subset of the domain G where the solution z is sought. If the solution\n∂z\n, i = 1, . . . , n, on the left-hand\nz(x) is a convex function, we can make the change of variables pi = ∂x\ni\nside. Then the resulting equation, in contrast to equation (4), makes sense for any convex but not\nnecessarily regular function z(x). This enables one to define a generalized solution of the MongeAmpère equation as follows. Let z(x) be a convex function given in a domain G and let m ⊂ G be a\nBorel subset. Let m∗ be the set of p = (p1 , . . . , pn ) such that the hyperplane z = p1 x1 + * * * + pn xn + c\nis a support hyperplane to the hypersurface z = z(x) at some point (x, z(x)), x ∈ m. Such a point\n(x(p), z(p)) is unique for almost all p ∈ m∗ . The function z(x) is called a generalized solution of\nequation (4), if for any Borel subset m ⊂ G,\nZ\nZ\nφ(x1 , . . . , xn )dx1 . . . dxn .\nθ(p1 , . . . , pn , z(p), x1 (p), . . . , xn (p))dp1 . . . dpn =\nm\n\nm∗\n\nThe expression on the left-hand side (for an arbitrary convex function z) is called the conditional\ncurvature of the set m.\nThe concept of a generalized solution goes back to A.D.Aleksandrov. One of the main problems\nis to prove the existence of a generalized solution of (4) under certain natural assumptions about the\nfunctions φ, θ. In the two-dimensional case with θ = 1, the existence was proved by A.V.Pogorelov,\nand in the general case, by A.D.Aleksandrov. Then Pogorelov proved the existence of a solution of the\nDirichlet problem and the maximum principle for generalized solutions of the Monge-Ampère equation\nwith θz 6 0, which implies the uniqueness of a solution of the Dirichlet problem. He also considered\nsimilar problems for the Monge-Ampère equation on the sphere.\nThe first step in the proof of the existence of a generalized solution of the Monge-Ampère equation\nis to show that there exists a convex polyhedron whose vertices project to the given points Bi in the\nx-space, with the given conditional curvatures μi > 0. Next, by passing to the limit, one proves that\ngiven a convex domain G and a bounded measure μ on the Borel subsets of G, there exists a convex\nhypersurface z = z(x), x ∈ G, such that for every Borel subset m ∈ G, the conditional curvature\n15\n\n\fR\nof m is μ(m). For the Monge-Ampère equation, μ(m) = m φ(x)dx. If the function θ(p, z, x), which\ndefines the conditional curvature, strictly decreases in z, then the convex hypersurface z = z(x) is\nuniquely determined by its boundary values and the measure μ. This implies the existence and the\nuniqueness of a generalized solution of the Monge-Ampère equation. The proof of the regularity of the\nsolution assuming the functions θ and φ to be regular, can be reduced to the proof of the regularity of\na convex hypersurface with the given conditional curvature. This can be done using the prolongation\nover parameter. The most difficult part of the proof is finding the a priori estimates for the solution\nand its derivatives up to the third order (the a priori estimates for the higher order derivatives can be\nthen obtained from equation (4)). A.V.Pogorelov proved the following theorem.\nTheorem 8. A generalized solution of the Monge-Ampère equation (4), with θ and φ being regular\npositive functions and θz 6 0, is regular in a neighborhood of every point of the strict convexity. If\nθ, φ ∈ C k (G), k > 3, then the solution is C k+1,α -regular for all α ∈ (0, 1).\nThe key role in this theorem (as in many others) is played by the a priori estimates of a solution\nof an elliptic equation, together with its derivatives (up to the third order, for the Monge-Ampère\nequation). These estimates do not directly follow from the equation. They are needed to guarantee\nthe C 2,α -regularity of the limiting solution of a sequence of regular solutions. Then, if the coefficients\nare regular, one can apply the standard tools of the theory of elliptic equations.\nPogorelov's a priori estimates for the third derivatives of a solution z = z(x) of (3) are based\non the idea of E.Calabi's [26], who considered a Riemannian metric ds2 = zij dxi dxj , computed the\nLaplacian of the scalar curvature of it and obtained the estimates for the third derivatives of z in the\ncase f = const > 0.\nEarlier, Pogorelov solved the multidimensional Minkowski problem. In 1968 – 1971, he published\na series of papers in \"DAN\", the Doklady Akademii Nauk (Proceedings of the USSR Academy of\nSciences) where he found a priori estimates for the second and the third derivatives, and proved\nregularity of a solution of the Minkowski problem in the multidimensional case using the prolongation\nover parameter.\nTheorem 9 ([14, 35]). Let K(n) be a positive C k function, k > 3, on the unit sphere S m−1 ⊂ Rm\nsatisfying\nZ\nn\ndω = 0.\nK(n)\nS m−1\nThen there exists a (unique up to parallel translation) C k+1,α -regular convex hypersurface with the\nGauss curvature K(n) at the point with the outer normal n, for every 0 < α < 1. If K(n) is analytic,\nthen the corresponding hypersurface is also analytic.\nUsing this theorem Pogorelov proved the regularity of the solutions of equation (4) with θ = 1 and\nthe regularity of generalized solutions of the Dirihlet problem [11, 12, 14]. One of the implications is\nthe following theorem: a unique convex solution z = x(x1 , . . . , xn ) of the equation det(zij ) = const > 0\ndefined over the whole space x1 , . . . , xn is a quadratic polynomial [14].\nNote that A.V.Pogorelov did not publish long papers from the middle of 50-th. Usually he published a brief note in DAN, and later, a separate small book. For instance, the book \"Multidimensional\nMinkowski Problem\" was published only in 1975.\nIn 1976 – 1977, S.Yu.Cheng and S.T.Yau published the papers [27, 28]. They found small inaccuracies and incompleteness in the Pogorelov's brief notes in DAN (avoiding technicalities was a matter of\nthe journal style; later all the details were given in [14]) and declared that Pogorelov had no complete\nproof. Then they gave their own proof of regularity of a solution of the multidimensional Minkowski\nproblem and the Monge-Ampère equation\ndet(zij ) = F (x1 , . . . xn , z) > 0.\nThe proof heavily relies on the Pogorelov's a priori estimates on the second and the third derivatives,\nand on the other results, in particular, the Aleksandrov's and Pogorelov's theorems on the generalized\n16\n\n\fsolutions of the Monge-Ampère equation. The results of these papers can be viewed as a restatement\nof the earlier results of Pogorelov, but by no means as the new results.\nThe English translation of \"Multidimensional Minkowski problem\" appeared in 1978 with a very\nnice foreword by L.Nirenberg. However, nowhere in the translation it is mentioned when the Russian\noriginal was published. This is an (unfortunate) reason why often the authors first refer to [27] and\nthen to the English translation of the Pogorelov's book.\nLet M be a compact Kähler manifold with the Kähler metric ds2 = gj k̄ dz j dz̄ k and the Kähler form\ni\nω = 2i gj k̄ dz j ∧ dz̄ k . In 1954, E.Calabi conjectured that for a given (1, 1) form σ = 2π\nR̃j k̄ dz j ∧ dz̄ k\nrepresenting the first Chern class of M , there exists a Kähler metric on M with the Ricci tensor R̃j k̄\nwhose Kähler form belongs to the same cohomology class as ω. To solve the Calabi conjecture, one\nneeds to solve the complex Monge-Ampère equation\n∂2φ \u0011\n= det(gj k̄ )eF , c = 0, 1,\n∂z j ∂ z̄ k\nR\nfor a real function φ, where F is a given function satisfying M eF dz = Vol M in the case c = 0.\nS.T.Yau solved the Calabi conjecture using the prolongation over parameter. A substantial part\nof the proof is finding the a priori estimates for the second and the third derivatives. In his paper [43],\nYau writes that the Pogorelov's estimates for the real Monge-Ampère equation were the basis for his\nestimates in the complex case but give no references on Pogorelovs articles.\nHowever, in the recent paper \"Perspectives on Geometric Analysis\" (arXiv: math.DG/0602363),\nby an inaccurate citing, Yau again lessens the Pogorelov's role in the solving of two fundamental\nproblems: the regularity of a convex surface with a regular metric and the Minkowski problem.\nConcerning the first one, he refers only to the 1961 paper in DAN, but not to the 1949 paper [3] or a\nlong paper in the \"Notes of the Kharkov Mathematical Society\" published in 1950. Also, he refers to\nthe 1953 Nirenberg's paper, which was published later than the original paper of Pogorelov. As to the\ntwo-dimensional Minkowski problem, he refers to the 1953 Pogorelov's paper which has nothing to do\nwith the subject (it follows even from the title). Meanwhile, the Pogorelov's solution of the Minkowski\nproblem was published in 1952, [6], which is a year earlier than the Nirenberg's paper cited by Yau.\nAs to the multidimensional Minkowski problem, only the 1976 Cheng-Yau's paper is cited. There are\nno references to the Pogorelov's papers and books on the subject (even those translated into English)\nwhatsoever. Another example is the book [33]. On page 256 the author says: \"The(Minkowski)\nProblem has been partially solved by Minkowski, Aleksandrov, Lewy, Nirenberg, and Pogorelov\" then\nreferring to the 1952 paper [6], but without mentioning the papers [11, 12] and the 1975 book [14]\n(English translation 1978).\nThe Pogorelov's results on the multidimensional Monge-Ampère equation were generalized in various directions, such as improving the regularity of the solution [29], proving the regularity up to the\nboundary [30], studying the degenerate Monge-Ampère equations [34], and applying the results and\nthe methods to other classes of completely nonlinear second order equations [41]. In particular, it is\nproved in [29] that a convex solution z = z(x) of the equation\n\u0010\ndet gik̄ +\n\ndet(zij ) = f (x1 , . . . , xn )\nin a convex domain Ω, with f ∈ C α (Ω), belongs to C 2,α (Ω) (which is the best possible smoothness).\nNote that the multidimensional Monge-Ampère equation appears also in statistical mechanics,\nmeteorology, financial mathematics and in other areas [31].\nCuriously enough, none of the Pogorelov's students in Kharkov worked in differential equations,\nbut his methods and results were activley developed by the Leningrad mathematical school. It seems\nthat the mathematical influence of A.V.Pogorelov was proportional to the distance from Kharkov.\n*\n\n*\n\n17\n\n*\n\n\fThe mathematical legacy of A.V.Pogorelov is enormous. The most influential results not mentioned\nin the previous sections include a complete solution of the Fourth Hilbert Problem and obtaining the\nnecessary and sufficient conditions for a G-space to be Finsler [13, 21].\nUntil 1970, A.V.Pogorelov lectured at Kharkov University. Based on this lecture notes, he published a series of brilliant textbooks on analytic and differential geometry and the foundation of\ngeometry. Sometimes, during routine lectures, he was thinking about his research. Anecdote says\nthat on one of such lectures reflecting on something completely different he started improvising and\nbecame lost. Then he opened the textbook with the words: \"What does the author say on the topic?\nOh, yes, it is obvious . . . \". In contrast, when lecturing on a topic interesting to him, A.V.Pogorelov\nwas very enthusiastic and inspired (I remember one of his topology courses for the 4th year students).\nBut perhaps the best of his lecturing brilliance was seen when he was presenting his own results. His\ntalks were real fine art performances. In his opinion, one of the most valuable qualities of a mathematical result is its beauty and naturalness. That is why he usually omitted technicalities, and for\nthe sake of simplicity and beauty was ready to sacrifice the generality.\nFor many years, A.V.Pogorelov was the editor-in-chief of the \"Ukrainskij Geometricheskij Sbornik\"\n(Ukrainian Geometrical, a geometry journal published annually in Kharkov University. He was very\njealous about the publications in it by the \"local\" mathematicians. I remember, once I submitted a\npaper to a different journal, but has not submitted one to the UGS. A.V. became very disappointed\nat me and said: \"Wise people say, the one who wants to become famous, must become famous on his\nown place\".\nA.V.Pogorelov was the author of one of the most popular school textbooks in geometry. This\nbegan as follows. He was a member of the commission on the school education whose head was\nA.N.Kolmogorov. A.V. disagreed with the textbook written by A.N.Kolmogorov and his coauthors\nand wrote his own manual for teachers on elementary geometry, in which he built the whole school\ngeometry course starting with a set of natural and intuitive axioms. The manual was published\nin 1969 and formed a basis for his school textbook. A.V. used to say: \"My textbook is the Kiselyov's improved textbook\" (\"Elementary geometry\" by A.P.Kiselyov is probably the most well-known\nRussian-language school geometry textbook; it was first published in 1892, with the last edition in\n2002; many generations of students studied the Kiselyov's \"Geometry\"). The first version of the\nA.V.Pogorelov's textbook sparked sharp criticism from A.D.Aleksandrov whom Pogorelov deeply respected. This criticism was based on implementing the axiomatic approach as early as in year six at\nschool: \"What is the point to prove 'obvious' statements (from the student's point of view)?\". After\nreworking of the textbook, these disagreements were resolved, and they remained in strong friendship\ntill the last days of A.D.Aleksandrov.\nAlexey Vasilyevich was a person of the highest decency. When a five year contract with the\n\"Prosvescheniye\" Publisher was coming to an end, another publisher offered a very tempting contract\nto him. He refused on the unique ground that it will be unfair to the editor of the textbook. It should\nbe noted that the money for the school textbook republishing were the main source of his living in\nthe middle of the 90-th.\nA.V.Pogorelov told me that I.G.Petrovsky invited him to the Moscow University, I.M.Vinogradov\ninvited to Moscow Mathematical Institute, A.D.Aleksandrov invited to Leningrad several times. He\neven spent one year (1955-1956) in Leningrad, but then returned to Kharkov. He preferred to stay\nin Kharkov, far from the fuss and noise of the capitals. In Kharkov he proved his theorems, and to\nMoscow and Leningrad he went to shine.\nA.V.Pogorelov is a remarkable example of the mathematical longevity. I remember, in 1992, on\nthe A.D.Aleksandrov's 80-th anniversary, I asked M.Berger a question on geometry. He answered that\nhe is too old for geometry. He was 65 at that time. However, at this very age A.V.Pogorelov received\nhis final results on the multidimensional Monge-Ampère equation. Only in 1995, in the age of 76, he\nsaid \"At my age, it is already not necessary to do mathematics\".\nA.V.Pogorelov combined in himself a diligence of the peasant and a mathematical brilliancy. He\nsimply could not live without working. He inherited this from his parents, Vasily Stepanovich and\nEkaterina Ivanovna. On the 50-th anniversary of A.V.Pogorelov, N.I.Akhiezer bowed to his parents\n18\n\n\fthanking them for their son.\nA.V.Pogorelov was a very handsome man. He liked to be photographed. He often behave artistically and had a good sense of humor. Once I visited A.V. and left a bag at his place. When i returned\nto pick it up, A.V. said with a smile: \"No need to apologize. If you forgot, then you probably were\nthinking about something\". I remember as in 1982, on A.D.Aleksandrov's 70-th anniversary, somebody asked his employee A.I.Medjanik to sing (he has a beautiful voice). After the song, A.V. said:\n\"Have you heard him singing? Now imagine how the boss sings!\" R.J.Barri, N.V.Efimov's wife, told\nme that when Pogorelov was a Efimov's post-graduate student, Efimov never invited anyone to his\nplace on the day when they had consultations (on Thursday). This rule was broken only once, when\nV.A.Rokhlin was leaving Moscow. On that party, Alexey Vasilyevich sang the Ukrainian songs.\nA.V.Pogorelov was a modest person, despite of all his titles. In 1972, when the Kharkov geometers\nflied through Moscow to Samarkand to the All-Union geometry conference, the flight was delayed in\nMoscow and we had to spend a night in the waiting hall. Being a Member of the Supreme Soviet of\nUkraine, Pogorelov could go to a VIP-hall, but he has chosen to stay with us.\nIn 2000, at the age of 81, A.V.Pogorelov moved to Moscow. He lived in Novokosino (one of the\nouter suburbs of Moscow), and when going to the Institute of Mathematics, used only the public\ntransport, with several changes, instead of calling a car from the Academy of Sciences. In Moscow he\ncontinued to work, to think on the geometry problems and not only on them. He even brought from\nKharkov a drawing board, on which he projected an electric generator based on the superconductivity.\nAlexey Vasilyevich Pogorelov was a person blessed by an incredible natural talent combined with\na constant tireless labor.\nAcknowledgement. I cordially thank V.A.Marchenko for inspiring me on this paper and for many\ncritical remarks and J.G.Reshetnjak for thoroughly reading the manuscript and making numerous\nuseful corrections. I am also thankful to A.L.Yampolsky and to Yu.Nikolayevsky for the English\ntranslation.\n\nReferences\n[1] A.V.Pogorelov, One theorem about geodesic on closed convex surface. -Math. sb. 18 (6) (1946),\nNo. 1, 181 – 183.\n[2] A.V.Pogorelov, Quasigeodesic lines on convex surface. -Math. sb. 25 (67)(1949), No. 2, 275 –\n306.\n[3] A.V.Pogorelov, On the regularity of a convex surfaces with a regular metric.-Sov. Math. Dokl\nUSSR, LXVII (1949), No. 6, 1051 – 1053.\n[4] A.V.Pogorelov, Regularity of convex surfaces.- Zapiski matematicheskogo otdelenija fiz-mat\nfakulteta of Kharkov university, XXII (1950), 5 – 49.\n[5] A.V.Pogorelov, Rigidity of general convex surfaces. -Izd. AN of Ukraine, (1951).\n[6] A.V.Pogorelov, Regularity of a convex surface with given Gauss curvature. -Matem. sb., 31\n(73) (1952), No. 1, 88 – 103.\n[7] A.V.Pogorelov, Extrinsic curvature of smooth surfaces. -Dokl. Akad. Nauk USSR, 89 (1953),\nNo. 3, 407 – 409.\n[8] A.V.Pogorelov, Some questions of Global Geometry in Riemannian space.-Izdat. Kharkov University, (1957).\n[9] A.V.Pogorelov, Extrinsic geometry of convex surfaces. - M.:Publish house \"Nauka\", (1969).\n\n19\n\n\f[10] A.V.Pogorelov, On the problem of the regularity of a convex surfaces with a regular metric in\nEuclidean space.-Sov. Math. Dokl USSR, 2 (1961), 235 – 237, 1020 – 1022.\n[11] A.V.Pogorelov, An apriori estimate for the principal radii of curvature of a closed convex hypersurface in terms of their mean values. -Dokl. Akad. Nauk USSR, 186 (1969), No. 3, 516 – 518;\n{Eng.transl.: Sov. Math. Dokl. 10 (1969), 626 – 628, }.\n[12] A.V.Pogorelov, The existence of a closed convex hypersurface with a prescribed function of\nthe principal radii of the curvature.- Dokl. Akad. Nauk USSR 193 (1971), No. 3, 526-528;\n{Eng.transl.: Sov. Math. Dokl. 12 (1971), 568 – 569, }.\n[13] A.V.Pogorelov, Fourth Hilbert Problem. Nauka, Moscow, (1974).\n[14] A.V.Pogorelov, The Minkowski multidimensional problem. - Nauka, Moscow, (1975);\n{Eng.transl.: J.Wiley, New-York, Toronto, (1978) }.\n[15] A.V.Pogorelov, The Dirichlet problem for the generalized solutions of the multidimensional\nMonge-Amp ére equation of elliptic type. -Dokl. Akad. Nauk USSR, 270 (1983), No. 2, 285\n– 288; {Eng.transl.: Sov. Math. Dokl. 27 (1983), 597 – 599, }.\n[16] A.V.Pogorelov, The maximum principle for the generalized solutions of the equations\nθ(∇z, z, x) det ||zij || = φ(x),-Dokl. Akad. Nauk USSR, 271 (1983), No. 5, 1064 – 1066;\n{Eng.transl.: Sov. Math. Dokl. 28 (1983), 217 – 219}.\n[17] A.V.Pogorelov, A priori estimations for the solutions of the equation det ||zij || =\nφ(z1 , . . . , zn , z, x1 , . . . , xn ).- Dokl. Akad. Nauk USSR, 272 (1983), No. 5, 792 – 794; {Eng.transl.:\nSov. Math. Dokl. 28 (1983), 444 – 446 }.\n[18] A.V.Pogorelov, The existence of a closed convex hypersurface with a prescribed curvature. -\nDokl. Akad. Nauk USSR, 274 (1984), No. 5, 28 – 31; { Eng.transl.: Sov. Math. Dokl. 29 (1984),\n21 – 23 }.\n[19] A.V.Pogorelov, Regularity of the generalized solution of the equations det ||uij ||θ(∇u, u, x) =\nφ(x). -Dokl. Akad. Nauk USSR, 275 (1984), No. 1, 26 – 28; {Eng.transl.: Sov. Math. Dokl. 29\n(1984), 159 – 161}.\n[20] A.V.Pogorelov, Multidimensional Monge-Ampère equation.- Nauka, Moscow, (1988); {Eng.\ntransl.: Rev. Math. Math Phys, 10 (1995), Part 1 }.\n[21] A.V.Pogorelov, Busemann Regular G-Spaces. Reviews in Mathematics and Mathematical Physics,\n10 (1998), No. 4, 1 – 102.\n[22] A.D. Aleksandrov, Intrinsic Geometry of convex surfaces.-M.:Gostehizdat, (1948).\n[23] A.D. Aleksandrov, Convex polytopes.- M.:Gostehizdat, (1950).\n[24] S.N.Bernstein, Research and integration of elliptic equations. -Communications of Kharkov\nMathematical Society, No. 11 (1910).\n[25] A.A.Borisenko, Aleksei Vasil'evich Pogorelov-a mathematician of surprising power. (Russian)\nJ. Math. Phys. Anal. Geom. 2 (2006), No. 3, 231–267.\n[26] E.Calabi, Improper affine hyperspheres of convex type and a generalization of a theorems by a\nK.Jörgens.-Michigan Math. J. 5 (1958), No. 5, 105 – 126.\n[27] S.Yu.Cheng, S.T.Yau, On the regularity of the solution of the n-dimensional Minkowski problem.\n-Commun. on Pure and Appl. Math., XXIX (1976), No. 5, 495 – 516.\n\n20\n\n\f[28] S.Yu.Cheng, S.T.Yau, On the Regularity of the Monge-Ampère Equation det\n\n∂2u\n= F (x, u).\n∂xi ∂xj\n\n-Commun. on Pure and Appl. Math., XXX (1977), No. 1, 41 – 68.\n[29] L.A.Caffarelli, A priori estimates and the geometry of the Monge-Ampère equation,- Nonlinear\npartial differential equations in differential geometry (Park City, UT, 1992), IAS/Park City Math.\nSer., 2, Amer. Math. Soc., Providence, RI, 1996, 5 – 63.\n[30] L.A.Caffareli, L.Nirenberg, and J.Spruck, The Dirichlet Problem for Nonlinear Second-Order\nElliptic Equations. I. Monge-Ampère Equation.-Commun. Pure and Appl. Math., XXXVII\n(1984), No. 3, 369 – 402.\n[31] L.A.Caffarelli, Non Linear Elliptic Theory and the Monge-Ampère Equation. Proc. of International Congress of Mathematics, 1 (2002), 179 – 187.\n[32] N.V.Efimov, V.A.Zalgaller, A.V.Pogorelov, Aleksandr Danilovich Aleksandrov (to 50-th birthday). -UMN, 17 (1962), No. 6 (108), 171 – 184.\n[33] C.Gerhardt Curvature problems. Series in Geometry and Topology (Ed. S.-T. Yau), 39, International Press, 2006.\n[34] P.Guan, N.S.Trudinger, X.-J.Wang, On the Dirichlet problem for degenerate Monge-Ampère\nequations.- Acta Math., 182 (1999), 87 – 104.\n[35] H.Levy, On differential geometry in the large.- I, Trans. Amer. Math. Soc. 43 (1938), No. 2,\n258-270.\n[36] L.Nirenberg, The Weyl and Minkowski Problems in Differential Geometry in the Large. -\nCommun. on pure and appl. math. 6 (1953), 337 – 394.\n[37] L.Nirenberg, On nonlinear elliptic partial differential equations and Hölder continuity.-Comm.\nPure Appl. Math., 6 (1953), 103 – 157.\n[38] Nash J., C 1 -isometric imbeddings. -Ann. Math. (1954), No. 3, 383 – 396.\n[39] I.Kh.Sabitov, The regularity of convex regions with a metric that is regular in the Hölder classes.-\nSib. Math. J., 18 (1976), No. 4, 907 – 916.\n[40] I.Kh.Sabitov, S.Z.Shefel, On the connections between the smoothness orders of a surface and its\nmetric, Sib. Math. J., 18 (1976), No. 4, 916 – 925.\n[41] W.Sheng, J.Urbas, X.-J.Wang, Interior curvature bounds for a class of curvature equations. Duke\nMath. J., 123, 2 (2004), 235 – 264.\n[42] Yu.A.Volkov, Estimation of the deformation of a convex surface as dependent on the change of\nits inner metric.- Sov.Math.Dokl.USSR, 9 (1968), 260 – 263.\n[43] S.T.Yau, On the Ricci curvature of a Compact Kähler Manifold and the Complex Monge-Ampère\nEquation.- Commun. Pure and Appl. Math., XXXI (1978) , No. 3, 339 – 412.\n\n21\n\n\f"}