{"id": "http://arxiv.org/abs/0806.4978v2", "guidislink": true, "updated": "2008-07-23T17:34:01Z", "updated_parsed": [2008, 7, 23, 17, 34, 1, 2, 205, 0], "published": "2008-06-30T19:56:00Z", "published_parsed": [2008, 6, 30, 19, 56, 0, 0, 182, 0], "title": "Band-Selective Filter in a Zigzag Graphene Nanoribbon", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0806.1372%2C0806.4565%2C0806.0219%2C0806.3483%2C0806.0296%2C0806.0633%2C0806.2660%2C0806.3847%2C0806.1587%2C0806.1373%2C0806.1482%2C0806.1860%2C0806.3180%2C0806.3328%2C0806.0967%2C0806.1134%2C0806.1714%2C0806.4137%2C0806.0083%2C0806.4838%2C0806.0131%2C0806.0657%2C0806.0513%2C0806.0959%2C0806.2976%2C0806.3400%2C0806.2439%2C0806.0611%2C0806.0192%2C0806.4579%2C0806.3263%2C0806.4802%2C0806.4059%2C0806.1668%2C0806.3352%2C0806.4721%2C0806.4585%2C0806.4444%2C0806.1139%2C0806.3600%2C0806.4257%2C0806.4261%2C0806.4907%2C0806.1847%2C0806.3056%2C0806.1087%2C0806.1423%2C0806.2994%2C0806.1549%2C0806.2802%2C0806.4871%2C0806.4978%2C0806.0533%2C0806.2020%2C0806.1437%2C0806.0886%2C0806.1103%2C0806.1072%2C0806.1415%2C0806.3963%2C0806.3936%2C0806.0839%2C0806.0059%2C0806.0288%2C0806.0830%2C0806.1137%2C0806.1382%2C0806.1275%2C0806.2286%2C0806.1599%2C0806.0157%2C0806.0984%2C0906.1746%2C0906.4136%2C0906.2200%2C0906.5257%2C0906.3368%2C0906.5385%2C0906.3479%2C0906.1265%2C0906.2582%2C0906.4872%2C0906.2040%2C0906.2109%2C0906.1430%2C0906.1673%2C0906.1913%2C0906.3677%2C0906.4251%2C0906.1782%2C0906.3370%2C0906.2287%2C0906.1620%2C0906.0614%2C0906.3798%2C0906.2063%2C0906.1089%2C0906.0744%2C0906.0084%2C0906.2728%2C0906.0064&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Band-Selective Filter in a Zigzag Graphene Nanoribbon"}, "summary": "Electric transport of a zigzag graphene nanoribbon through a step-like\npotential or a barrier potential is investigated by using the recursive Green's\nfunction method. In the case of the step-like potential, we demonstrate\nnumerically that scattering processes obey a selection rule for the band\nindices when the number of zigzag chains is even; the electrons belonging to\nthe ``even'' (``odd'') bands are scattered only into the even (odd) bands so\nthat the parity of wavefunctions is preserved. The so-called valley-valve\neffect can be explained by this selection rule. In the case of the barrier\npotential, by tuning the barrier height to be an appropriate value, we show\nthat it can work as the ``band-selective filter'', which transmits electrons\nselectively with respect to the indices of the bands to which the incident\nelectrons belong. Finally, we suggest that this selection rule can be observed\nin the conductance by applying two barrier potentials.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0806.1372%2C0806.4565%2C0806.0219%2C0806.3483%2C0806.0296%2C0806.0633%2C0806.2660%2C0806.3847%2C0806.1587%2C0806.1373%2C0806.1482%2C0806.1860%2C0806.3180%2C0806.3328%2C0806.0967%2C0806.1134%2C0806.1714%2C0806.4137%2C0806.0083%2C0806.4838%2C0806.0131%2C0806.0657%2C0806.0513%2C0806.0959%2C0806.2976%2C0806.3400%2C0806.2439%2C0806.0611%2C0806.0192%2C0806.4579%2C0806.3263%2C0806.4802%2C0806.4059%2C0806.1668%2C0806.3352%2C0806.4721%2C0806.4585%2C0806.4444%2C0806.1139%2C0806.3600%2C0806.4257%2C0806.4261%2C0806.4907%2C0806.1847%2C0806.3056%2C0806.1087%2C0806.1423%2C0806.2994%2C0806.1549%2C0806.2802%2C0806.4871%2C0806.4978%2C0806.0533%2C0806.2020%2C0806.1437%2C0806.0886%2C0806.1103%2C0806.1072%2C0806.1415%2C0806.3963%2C0806.3936%2C0806.0839%2C0806.0059%2C0806.0288%2C0806.0830%2C0806.1137%2C0806.1382%2C0806.1275%2C0806.2286%2C0806.1599%2C0806.0157%2C0806.0984%2C0906.1746%2C0906.4136%2C0906.2200%2C0906.5257%2C0906.3368%2C0906.5385%2C0906.3479%2C0906.1265%2C0906.2582%2C0906.4872%2C0906.2040%2C0906.2109%2C0906.1430%2C0906.1673%2C0906.1913%2C0906.3677%2C0906.4251%2C0906.1782%2C0906.3370%2C0906.2287%2C0906.1620%2C0906.0614%2C0906.3798%2C0906.2063%2C0906.1089%2C0906.0744%2C0906.0084%2C0906.2728%2C0906.0064&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Electric transport of a zigzag graphene nanoribbon through a step-like\npotential or a barrier potential is investigated by using the recursive Green's\nfunction method. In the case of the step-like potential, we demonstrate\nnumerically that scattering processes obey a selection rule for the band\nindices when the number of zigzag chains is even; the electrons belonging to\nthe ``even'' (``odd'') bands are scattered only into the even (odd) bands so\nthat the parity of wavefunctions is preserved. The so-called valley-valve\neffect can be explained by this selection rule. In the case of the barrier\npotential, by tuning the barrier height to be an appropriate value, we show\nthat it can work as the ``band-selective filter'', which transmits electrons\nselectively with respect to the indices of the bands to which the incident\nelectrons belong. Finally, we suggest that this selection rule can be observed\nin the conductance by applying two barrier potentials."}, "authors": ["Jun Nakabayashi", "Daisuke Yamamoto", "Susumu Kurihara"], "author_detail": {"name": "Susumu Kurihara"}, "author": "Susumu Kurihara", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevLett.102.066803", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0806.4978v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0806.4978v2", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "4 pages, 5 figures", "arxiv_primary_category": {"term": "cond-mat.mes-hall", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.mes-hall", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0806.4978v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0806.4978v2", "journal_reference": null, "doi": "10.1103/PhysRevLett.102.066803", "fulltext": "Band-Selective Filter in a Zigzag Graphene Nanoribbon\nJun Nakabayashi,∗ Daisuke Yamamoto, and Susumu Kurihara\n\narXiv:0806.4978v2 [cond-mat.mes-hall] 23 Jul 2008\n\nDepartment of Physics, Waseda University, Tokyo, Japan\n(Dated: October 29, 2018)\nElectric transport of a zigzag graphene nanoribbon through a step-like potential or a barrier\npotential is investigated by using the recursive Green's function method. In the case of the step-like\npotential, we demonstrate numerically that scattering processes obey a selection rule for the band\nindices when the number of zigzag chains is even; the electrons belonging to the \"even\" (\"odd\")\nbands are scattered only into the even (odd) bands so that the parity of wavefunctions is preserved.\nThe so-called valley-valve effect can be explained by this selection rule. In the case of the barrier\npotential, by tuning the barrier height to be an appropriate value, we show that it can work as the\n\"band-selective filter\", which transmits electrons selectively with respect to the indices of the bands\nto which the incident electrons belong. Finally, we suggest that this selection rule can be observed\nin the conductance by applying two barrier potentials.\nPACS numbers: 73.23.–b, 73.63.Nm, 73.40.Gk\n\nGraphene, a single-layer graphite, is one of the most\nintriguing new materials, which has been studied vigorously since Novoselov et al. first succeeded in fabrication\nin 2004 [1]. Particularly, its excellent transport properties such as the high mobility at room temperature have\nattracted a lot of research interest to apply it in making future electronic devices [2, 3]. However, to realize\ngraphene-based devices, there is a crucial problem: the\ncharacteristic gapless band structure makes the control\nof the electric current rather difficult. Many attempts to\novercome the problem have been done so far, and gave\nrise to various benefical systems such as a graphene quantum dot [4], epitaxial graphene on SiC substrates [5], and\na graphene nanoribbon [6].\nWe shall focus on a graphene nanoribbon with zigzag\nedges [7] (hereafter we call it \"zigzag ribbon\"). A band\nstructure of a zigzag ribbon has two well-separated valleys (conically-shaped curves) K and K ′ around the vertices of the first Brillouin zone. In addition, the lowenergy bands (the lowest conduction band and the highest valence band) are almost flat at the Fermi level due\nto the edge states [6, 7]. Such a peculiar band structure has motivated much researchers to investigate the\nelectric transport of a zigzag ribbon. Wakabayashi and\nAoki [8] found that the electric current is almost entirely\nblocked by a barrier potential when the incident energy\nEI is in the range [0, ∆] while the barrier height V0 is in\nthe range [∆, 2∆] (2∆ is the energy separation between\nthe top of the next highest valence band and the bottom\nof the next lowest conduction band; see Fig. 1(a)). This\nresult is quite different from the case of bulk graphene,\nwhere incident electrons in the low-energy bands can pass\na barrier potential of any height (known as the Klein\nParadox [9]). At first, the polarization of two valleys was\nconsidered to be the origin of this current blocking effect,\nand then it was named \"valley-valve effect\" [10] by using\nan analogy from the spin-valve effect [11]. In the recent\nstudy [12], however, Akhmerov et al . pointed out that\n\nthe origin is not the valley polarization and showed that\nthe behavior of the conductance is strongly connected\nwith the parity of the number of zigzag chains N .\nThis striking current blocking effect has the possibility\nto control the electric current easily. In this letter, we investigate the role of a barrier potential applied to a zigzag\nribbon in more detail, and suggest the way to control the\ncurrent in a new light. The single-orbital tight-binding\nmodel is employed to describe the electronic states of a\nzigzag ribbon. The Hamiltonian is written as\nX\nX\nV (yi )|iihi|,\n(1)\nτij |iihj| +\nH=−\ni,j\n\ni\n\nwhere the hopping integral τij = τ when i and j are\nnearest neighbor sites, and τij = 0 otherwise. V (yi ) is\nthe electrostatic potential energy applied at the site i,\nwhich varies only along the direction of graphene lead\nlines (see Fig. 1(b)). The zero-bias conductance from\nthe left lead to the right lead is given by the Landauer\nformula [13]\nG=\n\n2e2 X\nT (μ, ν),\nh μ,ν\n\nT (μ, ν) = |tμν |2 ,\n\n(2)\n\nwhere the summation runs over all incoming (ν) and outgoing (μ) channels, tμν is a transmission coefficient, and\nT (μ, ν) represents a transmission probability. We specify channels ν and μ by the valley and band indices; the\nright-moving channel in the band n belonging to the valley K (K ′ ) is denoted by Kn (Kn′ ). For example, the\ntransmission probability of the scattering process from\nthe incoming channel in the band \"0\" belonging to the\nvalley K into the outgoing channel in the band \"−2\" be′\nlonging to the valley K ′ is denoted by T (K−2\n, K0 ) (see\nFig. 1(c)). Hereafter we call bands with even (odd) indices \"even\" (\"odd\") bands. For the calculation of the\ntransmission coefficients, we adopt the recursive Green's\nfunction method developed by Ando [14, 15].\n\n\f2\n\nFIG. 2: (color online) The transmission probabilities for (a)\nν = K0 and (b) ν = K1 with N = 30. The insets are the enlargements of the low-probability regions. Although we do not\nshow T (K2′ , K0 ), T (K4 , K0 ), T (K4′ , K0 ) and T (K3′ , K1 ) in the\ndiagram, they have a very small yet non-zero value (less than\n∼ 10−4 ), respectively. The others (T (K1 , K0 ), T (K2 , K1 ),\netc.) are suppressed to 0.\nFIG. 1: (a) The band structure of a zigzag ribbon for the case\nof N = 30. 2∆ ≃ 3τ π/N is the energy separation between\nthe top of the next highest valence band and the bottom of\nthe next lowest conduction band. (b) A schematic diagram\nof a zigzag ribbon. The electrostatic potential varies in the\nshaded region. The x axis (y axis) is taken to be perpendicular\n(parallel) to graphene lead lines. (c) A schematic diagram of\n′\nthe scattering process from K0 into K−2\n(see text). The bands\nare indexed as shown in the diagram.\n\nA step-like potential.-Now, we consider the effect of\na smooth step-like potential described as\nV (y) = V0 Θ(y),\n\n(y < −d),\n0\n(1/2) [sin(πy/2d) + 1] (|y| ≤ d),\nΘ(y) =\n\n1\n(y > d).\n\n(3)\n(4)\n\nIn the present calculation, we set d = 10a (a is the lattice\nconstant) and the incident energy is fixed at EI = 0.5τ\nwhile V0 is varied from 0 to τ . The transmission probabilities are obtained as a function of ε = EI − V0 . From\nthe results of the calculations, we find that scattering processes caused by the step-like potential obey the following\nselection rule: the electrons in the even (odd) bands can\nbe scattered only into the even (odd) bands and other\nscattering processes are entirely restricted. For example,\nFigs. 2(a) and 2(b) show the transmission probabilities\nfor ν = K0 and ν = K1 with N = 30. The electrons in\nthe band 0 are scattered only into the bands 0, ±2, and\n±4. Similarly, the electrons in the band 1 are scattered\n\nonly into the bands ±1, ±3, and −5.\nThe origin of this selection rule is the conservation of\nthe parity of wavefunctions [16, 17, 18, 19, 20]. As is\nshown in Fig. 3(a), a zigzag ribbon has the reflection\nsymmetry with respect to x = 0 line when N is even.\nThus, wavefunctions must be either even or odd functions of x. For example, as is shown in Figs. 3(b) and\n3(c), the wavefunctions of the incoming channel K0 and\nthe outgoing channels K−2 and K−4 are even functions,\nwhile the incoming channel K1 and the outgoing chan′\nnels K−1\nand K−3 are odd functions. Similarly, other\nwavefunctions for even (odd) bands are even (odd) functions. Since the step-like potential given in Eq. (3) cannot change the parity of wavefunctions, only the scattering processes which preserve the parity of wavefunctions\ncan occur. Thus, the transmission probabilities such as\nT (K−2 , K0 ) have non-zero values and the ones such as\n′\nT (K−1\n, K0 ) are restricted to 0 (see Figs. 2(a) and 2(b)).\nOn the other hand, when N is odd, a zigzag ribbon does\nnot have the reflection symmetry and wavefunctions are\nneither even nor odd function of x. Consequently, the\nselection rule does not exist in this case.\nThe so-called valley-valve effect [10] can be explained\nby this selection rule as follows. When EI is in the range\n[0, ∆] while V0 is in the range [∆, 2∆], the scattering pro′\ncesses from K0 into K−1\nare required for incident electrons to penetrate the step-like potential. However, when\nN is even, the wavefunction of K0 is an even function\n′\nwhile the one of K−1\nis an odd function. Thus, the scat-\n\n\f3\n\nFIG. 3: (a) A schematic diagram of a zigzag ribbon for even\nN . Open and filled circles represent two inequivalent sublattices, respectively. One can regard a zigzag ribbon as a\nquasi-one-dimensional system. In this regime, the columns α\nand β are treated as quasi sublattices. (b)(c) The wavefunctions can be written as ΨKn (Kn′ ) (x, y) = ψKn (Kn′ ) (x)eiky y . We\nshow ψKn (Kn′ ) (x) of (b) the incoming channels K0 , K1 on the\nquasi sublattice α in the left lead for EI = 0.5τ , (c) the outgo′\ning channels K−1\n, K−2 , K−3 and K−4 on α in the right lead\nfor ε = −0.5τ . The wavefunctions on the quasi sublattice β\nhave the same parity as the one of the wavefunctions on α.\nHere N = 30.\n′\ntering processes from K0 into K−1\nare entirely restricted\nbecause it does not preserve the parity of the wavefunction, and the current is blocked by the potential. When\nN is odd, Since the selection rule does not exist, the\ncurrent can flow through the potential [12]. The similar\ndiscussion on the valley-valve effect is shown in Ref. 17.\nbarrier potentials.-By calculating the transmission\nprobabilities individually, we have just shown that scattering processes obey the selection rule when N is even.\nHowever, the existence of the selection rule shown in\nFigs. 2(a) and 2(b) cannot be ascertained in experiments\nbecause the conductance is proportional to the sum of all\ntransmission probabilities. Now, we show that the existence of the selection rule can be observed in the conductance by applying two barrier potentials.\nFirst, we consider the case of one barrier potential\n\nV (y) = V0 [Θ(y) − Θ(y − L0 )].\n\n(5)\n\nTo see the role of this potential, we introduce following\nquantities\nP\nμ ,ν T (μe , ν)\nPe = P e\n,\n(6)\nμ,ν T (μ, ν)\nP\nμ ,ν T (μo , ν)\n,\n(7)\nPo = 1 − Pe = P o\nμ,ν T (μ, ν)\nwhere μe (μo ) represents the outgoing channels with even\n(odd) index. The results of the calculations are shown in\n\nFIG. 4: (color online) (a) The results of the calculations of\nPe and Po . The integral ratios shown in the top (bottom)\npanel represent the values of Ne /N (No /N ) (see text). (b)\nSchematic diagrams of band structures and the barrier potential described as Eq. (5). Here L0 = 50a. The colored regions\nshown in the diagram correspond to the ones shown in (a).\n\nFig. 4(a). We can see at once that some plateaus appear when ε > 0. In this region, the contributions of\nthe transmission probabilities of the scattering processes\nbetween the same channels (T (K0 , K0 ), T (K1 , K1 ), etc.)\n−3\nare major (≃ 1) and the others are minor ( <\n∼ 10 ) (see\nFig. 2). Thus, Pe and Po are given as Pe ≃ Ne /N and\nPo ≃ No /N , respectively. Here Ne (No ) represents the\nnumber of the right-moving channels with even (odd) index in the potential region, and N = Ne + No .\nLet us focus on the behavior in the colored regions\nshown in the diagram. In the red (or light gray) region\n(hereafter called the \"even-pass region\"), ε crosses only\nthe band 0 (see Fig. 4(b)), and thus Pe ≃ 1 and Po ≃ 0\ndue to the selection rule [21]. In contrast, in the blue\n(or dark gray) region (hereafter called the \"odd-pass region\"), ε crosses only the band −1, and thus Po ≃ 1 and\nPe ≃ 0. These results mean that a barrier potential in a\nzigzag ribbon plays the role of a \"band-selective filter\":\nwhen ε is tuned to be in the even- (odd-) pass region, the\nbarrier potential transmits only the electrons in the even\n(odd) bands.\nNext, we append one more barrier potential to the system as follows:\nV (y) = V0 [Θ(y) − Θ(y − L0 )]\n+ V ′ [Θ(y − L0 − L1 )−Θ(y − L0 − L1 − L2 )],(8)\nwhere V0 is fixed so that the first barrier potential behaves as the band-selective filter (i.e. |EI − V0 | ≤ ∆),\nand V ′ is varied from 0 to τ . Introducing two barrier\npotentials like that, one can observe the existence of the\nselection rule in the conductance. For example, when ε\nis tuned to be in the even-pass region, the first potential\n\n\f4\n\nFIG. 5: (color online) (a) Schematic diagrams of band structures and the barrier potential described as Eq. (8). (b) The results\nof the calculations of the conductances for L0 = L2 = 50a and L1 = 100a. In the upper (lower) panel, V0 is tuned to be 0.426τ\n(0.574τ ) so that ε is in the even- (odd-) pass region, and thus the odd- (even-) pass region in the second potential turns to\nthe pseudogap region. In the region ε′ < 0, only interband scatterings occur, which makes the behavior of the conductances\ncomplicated.\n\nworks as the band-selective filter which transmits only\nthe electrons in the even bands. In this case, since the\nincident electrons in the odd bands are reflected by this\nband-selective filter, all the electrons after passing the\nfirst potential belong to the even bands. Then, one can\nignore the odd bands in the second potential because the\nscattering processes from even bands into odd bands are\nrestricted by the selection rule. This indicates that the\nodd-pass region in the second potential turns to the pseudogap region (see Fig. 5(a); the negligible odd bands are\nshown as dashed lines). In fact, as is shown in the upper\npanel of Fig. 5(b), the conductance is entirely suppressed\nwhen ε′ = EI − V ′ is in the odd-pass (pseudogap) region.\nSimilarly, when ε is tuned to be in the odd-pass region,\nthe even-pass region in the second potential turns to the\npseudogap region (see the lower panel of Fig. 5(b)). Tuning the heights of two barrier potentials appropriately as\nabove, one can handle the electric current easily, which\nwill enables to apply a zigzag ribbon in making electronic\ndevices.\nIn summary, we have studied electric transport of a\nzigzag ribbon through a step-like potential or a barrier\npotential by using the recursive Green's function method.\nIt has been shown that scattering processes in a zigzag\nribbon obey the selection rule for the band indices when\nthe number of zigzag chains N is even. The origin of\nthe valley-valve effect is this selection rule. Moreover,\nwe have also shown that a barrier potential can play the\nrole of the band-selective filter, which transmits only the\nelectrons in the bands with either even or odd index depending on ε = EI − V0 . Finally, we have suggested that\nthe selection rule can be observed in the conductance by\napplying two barrier potentials to a graphene ribbon.\nWe thank Kenji Kamide for a useful discussion. One of\nthe authors (D.Y.) is supported by a Grant-in-Aid from\nJSPS.\n\n∗\n\nElectronic address: nakabayashi@kh.phys.waseda.ac.jp\n[1] K. S. Novoselov et al., Science 306, 666 (2004).\n[2] Y. B. Zhang et al., Nature 438, 201 (2005).\n[3] A. K. Geim and K. S. Novoselov, Nature Mater. 6, 183\n(2007).\n[4] B. Trauzettel et al., Nature Phys. 3, 192 (2007).\n[5] S. Y. Zhou et al., Nature Mater. 6, 770 (2007).\n[6] K. Nakada, M. Fujita, G. Dresselhaus and M. S. Dresselhaus, Phys. Rev. B 54, 17954 (1996).\n[7] M. Fujita et al., J. Phys. Soc. Jpn. 65, 1920 (1996).\n[8] K. Wakabayashi and T. Aoki, Int. J. Mod. Phys. B 16,\n4897 (2002).\n[9] M. I. Katsnelson et al., Nature Phys. 2, 620 (2006).\n[10] A. Rycerz et al., Nature Phys. 3, 172 (2007).\n[11] A. Wolf et al., Science. 294, 1488 (2001).\n[12] A. R. Akhmerov, J. H. Bardarson, A. Rycerz and C. W.\nJ. Beenakker, Phys. Rev. B 77, 205416 (2008).\n[13] R. Landauer, IBM J. Res. Dev. 1, 233 (1957); M.\nButtiker, Phys. Rev. Lett. 57, 1761 (1986).\n[14] T. Ando, Phys. Rev. B 44, 8017 (1991).\n[15] K. Wakabayashi, Doctorial Thesis (2000).\n[16] J. Nakabayashi and S. Kurihara, J. Phys.: Conference\nSeries (to be published).\n[17] A. Cresti, G. Grosso and G. P. Parravicini, Phys. Rev. B\n77, 233402 (2008).\n[18] D. Rainis et al., cond-mat/0806.4475.\n[19] There are similar discussions on the selection rule in\nRef. 18. Our previous work Ref. 16 (submitted on\n13/06/2008) and the present work are done independently of their work.\n[20] In the case of the extreme limit N = 2 (namely the case of\npolyacene), this parity effect was discussed analytically\nin the following paper: N. M. R. Peres and F. Sols, J.\nPhys.: Condens. Matter 20, 255207 (2008).\n[21] Actually the value of Pe (Po ) is not strictly 1 (0) because\nof the tunneling effect.\n\n\f"}