{"id": "http://arxiv.org/abs/0710.4042v1", "guidislink": true, "updated": "2007-10-22T12:47:57Z", "updated_parsed": [2007, 10, 22, 12, 47, 57, 0, 295, 0], "published": "2007-10-22T12:47:57Z", "published_parsed": [2007, 10, 22, 12, 47, 57, 0, 295, 0], "title": "Physics from HBT radii", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0710.1154%2C0710.2329%2C0710.2829%2C0710.5127%2C0710.4707%2C0710.2773%2C0710.1370%2C0710.2105%2C0710.2551%2C0710.0025%2C0710.1518%2C0710.3489%2C0710.0147%2C0710.4320%2C0710.0671%2C0710.5348%2C0710.2449%2C0710.2571%2C0710.5710%2C0710.1857%2C0710.1843%2C0710.3160%2C0710.0547%2C0710.4032%2C0710.2289%2C0710.3877%2C0710.3311%2C0710.5306%2C0710.3138%2C0710.4625%2C0710.2590%2C0710.4672%2C0710.4577%2C0710.2951%2C0710.0991%2C0710.0586%2C0710.0725%2C0710.1548%2C0710.3911%2C0710.2233%2C0710.4300%2C0710.0021%2C0710.0495%2C0710.1313%2C0710.5003%2C0710.4513%2C0710.3367%2C0710.2962%2C0710.3038%2C0710.5786%2C0710.3817%2C0710.3718%2C0710.2319%2C0710.4068%2C0710.4947%2C0710.2277%2C0710.4279%2C0710.0679%2C0710.4864%2C0710.0969%2C0710.0276%2C0710.5208%2C0710.3359%2C0710.3909%2C0710.1527%2C0710.5863%2C0710.5225%2C0710.2814%2C0710.0934%2C0710.2080%2C0710.0970%2C0710.2244%2C0710.1440%2C0710.2772%2C0710.1985%2C0710.1468%2C0710.3549%2C0710.1572%2C0710.2836%2C0710.3827%2C0710.4042%2C0710.3958%2C0710.5183%2C0710.1402%2C0710.3834%2C0710.4709%2C0710.2123%2C0710.1293%2C0710.0594%2C0710.4389%2C0710.0593%2C0710.5492%2C0710.5837%2C0710.5663%2C0710.4115%2C0710.4011%2C0710.2494%2C0710.0245%2C0710.1160%2C0710.2936%2C0710.2525&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Physics from HBT radii"}, "summary": "An approximate formula connecting the true and the HBT homogeneity regions in\nmultiparticle production processes is derived. It implies that when calculating\nthe HBT radii one should use the ceter of mass systems of the pairs rather than\nthe now popular LCMS system. A discussion of several examples clarifies the\npotential and limitations of the HBT method. The even cumulants of the\nX-distribution, inculding the HBT radii, can be determined for each homogeneity\nregion, but the relative positions of the homogeneity regions are\nunconstrained. This makes the HBT radii of little use for calculating\nquantities dependent on the interparticle interactions in coordinate space.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0710.1154%2C0710.2329%2C0710.2829%2C0710.5127%2C0710.4707%2C0710.2773%2C0710.1370%2C0710.2105%2C0710.2551%2C0710.0025%2C0710.1518%2C0710.3489%2C0710.0147%2C0710.4320%2C0710.0671%2C0710.5348%2C0710.2449%2C0710.2571%2C0710.5710%2C0710.1857%2C0710.1843%2C0710.3160%2C0710.0547%2C0710.4032%2C0710.2289%2C0710.3877%2C0710.3311%2C0710.5306%2C0710.3138%2C0710.4625%2C0710.2590%2C0710.4672%2C0710.4577%2C0710.2951%2C0710.0991%2C0710.0586%2C0710.0725%2C0710.1548%2C0710.3911%2C0710.2233%2C0710.4300%2C0710.0021%2C0710.0495%2C0710.1313%2C0710.5003%2C0710.4513%2C0710.3367%2C0710.2962%2C0710.3038%2C0710.5786%2C0710.3817%2C0710.3718%2C0710.2319%2C0710.4068%2C0710.4947%2C0710.2277%2C0710.4279%2C0710.0679%2C0710.4864%2C0710.0969%2C0710.0276%2C0710.5208%2C0710.3359%2C0710.3909%2C0710.1527%2C0710.5863%2C0710.5225%2C0710.2814%2C0710.0934%2C0710.2080%2C0710.0970%2C0710.2244%2C0710.1440%2C0710.2772%2C0710.1985%2C0710.1468%2C0710.3549%2C0710.1572%2C0710.2836%2C0710.3827%2C0710.4042%2C0710.3958%2C0710.5183%2C0710.1402%2C0710.3834%2C0710.4709%2C0710.2123%2C0710.1293%2C0710.0594%2C0710.4389%2C0710.0593%2C0710.5492%2C0710.5837%2C0710.5663%2C0710.4115%2C0710.4011%2C0710.2494%2C0710.0245%2C0710.1160%2C0710.2936%2C0710.2525&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "An approximate formula connecting the true and the HBT homogeneity regions in\nmultiparticle production processes is derived. It implies that when calculating\nthe HBT radii one should use the ceter of mass systems of the pairs rather than\nthe now popular LCMS system. A discussion of several examples clarifies the\npotential and limitations of the HBT method. The even cumulants of the\nX-distribution, inculding the HBT radii, can be determined for each homogeneity\nregion, but the relative positions of the homogeneity regions are\nunconstrained. This makes the HBT radii of little use for calculating\nquantities dependent on the interparticle interactions in coordinate space."}, "authors": ["K. Zalewski"], "author_detail": {"name": "K. Zalewski"}, "author": "K. Zalewski", "arxiv_comment": "LateX, 9 pages, no figures", "links": [{"href": "http://arxiv.org/abs/0710.4042v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0710.4042v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "hep-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "hep-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0710.4042v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0710.4042v1", "journal_reference": null, "doi": null, "fulltext": "arXiv:0710.4042v1 [hep-ph] 22 Oct 2007\n\nPhysics from HBT radii\nK.Zalewski\nM.Smoluchowski Institute of Physics\nJagellonian University, Cracow∗\nand\nInstitute of Nuclear Physics, Cracow\nOctober 22, 2018\n\nAbstract\nAn approximate formula connecting the true and the HBT homogeneity regions in multparticle production processes is derived. It\nimplies that when calculating the HBT radii one should use the center of mass systems of the pairs rather than the now popular LCMS\nsystem. A discussion of several simple examples clarifies the potential and limitations of the HBT method. The even cumulants of the\nX-distribution, including the HBT radii, can be determined for each\nhomogeneity region, but the relative positions of the homogeneity regions are unconstrained. This makes the HBT radii of little use for\ncalculating quantities dependent on the interparticle interactions in\ncoordinate space.\n\nPACS numbers 25.75.Gz, 13.65.+i\nBose-Einstein correlations, interaction region determination.\n\nAlmost fifty years ago, in a famous paper known as GGLP [1], a method\nof using momentum distributions for pairs of identical pions to estimate the\nAddress: Reymonta 4, 30 059 Krakow, Poland, e-mail: zalewski@th.if.uj.edu.pl. This\nwork has been partly supported by the Polish Ministry of Education and Science grant\n1P03B 045 29(2005-2008).\n∗\n\n1\n\n\fsizes of the interaction regions, i.e. of the regions where the hadrons are\nproduced in multiparticle production processes, has been described. Such\nradii, determined from momentum distributions of identical particles, have\nbeen later called, not very appropriately [2], HBT radii. GGLP assumed\nthat hadron production happens instantly and simultaneously at some time\nt = 0 and that there are no correlations between the momenta of the hadrons\nand their production points. Considering simultaneously the momentum of\na particle and its production point implies a quasiclassical approximation,\nbut it can be made plausible [3] that this approximation is good for heavy\nion scattering and acceptable also for the other multiparticle production processes. Let us denote by p1 and p2 the four-momenta of the two identical\npions in the pair1 , by x1 and x2 the space-time positions of their production\npoints and introduce the notation\n1\nK = (p1 + p2 );\n2\n\nq = p1 − p2 ;\n\n1\nX = (x1 + x2 );\n2\n\ny = x1 − x2 .\n\n(1)\n\nNote that p21 = p22 = m2 implies\ns\n\nr\n1\n1\n1\n(2)\nK0 = √\nEk2 + q2 + (Ek2 + q2 )2 − (K * q)2 ; q0 = β * q,\n4\n4\n2\np\nwhere Ek = K2 + m2 equals K0 at q = 0, and β = KK0 is the velocity of\nthe pair. GGLP found RHBT from the distribution of q 2 .\nSome twenty five year later Pratt [4] described a model with an exploding\nsource. In this model, the momentum distribution of particles depends on\nthe production point. Due to this correlation, the HBT radius differs significantly from the true radius, which is known from the input. For fixed K the\nresult was that, whileqthe true radius R does not depend on |K|, the HBT ra-\n\ndius decreases from 23 R for K = 0 to zero when |K| tends to infinity. This\nfinding was generalized by Bowler [5], who pointed out that in general, whenever there are strong correlations between momenta and production points,\nRHBT measures only the region where particles of similar momentum are\nproduced. Sinyukov [6], [7] associated these regions with the homogeneity\n1\n\nWe discuss pions for definiteness, but the discussion applies to any spin zero bosons.\n\n2\n\n\fregions considered in hydrodynamics and the name homogeneity region got\ngenerally accepted.\nMost models in their simplest form, i.e. without final state interactions,\nresonance decays etc., find the n-particle momentum distributions for identical pions from formulae equivalent to [8]\nP (p1 , . . . , pn ) = Cn\n\nn\nXY\n\nρ(pj ; pQj ),\n\n(3)\n\nQ j=1\n\nwhere the summation is over all the permutations j → Qj of the indices\nj = 1, . . . , n, Cn are normalization constants and ρ(p1 ; p2 ) is some time\nindependent, single particle density matrix. Thus ρ(p1 ; p2 ) determines all\nthe momentum distributions. The best [9] quantum mechanical analogue of\nthe classical phase space density is the Wigner function W (X, K), which is\na Fourier transform of ρ(p1 ; p2 ). Following most models, we assume further\nthat, W (X, K) defines the HBT X-distribution for the homogeneity region\ncorresponding to a given K.\nMeasuring all the momentum distributions is not enough to determine\nρ(p1 ; p2 ). As easily seen from (3), the observable momentum distributions\ndo not change [10], [11], under the transformation2\nρ(p1 ; p2 ) → ρf (p1 ; p2 ) = ei[f (p1 )−f (p2 )] ρ(p1 ; p2 ),\n\n(4)\n\nwherepf (p) is an arbitrary real-valued function of the four-vector p, and\np0 = p2 + m2 . This transformation does not affect the HBT radii3 of the\nhomogeneity regions, but it can shift and deform these regions.\nAn important concept introduced in [4] is the emission function S(X, K).\nAssuming chaotic sources, i.e. no interference between particles produced\nat different moments of time, this is related to the density matrix in the\nmomentum representation by the formula4\n2\n\nThe full group of transformations includes also ρ(p1 ; p2 ) → ρ∗ (p1 ; p2 ), but this corresponds to the space inversion of the interaction region and is of no interest in the present\ncontext.\n3\nMore generally, all the even cumulants of W (X, K), at K fixed, remain unchanged.\nThe proof is a simple extension of the proof given for the HBT radii in [11].\n4\nSometimes formulae equivalent to (5) with ρ(p1 ; p2 ) replaced by ρ∗ (p1 ; p2 ) are used.\nThe advantage of the present convention is that for S(X, K) = δ(t)g(X, K) function g is\njust the Wigner function.\n\n3\n\n\fρ(p1 ; p2 ) =\n\nZ\n\nd4 X S(X, K)eiqX .\n\n(5)\n\nIn the spirit of the quasiclassical approximation, using the well tested (cf.\ne.g. [12] and references given there) mass shell approximation\np\n(6)\nK0 = Ek ≡ m2 + K2 ,\n\none can interpret S(X, K) as the time-dependent distribution of the pairs of\nvectors {X, K}. The time independent homogeneity region for each K can\nbe obtained by integrating over time\nZ\np(X|K) = dt S(X, K),\n(7)\n\nwhere the notation stresses that we are interested in the distribution of X\nfor given K. At this point the mass shell approximation (6) is necessary in\norder to make K0 , and consequently S(X; K) and p(X|K), independent of\nq.\nFurther we will call p(X|K) true distribution in order to distinguish it\nfrom the HBT distribution given by the Wigner function. Invariance (4)\nmeans that for a given set of momentum distributions there is a variety of\nHBT X-distributions which all correspond to the same fit to the data. One\nway of choosing among them is to specify the emission function.\nIt was soon noticed [13] that for a given ρ(p1 ; p2 ) there is an infinity\nof solutions for S and that, in particular, a small long-lived source may be\nundistinguishable from a large short-lived source. Thus, the information\nabout interaction regions obtained from momentum measurements is rather\nincomplete.\nThe standard relation between the density matrix and the Wigner function yields from (5)\nZ 3 Z\ndq\n′\nW (X, K) =\nd4 X ′ S(X ′ , K)eiq*(X−X +β t) ,\n(8)\n3\n(2π)\n\nwhere q0 has been eliminated using (2). We invoke now the mass shell approximation (6), which makes S independent of q. Thus, the integration d3 q\ngives (2π)3 δ(X − X′ + βt) and the integration d3 X ′ can be performed. The\nresult is\n\n4\n\n\fW (X, K) =\n\nZ\n\ndt S(X + βt, t, K).\n\n(9)\n\nThe comparison of the true interaction region with the HBT one reduces to\nthe comparison of the integrals in (7) and (9).\nThe integrals in (7) and (9), and consequently the true and HBT homogeneity regions, coincide only5 for β = 0. This can be achieved by working\nwith pairs which have the same velocity β and using the reference frame\nwhere β = 0.\nWe summarize our findings:\n• The HBT results are credible only for single homogeneity regions, i.e.\nat given K.\n• For each homogeneity region, only the pairs with the same velocity,\ni.e. with the same K, are considered and one should use the reference\nframe, where this velocity is zero. There, the true and the HBT homogeneity regions coincide which is not the case for other frames, as for\ninstance for the now popular (cf e.g. the review [14]) LCMS frame. An\nadditional pragmatic argument in favor of the rest frame is that the\neffects of the final state interactions are the simplest there (cf. e.g. [17]\nand the references given there).\n• The true radii of the homogeneity regions, more generally all the even\ncumulants of their X-distributions, can be obtained from the HBT\nanalysis of the momentum distributions. For instance, when p(X|K) =\np(−X|K) all the odd cumulants vanish and, therefore, p(X|K) can be\nmeasured by the HBT method.\n• The space distribution of the centers of the homogeneity regions hXi(K)\nis unconstrained by the HBT analysis, but once it is fixed, all the functions p(X|K) can be determined [10], [11].\nLet us discuss some simple examples illustrating these features of the\nHBT method. In order to avoid unessential complications, we will consider\none space dimension and very simple emission functions constructed from\nδ-functions and step functions. They violate the Heisenberg uncertainty relations, but all these calculations can be repeated in three dimensions using\nGaussians and the results are qualitatively the same.\n5\n\nExcept for the trivial case when S(X, K) ∼ δ(t).\n\n5\n\n\fLet us first consider the emission function\nS1 (X, K; t0 , a, b, κ) = δ(t − t0 )Θa,b (X)δ(K − κ),\nwhere t0 , a < b and κ are real constants. Function Θa,b (x) =\nand zero outside this interval. For this emission function\n\n1\nb−a\n\nb−a\n−β t0 ) 2 sin |q| 2\n−iq( a+b\n2\n\nρ(p1 ; p2 ) = δ(K − κ)e\n\n|q|(b − a)\nW (X, K) = Θa,b (X + βt0 )δ(K − κ).\n\n(10)\nfor a < x < b\n\n(11)\n(12)\n\nIt is seen that the segment a < X < b got shifted to a − βt0 < X < b − βt0 .\nAcording to (11) this shift is due to the phase factor in the density matrix.\nSince in the formula for the two-particle correlation function only the absolute\nvalue of ρ appears, experiment is blind to such shifts. This remains true also\nwhen many-particle correlation functions are measured, even when all the\nmeasurements are performed with perfect precision [10], [11]. The fact that\nthe position of the center of the interaction region cannot be found from the\nHBT analysis of the momentum distributions is, of course, well known (see\ne.g. [12]), but one should also keep in mind that when the emission function\nis given the density matrix, the Wigner function and, consequently, all the\nHBT homogeneity regions are unambiguously defined.\nAs the next example we take\n1\n[S1 (X, K; t0 , −a, 0, κ1 ) + S1 (X, K; t0 , 0, a, κ2 )]\n(13)\n2\nUsing the previous example, it is seen that the segment −a < X < a is\nmapped onto two segments: −a − β 1 t0 < X < −β 1 t0 and −β 2 t0 < X <\na − β 2 t0 . Let us choose\nS2 (X, K) =\n\n1\nf (p) = −b * p − cp2 ,\n(14)\n2\nwhere b is an arbitrary vector and c an arbitrary constant, and make the\ntransformation (4). Each HBT homogeneity region gets shifted by b + cK.\nFor κ1 6= κ2 , by a suitable choice of c, one can obtain any prescribed distance\nbetween the centers of the two segments. The true length of the interaction\nregion, as seen from S, is 2a. The length of the transformed interaction region, which follows just as well from the data on momentum distributions,\n6\n\n\fcan be any number not smaller than a. What is the way out? One has to\ninvoke the homogeneity regions. For each K separately, the length of the\nsegment where particles with this value of K are produced, i.e. of the homogeneity region, is reproduced correctly. The positioning of the homogeneity\nregions corresponding to different values of K, however, is beyond control\nwhen the momentum distributions are the only input. In three dimensions it\nis easy to prove [10], [11] that by a suitable choice of function f (p) in (4), the\npositions of the centers of the homogeneity regions hXi(K) can be changed\ninto hXi(K) + g(K), where g is an arbitrary differentiable function of K.\nAs an amusing example in three dimensions let us consider the models\nwhere Kμ ≈ λXμ , and λ is a constant [15], [16]. They correspond to emission\nfunctions\nS(X, K) = δ 3 (X − βt)S(X, t, K),\n\n(15)\n\nwhere S is some function which does not affect the singularity introduced by\nthe δ 3 . The corresponding Wigner function is\nZ\n3\nW (X, K) = δ (X) dt S(βt, t, K).\n(16)\nThus, the HBT interaction region reduces to one point. To be sure: such\nmodels, when properly used, are quite successful, but finding the interaction region from the density matrix in the momentum representation is their\nmisuse.\nAs our last model consider the emission function\nS(X, K) = Θ0,a (t)δ(X)δ(K − κ).\n\n(17)\n\nThis corresponds to the Wigner function\nW (X, K) =\n\n1\nΘ0,a (−X/β)δ(K − κ) = Θ−β a,0 (X)δ(K − κ).\nβ\n\n(18)\n\nThe length of the true interaction region is zero, while the length of the HBT\ninteraction region is βa. Thus, in order to get the true length from the HBT\nanalysis one must use the reference frame where K = 0. We conclude that,\nworking with all the pairs which have a given velocity, one should measure\ntheir homogeneity region in their rest frame. Let us consider some further\nimplications of our analysis:\n7\n\n\fIf there are no position-momentum correlations, all the homogeneity regions, measured in the respective rest frames, are equivalent to each other\nand to the overall interaction region. The ambiguity (4) reduces to a lack\nof information about the position of the center of the interaction region [11].\nThus, in this case the HBT method works very well. One should keep in\nmind however that, as illustrated by our second model, the independence of\nthe homogeneity region on K is a necessary, but not a sufficient condition\nfor the absence of position-momentum correlations.\nIf there are no interparticle interactions in coordinate space, the HBT\nhomogeneity regions may be all we need. E.g. the entropy of a gas of\nnoninteracting particles (in the quasiclassical approximation) depends on the\naccessible phase space volume. This can be calculated by integrating over\ncoordinate space at fixed momentum and then integrating over momenta.\nThe first integration gives just the HBT volume of the homogeneity region,\nthough one should keep in mind the ambiguity (4). If there are interparticle\ninteractions in coordinate space, however, it may make a lot of difference\nwhether the homogeneity regions are on top of each other, or scattered over\nspace. Thus, the use of the HBT radii to calculate the entropy of a gas of\ninteracting particles, or of their mean free\nR paths, is risky.\nFor β = 0 the true space density dt S(X, K) can be unambiguously\nobtained from ρ(p1 , p2 ) by inverse Fourier transformation. Thus, all the ambiguity in the determination of the homogeneity regions, including their absolute positions, results from (4) and disappears when f (p) is fixed. Conversely,\nwhen the true space density is known, it yields unambiguously ρ(p1 ; p2 ) and\nthus it fixes f (p).\nThe ambiguity in the determination of the space-time density S follows\nfrom the irreversibility of transformation (5) and persists even when f (p) is\nfixed, i.e. when ρ(p1 ; p2 ) is known.\n\nAcknowledgements\n\nThe author thanks A. Bialas, K.Fialkowski and W. Florkowski for helpful\ncomments.\n\nReferences\n[1] G. Goldhaber, S. Goldhaber, W. Lee and A. Pais, Phys. Rev.\n210(1960)300.\n\n8\n\n\f[2] G.I. Kopylov and M.I Podgoretskii, Zhur.Exp.Theor.Phys. 69(1975)434.\n[3] K. Zalewski, hep-ph/07052961.\n[4] S. Pratt Phys. Rev. Lett. 53(1984)1219.\n[5] M.G. Bowler, Z. Phys. C29(1985)617.\n[6] Yu.M. Sinyukov, in J. Letessier, H.H. Gutbrod and J. Rafelski (eds.)\nHot Hadronic Matter Theory and Experiment, Plenum Press, New York\n(1995) p. 309.\n[7] S.V. Akkelin and Yu.M. Sinyukov, Phys. Lett. B356(1995)525.\n[8] J. Karczmarczuk, Nucl. Phys. B78(1974)370.\n[9] M. Hillery, R.F. O'Connel, M.O. Scully and E.P. Wigner, Phys. Rep.\n106(1984)121.\n[10] A. Bialas and K. Zalewski, Phys. Rev. D72(2005)036009.\n[11] K. Zalewski, Phys. Rev. D74(2006)114022.\n[12] U.A. Wiedemann and U. Heinz, Phys. Rep. 319(1999)145.\n[13] S. Pratt, Phys. Rev. D33(1986)72.\n[14] M.A. Lisa, S. Pratt, R. Soltz and W. Wiedemann, Ann. Rev. Nucl. Part.\nPhys. 55(2005)357.\n[15] T. Csörgö and J.Zimańyi, Nucl. Phys. A517(1990)588.\n[16] A. Bialas and K. Zalewski, Acta Phys. Pol. B30(1999)359.\n[17] P. Danielewicz and S. Pratt, Phys. Rev. C75(2007)0304907.\n\n9\n\n\f"}