{"id": "http://arxiv.org/abs/1201.6419v1", "guidislink": true, "updated": "2012-01-31T01:58:05Z", "updated_parsed": [2012, 1, 31, 1, 58, 5, 1, 31, 0], "published": "2012-01-31T01:58:05Z", "published_parsed": [2012, 1, 31, 1, 58, 5, 1, 31, 0], "title": "The sub-Saturn Mass Transiting Planet HAT-P-12b", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1201.0859%2C1201.4227%2C1201.3839%2C1201.5161%2C1201.4805%2C1201.2354%2C1201.3914%2C1201.0307%2C1201.3185%2C1201.5417%2C1201.5677%2C1201.6168%2C1201.2910%2C1201.3447%2C1201.3524%2C1201.4377%2C1201.0701%2C1201.5425%2C1201.3835%2C1201.1981%2C1201.1133%2C1201.3980%2C1201.1685%2C1201.2043%2C1201.2377%2C1201.3268%2C1201.4495%2C1201.0710%2C1201.2936%2C1201.1319%2C1201.2833%2C1201.5251%2C1201.6151%2C1201.1280%2C1201.3386%2C1201.5060%2C1201.4054%2C1201.1536%2C1201.5505%2C1201.0436%2C1201.5220%2C1201.3804%2C1201.3047%2C1201.4500%2C1201.0708%2C1201.1436%2C1201.1856%2C1201.4168%2C1201.4806%2C1201.4688%2C1201.2274%2C1201.0406%2C1201.5120%2C1201.1113%2C1201.1104%2C1201.3444%2C1201.6213%2C1201.2167%2C1201.1261%2C1201.6075%2C1201.2872%2C1201.6419%2C1201.4502%2C1201.2019%2C1201.4067%2C1201.5852%2C1201.0839%2C1201.0547%2C1201.4286%2C1201.1464%2C1201.6024%2C1201.2640%2C1201.4585%2C1201.3918%2C1201.4139%2C1201.1872%2C1201.0303%2C1201.4098%2C1201.0285%2C1201.5619%2C1201.2884%2C1201.6535%2C1201.0047%2C1201.4638%2C1201.0654%2C1201.1957%2C1201.4015%2C1201.0007%2C1201.1269%2C1201.2693%2C1201.5561%2C1201.2988%2C1201.4837%2C1201.1496%2C1201.1806%2C1201.0791%2C1201.2247%2C1201.6473%2C1201.6510%2C1201.2702%2C1201.4913&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The sub-Saturn Mass Transiting Planet HAT-P-12b"}, "summary": "We present new photometric data of the transiting planet HAT-P-12b observed\nin 2011. Our three transit curves are modelled using the JKTEBOP code and\nadopting the quadratic limb-darkening law. Including our measurements, 18\ntransit times spanning about 4.2 yr were used to determine the improved\nephemeris with a transit epoch of 2,454,187.85560$\\pm$0.00011 BJD and an\norbital period of 3.21305961$\\pm$0.00000035 d. The physical properties of the\nstar-planet system are computed using empirical calibrations from eclipsing\nbinary stars and stellar evolutionary models, combined with both our transit\nparameters and previously-known spectroscopic results. We found that the\nabsolute dimensions of the host star are $M_{\\rm A}$=0.73$\\pm$0.02 M$_\\odot$,\n$R_{\\rm A}$=0.70$\\pm$0.01 R$_\\odot$, log $g_{\\rm A}$=4.61$\\pm$0.02, $\\rho_{\\rm\nA}$=2.10$\\pm$0.09 $\\rho_{\\odot}$, and $L_{\\rm A}$=0.21$\\pm$0.01 L$_\\odot$. The\nplanetary companion has $M_{\\rm b}$=0.21$\\pm$0.01 M$_{\\rm Jup}$, $R_{\\rm\nb}$=0.94$\\pm$0.01 R$_{\\rm Jup}$, log $g_{\\rm b}$=2.77$\\pm$0.02, $\\rho_{\\rm\nb}$=0.24$\\pm$0.01 $\\rho_{\\rm Jup}$, and $T_{\\rm eq}$=960$\\pm$14 K. Our results\nagree well with standard models of irradiated gas giants with a core mass of\n11.3 M$_{\\oplus}$.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1201.0859%2C1201.4227%2C1201.3839%2C1201.5161%2C1201.4805%2C1201.2354%2C1201.3914%2C1201.0307%2C1201.3185%2C1201.5417%2C1201.5677%2C1201.6168%2C1201.2910%2C1201.3447%2C1201.3524%2C1201.4377%2C1201.0701%2C1201.5425%2C1201.3835%2C1201.1981%2C1201.1133%2C1201.3980%2C1201.1685%2C1201.2043%2C1201.2377%2C1201.3268%2C1201.4495%2C1201.0710%2C1201.2936%2C1201.1319%2C1201.2833%2C1201.5251%2C1201.6151%2C1201.1280%2C1201.3386%2C1201.5060%2C1201.4054%2C1201.1536%2C1201.5505%2C1201.0436%2C1201.5220%2C1201.3804%2C1201.3047%2C1201.4500%2C1201.0708%2C1201.1436%2C1201.1856%2C1201.4168%2C1201.4806%2C1201.4688%2C1201.2274%2C1201.0406%2C1201.5120%2C1201.1113%2C1201.1104%2C1201.3444%2C1201.6213%2C1201.2167%2C1201.1261%2C1201.6075%2C1201.2872%2C1201.6419%2C1201.4502%2C1201.2019%2C1201.4067%2C1201.5852%2C1201.0839%2C1201.0547%2C1201.4286%2C1201.1464%2C1201.6024%2C1201.2640%2C1201.4585%2C1201.3918%2C1201.4139%2C1201.1872%2C1201.0303%2C1201.4098%2C1201.0285%2C1201.5619%2C1201.2884%2C1201.6535%2C1201.0047%2C1201.4638%2C1201.0654%2C1201.1957%2C1201.4015%2C1201.0007%2C1201.1269%2C1201.2693%2C1201.5561%2C1201.2988%2C1201.4837%2C1201.1496%2C1201.1806%2C1201.0791%2C1201.2247%2C1201.6473%2C1201.6510%2C1201.2702%2C1201.4913&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We present new photometric data of the transiting planet HAT-P-12b observed\nin 2011. Our three transit curves are modelled using the JKTEBOP code and\nadopting the quadratic limb-darkening law. Including our measurements, 18\ntransit times spanning about 4.2 yr were used to determine the improved\nephemeris with a transit epoch of 2,454,187.85560$\\pm$0.00011 BJD and an\norbital period of 3.21305961$\\pm$0.00000035 d. The physical properties of the\nstar-planet system are computed using empirical calibrations from eclipsing\nbinary stars and stellar evolutionary models, combined with both our transit\nparameters and previously-known spectroscopic results. We found that the\nabsolute dimensions of the host star are $M_{\\rm A}$=0.73$\\pm$0.02 M$_\\odot$,\n$R_{\\rm A}$=0.70$\\pm$0.01 R$_\\odot$, log $g_{\\rm A}$=4.61$\\pm$0.02, $\\rho_{\\rm\nA}$=2.10$\\pm$0.09 $\\rho_{\\odot}$, and $L_{\\rm A}$=0.21$\\pm$0.01 L$_\\odot$. The\nplanetary companion has $M_{\\rm b}$=0.21$\\pm$0.01 M$_{\\rm Jup}$, $R_{\\rm\nb}$=0.94$\\pm$0.01 R$_{\\rm Jup}$, log $g_{\\rm b}$=2.77$\\pm$0.02, $\\rho_{\\rm\nb}$=0.24$\\pm$0.01 $\\rho_{\\rm Jup}$, and $T_{\\rm eq}$=960$\\pm$14 K. Our results\nagree well with standard models of irradiated gas giants with a core mass of\n11.3 M$_{\\oplus}$."}, "authors": ["Jae Woo Lee", "Jae-Hyuck Youn", "Seung-Lee Kim", "Chung-Uk Lee", "Tobias Cornelius Hinse"], "author_detail": {"name": "Tobias Cornelius Hinse"}, "author": "Tobias Cornelius Hinse", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1088/0004-6256/143/4/95", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1201.6419v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1201.6419v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "17 pages, including 5 figures and 5 tables, accepted for publication\n  in AJ", "arxiv_primary_category": {"term": "astro-ph.EP", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph.EP", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "astro-ph.SR", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1201.6419v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1201.6419v1", "journal_reference": null, "doi": "10.1088/0004-6256/143/4/95", "fulltext": "The sub-Saturn Mass Transiting Planet HAT-P-12b\nJae Woo Lee, Jae-Hyuck Youn, Seung-Lee Kim, Chung-Uk Lee, and Tobias Cornelius Hinse\n\narXiv:1201.6419v1 [astro-ph.EP] 31 Jan 2012\n\nKorea Astronomy and Space Science Institute, Daejon 305-348, Korea\njwlee@kasi.re.kr, jhyoon@kasi.re.kr, slkim@kasi.re.kr, leecu@kasi.re.kr,\ntchinse@gmail.com\nABSTRACT\nWe present new photometric data of the transiting planet HAT-P-12b observed in\n2011. Our three transit curves are modelled using the JKTEBOP code and adopting\nthe quadratic limb-darkening law. Including our measurements, 18 transit times spanning about 4.2 yr were used to determine the improved ephemeris with a transit epoch\nof 2,454,187.85560±0.00011 BJD and an orbital period of 3.21305961±0.00000035 d.\nThe physical properties of the star-planet system are computed using empirical calibrations from eclipsing binary stars and stellar evolutionary models, combined with both\nour transit parameters and previously-known spectroscopic results. We found that the\nabsolute dimensions of the host star are MA =0.73±0.02 M⊙ , RA =0.70±0.01 R⊙ , log\ngA =4.61±0.02, ρA =2.10±0.09 ρ⊙ , and LA =0.21±0.01 L⊙ . The planetary companion\nhas Mb =0.21±0.01 MJup , Rb =0.94±0.01 RJup , log gb =2.77±0.02, ρb =0.24±0.01 ρJup ,\nand Teq =960±14 K. Our results agree well with standard models of irradiated gas giants\nwith a core mass of 11.3 M⊕ .\nSubject headings: planetary systems - stars: individual (HAT-P-12) - techniques:\nphotometric\n\n1.\n\nINTRODUCTION\n\nTransiting exoplanets are interesting objects to study because the coupling of radial velocity\nand photometric measurements allows a determination of stellar and planetary parameters and\nthus give us an important constraint on fundamental models of planet formation and evolution.\nFor that purpose, we need to precisely measure the physical properties of both the stars and\nplanets in these systems from a detailed analysis of transit curves obtained with high-precision\nphotometry. Basically it is possible to regard the star-planet systems as detached eclipsing binaries\nwith extremely low mass ratios (. 0.001). Therefore, the methods and tools that are used to model\nthe binary stars could be applied to analyze the light curves of transiting exoplanets and then to\ndetermine their physical parameters (Southworth 2008, 2009; Lee et al. 2011).\nThe transiting nature of HAT-P-12b was detected with the HAT-5 telescope of Hungarianmade Automated Telescope Network (HATNet; Bakos et al. 2004) in 2006. Hartman et al. (2009)\n\n\f–2–\nconducted follow-up photometry of four transits together with spectroscopic observations and reported that the transit features come from a Saturn-mass planet with a mass of 0.21±0.01 MJup\nand a radius of 0.96+0.03\n−0.02 RJup in a 3.2-d circular orbit. Its host star is a K4 dwarf GSC 3033706 (2MASS J13573347+4329367; V =+12.84) with MA =0.73±0.02 M⊙ , RA =0.70+0.02\n−0.01 R⊙ , and\n[Fe/H]=−0.29±0.05. Since HAT-P-12b is one of the lowest-density planets orbiting metal-poor\nhost stars, the physical properties of the system are important for irradiation models. In this\nwork, we report and analyze three new high-precision transits of HAT-P-12 and refine the physical\nparameters of the transiting planetary system.\n\n2.\n\nNEW OBSERVATIONS\n\nWe obtained new photometric data from observing three transits of HAT-P-12b. Observations\nwere carried out between 2011 March and May, using an ARC 4K CCD camera and a Cousins R\nfilter attached to the 1.0-m reflector at the Mt. Lemmon Optical Astronomy Observatory (LOAO)\nin Arizona, USA. The telescope was significantly defocused, because it is expected to minimise\nrandom and flat fielding errors (see, e.g., Southworth et al. 2009). The e2v CCD chip has 4096×4096\npixels and a pixel size of 15 μm. The image field-of-view is ∼ 28×28 arcmin2 at the f/7.5 Cassegrain\nfocus of the telescope. A summary of the observations is given in Table 1, where we present\nobserving interval, filter, binning mode, exposure time, numbers of observed points, and weather\ncondition. During the first run, a gap before the transit ingress was caused by technical problems.\nWith the customary IRAF package, we processed the CCD frames to correct for bias level, dark\nnoise, and pixel-to-pixel inhomogeneities of quantum efficiency (flat field correction). We applied\nsimple aperture photometry to obtain instrumental magnitudes.\nFor each transit event we constructed an artificial comparison star by monitoring field stars\nimaged on the chip. Following the method described in Lee et al. (2011), we selected and combined\nby a weighted average about 10 candidate non-variable comparison stars. Then, the differential\nmagnitudes from the artificial reference were normalized by fitting a linear function to the out-oftransit data to remove time-varying atmospheric effects (detrending). Resultant transit curves are\nplotted in Figure 1 and listed in Table 2, where times are Barycentric Julian Dates (BJD) in the\nBarycentric Dynamical Time system (Eastman et al. 2010).\n\n3.\n\nLIGHT-CURVE ANALYSIS AND TRANSIT TIMES\n\nTo determine the planetary and orbital parameters, three LOAO transits of HAT-P-12 were\nanalyzed simultaneously in a manner almost identical to that for the transiting planetary system\nTrES-3 (Lee et al. 2011) using the JKTEBOP code (Southworth et al. 2004a,b), which is a\ncode for modelling the light curves of detached eclipsing binary stars using biaxial spheroids. The\nmain parameters of the model are the orbital period (P ), the ephemeris epoch (T0 ), the fractional\n\n\f–3–\nradii of star (rA =RA /a, where a is the orbital semi-major axis) and planet (rb =Rb /a), the orbital\ninclination (i), and the limb-darkening coefficients (LDCs). Actually, rA and rb are incorporated\nas their sum (rA +rb ) and ratio (k=rb /rA ). Throughout this paper, we refer to star and planet as\nthe subscripts 'A' and 'b', respectively.\nIn the transit analysis, we used rA +rb and k as the fitting parameters, because these parameters\nare more weakly correlated than between rA and rb (Southworth 2008). Initial quadratic LDCs\nwere taken from the tables of Claret (2000), using the atmospheric parameters of TA =4650±60 K,\nlog gA =4.61±0.01, and [Fe/H]=−0.29±0.05 (Hartman et al. 2009). Final results are obtained from\nfitting the linear LDC (uA ) but fixing the non-linear LDC (vA ), because the two LDCs suffer from\nstrong correlations between them (Southworth 2008; Johnson et al. 2008). These are summarized\nin Table 3, together with the stellar density (ρA ) and the planetary surface gravity (gb ) and zerop\nalbedo equilibrium temperature defined as Teq =TA rA /2 (Southworth 2010). The lower three\nvalues were directly calculated from those transit parameters and the stellar velocity amplitude\n(KA =35.8±1.9 m s−1 ) of Hartman et al. (2009). In order to assess the uncertainties of the fitted\nparameters, we ran 10000 Monte Carlo simulations and a residual permutation algorithm (Jenkins\net al. 2002) implemented into JKTEBOP, respectively. On these occasions, the non-linear LDC\nwas perturbed by ±0.1 around the fixed value. The error estimates presented in Table 3 are the\n1σ-values adopted from the larger of the two results. Figure 2 displays the light curves with our\nbest-fitting model and residuals.\nFor ephemeris computations, the minimum times and their uncertainties for our three transits\nwere determined with the JKTEBOP code and the model parameters of Table 3. In addition\nto these, four transit times were newly determined by us from the individual measurements of\nHartman et al. (2009). The times reported in the discovery paper are not actual events, because\nthey were calculated by assuming strictly periodic transits and by adjusting both centers of the\nfirst transit and the last transit covering all observations in transit modeling. The results are given\nin Table 4, together with 11 epochs taken from Exoplanet Transit Database1 (ETD; Poddaný et al.\n2010). The ETD timings were transformed from HJD based on UTC into TDB-based BJD using\nthe online applets2 developed by Eastman et al. (2010). By including these literature-based transit\ntimings into a linear least-squares fit, we computed the orbital ephemeris of HAT-P-12 to be\nCtr = BJD 2, 454, 187.85560(11) + 3.21305961(35)E,\n\n(1)\n\nwhere E is the number of orbital cycles elapsed from the reference epoch and the parenthesized\nnumbers are the 1σ-error values for the last digit of each term of the ephemeris. Individual midtransit timing errors were used to obtain the corresponding weight factors. The period is somewhat\nshorter than those of Hartman et al. (P =3.2130598±0.0000021 d) and from our transit analysis in\nTable 3.\n1\n\nhttp://var2.astro.cz/ETD/\n\n2\n\nhttp://astroutils.astronomy.ohio-state.edu/time/\n\n\f–4–\nThe observed (O) minus calculated (Ctr ) transit times from equation (1) are given in the\nfourth column of Table 4 and plotted in Figure 3. The timing residuals seems to indicate a shortterm oscillation as is shown in the figure. This might be giving a hint about a period change, for\nexample, due to the presence of a second planet in the HAT-P-12 system. We examined whether the\nresiduals represent periodic variability, but no detectable periodicity was found. As in the case of\nclose binaries with deep convective envelopes (Lee et al. 2009), the apparent transit timing variation\nin Figure 3 may be produced by the sporadic asymmetries of transit curves due to starspots on\nstellar surface caused by magnetic activity. In reality, previous measurements (especially from\nETD) might have red noise contamination and their errors would then be underestimated (Carter\n& Winn 2009).\n\n4.\n\nRESULTS AND DISCUSSION\n\nWe can compute the absolute demensions of transiting planetary systems by combining photometric and spectroscopic results. Currently, there are two main methods to obtain stellar and\nplanetary parameters from the observed quantities. The first method is to use the empirical relations from eclipsing binary stars and the second to apply the isochrones from stellar evolutionary\nmodels. For this procedure, we used the planet velocity amplitude Kb as a key parameter governing\nthe solution process to find the best match between the observations and predictions, which is the\nsame approach as in Southworth (2009) and Lee et al. (2011).\nFirst of all, we calculated the physical properties of the HAT-P-12 system using the new\ncalibrations of stellar masses and radii expressed as TA , log ρA , and [Fe/H] (Enoch et al. 2010,\nhereafter ECPH), which are originally defined by Torres et al. (2010) from 95 well-studied eclipsing\nbinaries and replaced log gA with log ρA . The process is to look for Kb satisfying simultaneously\nthe stellar mass and radius from the two relations. The calibrated mass and radius of MA,ECPH =\n0.765±0.012 M⊙ and RA,ECPH = 0.686±0.012 R⊙ were used to minimize the χ2 expressed as:\nχ2 =\n\n\u0014\n\nMA,ECPH − MA,pred\nσMA,ECPH\n\n\u00152\n\n+\n\n\u0014\n\nRA,ECPH − RA,pred\nσRA,ECPH\n\n\u00152\n\n,\n\n(2)\n\nwhere MA,pred and RA,pred are the relation-predicted mass and radius from the observations and\nthe Kb values. The results are given in the second column of Table 5. The quantity Θ denotes the\nSafronov (1972) number.\nBy considering both the metallicities allowed by the observational errors in [Fe/H] and the\nages for each metallicity, we use three different sets of the stellar evolutionary models: Yonsei-Yale\n(Demarque et al. 2004), Padova (Girardi et al. 2000), and Baraffe et al. (1998, hereafter BCAH).\nThis method also aims to find the velocity amplitude Kb for which the measured values [Fe/H],\nrA , and TA are best fitted to the radius RA,pred and temperature TA,pred predicted from the model\n\n\f–5–\nisochrones for each metalicity. This consists of calculating the χ2 fitting statistic,\n\u0014\n\n[Fe/H] − [Fe/H]model\nχ =\nσ[Fe/H]\n2\n\n\u00152\n\n\u0014\n\nrA − (RA,pred /a)\n+\nσr A\n\n\u00152\n\n\u0014\n\nTA − TA,pred\n+\nσTA\n\n\u00152\n\n,\n\n(3)\n\nwhere σ[Fe/H] , σrA , and σTA are the uncertainties corresponding to the measurements. Our process\nobtained a best-fit model when the BCAH isochrones with [Fe/H]=−0.25 were used; both the\nYonsei-Yale and Padova isochrones cannot constrain the age of the planetary system and favor the\nmetal-rich stellar models.\nThe isochrones from the BCAH models are plotted in Figure 4 along with the position of\nHAT-P-12A and the results are listed in the third column of Table 5. The mass and radius from\nBCAH are somewhat smaller than those derived from the empirical calibration of eclipsing binary\nstars, although the physical parameters between the two methods agree with each other within their\nuncertainties. Similar situations are found for WASP-21 (Bouchy et a. 2010; Barros et al. 2011),\nWASP-37 (Simpson et a. 2011), and WASP-39 (Faedi et al. 2011). As is the case for HAT-P-12,\nthe three planet host stars are metal-poor with metalicities [Fe/H] of −0.46±0.11, −0.40±0.12, and\n−0.12±0.10, respectively. On the other hand, 11 eclipsing binaries sampled by Torres et al. (2010)\nare low-metalicity systems ([Fe/H]<0.0). Among these only one component star (V636 CenB) is\nsmaller than 1 M⊙ . From this it follows that the physical properties from the BCAH model for\nmetal-poor low-mass stars seem to be more reliable than those from the empirical calibrations. We\nchose the BCAH solutions as our final results of HAT-P-12.\nThe location of HAT-P-12b in the mass-radius diagram is shown in Figure 5, together with\nten known Saturn-mass transiting exoplanets with masses in the range 0.15 MJup < M < 0.4 MJup ,\nwherein Kepler-16b is a circumbinary transiting planet on a nearly circular 229-d orbit around its\ntwo parent stars (Doyle et al. 2011). In the same figure, we show constant density contours for 0.1,\n0.25, 0.5 and 1.0 ρJup . The physical properties obtained in this study indicate that HAT-P-12b is\na low-density sub-Saturn mass planet with a mass of 0.21 MJup , a radius of 0.94 RJup , and a mean\ndensity of ρb =0.24 ρJup . The results are most similar to those (Mb =0.20 MJup , Rb =1.00 RJup ,\nρb =0.19 ρJup ) of the transiting exoplanet HAT-P-18b (Hartman et al. 2011). However, HATP-12 is younger and more metal-poor than HAT-P-18 with an age of 12.4 Gyr and a metallicity\nof [Fe/H]=+0.10. Furthermore, a classification of transiting close-in planets has recently been\nsuggested by Hansen & Barman (2007). With the derived equilibrium temperature of Teq =960 K\nand Safronov number of 0.023 would classify HAT-P-12b to be of class II. However, it was recently\nshown by Southworth (2010) that a correlation between Teq and Θ appears to have little statistical\nsignificance. Therefore this classification seems to be of little importance. In addition, future\nobservations of secondary transits (or occultations) of HAT-P-12b might prove to be difficult due\nto the planet's low equilibrium temperature.\nWe compared our mass and radius to the predicted values from theoretical models of Fortney\net al. (2007) with various core masses. For these, their models were interpolated to the age of\n√\n3.2 Gyr and the solar equivalent semi-major axis of 0.0843±0.0029 AU calculated from a LA and\n\n\f–6–\nwere plotted in Figure 5 as solid curves. We conclude that HAT-P-12b is a H/He-dominated gas\ngiant planet with a core mass of 11.3+2.6\n−2.1 M⊕ and is moderately irradiated by its low-metallicity\nhost star. Of the 10 circumstellar transiting planets, eight exoplanets including HAT-P-12b follow a\nsuggestive correlation between the inferred core mass and host star's metallicity (Guillot et al. 2006;\nBurrows et al. 2007), while the recently discovered planets HAT-P-18b and HAT-P-19b (Hartman\net al. 2011) with negligible core masses but super-solar metallicities disagree with the prediction.\nFurther discoveries will help to identify and understand the possible correlation between planetary\nparameters such as metallicity, core mass, radius, and equilibrium temperature.\nThe authors wish to thank the staffs of LOAO for assistance with our observations. We\nappreciate the careful reading and valuable comments of the anonymous referee. We have used the\nSimbad Database maintained at CDS and the Exoplanet Transit Database in this research. This\nwork was supported by the KASI (Korea Astronomy and Space Science Institute) grant 2012-1410-02.\n\n\f–7–\nREFERENCES\nBakos, G. Á ., Noyes, R. W., Kovács, G., Stanek, K. Z., Sasselov, D. D., & Domsa, I. 2004, PASP,\n116, 266\nBaraffe, I., Chabrier, G., Allard, F., & Hauschildt, P. H. 1998, A&A, 337, 403 (BCAH)\nBarros, S. C. C., et al. 2011, MNRAS, 416, 2593\nBouchy, F., et al. 2010, A&A, 519, A98\nBurrows, A., Hubeny, I., Budaj, J., & Hubbard, W. B. 2007, ApJ, 661, 502\nCarter, J. A. & Winn, J. N. 2009, ApJ, 704, 51\nClaret, A. 2000, A&A, 363, 1081\nDoyle, L. R., et al. 2011, Science, 333, 1602\nDemarque, P., Woo, J.-H., Kim, Y.-C., & Yi, S. K. 2004, ApJS, 155, 667\nEastman, J., Siverd, R., & Gaudi, B. S. 2010, PASP, 122, 935\nEnoch, B., Cameron, A. C., Parley, N. R., & Hebb, L. H. 2010, A&A, 516, A33 (ECPH)\nFaedi, F., et al. 2011, A&A 531, A40\nFortney, J. J., Marley, M. S., & Barnes, J. W. 2007, ApJ, 659, 1661\nGirardi, L., Bressan, A., Bertelli, G., & Chiosi, C. 2000, A&AS, 141, 371\nGuillot, T., Santos, N. C., Pont, F., Iro, N., Melo, C., & Ribas, I. 2006, A&A, 453, L21\nHansen, B. M. S. & Barman, T. 2007, ApJ, 671, 861\nHartman, J. D., et al. 2009, ApJ, 706, 785\nHartman, J. D., et al. 2011, ApJ, 726, 52\nJenkins, J. M., Caldwell, D. A., & Borucki, W. J. 2002, ApJ, 564, 495\nJohnson, J. A., et al. 2008, ApJ, 686, 649\nLee, J. W., Youn, J.-H., Kim, S.-L., Lee, C.-U., & Koo, J.-R. 2011, PASJ, 63, 301\nLee, J. W., Youn, J.-H., Lee, C.-U., Kim, S.-L., & Koch, R. H. 2009, AJ, 138, 478\nPoddaný, S., Brát, L., & Pejcha, O. 2010, New Astron., 15, 297\nSafronov, V. S. 1972, Evolution of the Protoplanetary Cloud and Formation of the Earth and\nPlanets (Jerusalem: Israel Program for Scientific Translation)\n\n\f–8–\nSimpson, E. K., et al. 2011, AJ, 141, 8\nSouthworth, J. 2008, MNRAS, 386, 1644\nSouthworth, J. 2009, MNRAS, 394, 272\nSouthworth, J. 2010, MNRAS, 408, 1689\nSouthworth, J., Maxted, P. F. L., & Smalley, B. 2004a, MNRAS, 349, 547\nSouthworth, J., Maxted, P. F. L., & Smalley, B. 2004b, MNRAS, 351, 1277\nSouthworth, J., et al. 2009, MNRAS, 396, 1023\nTorres, G., Andersen, J., & Giménez, A. 2010, A&AR, 18, 67\n\nThis preprint was prepared with the AAS LATEX macros v5.2.\n\n\f–9–\n\n-0.01\n0.00\n0.01\n0.02\n0.03\n\nDifference magnitude ∆R\n\n0.04\n49.7\n\n49.8\n\n49.9\n\n65.76\n\n65.86\n\n65.96\n\n94.68\n\n94.78\n\n94.88\n\n-0.01\n0.00\n0.01\n0.02\n0.03\n0.04\n\n-0.01\n0.00\n0.01\n0.02\n0.03\n0.04\n\nBJD 2455600+\nFig. 1.- Transit light curves of HAT-P-12 observed between 2011 March and May.\n\n\f– 10 –\n\n1.00\n\nMar. 29\n\n0.98\n\nNormalized flux (R)\n\n0.96\n\nApr. 14\n0.94\n\nMay 13\n\n0.92\n\n0.90\n\n0.88\n\n0.86\n\n0.84\n-0.04\n\n-0.02\n\n0.00\n\n0.02\n\n0.04\n\nOrbital phase\nFig. 2.- Phased light curves of HAT-P-12. The continuous curves represent the solutions obtained\nwith the best-fit parameters listed in Table 3. The residuals from the fit are offset from zero and\nplotted at the bottom in the same order as the transit curves.\n\n\f– 11 –\n\n0.004\n\nHartman et al.\nETD\nLOAO\n\nO-Ctr (d)\n\n0.002\n\n0.000\n\n-0.002\n\n-0.004\n0\n\n100\n\n200\n\n300\n\n400\n\n500\n\nEpoch\nFig. 3.- (O − Ctr ) residuals for HAT-P-12b constructed with the transit ephemeris (1) newly\nderived in this work. The minimum times calculated from our transits are plotted using the filled\nsquares.\n\n\f– 12 –\n\n0.100\n\n0.095\n\nRA/a\n\n0.090\n\n0.085\n\n0.080\n\n0.075\n\n5000\n\n4800\n\n4600\n\n4400\n\nTemperature (K)\nFig. 4.- Isochrones from the BCAH models for log ages = 8.0 (bottom), 8.3, 8.7, 9.0, 9.3, 9.5, 9.6,\n9.7, 9.8, and 9.9 yr (top). The observed values of TA and rA (=RA /a) for HAT-P-12A are shown\ntogether with their error bars.\n\n\f– 13 –\n\n1.6\n\n0.1 ρJup\n\nW39b\n\nPlanet radius (RJup)\n\n1.2\n\nH19b\n\n0 ME\n\n0.25 ρJup\n\nW21b\n\nH18b\n\n0.5 ρJup\n\nH12b\nK9b\n\nK9c\n\nS\n\n0.8\n\nW29b\n\nK16b\n1.0 ρJup\n\n10 ME\nHD149026b\n\nC8b\n0.4\n\nU\nN\n\n25 ME\n0.1\n\n0.2\n\n0.3\n\n0.4\n\nPlanet mass (MJup)\nFig. 5.- Mass-radius diagram of Saturn-mass transiting planets. W=WASP, H=HAT, K=Kepler,\nC=CoRoT, and symbols S, N, and U mark the location of Saturn, Nepturn, and Uranus. Dotted\nlines are density contours for 0.1, 0.25, 0.5, and 1.0 ρJup . Overlaid are Fortney et al. (2007) models\ninterpolated to the solar equivalent semi-major axis of 0.0843 AU and the age of 3.2 Gyr for HATP-12b with core masses of 0, 10, and 25 M⊕ . Data are taken from http://exoplanet.eu/ except for\nour result for HAT-P-12b.\n\n\f– 14 –\n\nTable 1.\n\nObserving log of HAT-P-12.\n\nTransit\n\nUT Date\n\nObserving Interval\n(BJD+2,455,000)\n\nFilter\n\nBinning\nMode\n\nExposure\nTime (s)\n\nNobs\n\nWeather\nCondition\n\n1\n2\n3\n\n2011 03 29\n2011 04 14\n2011 05 13\n\n649.67−649.95\n665.74−665.97\n694.65−694.93\n\nRC\nRC\nRC\n\n2×2\n2×2\n2×2\n\n50−70\n50−70\n40−60\n\n224\n273\n314\n\nclear\npartly cloudy\nclear\n\nTable 2.\n\nRC -band photometry of HAT-P-12\n\nBJD\n\nDiff. Mag\n\nσMag\n\nRelative Flux\n\n2455649.67120\n2455649.67207\n2455649.67293\n2455649.67380\n2455649.67467\n2455649.67554\n2455649.67641\n2455649.67729\n2455649.67815\n2455649.67902\n\n+0.0005\n−0.0043\n−0.0004\n+0.0009\n+0.0019\n+0.0011\n+0.0011\n−0.0038\n−0.0001\n+0.0001\n\n0.0021\n0.0021\n0.0021\n0.0021\n0.0021\n0.0021\n0.0021\n0.0021\n0.0021\n0.0021\n\n0.9995\n1.0039\n1.0003\n0.9991\n0.9982\n0.9990\n0.9990\n1.0035\n1.0001\n0.9999\n\nNote. - This table is available in its entirety in a\nmachine-readable form in the online journal. A portion\nis shown here for guidance regarding its form and content.\n\n\f– 15 –\n\nTable 3.\n\nTransit parameters of HAT-P-12.\n\nParameter\n\nValue\n\nrA + rb\nk (=rb /rA )\ni (deg)\nuA\nvA\nT0 (BJD)a\nP (d)\nrA\nrb\nσ (mmag)b\nχ2red\n\n0.0969±0.0012\n0.1370±0.0019\n89.915±0.098\n0.739±0.069\n0.177 perturbed\n649.79751±0.00036\n3.213089±0.000037\n0.0852±0.0012\n0.01168±0.00005\n2.1269\n0.9920\n\nρA (ρ⊙ )\ngb (gJup )\nTeq (K)\na BJD\nb rms\n\n2.100±0.089\n0.257±0.014\n960±14\n\n2,455,000 is suppressed.\nscatter of residuals.\n\n\f– 16 –\n\nTable 4. Observed transit times of HAT-P-12.\nBJD\n(2,450,000+)\n\nUncertainty\n\nE\n\nO–Ctr\n\n4,187.85655b\n4,216.77265b\n4,869.02397b\n4,897.94225b\n4,952.56398\n4,965.41639\n4,965.41748\n4,984.69368\n5,312.42673\n5,630.51896\n5,646.58477\n5,646.58486\n5,649.79769\n5,659.43563\n5,665.86234\n5,675.49947\n5,694.78089\n5,704.42185\n\n±0.00020\n±0.00014\n±0.00017\n±0.00024\n±0.00080\n±0.00046\n±0.00090\n±0.00060\n±0.00032\n±0.00049\n±0.00059\n±0.00040\n±0.00020\n±0.00038\n±0.00031\n±0.00064\n±0.00024\n±0.00038\n\n0\n9\n212\n221\n238\n242\n242\n248\n350\n449\n454\n454\n455\n458\n460\n463\n469\n472\n\n0.00095\n−0.00049\n−0.00027\n0.00048\n0.00019\n0.00036\n0.00145\n−0.00070\n0.00027\n−0.00040\n0.00011\n0.00020\n−0.00003\n−0.00127\n−0.00068\n−0.00273\n0.00033\n0.00211\n\nReferencesa\n\nHartman et al. (2009)\nHartman et al. (2009)\nHartman et al. (2009)\nHartman et al. (2009)\nGregorio (AXA)\nKucakova (TRESCA)\nAyoimanitis (AXA)\nGary (AXA)\nVilagi & Gajdos (TRESCA)\nIvanov & Sokov (TRESCA)\nNicolas (TRESCA)\nGajdos & Vilagi (TRESCA)\nThis paper (LOAO)\nRuiz (TRESCA)\nThis paper (LOAO)\nZinoviev & Sokov (TRESCA)\nThis paper (LOAO)\nSalas (TRESCA)\n\na AXA\n\n(Amateur eXoplanet Archieve), TRESCA (TRansiting ExoplanetS and\nCAndidates).\nb Newly\n\ndetermined by us from the individual measurements.\n\n\f– 17 –\n\nTable 5. Physical properties of the HAT-P-12 system.\nParameter\n\nECPH Model\n\nBCAH Model\n\nKb (km s−1 )\nMA (M⊙ )\nRA (R⊙ )\nlog gA (cgs)\nLA (L⊙ )\nMbol,A (mag)\nMb (MJup )\nRb (RJup )\nρb (ρJup )\nΘ\na (AU)\nAge (Gyr)\n\n131.5±3.0\n0.757±0.038\n0.711±0.019\n4.613±0.032\n0.212±0.016\n6.434±0.080\n0.216±0.015\n0.949±0.022\n0.236±0.016\n0.0233±0.0020\n0.03887±0.00088\n\n129.7±1.5\n0.727±0.019\n0.702±0.013\n4.607±0.020\n0.206±0.013\n6.463±0.069\n0.210±0.012\n0.936±0.012\n0.240±0.012\n0.0236±0.0015\n0.03829±0.00046\n3.2±3.8\n\n\f"}