{"id": "http://arxiv.org/abs/0901.2281v1", "guidislink": true, "updated": "2009-01-15T15:24:18Z", "updated_parsed": [2009, 1, 15, 15, 24, 18, 3, 15, 0], "published": "2009-01-15T15:24:18Z", "published_parsed": [2009, 1, 15, 15, 24, 18, 3, 15, 0], "title": "Suppression of nuclear spin diffusion at a GaAs/AlGaAs interface\n  measured with a single quantum dot nano-probe", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0901.2882%2C0901.3362%2C0901.1722%2C0901.3082%2C0901.3199%2C0901.1621%2C0901.2495%2C0901.1238%2C0901.1926%2C0901.2348%2C0901.2912%2C0901.4122%2C0901.4555%2C0901.4369%2C0901.1060%2C0901.4861%2C0901.3295%2C0901.3904%2C0901.3059%2C0901.2599%2C0901.3114%2C0901.1851%2C0901.4596%2C0901.3716%2C0901.2596%2C0901.2590%2C0901.2725%2C0901.1928%2C0901.1611%2C0901.1027%2C0901.4783%2C0901.2257%2C0901.1942%2C0901.2674%2C0901.2281%2C0901.2838%2C0901.4954%2C0901.4712%2C0901.1619%2C0901.0922%2C0901.3923%2C0901.1749%2C0901.0901%2C0901.2398%2C0901.4751%2C0901.4748%2C0901.1234%2C0901.0122%2C0901.1780%2C0901.2886%2C0901.2370%2C0901.1320%2C0901.0069%2C0901.4151%2C0901.3639%2C0901.0834%2C0901.4967%2C0901.1340%2C0901.2350%2C0901.3558%2C0901.1680%2C0901.1139%2C0901.0006%2C0901.1787%2C0901.3365%2C0901.2299%2C0901.3654%2C0901.4112%2C0901.0654%2C0901.2224%2C0901.2314%2C0901.1158%2C0901.2616%2C0901.3881%2C0901.1069%2C0901.3096%2C0901.0608%2C0901.2207%2C0901.1981%2C0901.1750%2C0901.0890%2C0901.3602%2C0901.0550%2C0901.3855%2C0901.2690%2C0901.1004%2C0901.3094%2C0901.0341%2C0901.3886%2C0901.1832%2C0901.0493%2C0901.3850%2C0901.4423%2C0901.2931%2C0901.4439%2C0901.3191%2C0901.0826%2C0901.0935%2C0901.3312%2C0901.0195%2C0901.4639&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Suppression of nuclear spin diffusion at a GaAs/AlGaAs interface\n  measured with a single quantum dot nano-probe"}, "summary": "Nuclear spin polarization dynamics are measured in optically pumped\nindividual GaAs/AlGaAs interface quantum dots by detecting the time-dependence\nof the Overhauser shift in photoluminescence (PL) spectra. Long nuclear\npolarization decay times of ~ 1 minute have been found indicating inefficient\nnuclear spin diffusion from the GaAs dot into the surrounding AlGaAs matrix in\nexternally applied magnetic field. A spin diffusion coefficient two orders\nlower than that previously found in bulk GaAs is deduced.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0901.2882%2C0901.3362%2C0901.1722%2C0901.3082%2C0901.3199%2C0901.1621%2C0901.2495%2C0901.1238%2C0901.1926%2C0901.2348%2C0901.2912%2C0901.4122%2C0901.4555%2C0901.4369%2C0901.1060%2C0901.4861%2C0901.3295%2C0901.3904%2C0901.3059%2C0901.2599%2C0901.3114%2C0901.1851%2C0901.4596%2C0901.3716%2C0901.2596%2C0901.2590%2C0901.2725%2C0901.1928%2C0901.1611%2C0901.1027%2C0901.4783%2C0901.2257%2C0901.1942%2C0901.2674%2C0901.2281%2C0901.2838%2C0901.4954%2C0901.4712%2C0901.1619%2C0901.0922%2C0901.3923%2C0901.1749%2C0901.0901%2C0901.2398%2C0901.4751%2C0901.4748%2C0901.1234%2C0901.0122%2C0901.1780%2C0901.2886%2C0901.2370%2C0901.1320%2C0901.0069%2C0901.4151%2C0901.3639%2C0901.0834%2C0901.4967%2C0901.1340%2C0901.2350%2C0901.3558%2C0901.1680%2C0901.1139%2C0901.0006%2C0901.1787%2C0901.3365%2C0901.2299%2C0901.3654%2C0901.4112%2C0901.0654%2C0901.2224%2C0901.2314%2C0901.1158%2C0901.2616%2C0901.3881%2C0901.1069%2C0901.3096%2C0901.0608%2C0901.2207%2C0901.1981%2C0901.1750%2C0901.0890%2C0901.3602%2C0901.0550%2C0901.3855%2C0901.2690%2C0901.1004%2C0901.3094%2C0901.0341%2C0901.3886%2C0901.1832%2C0901.0493%2C0901.3850%2C0901.4423%2C0901.2931%2C0901.4439%2C0901.3191%2C0901.0826%2C0901.0935%2C0901.3312%2C0901.0195%2C0901.4639&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Nuclear spin polarization dynamics are measured in optically pumped\nindividual GaAs/AlGaAs interface quantum dots by detecting the time-dependence\nof the Overhauser shift in photoluminescence (PL) spectra. Long nuclear\npolarization decay times of ~ 1 minute have been found indicating inefficient\nnuclear spin diffusion from the GaAs dot into the surrounding AlGaAs matrix in\nexternally applied magnetic field. A spin diffusion coefficient two orders\nlower than that previously found in bulk GaAs is deduced."}, "authors": ["A. E. Nikolaenko", "E. A. Chekhovich", "M. N. Makhonin", "I. W. Drouzas", "A. B. Vankov", "J. Skiba-Szymanska", "M. S. Skolnick", "P. Senellart", "A. Lemaitre", "A. I. Tartakovskii"], "author_detail": {"name": "A. I. Tartakovskii"}, "author": "A. I. Tartakovskii", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevB.79.081303", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0901.2281v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0901.2281v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "5 pages, 3 figures, submitted to Phys Rev B", "arxiv_primary_category": {"term": "quant-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "quant-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0901.2281v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0901.2281v1", "journal_reference": "Phys. Rev. B 79, 081303 (2009) - Published February 27, 2009", "doi": "10.1103/PhysRevB.79.081303", "fulltext": "Suppression of nuclear spin diffusion at a GaAs/AlGaAs interface measured with a\nsingle quantum dot nano-probe\nA. E. Nikolaenko1, E. A. Chekhovich1 , M. N. Makhonin1 , I. W. Drouzas1 , A. B. Vankov1 ,\nJ. Skiba-Szymanska1, M. S. Skolnick1 , P. Senellart2 , A. Lemaı̂tre2, A. I. Tartakovskii1\n1\n\narXiv:0901.2281v1 [quant-ph] 15 Jan 2009\n\n2\n\nDepartment of Physics and Astronomy, University of Sheffield, S3 7RH,UK\nLaboratoire de Photonique et de Nanostructures, Route de Nozay, 91460 Marcoussis, France\n(Dated: November 10, 2018)\n\nNuclear spin polarization dynamics are measured in optically pumped individual GaAs/AlGaAs\ninterface quantum dots by detecting the time-dependence of the Overhauser shift in photoluminescence (PL) spectra. Long nuclear polarization decay times of ≈ 1 minute have been found\nindicating inefficient nuclear spin diffusion from the GaAs dot into the surrounding AlGaAs\nmatrix in externally applied magnetic field. A spin diffusion coefficient two orders lower than that\npreviously found in bulk GaAs is deduced.\n\nNuclear spin effects in semiconductors have attracted\nclose attention for several decades. Recently these phenomena came into focus in the field of single electron spin manipulation in semiconductor nano-structures\n[1, 2, 3, 4, 5]. The hyperfine interaction between the\nelectron and nuclear spins in such semiconductor structures [6, 7] can serve as a powerful tool for controlling spin properties of the localized electron. In particular, polarization of nuclear spins occurring in GaAsbased heterostructures under circularly polarized excitation causes local Overhauser fields up to several Tesla\n[8, 9, 10, 11, 12, 13, 14, 15, 16, 17], leading to marked\nsplittings of the electron spin states, and as a result, to\na significant modification of the electron spin coherence\nand life-time [1, 2, 3, 4, 5, 5, 18, 19, 20, 21]. In such conditions the nuclear spin dynamics on the dot sets the timescales for operations on the electron spin in a controlled\nmagnetic environment. The nuclear spin dynamics are\ninfluenced mainly by the hyperfine interaction with electron spins and also the dipole-dipole coupling between\nnuclei. In particular, the latter process leads to so-called\nnuclear spin diffusion [22, 26].\nIn this work we introduce a new approach to measurements of the nuclear spin diffusion in GaAs/AlGaAs heterostructures, the type of structures widely employed in\nelectron [1, 2, 5] and nuclear spin [23, 24] coherent control\nexperiments and quantum Hall effect measurements [25].\nThe Overhauser shift (OHS) of a single electron spin state\nin individual QDs, acts as an accurate local probe, which\nprovides a direct and quantitative measure of the degree\nof polarization of 104 -105 nuclear spins [4, 8, 9, 10]. In\nthis work we use such a nano-probe positioned in a monolayer fluctuation quantum dot to monitor the nuclear spin\ndiffusion at the interface of a GaAs quantum well (QWs)\nand an AlGaAs barrier. This provides important information on the nuclear spin dynamics on the nano-scale,\nremoving the effects of sample inhomogeneities typical\nfor macroscopic structures.\nWe find very slow nuclear polarization decay with characteristic times of ≈1 min in an individual interface QD\n\nin the regime of high magnetic fields. By employing a\n3D diffusion model, we obtain very good fits to the decay kinetics using a surprisingly low diffusion coefficient\nof ≈ 2 * 10−15 cm2 /s, two orders of magnitude lower than\nwas found for bulk GaAs by Paget [26]. We also report nuclear polarization rise times in the range of 0.5-5\ns dependent on optical pumping power, polarization of\nexcitation and the magnitude of the external magnetic\nfield.\nThe sample investigated contains a nominally 13monolayer GaAs quantum well (QW) embedded in\nAl0.33 Ga0.67 As barriers (see growth detail in Ref.[27]).\nInterface QDs are formed naturally by 1 monolayer QW\nwidth fluctuations. With the lateral dimensions on the\norder of 10-100 nm these potential fluctuations result in\nup to 15 meV change in the exciton energy sufficient for\nzero dimensional exciton localization at low temperatures\n[8, 9, 10, 27]. A 40/10/90 nm SiO2 /Ti/Al shadow mask\nwas deposited on the sample surface, with 800 nm diameter apertures opened for optical access to individual dots. The nuclear spin dynamics were measured at\na temperature T =4.2 K with magnetic field of several\nTesla applied in the Faraday geometry [28]. PL was detected with a double spectrometer and a CCD. A laser at\n670 nm was employed to generate electrons and holes in\nthe QW states ≈130 meV above the QDs emission lines:\nabsorption in the AlGaAs barriers at this wavelength is\nnegligible.\nFig.1a shows unpolarized PL spectra measured for an\nindividual GaAs/AlGaAs dot in an external magnetic\nfield Bz =2 T for excitation with σ + and σ − circularly\npolarized light (red and blue lines, respectively). These\npeaks correspond to recombination of a neutral exciton\nlocalized in the dot. The observed doublet is due to\nthe exciton Zeeman splitting modified by the Overhauser\nshift of the electron spin states. The collective effect\nof the hyperfine interaction of the nuclear spins in the\nQD with the photo-generated electron can be treated as\nan additional magnetic field BN [6, 7], that builds up\ndynamically under circularly polarized optical excitation\n\n\f2\n\nPhoton energy (eV)\n\nOHS (μeV)\n\n40\n\n1.7100\n\n1.7102\n\n(a)\n\nB=2 T\n\nexc σ-\n\nexc σ+\n\n(b)\nexc σ+\n\n20\n\n30\n\nOHS (μeV)\n\nPL Intensity\n\n1.7098\n\n5 μW, 0.4 s\n1 μW, 1.3 s\n0.35 μW, 3.4 s\n\nexc σ+\n\n20\n\n10\n\nTime\nCCD\nshutter\n\n0\n\nErase (π) Pump (σ)\n\n-20\n\n0\n\nexc σ-\n\n0.01\n\n-40\n\n0.01\n\n0.1\n\n1\n\nOptical Power (μW)\nFIG. 1: (color online). (a) Thin (thick) line shows a lowtemperature PL spectrum of a single GaAs/AlGaAs dot excited with σ + (σ − ) pump in external magnetic field of 2T. (b)\nPower dependences of the exciton Zeeman splitting for excitation with σ + (circles) and σ − (squares) polarizations. Arrows\nshow the direction in which the power was scanned.\n\n[7]. BN will act together with the external magnetic field\nBz resulting in a spectral doublet (as seen in Fig.1a) with\na splitting ∆E(σ ± )=μB [|gh |Bz − |ge |(Bz ∓ BN )] dependent on the polarization of excitation. Here ge(h) is the\nelectron (hole) g-factor and μB is the Bohr magneton.\nIn the rest of this work we use ∆E to probe nuclear spin\npolarization on the dot.\nFig.1b shows the dependences of the OHS on excitation power for σ + and σ − polarized excitation. Qualitatively different dependences are observed in the two\ncases: a strong threshold-like BN switching and large\nhysteresis loop is observed for σ + excitation, whereas\na smooth curve with very weak hysteresis is measured\nin the σ − case. The marked difference originates from\nfeedback of the optically induced Overhauser field on the\ndot on the electron-to-nuclei spin transfer efficiency occurring due to the dependence of the electron Zeeman\nsplitting (the major energy cost of the electron-nuclear\nspin flip-flop) on both Bz and BN [7, 11, 13, 14, 15].\nThe additional electron spin state splitting produced by\nBN either enhances the spin transfer when the electron\nZeeman splitting EeZ (σ ± ) = μB ge (Bz ∓ BN ) is reduced\n(for σ + ) or lead to inefficient spin pumping when EeZ is\nincreased (for σ − ). The strong feedback in the case of σ +\nexcitation leads to the clear bistable behavior in Fig.1b\n\n0.1\n\n1\n\n10\n\n100\n\nTime (s)\nFIG. 2: (color online). Nuclear polarization built-up dynamics in a GaAs/AlGaAs interface QD measured in experiment\nschematically showed in the diagram. The curves are obtained\nfor the excitation power of 5 μW (circles), 1 μW (triangles)\nand 0.35 μW (squares) of σ + pump. The times shown are\nthe results of a single exponent fitting (solid curves) of the\nexperimental data.\n\n[14, 15, 17, 21].\nNote, that saturation of the OHS at an absolute\nvalue of 38 μeV is observed at high power for both\npolarizations. The maximum OHS of ≈38μeV corresponds to a nuclear polarization degree of ≈ 29%, as\ndeduced from the maximum OHS in a fully polarized dot\nof δn100% =IGa AGa + IAs AAs =132 μeV. Here AGa =42\nμeV and AAs =46 μeV are the hyperfine constants and\nIGa =IAs =3/2 are the spins of Ga and As nuclei [26].\nIn this work the nuclear spin life-time is measured employing an all-optical pump-probe method, where the effect of the strong pump is tested after a time-delay with\na weak probe. In order to identify the appropriate length\nand optical power of the probe so that it does not perturb\nthe system, the nuclear polarization rise time is firstly\nmeasured. This is reported in Fig.2 for a single optically\npumped GaAs/AlGaAs dot in an external magnetic field\nBext of 2 T. The optical pulse sequence for this measurement is schematically shown in the inset of Fig.2. The\npulses from two lasers are prepared by fast mechanical\nshutters with a rise time <2 ms. The first laser pulse\n(denoted as 'erase') is 10 s long and has linear polarization. This pulse is required for destruction of any nuclear\npolarization in the dot and surrounding QW remaining\nfrom the previous measurement cycle. Nuclear polariza-\n\n\f3\ntion is then pumped by the second circularly polarized\n'pump' pulse of variable length. A mechanical shutter\nplaced in the PL detection path allows PL signal acquisition in a narrow time window at the end of the pump\npulse. The time resolution of the dynamics measurement\nis determined by the time this shutter is open. For the\nshortest delay times the resolution was as low as 5 ms.\nIn order to improve signal to noise ratio in the PL spectra measured for each delay, sequences of the erase and\npump laser pulses and the PL acquisition were repeated\nseveral times for each spectrum measured. The degree of\nnuclear polarization for each delay was determined from\nthe modification of the exciton Zeeman splitting due to\nthe OHS.\nWe find a strong dependence of the nuclear spin rise\ntime on the pumping power. Fig.2 shows evolution of\nthe OHS with time under the σ + polarized pumping\nmeasured with different optical excitation powers. The\nmeasured dynamics curves in Fig.2 can be well approximated with exponential fits with rise times of 0.4, 1.3,\nand 3.4 s for excitation power of 5, 1 and 0.35 μW, respectively [29]. These findings can be explained by the powerdependent supply rate of the spin polarized electrons to\nthe dot: faster nuclear spin pumping occurs when the\nspin supply rate is increased at a higher excitation power\n[15? ].\nIn order to investigate the nuclear polarization decay\nthe pulse sequence was modified into a 'pump-probe' configuration schematically shown in the inset of Fig.3. Nuclear polarization is pumped by a 10 s long circularly\npolarized pump pulse. Then a short linearly polarized\npulse is applied at a variable delay after the end of the\npump pulse to probe the exciton Zeeman splitting. Based\non the measured nuclear polarization built-up dynamics\nshown in Fig.2 we set the length of the probe pulse to\n100 ms to minimize its effect on the nuclear polarization\nin the dot. In the time period between the two pulses\nthe sample is kept in the dark. The CCD shutter is open\nduring the probe pulse only. In order to improve signal to\nnoise ratio several pump-probe measurement cycles are\nperformed with no dark time between the cycles as the\ndot is polarized to saturation by the long pump pulse\nindependently on the initial polarization.\nFig.3 shows the nuclear spin decay dynamics measured\nat Bext =2T. The exciton Zeeman splitting is plotted as\na function of the 'dark' delay time between the pump\nand probe pulses. As seen from the figure decay for both\npolarizations of the pump occurs with a characteristic\ntime of ≈1 min.\nThe most likely mechanisms for the nuclear spin depolarization \"detected\" by the QD nano-probe is nuclear spin diffusion into the unpolarized barrier. Two\nother mechanisms that could contribute are depolarization due to interaction with an electron gas in the QW\nand phonon-assisted spin-lattice relaxation. The relaxation via interaction with residual electrons can be ex-\n\ncluded since the sample is nominally undoped and no\nevidence for charging in either the QW or dots is found\nin PL. The quadrupolar relaxation via phonon-assisted\nprocesses is rather weak for temperatures below 30K [30]\nleading to characteristic decay times of the order of 1000\ns in GaAs. On the other hand, the nuclear polarization\nin the extremely small volume of the dot is very sensitive\nto the spin \"leakage\" into the surrounding bulk. In what\nfollows we will focus on this decay mechanism.\nDecay of the nuclear polarization SN due to diffusion\ncan be described with a standard 3D diffusion equation\ndSN (r, t)/dt = DQD ∆SN (r, t),\n\n(1)\n\nwhere DQD is the nuclear spin diffusion coefficient. In our\nmodeling we approximate the dot shape with a 5 nm high\ndisk with a 20 nm diameter and assume that the nuclear\nspin is pumped optically inside the dot volume, whereas\nthe material around the dot is not polarized directly by\noptical excitation. This description is an approximation\nof the actual nuclear spin pumping process. In a more\ncomplex model, spatially non-uniform optical pumping of\nthe nuclear spin in the whole two-dimensional sheet of the\nQW should be taken into account. From our calculations\nwe find, however, that the low aspect ratio of the model\ndot effectively leads to a one-dimensional spin diffusion\nprocess, rather insensitive to the nuclear polarization in\nadjacent parts of the well. In what follows we assume\nthat the nuclei outside the dot are polarized only via\nspin diffusion from the dot.\nInitially, at the beginning of the pumping pulse, the\ndot and surrounding material are not polarized. We first\ncalculate the distribution of the nuclear spin due to the\ndiffusion from the dot in the first 10 seconds during the\noptical pulse. For this we assume an instantaneous increase of the polarization inside the dot, which is kept\nconstant for the duration of the pumping pulse. Using\nthis distribution as the initial condition (the high polarization in the dot and the decreasing polarization away\nfrom the dot in the bulk), we then simulate the timeevolution of the nuclear spin polarization on the dot in\nthe dark by allowing the polarization inside the dot to\ndecay with time.\nThe only fitting parameter that we vary in our model\nis the diffusion coefficient DQD . Solid curves in Fig.3\nshow the results obtained for three different diffusion\ncoefficients. The thin black line shows the decay with\nDQD = 10−13 cm2 /s found by Paget in Ref.[26] for bulk\nGaAs. Our calculations predict that for this value of diffusion coefficient the spin polarization on the dot falls to\n30% level after 5 second, about 12 times faster than found\nin our experiment on GaAs/AlGaAs dots. The thick\nblack line providing an excellent fit to our data shows results for a very low magnitude of DQD = 2 * 10−15 cm2 /s.\nThis is about 20 times smaller than that we recently\nfound for InGaAs/GaAs dots [17] and 50 times smaller\nthan in bulk GaAs [26]. To exclude a scenario where the\n\n\f4\n\n-15\n\n2\n\n2x10 cm /s\n-12\n2\n10 cm /s\n-13\n2\n10 cm /s\n\nOHS (μeV)\n\n20\n\n0\n\nσ+\nCCD\nshutter\nPump (σ)\n\nTime\n\nProbe (π)\n\nσ-\n\n-20\n\nB=2T\n0.1\n\n1\n\n10\n\n100 1000\n\nTime (s)\nFIG. 3: (color online). Nuclear polarization decay curves\nmeasured for GaAs/AlGaAs interface QDs for two polarizations of the pump pulse in external magnetic field of 2T (circles). Lines show polarization decay curves calculated using\nEq.1 with DQD = 2 * 10−15 cm2 /s (thik black), 10−13 cm2 /s\n(thin black) and 10−12 cm2 /s (gray).\n\nvolume around the dot is polarized by a very fast diffusion during the 10 s pumping time, which then would\nprevent further spin leakage from the dot, we also show\nresults for a high magnitude of DQD = 10−12 cm2 /s (gray\nline in Fig.3). As can be seen, an even faster decay of\nnuclear spin on the dot is observed in that case with the\ndecay time of 1 s. We thus conclude that in the regime\nof high magnetic field in this work the nuclear spin diffusion in the studied GaAs/Al0.3 Ga0.7 As heterostructure\nis strongly suppressed [28].\nIn magnetic field due to a non-zero nuclear Zeeman\nsplitting the spin diffusion can only occur via transfer of\nspin between the like isotope species, since different isotopes exhibit differing energy splittings. Since the optical\npumping in our experiment occurs only in the GaAs QW,\nwe suggest that the slowing of the nuclear diffusion occurs in AlGaAs or at the GaAs/AlGaAs interface. There\nthe dipole-dipole interaction between the Ga spins (the\nmechanism underlying the diffusion) is weakened due to a\nlarger distance between the like nuclei. The considerably\nmore efficient spin leakage in the InGaAs/GaAs system\nprobably occurs due to the efficient diffusion of the spins\nof Ga and As nuclei into GaAs around the dot.\nIn summary, we have measured nuclear polarization\ndynamics in a single interface GaAs/Al0.3 Ga0.7 As QDs\n\nunder non-resonant circularly polarized optical excitation. The rise time is found to be sensitive to the excitation power and external magnetic field and varies in\nthe range of ≈ 0.4 ÷ 5 seconds. A very slow rate of\nthe nuclear polarization decay has been measured with\na characteristic depolarization time exceeding 1 min in\nmagnetic field of several Tesla. This indicates suppression of the nuclear spin diffusion from the GaAs dot into\nthe AlGaAs barrier. We find an almost 2 orders of magnitude smaller diffusion coefficient compared to bulk GaAs\nand InGaAs dots reported recently. This observation can\nbe explained by the increased distance at the interface of\nthe dot and in the barrier between the like nuclear species\ncontributing to the flip-flop-like diffusion process in the\nexternal magnetic field. The increased separation leads\nto a notable weakening of the dipole-dipole interaction\nand, consequently, to a slower nuclear spin decay in a\nGaAs/AlGaAs dot.\nThis work has been supported by EPSRC grants\nEP/C54563X/1 and EP/C545648/1, Programme Grant\nGR/S76076, Programme Grant EP/G601642/1, the EPSRC IRC for Quantum Information Processing, and by\nthe Royal Society.\n\n[1] J. R. Petta et al., Science 309, 2180 (2005).\n[2] F. H. L. Koppens et al., Science 309, 1346, (2005).\n[3] M. Atatre, J. Dreiser, A. Badolato, A. Hgele, K. Karrai,\nA. Imamoglu, Science312, 551 (2006).\n[4] M. V. Gurudev Dutt, J. Cheng, Bo Li, X. Xu, X. Li, P.\nR. Berman, D. G. Steel, A. S. Bracker, D. Gammon, S.\nE. Economou, Ren-Bao Liu, L. J. Sham, Phys. Rev. Lett.\n94, 227403 (2005).\n[5] D. J. Reilly, J. M. Taylor, J. R. Petta, C. M. Marcus, M.\nP. Hanson, A. C. Gossard, Science 321, 817 (2008).\n[6] A. W. Overhauser, Phys. Rev.92, 411 (1953).\n[7] Optical Orientation, edited by F. Meier and B. P. Zakarchenya (Elsevier, New York, 1984).\n[8] D. Gammon, S. W. Brown, E. S. Snow, T. A. Kennedy,\nD. S. Katzer, and D. Park, Science 277, 85 (1997).\n[9] D. Gammon, A. L. Efros, T. A. Kennedy, M. Rosen, D.\nS. Katzer, D. Park, S. W. Brown, V. L. Korenev, and I.\nA. Merkulov, Phys. Rev. Lett. 86, 5176 (2001).\n[10] A. S. Bracker, E. A. Stinaff, D. Gammon, M. E. Ware,\nJ. G. Tischler, A. Shabaev, Al. L. Efros, D. Park, D.\nGershoni, V. L. Korenev, and I. A. Merkulov, Phys. Rev.\nLett. 94, 047402 (2005).\n[11] B. Eble, O. Krebs, A. Lemaitre, K. Kowalik, A. Kudelski,\nP. Voisin, B. Urbaszek, X. Marie, and T. Amand, Phys.\nRev. B 74, 081306(R) (2006).\n[12] C. W. Lai, P. Maletinsky, A. Badolato, and A. Imamoglu,\nPhys. Rev. Lett. 96, 167403 (2006).\n[13] P.-F. Braun, B. Urbaszek, T. Amand, X. Marie, O.\nKrebs, B. Eble, A. Lemaitre, and P. Voisin, Phys. Rev.\nB 74, 245306 (2006).\n[14] P. Maletinsky, C. W. Lai, A. Badolato, and A. Imamoglu,\nPhys. Rev. B 75, 035409 (2007).\n[15] A. I. Tartakovskii, T. Wright, A. Russell, V. I. Falko,\n\n\f5\n\n[16]\n[17]\n\n[18]\n[19]\n[20]\n[21]\n\nA. B. Vankov, J. Skiba-Szymanska, I. Drouzas, R. S.\nKolodka, M. S. Skolnick, P.W. Fry, A. Tahraoui, H.Y. Liu, and M. Hopkinson, Phys. Rev. Lett. 98, 026806\n(2007).\nP. Maletinsky, A. Badolato, and A. Imamoglu, Phys.\nRev. Lett. 99, 056804 (2007).\nM. N. Makhonin, A. I. Tartakovskii, A. B. Van'kov, I.\nDrouzas, T. Wright, J. Skiba-Szymanska, A. Russell, V.\nI. Fal'ko, M. S. Skolnick, H.-Y. Liu, and M. Hopkinson,\nPhys. Rev. B 77, 125307 (2008).\nA. V. Khaetskii, D. Loss, L. Glazman, Phys. Rev.\nLett.88, 186802 (2002).\nS. I. Erlingsson, Y. V. Nazarov, V. I. Fal'ko, Phys. Rev.\nB 64, 195306 (2001).\nI. A. Merkulov, Al. L. Efros, and M. Rosen, Phys. Rev.\nB 65, 205309 (2002).\nP.-F. Braun, X. Marie, L. Lombez, B. Urbaszek, T.\nAmand, P. Renucci, V. K. Kalevich, K. V. Kavokin, O.\nKrebs, P. Voisin, and Y. Masumoto, Phys. Rev. Lett. 94,\n\n116601 (2005).\n[22] N. Bloembergen, Physica (Utrecht) 15, 386 (1949).\n[23] H. Sanada, Y. Kondo, S. Matsuzaka, K. Morita, C.Y. Hu,\nY. Ohno, H. Ohno, Phys. Rev. Lett. 96, 067602 (2006).\n[24] G. Yusa, K. Muraki, K. Takashina, K. Hashimoto, Y.\nHirayama, Nature 434 1001 (2005).\n[25] J. H. Smet, R. A. Deutschmann, F. Ertl, W. Wegscheider,\nG. Abstreiter, K. von Klitzing, Nature 415 281 (2002).\n[26] D. Paget, Phys. Rev. B 25, 4444 (1982).\n[27] E. Peter et al, Phys. Rev. Lett. 95, 067401 (2005).\n[28] Negligible nuclear spin pumping is observed in magnetic\nfields below 20 mT, indicating efficient depolarization due\nto dipole-dipole interaction.\n[29] Similar rise times have been observed in GaAs/AlGaAs\ndots grown by droplet epitaxy in T. Belhadj et al, Phys.\nRev. B 78, 205325 (2008).\n[30] J. A. McNeil, W. G. Clark, Phys. Rev. B 13, 4705 (1976).\n\n\f"}