{"id": "http://arxiv.org/abs/0911.1995v1", "guidislink": true, "updated": "2009-11-10T21:39:40Z", "updated_parsed": [2009, 11, 10, 21, 39, 40, 1, 314, 0], "published": "2009-11-10T21:39:40Z", "published_parsed": [2009, 11, 10, 21, 39, 40, 1, 314, 0], "title": "Enslaved Phase-Separation Fronts and Liesegang Pattern Formation", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0911.2690%2C0911.0613%2C0911.3468%2C0911.1769%2C0911.5715%2C0911.2066%2C0911.4020%2C0911.5238%2C0911.0075%2C0911.4266%2C0911.1150%2C0911.4147%2C0911.5648%2C0911.5528%2C0911.3045%2C0911.4802%2C0911.5504%2C0911.4349%2C0911.3552%2C0911.4070%2C0911.0596%2C0911.1522%2C0911.5514%2C0911.2064%2C0911.4600%2C0911.2038%2C0911.3760%2C0911.1138%2C0911.1995%2C0911.0134%2C0911.3565%2C0911.1710%2C0911.0009%2C0911.4199%2C0911.4232%2C0911.3167%2C0911.2466%2C0911.5412%2C0911.1017%2C0911.3131%2C0911.5404%2C0911.2554%2C0911.5473%2C0911.3876%2C0911.4339%2C0911.3076%2C0911.0428%2C0911.1047%2C0911.4915%2C0911.0880%2C0911.2510%2C0911.4898%2C0911.1382%2C0911.3809%2C0911.5677%2C0911.4447%2C0911.5113%2C0911.3028%2C0911.4961%2C0911.0634%2C0911.3661%2C0911.0011%2C0911.3478%2C0911.0829%2C0911.1093%2C0911.1226%2C0911.4116%2C0911.0996%2C0911.4697%2C0911.2675%2C0911.1447%2C0911.2247%2C0911.5041%2C0911.0927%2C0911.2502%2C0911.0054%2C0911.0358%2C0911.2205%2C0911.4207%2C0911.5262%2C0911.4336%2C0911.4795%2C0911.1156%2C0911.1907%2C0911.1662%2C0911.3368%2C0911.3389%2C0911.4797%2C0911.2672%2C0911.3489%2C0911.3477%2C0911.3262%2C0911.1990%2C0911.4590%2C0911.0339%2C0911.2745%2C0911.0812%2C0911.4698%2C0911.2956%2C0911.1223%2C0911.4511&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Enslaved Phase-Separation Fronts and Liesegang Pattern Formation"}, "summary": "We show that an enslaved phase-separation front moving with diffusive speeds\nU = C T^(-1/2) can leave alternating domains of increasing size in their wake.\nWe find the size and spacing of these domains is identical to Liesegang\npatterns. For equal composition of the components we are able to predict the\nexact form of the pattern analytically. We also show that there is a critical\nvalue for C below which only two domains are formed. Our analytical predictions\nare verified by numerical simulations using a lattice Boltzmann method.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0911.2690%2C0911.0613%2C0911.3468%2C0911.1769%2C0911.5715%2C0911.2066%2C0911.4020%2C0911.5238%2C0911.0075%2C0911.4266%2C0911.1150%2C0911.4147%2C0911.5648%2C0911.5528%2C0911.3045%2C0911.4802%2C0911.5504%2C0911.4349%2C0911.3552%2C0911.4070%2C0911.0596%2C0911.1522%2C0911.5514%2C0911.2064%2C0911.4600%2C0911.2038%2C0911.3760%2C0911.1138%2C0911.1995%2C0911.0134%2C0911.3565%2C0911.1710%2C0911.0009%2C0911.4199%2C0911.4232%2C0911.3167%2C0911.2466%2C0911.5412%2C0911.1017%2C0911.3131%2C0911.5404%2C0911.2554%2C0911.5473%2C0911.3876%2C0911.4339%2C0911.3076%2C0911.0428%2C0911.1047%2C0911.4915%2C0911.0880%2C0911.2510%2C0911.4898%2C0911.1382%2C0911.3809%2C0911.5677%2C0911.4447%2C0911.5113%2C0911.3028%2C0911.4961%2C0911.0634%2C0911.3661%2C0911.0011%2C0911.3478%2C0911.0829%2C0911.1093%2C0911.1226%2C0911.4116%2C0911.0996%2C0911.4697%2C0911.2675%2C0911.1447%2C0911.2247%2C0911.5041%2C0911.0927%2C0911.2502%2C0911.0054%2C0911.0358%2C0911.2205%2C0911.4207%2C0911.5262%2C0911.4336%2C0911.4795%2C0911.1156%2C0911.1907%2C0911.1662%2C0911.3368%2C0911.3389%2C0911.4797%2C0911.2672%2C0911.3489%2C0911.3477%2C0911.3262%2C0911.1990%2C0911.4590%2C0911.0339%2C0911.2745%2C0911.0812%2C0911.4698%2C0911.2956%2C0911.1223%2C0911.4511&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We show that an enslaved phase-separation front moving with diffusive speeds\nU = C T^(-1/2) can leave alternating domains of increasing size in their wake.\nWe find the size and spacing of these domains is identical to Liesegang\npatterns. For equal composition of the components we are able to predict the\nexact form of the pattern analytically. We also show that there is a critical\nvalue for C below which only two domains are formed. Our analytical predictions\nare verified by numerical simulations using a lattice Boltzmann method."}, "authors": ["E. M. Foard", "A. J. Wagner"], "author_detail": {"name": "A. J. Wagner"}, "author": "A. J. Wagner", "links": [{"href": "http://arxiv.org/abs/0911.1995v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0911.1995v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "cond-mat.soft", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.soft", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0911.1995v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0911.1995v1", "arxiv_comment": null, "journal_reference": null, "doi": null, "fulltext": "arXiv:0911.1995v1 [cond-mat.soft] 10 Nov 2009\n\nEnslaved Phase-Separation Fronts and Liesegang Pattern Formation\nE.M. Foard∗ , and A.J. Wagner\nDepartment of Physics, North Dakota State University, Fargo, ND 58105\n\nAbstract. We show\nthat an enslaved phase-separation front moving with diffusive\n√\nspeeds U = C/ T can leave alternating domains of increasing size in their wake. We\nfind the size and spacing of these domains is identical to Liesegang patterns. For equal\ncomposition of the components we are able to predict the exact form of the pattern\nanalytically. We also show that there is a critical value for C below which only two\ndomains are formed. Our analytical predictions are verified by numerical simulations\nusing a lattice Boltzmann method.\n\n1 Introduction to Liesegang Patterns\nThe formation of highly ordered patterns in naturally occurring biological, chemical, and\nmineralogical systems has long been a subject of intense interest. The study of such pattern formation can sometimes allow deep insight into their underlying natural phenomena. In a previous paper we analyzed the dynamics of pattern formation behind a onedimensional, slow moving (enslaved), phase-separation front. Our analysis concerned\nfronts moving with constant speed, and the pattern formed was a series of alternating\nbands of regular width and spacing [4]. We show here that a front moving with diffusive\nspeed will form a more complex Liesegang pattern.\nIt was with the motivation of understanding pattern formation in simple systems that,\njust over one hundred years ago, R. E. Liesegang observed a highly ordered pattern of\nconcentric rings precipitating around a drop of silver nitrate on a glass slide with a thin\ngel coating containing potassium dichromate [8]. These concentric rings are now known\nas Liesegang rings. The radial width and spacing of the rings increases with increasing distance from the center. Rings close to the center are narrow and tightly packed.\nRings far from the center are wide and far apart. The pattern forms from the center outwards, and is stationary once visible. Several alternatives to silver nitrate and potassium\ndichromate in the production of Liesegang rings have been used in the literature. In general, some electrolytes A and B combine to form an insoluble precipitate D which then\n∗ Corresponding author. Email addresses: eric.foard@nds.edu (E.M. Foard), alexander.wagner@ndsu.edu\n(A.J. Wagner)\n\nhttp://www.global-sci.com/\n\nGlobal Science Preprint\n\n\f2\n\nproduces Liesegang patterns. Most recent publications use linear Liesegang patterns of\nbands and gaps which are produced by adding the A electrolyte to a test-tube containing\nthe B electrolyte suspended in gel [9].\nTo characterize Liesegang bands or rings, they are typically numbered from the first\nformed to the last formed, the nth appearing at time tn at position xn with a width wn .\nRepeated careful measurements of Liesegang patterns revealed that discrete, defect-free\nbands could be characterized by a set of empirical laws [6]. They are\n√\n(1.1)\nTime Law\nxn ∝ tn ,\nSpacing Law\nWidth Law\n\nxn+1 /xn = 1 + p ,\n\n(1.2)\n\nxn ∝ w n .\n\n(1.3)\n\nThe time law relates the position of the nth band with the time of its appearance. The\nlocation of subsequent bands is given by the spacing law, where p > 0 is the spacing coefficient. The width law states that the band width is proportional to the position of the band,\nwhich is a natural result of the spacing law with the assumptions of mass conservation\nand uniform concentration of precipitate bands [7]. These laws are only considered valid\nfor large n. Much attention has been paid to the phenomenological Matalon-Packter law\np = F ( B0 )+ G ( B0 )/A0 , which relates p to the initial concentrations A0 and B0 of the A and\nB electrolytes [2]. F ( B0 ) and G ( B0 ) are known to be decreasing functions of B0 , though\nnot much else about them is known. Antal et al. [2] show that the Matalon-Packter law\ncan be derived in limiting cases from more general expressions.\nSoon after their characterization, study into the nature and cause of Liesegang patterns was prolific. For instance, a paper by Stern in 1954 makes mention of more than\nsix hundred papers having been published on the subject by that time [10]. There were\nmany early attempts to develop a comprehensive model of Liesegang pattern formation.\nHowever, it proved difficult to account for the wide variety and complexity of possible\npatterns, and many early models were eliminated by additional experiments. The complexity of Liesegang pattern formation thwarted theoretical understanding, and progress\nslowed. More than a century later there is currently still no generally accepted comprehensive mechanism for Liesegang pattern formation.\nCurrent dominating theories of Liesegang pattern formation can be categorized as\neither an ion-product supersaturation theory where electrolytes combine directly into the\nprecipitate (A + B → D), or a nucleation and growth theory where one or more intermediate\ncompounds form before final precipitation (A + B → C → D). A brief discussion of these\nmodels is given in the recent paper by Jahnke and Kantelhardt [7].\nFor either of these theories, precipitation occurs behind a reaction front formed by\nthe A electrolyte diffusing into the B electrolyte. Since the initial concentration (A0 ) of\nA in the drop is typically an order of magnitude higher than the concentration (B0 ) of\nB in the gel, the time dependent concentration profile A( x,t) of A electrolyte in the gel\nforms a reaction front which resembles the familiar heat-diffusion profile moving with\nspeed ur ∝ t−1/2 [2]. Coincident with, or trailing behind this reaction front is a precipitation front, moving at a speed u p ∝ t−1/2 , which produces the banded pattern. The precise\n\n\f3\n\nrelationship of the precipitation front to the reaction front depends on the specific chemical and physical mechanism of Liesegang pattern formation which are still not entirely\nunderstood.\nThe recent trend for publications on Liesegang patterns shows a re-surging interest. A search of the ISI Web of Science Internet database for publications on the topic\n\"Liesegang\" shows an increase in papers since a fall in the early second half of the 20th\ncentury. We found only 8 papers from 1970 to 1979, 35 from 1980 to 1989, 107 from 1990\nto 1999, and 178 since 2000. Much of the recent research into Liesegang pattern formation has focused on the moving front by employing a variety of numerical techniques\nto simulate models of precipitation fronts. Some examples are the reaction-diffusion cellular automata simulations by Chopard et al. [3], direct simulation of a model-B system\nwith a chemical reaction like source term by Antal et al. [1] and Rácz [9], the discrete\nstochastic simulation which used random walkers to model the diffusion front by Izsák\nand Lagzi [5], as well as the lattice gas simulation by Jahnke and Kantelhardt [7].\nIn this paper we show that patterns identical to Liesegang patterns can be formed in\na much simpler physical system. We consider a binary mixture that can phase-separate if\na control parameter crosses a critical value. In this system an enslaved phase-separation\nmoves at a speed of u = ct−1/2 . An example of such a system would be a binary mixture\nthat is cooled below its critical temperature from one end. This situation is somewhat\nsimilar to that of the electrolytes, where material is formed at the front and will subsequently phase separate. However the details are quite different, most notably in the\nnucleation conditions.\nIt should be noted that this model is somewhat similar to the Model-B precipitation\nfront proposed by Antal et al. [1], but there are several key differences. Their model\nhas a moving, Gaussian shaped source of A-type material designed to mimic the product of a chemical reaction front. Their source moves through a region which is phaseseparated into an equilibrium B -type. When the concentration of A-type material in a\ngiven area reaches the spinodal value, an A-type domain nucleates and depletes the surrounding region of its A-type material. The source moves on, leaving stable domains.\nThe speed, width, and concentration of their source are free parameters of their model.\nOur model has an abrupt control parameter front which induces phase-separation as it\npasses through a mixed material, the mechanism for nucleation of new domains is quite\ndifferent. Notably switching does not occur at the spinodal value for reasons explained\nin [4]. Also the analysis of Antal et al. is numerical in nature. Our model has only one\nparameter and can be solved analytically.\nTo allow for an analytical treatment we make the simplifying assumption of an abrupt\nfront. We expect that the results will be qualitatively similar to those for an extended\ncontrol parameter front. In practice, an abrupt front could be experimentally achieved by\nimmersing a thin sample with a prescribed speed u ∝ t−1/2 into a temperature bath.\nThe key result is that we are able to analytically determine the resulting patterns and\nwe show that they obey the Liesegang laws given by Equations (1.1), (1.2) and (1.3). We\nderive an analytical expression for the spacing coefficient p in terms of the free parame-\n\n\f4\n\nters of this model. We verify these theoretical predictions by direct numerical simulations\nusing a lattice Boltzmann method.\n\n2 A Model for Liesegang Patterns Formed by Enslaved Phase\nSeparation Fronts\nWe consider two materials, an A-type and a B -type, in an incompressible mixture such\nthat the total density ρ = ρA ( x,t)+ ρB ( x,t) remains constant. The relevant variable is then\nthe relative concentration of A to B -type material defined as\nφ( x,t) =\n\nρA ( x,t)− ρB ( x,t)\n.\nρ\n\n(2.1)\n\nFrom here on the time and position dependence of the concentration will be implied. For\nsimplicity we assume that the two materials have the mixing free energy described by a\nφ4 law\n\u0014\n\u0015\nZ\na( x,t) 2 b( x,t) 4 κ ( x,t)\n2\nφ +\nφ +\n(∇φ) .\nF = dx\n(2.2)\n2\n4\n2\nThe time and position dependence of the control parameters (a, b and κ) are such that they\nconstitute a spatially abrupt transition from the mixing region to the phase-separating\nregion of the phase diagram. For example:\n\u0014Z\n\u0015\na( x,t) = aS +( a M − aS )Θ\nudt + x0 ,\n(2.3)\nwhere Θ is the Heaviside step function, and the transition takes the form of a front moving with velocity u(t). The free energy of Eq. (2.2) has a single minimum for a > 0, resulting in material mixing. When a < 0 there are two minimums, resulting in the separating\nof material. The control parameters for the mixing and separating regions are denoted by\nsubscripts M and S respectively. The other parameters are defined similarly.\nSince we assume incompressibility and a one-dimensional geometry of the system,\nhydrodynamics can be neglected here, and the dynamics is therefore purely diffusive\n∂t φ = ∇[ m( x,t)∇μ( x,t)] .\n\n(2.4)\n\nThe chemical potential is derived from the free energy as,\nμ( x,t) =\n\nδF\n= a( x,t)φ + b( x,t)φ3 − κ ( x,t)∇2 φ ,\nδφ\n\n(2.5)\n\nand the diffusive mobility m is one of the control parameters which can vary across the\nfront similarly to (2.3). Aside from time and space dependence of the control parameters,\nthis is the familiar Model-B.\n\n\f5\n\nThis model for a moving front has many parameters which can affect the dynamics of\nphase separation, however not all of these parameters are independent. As we elaborate\non in our previous paper, introduction of appropriate time, space, and concentration\nscaling can non-dimensionalize the equations of motion [4]. For the remainder of this\npaper we will work entirely in the non-dimensional scales\nT=\n\nt\ntsp\n\n, X=\n\nx\nφ\n, Φ=\n.\nλsp\nφeq\n\n(2.6)\n\n√\nHere tsp = 4κ/ma2 and λsp = 2π −2κ/a are the characteristic time and length scales of\n√\nspinodal decomposition, and φeq = − a/b is the positive equilibrium concentration of the\nphase-separated material. Non-dimensional quantities will be denoted by capital letters.\nNondimensionalization reduces the free parameters to an independent set of four\nparameters: U = u/usp is the speed of the front scaled by the natural speed of spinodal\ndecomposition usp = λsp /tsp , M = m M /mS is the ratio of the diffusive mobility ahead of the\nfront to behind the front, A = − a M /aS is the depth of the quench into the unstable region\nof the phase diagram, and Φin = φin /φeq is the non-dimensional initial concentration of\nthe mixed material. As we have previously shown, the dynamics becomes particularly\nsimple if we let the diffusive mobility ahead of the front be negligible m M → 0. In this\ncase the dynamics ahead of the front, represented by Eq. (2.4), is halted. This makes the\nA parameter unnecessary. This is not a particularly physical assumption, but it does only\ncause a small quantitative change in the pattern formation as compares to M = 1, as we\nhave previously shown [4]. The existence of analytical solutions, however, makes M = 0\nan attractive choice. If we then assume that the front moves into material which has an\nequally mixed initial concentration, the morphology of domains formed depends only on\nthe non-dimensional front speed (U). Interestingly, an analytical expression can be found\nfor the non-dimensional domain wavelength (L) when U is small and constant:\n\nL (U ) =\n\n4\n\n\u0010√\n\n√\n\u0001 \u0011\n6 + 6ln 2 − 2/3 − 3\n3π 2 U\n\n=\n\nΨ0\n.\nU\n\n(2.7)\n\nThe derivation of this law is given in [4]. Because it is convenient to work with this analytical solution, we will focus on the condition where the initial mixed material contains\nequal parts of A-type and B -type material.\nTo complete our model we require that the front moves with a time dependent speed\nC\nU (T ) = √ ,\nT\n\n(2.8)\n\nappropriate for a diffusive velocity. The parameter C now becomes the only free parameter in this model. This parameter will therefore determine the spacing and width of the\nresulting domains.\n\n\f6\n\n3 Derivation of Liesegang Laws\nWe will now show that for certain parameter choices the model presented in the previous\nchapter will result in the formation of Liesegang patterns. We will do this by deriving\nthe Liesegang laws of Equations (1.1), (1.2) and (1.3) directly from the model. We will\nconclude this section by deriving a Matalon-Packter like analytical expression for the\nspacing coefficient.\nWe first recognize that domain production at any point in space can only occur after\nthe phase-separation front has passed. From our previous paper we observe that once an\nenslaved front has passed a point, domain growth or nucleation occurs very rapidly [4].\nThat is, domains form and grow near the front. The position of the front at time T is\nfound by integrating the front-speed:\nX (T ) =\n\nZ T\n0\n\nU ( T ) dT =\n\n√\n√\n√ dT = 2C T = α T .\nT\n\nZ T\nC\n0\n\n(3.1)\n\nFrom this we see that if domains are formed,\n√ then the nth domain will be formed at time\nTn at position Xn which is proportional to Tn in agreement with the time law of (1.1).\nThis is simply a result of the imposed front speed.\nDeriving the width and spacing laws is more interesting. As we found in our previous\npaper [4] and reproduced in Eq. (2.7), a front moving at constant speed produces domains\nof a predictable wavelength. In the process of deriving Eq. (2.7), we discovered domain\ngrowth has two distinct stages: first is a formation stage where a domain nucleates at the\nfront and grows as it is pulled along with the front until a new domain nucleates; second\nis an expansion stage where the just detached domain grows due to deposition of material\nexcluded from the newly forming, opposite type domain. For a constant speed front\nmoving into material which is initially symmetrically mixed and of negligible mobility,\neach stage accounts for growing half of the domain's final width. In essence, it takes two\ndomain-type switching cycles to completely form a stable domain, and the domain width\ngrows at half the front speed.\nThe width of a domain as it detaches from a constant speed front is half of its final\nwidth, which is then a quarter of the constant speed domain wavelength for a front at\nthat speed. If the front speed is changing, the width at detachment W det is one quarter the domain wavelength predicted in Eq. (2.7) for a front moving with instantaneous\nspeed U at detachment. This statement implies the assumption that our nucleation theory that was derived for constant U can also be applied for time-dependent U. This is a\nnon-trivial assumption but it is justifiable be the excellent agreement of our theory with\ndirect numerical simulations of the full PDE. Using Eq. (2.8) to replace the front speed\ndependence with time, then using Eq. (3.1) to replace the time dependence with position,\nwe can predict the width W det of a domain as it detaches from a front when this front is\nat position X:\n√\nΨ0 Ψ0 T\nΨ\n1\ndet\n=\n= 02 X = βX .\n(3.2)\nW = L (U ) =\n4\n4U\n4C\n8C\n\n\f7\n\nW\n\nFinal Domains' Width & Position\nFront-Attached Domain Width\nDetachment Width Wdet\n\nn\nn+1/2\nX0nXdet\nX0n+1/2 Xdet\n\nX\n\nX0n+1\n\nn+1\nXdet\n\nFigure 1: This figure shows three important aspects of Liesegang pattern formation. The dashed line represents\nthe distance from the previous domain in final morphology. We label the position of the first interface of a\ndomain n as Xn0 . Therefore the dashed line is X − Xn0 where n is the domain that exists at position X. The\ndashed line has slope 1 because the W and X axes have the same scale. The dotted line represents the width\nW of the front-attached domain as a function of the front position X. The slope 1/2 is explained in the\ntext and in our previous paper on enslaved front phase-separation [4]. The solid line represents the maximum\nfront-attached domain width of Eq. (3.2) for the position X of the front. When a domain forming at the front\nreaches W det ( X ), it detaches from the front, and a new domain is nucleated at the front. The dotted, dashed,\nand solid lines all intersect at the points where domain type switching occurs at the front. Note that when a\ndomain n becomes detached from the front its first interface becomes stationary at Xn0 .\n\nNote that this already resembles the Liesegang width law, but does not relate the final\ndomain width to the domain position. For that we must consider the growth of the\ndomain after it detaches from the front. The information presented in this section thus\nfar is graphically shown in Fig. 1 which represents the growth and final morphology of\nLiesegang pattern formation.\nTo derive the width law, recall the formation and expansion stages of domain growth\nmentioned previously. A domain forming at the front increases its width at half the front\nspeed. Due to mass conservation, the detached domain directly behind it increases its\nwidth at the same rate. The width of domains at detachment is predicted by Eq. (3.2).\nThe final width of domain n is then its detachment width, plus the detachment width of\nthe next domain of opposite material, which we count as n + 1/2. From this we get:\ndet\ndet\nWn = Wndet + Wndet\n+1/2 = βXn + βXn+1/2 .\n\n(3.3)\n\nThe position of the first interface Xn0 of domain n can be easily found from the detachment\nposition Xndet by subtracting the width Wndet of the domain at detachment:\nXn0 = Xndet − Wndet = (1 − β) Xndet .\n\n(3.4)\n\nAs evident in Fig. 1, the position Xn0 +1/2 of the first interface of the next domain, which\nwill be of opposite composition, is simply the position of the current domain's second\n\n\f8\n\ninterface, and is found by adding the current domain's width to its first interface position:\nXn0 +1/2 = Xn0 + Wn .\n\n(3.5)\n\nCombining Equations (3.3), (3.4), and (3.5), we recover the Liesegang width law:\nWn =\n\n1\n1\nXn0 = 2\nX 0 = γXn0 .\n1/2β − 1\n4C /Ψ0 − 1 n\n\n(3.6)\n\nWe now derive the spacing law. As seen from Eq. (3.5), the position of the first interface\nof the subsequent domain scales by a constant factor:\nXn0 +1/2 = Xn0 + Wn = (1 + γ) Xn0 .\n\n(3.7)\n\nTwo subsequent domains increase the index n by one, and their positions scale by that\nsame factor squared:\nXn0 +1 = (1 + γ) Xn0 +1/2 = (1 + γ)2 Xn0 .\n(3.8)\nThis gives the Liesegang spacing law\nXn0 +1\n1\n1\n=\n= (1 + γ )2 =\n.\n2\nXn0\n(2β − 1)\n(Ψ0 /4C2 − 1)2\n\n(3.9)\n\nThe position of the band is taken as the boundary between the band and the previous\ngap. Due to experimental reasons, the location of a Liesegang band is often considered\nto be at the center of the band, i.e. Xn = Xn0 + Wn /2. Our derivation of the Liesegang\ntime, spacing, and width laws uses the fact that there is some freedom in measuring the\npositions of the domains Xn , as long as all domains are measured consistently. It is clear\nthat the scaling law holds whether one measures the position on the leading or trailing\nedge of the domain edge. Note that if one definition of the position given by\nXn = Xn0 + νWn ,\n\n(3.10)\n\nobeys the Liesegang laws, then all these definitions of the position will still fulfill the\nLiesegang spacing laws because:\nXn+1 Xn0 +1 + νWn+1 (1 + γν) Xn0 +1 Xn0 +1\n=\n=\n= 0 .\nXn\nXn0 + νWn\nXn\n(1 + γν) Xn0\n\n(3.11)\n\nFrom Eq. (3.9), we determine that the Liesegang spacing coefficient for this model is:\np=\n\n1\n\n(Ψ0 /4C2 − 1)2\n\n−1 .\n\n(3.12)\n\nNote that this expression replaces the Matalon-Packter law,\n√ but bears no apparent resemblance to this phenomenological law. For values of C > Ψ0 /2, the Liesegang spacing\n\n\f9\n\ncoefficient p is√greater than zero, and many domains will form, generating a Liesegang\npattern; C cr = Ψ0 /2 ≈ 0.1247 is a critical value. For C below this value no Liesegang patterns will be formed. Instead only two domains continue to grow and no nucleation of\nnew domains occurs. A graphical representation of Eq. (3.12) is shown in Fig. 3. The authors are not aware of any previous purely analytical expressions that accurately predict\nthe spacing coefficient for any Liesegang pattern producing models.\nWe have now derived all of the laws for Liesegang patterns. Surprisingly there are\nno free parameters and our analytical expressions completely determine the patterns. It\nremains to show that the approximations made in this analytical derivation do not significantly alter the results. To do this we compare our analytical results to direct numerical\nsimulations of our model.\n\n4 Numerical Method and Results\nIn our previous paper we present a one-dimensional lattice Boltzmann method (LBM)\nsimulation of our model for enslaved phase-separation fronts moving with constant speed.\nWe did this by creating a lattice with spatially dependent control parameters, where the\nparameters change abruptly at the location of the front. We then advect the material\nat speed u across this stationary front, using carefully constructed inflow and outflow\nboundary conditions. A Galilean transformation x′ → x − ut of this simulation returns the\noriginal model. The simulation was designed this way, because a slow moving abrupt\nfront on a discrete spatial lattice would be stationary for long periods followed by an\ninstantaneous change of position. On the other hand, since the current of material in\na LBM simulation is represented by continuous distribution functions, a constant drift\nspeed u in the drift diffusion of material can be made arbitrarily small. For details on\nthe development of the LBM simulations for enslaved fronts please refer to our previous\npaper [4]. Here we will only discuss the changes required to implement this method for\nfronts moving with a non-constant speed.\n\n4.1 Changes for Diffusive Fronts and Details of Implementation\nThe method we presented was designed with constant speed fronts in mind, but there\nwas no requirement made that the front speed, and therefore the material advection\nspeed in the LBM simulation, be constant. To implement our model for the diffusive\nspeed front of Eq. (2.8) we make two changes. First, the simulation is started at time\nT = T0 > 0 to ensure that the advection speed is finite. Second, the advection speed is\nrecalculated according to Eq. (2.8) at every iteration. To ensure the analytical solution\nof Eq. (2.7) is applicable, we must use front speeds that are sufficiently slow. The numerical verification of Eq. (2.7) is given in [4, Fig. 7] and shows that fronts moving at\nnon-dimensional speed of U ≤ 0.001 produce domain sizes that agree very well with the\nprediction. This being the case, we begin our simulation so that the initial front speed is\nU0 = 0.001, by setting our simulation start time T0 = (C/U0 )2 .\n\n\f10\n\n200\n\nDomain Width (W)\n\nConcentration (Φ)\n\n1\n\n0\n\n-1\n0\n\n1000\n500\nPosition (X) with Arbitrary Offset\n\n1500\n\n150\n\nIgnored Domain Widths\nDomain Widths for p Fitting\nn\nW=W0+Q(1+p) Best Fit\n\n100\n\n50\n\n0\n0\n\n(a)\n\n2\n\n4\n6\nDomain Number (n)\n\n8\n\n10\n\n(b)\n\nFigure 2: Final data from LBM simulation for C = 0.4. Subfigure (a) shows an example concentration profile\nof Liesegang pattern morphology at simulation completion. The offset is due to requiring an initial finite speed\nand dynamic growing of the simulation. Subfigure (b) shows the fitting the domains widths found in (a) to\ndetermine p(C ). Some domains are ignored because they are not formed by the front, but are instead artifacts\nof the simulation procedure. The width Wn of domain n is fitted to the equation Wn = W0 + Q(1 + p)n to find\nan experimental value of p to compare to the theoretical prediction of Eq. (3.12). For these data the fitting\nvalues are W0 = −1.92468, Q = 23.7999, and p = 0.212093.\n\nThe simulation is initialized with random concentration fluctuations around the symmetrically mixed concentration value of Φin = 0. This results in spinodal decomposition\nin the region behind the front. These small domains serve to buffer the domains formed\nby the enslaved front from being adversely effected by any anomalies due to the outflow\nboundary condition. To increase simulation performance the number of lattice sites is\ninitially rather small, and is dynamically grown to maintain a buffer of small domains.\n\n4.2 Measurements and Calculations\nOur goal with these simulations is to verify our analytical predictions of Equations (3.6)\nand (3.9) for the Liesegang laws. We accomplish this by performing simulations with\ndifferent values of C, measuring the width Wn of the nth domain formed, and performing\na numerical fitting to the equation\nWn = W0 + Q (1 + p) n ,\n\n(4.1)\n\nwhere W0 , Q and p are the fitting parameters. This is an alternative form of Eq. (1.2) with\na substitution provided by Eq. (1.3).\nThe domain widths are measured by interpolating the sub-lattice position of the zerocrossing of the concentration at an interface, and determining the distance to the sublattice position of the next interface. To ensure that there are sufficient domains to perform meaningful fitting to Eq. (4.1) we track the number of switching events; after 19\n\n\f11\n\n2.0\nTheory for p(C)\nSimulation\n\np\n\n1.5\n\n1.0\n\n0.5\n\n0.0\n0.0\n\ncr\nC 0.2\n\n0.4\n\n0.6\nC\n\n0.8\n\n1.0\n\nFigure 3: Comparison of the theoretical prediction for p as a function of the free parameter C shown in Eq. (3.12).\nThis expression replaces the Matalon-Packter law for this model. The results show excellent agreement of the\nsimulation results with the assumptions made in the derivation of the Liesegang scaling laws for this model.\nFor C < C cr no new domains were nucleated. These data were taken from a series of simulations, the details of\nwhich are explained in the text.\n\nswitching events have occurred the domain widths and other data, such as the concentration profile, are written out to disk. As explained in the previous section, the two\ndomains directly behind the front are not completely formed, and are not used to find\nthe experimental p value. The first domain formed by the front may also be ignored as\nit can sometimes be induced by the very strong dynamics of spinodal decomposition.\nThis typically leaves 16 alternating domains of A and B -type material which can be used\nfor fitting to Eq. (4.1). Example simulation data and p fitting are shown in Fig. 2 for the\nC = 0.4 data point shown in Fig. 3. The concentration profile is shown in Fig. 2(a), and the\nwidth fitting is shown in Fig. 2(b).\nOne additional note: the concentration profile of Fig. 2(a) seems to show a very sharp\ninterface. The actual interface width covers approximately ten lattice sites, and is in\nagreement with the bulk stability requirements outlined by Wagner and Pooley in [11].\nThe use of the minimum stable interface width increases simulation spatial efficiency.\nAdditionally, the use of smaller interface widths allows a larger time scaling factor s to be\nused which further increases simulation efficiency by calculating a larger time step each\niteration.\nNumerous simulations of the type shown in Fig. 2 were performed for different values\nof C and the corresponding p values were measured and compared to the theoretical\nprediction of Eq. (3.12). These results are shown in Fig. 3 and show excellent agreement.\nThis remarkable agreement suggests that approximations made in the derivation of the\nanalytical results have negligible effect on the final results. This is notable, as no other\nLiesegang pattern forming model has an accurate analytical prediction of the Liesegang\nscaling laws.\n\n\f12\n\n200\n\nDomain Width (W)\n\nConcentration (Φ)\n\n1\n\n0\n\n-1\n0\n\n1000\n500\nPosition (X) with Arbitrary Offset\n\n(a)\n\n150\n\n100\n\nIgnored Bands\nBand Widths for pA Fitting\nn\nW=W0+Q(1+pA) Best Fit\nIgnored Gaps\nGap Widths for pB Fitting\nn\nW=W0+Q(1+pB) Best Fit\n\n50\n\n0\n0\n\n2\n\n4\n6\nDomain Number (n)\n\n8\n\n(b)\n\nFigure 4: Example concentration profile showing Liesegang patterns formed by an enslaved front moving through\nmaterial with an initial concentration Φ in = −0.3, and a front speed scaling constant C = 0.5. The profile is\nshown in subfigure (a) at simulation completion. Subfigure (b) shows fitting the band (A-type) and gap (B -type)\nwidths separately to find p(C ) for initial material consisting of a majority B -type. Fitting parameters for the\nbands are W0 =−1.41736, Q = 22.4956, and pA = 0.151002. Fitting parameters for the gaps are W0 =−0.449771,\nQ = 36.1552, and pB = 0.15435. This spacing coefficient is higher than for material which is initially equally\nmixed Φ in = 0. As can be seen in Fig. 3, the spacing coefficient for C = 0.5 is p ≈ 0.12 in the case where Φ in = 0.\n\n5 Outlook\nIn this paper we have shown that\n√a model for an enslaved phase separation front which\nmoves at diffusive speed U = C/ T can be used to produce Liesegang patterns. We have\ndone this by deriving the Liesegang time, width, and spacing laws from the model. Our\nanalysis includes the determination of the Liesegang spacing coefficient p as a function of\nthe front speed parameter C. In doing so we determined the values of C where Liesegang\npatterns are produced, and verified this with direct numerical simulations of the model.\nFor this paper we have chosen the initial material composition to be symmetrically\nmixed. This corresponds to Φin = 0 and allows us to use the analytical result in Eq. (2.7)\nto determine the Liesegang laws and their constants of proportionality. This model, however, can generate Liesegang patterns for the range of initial concentrations between the\nspinodal concentrations. An example is shown in Fig. 4 of a Liesegang pattern for asymmetrically mixed initial material generated by this model. The parameters used in this\nsimulation were C = 0.5 and Φin = −0.3. We expect that it will be possible to determine a\nspacing law for off-critical mixtures, but that is outside the scope of this paper. Additionally, the production of Liesegang patterns by enslaved fronts which move into material\nwith non-zero mixed mobility should be considered. We expect the results to be qualitatively similar, but we are not sure than this case will be amenable to an analytical\ntreatment.\n\n\f13\n\nAcknowledgments\nWe would like to think S. May and G. Kaehler for helpful discussions. E.F. acknowledges\nsupport by the National Science Foundation under grant DMR-0513393.\n\n\f14\n\nReferences\n[1] T. Antal, M. Droz, J. Magnin, and Z. Rácz. Formation of liesegang patterns: A spinodal\ndecomposition scenario. Phys. Rev. Lett., 83(15):2880–2883, Oct 1999.\n[2] T. Antal, M. Droz, J. Magnin, Z. Rácz, and M. Zrinyi. Derivation of the matalon-packter law\nfor liesegang patterns. J. Chem. Phys., 109:9479–9486, December 1998.\n[3] B. Chopard, P. Luthi, and M. Droz. Reaction-diffusion cellular-automata model for the formation of liesegang patterns. Phys. Rev. Lett., 72(9):1384–1387, FEB 28 1994.\n[4] E. M. Foard and A. J. Wagner. Enslaved phase-separation fronts in one-dimensional binary\nmixtures. Phys. Rev. E, 79(5):056710, 2009.\n[5] F. Izsak and I. Lagzi. Simulation of liesegang pattern formation using a discrete stochastic\nmodel. Chem. Phys. Lett., 371(3-4):321–326, APR 7 2003.\n[6] K. Jablczynski. La formation rythmique des pecipites: Les anneaux de liesegang. Bull. Soc.\nChim. Fr., 33:1592, 1923.\n[7] L. Jahnke and J. W. Kantelhardt. Comparison of models and lattice-gas simulations for\nliesegang patterns. Eur. Phys. J. Special Topics, 161:121–141, JUL 2008.\n[8] R. E. Liesegang. Ueber einige eigenschaften von gallerten. Naturwissenschaftliche Wochenschrift, 11(30):353–362, 1896.\n[9] Z. Racz. Formation of liesegang patterns. Physica A, 274(1-2):50–59, DEC 1 1999.\n[10] K. H. Stern. The liesegang phenomenon. Chemical Reviews, 54:79–99, January 1954.\n[11] A. J. Wagner and C. M. Pooley. Interface width and bulk stability: Requirements for the\nsimulation of deeply quenched liquid-gas systems. Phys. Rev. E, 76(4):045702, 2007.\n\n\f"}