{"id": "http://arxiv.org/abs/1010.1373v2", "guidislink": true, "updated": "2011-03-29T13:10:11Z", "updated_parsed": [2011, 3, 29, 13, 10, 11, 1, 88, 0], "published": "2010-10-07T09:03:53Z", "published_parsed": [2010, 10, 7, 9, 3, 53, 3, 280, 0], "title": "Linear broadening of the confining string in Yang-Mills theory at low\n  temperature", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1010.0166%2C1010.1509%2C1010.6012%2C1010.3482%2C1010.6186%2C1010.2452%2C1010.4266%2C1010.5243%2C1010.2305%2C1010.1363%2C1010.3654%2C1010.5916%2C1010.4602%2C1010.4590%2C1010.1330%2C1010.3463%2C1010.1034%2C1010.2564%2C1010.3725%2C1010.0590%2C1010.0050%2C1010.5142%2C1010.4821%2C1010.3771%2C1010.3510%2C1010.4556%2C1010.3788%2C1010.4140%2C1010.3387%2C1010.0352%2C1010.6106%2C1010.2214%2C1010.4230%2C1010.4125%2C1010.2103%2C1010.5590%2C1010.3840%2C1010.4978%2C1010.0108%2C1010.5522%2C1010.0223%2C1010.4061%2C1010.3365%2C1010.2084%2C1010.3882%2C1010.3661%2C1010.4453%2C1010.4506%2C1010.1652%2C1010.3608%2C1010.6003%2C1010.1038%2C1010.5833%2C1010.0556%2C1010.0576%2C1010.3297%2C1010.1232%2C1010.5313%2C1010.2692%2C1010.6195%2C1010.3759%2C1010.0312%2C1010.4616%2C1010.2666%2C1010.3970%2C1010.0528%2C1010.0912%2C1010.5849%2C1010.5351%2C1010.4946%2C1010.1390%2C1010.3232%2C1010.2693%2C1010.1979%2C1010.5282%2C1010.4849%2C1010.5141%2C1010.0270%2C1010.5635%2C1010.1589%2C1010.4434%2C1010.0021%2C1010.2184%2C1010.5762%2C1010.6118%2C1010.3806%2C1010.5583%2C1010.3703%2C1010.3470%2C1010.3336%2C1010.1144%2C1010.3413%2C1010.3805%2C1010.0682%2C1010.1179%2C1010.2462%2C1010.5382%2C1010.2879%2C1010.1373%2C1010.5530%2C1010.4440&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Linear broadening of the confining string in Yang-Mills theory at low\n  temperature"}, "summary": "The logarithmic broadening predicted by the systematic low-energy effective\nfield theory for the confining string has recently been verified in numerical\nsimulations of (2+1)-d SU(2) lattice Yang-Mills theory at zero temperature. The\nsame effective theory predicts linear broadening of the string at low non-zero\ntemperature. In this paper, we verify this prediction by comparison with very\nprecise Monte Carlo data. The comparison involves no additional adjustable\nparameters, because the low-energy constants of the effective theory have\nalready been fixed at zero temperature. It yields very good agreement between\nthe underlying Yang-Mills theory and the effective string theory.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1010.0166%2C1010.1509%2C1010.6012%2C1010.3482%2C1010.6186%2C1010.2452%2C1010.4266%2C1010.5243%2C1010.2305%2C1010.1363%2C1010.3654%2C1010.5916%2C1010.4602%2C1010.4590%2C1010.1330%2C1010.3463%2C1010.1034%2C1010.2564%2C1010.3725%2C1010.0590%2C1010.0050%2C1010.5142%2C1010.4821%2C1010.3771%2C1010.3510%2C1010.4556%2C1010.3788%2C1010.4140%2C1010.3387%2C1010.0352%2C1010.6106%2C1010.2214%2C1010.4230%2C1010.4125%2C1010.2103%2C1010.5590%2C1010.3840%2C1010.4978%2C1010.0108%2C1010.5522%2C1010.0223%2C1010.4061%2C1010.3365%2C1010.2084%2C1010.3882%2C1010.3661%2C1010.4453%2C1010.4506%2C1010.1652%2C1010.3608%2C1010.6003%2C1010.1038%2C1010.5833%2C1010.0556%2C1010.0576%2C1010.3297%2C1010.1232%2C1010.5313%2C1010.2692%2C1010.6195%2C1010.3759%2C1010.0312%2C1010.4616%2C1010.2666%2C1010.3970%2C1010.0528%2C1010.0912%2C1010.5849%2C1010.5351%2C1010.4946%2C1010.1390%2C1010.3232%2C1010.2693%2C1010.1979%2C1010.5282%2C1010.4849%2C1010.5141%2C1010.0270%2C1010.5635%2C1010.1589%2C1010.4434%2C1010.0021%2C1010.2184%2C1010.5762%2C1010.6118%2C1010.3806%2C1010.5583%2C1010.3703%2C1010.3470%2C1010.3336%2C1010.1144%2C1010.3413%2C1010.3805%2C1010.0682%2C1010.1179%2C1010.2462%2C1010.5382%2C1010.2879%2C1010.1373%2C1010.5530%2C1010.4440&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The logarithmic broadening predicted by the systematic low-energy effective\nfield theory for the confining string has recently been verified in numerical\nsimulations of (2+1)-d SU(2) lattice Yang-Mills theory at zero temperature. The\nsame effective theory predicts linear broadening of the string at low non-zero\ntemperature. In this paper, we verify this prediction by comparison with very\nprecise Monte Carlo data. The comparison involves no additional adjustable\nparameters, because the low-energy constants of the effective theory have\nalready been fixed at zero temperature. It yields very good agreement between\nthe underlying Yang-Mills theory and the effective string theory."}, "authors": ["F. Gliozzi", "M. Pepe", "U. -J. Wiese"], "author_detail": {"name": "U. -J. Wiese"}, "author": "U. -J. Wiese", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1007/JHEP01(2011)057", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1010.1373v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1010.1373v2", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "10 pages, 3 figures. Version published in JHEP; improved figures 1\n  and 3", "arxiv_primary_category": {"term": "hep-lat", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "hep-lat", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "hep-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "hep-th", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1010.1373v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1010.1373v2", "journal_reference": "JHEP 1101:057,2011", "doi": "10.1007/JHEP01(2011)057", "fulltext": "Preprint typeset in JHEP style - HYPER VERSION\n\narXiv:1010.1373v2 [hep-lat] 29 Mar 2011\n\nLinear broadening of the confining string in Yang-Mills\ntheory at low temperature\n\nF. Gliozzi\nDipartimento di Fisica Teorica, Università di Torino, and\nINFN, Sezione di Torino, via P. Giuria 1, 10125 Torino, Italy.\nE-mail: gliozzi@to.infn.it\n\nM. Pepe\nINFN, Sezione di Milano-Bicocca\nEdificio U2, Piazza della Scienza 3, 20126 Milano, Italy.\nE-mail: pepe@mib.infn.it\n\nU.-J. Wiese\nAlbert Einstein Center for Fundamental Physics\nInstitute for Theoretical Physics, Bern University\nSidlerstr. 5, 3012 Bern, Switzerland.\nE-mail: wiese@itp.unibe.ch\n\nAbstract: The logarithmic broadening predicted by the systematic low-energy effective\nfield theory for the confining string has recently been verified in numerical simulations of\n(2 + 1)-d SU (2) lattice Yang-Mills theory at zero temperature. The same effective theory\npredicts linear broadening of the string at low non-zero temperature. In this paper, we\nverify this prediction by comparison with very precise Monte Carlo data. The comparison\ninvolves no additional adjustable parameters, because the low-energy constants of the effective theory have already been fixed at zero temperature. It yields very good agreement\nbetween the underlying Yang-Mills theory and the effective string theory.\nKeywords: Nonperturbative Effects, Lattice Gauge Field Theories, Lattice Quantum\nField Theory, Bosonic Strings.\n\n\fContents\n1. Introduction\n\n1\n\n2. Analytic Results of the Low-Energy Effective String Theory\n\n2\n\n3. Numerical Results for (2 + 1)-d SU (2) Lattice Yang-Mills Theory\n\n4\n\n4. Conclusions\n\n7\n\n1. Introduction\nAt low temperature, in Yang-Mills theory static quarks and anti-quarks are confined to\none another by an unbreakable string. The string itself is an interesting object with peculiar dynamical properties. The relevant energy scale for these dynamics is set by the\nstring tension σ, which defines the asymptotic slope of the linearly rising quark-anti-quark\npotential. The string tension also controls the amplitude of transverse fluctuations of the\nstring. As was pointed out a long time ago by Lüscher, Symanzik, and Weisz [1], these\nfluctuations are described by a systematic low-energy effective string theory. In fact, the\ntransverse fluctuations are massless modes (i.e. Goldstone excitations) of a spontaneously\nbroken translational symmetry of the string world-sheet, also known as capillary waves in\ncondensed matter physics. The effective string theory plays the role of chiral perturbation\ntheory for these Goldstone modes. Using the effective theory, Lüscher has calculated the\nleading correction to the linear quark-anti-quark potential\nV (r) = σr −\n\nπ(d − 2)\n+ O(1/r 3 ),\n24r\n\n(1.1)\n\nwhere d is the space-time dimension and (d − 2) counts the directions transverse to the\nstring world-sheet [1, 2]. Accurate numerical simulations have shown the validity of that\nexpectation [3–12]. The effective theory also accounts for the string width [13]. Due to\nits transverse fluctuations, the string broadens as the quark sources are separated. The\ncross-sectional area swept out by the fluctuating string increases logarithmically with the\ndistance r between the static sources, i.e.\n2\n(r/2) =\nwlo\n\nd−2\nlog(r/r0 ).\n2πσ\n\n(1.2)\n\nHere wlo (r/2) is the leading-order string width at the distance r/2, half-way between the\nexternal static quark sources, and r0 is a length scale that enters the effective string theory\nas a low-energy parameter. The above expression for the width is universal and applies to\nstrings in Yang-Mills theory as well as to fluctuating interfaces between different phases of\n\n–1–\n\n\fcondensed matter. It has been verified in numerical simulations for the interfaces separating\nthe two low-temperature phases of the 3-d Ising model above the roughening transition [14].\nSimilar results have been obtained in a (2 + 1)-d Z(4) gauge theory [15]. Since numerical\nlattice calculations of the string width in non-Abelian gauge theories are computationally\nvery challenging, early calculations were affected by large statistical errors and did thus\nnot yield conclusive results [16]. Only recently, using the very efficient Lüscher-Weisz\nmulti-level algorithm [6, 17], the logarithmically divergent string width has been accurately\nverified by simulating (2 + 1)-d SU (2) lattice Yang-Mills theory [18]. Recent results on the\neffective string description of the color flux tube in (2 + 1)-d SU (N ) Yang-Mills theory can\nbe found in [19, 20].\nAt low temperature T = 1/β, the extent β of the periodic Euclidean time direction\n√\nenters as another length scale in the low-energy effective string theory. At low T ≪ σ,\nthe temperature effects on the string tension and the string broadening are again accessible\nto a systematic treatment. At leading order, the temperature-dependent string tension is\ngiven by\nπ(d − 2)\nσ(β) = σ −\n.\n(1.3)\n6β 2\nSimilarly, the leading-order string width at a distance r/2 ≫ β takes the form [21, 22]\n2\n(r/2) =\nwlo\n\nd−2\nβ\nd−2\nlog\n+\nr + O(e−2πr/β ).\n2πσ\n4r0\n4βσ\n\n(1.4)\n\nHence, at non-zero temperature the confining string broadens linearly with the distance\nbetween the external static quarks. Numerical evidence for linear string broadening at finite\ntemperature was presented for fluctuating interfaces in the 3-d Ising model in [21, 22] and,\nrecently, for (3 + 1)-d SU (3) Yang-Mills theory in [23]. In this paper, using the LüscherWeisz multi-level simulation technique, we perform very accurate Monte Carlo calculations\nof the temperature-dependent string width in (2 + 1)-d SU (2) Yang-Mills theory. The\nnumerical results are then compared with the corresponding analytic predictions of the\nsystematic low-energy effective string theory at the 2-loop level [24]. Since the low-energy\nparameters of the effective theory were previously fixed by a comparison with Monte Carlo\ndata at zero temperature, there are no adjustable parameters. We find perfect agreement\nbetween the numerical data and the analytic predictions, which lends further support to\nthe quantitative validity of the effective theory.\nThe rest of this paper is organized as follows. Section 2 describes the analytic calculations in the low-energy effective string theory, which are then compared with the numerical\nresults obtained in section 3. Section 4 contains our conclusions.\n\n2. Analytic Results of the Low-Energy Effective String Theory\nLet us consider the systematic low-energy effective theory describing the transverse fluctuations of the string world sheet in (2 + 1)-d Yang-Mills theory. In terms of the height\nvariable h(x, t) the corresponding Euclidean action is given by\n\u0014\n\u0015\nZ β Z r\n1\nσ\n2\n∂μ h∂μ h − (∂μ h∂μ h) .\n(2.1)\ndx\ndt\nS[h] =\n2\n4\n0\n0\n\n–2–\n\n\fHere x ∈ [0, r] and t ∈ [0, β] parameterize the 2-d base-space. Since the string ends at static\nquark charges separated by a distance r, its fluctuation field obeys the boundary condition\nh(0, t) = h(r, t) = 0. The boundary conditions explicitly break translation invariance and\none might have expected boundary terms to be present in the effective action as well [6].\nRemarkably, due to open-closed string duality, such terms are absent and the prefactor of\nthe first sub-leading term is uniquely determined [25]. This behavior even extends to the\nnext order six-derivative term. Indeed, up to that order the effective action coincides with\nthe one of the Nambu-Goto string [26–28].\nThe confining string of a lattice Yang-Mills theory suffers from lattice artifacts which\ndisappear only in the continuum limit. Away from the continuum limit, in the strong coupling regime, the lattice string is rigid, i.e. it follows the discrete lattice steps and does not\neven support massless fluctuations. When one crosses the roughening transition at intermediate values of the coupling, one enters the rough phase with massless Goldstone excitations\nof the string, to which the low-energy effective string theory applies. Since the lattice theory is invariant only under discrete rotations and not under the full Poincaré group, before\nP\none reaches the continuum limit two additional terms proportional to μ=1,2 ∂μ ∂μ h∂μ ∂μ h\nP\nand to μ=1,2 (∂μ h)4 enter the effective theory in the bulk. Since these terms contain four\nderivatives, they are of sub-leading order. Hence, they have no effect on the Lüscher term\nor on the leading behavior of the string width. As a result, the Lüscher term is indeed completely universal. Provided its world-sheet is rough, even a lattice string supports exactly\nmassless modes which contribute −π/24r to the static quark potential. In particular, this\nterm is not affected by lattice spacing artifacts, since such effects are of sub-leading order.\nIn the following, we will work sufficiently close to the continuum limit of the lattice theory.\nIn that case, the effective action of eq.(2.1) without the additional non-rotational-invariant\nterms is sufficient.\nRecently, an analytic expression for the string width at zero temperature has been\nderived from the effective string theory at the 2-loop level [24]\n2\n\nw (r/2) =\n\n\u0012\n\n4πf (τ )\n1+\nσr 2\n\n\u0013\n\n2\nwlo\n(r/2) −\n\nf (τ ) + g(τ )\n,\nσ2r2\n\n(2.2)\n\nwhere\nE2 (τ ) − 4E2 (2τ )\nf (τ ) =\n,\n48\n\ng(τ ) = iπτ\n\n\u0012\n\nE2 (τ )\nd\n−q\n12\ndq\n\n\u0013\u0012\n\nE2 (τ )\nf (τ ) +\n16\n\n\u0013\n\n+\n\nE2 (τ )\n. (2.3)\n96\n\nThe parameter q = e2πiτ depends on the ratio τ = iβ/(2r) and\nE2 (τ ) = 1 − 24\n\n∞\nX\nnq n\n,\nn\n1\n−\nq\nn=1\n\n(2.4)\n\nis the first Eisenstein series. The leading-order expression for the width\n2\nwlo\n(r/2)\n\n1\nlog\n=\n2πσ\n\n\u0012\n\nr\nr0\n\n\u0013\n\n–3–\n\n1\nlog\n+\nπσ\n\n\u0012\n\nη(2τ )\nη(τ )2\n\n\u0013\n\n,\n\n(2.5)\n\n\fcontains the Dedekind η-function\n1\n\nη(τ ) = q 24\n\n∞\nY\n\n(1 − q n ).\n\n(2.6)\n\nn=1\n\nThis function and the Eisenstein series E2 obey the following transformations under the\ninversion τ → −τ −1\nη(τ ) = √\n\n1\n1\nη(− ) ,\nτ\n−iτ\n\nE2 (τ ) =\n\n1\n1\n6\nE2 (− ) −\n.\nτ2\nτ\niπτ\n\n(2.7)\n\nUsing these relations, the expression of eq.(2.2) in the zero-temperature limit, β ≫ r, is\nreadily converted into an expression in the limit r ≫ β. In this case, the temperature is\nstill small, but the string length r is much larger than the inverse temperature β.\nFor completeness, we present also the expression for the force F at finite temperature,\ndefined as the first derivative of the potential. At leading order the force is given by\nFlo (r) = σ +\n\n1\nπ\n1\n−\nE2 (− ).\n2βr 6β 2\nτ\n\n(2.8)\n\nThe potential at next-to-leading order has been obtained from the computation of the\npartition function using the effective string action of eq.(2.1) [29]. Then the force is given\nby the expression\n\u0013\n\u0015\n\u0014 \u0012\n1\n9β 2 6β\n1\n1\nπ2 d\n2\n)\n−\nE\n(−\n)\n−\n+\nE\n(−\n)\n(2.9)\nr\n2E\n(−\nF (r) = Flo (r) −\n2\n4\n2\n72σβ 4 dr\nτ\nτ\nπ2r\nπ\nτ\nThis equation shows that the 2-loop string tension at finite temperature is given by\nσ(β) = σ −\n\nπ2\nπ\n−\n.\n6β 2 72σβ 4\n\n(2.10)\n\n3. Numerical Results for (2 + 1)-d SU(2) Lattice Yang-Mills Theory\nSince it is least problematical in numerical simulations, we concentrate on (2 + 1)-d SU (2)\nYang-Mills theory on a cubic lattice of size L × L × β, with the Euclidean time extent β\ndetermining the inverse temperature. The partition function is then given by\nZ\nYZ\ndUx,μ exp(−S[U ]).\n(3.1)\nZ = DU exp(−S[U ]) =\nx,μ\n\nSU (2)\n\nHere dUx,μ denotes the local gauge invariant Haar measure for a parallel transporter variable Ux,μ ∈ SU (2) located on the link (x, μ). We use the standard Wilson plaquette action\nS[U ] = −\n\n2 X\n†\n†\nTr[Ux,μ Ux+μ̂,ν Ux+ν̂,μ\nUx,ν\n],\ng 2 x,μ,ν\n\n(3.2)\n\nwhere g is the bare gauge coupling and μ̂ is a unit-vector pointing in the μ-direction. As\nusual in lattice calculations, all physical quantities are expressed in units of the lattice\nspacing which is set to 1.\n\n–4–\n\n\fThe external static quarks at the two ends of the confining string are represented by\nPolyakov loops\n#\n\" β\nY\n(3.3)\nUx+t2̂,2 ,\nΦx = Tr\nt=1\n\nwhich wind around the periodic Euclidean time direction. We choose the 2-direction to\nrepresent Euclidean time. When two external quarks are separated in the 1-direction, the\nworld-sheet of the confining string extends in the space-time directions μ = 1, 2, while the\nstring fluctuates in the transverse 3-direction. The static quark potential V (r) is extracted\nfrom the Polyakov loop correlation function\nZ\n1\nhΦ0 Φr i =\nDU Φ0 Φr exp(−S[U ]) ∼ exp(−βV (r)),\n(3.4)\nZ\nin the zero-temperature limit β → ∞.\nThe force between the two static quarks is extracted from the discrete derivative of\nthe static potential\nF (r̄) = V (r + 1) − V (r) = −\n\nhΦ0 Φr+1 i\n1\nlog\n,\nβ\nhΦ0 Φr i\n\n(3.5)\n\nwhere, writing explicitly the lattice spacing a, r̄ = r + a2 + O(a2 ) is an improved definition\nof the point where the force is computed [30].\nThe width of the string is determined from the connected correlation function\nC(x3 ) =\n\nhΦ0 Φr Px i\n− hPx i,\nhΦ0 Φr i\n\n(3.6)\n\nof a pair of Polyakov loops with a single plaquette\n†\nPx = Tr[Ux,1 Ux+1̂,2 Ux+\nU † ],\n2̂,1 x,2\n\n(3.7)\n\nin the 1-2 plane, which measures the color-electric field along the 1-direction of the string\nas a function of the transverse displacement x3 . The plaquette is located at the site\nx = (r/2, t, x3 ) and thus measures the transverse fluctuations of the color flux tube at the\nmaximal distance r/2 from the external quark charges.\nWe have performed numerical simulations at the bare gauge coupling 4/g2 = 9.0 on a\n902 × 16 lattice, corresponding to T /Tc ≈ 0.38. We have used the Lüscher-Weisz technique\n[6, 17] with a single level and with slices of thickness 4. In table 1 we report the number\nof sub-lattice updates for various ranges of distances between the static sources.\nIn figure 1, we plot the force between the two static quarks as a function of the\ndistance between the sources. The dotted line is the force in the leading order approximation of eq.(2.8). The solid line is the next-to-leading order approximation given by\neq.(2.9). It is important to note that there is no free parameter and σ = 0.025897(15) is\nthe zero-temperature string tension. The next-to-leading order expression already provides\na very good description of the numerical data. Considering the accuracy of the data, it is\nreasonable to expect that the residual tiny discrepancy can be described by the next-tonext-to-leading order correction.\n\n–5–\n\n\fr range\n4-8\n9-15\n16-22\n23-25\n\nupdates\n3200\n24000\n32000\n80000\n\nTable 1: Number of sub-lattice updates of the single level Lüscher-Weisz algorithm for various\nranges of distances between the static sources.\n0.03\ndata\n\n0.029\n\n0.028\n\n0.027\n\n0.026\n\n0.025\n\n5\n\n10\n\n15\n\n20\n\n25\n\n30\n\nFigure 1: The force F (r̄) as a function of the distance between the two static quarks. The dotted\nline and the solid line are the leading order approximation of eq.(2.8) and the next-to-leading order\napproximation of eq.(2.9), respectively.\n\nFor the measurement of the string width, the correlation function is fit to the ansatz\nhΦ0 Φr Px i\n1 + B exp(−x23 /s)\n= A exp(−x23 /s)\n+ K,\nhΦ0 Φr i\n1 + D exp(−x23 /s)\n\n(3.8)\n\nand the squared width of the string is then obtained as the second moment of the correlation\nfunction\nR\ndx3 x23 C(x3 )\n2\n.\n(3.9)\nw (r/2) = R\ndx3 C(x3 )\n\nIn figure 2, we show the bell-shaped correlation function hΦ0 Φr Px i/hΦ0 Φr i as a function of the transverse displacement of the plaquette from the plane of the string world-sheet.\nThe data refer to a pair of static sources at fixed distance r = 17. The solid line is a fit of\nthe data using the ansatz (3.8).\nThe scale that determines the logarithmic broadening of the string at zero temperature\n√\nwas previously determined as r0 = 2.26(2) such that r0 σ = 0.364(3) [18]. It is important\n\n–6–\n\n\f0.88585\n\n0.8858\n\n0.88575\n\n0.8857\n\n0.88565\n\n0.8856\n\n0.88555\n\n0.8855\n\n0.88545\n0\n\n5\n\n10\n\n15\n\n20\n\nFigure 2: The ratio hΦhΦ0 Φ0 Φr Pr ix i as a function of the transverse displacement x3 of the plaquette from\nthe plane of the string world-sheet. The distance between the two static sources is r = 17. The\nsolid curve is a fit using eq.(3.8).\n\nto note that σ and r0 are the only low-energy parameters entering the 2-loop formula for\nthe width of the flux tube. Hence the theoretical prediction resulting from the low-energy\neffective theory is completely determined without any additional adjustable parameter.\nIn figure 3 we report the observed dependence of the flux tube width on the distance\nbetween the static sources as resulting from numerical Monte Carlo simulations. The two\nsolid lines represent the fully constrained prediction of the low-energy effective string theory\ncorresponding to the choices r0 = 2.26± 0.02. The numerical data show the expected linear\nbehavior for sufficiently large separations of the sources and the agreement with the analytic\nformula turns out to be excellent.\nFinally, it is important to notice that the next-to-leading expression (2.2) for the width\nis not sensitive to the next-to-leading correction to the string tension. In fact, the 2-loop\nresult for the width goes up to corrections of order 1/(σβ 2 ) and so the corrections of order\n1/(σβ 2 )2 to the string tension will appear as 3-loop corrections to the width. Looking at\nthe data for the width in figure 3, the accuracy is such that we are not very sensitive to the\nnext-to-leading correction to the string tension and one cannot detect the tiny difference\nthat the direct measurement of the force in figure 1 shows.\n\n4. Conclusions\nUsing the Lüscher-Weisz multi-level simulation technique, we have performed high-accuracy\nnumerical simulations of the confining string connecting two static quarks in (2+1)-d SU (2)\n\n–7–\n\n\f20\n\n18\n\n16\n\n14\n\n12\n\n10\n\n8\n\n6\n\n4\n5\n\n10\n\n15\n\n20\n\n25\n\nFigure 3: The squared width of the confining string at its midpoint w2 (r/2) as a function of the\nseparation of the static sources r. The dotted line is the leading order prediction of the low-energy\neffective string theory using r0 = 2.26. The two solid lines represent the 2-loop prediction using\nr0 = 2.26 ± 0.02.\n\nYang-Mills theory. The results for the finite temperature string width have been compared\nwith analytic 2-loop calculations performed in the corresponding systematic low-energy\neffective string theory. Since the low-energy parameters σ and r0 were already determined\nat zero temperature, there were no further adjustable parameters in the comparison of the\neffective theory with the numerical simulations of the lattice Yang-Mills theory. Remarkably, there is perfect agreement between the underlying Yang-Mills theory and the effective\nstring theory, thus confirming the quantitative correctness of the latter. With sufficient\nnumerical resources (which are still modest on today's standards in lattice field theory) it\nis certainly feasible to extend our study to other gauge groups and to (3 + 1) dimensions. A\nsimilar investigation in (3 + 1)-d SU (3) Yang-Mills theory would definitely be possible. In\nparticular, it would be interesting to investigate whether the effective theory works equally\nwell in the numerically accessible regime as in the (2 + 1)-d case investigated here.\n\nAcknowledgements\nWe gratefully acknowledge helpful discussions with M. Caselle and F. Niedermayer. This\nwork is supported in part by funds provided by the Schweizerischer Nationalfonds (SNF).\nThe \"Albert Einstein Center for Fundamental Physics\" at Bern University is supported by\nthe \"Innovations- und Kooperationsprojekt C-13\" of the Schweizerische Universitätskonferenz (SUK/CRUS).\n\n–8–\n\n\fReferences\n[1] M. Lüscher, K. Symanzik, and P. Weisz, Nucl. Phys. B173 (1980) 365.\n[2] M. Lüscher, Nucl. Phys. B180 (1981) 317.\n[3] M. Hasenbusch and K. Pinn, Physica A192 (1993) 342.\n[4] M. Caselle, R. Fiore, F. Gliozzi, M. Hasenbusch, and P. Provero, Nucl. Phys. B486\n(1997) 245.\n[5] K. J. Juge, J. Kuti, and C. Morningstar, Phys. Rev. Lett. 90 (2003) 161601.\n[6] M. Lüscher and P. Weisz, JHEP 0207 (2002) 049.\n[7] M. Caselle, M. Pepe, and A. Rago, JHEP 0410 (2004) 005.\n[8] M. Caselle, M. Hasenbusch, and M. Panero, JHEP 0603 (2006) 084.\n[9] N. D. Hari Dass and P. Majumdar, JHEP 0610 (2006) 020.\n[10] B. Bringoltz and M. Teper, Phys. Lett. B663 (2008) 429.\n[11] A. Athenodorou, B. Bringoltz, and M. Teper, JHEP 0905 (2009) 019.\n[12] B. B. Brandt and P. Majumdar, Phys. Lett. B682 (2009) 253.\n[13] M. Lüscher, G. Münster, and P. Weisz, Nucl. Phys. B180 (1981) 1.\n[14] M. Caselle, F. Gliozzi, U. Magnea, and S. Vinti, Nucl. Phys. B460 (1996) 397.\n[15] P. Giudice, F. Gliozzi, and S. Lottini, JHEP 0701 (2007) 084.\n[16] G. Bali, K. Schilling, and C. Schlichter, Phys. Rev. D51 (1995) 5165.\n[17] M. Lüscher and P. Weisz, JHEP 0109 (2001) 010.\n[18] F. Gliozzi, M. Pepe, and U.-J. Wiese, Phys. Rev. Lett. 104 (2010) 232001.\n[19] A. Athenodorou, B. Bringoltz, and M. Teper, Phys. Lett. B656 (2007) 132.\n[20] P. Bialas, L. Daniel, A. Morel, and B. Petersson, Nucl. Phys. B836 (2010) 91.\n[21] A. Allais and M. Caselle, JHEP 0901 (2009) 073.\n[22] M. Caselle, arXiv:1004.3875 [hep-lat].\n[23] A. S. Bakry, D. B. Leinweber, P. J. Moran, A. Sternbeck, and A. G. Williams,\narXiv:1004.0782 [hep-lat].\n[24] F. Gliozzi, M. Pepe, and U.-J. Wiese, arXiv:1006.2252 [hep-lat].\n[25] M. Lüscher and P. Weisz, JHEP 0407 (2004) 014.\n\n–9–\n\n\f[26] O. Aharony and E. Karzbrun, JHEP 0906 (2009) 012.\n[27] O. Aharony and M. Field, arXiv:1008.2636 [hep-th].\n[28] O. Aharony and N. Klinghoffer, arXiv:1008.2648 [hep-th].\n[29] K. Dietz and T. Filk, Phys. Rev. D27 (1983) 2944.\n[30] R. Sommer, Nucl. Phys. B411 (1994) 839.\n\n– 10 –\n\n\f"}