{"id": "http://arxiv.org/abs/0906.3031v2", "guidislink": true, "updated": "2009-06-21T14:56:57Z", "updated_parsed": [2009, 6, 21, 14, 56, 57, 6, 172, 0], "published": "2009-06-16T21:00:43Z", "published_parsed": [2009, 6, 16, 21, 0, 43, 1, 167, 0], "title": "Water maser detections in southern candidates to post-AGB stars and\n  Planetary Nebulae", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0906.2450%2C0906.1715%2C0906.5334%2C0906.5461%2C0906.2836%2C0906.0747%2C0906.1775%2C0906.5468%2C0906.3818%2C0906.4096%2C0906.3823%2C0906.1750%2C0906.4775%2C0906.3031%2C0906.4133%2C0906.5209%2C0906.1227%2C0906.4793%2C0906.5469%2C0906.2931%2C0906.5090%2C0906.1930%2C0906.0632%2C0906.3446%2C0906.0060%2C0906.3379%2C0906.0883%2C0906.2198%2C0906.1512%2C0906.1196%2C0906.4300%2C0906.0162%2C0906.2589%2C0906.2827%2C0906.3643%2C0906.3339%2C0906.0180%2C0906.4326%2C0906.2169%2C0906.4766%2C0906.1809%2C0906.0174%2C0906.1324%2C0906.4408%2C0906.0364%2C0906.1893%2C0906.2402%2C0906.0844%2C0906.2610%2C0906.4705%2C0906.4578%2C0906.1602%2C0906.0164%2C0906.3292%2C0906.0725%2C0906.3795%2C0906.1253%2C0906.5502%2C0906.2901%2C0906.2725%2C0906.0880%2C0906.4636%2C0906.5554%2C0906.3295%2C0906.4008%2C0906.1258%2C0906.2767%2C0906.0200%2C0906.1734%2C0906.1799%2C0906.5256%2C0906.2475%2C0906.4545%2C0906.1373%2C0906.5115%2C0906.3912%2C0906.4778%2C0906.3765%2C0906.5514%2C0906.3541%2C0906.3780%2C0906.2344%2C0906.3309%2C0906.3215%2C0906.0891%2C0906.3028%2C0906.1015%2C0906.2669%2C0906.1584%2C0906.0404%2C0906.4242%2C0906.3260%2C0906.2241%2C0906.3971%2C0906.5078%2C0906.5590%2C0906.4277%2C0906.4431%2C0906.0873%2C0906.5458%2C0906.3494&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Water maser detections in southern candidates to post-AGB stars and\n  Planetary Nebulae"}, "summary": "We intended to study the incidence and characteristics of water masers in the\nenvelopes of stars in the post-AGB and PN evolutionary stages.\n  We have used the 64-m antenna in Parkes (Australia) to search for water maser\nemission at 22 GHz, towards a sample of 74 sources with IRAS colours\ncharacteristic of post-AGB stars and PNe, at declination $< -32 \\deg$. In our\nsample, 39% of the sources are PNe or PNe candidates, and 50% are post-AGB\nstars or post-AGB candidates.\n  We have detected four new water masers, all of them in optically obscured\nsources: three in PNe candidates (IRAS 12405-6219, IRAS 15103-5754, and IRAS\n16333-4807); and one in a post-AGB candidate (IRAS 13500-6106). The PN\ncandidate IRAS 15103-5754 has water fountain characteristics, and it could be\nthe first PN of this class found.\n  We confirm the tendency suggested in Paper I that the presence of water\nmasers in the post-AGB phase is favoured in obscured sources with massive\nenvelopes. We propose an evolutionary scenario for water masers in the post-AGB\nand PNe stages, in which ``water fountain'' masers could develop during\npost-AGB and early PN stages. Later PNe would show lower velocity maser\nemission, both along jets and close to the central objects, with only the\ncentral masers remaining in more evolved PNe.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0906.2450%2C0906.1715%2C0906.5334%2C0906.5461%2C0906.2836%2C0906.0747%2C0906.1775%2C0906.5468%2C0906.3818%2C0906.4096%2C0906.3823%2C0906.1750%2C0906.4775%2C0906.3031%2C0906.4133%2C0906.5209%2C0906.1227%2C0906.4793%2C0906.5469%2C0906.2931%2C0906.5090%2C0906.1930%2C0906.0632%2C0906.3446%2C0906.0060%2C0906.3379%2C0906.0883%2C0906.2198%2C0906.1512%2C0906.1196%2C0906.4300%2C0906.0162%2C0906.2589%2C0906.2827%2C0906.3643%2C0906.3339%2C0906.0180%2C0906.4326%2C0906.2169%2C0906.4766%2C0906.1809%2C0906.0174%2C0906.1324%2C0906.4408%2C0906.0364%2C0906.1893%2C0906.2402%2C0906.0844%2C0906.2610%2C0906.4705%2C0906.4578%2C0906.1602%2C0906.0164%2C0906.3292%2C0906.0725%2C0906.3795%2C0906.1253%2C0906.5502%2C0906.2901%2C0906.2725%2C0906.0880%2C0906.4636%2C0906.5554%2C0906.3295%2C0906.4008%2C0906.1258%2C0906.2767%2C0906.0200%2C0906.1734%2C0906.1799%2C0906.5256%2C0906.2475%2C0906.4545%2C0906.1373%2C0906.5115%2C0906.3912%2C0906.4778%2C0906.3765%2C0906.5514%2C0906.3541%2C0906.3780%2C0906.2344%2C0906.3309%2C0906.3215%2C0906.0891%2C0906.3028%2C0906.1015%2C0906.2669%2C0906.1584%2C0906.0404%2C0906.4242%2C0906.3260%2C0906.2241%2C0906.3971%2C0906.5078%2C0906.5590%2C0906.4277%2C0906.4431%2C0906.0873%2C0906.5458%2C0906.3494&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We intended to study the incidence and characteristics of water masers in the\nenvelopes of stars in the post-AGB and PN evolutionary stages.\n  We have used the 64-m antenna in Parkes (Australia) to search for water maser\nemission at 22 GHz, towards a sample of 74 sources with IRAS colours\ncharacteristic of post-AGB stars and PNe, at declination $< -32 \\deg$. In our\nsample, 39% of the sources are PNe or PNe candidates, and 50% are post-AGB\nstars or post-AGB candidates.\n  We have detected four new water masers, all of them in optically obscured\nsources: three in PNe candidates (IRAS 12405-6219, IRAS 15103-5754, and IRAS\n16333-4807); and one in a post-AGB candidate (IRAS 13500-6106). The PN\ncandidate IRAS 15103-5754 has water fountain characteristics, and it could be\nthe first PN of this class found.\n  We confirm the tendency suggested in Paper I that the presence of water\nmasers in the post-AGB phase is favoured in obscured sources with massive\nenvelopes. We propose an evolutionary scenario for water masers in the post-AGB\nand PNe stages, in which ``water fountain'' masers could develop during\npost-AGB and early PN stages. Later PNe would show lower velocity maser\nemission, both along jets and close to the central objects, with only the\ncentral masers remaining in more evolved PNe."}, "authors": ["O. Suárez", "J. F. Gómez", "L. F. Miranda", "J. M. Torrelles", "Y. Gómez", "G. Anglada", "O. Morata"], "author_detail": {"name": "O. Morata"}, "author": "O. Morata", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1051/0004-6361/200911777", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0906.3031v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0906.3031v2", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "11 pages, 5 figures. Accepted by Astronomy and Astrophysics", "arxiv_primary_category": {"term": "astro-ph.SR", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph.SR", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0906.3031v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0906.3031v2", "journal_reference": null, "doi": "10.1051/0004-6361/200911777", "fulltext": "c ESO 2018\n\nAstronomy & Astrophysics manuscript no. astroph\nSeptember 2, 2018\n\nWater maser detections in southern candidates to post-AGB stars\nand Planetary Nebulae\n\narXiv:0906.3031v2 [astro-ph.SR] 21 Jun 2009\n\nO. Suárez1,2 , J.F. Gómez2 , L.F. Miranda2 , J.M. Torrelles3 , Y. Gómez4 , G. Anglada2 , and O. Morata5,6,7\n1\n2\n3\n4\n5\n6\n7\n\nUMR 6525 H.Fizeau, Université de Nice Sophia Antipolis, CNRS, OCA. Parc Valrose, F-06108 Nice Cedex 2, France.\nolga.suarez@unice.fr\nInstituto de Astrofı́sica de Andalucı́a, CSIC, Apartado 3004, E-18080 Granada, Spain\nInstituto de Ciencias de Espacio (CSIC)-IEEC, Facultat de Fı́sica, Planta 7a, Universitat de Barcelona, Martı́ i Franquès 1, 08028\nBarcelona, Spain\nCentro de Radioastronomı́a y Astrofı́sica, UNAM, Campus Morelia, Apdo. Postal 3-72, Morelia, Michoacán 58089, Mexico\nDepartment of Earth Sciences, National Taiwan Normal University, 88 Sec.4, Ting Chou Rd., Taipei 116, Taiwan\nAcademia Sinica Institute of Astronomy and Astrophysics, P.O. Box 23-141, Taipei 10617, Taiwan\nDepartament d'Astronomı́a i Meteorologı́a, Universitat de Barcelona, Martı́ i Franquès 1, 08028 Barcelona, Spain\n\nReceived ¡date¿/Accepted ¡date¿\nABSTRACT\n\nAims. We intended to study the incidence and characteristics of water masers in the envelopes of stars in the post-AGB and PN evolutionary stages.\nMethods. We have used the 64-m antenna in Parkes (Australia) to search for water maser emission at 22 GHz, towards a sample of\n74 sources with IRAS colours characteristic of post-AGB stars and PNe, at declination < −32o . In our sample, 39% of the sources are\nPNe or PNe candidates, and 50% are post-AGB stars or post-AGB candidates.\nResults. We have detected four new water masers, all of them in optically obscured sources: three in PNe candidates (IRAS\n12405−6219, IRAS 15103−5754, and IRAS 16333−4807) and one in a post-AGB candidate (IRAS 13500−6106). The PN candidate IRAS 15103−5754 has water fountain characteristics, and it could be the first PN of this class found.\nConclusions. We confirm the tendency suggested in Paper I that the presence of water masers during the post-AGB phase is favoured\nin obscured sources with massive envelopes, in comparison with objects with optical counterparts in these phases. We propose an\nevolutionary scenario for water masers in the post-AGB and PNe stages, in which \"water fountain\" masers could develop during\npost-AGB and early PN stages. Later PNe would show lower velocity maser emission, both along jets and close to the central objects,\nwith only the central masers remaining in more evolved PNe.\nKey words. Masers – Surveys – Stars: AGB and post-AGB – Stars: Mass-loss – Planetary Nebulae\n\n1. Introduction\nThe study of H2 O masers in evolved stars has been proved to\nbe a very powerful tool to understand the evolution and shaping of sources between the Asymptotic Giant Branch (AGB)\nand the phase of Planetary Nebula (PN). About 80% of the\nstars (those with M≤8M⊙) go through these evolutionary stages,\nwhere a dramatic change in their morphology is produced. The\nstars in the AGB stage have a high mass-loss rate, that can reach\n≃ 10−4 M⊙ yr−1 . This mass-loss is usually spherical, although\nthe first manifestations of asymmetry are already observed in\nsome of them (see for example Leão et al. 2006; Josselin et al.\n2000). A large fraction of PNe show, however, axial symmetries\nwith bipolar or multipolar morphologies and, in many cases, jets\n(Sahai et al. 2007).\nWater maser emission is frequently present in the AGB stage,\nwith the spectra showing double-peak emission in some cases\n(e.g., Engels et al. 1986), similar to those of OH masers in this\ntype of sources, which are characteristic of an spherical envelope expanding at velocities ∼10−30 km s−1 (Reid et al. 1977;\nBowers et al. 1989). In AGB stars, we can also find SiO maser\nemission, and the three species are distributed in such a way that\nSiO masers are located close to the central star (∼10 AU), H2 O\nSend offprint requests to: O. Suárez\n\nare located at the inner part of the envelope (between 10 and 100\nAU) and OH masers at distances > 103 AU from the central star\n(Reid & Moran 1981).\nIn the classical view of maser emission pumped by spherical\nAGB winds, SiO masers are expected to survive only ≃ 10 yr\nafter the stop of the strong mass-loss, while H2 O and OH masers\nwill be extinguished after ≃ 100 yr and ≃ 1000 yr, respectively\n(Lewis 1989; Gómez et al. 1990). These timescales imply that in\nthe post-AGB stage we can still find some objects that harbour\nwater masers with the same characteristics of those found in the\nAGB stage (see for example Engels 2002). On the other hand,\nwater maser emission was not expected in PNe.\nThere are cases, however, of evolved sources in which the\nobserved water maser emission departs from this pattern expected from spherical mass-loss. In several post-AGB stars,\ncalled \"water fountains\", the H2 O maser emission traces highly\n−1\ncollimated bipolar jets with a velocity spread >\n∼ 100 km s ,\nand dynamical ages <\n100\nyr\n(Imai\n2007),\nin\nwhat\ncould\n∼\nrepresent the first manifestation of collimated mass-loss in\nevolved stars. Moreover, now we know of three confirmed\ncases of PNe harbouring water masers (Miranda et al. 2001;\nde Gregorio-Monsalvo et al. 2004; Gómez et al. 2008). These\nthree \"H2 O-PNe\" have in common a bipolar morphology, sug-\n\n\f2\n\nO. Suárez et al.: Water maser detections in southern candidates to post-AGB stars and Planetary Nebulae\n\ngesting that the asymmetrical mass loss can be related to the\npresence of water masers in PNe.\nIn order to study the possible relationships between the evolutionary stage of evolved objects and the presence of water\nmasers, Suárez et al. (2007) (hereafter Paper I) carried out a\nsingle-dish survey for H2 O maser emission towards the evolved\nsources in the catalogue of Suárez et al. (2006) (hereafter SGM)\nthat were located north of declination −32o . A total of 105\nsources were searched with the Robledo 70m antenna, with\nfive detections, four of them reported in that paper for the first\ntime. Three of these detections were found in obscured sources,\nof which one was a water fountain (confirmed by Suárez et al.\n2008) and another one a PN candidate. These results led to suggest that the presence of water masers in the post-AGB and PN\nphases is favoured in stars with massive envelopes, and that PNe\nharbouring water masers are a special class of massive, rapidly\nevolving PNe. Water masers in these sources would be related to\nprocesses of non-spherical mass-loss, rather than being the remnant of water masers pumped by spherical winds in the AGB\nstage. In Paper I it was also suggested that probably all H2 OPNe had traversed previously by a water fountain phase (see\nalso Gómez et al. 2008). The discovery of objects showing both\nwater fountain and PNe characteristics would be an important\nevidence of this evolutionary path.\nIn this paper we present the continuation of the work started\nin Paper I, with single-dish observations of sources in the SGM\ncatalogue with declination ≤ −32o , using the Parkes antenna.\nThis paper is structured as follows: In Sec. 2 we present the sample of observed sources. In Sec. 3 we describe the observations\nperformed. In Sec. 4 we describe the results obtained, including\na description of the detected objects. In Sec. 5 we discuss our\nresults and finally, in Sec. 6 we give the main conclusions of this\nwork.\n\n2. Description of the source sample\nThe selection criteria are described in detail in Paper I and in\nSGM. Briefly, the SGM atlas is composed of IRAS sources located in the region of the IRAS colour-colour diagram populated mainly by post-AGB stars (van der Veen et al. 1989). The\nsources in this region would have expanding envelopes characterised by a range of dust temperatures between 200 K and 80 K,\nand radii between 0.01 pc and 0.1 pc.\nThe evolved sources in the SGM catalogue are classified\nin five different groups: PN, post-AGB stars, transition sources\n(that are evolving between the post-AGB and PN phases), peculiar sources (evolved sources with peculiar characteristics), and\nobjects with no optical counterpart (which could be evolved objects in any of the stages mentioned above, but could no be classified with the optical spectroscopy presented in SGM).\nFor these objects with no optical counterpart found by SGM,\nwe can only give a tentative classification as \"post-AGB candidate\" or \"PN candidate\". We consider them candidates to PN\nwhen there is an indication of the ionisation of the envelope, such\nas the presence of radio continum emission. In many cases, these\nPN candidates are merely point-like sources in infrared images,\nwith no further evidence of the presence of a nebula. When there\nis no indication of ionisation or nebulosity, we consider these\nobscured objects as post-AGB candidates. Obviously, further infrared observations are required to ascertain the true nature of\nthese objects without optical counterpart.\nThere are 106 evolved sources in the SGM catalogue located\nsouth of declination −32o , which are the focus of this paper.\n\nBy the time the observations described in Sec. 3 were performed, we became aware of the paper by Deacon et al. (2007),\nwho carried out a survey for water masers in post-AGB candidates with OH 1662 MHz maser emission. Their survey included 7 of the sources selected for our observations: IRAS\n14341−6211, IRAS 17088−4221, IRAS 17164−3226, IRAS\n17168−3736, IRAS 17245−3951, IRAS 17310−3432, IRAS\n17370−3357, with one water maser detection among them\n(IRAS 17088−4221). Therefore, these 7 sources were explicitly\nleft out of our observations, although we will include them in\nthe discussion of this paper (see Sec. 5), whenever appropriate,\nbecause they fulfil the criteria used to select the sample.\n\n3. Observations\nWe observed the 616 → 523 transition of the water molecule\n(rest frequency 22235.080 MHz), using the 64m antenna of the\nParkes Observatory1, on 2007 February 08-12. At this frequency,\nthe half-power beamwidth of the telescope is ≃ 1.′ 3. The 1.3 cm\nreceiver of this antenna comprises a cryogenic High Mobility\nElectron Transistor. Both right and left circular polarisation were\nobserved simultaneously. As a backend, we used the Multibeam\nCorrelator, covering a bandwidth of 64 MHz (i.e., velocity coverage ≃ 862.9 km s−1 ) with 2048 spectral channels for each\npolarisation, thus yielding a spectral resolution of 31.25 kHz\n(0.42 km s−1 ). Since little information about the radial velocity\nof these sources is available, all observed spectra were centred\nat vLSR = 0 km s−1 . The observations were taken in positionswitching mode with a total integration time (on+off) of 30 min.\nThe rms pointing accuracy of the telescope was ≃ 10′′ .\nTaking into account the detections found in Paper I, the priority of the observations was set (in decreasing order) as: optically\nobscured sources, PNe, transition sources, and finally the postAGB stars. A total of 74 objects out of the 106 target sources\nwere observed. Table 1 gives the list of observed objects. The\ntarget coordinates were taken from SGM, who list 2MASS positions when a near-IR counterpart of the IRAS sources was identified. When SGM does not provide these improved coordinates,\nwe used those in the IRAS Point Source Catalog. The observed\nsources are divided in the following categories, according to the\nclassification in SGM:\n–\n–\n–\n–\n\n23 PNe with optical counterpart\n8 transition objects with optical counterpart\n15 post-AGB stars with optical counterpart\n28 sources without optical counterpart (6 PNe candidates, 22\npost-AGB candidates)\n\nThese 74 sources plus the 7 objects observed by\nDeacon et al. (2007) (1 PN and 4 post-AGB stars with optical\ncounterpart, and 2 post-AGB candidates without optical counterpart) comprised all objects without optical counterpart as well as\nall PNe and transition objects with optical counterpart included\nin the selected sample of 106 sources from SGM.\n\n4. Results\nOur results are summarised in Table 1, where we list all the observed sources, and Table 2, where we give the parameters of the\ndetections obtained. Four water masers were found during these\n1\n\nThe Parkes telescope is part of the Australia Telescope, which is\nfunded by the Commonwealth of Australia for operation as a National\nFacility managed by CSIRO\n\n\fO. Suárez et al.: Water maser detections in southern candidates to post-AGB stars and Planetary Nebulae\n\n3\n\nFig. 1. Water maser spectra of the detected sources. The numbers shown at the upper left of the graph correspond to the day of\nobservation, in 2007 February.\nobservations, all of them reported here for the first time: IRAS\n12405−6219, IRAS 13500−6106, IRAS 15103−5754, and IRAS\n16333−4807. Their spectra are shown in Figs. 1 and 2. All of\nthem correspond to objects classified as \"sources without optical counterpart\" by SGM.\nThe sources IRAS 12405−6219, IRAS 15103−5754,\nand IRAS 16333−4807 have been classified by\nvan de Steene & Pottasch (1993) as PN candidates due to the\npresence of radio continuum emission, while IRAS 13500−6106\nhas been classified as a post-AGB star by Garcı́a-Lario et al.\n(1997), based on its position in the IRAS two-colour diagram\nand on its low IRAS variability index (v=29).\nThe association of the discovered water masers towards\nIRAS 12405−6219, IRAS 15103−5754 and IRAS 16333−4807\nwith the radio continuum detected by van de Steene & Pottasch\n\n(1993) should be carefully studied. The beam of our water maser\nobservations is 1.′ 3, while that of the radio continuum observations is 4.′′ 5. An unambiguous identification of the water maser\nemission with the radio continuum sources requires higher angular resolution observations of the water masers to derive a more\naccurate position (see, e.g., Gómez et al. 2008).\n\nIn the following we will describe in detail the four detected\nobjects and comment on their nature. In order to identify possible candidates to the maser-exciting source, we have also inspected MSX and 2MASS data.\n\n\f4\n\nO. Suárez et al.: Water maser detections in southern candidates to post-AGB stars and Planetary Nebulae\n\nFig. 2. Close up view of the water maser spectrum taken on 2007\nFebruary 9 toward the PN candidate IRAS 15103-5754.\n\n4.1. Detected sources\n4.1.1. IRAS 12405−6219\n\nWe detected water maser emission with a single spectral component at VLSR ≃ −23.6 km s−1 and a flux density of\n∼1 Jy (Fig. 1 and Table 2). A source of continuum emission\nat 6 cm was detected by van de Steene & Pottasch (1993) at\nR.A.(J2000)=12h43m 32.04 s, Dec.(J2000)=−62o36′ 13.9′′ , with\na flux density S (6cm) = 14 mJy. This radio source is located\n6′′ from the IRAS nominal position.\nThere is only one MSX source in the beam of the water\nmaser observations. This source (MSX6C G302.0213+00.2542)\nis located ∼ 6′′ from the reported radio continuum position, and\nis coincident with the 2MASS source J12433151-6236135. We\ncan consider that the radio continuum is associated with the IR\nsource within the errors. The water maser position is also probably associated with this source.\nAlthough van de Steene & Pottasch (1993) classify it as\na possible PN, this source also fulfils the criteria used by\nHughes & MacLeod (1989) to select HII regions from the IRAS\nPoint Source Catalogue (log S60μm /log S25μm ≥ 0.25 and\nlog S25μm /log S12μm ≥ 0.4). We will thus maintain its classification as PN as doubtful.\n\nintensity of the components shows significant variability (up to\na factor of ≃ 3) in the spectra taken on two different days.\nThe\nradio\ncontinuum\nsource\nreported\nby\nvan de Steene & Pottasch\n(1993)\nis\nlocated\nat\nR.A.(J2000)=15h14m 18.53 s,\nDec.(J2000)=−58o05′ 21.1′′ ,\ni.e., 15′′ from the IRAS nominal position, with a flux density\nS (6cm) = 115 mJy. OH maser emission at 1612 MHz has\nbeen detected in this source (Te Lintel Hekkert & Chapman\n1996) at VLSR ≃ −47 km s−1 with a flux density ∼0.3 Jy. The\nonly MSX source in the beam of our observations is MSX6C\nG320.9062-00.2928, that is coincident with the 2MASS source\nJ15141845-5805203 (within ∼ 1.′′ 2). The MSX source is also\ncoincident with the radio continuum position (within ∼ 1.′′ 4).\nThese results suggest that IRAS 15103−5754 as a very likely\nPN, associated with the mentioned IR sources.\nThe high velocity range found in the water maser components makes this source a new candidate to the water fountain\nclass. Moreover, if its classification as a PN and its association\nwith the water maser emission are confirmed, this source would\nbe the first PN showing water fountain characteristics. The existence of \"water fountain-PNe\" was suggested by Gómez et al.\n(2008). They discussed the possibility of finding a PN that would\nstill maintain the high-velocity water masers present during its\nprevious post-AGB−water fountain stage. These objects should\nbe among the youngest and more massive PNe known, and they\nwould be excellent targets to study the \"real-time\" evolution of\na PN, since the time scales of evolution of this type of sources\nwould be very short and can be studied by means of high angular\nresolution observations of the water masers.\n4.1.4. IRAS 16333−4807\n\nWe have detected water maser emission towards this source\n(see Fig. 1 and Table 2) with a maximum flux density\nof ∼1.9 Jy at VLSR ≃ 45 km s−1 . The radio continuum\nsource detected by van de Steene & Pottasch (1993) is located at\nR.A.(J2000)=16h37m 06.79 s, Dec.(J2000)=−48o13′ 42.6′′, displaced ≃ 7′′ from the IRAS nominal position, with a flux density\nS (6cm) = 32.5 mJy.\nThe only MSX source in the beam of our observations is\nMSX6C G336.6445-00.6953, that is coincident with the source\nfound by van de Steene & Pottasch (1993) (within ∼ 1.′′ 4) and\nwith the 2MASS source J16370659-4813429 (within ∼ 1.′′ 5).\nThe likely association of the radio continuum and IR sources\nmakes this object a plausible PN candidate.\n\n4.1.2. IRAS 13500−6106\n\nOur water maser spectrum shows one component with a maximum flux density of ∼ 1.5 Jy at VLSR ≃ 40.0 km s−1 (see\nFig. 1 and Table 2). This source was classified as a post-AGB\nstar by Garcı́a-Lario et al. (1997) based on its IR colours. The\nonly MSX source in the beam of the water maser observations\nis MSX6C G310.3099+00.6306, and there is no 2MASS source\nassociated with it. No OH has been detected in this source by\nTe Lintel Hekkert et al. (1991).\n4.1.3. IRAS 15103−5754\n\nWe have detected water maser emission with a maximum flux\ndensity of ∼60 Jy (Fig. 1 and Table 2). The spectrum shows a\nrich set of multiple components spanning ≃ 80 km s−1 , from\nVLSR ≃ −70 to +10 km s−1 . In Fig. 2 we show a close up view\nof the spectrum where we can see the weakest components. The\n\n4.2. Results from the two surveys for water masers in SGM\nsources\n\nThe 179 sources observed in both campaigns (Robledo [Paper I]\nand Parkes [this paper]) are distributed in evolutionary classes,\naccording to SGM, as follows:\n–\n–\n–\n–\n\n76 post-AGB stars with optical counterpart (42%)\n21 transition sources (12%)\n35 PN with optical counterpart (20%)\n47 sources without optical counterpart (2 HII regions, 35\npost-AGB candidates, 10 PN candidates) (26%)\nAnd the detections have been found towards:\n\n– 1 post-AGB\n07331+0021\n\nstar\n\nwith\n\noptical\n\ncounterpart:\n\nIRAS\n\n\fO. Suárez et al.: Water maser detections in southern candidates to post-AGB stars and Planetary Nebulae\n\n5\n\n– 3 post-AGB candidates without optical counterpart, one of\nthem a \"water fountain\": IRAS 16552−3050 (water fountain), IRAS 13500−6106, and IRAS 17580−3111.\n– 1 confirmed PN with optical counterpart: IRAS\n18061−2505.\n– 3 PNe candidates without optical counterpart, one of them\na possible \"water fountain PN\": IRAS 12405−6219, IRAS\n15103−5754 (water fountain PN candidate), and IRAS\n16333−4807.\n– 1 AGB star without optical counterpart (OH/IR): IRAS\n17443−2949\n\nWe note that IRAS 17580−3111 and IRAS 17443−2949\nwere initially classified as obscured PNe with OH emission\n(OHPN) by Zijlstra et al. (1989), and as such were cited in\nSuárez et al. (2007), but Gómez et al. (2008) showed that the\nradio continuum reported by Ratag et al. (1990) was not associated with these sources, and Garcı́a-Hernández et al. (2007)\nclassified them as post-AGB and AGB stars respectively. We will\nadopt the classification of Garcı́a-Hernández et al. (2007) for the\ndiscussion.\nIn summary, out of the nine detected sources, only one turned\nout to be a \"classical\" post-AGB star with an optical counterpart.\nThe rest of the possible post-AGB stars in wich H2 O emission\nwas found do not have a counterpart in the visible domain. The\nfact that these stars could already be in the post-AGB stage while\nstill having a thick envelope that prevents their detection in the\noptical, suggests that they are relatively massive stars that have\nquickly evolved from the AGB. The new detections found in this\ncampaign confirm the trend already found in Paper I, relating the\npresence of water masers in post-AGB stars or PN to optically\nobscured sources.\nApparently, the incidence of water maser emission during\nthe post-AGB phase is higher in obscured objects, i.e. those with\nmore massive envelopes. Of the 80 visible post-AGB stars observed, only 1 turned out to have water maser emission (∼1%),\nwhile we have found this emission in 4 out of 35 post-AGB star\ncandidates, without optical counterpart (∼11%). This suggests\nthat the presence of massive envelopes favour the pumping of\nwater masers during the post-AGB stage. Morever, our water\nmaser detections towards three obscured PN candidates might\nsuggest a similar trend during the PN phase. The detection of\ndense molecular gas toward an H2 O-PN (Tafoya et al. 2007) also\nsupports the existence of massive envelopes in these objects.\nThe two most interesting results of our two surveys are, on\none hand, the detection of several new possible PNe with water maser emission (three candidates found in this paper), and\non the other hand, the possibility of having found the first \"water fountain-PN\". In fact, if the association of the water masers\nwith the reported radio continuum emission is confirmed in\nthe three candidates found in this paper (IRAS 12405−6219,\nIRAS 15103−5754, and IRAS 16333−4807), the number of PNe\nknown to harbour water maser emission would increase from 3\nto 6. We expect these new H2 O-PNe to be bipolar, as is the case\nfor the other three known to belong to this group. High resolution studies of these objects would be necessary to confirm this\nhypothesis. Furthermore, the confirmation of IRAS 15103−5754\nas the first \"water fountain-PN\" would lead us into a new class\nof objects susceptible of being one of the youngest and more\nmassive PNe known.\n\nFig. 3. IRAS two colour diagram with the position of the observed and detected sources in the Parkes survey. The solid line\nis the curve modelled by Bedijn (1987) showing the position of\nthe AGB stars.\n\n5. Discussion\nThe original purpose of this work was to study the connection\nbetween the presence of water masers and the evolution of the\nstars in the post-AGB stage. This was the reason why the objects\nto be observed were selected from the SGM catalogue, since this\ncatalogue contains the largest number of post-AGB stars with\nspectroscopic classification compiled to date. However, as mentioned in Paper I, we have to be careful in deriving conclusions\nfrom the H2 O maser detection rate obtained in objects without\noptical counterpart, since the SGM catalogue is incomplete for\noptically obscured sources. However, the fact that only 26% of\nthe total sample was composed of obscured objects, but 78% of\nthe detections have been found in such sources, strongly suggests that the presence of massive envelopes favour the pumping\nof water masers in the post-AGB or PN stages.\n5.1. Position of the detected sources in the IRAS and MSX\ncolour-colour diagram\n\nIn order to study the evolutionary status of the sources associated\nwith water masers, we plotted them in the IRAS [12]-[25] vs\n[25]-[60] diagram and in the MSX [8]-[12] vs [15]-[21] diagram.\nFig. 3 shows the position in the IRAS two-colour diagram\nof all the 74 sources observed in this paper. We use different\nsymbols for the different types of sources and we also mark\nthose objects where water masers have been found. In Fig. 4\nwe show the position in the IRAS two-colour diagram of the 9\nsources with water masers detected in both surveys (Robledo\nand Parkes). We also include the post-AGB candidate IRAS\n17088−4221, detected by Deacon et al. (2007) and, for completeness, we also include the position of the other two H2 OPN: IRAS 17347−3139 (de Gregorio-Monsalvo et al. 2004) and\nK3−35 (Miranda et al. 2001). In this figure, we have used the\nsame symbol for confirmed and candidate water-maser-emitting\nPNe, and analogously for confirmed and candidate post-AGB\nstars.\n\n\f6\n\nO. Suárez et al.: Water maser detections in southern candidates to post-AGB stars and Planetary Nebulae\n\nFig. 4. IRAS two colour diagram with the position of the\ndetected sources in both campaigns (Robledo and Parkes detections). We have also included the position of the other\ntwo H2 O-PN known (IRAS 17347−3139, and K3−35), and\nof IRAS 17088−4221. The sources detected in the present\ncampaign are shown with the IRAS names, while the rest\nof the sources are identified by labels that correspond\nto: a. IRAS 07331+0021, b. IRAS 16552−3050, c. IRAS\n17088−4221, d. IRAS 17347−3139, e. IRAS 17443−2949, f.\nIRAS 17580−3111, g. IRAS 18061−2505 h. K3−35. The solid\nline is the curve modelled by Bedijn (1987) showing the position\nof the AGB stars. Note that in this figure, we are using the same\nsymbols for confirmed and candidate sources in each stage.\n\nThere seems to be a trend in Fig. 4, with confirmed and candidate H2 O-PNe having a larger value of [25]-[60] colour than\nwater-maser-emitting post-AGB stars and candidates. However,\na confirmation of this trend will require a more complete sample, specially for optically obscured evolved stars and, of course,\na conclusive determination of the association of masers with the\ncandidate objects, and of the true nature of these.\nIn Fig. 5 we show the position in the [8]−[12] vs [15]−[21]\nMSX two-colour diagram of all the detections in both surveys\nthat have been observed with the MSX satellite (all but IRAS\n07331+0021 and IRAS 16552−3050), plus of the other two\nH2 O-PNe and the post-AGB candidate IRAS 17088−4221. This\ndiagram has been divided in four quadrants (QI, QII, QIII, QIV)\nby Sevenster (2002) in her study of the position of OH-maseremitting AGB and post-AGB sources. The four quadrants correspond to the position of classical AGB stars (QIII, low left), early\npost-AGB stars (QIV, low right), more evolved objects (QI, up\nright), and star forming regions (QII, up left).\nAlthough the defined quadrants give only a tentative classification of the sources located in each of them (e.g., we can also\nfind post-AGB stars and PNe in QII and QIII, see Suárez 2004),\nwe note that IRAS 17443−2949 is the only source that occupies\nits place in QIII, the AGB quadrant, which supports its identification by Garcı́a-Hernández et al. (2007) as an AGB star. All the\nPNe and PNe candidates are located in the region QI, occupied\nby evolved post-AGB and PNe, and the only objects located in\nthe region QIV (early post-AGB stars) are the post-AGB can-\n\nFig. 5. MSX two colour diagram with the position of the detected\nsources in both campaigns (Robledo and Parkes detections). We\nhave also included the position of the other two H2 O-PN known\n(IRAS 17347−3139 and K3−35), and of IRAS 17088−4221.\nThe symbols are the same as those defined in Fig. 4.\ndidates IRAS 13500−6106 and IRAS 17088−4221. Since there\nare no objects in QII, it is likely that none of our detections is\na star-forming region, even if we maintain our doubts in the PN\nnature of IRAS 12405−6219.\n5.2. Evolutionary consequences of the presence of water\nmasers in post-AGB stars and PNe\n\nAs was already stated in Lewis (1989) and Gómez et al. (1990),\nthe conditions of H2 O maser pumping in the AGB phase can\ncontinue during the post-AGB stage for at most ∼100 yr in the\ncase of a spherical mass-loss. Therefore, this time scale indicates that most H2 O masers found in post-AGB stars are probably originated during this phase.\nAs it was suggested in Paper I and in Gómez et al. (2008),\nthe presence of asymmetrical mass-loss in the post-AGB stage\ncan favour the necessary conditions to pump water masers in\nthis phase and in that of PN. This is independent of the previous presence or not of these masers during the AGB phase, as\nit is the case of the water fountains, such as IRAS 16552−3050\n(Suárez et al. 2008), first detected in Paper I. If the three new\nobscured PNe candidates found to harbour water masers in this\npaper turn out to have bipolar morphologies, as the other three\nH2 O-PNe known, it will help to support the suggestion made in\nPaper I and in Gómez et al. (2008) relating the presence of water\nmasers in the PN stage (the H2 O-PNe) to the phenomenon of the\nwater fountains. Moreover, the discovery in this survey of the PN\ncandidate IRAS 15103−5754 that shows \"water fountain\" characteristics would be an excellent evidence of the adequacy of the\nevolutionary model proposed, since its existence was predicted\nin Gómez et al. (2008). This source, if definitively confirmed as\na \"water fountain-PN\", would be the missing link between the\n\"water fountains\" and the H2 O-PNe.\nA proposed scenario for the maser emission in the \"water\nfountains\" (Imai et al. 2007) suggests that after the water fountain is formed, the bipolar jets that harbour the water masers will\nreach the region of the former AGB envelope where the density would not be high enough to maintain the pumping of the\nmasers. However, as discussed in Gómez et al. (2008), the re-\n\n\fO. Suárez et al.: Water maser detections in southern candidates to post-AGB stars and Planetary Nebulae\n\ngions close to the equator of the star, could still fulfil the adequate conditions to pump the water masers, even when the central star has reached enough temperature to become a PN. If the\nstar is massive enough to evolve rapidly through these stages,\nwe still could see the water fountain when it has reached the PN\nstage. This could be the case of IRAS 15103−5754, if high resolution observations confirm that the high velocity maser components arise from bipolar jets.\nK3−35 would be in the next stage, in which the jets would\nhave been slowed down before the quenching of the water\nmasers in the lobes of the PN. The rest of the H2 O-PNe detected\nup to now would correspond to the final stage when the masers\nare only pumped in dense areas close to the central stars.\nFollowing the discussion in Gómez et al. (2008), we suggest\na tentative scenario and characteristics for the evolution of the\nwater masers in the post-AGB and PN stages:\n– Post-AGB stars with water maser emission that does not\ntrace high velocity jets (e.g. IRAS 07331+0021). In a few\ncases, this maser emission might be the remnant of the one\npumped during the AGB. In others, however, the emission\ncould have been originated during the post-AGB phase itself,\nbut the source characteristics do not favor maser amplification in jets, or do not even allow the formation of a jet.\n– Post-AGB stars that show water fountain characteristics (e.g.\nIRAS 16552−3050; 11 sources known, 9 of them obscured\nin the optical).\n– Young bipolar PN with water fountain characteristics (e.g.\nIRAS 15103−5754; this is the only candidate known up to\nnow and it is obscured in the optical range).\n– Young bipolar PN showing water masers at the tips of the\nbipolar lobes and at close to the central star (e.g. PN K3−35;\nthis is the only source that has shown in one epoch these\ncharacteristics).\n– Young bipolar PN showing water masers only close to the\ncentral star (e.g. IRAS 18061−2505; 2 sources known, one\nof them without optical counterpart, and 2 candidates also\nobscured in the optical).\nWhile this scenario could be valid in general, we note that\ngeometrical effects could introduce some caveats when trying to\nfit a particular object into it. For instance, the orientation of the\nobject with respect to the observer affects the observational appearance of its maser emission. A source with a jet of the \"water\nfountain\" type would never show up the typical high-velocities\nif the jet is close to the plane of the sky.\nIn view of the limited number of objects in each of the proposed stages, it is evident that greater efforts should be done to\nfind obscured evolved objects harbouring water masers. The possibility of finding among them new \"water fountains\" (post-AGB\nor PN) or new H2 O-PNe seems to be higher for obscured objects\nand these studies would contribute to confirm or reject the proposed evolutionary scenario, and to constraint the time spent by\nthe stars in each stage.\n\n6. Conclusions\nWe have performed a survey for water masers in a sample of\n74 evolved stars selected from the SGM atlas, using the Parkes\n64-m antenna.\nWe have found four new detections of water masers, three\nof them in obscured PNe candidates: IRAS 12405−6219, IRAS\n15103−5754, and IRAS 16333−4807; and one in an obscured\n\n7\n\npost-AGB candidate: IRAS 13500−6106. This could increase\nthe number of H2 O-PN known from three to six.\nOne of the PN candidates where water masers have been\nfound, IRAS 15103−5754, has also characteristics of a water\nfountain. If its PN nature and its association with water maser\nemission is confirmed, it would be the first known case of a \"water fountain\" PN.\nWe propose an evolutionary scenario for water masers in the\npost-AGB and PNe stages, in which we try to accommodate all\nthe detections in our survey. After a period in which a post-AGB\nstar could maintain the remaining of the water masers pumped\nduring the AGB, some of them develop water fountain characteristics. The \"water fountain\" masers could still be present in very\nyoung bipolar PNe. Later in the PN stage, lower-velocity water\nmasers would be first present both along jets and close to the\ncentral object, with only the central masers remaining in more\nevolved PNe.\nIn this proposed scenario for the evolution of the water\nmasers in the post-AGB and PN stages, IRAS 15103−5754\ncould represent the \"missing link\" between water fountains and\nH2 O-PNe.\nWe confirm the tendency suggested in Paper I that the presence of water masers is favoured in obscured sources with massive envelopes.\nAcknowledgements. We would like to thank our referee, Dr. Dieter Engels, for\nhis careful and useful review. O.S., J.F.G., J.M.T., and G.A. are partially supported by Ministerio de Ciencia e Innovación, grants AYA2008-06189-C03 and\nAYA2005-08523-C03 (co-funded with FEDER funds). O.S. and L.F.M. are partially supported by Ministerio de Ciencia e Innovación, grant AYA2008-01934.\nO.S., J.F.G., L.F.M., J.M.T., and G.A. also acknowledge support from Consejerı́a\nde Innovación, Ciencia y Empresa of Junta de Andalucı́a. This publication makes\nuse of data products from the Two Micron All Sky Survey, which is a joint project\nof the University of Massachusetts and the Infrared Processing and Analysis\nCenter/California Institute of Technology, funded by the National Aeronautics\nand Space Administration and the National Science Foundation.\n\nReferences\nBedijn, P. J. 1987, A&A, 186, 136\nBowers, P. F., Johnston, K. J., & de Vegt, C. 1989, ApJ, 340, 479\nde Gregorio-Monsalvo, I., Gómez, Y., Anglada, G., et al. 2004, ApJ, 601, 921\nDeacon, R. M., Chapman, J. M., Green, A. J., & Sevenster, M. N. 2007, ApJ,\n658, 1096\nEngels, D. 2002, A&A, 388, 252\nEngels, D., Schmid-Burgk, J., & Walmsley, C. M. 1986, A&A, 167, 129\nGarcı́a-Lario, P., Manchado, A., Pych, W., & Pottasch, S. R. 1997, A&AS, 126,\n479\nGarcı́a-Hernández, D. A., Perea-Calderón, J. V., Bobrowsky, M., & Garcı́aLario, P. 2007, ApJ, 666, L33\nGómez, J. F., Suárez, O., Gómez, Y., et al. 2008, AJ, 135, 2074\nGómez, Y., Moran, J. M., & Rodrı́guez, L. F. 1990, Revista Mexicana de\nAstronomia y Astrofisica, 20, 55\nHughes, V. A. & MacLeod, G. C. 1989, AJ, 97, 786\nImai, H. 2007, Astrophysical Masers and their Environments (IAU Symp. 242),\ned. W. Baan & J. Chapman (Cambridge: Cambridge Univ. Press), 279\nImai, H., Sahai, R., & Morris, M. 2007, ApJ, 669, 424\nJosselin, E., Mauron, N., Planesas, P., & Bachiller, R. 2000, A&A, 362, 255\nLeão, I. C., de Laverny, P., Mékarnia, D., de Medeiros, J. R., & Vandame, B.\n2006, A&A, 455, 187\nLewis, B. M. 1989, ApJ, 338, 234\nMiranda, L. F., Gómez, Y., Anglada, G., & Torrelles, J. M. 2001, Nature, 414,\n284\nRatag, M. A., Pottasch, S. R., Zijlstra, A. A., & Menzies, J. 1990, A&A, 233,\n181\nReid, M. J. & Moran, J. M. 1981, ARA&A, 19, 231\nReid, M. J., Muhleman, D. O., Moran, J. M., Johnston, K. J., & Schwartz, P. R.\n1977, ApJ, 214, 60\nSahai, R., Morris, M., Sánchez Contreras, C., & Claussen, M. 2007, AJ, 134,\n2200\nSevenster, M. N. 2002, AJ, 123, 2772\nSuárez, O. 2004, PhD thesis, Universidad de Vigo, Spain\n\n\f8\n\nO. Suárez et al.: Water maser detections in southern candidates to post-AGB stars and Planetary Nebulae\n\nSuárez, O., Garcı́a-Lario, P., Manchado, A., et al. 2006, A&A, 458, 173. [Paper\nI]\nSuárez, O., Gómez, J. F., & Miranda, L. F. 2008, ApJ, 689, 430\nSuárez, O., Gómez, J. F., & Morata, O. 2007, A&A, 467, 1085\nTafoya, D., Gómez, Y., Anglada, G., et al. 2007, AJ, 133, 364\nTe Lintel Hekkert, P., Caswell, J. L., Habing, H. J., Haynes, R. F., & Norris, R. P.\n1991, A&AS, 90, 327\nTe Lintel Hekkert, P. & Chapman, J. M. 1996, A&AS, 119, 459\nvan de Steene, G. C. M. & Pottasch, S. R. 1993, A&A, 274, 895\nvan der Veen, W. E. C. J., Habing, H. J., & Geballe, T. R. 1989, A&A, 226, 108\nZijlstra, A. A., Te Lintel Hekkert, P., Pottasch, S. R., et al. 1989, A&A, 217, 157\n\n\fO. Suárez et al.: Water maser detections in southern candidates to post-AGB stars and Planetary Nebulae\n\n9\n\nTable 1. Table of observed sources. The first day of observation 2007-FEB-08 correspond to the Julian Date 2454139.5.\n\nIRAS name\n\nR.A. (J2000)\n\nDec. (J2000)\n\nObservation date\n\n07027-7934\n08046-3844\n08242-3828\n08281-4850\n08351-4634\n08355-4027\n08418-4843\n08574-5011\n09362-5413\n09370-4826\n09425-6040\n09500-5236\n09517-5438\n10029-5553\n10115-5640\n10178-5958\n10197-5750\n10215-5916\n10256-5628\n11201-6545\n11339-6004\n11353-6037\n11381-6401\n11387-6113\n11531-6111\n12145-5834\n12262-6417\n12302-6317\n12309-5928\n12316-6401\n12405-6219\n13203-5917\n13293-6000\n13356-6249\n13416-6243\n13427-6531\n13500-6106\n\n06:59:26.4\n08:06:28.4\n08:26:03.8\n08:29:40.6\n08:36:45.8\n08:37:24.7\n08:43:29.5\n08:59:02.3\n09:37:51.8\n09:38:53.3\n09:44:01.7\n09:51:49.2\n09:53:27.1\n10:04:40.1\n10:13:19.7\n10:19:32.5\n10:21:33.9\n10:23:19.5\n10:27:35.2\n11:22:18.9\n11:36:20.7\n11:37:42.9\n11:40:32.0\n11:41:08.7\n11:55:38.0\n12:17:16.1\n12:29:04.2\n12:33:07.0\n12:33:44.6\n12:34:36.0\n12:43:31.5\n13:23:32.2\n13:32:39.2\n13:39:05.8\n13:45:07.3\n13:46:25.7\n13:53:34.5\n\n-79:38:47\n-38:53:24\n-38:38:48\n-49:00:04\n-46:44:46\n-40:38:04\n-48:54:47\n-50:23:40\n-54:27:09\n-48:40:10\n-60:54:26\n-52:50:53\n-54:52:40\n-56:08:37\n-56:55:32\n-60:13:29\n-58:05:48\n-59:32:05\n-56:44:20\n-66:01:51\n-60:20:53\n-60:53:51\n-64:18:35\n-61:30:17\n-61:28:17\n-58:51:30\n-64:33:37\n-63:33:43\n-59:45:19\n-64:18:17\n-62:36:14\n-59:32:50\n-60:15:39\n-63:04:44\n-62:58:17\n-65:46:24\n-61:20:52\n\n13529-5934\n14079-6402\n14122-5947\n\n13:56:24.6\n14:11:46.3\n14:15:53.3\n\n-59:48:57\n-64:16:24\n-60:01:38\n\n14177-5824\n14345-5858\n14482-5725\n14488-5405\n15039-4806\n15066-5532\n15093-5732\n15103-5754\n\n14:21:19.9\n14:38:20.0\n14:51:57.3\n14:52:28.7\n15:07:27.4\n15:10:26.0\n15:13:12.4\n15:14:18.5\n\n-58:38:22\n-59:11:46\n-57:38:19\n-54:17:43\n-48:17:54\n-55:44:13\n-57:43:40\n-58:05:20\n\n15144-5812\n15154-5258\n15210-6554\n15534-5422\n15559-5546\n15579-5445\n16053-5528\n16114-4504\n16228-5014\n\n15:18:21.9\n15:19:08.2\n15:25:31.7\n15:57:21.1\n15:59:57.4\n16:01:50.8\n16:09:20.2\n16:15:03.0\n16:26:31.3\n\n-58:23:12\n-53:09:47\n-66:05:20\n-54:30:46\n-55:55:34\n-54:53:40\n-55:36:10\n-45:11:54\n-50:21:27\n\n2007-FEB-09\n2007-FEB-10\n2007-FEB-08\n2007-FEB-12\n2007-FEB-08\n2007-FEB-10\n2007-FEB-10\n2007-FEB-10\n2007-FEB-09\n2007-FEB-08\n2007-FEB-12\n2007-FEB-08\n2007-FEB-09\n2007-FEB-09\n2007-FEB-09\n2007-FEB-10\n2007-FEB-11\n2007-FEB-11\n2007-FEB-11\n2007-FEB-11\n2007-FEB-08\n2007-FEB-11\n2007-FEB-08\n2007-FEB-11\n2007-FEB-11\n2007-FEB-12\n2007-FEB-08\n2007-FEB-12\n2007-FEB-08\n2007-FEB-09\n2007-FEB-08\n2007-FEB-12\n2007-FEB-08\n2007-FEB-08\n2007-FEB-12\n2007-FEB-08\n2007-FEB-08\n2007-FEB-09\n2007-FEB-08\n2007-FEB-09\n2007-FEB-10\n2007-FEB-11\n2007-FEB-10\n2007-FEB-09\n2007-FEB-11\n2007-FEB-11\n2007-FEB-11\n2007-FEB-11\n2007-FEB-08\n2007-FEB-09\n2007-FEB-12\n2007-FEB-09\n2007-FEB-10\n2007-FEB-11\n2007-FEB-09\n2007-FEB-10\n2007-FEB-10\n2007-FEB-10\n2007-FEB-10\n2007-FEB-09\n\nrms (Jy)\n0.22\n0.19\n0.19\n0.21\n0.22\n0.20\n0.17\n0.17\n0.60\n0.25\n0.23\n0.22\n0.20\n0.21\n0.22\n0.17\n0.23\n0.25\n0.19\n0.20\n0.18\n0.22\n0.17\n0.22\n0.22\n0.24\n0.18\n0.23\n0.18\n0.23\n0.12\n0.24\n0.18\n0.20\n0.24\n0.20\n0.15\n0.23\n0.22\n0.22\n0.13\n0.22\n0.19\n0.22\n0.19\n0.20\n0.20\n0.20\n0.21\n0.24\n0.6\n0.22\n0.17\n0.19\n0.21\n0.18\n0.17\n0.17\n0.18\n0.22\n\nClassification\nSuárez et al. (2006)\nPN\nPN\nNo optical counterpart\nPost-AGB\nNo optical counterpart\nPN\nPN\nPN\nPN\nNo optical counterpart\nPost-AGB\nNo optical counterpart\nPN\nPN\nPN\nTransition\nTransition\nTransition\nPost-AGB\nPost-AGB\nNo optical counterpart\nTransition\nNo optical counterpart\nPost-AGB\nTransition\nPost-AGB\nNo optical counterpart\nPost-AGB\nNo optical counterpart\nPN\nNo optical counterpart\nPost-AGB\nNo optical counterpart\nNo optical counterpart\nPost-AGB\nNo optical counterpart\nNo optical counterpart\n\nNotes\n\n1\n\n2\n\nNo optical counterpart\nPN\nPN\nPN\nPN\nPost-AGB\nPost-AGB\nPost-AGB\nTransition\nNo optical counterpart\nNo optical counterpart\nPN\nPost-AGB\nNo optical counterpart\nPN\nPN\nPN\nPN\nNo optical counterpart\n\n2\n\n\f10\n\nO. Suárez et al.: Water maser detections in southern candidates to post-AGB stars and Planetary Nebulae\n\nTable 1. Observed sources (continued)\n\n1\n\nIRAS name\n\nR.A. (J2000)\n\nDec. (J2000)\n\nObservation date\n\n16333-4807\n16494-3930\n16518-3425\n16529-4341\n16584-3710\n16594-4656\n17009-4154\n17010-3810\n17088-4227\n17119-5926\n17130-4029\n17131-3330\n17153-3814\n17234-4008\n17311-4924\n17418-3335\n17476-4446\n\n16:37:06.1\n16:52:55.4\n16:55:08.4\n16:56:34.0\n17:01:52.1\n17:03:11.2\n17:04:29.6\n17:04:27.3\n17:12:21.8\n17:16:21.1\n17:16:29.0\n17:16:26.2\n17:18:44.7\n17:26:56.1\n17:35:02.5\n17:45:08.7\n17:51:16.4\n\n-48:13:42\n-39:34:56\n-34:30:10\n-43:46:15\n-37:14:54\n-47:00:21\n-41:58:39\n-38:14:42\n-42:30:50\n-59:29:23\n-40:32:31\n-33:33:24\n-38:17:21\n-40:11:04\n-49:26:26\n-33:36:06\n-44:47:29\n\n2007-FEB-09\n2007-FEB-10\n2007-FEB-09\n2007-FEB-10\n2007-FEB-09\n2007-FEB-10\n2007-FEB-09\n2007-FEB-09\n2007-FEB-10\n2007-FEB-10\n2007-FEB-09\n2007-FEB-10\n2007-FEB-09\n2007-FEB-09\n2007-FEB-10\n2007-FEB-09\n2007-FEB-10\n\nrms (Jy)\n0.20\n0.20\n0.23\n0.18\n0.21\n0.19\n0.22\n0.22\n0.18\n0.17\n0.20\n0.21\n0.21\n0.22\n0.18\n0.20\n0.19\n\nClassification\nSuárez et al. (2006)\nNo optical counterpart\nPost-AGB\nNo optical counterpart\nPN\nNo optical counterpart\nTransition\nNo optical counterpart\nNo optical counterpart\nPN\nPN\nNo optical counterpart\nPN\nNo optical counterpart\nNo optical counterpart\nTransition\nNo optical counterpart\nPost-AGB\n\nNotes\n2\n\n3\n3\n\nOH maser emission detected by Te Lintel Hekkert et al. (1991). The spectrum does not show the typical double-peaked profile of\nOH/IR stars, but presents multiple components. This suggest the source is a post-AGB star.\n2\nRadio continuum emission detected by van de Steene & Pottasch (1993). Thus, we consider this source as a \"PN candidate\".\n3\nRadio continuum emission detected by Ratag et al. (1990). Thus, we consider this source as a \"PN candidate\".\n\n\fO. Suárez et al.: Water maser detections in southern candidates to post-AGB stars and Planetary Nebulae\n\nTable 2. Water maser detections\nIRAS\n12405-6219\n13500-6106\n15103-5754\n16333-4807\n\nVpeak\n(km s−1 )\n−23.6 ± 0.4\n39.9 ± 0.4\n40.0 ± 0.4\n−35.8 ± 0.4\n−35.8 ± 0.4\n−42.2 ± 0.4\n\nS peak\n(Jy)\n0.94 ± 0.24\n0.8 ± 0.3\n1.6 ± 0.5\n60.3 ± 0.5\n36.7 ± 1.2\n1.8 ± 0.4\n\nR\n\nS ν dν\n(Jy km s−1 )\n1.5 ± 0.4\n1.2 ± 0.5\n0.9 ± 0.7\n179 ± 3\n95 ± 8\n3.5 ± 0.7\n\nDate\n2007-FEB-08\n2007-FEB-08\n2007-FEB-09\n2007-FEB-09\n2007-FEB-12\n2007-FEB-09\n\n11\n\n\f"}