{"id": "http://arxiv.org/abs/1106.0687v4", "guidislink": true, "updated": "2012-01-17T21:06:44Z", "updated_parsed": [2012, 1, 17, 21, 6, 44, 1, 17, 0], "published": "2011-06-03T15:29:53Z", "published_parsed": [2011, 6, 3, 15, 29, 53, 4, 154, 0], "title": "On the determination of anti-neutrino spectra from nuclear reactors", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1106.0074%2C1106.4923%2C1106.2631%2C1106.2412%2C1106.6120%2C1106.1071%2C1106.2703%2C1106.1288%2C1106.1181%2C1106.0509%2C1106.3128%2C1106.4840%2C1106.0753%2C1106.4939%2C1106.3867%2C1106.2225%2C1106.5228%2C1106.1426%2C1106.3076%2C1106.5029%2C1106.5346%2C1106.5737%2C1106.4884%2C1106.3808%2C1106.6245%2C1106.3189%2C1106.5295%2C1106.3251%2C1106.3917%2C1106.2262%2C1106.3018%2C1106.1093%2C1106.4350%2C1106.1855%2C1106.4145%2C1106.5590%2C1106.3831%2C1106.0856%2C1106.1444%2C1106.2264%2C1106.1711%2C1106.1378%2C1106.4008%2C1106.5322%2C1106.0758%2C1106.5085%2C1106.3574%2C1106.2117%2C1106.0439%2C1106.1999%2C1106.0718%2C1106.2162%2C1106.2981%2C1106.0713%2C1106.4868%2C1106.3507%2C1106.4036%2C1106.4347%2C1106.0316%2C1106.0687%2C1106.3907%2C1106.3746%2C1106.2157%2C1106.5473%2C1106.0790%2C1106.2000%2C1106.3513%2C1106.2425%2C1106.2460%2C1106.5027%2C1106.0560%2C1106.4848%2C1106.0157%2C1106.5673%2C1106.3075%2C1106.2882%2C1106.1185%2C1106.5113%2C1106.4403%2C1106.1507%2C1106.2089%2C1106.3259%2C1106.2681%2C1106.5047%2C1106.0521%2C1106.0858%2C1106.5192%2C1106.5643%2C1106.1262%2C1106.3308%2C1106.2178%2C1106.2238%2C1106.2380%2C1106.0185%2C1106.1959%2C1106.0306%2C1106.0750%2C1106.2720%2C1106.3265%2C1106.1143%2C1106.2217&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "On the determination of anti-neutrino spectra from nuclear reactors"}, "summary": "In this paper we study the effect of, well-known, higher order corrections to\nthe allowed beta decay spectrum on the determination of anti-neutrino spectra\nresulting from the decays of fission fragments. In particular, we try to\nestimate the associated theory errors and find that induced currents like weak\nmagnetism may ultimately limit our ability to improve the current accuracy and\nunder certain circumstance could even largely increase the theoretical errors.\nWe also perform a critical evaluation of the errors associated with our method\nto extract the anti-neutrino spectrum using synthetic beta spectra. It turns\nout, that a fit using only virtual beta branches with a judicious choice of the\neffective nuclear charge provides results with a minimal bias. We apply this\nmethod to actual data for U235, Pu239 and Pu241 and confirm, within errors,\nrecent results, which indicate a net 3% upward shift in energy averaged\nanti-neutrino fluxes. However, we also find significant shape differences which\ncan in principle be tested by high statistics anti-neutrino data samples.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1106.0074%2C1106.4923%2C1106.2631%2C1106.2412%2C1106.6120%2C1106.1071%2C1106.2703%2C1106.1288%2C1106.1181%2C1106.0509%2C1106.3128%2C1106.4840%2C1106.0753%2C1106.4939%2C1106.3867%2C1106.2225%2C1106.5228%2C1106.1426%2C1106.3076%2C1106.5029%2C1106.5346%2C1106.5737%2C1106.4884%2C1106.3808%2C1106.6245%2C1106.3189%2C1106.5295%2C1106.3251%2C1106.3917%2C1106.2262%2C1106.3018%2C1106.1093%2C1106.4350%2C1106.1855%2C1106.4145%2C1106.5590%2C1106.3831%2C1106.0856%2C1106.1444%2C1106.2264%2C1106.1711%2C1106.1378%2C1106.4008%2C1106.5322%2C1106.0758%2C1106.5085%2C1106.3574%2C1106.2117%2C1106.0439%2C1106.1999%2C1106.0718%2C1106.2162%2C1106.2981%2C1106.0713%2C1106.4868%2C1106.3507%2C1106.4036%2C1106.4347%2C1106.0316%2C1106.0687%2C1106.3907%2C1106.3746%2C1106.2157%2C1106.5473%2C1106.0790%2C1106.2000%2C1106.3513%2C1106.2425%2C1106.2460%2C1106.5027%2C1106.0560%2C1106.4848%2C1106.0157%2C1106.5673%2C1106.3075%2C1106.2882%2C1106.1185%2C1106.5113%2C1106.4403%2C1106.1507%2C1106.2089%2C1106.3259%2C1106.2681%2C1106.5047%2C1106.0521%2C1106.0858%2C1106.5192%2C1106.5643%2C1106.1262%2C1106.3308%2C1106.2178%2C1106.2238%2C1106.2380%2C1106.0185%2C1106.1959%2C1106.0306%2C1106.0750%2C1106.2720%2C1106.3265%2C1106.1143%2C1106.2217&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "In this paper we study the effect of, well-known, higher order corrections to\nthe allowed beta decay spectrum on the determination of anti-neutrino spectra\nresulting from the decays of fission fragments. In particular, we try to\nestimate the associated theory errors and find that induced currents like weak\nmagnetism may ultimately limit our ability to improve the current accuracy and\nunder certain circumstance could even largely increase the theoretical errors.\nWe also perform a critical evaluation of the errors associated with our method\nto extract the anti-neutrino spectrum using synthetic beta spectra. It turns\nout, that a fit using only virtual beta branches with a judicious choice of the\neffective nuclear charge provides results with a minimal bias. We apply this\nmethod to actual data for U235, Pu239 and Pu241 and confirm, within errors,\nrecent results, which indicate a net 3% upward shift in energy averaged\nanti-neutrino fluxes. However, we also find significant shape differences which\ncan in principle be tested by high statistics anti-neutrino data samples."}, "authors": ["Patrick Huber"], "author_detail": {"name": "Patrick Huber"}, "author": "Patrick Huber", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevC.84.024617", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1106.0687v4", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1106.0687v4", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "20 pages, 5 figures, 9 tables, added references, version accepted for\n  publication in Phys. Rev. C. Corrected errors in tab. 1 and eqs. 18 and 19.\n  Results and conclusion unchanged", "arxiv_primary_category": {"term": "hep-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "hep-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "hep-ex", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "nucl-ex", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "nucl-th", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1106.0687v4", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1106.0687v4", "journal_reference": "Phys.Rev.C84:024617,2011", "doi": "10.1103/PhysRevC.84.024617", "fulltext": "On the determination of anti-neutrino spectra from nuclear reactors\nPatrick Huber\n\na\n\nCenter for Neutrino Physics, Department of Physics, Virginia Tech, Blacksburg, VA 24061, USA\n\narXiv:1106.0687v4 [hep-ph] 17 Jan 2012\n\nIn this paper we study the effect of, well-known, higher order corrections to the allowed beta\ndecay spectrum on the determination of anti-neutrino spectra resulting from the decays of fission\nfragments. In particular, we try to estimate the associated theory errors and find that induced\ncurrents like weak magnetism may ultimately limit our ability to improve the current accuracy and\nunder certain circumstance could even largely increase the theoretical errors. We also perform a\ncritical evaluation of the errors associated with our method to extract the anti-neutrino spectrum\nusing synthetic beta spectra. It turns out, that a fit using only virtual beta branches with a judicious\nchoice of the effective nuclear charge provides results with a minimal bias. We apply this method\nto actual data for 235 U, 239 Pu and 241 Pu and confirm, within errors, recent results, which indicate\na net 3% upward shift in energy averaged anti-neutrino fluxes. However, we also find significant\nshape differences which can, in principle, be tested by high statistics anti-neutrino data samples.\n\na\n\nemail: pahuber@vt.edu\n\n\fI.\n\nINTRODUCTION\n\nNeutrino physics as a branch of experimental physics started with Cowan's and Reines' detection of neutrinos\nproduced in a nuclear reactor [1]. Since then, reactor neutrino experiments have played a crucial role in shaping\nour understanding of the physical properties of the neutrino1 , for a review see e.g. Ref. [2], and will continue to do\nso in the future [3–5]. In a nuclear reactor there are about 6 β-decays, and hence neutrinos, per fission or about\n2 × 1020 neutrinos per second per GW of thermal power. Fortunately, there are only four isotopes whose fission\nmake up more than 99% of all reactor neutrinos with an energy above the inverse β-decay threshold: 235 U, 239 Pu,\n241\nPu and 238 U. Nonetheless, the resulting neutrino flux is a superposition of thousands of β-decay branches of the\nfission fragments of those four isotopes and thus, a first principles calculation is challenging, even with modern nuclear\nstructure data [6]. Therefore, reactor neutrino fluxes from the thermal fission of 235 U, 239 Pu and 241 Pu are obtained by\ninverting measured total β-spectra which have been obtained in the 1980s at the Institut Laue-Langevin (ILL) [7–9].\nThere are, currently, no corresponding total β-spectra for 238 U since this isotope is fissioned only by fast neutrons.\nModern multi-baseline experiments [3–5] are designed to be independent of a very precise flux knowledge at the source,\nhowever many of the previous measurements employed only one baseline [2] and initial data from Double Chooz [3]\nand Daya Bay [4] most likely will be single baseline data, too.\nRecently, a reevaluation of reactor neutrino spectra has been performed [6] and a significant upward shift in the\npredicted fluxes of about 3% was found. This in turn translates into a weakening of existing reactor bounds on the\nabsence of ν̄e disappearance with wide ranging consequences on the possible existence of a sterile neutrino with a\n∆m2 >\neV2 [10, 11]. Here, we present an independent inversion of the ILL β-spectra into neutrino spectra for the\n∼ 1235\nisotopes\nU, 239 Pu and 241 Pu. To this end, we first review various corrections to the allowed β-decay shape and\nestimate the associated theory errors in section II. We will use virtual β-branches and apply the corrections obtained\nin section II individually for each branch. We then use synthetic data sets and Monte Carlo simulations to quantify\nthe bias and statistical errors associated with the inversion procedure in section III A. In section III B we compute\nthe effective nuclear charge Z̄ and provide error estimates. We then apply the method which we have developed to\nthe actual β-data and present our result on the neutrino fluxes in section IV. In the following section V we perform\na critical comparison of our result with previously obtained neutrino fluxes and point out a possible explanation for\nthe flux shift in terms of known nuclear physics. Finally, we conclude in section VI.\nII.\n\nBETA SPECTRA\n\nIn this section we describe corrections to the allowed β-spectrum shape and provide an estimate of the associated\nuncertainty. Here, we mainly follow the notation of Ref. [12]. The allowed β-spectrum is given by [13]\nNβ (W ) = K p2 (W − W0 )2 F (Z, W ) ,\n|\n{z\n}\n\n(1)\n\nphase space\n\nwhere W = E/(me c2 ) + 1 and W0 is the value of W at the endpoint. K is a normalization constant. F (Z, W ) is the\nso called Fermi function and given by\n2\n\nF (Z, W ) = 2(γ + 1)(2pR)2(γ−1) eπαZW/p\n\n|Γ(γ + iαZW/p)|\nΓ(2γ + 1)2\n\nwith γ =\n\np\n\n1 − (αZ)2 ,\n\n(2)\n\nwhere R the nuclear radius, which in itself has a dependence on A. The Fermi function accounts for the fact that\nthe outgoing electron is moving in the Coulomb field of the nucleus and is derived from the solution of the Dirac\nequation for a point-like and infinitely heavy nucleus. The Fermi function is the leading order QED correction to\nnuclear β-decay.\nIn equation 1 the β-spectrum shape for allowed decays is given, however fission fragments contain a significant\nfraction of decay branches of unique and non-unique forbidden type. For forbidden decays the simple phase space\nfactor p2 (W − W0 )2 is multiplied by [14]\np2ν + p2\n\n1st unique , 2nd non-unique\n\n10 2 2\np p + p4\n3 ν\np6ν + 7p4ν p2 + 7p4 p2ν + p6\n\n2nd unique , 3rd non-unique\n\np4ν +\n\n1\n\n3rd unique , 4th non-unique .\n\n(3)\n\nThroughout this paper we will refer to both neutrino and anti-neutrino simply as neutrino and rely on the context for disambiguation.\n\n2\n\n\fWe see, that the forbidden space phase factor is symmetric under the exchange of p and pν and thus, if we had\nmν = me , the whole expression would be symmetric between neutrino and electron energies, too. If we keep the\nmeasured β-spectrum fixed and fit a β-shape to it, any change to the β-shape which is symmetric between Ee and Eν\nwould not change the neutrino spectrum. This the reason the corrections from forbidden decays to inverted neutrino\nspectra have been found to be small [6–9] despite the overall large contribution of forbidden decays in fission fragments.\nIt turns out, that for precision studies a number of additional effects have to be taken into account and the modified\nβ-spectrum becomes [15]\nNβ (W ) = K p2 (W − W0 )2 F (Z, W ) L0 (Z, W ) C(Z, W ) S(Z, W ) Gβ (Z, W ) (1 + δWM W ) .\n\n(4)\n\nThe neutrino spectrum is obtained by the replacements W → W0 −W and Gβ → Gν . In the following we will describe\nthe physical origin and the actual expression used for each of these additional terms. The size of the contribution of\neach of these terms for a typical β-decay is shown in figure 1.\n\nFinite size corrections\n\nThere are two effects from the finite size of the nucleus: the electric charge distribution is no longer point-like and\nthe hypercharge distribution is no longer point-like, i.e. the nucleon is moving inside the nuclear potential. For all\nfinite size corrections we need to be able to determine the nuclear radius2 as a function of A and we use the so called\nElton formula [17]\nR = 0.0029A1/3 + 0.0063A−1/3 − 0.017A−1\n\n(5)\n\nin units of me c2 .\nThe electromagnetic finite size effect is expressed by L0 and we use the approximation given in Ref. [15]\n5\n(αZ)2\n41 − 26γ\n17 − 2γ\nR X\n−W RαZ\n−αZRγ\n+a−1 +\nan (W R)n +0.41(R−0.0164)(αZ)4.5 ,\n60\n15(2γ − 1)\n30W (2γ − 1)\nW n=0\n(6)\nwhere the an are given by\n\nL0 (Z, W ) = 1+13\n\nan =\n\n6\nX\n\nbx (αZ)x ,\n\n(7)\n\nx=1\n\nand the bx are taken from table 1 of Ref. [15] and reproduced in table V in appendix A. We checked that the error\nof this approximation in comparison with numerically exact results given in [14] is smaller than 10−5 . Neglecting the\nlast three terms in the above expression for L0 still produces accurate results and this form of L0 produces results\nvery close to the ones summarized as finite size effects in equation 8 of Ref. [6].\nThe weak interaction finite size correction is of the following form for Gamow-Teller decays3 [15]\nC(Z, W ) = 1 + C0 + C1 W + C2 W 2 with\n233\n(W0 R)2\n2\nC0 = −\n(αZ)2 −\n+ W0 RαZ ,\n630\n5\n35\n21\n4\nC1 = − RαZ + W0 R2 ,\n35\n9\n4 2\nC2 = − R .\n9\n\n(8)\n\nIn Ref. [18] it is estimated that the errors on both these corrections, L0 and C, are smaller than 10% of their size.\nThus, we can neglect this as a relevant source of error.\n\n2\n\n3\n\nDifferences due to different shapes of the charge distribution, e.g. constant within the nucleus or all charge on the surface are very\nsmall and can be neglected, see e.g. [16]. Also, reasonable variations of the Elton formula have only a minor impact on our result, i.e.\na variation of 10% in A will change the total flux by 0.05%.\nAlmost all decays relevant in our problem are of this type and the corresponding expression for Fermi decays is numerically very close.\n\n3\n\n\fScreening correction\n\nS(Z, W ) accounts for screening of the nuclear charge by all the electrons in the atomic bound state and it effectively\nreduces the charge \"seen\" be the outgoing electron. Our description of the screening correction S(Z, W ) follows\nRef. [16] and we introduce the following quantities\np\nαZW\nαZ W̄\nW̄ = W − V0 , p̄ = W̄ 2 − 1 , y =\nȳ =\nZ̃ = Z − 1 .\n(9)\np\np̄\nV0 is the so called screening potential and derived from numerical calculations and can be parametrized as\nV0 = α2 Z̃ 4/3 N (Z̃) ,\n\n(10)\n\nand N (Z̃) is taken as linear interpolation of the values in table 4.7 of Ref. [16], which is reproduced in table VI in\nappendix A. Then, we obtain\n\u0012 \u0013(2γ−1)\n2\n|Γ(γ + iȳ)|\nW̄ p̄\nfor W > V0 ,\n(11)\neπ(ȳ−y)\nS(Z, W ) =\n2\nW p\nΓ(2γ + 1)\nand S(Z, W ) = 1 for W < V0 . As can be seen from figure 1 the effect of the screening correction itself is rather small\nand the theory behind it is well understood [16], therefore we will not regard it a source of theoretical errors.\nRadiative corrections\n\nRadiative corrections are due to the emission of virtual and real photons by the charged particles present in βdecay and it is crucial to correctly account for both the virtual and real photon contribution to ensure the proper\ncancellation of divergences. The finite part of the virtual photon exchange contribution does depend on the details\nof nuclear structure, but only affects the decay width and not the spectral shape. Therefore, the shape effect can\nbe accurately computed. In our presentation we will suppress all terms which only affect the decay width, i.e. are\nindependent of energy, and keep only the energy dependent parts. The radiative correction at order α has been\ncomputed by Sirlin [19] for the β-spectrum, with β = p/W\n\u0012\n\u0013\n\u0012\n\u0013\u0012\n\u0013\ntanh−1 β\n3\n4\n2β\nW0 − W\n3\ngβ = 3 ln MN − + 4\n− + ln [2(W0 − W )] + L\n4\nβ\n3W\n2\nβ\n1+β\n\u0012\n\u0013\n2\n1\n(W0 − W )\n−1\n−1\n2\n+ tanh β 2(1 + β ) +\n− 4 tanh β ,\n(12)\nβ\n6W 2\nRx\nwhere L(x) is the Spence function, defined as L(x) = 0 dt/t ln(1 − t). The complete correction is then given by\nα\ngβ .\n(13)\nGβ (Z, W ) = 1 +\n2π\nThe radiative correction for neutrinos, Gν , has been derived in Ref. [20] and we apply the form given in Ref. [20] to\nthe neutrino spectrum. The expressions are somewhat lengthy and involve integrals which can not be solved in closed\nform, therefore we do not quote them here. More recently, the radiative correction for neutrinos has been derived in\nclosed form by Sirlin [21]4 and we find that the energy dependence of the new calculation, is numerically within 5%\nof the previous one [20]. Due to the fact that all spectra are normalized to unity, differences in terms which do not\ndepend on energy will cancel. Thus. for our purposes the two results are equivalent and since the new result [21] is\nrather compact, we quote it here\n!\n!\n23\n8\n2β̂\ntanh−1 β̂\nhν = 3 ln MN +\n− L\n+8\n− 1 ln(2Ŵ β̂)\n4\nβ̂\n1 + β̂\nβ̂\n!\ntanh−1 β̂ 7 + 3β̂ 2\n+4\n− 2 tanh−1 β ,\n(14)\nβ\n8\np\nwhere β̂ = p̂/Ê and p̂ = Ŵ 2 − 1 and Ŵ = W0 − Wν , where Wν is the energy of the neutrino. The neutrino radiative\ncorrection then becomes, Gν (Z, Wν ) = 1 + α/(2π)hν . Note, that the radiative correction in the β-spectrum is quite\nlarge, whereas the correction for the neutrino spectrum is very much smaller.\n\n4\n\nI would like to thank T. Schwetz-Mangold for bringing this new work to my attention.\n\n4\n\n\fWeak magnetism\n\nThe term \"weak magnetism\" was coined by Gell-Mann and he proposed it as a sensitive test of the, then emerging,\nV-A theory of weak interactions [22]. The weak magnetism contribution to β-decay belongs to the class of so called\ninduced currents, i.e. currents which do not correspond to couplings present in the initial Hamiltonian and they\nappear only at finite momentum transfer. Out of these induced currents, the weak magnetism term typically yields\nthe largest contribution to the shape of the β-spectrum, see e.g. [23], and therefore we will only discuss this term.\nThe effect of weak magnetism is to modify the spectral shape of β-decay by a factor\n1 + δWM W\n\nwith\n\nδWM =\n\n4 b\nme ,\n3 |{z}\nMc\n\n(15)\n\n=w\n\n√\n\nwhere c is the Gamow-Teller matrix element, b = 2μ, with μ the magnetic transition moment and M = A MN\nthe mass of the nucleus. Experimentally, the transition magnetic moment or b can be determined by measuring the\nmagnetic dipole M1 γ decay width, ΓM1 , of the corresponding isovector transition of the isobaric analog state and b\nis then given by\n\u0012\nb=\n\n6ΓM1 M 2\nα Eγ3\n\n\u0013 21\n(16)\n\nThis derivation relies on the concept of conserved vector currents (CVC), which is essentially a necessary result of\ngauge invariance. In the so called impulse approximation, one further assumes that the transition magnetic moment\nis entirely given by the intrinsic anomalous magnetic moments of the proton, μp , and neutron, μn , and one obtains\nfor w, the following simple expression\nw'\n\nμp − μn CV\n.\nMN\nCA\n\n(17)\n\nNote, that in general there also would be a contribution to b (or μ) from the orbital angular momentum of the decaying\nnucleon, which we neglect here. Within the impulse approximation and neglecting orbital angular momentum5 , there\nis no dependence on nuclear structure and therefore, w has the same value for all Gamow-Teller β-decays. This\n−1\n4\napproximation is the basis for the statement in Ref. [24] that dN\nis the universal value for the\ndE = 3 w = 0.5% MeV\nweak magnetism slope parameter in all β decays. The validity of the necessary approximation seems to be supported\n12\nby the measured value for dN\nB, 12 C and 12 N [25].\ndE in the A = 12 iso-triplet of\nAt the same time, one can use the CVC hypothesis and use equation 16 to infer the weak magnetism slope parameter\nfor a number of isotopes from their measured γ-decay parameters. In Ref. [26] this analysis has been performed on\na set of 12 nuclei and a large variation of both dN\ndE and b was found, see table 11 of Ref. [26]. In table I we present\na somewhat enlarged set of nuclei for which we could identify the necessary information from the Evaluated Nuclear\nStructure Data File (ENSDF) database [27]. The analysis follows the one outlined in Ref. [26]. For some of the nuclei\nwe find slightly different results in comparison to Ref. [26], which can be traced to changes in the nuclear database\nand we have, in all cases, provided the corresponding reference.\nThis sample of nuclei is small, 13 nuclei only, and the majority is much lighter than typical fission fragments, which\nraises the issue of how representative this sample is for fission fragments. On the other hand, these nuclei summarize\nour current experimental understanding of weak magnetism. Setting these doubts aside, we can compute the average\nvalue of dN\ndE and its standard deviation as a measure of the error. In table I we have separated three isotopes based\non their unusually large log f t values. In those cases, the Gamow-Teller matrix element is very small and thus the\nrelative size of the weak magnetism contribution is enhanced. As a result, all of these 3 isotopes have large values\nof dN\ndE . Obviously, these 3 large-log f t isotopes will completely dominate the average and standard deviation and\ntherefore, here the question of how representative our sample is for fission fragments becomes acute. For the main\nanalysis presented in this paper, we therefore will exclude these 3 isotopes and this yields the following mean and\nstandard deviations\ndN\n= (0.67 ± 0.26) % MeV−1 ,\ndE\n\n5\n\n(18)\n\nUnder these assumptions, there is also no contribution of the weak electric form factor, called d in the notation of [23], which could be\nsizable.\n\n5\n\n\fJi → Jf\n\ndecay\n6\n\nHe\nB\n12\nN\n18\nNe\n20\nF\n22\nMg\n24\nAl\n26\nSi\n28\nAl\n28\nP\n14\nC\n14\nO\n32\nP\n12\n\n→\n→\n→\n→\n→\n→\n→\n→\n→\n→\n→\n→\n→\n\n6\n\nLi\nC\n12\nC\n18\nF\n20\nNe\n22\nNa\n24\nMg\n26\nAl\n28\nSi\n28\nSi\n14\nN\n14\nN\n32\nS\n12\n\n0+ →1+\n1+ →0+\n1+ →0+\n0+ →1+\n2+ →2+\n0+ →1+\n4+ →4+\n0+ →1+\n3+ →2+\n3+ →2+\n0+ →1+\n0+ →1+\n1+ →0+\n\nEγ\nΓM 1 bγ\nft\nc bγ /Ac\n|dN/dE|\n[keV]\n[eV]\n[s]\n[% MeV−1 ]\n3563\n8.2 71.8\n805.2\n2.76 4.33\n0.646\n15110\n43.6 37.9\n11640. 0.726 4.35\n0.62\n15110\n43.6 37.9\n13120. 0.684 4.62\n0.6\n1042\n0.258 242.\n1233.\n2.23 6.02\n0.8\n8640\n4.26 45.7\n93260. 0.257\n8.9\n1.23\n74 0.0000233 148.\n4365.\n1.19 5.67\n0.757\n1077\n0.046 129.\n8511.\n0.85 6.35\n0.85\n829\n0.018 130.\n3548.\n1.32 3.79\n0.503\n7537\n0.3 20.8\n73280.\n0.29 2.57\n0.362\n7537\n0.3 20.8\n70790. 0.295 2.53\n0.331\n9\n2313\n0.0067 9.16 1.096 × 10 0.00237 276.\n37.6\n2313\n0.0067 9.16 1.901 × 107\n0.018 36.4\n4.92\n7002\n0.3 26.6 7.943 × 107 0.00879 94.4\n12.9\n\nRef.\n[28]\n[29]\n[30]\n[31]\n[32]\n[33]\n[34]\n[35]\n[36]\n[36]\n[29]\n[26]\n[37]\n\nTABLE I. Gamow-Teller decays and the associated parameters needed for a computation of the weak magnetism slope\nparameter using the CVC hypothesis.\n\nwhich is very close to the value obtained from using the impulse approximation, but we also see that there is significant\nvariance. We will use the standard value of Ref. [24] and assign a 100% error to it.\nIf we include the large-log f t isotopes, the corresponding result would be\ndN\n== (4.78 ± 10.5) % MeV−1 ,\ndE\n\n(19)\n\n−1\ncauses a\nthat is, a ten times larger mean with a many times larger relative error. A shift of dN\ndE by +0.5 % MeV\nshift of the neutrino rate of about −1%. Thus, if one were to use equation 19 the resulting rate uncertainty would be\nabout 20% and the neutrino flux shift found in Ref. [6] would be quite easily absorbed in this error bar. Even just a\nshift of the central value is sufficient to bring the neutrino fluxes nearly back to the original level. Obviously, large\nvalues of log f t imply relatively long half-lives and long-lived isotopes play only a small role in neutrino emission6 from\nfission fragments. However, if the endpoint energy is large, the relevant Gamow-Teller matrix element can be quite\nsmall without leading to a very long lifetime. Also, it is not clear how large weak magnetism would be in forbidden\ndecays, since there the leading order nuclear matrix element is already quite small and thus all corrections tend to\nhave relatively more weight. Thus, the size of weak magnetism, or more generally induced currents, is the one major\nsource of theory uncertainty. In summary, the reactor anomaly [10] can be either attributed to new physics in the\nform of a sterile neutrino or to a significant extent to some not well understood nuclear physics. In particular, a\ndetailed study of the breakdown of the impulse approximation in large-log f t nuclei in the relevant mass range would\nbe quite helpful, but is beyond the scope of this paper.\n\nIII.\n\nEXTRACTION OF THE ASSOCIATED NEUTRINO SPECTRUM\n\nFor a single β-decay branch the inversion from the β-spectrum into the corresponding neutrino spectrum is straightforward due to energy conservation, if one neglects recoil effects, which are O(E0 /(A MN )) ∼ 10−4 . In particular, if\nthe β-spectrum has been measured with good precision, the neutrino spectrum can be known to the same level of\nprecision without any reliance on theory. In practice, however, most of the nuclei involved have many β-branches,\nmost of which are identified by γ-ray spectroscopy and not by direct measurement of the β-spectrum; in these cases,\nβ-decay theory as outlined in section II plays a crucial role in obtaining the associated neutrino spectrum. Of course,\nin a nuclear reactor a very large number of different nuclei and β-branches contributes to the neutrino spectrum,\nwhich makes the task of a first principles calculation of the neutrino spectrum challenging and as we have describe\nin section II, theory errors can play an important role, even if one were to assume that the actual nuclear data itself\nwere flawless. The problems of this direct or a priori approach have been explored in detail in Ref. [6], with the\n\n6\n\ni.e. above inverse β-decay threshold\n\n6\n\n\fSize of correction @%D\n\n10\nGΝ\n\n5\n∆WM\n0\nC\n-5\n-10\n\nS\n\nL0\n\n0\n\n2\n\n4\n\n6\n\n8\n\n10\n\nEΝ @MeVD\nSize of correction @%D\n\n10\nGΒ\n5\n∆WM\n0\nC\nS\n\n-5\n-10\n\n0\n\nL0\n\n2\n\n4\n\n6\n\n8\n\n10\n\nEe @MeVD\n\nFIG. 1. (Color online) Shown is the relative size of the various corrections listed in equation 4 for a hypothetical β-decay with\nZ = 46, A = 117 and E0 = 10 MeV. The upper panel shows the effect on the neutrino spectrum, whereas the lower panels\nshows the effect on the β-spectrum.\n\nconclusion that the inevitable incompleteness of the nuclear databases makes it impossible to account for all neutrinos\nand reliance on measured total β-spectra can not be reduced beyond a certain level and eventually virtual β-branches\nhave to be used in addition to the a priori computed spectra.\nNeutrino spectra from reactor neutrinos have been obtained by theory calculation by many authors [38–43] and for\n238\nU this is still the only possibility7 . The neutrino spectra, which were the state of the art prior to Ref. [6], were\nobtained by the exclusive use of virtual β-branches, which parameters were determined by a fit to measured total\nβ-spectra [7–9]. This procedure is not independent of input from nuclear databases, either. Here, the information\nfrom nuclear databases enters in the form of the empirical mean proton number of the fission fragments as a function\nof E0 , which we call the effective nuclear charge, Z̄, and is computed according to\nR E0 +∆/2\ndE 0 η(E 0 ) Z(E 0 )\nE −∆/2\nZ̄(E0 ) = 0 R ∞\n,\n(20)\ndE 0 η(E 0 )\n0\nwith ∆ being an appropriately chosen energy interval.\nFrom a mathematical point of view, the problem at hand is an inversion or unfolding problem: Given the measured\ntotal β-spectrum Nβ , one tries to infer the underlying distribution of β-branches η, which we take to be a continuous\ndistribution over all possible endpoints8 , E0\nZ\nNβ (Ee ) = dE0 Nβ (Ee , E0 ; Z̄) η(E0 ) .\n(21)\nIf we neglect the dependence on Z̄, problems like this one are known as Fredholm integral equation of the first kind.\nThese problems are ill-posed and in general have no unique solution, therefore it is necessary to provide an additional\nconstraint, a so called regularization scheme. The choice of regularization scheme is essentially an art and not a science,\nsince one has to find the appropriate compromise between finding a reasonably stable solution and the introduction\n\n7\n8\n\nAccording to K. Schreckenbach a measurement of the 238 U β-spectrum is currently undertaken at the FRM II in Garching.\nFor the moment we neglect the issue of forbidden decays.\n\n7\n\n\f0.04\n\nHΦ-Φtrue L\u0090Φtrue\n\n0.02\n\n0.00\n\n-0.02\n\n-0.04\n0\n\n2\n\n4\n\n6\n\n8\n\nE @MeVD\n\nFIG. 2. (Color online) The basic inversion procedure, shown for a synthetic data set for 235 U. The green (thin, gray) line\nshows the neutrino residuals in 50 keV bins and the blue (thin, black) line shows the β-residuals in 50 keV bins. The thick red\nline depicts the neutrino residuals in 250 keV bins.\n\nof an unacceptable bias into the result; for an introduction into the topic of regularized inversion see e.g. Ref. [44].\nThe regularization scheme, which has been developed for our case, relies essentially on averaging the solution over\na finite range of Eν , which corresponds to a top-hat filter. This procedure has been studied in great detail in [45]\nbased on a synthetic data set. The use of a synthetic data set as proxy for real data allows to quantify the size of\nthe bias and thus serves as a valuable tool to fine tune the regularization scheme. In Ref. [6] it was shown that a\nβ-spectrum computed from cumulative fission decay yields and the ENSDF database reproduces the measured total\nβ-spectrum for 235 U within an error of about 10% and therefore can serve as an accurate proxy for the actual data\nset. We will use a total β-spectrum derived from the endpoints contained in the ENSDF database9 and we use fission\nyields for fission by 25 meV, i.e. thermal, neutrons from the JEFF database, version 3.1.1 [46]. Note, that we neglect\nthe contribution from epithermal and fast neutrons which would change the total spectrum by only a few percent\nand therefore, does not affect its suitability or accuracy as proxy. We also do not apply the small correction for finite\nirradiation time, this correction can be found in table VII of Ref. [6]. In computing the resulting β-spectra we apply\nthe results obtained in section II. We use this data set, which consists of approximately 550 isotopes and contains\nabout 8 000 individual β-branches, to perform a critical study of an inversion purely based on virtual branches.\nIn Ref. [45] it was shown that given a precise enough measurement of the total β-spectrum and accurate knowledge of\nZ̄ the true neutrino spectrum could be recovered to better than within 1%. Unfortunately, several of the assumptions\nmade in this analysis do not apply here: first, the available data was taken with a resolution of 50 keV and secondly Z̄\ncan be known only approximately, since the underlying database is incomplete, otherwise there would be no need for\nthe use of virtual branches. Also, the analysis in Ref. [45] does not include the various corrections to a allowed β-decay\nshape and the effect of statistical fluctuations of the actual β-data was not taken into account. In the following we\nwill quantify the impact of this various factors.\nA.\n\nBias & Statistical Errors\n\nThe basic procedure is to take the measured β-spectrum, for which, at this stage, we will substitute our simulated\nβ-spectrum and to start from the highest energy data point nN\nβ , where N is the number of data points. Then, one\n−s\n−s+1\nfixes a certain size s of a slice S and takes the data points S1 = {nN\n, nN\n, . . . , nN\nβ }. We then fit an allowed\nβ\nβ\nβ-spectrum with a free endpoint E1 and amplitude a1 to the data contained in S1 . We continue this β-branch to all\nenergies and subtract it from the remaining N − s data points. This procedure is repeated till all data points have\nbeen fitted and as result we have a set of v = N/s endpoints and amplitudes {Ei , ai }, where v is the number of virtual\nbranches. The set {Ei , ai } is a discrete approximation to η(E0 ) and can be used to compute the neutrino spectrum,\nby trivially inverting each virtual β-branch into its corresponding neutrino spectrum. The result of this procedure for\n\n9\n\nThe endpoints, branching fractions, the assignment of the degree of forbiddeness and simple β-spectra which were computed according\nto Ref. [6], i.e. without the terms C, S, Gν , were kindly provided in machine readable format by the authors of Ref. [6].\n\n8\n\n\f0.04\n\nHΦ-Φmean L\u0090Φmean\n\n0.02\n\n0.00\n\n-0.02\n\n-0.04\n2\n\n3\n\n4\n\n5\nEΝ @MeVD\n\n6\n\n7\n\n8\n\nFIG. 3. (Color online) The neutrino flux from the inversion of 1000 random realizations of a synthetic β-spectrum for 235 U\nrelative to the mean outcome of these 1000 trials. The red (thin, gray) lines show a subset of 100 trials. The thick, ragged\nblack line shows one particular example. The smooth thick, blue (black) lines show the standard deviation in each bin, which\nis the same as the square root of the diagonal elements of the covariance matrix. The dark green (thick, dark gray) lines are\nthe statistical error of the β-spectrum scaled up by a factor of 7.\n\n235\n\nU with \"data\" in bins of 50 keV and s = 5, corresponding to 30 virtual branches, is shown as green (thin, gray)\nline in figure 2. The thin blue (black) line shows the β-residuals, which are obviously very small.\nThe 50 keV anti-neutrino residuals show oscillations which are due to the simple fact that the β-spectrum is nonzero at the endpoint. The amplitude of these oscillations in increased by the inversion procedure and this increase\nis a direct consequence of the problem being ill-posed in the mathematical sense. To obtain a more regular solution,\nwe can average our result and obtain the thick red line by averaging over 250 keV bins. Clearly, this regularized\nsolution shows oscillations of much smaller amplitude, especially in the region of interest between 2 and 8 MeV. We\nalso observe that the remaining oscillations do not average to zero, e.g. between 4 and 6 MeV both, the regularized\nand non-regularized, solutions predict a neutrino flux which is too low by about 1%; the result is biased. A finite bias\nis not surprising and quite common in this type of inversion problem. Using a synthetic data set it is straightforward\nto quantify the bias by comparing the result of the inversion with the known true flux, as done in figure 2. We, also,\ncan vary the starting point of the inversion by removing an increasing number of consecutive data data points at the\nhigh energy end and repeat the procedure. The overall features stay the same, but the phase of the oscillations of\nthe non-regularized solution changes gradually and once we have removed s data points we obtain the initial solution\nagain. This variation of the phase introduces a slight spread in the magnitude of the bias, which we will assign as\nerror of the bias correction.\nThe oscillations apparent in figure 2 show that the inversion procedure amplifies small perturbations and may be\nnot stable with respect to statistical fluctuations, which in real data are inevitable. Given the statistical errors of the\nβ-spectra we can add random fluctuations with the same variance to our synthetic β-spectra and for each realization\nof a randomized β-spectrum we can perform an inversion. We have done this for 1000 random data sets and the\nresults are shown as red (thin, gray) lines in figure 3, where we plot the relative deviation from the mean. The thick\nblack lines shows one characteristic example. It is quite obvious that there are very strong anti-correlations between\nneighboring bins. These anti-correlations are due to oscillations in the inversion procedure, which are excited by\nstatistical fluctuations. Since, these oscillations are unphysical and merely a feature of the inversion procedure, we\ndo not want to propagate these oscillations into the final result. The thick smooth, black line shows the standard\ndeviation in each bin, which turns out to be the same as the square root of the corresponding diagonal element of the\ncovariance matrix of the 1000 randomized inversions. The range delimited by the standard deviation is a good estimate\nof the statistical error, therefore, we will drop all off-diagonal elements of the covariance matrix. The resulting errors\nare found to be several times larger in the inverted neutrino spectrum than they are in the underlying β-spectrum.\nThe errors of the β-spectrum are shown as dark green (thick, gray) lines but multiplied by a factor of 7. Note, that\nthis scaling factor is not universal and depends sensitively on the details of the inversion, like bin width.\n9\n\n\f70\n\n60\n\nZ\n\n50\n\n40\n\n30\n\n20\n0\n\n2\n\n4\n\n6\n\n8\n\n10\n\nE0 @MeVD\n\nFIG. 4. (Color online) The effective nuclear charge Z̄ of the fission fragments of 235 U as a function of E0 . The area of the\neach box is proportional to the contribution of that particular Z to the fission yield in that energy bin. The lines are fits of\nquadratic polynomials: black – ENSDF database, blue (dark gray) – adding those isotopes missing from ENSDF by assuming\nthat there is only one β-branch, each with E0 = Qβ , red (light gray) – maximum pandemonium as defined in the text. The\nblue (dark gray, rightmost), filled boxes show the resulting distribution of adding the missing isotopes with E0 = Qβ . The red\n(light gray, leftmost), empty boxes show the distribution in the maximum pandemonium approximation.\n\nB.\n\nEffective average nuclear charge\n\nFinally, we study the degree to which Z̄ can be determined and how the incompleteness of nuclear databases affects\nthe inversion procedure. We fit a second order polynomial in E0 , where we weight each β-decay branch by it fission\nyield YA,Z and the corresponding branching ratio biA,Z , the result is shown as a black line in figure 4. The black boxes\nare a two-dimensional histogram of the Z distribution of the fission fragments using the ENSDF database. Note,\nthat this distribution is bi-modal, because fission proceeds into two asymmetric fragments, and it is therefore, quite\nunexpected that a simple energy-dependent mean (Z̄) actually is sufficient to compute accurate neutrino spectra, as\npreviously shown in [45] and in figure 2.\nWe know from comparing the fission yields with the ENSDF database how many and which nuclei are missing\nand although we have no detailed information on β-branches for those nuclei, ENSDF does contain the Qβ for all of\nthe missing nuclei. Thus, we can try to bracket the effect of the missing nuclei by computing Z̄ under two different\napproximations. First, we assume there is indeed only one β-branch with E0 = Qβ for each missing isotope. In this\ncase, the effect of the missing isotopes is to add to the high energy part and increase Z̄ by a rather small amount, as\nshown by the blue (dark gray) curve in figure 4. In nuclei far from stability, there will be very many, but individually\nquite weak β-branches, which makes it very difficult to infer the correct level scheme and β-decay branching fractions\nfrom γ-spectroscopy, this is termed as pandemonium effect [47]. In Ref. [6] the pandemonium effect is taken care\nof by replacing about 50-100 of the nuclei in the ENSDF database by data which was obtained specifically avoiding\nthe pitfalls of the pandemonium. Here, we would like to use an approximation to this method, which we will call\nthe \"maximum pandemonium\". We take the 17.5% most neutron rich nuclei10 from the ENSDF database and all\nthe Qβ values of the missing nuclei and replace all their β-spectra using the following algorithm: We distribute the\nβ-decay strength evenly between 0 and Qβ using about 10 decay branches. The result is shown as red (light gray)\nline in figure 4. This should yield a reasonable approximation, at least when one averages over a large number of\nnuclei, as we presently do. The maximum pandemonium approximation is of course rather crude and would be not\nsufficient for a direct a priori calculation of the neutrino spectrum, but it allows us to gauge the magnitude of the\neffect of the incompleteness of the nuclear database we use. We repeat this exercise for the other isotopes as well and\nthe results on Z̄ are summarized in table II. The induced systematic error is correlated between the isotopes since it\nhas a common physical cause. Note, that this is the only place at which information from nuclear databases enters\nthe computation of the neutrino spectrum using only virtual β-branches. In principle, the nuclear mass A will show\n\n10\n\n17.5% was chosen because the resulting deficit in the total β-spectra is very similar in magnitude and shape to the one shown in figure 5\nof Ref. [6].\n\n10\n\n\fIsotope\nc0\nc1\nc2\n+0.161\n+0\n235\n−0.399\n−0.084\nU 48.992+0\n−0.164\n−0\n−0.044\n+0.036\n239\nPu 49.650+0\n−0.089+0\n−0.214 −0.447−0\n−0.016\n+0.160\n241\nPu 49.906+0\n−0.044+0\n−0.178 −0.510−0\n−0.052\nTABLE II. The coefficients for the parametrization of Z̄ for the various isotopes. Also given are the range as obtained from\nthe maximum pandemonium approximation. ci is the coefficient of E0i in a second order polynomial in E0 . Note, that in our\ndefinition Z̄ is the charge of the parent nucleus.\n\na similar change as a function of E0 , but variations of A have a much smaller impact on the neutrino spectrum and\ntherefore fixing the effective nuclear mass, Ā, at Ā = 117 does not lead to any relevant additional bias or error. The\nvalue for Ā is chosen based on the average nuclear radius, where the average is determined by weighting each isotope\nwith its cumulative fission yield and we find a range of about 116-118 for 235 U to 241 Pu.\n\nIV.\n\nAPPLICATION TO\n\n235\n\nU,\n\n239\n\nPU AND\n\n241\n\nPU\n\nIn this section, we will apply the results obtained so far to a direct inversion of the β-spectra which were measured\nin the 1980s at ILL. We use the β-spectra for 235 U as presented in Ref. [7], for 239 Pu from Ref. [8, 9]11 and for 241 Pu\nfrom Ref. [9]. The original data for all 3 isotopes was recorded in 50 keV bins, but unfortunately was published only\nin 250 keV bins, which is not sufficient for our purposes. We, however, were able to obtain finer binned data from\none of the authors [48] of Refs. [7–9]: for 235 U we have data in 50 keV bins from 1.5 to 9.5 MeV, for 239 Pu we have\ndata in 100 keV bins from 1 to 8 MeV and for 241 Pu we have data in 100 keV bins from 1.5 to 9 MeV. Thus, we have\ndata for all 3 isotopes only in the energy interval between 1.5 and 8 MeV and, since the threshold for inverse β-decay\nis 1.8 MeV and the results in Ref. [6] range from 2 to 8 MeV, we will present result only for this interval. Together\nwith the original data, also came the size of the statistical error in each bin, which when summed up over 250 keV\nbins agree with the values published in Refs. [7–9], as do the data itself. Note, that the data on 235 U not only has the\nsmallest bin size but also the smallest statistical errors, whereas 239 Pu has the largest errors. There is a calibration\nor normalization error for each data set and we take these values directly from Refs. [7–9] and list them in column 9\nof tables VII-IX.\nFor each isotope we perform the inversion as outlined in section III but now for the actual data, we use 30 virtual\nbranches with a slice size of 5 for 235 U and 23 virtual branches for 239 Pu and 25 for 241 Pu both with a slice size of 3.\nWe have tested that variations of the slice size around the values given only mildly affect the results and the chosen\nvalues provide the smallest errors around 4 MeV. Also, with these choices the energy range of a slice is about the\nsame in all 3 isotopes and is close to 250 keV. By using synthetic data sets for each isotope we determine the bias\nand statistical errors, the later is shown column 5 of tables VII-IX, where the square root of the diagonal elements\nof the covariance matrix are given. We apply the resulting bias correction, column 3 of tables VII-IX, to the results\nextracted from the actual data and assign the spread of biases obtained by varying the starting point of the inversions\nas error, which is given in column 6 of tables VII-IX, see also section III A. Then we perform an inversion using the\nupper and lower ends of the ranges for Z̄ from section III B and for the weak magnetism correction from section II.\nThe relative differences to the initial inversion result are listed as errors in columns 7 and 8 of tables VII-IX. Finally\nthe error components in columns 5-9 are added in quadrature and quoted as total error in column 10 of tables VII-IX.\nThe total error quoted in tables VII-IX is only an indication of the actual errors since there are correlations between\nthe various bins. The statistical error is uncorrelated between bins as well as the bias error. Both the errors due to\nZ̄ and weak magnetism (WM) are fully correlated between all bins and all isotopes. The normalization errors is fully\ncorrelated between bins and between isotopes, since they same apparatus and method to determine the normalization\nwas used for all 3 isotopes. Due to the asymmetric nature of the errors from Z̄ and weak magnetism (WM) they can\nnot be included exactly in a total covariance matrix. However, already the combined errors form Z̄ and WM are close\nto symmetric and the overall errors are very close to symmetric, thus it is a reasonable approximation to neglect the\nsmall asymmetry in errors for most applications.\nFor completeness, we also provide a parametrization of our results using the familiar exponential of a 5th order\n\n11\n\nThe actual data on electron spectra is the same in both sources, however the neutrino spectrum was re-derived in the later reference\nusing updated nuclear databases.\n\n11\n\n\f0.15\nour result\n1101.2663\nILL inversion\nsimple Β-shape\n\nHΦ-ΦILL L\u0090ΦILL\n\n0.10\n\n0.05\n\n0.00\n\n-0.05\n\n2\n\n3\n\n4\n\n5\nEΝ @MeVD\n\n6\n\n7\n\n8\n\nFIG. 5. (Color online) Comparison of our result for 235 U with previous inversions, labeled ILL for the results from Ref. [7]\nand labeled 1101.2663 for the results from Ref. [6]. The thin error bars show the theory errors from the effective nuclear charge\nZ̄ and weak magnetism. The thick error bars are the statistical errors, whereas the light gray boxes show the error from the\napplied bias correction. The green line, referred to as simple, shows the result, if we use the same description of β-decay as in\nRef. [6]. The black line, referred to as ILL inversion, shows our result if we completely follow the procedure outlined in Ref. [7],\nincluding their effective nuclear charge.\n\npolynomial [6, 49]:\nφν (Eν ) = exp\n\n6\nX\n\n!\nαi Eνi−1\n\n.\n\n(22)\n\ni\n\nIn performing the fit we follow the description given in Refs. [6, 49] but we do not include contributions from the\nerror on Z̄ and WM since they are correlated between isotopes and do not change the fit appreciably. The resulting\nbest fit parameters and the minimum χ2 values are given in table III.\nIsotope\n235\nU\n239\nPu\n241\nPu\n\nχ2min α1\nα2\nα3\nα4\nα5\nα6\n49.3 4.367 −4.577 2.100 −5.294 × 10-1 6.186 × 10-2 −2.777 × 10-3\n20.8 4.757 −5.392 2.563 −6.596 × 10-1 7.820 × 10-2 −3.536 × 10-3\n15. 2.990 −2.882 1.278 −3.343 × 10-1 3.905 × 10-2 −1.754 × 10-3\n\nTABLE III. Result of a fit of a 5th order polynomial to the logarithm of the flux. The number of degrees of freedom is 25 − 6.\n\nObviously, the fit for 235 U is quite bad, with a χ2 /dof of more than 2. Also, for all 3 isotopes the fit parameters\nare highly correlated and we therefore do not provide any fit errors or correlation matrices, since it seems doubtful\nwhether these could be used to model the errors in the underlying neutrino fluxes. This parametrization should not\nbe used for actual data analysis or error propagation12 . Instead, we recommend to rebin our results by using linear\ninterpolation and integrating the resulting fluxes over the new bins. In the same fashion the errors can be rebinned\nand we provide results for 250 keV and 50 keV bins in machine readable format [50].\nV.\n\nDISCUSSION\n\nThe β-spectra from Refs. [7–9] have been previously inverted into neutrino spectra and we, therefore, will start by\ncomparing our result with previous results [6–9]. In figure 5 we show our result (thick blue/black line) relative to the\nresults presented in Ref. [7], which is denoted as φILL . We clearly observe that our results point to a significantly\n\n12\n\nNonetheless, this parametrization can be safely used to extrapolate our results to higher energies, since there, the errors of the actual\nfluxes are sufficiently large to render the inaccuracies of this parametrization harmless.\n\n12\n\n\fenhanced flux with respect to φILL . The results from Ref. [6] are shown as red (thin, dark gray) line and up to about\n5.5 MeV there is good agreement, whereas at higher energies the result of Ref. [6] exhibits strong oscillation relative to\nboth φILL and our result, which may be due the coarser binning of the β-spectra used in Ref. [6]. The thin error bars\nare the sum of the theory errors, i.e. the effective nuclear charge Z̄ and weak magnetism WM, the thick error bars\nshow the statistical errors and finally the gray boxes show the error from the bias correction. The theory errors are\ncorrelated between all bins, the statistical and bias correction error are uncorrelated. Not shown is the, common to all\ndata sets, normalization error. The thin green line shows our result, if we use the same, simplified, description of the\nβ-decay spectrum as in Ref. [6] and we see that it is responsible for a sizable fraction of the difference of our result with\nthe others at energies above 5 MeV. Finally, the thin black line shows our result, if we follow the procedure outlined\nin Ref. [7], which in particular includes their form of Z̄ and the fact, that all corrections to a allowed β-spectrum\nshape are applied in an average fashion and we recover the original result quite well. Similar figures can be made\nfor the other isotopes and the results, generally, would be similar, too; the error bars would be much larger due to\nthe 100 keV binning of the original data and the larger statistical errors in the β-spectra. As far as the origin of the\nupward shift in flux relative to the original results [7–9] is concerned, we agree at some level with the comments made\nin Ref. [6], where at energies below 4 MeV the main effect is ascribed to the branch-by-branch implementation of the\nvarious corrections to a allowed β-spectrum shape. We would like to point out that both an implementation in each\nvirtual branch as well as an implementation in each physical branch in an a priori calculation yield the same effect.\nMoreover, it is likely that a newly derived average correction based on modern nuclear databases maybe nearly as\naccurate as a branch-by-branch implementation. Of course, to derive this new average correction would presumably\nimply to actually study the corrections first branch-by-branch, so nothing would be gained. At energies above 5 MeV,\nthe new form of the effective nuclear charge Z̄ as given in table II does make up a large fraction of the shift. Note, that\nin contrast to Ref. [6] we do find that an effective nuclear charge is sufficiently accurate and the effect of the actual\ndistribution of Z can be approximated quite well by its, properly defined, average; this conclusion is supported by the\nresults of Ref. [45]. At high energies the contribution from the wave function convolution and screening correction on\nthe β-shape contribute significantly to the overall shift. Once we combine all factors we find about the same upward\nshift in all isotopes, however we would not characterize it as constant over all energies.\nIn table IV we quantify the mutual agreement or disagreement of the various fluxes and associated inverse β-decay\nevent rates, where we use the cross section from [51]. Inverse β-decay is frequently used for the detection of reactor\nanti-neutrinos. In this table we list for each isotope the total difference over all energy bins from 2 − 8 MeV of the\nfluxes from Refs. [7–9] labeled φILL and the ones from Ref. [6] labeled φMLF to our results. We provide the total error\nas well as the individual contributions from statistics, theory and the bias correction. The ratio of the total difference\nto the total error is what we call the \"rate significance\", i.e. the significance of the total flux change. We find the\ntotal flux change relative to φILL to be in the range +(2.4 − 3.2)%. The upward shift in fluxes is significant at the\n(3.7 − 4.0) σ level. This shift is slightly larger than the one found in Ref. [6], however if we compare our total flux\nwith respect to φMLF we find very small differences for 235 U and 241 Pu. For 239 Pu the situation is different and we\nhave a lower total flux than φMLF , which however is entirely due to the first energy bin and could be due a spurious\noscillation in the inversion procedure in either analysis. If we perform the same comparisons for inverse β-decay event\nrates, rows labeled as RILL and RMLF , we find that in total event rates the upward shift with respect to RILL is a\nbit larger than for the fluxes with +(3.7 − 4.7)%, which is due to the relatively large shift at high energies which is\nenhanced by the Eν2 energy dependence of the cross section. These rates shifts are significant at (2.4 − 3.0) σ and the\nreason for the significance being smaller than for the fluxes is again the larger weight of high energies which do have a\nlarger shift but also larger errors. As far as total inverse β-decay rates are concerned, the agreement with the results\nof Ref. [6] is excellent and no difference reaches more than 1 σ.\nIn the last column of table IV we provide the \"shape significance\", i.e. the square root of the χ2 -difference between\nthe various flux and inverse β-decay rates. For this calculation we assume a free normalization, which is equivalent to\nsubtracting any rate differences. For the shape difference of fluxes we assume infinite statistics, whereas for the inverse\nβ-decay shape difference we assume 106 events. We see that shape differences can be large and quite significant at\neven more than 5 σ. This is, however, based only on the flux errors and does not include further complications like\nexperimental errors or errors on the isotope composition of the reactor and burn-up. Thus, at this level of analysis it\nremains unclear whether an actual neutrino measurement could distinguish between the various flux models.\nApart from the quantitative difference we discussed previously, there are important qualitative differences of our\nresult with respect to earlier inversions. We present, for the first time, a careful and detailed error analysis of both\nthe underlying theory of β-decays as well as of the inversion procedure itself. We found that most corrections to\nthe statistical β-decay shape, like finite size effects, are well understood and the associated errors are only a fraction\nof the correction itself, see section II. However, we also found that the treatment of induced currents in β-decay is\nsubject to considerable theoretical uncertainty. We studied in detail the example of weak magnetism as the largest\ncontributor and found by comparison with data, the impulse approximation, which is the basis for assuming that the\nweak magnetism correction is universal for all beta decays, is apparently only accurate within about 100% for most\n13\n\n\f235\n\nU shift\n1 σ errors [%]\n% total stat theo. bias\nφILL 2.4 0.7 0.1 0.6 0.1\nRILL 3.7 1.5 0.0 1.5 0.1\nφMLF 0.4 0.7 0.1 0.6 0.1\nRMLF 1.2 1.5 0.0 1.5 0.1\n\nσ significance\nrate\nshape\n3.7\n4.5\n2.4\n3.7\n0.6\n6.0\n0.8\n5.4\n\n239\n\nPu shift\n1 σ errors [%]\n% total stat theo. bias\nφILL\n2.9 0.7 0.3 0.6 0.2\nRILL\n4.2 1.5 0.4 1.4 0.2\nφMLF -0.3a 0.7 0.3 -0.6 -0.2\nRMLF 1.4 1.5 0.4 1.4 0.2\n\nσ significance\nrate\nshape\n3.9\n3.2\n2.8\n3.2\n0.5\n4.7\n1.0\n4.6\n\n241\n\nσ significance\nrate\nshape\n4.0\n2.6\n3.0\n2.6\n0.5\n3.7\n0.7\n3.7\n\nPu shift\n1 σ errors [%]\n% total stat theo. bias\nφILL 3.2 0.8 0.3 0.7 0.2\nRILL 4.7 1.6 0.2 1.5 0.2\nφMLF 0.4 0.8 0.3 0.7 0.2\nRMLF 1.0 1.6 0.2 1.5 0.2\na\n\nThis difference and its sign are driven by the first bin from 1.875 − 2.125 MeV and thus the inverse β-decay rates do not reflect this.\n\nTABLE IV. These tables compare our result in relation to the fluxes from Refs. [7–9] labeled as φILL or the inverse β-decay\nevent rates RILL . The fluxes and event rates from Ref. [6] are referred to as φMLF and RMLF . For the column labeled rate\nwe do not include any normalization errors since they are common to the underlying data, for the column labeled shape we\nassume a free normalization. The significance in the shape column for event rates assumes 106 inverse β-decay events.\n\nnuclei and fails completely for a small subset of large-log f t nuclei. For the analysis presented so far we assumed a\n100% error on the weak magnetism corrections, i.e. we neglect the large-log f t nuclei. If we assume that our limited\nsample of nuclei were representative for fission fragments this error would be 10 times larger and the sole dominating\ncontribution to the overall error budget, in which case all flux models would be equivalent within these much larger\nerror bars. Even if we assume further, that the error bars would remain small, merely adjusting the central value\nwithin this larger range to about 4 times its current value would allow to largely eliminate the upward shift and to\nbring both the calculation presented in Ref. [6] and our result into agreement with the previous ILL fluxes. As a\nconsequence the new found support for sterile neutrinos as presented in Refs. [10, 11] would be weakened considerably.\nWe also investigated in detail how errors propagate through the inversion procedure and quantified the bias in this\nmethod by using synthetic data sets. It is important to realize that the underlying mathematical problem is ill-posed\nand thus we are not dealing with a simple (or complex) fit of a model to data. Therefore, the use of synthetic data\nsets as first shown in Ref. [45] is essential to gain insight into error propagation and errors inherent to the method.\nThe assumption that the statistical errors of the β-spectrum would find a one-to-one correspondence in the resulting\nneutrino spectra is not supported by our Monte Carlo simulations. Also, the size of the bias is non-negligible and\nwould be much larger if we had to use β-spectra binned in 250 keV bins. The combination of bias and statistical\ninversion errors from our synthetic data sets yields the total conversion error. We also would like to emphasize that\nthe β-residuals obtained here are significantly smaller than in Ref. [6] and exceed nowhere the errors of the final result.\nIn all methods of inversion, input from nuclear databases is required, since the measured β-spectrum can be fit by\na wide range of different branches by adjusting the nuclear charge. The problem is, that nuclear databases tend to be\nincomplete and may contain significant errors in level assignments, e.g. the pandemonium effect. There are different\nstrategies to deal with these shortcomings and in Ref. [6] the attempt was made to address these shortcomings directly\nat the database level by collecting the best available experimental data and supplement missing data by appropriate\ntheoretical models. This resulted in a database which is about 90% complete and the remainder was treated by\ninversion, i.e. with virtual branches. This method, if carefully applied, may have the potential to ultimately yield\nthe most accurate results. Here, we followed a different strategy, which tries to minimize the use of nuclear databases\nas much as possible. In our inversion procedure which is solely based on virtual branches, the only place at which\ninformation from nuclear databases enters directly is in the form of the effective nuclear charge Z̄. Since Z̄ is an\naverage quantity, it is relatively straightforward to estimate the impact of both incompleteness, which we know from\ncomparing fission yields with the known entries in the database, and of errors in data itself like the pandemonium\neffect. It turns out, that Z̄ is amazingly robust with respect to these issues and never exceeds the error contributions\n14\n\n\ffrom nuclear theory. Therefore, we reason that even improved databases would barely change our result.\nIn combination all our, quantified, error sources lead to total errors which are close to the ones found previously [6].\nAt high energies our errors are consistently larger, whereas at lower energies they are either slightly smaller for the\ncase of 235 U or slightly larger for the 2 Plutonium isotopes, where \"slightly\" means of the order 0.5%.\n\nVI.\n\nSUMMARY AND CONCLUSION\n\nWe present a new inversion of the total β-spectra from fission fragments obtained at ILL [7–9] employing only\nvirtual β-branches. Our analysis is based on the original data [48], which have finer binning, 50 keV for 235 U and\n100 keV for 239 Pu and 241 Pu, compared to the published numbers [7–9], but are otherwise identical. In comparison\nto Refs. [7–9] and [6] we treat the theoretical β-spectrum shape to a higher level of accuracy by including several\nsub-leading corrections, not previously considered in this context. Specifically, we include a more accurate treatment\nof finite size effects, screening and the radiative QED correction for the neutrino, for details see section II. All of these\ncorrections to a allowed β-spectrum are applied at a branch-by-branch level, which was not done in Refs. [7–9], where\nonly an average correction was applied. The only point at which nuclear structure information enters this calculation\nis in the form of the effective nuclear charge Z̄, which is derived in section III B. Combining all these ingredients we\nfind the fluxes as listed in tables VII-IX. Our results averaged over all energies are in very good agreement with the\nresults found in Ref. [6] and confirm the overall 2-3% shift relative to the original inversion [7–9], while at the same\ntime the β-spectrum residuals are very small, which was not the case in previous analyzes [6].\nWe put a particular emphasis on evaluating the errors of the final neutrino fluxes. We analyzed the associated\ntheory errors and found, that only the contributions from induced currents, for which we studied the weak magnetism\nterm as the leading contribution, have appreciable theory errors. Our overall theory error is similar to the values\npreviously quoted [6–9], however the origin is different, in our case, it being solely due to the difficulties to estimate\nthe size of the weak magnetism correction. We also point out, that there are certain nuclei like 14 C in which the\nweak magnetism correction is anomalously large due to a suppression of the Gamow-Teller matrix element. A small\nabundance of nuclei of this kind in fission fragments could enhance the weak magnetism term greatly, see section II.\nAs a matter of fact, this enhancement could be large enough to account for a large fraction of the flux shift found here\nand in Ref. [6] and thus may provide a Standard Model explanation of the reactor anomaly [10] without the need for\nsterile neutrinos. While we are not advocating this solution to the reactor anomaly throughout this work, it seems\nthat Occam's razor warrants a closer look into this possibility. We provide an estimate of the effects incompleteness\nand inevitable inaccuracies of the nuclear structure data have on the determination of the effective nuclear charge Z̄,\nsee section III B. We evaluate the inversion errors by using synthetic data sets based on cumulative fission yields and\nthe ENSDF database and use Monte Carlo simulations to \"measure\" the bias and statistical error. We find, that the\nbias generated by our method is quite small, in agreement with earlier results [45]. The statistical errors are sizable\nand typically several times larger in the neutrino spectrum than in the underlying β-spectrum, see section III A. The\nresulting total errors are similar to previous ones [6] at low energies, however they are larger for the few highest\nenergy bins. Based on these errors we find averaged over all energies excellent agreement with the results of Ref. [6],\nhowever if we look at the energy dependence we do find significant shape differences, particular at high energies.\nThese difference should be accessible to measurement, provided a large enough neutrino event sample of the order 106\nevents can be obtained, see table IV.\nAs far as the origin of the shift relative to the original results [7–9] is concerned, we find that both the form of the\neffective nuclear charge Z̄ and the use of an average correction to the allowed β-shape contribute at a similar level.\nThere are now two independent and complementary analyzes, which find the same sign and approximate magnitude\nof this shift. However, relevant differences between the two analyzes do exist, which can be briefly summarized as:\nour analysis uses finer binned input data and consequently has much smaller β-spectrum residuals; we use a more\ndetailed treatment of corrections to the allowed β-spectrum shape and derive the associated errors from this more\ndetailed treatment; we compute the inversion errors, both bias and statistical, based on synthetic data sets; finally,\nwe estimate the errors due to incomplete or incorrect nuclear structure data.\nThe aforementioned differences make it seem worthwhile to analyze existing reactor data using our results in a spirit\nsimilar to Ref. [10] and to investigate whether an actual neutrino spectrum measurement can distinguish between the\ntwo calculations [52]. The differences tend to be largest at high neutrino energies, where typically also the largest\ndifferences between the neutrino fluxes from the various isotopes are found [49], thus the impact of these new fluxes\nand associated errors on neutrino safeguards schemes warrants further study.\n15\n\n\fACKNOWLEDGMENTS\n\nForemost, I would like to thank K. Schreckenbach for his generosity to make his original data available to me and all\nthe information he provided along with it. I also would like to thank D. Lhuillier and collaborators for their extensive,\nhelpful comments and for making the β-endpoints, branching fractions and simple β-spectra derived from the ENSDF\ndatabase available. I need to thank B. Holstein for his clarifications on weak magnetism and induced currents.\nFurthermore, I would like to acknowledge useful discussions and exchanges with J. Link, L. Piilonen, R. Raghavan. I\nam particularly indebted to P. Vogel who pointed out significant errors in Tab. I in an earlier version of this manuscript.\nThis work has been supported by the U.S. Department of Energy under award number DE-SC0003915.\n\n[1]\n[2]\n[3]\n[4]\n[5]\n[6]\n[7]\n[8]\n[9]\n[10]\n[11]\n[12]\n[13]\n[14]\n[15]\n[16]\n[17]\n[18]\n[19]\n[20]\n[21]\n[22]\n[23]\n[24]\n[25]\n[26]\n[27]\n[28]\n[29]\n[30]\n[31]\n[32]\n[33]\n[34]\n[35]\n[36]\n[37]\n[38]\n[39]\n[40]\n[41]\n[42]\n[43]\n[44]\n[45]\n[46]\n[47]\n[48]\n\nC. L. Cowan, F. Reines, F. B. Harrison, H. W. Kruse, and A. D. McGuire, Science 124, 103 (1956)\nC. Bemporad, G. Gratta, and P. Vogel, Rev. Mod. Phys. 74, 297 (2002), arXiv:hep-ph/0107277\nF. Ardellier et al. (Double Chooz Collaboration)(2006), arXiv:hep-ex/0606025 [hep-ex]\nX. Guo et al. (Daya-Bay Collaboration)(2007), arXiv:hep-ex/0701029 [hep-ex]\nJ. Ahn et al. (RENO Collaboration)(2010), arXiv:1003.1391 [hep-ex]\nT. A. Mueller et al., Phys. Rev. C 83, 054615 (May 2011), arXiv:1101.2663 [hep-ex]\nK. Schreckenbach, G. Colvin, W. Gelletly, and F. Von Feilitzsch, Phys.Lett. B160, 325 (1985)\nF. Von Feilitzsch, A. Hahn, and K. Schreckenbach, Phys.Lett. B118, 162 (1982)\nA. Hahn, K. Schreckenbach, G. Colvin, B. Krusche, W. Gelletly, et al., Phys.Lett. B218, 365 (1989)\nG. Mention et al., Phys.Rev. D83, 073006 (2011), arXiv:1101.2755 [hep-ex]\nJ. Kopp, M. Maltoni, and T. Schwetz arXiv:1103.4570 [hep-ph]\nD. Wilkinson, Nucl. Phys. Inst. and Meth. A 275, 378 (1989)\nE. Fermi, Z. Phys. 88, 161 (1934)\nH. Behrens and J. Jänecke, Landoldt-Börnstein Tables, Gruppe I, Vol. 4 (Springer, Berlin, 1969)\nD. Wilkinson, Nucl. Phys. Inst. and Meth. A 290, 509 (1990)\nH. Behrens and W. Bühring, Electron Radial Wave Functions and Nuclear Beta Decay (Clarendon, Oxford, 1982)\nL. R. B. Elton, Nucl. Phys. 5, 173 (1958)\nD. H. Wilkinson and B. E. F. Macefield, Nuclear Physics A 232, 58 (1974), ISSN 0375-9474\nA. Sirlin, Phys. Rev. 164, 1767 (Dec 1967)\nI. S. Batkin and M. K. Sundaresan, Phys. Rev. D 52, 5362 (Nov 1995)\nA. Sirlin arXiv:1105.2842 [hep-ph]\nM. Gell-Mann, Phys. Rev. 111, 362 (1958)\nB. R. Holstein, Rev. Mod. Phys. 46, 789 (1974)\nP. Vogel, Phys. Rev. D29, 1918 (1984)\nC. S. Wu, Y. K. Lee, and L. W. Mo, Phys. Rev. Lett. 39, 72 (1977)\nF. P. Calaprice and B. R. Holstein, Nucl. Phys. A 273, 301 (1976)\nhttp://www.nndc.bnl.gov/ensdf/\nHu, Tilley, J. Kelley, et al., Nucl. Phys. A 708, 3 (2002)\nF. Ajzenberg-Selove, Nucl. Phys. A 523, 1 (1991)\nF. Ajzenberg-Selove and J. Kelley, Nucl. Phys. A 506, 1 (1990)\nD. Tilley, H. Weller, C. Cheves, and Chasteler, Nucl. Phys. A 595, 1 (1995)\nD. R. Tilley, C. Cheves, J. Kelley, S. Raman, and H. Weller, Nucl. Phys. A 636, 249 (1998)\nR. B. Firestone, Nuclear Data Sheets 106, 1 (2005)\nR. B. Firestone, Nuclear Data Sheets 108, 2319 (2007)\nP. M. Endt, J. Blachot, R. Firestone, and J. Zipkin, Nucl. Phys. A 633, 1 (1998)\nP. M. Endt and R. B. Firestone, Nucl. Phys. A 633, 1 (1998)\nB. Singh, Tech. Rep. (ENSDF, 2004)\nK. Takahashi, Progress of Theoretical Physics 45, 1466 (1971), http://ptp.ipap.jp/link?PTP/45/1466/\nB. Davis, P. Vogel, F. Mann, and R. Schenter, Phys.Rev. C19, 2259 (1979)\nI. Avignone, F.T. and C. Greenwood, Phys.Rev. C22, 594 (1980)\nP. Vogel, G. Schenter, F. Mann, and R. Schenter, Phys.Rev. C24, 1543 (1981)\nH. Klapdor and J. Metzinger, Phys.Lett. B112, 22 (1982)\nH. Klapdor and J. Metzinger, Phys.Rev.Lett. 48, 127 (1982)\nI. J. D. Craig and J. C. Brown, Inverse Problems in Astronomy: a guide to inversion strategies for remotely sensed data\n(Adam Hilger Ltd, 1986)\nP. Vogel, Phys. Rev. C76, 025504 (2007), arXiv:0708.0556 [hep-ph]\nhttp://www.oecd-nea.org/dbforms/data/eva/evatapes/jeff 31/index-JEFF3.1.1.html\nJ. C. Hardy et al., Phys. Lett B. 71, 307 (1977)\nK. Schreckenbach, private communication\n\n16\n\n\f[49]\n[50]\n[51]\n[52]\n\nP. Huber and T. Schwetz, Phys. Rev. D70, 053011 (2004), arXiv:hep-ph/0407026\nhttp://www.phys.vt.edu/∼pahuber/reactorfluxes\nP. Vogel and J. F. Beacom, Phys. Rev. D60, 053003 (1999), hep-ph/9903554\nE. Christensen and P. Huber in preparation\n\nAppendix A: Supporting Data\n\nb1\nb2\nb3\nb4\nb5\na−1\n0.115 -1.8123 8.2498 -11.223 -14.854\na0 -0.00062 0.007165 0.01841 -0.53736 1.2691\na1 0.02482 -0.5975 4.84199 -15.3374 23.9774\na2 -0.14038 3.64953 -38.8143 172.137 -346.708\na3 0.008152 -1.15664 49.9663 -273.711 657.629\na4\n1.2145 -23.9931 149.972 -471.299 662.191\na5\n-1.5632 33.4192 -255.133 938.53 -1641.28\n\nb6\n32.086\n-1.5467\n-12.6534\n288.787\n-603.703\n-305.68\n1095.36\n\nTABLE V. A reproduction of table 1 of Ref. [15].\n\n1\n8\n13\n16\n23 27\n29\n49\n84\n92\nZ̃\nN (Z̃) 1.000 1.420 1.484 1.497 1.52 1.544 1.561 1.637 1.838 1.907\nTABLE VI. A reproduction of table 4.7 of Ref. [16].\n\n17\n\n\fAppendix B: The Fluxes\n\nvalue\nEν β-res. Nν̄ bias\nNν̄\nstat. bias err.\nMeV %\n%\nfission−1 MeV−1 %\n%\n2.\n0\n−0.3\n1.32\n0.57 0.055\n\n1 σ errors\nZ̄\nWM norm. total\n%\n%\n%\n%\n+0\n+0.14\n1.7\n1.8\n−0.008\n−0.2\n\n2.25 −0.5\n\n+0.0074\n0\n+0.012\n0\n+0.0047\n0\n+0\n−0.013\n+0\n−0.043\n+0\n−0.083\n+0\n−0.13\n+0\n−0.2\n+0\n−0.27\n+0\n−0.36\n+0\n−0.45\n+0\n−0.56\n+0\n−0.68\n+0\n−0.81\n+0\n−0.95\n+0\n−1.1\n+0\n−1.3\n+0\n−1.4\n+0\n−1.6\n+0\n−1.8\n+0\n−2.\n+0\n−2.2\n+0\n−2.5\n+0\n−2.7\n\n2.5\n\n−0.6\n\n2.75 −0.4\n3.\n\n0.1\n\n−0.3\n0.1\n−0.1\n0.2\n\n1.12\n9.15 × 10\n\n0.63\n-1\n\n7.7 × 10-1\n6.51 × 10\n\n-1\n-1\n\n0.18\n\n0.66\n\n0.21\n\n0.67\n\n0.037\n\n0.71\n\n0.13\n\n3.25\n\n0\n\n−0.1\n\n5.53 × 10\n\n0.7\n\n0.073\n\n3.5\n\n0\n\n−0.2\n\n4.54 × 10-1\n\n0.74\n\n0.09\n\n3.64 × 10\n\n-1\n\n0.76\n\n0.13\n\n2.94 × 10\n\n-1\n\n0.77\n\n0.061\n\n0.93\n\n0.081\n\n3.75 −0.3\n4.\n\n−0.5\n\n4.25 −0.1\n4.5\n\n0.3\n\n0.4\n0.3\n−0.3\n0\n\n2.3 × 10-1\n1.79 × 10\n\n-1\n\n1.2\n\n-1\n\n1.2\n\n0.12\n\n1.1\n\n0.047\n\n0.98\n\n0.039\n\n4.75 −0.3\n\n0.4\n\n1.38 × 10\n\n−0.1\n\n0.4\n\n1.1 × 10-1\n\n5.\n5.25\n\n0.2\n\n0.4\n\n8.64 × 10\n\n-2\n-2\n\n5.5\n\n−0.1\n\n1.\n\n6.46 × 10\n\n5.75\n\n0\n\n0.7\n\n5.1 × 10-2\n\n6.\n\n0.4\n\n6.25 −0.2\n\n0.3\n−0.3\n\n0.11\n\n1.1\n\n0.087\n\n1.2\n\n0.081\n\n3.89 × 10\n\n-2\n\n1.5\n\n0.041\n\n2.87 × 10\n\n-2\n\n1.6\n\n0.14\n\n-2\n\n−0.3\n\n−0.4\n\n2.17 × 10\n\n1.4\n\n0.11\n\n6.75 −0.3\n\n−0.1\n\n1.61 × 10-2\n\n1.5\n\n0.078\n\n1.14 × 10\n\n-2\n\n1.7\n\n0.22\n\n7.17 × 10\n\n-3\n\n2.4\n\n0.24\n\n−0.6\n\n4.64 × 10-3\n\n2.6\n\n0.39\n\n−0.7\n\n2.97 × 10\n\n-3\n\n3.1\n\n0.19\n\n1.62 × 10\n\n-3\n\n5.7\n\n0.55\n\n6.5\n7.\n\n0.1\n\n7.25 −0.1\n7.5\n7.75\n8.\n\n0.1\n0.2\n0.1\n\n0.1\n0.1\n\n−2.5\n\n+0.017\n−0.063\n+0.076\n−0.11\n+0.21\n−0.24\n+0.35\n−0.36\n\n1.7\n\n1.8\n\n1.7\n\n1.9\n\n1.7\n\n1.9\n\n1.8\n\n1.9\n\n0.49\n\n1.8\n\n2.\n\n+0.63\n−0.62\n+0.77\n−0.75\n+0.91\n−0.87\n\n1.8\n\n2.\n\n1.8\n\n2.1\n\n1.8\n\n2.1\n\n1.\n\n1.8\n\n2.3\n\n+1.2\n−1.1\n\n1.8\n\n2.5\n\n1.3\n\n1.8\n\n2.5\n\n+1.5\n−1.4\n+1.6\n−1.5\n+1.7\n−1.6\n+1.9\n−1.8\n+2.\n−1.9\n+2.2\n−2.\n+2.3\n−2.1\n+2.4\n−2.3\n+2.6\n−2.4\n+2.7\n−2.5\n+2.8\n−2.7\n+3.\n−2.8\n+3.1\n−2.9\n\n1.8\n\n2.6\n\n1.8\n\n2.6\n\n1.8\n\n+2.7\n−2.8\n+2.9\n−3.\n+3.1\n−3.2\n+3.3\n−3.4\n+3.3\n−3.5\n+3.4\n−3.7\n+3.6\n−3.9\n+4.1\n−4.5\n+4.3\n−4.8\n+4.7\n−5.2\n+6.8\n−7.2\n\n1.8\n1.8\n1.9\n1.9\n1.9\n1.9\n1.9\n1.9\n1.9\n1.9\n\nTABLE VII. Results for the 235 U anti-neutrino spectrum. This spectrum corresponds to 12 h irradiation time. The β-residuals\nare given for information only and they do not enter into the computation of the errors. The errors in columns 5 and 6 are fully\nuncorrelated, whereas the errors in columns 7 and 8 are fully correlated between bins and isotopes. The errors in column 9 are\nfully correlated between bins and isotopes.\n\n18\n\n\fvalue\nEν β-res. Nν̄ bias\nNν̄\nstat. bias err.\n−1\n−1\nMeV %\n%\nfission MeV\n%\n%\n2. −0.6\n0\n1.08\n1.7\n0.24\n2.25 −0.5\n2.5\n2.75\n\n0\n0.2\n\n0.2\n−0.1\n−0.2\n\n9.2 × 10-1\n7.19 × 10\n\n-1\n\n-1\n\n6.2 × 10\n\n5.15 × 10\n\n-1\n\n1.7\n\n0.43\n\n1.5\n\n0.27\n\n1.6\n\n0.12\n\n3.\n\n0.2\n\n0\n\n2.\n\n0.2\n\n3.25\n\n0.2\n\n−0.1\n\n3.98 × 10-1\n\n2.2\n\n0.12\n\n−0.4\n\n3.29 × 10\n\n-1\n\n2.4\n\n0.0057\n\n2.61 × 10\n\n-1\n\n3.5\n\n−0.1\n\n3.75\n\n0.5\n\n0.1\n\n2.3\n\n0.2\n\n4.\n\n0.6\n\n−0.1\n\n1.95 × 10-1\n\n2.4\n\n0.2\n\n−0.5\n\n1.57 × 10\n\n-1\n\n3.1\n\n0.21\n\n1.13 × 10\n\n-1\n\n4.25\n\n1.2\n\n4.5\n\n1.1\n\n−0.5\n\n4.1\n\n0.33\n\n4.75\n\n1.3\n\n0.3\n\n8.33 × 10-2\n\n4.2\n\n0.54\n\n0.7\n\n6.13 × 10\n\n-2\n\n3.8\n\n0.16\n\n-2\n\n5.\n\n0.3\n\n5.25\n\n0.6\n\n0.8\n\n4.83 × 10\n\n4.2\n\n0.22\n\n5.5\n\n−0.7\n\n1.3\n\n3.54 × 10-2\n\n4.9\n\n0.004\n\n0.8\n\n2.92 × 10\n\n-2\n\n5.5\n\n0.16\n\n1.92 × 10\n\n-2\n\n7.8\n\n0.28\n\n8.7\n\n0.15\n\n5.75\n\n0.1\n\n6.\n\n−0.4\n\n0.1\n\n6.25\n\n0.2\n\n−0.7\n\n1.28 × 10-2\n\n−0.2\n\n9.98 × 10\n\n-3\n\n9.1\n\n0.39\n\n7.54 × 10\n\n-3\n\n9.9\n\n0.12\n\n4.98 × 10-3\n\n12.\n\n0.33\n\n3.26 × 10\n\n-3\n\n18.\n\n1.1\n\n1.95 × 10\n\n-3\n\n22.\n\n0.78\n\n8.47 × 10-4\n\n26.\n\n3.1\n\n-4\n\n28.\n\n7.7\n\n6.5\n\n−0.9\n\n6.75\n\n2.9\n\n−0.2\n\n7.\n\n−4.\n\n0.3\n\n7.25 −0.6\n7.5\n\n−0.4\n\n7.75 −0.2\n8.\n\n−3.1\n\n−0.1\n−2.3\n2.\n−4.4\n\n5.87 × 10\n\n1 σ errors\nWM norm. total\nZ̄\n%\n%\n%\n%\n+0.055\n+0.073\n1.9\n2.6\n0\n−0.11\n+0.029\n0\n+0\n−0.000029\n+0\n−0.032\n+0\n−0.068\n+0\n−0.11\n+0\n−0.15\n+0\n−0.19\n+0\n−0.24\n+0\n−0.29\n+0\n−0.35\n+0\n−0.4\n+0\n−0.46\n+0\n−0.53\n+0\n−0.6\n+0\n−0.67\n+0\n−0.74\n+0\n−0.82\n+0\n−0.9\n+0\n−0.98\n+0\n−1.1\n+0\n−1.2\n+0\n−1.2\n+0\n−1.3\n+0\n−1.4\n\n+0.031\n−0.055\n+0.17\n−0.18\n\n2.\n\n2.6\n\n2.\n\n2.5\n\n0.31\n\n2.\n\n2.6\n\n0.44\n\n2.1\n\n2.9\n\n+0.58\n−0.56\n+0.72\n−0.69\n+0.86\n−0.82\n+0.99\n−0.95\n\n2.1\n\n3.1\n\n2.1\n\n3.3\n\n2.2\n\n3.3\n\n2.2\n\n3.4\n\n1.1\n\n2.2\n\n4.\n\n+1.3\n−1.2\n+1.4\n−1.3\n\n2.3\n\n4.9\n\n2.3\n\n5.\n\n1.5\n\n2.3\n\n4.7\n\n+1.7\n−1.6\n+1.8\n−1.7\n+2.\n−1.8\n+2.1\n−2.\n+2.2\n−2.1\n+2.4\n−2.2\n+2.5\n−2.3\n+2.6\n−2.5\n+2.8\n−2.6\n+2.9\n−2.7\n+3.1\n−2.9\n+3.2\n−3.\n\n2.4\n\n5.1\n\n2.4\n\n5.7\n\n2.5\n\n6.4\n\n2.5\n\n8.5\n\n2.5\n\n9.4\n\n2.6\n\n+9.7\n−9.8\n\n2.6\n\n11.\n\n2.6\n\n13.\n\n2.7\n\n18.\n\n2.7\n\n23.\n\n2.7\n\n27.\n\n2.8\n\n29.\n\nTABLE VIII. Results for the 239 Pu anti-neutrino spectrum. This spectrum corresponds to 36 h irradiation time. The βresiduals are given for information only and they do not enter into the computation of the errors. The errors in columns 5\nand 6 are fully uncorrelated, whereas the errors in columns 7 and 8 are fully correlated between bins and isotopes. The errors\nin column 9 are fully correlated between bins and isotopes.\n\n19\n\n\fvalue\n1 σ errors\nEν β-res. Nν̄ bias\nNν̄\nstat. bias err.\nWM norm. total\nZ̄\n−1\n−1\nMeV %\n%\nfission MeV\n%\n%\n%\n%\n%\n%\n+0.16\n0\n2\n0\n0.1\n1.26\n1.7\n0.18\n1.8\n2.5\n−0.18\n0\n2.25\n2.5\n2.75\n\n0\n0.1\n0\n\n−0.2\n0.1\n−0.3\n\n1.08\n\n1.6\n\n0.34\n\n-1\n\n1.4\n\n0.33\n\n-1\n\n1.4\n\n0.2\n\n-1\n\n8.94 × 10\n7.77 × 10\n\n3\n\n0\n\n−0.2\n\n6.41 × 10\n\n1.6\n\n0.12\n\n3.25\n\n0\n\n−0.3\n\n5.36 × 10-1\n\n1.6\n\n0.15\n\n−0.1\n\n-1\n\n1.6\n\n0.22\n\n3.5\n\n0\n\n4.39 × 10\n\n-1\n\n3.75\n\n0\n\n0.1\n\n3.46 × 10\n\n1.4\n\n0.2\n\n4\n\n0\n\n0.2\n\n2.82 × 10-1\n\n1.5\n\n0.11\n\n1.9\n\n0.17\n\n4.25\n\n0\n\n−0.3\n\n4.5\n\n0.1\n\n0\n\n4.75\n\n0\n\n0.9\n\n5\n\n0.1\n\n1.\n\n-1\n\n2.2 × 10\n\n-1\n\n1.66 × 10\n\n2.5\n\n0.29\n\n1.25 × 10-1\n\n2.5\n\n0.48\n\n-2\n\n2.3\n\n0.033\n\n-2\n\n9.74 × 10\n\n5.25\n\n0\n\n1.\n\n7.47 × 10\n\n2.3\n\n0.14\n\n5.5\n\n0\n\n1.6\n\n5.58 × 10-2\n\n2.6\n\n0.13\n\n0.9\n\n-2\n\n3.2\n\n0.21\n\n5.75\n\n0\n\n4.11 × 10\n\n-2\n\n6\n\n−0.2\n\n0.2\n\n3.05 × 10\n\n4.\n\n0.09\n\n6.25\n\n0.3\n\n−0.6\n\n1.98 × 10-2\n\n4.4\n\n0.33\n\n−0.3\n\n-2\n\n4.5\n\n0.43\n\n-2\n\n6.5\n\n−0.1\n\n1.54 × 10\n\n6.75\n\n0\n\n−0.1\n\n1.09 × 10\n\n4.7\n\n0.074\n\n7\n\n0\n\n0.6\n\n7.75 × 10-3\n\n4.8\n\n0.39\n\n0.4\n\n-3\n\n6.3\n\n0.36\n\n7.25\n\n0.1\n\n4.47 × 10\n\n-3\n\n7.5\n\n−0.3\n\n−1.\n\n2.9 × 10\n\n7.7\n\n0.3\n\n7.75\n\n0\n\n−0.4\n\n1.78 × 10-3\n\n8.3\n\n0.063\n\n−3.5\n\n-3\n\n12.\n\n0.63\n\n8\n\n0.7\n\n1.06 × 10\n\n+0.13\n0\n+0.079\n0\n+0.024\n0\n+0\n−0.041\n+0\n−0.12\n+0\n−0.2\n+0\n−0.29\n+0\n−0.39\n+0\n−0.5\n+0\n−0.62\n+0\n−0.75\n+0\n−0.89\n+0\n−1.\n+0\n−1.2\n+0\n−1.4\n+0\n−1.5\n+0\n−1.7\n+0\n−1.9\n+0\n−2.1\n+0\n−2.3\n+0\n−2.5\n+0\n−2.8\n+0\n−3.\n+0\n−3.3\n\n0\n−0.12\n\n1.8\n\n2.4\n\n+0.099\n−0.23\n+0.24\n−0.34\n+0.38\n−0.46\n+0.52\n−0.57\n+0.65\n−0.68\n+0.79\n−0.8\n+0.93\n−0.91\n+1.1\n−1.\n+1.2\n−1.1\n+1.3\n−1.2\n+1.5\n−1.4\n+1.6\n−1.5\n+1.8\n−1.6\n+1.9\n−1.7\n+2.\n−1.8\n+2.2\n−1.9\n+2.3\n−2.\n+2.5\n−2.2\n+2.6\n−2.3\n+2.7\n−2.4\n+2.9\n−2.5\n+3.\n−2.6\n+3.2\n−2.7\n\n1.8\n\n2.3\n\n1.8\n\n2.3\n\n1.8\n\n2.4\n\n1.8\n\n2.5\n\n1.8\n\n2.5\n\n1.8\n\n+2.4\n−2.5\n\n1.8\n\n2.6\n\n1.9\n\n2.9\n\n1.9\n\n+3.3\n−3.4\n\n1.9\n\n3.5\n\n1.9\n\n+3.3\n−3.4\n+3.4\n−3.5\n+3.6\n−3.8\n+4.2\n−4.3\n+4.9\n−5.\n+5.3\n−5.5\n+5.4\n−5.7\n+5.6\n−5.9\n+5.8\n−6.1\n+7.2\n−7.5\n+8.4\n−8.8\n+9.1\n−9.4\n+12.\n−13.\n\n1.9\n1.9\n1.9\n1.9\n1.9\n1.9\n1.9\n1.9\n2.\n2.\n2.\n2.\n\nTABLE IX. Results for the 241 Pu anti-neutrino spectrum. This spectrum corresponds to 43 h irradiation time. The β-residuals\nare given for information only and they do not enter into the computation of the errors. The errors in columns 5 and 6 are fully\nuncorrelated, whereas the errors in columns 7 and 8 are fully correlated between bins and isotopes. The errors in column 9 are\nfully correlated between bins and isotopes.\n\n20\n\n\f"}