{"id": "http://arxiv.org/abs/1101.2397v1", "guidislink": true, "updated": "2011-01-12T16:21:49Z", "updated_parsed": [2011, 1, 12, 16, 21, 49, 2, 12, 0], "published": "2011-01-12T16:21:49Z", "published_parsed": [2011, 1, 12, 16, 21, 49, 2, 12, 0], "title": "Uniqueness of the Fock quantization of fields with unitary dynamics in\n  nonstationary spacetimes", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1101.5414%2C1101.3689%2C1101.1816%2C1101.4878%2C1101.2145%2C1101.0330%2C1101.2429%2C1101.3680%2C1101.5084%2C1101.1366%2C1101.4469%2C1101.1931%2C1101.3262%2C1101.0456%2C1101.1557%2C1101.2548%2C1101.4105%2C1101.3141%2C1101.5778%2C1101.0172%2C1101.5875%2C1101.4622%2C1101.2364%2C1101.1970%2C1101.4308%2C1101.2397%2C1101.3181%2C1101.1301%2C1101.5005%2C1101.1679%2C1101.3801%2C1101.6004%2C1101.1994%2C1101.2560%2C1101.2032%2C1101.0723%2C1101.5466%2C1101.1067%2C1101.3383%2C1101.4143%2C1101.2758%2C1101.2265%2C1101.1323%2C1101.1650%2C1101.5789%2C1101.3300%2C1101.3330%2C1101.2109%2C1101.5299%2C1101.5128%2C1101.5306%2C1101.5171%2C1101.1467%2C1101.0726%2C1101.0639%2C1101.5359%2C1101.2500%2C1101.2863%2C1101.5249%2C1101.2797%2C1101.0405%2C1101.1048%2C1101.4057%2C1101.3420%2C1101.6072%2C1101.1287%2C1101.0522%2C1101.2298%2C1101.5280%2C1101.4342%2C1101.5049%2C1101.1201%2C1101.0273%2C1101.0155%2C1101.4524%2C1101.4704%2C1101.1577%2C1101.3530%2C1101.5994%2C1101.4354%2C1101.2907%2C1101.2214%2C1101.2807%2C1101.4787%2C1101.2735%2C1101.5028%2C1101.3421%2C1101.5471%2C1101.5013%2C1101.3935%2C1101.5276%2C1101.0802%2C1101.4182%2C1101.1984%2C1101.0574%2C1101.5110%2C1101.2441%2C1101.2398%2C1101.4663%2C1101.1729%2C1101.1890&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Uniqueness of the Fock quantization of fields with unitary dynamics in\n  nonstationary spacetimes"}, "summary": "The Fock quantization of fields propagating in cosmological spacetimes is not\nuniquely determined because of several reasons. Apart from the ambiguity in the\nchoice of the quantum representation of the canonical commutation relations,\nthere also exists certain freedom in the choice of field: one can scale it\narbitrarily absorbing background functions, which are spatially homogeneous but\ndepend on time. Each nontrivial scaling turns out into a different dynamics\nand, in general, into an inequivalent quantum field theory. In this work we\nanalyze this freedom at the quantum level for a scalar field in a\nnonstationary, homogeneous spacetime whose spatial sections have $S^3$\ntopology. A scaling of the configuration variable is introduced as part of a\nlinear, time dependent canonical transformation in phase space. In this\ncontext, we prove in full detail a uniqueness result about the Fock\nquantization requiring that the dynamics be unitary and the spatial symmetries\nof the field equations have a natural unitary implementation. The main\nconclusion is that, with those requirements, only one particular canonical\ntransformation is allowed, and thus only one choice of field-momentum pair (up\nto irrelevant constant scalings). This complements another previous uniqueness\nresult for scalar fields with a time varying mass on $S^3$, which selects a\nspecific equivalence class of Fock representations of the canonical commutation\nrelations under the conditions of a unitary evolution and the invariance of the\nvacuum under the background symmetries. In total, the combination of these two\ndifferent statements of uniqueness picks up a unique Fock quantization for the\nsystem. We also extend our proof of uniqueness to other compact topologies and\nspacetime dimensions.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1101.5414%2C1101.3689%2C1101.1816%2C1101.4878%2C1101.2145%2C1101.0330%2C1101.2429%2C1101.3680%2C1101.5084%2C1101.1366%2C1101.4469%2C1101.1931%2C1101.3262%2C1101.0456%2C1101.1557%2C1101.2548%2C1101.4105%2C1101.3141%2C1101.5778%2C1101.0172%2C1101.5875%2C1101.4622%2C1101.2364%2C1101.1970%2C1101.4308%2C1101.2397%2C1101.3181%2C1101.1301%2C1101.5005%2C1101.1679%2C1101.3801%2C1101.6004%2C1101.1994%2C1101.2560%2C1101.2032%2C1101.0723%2C1101.5466%2C1101.1067%2C1101.3383%2C1101.4143%2C1101.2758%2C1101.2265%2C1101.1323%2C1101.1650%2C1101.5789%2C1101.3300%2C1101.3330%2C1101.2109%2C1101.5299%2C1101.5128%2C1101.5306%2C1101.5171%2C1101.1467%2C1101.0726%2C1101.0639%2C1101.5359%2C1101.2500%2C1101.2863%2C1101.5249%2C1101.2797%2C1101.0405%2C1101.1048%2C1101.4057%2C1101.3420%2C1101.6072%2C1101.1287%2C1101.0522%2C1101.2298%2C1101.5280%2C1101.4342%2C1101.5049%2C1101.1201%2C1101.0273%2C1101.0155%2C1101.4524%2C1101.4704%2C1101.1577%2C1101.3530%2C1101.5994%2C1101.4354%2C1101.2907%2C1101.2214%2C1101.2807%2C1101.4787%2C1101.2735%2C1101.5028%2C1101.3421%2C1101.5471%2C1101.5013%2C1101.3935%2C1101.5276%2C1101.0802%2C1101.4182%2C1101.1984%2C1101.0574%2C1101.5110%2C1101.2441%2C1101.2398%2C1101.4663%2C1101.1729%2C1101.1890&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The Fock quantization of fields propagating in cosmological spacetimes is not\nuniquely determined because of several reasons. Apart from the ambiguity in the\nchoice of the quantum representation of the canonical commutation relations,\nthere also exists certain freedom in the choice of field: one can scale it\narbitrarily absorbing background functions, which are spatially homogeneous but\ndepend on time. Each nontrivial scaling turns out into a different dynamics\nand, in general, into an inequivalent quantum field theory. In this work we\nanalyze this freedom at the quantum level for a scalar field in a\nnonstationary, homogeneous spacetime whose spatial sections have $S^3$\ntopology. A scaling of the configuration variable is introduced as part of a\nlinear, time dependent canonical transformation in phase space. In this\ncontext, we prove in full detail a uniqueness result about the Fock\nquantization requiring that the dynamics be unitary and the spatial symmetries\nof the field equations have a natural unitary implementation. The main\nconclusion is that, with those requirements, only one particular canonical\ntransformation is allowed, and thus only one choice of field-momentum pair (up\nto irrelevant constant scalings). This complements another previous uniqueness\nresult for scalar fields with a time varying mass on $S^3$, which selects a\nspecific equivalence class of Fock representations of the canonical commutation\nrelations under the conditions of a unitary evolution and the invariance of the\nvacuum under the background symmetries. In total, the combination of these two\ndifferent statements of uniqueness picks up a unique Fock quantization for the\nsystem. We also extend our proof of uniqueness to other compact topologies and\nspacetime dimensions."}, "authors": ["Jeronimo Cortez", "Guillermo A. Mena Marugan", "Javier Olmedo", "Jose M. Velhinho"], "author_detail": {"name": "Jose M. Velhinho"}, "author": "Jose M. Velhinho", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevD.83.025002", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1101.2397v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1101.2397v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "12 pages", "arxiv_primary_category": {"term": "gr-qc", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "gr-qc", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "hep-th", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1101.2397v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1101.2397v1", "journal_reference": "Phys.Rev.D83:025002,2011", "doi": "10.1103/PhysRevD.83.025002", "fulltext": "Uniqueness of the Fock quantization of fields with unitary dynamics in nonstationary spacetimes\nJerónimo Cortez∗\nDepartamento de Fı́sica, Facultad de Ciencias, Universidad Nacional Autónoma de México, México D.F. 04510, Mexico.\n\nGuillermo A. Mena Marugán† and Javier Olmedo‡\nInstituto de Estructura de la Materia, CSIC, Serrano 121, 28006 Madrid, Spain.\n\nJosé M. Velhinho§\n\narXiv:1101.2397v1 [gr-qc] 12 Jan 2011\n\nDepartamento de Fı́sica, Universidade da Beira Interior,\nR. Marquês D'Ávila e Bolama, 6201-001 Covilhã, Portugal.\nThe Fock quantization of fields propagating in cosmological spacetimes is not uniquely determined because\nof several reasons. Apart from the ambiguity in the choice of the quantum representation of the canonical commutation relations, there also exists certain freedom in the choice of field: one can scale it arbitrarily absorbing\nbackground functions, which are spatially homogeneous but depend on time. Each nontrivial scaling turns out\ninto a different dynamics and, in general, into an inequivalent quantum field theory. In this work we analyze this\nfreedom at the quantum level for a scalar field in a nonstationary, homogeneous spacetime whose spatial sections have S 3 topology. A scaling of the configuration variable is introduced as part of a linear, time dependent\ncanonical transformation in phase space. In this context, we prove in full detail a uniqueness result about the\nFock quantization requiring that the dynamics be unitary and the spatial symmetries of the field equations have\na natural unitary implementation. The main conclusion is that, with those requirements, only one particular\ncanonical transformation is allowed, and thus only one choice of field-momentum pair (up to irrelevant constant\nscalings). This complements another previous uniqueness result for scalar fields with a time varying mass on\nS 3 , which selects a specific equivalence class of Fock representations of the canonical commutation relations\nunder the conditions of a unitary evolution and the invariance of the vacuum under the background symmetries.\nIn total, the combination of these two different statements of uniqueness picks up a unique Fock quantization\nfor the system. We also extend our proof of uniqueness to other compact topologies and spacetime dimensions.\nPACS numbers: 03.70.+k, 04.62.+v, 98.80.Qc, 04.60.-m\n\nI.\n\nINTRODUCTION\n\nThe unique character of Nature is alluded in physics by the\nuniqueness of the theories employed to describe it. In particular, by imposing appropriate physical criteria, the quantization\nof a classical system should yield a unique quantum description –up to unitary equivalence. Since the quantization process involves choices that may lead to inequivalent theories,\nthe specification of a unique description is a nontrivial task.\nEven in systems in which one already starts with a specific choice of basic canonical variables and an associated set\nof canonical commutation relations (CCR's), there exists an\nintrinsic ambiguity in the quantization process because the\nCCR's can be represented in nonequivalent ways. In the case\nof linear systems with a finite number of degrees of freedom,\nthese ambiguities are essentially suppressed by the imposition\nof certain unitarity and continuity conditions on the representation of the algebra of observables (as stated in the Stone-von\nNewmann theorem [1]), so that uniqueness follows without\nmisadventures. Nonetheless, the situation changes drastically\nin the arena of field theory. These systems accept infinite\nnonequivalent representations of the CCR's [2] and there is\n\n∗ Electronic\n\naddress: jacq@fciencias.unam.mx\naddress: mena@iem.cfmac.csic.es\n‡\nElectronic address: olmedo@iem.cfmac.csic.es\n§ Electronic address: jvelhi@ubi.pt\n† Electronic\n\nno general procedure to select a preferred quantum description. In this situation, physical results depend on the representation adopted, a fact that brings into question their significance. It is then necessary to look for additional criteria\nto warrant uniqueness and regain robustness in the quantum\npredictions.\nThe usual procedure to select a preferred representation in\nfield theory for a given set of CCR's is to exploit the classical\nsymmetries. For instance, the invariance under the Poincaré\ngroup is the criterion imposed to arrive at a unique representation in ordinary quantum field theory. Thus, if the field theory corresponds to a scalar field, Poincaré invariance, adapted\nto the dynamics of the considered theory, selects a complex\nstructure [2], which is the mathematical object that encodes\nthe ambiguity in the quantization and determines the vacuum\nstate of the Fock representation. For stationary spacetimes,\nthe time translation symmetry is exploited to formulate the\nso-called energy criterion and then select a preferred complex\nstructure [3]. But when the symmetries are severely restricted,\nas it is the case for generic curved spacetimes or for manifestly\nnonstationary systems, extra requirements must be imposed to\ncomplete the quantization process. For example, in the case\nof de Sitter space in 1 + 1 dimensions, it is possible to pick up\na unique de Sitter invariant Fock vacuum for a free scalar field\nby looking for an invariant Gaussian solution to a properly\nregulated Schrödinger equation [4].\nIn the context of quantum cosmology, the extra criterion of\na unitary implementation of the dynamics has been success-\n\n\f2\nfully employed to specify a unique, preferred Fock quantization for the Gowdy spacetimes. These are spacetimes which\npossess two spacelike Killing isometries and spatial sections\nof compact topology [5]. In the case of a three-torus topology and a content of linearly polarized gravitational waves,\nthe local gravitational degrees of freedom can be described by\na scalar field with a specific time dependent mass and which\npropagates in an auxiliary, static background with the spatial\ntopology of the circle [6]. For this choice of basic field for the\nmodel, one is able to find a unique Fock quantization which\nincorporates the background symmetries as symmetries of the\nvacuum and implements the field dynamics as a family of unitary quantum transformations [6–9].\nMore recently, in a broader context, a unitary equivalence\nclass of Fock representations has been specified for scalar\nfields with generic time varying mass, defined on spheres in\nthree or less dimensions [10, 11]. Again, the procedure consists in requiring a unitary dynamics and the vacuum invariance under the symmetries of the field equation. The particularly relevant case of the three-sphere, with the dimensionality\nobserved in our universe, was considered in Ref. [11].\nApart from the inherent ambiguity in choosing the representation of the CCR's, the quantization of fields in curved\nspace-times is affected by another kind of ambiguity. It is due\nto the freedom in choosing a specific field parametrization to\ndescribe the physical system, namely, the freedom in declaring a particular choice of field (together with its associated\ndynamics) as the fundamental one. Let us concentrate our attention on the case of homogeneous but nonstationary spacetimes, like those encountered as backgrounds in cosmology.\nIn these circumstances, it is most natural to consider field redefinitions which absorb background functions. This leads to\na scaling of the field by a time dependent function, such that\nthe linearity of the field equations and of the structures of the\nsystem are preserved. If this time dependence is nontrivial,\nthe two fields (i.e., the scaled and the unscaled ones) are governed by different dynamics. Since a change in the dynamics\ntypically calls for inequivalent representations, the construction of a quantum theory clearly depends on the selection of\na specific field description for the system among all those related by these scaling transformations.\nAs commented above, these considerations are crucial for\nquantum matter fields propagating in inflationary or cosmological backgrounds, which are spatially homogeneous but\nnot stationary. The discussion is also relevant for the quantization of local gravitational degrees of freedom, in contrast\nwith the previous context of quantum matter fields in classical spacetimes that are solutions to the gravitational field\nequations. This latter class of systems includes, e.g., the\nalready mentioned Gowdy models and the case of gravitational perturbations around cosmological backgrounds. For\nthese gravitational systems, there exists a great freedom in the\nchoice of parametrization of the metric components in terms\nof fields. In all these situations, the choice of a suitable field\nparametrization involves a time dependent scaling related to\nbackground functions and whose specific form depends on the\nparticular system under study. This choice often leads to fields\nwhich effectively propagate in an auxiliary static background,\n\ntherefore simplifying in part the corresponding dynamics, although there remain (or appear) time dependent potentials\nwhich manifest that the scenario is a nonstationary one.\nThe question immediately arises of whether it is again possible to invoke natural criteria to remove (at least in certain situations) the ambiguity that this freedom in the choice of field\nintroduces at the quantum level. A detailed analysis about this\nissue was first carried out for the quantization of the linearly\npolarized Gowdy model with three-torus topology in Ref. [9].\nThat work studied a family of linear, time dependent canonical transformations that involve a scaling of the field. It was\nproven that there actually exists no freedom left in performing\na transformation of this kind, once the criteria of invariance\nunder the remaining spatial symmetries and the unitary implementation of the dynamics are imposed. More precisely,\nRef. [9] shows that the considered transformations lead to\nnew dynamics such that one cannot attain a unitary quantum\nevolution in a Fock representation while keeping the symmetry invariance of the vacuum.1 The requirements of unitary\nevolution and invariance therefore suffice to select a specific\nscaling of the field and a privileged family of equivalent Fock\nquantizations for it. In other words, the uniqueness is guaranteed both for the choice of fundamental field (with its corresponding dynamics) and for the quantum representation of the\ncorresponding CCR's.\nOne may wonder whether the uniqueness in the choice of\nfield description can also be guaranteed in other, more general systems than the Gowdy model, and in particular for nonstationary settings where there already exist results about the\nuniqueness of the representation of the CCR's. The case of\nfields in 1+3 dimensional spacetimes with compact spatial\ntopology is specially important, owing to its applications e.g.\nto cosmology. A summary of the discussion for scalar fields\npropagating in a nonstationary spacetime with sections of S 3\ntopology was already presented by us in Ref. [12], anticipating that the answer to the question of uniqueness is in the affirmative. The aim of the present work is to provide full details\nof the demonstration of this result.\nWe will consider a scaling of the field by a generic function of time. This scaling can always be completed into a time\ndependent canonical transformation. We demand such transformation to be compatible with all linear structures on phase\nspace and with the symmetries of the field equations. Any admissible canonical transformation is then linear and, furthermore, can be divided into two parts. The first one is a linear\ncanonical transformation that is explicitly time independent\nbut takes into account the initial conditions, rendering simple\nones for the remaining part, which incorporates then all the\ntime dependence. We will demonstrate that there exists only\none possible choice of phase space variables such that the resulting field theory admits a Fock quantization with unitary\ndynamics and a natural implementation of the symmetries of\n\n1\n\nIn fact, in this particular linear system one can still introduce a redefinition\nof the momentum which implies no scaling of the field, but this turns out to\nbe irrelevant inasmuch as no new nonequivalent Fock quantization arises.\n\n\f3\nthe field equations. The unique choice which remains available is precisely the one which corresponds to a transformed\nscalar field that propagates in a static spacetime with S 3 spatial topology, though in the presence of a time varying mass\nterm. Recall that, for this latter field, the uniqueness of the\nrepresentation of the CCR's was proven in Ref. [11].\nAs we have already mentioned, the list of scenarios where\nthis result finds direct applications includes the case of inflationary models where a scalar field with constant mass propagates in a Friedmann-Robertson-Walker (FRW) spacetime\nwith compact spatial topology. In this case, one can check\nthat a linear, time dependent canonical transformation allows\none to rewrite the field equation as that of a field in a spacetime with identical spatial topology but static, whereas the\nmass becomes time varying. Another type of situations where\nour result has implications is given by the quantization of (inhomogeneous) perturbations around nonstationary homogeneous solutions of the Einstein equations, typically cosmological backgrounds [13–17]. Examples are the gauge-invariant\nenergy density perturbation amplitude in an FRW spacetime\nwith S 3 spatial topology filled with a perfect fluid (when the\nperturbations of the energy-momentum tensor are adiabatic\n[14, 16]) or the matter perturbations around the same FRW\nspacetime for a massive scalar field [18]. With a suitable scaling (and in an appropriate gauge in the case of the massive\nfield), the corresponding equations of motion can be related to\nthose of a scalar field in a static spacetime with a time dependent mass term (see Ref. [9] for additional details). At this\npoint, it may be worth commenting that, although flat FRW\nuniverses receive a special attention in cosmology nowadays,\nsome recent works find reasons to prefer closed FRW models with S 3 topology, for example from the point of view of\nperturbation theory in relation with the choice of appropriate gauges which embody Mach's principle [19], or in an attempt to account for a low microwave background quadrupole\n[20, 21]. On the other hand, we will argue later on that our results can be generalized to the case of flat but compact FRW\nuniverses.\nIn summary, the question that we are going to investigate\nis whether the criteria of unitary dynamics and invariance of\nthe vacuum under the symmetries of the field equation select a\nunique Fock quantization among all those arising from different time dependent scalings of the field. We will concentrate\nour discussion on the case that a particular scaling renders the\ndynamics into that of a scalar field with time varying mass\npropagating in a static spacetime, with inertial spatial sections that have the topology of a three-sphere. We will study\nat the quantum level the consequences of local, time dependent canonical transformations which involve a scaling of the\nfield. These transformations must preserve the invariance of\nthe field equation under the group of symmetries and the linearity of the space of solutions. Transformations of this kind\nconsist of a scaling of the configuration variable by a function\nof time, the inverse scaling of the canonical momentum, and\npossibly a contribution to the momentum that is linear in the\nconfiguration variable, the proportionality factor being time\ndependent. Our main goal in this work is to provide a full\nproof demonstrating that the canonical transformation is so\n\nseverely restricted by our criteria that it turns out to be fixed.\nIn addition, we will argue that the analysis can be generalized\nto lower dimensions, replacing the three-sphere with S 2 or S 1\n(for this last case, see Ref. [9]), as well as to other compact\ntopologies.\nThe content of the paper is organized as follows. In Sec.\nII we summarize the results that are already known about the\nFock quantization of a scalar field with a time varying mass in\na static spacetime whose spatial sections have the topology of\nS 3 . In Sec. III we introduce the linear, time dependent canonical transformation which accounts for the scaling of the field\nand discuss its consequences at the quantum level. Sec. IV\ncontains the detailed proof that only one of these canonical\ntransformations leads to a field dynamics which is compatible\nwith our criteria of a quantum unitary evolution and the symmetry invariance of the vacuum. We discuss the results and\nconclude in Sec. V. Finally, an appendix which deals with\nsome technical parts of our demonstration is added.\nII.\n\nPRELIMINARIES: THE SYSTEM AND THE FOCK\nQUANTIZATION OF REFERENCE\n\nLet us start by reviewing some of the key aspects and results\nabout the Fock quantization of a real scalar field φ subject\nto a time dependent potential V(φ) = s(t)φ2 /2, where s(t) is\nin principle any regular function of time (conditions on this\nfunction will be introduced later on). The field propagates in a\nstatic background in 1 + 3 dimensions whose Cauchy surfaces\nare three-spheres, equipped with the standard round metric\ni\nh\n(1)\nhab dxa dxb = dχ2 + sin2 (χ) dθ2 + sin2 (θ)dσ2 .\nHere, χ and θ have a range of π, and σ ∈ S 1 . The time coordinate t runs over an interval I of the real line, so that the\nspacetime has the topology of I × S 3 . Its metric is\nds2 = −dt2 + hab dxa dxb .\n\n(2)\n\nIn the canonical approach, the dynamics of the system are\ngoverned by the equations\n√ \u0002\n\u0003\n1\nṖφ = h ∆φ − s(t)φ ,\nφ̇ = √ Pφ ,\n(3)\nh\nwhere Pφ is the canonical momentum of φ, h = sin2 (θ) sin4 (χ)\nis the determinant of the metric (1), ∆ denotes the LaplaceBeltrami operator on S 3 , and the dot stands for the time\nderivative.\nThe canonical phase space of the theory is a symplectic linear space Γ coordinatized by the field variables (φ, Pφ ) (evaluated on a particular Cauchy section, e.g. the section t = t0 for\na given value of time t0 ) and endowed with a symplectic structure Ω such that these variables form a canonical pair, namely\ntheir corresponding Poisson bracket is:\n{φ(x), Pφ (y)} = δ(3) (x − y),\n\n(4)\n\nwhere the Dirac delta is defined on S 3 . The Eqs. of motion\n(3) amount to the linear wave equation\nφ̈ − ∆φ + s(t)φ = 0.\n\n(5)\n\n\f4\nSince the Laplace-Beltrami operator on S 3 is invariant under\nthe rotation group SO(4), the above equation is clearly invariant under this group as well. On the other hand, notice by\ncomparison with the Klein-Gordon equation that a nonnegative function s(t) can be interpreted as an effective nonnegative\ntime dependent mass m(t) = s1/2 (t).\nOwing to the field character of the theory, the system accepts infinite nonequivalent representations of the CCR's. Restricting one's attention to representations of the Fock type,\nthis freedom is encoded in the complex structure, which is a\nlinear symplectic map j : Γ → Γ, compatible with the symplectic structure [in the sense that the bilinear map Ω( j*, *)\nis positive-definite], and such that j2 = −1 (see e.g. Refs.\n[2, 22, 23]). Different choices of complex structure select distinct, in general not unitarily related, spaces of quantum states\nfor the theory; thus, physical predictions depend on the choice\nof j.\nActually, as we have mentioned, it has been proven recently\nthat, in the (φ, Pφ) description, there exists one (and only one)\nsubfamily of equivalent complex structures satisfying the criteria of SO(4) invariance and a unitary implementation of the\ndynamics. Let us sketch the main steps of the proof and explain the corresponding quantization [11]. Given the invariance of the field equation under SO(4), it is convenient to expand the field in terms of (hyper-)spherical harmonics Qnlm ,\nwhere the integer n satisfies n ≥ 0, and the integers l and m\nare constrained by 0 ≤ l ≤ n and |m| ≤ l [13, 24, 25]. In this\nbasis, the Laplace-Beltrami operator ∆ is diagonal with eigenvalues equal to −n(n + 2). Although the (hyper-)spherical harmonics are complex functions, it is straightforward to obtain\na real basis from the real and imaginary parts of Qnlm , with\nwhich one can directly expand the real field φ (see Ref. [11]\nfor details). The degrees of freedom are represented by the\ncoefficients qnlm in this expansion, which can be understood\nas a discrete set of modes. These are functions of time which\nsatisfy the linear equation\nh\ni\nq̈nlm + ω2n + s(t) qnlm = 0,\n(6)\nwith ω2n = n(n+2). Hence, the modes qnlm are decoupled from\neach other. Besides, together with their canonically conjugate\nmomenta pnlm = q̇nlm , they form a complete set of variables in\nphase space. For each fixed value of n, there exist gn = (n+1)2\nmodes with the same dynamics, because the equation of motion is independent of the labels l and m. Obviously, the quantity gn is just the dimension of the corresponding eigenspace\nof the Laplace-Beltrami operator. The canonical phase space\nΓ can be split then as a direct sum\nM\nΓ=\nQn ⊕ Pn ,\n(7)\nn\n\nwhere Qn and Pn are the respective configuration and momentum subspaces for the modes with fixed n. From now on, we\nwill omit the labels l and m, unless they are necessary in the\nanalysis.\nFurthermore, in the following we restrict our study to the\ninhomogeneous sector, namely, to modes with n , 0. This\ndoes not affect the properties of the system related to its field\n\ncharacter, because this is maintained if one removes a finite\nnumber of modes.2 We will introduce the annihilation and\ncreationlike variables\n!\n!\n!\n1\nan\nqn\nωn i\n=\n.\n(8)\n√\na∗n\npn\n2ωn ωn −i\nNotice that these are precisely the variables which one would\nnaturally adopt in the case of a free massless scalar field. They\nform a complete set in the phase space of the inhomogeneous\nsector. Given a set of initial data {an (t0 ), a∗n (t0 )} at initial time\nt0 , it is possible to write the classical evolution to an arbitrary\ntime t ∈ I in the form\n!\n!\n!\nan (t0 )\nαn (t, t0 ) βn (t, t0 )\nan (t)\n.\n(9)\n=\na∗n (t0 )\nβ∗n (t, t0 ) α∗n (t, t0 )\na∗n (t)\nLet us call Un (t, t0 ) the linear evolution operator defined in\nthis way. Since the time functions αn (t, t0 ) and βn (t, t0 ) provide\na symplectomorphism on Γ, one has\n|αn (t, t0 )|2 − |βn (t, t0 )|2 = 1,\n\n(10)\n\nindependently of the particular values of n, t0 , and t. Such\nBogoliubov coefficients αn (t, t0 ) and βn (t, t0 ) of this evolution\nmap can be determined in the way explained in Ref. [11].\nFor our present analysis, we only need to employ that their\nasymptotic behavior when n → ∞ is given by\n!\n!\n1\n1\n−i(n+1)τ\nαn (t, t0 ) = e\n+O\n,\nβn (t, t0 ) = O 2 , (11)\nn\nn\nwhere τ = t − t0 and the symbol O denotes the asymptotic\norder. The derivation of this asymptotic behavior makes use\nof the mild assumption that the function s(t) in Eq. (5) must\nbe differentiable, with a derivative that is integrable in every\nclosed subinterval of I. To simplify the notation, we will omit\nin the following the reference to the initial time t0 in the coefficients of the evolution operator and in the initial data, called\nnow {an , a∗n }.\nThe SO(4) symmetry of the field equations is imposed at\nthe quantum level by demanding that the complex structure\nbe invariant under this group. We call invariant this class\nof complex structures. By Schur's lemma [26], any invariant complex structure has to be block diagonal with respect to\nthe decomposition of the phase space as the direct sum of the\nsubspaces Qn ⊕ Pn . In other words, the\nL complex structure can\nbe decomposed as a direct sum j =\nn jn , where jn is an invariant complex structure defined on the n-th subspace of the\ninhomogeneous sector of Γ. Moreover, a further application\nof Schur's lemma shows that each of the complex structures\njn is again block diagonal and independent of the labels l and\nm, so that it can be characterized by a complex structure in\ntwo dimensions, describing e.g. the action on the annihilation\n\n2\n\nThe requirements on the quantization of the zero mode, q0 , may lead to\nextra conditions on the function s(t). See Ref. [11] and Sec. V for further\ncomments on this issue.\n\n\f5\nand creationlike variables (an , a∗n ) for any fixed mode labels l\nand m (see Ref. [11] for more details).\nOn the other hand, let us call j0 the complex structure which\nin our basis of variables {an , a∗n } takes the diagonal form:\n!\ni 0\n.\n(12)\nj0 n =\n0 −i\nA general complex structure j is related with j0 via a symplectic transformation j = K j0 K −1 . Taking into account the\nform of the invariant complex structures, the symplectic transformation K must be also block diagonal and independent of\nthe degeneracy labels l and m. We call Kn the 2 × 2 block corresponding to the n-th mode, for which we adopt the notation:\n!\nκn λn\n(13)\nKn = ∗ ∗ .\nλn κn\nThe symbol ∗ denotes again complex conjugation. Here,\n|κn |2 − |λn |2 = 1 because Kn is a symplectomorphism. It follows in particular that |κn | ≥ 1 ∀n ∈ N+ . Note that there exist\ninfinite invariant complex structures. Actually, they are not all\nunitarily equivalent, so that the imposition of SO(4) symmetry\ndoes not eliminate the ambiguity in the Fock quantization on\nits own.\nIn order to select a class of equivalent invariant complex\nstructures we need to appeal to additional conditions. A unitary implementation of the classical dynamics at the quantum\nlevel turns out to determine a preferred class, and hence a\nunique Fock quantization up to equivalence. We recall that\na symplectic transformation T is implementable as a unitary\ntransformation in the quantum theory for a given complex\nstructure j if and only if j − T jT −1 is a Hilbert-Schmidt operator (on the one-particle Hilbert space defined by j, see e.g.\nRefs. [3, 23]). In the case of the time evolution operator, and\nchoosing the complex structure j0 , this condition is satisfied\nif and only if\nX\nX\n|βn (t)|2 =\ngn |βn (t)|2 < ∞ ∀t ∈ I,\n(14)\nnlm\n\nn\n\n√\ni.e., if and only if the sequences { gn βn (t)} are square\nsummable (SQS) for all possible values of time. Then, since\n√\ngn = n + 1, the asymptotic behavior (11) of the beta coefficients guarantees the desired summability, ensuring that the\ndynamics is implemented unitarily in the Fock quantization\npicked up by j0 , namely the complex structure associated to\nthe natural choice of annihilation and creationlike variables\nfor the free massless case.\nLet us suppose now that we choose a different invariant\ncomplex structure j, which can be obtained from j0 by means\nof a symplectic transformation K, as we have commented.\nThe unitary implementation of the evolution operator with respect to the new complex structure j is equivalent to the unitary implementation of a transformed evolution operator with\nrespect to the complex structure j0 [11]. This transformed\nevolution operator is obtained from the original one by the\naction of K. Its diagonal blocks are Kn Un (t)Kn−1 , with corresponding beta coefficients given by\nβnj (t) := (κn∗ )2 βn (t) − λ2n β∗n (t) + 2iκn∗ λn I[αn (t)].\n\n(15)\n\nHere, the symbol I denotes imaginary part. If one assumes\nthat the evolution is unitary in the Fock quantization deter√\nmined by j, so that the sequences { gn βnj (t)} are SQS ∀t ∈ I,\n√\none can prove that the sequence { gn λn } must be SQS as\nwell [11]. But this summability is precisely the sufficient\nand necessary condition for the unitary implementation of the\nsymplectic transformation K in the Fock representation determined by j0 , what amounts to the equivalence of the two complex structures j and j0 . Therefore, the SO(4) invariance and\nthe requirement of unitary dynamics select a unique equivalence class of complex structures, removing the ambiguity in\nthe choice of representation of the CCR's.\nIII.\n\nTHE AMBIGUITY IN THE CHOICE OF FIELD AND\nTHE UNITARITY CRITERION\n\nAlthough we have succeeded in selecting a preferred representation of the CCR's for the (φ, Pφ ) variables, we can always change from the (φ, Pφ ) description of the phase space\nto a new canonical description by means of a canonical transformation. Since many canonical transformations fail to be\nrepresented by unitary operators quantum mechanically, the\nclassical equivalence of these descriptions may be broken in\nthe quantum arena, originating another type of ambiguity in\nthe quantization. In our case, we are only interested in considering linear, local canonical transformations, which respect\nthe linearity of the field equations and, consequently, the linear nature of the structures of the system. As we have explained in the Introduction, the class of canonical transformations that we want to analyze results in a time dependent\nscaling of the field. It is this time dependence what makes the\ntransformation nontrivial; otherwise, any admissible representation of the original field would provide an admissible one\nfor the transformed field by linearity. But when the canonical\ntransformation is time dependent, the field dynamics changes,\naffecting the properties of the quantum theory.\nA time dependent scaling of the configuration field variable\ncan be regarded as a contact transformation, which can easily\nbe completed into a canonical one. Then, the canonical momentum must experience the inverse scaling and, optionally,\nmay be modified with the addition of a term depending on the\nconfiguration field variable, which we restrict to be linear (and\nlocal), according to our previous comments. The coefficient in\nthis linear term may vary in time, like the rest of coefficients\nin the linear canonical transformation under consideration. In\nthis way, one obtains a transformation of the form\nφ = F(t)φ,\n\nPφ =\n\n√\nPφ\n+ G(t) hφ.\nF(t)\n\n(16)\n\nWe recall that the momentum variable is a scalar density of\nunit weight. This explains the square root of the determinant\nof the spatial metric appearing in Eq. (16). In order that the\ntransformation does not spoil the differential formulation of\nthe field theory, nor produces singularities, F and G are restricted to be two real and differentiable functions of time,\nwith F(t) different from zero everywhere. Notice also that the\nhomogeneity of F and G preserves the SO(4) invariance of the\n\n\f6\nfield dynamics. In the following, we will consider only time\ndependent canonical transformations of the form (16).\nAs we have pointed out, different choices of the basic fieldlike variables typically lead to distinct dynamics. For instance,\na canonical transformation with F(t) = 1/a(t), where a is a solution of the second order differential equation\nä\n− m2 a2 + s(t) = 0,\na\n\n(17)\n\nleads from the field equation (5) to the dynamics of a KleinGordon field with mass m propagating in the FRW background d s̃2 = a2 (t)ds2 [see Eq. (2)]. This indicates that one\ncan extract information about the dynamics of different field\ntheories by performing a time dependent canonical transformation of the above type. Let us emphasize, however, that\nwith this procedure one is not transforming a given field theory into another one, but rather considering distinct field descriptions of a given physical system, assuming that none of\nthese descriptions is imposed from the start. In this kind of\nsystems, one has to address the ambiguity associated with the\nchoice of field parametrization (i.e., with the selection of fundamental field, together with its associated dynamics). Then\nit is necessary to invoke additional, physically acceptable criteria to pick up a preferred quantization; otherwise, the significance of the predictions of the quantum theory would be in\nquestion. The criteria that we are going to adopt are indeed the\nsame that allow us to select a unique equivalence class of Fock\nrepresentations in the (φ, Pφ ) representation, that is, the SO(4)\ninvariance and the unitary implementation of the evolution.\nFor the rest of our analysis, it is convenient to split the time\ndependent canonical transformation (16) into two parts, one\nthat takes care of the initial conditions on the functions F(t)\nand G(t), and the other that carries all the time dependence.\nWe fix once and for all an initial reference time t0 , and denote\nby F0 and G0 , respectively, the initial values F(t0 ) and G(t0 ).\nThen, any transformation of the form (16) can be obtained as\nthe composition of the canonical transformation\nφ̃ = F0 φ,\n\nPφ̃ =\n\n√\nPφ\n+ G0 hφ,\nF0\n\n(18)\n\ndemonstrate that any such transformation, except the identity,\nleads to a classical evolution which admits no unitary implementation with respect to any of the Fock representations defined by an SO(4) invariant complex structure. Thus, our criteria fix completely the choice of field description [up to a\ntrivial time independent transformation of the type (18)].\nLet us discuss now the form of the new dynamics obtained\nwith the transformation (19), and present the mathematical\ncondition necessary for a unitary implementation of this dynamical evolution. We recall that the linear transformation\n(19) preserves the SO(4) invariance of the field equations and\nthat we demand that the (real) functions f (t) and g(t) be differentiable. Moreover, [like the functions F(t)] the function\nf (t) is required to differ from zero everywhere. The sign of\nthe function f (t) is therefore constant and, since its initial\nvalue has been fixed equal to the unit, in what follows we take\nf (t) > 0 ∀t ∈ I.\nAs we have already commented, since the canonical transformation (19) depends on time, the classical evolution operator that describes the dynamics of the pair (φ, Pφ ) differs from\nthat corresponding to the original pair (φ, Pφ). In order to describe the new dynamics, we will follow the same procedure\nadopted in the previous section. Namely, we first expand the\nfield φ and its momentum Pφ in (hyper-)spherical harmonics,\nextracting in this way their spatial dependence, and then introduce annihilation and creationlike variables, defined in terms\nof the coefficients of the expansion like in Eq. (8). One can\ncheck [using the transformation (19) and the corresponding\ninitial conditions] that, with those variables, the blocks of the\noriginal evolution matrix Un (t) are replaced by new 2 × 2 matrices Ũn (t) = Tn (t)Un (t), where3\n\n\n f+ (t) + i g(t) f− (t) + i g(t) \n2ω\n2ω\nn\nn \nTn (t) := \n(20)\ng(t)\ng(t) \n\nf− (t) − i 2ω\nf+ (t) − i 2ω\nn\nn\nand 2 f± (t) := f (t) ± 1/ f (t). Finally, a straightforward computation allows us to obtain the Bogoliubov coefficients α̃n (t)\nand β̃n (t) of the evolution matrices Ũn (t), which are of the\nform\ng(t)\n[αn (t) + β∗n (t)],\n2ωn\ng(t) ∗\n[α (t) + βn (t)].(21)\nβ̃n (t) := f+ (t)βn (t) + f− (t)α∗n (t) + i\n2ωn n\n\nα̃n (t) := f+ (t)αn (t) + f− (t)β∗n (t) + i\n\nwhich does not vary in time, with a linear canonical transformation of the type (16),\nφ = f (t)φ,\n\nPφ =\n\n√\nPφ\n+ g(t) hφ,\nf (t)\n\n(19)\n\nbut such that the functions f (t) and g(t) now have fixed initial\nvalues, namely f (t0 ) = 1 and g(t0 ) = 0. The transformation\n(18) is just a time independent linear one, with no impact in\nour discussion, given the linearity of the Fock representations\nof the CCR's. In fact, if a quantization with SO(4) invariance and unitary dynamics is achieved for the canonical pair\n(φ, Pφ ), one immediately obtains a quantization with the same\nproperties for the transformed pair (φ̃, Pφ̃ ). No real ambiguity\ncomes from this kind of transformations, since the quantum\nrepresentation for the original and the transformed fields is\nactually the same (see Ref. [9] for more details).\nThus, we shall restrict our analysis to the family of canonical transformations (19) with fixed initial conditions. We will\n\nOne can now simply follow the procedure explained in Sec.\nII and write down the condition for a unitary implementation\nof the dynamics of the transformed canonical pair (φ, Pφ ) with\nrespect to a representation of the CCR's defined by an SO(4)\ninvariant complex structure. We again call K the symplectic\ntransformation that determines the invariant complex structure\nj under consideration in terms of the complex structure of reference j0 . We also adopt the notation (13) for its coefficients,\nwhich do not depend on time. The new dynamics admits a\n\n3\n\nWhile the dependence of Un (t) on t0 is not shown explicitly to simplify the\nnotation, the matrix Tn (t) actually does not depend on the initial time.\n\n\f7\nunitary implementation with respect to the representation de√\ntermined by j if and only if the sequences { gn β̃nJ (t)} are SQS\n∀t ∈ I, where\nj\n\nβ̃n (t) := (κn∗ )2 β̃n (t) − λ2n β̃∗n (t) + 2iκn∗ λn I[α̃n (t)].\nIV.\n\n(22)\n\nUNIQUENESS IN THE CHOICE OF FIELD\nDESCRIPTION\n\nf− (t) cos[(n + 1)τ],\n\nWe will now present the detailed proof that the unitarity\ncondition introduced in the previous section implies that the\ntransformation (19) must in fact be the identity transformation.\nLet us assume that the unitarity condition is satisfied. Then,\n√\nthe sequences { gn β̃nj (t)} are SQS for all values of time in\nthe considered interval I. In particular, this requires that the\n√\nj\nterms gn β̃n (t) of these sequences tend to zero in the limit\nn → ∞. Since both gn and |κn | are greater than 1, it must be\nj\nalso true that β̃n (t)/(κn∗ )2 tends to zero. Taking into account\nthe asymptotic limits of the Bogoliubov coefficients αn (t) and\nβn (t), given in Eq. (11), and introducing for convenience the\nnotation zn = λn /κn∗ , we arrive at the conclusion that\ni\nh\nei(n+1)τ − z2n e−i(n+1)τ f− (t) − 2izn sin[(n + 1)τ] f+ (t) (23)\nmust have a vanishing limit when n → ∞ for all values of\nt ∈ I. Recall that τ = t − t0 .\nBy considering separately the real and imaginary parts of\nthe above expression, we get that the two sequences given respectively by\n\u0010\nh i\n\u0011\n2I [zn ] f+ (t) − I z2n f− (t) sin[(n + 1)τ]\n\u0010\nh i\u0011\n+ 1 − R z2n f− (t) cos[(n + 1)τ]\n(24)\nand\n\u0010n\n\nh io\n\u0011\n1 + R z2n f− (t) − 2R [zn ] f+ (t) sin[(n + 1)τ]\nh i\n−I z2n f− (t) cos[(n + 1)τ]\n(25)\n\nhave to tend to zero when n → ∞ ∀t ∈ I. Here, the symbol R\ndenotes real part.\nWe can now apply arguments similar to those presented in\nRef. [9] and show that, if it is true that the sequences given in\nEq. (25) tend to zero for all values of time, then it is impossible that the two sequences formed by\nh i\nh i\n1 − R z2n\nand I z2n\n(26)\nhave simultaneously a vanishing limit on any (infinite) subsequence of the positive integers M ⊂ N+ (i.e., for n ∈ M ⊂ N+ ).\nLet us see this in more detail.\n\u0001\nWe first note that R[zn ] 2 tends to the unit whenever the\ntwo terms in Eq. (26) tend to zero. This can be checked by\nsumming the square of the two terms (26), which gives\n\u0001\n(1 − |zn |2 )2 + 4 I[zn ] 2 .\n\nBy our assumptions, this expression tends to zero on a given\nsubsequence M. Then, we get that |zn | must tend to the unit\nand I[zn ] to zero on this subsequence, what implies that the\n\u0001\nlimit of R[zn ] 2 is equal to one.\nSuppose then that there really exists a particular subsequence M ⊂ N+ such that the terms (26) tend to zero on it\nfor all possible values of time. Since the factor\n\n(27)\n\n(28)\n\nwhich multiplies I[z2n ] in Eq. (25), is bounded for every particular value of t, it follows that\n\u0010n\nh io\n\u0011\n1 + R z2n f− (t) − 2R [zn ] f+ (t) sin[(n + 1)τ]\n(29)\nmust have a vanishing\nh i limit on M ∀t ∈ I. Besides, since by\nhypothesis 1 − R z2n tends to zero on M as well, one further\nobtains that\n\u0001\nf− (t) − R [zn ] f+ (t) sin[(n + 1)τ]\n(30)\n\nmust tend to zero on M at each possible value of the time t.\n\u0001\nWe now make use of the result proven above that R[zn ] 2\nnecessarily tends to the unit on M. Then, there exists at least\none subsequence M′ ⊂ M such that R[zn ] tends to 1 or to −1\non M′ . In any of these cases, given that M′ is a subsequence\nof M, and hence expression (30) must tend to zero on M′ , we\nconclude (using the definition of f± ) that either\nsin[(n + 1)τ] f (t)\n\nor\n\nsin[(n + 1)τ]\nf (t)\n\n(31)\n\n(or both) have a vanishing limit on the subsequence M′ ⊂ N+\n∀t ∈ I. But, since the function f (t) is continuous and vanishes\nnowhere, this implies that sin[(n + 1)τ] must tend to zero on\nM′ for all possible values of time in I, or equivalently ∀τ ∈ Ī,\nwhere Ī is the domain obtained from I after a shift by the initial\ntime t0 .\nLet us finally prove that this limiting behavior is not allowed. Take a positive number L such that [0, L] ⊂ Ī. We\nhave, in particular, that sin2 [(n + 1)τ] tends to zero on M′\n∀τ ∈ [0, L]. However, a simple application of the Lebesgue\ndominated convergence shows that this statement is false. The\ndetails are presented in the Appendix. Essentially, one can\nsee that the integral of sin2 [(n + 1)τ] over the interval [0, L]\nis bounded from below by a strictly positive number for large\nn, something which is incompatible with a vanishing limit for\nthis function in the entire interval. Therefore, one can exclude the possibility that the two sequences of time independent terms appearing in Eq. (26) can both converge to zero on\na subsequence M′ ⊂ N+ .\nWe will now use this fact to demonstrate that the function\nf (t) is necessarily a constant function. Let us study again the\nreal sequences given by Eqs. (24) and (25) which, as we have\nseen, must necessarily tend to zero in the limit n → ∞ for\nall possible values of time t ∈ I if the dynamics of the (φ, Pφ )\ncanonical pair admits a unitary implementation.\nWe concentrate our attention on a specific subset of values\nof the shifted time τ, namely, all values of the form τ = 2πq/p\n\n\f8\nwhere q and p can be any positive integers, except for the\ncondition that the resulting value of τ belongs to the interval of\ndefinition of this variable, Ī. For each value of p, we consider\nthe subsequence of positive integers\nM p := {n = kp − 1 > 0, k ∈ N+ }.\n\n(32)\n\nGiven p, the terms (24) and (25) tend to zero on the subsequence M p when n → ∞ for all the values of τ reached when\nq varies. Then, we reach the conclusion that both\n!\n\u0010\nh\ni\u0011\n2πq\n2\n(33)\n1 − R zkp−1 f− t0 +\np\nand\nI\n\nh\n\nz2kp−1\n\ni\n\nf−\n\n2πq\nt0 +\np\n\n!\n\n(34)\n\nRealizing that the subset of time values {t0 + 2πq/p} is dense\nin I ⊂ R and that the function f (t) is continuous, we are led\nto the conclusion that f (t) must equal the unit function on its\nentire domain.\nIt remains to be proven that the function g(t) in the transformation (19) necessarily vanishes, under the condition of\nunitary dynamics. Note first that the identity f (t) = 1 that\nwe have just demonstrated implies that zn tends to zero when\nn → ∞. In fact, after introducing this identity in Eq. (23),\none sees that the sequences {zn sin[(n + 1)τ]} must tend to zero\n∀τ ∈ Ī. Therefore, in order to avoid again the false conclusion that sin2 [(n + 1)τ] tends to zero on some subsequence of\nthe positive integers for all values of τ in a compact interval,\nit is necessary that the complex sequence zn has a vanishing\nlimit. Taking into account that |κn |2 = |λn |2 + 1, it is straightforward to check that the sequence formed by the coefficients\nλn must tend to zero, and that 1/|κn |2 (and |κn |2 ) approaches\nthe unit in the limit of large n, what implies in particular that\nthe sequence given by κn is bounded.\nTo complete the proof that g(t) vanishes, we consider again\n√\nthe sequences { gn β̃nj (t)}, particularized now to the only value\nallowed for the function f (t), namely the identity, so that\nf+ (t) = 1 and f− (t) = 0. Employing the definition of the coefficient βnj (t), given in Eq. (15), one can check that the leading\nterms in β̃nj (t) are\ni\ng(t) h ∗ 2 ∗\n(κn ) αn (t) + λ2n αn (t) .\n2ωn\n\ng(t) − 4zn ωn sin[(n + 1)τ]e−i(n+1)τ\n\n(37)\n\nmust have a vanishing limit ∀t ∈ I. We then consider the real\nand imaginary parts of these sequences, namely\ng(t) − 4|zn |ωn sin[(n + 1)τ] cos[(n + 1)τ − δn ]\n\n(38)\n\n4|zn |ωn sin[(n + 1)τ] sin[(n + 1)τ − δn ],\n\n(39)\n\nand\n\nmust tend to zero as k goes to infinity. The limit must vanish\nfor every possible integer value of p and q. Note however that\nthe time independent factors on the left of these expressions\nare precisely those given in Eq. (26), which we have proven\nthat cannot tend simultaneously to zero on any subsequence\nof the positive integers, e.g. those provided by M p for each of\nthe values of p. Therefore, the only possibility left is that the\nfunction f− (t0 + 2πq/p) is equal to zero at all the considered\nvalues of p and q. Using the fact that f (t) > 0 ∀t ∈ I, the last\nresult amounts to the equality\n!\n2πq\nf t0 +\n=1\n∀p, q.\n(35)\np\n\nβ̃nj (t) \u001b βnj (t) + i\n\n√\nThe condition of unitarity demands that gn β̃nj (t) tend to zero\nin the limit n → ∞ at all values of time, and therefore the same\n√\nmust happen to the sequences with terms gn β̃nj (t)/κn∗ 2 . Using\nthis condition and taking into account the known asymptotic\nbehavior (11) of αn (t) and βn (t), as well that λn tends to zero\n√\nand gn /ωn tends to the unit for large n, a simple calculation\nleads to the result that the sequences given by\n\n(36)\n\nwhere we have written the complex numbers zn in terms of its\nphase and complex norm:\nzn = |zn |eiδn .\n\n(40)\n\nAlthough we already know that |zn | tends to zero, the limit of\nthe product |zn |ωn is still undetermined, because ωn grows like\nn at infinity.\nLet us suppose first that the sequence {|zn |ωn } tends to zero.\nIn this case, recalling that the sequences given in Eq. (38)\nshould tend to zero ∀t ∈ I, it follows immediately that g(t)\nmust be the zero function on I, as we wanted to prove. Finally, let us demonstrate that the alternate possibility, i.e. the\nhypothesis that {|zn |ωn } does not tend to zero, leads to a contradiction. We make use of the fact that the sequences formed\nby the terms (39) tend to zero ∀t. If {|zn |ωn } does not tend to\nzero, there must exists a subsequence M of the positive integers such that the (positive) sequence {|zn |ωn } is bounded from\nbelow on M. Thus, on that subsequence,\nsin[(n + 1)τ] sin[(n + 1)τ − δn ]\n\n(41)\n\nmust necessarily have a zero limit ∀τ ∈ I. But, as shown also\nin the Appendix, this last statement can never be true. Again\nthe crucial argument involves the application of the Lebesgue\ndominated convergence.\nAs a result, the only function g(t) that is allowed by the\ncondition of unitarity is the zero function. In total, we have\ndemonstrated that the only canonical transformation of the\ntype (19) which is permitted once one accepts the unitarity criterion is the trivial one, i.e. the identity transformation. In this\nway, the choice of a field parametrization for the system turns\nout to be completely fixed (up to irrelevant constant scalings)\nby the requirements of invariance under the symmetry group\nof the field equations, SO(4), and the unitary implementation\nof the dynamics. The ambiguity in the selection of a field description is totally removed.\nV. CONCLUSIONS AND DISCUSSION\n\nIn this work , we have begun our analysis by reviewing the\nFock quantization of a scalar field with a time varying mass in\n\n\f9\na static background, in which the inertial spatial sections have\nS 3 topology. For this particular scenario, we have seen that\nthe criteria of: i) invariance of the vacuum under the SO(4)\nsymmetry of the field equations; and ii) unitary implementation of the field dynamics, are sufficient to select a unique\nFock representation of the CCR's.\nAn additional question concerns the possibility of changing\nthe field description, if one allows for a scaling of the field by\ntime dependent functions. This is a situation frequently found\nin cosmology, where it is common to introduce scalings of the\nfields in order to absorb part of the time dependence of the\ncosmological background. The prototypical example is that\nof fields in an FRW spacetime with compact topology (S 3 for\nour discussion), or the closely related scenario of field perturbations around an FRW background of that kind. There is\ntherefore an extra ambiguity affecting the quantization of such\nsystems, namely the choice of the field description, which\nnecessarily affects the dynamics.\nIn the above mentioned systems, it is generally the case\nthat a time dependent scaling of the field renders the field\nequations into a form describing the effective propagation in\na static background with a time varying mass, i.e. the model\nthat we considered initially. We have demonstrated here the\nresult that we anticipated in Ref. [12], namely, that our criteria of symmetry invariance and unitary evolution allow only\nfor one admissible field description among all those that can\nbe reached by means of time dependent canonical transformations that include a time dependent scaling of the field.\nThe analyzed canonical transformations are linear, in order\nto maintain the linearity of all the structures on phase space,\nand preserve the symmetry of the field equations.\nTo arrive at this uniqueness result, very mild requirements\nhave been imposed on the mass function s(t) appearing in the\nfield equation (5). Specifically, the only condition that has\nbeen assumed is that the mass function has a first derivative\nwhich is integrable in all closed subintervals of the domain\nof definition. In addition, if one wants that the zero mode\nof the scalar field (the homogeneous sector) can be quantized\nconsistently in the standard Schrödinger representation with\nthe Lebesgue measure (on R), an extra condition has to be\nadded: the mass s(t) has to be nonnegative for all possible\nvalues of time.\nLet us comment on some key points underlying our uniqueness result. A fundamental question is to understand why one\ncan reach unitarity in the quantum evolution and how this unitarity selects a unique field description as well as a unique\nequivalence class of complex structures for it, among the set\nof all symmetry invariant complex structures. In this respect,\nwe first notice that infrared divergences are not an issue to begin with, owing to the fact that the spatial sections have compact topology (leading in particular to a discrete spectrum for\nthe Laplace-Beltrami operator). Like for many other considerations in cosmology, the compactness of the spatial sections\nis essential. When the spatial topology is not compact, the in-\n\nfrared problem appears and changes the scenario drastically.4\nOn the other hand, the ultraviolet divergences are absent in\nthe system precisely because we are using an appropriate representation of the CCR's. This representation turns out to be\nthe one naturally associated with a free massless scalar field.\nThe reason is that, in the asymptotic limit of large wavenumbers, which are the relevant modes for the ultraviolet regime,\nthe behavior of the system (when the field is properly scaled)\napproaches sufficiently fast the behavior of a massless field.\nOnly Fock quantizations (with the desired invariance) which\nare equivalent to the one that we have chosen keep this good\nultraviolet property. In this way, one obtains a single family of\nunitarily equivalent Fock quantizations which incorporate the\nsymmetries of the field equation and respect the unitarity in\nthe evolution. Concerning the choice of field description, let\nus also note that nonstationary spacetimes give rise to damping terms (first order time derivatives of the scalar field) in the\nequations of motion. In relation with our previous comments,\nsuch contributions spoil the unitary implementation of the dynamics at the quantum level. Fortunately, a suitable scaling of\nthe field relegates all the information about the nonstationarity\nof the system to the (effective) mass term.\nLet us see this last point in some more detail. As we have\nexplained, in order to quantize a scalar field in a nonstationary\nsetting along the lines presented in this paper, one generically\nperforms a canonical transformation which involves a time dependent scaling of the field, so that the transformed field effectively propagates in a static background. Let us call φ and s̃(t),\nrespectively, the field and its time dependent mass previous to\nthe discussed transformation. As commented above, the corresponding field equation contains a damping term, which is\nlinear in φ̇. We call r(t) the function multiplying φ̇ in this\ndamping contribution. We now want to give the explicit expressions of the time dependent scaling factor, F(t) [see Eq\n(16)], and of the mass function s(t) for the field φ = φ/F(t).\nA straightforward calculation shows that\n\" Z t\n#\nr(τ)\n[r2 (t) + 2ṙ(t)]\ndτ\nF(t) = F0 exp −\n, s(t) = s̃(t) −\n.\n2\n4\nt0\n(42)\nWe also note that the condition imposed on s(t) for the validity\nof our uniqueness result is met, for instance, if s̃(t) satisfies the\nsame condition and r(t) has a second derivative which is integrable in all compact subintervals of the time domain I. On the\nother hand, the positivity of the mass function (for a standard\nquantization of the homogeneous sector) amounts just to\ns̃(t) ≥\n\n[r2 (t) + 2ṙ(t)]\n4\n\n∀t ∈ I.\n\n(43)\n\nLet us now address possible generalizations of our results,\nstarting with the case of scalar fields in different compact spatial manifolds. The analysis carried out here, together with\n\n4\n\nFor instance, the well known inequivalence of the quantum representations\ncorresponding to free scalar fields of different masses in Minkowski spacetime is precisely due to the long range behavior of the quantum fields. See\nRef. [27] for an account.\n\n\f10\nthe dimensional arguments explained in Ref. [11] in relation\nto the uniqueness of the representation of the CCR's for the\nfield description selected by our criteria, strongly indicate that\nthe results that we have achieved for the three-sphere can be\nextended to other compact spatial manifolds provided that the\nspatial dimension d is equal or smaller than three. Suppose\nthat, in these cases, the representation of the symmetry group\nof the field equation is irreducible in each of the eigenspaces\nof the Laplace-Beltrami operator [like it happens for SO(4) in\nthe case of the three-sphere]. This property is actually sufficient (though not necessary) to characterize the invariant complex structures in a block diagonal form similar to that discussed in this work. One can then follow the same kind of\nsteps that have allowed us to complete the proof of uniqueness, reaching analogous conclusions.\nIn all the cases with d ≤ 3, our arguments therefore support\nthe expectation that, when one adopts the scalar field description with propagation in a static background, the free massless\nrepresentation provides the unique (equivalence class of) Fock\nquantization that satisfies our criteria of symmetry invariance\nand unitary dynamics [11]. Besides, our criteria are expected\nto fix again the function f (t) in the canonical transformations\nof the type (19). This ensures that there is no ambiguity in\nthe scaling of the field, either. The only freedom remaining\nin the canonical transformation is given by the function g(t).\nIt is not difficult to realize, repeating the arguments discussed\nhere, that whether or not the function g(t) is fixed to vanish de√\npends on the square summability of the sequence { gn /ωn }.\nIf the sequence is not SQS, as it happens for the cases of the\ntwo-sphere and the three-sphere, the function g(t) must vanish. However, if the sequence is SQS, there exists an arbitrariness and our criteria do not determine the definition of the\nmomentum Pφ completely. For instance, this is the case of\nthe circle S 1 [9]. It is worth pointing out that, nevertheless,\nthis freedom has nothing to do with the scaling of the field,\nleaving intact the time evolution. If a choice of momentum\nand of invariant complex structure permits a unitary implementation of the dynamics, the same complex structure leads\nto a unitary evolution for any other admissible choice of the\nmomentum canonically conjugate to the field. In other words,\nthis freedom to change the momentum by adding a time dependent contribution linear in the configuration field variable,\nwhen available, does not allow one to reach a new representation satisfying our criteria.\nAs we have explained in the Introduction, a framework\nwhere our results find a natural application is in the quantization of (inhomogeneous) perturbations around a closed FRW\nspacetime. In this context, the simplest system is a scalar\nfield coupled to a homogeneous and isotropic universe with\ncompact spatial sections. This system is specially relevant in\ncosmology. On the one hand, the considered perturbations\nprovide the seeds for structure formation. On the other hand,\nthose perturbations explain the anisotropies imprinted in the\npower spectrum of the cosmic microwave background (CMB).\nOur criteria to eliminate the quantization ambiguities can now\nbe applied in their quantum treatment and the subsequent analysis of the power spectrum.\nAlthough the discussion that we have carried out has been\n\nfocused on scalar fields, there does not seem to exist any technical or conceptual obstacle to extend the analysis to other\nkind of fields, applying to them our criteria in order to pick up\na unique Fock quantization. For instance, an interesting case\nis provided by the traceless and divergenceless tensor perturbations of the metric around an FRW spacetime with compact\nspatial topology. These tensor perturbations describe gravitational waves. The primordial gravitational waves generated\nin the early universe can also contribute to the power spectrum of the CMB, in the form of tensor modes. In fact, with\na convenient scaling and in conformal time, these tensor perturbations satisfy again equations of motion like those for a\nfree field with a time dependent quadratic potential in a static\nspacetime when the perturbations of the energy-momentum\ntensor are isotropic (see Ref. [14]). Let us mention also\nthe case of fermionic fields. The study of the perturbations\naround a closed FRW spacetime produced by fermions of constant mass was carried out in Ref. [28], where a quantization\nwas achieved after expanding the perturbations in spinor harmonics on the three-sphere. Preliminary calculations indicate\nthat the kind of techniques employed here can be extended\nto deal as well with the uniqueness of the Fock quantization\nfor fermions. It is worth emphasizing that the criteria for this\nuniqueness are the natural implementation of the symmetries\nof the field equations and the unitarity of the evolution. For\ncases other than the scalar field (and gravitational waves, as\nnoticed above), these criteria may not necessarily imply that\nthe selected field description corresponds to a field propagating in a stationary background.\nThe Fock quantization of fields in the context of modern approaches to quantum cosmology is another interesting framework where our results can have applications. One of the most\npromising approaches is what nowadays is called Loop Quantum Cosmology [29–31]. LQC employs the techniques of\nLoop Quantum Gravity (LQG) [32–34] in the study of models of interest in cosmology, obtained from General Relativity by the imposition of certain symmetries. In the specific\ncase of an FRW spacetime coupled to a scalar field (see Refs.\n[35–37]), where homogeneity and isotropy are imposed, LQC\npredicts that the classical Big Bang singularity is replaced by\na Big Bounce, which connects the observed branch of the\nuniverse with a previous branch in the evolution. For semiclassical states with certain properties [38], the evolution is\npeaked around a trajectory which shows a behavior different\nfrom the classical one in Einstein's theory. Then, one could\nuse such a trajectory to define an effective, quantum corrected\nbackground. If inhomogeneous matter fields are introduced,\ntheir scaling by background functions would then provide a\ndifferent time dependent scaling with respect to the conventional case in General Relativity. At the quantum level, the\ncombination of the use of loop techniques for the homogeneous background with a standard Fock quantization of the\ninhomogeneous fields, which propagate in it, is known in the\nliterature as hybrid quantization [39–42]. This quantization\nprocedure assumes that the most relevant quantum geometry\neffects (characteristic of LQG) are those that affect the homogeneous degrees of freedom of the gravitational field. A\nfamily of systems in which the application of such a quantiza-\n\n\f11\ntion procedure seems most natural is the already commented\ncase of perturbations around FRW spacetimes. Our analysis\nprovides a unique Fock quantization for those perturbations,\nwhich ought to be recovered from LQC (either with an hybrid\nor with a genuinely loop quantization) in regimes in which the\nbehavior of the degrees of freedom of the background can be\ndescribed satisfactorily by an effective trajectory.\nIn conclusion, we have completed the demonstration that a\nscalar field with time dependent mass in an FRW spacetime\nwith compact spatial sections admits (within the considered\ninfinite family of possibilities that respect the linear structure\nof the theory, and up to equivalence) a unique Fock quantization where the vacuum is invariant under the symmetries of\nthe field equation and the dynamical evolution is unitary. In\nthis sense, it is not only that one does not have to renounce\nto unitarity in the context of quantum cosmology, but, furthermore, the requirement of unitarity has the remarkable counterpart of selecting a unique Fock description among all those\nthat incorporate the symmetry invariance of the system.\nAcknowledgements\n\nThis work has been supported by the grants DGAPAUNAM IN108309-3 from Mexico, MICINN FIS2008-06078C03-03 and Consolider-Ingenio Program CPAN (CSD200700042) from Spain, and CERN/FP/109351/2009 from Portugal. J.O. acknowledges CSIC for the grant No. JAEPre 08 00791. He thanks I.G.C. at Penn State for warm hospitality during part of the period of development of this work.\nAppendix A: Application of the Lebesgue dominated\nconvergence\n\nIn Sec. IV we used the fact that sin2 [(n + 1)τ], or more generally sin[(n + 1)τ] sin[(n + 1)τ − δn] (from which the previous\ncase is recovered by taking δn = 0), cannot tend to zero in\nthe limit n → ∞ on any subsequence of the positive integers\n∀τ ∈ Ī. In this appendix we are going to prove an even more\ngeneral result. Let\nU = {un , n ∈ N+ }\n\n(A1)\n\nbe a monotonous and diverging sequence of positive real numbers; i.e. un+1 > un ∀n ∈ N+ , with {un } unbounded. Let also\nD = {δn , n ∈ N+ }\n\n(A2)\n\nbe a sequence of phases [namely, real numbers, identified\nmodulo 2π], and let L > 0 be an arbitrary positive number.\nThen, the sequences of values\nxn (τ) = sin(un τ) sin(un τ − δn )\n\n(A3)\n\ncannot tend to zero ∀τ ∈ [0, L].\nTo prove this, we assume from the start that the sequence\nformed by cos(δn ) with δn ∈ D does not tend to zero when\nn tends to infinity. We will show below that there is no loss\nof generality in making this assumption. A straightforward\ncomputation shows that\nZ L\nL\nsin(un L)\nxn (τ)dτ = cos(δn ) − cos(un L − δn )\n. (A4)\n2\n2un\n0\n\nTaking into account the range of the trigonometric functions,\nwe get the following bounds, valid for all positive integers n:\nL\n1\n≥\ncos(δn ) +\n2\n2un\n\nZ\n\n0\n\nL\n\nxn (τ)dτ ≥\n\nL\n1\n.\ncos(δn ) −\n2\n2un\n\n(A5)\n\nGiven that cos(δn ) does not tend to zero, there exists a subsequence M′′ ⊂ N+ and a number ∆ > 0 such that | cos(δn )| ≥ ∆,\n∀n ∈ M′′ . Thus, there exists a subsequence M′ ⊂ M′′ such\nthat\ncos(δn ) ≥ ∆\n\n∀n ∈ M′ ,\n\n(A6)\n\ncos(δn ) ≤ −∆\n\n∀n ∈ M′\n\n(A7)\n\nor\n\n(both types of sequences may exist).\nLet us consider for the moment the first case (A6). Since\nthe sequence of positive numbers 1/un (with un ∈ U) tends to\nzero for large n, one can find a positive integer n0 ∈ M′ such\nthat L∆ > 1/un0 . Moreover, since un+1 > un in U, one gets\nfrom the second inequality in Eq. (A5) that the considered\nintegral is bounded from below on the given sequence by a\npositive number:\nZ\n\nL\n0\n\nxn (τ)dτ ≥\n\n1\nL∆\n> 0,\n−\n2\n2un0\n\n∀n > n0 ,\n\nn ∈ M′ . (A8)\n\nIt is clear that the second possibility, i.e. the existence of a\nsequence M′ such that cos(δn ) ≤ −∆, leads to a negative upper\nbound by similar arguments. Taking into account the two possibilities, we conclude that [assuming that cos(δn ) does not\ntend to zero] there exist positive numbers ∆, n0 ∈ N+ , and\nM = L∆ − 1/un0 , as well as a subsequence M ⊂ N+ such that\nZ\n\n0\n\nL\n\nxn (τ)dτ ≥\n\nM\n2\n\n∀n ∈ M.\n\n(A9)\n\nThe sequence M is formed by those elements of M′ such that\nn > n0 .\nSuppose now that the sequence of functions xn (τ) converges\nto the zero function on [0, L]. Since the functions |xn (τ)| are\nobviously bounded from above by the constant unit function,\nwe are in the conditions of Lebesgue dominated convergence\nRL\n[1], and it follows that the sequence of integrals 0 xn (τ)dτ\nmust converge to the integral of the zero function, i.e. to zero.\nBut this conclusion is obviously contradicted by the bound\nobtained in Eq. (A9). Therefore, it is not possible that the\nvalues of xn (τ) converge to zero ∀τ ∈ [0, L].\nTo conclude the proof, it only remains to consider the situation in which cos(δn ) tends to zero for large n. In that case,\nthe vanishing limit of xn (τ) implies that sin(2un τ) must tend to\nzero, and therefore so must sin2 (2un τ). But this last situation\nis covered by the proof presented above. It suffices to make all\nthe phases δn identically null, and identify the sequence {2un }\nas the new sequence U, since the positive real numbers 2un\nform a monotonous and diverging sequence if so do the un 's.\n\n\f12\n\n[1] B. Simon, Topics in Functional Analysis, edited by R.F. Streater\n(Academic Press, London, England, 1972).\n[2] R.M. Wald, Quantum Field Theory in Curved Spacetime\nand Black Hole Thermodynamics (Chicago University Press,\nChicago, 1994).\n[3] A. Ashtekar and A. Magnon, Proc. R. Soc. Lond. A 346, 375\n(1975); A. Ashtekar and A. Magnon-Ashtekar, Pramana 15,\n107 (1980).\n[4] R. Floreanini, C.T. Hill, and R. Jackiw. Ann. Phys. 175, 345\n(1987).\n[5] R.H. Gowdy, Phys. Rev. Lett. 27, 826 (1971); Ann. Phys. (N.Y.)\n83, 203 (1974).\n[6] A. Corichi, J. Cortez, and G.A. Mena Marugán, Phys. Rev. D\n73, 041502 (2006); Phys. Rev. D 73, 084020 (2006).\n[7] J. Cortez and G.A. Mena Marugán, Phys. Rev. D 72, 064020\n(2005).\n[8] A. Corichi, J. Cortez, G.A. Mena Marugán, and J.M. Velhinho,\nClassical Quantum Gravity 23, 6301 (2006); Phys. Rev. D 76,\n124031 (2007).\n[9] J. Cortez, G.A. Mena Marugán, and J.M. Velhinho, Phys. Rev.\nD 75, 084027 (2007).\n[10] J. Cortez, G.A. Mena Marugán, R. Serôdio, and J.M. Velhinho, Phys. Rev. D 79, 084040 (2009); J. Cortez, G.A. Mena\nMarugán, and J.M. Velhinho, Classical Quantum Gravity 25,\n105005 (2008).\n[11] J. Cortez, G.A. Mena Marugán, and J.M. Velhinho, Phys. Rev.\nD 81, 044037 (2010).\n[12] J. Cortez, G.A. Mena Marugán, J. Olmedo, and J.M. Velhinho,\nJ. Cosmol. Astropart. Phys. 10 (2010) 030.\n[13] E. Lifshitz, Zh. Eksp. Teor. Fiz. 16, 587 (1946); E. Lifshitz and\nI.M. Khalatnikov, Adv. Phys. 12, 185 (1963).\n[14] J.M. Bardeen, Phys. Rev. D 22, 1882 (1983).\n[15] R. Bradenberger, R. Kahn, and W.H. Press, Phys. Rev. D 28,\n1809 (1983).\n[16] V. Mukhanov, Physical Foundations of Cosmology (Cambridge\nUniversity Press, Cambridge, England, 2005).\n[17] V.F. Mukhanov, H.A. Feldman, and R.H. Bradenberger, Phys.\nRep. 215, 203 (1992).\n[18] J.J. Halliwell and S.W. Hawking, Phys. Rev. D 31, 1777 (1985).\n[19] J. Bic̆ák, J. Katz, and D. Lynden-Bell, Phys. Rev. D 76, 063501\n(2007).\n\n[20] G. Efstathiou, Mon. Not. R. Astron. Soc. 343, L95 (2003).\n[21] A. Lasenby and C. Doran, Phys. Rev. D 71, 063502 (2005).\n[22] A. Corichi, J. Cortez, and H. Quevedo, Ann. Phys. (N.Y.) 313,\n446 (2004).\n[23] R. Honegger and A. Rieckers, J. Math. Phys. 37, 4292 (1996);\nD. Shale, Trans. Am. Math. Soc. 103, 149 (1962).\n[24] U.H. Gerlach and U.K. Sengupta, Phys. Rev. D 18, 1773\n(1978).\n[25] R.T. Jantzen, J. Math. Phys. 19, 1163 (1978).\n[26] A.A. Kirillov, Elements of the Theory of Representations\n(Springer-Verlag, New York, 1976).\n[27] J.M. Mourão, T. Thiemann, and J.M. Velhinho, J. Math. Phys.\n40, 2337 (1999).\n[28] P.D. D'Eath and J.J. Halliwell, Phys Rev. D 35, 1100 (1987).\n[29] M. Bojowald, Living Rev. Relativity 11, 4 (2008).\n[30] A. Ashtekar, Nuovo Cimento B122, 135 (2007).\n[31] G.A. Mena Marugán, AIP Conf. Proc. 1130, 89 (2009).\n[32] T. Thiemann, Modern Canonical Quantum General Relativity\n(Cambridge University Press, Cambridge, England, 2007).\n[33] C. Rovelli, Quantum Gravity (Cambridge University Press,\nCambridge, England, 2004).\n[34] A. Ashtekar and J. Lewandowski, Classical Quantum Gravity\n21, R53 (2004).\n[35] A. Ashtekar, T. Pawłowski, and P. Singh, Phys. Rev. Lett. 96,\n141301 (2006); Phys. Rev. D 73, 124038 (2006); Phys. Rev. D\n74, 84003 (2006).\n[36] A. Ashtekar, A. Corichi, and P. Singh, Phys. Rev. D 77, 024046\n(2008).\n[37] M. Martı́n-Benito, G.A. Mena Marugán, and J. Olmedo, Phys.\nRev. D 80, 104015 (2009).\n[38] V. Taveras, Phys. Rev. D 78, 064072 (2008).\n[39] M. Martı́n-Benito, L.J. Garay, and G.A. Mena Marugán, Phys.\nRev. D 78, 083516 (2008).\n[40] G.A. Mena Marugán and M. Martı́n-Benito, Int. J. Mod. Phys.\nA 24, 2820 (2009).\n[41] L.J. Garay, M. Martı́n-Benito, and G.A. Mena Marugán, Phys.\nRev. D 82, 044048 (2010).\n[42] M. Martı́n-Benito, G.A. Mena Marugán, and E. Wilson-Ewing,\nPhys. Rev. D 82, 084012 (2010).\n\n\f"}