{"id": "http://arxiv.org/abs/1105.3287v1", "guidislink": true, "updated": "2011-05-17T07:06:14Z", "updated_parsed": [2011, 5, 17, 7, 6, 14, 1, 137, 0], "published": "2011-05-17T07:06:14Z", "published_parsed": [2011, 5, 17, 7, 6, 14, 1, 137, 0], "title": "Scholarly Communication", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1105.0195%2C1105.1120%2C1105.2342%2C1105.5326%2C1105.1432%2C1105.0523%2C1105.3602%2C1105.2418%2C1105.3314%2C1105.3292%2C1105.6333%2C1105.3287%2C1105.0352%2C1105.3085%2C1105.0346%2C1105.3456%2C1105.5533%2C1105.4298%2C1105.5966%2C1105.1464%2C1105.2559%2C1105.1270%2C1105.1038%2C1105.5784%2C1105.5460%2C1105.0312%2C1105.6306%2C1105.1024%2C1105.1131%2C1105.4362%2C1105.5632%2C1105.1799%2C1105.1486%2C1105.2706%2C1105.4441%2C1105.3010%2C1105.3461%2C1105.4959%2C1105.5282%2C1105.5578%2C1105.4204%2C1105.0670%2C1105.6008%2C1105.5348%2C1105.1342%2C1105.0615%2C1105.4699%2C1105.2713%2C1105.0721%2C1105.3237%2C1105.1380%2C1105.6329%2C1105.1225%2C1105.2761%2C1105.2992%2C1105.4898%2C1105.3167%2C1105.2425%2C1105.2534%2C1105.1886%2C1105.4744%2C1105.1565%2C1105.3771%2C1105.2046%2C1105.0666%2C1105.5221%2C1105.5240%2C1105.4287%2C1105.1489%2C1105.3203%2C1105.5160%2C1105.6096%2C1105.0694%2C1105.0702%2C1105.5434%2C1105.1434%2C1105.5837%2C1105.5187%2C1105.4610%2C1105.1040%2C1105.3444%2C1105.5063%2C1105.0897%2C1105.4775%2C1105.2762%2C1105.6108%2C1105.0913%2C1105.0272%2C1105.3715%2C1105.3184%2C1105.0060%2C1105.5391%2C1105.4328%2C1105.3429%2C1105.4543%2C1105.0839%2C1105.2752%2C1105.4402%2C1105.2070%2C1105.1352%2C1105.3041&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Scholarly Communication"}, "summary": "The chapter tackles the role of scholarly publication in the research process\n(quality, preservation) and looks at the consequences of new information\ntechnologies in the organization of the scholarly communication ecology. It\nwill then show how new technologies have had an impact on the scholarly\ncommunication process and made it depart from the traditional publishing\nenvironment. Developments will address new editorial processes, dissemination\nof new content and services, as well as the development of publication\narchives. This last aspect will be covered on all levels (open access,\nscientific, technical and legal aspects). A view on the possible evolutions of\nthe scientific publishing environment will be provided.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1105.0195%2C1105.1120%2C1105.2342%2C1105.5326%2C1105.1432%2C1105.0523%2C1105.3602%2C1105.2418%2C1105.3314%2C1105.3292%2C1105.6333%2C1105.3287%2C1105.0352%2C1105.3085%2C1105.0346%2C1105.3456%2C1105.5533%2C1105.4298%2C1105.5966%2C1105.1464%2C1105.2559%2C1105.1270%2C1105.1038%2C1105.5784%2C1105.5460%2C1105.0312%2C1105.6306%2C1105.1024%2C1105.1131%2C1105.4362%2C1105.5632%2C1105.1799%2C1105.1486%2C1105.2706%2C1105.4441%2C1105.3010%2C1105.3461%2C1105.4959%2C1105.5282%2C1105.5578%2C1105.4204%2C1105.0670%2C1105.6008%2C1105.5348%2C1105.1342%2C1105.0615%2C1105.4699%2C1105.2713%2C1105.0721%2C1105.3237%2C1105.1380%2C1105.6329%2C1105.1225%2C1105.2761%2C1105.2992%2C1105.4898%2C1105.3167%2C1105.2425%2C1105.2534%2C1105.1886%2C1105.4744%2C1105.1565%2C1105.3771%2C1105.2046%2C1105.0666%2C1105.5221%2C1105.5240%2C1105.4287%2C1105.1489%2C1105.3203%2C1105.5160%2C1105.6096%2C1105.0694%2C1105.0702%2C1105.5434%2C1105.1434%2C1105.5837%2C1105.5187%2C1105.4610%2C1105.1040%2C1105.3444%2C1105.5063%2C1105.0897%2C1105.4775%2C1105.2762%2C1105.6108%2C1105.0913%2C1105.0272%2C1105.3715%2C1105.3184%2C1105.0060%2C1105.5391%2C1105.4328%2C1105.3429%2C1105.4543%2C1105.0839%2C1105.2752%2C1105.4402%2C1105.2070%2C1105.1352%2C1105.3041&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The chapter tackles the role of scholarly publication in the research process\n(quality, preservation) and looks at the consequences of new information\ntechnologies in the organization of the scholarly communication ecology. It\nwill then show how new technologies have had an impact on the scholarly\ncommunication process and made it depart from the traditional publishing\nenvironment. Developments will address new editorial processes, dissemination\nof new content and services, as well as the development of publication\narchives. This last aspect will be covered on all levels (open access,\nscientific, technical and legal aspects). A view on the possible evolutions of\nthe scientific publishing environment will be provided."}, "authors": ["Laurent Romary"], "author_detail": {"name": "Laurent Romary"}, "author": "Laurent Romary", "arxiv_comment": "To appear in Mehler, Romary, Gibbon (eds), Technical Communication,\n  M. de Gruyter, Berlin (2011)", "links": [{"href": "http://arxiv.org/abs/1105.3287v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1105.3287v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "cs.DL", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cs.DL", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1105.3287v1", "affiliation": "IDSL, INRIA Saclay - Ile de France", "arxiv_url": "http://arxiv.org/abs/1105.3287v1", "journal_reference": null, "doi": null, "fulltext": "Scholarly Communication1\nLaurent Romary, INRIA & HUB\nThe chapter tackles the role of scholarly publication in the research process (quality,\npreservation) and looks at the consequences of new information technologies in the\norganization of the scholarly communication ecology. It will then show how new\ntechnologies have had an impact on the scholarly communication process and made it depart\nfrom the traditional publishing environment. Developments will address new editorial\nprocesses, dissemination of new content and services, as well as the development of\npublication archives. This last aspect will be covered on all levels (open access, scientific,\ntechnical and legal aspects). A view on the possible evolutions of the scientific publishing\nenvironment will be provided.\nKeywords: digital libraries & online journals, e-print archives, communication models,\ncommunication platforms, copyright issues, open archive initiative.\n1\n\nINTRODUCTION ......................................................................................................................................... 2\n\n2\n\nCHARACTERIZING SCIENTIFIC INFORMATION ............................................................................... 2\n\n3\n\nACQUIRING SCIENTIFIC PUBLICATION.............................................................................................. 4\n\n3.1\n3.2\n3.3\n3.4\n3.5\n4\n4.1\n4.2\n4.3\n4.4\n5\n\nA TRANSITIONAL MODEL – BIG DEALS ...................................................................................................... 5\nTOWARDS NEW CONTRACTUAL SCHEMES ................................................................................................. 6\nOPEN ACCESS PUBLISHING AND BUDGET CENTRALISATION..................................................................... 6\nMAKING PUBLISHERS' OFFER FIT ACADEMIC NEEDS ................................................................................ 7\nGENERAL PERSPECTIVE ........................................................................................................................... 10\nSCIENTIFIC INFORMATION AND OPEN ACCESS ........................................................................... 10\nDEFINING OPEN ACCESS AGAIN? ............................................................................................................. 10\nA REFERENCE CASE – HAL ...................................................................................................................... 11\nPUBLICATION REPOSITORIES – THE RESEARCHER'S VIEW.................................................................... 12\nPERSPECTIVE: INTELLIGENCE IN THE PLATFORM .................................................................................. 12\nDEALING WITH RESEARCH DATA AND PRIMARY SOURCES ................................................... 13\n\n5.1 CHARACTERISING RESEARCH DATA ............................................................................................................ 13\n5.1 POOLING DATA TOGETHER – THE CORE OF THE SCIENTIFIC DATA BUSINESS ...................................... 14\n6 TOWARDS A \"SCHOLARLY WORKBENCH\" – A VISION FOR THE FUTURE OF SCIENTIFIC\nINFORMATION ................................................................................................................................................ 15\n6.1\n6.2\n6.3\n\nCORE SERVICES OF THE VIRTUAL RESEARCH SPACE .............................................................................. 15\nCOMMUNITY REVIEW AND CERTIFICATION ............................................................................................ 16\nTHE LIBRARY CONTINUUM ...................................................................................................................... 17\n\n1.\n\nINFRASTRUCTURES FOR SCIENTIFIC INFORMATION .............................................................. 17\n\n7\n\nREFERENCES ............................................................................................................................................ 18\n\n1\n\nThis paper has strongly benefit from close interactions with Norbert Lossau, director of the\nState and University Library of Göttingen.\n1\n\n\f1 Introduction\nThis chapter provides an overview of the various issues related to scientific information seen\nboth from the point of view of the researcher, with his/her need to have access to and\ndisseminate research results, and the research organisation, which has to define means to\noptimize the efficiency and visibility of the research it performs. Indeed, this chapter will\nprovide some basic guidelines on the design of a scientific information policy that aims at the\nbenefit of research itself.\nScientific information is considered here in the broad sense of the knowledge that a scientist\nacquires to carry out his/her research as well as the knowledge he/she produces, and then\ncommunicates, in the context of his/her research. This definition indeed reflects the extremely\nindividual nature of scientific information, which relates to the capacity that researcher's\nresults will be further used and quoted. From a wider perspective, scientific information can\nbe defined as the knowledge that circulates within a scientific community as part of the\nresearch processes. As a consequence, defining a scientific information policy consists in\noptimising the scientist's information ecology, by providing the best access to existing\nknowledge, as well as the brightest dissemination to research productions and results.\nWhereas the management of scientific information could be seen as mainly targeted to benefit\nthe progress of science, there are some additional factors, which have to be kept in mind when\ntrying to figure out how to organise the corresponding processes. First, managing scientific\ninformation is a kind of second-order activity, which comes, from an economical and\norganisational point of view, in complement, sometimes even in competition, with the actual\nsupport (in staff and equipment) that could be directly provided to research. Second, scientific\ninformation, being a tangible sign of scientific activity, is the first objective element that is\ntaken into account when assessing the research activity of an individual, a research group, or a\nresearch organisation. As a consequence, scientific information management can seldom be\nconsidered as a pure technical activity and has often to be taken at a highly political level,\nwhenever it impacts on the strategy of research performing - but also research funding -\norganisations.\nBecause of the intrinsic complexity of the field of scientific management, we will focus along\nthe following sections on specific aspects that may help the reader both to identify the current\ntrend, but also to forge himself an idea on the future evolution of the domain. After\ncharacterising scientific information at large, we will thus cover successively the domains of\nscientific information acquisition, the complementary issue of publication repository and open\naccess, digital edition and data management. We will end up this chapter by providing some\ninsights on the infrastructures that are needed for developing further scientific information\nservices and finally by outlining what we think may be the actual information based research\nenvironment of the future.\n\n2 Characterizing scientific information\nThere are various types of scientific information and trying to cover them all in this chapter\nwould amount to describing all scientific fields in details. Indeed, each speciality uses and\ngenerates its own types of information and requires, when designing a scientific information\npolicy, distinguished attention. At this stage, we can identify two main classes of scientific\ninformation:\n2\n\n\f\n\n\nScientific publications, which are mainly written descriptions of ideas, methods and\nresults seen from the point of view of a specific author or group of authors;\nData sets, which are acquired through the use of experimental or observational\nsettings, as well as data production (simulations) or gathering methods such as surveys\nin the social sciences.\n\nIn this last category, we would integrate all the primary sources that are typically used in the\nhumanities, either in the form of ordinary textual documents, or as specific physical artefacts\n(ethnographical objects, paintings, encryptions, etc.).\nIt is important to note here that not all types of scientific information are actually digital. In\nmany domains, artefacts such as archaeological objects or natural components such as seeds\nor bacteriological samples have to be archived in specific repositories for researchers to\nobserve or use them within experiments. Even if digital surrogates (images, scans, genomic\ndescriptions) are often used to provide as precise a description as possible of them, they\nbarely replace the actual physical source. In this respect, this chapter only refers to digital\nmaterials and their management for scientific purposes.\nFrom the point of view of content, scientific information has some peculiarities that makes it\ndiffer slightly from other (possibly published) type of information:\n\n\n\n\n\n\nThe relation to the author is in itself peculiar, since the content of a scholarly paper (as\nwell as any commentary or even data) is essentially based on a personal creation,\nwhich has to be acknowledged, each time the corresponding content is being used by\nanother party;\nContrary to works of arts, which would be covered by the preceding point, scientific\ninformation is also subject to evaluation by the community of research, either through\nthe peer-review process (Suls and Martin 2009), or simply by the way a research work\nis cited by peer colleagues;\nScientific results should be, at least theoretically, available in the long-term (Pilat and\nFukasaku 2007), since scientific knowledge can be seen as the cumulative\ncontributions of elementary scientific results.\n\nThe combination of the three preceding points makes scientific knowledge build a network of\ntrusted contributions, where no single piece can indeed be understood without an explicit\nreference to surrounding works.\nSeen from a systemic perspective, scholarly communication processes have a very special\ncharacteristic that makes them differ from most of the types of business we may know of,\nnamely in the relation that the business itself has with regards to the corresponding producers\nand customers. Indeed, researchers play a triple role in their relation to scientific information:\n\n\n\n\nAs producers, since, by definition, scientific information, and in particular,\npublications, is the dissemination vector of research results;\nAs consumers, since in most domains, existing publications and data sets play the\nmain role in the research process, both as testimony of the current state of art or even\nas direct input for the establishment of new results;\nAs quality controller of the scholarly communication process, by intervening at each\nstages where evaluation is to take place, be it to peer review a submitted paper or to\nassess the work of a research entity.\n\nThis intricate commitment of scholars in the scientific information workflow is actually made\nsustainable because in fine the scholar himself is rewarded from the fact that the process is\n3\n\n\factually as efficient as possible. One has to make sure that ―good‖ research results are made\navailable to the community, which in turn will use - and quote - them, which will result in\nthe scholar to gain more fame (as well as institutional recognition), and thus more facilities to\ncarry out his own research. As stated in (Edlin and Rubinfeld 2004:130): ―Authors are quite\ndifferent from more traditional production inputs, since part of their compensation derives\nfrom reaching readers.‖\nFinally, it is hardly possible to speak about scientific information without tackling, at least,\nsome basic components of the underlying technologies. Even if our purpose here is mainly to\nponder upon the workflows associated to scientific information, we will see along the coming\npages the strategic orientations that must be taken in order to provide science with trustful\nenvironment. This notion of trust (applicable to scientists, institutions as well as the public at\nlarge) relies on the capacity of providing reliable digital object management environments, as\nwell as putting these within a network of interoperable components, allowing a researcher to\nseamlessly access and use scientific information in the various forms that we have identified\nso far. As we shall see such technological environment should be pragmatically designed, so\nthat they serve a wide community of users, from big research consortia down to individual\nresearchers.\n\n3 Acquiring scientific publication\nThe acquisition of scholarly content through subscriptions has been for many years the main\nduty of research libraries, together with the acquisition of scientific books. The journal\nmarket, seen from the point of view of the library, can be characterised by a high level of\nstability, due basically to two main factors: a) the attachment of scholars to their favourite\ninformation sources, in a context where conservatism is the main drive for publication and\nreading, and b) the natural tendency not to break paper collections within the library so that\none can characterise the library through its portfolio of ―journals‖. This overall stability has\nbeen further reflected in the subscription contracts negotiated between the libraries and the\npublishers (or subscription agents such as SWETS or EBSCO): from one year to another the\nevolution pressure on the actual portfolio is essentially based on the explicit request for new\ntitles on the part of the researchers and the identification of discarded, or less consulted,\njournals on the part of the library.\nThis intrinsic conservatism of the subscription ecology has been one of the major factors that\nled to the so-called serial crisis in the eighties. This crisis is the result of an unfortunate\ndynamics2 by which publishers, taking benefit from their exclusive situation, raised the\njournal prices at a pace largely exceeding inflation, and libraries, facing their own financial\nconstraints and the impossibility to cut down their core journal portfolios, focused their\nsubscription needs on major publishers. After a few years, this crisis led, on the part of the\npublishers, to a quick concentration of production means, and, on the part of the libraries, to\nthe impossibility to actually fulfil the needs of their academic communities.\nIn the following section, we will make an attempt at characterizing the post-serial crisis era,\nstarting from an analysis of the notion of big deal, and exploring some possible trends to\nfacilitate a quick and favourable evolution of the commercial scientific publication landscape.\n\n2\n\nMcCabe (2004) also demonstrates that mergers among publishers have also been a\ndetermining factor.\n4\n\n\f3.1 A transitional model – Big Deals\nIn the nineties, the contractual setting for subscriptions changed dramatically, following a\njoint necessity for publishers to optimize negotiation efforts, and, for academic libraries, to try\nto compensate for the high increase in price that had characterized the preceding period. This\nhas led to the so-called ―Big Deals‖, which have been characterized by Edlin and Rubinfeld\n(2004) as follows:\n―in a typical Big Deal contract a library enters into a long-term arrangement to get access to a\nlarge electronic library of journals at a substantial discount in exchange for a promise not to\ncut print subscriptions (the prices of which will increase over time)‖\nAs a matter of fact, such Big Deals have quickly evolved in some countries from a rather\nlocalized setting, limited to a University for instance, to cover clusters of academic\ninstitutions that started to jointly negotiate subscription agreements with publishers. After\nseveral years of practices, we would like to provide the reader with a distanced analysis of the\nlessons to be learnt from such big deals and see how much they may contribute to an\nevolution of the publishing landscape.\nAs a whole, Big Deals have had quite a few positive effects on the library landscape. Without\nanalysing the actual financial issues in details, we can analyse the benefits of Big Deals by\nseeing how much they contributed to provide more maturity and awareness about scientific\ninformation within academic institutions:\n\n\n\n\n\n\nBig Deals participated in the creation of real community of practice among research\nand education libraries, since librarians had a real opportunity to compare their needs,\ntheir relations to the scholarly communities, and also their budget capacities;\nBy establishing a point of focus on the relations between a given publisher and one or\nseveral institutions, they raised the political implication of academic management, but\nalso of scientists themselves, in the decision making process;\nThey speeded up the process of moving to electronic content, since most Big Deals\ninclude a wide access to the corresponding publisher's catalogue, thus bringing up the\nnecessity of identifying the actual needs related to online access (such as long-term\naccessibility and archiving, see below), and the underlying infrastructures (access\nportals) to be put together;\nThey forced academic libraries to think in-depth on the value for money that\nsubscription schemes actually bring to institutions, in particular considering such\nfactors as usage (hardly considered in the paper world), or budget consolidation when\nBig Deals would directly impact on the capacity to establish subscription contracts\nwith smaller publishers not involved in Big Deal negotiations.\n\nStill, these rather organisational benefits should not hide the core problems that Big Deals\nhave brought with them, and which can be analysed along two main lines:\n\n\n\n\nBig Deals have introduced a highly conservative view on the subscription models\nbetween libraries and publishers. Indeed, the journal-based model, coming from the\nprinted world, and the corresponding constraint imposed by publishers that turnovers\nshould be preserved on the basis of the existing print subscription, have locked\nlibraries into a system which give them no margin of manoeuvre in the management of\nlibrary costs in the future;\nBig Deals have also showed the weaknesses of academics in dealing with strategic\nnegotiations and in particular the difficulty for libraries to be strong at the negotiation\ntable. Recent examples of clashes during a Big Deal negotiation should not hide the\n5\n\n\ffact that many contracts have been renewed without much improvement from one\nround of negotiation to another.\nConsidering all factors, and in particular the risk that Big Deals may contribute to fossilize the\nsubscription landscape, it is important to see such models as transient ones and identify\npossible evolutions that may prevent a long-term dependency to publisher's requirements.\nFirst, libraries should not be left alone in negotiating large-scale and long-term agreements\nwith publishers. Whereas they are essential in providing objective information about the\nexisting needs and usage, negotiation teams should always integrate academic managers and\nscholars with in-depth knowledge about scientific information processes. Second, prior to any\nnegotiation, global objectives should be set, at the benefit of scholarly work, not only in terms\nof financial benefits, but also in terms of additional benefits that the community may gain\nfrom a new contract. We will see in the coming sections how much in particular, the notions\nof archival and open access may impact on the actual subscription policy of an academic\ninstitution.\n\n3.2 Towards new contractual schemes\nThe difficulties related to the current subscription system could easily be seen as a deadlock\nfor most research organisations since it basically hampers any possibility to define a real\nstrategy in the domain of scientific information at large. Indeed, by freezing part of the budget\non fixed expenses, it prevents these organisations from both adapting the corresponding\nbudget to their economical situations or their priorities, but also is a major hindrance to the\ndesign of new ways for scientific information to be seamlessly exchanged among the research\ncommunities, as would be needed for better and quicker scientific progress.\nStill, even if we identify that there is a need for an in-depth evolution of the publishing\nenvironment in the scholarly world, we also ascertain that it can only be implemented through\nthe exploration of a variety of new deals between research organisations and publishers. With\nthis orientation in mind, we present in the following sections some possible actions that could\nbe pursued to contribute to such an evolution. All of these have been already implemented\nand validated within organisations and we will try to draw prospective conclusions from the\nassessment that we will make for each of them.\n\n3.3 Open access publishing and budget centralisation\nThe first move we would like to address here actually comes from the publishing sector,\nwhich has experimented in the recent years ways of offering open access content (Velterop\n2003) on the basis of a payment that would not result from a subscription, but that would take\nplace on the author's side (hence the expression of author-pays model). In this domain, one\nneeds to make a clear distinction between opt-in schemes and native open access journals.\nIn the opt-in open access schemes, publishers (e.g. the Open Choice scheme by Springer)\noffer the possibility for an author to finance the full accessibility on the publisher's web site\nof the final version of his paper at the time of publication. Such schemes have several\ndisadvantages. It creates a burden on the authors, who have to decide on (and finance) the\nonline publication of their papers, one by one. It implements a double payment system in\ninstitutions which do have subscriptions to the corresponding journals, and as a consequence,\nprevent the institutions from getting an accurate overview of the budget they dedicate to\npublication material. All in all, we strongly recommend not to support such schemes and to\nclearly inform the scholars about their danger.\n\n6\n\n\fTrue open access journals (such as the PLoS3 portfolio or most of the titles from BMC) offer\nthe author-pays model whereby authors must systematically pay publication fees to the\ncorresponding publisher, but conversely no subscription is required to get access to the\ncontent. As opposed to opt-in schemes, there is here no risk of double payment and the\nsituation is by far clearer for institutions that may centralise a specific budget made widely\navailable to authors (thus reducing the administrative overhead). Still, such schemes (but the\nreverse arguments exist for the standard subscription scheme) present the dangers that it may\nbecome even more difficult to publish for institutions or countries with reduced means, and\nalso that there may be free-riders, i.e. entities (in particular private firms) which benefit from\nthe publication material, without contributing at all to the corresponding cost. Still, the\ncapacity that open access journals offer to centralize the corresponding budget and thus to\nmonitor the actual evolutions within and across research institutions worldwide encourages us\nto advocate the integration of open access journals within the scientific policies of academic\ninstitutions at large.\n\n3.4 Making publishers' offer fit academic needs\nNot only has the move from the traditional printed journal model to online delivery changed\nthe capacity of scientists to quickly access information, it has also deeply modified the\nperception that academic institutions had of the management processes one should deploy for\nsuch information. This has resulted in identifying new requirements - and indeed new\nservices - that the publishers should fulfil in conjunction with what would normally be\nassociated with a subscription contract.\nThis section explores how such requirements can be contemplated, and possibly implemented,\nfrom the point of view of the content proper, i.e. how much an institution should claim to\nreceive precise information from publishers, in order to go towards a better and more\nsovereign management of its own scientific information. We will indeed explore these issues\nin two stages, related to a) the acquisition and management of reliable meta-data and b) the\nvarious archiving levels that one may demand in the context of subscription schemes.\nIt is quite straightforward to understand why it is of strategic importance for an institution to\nhave a good overview of its scientific production and consequently why managing reliable\nmeta-data about publications is considered as a very sensitive issue. As it provides an insight\non the quantity and quality of the actual publication activity of individuals as well as of\ninstitutions, such information is at the core of reporting activities, of researchers' assessment,\nas well as for any strategic planning endeavour. It is also of paramount importance that such\nmetadata be both precise and accurate, since it should allow gaining insights into such a\nvariety of publication features as the actual domains where research is produced, or the\ncollaboration schemes that an organisation may have with other institutions or other countries\nfor instance.\nWhat is meant here by precise and accurate is the capacity for a database, and consequently\nfor an interchange format, to provide metadata information where all elementary and\nmeaningful pieces correspond to a specific field, associated with a precise semantic and\nmappable onto the most relevant international standards. This has an impact at three main\nlevels of a bibliographical representation:\n\n3\n\nCf. Brown et al. (2003)\n\n7\n\n\f\n\n\n\nIn the description of publication information where article information (title, volume,\nissue, pagination, DOI, publication date) and journal information (title, ISSN) should\nallow for both a precise identification but also accurate description of the article;\nIn the representation of author data, where not only names should be finely\nrepresented (all name components should have their own fields), but also affiliations\nshould be dealt with as precisely as possible;\nIn the production of basic content related information such as keywords, domain\nclassifications or abstracts.\n\nWhereas the first point is rather straightforward and usually dealt with quite well in various\npublication platforms, the second one is often underestimated. Still, precise author data and in\nparticular affiliation represent a key aspect for the further exploitation of publication data, in\nparticular in for the study of collaboration patterns (Subramanyam 1983). For instance, being\nable to sort out papers by institutions, or to analyse the geographical patterns of copublication is part of the patterns that one wants to be able to identify out of a bibliographical\ndatabase.\nIn the ideal case, there would be an excellent opportunity to compile such meta-data on the\nbasis of the information available from publishers (at least for journal papers). However, as\ndemonstrated in particular by the technical work within the European PEER project4,\nscientific publishers have no coherent framework for such data and, in fact, some have\ndifficulty to provide precise information concerning authors and their affiliation. It occurred\nalso that publication repositories are not that in a better shape and the PEER project is the\nopportunity to demonstrate how much a standard-based approach (based on the customisation\npossibilities of the TEI5) could lead to a higher degree of interoperability (Ide and Romary\n2004) between platforms.\nIf we were to make a move towards higher interoperability across platforms, the scenario\ncontemplated here would be that any publication repository, whether public or private that\ncontains precise and reliable chunks of information should be in the position to deliver them\nto complement the information that another repository would require. Whereas such a\nscenario may be extremely complex to implement across any kind of platform, in particular\nbecause of the heterogeneity of formats we have identified above, it is possible to contemplate\nthe maintenance of a clearinghouse6, which would at least serve the network of public\npublication repositories.\nWe should note here that the precision required for exchanging meta-data between publication\nrepositories in such scenarios as the ones addressed here has nothing to do with the very\nshallow formats required by current harvesting processes, which, for instance, are part of\nprotocol such as OAI-PMH (Lagoze and Van de Sompel 2001). Indeed, we anticipate an\nessential evolution of publication repositories, which, seen as trusted sources of information,\nwill be able to provide, at any level of granularity, all the description attached to their digital\ncontent (see also Groth et al. 2010).\n\n4\n\nThe meta-data available from 12 publishers, comprising some of the major companies in the\nfield, have been mapped onto one single standardized structure, in order to be pushed to a\ngroup of publication repositories in the context of a large-scale (green) open access\nexperiment.\n5\nText Encoding Initiative, www.tei-c.org\n6\nThe PEER Depot, implemented in the context of the PEER project is an excellent example\nof such a clearing house.\n8\n\n\fBeyond meta-data, it is also important to consider how much an institution can demand on the\navailability of the full publication content and identify how much we could globally make\nprogress in this domain. The issue here is quite simple to state: the move from paper content\nto digital one has changed the relation between the customers and the content in two\ncomplementary ways:\n\n\n\nThe move to digital content has deprived step-by-step academic libraries from their\nrole of reference archive for scholarly content (Greenstein 2000);\nPublishers have progressively taken up the management of the archival dimension of\ndigital content, claiming that this content is always ―accessible‖ from their own\nplatforms, which would offer better technical facilities as well as all guaranties for a\nsustainable availability (Kling and McKim 1999).\n\nThese changes have created a strong dependency towards the commercial sector, with\nacademic institutions only lately identifying the need to define a strategy in this domain. What\nindeed would we have is such and such publisher would disappear, or if a major conflict\narises between the academic sector and the private one, where the former would lack\nauthority towards the latter for sake of this dependency? Even if not central such a feeling has\ncontributed to the open access movement, when scholars (and their institutions) identified that\nin the digital age content could, and indeed should, be pooled together in a coordinated\nmanner.\nIn order to go towards a better management of published material by research institutions\nthemselves, there is a need to act explicitly during the negotiation stage of subscription\ncontracts. There are indeed three levels of requirements that could be identified in the domain\nof long-term access to publication:\n\n\n\n\n\n\nIf the data is to be solely archived by the publisher, one should minimally require a\nperpetual access right to the material subscribed at a given period. Concretely, this is\nto guaranty that even if a contract with the publisher is interrupted, all journal content\nthat has been paid for (new issues and backfiles) will remain accessible for the\npopulation that had benefitted from the initial agreement;\nTo guaranty a better independence from the publisher's services and secure the\navailability of subscribed material, one can introduce a clause allowing the institution\n(or the corresponding consortium) to host the content and deliver it through its own\nservers. Further archival copies should of course be needed to ensure continuous and\nlong-term accessibility;\nFinally, an institution can require that all the subscribed material that also corresponds\nto content authored by its researchers7 could also be uploaded in a designated\npublication repository, in keeping with the institution's open access policy.\n\nThese three levels actually impact on the general copyright scheme that should be associated\nto scholarly content. While we argue that the private sector has an essential role in providing\ncore services, such as certification, in the scientific publishing workflow, new deals have to\nbe set so that such services are never correlated with any kind of exclusive copyright transfer.\nAs can be understood, we try to argue here that academic institutions should strive towards\nthe establishment of scientific information repositories where publication meta-data and\ncontent are pooled together within a sustainable and reliable environment. Such an orientation\n7\n\nDepending on the agreement, the coverage can be limited to corresponding authors or (like\nwas the case of the agreement between the Max Planck Society and Springer in 2008)\nextended to any co-author of the publication.\n9\n\n\fbears a quite natural technical side, but it should also be taken very seriously as a component\nof ongoing discussions with the private sector. At the highest level, and in particular in the\ncontext of national licence program, such evolutions have to be discussed with the same level\nof attention as budget or coverage issues.\n\n3.5 General perspective\nAs a whole, we see there is a need for a real strategic view in the way we are to handle future\ncommercial deals with the publishing sector at large. On the one hand, we need to identify\nmeans to make our budget more depending on the real need of research organisation rather\nthan see it be determined by external interests. On the other hand, we need to identify the\nactual services that we require from publishers and negotiate with them the best value for\nmoney, considering also the services that we do not actually want from them. As we shall see\nfrom the following developments on research repositories, research performing organisations\nmay want to achieve some of the functions that were so far externalized to the private sector,\nwhen these reflect a strategic interest for them.\n\n4 Scientific information and open access – the role of\npublication repositories\n4.1 Defining open access again?\nThe open access movement has gained in the recent years enough momentum and fame that\none could believe that there is hardly any need to enter too much a discussion about its scope\nand objectives8. Epitomized by the Berlin declaration9, the open access ideas reflect a tension\nbetween two opposite sets of forces:\n\n\n\nThe necessity for the publishing business to keep its revenue, thus leading to everincreasing subscription budgets for the academic institutions;\nThe feeling that dissemination of scientific information in the digital age should be\nstraightforward (i.e. without intermediaries) and fundamentally cheap.\n\nWith a sense that there is no clear way out of this situation, the open access movement is an\necho to the feeling that academics should take action and devise their own means of\ndisseminating their research papers. The so-called green way to open access is thus focussing\non providing technical platforms10 and policy settings11, for the self-archiving and free\ndissemination of scholarly papers. In a way, it is complementary, or even contributes, to the\nattempt outlined in the first part of our paper to define new collaboration schemes between the\nacademic institutions and the commercial publishers.\nStill, the green open access movement can be characterized by a quite narrow view on\nscholarly publishing and the angelic idea that researchers may just join the self-deposit\nmovement by conviction or by being mandated. The situation is de facto more complex, and\ninstead of making here a theoretical or comparative analysis12 of the publication repository\nlandscape, we would like to illustrate the various views that may exist upon a publication\nrepository, by presenting the specific case of the Hyper Archive en Ligne (HAL) repository,\n8\n\nSee (Davis 2009) for an overview of the doxa on the subject.\nhttp://oa.mpg.de/lang/en-uk/berlin-prozess/berliner-erklarung/\n10\nusually referred to as institutional repositories (cf. Lynch 2003, and the wider distance\nanalysis in Romary and Armbruster 2010)\n11\nin the form of deposit mandates (see Sale 2007)\n12\nsee Armbruster and Romary (2010) for such a global comparison.\n9\n\n10\n\n\fwhich, across the years has become the reference environment for the French academic\nlandscape.\n\n4.2 A reference case – HAL\nIn the mid-nineties, Hyper Archive en Ligne (HAL) was put together by physicists who\nwanted to implement a mirror archive to the already long-standing ArXiv (Ginsparg 1994). At\nthat time, the main drive was to benefit from an independent platform that could have its own\neditorial policy, be independent from possible access problems to the United States and also\nbe able to develop its own functionalities. With the support of the CNRS13, a service unit14\nwas put together and a first implementation made operational within several months. The\nspirit of this first environment was mainly targeted towards pre-prints (stage 1), to favour an\nearly dissemination of research results.\nStep by step, the French physicist community, as well as mathematicians, got used to deposit\ntheir papers in HAL and in the mid-nineties, the repository gained momentum when the\nCNRS decided to promote it within other disciplines and adopt it as its main source of\ninformation to published material by its researchers15. At the same period, several research\norganisations in France, among them INRIA and INSERM16, decided to adopt HAL as a way\nto make concrete their adhesion to the Berlin declaration on Open Access17. This extension\nprocess led to a national agreement, signed in 2007, of most of the French research\ninstitutions, together with the national conference of French Universities to sign an agreement\nto work jointly on the further development and support of HAL.\nAs analysed in Armbruster and Romary (2010), the evolution quickly outlined above has set\nHAL as a publication repository that can hardly be reduced to the usual narrow concept of an\ninstitutional repository.\n\n\n\n\n\n\nIt offers services to multiple research performing organisations such as CNRS,\nINSERM or INRIA, as well as universities. Each institution may have its specific\nportal through which their researchers may deposit and where all corresponding\nproductions are visible. Still, any content is part of a single repository, thus allowing\nsearches to be extended to the whole content;\nIt bears a strong multidisciplinary mood, either because of the disciplinary nature of\nsome of the supporting institutions, or because specific communities have set their\nown portal, but also more generally, because it matches the cultures of various\nscholarly communities by both considering pre-prints or published material as its core\ninput;\nIs has reached a cross-institutional recognition which makes it be the default\nrepository for Universities or research funding organisations18 aiming at indentifying\ntheir research production.\n\n13\n\nCentre National de la Recherche Scientifique (www.cnrs.fr)\nCentre pour la Communication Scientifique Directe (CCSD) – http://www.ccsd.cnrs.fr/\n15\ncf. http://www2.cnrs.fr/journal/2546.htm\n16\nInstitut National de la Santé et de la Recherche Médicale (www.inserm.fr)\n17\nhttp://oa.mpg.de/lang/en-uk/berlin-prozess/berliner-erklarung/\n18\nSee the news (in French) where the French Agence Nationale de la Recherche announces\nthat it requires that all publications related to a project it funds should be deposited in HAL:\nhttp://www.agence-nationalerecherche.fr/magazine/actualites/detail/?tx_ttnews%5Btt_news%5D=159\n14\n\n11\n\n\fAll in all, and things being seen from the wider perspective of a national scientific\ninformation policy, HAL is providing a high level service, well integrated in the institutional\nlandscape, for a very low budget through its highly centralized technical nature. Still,\ninstitutional recognition is, as we know, useless, if researchers themselves are not convinced\nthat using the platform may bring some added value to their own work. It is thus worth\nobserving why in such a community as computer science, and in particular within INRIA,\nHAL has gained such a fame and become part of the scientists' daily practice.\n\n4.3 Publication repositories – the researcher's view\nOne immediate feedback that is received from colleagues using the HAL-INRIA portal on a\nregular basis is the high visibility that the corresponding papers receive immediately from\nmost international search engines (hear ―Google‖). Indeed the centralized management of the\narchive has made it feasible since years to maintain good working relationship with the\ncorresponding technical teams and to tune the software interfaces to optimize the visibility.\nFrom the point of view of the researcher, this is observed through the immediate high\nretrievability of a paper, as soon as relevant keywords for the corresponding field are typed in.\nThis visibility can also be traced on the ranking of publication repositories produced by\nWebometrics (Björneborn and Peter Ingwersen 2004), which actually shows HAL and HAL\nINRIA as performing respectively on the platform and the institutional ranking.\nThe second important aspect, which is often mixed up with the traditional notion of\ninstitutional repository (cf. Armbruster and Romary 2010) is the specific institutional setting.\nIndeed HAL provides specific institutions (or communities) with dedicated portals which\nallow them to deal with the publication archives in their own way, by adapting the graphical\ncharter, adopting their own editorial policy for content, or building up their additional tools\n(e.g. connection to in-house reporting mechanisms). Such views allow both the institution and\nthe researchers to actually feel at home within the HAL platform, while benefiting from all\ngeneric features and evolutions that are developed globally.\nLast but not least, the wide acceptance of the HAL Platform within INRIA can also be a great\ndeal attributed to the important editorial support provided by the library network, which\nsystematically reviews all entries after authors make a deposit, or at times even help author to\nmake batch deposits when necessary. By completing missing meta-data, correcting actual\ndescriptions (bibliographical descriptions, spell-checking of abstracts), by directly interacting\nwith authors in border-line cases (software documentation, management of anteriority) and\nfinally ensuring that the most appropriate tools and interface are being put higher-up on the\ndevelopers' agenda, the librarians convey a feeling of stability that encourages even more the\nresearchers to see HAL-INRIA as a trustful archive.\n\n4.4 Perspective: intelligence in the platform\nThe experience we can gain from observing such a platform has HAL let us take a real\ndistance with some of the most polemic (and at time conservative views19) on open access and\nanticipate on how much publication repositories can be made a tool at the service of science at\nlarge. Without anticipating on the wider vision we will outline at the end of the paper, we can\ntry to make a short term project on the way we see publication archives provide even better\nservices to researchers.\nIndeed, and taking up the notion of ecology of publication repositories from (Romary and\nArmbruster 2010), we see that if we want to better integrate publication archives in the\nresearcher's information ecology, we need to provide him with a variety of seamless services\n19\n\nSee for instance Harnad (2011).\n12\n\n\fthat will facilitate the deposit and further use of research articles. Such services would\nactually occur at various levels:\n\n\n\n\n\n\nAt the deposit stage of a paper, one should relieve the depositor from typing in\ninformation that could be retrieved from other sources, or the paper itself. Typically, a\ngood management of authors and associated affiliations, in particular in the context of\nusual co-authors is essential. In complement, automatic information extraction\ntechniques20 from textual content should allow to pre-fill most of the meta-data\ninformation required for a proper management of content in publication repositories;\nWe should work towards providing researchers with more capacities at managing their\nworkspaces within publication repositories. They should be allowed to keep drafts\nunpublished, add collections of graphics or images, or even additional documents such\nas slides, posters or videos, which may come as natural complements to the paper\nitself;\nAs the dissemination level, it is essential to provide efficient tools for researchers to\ncompile information from the repository, either as publication lists when preparing a\npaper or an institutional report, or to generate his web page or that of his research\ngroup.\n\nIn the current publication repository picture (cf. Armbruster and Romary 2010), such features\nare occasionally implemented, but there is a need for a concerted development that only a\nmore centralized view on repositories may allow us to seize. Furthermore, institutions should\nclearly state how much they consider the issue of polling up publication data by redirecting all\ninformation gathering needs towards what is actually available there.\n\n5 Dealing with research data and primary sources\nIn the continuity of the infrastructural work carried out for publication, the academic\norganisations are more and more turned into considering the importance of dealing with\nresearch data as part of their scientific information management duties. Indeed, as exemplified\nby the report issued to the European commission in October 2010 (Wood 2010), the\nmanagement of data has become a key issue for the definition of new research funding\nprograms and in particular for the establishment of digital research infrastructures. One of the\nkey issues related to scientific data infrastructures is that of trust, in the sense that researchers\nmay deposit and re-use scientific data with full confidence that these will be properly curated\nand preserved in the long run.\n\n5.1 Characterising research data\nThe notion of research data is by far more fluid and heterogeneous as that of publication and\nshall deserve a specific attention. Contrary to publications, research data cannot be\napprehended as a set of clearly identified objects. Data occur at various stage of the research\nprocess and may usually be seen at various levels of granularity, from elementary samples to\nlarge collections (or corpora). Quality is also an issue where part of the research activity is\nindeed dedicated to the selection and enrichment of primary data acquired from some\nequipment, or, as is the case in the humanities (Romary 2011), directly selected from various\ncultural heritage sources.\nScientific data bear many common features with publications. In essence, they require to be as\nneatly associated to the originated researcher or institution, as a warrant for the trustfulness of\n20\n\nSee in particular the importance of machine learning techniques in this respect (Lopez\n2009)\n13\n\n\fthe content, but also in order to allow an adequate citation of the work. More generally,\nscientific data have to be, even more than publications, associated with precise metadata (in\nthe same way as what we have for publications with bibliographical data). Indeed, whereas\none can contemplate the idea of retrieving the source of a paper while looking at it, there is\nhardly any chance that a collection of numbers may tell anything of its format and origin. The\nfear with scientific data is that, by not taking the adequate time to document it, researchers\nmay create data cemeteries, which may prevent any further reuse.\nFrom a strategic point of view such issues cannot be dealt with without academic institutions\nhaving a real data curation strategy, which complements the issues of data description\noutlined above with that of data selection. As a matter of fact, it becomes more and more\nimpossible for some scientific fields to keep all the data they produce, since these would go\nby far beyond the IT capacities as we know them today. To take the most prominent\nexamples, the new Large Hadron Collider at CERN21 is planned to generate several peta-bytes\nper year, which in turn forces their technical infrastructure to be organized as a cascading\nnetwork of computer nodes, where just filtered-out data is percolated down to the individual\nresearchers.\n\n5.1 Pooling data together – the core of the scientific data business\nBeyond the local management of research data at the production locus proper, it is important\nto keep in mind that a major challenge for the further progress of research in many fields is\nthe capacity for research entities to be able to pool together data assets in order not only to\navoid duplication of work, but even more to combine complementary evidence to form a\nwide-coverage informational basis for a given field. This trend has been initiated several\ndecades ago by domains such as astronomy22, which actually endowed themselves with\nvarious means to create networked or even joint databases of observational data (images,\nfrequency range observations), but also of stellar objects and associated bibliographical\nreferences. To extend such trend in all fields of science, research communities, but also\nresearch organisations and governmental bodies should act in basically three directions:\n\n\n\n\n\n\nAt the political level, there should be a strong incentive towards researchers so that\nthey actually make the wide dissemination of data a standard component of their work.\nSuch incentives may take the form of financial support, but also of effective\nrecognition mechanisms for those who take actively part to this endeavour;\nFrom a legal point of view, communities should identify the least damaging licensing\nframeworks so that scientific results are of course systematically attributed to their\nproducers, but also no hindrance is made to the combination of information which\nwould have contradictory legal status23;\nFinally, the compilation of data collections requires a strong technical coherence, to\nensure in particular that data assets are made interoperable for joint queries and\ncombined visualization or processing. This requires that scientific communities be\n\n21\n\nhttp://public.web.cern.ch/public/en/lhc/lhc-en.html\nSee Heck (2003) for an overview, but also Heintz and Jaschek (1982) to get an idea of the\nvisionary mood of the astronomers in the early 80's.\n23\nWhen\napplicable,\na\nbasic\ncreative\ncommons\nCC-BY\n(http://creativecommons.org/licenses/by/3.0/), where the sole constraint is actually to\nguaranty the attribution of the work to its source may be considered as a baseline for such\nlicences. Any additional constraints may then become a stumbling stone for the further\npooling of information. For a wider discussion on this see Wilbanks and Boyle 2006.\n22\n\n14\n\n\finvolved in standardisation activities24 to produce the appropriate requirements and\nguidelines for the representation of the data relevant for their field of activity.\nAs can be anticipated, the last point cannot be seen as a short-term endeavour. Each field has\nto identify its own requirements, link these with the existing international standards and make\nsure that the corresponding standards will evolve at the same pace as scientific discovery\nproper. As demonstrated in (Romary 2011) for the general area of the humanities, such\nstandardisation efforts (Gray et al. 2005) relate to the capacity to provide conceptual models\nfor the corresponding data, so that these models are also independent of the contingencies of\nIT facilities at a given time.\n\n6 Towards a \"scholarly workbench\"25 – a vision for the future of\nscientific information\nIn the previous sections, we scrutinized the ongoing evolutions of the scientific information\nprocesses, and delineated step by step a vision where institutions and scholars would take up\nthe lead in making these changes facilitate the scholarly work. We saw in particular how\nmuch the categories of publication and data may deserve in the long run a similar treatment in\na context where the separation between the two becomes less and less marked. In this context,\nwe would like to end up our analysis by describing the way we would dream the researcher's\nworkspace of the future, as a target object that we would try to reach when making strategic\nchoices within our organisations. This virtual research space (or eSciSpace) would indeed\napply for all types of scholarly activities from ―hard‖ physical sciences to the study of\nprimary sources in the humanities.\nIn the virtual research space scenario, we define a research asset as any piece of information\nthat may be manipulated and further made public by a scholar in his working space. These\nmay be pieces of text, data collections of all kinds, annotations to any research asset, or\nvirtual research folders grouping together research assets in the course of the scholar's\nactivity.\nIn his research workspace, the scholar manages all the stages of his scientific information\nactivity, gathering initial evidence by importing data from external repositories, in the form of\n―publications‖ or as extractions of existing observations or documents provided by other\nscholars. Building up from this evidence, he compiles and organises his thoughts in the form\nof drafts or annotations directly linking to the other documents in his workspace, applying\nspecific software to compute new features from his observations, and organize his thoughts by\ngrouping meaningful sets of information in dedicated research folders.\n\n6.1 Core services of the virtual research space\nThe virtual workspace outlined above resides on the availability of some basic services,\nwhich, not necessarily being specific to the scientific information domain, are mandatory to\nimplement the target scenarios we anticipate. These essential services are the following ones:\n\n\nThe researcher is automatically identified when connecting to his/her workspace, on\nthe basis of a global authentication process. As a consequence, the various parameters\nof his/her research environment (affiliations, ongoing funded projects, co-workers) are\n\n24\n\nSee Ochsenbein et al. 2005 for an exemplary community endeavour.\nThis expression appeared in the initial work plan of the eSciDoc project in 2005\n(www.escidoc.org/) (Dreyer et al. 2007).\n25\n\n15\n\n\f\n\n\n\n\navailable, so that the appropriate information can be attached easily to any research\nasset he/she manipulates;\nHis/her workspace allows him/her to create research folders of any kind where he/she\ncan compile various objects (notes, data sets, links to external sources, as well as\nrelated persons and events as, e.g., meetings26);\nUnique identifiers are provided for all objects in the workspace, which can serve as a\nstable reference for any further quotation or reuse;\nA precise versioning system is at hand, which allows him to trace the evolution of any\nresearch assets and publish any version according to his will.\nLast but not least, the scholar has full liability to select any of his research assets and\ngive access rights to other individuals, groups of individuals or the public at large.\n\n6.2 Community review and certification\nIn the perspective we want to defend here, the research workspace is also the locus where the\nvalidation of the research results takes place, opening up a whole range of new possibilities\nfor a scholar to gain approval or recognition from his peers. Indeed, moving away from the\nhighly focused peer-review process that we currently have for publications, the management\nof a research workspace combining written documents and data-sets, together with the\ncapacity to provide various levels of visibility to any combination of these objects, allows one\nto anticipate a much broader community based validation of scholarly content. In the various\npossibilities we will describe below, the scholar always keeps the initiative to launch a\ncertification process, but the capacity on his virtual workspace allows him actually receives\nthe level of feedback he actually wants.\nThe baseline case is not that far from the current peer-review system, as we know it. It is\nbased on the assumption that there exists certification entities associated to a specific topic,\nand which are articulated around a scientific committee. In this scenario, the scholar gathers\nresearch assets in a dedicated research folder and, when he considers the corresponding result\nto be worth it, he simply makes it accessible to the certification entity, asking for ―peer\nreview‖. If the evaluation is positive, the research asset receives a review certificate, which\ncan be associated to any data feed related to it. Through this process, and according to the\neditorial policy - as well as the scientific recognition - of the certification entity, the\nresearch asset becomes a ―peer-reviewed‖ publication in the literal meaning of the term.\nOn the opposite side of the spectrum, the scholar may not want to have an official\ncertification process, but would like to receive a certain level of recognition of his results\nfrom a community. To this end, he can publicize a research asset and issue a targeted call for\ncomment, which may range from selected colleagues to a wider scientific community. Such\ncalls would transit through scholarly feeds or social networks to which the researcher\nsubscribed. Feedbacks to the call take the form of commentaries, which may be posted in the\ncommentators' research space and linked to the research asset. The collection of\ncommentaries can in turn be used to derive a new version of his work or to assess the\nrecognition of his scientific contribution within the community.\nThis generalized process of certification incorporates various attempts at exploring new types\nof peer review in various research communities. Initiatives like open peer review from the\n\n26\n\nPart of the necessary infrastructure would resemble services such as those offered by\nCalenda (http://calenda.revues.org/) the French diary of events in the humanities (Dacos et al.\n2006).\n16\n\n\fEGU (Pöschl 2004), or the attempt at creating data journals27 for assessing the added value\nrelated to the compilation of reference data sets would naturally fit into this picture. Besides,\nthe basically open nature of research workspace would facilitate the compilation of new types\nof evaluation metrics. For instance, usage statistics, coupled with information concerning the\nactual scholar, community of institution having used the research asset, would bring usage\nprofiles by far more precise then any kind of citation metrics we have nowadays.\n\n6.3 The library continuum\nThe problem addressed with this vision of a virtual research workspace is to help the scientist\nmanage the documents he uses and produces in his research, as well as making him feel like\nhe is in charge of his own virtual research library, where he can easily retrieve documents,\nbut also disseminate them in isolation or as collections to students, colleagues, or the wide\npublic. Indeed such a vision decentralizes completely the notion of a research library, which\nwould move from a central physical place to a delocalized space in the ―cloud‖\n(Aschenbrenner et al. 2009). Still, we may not expect that scholars would take up all the\nnecessary work related to the curation of their research assets, and comprising such a variety\nof tasks as technical integrity or adequate meta-data description. They will have to be\nsupported, and this is part of the infrastructure by new types of documentary experts\n(eLibrarians, or more commonly digital curators) that will accompany them in their\ninformation based research activity.\n\n7 Infrastructures for scientific information\nAs a word of conclusion, we should situate the conditions under which the evolutions, as well\nas dreams, outlined in this paper could actually be implemented. Indeed, most of the\ndevelopments contemplated here, whether related to publication or research data, and\ncomprising what we did not develop here in domains such as bibliometry or digital editions,\nrequire long-standing involvements of the corresponding institutions in the domain of\nscientific information management. Over the years, such an involvement, together with the\ncorresponding investments, has taken the form of real eInfrastructures at the service of\nscience. Such infrastructures have shaped differently depending on the country or the\nacademic setting ranging from high-level coordination directorate (at CNRS) or as a\ncontinuation of a strong library setting (as at the University of Göttingen, see (Lossau 2004)),\nit has also often been embodied as autonomous units dedicated to the management of\nscientific information (as in the Max-Planck Society with the Max Planck Digital Library28).\nAll these service or decision units have shown from our own experience that their efficiency\nand capacity to contribute to the strong dynamics of the field rely on a series of essential\nfactors:\n\n\n\n\nScientific digital libraries, since they already have a name (Berman et al. 2003),\nshould be close enough to the research communities they have to serve in order to\nunderstand both their needs but also their practices in the domain of scientific\ninformation; why indeed offer for instance information portals to scholars who would\nprefer using search engines to find their information sources?\nAll the same, they should be constructed around a core of highly competent staff that\nmasters such a wide range of skills as budget negotiation, IT development and\n\n27\n\nIn a context where many data journals initiative are taking shape, we can only point to the\nquite visionary initiative from JISC: Overlay Journal Infrastructure for Meteorological\nSciences (OJIMS)\n28\nwww.mpdl.mpg.de\n17\n\n\f\n\n\n\nknowledge representation. Scholars alone may not always have the adequate sense of\nthe complexity related to certain decisions;\nEven more importantly, the scientific digital library should be closely related to the\nmanagement of the corresponding academic institution, since from our experience,\nmost strategic decisions in the domain of scientific information directly impact on the\nresearch environment of the institution;\nFinally, scientific digital libraries should cover the various fields of scientific\ninformation management. If their scope is limited to such a narrow domain as the\nmanagement of journal subscriptions, they will not be in the position of identifying the\nadequate tactic moves across the various fields of scientific information.\n\nConsidering the current scientific information landscape, it seems that we are not far from\nhaving such scientific digital libraries at hand. Various attempts in this direction are taking\nplace and at the same time, we better see the role and evolution of such elementary building\nblock as publication repositories. The work ahead of us is now to bring all this together in a\nmore coherent way.\n\n8 References\nArmbruster, Chris and Laurent Romary\n2010 Comparing\nRepository\nTypes\n–\nChallenges and barriers for subject-based repositories, research repositories, national\nrepository systems and institutional repositories in serving scholarly communication.\nInternational Journal of Digital Library Systems\n1\n(4): 61-73. Available at:\nhttp://hal.inria.fr/inria-00465197\nAschenbrenner, Andreas, Flavia Donno and S. Senka Drobac\n2009 Infrastructure for\ninteractivity - decoupled systems on the loose. 3rd IEEE International Conference on Digital\nEcosystems and Technologies. DEST '09: 643 - 648\nBerman Fran, Geoffrey Fox, Tony Hey and Anne Trefethen 2003 The Data Deluge: An eScience Perspective In: F. Berman, G. Fox and T. Hey (eds.), Grid Computing: Making the\nGlobal Infrastructure a Reality\nChichester: John Wiley & Sons Ltd. doi:\n10.1002/0470867167.ch36\nBjörneborn Lennart and Peter Ingwersen\n2004 Towards a basic framework for\nwebometrics. Journal of the American Society for Information Science and Technology\n55(14): 1216-1227.\nBrown, Patrick O., Michael B. Heisen and Harold E. Varmus\n2003 Why\nBecame\na\nPublisher.\nPLoSBiol,\n1(1):e36.\nAvailable\nhttp://dx.doi.org/10.1371/journal.pbio.0000036.\nDavis, Philip M.\nPublishing 12(1).\n\n2009\n\nPLoS\nat:\n\nHow the Media Frames 'Open Access'. Journal of Electronic\n\nDacos Marin, Nancy Murzilli and Inès Secondat de Montesquieu Développer les usages en\nligne : de l'éditeur électronique au lecteur - Le cas de Revues.org Réseaux\nHumains\n/\nRéseaux Technologiques 5-6.\n\n18\n\n\fDreyer M., N. Bulatovic, U. Tschida and M. Razum 2007 eSciDoc\nInformation and Communication Platform for the Max Planck Society\nGerman e-Science Conference, Baden-Baden.\nEdlin, Aaron S. and Daniel L. Rubinfeld\nDeal‖ Bundling of Academic Journals.\n\n–\n\na\nScholarly\nProceedings of the\n\n2004 Exclusion or Efficient Pricing: The ―Big\nABA: Antitrust LJ 72(1):119-157.\n\nGinsparg, Paul 1994 First Steps Towards Electronic Research Communication. Computers\nin Physics 8(4): 390-396.\nGray Jim, David T. Liu, Maria A. Nieto-Santisteban, Alexander S. Szalay, Gerd Heber, and\nDavid DeWitt 2005 Scientific Data Management in the Coming Decade Microsoft\nResearch 34(4): 35-41.\nGreenstein Daniel\n303.\n\n2000\n\nDigital libraries and their challenges Library trends 49(2): 290-\n\nGroth Paul, Andrew Gibson and Jan Velterop\n2010\nInformation Services and Use 30(1-2):51-56.\n\nThe anatomy of a nanopublication\n\nHarnad, Stevan\n2011 Gold Open Access Publishing Must Not Be Allowed to Retard\nthe Progress of Green Open Access Self-Archiving. Logos. (Submitted).\nHeck,Andre (ed.)\n2003 Information handling in astronomy: historical\nAstrophysics and space science library. Vol. 285, Berlin/New York: Springer.\n\nvistas,\n\nHeintz, Wulff and Carlos Jaschek\n1982 Automated data retrieval in astronomy:\nproceedings of the 64th colloquium of the International Astronomical Union. Strasbourg\nFrance July 7-10 1981, Dordrecht, Boston: Kluwer Academic Publishers.\nIde Nancy and Laurent Romary\n2004 International standard for a linguistic annotation\nframework\nNatural Language Engineering 10: 211-225.\nKling Rob and Geoffrey McKim\n1999 Scholarly Communication and the Continuum of\nElectronic Publishing Journal of the American Society for Information Science 50(10): 890906.\nLagoze, Carl and Herbert van de Sompel\nlow-barrier interoperability framework.\non Digital Libraries: 54-62.\n\n2001 The Open Archives Initiative: Building a\nProceedings of the ACM/IEEE Joint Conference\n\nLopez Patrice 2009 GROBID: Combining Automatic Bibliographic Data Recognition and\nTerm Extraction for Scholarship Publications\nResearch and advanced Technology for\nDigital Libraries\nLecture Notes in Computer Science 5714: 473-474, DOI: 10.1007/9783-642-04346-8_62\nLossau Norbert\n2004 Search Engine Technology and Digital Libraries: Libraries\nNeed to Discover the Academic Internet\nD-Lib Magazine 10(6).\nLynch, Clifford A.\n2003 Institutional Repositories: Essential Infrastructure\nScholarship In The Digital Age.\nLibraries and the Academy 3(2): 327-336.\n19\n\nFor\n\n\fMcCabe, Mark J.\n2004 Law serials pricing and mergers: A portfolio approach.\nContributions to Economic Analysis & Policy 3(1).\n\nOchsenbein François, Pierre Fernique, François Bonnarel, Mark Allen, Thomas Boch and\nFrançoise Genova\n2005 Interoperability in Action: the Aladin Experience\nInteroperability in Action: the Aladin Experience XIV 347:193-197.\nPilat Dirk and Yukiko Fukasaku\n2007 OECD Principles and Guidelines for Access to\nResearch Data from Public Funding Data Science Journal 6: OD4-OD11\nPöschl, Ulrich 2004 Interactive journal concept for improved scientific publishing and\nquality assurance.\nLearned\nPublishing\n17:105-113.\nAvailable\nat:\nwww.copernicus.org/EGU/acp/poeschl_learned_publishing_2004.pdf\nRomary, Laurent\n2011 Stabilizing knowledge through standards – A perspective for\nthe humanities.\nKarl Grandin (ed.): Going Digital: Evolutionary and Revolutionary\nAspects of Digitization, Science History Publications. Available at: http://hal.inria.fr/inria00531019\nRomary, Laurent and Chris Armbruster\n2010 Beyond\ninstitutional\nrepositories.\nInternational Journal of Digital Library Systems 1 (1): 44-61. Available at:\nhttp://hal.inria.fr/hal-00399881\nSubramanyam K.\n1983 Bibliometric studies of research collaboration: A review\nJournal of Information Science 6(1): 33-38.\nSale, Arthur H. J.\n\n2007\n\nThe patchwork mandate. D-Lib Magazine 13 (1/2).\n\nSuls, Jerry and René Martin 2009 The Air We Breathe: A Critical Look at Practices and\nAlternatives in the Peer-Review Process. Perspectives on Psychological Science 1:40-50.\nVelterop, Jan 2003 Should scholarly societies embrace open access (or is it the kiss of\ndeath)?\nLearned Publishing 16(3):167-169.\nWilbanks, John, and James Boyle\n2006 Introduction to Science Commons. Science\nCommons.\nhttp://sciencecommons.org/wp‐ content/uploads/ScienceCommons_Concept_Paper.pdf.\nWood, John (ed.)\n2010 Riding the Wave: How Europe can gain from the rising tide of\nscientific data. Report of the High-Level Group on Scientific Data, European Commission,\nOctober 2010. Available at http://cordis.europa.eu/fp7/ict/e-infrastructure/high-levelgroup_en.html\n\n20\n\n\f"}