{"id": "http://arxiv.org/abs/0809.2609v1", "guidislink": true, "updated": "2008-09-15T20:40:50Z", "updated_parsed": [2008, 9, 15, 20, 40, 50, 0, 259, 0], "published": "2008-09-15T20:40:50Z", "published_parsed": [2008, 9, 15, 20, 40, 50, 0, 259, 0], "title": "A Search for the Most Massive Galaxies. III. Global and Central\n  Structure", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0809.0493%2C0809.3376%2C0809.0105%2C0809.3092%2C0809.2391%2C0809.0897%2C0809.3466%2C0809.3242%2C0809.2698%2C0809.4025%2C0809.2105%2C0809.0500%2C0809.2379%2C0809.4655%2C0809.2003%2C0809.3149%2C0809.4292%2C0809.1993%2C0809.2923%2C0809.4631%2C0809.2729%2C0809.1866%2C0809.4200%2C0809.4118%2C0809.2597%2C0809.0239%2C0809.4990%2C0809.3835%2C0809.0484%2C0809.3941%2C0809.2492%2C0809.1813%2C0809.0392%2C0809.0687%2C0809.0471%2C0809.1084%2C0809.2030%2C0809.3323%2C0809.4169%2C0809.3805%2C0809.4879%2C0809.1146%2C0809.1025%2C0809.4886%2C0809.0413%2C0809.4305%2C0809.5070%2C0809.0145%2C0809.2280%2C0809.3482%2C0809.2415%2C0809.2768%2C0809.4457%2C0809.1506%2C0809.0628%2C0809.3553%2C0809.4988%2C0809.0602%2C0809.4464%2C0809.3920%2C0809.0384%2C0809.5282%2C0809.3492%2C0809.2066%2C0809.4281%2C0809.0263%2C0809.1774%2C0809.3334%2C0809.4216%2C0809.2467%2C0809.3533%2C0809.0386%2C0809.2609%2C0809.4306%2C0809.1446%2C0809.1287%2C0809.2139%2C0809.1260%2C0809.3266%2C0809.1996%2C0809.4301%2C0809.3891%2C0809.0178%2C0809.0426%2C0809.2908%2C0809.5001%2C0809.3404%2C0809.4335%2C0809.4948%2C0809.3400%2C0809.1241%2C0809.0468%2C0809.4558%2C0809.4610%2C0809.3023%2C0809.3183%2C0809.1951%2C0809.4290%2C0809.0262%2C0809.2632%2C0809.3474&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "A Search for the Most Massive Galaxies. III. Global and Central\n  Structure"}, "summary": "We used the Advanced Camera for Surveys on board the Hubble Space Telescope\nto obtain high resolution i-band images of the centers of 23 single galaxies,\nwhich were selected because they have SDSS velocity dispersions larger than 350\nkm/s. The surface brightness profiles of the most luminous of these objects\n(M_i<-24) have well-resolved `cores' on scales of 150-1000 pc, and share\nsimilar properties to BCGs. The total luminosity of the galaxy is a better\npredictor of the core size than is the velocity dispersion. The correlations of\nluminosity and velocity dispersion with core size agree with those seen in\nprevious studies of galaxy cores. Because of high velocity dispersions, our\nsample of galaxies can be expected to harbor the most massive black holes, and\nthus have large cores with large amounts of mass ejection. The mass-deficits\ninferred from core-Sersic fits to the surface-brightness profiles are\napproximately double the black-hole masses inferred from the M_bh-sigma\nrelation and the same as those inferred from the M_bh-L relation. The less\nluminous galaxies (M_i>-23) tend to have steeper `power-law' inner profiles,\nhigher-ellipticity, diskier isophotes, and bulge-to-total ratios of order 0.5\n-- all of which suggest that they are `fast-rotators' and rotational motions\ncould have contaminated the velocity dispersion estimate. There are obvious\ndust features within about 300 pc of the center in about 35% of the sample,\npredominantly in power-law rather than core galaxies.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0809.0493%2C0809.3376%2C0809.0105%2C0809.3092%2C0809.2391%2C0809.0897%2C0809.3466%2C0809.3242%2C0809.2698%2C0809.4025%2C0809.2105%2C0809.0500%2C0809.2379%2C0809.4655%2C0809.2003%2C0809.3149%2C0809.4292%2C0809.1993%2C0809.2923%2C0809.4631%2C0809.2729%2C0809.1866%2C0809.4200%2C0809.4118%2C0809.2597%2C0809.0239%2C0809.4990%2C0809.3835%2C0809.0484%2C0809.3941%2C0809.2492%2C0809.1813%2C0809.0392%2C0809.0687%2C0809.0471%2C0809.1084%2C0809.2030%2C0809.3323%2C0809.4169%2C0809.3805%2C0809.4879%2C0809.1146%2C0809.1025%2C0809.4886%2C0809.0413%2C0809.4305%2C0809.5070%2C0809.0145%2C0809.2280%2C0809.3482%2C0809.2415%2C0809.2768%2C0809.4457%2C0809.1506%2C0809.0628%2C0809.3553%2C0809.4988%2C0809.0602%2C0809.4464%2C0809.3920%2C0809.0384%2C0809.5282%2C0809.3492%2C0809.2066%2C0809.4281%2C0809.0263%2C0809.1774%2C0809.3334%2C0809.4216%2C0809.2467%2C0809.3533%2C0809.0386%2C0809.2609%2C0809.4306%2C0809.1446%2C0809.1287%2C0809.2139%2C0809.1260%2C0809.3266%2C0809.1996%2C0809.4301%2C0809.3891%2C0809.0178%2C0809.0426%2C0809.2908%2C0809.5001%2C0809.3404%2C0809.4335%2C0809.4948%2C0809.3400%2C0809.1241%2C0809.0468%2C0809.4558%2C0809.4610%2C0809.3023%2C0809.3183%2C0809.1951%2C0809.4290%2C0809.0262%2C0809.2632%2C0809.3474&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We used the Advanced Camera for Surveys on board the Hubble Space Telescope\nto obtain high resolution i-band images of the centers of 23 single galaxies,\nwhich were selected because they have SDSS velocity dispersions larger than 350\nkm/s. The surface brightness profiles of the most luminous of these objects\n(M_i<-24) have well-resolved `cores' on scales of 150-1000 pc, and share\nsimilar properties to BCGs. The total luminosity of the galaxy is a better\npredictor of the core size than is the velocity dispersion. The correlations of\nluminosity and velocity dispersion with core size agree with those seen in\nprevious studies of galaxy cores. Because of high velocity dispersions, our\nsample of galaxies can be expected to harbor the most massive black holes, and\nthus have large cores with large amounts of mass ejection. The mass-deficits\ninferred from core-Sersic fits to the surface-brightness profiles are\napproximately double the black-hole masses inferred from the M_bh-sigma\nrelation and the same as those inferred from the M_bh-L relation. The less\nluminous galaxies (M_i>-23) tend to have steeper `power-law' inner profiles,\nhigher-ellipticity, diskier isophotes, and bulge-to-total ratios of order 0.5\n-- all of which suggest that they are `fast-rotators' and rotational motions\ncould have contaminated the velocity dispersion estimate. There are obvious\ndust features within about 300 pc of the center in about 35% of the sample,\npredominantly in power-law rather than core galaxies."}, "authors": ["J. B. Hyde", "M. Bernardi", "R. K. Sheth", "R. C. Nichol"], "author_detail": {"name": "R. C. Nichol"}, "author": "R. C. Nichol", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1111/j.1365-2966.2008.13966.x", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0809.2609v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0809.2609v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "27 Pages, 22 Figures, 2 Tables, Accepted for Publication in MNRAS", "arxiv_primary_category": {"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0809.2609v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0809.2609v1", "journal_reference": null, "doi": "10.1111/j.1365-2966.2008.13966.x", "fulltext": "Mon. Not. R. Astron. Soc. 000, 1–14 (0000)\n\nPrinted 27 October 2018\n\n(MN LATEX style file v2.2)\n\narXiv:0809.2609v1 [astro-ph] 15 Sep 2008\n\nA Search for the Most Massive Galaxies. III.\nGlobal and Central Structure\nJ. B. Hyde1, M. Bernardi1, R. K. Sheth1 & R. C. Nichol2\n1 Department of Physics and Astronomy, University of Pennsylvania, 209 South 33rd Str., Philadelphia, PA 19104, USA\n2 Institute of Cosmology and Gravitation, Mercantile House, Hampshire Terrace, Univ. of Portsmouth, Portsmouth, PO1 2EG, UK\n\n27 October 2018\n\nABSTRACT\n\nWe used the Advanced Camera for Surveys on board the Hubble Space Telescope\nto obtain high resolution i-band images of the centers of 23 single galaxies, which\nwere selected because they have SDSS velocity dispersions larger than 350 km s−1 .\nThe surface brightness profiles of the most luminous of these objects (Mi < −24)\nhave well-resolved 'cores' on scales of 150-1000 pc, and share similar properties to\nBCGs. The total luminosity of the galaxy is a better predictor of the core size than\nis the velocity dispersion. The correlations of luminosity and velocity dispersion\nwith core size agree with those seen in previous studies of galaxy cores. Because\nof high velocity dispersions, our sample of galaxies can be expected to harbor the\nmost massive black holes, and thus have large cores with large amounts of mass\nejection. The mass-deficits inferred from core-Sersic fits to the surface-brightness\nprofiles are approximately double the black-hole masses inferred from the M• − σ\nrelation and the same as those inferred from the M• − L relation. The less luminous\ngalaxies (Mi > −23) tend to have steeper 'power-law' inner profiles, higher-ellipticity,\ndiskier isophotes, and bulge-to-total ratios of order 0.5 – all of which suggest that\nthey are 'fast-rotators' and rotational motions could have contaminated the velocity\ndispersion estimate. There are obvious dust features within about 300 pc of the center in about 35% of the sample, predominantly in power-law rather than core galaxies.\nKey words: galaxies: elliptical and lenticular, cD - galaxies: evolution - galaxies:\nkinematics and dynamics - galaxies: structure - galaxies: photometry\n\n1\n\nINTRODUCTION\n\nThis is the third in a series of papers about the galaxies with\nthe highest velocity dispersions (σ > 350 km s−1 ) in the low\nredshift Universe (z < 0.3). Using imaging and spectroscopy\nfrom the Sloan Digital Sky Survey (SDSS) (Abazajian et al.\n2003), Bernardi et al. (2006, hereafter Paper I) constructed\na sample of 70 objects which were likely to be single galaxies\nwith high (> 350 km/s) velocity dispersion. However, in this\nsample there still remained the strong possibility that some\nof these measured velocity dispersions were contaminated\nby the presence of another galaxy along the line of sight. In\na companion to this work, Bernardi et al. (2008, hereafter\nPaper II) resolve this problem with observations which take\nadvantage of the superior angular resolution of the Hubble\nSpace Telescope (HST) to identify superpositions, and exclude them from the sample of true high velocity dispersion\ngalaxies. Of the original sample of 70 objects, HST observed\n43 (as this was a SnapShot program, not all 70 targets were\nobserved), and 23 of these appear to be truly single galaxies.\nPaper II shows that these appear to be of two types:\n\nluminous, round galaxies which share many properties with\nBCGs (e.g., Laine et al. 2003, Bernardi et al. 2007), and\nfainter, higher ellipticity, disky galaxies which point to having over-estimated measured velocity dispersions because of\nrotational velocities. One of the goals of this paper is to see\nif a detailed photometric analysis of the HST data supports\nthose conclusions.\nHowever, our analysis of the HST photometry also allows us to place our sample in the context of other HSTbased studies of early-type galaxies. In particular, the centers of early-type galaxies have been studied extensively with\nHST by the Nuker Team (e.g., Lauer et al. 1995, Faber et\nal. 1997, Laine et al. 2003, Lauer et al. 2005, Lauer et al.\n2007) using WFPC1 and WFPC2, and by the Virgo Cluster\nSurvey (VCS) (e.g., Ferrarese et al. 2006a, Ferrarese et al.\n2006b, Côté et al. 2006) using ACS WFC. Both groups have\nfound that the centers of early-type galaxies can contain\nnuclei (corresponding to a point-like increase in the light\nprofile), follow a single power-law or Sersic (continuously\nchanging power-law) light distribution, or have a break ra-\n\n\f2\n\nHyde et al.\nCombined Stars\n1\nStars\nTinyTim\n\n0.9\n0.8\n0.7\n\nTinyTim PSF\n\nIntensity\n\n0.6\n0.5\n0.4\n0.3\n0.2\n0.1\n0\n0.1\n\nFigure 1. A masked image of SDSS J152332.4+450032.0. The\nmasked regions are shown as the darkest blue, and the log intensity is represented by a color-map from blue to red. The HRC\nocculting finger extends from the bottom of the image towards\nthe galaxy center. The size of the field is 26x29 arcseconds, with\na pixel size of 0.027 arcseconds per pixel.\n\ndius inside of which the surface brightness follows a shallow or flat power law. It has been established that bright\nearly-types have round isophotes and shallow central slopes\nwhile fainter early-types have elongated, disky isophotes and\nsteep central slopes (Ferrarese et al. 1994, Lauer et al. 1995,\nFaber et al. 1997, Ravindranath et al. 2002, Ferrarese et al.\n2006a). There is active debate regarding whether the inner\nlight profile slopes of early-type galaxies form a bimodal distribution of \"cores\" and \"power-law galaxies\" (Lauer et al.\n2007, Rest et al. 2001), or a continuous distribution (Graham et al. 2003, Ferrarese et al. 2006a). But there is general\nagreement that the connection between the properties of the\ncenters of core galaxies and their overall structure can be explained by the presence of a central supermassive black hole\nbinary system. Since there is a correlation between central\nblack hole mass and velocity dispersion (Ferrarese & Merritt\n2000, Gebhardt et al. 2000, Tremaine et al. 2002), our sample of galaxies can be expected to harbor the most massive\nblack holes, and thus have large cores with large amounts of\nmass ejection.\nThis paper is organized as follows. Section 2 describes\nthe observations and pre-processing steps we undertook to\nprepare the images for model-fitting and profile analysis.\nSection 3 presents global properties of these galaxies from\nfitting parametric models to the surface brightness profiles.\nCentral structure and core properties are studied in Sections 4 and 5, and photometric evidence for rotation in some\nof these galaxies is presented in Section 6. Section 7 studies\nthe difference images to see if they show evidence for dust,\nand a final section summarizes our results.\n\n0.2\n\n0.3\n0.4\nR [arcsec]\n\n0.5\n\n0.6\n\nFigure 2. PSF Testing. Top: A stacked image of 8 stars from one\nHRC image. Bottom: An analytical PSF produced by TinyTim.\nRight: Surface brightness profiles of stack (jagged) and TinyTim\nPSF (smooth).\n\n2\n\nOBSERVATIONS AND DATA PROCESSING\n\nThe observations were performed using the High-Resolution\nChannel (HRC) of the Advanced Camera for Surveys (ACS)\nof the Hubble Space Telescope (HST) using the SDSS i band\nfilter. They were obtained as part of a SnapShot program\nduring HST Cycle 13. Each galaxy was observed over 4 exposures of 300 seconds each for a total of 1200 seconds. There\nwere two exposures (for cosmic ray rejection) at each of 2\nline-dither points, spaced by 5 pixels to allow for the exclusion of detector artifacts. The images were flat fielded\nand bias subtracted by the STScI CALACS pipeline. These\ncalibrated images were obtained from the STScI MAST\nArchive. We performed cosmic ray rejection and image combination using MULTIDRIZZLE (Koekemoer et al. 2002).\nExceptions from default MULTIDRIZZLE parameters are\nour use of a Gaussian drizzling kernel which provides good\nPSF preservation in the drizzled image and the ability to\nrepair bad pixels, and cosmic ray signal-to-noise thresholds\n(driz cr snr = [2, 2.5]) which identifies cosmic rays more\neffectively than the default values of [3, 3.5]. All cosmic rays\nare not identified by MULTIDRIZZLE, so we inspected the\nimages and masked the remaining cosmic rays manually. All\npixels which were flagged as bad pixels by CALACS or MULTIDRIZZLE were also excluded from our analysis. The bad\npixel mask is dilated by 20 pixels near the image edges and\nthe HRC occulting finger, since some bad pixels were not\nproperly identified in these areas.\nSince the galaxies take up a significant fraction of the\nHRC field, we disabled the MULTIDRIZZLE sky subtraction option, and performed our own sky subtraction on the\nfinal drizzled image. Background levels were determined and\nsubtracted using a clipped mean in an outer annulus and corners of the images. This method has the drawback that some\nof the galaxy light can be subtracted as background. However the faintness and small angular sizes of these galaxies\ncaused this over-subtraction to not affect the fits. We tested\nthis by estimating the difference in background between the\nSDSS and HST images. We did this by comparing the av-\n\n\fA SEARCH FOR THE MOST MASSIVE GALAXIES. III.\n\n3\n\n−0.2\n\n19\n\n−0.1\n\n8\n\n0\n0.1\n\n12\n15\n17\n1610\n\n0.2\n0.3\n\n4\n\n9\n11 5\n\n17\n\n7\n14\n\n3\n\n13\n\n20\n\n1\n\n23\n\n2118\n6\n2\n\n22\n\n16.5\n16\nmi,HST [mag]\n\n15.5\n\nlog10Re−HST−log10Re−SDSS\n\nmi,HST−mi,SDSS [mag]\n\n0.2\n23\n\n0.1\n17 4\n\n0\n\n12\n\n8\n9 19\n5\n\n11\n\n15 20\n1\n1610\n\n−0.1\n\n7 3\n14\n13\n\n2118\n6\n2\n22\n\n−0.2\n\n17\n\n16.5\n16\nmi,HST [mag]\n\n15.5\n\nFigure 3. Comparison of GALMORPH deVaucouleurs fit parameters for HST and SDSS i band data. Table 1 provides the conversion\nbetween the integer label here and the name of the object.\n\nerage surface brightness at an circular annulus of 10 arcseconds from the galaxy center. The estimated background\ndifference does not correlate with the difference in estimated\ntotal luminosity for data from the two telescopes, so other\neffects must play a more important role (see Section 3).\nNearby source masking was performed with SExtractor (Bertin & Arnouts 1996). We used the pre-convolution\noption to convolve the image with a σ = 3 pixel Gaussian filter before SExtractor generated a segmentation image\nwhich labels each image as belonging to a certain source or\nbackground. We excluded from our analysis all pixels which\nare labeled as belonging to a source other than the galaxy\nwe were studying. We included all other pixels, including\nSExtractor-labeled background pixels, since these contain\nlight from the outer regions of the galaxies we are studying.\nFigure 1 shows a fully processed image of one of our galaxies.\nIt has been flat-fielded, cleaned of cosmic rays, drizzled, and\nmasked. The masked regions are shown as the darkest blue,\nand the log intensity is represented by a color-map from blue\nto red. The HRC occulting finger extends from the bottom\nof the image towards the galaxy center. The size of the field\nis 26 × 29 arcseconds, with a pixel size of 0.027 arcseconds.\nWe modeled the point-spread function (PSF) using\nTinyTim, a program built specifically to generate analytic\nPSFs for HST (Krist and Hook 2004). Figure 2 compares the\nanalytic TinyTim PSF with a composite PSF determined by\nadding up the light of 8 individual stars in one of the images. The images (left) and light profiles (right) show good\nagreement between the measured and analytical PSFs. We\nuse the TinyTim PSFs because stars in our images are too\nfew and too faint to provide a high enough signal-to-noise\nmeasurement of the PSF. However, the TinyTim PSF agrees\nwell for the frames which contain enough stars to allow us\nto compare the model PSF with stars from the image.\n\n3\n\nMODEL FITTING\n\nWe fit parametric models to quantify global properties of\nthe galaxies in our sample: deVaucouleurs (μ ∼ r 1/4 ), Ser-\n\nsic (μ ∼ r 1/n ), and deVaucouleurs+Exponential models\n(μ ∼ −2.5 log[fB I1/4 + (1 − fB ) I1 ], where I1/n is the Sersic surface brightness profile in flux units, and fB is the\nfraction of the total light which is in the deVaucouleurs\nbulge component). The deVaucouleurs model was used to\ncompare sizes and luminosites with SDSS early-type galaxies in Paper II. The Sersic model allows for greater freedom in the scaling of surface brightness with radius (see,\ne.g., for a review of this model Graham & Driver 2005).\nThe deVaucouleurs+Exponential model can be used to describe bulge-disk systems with an inner bulge which follows\na deVaucouleurs-type profile and an outer disk which follows\nan exponential profile. In Section 6 we use this model as a\ntest for evidence of a disk component.\nWe fit each of the models to each galaxy using software\ndeveloped by us, which we call GALMORPH. It performs\ntwo-dimensional χ2 minimization, using simulated annealing\nas the search algorithm. We convolve each model with the\nPSF before computing χ2 . Because the centers of some of\nthe galaxies deviate from the models due to core effects at\nradii less than 1 kpc, we masked out the centers of galaxies\nclassified as cores in Section 4.1. We masked all pixels which\nare closer to the galaxy center than the core-Sersic model\nbreak radius (see Section 4.2). The bottom-left panels in\nFigures A1–A13 show these masked regions. (We study the\ncentral parts of the profiles in Section 4, where we show the\nresults based on a deconvolution method.)\nOne-dimensional profiles and residuals of the fits are\nshown for each galaxy in Figures A1–A13, in the topleft and central-left panels. These profiles are averaged using elliptical annuli following the mean ellipticity of the\ngalaxy. The radius shown is the geometric mean of the\nsemimajor and semiminor axes and the radius increases linearly. In the top-left panel, surface brightness profiles are\nshown in blue for the data (dots), in green for the deVaucouleurs model (thicker line), in red for the Sersic model\n(middle thick line), and in black (thinner line) for the deVaucouleurs+Exponential model. The bulge component is\nshown with a black dotted line, and the disk component is\n\n\f4\n\nHyde et al.\n\nshown with a dashed black line. The residuals are defined as\ndata−model.\nIn Paper II, we used the sizes, luminosities, and ellipticities obtained from our GALMORPH model-fits to SDSS rband data. This was done in order to fairly compare with the\nproperties of other SDSS-observed galaxies. In Figure 3, we\ncompare the deVaucouleurs fit parameters of SDSS and HST\ndata, both in the i-band. Despite different telescopes and observing conditions, the measured properties agree well. The\nHST magnitudes are somewhat fainter, and there is 0.1 dex\nscatter in Re with no systematic offset. Many effects contribute to these differences. The HRC has a smaller field of\nview (∼ 30 arcseconds), We use different masks because of\nthe ability of HST to resolve cores (see Section 4), although\nthe effect of masking on total magnitude is minimal since\nthe magnitude offset for cores and power-law galaxies is similar. Our tests also indicated that differences in background\nsubtraction do not correlate with the magnitude difference.\nCalibration problems are also a possibility, since there is an\noffset in magnitude, but not in size. In any case, the level of\nscatter and offset present does not substantially change any\nof the trends examined in this paper or Paper II.\nFigure 4 compares Sersic, deVaucouleurs, and bulgedisk model parameters. The left panels show the differences\nin Re and apparent magnitude for Sersic and deVaucouleurs\nmodels as a function of nS . Near nS = 4, where the models\nare identical, they agree well. However, at high Sersic index,\nnS > 6, the Sersic radii are larger by more than 0.4 dex and\nthe magnitudes are brighter by 0.5 mags. The right panels\ncompare deVaucouleurs-only and bulge radii and apparent\nmagnitudes as a function of bulge fraction, B/T . For purebulge (B/T = 1) galaxies, they agree very well. Galaxies\nwith lower bulge fractions have bulge radii that are smaller,\nand bulge apparent magnitudes that are fainter than the\ndeVaucouleurs-only quantities. Which of these models is the\n\"correct\" one for estimating the luminosity and size of the\ngalaxies? For that purpose, the deVaucouleurs model provides a middle ground between the Sersic model which fits\nall of the light of a possible two-component system, and the\nbulge-component of a deVaucouleurs+exponential model,\nwhich only fits only the inner bulge. The bottom-left panel\nshows that the galaxies with high Sersic indices (nS > 6) are\nthe same ones which have a significant disk fraction. This\nsuggests that, to fit both the bulge and disk components,\nthe Sersic index values are forced artificially high, resulting\nin overestimates of the total magnitude and effective radius.\nThe opposite scenario is also a possibility, that the galaxy\ntruly follows an nS > 6 profile; such values have been observed by Graham et al. (1996) for BCGs. In that case, by\nchoosing nS = 4 profile for the bulge and an nS = 1 profile for the disk, we are biasing the measurement of B/T .\nHowever, the explanation that the bulge-disk measurements\nare correct, and the high nS fits are artificially high agrees\nbetter in the context of luminosity, ellipticity, a4, and core\nproperties (see Section 6). Note that, with one exception, we\nfind that the half-light radii of bulges are smaller than the\ndisk effective radii.\n\n4\n\nWe now classify the centers of the high velocity dispersion\ngalaxies into two categories: cores and power-laws. The ACS\nHRC pixel size is 0.025 arcseconds and the PSF FWHM\nis 0.085 arcseconds, meaning that the spatial resolution is\nlimited to angular scales larger than 0.035 arcseconds. This\nlimiting size corresponds to an average of 125 pc for the\ngalaxies on our sample; we are unable to observe cores with\na break radius less than a few hundred pc.\nOur methodology for studying the centers of these\ngalaxies, given the limited physical resolution of our observations (compared to, e.g., the VCS and Nuker studies) is\nto use the inner profile slope as a heuristic for indicating the\npresence of a core, similarly to the procedure of Byun et al.\n(1996). One important exception is that our classification\nmethod relies on the profile slope measured from the data,\nnot from a parametric model. The Nuker team (Byun et al.)\nuses the profile slope measured from the Nuker profile fit\nto the data. This method has been challenged recently by\nGraham et al. (2003), and Ferrarese et al. (2006a, 2006b),\nwho argue that it is preferable to classify cores based on\na light deficit when compared to a global Sersic model fit.\nThey use a reduced chi-squared comparison of Sersic and\ncore-Sersic fits to determine the presence of cores. We prefer\nto classify these galaxies in a model-independent manner,\nobtaining the profile slope directly from the light profile at\na fixed angular radius. We discuss the effect of this choice at\nthe end of Section 4.2. As with any method, we cannot determine if there are cores which are smaller than our angular\nresolution.\n\n4.1\n\nCore - Power-Law Classification\n\nThe procedure we use for classifying core galaxies is to deconvolve the image, obtain the surface brightness profile,\nand measure the logarithmic intensity slope (γ ′ ) at the resolution limit. We then apply a simple threshold based on the\nslope to classify glaxies as \"cores\" or \"power-law\" galaxies,\nkeeping in mind that \"power-law\" galaxies are really galaxies without resolved cores.\nTo limit the effects of the PSF on the determination of γ ′ , we use the MATLAB1 implementation of\nthe Lucy-Richardson deconvolution algorithm (Richardson\n1972, Lucy 1974). We allow 20 iterations of the algorithm\nwith damping. This damping reduces the effect of the deonvolution algorithm \"shredding\" the image by deconvolving\nthe image beyond the noise limit. Figures A1–A13 show the\ncentral 100 pixel box of the deconvolved images. At radii\ngreater than 1 arcsecond the images are not deconvolved,\nsince PSF effects are not important there.\nWe measure the surface brightness profile of the galaxies\nusing the STSDAS2 task ELLIPSE for IRAF, allowing for\nchanges in ellipticity, position angle, and centroid position.\nThe profiles we obtain are spaced logarithmically, and shown\nin Figures A1–A13, top-right panels, as surface brightness\nvs. semimajor axis of the isophotal ellipse. We measure γ ′ ,\n\n1\n\nTable 1 lists the fit parameters for each galaxy for each\nof the models described here.\n\nGALAXY CENTERS\n\nhttp://www.mathworks.com/access/helpdesk/\n...help/toolbox/images/deconvlucy.html\n2 http://stsdas.stsci.edu/cgi-bin/gethelp.cgi?ellipse\n\n\fr\n\n10 e−DeV\n\n0\n\n− log\nlog\n\n−0.2\n−0.4\n\n0.2\n\n2\n\n4\n\n6\n\n−0.2\n−0.4\n\n8\n\n0\n\n0.2\n\n0.4\n\n0.6\nB/T\n\n0.8\n\n1\n\n0\n\n0.2\n\n0.4\n\n0.6\nB/T\n\n0.8\n\n1\n\nnS\n\n[mag]\n\n−1\n\ni,DeV\n\n−0.5\n\n−m\n\n−0.5\n\n0\n\n0\n\nm\n\nm\n\ni,Bulge\n\n−m\n\ni,DeV\n\n[mag]\n\n−1\n\ni,Ser\n\n5\n\nr\n\n− log\n\n0.2\n\nr\nlog\n\n0.4\n\n10 Bulge\n\n0\n\nr\n\n10 e−DeV\n\n0.4\n\n10 e−Ser\n\nA SEARCH FOR THE MOST MASSIVE GALAXIES. III.\n\n0.5\n\n0.5\n2\n\n4\n\n6\n\n8\n\nnS\n\n1\n\nB/T\n\n0.8\n0.6\n0.4\n0.2\n0\n\n2\n\n4\n\n6\n\n8\n\nnS\nFigure 4. Comparison of parameters derived from deVaucouleurs, Sersic, and deVaucouleurs+Exponential model-fits. Circles and triangles represent core and power-law galaxies respectively. Top-Left: DeVaucouleurs and Sersic radii are compared with the Sersic index.\nTop-Right: DeVaucouleurs and bulge radii are compared with bulge fraction. Middle-Left: DeVaucouleurs and Sersic magnitudes are\ncompared with Sersic index. Middle-Right: DeVaucouleurs and bulge magnitudes are compared with bulge fraction. Bottom: Bulge\nfraction vs. Sersic index. (See discussion in Section 4.1.)\n\n\f6\n\nHyde et al.\n−26\n\n4\n\n−22\n\n3\n\n−20\n\nN\n\nμ [mag/arcsec2]\n\n−24\n\n−18\n\n2\n\n−16\n\n1\n−14\n−12\n−2\n10\n\n0\n\n10\nR [kpc]\n\n2\n\n10\n\n0\n0.1\n\n0.15\n\n0.2\n\n0.25\n\n0.3\n\n0.35\n\nz\n\nFigure 5. Left: Solid lines show surface brightness profiles of core galaxies. Dashed lines show the same for power-law galaxies. Right:\nRedshift distributions of cores and power-law galaxies.\n\nthe logarithmic slope of the intensity profile at 0.05 arcseconds, from a cubic spline interpolation of the galaxy's\nisophotal surface brightness profile. Galaxies are classified\nas cores if γ ′ < 0.5 and as power-laws if γ ′ > 0.5. We do\nnot use an \"intermediate\" classification for 0.3 < γ ′ < 0.5,\nbecause of the resolution issue. Table 1 lists the value of γ ′\nfor each galaxy. Our decision to not use an \"intermediate\"\nclassification, results in some objects which might better be\nclassified as power-laws than cores, and vice-versa. For example, objects 2 and 22 are significantly less luminous, and\nhave substantially smaller B/T fractions than the other objects we call cores.\nFigure 5 shows a comparison of the (k-corrected and\nreddening corrected) profiles we classify as cores (solid) and\npower-laws (dashed). (Figures A1–A13 show more detailed\ncomparisons of the fits to each profile.) In general, the core\ngalaxies are brighter at larger radius (and in total luminosity) and fainter in the central few hundred parsecs. The\nbottom panel shows the distribution of redshift for cores and\npower-law galaxies. The fact that the higher-redshift galaxies are classified as cores is explained by the larger search\nvolume at higher redshift. In searching for the highest velocity dispersion galaxies, the most luminous galaxies were\nonly found at higher redshift. Also the fact that the cores\nwere found at higher redshift demonstrates that our \"cores\"\nare not simply due to PSF effects. PSF effects would produce the opposite distribution of redshifts, since physical\nresolution degrades with redshift.\n\n4.2\n\nCentral Profile Modeling\n\nIn this section we only consider the galaxies classified by\ntheir profile slopes as cores. We fit models to the core galaxies to determine the sizes of the cores. Related to the debate\nof bimodality vs. unimodality of the inner profile slope distribution is the question of which model best describes galaxies\nwith cores. The VCS and Nuker groups both classify \"core\"\nvs. \"non-core\" based on some property of a model-fit to the\ninner profiles. The Nuker group measures the slope of the\nNuker model, while the VCS group uses the discrepancy with\n\nSersic models as the criterion for cores (following Graham\net al. 2003). Our classification method does not depend on\nmodel choice, so we use the models simply as a measurement\ntool to determine the properties (particularly the break radius) of the cores. Thus, the choice of model for the central\ncore-galaxy profiles does not change our conclusions.\nThe two standard models for core galaxies are the Nuker\nProfile (Lauer et al. 1995) and the core-Sersic model (Graham et al. 2003, Trujillo et al. 2004). The Nuker profile consists of inner and outer power-laws transitioning at a break\nradius. The transition is either sharp or smooth, depending\non a parameter, α. The Nuker profile is\n„ «γ »\n„ «α –(γ−β)/α\nRb\nr\nI(r) = 2(β−γ)/α Ib\n1+\n,\n(1)\nr\nRb\n(Lauer et al. 2005), where γ is the inner slope, β is the\nouter slope, α is the break softening parameter, Rb is the\nbreak radius, and Ib is the intensity at the break radius.\nThe core-Sersic model of Graham et al. (2003) replaces the\nouter power-law with a Sersic profile, and the simplification\nused by Trujillo et al. (2004) and the VCS group have a\nsharp transition between the inner power-law and the outer\nSersic profile, giving the following form:\n»\n\"\n\"\nI(r) = Ib (Rb /r)γ u(Rb − r) + exp bn (Rb /Re )1/n\n–\n\"\n\"\n× exp −bn (r/Re )1/n u(r − Rb )\n(2)\nwhere u(x) is the Heaviside step function, Re is the Sersic\nhalf-light radius, n is the Sersic index, and bn ≈ 1.992n −\n0.3271 for 1 < n < 10.\nWe fit both of these models to the logarithmically\nspaced surface brightness profiles, restricting the fit to semimajor axis length 0.035′′ < a < 10′′ . In choosing the\nbest set of parameters for each model, we minimize χ2 =\nP\n(μi − μf it,i )2 , weighting each point equally in the μ, log r\n- space. This equal weighting choice allows the inner pixels\nto influence the fit more, which is appropriate for core-fitting\n(Byun et al. 1996, Ferrarese et al. 2006a). The χ2 minimization is conducted using simulated annealing. The best-fit\n\n\fA SEARCH FOR THE MOST MASSIVE GALAXIES. III.\n\n0\n\n0\n\n10\nR [kpc]\n\n−1\n\nb\n\nRb [kpc]\n\n10\n\n10\n\n−22\n\n−23\n\n−24\nMi [mag]\n\n−25\n\n10\n\n−26\n\n0\n\n2.3\n\n2.4\n2.5\n−1\nlog10 σ [km s ]\n\n2.6\n\n2.7\n\n2.3\n\n2.4\n2.5\n−1\nlog10 σ [km s ]\n\n2.6\n\n2.7\n\n10\nR [kpc]\n\n−1\n\nγ\n\nRγ [kpc]\n\n2.2\n\n0\n\n10\n\n10\n\n−1\n\n10\n\n−2\n\n−2\n\n10\n−21\n\n−1\n\n10\n\n−2\n\n−2\n\n10\n−21\n\n7\n\n−22\n\n−23\n\n−24\nMi [mag]\n\n−25\n\n−26\n\n10\n\n2.2\n\nFigure 6. Break radii of the galaxies classified as cores. Open circles show Nuker radii and stars show core-Sersic radii. Crosses represent\nthe core galaxies from Faber et al. (1997) and points are for BCGs from Laine et al. (2003). Upper-limit symbols are shown for our\npower-law galaxies.\n\nNuker (thin black) and core-Sersic (thick red) profiles are\nshown in the top-right panels of Figures A1–A13; middle\npanels show the residuals from these fits; vertical dashed\nlines show the break radii. Table 2 lists the best-fit Nuker\nand core-Sersic parameters for each core galaxy.\nFigure 6 shows how the break radii of the core galaxies\nin our sample scale with total luminosity and velocity dispersion. The top panels use Rb as the measure of the core\nradius, and the bottom panels use the related quantity,\n„ ′\n«1/α\nγ −γ\nRγ ≡ Rb\n,\n(3)\nβ − γ′\n\nour sample has a small range of σ but spans a large range in\ncore radius. In this respect, the luminosity is a better predictor of core radius than is velocity dispersion, a point that\nwas recently made by Lauer et al. (2007). For the power-law\ngalaxies we show upper limits for the break radii in the upper panels of Figure 6. For upper limits, we use the radius\n(0.05 arcseconds) at which we classified our sample based on\nthe intensity profile slope converted to a physical radius in\nkpc. The cores of these galaxies, if they exist, are small for\ntheir velocity dispersions, but not necessarily small for their\nluminosities.\n\nwhich is expected to show slightly tighter correlations (Carollo et al. 1997, Lauer et al. 2007). In all panels, circles and\nstars show Nuker and core-Sersic parameters for our sample.\nFor comparison, crosses represent core galaxies from Faber\net al. (1997), and dots show the BCGs studied by Laine et\nal. (2003). Our sample is similar to the BCG sample, having\nslightly larger luminosities for given core radius. Laine et\nal. (2003) attributed this to the possibility that BCGs add\nstars through accretion at large radii, which increase their\nluminosity, but do not affect their core properties. This similarity with BCGs reinforces our findings in Paper II that\nthe brighter galaxies in our sample have similar parameter\nscaling relations to BCGs. It is also interesting to note that\n\nRevisiting the choice to classify core and power-law\ngalaxies based on a direct measurement of their inner profile slope, we also used the Graham et al. (2003) chi-squared\ncriterion and the Nuker law slope to classify the galaxies\nfor comparison. Using the core-Sersic vs. Sersic chi-squared\ncomparison resulted in more galaxies being classified as\n'cores' (19 instead of 16). However, the same trends were\npresent, but with larger scatter due to the possible introduction of false 'cores'. Using the Nuker law slope, and including\nan 'intermediate' classification, we obtained fewer cores (5)\nthan we found with our method (13). However, they still\nfollowed the same trends among luminosity, core-size, and\nshape.\n\n\f8\n5\n\nHyde et al.\nCORE-SCOURING AND MASS DEFICITS\n\nGiven strong evidence for the presence of supermassive black\nholes in galaxies (e.g., the review by Ferrarese & Ford 2005),\nand a formation mechanism for massive ellipticals (such as\nour sample of cores) involving heirarchical merging of galaxies (e.g., De Lucia et al. 2006), it is likely that the central\nblack holes of progenitor galaxies both fall to the center of\na newly formed merger remnant. The behavior of a binary\nsystem of black holes can be used to explain the presence of\ngalaxy cores (Makino & Ebisuzaki 1996, Faber et al. 1997,\nQuinlan & Hernquist 1997, Milosavljević & Merritt 2001,\nMilosavljević et al. 2002, Ravindranath et al. 2002, Graham\n2004, Ferrarese et al. 2006a). The process is simulated using\nN-body codes by Milosavljević & Merritt (2001), who describe a binary system of black holes undergoing a randomwalk through the central region of a galaxy, ejecting stars\nthrough 3-body interactions.\nMilosavljević et al. (2002) argue that the ejected mass of\nstars should be of order twice the mass of the final black hole,\nand that each subsequent major merger will eject this mass\nof stars. They estimate the relationship between ejected\nmass and black hole mass for a sample of core galaxies presented by Rest et al. (2001), and find rough agreement with\ntheir predictions. Their estimates of the ejected mass depend on a fiducial choice of the pre-ejection density slope\nwhich they vary from 1.5 - 2 (isothermal). Graham (2004)\nestimates the ejected mass using a core-Sersic model fit to\nthe centers of galaxies. This method takes the outer Sersic\nprofile, extrapolated inward to the center of the galaxy, and\ncompares it with the actual inner profile, thus removing the\nchoice of a fiducial initial profile slope. Using core galaxies\npresented by Trujillo et al. (2004), Graham finds that the\nmeasured mass deficits are greater than black hole masses by\na factor of 2.4 ± 1.1 for black hole masses inferred from the\nM• − σ relation. Ferrarese et al. (2006a) follow the analysis\nof Graham (2004) and find Mej /M• = 2.4 ± 1.8.\n5.1\n\nMeasuring the Mass Deficit\n\nWe follow Graham (2004) and Ferrarese et al. (2006a) in\nusing the core-Sersic model to determine the ejected stellar mass from the centers of our core galaxies. The method\ninvolves measuring the mass deficit, which is equal to the\ndifference between the inwardly extrapolated outer Sersic\nprofile and the inner power-law, integrated from the galaxy\ncenter to the break radius. The details are presented by Graham (2004). The expression for the light deficit is as follows:\nZ Rb\nISersic − Ipower−law\nLdef =\n0\n„\n«\nRb2 Ib\n= 2π Ie Re2 nebn b−2n\nγ\n[2n,\nb\n(R\n/R\n)]\n(4)\nn\ne\nb\nn\n2−γ\nwhere γ[a, b] is the lower incomple gamma function and Re is\nthe half-light radius of the Sersic model. The light deficit is\ntransformed into an absolute luminosity in solar units using\nMi,⊙ = 4.52 mags, and into a mass deficit using M/L = 3\n(Worthey 1994). Figure 7 shows the mass deficit vs. the\nblack hole mass, inferred from log M• = 8.21+3.83 log σ/200\n(Tundo et al. 2007). Small dots show our sample of cores,\nand black crosses show the results presented by Graham\n(2004). The mean and error-on-the-mean values of Mdef /M•\n\nfor our sample are 2.28 ± 0.67. These values agree with the\nfindings of Graham (2004) and Ferrarese et al. (2006a) mentioned above. They are consistent with the predictions of\nMilosavljević et al. (2002) for the galaxies having undergone approximately one major merger since they last had\nan intact power-law center. Since luminosity may be a better predictor of core properties, we also show for comparison\nour measured mass deficits vs. the black hole mass, inferred\nfrom log M• = 8.68 − 1.3/2.5(Mr + 22) (Tundo et al. 2007)\nas open circles. Luminosity predicts a much higher M• , giving Mdef /M• = 1.24 ± 0.30. This lower value isn't directly\ncomparable to Graham (2004) and Ferrarese et al. (2006a)\nwho used velocity dispersion to determine black hole masses,\nbut indicates less stellar mass ejection by the most massive\nblack holes.\n\n6\n\nEVIDENCE FOR ROTATION\n\nIn this section we present photometric evidence for rotation\nin the lower-luminosity galaxies in our sample. This evidence\nconsists of high ellipticity, disky isophotes, and disk presence\nin bulge-disk fitting.\nWe measured the fourth-order term in a Fourier cosine series expansion of the surface brightness along elliptical isophotes, as measured by STSDAS task ELLIPSE for\nIRAF, following the method of Jedrzejewski (1987). This\nparameter, a4, indicates disky (positive) or boxy (negative)\ndeviations from purely elliptical isophotes. We use the luminosity weighted average value of a4 at radii 0.6 < r/Re < 1.4\nas an effective value. We then normalize it by the length a of\nthe best-fitting ellipse semimajor axis and multiply by 100.\nThus, a4/a = 3 means that the semimajor axis is 3 percent\nlonger than that of the best-fitting ellipse. Table 1 lists a4/a\nfor each galaxy.\nRotational velocity, a4, and ellipticity, ǫ are known to\nbe correlated (e.g., Kormendy & Bender 1996, Emsellem\net al. 2007). Rotating galaxies tend to have ǫ > 0.2 and\na range of a4/a values that include both boxy and disky\ngalaxies, whereas non-rotating galaxies have |a4/a| < 1%.\nFigure 8, top right panel, shows a4/a vs. ellipticity for our\nsample. The distribution of a4/a for the galaxies with ǫ >\n0.2 is consistent with the population of \"fast-rotators\" of\nEmsellem et al. (2007). Similarly, the low a4/a values for\nǫ < 0.3 are consistent with their slow-rotators (see their\nFigure 6). The galaxies from our sample which have a similar\ndistribution on the ǫ - a4/a plane as fast-rotators are the\nlower luminosity (Mi > −23.5), power-law galaxies. This\nis shown in the left panels of Figure 8. Furthermore, the\nbottom panels show that the lower luminosity galaxies have\nlower bulge fractions (B/T < 0.75) as computed from bulgedisk decomposition (Section 3).\nThus, although spatially resolved spectroscopic data is\nnot available to directly measure the velocity profiles of these\ngalaxies, the photometric properties strongly suggest that\nthe lower luminosity galaxies of our sample are fast-rotators.\nThey have high ellipticity isophotes with positive a4/a values; the two-dimensional bulge-disk decompositions of the\nsurface brightness profiles show evidence for disks, and they\nhave power-law central light profiles. In Paper II, we show\nthat these same galaxies lie well-off the luminosity-density\nscaling relations defined by the bulk of the early-type pop-\n\n\fA SEARCH FOR THE MOST MASSIVE GALAXIES. III.\n\n9\n\nlog Mdef [Msun]\n\n11\n\n10\n\n9\n\n8\n\n7\n\n7\n\n8\n\n9\nlog M• [Msun]\n\n10\n\n11\n\n−25\n\n5\n\n−24.5\n\n4\n\n−24\n\n3\na4/a [%]\n\nMi [mag]\n\nFigure 7. Mass deficit computed from core-Sersic modeling, compared with black-hole mass inferred from σ2 . Our galaxies (points) are\ncompared with those of Graham (2004) (crosses). The M• for our galaxies inferred from luminosity are shown as circles.\n\n−23.5\n−23\n\n2\n1\n0\n\n−22.5\n−1\n\n−22\n0.2\n\n0.4\n\nε\n\n0.6\n\n0.8\n\n−2\n\n1\n\n−25\n\n−24.5\n\n−24.5\n\n−24\n\n−24\n\nM [mag]\n\n−25\n\n0\n\n0.2\n\n0.4\n\n0\n\n0.2\n\n0.4\n\nε\n\n0.6\n\n0.8\n\n1\n\n−23.5\n\ni\n\n−23.5\n\ni\n\nM [mag]\n\n0\n\n−23\n−22.5\n\n−22.5\n\n−22\n−2\n\n−23\n\n−22\n0\n\n2\na4/a [%]\n\n4\n\n0.6\nB/T\n\n0.8\n\n1\n\nFigure 8. Correlations of ellipticity, ǫ, fourth-order Fourier coefficient, a4/a, and bugle fraction, B/T with Luminosity, Mi (taken from\nthe deVaucouleur fits to the HST data. Core galaxies are indicated with circles, power-law galaxies with triangles (Section 4.1).\n\n\f10\n\nHyde et al.\n\nulation, a discrepancy which would be alleviated if the reported velocity dispersions were indeed contaminated by rotation.\n\n7\n\nEVIDENCE FOR DUST\n\nThree objects, about 15% of the sample, show obvious dust\nfeatures (Figures A12 and A13). However, recent HST work\nsuggests that the fraction of early-types with dust which\nis evident in the I-band may be as high as 50% (Laine\net al. 2003, Lauer et al. 2005). To explore this further, we\nhave made difference images by subtracting our best-fitting\nBulge-Disk models from the observations. Figure 9 shows 8\nobjects which show evidence for dust; the three objects in\nthe topmost panels are those for which the dust was visible\neven without subtraction (objects 9, 11 and 17). Of these,\nonly 2 are cores (objects numbered 14 and 22), the rest are\npower-laws (and recall that object 22 is abnormally faint,\nand has a substantial large-scale disk component, for a core).\n\n8\n\nSUMMARY\n\nWe presented our methodology for obtaining parameters\nwhich describe the global and inner structure of high velocity dispersion galaxies (σ > 350 km s−1 ). We performed\nmodel-fits to obtain effective radii, luminosities, eliipticities,\nbulge fractions, and Sersic indices which describe the global\nstructure of the galaxies. We showed that the deVaucouleurs\nquantities obtained from HST imaging agreed with the SDSS\nvalues from which we drew the scaling relations presented in\nPaper II (Figure 3). We studied the galaxies' isophotal deviations from true ellipticity using the a4 parameter. This parameter, in combination with the bulge-disk decompositions,\nellipticity, and inner profile shape, established the fainter\ngalaxies in our sample as almost certainly fast-rotating ellipticals (Section 6), meaning that our measured velocity\ndispersions are likely to be over-estimates.\nWe also studied the central profile shapes of the galaxies, fitting core-Sersic and Nuker models to the surface\nbrightness profiles to estimate core radii (Section 4). The\nlocation of the most luminous of our core-galaxies on the\nluminosity−core-size plane (Figure 6) coincides with that of\nBCGs of Laine et al. (2003). This adds further evidence to\nthe argument presented in Paper II, that the brighter galaxies in our sample are BCGs - although they are amongst\nthe densest BCGs for their luminosities.\nThese objects are interesting for the following reason:\nwhen half-light radius is plotted vs luminosity, BCGs are\nknown to have larger radii than the bulk of the early-type\ngalaxy population (Lauer et al. 2007, Bernardi et al. 2007),\nand this has been used to argue for merger-dominated formation histories. That they also have core-profiles, and that\nthe cores have smaller radii (than expected by extrapolating the core-L relation of the bulk of the population to large\nL) suggests that these objects indeed had formation histories with substantial merger/accretion activity. The fact\nthat they do not have power-law profiles suggests that in\nsitu star formation is unlikely to be the primary reason for\ntheir large central densities. Either these objects had dense\n\ncores around which more stars have since built up, or mergers and accretion events have driven the dense stellar cores\nof smaller galaxies into the center, erasing a cusp (if there\nwas one).\nSuch objects are expected to host massive black holes\nwhich may have consumed or ejected substantial amounts\nof mass from the center. The mass deficit associated with\nextrapolating the outer Sersic fit inwards, and subtracting\nthe light in the actual best-fit core-Sersic were found to be\non average, twice as much as M• estimated from the M• − σ\nrelation, and equal to M• estimated from the M• −L relation\n(Figure 7) in agreement with previous work (e.g., Graham\n2004, Ferrarese et al. 2006a).\nCimatti et al. (2008) studied a sample of superdense\nz∼1.5 passive galaxies. They found, when comparing with\nour sample of high-velocity dispersion galaxies (their figure\n19), that the lower-luminosity galaxies in our sample populate a similar locus in the size, mass, surface density plane as\ntheir superdense z∼1.5 passive galaxies. Although rotation\nmay somewhat complicate the picture, it is possible that our\nlow-redshift high-density galaxies are the rare examples of\nthe high-redshift superdense galaxies which have not undergone any dry merging. This scenario is supported by the fact\nthat the low luminosity galaxies in our sample are in lowdensity environments (Paper II) and have intact power-law\ncenters. It would be interesting to check if the superdense\nz∼1.5 galaxies are 'fast-rotators' as well.\nFinally we found that 35% of the objects in this sample\n(8/23) had nuclear dust, with the majority of these being\npower-law rather than core galaxies. This also agrees well\nwith previous work (e.g. Laine et al. 2003; Lauer et al. 2005).\n\n9\n\nACKNOWLEDGEMENTS\n\nWe thank K. Gebhardt for his role in initiating this project,\nand N. Roche for helpful discussions.\nWe thank the HST support staff during Cycles 13 and\n14 during which the SNAP-10199 and SNAP-10488 programs were carried out. Support for programs SNAP-10199\nand SNAP-10488 was provided through a grant from the\nSpace Telescope Science Institute, which is operated by the\nAssociation of Universities for Research in Astronomy, Inc.,\nunder NASA contract NAS5-26555. J.B.H. was sponsored\nin part by a Zaccaeus Daniels fellowship. M.B. and J.B.H.\nare grateful for additional support provided by NASA grant\nLTSA-NNG06GC19G.\nFunding for the Sloan Digital Sky Survey (SDSS) and\nSDSS-II has been provided by the Alfred P. Sloan Foundation, the Participating Institutions, the National Science\nFoundation, the U.S. Department of Energy, the National\nAeronautics and Space Administration, the Japanese Monbukagakusho, and the Max Planck Society, and the Higher\nEducation Funding Council for England. The SDSS Web site\nis http://www.sdss.org/.\nThe SDSS is managed by the Astrophysical Research\nConsortium (ARC) for the Participating Institutions. The\nParticipating Institutions are the American Museum of\nNatural History, Astrophysical Institute Potsdam, University of Basel, University of Cambridge, Case Western Reserve University, The University of Chicago, Drexel University, Fermilab, the Institute for Advanced Study, the Japan\n\n\f11\n\nA SEARCH FOR THE MOST MASSIVE GALAXIES. III.\nSDSS J112842.0+043221.7\n\nSDSS J103344.2+043143.5\n\nSDSS J082216.5+481519.1\n0.8\n\n0.4\n\n0.7\n0.3\n0.6\n\n0.3\n0.5\n\n0.2\n\n0.4\n\n0.2\n\n0.3\n\n0.1\n\n0.2\n\n0.1\n0\n\n0.1\n\n0\n\n0\n−0.1\n−0.1\n\n−0.1\n−0.2\n−0.2\nSDSS J211019.2+095047.1\n\nSDSS J151741.7−004217.6\n\nSDSS J082646.7+495211.5\n1.2\n\n2.5\n0.06\n\n1\n2\n0.04\n\n0.8\n1.5\n0.6\n\n0.02\n1\n\n0.4\n\n0.5\n\n0.2\n\n0\n\n−0.02\n\n0\n\n0\n\n−0.2\n−0.04\n\n−0.5\n−0.4\n\nSDSS J133724.7+033656.5\n\nSDSS J155944.2+005236.8\n0.4\n0.25\n0.35\n0.3\n\n0.2\n\n0.25\n\n0.15\n\n0.2\n\n0.1\n\n0.15\n\n0.05\n\n0.1\n0\n0.05\n−0.05\n0\n−0.05\n−0.1\n\n−0.1\n−0.15\n\nFigure 9. Difference between data and the Bulge-Disk model for objects which appear to have dust; most of these are power-law rather\nthan core galaxies.\n\nParticipation Group, The Johns Hopkins University, the\nJoint Institute for Nuclear Astrophysics, the Kavli Institute for Particle Astrophysics and Cosmology, the Korean\nScientist Group, the Chinese Academy of Sciences (LAMOST), Los Alamos National Laboratory, the Max-PlanckInstitute for Astronomy (MPIA), the Max-Planck-Institute\nfor Astrophysics (MPA), New Mexico State University, Ohio\nState University, University of Pittsburgh, University of\nPortsmouth, Princeton University, the United States Naval\nObservatory, and the University of Washington.\n\n\fTable 1. Structural Parameters for all Galaxies. Columns: (1) our index, referred to in figure 3; (2) SDSS Galaxy Name;\n(3-5) deVaucouleurs luminosity, radius, and ellipticity for HST i data; (6-8) deVaucouleurs luminosity, radius, and ellipticity\nfor SDSS i data; (9-11) Sersic luminosity, radius, and Sersic index for HST data; (12-15) luminosity, bulge-to-total ratio,\nbulge radius, and disk radius for composite deVaucouleurs bulge+exponential disk model; (16) fourth-order\nFourier-cosine-series coefficient; (17) profile slope measured at resolution limit; (18) presence of dust.\n#\n\nName\n\nL-D\n[mag]\n\nR-D\n[kpc]\n\nǫ-D\n\nL-D-sd\n[mag]\n\nR-D-sd\n[kpc]\n\nǫ-D-sd\n\nL-S\n[mag]\n\nR-S\n[kpc]\n\nn-S\n\nL-C\n[mag]\n\nBT-C\n\nR-B-2C\n[kpc]\n\nR-D-C\n[kpc]\n\na4/a\n[pct]\n\nγ′\n\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n13\n14\n15\n16\n17\n18\n19\n20\n21\n22\n23\n\nJ013431.5+131436.4\nJ162332.4+450032.0\nJ010803.2+151333.6\nJ083445.2+355142.0\nJ091944.2+562201.1\nJ155944.2+005236.8\nJ135602.4+021044.6\nJ141341.4+033104.3\nJ112842.0+043221.7\nJ093124.4+574926.6\nJ103344.2+043143.5\nJ221414.3+131703.7\nJ120011.1+680924.8\nJ211019.2+095047.1\nJ160239.1+022110.0\nJ111525.7+024033.9\nJ082216.5+481519.1\nJ124609.4+515021.6\nJ151741.7-004217.6\nJ082646.7+495211.5\nJ171328.4+274336.6\nJ133724.7+033656.5\nJ104056.4-010358.7\n\n-23.506\n-23.378\n-23.892\n-24.400\n-24.406\n-23.816\n-24.766\n-24.016\n-23.468\n-23.260\n-22.773\n-22.402\n-24.470\n-24.237\n-23.264\n-23.785\n-21.871\n-24.377\n-22.319\n-22.607\n-24.597\n-22.804\n-24.926\n\n8.474\n6.145\n12.837\n20.226\n16.904\n6.532\n26.145\n11.978\n7.676\n3.892\n5.267\n2.242\n16.151\n10.906\n5.069\n7.411\n2.158\n12.861\n1.771\n2.627\n11.241\n2.849\n29.351\n\n0.066\n0.288\n0.176\n0.127\n0.182\n0.182\n0.194\n0.208\n0.424\n0.324\n0.421\n0.424\n0.323\n0.138\n0.364\n0.250\n0.422\n0.091\n0.404\n0.431\n0.098\n0.310\n0.180\n\n-23.729\n-23.645\n-23.919\n-24.422\n-24.444\n-24.054\n-24.742\n-23.918\n-23.472\n-23.419\n-22.828\n-22.444\n-24.571\n-24.254\n-23.354\n-23.947\n-21.967\n-24.531\n-22.122\n-22.734\n-24.738\n-23.076\n-24.731\n\n9.822\n8.110\n11.608\n17.686\n17.016\n8.347\n23.504\n10.072\n6.933\n4.620\n5.404\n2.185\n17.046\n10.543\n5.631\n8.827\n1.868\n14.605\n1.625\n2.938\n12.983\n4.035\n20.701\n\n0.211\n0.255\n0.191\n0.211\n0.162\n0.250\n0.271\n0.202\n0.404\n0.266\n0.439\n0.510\n0.351\n0.188\n0.351\n0.324\n0.604\n0.153\n0.406\n0.405\n0.075\n0.278\n0.217\n\n-23.988\n-23.991\n-23.790\n-24.427\n-24.279\n-23.965\n-24.464\n-23.919\n-23.620\n-23.281\n-22.885\n-22.744\n-24.501\n-24.481\n-23.517\n-24.344\n-22.385\n-24.595\n-22.561\n-22.968\n-25.148\n-23.385\n-24.491\n\n19.031\n18.775\n10.923\n21.228\n13.907\n8.295\n16.345\n10.228\n9.999\n4.053\n6.360\n4.562\n17.004\n16.622\n7.723\n18.976\n5.579\n18.487\n4.143\n4.882\n29.410\n8.089\n15.150\n\n5.698\n7.326\n3.690\n4.107\n3.366\n4.491\n2.921\n3.628\n4.675\n4.234\n4.401\n6.591\n4.136\n5.194\n4.986\n5.988\n6.573\n4.825\n7.349\n5.491\n6.422\n6.738\n2.756\n\n-23.521\n-23.725\n-23.892\n-24.236\n-24.406\n-24.290\n-24.552\n-24.059\n-23.517\n-23.543\n-22.829\n-22.864\n-24.325\n-24.294\n-23.690\n-24.027\n-21.944\n-24.337\n-22.406\n-23.314\n-24.831\n-23.372\n-24.926\n\n0.491\n0.525\n1.000\n0.771\n1.000\n0.626\n0.816\n1.000\n0.924\n0.549\n0.923\n0.651\n0.715\n1.000\n0.615\n0.548\n0.807\n0.651\n0.608\n0.566\n0.565\n0.560\n1.000\n\n4.392\n4.079\n12.837\n14.344\n16.902\n6.373\n19.550\n11.966\n7.466\n2.285\n5.099\n2.243\n10.351\n10.813\n4.695\n5.069\n1.914\n8.294\n1.323\n2.937\n7.671\n2.681\n29.347\n\n9.052\n15.176\n14.043\n10.187\n22.232\n30.817\n13.744\n0.000\n7.557\n12.867\n15.140\n27.468\n13.442\n0.000\n30.593\n13.959\n4.086\n12.991\n5.573\n191.213\n18.670\n22.623\n18.756\n\n-0.141\n0.116\n0.948\n-0.233\n0.088\n0.250\n0.946\n0.234\n0.680\n-0.189\n4.245\n2.707\n-1.040\n-1.052\n0.260\n1.522\n1.165\n0.518\n3.969\n0.219\n0.114\n-0.281\n-0.487\n\n0.541\n0.355\n0.233\n0.064\n0.324\n0.408\n0.397\n-0.088\n0.473\n0.519\n0.796\n1.088\n0.325\n0.172\n0.606\n0.756\n0.935\n0.209\n1.095\n1.142\n0.043\n0.373\n0.123\n\ndust\n0\n0\n0\n0\n0\n0\n0\n0\n1\n0\n1\n0\n0\n0\n0\n0\n1\n0\n0\n0\n0\n0\n0\n\n\fA SEARCH FOR THE MOST MASSIVE GALAXIES. III.\n\n13\n\nTable 2. Core Properties of Core-Galaxies without Dust. Columns: (1) Our index; (2-6) Nuker fit parameters from Equation 1: break\nradius, surface brightness, softening, outer-slope, and inner-slope; (7-11) Core-Sersic parameters from Equation 2: break radius, effective\nradius, surface brightness, Sersic index, and inner slope.\n\n#\n\nRb-nuker\n[kpc]\n\nIb-nuker\n[cps./⊓\n⊔\"]\n\nα-nuker\n\nβ-nuker\n\nγ-nuker\n\nRb-cs\n[kpc]\n\nRe-cs\n[kpc]\n\nIb-cs\n[cps./⊓\n⊔\"]\n\nn-cs\n\nγ-cs\n\n2\n3\n4\n5\n6\n7\n8\n13\n14\n18\n21\n22\n23\n\n0.440\n0.422\n0.391\n1.574\n0.183\n2.189\n0.969\n1.231\n0.698\n0.425\n0.435\n0.180\n0.519\n\n1516.277\n989.083\n549.897\n252.715\n3032.524\n176.964\n479.923\n416.483\n770.682\n1171.637\n1493.564\n5460.503\n509.911\n\n1.370\n0.168\n0.432\n1.432\n1.094\n1.243\n0.479\n1.479\n1.149\n0.727\n1.420\n0.215\n0.192\n\n1.745\n4.781\n2.299\n1.473\n1.612\n1.805\n2.645\n1.591\n1.740\n1.728\n1.624\n3.782\n4.261\n\n-0.129\n-3.329\n-1.193\n0.272\n-0.640\n0.080\n-0.810\n0.039\n-0.129\n-0.184\n-0.432\n-2.000\n-3.405\n\n0.477\n0.194\n0.495\n1.541\n0.313\n0.953\n0.444\n0.842\n0.633\n0.439\n0.580\n0.162\n0.387\n\n30.762\n11.824\n25.355\n210.988\n60.235\n21.191\n13.350\n32.487\n32.637\n45.885\n75.845\n6.404\n19.928\n\n1600.401\n1702.965\n529.850\n284.066\n2402.664\n353.896\n939.961\n603.008\n936.065\n1242.578\n1372.296\n6722.203\n593.638\n\n9.393\n3.807\n4.856\n8.613\n9.850\n3.489\n3.962\n4.994\n6.838\n6.833\n10.000\n5.852\n2.966\n\n0.409\n0.158\n0.285\n0.502\n0.351\n0.258\n0.323\n0.251\n0.349\n0.508\n0.318\n0.350\n0.144\n\n\f14\n\nHyde et al.\n\nREFERENCES\nAbazajian K., et al. 2003, AJ, 126, 2081\nBernardi, M., et al. 2006, AJ, 131, 2018\nBernardi, M., Hyde, J. B., Sheth, R. K., Miller, C. J., & Nichol,\nR. C. 2007, AJ, 133, 1741\nBernardi, M., Fritz, A., Hyde, J. B., Sheth, R. K., Gebhardt, K.,\n& Nichol, R. C. 2008, MNRAS submitted\nBertin, E., & Arnouts, S. 1996, AAPS, 117, 393\nByun, Y.-I., et al. 1996, AJ, 111, 1889\nCarollo, C. M., Danziger, I. J., Rich, R. M., & Chen, X. 1997,\nApJ, 491, 545\nCôté, P., et al. 2006, ApJS, 165, 57\nCimatti, A., et al. 2008, A&A, 482, 21\nDe Lucia, G., Springel, V., White, S. D. M., Croton, D. & Kauffmann, G. 2006, MNRAS, 366, 499\nEmsellem, E., et al. 2007, MNRAS, 379, 401\nFaber, S. M., et al. 1997, AJ, 114, 1771\nFerrarese, L., van den Bosch, F. C., Ford, H. C., Jaffe, W., &\nO'Connell, R. W. 1994, AJ, 108, 1598\nFerrarese, L., & Merritt, D. 2000, ApJL, 539, L9\nFerrarese, L., et al. 2006, ApJS, 164, 334\nFerrarese, L., & Ford, H. 2005, Space Science Reviews, 116, 523\nFerrarese, L., Cote, P., Blakeslee, J. P., Mei, S., Merritt,\nD., & West, M. J. 2006, ArXiv Astrophysics e-prints,\narXiv:astro-ph/0612139\nGraham, A., Lauer, T. R., Colless, M., & Postman, M. 1996, ApJ,\n465, 534\nGebhardt, K., et al. 2000, ApJL, 539, L13\nGraham, A. W., Erwin, P., Trujillo, I., & Asensio Ramos, A. 2003,\nAJ, 125, 2951\nGraham, A. W. 2004, ApJL, 613, L33\nGraham, A. W., & Driver, S. P. 2005, Publications of the Astronomical Society of Australia, 22, 118\nKoekemoer, A. M., Fruchter, A. S., Hook, R. N., & Hack, W. 2002\nHST Calibration Workshop\nJedrzejewski, R. I. 1987, MNRAS, 226, 747\nKormendy, J., & Bender, R. 1996, ApJL, 464, L119\nKrist, J. and Hook, R. 2004, The Tiny Tim User's Guide,\nwww.stsci.edu/software/tinytim/tinytim.pdf\nLaine, S., van der Marel, R. P., Lauer, T. R., Postman, M., O'Dea,\nC. P., & Owen, F. N. 2003, AJ, 125, 478\nLauer, T. R., et al. 1995, AJ, 110, 2622\nLauer, T. R., et al. 2005, AJ, 129, 2138\nLauer, T. R., et al. 2007, ApJ, 664, 226\nLucy, L. B. 1974, AJ, 79, 745\nMakino, J., & Ebisuzaki, T. 1996, ApJ, 465, 527\nMilosavljević, M., & Merritt, D. 2001, ApJ, 563, 34\nMilosavljević, M., Merritt, D., Rest, A., & van den Bosch, F. C.\n2002, MNRAS, 331, L51\nNakano, T., & Makino, J. 1999, ApJ, 510, 155\nQuinlan, G. D., & Hernquist, L. 1997, New Astronomy, 2, 533\nRavindranath, S., Ho, L. C., Peng, C. Y., Filippenko, A. V., &\nSargent, W. L. W. 2001, AJ, 122, 653\nRavindranath, S., Ho, L. C., & Filippenko, A. V. 2002, ApJ, 566,\n801\nRichardson, W.H., J. Opt. Soc. Am. 62, 55\nRest, A., van den Bosch, F. C., Jaffe, W., Tran, H., Tsvetanov,\nZ., Ford, H. C., Davies, J., & Schafer, J. 2001, AJ, 121, 2431\nTremaine, S., et al. 2002, ApJ, 574, 740\nTrujillo, I., Erwin, P., Asensio Ramos, A., & Graham, A. W. 2004,\nAJ, 127, 1917\nTundo, E., Bernardi, M., Hyde, J. B., Sheth, R. K., & Pizzella,\nA. 2007, ApJ, 663, 53\nWorthey, G. 1994, ApJS, 95, 107\n\nAPPENDIX A: PLOTS OF EACH GALAXY\n\n\fA SEARCH FOR THE MOST MASSIVE GALAXIES. III.\nr [kpc]\n\nμ\n\na [kpc]\n\n20\n\n30\n\n0.1\n\n1\n\n10\n15\n\n#2 SDSS J162332.4+450032.0\n\nγ'=0.355\n\n20\n\n20\n\n25\n\n25\n\n−0.5\n∆μ\n\nμ\n\n10\n15\n\n15\n\n−0.5\n\n0\n\n0\n\n0.5\n\n0.5\n\n1\n\n2\n\n3\n\n4 5\narcsec\n\n6\n\n7\n\n0.5\n\n1\n\n1.5\narcsec\n\n2\n\nFigure A1. Core Galaxies: Top Left: Blue points show surface brightness profiles with linear radial spacing. Radius shown is geometric\nmean of ellipse axes (0\" < r < 10\"). Green line shows deVaucouleurs fit. Red line shows Sersic Fit. Black solid line shows deVaucouleurs\n(dotted black) + Exponential (dashed black) fit. Middle Left: Data - Fit Residuals. Bottom Left Masked image with colormap and\nisophotes spaced logarithmically in intensity. Masked pixels are shown in dark blue. Bottom Right: Central region of deconvolved data\nwith colormap spaced linearly. Width and length of box are 2.5 arcseconds. Top Right: Deconvolved central profile with logarithmic\nradial spacing. Radius shown is semimajor axis (0.01\" < a < 10\"). Nuker and core-Sersic models are shown in black and red with break\nradii shown as vertical dashed lines. γ ′ is the logarithmic slope of the intensity profile at a = 0.05 arcseconds. Physical scale is shown on\nupper axes. Surface brightness, μ, is in units of [mag/arcsec2 ].\n\n\fHyde et al.\nr [kpc]\n\na [kpc]\n0.1\n\n1\n\n10\n15\n\nγ'=0.233\n\n20\n\n20\n\n25\n\n25\n\n∆μ\n\n−0.5\n\n−0.5\n\n0\n\n0\n\n0.5\n\n0.5\n\n1\n\n2\n\n3\n\n4 5\narcsec\n\n6\n\n7\n\n0.5\n\n1\n\nr [kpc]\n10\n\nμ\n\n15\n\n20\n\n1.5\narcsec\n\n2\n\na [kpc]\n30\n\n40\n\n0.1\n\n1\n\n10\n15\n\n#4 SDSS J083445.2+355142.0\n\n20\n\n20\n\nγ'=0.0641\n\n25\n\nμ\n\nμ\n\n20\n\n#3 SDSS J010803.2+151333.6\n\nμ\n\n10\n15\n\n25\n\n−0.5\n∆μ\n\n16\n\n−0.5\n\n0\n\n0\n\n0.5\n\n0.5\n\n1\n\n2\n\n3\n\n4 5\narcsec\n\n6\n\n7\n\n0.5\n\n1\n\n1.5\narcsec\n\n2\n\nFigure A2. Core Galaxies: Format same as previous figure.\n\n\fA SEARCH FOR THE MOST MASSIVE GALAXIES. III.\nr [kpc]\n30\n\n40\n\n0.1\n\n1\n\n10\n15\n\n20\n\n20\n\nγ'=0.324\n\n25\n\n25\n\n∆μ\n\n−0.5\n\n−0.5\n\n0\n\n0\n\n0.5\n\n0.5\n\n1\n\n2\n\n3\n\n4 5\narcsec\n\n6\n\n7\n\n0.5\n\n1\n\nr [kpc]\n10\n\nμ\n\n15\n\n1.5\narcsec\n\n2\n\na [kpc]\n\n20\n\n30\n\n0.1\n\n1\n\n10\n15\n\n#6 SDSS J155944.2+005236.8\n\nγ'=0.408\n\n20\n\n20\n\n25\n\n25\n\n−0.5\n∆μ\n\nμ\n\nμ\n\n20\n\n#5 SDSS J091944.2+562201.1\n\nμ\n\n10\n15\n\na [kpc]\n\n−0.5\n\n0\n\n0\n\n0.5\n\n0.5\n\n1\n\n2\n\n3\n\n4 5\narcsec\n\n6\n\n7\n\n0.5\n\n1\n\n1.5\narcsec\n\n2\n\nFigure A3. Core Galaxies: Format same as previous figure.\n\n17\n\n\fHyde et al.\nr [kpc]\n30\n\n40 0.1\n\n1\n\n10\n15\n\n#7 SDSS J135602.4+021044.6\n\n20\n\n20\n\nγ'=0.397\n\n25\n\n25\n\n∆μ\n\n−0.5\n\n−0.5\n\n0\n\n0\n\n0.5\n\n0.5\n\n1\n\n2\n\n3\n\n4 5\narcsec\n\n6\n\n7\n\n0.5\n\n1\n\nr [kpc]\n10\n\nμ\n\n15\n\n20\n\n1.5\narcsec\n\n2\n\na [kpc]\n30\n\n0.1\n\n1\n\n10\n15\n\n#8 SDSS J141341.4+033104.3\n\nγ'=−0.0876\n\n20\n\n20\n\n25\n\nμ\n\nμ\n\n20\n\na [kpc]\n\nμ\n\n10\n15\n\n25\n\n−0.5\n∆μ\n\n18\n\n−0.5\n\n0\n\n0\n\n0.5\n\n0.5\n\n1\n\n2\n\n3\n\n4 5\narcsec\n\n6\n\n7\n\n0.5\n\n1\n\n1.5\narcsec\n\n2\n\nFigure A4. Core Galaxies: Format same as previous figure.\n\n\fA SEARCH FOR THE MOST MASSIVE GALAXIES. III.\nr [kpc]\n30\n\n40 0.1\n\n1\n\n10\n15\n\nγ'=0.325\n\n20\n\n20\n\n25\n\n25\n\n∆μ\n\n−0.5\n\n−0.5\n\n0\n\n0\n\n0.5\n\n0.5\n\n1\n\n2\n\n3\n\n4 5\narcsec\n\n6\n\n7\n\n0.5\n\n1\n\nr [kpc]\n10\n\nμ\n\n15\n\n1.5\narcsec\n\n2\n\na [kpc]\n\n20\n\n30\n\n0.1\n\n1\n\n10\n15\n\n#14 SDSS J211019.2+095047.1\n\nγ'=0.172\n\n20\n\n20\n\n25\n\n25\n\n−0.5\n∆μ\n\nμ\n\nμ\n\n20\n\n#13 SDSS J120011.1+680924.8\n\nμ\n\n10\n15\n\na [kpc]\n\n−0.5\n\n0\n\n0\n\n0.5\n\n0.5\n\n1\n\n2\n\n3\n\n4 5\narcsec\n\n6\n\n7\n\n0.5\n\n1\n\n1.5\narcsec\n\n2\n\nFigure A5. Core Galaxies: Format same as previous figure.\n\n19\n\n\fHyde et al.\nr [kpc]\n20\n\n30\n\n40\n\n0.1\n\n1\n\n10\n15\n\n#18 SDSS J124609.4+515021.6\n\nγ'=0.209\n\n20\n\n20\n\n25\n\n25\n\n∆μ\n\n−0.5\n\n−0.5\n\n0\n\n0\n\n0.5\n\n0.5\n\n1\n\n2\n\n3\n\n4 5\narcsec\n\n6\n\n7\n\n0.5\n\n1\n\nr [kpc]\n10\n\nμ\n\n15\n\n20\n\n1.5\narcsec\n\n2\n\na [kpc]\n30\n\n40\n\n0.1\n\n1\n\n10\n15\n\n#21 SDSS J171328.4+274336.6\n\nγ'=0.0427\n\n20\n\n20\n\n25\n\nμ\n\nμ\n\na [kpc]\n\nμ\n\n10\n15\n\n25\n\n−0.5\n∆μ\n\n20\n\n−0.5\n\n0\n\n0\n\n0.5\n\n0.5\n\n1\n\n2\n\n3\n\n4 5\narcsec\n\n6\n\n7\n\n0.5\n\n1\n\n1.5\narcsec\n\n2\n\nFigure A6. Core Galaxies: Format same as previous figure.\n\n\fA SEARCH FOR THE MOST MASSIVE GALAXIES. III.\nr [kpc]\n\na [kpc]\n\n10\n15\n\n20\n\n0.1\n\n1\n\n10\n15\n\n#22 SDSS J133724.7+033656.5\n\n20\n\n25\n\n25\n\n∆μ\n\n−0.5\n\n−0.5\n\n0\n\n0\n\n0.5\n\n0.5\n\n1\n\n2\n\n3\n\n4 5\narcsec\n\n6\n\n7\n\n0.5\n\n1\n\nr [kpc]\n10\n\nμ\n\n15\n\n20\n\n1.5\narcsec\n\n2\n\na [kpc]\n30\n\n0.1\n\n1\n\n10\n15\n\n#23 SDSS J104056.4−010358.7\n\n20\n\n20\n\nγ'=0.123\n\n25\n\n25\n\n−0.5\n∆μ\n\nμ\n\n20\n\nμ\n\nμ\n\nγ'=0.373\n\n−0.5\n\n0\n\n0\n\n0.5\n\n0.5\n\n1\n\n2\n\n3\n\n4 5\narcsec\n\n6\n\n7\n\n0.5\n\n1\n\n1.5\narcsec\n\n2\n\nFigure A7. Core Galaxies: Format same as previous figure.\n\n21\n\n\fHyde et al.\nr [kpc]\n10\n15\n\n20\n\na [kpc]\n30\n\n0.1\n\n1\n\n10\n\n#1 SDSS J013431.5+131436.4\n\n14\n\nμ\n\n16\n20\n\n18\nγ'=0.541\n\n20\n\n25\n\n22\n\n∆μ\n\n−0.5\n0\n\n24\n\n0.5\n\n26\n\n1\n\n2\n\n3\n\n4 5\narcsec\n\n6\n\n7\n\n0.5\n\n1\n\nr [kpc]\n10\n15\n\n1.5\narcsec\n\n2\n\na [kpc]\n\n20\n\n30\n\n0.1\n\n1\n\n10\n\n#10 SDSS J093124.4+574926.6\n\n14\n\nμ\n\n16\n20\n\n18\n\nγ'=0.519\n\n20\n\n25\n\n22\n\n−0.5\n∆μ\n\n22\n\n0\n\n24\n\n0.5\n\n26\n\n1\n\n2\n\n3\n\n4 5\narcsec\n\n6\n\n7\n\n0.5\n\n1\n\n1.5\narcsec\n\n2\n\nFigure A8. Power Law Galaxies: Format same as previous figure.\n\n\fA SEARCH FOR THE MOST MASSIVE GALAXIES. III.\nr [kpc]\n10\n15\n\na [kpc]\n20\n\n0.1\n\n1\n\n10\n\n#12 SDSS J221414.3+131703.7\n\n14\n\nμ\n\n16\n20\n\nγ'=1.09\n\n18\n20\n\n25\n\n22\n\n∆μ\n\n−0.5\n0\n\n24\n\n0.5\n\n26\n\n1\n\n2\n\n3\n\n4 5\narcsec\n\n6\n\n7\n\n0.5\n\n1\n\nr [kpc]\n10\n15\n\n1.5\narcsec\n\n2\n\na [kpc]\n\n20\n\n30\n\n0.1\n\n1\n\n10\n\n#15 SDSS J160239.1+022110.0\n\n14\n\nμ\n\n16\n20\n\n18\n\nγ'=0.606\n\n20\n\n25\n\n22\n\n∆μ\n\n−0.5\n0\n\n24\n\n0.5\n\n26\n\n1\n\n2\n\n3\n\n4 5\narcsec\n\n6\n\n7\n\n0.5\n\n1\n\n1.5\narcsec\n\n2\n\nFigure A9. Power Law Galaxies: Format same as previous figure.\n\n23\n\n\fHyde et al.\nr [kpc]\n10\n15\n\n20\n\na [kpc]\n30\n\n40\n\n0.1\n\n1\n\n10\n\n14\n\n#16 SDSS J111525.7+024033.9\n\nμ\n\n16\n20\n\n18\nγ'=0.756\n\n20\n\n25\n\n22\n\n∆μ\n\n−0.5\n0\n\n24\n\n0.5\n\n26\n\n1\n\n2\n\n3\n\n4 5\narcsec\n\n6\n\n7\n\n0.5\n\n1\n\nr [kpc]\n\n1.5\narcsec\n\n2\n\na [kpc]\n\n10\n15\n\n20\n\n0.1\n\n1\n\n10\n\n#19 SDSS J151741.7−004217.6\n\n14\n\nμ\n\n16\nγ'=1.1\n\n20\n\n18\n20\n\n25\n\n22\n\n−0.5\n∆μ\n\n24\n\n0\n\n24\n\n0.5\n\n26\n\n1\n\n2\n\n3\n\n4 5\narcsec\n\n6\n\n7\n\n0.5\n\n1\n\n1.5\narcsec\n\n2\n\nFigure A10. Power Law Galaxies: Format same as previous figure.\n\n\fA SEARCH FOR THE MOST MASSIVE GALAXIES. III.\nr [kpc]\n10\n15\n\na [kpc]\n20\n\n0.1\n\n1\n\n10\n\n#20 SDSS J082646.7+495211.5\n\n14\n\nμ\n\n16\n20\n\nγ'=1.14\n\n18\n20\n\n25\n\n22\n\n∆μ\n\n−0.5\n0\n\n24\n\n0.5\n\n26\n\n1\n\n2\n\n3\n\n4 5\narcsec\n\n6\n\n7\n\n0.5\n\n1\n\n1.5\narcsec\n\n2\n\nFigure A11. Power Law Galaxies: Format same as previous figure.\n\n25\n\n\fHyde et al.\nr [kpc]\n10\n15\n\na [kpc]\n\n20\n\n30\n\n0.1\n\n1\n\n10\n15\n\n#9 SDSS J112842.0+043221.7\n\n20\n\n20\n\n25\n\n25\n\n∆μ\n\n−0.5\n\nμ\n\nμ\n\nγ'=0.473\n\n−0.5\n\n0\n\n0\n\n0.5\n\n0.5\n\n1\n\n2\n\n3\n\n4 5\narcsec\n\n6\n\n7\n\n0.5\n\n1\n\n1.5\narcsec\n\nr [kpc]\n10\n15\n\n2\n\na [kpc]\n20\n\n0.1\n\n1\n\n10\n\n#11 SDSS J103344.2+043143.5\n\n14\n\nμ\n\n16\n20\n\n18\n\nγ'=0.796\n\n20\n\n25\n\n22\n\n−0.5\n∆μ\n\n26\n\n0\n\n24\n\n0.5\n\n26\n\n1\n\n2\n\n3\n\n4 5\narcsec\n\n6\n\n7\n\n0.5\n\n1\n\n1.5\narcsec\n\n2\n\nFigure A12. Dust-Contaminated Galaxies: Format same as previous figure.\n\n\fA SEARCH FOR THE MOST MASSIVE GALAXIES. III.\nr [kpc]\n\na [kpc]\n\n10\n15\n\n20\n\n0.1\n\n1\n\n10\n\n#17 SDSS J082216.5+481519.1\n\n14\n\nμ\n\n16\n20\n\nγ'=0.935\n\n18\n20\n\n25\n\n22\n\n∆μ\n\n−0.5\n0\n\n24\n\n0.5\n\n26\n\n1\n\n2\n\n3\n\n4 5\narcsec\n\n6\n\n7\n\n0.5\n\n1\n\n1.5\narcsec\n\n2\n\nFigure A13. Dust-Contaminated Galaxies: Format same as previous figure.\n\n27\n\n\f"}