{"id": "http://arxiv.org/abs/0711.2728v2", "guidislink": true, "updated": "2008-04-02T10:35:47Z", "updated_parsed": [2008, 4, 2, 10, 35, 47, 2, 93, 0], "published": "2007-11-18T09:16:04Z", "published_parsed": [2007, 11, 18, 9, 16, 4, 6, 322, 0], "title": "Left-Right Symmetric Model of Neutrino Dark Energy", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0711.1244%2C0711.2304%2C0711.4368%2C0711.3899%2C0711.1307%2C0711.4531%2C0711.1046%2C0711.4802%2C0711.2146%2C0711.3476%2C0711.4889%2C0711.2766%2C0711.0540%2C0711.4138%2C0711.2498%2C0711.2549%2C0711.0052%2C0711.2476%2C0711.0139%2C0711.3902%2C0711.3627%2C0711.3754%2C0711.1882%2C0711.3453%2C0711.4186%2C0711.3405%2C0711.0760%2C0711.1730%2C0711.4107%2C0711.1602%2C0711.0422%2C0711.3167%2C0711.1480%2C0711.2010%2C0711.3917%2C0711.0806%2C0711.1585%2C0711.4084%2C0711.2428%2C0711.2037%2C0711.5002%2C0711.0423%2C0711.0715%2C0711.2160%2C0711.2930%2C0711.3061%2C0711.0189%2C0711.4208%2C0711.0732%2C0711.3761%2C0711.2307%2C0711.0381%2C0711.3594%2C0711.1497%2C0711.0001%2C0711.1671%2C0711.4630%2C0711.3067%2C0711.2946%2C0711.2038%2C0711.4443%2C0711.4558%2C0711.1321%2C0711.4360%2C0711.3909%2C0711.2370%2C0711.0039%2C0711.1807%2C0711.2452%2C0711.3844%2C0711.2763%2C0711.3898%2C0711.2271%2C0711.1781%2C0711.4312%2C0711.1797%2C0711.3397%2C0711.1351%2C0711.3528%2C0711.0127%2C0711.0916%2C0711.2730%2C0711.2728%2C0711.4787%2C0711.2661%2C0711.1338%2C0711.3656%2C0711.3243%2C0711.0382%2C0711.4494%2C0711.0609%2C0711.3976%2C0711.2244%2C0711.1567%2C0711.1039%2C0711.0628%2C0711.2566%2C0711.0826%2C0711.1454%2C0711.4824%2C0711.4622&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Left-Right Symmetric Model of Neutrino Dark Energy"}, "summary": "We implemented the neutrino dark energy proposal in a left-right symmetric\nmodel. Unlike earlier models of mass varying neutrinos, in the present model\nthe mass parameter that depends on the scalar field (acceleron) remains very\nlight naturally. The required neutrino masses then predicts the U(1)_R breaking\nscale to be in the TeV range, providing new signals for LHC. Compared to all\nother neutrino dark energy proposals, this model has the added advantage that\nit can also be embedded into a grand unified theory. In this scenario\nleptogenesis occurs through decays of scalars at very high energy.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0711.1244%2C0711.2304%2C0711.4368%2C0711.3899%2C0711.1307%2C0711.4531%2C0711.1046%2C0711.4802%2C0711.2146%2C0711.3476%2C0711.4889%2C0711.2766%2C0711.0540%2C0711.4138%2C0711.2498%2C0711.2549%2C0711.0052%2C0711.2476%2C0711.0139%2C0711.3902%2C0711.3627%2C0711.3754%2C0711.1882%2C0711.3453%2C0711.4186%2C0711.3405%2C0711.0760%2C0711.1730%2C0711.4107%2C0711.1602%2C0711.0422%2C0711.3167%2C0711.1480%2C0711.2010%2C0711.3917%2C0711.0806%2C0711.1585%2C0711.4084%2C0711.2428%2C0711.2037%2C0711.5002%2C0711.0423%2C0711.0715%2C0711.2160%2C0711.2930%2C0711.3061%2C0711.0189%2C0711.4208%2C0711.0732%2C0711.3761%2C0711.2307%2C0711.0381%2C0711.3594%2C0711.1497%2C0711.0001%2C0711.1671%2C0711.4630%2C0711.3067%2C0711.2946%2C0711.2038%2C0711.4443%2C0711.4558%2C0711.1321%2C0711.4360%2C0711.3909%2C0711.2370%2C0711.0039%2C0711.1807%2C0711.2452%2C0711.3844%2C0711.2763%2C0711.3898%2C0711.2271%2C0711.1781%2C0711.4312%2C0711.1797%2C0711.3397%2C0711.1351%2C0711.3528%2C0711.0127%2C0711.0916%2C0711.2730%2C0711.2728%2C0711.4787%2C0711.2661%2C0711.1338%2C0711.3656%2C0711.3243%2C0711.0382%2C0711.4494%2C0711.0609%2C0711.3976%2C0711.2244%2C0711.1567%2C0711.1039%2C0711.0628%2C0711.2566%2C0711.0826%2C0711.1454%2C0711.4824%2C0711.4622&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We implemented the neutrino dark energy proposal in a left-right symmetric\nmodel. Unlike earlier models of mass varying neutrinos, in the present model\nthe mass parameter that depends on the scalar field (acceleron) remains very\nlight naturally. The required neutrino masses then predicts the U(1)_R breaking\nscale to be in the TeV range, providing new signals for LHC. Compared to all\nother neutrino dark energy proposals, this model has the added advantage that\nit can also be embedded into a grand unified theory. In this scenario\nleptogenesis occurs through decays of scalars at very high energy."}, "authors": ["Jitesh R. Bhatt", "Pei-Hong Gu", "Utpal Sarkar", "Santosh K. Singh"], "author_detail": {"name": "Santosh K. Singh"}, "author": "Santosh K. Singh", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1016/j.physletb.2008.03.059", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0711.2728v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0711.2728v2", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "4 pages. Revised version. Accepted by PLB", "arxiv_primary_category": {"term": "hep-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "hep-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0711.2728v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0711.2728v2", "journal_reference": "Phys.Lett.B663:83-85,2008", "doi": "10.1016/j.physletb.2008.03.059", "fulltext": "Left-Right Symmetric Model of Neutrino Dark Energy\nJitesh R. Bhatt1 ,∗ Pei-Hong Gu2 ,† Utpal Sarkar1 ,‡ and Santosh K. Singh1§\n2\n\n1\nPhysical Research Laboratory, Ahmedabad 380009, India\nThe Abdus Salam International Centre for Theoretical Physics, Strada Costiera 11, 34014 Trieste, Italy\n\narXiv:0711.2728v2 [hep-ph] 2 Apr 2008\n\nWe implemented the neutrino dark energy (νDE) proposal in a left-right symmetric model. Unlike\nearlier models of mass varying neutrinos, in the present model the mass parameter that depends on\nthe scalar field (acceleron) remains very light naturally. The required neutrino masses then predicts\nthe U (1)R breaking scale to be in the TeV range, providing new signals for LHC. Compared to all\nother νDE proposals, this model has the added advantage that it can also be embedded into a grand\nunified theory. In this scenario leptogenesis occurs through decays of scalars at very high energy.\n\nPresent observations reveal that the dark energy ∼\n(3 × 10−3 eV)4 [1] contributes about 70% to the total density of our universe. Since the only known physics around\nthis scale is the neutrino mass, there are now attempts\nto relate the origin of the dark energy with the neutrino\nmasses [2, 3, 4]. This connection is based on the idea\nof quintessence [5], and have several interesting consequences [6, 7].\nIn the original model of neutrino dark energy (νDE)\nor the mass varying neutrinos (mavans) [2, 3, 4], the\nstandard model is extended by including singlet righthanded neutrinos Ni , i = 1, 2, 3, and giving a Majorana\nmass to the neutrinos which varies with a scalar field,\nthe acceleron. This model was not complete and several\nproblems were pointed out [3, 8]. Some of the problems\nhave been solved in subsequent works [9, 10], but more\nstudies are required to make this model fully consistent.\nThe main motivation of the present article is to justify\nthe very low scale entering in this model naturally, embed\nthis idea into a left-right symmetric model and also in\ngrand unified theories. Since the right-handed neutrinos\nare not very heavy, leptogenesis occurs through scalar\ndecays.\nIn the νDE models, the Majorana masses of the righthanded neutrinos varies with the acceleron field and that\nrelates the scale of dark energy with the light neutrino\nmasses. Naturalness requires the Majorana masses of\nthe right-handed neutrinos also to be in the range of eV,\nso the main motivation of the seesaw mechanism is lost.\nThe smallness of the light neutrino masses cannot be attributed to a large lepton number violating mass scale\nin the theory. In this νDE model, the neutrino Dirac\nmasses cannot be made to vary with the acceleron field,\nsince that will then allow coupling of the acceleron field\nwith the charged leptons and a natural scale for the dark\nenergy will then be the mass of the heaviest charged lepton. For the same reason, this mechanism cannot be embedded into a left-right symmetric model, in which the\nSU (2)R group relates the right-handed neutrinos to the\nright-handed charged leptons.\nThe problem with the smallness of the mass parameter that depends on the acceleron field can be softened\n\nin the νDE models with triplet Higgs scalars [10]. In\nthese models the standard model is extended to include\ntriplet Higgs scalars. In any phenomenologically consistent triplet Higgs scalar model, lepton number is violated\nexplicitly by a trilinear scalar couplings of the triplet\nHiggs scalar with the standard model Higgs doublet. In\nthe νDE model with the triplet Higgs scalars, the coefficient of this trilinear scalar coupling with mass dimension\nvaries with the acceleron field, and naturalness allows this\nparameter to be as large as a few hundred GeV. Although\nthe scale of this mass parameter predicts new signals in\nthe TeV range, there is no symmetry that makes this\nscale natural.\nWe propose a left-right symmetric model, in which the\nmass parameter that varies with the acceleron field remains small naturally and the scale of dark energy is related to the neutrino masses. This is the only νDE model\nthat can be embedded into a grand unified theory, without relating the scale of dark energy to the charged\nfermion masses. We then discuss the question of leptogenesis in this model.\nWe start with the left-right symmetric extension of\nthe standard model [11] with the gauge group GLR ≡\nSU (3)c × SU (2)L × SU (2)R × U (1)B−L , and the electric\ncharge is related to the generators of the group as:\nQ = T3L + T3R +\n\nB−L\n= T3L + Y .\n2\n\n(1)\n\nThe quarks and leptons transform under the left-right\nsymmetric group as:\n\u0013\n\u0012\n\u0013\n\u0012\n1\n1\nuR\nuL\n≡ [3, 1, 2, ]\n≡ [3, 2, 1, ] QR =\nQL =\ndR\ndL\n3\n3\n\u0012 \u0013\n\u0012\n\u0013\nνL\nNR\nlL =\n≡ [1, 2, 1, −1] lR =\n≡ [1, 1, 2, −1]\neL\neR\nSR ≡ [1, 1, 1, 0] .\n(2)\nIn addition to the standard model fermions, the righthanded neutrinos NR and a right-handed singlet fermion\nSR have been introduced. Under left-right parity this\nfield transform to its CP conjugate state as: SR ↔\nS c L , and the Majorana mass term is invariant under\n\n\f2\nthe parity transformation. So, although we do not include another field SL , the theory is left-right symmetric. This is possible because this field transform to itself\nSR ≡ (1, 1, 1, 0) ↔ (1, 1, 1, 0) under the transformation\nSU (2)L ↔ SU (2)R .\nWe consider the symmetry breaking pattern [12, 13]:\nSU (3)c × SU (2)L × SU (2)R × U (1)(B−L) [GLR ]\nMR\n\n→ SU (3)c × SU (2)L × U (1)R × U (1)(B−L)\n\n[G1R ]\n\nmr\n\n[Gstd ]\n\nmW\n\n[Gem ] .\n\n→ SU (3)c × SU (2)L × U (1)Y\n\n→ SU (3)c × U (1)Q\n\nThe Higgs scalars required to break the left-right symmetric group to G1R transform as ξR ≡ (1, 1, 3, 0). This\nHiggs scalar does not couple to the fermions and cannot give Majorana masses to the neutrinos, since it does\nnot carry any B − L quantum number. The group G1R\nand the BL symmetry is broken by the vacuum expectation value (vev) of the field χR ≡ (1, 1, 2, 1) [14, 15].\nIf SU (2)R is not broken to its subgroup U (1)R at some\nhigh scale, the field χR can break the left-right symmetry group directly to the standard model. For consistency\nwith the left-right symmetry, or the existence of the leftright parity would then require the fields ξL ≡ (1, 3, 1, 0)\nand χL ≡ (1, 2, 1, 1). We break the standard model gauge\nsymmetry by a bi-doublet Φ ≡ (1, 2, 2, 0), whose vev can\ngive masses to the charged fermions. In addition, we introduce another bi-doublet Ψ ≡ (1, 2, 2, 0), which does\nnot contribute to the fermion masses but has similar vev\nand a singlet scalar field η ≡ (1, 1, 1, 0), which acquires a\ntiny vev and generate the mass scale for the dark energy.\nWe start with the interactions of the Higgs scalar fields.\nThere are quadratic and quartic self interactions of all the\nfields, which determines their masses and vacuum expectation values (vev). However, some of the fields would\nacquire induced vevs due to their linear interactions. We\nshall first write down these terms which will allow us\nto determine the vevs of the different fields. In principle, one should write down all the scalar interactions and\nthen minimize the potential to find the consistent solution for the vevs of the different fields. These details will\nbe presented elsewhere. Here we shall present the essential part of the scalar interactions and an estimate of the\nvevs. In addition to the usual quadratic and quartic interactions of the different fields, for the working of the\npresent mechanism the Lagrangian contains the terms:\nLs = hΦ η(ΨξL Φ + Ψ† ξR Φ) + hχ ηχ†L χR Φ\n+ hξ ξL ξR (Φ† Φ + Ψ† Ψ)\n\n(3)\n\nThis Lagrangian results from a Z4 discrete symmetry,\nunder which the different fields transform as:\nχL → iχL\nξL → iξL\n\nχR → −iχR\nξR → −iξR\nΨ → iΨ\n\nSR → iSR\nη → −η\n\nDenoting the vevs of the different fields by:\nhξL i = uL\n\nhξR i = uR\n\nhχL i = vL\nhΦi = v\n\nhχR i = vR\nhηi = u\n\nhΨi = w\nwe can minimize the complete scalar potential and find\na consistent solution with (the details will be presented\nelsewhere):\nu≈\n\n(v 2 + w2 )uR\nvvR u\nvw(uL + uR )\nuL ≈\nvL ≈\n2\nmη\nm2ξ\nm2χ\nuR ≫ vR > v > w ≫ u ≫ vL .\n\n(4)\n\nIn grand unified theories the consistency of the gauge\ncoupling unification requires the scale of left-right symmetry breaking to be above 1011 GeV, so we shall assume\nuR ∼ 1011 GeV. We also assume mη ∼ mξ ∼ uR . However, the G1R symmetry breaking scale could be very\nlow, so we shall assume mχ ∼ vR ∼ TeV. The other\nmass scales are then v ∼ mw ∼ 100 GeV, u ∼ uL ∼ eV\nand vL ∼ 10−2 eV. Since the B − L symmetry is broken\naround the TeV scale, there will be new phenomenological consequences that may be observed at LHC.\nThe neutrino masses come from the Yukawa interactions of the leptons and the singlet fermion S, which are\ngiven by:\nLY = f lL lR Φ + fL SR lL χL + fR S c L lR χR\n1\n+ fs ηS c L SR + H.c. .\n2\n\n(5)\n\nThe Yukawa couplings f are 3×3 matrix, while fL and fR\nare 3 × n matrices, if we assume that there are n singlet\nfermions S and fs is a n × n matrix. The neutrino mass\nmatrix can now be written in the basis ( νL N c L S c L )\nas:\n\n\n0\nfv\nfL vL\nMν =  f v\n0\nfR vR  .\n(6)\nfL vL fR vR fs u\nThis matrix can be block diagonalised, which gives the\nmasses of the right-handed neutrinos and the singlet\nfermions S to be of the order of the largest entry in the\nmass matrix vR . The left-handed neutrinos remains light\nwith small admixture with heavier states and the light\neigenvalue comes out to be\nmν = −2\n\nf fL vvL\nfs f 2 uv 2\n+ 2\n2 .\nfR vR\nfR vR\n\n(7)\n\nThe first term is the type-III seesaw [16] contribution and\nthe second term is the double seesaw contribution. With\nthe choice of the vevs discussed earlier, both these terms\nbecome comparable, although the second term dominates.\n\n\f3\nWe now assume that the mass parameter Ms = fs u ∼\nfs hηi varies with the acceleron field A. This parameter\nMs remains of the order of eV naturally, and it does not\ncouple to the charged fermions. Thus the model satisfies\nboth the conditions we wanted to achieve. Embedding\nthis model in a grand unified theory is also straightforward. Consider an SO(10) grand unified theory. The\nquarks and leptons in this model would belong to a 16dimensional representation, while SR will belong to a singlet representation. So, the Majorana mass Ms of the\nsinglet can vary with the acceleron field without affecting the charged fermion masses. The scalars belong to\nrepresentations: ξL,R [45], χL [16], χR [16], η [1] and\nΦ [10]. These fields will then allow the interactions required for the implementation of this model. When this\nmodel is embedded in a grand unified theory, the different mass scales for the left-right symmetry breaking and\nthe U (1)R symmetry breaking come out to be consistent\nwith the gauge coupling unification.\nWe shall now discuss the implementation of the\nνDE mechanism in this model. We assume that the singlet mass Ms varies with the acceleron field A, so that\nthe neutrino mass becomes a dynamical quantity since\nthe double seesaw contribution dominates over the typeIII seesaw. This gives the coupling between the neutrinos\nand the acceleron, which stops the dynamical evolution\nof the acceleron fields when the neutrinos become nonrelativistic. The dependence of the mass Ms on the acceleron field governs the dynamics of the dark energy.\nThis details would depend on the nature of the acceleron\nfield. Since we shall not be specifying the origin of the\nacceleron field, we shall comment only on some generic\nstructures of this solution.\nAs in the original νDE model, we consider the nonrelativistic limit, when mν is a function of dark energy, the\npotential of dark energy becomes\nV = mν (A) nν + V0 (A) .\n\n(8)\n\nHere the scalar potential V0 (A) is due to the acceleron\nfield, for example [3],\nV0 (A) = Λ4 log(1 + |Ms (A)/μ|) .\n\n(9)\n\nDue to the back reaction from the neutrinos, the evolution of acceleron field should be described by the effective\npotential (8) which depends on the total numbers nν of\nthermal background neutrinos and antineutrinos.\nThe acceleron field will be trapped at the minima of\nthe potential, which ensures that as the neutrino mass\nvaries, the value of the acceleron field will track the varying neutrino mass. One generic feature of this solution\nis that it leads to a equation of state with ω = −1 at\npresent. The most important feature of this scenario is\nthat the energy scale for the dark energy gets related to\nthe neutrino mass, which is highly desirable. This also\nexplains why the universe enters an accelerating phase\nnow [17].\n\nThe effective low-energy Lagrangian will now become\n− Lef f = Ms (A)\n\nf 2 v2\n2 νi νj + H.c. + V0 (A) ,\nfR2 vR\n\n(10)\n\nwhere Ms is naturally of the order of fraction of eV and\nhence can explain the dark energy with the equation of\nstate satisfying w = −1. The scale of dark energy Λ ∼\n10−3 eV does not require any unnaturally small Yukawa\ncouplings or symmetry breaking scale in this case. The\nelectroweak symmetry breaking scale v and the U (1)R\nbreaking scales are comparable and hence the new gauge\nboson corresponding to the group U (1)R will have usual\nmixing with Z and should be accessible at LHC.\nSince the minima of the potential relates the neutrino\nmass to a derivative of the acceleron potential, the value\nof the acceleron field gets related to the neutrino mass.\nOn the other hand, as the neutrino mass grows, the degeneracy pressure due to the background neutrinos and\nantineutrinos also starts growing. This causes problem\nwith the stability of this solution [8, 18]. However, this\ngeneric problem of this scenario may be explained by\nconsidering formation of neutrino lumps in the universe.\nAs the neutrino mass grows, there would be a tendency\nfor the neutrinos to cluster together due to the attractive\nforce originating from the acceleron coupling. These neutrino lumps would then behave as dark matter and will\nnot affect the dynamics of the acceleron field, making the\nsolution stable [19].\nIn this scenario leptogenesis [20] occurs through decays of the heavy scalars η. Unlike other models of type\nIII seesaw mechanism [15], the right-handed neutrinos\nand the singlet fermions SR have masses in the TeV\nrange, and hence, their decays cannot generate any lepton asymmetry. When ξR acquires its vev at very large\nscale, the heavy scalars η can decay into η → Φ∗ + Ψ\nand η → SR + SR . These decays of η can generate a\nasymmetry in SR and S c L when the tree-level diagrams\ninterfere with self-energy type one loop diagrams [21].\nSince SR does not carry any B − L quantum number,\na lepton asymmetry is not generated at this time. Before the electroweak symmetry breaking, when the field\nχR acquires vev, the singlet fermions SR mix with the\nright-handed neutrinos and at this time the asymmetry\nin SR and SLc is converted to a lepton asymmetry of the\nuniverse. This lepton asymmetry, in turn, generates the\nrequired baryon asymmetry of the universe in the presence of the sphalerons [22].\nIn conclusion, we proposed a left-right symmetric extension of the standard model, where the νDE mechanism could be embedded. The most important advantage\nof this model over all the existing models is that it allows\na naturally small scale for the dark energy. The existence\nof the large scale that generates this small scale naturally\nthrough a seesaw suppression, allows leptogenesis in this\nmodel. The model has the added feature that it can be\nembedded in a grand unified theory.\n\n\f4\n\n∗\n†\n‡\n§\n\n[1]\n[2]\n[3]\n[4]\n[5]\n[6]\n\n[7]\n\n[8]\n[9]\n\nElectronic address: jeet@prl.res.in\nElectronic address: pgu@ictp.it\nElectronic address: utpal@prl.res.in\nElectronic address: santosh@prl.res.in\nA. Riess et al., Astron. J. 116, 1009 (1998); S. Perlmutter\net al., Astrophys. J. 517, 565 (1999); D. Spergel et al.,\nAstrophys. J. Suppl. 148, 175 (2003).\nP. Gu, X. Wang, and X. Zhang, Phys. Rev. D 68, 087301\n(2003).\nR. Fardon, A.E. Nelson, and N. Weiner, JCAP 0410, 005\n(2004).\nP.Q. Hung, hep-ph/0010126.\nC. Wetterich, Nucl. Phys. B 302, 668 (1988); P.J.E. Peebles and B. Ratra, Astrophys. J. 325, L17 (1988).\nD.B. Kaplan, A.E. Nelson, and N. Weiner, Phys. Rev.\nLett. 93, 091801 (2004); H. Li, Z. Dai, and X. Zhang,\nPhys. Rev. D 71, 113003 (2005); V. Barger, P. Huber,\nand D. Marfatia Phys. Rev. Lett. 95, 211802 (2005);\nA.W. Brookfield, C. van de Bruck, D.F. Mota, and D.\nTocchini-Valentini, Phys. Rev. Lett. 96, 061301 (2006);\nA. Ringwald and L. Schrempp, JCAP 0610, 012 (2006).\nR. Barbieri, L.J. Hall, S.J. Oliver, and A. Strumia, Phys.\nLett. B 625, 189 (2005); C.T. Hill, I. Mocioiu, E.A.\nPaschos, and U. Sarkar, Phys. Lett. B 651, 188 (2007);\nP.H. Gu, H.J. He, and U. Sarkar, Phys. Lett. B 653, 419\n(2007); JCAP 0711, 016 (2007); P.H. Gu, Phys. Lett. B\n661, 290 (2008).\nN. Afshordi, M. Zaldarriaga, and K. Kohri, Phys.Rev. D\n72, 065024 (2005).\nR. Takahashi and M. Tanimoto, Phys. Lett. B 633, 675\n(2006); R. Fardon, A.E. Nelson, and N. Weiner, JHEP\n0603, 042 (2006); O.E. Bjaelde, et al., arXiv:0705.2018\n\n[10]\n[11]\n\n[12]\n[13]\n\n[14]\n[15]\n[16]\n[17]\n[18]\n[19]\n[20]\n\n[21]\n\n[22]\n\n[astro-ph]; N. Brouzakis, N. Tetradis, and C. Wetterich,\narXiv:0711.2226 [astro-ph].\nE. Ma and U. Sarkar, Phys. Lett. B 638, 356 (2006).\nJ.C. Pati and A. Salam, Phys. Rev. Lett. 31, 661 (1973);\nPhys. Rev. D 8, 1240 (1973); ibid. 10, 275 (1974); R.N.\nMohapatra and J.C. Pati, Phys. Rev. D 11, 566, 2558\n(1975); R.N. Mohapatra and G. Senjanovic, Phys. Rev.\nD 12, 1502 (1975).\nS. Rajpoot, Phys. Lett. B 108, 303 (1981); ibid. 115, 396\n(1982).\nM. Malinsky, J.C. Romao, and J.W.F. Valle, Phys. Rev.\nLett. 95, 161801 (2005); M. Hirsch, J.W.F. Valle, M.\nMalinsky, J.C. Romao and U. Sarkar, Phys. Rev. D 75,\n011701 (2007).\nS.M. Barr, Phys. Rev. Lett. 92, 101601 (2004).\nC.H. Albright and S.M. Barr, Phys. Rev. D 69, 073010\n(2004); Phys. Rev. D 70, 033013 (2004).\nR. Foot, H. Lew, X.G. He, and G.C. Joshi, Z. Phys. C\n44, 441 (1989); E. Ma, Phys. Rev. Lett. 81, 1171 (1998).\nC. Wetterich, Phys. Lett. B 655, 201 (2007).\nO.E. Bjaelde, et. al., arXiv:0705.2018 [astro-ph].\nD.F. Mota, V. Pettorino, G. Robbers and C. Wetterich,\narXiv:0802.1515 [astro-ph].\nM. Fukugita and T. Yanagida, Phys. Lett. B 174, 45\n(1986); P. Langacker, R.D. Peccei, and T. Yanagida,\nMod. Phys. Lett. A 1, 541 (1986); M.A. Luty, Phys. Rev.\nD 45, 455 (1992); R.N. Mohapatra and X. Zhang, Phys.\nRev. D 46, 5331 (1992).\nM. Flanz, E.A. Paschos and U. Sarkar, Phys. Lett. B\n345, 248 (1995); E. Ma and U. Sarkar, Phys. Rev. Lett.\n80, 5716 (1998).\nV.A. Kuzmin, V.A. Rubakov, and M.E. Shaposhnikov,\nPhys. Lett. B 155, 36 (1985); R.N. Mohapatra and X.\nZhang, Phys. Rev. D 45, 2699 (1992).\n\n\f"}