{"id": "http://arxiv.org/abs/0905.3535v3", "guidislink": true, "updated": "2009-05-30T00:53:34Z", "updated_parsed": [2009, 5, 30, 0, 53, 34, 5, 150, 0], "published": "2009-05-21T17:59:23Z", "published_parsed": [2009, 5, 21, 17, 59, 23, 3, 141, 0], "title": "Smectics: Symmetry Breaking, Singularities, and Surfaces", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0905.4938%2C0905.1921%2C0905.0055%2C0905.1734%2C0905.3731%2C0905.1670%2C0905.3804%2C0905.3745%2C0905.1125%2C0905.0630%2C0905.3356%2C0905.2708%2C0905.3807%2C0905.2320%2C0905.2351%2C0905.1282%2C0905.4414%2C0905.3546%2C0905.4847%2C0905.1837%2C0905.0448%2C0905.1043%2C0905.4144%2C0905.3743%2C0905.4766%2C0905.1399%2C0905.1607%2C0905.0327%2C0905.1174%2C0905.0224%2C0905.1811%2C0905.4760%2C0905.1360%2C0905.3636%2C0905.2863%2C0905.3133%2C0905.0480%2C0905.4066%2C0905.1348%2C0905.4225%2C0905.3511%2C0905.2156%2C0905.4675%2C0905.4171%2C0905.3535%2C0905.1706%2C0905.2263%2C0905.2284%2C0905.0827%2C0905.0985%2C0905.3704%2C0905.4179%2C0905.4459%2C0905.1457%2C0905.3997%2C0905.4940%2C0905.3072%2C0905.0937%2C0905.1423%2C0905.0745%2C0905.2386%2C0905.3475%2C0905.2859%2C0905.0161%2C0905.2061%2C0905.2412%2C0905.2105%2C0905.0545%2C0905.0230%2C0905.1325%2C0905.0628%2C0905.0074%2C0905.3124%2C0905.2805%2C0905.3880%2C0905.4119%2C0905.1369%2C0905.0355%2C0905.2834%2C0905.2554%2C0905.0687%2C0905.2483%2C0905.2870%2C0905.1657%2C0905.0699%2C0905.4860%2C0905.3055%2C0905.3423%2C0905.4849%2C0905.3144%2C0905.3810%2C0905.0869%2C0905.1246%2C0905.0837%2C0905.0152%2C0905.4759%2C0905.1820%2C0905.3369%2C0905.0868%2C0905.3684%2C0905.1036&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Smectics: Symmetry Breaking, Singularities, and Surfaces"}, "summary": "The homotopy theory of topological defects in ordered media fails to\ncompletely characterize systems with broken translational symmetry. We argue\nthat the problem can be understood in terms of the lack of rotational Goldstone\nmodes in such systems and provide an alternate approach that correctly accounts\nfor the interaction between translations and rotations. Dislocations are\nassociated, as usual, with branch points in a phase field, while disclinations\narise as critical points and singularities in the phase field. We introduce a\nthree-dimensional model for two-dimensional smectics that clarifies the\ntopology of disclinations and geometrically captures known results without the\nneed for compatibility conditions. Our work suggests natural generalizations of\nthe two-dimensional smectic theory to higher dimensions and to crystals.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0905.4938%2C0905.1921%2C0905.0055%2C0905.1734%2C0905.3731%2C0905.1670%2C0905.3804%2C0905.3745%2C0905.1125%2C0905.0630%2C0905.3356%2C0905.2708%2C0905.3807%2C0905.2320%2C0905.2351%2C0905.1282%2C0905.4414%2C0905.3546%2C0905.4847%2C0905.1837%2C0905.0448%2C0905.1043%2C0905.4144%2C0905.3743%2C0905.4766%2C0905.1399%2C0905.1607%2C0905.0327%2C0905.1174%2C0905.0224%2C0905.1811%2C0905.4760%2C0905.1360%2C0905.3636%2C0905.2863%2C0905.3133%2C0905.0480%2C0905.4066%2C0905.1348%2C0905.4225%2C0905.3511%2C0905.2156%2C0905.4675%2C0905.4171%2C0905.3535%2C0905.1706%2C0905.2263%2C0905.2284%2C0905.0827%2C0905.0985%2C0905.3704%2C0905.4179%2C0905.4459%2C0905.1457%2C0905.3997%2C0905.4940%2C0905.3072%2C0905.0937%2C0905.1423%2C0905.0745%2C0905.2386%2C0905.3475%2C0905.2859%2C0905.0161%2C0905.2061%2C0905.2412%2C0905.2105%2C0905.0545%2C0905.0230%2C0905.1325%2C0905.0628%2C0905.0074%2C0905.3124%2C0905.2805%2C0905.3880%2C0905.4119%2C0905.1369%2C0905.0355%2C0905.2834%2C0905.2554%2C0905.0687%2C0905.2483%2C0905.2870%2C0905.1657%2C0905.0699%2C0905.4860%2C0905.3055%2C0905.3423%2C0905.4849%2C0905.3144%2C0905.3810%2C0905.0869%2C0905.1246%2C0905.0837%2C0905.0152%2C0905.4759%2C0905.1820%2C0905.3369%2C0905.0868%2C0905.3684%2C0905.1036&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The homotopy theory of topological defects in ordered media fails to\ncompletely characterize systems with broken translational symmetry. We argue\nthat the problem can be understood in terms of the lack of rotational Goldstone\nmodes in such systems and provide an alternate approach that correctly accounts\nfor the interaction between translations and rotations. Dislocations are\nassociated, as usual, with branch points in a phase field, while disclinations\narise as critical points and singularities in the phase field. We introduce a\nthree-dimensional model for two-dimensional smectics that clarifies the\ntopology of disclinations and geometrically captures known results without the\nneed for compatibility conditions. Our work suggests natural generalizations of\nthe two-dimensional smectic theory to higher dimensions and to crystals."}, "authors": ["Bryan Gin-ge Chen", "Gareth P. Alexander", "Randall D. Kamien"], "author_detail": {"name": "Randall D. Kamien"}, "author": "Randall D. Kamien", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1073/pnas.0905242106", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0905.3535v3", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0905.3535v3", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "9 pages, 3 included figures", "arxiv_primary_category": {"term": "cond-mat.soft", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.soft", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "cond-mat.stat-mech", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "hep-th", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "math.GT", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0905.3535v3", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0905.3535v3", "journal_reference": "Proc. Natl. Acad. Sci. 106 (2009) 15577", "doi": "10.1073/pnas.0905242106", "fulltext": "Smectics: Symmetry Breaking, Singularities, and Surfaces\nBryan Gin-ge Chen, Gareth P. Alexander, and Randall D. Kamien\n\narXiv:0905.3535v3 [cond-mat.soft] 30 May 2009\n\nDepartment of Physics and Astronomy,University of Pennsylvania, Philadelphia, PA 19104-6396, USA\nThe homotopy theory of topological defects in ordered media fails to completely characterize\nsystems with broken translational symmetry. We argue that the problem can be understood in\nterms of the lack of rotational Goldstone modes in such systems and provide an alternate approach\nthat correctly accounts for the interaction between translations and rotations. Dislocations are\nassociated, as usual, with branch points in a phase field, while disclinations arise as critical points and\nsingularities in the phase field. We introduce a three-dimensional model for two-dimensional smectics\nthat clarifies the topology of disclinations and geometrically captures known results without the\nneed for compatibility conditions. Our work suggests natural generalizations of the two-dimensional\nsmectic theory to higher dimensions and to crystals.\n\nMany of the features and properties of ordered media, such as crystalline solids, magnets, and liquid crystals,\nare controlled by their defects; those points or lines of discontinuity at which the order changes abruptly or is illdefined. For example, defects have played prominent roles in understanding the plastic deformation of solids [1], the\nKosterlitz-Thouless transition of the two-dimensional XY model [2], the dislocation-unbinding melting of solids [3]\nand the formation of colloidal crystals in nematic liquid crystals [4]. One of the unifying features of the defects\nin all of these systems is that they are topological, in the sense that many of their properties depend only on the\nsymmetry of the ordered medium. Based on this concept a general framework has been developed for the identification\nand classification of the topological defects in any broken symmetry medium in terms of group elements (or more\ngenerally conjugacy classes) of homotopy groups of a space of degeneracy, representing the ground state manifold\nof the system [5, 6, 7, 8]. This has provided an understanding of the ways in which defects can combine or split,\nand highlighted the path dependence of such processes when the fundamental group of the ground state manifold is\nnon-Abelian [9].\nIt is known, however, that the standard topological theory of defects is incomplete in systems with spontaneously\nbroken translation and rotation invariance, such as crystals [6, 8, 10]. More specifically, a description of such systems\nthat treats disclinations and dislocations (translational defects) and their interactions in a mathematically coherent\nfashion is missing. A topological classification of treating dislocations alone is available via the use of Burgers'\nvectors and the like [11, 12]. The standard way [13, 14] to add disclinations in these systems is to adjoin extra\ncomponents representing the orientation of the system to the order parameter. For instance, the order parameter\nspace of the two-dimensional smectic becomes the Klein bottle. But in this formalism, the neat correspondence\nbetween the fundamental group of the order parameter space and disclination-type defects breaks down, as we will\ndemonstrate. For instance, it is impossible to have a disclination with index greater than +1 in a two-dimensional\nsmectic system [6, 15], yet there is no indication of this in the standard formalism. This breakdown is related to the\nnumber of Goldstone modes in these systems, and the restrictions they impose on paths in the ground state manifold.\nThe goal of this paper is thus to reconsider the topological theory of defects for systems with broken translational\nsymmetry and argue that \"less is more\", at least for components of the order parameter. We will show that it is\nmathematically consistent to keep the order parameter as a phase field, of the sort whose topological defects are\nwell-known to generate the Burgers vector for dislocations, and look at disclinations in this picture as defects in the\nderivatives of the phase field. Modeling disclinations as critical points was considered by Trebin [8]; we complete\nthis approach and present a method which admits dislocations as well by noting that phase fields in layered systems\nare not maps to R but rather to periodic, possibly non-orientable spaces. We also suggest connections to singularity\ntheory and Morse theories which can shed further light on our formulation.\nWe focus on liquid crystalline systems as they have low-dimensional order parameter spaces and use as our prototypical examples the two-dimensional smectic and directed line systems. Smectic liquid crystals consist of rod-shaped\nmolecules that spontaneously form both directional (nematic) order and a one-dimensional density wave, commonly\ndescribed as a layered system; the spacing between the layers is approximately the rod length, a. In two-dimensions,\nwe can picture the layers as a set of nearly-equally-spaced curves lying in the plane. The ground states are characterized by both equal-spacing between these curves and vanishing curvature. The free energy, accordingly, has two\nterms, the first a compression energy that sets the spacing, the second a bending energy. Because they are periodic,\nsmectics can be expressed as a density wave ρ(x) with wavelength 2π/q0 . Nearly uniform plane waves with wavevector\nq0 = q0 q̂0 can be written as ρ(x) = ρ0 + hρ1 iRe ei(q0 *x−q0 u(x)) , where u is the Eulerian displacement function and\nφ = q̂0 *x− u is the phase field. Drawing the layers at places of maximum density, we see that the layers are those level\nsets where φ is an integer multiple of a. The energy may be written in terms of the phase field or the displacement,\nhence we will look at the geometry of the smectic in terms of these functions. We note that smectics have an extra\n\n\f2\nsymmetry that the φ(x) description does not have, namely that φ → −φ is a symmetry which leads to their lack of\norientability. We will discuss this in the following; for now it suffices to say that a configuration of layers arising from\nφ(x) carries an orientation. Hence, we call this the directed line system, indeed it is topologically equivalent to wave\nsystems; see, for instance, Nye and Berry's work on wave dislocations [16]. Familiar examples of true two-dimensional\nsmectic configurations may be found on your fingerprints. Many other realizations of these systems have been studied\nexperimentally [17, 18]; even electronic systems can realize quantum smectic states [19].\nAdditionally, we introduce a geometrically intuitive model for looking at the topology of smectic defects that allows\nus to demonstrate our results. Since the phase field is the basic ingredient to study a smectic, it is natural to view the\nsmectic as a surface placed over the plane. The singularities of this surface will then correspond to different defects.\nOur model motivates a highly geometric expression for the nonlinear smectic free energy functional and allows us to\nconsider compression and curvature energies around defects.\nIn the following we review the standard topological theory of defects via examples, namely disclinations in nematics\nand dislocations in smectics. We recapitulate the limitations of the standard formalism when extended to disclinations\nin the directed line system and the smectic. Next, we present our resolution of these problems in terms of our construct\nand discuss a geometric formulation of the free energy for two-dimensional smectics and use this to find compressionfree defects. Finally, we conclude with applications and a discussion of avenues for extension.\nDefects, Fundamental Groups, and All That\n\nSystems with broken symmetries are described by non-vanishing order parameters. When the symmetry is continuous there is a degeneracy of ground states continuously connected by the underlying symmetry. Each of these\nequivalent but different ground states is represented by a different value of the order parameter. The order parameter\nfield is a local measure of the system's order; in other words, each configuration of a medium defines a map from\nphysical space (the plane, in this paper) to the set of order parameters. The goal of the topological theory of defects\nis to classify the defect structures in physical media by analyzing the properties of these maps which are invariant\nunder continuous deformation, or homotopy.\nAs an example, recall the familiar XY model of two-dimensional spins on the plane. In the broken symmetry state\nthe spins align along a common direction, making an angle θ with the +x̂ direction. The ground state corresponds\nto a constant value of θ and the ground state manifold is thus the unit circle, S 1 . Locally, the orientation at a point\nP in any texture corresponds to some point in the ground state manifold and we can think of the ordered state as\na map from points in the sample to directions given by points in S 1 . Upon traversing a closed loop in the sample\nthe orientation must return to its initial value so that θ can only change by an integer multiple of 2π, known as the\nwinding number. A non-zero winding indicates that the loop encircles a topological defect, or vortex, whose strength\nis given by the winding number. Thus, defect states of the two-dimensional XY model are characterized by a single\ninteger.\nThese notions are formalized in the homotopy theory of topological defects [6, 7, 8]. There we start with two\ngroups, G and H, which are the symmetry groups of the system in a disordered and ordered state, respectively,\nso H ⊂ G. The ground state manifold is the quotient space G/H and the topological defects are classified by the\nconjugacy classes of the fundamental group, π1 (G/H). In the XY model the disordered state has full rotational\nsymmetry, so G = SO(2), which the ordered state breaks completely, so H is the trivial group. The order parameter\nmanifold is G/H ∼\n= S 1 , the unit circle, and the fundamental group is π1 (S 1 ) = Z, reproducing our intuitive result.\nTwo-dimensional nematics are almost identical, except that, since nematics have no heads or tails, we must identify\nθ and θ + π, so that now H = Z2 . We then have G/H = RP 1 and π1 (RP 1 ) = 12 Z, giving the familiar Frank indexing\nof nematic disclinations [20]. In this way, the topological theory provides a general framework for the classification of\ndefects in any broken symmetry ordered medium. Amongst the key insights it affords is that products of loops in the\nfundamental group yield information on how defects combine or split and, particularly, the path dependence of these\nprocesses when the fundamental group is non-Abelian [9].\nThe same approach may be applied, through a \"naı̈ve generalization\" [6], to systems with broken translational\nsymmetry, such as directed lines in the plane and two-dimensional smectics. Beginning with the directed line model,\nthe ground state consists of parallel layers, perpendicular to x̂ and with equal spacing a and a well-defined orientation\nas in Figure 1(a). The symmetries of the ground state consist of a translation of the layers by a in the x̂ direction,\narbitrary translations in the ŷ direction, and rotations by 2π of the system. Thus G is the two-dimensional Euclidean\ngroup consisting of two translations and a rotation, H = R × Z and G/H = S 1 × S 1 , the two-torus, where the first\nfactor is translations modulo a and the second is rotations modulo 2π. Coordinates for the ground state manifold\nare naturally provided by the phase φ (acted upon by translations) and the direction θ of the layer normal (acted\nupon by rotations). If we consider homotopy classes of loops with non-zero winding only in the φ direction we recover\ndislocations. In particular, the usual construction for the Burgers vector via counting layers is equivalent to looking\n\n\f3\nat the winding number of φ, since we draw a new layer for every multiple of a in φ. The fundamental group of the\ntorus is Z × Z, so in this generalization, defects in the full system should be characterized by pairs of integers (m, n),\nm corresponding to dislocation charge and n corresponding to disclination charge.\nIn the case of the smectic, the ground state is again a set of parallel lines perpendicular to x̂, but without orientation.\nTherefore, the symmetries include translation by a in the x̂ direction, and rotations by π owing to the nematic-like\nsymmetry. A rotation by π followed by a translation by δ is equivalent to translation by −δ, which leads to a twist\nin the order parameter space. Again with φ, θ being the coordinates of the ground state manifold, we must now\nidentify φ with −φ when θ → θ + π. The order parameter space is no longer the two-torus, but is the Klein bottle.\nTo construct the fundamental group of the Klein bottle we start with the free group of two elements S, representing\na shift by a, and F , a rotation or flip by π. Note, however, that F S −1 F −1 = S and it follows that the fundamental\ngroup is hS, F |F SF −1 S = ei, where e is the group identity. This group is the semidirect product Z ⋊ Z2 [14], so one\nmight classify loops by two numbers (m, n), where m counts the number of dislocations and n counts the number of\ndisclinations. Algebraically, one can show that if n is odd, (m, n) is conjugate to (m+2, n), i.e. S −1 (F S m )S = F S m+2 .\nThis can be interpreted graphically and elegantly as the generation of a dislocation pair in the presence of a +1/2\ndisclination, as in Figure 3 of [21].\nThough the algebraic structure we have presented is the natural generalization of the standard study of topological\ndefects [13, 22], it fails to correctly characterize the defects of either system. Mermin recognized this in [6] and pointed\nout the difficulty of using the standard approach when translational symmetry is broken. Part of the issue is that\nthe homotopy theory predicts entire classes of defects that are not present in the physical system. Poénaru proved\nthat directed line and smectic models cannot have disclinations with index greater than +1 [15], and yet they are\npredicted by the homotopy theory. More generally, the problem lies in the allowed changes of the order parameter\nas one moves along a path in the sample. For a system with liquid-like order, such as the nematic, any variation\nin the order parameter can be accommodated, i.e. any path in the ground state manifold can be mapped onto the\nspecified path in the sample. However, the same is not true for translationally ordered media, like the smectic.\nA continuous symmetry implies that two degenerate ground states can be connected via an arbitrarily low energy\nGoldstone excitation. This implies that the dimensionality of the allowed excitations corresponds to the number of\nGoldstone modes. Although the smectic breaks both rotational and translational symmetry, it has only one Goldstone\nmode, the Eulerian displacement field u(x), a signal of something different. Not any path in the ground state manifold\ncan be realized, but only those which correspond to this mode. The reduction in the number of Goldstone modes\nand consequent restriction of the realizable paths in systems of broken translational symmetry arises because the\nrotational and translational degrees of freedom are coupled into a composite object [3, 10, 23], in a manner akin to\nthe Higgs mechanism for gauge fields [24]. Only when the number of Goldstone modes is equal to the dimensionality\nof the ground state manifold do we have sufficient freedom to be able to match any path in the ground state manifold\nto any path in the sample, as is required for the application of the standard homotopy theory.\nOur main result is to present a method by which the topological defects of translationally ordered media can be\nfaithfully captured, without the need to remove entire classes of non-realizable defects. The coupling of rotational\nand translational broken symmetries tells us that we should no longer consider the coordinates φ, θ of a point in the\nground state manifold as freely variable. Recall that they are both given by the order parameter φ(x), the former as\nthe value of the phase field at a point and the latter as the direction of its gradient. In order to identify the position\nin the ground state manifold of a configuration at any point P , therefore, we must consider the Taylor series for the\nconfiguration φ(P + x) ≈ φ(P ) + ∇φ|x=P * x + * * * [25]. The ground states of the directed line and smectic systems are\nlinear functions φφ0 ,k (x) = φ0 + k * x, where k is a unit vector. We assign the φ component of the local ground state\nto be φ0 , as usual, and use the directionality of ∇φ|x=P to set the second component, k. Note how this generalizes\nthe usual procedure. If the ground state has structure up to order n, strictly speaking, we should keep data at every\npoint of the configuration also up to order n [26]. There is an immediate implication regarding the smoothness of the\nphase field as well. When φ has a nontrivial winding about a point, we know it must be discontinuous there. Suppose\nthough that a loop has nontrivial winding in ∇φ/|∇φ|. In this case the unit normal must be discontinuous, but this\nonly implies that ∇φ is discontinuous or zero. It follows that at a disclination φ is either singular or critical.\nOf course, since any configuration can still be identified locally with a point in the ground state manifold, the defects\nthat do occur will still correspond to non-trivial loops in G/H and we can continue to label them by the winding\nnumbers of these loops. However, the possible defects that can arise should be determined from the homotopy of φ(x)\nand ∇φ(x) together, and not from the structure of the ground state manifold. With this construction in hand, we\nmove on to our surface model.\n\n\f4\nSurface model\n\nIn this section we provide the first steps towards a theory where the objects being homotoped are not simply paths\nin the ground state manifold, but rather smooth maps from the physical space to the space of the translational phase\nfield. Thus the theory of defects for these systems should be given in the language of singularity theory [27] and flavors\nof Morse theory [28] which may combine those on circle-valued maps [29] and on singular spaces [30]. Rather than\nattempt to lay out precise mathematical conditions and proceed into the realm of rarefied mathematics, we discuss\nour ideas in an intuitive way, exploiting the following fact about smectics in two dimensions. Since the smectic is\nrepresented by level sets of a phase field on R2 , we may visualize the phase field as a graph of a two-surface. From\nthis perspective it becomes possible to sidestep the difficulties that we have discussed and to understand, for instance,\nPoénaru's rigorous result afresh. We begin with the simpler case of directed lines.\nStarting with a ground state for the lines, φ = φ0 + k * x is the equation for a plane and defines a line for fixed\nvalues of φ. Taking level cuts at φ = na, n ∈ Z we find lines in the xy-plane, with uniform spacing, a. Note, however,\nthat the φ → φ + a symmetry implied by the phase-field construction of the layers means that instead of one plane,\nwe have an infinite stack of equivalent planes each one shifted along the φ direction by a multiple of a as shown in\nFigure 1(a). Because of this, we can instead take a cut through all the planes at φ = 0, for instance, and equivalently\ngenerate the ground state viewing, φ as an element of S 1 . As we shall see, this multiplane description is natural from\nthe point of view of defects; they connect the different sheets together to form the required topology. For instance,\nwhen taking a Burgers circuit around a +2 dislocation, we know that φ changes by 2a. This means that the sheets\nmust be connected together with the topology of a helicoid so that dislocations may be thought of as branch points\nas shown in Figure 1(b). Multiple dislocations are given by surfaces connected by multiple helicoids, e.g. Figure 1(c).\nThis approach has been usefully employed to visualize dislocations in waves [31, 32] and we extend it to incorporate\ndisclinations. Disclinations, as we have discussed, are either zeroes or singularities of ∇φ and so in this height model,\nthe disclinations correspond to critical points or cusps in the surface [8]. For instance, a +1 disclination is represented\nby a \"mountain\" or \"trough\" in the height function and the disclination sits at the peak or nadir. Concretely, an\nequally spaced, +1 disclination is represented by a regular cone φ = |x|, the level sets at φ = na giving circular\nlayers with equal spacing, a. Similarly, negative charge disclinations correspond to saddles for creatures with varying\nnumbers of appendages.\nThe notion of topological equivalence in this model is intuitive. First, note that deformations of these surfaces (with\nthe restriction that horizontally or vertically tangent surfaces are singular) correspond to the class of allowed paths\nin the φ, ∇φ space that we discussed in the previous section [33]. Hence, results from Morse theory and singularity\ntheory on the topology of these surfaces and their defects up to topological equivalence classes may be regarded as\nglobal consequences of the local restrictions developed earlier. As an example, consider Poénaru's result on the lack of\ndisclinations of charge higher than +1. In our approach, Poénaru's result becomes transparent: two +1 disclinations\ncannot join because two mountains cannot come together on a surface without a mountain pass between them. A\nmountain pass has a critical point with the geometry of a saddle, and the contours of constant height draw out a −1\ndisclination in the two-dimensional line system. Similar arguments hold for two troughs and even for a trough and a\nmountain.\nSmectics can also have 1/2 disclinations because they are non-orientable. Thus, in addition to the infinite set of\nplanes normal to (−k, 1) in the line system, the smectic ground state also contains the infinite set of planes normal\nto (k, 1), as shown in Figure 2(a), since these generate the same set of unoriented layers. These two sets of planes\nintersect whenever φ is a half-integer multiple of a, which reflects the fixed points of the two symmetry operations\nφ → φ + a and φ → −φ. At these heights it is possible to cross continuously from one set of planes to the other,\nthereby changing the local orientation of the layers. Defects again connect the different planes together, although now\nthis can be done in two different ways; either by connecting planes with the same orientation, as in the directed line\nsystem, or planes with the opposite orientation. The latter leads to a global unorientability of the smectic and occurs\nwhen there are odd half-integer index disclinations. The two prototypical half-integer disclinations are depicted in\nFigure 2(b) (+1/2) and Figure 2(c) (−1/2). The +1/2 disclination consists of a pair of oppositely oriented planes\nterminated by a half-cone connecting them, while the −1/2 disclination is a three-way junction of pairs of oppositely\noriented planes smoothly joined together. These examples provide a visual demonstration of the fact that odd halfinteger index disclinations must have their singular points at φ = 0 or φ = a/2. Since these singular points terminate\nlayers and connect the two sets of parallel planes, it follows that the layers must arise as projections from the fixed\npoint values of φ – in other words, the presence of charge 1/2 disclinations forces the defect cores to sit at φ = na/2,\nn ∈ Z, or the heights of the level sets and halfway between them. Properly, for smectics φ is an element of the orbifold\nS 1 /Z2 , just as it was an element of S 1 for directed lines.\nThe way in which these singularities can join depends on the geometry of the height representation. For instance,\nconsider the dislocation and the pincement. We are used to the idea that a disclination dipole creates a dislocation [34].\nIndeed in Figure 3(a) we depict a ±1/2 disclination pair which form a charge +1 dislocation. However, consider the\n\n\f5\npincement shown in Figure 3(b). In this configuration the two singular points both lie at the same height and hence\nthey can be cancelled. The smectic dislocation cannot be cancelled because the singular layers do not line up. Though\nthis follows from the algebraic structure of paths on the Klein bottle, (i.e. [S 1/2 F S −1/2 ]F −1 = S, but F F −1 = e),\nthe height construction provides a geometric way to see the difference between these two complexions. We are also\nable to construct a dislocation directly. Since a Burgers circuit around a dislocation changes φ by a multiple of a, it\nfollows that the height function must have the topology of a helicoid. As shown in Figures 3(c) and 3(d) the composite\ndislocation has the structure of two intertwined half-helicoids. Note that the charge of a dislocation depends on both\nthe sign of the helicoid (left- or right-handed) and the tilt of the layers. A right-handed helicoid moved smoothly\naround a +1/2 disclination remains right-handed, but because the tilt of the layers has reversed the charge of the\ndislocation changes sign. This is the move that generates the ambiguity modulo 2 for the total dislocation charge in\nthe presence of a 1/2 index disclination [21].\nIn order for dislocation/anti-dislocation pairs to form, a neck connecting adjacent surfaces must be formed. As\nlong as this is smaller than the core size of the defects, it can be created without upsetting the overall topology.\nAs the inchoate dislocation pair separates, these necks expand and, in a manner similar to continuous deformations\nof Riemann's minimal surface, break up into two oppositely handed helicoids [35] as depicted in Figure 1(c). Note\nthat this type of process which necessarily includes local surgery for combining defects is implied in the theory of\ntopological defects as well [6]. In smectic systems, however, we must perform local surgery whenever we pull a defect\nthrough a layer – this follows from the above result that the defect cores must remain at a constant height.\nEnergetics from a Geometric Point of View\n\nThe height function approach provides a purely geometric way to formulate the nonlinear energetics of a twodimensional smectic. We start with the compression energy. In terms of the phase field the constraint of equal spacing\nis embodied in the condition that |∇φ| = 1 [36]. Thus any nonlinear strain uzz must vanish when |∇φ| = 1. We are\nfree, however, to choose any rotationally invariant function with this property; theories based on different nonlinear\nstrains will differ from each other in anharmonic powers of the strain and only the coefficient of the harmonic\np term is\ndefinition-independent. The height function defines a surface with a unit normal N = (−∂x φ, −∂y φ, 1)/ 1 + |∇φ|2 .\nAs we have seen, uniform spacing in the xy-plane\n√ requires that N * ẑ = cos(π/4), where we plot φ in the ẑ direction.\nAn allowed strain is thus uzz = (N * ẑ − 1/ 2). We note, however that for such a surface, the area measure,\n√\ng = 1/(N * ẑ). Thus we, may generalize the equal spacing condition to the requirement that g = 2 and choose, for\ninstance, uzz = g − 2. Indeed, in terms of the height function φ, g − 2 = |∇φ|2 − 1.\nGoldstone's theorem requires that the bending energy, on the other hand, reduce to ∇2 φ to harmonic order in φ.\nPossible nonlinear generalizations include the curvature of the smectic lines κ = ∇ * (∇φ/|∇φ|). Note however, that\nthe mean curvature of the surface defined by φ is H = 21 ∂i N i which reduces to the required expression to linear order\nin φ. We thus propose the following geometric free energy for the two-dimensional smectic:\nZ\n\u0002\n\u0003\n1\nF =\ndA B(g − 2)2 + K1 H 2\n(1)\n2\nwhere B is the bulk modulus and K1 is bending elastic constant. The free energy is defined as an integral over the\nheight surface that we have introduced and is the Willmore functional in a field [37]. The singularities associated with\ndisclinations and dislocations specify the boundary conditions and topology for the associated variational problem.\nIndependent of the energy functional, we know that any equally-spaced two-dimensional smectic has a corresponding\nheight surface with constant N * ẑ. It follows that the Gauss map of such a surface sweeps out a latitude on the unit\nsphere and so the Gaussian curvature K of the height surface must vanish. When K = 0 the surface must be locally\nisometric to the plane; the surface is either a cone, half of a cone attached to planes, planes, or the tangent developable\nsurface generated by a cylindrical helix [38]. Respectively, these four structures have disclination charge +1, +1/2, 0,\nand +1. Thus we provide a direct demonstration that it is only possible to have equally spaced layers for these three\ndefect charges.\nConclusions\n\nWe have outlined an approach to the study of topological defects in systems with broken translational invariance;\ntopological equivalence requires more than just homotopic paths. One should consider homotopy classes of smooth(er)\nmaps. Whereas the usual homotopy theory of defects would use continuous homotopy in the φ and θ components\nof the order parameter, we have argued that it is necessary to look at homotopy of φ(x) and ∇φ(x) together. Our\n\n\f6\nmethod focuses on singularities and critical points in a phase field viewed as a height function over R2 . Though the\nfundamental group of the ground state manifold can be constructed, it is known that when the loops involve both\nrotations and translations there are homotopy classes of loops implied that cannot be realized from complexions of\nthe physical system. This arises from a mismatch of the dimensionality of the manifold of ground states with the\nnumber of Goldstone modes. To remedy this, we have constructed a local map from the configurations to the ground\nstate manifold by employing Taylor series data at each point. We have shown that the homotopy theory of defects\nonly works for singularities in φ (dislocations), and not consistently for singularities in ∇φ. Though the critical\npoints in our theory behave somewhat like disclinations, they are not – as we demonstrated two +1 disclinations\ncannot be brought together. In the case of directed lines, circle-valued maps of the sort we have described above are\nequivalent [29] to closed forms [39]. For unoriented lines, that line of formalism may best be extended by considering\nquadratic differentials instead [40]. Combining these results with ours may be a way of extending our work to the\ntopology of such patterns on surfaces of nontrivial topology (rather than just the plane). The layer normal of smectics\non curved surfaces with planar topology can develop caustics [36]; extending our approach here to those systems is\ncomplicated by this additional holonomy and how it interacts with non-orientability near 1/2 disclinations.\nThough we have focused here on two-dimensional smectics and directed lines, our approach easily generalizes to\nthree-dimensional smectics which can be viewed as a height function over R3 into S 1 /Z2 . From this perspective the\ntopological equivalence of edge and screw dislocations becomes particularly vivid; within the four-dimensional space\nspanned by (x, y, z, φ) the former are helicoids in x, y, φ for a fixed z, while the latter are helicoids in x, y, z at constant\nφ. Likewise, the theory of defects in solids can be formulated as maps from R3 to T 3 /X where X is one of the 230\nthree-dimensional space groups. The dislocations will continue to correspond to cycles on T 3 while the disclinations\nwill be controlled by the critical points of these maps. Whether the study of singularities can lead to bounds on\nthe total free energy of smectic complexions is an open question as is the general set of rules for the combination of\ndislocations and disclinations.\nAcknowledgments\n\nWe acknowledge stimulating discussions with Jim Halverson, Elisabetta Matsumoto, Carl Modes, and Ari Turner.\nWe are grateful to Koenraad Schalm for bringing reference [23] to our attention. This work was supported in part by\nNSF Grants DMR05-47230 and DMR05-20020 and gifts from L.J. Bernstein and H.H. Coburn.\n\n[1] Taylor GI (1934) The mechanism of plastic deformation of crystals. Part I. Theoretical. Proc R Soc Lond A 145: 362-387.\n[2] Kosterlitz JM, Thouless DJ (1973) Ordering, metastability and phase transition in two-dimensional systems. J Phys C:\nSolid State Phys 6: 1181-1203.\n[3] Toner JT, Nelson DR (1981) Bond-orientational order, dislocation loops and melting of solids and smectic-A liquid crystals.\nPhys Rev B 24: 363-387.\n[4] Musevic I, Skarabot M, Tkalec U, Ravnik M, Zumer S (2006) Two-dimensional nematic colloidal crystals self-assembled\nby topological defects. Science 313: 954-958.\n[5] Kléman M, Michel L, Toulouse G (1977) Classification of topologically stable defects in ordered media. J Phys Lett 38:\nL195-L197.\n[6] Mermin ND (1979) The topological theory of defects in ordered media. Rev Mod Phys 51: 591-648.\n[7] Michel L (1980) Symmetry defects and broken symmetry. Configurations Hidden Symmetry. Rev Mod Phys 52: 617-651.\n[8] Trebin H-R (1982) The topology of non-unifrom media in condensed matter physics. Adv in Phys 31: 195-254.\n[9] Poénaru V, Toulouse G (1977) The crossing of defects in ordered media and the topology of three-media. J Physique 38:\n887-895.\n[10] Sethna JP, Huang M (1992) in 1991 Lectures in Complex Systems (Eds. Nagel L, Stein D, Santa Fe Institute Studies in\nthe Science of Complexity, Proc Vol XV, Addison-Wesley), pp 267-288.\n[11] Chaikin PM, Lubensky TC (1995) in Principles of Condensed Matter Physics (Cambridge University Press, Cambridge),\npp 308-315; 495-526.\n[12] Sethna JP (2008) in Entropy, Order Parameters, and Complexity (Oxford University Press, Oxford), pp 194-200.\n[13] Kléman M, Michel L (1978) Spontaneous Breaking of Euclidean Invarinace and Classification of Topologically Stable\nDefects and Configurations of Crystals and Liquid Crystals. Phys Rev Lett 40: 1387-1390.\n[14] Kléman M, Friedel J (2008) Disclinations, dislocations and continuous defects: A reappraisal. Rev Mod Phys 80: 61-115.\n[15] Poénaru V (1981) Some aspects of the theory of defects of ordered media and gauge fields related to foliations. Commun\nMath Phys 80: 127-136.\n[16] Nye JF, Berry MV (1974) Dislocations in Waves. Proc Roy Soc Lond A 336: 165-190.\n[17] Harrison C et al. (2002) Dynamics of pattern coarsening in a two-dimensional smectic system. Phys Rev E 66: 011706.\n\n\f7\n[18]\n[19]\n[20]\n[21]\n[22]\n[23]\n[24]\n\n[25]\n[26]\n\n[27]\n[28]\n[29]\n[30]\n[31]\n[32]\n[33]\n[34]\n[35]\n[36]\n[37]\n[38]\n[39]\n[40]\n\nRüppel D, Sackmann E (1983) On defects in different phases of two-dimensional lipid bilayers. J Physique 44: 1025-1034.\nKivelson SA, Fradkin E, Emery VJ (1998) Electronic liquid-crystal phases of a doped Mott insulator. Nature 393: 550-553.\nFrank FC (1958) On the theory of liquid crystals. Discuss Faraday Soc 25: 19-28.\nKurik M, Lavrentovich OD (1988) Defects in liquid crystals: homotopy theory and experimental studies. Sov Phys Usp\n31: 196-224.\nKléman M, Lavrentovich OD (2003) in Soft Matter Physics: An Introduction (Springer-Verlag, New York), pp 447-452.\nLow I, Manohar AV (2002) Spontaneously broken symmetries and Goldstone's theorem. Phys Rev Lett 88: 101602.\nThe astute reader might wonder about the restriction of paths for a spontaneously broken gauge theory where the Goldstone\nmode is also absent. There are no restrictions: in the gauged case the winding is not a non-trivial loop in a ground state\nmanifold connecting equivalent but distinct ground states, but rather a winding on a gauge orbit connecting different\nrepresentations of the same physical state.\nHere and throughout ∇ acts on the two-dimensional xy-plane.\nMore precisely we are considering the n-jet of the configuration at P . Strictly speaking, for 1-jets, we should keep track of\nthe magnitude |∇φ|x=P as well. But since |∇φ| is an element of R, which is contractible, the topological behavior of this\ncomponent would be trivial. An argument of Kleman, Michel, and Toulouse [5] (suitably reinterpreted) shows that jets\nhigher than first order are not needed for a similar reason.\nGolubitsky M, Guillemin V (1973) Stable Mappings and Their Singularities (Springer-Verlag, New York).\nMilnor J (1964) Morse Theory (Princeton University Press, Princeton).\nFarber M (2004) Topology of closed one-forms, (American Mathematical Society, Providence), in particular see p. 37.\nGoresky M, MacPherson R (1988) Stratified Morse Theory (Springer-Verlag, New York).\nBerry MV (1981) in Physics of Defects, eds Balian R, Kleman M, Poirier J-P (North-Holland, Amsterdam), pp 453-549.\nNote that although the branch point of a helicoid is quite apparent when viewed in three dimensions, in any given slice of\nit, the branch point is not apparent since the layers all remain smooth, see particularly, images in [16].\nThere may be other types of deformations which we choose to exclude due to energetic or other physical concerns. For\ninstance, it might be convenient to consider deformations up to those which preserve the number of layers, which would\nprevent us from pushing the surfaces in the vertical direction.\nHalperin BI, Nelson DR (1978) Theory of Two-Dimensional Melting. Phys Rev Lett 41: 121-124.\nColding TH, Minicozzi WP, II (2006) Shapes of Embedded Minimal Surfaces. Proc Natl Acad Sci USA 88: 11106-11111.\nSantangelo CD, Vitelli V, Kamien RD, Nelson DR (2007) Geometric Theory of Columnar Phases on Curved Substrates.\nPhys Rev Lett 99: 017801.\nWillmore T (1965) Note on Embedded Surfaces. Anal Stunt ale Univ Iasi Sect I a Math 11: 493-496.\nNistor AI (2009) Certain Constant Angle Surfaces Constructed on Curves. arXiv:0904.1475v1 [math.DG].\nXing X (2008) Topology and Geometry of Smectic Order on Compact Curved Substrates. arXiv:0806.2409v2 [condmat.soft].\nStrebel K (1984) Quadratic differentials (Springer-Verlag, New York).\n\n\f8\n\nFIG. 1: Directed lines in the plane. The top row shows the layers derived from slicing the surface shown in the bottom row at\ninteger values of the height, i.e. taking level sets. Red dots indicate the positions of branch points and blue dots indicate the\npositions of -1 index critical points (saddle point). (a) ground state (b) dislocation / helicoid, (c) two dislocations, note the\ncylindrical \"hole\" puncturing the planes, reminiscent of Riemann's minimal surface.\n\n\f9\n\nFIG. 2: Examples of two-dimensional smectic configurations. The top row shows the layers derived from slicing the surface\nshown in the bottom row at integer values of the height, i.e. taking level sets. (a) ground state. Note the two sets of planes\narising from the φ → −φ symmetry. (b) +1/2 index disclination. (c) −1/2 index disclination. These two unoriented singularities\njoin the two sets of planes, so that one can no longer orient the layers as in Figure 1.\n\nFIG. 3: Disclination dipoles in smectics as examples of more complicated structures. (a) a +1/2 and −1/2 disclination pair\nforming a dislocation. For (b) and (c), the top row shows the layers derived from slicing the surface shown in the bottom row\nat integer values of the height, i.e. taking level sets. (b) pincement, formed from a disclination dipole where the singular points\nlie at the same height. (c) dislocation, also formed from a disclination dipole, but with the singular points at different heights.\n(d) a cutaway view of the helicoid sitting inside the dislocation.\n\n\f"}