{"id": "http://arxiv.org/abs/1007.4511v2", "guidislink": true, "updated": "2011-06-17T19:14:54Z", "updated_parsed": [2011, 6, 17, 19, 14, 54, 4, 168, 0], "published": "2010-07-26T17:33:06Z", "published_parsed": [2010, 7, 26, 17, 33, 6, 0, 207, 0], "title": "Fiber transport of spatially entangled photons", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1007.2188%2C1007.2561%2C1007.0901%2C1007.0830%2C1007.0971%2C1007.0092%2C1007.1673%2C1007.3712%2C1007.0909%2C1007.0713%2C1007.5050%2C1007.0315%2C1007.2459%2C1007.4712%2C1007.1777%2C1007.1028%2C1007.1530%2C1007.5262%2C1007.2644%2C1007.3163%2C1007.3619%2C1007.3502%2C1007.3286%2C1007.3223%2C1007.3808%2C1007.1134%2C1007.3485%2C1007.4450%2C1007.3779%2C1007.2570%2C1007.1404%2C1007.4511%2C1007.2285%2C1007.4101%2C1007.2581%2C1007.1436%2C1007.5211%2C1007.4142%2C1007.2959%2C1007.4367%2C1007.2222%2C1007.2912%2C1007.5072%2C1007.5060%2C1007.3563%2C1007.2264%2C1007.0867%2C1007.2113%2C1007.4269%2C1007.5406%2C1007.1746%2C1007.1144%2C1007.4133%2C1007.4293%2C1007.2467%2C1007.4016%2C1007.1450%2C1007.4064%2C1007.4673%2C1007.5011%2C1007.1374%2C1007.1720%2C1007.5444%2C1007.2723%2C1007.2875%2C1007.2789%2C1007.3775%2C1007.1794%2C1007.1521%2C1007.2873%2C1007.3198%2C1007.0309%2C1007.0763%2C1007.5119%2C1007.3277%2C1007.3701%2C1007.0235%2C1007.2445%2C1007.4785%2C1007.0998%2C1007.0338%2C1007.2256%2C1007.5250%2C1007.0143%2C1007.4183%2C1007.1580%2C1007.0291%2C1007.3374%2C1007.3226%2C1007.1827%2C1007.2393%2C1007.0699%2C1007.1513%2C1007.4068%2C1007.4192%2C1007.4941%2C1007.5249%2C1007.5404%2C1007.2602%2C1007.2621%2C1007.2243&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Fiber transport of spatially entangled photons"}, "summary": "Entanglement in the spatial degrees of freedom of photons is an interesting\nresource for quantum information. For practical distribution of such entangled\nphotons it is desireable to use an optical fiber, which in this case has to\nsupport multiple transverse modes. Here we report the use of a hollow-core\nphotonic crystal fiber to transport spatially entangled qubits.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1007.2188%2C1007.2561%2C1007.0901%2C1007.0830%2C1007.0971%2C1007.0092%2C1007.1673%2C1007.3712%2C1007.0909%2C1007.0713%2C1007.5050%2C1007.0315%2C1007.2459%2C1007.4712%2C1007.1777%2C1007.1028%2C1007.1530%2C1007.5262%2C1007.2644%2C1007.3163%2C1007.3619%2C1007.3502%2C1007.3286%2C1007.3223%2C1007.3808%2C1007.1134%2C1007.3485%2C1007.4450%2C1007.3779%2C1007.2570%2C1007.1404%2C1007.4511%2C1007.2285%2C1007.4101%2C1007.2581%2C1007.1436%2C1007.5211%2C1007.4142%2C1007.2959%2C1007.4367%2C1007.2222%2C1007.2912%2C1007.5072%2C1007.5060%2C1007.3563%2C1007.2264%2C1007.0867%2C1007.2113%2C1007.4269%2C1007.5406%2C1007.1746%2C1007.1144%2C1007.4133%2C1007.4293%2C1007.2467%2C1007.4016%2C1007.1450%2C1007.4064%2C1007.4673%2C1007.5011%2C1007.1374%2C1007.1720%2C1007.5444%2C1007.2723%2C1007.2875%2C1007.2789%2C1007.3775%2C1007.1794%2C1007.1521%2C1007.2873%2C1007.3198%2C1007.0309%2C1007.0763%2C1007.5119%2C1007.3277%2C1007.3701%2C1007.0235%2C1007.2445%2C1007.4785%2C1007.0998%2C1007.0338%2C1007.2256%2C1007.5250%2C1007.0143%2C1007.4183%2C1007.1580%2C1007.0291%2C1007.3374%2C1007.3226%2C1007.1827%2C1007.2393%2C1007.0699%2C1007.1513%2C1007.4068%2C1007.4192%2C1007.4941%2C1007.5249%2C1007.5404%2C1007.2602%2C1007.2621%2C1007.2243&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Entanglement in the spatial degrees of freedom of photons is an interesting\nresource for quantum information. For practical distribution of such entangled\nphotons it is desireable to use an optical fiber, which in this case has to\nsupport multiple transverse modes. Here we report the use of a hollow-core\nphotonic crystal fiber to transport spatially entangled qubits."}, "authors": ["W. Löffler", "T. G. Euser", "E. R. Eliel", "M. Scharrer", "P. St. J. Russell", "J. P. Woerdman"], "author_detail": {"name": "J. P. Woerdman"}, "author": "J. P. Woerdman", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevLett.106.240505", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1007.4511v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1007.4511v2", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "4 pages, 4 figures", "arxiv_primary_category": {"term": "quant-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "quant-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "physics.optics", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1007.4511v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1007.4511v2", "journal_reference": "Phys. Rev. Lett. 106, 240505 (2011)", "doi": "10.1103/PhysRevLett.106.240505", "fulltext": "Fiber transport of spatially entangled photons\nW. Löffler,1, ∗ T. G. Euser,2 E. R. Eliel,1 M. Scharrer,2 P. St.J. Russell,2 and J. P. Woerdman1\n2\n\n1\nHuygens Laboratory, Leiden University, P.O. Box 9504, 2300 RA Leiden, The Netherlands\nMax Planck Institute for the Science of Light, Günther-Scharowsky-Str. 1, 91058 Erlangen, Germany\n\nEntanglement in the spatial degrees of freedom of photons is an interesting resource for quantum\ninformation. For practical distribution of such entangled photons it is desireable to use an optical\nfiber, which in this case has to support multiple transverse modes. Here we report the use of a\nhollow-core photonic crystal fiber to transport spatially entangled qubits.\n\narXiv:1007.4511v2 [quant-ph] 17 Jun 2011\n\nPACS numbers:\n\nThe non-classical correlations of two entangled photons enable quantum communication and cryptography.\nTraditionally, polarization entanglement is utilized; however, polarization is a two-dimensional degree of freedom only (qubit). Higher-dimensional entangled systems\nshow promise [1, 2], because more entangled degrees of\nfreedom per particle imply stronger non-classical correlations. Examples are the violation of a Bell-type inequality [3, 4] and demonstration of the quantum coin\ntossing protocol [5]. The photon's temporal, frequency\nand spatial degrees of freedom give access to such highdimensional entanglement; enabling temporal entanglement [4, 6, 7], frequency entanglement [8, 9], and spatial entanglement [3, 10–16], respectively. These degrees\nof freedom are intrinsically continuous; after appropriate discretization, qudits of arbitrary dimension d can be\ndefined. Another approach for multi-dimensional entanglement is the combination of different degrees of freedom\n[17–20].\nOptical-fiber transport of entangled photons allows\nnew possibilities in applied quantum information; so far\nthis has been realized for photons entangled in polarization [21], time [22] and frequency [8, 9], but not for spatial entanglement. To transport spatially entangled photons through a fiber, this must obviously support multiple transverse modes. However, this presents a challenge\nsince conventional multimode fibers suffer from strong\nintermodal coupling which tends to destroy the fragile\nquantum correlations carried by the spatially entangled\nstate. Often this happens within a few mm of propagation [23][39]. It is thus imperative to choose a type of\nfiber where these decohering effects are minimal or absent, i.e., to be as close as possible to free-space propagation. Therefore, the natural choice for fiber transport of\nspatially entangled photons is to use a hollow-core fiber,\nwhere the light is guided essentially in air (see inset Fig.\n1b). Here we demonstrate that this approach is successful.\nWe use a hollow-core photonic crystal fiber (HC-PCF)\n[24, 25] with a kagomé-style cladding [26–28], see Fig. 1b.\nThe cladding lattice is formed from sub-μm thick fused\nsilica glass membranes, the central hollow core being created by removing a few unit cells. Our HC-PCF has a relatively large core diameter, namely 25 μm, and does not\nsupport bound modes because the cladding does not pos-\n\nFigure 1: (Color online) (a) Experimental setup. (b) Electron\nmicrograph of the cross-section of the HC-PCF. The core diameter is 25 μm, which results in an half opening angle of the\nfundamental mode of 44 mrad. The inset shows a near-field\noptical image (same scale) of the core area, acquired using incoherent (800±10 nm) illumination, this shows approximately\ncircular mode confinement.\n\nsess a photonic band gap and the negative index difference between core and cladding rules out the possibility of\ntotal internal reflection. Many Mie-like resonances exist\nin the core, each with a different axial wavevector component. In some respects these modes are similar to the\nleaky modes of hollow cylindrical capillary waveguides\n[29], with an important difference: with appropriate design the fundamental mode of the HC-PCF can be guided\nwith losses as much as 100 times lower than in a capillary\nof the same diameter [27]. It has a transverse intensity\nprofile that approximately follows a squared J0 Bessel\nfunction, its first zero coinciding with the core boundary. The losses are larger for higher-order modes and\nthis limits effectively the number of propagating modes.\nIn the experiments reported here, 3 modes are present\nafter propagation along 30 cm of our kagomé HC-PCF.\nThese modes have large overlap with the 3 lowest-order\nfree-space paraxial Hermite-Gaussian modes (or superpositions thereof). In the Hermite-Gauss basis HGm,n\nwith the polynomial index m and n in x and y, these\nare the HG0,0 , HG1,0 , and HG0,1 modes. We find experimentally that the 30 cm kagome fiber attenuates the\nfirst order modes by ≈8% compared to the fundamental\nmode, this agrees well with 0.7 dB/m or 5% as quoted in\n[28] for a similar fiber.\nIn our experiments we study the effect of fiber\ntransport on quantum correlations between two entangled qubits, where spatially entangled photons are\nproduced by spontaneous parametric downconversion\n(SPDC, type-I, collinear phase matching) [11]. The setup\n\n\f2\nis sketched in Fig. 1: The entangled two-photon state is\ngenerated in a 2 mm long periodically-poled KTP crystal by pumping it with a weakly focused (w0 = 250 μm)\n413 nm Kr+ laser beam (80 mW). The polarization state\nof the photons is not relevant here since polarization\nand spatial degrees of freedom are decoupled (paraxial\nregime). The two entangled photons are filtered spectrally (BPF, 1 nm bandwidth, centered at 826.1 nm),\nthen the photons are probabilistically separated by a\nbeam splitter, and one of them (path A) is transported\nthrough the 30 cm long HC-PCF by appropriately modematched in- and out-coupling (10x, 0.25 NA objectives).\nFor our goal it is sufficient that only one photon passes\nthrough the HC-PCF. No special care was taken to keep\nthe fiber straight; typically curves with a bending radius\nof 30 cm occurred. Both photons from a pair are then\nprojected onto separate superpositions. This is done by\nfirst sending the photons through a step phase plate [30];\nthis plate acts as a mode converter; it shifts the optical phase by π in one half of the transverse plane with\nrespect to the other half. Subsequently, we project this\nmode onto the fundamental Gaussian mode by coupling\ninto a standard single-mode fiber. This fiber is connected\nto a single-photon counter and correlated photon pairs\nare post-selected by coincidence detection (2 ns timewindow). The entangled two-photon state as produced\nby SPDC [11, 30, 31] is filtered by the \"3-mode\" HCPCF such that we deal effectively with a 3D spatially\nentangled state formed by the 3 lowest-order Gaussian\nmodes [3, 12]. The single-photon basis states for these\nmodes are {|HG0,0 i, |HG1,0 i, |HG0,1 i} in the HermiteGauss basis. Such a bipartite entangled state lives in a\nC3 ⊗C3 Hilbert space which can be explored by investigating spatial correlations in two non-identical but partly\noverlapping C2 ⊗C2 subspaces.\nAs a first step, we consider the subspace spanned by\nthe degenerate |HG1,0 i and |HG0,1 i modes. We center\nboth phase plate projectors to the single-mode detection\nfibers (∆SM F,B = ∆P P,A = 0, see Fig. 1). In the corresponding 2D Hilbert subspace, each detector projects on\nthe superposition state sin(φ) |HG1,0 i + cos(φ) |HG0,1 i,\nwhich depends on the orientation φ of the phase plate\n(= α or β for phase plate A or B, respectively, see Fig. 1a).\nThis experiment is analogous to the 2D polarizationentanglement case [32, 33] and thus, the resulting coincidence fringes are sinusoidal (Fig. 2). We also see\nanisotropic effects of the fiber: the visibility of the diagonal (±45◦ ) fringes is reduced compared to that of the\n(0◦ , 90◦ degrees) fringes. Also, mode rotation occurs\nas the fringes are slightly dephased with respect to the\nrelative orientation (α − β) of the phase plates. We attribute these effects to the broken rotational symmetry\nin the fiber: the cladding has a hexagonal symmetry; this\nweakly affects the modes since a small fraction of the optical field resides in the cladding. This leads to mode\nmixing and mode rotation; both could be avoided if one\nwere to use a circular-core concentric Bragg fiber [34].\n\nFigure 2: (Color online) Fiber transport of 2D spatially entangled photons in the degenerate case (i.e. superpositions of\nthe |HG1,0 i and |HG0,1 i states). Both mode analyzers are\nequipped with a step phase plate which can be rotated. To\nobtain a coincidence fringe, plate A is rotated, while plate B\nis kept fixed. No significant fringe is detected in the singledetector count rates.\n\nIn polarization-based Bell experiments, maximum violation happens for, e.g., (α1 , α2 , β1 , β2 ) =\n(0◦ , 45◦ , 22.5◦ , 67.5◦ ). In our case, we expect these\nangles to be different due to the detrimental effects\nmentioned above.\nIn order to find the maximum\nBell-violation angles, we plot the CHSH S-parameter\n[35] for (α1 , α2 ) = (0◦ , 45◦ ) as a function of (β1 , β2 ) (see\nFig. 3). Each pixel shows color-coded the value of the\nS-parameter for one set of angles; regions with S > 2\nare colored white. The overall pattern of Fig. 3 is very\nsimilar to the ideal case; but the peaks are shifted. A numerically search for the maximum Bell violation results\nin the angles (α1 , α2 , β1 , β2 ) = (0◦ , −45◦ , 270◦ , 150◦ ),\nwhere S = 2.17 ± 0.04. The uncertainty (standard\ndeviation) of S is calculated from the uncertainty ∆N\nin the coincidence counts N using Gaussian propagation\nof uncertainty. For this 2D subspace we violate the Bell\ninequality by 4 standard deviations; thus proving that\nspatial entanglement of the degenerate | HG1,0 i and\n|HG0,1 i states survives fiber propagation.\nAs the second step, we study the 2D subspace spanned\nby the non-degenerate states |HG0,0 i and |HG1,0 i. In\nthis case it is necessary to consider first the intermodal\ndispersion of the relevant modes in the fiber, i.e., the\nrelative propagation constants of the HG0,0 and HG1,0\nmodes. We measure this by launching a well-known (classical) coherent superposition of these modes into the fiber\nand observe, as a function of wavelength, the near-field\nintensity at the fiber exit. From the mode beating we\ndetermine the intermodal dispersion [36] to be 1.5 ps/m.\nThis agrees well with the calculated value of 1.6 ps/m\nobtained by approximating the HC-PCF by a hollow dielectric capillary [29] (with r = 12.5 μm, λ = 826 nm,\nand n = 1.45) [40]. Although this intermodal dispersion\n\n\f3\n\nFigure 3: Parameter scan of the CHSH S-parameter as a function of (β1 , β2 ) for fixed (α1 , α2 ). Each pixel shows colorcoded S(α1 = 0◦ , α2 = −45◦ , β1 , β2 ), which is calculated\nusing 16 different coincidence count measurements at different orientations of the phase plates. Regions where the CHSH\ninequality (S ≤ 2) is violated are colored white.\n\nis small, we need to limit the bandwidth of the downconverted photons, in order to preserve the coherence of\nthe non-degenerate quantum state; we use 1-nm bandwidth filters in the experiments with the 30-cm long HCPCF.\nIn this non-degenerate case we have performed a quantum interference experiment somewhat similar to that of\nMair et al. [11]: In analyzer A, we no longer center the\nphase plate but give it a transverse (i.e. in-plane) offset\n∆P P,A with respect to the single-mode fiber (Fig. 1a).\nThis detector configuration projects the incoming photon onto a superposition state a0 |HG0,0 i + a1 |HG1,0 i.\nThe intensity distribution corresponding to this superposition carries a nodal line. This is probed non-locally\nby using analyzer B as a Gaussian probe, i.e. we remove\nits phase plate. For a certain offset ∆P P,A , we scan the\nfundamental-mode analyzer B (∆SM F,B ) transversely to\nthe optical axis and normal to the edge of the phase plate\nof analyzer A. We expect that the coincidence fringe resembles the coherent superposition onto which photon A\nis projected, and that the dip in this fringe moves proportionally to the phase plate A offset ∆P P,A . This nonlocal\nshift is clearly visible in our experimental results shown\nin Fig. 4: We observe a dip in the coincidence counts\n(normalized to the single counts) at twice the phase step\noffset ∆P P,A , in agreement with theory (the beam waist\nat the phase plates is w0 = 0.8 mm). Considering that\nthe theory does not include mode-dependent attenuation\nor intermodal dispersion of the HG0,0 and HG1,0 modes\nin the fiber, the overall correspondence with the experimental data is good. This demonstration of nonlocality\nis obviously not equivalent to a Bell test of entanglement,\nbut can be seen as a first step in that direction.\nFinally, we discuss briefly the key issues in fiber trans-\n\nFigure 4: Fiber transport of a non-degenerate superposition\nof photons modes. Analyzer A projects on a superposition\nof |HG0,0 i and |HG1,0 i, analyzer B (Gaussian probe) scans\nnormal to the phase plate step of analyzer A. The dip in\ncoincidence counts (arrow), is directly proportional to the\nphase plate displacement ∆P P,A . The experimental coincidence count rate is normalized to the single-detector count\nrate, and the theoretical curves (through lines) are scaled vertically with the same constant to match the data. The visibility of the three curves is 76 %, 74 % and 55 % (from top to\nbottom). We define the visibility here as (MAX–MIN)/(MAX\n+ MIN) where MAX is the average of the count rates in the\ntwo peaks that are adjacent to the dip, and MIN is the count\nrate in the dip.\n\nport of multi-mode quantum superpositions: intermodal\ndispersion and intermodal mixing. Intermodal dispersion\nleads to decoherence of the quantum superposition during fiber transport, this must be small compared to the\nphoton bandwidth. Therefore, the spread in the transverse wavevector k⊥ of the modes should be small. This is\nthe case for weakly confining fibers with a large core and\nconsequently large mode area (compared to the wavelength). Additionally, one could employ a special subset\nof the modes with nearly equal propagation constants; for\nlarge-core fibers (with negligible diffraction corrections)\nthese are the modes within one mode order m + n in\nthe case of HGm,n modes [37]. However, the future applicability of fiber transport of spatially entangled photons will be ultimately limited by unavoidable fabrication tolerances as well as externally applied strain, stress\nand bends; this does eventually lead to intermodal mixing. Due to geometric reasons a large-diameter mode,\nas appearing in large-core fibers, is less sensitive to perturbations. Since perturbations act via local refractiveindex changes, it is advantageous, as stressed in the introduction, to use a hollow-core fiber to transport the\nlight essentially in air, so as to minimize these effects.\nSince index-guidance is impossible in hollow-core fibers,\nguidance in such fibers must be preferably provided by\na photonic bandgap of the cladding. Our kagomé-lattice\nfiber does not provide such lossless guiding and is there-\n\n\f4\nfore not ideal; mode dependent losses may lead to nonorthogonality of the modes and thus to mode mixing [38].\nIt is encouraging that this potential problem has not prevented the experiments reported in this Letter.\nIn conclusion, we have shown the first experimental demonstration of the transport of spatially entangled photons through an optical fiber. In the degenerate subspace of the | HG1,0 i and | HG0,1 i states, we\ndemonstrated entanglement of the fiber-transported spatial qubit by Bell inequality violation. Although this entanglement is demonstrated only in the context of a degenerate qubit Hilbert space, given the known and previously demonstrated potential of spatial modes to provide higher-dimensional entanglement (d>2) [3, 11–13]\nour results can be regarded as a proof-of-principle that\nthe transport of higher-dimensional (d>2) spatially entangled photons through fibers might be possible in future. Our demonstration of quantum interference in a\nnondegenerate 2D Hilbert space (Fig. 4) is a first step in\nthis direction.\nWe acknowledge fruitful discussions with M. P. van Exter and G. Nienhuis and financial support by NWO and\nthe EU FET-Open grant HIDEAS (FP7-ICT- 221906).\n\nElectronic address: loeffler@physics.leidenuniv.nl\n[1] D. Collins, N. Gisin, N. Linden, S. Massar,\nand\nS. Popescu, Phys. Rev. Lett., 88, 040404 (2002).\n[2] M. Fujiwara, M. Takeoka, J. Mizuno, and M. Sasaki,\nPhys. Rev. Lett., 90, 167906 (2003).\n[3] A. Vaziri, G. Weihs, and A. Zeilinger, Phys. Rev. Lett.,\n89, 240401 (2002).\n[4] R. T. Thew, A. Acín, H. Zbinden, and N. Gisin, Phys.\nRev. Lett., 93, 010503 (2004).\n[5] G. Molina-Terriza, A. Vaziri, R. Ursin, and A. Zeilinger,\nPhys. Rev. Lett., 94, 040501 (2005).\n[6] J. D. Franson, Phys. Rev. Lett., 62, 2205 (1989).\n[7] H. D. Riedmatten, I. Marcikic, H. Zbinden, and N. Gisin,\nQuant. Inf. Comp., 2, 425 (2002).\n[8] S. Ramelow, L. Ratschbacher, A. Fedrizzi, N. K. Langford, and A. Zeilinger, Phys. Rev. Lett., 103, 253601\n(2009).\n[9] L. Olislager, J. Cussey, A. T. Nguyen, P. Emplit, S. Massar, J.-M. Merolla, and K. P. Huy, Phys. Rev. A, 82,\n013804 (2010).\n[10] J. G. Rarity and P. R. Tapster, Phys. Rev. Lett., 64,\n2495 (1990).\n[11] A. Mair, A. Vaziri, G. Weihs, and A. Zeilinger, Nature,\n412, 313 (2001).\n[12] N. K. Langford, R. B. Dalton, M. D. Harvey, J. L.\nO'Brien, G. J. Pryde, A. Gilchrist, S. D. Bartlett, and\nA. G. White, Phys. Rev. Lett., 93, 053601 (2004).\n[13] M. N. O'Sullivan-Hale, I. Ali Khan, R. W. Boyd, and\nJ. C. Howell, Phys. Rev. Lett., 94, 220501 (2005).\n[14] S. S. R. Oemrawsingh, X. Ma, D. Voigt, A. Aiello, E. R.\nEliel, G. W. 't Hooft, and J. P. Woerdman, Phys. Rev.\nLett., 95, 240501 (2005).\n[15] B. Jack, J. Leach, J. Romero, S. Franke-Arnold,\nM. Ritsch-Marte, S. M. Barnett, and M. J. Padgett,\n∗\n\nPhys. Rev. Lett., 103, 083602 (2009).\n[16] G. Taguchi, T. Dougakiuchi, M. Iinuma, H. F. Hofmann,\nand Y. Kadoya, Phys. Rev. A, 80, 062102 (2009).\n[17] D. V. Strekalov, T. B. Pittman, A. V. Sergienko, Y. H.\nShih, and P. G. Kwiat, Phys. Rev. A, 54, R1 (1996).\n[18] J. T. Barreiro, N. K. Langford, N. A. Peters, and P. G.\nKwiat, Phys. Rev. Lett., 95, 260501 (2005).\n[19] T. Yang, Q. Zhang, J. Zhang, J. Yin, Z. Zhao,\nM. Żukowski, Z.-B. Chen, and J.-W. Pan, Phys. Rev.\nLett., 95, 240406 (2005).\n[20] C. Cinelli, M. Barbieri, R. Perris, P. Mataloni, and F. D.\nMartini, Phys. Rev. Lett., 95, 240405 (2005).\n[21] A. Poppe, A. Fedrizzi, R. Ursin, H. Böhm, T. Lörunser,\nO. Maurhardt, M. Peev, M. Suda, C. Kurtsiefer, H. Weinfurter, T. Jennewein, and A. Zeilinger, Opt. Express,\n12, 3865 (2004).\n[22] I. Marcikic, H. de Riedmatten, W. Tittel, H. Zbinden,\nM. Legré, and N. Gisin, Phys. Rev. Lett., 93, 180502\n(2004).\n[23] A. Lucesoli and T. Rozzi, Appl. Opt., 46, 3031 (2007).\n[24] J. C. Knight, J. Broeng, T. A. Birks, and P. S. J. Russell,\nScience, 282, 1476 (1998).\n[25] O. Shapira, A. F. Abouraddy, Q. Hu, D. Shemuly, J. D.\nJoannopoulos, and Y. Fink, Opt. Express, 18, 12622\n(2010).\n[26] F. Benabid, J. C. Knight, G. Antonopoulos, and P. S. J.\nRussell, Science, 298, 399 (2002).\n[27] F. Couny, F. Benabid, and P. S. Light, Opt. Lett., 31,\n3574 (2006).\n[28] T. G. Euser, G. Whyte, M. Scharrer, J. S. Y. Chen,\nA. Abdolvand, J. Nold, C. F. Kaminski, and P. S. J.\nRussell, Opt. Express, 16, 17972 (2008).\n[29] E. A. J. Marcatili and R. A. Schmeltzer, Bell Syst. Tech.\nJ., 43, 1783 (1964).\n[30] J. B. Pors, S. S. R. Oemrawsingh, A. Aiello, M. P. van\nExter, E. R. Eliel, G. W. 't Hooft, and J. P. Woerdman,\nPhys. Rev. Lett., 101, 120502 (2008).\n[31] S. P. Walborn, S. Pádua, and C. H. Monken, Phys. Rev.\nA, 71, 053812 (2005).\n[32] P. G. Kwiat, K. Mattle, H. Weinfurter, A. Zeilinger,\nA. V. Sergienko, and Y. Shih, Phys. Rev. Lett., 75, 4337\n(1995).\n[33] M. J. Padgett and J. Courtial, Opt. Lett., 24, 430 (1999).\n[34] S. Johnson, M. Ibanescu, M. Skorobogatiy, O. Weisberg,\nT. Engeness, M. Soljacic, S. Jacobs, J. Joannopoulos,\nand Y. Fink, Opt. Express, 9, 748 (2001).\n[35] J. F. Clauser, M. A. Horne, A. Shimony, and R. A. Holt,\nPhys. Rev. Lett., 23, 880 (1969).\n[36] P. Hlubina, J. Mod. Opt., 42, 2385 (1995).\n[37] Y. Ma, Y. Sych, G. Onishchukov, S. Ramachandran,\nU. Peschel, B. Schmauss, and G. Leuchs, Appl. Phys.\nB, 96, 345 (2009).\n[38] A. E. Siegman, Phys. Rev. A, 39, 1253 (1989).\n[39] Also our own experiments with conventional multi-mode\nfibers show decoherence after a few millimeters.\n[40] The intermodal dispersion of our kagomé HC-PCF is accordingly much lower than that of conventional indexguided multi-mode fibers (around 50 ps/m)\n\n\f"}