{"id": "http://arxiv.org/abs/1110.1256v1", "guidislink": true, "updated": "2011-10-06T13:28:55Z", "updated_parsed": [2011, 10, 6, 13, 28, 55, 3, 279, 0], "published": "2011-10-06T13:28:55Z", "published_parsed": [2011, 10, 6, 13, 28, 55, 3, 279, 0], "title": "Driving Rydberg-Rydberg transitions from a co-planar microwave waveguide", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1110.0645%2C1110.5113%2C1110.0397%2C1110.1672%2C1110.3386%2C1110.1031%2C1110.0108%2C1110.1325%2C1110.4262%2C1110.1836%2C1110.4574%2C1110.3418%2C1110.3572%2C1110.0575%2C1110.0406%2C1110.0126%2C1110.1950%2C1110.3718%2C1110.1730%2C1110.0659%2C1110.6632%2C1110.0840%2C1110.6115%2C1110.0975%2C1110.5041%2C1110.2567%2C1110.0158%2C1110.0828%2C1110.1896%2C1110.2607%2C1110.4946%2C1110.0832%2C1110.1323%2C1110.5311%2C1110.5230%2C1110.2350%2C1110.6214%2C1110.6267%2C1110.1588%2C1110.1724%2C1110.3164%2C1110.4869%2C1110.0101%2C1110.5980%2C1110.0477%2C1110.2735%2C1110.4357%2C1110.4580%2C1110.1714%2C1110.5515%2C1110.5295%2C1110.1256%2C1110.4826%2C1110.3316%2C1110.3280%2C1110.3492%2C1110.3385%2C1110.6808%2C1110.4666%2C1110.5941%2C1110.5927%2C1110.3974%2C1110.5904%2C1110.4240%2C1110.5403%2C1110.3453%2C1110.3756%2C1110.6257%2C1110.4561%2C1110.6837%2C1110.4373%2C1110.5650%2C1110.5406%2C1110.0710%2C1110.4974%2C1110.0723%2C1110.1060%2C1110.2405%2C1110.5051%2C1110.4639%2C1110.5029%2C1110.5399%2C1110.1234%2C1110.5760%2C1110.1003%2C1110.1260%2C1110.2878%2C1110.2158%2C1110.5929%2C1110.0106%2C1110.1471%2C1110.6000%2C1110.5527%2C1110.6561%2C1110.3200%2C1110.4062%2C1110.2256%2C1110.2711%2C1110.5746%2C1110.3310%2C1110.5586&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Driving Rydberg-Rydberg transitions from a co-planar microwave waveguide"}, "summary": "The coherent interaction between ensembles of helium Rydberg atoms and\nmicrowave fields in the vicinity of a solid-state co-planar waveguide is\nreported. Rydberg-Rydberg transitions, at frequencies between 25 GHz and 38\nGHz, have been studied for states with principal quantum numbers in the range\n30 - 35 by selective electric-field ionization. An experimental apparatus\ncooled to 100 K was used to reduce effects of blackbody radiation.\nInhomogeneous, stray electric fields emanating from the surface of the\nwaveguide have been characterized in frequency- and time-resolved measurements\nand coherence times of the Rydberg atoms on the order of 250 ns have been\ndetermined.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1110.0645%2C1110.5113%2C1110.0397%2C1110.1672%2C1110.3386%2C1110.1031%2C1110.0108%2C1110.1325%2C1110.4262%2C1110.1836%2C1110.4574%2C1110.3418%2C1110.3572%2C1110.0575%2C1110.0406%2C1110.0126%2C1110.1950%2C1110.3718%2C1110.1730%2C1110.0659%2C1110.6632%2C1110.0840%2C1110.6115%2C1110.0975%2C1110.5041%2C1110.2567%2C1110.0158%2C1110.0828%2C1110.1896%2C1110.2607%2C1110.4946%2C1110.0832%2C1110.1323%2C1110.5311%2C1110.5230%2C1110.2350%2C1110.6214%2C1110.6267%2C1110.1588%2C1110.1724%2C1110.3164%2C1110.4869%2C1110.0101%2C1110.5980%2C1110.0477%2C1110.2735%2C1110.4357%2C1110.4580%2C1110.1714%2C1110.5515%2C1110.5295%2C1110.1256%2C1110.4826%2C1110.3316%2C1110.3280%2C1110.3492%2C1110.3385%2C1110.6808%2C1110.4666%2C1110.5941%2C1110.5927%2C1110.3974%2C1110.5904%2C1110.4240%2C1110.5403%2C1110.3453%2C1110.3756%2C1110.6257%2C1110.4561%2C1110.6837%2C1110.4373%2C1110.5650%2C1110.5406%2C1110.0710%2C1110.4974%2C1110.0723%2C1110.1060%2C1110.2405%2C1110.5051%2C1110.4639%2C1110.5029%2C1110.5399%2C1110.1234%2C1110.5760%2C1110.1003%2C1110.1260%2C1110.2878%2C1110.2158%2C1110.5929%2C1110.0106%2C1110.1471%2C1110.6000%2C1110.5527%2C1110.6561%2C1110.3200%2C1110.4062%2C1110.2256%2C1110.2711%2C1110.5746%2C1110.3310%2C1110.5586&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The coherent interaction between ensembles of helium Rydberg atoms and\nmicrowave fields in the vicinity of a solid-state co-planar waveguide is\nreported. Rydberg-Rydberg transitions, at frequencies between 25 GHz and 38\nGHz, have been studied for states with principal quantum numbers in the range\n30 - 35 by selective electric-field ionization. An experimental apparatus\ncooled to 100 K was used to reduce effects of blackbody radiation.\nInhomogeneous, stray electric fields emanating from the surface of the\nwaveguide have been characterized in frequency- and time-resolved measurements\nand coherence times of the Rydberg atoms on the order of 250 ns have been\ndetermined."}, "authors": ["S. D. Hogan", "J. A. Agner", "F. Merkt", "T. Thiele", "S. Filipp", "A. Wallraff"], "author_detail": {"name": "A. Wallraff"}, "author": "A. Wallraff", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevLett.108.063004", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1110.1256v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1110.1256v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "5 pages, 5 figures", "arxiv_primary_category": {"term": "physics.atom-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "physics.atom-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "quant-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1110.1256v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1110.1256v1", "journal_reference": "Phys. Rev. Lett. 108, 063004 (2012)", "doi": "10.1103/PhysRevLett.108.063004", "fulltext": "Driving Rydberg-Rydberg transitions from a co-planar microwave waveguide\nS. D. Hogan, J. A. Agner, and F. Merkt\nLaboratorium für Physikalische Chemie, ETH Zürich, CH-8093 Zürich, Switzerland\n\nT. Thiele, S. Filipp, and A. Wallraff\n\narXiv:1110.1256v1 [physics.atom-ph] 6 Oct 2011\n\nDepartment of Physics, ETH Zürich, CH-8093 Zürich, Switzerland\n(Dated: October 2, 2018)\nThe coherent interaction between ensembles of helium Rydberg atoms and microwave fields in the\nvicinity of a solid-state co-planar waveguide is reported. Rydberg-Rydberg transitions, at frequencies\nbetween 25 GHz and 38 GHz, have been studied for states with principal quantum numbers in the\nrange 30 – 35 by selective electric-field ionization. An experimental apparatus cooled to 100 K was\nused to reduce effects of blackbody radiation. Inhomogeneous, stray electric fields emanating from\nthe surface of the waveguide have been characterized in frequency- and time-resolved measurements\nand coherence times of the Rydberg atoms on the order of 250 ns have been determined.\nPACS numbers:\n\nAtoms and molecules in Rydberg states of high principal quantum number n are very sensitive to lowfrequency electromagnetic fields. This sensitivity arises\nbecause (i) the energy differences between states for\nwhich |∆n| = 1 scale with n−3 , corresponding to frequencies in the millimeter-wave or microwave domains above\nn = 25, and (ii) the dipole moments for these |∆n| = 1\ntransitions scale with n2 and are approximately equal to\nn2 e a0 . As a result, Rydberg atoms have been exploited\nextensively over the last three decades in studies of population transfer [1, 2] and ionization [3, 4] by blackbody\nradiation. In the context of cavity quantum electrodynamics (QED), they have been used to study the modification of spontaneous emission rates of atoms surrounded\nby cavities [5, 6], in the single-atom maser [7], in tests of\nthe Jaynes-Cummings model [8], and in quantum nondemolition measurements of single photons confined in\nhigh-quality-factor microwave cavities [9].\nCavity QED effects have also been studied at microwave frequencies in solid-state superconducting circuits, e.g., using co-planar, superconducting microwave\nresonators coupled to superconducting qubits, in a variant of cavity QED known as circuit QED [10, 11]. With\nthe aim of eventually studying QED effects at microwave\nfrequencies at a vacuum–solid-state boundary, we report\nhere the coherent interaction of an ensemble of helium\nRydberg atoms with microwave fields in a solid-state coplanar waveguide. Hybrid approaches of this kind to cavity QED are relevant to quantum information processing,\nwhere fast gate operations are expected from superconducting circuits and long-coherence-time quantum memories from Rydberg atoms [12, 13].\nThe possibility to carry out microwave spectroscopic\nmeasurements of Rydberg atoms or molecules located\nclose to surfaces also opens up a new way to study\nRydberg-atom–surface interactions. Of interest are,\ne.g., (i) interactions with the electric fields arising from\nsurface adsorbates or patch potentials [14–16], (ii) dipole-\n\n(a)\n\nHeat shield\n\nMCP\n\nCollimator\n\nFilament\n\nField-ionization\nPCB\nAnode\n\nPulsed valve\n\n(b)\n\nPhotoexcitation\n\nUV laser\n\ny\nx\n\nz\n\n10 mm\n\ny\nx\n\nz\n\nFIG. 1: (Color online) (a) Schematic diagram of the experimental apparatus (not to scale). (b) Photograph of the PCB\ncontaining the co-planar microwave waveguide.\n\ndipole interactions between Rydberg atoms and their image dipoles in the surface [17, 18], and (iii) the prototypical process of charge transfer between a Rydberg atom\nand the conduction band of the surface leading to ionization [19–21].\nThe experimental method presented here is based on\ncoherent coupling of Rydberg atoms to microwave fields\nin the vicinity of solid-state co-planar waveguides and\nallows the characterization of Rydberg-atom–surface interactions. This represents an initial step toward a new\nhybrid approach to cavity QED.\nA schematic diagram of the apparatus used in the experiments is presented in Fig. 1(a). A pulsed supersonic\nbeam of metastable helium atoms, propagating in the\n\n\fDetuning from 33p state (GHz)\n\n60\n40\n20\n\n33p\n\n0\n\nn = 32\n\n-20\n\n33s\n\n-40\n-60\n\n0\n\n5\n\n10\n\n15\n\n20\n\nElectric field (V/cm)\n\n25\n\n30\n\nFIG. 2: (Color online) Stark map of singlet He Rydberg states\nin the vicinity of n = 32.\n\npositive z-direction at a velocity of 1720 m s−1 , is prepared in an electrical discharge at the exit of a pulsed\nvalve. The discharge takes place between a high-voltage\nanode (+250 V) positioned outside the valve and the\ngrounded metallic poppet of the valve. A tungsten filament is used to seed the discharge with electrons, enhancing its stability and minimizing the translational\ntemperature of the resulting beam [22]. The choice of\nhelium atoms for these experiments is based on the desires to minimize changes in stray electric fields which can\narise from the surface adsorption of other more polarizable atoms or molecules, and to avoid condensation upon\ncooling the central interaction region of the apparatus.\nAfter passing through a skimmer, the atomic beam enters the interaction region which is cooled to 100 K to reduce effects of blackbody radiation. This region contains\ntwo pairs of cylindrical electrodes aligned with the axis of\nthe beam. A printed circuit board (PCB) [Fig. 1(b)] with\nthe co-planar microwave waveguide is located between\nthese electrodes. Its surface is parallel to the beam propagation axis. At the midpoint between the first pair of\nelectrodes in Fig. 1(a), singlet 1s2s 1 S0 helium atoms are\nexcited to np Rydberg states, in the vicinity of n = 30, in\na single-photon transition at a wavelength of ∼ 313 nm\nusing a frequency-doubled pulsed dye laser.\nThe atomic beam is collimated by a pair of slits to\nensure that the Rydberg atoms fly over the PCB within\na distance of 1 mm from the surface in the y dimension. When the atoms reach the center of the PCB, microwave pulses are applied to the co-planar waveguide to\ndrive np → ns transitions. The co-planar waveguide has\na 160 μm wide center conductor separated by 100 μm\nfrom the grounded outer region of the PCB. The 30 μm\nthick gold-coated copper surface layer of the PCB lies on\ntop of a substrate with a relative permittivity of εr = 10.\nUpon reaching the second pair of electrodes, the Rydberg\natoms are detected by state-selective electric-field ioniza-\n\nNormalized integrated electron signal (arb. unit)\n\n2\n\n3\n\n35p → 35s\n\nExperiment\nSimulation\n\n34p → 34s\n33p → 33s\n\n2\n\nνzf\n\n32p → 32s\n31p → 31s\n\n1\n\n25 MHz\n\n0\n26\n\n28\n\n30\n\n32\n\nFrequency (GHz)\n\n34\n\n36\n\n38\n\nFIG. 3: (Color online) Microwave spectra of singlet np → ns\ntransitions, in the range n = 31 − 35, for He atoms traversing the co-planar waveguide. Simulated lineshapes (red) are\noverlaid on the experimental data with the zero-field transition frequencies, νzf , indicated by arrows.\n\ntion using a slowly rising (∼ 100 V cm −1 μs−1 ) electricfield pulse. The resulting electrons are extracted toward\na microchannel-plate (MCP) detector.\nThe Stark effect in the vicinity of the singlet n = 32\nmanifold of He is depicted in Fig. 2 in the form of a Stark\nmap. This map was calculated by matrix diagonalization\nin a spherical |n `i basis, where ` is the orbital angular\nmomentum quantum number of the Rydberg electron.\nQuantum defects of 1.1397, 0.9879, 0.0021 and 0.0004\nwere used for the singlet s, p, d and f Rydberg states\nof He [23] and the relevant radial integrals were calculated using the Numerov method [24]. In the absence\nof external fields, the dipole-allowed microwave transition between the 33p and the energetically lower-lying\n33s singlet Rydberg states of He occurs at a frequency of\n30.66 GHz. The Stark shifts of transitions of this kind\ncan be used as sensitive probes of stray electric fields [25].\nTo determine the magnitude of stray electric fields in\nthe region close to the co-planar waveguide a set of pulsed\nmicrowave measurements, presented in Fig. 3, were performed for different values of n. These measurements\ninvolved driving np → ns transitions for states between\nn = 31 and n = 35 and selectively detecting the final\nstate. Microwave pulses of 1 μs duration were applied to\nthe waveguide 6 μs after Rydberg photoexcitation, when\nthe Rydberg atoms were located at the midpoint of the\nPCB in the z-dimension. A constant output power of\nthe microwave source of Pμ = 320 nW was maintained\nthroughout these measurements, with an attenuation of\n∼ 15 dB between the source and the PCB. The spectra\nrecorded exhibit strongly asymmetric line shapes with a\nsharp rise on the low-frequency side near the zero-field\ntransition frequency, νzf , and a long tail on the high-\n\n\f7\n\n1250\n\n(a)\n\nPμ = 32 mW\n\n6\nPμ = 3.2 mW\n\n5\n\nPμ = 320 μW\n\n4\n\nPμ = 32 μW\n\n3\n2\n\n33p → 33s\n\nPμ = 3.2 μW\nPμ = 320 nW\n\n1\n\n750\n\n500\n\n250\n\nPμ = 32 nW\n\n0\n28\n\n(b)\n\n1000\n\nTransition line-width (MHz)\n\nfrequency side. These features, together with the strong\nn dependence of the transition linewidths, (the narrowest line at the lowest n has a full width at half maximum\n(FWHM) of 25 MHz), betray the presence of inhomogeneous stray electric fields [25]. These fields are likely to\narise from surface imperfections including patches and\nadsorbates. Such stray fields have been studied previously, and recent work has indicated that for distances\nlarger than the patch size, the field strength scales with\nthe inverse square of the atom-surface distance [15].\nTo elucidate the effect of these stray electric fields on\nthe line shapes in the spectra in Fig. 3, a numerical simulation was performed in which the primary fit parameter\nwas the magnitude of the stray electric field. This simulation involved the generation of an ensemble of atoms,\nwith a spatial distribution matching that of the experiment. These atoms were randomly positioned in the xy\nplane at the mid-point of the PCB in the z dimension,\nwith a normal distribution of positions in the x dimension\nwith a FWHM of 2 mm centered above the waveguide.\nIn the y dimension, the atoms were described by a normal distribution of the same FWHM which was cut off\nat a distance of 1 mm above the PCB to account for the\ncollimation of the atomic beam.\nThe stray electric field was estimated by fitting\nF = F0 /y 2 simultaneously to all spectra, which led to\nF0 = 2.8 ± 0.1 × 10−5 Vm. The np → ns transition\nfrequencies were calculated using the Stark shifts determined by the matrix-diagonalization procedure. To account for the inhomogeneity of the microwave field distribution surrounding the waveguide, a calculation of\nthis field was carried out in the xy plane above the\nPCB using a finite-element method. The microwave field\nstrength Eμ experienced by each atom, and the fielddependent np → ns transition dipole moment Dnp ns (F ),\nwere used to determine the degree of saturation Snp ns =\n[Dnp ns (F ) Eμ /(~ γ)]2 of the transition, where γ is the\nnatural linewidth. The transition dipole moments were\ncalculated by summing the contribution of each dipoleallowed ∆` = ±1 transition between the `-mixed np and\nns states in the presence of the stray field. ApLorentzian\nhomogeneous line shape with a FWHM of γ 1 + Snp ns\n(where γ < 10 MHz) was associated with each atom. The\nsimulated line profiles of an ensemble of 20 000 atoms\nwere generated by summing these Lorentzian functions\n(thick red lines in Fig. 3) and are in good agreement with\nthe experimental data. The sharp rise close to the zerofield transition frequencies corresponds to atoms at larger\ndistances from the surface of the PCB in the y dimension\nwhere the stray field and its gradient are smallest. The\ntail at higher frequencies arises from atoms closer to the\nsurface with larger Stark shifts.\nTo investigate the degree of saturation that can be\nachieved for Rydberg-Rydberg transitions, a set of spectra of the 33p → 33s transition, presented in Fig. 4(a),\nwas recorded as a function of microwave power under oth-\n\nNormalized integrated electron signal (arb. unit)\n\n3\n\n29\n\n30\n\n31\n\n32\n\nFrequency (GHz)\n\n33\n\n0\n\n10-6\n\n10-4\n\n10-2\n\nMicrowave power (W)\n\nFIG. 4: (Color online) (a) Spectra of the singlet 33p → 33s\ntransition in He as a function of microwave power. The output\npower of the microwave source, Pμ , is indicated on the righthand side of each spectrum. (b) Dependence of the measured\nline-width on Pμ .\n\nerwise identical conditions. Increasing the output power\nof the microwave source by a factors of 10 beginning with\nPμ = 32 nW revealed that significant saturation could be\nachieved. The measured line widths range from 80 MHz\nat Pμ = 320 nW to 1.1 GHz at Pμ = 32 mW and are\nplotted as a function of microwave\npower in Fig. 4(b).\np\nThe experimental data has a Pμ dependence as indicated by the fitted dashed curve\np representing the function\nf (Pμ )/MHz = 119 + 5490 Pμ /W. At low powers, inhomogeneous broadening by the stray electric field dominates, leading to a deviation from this behavior.\nThe coherence of this atom-radiation interaction was\ninvestigated by selective detection of atoms in the 33s\nstate as a function of microwave pulse duration at a fixed\nfrequency and microwave power. The results obtained at\na frequency of 30.76 GHz and microwave powers of 4 μW\nand 10 μW are presented in Fig. 5. In each case, the experimental data are displayed with error bars indicating\nthe standard deviation from the mean of six measurements. At early times, population is transferred from\nthe initially excited 33p state to the 33s state. Rabi oscillations are then observed in the fraction of atoms in the\n33s state. At later times, the contrast of the oscillations\nreduces because of ensemble dephasing and decoherence.\nIncreasing the microwave power from 4 μW to 10 μW\ngives a corresponding increase in the observed oscillation\nfrequency.\nThis coherent population transfer between the 33p and\n33s states was simulated in an extension of the procedure\ndescribed above. Since each atom experiences a different\nmicrowave field (Eμ ) and a different stray electric field\n\n\fFraction of Rydberg\natoms in 33s state\n\n4\n(a)\n\n0.08\n\n(b)\n\nP = 4 μW\n\nP = 10 μW\n\n0.06\n0.04\n\nExperiment\nSimulation\n\n0.02\n0\n\n0\n\n50\n\n100\n\nTime (ns)\n\n150\n\nExperiment\nSimulation\n0\n\n50\n\n100\n\nTime (ns)\n\n150\n\nFIG. 5: (Color online) Fraction of Rydberg atoms in the 33s\nstate as a function of microwave pulse duration for output\npowers of the microwave source of (a) 4 μW and (b) 10 μW.\nThe solid black lines are the results of numerical simulations.\n\n(F from Fig. 3), individual Rabi oscillation frequencies,\nΩ33p 33s = D33p 33s (F ) Eμ /~, were determined. The fraction of the total ensemble of Rydberg atoms in the 33s\nstate was then calculated by summing the contribution\nof each atom in the simulation. Because of the stray electric field each atom also experiences a different detuning\n∆. Consequently, the\nq single-atom oscillation frequency\n0\nbecomes Ω33p 33s = ∆2 + Ω233p 33s and the contrast of\nthe corresponding Rabi oscillations is reduced by a factor\n(Ω33p 33s /Ω033p 33s )2 . Across the ensemble, the oscillations\ntherefore dephase with time.\nUnder the experimental conditions, T1 is dominated by\nthe fluorescence lifetime of the 33p state and is > 1 μs.\nThe motion of the atoms (∼ 1.7 mm μs−1 ) above the\nPCB between regions of different microwave field and\nstray electric field gives rise to a time-dependence of\nΩ33p 33s and ∆. This results in a decoherence time of\n∼250 ns, which was determined from the experimental\ndata, and led to the simulated black curves in Fig. 5. In\nchanging the microwave power from 4 μW in Fig. 5(a) to\n10 μW in Fig. 5(b) the microwave field strength increases\nby a factor of 1.6. Best agreement was found between the\nsimulations and the experimental data with a factor of\n1.4 ± 0.1. The discrepancy is attributed to the limited\nprecision with which the spatial distribution of the stray\nelectric fields emanating from the surface of the PCB are\nmodeled.\nThe coherent coupling of Rydberg atoms to microwave\ncircuits demonstrated here opens up the possibility of exploiting hybrid atomic–solid-state systems of this kind in\ncavity QED and quantum information processing, including surface-based, non-destructive Rydberg atom detection. It is planned, in the next generations of experiments, to replace the normal metallic co-planar waveguide used in this work with a superconducting one and\nthen to use a co-planar microwave resonator on a singlecrystal substrate. The method of measuring stray electric\nfields presented here will be employed to select optimal\nmaterials for these devices. Further collimation combined\nwith electrostatic guiding, and deceleration [4, 26] of the\nRydberg atom beam will permit more precise control over\n\nthe atom-surface distance and reduce decoherence caused\nby motion. In this way, the limit of single-atom–singlephoton coupling will be approached.\nWe thank H. Schmutz, S. Marx, Ch. Gross and P.\nAllmendinger for help and discussions. This work is supported by the NCCR QSIT of the Swiss National Science\nFoundation, and the ERC under Projects 228286 and\n240328. S. F. thanks the Austrian Science Foundation\nfor support.\n\n[1] E. J. Beiting, G. F. Hildebrandt, F. G. Kellert, G. W.\nFoltz, K. A. Smith, F. B. Dunning, and R. F. Stebbings,\nJ. Chem. Phys., 70, 3551 (1979).\n[2] T. F. Gallagher and W. E. Cooke, Phys. Rev. Lett., 42,\n835 (1979).\n[3] W. P. Spencer, A. G. Vaidyanathan, D. Kleppner, and\nT. W. Ducas, Phys. Rev. A, 26, 1490 (1982).\n[4] Ch. Seiler, S. D. Hogan, H. Schmutz, J. A. Agner, and\nF. Merkt, Phys. Rev. Lett., 106, 073003 (2011).\n[5] D. Kleppner, Phys. Rev. Lett., 47, 233 (1981).\n[6] R. G. Hulet, E. S. Hilfer, and D. Kleppner, Phys. Rev.\nLett., 55, 2137 (1985).\n[7] D. Meschede, H. Walther, and G. Müller, Phys. Rev.\nLett., 54, 551 (1985).\n[8] G. Rempe, H. Walther, and N. Klein, Phys. Rev. Lett.,\n58, 353 (1987).\n[9] S. Gleyzes, S. Kuhr, C. Guerlin, J. Bernu, S. Deléglise,\nU. Busk Hoff, M. Brune, J.M. Raimond, and S. Haroche,\nNature 446, 297 (2007).\n[10] A. Wallraff, D. I. Schuster, A. Blais, L. Frunzio, R.-S.\nHuang, J. Majer, S. Kumar, S. M. Girvin, and R. J.\nSchoelkopf, Nature, 431, 162 (2004).\n[11] R. J. Schoelkopf and S. M. Girvin, Nature (London), 451\n664 (2008).\n[12] M. Saffman, T. G. Walker, and K. Mølmer, Rev. Mod.\nPhys., 82 2313 (2010).\n[13] D. Comparat and P. Pillet, J. Opt. Soc. Am. B, 27 A208\n(2010).\n[14] D. D. Neufeld, Y. Pu, and F. B. Dunning, Nucl. Instrum.\nMethods B, 269, 1288 (2011).\n[15] J. D. Carter and J. D. D. Martin, Phys. Rev. A, 83,\n032902 (2011).\n[16] A. Tauschinsky, R. M. T. Thijssen, S. Whitlock, H. B.\nvan Linden van den Heuvell, and R. J. C. Spreeuw, Phys.\nRev. A, 81, 063411 (2010).\n[17] A. Anderson, S. Haroche, E. A. Hinds, W. Jhe, and D.\nMeschede, Phys. Rev. A, 37, 3594 (1988).\n[18] V. Sandoghdar, C. I. Sukenik, E. A. Hinds, and S.\nHaroche, Phys. Rev. Lett., 68, 3432 (1992).\n[19] S. B. Hill, C. B. Haich, Z. Zhou, P. Nordlander, and F.\nB. Dunning, Phys. Rev. Lett., 85, 5444 (2000).\n[20] G. R. Lloyd, S. R. Procter, and T. P. Softley, Phys. Rev.\nLett., Phys. Rev. Lett., 95, 133202 (2005).\n[21] E. So, M. Dethlefsen, M. Ford, and T. P. Softley, Phys.\nRev. Lett., 107, 093201 (2011).\n[22] T. Halfmann, J. Koensgen, and K. Bergmann, Meas. Sci.\nTechnol., 11, 1510 (2000).\n[23] W. C. Martin, Phys. Rev. A, 36, 3575 (1987).\n[24] M. L. Zimmerman, M. G. Littman, M. M. Kash, and D.\n\n\f5\nKleppner, Phys. Rev. A, 20, 2251 (1979).\n[25] A. Osterwalder and F. Merkt, Phys. Rev. Lett., 82, 1831\n(1999).\n\n[26] S. D. Hogan and F. Merkt, Phys. Rev. Lett. 100, 043001\n(2008).\n\n\f"}