{"id": "http://arxiv.org/abs/1105.3160v1", "guidislink": true, "updated": "2011-05-16T17:42:57Z", "updated_parsed": [2011, 5, 16, 17, 42, 57, 0, 136, 0], "published": "2011-05-16T17:42:57Z", "published_parsed": [2011, 5, 16, 17, 42, 57, 0, 136, 0], "title": "Plasmonic Airy Beam on Metal Surface", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1105.4202%2C1105.5170%2C1105.1876%2C1105.2661%2C1105.4166%2C1105.2449%2C1105.1825%2C1105.1592%2C1105.1852%2C1105.4913%2C1105.4259%2C1105.5181%2C1105.5102%2C1105.1401%2C1105.5162%2C1105.3275%2C1105.0091%2C1105.3198%2C1105.1369%2C1105.4621%2C1105.5121%2C1105.1025%2C1105.3411%2C1105.1127%2C1105.3056%2C1105.1995%2C1105.3362%2C1105.1071%2C1105.5473%2C1105.3939%2C1105.1798%2C1105.6236%2C1105.4312%2C1105.4734%2C1105.3310%2C1105.3160%2C1105.1267%2C1105.3338%2C1105.5362%2C1105.1548%2C1105.4760%2C1105.2291%2C1105.5510%2C1105.3626%2C1105.2324%2C1105.0065%2C1105.4799%2C1105.3967%2C1105.2262%2C1105.0655%2C1105.5836%2C1105.3235%2C1105.1015%2C1105.4096%2C1105.2011%2C1105.3344%2C1105.2346%2C1105.1534%2C1105.4914%2C1105.0071%2C1105.5060%2C1105.1020%2C1105.1810%2C1105.5406%2C1105.0750%2C1105.6245%2C1105.4156%2C1105.5864%2C1105.4528%2C1105.4033%2C1105.3690%2C1105.0185%2C1105.1111%2C1105.4948%2C1105.0660%2C1105.3999%2C1105.0943%2C1105.0446%2C1105.4093%2C1105.4682%2C1105.2451%2C1105.0251%2C1105.2672%2C1105.2252%2C1105.4438%2C1105.1593%2C1105.4236%2C1105.4939%2C1105.4180%2C1105.3092%2C1105.6166%2C1105.5230%2C1105.1814%2C1105.6299%2C1105.3845%2C1105.5095%2C1105.0461%2C1105.5551%2C1105.4555%2C1105.0517%2C1105.1540&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Plasmonic Airy Beam on Metal Surface"}, "summary": "Optical Airy beam, as a novel non-diffracting and self-accelerating wave\npacket, has generated great enthusiasm since its first realization in 2007,\nowing to its unique physics and exciting applications. Here, we report a new\nform of this intriguing wave packet - plasmonic Airy beam, which is\nexperimentally realized on a silver surface for the first time. By particular\ndiffraction processes in a carefully designed nano-array structure, a novel\nplanar Airy beam of surface plasmon polariton (SPP) is directly generated and a\nstructural dependent phase tuning method is proposed to modulate the beam\nproperties. This SPP Airy beam is regarded as a two-dimensional (2D)\nsubwavelength counterpart of the 3D optical Airy beam in free space, allowing\nfor on-chip photonic manipulations. Moreover, it possibly suggests a\nbreakthrough in recognition of this unique wave packet in a polariton regime\nafter its previous evolution from free particle to pure optical wave.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1105.4202%2C1105.5170%2C1105.1876%2C1105.2661%2C1105.4166%2C1105.2449%2C1105.1825%2C1105.1592%2C1105.1852%2C1105.4913%2C1105.4259%2C1105.5181%2C1105.5102%2C1105.1401%2C1105.5162%2C1105.3275%2C1105.0091%2C1105.3198%2C1105.1369%2C1105.4621%2C1105.5121%2C1105.1025%2C1105.3411%2C1105.1127%2C1105.3056%2C1105.1995%2C1105.3362%2C1105.1071%2C1105.5473%2C1105.3939%2C1105.1798%2C1105.6236%2C1105.4312%2C1105.4734%2C1105.3310%2C1105.3160%2C1105.1267%2C1105.3338%2C1105.5362%2C1105.1548%2C1105.4760%2C1105.2291%2C1105.5510%2C1105.3626%2C1105.2324%2C1105.0065%2C1105.4799%2C1105.3967%2C1105.2262%2C1105.0655%2C1105.5836%2C1105.3235%2C1105.1015%2C1105.4096%2C1105.2011%2C1105.3344%2C1105.2346%2C1105.1534%2C1105.4914%2C1105.0071%2C1105.5060%2C1105.1020%2C1105.1810%2C1105.5406%2C1105.0750%2C1105.6245%2C1105.4156%2C1105.5864%2C1105.4528%2C1105.4033%2C1105.3690%2C1105.0185%2C1105.1111%2C1105.4948%2C1105.0660%2C1105.3999%2C1105.0943%2C1105.0446%2C1105.4093%2C1105.4682%2C1105.2451%2C1105.0251%2C1105.2672%2C1105.2252%2C1105.4438%2C1105.1593%2C1105.4236%2C1105.4939%2C1105.4180%2C1105.3092%2C1105.6166%2C1105.5230%2C1105.1814%2C1105.6299%2C1105.3845%2C1105.5095%2C1105.0461%2C1105.5551%2C1105.4555%2C1105.0517%2C1105.1540&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Optical Airy beam, as a novel non-diffracting and self-accelerating wave\npacket, has generated great enthusiasm since its first realization in 2007,\nowing to its unique physics and exciting applications. Here, we report a new\nform of this intriguing wave packet - plasmonic Airy beam, which is\nexperimentally realized on a silver surface for the first time. By particular\ndiffraction processes in a carefully designed nano-array structure, a novel\nplanar Airy beam of surface plasmon polariton (SPP) is directly generated and a\nstructural dependent phase tuning method is proposed to modulate the beam\nproperties. This SPP Airy beam is regarded as a two-dimensional (2D)\nsubwavelength counterpart of the 3D optical Airy beam in free space, allowing\nfor on-chip photonic manipulations. Moreover, it possibly suggests a\nbreakthrough in recognition of this unique wave packet in a polariton regime\nafter its previous evolution from free particle to pure optical wave."}, "authors": ["L. Li", "T. Li", "S. M. Wang", "S. N. Zhu"], "author_detail": {"name": "S. N. Zhu"}, "author": "S. N. Zhu", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevLett.107.126804", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1105.3160v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1105.3160v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "physics.optics", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "physics.optics", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1105.3160v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1105.3160v1", "arxiv_comment": null, "journal_reference": null, "doi": "10.1103/PhysRevLett.107.126804", "fulltext": "Plasmonic Airy Beam on Metal Surface\nL. Li, T. Li★, S. M. Wang, and S.N. Zhu★\nNational Laboratory of Solid State Microstructures,\nCollege of Physics, College of Engineering and Applied Sciences, Nanjing University,\nNanjing 210093, China,\nOptical Airy beam, as a novel non-diffracting and self-accelerating wave packet, has\ngenerated great enthusiasm since its first realization in 2007, owing to its unique\nphysics and exciting applications. Here, we report a new form of this intriguing\nwave packet - plasmonic Airy beam, which is experimentally realized on a silver\nsurface for the first time. By particular diffraction processes in a carefully designed\nnano-array structure, a novel planar Airy beam of surface plasmon polariton (SPP)\nis directly generated and a structural dependent phase tuning method is proposed to\nmodulate the beam properties. This SPP Airy beam is regarded as a\ntwo-dimensional (2D) subwavelength counterpart of the 3D optical Airy beam in\nfree space, allowing for on-chip photonic manipulations. Moreover, it possibly\nsuggests a breakthrough in recognition of this unique wave packet in a polariton\nregime after its previous evolution from free particle to pure optical wave.\n\n★Corresponding\n\nauthors, E-mails: taoli@nju.edu.cn, zhusn@nju.edu.cn\n\nWebsite: http://dsl.nju.edu.cn/dslweb/en-index.html\n1\n\n\fAiry wave packet is the only nontrivial 1D solution for a wave propagation\nmaintaining the non-spreading property, which was deduced from Schrödinger equation\nin quantum mechanics for a free particle1. Since its recent observation in optics2,\nintensive studies have been carried out on its novel properties, such as self-accelerating3,\nballistic dynamics4, self-healing5,6, as well as the recent nonlinear generation7 and\npossible applications8-10 (e.g., particle clearing, curved plasma channel). Up to date, these\nexperimentally achieved optical Airy beams were all generated in 3D free space. An\nintuitive extension of this unique wave packet to two dimensions would possibly forecast\nmore fascinating physics and applications, especially as it is accommodated in the\nsubwavelength plasmonics, which is another intriguing field nowadays11-15. As has been\nenvisioned in a recent theoretical study16, plasmonic Airy beam would provide effective\nmeans to route energy over a metal surface between plasmonic devices. Moreover, since\nsurface plasmon polariton is an elementary excitation that can be regarded as a kind of\nquasi particle merging the optical field and electron oscillation, the realization of SPP\nAiry beam would possibly indicate further extension of Airy wave packet from the pure\nlight to the quasi particle system.\nAccording the nature of Airy wave packet1, a 3/2 power phase modulation along the\nlateral dimension of beam is required17,18. It is commonly modulated to 3 power phase\ntype by a mask on an incident Gaussian beam with a followed Fourier transformation in\ngenerations of free space Airy beams2-10. This 3/2 phase requirement is inherited for an\nSPP Airy beam, although the field form is modified16. However, the conventional method\n2\n\n\ftends to be hardly adopted in a surface regime due to the complex transformation process\nand large spatial expense. Although alternative approach was conceived by coupling a\nfree space generated Airy beam into a planar plasmonic one16, it will inevitably bring\nother severe obstacles (e.g., coupling process, the mismatched characteristics in different\nscales) and remains great challenges.\nHere, we report the first realization of plasmonic Airy beams on a silver surface at\nvisible wavelength, which is accomplished by particular diffraction processes with\nrespect to a carefully designed nanocave array on the metal film. This experimentally\nachieved plasmonic Airy beam intuitively reveals the non-spreading and self-bending\nproperty over a considerable long distance (~50 μm), demonstrating the capacity of a\ntransversely self-confined SPP beam in a planar dimension with lower propagation loss.\nFurthermore, the proposed diffraction approach by designable nanostructures has\nexhibited it flexibility in beam tailoring, which may significantly broaden the study in\nmanipulation of the SPP waves in planar dimension.\n\nResults\nDirect generation of SPP Airy beam by graded nanocave array. Using periodic array\non metal surfaces to manipulate SPP propagations has achieved great success in recent\nyears19-22. Actually, these approaches used to change the SPP propagations can also be\ninterpreted as a phase modulation, which is in coincidence with the descriptions in\ndiffraction optics. In principle, it is quite possible to use inhomogeneous array to change\n3\n\n\fa linear phase of incident SPP into a nonlinear one. In this regard, the Airy beam required\n3/2 phase modulation is highly expected by diffractions in non-periodic array system.\nThe scheme of our design is shown in Fig. 1. On the surface of a silver film (with SiO2 as\nthe substrate), a groove grating is used to couple a He-Ne laser beam (λ=632.8nm) into\nan in-plane propagating SPP wave, which subsequently incidents into a non-periodically\narranged nanocave array. By appropriate arrangement, diffracted SPP waves from\nnanocaves will interfere and ultimately build two SPP Airy beams on both sides.\nIn experiments, the metallic nanostructure was fabricated by the focused ion beam\n(Strata FIB 201, FEI company), and SPP wave propagation analysis was performed by a\nhome built leakage radiation microscope (LRM) system23,24 (see methods for details).\nThe inset image in down-right of Fig. 1 is a typical experimental result, which intuitively\ndemonstrates the generation of SPP Airy beams that very analog to the schematic\nillustration, manifesting the self-bending, non-spreading and multiple lobes. Here, the\nsample of nanocave array is designed graded in x-direction and periodic in z-direction.\nFigure 2a depicts the top view of the graded nanocave array together with a grating\ncoupler, and the recorded SPP beam in the right branch is specifically shown in Fig. 2b\nfor detailed analysis. Subsequently, we performed a theoretical calculation based on the\nHuygens-Fresnel principle18, that all nanocaves in the array are considered as sub-sources\nthat radiate cylindrical surface waves (see methods). The calculated beam trajectories\n(shown in Fig. 2c) are in good agreement with the experiment ones, although they are\nboth imperfect due to limited diffraction elements and non-ideal modulations. To make a\n4\n\n\fquantitative evaluation, beam profiles at different propagation distances (marked in Fig.\n2b) are plotted in Fig. 2d, from which a set of Airy-like wave profile are clearly\nmanifested. The main lobe keeps non-spreading property within at least 30 μm distance,\nwhich is considerable long for an SPP wave at wavelength of 632.8 nm (λ in free space).\nA narrow beam width of the main lobe (FWHM ~1 μm) is notably preserved over a long\ndistance. Thanks to this particular instructive interference of diffraction waves, the\nattenuation of the main lobe of this SPP Airy beam appears much less than a common\nSPP wave. In this regard, it behaves like a self-confined in-plane waveguide with lower\nloss and suggests possible applications in guiding SPP waves.\nPhase modulation of SPP Airy beam. To explain how the SPP Airy beam comes into\nbeing, a novel nonlinear phase modulation by diffractions from non-periodic array is\nintroduced. As it is well known, an incident SPP wave will be diffracted (or reflected)\ninto a well defined direction by a designed array determined by the Bragg condition,\nwhich can be clearly schemed out in the reciprocal space25 (see Fig. 3a). However, if this\ncondition is not perfectly satisfied, a preference diffraction will still occur with some\nsacrifice in intensity (as long as the deviation is not too large), owing to the elongated\nreciprocal lattice of finite-scale array (see Fig. 3b) that is similar to the X-ray diffraction\ncases26. It is also proved by our experiments (see supplementary information). Therefore,\ndifferent lattice parameter is able to determine the preference diffraction direction, which\ncan be regarded equivalently to yield an extra phase change of 2π from every local lattice\n(in x direction here). When a graded array is employed, incident beam will diffract to\n5\n\n\fdifferent directions at different positions according to the local lattice parameters (for this\nsmall gradient case Δ=10nm). Thus, we can obtain the corresponding phase evolution\nfrom every lattice point in the incident SPP propagation (x direction) as φ(x)=\n\nφ0+ksppx-2mπ. This phase evolution in turn manifests the gradually changed diffraction\ndirections by graded lattice.\nFrom Fig. 2b, a beaming angle (θ~20°) with respect to z-axis is found for the main\nlobe. This means the lattice boundary (line z=0) is not the start line of this SPP Airy beam.\nWe can deduce the phase information at a virtue starting line in ξ-axis that perpendicular\nto the tangent of beaming trajectory of the main lobe according to the principle of\ngeometric optics as (see the scheme in Fig. 3c)\n\nφ (ξ ) = φ ( x ) − kspp b = 2mπ + kspp x − kspp b ,\n\n(1)\n\nwhere\nb=−\n\nand sin (θ 0 ) =\n\nx tan (θ 0 )\nx\n, ξ=\n,\ncos (θ x ) + tan (θ 0 ) sin (θ x )\ncos (θ 0 ) (1 + tan (θ x ) tan (θ 0 ) )\n\nλspp − a0\na0\n\n,sin (θ x ) =\n\nλspp − ax\nax\n\n(2)\n\n, ax is defined as the local lattice determined\n\nby the mean value of two distances before and after the lattice of x. According to the\nexperimental result of the position of original point of O (a0~450 nm) and initial angle\n(θ~20°), we calculated the transformed phase φ(ξ) shown in Fig. 3d together with the\nresults of 1.4, 1.5 and 1.6-power phase modulations. It is clearly seen that the deduced\ndata from the graded array matches the 3/2 power relation considerably well. It well\nexplains the outcome of Airy-like beam. In addition, the intensity of diffraction from\n6\n\n\fevery local lattice is dominated by the matching condition, i.e., the better Bragg condition\nsatisfied, the stronger diffraction formed. Thus, the location of the main lobe is\nexpectedly near the match point, which is in coincidence with the Airy function.\n\nDesignable generation of SPP Airy beam. Based on above phase modulation method,\nSPP Airy beam with a defined beaming direction (for the main lobe) can be generated by\na proper non-periodic array. With a defined beaming angle of θ, the corresponding phase\nalong the x axis can be retrieved as\n\n2⎛ ξ ⎞\nψ ( x) = − ⎜ − ⎟\n3 ⎝ ξ0 ⎠\nwhere\n\n3/ 2\n\n−\n\nπ\n4\n\n−k\n\nξ sin θ\n,\ncos (θ − θξ )\n\n(3)\n\nx = ξ cos (θ ) + ξ sin (θ ) tan (θ − θξ ) , θξ = arcsin ( ∂ ξ φ (ξ ) ) , φ(ξ) is the phase\n\nsatisfying the Airy function, and ξ 0 is a constant determines the acceleration of Airy\nbeam. According to the equivalent phase by diffraction φm ( x) = kx + 2mπ , we can\ndeduce the location of the mth diffraction unit by solving φm ( x) = ψ ( x) , and ultimately\nretrieve the arrangement of nanocave array. Fig. 4a-4d are the designed array data and\ncalculated results of the SPP Airy beam with the angle of θ=0 and -7°, respectively. The\ncorresponding experimental results are subsequently shown in Fig. 4e and 4f, which\nagree well with the calculated ones. By carefully examining these beaming profiles, a set\nof upper diffraction branches with considerable strong intensities are exhibited besides\nmain Airy beams. It is actually due to another matched condition corresponding to the\nreciprocal G-2,1. Here, of importance is that SPP Airy beams are realized in a designable\nway by proper phase modulation, in which the non-spreading, self-bending properties are\n\n7\n\n\fwell demonstrated.\n\nDiscussion\nAccording to above demonstration of SPP Airy beams achieved by graded arrays (from\nthe fixed gradient case to the designed ones), an artificial modulation of the diffraction\nphase is well proved to have the capacity to manipulate the SPP wave propagations.\nHowever, another characteristic of the Airy beam - lateral intensity modulation - is not\naddressed, because it is rather complicated for this non-periodic case and remains a\nproblem to be further explored. Fortunately, the graded system is commonly able to build\na localized wave packet at its propagation end (around the matched condition)27, which\nusually has asymmetric profile that considerably analog to the intensity envelope required\nby the Airy function. As for more precise intensity modulation (e.g., the -1/4 power\nrelation1), we believe it would be accomplished or improved by carefully tuning the\ndiffraction elements (e.g., variable diameter, depth or shapes of the nanocaves, or nano\nbulbs), as well as modifications of the array periods in the other dimensions. Even though,\nas has been mentioned that the phase modulation is the critical factor17,18, we have\nsuccessfully achieved the SPP Airy beam on silver surface in a controllable way.\nFor further perspective, the parameters of the nanocave arrays are designable with\nrespect to the defined wavelength of SPPs. It is reasonable to suggest a frequency\ndispersive array structure to generate multi-frequency (or colorful) SPP Airy beams by a\nsingle design, which may indicate good functionality in planar plasmonic manipulation\n8\n\n\fand integrations. Moreover, the proposed method by diffraction process with nanocave\narray exhibits more flexible than traditional methods, which may be used to generate\nother beam forms of SPP as well as some other waves as expected. Since the SPP is a\nkind of polariton with a mixed character of particle and wave, this type of Airy would\nprobably indicate the existence of some other quasi-particles (e.g., phonon, magnon, etc).\nIn this sense, our work would open a new avenue for further exploration of such a unique\nwave packet. In addition, the SPP Airy beam detected by LRM system is a direct\nobservation of the unique Airy beam trajectory that cannot be obtained in previous optical\nbeams in free space.\nIn conclusion, we have developed a new method to design and experimentally\ndemonstrate, for the first time, the SPP Airy beam on a silver surface. The revealed SPP\nAiry beam exhibits non-spreading property with about 1 μm lateral confinement for the\nmain lobe over a long distance at visible wavelength, which has implications in SPP\nmanipulation and other related field (e.g. arranging nanoparticles in nanoscale).\nFurthermore, the method based on the diffraction effect allows for controllable\nmodulations on the established plasmonic Airy beam almost at will, which may have\nmore general applications in the wave-front tailoring as well as developing new kind of\nphotonic or plasmonic structures and devices.\n\nMethods\nFabrication and LRM optical analysis. The nanocave array sample was fabricated by\n9\n\n\ffocused ion beam (FEI Strata FIB 201, 30keV, 11pA) milling on a 60nm thickness silver\nfilm, which has been deposited on a 0.2mm-thinkness SiO2 substrate. The propagation of\nSPP waves was analyzed by the approach called leakage radiation microscope (LRM)\nsystem23. Briefly, it works on the radiation mode that leaks from the decaying SPP field\nthrough the metal layer into the high refractive substrate (here, nSiO2>nair), as the metal\nlayer is thin enough. In our experiments, SPP waves were excited by He-Ne laser\n(632.8nm) focused by a microscope objective (50×, numerical aperture of 0.55) onto the\ngrating coupler. The leakage radiation emitted into the SiO2 substrate from Ag/SiO2\ninterface was collected by an oil immersion microscope objective (160×, numerical\naperture of 1.40). The real space SPP propagation and its Fourier transformation image\n(i.e., k-space) were recorded using a charge-coupled-device (CCD) in the object plane\nand back focal plane respectively, depending on the location of an auxiliary lens24.\n\nTheoretical calculation. The theoretical calculation is based on the Huygens-Fresnel\nprinciple, that all nanocaves in the array are considered as sub-sources that radiate\ncylindrical SPP surface waves. According to the field form of SPP sub-sources, we can\ncalculate interfered SPP field intensity by summing over the field of all diffracted SPP\nwaves as (due to the TM nature of SPP, we only consider the y component)\n\nE y ,tot ( x, z ) = E0 ∑\nm,n\n\n1\nexp[−ikspp (d m,n + rm,n ) − α ( d m,n + rm,n )]exp(iωt ) ,\nrm ,n\n\nwhere kspp is wave vector of SPP, d m , n is the distance from the initial position of SPP\nincidence to the (m, n) lattice and rm ,n is the distance from the lattice point to a location\n\n10\n\n\fof (x, z). The decay coefficient α is fitting parameters corresponding to the attenuation\nof SPP wave propagating on the planar surface. Therefore, the intensity of interfered SPP\n2\n\nwave beaming from the nanocave array can be obtained from E y ,tot ( x, z ) .\n\nReferences\n\n1. Berry, M. V. & Balazs, N. L. Nonspreading wave packets. Am. J. Phys. 47, 264-267\n(1979).\n2. Siviloglou, G. A., Broky, J., Dogariu, A. & Christodoulides, D. N. Observation of\naccelerating Airy beams. Phys. Rev. Lett. 99, 213901 (2007).\n3. Siviloglou, G. A. & Christodoulides, D. N. Accelerating finite energy Airy beams.\nOpt. Lett. 32, 979-981 (2007).\n4. Siviloglou, G. A., Broky, J., Dogariu, A. & Christodoulides, D. N. Ballistic dynamics\nof Airy beams. Opt. Lett. 33, 207-209 (2008).\n5. Broky, J., Siviloglou, G. A., Dogariu, A. & Christodoulides, D. N. Self-healing\nproperties of optical Airy beams. Opt. Express 16, 12880-12891 (2008).\n6. Carretero, L. et al. Nonparaxial diffraction analysis of Airy and SAiry beams. Opt.\nExpress 17, 22432-22441 (2009).\n7. Ellenbogen, T., Voloch-Bloch, N., Ganany-Padowicz, A. & Arie, A. Nonlinear\ngeneration and manipulation of Airy beams. Nature Photon. 3, 395-398 (2009).\n8. Baumgartl, J., Mazilu, M. & Dholakia, K. Optically mediated particle clearing using\nAiry wavepackets. Nature Photon. 2, 675-678 (2008).\n11\n\n\f9. Polynkin, P., Kolesik, M., Moloney, J. V., Siviloglou, G. A. & Christodoulides, D. N.\nCurved plasma channel generation using ultraintense Airy beams. Science 324,\n229-232 (2009).\n10. Gu, Y. L. & Gbur, G. Scintillation of Airy beam arrays in atmospheric turbulence.\nOpt. Lett. 35, 3456-3458 (2010).\n11. Ozbay, E. Plasmonics: merging photonics and electronics at nanoscale dimensions.\nScience 311, 189-193 (2006).\n12. Gramotnev, D. K. & Bozhevolnyi, S. I. Plasmonics beyond the diffraction limit. Nat.\nPhotonics 4, 83-91 (2010).\n13. Barnes, W. L., Dereux, A. & Ebbesen, T. W. Surface Plasmon subwavelength optics.\nNature 424, 824-830 (2003).\n14. Ditlbacher, H., Krenn, J. R., Schider, G., Leitner, A. & Aussenegg F. R.\nTwo-dimensional optics with surface plasmon polaritons. Appl. Phys. Lett. 81,\n1762-1764 (2002).\n15. Radko, I. P. et al. Plasmonic metasurfaces for waveguiding and field enhancement.\nLaser & Photon. Rev. 3, 575-590 (2009).\n16. Salandrino, A. & Christodoulides, D. N. Airy plasmon: a nondiffracting surface\nwave. Opt. Lett. 35, 2082-2084 (2010).\n17. Cottrell, D. M., Davis, J. A., & Hazard, T. M. Direct generation of accelerating Airy\nbeams using a 3/2 phase-only pattern. Opt. Lett. 34, 2634 (2009).\n18. Kaganovsky, Y. & Heyman, E. Wave analysis of Airy beams. Opt. Express 18,\n12\n\n\f6440-8452 (2010).\n19. Yin, L. L. et al. Subwavelength focusing and guiding of surface plasmons. Nano Lett.\n5, 1399-1402 (2005).\n\n20. González, M. U. et al. Design, near-field characterization, and modeling of 45°\nsurface-plasmon Bragg mirrors. Phys. Rev. B 73, 155416 (2006).\n21. Evlyukhin, A. B., Bozhevolnyi, S. I., Stepanov, A. L., Krenn, J. R. Splitting of a\nsurface Plasmon polariton beam by chains of nanoparticles. Appl. Phys. B 84, 29-34\n(2006).\n22. Drezet, A. et al. Plasmonic crystal demultiplexer and multiports. Nano Lett. 7,\n1697-1700, (2007).\n23. Drezet, A. et al. Leakage radiation microscopy of surface Plasmon polaritons. Mater\nSci Eng B 149, 220-229 (2008).\n24. Drezet, A. et al. How to erase surface plasmon fringes. Appl. Phys. Lett. 89, 091117\n(2006).\n25. Baudrion, A. -L. et al. Influence of the filling factor on the spectral properties of\nplasmonic crystals. Phy. Rev. B 74, 125406 (2006).\n26. Guinier, A., X-Ray Diffraction (Freeman, London, 1963).\n27. Wang, S. M. et al. Selective switch made from a graded nanosandwich chain. Appl.\nPhys. Lett. 93, 233102 (2008).\n\n13\n\n\fAcknowledgements\n\nThe authors thank Dr. C. Zhang and Dr. P. Xu for beneficial discussions in theoretical\nanalyses. This work is supported by the State Key Program for Basic Research of China\n(Nos. 2009CB930501, 2010CB630703 and 2011CBA00200) and the National Natural\nScience Foundation of China (Nos. 10974090, 60990320 and 11021403),\n\nAuthor Contributions\n\nL. Li, T. Li, S. M. Wang, and S. N. Zhu\nT.L. and S.N.Z. supervised the study. T.L. and L.L. conceived and designed the\nexperiments. L.L. fabricated the sample and performed the optical analyses. L.L. and\nS.M.W. performed the numerical simulations. T.L. and L.L. analyzed the results and\nwrote the paper with assistance from S.M.W. and S.N.Z.\n\nAdditional Information\n\nThe authors declare no competing financial interests.\nSupplementary information accompanies this paper is provided online.\nCorrespondence and requests for materials should be addressed to T.L.\n\n14\n\n\fFigure Legends\nFigure 1 | Schematic of direct generation of the SPP Airy beam. A laser beam is\n\ncoupled into in-plane propagating SPP wave by grating and incidents into a\nnon-periodically arranged nanocave array. Two SPP Airy beams are formed on both sides\nof the array by diffraction processes. Inset is a typical experimental result of SPP Airy\nbeam examined by the leakage radiation microscope system.\nFigure 2 | SPP Airy beam generated in experiment and theoretical calculation. a, Top\n\nview of the graded nanocave array sample fabricated by the focused ion beam, where the\nlattice parameter is graded in x-dimension (ax from 420nm to 780nm, grads Δ=10nm) and\nperiod in z-dimension is pz=620nm. b, Experimentally achieved SPP beam trajectories\nand c, Calculated one. d, Beam profiles of the experimental SPP beam in different\npropagation distances marked with dash line in panel (b).\nFigure 3 | SPP diffraction schemes and phase evolution of nanocave array. a, b,\n\nEwald construction for SPP diffraction direction with (a) Bragg condtion is satisfied and\n(b) Bragg condition is not perfectly satisfied with limit diffraction elements in z axis\n(elongated reciprocal lattices in z axis are indicated). k spp ,i and k spp , d are the incident and\ndiffracted SPP wave vectors, respectively. G0,1 and G1,0 are two basic vectors of the\nreciprocal lattice. According to the schemes, the diffraction directions are determined by\nthe latice parameter in x axis for both (a) and (b). c, Scheme of the phase transformation\nfrom the x axis to a virtue ξ axis, which can be designed with respect to the beaming\nangle θ for the main lobe of SPP Airy beam. d, Deduced phase distrubutions in the\n15\n\n\fstarting ξ axis together with the 1.4, 1.5, 1.6-power phase modulations.\nFigure 4 | Designable generation of SPP Airy beam. a, b, Designed non-periodic lattice\n\nin x-dimension (scaled with respect to the bottom of the array) for (a) horizontal beaming\n\nθ=0° with pz=640 nm, ξ 0 =1.08 and (b) down-inclined beaming θ=-7° with pz=650 nm,\n\nξ 0 =1.33. c, d, Caculated results and e, f, Experimental results respectively.\n\nFigure 1\n\n16\n\n\fFigure 2\n\nFigure 3\n\n17\n\n\fFigure 4\n\n18\n\n\fSupplementary information\n\nPreference diffraction by nanocave array\n\nThe interaction between the SPP wave and the 2D array (schemed in Fig. S1a) is\nconveniently described in reciprocal space (Fig. S1b). When Bragg condition is satisfied,\nan incident SPP wave will be reflected to a preference direction, which is visualized in\nthe Ewald's circle construction. k spp ,i and k spp , d are the incident and diffracted SPP wave\nvectors, respectively. G0,1 and G1,0 are two basic vectors of the reciprocal lattice. The\nfirst order match condition is to be considered in our schematic, so that the Bragg\ncondition is\n\nr\nr\nr\nkspp ,d − kspp ,i = G−1,1\n\n(1)\n\nas shown in Fig. 1b. Therefore, the allowed diffracted direction can be defined by the\nangle of\n\n⎛ G1,0 − kspp\n⎜ k\nspp\n⎝\n\nθ = arcsin ⎜\n\n⎞\n⎟⎟ .\n⎠\n\n(2)\n\nHowever, this Bragg condition cannot be satisfied all the time for an arbitrary designed\narray, i.e., no other reciprocal lattice rightly locates on the Eward's circle.\nNotwithstanding this mismatch will destroy the uniform diffraction beam to some extent,\nthe allowed diffraction beam will still exist if the deviation is not too large. Since the\nincident SPP beam is only about 2~3 μm in width in our experiments covering 3~5\nscattering periods in transverse dimension (z direction for the incident SPP beam), the\n\n19\n\n\freciprocal lattice will be elongated in z direction correspondingly analog to the cases in\nX-ray diffraction by rod or sheet samples [see Ref. 26]. Diffraction conditions are thus\nsatisfied where the rods intersects the Ewald's circle. Therefore the case of diffraction\nfrom Bragg condition (1) approximately reduces to the 1D form:\nk SP ,dx − k SP ,ix = G1,0 .\n\n⎛G −k\nThe allowed diffraction is still satisfied with the angle of θ = arcsin ⎜ 1,0 spp\n⎜ k\nspp\n⎝\n\n(3)\n⎞\n⎟⎟ and\n⎠\n\nmay sacrifices in intensity compared with the perfectly satisfied Bragg condition. So in\nboth Fig. S1b and S1c, Px − a = λspp is always satisfied that can be deduced in the real\nspace as well (see Fig. S1a). Then, the diffracted SPP beam can be regarded starting from\nevery lattice point in x-direction each has an extra 2π difference in phase to its\nneighbors. In this regard, the relationship between the preference diffracted beam\n(beaming angle) and the lattice property of nanocave array (i.e., locations of every lattice\npoint) is established in description of a spatially defined phase modulation. In other\nwords, we can artificially design the beaming angle of diffracted SPP beam as well as the\nlocal phase by tuning the lattice parameter, thanks to the validation of Eq. (2) in the\nslightly mismatched Bragg condition.\nThis diffraction property was subsequently confirmed by our experiments. A series of\nsamples of nanocave arrays with various periods in x direction (Px is from 360 to 1100\nnm, Pz is fixed at 700 nm, 21 samples in total) were fabricated. In order to make a precise\nmeasurement of the diffraction beams, two identical arrays were designed in mirror\n\n20\n\n\fsymmetry with respect to a groove grating in z axis, which is used to coupling the 632.8\nnm laser beam into an in-plane SPP wave, see Fig. S2a. The diffraction properties of all\nsamples were analyzed by the LRM system systematically. Here, we provide LRM results\nof two typical samples in Fig. S2, where the real space images of SPP diffractions of\nsamples with Px= 390nm (S2a) and Px= 790nm (S2c) and the corresponding Fourier\nimages (Fig. S2b and S2d) are clearly exhibited. The k-space images in the Fourier planes\nappear in good agreement with cases schemed in Fig. S1c and S1d, confirming our\ntheoretical analysis. Moreover, for the sample of Px= 790nm, another matched condition\nis revealed for a higher ordered reciprocal vector G-2,1 (shown in Fig. S1d and S2d), it\nconsequently results in a strong diffraction beam in this order, as shown in Fig. S2c. It\nalso confirms our prediction of the intensity sacrifice from the mismatch. By carefully\nmeasure the diffraction angles of all samples in their Fourier plane, we obtained the\nwhole experimental data, which are in extremely good agreements with the calculated\nones from Eq. (2) as shown in Fig. S3.\n\n21\n\n\fFigure S1:\n\n(a) Schematic of incident and diffracted SPP wave in a 2D lattice; (b) The corresponding\nreciprocal space with a perfectly satisfied Bragg condition, where reciprocal G-1,1 rightly\nlocates in the SPP Eward's circle; Reciprocal patterns of slightly mismatched conditions\nfor a decreased (c) and increased (d) of Px, where a higher ordered diffracted k vector is\nindicated in (d) with the angle of θ'.\n\n22\n\n\fFigure S2:\n\n(a), (c) Real space image of SPP propagations recorded by CCD via LRM system for\nsample Px =390nm (a) and Px =790nm (c), and the corresponding k-space patterns imaged\nin the Fourier plane (b) and (d), respectively. Two identical nanocave arrays are designed\nwith mirror symmetric to the coupling grating, so as to make a precise measurement of\nthe beaming angles.\n\n23\n\n\fFigure S3:\n\nDiffraction angles of all samples with different Px measured from the Fourier plane in\nLRM system, in comparison with the theoretical ones. They are indicated by different\nsymbols.\n\n24\n\n\f"}