{"id": "http://arxiv.org/abs/0810.0364v1", "guidislink": true, "updated": "2008-10-02T08:50:52Z", "updated_parsed": [2008, 10, 2, 8, 50, 52, 3, 276, 0], "published": "2008-10-02T08:50:52Z", "published_parsed": [2008, 10, 2, 8, 50, 52, 3, 276, 0], "title": "Robust Asymptotic Stabilization of Nonlinear Systems with Non-Hyperbolic\n  Zero Dynamics", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0810.5505%2C0810.1976%2C0810.1918%2C0810.5364%2C0810.1151%2C0810.0601%2C0810.0385%2C0810.4689%2C0810.3604%2C0810.4966%2C0810.4073%2C0810.4955%2C0810.1665%2C0810.0282%2C0810.2644%2C0810.1585%2C0810.0809%2C0810.4275%2C0810.5428%2C0810.5562%2C0810.0530%2C0810.5139%2C0810.1143%2C0810.2911%2C0810.5653%2C0810.4041%2C0810.1841%2C0810.3303%2C0810.5392%2C0810.3163%2C0810.3475%2C0810.4887%2C0810.5312%2C0810.3582%2C0810.4063%2C0810.1867%2C0810.5550%2C0810.0054%2C0810.2823%2C0810.5083%2C0810.0557%2C0810.0407%2C0810.3787%2C0810.4037%2C0810.0267%2C0810.3228%2C0810.3910%2C0810.0708%2C0810.1129%2C0810.4254%2C0810.0523%2C0810.0718%2C0810.0226%2C0810.3668%2C0810.0252%2C0810.2790%2C0810.3027%2C0810.0788%2C0810.3811%2C0810.3982%2C0810.1874%2C0810.0792%2C0810.1334%2C0810.3624%2C0810.3707%2C0810.0105%2C0810.0739%2C0810.4471%2C0810.0284%2C0810.0483%2C0810.2962%2C0810.4117%2C0810.1766%2C0810.5441%2C0810.3151%2C0810.1495%2C0810.3229%2C0810.4843%2C0810.3306%2C0810.0873%2C0810.4610%2C0810.5107%2C0810.4009%2C0810.1517%2C0810.1739%2C0810.3542%2C0810.0364%2C0810.1849%2C0810.4302%2C0810.1967%2C0810.4703%2C0810.2159%2C0810.2986%2C0810.1903%2C0810.0712%2C0810.5368%2C0810.1948%2C0810.0203%2C0810.4172%2C0810.1175%2C0810.4193&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Robust Asymptotic Stabilization of Nonlinear Systems with Non-Hyperbolic\n  Zero Dynamics"}, "summary": "In this paper we present a general tool to handle the presence of zero\ndynamics which are asymptotically but not locally exponentially stable in\nproblems of robust nonlinear stabilization by output feedback. We show how it\nis possible to design locally Lipschitz stabilizers under conditions which only\nrely upon a partial detectability assumption on the controlled plant, by\nobtaining a robust stabilizing paradigm which is not based on design of\nobservers and separation principles. The main design idea comes from recent\nachievements in the field of output regulation and specifically in the design\nof nonlinear internal models.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0810.5505%2C0810.1976%2C0810.1918%2C0810.5364%2C0810.1151%2C0810.0601%2C0810.0385%2C0810.4689%2C0810.3604%2C0810.4966%2C0810.4073%2C0810.4955%2C0810.1665%2C0810.0282%2C0810.2644%2C0810.1585%2C0810.0809%2C0810.4275%2C0810.5428%2C0810.5562%2C0810.0530%2C0810.5139%2C0810.1143%2C0810.2911%2C0810.5653%2C0810.4041%2C0810.1841%2C0810.3303%2C0810.5392%2C0810.3163%2C0810.3475%2C0810.4887%2C0810.5312%2C0810.3582%2C0810.4063%2C0810.1867%2C0810.5550%2C0810.0054%2C0810.2823%2C0810.5083%2C0810.0557%2C0810.0407%2C0810.3787%2C0810.4037%2C0810.0267%2C0810.3228%2C0810.3910%2C0810.0708%2C0810.1129%2C0810.4254%2C0810.0523%2C0810.0718%2C0810.0226%2C0810.3668%2C0810.0252%2C0810.2790%2C0810.3027%2C0810.0788%2C0810.3811%2C0810.3982%2C0810.1874%2C0810.0792%2C0810.1334%2C0810.3624%2C0810.3707%2C0810.0105%2C0810.0739%2C0810.4471%2C0810.0284%2C0810.0483%2C0810.2962%2C0810.4117%2C0810.1766%2C0810.5441%2C0810.3151%2C0810.1495%2C0810.3229%2C0810.4843%2C0810.3306%2C0810.0873%2C0810.4610%2C0810.5107%2C0810.4009%2C0810.1517%2C0810.1739%2C0810.3542%2C0810.0364%2C0810.1849%2C0810.4302%2C0810.1967%2C0810.4703%2C0810.2159%2C0810.2986%2C0810.1903%2C0810.0712%2C0810.5368%2C0810.1948%2C0810.0203%2C0810.4172%2C0810.1175%2C0810.4193&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "In this paper we present a general tool to handle the presence of zero\ndynamics which are asymptotically but not locally exponentially stable in\nproblems of robust nonlinear stabilization by output feedback. We show how it\nis possible to design locally Lipschitz stabilizers under conditions which only\nrely upon a partial detectability assumption on the controlled plant, by\nobtaining a robust stabilizing paradigm which is not based on design of\nobservers and separation principles. The main design idea comes from recent\nachievements in the field of output regulation and specifically in the design\nof nonlinear internal models."}, "authors": ["L. Marconi", "L. Praly", "A. Isidori"], "author_detail": {"name": "A. Isidori"}, "author": "A. Isidori", "arxiv_comment": "30 pages. Preliminary versions accepted at the 47th IEEE Conference\n  on Decision and Control, 2008", "links": [{"href": "http://arxiv.org/abs/0810.0364v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0810.0364v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "math.OC", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "math.OC", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "math.DS", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "93C10; 93B51", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0810.0364v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0810.0364v1", "journal_reference": null, "doi": null, "fulltext": "arXiv:0810.0364v1 [math.OC] 2 Oct 2008\n\nRobust Asymptotic Stabilization of Nonlinear Systems\nwith Non-Hyperbolic Zero Dynamics\nL. Marconi◦, L. Praly∗, A. Isidori◦†\n◦\n\nC.A.SY. – DEIS, University of Bologna, Bologna, Italy.\n∗\n\n†\n\nÉcole des Mines de Paris, Fontainebleau, France.\nDIS, Università di Roma \"La Sapienza\", Rome, Italy.\nNovember 2, 2018\nAbstract\n\nIn this paper we present a general tool to handle the presence of zero dynamics which\nare asymptotically but not locally exponentially stable in problems of robust nonlinear\nstabilization by output feedback. We show how it is possible to design locally Lipschitz\nstabilizers under conditions which only rely upon a partial detectability assumption\non the controlled plant, by obtaining a robust stabilizing paradigm which is not based\non design of observers and separation principles. The main design idea comes from\nrecent achievements in the field of output regulation and specifically in the design of\nnonlinear internal models.\n\n1\n\nIntroduction\n\nThe problem of output feedback stabilization in the large for nonlinear systems has been\nthe subject of a remarkable research attempt in the last twenty years or so (see [11]). The\nattempt has been initially turned to identify systematic design procedures for state-feedback\nstabilization of specific classes of nonlinear systems. To this respect it is worth mentioning the research current focused on back-stepping design procedures for lower triangular\nnonlinear systems with [15] for the global case and [27] for the semiglobal case. Then, the\nattention of the researchers shifted to the identification of partial-state and output feedback\nstabilization algorithms mainly addressed in a semi-global sense due to intrinsic limitations\ncharacterizing this class of problems (see [22]). Within the number of research directions\nundertaken in this field, a special role has been played by nonlinear separation principles\nbased on the design of an explicit full state observer (see [28]). The main limitation of this\napproach is, thought, the lack of a guaranteed level of robustness of the resulting controller\nmainly due to the absence of a well-established theory of robust nonlinear state observers.\n1\n\n\fFurthermore, full state observability of the controlled plant is not, in principle, a necessary\ncondition for output feedback stabilization. A step forward to overcome these limitations\nhas been taken in [27] with the definition of Uniform Completely Observable (UCO) statefeedback control law, namely a stabilizing state dependent law which can be expressed as\nnonlinear function of the control input and output and their time derivatives. In this case\nthe issue is not to estimate the full-state but rather to reproduce directly the stabilizing law\nthrough the estimation of the input-output derivatives. This, in [27], has been achieved by\na mix of back-stepping and partial-state observation techniques yielding an output feedback\nstabilizer which is robust in the measure in which the UCO function does not depend on\nthe uncertainties and the UCO control law is vanishing on the desired asymptotic attractor.\nFurthermore the asymptotic features of the resulting closed-loop system are subjected to the\nrequirement that the initial state-feedback UCO-based closed-loop system is locally exponential stable. Practical stability must be accepted otherwise (see also [5] at this regard).\nThe latter limitation may be overtaken with the design of a local nonlinear observer in the\nspirit of [28] by resuming again nonlinear separation principles. However, so-doing, the same\nlimitations outlined before come out.\nExponential stability assumptions are recurrent in several contexts of nonlinear control literature while studying asymptotic behaviors of nonlinear systems. Backstepping ([7], [27]),\nin which the backstepped control law is usually required to exponentially stabilize the controlled dynamics, singular perturbation ([16], [30]), in which the so-called boundary layer\nsystem is required to posses an exponentially stable attractor, averaging ([24], [30]), in which\nexponential stability of the so-called averaged system is needed, stabilization by output feedback ([11], [27]), in which hyperbolic minimum-phase assumptions are usually required, are\njust a few contexts, involving problems of both synthesis and analysis of nonlinear systems,\nwhere the possibility of concluding asymptotic (and not only practical) results relies upon\nrequirements that certain dynamics fulfill exponential stability assumptions. A particular\nmention must be done for the design of output feedback stabilizers for nonlinear systems\nwhich can be written in so-called normal form (see [11]). In this context exponential stability of the so-called zero dynamics (that is, hyperbolic zero dynamics) is very often a crucial\npre-requisite if one is willing to address robust output feedback stabilization by means of\nlocally Lipschitz regulators.\nIn this paper we present a tool to handle the presence of not necessarily hyperbolic zero\ndynamics in the stabilization of nonlinear systems by output feedback. As particular application, the tool is then used to extend the main \"UCO\" results presented in [27] by, so doing,\novertaking the obstacle of exponential stability in the backstepping procedure and output\nderivatives observer design. More specifically, by means of the mathematical tools which\nhave been developed in a context of nonlinear output regulation (see [18]), [3]), we show\nhow the design of a dynamic output feedback control law which asymptotically stabilizes a\ncompact attractor can be obtained by starting from a UCO state-feedback control law which\ndoes not necessarily stabilize in exponential way the desired asymptotic attractor and which\nis not necessarily vanishing on it. We will show that these limitations can be removed by\nmeans of design techniques aiming to robustly get rid of interconnections terms between\n2\n\n\fnonlinear dynamics arising in the stability analysis which are not vanishing on the desired\nasymptotic attractor and which, as a consequence, can not be dominated only by means of\nhigh-gain. This will lead to identify a dynamic back-stepping and an extended partial-state\nobserver algorithms which embed solution techniques typical of internal model-based design.\nThis work is organized as follows. In the next section the framework and the general result is\ngiven. Then, Section 3 discusses the proposed framework and solution by properly framing\nthe result in the existing literature. Section 4, articulated in three subsections, is focused on\nthe application of the proposed tool in the UCO context presented in [27]. Then, Section\n5 presents a few conditions, obtained by mild adaptation of results proposed in the output\nregulation literature, useful to construct the dynamic regulator which solve the problem discussed in Section 2. Finally Section 6 and 7 concludes with an example and final remarks.\nNotation For x ∈ IRn , |x| denotes the Euclidean norm and, for C a closed subset of IRn ,\n|x|C = miny∈C |x−y| denotes the distance of x from C. For S a subset of IRn , clS and intS are\nthe closure of S and the interior of S respectively, and ∂S its boundary. A class-KL function\nβ(*, *) satisfying |s| ≤ d ⇒ β(t, s) ≤ Ne−λt |s| for some positive d, N, λ is said to be a locally\nexponential class-KL function. For a locally Lipschitz system of the form ż = f (z) the value\nat time t of the solution passing through z0 at time t = 0 will be written as φf (t, z0 ) or, if the\ninitial condition and the system are clear from the context, as z(t) or z(t, z0 ). For a smooth\nsystem ẋ = f (x), x ∈ IRn , a compact set A is said to be LAS(X ) (respectively LES(X )),\nwith X ⊂ IRn a compact set, if it is locally asymptotically (respectively exponentially) stable\nwith a domain of attraction containing X . By D(A) we denote the domain of attraction\nof A if the latter is LAS/LES for a given dynamics. For a function f : IRn → IRn and a\ndifferentiable real-valued function q : IRn → IR, Lf q(x) denote the Lie derivative at x of q\nalong f . For a smooth system ẋ = f (x), x ∈ IRn the ω-limit set of a subset B ⊂ IRn , written\nω(B), is the set of all points x ∈ IRn for which there exists a sequence of pairs (xk , tk ), with\nxk ∈ B and tk → ∞ as k → ∞, such that limk→∞ φf (tk , xk ) = x.\n\n2\n\nThe framework and the main result\n\nThe main goal of this paper is to present a design tool to handle the presence of asymptotically but not necessarily exponentially stable zero dynamics in robust output-feedback\nstabilization problems of nonlinear systems. Although the tool we are going to present lends\nitself to be useful in a significant variety of control scenarios, in order to keep confined the\ndiscussion while maintaining a certain degree of generality, we focus our attention on the\nclass of smooth systems of the form\nẋ = f (w, x, y)\nẏ = κ Ay + B(q(w, x, y) + v)\n\nx ∈ IRn , n ≥ 0\ny ∈ IRr , r ≥ 1\n\nwith measurable output\nym ∈ IR\n\nym = Cy\n\n3\n\n(1)\n\n\fin which the linear system (A, B, C) is assumed to have relative degree r with the pair (A, C)\nobservable, κ is a positive design parameter and v is a control input. In the previous system\nthe variable w ∈ IRs represents an exogenous variable which is governed by\nẇ = s(w)\n\nw ∈ W ⊂ IRs\n\n(2)\n\nwith W a compact set which is invariant for (2). As a particular case, the signals w(t) generated by (2) may be constant signals, i.e. s(w) ≡ 0, namely constant uncertain parameters\ntaking value in the set W and affecting the system (1). In general, the variables w can be\nconsidered as exogenous signals which, depending on the considered control scenario, may\nrepresent references to be tracked and/or disturbances to be rejected.\nRemark 1 As a consequence of the fact that W is a (forward and backward) invariant set\nfor (2), the closed cylinder Cn+r := W × IRn+r is invariant for (1),(2). Thus it is natural to\nregard system (1), (2) on Cn+r and endow the latter with the relative topology. This will be\ndone from now on by referring to system (1),(2). Analogously, the dynamics described by the\nfirst n equations of (1) and by (2) will be thought as evolving on the closed set Cn := W ×IRn\nwhich will be endowed with the relative topology. ⊳\nWe shall study the previous system under the following \"minimum-phase\" assumption.\nAssumption There exist compact sets A ⊂ Cn which is locally asymptotically stable for\nthe system\nẇ = s(w)\n(3)\nẋ = f (w, x, 0) . ⊳\nUnder this assumption, there exists a compact set X ⊂ Cn such that A ⊂ intX and A is\nLAS(X ) for system (3).\nIn this framework we consider the output feedback stabilization problem which consists of\ndesigning a locally Lipschitz regulator of the form\nη̇ = φk (η, ym)\n\nv = ρk (η, ym )\n\nη ∈ IRν ,\n\n(4)\n\nand, given arbitrary bounded sets Y ⊂ IRr and N ⊂ IRν , a positive κ⋆ , such that for all\nκ ≥ κ⋆ and for some B ⊂ IRν+n the set B × {0} is LAS(N × X × Y) for the closed-loop\nsystem (1), (4).\nThe important point here is that φk and ρk must be locally Lipschitz. This restriction has strong practical motivations like sensitivity to noise or numeric and discrete time\nimplementation.\nThe goal of the following part is to present a result regarding the solution of the robust\nstabilization problem formulated above. In order to ease the notation, in the following we\nshall drop in (1) the dependence from the variable w which, in turn, will be thought as\nembedded in the variable x (with the latter varying in the set Cn ). This, with a mild abuse\nof notation, will allow us to rewrite system (1) and (2) in the more compact form\nẋ = f (x, y)\nẏ = κ Ay + B(q(x, y) + v)\n4\n\nx ∈ Cn ⊂ IRs+n\ny ∈ IRr\n\n(5)\n\n\fand system (3) as ẋ = f (x, 0).\nThe existence of a locally Lipschitz regulator solving the problem at hand, will be claimed\nunder an assumption which involves the ability of asymptotically reproducing the function\nq(x(t), 0), where x(t) is any solution of ẋ = f (x, 0) which can be generated by taking initial\nconditions on A, by means of a locally Lipschitz system properly defined. The following\ndefinition aims to formally state the required reproducibility conditions which will be then\nused in the forthcoming Theorem 2.\nDefinition 1 (LER, rLER). A triplet (F (*), Q(*), A), where F : IRm → IRm and Q : IRm →\nIR are smooth functions and A ⊂ IRm is a compact set, is said to be Locally Exponentially\nReproducible (LER), if there exists a compact set R ⊇ A which is LES for ż = F (z) and,\nfor any bounded set Z contained in the domain of attraction of R, there exist an integer p,\nlocally Lipschitz functions φ : IRp → IRp , γ : IRp → IR, and ψ : IRp → IRp , with ψ a complete\nvector field, and a locally Lipschitz function T : IRm → IRp , such that\nQ(z) + γ(T (z)) = 0\n\n∀ z ∈ R,\n\n(6)\n\nand for all ξ0 ∈ IRp and z0 ∈ Z the solution (ξ(t), z(t)) of\nż = F (z)\nz(0) = z0\nξ ̇ = φ(ξ) + ψ(ξ) Q(z) ξ(0) = ξ0\n\n(7)\n\n|(ξ(t), z(t))|graph T |R ≤ β(t, |(ξ0, z0 )|graph T |R )\n\n(8)\n\nsatisfies\nwhere β(*, *) is a locally exponentially class-KL function.\nFurthermore the triplet in question is said to be robustly Locally Exponentially Reproducible (rLER) if it is LER and, in addition, for all locally essentially bounded v(t), for all\nξ0 ∈ IRp and z0 ∈ Z the solution (ξ(t), z(t)) of\nż = F (z)\nz(0) = z0\nξ ̇ = φ(ξ) + ψ(ξ)[Q(z) + v(t)] ξ(0) = ξ0\n\n(9)\n\n|(ξ(t), z(t))|graph T |R ≤ β(t, |(ξ0, z0 )|graph T |R ) + l(sup |v(τ )|)\n\n(10)\n\nsatisfies\nτ ≤t\n\nwhere β(*, *) is a locally exponentially class-KL function and l is a class-K function. ⊳\nWe postpone to Section 3 a broad discussion about this definition and to Section 5 the\npresentation of sufficient conditions for a triplet to be rLER.\nWith this definition at hand, we pass to formulate the following theorem which fixes a\nframework where the stabilization problem previously formulated can be solved by means of\na locally Lipschitz regulator. The proof of this theorem can be found in Appendix A.\n\n5\n\n\fTheorem 2 Let A be LAS(X ) for the system ẋ = f (x, 0) for some compact set X ⊂ Cn .\nAssume, in addition, that the triplet (f (x, 0), q(x, 0), A) is LER. Then there exist a locally\nLipschitz regulator of the form (4), a compact set R ⊇ A, a continuous function τ : R → IRν ,\nand, for any compact set Y ⊂ IRr and N ⊂ IRν , a positive constant κ⋆ , such that for all\nκ ≥ κ⋆ the set\ngraphτ × {0} = {(η, x, y) ∈ IRν × R × IRr\n\n:\n\nη = τ (x) , y = 0}\n\n(11)\n\nis LES(N × X × Y) for (5), (4) and the set\ngraph τ |A × {0} = {(η, x, y) ∈ IRν × A × IRr\n\n:\n\nη = τ (x) , y = 0}\n\n(12)\n\nis LAS(N × X × Y) for (5), (4). Furthermore, if A is also LES for the system ẋ = f (x, 0),\nthe set R can be taken equal to A.\nRemark 3 By going throughout the proof of the previous theorem, it turns out that the\nregulator (4) solving the problem at hand has the form\nη̇ = φ(η) − ψ(η)[γ(η) + κB T Ay]\nv = γ(η)\nin which κ is a sufficiently large positive number and (φ(*), ψ(*), γ(*)) are the locally Lipschitz\nfunctions which are associated to the triplet (f (x, 0), q(x, 0), A) in the definition of local\nexponential reproducibility. ⊳\n\n3\n\nA brief digression about the problem\n\nThe structure of (1) and the associated problem, apparently very specific, are indeed recurrent in a number of control scenarios in which robust non linear stabilization is involved.\nWe refer to Section 4.1 for the presentation of a few relevant cases where this occurs. For\nthe time being it is interesting to note how the previous formulation presents two main peculiarities which make the problem at hand particularly challenging.\nThe first is that the function q(w, x, y), coupling the x and y subsystem in (1), is not necessarily vanishing on the desired attractor A × {0}, namely the desired attractor A × {0} is\nnot necessarily forward invariant for (1) in the case v ≡ 0. In this respect the first crucial\nproperty required to the regulator is to be able to reproduce, through the input v, the uncertain coupling term q(w, x, 0) by providing a not necessarily zero steady-state control input.\nThis issue is intimately connected to arguments which are usually addressed in the output\nregulation literature (see [18], [3]), [10], [26]), in which the goal is precisely to make attractive a set, on which regulation objectives are met, which is not invariant for the open-loop\nsystem.\nThe second peculiarity, apparently not correlated to the previous one, relies in the fact\nthat the set A is assumed to be \"only\" asymptotically stable for (3) and no exponential\n6\n\n\fproperties are required. In this respect the study of the interconnection (1) is particularly\nchallenging as it is not sufficient, in general, to decrease the linear asymptotic gain ([29])\nbetween the \"inputs\" x and the \"outputs\" y of the y-subsystem (which is what one would\nmake by increasing the value of κ since the matrix A is Hurwitz) to infer asymptotic properties in the interconnection. Indeed the presence of a not necessarily linear asymptotic gain\nbetween the \"inputs\" y and the \"outputs\" x of the x-subsystem requires a non trivial design\nof the input v which, intuitively, should be chosen to infer a certain locally non-Lipschitz\nISS gain to the y-subsystem.\nThe rich available literature on nonlinear stabilization already provides successful tools\nto solve the problem at hand if the previous two pathologies are dropped, namely if the\nassumption is strengthen by asking that the set A is also LES(X ) for (3) and that the\n\"coupling\" term q(w, x, y) is vanishing at A × {0}. As a matter of fact, under the previous conditions, it is a well-known fact that the set A × {0}, which is forward invariant\nfor (1) with v = 0, can be stabilized by means of a large value of k as formalized in ([27], [2]).\nIn the case A is not exponentially stable for (3) and/or the coupling term q(w, x, y) is not\nvanishing on the desired attractor, the problem becomes challenging and more sophisticated\nchoices for v must be envisaged. In particular, while preserving the local Lipschitz property\nof the regulator, the only conclusions which can be drawn if v ≡ 0 is that the origin is\nsemiglobally practically stable in the parameter κ, that is the trajectories of the system can\nbe steered arbitrary close to the set A × {0} by increasing the value of κ (see [27], [2], [18]).\nEven in the simpler scenario in which q(w, x, 0) ≡ 0 for all (w, x) ∈ A, a large value of k\nis not sufficient to enforce the desired asymptotic behavior in the case the set A fails to be\nexponentially stable for (3). In this case the asymptotic properties of the system have been\nstudied in [5] by showing how the trajectories are attracted by a manifold which, only in a\nparticular case depending on the linear approximation of the system, collapses to the origin\n(see Theorem 6.2 in [5]).\nIn these critical scenarios an appropriate design of the control input v becomes inevitable\nin order to compensate for the coupling term q(w, x, y) which cannot be only dominated by\na large value of κ. In particular, a first possible option, motivated by small gain arguments\nand gain assignment procedures for nonlinear systems (see [14], [13]), is to design the control\nv in order to assign, to the y-subsystem, a certain nonlinear ISS gain suitably identified\naccording to small gain criterions and to the asymptotic gain of the x-subsystem (1). This\noption, however, necessarily leads to design control laws which are not, in general, locally\nLipschitz close to the compact attractor and, thus, which violates a basic requirement of the\nabove problem.\nAn alternative option to design the control v is to be inspired by nonlinear separation principles (see, besides others, [27], [28], [2], [11], [8]), namely to design an appropriate state\nobserver yielding an asymptotic estimate (ŵ, x̂, ŷ) of the state variables, and to asymptotically compensate for the coupling term q(w, x, y) by implementing a \"certainty equivalence\"\ncontrol law of the form v = −q(ŵ, x̂, ŷ). Indeed, under suitable conditions, the tools proposed\nin [28] would allow one to precisely fix the details and to solve the problem at hand in a\n7\n\n\frigorous way. This way of approaching the problem, though, presents a number of drawbacks\nwhich substantially limit its applicability. First, the design of the observer clearly requires\nthe formulation of suitable observability assumptions1 on the controlled plant, and in particular of its (w, x) components, not in principle necessary for the stabilization problem to be\nsolvable, which may be not fulfilled for a number of relevant cases. Moreover, according to\nthe state-of-the-art of the observer design literature ([8]), the design of the observer may be\na challenging (if not impossible) task in case of uncertain parameters affecting the observed\ndynamics. Finally, it is worth noting how approaching the problem according to the previous\ndesign philosophy, leads to inherently redundant control structures, by requiring the explicit\nestimate of the full state (and of possible uncertainties) in order to reproduce the signal\nq(w, x, y).\nAs opposite to the previous strategies, Theorem 2 provides a design procedure which does\nnot rely upon domination of the interconnection term q(w, x, y) but rather on its asymptotic reconstruction which, however, it is not based upon the design of an observer of the\nstate variables (w, x, y). In this respect the crucial property underlying the Theorem is the\nlocal exponential reproducibility property which, according to its definition, relies upon two\nrequirements. The key first requirement, for a triplet (F, Q, A) to be LER, is that there\nexists a set R which contains A and which is LES for the autonomous system ż = F (z).\nThe second crucial requirement characterizing the definition is that there exists a locally\nLipschitz system of the form\nξ ̇ = φ(ξ) + ψ(ξ)uξ\n(13)\nyξ = γ(ξ)\nwith input uξ and output yξ , such that system (7), modelling the cascade connection of the\nautonomous system ż = F (z) with output yz = Q(z) with the system (13), has a locally\nexponentially stable set described by graph T |R and, on this set, the output yξ equals yz (see\n(6)). The domain of attraction of graph T |R is required to be of the form Z ×IRp with Z any\ncompact set in the domain of attraction of R (note that, according to the definition, system\n(13) is allowed to depend on the choice of Z). In this respect the second requirement can be\nregarded as the ability, of the system (13), of asymptotically reproducing the output function\nQ(z(t)) of system ż(t) = F (z(t)) with initial conditions of the latter taken in Z. Note how\nthe \"output reproducibility\" property required to system (13) does not hide, in principle,\nany kind of state observability property of the system ż = F (z) with output yz = Q(z). In\nother words system (13) must be not confused with a state observer of the z-subsystem as\nits role is to reproduce the output function Q(z(t)) and not necessarily to estimate its state.\nAs the definition of robust LER, we only note that, in addition to the previous properties,\nit is required that system (9) exhibits an ISS property (without any special requirement on\nthe asymptotic gain) with respect to the exogenous input v.\n1\nIt must be noted that only local observability notion are potentially needed at this level as a consequence\nof the fact that practical stability is already guaranteed by the high-gain law κ.\n\n8\n\n\f4\n4.1\n\nApplications\nOutput-feedback from UCO state-feedback in presence of nonhyperbolic attractors\n\nIn this part we show how the theory of robust nonlinear separation principle presented in\n[27], [2] can be extended with the tools developed in the previous sections. In particular we\nare interested to extend the theory of [27] by showing how to design a pure output-feedback\nsemiglobal controller stabilizing an attractor when it is known how the latter can be asymptotically (but not exponentially) stabilized by means of a Uniform Completely Observable\n(UCO) state-feedback controller.\nConsider the smooth system\nw ∈ W ⊂ IRs\nz ∈ IRm , u ∈ IR\ny ∈ IR\n\nẇ = s(w)\nż = A(w, z, u)\ny = C(w, z)\n\n(14)\n\nin which u and y are respectively the control input and the measured output and W is\na compact set which is invariant for ẇ = s(w). As discussed in the previous section, the\nvariables w emphasize the possible presence of parametric uncertainties and/or disturbance\nto be rejected and/or reference to be tracked (in the latter case the measurable output y\nplays more likely the role of regulation/tracking error). As done before, in order to simplify\nthe notation, we drop the dependence of the variable w and we compact system (14) in the\nmore convenient form\nz ∈ IRm , u ∈ IR\ny ∈ IR\n\nż = A(z, u)\ny = C(z)\n\n(15)\n\nwhich is supposed to evolve on a closed invariant set Cm which is endowed with the subset\ntopology (such a closed set being, in the form (14), the closed cylinder Cm := W × IRm ).\nWe recall (see [27]) that a function ū : IRm → IR is said to be UCO with respect to (15)\nif there exist two integers ny , nu and a C 1 function Ψ such that, for each solution of\nż = A(z, u0 )\nu̇i = ui+1\ni = 0, . . . , nu − 1\nu̇nu = v\n\n(16)\n\nwe have, for all t where the solution makes sense,\nū(z(t)) = Ψ(y(t), y (1)(t), . . . , y (ny ) (t), u0 (t), . . . , unu (t))\nwhere y (i) (t) denotes the ith derivative of y at time t.\nMotivated by [27] we shall study system (15) under the following two assumptions:\n\n9\n\n(17)\n\n\fa) there exist a smooth function ū : IRm → IR and compact sets A ⊂ Cm and Z ⊂ Cm ,\nsuch that the A is LAS(Z) for system (15) with u = ū(z);2\nb) ū(z) is UCO with respect to (15).\nIn this framework we shall be able to prove, under suitable reproducibility conditions\nspecified later, that the previous two assumptions imply the existence of a locally Lipschitz\ndynamic output feedback regulator able to asymptotically stabilize the set A. The main\ntheorem in this direction is detailed next. In this theorem we refer to an integer lu ≥ nu\ndefined as that number such that for the system\nż = A(z, ξ0 )\n ̇ξ0 = ξ1\n..\n.\n ̇ξl = u1 ,\n\n(18)\n\nu\n\nthere exist smooth functions Ci such that the first ny +1 time derivatives of y can be expressed\nas\n∀ i = 0, . . . , ny + 1 .\ny (i) = Ci (z, ξ0 , . . . , ξlu )\nTheorem 4 Consider system (15) and assume the existence of a compact set A ⊂ Cm and of\na smooth function ū(z) such that properties (a) and (b) specified above are satisfied. Assume,\nin addition, that the triplets\n(l +1)\n\n(19)\n\n(n +1)\n\n(20)\n\nu\n(A(z, ū(z)), LA(z,ū(z))\nū(z), A)\n\nand\n\ny\n(A(z, ū(z)), LA(z,ū(z))\nC(z), A)\n\nare rLER. Then there exist a positive o, a compact set B ⊂ IRo and, for any N ⊂ IRo , a\nlocally Lipschitz controller of the form\nζ̇ = Φ(ζ, y)\nu = Υ(ζ, y)\n\nζ ∈ IRo\n\n(21)\n\nsuch that the set A × B is LAS(Z × N ) for the closed-loop system (15), (21).\nThis result extends Theorem 1.1 of [27] in three directions. First, note that we are\ndealing with stabilization of compact attractors for systems evolving on closed sets. This is\na technical improvement on which, though, we would not like to put the emphasis. Second,\nnote that the UCO control law ū(z) is not required to be vanishing on the attractor A\nwhich, as a consequence, is not required to be forward invariant for the open loop system\n2\n\nBy referring to (14), a meaningful case to be considered is when A = W ×{0}, in which case this assumption amounts to require the existence of a state feedback stabilizer, possibly dependent on the uncertainties,\nable to asymptotically stabilize the origin with a certain domain of attraction.\n\n10\n\n\f(15) with u ≡ 0. In this respect the proposed setting can be seen as also able to frame\noutput regulation problems. Finally, the previous result claims that, by means of a pure\nlocally Lipschitz output feedback controller, we are able to restore the asymptotic properties\nof an UCO controller without relying upon exponential stability requirements of the latter\nand robustly with respect to uncertain parameters. The last two extensions are conceptually\nvery much relevant and can be seen as particular application of the tools presented in the\nprevious sections. Following the main laying of [27], the proof of the claim is divided in two\nsubsections which contain results interesting on their own.\n\n4.2\n\nRobust Asymptotic Backstepping\n\nIn this part we discuss how the UCO control law ū can be robustly back-step through the\nchain of integrators of (16). As commented above, the forthcoming proposition extends in a\nnot trivial way the results of [27] in the measure in which one considers the fact that ū(z)\nis not vanishing on the attractor and that A is not necessarily locally exponential stable for\nthe closed-loop system.\nWe show that the existence of the static UCO stabilizer for (15) implies the existence of a\ndynamic stabilizer for (18) using the partial state ξi , i = 0, . . . , lu , and the output derivatives\ny (i) , i = 1, . . . , ny . This is formally proved in the next proposition.\nProposition 1 Consider system (18) under the assumption (a) previously formulated. Assume that the triplet (19) is rLER. Then there exists a positive ν, a compact set R ⊃ A, a\ncontinuous function τ : R → IRν+lu +1 , and, for any compact set Ξ′ ⊂ IRlu +1 and N ′ ⊂ IRν ,\na locally Lipschitz regulator of the form\nη̇ = φ(η, ξ, ū(z))\nu1 = ρ(η, ξ, ū(z)) ,\n\nη ∈ IRν\n\n(22)\n\nwith ξ = col(ξ0 , . . . , ξlu ) such that the sets\ngraph τ := {(z, ξ, η) ∈ R × IRlu +1 × IRν : (ξ, η) = τ (z)}\n\n(23)\n\nand\ngraph τ |A := {(z, ξ, η) ∈ A × IRlu +1 × IRν : (ξ, η) = τ (z)}\n\nare respectively LES(Z × Ξ′ × N ′) and LAS(Z × Ξ′ × N ′ ) for the closed-loop system (18),\n(22).\nProof. Consider the change of variables\nξ0 → ξ ̃0 := ξ0 − ū(z)\nξi → ξ ̃i := ξi − ū(i) (z, ξ ̃0 , . . . , ξ ̃i−1 ) i = 1, . . . , lu\n\n11\n\n\fwhere the ū(i) (z), i = 1, . . . , lu , are recursively defined as\n∂ ū(z)\nA(z, ξ ̃0 + ū(z))\n∂z\n∂ ū(i−1) (z, ξ ̃0 , . . . ξ ̃i−2 )\nū(i) (z, ξ ̃0 , . . . , ξ ̃i−1 ) :=\nA(z, ξ ̃0 + ū(z))+\n∂z\ni−2\nX\n∂ ū(i−1) (z, ξ ̃0 , . . . ξ ̃i−2 )  ̃\nξj+1\ni = 2, . . . , lu ,\n∂ ξ ̃j\nj=0\nū(1) (z, ξ ̃0 ) :=\n\nand the further change of variable\nξ ̃i , → ζi := g −i ξ ̃i\n\ni = 0, . . . , lu − 1\n\nξ ̃lu → ζlu := ξ ̃lu −\n\nlX\nu −1\n\nai g lu −i ξ ̃i\n\ni=0\n\nwhere g is a positive design parameter and the ai 's are coefficients of an Hurwitz polynomial.\nBy letting ζ := col(ζ0 , . . . , ζlu −1 ) system (18) in the new coordinates reads as\nż = A(z, ū(z)) + Ã(z, Cζ)\nζ̇ = gHζ + Bζlu\nζ̇lu = u1 + lg (z, ζ, ζlu )\n\n(24)\n\nwhere B = col(0, . . . , 0, 1), C = (1, 0, . . . , 0), Ã(z, Cζ) = A(z, ξ ̃0 + ū(z)) − A(z, ū(z)), H is a\nHurwitz matrix and lg (*) is a smooth function such that\n(l +1)\n\nu\nlg (z, 0, 0) = −LA(z,ū(z))\nū(z)\n\n∀ z ∈ IRn .\n\n(25)\n\nAs the triplet (19) is rLER, there exists a compact set R ⊇ A which is LES for ż = A(z, ū(z))\nwith D(R) ⊇ D(A). Furthermore, by the fact that (19) is rLER and by definition of rLER,\n(lu +1)\nalso the triplet (A(z, ū(z)), −LA(z,ū(z))\nū(z), R) is rLER. We consider now the zero dynamics,\nwith respect to the input u1 and output ζlu , of system (24) given by\nż = A(z, ū(z)) + Ã(z, Cζ)\nζ̇ = gHζ\n\n(26)\n\nFor this system it can be proved (by means of arguments which, for instance, can be found\nin [18]), that for any compact set M ∈ IRlu there exists a g ⋆ > 0 such that for all g ≥ g ⋆\nthe sets R × {0} and A × {0} are respectively LES(Z × M) and LAS(Z × M) for (26).\nFix, once for all, g ≥ g ⋆ . By the previous facts, by (25), by the fact that the triplet\n(lu +1)\n(A(z, ū(z)), −LA(z,ū(z))\nū(z), R) is rLER, and by Proposition 6 in Appendix B, it follows that\nthe triplet ((26), lg (z, ζ, 0), R × {0}) is LER. Now fix\nu1 = −κζlu + v\n12\n\n(27)\n\n\fwhere κ is a positive design parameters and v is a residual control input. From the previous\nresults, it follows that system (24) with (27) fits in the framework of Theorem 2 , by which\nit is possible to conclude that there exists a locally Lipschitz controller of the form\nξ ̇ = Φ′k (ξ, ζlu )\n\nξ ∈ IRp ,\n\nv = Υ′k (ξ, ζlu )\n\n(28)\n\na continuous function τ ′ : R × {0} → IRp and, for any compact set Mlu ⊂ IR and N ′ ⊂ IRp ,\na positive constant κ⋆ , such that for all κ ≥ κ⋆ the set\ngraphτ ′ × {0} = {((z, ζ), ζlu , ξ) ∈ (R × {0}) × IR × IRp\n\n:\n\nζlu = 0 , ξ = τ ′ (z, ζ)}\n\nis LES(Z × M × Mlu × N ′ ) for (24), (27) and (28). Furthermore, by properly adapting\nthe arguments at the end of the proof of Theorem 2, it is possible also to prove that the set\ngraph τ ′ |A×{0} × {0} is LAS(Z × M × Mlu × N ′) for (24), (27) and (28).\nThe previous facts have shown how to solve the problem at hand by means of a partial\nstate feedback regulator (namely a regulator processing ξ ̃0 = ξ0 − ū(z) and its first lu time\nderivatives ξ ̃i ) of the form\nξ ̇ = Φ′k (ξ, ζlu )\nu1 = −κζlu + Υ′k (ξ, ζlu )\n\nζlu = ξ ̃lu −\n\nPlu −1\ni=0\n\nai g lu −1 ξ ̃i .\n\n(29)\n\nIn order to obtain a pure output feedback regulator of the form (22), we follow [27] and\ndesign a \"dirty derivatives\" observer-based regulator\nˆξ ̇ ̃ = ˆξ ̃ + Li+1 λ (ˆξ ̃ − ξ ̃ )\n0\ni 0\ni+1\ni\nˆξ ̇ ̃ = Llu +1 λ (ˆξ ̃ − ξ ̃ )\nr 0\n0\nlu\n′\nξ ̇ = Φk (ξ, ζ̂sat)\nu = −κζ̂sat + Υ′k (ξ, ζ̂sat)\n\ni = 0, . . . lu − 1\n(30)\n\nwhere L is a positive design parameters, the λi 's are such that the polynomial slu +λlu slu −1 +\n. . . + λ2 s + λ1 is Hurwitz and where\nζ̂sat = satl (ˆξ ̃lu − g lu −1 a0 ˆξ ̃1 − . . . − galu −1 ˆξ ̃lu −1 )\nin which satl (s) is the saturation function such that satl (s) = s if |s| ≤ l and satl (s) =\nl sgn(s) otherwise. Letting ξ ̃ = col(ξ ̃1 , . . . , ξ ̃lu ), ˆξ ̃ = col(ˆξ ̃1 , . . . , ˆξ ̃lu ), and defining the change\nof variables\nˆξ ̃ 7→ e := D (ξ ̃ − ˆξ)\n ̃\nL\n\nin which DL = diag(Llu −1 , . . . , L, 1), it turns out that the overall closed-loop system (24),\n(30) reads as\nẋ = φ(x) + ∆1 (x, e)\n(31)\nė = LHe + ∆2 (x, e)\n13\n\n\fwhere x := col(z, ζ, ζlu , ξ), ẋ = φ(x) is a compact representation of (24), (29), H is a Hurwitz\nmatrix and ∆1 (*) and ∆2 (*) are defined as\n\n0\n\n\n0\n\n∆1 (*) = \n κ(ζlu − ζ̂sat ) + Υ′k (ξ, ζ̂sat) − Υ′k (ξ, ζlu ) \nΦ′k (ξ, ζ̂sat) − Φ′k (ξ, ζlu )\n\n\nand\n\n\n\n\n\n∆2 (*) = \n\n\n\n\n0\n..\n.\n0\nκ(ζlu − ζ̂sat ) +\n\nΥ′k (ξ, ζ̂sat)\n\n− Υ′k (ξ, ζlu )\n\n\n\n\n\n\nBy construction the set graphτ ′ × {0} is LES(X ) for the system ẋ = φ(x) with X :=\n(Z × M) × Mlu × N ′ and, by construction, it turns out that for any l > 0, ∆1 (x, 0) ≡ 0 and\n∆2 (x, 0) ≡ 0 for all x ∈ graphτ ′ × {0}. Furthermore, for any compact M ∈ IRlu −1 , Mlu ∈ IR\nand M̂ ∈ IRlu , there exists a compact set E ⊂ IRlu (dependent on L) such that if ζ(0) ∈ M,\nˆ ̃\n∈ M̂ then e(0) ∈ E. Furthermore, by definition of saturation function,\nζlu ∈ Mlu and ξ(0)\nit turns out that for all x̄ > 0 there exist δ1 > 0 and δ2 > 0 such that |∆1 (x, e)| ≤ δ1 and\n∆2 (x, e) ≤ δ2 for all x, |x| ≤ x̄, e ∈ IR and L > 0.\nFrom these facts and by the result in [27], it follows that for any E ∈ IRlu there exists a\nL⋆ > 0 such that for all L ≥ L⋆ the set\ngraphτ ′ ×{0}×{0} = {((z, ζ), ζlu , ξ, e) ∈ (R×{0})×IR×IRp ×IRlu : ζlu = 0 , ξ = τ ′ (z, ζ) , e = 0}\nis LES(Z × M × Mlu × N ′ × E).\nFrom the previous results, the fact that A is LAS for the system ż = A(z, ū(z)), and the\nfact that on graphτ ′ × {0} × {0} the closed-loop dynamics is described by ż = A(z, ū(z))),\nthe desired result follows by properly adapting the omega-limit set arguments used at the\nend of the proof of Theorem 2.\n⊳\n\n4.3\n\nExtended Dirty Derivatives Observer\n\nIn this part we present a result which allows one to obtain a pure output feedback stabilizer\nonce a partial state-feedback stabilizer (namely a stabilizer processing the output and a\ncertain number of its time derivative) is known. Along the lines pioneered in [6] and [27], the\nidea is to substitute the knowledge of the time derivatives of the output with appropriate\nestimates provided by a \"dirty derivative observer\" (by using the terminology of [27]). In our\ncontext, though, we propose an \"extended\" dirty derivative observer, where the adjective\n\"extended\" is to emphasize the presence of a dynamic extension of the classical observer\nstructure motivated by the need of handling the presence of possible not exponentially stable\n14\n\n\fattractors in the partial-state feedback loop and the fact that, on this attractor, the measured\noutput is not necessarily vanishing.\nMore specifically we assume, for the system (15), the existence of a dynamic stabilizer of\nthe form\nς ̇ = φ̄(ς, y, y (1) , . . . , y (ny ) ) ς ∈ IRd\n(32)\nu = ρ̄(ς, y, y (1), . . . , y (ny ) )\nsuch that the following property hold for the closed-loop system:\na) there exists a compact set R ⊃ A and a continuous function τ : R → IRd such that\nthe sets graphτ and graph τ |A are respectively LES(Z × H) and LAS(Z × H) for the\nclosed-loop system (15), (32) for some compact set H ⊂ IRd ;\nb) there exist smooth functions Ci , i = 0, . . . , ny + 1, such that the output derivatives y (i)\nof the closed-loop system (15), (32) can be expressed as y (i) = Ci (z, ς), i = 0, . . . , ny +1\nand the following holds\nρ̄(ς, y, y (1) , . . . , y (ny ) )\n\ngraphτ\n\n= ū(z) .\n\nRemark 5 Note that the previous conditions are automatically satisfied under the assumptions of Section 4.1 and by virtue of the results presented in the previous section. As a\nmatter of fact, by bearing in mind (18) and Theorem 1 (and specifically (22)), the main\noutcome of the previous Section has been to design a dynamic controller of the form\nξ ̇0 =\n..\n.\n ̇ξlu =\nη̇ =\nu =\n\nξ1\nρ(η, ξ, ū(z))\nφ(η, ξ, ū(z))\nξ0\n\n(33)\n\nin which, according to (17) and to the definition of lu ,\nū(z) = Ψ(y, y (1), . . . , y (ny ) , ξ0 , . . . , ξny ) .\n\n(34)\n\nSystem (33), (34) is clearly in the form (32) and, according to the result of Theorem 1, the\nprevious conditions (a)-(b) are satisfied. ⊳\nWithin the previous framework we are able to prove the following proposition which,\nalong with Proposition 1 and the previous remark, immediately yields Theorem 4.\nProposition 2 Consider system (15) and assume the existence of a dynamic regulator of\nthe form (32) such that the previous properties (a)-(b) are satisfied. Assume, in addition,\nthat the triplet (20) is rLER. Then there exist a positive o, a compact set B ⊂ IRo and, for\nany compact set N ⊂ IRo , an output feedback controller of the form (21) such that the set\nA × B is LAS(Z × N ) for the closed-loop system (15), (21).\n15\n\n\fProof. As candidate controller, we consider a system of the form\nς ̇ = φ̄l (ς, y, ŷ1, . . . , ŷny )\nŷ ̇ i = ŷi+1 + Li+1 λi (ŷ0 − y)\nŷ ̇ ny = Lny +1 λny (ŷ0 − y) + v\nu = ρ̄l (ς, y, ŷ1, . . . , ŷny )\n\nin which v is a control input to be designed, L is a positive design parameters, the λi 's are\nthe coefficients of an Hurwitz polynomial and φ̄l (*) and ρ̄l are appropriate saturated versions\nof the functions φ̄(*) and ρ̄(*) of (32) satisfying φ̄l (s) = φ̄(s) if |φ̄(s)| ≤ l, |φ̄l (s)| ≤ l for all\ns, and ρ̄l (s) = ρ̄(s) if |ρ̄(s)| ≤ l, |ρ̄l (s)| ≤ l for all s, with l a design parameter.\nLet now yd = col(y, y (1), . . . , y (ny ) ), ŷ = col(ŷ0 , ŷ1 , . . . , ŷny ) and consider the change of\nvariables ŷ 7→ e = DL (yd − ŷ) where DL = diag(Lny , Lny −1 , . . . , 1). In this coordinate\nsetting, by denoting x = col( z ς ), the overall closed-loop system reads as\nẋ = f (x) + ∆(x, e)\nė = LHe + B(q(x) + v)\n\n(35)\n\nin which H is a Hurwitz matrix in observability canonical form, B = 0 . . . 0 1\nẋ = f (x) is a compact representation of the system (15), (32), q(x) = Cny +1 (z, ς) and\n\n\n0\n∆(x, e) =  A(z, ρ̄l (ς, y, ŷ1, . . . , ŷny )) − A(z, ρ̄(ς, y, y (1), . . . , y (ny ) )) \nφ̄l (ς, y, ŷ1, . . . , ŷny )) − φ̄(ς, y, y (1), . . . , y (ny ) ))\n\n\u0001T\n\nin which, in the latter, we have left the \"original\" coordinates ŷi for notational convenience.\n′\nBy definition of ∆, of ρ̄l and of φ̄l , it turns out that for any bounded set ZM\nand\np+ν\n⋆\n⋆\nH ⊂ IR , there exists an l such that for any l ≥ l\n∆(x, 0) = 0\n\n′\n∀ x ∈ ZM\n×H.\n\nFurthermore, by the fact that the triplet (20) is rLER it follows that there exists a\n′\n′\n′′\ncompact\nT ′ set R ⊃ A which is LES for ż = A(z, ū(z)) with D(R ) ⊇ D(A). Let R :=\nR R . By item (a) above and by going throughout the proof of Proposition 1, it turns\nout that graph τ |R′′ is LES for ẋ = f (x). Moreover, the set R′′ is LES for ż = A(z, ū(z))\nwith D(R′′ ) ⊇ D(A) and, by definition of rLER, it is possible to claim that the triplet\n(ny +1)\n(A(z, ū(z)), LA(z,ū(z))\nC(z), R′′ ) is rLER. From the previous facts, from the item (b) above,\nwhich implies that\nq(x)|graph τ |\n\n(n +1)\n\nR′′\n\ny\n= Cny +1 (z, τ (z)) = LA(z,ū(z))\nC(z) ,\n\nand by Proposition 6 in Appendix B, it follows that the triplet\n(f (x), q(x), graph τ |R′′ )\n16\n\n\fis LER. Thus system (35) fits in the framework of Theorem 2 (with graphτ |R′′ playing the\nrole of the set A) by which the result follows (by using the fact that graphτ |A is LAS for\nẋ = f (x) and by adapting the omega-limit set arguments at the end of the proof of Theorem\n2). ⊳\n⊳\n\n5\n\nSufficient conditions for exponential reproducibility\n\nHaving established with Theorems 2 and 4 the interest of local exponential reproducibility\nfor solving the problem of (robust) output feedback stabilization via a locally Lipschitz\nregulator, in this section we present a number of results which are useful to test when a\ntriplet (F, Q, A) is rLER (and thus LER) and, eventually, to design the functions (φ, ψ, γ).\nAs also commented in Section 5, the first requirement behind the definition is the existence of a compact set R ⊇ A which is LES for ż = F (z). In this respect we present a\nresult which claims that the existence of a set R which is LES for ż = F (z) is automatically\nguaranteed if the set A is LAS for ż = F (z). Thus, put in the context of Theorem 2, the\nfirst requirement of the definition is not restrictive at all. Details of this fact are reported in\nthe following proposition whose proof can be found in [20].\nLemma 1 Consider system\nz ∈ IRm\n\nż = F (z)\n\n(36)\n\nevolving on an invariant closed set Cm ⊂ IRm . Let A ⊂ Cm be a compact set which is LAS\nwith domain of attraction D(A) ⊆ Cm . For any compact set S ⊂ Cm such that A ⊂ intS,\nthere exists a compact set R satisfying A ⊆ R ⊂ S which is LES for (36) with domain of\nattraction D(R) ≡ D(A).\nWe pass now to analyze the second crucial requirement behind the definition of rLER,\nnamely the existence of locally Lipschitz functions (φ, ψ, γ) and T such that conditions (6)\nand (10) are satisfied for system (9). Being the property in question related to the ability of\nreproducing any signal Q(z(t)) generated by the system ż(t) = F (z(t)) by taking its initial\nconditions in the set R, it is not surprising that the theory of nonlinear output regulation,\nand specifically the design techniques proposed in the related literature to construct internal\nmodels, can be successfully used to this purpose (see [17]). In particular, in the following, we\npresent two techniques which are directly taken, with minor adaptations, from the literature\nof output regulation.\nFirst, we follow [4] and we present a method which draws its inspiration from high-gain\ndesign techniques of nonlinear observers. Specifically it is possible to state the following\nproposition which comes from Lemma 1 and from minor adaptations3 of the main result of\n[4] (see the quoted work for the proof).\n3\n\nThe adaptation consists only in proving the ISS property which is behind the definition of rLER.\n\n17\n\n\fProposition 3 Let F : IRm → IRm and Q : IRm → IR be given smooth functions and\nA ⊂ IRm be a given compact set which is LAS for ż = F (z). Assume, in addition, that\nthere exist a m̃ > 0, a compact set S such that A ⊂ intS and a locally Lipschitz function\nf : IRm̃ → IR such that the following differential equation holds\nm̃−1\nLm̃\nF (z) Q(z) = f ( Q(z), LF (z) Q(z), . . . , LF (z) Q(z) )\n\n∀z ∈ S .\n\n(37)\n\nThen the triplet (F, Q, A) is rLER. In particular (φ, ψ, γ) can be taken as the functions\nφ : IRm̃ → IRm̃ , ψ : IRm̃ → IRm̃ , γ : IRm̃ → IR defined as\n\n\n\n\n−λ0 L\nξ2 + λ0 Lξ1\n\n\n\n\n−λ1 L2\nξ3 + λ1 L2 ξ1\n\n\n\n\n\n\n\n\n.\n.\n.\n.\nψ(ξ) = \nφ(ξ) = \n\n,\n.\n.\n\n\n\n\nm̃−1\nm̃−1\n\n −λm̃−2 L\n\n\nξm̃ + λm̃−2 L\nξ1\nm̃\nm̃\n−λm̃−1 L\nfc (ξ1 , ξ2 , . . . , ξm̃ ) + λm−1 L ξ1\nand γ(ξ) = ξ1 , where L is a positive design parameter to be taken sufficiently large, λi ,\ni = 0, . . . , m̃ − 1, are such the polynomial sm̃ + λm̃−1 sm̃−1 + . . . + λ1 s + λ0 is Hurwitz, and\nfc (*) is any bounded function such that fc ◦ τ (z) = f (z) for all z ∈ S where τ : IRm → IRm̃\nis defined as\n\u0010\n\u0011T\nm̃−1\nτ (z) = Q(z) LF (z) Q(z) * * * LF (z) Q(z)\n.\nRemark 6 It is well-known (see, for instance, [8]) that a sufficient condition for a pair (F, Q)\nto satisfy property (37) locally with respect to a point z0 is that its observability distribution\nat z0 (see [9])\nm−1\nX\n∂\nspan LkF (z) Q(z)\nΩm (z) =\n(38)\n∂z\nk=0\nhas dimension m at z = z0 , namely if the system ż = F (z) with output yz = Q(z) satisfies\nthe observability rank condition (by using the terminology of [9]) at z0 . Such a condition\nrepresents an observability condition for the system ż = F (z) with output yz = Q(z) which,\nhowever, is far to be necessary to fulfill the property of rLER. In this respect it must be\nstressed again that the property of local exponential reproducibility does not involve any state\nobservability property of system ż = F (z) with output yz = Q(z) but rather a property of\noutput reproducibility. ⊳\nClearly the high-gain technique to design output observer behind Proposition 3 is not\nthe only tool which can be used to design the functions (φ, ψ, γ) for a triplet which is rLER.\nIn order to enrich the available tools, we present now a result motivated by the theory of\nstate observers pioneered in [23] (and developed in [1], [25]) which, in turn, has inspired\nthe technique to design internal models developed in [18] in the context of nonlinear output\nregulation (see also [21]). In this respect it is interesting to observe that if instead of asking\n(φ, ψ, γ) to be locally Lipschitz these functions were required to be only continuous, the\n18\n\n\ftheoretical tools presented in [18] are sufficient to prove that any smooth triplet (F, Q, A)\nis rLER if A is LAS for ż = F (z). In particular, if (H, G) ∈ IRp×p × IRp×1 , p > 0, is an\narbitrary controllable pair with H a Hurwitz matrix, and R is the set which is LES for\nż = F (z) (whose existence is guaranteed by Lemma 1 since A is LAS for these dynamics),\nthen it turns out that if the functions φ and ψ in (9) are chosen as\nφ(ξ) = Hξ\n\nand\n\nψ(ξ) = G\n\nthen property (10) holds true with (see Propositions 1 in [18])\nZ 0\nT (z) =\ne−Ht GQ(ΦF (t, z))dt .\n\n(39)\n\n−∞\n\nFurthermore, if p is chosen so that p ≥ 2m + 2 and the matrix H is taken so that\nσ(H) ∈ {ζ ∈ C\nI : R(ζ) < −l} \\ S where S ∈ C\nI is a set of zero Lebesgue measure and l is a\nsufficiently large positive number, then there always exists a class-K function ρ(*) such that\nthe following partial injectivity condition\n|T (z1 ) − T (z2 )| ≤ ρ(|Q(z1 ) − Q(z2 )|)\n\n∀ z1 , z2 ∈ R\n\n(40)\n\nholds (see Proposition 2 in [18]) and, in turn, the latter guarantees the existence of a continuous function γ : IRp → IR such that also property (6) holds true (see Proposition 3 in [18]).\nAs shown in [21] (see Proposition 4 there), a possible expression of such a γ(*) is given by\nγ(ξ) = inf {−Q(z) + ρ(|ξ − T (z)|)} .\nz∈R\n\n(41)\n\nThe previous arguments, however, are not conclusive if system (13) is required to be\nlocally Lipschitz. In this respect an extra condition (see the forthcoming (42), (43)) is\nneeded to guarantee the existence of a locally Lipschitz γ as precisely proved in [12]. The\nmain results in this direction are presented in the next lemma (whose proof is a minor\nadaptation of the main result of [12]).\nProposition 4 Let O be an open bounded set which is backward invariant for ż = F (z) with\nF : IRm → IRm a smooth function. Let A ⊂ O be a compact set which is LAS for ż = F (z)\nand let Q : IRm → IR be a C ∞ function. Let Ω(z) be the distribution defined as\nΩ(z) :=\n\n∞\nX\n\nspan\n\nk=0\n\n∂ k\nL\nQ(z) .\n∂z F (z)\n\n(42)\n\n∀z ∈ O\n\n(43)\n\nIf there exists a constant c ≤ m such that\ndimΩ(z) = c\n\nthen for any compact set R ⊂ O, with R ⊇ A, the function ρ in (40) can be taken linear and\nthe function γ in (41) is Locally Lipschitz. As a consequence the triplet (F, Q, A) is rLER.\n19\n\n\fRemark 7 By also bearing in mind Remark 6, it is worth noting how condition (43) does\nnot require the observability distribution (38)to be full rank, namely the system ż = F (z)\nwith output yz = Q(z) to be observable in any sense. Rather, condition (43) can be regarded\nas a regularity condition of the observable part of system ż = F (z) with output yz = Q(z).\n⊳\nRemark 8 By going throughout the technical details in [12], it is possible to observe that\nthe requirement about the existence of an open bounded set O which is backward invariant\nfor ż = F (z) is uniquely motivated by the need of having the function T (z) in (39) welldefined and C 2 . In this respect the requirement about the existence of a bounded invariant\nset O can be substituted by the requirement that the function T (z) in (39) is well-defined\nand C 2 for all z ∈ intR for a proper choice of the matrix H. In this case, by the details in\n[12], it turns out that the rank condition (43) must be substituted by\ndimΩ(z) = c\n\n∀ z ∈ {ΦF (t, ς)\n\n:\n\nt ≤ 0 , ς ∈ R} . ⊳\n\nRemark 9 The requirement in Lemma 4 about the existence of a bounded set O which is\nbackward invariant for ż = F (z), may be practically overtaken by properly \"clipping\" the\nfunction F (z) outside the set A. As a matter of fact, being the property of rLER related\nto the ability of reproducing the signals Q(z(t)) generated by the system ż(t) = F (z(t)) by\ntaking its initial conditions in a neighborhood of A, it turns out that any triplet (Fc , Qc , A),\nwith Fc : IRm → IRm , Qc : IRm → IR functions which agree with F and Q on some compact\nS containing A in its interior, can be used in place of (F, Q, A) to check whether the latter\nis rLER and eventually to design the functions (φ, ψ, γ). In this respect, the presence of a\nbounded backward invariant set O may be forced by properly clipping to zero the vector\nfield F (z) outside A. Alternatively, by bearing the previous remark, the function T be forced\nto be well-defined and C 2 by properly clipping the function Q(z) outside A. For reason of\nspace we omit the technical details to rigorously prove the previous intuition and we refer\nthe reader to the example in Section 6 for an illustrative example.\n\n6\n\nExample\n\nConsider the system\nẇ = 0\nẋ = −x3 + w + y\nẏ = x + u\n\n(44)\n\nwith control input u ∈ IR, measured output y ∈ IR in which w is a constant signal taking\nvalue in the interval W := [w, w]. By defining C1 := W × IR and\n√\nA := {(w, x) ∈ C1 : x = 3 w}\nwe address the problem of stabilizing the set A × {0}, which is invariant for the previous\nsystem with u = 0, by means of a y-feedback. The set A is LAS for the zero dynamics\n20\n\n\fof (44) with domain of attraction D(A) = C1 and, by defining u = −κy + v, the previous\nproblem fits in the framework of Section 2. Note, in particular, that by only increasing the\nvalue of k while setting v = 0 the desired asymptotic stabilization objective can not be met.\nAs a matter of fact, different equilibria characterize the system according to\np the value\np of w.\n3\nFor w = 0, the y-component of the system has three equilibria given by (0, 1/κ , − 1/κ3 )\nwhich, for w 6= 0, collapse in one equilibrium, solution of w + y = κ3 y 3, which tends to 0 as k\ntends to ∞. So, with v = 0, only practical stabilization of the set A × {0} in the parameter\nk can be achieved. In order to apply Theorem 2 and to obtain asymptotic stabilization of\nthe set A × {0} by means of dynamic feedback, we let z := col(w, x),\n\u0013\n\u0012\n0\nQ(z) := x\nF (z) :=\n−x3 + w\nand we check the exponential reproducibility of the triplet (F (z), Q(z), A). To this purpose,\nlet S be a compact set of the form\nS = {(w, x) ∈ C1 :\n\n√\n3\n\nw−\n\n√\n1\n1\n3\n≤x≤ w+ }\n2\n2\n\nso that A ⊂ intS, and note that, by Lemma 1, there exists a set R, A ⊆ R ⊂ intS, which\nis LER with D(R) = D(A). Both Proposition 3 and 4 can be used to prove that the triplet\nin question is rLER and, indeed, to design the functions (φ, ψ, γ).\nBy following Proposition 3, it is easy to check that\nL2F (z) Q(z) = −3 Q2 (z) LF (z) Q(z)\n\n∀ z ∈ C1 ,\n\nnamely condition (37) holds (with m̃ = 2), and thus the triplet (F (z), Q(z), A) is rLER.\nAccording to the proposition, the functions (φ, ψ, γ) can be designed as\n\u0013\n\u0012\n\u0013\n\u0012\nξ2 + λ0 Lξ1\n−λ0 L\nγ(ξ) = ξ1\n(45)\nφ(ξ) =\nψ(ξ) =\nfc (ξ1 , ξ2 ) + λ1 L2 ξ1\n−λ1 L2\nwhere λ0 and λ1 are such that s2 + λ1 s + λ0 is an Hurwitz polynomial, L is a sufficiently\nlarge design parameter and fc (*) is any smooth bounded function such that\nfc (x, −x3 + w) = −3x2 (−x3 + w)\n\n∀ (x, w) ∈ S .\n\nThe functions (φ, ψ, γ) can be designed according to Proposition 4 as well. However note\nthat this proposition cannot be applied as such due to the absence of a bounded invariant\nset containing A (indeed finite escape time occur in backward time for initial conditions\noutside A). To overtake this obstacle and by bearing in mind√Remark 9, pick a smooth\n√\nfunction a : IR → IR≥0 such that a(s) = 1 for all 3 w − 21 ≤ s ≤ 3 w + 12 and a(s) = 0 for all\n√\n√\ns ≤ 3 w − 1 and s ≥ 3 w + 1, and consider the system ż = a(x)F (z). For this system the\nbounded set O defined as\n√\n√\n3\nO = {z ∈ C1 : 3 w − 1 ≤ x ≤ w + 1} ,\n21\n\n\fwhich is open with respect to the subset topology induced by C1 , is invariant. Thus, Lemma\n4 can be applied to the triplet (a(x)F (z), Q(z), A). In this specific case\n\u0013\n\u0012\n0\n1\nΩ(z) = span\na(x) ∗\nwhere ∗ is a junk term, from which it follows that\ndimΩ(z) ≡ 2\n\n∀z∈O\n\nwhich implies, by Proposition 4, that the triplet (a(x)F (z), Q(z), A) is rLER. But, as the\nfunctions F (z) and a(x)F (z) agree on S, the fact that the triplet (a(x)F (z), Q(z), A) is rLER\ncan be shown to imply that also the triplet (a(x)F (z), Q(z), A) is such. Thus, according to\nProposition 4, the functions (φ, ψ, γ) can be also designed as\nφ(ξ) = Hξ ,\n\nψ(ξ) = G ,\n\nγ(ξ) = inf {−Q(z) + ρ * |ξ − T (z)|}\nz∈R\n\n(46)\n\nwhere (H, G) ∈ IR5×5 × IR5×1 is an arbitrary controllable pair with the matrix H such that\nσ(H) ∈ {ζ ∈ C\nI : R(ζ) < −l} \\ S where S ∈ C\nI is a set of zero Lebesgue measure and l is a\nsufficiently large positive number, the function T defined as in (39) and ρ a sufficiently large\npositive number.\nAs a result the problem of output feedback stabilization of the set A×{0} can be achieved,\nby bearing in mind Theorem 2 and the subsequent remark, by the following dynamic controller\nξ ̇ = φ(ξ) − ψ(ξ)[γ(ξ) − κy]\nu = −κy + γ(ξ)\nwith the functions (φ, ψ, γ) designed as in (45) or (46) and κ a sufficiently large number.\n\nA\n\nProof of Theorem 2\n\nBy the definition of LER of the triplet (f (x, 0), q(x, 0), A) there exists a set R ⊇ A which is\nLES for ẋ = f (x, 0) and , for any compact set X1 ⊂ D(R), there exist an integer ν, locally\nLipschitz functions φ : IRν → IRν , ψ : IRν → IRν , γ : IRν → IR and a smooth function\nT : IRn → IRν such that\nq(x, 0) + γ(T (x)) = 0\n\n∀x∈R\n\n(47)\n\nand for all ξ0 ∈ IRp and x0 ∈ X1 the solution (ξ(t), x(t)) of\nẋ = f (x, 0)\nx(0) = x0\n ̇ξ = φ(ξ) + ψ(ξ) q(x, 0) ξ(0) = ξ0\n\n(48)\n\n|(ξ(t), x(t))|graph T |R ≤ β(t, |(ξ0, x0 )|graph T |R )\n\n(49)\n\nsatisfies\n\n22\n\n\fwhere β(*, *) is a locally exponentially class-KL function. As A is LAS(X ) and R ⊇ A,\nwe have D(R) = D(A) and thus the previous properties hold, in particular, with X1 = X .\nFurthermore, in case A is LES for ẋ = f (x, 0), it is possible to show4 that (47) and (49) hold\nalso with R replaced by A possibly with a different class-KL function β(*, *).\nAssume, without loss of generality (as (A, B, C) has relative degree r and (A, C) is observable), that the pair (A, C) is in the canonical observability form and that B = (0, . . . , 0, 1)T ,\nand choose, as candidate controller, the system\nη̇ = φ(η) − ψ(η)γ(η) − ψ(η) κB T Ay\nv = γ(η)\n\n(50)\n\nwhich, by the structure of A and B, is of the form (4) since B T Ay = ar ym for some real\nnumber ar .\nConsider now the change of variables\nη → χ := φψ (B T y, η) .\n\n(51)\n\nNote that such a change of variables is well-defined for all y and η as ψ is complete.\nSince\n∂φψ (t′ , η) ∂φψ (t′ , η)\n−\nψ(η) ≡ 0\n∂t′\n∂η\nand using the fact that\n∂φψ (t′ , η)\n∂t′\n\n∂φψ (t′ , η)\n∂η\n\n= ψ(η)\nt′ =0\n\n=I,\nt′ =0\n\nit turns out that the closed-loop dynamics (1), (50) in the new coordinates can be described\nas the feedback interconnection of a system of the form\nẋ = f (x, 0) + f ̃(x, y)\nχ̇ = φ(χ) + ψ(χ)q(x, 0) + l̃1 (x, χ, y)\n\n(52)\n\nẏ = κAy + B(q(x, 0) + γ(χ)) + l̃2 (x, χ, y)\n\n(53)\n\nand a system of the form\n\nin which f ̃(x, y), l̃1 (x, χ, y) and l̃2 (x, χ, y) are locally Lipschitz functions satisfying f ̃(x, 0) =\n0, l̃1 (x, χ, 0) = 0 and l̃2 (x, χ, 0) = 0 for all x ∈ C and χ ∈ IRν and with l̃1 and l̃2 possibly\ndependent on X .\nLet N be an arbitrary compact set of IRν and denote by Ξ the image of N under the\nfunction (51) (note that N may depend on X ). Since system (52) with y = 0 is nothing but\n(48), it turns out that graph T |R is LES(X × Ξ) for system (52) with y = 0. Furthermore,\nby (47), the term q(x, 0) + γ(χ) in (53) is identically zero for (x, χ) ∈ graph T |R . From these\n4\n\nInternal remark: to be checked.\n\n23\n\n\ffacts and the results in [27], [2], it follows that for any compact set Y ∈ IRr there exists a\nκ⋆ > 0 such that for all κ ≥ κ⋆ the set graph T |R × {0} is LES(X × Ξ × Y) for (52), (53).\nBy taking τ = T |R the previous result proves the first part of the theorem, namely that\ngraph τ × {0} is LES(X × Y × N ) for the closed-loop system (1), (50).\nWe prove now the second claim of the theorem, namely that graph τ |A × {0} is LAS(X ×\nY ×N ). Let κ ≥ κ⋆ be fixed and note that, as graphτ ×{0} attracts uniformly the closed-loop\ntrajectories leaving X × Y × N , Proposition 5 yields that\nω(X × Y × N ) = ω(graphτ × {0}) ⊆ graphτ × {0}\nin which ω(S) denotes the omega limit set of the set S associated to the closed-loop system.\nWe prove now that if (x, y, χ) ∈ ω(graphτ × {0}) then necessarily x ∈ ω(R) in which ω(R)\ndenotes the omega limit set of the set R associated to the system ẋ = f (x, 0).\nIndeed, consider a sequence {xn , yn , χn } with (xn , χn ) ∈ graphτ and so in particular\nxn ∈ R, and yn ≡ 0, and a divergent sequence {tn }, such that, the following holds\n|x(tn , xn ) − x̄| → 0 ,\n\n(54)\n\nwhere x(t, xn ) and χ((xn , χn ), t) denotes the solution of\nẋ = f (x, 0)\nχ̇ = φ(χ) + ψ(χ)q(x, 0)\n\n(55)\n\nwith initial conditions (xn , χn ). xn being in R, this implies x̄ ∈ ω(R). Now, considering\nthe system given by the first dynamics in (55) and using the fact that A ⊆ R uniform\nattracts the trajectories of this system leaving X , Proposition 5 in Appendix yields that\nω(X ) = ω(R) = ω(A) ⊆ A. By this and the previous arguments we conclude that the x\ncomponents of the closed-loop trajectories are uniformly attracted by ω(A) ⊆ A. From this\nthe result follows by standard arguments. ⊳\n\nB\n\nAuxiliary results\n\nProposition 5 Let\nż = F (z)\n\n(56)\n\nbe a given smooth system and let S be a compact set which is forward invariant for (56) and\nwhich uniformly (in the initial condition) attracts the trajectories of (56) originating in a\ncompact set D ⊃ S. Then ω(D) = ω(S) ⊆ S.\nProof First of all note that ω(D) and ω(S) exist and that, by definition, ω(S) ⊆ ω(D).\nFurthermore ω(S) ⊆ S as S is forward invariant for (56). To prove that ω(D) = ω(S)\nsuppose that it is not, namely that there exist a z̄ ∈ ω(D) and an ǫ > 0 such that |z̄|S ≥ ǫ.\nAs S uniformly attracts the trajectories of (56) originating from D, there exists a tǫ/2 > 0\nsuch that |z(t, z0 )|S ≤ ǫ/2 for all z0 ∈ D and for all t ≥ tǫ/2 . Moreover, by definition of\n24\n\n\f∞\nω(D), there exist sequences {zn }∞\n0 and {tn }0 , with zn ∈ D and limn→∞ tn = ∞, such that\nlimn→∞ z(tn , zn ) = z̄. This, in particular, implies that for any ν > 0 there exists a nν > 0\nsuch that |z(tn , zn ) − z̄| ≤ ν for all n ≥ nν . But, by taking ν = min{ǫ/2, ν1 } with ν1 such\nthat tn ≥ tǫ/2 for all n ≥ nν1 , this contradicts that S uniformly attracts the trajectories of\nthe system originating from D. ⊳\n\nProposition 6 Consider a system of the form\nẋ1 = f1 (x1 , x2 )\nẋ2 = f2 (x1 , x2 )\n\nx1 ∈ IRn1\nx2 ∈ IRn2\n\n(57)\n\nand assume that there exist a compact set A ⊂ IRn1 and a smooth function τ : IRn1 → IRn2\nsuch that the set\ngraph τ |A = {(x1 , x2 ) ∈ A × IRn2\n\n:\n\nx2 = τ (x1 )}\n\nis LES for (57) and the set A is LES for the system ẋ1 = f1 (x1 , τ (x1 )). Let q : IRn1 × IRn2 →\nIR be a smooth function. If the triplet (f1 (x1 , τ (x1 )), q(x1 , τ (x1 )), A) is rLER then the triplet\n(col(f1 (x1 , x2 ), f2 (x1 , x2 )), q(x1 , x2 ), graph τ |A ) is LER.\nProof. Let f ̄1 (x1 ) = f1 (x1 , τ (x1 )) and q̄(x1 ) = q(x1 , τ (x1 )). Since A is LES for ẋ1 = f ̄1 (x1 )\nand the triplet (f ̄1 (x1 ), q̄(x1 ), A) is rLER, for any compact set X̄1 ⊂ D(A), there exist an\ninteger p̄ and locally Lipschitz functions φ̄ : IRp̄ → IRp̄ , ψ̄ : IRp̄ → IR, γ̄ : IRp̄ → IR and\nT̄ : IRn1 → IRp̄ such that, for all x̄10 ∈ X̄1 and ξ ̄0 ∈ IRp̄ and for all locally essentially bounded\n ̄\nv(t), the solution (x̄1 (t), ξ(t))\nof the system\nx̄ ̇ 1 = f ̄1 (x̄1 )\n ̄ + ψ̄(ξ)[q̄(x̄\n ̄\nξ ̇ ̄ = φ̄(ξ)\n1 ) + v]\nsatisfies\n\nx̄1 (0) = x̄10\n ̄ = ξ ̄0\nξ(0)\n\n ̄\n ̄\n|(x̄1 (t), ξ(t))|\ngraph T̄ | ≤ β1 (t, |(x̄10 , ξ0 )|graph T̄ | ) + l(sup |v(τ )|)\nA\n\nA\n\n(58)\n\nτ ≤t\n\nwhere β1 (*, *) and l(*) are respectively a locally exponential class-KL and a class-K functions,\nand\nγ̄(T̄ (x̄1 )) + q̄(x̄1 ) = 0\n∀ x̄1 ∈ A .\nFurthermore, by the assumption that graph τ |A is LES for (57), for any (x10 , x20 ) ∈ D(graph τ |A )\nthe solution (x1 (t), x2 (t)) of (57) with initial condition (x1 (0), x2 (0)) = (x10 , x20 ) satisfies\n|(x1 (t), x2 (t))|graph τ |A ≤ β2 (t, |(x10 , x20 )|graph τ |A )\n\n(59)\n\nwhere β2 (*, *) is a locally exponential class-KL function.\nNow pick a compact set X̄1 ⊂ D(A) and the functions (φ̄(*), ψ̄(*), γ̄(*)) accordingly, and\ndenote by (x1 (t), x2 (t), ξ(t)) the solution of the system\n25\n\n\fẋ1 = f1 (x1 , x2 )\nẋ2 = f2 (x1 , x2 )\nξ ̇ = φ̄(ξ) + ψ̄(ξ)q(x1 , x2 )\n\nx1 ∈ IRn1\nx2 ∈ IRn2\nξ ∈ IRp̄\n\n(60)\n\nwith initial conditions (x10 , x20 , ξ0) ∈ IRn1 × IRn2 × IRp̄ at time t = 0. Let X ⊂ IRn1 × IRn2\nbe an arbitrary compact set such that X ⊂ D(graph τ |A ), let R := graph τ |A and let\nT : IRn1 × IRn2 → IRp̄ be the locally Lipschitz function defined as T (x1 , x2 ) = T̄ (x1 ). We\nshall prove in the following that for any initial condition (x10 , x20 , ξ0 ) ∈ X ×IRp̄ the trajectory\n(x1 (t), x2 (t), ξ(t)) of (60) satisfies\n|(x1 (t), x2 (t), ξ(t))|graph T |R ≤ β3 (t, |(x10 , x20 , ξ0)|graph T |R )\n\n(61)\n\nwhere β3 (*, *) is a locally exponential class-KL function and\ngraph T |R = {((x1 , x2 ), ξ) ∈ graph τ |A × IRp̄ : ξ = T (x1 , x2 )} .\nTo this purpose, pick any x̄10 ∈ A ⊂ X̄1 and note that (x1 (t), x2 (t), ξ(t)) satisfies\nẋ1 (t) = f1 (x1 (t), x2 (t))\nẋ2 (t) = f2 (x1 (t), x2 (t))\n ̇\nξ(t)\n= φ̄(ξ(t)) + ψ̄(ξ(t))[q̄(x̄1 (t)) + v(t)]\n\nx1 (0) = x10\nx2 (0) = x20\nξ(0) = ξ0\n\n(62)\n\nwhere\nv(t) = q(x1 (t), x2 (t)) − q̄(x̄1 (t))\n\nand x̄1 (t) = Φf ̄1 (t, x̄10 ). Let x⋆1 ∈ A be such that (x⋆1 , τ (x⋆1 )) is the projection of (x1 , x2 ) on\ngraph τ |A . Since x̄1 (t) ∈ A and x⋆1 (t) ∈ A for all t ≥ 0, X is compact and (59) holds, and\nq̄ is locally Lipschitz, for any initial condition (x10 , x20 ) ∈ X of (62) the term v(t) can be\nbounded as\n|v(t)| =\n≤\n≤\n≤\n\n|q(x1 (t), x2 (t)) − q̄(x⋆1 (t)) + q̄(x⋆1 (t)) − q̄(x̄1 (t))|\n|q(x1 (t), x2 (t)) − q̄(x⋆1 (t))| + |q̄(x⋆1 (t)) − q̄(x̄1 (t))|\nLq |(x1 (t), x2 (t))|graph τ |A + 2 sups∈A |q̄(s)|\nvM\n\nfor all t ≥ 0, where Lq is a bound of the Lipschitz constant of q on the forward flow of\n(57) originated from X and vM a positive constant, both dependent on X. Hence, from\nestimate (58), it follows that |(x̄1 (t), ξ(t))|graph T̄ | is bounded and, since x̄1 (t) ∈ A and\nA\n\ngraph T̄ A is compact, also ξ(t) is bounded. This, in turn, implies that also the trajectories\nof (60) originated from X × IRp̄ are ultimately bounded, namely there exists a compact set\nS ⊂ IRn1 +n2 +p̄ such that for any Ξ ⊂ IRp̄ there exists a T > 0 such that ∀ (x10 , x20 , ξ0 ) ∈ X×Ξ,\n(x1 (t), x2 (t), ξ(t)) ∈ S for all t ≥ T . As a consequence, the trajectories of (60) are uniformly\nattracted by ω(S), the ω-limit set of the set S of system (60), which is a bounded invariant\nset.\n26\n\n\fWe prove now that ω(S) is a subset of graph T |R . For, let (x′10 , x′20 , ξ0′ ) be a point of ω(S)\nand note that, by (59) which implies that graph τ |A is uniform attractive for the (x1 , x2 )\ndynamics in (60), and by Proposition 5 in Appendix B, it turns out that necessarily x′10 ∈ A\nand x′20 = τ (x′10 ). Furthermore it can be proved that ξ0′ = T̄ (x′10 ). In fact, suppose that it is\nnot true, namely that there exists an ǫ > 0 such that\n|(x′10 , ξ0′ )|graph T̄ | ≥ ǫ .\n\n(63)\n\nA\n\nAs ω(S) is invariant for (60), for any (x10 , x20 , ξ0 ) ∈ ω(S) the corresponding trajectory\n(x1 (t), x2 (t), ξ(t)) ∈ ω(S) for all t ∈ IR, and thus x1 (t) ∈ A ⊂ X̄1 and x2 (t) = τ (x1 (t))\n∀ t ∈ IR. So, inequality (58) with v = 0 yields that, using compactness of ω(S), there\nexists a tǫ > 0 such that for all (x10 , x20 , ξ0 ) ∈ ω(S), |(x1 (t), ξ(t))|graph T̄ | < ǫ/2 for all\nA\n\nt ≥ tǫ . The previous facts, specialized with (x10 , x20 , ξ0 ) = Φ(60) (−tǫ , (x′10 , x′20 , ξ0′ )), yield that\n(x′10 , x′20 , ξ0′ ) = Φ(60) (tǫ , (x10 , x20 , ξ0 )) are such that |(x′10 , ξ0′ )|graph T̄ | < ǫ/2 which contradicts\nA\n\n(63). Hence, ω(S) is necessarily a subset of graph T̄ A . Since S can be taken, without loss of\ngenerality, such that graph T̄ A ⊂ intS, the previous facts prove (61) with the only exception\nthat the class KL function β3 (*, *) is not necessarily locally exponential (see [3]). To prove\nlocal exponential stability we follow a Lyapunov approach. First, note that, by defining\np1 = col(x1 , ξ), the first and third dynamics of (60) can be rewritten as\nṗ1 = F1 (p1 ) + G1 (p1 , x2 )(x2 − τ (x1 ))\nwhere F1 (p1 ) = col(f ̄1 (x1 ), φ̄(ξ)ψ̄(ξ)q̄1 (x1 )), G1 (p1 , x2 ) = col(r1 (x1 , x2 ), ψ̄(ξ)r2 (x1 , x2 )) in\nwhich r1 (*, *) and r2 (*, *) are properly defined smooth functions. By assumption and by\nstandard converse Lyapunov results, there exist a smooth function V1 : D(graph T̄ A ) → IR\nand positive numbers c1 , a1 ≤ ā1 , such that\n∂V1 (p1 )\nF1 (p1 ) ≤ −c1 V1 (p1 )\n∂p1\n\n∀ p1 ∈ D(graph T̄\n\nA\n\n)\n\n(64)\n\nand\na1 |p1 |2graph T̄\n\n|A\n\n≤ V1 (p1 ) ≤ ā1 |p1 |2graph T̄\n\n|A\n\n∀ p1 : (x1 , x2 , ξ) ∈ S .\n\n(65)\n\nSimilarly, by letting p2 = col(x1 , x2 ) and by rewriting (57) as ṗ2 = F2 (p2 ), it turns out that\nthere exist a smooth function V2 : D(graph τ |A ) → IR and positive numbers c2 , a2 ≤ ā2 ,\nsuch that\n∂V2 (p2 )\nF2 (p1 ) ≤ −c2 V2 (p2 )\n∀ p2 ∈ D(graph τ |A )\n(66)\n∂p2\nand\na2 |p2 |2graph τ |A ≤ V2 (p2 ) ≤ ā2 |p2 |2graph τ |A\n∀ p2 : (x1 , x2 , ξ) ∈ S .\n(67)\nFurthermore, note that there exists a positive τ̄ such that\n|x2 − τ (x1 )| ≤ τ̄ |(x1 , x2 )|graph τ |A\n27\n\n∀ (x1 , x2 ) : (x1 , x2 , ξ) ∈ S .\n\n(68)\n\n\fAs a matter of fact, given (x1 , x2 , ξ) ∈ S, let x̄1 ∈ A be such that |x1 − x̄1 , x2 − τ (x̄1 )| =\n|(x1 , x2 )|graph τ |A . As |x1 − x̄1 | ≤ |(x1 , x2 )|graph τ |A and |x2 − τ (x̄1 )| ≤ |(x1 , x2 )|graph τ |A , and\ndenoting by τ̄ ′ an upper bound of the Lipschitz constant of τ on S, it turns out that\n|x2 − τ (x1 )| =\n≤\n≤\n≤\n\n|x2 − τ (x̄1 ) + τ (x̄1 ) − τ (x1 )|\n|x2 − τ (x̄1 )| + |τ (x̄1 ) − τ (x1 )|\n|(x1 , x2 )|graph τ |A + τ̄ ′ |x1 − x̄1 |\n(1 + τ̄ ′ )|(x1 , x2 )|graph τ |A := τ̄ |(x1 , x2 )|graph τ |A\n\nfor all (x1 , x2 , ξ) ∈ S, namely (68) holds. Consider now the candidate Lyapunov function\nV (x1 , x2 , ξ) = V1 (p1 ) + βV2 (p2 ) for system (60) with β > 0. By (65) and (67), there exist\npositive numbers a ≤ ā (dependent on β) such that\na|(x1 , ξ)|2graph T̄\n\n|A\n\n+ a|(x1 , x2 )|2graph τ |A ≤ V (x1 , x2 , ξ) ≤ ā|(x1 , ξ)|2graph T̄\n\n|A\n\n+ ā|(x1 , x2 )|2graph τ |A\n\nBy (64), (66), (67) and (68), and by the fact that G1 (p1 ) is locally Lipschitz, it turns out\nthat there exists a β ⋆ > 0 such that for all β ≥ β ⋆ and for all (x1 , x2 , ξ) ∈ S\nV̇ (x1 , x2 , ξ)\n\n(60)\n\n≤ −c V (x1 , x2 , ξ)\n\nwhere c is a positive constant. Combining the previous facts with by (59), standard arguments yields (61) with β3 (*, *) a locally exponential class-KL function. This, in turn, proves\nthe proposition with the functions (φ, ψ, γ) associated to the triplet (col(f1 (x1 , x2 ), f2 (x1 , x2 )),\nq(x1 , x2 ), graph τ |A ) in the definition of LER given by (φ̄, ψ̄, γ̄). ⊳\n⊳\n\nReferences\n[1] V. Andrieu and L. Praly, On the existence of a Kazantis-Kravaris/Luenberger observer.\nSIAM Journal on Control and Optimization, Vol. 45, n. 2, pp. 432-456, 2006.\n[2] A.N. Atassi and H.K. Khalil, A separation principle for the stabilization of a class of\nnonlinear systems. IEEE Transactions on Automatic Control, Vol. 44, pp. 1672- 1687,\nSeptember 1999.\n[3] C.I. Byrnes, A. Isidori, Limit sets, zero dynamics and internal models in the problem\nof nonlinear output regulation. IEEE Transaction on Automatic Control, AC-48, pp.\n1712-1723, (2003).\n[4] C.I. Byrnes, A. Isidori, Nonlinear internal models for output regulation. IEEE Trans.\non Automatic Control, 49 (2004), pp. 2244-2247.\n[5] C. I. Byrnes and F. Celani and A. Isidori, Omega-limit sets for a class of nonlinear\nsystems that are semiglobally practically stabilized. Int. J. of Robust and Nonl. Cont.,\n15, pp. 315-333, 2005.\n28\n\n\f[6] F. Esfandiari and H. Khalil, Output feedback stabilization of fully linearizable systems,\nInternational Journal of Control, 56 (1992), pp. 1007–1037.\n[7] R. Freeman, P. Kokotović, Robust nonlinear control design : State-space and Lyapunov\ntechniques. Birkhäuser. 1996.\n[8] J.P. Gauthier and I. Kupka, Deterministic Observation Theory and Applications, Cambridge Univeraity Press, 2001.\n[9] R. Hermann and A. J. Krener, Nonlinear controllability and observability. IEEE Transactions on Automatic Control, AC-22(5):728–740, 1977.\n[10] J. Huang, Nonlinear Output Regulation Theory and Applications. SIAM Series: Advances in Design and Control, Cambridge University Press, 2007.\n[11] A. Isidori, Nonlinear Control Systems II, Springer Verlag, New York, 1999.\n[12] A. Isidori, L. Praly, L. Marconi, \"SICON addendum\", SIAM Journal on Control and\nOptimization, submitted, 2008.\n[13] Z. P. Jiang, A. R. Teel, L. Praly, Small-gain theorem, gain assignment and applications.\nProceedings of the 33rd IEEE Conference on Decision and control, 1994.\n[14] Z. P. Jiang, Control of Interconnected Nonlinear Systems: A Small-Gain Viewpoint,\nLecture Notes in Control and Information Sciences Publisher Springer Berlin / Heidelberg, 2004.\n[15] I. Kanellakopoulos and P.V. Kokotovic and A. S. Morse, A Toolkit for Nonlinear Feedback Design. Systems & Control Letters, Vol. 18, pp. 83-92, 1992.\n[16] P. V. Kokotovic, J. O'Reilly and H. K. Khalil, Singular Perturbation Methods in Control:\nAnalysis and Design. Academic Press, 1986.\n[17] L. Marconi and Isidori, \"A unifying approach to the design of nonlinear output regulators\". In C. Bonivento, A. Isidori, L. Marconi, C. Rossi (Eds), \"Advances in Control\nTheory and Applications\", Lecture Notes in Control and Information Sciences, Springer\nVerlag Berlin, 2007.\n[18] L. Marconi, L. Praly, A. Isidori, Output Stabilization via Nonlinear Luenberger Observers. SIAM Journal on Control and Optimization, 45, n. 6, pp. 2277-2298, 2007.\n[19] L. Marconi, A. Isidori, L. Praly, Robust Asymptotic Stabilization of Nonlinear Systems\nwith Non-Hyperbolic Zero Dynamics: Part II. submitted, 2008.\n[20] L. Marconi and L. Praly, Essential and redundant internal models in nonlinear output\nregulation. In A. Astolfi, L. Marconi (Eds), Analysis and Design of Nonlinear Control\nSystems, Springer Verlag Berlin, 2007.\n29\n\n\f[21] L. Marconi and L. Praly, Uniform Practical Output Regulation. To appear on IEEE\nTransaction on Automatic Control, 2008.\n[22] F. Mazenc and L. Praly and W. P. Dayawansa, Global stabilization by output feedback:\nexamples and counterexamples, Vol. 23, n. 2, pp. 119-125, 1994.\n[23] K. Kazantzis and C. Kravaris, Nonlinear observer design using Lyapunov's auxiliary\ntheorem. Systems Control Lett., 34 (1998), pp. 241–247.\n[24] H.K. Khalil, Nonlinear Systems. McMillan, 2nd Edition, New York (USA) 1996.\n[25] A. J. Krener and M. Xiao, Erratum: Nonlinear observer design in the Siegel domain.\nSIAM J. Control Optim., 43 (2004), pp. 377–378.\n[26] A. Pavlov, N. van de Wouw, H. Nijmeijer, Uniform Output Regulation of Nonlinear\nSystems A Convergent Dynamics Approach. Birkhauser, 2005.\n[27] A.R. Teel and L. Praly, Tools for semiglobal stabilization by partial state and output\nfeedback. SIAM Journal on Control Optimization, 33, pp. 1443–1485, 1995.\n[28] A.R. Teel and L. Praly, Global stabilizability and observability imply semi-global stabilizability by output feedback. Systems & Control Letters, 22, pp. 313-325, 1994.\n[29] A. R. Teel, A nonlinear small gain theorem for the analysis of control systems with\nsaturations. IEEE Transactions on Automatic Control, vol. 41, pp 1256-1270, 1996.\n[30] A.R. Teel, L. Moreau and D. Nesic, A unified framework for input-to-state stability in\nsystems with two time scales. IEEE Trans. Automat. Contr., 48, pp. 1526–1544, 2003.\n\n30\n\n\f"}