{"id": "http://arxiv.org/abs/1001.5252v2", "guidislink": true, "updated": "2010-01-29T08:49:28Z", "updated_parsed": [2010, 1, 29, 8, 49, 28, 4, 29, 0], "published": "2010-01-28T19:48:27Z", "published_parsed": [2010, 1, 28, 19, 48, 27, 3, 28, 0], "title": "Monitoring of pulse period in Her X-1 with Swift/BAT: evidence of mass\n  ejection", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1001.0544%2C1001.4052%2C1001.4957%2C1001.0515%2C1001.5386%2C1001.2355%2C1001.2370%2C1001.0692%2C1001.0915%2C1001.1819%2C1001.4941%2C1001.2117%2C1001.1756%2C1001.0552%2C1001.1982%2C1001.4653%2C1001.1841%2C1001.4563%2C1001.4655%2C1001.4918%2C1001.0542%2C1001.4161%2C1001.4786%2C1001.3502%2C1001.1906%2C1001.4082%2C1001.2561%2C1001.1755%2C1001.3624%2C1001.0429%2C1001.0395%2C1001.5237%2C1001.1588%2C1001.5375%2C1001.2251%2C1001.0051%2C1001.2890%2C1001.4409%2C1001.3622%2C1001.2013%2C1001.4287%2C1001.4802%2C1001.3915%2C1001.0319%2C1001.5452%2C1001.2690%2C1001.1369%2C1001.5426%2C1001.1988%2C1001.1135%2C1001.3740%2C1001.3691%2C1001.4996%2C1001.3678%2C1001.3862%2C1001.2666%2C1001.1175%2C1001.3521%2C1001.1299%2C1001.2391%2C1001.2788%2C1001.0590%2C1001.5449%2C1001.2856%2C1001.0158%2C1001.4183%2C1001.3392%2C1001.3649%2C1001.2937%2C1001.5142%2C1001.1836%2C1001.1136%2C1001.2427%2C1001.1015%2C1001.1552%2C1001.0859%2C1001.5391%2C1001.4502%2C1001.5198%2C1001.4606%2C1001.0742%2C1001.5252%2C1001.1357%2C1001.3256%2C1001.2810%2C1001.1118%2C1001.5354%2C1001.2520%2C1001.1215%2C1001.4742%2C1001.5176%2C1001.4525%2C1001.2894%2C1001.1332%2C1001.2550%2C1001.0809%2C1001.0179%2C1001.4472%2C1001.4972%2C1001.5077%2C1001.3092&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Monitoring of pulse period in Her X-1 with Swift/BAT: evidence of mass\n  ejection"}, "summary": "Monitoring of pulse period variations in accreting binary pulsars is an\nimportant tool to study the interaction between the magnetosphere of the\nneutron star and the accretion disk. While the X-ray flux of the brightest\nX-ray pulsars have been successfully monitored over many years (e.g. with\nRXTE/ASM, CGRO/BATSE, Swift/BAT), the possibility to monitor their pulse timing\nproperties continuously has so far been very limited. In our work we use\nSwift/BAT observations to study one of the most enigmatic X-ray pulsars,\nHercules X-1. For the first time, a quasi-continuous monitoring of the pulse\nperiod and the pulse period derivative of Her X-1, is achieved over a long time\n(> 4 yrs). We argue that together with the long-term decrease of the orbital\nperiod in Her X-1 the measured pulse period behaviour requires the presence of\nmass ejection from the inner parts of the accretion disk along the open\nmagnetic field lines. The mass ejection episodes probably take place during\nstrong spin-down episodes which are associated with the low X-ray luminosity.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1001.0544%2C1001.4052%2C1001.4957%2C1001.0515%2C1001.5386%2C1001.2355%2C1001.2370%2C1001.0692%2C1001.0915%2C1001.1819%2C1001.4941%2C1001.2117%2C1001.1756%2C1001.0552%2C1001.1982%2C1001.4653%2C1001.1841%2C1001.4563%2C1001.4655%2C1001.4918%2C1001.0542%2C1001.4161%2C1001.4786%2C1001.3502%2C1001.1906%2C1001.4082%2C1001.2561%2C1001.1755%2C1001.3624%2C1001.0429%2C1001.0395%2C1001.5237%2C1001.1588%2C1001.5375%2C1001.2251%2C1001.0051%2C1001.2890%2C1001.4409%2C1001.3622%2C1001.2013%2C1001.4287%2C1001.4802%2C1001.3915%2C1001.0319%2C1001.5452%2C1001.2690%2C1001.1369%2C1001.5426%2C1001.1988%2C1001.1135%2C1001.3740%2C1001.3691%2C1001.4996%2C1001.3678%2C1001.3862%2C1001.2666%2C1001.1175%2C1001.3521%2C1001.1299%2C1001.2391%2C1001.2788%2C1001.0590%2C1001.5449%2C1001.2856%2C1001.0158%2C1001.4183%2C1001.3392%2C1001.3649%2C1001.2937%2C1001.5142%2C1001.1836%2C1001.1136%2C1001.2427%2C1001.1015%2C1001.1552%2C1001.0859%2C1001.5391%2C1001.4502%2C1001.5198%2C1001.4606%2C1001.0742%2C1001.5252%2C1001.1357%2C1001.3256%2C1001.2810%2C1001.1118%2C1001.5354%2C1001.2520%2C1001.1215%2C1001.4742%2C1001.5176%2C1001.4525%2C1001.2894%2C1001.1332%2C1001.2550%2C1001.0809%2C1001.0179%2C1001.4472%2C1001.4972%2C1001.5077%2C1001.3092&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Monitoring of pulse period variations in accreting binary pulsars is an\nimportant tool to study the interaction between the magnetosphere of the\nneutron star and the accretion disk. While the X-ray flux of the brightest\nX-ray pulsars have been successfully monitored over many years (e.g. with\nRXTE/ASM, CGRO/BATSE, Swift/BAT), the possibility to monitor their pulse timing\nproperties continuously has so far been very limited. In our work we use\nSwift/BAT observations to study one of the most enigmatic X-ray pulsars,\nHercules X-1. For the first time, a quasi-continuous monitoring of the pulse\nperiod and the pulse period derivative of Her X-1, is achieved over a long time\n(> 4 yrs). We argue that together with the long-term decrease of the orbital\nperiod in Her X-1 the measured pulse period behaviour requires the presence of\nmass ejection from the inner parts of the accretion disk along the open\nmagnetic field lines. The mass ejection episodes probably take place during\nstrong spin-down episodes which are associated with the low X-ray luminosity."}, "authors": ["D. Klochkov", "R. Staubert", "K. Postnov", "N. Shakura", "A. Santangelo"], "author_detail": {"name": "A. Santangelo"}, "author": "A. Santangelo", "arxiv_comment": "6 pages, 3 figures. Accepted for publication on PoS (contribution\n  PoS(extremesky2009)054), proceedings of \"The Extreme sky: Sampling the\n  Universe above 10 keV\", held in Otranto (Italy) in October 2009", "links": [{"href": "http://arxiv.org/abs/1001.5252v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1001.5252v2", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "astro-ph.HE", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph.HE", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1001.5252v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1001.5252v2", "journal_reference": null, "doi": null, "fulltext": "arXiv:1001.5252v2 [astro-ph.HE] 29 Jan 2010\n\nMonitoring of pulse period in Her X-1 with Swift/BAT :\nevidence of mass ejection\n\nD. Klochkov∗,a , R. Stauberta , K. Postnovb , N. Shakurab , A. Santangeloa\nfür Astronomie und Astrophysik, Universität Tübingen (IAAT)\nb Sternberg Astronomical Institute, Moscow University\nE-mail: klochkov@astro.uni-tuebingen.de\na Institut\n\nMonitoring of pulse period variations in accreting binary pulsars is an important tool to study the\ninteraction between the magnetosphere of the neutron star and the accretion disk. While the X-ray\nflux of the brightest X-ray pulsars have been successfully monitored over many years (e.g. with\nRXTE/ASM, CGRO/BATSE, Swift/BAT), the possibility to monitor their pulse timing properties\ncontinuously has so far been very limited. In our work we use Swift/BAT observations to study\none of the most enigmatic X-ray pulsars, Hercules X-1. For the first time, a quasi-continuous\nmonitoring of the pulse period and the pulse period derivative of Her X-1, is achieved over a long\ntime (> 4 yrs). We argue that together with the long-term decrease of the orbital period in Her X-1\nthe measured pulse period behaviour requires the presence of mass ejection from the inner parts\nof the accretion disk along the open magnetic field lines. The mass ejection episodes probably\ntake place during strong spin-down episodes which are associated with the low X-ray luminosity.\n\nThe Extreme sky: Sampling the Universe above 10 keV - extremesky2009,\nOctober 13-17, 2009\nOtranto (Lecce) Italy\n∗ Speaker.\n\nc Copyright owned by the author(s) under the terms of the Creative Commons Attribution-NonCommercial-ShareAlike Licence.\n\nhttp://pos.sissa.it/\n\n\fMonitoring of pulse period in Her X-1\n\nD. Klochkov\n\n1. Introduction\nThe persistent accreting pulsar Hercules X-1 was one of the first X-ray sources discovered by\nthe Uhuru satellite in 1972 (Tananbaum et al. 1972; Giacconi et al. 1973) and since then it remains\none of the most intensively studied X-ray pulsars. The mass of the optical companion is ∼2M⊙\nwhich places the system in the middle between high and low mass X-ray binaries. Other main\nparameters of the binary system are the following: orbital period Porb ≃ 1.7 days, spin period of the\nneutron star Pspin ≃ 1.24 sec, X-ray luminosity of the source LX ∼ 2 × 1037 erg s−1 for a distance of\n∼7 kpc (Reynolds et al. 1997). The binary orbit is almost circular (Staubert et al. 2009) and has an\ninclination i ∼ 85 − 88◦ (Gerend & Boynton 1976).\nLike many other X-ray pulsars Her X-1 exhibits significant variation of the pulsation period.\nAlternation of spin-up and spin-down episodes on time-scales of several months in this system is\nsuperimposed on a background of systematic spin-up (e.g. Staubert et al. 2006; Klochkov 2007).\nThe behavior of the pulsar's spin period on shorter time scales is not very well studied because such\na study would require a continuous monitoring of Her X-1 with a sensitive X-ray detector. Only\nbetween 1991 and 2000 the BATSE instrument onboard CGRO provided the information about the\nsource's pulse period on a regular basis.\nIn this work we present a continuous monitoring of the Her X-1 pulse period P and its local\n(measured at the time of the observation) time derivative Ṗ using the Swift/BAT instrument starting\nfrom 2005 (begin of scientific operation) to 2009. The data of the monitoring allowed us to explore\nfor the first time the correlation between the locally measured Ṗ and the X-ray flux of the pulsar\nand compare the results with predictions of the accretion theory. The observed strong spin-down\nepisodes are discussed in the frame of a model assuming ejection of matter from the inner part of\nthe accretion disk along the open magnetic field lines.\n\n2. Observations and data analysis\nFor our analysis we used the public archival data obtained with the Burst Alert Telescope\n(BAT, 150–150 keV, Barthelmy et al. 2005) onboard the Swift observatory (Gehrels et al. 2004).\nWith its large field of view (1.4 sterad) the BAT instrument is originally designed to provide fast\ntriggers for gamma-ray bursts and their accurate positions in the sky (∼4 arcsec). Following such\na trigger, the observatory points in the direction of the burst, which can be then observed with the\nX-ray and UV/optical telescopes onboard the satellite. While searching for bursts, BAT points at\ndifferent locations of the sky, thus, performing an all-sky monitoring in hard X-rays (measurements\nof the X-ray flux are provided by the Swift/BAT team in the form of X-ray light curves for the\nseveral hundred bright persistent and transient sources1 ). If a bright pulsating source with a known\nperiod falls into the field of view of the instrument, the total count rate stored by BAT can be\nused to search for coherent pulsations of that source. We have used this strategy to measure the\n1.24 s pulsations of Her X-1 during its so-called main-on states (when the X-ray flux of the source\nis high). Such states repeat every ∼35 days and are believed to be caused by a precessing tilted\naccretion disk around the neutron star, see e.g. Gerend & Boynton 1976.\n1 http://heasarc.gsfc.nasa.gov/docs/swift/results/transients/\n\n2\n\n\fMonitoring of pulse period in Her X-1\n\nD. Klochkov\n\n(O−C) for pulse arr. times [Ppulse]\n\n0.04\n0.03\n\nFigure 1: Estimated (observed) minus calculated (assuming a constant\nperiod) pulse arrival times of Her X-1\nin units of its pulse period during\none of its main-on states observed\nwith Swift/BAT. Parabolic fit to the\ndata shown with the solid line corresponds to a constant positive Ṗ ≃\n1.4 × 10−12 s/s.\n\n0.02\n0.01\n0.00\n−0.01\n−0.02\n53784\n\n53786\n\n53788\nTime [MJD]\n\n53790\n\nTo determine the pulse period, we used the method similar to that described by Staubert et al.\n(2009) which includes two techniques for the determination of the period: epoch folding with χ2\nsearch (e.g. Leahy et al. 1983) and pulse phase connection (e.g. Deeter et al. 1981). The first one is\nused to establish the presence of the periodic signal from Her X-1 in the BAT data, determine the\napproximate period, and construct pulse profiles (by folding the data with the found period), while\nthe second is subsequently applied to the pulse profiles to determine the precise value of the period\nand its time derivative.\nFor our analysis we used the total count rates measured by BAT with a time resolution of 64\nmsec. All times of the count rates were translated to the solar system barycenter and corrected\nfor binary motion (using our newest orbital ephemeris presented in Staubert et al. 2009). Then\nwe performed a period search using epoch folding in a narrow period interval around the expected\npulse period (∼1.237 s). If a strong periodic signal is present we determined the period and used it\nto construct X-ray pulse profiles for subsequent pulse phase connection.\nA convenient way to explore the variation of the pulse period, often used in phase-connection\ntechnique, is to construct the so-called (O − C) diagram showing the estimated (observed) pulse\narrival time minus the calculated one assuming a constant period. An example of such a diagram\nmeasured with BAT during one of the Her X-1 main-on states is shown in Fig. 1. A straight line in\nthe graph would correspond to a constant period defined by the slope of the line. The solid curve\nindicates the parabolic fit to the data corresponding to a constant positive Ṗ.\n\n3. Results\nUsing the method described in the previous section we determined the pulse period P and its\ntime derivative Ṗ for most of the Her X-1 main-on states observed with BAT. For other parts of\nthe 35 d cycle, i.e. outside main-ons, the flux was too low for such determinations. At the time of\npreparing this text the data are available for the time period from March 2005 to May 2009 that\ncovers 45 35d cycles of the pulsar. For several cycles the BAT observations have relatively poor\nstatistics due to gaps in the data. For such cycles only P, but no Ṗ could be determined.\n3\n\n\fMonitoring of pulse period in Her X-1\n\n2005\n\n2006\n\nYear\n2007\n\nD. Klochkov\n\n2008\n\n2009\n\nP - 1.237s [μsec]\n\n760\n\nFigure 2: Top: Pulse period P of\nHer X-1 measured with Swift/BAT\nas a function of time. The cones\naround each point indicate the allowed range of the slope corresponding to the measured Ṗ and its uncertainties. Measurement errors of\nthe period itself are smaller than the\nsymbol sizes. Bottom: Maximum\nSwift/BAT count/rate in the respective main-on state.\n\n755\n750\n745\n740\n\nMax. BAT cts/s\n\n735\n0.08\n0.06\n0.04\n53500\n\n54000\n54500\nTime [MJD]\n\n55000\n\nThe time evolution of the measured pulse period of Her X-1 is shown in Fig. 2 together with\nthe X-ray flux in the respective main-on states. Where a corresponding value of Ṗ was measured,\nthe 1σ-uncertainty range is indicated by the cones, the orientation of which reproduce the measured\nṖ value.\nOne can see, that for many points the locally measured Ṗ is substantially different from the\none derived from P values of adjacent measurements (that is from the slope of the pulse period\ndevelopment). Thus, one can conclude that strong pulse period variations in Her X-1 occur on\nshorter time scales than the 35 d super-orbital period of the system.\nAlready in Fig. 2 one can notice that the strong spin-down episodes occasionally exhibited\nby Her X-1 and lasting from 1 to 3 main-ons are mostly coincident with drops in the X-ray flux.\nThis behavior can also be demonstrated by plotting values of Ṗ versus X-ray flux (Fig. 3). The\ndata indicate an anticorrelation as predicted by the basic accretion theory. Inspection of the linear\nPearson's correlation coefficient gives the probability of ∼4×10−4 to find the measured correlation\nby chance.\nThe correlation is mainly driven by the group of four points with high spin-down rate and\nlow flux (in the upper left part of the graph in Fig. 3). The rest of the points forms an uncorrelated\n\"cloud\" around Ṗ = 0. This means that most of the time the pulsar is close to the equilibrium regime,\nwhen spin-up and spin-down torques are nearly balanced. Sometimes, however, it switches to\nstrong spin-down accompanied by strong decrease of the X-ray flux. Such a behavior needs further\nexplanation. In the next section we argue that the episodes of strong spin-down are associated with\nstrong matter outflow from the inner parts of the accretion disk. The mass transfer rate through the\naccretion disk does not need to change significantly.\n\n4. Evidence for the coronal mass ejection\nIf one assumes that the accretion disk carries some magnetic field, it can interact via reconnection with the neutron star's magnetosphere beyond the corotation radius Rc . This might imply that\nbeyond Rc the field lines can sometimes inflate to become open (see also discussion in Lovelace\n4\n\n\fMonitoring of pulse period in Her X-1\n\nD. Klochkov\n\n50\n40\n\nṖ [10−13 s s−1 ]\n\n30\n\nFigure 3: The locally measured time\nderivative of the pulse period, Ṗ, in\nHer X-1 versus the maximum X-ray\nflux during the main-on state as determined from the Swift/BAT data. A\nlinear fit (taking uncertainties of both\nvariables into account) is shown with\nthe dashed line.\n\n20\n10\n0\n−10\n−20\n−30\n0.03\n\n0.04\n\n0.05\n0.06\n0.07\n0.08\nMax. main-on flux [BAT cts/s]\n\n0.09\n\net al. 1995). During such episodes, a substantial fraction of matter in the inner part of the accretion\ndisk can escape the system in the form of a coronal wind ejection along the open field lines.\nSuch an ejection of matter should be reflected in a secular change of the system's orbital period which is indeed observed in Her X-1 (Deeter et al. 1991; Staubert et al. 2009). To assess the\nimportance of coronal mass ejections for the orbital period evolution, we invoked general considerations of the non-conservative treatment of binary orbital parameters (see e.g. Grishchuk et al.\n2001). First, we defined the non-conservativeness parameter in the standard way (e.g. Ritter & Kolb\n1992): η = − Ṁ x / Ṁo ≤ 1, ( Ṁo < 0). Assume that the ejected mass carries away the specific angular momentum of the neutron star we express the fractional change of the orbital period through\nṀ x /M x , q and η:\n\"\n!\n#\nṀ x\n1 q/3 + 1\nq\n1 Ṗorb\n=−\n1− − 1−\n,\n(4.1)\n3 Porb\nMx\nη\nη q+1\nwhere M x is the mass of the accretor, Ṁ x is the accretion rate onto the neutron star, q = M x /Mopt is\nthe binary mass ratio.\nIt is convenient to normalize the mass accretion rate onto the neutron star Ṁ x to the value that\ncan be derived from the observed fractional change of the orbital period in the conservative case\n( Ṁ x )cons , so that ṁ ≡ Ṁ x /( Ṁ x )cons . In Her X-1 q ≃ 0.63 and one finds ( Ṁ x )cons ≃ 8 × 1017 g s−1 for\nthe measured Ṗorb = −4.85 × 10−11 s s−1 (Staubert et al. 2009). Then we can eliminate Ṗorb /Porb\nfrom the left hand side of Eq. (4.1) to obtain the equation for η at a given ṁ:\nη=\n\nq2 + 2q/3 − 1\n.\n(q2 − 1)/ṁ + 2q/3\n\n(4.2)\n\nFrom here we see that ṁ < 1 leads to η < 1, i. e. if one wants to decrease the mass accretion rate onto\nthe neutron star to get smaller X-ray luminosity (as is the case of Her X-1, where the mean observed\nL x ∼ 2 × 1037 erg s−1 is 4 times smaller than the one following from the conservative mass exchange\nanalysis, Staubert et al. 2009), a non-conservative mass exchange is required. Specifically, if we\nwant to bring in accordance the observed Ṗorb and LX in Her X-1, we would need ṁ ≃ 1/4 and\n(from Eq. 4.2) η ∼ 0.1, a fairly high non-conservative mass exchange.\nIn the frame of our model, the mass ejection from the system through the open magnetic field\nlines occurs most efficiently during strong spin-down episodes which are associated with small X5\n\n\fMonitoring of pulse period in Her X-1\n\nD. Klochkov\n\nray luminosity. Indeed, as we see in Fig 3, the observed X-ray flux is decreased by a factor of two\nduring strong spin-down. From Eq. (4.2) it is easy to find that at a given q a fractional decrease in ṁ\nleads to comparable fractional decrease in η, i.e. accretion indeed becomes more non-conservative\nduring strong mass ejection episodes. During such episodes, the neutron star spin-down power\nIωω̇ is spent to expel accreting matter from the inner disk radius Rd ∼ Rc :\nIωω̇ ∼ Ṁej\n\nGM\n.\nRc\n\n(4.3)\n\nThis equation is satisfied for the observed parameters of Her X-1: ejected mass rate during strong\nspin-downs Ṁej ∼ 0.5 Ṁ x ≃ 1017 g s−1 , Ṗ ≃ 10−12 s s−1 , and Rc ≃ 1.3 × 108 cm.\n\nReferences\nBarthelmy, S. D., Barbier, L. M., Cummings, J. R., et al. 2005, Space Science Reviews, 120, 143\nDeeter, J. E., Boynton, P. E., Miyamoto, S., et al. 1991, ApJ, 383, 324\nDeeter, J. E., Boynton, P. E., & Pravdo, S. H. 1981, ApJ, 247, 1003\nGehrels, N., Chincarini, G., Giommi, P., et al. 2004, ApJ, 611, 1005\nGerend, D. & Boynton, P. E. 1976, ApJ, 209, 562\nGiacconi, R., Gursky, H., Kellogg, E., et al. 1973, ApJ, 184, 227\nGrishchuk, L. P., Lipunov, V. M., Postnov, K. A., Prokhorov, M. E., & Sathyaprakash, B. S. 2001,\nPhysics Uspekhi, 44, 1\nKlochkov, D. 2007, PhD thesis, University of Tübingen, Germany, http://w210.ub.unituebingen.de/volltexte/2007/3181/pdf/disser.pdf\nLeahy, D. A., Elsner, R. F., & Weisskopf, M. C. 1983, ApJ, 272, 256\nLovelace, R. V. E., Romanova, M. M., & Bisnovatyi-Kogan, G. S. 1995, MNRAS, 275, 244\nReynolds, A. P., Quaintrell, H., Still, M. D., et al. 1997, MNRAS, 288, 43\nRitter, H. & Kolb, U. 1992, A&A, 259, 159\nStaubert, R., Klochkov, D., & Wilms, J. 2009, A&A, [accepted], arXiv 0904.2307\nStaubert, R., Schandl, S., Klochkov, D., et al. 2006, in American Institute of Physics Conference\nSeries, Vol. 840, The Transient Milky Way: A Perspective for MIRAX, ed. F. D'Amico, J. Braga,\n& R. E. Rothschild, 65–70\nTananbaum, H., Gursky, H., Kellogg, E. M., et al. 1972, ApJ, 174, L143\n\n6\n\n\f"}