{"id": "http://arxiv.org/abs/1011.1254v1", "guidislink": true, "updated": "2010-11-04T20:00:01Z", "updated_parsed": [2010, 11, 4, 20, 0, 1, 3, 308, 0], "published": "2010-11-04T20:00:01Z", "published_parsed": [2010, 11, 4, 20, 0, 1, 3, 308, 0], "title": "Exploring the Nature of the Brightest Hyper-luminous X-ray Source", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1011.0853%2C1011.4872%2C1011.6602%2C1011.2124%2C1011.2430%2C1011.5179%2C1011.5374%2C1011.0667%2C1011.1691%2C1011.1255%2C1011.5449%2C1011.3526%2C1011.3489%2C1011.1977%2C1011.1368%2C1011.4153%2C1011.0587%2C1011.3286%2C1011.2799%2C1011.3166%2C1011.6318%2C1011.6522%2C1011.1537%2C1011.6232%2C1011.2921%2C1011.4288%2C1011.2783%2C1011.5146%2C1011.0307%2C1011.0629%2C1011.1914%2C1011.0353%2C1011.1697%2C1011.2143%2C1011.4994%2C1011.6190%2C1011.4369%2C1011.5983%2C1011.3412%2C1011.5615%2C1011.4013%2C1011.3307%2C1011.6192%2C1011.4797%2C1011.1254%2C1011.6164%2C1011.6458%2C1011.4541%2C1011.0464%2C1011.2338%2C1011.2254%2C1011.1051%2C1011.5530%2C1011.4858%2C1011.4279%2C1011.2871%2C1011.0542%2C1011.0643%2C1011.5298%2C1011.1500%2C1011.4606%2C1011.2038%2C1011.1913%2C1011.2920%2C1011.3794%2C1011.2833%2C1011.2172%2C1011.3433%2C1011.2803%2C1011.0546%2C1011.0915%2C1011.3543%2C1011.6018%2C1011.2487%2C1011.4577%2C1011.1767%2C1011.4327%2C1011.1495%2C1011.2968%2C1011.5968%2C1011.4523%2C1011.4444%2C1011.3027%2C1011.5408%2C1011.1874%2C1011.2385%2C1011.1054%2C1011.3622%2C1011.1581%2C1011.2067%2C1011.5212%2C1011.2634%2C1011.6353%2C1011.2206%2C1011.2858%2C1011.3723%2C1011.2705%2C1011.4965%2C1011.5083%2C1011.2021%2C1011.5521&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Exploring the Nature of the Brightest Hyper-luminous X-ray Source"}, "summary": "The small subset of hyper-luminous X-ray sources with luminosities in excess\nof ~1E41 erg/s are hard to explain without the presence of an intermediate mass\nblack hole, as significantly super-Eddington accretion and/or very small\nbeaming angles are required. The recent discovery of HLX-1, the most luminous\nobject in this class with a record breaking luminosity of ~1E42 erg/s in the\ngalaxy ESO 243-49, therefore currently provides some of the strongest evidence\nfor the existence of intermediate mass black holes. HLX-1 is almost an order of\nmagnitude brighter than the other hyper-luminous sources, and appears to\nexhibit X-ray spectral and flux variability similar to Galactic stellar mass\nblack hole X-ray binaries. In this paper we review the current state of\nknowledge on this intriguing source and outline the results of multi-wavelength\nstudies from radio to ultra-violet wavelengths, including imaging and\nspectroscopy of the recently identified optical counterpart obtained with the\nVery Large Telescope. These results continue to support an intermediate mass\nblack hole in excess of 500 Msun", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1011.0853%2C1011.4872%2C1011.6602%2C1011.2124%2C1011.2430%2C1011.5179%2C1011.5374%2C1011.0667%2C1011.1691%2C1011.1255%2C1011.5449%2C1011.3526%2C1011.3489%2C1011.1977%2C1011.1368%2C1011.4153%2C1011.0587%2C1011.3286%2C1011.2799%2C1011.3166%2C1011.6318%2C1011.6522%2C1011.1537%2C1011.6232%2C1011.2921%2C1011.4288%2C1011.2783%2C1011.5146%2C1011.0307%2C1011.0629%2C1011.1914%2C1011.0353%2C1011.1697%2C1011.2143%2C1011.4994%2C1011.6190%2C1011.4369%2C1011.5983%2C1011.3412%2C1011.5615%2C1011.4013%2C1011.3307%2C1011.6192%2C1011.4797%2C1011.1254%2C1011.6164%2C1011.6458%2C1011.4541%2C1011.0464%2C1011.2338%2C1011.2254%2C1011.1051%2C1011.5530%2C1011.4858%2C1011.4279%2C1011.2871%2C1011.0542%2C1011.0643%2C1011.5298%2C1011.1500%2C1011.4606%2C1011.2038%2C1011.1913%2C1011.2920%2C1011.3794%2C1011.2833%2C1011.2172%2C1011.3433%2C1011.2803%2C1011.0546%2C1011.0915%2C1011.3543%2C1011.6018%2C1011.2487%2C1011.4577%2C1011.1767%2C1011.4327%2C1011.1495%2C1011.2968%2C1011.5968%2C1011.4523%2C1011.4444%2C1011.3027%2C1011.5408%2C1011.1874%2C1011.2385%2C1011.1054%2C1011.3622%2C1011.1581%2C1011.2067%2C1011.5212%2C1011.2634%2C1011.6353%2C1011.2206%2C1011.2858%2C1011.3723%2C1011.2705%2C1011.4965%2C1011.5083%2C1011.2021%2C1011.5521&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The small subset of hyper-luminous X-ray sources with luminosities in excess\nof ~1E41 erg/s are hard to explain without the presence of an intermediate mass\nblack hole, as significantly super-Eddington accretion and/or very small\nbeaming angles are required. The recent discovery of HLX-1, the most luminous\nobject in this class with a record breaking luminosity of ~1E42 erg/s in the\ngalaxy ESO 243-49, therefore currently provides some of the strongest evidence\nfor the existence of intermediate mass black holes. HLX-1 is almost an order of\nmagnitude brighter than the other hyper-luminous sources, and appears to\nexhibit X-ray spectral and flux variability similar to Galactic stellar mass\nblack hole X-ray binaries. In this paper we review the current state of\nknowledge on this intriguing source and outline the results of multi-wavelength\nstudies from radio to ultra-violet wavelengths, including imaging and\nspectroscopy of the recently identified optical counterpart obtained with the\nVery Large Telescope. These results continue to support an intermediate mass\nblack hole in excess of 500 Msun"}, "authors": ["Sean Farrell", "Mathieu Servillat", "Klaas Wiersema", "Didier Barret", "Olivier Godet", "Ian Heywood", "Thomas Maccarone", "Samantha Oates", "Bastien Plazolles", "Natalie Webb"], "author_detail": {"name": "Natalie Webb"}, "author": "Natalie Webb", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1002/asna.201011507", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1011.1254v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1011.1254v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "6 pages, 6 figures. Accepted for publication in the Astronomische\n  Nachrichten, to appear in the proceedings of the conference \"Ultra-Luminous\n  X-ray sources and Middle Weight Black Holes\" (Madrid, May 24-26, 2010)", "arxiv_primary_category": {"term": "astro-ph.HE", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph.HE", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "astro-ph.CO", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1011.1254v1", "affiliation": "CNRS", "arxiv_url": "http://arxiv.org/abs/1011.1254v1", "journal_reference": null, "doi": "10.1002/asna.201011507", "fulltext": "Astron. Nachr. / AN , No. , 1 – 7 () / DOI please set DOI!\n\nExploring the Nature of the Brightest Hyper-luminous X-ray Source\nS. A. Farrell1,⋆ , M. Servillat2 , K. Wiersema1 , D. Barret3,4 , O. Godet3,4 , I. Heywood5, T. J. Maccarone6 ,\nS. R. Oates7 , B. Plazolles3,4 , and N. A. Webb3,4\n1\n\narXiv:1011.1254v1 [astro-ph.HE] 4 Nov 2010\n\n2\n3\n4\n5\n6\n7\n\nDepartment of Physics and Astronomy, University of Leicester, University Road, Leicester, LE1 7RH, UK\nHarvard-Smithsonian Center for Astrophysics, 60 Garden Street, MS-67, Cambridge, MA 02138, USA\nUniversité de Toulouse, UPS, CESR, 9 Avenue du Colonel Roche, F-31028 Toulouse cedex 9, France\nCNRS, UMR5187, F-31028 Toulouse, France\nDepartment of Astrophysics, University of Oxford, Keble Road, Oxford, OX1 3RH, UK\nSchool of Physics and Astronomy, University of Southampton, Hampshire, SO17 1BJ, UK\nMullard Space Science laboratory/UCL, Holmbury St. Mary, Dorking, Surrey, RH5 6NT, UK\n\nReceived 30 May 2005, accepted 11 Nov 2005\nPublished online later\nKey words\n\naccretion, accretion disks – X-rays: binaries – X-rays: individual (ESO 243-49 HLX-1)\n\nThe small subset of hyper-luminous X-ray sources with luminosities in excess of ∼1041 erg s−1 are hard to explain\nwithout the presence of an intermediate mass black hole, as significantly super-Eddington accretion and/or very small\nbeaming angles are required. The recent discovery of HLX-1, the most luminous object in this class with a record breaking\nluminosity of ∼1042 erg s−1 in the galaxy ESO 243-49, therefore currently provides some of the strongest evidence for\nthe existence of intermediate mass black holes. HLX-1 is almost an order of magnitude brighter than the other hyperluminous sources, and appears to exhibit X-ray spectral and flux variability similar to Galactic stellar mass black hole\nX-ray binaries. In this paper we review the current state of knowledge on this intriguing source and outline the results\nof multi-wavelength studies from radio to ultra-violet wavelengths, including imaging and spectroscopy of the recently\nidentified optical counterpart obtained with the Very Large Telescope. These results continue to support an intermediate\nmass black hole in excess of 500 M⊙ .\nc WILEY-VCH Verlag GmbH & Co. KGaA, Weinheim\n\n1 Introduction\nUltra-luminous X-ray Sources (ULXs) are extragalactic objects located outside the nucleus of the host galaxy with\nbolometric luminosities above the Eddington limit for a stellar mass black hole (i.e. > 2.6 × 1039 erg s−1 for a 20\nM⊙ black hole; see Fabbiano & White 2006 for a review\nof ULXs). These extreme luminosities, if the emission is\nisotropic and below the Eddington limit, imply the presence\nof a new class of \"intermediate mass\" accreting black holes\nwith masses between ∼102 – 105 M⊙ . However, hyperaccretion (Begelman 2002) and/or beaming (Freeland et al.\n2006; King 2008) can cause a stellar mass black hole to\nappear to exceed the Eddington limit. The most luminous\nULXs – the hyper-luminous X-ray sources (HLXs) – have\nluminosities in excess of ∼1041 erg s−1 , and are more difficult to explain through hyper-accretion or beaming.\nThe brightest HLX currently known is HLX-1in the\nedge-on S0a spiral galaxy ESO 243-49, with a derived maximum luminosity (assuming it is at the galaxy redshift of z\n= 0.0224) of ∼1042 erg s−1 (Farrell et al. 2009). This object is almost an order of magnitude more luminous than\nthe other HLXs (e.g. Gao et al. 2003), and is currently\n⋆ Corresponding author: e-mail: saf28@star.le.ac.uk\n\nthe strongest candidate for hosting an intermediate mass\nblack hole. Since its discovery, a large amount of multiwavelength archival and new data has been scrutinised in\nan attempt to uncover the nature of this source. In this paper\nwe will review the current state of knowledge on HLX-1.\n\n2 X-ray Observations\nHLX-1 was discovered serendipitously while mining the\n2XMM catalogue (Watson et al. 2009) for soft spectrum\nX-ray sources (Farrell et al. 2009). The field of ESO 24349 was observed in November 2004 for ∼22 ks during an\nobservation of the galaxy group centered on the galaxy IC\n1633. The European Photon Imaging Camera (EPIC) pn,\nMOS1 and MOS2 X-ray spectra during this observation\nwere best fitted with a simple absorbed power-law1 with a\nneutral hydrogen column density of 0.08 ± 0.03 × 1022\n1 Soria et al. (2010b) have recently argued that the spectrum during this\nobservation is better modeled with the addition of a soft thermal component, citing an F-test significance of ∼95% as justification for the component addition. Disregarding the fact that the quoted F-test probability is\nonly at the 2σ level, the use of the F-test in this scenario is seriously flawed.\nProtassov et al. (2002) have shown that the F-test is invalid when assessing\nthe significance of an addition feature such as a blackbody component. A\nmuch more robust approach is to use simulations such as the posterior predictive p-values method (Hurkett et al. 2008) used by Farrell et al. (2009)\nto show a soft thermal component was not statistically required.\n\nc WILEY-VCH Verlag GmbH & Co. KGaA, Weinheim\n\n\f2\n\nS. A. Farrell et al.: Exploring the Nature of the Brightest Hyper-luminous X-ray Source\n\natom cm−2 and a photon index of 3.4 ± 0.3, giving an unabsorbed luminosity in the 0.2 – 10 keV band of 1.1 +0.01\n−0.4\n× 1042 erg s−1 assuming it is located within ESO 243-49\n(Farrell et al. 2009).\nA follow-up ∼50 ks XMM-Newton observation was performed in November 2008. Although the flux did not appear\nto have differed significantly within the errors from the first\nobservation, the spectrum during this second observation\nwas not adequately modeled with a simple absorbed powerlaw. Instead, the addition of a soft thermal component in the\nform of a multi-coloured disc blackbody component significantly improved the fit (∆χ2 ∼ 160 for 2 fewer degrees of\nfreedom). The X-ray spectrum during this observation was\nbest fitted with an absorbed power-law plus disc blackbody\nwith a neutral hydrogen column density of 0.04 ± 0.01 ×\n1022 atom cm−2 , a photon index of 2.2 +0.4\n−0.3 , and an inner\ndisc temperature of 0.18 ± 0.01 keV, giving an unabsorbed\nluminosity in the 0.2 – 10 keV band of 6.4 ± 0.6 × 1041\nerg s−1 , where the disc blackbody component contributes\n∼80 % of the flux (Farrell et al. 2009). Although the luminosity appears to have dropped since the first XMM-Newton\nobservation, the values overlap within the errors so we cannot claim flux variability between the two observations, although the spectral shape did change significantly.\nIn order to facilitate multi-wavelength studies of HLX-1\nand search for an optical counterpart, we first needed to refine the X-ray position to sub-arcsecond accuracy. We thus\nobtained a 1 ks observation of HLX-1 with the HRC-I camera on Chandra in July 2009. The predicted HRC count rate,\nif the flux and spectrum remained the same as that observed\nwith XMM-Newton, was 0.03 count s−1 . This should have\nprovided sufficient counts for us to obtain a precise position.\nHowever, no source was detected within the XMM-Newton\nerror circle of HLX-1, indicating the count rate had dropped\nby at least a factor of 5 (Webb et al. 2010a). Swift XRT observations of HLX-1 confirmed the drop in flux and found\nthat one month later the flux increased significantly (Godet\net al. 2009). Following this re-brightening we obtained a\nsecond deeper 10 ks observation with the HRC-I in August 2009, detecting HLX-1 with a net count rate of 0.098\n± 0.003 cts s−1 , indicating an increase in flux by a factor\nof >16 between the two Chandra observations. After correcting the astrometry by cross-matching detected sources\nagainst the 2MASS catalogue, a final position of RA = 01h\n10m 28.29s, Dec = -46◦ 04' 22.3\" was obtained for HLX-1,\nwith a 95% error of 0.3\" (Webb et al. 2010a).\nFollowing the re-detection of HLX-1 in August 2009,\nit has been monitored regularly with Swift in X-ray and UV\nwavelengths. HLX-1 has exhibited dramatic variability over\nthis time, increasing in count rate by a factor of ∼40 over\n∼1 week in August 2009 to 1.1 ± 0.1 × 1042 erg s−1 (Figure 1). In this high flux state the spectrum can be best fitted by an absorbed disc blackbody model without the requirement for an additional power law component2 within\n2\n\nSoria et al. (2010b) derive a slightly lower luminosity during this state\nusing various thermal models with the addition of a weak power law com-\n\nc WILEY-VCH Verlag GmbH & Co. KGaA, Weinheim\n\nthe limited band pass (and reduced sensitivity) of the XRT\n(Godet et al. 2009).\nSince the dramatic re-brightening in August 2009, the\nflux of HLX-1 has been gradually decaying. An XRT observation taken on the 13th of August 2010 measured a count\nrate of 0.002 ± 0.001 count s−1 , consistent with the lowest\ncount rate of 0.0008 ± 0.0004 count s−1 in August 2009.\nIn May 2010 we triggered a 100 ks observation with XMMNewton aimed at constraining the shape of the HLX-1 spectrum during this low flux state (Farrell et al. 2010). Preliminary analysis of this data indicates HLX-1 was at a luminosity of ∼3 × 1040 erg s−1 during this observation, almost\ntwo orders of magnitude below the highest luminosity measurement obtained to date.\nHLX-1 has been undergoing significant spectral variability in conjunction with the observed large scale flux\nvariability, with the spectrum varying between a state dominated by the thermal component and a steep power-law\nstate where the thermal component is not present (Godet\net al. 2009). The hardness ratios (defined as the ratio of the\n1 – 10 keV count rates over the 0.3 – 1 keV rates) vary\nsignificantly with changing luminosity in a manner reminiscent of the hysteresis behaviour seen in Galactic stellar mass black hole binaries (Figure 2; e.g. Maccarone &\nCoppi 2003). The hardness ratio errors during the low flux\nstates are large, precluding us from definitively determining using the Swift data alone whether HLX-1 is in the\ncanonical low/hard state. However, the preliminary analysis of our most recent XMM-Newton observation confirms\nthat the spectrum of HLX-1 was significantly harder than\nit was during the two previous XMM-Newton observations\n(with a pn hardness ratio of 1.0 ± 0.2 compared to 0.30 ±\n0.06 and 0.268 ± 0.007, calculated using the same definition in Godet et al. 2009), with a power-law photon index of\n∼2 (Farrell et al. 2010). It thus appears that HLX-1 is in a\nmuch harder state at lower luminosities than when it is in the\nhigh state. However, additional analysis of the timing data is\nrequired in order to conclusively determine whether HLX-1\nis in the low/hard state (and thus the first ULX to undergo\nthe same spectral hysteresis variability as stellar mass black\nhole X-ray binaries).\n\n3 Ultraviolet Observations\nIn conjunction with the X-ray observations, HLX-1 has\nbeen observed regularly with the Ultraviolet and Optical\nTelescope (UVOT) obtained as part of the Swift monitoring campaign, with most of the data obtained in the uvw2\nfilter (∼1600 – 2500 Å; Webb et al. 2010a). As of the 14th\nof August 2010 ∼150 ks of data had been taken in this filter,\nproviding the deepest and highest resolution UV imaging of\nthis field to date. The core of ESO 243-49 is clearly detected\nas an extended source in the co-added image from all these\nponent. However, the χ2 /d.o.f. of 14.4/21 for the pure disc blackbody fit\nindicates that the statistics are too poor to accurately constrain the spectral\nshape in this data.\n\nwww.an-journal.org\n\n\fAstron. Nachr. / AN ()\n\nFig. 1 Swift XRT light curve from the long-term monitoring campaign. The arrows indicate the times of the second\nXMM-Newton, first Chandra, second Chandra, and third\nXMM-Newton observations from left to right respectively.\n\nFig. 2 Hardness intensity diagram constructed from the\nSwift XRT data (S2 – S8), with points representing the\nXMM-Newton data from the first (XMM1) and second\n(XMM2) observations.\nobservations, with some hints of elongation towards the position of HLX-1 (Figure 3). A similar extension is seen in\nthe GALEX near- and far-UV images (Webb et al. 2010a),\nindicating that this feature is likely to be real. However, with\nthe relatively low resolution of the UVOT and GALEX images, it is not clear at this stage whether the emission is truly\nextended or represents emission from an unresolved point\nsource, or even whether it is associated with HLX-1 or ESO\n243-49.\n\n4 Optical Observations\nThe refined X-ray source position led to the discovery of\na faint optical counterpart by Soria et al. (2010a) in the\nV - (24.5 mag) and R-bands (23.8 mag) using the Baade\nMagellan telescope. Assuming this is the true counterpart,\nthe maximum X-ray to optical flux ratio (Fx /Fopt ) of HLX1 is ∼1000, two orders of magnitude higher than is typically seen for AGN (e.g. Severgnini et al. 2003), making a\nbackground source highly unlikely. However, it has recently\n\nwww.an-journal.org\n\n3\n\nFig. 3 Uvw2 image from 150 ks of Swift UVOT data.\nThe white contours show the orientation of the galaxy, and\nthe white circle indicates the Chandra position of HLX-1.\nThe green circle indicates the position of the background\nemission-line source (see Figure 5).\nbeen argued that the X-ray spectrum, optical colours3 and\nFx /Fopt ratio of HLX-1 were consistent with a Galactic quiescent neutron star X-ray binary (Soria et al. 2010a, 2010b).\nHowever, the observed large scale variability of HLX-1 is\nhighly unusual for an object of this kind (e.g. Servillat et al.\n2008). Nonetheless, in order to determine whether HLX-1\nis truly associated with ESO 243-49 we sought optical spectroscopic observations so as to obtain a redshift.\nFollowing the detection of the counterpart we obtained\noptical spectroscopic data using the Very Large Telescope\n(VLT; Wiersema et al. 2010). We acquired deep spectroscopy on four nights in November and December 2009,\nusing the FORS2 instrument on the Antu telescope of the\nVLT with the 300I grism using the OG590 filter. We also\nperformed ∼30 min of imaging in the I-band (Figure 4,\nleft). To confirm the detection of the optical counterpart,\nwe utilised a similar method as Soria et al. (2010a). We\nsmoothed the image along the axis of the galaxy using a\n2-D median-filter, and then subtracted the smoothed image from the un-smoothed image so as to remove diffuse\nemission from the host galaxy. The resulting image shows a\nclear residual consistent with the Chandra position of HLX1 (Figure 4, right), confirming the detection of an optical\ncounterpart. An accurate determination of the I-band magnitude is a work in progress (Webb et al. 2010b).\nThe 2-D spectrum shows strong absorption bands typical of a S0 type galaxy to be present in the galaxy bulge\n(Figure 5, top). The Na ID and Hα absorption features were\nclearly detected, giving a redshift for the galaxy of z =\n0.0223 consistent with previous measurements (Afonso et\nal. 2005). In addition to these features, a faint trace can be\nseen at the position of HLX-1, despite its proximity to the\nbright galaxy nucleus. The Hα absorption feature is also\npresent in the HLX-1 trace, and is partially filled in. The\nbright trace in the lower half of Figure 5 is the point source\nat RA = 01h10′27.4′′ , Dec = -46◦ 04′ 25.3′′ to the North West\n3 It should be noted that with magnitudes in only two bands, the optical\ncolours are also consistent with many other types of objects.\n\nc WILEY-VCH Verlag GmbH & Co. KGaA, Weinheim\n\n\f4\n\nS. A. Farrell et al.: Exploring the Nature of the Brightest Hyper-luminous X-ray Source\n\nof the bulge of ESO 243-49. The absence of the Hα absorption line in this trace indicates it is a foreground star. In\ncontrast, the fact that the Hα absorption feature is clearly\npresent in the HLX-1 trace indicates it cannot be a foreground object, and must therefore be in or behind ESO 24349.\nAnother interesting feature in Figure 5 is the bright\nemission line source just below the HLX-1 trace at an approximate position of RA = 01h10′28′′ , Dec = -46◦ 04′ 23′′ .\nThe position of this object is ∼3′′ from the Chandra position of HLX-1, well outside the X-ray error circle and therefore clearly not associated with HLX-1. The emission feature appears extended and is clearly resolved into two separate velocity components, possibly indicative of rotation.\nWe therefore conclude that this feature is most likely associated with a background galaxy. If the feature is the Hα line,\nthis puts the background galaxy at a redshift of ∼0.03. It is\ninteresting to note that the position of this object is also coincident with the extended UV emission in the UVOT uvw2\nimage, closer to the core of the extended UV lobe (see Figure 3). It is therefore possible that the UV emission that we\nspeculate could be associated with HLX-1 may instead be\nlinked to this other source.\nThe HLX-1 background subtracted spectrum reveals an\nemission line with a significance of 11.3σ and an approximately Gaussian profile superimposed on a very weak continuum (Figure 6). The central wavelength of this emission line is 6721 Å, consistent with it being Hα at a redshift of z = 0.0223. The luminosity of this line is ∼1037\nerg s−1 , although the errors introduced through the background subtraction prohibit us from estimating a luminosity\nfor the continuum emission. The offset of this line from the\nESO 243-49 redshift is ∼170 km s−1 , considerably smaller\nthan the galaxy rotation curve and therefore consistent with\nHLX-1 being gravitationally bound to ESO 243-49. The\nonly other plausible identification of this line is [OII] for\na source at z = 0.80; however, the Fx /Fopt ratio of ∼1000\nargues strongly against a background galaxy. We therefore\nconclude that the line is most likely Hα emission from an\nobject gravitationally bound to ESO 243-49 (Wiersema et\nal. 2010).\n\nFig. 4 Left: VLT I-band image of ESO 243-49. The green\nlines indicate the orientation of the slit, and the position\nof HLX-1 is marked with the red ticks and circle. Right:\nresidual image generated by subtracting a 2-D median-filter\nsmoothed image from the un-smoothed image. The contours\nindicate the orientation of ESO 243-49 taken from the unsmoothed image.\n\n5 Discussion\nThe detection of the Hα emission line at a redshift consistent with that of ESO 243-49 conclusively puts HLX-1 at\na distance of ∼95 Mpc, thereby ruling out a background\nAGN or a foreground object such as a Galactic quiescent\nneutron star X-ray binary. This redshift measurement also\nconfirms HLX-1 as the most extreme ULX with a maximum\nluminosity of ∼1042 erg s−1 . The precise nature of HLX-1,\nhowever, is still unclear.\nThe large scale X-ray variability of HLX-1 rules out a\ncollection of unresolved lower-luminosity sources. A luminous supernova remnant is also ruled out as such an object\n\nc WILEY-VCH Verlag GmbH & Co. KGaA, Weinheim\n\nFig. 5 Top: 2-D spectrum from the VLT FORS2 observations. The Hα absorption line at 6716 Å is indicated by\nthe arrow. The bright emission line source just below the\nHLX-1 trace is likely to be a background galaxy. Bottom:\nResidual spectrum produced by subtracting the smoothed\n2-D spectrum from the un-smoothed spectrum. A residual\nin the HLX-1 trace at the wavelength of Hα at the redshift\nof ESO 243-49 is clearly present. The position of HLX-1 is\nindicated with the dashed horizontal lines in both panels.\n\nwww.an-journal.org\n\n\fAstron. Nachr. / AN ()\n\nFig. 6 Top: 1-D spectrum extracted from the position of\nHLX-1 (red) and a background spectrum interpolated from\nneighbouring sub-apertures (blue). The absorption line at\n6716 Å is Hα at the redshift of ESO 243-49. Bottom: background subtracted spectrum of HLX-1, showing line emission at 6721 Å with a significance of 11.3σ. The red dashed\nline indicates the Gaussian model fitted to the emission line.\nThe dotted vertical line indicates the wavelength of the Hα\nabsorption line in the ESO 243-49 spectrum.\n\nwould be expected to be located in areas where star formation has occurred, which is difficult to reconcile with the location of HLX-1 outside the galaxy plane. We are therefore\nleft with an object within the bounds of ESO 243-49 that appears to exceed the Eddington limit for a stellar mass black\nhole by a significant margin. The X-ray spectra of HLX1 observed over a range of luminosities are all consistent\nwith an accreting black hole (e.g. Maccarone 2003), and it\nis difficult to envisage the X-ray emission arising from any\nother type of object. The remaining question is whether the\nblack hole in question is stellar mass (presumably undergoing hyper-accretion and/or beaming) or in the intermediate\nmass range.\nStellar mass black hole binaries can theoretically exceed\nthe Eddington limit for short periods of time by up to a factor of 10 (Begelman 2002), leading Farrell et al. (2009) to\nplace a conservative lower limit of 500 M⊙ on the mass\nof the black hole. The spectral variability observed from\nHLX-1 is entirely consistent with the behaviour of Galactic stellar mass black hole binaries, with the most recent\nXMM-Newton observations confirming that at a luminosity\nof ∼3 × 1040 erg s−1 it has a significantly harder spectrum\nthan that observed at luminosities >1041 erg s−1 (compatible with it being in the canonical low/hard state). Stellar\nmass black hole binaries that are observed at intermediate inclination angles (i.e. with 0◦ ≫ i ≪ 90◦ ) typically\nhave luminosities of ∼1 – 3% of the Eddington value in\nthe low/hard state (Maccarone 2003), implying a mass of\n∼8,000 – 23,000 M⊙ for HLX-1 if it is in a similar spectral state at its lower luminosity and assuming that (like the\nGalactic binaries) the observed emission is not beamed towards us.\n\nwww.an-journal.org\n\n5\n\nIt has been suggested that ULXs may represent extragalactic analogues of the Galactic microquasar SS 433\nthat are viewed \"face-on\", such that mild geometric beaming effects and high mass accretion rates could easily explain the apparent super-Eddington luminosities (e.g. King\net al. 2001; Begelman, King, & Pringle 2006). Such systems would thus represent a short-lived yet extremely common stage in the evolution of high mass X-ray binaries\n(HMXBs), where sufficient thermal-timescale mass transfer\nis provided by Roche-Lobe overflow accretion from a high\nmass companion star (King et al. 2001). Support for this\ntheory has been provided by the apparent excess of ULXs\nfound near star forming regions (e.g. Swartz, Tennant & Soria 2009), where HMXBs should be plentiful. However, it\nshould be noted that while many ULXs are found near star\nforming regions, none have as yet been found within massive star clusters (e.g. Swartz et al. 2009). This is not necessarily a problem, however, as ULXs may be kicked out\nof the star clusters through anisotropic supernovae explosions4 (A. R. King 2010, private communication). HLX-1 is\nlocated in the outskirts of ESO 243-49 at ∼1 kpc above the\nplane, far removed from any regions of star formation where\na population of HMXBs might be found, although a not unreasonable kick velocity of ∼100 km s−1 could account for\nthis offset from the plane within the expected lifetime of a\nhigh mass companion.\nRelativistic Doppler beaming from a face-on low mass\nX-ray binary still remains a possibility, although it is difficult to reconcile the observed variability with this model.\nAs noted earlier, HLX-1 appears to follow a similar track in\nthe hardness-intensity diagrams as the Galactic stellar mass\nblack hole binaries that are not viewed down the jet axis.\nIn stellar mass black hole systems jets have been observed\nto turn on during the low/hard state, and turn off following a transition to the high/soft state (e.g. Belloni 2010).\nIt therefore follows that relativistic beaming is likely to be\nstrongest when HLX-1 is at the lower luminosities, with the\njets pointing away from us.\nAlternatively, if we are looking at HLX-1 face-on (i.e.\ndown the jet axis), then how do we explain the observed\nvariability? If the jets turn off during the low flux state, then\nthe observed luminosity of ∼1040 erg s−1 it still far too\nhigh for a stellar mass black hole. An alternative possibility is that the variability could be tied to a changing viewing\nangle, in turn linked to the precession of jets through radiation induced warping such as is seen with SS 433 (e.g.\nFabrika 2004). Continued long term monitoring in X-rays\nwith the Swift observatory is necessary to test this hypothesis, although it seems much more likely that like the Galactic stellar mass black hole binary systems that it appears to\nresemble, the emission of HLX-1 is not beamed directly towards us.\n4 An alternative possibility is that some ULXs may not be the product\nof recent star formation episodes, but instead may be the cause. This is a\nnatural conclusion if ULXs represent the nuclei of accreted satellite galaxies, which should drive star formation as they interact with the larger host\ngalaxies.\n\nc WILEY-VCH Verlag GmbH & Co. KGaA, Weinheim\n\n\f6\n\nS. A. Farrell et al.: Exploring the Nature of the Brightest Hyper-luminous X-ray Source\n\nRelativistic jets should also produce radio emission with\na luminosity that is a function of both the X-ray luminosity and the black hole mass (the black hole \"fundamental plane\" relation; e.g. Körding, Falcke & Corbel 2006).\nThe deepest radio observation to date of this source has\nbeen with the Australia Telescope Compact Array at 1.4\nGHz (Hopkins et al. 2003) . The centre of ESO 243-49 was\nclearly detected, but no emission was evident at the position of HLX-1 down to a 3σ upper limit of 45 μJy (Webb\net al. 2010b). The non-detection is consistent with the black\nhole fundamental plane relation if HLX-1 is an intermediate\nmass black hole of ≤105 M⊙ , as the expected flux density\nwould be below the sensitivity limits of the most powerful radio telescopes currently available. Alternatively, if the\nblack hole mass was ≥106 M⊙ , we would have expected\nto have detected it with a flux density of ∼185 μJy, therefore ruling out a super-massive black hole for HLX-1. We\nwould, however, only expect to see radio emission when in\nthe low/hard state, so the non-detection is also consistent\nwith a non-jet state.\nThe detection of the Hα emission line allows us to place\nsome constraints on the nature of the X-ray emission. The\nratio of Hα to X-ray luminosity (LHα /LX ) is ∼10−5 , assuming LX = 1042 erg s−1 . The typical disk photons from\nHLX-1 will be ∼ 250 times as energetic as Hα photons.\nThe cross-section for absorption of ∼ 0.5 keV electrons\nis roughly the Thompson cross-section (Bell & Kingston\n1967). Assuming that the local absorbing column near the\nsource is of order or less than the foreground NH of 4×1020\ncm−2 , then only ∼ 3 × 10−4 of the X-ray luminosity should\nbe absorbed. The re-emission as Hα will then produce a luminosity of ∼ 10−6 of the X-ray luminosity – an order of\nmagnitude below that observed. Since the emission line region is likely to be optically thin, and hence isotropic, it\nis unlikely that the X-ray emission is strongly beamed toward us, unless the Hα emission is primarily due to collisional excitation rather than photoionisation. Given the\nsource location far from the galactic plane of ESO 24349, this seems unlikely. Additional emission line diagnostics would nonetheless be extremely helpful for confirming\nthe usefuless of the Hα luminosity as a constraint on beaming.\nA more likely scenario perhaps is that HLX-1 is the nucleated remnant of an accreted satellite dwarf galaxy. Such\na scenario has previously been suggested as a possible origin for the brightest ULXs (King & Dehnen 2005), and can\neasily account for the extreme luminosity (assuming that the\ndwarf galaxy in question contained a central black hole of\nintermediate mass) and the location of HLX-1 outside the\nplane of ESO 243-49 (Bellovary 2010). Such a nucleated\ndwarf galaxy would appear in many respects very similar to\na globular cluster, another possible environment in which\nan intermediate mass black hole might form (e.g. Miller\n& Hamilton 2002). In order to confirm this hypothesis, it\nis necessary to obtain further deep observations in nearinfrared, optical and UV wavelengths so as to construct a\n\nc WILEY-VCH Verlag GmbH & Co. KGaA, Weinheim\n\nspectral energy distribution and thus determine the nature of\nthe environment around HLX-1. To this end, we have been\nawarded high resolution imaging in near-infrared to far-UV\nbands with the Hubble Space Telescope in cycle 18, which\nshould enable us to shed light on the nature of HLX-1 in the\nnear future.\nAcknowledgements. We thank the anonymous referee for their\nhelpful comments. S.A.F., K.W., T.J.M., I.H., and S.R.O. acknowledge STFC funding. T.J.M. thanks the European Union FP7 for\nsupport through grant 215212 Black Hole Universe. M.S. is supported in part by Chandra grants AR9-0013X and GO9-0102X.\n\nReferences\nAfonso, J., Georgakakis, A., Almeida, C., Hopkins, A. M., Cram,\nL. E., Mobasher, B., Sullivan, M.: 2005, ApJ 624, 135\nBell, K. L., Kingston, A. E.: 1967, MNRAS,136, 241\nBelloni, T. M.: 2010, AIP Conf. Proc. 1248, 107\nBellovary, J. M., Governato, F., Quinn, T. R., Wadsley, J., Shen, S.,\nVolonteri, M.: 2010, ApJ, 721, L148\nBegelman, M. C.: 2002, ApJ 568, L97\nBegelman, M. C., King, A. R., Pringle, J. E.: 2006, MNRAS 370,\n399\nFabbiano, G., White, N. W.: 2006, Compact Stellar X-ray Sources,\n475\nFabirka, S.: 2004, ASPRv 12, 1\nFarrell, S. A., Webb, N. A., Barret, D., Godet, O., Rodrigues, J.\nM.: 2009, Nat 460, 73\nFarrell, S. A., Webb, N. A., Barret, D., Servillat, M., Godet, O.:\n2010, MNRAS, in preparation\nFreeland, M., Kuncic, Z., Soria, R., Bicknell, G. V.: 2006, MNRAS 372, 630\nGao, Y., Wang, D. Q., Appleton, P. N., Lucas, R. A.: 2003,\nApJ 596, L171\nGodet, O., Barret, D., Webb, N. A., Farrell, S. A., Gehrels, N.:\n2009, ApJ 705, L109\nHopkins, A. M., Afonso, J., Chan, B., Cram, L. E., Georgakakis,\nA., Mobasher, B.: 2003, AJ, 125, 465\nHurkett, C. P., Vaughan, S., Osborne, J. P. et al.: 2008, ApJ 679,\n587\nKing, A. R.: 2008, MNRAS 385, L113\nKing, A. R., Davies, M. B., Ward, M. J., Fabbiano, G., Elvis, M.:\n2001, ApJ, 552, L109\nKing, A. R., Dehnen, W.: 2005, MNRAS 357, 275\nKörding, E., Falcke, H., Corbel, S.: 2006, A&A 456, 439\nMaccarone, T. J.: 2003, A&A 409, 697\nMaccarone, T. J., Coppi, P. S.: 2003, MNRAS 338, 189\nMiller, M. C, Hamilton, D. P.: 2002, MNRAS 330, 232\nProtassov, R., van Dyk, D. A., Connors, A., Kashyap, V. L.,\nSiemiginowska, A.: 2002, ApJ 571, 545\nServillat, M., Dieball, A., Webb, N. A. et al.: 2008, A&A 490, 641\nSevergnini, P., Caccianiga, A., Braito, V. et al.: 2003, A&A 406,\n483\nSoria, R., Hau, G. K. T., Graham, A. W., Kong, A. K. H., Kuin,\nN. P. M., Li, I.-H., Liu, J.-F., Wu, K.: 2010a, MNRAS 405,\n870\nSoria, R., Zampieri, L., Zane, S., Wu, K.: 2010b, MNRAS , in\npress (arXiv:1008.3382)\nSwartz, D. A., Tennant, A. F., Soria, R.: 2009, ApJ 703, 159\nWatson, M. G., Schröder, A., Fyfe, D. et al.: 2009, A&A 493, 339\nWebb, N. A., Barret, D., Farrell, S. A., Godet, O., Heywood, I.,\nOates, S., Pancrazi, B., Servillat, M.: 2010, ApJ, in preparation\n\nwww.an-journal.org\n\n\fAstron. Nachr. / AN ()\n\n7\n\nWebb, N. A., Barret, D., Godet, O., Servillat, M., Farrell, S. A.,\nOates, S. R.: 2010, ApJ 712, L107\nWiersema, K., Farrell, S. A., Webb, N. A., Servillat, M., Maccarone, T. J., Barret, D., Godet, O.: 2010, ApJ, 721, L102\n\nwww.an-journal.org\n\nc WILEY-VCH Verlag GmbH & Co. KGaA, Weinheim\n\n\f"}