{"id": "http://arxiv.org/abs/1105.1813v1", "guidislink": true, "updated": "2011-05-09T22:39:09Z", "updated_parsed": [2011, 5, 9, 22, 39, 9, 0, 129, 0], "published": "2011-05-09T22:39:09Z", "published_parsed": [2011, 5, 9, 22, 39, 9, 0, 129, 0], "title": "Properties of magnetic nanodots with perpendicular anisotropy", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1105.5315%2C1105.2434%2C1105.3205%2C1105.1813%2C1105.0524%2C1105.5983%2C1105.2244%2C1105.0712%2C1105.2981%2C1105.1888%2C1105.4375%2C1105.1188%2C1105.0641%2C1105.3652%2C1105.3580%2C1105.3990%2C1105.0630%2C1105.2423%2C1105.4170%2C1105.3610%2C1105.4650%2C1105.1614%2C1105.4850%2C1105.3568%2C1105.0439%2C1105.3754%2C1105.3785%2C1105.3643%2C1105.2363%2C1105.4286%2C1105.1213%2C1105.3334%2C1105.2668%2C1105.1678%2C1105.1908%2C1105.2843%2C1105.6178%2C1105.4669%2C1105.5027%2C1105.3586%2C1105.5506%2C1105.1577%2C1105.3752%2C1105.0485%2C1105.4257%2C1105.1098%2C1105.0553%2C1105.0529%2C1105.5544%2C1105.4999%2C1105.3883%2C1105.4216%2C1105.2332%2C1105.2770%2C1105.0558%2C1105.4655%2C1105.1792%2C1105.2703%2C1105.3876%2C1105.3707%2C1105.4427%2C1105.5278%2C1105.1235%2C1105.1820%2C1105.2578%2C1105.4533%2C1105.5482%2C1105.2299%2C1105.1441%2C1105.4264%2C1105.2333%2C1105.3307%2C1105.3297%2C1105.6140%2C1105.2177%2C1105.1022%2C1105.3793%2C1105.0348%2C1105.3469%2C1105.1543%2C1105.0805%2C1105.6049%2C1105.3047%2C1105.5550%2C1105.2845%2C1105.0302%2C1105.5028%2C1105.5467%2C1105.0961%2C1105.1663%2C1105.1471%2C1105.0081%2C1105.2198%2C1105.2212%2C1105.5017%2C1105.1453%2C1105.2821%2C1105.3695%2C1105.2780%2C1105.3550%2C1105.4518&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Properties of magnetic nanodots with perpendicular anisotropy"}, "summary": "Nanodots with magnetic vortices have many potential applications, such as\nmagnetic memories (VRAMs) and spin transfer nano-oscillators (STNOs). Adding a\nperpendicular anisotropy term to the magnetic energy of the nanodot it becomes\npossible to tune the vortex core properties. This can be obtained, e.g., in Co\nnanodots by varying the thickness of the Co layer in a Co/Pt stack. Here we\ndiscuss the spin configuration of circular and elliptical nanodots for\ndifferent perpendicular anisotropies; we show for nanodisks that micromagnetic\nsimulations and analytical results agree. Increasing the perpendicular\nanisotropy, the vortex core radii increase, the phase diagrams are modified and\nnew configurations appear; the knowledge of these phase diagrams is relevant\nfor the choice of optimum nanodot dimensions for applications. MFM measurements\non Co/Pt multilayers confirm the trend of the vortex core diameters with\nvarying Co layer thicknesses.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1105.5315%2C1105.2434%2C1105.3205%2C1105.1813%2C1105.0524%2C1105.5983%2C1105.2244%2C1105.0712%2C1105.2981%2C1105.1888%2C1105.4375%2C1105.1188%2C1105.0641%2C1105.3652%2C1105.3580%2C1105.3990%2C1105.0630%2C1105.2423%2C1105.4170%2C1105.3610%2C1105.4650%2C1105.1614%2C1105.4850%2C1105.3568%2C1105.0439%2C1105.3754%2C1105.3785%2C1105.3643%2C1105.2363%2C1105.4286%2C1105.1213%2C1105.3334%2C1105.2668%2C1105.1678%2C1105.1908%2C1105.2843%2C1105.6178%2C1105.4669%2C1105.5027%2C1105.3586%2C1105.5506%2C1105.1577%2C1105.3752%2C1105.0485%2C1105.4257%2C1105.1098%2C1105.0553%2C1105.0529%2C1105.5544%2C1105.4999%2C1105.3883%2C1105.4216%2C1105.2332%2C1105.2770%2C1105.0558%2C1105.4655%2C1105.1792%2C1105.2703%2C1105.3876%2C1105.3707%2C1105.4427%2C1105.5278%2C1105.1235%2C1105.1820%2C1105.2578%2C1105.4533%2C1105.5482%2C1105.2299%2C1105.1441%2C1105.4264%2C1105.2333%2C1105.3307%2C1105.3297%2C1105.6140%2C1105.2177%2C1105.1022%2C1105.3793%2C1105.0348%2C1105.3469%2C1105.1543%2C1105.0805%2C1105.6049%2C1105.3047%2C1105.5550%2C1105.2845%2C1105.0302%2C1105.5028%2C1105.5467%2C1105.0961%2C1105.1663%2C1105.1471%2C1105.0081%2C1105.2198%2C1105.2212%2C1105.5017%2C1105.1453%2C1105.2821%2C1105.3695%2C1105.2780%2C1105.3550%2C1105.4518&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Nanodots with magnetic vortices have many potential applications, such as\nmagnetic memories (VRAMs) and spin transfer nano-oscillators (STNOs). Adding a\nperpendicular anisotropy term to the magnetic energy of the nanodot it becomes\npossible to tune the vortex core properties. This can be obtained, e.g., in Co\nnanodots by varying the thickness of the Co layer in a Co/Pt stack. Here we\ndiscuss the spin configuration of circular and elliptical nanodots for\ndifferent perpendicular anisotropies; we show for nanodisks that micromagnetic\nsimulations and analytical results agree. Increasing the perpendicular\nanisotropy, the vortex core radii increase, the phase diagrams are modified and\nnew configurations appear; the knowledge of these phase diagrams is relevant\nfor the choice of optimum nanodot dimensions for applications. MFM measurements\non Co/Pt multilayers confirm the trend of the vortex core diameters with\nvarying Co layer thicknesses."}, "authors": ["E. R. P. Novais", "P. Landeros", "A. G. S. Barbosa", "M. D. Martins", "F. Garcia", "A. P. Guimarães"], "author_detail": {"name": "A. P. Guimarães"}, "author": "A. P. Guimarães", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1063/1.3631081", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1105.1813v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1105.1813v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "7 pages, 8 figures", "arxiv_primary_category": {"term": "cond-mat.mes-hall", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.mes-hall", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1105.1813v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1105.1813v1", "journal_reference": null, "doi": "10.1063/1.3631081", "fulltext": ",\n\nProperties of magnetic nanodots with perpendicular anisotropy\nE. R. P. Novais1 , P. Landeros2 , A. G. S. Barbosa3, M. D. Martins3 , F. Garcia4 , and A. P. Guimarães1\n1\n\nCentro Brasileiro de Pesquisas Fı́sicas, 22290-180, Rio de Janeiro, RJ, Brazil\nDept. de Fı́sica, Universidad Técnica Federico Santa Maria, Valparaiso, Chile\n3\nCentro de Desenvolvimento da Tecnologia Nuclear, 31270-901, Belo Horizonte, MG, Brazil and\n4\nLaboratório Nacional de Luz Sı́ncrotron, 13083-970, Campinas, SP, Brazil\n(Dated: September 19, 2018)\n\narXiv:1105.1813v1 [cond-mat.mes-hall] 9 May 2011\n\n2\n\nNanodots with magnetic vortices have many potential applications, such as magnetic memories\n(VRAMs) and spin transfer nano-oscillators (STNOs). Adding a perpendicular anisotropy term to\nthe magnetic energy of the nanodot it becomes possible to tune the vortex core properties. This\ncan be obtained, e.g., in Co nanodots by varying the thickness of the Co layer in a Co/Pt stack.\nHere we discuss the spin configuration of circular and elliptical nanodots for different perpendicular\nanisotropies; we show for nanodisks that micromagnetic simulations and analytical results agree.\nIncreasing the perpendicular anisotropy, the vortex core radii increase, the phase diagrams are\nmodified and new configurations appear; the knowledge of these phase diagrams is relevant for the\nchoice of optimum nanodot dimensions for applications. MFM measurements on Co/Pt multilayers\nconfirm the trend of the vortex core diameters with varying Co layer thicknesses.\nPACS numbers: 75.70.Kw, 07.05.Tp, 75.75.Fk, 62.23.Eg\nKeywords: Nanomagnetism, vortex, perpendicular anisotropy\n\nI.\n\nINTRODUCTION\n\nNanoscopic and mesoscopic magnetic structures have\nattracted the interest of many workers in recent years in\nview of their very interesting physical properties and for\ntheir potential applications. Quasi-twodimensional magnetic nanodots made of soft magnetic materials, such as\npermalloy, may present for their lowest energy state, several magnetic configurations: (i) quasi-uniform in-plane\nstate, (ii) quasi-uniform out-of-plane state, (iii) magnetic\nvortices or swirls1 .\nMagnetic vortices are structures where the magnetic\nmoments are tangential to concentric circles. The center\nof the vortex has a singularity (the vortex core) where\nthe magnetization points out of the plane, with a radius, in the thin dot limit2 , of the\np order of the exchange\nlength of the material lex =\n2A/μ0 Ms2 , where A is\nthe exchange stiffness constant and Ms is the saturation magnetization3,4 . With the parameters used in the\npresent work, for permalloy lex = 5.3 nm and for cobalt,\nlex = 4.93 nm.\nMagnetic vortices have been observed by many experimental techniques, such as magnetic force microscopy5,\nX-ray microscopy6 , or inferred from hysteresis curves7 ;\nthey also result from theoretical modeling8–13 .\nThe proposed applications of magnetic nanodots\ninclude their use in patterned magnetic recording\nmedia14 , as elements in magneto-resistance random\naccess memories (MRAM's)15,16 , spin transfer nanooscillators (STNO's)17–19 and nanoscopic agents for cancer treatment20 .\nThe different magnetic configurations, and consequently the large variation in the magnetic properties observed in nanodots as a function of dimensions, underline\nthe interest in the study of diagrams (phase diagrams)\n\nmapping the parameter space where a given magnetic\nbehavior is to be expected.\nExperimental studies have been used to obtain the\nphase diagram for magnetic disks: Ross et al.21 derived the phases from hysteresis curves, Chung et al.22\nfrom SEMPA measurements. Metlov and Guslienko23\nobtained a phase diagram with regions of in-plane magnetization, perpendicular magnetization and vortex structure; the equilibrium magnetic configuration obtained\nby micromagnetic simulation showed general agreement\nwith this diagram9,22 . Another simulation study, this\ntime using a scaling approach, was made for circular and\nelliptical nanodots24 . They have found in the phase diagram for ellipses a double vortex arrangement for dots\nwith semi-axis a larger than 150 nm. Their simulations\nwere made for core-free ellipses, a choice that might displace the phase boundaries by a significant 35%.\nWe have recently shown theoretically and\nexperimentally25 , that using Co/Pt multilayers it\nis possible to tailor the vortex core diameter by playing\nwith the perpendicular anisotropy originated at the\nCo-Pt interface. When one increases the perpendicular\nanisotropy acting on a magnetic nanodot, e.g., reducing the Co layer thickness, the vortex core diameter\nincreases, and eventually another vortex state appears,\nwhich is characterized by an out-of-plane magnetization\ncomponent at the dot rim. The increase in perpendicular\nanisotropy has an effect that is somehow equivalent to\na reduction in the relative importance of the in-plane\nshape anisotropy.\nThe main goal of the present work is to study how the\nphase diagram of magnetic nanodots is modified by the\npresence of perpendicular anisotropy (Kz ). However, we\nhave first obtained the phase diagram for nanodots with\nKz = 0, with circular and elliptical shapes. This has\n\n\f2\n\nII.\nA.\n\nRESULTS FOR DISKS\n\nDisks: Micromagnetic Simulations\n\nFor the simulations we used the OOMMF package (a\nfree software available from NIST32 ), using the parameters for bulk permalloy, to allow a comparison with the\nliterature (exchange stiffness constant A = 1.3 × 10−11\nJ/m, saturation magnetization Ms = 860 × 103 A/m).\nWe have neglected the in-plane anisotropy; however, we\nhave also simulated magnetic systems exhibiting a perpendicular anisotropy. An application of such simulations is the description of the behavior of the Co/Pt multilayers. To make the present results of more general use,\nthey have been given in terms of normalized parameters,\nusing the exchange length lex .\nFor some dimensions of the nanodots, the simulation\nmay converge to a configuration that does not correspond\nto the absolute energy minimum. Therefore, the simulations made with parameters near the boundary regions\nbetween different configurations had to be made by initially imposing different magnetic configurations, and after the convergence, comparing the resulting energies to\ndetermine the spin arrangement corresponding to the absolute energy minimum. The boundary lines between the\ndifferent phases were obtained from the intersection of\nthe curves of total energy for the different states26 .\nEffects of discretization are inherent in the methodology used here (see10 ). For this reason we have studied\nthe effect of the cell size (for most of our simulations\n5 × 5 × 5 nm3 ). We have found that the position of the\nboundaries of our phase diagrams change very little for\ndifferent cell sizes; these effects are even less important\nfor the configuration with perpendicular magnetization.\nThe phase diagram for magnetic nanodisks obtained\nfrom the computed energies for the different magnetization configurations and for different perpendicular\nanisotropy values (Kz ) is shown in Fig. 1. For Kz = 0 the\nphase diagram agrees with those of references8–13,21,23,24 .\n\n20\n\n3\nK = 0 kJ/m\nz\n3\nK = 100 kJ/m\nz\n3\nK = 200 kJ/m\nz\n\nex\n\n16\n\n3\nK = 360 kJ/m\nz\n\n12\n\nh/l\n\nbeen done for two main reasons, first to illustrate and\nvalidate our methodology, which will be used in sequence\nin this paper, and to verify the effect of the magnetostatic\nenergy (responsible for shape anisotropy) on the ground\nstate magnetic arrangement.\nWe have obtained phase diagrams by micromagnetic\nsimulation and analytically, and they are in agreement.\nWe have also indicated experimentally, using Magnetic\nForce Microscopy (MFM), that the vortex core diameter\nshows the same trend as predicted by the theory. The\npaper is organized as follows: in section II we discuss\nmagnetic configurations of the disks, which include IIA)\nmicromagnetic simulations, IIB) analytical description,\nIIC) experimental results. In Section III we present the\nresults for the ellipses: IIIA) micromagnetic simulations.\nIn Section IV we present a brief discussion, a summary\nof the main results with the conclusions.\n\n8\n4\n0\n\n0\n\n4\n\n8\n\n12\n\n16\n\nr/l\n\nex\n\nFIG. 1: (Color online) Phase diagrams for circular nanodots\nas a function of reduced height h/lex and reduced radius\nr/lex , drawn from the minimum energy computed with micromagnetic simulation for different values of the perpendicular anisotropy: Kz = 0, 100 × 103 J/m3 , 200 × 103 J/m3 ,\n360 × 103 J/m3 . The different magnetic configurations are\nlabeled in the inset showing the Kz = 0 phase diagram: a)\nsingle domain parallel to the plane, b) single domain perpendicular to the plane, c) vortex, d) configuration given by Fig.\n2d, and e) vortex with perpendicular component (Fig. 2e).\n\nIt shows three regions, depending on the aspect ratio of\nthe disks. The corresponding magnetic configurations are\nshown in Fig. 2. For very thin disks, for a wide range\nof disk radii, the shape anisotropy favors a quasi-uniform\nin-plane state; on the other hand, for thicker disks and\napproximately r < 4 lex , a quasi-uniform out-of-plane\nstate is observed, that is easy to understand, since in\nthis region nanodots cannot be taken as approximately\ntwodimensional disks. Finally, for r > 4 lex and h > 4 lex\nwe observe different magnetic vortex states as the ground\nstates. One should note that, in the vortex state region in\nthe graph, the magnetization shows an increasing out-ofplane component as the disk thickness increases; this can\nbe seen in Fig. 2e. Note that the vortex core diameter\nvaries along the length of the cylinder, reaching a maximum at half the height. Also, we observe the formation\nof a \"mixed\" state (e in Fig. 1), where the magnetization shows vortex domains at the dot ends, and out of\nplane magnetization near half height. An axial section of\na nanodisk with larger h (Fig. 2d) shows that the vortex\nacquires a perpendicular magnetization component.\nWhen we include a perpendicular anisotropy term,\nthe phase diagram of the disks is modified, as can be\nseen in Fig. 1. As expected, the region corresponding to magnetization perpendicular to the plane (region\nb, shown in the inset) is increased as Kz is increased,\ndisplacing to larger radii the boundary line between the\nquasi-uniform perpendicular moment state and the vortex state. Furthermore, the region for in-plane magnetization (region a) is reduced. In the case of the simulation\n\n\f3\n450\n400\n\n3\n\n(kJ/m )\nz\n\nK\n\nd\n\nb\n\n350\n300\n250\n200\n150\n\nc\n\na\n\n100\n\nAnalytical\n\n50\n0\n\nNumerical\n\n0\n\n5\n\n10\n\n15\n\n20\n\n25\n\n30\n\n35\n\n40\n\nr/l\n\nex\n\nFIG. 2: (Color online) Magnetization configurations for nanodisks: a) quasi-uniform in-plane magnetization; b) quasiuniform perpendicular magnetization; c) magnetic vortex; d)\ndisk with parameters in the region above the red continuous line (or the blue dotted line) in Fig. 3 (d=400 nm and\nanisotropy Kz = 375 × 103 J/m3 ); e) lateral view showing\nthe longitudinal section of an elongated nanodisk as found in\nthe region of the phase diagram where the vortex acquires a\nperpendicular magnetization component (see region e in Fig.\n1).\n\nwith the highest perpendicular anisotropy shown in the\nfigure (Kz = 360 × 103 J/m3 ), the in-plane magnetization region is limited to a narrow range between 7 and\n12 lex , for very thin disks. The tendency of an out-ofplane magnetization in the vortex region is not observed\nin the cases of nonzero perpendicular anisotropy. For\nhigher anisotropies another more complex configuration\nappears with an out-of-plane magnetization at the disk\nrim (region d), as observed experimentally in ref.25 .\nIncreasing the perpendicular anisotropy increases the\nvortex core radius, and eventually leads to a more complex spin structure, with the magnetization at the disk\nrim pointing down (Fig. 2d). Further increase in the perpendicular anisotropy leads to a uniform perpendicular\nmagnetization, as shown in Fig. 2b.\nThe dependence of the magnetic structure of the disks\nwith the value of the perpendicular anisotropy is exhibited in Fig. 3. Here we have fixed the thickness of the\nnanodot (10 nm) and obtained the magnetic phase diagram in the plane of perpendicular anisotropy versus\nreduced radius of the dot derived both by micromagnetic\nsimulation (red continuous line), and obtained analytically (blue dotted line). The agreement between the two\nmethods is very good.\n\nB.\n\nDisks: Analytical Method\n\nIn order to describe the configurations of magnetic\nnanodisks we have developed a simple model for the magnetic vortex state with out-of-plane magnetization at the\n\nFIG. 3: (Color online) Phase diagram for a 10 nm-thick\nmagnetic disk, as a function of the perpendicular anisotropy\nKz and reduced radius r/lex for micromagnetic simulation\n(red continuous line) and analytical computation (blue dotted\nline). The spin configurations are: a) single domain parallel to\nthe plane, b) single domain perpendicular to the plane, c) vortex, d) configuration given by Fig. 2d. The lines on the righthand side (red continuous=simulation, blue dotted=analytic)\nlimit the region above which the spin structure is given by d.\n\ndot rim. We take into account volume (Kv ) and perpendicular anisotropy (Kz ), as well as dipolar and exchange\nenergy contributions.\nThe energy of the magnetic states with in-plane (IP)\nand out-of-plane (OP) uniform magnetization can be\nwritten as10,13 :\n\nE IP =\n\nE OP =\n\nμ0 Ms2 2\nπr h[1 − Nz (r, h)]\n4\n\n(1)\n\n\u0015\n\u0014\nμ0 Ms2 2\n2(Kv − Kz )\nπr h Nz (r, h) +\n2\nμ0 Ms2\n\n(2)\n\nwhere Nz is the demagnetizing factor13 .\nNz is given by10 :\n\u0014\n\u0015\n1 1\n4r2\n8r\n− F21 − , , 2, 2\nNz = 1 +\n3πh\n2 2\nh\n\n(3)\n\nwhere J1 (x) is the first order Bessel function and\nF21 (a, b, c, x) is the hypergeometric function.\nThe vortex states can be generally described in terms\nof the magnetization Mz (ρ) = Ms mz (ρ), and it can be\nshown10 that the relevant energy terms can be written as\n\nEd = πμ0 Ms2\n\nZ\n\n0\n\n∞\n\ndq\n\n\u0012Z\n\nr\n\nρJ0 (qρ)mz (ρ)dρ\n0\n\n\u00132\n\n1 − e−qh\n\n\u0001\n\n(4)\n\n\f4\n\nEex = 2πAh\n\nZ\n\nr\n\n0\n\n\"\n\n1 − m2z (ρ)\n1\n+\n2\nρ\n1 − m2z (ρ)\n\nEK = 2πh (Kv − Kz )\n\nZ\n\n\u0012\n\n∂mz (ρ)\n∂ρ\n\n\u00132 #\n\nρdρ\n\n(5)\n\nr\n\nm2z (ρ)ρdρ\n\n(6)\n\n0\n\nwhere J0 (x) are Bessel functions. For the vortex states\nwe consider the following ansatz:\n\n\n\n(1 − ρ2 /b2 ),\n0<ρ<b\n0,\nb<ρ<r−c\nmz (ρ) =\n −g(1 − (r − ρ)2 /c2 )4 , r − c < ρ < r\n\n(7)\n\nwhere b is a parameter related to the core radius13 , c is\nrelated to the size of the out-of-plane magnetization at\nthe rim of the dot, and g (0 < g < 1) is used to describe\nthe magnetization at the rim; for an usual vortex g = 0.\nWith the above magnetization we perform a numerical\nevaluation of the total energy with minimization of the\nadjustable parameters b, c and g.\nThis theoretical description has allowed the determination of the phase diagram as a function of perpendicular\nanisotropy, as well as the boundaries of the region of the\ndiagram where the magnetic nanodisks exhibit perpendicular magnetization at the rim (Fig. 3).\nThe vortex core radius (rc ) can be defined as the value\nat which mz = 0.5, and then rc = (1 − 2−1/4 )b, where\nb is obtained by minimization of the energy. Using the\nmagnetic parameters25 for bulk Co, (the exchange length\nis lex = 4.93 nm), we obtain the core size in the presence\nof perpendicular anisotropy, as shown in Fig. 4, in good\nagreement with Fig. 1 of Garcia et al.25 .\n\nC.\n\nDisks: Experimental\n\nThe samples were produced by magnetron sputtering deposition, by means of e-beam lithography on\nSiO2 /Si(100) wafers. The samples presented the same\nlayer structure ([Coh /Pt2 ]6 /Pt6 ) and were distinguished\nby the Co layer thickness (h = 0.6, 0.8, 1.6, 2.0 nm) in\nthe stack. We have chosen these thicknesses regarding\na perpendicular to in-plane magnetic anisotropy transition observed when h is increased from 0.4 to 0.8 nm.\nEach sample contained arrays of 1 μm and 2 μm-diameter\ndisks. For better comprehension of the results, a continuous film sample was produced along with each of the\nstructured samples by placing a resist-free wafer on the\nside of the lithographed sample in the sputtering chamber. The quality of the lithography and deposition process has been verified by field emission gun scanning\nelectron microscopy, Dektak profilometry and Rutherford\nBackscattering Spectroscopy.\n\nFIG. 4: (Color online) Dependence of the magnetic vortex\ncore diameter with the perpendicular anisotropy. The black\nsquares are computed with micromagnetic simulation including Kz ; the circles (red) are experimental values obtained\nby MFM (righthand scale) of Co/Pt disks and the continuous (blue) line is obtained with the analytical model. Inset:\nMFM image of 1 μm diameter Co/Pt nanodisks showing the\nvortex cores.\n\nFIG. 5: (Color online) Magnetic configurations of elliptic nanodots that appear in the phase diagram of Fig. 6: A) in-plane\nquasi-uniform magnetization, B) out-of-plane quasi-uniform\nmagnetization, C) single vortex configuration, D) double vortex configuration.\n\nFor the MFM measurements we used an NTEGRA\nAura MFM scanning probe microscope (NT-MDT Co.)\nwith a commercial MFM tip (NSG01 type, CoCr magnetic coating, NT-MDT Co.) magnetized along the tip\naxis in the field of a permanent magnet. The MFM images were acquired in the tapping mode at room temperature. In order to avoid instrumental artifacts in the\ndetermination of vortex core size from the MFM image\nwe kept the lift height constant for all the measured samples. Although MFM is not the most suitable technique\nto determine quantitatively the vortex core diameter, we\nexpected to obtain the trend of the vortex diameter with\n\n\f5\n\nFIG. 6: (Color online) Phase diagram for elliptical nanodots\nwithout perpendicular anisotropy (Kz = 0), as a function of\nreduced height h/lex and reduced semi-axis a/lex , drawn from\nthe minimum energy computed with micromagnetic simulation. The letters correspond to regions with different spin\nconfigurations: A) in-plane quasi-uniform magnetization; B)\nperpendicular quasi-uniform magnetization; C) in-plane vortex; D) double in-plane vortex; E) lateral vortex. The ellipses\nin every case have semi-axes in the ratio a/b = 2.\n\nthe thickness of the Co layer (Fig. 4).\nWe have determined experimentally the trend toward\nincreasing vortex core diameter in the Co/Pt multilayers,\nas the perpendicular anisotropy acting on the nanodots\nis increased. The MFM measurements made on the Co\ndisks to study this effect, however, do not allow the accurate determination of the vortex core diameter. They\nonly allow the observation of this increasing trend, as\nshown in Fig. 4. In the figure, the vortex core diameters\nare plotted as a function of Co layer thickness or effective anisotropy (Kef f = Kv −Kz ); in the analytical curve\nKv = 0. Fig. 4 also shows the vortex core diameters obtained analytically and shows their agreement with the\nmicromagnetic simulation results.\n\nIII.\nA.\n\nRESULTS FOR ELLIPSES\n\nEllipses: Micromagnetic Simulations\n\nFollowing the same methodology, we have also obtained the phase diagram of elliptical nanodots with\nKz = 0; we have simulated ellipses where the major semiaxis (a) is twice the minor one (b), i.e., the ellipses in\nevery case have a/b = 2. As we can see from Fig. 6, in\nthis case the diagram is richer than that of the disks. The\nfirst observation is that the vortex state only occurs for\ndimensions that are larger than in the case of the disks,\ni.e., for approximately a > 10 lex . This is so because\nthe eccentricity introduces an uniaxial shape anisotropy\n\nFIG. 7: Phase diagram for elliptical dots with thickness\nh = 50 nm: diagram of perpendicular anisotropy Kz versus reduced major semi-axis a/lex . The letters correspond to\nregions with different spin configurations: B) perpendicular\nquasi-uniform magnetization, C) in-plane vortex, E) lateral\nvortex, F) modified in-plane vortex, and G) double lateral\nvortex (see Fig. 8).\n\nalong the major axis, which favors a quasi-uniform inplane magnetization. Another state observed is the region in the figure which corresponds to one lateral vortex,\nthat also appears in some simulations for cylinders27 ; to\nthe best of our knowledge, this had not been observed for\nellipses. A very interesting phase of this diagram occurs\nfor a > 240 lex and h > 8 lex , where two vortices appear.\nThis configuration has been observed experimentally by\nseveral authors e.g.,28–31 .\nThe phase diagram for the elliptic nanodots is also\nmodified by the presence of perpendicular anisotropy. Its\neffect is illustrated in Fig. 7, which shows the phase diagram for the spin configurations obtained by micromagnetic simulation for ellipses with thickness of 50 nm, as a\nfunction of the major semi-axis a, for different values of\nthe perpendicular anisotropy. This diagram is more complex than that obtained for the disks with perpendicular\nanisotropy (Fig. 3). The letters in Figs. 6 and 7 correspond to the spin configurations: A) in-plane magnetization (Fig. 5A), B) perpendicular magnetization (Fig.\n5B), C) in-plane vortex (Fig. 5C), D) double in-plane\nvortex (Fig. 5D), E, F, G) types of lateral vortices (Fig.\n8). Some lateral vortex configurations also shown in the\nelliptic nanodot cross section are illustrated in Fig. 8.\nThey are: E) \"two-domain\" out-of-plane structure with\none lateral vortex, F) modified in-plane vortex and G)\n\"three-domain\" out-of-plane structure with two lateral\nvortices of opposite polarization. The lateral vortices in\nE and G occur between two domains. Note that the\ncontrast color of the top view of the ellipses is in the z\naxis (perpendicular to the plane) and the cross section\nis shown with contrast in the y axis, to make the vortex structures more visible; note also that although the\n\n\f6\nchange their shape, for example, from circular to elliptical, or to vary their dimensions. In this work we have\nexplored a different way of accomplishing this: the introduction of a perpendicular anisotropy term. We have\nobserved that this leads to important modifications in\nthe phase diagrams for these nanostructures, as demonstrated through results obtained by micromagnetic simulation and analytical formulation. MFM measurements\nconfirmed the trend of increasing vortex core diameter\nwith increasing perpendicular anisotropy.\nIn this work we have studied the different magnetic\nconfigurations of circular and elliptical nanodots, presenting them using h × r phase diagrams obtained using\nmicromagnetic simulation. In the case of circular nanodots, a phase diagram was also obtained using an analytical method; it agrees with the micromagnetic simulation. Measurements using the MFM technique show the\nsame qualitative behavior in the dependence of the vortex\ncore diameter with perpendicular magnetic anisotropy.\nThe phase diagrams are also drawn for nanodots presenting a perpendicular anisotropy term, and exhibit important differences from the Kz = 0 case: the region of the\ndiagram corresponding to a magnetization perpendicular to the plane increases, the region of M parallel to the\nplane is reduced, and more complex spin arrangements\nappear.\nThe results presented here on the elliptical nanodots\nreveal the complexity of their magnetic behavior. In the\nrange of ellipse sizes studied, several configurations appear: in-plane and out-of-plane quasi-uniform states, one\nand two-vortex states, as well as configurations with lateral vortices. The latter structures obtained with the\nperpendicular anisotropy term are more complex and had\nnot been investigated before; their detailed properties remain to be studied.\n\nFIG. 8: (Color online) Magnetic configurations of elliptic nanodots, showing the plane of the dots and the cross sections\nwith lateral vortices: E) \"two-domain\" configuration with single lateral vortex; F) modified in-plane vortex and G) \"three\ndomain\" configuration with two lateral vortices of opposite\npolarization. Configuration E occurs in the phase diagram\nfor Kz = 0 (Fig. 6), and configurations F and G appear\nin the phase diagram with perpendicular anisotropy, on the\nplane Kz × a.\n\nellipses in Fig. 8 are shown with the same size, they\ncorrespond to different semi-axes and anisotropies in the\nphase diagram of Fig. 7.\nIV.\n\nCONCLUSIONS\n\nThere are several ways of playing with the magnetic\nconfigurations of nanodots; the most obvious ones are to\n\nInvestigations that allow the mapping of these different magnetic configurations are useful in designing experiments to study the basic properties of these novel\nmagnetic structures, or tailoring them for technological\napplications, such as magnetic random access memories.\n\nAcknowledgments\n\nThe authors would like to acknowledge the support\nof the Brazilian agencies CAPES, CNPq, FAPERJ and\nFAPEMIG. This work was partially funded by FONDECYT 11080246 and the program \"Financiamiento Basal\npara Centros Cientı́ficos y Tecnológicos de Excelencia\"\nCEDENNA FB0807, Chile.\n\n\f7\n\n1\n\n2\n\n3\n\n4\n\n5\n\n6\n\n7\n\n8\n\n9\n\n10\n\n11\n\n12\n\n13\n\n14\n\n15\n\n16\n\n17\n\nA. P. Guimarães, Principles of Nanomagnetism (Springer,\nBerlin, 2009).\nA. Hubert and R. Schäfer, Magnetic Domains. The Analysis of Magnetic Microstructures (Springer, Berlin, 1999).\nC. L. Chien, F. Q. Zhu, and J.-G. Zhu, Physics Today 60,\n40 (2007).\nK. Y. Guslienko, K.-S. Lee, and S.-K. Kim, Phys. Rev.\nLett. 100, 027203 (2008).\nT. Shinjo, T. Okuno, R. Hassdorf, K. Shigeto, and T. Ono,\nScience 289, 930 (2000).\nS.-B. Choe, Y. Acremann, A. Scholl, A. Bauer, A. Doran,\nJ. Stohr, and H. A. Padmore, Science 304, 420 (2004).\nR. P. Cowburn, D. K. Koltsov, A. O. Adeyeye, M. E.\nWelland, and D. M. Tricker, Phys. Rev. Lett. 83, 1042\n(1999).\nJ. d'Albuquerque e Castro, D. Altbir, J. C. Retamal, and\nP. Vargas, Phys. Rev. Lett. 88, 237202 (2002).\nW. Scholz, K. Guslienko, V. Novosad, D. Suess, T. Schrefl,\nR. Chantrell, and J. Fidler, J. Magn. Magn. Mat. 266, 155\n(2003).\nP.-O. Jubert and R. Allenspach, Phys. Rev. B 70, 144402\n(2004).\nP. Landeros, J. Escrig, D. Altbir, D. Laroze,\nJ. d'Albuquerque e Castro,\nand P. Vargas, Phys.\nRev. B 71, 094435 (2005).\nV. P. Kravchuk, D. D. Sheka, and Y. B. Gaididei, J. Magn.\nMagn. Mat. 310, 116 (2007).\nP. Landeros, J. Escrig, and D. Altbir, in Electromagnetic,\nMagnetostatic, and Exchange-Interaction Vortices in Confined Magnetic Structures, edited by E. O. Kamenetskii\n(Research Signpost, Kerala, 2008).\nT. Thomson, L. Abelman, and H. Groenland, in Magnetic\nNanostructures in Modern Technology, edited by B. Azzerboni, G. Asti, L. Pareti, and M. Ghidini (Springer, Dordrecht, 2008) pp. 237–306.\nS. Kim, K. Lee, Y. Yu, and Y. Choi, Appl. Phys. Lett.\n92, 022509 (2008).\nS. Bohlens, B. Krüger, A. Drews, M. Bolte, G. Meier, and\nD. Pfannkuche, Appl. Phys. Lett. 93, 142508 (2008).\nR. Lehndorff, D. E. Bürgler, S. Gliga, R. Hertel,\nP. Grünberg, C. M. Schneider, and Z. Celinski, Phys. Rev.\n\n18\n\n19\n\n20\n\n21\n\n22\n\n23\n\n24\n\n25\n\n26\n\n27\n\n28\n\n29\n\n30\n\n31\n\n32\n\nB 80, 054412 (2009).\nD. Houssameddine, U. Ebels, B. Delaet, B. Rodmacq,\nI. Firastrau, F. Ponthenier, M. Brunet, C. Thirion, J.-P.\nMichel, L. Prejbeanu-Buda, M.-C. Cyrille, O. Redon, and\nB. Dieny, Nature Mater. 6, 447 (2007).\nD. V. Berkov and N. L. Gorn, Phys. Rev. B 80, 064409\n(2009).\nD.-H. Kim, E. A. Rozhkova, I. V. Ulasov, S. D. Bader,\nT. Rajh, M. S. Lesniak, and V. Novosad, Nature Mater.\n9, 165 (2010).\nC. A. Ross, M. Hwang, M. Shima, J. Y. Cheng,\nM. Farhoud, T. A. Savas, H. I. Smith, W. Schwarzacher,\nF. M. Ross, M. Redjdal, and F. B. Humphrey, Phys. Rev.\nB 65, 144417 (2002).\nS.-H. Chung, R. D. McMichael, D. T. Pierce, and J. Unguris, Phys. Rev. B 81, 024410 (2010).\nK. L. Metlov and K. Y. Guslienko, J. Magn. Magn. Mat.\n242-245, 1015 (2002).\nW. Zhang, R. Singh, N. Bray-Ali, and S. Haas, Phys. Rev.\nB 77, 144428 (2008).\nF. Garcia, H. Westfahl, J. Schoenmaker, E. J. Carvalho,\nA. D. Santos, M. Pojar, A. C. Seabra, R. Belkhou, A. Bendounan, E. R. P. Novais, and A. P. Guimarães, Appl. Phys.\nLett. 97, 022501 (2010).\nE. R. P. Novais and A. P. Guimarães, arXiv:0909.5686v1\n(2009).\nJ. K. Ha, R. Hertel, and J. Kirschner, Phys. Rev. B 67,\n224432 (2003).\nM. Schneider, J. Liszkowski, M. Rahm, W. Wegscheider,\nD. Weiss, H. Hoffmann, and J. Zweck, J. Phys. D: Appl.\nPhys. 36, 2239 (2003).\nK. S. Buchanan, P. E. Roy, M. Grimsditch, F. Y. Fradin,\nK. Y. Guslienko, S. D. Bader, and V. Novosad, Nature\nPhys. 1, 172 (2005).\nP. Vavassori, N. Zaluzec, V. Metlushko, V. Novosad,\nB. Ilic, and M. Grimsditch, Phys. Rev. B 69.\nT. Okuno, K. Mibu, and T. Shinjo, J. Appl. Phys. 95,\n3612 (2004).\nAvailable from http://math.nist.gov/oommf/\n\n\f"}