{"id": "http://arxiv.org/abs/1012.2264v2", "guidislink": true, "updated": "2011-02-17T06:48:23Z", "updated_parsed": [2011, 2, 17, 6, 48, 23, 3, 48, 0], "published": "2010-12-10T13:48:07Z", "published_parsed": [2010, 12, 10, 13, 48, 7, 4, 344, 0], "title": "Accessing photon bunching with photon number resolving multi-pixel\n  detector", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1012.3258%2C1012.4344%2C1012.1515%2C1012.4010%2C1012.0066%2C1012.0245%2C1012.5240%2C1012.0342%2C1012.0217%2C1012.0308%2C1012.3356%2C1012.5472%2C1012.3774%2C1012.4967%2C1012.5111%2C1012.2138%2C1012.3701%2C1012.2640%2C1012.0594%2C1012.1593%2C1012.4829%2C1012.4061%2C1012.0047%2C1012.5326%2C1012.1468%2C1012.4241%2C1012.5633%2C1012.5843%2C1012.2242%2C1012.0319%2C1012.2264%2C1012.1151%2C1012.3575%2C1012.5860%2C1012.1105%2C1012.5133%2C1012.4528%2C1012.0784%2C1012.3611%2C1012.5792%2C1012.1380%2C1012.4917%2C1012.2096%2C1012.0388%2C1012.4979%2C1012.3730%2C1012.2174%2C1012.6044%2C1012.1153%2C1012.2045%2C1012.3326%2C1012.1503%2C1012.1770%2C1012.2591%2C1012.4936%2C1012.1808%2C1012.3761%2C1012.2884%2C1012.5385%2C1012.4153%2C1012.4148%2C1012.4041%2C1012.2990%2C1012.2905%2C1012.5670%2C1012.2214%2C1012.3702%2C1012.0480%2C1012.5736%2C1012.3749%2C1012.3925%2C1012.3237%2C1012.4734%2C1012.2463%2C1012.2760%2C1012.3304%2C1012.2842%2C1012.3022%2C1012.5978%2C1012.3505%2C1012.0827%2C1012.0465%2C1012.2651%2C1012.1071%2C1012.5904%2C1012.4633%2C1012.5193%2C1012.5573%2C1012.0458%2C1012.0698%2C1012.4914%2C1012.5776%2C1012.4959%2C1012.2514%2C1012.2573%2C1012.1787%2C1012.2473%2C1012.2959%2C1012.4710%2C1012.5192%2C1012.5440&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Accessing photon bunching with photon number resolving multi-pixel\n  detector"}, "summary": "In quantum optics and its applications, there is an urgent demand for\nphoton-number resolving detectors. Recently, there appeared multi-pixel\ndetectors (MPPC) that are able to distinguish between 1,2,..10 photons. At the\nsame time, strong coupling between different pixels (cross-talk) hinders their\nphoton-number resolution. In this work, we suggest a method for `filtering out'\nthe cross-talk effect in the measurement of intensity correlation functions.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1012.3258%2C1012.4344%2C1012.1515%2C1012.4010%2C1012.0066%2C1012.0245%2C1012.5240%2C1012.0342%2C1012.0217%2C1012.0308%2C1012.3356%2C1012.5472%2C1012.3774%2C1012.4967%2C1012.5111%2C1012.2138%2C1012.3701%2C1012.2640%2C1012.0594%2C1012.1593%2C1012.4829%2C1012.4061%2C1012.0047%2C1012.5326%2C1012.1468%2C1012.4241%2C1012.5633%2C1012.5843%2C1012.2242%2C1012.0319%2C1012.2264%2C1012.1151%2C1012.3575%2C1012.5860%2C1012.1105%2C1012.5133%2C1012.4528%2C1012.0784%2C1012.3611%2C1012.5792%2C1012.1380%2C1012.4917%2C1012.2096%2C1012.0388%2C1012.4979%2C1012.3730%2C1012.2174%2C1012.6044%2C1012.1153%2C1012.2045%2C1012.3326%2C1012.1503%2C1012.1770%2C1012.2591%2C1012.4936%2C1012.1808%2C1012.3761%2C1012.2884%2C1012.5385%2C1012.4153%2C1012.4148%2C1012.4041%2C1012.2990%2C1012.2905%2C1012.5670%2C1012.2214%2C1012.3702%2C1012.0480%2C1012.5736%2C1012.3749%2C1012.3925%2C1012.3237%2C1012.4734%2C1012.2463%2C1012.2760%2C1012.3304%2C1012.2842%2C1012.3022%2C1012.5978%2C1012.3505%2C1012.0827%2C1012.0465%2C1012.2651%2C1012.1071%2C1012.5904%2C1012.4633%2C1012.5193%2C1012.5573%2C1012.0458%2C1012.0698%2C1012.4914%2C1012.5776%2C1012.4959%2C1012.2514%2C1012.2573%2C1012.1787%2C1012.2473%2C1012.2959%2C1012.4710%2C1012.5192%2C1012.5440&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "In quantum optics and its applications, there is an urgent demand for\nphoton-number resolving detectors. Recently, there appeared multi-pixel\ndetectors (MPPC) that are able to distinguish between 1,2,..10 photons. At the\nsame time, strong coupling between different pixels (cross-talk) hinders their\nphoton-number resolution. In this work, we suggest a method for `filtering out'\nthe cross-talk effect in the measurement of intensity correlation functions."}, "authors": ["Dmitry A. Kalashnikov", "Si-Hui Tan", "Maria V. Chekhova", "Leonid A. Krivitsky"], "author_detail": {"name": "Leonid A. Krivitsky"}, "author": "Leonid A. Krivitsky", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1364/OE.19.009352", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1012.2264v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1012.2264v2", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "Reconsidered theoretical description, added recent experimental data,\n  submitted for publication", "arxiv_primary_category": {"term": "quant-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "quant-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1012.2264v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1012.2264v2", "journal_reference": "OPTICS EXPRESS Vol. 19, No. 10, 9352-9363 (2011)", "doi": "10.1364/OE.19.009352", "fulltext": "Accessing photon bunching with photon number\nresolving multi-pixel detector\nDmitry A. Kalashnikov1, Si Hui Tan1, Maria V. Chekhova2,3,\nand Leonid A. Krivitsky1,*\n1\n\nData Storage Institute, Agency for Science Technology and Research, 117608 Singapore\n2\nMax-Planck Institute for the Science of Light, 91058 Erlangen, Germany\n3\nM. V. Lomonosov Moscow State University, 119991 Moscow, Russia\n\nAbstract: In quantum optics and its applications, there is an urgent demand\nfor photon-number resolving detectors. Recently, there appeared multi-pixel\ncounters (MPPC) that are able to distinguish between 1,2,..10 photons. At\nthe same time, strong coupling between different pixels (cross-talk) hinders\ntheir photon-number resolution. In this work, we suggest a method for\n`filtering out' the cross-talk effect in the measurement of intensity\ncorrelation functions. The developed approach can be expanded to the\nanalysis of higher-order intensity correlations by using just a single MPPC.\n2010 Optical Society of America\nOCIS codes: (270.0270) Quantum optics; (270.5570) Quantum detectors; 040.1345 Avalanche\nphotodiodes (APDs); 270.5290 Photon statistics\n\nReferences and links\n1.\n2.\n3.\n4.\n5.\n6.\n7.\n8.\n9.\n10.\n11.\n12.\n\n13.\n14.\n15.\n16.\n17.\n\nKnill, E., Laflamme, R., Milburn, G.J., \"A scheme for efficient quantum computation with linear optics,\"\nNature 409, 46–52 (2001).\nKok, P., Munro, W.J., Nemoto, K., Ralph, T.C., Dowling, J.P., Milburn, G.J., \"Linear optical quantum\ncomputing with photonic qubits,\" Rev. Mod. Phys. 79, 135–175 (2007).\nO'Brien, J. L., \"Optical quantum computing,\" Science 318, 1567–1570 (2007).\nWalther P., Pan J.-W., Aspelmeyer M., Ursin R., Gasparoni S., Zeilinger A., \"De Broglie wavelength of a\nnon-local four-photon state,\" Nature, 429, 158-161 (2004).\nMitchell M.W., Lundeen J.S., Steinberg A.M., \"Super-resolving phase measurements with a multiphoton\nentangled state,\" Nature, 429, 161-164 (2004).\nB. Lounis, M. Orrit, \"Single-photon sources,\" Rep. Prog. Phys., 68, 1129–1179 (2005).\nCova, S., Longoni, A., Andreoni, A., \"Towards picoseconds resolution with single-photon avalanche\ndiodes,\" Rev. Sci. Inst. 52, 408–412 (1981).\nR. H. Hadfield, \"Single-photon detectors for optical quantum information applications\" Nature Photonics,\n3, 696-705, (2009).\nTakeuchi, S., Kim, J., Yamamoto, Y., Hogue H. H., \"Development of a high quantum-efficiency singlephoton counting system,\" Appl. Phys. Lett. 74, 1063–1065 (1999).\nKim, J., Takeuchi, S., Yamamoto, Y., Hogue, H. H., \"Multiphoton detection using visible light photon\ncounter,\" Appl. Phys. Lett. 74, 902–904 (1999).\nWaks, E., Inoue, K., Diamanti, E., Yamamoto, Y., \"High-efficiency photon-number detection for quantum\ninformation processing,\" IEEE J. Sel. Top. Quant. 9, 1502–1511 (2003).\nB. Cabrera, R. M. Clarke, P. Colling, A. J. Miller, S. Nam, R. W. Romani, \"Detection of single infrared,\noptical, and ultraviolet photons using superconducting transition edge sensors,\" Appl. Phys. Lett. 73, 735\n(1998).\nD. Rosemberg, A.E.Lita, A.J. Miller, S.W. Nam, \"Noise-free high-efficiency photon-number-resolving\ndetectors,\" Phys Rev A, 71, 061803R (2005).\nA.E. Lita, A.J. Miller, S.W. Nam, \"Counting near-infrared single- photons with 95% efficiency,\" Optics\nExpress, 16, 3032-3040 (2008).\nM. Bondani, A. Allevi, A. Agliati, A. Andreoni, \"Self-consistent characterization of light statistics,\"\nJ. Mod. Opt, 56, 226 - 231, (2009).\nB. E. Kardynal, Z. L. Yuan A. J. Shields, \"An avalanche-photodiode-based photon-number-resolving\ndetector,\" Nature photonics, 2, 425-428 (2008).\nAchilles, D., Silberhorn, C., Sliwa, C., Banaszek, K. & Walmsley, I. A., \"Fiber assisted detection with\nphoton-number resolution,\" Opt. Lett. 28, 2387–2389 (2003).\n\n\f18. M. J. Fitch, B. C. Jacobs, T. B. Pittman, J. D. Franson, \"Photon-number resolution using time-multiplexed\nsingle-photon detectors,\" Phys. Rev. A 68, 043814 (2003).\n19. M. Mičuda, O. Haderka, M. Ježek, \"High-efficiency photon-number-resolving multichannel detector,\" Phys\nRev A 78, 025804 (2008).\n20. Hamamatsu web-page http://jp.hamamatsu.com/.\n21. K. Yamamoto, K. Yamamura, K. Sato, S. Kamakura, T. Ota, H. Suzuki, S. Ohsuka, \"Development of\nMulti-Pixel Photon Counter (MPPC),\" Nuclear Science Symposium Conference Record, 2007. NSS '07.\nIEEE 2, 1511-1515 (2007).\n22. Eraerds, P., Legré, M., Rochas, A., Zbinden, H., Gisin, N., \"SiPM for fast photon-counting and multiphoton\ndetection,\" Opt. Express 15, 14539–14549 (2007).\n23. I. Afek, A. Natan, O. Ambar, Y. Silberberg, \"Quantum state measurements using multipixel photon\ndetectors,\" Phys. Rev. A 79, 043830 (2009).\n24. Rech, I., Ingargiola, A., Spinelli, R., Labanca, I., Marangoni, S., Ghioni, M., Cova, S., \"Optical crosstalk in\nsingle photon avalanche diode arrays: a new complete model,\" Opt. Express 16, 8381–8394 (2008).\n25. M. Ramilli, A. Allevi, V. Chmill, M. Bondani, M. Caccia , A. Andreoni, \"Photon-number statistics with\nsilicon photomultipliers,\" JOSA B, 27, 852-862 (2010).\n26. David N. Klyshko, \"Photons and Nonlinear Optics,\" (Gordon and Breach, New York, 1988).\n27. M. Avenhaus, K. Laiho, M.V. Chekhova, C. Silberhorn, \"Accessing Higher Order Correlations in Quantum\nOptical States by Time Multiplexing,\" Phys. Rev. Lett. 104, 063602 (2010).\n28. O. Haderka, J. Perina, Jr., M. Hamar, J. Perina, \"Direct measurement and reconstruction of nonclassical\nfeatures of twin beams generated in spontaneous parametric down-conversion, \" Phys Rev A 71, 033815\n(2005).\n29. J.-L. Blanchet, F. Devaux, L. Furfaro, E. Lantz, \"Measurement of Sub-Shot-Noise Correlations of Spatial\nFluctuations in the Photon-Counting Regime,\" Phys. Rev. Lett. 101, 233604 (2008).\n30. H. Otono, S. Yamashita, T. Yoshioka, H. Oide, T. Suehiro, H. Hano, \"Study of MPPC at liquid nitrogen\ntemperature,\" Proceedings of International Workshop on New Photon-Detectors PD07 007 (2007).\n31. Akiba, M., Tsujino, K., Sato, K., Sasaki, M., \"Multipixel silicon avalanche photodiode with ultralow dark\ncount rate at liquid nitrogen temperature,\" Opt. Express, 17, 16885-16897 (2009).\n32. R.D. Younger, K.A. McIntosh, J.W. Chludzinski, D.C. Oakley, L.J. Mahoney, J.E. Funk, J.P. Donnelly, S.\nVerghese, \"Crosstalk Analsis of Integrated Geiger-mode Avalanche Photodiode Focal Plane Array,\" Proc.\nof SPIE Vol.7320, 73200Q-12 (2009).\n\n1. Introduction\nIn modern quantum optics there is a considerable interest in multiphoton quantum states, as\nthey are believed to be beneficial in several practical and fundamental tasks. In particular, in\nlinear optics quantum computing (LOQC), exploiting multiphoton states would enable a step\nfrom two-qubit to multiphoton gates, thereby increasing the performance and flexibility of\nLOQC protocols [1-3]. A special class of multiphoton entangled states, referred to as NOONstates, is believed to find broad applications ranging from the studies of the foundations of\nquantum mechanics to quantum lithography beyond the diffraction limit [4,5]. Moreover,\naccurate estimation of the multiphoton component is of crucial importance in the security\nanalysis of single-photon quantum key distribution protocols.\nAny practical implementation of multiphoton states would require solving two basic\nproblems, namely (a) efficient generation of such states and (b) their accurate\ncharacterization. The first goal is achieved by using high-power lasers in various nonlinear\noptical processes, where the interaction strength can be significantly enhanced by utilizing\ntailored nonlinear media (e.g. periodically poled crystals or nonlinear optical waveguides),\npossibly in conjunction with optical cavities [6]; the second goal, however, represents a\nconsiderable difficulty due to the existing limitation in the response of single-photon\ndetectors. Indeed, a conventional avalanche photodiode (APD), operating in the Geiger mode,\ndiscriminates only between \"zero photons\" and \"one photon or more\" without further photonnumber resolution [7]. The urgent requirement to access photon statistics of faint light pulses\nmotivates the investment of considerable efforts in the engineering of photon-number\nresolving detectors (PNRD) – a class of devices where the produced outcome depends on the\nnumber of simultaneously impinging photons.\n\n\fUp to date, several technologies have been suggested to realize PNRD [8]. First, we\nmention a family of cryogenic devices such as visible-light photon counters (VLPC) and\ntransition edge sensors (TES) [9-14]. These devices have moderate photon number resolution,\nlow noise, and high quantum efficiency. However, the main limitation of such technology is\nthe requirement of cryogenic cooling (down to 0.1K for TES and 6K for VLPC), which\ndemands for highly skilled operation. An alternative approach for the implementation of\nPNRD, which does not involve cryogenic cooling, is based on various modifications of widely\naccessible photomultiplier tubes (PMT) and avalanche photodiodes (APD). A dedicated class\nof hybrid PMT detectors demonstrates discrimination of up to 3 photons [15]. A resolution up\nto 5 photons was demonstrated with a single InGAs detector by careful characterization of the\nearly stage of the avalanche [16]. Other alternatives rely on joint measurements by\nindependent APDs, when an incoming pulse is split into different spatial or temporal modes\nby a chain of beam splitters [17-19]. Though a remarkable resolution of up to 9 photons was\ndemonstrated with the temporal binning, future expansion of such schemes is negatively\naffected by the necessity to use more beamsplitters and photodetectors.\nRecently, a compact and cost-efficient solution for PNRD became commercially available\nwith the introduction of a Multi Pixel Photon Counter (MPPC) [20]. In MPPC several hundred\nof APDs, referred to as pixels, are embedded in a single chip of several millimeter size with\ntheir outputs connected into a summation circuit. The chip is illuminated by a spatially\ndiffused light spot (e.g. originating from the fiber), providing that the chance of two photons\nto hit the same pixel is negligible. The amplitude of MPPC output is proportional to the\nnumber of firing pixels, which, in an ideal case, is equivalent to the number of registered\nincident photons. Thus, the concept of MPPC resembles the traditional approach of separating\nan incoming pulse into multiple spatial modes, providing, however, a striking advantage in\ncompactness and photon-number resolution.\nThe MPPC operation was theoretically modeled and experimentally tested in recent works\non the reconstruction of photon statistics of thermal and coherent fields [21-25]. Despite the\nsignificant benefits outlined above, limitations of MPPC technology have been noted, which\nhinder its wide applications in quantum optics environment. The most crucial and very unique\nimperfection of MPPC is the crosstalk between pixels [24]. The crosstalk appears due to poor\noptical isolation of pixels; as a result, a photon impinging on a given pixel not only triggers an\navalanche but also creates a photon, which, in turn, can trigger a simultaneous \"fake\"\navalanche in a neighboring pixel. Since \"fake\" avalanches cannot be distinguished from the\n\"true\" ones, the accurate reconstruction of photon statistics becomes quite complicated.\nThe influence of the crosstalk is especially evident when one deals with weak states of\nlight with the average number of photons less than one. In this case, some single-photon\ndetection events would be accompanied by \"fake\" avalanches, thereby imposing additional\nphoton correlations to the original statistics. From a practical aspect it is of interest to analyze\ntwo interconnected matters: (a) how do \"fake\" photon correlations behave for a weak state\nand (b) whether an existing MPPC allows one to distinguish \"true\" photon bunching, for\ninstance, in the case of squeezed vacuum.\nIn the present paper we estimate the potential of the MPPC in the accurate measurements\nof non-classical photon correlations. We develop a method of inferring the second-order\n(2)\n\ncorrelation function ( g ) from MPPC data based on a model of MPPC crosstalk. In order to\ncheck the consistency of the method, the experimental results, obtained by MPPC, are\ncompared with the results of a traditional Hanbury Brown and Twiss (HBT) experiment. The\nway of expanding the present analytical formula for the measurement of higher-order intensity\ncorrelation functions is also presented. To the best of our knowledge, this is the first attempt\nto use MPPC in the study of non-classical light states.\n2. Theory\n\n\fCharacterization of various states of light in quantum optics is conveniently performed in\nterms of normalized Glauber's correlation functions (CFs). The l-th order CF at zero time\ndelay is defined as\n\ng\n\n(l )\n\n\n\na l a l\naa\n\nl\n\n,\n\n(1)\n\n\n\nwhere a , a are photon creation and annihilation operators, respectively. In this paper we\nfocus on the analysis of the second-order CF, l  2 .\nAs an example, consider normalized Glauber's CFs for two types of states, coherent one\nand squeezed vacuum one. Two-mode squeezed vacuum state can be produced via\nnondegenerate parametric down conversion (PDC) in a nonlinear medium. In this case the\njoint state vector is a superposition of Fock-state products with the same photon numbers for\nsignal (s) and idler (i) beams [26],\n\n s ,i  n 0 Cn n s n\n\n\n(2a)\n\ni\n\nIn the case of degenerate PDC, the signal and idler photons are indistinguishable, and the state\nproduced is single-mode squeezed vacuum, with the state vector given by a superposition of\neven-number Fock states,\n\n  n  0 C2n 2n\n\n\n(2b)\n\nThe index n does not have to be the photon number for single modes, but may relate to the\nensembles of many modes, accessed via multimode detection [26]. In this case, the probability\namplitudes obey the Poissonian distribution, Cn \n\ne\n\n n\n\nn\n\nn / n! , and n is the mean\n\nphoton number for the whole ensemble (supermode).\nThe state vector of a coherent state is\n\n c  n  0 C ncoh n\n\n\n(3)\n\nUsing Eqs.(1)-(3), one can show that for the case of multimode detection, the measured CF is\n\ng ( 2)  A  B / n for the squeezed vacuum state, given by Eqs.(2a,b), where A  1 and\nB is the inverse number of detected frequency and spatial modes, while g ( 2 )  1 for the\n( 2)\ncoherent state, given by Eq.(3). The dependence of g on the mean photon number for\nsqueezed vacuum is a very typical feature, an indication of pairwise correlations. The\n( 2)\n\nsignificant advantage of g\nmeasurement over a direct reconstruction of photon-number\ndistribution is that it is insensitive to optical losses and finite efficiencies of the detectors,\nwhich may not be always precisely known and controlled in an experiment [27]. This makes\n\ng ( 2 ) measurements highly relevant in the study of single-photon sources, low-gain PDC and\nother applications.\n( 2)\n\nLet us now derive an algorithm for obtaining g\nfrom MPPC data. According to\ndefinition, see Eq.(1), for a given output of MPPC, one should define an equivalent number of\ndouble coincidences (numerator) and the squared total number of detected photons\n\n\f(denominator). Under faint light pulses impinging on MPPC, it produces outputs of discrete\namplitudes, equal to kA0 , where k is the number of pixels having fired ( k  1,2,3... ) and\n\nA0 is the amplitude of a standard pulse produced by an individual pixel. By recording results\nof repetitive measurements during the acquisition time, one obtains a histogram of MPPC\ncounts N1 , N 2 ...N k , where N k is the number of detected pulses with amplitudes equal to\n\nkA0 . The total number of registered photons is then N (1)  k 1 k Nk , and if the number\n\n\nof pixels is m , the average number of photons hitting a single pixel is n  N / m . Each\npair of pixels represents a single HBT interferometer, the number of such interferometers can\n(1)\n\n(1)\n\nm\n\nm\n\nbe estimated as    m ( m  1) / 2 , where   is the number of 2-combinations in m\n2\n2\n(the binomial coefficient). The total number of pairwise coincidences is\n k \nN ( 2 )  k  2   N k , and thus the number of pairwise coincidences per single HBT\n 2\n k \n(2)\n(2)\n2\ninterferometer for large m is n  2 N / m( m  1)  2k  2   N k / m\nThe\n2\n \n\nresulting g\n\n( 2)\n\ncan be calculated as1\n\ng (2)  2\n\n\n\nk \nNk\nk 2  \n 2\n\n\n\n\n\n\nk 1\n\nkN k\n\n\n\n2\n\n(4a)\n\n.\n\nNote that a similar algorithm can be used for the measurement of higher-order correlation\nfunctions given by Eq.(1):\n\ng (l ) \n\nml\nm\n \nl\n\n\n\nk \nNk\nk l  \nl\n\n\n\n\n\n\nk 1\n\nkN k\n\n\n\nl\n\n(4b)\n\nMoreover, any spatially resolving single-photon detector can be used for these measurements,\nsuch as, single-photon sensitive charge coupling devices (EMCCD, ICCD) [28,29].\nLet us now consider a realistic model of MPPC [23]. Since photon bunching of PDC is\nonly pronounced at low photon numbers, we limit our approach by considering a simple linear\nmodel. A typical example of the histogram of MPPC outcomes along with the dark noise\ncontribution is shown in Fig.1.\nIn order to account for the MPPC dark noise we estimated the probability of a dark noise\nevent and a real photocount to appear simultaneously. It was found that the contribution of\n1\n\nNote that Eq.(4) is independent of the detector quantum efficiency. To see this, one has to note that k is just a\ndummy variable for summing in Eq.(4). Hence, the effect of loss, which is to replace k with k' =k/η , where η is the\nquantum efficiency, will not affect the value of g(2).\n\n\fsuch a cross-term was almost negligible. Let the subscript \"DN\" denote quantities where the\neffect of the dark noise has been taken into account. We have\n\nN k , DN  N k  nk ,\nwhere nk is the number of occurrences of a k -photon event from the dark noise only, which\ncan be measured independently.\nNext, let us consider the effect of the crosstalk. In this case a k -photon event would\ncontain a contribution from the lower photon number events with the addition from the\ncrosstalk. Given the photon number distribution in Fig.1 and the crosstalk probability of about\n7-15%, the gains and losses of more than one photon due to the crosstalk are ignored in the\npresent model. Note that the dark noise is also affected by the crosstalk which in some cases\npredominates the generation of multiphoton dark noise events.\n\nArea of detail\n\nFig.1 (Color online). An experimental histogram of the MMPC output for the signal mode of\nPDC (at 500nm) resulting in ~0.012 photons per pulse. The raw signal (red fill color) and the\nMPPC dark noise, which also includes the optical noise of the PDC setup (black fill color)\nwere acquired for 106 shots of the pump laser. Inset is the extended part of the histogram,\nwhich shows the vacuum component.\n\nLet the subscript \"CT\" denote the quantities where the crosstalk has been taken into\naccount and let P be the probability of the occurrence of one crosstalk photocount. In this\ncase, the number of k -photon events is given by\n\nN k ,CT , DN  N k  nk ,CT  kPNk  ( k  1) PN k 1 ,\n\n(5)\n\nThe third term is the number of k -photon events that have been modified by the crosstalk and\nhave become (k  1) -photon events, the fourth term is the number of (k  1) -photon events\nthat have gained an extra photon from the crosstalk to become k -photon events.\nUnder the above assumptions, the dark count events add trivially to the photon statistics;\nhence, the expression in Eq.(5) can be simplified by subtracting the dark photocounts (with\ntheir cross-talk avalanches) and just consider the effect of the crosstalk:\n\n\fN k ,CT  N k ,CT , DN  nk ,CT ,\nThe total number of photocounts is given in this case by\n\nN Total,CT  k 1 k N k ,CT  (1  P )k 1 kNk\n\n\nThe measured g\n\n(2)\n\n\n\n(6)\n\nfunction of the photocounts N k , CT , according to Eqs.(4)-(6), becomes\n\ng (2) \n\n(1  2 P) (2)\n2P\n1\ng0 \n,\n2\n(1  P)\n(1  P) NTotal ,CT\n\n(7)\n\n(2)\n\nwhere g 0 is the correlation function of the incident light, which would be given by Eq.(4a)\nin the absence of the cross-talk. This result means that the counts of a detector with the\ncrosstalk have the second-order normalized CF differing from the incident light CF by a\nnormalization coefficient (very close to a unity) and an additive term scaling as  1 / N Total ,CT .\nThe crosstalk probability\n\nP can be easily measured using some light source with known\n\n(2)\n0\n\n, for instance, coherent or multimode light with g 0(2)  1 . Then, the unknown CF of the\nPDC source can be found by subtracting the additive contribution and normalizing the\nmeasured CF according to Eq.(7). This approach was realized in our experiment.\n\ng\n\n3. Experiment\nIn the experimental setup, shown in Fig.2, the 4-th harmonic of a pulsed Nd:YAG laser with\nthe wavelength 266 nm (Crystalaser, 30 ns long pulses, 20kHz repetition rate) was used as a\npump with its intensity controlled by a half wave plate and a polarizing beam splitter in the\nrange from 20 uW to 5 mW. The long-term and the pulse-to-pulse stability of the UV-laser\nwere controlled by a power meter and a fast Si photodiode (Thorlabs), respectively. The\nfluctuations of the UV-laser intensity did not exceed 3%. A lens with a focal length of f=750\nmm was used to focus the pump beam into two 5mm long type-I BBO crystals, where PDC\noccurred. The crystals had oppositely directed axes in order to compensate for the spatial\nwalk-off of the pump. After passing the BBO crystals the pump was eliminated by a UV\nmirror (UVM) whilst the PDC emission fluently passed through it. The collinear part of the\nPDC beam with the divergence equal to that of the pump was coupled into a single-mode\noptical fiber (SMF) by means of an achromatic lens f=6.2 mm, placed at a distance of 550 mm\nfrom the crystal. At the output of the fiber a collimated beam was formed by a lens with\nf=6.24 mm and addressed into an MPPC module (Hamamatsu, model C10751-02 with 400\npixels embedded in 1.5*1.5 mm chip). In order to ensure a relatively homogeneous\nillumination of the MPPC area, a lens (L) with f=400 mm was used to focus the beam onto the\nMPPC chip and provided a spot with the diameter 700 um. A fast digital oscilloscope (LeCroy\nWave Runner, 2 GS/s sampling rate) was used to capture the analogue output from the MPPC\n(in a range 0-650 mV) and plot the histogram of its amplitude. The standard acquisition for\neach point was 106 shots of the pump laser.\nThe results of the measurements on the coherent state were obtained with the attenuated\ncontinuous-wave Nd:YAG laser second-harmonic radiation with the wavelength 532 nm\n(Photoptech), whose intensity was modulated by an acousto-optic modulator (AOM, Gooch\nand Housego), driven by an external pulse generator. The laser pulse was tailored to mimic\n\n\fthe profile and duration of the PDC pulse and its intensity was controlled by a half-wave plate\n(HWP) and a polarizing beam splitter (PBS). In relevant measurements the laser pulse was\naddressed into the optical path by a flipping mirror (FM1) and then was focused onto the\nMPPC chip with the same spot size as in the PDC experiment.\nIn order to compare the results of the MPPC measurements with a traditional HBT\nexperiment, the beam was diverted by a flipping mirror (FM2) into an intensity interferometer\nwith a 50/50 beam splitter (BS) and detected by two gated APDs (Perkin-Elmer SPCM AQR14), whose outputs were addressed to a coincidence circuit with a 50 ns window. In order to\navoid the APD saturation in experiments with high photon fluxes, the beam was attenuated by\nneutral density filters (not shown) to ensure that the counting rate of each APD was much\nlower than the repetition rate of the laser.\n\nFig. 2 Experimental setup (Color online). The 4-th harmonic of Nd:YAG laser at 266 nm is\nused to pump BBO crystals where PDC occurs. The pump intensity is controlled by a half\nwave plate (HWP) and a polarizing beam splitter (PBS). The collinear PDC is coupled into a\nsingle-mode fiber (SM fiber). In experiments with the coherent state a cw Nd:YAG laser at 532\nnm is modulated by AOM and diverted by the flipping mirror (FM1). The flipping mirror\n(FM2) is used to address the beam to either the MPPC or the HBT scheme consisting of a\nnonpolarizing 50/50 beam splitter (NPBS), two APDs (APD1, APD2), and a coincidence\ncircuit (&). UVM is a pump rejection mirror; IF are narrowband interference filters; ND,\nneutral density filter; L, a lens.\n\nThe dark noise of the MPPC was 11 dB suppressed by thermoelectrically cooling the chip\ndown to -4.5C and sealing the detector in a custom-made housing with a coated optical\nwindow. The dark noise (which also accounts for the crosstalk) was about 25KCounts/sec and\nits gated part was carefully subtracted from the experimental data, as justified above. In the\nexperiments with PDC the noise contribution also included the luminescence of the optical\nelements of the setup and it was measured by extinguishing PDC by tilting the polarization of\nthe pump at 90 degrees by a half wave plate. Note that cooling of the chip did not help to\nsuppress the crosstalk as confirmed by the results of other groups [30-32]. The MPPC output\nwas synchronized with the laser sync pulse and was gated with 50 ns window.\n4. Results and Discussion\nFirst, g\n\n( 2)\n\nmeasurements were carried out with the MPPC module by measuring the coherent\n\nstate, given by Eq.(3), at different laser powers, which provided a reference with g 0  1 .\nFor this purpose, a weak laser pulse was addressed into the measuring apparatus by erecting a\nflipping mirror FM1. Then the laser beam was gradually attenuated and a set of corresponding\n(2)\n\namplitude histograms was recorded. The dependence of g\n\n( 2)\n\nversus the mean number of\n\nphotocounts, calculated according to Eq.(4a) and fitted by Eq.(7) with P being the only\n\n\ffitting parameter, is shown in Fig.3 and Fig.4 (black dashed trace, squares) and summarized in\nTable 1. The value of the crosstalk probability was found to be P  0,177  0.003 , with the\ncoefficient of determination of the fit COD( R )  0,9801 . As shown in Fig.3, although\nexcess two-photon correlations are not expected for the coherent state, the dependence of CF\nobtained by the MPPC exhibits strong photon bunching. This effect is attributed to the firstorder crosstalk, which, according to Eq.(7), becomes especially pronounced at low photon\nnumbers.\n2\n\nFig.3 (Color online). Dependence of g(2) on the mean number of photocounts per pulse,\nobtained via MPPC measurements of the coherent state (black dashed trace, squares) and the\nsignal radiation of the two mode squeezed vacuum state (blue solid trace, triangles). The\ncurves are experimental fits with the corresponding parameters given in Table 1. Inset: the g(2)\ndependence at large numbers of photocounts.\n( 2)\n\nNext, g\nmeasurements were carried out by HBT and MPPC setups measuring only the\nsignal radiation of two-mode squeezed vacuum, see Eq.(2a), which, in case of multimode\ndetection also provides a reference with g 0  1 [26,27]. For this purpose the FM1 was\ndissembled, so that the PDC beam from the SM fiber was addressed directly into the\nmeasuring apparatus. The optical axes of the crystals were set to 47.53 deg, which\ncorresponded to the collinear generation of signal and idler photons at 500 nm and 568 nm,\nrespectively. The signal photons fluently passed through a 10 nm FWHM interference filter,\n(2)\n\ncentered at 500 nm, while the correlated idler photon at 568 nm was discarded. The g\n\n( 2)\n\nmeasured by HBT setup was found at a level of 1.10  0.1 and demonstrated a flat\ndependence on the photon number, varied through changing the pump power. Then the PDC\nbeam was addressed into the MPPC module and analogous to the measurements with the\ncoherent state, a set of corresponding amplitude histograms was recorded. The dependence of\n\ng (2) ( NTotal ,CT ) calculated according to Eq.(4a) and fitted by Eq.(7) is shown in Fig.3 (blue\nsolid trace, triangles) and summarized in Table 1. In order to compare the results with the\ncoherent state, the photon numbers were adjusted for slight differences in quantum efficiency\nand transmission profile of the filter. The obtained value of the crosstalk parameter from the\nfit of the experimental data is P  0.186  0.002 with COD( R )  0.991 . As shown\n2\n\n\fin Fig.3, the obtained dependence demonstrates good agreement with the results obtained for\nthe coherent state. Similar results have been obtained measuring the idler radiation at 568nm.\nTable 1. Compilation of the fitting results a of the dependencies in Fig. 3\nState and Measurement\nconfiguration\n\nFigure and trace\n\nP\n\nCOD (R2)\n\n#1\n\nCoherent state\nmeasured with MPPC\n\nFigures 3,4\nblack dashed curve\n\n0.177  0.003\n\n0.9801\n\n#2\n\nSignal radiation of two\nmode squeezed vacuum\nmeasured with MPPC\n\nFigure 3\nblue solid curve\n\n0.186  0.002\n\n0.991\n\na\n\nAll the fittings were done using Origin software (OriginLab) by Levenberg-Marquardt algorithm, weighted for the\nexperimental uncertainties.\n\nNext, measurements of the single-mode squeezed vacuum state were made. The optical\naxes of the crystals were set to 47.63 deg which corresponded to the collinear frequency\ndegenerate phase matching. An interference filter centered at 532nm with a 2 nm FWHM was\nused to ensure that both signal and idler modes were measured. Analogous to the previous\ncase, the dependence of\n\ng (2) ( NTotal ,CT ) was calculated from the MPPC amplitude\n\nhistograms according to Eq.(4a). The result is shown in Fig.4 (red solid trace, circles) and\nfitted by the parameters shown in Table 2. Note that the asymptotic value of the correlation\nfunction for the squeezed vacuum was taken from the results of the measurements of the\n( 2)\n\ncoherent state. From the obtained results it is clearly seen that on top of the crosstalk, g\nreveals additional two-photon correlations, which are attributed to the two-photon nature of\nsqueezed vacuum.\n\nFig.4 (Color online). Dependence of g(2) on the mean number of photocounts per pulse,\nobtained via MPPC measurements of the coherent state (black dashed trace, squares) and the\nsingle-mode squeezed vacuum state (red solid trace, circles). The curves are experimental fits\nwith the corresponding parameters given in Table 1, 2. Inset: the g(2) dependence at large\nnumbers of photocounts.\n\n\f(2)\n\nIn order to infer the actual g 0\n\nof the single mode squeezed vacuum from the MPPC\n\nmeasurements, Eq.(7) was used with P  0,177  0.003 which was obtained from the\nearlier measurements of the coherent state. The resulting curve is shown in Fig.5 (red solid\ntrace). The results are compared with the ones obtained in the HBT experiment, which are\nalso shown in Fig.5 (black dashed trace, squares) and the fitting parameters are summarized in\nTable 2. The results of the measurements with MPPC and HBT setup demonstrate good\nagreement, whilst a slight discrepancy may be attributed to a higher-order crosstalk effect.\nNote that the mean photon numbers for both measurements shown in Fig.5 were adjusted by\ncorresponding quantum efficiencies of the detectors and a crosstalk of MPPC. A direct\ncomparison of single APD and MPPC module, realized in our setup by using attenuated laser\npulses, revealed almost identical count rates of the detectors in the relevant dynamic range\n(average ratio 1.05). Taking into account the manufacturer's data on the quantum efficiency of\nthe APD (equal to 50% at 532 nm) and the probability of the MPPC crosstalk, we found that\nthe resulting quantum efficiency of the MPPC in our tests is equal to 41%. This figure\nrepresents a reasonable agreement with the value of 39% given in the datasheet of MPPC at 4.5C (which accounts for both the non-unity fill-factor of the chip and the quantum efficiency\nof individual pixels).\n\nFig.5 (Color online). Comparison of the dependence of the inferred g(2) on the mean number of\nphotocounts per pulse for single-mode squeezed vacuum, measured by the MPPC (red solid\ntrace), with the one obtained with a traditional HBT setup (black dashed trace, squares). The\nfunctions are presented in Table 2.\n\n\fTable 2. Compilation of the fitting results of the dependencies in Figs. 4-5.\n\nState and Measurement\nconfiguration\n1\n\n2\n\n3\n\nSingle-mode squeezed\nvacuum measured with\nMPPC\nInferred result for the\nsingle-mode squeezed\nvacuum measured with\nMPPC\nSingle mode squeezed\nvacuum measured with\nHBT\n\nFigure and trace\n\ng ( 2 )  A  B / N total\nB\nA\n\nCOD\n(R2)\n\nFigure 4\nred solid curve\n\n0.977±0.01\n\n0.444±0.004\n\n0.991\n\nFigure 5\nred solid curve\n\n1±0.014\n\n0.176±0.007\n\n(inferred)\n\nFigure 5\nblack dashed curve\n\n0.985±0.05\n\n0.204±0.002\n\n0.994\n\nThese results demonstrate that with a proper account for the crosstalk, MPPC detectors can\nbe used for measurements of the second-order correlation function. Indeed, the measurement\nof the correlation function for some source with known statistics, such as, a coherent source,\ndirectly reveals the contribution of the crosstalk and allows one to subtract it.\nBased on the present results and considering a remarkable capability of MPPC to\ndistinguish higher photon numbers, our analysis can be further expanded to the studies of\nhigher-order intensity correlation functions, see Eq.(4b). In such experiments the MPPC\ndetector adjusted for the cross talk contribution would represent a compact and cost-effective\nsolution in comparison with the existing detection techniques.\n5. Conclusion\nIn conclusion, the second-order correlation function for coherent and squeezed vacuum states\nhas been experimentally determined by using MPPC for the first time. We introduced an\nalgorithm for obtaining the correlation function from any spatially resolved multi-pixel\ndetector (MPPC, CCD). We developed a model of crosstalk in MPPC, which describes an\nadditional term in the second-order correlation function. The validity of our approach was\nconfirmed by demonstrating good agreement with independent measurements conducted in an\nHBT setup. It seems likely that at moderate gain of the OPO, when higher photon numbers are\nto be populated, the applicability of MPPC will be limited by the crosstalk. However, it is\nworth mentioning the continuing efforts on improving the fabrication process and design of\nAPD arrays aimed to reduce the crosstalk and thus broaden the MPPC applicability [32].\nBesides, the presented approach to correlation analysis can be directly applied to any kind of\nspatially resolving detectors such as, single photon resolving ICCD and EMCCD, where the\ninfluence of the crosstalk can be filtered out by addressing single pixels. Due to the fact that\ncorrelation measurements tolerate linear losses and finite efficiencies of the detectors, they are\nespecially beneficial in experiments where the photon statistics have to be instantly estimated\nwithout knowing the exact nature of the losses. This approach may be exploited in a vast\nnumber of experiments, ranging from the studies of atomic-photon interfaces to astronomy\napplications.\nAcknowledgement\nWe would like to thank Rodney Chua for the assistance in building the detector housing. This\nwork was supported by A-STAR Investigatorship grant.\n\n\f"}