{"id": "http://arxiv.org/abs/1111.6596v2", "guidislink": true, "updated": "2012-03-27T10:00:16Z", "updated_parsed": [2012, 3, 27, 10, 0, 16, 1, 87, 0], "published": "2011-11-28T21:00:13Z", "published_parsed": [2011, 11, 28, 21, 0, 13, 0, 332, 0], "title": "Thinking Outside the Box: Effects of Modes Larger than the Survey on\n  Matter Power Spectrum Covariance", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1111.3538%2C1111.6531%2C1111.2281%2C1111.7025%2C1111.3476%2C1111.6532%2C1111.5120%2C1111.0999%2C1111.3321%2C1111.5816%2C1111.7112%2C1111.5181%2C1111.1745%2C1111.5235%2C1111.2587%2C1111.2161%2C1111.2198%2C1111.4901%2C1111.1914%2C1111.0286%2C1111.5021%2C1111.3641%2C1111.3005%2C1111.5301%2C1111.6803%2C1111.2326%2C1111.5277%2C1111.7117%2C1111.7014%2C1111.2158%2C1111.3389%2C1111.6196%2C1111.6883%2C1111.2124%2C1111.0304%2C1111.4227%2C1111.6371%2C1111.4590%2C1111.3804%2C1111.7085%2C1111.6704%2C1111.3631%2C1111.5278%2C1111.4801%2C1111.5369%2C1111.1334%2C1111.2004%2C1111.1283%2C1111.5948%2C1111.6932%2C1111.4258%2C1111.4221%2C1111.1278%2C1111.0752%2C1111.0684%2C1111.6818%2C1111.7242%2C1111.7264%2C1111.4562%2C1111.3850%2C1111.5477%2C1111.0133%2C1111.4983%2C1111.0409%2C1111.6596%2C1111.6673%2C1111.5986%2C1111.4809%2C1111.3194%2C1111.2254%2C1111.1251%2C1111.3255%2C1111.7182%2C1111.5214%2C1111.0641%2C1111.6155%2C1111.4989%2C1111.2291%2C1111.3058%2C1111.3318%2C1111.0960%2C1111.1678%2C1111.3498%2C1111.3171%2C1111.0321%2C1111.4074%2C1111.3219%2C1111.2155%2C1111.3183%2C1111.5031%2C1111.1431%2C1111.6737%2C1111.5734%2C1111.5837%2C1111.3291%2C1111.4234%2C1111.6082%2C1111.0456%2C1111.2423%2C1111.1138%2C1111.7233&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Thinking Outside the Box: Effects of Modes Larger than the Survey on\n  Matter Power Spectrum Covariance"}, "summary": "Considering the matter power spectrum covariance matrix, it has recently been\nfound that there is a potentially dominant effect on mildly non-linear scales\ndue to power in modes of size equal to and larger than the survey volume. This\n{\\it beat coupling} effect has been derived analytically in perturbation theory\nand while it has been tested with simulations, some questions remain\nunanswered. Moreover, there is an additional effect of these large modes, which\nhas so far not been included in analytic studies, namely the effect on the\nestimated {\\it average} density which enters the power spectrum estimate. In\nthis article, we work out analytic, perturbation theory based expressions\nincluding both the beat coupling and this {\\it local average effect} and we\nshow that while, when isolated, beat coupling indeed causes large excess\ncovariance in agreement with the literature, in a realistic scenario this is\ncompensated almost entirely by the local average effect, leaving only $\\sim 10\n%$ of the excess. We test our analytic expressions by comparison to a suite of\nlarge N-body simulations. For the variances, we find excellent agreement with\nthe analytic expressions for $k < 0.2 h$Mpc$^{-1}$ at $z=0.5$, while the\ncorrelation coefficients agree to beyond $k=0.4 h$Mpc$^{-1}$. As expected, the\nrange of agreement increases towards higher redshift and decreases slightly\ntowards $z=0$. We finish by including the large-mode effects in a full\ncovariance matrix description for arbitrary survey geometry and confirming its\nvalidity using simulations. This may be useful as a stepping stone towards\nbuilding an actual galaxy (or other tracer's) power spectrum covariance matrix.\n[abridged]", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1111.3538%2C1111.6531%2C1111.2281%2C1111.7025%2C1111.3476%2C1111.6532%2C1111.5120%2C1111.0999%2C1111.3321%2C1111.5816%2C1111.7112%2C1111.5181%2C1111.1745%2C1111.5235%2C1111.2587%2C1111.2161%2C1111.2198%2C1111.4901%2C1111.1914%2C1111.0286%2C1111.5021%2C1111.3641%2C1111.3005%2C1111.5301%2C1111.6803%2C1111.2326%2C1111.5277%2C1111.7117%2C1111.7014%2C1111.2158%2C1111.3389%2C1111.6196%2C1111.6883%2C1111.2124%2C1111.0304%2C1111.4227%2C1111.6371%2C1111.4590%2C1111.3804%2C1111.7085%2C1111.6704%2C1111.3631%2C1111.5278%2C1111.4801%2C1111.5369%2C1111.1334%2C1111.2004%2C1111.1283%2C1111.5948%2C1111.6932%2C1111.4258%2C1111.4221%2C1111.1278%2C1111.0752%2C1111.0684%2C1111.6818%2C1111.7242%2C1111.7264%2C1111.4562%2C1111.3850%2C1111.5477%2C1111.0133%2C1111.4983%2C1111.0409%2C1111.6596%2C1111.6673%2C1111.5986%2C1111.4809%2C1111.3194%2C1111.2254%2C1111.1251%2C1111.3255%2C1111.7182%2C1111.5214%2C1111.0641%2C1111.6155%2C1111.4989%2C1111.2291%2C1111.3058%2C1111.3318%2C1111.0960%2C1111.1678%2C1111.3498%2C1111.3171%2C1111.0321%2C1111.4074%2C1111.3219%2C1111.2155%2C1111.3183%2C1111.5031%2C1111.1431%2C1111.6737%2C1111.5734%2C1111.5837%2C1111.3291%2C1111.4234%2C1111.6082%2C1111.0456%2C1111.2423%2C1111.1138%2C1111.7233&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Considering the matter power spectrum covariance matrix, it has recently been\nfound that there is a potentially dominant effect on mildly non-linear scales\ndue to power in modes of size equal to and larger than the survey volume. This\n{\\it beat coupling} effect has been derived analytically in perturbation theory\nand while it has been tested with simulations, some questions remain\nunanswered. Moreover, there is an additional effect of these large modes, which\nhas so far not been included in analytic studies, namely the effect on the\nestimated {\\it average} density which enters the power spectrum estimate. In\nthis article, we work out analytic, perturbation theory based expressions\nincluding both the beat coupling and this {\\it local average effect} and we\nshow that while, when isolated, beat coupling indeed causes large excess\ncovariance in agreement with the literature, in a realistic scenario this is\ncompensated almost entirely by the local average effect, leaving only $\\sim 10\n%$ of the excess. We test our analytic expressions by comparison to a suite of\nlarge N-body simulations. For the variances, we find excellent agreement with\nthe analytic expressions for $k < 0.2 h$Mpc$^{-1}$ at $z=0.5$, while the\ncorrelation coefficients agree to beyond $k=0.4 h$Mpc$^{-1}$. As expected, the\nrange of agreement increases towards higher redshift and decreases slightly\ntowards $z=0$. We finish by including the large-mode effects in a full\ncovariance matrix description for arbitrary survey geometry and confirming its\nvalidity using simulations. This may be useful as a stepping stone towards\nbuilding an actual galaxy (or other tracer's) power spectrum covariance matrix.\n[abridged]"}, "authors": ["Roland de Putter", "Christian Wagner", "Olga Mena", "Licia Verde", "Will Percival"], "author_detail": {"name": "Will Percival"}, "author": "Will Percival", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1088/1475-7516/2012/04/019", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1111.6596v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1111.6596v2", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "24 pages, 10 figures. Version accepted for publication in JCAP. Added\n  Figure 5 and Appendix A", "arxiv_primary_category": {"term": "astro-ph.CO", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph.CO", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1111.6596v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1111.6596v2", "journal_reference": null, "doi": "10.1088/1475-7516/2012/04/019", "fulltext": "Thinking Outside the Box:\nEffects of Modes Larger than the Survey on Matter Power Spectrum Covariance\nRoland de Putter1,2 , Christian Wagner1 , Olga Mena2 , Licia Verde1 , Will J. Percival3\n\narXiv:1111.6596v2 [astro-ph.CO] 27 Mar 2012\n\n1\n\nICC, University of Barcelona (IEEC-UB), Marti i Franques 1, Barcelona 08028, Spain\n2\nInstituto de Fisica Corpuscular, Universidad de Valencia-CSIC, Spain\n3\nInstitute of Cosmology & Gravitation, University of Portsmouth,\nDennis Sciama Bldg., Portsmouth, PO1 3FX, UK\n(Dated: June 25, 2018)\n\nAccurate power spectrum (or correlation function) covariance matrices are a crucial requirement\nfor cosmological parameter estimation from large scale structure surveys. In order to minimize\nreliance on computationally expensive mock catalogs, it is important to have a solid analytic understanding of the different components that make up a covariance matrix. Considering the matter\npower spectrum covariance matrix, it has recently been found that there is a potentially dominant\neffect on mildly non-linear scales due to power in modes of size equal to and larger than the survey\nvolume. This beat coupling effect has been derived analytically in perturbation theory and while it\nhas been tested with simulations, some questions remain unanswered. Moreover, there is an additional effect of these large modes, which has so far not been included in analytic studies, namely the\neffect on the estimated average density which enters the power spectrum estimate. In this article, we\nwork out analytic, perturbation theory based expressions including both the beat coupling and this\nlocal average effect and we show that while, when isolated, beat coupling indeed causes large excess\ncovariance in agreement with the literature, in a realistic scenario this is compensated almost entirely by the local average effect, leaving only ∼ 10% of the excess. We test our analytic expressions\nby comparison to a suite of large N-body simulations, using both full simulation boxes and subboxes\nthereof to study cases without beat coupling, with beat coupling and with both beat coupling and\nthe local average effect. For the variances, we find excellent agreement with the analytic expressions\nfor k < 0.2hMpc−1 at z = 0.5, while the correlation coefficients agree to beyond k = 0.4hMpc−1 .\nAs expected, the range of agreement increases towards higher redshift and decreases slightly towards z = 0. We finish by including the large-mode effects in a full covariance matrix description\nfor arbitrary survey geometry and confirming its validity using simulations. This may be useful as\na stepping stone towards building an actual galaxy (or other tracer's) power spectrum covariance\nmatrix.\nI.\n\nINTRODUCTION\n\nGalaxy surveys (and surveys of other dark matter tracers) are an important tool for constraining cosmological\nparameters and the tracer's power spectrum (or its Fourier transform, the correlation function) is the most valuable\nobservable. It can be used to measure the scale of baryon acoustic oscillations (BAO, see e.g. [1–4]), which is a\nparticularly robust feature and a strong probe of dark energy through the measurement's dependence on the expansion\nhistory, but it is also common to use the full shape of the power spectrum to constrain cosmology (e.g. [5, 6]). In\norder for these measurements to be useful for cosmology however, it is crucial to have an accurate estimate of the\nobservable's covariance matrix. As surveys get larger, calculating such a matrix directly from simulations becomes ever\nmore challenging. In fact, large numbers of mock catalogs are required to estimate covariance matrices directly from\nsimulations and it is computationally very costly to create such numbers with the required volume and resolution.\nMoreover, the covariance matrix is cosmology dependent so ideally one would either be able to generate a large\nnumber of matrices for different cosmologies, or show that this cosmology dependence can be safely neglected. This\nrequirement increases the number of mocks needed in the brute force method even further. It is therefore important\nto develop a good analytical understanding in order to eventually rely less on simulations.\nWhile the density of tracers may have a non-trivial relation with the dark matter density, a good first step towards\nunderstanding the true covariance matrix is to study that of the dark matter power spectrum. The two main\ncomplications in understanding the dark matter matrix are the mode mixing due to the finite survey volume and the\n−1\nnon-Gaussian nature of the matter overdensity field on small scales (k >\n∼ 0.1hMpc ) due to non-linear evolution.\nWhile the former is relatively straightforward to quantify ([7]), the latter effects are the subject of a large number of\nstudies [8–20], involving N-body simulations, perturbation theory and the halo model. For covariances on non-linear\nscales, an important (but often overlooked) role is played by modes of wavelength comparable to and larger than the\nsurvey size. In particular, [21, 22] found that the interplay of mode mixing by the survey window with non-linear\ncorrelations between a pair of small-scale modes and a large mode, causes a covariance contribution proportional to\nthe power in super-survey modes, and that, in fact, this is the dominant contribution to the covariance matrix on\nsmall scales. The added covariance affects both the variances and the off-diagonal covariances. This effect is usually\n\n\f2\ncalled beat coupling (see also [13, 23–25]). A second consequence of the presence of modes larger than the survey\nis that the average density (which is needed to construct the overdensity) estimated from the survey has a variance\nitself, leading to an additional covariance contribution proportional to the large scale power. We will refer to this as\nthe local average effect.\nIn the standard approach to estimating covariances from N-body simulations, the power spectrum is calculated\nusing the full, periodic simulation volume. However, this completely misses the large effects discussed above because\nthere are no modes larger than the \"survey\" volume. In order to capture these effects, one thus needs to consider\neither a subvolume of a (much) larger simulation, or implement a varying zero mode ([12]) in the simulations. While\nsome such studies have been performed (see e.g. [24, 25]), a systematic study, leading to a complete and well tested\nanalytic description has until now been lacking.\nIn this article, we aim to present such a study. We use a set of large (L = 2400h−1Mpc) N-body simulations and\nstudy the aforementioned effects of large modes by considering significantly smaller subboxes (L = 600h−1Mpc), thus\nimitating the real world scenario of a finite survey embedded in an infinite universe. We build an analytic model for\nthe covariance matrix, properly including the effect of the window function and describing non-linear effects using\nperturbation theory. This description includes the beat coupling model from [21], but adds to this an analytic estimate\nof the local average effect. The latter effect needs to be included when building a covariance matrix for a realistically\nestimated power spectrum and has to our knowledge not been calculated analytically previously.\nWe compare our model to simulations at five redshifts in the range z = 0 − 2 and generally find excellent agreement\nuntil well into the non-linear regime. Since we test several combinations of covariance matrix contributions individually\nby employing different approaches to estimating spectra from simulations, we are confident that our theoretical\nunderstanding of the dark matter covariance is correct and that we have captured the main effects.\nOne of our main results is that, while beat coupling indeed causes excess covariance which soon dominates, the\ncontribution from the local average effect cancels most of this out, leaving only a reduced beat coupling contribution\nof about 10% of the original.\nIn addition to the effects on non-linear scales discussed above, the mode mixing due to the window function also has\na well known effect on linear scales, correlating neighboring power spectrum estimators and reducing the variances.\nThis effect needs to be taken into account for a realistic survey. We calculate these covariances directly using analytic\nexpressions from [7] and show good agreement with simulations. Thus, while the main goal of this paper is to study\nthe beat coupling and local average effects related to super-survey modes, we also provide a complete expression\nthat can be used to calculate a (dark matter) covariance matrix for an arbitrary survey geometry and can serve as\na stepping stone for calculating a galaxy (or other dark matter tracer) spectrum covariance matrix. We also study\nthe cosmology dependence of the covariance matrix and find that for cosmological parameter variations relevant to\ncurrent cosmological constraints, the covariance matrix undergoes changes at the ∼ 30% level.\nThe outline of this article is as follows. We explain the analytic description of the covariance matrix in section II,\nusing a simple formalism apt for the description of simulation results. This will lead to three expressions that can\nbe tested against simulations (without beat coupling, with beat coupling, and with beat coupling and local average\neffect). We then describe our N-body simulations in section III and compare the results to theory in section IV.\nWhile for the main results in this paper, we stick to a simple description in terms of a discrete set of modes, we\ndiscuss a more rigorous and complete treatment of the window function in section V, leading to expressions that can\nbe applied to arbitrary survey geometry. We conclude and summarize our work in section VI. Finally, we use our\nanalytic expressions to briefly discuss the cosmology dependence of the covariance matrix in the Appendix.\nAs this article is rather long and technical, we provide some recommendations for a reader on a tight schedule. On\na first reading, this reader may want to skip the mathematical discussion in section II and jump straight to section\nII E, where the main equations are summarized. Moreover, in section V, one could jump to Eq. (48), which presents\nthe final covariance matrix expression for general geometry, and then focus on the results in Figs 6-9, where the green\npoints and lines show the covariance matrix corresponding to said equation.\nII.\n\nCOVARIANCE MATRIX FORMALISM\n\nIn this section, we work out the formalism for calculating a covariance matrix for a power spectrum measured from\na cubic volume with uniform selection function, i.e. the geometry of N-body simulations. We describe the density field\nin terms of a discrete set of modes, which significantly simplifies notation. We will provide a more general description,\nwhich can be applied to an arbitrary survey geometry (following [7]), in section V. The more technical discussion\nthere also serves to motivate the simpler approach taken in this section.\n\n\f3\nA.\n\nN-body Simulation Geometry (Cubic Box)\n\nWe consider a cubic subvolume V = L3 of the universe (which later in this article will be modeled by taking a\nsubvolume of a much larger periodic simulation box). The matter overdensity field δ(x) ≡ (ρ(x) − ρ̄)/ρ̄, where ρ(x)\nis the matter density and ρ̄ its mean, can be expanded as\nZ\nd3 k −ı̇k*x\nδ(x) =\ne\nδ(k).\n(1)\n(2π)3\nTo significantly simplify notation, we choose to describe the density field in the volume V in terms of discrete Fourier\nmodes in analogy to the usual description of the density field in a periodic box, i.e. we effectively describe the field\nin the subvolume by\nδ(x) ∼\n\nX\n\ne−ı̇k*x δk ,\n\nki =\n\nk\n\n2π\nni\nL\n\nfor\n\nni = 0, ±1, . . . .\n\n(2)\n\nTo be more exact, we define the discrete modes as\n1\nδk ≡\nV\n\nZ\n\nd3 x eı̇k*x δ(x).\n\n(3)\n\nV\n1\n\nIn other words, δk is equal to the FKP estimator ([7]) F (k) (up to a factor V − 2 ) applied to the volume V , and is\ntherefore a weighted average over a range of continuum Fourier modes. RIn particular, while there is no true k = 0\nmode, the subvolume sees an effective zero mode (see also [12]) δ0 = V −1 V d3 x δ(x) which gets its main contribution\nfrom continuum Fourier modes |k| < 2π/L. Note that Eq. (2) is not to be taken literally, as the field is not actually\nperiodic with respect to the volume V . We discuss the effect of taking a subvolume more rigorously in section V.\nThe statistics of the discrete overdensity modes can be characterized by a sequence of connected n−point functions,\nPk K\nδ\n′\nV k+k\nBk,k′ ,k′′ K\nδk+k′ +k′′\n=\nV2\nTk,k′ ,k′′ ,k′′′ K\n=\nδk+k′ +k′′ +k′′′\nV3\n... ,\n\nhδk δk′ i =\nhδk δk′ δk′′ ic\nhδk δk′ δk′′ δk′′′ ic\n\nwhere we have defined the power spectrum Pk , bispectrum Bk,k′ ,k′′ an the trispectrum Tk,k′ ,k′′ ,k′′ . Note that these\nare technically weighted averages of the true, continuum power, bi- and trispectrum, for example (see also section V)\nZ\nY\nd3 k\n(4)\nj02 (Lki /2),\nP (k)\nP0 ≡ V h|δ0 |2 i = V\n3\n(2π)\ni=x,y,x\nwhere j0 (x) = sin x/x is the zeroth spherical Bessel function.\nThe power of an individual mode can be estimated as\nP̂k ≡ V |δk |2 ,\n\n(5)\n\nsuch that hP̂k i = Pk as desired, from which one can define a bin averaged estimator in order to maximize signal to\nnoise,\nP̂i ≡\n\n1 X\nP̂k .\nNi\n\n(6)\n\nk∈i\n\nHere, the sum is over all k = 2π\nL n, with integer components ni , such that k lies in some small range defining the i-th\nbin. Ni is the number of modes in i. The expectation value Pi ≡ hP̂i i ≈ Pki , with ki a typical mode inside the bin.\nWe are interested in the covariance matrix of this bin averaged estimator,\nCij ≡ hδ P̂i δ P̂j i.\n\n(7)\n\n\f4\nStarting from the covariances in the individual mode estimators,\n\u0001 1\nK\nK\nhδ P̂k δ P̂k′ i = Pk2 δk+k\n+ Tk,−k,k′,−k′ ,\n′ + δk−k′\nV\nwe obtain\n2Pi2 K T̄ij\n1 X 1 X\nhδ P̂k δ P̂k′ i =\nδ +\n,\nCij =\nNi\nNj ′\nNi ij\nV\nk∈i\n\n(8)\n\n(9)\n\nk ∈j\n\nwhere we have introduced the shorthand notation T̄ij for the bin averaged trispectrum. The term proportional to the\npower spectrum squared is diagonal and given by simply counting modes because the binning in k-space only includes\npairs of estimators that have zero covariance. As we will discuss in detail in section V, this is not in general the case\nas the window function may correlate different bins.\nB.\n\nN-body Simulation Geometry: Perturbation Theory\n\nThe power spectrum appearing in the first term on the right hand side of Eq. (9) is the full non-linear power\nspectrum, which can be estimated directly from simulations. The trispectrum is harder to get from simulations (but\nsee [19]), but can be modeled using a variety of perturbation theory schemes or using the halo model. In this work,\nwe will use the simple framework of (Eulerian) standard perturbation theory (SPT; [8, 26–28]). Anticipating angle\naveraging, i.e. modulo transformations k ↔ −k and k′ ↔ −k′ , the leading order trispectrum for the configuration of\ninterest is given as (see1 [8, 27])\n\u0002\n\u0003\n=\n12 Pklin Pklin\nF3 (k, −k, k′ )Pklin + (k ↔ k′ )\nTk,−k,k′,−k′\n′\n\u0002\n\u0003\n′ 2\nlin\nF2 (k − k′ , k′ ) Pklin\n+8 P|k−k\n′ + (k ↔ k )\n′|\n+16\n\nPklin\n\nlin\nPklin\nF2 (−0, k) F2 (k′ , 0),\n′ P0\n\n(10)\n\nwhere F2 and F3 are the kernels for the second and third order contributions to the density field, as given in the\nappendix of [28]. We can now distinguish two types of terms. The first two lines represent the \"standard\" trispectrum\ncontributions, that have always been included in PT studies of the trispectrum (see e.g. [8]). When no modes larger\nthan the survey are present, like in the artificial case of a power spectrum estimated from the full volume of a periodic\n(N-body simulation) box, these are the only terms entering the trispectrum, giving\n\u0002\n\u0003\n\u0003\n1 X 1 X lin lin \u0002\n′ 2\nlin\nT̄ij0 =\nF2 (k − k′ , k′ ) Pklin\n]. (11)\n[Pk Pk′ F3 (k, −k, k′ )Pklin + (k ↔ k′ ) + 8 P|k−k\n′ + (k ↔ k )\n′|\nNi\nNj ′\nk ∈j\n\nk∈i\n\nWe will evaluate\n\nT̄ij0\n\nnumerically as no further analytic simplifications are possible.\nC.\n\nThe Beat Coupling Effect\n\nThe third line in Eq. (10) is the beat coupling contribution, the importance of which has been realized only more\nrecently ([13, 21–25]). Our notation here requires some explanation (see also section V). Consistent with our discussion\nin the previous section, quantities evaluated at k = 0 should really be interpreted in terms of an effective zero mode\narising from contributions at k < 2π/L, i.e. P0lin = V h|δ0lin |2 i ≈ P lin (k ∼ π/L), generated by continuum contributions\nT (k + ǫ, −k + ǫ′ , k′ + ǫ′′ , −k′ + ǫ′′′ ) with ǫ + ǫ′ = −(ǫ′′ + ǫ′′′ ) ∼ π/L. Moreover, F2 , given by\n\u0012\n\u0013\n5 k̂1 * k̂2 k1\n2\nk2\nF2 (k1 , k2 ) = +\n+ (k̂1 * k̂2 )2 ,\n+\n(12)\n7\n2\nk2\nk1\n7\nis at first sight not well defined if one of the arguments equals 0. F2 (−0, k) (and the other affected term) should thus\nbe interpreted as a limit\nZ\ndΩǫ̂\nF2 (−ǫ, k),\n(13)\nF2 (−0, k) =\n4π\n\n1\n\nNote that the factor 16 in Eq. (7) of [8] should be a factor 8.\n\n\f5\nwith |ǫ| ∼ π/L (see section V for a more rigorous treatment of the beat coupling term with the same result). The\nintegral over the direction of ǫ makes this quantity well defined.\nUsing the fact that\nZ\ndΩk1\n17\nF2 (k1 , k2 ) =\n,\n(14)\n4π\n21\nthe beat coupling term can be angle (or bin) averaged analytically so that we end up with\n\u0012 \u00132\n17\nT̄ij = T̄ij0 + 16\nP0lin .\nPklin\nPklin\nj\ni\n21\n\n(15)\n\nPhysically, the presence of the beat coupling term is an interesting interplay of mode mixing due to the window\nfunctions with correlations between pairs of non-linear modes and one larger mode (see [21]). Due to the finite volume\nfrom which the power spectrum is measured, the estimator P̂ (k) really consists of a weighted average of pairs of\ndensity modes δ(k + ǫ) δ(−(k + ǫ′ )), with |ǫ| of order of the fundamental mode 2π/L. For k in the non-linear regime,\nsuch pairs correlate with the large scale perturbation δ(ǫ′ − ǫ), which in turn causes the covariance between the power\nspectrum estimators to be proportional to the power in these large modes. In our description, this is captured by\nthe power in the effective zero mode. Note that the beat coupling creates an excess both in the variance and in the\noff-diagonal elements of the covariance matrix.\nD.\n\nThe Local Average Effect\n\nWhile the beat coupling term derived in the previous section adds significant covariance on non-linear scales, there is\nan additional effect coupling small scale covariance to power in the zero-mode that plays a role in the power spectrum\nestimated from an actual survey. This second effect is caused by the fact that to obtain the overdensity δ, one needs\nan estimate of the average density ρ̄. In a realistic survey, one does not know the true average number density of, say,\ngalaxies, but instead has to rely on an estimate of the average density within the survey volume, which is modulated\nby the zero mode δ0 . This results in a decrease in covariance, partially canceling the beat coupling effect2 . We will\nrefer to this contribution as the local average effect.\nThe local average effect causes the true overdensity estimator to be given by\nδ̃k ≡\n\nδk\n.\n1 + δ0\n\n(16)\n\nSince ρ̄ also appears in the numerator of δ, there technically is also a δ0 contribution there. However, the Fourier\ntransform of the zero mode for non-zero wave vector k vanishes so this term can be omitted. Eq. (16) can be expanded\nin powers of δ0 to derive expressions for the n-point functions to the desired order in perturbation theory. For example,\nto next-to-leading order, the expectation value of the power spectrum estimator becomes\nhP̃ˆk i ≡ hδ̃k δ̃−k i\n\u0001\u0001\n= V hδk δ−k 1 − 2δ0 + 3δ02 + O δ03 i\n\u0001\nBk,−k,0\nP0\n= Pk − 2\n+3\nPk + O P 3 /V 2 .\nV\nV\n\n(17)\n\nThe expectation value of the angle-averaged estimator is then\n\n\u0001\n2 68\n3\nhP̃ˆi i = Pki −\nPki P0 + Pki P0 + O P 3 /V 2\nV\n\u0013\n\u0012 V 21\n\u0001\n73 P0\n+ O P 3 /V 2 .\n= Pki 1 −\n21 V\n\n(18)\n\n−4\nHence, the power spectrum receives a small bias due to the local average effect. The relative correction is <\n∼ 10 for\n−3\n3\na 1h Gpc survey so it can be safely ignored for a realistic survey. Here, we have used that the bispectrum ([13])\n\nBk,k′ ,k′′ = 2 Pk Pk′ F2 (k, k′ ) + (cyclic)\n\n2\n\nThe difference between using the true and the local average was also commented on briefly in [29]\n\n(19)\n\n\f6\nand we have applied the identity (14) to carry out the angle averaging.\nUsing the same approach for the covariance matrix, one gets to next to leading order\n\u0012 \u00132\n2Pk2i K T̄ij0\nP0lin 188 lin lin P0lin\n17\nC̃ij = hP̃ˆi P̃ˆj i − hP̃ˆi i hP̃ˆj i =\nPklin\nPklin\nδij +\n+ 16\n−\nP P\n,\nj\ni\nNi\nV\n21\nV\n21 ki kj V\n\n(20)\n\nwhere we have ignored a small relative correction to the diagonal term of order P0lin /V . The local average effect thus\nintroduces a term of the same form as the beat coupling term from the previous section, proportional to Pki Pkj P0 /V ,\nbut with opposite sign. Comparing the coefficients, one finds that the two effects almost entirely cancel out, leaving\n\u0001\n17 2\n− 188\nonly a small positive coefficient, 16 21\n21 ≈ 1.5 ∼ 10% of the original beat coupling coefficient. Note that the\nlocal average effect to this order consists of contributions from the bispectrum and trispectrum, but also from terms\nthat would even be there had the field remained completely Gaussian (but that happen to be of the same order as\nthe leading non-Gaussian corrections).\nEq. (20) thus gives us an expression for the most realistic case we will consider, where modes larger than the survey\nare present and the spectrum is estimated using the local average in the survey volume.\nE.\n\nTheory Summary and Outlook\n\nIn the remainder of this article, we will use N-body simulations to test the expressions derived above. We will\nconsider three different cases which allow us to separately constrain different combinations of contributions to the\ntotal covariance:\n• Case 1: periodic box\nThe spectrum is estimated from the full, periodic simulation volume. In this case, there is no beat coupling nor\na local average effect and the prediction for the covariance is to leading order\nCij =\n\n2Pk2i K T̄ij0\nδ +\n.\nNi ij\nV\n\n(21)\n\nWe obtain the (non-linear) power spectrum appearing above by applying the Halofit3 prescription [30] to the\nlinear power spectrum calculated using CAMB [31]. The bin-averaged trispectrum T̄ij0 is given by Eq. (11),\nwhere we make one modification. Instead of using the linear power spectra, we use the non-linear spectra. This\nis consistent to the desired order in perturbation theory and turns out to slightly improve the accuracy of the\nmodel on strongly non-linear scales.\n• Case 2: subbox of periodic box\nSince modes larger than the \"survey volume\" are now present, there is a beat coupling effect. The leading order\ncovariance prediction is\n\u0012 \u00132\n2Pk2i K T̄ij0\nP0\n17\nPki Pkj\nδij +\n+ 16\n.\n(22)\nCij =\nNi\nV\n21\nV\nNote that also for the additional trispectrum terms, we choose to use the non-linear power spectrum as opposed\nto the linear one.\n• Case 3: subbox of periodic box, using subbox mean\nThis is the most realistic case, where not only there are modes larger than the survey, but the overdensity\nδ = (ρ(x) − ρ̄)/ρ̄ is calculated in terms of the average density ρ̄ of the subbox, as opposed to the \"true\" average\ndensity of the full box. The leading order part of the covariance matrix is given by\nC̃ij =\n\n2Pk2i K T̄ij0\nP0\n676\nδ +\n+\nPk Pk\n.\nNi ij\nV\n441 i j V\n\n(23)\n\nIn the next section, we first describe the details of our simulations. We will discuss the results of our comparison\nin section IV.\n\n3\n\nWe have checked that the difference between using the Halofit spectrum and the average simulated spectrum is small for k < 0.4h/Mpc.\n\n\f7\nIII.\n\nN-BODY SIMULATIONS\n\nIn order to test our analytic predictions we use a large suite of N-body simulations. We have two sets of simulations\nconsisting of 160 runs of a 2400h−1Mpc box with 7683 particles and 1024 runs of a 600h−1 Mpc box with 1923 particles.\nThe initial conditions of the 160 and 1024 simulations were set up using different realizations of a Gaussian random\nfield with the power spectrum given by CAMB. We adopted a flat ΛCDM cosmology consistent with the current\nobservational constraints [32]. The cosmological parameters are the present-day matter fraction Ωm = 0.27, Hubble\nconstant h = 0.7, baryon fraction Ωb h2 = 0.023, spectral index ns = 0.95, and present-day normalization σ8 = 0.7913.\nThe particles were displaced from their initial grid points according to second-order Lagrangian perturbation theory\nusing an initial redshift zi = 19.\nThe simulations were performed with the Tree-PM code Gadget-2 [33] taking only the gravitational force into\naccount. We applied a force softening of 70h−1 kpc and used a particle mesh of 20483 and 5123 for the 2400h−1Mpc\nand 600h−1Mpc runs, respectively. Using a much higher resolution simulation, we checked that with these simulation\nsettings the power spectrum derived from the simulation data is accurate at the 1% level up to k < 0.2hMpc−1 and\nremains accurate within 4% up to k < 0.4hMpc−1 at all redshifts.\nTo compute the power spectrum from the simulation data, we assign the particles using the cloud-in-cell (CIC)\nscheme to a regular grid with a fixed grid spacing of 1.5625h−1Mpc in all cases (full box, subbox, subbox with\nzero-padding). Hence, the Nyquist frequency of the grid is the same in all cases, kNy ≈ 2h−1 Mpc, which is 5 times\nlarger than the scales we consider in this paper k < 0.4hMpc−1 . Therefore we expect the effects due to finite grid\nsize (smearing and aliasing effects) to be very small. Nevertheless, we do correct for the smearing due to the CIC\nassignment [34].\nThe simulations and the power spectrum computation needed about 300, 000 CPU hours on our in-house cluster\nHipatia at ICCUB.\nIV.\n\nRESULTS\n\nWe now compare the simulation results to the analytic predictions summarized in section II E. For the covariances\nof the full periodic box (Case 1), we compare to the 1024 simulations of the 600h−1Mpc cubed volume and to the\n160 simulations of the 2400h−1Mpc cubed volume. To study the subbox Cases 2 & 3, we divide the L = 2400h−1Mpc\nvolume into 64 smaller boxes with side L/4 = 600h−1 Mpc each, which provides us with 160 × 64 = 10, 240 different\nsubbox realizations.\nFor each volume, we estimate the power spectrum P̂i in isotropic bins of width ∆k = 0.01hMpc−1 in the range\nk = 0 − 0.4hMpc−1 . We then estimate the covariance matrix for the full box, or for a particular subbox of it, by\nĈij =\n\nX\n1\n(P̂i − hP̂i i)(P̂j − hP̂j i),\nNr − 1 r\n\n(24)\n\nwhere the sum runs over all Nr simulation realizations and hP̂i i is the average power spectrum over simulations. In\nthe subbox case, we then improve the accuracy by averaging the subbox covariance estimate in Eq. (24) over all 64\nsubboxes. Note that, since the subboxes living in the same simulation volume are not independent, it would be wrong\nto directly apply Eq. (24) to all Nr = 10, 240 subboxes.\nSince the non-linear effects discussed in section II become stronger with time, it is interesting to consider the\ncovariance matrix for a range of redshifts from z = 2 − 0. We expect our analytic predictions to have the largest range\nof validity at z = 2, as non-linear effects there are smallest.\nIn Fig. 1, we show results for the variances in the power spectrum, normalized by the variance based on mode\ncounting and the linear power spectrum. Case 1 is tested by both the full L = 2400h−1Mpc box case (black dots N-body results, black dashed - analytic) and the full L = 600h−1Mpc box case (red). The blue dots and dashed lines\ntest Case 2 and the green ones test Case 3. For all cases and at all redshifts, we find good agreement between theory\nand simulation for bins up to a maximum value kmax that lies in the non-linear regime. The values for kmax are\nreasonable given the range of scales over which perturbation theory is expected to be applicable, kmax ∼ 0.4hMpc−1\nat z = 2 to kmax ∼ 0.15 − 0.2hMpc−1 at z = 0.\nWe now comment on the three scenarios of interest individually.\n• Case 1: periodic box\nThe L = 600h−1 Mpc and L = 2400h−1Mpc full-box simulation results agree very well with each other, as\nexpected because they are both described by Case 1 and have no beat coupling. They also agree well with the\nanalytic prediction. This confirms that excess covariance is not simply caused by the mere presence of large\n\n\f14\n\nL\n\n12\n\nL\n\nLbox/\n\nL\n\nLbox/\n\n10\n\nL\n\n8\n6\n\n=L\n\nbox\n\n14\n\n=2400\n\nPT (no BC), 2400Mpc box\n=\n4 =600 (true avg)\nPT (with BC), 600Mpc box\n=\n4 =600 (local avg)\nPT (with BC & local avg effect)\n=L\n\nbox\n\nvariance/linear mode-counting variance\n\nvariance/linear mode-counting variance\n\n8\n\n=600\n\nPT (no BC), 600Mpc box\nz\n\n4\n\n=2.0\n\n2\n0\n0.00\n\n0.05\n\n0.10\n\n0.15\n\n[\n\n0.20\n\nMpc]\n\n0.25\n\n0.30\n\n0.35\n\n12\n10\n8\n6\n\n=1.5\n\n2\n0\n0.00\n\n0.40\n\nz\n\n4\n\n0.05\n\n0.10\n\n0.15\n\nk h/\n\n12\n10\n8\nz\n\n4\n\n=1.0\n\n2\n0\n0.00\n\n0.20\n\nMpc]\n\n0.25\n\n0.30\n\n0.35\n\n0.40\n\n0.25\n\n0.30\n\n0.35\n\n0.40\n\n14\nvariance/linear mode-counting variance\n\nvariance/linear mode-counting variance\n\n14\n\n6\n\n[\n\nk h/\n\n0.05\n\n0.10\n\n0.15\n\n[\n\n0.20\n\nMpc]\n\n0.25\n\n0.30\n\n0.35\n\n12\n10\n8\n6\n\n=0.5\n\n2\n0\n0.00\n\n0.40\n\nz\n\n4\n\n0.05\n\n0.10\n\n0.15\n\nk h/\n\n[\n\n0.20\n\nMpc]\n\nk h/\n\nvariance/linear mode-counting variance\n\n14\n12\n10\n8\n6\n\nz\n\n4\n\n=0.0\n\n2\n0\n0.00\n\n0.05\n\n0.10\n\n0.15\n\n[\n\n0.20\n\nk h/\n\nMpc]\n\n0.25\n\n0.30\n\n0.35\n\n0.40\n\n2\nFIG. 1: Power spectrum variance relative to variance based on linear spectrum and mode counting (2Plin\n/Nk with Nk the\nnumber of modes per bin) for redshifts z = 0 − 2. The dots are results from N-body simulations and the (dashed) lines theory\npredictions from Eqs (21)-(23), using perturbation theory (PT). The results in black and red represent the case where no modes\nlarger than the survey are present (but other non-linear contributions are included). The blue results represent the case where\nthese modes are present and thus display large excess covariance due to beat coupling. In the most realistic case (green), the\nlarge modes also affect the power spectrum through the estimated average density and this local average effect reduces the\nexcess covariance by ∼ 90%.\n\n\f9\n\nL\n\n=L\n\nbox\n\n1.0\n\n=2400\n\nL\n\n1.0\n\n=L\n\n4 =600\n\n/\n\nbox\n\n0.8\n\n(true avg)\n\u0001\n\ncorrelation coefficient\n\ncorrelation coefficient\n\nPT (no BC), 2400Mpc box\n\nPT (with BC), 600Mpc box\nL\n\n=L\n\n4 =600\n\n/\n\nbox\n\n(local avg)\n\nPT (with BC & local avg effect)\nL\n0.5\n\n=L\n\nbox\n\n=600\n\nPT (no BC), 600Mpc box\n\n0.0\n\nz\n-0.5\n0.00\n\n0.05\n\n0.10\n\n0.15\n\n[\n\n0.20\n\n]\n\n0.25\n\n=2.0\n\n0.30\n\n0.35\n\n0.6\n\n0.4\n\n0.2\n\n0.0\n\n-0.2\n\nz\n-0.4\n\n0.40\n\n0.00\n\n0.05\n\n0.10\n\n0.15\n\nk h/Mpc\n\n0.20\n\n]\n\n0.25\n\n0.30\n\n0.35\n\n0.40\n\nk h/Mpc\n\n1.0\n\n1.0\n\n0.8\n\n0.8\n\u0003\n\ncorrelation coefficient\n\n\u0002\n\ncorrelation coefficient\n\n[\n\n=1.5\n\n0.6\n\n0.4\n\n0.2\n\n0.0\n\n-0.2\n\nz\n-0.4\n\n0.00\n\n0.05\n\n0.10\n\n0.15\n\n[\n\n0.20\n\n]\n\n0.25\n\n=1.0\n\n0.30\n\n0.35\n\n0.6\n\n0.4\n\n0.2\n\n0.0\n\n-0.2\n\nz\n-0.4\n\n0.40\n\n0.00\n\n0.05\n\n0.10\n\n0.15\n\nk h/Mpc\n\n[\n\n0.20\n\n]\n\n0.25\n\n0.30\n\n=0.5\n0.35\n\n0.40\n\nk h/Mpc\n\n1.0\n\n0.8\n\ncorrelation coefficient\n\n\u0004\n\n0.6\n\n0.4\n\n0.2\n\n0.0\n\n-0.2\n\nz\n-0.4\n\n0.00\n\n0.05\n\n0.10\n\n0.15\n\n[\n\n0.20\n\n]\n\n0.25\n\n0.30\n\n=0.0\n0.35\n\n0.40\n\nk h/Mpc\n\np\nFIG. 2: Correlation coefficients ρij ≡ Cij / Cii Cjj of i-th bin at k on x-axis, relative to j-th bin at k = 0.04 − 0.05hMpc−1 .\nSame comparisons and color coding as in Fig. 1. The beat coupling causes a significant increase in the off diagonal correlations\n(blue), but this is again undone by the local average effect (green). The effect is described well by Eqs (21)-(23).\n\n\f10\n\nL\n\n=L\n\nbox\n\n1.0\n\n=2400\n\nPT (no BC), 2400Mpc box\nL\n\n1.0\n\n=L\n\n4 =600\n\n/\n\nbox\n\n0.8\n\n(true avg)\n\u0006\n\ncorrelation coefficient\n\ncorrelation coefficient\n\n\u0005\n\nPT (with BC), 600Mpc box\nL\n\n=L\n\n4 =600\n\n/\n\nbox\n\n(local avg)\n\nPT (with BC & local avg effect)\nL\n0.5\n\n=L\n\nbox\n\n=600\n\nPT (no BC), 600Mpc box\n\n0.0\n\nz\n-0.5\n0.00\n\n0.05\n\n0.10\n\n0.15\n\n[\n\n0.20\n\n]\n\n0.25\n\n=2.0\n\n0.30\n\n0.35\n\n0.6\n\n0.4\n\n0.2\n\n0.0\n\n-0.2\n\nz\n-0.4\n\n0.40\n\n0.00\n\n0.05\n\n0.10\n\n0.15\n\nk h/Mpc\n\n0.20\n\n]\n\n0.25\n\n0.30\n\n0.35\n\n0.40\n\nk h/Mpc\n\n1.0\n\n1.0\n\n0.8\n\n0.8\n\b\n\ncorrelation coefficient\n\n\u0007\n\n0.6\n\n0.4\n\n0.2\n\n0.0\n\n-0.2\n\nz\n-0.4\n\n0.00\n\n0.05\n\n0.10\n\n0.15\n\n[\n\n0.20\n\n]\n\n0.25\n\n=1.0\n\n0.30\n\n0.35\n\n0.6\n\n0.4\n\n0.2\n\n0.0\n\n-0.2\n\nz\n-0.4\n\n0.40\n\n0.00\n\n0.05\n\n0.10\n\n0.15\n\nk h/Mpc\n\n[\n\n0.20\n\n]\n\n0.25\n\n0.30\n\n=0.5\n0.35\n\nk h/Mpc\n\n1.0\n\n0.8\n\ncorrelation coefficient\n\ncorrelation coefficient\n\n[\n\n=1.5\n\n0.6\n\n0.4\n\n0.2\n\n0.0\n\n-0.2\n\nz\n-0.4\n\n0.00\n\n0.05\n\n0.10\n\n0.15\n\n[\n\n0.20\n\n]\n\n0.25\n\n0.30\n\n=0.0\n0.35\n\n0.40\n\nk h/Mpc\n\nFIG. 3: As in Fig. 2, but here correlation coefficients relative to bin at k = 0.09 − 0.1hMpc−1 are shown.\n\n0.40\n\n\f11\n\nL\n\n=L\n\nbox\n\n1.0\n\n=2400\n\nL\n\n1.0\n\n=L\n\n4 =600\n\n/\n\nbox\n\n0.8\n\n(true avg)\n\ncorrelation coefficient\n\ncorrelation coefficient\n\nPT (no BC), 2400Mpc box\n\nPT (with BC), 600Mpc box\nL\n\n=L\n\n4 =600\n\n/\n\nbox\n\n(local avg)\n\nPT (with BC & local avg effect)\nL\n0.5\n\n=L\n\nbox\n\n=600\n\nPT (no BC), 600Mpc box\n\n0.0\n\nz\n-0.5\n0.00\n\n0.05\n\n0.10\n\n0.15\n\n[\n\n0.20\n\n]\n\n0.25\n\n=2.0\n\n0.30\n\n0.35\n\n0.6\n\n0.4\n\n0.2\n\n0.0\n\n-0.2\n\nz\n-0.4\n\n0.40\n\n0.00\n\n0.05\n\n0.10\n\n0.15\n\n0.8\n\n0.8\n\ncorrelation coefficient\n\n1.0\n\n0.6\n\n0.4\n\n0.2\n\n0.0\n\n-0.2\n\nz\n-0.4\n\n0.00\n\n0.05\n\n0.10\n\n0.15\n\n[\n\n0.20\n\n]\n\n[\n\n0.20\n\n]\n\n0.25\n\n0.30\n\n0.35\n\n0.40\n\nk h/Mpc\n\n1.0\n\n0.25\n\n=1.0\n\n0.30\n\n0.35\n\n0.6\n\n0.4\n\n0.2\n\n0.0\n\n-0.2\n\nz\n-0.4\n\n0.40\n\n0.00\n\n0.05\n\n0.10\n\n0.15\n\nk h/Mpc\n\n[\n\n0.20\n\n]\n\n0.25\n\n0.30\n\n=0.5\n0.35\n\nk h/Mpc\n\n1.0\n\n0.8\n\u000e\n\ncorrelation coefficient\n\ncorrelation coefficient\n\nk h/Mpc\n\n=1.5\n\n0.6\n\n0.4\n\n0.2\n\n0.0\n\n-0.2\n\nz\n-0.4\n\n0.00\n\n0.05\n\n0.10\n\n0.15\n\n[\n\n0.20\n\n]\n\n0.25\n\n0.30\n\n=0.0\n0.35\n\n0.40\n\nk h/Mpc\n\nFIG. 4: As in Fig. 2, but here correlation coefficients relative to bin at k = 0.14 − 0.15hMpc−1 are shown.\n\n0.40\n\n\f12\nmodes. The following two cases show that what matters is the presence of modes larger than the \"survey\"\nvolume.\n• Case 2: subbox of periodic box\nBeat coupling introduces a large amount of excess variance and is well described by perturbation theory (for\nthe range of scales discussed above).\n• Case 3: subbox of periodic box, using subbox mean\nAs expected from theory, the local average effect undoes most of the excess variance due to beat coupling. Given\nthe noise in the simulation results, the Case 3 simulation results do not distinguish with much significance the\nCase 3 theory prediction from the Case 1 prediction (but certainly from the Case 2 prediction). However, the\nCase 3 simulation results do clearly display a larger variance than the Case 1 results at large k, looking consistent\nwith having ∼ 10% of the beat coupling excess variance.\nIn Figs. 2 - 4, we quantify the off diagonal correlations by plotting the correlation coefficients between bins,\nCij\nρij = p\n,\nCii Cjj\n\n(25)\n\nwhere we keep one bin fixed and let the value of k corresponding to the other one vary on the horizontal axis. The\nfixed bins are at k ≈ 0.05hMpc−1 (Fig. 2), k ≈ 0.1hMpc−1 (Fig. 3) and k ≈ 0.15hMpc−1 (Fig. 4).\nThe conclusions for the correlation coefficients are similar to those drawn about the variances and again the analytic\nand numerical results agree well. In fact, for Cases 2 & 3, there now is good agreement up to k = 0.4hMpc−1 for all\nredshifts. We do note that the correlations relative to the k ≈ 0.05hMpc−1 bin appear to be overestimated somewhat\nby the analytic expressions. However, this is because the variance from simulations in the k = 0.04 − 0.05hMpc−1 bin\nis somewhat high due to noise. Since this variance appears in the denominator of Eq. (25), it brings the simulation\ncorrelation coefficients down, thus explaining the slight disagreement with the analytic result. The other deviation is\nthat the correlation coefficients relative to the bins at wave number (k ≈ 0.1hMpc−1 and k ≈ 0.15hMpc−1 ) are higher\nthan expected for Case 1 at low redshift. Whereas they should theoretically not have a beat coupling contribution,\nthese correlation coefficients behave as if they do get such a contribution similar to the one in the scenario with beat\ncoupling and the local average effect (Case 3). This may simply be due to non-linear effects beyond the order included\nin our theoretical expressions. Other than this, the agreement is very good.\nTo conclude this section, we use our analytic expressions to quantify the importance of non-linear corrections to the\ncovariance matrix on a range of scales relevant to large scale structure surveys. In the left panel of Fig. 5, we show\nthe theory based variance, at redshift zero, taking into account all non-linear effects (green), and taking into account\neverything except for the beat coupling and local average effects (red). The figure is the same as in Fig. 1, except that\nthe focus is on the theory curves in the range k = 0 − 0.2h/Mpc. We see that the full non-linear corrections change\nthe variance at the 25% level at k = 0.15h/Mpc and by ∼ 50% at k = 0.2h/Mpc. For comparison, we also show\nin dashed blue the variance if we do not take into account the reduction in excess variance due to the local average\neffect. Neglecting to take the latter effect into account would lead to a gross overestimate of the non-linear variance.\nTo quantify the effect of not only the non-linear corrections to the diagonal of the covariance matrix, but also of\nthe non-diagonal elements, we next calculate the squared signal-to-noise ratio,\nX\n(26)\nC−1\n(S/N )2 (kmax ) ≡\nki ,kj P (ki ) P (kj ).\nki ,kj <kmax\n\nThe sum here is over all pairs of power spectrum bins with both central k values below kmax . For P (ki ), we use\nthe (non-linear) power spectrum in the fiducial model, so that S/N can be thought of as a detection (or amplitude)\nsignal-to-noise. The top figure of the right panel of Fig. 5 shows this statistic using a (diagonal) linear covariance\nmatrix (based on mode counting; black curve), the full non-linear matrix (green), and the non-linear matrix with\nthe off-diagonal elements set to zero (dashed green). The bottom figure shows the relative difference with the linear\nsignal-to-noise squared. Compared to the linear case, the non-linear, but diagonal covariance matrix indeed decreases\nthe signal-to-noise, as expected from the increase in variance seen in the right panel. However, the off-diagonal\nelements have a significantly stronger effect and decrease the signal-to-noise even further. The signal-to-noise gives an\nidea of how much Fisher matrix elements in a parameter forecast, or χ2 values in a Monte Carlo chain, are affected\nby the non-linear corrections to the covariance matrix. This means that when a power spectrum study, whether with\nreal data or in a Fisher forecast, includes k modes well into the non-linear regime, it is not enough to just include\nnon-linear corrections into the variance of the power spectrum. Instead, the full non-linear covariance matrix needs\nto be taken into account.\n\n\f13\n\nvariance/linear mode-counting variance\n\n12000\n1.6\n\ncumulative (S/N)2\n\n10000\n\n1.4\n1.2\n\n0.8\n0.00\n\nPT, with BC, no local avg effect\nPT, with BC & local avg effect\nPT, no BC & no local avg effect\n0.05\n\n[\n\nz\n\n0.10\n\n=0.5\n\n0.15\n\nMpc]\n\n6000\n4000\n2000\n0\n0.0\n-0.2\n-0.4\n-0.6\n-0.8\n0.00\n\nz\n\n=0.5\n\nrel. diff.\n\n1.0\n\n8000\n\nlinear\nnon-linear\nnon-linear, diagonal only\n\n0.20\n\n0.05\n\nk h/\n\n[\n\n0.10\n\nMpc]\n\n0.15\n\n0.20\n\nk h/\n\n2\nFIG. 5: Left Panel: Power spectrum variance relative to variance based on linear power spectrum and mode counting (2Plin\n/Nk\nwith Nk the number of modes per bin) for redshift z = 0.5. The red curve represents the case where no modes larger than\nthe survey are present (but other non-linear contributions are included). The most realistic case is depicted in green and\nincludes the beat coupling and local average effects. Non-linear effects cause an increase of variance of up to 50% on scales\nk < 0.2h/Mpc. The dashed blue curve shows the variance when the local average effect is not taken into account. Right Panel:\nCumulative signal-to-noise squared in the amplitude of the non-linear power spectrum (see text for details) as a function of\nlargest k-bin included (top; bottom shows fractional difference relative to the linear matrix). The non-linear, off-diagonal terms\nin the covariance matrix give the strongest contribution to the decrease in signal-to-noise at large k.\n\nV.\n\nGENERAL SURVEY GEOMETRY\n\nSo far, we have found it convenient to describe the statistics of the density field in terms of a discrete set of\noverdensity modes. Whereas this is exact when considering the modes of a full periodic box, this should be considered\nan effective description in the case of subboxes, justified by their simple geometry. In this section, we work out\nthe formalism for a general survey geometry in terms of the continuum of Fourier modes that exist in an infinite\nuniverse. We closely follow the notation and results of [7], but will add to this the trispectrum contributions arising in\nperturbation theory. The discussion in this section will provide justification for the discrete description of the previous\nsections. One issue that we will pay particular attention to is the motivation for using the diagonal mode-counting\nexpression for the disconnected part of the covariance matrix in Eq. (9). As we will see, in the FKP formalism, the\nwindow function correlates power spectrum estimators in different bins (even in the Gaussian case), and the mode\ncounting expression is not accurate. We will explain why mode counting was justified in the previous sections, argue\nthat for a realistic survey the FKP description including cross correlations is the relevant one, and finally test the\nlatter description against simulations.\nWe first define our Fourier convention as\nZ\nd3 k ı̇k*x\nδ(x) =\ne\nδ(k).\n(27)\n(2π)3\nThe statistics of the continuum of Fourier modes are given by\nhδ(k) δ(k′ )i = (2π)3 P (k) δ D (k + k′ )\nhδ(k) δ(k′ ) δ(k′′ )i = (2π)3 B(k, k′ , k′′ ) δ D (k + k′ + k′′ )\nhδ(k) δ(k′ ) δ(k′′ ) δ(k′′′ )ic = (2π)3 T (k, k′ , k′′ , k′′′ ) δ D (k + k′ + k′′ + k′′′ )\n...\n\n(28)\n\nFor a survey with background number density n̄(x), consider then the weighted density field\nF (x) = \u0002R\n\nn̄(x) w(x) δ(x)\n\n\u0003 1 ≡ G(x) δ(x),\nd3 x n̄2 (x) w2 (x) 2\n\n(29)\n\n\f14\nwhere w(x) is a weight function that can be chosen to maximize signal to noise. We will ignore shot noise in the\nfollowing, but it is straightforward to include it in the Gaussian approximation (see FKP). The Fourier transform\nis given by F (k) = (G ∗ δ)(k), where \"∗\" indicates a convolution, and the power spectrum can be estimated by\nP̂ (k) = |F (k)|2 , so that\nZ 3 ′\nd k\nhP̂ (k)i =\nP (k ′ ) |G(k − k′ )|2 .\n(30)\n(2π)3\nThe measured power spectrum is thus a weighted average of the true spectrum, with a weight function of width of\norder the fundamental mode of the survey, i.e. ∆k ∼ π/L if L is the typical scale of the survey. As a relevant example,\nthe window function for a cubic box of side L (n̄ ≡ const, w ≡ 1 inside the box and zero outside) is given by\nG(k) = L3/2 j0 (Lkx /2) j0 (Lky /2) j0 (Lkz /2) ,\n\n(31)\n\nwith j0 (x) = sin x/x the zeroth spherical Bessel function. If the true spectrum varies little across this range of scales,\nwe get\nhP̂ (k)i ≈ P (k).\nA.\n\n(32)\n\nCovariances - disconnected (Gaussian) contribution\n\nWe first consider the contribution to the covariance between FKP power spectrum estimators arising from products\nof two-point functions. This is the only contribution for a Gaussian density field and we can follow FKP for its\ndescription.\nWe start from the two-point function\nZ\nk′′\nhF (k) F ∗ (k′ )i =\nP (k ′′ ) G(k − k′′ ) G∗ (k′ − k′′ ) ≈ P (k) Q(k′ − k′ ),\n(33)\n(2π)3\nwhere the second equality is true in the same limit where the (expectation value of the) power spectrum estimator\nequals the true spectrum, and Q(k) is the Fourier transform of the (normalized) squared window function,\nQ(x) = R\n\nHence, the covariance\n\nn̄2 (x) w2 (x)\n.\nd3 x n̄2 (x) w2 (x)\n\nhδ P̂ (k) δ P̂ (k′ )i ≈ |P (k) Q(k − k′ )|2 + (k′ → −k′ ).\n\n(34)\n\n(35)\n\nIn FKP, the power spectrum in a bin i is given by\nP̂i =\n\nZ\n\ni\n\nd3 k\nP̂ (k),\nVk,i\n\n(36)\n\nwhere Vk,i is the k-volume of bin i, so that the covariance between (isotropic) bins is\nZ 3 Z 3 ′\nd k\nd k 2\nCij = 2\nP (k) |Q(k − k′ )|2 .\ni Vk,i\nj Vk,j\n\n(37)\n\nBecause of the extended nature of the window function |G|2 , there will thus be correlations between different bins. In\nthe limit that the bin width is much larger than the width of this window function, these correlations are negligible\nand one can make a further simplification by integrating out |G|2 . Using\nR 3 4\nZ\nd x n̄ (x) w4 (x)\nd3 k\n−1\n2\n|Q(k)|\n=\n(38)\n\u00032 ≡ Veff\n\u0002R\n(2π)3\nd3 x n̄2 (x) w2 (x)\none ends up with\n\nCij =\n\n2P 2 (ki ) K\nδij ,\nNk\n\nNk =\n\nVk,i\n,\n(2π)3 /Veff\n\n(39)\n\n\f15\nwhere ki is a typical mode in the i-th bin and we have further assumed that the power spectrum varies little across a\nbin. This is the well know mode-counting result. The expression for the effective volume is further simplified in FKP\nby choosing an optimal weight function, but we will stick to general w(x). Note that for our cubic box (or any other\ngeometry with constant background number density and weighting), Veff = V .\nAssuming that embedding our Lsub = 600h−1Mpc cubed box in a L = 2400h−1Mpc cubed periodic box is a good\napproximation to embedding it in an infinite universe with a continuum of Fourier modes, we can apply the above\nto our simulated scenario and find that for our bin width ∆k = 0.01hMpc−1 , there should be significant correlations\nbetween bins and the mode-counting argument is not valid, in fact overpredicting the variances. We show this in\nfigures 6 - 9, dashed lines, which we will discuss in more detail below.\nWhy then was it correct to use the diagonal, mode-counting expression in the previous sections? The reason is\nthat, in keeping with our effective periodic box description, our bin average only includes modes which are multiples\nof the subbox's fundamental mode, i.e. k = 2π/Lsub n with the components of n integers,\n1 X\nP̂i =\nP̂ (k).\n(40)\nNi\nk∈i\n\nThis decorrelates the binned power spectrum estimators as the mode mixing kernel\nQ(k) = j0 (Lsub kx /2) j0 (Lsub ky /2) j0 (Lsub kz /2)\n\n(41)\n\nvanishes for separations that are a non-zero multiple of 2π/Lsub . Since the kernel equals unity for zero separation,\nthe covariance in this averaging scheme is given by the mode-mixing result,\nCij = 2\n\n1 1 X 2\n2P 2 (ki ) K\n1 1 XX 2\nK\nP (k) |Q(k − k′ )|2 = δij\n2\nP (k) =\nδij .\nNi Nj\nNi Nj\nNi\n′\nk∈i k ∈j\n\n(42)\n\nk∈i\n\nThis begs the question if a similar binning scheme can be applied to an actual survey, in order to decorrelate\npower spectrum estimates in different bins. Unfortunately, for a realistic survey, the geometry will be much more\ncomplicated than a simple cube, making this rather difficult. In practice, therefore, one would typically embed the\nsurvey in a much larger cubic volume (zero-padding the part not covered by the survey), apply a Fourier transform,\nestimate the power spectrum for each k on the grid by the embedding box (i.e. modulo 2π/L with L the size of the\nlarge box), and finally average to obtain the binned spectrum. This is thus a much denser sampling than the one\nwe applied previously and approaches the infinitely dense FKP bin average of Eq. (36). In a more realistic scenario\ntherefore, mode counting would not be sufficient and the off diagonal covariances are significant.\nFor this reason, it is useful to numerically test the mode mixing in the covariance matrix due to the window function\nas given in Eq. (37). We do this by again calculating the covariance matrix for our Lsub = 600h−1Mpc subbox, but\nthis time using a binned spectrum averaged over all multiples of the fundamental mode of the large L = 2400h−1Mpc\nsimulation box, thus increasing the sampling density by a factor of 43 = 64 and approaching the FKP bin average. In\npractice, we zero-pad the exterior of the subbox and then apply the Fourier transform to the full box. The results are\nshown in figures 6 - 9 and compared to the analytic expression (37). To model the inevitable non-linear effects, we\nadd trispectrum contributions to the theory prediction, which we will describe in the next subsection. Even without\nthese contributions however, we can already see from the linear regime that the FKP expression works very well and\nthat indeed with the more realistic averaging scheme, the off diagonal covariances are considerable and the variances\nare reduced accordingly.\nTo conclude this subsection, we briefly compare our beat coupling investigation to that of [25]. They too study the\nbeat coupling effect by considering a subbox of a larger simulation volume (although in their case the subbox is only\na factor 23 = 8 smaller than that of the simulation, Lsub = 500h−3Mpc3 ). They use two approaches for estimating\nthe power spectrum. Their \"zero-padding\" treatment corresponds to the FKP-like method described in the preceding\nparagraphs, while the other approach is equivalent to the one we used consistently before this section. While they\ndo not comment on the origin of the observed differences, it is reassuring that the simulation results in their Fig.(10)\nagree with our explanation and with our own simulation results. Interestingly, in [25], the excess covariance due to\nlarge modes is significantly smaller than expected based on beat coupling only. However, they use the local (subbox)\naverage to calculate the overdensity. The lower variance can thus be explained very well by the local average affect\ndiscussed in this article.\nB.\n\nGeneral Survey Geometry: Perturbation Theory\n\nThe discussion in the previous section covers the linear regime where the underlying density field is to a good\napproximation Gaussian. Including non-linear effects, it still describes the disconnected contribution to the covariance\n\n\f16\n\n5\n4\n\n=L\n\nL\n\n3\nz\n\n4 =600\n\n/\n\nbox\n\nvariance/linear mode-counting variance\n\nvariance/linear mode-counting variance\n\n5\n\n(local avg)\nPT (with BC & local avg effect)\n=\n4 =600 (local avg) zero padded\nPT (with BC & local avg effect) zero padded\nL\n\nLbox/\n\n=2.0\n\n2\n1\n\n0\n0.00\n\n0.05\n\n0.10\n\n0.15\n\n[\n\n0.20\n\nMpc]\n\n0.25\n\n0.30\n\n0.35\n\n4\n3\nz\n\n2\n1\n\n0\n0.00\n\n0.40\n\n=1.5\n\n0.05\n\n0.10\n\n0.15\n\nk h/\n\n0.20\n\nMpc]\n\n0.25\n\n0.30\n\n0.35\n\n0.40\n\n0.25\n\n0.30\n\n0.35\n\n0.40\n\n5\nvariance/linear mode-counting variance\n\nvariance/linear mode-counting variance\n\n5\n4\n3\nz\n\n=1.0\n\n2\n1\n\n0\n0.00\n\n[\n\nk h/\n\n0.05\n\n0.10\n\n0.15\n\n[\n\n0.20\n\nMpc]\n\n0.25\n\n0.30\n\n0.35\n\n4\n3\nz\n\n2\n1\n\n0\n0.00\n\n0.40\n\n=0.5\n\n0.05\n\n0.10\n\n0.15\n\nk h/\n\n[\n\n0.20\n\nMpc]\n\nk h/\n\nvariance/linear mode-counting variance\n\n5\n4\n3\nz\n\n=0.0\n\n2\n1\n\n0\n0.00\n\n0.05\n\n0.10\n\n0.15\n\n[\n\n0.20\n\nk h/\n\nMpc]\n\n0.25\n\n0.30\n\n0.35\n\n0.40\n\nFIG. 6: Power spectrum variance relative to (linear) mode-counting variance at redshifts z = 0 − 2 for Case 3, i.e. with both\nbeat coupling and the local average effect included. Comparison is between variances in spectrum averaged over bins (of width\n∆k = 0.01hMpc−1 ) with fine sampling (as in FKP, Eq. (40)), which has mode mixing due to the window function (magenta\ndots), and average over modes that are multiples of fundamental mode of subbox (Eq. (36)), which decorrelates the power\nspectrum estimator in bins (green dots). We also refer to the former case as the \"zero padding\" covariance matrix, as the power\nis estimated from simulations by using the full 2400h−1 Mpc simulation box to do the Fourier transform, but zero padding the\nregion outside the 600h−1 Mpc subbox. Dashed lines show theory predictions from Eq. (23) (green) and Eq. (48) (magenta).\nThe theory covariance matrix thus successfully includes window function effects and non-linear effects. On large scales (small\nk), the green curve and dots approach unity because the bin averaging scheme causes the variance to be given by mode counting\nand because non-linear effects vanish. The more realistic zero padding case however has significantly lower variances, but strong\ncorrelations between neighboring bins (even on linear scales) so that the total information content is the same.\n\n\f17\n\n1.0\n\n0.8\n\n=L\n\nL\n\n=L\n\n1.0\n\n4 =600\n\n(local avg)\n\n4 =600\n\n(local avg) zero padded\n\n/\n\nbox\n\n/\nbox\n\n0.8\n\nPT (with BC & local avg effect)\n\u0010\n\ncorrelation coefficient\n\n\u000f\n\ncorrelation coefficient\n\nL\n\nPT (with BC & local avg effect) zero padded\n0.6\n\n0.4\n\n0.2\n\n0.0\n\n-0.2\n\nz\n-0.4\n\n0.00\n\n0.05\n\n0.10\n\n0.15\n\n[\n\n0.20\n\n]\n\n0.25\n\n=2.0\n\n0.30\n\n0.35\n\n0.6\n\n0.4\n\n0.2\n\n0.0\n\n-0.2\n\nz\n-0.4\n\n0.40\n\n0.00\n\n0.05\n\n0.10\n\n0.15\n\nk h/Mpc\n\n0.20\n\n]\n\n0.25\n\n0.30\n\n0.35\n\n0.40\n\nk h/Mpc\n\n1.0\n\n1.0\n\n0.8\n\n0.8\n\u0012\n\ncorrelation coefficient\n\n\u0011\n\ncorrelation coefficient\n\n[\n\n=1.5\n\n0.6\n\n0.4\n\n0.2\n\n0.0\n\n-0.2\n\nz\n-0.4\n\n0.00\n\n0.05\n\n0.10\n\n0.15\n\n[\n\n0.20\n\n]\n\n0.25\n\n=1.0\n\n0.30\n\n0.35\n\n0.6\n\n0.4\n\n0.2\n\n0.0\n\n-0.2\n\nz\n-0.4\n\n0.40\n\n0.00\n\n0.05\n\n0.10\n\n0.15\n\nk h/Mpc\n\n[\n\n0.20\n\n]\n\n0.25\n\n0.30\n\n=0.5\n0.35\n\n0.40\n\nk h/Mpc\n\n1.0\n\n0.8\n\ncorrelation coefficient\n\n\u0013\n\n0.6\n\n0.4\n\n0.2\n\n0.0\n\n-0.2\n\nz\n-0.4\n\n0.00\n\n0.05\n\n0.10\n\n0.15\n\n[\n\n0.20\n\n]\n\n0.25\n\n0.30\n\n=0.0\n0.35\n\n0.40\n\nk h/Mpc\n\np\nFIG. 7: As Fig. 6, but here showing the correlation coefficients ρij ≡ Cij / Cii Cjj of i-th bin at k on x-axis, relative to j-th\nbin at k = 0.04 − 0.05hMpc−1 . The theory predictions again agree quite well with the simulation results although more so for\ncorrelations relative to bins at larger k, as shown in Figs 8 and 9. Note in particular the large correlation between neighboring\nbins in the case where the bin average is based on fine sampling/zero padding (Eq. (36), magenta). This is due to mode mixing\nby the window function and is separate from the cross correlations due to non-linear evolution. It is absent when estimators\nare averaged using the sparse bin sampling (green), Eq. (40).\n\n\f18\n\n1.0\n\n1.0\n\nz\n\n0.8\n\n=2.0\n\n0.6\n\n0.4\n\n0.2\n\n0.0\n\n-0.2\n\nL\n\n=L\n\n/\n\nL\n\n=L\n\n/\n\nbox\n\nbox\n\n4 =600\n\n(local avg)\n\n4 =600\n\n(local avg) zero padded\n\nz\n\n0.8\n\u0015\n\ncorrelation coefficient\n\ncorrelation coefficient\n\n\u0014\n\n=1.5\n\n0.6\n\n0.4\n\n0.2\n\n0.0\n\n-0.2\n\nPT (with BC & local avg effect)\n-0.4\n\n0.00\n\n-0.4\n\nPT (with BC & local avg effect) zero padded\n0.05\n\n0.10\n\n0.15\n\n[\n\n0.20\n\n]\n\n0.25\n\n0.30\n\n0.35\n\n0.40\n\n0.00\n\n0.05\n\n0.10\n\n0.15\n\nk h/Mpc\n\n1.0\n\nz\n\n0.8\n\n=1.0\n\n]\n\n0.25\n\n0.30\n\nz\n\n0.8\n\ncorrelation coefficient\n\n\u0017\n\n0.6\n\n0.4\n\n0.2\n\n0.0\n\n-0.2\n\n-0.4\n\n0.35\n\n0.40\n\n=0.5\n\n0.6\n\n0.4\n\n0.2\n\n0.0\n\n-0.2\n\n-0.4\n\n0.05\n\n0.10\n\n0.15\n\n[\n\n0.20\n\n]\n\n0.25\n\n0.30\n\n0.35\n\n0.40\n\n0.00\n\n0.05\n\n0.10\n\n0.15\n\nk h/Mpc\n\n[\n\n0.20\n\n]\n\n0.25\n\nk h/Mpc\n\n1.0\n\nz\n\n0.8\n\u0018\n\ncorrelation coefficient\n\ncorrelation coefficient\n\n0.20\n\n1.0\n\n\u0016\n\n0.00\n\n[\n\nk h/Mpc\n\n=0.0\n\n0.6\n\n0.4\n\n0.2\n\n0.0\n\n-0.2\n\n-0.4\n\n0.00\n\n0.05\n\n0.10\n\n0.15\n\n[\n\n0.20\n\n]\n\n0.25\n\n0.30\n\n0.35\n\n0.40\n\nk h/Mpc\n\nFIG. 8: As Fig. 7, but correlations relative to bin at k = 0.09 − 0.1hMpc−1 .\n\n0.30\n\n0.35\n\n0.40\n\n\f19\n\n1.0\n\n1.0\n\nz\n\n0.8\n\n=2.0\n\n0.6\n\n0.4\n\n0.2\n\n0.0\n\n-0.2\n\nL\n\n=L\n\n/\n\nL\n\n=L\n\n/\n\nbox\n\nbox\n\n4 =600\n\n(local avg)\n\n4 =600\n\n(local avg) zero padded\n\nz\n\n0.8\n\u001a\n\ncorrelation coefficient\n\ncorrelation coefficient\n\n\u0019\n\n=1.5\n\n0.6\n\n0.4\n\n0.2\n\n0.0\n\n-0.2\n\nPT (with BC & local avg effect)\n-0.4\n\n0.00\n\n-0.4\n\nPT (with BC & local avg effect) zero padded\n0.05\n\n0.10\n\n0.15\n\n[\n\n0.20\n\n]\n\n0.25\n\n0.30\n\n0.35\n\n0.40\n\n0.00\n\n0.05\n\n0.10\n\n0.15\n\nk h/Mpc\n\n1.0\n\nz\n\n0.8\n\n=1.0\n\n]\n\n0.25\n\n0.30\n\nz\n\n0.8\n\ncorrelation coefficient\n\n\u001c\n\n0.6\n\n0.4\n\n0.2\n\n0.0\n\n-0.2\n\n-0.4\n\n0.35\n\n0.40\n\n=0.5\n\n0.6\n\n0.4\n\n0.2\n\n0.0\n\n-0.2\n\n-0.4\n\n0.05\n\n0.10\n\n0.15\n\n[\n\n0.20\n\n]\n\n0.25\n\n0.30\n\n0.35\n\n0.40\n\n0.00\n\n0.05\n\n0.10\n\n0.15\n\nk h/Mpc\n\n[\n\n0.20\n\n]\n\n0.25\n\nk h/Mpc\n\n1.0\n\nz\n\n0.8\n\u001d\n\ncorrelation coefficient\n\ncorrelation coefficient\n\n0.20\n\n1.0\n\n\u001b\n\n0.00\n\n[\n\nk h/Mpc\n\n=0.0\n\n0.6\n\n0.4\n\n0.2\n\n0.0\n\n-0.2\n\n-0.4\n\n0.00\n\n0.05\n\n0.10\n\n0.15\n\n[\n\n0.20\n\n]\n\n0.25\n\n0.30\n\n0.35\n\n0.40\n\nk h/Mpc\n\nFIG. 9: As Fig. 7, but correlations relative to bin at k = 0.14 − 0.15hMpc−1 .\n\n0.30\n\n0.35\n\n0.40\n\n\f20\nmatrix provided that the non-linear power spectrum is used. However, additional terms are now needed as the\ncovariance matrix receives contributions from the connected part of the four-point function. These terms were already\nincluded in the figures 6 - 9 (and were discussed in a simpler framework in section II). Here we discuss the details of\nthe inclusion of the trispectrum terms for arbitrary window function.\nIncluding these terms, the covariance between single-mode estimators now becomes\nhδ P̂ (k) δ P̂ (k′ )i = |P (k) Q(k − k′ )|2 + (k′ → −k′ )\nZ\n1\n+\nd3 q1 d3 q2 d3 q3 d3 q4 δ D (q1 − q2 + q3 − q4 ) G(q1 )G∗ (q2 )G(q3 )G∗ (q4 )\n(2π)9\n× T (k − q1 , −(k − q2 ), k′ − q3 , −(k′ − q4 )).\n\n(43)\n\nNote that this is the generalization of Eq. (8), which we used to describe the covariance in a cubic box. To leading\norder in perturbation theory, the trispectrum is given by4 (see [8])\nT (k1 , k2 , k3 , k4 ) = 4 [F2 (k12 , −k1 ) F2 (k12 , −k3 ) P (k1 ) P (k12 ) P (k3 ) + perm.]+6 [F3 (k1 , k2 , k3 ) P (k1 ) P (k2 ) P (k3 ) + cyc.] ,\n(44)\nwith 12 distinct permutations for the first term, 3 cyclic permutations for the second, and where kij ≡ ki + kj .\nInserting the arguments from Eq. (43) into this perturbation theory expression, and omitting the qi dependence\nwhenever qi appears in an argument as a correction to a larger vector of order k, k ′ , |k + k′ |, etc, the trispectrum\ncontribution becomes\nh\ni\n2\nT (k − q1 , −(k − q2 ), k′ − q3 , −(k′ − q4 )) = 4 P (|k + k′ |) (F2 (k + k′ , −k) P (k) + (k → k′ )) + (k′ → −k′ )\n+ 4 P (k) P (k ′ ) P (|q2 − q1 |) (F2 (q2 − q1 , k) + F2 (q2 − q1 , −k)) (F2 (q2 − q1 , k′ ) + F2 (q2 − q1 , −k′ ))\n+ 12 P (k) P (k ′ ) [F3 (k, −k, k′ ) P (k) + (k ↔ k′ )]\n\n(45)\n\nwhere we have used that the trispectrum arguments sum up to zero. The terms that are independent of the qi 's can\n−1\nbe pulled out of the integral in Eq. (43) so that the integral over mode mixing kernels simply gives a factor of Veff\n.\nThe other terms only depend on the combination q1 − q2 so that three of the four Fourier integrals can be carried\nout analytically and one remains, giving the result\nhδ P̂ (k) δ P̂ (k′ )i = |P (k) Q(k − k′ )|2 + (k′ → −k′ )\ni\n1 h\n2\n+\n4 P (|k + k′ |) (F2 (k + k′ , −k) P (k) + (k ↔ k′ )) + (k′ → −k′ )\nVeff\n1\n+\n12 P (k) P (k ′ ) [F3 (k, −k, k′ ) P (k) + (k ↔ k′ )]\nVeff\n\u0012Z\n\u0013−1\nd3 u\n1\n′\n2\n4 P (k) P (k )\n|Q| (u)\n+\nVeff\n(2π)3\nZ\nd3 u\n×\n|Q|2 (u)P (u) (F2 (u, k) + F2 (u, −k)) (F2 (u, k′ ) + F2 (u, −k′ )) ).\n(2π)3\n\n(46)\n\nThe final step towards a covariance matrix is to apply the bin average to Eq. (46), but for the trispectrum terms\nthe subtle, averaging related effects described in the previous subsection are not important because the correlations\nfrom the trispectrum are not as narrow as those for the disconnected (or Gaussian) terms. The angle averaging can be\ndone analytically for the last term (the beat coupling term) and has to be carried out numerically for the remaining\ntrispectrum contributions. The final result is\nZ 3 Z 3 ′\nd k 2\nd k\nP (k) |Q(k − k′ )|2\nCij = 2\nVk,i\nVk,j\nZ 3 Z 3\n1\nd k\nd k 0\n+\nT (k, −k, k′ , −k′ )\nVeff\nVk,i\nVk,i\n\u0012 \u00132 \u0012Z\n\u0013−1 Z\nd3 u\n1\n17\nd3 u\n2\n+\n16\n|Q|\n(u)\n|Q|2 (u)P (u),\n(47)\nVeff\n21\n(2π)3\n(2π)3\n\n4\n\nUnlike in section II, but consistent with perturbation theory, we now immediately express perturbation theory quantities in terms of\nthe non-linear power spectrum P and not P lin .\n\n\f21\nwhere T 0 (k, −k, k′ , −k′ ) represents the second and third lines of Eq. (46). The last term is the beat coupling term,\nwhich can now explicitly be seen to be proportional to a weighted average of the power spectrum over large modes. The\nintegral describing this average can be compared to that for the expectation value of the zero-mode power spectrum,\nEq. (30). The only difference is that the latter is given in terms of G while the former is given in terms of Q (note that\nthe normalization integral appearing in the beat coupling term is equal to one when Q is replaced by G). However,\nfor a cubic box (with n̄ ≡ const, w ≡ 1 inside the box), the two quantities are exactly equal and the average appearing\nin the beat coupling expression above can be replaced by the zero-mode power spectrum, thus justifying our use of\nP0lin in Eq. (15) in section II B.\nWe will not rederive the correction due to the local average effect for the case of arbitrary geometry, but in analogy\nwith the cubic subbox case, we will use the following expression for Case 3 in Figs 6-9:\nZ 3 Z 3 ′\nd k\nd k 2\nCij = 2\nP (k) |Q(k − k′ )|2\nVk,i\nVk,j\nZ 3 Z 3\n1\nd k\nd k 0\n+\nT (k, −k, k′ , −k′ )\nVeff\nVk,i\nVk,i\n\u0012Z\n\u0013−1 Z\nd3 u\n1 676\nd3 u\n2\n|Q|\n(u)\n|Q|2 (u)P (u).\n(48)\n+\nVeff 441\n(2π)3\n(2π)3\nNote that for a varying background density, the estimate of the background density ρ̄(x) used in δ(x) = (ρ(x) −\nρ̄(x))/ρ̄(x) is not only affected by the effective zero mode, but also by smaller modes. These will also affect the\ncovariance matrix, but we will not go into this effect here, as it is beyond the topic we set out to study.\nVI.\n\nSUMMARY AND DISCUSSION\n\nIn this work, we have studied the effects of modes larger than the survey on the (dark matter) power spectrum\ncovariance matrix. We have built an analytic description that includes the beat coupling effect of [21], but also the\npreviously overlooked (at least in analytic studies) effect of large modes on the estimated average density ρ̄ which\nenters the overdensity through δ = (ρ − ρ̄)/ρ̄ (the local average effect). We have confirmed this model and the role\nof individual contributions by comparing to covariance matrices obtained from N-body simulations. To study the\nrole of super-survey modes in the simulations, we estimated the power spectrum from a subvolume embedded in a\nconsiderably larger simulation volume.\nWe summarize our main results below:\n• We build a model based on perturbation theory for the matter covariance matrix that includes the effects of\nmodes larger than the survey. For the variances, we find excellent agreement with simulations for k < 0.4hMpc−1\n(or larger) at z = 2 and for k < 0.2(0.15)hMpc−1 at z = 0.5(0). Agreement is even better for the correlation\ncoefficients, with our model predicting the correct coefficients for at least k < 0.4hMpc−1 at all redshifts.\n• When isolated, the beat coupling effect from [21, 22], can indeed be described by the last term in Eq. (22), as\nshown by the blue points and curves of Figs 1-4.\n• In a more realistic approach, the local average effect needs to be taken into account as well. This has previously\nbeen overlooked in analytic studies and we derive its effect using perturbation theory, leading to Eq. (23). It\nreduces the covariance, leaving only 10% of the original beat coupling excess covariance, as shown by the green\nlines and points in Figs 1-4. This also explains the disagreement found between the beat coupling-only expression\nand simulations in [25]. We conclude that the beat coupling excess covariance is not as important as previously\nthought.\n• Eq. (48) gives the final result for the matter covariance matrix for arbitrary survey geometry, including not only\nthe above mentioned effects, but also the correlations between neighboring power spectrum bins and the related\nreduced variance due to the survey's window function. It is depicted in Figs 6-9 and again agrees well with\nsimulations. It can be used as a first step towards a covariance matrix for the galaxy (or other tracer's) power\nspectrum.\nIn a real survey of large scale structure, the effects discussed in this paper are relevant because there are always modes\nlarger than the survey volume. Our results are thus important for large scale structure surveys and in particular galaxy\nsurveys, as we quantify the expected excess covariance due to these modes, as well as the more standard covariance\n\n\f22\ncontributions. With a complete description of the covariance matrix now available, it is also possible to study the\ncosmology dependence of the covariance matrix in an efficient manner. We refer to the Appendix for a first look into\nthis issue.\nTo build a complete covariance matrix for the galaxy power spectrum, one needs to include the effects of shot\nnoise, galaxy bias and redshift space distortions. While the effect of shot noise is easy to incorporate within the FKP\nformalism (at least in the limit where the shot noise can be treated as Gaussian), the other effects are more complicated\nand clearly beyond the scope of our paper. However, a very rough first approximation to a galaxy covariance matrix\ncould be obtained by multiplying the dark matter matrix by the galaxy bias to the fourth power, including an angle\naveraged Kaiser factor (as in [25]) to account for redshift space distortions, and using FKP to include the effect of\nshot noise.\nIn addition to the complications arising from observing galaxies (or other tracers) instead of dark matter, one also\nneeds to be able to describe the covariance for a realistic survey geometry (not many surveys have a cubic footprint).\nFor this reason, we presented in section V a full description of the model for arbitrary survey geometry, assuming\nthe FKP estimator is used. By comparing to simulations, we showed that the expressions from [7] (with trispectrum\nterms added) can be used to accurately describe the mode mixing due to the survey window function and the resulting\ncorrelations between neighboring power spectrum bins. While section V does not present any completely new results\nrelative to the previous sections and what is in the literature, its main purpose is to present a complete set of equations\nto describe the matter power spectrum for arbitrary survey geometry. This can then serve as a stepping stone towards\na full galaxy covariance matrix.\nAcknowledgments\n\nWe thank Ryuichi Takahashi, Masahiro Takada and Shun Saito for useful discussion and for sharing their simulation\noutputs, which helped motivate our investigation. We also thank Beth Reid for insightful discussions. RdP and CW are\nsupported by FP7-IDEAS-Phys.LSS 240117. OM is supported by AYA2008-03531 and the Consolider Ingenio project\nCSD2007-00060. LV acknowledges support of FP7-IDEAS-Phys.LSS 240117. N-body simulations and calculations on\nN-body outputs were done on the cluster of computers Hipatia (UB computing facilities and ERC grant FP7- IDEAS\nPhys.LSS 240117).\nAppendix A: Cosmology Dependence of Covariance Matrix\n\nOne major advantage of the analytic expressions presented in this work, is that they allow for a quick estimate of\nthe covariance matrix, especially compared to methods using N-body simulations. The ease with which covariance\nmatrices can be calculated makes the analytic method perfectly suited for studying the cosmology dependence of\nthe covariance matrix. A full study of this cosmology dependence would consider how constraints on cosmological\nparameters are affected and would quantify the error induced by ignoring the cosmology dependence. Such an\ninvestigation is beyond the scope of this article and we will leave it for future work. In this appendix, we will simply\nquantify how much the covariance matrix changes as we vary individual cosmological parameters.\nFor simplicity, we again consider the covariance in the matter power spectrum, as estimated from a cubic volume\nwith V = L3 = (600h−1Mpc)3 . We imagine the spectrum is \"measured\" at redshift z = 0.5 and include the smearing\neffect due to the window function that arises when the FKP estimator is used. In other words, we will consider the\ncovariance matrix given by Eq. (48), with the power spectrum evaluated at z = 0.5.\nIn practice, galaxy surveys typically measure the power spectrum relative to a fixed, fiducial background cosmology,\nsee e.g. [35]. Therefore, when a Monte Carlo chain is run, the theoretical power spectrum at each point in parameter\nspace needs to be rescaled to account for the effect of using the fiducial background cosmology as opposed to the\nactual background cosmology at that point in parameter space. Only after this rescaling can it be compared to the\nobserved spectrum. For consistency, we therefore also rescale the covariance to the fiducial background cosmology,\nCf (∆ki , ∆kj ) = A−6 C(∆ki /A, ∆kj /A)|V =Vf A3 ,\n\n(A1)\n\nwhere Cf is the covariance matrix of the power spectrum estimator relative to the fiducial background cosmology, C\nthe true covariance matrix given by Eq. (48) (evaluated at the actual volume V = Vf A3 , with Vf the survey volume\ncalculated in the fiducial cosmology), ∆ki the bin widths, and A ≡ dV (z)/dfV (z) the dilation factor (see [35]).\nSince the different terms in the covariance matrix scale either like the second or third power of the power spectrum,\nwe expect a significant dependence on σ8 and other parameters changing the overall normalization of the spectrum.\nThe beat coupling/local average term is particularly sensitive to the power at k <\n∼ 2π/L so that it should depend on\n\n\f23\n\nfiducial\nvary sigma_8\nvary n_s\nvary omega_m\nvary Omega_m\nvary omega_b\n\n4\n3\n\nfiducial\nvary sigma_8\nvary n_s\nvary omega_m\nvary Omega_m\nvary omega_b\n\n7000\n6000\n\ncumulative (S/N)2\n\nvariance/linear mode-counting variance\n\n5\n\n5000\n\n4000\n3000\n\n2000\n\n2\n\n1000\n0.40\n0.3\n0.2\n0.1\n0.0\n-0.1\n-0.2\n0.00\n\n0\n0.00\n\nrel. diff.\n\n1\n\n0.05\n\n0.10\n\n0.15\n\n0.20\n\nMpc\n\nk[h/\n\n0.25\n\n0.30\n\n0.35\n\n0.40\n\n0.05\n\n]\n\n0.10\n\nMpc]\n\nk[h/\n\n0.15\n\n0.20\n\nFIG. 10: Left Panel: Variance relative to linear, mode counting based variance as a function of cosmology. The black curve\nshows the fiducial cosmology, and the other curves depict the effect of varying each ΛCDM parameter by approximately twice\nits error bar expected from a large scale structure plus CMB measurement (see text, and Table I). Right Panel: The signalto-noise squared in the detection/amplitude of the power spectrum as a function of the largest included mode k (main figure).\nThe bottom inset shows the relative difference with the fiducial cosmology. Both panels show that the strongest parameter\ndependence is on σ8 and Ωm .\n\nany parameter that affects the power on very large scales. To make this more quantitative, we consider the ΛCDM\nfiducial cosmology described in section III and change each parameter p by a step ∆p, one by one, keeping the\nremaining parameters fixed. For the step sizes, we choose ∆p = 2 σp , where σp is the parameter uncertainty from [6]\n(Table 3), obtained from combining the SDSS-II Data Release 7 [36] halo power spectrum with WMAP5 [37] cosmic\nmicrowave background (CMB) data. These step sizes are indicative of the relevant parameter range in a Markov\nChain Monte Carlo (MCMC) analysis with power spectrum data. We show the fiducial parameters and their step\nsizes in Table I.\nωb\n\nωm\n\nΩm\n\nσ8\n\nns\n\nfiducial 0.023 0.1323 0.27 0.79 0.96\nstep size 0.00116 0.008 0.038 0.05 0.026\nTABLE I: Fiducial values and step sizes used to test cosmology dependence of matter covariance matrix.\n\nIn the left panel of figure 10, we show the effect on the variance of each parameter. As before, we normalize\nthe variance by the variance based on mode counting and the linear power spectrum (as calculated in the fiducial\ncosmology). The units on the horizontal axis are [hf /Mpc], where hf = 0.7 is the dimensionless Hubble parameter in\nthe fiducial model. The variance in the fiducial model is given by the black curve. As expected, the largest variation\nis obtained when varying σ8 , causing a significant increase in variance. The effect of the other parameters is much\nsmaller.\nThe effect of the parameter variations on the correlation coefficients is always below |∆ρij | <\n∼ 0.05, with ωm\ndecreasing the coefficients most, and σ8 increasing them by the largest amount. Finally, to incorporate the properties\nof the full covariance matrix in a single statistic, we calculate the squared signal-to-noise ratio in the (non-linear)\npower spectrum amplitude as a function of kmax , see Eq. (26). In a more thorough analysis, one could replace the\npower spectrum in the expression for (S/N )2 by derivatives with respect to cosmological parameters in order to create\na full Fisher matrix.\nThe right panel of figure 10 depicts this signal-to-noise squared as a function of kmax for the different cosmologies,\nwith the bottom inset showing the relative difference with respect to (S/N )2 in the fiducial model. We focus on the\nrange k = 0 − 0.2 hf /Mpc, as this is a more realistic range for a galaxy survey (due to strong non-linearities and shot\nnoise on smaller scales), and because we have seen that our approach loses accuracy on smaller scales. Consistent with\nthe picture arising from the left panel, we see again that σ8 has by far the largest effect, decreasing the signal-to-noise\n\n\f24\nby ∼ 30% (with only a weak dependence of the relative change on kmax ). The other parameters have a much more\nmodest effect (<\n∼ 10% for kmax ∼ 0.1h/Mpc). We conclude that reasonable variations in cosmic parameters can cause\n∼ 30% changes in the covariance matrix and thus in ∆χ2 values in an MCMC chain.\nFinally, we note that, for a galaxy survey, the effect of galaxy bias on the covariance matrix will be very important\nas well, and will look similar to the effect of σ8 discussed above.\n\n[1] H. Seo and D. J. Eisenstein, Astrophys. J. 598, 720 (2003), arXiv:astro-ph/0307460.\n[2] D. J. Eisenstein, I. Zehavi, D. W. Hogg, R. Scoccimarro, M. R. Blanton, R. C. Nichol, R. Scranton, H.-J. Seo, M. Tegmark,\nZ. Zheng, et al., Astrophys. J. 633, 560 (2005), arXiv:astro-ph/0501171.\n[3] S. Cole, W. J. Percival, J. A. Peacock, P. Norberg, C. M. Baugh, C. S. Frenk, I. Baldry, J. Bland-Hawthorn, T. Bridges,\nR. Cannon, et al., Mon. Not. R. Astron. Soc. 362, 505 (2005), arXiv:astro-ph/0501174.\n[4] C. Blake, E. A. Kazin, F. Beutler, T. M. Davis, D. Parkinson, S. Brough, M. Colless, C. Contreras, W. Couch, S. Croom,\net al., Mon. Not. R. Astron. Soc. p. 1598 (2011), 1108.2635.\n[5] G. Efstathiou, S. Moody, J. A. Peacock, W. J. Percival, C. Baugh, J. Bland-Hawthorn, T. Bridges, R. Cannon, S. Cole,\nM. Colless, et al., Mon. Not. R. Astron. Soc. 330, L29 (2002), arXiv:astro-ph/0109152.\n[6] B. A. Reid, W. J. Percival, D. J. Eisenstein, L. Verde, D. N. Spergel, R. A. Skibba, N. A. Bahcall, T. Budavari, J. A.\nFrieman, M. Fukugita, et al., Mon. Not. R. Astron. Soc. 404, 60 (2010), 0907.1659.\n[7] H. A. Feldman, N. Kaiser, and J. A. Peacock, Astrophys. J. 426, 23 (1994), arXiv:astro-ph/9304022.\n[8] R. Scoccimarro, M. Zaldarriaga, and L. Hui, Astrophys. J. 527, 1 (1999), arXiv:astro-ph/9901099.\n[9] A. Meiksin and M. White, Mon. Not. R. Astron. Soc. 308, 1179 (1999), arXiv:astro-ph/9812129.\n[10] A. Cooray and W. Hu, Astrophys. J. 554, 56 (2001), arXiv:astro-ph/0012087.\n[11] R. Scoccimarro and R. K. Sheth, Mon. Not. R. Astron. Soc. 329, 629 (2002), arXiv:astro-ph/0106120.\n[12] E. Sirko, Astrophys. J. 634, 728 (2005), arXiv:astro-ph/0503106.\n[13] E. Sefusatti, M. Crocce, S. Pueblas, and R. Scoccimarro, Phys. Rev. D 74, 023522 (2006), arXiv:astro-ph/0604505.\n[14] M. C. Neyrinck, I. Szapudi, and C. D. Rimes, Mon. Not. R. Astron. Soc. 370, L66 (2006), arXiv:astro-ph/0604282.\n[15] M. C. Neyrinck and I. Szapudi, Mon. Not. R. Astron. Soc. 375, L51 (2007), arXiv:astro-ph/0610211.\n[16] R. E. Smith, Mon. Not. R. Astron. Soc. 400, 851 (2009), 0810.1960.\n[17] M. Sato, T. Hamana, R. Takahashi, M. Takada, N. Yoshida, T. Matsubara, and N. Sugiyama, Astrophys. J. 701, 945\n(2009), 0906.2237.\n[18] M. C. Neyrinck, Astrophys. J. 736, 8 (2011), 1103.5476.\n[19] J. Harnois-Deraps and U.-L. Pen, ArXiv e-prints (2011), 1109.5746.\n[20] W.-H. W. Ngan, J. Harnois-Déraps, U.-L. Pen, P. McDonald, and I. MacDonald, ArXiv e-prints (2011), 1106.5548.\n[21] A. J. S. Hamilton, C. D. Rimes, and R. Scoccimarro, Mon. Not. R. Astron. Soc. 371, 1188 (2006), arXiv:astro-ph/0511416.\n[22] C. D. Rimes and A. J. S. Hamilton, Mon. Not. R. Astron. Soc. 371, 1205 (2006), arXiv:astro-ph/0511418.\n[23] M. Takada and B. Jain, Mon. Not. R. Astron. Soc. 395, 2065 (2009), 0810.4170.\n[24] B. A. Reid, D. N. Spergel, and P. Bode, Astrophys. J. 702, 249 (2009), 0811.1025.\n[25] R. Takahashi, N. Yoshida, M. Takada, T. Matsubara, N. Sugiyama, I. Kayo, A. J. Nishizawa, T. Nishimichi, S. Saito, and\nA. Taruya, Astrophys. J. 700, 479 (2009), 0902.0371.\n[26] F. Bernardeau, S. Colombi, E. Gaztañaga, and R. Scoccimarro, Physics Reports 367, 1 (2002), arXiv:astro-ph/0112551.\n[27] J. N. Fry, Astrophys. J. 279, 499 (1984).\n[28] M. H. Goroff, B. Grinstein, S.-J. Rey, and M. B. Wise, Astrophys. J. 311, 6 (1986).\n[29] M. C. Neyrinck, I. Szapudi, and A. S. Szalay, Astrophys. J. Lett. 698, L90 (2009), 0903.4693.\n[30] R. E. Smith, J. A. Peacock, A. Jenkins, S. D. M. White, C. S. Frenk, F. R. Pearce, P. A. Thomas, G. Efstathiou, and\nH. M. P. Couchman, Mon. Not. R. Astron. Soc. 341, 1311 (2003), arXiv:astro-ph/0207664.\n[31] A. Lewis, A. Challinor, and A. Lasenby, Astrophys.J. 538, 473 (2000), arXiv:astro-ph/9911177.\n[32] E. Komatsu, K. M. Smith, J. Dunkley, C. L. Bennett, B. Gold, G. Hinshaw, N. Jarosik, D. Larson, M. R. Nolta, L. Page,\net al., ArXiv e-prints (2010), arXiv:1001.4538.\n[33] V. Springel, Mon. Not. R. Astron. Soc. 364, 1105 (2005), arXiv:astro-ph/0505010.\n[34] Y. P. Jing, Astrophys. J. 620, 559 (2005), arXiv:astro-ph/0409240.\n[35] M. Tegmark, D. J. Eisenstein, M. A. Strauss, D. H. Weinberg, M. R. Blanton, J. A. Frieman, M. Fukugita, J. E. Gunn,\nA. J. S. Hamilton, G. R. Knapp, et al., Phys.Rev.D 74, 123507 (2006), arXiv:astro-ph/0608632.\n[36] K. N. Abazajian, J. K. Adelman-McCarthy, M. A. Agüeros, S. S. Allam, C. Allende Prieto, D. An, K. S. J. Anderson,\nS. F. Anderson, J. Annis, N. A. Bahcall, et al., Astrophys. J. Suppl. 182, 543 (2009), 0812.0649.\n[37] J. Dunkley, E. Komatsu, M. R. Nolta, D. N. Spergel, D. Larson, G. Hinshaw, L. Page, C. L. Bennett, B. Gold, N. Jarosik,\net al., Astrophys. J. Suppl. 180, 306 (2009), 0803.0586.\n\n\f"}