{"id": "http://arxiv.org/abs/1201.1617v2", "guidislink": true, "updated": "2012-02-07T09:54:39Z", "updated_parsed": [2012, 2, 7, 9, 54, 39, 1, 38, 0], "published": "2012-01-08T08:04:36Z", "published_parsed": [2012, 1, 8, 8, 4, 36, 6, 8, 0], "title": "Galaxy Formation in WDM Cosmology", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1201.2119%2C1201.5258%2C1201.3886%2C1201.4572%2C1201.5784%2C1201.1711%2C1201.2816%2C1201.3790%2C1201.1300%2C1201.5363%2C1201.2286%2C1201.4192%2C1201.6665%2C1201.1381%2C1201.4742%2C1201.6253%2C1201.1764%2C1201.4217%2C1201.1091%2C1201.4393%2C1201.5288%2C1201.1311%2C1201.4832%2C1201.5131%2C1201.5599%2C1201.5122%2C1201.6466%2C1201.1925%2C1201.1078%2C1201.6484%2C1201.5992%2C1201.0571%2C1201.1144%2C1201.4150%2C1201.5341%2C1201.2774%2C1201.3923%2C1201.0716%2C1201.4114%2C1201.2352%2C1201.3439%2C1201.1642%2C1201.1786%2C1201.0709%2C1201.0725%2C1201.1934%2C1201.6375%2C1201.1696%2C1201.2059%2C1201.4630%2C1201.5063%2C1201.6685%2C1201.1239%2C1201.5081%2C1201.2697%2C1201.1216%2C1201.1205%2C1201.3369%2C1201.4770%2C1201.4428%2C1201.4129%2C1201.6003%2C1201.3816%2C1201.1128%2C1201.0956%2C1201.1268%2C1201.0256%2C1201.3928%2C1201.6441%2C1201.3785%2C1201.5707%2C1201.0109%2C1201.4027%2C1201.5606%2C1201.2757%2C1201.4432%2C1201.0338%2C1201.3472%2C1201.2521%2C1201.2178%2C1201.0644%2C1201.5898%2C1201.6431%2C1201.0435%2C1201.4850%2C1201.4729%2C1201.3062%2C1201.4914%2C1201.6386%2C1201.0719%2C1201.5878%2C1201.5268%2C1201.4199%2C1201.6452%2C1201.1766%2C1201.2193%2C1201.6235%2C1201.0697%2C1201.1421%2C1201.1617%2C1201.0340&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Galaxy Formation in WDM Cosmology"}, "summary": "We investigate for the first time the effects of a Warm Dark Matter (WDM)\npower spectrum on the statistical properties of galaxies using a semi-analytic\nmodel of galaxy formation. The WDM spectrum we adopt as a reference case is\nsuppressed - compared to the standard Cold Dark Matter (CDM) case - below a\ncut-off scale ~ 1 Mpc corresponding (for thermal relic WDM particles) to a mass\nm_X=0.75 keV. This ensures consistency with present bounds provided by the\nmicrowave background WMAP data and by the comparison of hydrodynamical N-body\nsimulations with observed Lyman-{\\alpha} forest. We run our fiducial\nsemi-analytic model with such a WDM spectrum to derive galaxy luminosity\nfunctions (in B, UV, and K bands) and the stellar mass distributions over a\nwide range of cosmic epochs, to compare with recent observations and with the\nresults in the CDM case. The predicted color distribution of galaxies in the\nWDM model is also checked against the data. When compared with the standard CDM\ncase, the luminosity and stellar mass distributions we obtain assuming a WDM\nspectrum are characterized by: i) a flattening of the faint end slope and ii) a\nsharpening of the cutoff at the bright end for z \\lesssim 0.8. We discuss how\nthe former result is directly related to the smaller number of low-mass haloes\ncollapsing in the WDM scenario, while the latter is related to the smaller\nnumber of satellite galaxies accumulating in massive haloes at low redshift,\nthus suppressing the accretion of small lumps on the central, massive galaxies.\nThese results shows how a adopting a WDM power spectrum may contribute to solve\ntwo major problems of CDM galaxy formation scenarios, namely, the excess of\npredicted faint (low mass) galaxies at low and - most of all - high redshifts,\nand the excess of bright (massive) galaxies at low redshifts.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1201.2119%2C1201.5258%2C1201.3886%2C1201.4572%2C1201.5784%2C1201.1711%2C1201.2816%2C1201.3790%2C1201.1300%2C1201.5363%2C1201.2286%2C1201.4192%2C1201.6665%2C1201.1381%2C1201.4742%2C1201.6253%2C1201.1764%2C1201.4217%2C1201.1091%2C1201.4393%2C1201.5288%2C1201.1311%2C1201.4832%2C1201.5131%2C1201.5599%2C1201.5122%2C1201.6466%2C1201.1925%2C1201.1078%2C1201.6484%2C1201.5992%2C1201.0571%2C1201.1144%2C1201.4150%2C1201.5341%2C1201.2774%2C1201.3923%2C1201.0716%2C1201.4114%2C1201.2352%2C1201.3439%2C1201.1642%2C1201.1786%2C1201.0709%2C1201.0725%2C1201.1934%2C1201.6375%2C1201.1696%2C1201.2059%2C1201.4630%2C1201.5063%2C1201.6685%2C1201.1239%2C1201.5081%2C1201.2697%2C1201.1216%2C1201.1205%2C1201.3369%2C1201.4770%2C1201.4428%2C1201.4129%2C1201.6003%2C1201.3816%2C1201.1128%2C1201.0956%2C1201.1268%2C1201.0256%2C1201.3928%2C1201.6441%2C1201.3785%2C1201.5707%2C1201.0109%2C1201.4027%2C1201.5606%2C1201.2757%2C1201.4432%2C1201.0338%2C1201.3472%2C1201.2521%2C1201.2178%2C1201.0644%2C1201.5898%2C1201.6431%2C1201.0435%2C1201.4850%2C1201.4729%2C1201.3062%2C1201.4914%2C1201.6386%2C1201.0719%2C1201.5878%2C1201.5268%2C1201.4199%2C1201.6452%2C1201.1766%2C1201.2193%2C1201.6235%2C1201.0697%2C1201.1421%2C1201.1617%2C1201.0340&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We investigate for the first time the effects of a Warm Dark Matter (WDM)\npower spectrum on the statistical properties of galaxies using a semi-analytic\nmodel of galaxy formation. The WDM spectrum we adopt as a reference case is\nsuppressed - compared to the standard Cold Dark Matter (CDM) case - below a\ncut-off scale ~ 1 Mpc corresponding (for thermal relic WDM particles) to a mass\nm_X=0.75 keV. This ensures consistency with present bounds provided by the\nmicrowave background WMAP data and by the comparison of hydrodynamical N-body\nsimulations with observed Lyman-{\\alpha} forest. We run our fiducial\nsemi-analytic model with such a WDM spectrum to derive galaxy luminosity\nfunctions (in B, UV, and K bands) and the stellar mass distributions over a\nwide range of cosmic epochs, to compare with recent observations and with the\nresults in the CDM case. The predicted color distribution of galaxies in the\nWDM model is also checked against the data. When compared with the standard CDM\ncase, the luminosity and stellar mass distributions we obtain assuming a WDM\nspectrum are characterized by: i) a flattening of the faint end slope and ii) a\nsharpening of the cutoff at the bright end for z \\lesssim 0.8. We discuss how\nthe former result is directly related to the smaller number of low-mass haloes\ncollapsing in the WDM scenario, while the latter is related to the smaller\nnumber of satellite galaxies accumulating in massive haloes at low redshift,\nthus suppressing the accretion of small lumps on the central, massive galaxies.\nThese results shows how a adopting a WDM power spectrum may contribute to solve\ntwo major problems of CDM galaxy formation scenarios, namely, the excess of\npredicted faint (low mass) galaxies at low and - most of all - high redshifts,\nand the excess of bright (massive) galaxies at low redshifts."}, "authors": ["N. Menci", "F. Fiore", "A. Lamastra"], "author_detail": {"name": "A. Lamastra"}, "author": "A. Lamastra", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1111/j.1365-2966.2012.20470.x", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1201.1617v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1201.1617v2", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "13 pages, 6 figures; accepted for publication in MNRAS. Added new\n  references", "arxiv_primary_category": {"term": "astro-ph.CO", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph.CO", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1201.1617v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1201.1617v2", "journal_reference": null, "doi": "10.1111/j.1365-2966.2012.20470.x", "fulltext": "Mon. Not. R. Astron. Soc. 000, ??–?? ()\n\nPrinted 29 October 2018\n\n(MN LATEX style file v2.2)\n\nGalaxy Formation in Warm Dark Matter Cosmology\nN. Menci, F. Fiore, A. Lamastra\n\narXiv:1201.1617v2 [astro-ph.CO] 7 Feb 2012\n\nINAF - Osservatorio Astronomico di Roma, via di Frascati 33, I-00040 Monteporzio, Italy\n\n29 October 2018\n\nABSTRACT\n\nWe investigate for the first time the effects of a Warm Dark Matter (WDM) power spectrum\non the statistical properties of galaxies using a semi-analytic model of galaxy formation. The\nWDM spectrum we adopt as a reference case is suppressed - compared to the standard Cold\nDark Matter (CDM) case - below a cut-off scale ≈ 1 Mpc corresponding (for thermal relic\nWDM particles) to a mass mX = 0.75 keV. This ensures consistency with present bounds provided by the microwave background WMAP data and by the comparison of hydrodynamical\nN-body simulations with observed Lyman-α forest. We run our fiducial semi-analytic model\nwith such a WDM spectrum to derive galaxy luminosity functions (in B, UV, and K bands)\nand the stellar mass distributions over a wide range of cosmic epochs, to compare with recent\nobservations and with the results in the CDM case. The predicted color distribution of galaxies\nin the WDM model is also checked against the data. When compared with the standard CDM\ncase, the luminosity and stellar mass distributions we obtain assuming a WDM spectrum are\ncharacterized by: i) a flattening of the faint end slope and ii) a sharpening of the cutoff at the\nbright end for z . 0.8. We discuss how the former result is directly related to the smaller\nnumber of low-mass haloes collapsing in the WDM scenario, while the latter is related to the\nsmaller number of satellite galaxies accumulating in massive haloes at low redshift, thus suppressing the accretion of small lumps on the central, massive galaxies. These results shows\nhow a adopting a WDM power spectrum may contribute to solve two major problems of CDM\ngalaxy formation scenarios, namely, the excess of predicted faint (low mass) galaxies at low\nand - most of all - high redshifts, and the excess of bright (massive) galaxies at low redshifts.\nKey words: cosmology: theory - cosmology: dark matter - galaxies: formation\n\n1\n\nINTRODUCTION\n\nThe present understanding of galaxy formation in a cosmological context is based upon the collapse via gravitational instability of tiny Dark\nMatter (DM) perturbations dominating the matter contribution Ω M ≈ 0.3 to the energy density of the Universe, with baryons contributing only\na fraction Ωb ≈ 0.04. In such a context, the number density and the properties of galaxies with different mass ultimately arise from the power\nspectrum of DM perturbations at the epoch of recombination. For example, in a Universe dominated by Cold Dark Matter (CDM) the low\nthermal speed of DM particles makes the density perturbations gravitationally unstable down to mass scales negligible for galaxy formation,\nand structure formation proceeds bottom-up with the progressive collapse of larger and larger regions; massive galaxies, groups and clusters\nform by subsequent aggregations. When coupled with the evidences for a positive vacuum energy Λ dominating the energy-density of the\nUniverse (with ΩΛ ≈ 0.7 see Spergel et al. 2007), such a ΛCDM scenario appears to be consistent with a wide range of observables; from\nthe temperature anisotropies in the microwave background radiation (Komatsu et al. 2011) to the clustering of galaxies on large scales (Cole\net al. 2005).\nHowever, such observables directly probe scales from∼ 1 Gpc down to ∼ 10 Mpc. At galactic and sub-galactic scales . 1 Mpc, the\ncomputations based on N-body simulations pose several problems to the ΛCDM scenario. For example, the CDM haloes are predicted to\nhave inner density profiles much steeper than those inferred from the rotation curves of real galaxies (Moore et al. 1999, Abadi et al. 2003,\nReed et al. 2005; Madau, Diemand, Kuhlen 2008; for observations see, e.g., Gentile et al. 2007, McGaugh et al. 2007), the discrepancy\nbeing larger for dwarf galaxies (see Governato et al. 2007; Abadi et al. 2003; de Blok et al. 2008). In addition, CDM haloes are predicted to\n\n\f2\n\nMenci et al.\n\ncontain a wealth of substructure, which we expect to observe as satellite galaxies within the haloes of galaxies and groups, in contrast with\nobservations (see Klypin et al. 1999, Moore et al. 1999; see also Mateo et al. 1998).\nSince at such small scales the model predictions depend on the complex physics involved in the process of galaxy formation, part of\nthe solutions to the above problems may be of astrophysical nature. Feedback processes such as heating or winds caused by Supernovae\nexplosions and heating due to the UV background may be effective in suppressing star formation in the low-mass haloes of satellite galaxies\n(Bullock et al. 2000; Benson et al. 2002; Somerville et al. 2002; Kravtsov, Gnedin & Klypin 2004; Governato et al. 2007; Mashchenko,\nWadsley & Couchman 2008), and in flattening the the inner density profiles in both spirals and dwarfs (see Governato et al. 2007; 2010).\nHowever, the origin of the above problems may also lie, at least partially, in the shape of the CDM power spectrum, which could over\npredict the amplitude of small-scale (. 1 Mpc) perturbations. Indeed, a strong indication that this may be the case comes from the statistical\nproperties of galaxies and Active Galactic Nuclei (AGN), usually investigated in the framework of ΛCDM through semi-analytic models\nof galaxy formation (SAMs, see Kauffman, White & Guiderdoni 1993, Cole et al. 1994; Monaco, Salucci & Danese 2000, Kauffmann &\nHaenhelt 2000; Granato et al. 2004; Menci et al. 2006; Croton et al. 2006; Bower et al. 2006; Marulli et al. 2008), which connect the physical\nprocesses involving gas and star formation to the merging histories (and hence to the power spectrum) of DM haloes. All such models\n(including different astrophysical feedback process) concur in predicting an excess of small-mass galaxies compared to observations. In\nparticular: i) the predicted galaxy luminosity functions at low redshift are much steeper than observed unless a strong feedback is assumed\n(see, e.g., Somerville, Primack 1999; Cole et al. 2000; Menci et al. 2002), while at high redshifts the larger escape velocities of galaxies (due\nto their larger densities) make the feedback inefficient in suppressing star formation in low-mass objects. This results into an over-prediction\nof faint galaxies increasing with redshift when compared, e.g., with the evolution of the K-band luminosity function for 0 . z . 3 (see\nCirasuolo et al. 2010) or with the faint Lyman-break galaxies (Lo Faro et al. 2009) at z & 3; the excess of star-forming low-mass galaxies\nat z & 3 reflects into an excess of red low-mass galaxies at z ≈ 0 (see, e.g., Croton et al. 2006; Salimbeni et al. 2008). ii) The number of\ngalaxies with stellar mass M∗ . 1010 M in the Universe is systematically over predicted by all theoretical CDM models (Fontana et al.\n2006; Fontanot et al. 2009; Marchesini et al. 2009) in the whole redshift range z . 3 where the small-mass end of the mass function has been\nmeasured (see also Santini et al. 2012).\nThus, the baryonic processes (and the feedback in particular) implemented so far in all galaxy formation models do not seem able to\nprovide an explanation for the predicted excess. While it is still possible that the problem stems from a poor understanding of the laws\ngoverning star formation especially at high redshifts z & 2 (see, e.g., Krumholz & Dekel 2011), it is interesting to note that the overpredictions of low-mass objects in the CDM scenario concerns also the AGN population; recent estimates of the X-ray luminosity functions\nof AGN extending down to log L(2 -10 keV)≈ 42.75 (Fiore et al. 2011) are in sharp contrast with the large density of faint AGN predicted\nby analytic (Shankar 2009) or semi-analytic (Menci et al. 2006, 2008) models for the co-evolution of galaxies and AGNs (se also Shankar &\nMathur 2007; Wyithe & Loeb 2003; Lapi et al. 2006, Shen 2009; Shankar 2010 and references therein), even when the observed luminosity\nfunctions are corrected for the estimated fraction of obscured objects (e.g., La Franca et al. 2005).\nAlthough, individually, the above problems do not definitely rule out the CDM model due to the complexity of the baryonic physics\nrelating DM haloes with observable properties, the concurring evidences listed above call for a more radical approach, to investigate the\npossibility that the conflicts are rooted in an excess of power of the CDM spectrum at small scales, and that density perturbations could be\ndumped below same characteristic scale r f s . A natural mechanism for such a suppression is the free-streaming of DM particles on scales\nr f s ∼ v s teq , where v s is the DM thermal speed at the time of matter-radiation equality teq . For large DM velocities v s /c ≈ 0.2 (corresponding\nto a neutrino with mass ≈ 12 eV) this leads to the well-known Hot DM scenario (for a review see Primack & Gross 2000) which would yield\nr f s ≈ 25 Mpc, well above the most recent observational limits r f s . 0.1 − 1 set by the comparison of the Lyman-α forest spectra at z ≈ 2.5\nwith the N-body simulations (Viel et al. 2005; 2008). However, for DM particles with larger mass mX the streaming speed could be reduced\nso as to bring r f s close to 1 Mpc (corresponding to a mass scale M f s ≈ 109÷10 M ), consistent with present bounds but still large enough\nto affect galaxy formation. If constituted by thermal relic particles, such Warm DM (WDM) would have streaming velocities v s ∝ T X /mX ,\n−4/3\nwhere T X is the effective temperature determining the value of the WDM density ρX ∝ mX T X3 , so that r f ∝ Ω1/3\n. Thus, to lower the\nX mX\n2\nsmoothing scale r f of a factor ≈ 10 compared to the above Hot DM case, the WDM particles should have mX ∼ 1 keV if their density has\nto match the observed DM density parameter ΩX ≈ 0.25. This type of relic WDM was discussed by Peebles (1982), Bond, Szalay & Turner\n(1982), and could have a physical counterpart in the gravitino, the supersymmetric partner of the graviton, in gauge-mediated supersymmetry\nbreaking models (Pagels, & Primack 1982; see Steffen 2006 for a recent review). Another possibility is that WDM particles have never been\nin thermal equilibrium, as is the case, e.g., for sterile neutrinos created from oscillations with active neutrinos (Olive & Turner 1982; Dodelson\n& Widrow 1994; Shi & Fuller 1999; Abazajian, Fuller & Patel, 2001; Dolgov & Hansen 2002 ). A discussion on the WDM candidates can\nbe found in Colombi, Dodelson, Lawrence (1996, and references therein). For scenarios based on composite DM see Khlopov et al. (2008).\nPrevious studies based on N-body simulations have shown that WDM can resolve some of the tension between theoretical predictions\nand observations (Bode et al. 2001; Avila-Reese et al. 2001). Some simulations suggest that the density profiles of WDM haloes are shallower in the inner regions (Colin, Valenzuela, Avila-Reese 2008; see also de Vega, Salucci, Sanchez 2010), and that WDM can provide an\nexplanation for the observed kinematics of satellites of massive galaxies (Lovell et al. 2011). Simulations focussed on the halo properties and\nmass distribution in WDM scenario (see Knebe et al. 2002; Zavala et al. 2009; Polisensky & Ricotti 2011, Smith & Markovic 2011) have\nshown that there is a sensible suppression in the number of haloes with M < M f s . However, the effects of a WDM spectrum on the properties\nof galaxies at such mass scales would be best investigated with SAMs, since not only they allow to probe in detail the effects on the halo\nstatistics for M < M f s , but also they can investigate the chain of effects that such a suppression has on the baryonic processes involved in\n\n\fGalaxy Formation in WDM Cosmology\n\n3\n\ngalaxy formation: a modification of the power spectrum changes the number and the formation epoch (and hence the internal densities) of\nthe of high-redshift progenitors of local galaxies, an effect which propagates to gas cooling, to the disk sizes, and to star formation; this also\naffects both dynamical friction and binary merging, the processes determining the fate of sub-haloes associated to satellite galaxies (see, e.g.,\nSomerville & Primack 1999; Menci 2002), and consequently the stellar mass growth of large galaxies due to accretion of smaller objects;\nfinally, starbursts and AGN accretion and feedback (included in almost all state-of-the-art SAMs) induced by galaxy interactions are affected\nby the change in the number and in the properties of sub-haloes.\nIn the present paper we investigate for the first time the effects of a WDM power spectrum on the statistical properties of galaxy using\na SAM of galaxy formation. We adopt a WDM power spectrum with a power suppression (compared to the CDM spectrum) below a cut-off\nscale ≈ 1 Mpc, to retain consistency with present bounds provided by the microwave background WMAP data and by the comparison of\nhydrodynamical N-body simulations with observed Lyman-α forest (see Viel et al. 2005). In terms of the properties of the WDM particles,\nsuch a cut off scale ≈ 1 Mpc is achieved for a mass of DM particles mX ∼ 1 keV (see Sect. 2) whose free streaming length is r f s ≈ 0.2 Mpc,\ncorresponding to the wavelength of the mode for which the linear perturbation amplitude is suppressed by a factor of 2. We run our fiducial\nsemi-analytic model (Menci et al. 2006, 2008) with such a WDM power spectrum to derive galaxy luminosity functions (in B, UV, and K\nbands) and the stellar mass distributions over a wide range of cosmic epochs, to compare with recent observations (Sect. 3); the predicted\ncolor distribution of galaxies in the WDM model is also checked against the data. Our results are discussed in Sect. 4, while Sect. 5 is devoted\nto conclusions.\n\n2\n\nMETHOD\n\nThe SAM we use connects the physical processes involving baryons (physics of gas, star formation, feedback, growth of supermassive Black\nHoles) to the merging histories of DM haloes, ultimately determined by the DM initial power spectrum. In the present paper we use the\nsame model developed by Menci et al. (2005, 2006, 2008) with the same choice of free parameters; the only change is that merging trees are\ncomputed in a WDM cosmology. This allows to single out the effects of changing the DM spectrum with the same baryon physics. Note that\nin the present paper the tree resolution as been increased with respect to Menci et al. (2005) to resolve DM masses down to 107 M for both\nthe WDM and the CDM case, to better investigate the effect of changing the spectrum on the low-mass end of the mass distribution.\nHere we briefly recall the basic features of the model (for a complete description see Menci et al. 2005, 2006, 2008), and we describe\nthe power spectrum we use to compute the merging trees in the WDM cosmology.\n2.1\n\nThe Semi-Analytic Model\n\nGalaxy formation and evolution is driven by the collapse and growth of DM haloes, which originate from the gravitational instability of\noverdense regions in the primordial density field. This is taken to be a random, Gaussian density field within the \"concordance cosmology\"\n(Spergel et al. 2007), for which we adopt round parameters ΩΛ = 0.7, total matter density parameter Ω M = 0.3 (with baryons contribution\ncorresponding to Ωb = 0.04 and Hubble constant (in units of 100 km/s/Mpc) h = 0.7. The normalization of the spectrum is taken to be\nσ8 = 0.9 in terms of the variance of the field smoothed over regions of 8 h−1 Mpc. Adopting the exact best fit WMAP7 values for the above\nparameters does not change our results appreciably.\nAs cosmic time increases, larger and larger regions of the density field collapse, and eventually lead to the formation of groups and\nclusters of galaxies; previously formed, galactic size condensations are enclosed. The corresponding merging rates of the DM haloes are\nprovided by the Extended Press & Schechter formalism (EPS, see Bond et al. 1991; Lacey & Cole 1993); this depends on the variance of the\npower spectrum on a mass scale M\nZ\ndk k2\nP(k) W(kr)\n(1)\nσ2 (M) =\n2 π2\nwhere P(k) is the linear power spectrum of DM perturbations at a wavelengths k = 2π/r, M ' 1.2 1012 h2 M (r/Mpc)3 is the total mass in a\nsphere of radius r, and W is the top-hat window function (see Peebles 1993).\nThe clumps included into larger DM haloes may survive as satellites, or merge to form larger galaxies due to binary aggregations, or\ncoalesce into the central dominant galaxy due to dynamical friction (see Menci et al. 2005, 2006); in addition satellite halos are partially\ndisrupted as the density in their outer parts becomes lower than the density of the host halo within the pericentre of its orbit (see Menci et al.\n2002 for details). Since the above galaxy coalescence processes take place over time scales that grow longer over cosmic time, the number\nof satellite galaxies increases as the DM host haloes grow from groups to clusters. All the above processes are implemented in our model\nthrough a Monte Carlo realization of merging trees (generated with EPS probabilities depending on the spectrum through eq. 1) and of the\ndynamical processes affecting the sub-haloes once they are included into larger haloes, following the canonical prescriptions of SAMs.\nWe do not expect our results to be appreciably affected by uncertainties in the description of the above processes. Although some\nvariance exists between the galaxy merging times predicted by N-body simulations and the different SAMs (see De Lucia et al. 2010 for a\ndiscussion), there is an overall agreement in terms of the mass build up. Indeed, Henriques et al. (2011) compare the evolution of the K-band\nluminosity distribution predicted by three different SAMs, including the one used here and the De Lucia & Blaizot (2007) model. The latter\nmodel, which adopts galaxy merging histories extracted from high-resolution N-body simulations, differs at most by a factor two in the\n\n\f4\n\nMenci et al.\n\nluminosity of the brightest galaxies from the present SAM; since the major fraction of such effect is due to the inclusion of a Radio Mode\nAGN feedback in the De Lucia & Blaizot (2007) model (contributing to suppress the K-band luminosities by about 1 magnitude, see Croton\net al. 2006), the difference in the growth of massive galaxies due to uncertainties in the treatment of dynamical processes of sub-haloes is\nnegligible. Similar conclusions have been presented by Fontanot et al. (2009).\nWhile the above dynamical sector of the model is entirely determined by the initial power spectrum, the observable properties of\ngalaxies are determined by the physics of baryons, which is related to the DM merging trees through the canonical approach of SAMs.\nThe radiative gas cooling, the ensuing star formation and the Supernova events with the associated feedback occurring in the growing DM\nhaloes are computed for each sub-halo hosting the galaxy. The cooled gas with mass mc settles into a rotationally supported disk with radius\nrd (typically ranging from 1 to 5 kpc), rotation velocity vd and dynamical time td = rd /vd , all related to the DM sub-halo mass. The gas\ngradually condenses into stars at a rate ṁ∗ ∝ mc /td ; the stellar ensuing feedback returns part of the cooled gas to the hot gas phase at the\nvirial temperature of the halo. An additional channel for star formation implemented in the model is provided by interaction-driven starbursts,\ntriggered not only by merging but also by fly-by events between galaxies; such a star formation mode provides an important contribution to\nthe early formation of stars in massive galaxies, as described in detail in Menci et al. (2003, 2005).\nThe model also describes the growth of Black Holes (BHs) inside each DM halo from primordial seeds with mass MBH ≈ 102 M\nthrough merging between galaxies and accretion of a fraction of the cold galactic gas mc . The accretion is triggered by galaxy encounters,\nand the fraction of cold gas funnelled to the central BH is derived from the model by Cavaliere & Vittorini (2000). The active accretion\nphase of BHs corresponds to the AGN, which release part of their radiation energy in the surrounding interstellar medium, thus heating and\nexpelling part of the galactic gas (Lapi, Cavaliere, Menci 2005); the implementation of such a form of AGN feedback in the semi-analytic\nmodel is described in detail in Menci et al. (2008).\n2.2\n\nImplementing the WDM power spectrum\n\nDetailed calculations of the free-streaming scale r f s yield (see Smith & Markovic and references therein)\n\u0014 Ω h2 \u00151/3 \u0014 m \u0015−4/3\nX\nX\nr f s ≈ 0.2\nMpc\n(2)\n0.15\nkeV\nThe lighter is the DM particle the larger is the free-streaming length r f s , corresponding to the scale below which the perturbations are wiped\nout. In the case WDM is composed by relic thermalized particles, the suppression (with respect to the CDM case) of density perturbations\nin WDM scenarios is quantified through the ratio of the two linear power spectra (transfer function) which can be parametrized as (Bode,\nOstriker & Turok 2001)\n\u0015−5 μ\nPWDM (k) \u0014\n= 1 + (α k)2 μ\n,\n(3)\nPCDM (k)\nwhere the CDM power spectrum PCDM (k) is computed following Bardeen et al. (1986). Fitting integrations of the full Einstein-Boltzmann\nintegration (see Viel et al. 2005) yields μ = 1.12 and\n\u0014 Ω \u00150.11 \u0014 m \u0015−1.11 \u0014 h \u00151.22\nX\nX\nα = 0.049\nh−1 Mpc.\n(4)\n0.25\nkeV\n0.7\nThe above relation between transfer function and DM particle mass mX is valid for thermal relics; a similar relation holds for sterile neutrinos\nprovided one substitutes the mass mX with a mass m sterile = 4.43 KeV (mX /keV)4/3 (ΩWDM h2 /0.1225)−1/3 (but see Kusenko 2009 for variations\ndue to their mode of production). In both cases, the smaller the WDM mass mX (or m sterile ) the larger the suppression with respect to the\nstandard CDM spectrum. However, observational upper limits on the power suppression (corresponding to lower limits on mX ) have been\nderived by Viel et al. (2005) by comparing the observed Lyman-α forest in absorption spectra of Quasars at z = 2 − 3 with the results of\nN-body simulations run assuming different WDM power spectra of perturbations. As a result, for thermal relics a lower limit mX & 0.6 keV\nhas been obtained, corresponding to m sterile & 2.5 keV. Since our aim is to estimate the possible impact of WDM on galaxy formation, we\nshall assume the largest suppression of the DM power spectrum which is still safely above the constraints set by the Lyman-α forest; thus we\nadopt as a reference case a WDM particle mass mX = 0.75 keV, and compute the transfer function after eq. (3). The corresponding power\nspectrum, which constitutes the basic input for the merging trees at the basis of our semi-analytic model, is shown in Fig. 1. and compared\nwith the standard CDM case.\nThe power spectrum determines the merging histories and the mass distribution of DM haloes as follows; starting from a grid of parent\nDM halo masses at redshift z = 0 (whose abundance is determined from the standard Press & Schechter 1974 mass function), we fragment\nthem into progenitor masses at earlier cosmic times through a Monte Carlo simulation, with fragmentation probabilities given by the EPS\ntheory (again dependent on the power spectrum through the variance in eq. 1). By construction, the EPS probabilities lead to merging trees\nwhere - at each time level - the average number of generated DM haloes of given mass reproduces the Press & Schechter mass distribution at\nthe corresponding cosmic time. Variants in this process associated with a modified Press & Schechter approach are discussed in Sec. 4. On\nthe basis of such DM merging trees, we run our SAM. We start by populating with baryons the DM haloes at the highest redshifts (z = 10)\nin each DM merging tree; then we compute all the physical processes involving baryons as described in Sect. 2.1, thus associating a galaxy\n(with disk gas, stars and a star formation rate) to each DM halo; when the DM haloes merge, the galaxies associated with the progenitor DM\nhaloes may coalesce into a larger galaxy or survive as satellites according to the processes described in Sect. 2.1.\n\n\fGalaxy Formation in WDM Cosmology\n\n5\n\n1\n\n4\n\n2\n\n0.5\n\n0\n0\n-2\n-0.5\n-3\n\n-2\n\n-1\nlog k [h/Mpc]\n\n0\n\n1\n\n8\n\n10\n\n12\n\n14\n\n16\n\nFig. 1. - Left Panel: The linear power spectrum computed for 0.75 keV WDM particles after eqs. 3 and 4 (solid line) is compared with the CDM spectrum\n(dashed line) and with different data (see Tegmark, Zaldarriaga 2002 and references therein) derived from fluctuations of the microwave background radiation\n(WMAP measurements, circles), galaxy clustering (triangles) and Ly-α forest (squares).\nRight Panel: The rms amplitude of perturbations as a function of the mass scale corresponding to the power spectra in the left panel: solid line refers to the\nWDM case, while dashed line to CDM.\n\n3\n\nRESULTS\n\nWe now proceed to investigate the effect of implementing the WDM power spectrum on galaxy formation. We show in Fig. 2 the low redshift\nB-band galaxy luminosity function, and its UV counterpart at high redshift z = 4; the luminosity functions in WDM cosmology are compared\nwith data and with the corresponding CDM case.\nA first effect of adopting the WDM spectrum is a decrease in the number of faint objects at both low and high redshifts. This is expected\ndue to the suppression in the amplitude of initial perturbations (see Fig. 1). Quantitatively, the suppression of a factor ∼ 4 for Mb j & −15 with\nrespect to the CDM case is similar to that obtained for the halo mass function by Smith & Markovic (2011) for DM halo masses M ≈ 1010\nM for the same value of mX , and directly derives from the smaller number of low mass DM halos that collapsed at high redshift and survived\nto form faint galaxies. However, a second interesting effect of adopting a WDM power spectrum appears at low redshifts (Fig. 2, left panel);\nat bright magnitudes, the luminosity function shows a steeper cut off compared with the CDM case. This is due to the fact that in large DM\nhaloes at low redshift the growth of massive galaxies due to the accretion of low mass objects is suppressed due to the smaller number of\nsatellite galaxies which accumulate in the host DM halo.\n\nFig. 2. - Left Panel: The local b j galaxy luminosity function in the WDM model (solid line) is compared with the standard CDM case (dashed line) and with\ndata from the 2dF (Madgwick et al. 2002, squares) and Sloan (Blanton et al. 2001, hatched region) surveys. Right Panel: The predicted UV luminosity function\nof drop out galaxies at z = 4 (solid line WDM, dashed lilne CDM) is compared with data from Bouwens et al.(2007).\n\nThus, changing the power spectrum in a way consistent with present observational limits seems not only to provide a viable solution for\nthe over prediction of low-mass objects typical of CDM cosmology, but also to contribute to solve a long-standing problem of CDM models,\n\n\f6\n\nMenci et al.\n\nnamely, the over prediction of bright galaxies at low redshifts. The latter problem has been only recently alleviated by the inclusion of the\nRadio Mode feedback (see, e.g., Bower et al. 2006, Cattaneo et al. 2006; Croton et al. 2006; Kang, Jing, Silk 2006); however, at present such\na feedback, associated with a low-accretion state of BHs in massive galaxies (presumably at the origin the radio activity), does not have a\nclear observational counterpart, since the observed number of radio galaxies is much smaller than that predicted by SAMs (which need to\nassociate such a Radio Mode accretion to each massive galaxy with stellar mass M∗ ≥ 1011 M , see Fontanot et al. 2011); in addition, at\npresent the implementation of a Radio Mode still leads to predict a blue fraction of central galaxies that is too high and with an inverted\nluminosity dependence compared with what observed (see Weinmann et al. 2006).\n\nFig. 3. - Top Panel: The predicted color distributions for the WDM model at z = 0.1, 1, 2. The color code represents the fraction of galaxies that, for a given\nabsolute magnitude, are found in different color bins. Bottom Panel: Predicted rest-frame u − r color distributions for the WDM case are compared with the\nGaussian fit to the data from the Sloan survey (from Baldry et al. 2004, stars) for different magnitude bins.\n\nNote that the proposed approach leaves unchanged the baryonic mechanisms affecting the faint end (the Supernovae feedback) and\nthe bright end (the AGN feedback) of the galaxy luminosity distribution. Indeed, we have checked that adopting a WDM spectrum leaves\nunchanged the properties of the predicted color-magnitude diagram, which is still characterized by a bimodal distribution in agreement with\nobservations (see Strateva et al. 2001; Baldry et al. 2004) which start to appear already at z ≈ 1.5 − 2 as observed (see Bell et al. 2004,\nGiallongo et al. 2005); a quantitative comparison with detailed observed color distribution for different magnitudes (Fig. 3 bottom panel)\nshows an overall agreement with existing measurements , although a moderate excess of bright (Mr = −23) galaxies with u − r ≤ 2 is still\npresent. Note that such excess would be larger (to include a fraction ∼ 1/3 of bright galaxies) in the absence of AGN feedback.\nTo investigate how the two effects of adopting WDM power spectrum evolve with redshift, and thus to establish how the different\nnumber of satellites in common DM haloes affect the mass growth of galaxies in the WDM vs. the CDM case, we compare with statistical\nobservables more directly related to the stellar mass. The evolution of the K-band luminosity function in the WDM case is compared with\nthat derived for the CDM cosmology and with the observational data in the top panel of Fig. 4.; the same comparison is performed for the\nevolution of the stellar mass function in the bottom panel.\nThese two observables are related in the model since the first is computed by convolving the stellar Spectral Energy Distributions\n(SEDs) with the star formation history of the galaxy progenitors, while the latter is the time integral over the same history. The stochastic\nnature of the merging and star formation histories results in a whole distribution of computed galaxies in the MK − M∗ plane that we have\nchecked to be consisted with the observed distribution. On the observational side, the two quantities are measured in different ways. The\nK-band luminosity functions are taken from the Ultra Deep Survey (UDS), the deepest survey from the UKIRT Infra-Red Deep Sky Survey\n(UKIDSS), containing imaging in the J - and K-bands, with deep multi-wavelength coverage in B V R i' z' filters in most of the field. The\nsample contains 50,000 objects with high completeness down to K ≤ 23 (Cirasuolo et al. 2010). As for the observed stellar mass functions,\nwe compare mainly with the data from Santini et al. (2012); stellar masses were estimated by fitting a 14 bands photometry (up to 5.5 μm\n\n\fGalaxy Formation in WDM Cosmology\n\n7\n\nrest-frame) to the Bruzual & Charlot synthetic models of stellar populations; the analysis of observations taken with the Hubble Wide Field\nCamera 3 in the GOODS-S field allows to achieve an excellent determination of the low-mass-end of the distribution down to small stellar\nmasses M∗ ≈ 7.6 109 M even at the highest redshifts (z ≈ 3). Note that, while the stellar mass function constitutes a direct probe of the\neffect of WDM spectrum on the growth of stellar mass of galaxies, observational determinations of such a quantity are prone to several\nobservational uncertainties connected, e.g., to the estimate of metallicities or extinction curves necessary to derive the stellar masses, to\nthe treatment of the TP-AGB phase, or to the reconstruction of the star formation history of each galaxy, that is necessary to estimate the\nappropriate M/L ratio and that may be poorly described by simplistic models like those adopted in the stellar synthesis codes (Maraston et\nal. 2010; Lee et al. 2010). Although the above systematic uncertainties (not included in the error bars in the bottom panel of fig. 4) do not\nallow to definitely rule out any of the models on the basis of the stellar mass distribution, its flat logarithmic slope at small masses (less prone\nto the above systematics, see Marchesini et al. 2009) is better matched by the WDM model.\n\nFig. 4. - Top Panel. The evolution of the K-band luminosity functions in the WDM cosmoligy (solid line) is compared with data from Cirasuolo et al. (2010).\nDashed line refer to the standard CDM case.\nBottom Panel The evolution of the stellar mass function in the WDM cosmology (solid line) is compared with the standard CDM case (dashed); data in the\nleftmost panel are from Drory et al. (2004, squares) and Fontana et al. (2006, circles); data in all remaining panels are from Santini et al. (2012).\nIn both the upper and the lower left panels, the arrows show the range of magnitudes and stellar masses corresponding to the free streaming mass; the dispersion\ncharacterizing the above relations are related to the stochastic nature of the merging trees.\n\nThus, also in this case both effects (flattening of the faint end slope and sharpening of the cutoff at the bright end) are effective at low\nredshift, providing a substantial improvement of the fit to the observations. At higher redshifts, the flattening at the faint end remains an\napproximatively constant feature, being related to the smaller number of low mass DM halo collapsed in WDM cosmology; although models\nstill slightly overestimates the number of small-mass galaxies (with M ≤ 1010 M ) at z ≥ 0.8, the agreement is appreciably improved by the\nadoption of a WDM spectrum, a result difficult to achieve adopting different feedback or star formation recipes within the CDM framework\n(see the comparison with other SAM in CDM cosmology in Fontanot et al. 2009; Santini et al. 2012).\nInterestingly, the effect of adopting a WDM spectrum on the bright end appears at redshift 0.5 ≤ z . 0.8; this indicates that it is indeed\nrelated to the later phase of stellar mass growth in massive galaxies, that associated with the accretion of small lumps onto a central dominant\n\n\f8\n\nMenci et al.\n\ngalaxy. In fact, earlier comparison of different SAM predictions with observed K-band luminosity functions (see Henriques et al. 2011) have\nshown that the CDM over prediction of massive galaxies is caused by excessive mass growth in this redshift range.\nTo investigate this point in detail, we first show in Fig. 5 (left panel) the number of satellites (with mass M ≥ 2 109 h−1 M ) predicted\nby our SAM in the WDM case (normalized to that predicted in the CDM case) as a function of the host DM halo mass; we also compare\nour results with N-body simulations with the same lower mass limit for satellites (Bode et al. 2001). Note that the distribution of the satellite\nsuppression factor in Fig. 5 (left panel) is close to that computed from N-body simulations, although the comparison can only be approximate\nsince the distribution of the suppression factor from the N-body has been compute by Bode et al. (2001) for WDM particles with mass\nmX = 0.35 keV, while the recent simulations by Kamada (2011) and Polisensky & Ricotti (2011) - both with WDM particle mass mX = 1\nkeV- have been computed only for Milky Way-size haloes. A suppression factor ≈ 5 for Milky Way-size has been found also for mX = 0.6−1.2\nkeV by Colin et al. (2000; see also Knebe et al. 2002).\n\nFig. 5. - Left Panel: The predicted ratio of the number of satellite galaxies in the WDM cosmology over the corresponding CDM value is plotted against the\nmass of the host DM halo (solid line). We only consider satellites with M ≥ 2 109 h−1 M , in order to compare with the corresponding distribution obtained\n(for WDM particles with mass mX = 0.35 keV) from N-body simulations by Bode et al. (2001, dots). We also represent a rendition (corresponding to our\nadopted lower limit on the satellite mass) of the recent results from N-body simulations of Milky Way-sized haloes by Kodama (2011, upper hatched region)\nand Polisensky & Ricotti (2011, lower hatched region), both obtained with mX = 1 keV.\nRight Panel: The figure illustrates the fraction of stellar mass accreted (from the inclusion of all satellites) at a given redshift (x-axis) by galaxies of given\nstellar mass (y-axis): the color code represents the ratio of such quantity between the WDM and the CDM case. We also show three paths representative of the\ngrowth history of massive galaxies.\n\nThus, our SAM seems to provide a reasonable description of the effect of WDM on the the sub-halo population. The predicted suppression of the satellite number in the WDM case impacts the growth of massive galaxies since: i) they are hosted in larger and larger haloes\nfor decreasing redshifts, ii) their merging histories is dominated by the accretion of much smaller, satellite galaxies for z . 1 (see Baugh\n2006), and iii) their low star formation at low redshift affects their stellar mass growth only mildly. Such an impact, and why it becomes\nappreciable for z . 1, is better shown in the right panel of Fig. 5, where we show the fraction of stellar mass gained by accretion of satellites\nby galaxies with different stellar mass found at different redshift; the color code shows such a fraction in the WDM case normalized to that in\nthe CDM case. Note that at high redshifts, when galaxies have small stellar masses, the accretion of satellites in WDM cosmology is similar\nto that predicted in CDM scenarios, since at high redshifts merging between comparable clumps is more frequent, the number of satellites is\nhowever small, and thus the impact of minor merging on the accretion of stellar mass is small. However, as cosmic time proceeds (for z . 1),\nsatellite galaxies progressively accumulate in larger and larger DM haloes, while the merging histories of massive objects are dominated\nby the infall of small mass clumps; at this stage, the lower number of satellites predicted in the WDM scenario effectively suppresses the\naccreted stellar mass with respect to the CDM case. To better illustrate the epoch when such a suppression is effective, we also show in Fig.\n5 (right panel) the growth history of three typical massive galaxies (with mass M∗ ≈ 1012 M at z = 0); note how all such paths cross the\ntransition region (where the suppression of accretion in the WDM becomes appreciable, see the color scale) at redshifts z ≈ 0.8 − 1. This\nexplains why for z . 0.8 the population of massive galaxies shows a slower increase in the WM D case compared to CDM, as shown by Fig.\n4.\n\n\fGalaxy Formation in WDM Cosmology\n4\n\n9\n\nDISCUSSION: ROBUSTNESS WITH RESPECT TO THEORETICAL MODELLING\n\nWe turn now to discuss the robustness of our results and conclusions when the uncertainties in the theoretical modelling of the abundance of\nlow-mass DM haloes in WDM are considered. In the previous section, we adopted a straightforward extended Press & Schechter approach\nto compute the abundance of haloes for a WDM power spectrum, and to generate the DM merging trees through a Monte Carlo SAM.\nHowever, at present, uncertainties exist in the determination of the abundance of halos with masses smaller than the free streaming mass\nM f s = (4 π/3) (r f s /2)3 ρX (where r f s is given by eq. 2 and ρX is the average WDM density). There is some debate as to whether haloes with\nsuch masses can form at all (Bode et al. 2001, Wang & White 2007); recent results from numerical simulations (see Wang & White 2007;\nZavala et al. 2009) show that, when the effects of spurious clumps associated with the limited resolution of simulations are accounted for, a\nstrong suppression in the number of haloes with M ≤ M f s occurs (see also Schneider et al. 2011).\nThus, it is important to explore the maximal effect that such an uncertainty can have on our results. To this aim, we assumed a cut off in\nthe halo abundance for M ≤ M f s . Following the approach in Smith & Markovic (2011), we adopted an ad hoc suppression factor in the form\nof an error function, so that the mass function dn/dlogM in WDM becomes\n\u0014 log (M/M ) \u0015\u001b dn\ndñ\n1\u001a\n10\nfs\n=\n1 + er f\n,\ndlogM 2\nσlogM\ndlogM\n\n(5)\n\nwhere σlogM controls the logarithmic width of the step (see left panel of fig. 6). Thus, we run our Monte Carlo computations and the whole\nsemi-analytic model after suppressing the abundance of DM haloes with masses M ≤ M f s after the above equation, assuming σlogM = 0.5 (as\nin Smith & Markovic 2011) or σlogM = 0.1 (corresponding in practice to a complete suppression of the abundance of DM haloes with mass\nbelow the free-streaming mass). To implement such a suppression in our Monte Carlo realizations of merging trees, we first run a Monte\nCarlo simulation with probabilities given by the EPS theory with the WDM power spectrum (see sect. 2.1 and. 2.2). This generates a set\nof merging trees where - at each time level - the average number of generated DM haloes as a function of mass reproduces the standard\nPress & Schechter mass distribution dn/dlogM at the corresponding cosmic time; then, before running the full SAM on such merging\ntrees, we suppress the number of low-mass halos in the trees by randomly eliminating haloes of mass M with a suppression probability\nf (M) = 1 − (dñ/dlogM)/(dn/dlogM). By construction, we end up with DM merging trees where the abundance of DM halos follows eq. (5).\nNote that, when σlogM = 0.1 is adopted in eq. (5), f (M) ≈ 1 for all haloes with mass M < M f s , leading in practice to a complete removal of\nsub-M f s DM haloes from our merging trees.\n1\n\n0\n-1\n\n0\n-1\n\n-1\n\nz=0.5\n\nz=0.1\n-2\n\n-2\n\n-2\n\n-3\n\n-3\n\n-4\n\n-3\n\n-5\n-6\n\n-4\n\n-4\n\n-5\n\n-7\n-8\n\n-5\n10\n\n12\n\n14\n\n-15\n\n-18\n\n-21\n\n-24\n\n8\n\n10\n\n12\n\nFig. 6. - . Left panel: the halo mass function in our fiducial WDM case (solid line) is compared with that obtained after the adoption of a cut off (eq. 5) at the\nfree streaming scale corresponding to σlogM = 0.5 (dot-dashed line) and to σlogM = 0.1 (dotted line); the dashed line refers to the CDM halo mass function.\nCentral Panel: The uncertainty in the predicted b j -band luminosity function (the black filled area) associated with the uncertainty in the abundance of lowmass haloes in WDM: the upper envelope of the black region corresponds to the WDM predictions in Sect. 3, while the lower envelope represents the WDM\npredictions after the adoption of the sharper cut off in the halo mass distribution with σlogM = 0.02 (see eq. 5 and the corresponding dotted line in the left\npanel); data points as in left panel of fig. 2 Right Panel: same as central panel, but for the stellar mass distribution; data points as in the bottom-left panel of\nfig. 4.\n\nThe effects on the low-redshift luminosity function and on the stellar mass functions at z = 0.5 are shown in the fig. 6. The overall result\nis a further flattening of the luminosity/stellar mass functions, caused by the lack of low-mass DM haloes. However, when passing from the\nabundance of DM halos to galaxy counting (in luminosity or stellar mass bins), the effect of suppressing the abundance of sub-M f s haloes\nis smeared out over a range of luminosities/stellar masses due the concurrence of two effects. On the one hand, the effect of suppressing\nthe abundance of sub-M f s haloes is not concentrated on lowest-luminosity objects, since - even when sub-M f s haloes are allowed to form\nat some redshifts - only a fraction of the galaxies formed in them remain as an isolated clump, the remaining fraction being included into a\nlarger galaxy (with a larger luminosity/stellar mass) at some lower redshifts. On the other hand, the stochastic nature of the star formation\nhistories in SAMs results a) in a relevant fraction of the faintest galaxies to form in halos with masses M > M f s (whose abundance is not\n\n\f10\n\nMenci et al.\n\nsuppressed), and b) in a relevant fraction of sub-M f s halos (when they are allowed to form) to host galaxies with extremely low stellar mass\nand star formation rate, so that they contribute only to luminosity and stellar masses well below the observational threshold.\nThus, the theoretical uncertainty on the abundance of DM halos with M < M f s results in the uncertainty regions for the predicted\nluminosity and stellar mass functions shown in fig. 6. A similar degree of uncertainty is obtained for all the luminosity functions shown in\nSect. 4, illustrating how our basic conclusions are robust with respect to present uncertainties in the modelling of sub-M f s WDM haloes.\n\n5\n\nSUMMARY AND CONCLUSIONS\n\nIn this paper we investigated the effect of assuming a WDM power spectrum on galaxy formation using a SAM, leaving unchanged the\nbaryonic mechanisms already implemented in our previous CDM model (in particular the stellar and the AGN feedback); this allows to single\nout the effects of changing the DM spectrum with the same baryon physics. We focussed on the statistical distribution of luminosity and stellar\nmasses, leaving to next paper a full study of the effects of WDM on other properties of the galaxy population (e.g., chemical abundances,\nages of stellar populations, effects of the environment). Within the present study, we find that adopting power spectrum corresponding to\nWDM particles with mass mX ≈ 1 keV may contribute to solve two major problems of CDM galaxy formation scenarios, namely, the excess\nof predicted faint (low mass) galaxies at low and especially at high redshifts, and the excess of bright (massive) galaxies at low redshifts.\nIn fact, adopting a WDM spectrum on the one hand results in a smaller number of collapsed low-mass haloes; on the other hand it results\ninto a smaller number of satellite galaxies accumulating in massive haloes at low redshifts, thus suppressing the accretion of small lumps on\nthe central, massive galaxies for z . 0.8. Such conclusions are robust with respect to the uncertainties in the modelling of the WDM halo\nabundance around the free streaming mass scale, as discussed in Sect. 4.\nOur results on the luminosity and stellar mass distributions of galaxies concur to indicate that particles with mass ≈ 1 keV constitute\ninteresting candidates for DM; such an indication adds to the existing astrophysical evidences from (see references in the Introduction): a)\nthe observed galaxy structures at small scales (≤ 50 kpc); b) the cored profiles of galaxies; c) the number of sub haloes and satellites in the\nhaloes of massive galaxies.\nDirectly testing whether DM is constituted by such particles, is a realistic possibility for the near future. A cosmological direct probe\nof WDM could be provided by cosmic shear (weak gravitational lensing), which has the advantage of being weakly dependent on baryonic\nphysics. First results in the simple relic scenario indicate that future lensing surveys like EUCLID could see WDM signals for mX & 2 keV\n(Smith & Markovic 2011), close to the mass adopted here.\nIf the WDM is constituted by sterile neutrinos, as advocated to account for the non-zero active neutrino mass (for a review see Boyarsky,\nRuchayskiy & Shaposhnikov 2009), astrophysical bounds on its mass can be placed because it would decay in a standard neutrino plus a\nphoton with energy of the order of the keV, thus producing narrow line emission in X-rays. Claims for detection of lines hardly identifiable\nwith known transitions have been published using both Chandra and Suzaku observations of dwarf galaxies and the Galactic centre (Loewenstein & Kuseno 2010, Prokhorov & Silk 2010). Both the claimed lines are at energies where the effective area is strongly reducing (8.7\nkeV Suzaku) or near the Gold M edge feature of the Chandra mirror (2.51 keV). In the case WDM is constituted by sterile neutrinos direct\ndetection is also possible through triple beta decay experiments like MARE and KATRIN (see de Vega et al. 2011).\nAs for the case of thermal WDM, the favourite candidate is the gravitino. It emerges as a natural candidates for the lightest supersymmetric (LSP) particle in gauge-mediated supersymmetry breaking models (see Dine, Nelson, Nir, Shirman 1996) with conserved R\nparity. Contrary to the gravity-mediated supersymmetry breaking case, where the LSP (typically the neutralino) has masses exceeding the\n10 TeV scale, the gravitino mass can range from a fraction of eV up to O(GeV). However, if it constitutes the LSP with mass mX ≈ 1\nkeV, a large value g∗ ≈ 103 for the degrees of freedom would be needed at the time of its decoupling to comply with the observed matter\ndensity Ω M h2 ≈ 0.12 ≈ (100/g∗ ) (mX /1keV) (Pagels & Primack 1982); this is larger than g∗ ∼ 102 expected in minimal supersymmetric standard model (MSSM). Of course, scenarios with g∗ exceeding the MSSM expectations are conceivable, as well as scenarios where\nentropy-producing processes could dilute the gravitino abundance (Fujiii and Yanagida 2002), or where vanishing gauge coupling at high\ntemperature suppresses the gravitino production (Buchmuller, Hamaguchi & Ratz 2003; see also Lemoine, Moultaka, Jedamzik 2006). A\ngravitino mass mX ≈ 1 keV effective to provide a viable WDM scenario for galaxy formation would correspond to a relatively low energy\nscale for supersymmetry breaking Λ ≈ (mX M p )1/2 ∼ 106 GeV (here M p is the reduced Plank mass). While its extremely weak coupling\nwith matter (∝ Λ−2 , see Lee & Wu, 1999) makes gravitino DM inaccessible to direct searches, upcoming data from colliders may allow for\nsignals from light gravitinos with mass in the eV to MeV range (see Feng, Kamionkowski & Lee 2010). Light gravitinos would be produced\nprimarily in the decays of the next-to-lightest supersymmetric particle, resulting in a variety of signals, including di-photons, delayed and\nnonpointing photons, kinked charged tracks, and heavy metastable charged particles. If light gravitino constitutes WDM, the 7 TeV LHC\nwith 1fb−1 could see evidence for hundreds of light-gravitino events.\nOur results have straightforward implications concerning the growth of Supermassive Black Holes and the evolution of AGNs. In cosmological galaxy formation theories, these are tightly related to the evolution of their host galaxies, as indicated also by the observed correlation\nbetween the mass of Supermassive Black Holes and global properties of their host galaxies, like the stellar mass or the velocity dispersion\n(Kormendy & Richstone 1995; Magorrian et al. 1998; Gebhardt et al. 2000; Ferrarese & Merritt 2000). As recalled in the Introduction (see\nreferences therein), the over-predictions of low-mass objects in the CDM scenario concerns also the AGN population; assuming a WDM\npower spectrum could substantially alleviate the problem, analogously to what we showed to happen for the galaxy population. Note that,\n\n\fGalaxy Formation in WDM Cosmology\n\n11\n\ncontrary to what we derived for low redshift massive galaxies, we do not expect bright AGNs to be affected by assuming a WDM spectrum.\nThis is because such objects are thought to be powered by gas accretion triggered by galaxy encounters with partners of comparable mass\n(extremely rare at low redshift), only mildly affected by the abundance of low mass satellites. We shall investigate this points in a next paper.\nWe thank M. Castellano, A. Fontana, P. Santini, and the referee for helpful comments and suggestions. We acknowledge financial support from the agreement ASI-INAF 1/009/10/0.\n\nREFERENCES\nAbadi, M. G., Navarro, J. F., Steinmetz, M. Eke, V. R. 2003, ApJ 591, 499\nAbazajian, K., Fuller, G.M., Patel, M. 2001, Phys. Rev. Lett. D, 64, 02351\nAvila-Reese, V., Colin, P., Valenzela, O., D'Onghia, E., Firmani, C., 2001, ApJ, 559, 516\nBaldry, I.K., Glazebrook, K., Brinkmann, J., Zeljko, I., Lupton, R.H., Nichol, R.C., Szalay, A.S. 2004, ApJ, 600, 681\nBardeen J. M., Bond J. R., Kaiser N., Szalay A. S., 1986, ApJ, 304, 15\nBaugh, C.M. 2006, Rep. Prog. Phys. 69, 3101\nBell, E., Wolf, C., Meisenheimer, K., Rix, H.-W., Borch, A., Dye, S., Kleineinrich, M., McIntosh, D. 2004, ApJ, 608, 752\nBenson, A.J., Frenk, C.S., Lacey, C.G., Baugh, C.M., Cole, S. 2002, MNRAS, 333, 177\nBlanton, M.R. et al. 2001, ApJ, 121, 2358\nBode, P., Ostriker, J.P., Turok, N. 2001, ApJ, 556, 93\nBond, J.R., Szalay, A.S., Turner, M. S. 1982, Phys. Rev. Lett. 48, 1636\nBond, J.R., Cole, S., Efstathiou, G., & Kaiser, N.,1991, ApJ, 379, 440\nBower, R.G., Benson, A.J., Malbon, R., Helly, J.C., Frenk, C.S., Baugh, C.M., Cole, S., Lacey, C.G. 2006, MNRAS, 370, 645\nBoyarsky, A., Ruchayskiy, O., Shaposhnikov, M. 2009, Annual Review of Nuclear and Particle Science, 59, 191\nBouwens, R.J., Illingworth, G.D., Franx, M., Ford, H. 2007, ApJ, 670, 928\nBuchmuller, W., Hamaguchi, K. & Ratz, M. 2003, Phys. Lett. B, 574, 156\nBullock, J.S., Kravstov, A.V., Weinberg, D.H. 2000, ApJ, 539, 517\nCattaneo, A., Dekel, A., Devriendt, J., Guiderdoni, B., Blaizot, J., MNRAS, 370, 1651\nCavaliere, A., & Vittorini, V. 2000, ApJ, 543, 599\nCirasuolo M., McLure R. J., Dunlop J. S., Almaini O., Foucaud S., Simpson C., 2010, MNRAS, 401, 1166\nCole, S., Aragon-Salamanca, A., Frenk, C.S., Navarro, J.F., Zepf, S.E., 1994, MNRAS, 271, 781\nCole, S., Lacey, C.G., Baugh, C.M., Frenk, C.S., 2000, MNRAS, 319, 168\nCole, S. et al. 2005, MNRAS, 362, 505\nColin, P., Valenzuela, O., Avila-Reese, V., 2000, ApJ, 673, 203\nColombi, S., Dodelson, S., Widrow, L.M. 1996, ApJ, 458, 1\nCroton, D.J, Springel, V., White, S.D.M., De Lucia, G.,Frenk, C.S., Gao, L., Jenkins, A., Kauffmann, G., Navarro, J.F., Yoshida, N., 2006,\nMNRAS, 365, 11\nde Blok, W.J.G.; Walter, F., Brinks, E., Trachternach, C., Oh, S.-H., Kennicutt, R.C., Jr. 2008, AJ, 136, 2648\nde Vega, H.J., Salucci, P., Sanchez, N.G. 2010 preprint (arXiv:1004.1908)\nde Vega, H.J. et al. 2011, prepriny [astro-ph/1109.3452]\nDe Lucia G., Blaizot J., 2007, MNRAS, 375, 2\nDe Lucia G., Boylan-Kolchin M., Benson A. J., Fontanot, F., Monaco P., 2010, MNRAS, 406, 1533\nDine, M., Nelson, A. , Nir, Y. & Shirman, Y. 1996, Phys. Rev. D53, 2658\nDodelson, S., Widrow, L.M. 1994, Phys. Rev. Lett. 72, 17\nDolgov, A.D., Hansen, S.H. 2002, Astropart. Phys., 16, 339\nDrory, N., Bender, R., Feulner, G., Hopp, U., Maraston, C., Snigula, J., Hill, G. J. 2004, ApJ, 608, 742\nFeng, J.L., Kamionkowski, M., Lee, S.K. 2010, Phys. Rev. D, 82, 015012\nFerrarese, L. Merritt, D., 2000, ApJ, 539, L9\nFiore, F. et al. 2011, A&A, 537, 16\nFontana A. et al., 2006, A&A, 459, 745\nFontanot, F., De Lucia, G., Monaco, P., Somerville, R.S., Santini, P. 2009, MNRAS, 397, 1776\nFontanot, F., Pasquali, A., De Lucia, G., van den Bosch, F.C., Somerville, R.S.; Kang, X. 2011, MNRAS, 413, 957\nFujii, M. & Yanagida, T. 2002, Phys. Lett.B, 549, 273\nGebhardt, K. et al. 2000, ApJ, 539, L13\nGiallongo, E., Salimbeni, S., Menci, N., Zamorani, G., Fontana, A., Dickinson, M., Cristiani, S., Pozzetti, L. 2005, ApJ, 622, 116\nGentile, G. Tonini, C. Salucci, P. 2007, A&A, 467. 925\nGovernato, F., Willman, B., Mayer, L., Brooks, A., Stinson, G., Valenzuela, O., Wadsley, J., Quinn, T. 2007, MNRAS, 374, 1479\n\n\f12\n\nMenci et al.\n\nGovernato, F. et al. 2010, Nature, 403, 203\nGranato, G.L, De Zotti, G., Silva, L., Bressan, A., Danese, L. 2004, ApJ, 600, 580\nHenriques, B., Maraston, C., Monaco, P., Fontanot, F., Menci, N., De Lucia, G., Tonini, C. 2011, MNRAS, 415, 357\nKamada, F.A. 2011, Proceedings of \" Warm Dark Matter in the Galaxies: Theoretical and Observational Progresses\", preprint [astroph/1109.3187]\nKang, X., Jing, Y.P., Silk, J. 2006, ApJ, 648, 820\nKauffmann, G., White, S.D.M., & Guiderdoni, B., 1993, MNRAS, 264, 201\nKauffmann, G., Haehnelt, M., 2000, MNRAS, 311, 576\nKhlopov, M.Yu. 2008, Proc. of the Blois 2008 Conference (arXiv:0806.3581)\nKlypin, A., Kravtsov, A.V., Valenzuela, O., Prada, F. 1999, ApJ, 522, 82\nKnebe, A., Devriendt, J.E.G., Mahmood, A., Silk, J. 2002, MNRAS, 329, 813\nKomatsu, E. et al. 2011, ApJS, 192, 18\nKormendy, J., Richstone, D. 1995, ARA&A, 33, 581\nKravtsov, A.V., Gnedin, O.Y., Klypin, A.A. 2004, ApJ, 209, 482\nKrumholz, M.R., Dekel, A. 2011, ApJ, in press\nKusenko, A. 2009, Phys.Rept., 481,1\nLacey, C., & Cole, S., 1993, MNRAS, 262, 627\nLa Franca, F. et al. 2005, ApJ, 635, 864\nLapi, A., Cavaliere, A., & Menci, N. 2005, ApJ, 619, 60\nLapi, A., Shankar, F., Mao, J., Granato, G.L., Silva, L., De Zotti, G., Danese, L. 2006, ApJ, 650, 42\nLee, S.-K., Ferguson, H. C., Somerville, R. S., Wiklind, T., & Giavalisco, M. 2010, ApJ, 725, 1644\nLee ,T., Wu, G.H. 1999, Phys. Lett. B 447, 83\nLemoine, M., Moultaka, M., Jedamzik, J. 2006, Phys. Lett.B, 645, 222\nLo Faro. B, Monaco, P., Vanzella, E., Fontanot, F., Silva, L., Cristiani, S. 2009, MNRAS, 399, 827\nLovell, M.R., Eke, V.R., Frenk, C.S., Jenkins, A. 2011, MNRAS, 413, 3013\nLoewenstein, M. & Kuseno, A. 2010, ApJ, 714, 652\nMadau, P. Diemand, J., Kuhlen, M. 2008, ApJ, 679, 1260\nMadgwick, D.S., et al., 2002, MNRAS, 333, 133\nMagorrian, J. et al. 1998, AJ, 115, 2285\nMaraston, C., Pforr, J., Renzini, A., Daddi, E., Dickinson, M., Cimatti, A., Tonini, C. 2010, MNRAS, 407, 830\nMarchesini, D., van Dokkum, P.G.; Frster Schreiber, N.M., Franx, M., Labb, I., Wuyts, S. 2009, ApJ, 701, 1765\nMarulli, F., Bonoli, S., Branchini, E., Moscardini, L., Springel, V. 2008, MNRAS, 385, 1846\nMashchenko, S., Wadsley, J. and Couchman, H., M. P 2008, Science, 319, 174\nMateo, M. 1998, ARA&A, 36, 435\nMcGaugh, S.S., de Blok, W.J.G., Schombert, J.M., Kuzio de Naray, R., Kim, J. H. 2007, ApJ, 659, 149\nMenci, N., Cavaliere, A., Fontana, A., Giallongo, E., Poli, F., 2002, ApJ, 578, 18\nMenci, N., Cavaliere, A., Fontana, A., Giallongo, E., Poli, F., Vittorini, V. 2003, ApJ, 587, L63\nMenci, N., Fontana, A., Giallongo, E., Salimbeni, S. 2005, ApJ, 632, 49\nMenci, N., Fontana, A., Giallongo, E., Grazian, A.,Salimbeni, S. 2006, ApJ, 647, 753\nMenci, N., Fiore, F., Puccetti, S., Cavaliere, A. 2008, ApJ, 686, 219\nMonaco, P., Salucci, P., Danese, L., 2000, 311, 279\nMoore, B., Quinn, T., Governato, F., Stadel, J., Lake, G. 1999, MNRAS, 310, 1147\nOlive, K.A., Turner, M.S. 1982, Phys. Rev. D, 25, 213\nPagels, H., Primack, J. 1982, Phys. Rev. Lett., 48, 223\nPeebles, P.J.E. 1982, ApJ, 258, 415\nPeebles, P.J.E. 1993, Principles of Physical Cosmology (Princeton: Princeton Univ. Press)\nPolisensky E., Ricotti M., 2011, Phys. Rev. D, 83, 3506\nPress, W.H., & Schechter, P., 1974, ApJ, 187, 425\nPrimack, J.R. & Gross, M.A.K. 2000, in \"Current aspects of neutrino physics\", editor D.O. Caldwell, Springer (Berlin), p. 207\nProkhorov D., Silk J., 2010, ApJ, 725, 131\nReed, D., Governato, F., Verde, L., Gardner, J.,Quinn, T., Stadel, J., Merritt, David; Lake, G. 2005, MNRAS, 357, 82\nSalimbeni, S. et a. 2008, A&A, 477, 763\nSantini, P. et al. 2012, A&A, 538, 33\nSchneider, A., Smith, R.E., Maccio, A.V., Moore, B. 2011, preprint (arXiv:1112.0330)\nShankar F., & Mathur S. 2007, ApJ, 660, 1051\nShankar, F. 2009, New Astronomy Reviews, 53, 57\nShankar F., Crocce M., Miralda-Escude J., Fosalba P., Weinberg D. H. 2010, ApJ, 718, 231\n\n\fGalaxy Formation in WDM Cosmology\nShen, Y. 2009, ApJ, 704, 89\nShi, X.d., Fuller, G.M. 1999, Phys. Rev. Lett. 82, 2832\nSmith, R. E., Markovic K., 2011, Phys. Rev. D, 84, 3507\nSomerville, R.S., & Primack, J.R., 1999, MNRAS, 310, 1087\nSomerville, R. 2002, ApJ, 572, 23\nSpergel, D.N. et al. 2007, ApJS, 170, 377\nSteffen, F.D. 2006, Journal of Cosmology and Astroparticle Physics, 9, 1\nStrateva, I. et al. 2001, AJ, 122, 1861\nTegmark, M., Zaldarriaga, M. 2002,Phys. Rev. D, 66, 3508\nViel, M., Legourgues, J., Haenhelt, M.G., Matarrese, S. Riotto, A. 2005, Phys. Rev. D, 71, 063534\nViel, M., Becker, G.D., Bolton, J.S., Haenhelt, M.G., Rauch, M., Sargent, W.L.W. 2008, Phys. Rev. D, 100, 041304\nVolonteri, M., Madau, P., Quataert, E., Rees, M.J. 2005, ApJ, 620, 69\nWang, J., White, S.D.M. 2007, MNRAS, 380, 93\nWeinmann, S.M., van der Bosch, F.C., Yang X., Mo, H.j. 2006, MNRAS, 366, 2\nWyithe, J.S.B., Loeb, A. 2003, ApJ, 586, 693\nZavala, J., Jing, Y.P., Faltenbacher, A., Yepes, G. Hoffman, Y., Gottlöber, S., Catinella, B. 2009, ApJ, 700, 1779\n\n13\n\n\f"}