{"id": "http://arxiv.org/abs/1203.2709v1", "guidislink": true, "updated": "2012-03-13T04:33:32Z", "updated_parsed": [2012, 3, 13, 4, 33, 32, 1, 73, 0], "published": "2012-03-13T04:33:32Z", "published_parsed": [2012, 3, 13, 4, 33, 32, 1, 73, 0], "title": "Monopoles in ferromagnetic metals", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1203.6132%2C1203.2678%2C1203.4448%2C1203.6540%2C1203.5965%2C1203.2478%2C1203.3056%2C1203.3822%2C1203.2935%2C1203.2519%2C1203.0635%2C1203.0051%2C1203.2834%2C1203.5699%2C1203.5454%2C1203.2306%2C1203.3662%2C1203.5823%2C1203.0823%2C1203.3519%2C1203.4607%2C1203.4287%2C1203.1313%2C1203.4459%2C1203.2729%2C1203.0350%2C1203.4744%2C1203.1261%2C1203.0205%2C1203.0428%2C1203.3700%2C1203.4132%2C1203.5395%2C1203.5229%2C1203.5710%2C1203.6669%2C1203.3665%2C1203.2807%2C1203.2206%2C1203.5180%2C1203.0339%2C1203.2716%2C1203.1245%2C1203.3595%2C1203.4010%2C1203.2337%2C1203.6870%2C1203.5243%2C1203.4843%2C1203.1020%2C1203.1848%2C1203.0295%2C1203.0730%2C1203.5827%2C1203.2490%2C1203.1653%2C1203.5058%2C1203.5215%2C1203.6425%2C1203.3229%2C1203.6694%2C1203.3129%2C1203.0651%2C1203.1323%2C1203.1968%2C1203.3460%2C1203.2726%2C1203.6636%2C1203.0224%2C1203.3522%2C1203.2190%2C1203.4889%2C1203.0507%2C1203.5176%2C1203.4496%2C1203.6753%2C1203.5762%2C1203.5553%2C1203.2176%2C1203.1907%2C1203.0777%2C1203.3680%2C1203.0790%2C1203.6617%2C1203.5264%2C1203.2316%2C1203.3211%2C1203.5488%2C1203.6465%2C1203.2135%2C1203.5309%2C1203.5927%2C1203.0678%2C1203.4024%2C1203.5377%2C1203.3320%2C1203.3685%2C1203.0566%2C1203.2709%2C1203.4766%2C1203.0856&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Monopoles in ferromagnetic metals"}, "summary": "The aim of this short review is to give an introduction to monopoles and to\npresent theoretical derivation of two particular monopoles in ferromagnetic\nmetals, a hedgehog monopole and a spin damping monopole. Spin damping monopoles\ncan be generated in simple systems such as a junction of a ferromagnet and a\nheavy element with strong spin-orbit interaction such as Pt. This monopole is\nessential in coupling electronics with magnetism, and is thus expected to play\nan essential role in spintronics.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1203.6132%2C1203.2678%2C1203.4448%2C1203.6540%2C1203.5965%2C1203.2478%2C1203.3056%2C1203.3822%2C1203.2935%2C1203.2519%2C1203.0635%2C1203.0051%2C1203.2834%2C1203.5699%2C1203.5454%2C1203.2306%2C1203.3662%2C1203.5823%2C1203.0823%2C1203.3519%2C1203.4607%2C1203.4287%2C1203.1313%2C1203.4459%2C1203.2729%2C1203.0350%2C1203.4744%2C1203.1261%2C1203.0205%2C1203.0428%2C1203.3700%2C1203.4132%2C1203.5395%2C1203.5229%2C1203.5710%2C1203.6669%2C1203.3665%2C1203.2807%2C1203.2206%2C1203.5180%2C1203.0339%2C1203.2716%2C1203.1245%2C1203.3595%2C1203.4010%2C1203.2337%2C1203.6870%2C1203.5243%2C1203.4843%2C1203.1020%2C1203.1848%2C1203.0295%2C1203.0730%2C1203.5827%2C1203.2490%2C1203.1653%2C1203.5058%2C1203.5215%2C1203.6425%2C1203.3229%2C1203.6694%2C1203.3129%2C1203.0651%2C1203.1323%2C1203.1968%2C1203.3460%2C1203.2726%2C1203.6636%2C1203.0224%2C1203.3522%2C1203.2190%2C1203.4889%2C1203.0507%2C1203.5176%2C1203.4496%2C1203.6753%2C1203.5762%2C1203.5553%2C1203.2176%2C1203.1907%2C1203.0777%2C1203.3680%2C1203.0790%2C1203.6617%2C1203.5264%2C1203.2316%2C1203.3211%2C1203.5488%2C1203.6465%2C1203.2135%2C1203.5309%2C1203.5927%2C1203.0678%2C1203.4024%2C1203.5377%2C1203.3320%2C1203.3685%2C1203.0566%2C1203.2709%2C1203.4766%2C1203.0856&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The aim of this short review is to give an introduction to monopoles and to\npresent theoretical derivation of two particular monopoles in ferromagnetic\nmetals, a hedgehog monopole and a spin damping monopole. Spin damping monopoles\ncan be generated in simple systems such as a junction of a ferromagnet and a\nheavy element with strong spin-orbit interaction such as Pt. This monopole is\nessential in coupling electronics with magnetism, and is thus expected to play\nan essential role in spintronics."}, "authors": ["Gen Tatara", "Akihito Takeuchi", "Noriyuki Nakabayashi", "Katsuhisa Taguchi"], "author_detail": {"name": "Katsuhisa Taguchi"}, "author": "Katsuhisa Taguchi", "links": [{"title": "doi", "href": "http://dx.doi.org/10.3938/jkps.61.1331", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1203.2709v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1203.2709v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "submitted to J. Kor. Phys. Soc", "arxiv_primary_category": {"term": "cond-mat.mes-hall", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.mes-hall", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1203.2709v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1203.2709v1", "journal_reference": "J. Korean. Phys. Soc. 61 1331-1348 (2012)", "doi": "10.3938/jkps.61.1331", "fulltext": "Monopoles in ferromagnetic metals\nGen Tatara,∗ Akihito Takeuchi, Noriyuki Nakabayashi, and Katsuhisa Taguchi\n\narXiv:1203.2709v1 [cond-mat.mes-hall] 13 Mar 2012\n\nGraduate School of Science, Tokyo Metropolitan University,\n1-1 Minamiosawa, Hachioji 192-0397, Japan\n(Received)\n\n0\n\n\fAbstract\nThe aim of this short review is to give an introduction to monopoles and to present theoretical\nderivation of two particular monopoles in ferromagnetic metals, a hedgehog monopole and a spin\ndamping monopole. In an electromagnetism in the vacuum, described by Maxwell's equations,\nmagnetic field and electric field are not symmetric, since there is no monopole, a particle having\na finite magnetic charge. Still, monopole has been an exciting object for a long time, and was\ndiscussed on a phenomenological ground by Dirac in 1931. A theoretical possibility of monopole\ngeneration was first given by 't Hooft and Polyakov in 1974 in a context of a symmetry breaking in\na grand unified theory (GUT). A GUT monopole has not been discovered in experiments so far. In\ncontrast to in the vacuum, several kinds of monopoles are expected to emerge in solids associated\nwith various symmetry breaking mechanisms. Of particular interest is metallic ferromagnetic\nsystems, since a breaking of a symmetry of conduction electron spin, described by an SU(2) algebra,\ncan give rise to monopoles. Indeed two monopoles are theoretically predicted in ferromagnets; one\nis a hedgehog monopole arising from a topological spin structure and the other arising from spin\ndamping in the presence of spin-orbit interaction. In this paper, we focus on these monopoles,\nwhile other objects similar to monopoles but not coupled to effective electromagnetic fields, such\nas spin ice monopoles, are touched only briefly in the introduction. Those monopoles are extended\nobjects coupled to effective electromagnetic fields, which are described by Maxwell's equations\nwith monopole contribution. The effective fields are the one coupled to spin of a particle like\nelectron, muon and neutron; two monopoles are thus detectable by electric measurements. Spin\ndamping monopoles can be generated in simple systems such as a junction of a ferromagnet and a\nheavy element with strong spin-orbit interaction such as Pt. This monopole is essential in coupling\nelectronics with magnetism, and is thus expected to play an essential role in spintronics.\nKeywords: Monopole, Spintronics, Spin current, Maxwell's equations\n\n∗\n\ntatara@tmu.ac.jp\n\n1\n\n\fFIG. 1.\n\nLeft: Schematic figure of a magnet and magnetic field around it. Right: A monopole,\n\nparticle having only N (or S) magnetic pole, and the magnetic field it emits.\nI.\n\nINTRODUCTION\nA.\n\nMonopole\n\nMacroscopic magnets have two poles called N (north) and S (south) at two different edges\n(Fig. 1). We also know that we cannot extract only N or S pole from magnets; when we\ndivide a magnet, a pair of N and S poles is created at the edge and each piece becomes a\nmagnet with the equal amount of N and S poles. There is therefore no monopole at least\nin the energy scale we concern in our life. This is because the magnets are made of spin,\na quantum magnet the electron carries, which creates the divergencelss magnetic field only.\nIn other words, each spin contain N and S poles, which are not separable since elementary\nparticles are pointlike.\n\nPossibility of a particle carrying only N or S pole, called magnetic monopole, was first\ndiscussed by Dirac [1]. He showed based on a macroscopic consideration that monopole is\ntied to a string of singularity, and its existence is allowed only if the charge of the monopole is\nquantized by unit of 2π~/e (e is the electron charge). A microscopic mechanism of monopole\ncreation was theoretically discovered by 't Hooft [2] and Polyakov [3] independently. They\nshowed that monopole arises in a grand unified theory (GUT) of elementally particles when\nthe symmetry breaking of the SU(5) symmetry to the U(1) symmetry of the electromagnetic\nfield occurs. Such monopoles may have been created in the early universe (at about 10−10\nsec after the big bang) and may still be around us. So far, however, no evidence has been\nobtained in experiments waiting for a monopole from universe to go through superconducting\n2\n\n\fdetectors [4] or detecting the ionization [5]. The energy scale of the GUT monopole is 1017\nGeV, and so creating one in accelerator on the earth is impossible.\n\nB.\n\nMaxwell's equations without monopole\n\nBefore starting to discuss monopoles, let us discuss the law of conventional electromagnetism without monopole. We know that electric field, E, and magnetic field, B, behave\ndifferently, i.e., electric field has finite divergence while magnetic field is divengenceless [6].\nTo put in equations,\n∇*E =\n\nρ\nǫ\n\n∇ * B = 0,\n\n(1)\n\nwhere ρ is charge density and ǫ is dielectric constant. The two fields are governed by another\nset of equations describing rotational components;\n∇×E =−\n\n∂B\n∂t\n\n∇ × B = μj + ǫμ\n\n∂E\n,\n∂t\n\n(2)\n\nwhere μ is magnetic permeability and j is current density. The fields E and B are therefore\nnot symmetric; magnetic field is generated by electric current by the Ampère's law, while\nthere is no driving current for electric field. One may imagine that the electromagnetism law\nis more beautiful if there is a current that drives electric field via an analog of the Ampère's\nlaw. Let us write such current as jm . The first equation of Eq. (2) then becomes\n∇ × E = −jm −\n\n∂B\n.\n∂t\n\n(3)\n\nTaking the divergence of this equation, we have\n0 = −∇ * jm −\n\n∂\n(∇ * B),\n∂t\n\n(4)\n\nwhich indicates that the second equation of Eq. (1) needs to be modified as\n∇ * B = ρm ,\n\n(5)\n\nwhere ρm is a quantity satisfying a conservation law of\nρ ̇m + ∇ * jm = 0.\n\n(6)\n3\n\n\fFIG. 2. Left) The Ampère's law allows us to generate magnetic field from the electric current, j.\nIn contrast, there is no Ampère's law for the electric field in the electromagnetism if U(1) symmetry\nis exact. The exception is the case with monopole: monopole current, jm , generates E (Right).\n\nEquation (5) indicates that ρm emits a magnetic field like a N or S pole; hence ρm is a density\nof monopole. The current jm is then a monopole current. Thus, if monopole exists, E and\nB become symmetric, and the electric field can be generated by applying the monopole\ncurrent.\n\nThe aim of this short review is to give an introductory description of monopoles in\ncondensed matter and explain in detail monopoles in ferromagnetic metals. The paper is\norganized as follows. Monopole is discussed from a macroscopic viewpoint in §II. Section III\nis a brief introduction of monopoles in solids. Other topological objects similar to monopoles\nare introduced in §IV. These objects are touched only briefly, since we would like in this paper\nto focus on monopoles which really couple to electromagnetism via Maxwell's equations.\nSections V and VI are the main content of the paper presenting theoretical description\nof hedgehog monopole and spin damping monopole, respectively. Relativistic notation is\nsummarized in §A and spin damping is briefly described in §B.\nII.\n\nMONOPOLE FROM MACROSCOPIC VIEWPOINT : DIRAC'S STRING\n\nLet us go on to discuss monopoles from a macroscopic viewpoint, i.e., based on the\nMaxwell's equations. As is well-known, in the electromagnetism without monopole, the\nmagnetic field B is expressed as a rotation of a vector potential, namely, as B = ∇ × A.\nWhen monopole is present, this is no longer true, but still one can define a vector potential\n4\n\n\fas a line integral over a certain line L starting from monopole to the infinity. Let us consider\na case of a single monopole at r = 0,\nB(r) =\n\ng r\n,\n4π r 3\n\n(7)\n\nwhere g is a monopole charge. We can define a \"vector potential\"\n(L)\nAi (r)\n\n=\n\nX\njk\n\nǫijk\n\nZ\n\nL\n\ndrj′ Bk (r − r ′ ),\n\n(8)\n\nwhere Bk is the kth component of the magnetic field (including monopole) and L is a string\nconnecting r = 0 and the infinity. The \"magnetic field\" of this vector potential A(L) then\nreads\n∇×A\n\n(L)\n\n(r) = B(r) +\n\nZ\n\nL\n\ndr ′ρm (r − r ′ ),\n\n(9)\n\nwhere ρm is the monopole density, ρm (r) = gδ 3 (r) if a single monopole case. The first term\nof Eq. (9) correctly reproduces the field B but we have an additional non local singular\nfield represented by the second term. The singular magnetic field represented by the second\nterm of Eq. (9) exists along the string L. Dirac argued therefore that monopole needs to\nhave such string (called the Dirac's string) but this string must not been \"seen\" by physical\nparticles [1]. If many monopoles exist, many strings L each attached to a single monopole\nare needed to describe the vector potential.\nThe unobservability of the string is ensured if the monopole charge g is quantized to\ncertain values. One way to derive the quantization condition is to impose the condition that\nthe shift of the Dirac's string does not modify the wave function of the charged particles [6].\nEquation (8), explicitely written in a single monopole case reads\nZ\n′\ng X\n(L)\n′ (r − r )k\nǫijk drj\n.\nAi (r) =\n4π jk\n|r − r ′ |3\nL\nIf one shift the string L to be another string L′ , the vector potential changes to\nZ\n(r − r ′ )k\ng X\n(L′ )\n(L)\nǫijk\ndrj′\n,\nAi (r) = Ai (r) +\n4π\n|r − r ′ |3\nC\n\n(10)\n\n(11)\n\njk\n\nwhere C = L′ − L is a closed path surrounded by L and L′ . The last term of the right-hand\nside is proportional to the derivative of the solid angle ΩC (r) subtended by C observed at r.\n5\n\n\f4π−Ω C\nC\n\nP'\n\nΩC\nP\n\nFIG. 3.\n\nWhen a solid angle of a closed path C observed at P is ΩC , it is 4π − ΩC at P' in the\n\nopposite side of the path.\n\nIn fact, a difference of solid angles observed at r and r + δr, which we call δΩC , is (noting\nthat dr ′ × δr is a vector normal to the plane having a length of an element of area)\nZ\nr′ − r\n.\nδΩC = (dr ′ × δr) *\n|r − r ′ |3\nC\nWe therefore see that\nZ\n(r − r ′ )\n,\n∇ΩC =\ndr ′ ×\n|r − r ′ |3\nC\n\n(12)\n\n(13)\n\nand that Eq. (11) becomes\n′\n\nA(L ) = A(L) +\n\ng\n∇ΩC .\n4π\n\n(14)\n\nSince a phase for the electron's wave function is given by an integral of the vector potential,\nie g\n\nthis modification of the vector potential results in a phase change of e ~ 4π ΩC . Quantum\nmechanics requires that this phase is single-valued. However, solid angle ΩC is not singlevalued. Multi-valuedness of ΩC occurs when ΩC changes by 4π as an electron goes through\nthe plane spanned by C (Fig. 3). The single-valuedness of the electron's phase is thus\nensured by requiring that\neg = 2πn~,\n\n(15)\n\nwhere n is an integer. This is the quantization condition for the monopole charge, pointed\nout by Dirac.\nThe above argument is based on the assumption that the magnetic field is written as a\nrotation of a U(1) vector potential even in the presence of monopoles. This assumption,\n6\n\n\fhowever, is wrong, since the exact U(1) gauge invariance does not exist when monopole\nexists. As we will show later, the monopole field in the case of the symmetry breaking\nmechanism is expressed by the additional field orthogonal to the U(1) degrees of freedom.\nThe Dirac's string containing a singular magnetic field (the last term of Eq. (9)), is thus an\nartifact arising when one tries to describe the monopole field within the U(1) gauge theory\nassuming B = ∇ × A, and it is eliminated when one takes account of microscopic origin of\nthe monopole.\nIn the case of 't Hooft-Polyakov monopole, monopole is created from the symmetry\nbreaking [7]. Their argument is for a system of non-Abelian gauge field coupled to a Higgs\nrepresented by a vector field, φα (α = x, y, z). They showed that there is a solution where\nHiggs field behaves at the infinity as\nφα ∝\n\nrα\n(r → ∞).\nr\n\n(16)\n\nIn this configuration, magnetic field is shown to contain monopole, and monopole density is\ndetermined by Higgs field as\nρm ∝\n\nXX\n\nǫijk ǫαβγ ∂i φα ∂j φβ ∂k φγ .\n\n(17)\n\nijk αβγ\n\nA volume integral of this monopole density is written as a surface integral at the infinity,\nand it turns out to take only integer value called a winding number. This topological nature\nof the Higgs field leads to a quantization of monopole charge. Thus, 't Hooft-Polyakov\nmonopole emerges from a symmetry breaking from non-Abelian group to U(1) group driven\nby a condensation of Higgs field. Dirac's string is not necessary here, since monopole field\nis created from Higgs field, which is different from a gauge field.\nIn §V, we will discuss in detail a monopole arising from a symmetry breaking in ferromagnets.\n\nIII.\nA.\n\nMONOPOLES IN SOLIDS\nHedgehog monopole\n\nAs we have mentioned, in the electromagnetism in the vacuum, monopole predicted at\nhigh energy has not been found. Even if it is found in the future, we cannot make a device\n7\n\n\fFIG. 4.\n\nSchematic illustration of a magnetization structure for a hedgehog monopole, discussed\n\nby Volovik. This structure has a singularity at the center, and is topologically non-trivial. The\nelectron coupled to this magnetization structure feels the effective electromagnetic field with a\nmonopole.\n\nsince its energy is too high. In contrast to electromagnetism in the vacuum, we have hope\nin solids. In fact, electrons in solids feel another U(1) gauge field which couples to the\nelectron's spin [8]. The spins are object in an SU(2) space, and thus if the breaking of its\nsymmetry occurs, a resulting effective U(1) gauge field may contain monopoles according to\nthe 't Hooft and Polyakov scenario. In addition, the energy scale of the symmetry breaking\nis at low energy, less than 1eV, and so device application would be straightforward.\nSuch a monopole was indeed theoretically pointed out to exist in ferromagnetic metals\nby Volovik in 1987 [9]. In fact, a monopole arises from a strong sd coupling between the\nconduction electron and local spin, which specifies the projection of the conduction electron\nspin having SU(2) symmetry to a U(1) space. When local spin structure is a topologically non-trivial one called a hedgehog, the projected effective electromagnetic field contains\nmonopoles.\n\nB.\n\nSpin damping monopole\n\nRecently, another monopole in ferromagnetic metals was predicted [10, 11]. The idea is\nto include spin-orbit interaction besides sd interaction. Spin-orbit interaction modifies the\nprojection to the U(1) plane defined by the sd interaction, and thus new monopole may arise\n8\n\n\fFIG. 5. Schematic illustration of a spin damping monopole. A damping of spin (S) generates an\norbital angular momentum L for electrons when spin-orbit interaction (SO) acts. A circular motion\ndue to the orbital angular momentum is equivalent to that caused by an electric field induced by\na monopole current jm via Ampère's law.\n\nwhen the spin-orbit interaction is included. The monopole generation in such case cannot be\ndiscussed by use of gauge fields, since the spin-orbit interaction is not a gauge interaction.\nInstead, novel method based on a transport calculation was applied by Takeuchi and Tatara\n[10]. They derived effective electromagnetic fields by calculating the electric current by use\nof Keldysh Green's functions, and showed that the fields satisfy Maxwell's equation with\nmonopole. In their unique approach, a knowledge of gauge invariance was not necessary\nto explore the structure of the electromagnetism. This fact may sound surprising, but\nis natural, since a U(1) gauge invariance is equivalent to charge conservation law, which\nis strictly observed in transport calculations. In their case, a deviation from exact U(1)\ninvariance due to spin-orbit interaction resulted in a monopole contribution. Based on the\ntransport method, they revealed that monopole arises when the spin structure is dynamic\nand when spin-orbit interaction is included. More specifically, monopole arises when there\nis a damping of spin, represented by a damping vector (see §B),\nN ≡ S × Ṡ,\n\n(18)\n\n(S being local spin), and thus the monopole was named the spin damping monopole.\nA physical mechanism of spin damping monopole is understood as a transfer of the spin\nangular momentum to orbital one (Fig. 5). In fact, a vector αN , where α is the Gilbert\ndamping parameter (proportional to the strength of the spin-orbit interaction if in metals),\nrepresents the spin angular momentum dissipated. This lost angular momentum is converted\ninto the orbital motion of the electrons by the spin-orbit interaction, inducing the circular\n9\n\n\fFIG. 6. A scalar spin chirality subtended by three spins represents non-coplanarity. Spin chirality\nreduces to spin Berry's phase in the slowly varying limit.\n\norbital motion of the electrons. This circular motion is regarded as a result of a fictitious\nmagnetic field due to a monopole. ¿From this intuitive explanation, the monopole density\nshould appear when the spin damping is spatially inhomogeneous. This is indeed consistent\nwith the result of Ref. [10], which showed that the monopole density is ρm ∝ ∇*N . Similarly,\nwhen the spin damping is time-dependent, a monopole current arises since a temporal change\nof effective magnetic field is equivalent to a monopole current. The spin damping monopole\nwas argued to be essential in the spin-charge conversion in spintronics phenomena such as\nthe inverse spin Hall effect [12].\nThese monopoles in ferromagnetic systems are discussed in detail in §V and §VI.\n\nIV.\n\nA.\n\nRELATED TOPOLOGICAL OBJECTS IN SOLIDS\n\nSpin chirality\n\nThere are several objects closely related to monopoles. Spin chirality is one example. In\na spin system on a lattice, a non-coplanarity of three spins, S1 , S2 and S3 , is represented\nby a scalar product called a scalar chirality, χ ≡ S1 * (S2 × S3 ) (Fig. 6). When the spin\nstructure is slowly varying in space, spin chirality can be expanded as\n\nS(x) * (S(x1 ) × S(x2 )) ≃\n\nX\nμν\n\n(x1 − x)μ (x2 − x)ν S(x) * (∂μ S(x) × ∂ν S(x)),\n10\n\n(19)\n\n\fFIG. 7.\n\nSchematic illustration of a magnetic vortex (left) and a skyrmion (right). These are\n\ntwo-dimensional structures of magnetization with topological meaning. The topological number of\na vortex is the number of spin rotation as one travels along the perimeter, called a vorticity. In a\nskyrmion structure, the spins at the perimeter is fixed to be parallel (spin down in this figure), and\nits topological number is the number of spin rotation as one travels from the origin to the infinity\nalong the radial direction. Vortex and skyrmion in this figure have a topological number of one.\n\nand the spin chirality reduces to the spin Berry phase. In the continuum limit, therefore, a\nscalar chirality is represend by a vector\nχi ≡\n\nX\njk\n\nǫijk S * (∇j S × ∇k S),\n\n(20)\n\nwhere the direction i is orthogonal to a plane the three spins lie. This expression of the scalar\nchirality is proportional to spin Berry's phase or a local effective magnetic field generated\nby a hedgehog monopole (see Eq. (46)). One should note, however, that finite local spin\nchirality does not necessarily mean that a monopole exists; monopole exisitence requires a\nR\nsurface integral of the chirality, dS * χ (dS is an element of surface integral), to be finite,\nand this is realized only for a three-dimensional hedgehog structure shown in Fig. 4.\n\nEven when monopoles do not exit, a finite spin chirality leads to interesting physics, such\nas inducing chirality-driven exotic anomalous Hall effect [13, 14]. When spin structure such\nas domain wall is dynamic, the effective electric field acting on the electron's spin, the spin\nmotive force, is induced (see Eq. (46)). Spin motive force was detected in the case of moving\ndomain wall [15].\nA monopole was also found in systems of conventional anomalous Hall effect driven by\nspin-orbit interaction [16, 17]. This monopole is a singularity in the momentum space and\nis not coupled to the electromagnetism by Maxwell's equations.\n11\n\n\fFIG. 8.\n\nLeft: Ground state spin configuration in a frustrated magnet with a pyrochlore lattice.\n\nAll the tetrahedra contains two in-spins and two out-spins, satisfying ice rule. Right: An excited\nstate of a spin ice. Due to a flip of a spin connecting the two tetrahedra, left tetrahedra has three\nout-spins and the right tetrahedra has only one out-spin. This configuration contains effective\nmonopoles; positive and negative ones on the left and right tetrahedra, respectively.\n\nB.\n\nVortex and skyrmion\n\nMagnetic vortex and skyrmion in magnets are spin structures having topological feature\nin two-dimensions (Fig. 7) [18]. They have finite value of local spin chirality. A vortex is a\nstructure where the number of spin rotation as one travels along the circle at the infinity (or\nthe edge of the disk) is the topological number called a vorticity, which is an integer. Vortex\nstate is stable in a small circular disk of submicron size since the magnetostatic energy at\nthe edge is the lowest for the vortex state [19]. Switching of a vortex core by an electric\ncurrent is a hot issue from a viewpoint of fundamental science and application to non-volatile\nmemories. At present, rather large current density of 3.5 × 1011 A/m2 is necessary for a core\nflip, and the switching time is not very fast, about 20ns [20].\nSkyrmion was originally proposed in high energy physics. In condensed matter, a magnetization structure shown in Fig. 7 is called a skyrmion [21]. Such a structure was predicted\nto arise when the inversion symmetry is broken. Skyrmions forming a lattice were observed\nin MnSi [22, 23]. Vortices and skyrmions have finite effective magnetic field, Bs , but these\ntopological structures are nothing to do with monopole (ρm and jm vanish), since they are\ntwo-dimensional objects.\n12\n\n\fC.\n\nSpin ice monopole\n\nMonopoles in frustrated magnets with pyrochlore lattice is a hot subject recently [24]. In\nthe ground state of pyrochlore spin system, each tetrahedra has two spins pointing to the\ncenter of tetrahedra (in-spin) and two spins pointing outwards (out-spin), satisfying so called\nan ice rule. When the system is excited, ice rule is broken and some of tetrahedra contain\nthree in-spins and there arise the same number of tetrahedra with three out-spins (Fig.\n8). In such excited states, tetrahedra with broken ice rule have nonvanishing divergence of\nmagnetization, ∇ * M ≡ ρM . In terms of magnetic field H ≡\n\n1\nB\nμ0\n\n− M , the excited states\n\nof spin ice systems thus have monopoles, i.e., ∇ * H = −ρM [25]. The spin configuration\ncorresponding to monopoles has been observed by neutron scattering experiment [26]. In\naddition, an effective magnetic charge of a spin ice monopole was measured in Dy2 Ti2 O7\n[27, 28]. Spin ice system is also created recently on an artificial square lattice [29].\nOne should understand that spin ice monopole is not a real monopole, since ∇ * B = 0 is\nstrictly true even in the presence of any spin configurations; it is a monopole of an artificial\nmagnetic field [24]. Nevertheless, an spin ice monopole interpretation is highly useful to\ndescribe excited states in frustrated spin systems from the viewpoint of spin liquid.\n\nD.\n\nMonopole in topological insulator\n\nRecent study revealed that monopole arises at the surface of topological insulators as a\nresult of a image magnetic charge when an electric charge is close to a surface according\nto the following mechanism [30, 31]. A surface of topological insulator is described by a\nmassless Dirac Hamiltonian in (2+1) dimensions. In this system, a parity anomaly arises\nfrom a ultra violet divergence, resulting in a Hall current perpendicular to the applied field\njμ =\n\ne2 m X μνρ\nǫ ∂ν Aρ ,\n2h|m| μνρ\n\n(21)\n\nwhere A represents an vector potential and m is a topological mass [32]. An electric charge\nemitting a radial electric field outside a topological insulator thus creates a circulating electric\ncurrent on the surface. A magnetic field generated by this current is equivalent to the one\nemitted by a magnetic charge inside topological insulator. Therefore, electric charge in a\nproximity with a topological insulator is coupled with a mirror magnetic charge (monopole),\n13\n\n\fforming a state called a dyon. This coupling of electric and magnetic charges is explained\nalso by an effective Lagrangian of a topological insulator in three space dimensions (called\na θ term) [30]\nθ\nLθ =\n2π\n\nZ\n\nd3 xE * B,\n\n(22)\n\nwhere θ is a constant. This Lagrangian, derived by integrating out the electrons, indicates\nthat electric field and magnetic field are coupled directly, i.e., there is a magneto-electric\neffect. Lagrangian Lθ is written as a surface integral, and reduces to a Lagrangian which\ndescribes a parity anomaly in (2+1) dimensions.\n\nV.\n\nHEDGEHOG MONOPOLE IN FERROMAGNETS\nA.\n\nGauge field representation of ferromagnetic metals\n\nIn this section, we derive a hedgehog monopole in a metailic ferromagnet in a strongly\nspin-polarized case. There are conduction electrons and local spins (magnetization). Local spin we consider is a classical vector field, represented by S(r, t), which depends on\nspace coordinate, r, and time, t. We use a field (second-quantized) representation, where\nc ≡ (c+ , c− )t (lower index ± denotes spin and t stands for transpose) and c† represent the\nannihilation and creation operators for a conduction electron, respectively. The free part of\nconduction electron Hamiltonian is\n\u0013\n\u0012\nZ\n~2 2\n3 †\n∇ − ǫF c,\nH0 = d rc −\n2m\n\n(23)\n\nwhere m is the electron mass and ǫF is the Fermi energy. In metallic ferromagnets, conduction electrons are spin-polarized by local spin, S, due to a coupling of sd-type given\nby\nHsd = −J\n\nZ\n\nd3 rS * (c† σc),\n\n(24)\n\nwhere J is a coupling constant, and (c† σc) is the spin density of the electron (σ = σx , σy , σz\nrepresents Pauli matrix). The total Lagrangian of conduction electrons, defined as L ≡\nR 3\nd ri~c† ċ − H, where H = H0 + Hsd , is\n\u0013\n\u0015\n\u0014\n\u0012 2\nZ\n~\n2\n†\n†\n3\n†\n|∇c| − ǫF c c + Mn * (c σc) ,\n(25)\nL = d r i~c ċ −\n2m\n14\n\n\fwhere M ≡ JS and n ≡ S/S is a unit vector. In ferromagnetic metals, spin polarization of\nconduction electron satisfies Mτ /~ ≫ 1, where τ is elastic lifetime of conduction electron.\nThis is the adiabatic condition for disordered metals[8, 33, 34]. In this limit, a local gauge\ntransformation to choose the electron spin quantization axis along S(r, t) at each point is\nuseful [33]. The deviation from perfect adiabaticity is then described by an SU(2) gauge\nfield, which is small and we treat it perturbatively. A new electron operator a ≡ (a+ , a− )t\nis defined as\nc(r, t) ≡ U(r, t)a(r, t),\n\n(26)\n\nwhere U is a 2 × 2 matrix which we further define as\nU(r, t) ≡ m * σ,\n\n(27)\n\nm being a real three-component unit vector we will define later. The matrix satisfies U 2 = 1,\ni.e., U(r, t)−1 = U(r, t). A derivative of an operator c reads\n∂μ c(r, t) = U(r, t)(∂μ + U(r, t)−1 ∂μ U(r, t))a = U(r, t)(∂μ + iAs,μ )a,\n\n(28)\n\nwhere a gauge field (represented by a 2 × 2 matrix) is defined as\nAs,μ ≡ −iU(r, t)−1 ∂μ U(r, t).\n\n(29)\n\nIn terms of spin components, Aμ is written as [33]\nX\nAs,μ = (m × ∂μ m) * σ ≡\nAαs,μ σα .\n\n(30)\n\nα\n\nBy the above gauge transform, the electron spin is transformed to be\nU −1 σU = 2m(m * σ) − σ.\n\n(31)\n\nThe aim of our gauge transform is to let this spin to be along z-axis, i.e., U −1 (n * σ)U = σz .\nThis is satisfied if we choose\n\u0012\n\u0013\nθ\nθ\nθ\nm = sin cos φ, sin sin φ, cos\n,\n2\n2\n2\n\n(32)\n\nwhere (θ, φ) are the polar coordinates of S. The gauge field is then obtained in a matrix\nnotation with respect to spin index as\n\n\n\n\nx\nA\n−∂μ θ sin φ − sin θ cos φ∂μ φ\n\n s,μ  1 \n\n y \n\n As,μ  =  ∂μ θ cos φ − sin θ sin φ∂μ φ  .\n\n\n 2\nAzs,μ\n(1 − cos θ)∂μ φ\n15\n\n(33)\n\n\fThe electron part of Lagrangian is written in terms of a-electron as\n\u0014\nZ\n~2\n3\n†\nL =\nd r i~a ȧ −\n|∇a|2 + ǫF a† a − Ma† σz a\n2m\n\u0015\n2\n~2\n~\n†\n†\n2 †\n†\n(a As,i ∇i a − (∇i a )As,i a) −\n(As ) a a − ~a As,0 a .\n+i\n2m\n2m\n\n(34)\n\nIn the matrix notation of the spin,\n\n\n\n\u0013\n\u0012\nZ\n2\n2\na\n~\n~\n+\n\n∇2 + ǫF −\n(As )2 \nL =\nd3 r (a† + , a† − ) i~∂t +\n2m\n2m\na−\n\n\n\n↔\n↔\n+\n+\n~2\n~2\nz\nz\n−M + i 2m As,i ∇i − ~As,0\ni 2m As,i ∇i − ~As,0\na\n  + (35)\n+(a† + , a† − ) \n,\n↔\n↔\n−\n~2\n~2\nz\nz\nA−\nA\ni 2m\n+\n~A\n−\n~A\nM\n−\ni\na\n−\ns,0\ns,0\ns,i ∇i\n2m s,i ∇i\nwhere\n\nx\ny\nA±\ns,μ ≡ Aμ ± iAμ ,\n\n↔\n\n→\n\n(36)\n\n←\n\nand ∇ ≡∇ − ∇ acts only to the field operators.\n\nThe adiabatic limit is defined as M → ∞. In this limit, the minority spin electron\n\nhas infinitely high energy and thus does not exist. Off-diagonal elements of Eq. (35) are\naccordingly neglected, and the system reduces to an electron interacting with a U(1) gauge\nfield, Azs,μ , described by a Lagrangian ((Axs )2 and (Ays )2 act only as a potential)\n\u0015\n\u0014\nZ\n~2 z ↔\n~2\n~2 2\n2\nz\n3\n†\n∇ + ǫF − M + i\nA ∇i −\n(As ) − ~As,0 a+ . (37)\nLad = d ra + i~∂t +\n2m\n2m s,i\n2m\nB.\n\nHedgehog monopole arising from non-adiabaticity\n\nWhen M is finite, perpendicular fluctuation represented by A±\ns,μ exists, and there is a\nfinite deviation from the U(1) symmetry. These components appears in the U(1) space as a\nsingular magnetic structure, i.e., a monopole. This can be shown as follows. (The notation in\nthis subsection is a relativistic one [7], and upper and lower indices have different meanings.\nSee Sec. A for details.) A field strength of the SU(2) gauge fields is\nX\nFsμν ≡\nFsμν,α σα ,\n\n(38)\n\nα=x,y,z\n\nwhere α-component is given as\nν μ,α\nν μ,α\nFsμν,α ≡ ∂ μ Aν,α\n+ (Aμs × Aνs )α = ∂ μ Aν,α\n+\ns − ∂ As\ns − ∂ As\n\nX\n\nν,γ\nǫαβγ Aμ,β\ns As ,\n\nβγ=x,y,z\n\n(39)\n16\n\n\fwhere ǫαβγ is the asymmetric tensor in three-dimensions. By definition, the field strength\nsatisfies the following identity called the Bianchi identity:\nǫμνρσ Dν Fs,ρσ = 0,\n\n(40)\n\nwhere ǫμνρσ is the asymmetric tensor in four-dimensions and\nα\n(Dν Fs,ρσ )α ≡ ∂ν Fs,ρσ\n+\n\nX\n\nγ\nǫαβγ Aβs,ν Fs,ρσ\n,\n\n(41)\n\nβγ\n\nrepresents the covariant derivative of field strength.\nWhen away from the perfect adiabatic limit, Axs,ν = Ays,ν need to be taken account of.\nNevertheless, when the non-adiabaticity is weak, only the z component of the field strength\nis essential, which reads\nν μ,z\nμν\nFsμν,z = ∂ μ Aν,z\ns − ∂ As + Φ ,\n\n(42)\n\nν,y\nν,x μ,y\nΦμν ≡ (Aμ,x\ns As − As As ),\n\n(43)\n\nwhere\n\nis an anomalous field strength representing a trace of the SU(2) gauge field. In terms of a\nunit vector n, it reads [33]\n1\nΦμν = n * (∂ μ n × ∂ ν n).\n4\n\n(44)\n\nIn the adiabatic limit, Fsμν,α with spin component α = x, y are suppressed and the z component of the Bianchi identity (41) reduces to\nǫμνρσ ∂ν Fs,ρσ,z = ǫμνρσ ∂ν (∂ρ Azs,σ − ∂σ Azs,ρ + Φρσ ) = 0.\n\n(45)\n\n¿From a gauge invariance, the effective electric and magnetic fields are defined as\n1\nEs,i ≡ Fs,0i = −∇i Azs,0 + ∂t Azs,i = − n * (ṅ × ∇i n)\n2\nX\n1\nǫijk n * (∇j n × ∇k n).\nBs,i = (∇ × Azs )i =\n4 jk\n\n(46)\n\nThe μ = 0 component of Eq. (45) then becomes\n−∇ * Bs +\n\nX\n\nǫijk ∂i Φjk = 0,\n\n(47)\n\nijk\n\n17\n\n\fnamely\n∇ * Bs = ρh ,\n\n(48)\n\nwhere\nρh ≡\n\nX\n\nǫijk ∂i Φjk =\n\nijk\n\n1X\nǫijk [∂i n * (∂j n × ∂k n)].\n4 ijk\n\n(49)\n\nThus the effective magnetic field has a finite divergence, i.e., a finite monopole density.\nSimilarly, μ = i component of Eq. (45) reads\n(∇ × Es )i + ∂t * Bs,i = −jh,i ,\n\n(50)\n\nwhere\njh,i ≡\n\nX\njk\n\nǫijk (∂t Φjk − 2∂j Φ0k ) =\n\n3X\nǫijk [ṅ * (∂j n × ∂k n)].\n4 jk\n\n(51)\n\nConsistency of Eqs. (48) (50) is guaranteed by a conservation law for monopole,\nρ ̇h + ∇ * jh = 0.\n\n(52)\n\nTherefore, ferromagnetic metals having a singular hedgehog spin structure in the adiabatic\nlimit contains monopole.\n\nC.\n\nQuantization condition of hedgehog monopole\n\nAn important feature of hedgehog monopole is that its density and current, jh and ρh ,\nvanish when the length of local spin is constant. This is easily seen by noting that a unit\nvector n is described by two independent angles, θ and φ, and that three vectors ∂i n, ∂j n\nand ∂k n in Eqs. (49) and (51) cannot be independent. Nevertheless, the volume integral of\nthe monopole density is finite due to the surface contribution if the local spin has a hedgehog\nstructure shown in Fig. 4. Let us define a normalized spin gauge field including a copling\nconstant\n\ng\n,\n2π\n\nAN\nμ ≡\n\ni.e., as (upper suffix N means north)\ng\n(1 − cos θ)∂μ φ.\n4π\n\n(53)\n\nThe effective magnetic field of AN reads\ng X\nǫijk n * (∇j n × ∇k n).\nB N i ≡ (∇ × AN\n)\n=\nμ i\n8π jk\n18\n\n(54)\n\n\fThe total magnetic flux is then\nZ\ndS * B N = gn,\n\n(55)\n\nmeaning that there are n monopoles with a charge g. Here we used a relation\nXZ\nXZ\ndSi ǫijk sin θ(∇j θ)(∇k φ) = 8πn,\ndSi ǫijk n * (∇j n × ∇k n) = 2\n\n(56)\n\nijk\n\nijk\n\nwhere n is an integer. This is understood by noticing that sin θdθdφ is an element of are\nP R\nof a sphere spanned by θ and φ, and thus an integral ijk dSi ǫijk sin θ(∇j θ)(∇k φ) is a\nsolid angle of a sphere (4π) times a winding number of spin structure, an integer n. This\n\nrelation is a result of a fact that the total solid angle subtended by a spin structure is 4πn,\nor equivalently a fact that the left-hand side of Eq. (56) is a winding number multiplied\nby 8π. The hedgehog monopole from the spin structure is thus a topological object having\nvanishing local densities. The one shown in Fig. 4 has a topological number of n = 1.\nA quantization of monopole charge g is discussed by requiring that a gauge field covering\nthe whole space without singularity is constructed by patching together locally defined gauge\nfields. In fact, Eq. (53) is not defined at θ = π (south pole), since ∂φ can not be defined\nthere. We can define a gauge field regular at the south pole as\nASμ = −\n\ng\n(1 + cos θ)∂μ φ.\n4π\n\n(57)\n\nThis field has a singularity at the north pole θ = 0, but represents the same magnetic field\nas Eq. (54). We can define therefore only a gauge field with a singularity, if we try to\ndescribe the whole space by a single gauge field. The singularity is regarded as a Dirac's\nstring. Instead, we can cover the whole space by patching two gauge fields, ASμ and Eq. (53),\nwhich we call AN\nμ . They are related by a gauge transformation\n~ −1\nS\nAN\nμ = Aμ + i Θ ∂μ Θ,\ne\n\n(58)\n\nwhere\neg\n\nΘ ≡ e−i h φ ,\n\n(59)\n\nis a gauge transform function. This function must be single valued, i.e., is invariant under\nφ → φ + 2π. Thus a condition\neg = 2πh,\n\n(60)\n19\n\n\fis imposed, which is a Dirac's quantization condition (Eq. (15)).\nMechanism of generation of a hedgehog monopole is essentially the same as a GUT\nmonopole, namely, a symmetry breaking of a non-Abelian gauge field (SU(2) for a hedgehog\nand SU(5) for GUT). There is, however, a difference in the two models. A GUT monopole\nis a composite object of a gauge field and a Higgs field, and the monopole solution is solved\nin the same footing as a Higgs field. In a case of hedgehog monopole, in contrast, local spin\nstructure is treated as a background field which is treated as not to be affected by gauge\nfield.\nThe effective magnetic field of a hedgehog monopole configuration, Eq. (46), is sometimes\ncalled the spin Berry's phase, and the electric field is known as the spin motive force [8].\nThe magnetic field has been observed for example in the anomalous Hall effect [17], and the\nelectric field has been observed by inducing magnetization dynamics such as domain wall\nmotion [15]. These experiments do not, however, mean existence of hedgehog monopole,\nsince as explained in §IV.\n\nD.\n\nHedgehog monopole in weak exchange coupling regime\n\nUntil very recently, a hedgehog monopole has been discussed exclusively in the adiabatic\n(strong sd coupling) regime. As we have discussed in the earlier sections, a symmetry\nbreaking of spin SU(2) space to a U(1) space of electromagnetism is clearly defined in\nthis regime. However, hedgehog monopole is not an object restricted to adiabatic regime.\nIn fact, introduction of an exchange interaction to rotationally invariant spin results in a\nsymmetry breaking even if the interaction is weak. In this section, we will demonstrate\nthat the hedgehog monopole emerges even if the exchange coupling J is small following the\nanalysis in Ref. [35]. We cannot approach monopoles in this regime by a standard gauge\nfield argument. Here we apply instead a novel method pointed out in Ref. [10, 35] based on a\ntransport calculation. In a transport method, effective electromagnetic fields are calculated\nby evaluating electric charge density and current density induced by local spin structure\nby use of Keldysh Green's functions. A monopole field is then identified by deriving the\nMaxwell's equation for the effective fields.\nWe consider a disordered metal, and take account of the spin-independent impurity scat20\n\n\ftering represented as\nZ\nHi = d3 rc† vi c,\n\n(61)\n\nvi being the impurity potential. In the following calculation, the impurities are approximated\nas random point scatterers and the averaging is carried out as\nhvi (r)vi (r ′ )ii = ni u2i δ 3 (r − r ′ ),\n\n(62)\n\nwhere ni and ui are the impurity concentration and the strength of the scattering, respectively [36]. The impurities give rise to an elastic lifetime for the electron, τ , which is\ncalculated as\nτ=\n\n~\n,\n2πni u2i ν\n\n(63)\n\n(ν is the density of states per volume). The total Hamiltonian discussed in this section is\nH = H0 + Hi + Hsd .\n\n(64)\n\nThe electric charge density is\nρ(r, t) = −etrhc† (r, t)c(r, t)i,\n\n(65)\n\nwhere the bracket represents the quantum expectation value and tr is a trace over spin\nindices, and electric current density is given as\nji (r, t) =\n\ne~2\n(∇r − ∇r′ )i trG< (r, t; r ′ , t)\n2m\n\nr ′ =r\n\n,\n\n(66)\n\nwhere\n′ ′\nG<\ns,s′ (r, t; r , t ) ≡\n\ni † ′ ′\nhc ′ (r , t )cs (r, t)i,\n~ s\n\n(67)\n\n(s and s′ are spin indices) is the lesser component of the non-equilibrium Green's function\n[37]. This Green's function defined on the Keldysh contour C satisfies the Dyson's equation,\nGss′ (r, t; r ′, t′ ) =δs,s′ gs (r, t; r ′ , t′ )\nZ\nZ\n3 ′′\ndt′′ gs (r, t; r ′′ , t′′ )\n+ d r\nC\n\n′′\n\n× [δs,s′′ vi (r ) − JS(r ′′ , t′′ ) * σss′′ ]\n× Gs′′ s′ (r ′′ , t′′ ; r ′ , t′ ),\n\n(68)\n21\n\n\fFIG. 9.\n\nDiagrammatic representation of the electric current, j, induced by sd interaction with\n\nlocal spin, S. Solid lines represent the conduction electron's Green's function and wavy lines are the\ninterection with S. The first diagram is a contribution of an effective electric and magnetic fields\nlocal in space, and the second diagram, containing a diffusion ladder (vertex corrections) denoted\nby the gray shaded oval, results in a diffusive current (a gradient of electric charge density).\n\nwhere Gss′ (r, t; r ′ , t′ ) ≡ −(i/~)hTC [cs (r, t)c†s′ (r ′ , t′ )]i (TC is the path-ordering operator on\nC) and g denotes free Green's function. This equation is solved by iteration. Here, we\nassume slowly varying magnetization profile Sq,Ω in space and time: the spatially smooth\nmagnetization structure compared to the electron mean free path l, ql ≪ 1 (q is a wave\nnumber of magnetization texture), and the sufficiently slow dynamics of magnetization,\nΩτ ≪ 1 (Ω is a frequency of magnetization dynamics).\nTo see a hedgehog monopole, it is enough to discuss the electric current to the third-order\nin the exchange coupling, J. This contribution is diagrammatically shown in Fig. 9 and is\ncalculated as\nji (r, t) =\n\neJ 3 X X −iQ*r+iΩt\ne\nSq,ω * (Sq′ ,ω′ × SQ−q−q′ ,Ω−ω−ω′ )\nπmV k,q,q′ ,Q ω,ω′ ,Ω\n\u0014 3\n\u0015\ni~\n′\na 4\n2\n′ a 2\n×\nqi (Q * q )Im(gk ) − 2τ ωqi |gk | − D∇i ρ(r, t),\n30m\n\n(69)\n\nwhere\ngka =\n\n1\nǫF −\n\n~2 k 2\n2m\n\n−\n\ni~\n2τ\n\n,\n\n(70)\n\nis the advanced Green's function (ǫF is the Fermi energy), Im means taking an imaginary\ncomponent, V is system volume, and D = 2ǫF τ /3m denotes a diffusion constant. The last\nterm is a diffusive contribution arising from vertex corrections shown in the right diagram\nof Fig. 9 and electric charge density, ρ, is calculated as\nρ=\n\nE\n4eνJ 3 τ 4 D\n∇i S * (Ṡ × ∇i S) ,\n~m\nD\n\n(71)\n22\n\n\fwhere h* * *iD is an average including electron diffusion, which satisfies\n(−D∇2 + ∂t )hF (r, t)iD =\n\n1\nF (r, t),\nτ\n\n(72)\n\n(F is an arbitrary function depending on space r and time t).\nSumming over the wave vectors in Eq. (69), we obtain the electric current,\nji = −\n\n\u0002\n\u0003 4eνJ 3 τ 3\ne~3 νJ 3\nǫ\nǫ\n∇\nS * (Ṡ × ∇i S) − D∇i ρ. (73)\nS\n*\n(∇\nS\n×\n∇\nS)\n−\nijk\nklm\nj\nl\nm\n960m2 ǫF 3\n~m\n\nAs was pointed our in Ref. [35], the effective electric and magnetic fields (Eh and Bh ) are\nread from the above result by comparing it with a general expression,\nj = (1/μ)∇ × Bh + σc Eh − D∇ρ,\n\n(74)\n\nwhere μ is magnetic permeability,\n\u0012\n\u00132\ne2 ν ~kF\n2\nτ,\nσc ≡ e nτ /m =\n3V\nm\n\n(75)\n\nis electric conductivity. The result is\nEh,i = −2γh S * (Ṡ × ∇i S),\n\n(76)\n\nBh,i = γh ǫijk S * (∇j S × ∇k S),\n\n(77)\n\nwhere\nγh ≡ 6~\n\nmJ 3 τ 2\n,\n~4 k F 2\n\n(78)\n\nand we defined magnetic permeability as\n\u0012 \u00132\n1\n1\ne2 ν ~\n=−\n.\nμ\n45 * 25 ~2 kF 4 V τ\n\n(79)\n\nObviously, these effective fields satisfy the Faraday's law and the Gauss's law with magnetic\nmonopole,\n∇ × Eh + Ḃh = −jh\n∇ * Bh = ρh ,\n\n(80)\n\nwhere magnetic monopole contributions are\njh,i = −3γh ǫijk Ṡ * (∇j S × ∇k S),\n\n(81)\n\nρh = γh ǫijk ∇i S * (∇j S × ∇k S).\n\n(82)\n23\n\n\fThere is therefore hedgehog monopole in the weak sd coupling case, too, although the\ncoefficients in Eq. (82) differ from the strong coupling limit. It is notable that the structure\nof the electromagnetism, i.e., U(1) gauge field, (and further, that with monopole in the\npresent case) is embedded in the electron transport phenomena.\nWe note here that the definition of Eh , Bh , μ according to Eq. (74) and the dielectric\nconstant ǫ according to the Gauss's law has arbitrariness. In fact, the condition imposed\nby the transport properties (j and ρ) is not sufficient to fix the two effective fields uniquely,\nand an additional condition seems to be required. Nevertheless, existence of monopole holds\ntrue; both of the monopole current and density cannot be deleted at the same time by\nredefining the fields. Further, as noted in Ref. [35], the product ǫμ is invariant; a physical\nquantity of the velocity of the effective topological electromagnetic field is uniquely given as\n1\n~\n1\nvtop ≡ √ = √\n.\nǫμ\n8 30 kF ǫF τ 2\n\n(83)\n\n~kF τ\n,\nm\n\nis 10Å, ǫF τ /~ = 3.3 by choosing kF −1 = 1.5Å, the speed\n\nIf elastic mean free path, l ≡\n\nof the topological electromagnetic wave is thus rather large, about 900m/s. The topological\nelectromagnetic field may be useful to transport spin information in a different manner from\nmagnon transports.\n\nVI.\n\nSPIN DAMPING MONOPOLE\n\nAs we have seen, the hedgehog monopole is a topological object and has locally vanishing\ndensity and current only. The hedgehog monopole hence does not locally coupled to the\nelectromagnetism. Very recently, a novel monopole in magnets with locally finite density\nand current density was discovered by Takeuchi et al [10]. Such a monopole creates a\nrotational electric field via the Ampère's law (Fig. 2), and thus it acts as an anomalous\nangular momentum source which induces rotational motion of electric charge. To realize\nsuch a monopole, Takeuchi et al. included the spin-orbit interaction.\nThe spin-orbit interaction exists in any elements including magnetic ones, and is particularly strong in heavy elements such as platinum and gold, and at the interfaces in junctions\nwhere the inversion symmetry is broken [38]. Two types of the spin-orbit interaction were\nthus considered in Ref. [10]. The first is the one from a uniform field, ER , namely the\nRashba interaction [39]. Such a field is realized at the interfaces and surfaces. The Rashba\n24\n\n\finteraction in metallic films recently turned out to be particularly useful for current-driven\nmagnetization switching [40, 41]. The second is the one from a random potential, vi , induced\nby heavy impurities. This random heavy impurity model would also simulate the effect of\nspin-orbit interaction in heavy pure metals. The total spin-orbit interaction thus reads\nZ\n1\nHso = −\nd3 rc† [(λR ER − λi ∇vi ) * (p × σ)] c,\n(84)\n~\nwhere p is the electron's momentum and λ is a spin-orbit coupling constant (the subscript\nR and i characterize Rashba and impurity-induced ones, respectively). The interaction with\nthe magnetization is described by Hsd . The Hamiltonian of the present system is, therefore,\ngiven as\nH = H0 + Hi + Hsd + Hso .\n\n(85)\n\nThe electric current, j, generated in the system by magnetization dynamics is calculated by\nevaluating a quantum field theoretical expectation value of electron velocity operator,\nv̂ = −(i~/m)∇ + (1/~)(λR ER − λi ∇vi ) × σ.\nThe electric current thus reads\n\u0013\n\u0015\n\u0014\u0012 2\n~\n<\n′\n.\n(∇r − ∇r′ ) + i[λR ER − λi ∇vi (r)] × σ G (r, t; r , t)\nj(r, t) =e tr\n2m\nr ′ =r\n\n(86)\n\n(87)\n\nThis expectation value is evaluated by solving the following Dyson's equation,\nGss′ (r, t; r ′, t′ ) =δs,s′ gs (r, t; r ′ , t′ )\nZ\nZ\n3 ′′\ndt′′ gs (r, t; r ′′ , t′′ )\n+ d r\nC\n\n× (δs,s′′ vi (r ′′ ) − JS(r ′′ , t′′ ) * σss′′\n+ i{[λR ER − λi ∇vi (r ′′ )] × ∇r′′ } * σss′′ )\n× Gs′′ s′ (r ′′ , t′′ ; r ′ , t′ ).\n\n(88)\n\nThis equation is solved treating λ and J perturabatively to the linear and second orders,\nrespectively. Contributions to current is represented by Feynman diagrams in Figs. 10 and\n11.\nWe consider sufficiently slow dynamics of magnetization, namely Ωτ ≪ 1 (Ω is a frequency\nof magnetization dynamics), and assume that the magnetization structure varies smoothly\n25\n\n\fFIG. 10.\n\nDiagrammatic representations of electric current pumped by magnetization dynamics\n\nand the Rashba interaction. Solid lines represent the conducting electron Green's functions, and\ndouble dashed and wavy lines represent the Rashba spin-orbit interaction (ER ) and the interaction\nwith localized spin (S), respectively. The first three contributions correspond to effective electromagnetic fields, and the last two contributions, containing diffusion ladders (vertex corrections)\ndenoted by the gray shaded ovals.\n\nin the space compared to the electron mean free path l, i.e., ql ≪ 1 (q is a wave number of\nmagnetization profile). The leading contribution in this case turns out to be\nj(r, t) = −\n\neJ 2\n2πV\n\nX\n\nX\n\ne−i(q1 +q2 )*r+i(Ω1 +Ω2 )t Ω1\n\nk,k′ ,q1 ,q2 ω,Ω1 ,Ω2\n\n× (Sq1 ,Ω1 × Sq2 ,Ω2 ) × [\n\niλR τ\nER |gka |2\n~\n\n4~2 λi\n(q1 + q2 )εk |gka |2 |gka ′ |4 ]\n+\n2\n3πντ\n− D∇ρ(r, t).\n\n(89)\n\nThe last term is the diffusive contribution arising from the vertex corrections, where the\nelectric charge density ρ is\nρ=\n\n4eνλR J 2 τ 3\n∇ * hER × (S × Ṡ)iD .\n~2\n\n(90)\n\nHere h* * *iD represents the average including the electron diffusion, defined in Eq. (72).\nSumming over the wave vectors and frequencies in Eq. (89), the electric current is obtained\n26\n\n\fFIG. 11.\n\nContribution to the electric current driven by a precession of localized spin and ran-\n\ndom impurity-induced spin-orbit interaction. Filled circles are spin-orbit interactions arising from\nrandom impurities (SOI), filled diamonds are nonmagnetic impurity scatterings (imp), and dotted\nlines linking filled circles to filled diamonds represent impurity average.\n\nas\n16eνλi J 2 ǫF τ 2\n∇ × (S × Ṡ)\n3~2\n4eνλR J 2 τ 2\nER × (S × Ṡ) − D∇ρ.\n−\n~2\n\nj =−\n\n(91)\n\nThis result is rewritten by use of effective electric and magnetic fields, Es and Bs , as\nj=\n\n1\n∇ × Bs + σc Es − D∇ρ,\nμ\n\n(92)\n\nwhere the effective fields are defined as\nEs ≡ −αR ER × N ,\nBs ≡ −βi N .\n\n(93)\n\nN ≡ S × Ṡ,\n\n(94)\n\nHere\n\n27\n\n\fFIG. 12. Left: Schematic illustration of damping of a precessing local spin S. A vector product\nof a time derivative of spin, Ṡ, and S is a vector N ≡ S × Ṡ. Its average is N , which is along\nthe precession axis, and it represents a time-averaged dissipated spin magnitude. Right: Damping\ntorque, N , results in a damping of spin precession when an external magnetic field B is applied.\n\nis a vector representing the spin damping torque (see §B) (Fig. 12) [33, 42]. Coefficients αR\nand βi are\n4eνλR J 2 τ 2\nσc ~2\n16eνμλi J 2 ǫF τ 2\n.\nβi ≡\n3~2\n\nαR ≡\n\n(95)\n\nThe effective fields calculated here are the ones acting on the electronic spin in the same\nmanner as the effective fields from the hedgehog monopole. Clearly, the fields [Eq. (93)] do\nnot satisfy the Faraday's law and the Gauss's law of the conventional electromagnetism, but\nthe ones with monopole contribution,\n∇ × Es + Ḃs = −jm ,\n∇ * Bs = ρm ,\n\n(96)\n\nwhere the monopole current and monopole density read\njm = αR ∇ × (ER × N ) + βi Ṅ ,\n\n(97)\n\nρm = −βi ∇ * N .\n\n(98)\n\nand\n\nWe have thus proved that a monopole emerges when spin damping occurs, namely we\nhave a spin damping monopole. The spin damping monopole is a composite object made\nfrom a magnetization configuration in the same manner as the hedgehog monopole. The\nmonopole satisfies the conservation law, ρ̇m + ∇ * jm = 0.\n28\n\n\fA.\n\nRemarks on uniqueness of effective fields\n\nEquation (96) apparently contains an arbitrariness. In fact, one may think that a transformation Es → Es + (1/σc )∇ × C and Bs → Bs − μC, where C is an arbitrary vector field,\nis possible without changing Eq. (96). However, such a transform is not allowed because of\na gauge invariance in the original space with a higher symmetry, as is known in the case of\nhedgehog monopole, where an SU(2) gauge invariance forbids this arbitrariness.\nValidness of our definition of Es and Bs in Eq. (93) is supported by the following\nargument. In Eq. (92), electron diffusion (D∇ρ) induces the effective electric and magnetic\npolarizations Ps and Ms , respectively. By using the relation\n(−D∇2 + ∂t )ρ = −σc ∇ * Es ,\n\n(99)\n\nthe electric current (eq. (92)) is described as the rotation of the magnetic field and the time\nderivative of the electric field,\nj = ∇ × Hs − Ḋs ,\n\n(100)\n\nwhere Hs and Ds are the fields defined as\nHs ≡\n\n1\nBs − Ms\nμ\n\nDs ≡ εEs + Ps ,\n\n(101)\n\nwith ε = −σc τ being the permittivity, respectively. In Eq. (101), Es and Bs are naturally\nidentified with the electric and magnetic fields, respectively. By use of these fields, two of\nthe Maxwell's equations become\n′\n∇ × Ds + Ḣs = jm\n\n∇ * Hs = ρm .\n\n(102)\n\n′\nHere jm\nis redefined monopole current, which is non-local.\n\nB.\n\nSpin damping monopole generation in a ferro-normal junction\n\nThe spin damping monopole is unique since it does not require a particular non-coplanar\nspin structure like a hedgehog, and so it exists quite generally in magnetic systems. The\n29\n\n\fθ\n\nFIG. 13.\n\nSchematic illustration of monopole pumping and detection in a thin ferromagnetic\n\nfilm attached on a non-magnetic layer. Magnetization (S) precession is induced by applying an\noscillating magnetic field. The amplitude of presession is represented by an angle θ. The Rashba\nfield, ER , exists at the interface and creates the monopole current, jm , near the interface. The width\nof the monopole current distribution, d, is comparable to the decay length of the magnetization\nat the interface. The monopole current induces an electric current, j, via the Ampère's law at\nthe interface. The impurity spin-orbit interaction directly induces positive (+) and negative (−)\nmonopole charge distribution, ρm , at the two edges.\n\nsimplest candidate for creating the monopole would be a thin ferromagnetic film put on\na non-magnetic insulator or metal shown in Fig. 13. We choose the z axis perpendicular\nto the film. The Rashba-type spin-orbit field would then arise at the interface along the\nz direction [38]. We excite the precession of the uniform magnetization by applying the\nalternating magnetic field in the yz plane in the presence of static field along the x axis (ferromagnetic resonance [42]). The precession results in the spin damping vector with a finite\ntime average, N , along x direction. In the present case with the uniform magnetization,\nspatial derivatives in Eqs. (97) and (98) arise at the interface and at the edges, where the\nmagnetization vanishes. The Rashba interaction contributes to the DC monopole current\nat the interface as\nR = −α E\njm,x\nR R\n\nαR\n∂N\n≃ − ER N,\n∂z\nd\n\n(103)\n\nwhere d is the spatial scale of the magnetization decay at the interface. The monopole\ncurrent driven by the random spin-orbit impurities, on the other hand, vanishes when time30\n\n\faveraged. The total DC monopole current thus reads\nαR\njm = −ex ER N,\n(104)\nd\n(ex represents the unit vector along the x direction). This monopole current at the interface generates the electromotive force along the y direction via the Ampère's law for the\nmonopole. The monopole density induced by the random spin-orbit interaction arises at the\nedge of the ferromagnetic film since ∇ * N ≃ ∂Nx /∂x is finite there. The induced monopole\ndensity at the two edges is\nβi\nρm = ∓ N,\n(105)\nd\nwhere the sign is positive on one side of the edge and negative on the other side. The\nmonopoles then produces a magnetic field along the x direction as\nBs = −ex βi N.\n\n(106)\n\nThis field creates the electric current in the y direction via the conventional Ampère's law.\nThe averaged electric current density generated by the spin damping monopole [Eq. (92)]\nthus reduces to\nβi\n(107)\n)N .\nμd\nWe have thus found that when magnetization precession occurs in a metallic ferro-normal\nj = −ey (σc αR ER +\n\njunction, a current of voltage arises perpendicular to the junction and a precession axis. As\nfar as electric detection concerns, a monopole effect appears qualitatively the same as an\ninverse spin Hall effect [12], which is a widely-used experimental method for spin current\ndetection. We will examine this important point later in §VII A.\nLet us look into the monopole signal quantitatively. We define energy scales of Rashba\nand impurity spin-orbit interactions as (kF is Fermi wavelength)\nλR 2\n∆R ≡\nkF vR\ne\n∆i ≡ λi kF 2 vi ,\nwhere vR ≡\n\ne\nkF\n\n(108)\n\nER is a potential energy due to Rashba electric field, ER . Coefficients αR\n\nand βi then read\n\u00132 \u0012\n\u0013\n∆R\nJ\nτ\nαR = 12π\nǫF\nvR\n\u0012 \u00132 \u0012 \u0013 \u0010\n∆i\nǫF τ \u00112\n16\nJ\nβi = μekF\n.\n3\nǫF\nvi\n~\n2\n\n\u0012\n\n(109)\n31\n\n\fβi and μekF have dimension of Tesla*sec. Here we used ν = kF 3 /ǫF , n = kF 3 /(6π 2) and\nσc = e2 nτ /m.\nWhen the spin damping arises from the magnetization precession with the frequency Ω\nand the angle θ (Fig. 13), the magnitude of a monopole-induced current density, Eq. (107),\nreads\n|j̄| =\n\n4ekF2 Ω\n\n\u0012\n\nJτ\n~\n\n\u00132\n\n\u0015\n∆R 4 1 ∆i\n+\n.\nsin θ\nεF\n3 kF d vi\n\u0014\n\n(110)\n\nWe consider a disordered ferromagnets with J/εF ∼ 0.1, εF τ /~ ∼ 10 and kF−1 ∼ 2 Å(ǫF =\n~2 k F 2\n2m\n\n= 1.51 × 10−19 J= 0.95eV and τ = 7.0 × 10−15 s). Rashba interaction strength is chosen\n\nas ∆R /εF ∼ 0.1, considering an enhancement on the surfaces and the interfaces [43]. We\nassume for simplicity that\n\n1 ∆i\nkF d vi\n\nis the same order of magnitude as\n\n∆R\n.\nǫF\n\nWhen θ = 30◦ and\n\nΩ = 1 GHz, the electric current density is thus\n|j̄| = 1.6 × 109 A/m2 ,\n\n(111)\n\nwhich is sufficiently large for experimental detection. In addition to DC, there is AC component in Eq. (92) which would be accessible by a time-resolved measurement.\nThe current corresponds to an effective electric field, Eq. (93), with a magnitude\n\u0012\n\u00132 \u0012 \u00132\n1\n∆R\nJ\n2 ǫF kF\n|ES | = αR kF vR Ω = 12π\nτ Ω.\n(112)\ne\ne\nǫF\nǫF\nFor the above values of parameters, the field is 390 V/m. The voltage induced by monopole\nwhen a sample width is 100nm is thus 39μV. The magnitude of effective magnetic field, Eq.\n(93), is\n16\n|BS | = βi Ω = μekF Ω\n3\n\n\u0012\n\n∆i\nvi\n\n\u00132 \u0012\n\nJτ\n~\n\n\u00132\n\n,\n\n(113)\n\nwhich is estimated as 5.4m Tesla if we choose μ = 105 ×μ0 (μ0 = 4π×107 H/m is permeability\nin vacuum) as in the case of permeability of permalloy for the ordinary magnetic field. We\nnote that μ here is a permeability for effective magnetic field and can be different from the\none for ordinary magnetic field. For correct quantitative estimate, magnetic properties for\nthe effective magnetic field needs to be investigated further.\nThe monopole current, Eq. (97), is estimated to be\n|jm | ≃\n\n|Es |\n∼ 4 × 1011 V/m2 .\nd\n\n(114)\n32\n\n\fThis value, however, cannot be converted into usual dimension of current density, A/m2 ,\nsince permeability of the effective field is not known.\nWe note that the electric current estimated here is an initial current that arises when the\npumping of monopoles starts. When the monopole current is pumped steadily, the monopole\naccumulation grows at the edges of the system, inducing a diffusive current. The steady\nmonopole distribution is then determined by the balance of this backward diffusion and the\npumped monopole current.\n\nVII.\n\nDISCUSSION\n\nIn this paper, we have succeeded in proving existence of monopoles by deriving Maxwell's\nequation by a transport calculation in §V D and §VI. There remains, however, a few points\nto be clarified in the transport approach to spin damping monopole.\nFirst is a question whether spin damping monopole has a topological meaning or not. In\na case of hedgehog monopole, it was a topological object in three space dimensions, while\ntopological nature seems to be lacking in the expression of spin damping monopole density\n(Eq. (98)). What is crucially different in spin damping monopole is that it needs dynamic\nspins (Ṡ). Thus, if there is any topological meaning, it should be discussed in both space\nand time.\nSecond point is a gauge field representation of spin damping monopole. In a case of\nhedgehog monopole, it was obvious in the strong coupling limit. Even in the weak coupling\nlimit, it is straightforward to see from the effective fields (Eq. (77)) that the gauge field\ndescribing hedgehog monopole is AzS = 12 (1−cos θ)∂μ φ (defined in Eq. (33)). A quantization\ncondition for a monopole charge then arose naturally from the condition that a gauge field\ncan be defined to cover the whole space (Eq. (60)). In a case of spin damping monopole, an\neffective magnetic field in Eq. (93) cannot be written as a rotation of a local effective vector\npotential (because there is a monopole), but is represented by a nonlocal vector potential\nas Bs = ∇ × A(sd) + Φ, where (see Eq. (8))\nZ\nX\n(sd)\nǫijk drj′ Nk (r − r ′ ),\nAi (r) = −βi\njk\n\n(115)\n\nL\n\nand Φ represents a string singularity field. Based on this expression, the same argument\nas Dirac for a quantization condition [1] is valid, and thus the charge of a spin damping\n33\n\n\fmonopole g is quantized as in Eq. (15). In order to understand fully the origin of spin\ndamping monopole, it is important to study if the monopole is represented by patching two\nor more local gauge fields (see §V C). This would be carried out by studying a clean (τ = ∞)\nand strong sd coupling limit.\n\nA.\n\nMonopole interpretation of the inverse spin Hall effect\n\nThe electromotive force discussed above is a result of the Maxwell's equation for the\nmonopole, which is an exact equation required by the gauge invariance. If one detects\nthe electromotive force given by Eq. (112), it becomes a direct evidence of spin damping\nmonopole. The electromotive force here acts on the spin of the electron, and thus can\nbe detected electrically as has been demonstrated [15]. Remarkably, the observation of\nspintronics monopoles might have already been achieved. In fact, the electric voltage due to\nthe magnetization precession has been observed in a system of ferromagnet on a Pt film [12]\nand the direction of the voltage was in agreement with our prediction from the monopole.\n(The spin-orbit interaction expected in Pt is an intrinsic one due to periodic atoms, but\nthe effect is expected to be the same as the one from the random potential. In addition,\ninterface Rashba interaction might also be there. Therefore the monopole scenario would\napply to the system in Ref. [12].) In Ref. [12], the mechanism for the voltage generation was\nargued to be the inverse spin Hall effect. According to the inverse spin Hall explanation, the\nmagnetization precession generates spin current via the spin pumping effect, and the spin\ncurrent, js , is converted into charge current by the spin-orbit interaction (the inverse of the\nspin Hall effect). This explanation assumes that the conversion mechanism of [44]\nji = λ\n\nX\n\nk\nǫijk js,j\n,\n\n(116)\n\njk\n\nwhere λ is a constant representing the strength of the spin-orbit interaction and k is the index\nfor the spin polarization of the spin current. This formula is, however, physically incorrect.\nIn fact, the charge current is a conserved quantity, while the spin current is not because of\nthe spin relaxation, and thus these two currents should not be simply proportional to each\nother. To put in other words, spin current does not have a unique definition because of its\nrelaxation, and thus is not physical. A spin current explanation is therefore an approximate\none which might be justified only at very short distance (less than the spin relaxation length).\n34\n\n\fIndeed, it has been theoretically demonstrated that that conversion formula is not satisfied\nin a case of slowly varying magnetization configuration [45]. In contrast to the spin current\nscenario, our monopole scenario is a result of Maxwell's equations, required by a symmetry\nof the electromagnetism. Since monopole is a conserved quantity satisfying ρ ̇m + ∇ * jm = 0,\nmonopole scenario is based on a relation between physical quantities, the electric field and\nmonopole. Our scenario therefore explains the \"inverse spin Hall effect\" free from ambiguity,\nin contrast to the spin current one.\nFor experimental confirmation of the spin damping monopole, of crucial importance is\nthe separation of the monopole signal from the inverse spin Hall signal driven by the spin\ncurrent. This is accomplished by applying an effective electric field perpendicular to the\njunction of Fig. 13. The monopole contribution then leads to the transverse electric current\nas a result of the Hall effect for the monopole, while the contribution of the spin current is\nnot affected.\nObservation of the effective magnetic field emitted by monopoles, Eq. (93), by use of\nmuons or neutrons or electron holography would be also a direct evidence of monopole\ngeneration.\n\nB.\n\nRemarks on spin current\n\nOur analysis has also proved that the spin current does not modify the fundamental law\nof electromagnetism, namely Maxwell's equations. Historically, there have been arguments\nthat the spin current would create the electromotive force by a modified Ampère's law based\non the assumption that the spin current is equivalent to the flow of two monopole charges\n[46]. Quantum mechanics tells us that this idea is too naive, since the spin is a point object\nand thus the separation between the magnetic charges are strictly zero, even if one dares\nto interpret spin by two magnetic charges. The monopole current associated with the spin\ncurrent is therefore absolutely zero. In fact, spin current is a quantity in an SU(2) spin\nspace which couples to the electromagnetism only when properly projected, and since we\nknow from the argument by Volovik [9] that the projection in the adiabatic limit gives rise\nonly to a hedgehog monopole current but not the spin current. Our study has proved that\nthe correct projection of the magnetic systems with the spin-orbit interaction introduces a\nmagnetic monopole in electromagnetism.\n35\n\n\fVIII.\n\nSUMMARY\n\nAs we have discussed, magnetic monopoles are common objects in solids; they emerge in\nferromagnetic metals from topological spin structures and from dynamic spin (magnetization) with damping. Although monopoles have been discussed so far based on a gauge theory,\nwe have presented a novel method to access monopoles based on a transport calculation.\nIn monopoles in ferromagnets, of particular interest are spin damping monopoles, generated in a simple system of a ferromagnet and heavy metal. They open a novel path for\nconnecting magnetism and electronics via an analog of Ampère's law. A novel concept of\nmonopolotronics, control of monopoles, proposed in Ref. [10], is expected to be useful for\nrealizing next generation spintronic devices.\n\nACKNOWLEDGMENTS\n\nThe authors are grateful to N. Kitazawa for discussion. This work was supported by\na Grant-in-Aid for Scientific Research (B) (Grant No. 22340104) from Japan Society for\nthe Promotion of Science and UK-Japanese Collaboration on Current-Driven Domain Wall\nDynamics from JST. Two of the authors (A.T. and K.T.) are financially supported by the\nJapan Society for the Promotion of Science for Young Scientists.\n\nAppendix A: Electromagnetic fields in the relativistic representation\n\nIn this section, we briefly summarize the electromagnetism theory in the relativistic representation using 4-vectors. We follow the convention used in Ref. [7]. Contravariant vectors,\nsuch as xμ = (t, x, y, z), are represented by the upper indices. Covariant vectors, represented by lower indices, are defined by multiplying the metric tensor gμν as, for example,\nxμ = gμν xν , where\n\n\ngμν\n\n1 0\n\n0\n\n0\n\n\n\n\n\n 0 −1 0 0 \n\n\n=\n.\n 0 0 −1 0 \n\n\n0 0 0 −1\n\n(A1)\n\n36\n\n\fThus covariant vector of the 4-dimensional coordinate is thus xμ = (t, −x, −y, −z). The\nproduct of the covariant vector and contravariant vector is a Lorentz invariant scalar, e.g.,\nxμ xμ = t2 −r 2 . (Note that we use relativistic notation only in this section. In other sections,\nupper and lower indices of the three-dimensional vectors means the same.) Differential\noperators are\n∂\n∂μ ≡ μ =\n∂x\n\n\u0012\n\n∂ ∂ ∂ ∂\n, , ,\n∂t ∂x ∂y ∂z\n\n\u0013\n\n∂\n,∂ ≡\n=\n∂xμ\nμ\n\n\u0012\n\n∂\n∂\n∂\n∂\n,− ,− ,−\n∂t ∂x ∂y ∂z\n\n\u0013\n\n.\n\n(A2)\n\nWe first describe the electromagnetism without monopole, namely, when there is. The\nelectromagnetic field tensor is defined by a U(1) gauge field Aμ as F μν = ∂ μ Aν − ∂ ν Aμ .\n\nIts components are (noting ∂i = −∂ i ) F ij = −ǫijk B k = Fij , where B k = (∇ × A)k , and\nF 0i = (∂t A + ∇φ)i = −E i = −F0i . In the matrix representation,\n\n\nF μν\n\n0 −Ex −Ey −Ez\n\n\n\n\n\nE\n\n0\n−B\nB\nz\ny \n x\nμ ν\nν μ\n= ∂ A −∂ A =\n.\n Ey Bz\n\n0\n−B\nx\n\n\nEz −By Bx\n0\n\n(A3)\n\nThe field strength tensor satisfies by definition the following identity\n∂μ F̃ μν = 0,\n\n(A4)\n\nwhere (ǫ0123 = 1 = −ǫ0123 is the four-dimensional antisymmetric tensor)\n1\nF̃ μν ≡ ǫμνρσ Fρσ .\n2\n\n(A5)\n\nThe 0-component of the identity (A4) is\n1\n∂i F̃ i0 = − ǫijk ∇i F jk = ∇ * B = 0,\n2\n\n(A6)\n\nand i-component reads\n\u0001\n1\n∂0 ǫijk Fjk − 2∂j ǫijk F0k\n2\n∂\n= − B − ∇ × E = 0.\n∂t\n\n∂0 F̃ 0i + ∂j F̃ ji =\n\n(A7)\n\nTherefore, the condition of no monopole, ∇ * B = 0, and the Faraday's law are trivial result\nof the U(1) gauge symmetry (definition of F μν = ∂ μ Aν − ∂ ν Aμ ).\n37\n\n\fAppendix B: Spin damping\n\nLet us look into a role of spin damping represented by a vector N = S × Ṡ. A spin\ndynamics is induced by magnetic field. An equation of motion for a spin is thus generally\ngiven by Landau-Lifshitz equation\nṠ = γBtot × S,\n\n(B1)\n\nwhere γ is gyromagnetic ratio and Btot represents the total magnetic field acting on S.\nBtot thus includes an external magnetic field, an internal field due to exchange interaction\nwith other localized spins, magnetic anisotropy field, and also the effect of coupling to other\ndegrees of freedom such as conduction electrons and phonons.\nWe know that damping or dissipation arises in general from a coupling to an environment, namely, other degrees of freedom. In a case of spins in metallic magnets, most strong\nsource of dissipation is conduction electron. Dissipation in this case is caused by spin-orbit\ninteraction, which converts spin angular momentum into orbital angular momentum. Therefore, damping effect is calculated by evaluating an effective magnetic field from conduction\nelectrons, resulting in [47]\nγBel = −αṠ,\n\n(B2)\n\nwhere α is a constant proportional to the spin-orbit interaction. The damping torque is\nthus represented by αS × Ṡ, called the Gilbert damping term. The equation of motion thus\nreads\nṠ = γB × S + αS × Ṡ,\n\n(B3)\n\nwhere B ≡ Btot − Benv is the field neglecting the effect of the environment, Benv . Equation\n(B3) is called Landau-Lifshitz-Gilbert equation.\nThe effect of Gilbert damping torque is understood by looking into Fig. 12. In fact, a\nvector S × Ṡ ≡ N tends to point the spin perpendicular to its precession direction, i.e., to\nthe equilibrium direction along the field B, and hence αN represents the spin dissipated by\nthe environment.\n\n[1] P. A. M. Dirac, Proc. Roy. Soc. London Ser. A 133, 60 (1931)\n\n38\n\n\f[2] G. 't Hooft, Nuclear Physics 79, 276 (1974)\n[3] A. Polyakov, JETP Lett. 20, 194 (1974)\n[4] B. Cabrera, Phys. Rev. Lett. 48, 1378 (May 1982)\n[5] T. M. Collaboration and M. A. et al., The European Physical Journal C Particles and Fields 25, 511 (2002), ISSN 1434-6044, 10.1140/epjc/s2002-01046-9,\nhttp://dx.doi.org/10.1140/epjc/s2002-01046-9\n[6] J. D. Jackson, Classical Electrodynamics, third edition ed. (Wiley, 1998)\n[7] L. H. Ryder, Quantum Field Theory (Cambridge University Press, 1996)\n[8] A. Stern, Phys. Rev. Lett. 68, 1022 (Feb 1992)\n[9] G. E. Volovik, J. Phys. C: Solid State Phys. 20, L83 (1987)\n[10] A. Takeuchi and G. Tatara, Journal of the Physical Society of Japan 81, 033705 (2012),\nhttp://jpsj.ipap.jp/link?JPSJ/81/033705/\n[11] A.\n\nTakeuchi\n\nand\n\nG.\n\nTatara,\n\nJournal of Applied Physics\n\n111,\n\n07C509\n\n(2012),\n\nhttp://link.aip.org/link/?JAP/111/07C509/1\n[12] E. Saitoh, M. Ueda, H. Miyajima, and G. Tatara, Appl. Phys. Lett. 88, 182509 (2006)\n[13] J. Ye, Y. B. Kim, A. J. Millis, B. I. Shraiman, P. Majumdar, and Z. Tesanovic, Phys. Rev.\nLett. 83, 3737 (1999)\n[14] G. Tatara and H. Kawamura, J. Phys. Soc. Jpn 71, 2613 (2002)\n[15] S. A. Yang, G. S. D. Beach, C. Knutson, D. Xiao, Q. Niu, M. Tsoi, and J. L. Erskine,\nPhys. Rev. Lett. 102, 067201 (2009), http://link.aps.org/abstract/PRL/v102/e067201\n[16] N. Nagaosa, J. Phys.Soc. Jpn. 77, 031010 (2008)\n[17] N. Nagaosa, J. Sinova, S. Onoda, A. H. MacDonald, and N. P. Ong, Rev. Mod. Phys. 82,\n1539 (May 2010), http://link.aps.org/doi/10.1103/RevModPhys.82.1539\n[18] A. A. Thiele, Phys. Rev. Lett. 30, 230 (1973), http://link.aps.org/abstract/PRL/v30/p230\n[19] T. Shinjo, T. Okuno, R. Hassdorf, K. Shigeto, and T. Ono, Science 289, 930 (2000)\n[20] K. Yamada, S. Kasai, Y. Nakatani, K. Kobayashi, H. Kohno, A. Thiaville, and T. Ono,\nNat. Mater. 6, 269 (2007)\n[21] U. K. Rössler, A. N. Bogdanov, and C. Pfleiderer, Nature 442, 797 (2006)\n[22] S. Muhlbauer, B. Binz, F. Jonietz, C. Pfleiderer, A. Rosch, A. Neubauer, R. Georgii, and\nP. Boni, Science 323, 915 (2009), http://www.sciencemag.org/cgi/reprint/323/5916/915.pdf,\nhttp://www.sciencemag.org/cgi/content/abstract/323/5916/915\n\n39\n\n\f[23] H. Yu, S. Granville, D. P. Yu, and J.-P. Ansermet, Phys. Rev. Lett. 104, 146601 (Apr 2010)\n[24] L. Balents, Nature 464, 199 (2010)\n[25] I. A. Ryzhkin, Journal of Experimental and Theoretical Physics 101, 481486. (2005)\n[26] H. Kadowaki, N. Doi, Y. Aoki, Y. Tabata, T. J. Sato, J. W. Lynn, K. Matsuhira,\n\nand\n\nZ.\n\nHiroi,\n\nJournal of the Physical Society of Japan\n\n78,\n\n103706\n\n(2009),\n\nhttp://jpsj.ipap.jp/link?JPSJ/78/103706/\n[27] S. T. Bramwell, S. R. Giblin, S. Calder, R. Aldus, D. Prabhakaran, and T. Fennell, Nature\n461, 956 (2009)\n[28] I.\n\nRyzhkin\n\nand\n\nM.\n\nRyzhkin,\n\nJETP\n\nLetters\n\n93,\n\n384\n\n(2011),\n\nISSN 0021-3640,\n\n10.1134/S0021364011070095, http://dx.doi.org/10.1134/S0021364011070095\n[29] J. P. Morgan, A. Stein, S. Langridge, and C. H. Marrows, Nature Physics 7, 7579 (2011)\n[30] X.-L.\n\nQi,\n\n1184\n\nR.\n\nLi,\n\nJ.\n\n(2009),\n\nZang,\n\nand\n\nS.-C.\n\nZhang,\n\nScience\n\n323,\n\nhttp://www.sciencemag.org/cgi/reprint/323/5918/1184.pdf,\n\nhttp://www.sciencemag.org/cgi/content/abstract/323/5918/1184\n[31] X.-L.\n\nQi\n\nand\n\nS.-C.\n\nZhang,\n\nRev. Mod. Phys.\n\n83,\n\n1057\n\n(Oct\n\n2011),\n\n213\n\n(2008),\n\nhttp://link.aps.org/doi/10.1103/RevModPhys.83.1057\n[32] A. N. Redlich, Phys. Rev. D 29, 2366 (May 1984)\n[33] G.\n\nTatara,\n\nH.\n\nKohno,\n\nand\n\nJ.\n\nShibata,\n\nPhysics Reports\n\n468,\n\nhttp://www.sciencedirect.com/science/article/B6TVP-4T9VP4P-1/2/1d39252a95415cb4df04a52a7c6\n[34] M. Popp, D. Frustaglia, and K. Richter, Phys. Rev. B 68, 041303 (2003)\n[35] A. Takeuchi and G. Tatara, proceeding of LT26(2011)\n[36] J. Rammer, Quantum Field Theory of Non-equilibrium States (Cambridge, 2007)\n[37] H. Haug and A.-P. Jauho, Quantum Kinetics in Transport and Optics of Semiconductors\n(Springer-Verlag, 2007)\n[38] L. Meier, G. Salis, I. Shorubalko, E. Gini, S. Schn, and K. Ensslin, Nature Physics 3, 650\n(2007)\n[39] E. Rashba, Sov. Phys. Solid State 2, 1109 (1960)\n[40] K.\n\nObata\n\nand\n\nG.\n\nTatara,\n\nPhys. Rev. B\n\n77,\n\n214429\n\n(2008),\n\nhttp://link.aps.org/abstract/PRB/v77/e214429\n[41] I. M. Miron, G. Gaudin, S. Auffret, B. Rodmacq, A. Schuhl, S. Pizzini, J. Vogel, and P. Gambardella, Nature Materials 9, 230 (2010)\n\n40\n\n\f[42] S. Chikazumi, Oxford University Press(1997)\n[43] C.\nP.\n\nR.\n\nAst,\n\nBruno,\n\nJ.\nK.\n\nHenk,\n\nA.\n\nKern,\n\nand\n\nErnst,\nM.\n\nL.\nGrioni,\n\nMoreschini,\n\nM.\n\nC.\n\nPhys. Rev. Lett.\n\nFalub,\n98,\n\n186807\n\nhttp://link.aps.org/abstract/PRL/v98/e186807\n[44] J. E. Hirsch, Phys. Rev. Lett. 83, 1834 (Aug 1999)\n[45] A. Takeuchi, K. Hosono, and G. Tatara, Phys. Rev. B 81, 144405 (Apr 2010)\n[46] Q.-f. Sun, H. Guo, and J. Wang, Phys. Rev. B 69, 054409 (Feb 2004)\n[47] H. Kohno, G. Tatara, and J. Shibata, J. Phys. Soc. Jpn. 75, 113706 (2006)\n\n41\n\nD.\n\nPacilé,\n(2007),\n\n\f"}