{"id": "http://arxiv.org/abs/1012.3022v1", "guidislink": true, "updated": "2010-12-14T13:24:07Z", "updated_parsed": [2010, 12, 14, 13, 24, 7, 1, 348, 0], "published": "2010-12-14T13:24:07Z", "published_parsed": [2010, 12, 14, 13, 24, 7, 1, 348, 0], "title": "Inclusive J/Psi photoproduction and polarization at HERA in the\n  kt-factorization approach", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1012.3258%2C1012.4344%2C1012.1515%2C1012.4010%2C1012.0066%2C1012.0245%2C1012.5240%2C1012.0342%2C1012.0217%2C1012.0308%2C1012.3356%2C1012.5472%2C1012.3774%2C1012.4967%2C1012.5111%2C1012.2138%2C1012.3701%2C1012.2640%2C1012.0594%2C1012.1593%2C1012.4829%2C1012.4061%2C1012.0047%2C1012.5326%2C1012.1468%2C1012.4241%2C1012.5633%2C1012.5843%2C1012.2242%2C1012.0319%2C1012.2264%2C1012.1151%2C1012.3575%2C1012.5860%2C1012.1105%2C1012.5133%2C1012.4528%2C1012.0784%2C1012.3611%2C1012.5792%2C1012.1380%2C1012.4917%2C1012.2096%2C1012.0388%2C1012.4979%2C1012.3730%2C1012.2174%2C1012.6044%2C1012.1153%2C1012.2045%2C1012.3326%2C1012.1503%2C1012.1770%2C1012.2591%2C1012.4936%2C1012.1808%2C1012.3761%2C1012.2884%2C1012.5385%2C1012.4153%2C1012.4148%2C1012.4041%2C1012.2990%2C1012.2905%2C1012.5670%2C1012.2214%2C1012.3702%2C1012.0480%2C1012.5736%2C1012.3749%2C1012.3925%2C1012.3237%2C1012.4734%2C1012.2463%2C1012.2760%2C1012.3304%2C1012.2842%2C1012.3022%2C1012.5978%2C1012.3505%2C1012.0827%2C1012.0465%2C1012.2651%2C1012.1071%2C1012.5904%2C1012.4633%2C1012.5193%2C1012.5573%2C1012.0458%2C1012.0698%2C1012.4914%2C1012.5776%2C1012.4959%2C1012.2514%2C1012.2573%2C1012.1787%2C1012.2473%2C1012.2959%2C1012.4710%2C1012.5192%2C1012.5440&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Inclusive J/Psi photoproduction and polarization at HERA in the\n  kt-factorization approach"}, "summary": "We investigate the inclusive photoproduction of J/Psi mesons at HERA within\nthe framework of the kt-factorization QCD approach. Our consideration is based\non the color singlet model supplemented with the relevant off-shell matrix\nelements and the CCFM and KMR unintegrated gluon densities in a proton and in a\nphoton. Both the direct and resolved photon contributions are taken into\naccount. Our predictions are compared with the recent experimental data taken\nby the H1 and ZEUS collaborations. Special attention is put on the J/Psi\npolarization parameters lambda and nu which are sensitive to the production\ndynamics.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1012.3258%2C1012.4344%2C1012.1515%2C1012.4010%2C1012.0066%2C1012.0245%2C1012.5240%2C1012.0342%2C1012.0217%2C1012.0308%2C1012.3356%2C1012.5472%2C1012.3774%2C1012.4967%2C1012.5111%2C1012.2138%2C1012.3701%2C1012.2640%2C1012.0594%2C1012.1593%2C1012.4829%2C1012.4061%2C1012.0047%2C1012.5326%2C1012.1468%2C1012.4241%2C1012.5633%2C1012.5843%2C1012.2242%2C1012.0319%2C1012.2264%2C1012.1151%2C1012.3575%2C1012.5860%2C1012.1105%2C1012.5133%2C1012.4528%2C1012.0784%2C1012.3611%2C1012.5792%2C1012.1380%2C1012.4917%2C1012.2096%2C1012.0388%2C1012.4979%2C1012.3730%2C1012.2174%2C1012.6044%2C1012.1153%2C1012.2045%2C1012.3326%2C1012.1503%2C1012.1770%2C1012.2591%2C1012.4936%2C1012.1808%2C1012.3761%2C1012.2884%2C1012.5385%2C1012.4153%2C1012.4148%2C1012.4041%2C1012.2990%2C1012.2905%2C1012.5670%2C1012.2214%2C1012.3702%2C1012.0480%2C1012.5736%2C1012.3749%2C1012.3925%2C1012.3237%2C1012.4734%2C1012.2463%2C1012.2760%2C1012.3304%2C1012.2842%2C1012.3022%2C1012.5978%2C1012.3505%2C1012.0827%2C1012.0465%2C1012.2651%2C1012.1071%2C1012.5904%2C1012.4633%2C1012.5193%2C1012.5573%2C1012.0458%2C1012.0698%2C1012.4914%2C1012.5776%2C1012.4959%2C1012.2514%2C1012.2573%2C1012.1787%2C1012.2473%2C1012.2959%2C1012.4710%2C1012.5192%2C1012.5440&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We investigate the inclusive photoproduction of J/Psi mesons at HERA within\nthe framework of the kt-factorization QCD approach. Our consideration is based\non the color singlet model supplemented with the relevant off-shell matrix\nelements and the CCFM and KMR unintegrated gluon densities in a proton and in a\nphoton. Both the direct and resolved photon contributions are taken into\naccount. Our predictions are compared with the recent experimental data taken\nby the H1 and ZEUS collaborations. Special attention is put on the J/Psi\npolarization parameters lambda and nu which are sensitive to the production\ndynamics."}, "authors": ["S. P. Baranov", "A. V. Lipatov", "N. P. Zotov"], "author_detail": {"name": "N. P. Zotov"}, "author": "N. P. Zotov", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1140/epjc/s10052-011-1631-4", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1012.3022v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1012.3022v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "21 pages, 15 figures", "arxiv_primary_category": {"term": "hep-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "hep-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1012.3022v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1012.3022v1", "journal_reference": "Eur. Phys. J. C 71, 1631 (2011)", "doi": "10.1140/epjc/s10052-011-1631-4", "fulltext": "Inclusive J/ψ photoproduction and polarization at HERA\nin the kT -factorization approach\narXiv:1012.3022v1 [hep-ph] 14 Dec 2010\n\nS.P. Baranova, A.V. Lipatovb, N.P. Zotovb\nOctober 23, 2018\na\n\nb\n\nP.N. Lebedev Physics Institute,\n119991 Moscow, Russia\n\nD.V. Skobeltsyn Institute of Nuclear Physics,\nM.V. Lomonosov Moscow State University,\n119991 Moscow, Russia\n\nAbstract\nWe investigate the inclusive photoproduction of J/ψ mesons at HERA within the framework\nof the kT -factorization QCD approach. Our consideration is based on the color singlet model\nsupplemented with the relevant off-shell matrix elements and the CCFM and KMR unintegrated\ngluon densities in a proton and in a photon. Both the direct and resolved photon contributions\nare taken into account. Our predictions are compared with the recent experimental data taken\nby the H1 and ZEUS collaborations. Special attention is put on the J/ψ polarization parameters\nλ and ν which are sensitive to the production dynamics.\nPACS number(s): 12.38.-t, 13.85.-t\n\n1\n\nIntroduction\n\nHeavy quarkonium production at high energies is subject of intense study from both theoretical and experimental points of view [1–3]. The puzzling history traces back to the early 1990s,\nwhen the measurements of the J/ψ and Υ hadroproduction cross sections at Tevatron energies\nrevealed a more than one order-of-magnitude discrepancy with the theoretical expectations of\nthe color singlet (CS) model [4]. This fact has induced extensive theoretical activity, mainly\nin the description of the formation of bound q q̄ state from the heavy quark pair produced in\nthe hard interation (photon-gluon or gluon-gluon fusion). In the CS model, only those states\nwith the same quantum numbers as the resulting quarkonium contribute to the formation of\n1\n\n\fa bound state. This is achieved by radiating a hard gluon in a perturbative process. In the\ncolor octet (CO) model [5], it was suggested to add the contribution of transition mechanism\nfrom q q̄ pairs to quarkonium, where a heavy quark pair is produced in a color octet state and\ntransforms into the final color singlet state by the help of soft gluon radiation. The CO model\nis based on the general principle of the non-relativistic QCD factorization (NRQCD) [6]. By\nadding the contribution from the octet states and fitting the free parameters one was able to\ndescribe the existing data on the J/ψ and Υ production at the Tevatron [7].\nHowever, recently the NLO QCD corrections to CS mechanism have been found to be\nessential in quarkonium production [8]. The large discrepances between experiments and LO\nCS predictions for J/ψ and Υ inclusive production can be largely resolved at NLO level within\nthe CS model [8,9]. These NLO corrections to the J/ψ production at the Tevatron enhance the\ncross section at large pT by two orders of magnitude [9, 10]. The complete NLO calculations\nof the J/ψ photoproduction at HERA slighly favor the presence of CO contributions [11, 12].\nIn order to achive agreement between the last calculations and the experimental data for the\npT -distributions measured at HERA and Tevatron the contribution of CO P-wave state to be\nasummed is negative [12, 13]. Another problem refers to the quarkonium spin alignment: the\nCO model predicts the strong transverse polarization of the produced mesons (see [1]). This\nis in disagreement with the data which point to unpolarized or even longitudinally polarized\nquarkoniums [14, 15].\nA different strategy is represented by the kT -factorization approach of QCD [16]. This approach is based on the Balitsky-Fadin-Kuraev-Lipatov (BFKL) [17] or Ciafaloni-Catani-FioraniMarchesini (CCFM) [18] evolution equations for non-collinear gluon densities in a proton or\nphoton. A detailed description and discussion of the kT -factorization approach can be found,\nfor example, in reviews [19]. Quarkonium production and polarization have own story in the\nkT -factorization approach. Shortly, it was demonstrated [20–24] that in the framework of this\napproach the experimental data on the heavy quarkonim production at HERA, RHIC and Tevatron can be reasonable well described without the CO contributions. It is important also that\nthe kt-factorization predicts the longitudinal polarization of J/ψ and Υ mesons as an immediate consequence of initial gluon off-shellness [25]. The results of recent theoretical caclulations\nof the NLO and NNLO corrections to CS quarkonium production in the framework of standard\npQCD [8, 9] are in much better agreement with the kT -factorization predictions [20–24] than it\nwas seen for LO collinear calculations.\nThe present note is motivated by the very recent experimental measurements [26, 27] of the\ninclusive J/ψ photoproduction cross sections performed by the H1 and ZEUS collaborations\nat HERA. These measurements have been performed with increased statistics and precision\nas compared with previous experimental analyses [28, 29]. The number of single and double\ndifferential cross sections are determined and the polarisation parameters λ and ν are measured\nin the several different reference frames (namely helicity, target and Collins-Soper frames) as\na function of J/ψ transverse momentum and elasticity variable z. Our main goal is to give a\nsystematic analysis of available experimental data [26–29] in the framework of the CS model\nand the kT -factorization approach supplemented with the CCFM gluon dynamics, what we\nnot done in our first paper [20]. In this analysis we will take into account both direct and\nresolved photon contributions (last of them are important at low z). Specially we concentrate\non the J/ψ polarization observables since it can be useful, in particular, in discriminating the\nCS and CO production mechanisms. Also we will study the possible sources of theoretical\n2\n\n\funcertainties of our predictions (i.e. uncertainties connected with the gluon evolution scheme\nand hard scale of partonic subprocess). To investigate the dependence of our predictions on the\nnon-collinear evolution scheme we will apply the unintegrated gluon densities derived from the\nusual (i.e. DGLAP-evolved) parton distributions (in the Kimber-Martin-Ryskin (KMR) [30]\napproximation).\nThe outline of our paper is following. In Section 2 we recall shortly the basic formulas of\nthe kT -factorization approach with a brief review of calculation steps. In Section 3 we present\nthe numerical results of our calculations and a discussion. Section 4 contains our conclusions.\n\n2\n\nTheoretical framework\n\nIn the present note we follow the approach described in detail in our previous paper [20].\nHere we only briefly recall the basic formulas.\nIn the framework of the CS model, the production of any heavy quarkonium is described\nas the perturbative production of a color singlet quark-antiquark pair in a state with properly\narranged the quantum numbers, according to the quarkonium state under consideration. Our\ncalculations in the kT -factorization approach are based on the off-shell (kT -dependent) photongluon and gluon-gluon fusion subprocesses γg ∗ → J/ψg and g ∗ g ∗ → J/ψg. The spin projection\noperator [4]\nJ(pψ ) = ǫ̂ψ (p̂ψ + mψ )/2mψ ,\n(1)\nis included to guarantee the proper quantum numbers of the created charmed quark pair. Here\nmψ , pψ and ǫψ are the mass, four-momentum and polarization vectors of produced J/ψ. In\naccordance with the non-relativistic formalism of bound state formation, the charmed quarks\nare assumed to each carry one half of the J/ψ momentum and the probability of creation of\nJ/ψ meson is determined by a value of wave function at the origin of coordinate space |Ψ(0)|2,\nwhich is known from the leptonic decay width [31]. The calculation of relevant off-shell matrix\nelements |M̄(γg ∗ → J/ψg)|2 and |M̄(g ∗ g ∗ → J/ψg)|2 has been described detally in [20]. Here\nwe would like to only mention two technical points. First, in according to the kT -factorization\nprescription [16], the summation over the incoming off-shell gluon polarizations is carried with\nP μ ∗ν\nǫ ǫ = kμT kνT /k2T , where kT is the gluon transverse momentum. Second, the spin density\nmatrix of J/ψ meson is determined by the momenta l1 and l2 of the decay leptons and is taken\nin the form1\n!\nX μ\nm2ψ μν\nμ ν\n∗ν\nν μ\nǫψ ǫψ = 3 l1 l2 + l1 l2 −\n/m2ψ .\n(2)\ng\n2\nThis expression is equivalent to the standard one ǫμψ ǫ∗ψν = −g μν + pμψ pνψ /m2ψ (which has been\nused previously in [20, 21]) but is better suited for studying the polarization variables.\nThe cross section of J/ψ photoproduction at high energies in the kT -factorization approach\nis calculated as a convolution of the off-shell partonic cross section σ̂ and the unintegrated\ngluon distributions in a proton and in a photon. The direct and resolved photon contributions\nP\n\n1\n\nThis formula has misprint in [22].\n\n3\n\n\fcan be presented in the following form:\n1\n1\nA(x2 , k22T , μ2 )×\n2\n2\n16π(x2 W ) z(1 − z)\ndφ2\n×|M̄(γg ∗ → J/ψg)|2dp2ψ T dk22T dz\n,\n2π\n\nσdir (γp → J/ψ X) =\n\nZ\n\n(3)\n\n1\nAγ (x1 , k21T , μ2)A(x2 , k22T , μ2 )×\n2\n2\n16π(x1 x2 W )\n(4)\ndφ1 dφ2\n∗ ∗\n2\n2\n2\n2\n,\n×|M̄(g g → J/ψg)| dpψ T dk1T dk2T dyψ dyg\n2π 2π\nwhere A(x, k2T , μ2 ) and Aγ (x, k2T , μ2 ) are the unintegrated gluon distributions in a proton and\nin a photon, yψ and yg are the rapidities of produced J/ψ meson and outgoing gluon and W\nis the photon-proton center-of-mass energy. The initial off-shell gluons have a fraction x1 and\nx2 of the parent proton and photon longitudinal momenta, non-zero transverse momenta k1T\n2\n2\nand k2T (k21T = −k1T\n6= 0, k22T = −k2T\n6= 0) and azimuthal angles φ1 and φ2 . The elasticity\nz denotes the fractional energy of the photon transferred to the J/ψ meson in the proton rest\nsystem: z = (pψ * pp )/(pγ * pp ), where pγ and pp are the four-momenta of the incoming photon\nand proton.\nThe unintegrated gluon distributions in a proton and in a photon involved in (3) and (4)\ncan be obtained from the analytical or numerical solutions of the BFKL or CCFM evolution\nequations. In the numerical calculations we have tested a few different sets. First of them,\nunintegrated gluon density in a proton (CCFM set A0) has been obtained in [32] from the\nCCFM equation where all input parameters have been fitted to describe the proton structure\nfunction F2 (x, Q2 ). Equally good fit was obtained using different values for the soft cut and\na different value for the width of the intrinsic kT distribution (CCFM set B0). A reasonable\ndescription of the F2 data can be achieved [32] by both A0 and B0 sets. These unintegrated\ngluon densities in a proton will be supplemented with the CCFM-evolved gluon density in a\nphoton proposed in [33]. Also we will use the unintegrated gluon densities in a proton and in\na photon taken in the Kimber-Martin-Ryskin form [30]. The KMR approach is a formalism\nto construct the unintegrated parton distributions from well-known conventional ones. For the\ninput, we have used the leading-order GRV parametrizations [34].\nThe multidimensional integrations in (3) and (4) have been performed by the means of\nMonte Carlo technique, using the routine vegas [35]. The full C++ code is available from the\nauthors on request2 .\nσres (γp → J/ψ X) =\n\n3\n\nZ\n\nNumerical results\n\nWe now are in a position to present our numerical results. First we describe our input and\nthe kinematic conditions. After we fixed the unintegrated gluon distributions, the cross sections\n(3) and (4) depend on the q\nrenormalization andq\nfactorization scales μR and μF . In the numerical\ncalculations we set μR = ξ m2ψ + p2ψ T , μF = ξ ŝ + Q2T , where QT is the transverse momentum\nof initial off-shell gluon or gluon pair (in the case of resolved photon production). In order to\n2\n\nlipatov@theory.sinp.msu.ru\n\n4\n\n\festimate the theoretical uncertainties of our calculations we vary the scale parameter ξ between\n1/2 and 2 about the default value ξ = 1. The sensitivity of the predictions to the charmed\nquark mass has been investigated previously in [20, 21]. Here we set mc = 1.5 GeV and use the\nLO formula for the coupling constant αs (μ2 ) with nf = 4 quark flavours at ΛQCD = 200 MeV,\nsuch that αs (MZ2 ) = 0.1232. Note that we apply another value ΛQCD = 220 MeV for the\nCCFM-evolved gluon densities (see discussion in Sect. 3.1). Finally, the J/ψ wave function at\nthe origin of coordinate space is taken to be equal to |Ψ(0)|2 = 0.0876 GeV3 [31].\n\n3.1\n\nInclusive production\n\nExperimental data for the inclusive J/ψ photoproduction at HERA come from both the\nZEUS and H1 collaborations. The dependence of the total cross section on the photon-proton\ncenter-of-mass energy W has been measured and the number of single and double differential\ncross sections has been determined: dσ/dz, dσ/dp2ψ T , dσ/dyψ and dσ/dp2ψ T dz. The ZEUS\ndata [29] refer to the kinematic region defined by 0.1 < z < 0.9, p2ψ T > 1 GeV2 and 50 < W <\n180 GeV. The H1 data [28] refer to the kinematic region 0.05 < z < 0.9, 1 < p2ψ T < 60 GeV2 and\n60 < W < 260 GeV. Very recent H1 measurements [27] have been performed at 0.3 < z < 0.9,\n1 < p2ψ T < 100 GeV2 and 60 < W < 240 GeV.\nOur numerical predictions are shown in Figs. 1 - 7 in comparison with the data [27–29].\nThe solid, dotted and dash-dotted histograms correspond to the results obtained using the\nCCFM A0, B0 and KMR gluon densities, respectively. The upper and lower dashed histograms\nrepresent the scale scale variations as it was described above. To estimate this uncertainty\nwe used the CCFM set A0+ and A0− instead of the default gluon density A0: the A0−\nstands for ξ = 1/2 while set A0+ reflects ξ = 2. One can see a good overall agreement\nof our central CCFM predictions with the recent H1 data [27]. We would like to point out\nthat the shape of z distributions is well reproduced by the CS mechanism. It is in a contrast\nwith the predictions [12] where the octet contributions have been taken into account. The\ntransverse momentum distributions and the dependence of J/ψ total cross section on the energy\nW are well described also. It seems that the agreement of our CCFM predictions with the\nprevious H1 data [28] is slightly less satisfactory but still reasonable (see Figs. 4 - 6). Main\ndifference between data and theory occurs in the high pψ T region. We note, however, that\nthe measurements [27, 28] have been performed in essentially the same kinematical region and\ntherefore probably there exists a problem of incompatibility of these data with each other. The\nshape of yψ distribution measured by ZEUS is not fully reproduced, but the data points lie still\nwithin the band of theoretical uncertainties. In general, the overall agreement of our CCFM\npredictions with ZEUS data [29] is reasonable well (see Fig. 7). The KMR gluon density is also\nresponsible for description of the H1 and ZEUS data although the shape of W -dependence of\nJ/ψ total cross section is not reproduced well.\nThe predictions of the Monte Carlo event generator Cascade [36] have been obtained in\nthe kinematical range of recent H1 measurements [27]. Cascade is a full hadron level event\ngenerator which uses the CCFM equation for the initial state gluon evolution. Despite the fact\nthat the default sets of numerical parameters are the same, the Cascade predictions (based\non the A0 gluon density) lie somewhat above than ours. The possible reason can be connected\nwith the corrections for contributions from the non-resonant background events which have\nbeen included into the Cascade calculations (see more details in [27]). These corrections are\n5\n\n\fnot taken into account in our consideration. In addition, there are some effects from the finalstate parton showers in Cascade which are also absent in our approach. However, we obtain\nthe same results as coming from Cascade if we apply the small shift in QCD parameter to\nΛQCD = 220 MeV. This is the reason why such shifted value of ΛQCD has been used in our\nCCFM calculations. In this way we effectively simulate the missing final-state parton showers\neffects and effects coming from non-resonant background events. It leads to increase of the\npredicted cross sections by the 15% approximately, that is, of course, much less than the scale\nuncertainties of our calculations. Note that the choice ΛQCD = 200 MeV in the KMR predictions\nis defined by the set of relevant parameters in GRV parametrizations.\n\n3.2\n\nPolarization properties\n\nNow we turn now to the investigation of the J/ψ polarization in photoproduction events\nat HERA. As it was mentioned above, the polarization observables are useful in discriminating\nthe CS and CO production mechanisms, as well as collinear and kT -factorization approaches.\nIn general, the spin density matrix of a vector particle depends on three parameters λ, μ and ν\nwhich can be measured experimentally from the double differential angular distribution of the\ndecay products. The latter reads for the J/ψ leptonic decay [37]\ndσ\ndφ∗ d cos θ∗\n\n∼ 1 + λ cos2 θ∗ + μ sin 2θ∗ cos φ∗ +\n\nν\nsin2 θ∗ cos 2φ∗ ,\n2\n\n(5)\n\nwhere θ∗ and φ∗ are the polar and azimuthal angles of the decay lepton measured in the\nJ/ψ rest frame. In the H1 experiments [27, 28] the polarization parameters λ and ν have\nbeen measured as a functions of pψ T and z in two complementary frames: the helicity frame\nand Collins-Soper frame. In addition, the ZEUS collaboration performs the measurements in\nthe target frame [26, 29]. In the helicity frame the polarization axis in the J/ψ meson rest\nframe is defined by the flight direction of the J/ψ meson in the γp rest frame, whereas the\npolarization in the Collins-Soper frame is measured with respect to the bisector of proton\n(−~pp ) and photon (~pγ ) in the J/ψ meson rest frame. In the target frame the polarization axis\nis chosen to be opposite of the incoming proton direction in the J/ψ rest frame. Note that\ncases λ = 1 and λ = −1 correspond to transverse and longitudinal polarization of the J/ψ\nmeson, respectively. Unfortunately, the experimental statistics was insufficient to encourage\nthe extraction of parameter μ from the double differential cross section (5). Our theoretical\ncalculations were adjusted to the experimental binning and generally followed the experimental\nprocedure. We have collected the simulated events in the specified bins of pψ T and z, generated\nthe decay lepton angular distributions according to the production and decay matrix elements,\nand then applied a three-parametric fit based on (5).\nThe estimated values of λ and ν are shown in Figs. 8 - 15 in comparison with the H1 [27,28]\nand ZEUS experimental data [26, 29]. The solid and dash-dotted histograms represent the\nresults obtained in the kT -factorization approach with the CCFM A0 and KMR gluon densities.\nThe dotted histograms correspond to the LO CS model predictions. First of all, one can\nclearly see the difference between the collinear and kT -factorization approaches in behavior of\nparameter λ as a function of pψ T . In contrast with the LO CS model, the kT -factorization\npredicts the longitudinal polarization of produced J/ψ mesons at high transverse momenta.\nNote that if the NLO corrections to the LO CS cross section will be taken into account, the\n6\n\n\fJ/ψ polarization is also tends to be longitudinal [8]. It is not the case of CO predictions where\nNLO corrections keep the essential transverse polarization. The parameter λ as a function of\nz seems to be insufficient to discriminate between the two production mechanisms. Contrary,\nbehaviour of parameter ν as a function of z demonstrates the analyzing power and can be useful\nto distiguish both the approaches.\nConcerning the comparison of our predictions and the data, one can see that none of the\npredictions can describe all aspects of the data even though huge experimental uncertainties.\nHowever, the kt-factorization approach tends to be in a better agreement with the data, especially with respect to the pψ T dependence of λ and z dependence of ν. We point out that our\npredictions for the polarization parameters λ and ν are not sensitive to the unintegrated gluon\ndensity used. So one of the sources of theoretical uncertainties is cancels out. Therefore measurements of the polarization parameters can to play crucial role in discriminating the different\ntheoretical approaches.\n\n4\n\nConclusions\n\nWe have studied inclusive J/ψ meson photoproduction at HERA within the framework of\nthe kT -factorization approach. Our consideration is based on the usual CS model supplemented\nwith the relevant off-shell matrix elements and the CCFM-evolved unintegrated gluon densities\nin a proton and in a photon. Both the direct and resolved photon contributions are taken\ninto account. The analysis covers the total, single and double differential cross sections of J/ψ\nmesons. Special attention was put on the polarization parameters λ and ν which determine the\nJ/ψ spin density matrix.\nWe obtained a reasonable well agreement of our calculations and the recent experimental\ndata taken by the H1 and ZEUS collaborations. We demonstrated that the kT -factorization\napproach gives a better agreement with the polarization data than the leading-order collinear\ncalculations. Both polarization parameters λ and ν can be used to discriminate the J/ψ production mechanism and study the parton interaction dynamics.\n\n5\n\nAcknowledgements\n\nThe authors are very grateful to DESY Directorate for the support in the framework of\nMoscow - DESY project on Monte-Carlo implementation for HERA - LHC. A.V.L. was\nsupported in part by the Helmholtz - Russia Joint Research Group. Also this research was\nsupported by the FASI of Russian Federation (grant NS-4142.2010.2) and FASI state contract\n02.740.11.0244.\n\nReferences\n[1] M. Krämer, Prog. Part. Nucl. Phys. 47, 141 (2001).\n[2] J.P. Lansberg, Int. J. Mod. Phys. A 21, 3857 (2006).\n[3] N. Brambilla et al., CERN-2005-005; arXiv: hep-ph/0412158.\n7\n\n\f[4] C.-H. Chang, Nucl. Phys. B 172, 425 (1980);\nE.L. Berger and D.L. Jones, Phys. Rev. D 23, 1521 (1981);\nR. Baier and R. Rückl, Phys. Lett. B 102, 364 (1981);\nS.S. Gershtein, A.K. Likhoded, and S.R. Slabospitsky, Sov. J. Nucl. Phys. 34, 128 (1981).\n[5] E. Braaten and S. Fleming, Phys. Rev. Lett. 74, 3327 (1995).\n[6] G. Bodwin, E. Braaten, and G. Lepage, Phys. Rev. D 51, 1125 (1995); Phys. Rev. D 55,\n5853 (1997).\n[7] P. Cho and A.K. Leibovich, Phys. Rev. D 53, 150 (1996); Phys. Rev. D 53, 6203 (1996).\n[8] P. Artoisenet, J. Campbell, J.P. Lansberg, F. Maltoni, and F. Tramontano, Phys. Rev.\nLett. 101, 152001 (2008).\n[9] B. Gong and J.-X. Wang, Phys. Rev. Lett. 100, 232001 (2008); Phys. Rev. D 78, 074011\n(2008).\n[10] J.M. Campbell, F. Maltoni, and F. Tramontano, Phys. Rev. Lett. 98, 252002 (2007).\n[11] P. Artoisenet, J. Campbell, F. Maltoni, and F. Tramontano, Phys. Rev. Lett. 102, 142001\n(2009).\n[12] M. Butenschön and B.A. Kniehl, DESY 10-101; arXiv:1009.5662 [hep-ph].\n[13] Y.-Q. Ma, K. Wang, and K. T Chao, arXiv:1009.3655 [hep-ph].\n[14] D. Acosta et al. (CDF Collaboration), Phys. Rev. Lett. 88, 161802 (2002).\n[15] V.M. Abazov et al. (D0 Collaboration), Phys. Rev. Lett. 101, 182004 (2008).\n[16] L.V. Gribov, E.M. Levin, and M.G. Ryskin, Phys. Rep. 100, 1 (1983);\nE.M. Levin, M.G. Ryskin, Yu.M. Shabelsky and A.G. Shuvaev, Sov. J. Nucl. Phys. 53,\n657 (1991);\nS. Catani, M. Ciafoloni and F. Hautmann, Nucl. Phys. B 366, 135 (1991);\nJ.C. Collins and R.K. Ellis, Nucl. Phys. B 360, 3 (1991).\n[17] E.A. Kuraev, L.N. Lipatov and V.S. Fadin, Sov. Phys. JETP 44, 443 (1976);\nE.A. Kuraev, L.N. Lipatov and V.S. Fadin, Sov. Phys. JETP 45, 199 (1977);\nI.I. Balitsky and L.N. Lipatov, Sov. J. Nucl. Phys. 28, 822 (1978).\n[18] M. Ciafaloni, Nucl. Phys. B 296, 49 (1988);\nS. Catani, F. Fiorani and G. Marchesini, Phys. Lett. B 234, 339 (1990);\nS. Catani, F. Fiorani and G. Marchesini, Nucl. Phys. B 336, 18 (1990);\nG. Marchesini, Nucl. Phys. B 445, 49 (1995).\n[19] B. Andersson et al. (Small-x Collaboration), Eur. Phys. J. C 25, 77 (2002);\nJ. Andersen et al. (Small-x Collaboration), Eur. Phys. J. C 35, 67 (2004);\nJ. Andersen et al. (Small-x Collaboration), Eur. Phys. J. C 48, 53 (2006).\n\n8\n\n\f[20] A.V. Lipatov, N.P. Zotov, Eur. Phys. J. C 27, 87 (2003).\n[21] S.P. Baranov, N.P. Zotov, J. Phys. G 29, 1395 (2003).\n[22] S.P. Baranov, Yad. Fiz. 73, 1 (2010).\n[23] S.P. Baranov, A. Szczurek, Phys. Rev. D 77, 054016 (2008).\n[24] S.P. Baranov, Phys. Rev. D 66, 114003 (2002).\n[25] S.P. Baranov, Phys. Lett. B 428, 377 (1998).\n[26] S. Chekanov et al. (ZEUS Collaboration), JHEP 0912, 007 (2009).\n[27] F.D. Aaron et al. (H1 Collaboration), DESY 09-225.\n[28] C. Adloff et al. (H1 Collaboration), Eur. Phys. J. C 25, 25 (2002).\n[29] S. Chekanov et al. (ZEUS Collaboration), Eur. Phys. J. C 27, 173 (2003).\n[30] M.A. Kimber, A.D. Martin and M.G. Ryskin, Phys. Rev. D 63, 114027 (2001);\nG. Watt, A.D. Martin and M.G. Ryskin, Eur. Phys. J. C 31, 73 (2003).\n[31] C. Amsler et al. (PDG Collaboration), Phys. Lett. B 667, 1 (2008).\n[32] H. Jung, arXiv:hep-ph/0411287.\n[33] M. Hansson, H. Jung, L. Jönsson, arXiv:hep-ph/0402019.\n[34] M. Glück, E. Reya, and A. Vogt, Phys. Rev. D 46, 1973 (1992);\nM. Glück, E. Reya, and A. Vogt, Z. Phys. C 67, 433 (1995).\n[35] G.P. Lepage, J. Comput. Phys. 27, 192 (1978).\n[36] H. Jung, Comp. Phys. Comm. 143, 100 (2002);\nH. Jung et al., DESY 10-107.\n[37] M. Beneke, M. Krämer, and M. Vänttinen, Phys. Rev. D 57, 4258 (1998).\n\n9\n\n\f120\n\nH1\n\n10\n\n1\n\n10\n\n0\n\nH1\n\n2\n\ndσ/dpψ T [nb/GeV ]\n\n100\n\n60\n\n10\n\n-1\n\n10\n\n-2\n\n10\n\n-3\n\n2\n\ndσ/dz [nb]\n\n80\n\n40\n\n20\n\n0\n\n0.4\n\n0.6\n\n20\n\n0.8\n\n40\n\n60\n\n2\n\n2\n\n80\n\npψ T [GeV ]\n\nz\n60\n\nH1\n\n50\n\nσ (W) [nb]\n\n40\n\n30\n\n20\n\n10\n\n0\n60\n\n100\n\n140\n\n180\n\n220\n\nW [GeV]\n\nFigure 1: The total and differential cross sections of J/ψ mesons calculated in the kinematical\nregion defined by 0.3 < z < 0.9, p2ψ T > 1 GeV2 and 60 < W < 240 GeV. The solid, dotted\nand dash-dotted histograms correspond to the results obtained using the CCFM A0, CCFM\nB0 and KMR gluon densities, respectively. The upper and lower dashed histograms represent\nthe scale scale variations as it is described in the text. The experimental data are from H1 [27].\n\n10\n\n\f100\n\n40\n\nH1\n1 < pψ Τ < 2 GeV\n\nH1\n2 < pψ Τ < 3 GeV\n\n80\n\n60\n\ndσ/dz [nb]\n\ndσ/dz [nb]\n\n30\n\n40\n\n20\n\n10\n20\n\n0\n\n0.4\n\n0.6\n\n0\n\n0.8\n\n0.4\n\nz\n15\n\n0.6\n\n0.8\n\nz\n3\n\nH1\n3 < pψ Τ < 4.5 GeV\n\ndσ/dz [nb]\n\n2\n\ndσ/dz [nb]\n\n10\n\nH1\npψ Τ > 4.5 GeV\n\n5\n\n0\n\n1\n\n0.4\n\n0.6\n\n0\n\n0.8\n\nz\n\n0.4\n\n0.6\n\n0.8\n\nz\n\nFigure 2: The differential cross sections of J/ψ mesons as a function of elasticity z calculated\nin different pψ T bins at 60 < W < 240 GeV. Notation of all histograms is the same as in Fig. 1.\nThe experimental data are from H1 [27].\n\n11\n\n\fH1\n0.3 < z < 0.45\n\n0\n\n10\n\n-2\n\n10\n\n-3\n\nH1\n0.45 < z < 0.6\n\n0\n\n2\n\n-1\n\n2\n\n10\n\n10\n\ndσ/dpψ T [nb/GeV ]\n\n2\n\n2\n\ndσ/dpψ T [nb/GeV ]\n\n10\n\n20\n\n40\n\n60\n\n2\n\n2\n\n10\n\n-1\n\n10\n\n-2\n\n10\n\n-3\n\n80\n\n20\n\npψ T [GeV ]\n\n40\n\n60\n\n2\n\n2\n\nH1\n\nH1\n0.75 < z < 0.9\n\n0.6 < z < 0.75\n0\n0\n\n2\n\ndσ/dpψ T [nb/GeV ]\n\n10\n\n2\n\ndσ/dpψ T [nb/GeV ]\n\n10\n\n80\n\npψ T [GeV ]\n\n10\n\n-2\n\n2\n\n-1\n\n2\n\n10\n\n10\n\n20\n2\n\n30\n\n40\n\n10\n\n-1\n\n10\n\n-2\n\n10\n\n2\n\n20\n2\n\npψ T [GeV ]\n\n30\n\n40\n\n2\n\npψ T [GeV ]\n\nFigure 3: The differential cross sections of J/ψ mesons as a function of p2ψ T calculated in\ndifferent z bins at 60 < W < 240 GeV. Notation of all histograms is the same as in Fig. 1. The\nexperimental data are from H1 [27].\n\n12\n\n\f120\n\n50\n\nH1\npψ Τ > 1 GeV\n\n100\n\nH1\npψ Τ > 2 GeV\n\n40\n\ndσ/dz [nb]\n\ndσ/dz [nb]\n\n80\n\n60\n\n30\n\n20\n\n40\n10\n\n20\n\n0\n\n0.4\n\n0.6\n\n0\n\n0.8\n\n0.4\n\n0.6\n\nz\n15\n\n2\n\ndσ/dpψ T [nb/GeV ]\n\nH1\npψ Τ > 3 GeV\n\n2\n\ndσ/dz [nb]\n\n10\n\n5\n\n0\n\n0.4\n\n0.6\n\n10\n\n1\n\n10\n\n0\n\n10\n\n-1\n\n10\n\n-2\n\n10\n\n-3\n\n0.8\n\nH1\n\n10\n\n30\n2\n\n50\n\nH1\n0.3 < z < 0.9\n\n60\n\n20\n\n40\n\n50\n\n60\n\n2\n\npψ T [GeV ]\n\nz\n70\n\n0.8\n\nz\n\nH1\n0.3 < z < 0.8\n\n40\n\nσ (W) [nb]\n\nσ (W) [nb]\n\n50\n40\n30\n\n30\n\n20\n\n20\n10\n10\n0\n60\n\n100\n\n140\n\n180\n\n0\n60\n\n220\n\nW [GeV]\n\n100\n\n140\n\n180\n\n220\n\nW [GeV]\n\nFigure 4: The total and differential cross sections of J/ψ mesons calculated in the kinematical\nregion defined by 0.3 < z < 0.9, p2ψ T > 1 GeV2 and 60 < W < 240 GeV. Notation of all\nhistograms is the same as in Fig. 1. The experimental data are from H1 [28].\n\n13\n\n\f140\n\nH1\n\nH1\n0.05 < z < 0.45\n\n120\n\n2\n\ndσ/dpψ T [nb/GeV ]\n\n80\n\n2\n\ndσ/dz [nb]\n\n100\n\n60\n\n10\n\n0\n\n10\n\n-1\n\n10\n\n-2\n\n40\n20\n0\n\n0.2\n\n0.4\n\n0.6\n\n10\n\n0.8\n\n20\n2\n\n30\n\n40\n\n2\n\npψ T [GeV ]\n\nz\n30\n\nH1\n0.05 < z < 0.45\n\nσ (W) [nb]\n\n20\n\n10\n\n0\n\n140\n\n180\n\n220\n\n260\n\nW [GeV]\n\nFigure 5: The total and differential cross sections of J/ψ mesons calculated in the kinematical\nregion defined by 0.05 < z < 0.9, p2ψ T > 1 GeV2 and 120 < W < 260 GeV. Notation of all\nhistograms is the same as in Fig. 1. The experimental data are from H1 [28].\n\n14\n\n\f0\n\n10\n\n-1\n\n10\n\n-2\n\n10\n\n-3\n\n10\n\n1\n\n10\n\n0\n\nH1\n0.6 < z < 0.75\n\n2\n\n10\n\nH1\n0.3 < z < 0.6\n\n2\n\n1\n\ndσ/dz dpψ T [nb/GeV ]\n\n2\n\n2\n\ndσ/dz dpψ T [nb/GeV ]\n\n10\n\n10\n\n20\n\n30\n2\n\n40\n\n50\n\n60\n\n10\n\n-1\n\n10\n\n-2\n\n10\n\n-3\n\n10\n\n2\n\n20\n\n30\n2\n\n40\n\n50\n\n60\n\n2\n\npψ T [GeV ]\n\n10\n\n1\n\n10\n\n0\n\nH1\n0.75 < z < 0.9\n\n2\n\n2\n\ndσ/dz dpψ T [nb/GeV ]\n\npψ T [GeV ]\n\n10\n\n-1\n\n10\n\n-2\n\n10\n\n-3\n\n10\n\n20\n\n30\n2\n\n40\n\n50\n\n60\n\n2\n\npψ T [GeV ]\n\nFigure 6: The double differential cross sections of J/ψ mesons in bins of z and p2ψ T calculated\nat 60 < W < 240 GeV. Notation of all histograms is the same as in Fig. 1. The experimental\ndata are from H1 [28].\n\n15\n\n\f120\n\n50\n\nZEUS\npψ Τ > 1 GeV\n\n100\n\nZEUS\npψ Τ > 2 GeV\n\n40\n\ndσ/dz [nb]\n\ndσ/dz [nb]\n\n80\n\n60\n\n30\n\n20\n\n40\n10\n\n20\n\n0\n\n0.2\n\n0.4\n\n0.6\n\n0\n\n0.8\n\n0.2\n\n0.4\n\n0.6\n\nz\n\n0.8\n\nz\n\n20\n\nZEUS\n0.4 < z < 0.9\n\nZEUS\n10\n\n1\n\n10\n\n0\n\n0.4 < z < 0.9\n\n10\n\n2\n\ndσ/dyψ [nb]\n\n2\n\ndσ/dpψ T [nb/GeV ]\n\n15\n\n5\n\n0\n\n-1\n\n0\n\n1\n\n10\n\n-1\n\n10\n\n-2\n\n0\n\n10\n\n20\n2\n\nyψ\n\n30\n\n2\n\npψ T [GeV ]\n50\n\nZEUS\n0.4 < z < 0.9\n\nσ (W) [nb]\n\n40\n\n30\n\n20\n\n10\n\n0\n\n60\n\n80\n\n100\n\n120\n\n140\n\n160\n\n180\n\nW [GeV]\n\nFigure 7: The total and differential cross sections of J/ψ mesons calculated in the kinematical\nregion defined by 0.1 < z < 0.9, p2ψ T > 1 GeV2 and 50 < W < 180 GeV. Notation of all\nhistograms is the same as in Fig. 1. The experimental data are from ZEUS [29].\n\n16\n\n\f1.0\n\nH1\nhelicity frame\n\nH1\nhelicity frame\n1.0\n\n0.5\n\nλ (z)\n\nλ (pψ T )\n\n0.5\n\n0.0\n\n0.0\n\n-0.5\n-0.5\n- 1.0\n- 1.0\n\n2\n\n4\n\n6\n\n8\n\n10\n\n0.4\n\npψ T [GeV]\n1.0\n\n1.0\n\nH1\nhelicity frame\n\nH1\nhelicity frame\n\n0.5\n\nν (z)\n\nν (pψ T )\n\n0.8\n\nz\n\n0.5\n\n0.0\n\n-0.5\n\n- 1.0\n\n0.6\n\n0.0\n\n-0.5\n\n2\n\n4\n\n6\n\n8\n\n10\n\n- 1.0\n\npψ T [GeV]\n\n0.4\n\n0.6\n\n0.8\n\nz\n\nFigure 8: Polarization parameters λ and ν as a functions of the J/ψ transverse momentum and\nelasticity z calculated in the helicity frame at 0.3 < z < 0.9, p2ψ T > 1 GeV2 and 60 < W <\n240 GeV. The solid and dash-dotted histograms correspond to the results obtained using the\nCCFM A0 and KMR gluon densities. The dotted histograms represent the LO CS predictions.\nThe experimental data are from H1 [27].\n\n17\n\n\f1.0\n\nH1\nCollins-Soper frame\n\nH1\nCollins-Soper frame\n1.0\n\n0.5\n\nλ (z)\n\nλ (pψ T )\n\n0.5\n0.0\n\n0.0\n-0.5\n-0.5\n\n- 1.0\n\n2\n\n4\n\n6\n\n8\n\n10\n\n- 1.0\n\npψ T [GeV]\n1.0\n\n1.0\n\nH1\nCollins-Soper frame\n\n0.8\n\nH1\nCollins-Soper frame\n\n0.5\n\nν (z)\n\nν (pψ T )\n\n0.6\nz\n\n0.5\n\n0.0\n\n-0.5\n\n- 1.0\n\n0.4\n\n0.0\n\n-0.5\n\n2\n\n4\n\n6\n\n8\n\n10\n\n- 1.0\n\npψ T [GeV]\n\n0.4\n\n0.6\n\n0.8\n\nz\n\nFigure 9: Polarization parameters λ and ν as a functions of the J/ψ transverse momentum\nand elasticity z calculated in the Collins-Soper frame at 0.3 < z < 0.9, p2ψ T > 1 GeV2 and\n60 < W < 240 GeV. Notation of all histograms is the same as in Fig. 8. The experimental\ndata are from H1 [27].\n1.0\n\n1.0\n\nZEUS\ntarget frame\n\n0.5\n\nν (pψ T )\n\nλ (pψ T )\n\n0.5\n\n0.0\n\n-0.5\n\n- 1.0\n\nZEUS\ntarget frame\n\n0.0\n\n-0.5\n\n2\n\n4\n\n6\n\n8\n\n- 1.0\n\n10\n\npψ T [GeV]\n\n2\n\n4\n\n6\n\n8\n\n10\n\npψ T [GeV]\n\nFigure 10: Polarization parameters λ and ν as a functions of the J/ψ transverse momentum\ncalculated in the target frame at 0.4 < z < 1.0 and 50 < W < 180 GeV. Notation of all\nhistograms is the same as in Fig. 8. The experimental data are from ZEUS [26].\n\n18\n\n\fZEUS\ntarget frame\n\nZEUS\ntarget frame\n1.0\n\n0.5\n\n0.5\nν (z)\n\nλ (z)\n\n1.0\n\n0.0\n\n0.0\n\n-0.5\n\n-0.5\n\n- 1.0\n\n0.2\n\n0.4\n\n0.6\n\n0.8\n\n- 1.0\n\n1.0\n\n0.2\n\n0.4\n\nz\n\n0.6\n\n0.8\n\n1.0\n\nz\n\nFigure 11: Polarization parameters λ and ν as a functions of the elasticity z calculated in\nthe target frame at 0.1 < z < 1.0, pψ T > 1 GeV and 50 < W < 180 GeV. Notation of all\nhistograms is the same as in Fig. 8. The experimental data are from ZEUS [26].\n\n1.0\n\nZEUS\npψ T > 2 GeV\n\nZEUS\npψ T > 2 GeV\n\n1.0\n0.5\n\nν (z)\n\nλ (z)\n\n0.5\n0.0\n\n0.0\n\n-0.5\n\n-0.5\n\n- 1.0\n\n0.2\n\n0.4\n\n0.6\n\n- 1.0\n\n0.8\n\n0.2\n\n0.4\n\nz\n\n0.6\n\n0.8\n\nz\n1.0\n\nZEUS\npψ T > 3 GeV\n\nZEUS\npψ T > 3 GeV\n\n1.0\n0.5\n\nν (z)\n\nλ (z)\n\n0.5\n0.0\n\n0.0\n\n-0.5\n\n-0.5\n\n- 1.0\n\n0.2\n\n0.4\n\n0.6\n\n- 1.0\n\n0.8\n\nz\n\n0.2\n\n0.4\n\n0.6\n\n0.8\n\nz\n\nFigure 12: Polarization parameters λ and ν as a functions of the elasticity z calculated in the\ntarget frame at 0.1 < z < 0.9 and 50 < W < 180 GeV. Notation of all histograms is the same\nas in Fig. 8. The experimental data are from ZEUS [26].\n\n19\n\n\f2\n\n3\n\nZEUS\ntarget frame\n\nZEUS\nhelicity frame\n\n2\n\nλ (pψ T )\n\nλ (pψ T )\n\n1.0\n1.0\n\n0\n\n0\n\n-1\n-1\n\n1\n\n2\n\n3\n\n4\n\n5\n\n1\n\n2\n\npψ T [GeV]\n\n3\n\n4\n\n5\n\npψ T [GeV]\n\nFigure 13: Polarization parameter λ as a function of the J/ψ transverse momentum calculated\nat 0.4 < z < 1.0 and 50 < W < 180 GeV. Notation of all histograms is the same as in Fig. 8.\nThe experimental data are from ZEUS [29].\n\n2\n\n3\n\nZEUS\ntarget frame\n\nZEUS\nhelicity frame\n\n2\n\nλ (pψ T )\n\nλ (pψ T )\n\n1.0\n\n0\n\n1.0\n\n0\n\n-1\n-1\n\n-2\n\n1\n\n2\n\n3\n\n4\n\n-2\n\n5\n\npψ T [GeV]\n\n1\n\n2\n\n3\n\n4\n\n5\n\npψ T [GeV]\n\nFigure 14: Polarization parameter λ as a function of the J/ψ transverse momentum calculated\nat 0.4 < z < 0.9 and 50 < W < 180 GeV. Notation of all histograms is the same as in Fig. 8.\nThe experimental data are from ZEUS [29].\n\n20\n\n\f2\n\n2\n\nH1\ntarget frame\n\n1.0\nλ (z)\n\nλ (pψ T )\n\n1.0\n\n0\n\n-1\n\n0\n\n1\n\n2\n\n3\n\n4\n\n5\n\n-1\n\npψ T [GeV]\n2\n\n0.6\n\n2\n\nH1\ntarget frame\n\n0.8\n\nH1\ntarget frame\n\nν (z)\n\n1.0\n\n0\n\n-1\n\n-2\n\n0.4\n\nz\n\n1.0\n\nν (pψ T )\n\nH1\ntarget frame\n\n0\n\n-1\n\n1\n\n2\n\n3\n\n4\n\n5\n\n-2\n\npψ T [GeV]\n\n0.4\n\n0.6\n\n0.8\n\nz\n\nFigure 15: Polarization parameters λ and ν as a functions of the J/ψ transverse momentum\nand elasticity z calculated in the target frame at 0.3 < z < 0.9, p2ψ T > 1 GeV2 and 60 < W <\n240 GeV. Notation of all histograms is the same as in Fig. 8. The experimental data are from\nH1 [28].\n\n21\n\n\f"}