{"id": "http://arxiv.org/abs/1011.2222v2", "guidislink": true, "updated": "2010-12-06T14:02:22Z", "updated_parsed": [2010, 12, 6, 14, 2, 22, 0, 340, 0], "published": "2010-11-09T21:23:02Z", "published_parsed": [2010, 11, 9, 21, 23, 2, 1, 313, 0], "title": "Static and dynamic characteristics of protein contact networks", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1011.2701%2C1011.5872%2C1011.4065%2C1011.6634%2C1011.2747%2C1011.4027%2C1011.2217%2C1011.0843%2C1011.5466%2C1011.5213%2C1011.3853%2C1011.1269%2C1011.0677%2C1011.4417%2C1011.3280%2C1011.5442%2C1011.0282%2C1011.4024%2C1011.4894%2C1011.5740%2C1011.4134%2C1011.4868%2C1011.3502%2C1011.0107%2C1011.5847%2C1011.3557%2C1011.0070%2C1011.0645%2C1011.3998%2C1011.3237%2C1011.4538%2C1011.0755%2C1011.4040%2C1011.2776%2C1011.2576%2C1011.3031%2C1011.1263%2C1011.5636%2C1011.1407%2C1011.3634%2C1011.2376%2C1011.5819%2C1011.4144%2C1011.6156%2C1011.2358%2C1011.6161%2C1011.2969%2C1011.5657%2C1011.2222%2C1011.6114%2C1011.3798%2C1011.0828%2C1011.2398%2C1011.0717%2C1011.2107%2C1011.6425%2C1011.4339%2C1011.6395%2C1011.5080%2C1011.3741%2C1011.5088%2C1011.1004%2C1011.0303%2C1011.3035%2C1011.6391%2C1011.3675%2C1011.1971%2C1011.0567%2C1011.0775%2C1011.6512%2C1011.0780%2C1011.1692%2C1011.1152%2C1011.2059%2C1011.6117%2C1011.0507%2C1011.2547%2C1011.2305%2C1011.0682%2C1011.2311%2C1011.4922%2C1011.4395%2C1011.3314%2C1011.3952%2C1011.5490%2C1011.6039%2C1011.2866%2C1011.0813%2C1011.0396%2C1011.3025%2C1011.5982%2C1011.0190%2C1011.5909%2C1011.0207%2C1011.4239%2C1011.5929%2C1011.1815%2C1011.4595%2C1011.4214%2C1011.2881%2C1011.2375&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Static and dynamic characteristics of protein contact networks"}, "summary": "The principles underlying protein folding remains one of Nature's puzzles\nwith important practical consequences for Life. An approach that has gathered\nmomentum since the late 1990's, looks at protein hetero-polymers and their\nfolding process through the lens of complex network analysis. Consequently,\nthere is now a body of empirical studies describing topological characteristics\nof protein macro-molecules through their contact networks and linking these\ntopological characteristics to protein folding. The present paper is primarily\na review of this rich area. But it delves deeper into certain aspects by\nemphasizing short-range and long-range links, and suggests unconventional\nplaces where \"power-laws\" may be lurking within protein contact networks.\nFurther, it considers the dynamical view of protein contact networks. This\ncloser scrutiny of protein contact networks raises new questions for further\nresearch, and identifies new regularities which may be useful to parameterize a\nnetwork approach to protein folding. Preliminary experiments with such a model\nconfirm that the regularities we identified cannot be easily reproduced through\nrandom effects. Indeed, the grand challenge of protein folding is to elucidate\nthe process(es) which not only generates the specific and diverse linkage\npatterns of protein contact networks, but also reproduces the dynamic behavior\nof proteins as they fold. Keywords: network analysis, protein contact networks,\nprotein folding", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1011.2701%2C1011.5872%2C1011.4065%2C1011.6634%2C1011.2747%2C1011.4027%2C1011.2217%2C1011.0843%2C1011.5466%2C1011.5213%2C1011.3853%2C1011.1269%2C1011.0677%2C1011.4417%2C1011.3280%2C1011.5442%2C1011.0282%2C1011.4024%2C1011.4894%2C1011.5740%2C1011.4134%2C1011.4868%2C1011.3502%2C1011.0107%2C1011.5847%2C1011.3557%2C1011.0070%2C1011.0645%2C1011.3998%2C1011.3237%2C1011.4538%2C1011.0755%2C1011.4040%2C1011.2776%2C1011.2576%2C1011.3031%2C1011.1263%2C1011.5636%2C1011.1407%2C1011.3634%2C1011.2376%2C1011.5819%2C1011.4144%2C1011.6156%2C1011.2358%2C1011.6161%2C1011.2969%2C1011.5657%2C1011.2222%2C1011.6114%2C1011.3798%2C1011.0828%2C1011.2398%2C1011.0717%2C1011.2107%2C1011.6425%2C1011.4339%2C1011.6395%2C1011.5080%2C1011.3741%2C1011.5088%2C1011.1004%2C1011.0303%2C1011.3035%2C1011.6391%2C1011.3675%2C1011.1971%2C1011.0567%2C1011.0775%2C1011.6512%2C1011.0780%2C1011.1692%2C1011.1152%2C1011.2059%2C1011.6117%2C1011.0507%2C1011.2547%2C1011.2305%2C1011.0682%2C1011.2311%2C1011.4922%2C1011.4395%2C1011.3314%2C1011.3952%2C1011.5490%2C1011.6039%2C1011.2866%2C1011.0813%2C1011.0396%2C1011.3025%2C1011.5982%2C1011.0190%2C1011.5909%2C1011.0207%2C1011.4239%2C1011.5929%2C1011.1815%2C1011.4595%2C1011.4214%2C1011.2881%2C1011.2375&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The principles underlying protein folding remains one of Nature's puzzles\nwith important practical consequences for Life. An approach that has gathered\nmomentum since the late 1990's, looks at protein hetero-polymers and their\nfolding process through the lens of complex network analysis. Consequently,\nthere is now a body of empirical studies describing topological characteristics\nof protein macro-molecules through their contact networks and linking these\ntopological characteristics to protein folding. The present paper is primarily\na review of this rich area. But it delves deeper into certain aspects by\nemphasizing short-range and long-range links, and suggests unconventional\nplaces where \"power-laws\" may be lurking within protein contact networks.\nFurther, it considers the dynamical view of protein contact networks. This\ncloser scrutiny of protein contact networks raises new questions for further\nresearch, and identifies new regularities which may be useful to parameterize a\nnetwork approach to protein folding. Preliminary experiments with such a model\nconfirm that the regularities we identified cannot be easily reproduced through\nrandom effects. Indeed, the grand challenge of protein folding is to elucidate\nthe process(es) which not only generates the specific and diverse linkage\npatterns of protein contact networks, but also reproduces the dynamic behavior\nof proteins as they fold. Keywords: network analysis, protein contact networks,\nprotein folding"}, "authors": ["Susan Khor"], "author_detail": {"name": "Susan Khor"}, "author": "Susan Khor", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1007/s12064-011-0135-y", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1011.2222v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1011.2222v2", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "Added Appendix B", "arxiv_primary_category": {"term": "cs.CE", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cs.CE", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "cs.SI", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "physics.bio-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "q-bio.BM", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1011.2222v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1011.2222v2", "journal_reference": null, "doi": "10.1007/s12064-011-0135-y", "fulltext": "S. Khor\n\n12/5/2010\n\nStatic and dynamic characteristics of protein contact networks\nSusan Khor1\nAbstract The principles underlying protein folding remains one of Nature's puzzles with important practical\nconsequences for Life. An approach that has gathered momentum since the late 1990's, looks at protein heteropolymers and their folding process through the lens of complex network analysis. Consequently, there is now a\nbody of empirical studies describing topological characteristics of protein macro-molecules through their contact\nnetworks and linking these topological characteristics to protein folding. The present paper is primarily a review of\nthis rich area. But it delves deeper into certain aspects by emphasizing short-range and long-range links, and\nsuggests unconventional places where \"power-laws\" may be lurking within protein contact networks. Further, it\nconsiders the dynamical view of protein contact networks. This closer scrutiny of protein contact networks raises\nnew questions for further research, and identifies new regularities which may be useful to parameterize a network\napproach to protein folding. Preliminary experiments with such a model confirm that the regularities we identified\ncannot be easily reproduced through random effects. Indeed, the grand challenge of protein folding is to elucidate\nthe process(es) which not only generates the specific and diverse linkage patterns of protein contact networks, but\nalso reproduces the dynamic behavior of proteins as they fold.\nKeywords: network analysis, protein contact networks, protein folding\n\n1. Introduction\nBreaking the code underlying protein folding has remained an intellectually tantalizing puzzle as\nwell as a problem of great practical significance. Everything a protein requires for correct folding under\nnormal circumstances appears to be embedded in its amino-acid sequence (Afinsen 1973), although a\nminority rely on the aid of chaperone molecules to fulfill their destiny. Due to the large sizes that\namino-acid sequences can take, a random search approach to protein folding is deemed infeasible for\npractical biological purposes (Levinthal 1969). However, an argument based on separability of the\nprotein folding problem, i.e. that the problem can be separated into parts which can be solved\nindependently and assembled into an optimal solution2, has been conceived as a way out of Levinthal's\nparadox (Zwanzig et al 1992; Karplus 1997). This argument is supported by the observation that some\nsections of protein sequences have a propensity to fold to their secondary structures. In medicine,\nprotein misfolding has been identified as a causative factor in diseases such as cystic fibrosis, ALS and\nAlzheimer's (Chen et al 2008). Proteins play many roles in biological cells, e.g. as structural material,\n\n1\n\nContact info.: slc.khor@gmail.com\nFor a more whimsical description, see Herbert A. Simon's parable of the two watchmakers in The Architecture\nof Complexity in The Sciences of the Artificial, 1969 MIT Press.\n2\n\n1\n\n\fS. Khor\n\n12/5/2010\n\ncatalysts, adaptors, hormones, transporters and regulators (Tramontano 2006). Proteins attain their\nfunctionality through their unique (though not necessarily static) native three dimensional states and are\nthe ultimate expression of genes. Thus, the ability to predict the three dimensional structure of a protein\nsequence is useful to comprehend genomic data. Current approaches to the protein structure prediction\nproblem such as comparative modeling, fold-recognition methods (profile-based and sequence\nthreading) and fragment-based methods rely heavily on existing knowledge of protein sequences and\ntheir folds (Tramontano 2006). Notwithstanding the success of these methods, understanding the protein\nfolding process from first principles is a more complete and satisfying solution, and may prove\ninvaluable for protein design and therapies targeting protein misfolding.\nIn general, protein folding is a process that occurs in stages. What essentially begins as a linear\nhetero-polymer (organized as a backbone with protruding side chain groups) obtains local structure in\nthe form of secondary alpha helices and beta sheets and finally global structure as the secondary\nstructures arrange themselves compactly in three dimensions. For a long time, this spontaneous\nbiological self-organization has been attributed to various inter-atomic physical forces and chemical\nconstraints impacting a protein molecule. However, in the last decade or so, another theory based on the\nnetwork topology of a protein's native state has blossomed. Alm and Baker (1999) even suggest that\n\"protein folding mechanisms and landscapes are largely determined by the topology of the native state\nand are relatively insensitive to details of the interatomic interactions.\" In this other theory, a network\nview of protein molecules (mostly in their native states) is adopted. The general recipe to transform a\nprotein molecule into a network is to represent amino acid residues (Cα or Cβ) as nodes, and contact\n(spatial, non-covalent) distances between pairs of amino acid residues below a certain threshold as links.\nSuch protein contact networks or maps (Vendruscolo et al 2002) are constructed from the Cartesian\ncoordinates of amino acid residues of protein molecules stored in the Protein Data Bank (PDB) (Berman\net al 2000).\nBy examining protein contact networks (PCN), researchers have compiled a list of topological\ncharacteristics shared by a diverse (in terms of structural class, homology and taxon) set of proteins and\nspeculated on the reasons for the observed topological characteristics in relation to the protein folding\nmechanism. For example, a common feature of protein contact networks is their small-world nature, i.e.\nthey have lattice like clustering coefficients but random graph like diameters and characteristic path\nlengths (Watts and Strogatz 1998). The need for rapid communication between amino acid residues to\nfacilitate interaction cooperativity crucial for protein folding is frequently cited as the reason for the\nsmall-world feature of PCNs (Vendruscolo et al 2002; Dokholyan et al 2002; Atilgan et al 2004; Del\nSol et al 2006). Protein contact networks are also reported to exhibit high assortativity values which can\nbe related to protein folding speeds (Bagler and Sinha 2007).\n\n2\n\n\fS. Khor\n\n12/5/2010\n\nIn this paper, we collected the PCN structural characteristics that have been reported in literature\non various sets of proteins and using different methods of PCN construction, and applied them on a\nsingle set of proteins – the GH64 dataset – with a single PCN construction method. We find that in\ngeneral, the reported network characteristics hold for GH64. We also carry a line of inquiry found in the\nliterature (Green and Higman 2003) of probing the effects of short-range links and of long-range links\non network characteristics of PCNs throughout the paper. Our investigations led us to new research\nquestions, and to new quantitative and qualitative observations about PCNs which could be helpful to\nfinally realize a network approach to protein folding. These new observations include: about 30% of all\nlinks are long-range, a power-law like distribution of link sequence distance, and for proteins which are\nnot too large, the maximum link sequence distance is about 70% of a protein's size. However our model\nof a network approach to protein folding is far from complete as the problem of choosing endpoints for\nlong-range links remains elusive (about 60% of a protein's amino acids are involved in at least one\nlong-range interaction).\n\n2. Protein Contact Map (PCN)\nA protein contact network or PCN (Vendruscolo et al 2002) is an adjacency matrix representing a\nnetwork whose nodes are the Cα atom of amino acid residues of a protein, and where a link is placed\nbetween a pair of nodes when the node pair is situated less than some distance threshold (TH) apart\nfrom each other. Distance between node pairs is the Euclidean distance between their 3D Cartesian\ncoordinates obtained from the Protein Data Bank or PDB (Berman et al 2000). For this paper, TH is 7Å.\nStructural characteristics of PCNs do not seem overly sensitive to the choice of the threshold value\n(Bartoli et al 2007). We build a PCN for each protein in the GH64 dataset. Examples of four such PCNs\ncan be found in Figure 1. The proteins were randomly chosen for their differences in size: 1aep, 1agd,\n1psd and 1CVJ have 153, 385, 813 and 1261 nodes in their PCNs respectively.\nSo far, we have referred to PCNs as uniform entities. In actuality, there are variations in the way\nPCNs are constructed. For example, a single PCN may represent several non-homologous proteins\nrather than a single protein. PCNs may also represent different aspects (e.g. surface or core), states (e.g.\nnative or transitional), structural classes (e.g. α, β, α+β or α/β), or types (e.g. globular or fibrous) of\nproteins. Further, the nodes and links of PCNs may carry different meanings, e.g. atoms of the side\nchain group of an amino acid may be included so that a node may represent more than one atom and\nmultiple links between nodes or weighted links are allowed. Examples of these alternative PCN\nconstructions can be found in the references for this paper. Incidentally, an earlier use of a matrix to\ndepict\n\nprotein\n\nfolding\n\ncan\n\nbe\n\nfound\n\n3\n\nin\n\n(Tanaka\n\nand\n\nScheraga\n\n1977).\n\n\fS. Khor\n\n12/5/2010\n\nFigure 1 Left: Protein Contact Networks (7Å) for four proteins in the GH64 dataset. A shaded cell\n(x, y) denotes a link between nodes x and y. Right: Networks produced from two of the PCNs:\n1aep (top) and 1psd (bottom). SE links are pink, LE links are turquoise, yellow highlights nodes\nwith more than 8 direct neighbours. Sections 4 and 5 of the text provide further explanation.\n\n3. The GH64 Protein Dataset\nThe 64 proteins in the GH64 dataset (Table 1) were selected from literature surveyed, specifically\n(Green and Higman 2003). The dataset encompass proteins from different protein classes, fold types and\nbranches of life. Their sizes range from 69 to 1734 residues (Figure 2). Proteins which did not form a\nsingle component (1cuk and 1ho4), or had unusually high link density (1feo) in the PCNs we\nconstructed were excluded from the dataset. So too were proteins with more nodes in their PCNs than\ntheir DSSP output (Kabsch and Sander 1983) (2hmz and 1epf). For the reverse situation, we truncated\nthe DSSP output. Another protein dataset, EVA132, is described in Appendix A and it is used as a\ncheck to increase confidence in the main observations made in this paper.\nTable 1 Proteins in the GH64 Dataset\n1mjc 1gvp 1ten 1ris 2acy 1tlk 1ayc 1sha 1CD8 1d4t 1e86 2fgf 1eif 1pdo 1h7i 1amx 1bj7 1aep 1gm6\n3rab 1wba 1rbp 1eyl 153L 1fap 1nsj 1hro 1jr8 256b 1ICE 1arb 1vlt 1urn 1amp 1j8m 1cjl 1beb 1OBP\n1b7f 1hng 1agd 1aye 1g4t 1eov 1bmt 7tim 1ce7 1hwn 2AAI 1fbv 1bf5 1jly 1dar 1eun 1rpx 1bbp 1bih\n1psd 1b8a 1ava 1CVJ 3eca 3kbp 1dio\n\n4\n\n\f12/5/2010\n2000\n1800\n1600\n1400\n1200\n1000\n800\n600\n400\n200\n0\n1mjc\n1ten\n2acy\n1ayc\n1CD8\n1e86\n1eif\n1h7i\n1bj7\n1gm6\n1wba\n1eyl\n1fap\n1hro\n256b\n1arb\n1urn\n1j8m\n1beb\n1b7f\n1agd\n1g4t\n1bmt\n1ce7\n2AAI\n1bf5\n1dar\n1rpx\n1bih\n1b8a\n1CVJ\n3kbp\n\nNumber of residues (Nodes)\n\nS. Khor\n\nGH64 Proteins\n\nFigure 2 Size of GH64 PCNs in terms of the number of Cα atoms documented in their PDB files.\n\n4. Links: short-range (SE) and long-range (LE)\nA link is placed between a pair of nodes representing the Cα atom of amino acids when the node\npair is situated less than 7Å apart from each other (section 2). We partitioned the set of links in a PCN\ninto two sets: long-range links (LE) and short-range links (SE). A link between nodes x and y is\nclassified as long-range if their absolute distance on the amino acid sequence chain is more than some\ndistance threshold (LE_TH). Long-range links connect amino acids which are far apart from each other\nin the primary structure but are in close spatial proximity in the tertiary structure. In this study, LE_TH\nis 9 (Green and Higman 2003), although we also consider LE_TH = 4. Unless otherwise stated, LE links\nrefer to long-range links with LE_TH = 9. Figures 3(a)-(c) examine various aspects of PCN links in the\nGH64 dataset. Similar observations are made on the EVA132 dataset (Appendix A).\nThe number of links M in a PCN increases linearly with protein size (number of nodes in a PCN)\n(Figure 3a). The number of long-range links |LE|, regardless of LE_TH, also increases linearly with\nprotein size, albeit at a slower rate (Figure 3a). For comparison, we cut in half the sequence distance\nthreshold for long-range links (LE_TH) from 9 to 4 (Figures 3a &b). On average, 30% of all links in a\nPCN are LE (when LE_TH = 9, mean |LE| / M = 0.2929 with standard deviation of 0.0834; when\nLE_TH = 4, mean |LE| / M = 0.3549 with std. dev. = 0.1005).\nInstead of the entire PCN, Gaci and Balev (2009) considered the subgraph induced by the set of\namino acids participating in secondary structures (links belonging to the less evolutionary conserved\nloop regions between SSEs are excluded). They call such a subgraph Secondary Structure Elements\nInteraction Network or SSE-IN. Gaci and Balev (2009) observed that the ratio of the number of\ninteractions between secondary structures to the total number of interactions in SSE-INs does not\nexceed 20%.\n\n5\n\n\fS. Khor\n\n12/5/2010\n8000\nPCN Links (< 7A)\n\n7000\n\nLong-range links (> 9)\n\nCount\n\n6000\n\nLong-range links (> 4)\n\n5000\n4000\n3000\n2000\n1000\n0\n0\n\n200\n\n400\n\n600\n\n800\n\n1000\n\n1200\n\n1400\n\n1600\n\n1800\n\nNodes\n\nFigure 3a Link count M, by protein size.\nProportion of all links\n\n0.6\n0.5\n0.4\n0.3\n0.2\nLong-range links (> 9)\n0.1\n\nLong-range links (> 4)\n\n0\n0\n\n200\n\n400\n\n600\n\n800\n\n1000\n\n1200\n\n1400\n\n1600\n\n1800\n\nNodes\n\nFigure 3b Long-range links as a proportion of all links (|LE|/M), by protein size. When LE_TH is\n9, the fraction of links in LE averages at 0.2929 with a standard deviation of 0.0834. When\nLE_TH is 4, the average is 0.3549 with a standard deviation of 0.1005\n0.12\nPCN Links (< 7A)\nLattice 8\nLattice 4\n\nLink Density\n\n0.10\n0.08\n0.06\n0.04\n0.02\n0.00\n0\n\n200\n\n400\n\n600\n\n800\n\n1000\n\n1200\n\n1400\n\nNodes\n\nFigure 3c Link density by protein size.\n\n6\n\n1600\n\n1800\n\n\fS. Khor\n\n12/5/2010\n\nThe GH64 PCNs have low link densities, and link density decreases rapidly with protein size\n(Figure 3c). Link density is the fraction of actual links out of all possible links: 2M / [N (N-1)]. On a\nlog-log plot, link density for PCN in Figure 3c straightens out into a line (section 9). For reasons which\nwill become clearer in section 5, Figure 3c compares the link densities of GH64 PCNs with those of two\nlinear lattices: Lattice8 and Lattice4. LatticeV is a linear lattice with V/2 nearest neighbours to the left\nand to the right where possible (V/2 nodes at each of the two ends of the lattice chain will have fewer\nlinks than the rest of the nodes in the middle which will have V links each). For a given network size\n(number of nodes), PCN link densities are indistinguishable from Lattice8 link densities (Figure 3c).\n\n5. Node Degree and Degree Distribution\nTypically, a node in a PCN represents the Cα atom of amino acids (section 2). The degree of a\nnode is the number of links attached to the node. In the present context, node degree measures the\nnumber of contacts a node has in a PCN. Gaci and Balev (2009) remarked on the homogeneity of node\ndegree in their SSE-INs. The mean degree of SSE-INs increases very slightly with protein size and falls\nwithin the range of 5 and 8. The absence of nodes with much higher degrees is attributed to the excluded\nvolume effect which imposes a physical limit on the number of residues that can reside within a given\nradius around another amino acid.\nNode degree distribution is the probability that a node has a particular degree. Node degree\ndistributions for a variety of PCNs (i.e. PCNs constructed in different ways and from different protein\nsets) are bell-shaped, characteristic of a Gaussian distribution (Green and Higman 2003; Atilgan et al\n2004; Bagler and Sinha 2005). Although, Green and Higman (2003) found that node degree\ndistributions of PCNs which consider only long-range interactions exhibit if not scale-free tendencies,\nthen exponential or highly right skewed distributions, irrespective of fold type. However, their PCN is\nunlike our PCN and other PCNs referenced in this paper. Each amino acid residue is still represented by\na single node in the Green and Higman PCN. However, all atoms of an amino acid are considered when\ndeciding on contact or link establishment, and multiple links between nodes are allowed. Therefore the\nGreen and Higman PCN can register much larger node degrees, with reported modes of 100 (Green and\nHigman 2003, p. 783). Gaci and Balev (2009) also observed scale-free tendencies in the node degree\ndistributions of their SSE-INs, with the caveat of a sharp cut-off above the mean node degree. Finding\nscale-free connectivity patterns in PCNs is attractive since such connectivity pattern has direct\nconsequences on efficiency of information transfer and robustness to random attacks in proteins (Green\nand Higman 2003; Atilgan et al 2004).\nNode degree statistics for PCNs in GH64 is presented in Figure4a. The mean node degrees are\nindependent of protein size and hover around 8 (mean node degree averaged over all PCNs in GH64 is\n7.9696 with a standard deviation of 0.3126). Little difference is observed between the corresponding\n\n7\n\n\fS. Khor\n\n12/5/2010\n\nmean node degrees and the median node degrees. The standard deviation values are about four times\nsmaller than the corresponding mean node degrees. All these statistics point towards bell shaped degree\ndistributions as reported in the literature, and as shown in Figure 4b for four proteins in GH64.\n18\n16\n\nNode Degree\n\n14\n12\n\nmax\n\n10\n\nmid\n\n8\n\nmean\n\n6\n\nstd.dev.\nmin\n\n4\n2\n0\n0\n\n200\n\n400\n\n600\n\n800\n\n1000 1200 1400 1600 1800\n\nNodes\n\nFigure 4a Node degree summary statistics for GH64 PCNs. The average mean node degree (K) is\n7.9696 with a standard deviation of 0.3126.\n0.35\n0.30\n\nProbability\n\n0.25\n1aep\n0.20\n\n1agd\n\n0.15\n\n1psd\n1CVJ\n\n0.10\n0.05\n0.00\n0\n\n2\n\n4\n\n6\n\n8\n10\nDegree\n\n12\n\n14\n\n16\n\nFigure 4b Node degree distributions of four PCNs in the GH64 dataset.\nSince we have partition the set of links into SE and LE (section 4), we can similarly classify the set\nof nodes into two subsets (although these two subsets are not necessarily disjoint): SE_nodes for the set\nof nodes which are endpoints of links in SE, and LE_nodes for the set of nodes which are endpoints of\nlinks in LE. Figure 5a compares the sizes of these subsets and we find that LE_nodes is generally\nslightly smaller than SE_nodes for proteins in GH64. This is not entirely surprising since we expect\nalmost all nodes to be in SE_nodes. For GH64, we found that the mean |SE_nodes| / N is 0.9970 with a\nstd. dev. of 0.0039, and the mean |LE_nodes| / N is 0.6659 with a std. dev. of 0.1093 where N = number\nof nodes. Thus there is significant overlap between SE_nodes and LE_nodes, almost a subset\n\n8\n\n\fS. Khor\n\n12/5/2010\n\nrelationship. For GH64, we found that mean |SE_nodes ∩ LE_nodes| / N is 0.6628 with a std. dev. of\n0.1103. Green and Higman (2003) found that between 5% to 25% of nodes within each of their PCNs\ndo not have long-range contacts, i.e. are not in LE_nodes. For the GH64 PCNs, the mean (N |LE_Nodes|) / N is 0.3341 with a std. dev. of 0.1093 (Figure 5b). Similar observations are made on the\nEVA132 dataset (Appendix A).\n\nNode Count\n\n1800\n1600\n\nSE\n\n1400\n\nLE\n\n1200\n1000\n800\n600\n400\n200\n0\n200\n\n400\n\n600\n\n800\n\n1000\n\n1200\n\n1400\n\n1600\n\n1800\n\nNodes\n\nFigure 5a Number of nodes which are endpoints for links in SE (SE_nodes), and number of nodes\nwhich are endpoint for links in LE (LE_nodes), by protein size for GH64. SE_nodes as a fraction\nof all nodes averages at 0.9970 with a standard deviation of 0.0039. LE_nodes as a fraction of all\nnodes averages at 0.6659 with a standard deviation of 0.1093.\nSE_nodes\nSE_ and LE_nodes\n\nProportion of all nodes\n\n1.2\n\nLE_nodes\nNot in LE_nodes\n\n1.0\n0.8\n0.6\n0.4\n0.2\n0.0\n0\n\n200\n\n400\n\n600\n\n800 1000 1200 1400 1600 1800\nNodes\n\nFigure 5b Sizes of different subsets of nodes as a proportion of all nodes for GH64 PCNs. On\naverage, 0.6628 ± 0.1103 of all nodes are in both SE_nodes and LE_nodes, while 0.3341 ± 0.1093 of\nall nodes are not in LE_nodes.\nBeing able to distinguish LE_nodes for a protein without prior knowledge of its 3D structure could\nbe an important step in predicting the 3D structure of proteins. Unfortunately, as we have observed\nabove, more than half of the amino acids in a protein sequence are expected to have at least one long-\n\n9\n\n\fS. Khor\n\n12/5/2010\n\nrange interaction (in the protein's native state). Perhaps a better strategy is to try to identify\ndistinguishing characteristics of the 30% or so nodes which are not involved in long-range interactions.\nWhat about the node degree characteristics of SE_nodes and of LE_nodes? We use two ways to do\nthis comparison. First, we compute node degree statistics for nodes in SE_nodes (LE_nodes) using the\nnode degree values from the PCN constructed with SE (LE) only. The result of this first comparison is\ndisplayed in Figure 6a. It yielded no significant difference at the 95% confidence level with the twosided paired t test (p-value = 0.871) or with the two-sided paired Wilcoxon test (p-value = 0.3305).\nNonetheless, we observed some differences between the degree distributions of PCN_SE (PCN\nconstructed with SE only) and PCN_LE (PCN constructed with LE only). The narrow degree ranges of\nour PCNs limits our ability to observe long-tailed behavior over several scales (Figure 6b).\nPCN SE avg\n\n7\n\nPCN LE avg\n\n6\n\nDegree\n\n5\n4\n3\n2\n1\n1mjc\n1ten\n2acy\n1ayc\n1CD8\n1e86\n1eif\n1h7i\n1bj7\n1gm6\n1wba\n1eyl\n1fap\n1hro\n256b\n1arb\n1urn\n1j8m\n1beb\n1b7f\n1agd\n1g4t\n1bmt\n1ce7\n2AAI\n1bf5\n1dar\n1rpx\n1bih\n1b8a\n1CVJ\n3kbp\n\n0\n\nGH64 Proteins\n\nFigure 6a Degree statistics for SE_nodes and for LE_nodes based respectively on PCNs\nconstructed from short-range links (SE) only and from long-range links (LE) only. Error bars\nmark ± standard deviation.\n0.6\n1aep\n\n0.7\n\n1agd\n\n0.6\n\n1psd\n\n0.5\n\n1CVJ\n\n1aep\n0.5\nProbability\n\nProbability\n\n0.9\n0.8\n\n0.4\n0.3\n0.2\n\n1agd\n1psd\n\n0.4\n\n1CVJ\n0.3\n0.2\n0.1\n\n0.1\n\n0\n\n0\n0\n\n2\n\n4\n\n6\n\n0\n\n8\n\n2\n\n4\n\n6\n\n8\n\n10\n\nPCN_LE Degree\n\nPCN_SE Degree\n\nFigure 6b Degree distributions of PCNs constructed with short-range (long-range) only links.\n\n10\n\n\fS. Khor\n\n12/5/2010\n\nSecond, we compute node degree statistics for nodes in SE_nodes (LE_nodes) using the node\ndegree values from the entire PCN. Figure 6c displays the result of this second comparison. According\nto the two-sided paired t test, and the two-sided paired Wilcoxon test, there is a significant difference at\nthe 95% confidence level between the two vectors. However, given the high overlap between SE_nodes\nand LE_nodes, this difference though statistically significant, may be slight in magnitude.\n14\n12\n\nDegree\n\n10\n8\n6\n4\n\nSE avg\n\n2\n\nLE avg\n1mjc\n1ten\n2acy\n1ayc\n1CD8\n1e86\n1eif\n1h7i\n1bj7\n1gm6\n1wba\n1eyl\n1fap\n1hro\n256b\n1arb\n1urn\n1j8m\n1beb\n1b7f\n1agd\n1g4t\n1bmt\n1ce7\n2AAI\n1bf5\n1dar\n1rpx\n1bih\n1b8a\n1CVJ\n3kbp\n\n0\n\nGH64 Proteins\n\nFigure 6c Degree statistics for SE_nodes and for LE_nodes based on node degree values for the\nentire PCN. Error bars mark ± standard deviation.\n\n6. Clustering\nClustering or transitivity reflects the cliquishness of nodes in a network: if node X connects to node\nY and to node Z, how likely is it that nodes Y and Z are connected to each other? There are different\nways of measuring such transitive relationships, strongly indicated in graphs by the presence of\ntriangles. One way is by taking the average clustering of all nodes in a network to yield the clustering\ncoefficient: C =\n\n1\nN\n\nN\n\n2ei\nwhere ki is the degree of node i, and ei is the number of links that exist\ni − 1)\n\n∑ k (k\ni =1\n\ni\n\namongst the ki nodes (Watts and Strogatz 1998). Vendruscolo et al (2002) reports C values of around\n0.58 ± 0.04 for their PCN (which has a different construction than ours), and Bagler and Sinha (2005)\nfound C values of around 0.553 ± 0.027, irrespective of protein structural class as defined in SCOP\n(Murzin et al 1995).\nFor the GH64 PCNs, the C values averaged at 0.5484 with a std. dev. of 0.0233, and they are\nindependent of protein size. Figure 7a compares them with the C values for Lattice8, Lattice4 and the\ntheoretical C values for regular (CREGULAR) and random (CRANDOM) networks of the same size (same\nnumber of nodes). CRANDOM ~ K / N, and CREGULAR = 3 (K-2) / [4 (K-1)], where K is average degree and\nN is number of nodes (Watts 1999). The theoretical C values for 1D regular networks (CREGULAR) are\nindistinguishable from the C values for Lattice8 (not surprising since mean degree of 8 is used). The C\n\n11\n\n\fS. Khor\n\n12/5/2010\n\nvalues for GH64 PCNs are slightly smaller than CREGULAR, and closer to the C values for Lattice4. This\nlast observation is telling as SE includes protein backbone links, and the protein backbone is the main\nsource of high clustering (Bartoli et al 2007). Further, Green and Higman (2003) observed that PCNs\nbuilt with only long-range links (LE) have relatively lower C values than those for PCNs with all links.\nThe same phenomenon is observed with GH64 proteins. Figure 7b shows the effect of randomizing\nPCN links. Unlike randomizing only long-range links (randLE), randomizing only short-range links\n(randSE) reduces clustering to levels similar to those of random graphs or randomizing all links\n(randAll).\n\nClustering Coefficient\n\n1.0\n0.8\nRegular\n0.6\n\nLattice8\nLattice4\n\n0.4\n\npcn\nRandom\n\n0.2\n0.0\n0\n\n200\n\n400\n\n600\n\n800 1000 1200 1400 1600 1800\nNodes\n\nFigure 7a Clustering coefficient values (± one standard deviation) for GH64 PCNs. Clustering\ncoefficients average at 0.5484 with standard deviation of 0.0233.\n\nClustering Coefficient\n\n1.0\n0.8\n\npcn\n\nrandLE\n\nrandSE\n\nrandAll\n\n0.6\n0.4\n0.2\n\n1mjc\n1ten\n2acy\n1ayc\n1CD8\n1e86\n1eif\n1h7i\n1bj7\n1gm6\n1wba\n1eyl\n1fap\n1hro\n256b\n1arb\n1urn\n1j8m\n1beb\n1b7f\n1agd\n1g4t\n1bmt\n1ce7\n2AAI\n1bf5\n1dar\n1rpx\n1bih\n1b8a\n1CVJ\n3kbp\n\n0.0\n\nGH64 Proteins\n\nFigure 7b Randomizing SE reduces clustering more than randomizing LE.\nLinks are randomized in the usual manner (Maslov and Sneppen 2002), by rewiring nodes while\npreserving node degrees and without introducing multiple links between nodes. For example, to\nrandomize the set of long-range links (randLE), two LE links e1(a, b) and e2(c, d) are picked uniformly\n\n12\n\n\fS. Khor\n\n12/5/2010\n\nat random with replacement from LE. If both e3(a, c) and e4(b, d) do not already exist in the network,\nthen e3 and e4 replace e1 and e2.\nHigh clustering in PCNs is almost always discussed in terms of the small-world property (Watts\nand Strogatz 1998). Since the small-world property also involves the characteristic path length statistic\n(section 8), the importance of short inter-node distances to protein folding inevitably dominates the\ndiscussion. As a result, the role of high clustering (at the local interaction level) to protein folding is\nsomewhat under explained. A small exception to this is Bagler and Sinha (2005; 2007). They suggest\nthat high clustering in PCNs is indicative of a modular hierarchical organization as a result of the\nprotein folding process, but called for further investigation into this hypothesis (Bagler and Sinha 2005).\nIn (Bagler and Sinha 2007), they report a negative correlation between protein folding speed and high\nclustering levels in PCN_LE (PCNs that only take into account long-range links). However, they did not\nfind any significant relationship between protein folding speed and clustering levels of entire PCNs.\nHence, the exact role clustering plays in protein folding is still an open question. Since most of the\nclustering comes from short-range links (SE), which comprise backbone and secondary structure links,\nit may be that high clustering of short-range links is necessary merely as a scaffolding device to create\nthe \"all-important\" long-range contacts. Alternatively, it may be that the high clustering levels found in\nPCNs is a side effect of another network characteristic with a clearer relationship with some aspect of\nprotein folding, for example assortativity and protein folding speed (section 7). Or, it could be that the\nlocal organization of short-range links really does play a role in some aspect of protein folding. In social\nnetworks, transitive relationships are assumed to be part of the nature of human social behavior, and the\nproblem is to explain the establishment and subsequent efficient reuse of \"random\" short-cuts. An\ninteresting example of such a study is Kleinberg (2000), although how far the analogy between human\nsocial networks and protein contact networks (or any other kind of residue \"interaction\" network)\napplies to protein folding remains to be seen.\n\n7. Assortativity\nNetwork assortativity refers to the extent that nodes associate or connect with their own kind. A\ncommon form of assortativity measured for PCNs is node degree. In this section (and throughout this\npaper), positive assortativity refers to the proclivity of nodes with small (large) degree to link with other\nnodes of small (large) degree. Using the method in (Newman 2002), Bagler and Sinha (2007) report\ndegree-degree correlation coefficients up to 0.58, which is considered unusual for networks with\nbiological origins (we discuss this point further ahead). Nonetheless, the positive assortativity values\ncould be correlated in a positive manner to protein folding speeds (Bagler and Sinha 2007).\nSimilarly, we find that the GH64 PCNs have positive degree-degree correlations (Figure 8a). Their\nassortativity values average at 0.3387 with a standard deviation of 0.0536, and are independent of\n\n13\n\n\fS. Khor\n\n12/5/2010\n\nprotein size. Figure 8b uses an alternative method (which is less sensitive to the effects of superconnected nodes) to assess degree assortativity (Pastor-Satorras et al 2001). In this other method, a\npositive correlation between degree k and the average degree of nodes directly neighbouring nodes of\ndegree k is interpreted as evidence of positive degree-degree assortativity. In general, the plots in Figure\n8b agree with the summary in Figure 8a. Although, the plots show some weakening (even reversal) in\nthe relationship as node degree increases, which could be due to the limits on node degree (Bagler and\nSinha 2007). This coupled with assortativity values close to those for Lattice4 (Figure 8a) is telling.\nLike clustering (section 6), assortativity is more sensitive to random rewiring of short-range links\n(randSE) than to random rewiring of long-range links (randLE) (Figure 8c). And when analyzed\nseparately, long-range links (LE) show less positive assortativity than short-range links (SE). This\nmeans that like clustering, the high positive assortativity values of PCNs also mainly stem from SE.\n0.8\n\nAssortativity\n\n0.6\nLattice8\n\n0.4\n\nLattice4\npcn\n\n0.2\n\nrandAll\n\n0.0\n-0.2\n0\n\n200\n\n400\n\n600\n\n800 1000 1200 1400 1600 1800\nNodes\n\nFigure 8a The GH64 PCNs have positive degree assortativity, with values close to Lattice4.\nMean Assortativity is 0.3387 with a standard deviation of 0.0536.\nAverage Neighbourhood Degree\n\n12.0\n10.0\n8.0\n\n1aep\n1agd\n\n6.0\n\n1psd\n1CVJ\n\n4.0\n2.0\n0.0\n0\n\n2\n\n4\n\n6\n\n8\n10\nDegree\n\n12\n\n14\n\n16\n\nFigure 8b Average neighbourhood degree for degree k is the average degree of all nodes adjacent\nto all nodes of degree k. A positive correlation implies positive degree-degree assortativity.\n\n14\n\n\fS. Khor\n\n12/5/2010\n0.8\n\nAssortativity\n\n0.6\n\npcn\n\nrandLE\n\nrandSE\n\nrandAll\n\n0.4\n0.2\n0.0\n\n1mjc\n1ten\n2acy\n1ayc\n1CD8\n1e86\n1eif\n1h7i\n1bj7\n1gm6\n1wba\n1eyl\n1fap\n1hro\n256b\n1arb\n1urn\n1j8m\n1beb\n1b7f\n1agd\n1g4t\n1bmt\n1ce7\n2AAI\n1bf5\n1dar\n1rpx\n1bih\n1b8a\n1CVJ\n3kbp\n\n-0.2\n\nGH64 PCMs\n\nFigure 8c Effect of randomizing links on Assortativity.\nrandSE produces a larger effect than randLE.\n0.6\n\nAssortativity\n\n0.4\n0.2\n0.0\nSE\n\n-0.2\n\nLE\n\n-0.4\n0\n\n200\n\n400\n\n600\n\n800\n\n1000\n\n1200 1400\n\n1600\n\n1800\n\nNodes\n\nFigure 8d Assortativity for long-range links (LE) and short-range links (SE).\nPreviously, a number of biological networks including gene regulatory networks were described as\ndisassortative, and it was suggested that this negative assortativity (specifically nodes of high degree or\nhubs are not directly connected with each other in the networks studied) is advantageous in the sense\nthat the effects of harmful perturbations could be better localized (Maslov and Sneppen 2002). Brede\nand Sinha (2005) conclude that the stability of networks with assortative mixing by node degree (i.e.\npositive assortativity) declines more rapidly with increases in network size. A system with fragile\nstability is easily dislodged from its equilibrium state by small disturbances. However, the positive\nassortativity of PCNs may actually work to the benefit of the protein folding process by helping\ninformation to flow quickly and thus facilitate coordinated action crucial for correct and rapid protein\nfolding. Further, native state proteins \"adjust\" themselves during ligand-binding, and thus some\nvulnerability to perturbations or marginal stability may be advantageous (Taverna and Goldstein 2002).\n\n15\n\n\fS. Khor\n\n12/5/2010\n\nIndeed if percolation is important, Vazquez and Moreno (2003) conclude that node degree assortativity\ncan make networks robust to random node or edge removals. Additionally, there could be some\ndelegation of responsibilities between interacting biological networks in the sense that the amino acid\nchain is the product of gene translation and concerns about containing unwanted perturbations in a\nfolding protein may be taken care of by the disassortative structure of genetic networks. Additionally,\nsince LE is less assortative than SE (Figure 8d), there may still be some degree of isolation between\nparts (node subsets) of a PCN to buffer against unexpected perturbations. It appears that there are yet\ninteresting discussions to be had on this topic.\n\n8. Average Path Length\nAverage path length of a network is the average shortest path between all node-pairs. It represents\nthe number of links that needs to be traversed on average when trying to move between nodes in a\nnetwork. PCNs are known to have average path lengths characteristic of random graphs of the same\nsize. For their respective protein sets and PCN constructions, Vendruscolo et al (2002) report an average\npath length of 4.1 ± 0.9, while Bagler and Sinha (2005) report an average path length of 6.88 ± 2.61.\nPath length is widely mentioned as a topological feature of PCNs that is highly relevant to protein\nfolding (Vendruscolo et al 2002; Dokholyan et al 2002; Atilgan 2004; Del Sol et al 2006). The\nargument is: Short path lengths are conducive to rapid communication between amino acid molecules of\na protein, which facilitates interaction cooperativity crucial for protein folding. We revisit this point\nelsewhere (manuscript submitted). Briefly, we find that shorter inter-node distances is no guarantee of\nfinding a global optimum more easily if the shorter average path lengths is the result of more links and\nthe fitness function is such that additional links increase frustration.\nFigure 9a gives various path length statistics for GH64 PCNs. Both diameter (maximum shortest\npath length found) and average path length increase logarithmically as protein size (nodes) increases.\nWhen compared with average path lengths of other canonical networks, the average path lengths of\nPCNs are much shorter than regular graphs and approximate the average path lengths expected of\nrandom graphs of the same size (Figure 9b). Although the standard deviations indicate rather large\ndispersions of shortest path lengths in the PCNs, the average path length and median path length values\nare very close to each other (Figure 9a). We gather from this that there is little skew in the distribution\nof shortest path lengths for PCNs, and it is indeed the case. Figure 9c shows the Gaussian like\ndistributions of shortest path lengths for four GH64 PCNs.\n\n16\n\n\fS. Khor\n\n12/5/2010\n32\n28\n\nPath Length\n\n24\n20\n\nmaximum\n\n16\n\nmean\n\n12\n\nmedian\n\n8\n4\n0\n0\n\n200\n\n400\n\n600\n\n800 1000 1200 1400 1600 1800\nNodes\n\nFigure 9a Diameter, average (± one standard deviation) and median path length for GH64 PCNs.\n300\nLattice4\nMean Path Length\n\n250\n\nLattice8\nRegular\n\n200\n\npcn\n150\n\nRandom\n\n100\n50\n0\n0\n\n200\n\n400\n\n600\n\n800\n\n1000\n\n1200\n\n1400\n\n1600\n\n1800\n\nNodes\n\nFigure 9b Average path lengths of PCNs are much closer to average path lengths of random\nnetworks (LRANDOM) than to average path length of regular networks (LREGULAR). LRANDOM ~ ln N /\nln K, and LREGULAR = N (N + K-2) / [2K (N-1)], where K is average degree and N is number of\nnodes (Watts 1999).\n0.25\n1aep\n\nProbability\n\n0.20\n\n1agd\n1psd\n\n0.15\n\n1CVJ\n\n0.10\n0.05\n0.00\n0\n\n5\n\n10\n\n15\n\n20\n\n25\n\n30\n\n35\n\nShortest Path Length\n\nFigure 9c Distribution of shortest path lengths for four GH64 PCNs.\n\n17\n\n\fS. Khor\n\n12/5/2010\n\nFigures 10a&b respectively show the effect of randomizing links on the average path lengths and\non the diameters of PCNs. Like Clustering (section 6) and Assortativity (section 7), randomizing only\nlong-range links (randLE) produces a smaller effect than randomizing only short-range links (randSE).\nBoth the two-sided paired t test and the two-sided paired Wilcoxon test report a significant difference at\nthe 95% confidence level between the randSE and the randLE vectors of mean path length values\n(Figure 10a). Indirectly, this shows that a larger proportion of the magnitude of a PCN's average path\nlength is due to SE.\n28\n\nMean Path Length\n\n24\n\npcn\n\nrandLE\n\nrandSE\n\nrandAll\n\n20\n16\n12\n8\n4\n0\n0\n\n200\n\n400\n\n600\n\n800\n\n1000\n\n1200\n\n1400\n\n1600\n\n1800\n\nNodes\n\n44\n40\n36\n32\n28\n24\n20\n16\n12\n8\n4\n0\n\npcn\n\nrandLE\n\nrandSE\n\nrandAll\n\n1mjc\n1ten\n2acy\n1ayc\n1CD8\n1e86\n1eif\n1h7i\n1bj7\n1gm6\n1wba\n1eyl\n1fap\n1hro\n256b\n1arb\n1urn\n1j8m\n1beb\n1b7f\n1agd\n1g4t\n1bmt\n1ce7\n2AAI\n1bf5\n1dar\n1rpx\n1bih\n1b8a\n1CVJ\n3kbp\n\nMaximum Path Length\n\nFigure 10a Effect of randomizing links on the average path lengths of GH64 PCNs. randSE has a\nstronger effect than randLE.\n\nGH64 Proteins\n\nFigure 10b Effect of randomizing links on the diameters of GH64 PCNs. randSE has a stronger\neffect than randLE.\nRandomization of links also reveals that it is possible to rearrange the links of a PCN so that the\naverage path length is significantly reduced. Thus the question: if short inter-nodal distances are\nimportant for protein folding, why aren't the average path lengths of PCNs shorter than they are?\n\n18\n\n\fS. Khor\n\n12/5/2010\n\nPreserving high clustering and positive assortativity (if they are important for protein folding) is not an\nadequate answer since it is still possible to maintain clustering and positive assortativity at levels higher\nthan would be in random graphs, while significantly reducing the average path lengths of PCNs by\nrandomizing the long-range links (randLE). We investigate this question elsewhere and find evidence\nshowing that randLE can be less conducive to search than PCN (manuscript submitted).\n\n9. Power-laws in PCNs\nIn the more recent history of the science of complex networks, power-law distribution or the lack\nof scale is often associated with the node degree variable. We have already touched upon this in section\n5 in relation to PCNs. In this section we offer two other (non-node degree) places in PCNs where\npower-law distribution can be found. The first resides across proteins (PCNs) in the relationship\nbetween nodes and link density. This derives directly from the mean node degree constant, K (Figure\n4a). The second resides within individual PCNs in terms of the distribution of link sequence distances.\n\n9.1 Link Density Distribution across PCNs\nFigure 11 (left) is the link density plot in Figure 3c on a log-log scale, and Figure 11 (right) is a\nsimilar plot for Figure A3 in Appendix A. Both show clear power-law relationships, but with an atypical\nexponent of -1. Number of links, M = K N / 2 where K is mean average node degree and N is number of\nnodes. Link density = (2 M) / [N (N-1)] ≈ K / N. Empirical data tells us that K = 8 (section 5).\n1.000\n\n1.000\n10\n\n100\n\n1000\n\n0.100\n\n0.010\n\n1\n\n10000\n\nLink Density\n\nLink Density\n\n1\n\n10\n\n100\n\n1000\n\n10000\n\n0.100\n\n0.010\nPCN Links (< 7A)\n\nPCN Links (< 7A)\n8/N\n\n8/N\n0.001\n\n0.001\n\nNodes (EVA132)\n\nNodes (GH64)\n\nFigure 11 Links density plots on logarithmic scales.\n9.2 Link Sequence Distance Distribution for a PCN\nFigure 12a summarizes the link sequence distance for PCNs in GH64. Sequence distance is the\nabsolute distance of a link on the protein sequence (section 4). Minimum sequence distance for all PCNs\nis 1. We find for N < 4000, the mean link sequence distance generally increases with protein size as a\nconsequence of being pulled up by the maximum link sequence distance which generally increases with\nprotein size. However, the median link sequence distance remains fairly constant with protein size and\n\n19\n\n\fS. Khor\n\n12/5/2010\n\nwell below the average link sequence distance per PCN. Similar observations are made for PCNs in the\nEVA132 dataset (Figure A8). These summary statistics hint at a non-Gaussian distribution for link\nsequence distances. The link sequence distance distributions for four proteins on a log-log scale can be\nseen in Figures 12b and 13a. There is a straight line region with a negative slope and a sharp cut-off\npoint in each plot, revealing traces of a power-law. Taking the maximum link sequence distance as a\nfraction of the number of nodes per PCN reveals that on average, links have a maximum span of about\n0.7 N (Figures 12c and 13b).\n\nLink Sequence Distance\n\n160\nAvg.\n\n140\n\nStd. dev.\n\n120\n\nMedian\n\n100\n80\n60\n40\n20\n0\n0\n\n200\n\n400\n\n600\n\n800\n\n1000\n\n1200\n\n1400\n\n1600\n\n1800\n\n1200\n\n1400\n\n1600\n\n1800\n\nNodes\nLink Sequence Distance\n\n1600\nMax\n\n1400\n1200\n1000\n800\n600\n400\n200\n0\n0\n\n200\n\n400\n\n600\n\n800\n\n1000\n\nNodes\n\nFigure 12a Link sequence distance summary statistics for GH64 PCNs indicate right skewed\ndistributions for link sequence distance.\n\n20\n\n\f12/5/2010\n\nReversed Cumulative Probability\n\nS. Khor\n1\n\n0.1\n\n0.01\n\n1aep\n1agd\n\n0.001\n\n1psd\n1CVJ\n\n0.0001\n1\n\n10\n\n100\n\n1000\n\nLink Sequence Distance\n\nFigure 12b Link sequence distance distributions for 4 GH64 PCNs on logarithmic scales.\n1.2\nMaxLinkSeqDist/N\n\n1.0\n0.8\n0.6\n0.4\n0.2\n0.0\n0\n\n200\n\n400\n\n600\n\n800\n\n1000\n\n1200\n\n1400\n\n1600\n\n1800\n\nNodes\n\nFigure 12c Maximum link sequence distance as a fraction of the number of nodes in a PCN.\nMaxLinkSeqDist/N averages at 0.7874 ± 0.1402 for GH64.\nReversed Cumulative Probability\n\n1.0000\n\n0.1000\n\n0.0100\n1fp3\n1S5L\n0.0010\n\n1m32\n1sw6\n\n0.0001\n1\n\n10\n\n100\n1000\nLink Sequence Distance\n\n10000\n\nFigure 13a Link sequence distance distributions for 4 EVA132 PCNs on logarithmic scales.\n\n21\n\n\fS. Khor\n\n12/5/2010\n1.2\nMaxLinkSeqDist/N\n\n1.0\n0.8\n0.6\n0.4\n0.2\n0.0\n0\n\n800\n\n1600\n\n2400\n\n3200\n\n4000\n\n4800\n\n5600\n\n6400\n\nNodes\n\nFigure 13b Maximum link sequence distance as a fraction of the number of nodes in a PCN.\nMaxLinkSeqDist/N averages at 0.7068 ± 0.1860 for EVA132.\n\n10. A Dynamic View\nIn this section, we study the effects of adding long-range links to a PCN already containing shortrange links. We assume links are independent of each other and that links of a shorter sequence distance\nform before links of a longer sequence distance. Long-range links are added one at a time, and in order\nof non-decreasing link sequence distance, and we do not pay attention to the order of links having the\nsame sequence distance but use random selection instead. This is admittedly a crude way of simulating\nthe folding process of a protein, but it captures its essence. We monitor the change over time of two\nnetwork characteristics: node betweeness and average path length. Based on the literature surveyed, we\nexpect a number of nodes to exhibit distinctively higher node betweeness, and we expect the average\npath length to decrease over time. That average path length will decrease is a given (although occasional\nsmall increases is possible), but what is more interesting and pertinent is the way the general decrease\nhappens.\nBetweeness of a node is a measure of the node's centrality, or importance in terms of path traversal\nbetween nodes in a network. More specifically, the betweeness of a node is the fraction of shortest paths\nfound between all node pairs that pass through the node. In an effort to identify amino acids that play a\nkey role in a protein's folding process, Vendruscolo et al (2002) observed that key residues often exhibit\nsignificantly higher node betweeness in a protein's transition state. However, this signal attenuates as a\nprotein reaches its native state (due to compactness). Hence, looking at node betweeness in a protein's\nnative state PCN is more likely to produce false positives of a protein's nucleation sites. Nonetheless, a\ntopological (network structure) understanding of the protein folding process may help us understand\nhow a protein's unique native conformation is chosen (Vendruscolo et al 2002).\nDokholyan et al (2002) used topological characteristics of protein conformation graphs (PCN) to\ndistinguish conformations belonging to a protein's transition state ensemble (TSE) that will cross the\n\n22\n\n\fS. Khor\n\n12/5/2010\n\nenergy barrier and reach the protein's native state versus those that will not. They found that posttransition conformations (TSE conformations which have their nucleus formed and are more likely to\nreach the native state) are more small-world like than pre-transitions conformations (TSE conformations\nwhich have not formed their nucleus and are less likely to reach the native state) in the sense that the\naverage path length of post-transition conformation graphs (PCN) is significantly shorter than the\naverage path length of pre-transition PCNs. In other words, there is a tightening of the small-world\nstructure of proteins as they approach their native conformations (become more compact).\nFigure 14a shows that as the 1agd protein \"folds\" (using the scheme described above), average\nnode betweeness decreases slightly, but experiences a phase transition just after t=350, resulting in a\nsudden and substantial increase in average node betweeness accompanied also by an increase in node\nbetweeness standard deviation, and a distinct shortening of average path length (Figure 14c). Both the\nmedian and the maximum node betweeness also register sudden and substantial increases at the same\npoint in time (Figure 14b). These effects indicate a wider dispersion of node betweeness values amongst\nthe nodes with some nodes exhibiting much higher node betweeness as observed in (Vendruscolo et al\n2002). In Figure 15a, we compare the distribution of node betweeness for 1agd at three points in time:\nbefore the transition point (t=250), around the transition point (t=355) and at the end of the folding\nprocess (t=482). All three plots are highly right-skewed (the use of a log-log plot helps with\nvisualization). Limiting the comparison to the three points in time, we find a definite widening of node\nbetweeness distribution from t=250 to t=355, followed by a narrowing of node betweeness distribution\nfrom t=355 to t=482 (the tail of the plot swishes to the right then to the left). Betweeness of nodes\nbecome more evenly spread out amongst nodes in 1agd's native state.\nHowever, the folding dynamics of 1aep shows a more subtle transition (Figure 14 right). At around\nthe transition point (t=29) where average path length shortens at a faster rate (Figure 14f), there is no\nsudden or substantial increase in average node betweeness (Figure 14d) and maximum node betweeness\nis actually dipping rapidly (Figure 14e). But there is a spike in median node betweeness (Figure 14e).\nThese effects are not indicative of a widening then narrowing range of node betweeness values (Figure\n15b), but a convergence of some kind (average and median values get closer to each other in both 1aep\nand 1agd). It appears that as with 1agd, betweeness of nodes become more evenly spread out amongst\nnodes in 1aep's native state (and therefore become less indicative of the key residues). Analogous to the\nidea of crossing an energy barrier in protein folding kinetics, this change in node betweeness could be\nseen as crossing some kind of communication barrier.\nWithin the nucleation model of protein folding, time prior to the transition point could be regarded\nas a nucleation growth phase. After the nucleus is formed, the protein polymer becomes committed to its\nnative conformation and quickly reaches it as indicated by the rapid shortening of average path lengths.\nIt would be interesting to investigate this effect further: (i) to test the reliability of median node\n\n23\n\n\fS. Khor\n\n12/5/2010\n\nbetweeness as an indicator of a nucleation event in protein folding, and (ii) to monitor the nucleation\nrates for proteins of different fold types and sizes to see whether there are constants or specific\n\n0.14\n0.12\n0.10\n0.08\n0.06\n0.04\n0.02\n0.00\n-0.02\n-0.04\n-0.06\n\n(a)\n\n0.25\n\navg\nmedian\n\nNode Betweeness\n\n(d)\n\n0.20\n\navg\n\n0.15\n\nmedian\n\n0.10\n0.05\n0.00\n-0.05\n-0.10\n\n0\n\n50\n\n0\n\n100 150 200 250 300 350 400 450 500\n\n10\n\n20\n\n30\n\n0.006\n\nmax\n\n0.005\n0.004\n0.003\n0.002\n0.001\n0\n0\n\n70\n\n0.60\n\n(e)\n0.025\n\n0.50\n\n0.020\n\n0.40\n\n0.015\n\n0.30\n\n0.010\n\n0.20\n\nmedian\n\n0.005\n\n0.10\n\nmax\n\n0.000\n\n50 100 150 200 250 300 350 400 450\n\n0.00\n0\n\n10\n\n20\n\nTime\n\n30\n\n40\n\n50\n\n60\n\nTime\n\n6.5\n\n(c)\n20\n\nShortest Path Length\n\n25\nShortest Path Length\n\n60\n\n0.030\n\nMedian\n\nmedian\n\n0.50\n0.45\n0.40\n0.35\n0.30\n0.25\n0.20\n0.15\n0.10\n0.05\n0.00\n\nMaxim um\n\nMedian\n\n0.007\n\n(b)\n\n50\n\nTime\n\nTime\n\n0.008\n\n40\n\nMaxim um\n\nNodes Betweeness\n\nrelationships.\n\nhpl\n\n15\n10\n5\n0\n\n(f)\n\n6.0\n\nhpl\n\n5.5\n5.0\n4.5\n4.0\n3.5\n3.0\n\n0\n\n50 100 150 200 250 300 350 400 450 500\nTime\n\n0\n\n10\n\n20\n\n30\n\n40\n\n50\n\n60\n\n70\n\nTime\n\nFigure 14 Left: plots for 1agd. Right: plots for 1aep. Each time step marks the addition of a longrange link to the PCN. At time=0, the PCN only has short-range links. (a) and (d): Average node\nbetweeness ± standard deviation. Median node betweeness lie below average values throughout.\n(b) and (e): Median and maximum node betweeness values. (c) and (f): Average path length\nmeasured using the harmonic mean method (Newman, 2003) to allow for possibility of\ndisconnected PCNs. hpl is more reliable than apl when dealing with disconnected networks, e.g.\n1agd (Figure 16).\n\n24\n\n\fS. Khor\n\n12/5/2010\n\nReversed Cumulative Probability\n\n1.000\n\n0.100\n1agd\n0.010\n\nt=250\nt=355\nt=482\n\n0.001\n0.0001\n\n0.001\n\n0.01\n\n0.1\n\n1\n\nNode Betweeness\n\nReversed Cumulative Probability\n\nFigure 15a Distribution of node betweeness for 1agd at three points in time: 250, 355 and 482, on\nlogarithmic scales. The tail ends of the plots swishes to the right then to the left.\n1.000\n\n0.100\n1aep\n0.010\n\nt=15\nt=29\nt=62\n\n0.001\n0.0001\n\n0.001\n\n0.01\n\n0.1\n\n1\n\nNode Betweeness\n\nFigure 15b Distribution of node betweeness for 1aep at three points in time: 15, 29 and 62, on\nlogarithmic scales. The tail ends of the plots swishes only in one direction, towards the left.\nFor comparison, Figures 16 and 17 show how average path length changes if long-range links are\nadded in random order, i.e. not added in order of non-decreasing sequence distance. For both proteins,\nthe drop in average path length occurs earlier when long-range links are added in random order, than\nwhen long-range links are added in order of non-decreasing link sequence distance order. This kind of\ndecrease is similar to that observed in Figure 18 (section 11). Hence protein folding is a specific\nrewiring process (Dokholyan et al 2002).\n\n25\n\n\f12/5/2010\n\n350\n300\n\nLink Sequence Distance\n\nLink Sequence Distance\n\nS. Khor\n\n1agd\n\n250\n200\n150\n100\n50\n0\n0\n\n350\n300\n250\n200\n150\n100\n50\n0\n\n50 100 150 200 250 300 350 400 450 500\n\n0\n\nTime\n\nTime\n25\n\nhpl\n\n20\n\nShortest Path Length\n\nShortest Path Length\n\n25\n\n15\n10\n5\n0\n\nhpl\n\n20\n15\n10\n5\n0\n\n0\n\n50 100 150 200 250 300 350 400 450 500\n\n0\n\nTime\n50\n45\n40\n35\n30\n25\n20\n15\n10\n5\n0\n\napl\n\n0\n\n50 100 150 200 250 300 350 400 450 500\nTime\n\nS hortest Path Length\n\nShortest Path Length\n\n50 100 150 200 250 300 350 400 450 500\n\n50 100 150 200 250 300 350 400 450 500\nTime\n\n50\n45\n40\n35\n30\n25\n20\n15\n10\n5\n0\n\napl\n\n0\n\n50 100 150 200 250 300 350 400 450 500\nTime\n\nFigure 16 Behavior of average path length as long-range links for 1agd are added in nondecreasing order (left) versus in random order (right).\n\n26\n\n\f12/5/2010\n\n140\n\nLink Sequence Distance\n\nLink Sequence Distance\n\nS. Khor\n\n1aep\n\n120\n100\n80\n60\n40\n20\n0\n0\n\n10\n\n20\n\n30\n\n40\n\n50\n\n60\n\n140\n120\n100\n80\n60\n40\n20\n0\n\n70\n\n0\n\n10\n\n20\n\nTime\n\n50\n\n60\n\n70\n\n6.5\nShortest Path Length\n\nShortest Path Length\n\n40\n\nTime\n\n6.5\nhpl\n\n6.0\n5.5\n5.0\n4.5\n4.0\n3.5\n3.0\n\nhpl\n\n6.0\n5.5\n5.0\n4.5\n4.0\n3.5\n3.0\n\n0\n\n10\n\n20\n\n30\n\n40\n\n50\n\n60\n\n70\n\n0\n\n10\n\n20\n\nTime\n\n30\n\n40\n\n50\n\n60\n\n70\n\nTime\n25\nShortest Path Length\n\n25\nShortest Path Length\n\n30\n\napl\n\n20\n15\n10\n5\n0\n\napl\n\n20\n15\n10\n5\n0\n\n0\n\n10\n\n20\n\n30\n\n40\n\n50\n\n60\n\n70\n\nTime\n\n0\n\n10\n\n20\n\n30\n\n40\n\n50\n\n60\n\n70\n\nTime\n\nFigure 17 Behavior of average path length as long-range links for 1aep are added in nondecreasing order (left) versus in random order (right).\n\n11. A Network Approach to Protein Folding\nFrom a network perspective, the protein folding problem boils down to generating the right set of\nlinks between amino acid residues of a protein. While many network characteristics of PCNs have been\ndiscovered over the past decade, there is less (published) effort to integrate this knowledge into a single\nmodel and use it for the protein folding problem. Perhaps this is due to the current difficulty of creating\nnetworks to simultaneously fit a number of static and dynamic structural characteristics, still incomplete\ndescription of PCNs, the very specific and diverse arrangement of links in PCNs, and/or even the\n\n27\n\n\fS. Khor\n\n12/5/2010\n\nrelative success of knowledge-based protein structure prediction methods. In this section, we outline an\napproach to protein folding that uses several of the network structural characteristics of PCNs\nmentioned in this paper. This model is still in its infancy, but we hope that it is a good first step in\nrealizing a network approach to protein folding ab initio, or at least put to rest naïve conceptions of PCN\nmodels.\nThe model begins with short-range links arranged on a linear lattice with N nodes. We use Lattice6\nwith N nodes, i.e. each node has 3 nearest neighbours to its left and to its right where possible. This\ngives approximately\n\nV\nV\n N −  links, or ≈ 3N when V=6. Since we found in section 4 that |SE| ≈ 0.7 M\n2\n2\n\nand M = 4 N, V=6 gives an empirically reasonable number of short-range links to start with. Long-range\nlinks are then added to the lattice. The endpoints of a long-range link is selected uniformly at random\nfrom the set of nodes such that the absolute distance between them are within [10, 0.7 N] (section 9.2).\nWe made two independent runs, and set N to 385. The statistics we monitored are link sequence\ndistance distribution, node degree distribution, average path length, clustering, and assortativity. Figure\n18 (specifically plots lin_11 and lin_12) present the results of our experiment with the model. The\nresults are compared with statistics from the 1agd PCN, and runs made with the model on a ring\ntopology (plots ring_11 and ring_12). For the experiments on a ring topology, the initial lattice is still\nlinear, but long-range links are added as if the lattice is a ring. Results from both topologies showed no\nsignificant differences in that both failed to approximate the statistics for 1agd. Sorting the links\ngenerated by the model (plots slin_11 and slin_12) did not help to narrow this gap, although some\ndifference in average path length behavior is observed (the initial descend is slower).\n\n11.1 The problem of identifying LE_nodes: some pitfalls\nWhat our model lacks, amongst other elements, is a reliable way to identify the endpoints of longrange links, or the set of LE_nodes. The last observation in section 5 (Figure 6c) implies that for the\nmost part, long-range links (LE) more so than short-range links (SE) connect nodes with many contacts\nin a PCN. At this point, given the assortative nature of PCNs (section 7) and the frequent description of\nproteins with their domains or modules, and protein folding as a strict process from secondary to tertiary\nstructures and beyond (see Gō 1983 for a messier view), it may be tempting to picture long-range links\nconnecting hub nodes, i.e. nodes of high degree. However, this picture may not be entirely accurate for\ntwo possibly related reasons.\nFirst, for PCNs of proteins in their native state, hubs do not necessarily occupy a central position\n(section 10). The correlation between node degree and node betweeness rapidly declines as protein size\nincreases (Figure 19, Appendix B). This implies that many shortest paths in a PCN do not go through\n\n28\n\n\fS. Khor\n\n12/5/2010\n\nhub nodes, and since long-range links provide important short-cuts links in PCNs, it is contradictory to\n\nReversed Cumulative Probability\n\nthink of long- range links connecting hub nodes.\n1.000\n\n0.100\n\n0.010\n\nring_11\nring_12\nlin_11\nlin_12\n\n0.001\n\n1agd\n0.000\n1\n\n10\n\n100\n\n1000\n\nLink Sequence Distance\n0.30\n\n25\nring_11\nring_12\nlin_11\nlin_12\n1agd\n\n0.20\n0.15\n\n20\n15\n\n0.10\n\n10\n\n0.05\n\n5\n\n0.00\n0\n\n2\n\n4\n\n6\n\n8\n\n10\n\n12\n\n14\n\n0\n\n16\n\n0\n\nDegree\n\n50\n\n100\n\n150\n\n200\n\n250\n\n300\n\n350\n\n400\n\n450\n\n500\n\nTime\n\n0.7\n\n0.5\n\n0.6\n\nring_11\nring_12\nlin_11\nlin_12\nslin_11\nslin_12\n\n0.4\n\n0.5\n\nAsso rtativity\n\nC lu sterin g C o efficien t\n\nring_11\nring_12\nlin_11\nlin_12\n1agd\nslin_11\nslin_12\n\nHP L\n\nP robability\n\n0.25\n\n0.4\nring_11\nring_12\nlin_11\nlin_12\nslin_11\nslin_12\n\n0.3\n0.2\n0.1\n\n0.3\n0.2\n0.1\n\n0.0\n\n0.0\n0\n\n50\n\n100\n\n150\n\n200\n\n250\n\n300\n\n350 400\n\n450\n\n500\n\nTime\n\n0\n\n50\n\n100\n\n150\n\n200\n\n250\n\n300\n\n350\n\n400\n\n450\n\n500\n\nTime\n\nFigure 18 Results from a network approach to protein folding compared with the network\nstatistics of the PCN for 1agd which is of the same size. The PCN for 1agd has a clustering\ncoefficient of 0.5397, an assortativity value of 0.3037, and about 72% of its nodes are endpoints of\nlong-range links. In the model, for both ring and linear topology, about 91% of nodes are in\nLE_nodes.\n\n29\n\n\f12/5/2010\n\n1.0\n\n1.0\n\n0.8\n\n0.8\nH ierarc h y\n\nD eg ree-Cen trality Co rrelatio n\n\nS. Khor\n\n0.6\n0.4\n0.2\n\n0.6\n0.4\n0.2\n\n0.0\n\n0.0\n\n0\n\n200\n\n400\n\n600\n\n800\n\n1000 1200 1400 1600 1800\n\n0\n\n200\n\n400\n\n600\n\n800\n\n1000 1200 1400 1600 1800\n\nNodes\n\nNodes\n\nFigure 19 (Left) Pearson's correlation between node degree and centrality for GH64 PCNs.\n(Right) Gao's hierarchy index for GH64 PCNs.\nFurther, and as a possible consequence also, PCNs actually show declining hierarchical structure\nwith increases in protein size (Figure 19). Following Trusina et al (2004), hierarchical organization is\ngauged with the formulae in (Gao 2001) which defines a hierarchical path as one with that satisfies one\nof the following conditions: monotonically increasing then monotonically decreasing node degree,\nmonotonically increasing node degree, or monotonically decreasing node degree. A network where a\nhigh fraction of its shortest paths are also hierarchical paths will have a hierarchical index close to 1.0,\nsignaling pronounced hierarchical organization. However, declining average clustering levels with\nincreases in node degree has also been used to detect hierarchical organization (Ravasz et al 2002;\nRavasz and Barabasi 2003). Using this method, Aftabuddin and Kundu (2006) report evidence of\nhierarchical structure for their weighted PCN, which is similar to the Greene and Higman (2003) PCN.\nWe also observe hierarchical tendencies in the four randomly chosen GH64 PCNs (Figure B3).\nEvidently, there is some reconciliation to be performed between the two measures of hierarchy.\nSecond, there is evidence (depending on the scale used) of a positive correlation between node\ndegree and hydrophobicity (Alves and Martinez 2007; Aftabuddin and Kundu 2007) which implies that\nhub nodes in PCNs tend to be hydrophobic. Hydrophobic residues shun water molecules and generally\nlie in the core of a protein. As a result, these residues come into close proximity with many other\nresidues, and thus gain their hub status. The relationship(s) between hydrophobicity, high node degree,\nassortativity and average path length needs further study, keeping in mind that the relationship(s) may\ndiffer for transition versus native state proteins.\n\n12. Summary and Outlook\nOur main objective with this review paper is to integrate the many network characteristics of PCNs\nwhich have been reported in the literature, and to understand their respective roles and also the interplay\nbetween them. An attempt to apply the statistics to a network approach of protein folding was also\n\n30\n\n\fS. Khor\n\n12/5/2010\n\nmade. In addition, we considered the dynamic aspects of PCNs, i.e. how their network statistics change\nas a protein folds. Our model is woefully simple, but we hope it provides good hints for building better\nmodels and integrating the dynamic and static aspects of PCNs. One can easily imagine several ways to\nmodify the model by adding more constraints, e.g. restrict the set of LE_nodes to 0.6 N (section 5), use\nsome kind of preferential selection mechanism to fit to the link sequence distance distribution (section\n9) and node degree distribution (section 5). The model could also be extended to include link deletion\nand/or rewiring (Dokholyan et al 2002 observed changes in node degrees between post- and pretransition states). It may also be interesting to extend the approach in section 11 to investigate how the\ndynamics of PCNs couples with the conformational landscape (Scala et al 2001; Doye 2002; Kovacs et\nal 2005; Auer et al 2007). Studies show that it is not only important for a protein to arrive at its final\ndestination, a.k.a. its native state, but how it gets there, its journey or folding pathway(s), is also\nimportant (Chen et al 2008). In light of the exposition in this paper, a network approach may be the\nvehicle to address key aspects of the protein folding problem in an integrated way: the existence of a\nunique native structure, folding pathway(s) in conformation space to the native structure, protein folding\nrates, and information in an amino acid sequence to propel the attainment of all this.\nIn Table 2, we summarize the network structural statistics mentioned in this paper for PCNs in the\nGH64 and EVA132 data sets. We find a general agreement, both in qualitative and quantitative terms,\nbetween the observed network structural characteristics of these two data sets, and with those reported\nin literature. On this topic, there are of course other existing network characteristics and measurements,\nand other ways of constructing PCNs, that can and need to be explored. However it could also be useful\nto go further, and devise measures geared towards capturing the specific linkage patterns of PCNs.\n\nTable 2 Summary of quantitative values: mean ± standard deviation reported.\nSection Statistic\nGH64\nEVA132\n|LE|/M\n0.2929\n0.2611\n4\nFraction of links in LE (links with sequence distance > 9) ± 0.0834 ± 0.0986\nK\n7.9696\n7.9147\n5\nAverage node degree\n± 0.3126 ± 0.4300\n|SE_nodes|/N\n0.9970\n1.0000\n5\nFraction of nodes which are endpoints to links in SE\n± 0.0039 ± 0.0004\n|LE_nodes|/N\n0.6659\n0.6348\n5\nFraction of nodes which are endpoints to links in LE\n± 0.1093 ± 0.1367\n0.5484\n0.5538\n6\nClustering\n± 0.0233 ± 0.0292\n0.3387\n0.3457\n7\nAssortativity\n± 0.0536 ± 0.0743\n0.7874\n0.7068\n9.2\n(Maximum Link Sequence Distance) / N\n± 0.1402 ± 0.1860\n\n31\n\n\fS. Khor\n\n12/5/2010\n\nThroughout this paper, we have maintained a separation of short-range (SE) and long-range (LE)\nlinks. We did this to better understand their respective contributions to structural characteristics of\nPCNs. But ultimately, the prize is to predict the long-range links of PCNs to within a level of accuracy.\nNotwithstanding the physical, chemical and geometrical constraints, this is a challenging combinatorial\ntask. Even if we could identify LE_nodes accurately, the probability that a link chosen at random from\nthe set of all possible links with endpoints in LE_nodes is about 6/N (this includes links with sequence\ndistances less than 10 or some LE_TH). Hence a pure network model of protein folding, like the one we\nattempted in section 11, is unlikely to be a winner. A more likely model could be one that incorporates\nmultiple approaches.\nGiven the importance of short inter-node distances between residues (section 8), the sparseness of\nlong-range links in PCNs could appear paradoxical. However, our model does show that in general, it\nonly takes a few long-range links to reduce the average path length significantly, and to levels that is not\nimproved upon by further addition of long-range links (Figure 18). According to Ngo and Marks (1992),\nlong-range links (non-local interactions) actually increases the computational complexity of the protein\nfolding problem (see also Ngo et al 1994). Thus, if a few well-placed long-range links is sufficient to\nreduce the average path length to a good enough level, this \"least effort\" (albeit, it could have taken\nevolution quite some time to figure the optimal wirings) strategy may well be adopted by proteins as a\nway out of the paradox.\n\nReferences\nAftabuddin, Md., and Kundu, S. (2006) Weighted and Unweighted Network of Amino Acids within Protein.\nPhysica A 396(2), pp. 895-904.\nAftabuddin, Md., and Kundu, S. (2007) Hydrophobic, Hydrophilic and Charged Amino Acids' Network within\nProtein. Biophysical Journal 93(1), pp. 225-231.\nAlm, E., and Baker, D. (1999) Matching Theory and Experiment in Protein Folding. Curr. Opin. Struc. Biol. 9, pp.\n189-196.\nAlves, N.A., and Martinez, A. S. (2007) Inferring topological features of proteins from amino acid residue\nnetworks. Physica A 375, pp. 336-344.\nAnfinsen, C.B. (1973) Principles that Govern the Folding of Protein Chains. Science 181, pp. 223-230.\nAtilgan, A.R., Akan, P., and Baysal, C. (2004) Small-world Communication of Residues and Significance for\nProtein Dynamics. Biophysics Journal 86, pp. 85-91.\nAuer, S., Miller, M.A., Krivov, S.V., Dobson, C.M., Karplus, M. and Vendruscolo, M. (2007) Importance of\nMetastable States in the Free Energy Landscapes of Polypeptide Chains. Physical Review Letters 99, 178104.\nBagler, G., and Sinha, S. (2005) Network Properties of Protein Structures. Physica A: Statistics Mechanics and its\nApps. 346(1-2), pp. 27-33.\nBagler, G., and Sinha, S. (2007) Assortative Mixing in Protein Contact Networks and Protein Folding Kinetics.\nStructural Bioinformatics 23(14), pp. 1760-1767.\nBartoli, L., Fariselli, P., and Casadio, R. (2007) The Effect of Backbone on the Small-world Properties of Protein\nContact Networks. Physical Biology 4, pp. L1-L5.\nBerman, H.M., Westbrook, J., Feng, Z., Gilliland, G., Bhat, T.N., Weissig, H., Shindyalov, I.N., and Bourne, P.E.\n(2000) The Protein Data Bank. Nucleic Acids Research 28, pp. 235-242. http://www.rcsb.org/pdb\nBrede, M., and Sinha S. (2005) Assortative Mixing by Degree Makes a Network More Unstable. arXiv:condmat/0507710v1\n\n32\n\n\fS. Khor\n\n12/5/2010\n\nChen, Y., Ding, F., Nie, H., Serohijos, A.W., Sharma, S., Wilcox, K.C., Yin, S., and Dokholyan, N.V. (2008)\nProtein Folding: Then and Now. Archives of Biochemistry and Biophysics 469, pp. 4 -19.\nDel Sol, A., Fujihashi, H., Amoros, D., and Nussinov, R. (2006) Residues Crucial for Maintaining Short Paths in\nNetwork Communication Mediate Signaling in Proteins. Molecular Systems Biology 2.\nDokholyan, N.V., Li, L., Ding, F., and Shakhnovich, E.I. (2002) Topological Determinants of Protein Folding.\nPNAS 99(13), pp. 8637-8641.\nDoye, J.P.K. (2002) The Network Topology of a Potential Energy Landscape: A Static Scale-Free Network.\nPhysical Review Letters 88, 238701.\nGaci, O., and Balev, S. (2009) Node Degree Distribution in Amino Acid Interaction Networks. In: Proc.\nComputational Structural Bioinformatics Workshop, Washington D.C. USA.\nGao, L (2001) On inferring autonomous system relationships in the Internet. IEEE/ACM Transactions on\nNetworking 9: 733-745.\nGō, N. (1983) Theoretical Studies of Protein Folding. Ann. Rev. Biophys. Bioeng. 12, pp. 183-210.\nGreene, L.H., and Higman, V.A. (2003) Uncovering Network Systems within Protein Structures. Journal of\nMolecular Biology 334, pp. 781-791.\nKabsch, W., and Sander, C. (1983) Dictionary of Protein Secondary Structure: Pattern Recognition of Hydrogenbonded and Geometrical Features. Biopolymers 22(12), pp. 2577-2637. http://swift/cmbi.ru.nl/gv/dssp\nKarplus, M. (1997) The Levinthal Paradox: Yesterday and Today. Folding & Design 2, pp. S69-S75.\nKleinberg, J. (2000) Navigation in a Small World. Nature 406, 845\nKovacs, I.A., Szalay, M.S. and Csermely, P. (2005) Water and Molecular Chaperones Act as Weak Links of\nProtein Folding Networks: Energy Landscape and Punctuated Equilibrium Changes Point towards a Game\nTheory of Proteins. FEBS Letters 579(11), pp. 2254-2260.\nLevinthal, C. (1969) How to Fold Graciously. In: Debrunner, J.T.P., and Munck, E. (eds.) Mossbauer\nSpectroscopy in Biological Systems: Proceedings of a Meeting held at Allerton House. Monticello, Illinois.\nUniversity of Illinois Press, pp. 22-24.\nMaslov, S., and Sneppen, K. (2002) Specificity and Stability in Topology of Protein Networks. Science 296 pp.\n910-913.\nMurzin, A.G., Brenner, S.E., Hubbard, T., and Chothia, C. (1995) SCOP: A Structural Classification of Proteins\nDatabase for the Investigation of Sequences and Structures. J. Mol. Biol. 247, pp. 536-540. http://scop.mrclmb.cam.ac.uk/scop\nNewman, M.E.J. (2002) Assortative Mixing in Networks. Physical Review Letters 89, 208701.\nNewman, M.E.J. (2003) The Structure and Function of Complex Networks. SIAM Review 45, pp. 167-256.\nNgo, J.T. and Marks, J. (1992) Computational Complexity of a Problem in Molecular-Structure Prediction.\nProtein Engineering 5(4), pp.313-321.\nNgo, J.T., Marks, J., and Karplus, M. (1994) Computational Complexity, Protein Structure Prediction and the\nLevinthal Paradox. In: Merz K. Jr. and Le Grand, S. (eds.) The Protein Folding Problem and Tertiary\nStructure Prediction, pp. 435 – 508, Birkhauser, Boston MA.\nPastor-Satorras, R., Vazquez, A., and Vespignani, A. (2001) Dynamical and Correlation Properties of the Internet.\nPhysical Review Letters 87, 258701-1-4.\nRavasz, E., Somera, A.L., Mongru, D.A., Oltvai, Z.N. and Barabasi, A.-L. (2002) Hierarchical Organization of\nModularity in Metabolic Networks. Science 297, pp. 1551-1555.\nRavasz, E., and Barabasi, A.-L. (2003) Hierarchical Organization In Complex Networks. Physical Review E 67,\n026112.\nRost, B. (1999) Twilight Zone of Protein Sequence Alignments. Protein Engineering 12(2), pp. 85-94.\nhttp://cubic.bioc.columbia.edu/ava/res/unique_list.html (Sep 23 2010).\nScala, A., Amaral, L.A.N., and Barthélémy, M. (2001) Small-world Networks and the Conformation Space of a\nLattice Polymer Chain. Europhysics Letters 55(4), 594\nTanaka, S. and Scheraga, H.A. (1977) Model of Protein Folding: Incorporation of a one-dimensional short-range\n(Ising) model into a three-dimensional model. Proc. Natl. Acad. Sci. USA 74(4), pp. 1320-1323.\nTaverna, D.M. and Goldstein, R.A. (2002) Why are Proteins Marginally Stable. Proteins 46, pp. 105-109.\nTramontano, A. (2006) Protein Structure Prediction:Concepts and Applications. Wiley-VCH Verlag GmbH &Co.\nTrusina, A., Maslov, S., Minnhagen, P., and K. Sneppen. (2004) Hierarchy measures in complex networks.\nPhysical Review Letters 92, 178702.\nVazquez, A., and Moreno, Y. (2003) Resilience to damage of graphs with degree correlation. Physical Review E\n\n33\n\n\fS. Khor\n\n12/5/2010\n\n67, 015101-1-4(R).\nVendruscolo, M., Dokholyan, N.V., Paci, E., and Karplus, M. (2002) Small-world View of the Amino Acids that\nPlay a Key Role in Protein Folding. Physical Review E 65, 061910-1-4.\nWatts, D.J., and Strogatz, S.H. (1998) Collective Dynamics of 'small-world' Networks. Nature 393, pp. 440-442.\nWatts, D.J. (1999) Small Worlds: The Dynamics of Networks between Order and Randomness. Princeton\nUniversity Press, Princeton, NJ.\nZwanzig, R., Szabo A., and Bagchi, B. (1992) Levinthal's Paradox. Proc. Natl. Acad. Sci. USA 89, pp. 20-22.\n\nAppendix A. The EVA132 Protein Dataset\nThe EVA132 protein dataset was extracted from the list of 3477 unique chains archived by EVA\n(Rost, 1999). 200 proteins were selected at random from this list, with no overlap with GH64. PCNs for\nthe proteins in EVA132 were constructed and selected in the manner as described in sections 2 and 3,\nproducing 132 valid PCNs (listed in Table A1) for us to work with.\n\nTable A1. PID of proteins in the EVA132 dataset\n\n7000\n6000\n5000\n4000\n3000\n2000\n1000\n0\n1dfe\n1ctf\n1apc\n1AX8\n1iko\n1grj\n1awp\n1ylx\n1mfq\n1o9g\n1sml\n1e8o\n2aql\n1btk\n1hh2\n1a59\n1h3e\n1bkj\n1fgg\n1rhz\n1adu\n1e3h\n2fmt\n1a5k\n1aoi\n1upt\n1ee4\n2bpt\n1eo8\n1e6e\n1knz\n1m3\n1h6d\n\nNumber of Residues (Nodes)\n\n1dfe, 1bi6, 1a7i, 2ezh, 1ctf, 1cfw, 1tif, 1gh5, 1apc, 1cto, 1by2, 1d0d, 1AX8, 1gak, 1jgs, 1j74, 1iko, 2a1j,\n1ECY, 1af3, 1grj, 1f8a, 1lf7, 1faj, 1awp, 1qhn, 1r5p, 1CZ4, 1ylx, 1j77, 1bwp, 1lkv, 1mfq, 1jfx, 1hek,\n1gy5, 1o9g, 1e7k, 1F9Z, 1awc, 1sml, 1boo, 1tfr, 1ltq, 1e8o, 1pvl, 1bob, 1sbp, 2aql, 1xiz,\n1pnf, 1fkm, 1btk, 1c28, 1nrj, 1e6c, 1hh2, 1dpt, 1g2q, 1a1r, 1a59, 1f45, 1i5e, 1esg, 1h3e, 1wdu, 1i85,\n1gk4, 1bkj, 1dj8, 1oft, 1jzt, 1fgg, 1rh5, 1sw6, 1bfd, 1rhz, 1b44, 1g7r, 1aui, 1adu, 1h7z, 1zrl, 1dhp, 1e3h,\n1ojh, 1bp7, 1kke, 2fmt, 1K3I, 1bwd, 1d8d, 1a5k, 1bih, 1bev, 1fp3, 1aoi, 1tmf, 1l1o, 1KQ4,\n1upt, 1h4l, 1ngw, 1b4u, 1ee4, 1a2z, 1eqz, 1jct, 2bpt, 1e8t, 1zhq, 1ewt, 1eo8, 1eum, 1g2c, 1fp7, 1e6e,\n1l8w, 1ndb, 1g8m, 1knz, 1gg1, 1b37, 1bcp, 1m32, 1fz6, 1jb0, 1hqm, 1h6d, 1S5L, 1mjg, 1M34\n\nEVA132 Proteins\n\nFigure A1 Size of EVA132 PCNs in terms of the number of Cα atoms documented their PDB files.\n\n34\n\n\fS. Khor\n\n12/5/2010\n30000\nPCN Links (< 7A)\n\n25000\nCount\n\n20000\n15000\n10000\n5000\n0\n0\n\n1000\n\n2000\n\n3000\n\n4000\n\n5000\n\n6000\n\n7000\n\nNodes\n\nLink Density\n\nFigure A2 Link count M, by protein size for EVA132 proteins.\n0.20\n0.18\n0.16\n0.14\n0.12\n0.10\n0.08\n0.06\n0.04\n0.02\n0.00\n\nPCN Links (< 7A)\n\n0\n\n1000\n\n2000\n\n3000\n\n4000\n\n5000\n\n6000\n\nNodes\n\nFigure A3 Link density by protein size for EVA132 proteins.\n\nLink Count\n\n20000\n18000\n\nSE\n\n16000\n\nLE\n\n14000\n12000\n10000\n8000\n6000\n4000\n2000\n0\n0\n\n800\n\n1600\n\n2400\n\n3200\n\n4000\n\n4800\n\n5600\n\n6400\n\nNodes\n\nFigure A4a Number of short-range (SE) and long-range (LE) links, by protein size for EVA132.\nThe fraction of links in LE is 0.2611 ± 0.0986. The fraction of links in SE is 0.7389 ± 0.0986.\n\n35\n\n\fS. Khor\n\n12/5/2010\n6400\nSE\n\n5600\n\nLE\n\nNode Count\n\n4800\n4000\n3200\n2400\n1600\n800\n0\n0\n\n800\n\n1600\n\n2400\n\n3200\n\n4000\n\n4800\n\n5600\n\n6400\n\nNodes\n\nFigure A4b Number of nodes which are endpoints for links in SE (SE_nodes) and nodes which are\nendpoint for links in LE (LE_nodes), by protein size for EVA132. The fraction of nodes in\nLE_nodes is 0.6348 ± 0.1367.The fraction of nodes in SE_nodes is 1.0000 ± 0.0004.\nSE_nodes\nSE_ and LE_nodes\n\nProportion of all nodes\n\n1.2\n\nLE_nodes\nNot in LE_nodes\n\n1.0\n0.8\n0.6\n0.4\n0.2\n0.0\n0\n\n800\n\n1600\n\n2400\n\n3200\n\n4000\n\n4800\n\n5600\n\n6400\n\nNodes\n\nFigure A4c Sizes of different subsets of nodes as a proportion of all nodes for EVA132 PCNs.\nOn average, 0.6347 ± 0.1367 of all nodes are in both SE_nodes and LE_nodes, while 0.3652 ±\n0.1367 of all nodes are not in LE_nodes.\n\n36\n\n\fS. Khor\n\n12/5/2010\n18\n16\n\nNode Degree\n\n14\n12\n\nmax\n\n10\n\nmid\n\n8\n\nmean\n\n6\n\nstd.dev.\n\n4\n\nmin\n\n2\n0\n0\n\n800\n\n1600\n\n2400\n\n3200\n\n4000\n\n4800\n\n5600\n\n6400\n\nNodes\n\nFigure A5a Node degree summary statistics for EVA132 PCNs.\nMean node degree average at 7.9147 with a std. dev. of 0.4300.\n0.30\nProbability, P(k)\n\n0.25\n1sw6\n\n0.20\n\n1fp3\n\n0.15\n\n1m32\n\n0.10\n\n1S5L\n\n0.05\n0.00\n0\n\n2\n\n4\n\n6\n\n8\n\n10\n\n12\n\n14\n\n16\n\nDegree, k\n\nFigure A5b Node degree distributions for four PCNs in the EVA132 dataset. The respective PCNs\nof 1sw6, 1fp3, 1m32 and 1S5L has 508, 804, 2103 and 5130 nodes respectively.\n\nClustering Coefficient\n\n1.0\n0.8\n0.6\n0.4\n0.2\n\n1dfe\n1ctf\n1apc\n1AX8\n1iko\n1grj\n1awp\n1ylx\n1mfq\n1o9g\n1sml\n1e8o\n2aql\n1btk\n1hh2\n1a59\n1h3e\n1bkj\n1fgg\n1rhz\n1adu\n1e3h\n2fmt\n1a5k\n1aoi\n1upt\n1ee4\n2bpt\n1eo8\n1e6e\n1knz\n1m3\n1h6d\n\n0.0\n\nEVA132 Proteins\n\nFigure A6 Clustering coefficients ± standard deviation. Mean is 0.5538 with a std. dev. of 0.0292.\n\n37\n\n\fS. Khor\n\n12/5/2010\n0.8\n\nAssortativity\n\n0.6\n\n0.4\n\n0.2\n\n1dfe\n1ctf\n1apc\n1AX8\n1iko\n1grj\n1awp\n1ylx\n1mfq\n1o9g\n1sml\n1e8o\n2aql\n1btk\n1hh2\n1a59\n1h3e\n1bkj\n1fgg\n1rhz\n1adu\n1e3h\n2fmt\n1a5k\n1aoi\n1upt\n1ee4\n2bpt\n1eo8\n1e6e\n1knz\n1m3\n1h6d\n\n0.0\n\nEVA132 Proteins\n\nFigure A7 Assortativity values. Mean is 0.3457 with a std. dev. of 0.0743.\n\nLink Sequence Distance\n\n300\nAvg.\n250\n\nStd. dev.\nMedian\n\n200\n150\n100\n50\n0\n0\n\n800\n\n1600\n\n2400\n\n3200\n\n4000\n\n4800\n\n5600\n\n6400\n\n4000\n\n4800\n\n5600\n\n6400\n\nNodes\nLink Sequence Distance\n\n4800\nMax\n\n4000\n3200\n2400\n1600\n800\n0\n0\n\n800\n\n1600\n\n2400\n\n3200\nNodes\n\nFigure A8 Link sequence distance summary statistics for EVA132 PCNs indicate right skewed\ndistributions for link sequence distance.\n\n38\n\n\fS. Khor\n\n12/5/2010\n\nAppendix B\nAdditional material for Figure 19 (section 11).\n\nFigure B1 Degree-node\ncentrality scatter plots\nfor four GH64 PCNs.\nCorrelation\ncoefficients\nare given in the table\nbelow. Both methods\nshow weakening positive\ncorrelation with increase\nin N. We did not report\nSpearman's rho values as\ntheir significance could\nnot be computed due to\nties.\n\nCorrelation method 1aep\n1agd\n1psd\n1CVJ\nPearson\n0.6691 0.3112 0.3010 0.1222\nKendall's tau\n0.5689 0.4661 0.4114 0.3616\nAll correlation coefficients are significant at the 95% confidence level.\n0.10\n\nAverage Node Centrality\n\n0.08\n0.06\n1aep\n0.04\n\n1agd\n1psd\n\n0.02\n\n1CVJ\n0.00\n0\n\n2\n\n4\n\n6\n\n8\n\n10\n\n12\n\n14\n\n16\n\n-0.02\n-0.04\nDegree\n\nFigure B2 Node centrality for nodes with degree k are averaged and reported with their standard\ndeviations. The relationship is marginally positive and grows weaker with increase in protein size.\nThe large standard deviations point to wide dispersion in node centrality values, as seen in the\nscatter plots in Figure B1.\n\n39\n\n\fS. Khor\n\n12/5/2010\n\nAverage Clustering Coefficient\n\n1.2\n1.0\n0.8\n\n1aep\n1agd\n\n0.6\n\n1psd\n1CVJ\n\n0.4\n0.2\n0.0\n0\n\n2\n\n4\n\n6\n\n8\n10\nDegree\n\n12\n\n14\n\n16\n\nFigure B3 Some evidence of hierarchical organization in PCNs.\n\n40\n\n\f"}