{"id": "http://arxiv.org/abs/1104.5650v1", "guidislink": true, "updated": "2011-04-29T15:06:54Z", "updated_parsed": [2011, 4, 29, 15, 6, 54, 4, 119, 0], "published": "2011-04-29T15:06:54Z", "published_parsed": [2011, 4, 29, 15, 6, 54, 4, 119, 0], "title": "Sky localization of complete inspiral-merger-ringdown signals for\n  nonspinning massive black hole binaries", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1104.0900%2C1104.3722%2C1104.2695%2C1104.2869%2C1104.4140%2C1104.3636%2C1104.0343%2C1104.0189%2C1104.5005%2C1104.1285%2C1104.0286%2C1104.0721%2C1104.0215%2C1104.5069%2C1104.0441%2C1104.3607%2C1104.4230%2C1104.5274%2C1104.1327%2C1104.4845%2C1104.3877%2C1104.3130%2C1104.3111%2C1104.0291%2C1104.4068%2C1104.0554%2C1104.3991%2C1104.3173%2C1104.1982%2C1104.3426%2C1104.5650%2C1104.5511%2C1104.1626%2C1104.4371%2C1104.3602%2C1104.1178%2C1104.1324%2C1104.5627%2C1104.4016%2C1104.2121%2C1104.4715%2C1104.1849%2C1104.4899%2C1104.2489%2C1104.1896%2C1104.2139%2C1104.5395%2C1104.0650%2C1104.3941%2C1104.0080%2C1104.0987%2C1104.5536%2C1104.0833%2C1104.2992%2C1104.4307%2C1104.1402%2C1104.2837%2C1104.3725%2C1104.4916%2C1104.4071%2C1104.3999%2C1104.2161%2C1104.0168%2C1104.1218%2C1104.2966%2C1104.5055%2C1104.1216%2C1104.2852%2C1104.2435%2C1104.5559%2C1104.0111%2C1104.1902%2C1104.0311%2C1104.1600%2C1104.5670%2C1104.3760%2C1104.4359%2C1104.5350%2C1104.3528%2C1104.3980%2C1104.2253%2C1104.1196%2C1104.3464%2C1104.1114%2C1104.0321%2C1104.2278%2C1104.4304%2C1104.4385%2C1104.5464%2C1104.0950%2C1104.2143%2C1104.1415%2C1104.1206%2C1104.1900%2C1104.2576%2C1104.0442%2C1104.4786%2C1104.3423%2C1104.0610%2C1104.5489%2C1104.2770&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Sky localization of complete inspiral-merger-ringdown signals for\n  nonspinning massive black hole binaries"}, "summary": "We investigate the capability of LISA to measure the sky position of\nequal-mass, nonspinning black hole binaries, combining for the first time the\nentire inspiral-merger-ringdown signal, the effect of the LISA orbits, and the\ncomplete three-channel LISA response. We consider an ensemble of systems near\nthe peak of LISA's sensitivity band, with total rest mass of 2\\times10^6\nM\\odot, a redshift of z = 1, and randomly chosen orientations and sky\npositions. We find median sky localization errors of approximately \\sim3\narcminutes. This is comparable to the field of view of powerful electromagnetic\ntelescopes, such as the James Webb Space Telescope, that could be used to\nsearch for electromagnetic signals associated with merging massive black holes.\nWe investigate the way in which parameter errors decrease with measurement\ntime, focusing specifically on the additional information provided during the\nmerger-ringdown segment of the signal. We find that this information improves\nall parameter estimates directly, rather than through diminishing correlations\nwith any subset of well- determined parameters. Although we have employed the\nbaseline LISA design for this study, many of our conclusions regarding the\ninformation provided by mergers will be applicable to alternative mission\ndesigns as well.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1104.0900%2C1104.3722%2C1104.2695%2C1104.2869%2C1104.4140%2C1104.3636%2C1104.0343%2C1104.0189%2C1104.5005%2C1104.1285%2C1104.0286%2C1104.0721%2C1104.0215%2C1104.5069%2C1104.0441%2C1104.3607%2C1104.4230%2C1104.5274%2C1104.1327%2C1104.4845%2C1104.3877%2C1104.3130%2C1104.3111%2C1104.0291%2C1104.4068%2C1104.0554%2C1104.3991%2C1104.3173%2C1104.1982%2C1104.3426%2C1104.5650%2C1104.5511%2C1104.1626%2C1104.4371%2C1104.3602%2C1104.1178%2C1104.1324%2C1104.5627%2C1104.4016%2C1104.2121%2C1104.4715%2C1104.1849%2C1104.4899%2C1104.2489%2C1104.1896%2C1104.2139%2C1104.5395%2C1104.0650%2C1104.3941%2C1104.0080%2C1104.0987%2C1104.5536%2C1104.0833%2C1104.2992%2C1104.4307%2C1104.1402%2C1104.2837%2C1104.3725%2C1104.4916%2C1104.4071%2C1104.3999%2C1104.2161%2C1104.0168%2C1104.1218%2C1104.2966%2C1104.5055%2C1104.1216%2C1104.2852%2C1104.2435%2C1104.5559%2C1104.0111%2C1104.1902%2C1104.0311%2C1104.1600%2C1104.5670%2C1104.3760%2C1104.4359%2C1104.5350%2C1104.3528%2C1104.3980%2C1104.2253%2C1104.1196%2C1104.3464%2C1104.1114%2C1104.0321%2C1104.2278%2C1104.4304%2C1104.4385%2C1104.5464%2C1104.0950%2C1104.2143%2C1104.1415%2C1104.1206%2C1104.1900%2C1104.2576%2C1104.0442%2C1104.4786%2C1104.3423%2C1104.0610%2C1104.5489%2C1104.2770&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We investigate the capability of LISA to measure the sky position of\nequal-mass, nonspinning black hole binaries, combining for the first time the\nentire inspiral-merger-ringdown signal, the effect of the LISA orbits, and the\ncomplete three-channel LISA response. We consider an ensemble of systems near\nthe peak of LISA's sensitivity band, with total rest mass of 2\\times10^6\nM\\odot, a redshift of z = 1, and randomly chosen orientations and sky\npositions. We find median sky localization errors of approximately \\sim3\narcminutes. This is comparable to the field of view of powerful electromagnetic\ntelescopes, such as the James Webb Space Telescope, that could be used to\nsearch for electromagnetic signals associated with merging massive black holes.\nWe investigate the way in which parameter errors decrease with measurement\ntime, focusing specifically on the additional information provided during the\nmerger-ringdown segment of the signal. We find that this information improves\nall parameter estimates directly, rather than through diminishing correlations\nwith any subset of well- determined parameters. Although we have employed the\nbaseline LISA design for this study, many of our conclusions regarding the\ninformation provided by mergers will be applicable to alternative mission\ndesigns as well."}, "authors": ["Sean T. McWilliams", "Ryan N. Lang", "John G. Baker", "James Ira Thorpe"], "author_detail": {"name": "James Ira Thorpe"}, "author": "James Ira Thorpe", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevD.84.064003", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1104.5650v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1104.5650v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "9 pages, 5 figures, submitted to Phys. Rev. D", "arxiv_primary_category": {"term": "gr-qc", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "gr-qc", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "astro-ph.HE", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1104.5650v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1104.5650v1", "journal_reference": null, "doi": "10.1103/PhysRevD.84.064003", "fulltext": "Sky localization of complete inspiral-merger-ringdown signals for nonspinning massive\nblack hole binaries\nSean T. McWilliams,1, 2, 3, ∗ Ryan N. Lang,1 John G. Baker,1 and James Ira Thorpe1\n\narXiv:1104.5650v1 [gr-qc] 29 Apr 2011\n\n1\n\nGravitational Astrophysics Laboratory, NASA Goddard Space Flight Center, 8800 Greenbelt Rd., Greenbelt, MD 20771, USA\n2\nInstitute for Strings, Cosmology and Astroparticle Physics (ISCAP),\nColumbia University, New York, NY 10027, USA\n3\nPhysics Department, Princeton University, Princeton, NJ 08544, USA\n(Dated: November 4, 2018)\nWe investigate the capability of LISA to measure the sky position of equal-mass, nonspinning\nblack hole binaries, combining for the first time the entire inspiral-merger-ringdown signal, the\neffect of the LISA orbits, and the complete three-channel LISA response. We consider an ensemble\nof systems near the peak of LISA's sensitivity band, with total rest mass of 2 × 106 M⊙ , a redshift of\nz = 1, and randomly chosen orientations and sky positions. We find median sky localization errors\nof approximately ∼ 3 arcminutes. This is comparable to the field of view of powerful electromagnetic\ntelescopes, such as the James Webb Space Telescope, that could be used to search for electromagnetic\nsignals associated with merging massive black holes. We investigate the way in which parameter\nerrors decrease with measurement time, focusing specifically on the additional information provided\nduring the merger-ringdown segment of the signal. We find that this information improves all\nparameter estimates directly, rather than through diminishing correlations with any subset of welldetermined parameters. Although we have employed the baseline LISA design for this study, many\nof our conclusions regarding the information provided by mergers will be applicable to alternative\nmission designs as well.\nPACS numbers: 04.25.D-, 04.70.Bw, 04.80.Nn, 95.30.Sf, 95.55.Ym, 97.60.Lf\n\nI.\n\nINTRODUCTION\n\nAmong the gravitational-wave (GW) sources which the\nproposed Laser Interferometer Space Antenna (LISA)\nwould observe, massive black hole binaries (MBHBs)\nstand out in several ways. They have the highest typical\nsignal-to-noise ratios (SNRs) and will be observable out\nto redshifts of z ∼ 10 or greater [1–3], making MBHBs\nthe most distant sources that LISA will observe. Observations of MBHBs figure prominently in LISA's science\ngoals [4] and may provide particularly rich opportunities\nfor multi-messenger observation in conjunction with electromagnetic instruments. The potential for such observations depends particularly on LISA's ability to localize\nthe gravitational-wave sources on the sky and thereby\nfacilitate simultaneous or follow-up electromagnetic observation [5].\nLISA is an all-sky instrument in the sense that, at any\none instant, it is sensitive to sources at most points on\nthe sky. While this is advantageous from the perspective of detection of unknown sources, it is not helpful\nfor locating these sources on the sky. To build localization information, LISA takes advantage of the fact that\nMBHBs are observable for months or even years prior to\nmerger. During this time, LISA's orbit around the Sun\nintroduces both frequency and amplitude modulations to\nthe signal that can be used to determine source location\n[6]. The majority of studies of LISA's source location\n\n∗ Electronic\n\naddress: sean@astro.columbia.edu\n\nabilities [6–15] focus on this mechanism and neglect the\nfinal merger-ringdown portion of the MBHB waveform,\nwhich is difficult to model and too brief to experience any\nmodulation from LISA's orbit.\nRecent work [16, 17] has shown that the mergerringdown portion of the MBHB signal, which is shortlived but has more power and occurs at higherfrequencies, can achieve sky localization comparable to\nthe long inspiral portion without any additional information from LISA's orbital modulation. The mechanism\nfor extracting this information is believed to be related\nto the complex response of LISA to gravitational waves\nat the upper end of the measurement band (above ∼ 3\nmHz, where finite arm length effects begin to become important [18]). In this paper, we investigate the combined\neffect of both localization mechanisms. Specifically, we\nexpand our previous analysis to include the full inspiral\nsignal, including orbital effects. We also include a third\nsignal channel, T̄ , relevant only at higher frequencies,\nwhich was excluded from the earlier analysis for technical reasons.\nThe outline of the paper is as follows: In Section II,\nwe review our methodology, which closely follows [17].\nSection II A describes the construction of the inspiralmerger-ringdown (IMR) waveform using the \"IRS-EOB\"\nmodel [19]. Section II B describes our model for the LISA\ninstrument, including the response function and noise.\nFinally, Section II C explains how we calculate parameter\nerrors using the standard Fisher matrix formalism.\nIn Section III, we examine LISA's ability to localize\nsources, including the improvements that are gained as\ndifferent levels of realism are added. We find that for an\n\n\f2\nensemble of systems with total rest mass of 2 × 106 M⊙\nat a redshift of z = 1, observing the IMR signal with\na stationary detector (and therefore without the benefit\nof orbital modulation) provides better sky localization\nthan observing the inspiral signal with an orbiting detector. We then consider the observation of a complete IMR\nsignal with an orbiting detector and find the final error\nto be only a modest improvement over the IMR signalstationary detector result. Measuring the long-duration\ninspiral is essentially irrelevant to achieving LISA's localization potential. Nevertheless, the orbital information contained in the inspiral is still important for localizing signals in advance of merger, which may be critical for conducting counterpart searches. We find, in\nagreement with previous results, that LISA can localize most MBHBs to within the Large Synoptic Survey\nTelescope (LSST) field of view (FOV) several months\nbefore merger. With the complete IMR signal, ∼ 50%\nof MBHBs in our ensemble can be localized into the\nmuch smaller FOV of the James Webb Space Telescope\n(JWST). This is possible mainly because of the extra\ninformation provided by the T̄ channel.\nIn Section IV, we demonstrate that the mergerringdown (MR) portion of the waveform provides additional information beyond the inspiral for all parameters.\nWe summarize and conclude in Section V, focusing on\nhow our results may impact alternative designs for LISA.\n\nII.\n\nMETHODOLOGY\n\nThe procedure used to estimate the errors with which\nLISA will measure astrophysical source parameters of\nMBHBs closely follows that of our previous studies\n[16, 17]. We will provide a brief overview; those interested in more detail should consult [17]. To assess parameter accuracy, we require a model for the emitted\nwaveform, a model for the detector response and noise,\nand a method for converting these pieces of information\ninto a theoretical limit on the achievable accuracy in measuring parameters with LISA.\n\nA.\n\nWaveform Model\n\nWe use a complete IMR waveform model [19] tuned to\nmatch the available numerical simulations for nonspinning black hole binaries. This model, referred to as the\nIRS-EOB model, uses a conventional effective-one-body\n(EOB) Hamiltonian formalism to model the adiabatic inspiral [20]. The merger-ringdown is modeled using the\n\"implicit rotating source\" (IRS) formalism, which treats\nthe radiation source as a shrinking rigid rotator [19].\nThe waveform amplitude is calculated using a flux\nmodel that is constrained both to be consistent with the\ninspiral flux through 3.5 post-Newtonian (PN) order and\nalso to vanish as it approaches the ringdown frequency\n(referred to as \"Model 2\" and given by Eq. 19 in [19]).\n\nThe waveform phase is fit to a physically motivated functional form (see Eq. 9 in [19]).\nWorking in geometrized units where G = c = M =\nm1 + m2 = 1, the source model depends only on the\nmass ratio q ≡ m1 /m2 (where m1 < m2 ) and the spins.\nWe generate a waveform time series using the IRS-EOB\nmodel with a signal cadence corresponding to a quarter\nwavelength at the highest frequency reached by the l = 4,\n+ 4 harmonics1 . After the source calculation, we\nm = −\ntransform the waveform from the source coordinates to\nthe solar system barycenter (SSB). The SSB waveform\nhB is given by:\n\"\n\u0012\n\u0013#\nX\nGM\ntc − t\n2iψ\n−2\nhB = 2\n, (1)\ne\nYlm (ι, φo ) hlm\nc DL\nM\nlm\n\nwhere −2 Ylm are the spherical harmonics of spin-weight\n−2 [21] and hlm is the dimensionless strain decomposed\nin that basis in the source frame. This transformation\ndepends on six parameters: the redshifted total system\nmass M = Mo (1 + z), the luminosity distance DL , the\ncoalescence time tc , and three angles describing the orientation of the binary. The coalescence time, tc , is defined\nas the time at which the peak of the waveform reaches\nthe solar system barycenter. For the angles, we use the\ninclination ι (with the convention that ι = 0 corresponds\nto the line of sight being coincident with the orbital axis\nof the binary), initial orbital phase φo , and polarization\nphase ψ.\nWe focus on a specific case that has appeared elsewhere\nin the literature (e. g. [7, 8]): an equal-mass, nonspinning\nMBHB with rest mass Mo = 2 × 106 M⊙ at z = 1,\nobserved for the final year prior to merger. This mass is\ninteresting because it lies near the most sensitive range\nof the LISA instrument [3], merger-tree models predict\nLISA will observe a significant number of events in this\nrange [22], and excellent observational evidence exists for\nblack holes of this size [23–25].\nThe sky location of the binary, described by the ecliptic\nlatitude β and longitude λ, is applied by the instrument\nresponse, which we discuss below. We use the vector\nΛa ≡ (ln M, ln DL , β, λ, ι, φo , ψ, tc ) to denote the complete set of variable parameters. We exclude the mass\nratio q from Λa , as it is not varied when computing parameter uncertainties, a procedure consistent with that\nused in [16, 17, 26].\n\nB.\n\nInstrument Model\n\nThe instrument model includes the transformation of\nthe SSB waveform hB to the LISA instrument outputs as\nwell as a model of the instrument noise. The instrument\n\n1\n\nWe oversample to accommodate interpolation when applying the\nresponse.\n\n\f3\noutputs are the {Ā, Ē, T̄ } TDI combinations described in\n[17] and based on the orthogonal {A, E, T } combination\n[27]. The response is computed by employing Synthetic\nLISA [28] to generate the {X, Y , Z} TDI combinations\n[29] and then converting to {Ā, Ē, T̄ } using\nZ −X\n√ ,\n2 2\nX +Z −2Y\n√\n,\nĒ =\n2 6\nX +Y +Z\n√\n.\nT̄ =\n2 3\n\nWe use an analytic model of the noise in the {Ā, Ē, T̄ }\nTDI channels, obtained following the procedure in [30].\nThe expressions for the one-sided spectral densities are\n\nĀ =\n\n(2)\n\nSĀ,Ē = 2 sin2 (Φ) [2 (3 + 2 cos(Φ) + cos(2 Φ)) Spm + (2 + cos(Φ)) Sop ] ,\n\u0002\n\u0003\nST̄ = 8 sin2 (Φ) sin2 (Φ/2) 4 sin2 (Φ/2)Spm + Sop ,\nwhere Φ ≡ 2πf L/c, f is the frequency, L is the arm\nlength, and Spm and Sop are the one-sided spectral densities of the proof-mass acceleration and optical pathlength noises,\n\u0012\n\u0012\n\u0013−2 s\n\u0013−2\nf\nf\n−48\n1+\nSpm = 2.5 × 10\n,\n1 Hz\n0.1 mHz\n\u00132\n\u0012\nf\n.\n(4)\nSop = 1.8 × 10−37\n1 Hz\nIn our prior studies [16, 17], we neglected the T̄ channel due to inconsistencies that were observed between the\nanalytic noise model for ST̄ in (3) and the noise spectrum\nobtained from a time-domain simulation of ST̄ performed\nwith Synthetic LISA. We have now verified that the\ntwo models are consistent for f ≥ 0.5 mHz. Where noted,\nwe include contributions from the T̄ channel at these frequencies. We expect this to be a reasonably accurate approach since the response of the T̄ channel should vanish\nat low frequencies.\nFor the foreground of gravitational waves from unresolved compact binaries, we use the model developed in\n[31], by adding\nSgal = [4Φ sin(Φ)]2 Sconf\n\n(5)\n\nto the expressions for SĀ,Ē . Sconf is a signal confusion\nnoise estimate for a related measurement variable, taken\nfrom Eq. 14 of [31]. No gravitational-wave foreground is\nadded to the T̄ channel since Sconf ≪ ST̄ at the frequencies where T̄ is included.\nC.\n\nError estimation\n\nTo approximate the achievable measurement accuracy\nfor LISA, we apply the Fisher matrix formalism. While\n\n(3)\n\nnot as robust or informative as more sophisticated methods such as Markov Chain Monte Carlo [32], the computational efficiency of the Fisher matrix approach is well\nsuited for this type of performance estimation work. Potential pitfalls have been discussed in the literature [33].\nThe Fisher information matrix is defined as\n\u001d\n\u001c\n∂h ∂h\n,\n(6)\nΓab ≡\n∂Λa ∂Λb\nwhere h is a channel of TDI strain, a and b are parameter\nindices, and h. . . | . . .i denotes a frequency-domain inner\nproduct weighted by the inverse noise spectral density\nSn (f ) of the TDI output n = Ā, Ē, T̄ :\nZ fhigh ∗\nx̃ (f )ỹ(f )\n.\n(7)\nhx|yi = 4 Re\nSn (f )\nflow\nHere flow is the low-frequency cutoff and fhigh is the half\nthe sampling frequency described in Section II A. The\nindividual Fisher matrices for each TDI channel to be\nincluded in the analysis are summed to form the total\nFisher matrix. Throughout this work, we calculate the\nparameter derivatives in (6) using second-order centered\ndifferencing (rather than one-sided as in [17]), with a fractional step size εa = ∆Λa . We set ∆ = 10−4 for the\ncoalescence time and ∆ = 10−6 for all other parameters.\nThe covariance matrix, Σab , is well approximated by\nthe inverse of the Fisher matrix for signals with large\nSNR:\n\u0001−1 \u0002\n\u0003\n1 + O(SNR−1 ) ,\n(8)\nΣab = Γab\n√\nso that σ a ≡ Σaa is the standard deviation of parameter\nΛa . Because we use ln M and ln DL as parameters, the\nresulting uncertainties are fractional:\nσ ln M = σ M /M ,\nσ ln DL = σ DL /DL .\n\n(9)\n\n\f4\nThe uncertainty of the other dimensionful parameter, tc ,\nis not expressed fractionally, as one is generally interested\nin the absolute timing error, but we emphasize that one is\nfree to make either choice. We note that a poor choice of\nunits for tc could cause the Fisher matrix to have a large\ndynamic range and be ill conditioned for inversion. We\nfind that expressing tc in seconds yields computationally\ninvertible Fisher matrices for the cases we consider.\n\nIII.\n\nSKY LOCALIZATION\n\nAs mentioned in Section I, the localization of a particular MBHB source on the sky is critical for enabling\ncoordinated observations with electromagnetic observatories. One goal might be to locate the host galaxy in\nwhich the MBHB merger occurred. If the galaxy can\nbe identified and the redshift obtained, it can be combined with the luminosity distance determined from the\ngravitational waveform for use as a cosmological probe\n[5, 34]. The simplest way to identify a host galaxy would\nbe for LISA to generate an error volume that only contained a single galaxy. Unfortunately, even the most optimistic estimates of LISA's localization ability suggest\nthat this will not generally be possible [5]. Identifying\nthe host galaxy within LISA's error volume will then require other information, perhaps the detection of a transient electromagnetic signal associated with the merger\nitself. The nature of this possible signal is a subject of active research [35, 36], and it is unclear if it exists, when\nit might peak relative to the GW signal, and what its\nspectral content will be.\nThe observational effort needed to search for an EM\ncounterpart to an MBHB merger will depend on the ratio between LISA's sky localization error box and the\nfield of view (FOV) of the EM asset used to perform the\nsearch. Roughly speaking, this ratio will determine the\nnumber of telescope pointings that are needed to cover\nthe LISA error box. While some counterpart scenarios\ninvolve afterglows that persist long after coalescence, others involve signals that peak at or before coalescence and\nmay fade quickly. For these signals, it is important to\nhave some advance warning as to where on the sky (and\nwhen) the merger will occur, allowing for appropriate\nEM resources to be scheduled and pointed in advance.\nThe sky localization information produced by LISA's orbit accumulates with time over the months or years that\nthe MBHB is observed, allowing for such advance notices\nto be issued.\nFigure 1 summarizes various estimates for the development of precision in ecliptic latitude over time for a\nLISA observation of two equal-mass, nonspinning black\nholes with a combined rest mass Mo = 2 × 106 M⊙ at\nz = 1. All of the curves show the median results from\nan ensemble of 100 systems with random sky locations\nand orientations. Except where noted, the low-frequency\nlimit of the inner product (7), flow , was set to 0.03 mHz.\nThe precise placement of this cutoff and the model of the\n\ninstrument noise between the cutoff and the lower limit\nof the \"official\" LISA measurement band at 0.1 mHz can\nhave a significant effect on the results [5, 8]. The curves\nare all shown as functions of time before tc , defined as\nthe peak of the waveform. In addition, we also show to\nthe right the final error achieved with the complete MR\nsignal.\nThe purple dot-dashed curve with square markers utilizes PN waveforms and a simplified model of the LISA\ninstrument response known as the low-frequency approximation (LFA). This approximation produces two channels of information which can be compared to the Ā and\nĒ TDI channels discussed in Section II B. The estimate\nis generated by the same code used in [11, 13], with the\nexception that here we ignore the effects of spin precession. We include it primarily for comparison with our\nown method described in Section II. Due to the breakdown of the post-Newtonian approximation, this curve is\ntruncated at the time corresponding to the Schwarzschild\ninnermost stable circular orbit (ISCO). Therefore, this\nestimate is sensitive to sky localization information encoded in the waveform by LISA's orbital motion but is\nnot sensitive to localization information resulting from\ninclusion of the MR waveform or from the high-frequency\nresponse of the instrument.\nThe red dotted curve with diamond markers, based\non our previous work [17], uses the IRS-EOB waveform\nmodel, as described in Section II A, and the Synthetic\nLISA instrument response described in Section II B. Due\nto the aforementioned problem (now solved) of spurious\ninformation in the T̄ channel, only the Ā and Ē TDI\nchannels are included. In addition, the instrument response uses a stationary, non-orbiting constellation lying\nin the ecliptic plane instead of the usual LISA orbits.\nThis estimate is therefore only sensitive to the sky localization information provided by the interaction of the\nMR signal with the high-frequency response of the detector. Lacking the orbital contribution, we can safely\nremove a large portion of the inspiral by setting the lowfrequency limit to flow = 0.1 mHz for this single estimate\nonly. This helps reduce computation time.\nFor times before the ISCO, the errors in the orbits-only\nestimate (purple, dot-dashed, squares) are far less than\nthose in the stationary-LISA estimate (red, dotted, diamonds), suggesting that the orbital mechanism for sky localization dominates over these time periods. The dotted\ncurve only \"catches up\" to the dot-dashed curve ∼ 100\nseconds before the merger. However, by the time the\nfull signal is considered, the stationary-LISA errors have\nbecome ∼ 4 times smaller than the orbits-only errors at\nISCO. In other words, for nonspinning, equal-mass binaries in this mass range, observing the MR signal alone\ngives better localization information than observing the\nentire inspiral.\nThe remaining curves are new results, estimates which\ninclude both the complete IMR (IRS-EOB) waveform\nand a realistic, orbiting (Synthetic LISA) model of\nthe instrument. In addition, the low frequency cutoff has\n\n\f5\n3\n\n10\n\nISCO\nLSST FOV\nσ β (arcmin)\n\n2\n\n10\n\n1\n\n10\n\nI, orbiting LFA, f\n\nlow\n\n= 0.03 mHz\n\nIMR, stationary SL, AE, f\nIMR, orbiting SL, AE, f\n\nlow\n\nlow\n\n0\n\n10 7\n10\n\nIMR, orbiting SL, AET, f\n\nlow\n\n6\n\n10\n\n= 0.1 mHz\n\nJWST FOV\n\n= 0.03 mHz\n= 0.03 mHz\n5\n\n10\n\n4\n\n10\ntc − t (sec)\n\n3\n\n10\n\n2\n\n10\n\n1\n\n10\n\n−∞\n\nFIG. 1: Comparison of latitude uncertainty estimates for an equal-mass, nonspinning MBHB with total mass 2 × 106 M⊙\nand redshift z = 1. The purple dot-dashed curve with square markers (based on [11, 13]) uses a post-Newtonian inspiral (I)\nwaveform and a low-frequency approximation (LFA) to the detector response that includes LISA's orbit. The red dotted curve\nwith diamond markers (based on [17]) uses the complete inspiral-merger-ringdown (IMR) waveform and Synthetic LISA (SL)\nfor the response function but neglects LISA's orbit, all frequencies below 0.1 mHz, and the T̄ channel. The green dashed curve\nwith triangle markers uses the IMR waveform, the SL response, and orbital effects, but neglects the T̄ channel. The blue solid\ncurve with circle markers includes all effects: the IMR waveform, the SL response with orbits, and all three TDI channels. The\nFOVs of LSST and JWST, as well as the location of the Schwarzschild ISCO, are shown for reference.\n\nbeen restored to 0.03 mHz in order to take advantage of\nthe orbital modulation. The green dashed curve with triangle markers includes only the Ā and Ē TDI channels,\nwhile the blue solid curve with circle markers includes\nthe T̄ channel as well.\nThe Ā , Ē estimate (green, dashed, triangles) tracks\nthe orbits-only estimate (purple, dot-dashed, squares) at\ntimes well before merger, thus confirming that our calculation is consistent with that of Lang and Hughes [11, 13]\nin the inspiral regime. It also tracks the stationaryLISA estimate (red, dotted, diamonds) as the MBHB\napproaches merger. When the entire IMR waveform is\nincluded, the orbiting and non-orbiting Ā , Ē estimates\ndiffer by only ∼ 10%. The dashed curve contains both\nmechanisms for localizing a source (orbits and highfrequency detector response to merger-ringdown), but\nit ultimately does not do significantly better than the\nstationary-LISA response alone. Our ability to localize\nsources well in advance of merger depends critically on\nthe orbital information. However, for the final achievable sky location accuracy in these systems, the inspiral\nis essentially irrelevant and only the MR signal need be\ntaken into account.\nThe estimate with all three TDI channels (blue, solid,\ncircles) begins to diverge from the orbits-only estimate\n(purple, dot-dashed, squares) at earlier times than the\nĀ , Ē estimate and reaches a value at coalescence that is\nabout half that of the Ā , Ē estimate. This represents the\nadditional contribution of the T̄ channel, which is concentrated at high frequencies. It is neglected implicitly in\nthe orbits-only estimate through the use of the LFA and\n\nexplicitly in the other two estimates. While all three TDI\nchannels are available in a fully operational, 6-link LISA,\nonly two channels are available if one link is down [38].\nUsing the green dashed line as a proxy for a 5-link LISA\nand comparing to the blue solid line, we can see roughly\nhow much the sky position determination is affected by\na non-optimal detector.\nFigure 1 also includes the FOV of two representative\nEM instruments that could be used for locating counterparts. The Large Synoptic Survey Telescope (LSST)\n[39] has a FOV of 9.6 deg2 , which we have modeled as a\nsquare aperture ∼ 186 arcmin on a side, and is designed\nto rapidly and repeatedly scan large areas of the sky.\nThe figure demonstrates that LISA will localize a typical equal-mass, nonspinning MBHB source of this mass\nand redshift within a single LSST field several months in\nadvance of merger. This will allow multiple exposures of\nthe target area to be made throughout the event in an\neffort to detect an optical transient.\nIf a transient signal is not bright enough to be visible\nwith a survey telescope such as LSST, then a more sensitive instrument with a narrower field of view may be required. In Fig. 1 we plot the 2.2 arcmin×4.4 arcmin FOV\nof the NIRCam instrument on the James Webb Space\nTelescope (JWST) [40] as an example of such an instrument. Our most complete estimate of LISA's localization\ncapabilities (IMR waveform, orbiting detector with Synthetic LISA response, all TDI channels) has a median\nlatitude error of 2.6 arcmin. This suggests that a single\nJWST exposure might be sufficient to cover the LISA\nerror box for this system. In reality, a few exposures\n\n\f6\nAE, 20%−80%\nAE, median\n\nLSST FOV\n2\n\n10\n\nISCO\nσ (arcmin)\n\n1\n\n10\n\nβ\n\nβ\n\nσ (arcmin)\n\n10\n\nISCO\n\n1\n\n10\n\nJWST FOV\na.)\n0\n10 7\n10\n\n6\n\n10\n\nAET, 20%−80%\nAET, median\n\nLSST FOV\n2\n\nJWST FOV\n\n5\n\n10\n\n4\n\n10\nt − t (sec)\n\n3\n\n10\n\n2\n\n10\n\n1\n\n10\n\nb.)\n0\n10 7\n10\n\n−∞\n\n6\n\n10\n\n5\n\n10\n\nc\n\n4\n\n10\ntc − t (sec)\n\n3\n\n10\n\n2\n\n10\n\n1\n\n10\n\n−∞\n\nFIG. 2: Latitude uncertainty, σ β , for a 2 × 106 M⊙ system at z = 1. The center line (with individual time samples marked)\ndenotes the median error, while the shaded region depicts the middle three quintiles (20th − 80th percentile) of errors. Both\nplots correspond to IMR signals with an orbiting LISA constellation. However, panel (a) shows results for just the Ā and Ē\nTDI channels, while panel (b) also includes the T̄ channel.\nAE, 20%−80%\nAE, median\n\nLSST FOV\n2\n\n10\nσ (arcmin)\n\n1\n\n10\n\nλ\n\nλ\n\nσ (arcmin)\n\n10\n\nISCO\n\n1\n\n10\n\nISCO\n\nJWST FOV\n0\n\nAET, 20%−80%\nAET, median\n\nLSST FOV\n2\n\nJWST FOV\n\na.)\n\n10 7\n10\n\n6\n\n10\n\n5\n\n10\n\n4\n\n10\nt − t (sec)\n\n3\n\n10\n\n2\n\n10\n\n1\n\n10\n\n−∞\n\nb.)\n0\n10 7\n10\n\nc\n\n6\n\n10\n\n5\n\n10\n\n4\n\n10\nt − t (sec)\n\n3\n\n10\n\n2\n\n10\n\n1\n\n10\n\n−∞\n\nc\n\nFIG. 3: Same as Fig. 2, but for uncertainty in longitude, σ λ .\n\nmay be required to account for the shape of the LISA error box, its orientation with respect to the JWST FOV,\nand any operational constraints of JWST. The results in\nFig. 1 suggest that unlike the situation with LSST, in\nwhich a number of pre-merger images could be obtained,\na coordinated observation with JWST (or any other instrument with a similar FOV) will have to be a follow-up,\nas LISA requires the complete IMR waveform to provide\nprecise localization information. For example, at ISCO,\nthe best estimate for median latitude error exceeds the\nJWST FOV by roughly half an order of magnitude.\nAll of the curves in Fig. 1 represent the median LISA\nlatitude error for an ensemble of MBHB mergers. Figures 2 and 3 also show the distribution of both latitude and longitude errors, based on estimates with the\ncomplete IMR waveform and LISA's orbital modulation.\nSeparate panels show results including just Ā and Ē and\nresults including all three TDI channels. In each panel,\nthe solid line represents the median values (equivalent to\nwhat is plotted in Fig. 1), while the shaded area shows\nthe region spanned by the middle three quintiles of the\ndistribution. The left panels (Ā, Ē only) show that the\nfinal LISA error box will lie within the FOV of JWST for\nsystems in the 80th percentile of sky localization precision. That is, both latitude and longitude are measured\nto within ∼ 4.4 arcmin or better for the top 20% of systems. When T̄ is included, the situation is better still,\nwith a full 50% of binaries in our ensemble fitting within\n\nthe JWST FOV2 . These figures show just how important\nT̄ is for computing final localization errors. Not only do\nthe medians drop for both parameters, but the width of\nthe distribution decreases as well. Although a 5-link and\n6-link LISA are indistinguishable at early times, complete functionality can have important effects for the full\nsignal.\nFor completeness, in Fig. 4 we show errors in luminosity distance, σ DL /DL , for IMR signals with orbital\nmodulation. Distance is the third axis of the 3D localization \"voxel.\" Given an assumed cosmological model, a\nmeasurement of distance is equivalent to a measurement\nof redshift. This approximate redshift can help decide between potential host galaxies located within the 2D error\nbox. We see that the median distance error drops below\na percent within the last day, reaching a minimum of less\nthan 0.1%. Unfortunately, this \"intrinsic LISA error\"\nis not the limiting uncertainty for measuring luminosity\ndistance. Weak lensing from matter between the source\nand the detector will slightly magnify or demagnify the\nGW signal in an unknown way, adding significant error\n\n2\n\nThese assertions are somewhat crude: The plot does not actually\nshow whether individual binaries meet the criterion. It is possible that some systems are well localized in latitude but poorly\nlocalized in longitude, and vice-versa. A more careful check of\nthe raw data verifies the numbers in the text.\n\n\f7\n−1\n\n−1\n\n10\n\n10\n\nAE, 20%−80%\nAE, median\n\nWL\n\nAET, 20%−80%\nAET, median\n\nWL\n\n−2\n\n−2\n\nL\n\nD\n\nσ\n\nσ\n\nD\n\nL\n\n/D\n\nL\n\n10\n\n/ DL\n\n10\n\nISCO\n\n−3\n\n10\n\n−3\n\n10\n\nISCO\n\n−4\n\n10\n\na.)\n7\n\n10\n\nb.)\n\n−4\n\n6\n\n10\n\n5\n\n10\n\n4\n\n10\nt − t (sec)\n\n3\n\n10\n\n2\n\n10\n\n1\n\n10\n\n−∞\n\n10\n\n7\n\n6\n\n10\n\n5\n\n10\n\n4\n\n10\n\n3\n\n10\nt − t (sec)\n\n2\n\n10\n\n1\n\n10\n\n10\n\n−∞\n\nc\n\nc\n\nFIG. 4: Same as Fig. 2, but for fractional luminosity distance uncertainty, σ DL /DL . An estimate of the weak lensing limit\n(WL) [37] at z = 1 is shown for reference. Figs. 2–4 collectively show the evolution of the 3D error voxel.\n\n12\n\n10\n\n10\n\n10\n\nln M\n\n8\n\n10\nEigenvalues\n\nto the distance measurement. The line marked \"WL\" on\nthe figure is an estimate [37] of σ DL /DL ∼ 4.4% from\nweak lensing at z = 1. The intrinsic LISA error crosses\nthe WL error over a month before merger; shortly after that time, the information on DL provided by LISA\nbecomes irrelevant unless weak lensing error can be mitigated significantly [41].\n\nln DL &\n\n6\n\n10\n\nangles\n\n4\n\n10\n\n2\n\nIV.\n\nCONTRIBUTION OF MERGERS TO\nPARAMETER ESTIMATION\n\nThe results presented in the preceding section clearly\ndemonstrate that observing the MR portion of an MBHB\nsignal can provide a significant amount of sky localization\ninformation, despite the fact that there is little or no\nmodulation imposed by the LISA orbits. In this section,\nwe explore the nature of this information. Throughout\nthis section, we always use the complete IMR waveform\nwith orbital modulation and all three TDI channels.\nOne question of interest is whether the information\nprovided by the MR signal is tightly coupled to just one\nor two of the elements in Λa or if it generally improves\nthe knowledge of all parameters. Figure 5 shows the time\nevolution of the median eigenvalues of the Fisher matrix\nfor the ensemble of systems studied in Section III. At\neach time step, Γab was calculated using the Ā, Ē, and\nT̄ observables for every case in the ensemble using the\nprocedure described in Section II. These matrices were\nused to compute the eigenvalues for every case in the\nensemble, and the median values are plotted. A similar\nprocedure was used to compute the median eigenvectors\ncorresponding to these eigenvalues.\nAs (8) indicates, the Fisher matrix is a measure of\ninverse error or \"information.\" The increasing trends in\nthe curves in Fig. 5 represent information accumulating\nin the LISA observables as the signal evolves, just as\nthe decreasing trends in Figs. 1-4 represent a decrease\nin measurement error. The largest eigenvalue in Fig. 5\n(solid curve) corresponds to an eigenvector that mostly\nconsists of one parameter, ln M . The majority of the\ninformation in this eigenvalue accumulates early in the\ninspiral phase of the signal. From ISCO through the end\n\n10\n\nISCO\n\n0\n\n10\n10\n\ntc\n\n−2\n7\n\n10\n\n10\n\n6\n\n10\n\n5\n\n4\n\n10\n10\ntc − t (sec)\n\n3\n\n10\n\n2\n\n10\n\n1\n\n−∞\n\nFIG. 5: Evolution of the median Fisher matrix eigenvalues\nwith time for the inspiral, merger, and ringdown of an ensemble of equal-mass, nonspinning MBHBs with Mo = 2×106 M⊙\nat z = 1 observed by an orbiting, six-link LISA via the Ā, Ē,\nand T̄ TDI channels.\n\nof the signal, the eigenvalue roughly doubles, with most of\nthe increase occurring very near the time of coalescence.\nThis is consistent with previous results that show that\nln M is primarily determined during the inspiral phase\n[42] and that the MR signal provides little additional\ninformation [17]. By comparison, the increase in SNR2 ,\nwhich one might naively expect to be proportional to\nFisher matrix eigenvalues, is ∼ 100 over this period.\nThe band of eigenvalues in the middle of Fig. 5 (dashed\ncurves) represent a mix of the five angular parameters in\nΛa and ln DL . The increase in these eigenvalues from\nISCO through ringdown is much more significant than\nthat for ln M , ranging from two to three orders of magnitude.\nThe smallest eigenvalue (dotted curve) corresponds to\nan eigenvector that mostly consists of tc . The small size\nof this eigenvalue is partly due to the intrinsic scale of the\nparameter, which was the only one in Λa to be expressed\nin physical units (seconds). It increases by a factor of\n∼ 30 between ISCO and the end of ringdown.\nThe fact that all of the eigenvalues increase post-ISCO\n\n\f8\nindicates that the MR portion of the waveform, coupled\nwith the high-frequency response of the LISA instrument,\nprovides information in all directions of parameter space.\nWe might have expected that the merger, with its pronounced peak, would provide a very accurate measurement of tc and only affect other parameters by decreasing their degeneracy with tc . However, Figure 5 demonstrates that this is not the case. If we were to assume\nthat sky localization results primarily from the modulation imposed by LISA's orbit, then we would expect\nthat the merger cannot provide any intrinsic information\nabout sky position, since the LISA constellation remains\neffectively stationary during merger. Figure 5 demonstrates that the interaction between the MR signal and\nthe complex response of the LISA instrument provides\ninformation about every parameter independently. This\nis in addition to any contribution from degeneracy breaking which may occur.\nV.\n\nSUMMARY AND CONCLUSIONS\n\nWe have presented the first estimates of LISA's ability\nto measure the source parameters of nonspinning, equalmass MBHBs that include a complete inspiral-mergerringdown waveform, realistic LISA orbits, and the full\nhigh-frequency response of the LISA instrument. For systems with Mo = 2 × 106 M⊙ at z = 1, we find that LISA\ncan locate the source on the sky with an error of ∼ 3\narcminutes in the median case at the end of the MBHB\nevent. We have also studied how the sky localization information for these systems evolves with time and find\nthat, at ISCO, the sky localization errors are typically\ntens of arcminutes.\nInspired by the potential for multi-messenger astronomy enabled by combined observations of MBHB mergers\nwith gravitational-wave detectors and electromagnetic\ntelescopes, we have compared the source-localization capabilities of LISA with the FOVs of two future telescopes: LSST and JWST. We find that most systems\nin our ensemble are located within the LSST FOV several months prior to coalescence. Localization within the\nsmaller FOV of JWST requires information from the MR\nwaveform.\nWhile the results in this paper focus on a particular\ninstrument (LISA) and a particular source class (equalmass, nonspinning, Mo = 2 × 106 M⊙ , z = 1) they can\nprovide insight for other scenarios as well. For example,\nproposals for lower-cost variants of LISA often involve a\nconstellation with shorter arm lengths [43]. This has the\ngeneral effect of shifting the response of the instrument to\nhigher frequencies. We have asserted that the improve-\n\n[1] E. E. Flanagan and S. A. Hughes, Phys. Rev. D 57, 4535\n(1998).\n\nment in parameter estimation that we observe post-ISCO\nis due in part to the complexity of the high-frequency response of the instrument. If this is true, shortening the\narms could have a significant impact on the ability to\nlocalize systems in the mass range studied. Specifically,\nthe improvement in sky localization from observing the\nmerger-ringdown of a system with Mo ∼ 106 M⊙ may\nnot be as dramatic as that presented in Section III. At\nthe same time, the decrease in strain sensitivity associated with shorter arms would reduce the duration of the\ninspiral signal that is observed, further degrading measurement performance for these systems. For systems\nwith larger Mo , the situation would be worse.\nFor lower-mass systems, shortening the arms (if the interferometric measurement system is not simultaneously\ndegraded) may actually increase the benefits of observing the merger by increasing the SNR for the mergerringdown portion of the signal. Since these lighter systems have higher merger frequencies, they will still experience a complex response in the detector, even with\nshorter arms. Determining whether this effect can overcome the lower intrinsic SNR of less massive systems will\nrequire a more detailed calculation.\nFinally, we note that while the addition of the mergerringdown signal and a complete detector response is an\nimportant step towards realizing the full potential of\nLISA and other space-based gravitational-wave detectors, we still do not have a complete picture. Other potential sources of information in the MBHB waveform,\nparticularly spin and the associated precession effects,\nhave been demonstrated to significantly improve LISA's\nlocalization ability in the inspiral-only case [7]. It remains to be seen what impact combining spin precession\nand merger will have on LISA sky localization estimates.\nAcknowledgments\nWe thank Tuck Stebbins for helpful discussions and\nBernard Kelly for his thorough review of the manuscript.\nWe acknowledge the support of NASA grant 08-ATFP080126. RNL was supported by an appointment to the\nNASA Postdoctoral Program at the Goddard Space\nFlight Center, administered by Oak Ridge Associated\nUniversities through a contract with NASA. The simulations were carried out using resources from the NASA\nCenter for Computational Sciences (Goddard Space\nFlight Center).\nCopyright (c) 2011 United States Government as represented by the Administrator of the National Aeronautics\nand Space Administration. No copyright is claimed in\nthe United States under Title 17, U.S. Code. All other\nrights reserved.\n\n[2] J. G. Baker et al., Phys. Rev. D 75, 124024 (2007).\n[3] S. T. McWilliams, B. J. Kelly, and J. G. Baker, Phys.\n\n\f9\n[23] S. Gillessen et al., Astrophys. J. 692, 1075 (2009).\nRev. D 82, 024014 (2010).\n[24] A. M. Ghez et al., Astrophys. J. 620, 744 (2005).\n[4] J.\nG.\nBaker\net al.,\nLISA:\nProbing\nthe\n[25] A. J. Barth, J. E. Greene, and L. C. Ho, Astrophys. J.\nUniverse\nwith\nGravitational\nWaves,\n2007,\n619, L151 (2005).\nhttp://lisa.gsfc.nasa.gov/Documentation/LISA-LIST-RP-436_v1.2.pdf.\n[26] S. Babak, M. D. Hannam, S. Husa, and B. F. Schutz,\n[5] B. Kocsis, Z. Haiman, and K. Menou, Astrophys. J. 684,\narXiv:0806.1591 (unpublished).\n870 (2008).\n[27] T. A. Prince, M. Tinto, S. L. Larson, and J. W. Arm[6] C. Cutler, Phys. Rev. D 57, 7089 (1998).\nstrong, Phys. Rev. D 66, 122002 (2002).\n[7] R. N. Lang and S. A. Hughes, Phys. Rev. D 74, 122001\n[28] M. Vallisneri, Phys. Rev. D 71, 022001 (2005).\n(2006), erratum-ibid. 75, 089902 (2007); erratum-ibid.\n[29] M. Tinto, D. A. Shaddock, J. Sylvestre, and J. W. Arm77, 109901 (2008).\nstrong, Phys. Rev. D 67, 122003 (2003).\n[8] B. Kocsis, Z. Haiman, K. Menou, and Z. Frei, Phys. Rev.\n[30] F. B. Estabrook, M. Tinto, and J. W. Armstrong, Phys.\nD 76, 022003 (2007).\nRev. D 62, 042002 (2000).\n[9] K. G. Arun et al., Phys. Rev. D 76, 104016 (2007).\n[31] S. E. Timpano, L. J. Rubbo, and N. J. Cornish, Phys.\n[10] M. Trias and A. M. Sintes, Phys. Rev. D 77, 024030\nRev. D 73, 122001 (2006).\n(2008).\n[32] N. J. Cornish and E. K. Porter, Class. Quantum Grav.\n[11] R. N. Lang and S. A. Hughes, Astrophys. J. 677, 1184\n23, S761 (2006).\n(2008).\n[33] M. Vallisneri, Phys. Rev. D 77, 042001 (2008).\n[12] E. K. Porter and N. J. Cornish, Phys. Rev. D 78, 064005\n[34] D. E. Holz and S. A. Hughes, Astrophys. J. 629, 15\n(2008).\n(2005).\n[13] R. N. Lang and S. A. Hughes, Class. Quantum Grav. 26,\n[35] J. D. Schnittman, Class. Quantum Grav. 28, 094021\n094035 (2009).\n(2011).\n[14] A. Klein, P. Jetzer, and M. Sereno, Phys. Rev. D 80,\n[36] J. S. Bloom et al., arXiv:0902.1527 (unpublished).\n064027 (2009).\n[37] D. E. Holz and E. V. Linder, Astrophys. J. 631, 678\n[15] R. N. Lang, S. A. Hughes, and N. J. Cornish,\n(2005).\narXiv:1101.3591 (unpublished).\n[38] M. Vallisneri, J. Crowder, and M. Tinto, Classical and\n[16] J. I. Thorpe et al., Class. Quantum Grav. 26, 094026\nQuantum Gravity 25, 065005 (2008).\n(2009).\n[39] Z. Ivezic et al., arXiv:0805.2366 (unpublished).\n[17] S. T. McWilliams, J. I. Thorpe, K. A. Arnaud, and J. G.\n[40] J. P. Gardner et al., Space Sci. Rev. 123, 485 (2006).\nBaker, Phys. Rev. D 81, 064014 (2009).\n[41] C. Shapiro, D. J. Bacon, M. Hendry, and B. Hoyle, Mon.\n[18] L. J. Rubbo, N. J. Cornish, and O. Poujade, Phys. Rev.\nNot. R. Astron. Soc. 404, 858 (2010).\nD 69, 082003 (2004).\n[42] C. Cutler and E. E. Flanagan, Phys. Rev. D 49, 2658\n[19] J. G. Baker et al., Phys. Rev. D 78, 044046 (2008).\n(1994).\n[20] A. Buonanno et al., Phys. Rev. D 76, 104049 (2007).\n[43] R. T. Stebbins, Class. Quantum Grav. 26, 094014 (2009).\n[21] J. N. Goldberg et al., J. Math. Phys. 8, 2155 (1967).\n[22] A. Sesana, M. Volonteri, and F. Haardt, Mon. Not. R.\nAstron. Soc. 377, 1711 (2007).\n\n\f"}