{"id": "http://arxiv.org/abs/1112.0414v1", "guidislink": true, "updated": "2011-12-02T10:05:17Z", "updated_parsed": [2011, 12, 2, 10, 5, 17, 4, 336, 0], "published": "2011-12-02T10:05:17Z", "published_parsed": [2011, 12, 2, 10, 5, 17, 4, 336, 0], "title": "The young open cluster Berkeley 55", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1112.3820%2C1112.5459%2C1112.1320%2C1112.5161%2C1112.1724%2C1112.5955%2C1112.0086%2C1112.4952%2C1112.5966%2C1112.0543%2C1112.6383%2C1112.0620%2C1112.2706%2C1112.1322%2C1112.1279%2C1112.4840%2C1112.1834%2C1112.3671%2C1112.1178%2C1112.6337%2C1112.5932%2C1112.4947%2C1112.1617%2C1112.0871%2C1112.0885%2C1112.1452%2C1112.4879%2C1112.0669%2C1112.1125%2C1112.1917%2C1112.4435%2C1112.3390%2C1112.2111%2C1112.2540%2C1112.1370%2C1112.1764%2C1112.3776%2C1112.5499%2C1112.5835%2C1112.2868%2C1112.3424%2C1112.3226%2C1112.4519%2C1112.0414%2C1112.5555%2C1112.3787%2C1112.4645%2C1112.4570%2C1112.0559%2C1112.3196%2C1112.3993%2C1112.3254%2C1112.3203%2C1112.5368%2C1112.5669%2C1112.5690%2C1112.5048%2C1112.4306%2C1112.0337%2C1112.5001%2C1112.5372%2C1112.1465%2C1112.4537%2C1112.3663%2C1112.4929%2C1112.0579%2C1112.1816%2C1112.1064%2C1112.0263%2C1112.0396%2C1112.0616%2C1112.3519%2C1112.0901%2C1112.1346%2C1112.0812%2C1112.1958%2C1112.5719%2C1112.2664%2C1112.3338%2C1112.4186%2C1112.3301%2C1112.5601%2C1112.1578%2C1112.4215%2C1112.5366%2C1112.3337%2C1112.5641%2C1112.5608%2C1112.4249%2C1112.5328%2C1112.1829%2C1112.2414%2C1112.2431%2C1112.3870%2C1112.3728%2C1112.2366%2C1112.1932%2C1112.1577%2C1112.4136%2C1112.1003%2C1112.0957&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The young open cluster Berkeley 55"}, "summary": "We present UBV photometry of the highly reddened and poorly studied open\ncluster Berkeley 55, revealing an important population of B-type stars and\nseveral evolved stars of high luminosity. Intermediate resolution far-red\nspectra of several candidate members confirm the presence of one F-type\nsupergiant and six late supergiants or bright giants. The brightest blue stars\nare mid-B giants. Spectroscopic and photometric analyses indicate an age 50+-10\nMyr. The cluster is located at a distance d~4kpc, consistent with other tracers\nof the Perseus Arm in this direction. Berkeley 55 is thus a moderately young\nopen cluster with a sizable population of candidate red (super)giant members,\nwhich can provide valuable information about the evolution of intermediate-mass\nstars.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1112.3820%2C1112.5459%2C1112.1320%2C1112.5161%2C1112.1724%2C1112.5955%2C1112.0086%2C1112.4952%2C1112.5966%2C1112.0543%2C1112.6383%2C1112.0620%2C1112.2706%2C1112.1322%2C1112.1279%2C1112.4840%2C1112.1834%2C1112.3671%2C1112.1178%2C1112.6337%2C1112.5932%2C1112.4947%2C1112.1617%2C1112.0871%2C1112.0885%2C1112.1452%2C1112.4879%2C1112.0669%2C1112.1125%2C1112.1917%2C1112.4435%2C1112.3390%2C1112.2111%2C1112.2540%2C1112.1370%2C1112.1764%2C1112.3776%2C1112.5499%2C1112.5835%2C1112.2868%2C1112.3424%2C1112.3226%2C1112.4519%2C1112.0414%2C1112.5555%2C1112.3787%2C1112.4645%2C1112.4570%2C1112.0559%2C1112.3196%2C1112.3993%2C1112.3254%2C1112.3203%2C1112.5368%2C1112.5669%2C1112.5690%2C1112.5048%2C1112.4306%2C1112.0337%2C1112.5001%2C1112.5372%2C1112.1465%2C1112.4537%2C1112.3663%2C1112.4929%2C1112.0579%2C1112.1816%2C1112.1064%2C1112.0263%2C1112.0396%2C1112.0616%2C1112.3519%2C1112.0901%2C1112.1346%2C1112.0812%2C1112.1958%2C1112.5719%2C1112.2664%2C1112.3338%2C1112.4186%2C1112.3301%2C1112.5601%2C1112.1578%2C1112.4215%2C1112.5366%2C1112.3337%2C1112.5641%2C1112.5608%2C1112.4249%2C1112.5328%2C1112.1829%2C1112.2414%2C1112.2431%2C1112.3870%2C1112.3728%2C1112.2366%2C1112.1932%2C1112.1577%2C1112.4136%2C1112.1003%2C1112.0957&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We present UBV photometry of the highly reddened and poorly studied open\ncluster Berkeley 55, revealing an important population of B-type stars and\nseveral evolved stars of high luminosity. Intermediate resolution far-red\nspectra of several candidate members confirm the presence of one F-type\nsupergiant and six late supergiants or bright giants. The brightest blue stars\nare mid-B giants. Spectroscopic and photometric analyses indicate an age 50+-10\nMyr. The cluster is located at a distance d~4kpc, consistent with other tracers\nof the Perseus Arm in this direction. Berkeley 55 is thus a moderately young\nopen cluster with a sizable population of candidate red (super)giant members,\nwhich can provide valuable information about the evolution of intermediate-mass\nstars."}, "authors": ["Ignacio Negueruela", "Amparo Marco"], "author_detail": {"name": "Amparo Marco"}, "author": "Amparo Marco", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1088/0004-6256/143/2/46", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1112.0414v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1112.0414v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "Accepted for publication in the Astronomical Journal. Tables 3, 6 and\n  7 are published electronically, and only the first few rows are shown here", "arxiv_primary_category": {"term": "astro-ph.GA", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph.GA", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "astro-ph.SR", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1112.0414v1", "affiliation": "Alicante", "arxiv_url": "http://arxiv.org/abs/1112.0414v1", "journal_reference": "The Astronomical Journal, 143, 46 (2012)", "doi": "10.1088/0004-6256/143/2/46", "fulltext": "The young open cluster Berkeley 55∗\n\narXiv:1112.0414v1 [astro-ph.GA] 2 Dec 2011\n\nIgnacio Negueruela1 , Amparo Marco1\n1\n\nDepartamento de Fı́sica, Ingenierı́a de Sistemas y Teorı́a de la Señal, Universidad de\nAlicante, Apdo. 99, E-03080 Alicante, Spain\nignacio.negueruela@ua.es\namparo.marco@ua.es\nReceived\n\n*\n\n;\n\naccepted\n\nPartially based on observations collected at the Nordic Optical Telescope and the William\n\nHerschel Telescope (La Palma)\n\n\f–2–\nABSTRACT\n\nWe present UBV photometry of the highly reddened and poorly studied open\ncluster Berkeley 55, revealing an important population of B-type stars and several evolved stars of high luminosity. Intermediate resolution far-red spectra of\nseveral candidate members confirm the presence of one F-type supergiant and\nsix late supergiants or bright giants. The brightest blue stars are mid-B giants.\nSpectroscopic and photometric analyses indicate an age 50 ±10 Myr. The cluster\nis located at a distance d ≈ 4 kpc, consistent with other tracers of the Perseus\nArm in this direction. Berkeley 55 is thus a moderately young open cluster with\na sizable population of candidate red (super)giant members, which can provide\nvaluable information about the evolution of intermediate-mass stars.\nSubject headings:\n\nstars: evolution – stars: early type – stars: supergiant – Galaxy:\n\nstructure – open clusters and associations: individual: Berkeley 55\n\n\f–3–\n1.\n\nIntroduction\n\nAfter exhaustion of H in their cores, stars evolve toward lower Teff , becoming, according\nto their masses, red giants or supergiants (RSGs). Both high- and intermediate-mass\nstars are subject to complex physical processes in their later evolution, which result in\nimportant changes in their observable characteristics (Teff , Lbol ). As a consequence, their\nevolutionary tracks trace loops in the HR diagrams (e.g., Chiosi et al. 1992). The shape\nof these loops depends on the physics of the stellar interior, generally modeled via poorly\nunderstood parameters (e.g., Chiosi et al. 1992; Mowlavi & Forestini 1994; Salasnich et al.\n1999; Meynet & Maeder 2000). The extent of semi-convection and overshooting has very\nimportant consequences on many aspects of stellar evolution, most notably the ratio of\ninitial mass to white dwarf mass (e.g., Jeffries 1997; Weidemann 2000) and the boundary\nbetween stars that leave white dwarfs as remnants and those that explode as supernovae\n(SNe; e.g., Poelarends et al. 2008).\nM-type supergiants represent the final evolutionary stage of moderately massive stars,\nwith typical initial masses in the 8–25 M⊙ range (Levesque et al. 2005). Such objects are\nthe immediate progenitors of Type II-P SNe, the most frequent type of supernova explosion\nin the Local Universe (Smartt 2009; Smith et al. 2011). Most of the explosions come from\nlow-mass RSGs, stars with initial masses M∗ . 12 M⊙ . The lower mass limit for a star to\nproduce a supernova has been estimated at ≈ 8.5+1\n−1.5 M⊙ (Smartt et al. 2009). Nevertheless,\nstars with lower masses are also classified as supergiants, generally K Ib objects, showing\nthat the morphological separation between red supergiants and red giants does not coincide\nexactly with the boundary between high- and intermediate-mass stars.\nSince stars become more luminous as they experience blue loops and later enter the\nAGB branch, a given star may appear first as a bright giant and later in its evolution\nas a supergiant. Open clusters with large populations of evolved stars can help constrain\n\n\f–4–\nthe inputs of models and therefore improve our understanding of such basic questions.\nIdentification and study of such clusters is thus an important astrophysical issue.\nTo this aim, we have analyzed a sample of poorly-studied, cataloged, optically-visible\nclusters in the Northern Hemisphere, using 2MASS data (Skrutskie et al. 2006). We made\nuse of the QIR index, a reddening-free parameter, defined as (J − H) − 1.70(H − KS ), which\nhas been proved to be a very useful tool for identification of intrinsically blue stars (see,\ne.g., Comerón & Pasquali 2005; Negueruela & Schurch 2007) and separation of luminous\nred stars from red dwarfs (Negueruela et al. 2011). Berkeley 55 (Be 55) was readily\nidentified as containing an obvious clump of red luminous stars associated with a sequence\nof intrinsically blue stars.\nBe 55 is a faint, compact open cluster in the constellation Cygnus. The WEBDA\ndatabase1 provides coordinates RA: 21h 16m 58s, Dec: +51◦ 45′ 32′′ (l = 93.◦ 03, b = +1.◦ 80).\nMaciejewski & Niedzielski (2007) presented BV photometry of an extended field around the\nobvious cluster core and found it to be extremely compact, with rcore = 0.′ 7. They derived\na distance d = 1.2 kpc and an age log t = 8.5 (315 Myr), which was later used by Tadross\n(2008) to calibrate a fit to the 2MASS data in the region. However, the cluster looks too\ncompact for this age and distance, while the isochrone fit of Tadross (2008) would suggest\nthat most of the evolved cluster members are AGB stars, an extremely unusual situation.\nIn this paper, we present UBV photometry of the cluster area and a spectroscopic\nsurvey of likely members, showing that its population is much younger than implied by\nthe single-color fit of Maciejewski & Niedzielski (2007). From our new data, we show that\nBe 55 is a young (log t ≈ 7.7) open cluster with a rich population of evolved stars.\n1\n\nAt http://www.univie.ac.at/webda/\n\n\f–5–\n2.\n2.1.\n\nObservations and data\nOptical photometry\n\nUBV photometry of Be 55 was obtained in service mode using ALFOSC on the Nordic\nOptical Telescope at the Roque de los Muchachos Observatory (La Palma, Spain) on the\nnight of June 14th, 2010. In imaging mode, the camera covers a field of 6.′ 5 × 6.′ 5 and has a\npixel scale of 0.′′ 19/pixel.\nOne standard field from the list of Landolt (1992), PG 1323−086, was observed twice\nduring the night in order to provide standard stars for the transformation. Since the number\nof measurements was too low to trace the extinction during the night, we used the median\nextinction coefficients for the observatory, after verifying that the two measurements of\nthe standards were fully compatible with these values. The images were processed for bias\nand flat-fielding corrections with the standard procedures using the CCDPROC package\nin IRAF2 . Aperture photometry using the PHOT package inside DAOPHOT (IRAF,\nDAOPHOT) was developed on these fields with the same aperture, 21 pixels, for each filter.\nImages of Be 55 were taken in 2 series of different exposure times to obtain accurate\nphotometry for a magnitude range. The log of observations is presented in Table 1. The\nreduction of the images of Be 55 was done with IRAF routines for the bias and flat-field\ncorrections. Photometry was obtained by point-spread function (PSF) fitting using the\nDAOPHOT package (Stetson 1987) provided by IRAF. The apertures used are of the order\nof the FWHM. In this case, we used a value of 5 pixels for all images in the U and B filters\nand a value of 4 pixels for the V filter images.\n2\n\nIRAF is distributed by the National Optical Astronomy Observatories, which are oper-\n\nated by the Association of Universities for Research in Astronomy, Inc., under cooperative\nagreement with the National Science Foundation\n\n\f–6–\nIn order to construct the PSF empirically, we automatically selected bright stars\n(typically 25 stars). After this, we reviewed the candidates and discarded those that did not\nfulfill all the best conditions for a good PSF star. Once we had the list of PSF stars (≈ 20),\nwe determined an initial PSF by fitting the best function between the 5 options offered by\nthe PSF routine inside DAOPHOT. We allowed the PSF to be variable (in order 2) across\nthe frame to take into account the systematic pattern of PSF variability with position on\nthe chip.\nWe needed to perform aperture correction for each frame in all filters. Finally, we\nobtained the instrumental magnitudes for all stars. Using the standard stars and the\nmedian extinction coefficients for the observatory, we carried out the transformation of\nthe instrumental magnitudes to the standard system by means of the PHOTCAL package\ninside IRAF.\nThe number of stars that we could detect in all filters is limited by the long exposure\ntime in the U filter. We identify all stars with good photometry in all three filters on the\nimage in Figures 1 and 2. In Table 6, we list their X and Y positions as seen in Fig. 1,\nand their identification with objects in the 2MASS catalog. The designation of each star is\ngiven by the number indicated on the images (Fig. 1 and Fig. 2). We have photometry for\n237 stars in the field. In Table 7, we list the values of V , (B − V ) and (U − B) with the\nstandard deviation and the number of measurements for each magnitude or index.\nWe can compare our photometry with the only existing dataset, that of\nMaciejewski & Niedzielski (2007). We find average differences (literature − this\nwork) in V of −0.1 ± 0.3. This shows important dispersion, but no systematic effects. The\naverage difference in (B − V ) is 0.16 ± 0.08, suggesting a small systematic difference, though\nnot much higher than the standard deviation. We note that, with a pixel size of 2.′′ 2 and a\nreported typical seeing around 5′′ , the photometry of Maciejewski & Niedzielski (2007) may\n\n\f–7–\nbe subject to important crowding effects near the cluster core.\n\n2.2.\n\n2MASS data\n\nWe obtained JHKS photometry from the 2MASS catalog. The completeness limit\nof this catalog is set at KS = 14.2. None of the stars analyzed is bright enough to come\nclose to the non-linear regime for 2MASS. We used the 2MASS data to select targets for\nspectroscopy.\nWe selected our targets using 2MASS JHKS data. We took a circle of radius 3′ around\nthe cluster center and built the corresponding KS /(J − KS ) diagram (displayed in Fig. 3).\nAll the stars with KS ≤ 8.0 (shown as diamonds) are clumped together in a small region of\nthe diagram. Their QIR is ≈ 0.3 in all cases. This shows that they are not field red dwarfs\nor red clump giants, and suggests that they may be luminous red stars (Negueruela et al.\n2011). We also used the QIR index to separate early-type stars (cf. Comerón & Pasquali\n2005; Negueruela & Schurch 2007). As they are expected to show QIR ≈ 0.0, we select\nstars with −0.15 ≤ QIR ≤ 0.08 (shown as filled circles and squares in Fig. 3). This range is\nintended to account for the typical errors in 2MASS (generally 0.03 − 0.05 mag in a given\ncolor for stars with KS = 12 − 13) and also include emission-line stars, which typically\nhave QIR . −0.05 (e.g., Negueruela et al. 2007). This selection clearly shows all early-type\nstars in the field to concentrate around (J − KS ) ∼ 0.8, forming an approximately vertical\nsequence with a sharp blue edge at (J − KS ) ∼ 0.7 (Fig. 3).\nWe performed the same analysis for 2MASS data on concentric circles of increasing\nradii around the same position, finding no significant increase in the number of candidate\nmembers. This is in good agreement with the estimation by Maciejewski & Niedzielski\n(2007) of a very concentrated cluster with rcore = 0.′ 7. Extending the search to 6′ , we only\n\n\f–8–\nfind one candidate that seems to fall together with the red clump, both in the Q/KS and\n(J − KS )/KS diagrams. This is 2MASS J21165198+5150410, which we consider a candidate\nmember below (under the name S61).\n\n2.3.\n\nSpectroscopy\n\nWe obtained spectra in the far red of the brightest early-type candidates (identified\nas green squares in Fig. 3) and the seven candidate red luminous stars using the red arm\nof the ISIS double-beam spectrograph, mounted on the 4.2-m William Herschel Telescope\n(WHT) in La Palma (Spain). The instrument was fitted with the R600R grating and the\nRed+ CCD. This configuration covers the 7600 – 9000Å range in the unvignetted section of\nthe CCD with a nominal dispersion of 0.5Å/pixel. Observations were taken during a service\nnight on 26th July 2007 and then completed during a run on 21st August 2007. In July, the\nCCD was unbinned, and a 1.′′ 5 slit was used. In August, the CCD was binned by a factor\n2 in the spectral direction, and a 1.′′ 2 slit was used. In both cases, the resolution element\nis expected to be ∼4 unbinned pixels. This has been checked by measuring the width of\narc lines, which is on average ≈ 2.1Å for both configurations. The resolving power of our\nspectra is therefore R ∼ 4 000.\nA log of these observations is presented in Table 2, where each star is given\nan identification starting with S, and the correspondence with the numbering in the\nphotometry is indicated. In addition to the stars targeted, two other photometric members\nalso fell inside the slit by chance. One of them, #213 (S19 in Fig. 8), is a bright member\nwhich turns out to be a Be star. The other one, #170, is very faint and the spectrum is\nnoisy, simply confirming that it is a B-type star.\nAll spectroscopic data were reduced using the Starlink software packages CCDPACK\n\n\f–9–\n(Draper et al. 2000) and FIGARO (Shortridge et al. 2004). We used standard procedures\nfor bias subtraction and flat-fielding (with internal halogen lamps). The spectra have been\nnormalized to the continuum using DIPSO (Howarth et al. 1998).\n\n3.\n3.1.\n\nResults\n\nObservational HR diagram\n\nWe start the photometric analysis by plotting the V /(B − V ) and V /(U − B) diagrams\nfor all stars in the field. In Figure 4, we can observe that the cluster sequence (as defined\nby the spectroscopic members) is heavily contaminated by what seems to be foreground\npopulation.\n\n3.1.1. The reddening law\nThe first step is determining whether the extinction law in the direction of the field\nis standard. We start by selecting the B-type stars observed spectroscopically. For them,\nwe calculate the ratio X = E(U − B)/E(B − V ) using the calibration of intrinsic colors\nby FitzGerald (1970). For 6 stars, we find rather homogeneous values, with average\nX = 0.67 ± 0.03, quite close to the standard value 0.72.\nWe also use the CHORIZOS (χ2 code for parametrized modeling and characterization\nof photometry and spectroscopy) code developed by Maı́z-Apellániz (2004). This code fits\nsynthetic photometry derived from the spectral distribution of a stellar model convolved\nwith an extinction law (Cardelli et al. 1988) to reproduce the observed magnitudes. We use\nour UBV photometry and JHKS data from 2MASS. This set of photometric values is well\nsuited to find the general shape of the extinction law (Maı́z-Apellániz 2004). On the other\n\n\f– 10 –\nhand, the functional form of the law used by Cardelli et al. (1988), a 7th degree polynomial,\nmay lead to an artificial bumpiness of the extinction law for high values of E(B − V ).\nFor the stars with spectral types, we use as input for CHORIZOS the UBV JHKS\nphotometry and the Teff corresponding to the spectral type derived according to the\ncalibrations of FitzGerald (1970). The output of CHORIZOS is the value of R and the\ncolor excess E(B − V ). For all our stars, the preferred value of R is close to 3.1, with little\ndispersion.\n\n3.1.2. Membership determination\nSince the extinction is close to standard, we can use the classical Q parameter\n(Johnson & Morgan 1952) to estimate the spectral types for all the stars in the field. A first\ntest with the stars with spectral types supports the use of Q = (U − B) − 0.67(B − V ), as\nthe standard value 0.72 gives too early spectral types when compared to the spectroscopic\nones (see below). Even such small difference in the ratio of color excesses, when combined\nwith the high E(B − V ), introduces differences of about two subtypes.\nTaking into account the photometric spectral types and the position of the stars in the\nCMDs, we select the likely members of Be 55. We identify 138 members, all with spectral\ntypes between b3 and a0. We proceed then to estimate the reddening for all the likely\nmembers with CHORIZOS. As input, we use the UBV JHKS photometry and the Teff\ncorresponding to the photometric spectral type, according to the calibrations of FitzGerald\n(1970). We find that the average color excess is E(B − V ) = 1.85 ± 0.16, where the error\nrepresents the dispersion in individual values amongst all 138 members in our photometric\nfield.\nIn Fig. 5, we plot the dereddened MV /(B − V ) diagram for likely members of Be 55.\n\n\f– 11 –\nWe perform a visual fit to the ZAMS from Mermilliod (1981) and from Schmidt-Kaler\n(1982), obtaining a distance modulus DM = 13.0 ± 0.3. In Table 3, we display the values\nof E(B − V ), V0 and photometric spectral types for all photometric members.\n\n3.2.\n\nSpectroscopic analysis\n\nBecause of the high reddening, stars in Berkeley 55 are faint in B, and intermediateresolution spectra in the classification region would require long integrations with large\napertures. Alternatively, we resort to the far red, where the stars are much brighter and\nclassification criteria exist.\n\n3.2.1. Bright red stars\nFigure 6 shows the z-band spectra of the 7 bright red stars in the field preselected as\ncandidate members. Six of them have pretty similar spectra, typical of late-type stars, with\nS5 appearing clearly earlier.\nIn late-type stars, at a given metallicity, the strength of the metallic spectrum increases\nwith luminosity (Ginestet et al. 1994; Carquillat et al. 1997). Luminosity criteria at\nresolutions similar to ours are discussed in Negueruela et al. (2011). In particular, the\nstrength of the Ca ii triplet is strongly correlated with luminosity (Dı́az et al. 1989; Zhou\n1991), though it also depends on metallicity and spectral type. The intensity of the Ca ii\ntriplet lines (see measurements in Table 4) shows without doubt that all our 7 objects are\nluminous stars.\nThe O i 7774Å triplet is seen in stars earlier than late G. Of all our bright red stars,\nS5 is the only one displaying this feature. On the other hand, none of our stars displays\n\n\f– 12 –\nTiO bands in the spectral range measured, showing that they are earlier than ∼M1 (e.g.,\nNegueruela et al. 2011). For luminous stars in the G5–K5 range, the ratio between the\nTi i 8683Å and the Fe i 8679Å lines is very sensitive to temperature (Carquillat et al. 1997).\nBy using this criterion, we find all the stars to lie between G8 and K4, with the exception\nof S61, which is slightly later, though it is still earlier than M1, as the TiO bandhead at\n8660Å is hardly detectable.\nFor spectral types G–K , Dı́az et al. (1989) find that stars with a combined equivalent\nwidth (EW) for the two strongest Ca ii lines, EW(Ca ii 8542+Ca ii 8662)>9Å are definitely\nsupergiants, independently of metallicity or spectral type, though some supergiants may\npresent slightly lower values of EW. This has recently been re-assessed for a larger sample\n(Negueruela et al. 2011). Attending to all the criteria and to direct comparison to the\nstandards, S1 and S2 fall clearly in the supergiant region, though both have low luminosity.\nAll the other objects lie in the region where both supergiants and bright giants are found.\nAttending to their morphology, we classify them as bright giants, with S4 closer to being a\nsupergiant than the others. The spectral types finally derived are listed in Table 5.\nIn the case of S5, comparison to MK standards observed at similar resolution (e.g.,\nCenarro et al. 2001) suggests it is an F8 supergiant. The combined EW of the two strongest\nCa ii lines is close to 11Å, but the Paschen lines are still present at this spectral type and\nthus Pa 13 and Pa 15 must be blended with Ca ii 8662Å and Ca ii 8542Å, respectively.\nBy measuring the EWs of Pa 12, Pa 14 and Pa 17, we estimate that they contribute at\nmost 1.5Å to the blend. Therefore S5 is a supergiant according to all calibrations of the\nCa ii triplet (Dı́az et al. 1989; Mallik 1997; Zhou 1991). The calibration of MV against\nthe EW of the O i 7774Å triplet (Arellano Ferro et al. 2003) indicates for this object\nMV = −3.7, with a large uncertainty. This is consistent with the expectations for a such a\nsupergiant, especially if it is moving redwards for the first time. In view of this, we accept\n\n\f– 13 –\nthe morphological classification F8 Ib. This object must thus lie on the instability strip.\n\n3.2.2. Blue stars\nFigure 7 shows spectra of stars with intrinsically blue spectra, while Fig. 8 shows\nthe spectra of two stars with emission lines. The brightest early-type objects are S7 and\nS9. The z-band is not rich in classification features for B-type stars (Andrillat et al.\n1995; Munari & Tomasella 1999). Moderately accurate spectral types can be achieved for\nsupergiants, but stars close to the main sequence are poorer in spectral features and can\nonly receive approximate classifications (Negueruela et al. 2010a). Apart from the strength\nand width of Paschen lines, the main criterion is the presence of He i lines, which are only\nmoderately strong in supergiants and are hardly seen in mid and late main-sequence B-type\nstars. All the spectra displayed are clearly dominated by broad Paschen lines and are\ntherefore B-type stars of low or moderate luminosity. The only exception is S9, which looks\nlike an A-type supergiant. However, the presence of O i 8448Å in emission betrays this as\na Be star. Some Be shell stars have absorption spectra (due to the circumstellar disk seen\nclose to edge on) that strongly resemble A-type supergiants (Andrillat et al. 1988).\nStar S7 has very well defined Paschen lines and resembles rather closely the B5 II star\nin Fig. 7, though it has lower luminosity. The narrow O i 8448Å indicates a slow rotator\nand most likely a giant. This is confirmed by the sharpness of the Paschen lines (compare to\nthe B3 V star). We estimate a spectral type B3–4 III. S16 is very similar, though it rotates\nfaster or has a lower luminosity. S10 is a fast rotator, but is likely a giant as well, as a weak\nHe i 8779Å seems to be present. S12, S13 and S15 are closer to the main sequence. The fact\nthat O i 8448Å is weak compared to Paschen 18 places them close to B3. The spectrum of\nS19 (Fig. 8) is very noisy, but Oi 8448Å is clearly in emission. Therefore it is a Be star.\nAccording to Andrillat et al. (1988), late Be stars do not show this line in emission, but\n\n\f– 14 –\nonly filled-in. Therefore this star is B5 Ve or earlier. Based on the same criterion and its\nbrightness, S9 is likely to be a shell star of spectral type similar to S7. Finally, S8 looks\nlater than all the others, though its reddening is similar to those of the other B stars. A\nsummary of estimated spectral types is given in Table 5.\nCaron et al. (2003) developed a method to classify B-type stars by comparing the EWs\nof the Paschen lines. Application of those criteria suggest slightly later spectral types for\nour stars, though not all criteria suggest the same result (something expected, as they are\nonly approximate). Following them, S7 would be ∼B5 III, S8 and S10 would be ∼B8 III,\nand the rest of the stars would be ∼B5 V. These small differences are in all likelihood due to\nthe continuum determination, which is somewhat subjective, and in the case of the Paschen\nlines (with their very broad wings) may depend to some degree on SNR and resolution.\n\n3.3.\n\nInfrared extinction\n\nFrom the spectral types derived, we can calculate individual infrared reddenings. For\nthe red (super)giants, we use the calibration of Straižys & Lazauskaitė (2009), which uses\n2MASS colors. For the blue stars, we use the same calibration, assuming that giants\nhave the same colors as main-sequence stars. For the F supergiant, we use the value\nfrom Koornneef (1983). The values derived are shown in Table 5. The reddening seems\nto be moderately variable across the face of the cluster. The values for the supergiants\nshow a higher dispersion than those of the blue stars, but the average reddening for the\n6 red (super)giants (excluding the outlier S61) is E(J − KS ) = 0.89 ± 0.07 (the error is\nthe standard deviation), while the average for 7 B-type stars without emission lines is\nE(J − KS ) = 0.85 ± 0.04, fully compatible within their errors. Using the calibrations of\nWinkler (1997) or Wegner (1994) for the blue stars produces slightly different individual\nvalues, but compatible averages.\n\n\f– 15 –\nComparison of the E(B − V ) (Table 3) and E(J − KS ) excesses for these objects\n(Table 5) confirms that the extinction law in this direction is close to the R = 3.1 galactic\naverage, for which E(B − V ) ≈ 2 × E(J − K). It is also interesting to note that the B-type\nstars spectroscopically observed consistently have E(B − V ) below the cluster average.\nThis suggest that some of the faint late-B stars taken as photometric members could be\nbackground objects.\n\n3.4.\n\nCluster age\n\nThe dereddened CMD for Be 55 (Fig. 5) shows that stars brighter than MV ≈ −1 start\ndeviating from the ZAMS. This absolute magnitude corresponds to spectral type B4 V (e.g.,\nTurner 1980), in good agreement with the determination of spectral types, which indicate\nthat the brightest B-type stars are B3–6 III-IV objects. With such a turn-off, the cluster is\nexpected to have an age & 40 Myr. We can improve on this value by fitting isochrones in\nthe different observational CMDs to the position of the red stars and the turn-off.\nA fundamental issue is the correct determination of color excesses at such high\nreddenings. Figure 9 shows the observational V /(U − B) diagram for the cluster together\nwith isochrones for log t = 7.6 (40 Myr) and log t = 7.7 (50 Myr) from Marigo et al. (2008).\nBoth isochrones fit well the position of the main sequence and the turn-off. S7 appears\nas a mild blue straggler, which is consistent with its spectral type (a B3–4 III giant when\nthe turn-off is at B4 V). S9 may also be a blue straggler, but shell stars are known to have\nanomalous (U − B) colors. The isochrones have been reddened following the procedure\ndescribed in Girardi et al. (2008), which takes into account color effects for late-type stars.\nIn spite of this, the position of the K (super)giants does not fit the red clump very well for\nany of the two isochrones. This is likely due to the difficulty in reproducing the extinction\nlaw with the polynomial approximation of Cardelli et al. (1988).\n\n\f– 16 –\nFigure 10 shows the KS /(J − KS ) CMD for cluster members, with photometry from\n2MASS. Isochrones from Marigo et al. (2008) for the same ages are shown, reddened by\nE(J − KS ) = 0.85, the value found for the blue spectroscopic members. All members\nselected from their UBV colors fall to the right of the isochrones, confirming that this\nexcess corresponds to the less reddened members. Some likely members seem to have much\nhigher color excesses, suggesting that they are either Be stars or background B-type stars\n(though this is not generally supported by their photometric spectral types). In this CMD,\nthe K (super)giants occupy positions in very good agreement with the 50 Myr isochrone.\nThe bright star S61, situated ∼ 4.′ 7 from the cluster core falls together with the red\n(super)giants in this CMD. However, its position does not fit well with its spectral type,\nlater than all the other evolved stars. As seen in Table 5, its reddening is rather lower than\nthat of confirmed members. Its (B − V ) magnitude, taken from Maciejewski & Niedzielski\n(2007), is compatible with the low reddening. Therefore this object could be a foreground\nstar as well as a cluster member with much lower reddening. This should be checked via\nradial velocity measurements3 .\n\n4.\n\nDiscussion\n\nWe have presented spectroscopy of a sizable sample of stars in the open cluster\nBerkeley 55, revealing a population of 7 low-luminosity supergiants or bright giants (one of\nthem, not a certain member), 4 mid-B giants and a main sequence starting around B4 V.\n3\n\nEven though our spectra were not taken to measure radial velocities, direct cross-\n\ncorrelation between the spectra of S1 and S61 (the two objects observed with the same\nconfiguration) suggests that their radial velocities are very similar\n\n\f– 17 –\n4.1.\n\nCluster parameters\n\nOnly two previous studies of the cluster have been published. Maciejewski & Niedzielski\n(2007) derive an age of ∼ 315 Myr. Tadross (2008) used their result to calibrate his fitting\nprocedure and therefore derives a similar age of 300 Myr, from a fit to the 2MASS data\nalone. This age is completely incompatible with the observed population, as stars earlier\nthan B5 are only seen in clusters younger than 100 Myr. Clusters with ∼ 100 Myr have stars\nof spectral type ∼B6 around the main-sequence turn-off (e.g., NGC 7790, Matthews et al.\n1995; Berkeley 58, Turner et al. 2008).\nThe difference between our age determination and that of Maciejewski & Niedzielski\n(2007) is almost certainly due to the identification of the evolved population. The\ndecontaminated V /(B − V ) in Maciejewski & Niedzielski (2007) does not show a clump of\nred stars, as in our Fig. 4. Some of the (super)giants seem to be blended in their images\nand do not appear in their original photometry. The others are not conspicuous when a\nwide field is considered, because of contamination by field interlopers with similar (B − V )\ncolor. The stars forming this clump, however, cannot be overlooked when the infrared data\nare considered. S1 is the brightest star in KS within 10′ of the cluster center, and there\nare only 5 field stars with KS magnitudes comparable to the 7 red (super)giants. The 7\ncandidate members form a clearly separated clump in the (J − KS )/KS , H − KS /KS and\nQ/KS diagrams, and have similar (and unusual) spectral types. Though accurate radial\nvelocities will be needed to confirm individual memberships, there can be no doubt that\nthey represent the population of evolved stars in the cluster. The small systematic offset in\n(B − V ) between our photometry and that of Maciejewski & Niedzielski (2007) is unlikely\nto have biased their age determination. It is simply very difficult to obtain an accurate fit\nwhen photometry in only two bands is available.\nAt Galactic longitude l = 93.◦ 0, a distance ∼ 4 kpc (corresponding to our DM = 13.0)\n\n\f– 18 –\nseems compatible with tracers of the Perseus arm, though some Galactic models suggest\na higher distance for this feature. Spiral tracers in this direction are scarce. NGC 7067\n(l = 91.◦ 2) has distance estimates of 3.6 kpc (Yadav & Sagar 2004) and 4.4 kpc (Hassan\n1973). NGC 7128 (l = 97.◦ 3), with DM = 13.0 ± 0.2 (4 kpc), is another likely tracer at\nsome distance from Be 55 (Balog et al. 2001).\nAs the age of Berkeley 55 is ∼ 50 Myr, the red stars in the cluster should have initial\nmasses M∗ & 7.0 M⊙ (Marigo et al. 2008), or slightly higher if they started their lives\nrotating quickly (cf. Meynet & Maeder 2000). Such stars define the boundary between\nintermediate-mass and massive stars, and therefore can provide important constraints for\nstellar evolution models. Milky Way clusters with similar ages and rich populations of\nRSGs (or bright giants) are relatively scarce. NGC 6649 (∼ 50 Myr; Turner 1981) with one\nCepheid and four red (super)giants is one of the few examples. NGC 6664 (also ∼50 Myr;\nSchmidt 1982) has a similar population, but is less well studied. As a consequence, the\nsample of Galactic RSGs studied by Levesque et al. (2005) contains almost no stars in\nthe 6 M⊙ < M∗ < 10 M⊙ range. The presence of 7 candidate evolved members makes\nBerkeley 55 a very suitable target to study the physical effects operating during the He-core\nburning phase of intermediate-mass stars.\n\n4.2.\n\nThe lowest mass for a supergiant\n\nAs mentioned in the introduction, the separation between red supergiants and red\nbright giants is morphological, and does not coincide with the separation between high-mass\nand low-mass stars. Of course, making such a distinction necessarily implies dividing\n\n\f– 19 –\na continuum into artificial boxes4 . In spite of that, defining an age limit after which\nclusters do not contain RSGs seems interesting, as new clusters are being discovered\nwhere high extinction renders only the bright red stars accessible for spectroscopy (e.g.,\nNegueruela et al. 2010b; Davies et al. 2011).\nLooking at the lists of yellow evolved stars in clusters from Harris (1976) or Sowell\n(1984, 1987), it is difficult to set an age limit after which Ib supergiants are not seen. A\nfew objects have been classified as K Ib supergiants in clusters & 100 Myr old, but in all\ncases there are alternative lower-luminosity classifications based on more recent data (for\nexample, star 164 in NGC 129, classified K2.5 II-III by Keenan & McNeil 19895 ; or star 110\nin NGC 2516, classified M1.5 IIa by Keenan & Pitts 1985). Most classical Cepheids appear\nas F/G Ib supergiants. Many clusters containing Cepheids are sparsely populated and have\nthe Cepheid as only supergiant (e.g., Turner 1996). In clusters with larger populations, the\nratio of F/G supergiants to later spectral types is very variable. For example, NGC 7790\ncontains three F-type Cepheids, but no red (super)giants, while NGC 6067 (with two\nCepheid members) contains a large number of red giants and supergiants (Mermilliod 1987).\nIf we consider a number of clusters for which accurate ages in the range of interest\nhave been derived through careful photometric analysis or equivalent methods, we find by\ndecreasing age, that NGC 2516 (∼ 140 Myr), which has no Cepheids, contains four bright\nred giants, with luminosity classes II or III (Keenan & Pitts 1985; González & Lapasset\n2000). IC 4725, which is ∼ 90 Myr old, contains one Cepheid supergiant and two class II\nred giants (Keenan & Pitts 1985; Mermilliod 1987). Berkeley 82, with an age ∼ 70 Myr\n4\n\nIt should be noted that many authors classically count luminosity class II objects as\n\nsupergiants\n5\n\nThis star seems not to be a member, based on its radial velocity (Memilliod et al. 2008),\n\nthough it was considered a member for a long time (see references in Turner 1992).\n\n\f– 20 –\ncontains two yellow bright stars with spectral types G2 II/Ib and K2 II (Forbes 1986),\nwhile Harvard 20 contains a G5 Ib supergiant at ∼ 60 Myr (Turner 1980). On the other\nhand, NGC 6664, with an age ∼ 50 Myr, contains several objects classified as bright\ngiants by Harris (1976). Finally, NGC 6067 contains red stars with luminosity classes II\nand Ib, leading Mermilliod (1987) to doubt its estimated age & 100 Myr, which is also in\ncontradiction with the observed period of its fundamental-mode Cepheid member V340 Nor.\nIn view of this, it seems that red stars close to the clump position are classified as K\nsupergiants in clusters up to 50–60 Myr, while some stars are classified as such in somewhat\nolder clusters. No cluster older than ∼ 100 Myr seems to contain a bona-fide K supergiant.\nStars with F and G spectral types, such as Cepheids, are classified as supergiants at older\nages, e.g., SZ Tau (F5-9 Ib) in NGC 1647 (∼ 150 Myr; Turner 1992).\nThe classifications derived for stars in Be 55 seem to confirm these trends, with stars\non both sides of the divide at an age ≈ 50 Myr.\n\nThis research is partially supported by the Spanish Ministerio de Ciencia e Innovación\n(MICINN) under grants AYA2008-06166-C03-03, AYA2010-21697-C05-05 and CSD2006-70,\nand by the Generalitat Valenciana (ACOMP/2010/259).\nThe WHT is operated on the island of La Palma by the Isaac Newton Group in\nthe Spanish Observatorio del Roque de Los Muchachos of the Instituto de Astrofı́sica de\nCanarias. The July 2007 observations were taken as part of the service program (program\nSW2007A63).\nBased on observations made with the Nordic Optical Telescope, operated on the island\nof La Palma jointly by Denmark, Finland, Iceland, Norway, and Sweden, in the Spanish\nObservatorio del Roque de los Muchachos of the Instituto de Astrofı́sica de Canarias.\nSome of the data presented here have been taken using ALFOSC, which is owned by the\n\n\f– 21 –\nInstituto de Astrofisica de Andalucia (IAA) and operated at the Nordic Optical Telescope\nunder agreement between IAA and the NBIfAFG of the Astronomical Observatory of\nCopenhagen\nThis research has made use of the Simbad database, operated at CDS, Strasbourg\n(France) and of the WEBDA database, operated at the Institute for Astronomy of the\nUniversity of Vienna. This publication makes use of data products from the Two Micron\nAll Sky Survey, which is a joint project of the University of Massachusetts and the Infrared\nProcessing and Analysis Center/California Institute of Technology, funded by the National\nAeronautics and Space Administration and the National Science Foundation.\nFacilities: WHT(ISIS), NOT(ALFOSC)\n\n\f– 22 –\n\nTable 1: Log of the photometric observations taken at the NOT on June 2010 for Berkeley\n55.\nBerkeley 55 RA = 21h 16m 59.9s DEC = +51 ◦ 45′ 59.′′ 0\n(J2000)\n\n(J2000)\n\nExposure times (s)\nFilter\n\nLong times\n\nShort times\n\nU\n\n900\n\n250\n\nB\n\n200\n\n60\n\nV\n\n40\n\n10\n\n\f– 23 –\n\nFig. 1.- Finding chart for stars with photometry in the field of Berkeley 55. The image\nis one of our V -band frames. XY positions are listed in Table 6, where they are correlated\nto RA and DEC. Stars inside the rectangle (which approximately defines the cluster core)\nare marked in Fig. 2. Each star is identified by the nearest marker in the same color as the\ncircle around it.\n\n\f– 24 –\n\nFig. 2.- Finding chart for stars with photometry in the central part of Berkeley 55. The\nimage is one of our V -band frames. XY positions are listed in Table 6, where they are\ncorrelated to RA and DEC. Each star is identified by the nearest marker in the same color\nas the circle around it.\n\n\f– 25 –\n\n6\n\n8\n\n10\n\nKs\n12\n\n14\n\n16\n0\n\n0.5\n\n1\n\n1.5\n\n2\n\n2.5\n\n3\n\n(J-Ks)\nFig. 3.- KS /(J − KS ) diagram for all stars in 2MASS within 3′ of the arbitrarily defined\ncenter of Be 55. Stars selected as early-type stars based on their QIR index are marked\nas filled blue circles or green squares (if observed spectroscopically). The orange diamonds\nidentify the clump of F–K supergiants.\n\n\f– 26 –\n\nTable 2: Log of spectroscopic observations.\nStar Phot1 Exposure\n\nDate\n\nTime (s)\n\nTime\n\nSNR2\n\n(UT)\n\nS13\n\n−\n\n200\n\n21 Aug 2007 01:07\n\n300\n\nS2\n\n196\n\n400\n\n26 Jul 2007\n\n00:43\n\n340\n\nS3\n\n163\n\n400\n\n26 Jul 2007\n\n00:43\n\n220\n\nS4\n\n110\n\n400\n\n26 Jul 2007\n\n01:12\n\n260\n\nS5\n\n107\n\n400\n\n26 Jul 2007\n\n01:12\n\n310\n\nS6\n\n145\n\n400\n\n26 Jul 2007\n\n00:58\n\n330\n\nS61\n\n−\n\n200\n\n21 Aug 2007 01:13\n\n370\n\nS7\n\n94\n\n400\n\n26 Jul 2007\n\n01:12\n\n140\n\nS8\n\n99\n\n1000\n\n21 Aug 2007 01:27\n\n110\n\nS9\n\n198\n\n400\n\n26 Jul 2007\n\n00:58\n\n110\n\nS10\n\n83\n\n1000\n\n21 Aug 2007 01:27\n\n140\n\nS12\n\n113\n\n600\n\n26 Jul 2007\n\n01:24\n\n90\n\nS13\n\n129\n\n600\n\n26 Jul 2007\n\n01:24\n\n90\n\nS15\n\n159\n\n1000\n\n21 Aug 2007 02:01\n\n90\n\nS16\n\n133\n\n1000\n\n21 Aug 2007 02:01\n\n100\n\n1\n\nCross-correlation with numbering system in Table 7.\n\n2\n\nThe SNR has been estimated for the B-type stars from the RMS of fits to continuum regions. In the red\nsupergiants, where there are no spectral windows free of lines, it is an extrapolation based on the count rate.\nThe SNR is for each 0.5Å binned pixel.\n\n3\n\n2MASS J21165840+5143262, saturated in our photometry.\n\n\f– 27 –\n\nFig. 4.- V /(B −V ) diagram for all stars in the field of Be 55. Filled circles represent B-type\nstars observed spectroscopically and filled squares are supergiant stars.\n\n\f– 28 –\n\nFig. 5.- Dereddened MV /(B − V ) diagram for likely members of Be 55. The dashed line\nshows the ZAMS from Mermilliod (1981), and the solid line, the ZAMS from Schmidt-Kaler\n(1982). Filled circles indicate stars with spectra. The spectral types of the brightest members\nare shown. Note that the Be shell star S9 is not selected as a likely member because of its\nanomalous colors.\n\n\f– 29 –\n\nTable 3: Photometry and reddening for stars selected as likely members of Berkeley 55a .\nStar\n\na\n\nE(B − V )\n\nσE(B−V )\n\nV0\n\n1\n\n1.67\n\n0.03\n\n13.26 0.06\n\nb8\n\n4\n\n2.15\n\n0.02\n\n13.36 0.07\n\nb7\n\n5\n\n1.76\n\n0.02\n\n14.27 0.11\n\nb9\n\n6\n\n1.74\n\n0.03\n\n12.53 0.04\n\nb8\n\n7\n\n1.99\n\n0.02\n\n13.32 0.09\n\nb8\n\n8\n\n1.89\n\n0.02\n\n13.51 0.07\n\nb9\n\n10\n\n1.94\n\n0.02\n\n13.52 0.07\n\nb8\n\n...\n\n...\n\n...\n\n...\n\nσV0\n\n...\n\nPhotometric spectral type\n\n...\n\nThe two known Be stars, S9 (#199) and S19 (#213) have been left out, as their intrinsic color cannot be\ncalculated.\n\n\f– 30 –\n\nTable 4: Measured equivalent widths1 (in Å) for the main quantitative luminosity indicators\nfor red luminous stars in Be 55.\nStar Ca ii 8498.0Å Ca ii 8542.1Å Ca ii 8662.1 Blend 8468Å\n\n1\n\nS1\n\n3.2\n\n5.2\n\n4.0\n\n1.4\n\nS2\n\n3.0\n\n5.3\n\n4.0\n\n1.3\n\nS3\n\n2.7\n\n4.9\n\n3.6\n\n1.0\n\nS4\n\n3.6\n\n5.0\n\n3.6\n\n1.2\n\nS52\n\n2.9\n\n6.0\n\n4.9\n\n−\n\nS6\n\n2.8\n\n4.9\n\n3.5\n\n1.2\n\nS61\n\n2.4\n\n4.7\n\n3.7\n\n1.1\n\nBecause of the difficulty in determining the continuum in red stars, uncertainties may be estimated at ±0.3Å\nfor each Ca ii line and ±0.1Å for the 8468Å blend.\n\n2\n\nNote that the values for S5 must include the blended Paschen lines.\n\n\f– 31 –\n\nFig. 6.- z-band spectra of seven bright red stars in the field of Be 55, together with two\nreference stars from the Indo-US library (Valdes et al. 2004). The main temperature criterion\nfor G–K luminous stars in this range is the Ti i 8683Å/Fe i 8679Å ratio. The strength of\nthe metallic spectrum is the main criterion to determine luminosity at a given spectral\ntype, with the Ti i/Fe i blend at 8468Å showing a pronounced dependence. S5 has a much\nearlier spectral type and the Paschen lines are still seen. The top spectrum corresponds to\nHD 207089; the bottom one, to HD 204867 (both classified in Keenan & McNeil 1989).\n\n\f– 32 –\n\nTable 5: Derived parameters for stars with spectroscopy.\nID\n\nSpectral\n\nKS 1\n\n(J − KS )\n\n(J − K)0\n\nE(J − KS )\n\ntype2,3\nS1\n\nK1 Ib\n\n6.25\n\n1.66\n\n0.68\n\n0.98\n\nS2\n\nK0 Ib\n\n6.65\n\n1.59\n\n0.63\n\n0.96\n\nS3\n\nG8 II\n\n7.80\n\n1.47\n\n0.56\n\n0.91\n\nS4\n\nK0 Ib-II\n\n7.33\n\n1.47\n\n0.63\n\n0.84\n\nS5\n\nF8 Ib\n\n7.71\n\n1.21\n\n0.35\n\n0.86\n\nS6\n\nK4 II\n\n6.48\n\n1.70\n\n0.90\n\n0.80\n\nS61\n\nM0.5 II\n\n6.15\n\n1.55\n\n1.04\n\n0.51\n\nS7\n\nB3–4 III (b4)\n\n10.47\n\n0.68\n\n−0.15\n\n0.83\n\nS8\n\nB6–8 III (b5)\n\n11.52\n\n0.73\n\n−0.08\n\n0.81\n\nS9\n\nB3–4 IIIshell\n\n10.63\n\n0.73\n\n−\n\n−\n\nS10 B5–7 III–IV (b5)\n\n11.20\n\n0.78\n\n−0.10\n\n0.88\n\nS12\n\nB3–5 IV–V (b4)\n\n11.50\n\n0.74\n\n−0.13\n\n0.87\n\nS13\n\nB3–5 IV–V (b5)\n\n11.62\n\n0.74\n\n−0.13\n\n0.87\n\nS15\n\nB4–5 IV–V (b5)\n\n11.95\n\n0.75\n\n−0.12\n\n0.87\n\nS16 B5–7 III–IV (b5)\n\n11.56\n\n0.67\n\n−0.12\n\n0.79\n\n1\n\nThe typical uncertainty of the photometry is 0.02 mag in KS and 0.03 mag in (J − KS ).\n\n2\n\nThe whole range of spectral types and luminosity classes compatible with the spectral information available\nis shown.\n\n3\n\nPhotometric spectral types are given in parentheses.\n\n\f– 33 –\n\nFig. 7.- z-band spectra of a sample of intrinsically blue stars in Be 55, together with\ntwo reference stars from the Indo-US library (Valdes et al. 2004). The top spectrum is\nHD 164353. The bottom spectrum is HD 120315.\n\n\f– 34 –\n\nFig. 8.- z-band spectra of two Be stars in Be 55. S9 is a shell star and the second brightest\nblue star in the cluster.\n\n\f– 35 –\n\nFig. 9.- V /(U − B) diagram for likely members of Berkeley 55. Filled circles are confirmed\nspectroscopic members, while open circles are likely (photometric) members. Two isochrones\nof Marigo et al. (2008) are shown, both reddened by E(B − V ) = 1.85 and displaced to\nDM = 13.0. The isochrones have been reddened taking into account color effects, following\nthe procedure described in Girardi et al. (2008).\n\n\f– 36 –\n\nFig. 10.- KS /(J − KS ) diagram for for likely members of Berkeley 55. Filled circles are\nconfirmed spectroscopic members, while open circles are likely (photometric) members. Two\nisochrones of Marigo et al. (2008) are shown, both reddened by E(J − KS ) = 0.85 and\ndisplaced to DM = 13.0.\n\n\f– 37 –\nREFERENCES\nAndrillat, Y., Jaschek, M., & Jaschek, C. 1988, A&AS, 72, 129\nAndrillat, Y., Jaschek, C., & Jaschek, M. 1995, A&AS, 112, 475\nArellano Ferro, A., Giridhar, S., & Rojo Arellano, E. 2003, RMxAA, 39, 3\nBalog, Z., Delgado, A. J., Moitinho, A., Fürész, G., Kaszás, G., Vinkó, J., & Alfaro, E. J.\n2001, MNRAS, 323, 872\nCardelli, J.A., Clayton, G.C., & Mathis, J.S. 1988, ApJL, 329, 33\nCaron, G., Moffat, A.F.J., St-Louis, N., Wade, G.A., & Lester, J.B. 2003, AJ, 126, 1415\nCarquillat, J.M., Jaschek, C., Jaschek, M., & Ginestet, N. 1997, A&AS, 123, 5\nCenarro, A. J., Cardiel, N., Gorgas, J., Peletier, R.F., Vazdekis, A., & Prada, F. 2001,\nMNRAS, 326, 959\nChiosi, C., Bertelli, G., & Bressan, A. 1992, ARA&A 30, 235\nComerón, F., & Pasquali, A. 2005, A&A, 430, 541\nDavies, B., Bastian, N., Gieles, M., Seth, A.C., Mengel, S., & Konstantopoulus, S. 2011,\nMNRAS, 411, 1386\nDı́az, A.I., Terlevich, E., & Terlevich, R., 1989, MNRAS, 239, 325\nDraper, P.W., Taylor, M., & Allan, A. 2000, Starlink User Note 139.12, R.A.L.\nFitzgerald, M.P. 1970, A&A, 4, 234\nForbes, D. 1986, PASP, 98, 218\nGinestet, N., Carquillat, J.M., Jaschek, M., & Jaschek, C. 1994, A&AS, 108, 359\n\n\f– 38 –\nGirardi, L., et al. 2008, PASP, 120, 583\nGonzález, J.F., & Lapasset, E. 2000, AJ, 119, 2296\nHarris, G.L.H. 1976, ApJS, 30, 451\nHassan, S.M. 1973, A&AS, 9, 261\nHowarth, I., Murray, J., Mills, D., & Berry, D.S. 1998, Starlink User Note 50.21, R.A.L.\nJeffries, R.D. 1997, MNRAS, 288, 585\nJohnson, H.L., & Morgan, W.W. 1952, ApJ, 117, 313\nKeenan, P.C., & Pitts, R.E. 1985, PASP, 97, 297\nKeenan, P.C., & McNeil, R.C. 1989, ApJS, 71, 245\nKoornneef, J. 1983, A&A, 128, 84\nLandolt, A.U. 1992, AJ, 104, 340\nLevesque, E.M., Massey, P., Olsen, K.A.G., Plez, B., Josselin, E., Maeder, A., & Meynet,\nG. 2005, ApJ, 628, 973\nMaciejewski, G. & Niedzielski, A. 2007, A&A, 467, 1065\nMaı́z-Apellániz, J. 2004, PASP, 116, 859\nMallik, S.V., 1997, A&AS, 124, 359\nMarigo, P., Girardi, L., Bressan, A., Groenewegen, M.A.T., Silva, L., & Granato, G.L.\n2008, A&A, 482, 883\nMatthews, J.M., Gieren, W.P., Mermilliod, J.-C., & Welch, D.L. 1995, AJ, 110, 2280\n\n\f– 39 –\nMermilliod, J.-C. 1981, A&A, 97, 235\nMermilliod, J.-C. 1987, A&AS, 70, 389\nMermilliod, J.-C., Mayor, M., & Udry, S. 2008, A&A, 485, 303\nMeynet, G., & Maeder, A. 2000, A&A, 361, 101\nMowlavi, N., & Forestini, M. 1994, A&A, 282, 843\nMunari, U., & Tomasella, L. 1999, A&AS, 137, 521\nNegueruela, I., & Schurch, M.P.E. 2007, A&A, 461, 431\nNegueruela, I., Marco, A., Israel, G.L., & Bernabeu, G. 2007, A&A, 471, 485\nNegueruela, I., Clark, J.S., & Ritchie, B.W. 2010a, A&A, 516, A78\nNegueruela, I., González-Fernández, C., Marco, A., Clark, J.S., & Martı́nez-Núñez, S.\n2010b, A&A, 513, A74\nNegueruela, I., González-Fernández, C., Marco, A., & Clark, J.S. 2011, A&A, 528, A59\nPoelarends, A.J.T., Herwig, F., Langer, N., & Heger, A. 2008, ApJ, 675, 614\nSalasnich, B., Bressan, A., & Chiosi, C. 1999, A&A, 342, 131\nShortridge, K., et al. 2004, Starlink User Note 86.21, R.A.L.\nSowell, J.R. 1984, ApJS, 55, 455\nSowell, J.R. 1987, ApJS, 64, 241\nSchmidt, E.G. 1982, AJ, 87, 1197\nSchmidt-Kaler, T., 1982, Landolt-Börnstein, N.S. VI, 2b\n\n\f– 40 –\nSkrutskie, M.F., et al. 2006, AJ, 131, 1163\nSmartt, S.J. 2009, ARA&A, 47, 63\nSmartt, S.J., Eldridge, J.J., Crockett, R.M., & Maund, J.R. 2009, MNRAS, 395, 1409\nSmith, N., Li, W., Filippenko, A.V., & Chornock, R. 2011, MNRAS, in press\nStetson, P.B. 1987, PASP, 99, 191\nStraižys, V., & Lazauskaitė, R. 2009, Balt. Astr., 18, 19\nTadross, A.L. 2008, MNRAS, 389, 285\nTurner, D.G. 1980, PASP, 92, 840\nTurner, D.G. 1981, AJ, 86, 222\nTurner, D.G. 1992, AJ, 104, 1865\nTurner, D.G. 1996, JRASC, 90, 82\nTurner, D.G., Mandushev, G.I., & Forbes, D. 1994, AJ, 107, 1796\nTurner, D.G., et al. 2008, MNRAS, 388, 444\nValdes, F., Gupta, R., Rose, J.A., Singh, H.P., & Bell, D.J. 2004, ApJS, 152, 251\nWegner, W. 1994, MNRAS, 270, 229\nWeidemann, V. 2000, A&A, 363, 647\nWinkler, H. 1997, MNRAS, 287, 481\nYadav, R.K.S., & Sagar, R. 2004, MNRAS, 349, 1481\nZhou, X. 1991, A&A, 248, 367\n\n\f– 41 –\n\nThis manuscript was prepared with the AAS LATEX macros v5.2.\n\n\f– 42 –\n\nTable 6: (X, Y ) position on the map of all stars with UBV photometry, together with their\n2MASS identification and their coordinates.\nStar X (Pixels)\n\nY (Pixels)\n\nRA (J2000) Dec (J2000)\n\nName (2MASS)\n\n1\n\n15.28\n\n1446.924\n\n319.327021\n\n51.790562\n\n21171848+5147260\n\n2\n\n21.685\n\n1886.522\n\n319.326885\n\n51.813904\n\n21171845+5148500\n\n3\n\n30.195\n\n943.208\n\n319.3254\n\n51.763935\n\n21171809+5145501\n\n4\n\n31.361\n\n531.363\n\n319.325026\n\n51.742191\n\n21171800+5144318\n\n5\n\n33.537\n\n991.763\n\n319.325118\n\n51.766521\n\n21171802+5145594\n\n6\n\n43.785\n\n1622.479\n\n319.324686\n\n51.799866\n\n21171792+5147595\n\n...\n\n...\n\n...\n\n...\n\n...\n\n...\n\nTable 7: Photometry for stars in Berkeley 55.\nStar\n\nV\n\nσV\n\n(B − V )\n\nσ(B−V )\n\n(U − B)\n\nσ(U −B)\n\nn\n\n1\n\n18.218 0.038\n\n1.541\n\n0.028\n\n0.842\n\n0.013\n\n2\n\n2\n\n18.086 0.040\n\n1.527\n\n0.030\n\n1.433\n\n0.075\n\n2\n\n3\n\n19.400 0.024\n\n1.768\n\n0.030\n\n1.361\n\n0.080\n\n1\n\n4\n\n19.612 0.000\n\n1.988\n\n0.012\n\n1.037\n\n0.090\n\n2\n\n5\n\n19.274 0.011\n\n1.732\n\n0.034\n\n0.976\n\n0.024\n\n2\n\n6\n\n17.898 0.037\n\n1.670\n\n0.024\n\n0.846\n\n0.019\n\n2\n\n7\n\n19.769 0.029\n\n1.912\n\n0.040\n\n1.027\n\n0.091\n\n1\n\n8\n\n19.145 0.006\n\n1.810\n\n0.033\n\n1.114\n\n0.060\n\n2\n\n9\n\n16.891 0.021\n\n1.393\n\n0.041\n\n0.580\n\n0.011\n\n4\n\n...\n\n...\n\n...\n\n...\n\n...\n\n...\n\n...\n\n...\n\n\f"}