{"id": "http://arxiv.org/abs/0801.4931v1", "guidislink": true, "updated": "2008-01-31T17:36:08Z", "updated_parsed": [2008, 1, 31, 17, 36, 8, 3, 31, 0], "published": "2008-01-31T17:36:08Z", "published_parsed": [2008, 1, 31, 17, 36, 8, 3, 31, 0], "title": "A Simple Proof of the Kochen-Specker Theorem on the Problem of Hidden\n  Variables", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0801.4707%2C0801.3760%2C0801.0508%2C0801.4386%2C0801.0176%2C0801.4195%2C0801.4862%2C0801.1216%2C0801.3810%2C0801.0918%2C0801.4835%2C0801.4085%2C0801.2151%2C0801.0775%2C0801.1689%2C0801.0829%2C0801.2579%2C0801.2763%2C0801.2456%2C0801.0276%2C0801.1489%2C0801.0027%2C0801.0559%2C0801.1471%2C0801.3462%2C0801.1116%2C0801.1578%2C0801.0594%2C0801.1331%2C0801.4582%2C0801.4928%2C0801.3109%2C0801.4860%2C0801.3817%2C0801.3051%2C0801.0643%2C0801.3054%2C0801.2819%2C0801.0710%2C0801.0358%2C0801.1610%2C0801.0637%2C0801.4534%2C0801.2152%2C0801.2075%2C0801.2244%2C0801.0970%2C0801.3372%2C0801.1106%2C0801.4762%2C0801.0741%2C0801.4419%2C0801.4568%2C0801.0943%2C0801.1563%2C0801.2192%2C0801.0492%2C0801.1805%2C0801.0515%2C0801.2713%2C0801.0191%2C0801.1398%2C0801.1286%2C0801.1425%2C0801.0096%2C0801.4015%2C0801.2316%2C0801.1922%2C0801.3427%2C0801.2271%2C0801.2815%2C0801.3078%2C0801.3362%2C0801.1228%2C0801.1129%2C0801.1292%2C0801.0094%2C0801.0770%2C0801.4931%2C0801.1881%2C0801.0692%2C0801.1591%2C0801.0309%2C0801.3344%2C0801.2442%2C0801.3418%2C0801.4507%2C0801.3133%2C0801.4831%2C0801.0014%2C0801.4007%2C0801.0500%2C0801.3754%2C0801.3750%2C0801.0858%2C0801.2625%2C0801.2270%2C0801.2675%2C0801.4947%2C0801.0368%2C0801.4392&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "A Simple Proof of the Kochen-Specker Theorem on the Problem of Hidden\n  Variables"}, "summary": "In this talk I present a simple derivation of an old result of Kochen and\nSpecker, which is apparently unrelated to the famous work of Bell on hidden\nvariables, but is presumably equally important. Kochen and Specker showed in\n1967 that quantum mechanics cannot be embedded into a classical stochastic\ntheory, provided the quantum theoretical probability distributions are\nreproduced and one additional highly desirable property is satisfied. This\nshowed in a striking manner what were the difficulties in implementing the\nEinstein programme of a `complete' version of quantum mechanics.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0801.4707%2C0801.3760%2C0801.0508%2C0801.4386%2C0801.0176%2C0801.4195%2C0801.4862%2C0801.1216%2C0801.3810%2C0801.0918%2C0801.4835%2C0801.4085%2C0801.2151%2C0801.0775%2C0801.1689%2C0801.0829%2C0801.2579%2C0801.2763%2C0801.2456%2C0801.0276%2C0801.1489%2C0801.0027%2C0801.0559%2C0801.1471%2C0801.3462%2C0801.1116%2C0801.1578%2C0801.0594%2C0801.1331%2C0801.4582%2C0801.4928%2C0801.3109%2C0801.4860%2C0801.3817%2C0801.3051%2C0801.0643%2C0801.3054%2C0801.2819%2C0801.0710%2C0801.0358%2C0801.1610%2C0801.0637%2C0801.4534%2C0801.2152%2C0801.2075%2C0801.2244%2C0801.0970%2C0801.3372%2C0801.1106%2C0801.4762%2C0801.0741%2C0801.4419%2C0801.4568%2C0801.0943%2C0801.1563%2C0801.2192%2C0801.0492%2C0801.1805%2C0801.0515%2C0801.2713%2C0801.0191%2C0801.1398%2C0801.1286%2C0801.1425%2C0801.0096%2C0801.4015%2C0801.2316%2C0801.1922%2C0801.3427%2C0801.2271%2C0801.2815%2C0801.3078%2C0801.3362%2C0801.1228%2C0801.1129%2C0801.1292%2C0801.0094%2C0801.0770%2C0801.4931%2C0801.1881%2C0801.0692%2C0801.1591%2C0801.0309%2C0801.3344%2C0801.2442%2C0801.3418%2C0801.4507%2C0801.3133%2C0801.4831%2C0801.0014%2C0801.4007%2C0801.0500%2C0801.3754%2C0801.3750%2C0801.0858%2C0801.2625%2C0801.2270%2C0801.2675%2C0801.4947%2C0801.0368%2C0801.4392&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "In this talk I present a simple derivation of an old result of Kochen and\nSpecker, which is apparently unrelated to the famous work of Bell on hidden\nvariables, but is presumably equally important. Kochen and Specker showed in\n1967 that quantum mechanics cannot be embedded into a classical stochastic\ntheory, provided the quantum theoretical probability distributions are\nreproduced and one additional highly desirable property is satisfied. This\nshowed in a striking manner what were the difficulties in implementing the\nEinstein programme of a `complete' version of quantum mechanics."}, "authors": ["Norbert Straumann"], "author_detail": {"name": "Norbert Straumann"}, "author": "Norbert Straumann", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1002/andp.200910407", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0801.4931v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0801.4931v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "9 pages, invited talk (birthday contribution for Ruth Durrer, Geneva,\n  January 25, 2008)", "arxiv_primary_category": {"term": "quant-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "quant-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0801.4931v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0801.4931v1", "journal_reference": null, "doi": "10.1002/andp.200910407", "fulltext": "arXiv:0801.4931v1 [quant-ph] 31 Jan 2008\n\nA Simple Proof of the Kochen-Specker\nTheorem on the Problem of Hidden Variables∗\nNorbert Straumann\nInstitute for Theoretical Physics University of Zurich,\nCH–8057 Zurich, Switzerland\nOctober 24, 2018\n\nAbstract\nIn this talk I present a simple derivation of an old result of Kochen\nand Specker, which is apparently unrelated to the famous work of Bell\non hidden variables, but is presumably equally important. Kochen and\nSpecker showed in 1967 that quantum mechanics cannot be embedded\ninto a classical stochastic theory, provided the quantum theoretical\nprobability distributions are reproduced and one additional highly desirable property is satisfied. This showed in a striking manner what\nwere the difficulties in implementing the Einstein programme of a\n'complete' version of quantum mechanics.\n\n1\n\nIntroduction\n\nIt is a great pleasure to be here at this happy occasion. Is it really true that\nRuth is now fifty years old ? Congratulation and my best wishes.\nAs you heard from Martin, I was one of Ruth's teachers in Zurich. She\nwas, as you can imagine, an extraordinary student: very interested in the\nsubject and eager to really understand things. And she always solved the\nexercises. Obviously, a considerable fraction of her class mates usually copied\nRuth's solutions. For that purpose they even expected from her, that she\nbrought them sufficiently early.\nI remember that during the breaks in one of the first courses she attended\n– I believe it was electrodynamics – Ruth regularly approached me and asked\n∗\n\nBirthday contribution for Ruth Durrer, Geneva, January 25, 2008.\n\n1\n\n\fpertinent questions about a parallel course on quantum mechanics, given by\none of my colleagues. She worried, for instance, how spin was introduced in\nthat course, and found this for good reasons mysterious. We also discussed,\nof course, interpretational issues.- Well, I had only very few students like her.\nWith this background, I thought it would perhaps be fitting if I present\nsomething of pedagogical nature, that is at the same time of general interest,\nespecially here in Geneva. I will talk about a very important old result of\nKochen and Specker (KS), which is, unfortunately, not so widely known as\nthe famous work of John Bell. Even people in the field were for a long time\noften not aware of the KS theorem. Loosely speaking, KS have shown that\nQM cannot be embedded into a classical stochastic theory, provided that two\nvery desirable conditions are assumed to be satisfied.\nThe original proof [1] of KS is very ingenious, but quite difficult. I show\na crucial graph that plays an important role in the proof, and has become\npart of the cover sheet of an interesting book by M. Redhead [2].\nErnst Specker was a young professor for mathematical logic when I was a\nstudent at ETH. I still see him from time to time. As a student I attended his\ncourse on foundations of analysis, and also some seminars on epistemology.\nI vividly remember Specker's talk on the problem of hidden variables in our\njoint theoretical seminar. Res Jost, who was a close friend of Specker, had\ninvited him because he was well aware that the work with Kochen (who was\nthen a postdoc of Specker) is interesting. At the time I did not grasp its full\nsignificance; that came much later.\nSeveral years ago, when preparing the final lecture of my standard QM\ncourse, it suddenly occurred to me that a really simple proof of the KSTheorem is possible. The evening before, S. Coleman had given a general\nphysics colloquium in Zurich, in which he spent much time talking about\nthe Greenberger-Horne-Zeilinger [3] version of a Bell type analysis. I then\nnoticed – and this is not a big achievement – that the entangled states in their\nwork can be used to prove the KS theorem at the blackboard in less than\none hour. In my modest contribution I will mainly present this pedagogical\nexercise. I hope that some of you will enjoy this.\nBefore I start, let me remind you how the issue of hidden variables arose\nhistorically. Einstein, Schroedinger, and others were always hoping that\nphysics would one day return to the reality concept of classical physics. At\nseveral occasions, Pauli emphasized that Einstein did not consider the concept of 'determinism' to be as fundamental as it is frequently held to be.\nEinstein's main concern was the radical revision of the concept of physical\nreality by the Kopenhagen school. He maintained a realistic world view; he\nbelieved in a world of things existing as 'real' entities. (Einstein was, of\ncourse, not a naive realist.)\n2\n\n\fA class of \"realistic theories\" is based on the idea of \"hidden variables\", by\nwhich one roughly means that QM is a kind of glorified statistical mechanics,\nwhich ignores some hidden microscopic degrees of freedom. This was at least\nthe view of Einstein. I just quote one of his statements expressing this. In\nthe famous volume Albert Einstein: Philosopher–Scientist Einstein wrote [4]:\n\"Assuming the success of efforts to accomplish a complete physical description, the statistical quantum theory would, within the framework of future physics, take an approximately analogous position to the statistical mechanics within classical mechanics. I am rather firmly convinced that the\ndevelopment of theoretical physics will be of this type; but the path will be\nlengthy and difficult.\"\nWith this background, let me now really begin.\n\n2\n\nFormulation of the problem\n\nFirst I have to formulate the problem precisely, before stating the KS theorem. This requires some preparations and notation.\n\n2.1\n\nPreliminaries\n\nImagine some well-defined quantum mechanical system, for instance the spindegrees of a spin-1 particle. Let O be a specified set of observables (e.g., a\nsmall finite number), represented by a set of self-adjoint operators of a Hilbert\nspace H. For A ∈ O we denote by E A (*) the (projection-valued) spectral\nmeasure of A. We have the spectral decomposition\nZ\nA=\nλ dE A (λ), σ(A) : spectrum of A.\n(1)\nσ(A)\n\nMore generally, the operator u(A) for a Borel function u : R → R has the\nrepresentation\nZ\nu(A) =\nu(λ) dE A (λ);\n(2)\nσ(A)\n\nin particular, 1∆ (A) = E A (∆). We have the rule (as part of the 'symbolic\ncalculus')\nu1 (A)u2 (A) = (u1 * u2 )(A).\n(3)\nFurthermore, E u(A) and E A are naturally related by the push-forward:\nE u(A) (∆) = E A (u−1(∆)) : E u(A) = u∗ E A .\n\n3\n\n(4)\n\n\fBeside the observables O we also have to specify a set S of pure states\n(unit rays). (We could, more generally, choose mixed states, but this is not\nessential.) To each pair [ψ] ∈ S, A ∈ O belongs the probability measure\nA\nw[ψ]\n(∆) = (ψ, E A (∆)ψ),\n\n(5)\n\nand according to Born this is the distribution of A in the state [ψ]. Note\nthat (4) implies\nu(A)\nA\nw[ψ] = u∗ w[ψ]\n.\n(6)\n(Remember that the induced transformation of a measure μ is given by\n(u∗ μ)(∆) = μ(u−1 (∆)).)\n\n2.2\n\nHidden variables\n\nWhat do we mean when we ask whether this quantum description can be\nembedded into a classical theory, or be replaced by a theory with hidden\nvariables? A minimal requirement, most people would agree on, is the following: There should exist a measurable space (Ω, F ) (F : σ-algebra of\nmeasurable subsets) and two maps\nO ∋ A 7→ fA : Ω → R (measurable),\n\n(7)\n\nS ∋ [ψ] 7→ ρ[ψ] : prob. measure on (Ω, F ),\n\n(8)\n\nsuch that the probability distributions are reproduced:\nA\nw[ψ]\n(∆) = ρ[ψ] (fA−1 (∆)) :\n\n(KS1).\n\n(9)\n\nThe first map assigns 'values' to observables. The right hand side of (KS1) is\nthe classical distribution of fA in the state ρ[ψ] (as in statistical mechanics).\nIn particular, the expectation values have to agree:\nZ\nZ\nA\n(ψ, Aψ) =\nλ dw[ψ] (λ) =\nfA (ω) dρ[ψ] (ω).\n(10)\nΩ\n\nσ(A)\n\n(In the last equality sign we have used a standard transformation formula\nfor integrals.)\nAs long as not more is required, hidden variables in this sense can always\nbe introduced. Following KS, this can be shown with the following abstract\nconstruction (which is quite natural from the point of view of probability\ntheory): We choose\nΩ = RO = {ω|ω : O → R}, F = BO\n4\n\n(11)\n\n\f(B : σ−algebra of R), and the two maps fA , ρ[ψ] as\nO\nA\nfA (ω) = ω(A) (canonical proj.), ρ[ψ] =\nw[ψ]\n(product measure). (12)\nA∈O\n\n(KS1) is indeed satisfied:\nρψ (fA−1 (∆)) = ρψ ({ω| fA (ω) ∈ ∆}) = wψA (∆).\n| {z }\nω(A)∈∆\n\nNote that in this construction the fA are measurable functions, which\ncan be interpreted as random variables, but they are obviously independent.\nHowever, observables in a physically interesting theory are usually not independent, and therefore we have to add some additional condition, in order\nto exclude this somewhat trivial construction.\nIn order to motivate the additional condition imposed by KS, we note\nthat in any physical theory a function of an observable has to be defined such\nthat the probability distributions for any state are related by push-forward,\nbecause this just reflects how functions of an observable are measured. This\nis indicated by the vertical arrows of the following diagram:\nqm\nA\nw[ψ]\n\n\n\nu∗\ny\n\ncl\nw a [wμa (∆) = μ(a−1 (∆))]\nμ\n\n\nu∗\ny\n\nu(A)\n\nu(a)\n\nw[ψ]\n\nwμ\n\n(KS1) postulates that the upper distributions are equal if a = fA , μ =\nρ[ψ] . The images under u are then also equal, and thus (KS1) for the lower\nline then implies that fu(A) and u(fA ) have the same distributions. It is very\nnatural to require that the two functions are actually equal:\nfu(A) = u(fA ) :\n\n(KS2).\n\n(13)\n\nThis condition has, as we shall see, far reaching consequences. It should be\nregarded as an alternative to Bell's locality assumption.\nThe following remark will be important. If A1 , A2 ∈ O are commuting,\nthen\nfA1 A2 = fA1 * fA2 , fA1 +A2 = fA1 + fA2 .\n(14)\nProof : The commuting selfadjoint operators A1 , A2 can, by a theorem of von\nNeumann, be represented as real functions of a single selfadjoint operator A:\n5\n\n\fA1 = u1 (A), A2 = u2 (A). Then, by Eq. (3)\nA1 A2 = u1 (A)u2 (A) = (u1 * u2 )(A);\nKS2\n\nfA1 A2 = f(u1 *u2 )(A) = (u1 * u2 ) ◦ fA\nKS2\n\n= (u1 ◦ fA ) * (u2 ◦ fA ) = fu1 (A) * fu2 (A) = fA1 * fA2 .\nThe additivity follows similarly.\nIn Bell's work, the product rule in Eq. (14) follows for separated situations\nfrom his (Einstein's) locality assumption, however, not only for compatible\nobservables.\n\n3\n\nThe KS theorem and its proof\n\nNow, we can formulate the main result of Kochen and Specker:\nTHEOREM. If dimH > 2, an embedding, satisfying (KS1) and (KS2),\nis \"in general\" – for a large class of relevant examples – not possible.\nRemarks. 1) For the spin-degrees of freedom for a spin-1/2 particle such\nan embedding is possible, as was shown by J. Bell, as well as by KS (see\nAppendix).\n2) We did not say precisely what we mean by 'in general', because for that\nwe would have to exclude cases for which the sets O, S would be too simple.\nWhat really matters, however, is that the statement is true for instance for\nmost of atomic physics systems.\n3) In the nineties several simplified proofs have been found (see, e.g., [5]),\nbut the one I will now present is by far (?) the simplest.\nProof of the KS theorem. Consider the quantum mechanical system describing the spin degrees of freedom of three spin-1/2 particles. The Hilbert\nspace is H = C2 ⊗ C2 ⊗ C2 , and important observables will be (σx , σy , σz are\nthe Pauli matices):\nA1 = σx ⊗ 1 ⊗ 1, A2 = 1 ⊗ σx ⊗ 1, A3 = 1 ⊗ 1 ⊗ σx ,\nB1 = σy ⊗ 1 ⊗ 1, B2 = 1 ⊗ σy ⊗ 1, B3 = 1 ⊗ 1 ⊗ σy .\n\n(15)\n(16)\n\nOf special interest are the products\nQ1 = A1 B2 B3 (= σx ⊗ σy ⊗ σy ), Q2 = B1 A2 B3 , Q3 = B1 B2 A3 .\n\n(17)\n\nOne readily sees that all the Q's commute and that Q2j = 1 (j = 1, 2, 3).\n\n6\n\n\fLet χ↑ , χ↓ be the canonical basis of C2 . Consider the symmetric state\n1\nΨ = √ [χ↑ ⊗ χ↑ ⊗ χ↑ − χ↓ ⊗ χ↓ ⊗ χ↓ ].\n2\n\n(18)\n\nOne easily sees that\nQj Ψ = Ψ (j = 1, 2, 3).\n\n(19)\n\nhA1 B2 B3 iΨ = 1, etc. (strict correlations).\n\n(20)\n\nThus\nAssume now the existence of an embedding, satisfying (KS1) and (KS2).\nBelow we show that this implies a mathematical contradiction. Let\nQj 7→ fQj ≡ qj , Aj 7→ aj , Bj 7→ bj , Ψ 7→ ρ[Ψ] .\nSince the classical and quantum mechanical expectation values have to agree,\nwe have\nZ\nKS1\nhQj iΨ = 1 =\nqj (ω) dρΨ (ω) (j = 1, 2, 3).\nΩ\n\nNow (KS2) implies qj2 = 1 (the unit operator goes into 1, as a result of the\nproduct rule in (14)), hence qj (ω) = ±1. Together, we conclude that\nqj (ω) = 1, a.e. ⇒ q1 q2 q3 = 1, a.e. .\n\n(21)\n\nSince the three factors in each Qj commute, we have by (14)\nq1 = a1 b2 b3 , q2 = b1 a2 b3 , q3 = b1 b2 a3 .\nFurthermore, A2j = 1, Bj2 = 1, thus aj (ω) = ±1, bj (ω) = ±1 and therefore\nwe obtain from (21)\na1 a2 a3 = 1, a.e. .\n(22)\n(The b-factors appear quadratically.)\nNow, the contradiction arises as follows. First one notes the operator\nidentity\nQ1 Q2 Q3 = −A1 A2 A3 ,\n(23)\nwhence\n\n(Ψ, A1 A2 A3 Ψ) = −1.\n\n(24)\n\na1 a2 a3 = −1, a.e. .\n\n(25)\n\nSince the three factors in (24) commute, the image of A1 A2 A3 is a1 a2 a3 , and\n(KS1) implies\nZ\na1 (ω)a2 (ω)a3 (ω) dρΨ (ω) = −1,\nΩ\n\nhence\nThis is in \"maximal\" contradiction to (22).\n7\n\n\f4\n\nConcluding remarks\n\nI find the result of KS entirely satisfactory. It demonstrates clearly that\nthere is no way back to classical reality. Notice that we considered only a\nsmall finite set of observables (Aj , Bj , Qj ), and we used only one state. It is\nphysically important that we do not have to make assumptions on an infinite\nnumber of quantum mechanical propositions. Note also: If our system is a\nsubsystem of a larger one (e.g., a system of ≥ 3 electrons in atomic physics),\nthe larger one can also not be embedded in the sense of KS.\nOf course, as with any theorem, there is the possibility to weaken the\nassumptions and hope for ways to avoid the far reaching conclusions. One\nsuggestion (van Fraassen) goes as follows:\nMaintain the idea of hidden variables (in the sense I used it). Keep,\nhowever, the map A → fA only for maximal operators A (no degeneracies),\nbut allow the possibility that for nonmaximal operators there may be several\nobservables:\nSuppose that for a nonmaximal A we have the representations A =\nu(B), A = v(C), B, C maximal, [B, C] 6= 0. If B → fB , C → fC , we\nmay associate to A the functions on Ω:\naB = u(fB ),\n\naC = v(fC ).\n\nThere is no reason that the two agree. To make a choice requires a \"context\",\nand this led to the concept of \"ontological contextuality\". This goes in the\ndirection of Bohr's mutual exclusiveness of experimental arrangements. The\ninteresting question then arises, whether there is a connection of this with\nnonlocality.\nFor more on these subtle issues I refer once more to Redhead's book [2].\nWith good reasons one may consider the problem of hidden variables as\nirrelevant and mainly psychologically interesting. Thanks to KS (and, of\ncourse, J. Bell) we can, however, tell our students something definite.\n\n5\n\nAppendix: Classical model for spin-1/2\n\nFor the spin-1/2 degrees of freedom there is a classical model in the sense of\nKS.\nI repeat part of the construction. The phase space Ω is the 2-sphere S 2\n(with the Borel σ-algebra). The map fA is defined as follows:\nLet λ1 , λ2 be the eigenvalues of a hermitian matrix of A, Aψi = λi ψi . If\n\n8\n\n\fλ1 6= λ2 we associate to A the traceless hermitian matrix (spin matrix)\nσ(A) =\n\n2\nλ1 + λ2\nA−\n12 ,\nλ1 − λ2\nλ1 − λ2\n\n(26)\n\nfor which σ(A)ψ1,2 = ±ψ1,2 . Hence, σ(A) can be written as σ(A) = ~σ *~x, ~x ∈\nS 2 . We call SA+ the hemisphere of S 2 with North Pole at ~x. Then we set\n\u001a\nλ1 : p ∈ SA+ ,\n(27)\nfA (p) :=\nλ2 : otherwise.\nIf the eigenvalues of A are equal, so that A = λ12 , then we set fA (p) ≡ λ. It\nis easy to show that this construction satisfies (KS2).\nThe probability measure on S 2 is also quite simple. We choose ρψ absolutely continuous with respect to the natural (rotational invariant) measure\non S 2 (= sin θ dθ dφ). The corresponding probability density mψ (p) is constructed as follows. If ψ = χ↑ , we take\n\u001a 1\ncos θ : 0 ≤ θ ≤ π\nπ\nmψ =\n0 : otherwise,\nwhere θ is the polar angle of p. The generalization to arbitrary states is\ndictated by the requirement of rotational invariance. It then takes some\ncalculations to verify that (KS1) is fulfilled. Actually, one can derive the\nformula for mψ by imposing (KS1) (for details, see [1]).\n\nReferences\n[1] S. Kochen and E. Specker, The Problem of Hidden Variables in Quantum\nMechanics, Journal of Mathematics and Mechanics 18, 59-87 (1967).\n[2] M. Redhead, Incompleteness, Nonlocality, and Realism, A Prolegomenon to the Philosophy of Quantum Mechanics, Clarendon Press,\nOxford (1987).\n[3] D. Greenberger, M. Horn and A. Zeilinger, in Bell's Theorem, Quantum Theory, and Conceptions of the Universe, M. Kafatos, ed., Kluwer,\nDortrecht, 69 (1989).\n[4] A. Einstein, in Albert Einstein: Philosopher-Scientist, P.A. Schilpp, ed.,\nIllinois: The Library of Living Philosophers, (1949), p. 672.\n[5] A. Peres, J. Phys. A24, L175 (1991).\n\n9\n\n\f"}