{"id": "http://arxiv.org/abs/1009.2142v1", "guidislink": true, "updated": "2010-09-11T06:42:09Z", "updated_parsed": [2010, 9, 11, 6, 42, 9, 5, 254, 0], "published": "2010-09-11T06:42:09Z", "published_parsed": [2010, 9, 11, 6, 42, 9, 5, 254, 0], "title": "Consistent digital line segments", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1009.5782%2C1009.1832%2C1009.1150%2C1009.1521%2C1009.1227%2C1009.5331%2C1009.1473%2C1009.5470%2C1009.4491%2C1009.0566%2C1009.6056%2C1009.4873%2C1009.2150%2C1009.0226%2C1009.0893%2C1009.0178%2C1009.4151%2C1009.5692%2C1009.4124%2C1009.0445%2C1009.5428%2C1009.0796%2C1009.4419%2C1009.0987%2C1009.6025%2C1009.1949%2C1009.2835%2C1009.4887%2C1009.1262%2C1009.4611%2C1009.2821%2C1009.2420%2C1009.0680%2C1009.5503%2C1009.2877%2C1009.2691%2C1009.5998%2C1009.5506%2C1009.3224%2C1009.4668%2C1009.5011%2C1009.4972%2C1009.4840%2C1009.3832%2C1009.5010%2C1009.2413%2C1009.2252%2C1009.5040%2C1009.0832%2C1009.0466%2C1009.1006%2C1009.4299%2C1009.2364%2C1009.2976%2C1009.2957%2C1009.2092%2C1009.5208%2C1009.3156%2C1009.1514%2C1009.5239%2C1009.5001%2C1009.3834%2C1009.1103%2C1009.0334%2C1009.3414%2C1009.3010%2C1009.3178%2C1009.0327%2C1009.0916%2C1009.4486%2C1009.2568%2C1009.6094%2C1009.4415%2C1009.4950%2C1009.4364%2C1009.3845%2C1009.5298%2C1009.1219%2C1009.0198%2C1009.1195%2C1009.0879%2C1009.3975%2C1009.4022%2C1009.3999%2C1009.1556%2C1009.2142%2C1009.5271%2C1009.5840%2C1009.3417%2C1009.4515%2C1009.1979%2C1009.1685%2C1009.4241%2C1009.0420%2C1009.5348%2C1009.2110%2C1009.2699%2C1009.5980%2C1009.3333%2C1009.5867%2C1009.1592&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Consistent digital line segments"}, "summary": "We introduce a novel and general approach for digitalization of line segments\nin the plane that satisfies a set of axioms naturally arising from Euclidean\naxioms. In particular, we show how to derive such a system of digital segments\nfrom any total order on the integers. As a consequence, using a well-chosen\ntotal order, we manage to define a system of digital segments such that all\ndigital segments are, in Hausdorff metric, optimally close to their\ncorresponding Euclidean segments, thus giving an explicit construction that\nresolves the main question of Chun et al.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1009.5782%2C1009.1832%2C1009.1150%2C1009.1521%2C1009.1227%2C1009.5331%2C1009.1473%2C1009.5470%2C1009.4491%2C1009.0566%2C1009.6056%2C1009.4873%2C1009.2150%2C1009.0226%2C1009.0893%2C1009.0178%2C1009.4151%2C1009.5692%2C1009.4124%2C1009.0445%2C1009.5428%2C1009.0796%2C1009.4419%2C1009.0987%2C1009.6025%2C1009.1949%2C1009.2835%2C1009.4887%2C1009.1262%2C1009.4611%2C1009.2821%2C1009.2420%2C1009.0680%2C1009.5503%2C1009.2877%2C1009.2691%2C1009.5998%2C1009.5506%2C1009.3224%2C1009.4668%2C1009.5011%2C1009.4972%2C1009.4840%2C1009.3832%2C1009.5010%2C1009.2413%2C1009.2252%2C1009.5040%2C1009.0832%2C1009.0466%2C1009.1006%2C1009.4299%2C1009.2364%2C1009.2976%2C1009.2957%2C1009.2092%2C1009.5208%2C1009.3156%2C1009.1514%2C1009.5239%2C1009.5001%2C1009.3834%2C1009.1103%2C1009.0334%2C1009.3414%2C1009.3010%2C1009.3178%2C1009.0327%2C1009.0916%2C1009.4486%2C1009.2568%2C1009.6094%2C1009.4415%2C1009.4950%2C1009.4364%2C1009.3845%2C1009.5298%2C1009.1219%2C1009.0198%2C1009.1195%2C1009.0879%2C1009.3975%2C1009.4022%2C1009.3999%2C1009.1556%2C1009.2142%2C1009.5271%2C1009.5840%2C1009.3417%2C1009.4515%2C1009.1979%2C1009.1685%2C1009.4241%2C1009.0420%2C1009.5348%2C1009.2110%2C1009.2699%2C1009.5980%2C1009.3333%2C1009.5867%2C1009.1592&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We introduce a novel and general approach for digitalization of line segments\nin the plane that satisfies a set of axioms naturally arising from Euclidean\naxioms. In particular, we show how to derive such a system of digital segments\nfrom any total order on the integers. As a consequence, using a well-chosen\ntotal order, we manage to define a system of digital segments such that all\ndigital segments are, in Hausdorff metric, optimally close to their\ncorresponding Euclidean segments, thus giving an explicit construction that\nresolves the main question of Chun et al."}, "authors": ["Tobias Christ", "Dömötör Pálvölgyi", "Miloš Stojaković"], "author_detail": {"name": "Miloš Stojaković"}, "author": "Miloš Stojaković", "links": [{"href": "http://arxiv.org/abs/1009.2142v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1009.2142v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "cs.DM", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cs.DM", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "math.CO", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1009.2142v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1009.2142v1", "arxiv_comment": null, "journal_reference": null, "doi": null, "fulltext": "Consistent digital line segments\nTobias Christ∗ Dömötör Pálvölgyi† Miloš Stojaković\n\n‡\n\nOctober 28, 2018\n\narXiv:1009.2142v1 [cs.DM] 11 Sep 2010\n\nAbstract\nWe introduce a novel and general approach for digitalization of line segments in the\nplane that satisfies a set of axioms naturally arising from Euclidean axioms. In particular,\nwe show how to derive such a system of digital segments from any total order on the integers.\nAs a consequence, using a well-chosen total order, we manage to define a system of digital\nsegments such that all digital segments are, in Hausdorff metric, optimally close to their\ncorresponding Euclidean segments, thus giving an explicit construction that resolves the\nmain question of [1].\n\n1\n\nIntroduction\n\nOne of the most fundamental challenges in digital geometry is to define a \"good\" digital representation of a geometric object. Of course, the meaning of the word \"good\" here heavily\ndepends on particular conditions we may impose. Looking at the problem of digitalization in\nthe plane, the goal is to find a set of points on the integer grid Z2 that approximates well a\ngiven object. The topology of the grid Z2 is commonly defined by the graph whose vertices are\nall the points of the grid, and each point is connected by an edge to each of the four points that\nare either horizontally or vertically adjacent to it.\nKnowing that a straight line segment is one of the most basic geometric objects and a\nbuilding block for many other objects, defining its digitalization in a satisfying manner is vital.\nHence, it is no wonder that this has been a hot scientific topic in the last few decades, see [4] for\na recent survey and [3], [2], and [6] for related work, dealing with the problem of representing\nobjects in digital geometry without causing topological and combinatorial inconsistencies.\nFor any pair of points p and q in the grid Z2 we want to define the digital line segment S(p, q)\nconnecting them, that is, {p, q} ⊆ S(p, q) ⊆ Z2 . Chun et al. in [1] put forward the following\nfour axioms that arise naturally from properties of line segments in Euclidean geometry.\n(S1) Grid path property: For all p, q ∈ Z2 , S(p, q) is the vertex set of a path from p to q in the\ngrid graph.\n(S2) Symmetry property: For all p, q ∈ Z2 , we have S(p, q) = S(q, p).\n∗\n\nInstitute of Theoretical Computer Science, ETH Zurich, Switzerland, email: tobias.christ@inf.ethz.ch\nDepartment of Combinatorial Geometry, EPF Lausanne, Switzerland, email: dom@cs.elte.hu.\n‡\nDepartment of Mathematics and Informatics, University of Novi Sad, Serbia, email:\nlos.stojakovic@dmi.uns.ac.rs.\n†\n\n1\n\nmi-\n\n\f(S3) Subsegment property: For all p, q ∈ Z2 and every r ∈ S(p, q), we have S(p, r) ⊆ S(p, q).\n(S4) Prolongation property: For all p, q ∈ Z2 , there exists r ∈ Z2 , such that r ∈\n/ S(p, q) and\nS(p, q) ⊆ S(p, r).\nFirst, note that (S3) is not satisfied by the usual way a computer visualizes a segment. A\nnatural definition of the digital straightn\u0010\nsegment\nbetween p = (px , py )k\u0011\nand q = (qx , qy ),\no where\nj\nq −p\n\npx ≤ qx and 0 ≤ qy − py < qx − px is\nx, (x − px ) qxy −pyx + py + 0.5 : px ≤ x ≤ qx . This\ndoes not satisfy (S1), but it could be easily fixed by a slight modification of the definition. Still,\nit also does not satisfy (S3), for example, for p = (0, 0), r = (1, 0), q = (4, 1), the subsegment\nfrom r to q is not contained in the segment from p to q.\nEven though the set of axioms (S1)-(S4) seems rather natural, there are still some fairly\nexotic examples of digital segment systems that satisfy all four of them. For example, let us fix\na double spiral D centered at an arbitrary point of Z2 , traversing all the points of Z2 . As it is\na spanning path of the grid graph, we can set S(p, q) to be the path between p and q on D, for\nevery p, q ∈ Z2 . It is easy to verify that this system satisfies axioms (S1)-(S4).\nAnother condition was introduced in [1] to enforce the monotonicity of the segments, ruling out pathological examples like the one above. Here, we phrase this monotonicity axiom\ndifferently, but still, the system of axioms (S1)-(S5) remains equivalent to the one given in [1].\n(S5) Monotonicity property: If both p, q ∈ Z2 lie on a line that is either horizontal or vertical,\nthen the whole segment S(p, q) belongs to this line.\nWe call a system of digital line segments that satisfies the system of axioms (S1)-(S5) a\nconsistent digital line segments system (CDS). It is straightforward to verify that every CDS\nalso satisfies the following three conditions.\n(C1) If the slope of the line going through p and q is non-negative, then the slope of the line\ngoing through any two points of S(p, q) is non-negative. The same holds for non-positive\nslopes.\n(C2) For all p, q ∈ Z2 , the grid-parallel box spanned by points p and q contains S(p, q).\n(C3) If the intersection of two digital segments contains two points p, q ∈ Z2 , then their intersection also contains the whole digital segment S(p, q).\nWe give a simple example of a CDS, where the segments follow the boundary of the gridparallel box spanned by the endpoints. Let p, q ∈ Z2 be two points with coordinates p = (px , py )\nand q = (qx , qy ). If py ≤ qy , we define S(p, q) = S(q, p) = {(x, py ) : min{px , qx } ≤ x ≤\nmax{px , qx }} ∪ {(qx , y) : py ≤ y ≤ qy }}. If py > qy , we swap the points p and q, and define the\nsegment as in the previous case.\nIt can be easily verified that this way we defined a CDS, but the digital segments in this\nsystem visually still do not resemble well the Euclidean segments.\nOne of the standard ways to measure how close a digital segment is to a Euclidean segment\nis to use the Hausdorff distance. We denote by pq the Euclidean segment between p and q, and\nby |pq| the Euclidean length of pq. For two plane objects A and B, by H(A, B) we denote their\nHausdorff distance.\n2\n\n\fThe main question raised in [1] was if it is possible to define a CDS such that a Euclidean\nsegment and its digitalization have a reasonably small Hausdorff distance. More precisely, the\ngoal is to find a CDS satisfying the following condition.\n(H) Small Hausdorff distance property: For every p, q ∈ Z2 , we have that H(pq, S(p, q)) =\nO(log |pq|).\nNote that in the CDS example we gave, the Hausdorff\n√ distance between a Euclidean segment\nof length n and its digitalization can be as large as n/ 2.\nWhile this question was not resolved in [1], a clever construction of a system of digital rays\nemanating from the origin of Z2 that satisfy (S1)-(S5) and (H) was presented. Moreover, it\nwas shown using Schmidt's theorem [5] that already for rays emanating from the origin, the\nlog-bound imposed in condition (H) is the best bound we can hope for, directly implying the\nfollowing theorem.\nTheorem 1 [1] There exists a constant c > 0, such that for any CDS and any d > 0, there\nexist p, q ∈ Z2 with |pq| > d, such that H(pq, S(p, q)) > c log |pq|.\nIn this paper, we introduce a novel and general approach for the construction of a CDS.\nNamely, for any total order ≺ on Z, we show how to derive a CDS from ≺. (By total order\nwe always mean a strict total order.) This process is described in Section 2. As a consequence,\nin Section 3, we manage to define a CDS that satisfies (H), deriving it from a specially chosen\norder on Z, and thus giving the explicit construction that resolves the main question of [1].\nTheorem 2 There is a CDS that satisfies condition (H).\nNote that Theorem 1 ensures that such a CDS is optimal up to a constant factor in terms\nof the Hausdorff distance from the Euclidean segments. In Section 4 we make a step towards a\ncharacterization of CDSes, demonstrating their natural connection to total orders on Z, while in\nSection 5 we make use of the digital line segment definition to introduce digital lines. Finally, in\nSection 6 we discuss prospects of using a similar approach to define a CDS in higher dimensions.\n\n2\n\nDigital line segments derived from a total order on Z\n\nLet ≺ be a total order on Z. We are going to define a CDS S≺ , deriving it from ≺.\n\nLet p, q ∈ Z2 , p = (px , py ) and q = (qx , qy ). If px > qx , we swap p and q. Hence, from now\non we may assume that px ≤ qx .\n\nIf py ≤ qy , then S≺ (p, q) is defined as follows. We start at the point p = (px , py ) and we\nrepeatedly go either up or to the right, collecting the points from Z2 , until we reach q. Note\nthat the sum of the coordinates x + y increases by 1 in each step. In total we have to make\nqx + qy − px − py steps and in exactly qy − py of them we have to go up. The decision whether\nto go up or to the right is made as follows: if we are at the point (x, y) for which x + y is among\nthe qy − py greatest elements of the interval [px + py , qx + qy − 1] according to ≺, we go up,\notherwise we go to the right. We will refer to this interval as the segment interval.\n\n3\n\n\f(c, d)\n\n(a, b)\n\nFigure 1: Two paths splitting up at (a, b) and meeting again at (c, d).\nIf py > qy , that is, if p is the top-left and q the bottom-right corner of the grid-parallel box\nspanned by p and q, then we define S≺ (p, q) as the mirror reflection of S≺ ((−qx , qy ), (−px , py ))\nover the y-axis.\nExample. Suppose p = (0, 0) and q = (2, 2). Their segment interval consists of four numbers,\n0, 1, 2, 3. If ≺ is the natural order on Z, then the two greatest elements of the segment interval\nare 2 and 3. Since 0 + 0 is not one of these, at (0, 0) we go right, to (1, 0). At (1, 0) we again go\nto right, to (2, 0), from there to (2, 1) (since 2 + 0 is one of the greater elements) and finally to\n(2, 2). In fact, it can be easily seen that using the natural order on Z we get the CDS mentioned\nin Section 1, the one that always follows the boundary of the box spanned by the endpoints.\nTheorem 3 S≺ , defined as above, is a CDS.\nProof. We will verify that S≺ satisfies the axioms (S1)-(S5).\n(S1) The condition (S1) follows directly from the definition of S≺ .\n(S2) Let p, q be two points from Z2 . If the first coordinates of p and q are different, then\ncondition (S2) follows directly. Otherwise, p and q belong to the same vertical line, and\nfrom the construction we see that both S≺ (p, q) and S≺ (q, p) consist of all the points on\nthat line between p and q.\n(S3) For a contradiction, assume that there are points p = (px , py ), q = (qx , qy ) and r = (rx , ry ),\nwith r ∈ S≺ (p, q), such that S≺ (p, r) 6⊆ S≺ (p, q). W.l.o.g. we may assume that pq has a\nnon-negative slope.\nCase 1. px ≤ qx and py ≤ qy . We also have px ≤ rx and py ≤ ry , and going on each of\nthe segments S≺ (p, r) and S≺ (p, q) point-by-point starting from p, we move either up or\nright. By assumption, these two segments separate at some point (a, b) and then meet\nagain, for the first time after this separation, at some other point (c, d), see Figure 1. One\nof the segments goes up at (a, b) and enters (c, d) horizontally coming from the left, which\nimplies that a + b is among the greater numbers of the segment interval of this segment,\nwhile c+d−1 is not, thus c+d−1 ≺ a+b. But the other segment goes horizontally at (a, b)\nand enters (c, d) vertically coming from below, which similarly implies a + b ≺ c + d − 1,\na contradiction.\nCase 2. qx ≤ px and qy ≤ py . We also have qx ≤ rx and qy ≤ ry . By assumption, the\ntwo segments starting at q and r, S≺ (q, p) and S≺ (r, p), separate at some point (a, b) and\nthen meet again, for the first time after this separation, at some other point (c, d). Using\nthe same argument as before, we get a contradiction. Hence, (S3) holds.\n4\n\n\f(S4) To show that condition (S4) holds, consider the segment from p = (px , py ) to q = (qx , qy ).\nW.l.o.g. we can assume that px ≤ qx and py ≤ qy . We distinguish two cases.\nCase 1. If qx + qy is among the qy − py + 1 greatest numbers of [px + py , qx + qy ] according\nto ≺, then we can prolong the segment going one step vertically up, that is, the segment\nS≺ ((px , py ), (qx , qy + 1)) contains the segment S≺ ((px , py ), (qx , qy )) as a subsegment.\n\nCase 2. If, on the other hand, qx + qy is not among the qy − py greatest numbers\nof [px + py , qx + qy ], we can prolong the segment horizontally to the right, that is,\nS≺ ((px , py ), (qx , qy )) ⊂ S≺ ((px , py ), (qx + 1, qy )).\nNote that if qx + qy is exactly the (qy − py + 1)th number in [px + py , qx + qy ], then the\nconclusions of both cases are true, and indeed the rays emanating from (px , py ) split at\n(qx , qy ).\n\n(S5) The condition (S5) follows directly from the definition of S≺ .\n\n\u0003\n\nApparently in the definition of S≺ (p, q) only the sum of the coordinates of the points plays\na role, so if we translate p and q by a vector (t, −t), for any integer t, the digital line segment\nwill look the same.\nObservation 4 Let t ∈ Z be an integer. S≺ (p + (t, −t), q + (t, −t)) = S≺ (p, q) + (t, −t) =\n{(x + t, y − t) ∈ Z2 : (x, y) ∈ S≺ (p, q)}.\n\n3\n\nDigital segments with small Hausdorff distance to Euclidean\nsegments\n\nFor integers k and l ≥ 2, let |k|l denote the number of times k is divisible by l, that is,\n|k|l = sup {m : lm | k} .\nWe define a total order on Z as follows. Let a ≺ b if and only if there exists a non-negative\ninteger i such that |a − i|2 < |b − i|2 , and for all j ∈ {0, . . . , i − 1} we have |a − j|2 = |b − j|2 .\nIn plain words, for two integers a and b, we say that the one that contains a higher power\nof 2 is greater under ≺. In case of a tie, we repeatedly subtract 1 from both a and b, until\nat some point one of them contains a higher power of 2 than the other. Thus, for example,\n−1 ≺ −5 ≺ 3 ≺ −3 ≺ 5 ≺ 1 ≺ −2 ≺ 6 ≺ −6 ≺ 2 ≺ −4 ≺ 4 ≺ 0.\nNote that if we take the elements of an interval of the form (−2n , 2n ) in ≺-decreasing order\nand we apply the function 0.5 − x2−n−1 to them, then we get the first few elements of the Van\nder Corput sequence [7].\n\nWe will prove that using this total order to define the system of digital line segments S≺ , as\ndescribed in the previous section, we obtain a CDS which satisfies condition (H). In Figure 2 we\ngive some examples of digital segments in this CDS, and Figure 3 shows the segments emanating\nfrom (0, 0) to some neighboring points, as well as the segments from (2, 3) to the neighboring\npoints.\nAt first sight it may be surprising to observe that all the segments emanating from the\norigin in our construction coincide with the ones given in the construction of digital rays in [1].\nHowever, it is not a coincidence, as the construction from [1] also relies on the same total order\non integers.\n5\n\n\f24\n\n20\n\n16\n\n12\n\n8\n\n4\n\n0\n\n4\n\n8\n\n12\n\n16\n\n20\n\n24\n\n28\n\nFigure 2: Some line segments.\n\nFigure 3: Digital line segments emanating from (0, 0) and from (2, 3).\n\n6\n\n32\n\n\fFor points v, w ∈ R2 and A ⊆ R2 , let d(v, w) = |v − w| and d(v, A) = inf a∈A d(v, a)\ndenote the usual Euclidean distances between two points, and between a point and a set. For\np, q, r, s ∈ Z2 , by pqrs we denote the union of Euclidean linear line segments from p to q, from\nq to r, and from r to s.\nObservation 5 For any p, q ∈ Z2 , H(S≺ (p, q), pq) = max{d(r, pq) : r ∈ S≺ (p, q)}.\nWe proceed by proving three statements that we will use to ultimately prove Theorem 2.\nLemma 6 If p, q ∈ Z2 and r, s ∈ S≺ (p, q). Then\nH(rs, S≺ (r, s)) ≤ 2H(pq, S≺ (p, q)).\nProof. We know that d(r, pq) ≤ H(pq, S≺ (p, q)) =: h and d(s, pq) ≤ h, therefore H(prsq, pq) ≤\nh. Hence, for all v ∈ pq, d(v, prsq) ≤ h. Let t ∈ S≺ (r, s) ⊆ S≺ (p, q) and v ∈ pq be\nsuch that d(t, v) = d(t, pq) ≤ h. Using the triangle inequality we conclude d(t, prsq) ≤\nd(t, v) + d(v, prsq) ≤ 2h. Because of (C2), we have d(t, rs) = d(t, prsq) ≤ 2h, and therefore\n\u0003\nH(S≺ (r, s), rs) ≤ 2h.\nLemma 7 Let p, q, r, r0 ∈ Z2 , such that rx − px = qx − rx0 + ε, ry − py = qy − ry0 − ε, with\n√\nε ∈ {0, 1, −1}, rx0 = rx and ry0 = ry + 1. Then H(pq, prr0 q) ≤ c = 5/2.\nProof. Without loss of generality p = (0, 0). We have\nH(pq, prr0 q) = max{d(r, pq), d(r0 , pq)}.\nBy assumption 2rx − ε = qx and 2ry + ε + 1 = qy . So we get\nq r −q r\nd(r, pq) = y√x 2 x 2y\nqx +qy\n\n=\n\nqy −ε−1\n2\nqx2 +qy2\n\nqy qx2+ε −qx\n\n√\n\n= √ 12\n\nqx +qy2\n\n2\n\nSimilarly,\n\n(qy ε + qx ε + qx ).\n\n1\nd(r0 , pq) = q\n(qy ε + qx ε − qx ).\n2 qx2 + qy2\n\nSetting x := qx /qy , we observe\n1\n(qy\n2 (xqy )2 +qy2\nx+1/2\n√\n√x2 +1\n\nH(pq, prr0 q) ≤ √\n=\n≤\nas the function\n\n+ 2xqy )\n\n5/2,\n\nx + 1/2\nf (x) = √\nx2 + 1\n\nattains its global maximum at x = 2.\n\n\u0003\n\nThe following lemma is a statement about the order ≺ and will be the key ingredient of the\nproof of Theorem 2.\n7\n\n\fLemma 8 Let {x ∈ Z|A ≤ x < B} be an interval of integers with the following properties:\n(i) Its number of elements is B − A = 2k+1 − 1 for some number k.\n(ii) |(A + B − 1)/2|2 ≥ k and |x|2 < k, for any other A ≤ x < B, x 6= (A + B − 1)/2.\nLet x1 ≺ x2 ≺ . . . ≺ x2k+1 −1 be the elements of the interval sorted in increasing order according\nto ≺.\nThen elements from the left half and elements from the right half of the interval alternate,\nthat is, if xi < (A + B − 1)/2 for some 1 ≤ i < 2k+1 − 1, then xi+1 ≥ (A + B − 1)/2.\nProof. Define M := (A+B −1)/2. Assume for a contradiction that there is an 1 ≤ i < 2k+1 −1\nsuch that both xi < M and xi+1 < M . First we look at the case that |A − 1|2 < |M |2 . Then\non one hand, xi ≺ xi + 2k , because |xi − j|2 = |xi + 2k − j|2 for all 0 ≤ j ≤ xi − A and\n|xi − j|2 = |A − 1|2 < |M |2 = |xi + 2k − j|2 for j = xi − (A − 1). (We use the simple\nobservation that if |x|2 < k then |x + 2k |2 = |x|2 .) But on the other hand, xi + 2k ≺ xi+1 ,\nbecause there is a 0 ≤ j0 ≤ xi − A such that |xi + 2k − j0 |2 = |xi − j0 |2 < |xi+1 − j0 |2 and\n|xi + 2k − j|2 = |xi − j|2 = |xi+1 − j|2 for all 0 ≤ j < j0 . So xi ≺ xi + 2k ≺ xi+1 , a contradiction.\n\nIn the case |A − 1|2 > |M |2 , we can argue similarly that xi ≺ xi+1 + 2k ≺ xi+1 . (Note\nthat equality never occurs, as |A − 1|2 = |M |2 implies |(A − 1 + M )/2|2 ≥ |M |2 ≥ k, but\n|(A − 1 + M )/2|2 < k by assumption.)\nWe have shown that if xi < M , then xi+1 ≥ M . Similarly we can show that xi > M implies\nxi+1 ≤ M . So the elements to the left and to the right of M alternate.\n\u0003\n\nProof. (of Theorem 2) Let p, q ∈ Z2 . We may assume that px <√\nqx and py < qy . We are going\nto prove that H(pq, S≺ (p, q)) ≤ 2c log(px + py − qx − qy ) for c = 5/2. Let r ∈ S≺ (p, q) be the\npoint with the property that rx + ry is the greatest element of the segment interval, that is,\nrx + ry \u001f s for all s ∈ [px + py , qx + qy ), s 6= rx + ry , see Figure 4 for an example. Now let s0 be\nthe second greatest element of the segment interval according to ≺. Define k := |s0 |2 + 1.\nWe can extend the segment S≺ (p, q) over both endpoints, moving both p and q such that\n|px + py − 1|2 ≥ k and |qx + qy |2 ≥ k, that is, we extend the segment as far as we can, so\nthat k, defined as above, remains unchanged. From Lemma 6 we get that by this extension we\ndecreased the Hausdorff distance by at most a factor of 2. Now the segment interval contains\nexactly 2k+1 − 1 elements and rx + ry is the element in the very middle. We call such a segment\nnormalized.\nWe are going to proceed by induction √\non k to prove that for all normalized digital line\nsegments H(pq, S≺ (p, q)) ≤ ck with c = 5/2. This will prove the theorem, as k + 1 =\nlog(px + py − qx − qy + 1), the distance of the unnormalized original segment (we started from)\nis at most 2ck = 2c(log(px + py − qx − qy + 1) − 1) ≤ 2c log(px + py − qx − qy ).\nIn the base case k = 1, the segment interval consists of 3 numbers, so S≺ (p, q) is a path of\nlength 3 and by checking all possibilities we see that H(pq, S≺ (p, q)) < c.\nIf k > 1, the idea is to split the segment at r into two subsegments which are similar in\nsome sense and apply induction. Let r0 = (rx , ry + 1) be the point that comes after r in the\nsegment S≺ (p, q). (We know that we go up at r, because we go up at least once and rx + ry is\nthe greatest element of the segment interval). Consider the subsegments S≺ (p, r) and S≺ (r0 , q)\nand partition the segment interval accordingly. The key observation is that picking the elements\nof the interval according to ≺ starting with the greatest, we first get r, and then alternately\n8\n\n\fq\n\nr0\np\n\n0\n\nr\n\n4\n\n8\n\n12\n\nFigure 4: The digital line segment from p = (2, 3) to q = (7, 5), with the ordered segment\ninterval 8 \u001f 10 \u001f 6 \u001f 9 \u001f 5 \u001f 11 \u001f 7. The Euclidean segments pq and prr0 q (dashed) can have\nHausdorff distance at most c, as shown in Lemma 7.\nan element of the left and the right subsegment interval. This is shown in Lemma 8 setting\nA = px + py , B = qx + qy . Therefore, up to a difference of at most one, half of the qy − py − 1\ngreatest elements (after rx +ry ) belong to [px +py , rx +ry ) and half of them to [rx +ry +1, qx +qy ).\nThis implies that p, q, r, r0 meet the conditions of Lemma 7, leading to H(pq, prr0 q) ≤ c. By\nthe induction hypothesis we have H(pr, S≺ (p, r)) ≤ c(k − 1) and H(r0 q, S≺ (r0 , q)) ≤ c(k − 1).\nNow H(prr0 q, S≺ (p, q)) = max{H(pr, S≺ (p, r)), H(r0 q, S≺ (r0 , q))} ≤ c(k − 1). Using the triangle\ninequality we conclude H(pq, S≺ (p, q)) ≤ ck.\n\u0003\n\n4\n\nA step towards a characterization of CDSes\n\nNow we approach the same problem from a different angle, taking arbitrary CDSes and trying\nto find some common patterns in their structure. Knowing that condition (C1) holds for all\nCDSes, it is easy to verify that we can analyze the segments with non-positive and non-negative\nslopes separately, as they are completely independent. More precisely, the union of any CDS\non segments with non-positive slopes and another CDS on segments with non-negative slopes\nis automatically a CDS. Having this in mind, in this section we will proceed with the analysis\nof only one half of a CDS, namely of segments with non-negative slope.\nWe will show that, in a CDS, all the segments with non-negative slope emanating from a\nfixed point must be derived from a total order. However, as we will show later, these orders\nmay differ for different points.\nTheorem 9 For any CDS and for any point p = (px , py ) ∈ Z2 , there is a total order ≺p that\nis uniquely defined on both (−∞, px + py − 1] and [px + py , +∞), such that the segments with\nnon-negative slope emanating from p are derived from ≺p (in the way described in Section 2).\nProof. We fix a CDS S and a point p. The segments with non-negative slope with p = (px , py )\nas their upper-right point will induce an order on the integers smaller than px + py , and the\nsegments for which p is the lower-left endpoint will induce an order on the rest of the integers.\nIn the following we will just look at the latter type of segments. First, we prove an auxiliary\nstatement.\nLemma 10 In a CDS, it cannot happen that for two segments with non-negative slope having\nthe same lower-left endpoint p, one of them goes up at (a, C − a) and the other goes right at\n(b, C − b), for some C and a > b.\n9\n\n\f(b, C − b)\n\n(a, C − a)\n\nx+y =C\np\n\nFigure 5: Two segments having p as their lower-left endpoint, one of them going up at\n(a, C − a) and the other going right at (b, C − b), with a > b.\nProof. (of Lemma 10) Let us, for a contradiction, assume the opposite, see Figure 5. Now, we\nlook at the a − b + 1 segments between the point p and each of the points on the line x + y = C\nbetween the points (a, C − a) and (b, C − b). It is possible to extend all of them through their\nupper-right endpoints, applying (S4). Note that each of the extended segments goes through a\ndifferent point on the line x + y = C, and hence, because of condition (C3), no two of them can\ngo through the same point on the line x + y = C + 1. But, there are only a − b available points\non the line x + y = C + 1 between the points (a, C − a + 1) and (b + 1, C − b), one less than the\nnumber of segments, a contradiction.\n\u0003\nNow, we define the relation ≺p in the following way. Whenever there is a segment in S\nwith non-negative slope starting at p, going right at a point (x, D − x) and going up at a point\n(x0 , E − x0 ), for some x and x0 , we set D ≺p E. This way we defined a relation on [px + py , +∞),\nwhich is obviously irreflexive. To show that ≺p is a total order, it remains to prove that it is\nasymmetric, transitive and total.\nTo show asymmetry, assume for a contradiction that for some integers D and E we have\nboth D ≺p E and E ≺p D. That can happen only when there are two segments with nonnegative slope having p as their lower-left endpoint, such that on the line x + y = D one of\nthem goes up, the other right, and then on x + y = E they both go in different direction than\nat x + y = D. But then the situation described in Lemma 10 must occur on one of the two\nlines, a contradiction.\nNext, if C ≺p D and D ≺p E, then we also have C ≺p E – we just take a segment starting\nfrom p that goes right at C and up at D, and (if necessary) extend it until it passes the line\nx + y = E. It must also go up at E, because of D ≺p E and the asymmetry of ≺p . Hence, the\nrelation ≺p is transitive.\nIt remains to prove the totality of ≺p . That is, for any pair of integers px + py ≤ D < E,\neither D ≺p E or E ≺p D holds. Consider a segment from p to some point q on the line\nx + y = E, such that this segment splits at q, that is, there are two extensions of the segment,\none going up and another one going right. Such segment exists since in the upper-right quadrant\nof p, the line x + y = E + 1 contains one more point than the line x + y = E. If we look at\nall the segments between p and the points on x + y = E + 1, the pigeonhole principle ensures\nthat two of them will contain the same point q on the line x + y = E. Now the segment S(p, q)\n10\n\n\fy=0\n\np\n\nFigure 6: The waterline example: Examples of three characteristic segments, and the rays\nemanating from a point p, which is below the waterline\ncrosses the line x + y = D at some point q 0 . Depending on whether it goes up or right at the\npoint q 0 , either E ≺p D or D ≺p E holds.\n\u0003\nTo see that these orders can differ for different points, consider the following example of a\nCDS, which we call the waterline example because of the special role of the x-axis. To connect\ntwo points with a segment, we do the following. Above the x-axis we go first right, then up,\nbelow the x-axis we go first up, then right, and when we have to traverse the x-axis, we go\nstraight up to it, then travel on it to the right, and finally continue up, see Figure 6. It is easy\nto check that this construction satisfies all five axioms.\nNow, if we consider a point p = (a, b) below the waterline, b < 0, the induced total order ≺p\non [a + b, +∞) is a ≺p a + 1 ≺p . . . ≺p (+∞) ≺p a − 1 ≺p a − 2 ≺p . . . ≺p a + b, and the order\non (−∞, a + b − 1] is a + b − 1 ≺p a + b − 2 ≺p . . . ≺p −∞. If p is above the waterline, b ≥ 0,\nthe induced total orders are a − 1 ≺ a − 2 ≺ . . . ≺ (−∞) ≺ a ≺ a + 1 ≺ . . . ≺ a + b − 1 and\na + b ≺ a + b + 1 ≺ . . . ≺ +∞. Obviously, there is no total order on Z compatible with these\norders for all possible choices of p.\nThe special role played by the x-axis in the waterline example can be fulfilled by any other\nmonotone digital line with a positive slope; above the line go right, then up, below the line go\nup, then right, and whenever the line is hit, follow it until either the x- or the y-coordinate\nmatches that of the final destination, see Figure 7. Again, it is straightforward to show that\nthis way we obtain a CDS.\nA way to see that such a CDS cannot be derived from a total order is to observe that now the\ndiagonal translation of a digital line segment does not always yield another digital line segment,\nthat is, these examples do not satisfy the condition from Observation 4. Actually, we can prove\nthat it suffices to add this condition to force a unifying total order on all integers.\nTheorem 11 Let S be a CDS, such that for any t ∈ Z and any p, q ∈ Z2 ,\nS(p + (t, −t), q + (t, −t)) = S(p, q) + (t, −t).\n11\n\n\fFigure 7: A more exotic example of a CDS with an arbitrary \"special\" line (bold and dotted).\nThen there is a unique total order ≺ on Z such that S = S≺ .\nProof. Let p, q ∈ Z2 . By Theorem 9 the segments starting at p define a unique total order\n≺p on [px + py , ∞) and similarly the segments starting at q define a unique total order ≺q on\n[qx + qy , ∞). Let qx + qy ≥ px + py . We want to check whether these two orders agree on\n[qx + qy , ∞). Assume for contradiction there are integers qx + qy ≤ A < B such that there is a\nsegment S starting at p going to some point r implying B ≺p A and another segment T starting\nat q implying A ≺q B, see Figure 8 for an example. We translate the segment S diagonally by a\nvector (t, −t) until q lies on the translated segment S 0 from p0 to r0 . Then the subsegment from\nq to r0 still goes up at level A and to the right at level B, implying B ≺q A, a contradiction.\nTherefore we can define a unique total order ≺ as follows. To compare two integers A\nand B take any point p with px + py ≤ A and define A ≺ B if and only if A ≺p B. By the\nargument above, this definition is independent of the choice of p and the arguments in the proof\nof Theorem 9 carry over to ≺, which shows it is a total order.\n\u0003\n\n5\n\nDigital lines\n\nEven though our focus is on the digitalization of line segments, the present setup can be conveniently extended to a definition of digital lines. We say that a digital line is the vertex set of a\npath infinite in both directions in the Z2 base graph, such that the digital line segment between\nany two points on the digital line belongs to the digital line.\nIn this section we restrict our attention to CDSes that are derived from a total order as\ndescribed in Section 2. Furthermore, for simplicity, we are only going to consider lines with\n12\n\n\fr\n\nr0\nS\nS0\np\n\nT\nx+y =B\nq\nx+y =A\n\np0\n\nFigure 8: Two line segments leading to a inconsistency in the derived orders. After translating\none of them diagonally (dashed) we find a contradiction to the subsegment property.\nnon-negative slope, meaning that the Euclidean segment between any two points of the line has\nnon-negative slope (including zero and infinity).\nConsider a digital line ` derived from S≺ . We define A` ⊆ Z to be the set of numbers x + y\nfor which ` goes upward at (x, y) and call it the slope of `. Note that the slope A` is an interval\nin (Z, ≺) which is unbounded in the increasing direction, i.e., if x ∈ A` , then for any y \u001f x we\nhave y ∈ A` . This implies that there is a natural total order on the set of possible slopes given\nby inclusion.\nThe following observation follows directly from the definition of S≺ . Starting at a point p\nwe can construct a line with slope A.\nObservation 12 Every line ` can be described by its slope A` and a point p it contains. Also,\ngiven a point p, every ≺-interval A which is unbounded in the increasing direction is a valid\nslope of a line through p, that is, there is a line ` such that p ∈ ` and A` = A.\nIt follows directly from Theorem 3 that two lines having a point in common cannot split\nand then meet later. Using similar arguments we can see that two lines cannot \"touch\" without\ncrossing.\nObservation 13 If two different lines intersect, then they either cross (having a common segment), or they have a common half-line.\nIt is straightforward to verify that the following lemma holds.\nLemma 14 Consider two different slopes A and B with A ⊂ B. Let I = B \\ A be the difference\nof the slopes. We distinguish three cases.\n1) If I is finite, then there are lines l and s such that Al = A, As = B and l and s intersect\nin a lower-left halfline and there are lines l0 , s0 with slopes Al0 = A, As0 = B intersecting\nin an upper-right halfline.\n13\n\n\f2) If I is infinite and bounded in one direction in the natural order on Z, then we can find\nlines l and s with slope A and B intersecting in a lower-left or an upper-right halfline\ndepending on whether I is lower- or upper-bounded with respect to the natural order.\n3) If I is unbounded in both directions, then all lines l and s with slope A and B do intersect\nin a finite segment.\nWe define two lines to be parallel if they do not cross, that is, according to Observation 13,\ntwo lines are parallel if they are disjoint or if they agree on a halfline. We distinguish two\npossible cases how the slope A` of a line ` may look like. If there is a c ∈ Z such that\nA` = [c, ∞)≺ = {a ∈ Z|a \u001f c} ∪ {c} or A` = (c, ∞)≺ = {a ∈ Z|a \u001f c}, that is, if its boundary\ncan be described by the smallest element, either including or excluding this element, then we\ncall the slope A` rational. In the special cases A` = Z and A` = ∅ we define A` as rational, too.\nIf no such c exists, or, in other words, if A` does not have a smallest element and its complement\nZ \\ A` does not have a greatest element (and they are not empty), then we call A` irrational.\nWe proceed by analyzing the digital lines derived from the special total order that we defined\nin Section 3. With the help of the previous lemma, we can characterize which lines do have\nunique parallels and which do not.\nTheorem 15 Let ≺ be the total order on Z defined in Section 3 using the powers of 2, S≺ the\nCDS obtained from it, and ` a line with respect to S≺ . Let p ∈ Z2 such that p ∈\n/ `.\n1) If the slope A` is irrational, then there is a unique line `0 through p that is parallel to `.\nFurthermore, A`0 = A` .\n2) If A` is rational, then ` has exactly two parallels `0 and `00 through p, one of them with the\nsame slope as `, the other with a slope that differs by one element. Consequently `0 and `00\neither have a common halfline to the left and split at one point to run parallel at distance\none thereafter, or the other way round.\nProof. Note that ≺ is a dense order on Z, that is, for any integers a ≺ b, we find a c ∈ Z such\nthat a ≺ c ≺ b. Equivalently, this means that every ≺-interval [a, b]≺ with a 6= b is infinite. Let\ns be an arbitrary line through p parallel to `. Consider the symmetric difference of the slopes\nI = A` 4As . If I is empty, the slopes are equal and s is the diagonal translate of ` going through\np. If I 6= ∅, by density of the order, I is either infinite or consists only of one element a. If I is\ninfinite, then it is unbounded according to the natural order in both directions. (Beside density,\nthis is the only property of ≺ that we use.) According to Lemma 14, s and ` do intersect in\na finite segment in this case, which is a contradiction because s is parallel to `. Therefore,\nI consists of one element. If A` is irrational, by adding one element to A` or removing one\nelement from A` we do not get an interval. Hence, in this case, there is only one possible slope\nfor any line parallel to `, namely, A` . If A` is rational, then either A` = {a ∈ Z|a \u001f c} ∪ {c}\nor A` = {a ∈ Z|a \u001f c}, for some c ∈ Z, so removing c or adding c, respectively, yields the\nonly different possible slope for a parallel through p. As the slopes of these two parallels only\ndiffer by one element, they either have a common halfline to the left or a common halfline to\nthe right.\n\u0003\n\n14\n\n\f6\n\nHigher dimensions\n\nIt is natural to ask whether there is a CDS in more than two dimensions. The definition of a\nCDS directly carries over to the higher dimensional spaces. Instead of Z2 we now consider Zd ,\nfor a fixed integer d ≥ 3, with the usual graph structure, that is, two points p and q are adjacent\nif they differ in exactly one coordinate by exactly one. The axioms (S1)-(S4) stay the same,\nverbatim, and the monotonicity axiom (S5) now reads as follows: If for p = (p1 , . . . , pd ), q =\n(q1 , . . . , qd ) ∈ Zd there is an i such that pi = qi , then for all r = (r1 , . . . , rd ) ∈ S(p, q) we\nhave ri = pi = qi . We define the slope type of a pair of points (p, q) as the sign vector\n(σ1 , . . . , σd ) ∈ {+1, −1}d , σi = +1 if pi ≤ qi , and σi = −1 if pi > qi . The slope type of a digital\nsegment S(p, q) is defined as the slope type of (p, q). We say a segment has strictly positive\nslope, if its slope type is (+1, . . . , +1), that is, the coordinates are monotone increasing in each\ncoordinate.\nIt is not hard to see that we can again derive a consistent system from an arbitrary total\norder ≺ on Z if we only consider segments that have strictly positive slope, that is, slope type\n(+1, . . . , +1); the only difference is that now we have to cut the segment interval [p1 + . . . +\npd , q1 + . . . + qd − 1] into d parts, according to ≺. Let p, q ∈ Zd be two points, such that pi ≤ qi\nfor all 1 ≤ i ≤ d. We can define the segment S≺ (p, q) in a similar way as in the two dimensional\ncase – starting at p and repeatedly going in one of the d possible directions, collecting points\nfrom Zd , until reaching q. If we are at a point (r1 , . . . , rd ) for which r1 + r2 + . . . + rd is among\nthe qd − pd greatest elements of the segment interval [p1 + . . . + pd , q1 + . . . + qd − 1] according\nto ≺, we proceed in direction d; if it is among the qd−1 − pd−1 greatest elements of the segment\ninterval that remain after removing the qd − pd elements that were the greatest, we proceed in\ndirection d − 1, and so on. Finally, if r1 + r2 + . . . + rd it is among the q1 − p1 smallest elements\nof the segment interval, we proceed in the first direction.\nTheorem 16 The definition above yields a CDS of segments with strictly positive slope.\nProof.\nThe crucial axiom to verify is the subsegment property (S3). Assume there are\ntwo segments with strictly positive slope, splitting at some point p and meeting again for the\nfirst time at q. The two subsegments from p to q can be seen as words over the alphabet\n[d] = {1, 2, . . . , d}, where 1 stands for going in the first direction, 2 for going in the second\ndirection, and so on. So let α = a1 a2 . . . ak , β = b1 b2 . . . bk ∈ [d]k be these two words. By\nassumption they differ at the beginning and at the end and they contain the same number\nof each of the letters, that is, for any l ∈ [d], |{i : ai = l}| = |{i : bi = l}|. Without\nloss of generality we may assume that a1 > b1 . Then there must be an 1 < i ≤ k such\nthat ai < a1 and bi > b1 . (If there were no such i, then for any 1 < i ≤ k with ai < a1\nwe have bi ≤ b1 < a1 . Now looking at all letters that are strictly smaller than a1 in both\nwords, we see that there is at least one such letter more in b, namely at the first position, a\ncontradiction.) This leads to a contradiction, as translated back to the original setting it implies\np1 + . . . + pd \u001f p1 + . . . + pd + i − 1, if we look at the interval of the first segment, and at the\nsame time p1 + . . . + pd ≺ p1 + . . . + pd + i − 1, if we look at the interval of the second segment.\nThis proves (S3).\nThe rest of the axioms can be verified similarly as in the 2-dimensional case.\n\n\u0003\n\nOf course, we can use the same construction to define segments for all the remaining slope\ntypes. However, unlike in the 2-dimensional case, putting them all together in an attempt to\nconstruct a complete CDS fails, as the axiom (S3) is violated. We are curious if this approach\nto construction can be modified to yield a CDS.\n15\n\n\fAcknowledgments\nWe are indebted to Jiřı́ Matoušek, who posed this problem at the 7th Gremo Workshop on\nOpen Problems - GWOP 2009. We would like to thank József Solymosi for participating in the\nfruitful discussions that led to the main result of this paper. Finally, we thank the organizers\nof GWOP 2009 for inviting us to the workshop and providing us with a gratifying working\nenvironment.\n\nReferences\n[1] J. Chun, M. Korman, M. Nöllenburg, and T. Tokuyama. Consistent digital rays. Discrete\nComput. Geom., 42(3):359–378, 2009.\n[2] M. T. Goodrich, L. J. Guibas, J. Hershberger, and P. J. Tanenbaum. Snap rounding line\nsegments efficiently in two and three dimensions, 1997.\n[3] D. H. Greene and F. F. Yao. Finite-resolution computational geometry. In SFCS '86:\nProceedings of the 27th Annual Symposium on Foundations of Computer Science, pages\n143–152, Washington, DC, USA, 1986. IEEE Computer Society.\n[4] R. Klette and A. Rosenfeld. Digital straightness – a review. Discrete Appl. Math., 139(13):197–230, 2004.\n[5] W. M. Schmidt. Irregularities of distribution. VII. Acta Arith., 21:45–50, 1972.\n[6] K. Sugihara. Robust geometric computation based on topological consistency. In V. N.\nAlexandrov, J. Dongarra, B. A. Juliano, R. S. Renner, and C. J. K. Tan, editors, International Conference on Computational Science (1), volume 2073 of Lecture Notes in Computer\nScience, pages 12–26. Springer, 2001.\n[7] J. van der Corput. Verteilungsfunktionen. I. Mitt. Proc. Akad. Wet. Amsterdam, 38:813–821,\n1935.\n\n16\n\n\f"}