{"id": "http://arxiv.org/abs/1006.2147v1", "guidislink": true, "updated": "2010-06-10T20:28:29Z", "updated_parsed": [2010, 6, 10, 20, 28, 29, 3, 161, 0], "published": "2010-06-10T20:28:29Z", "published_parsed": [2010, 6, 10, 20, 28, 29, 3, 161, 0], "title": "Uniform chemical pressure effect in solid solutions Ba(1-x)Sr(x)Fe2As2\n  and Sr(1-x)Ca(x)Fe2As2", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1006.1895%2C1006.5207%2C1006.4667%2C1006.3919%2C1006.0471%2C1006.0461%2C1006.0429%2C1006.0219%2C1006.5231%2C1006.0217%2C1006.4644%2C1006.4676%2C1006.0741%2C1006.0811%2C1006.1219%2C1006.2876%2C1006.3818%2C1006.1624%2C1006.0908%2C1006.2347%2C1006.4864%2C1006.1385%2C1006.4747%2C1006.4457%2C1006.1401%2C1006.3853%2C1006.1164%2C1006.1178%2C1006.1402%2C1006.3963%2C1006.1745%2C1006.0176%2C1006.1396%2C1006.2038%2C1006.4090%2C1006.3218%2C1006.1596%2C1006.2563%2C1006.3091%2C1006.5378%2C1006.3469%2C1006.1993%2C1006.1054%2C1006.3321%2C1006.4850%2C1006.0146%2C1006.1316%2C1006.4251%2C1006.1628%2C1006.2742%2C1006.1379%2C1006.5790%2C1006.0881%2C1006.2079%2C1006.1440%2C1006.4600%2C1006.0808%2C1006.4176%2C1006.0378%2C1006.0545%2C1006.3357%2C1006.1101%2C1006.4902%2C1006.1986%2C1006.2468%2C1006.4430%2C1006.0211%2C1006.0938%2C1006.2322%2C1006.5557%2C1006.0275%2C1006.1900%2C1006.1577%2C1006.5088%2C1006.5914%2C1006.2648%2C1006.0769%2C1006.0739%2C1006.0672%2C1006.2728%2C1006.4588%2C1006.2237%2C1006.5130%2C1006.2147%2C1006.5123%2C1006.0821%2C1006.3814%2C1006.4786%2C1006.1867%2C1006.5584%2C1006.0118%2C1006.3619%2C1006.5811%2C1006.3725%2C1006.1847%2C1006.5723%2C1006.3824%2C1006.0369%2C1006.1220%2C1006.4221%2C1006.3914&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Uniform chemical pressure effect in solid solutions Ba(1-x)Sr(x)Fe2As2\n  and Sr(1-x)Ca(x)Fe2As2"}, "summary": "The effect of alkaline earth substitution on structural parameters was\nstudied in high-quality single crystals of Ba(1-x)Sr(x)Fe2As2 and\nSr(1-x)Ca(x)Fe2As2 grown by the self-flux method. The results of single-crystal\nand powder x-ray diffraction measurements suggest a continuous monotonic\ndecrease of both a- and c-axis lattice parameters, the c/a tetragonal ratio,\nand the unit cell volume with decreasing alkaline earth atomic radius as\nexpected by Vegard's law. As a result, the system experiences a continuously\nincreasing chemical pressure effect in traversing the phase diagram from x=0 in\nBa(1-x)Sr(x)Fe2As2 to x=1 in Sr(1-x)Ca(x)Fe2As2.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1006.1895%2C1006.5207%2C1006.4667%2C1006.3919%2C1006.0471%2C1006.0461%2C1006.0429%2C1006.0219%2C1006.5231%2C1006.0217%2C1006.4644%2C1006.4676%2C1006.0741%2C1006.0811%2C1006.1219%2C1006.2876%2C1006.3818%2C1006.1624%2C1006.0908%2C1006.2347%2C1006.4864%2C1006.1385%2C1006.4747%2C1006.4457%2C1006.1401%2C1006.3853%2C1006.1164%2C1006.1178%2C1006.1402%2C1006.3963%2C1006.1745%2C1006.0176%2C1006.1396%2C1006.2038%2C1006.4090%2C1006.3218%2C1006.1596%2C1006.2563%2C1006.3091%2C1006.5378%2C1006.3469%2C1006.1993%2C1006.1054%2C1006.3321%2C1006.4850%2C1006.0146%2C1006.1316%2C1006.4251%2C1006.1628%2C1006.2742%2C1006.1379%2C1006.5790%2C1006.0881%2C1006.2079%2C1006.1440%2C1006.4600%2C1006.0808%2C1006.4176%2C1006.0378%2C1006.0545%2C1006.3357%2C1006.1101%2C1006.4902%2C1006.1986%2C1006.2468%2C1006.4430%2C1006.0211%2C1006.0938%2C1006.2322%2C1006.5557%2C1006.0275%2C1006.1900%2C1006.1577%2C1006.5088%2C1006.5914%2C1006.2648%2C1006.0769%2C1006.0739%2C1006.0672%2C1006.2728%2C1006.4588%2C1006.2237%2C1006.5130%2C1006.2147%2C1006.5123%2C1006.0821%2C1006.3814%2C1006.4786%2C1006.1867%2C1006.5584%2C1006.0118%2C1006.3619%2C1006.5811%2C1006.3725%2C1006.1847%2C1006.5723%2C1006.3824%2C1006.0369%2C1006.1220%2C1006.4221%2C1006.3914&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The effect of alkaline earth substitution on structural parameters was\nstudied in high-quality single crystals of Ba(1-x)Sr(x)Fe2As2 and\nSr(1-x)Ca(x)Fe2As2 grown by the self-flux method. The results of single-crystal\nand powder x-ray diffraction measurements suggest a continuous monotonic\ndecrease of both a- and c-axis lattice parameters, the c/a tetragonal ratio,\nand the unit cell volume with decreasing alkaline earth atomic radius as\nexpected by Vegard's law. As a result, the system experiences a continuously\nincreasing chemical pressure effect in traversing the phase diagram from x=0 in\nBa(1-x)Sr(x)Fe2As2 to x=1 in Sr(1-x)Ca(x)Fe2As2."}, "authors": ["Shanta R. Saha", "Kevin Kirshenbaum", "Nicholas P. Butch", "Peter Y. Zavalij", "Johnpierre Paglione"], "author_detail": {"name": "Johnpierre Paglione"}, "author": "Johnpierre Paglione", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1088/1742-6596/273/1/012104", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1006.2147v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1006.2147v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "4 pages, 4 figures, and 1 table, submitted to SCES2010 proceedings", "arxiv_primary_category": {"term": "cond-mat.supr-con", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.supr-con", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "cond-mat.str-el", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1006.2147v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1006.2147v1", "journal_reference": null, "doi": "10.1088/1742-6596/273/1/012104", "fulltext": "Uniform chemical pressure effect in solid solutions Ba1−x Srx Fe2 As2 and Sr1−x Cax Fe2 As2\nS. R. Saha, K. Kirshenbaum, N. P. Butch and J. Paglione∗\nCenter for Nanophysics and Advanced Materials, Department of Physics,\nUniversity of Maryland, College Park, MD 20742\n\narXiv:1006.2147v1 [cond-mat.supr-con] 10 Jun 2010\n\nP. Y. Zavalij\nDepartment of Chemistry and Biochemistry, University of Maryland, College Park, MD 20742, USA\n(Dated: November 19, 2018)\nThe effect of alkaline earth substitution on structural parameters was studied in high-quality single crystals of Ba1−x Srx Fe2 As2 and Sr1−x Cax Fe2 As2 grown by the self-flux method. The results of\nsingle-crystal and powder x-ray diffraction measurements suggest a continuous monotonic decrease\nof both a- and c-axis lattice parameters, the c/a tetragonal ratio, and the unit cell volume with\ndecreasing alkaline earth atomic radius as expected by Vegard's law. As a result, the system experiences a continuously increasing chemical pressure effect in traversing the phase diagram from x = 0\nin Ba1−x Srx Fe2 As2 to x = 1 in Sr1−x Cax Fe2 As2 .\n\nThe recent discovery of high-temperature superconductivity in iron-based compounds has attracted much\ninterest. The parent phases of these compounds generally show antiferromagnetic order that onsets between\n130 K and 200 K, with superconductivity emerging when\nthe antiferromagnetic order of the parent compounds is\nsuppressed [1–5]. This proximity of magnetic and superconducting order parameters is widely thought to be\na key argument for an unconventional pairing mechanism, likely mediated by spin fluctuations [6, 7] similar\nto the cuprates [8, 9]. But in strong contrast to the copper oxides, superconductivity in iron arsenides can be\ninduced without changing the carrier concentration, either by applying external pressure [10, 11] or by isovalent chemical substitution. The highest Tc achieved so\nfar in these materials is ∼ 55 K in SmO1−x Fx FeAs [5]\nand (Sr,Ca)FeAsF [12, 13]. Oxygen-free FeAs-based compounds with the ThCr2 Si2 -type (122) structure also exhibit superconductivity induced by chemical substitution\nof alkali or transition metal ions [3, 14–16], the application of large pressures [11, 17–19], or lattice strain [20],\nwith transition temperatures as high as ∼ 37 K.\nFor the 122 phase, superconductivity has been induced\nby substituting Fe with not only 3d-transition metals\nsuch as Co and Ni, but also some of the 4d- and 5dtransition metals. Recently, Ru, Ir, and Pt substitution\nfor Fe were also shown to induce superconductivity in\nSrFe2 As2 and BaFe2 As2 [21–23]. Superconductivity with\nTc ∼ 31 K has also been shown to occur by isovalent substitution of P for As [24]. This gives the opportunity\nto tune magnetic character without nominally changing\ncharge carrier concentrations, for instance making the interpretation of transport coefficients much simpler than\nin the case of charge doping.\nIn order to investigate the possibility of applying uniform chemical pressure in a continuous manner, we have\nsynthesized the series of solid solutions Ba1−x Srx Fe2 As2\nand Sr1−x Cax Fe2 As2 by substituting isovalent alkaline\nearth atoms, and investigated the evolution of the crys-\n\ntal structure by high-resolution powder and single-crystal\nx-ray diffraction. Here we present our preliminary results\nthat suggest the unit cell of the Ba-Sr-Ca substitution series experiences a monotonic uniform chemical pressure\nas a function of alkaline earth atomic radius.\nSingle-crystal samples of Ba1−x Srx Fe2 As2 and\nSr1−x Cax Fe2 As2 were grown using the FeAs self-flux\nmethod [20]. Fe was first separately pre-reacted with\nAs via solid-state reaction of Fe (99.999%) powder\nwith As (99.99%) powders in a quartz tube of partial\natmospheric pressure of Ar. The precursor materials\nwere mixed with elemental Sr (99.95%) with either Ba\n(99.95%) or Ca (99.95%) in the ratio 4:1−x : x, placed\nin an alumina crucible and sealed in a quartz tube under\npartial Ar pressure. The mixture was heated to 1150◦C,\nslow-cooled to a lower temperature and then quenched\nto room temperature. Typical dimensions of as-grown\nsingle crystal specimen are ∼100 μm thickness and\nup to 5 mm width. Chemical analysis was performed\nusing both energy- and wavelength-dispersive x-ray\nspectroscopy (EDS and WDS).\nBoth EDS and WDS analysis of all Ba1−x Srx Fe2 As2\nand Sr1−x Cax Fe2 As2 samples showed the proper 1:2:2\nstoichiometry in all specimens reported herein, with\nno indication of impurity phases.\nFigure 1 compares the nominal alkaline earth concentration x in\nSr1−x Cax Fe2 As2 crystals with that measured by WDS\nand EDS analysis, using an average value determined\nfrom 8 different spots on each specimen. As shown by\nthe dotted line guide, the actual concentrations found by\nWDS are equal to the nominal values of x to within experimental error, indicating homogeneous substitution in\nthis series of solid solutions.\nDiffraction patterns were obtained by both powder\nand single-crystal x-ray diffraction and Rietfeld refinement (SHELXS-97) to I4/mmm structure. Powder x-ray\ndiffraction was performed at 250 K using a Smart Apex2\ndiffractometer with Mo-Kα radiation and a graphite\nmonochromator. Figure 2 shows a typical x-ray diffrac-\n\n\f2\n\n1\n\nSr Ca Fe As\n1-x\n\nx\n\n2\n\n2\n\nSr\n\nCa\n\n0.33\n\nFe As\n\n0.67\n\n2\n\n2\n\nIntensity (arb. units)\n\nx (measured)\n\nT = 250 K\n\n0.5\n\nWDS\nEDS\n0\n0\n\n0.2\n\n0.4\n\n0.6\n\n0.8\n\n1\n\nx (nominal)\n\nFIG. 1: Actual Ca concentration of Sr1−x Cax Fe2 As2 singlecrystal samples as a function of nominal concentration x, as\ndetermined by wavelength dispersive x-ray spectroscopy (data\npoints represent average value of 8 scanned points for each\nconcentration). Some of the specimens are also confirmed by\nenergy dispersive X-ray spectroscopy (EDS). The dotted line\nis a guide to eye which traces x(measured)=x(nominal).\n\ntion pattern obtained from a single-crystal sample of\nSr0.3 Ca0.7 Fe2 As2 . All of the main peaks can be indexed\nto the ThCr2 Si2 structure, with no impurity phases detected.\nTable 1 shows the crystallographic parameters determined by single-crystal x-ray-diffraction at 250 K in\nSr0.3 Ca0.7 Fe2 As2 . A Bruker Smart Apex2 diffractometer with Mo-Kα radiation, a graphite monochromator\nwith monocarp collimator, and a CCD area detector\nwere used for this experiment. The structure was refined\nwith SHELXL-97 software using 1033 measured reflections of which 115 were unique and 108 observed. The\nfinal residuals were R1 = 1.36% and 1.96% for the observed data and wR2 = 3.31% and 4.52% for all data for\nSrFe2 As2 and Sr0.3 Ca0.7 Fe2 As2 respectively. Sr and Ca\natoms were found to reside in the same site with a refined\nCa:Sr ratio of 0.33(1):0.67(1), giving the exact formula\nSr0.33 Ca0.67 Fe2 As2 from x-ray analysis.\nFigure 3 shows the unit cell of Sr0.33 Ca0.67 Fe2 As2 determined by single crystal x-ray diffraction at 250 K. The\nsize of the ellipsoids map the thermal agitation of the particular ion at 250 K with a 50% probability factor, which\nmeans the probability of finding the center of the atom\ninside the ellipsoid.\nFigure 4presents the variation of the a- and c-axis\nlattice constants (upper panel), the unit cell volume\nand the tetragonal c/a ratio (lower panel) with BaSr and Sr-Ca concentrations determined from refinements of the single crystal x-ray diffraction data for\nBa1−x Srx Fe2 As2 and Sr1−x Cax Fe2 As2 crystals taken at\n\n0\n\n10\n\n20\n30\n2θ (degree)\n\n40\n\n50\n\nFIG. 2: Typical x-ray powder diffraction pattern, shown for\nsample Sr0.33 Ca0.67 Fe2 As2 , obtained by using Mo-Kα radiation. The main peaks can be indexed with a tetragonal\nstructure and there are no impurity phases detected within\nexperimental accuracy.\n\nFIG. 3: Unit cell of Sr0.33 Ca0.67 Fe2 As2 determined by single\ncrystal x-ray diffraction at 250 K.\n\n250 K. Within experimental accuracy, the a- and c-axis\nlattice constants, the c/a ratio, and the unit cell volume\nall show a monotonic linear decrease with alkaline earth\nsubstitution in the continuous series from BaFe2 As2 to\nSrFe2 As2 to CaFe2 As2 . This fact indicates that the whole\n(Ba,Sr,Ca)Fe2 As2 series progression experiences a uni-\n\n\f3\nTABLE I: Crystallographic data for SrFe2 As2 and\nSr0.33 Ca0.67 Fe2 As2 determined by single-crystal x-ray\ndiffraction at 250 K. The structure was solved and refined\nusing the SHELXS-97 software, yielding lattice constants\nwith residual factor R= 1.36% and 1.95% for SrFe2 As2 and\nSr0.33 Ca0.67 Fe2 As2 , respectively.\nTemperature\nStructure\nSpace group\na(Å)\nb(Å)\nc(Å)\n3\nV (Å )\nZ\nDensity(g/cm3 )\nAtomic parameters:\nSr/Ca\nFe\nAs\nAtomic displacement\n2\nparameters Ueq (Å ):\nSr1/Ca1\nFe1\nAs1\nBond lengths (Å):\nSr/Ca-As\nFe-As\nFe-Fe\nBond angles (deg):\nAs-Fe-As\nFe-As-Fe\n\nSrFe2 As2\n250 K\nTetragonal\nI4/mmm\n3.9289(3)\n=a\n12.3172(12)\n190.17(4)\n2\n6.098\n\nSr0.33 Ca0.67 Fe2 As2\n250 K\nTetragonal\nI4/mmm\n3.9066(8)\n=a\n11.988(5)\n182.95(9)\n2\n6.045\n\n2a(0,0,0)\n4d(1/2,0,1/4)\n4e(0,0,z)\nz=0.36035(5)\n\n2a(0,0,0)\n4d(1/2,0,1/4)\n4e(0,0,z)\nz=0.36423(7)\n\n0.0108(2)\n0.0096(2)\n0.00964(17)\n\n0.0116(5)\n0.0125(3)\n0.0119(2)\n\n3.2677(4) × 8\n2.3890(4) × 4\n2.7782(2) × 4\n\n3.2062(7) × 8\n2.3855(7) × 4\n2.7624(6) × 4\n\n110.63(3) × 2\n109.94(4) × 4\n108.896(14) × 4 109.24(2) × 4\n71.105(14) × 4 70.76(2) × 4\n\nform chemical pressure effect due to the reduction of the\ncation size that follows Vegard's law, as expected for the\ndecreasing ionic radii of Ba, Sr and Ca, respectively.\nThe lattice parameters of Ba1−x Srx Fe2 As2 obtained\nin our experiments are consistent with the data reported\nin a recent study [25, 26], which found a systematic increase of T0 with increasing Sr content and no superconductivity. On the other hand, substitution of arsenic for the smaller phosphorus atoms, also instituting\na chemical pressure effect, induces superconductivity in\nBaFe2 As2−x Px [25]. Thus, a pressure-volume effect is\nclearly an oversimplified explanation for superconductivity in BaFe2 As2−x Px . In the future, it will be interesting\nto investigate the evolution of superconductivity combining both the chemical pressure effect of alkaline earth\nsubstitution studied here and another tuning parameter\nthat induces superconductivity in order to investigate the\nrole of lattice density in these phenomena.\nIn summary, we have systematically studied the\ncrystallographic properties in the solid solution series\nBa1−x Srx Fe2 As2 and Sr1−x Cax Fe2 As2 by growing high-\n\nFIG. 4: Upper panel: Variation of the a- and c-axis lattice\nconstants as a function of alkaline earth substitution in the\nseries Ba1−x Srx Fe2 As2 (left half) and Sr1−x Cax Fe2 As2 (right\nhalf) as determined from single crystal x-ray diffraction measurements at 250 K of single-crystal samples. Corresponding\nc/a ratio and unit the cell volume are plotted in the lower\npanel. In both panels, solid symbols indicate data acquired\nusing single-crystal specimens and open symbols represent\ndata determined by powder x-ray diffraction.\n\nquality single crystals by the self-flux method. X-ray\ndiffraction and data refinement reveal that the entire\n(Ba,Sr,Ca)Fe2 As2 series progresses according to Vegard's\nlaw, experiencing a uniform chemical pressure effect due\nto substitution with reduced ionic size from Ba to Sr to\nCa, respectively.\n\nACKNOWLEDGMENTS\n\nThe authors acknowledge B. W. Eichhorn for experimental assistance, and N.P.B. acknowledges support\nfrom a CNAM Glover fellowship. This work was supported by AFOSR-MURI Grant FA9550-09-1-0603.\n\n∗\nElectronic address: paglione@umd.edu\n[1] Kamihara Y, Watanabe T, Hirano M., and Hosono H.,\nJ. Am. Chem. Soc. 130, 3296 (2008).\n\n\f4\n[2] Cruz C de la, Huang Q, Lynn J W, Li J Y, Ratcli W,\nZarestky J L, Mook H A, Chen G F, Luo J L, Wang N\nL, and Dai P C, 2008 Nature 453, 899.\n[3] Rotter M, Tegel M, and Johrendt D, 2008 Phys. Rev.\nLett. 101 107006.\n[4] Saha S R, Butch N P, Kirshenbaum K, and Paglione J,\n2009 Phys. Rev. B 79 224519.\n[5] Ren Z -A, Lu W, Yang J, Yi W, Shen X -L, Zheng-Cai,\nChe G -C, Dong X -L, Sun L -L, Zhou F, and Zhao Z -X,\n2008 Chin. Phys. Lett. 25 2215.\n[6] Mazin I I and Schmalian J, 2009 Physica C 469 614.\n[7] Christianson A D, Goremychkin E A, Osborn R,\nRosenkranz S, Lumsden M D, Malliakas C D, Todorov I\nS, Claus H, Chung D. Y., Kanatzidis M G, Bewley R I,\nand Guidi T., 2008 Nature 456, 930.\n[8] Shirane G, Endoh Y, Birgeneau R J, Kastner M A, Hidaka Y, Oda M, Suzuki M, and Murakami T, 1987 Phys.\nRev. Lett. 59 1613.\n[9] Keimer B, Belk N, Birgeneau R J, Cassanho A, Chen C\nY, Greven M, Kastner M A, Aharony A, Endoh Y, Erwin\nR W, and Shirane G, 1992 Phys. Rev. B 46, 14034.\n[10] Okada H, Igawa K, Takahashi H, Kamihara Y, Hirano\nM, Hosono H, Matsubayashi K, and Uwatoko Y, 2008 J.\nPhys. Soc. Jpn. 77 113712.\n[11] Alireza P L, Chris-Ko Y T, Gillett J, Petrone C M, Cole\nJ M, Lonzarich G G, and Sebastian S E, 2009 J. Phys.:\nCondens. Matt. 21, 012208.\n[12] Zhu X, Han F, Cheng P, Mu G, Shen B, and Wen H H,\n2009 Europhys. Lett. 85 17011.\n[13] Cheng P, Shen B, Mu G, Zhu X, Han F, Zeng B, and\nWen H H, 2009 Euro Phys. Lett. 85 67003.\n[14] Sasmal K, Lv B, Lorenz B, Guloy A M, Chen F, Xue Y\n\n-Y, and Chu C -W, 2008 Phys. Rev. Lett. 101 107007.\n[15] Sefat A S, Jin R, McGuire M A, Sales B C, Singh D J,\nand Mandrus D, 2008 Phys. Rev. Lett. 101 117004.\n[16] Leithe-Jasper A, Schnelle W, Geibel C, and Rosner H,\n2008 Phys. Rev. Lett. 101 207004.\n[17] Torikachvili M S, Bud'ko S L, Ni N, and Canfield P C,\n2008 Phys. Rev. Lett. 101 057006.\n[18] Park T, Park E, Lee H, Klimczuk T, Bauer E D, Ronning\nF, and Thompson J D, 2008 J. Phys.: Condens. Matt.\n20 322204.\n[19] Kumar M, Nicklas M, Jesche A, Caroca-Canales N,\nSchmitt M, Hanfland M, Kasinathan D, Schwarz U, Rosner H, and Geibel C, 2008 Phys. Rev. B 78 184516.\n[20] Saha S R, Butch N P, Kirshenbaum K, and Paglione J,\n2009 Phys. Rev. Lett., 103 037005.\n[21] Schnelle W, Leithe-Jasper A, Gumeniuk R, Burkhardt\nU, Kasinathan D, and Rosner H, 2009 Phys. Rev. B 79\n214516.\n[22] Han F, Zhu X, Cheng P, Mu G, Jia Y, Fang L, Wang Y,\nLuo H, Zheng B, Shan L, Ren C, and Wen H H, 2009\nPhys. Rev. B. 80 024506.\n[23] Saha S R, Drye T., Kirshenbaum K, Butch N P, Zavalj P\nand Paglione J, 2010 J. Phys. Condens. Matt., 22 072204.\n[24] Kasahara S, Shibauchi T, Hashimoto K, Ikada K, Tonegawa S, Okazaki R, Ikeda H, Takeya H, Hirata K,\nTerashima T, and Matsuda Y, 2010 Phys. Rev. B 81\n184519.\n[25] Wang Z et al, Yang H, Ma C, Tian H, Shi H, Lu J, Zeng\nL, and Li J, 2009 J. Phys. Condens. Matt., 21 495701.\n[26] Rotter M, Hieke C, and Johrendt D, 2010\narXiv:1005.1411v1.\n\n\f"}