{"id": "http://arxiv.org/abs/1108.5767v1", "guidislink": true, "updated": "2011-08-29T21:50:16Z", "updated_parsed": [2011, 8, 29, 21, 50, 16, 0, 241, 0], "published": "2011-08-29T21:50:16Z", "published_parsed": [2011, 8, 29, 21, 50, 16, 0, 241, 0], "title": "Neutrino trapping in braneworld extremely compact stars", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1108.0291%2C1108.1127%2C1108.4390%2C1108.2624%2C1108.4524%2C1108.3118%2C1108.1358%2C1108.0949%2C1108.1220%2C1108.4715%2C1108.0963%2C1108.2852%2C1108.0173%2C1108.2042%2C1108.4213%2C1108.2412%2C1108.1213%2C1108.5350%2C1108.3368%2C1108.3856%2C1108.4833%2C1108.0270%2C1108.2674%2C1108.0203%2C1108.5466%2C1108.6288%2C1108.4971%2C1108.2518%2C1108.3259%2C1108.0544%2C1108.3996%2C1108.3876%2C1108.1969%2C1108.4683%2C1108.5629%2C1108.3643%2C1108.4316%2C1108.4928%2C1108.0331%2C1108.1784%2C1108.3395%2C1108.3983%2C1108.1338%2C1108.2919%2C1108.0927%2C1108.0542%2C1108.1954%2C1108.2226%2C1108.5767%2C1108.2136%2C1108.1324%2C1108.5484%2C1108.6218%2C1108.0015%2C1108.4750%2C1108.2229%2C1108.1675%2C1108.1534%2C1108.2084%2C1108.2612%2C1108.1012%2C1108.3015%2C1108.3301%2C1108.0026%2C1108.2616%2C1108.3993%2C1108.2726%2C1108.2565%2C1108.1231%2C1108.1738%2C1108.1450%2C1108.5452%2C1108.4235%2C1108.5230%2C1108.5064%2C1108.0419%2C1108.0968%2C1108.2149%2C1108.6182%2C1108.0149%2C1108.4514%2C1108.0873%2C1108.1483%2C1108.3779%2C1108.5254%2C1108.4389%2C1108.5920%2C1108.6223%2C1108.0274%2C1108.3915%2C1108.3263%2C1108.0807%2C1108.1490%2C1108.4758%2C1108.2722%2C1108.6290%2C1108.5723%2C1108.4919%2C1108.1331%2C1108.4321%2C1108.0775&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Neutrino trapping in braneworld extremely compact stars"}, "summary": "Extremely Compact Stars (ECS) contain trapped null geodesics. When such\nobjects enter the evolution period admitting geodetical motion of neutrinos,\ncertain part of neutrinos produced in their interior will be trapped\ninfluencing their neutrino luminosity and thermal evolution. We study neutrino\ntrapping in the braneworld ECS, assuming uniform distribution of neutrino\nemissivity and massless neutrinos. We give the efficiency of the neutrino\ntrapping effects in the framework of the simple model of the internal spacetime\nwith uniform distribution of energy density, and external spacetime described\nby the Reissner-Nordstr\\\"om geometry characterized by the braneworld \"tidal\"\nparameter $b$. For $b < 0$ the external spacetime is of the black-hole type,\nwhile for $b > 0$ the external spacetime can be of both black-hole and\nnaked-singularity type. Then the ECS surface radius $R$ can be located also\nabove the unstable (outer) photon circular orbit. Such basically new types of\nthe spacetimes strongly alter the trapping phenomena as compared to the\nstandard case of $b = 0$. It is shown that the neutrino trapping effects are\nslightly lowered by the presence of physically more plausible case of $b < 0$,\nas compared to the standard internal Schwarzschild spacetime, while they can be\nmagnified by positive tidal charges if $b < 1$ and lowered for $b > 1$.\nHowever, potential astrophysical relevance of the trapping phenomena is\nstrongly enhanced for negative tidal charges enabling a significant enlargement\nof the ECS surface radius to values coherent with recent observations.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1108.0291%2C1108.1127%2C1108.4390%2C1108.2624%2C1108.4524%2C1108.3118%2C1108.1358%2C1108.0949%2C1108.1220%2C1108.4715%2C1108.0963%2C1108.2852%2C1108.0173%2C1108.2042%2C1108.4213%2C1108.2412%2C1108.1213%2C1108.5350%2C1108.3368%2C1108.3856%2C1108.4833%2C1108.0270%2C1108.2674%2C1108.0203%2C1108.5466%2C1108.6288%2C1108.4971%2C1108.2518%2C1108.3259%2C1108.0544%2C1108.3996%2C1108.3876%2C1108.1969%2C1108.4683%2C1108.5629%2C1108.3643%2C1108.4316%2C1108.4928%2C1108.0331%2C1108.1784%2C1108.3395%2C1108.3983%2C1108.1338%2C1108.2919%2C1108.0927%2C1108.0542%2C1108.1954%2C1108.2226%2C1108.5767%2C1108.2136%2C1108.1324%2C1108.5484%2C1108.6218%2C1108.0015%2C1108.4750%2C1108.2229%2C1108.1675%2C1108.1534%2C1108.2084%2C1108.2612%2C1108.1012%2C1108.3015%2C1108.3301%2C1108.0026%2C1108.2616%2C1108.3993%2C1108.2726%2C1108.2565%2C1108.1231%2C1108.1738%2C1108.1450%2C1108.5452%2C1108.4235%2C1108.5230%2C1108.5064%2C1108.0419%2C1108.0968%2C1108.2149%2C1108.6182%2C1108.0149%2C1108.4514%2C1108.0873%2C1108.1483%2C1108.3779%2C1108.5254%2C1108.4389%2C1108.5920%2C1108.6223%2C1108.0274%2C1108.3915%2C1108.3263%2C1108.0807%2C1108.1490%2C1108.4758%2C1108.2722%2C1108.6290%2C1108.5723%2C1108.4919%2C1108.1331%2C1108.4321%2C1108.0775&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Extremely Compact Stars (ECS) contain trapped null geodesics. When such\nobjects enter the evolution period admitting geodetical motion of neutrinos,\ncertain part of neutrinos produced in their interior will be trapped\ninfluencing their neutrino luminosity and thermal evolution. We study neutrino\ntrapping in the braneworld ECS, assuming uniform distribution of neutrino\nemissivity and massless neutrinos. We give the efficiency of the neutrino\ntrapping effects in the framework of the simple model of the internal spacetime\nwith uniform distribution of energy density, and external spacetime described\nby the Reissner-Nordstr\\\"om geometry characterized by the braneworld \"tidal\"\nparameter $b$. For $b < 0$ the external spacetime is of the black-hole type,\nwhile for $b > 0$ the external spacetime can be of both black-hole and\nnaked-singularity type. Then the ECS surface radius $R$ can be located also\nabove the unstable (outer) photon circular orbit. Such basically new types of\nthe spacetimes strongly alter the trapping phenomena as compared to the\nstandard case of $b = 0$. It is shown that the neutrino trapping effects are\nslightly lowered by the presence of physically more plausible case of $b < 0$,\nas compared to the standard internal Schwarzschild spacetime, while they can be\nmagnified by positive tidal charges if $b < 1$ and lowered for $b > 1$.\nHowever, potential astrophysical relevance of the trapping phenomena is\nstrongly enhanced for negative tidal charges enabling a significant enlargement\nof the ECS surface radius to values coherent with recent observations."}, "authors": ["Zdenek Stuchlik", "Jan Hladik", "Martin Urbanec"], "author_detail": {"name": "Martin Urbanec"}, "author": "Martin Urbanec", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1007/s10714-011-1229-z", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1108.5767v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1108.5767v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "gr-qc", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "gr-qc", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "astro-ph.SR", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1108.5767v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1108.5767v1", "arxiv_comment": null, "journal_reference": null, "doi": "10.1007/s10714-011-1229-z", "fulltext": "General Relativity and Gravitation manuscript No.\n(will be inserted by the editor)\n\nNeutrino trapping in braneworld extremely compact stars\nZdeněk Stuchlı́k * Jan Hladı́k *\nMartin Urbanec\n\narXiv:1108.5767v1 [gr-qc] 29 Aug 2011\n\nReceived: date / Accepted: date\n\nAbstract Extremely Compact Stars (ECS) contain trapped null geodesics. When\nsuch objects enter the evolution period admitting geodetical motion of neutrinos, certain part of neutrinos produced in their interior will be trapped influencing their neutrino luminosity and thermal evolution. We study neutrino trapping in the braneworld\nECS, assuming uniform distribution of neutrino emissivity and massless neutrinos.\nWe give the efficiency of the neutrino trapping effects in the framework of the simple\nmodel of the internal spacetime with uniform distribution of energy density, and external spacetime described by the Reissner-Nordström geometry characterized by the\nbraneworld \"tidal\" parameter b. For b < 0 the external spacetime is of the black-hole\ntype, while for b > 0 the external spacetime can be of both black-hole and nakedsingularity type. Then the ECS surface radius R can be located also above the unstable (outer) photon circular orbit. Such basically new types of the spacetimes strongly\nalter the trapping phenomena as compared to the standard case of b = 0. It is shown\nthat the neutrino trapping effects are slightly lowered by the presence of physically\nmore plausible case of b < 0, as compared to the standard internal Schwarzschild\nspacetime, while they can be magnified by positive tidal charges if b < 1 and lowered\nfor b > 1. However, potential astrophysical relevance of the trapping phenomena is\nstrongly enhanced for negative tidal charges enabling a significant enlargement of the\nECS surface radius to values coherent with recent observations.\nKeywords Neutrino trapping * Braneworlds * Extremely compact stars\nPACS 95.30.Sf * 04.50.Kd\n1 Introduction\nOne of the promising approaches to the higher-dimensional gravity theories is represented by the braneworld models, where the observable universe is a 3-brane (domain\nInstitute of Physics, Faculty of Philosophy and Science, Silesian University in Opava, Bezručovo nám. 13,\nCZ-746 01 Opava, Czech Republic\nE-mail: zdenek.stuchlik@fpf.slu.cz * jan.hladik@fpf.slu.cz * martin.urbanec@fpf.slu.cz\n\n\f2\n\nwall) to which the matter fields are confined, while the gravity field enters the extra\nspatial dimensions of size that could strongly exceed the Planck length scale [7].\nSuch models provide an elegant solution to the hierarchy problem of electroweak and\nquantum gravity scales, as these become of the same order (∼ TeV) due to large extra\ndimensions and could be well tested on the planned supercollider experiments [15].\nGravity can be localized near the brane at low energies even with an infinite size\nextra dimension with warped spacetime satisfying the 5D Einstein equations containing negative cosmological constant [32] and an arbitrary energy-momentum tensor\nallowed on the brane [37]. The Randall-Sundrum model gives 4D Einstein gravity in\nlow energies and the Newtonian limit appears on the 3-brane with high accuracy. Significant deviations from the Einstein gravity occur at very high energies, in the early\nuniverse and in vicinity of compact objects as black holes and neutron stars [24].\nRecently, no exact solution of the full 5D Einstein equations is know, but there\nis a variety of astrophysically plausible special solutions of the 4D effective Einstein\nequations constrained to the brane. Such solutions describe black holes with spherical\nsymmetry [14] or with axial symmetry [5] and compact objects that could represent\nneutron (quark) stars [16]. The black hole spacetimes are determined by geometry of\nthe spherical Reissner-Nordström (R-N) and axial Kerr-Newman (K-N) type where\nthe electric charge squared is substituted by the braneworld \"tidal charge\" parameter representing the tidal (Weyl tensor) effects of the bulk space onto the 4D black\nhole structure. Astrophysically relevant properties of the braneworld black holes were\nstudied in a series of papers devoted to both motion of matter in their vicinity [42, 6,\n1, 26, 29] and optical phenomena [34, 33, 12, 11].\nIn the simple model of spherically symmetric stars with uniform energy density\nprofile a variety of special solutions having asymptotically Schwarzschildian character and satisfying the braneworld boundary conditions were found [16]. The most\npopular is the one with external spacetime described by the Reissner-Nordström geometry with the braneworld tidal charge parameter reflecting the tidal effects of the\nbulk and related to the energy density and brane tension. Its properties were extensively studied both in the weak field limit [10, 9] and strong field limit when some\nrestrictions on the brane tension were implied from the data of kHz QPOs observed\nin low mass binary systems with a neutron star [21]. Here we focus our attention to\nthe interior of the compact objects, namely to the phenomena related to trapping of\nneutrinos in the so called Extremely Compact Stars (ECS) admitting (by definition)\nexistence of trapped null geodesics [44]. Usually, the braneworld tension is assumed\npositive while the related tidal charge has to be negative [16], but the negative tension\nand related positive tidal charge are not excluded [14], so we consider here both positive and negative tidal charge of the compact object. Note that exterior of neutron stars\nwith positive tidal charges can be described by both black-hole and naked-singularity\ntypes of the external R-N spacetime (for details see [21]).\nIn the standard (b = 0) internal Schwarzschild spacetimes of uniform energy density [35, 39] with radius R < 3GM/c2 , bound null geodesics exist being concentrated\naround the stable circular null geodesic [3, 41]. From the behaviour of the effective\npotential of null geodesics in the exterior, vacuum Schwarzschild spacetimes, determining the unstable null circular geodesics at the radius rph = 3GM/c2 (see, e.g.,\n[28]), we can conclude that any spherically symmetric, static non-singular interior\n\n\f3\n\nspacetime with radius R < rph admits existence of bound null geodesics. The trapped\nnull geodesics are then governed by both internal and external barriers of the null\ngeodesics effective potential. 1 The realistic equations of state admitting the existence\nof the extremely compact objects were found and investigated for neutron stars, quark\nstars and Q-stars [8, 27, 30, 44, 20, 31]. For spacetimes with a non-zero tidal charge,\nthe situation is more complex as we shall demonstrate in the following.\nThe existence of bound null geodesics in ECS has interesting astrophysical consequences. For example, using the notion of the optical reference geometry [4, 40,\n38] it was shown that trapped modes of gravitational waves could influence some\ninstabilities in these objects [2]. Trapping of neutrinos can be of high importance in\nthe interior of the ECS: first, it will suppress the neutrino flow as measured by distant observers and, second, it can influence cooling of the ECS in a layer extending\nfrom some radius depending on details of their structure up to the surface radius.\nThe cooling process could even be realized in a \"two-temperature\" regime, when the\ntemperature profile in the interior of the star with no trapped neutrinos differs from\nthe profile established in the external layer with trapped neutrinos [44] modifying\nsubstantially the standard picture of the neutron star structure as given in [17, 18, 19,\n46, 45]. In a different context, trapping of neutrinos inside rotating neutron stars has\nbeen discussed in [25].\nThe approximation of free, geodetical motion of neutrinos in the internal spacetime could be used when the mean free path of neutrinos λ > R. Neutrinos have inelastic scatter on electrons (muons) and elastic scatter on neutrons. The scatter cross\nsection on electrons (neutrons) σe (σn ) determines the mean free path by formula\nλ = (σi ni )−1 where ni (i = e, n) denotes the number density of electrons (neutrons).\nIt was shown [36] that\nλe ∼ 9 × 10\n\n7\n\n\u0012\n\nρnucl\nρ\n\n\u00134/3 \u0012\n\n100 keV\nEν\n\n\u00133\nkm,\n\n(1)\n\nwhile\nρnucl\nλn ∼ 300\nρ\n\n\u0012\n\n100keV\nEν\n\n\u00132\nkm.\n\n(2)\n\nThere is λe & 10 km for Eν . 20 MeV and λn & 10 km for Eν . 500 keV. Therefore, in a few hours old neutron star, see [23, 36], at temperatures T . 109 K (Eν ∼\n100 keV), the neutrino motion could be considered geodetical through whole the internal spacetime.\nBound neutrinos with mean free path \u001d R will slow down the cooling. Of course,\nthey will be re-scattered due to finiteness of the mean free path. An eventual scattering\nof trapped neutrinos will cause change of their impact parameter, therefore, some of\nthem will escape the ECS, suppressing thus the slow down of the cooling process in\nthe region of neutrino trapping. Clearly, the scattering effect of the trapped neutrinos\nis a complex process deserving sophisticated numerical code based on the Monte\nCarlo method (we expect modelling of this effect in future).\n1 In principle, the bound null geodesics could exist also in objects having R > 3GM/c2 , e.g., in some\ncomposite polytropic spheres [30].\n\n\f4\n\nThe cooling process deserves sophisticated analytical estimates and detailed numerical simulations. As a first step in considering the role of trapped neutrinos in\nECS, efficiency of the neutrino trapping effect was studied in the simple case of the\ninternal Schwarzschild spacetime with uniform distribution of energy density (but a\nnontrivial pressure profile) and isotropic and uniform distribution of local neutrino\nluminosity, when all the calculations can be realized in terms of elementary functions\nonly (see [44]). 2 The influence on the neutrino luminosity of the star is given by a\nluminosity trapping coefficient relating the total number of trapped neutrinos and the\ntotal number of radiated neutrinos (per unit time of distant observers). The influence\non the cooling process is given by two \"cooling\" trapping coefficients: a \"local\" one\ngiven by ratio of trapped and radiated neutrinos at any radius where the trapping occurs, and the \"global\" one giving ratio of trapped and radiated neutrinos (per unit time\nof distant observers) integrated over whole the region where the trapping occurs.\nIn the present paper we study the role of the braneworld \"tidal charge\" parameter\non the existence of ECS and estimate its role in the efficiency of the neutrino trapping\nprocess using the same trapping coefficients as those introduced in [44]. We consider\nthe trapping effect in the simple case of objects with uniform distribution of energy\ndensity. The external field is given by the Reissner-Nordström geometry [16]. This\nspecial solution is most extensively studied in the literature, since its external field is\nidentical to those of the black hole solution with spherical symmetry [14] - therefore, the results of our study could be efficiently compared to the results obtained in\nstudies of other phenomena [10, 21]. We consider both positive and negative values\nof the braneworld tidal parameter - usually, only the negatively valued tidal charges\n(corresponding to positive tension of the brane) are discussed [16], but the inverse\nsituation with positive tidal charge is not excluded and will be treated here, since it\ncould demonstrate some new interesting effects.\nOur paper is organized as follows. In Section 2, we summarize properties and\nmatching conditions of the internal uniform energy density spacetime and the Reissner-Nordström external spacetime. In Section 3, null geodesics of both the internal\nand external spacetime are described in terms of properly given effective potential\nand the ECS are classified according to the properties of the trapping region of the\nnull geodesic motion. In Section 4, the trapping of neutrinos is discused. In Section 5,\nthe trapping efficiency coefficients are defined for both the total neutrino luminosity\nand neutrino cooling process, and determined for all kinds of the braneworld ECS.\nIn Section 6, concluding remarks are presented. Throughout the paper, we shall use\nthe high-energy units with h̄ = c = kB = 1, if not stated otherwise. For simplicity, we\nassume zero rest energy of neutrinos, isotropic emission at each radius, and the period\nof evolution of the compact stars, when the temperature is low enough to describe the\nmotion of neutrinos by the null geodesics of the spacetime.\n\n2 The internal Schwarzschild spacetime can well represent the spacetime properties of realistic ECS [17,\n18, 19] which are crucial in estimating the role of neutrino trapping. Such a simple spacetime could serve\nquite well as a test bed for realistic models of ECS.\n\n\f5\n\n2 Braneworld neutron stars\nWe describe the braneworld neutron stars by the simple model of uniform energy\ndensity interior and the \"tidally\" charged exterior. We give the internal and external\ngeometry and the matching conditions. Accordingly, we determine conditions on the\nexistence of ECS depending on the tidal parameter characterizing the external spacetime.\n2.1 Matching conditions of internal and external spacetimes\nIn the standard Schwarzschild coordinates and the high-energy units, the line element\nof the spherically symmetric spacetimes reads\nds2 = −A2 (r)dt 2 + B2 (r)dr2 + r2 dΩ .\n\n(3)\n\nThe internal solution is characterized by the uniform energy density distribution\n- ρ = const, and by the tension of the brane - λ . We assume ρ > 0, but we allow\nboth possibilities λ > 0, λ < 0 for completeness. The internal geometry is matched to\nthe external geometry at the surface of the star r = R. The line element of the internal\nsolution is given by the metric coefficients A− (r), B− (r) that are determined by [16]\nA− (r) =\nand\n\u00012\nB− (r) =\n\n∆ (R)\n(1 + p(r)/ρ)\n\n\u0014\n\u0015\n1\n2GM \u0010 r \u00113 \u0010\nρ \u0011 −1\n=\n1\n−\n1\n+\n,\n∆ 2 (r)\nr\nR\n2λ\n\n(4)\n\n(5)\n\nwhere M = 34 πρR3 .\nThe pressure radial profile is given by\np(r)\n[∆ (r) − ∆ (R)] (1 + ρ/λ )\n=\n.\nρ\n3∆ (R) − ∆ (r) + [3∆ (R) − 2∆ (r)] (ρ/λ )\n\n(6)\n\nFor r = R, there is p(r)/ρ = 0. The maximum of the pressure profile is at r = 0.\nThe reality condition on the metric coefficient B− (r) (taken at r = R) implies a\nrelation between λ , ρ and R that can be expressed in the form\nGM\nρ\n≥ .\nR − 2GM\nλ\n\n(7)\n\nConsidering the restriction R > 2GM (R < 2GM), we can see that the reality\ncondition (7) is satisfied for all λ < 0 (forbidden for all λ > 0), while for positive\ntension λ > 0 (negative tension λ < 0), we obtain a limit on the positive (negative)\ntension given by [16]\n\u0012\n\u0013\nR − 2GM\nλ≥\nρ.\n(8)\nGM\n(Notice that considering possibility of R < 2GM, we obtain a limit on the negative\ntension.)\n\n\f6\n\nThe line element of the external geometry is given by the metric coefficients\nA+ (r), B+ (r) that are determined by\n\u0001−2\n\u00012\n2GM\nq\n= 1−\n+ 2,\nA+ (r) = B+ (r)\nr\nr\n\n(9)\n\nwhere, due to the matching conditions on the neutron star surface, i.e., A− (R) =\nA+ (R), B− (R) = B+ (R), the external mass parameter M and external tidal charge\nparameter q are related to the internal geometry parameters ρ, λ (and M) by the\nrelations\nρ\nλ\n\u0010\nρ\u0011\nM = M 1−\n.\nλ\nq = −3GMR\n\n(10)\n(11)\n\nFor λ > 0, the tidal charge q < 0 and M < M, while for λ < 0, there is q > 0\nand M > M. Notice that for λ > 0, the condition ρ < λ has to be satisfied in order\nto have M > 0.\nFor our purposes, it is convenient to express the internal spacetime coefficients using the parameters of the external spacetime that can be directly determined from observations of accretion and optical phenomena in vicinity of the neutron stars. Since\nthe matching conditions imply the relations\n3GM R\n3GMRρ\n=\n,\nλ\n(1 − λ /ρ)\n\n(12)\n\n3GM R\nλ\n= 1−\n,\nρ\nq\n\n(13)\n\nq=−\n\nthe internal metric can be expressed in terms of the external parameters M , R, q and\na new parameter\nq\nX≡\n(14)\n3GM R\nin the form\n\u0014\n\u0012\n\u0013\u0015−1\n\u00012\n2GM r2\n3\nB− (r) = ∆ −2 (r) = 1 −\n1\n−\nX\n(15)\nR3\n2\nA− (r) =\n\n∆ (R) [3∆ (R) (2X − 1) + ∆ (r) (1 − 3X)]\n.\n2∆ (R) (2X − 1) − ∆ (r)X\n\n(16)\n\nThe pressure profile can be expressed in the form\n[∆ (r) − ∆ (R)] (2X − 1)\np(r)\n=\n.\nρ\n[3∆ (R) − ∆ (r)] (X − 1) + [3∆ (R) − 2∆ (r)] X\n\n(17)\n\nThe observational restrictions obtained from the measurements outside the neutron\nstar then can be applied to the internal parameters using the relations (12)–(14).\n\n\f7\n\n2.2 Limit on existence of uniform density stars\nThe limit on the existence of the uniform density spherical configuration is related\nto their compactness and is determined by the condition of pressure finiteness in\ntheir center. We then find the limit on compactness of the star given in terms of the\ngravitational mass related to the internal geometry [16]:\n\"\n#\nρ\n4 1 + 54 λ\nGM\n≤\n(18)\n\u0001 .\nR\n9 1+ ρ 2\nλ\n\nThe lowest order correction is given by\n\u0014\n\u0015\n4\n3ρ\nGM\n≤\n1−\n.\nR\n9\n4λ\n\n(19)\n\nUsing the external gravitational mass parameter M , the compactness limit (18) is\ntransformed to the form\n\"\n#\nρ\u0001\nρ\u0001\nGM\n4 1 + 45 λ 1 − λ\n≤\n.\n(20)\n\u00012\nR\n9\n1 + λρ\nIntroducing the gravitational radius\nrg ≡ GM\n\n(21)\n\nand dimensionless braneworld tidal charge\nq\n,\nrg2\n\n(22)\n\nq\n1 rg\n= b\n3GM R 3 R\n\n(23)\n\nb≡\nwe can put\nX=\nand we arrive to the relations\n\n\u0010 r \u00112\nrg\ng\n+b\nR\nR\nrg \u0011\nrg \u0010 r \u00113 \u0010\n∆ 2 (r) = 1 −\n2−b\nr R\nR\nIn terms of dimensionless units (rg = 1), the pressure function reads\n∆ 2 (R) = 1 − 2\n\np\n(∆ (r) − ∆ (R)) (2b − 3R)\n(r, R, b) =\n.\nρ\n3∆ (R) (2b − 3R) − 3∆ (r) (b − R)\n\n(24)\n(25)\n\n(26)\n\nThe pressure increases monotonously with radius decreasing. The central pressure is\ngiven by\np\n3R − 2b\n\u0010p\n\u0011\n(r = 0, R, b) =\n.\n(27)\nρ\n3R\nb + (R − 2)R + R − 3 + 6b\n\n\f8\n\nThe reality condition of the central pressure reads b + (R − 2)R ≥ 0 and is equivalent to the condition ∆ (R) ∈ R. The pressure in the center of the star must be finite\nand positive. These conditions imply the limits Rmin (b) on the existence of uniform\ndensity stars. The central pressure p(r = 0, R, b) diverges when the surface radius R\nsatisfies the condition\n\u0011\n\u0010p\nb + (R − 2)R + R − 3 + 6b = 0.\n(28)\n3R\nThis leads to a cubic equation relative to R which gives one solution that is relevant\nfor b ≤ 1 and reads\n\n(b − 9)(b − 1)\n1\nq p\n+\nR=\n4\n3\n8 (b − 1)2 b3 + b [b(b + 17) − 45] + 27\n!\nr q\n+\n\n3\n\n8\n\n(b − 1)2 b3 + b [b(b + 17) − 45] + 27 + b + 3 .\n\n(29)\n\nThe solution is depicted on Figure 1 as the part of Rmin (b) denoted by p → ∞. For\nb = 0, we arrive at the standard condition R > 49 (see [44]). For b > 1 the relevant\nlimit is given by the condition of positiveness of the central pressure. It reads\n2\nRmin (b|b > 1) = b\n3\n\n(30)\n\nand is denoted by p → 0. For smaller R the central pressure is not positive.\nNote that for √\n3/4 < b < 1 there is a region of surface radii given by the condition\n2b/3 < R < 1 − 1 − b where p(r = 0) is positive. However, the star surface is located under the inner horizon of the external spacetime that belongs to the black hole\ntype R-N spacetime. Such a configuration has to be hidden under the inner horizon\nof the external spacetime and is irrelevant for our considerations.\n\n2.3 Extremely compact neutron stars\nThe ECS (neutron, quark, or hybrid) are defined by the existence of trapped null\ngeodesics in the interior of the compact star. In the case of internal uniform density\nSchwarzschild spacetimes (b = 0), such objects appear just when the surface of the\ncompact star is located under the photon circular geodesic of the external vacuum\nSchwarzschild spacetime located at rph = 3rg [44]. In the braneworld uniform density\ncompact stars this simple rule does not hold and the situation is more complex due to\ndifferent character of the external spacetime and its relation to the internal spacetime.\nAssuming the external spacetime to be of the Reissner-Nordström (R-N) type\nwith the tidal charge substituting the electric charge squared appearing in the standard\nR-N spacetimes, the photon circular geodesics are given by the condition\nr2 − 3rg r + 2q = 0.\n\n(31)\n\n\f9\n\n3.5\n\nII\n\nrph+\nR I+\n\nNONE\n\nECS\n\n3.0\nI\n\nRmin\n\n2.5\n\nRECS\nmax\n\nr\n\nrph+\npc ® ¥\n\n2.0\n1.5\n\nrphFORBIDDEN AREA\n\nIV\na b\n\n1.0\n\nIII\nR Ipc ® 0\n\n0.5\n-1.0\n\n-0.5\n\n0.0\n\n0.5\n\n1.0\n\n1.5\n\nb\n\nFig. 1 Classification of the extremely compact stars (ECS). The parameter space (b − R) is separated into\nfive Zones I–IVa,b ; their properties are given in Section 3.1.\n\nHowever, it is convenient to use dimensionless tidal charge b and dimensionless\nradial coordinate defined by\nr/rg → r.\n(32)\nFor negative tidal charges (b < 0) external spacetimes of the black-hole type are\nallowed only [21]. The radii of the photon circular orbits are given by\n!\nr\n3\n8\nrph± =\n1± 1− b .\n(33)\n2\n9\nHowever, only the outer photon circular geodesic at rph+ is physically relevant and\nwe see immediately that (b < 0) there is rph > 3.\nFor braneworld neutron stars with a positive tidal charge (b > 0) both black-hole\nand naked singularity R-N spacetimes are relevant [21]. In the black-hole type spacetimes (b ≤ 1), the photon circular orbits are given by the relation (33), but only the\nouter solution corresponding to an unstable orbit can be astrophysically relevant since\nthe surface of the compact star has to be located above radius of the outer horizon.\nIn the naked singularity spacetimes (b > 1) two photon circular orbits are can be\nastrophysically relevant when b < 9/8, the inner one being stable, the outer one -\nunstable. In the spacetimes with b > 9/8, no photon circular orbits can exist. Therefore, in the braneworld spacetimes, the existence of ECS is governed by the interplay\nof the behaviour of the internal and external effective potential of the motion and will\nbe determined and classified in the following section.\n3 Null geodesics of internal and external spacetimes\nIn terms of the tetrad formalism the metric (3) reads\nds2 = −[ω (t) ]2 + [ω (r) ]2 + [ω (θ ) ]2 + [ω (φ ) ]2 ,\n\n(34)\n\n\f10\n\nwhere\nω (t) = A(r) dt,\n\nω (r) = B(r) dr,\n\nω (θ ) = r dθ ,\n\nω (φ ) = r sin θ dφ .\n\n(35)\n\nh\ni\n(α) −1\nμ\n, the tetrad of 4-vectors is given by\nSince there is e(α) = ωμ\ne(t) =\n\n1 ∂\n,\nA(r) ∂t\n\ne(r) =\n\n1 ∂\n,\nB(r) ∂ r\n\ne(θ ) =\n\n1 ∂\n,\nr ∂θ\n\ne(φ ) =\n\n1\n∂\n.\nr sin θ ∂ φ\n\n(36)\n\nTetrad components of 4-momentum of a test particle or a photon are determined by\n(α)\nμ\nthe projections p(α) = pμ e(α) , p(α) = pμ ωμ which give quantities measured by the\nlocal observers.\n\n3.1 Null geodesics and effective potential\nWe consider the period of evolution and cooling of ECS when their temperature falls\ndown enough that the motion of neutrinos can be considered free, i.e., geodetical.\nWe can assume this period starts at the moment when mean free path of neutrinos\nbecomes to be comparable to the radius R, i.e., in hours after the gravitational collapse\ncreating the compact object [17, 18, 19, 45, 36]. In fact, there are arguments that this\ncondition starts to be fulfilled about 50 s after collapse to a proto-neutron star [23, 22].\nWeak interaction of ultrarelativistic (massless) neutrinos implies their motion along\nnull geodesics obeying the equations (λ is an affine parameter)\nDpμ\n= 0,\ndλ\n\npμ pμ = 0.\n\n(37)\n\nDue to the existence of two Killing vector fields: the temporal ∂ /∂t one, and the\nazimuthal ∂ /∂ φ one, two conserved components of the 4-momentum must exist:\nE = −pt\n\n(energy),\n\nL = pφ\n\n(axial angular momentum).\n\n(38)\n\nMoreover, the motion plane is central. For a single-particle motion, one can set θ =\nπ/2 = const, choosing the equatorial plane.\nThe motion along null-geodesics is independent of energy (frequency) and can\nconveniently be described in terms of the impact parameter\n`=\n\nL\n.\nE\n\n(39)\n\nThen (37) yields the relevant equation governing the radial motion in the form\n\u0012\n\u0013\n`2\n(pr )2 = A−2 (r)B−2 (r)E 2 1 − A2 (r) 2 .\nr\n\n(40)\n\n\f11\n\nClearly, the energy E is irrelevant and can be used for rescalling of the affine parameter λ . The radial motion is restricted by an effective potential related to the impact\nparameter `, and defined by the relations\n\nr2\n\n\nfor r ≤ R\n V int\neff =\n(A− (r))2\n(41)\n`2 ≤ V eff =\n2\nr\n\next\n\n V eff = +\nfor r > R.\n(A (r))2\nV int\neff is the effective potential of the null-geodetical motion in the internal braneworld\nspacetime and V ext\neff is the effective potential of the null-geodetical motion in the external, vacuum R-N spacetime. We shall see in the following that due to the bulk\nspace tidal effects on the matching of the internal and external spacetimes (see [16]\nfor details) we obtain a non-standard variety of relations of the effective potentials in\nthe ECS interior and exterior.\nUsing the dimensionless radial coordinate expressed in terms of the gravitational\nradius (r/GM → r), and dimensionless tidal charge b, we obtain the relations\nV int\neff =\n\nr2 R2 [bY − 2R(2b − 3R)Z]2\n9 [b + (R − 2)R] [(R − b) + R(2b − 3R)Z]2\nV ext\neff =\n\nr4\n,\nb + (r − 2)r\n\n,\n\n(42)\n\n(43)\n\nwhere\nq\nr2 (b − 2R) + R4 ,\np\nZ ≡ R∆ (R) = b + (R − 2)R.\n\nY ≡ R2 ∆ (r) =\n\n(44)\n(45)\n\nCircular null geodesics, located at rc(i) and rc(e) , respectively, are given by the\nlocal extrema of the effective potential (∂Veff /∂ r = 0). In the internal spacetime we\nhave to solve a nontrivial equation r:\n\u0010\n\u0011\nd V int\neff (r, R, b) /dr ≡\n\u0002\n\u0001\b\n\u0001\n2rR2 b(Y − 4RZ) + 6R2 Z −b3 r2 (Y − 4RZ) + 8R2Y + b2 R×\n\u0001\u0001\n× r2 (3Y − 14RZ) + R2 6R2 Z − 9RY + 40Y + bR2 R2 (−13R2 Z+\n\u0001\n\u0001oi\n+25RY − 66Y ) − 2r2 (Y − 6RZ) + 6R5 R2 Z − 3RY + 6Y\n×\nh\ni−1\n× 9 (b + (R − 2)R)Y (R(Y − 3RZ) − b (Y − 2RZ))3\n= 0.\n(46)\nThis equation can be solved by using numerical methods and determines the loci\nrc(i) (R, b) of the internal circular null geodesics that are stable and correspond to a local maximum of the internal effective potential. From the radius rc(i) we easily obtain\n\n\f12\nb = -1.2\n\n50\n\n40\nVeff\n\nVeff\n\n45\n40\n35\n30\n2.0\n\nb = 0.8\n\n50\n\n30\n20\n\n2.5\n\n3.0\n\n3.5\n\n10\n1.0\n\n4.0\n\n1.5\n\nr\n\n2.0\n\n2.5\n\nr\nb = 1.08\n\nb = 1.2\n\n25\n\n14\n12\n\nVeff\n\n10\n\nVeff\n\n20\n\n8\n6\n\n15\n\n4\n2\n\n10\n0.5\n\n1.0\n\n1.5\n\n0\n0.5\n\n2.0\n\n1.0\n\nr\n\n1.5\n\n2.0\n\nr\nb = 1.4\n20\n\nVeff\n\n15\n10\n5\n0\n0.5\n\n1.0\n\n1.5\n\n2.0\n\n2.5\n\n3.0\n\nr\n\nFig. 2 The effective potential Veff of both internal (dashed lines) and external spacetimes (full lines) given\nfor the black-hole type (b < 1) and naked-singularity (b > 1) type of the external spacetime. All characteristic cases of its behaviour are presented for both ECS and non-extreme compact stars.\n\nthe impact parameter `2c(i) (R, b) using equation (42). The existence of the internal stable circular null geodesics is allowed only for the surface radius R limited by values\nexplicitly given by\nr\n3\n9 5\nRI± = ±\n− b\n(47)\n2\n4 3\nthat has to satisfy naturally also the condition R > Rmin (b).\nIn the external spacetime, the photon circular geodesics and the related local extrema of the effective potential are given by equation (33) and their properties were\ndiscussed in the previous section.\nWhen we take into account the (non-)existence of the local extrema of the internal/external part of the effective potential Veff , we obtain the whole region of existence\n\n\f13\n\nof ECS. The function RECS\nmax (b) is determined by the relation\n(\nRECS\nmax\n\n=\n\n1\n2\nRI+ ≡ 32\n\nrph ≡\n\n\u0001\n√\n3+\nq 9 − 8b\n\n+\n\n9\n4\n\n−\n\n5\n3b\n\nfor b ≤ 0\n\n,\n\nfor 0 < b < 27/20\n\n(48)\n\nwhile for RECS\nmin (b) we have\n(\nRECS\nmin\n\n=\n\nfor b ≤ 1\n\nRmin\n3\n2\n\nRI− ≡ −\n\nq\n\n9\n4\n\n−\n\n5\n3b\n\nfor 1 < b < 27/20\n\n.\n\n(49)\n\nThe region of ECS in the parameter space is represented in Figure 1.\nTypical behaviour of the effective potential of the null-geodetical motion V eff is\ndemonstrated in Figure 2 for appropriatelly chosen values of the tidal charge b. Here,\nand henceforth, we express the radii in units of the gravitational radius rg = GM .\nThe selection of the tidal charge values used in Figure 2 demonstrates the full classification of the behavior of the effective potential in both internal and external spacetimes. When the effective potential in the internal or external spacetime (or in both\nof them) has a local extreme corresponding to a photon circular geodesic, trapped\nnull geodesics can appear if the surface radius R is properly chosen giving an ECS.\nOn the other hand, we find an ordinary compact star if the surface is chosen in such\na way that no local extrema of the effective potentials exist (see Figure 2e). Separation of the zones of compact stars of different character, both extremely compact\nand ordinary compact, in the parameter space (b − R), is determined by the functions\nRmin (b), Rmax (b) and rph (b) where the last function governs radius of the photon\ncircular geodesics in the external spacetime (both of them for 1 < b < 9/8). The\nsubdivision of the Zone IV in the tidal charge range 1 < b < 9/8 is given by the relation of the magnitude of the effective potential at the surface of the ECS and the\nmagnitude of the external effective potential at its local minimum, and is determined\nnumerically (see Figure 1).\nWe divided the region of the parameter space R − b corresponding to the existence of ECS into five zones. The classification is based on the existence of local\nint/ext\nmaxima/minima of V eff\nin the following way (see Figures 1 and 3)\next\n• Zone I there exist maximum of V int\neff and minimum of V eff , both located at r 6= R,\next\next\nminV eff < V eff (r = R), and there is no local maximum of V ext\neff at r > R;\next\n• Zone II there exist maximum of V int\neff at r = R and minimum of V eff at r 6= R,\next\nint\next\nminV eff < maxV eff , and there is no local maximum of V eff at r > R;\next\n• Zone III there exist maximum of V int\neff at r < R and minimum of V eff at r = R;\next\nthere is no local maximum of V eff at r > R;\n• Zone IV there exist both the local maximum and local minimum of V ext\neff at r > R,\nthis zone can be divided into two parts\nint\na) minimum of V ext\neff < V eff (r = R);\next\nb) minimum of V eff > V int\neff (r = R).\n\n\f14\n\n4 Trapping of neutrinos\nIn ECS, some part of produced neutrinos is prevented from escaping these static\nobjects because of stable circular null geodesics existing in the internal spacetime,\nand/or because of unstable circular null geodesics existing in the external spacetime\n(Figure 3). For external braneworld naked-singularity spacetimes with tidal charge in\nthe interval 1 < b < 9/8, an additional stable circular null geodesic exists that can be\nimportant for appearance and structure of accretion discs ([43]), but it is irrelevant\nfor trapping of neutrinos radiated by ECS.\nThe relation ∂V int\neff /∂ r = 0 determines location of the stable circular null geodesics of the internal spacetime and implies the impact parameter which corresponds to\n2\nthe local maximum of the effective potential V int\neff at rc(i) to be given by `c(i) .\nFor b ≤ 9/8, the local minimum of V ext\neff is located at\nrc(e) =\n\n\u0011\n√\n1\u0010\n3 + 9 − 8b\n2\n\n(50)\n\nand corresponds to the unstable circular null geodesics of the Reissner-Nordström\nexternal spacetime, with the impact parameter determined by\n`2c(e)\n\n\u00014\n√\n3 + 9 − 8b\n\u0001.\n√\n=\n8 3 − 2b + 9 − 8b\n\n(51)\n\nFor the ECS spacetimes corresponding to all of the Zones I–IVa,b of the parameter\next\nspace (b−R), typical behaviour of the effective potentials V int\neff and V eff is represented\nin Figure 3 where the regions of trapped neutrinos are shown explicitly.\n\n4.1 Regions of trapping\nBound neutrinos (depicted by the gray filled areas in Figure 3) may be fully trapped\ninside the internal spacetime, or may, in some spacetimes, appear outside the interior\nof the ECS being trapped by its strong gravitational field, and entering the interior\nagain; note that the trapped neutrinos moving outside the compact star occur in the\nspacetimes of the Zones I, II and IVa . Therefore, we divide the trapped neutrinos into\ntwo families:\n• \"Internal\" bound neutrinos (depicted using light gray filled area) with impact parameter between `2int (R) and `2c(i) ; motion of these neutrinos is restricted to the interior of the ECS. The internal bound neutrinos appear exclusively in spacetimes\nof the Zones III and IVb , but they occur also in the spacetimes of the Zones I and\nIVa .\n• \"External\" bound neutrinos (depicted by the dark gray filling) with impact parameter between `2c(e) and `2int (R); such bound neutrinos may leave the ECS interior, but they re-enter it. In spacetimes of the Zone II all bound neutrinos are of\nthis type.\n\n\f15\nr\n\nr\nZone I\n\nlc2 HeL\n\nVeff\n\n2\nHRL\nlint\n\nlc2 HeL\nINTERIOR EXTERIOR\n\nrb HeL rb HiL\n\nrc HiL\n\nR\n\nZone II\n\n2\nHRL\nlint\n\nVeff\n\nlc2 HiL\n\nINTERIOR EXTERIOR\n\nrc HeL\n\nrb HeL\n\nR\n\nrc HeL\n\nr\n\nr\nZone III\n\nZone IVa\n\n2\nHRL\nlint\n\nVeff\n\nVeff\n\nlc2 HiL\n\nlc2 HiL\n\n2\nHRL\nlint\nlc2 HeL\n\nINTERIOR EXTERIOR\n\nINTERIOR EXTERIOR\n\nrb HiL\n\nrc HiL\n\nR\n\nrb HeL rb HiL rc HiL\n\nR\n\nrc HeL\n\nr\nZone IVb\n\nVeff\n\nlc2 HiL\n2\nHRL\nlint\nINTERIOR EXTERIOR\n\nrb HiL rc HiL R\n\nFig. 3 Schematic classification of the effective potential V eff of the ECS for all the Zones I–IVa,b of the\nparameter space (b − R) as depicted on Figure 1.\n\nThe pericentre and the impact parameter of the \"external\" marginally bound neutrinos (rb(e) ; Zones I, II, IVa ) can be determined from the condition\nV int\neff (r = rb(e) , R, b) =\n\n\u00014\n√\n3 + 9 − 8b\n\u0001\n√\n8 3 − 2b + 9 − 8b\n\n(52)\n\nwhile the pericentre and the impact parameter of the \"internal\" marginally bound\nneutrinos (rb(i) ; Zones I, III, IVa , IVb ) are given by the condition\nV int\neff (r = rb(i) , R, b) =\n\nR4\n,\nb + (R − 2)R\n\n(53)\n\nsee Figures 3, 4 for the graphical representation. For completeness, we show in Fig. 4\nalso loci rc(i) of the stable circular null geodesic and the surface radius R of the ECS.\n\n\f16\n\n4.0\n3.5\n\nb = -1.2\nII\n\nI\nrc He\n\nrc HeL\n\nR\n\n3.0\n\n2.0\nR\n1.5\n\n2.0\n\nrc HiL\n\nr\n\nr\n\n2.5\n1.5\n\nrc HiL\n\nrb HiL\n\nrb HeL\n\n1.0\n\n1.0\n0.0\n2.8\n\n3.0\n\n3.2\n\n3.4\n\n0.0\n\n3.6\n\nrb HeL\n\nrb HiL\n\n0.5\n\n0.5\n\n1.6\n\n1.8\n\n2.0\n\nR\nIVb\n\nIVa\n\n2.2\n\n2.4\n\nR\nb = 1.08\n\n2.0\n\nb = 0.8\nIII\n\nI\n\n2.5\n\nI\n\nb = 1.2\n\n2.0\n\nIII\n\nrc HeL\n\nIII\n\n1.8\n1.6\n\nr\n\nR\n\nrc HiL\n\n1.4\n\n1.0\nrb HiL\n\nrb HiL\n\nR\n\nr\n\n1.5\n\nrc HiL\n\n1.2\nrb HeL\n1.0\n\n1.0\n\n1.2\n\n1.4\n\n1.6\n\n1.8\n\n2.0\n\n2.2\n\n1.0\n\n1.2\n\n1.4\n\nR\n\n1.6\n\n1.8\n\n2.0\n\nR\n\nFig. 4 Location of the radii relevant for the trapping of neutrinos rb(i) , rb(e) and rc(e) given as functions of\nthe surface radius R for characteristic values of the tidal charge b. The range of the radius R corresponding\nto the Zones I–IV of the parameter space (b − R) is depicted in all presented figures.\n\n4.2 Directional angles\nConsidering (without loss of generality, as stated above equation (39)) an equatorial\nmotion, we can define the directional angle relative to the outward pointed radial\ndirection measured in the emitter system (i.e., the local system of static observers in\nthe internal spacetime) by the standard relations\nsin ψ =\nwhere\n\np(φ )\n,\np(t)\n(α)\n\np(α) = pμ ωμ ,\n\ncos ψ =\n\np(r)\n,\np(t)\n\n(54)\n\nμ\n\np(α) = pμ e(α)\n\n(55)\n\nare the neutrino momentum component as measured by the static observers. Besides\nconserving components (38), and pθ = 0, equation (40) implies\n\u0012\n\u00131/2\n`2\npr = ±EA−1 B 1 − A2 2\n.\nr\n\n(56)\n\nFor the directional angles we thus obtain relations\n`\nsin ψ = A ,\nr\nwhere A is given by equation (4).\n\ncos ψ = ± 1 − sin2 ψ\n\n\u00011/2\n\n,\n\n(57)\n\n\f17\n\nFig. 5 Schematic illustration of the bound-escape ratio at a radius r ∈ (rb(e) , R) of an internal spacetime.\nDirection of the neutrino motion with respect to the static observers is related to e(r) giving the outward\noriented radial direction. In the spacetimes of the Zones III and IVb only ψi cone is relevant, while for\nspacetime of the Zone II only angle ψe is relevant.\n\nThe directional angle limit for the bound neutrinos is determined for spacetimes\nin the Zones I, II and IVa by the impact parameter `2c(e) . We arrive to the relation\nv\nu\n\u00014\n√\n9 9 − 8b + 3 Z 2 [(R − b)Y + R(2b − 3R)Z]2\n1u\nt\n.\n4−\ncos ψe = ±\n\u0001\n√\n2\n2 −2b + 9 − 8b + 3 r2 R2 [bY + 2R(3R − 2b)Z]2\n\n(58)\n\nThe interval of relevant radii is given by r ∈ (rb(e) , R).\nThe directional angle limit for the \"internal\" bound neutrinos is determined by\nequation (57), where for ` we use ` = `int (R). In the Zone II spacetimes, there are\nnone neutrinos bound only in their interior. On the other hand, for spacetimes in the\nZones III and IVb , this limit represents the total limit on all bound neutrinos. For the\ninternal neutrinos we arrive to the relation\ns\n9R2 [(R − b)Y + R(2b − 3R)Z]2\ncos ψi = ± 1 −\n.\n(59)\nr2 [bY + 2R(3R − 2b)Z]2\nApparently, the condition ψi > ψe holds at any given radius r < R of the ECS spacetimes belonging to the Zones of the parameter space where both values have good\nmeaning.\n\n4.3 Local escaped to produced neutrinos ratio\nWe assume that neutrinos are locally produced by isotropically emitting sources.\nThen escaped-to-produced-neutrinos ratio depends on a geometrical argument only.\n\n\f18\n\nIt is determined by the solid angle 2Ω corresponding to escaping neutrinos (also inward emitted neutrinos must be involved because even these neutrinos can be radiated\naway), see Figure 5.\nLet Np , Ne and Nb denote, respectively, the number of produced, escaped and\ntrapped neutrinos per unit time of an external static observer at infinity. In order to\ndetermine the global correction factors\nE (R, b) ≡\n\nNe (R, b)\n,\nNp (R, b)\n\nB(R, b) ≡\n\nNb (R, b)\n= 1 − E (R, b),\nNp (R, b)\n\n(60)\n\nit is necessary to introduce the local correction factor for trapped neutrinos at a given\nradius r ∈ (rb(e) , R) (or r ∈ (rb(i) , R), if relevant).\nIn the general case of non-isotropic emission of neutrinos, the escaped-to-produced ratio is given by the expression\nZΨeZ2π\n\np(Ψ ) sinΨ dΨ dφ\n\nΩe (Ψe ) =\n\n(61)\n\n0 0\n\nwith p(Ψ ) being a directional function of the emission (scattering) process. Because of the assumption of isotropic emission of neutrinos in the frame of the static\nobservers, the escaping solid angle Ωe (Ψe ) determines fully the ratio of escapedproduced neutrinos and is given by\nZΨeZ2π\n\nΩe (Ψe ) =\n\nsinΨ dΨ dφ = 2π(1 − cosΨe ).\n\n(62)\n\n0 0\n\nThe escaping correction factor\nε(r, R, b) =\n\ndNe (r, R, b) 2Ω (ψe (r, R, b))\n=\n= 1 − cos ψe (r, R, b),\ndNp (r, R, b)\n4π\n\n(63)\n\nwhile the complementary factor for trapped neutrinos\nβ (r, R, b) = 1 − ε(r, R, b) =\n\ndNb (r, R, b)\n= cos ψe (r, R, B).\ndNp (r, R, b)\n\n(64)\n\nNotice that we consider production and escaping rates at a given radius r, but the\nradius R of the compact object enters the relation as it determines the escaping directional angle. The coefficient β (r, R, b) determines local efficiency of the neutrino\ntrapping, i.e., the ratio of the trapped and produced neutrinos at any given radius\nr ∈ (rb(e) , R) or r ∈ (rb(i) , R). Its profile is shown for several representative values\nof the tidal charge b and related sequences of the surface radius R in Figures 6, 7.\nThe local maxima of the function β (r, R, b) (with R and b being fixed) are given by\nthe condition ∂ β /∂ r = 0 which is satisfied at radius r = rc(i) implying coincidence\nwith the radius of the stable circular null geodesic, as anticipated intuitively. For the\nZone II the maxima are naturally located at the surface radius. In Figures 6, 7, the\nmaxima are depicted explicitly.\n\n\f19\n\nb = -1.2\n\n1.0\n\nZone I\nZone II\n0.8\n\nΒ\n\n0.6\n\n0.4\n\n0.2\n\n0.0\n0.0\n\n0.2\n\n0.4\n\n0.6\n\n0.8\n\n1.0\n\nr\u0090R\nb = 0.8\n\n1.0\nZone I\nZone III\n0.8\n\nΒ\n\n0.6\n\n0.4\n\n0.2\n\n0.0\n0.0\n\n0.2\n\n0.4\n\n0.6\n\n0.8\n\n1.0\n\nr\u0090R\nFig. 6 Profiles of the local trapping factor β (r/R, b) in the ECS with external spacetime of a black-hole\ntype. They are constructed for fixed characteristic values of the brane parameter b and sequences of the\nsurface radius R corresponding to the ECS. The upper figure represents the case of negative tidal charges\n(b = −1.2), while the lower figure represents the case of positive tidal charges (b = 0.8). The gray line\nconnects the local maxima of the β (r/R, b) profiles. The β (r/R, b) profiles constructed for parameters\nbelonging to different zones of the parameter space are separated by thick lines. In the regions of different\nzones the profiles are constructed for surface radii R spaced by equal distances in the interval of maximal\nand minimal values of R of ECS.\n\n\f20\n\nb = 1.08\n\n0.7\n0.6\n0.5\n\nZone I\nZone III\nZone IVa\nZone IVb\n\nΒ\n\n0.4\n0.3\n0.2\n0.1\n0.0\n0.4\n\n0.5\n\n0.6\n\n0.7\n\n0.8\n\n0.9\n\n1.0\n\nr\u0090R\nb = 1.2\n\n0.25\n\nZone III\n0.20\n\nΒ\n\n0.15\n\n0.10\n\n0.05\n\n0.00\n0.80\n\n0.85\n\n0.90\n\n0.95\n\n1.00\n\nr\u0090R\nFig. 7 Profiles of the local trapping factor β (r/R, b) in the ECS with external spacetime of a nakedsingularity type, constructed for fixed characteristic values of the brane parameter b and sequences of the\nsurface radius R corresponding to the ECS. The upper figure corresponds to the case when two circular\nnull geodesics of the external spacetime can exist (b = 1.08), while the lower figure corresponds only to\nthe spacetimes where no circular null geodesic exists in the external spacetime (b = 1.2). The gray line\nconnects the local maxima of the β (r/R, b) profiles. The figures are constructed in the same way as those\npresented for the black-hole external spacetimes.\n\n\f21\n\nWe can see that the local trapping factor in any given ECS spacetime reaches its\nmaximal values at the radius corresponding to the stable circular null geodesic and\ndecreases as the radius falls to the centre of the ECS. Nevertheless, the trapping region can extend down to the region near the centre only for the most compact ECS\nwith external spacetime of the black-hole type (for both negative and positive tidal\ncharges), having surface radius close the minimal allowed surface radius. The maximum of the β (r, R, b) profile then reaches value of β ∼ 1 close to the centre, where\nthe stable null circular geodesic is located in such spacetimes. On the other hand, for\npositively tidally charged ECS with external spacetime of the naked-singularity type,\nthe β (r, R, b) profile cannot reach the central part and its maximum is much smaller\nthan β = 1.\n\n4.4 Neutrino production rates\nGenerally, the neutrino production is a very complex process depending on detailed\nstructure of an extremely compact object. We can express the locally defined neutrino\nproduction rate in the form\nI (r{A }) =\n\ndN (r{A })\n,\ndτ(r)\n\n(65)\n\nwhere dN is the number of interactions at radius r, τ is the proper time of the static\nobserver at the given r, {A } is the full set of quantities relevant for the production\nrate. We can write that\ndN (r) = n(r)Γ (r)dV (r),\n(66)\nwhere n(r), Γ (r) and dV (r) are the number density of particles entering the neutrino\nproduction processes, the neutrino production rate and the proper volume element at\nthe radius r, respectively. Both n(r) and Γ (r) are given by detailed structure of the\nextremely compact objects, dV (r) is given by the spacetime geometry.\nHere, considering the uniform energy density braneworld stars (for requirements\nof more realistic model see, e.g., [31, 45]), we shall assume the local production rate\nto be proportional to the energy density, i.e., we assume uniform production rate as\nmeasured by the local static observers; of course, from the point of view of static observers at infinity, the production rate will not be distributed uniformly. (According to\n[17, 18, 19], such toy model could be reasonable good starting point for more realistic\ncalculations.)\nIn the internal spacetime we can thus write the local neutrino production rate in\nthe form\ndN\nI (r) =\n∝ ρ = const.\n(67)\ndτ\nThe local neutrino production rate related to the distant static observers is then given\nby the relation including the time-delay factor\nI=\n\ndN\n= I A(r, R, b).\ndt\n\n(68)\n\n\f22\n\nThe number of neutrinos produced at a given radius in a proper volume dV per unit\ntime of a distant static observer (that are governed by the internal metric coefficients)\nis given by the relation\ndNp (r, R, b) = I(r, R, b) dV (r) = 4πI A(r, R, b) B(r, R, b) r2 dr.\n\n(69)\n\nIntegrating through whole the compact object (from 0 to R), we arrive to the global\nneutrino production rate in the form\nZ R\n\nNp (R, b) = 4πI\n\nA− (r, R, b)B− (r, R, b)r2 dr.\n\n(70)\n\n0\n\nIn an analogical way, we can give the expressions for the global rates of escaping and\ntrapping of the produced neutrinos:\nZ R\n\nNe (R, b) = 4πI\n\nrb(e)\n\n(1 − cos ψe (r, R, b))A− (r, R, b)B− (r, R, b)r2 dr +\n\n+Np (rb(e) ),\nZ R\n\nNb (R, b) = 4πI\n\nrb(e)\n\n(71)\n\ncos ψe (r, R, b)A− (r, R, b)B− (r, R, b)r2 dr,\n\n(72)\n\nwhere rb(e) is the radius given by equation (52) and cosΨe (r, R, b) is determined by\nequation (58). In ECS spacetimes with parameters belonging to the Zones where rb(e)\nhas not good meaning, its role takes rb(i) , while we replace cos ψe for cos ψi . In such\nECS spacetimes all bound neutrinos are the internal ones.\n5 Efficiency of neutrino trapping\nIn order to characterize the trapping of neutrinos in extremely compact stars, we\nintroduce some coefficients giving the efficiency of the trapping effect in connection\nto the total neutrino luminosity and the cooling process in the period of the evolution\nof the star corresponding to the geodetical motion of neutrinos.\n5.1 Trapping coefficient of total neutrino luminosity\nThe influence of the trapping effect on the total neutrino luminosity of ECS can be\nappropriately given by the coefficient BL relating the number of neutrinos produced\ninside the whole compact star during unit time of distant observers and the number of\nthose produced neutrinos that will be captured by the extremely strong gravitational\nfield of the star. The total luminosity trapping coefficient is therefore given by the\nrelation\nRR\n−\n−\n2\nrb(e) A (r, R, b)B (r, R, b) cos ψe (r, R, b) r dr\n,\n(73)\nBL (R, b) =\nRR\n−\n−\n2\n0 A (r, R, b)B (r, R, b)r dr\nwhere\nA− B− =\n\n3RZ [(R − b)Y + R(2b − 3R)Z]\n,\nY [2R(2b − 3R)Z − bY ]\n\n(74)\n\n\f23\n\n1.0\n\n0.8 b = 0\n\nb=0\n\n0.8\nB L , QL\n\nB L , QL\n\n0.6\n0.4\n0.2\n\n0.6\n0.4\n0.2\n\n0.0\n\n0.0\n2.4\n\n2.6\n\n2.8\n\n3.0\n\n3.2\n\n3.4\n\n3.6\n\n1.0\n\nR\n\n1.5\n\n2.0\n\n2.5\n\n3.0\n\nR\n\nFig. 8 The total luminosity trapping coefficient BL (R, b) (full lines) and the internal luminosity trapping\ncoefficient QL (R, b) (dashed lines) as functions of the surface radius R for fixed characteristic values of\nthe tidal charge b. The left plot is given for negative tidal charges −1.2 ≤ b ≤ 0, the right plot for positive\ntidal charges 0 ≤ b < 27/20. The values of b are equally spaced with interval of 0.2 for b < 1 and 0.7 for\nb > 1.\n\nand the complementary luminosity \"escaping\" coefficient is determined by the simple\nformula\nEL (R, b) = 1 − BL (R, b).\n(75)\nWe can, moreover, define other global characteristic coefficients. For the \"internal\" neutrinos with motion restricted to the interior of the star, we introduce a coefficient\nRR\n−\n−\n2\nrb(i) A (r, R, b)B (r, R, b) cos ψi (r, R, b) r dr\n(76)\nQL (R, b) =\nRR\n−\n−\n2\n0 A (r, R, b)B (r, R, b)r dr\nand for the \"external\" neutrinos, we can use a complementary coefficient\nXL =\n\nNext\n= BL − QL .\nNp\n\n(77)\n\nThe results are illustrated for the coefficients BL (R, b), QL (R, b) in Figure 8.\nThe behaviour of the total luminosity trapping factor is qualitatively the same for\nECS with external spacetimes of the black-hole type for both negative and positive\ntidal charges, but it has qualitatively different character for the black-hole and nakedsingularity ECS spacetimes. In the black-hole-type ECS it monotonously increases\nwith decreasing surface radius for any fixed tidal charge (both negative and positive),\nwhile in the naked-singularity-type ECS spacetimes it reaches a maximum between\nthe centre and the surface radius R, and then it decreases to zero value for surface\nradius approaching the minimal value of R.\nFor the black-hole-type ECS with negative tidal charges the maximum of the coefficient BL (R, b) slightly decreases with decreasing b, while for positively tidally\ncharged ECS it increases with increasing b approaching BL (R, b) = 1 for b → 1. We\nobserve a similar behavior also for QL (R, b), but the magnitude of this coefficient is\nsmaller in comparison with BL (R, b). In the naked-singularity-type ECS (with positive tidal charges) the local maximum of BL (R, b) (and QL (R, b)) strongly decreases\nwith b increasing; of course, for ECS in the Zone III of the space of parameters, the\nparameter QL (R, b) is not defined.\n\n\f24\n\n1.0\n0< b <27\u009020\n\nb<0\nb=0\n\n0.8\n\nBc\n\n0.6\n\n0.4\n\n0.2\n\n0.0\n1.0\n\n1.5\n\n2.0\n\n2.5\n\n3.0\n\n3.5\n\nR\n\nFig. 9 The global cooling coefficient related to trapping of neutrinos in the active zone of trapping\nBC (R, b). For tidal charge b fixed for values with the same interval as in the previous figure and the\nfull range of R corresponding to the ECS is scanned.\n\n5.2 Trapping coefficient of neutrino cooling process\nThe efficiency of the influence of neutrino trapping on the cooling process is most\neffectively described by the local coefficient of trapping bc relating the trapped and\nproduced neutrinos at a given radius of the star that is defined by the relation\nbc (r, R, b) ≡ β (r, R, b).\n\n(78)\n\nThe local cooling coefficient is therefore given in Figures 6, 7 for appropriately chosen tidal charges b and related sequences of the surface radius R. All the properties of\nthe local trapping coefficient discussed above are thus relevant for the local cooling\nphenomena.\nFurther, the cooling process can be appropriately described in a complementary\nmanner by a global coefficient for trapping, restricted to the \"active\" zone, where the\ntrapping of neutrinos occurs. The global cooling coefficient is thus defined by the\nrelation\nRR\n−\n−\nrb(e,i) A (r, R, b)B (r, R, b) cos ψe,i (r, R, b)dr\n.\n(79)\nBc (R, b) ≡\nRR\n−\n−\n2\nrb(e,i) A (r, R, b)B (r, R, b)r dr\nThe global \"cooling\" coefficient Bc (R, b) is presented in Figure 9 - for few characteristic values of the tidal charge b, both negative and positive, the full range of the\nESC surface radius is scanned.\nThe behaviour of the global cooling factor Bc (R, b) is of the same character as\nfor the total luminosity factor BL (R, b) in both black-hole and naked-singularity-type\nECS and for both negative and positive tidal charges. Its magnitude is nearly twice\nhigher than those of the total luminosity factor for the surface radii R close to their\nmaximal value, but it is nearly equal to the total luminosity factor as R approaches its\nminimal value.\n\n\f25\n\n6 Conclusions\nWe have demonstrated that the braneworld ECS can be separated into five classes\ncorresponding to five Zones of the parameter space (b − R) where trapping of neutrinos and their motion in the external field of the ECS are realized in qualitatively\ndifferent way. There are fundamental differences of the trapping effect in the field\nof ECS with negative and positive tidal charges. The differences are related to both\nthe surface radius of the ECS and the trapping coeffients of both kind - for the total luminosity and the cooling process. Moreover, there is a strong difference of the\ntrapping efficiency in the ECS with positive tidal charge when related to the blackhole spacetimes and the naked-singularity spacetimes. In the first case, the trapping is\nvery efficient and the global trapping coefficient can approach the value of 1 for the\nspacetimes with b → 1, while in the second case the coefficients strongly decrease\nfor tidal charges growing above the critical value of b = 1.\nThere is an astrophysically very important effect related to the surface radius of\nthe ECS with the negative and positive tidal charges. For b < 0, the surface radius of\nECS can significantly overcome the limiting value of R = 3 valid for b = 0. On the\nother hand, for b > 0, the surface radius of ECS decreases under the standard value\nof R = 3 - for ECS with b ∼ 1, there is Rmax ∼ 2.3 that is substantially lower than\nthe values indicated by observations, and for b > 1 the ECS surface radius decreases\nfurther.\nIn the ECS spacetimes with negative charge there is a crucial effect related to\nthe increase of the surface radius of the ECS allowed for decreasing b < 0. For tidal\ncharges slightly under the value of b ∼ −1, the ECS surface radius approaches R = 4\nstrongly overcoming the limit of R = 3 corresponding to the standard Schwarzschild\nspacetimes and enters the region of values commonly accepted for observed neutron stars that can be lowered down to R = 3.5 [23, 13]. In such cases the coefficient of total luminosity can be of quite significant value for astrophysically realistic radii of ECS. For example, in the case of ECS with R = 3.5 and b = −1.2,\nthere is BL (R, b) ∼ 0.023. The global cooling coefficient can approach even the\nvalue of Bc (R, b) ∼ 0.077 under such conditions, indicating thus very strong and\nsignificant effects of trapping for braneworld negatively charged ECS, significantly\novercoming the related values corresponding to the standard (tidally non-charged)\nspacetimes [44]. Because the effect of trapping of neutrinos is cumulative, one can\nexpect its relevance in realistic models of ECS to be strongly enhanced by negative\ntidal charges. Note that the conditions on the tidal charge magnitude implied by the\nhigh-frequency quasiperiodic oscillations observed in some low-mass-X-ray- binaries containing neutron or quark stars put the limit b < 1.2 (assuming their mass\nm ∼ 2M ) [21]. This limit allows for sufficient increasing of the ECS surface radius\nwith negative tidal charges enabling strong effects of neutrino trapping in the interior of such ECS with observationally acceptable radius. The expected lowering of\nthe neutrino luminosity in observed neutron stars can be about ∼ 10 % and could be\nobservationally tested.\nWe can conclude that the negative tidal charges cause slight decrease of the efficiency of the trapping phenomena in the field of ECS, but they significantly shift\nthese phenomena to the region of astrophysically relevant situations due to the strong\n\n\f26\n\nincrease of the surface radius of such ECS, shifting the radius to values acceptable\nobservationally. On the other hand, the positive tidal charges generally enhance the\ntrapping effects for the ECS spacetimes of the black-hole type, but the surface radius\nof such ECS is strongly shifted to the regions excluded observationally.\nAcknowledgements The present work was supported by the Czech grants MSM 4781305903, LC 06014,\nGAČR 205/09/H033 and the internal grant SGS/2/2010. One of the authors (Z. S.) would like to express\nhis gratitude to the Czech Committee for collaboration with CERN and the Theory Division of CERN for\nperfect hospitality.\n\nReferences\n1. Abdujabbarov, A., Ahmedov, B.: Test particle motion around a black hole in a braneworld. Phys. Rev.\nD 81, 044022 (2010)\n2. Abramowicz, M.A., Anderson, N., Bruni, M., Ghosh, P., Sonego, S.: Gravitational waves from ultracompact stars: the optical geometry view of trapped modes. Class. Quantum Grav. 14, L189–L194\n(1997)\n3. Abramowicz, M.A., Miller, J.C., Stuchlı́k, Z.: Concept of radius of gyration in general relativity. Phys.\nRev. D 47 1440–1447 (1993)\n4. Abramowicz, M.A., Prasanna, A.R.: Centrifugal Force Reversal Near a Schwarzschild Black-Hole.\nMon. Not. R. Astron. Soc. 245, 720 (1990)\n5. Aliev, A.N., Gümrükçüoğlu, A.E.: Charged rotating black holes on a 3-brane. Phys. Rev. D 71, 104027\n(2005)\n6. Aliev, A.N., Talazan, P.: Gravitational effects of rotating braneworld black holes. Phys. Rev. D 80,\n044023 (2009)\n7. Arkani-Hamed, N., Dimopoulos, S., Dvali, G.: The hierarchy problem and new dimensions at a millimeter. Phys. Lett. B 429, 263–272 (1998)\n8. Bahcall, S., Lynn, B.W., Selipsky, S. B.: New models for neutron stars. Astrophys. J. 362, 251–255\n(1990)\n9. Böhmer, C.G., De Risi, G., Harko, T., Lobo, F.S.N.: Classical tests of general relativity in brane world\nmodels. Class. Quantum Grav. 27, 185013 (2010)\n10. Böhmer, C.G., Harko, T., Lobo, F.S.N.: Solar system tests of brane world models. Class. Quantum\nGrav. 25, 045015 (2008)\n11. Bin-Nun, A.Y.: Relativistic images in Randall-Sundrum II braneworld lensing. Phys. Rev. D 81,\n123011 (2010)\n12. Bin-Nun, A.Y.: Gravitational lensing of stars orbiting Sgr A* as a probe of the black hole metric in\nthe Galactic center. Phys. Rev. D 82, 064009 (2010)\n13. Cottam, J., Paerls, F., Mendez, M.: Gravitationally redshifted absorption lines in the X-ray burst spectra of a neutron star. Nature 420, 51–54 (2002)\n14. Dadhich, N., Maartens, R., Papadopoulos, P., Rezania, V.: Black holes on the brane. Phys. Lett. B\n487, 1–6 (2000)\n15. Dimopoulos, S., Landsberg, G.: Black Holes at the Large Hadron Collider. Phys. Rev. Lett. 87, 161602\n(2001)\n16. Germani, C., Maartens, R.: Stars in the braneworld. Phys. Rev. D 64, 124010 (2001)\n17. Glendenning, N.K.: First-order phase transitions with more than one conserved charge: Consequences\nfor neutron stars. Phys. Rev. D 46, 1274–1287 (1992)\n18. Glendenning, N.K.: Compact Stars: Nuclear Physics, Particle Physics, and General Relativity.\nSpringer, New York (2000)\n19. Haensel, P., Zdunik, J.L.: A submillisecond pulsar and the equation of state of dense matter. Nature\n340, 617–619 (1986)\n20. Hledı́k, S., Stuchlı́k, Z., Mrázová, K.: Comparison of general relativistic polytropic and adiabatic\nfluid spheres with a repulsive cosmological constant. In: Hledı́k, S., Stuchlı́k, Z. (eds.) Proceedings\nof RAGtime 4/5: Workshops on black holes and neutron stars, Opava, 14–16/13–15 October 2002/03,\npp. 75–89. Silesian University in Opava, Opava (2004)\n\n\f27\n21. Kotrlová, A., Stuchlı́k, Z., Török, G.: Quasiperiodic oscillations in a strong gravitational field around\nneutron stars testing braneworld models. Class. Quantum Grav. 25, 225016 (2008)\n22. Lattimer, J., Prakash, M.: The physics of neutron stars. Science 304, 536–542 (2004)\n23. Lattimer, J., Prakash, M.: Neutron star observations: Prognosis on Equation of state constraints. Phys.\nRep. 442, 109–165 (2007)\n24. Maartens, R.: Brane-World Gravity. Living Rev. Relativity 7, 7 (2004)\n25. Mallick, R., Bhattacharyya, A., Ghosh, S.K., Raha, S.: General Relativistic effect on the energy deposition rate for neutrino pair annihilation above the equatorial plane along the symmetry axis near a\nrotating neutron star. ArXiv e-prints 0905.3605v2 [astro-ph.HE] (2009)\n26. Mamadjanov, A.I., Hakimov, A.A., Tojiev, S.R.: Quantum Interference Effects in Spacetime of Slowly\nRotating Compact Objects in Braneworld. Mod. Phys. Lett. A 25, 243–256 (2010)\n27. Miller, J., Shahbaz, T., Nolan, L. A.: Are Q-stars a serious threat for stellar-mass black hole candidates? Mon. Not. R. Astron. Soc. 294, L25–L29 (1998)\n28. Misner, C.W., Thorne, K.S., Wheeler, J.A.: Gravitation. San Francisco, W. H. Freeman (1973)\n29. Morozova, V.S., Ahmedov, B.J., Abdujabbarov, A.A., Mamadjanov, A.I.: Plasma magnetosphere of\nrotating magnetized neutron star in the braneworld. Astrophys. & Space Sci. 330, 257–266 (2010)\n30. Nilsson, U.S., Ugla, C.: General Relativistic Stars: Polytropic Equations of State. Annals of Physics\n286, 292–319 (2000)\n31. Østgaard, E.: Internal structure of neutron stars. In: Hledı́k, S., Stuchlı́k, Z. (eds.) Proceedings of\nRAGtime 2/3: Workshops on black holes and neutron stars, Opava, 11–13/8–10 October 2000/01,\npp. 73–102. Silesian University in Opava, Opava (2001)\n32. Randall, L., Sundrum, R.: An Alternative to Compactification. Phys. Rev. Lett. 83, 4690–4693 (1999)\n33. Schee, J., Stuchlı́k, Z.: Profiles of emission lines generated by rings orbiting braneworld Kerr black\nholes. Gen. Relativ. Gravit. 41, 1795–1818 (2009)\n34. Schee, J., Stuchlı́k, Z.: Optical Phenomena in the Field of Braneworld Kerr Black Holes. Int. J. Mod.\nPhys. D 18, 983–1024 (2009)\n35. Schwarzschild, K.: Über das Gravitationsfeld einer Kugel aus inkompressibler Flüssigkeit nach der\nEinsteinschen Theorie. Sitzungsber. K. Preuss. Akad. Wiss., Phys.–Math. Kl. 424–434 (1916)\n36. Shapiro, S.L., Teukolsky, S.A.: Black Holes, White Dwarfs and Neutron Stars: The Physics of Compact Objects. Wiley–VCH, New York (1983)\n37. Shiromizu, T., Maeda, K.-I., Sasaki, M.: The Einstein equations on the 3-brane world. Phys. Rev. D\n62, 024012 (2000)\n38. Stuchlı́k, Z.: Note on the properties of the Schwarzschild-de-Sitter spacetime. Bull. Astronom. Inst.\nCzechoslovakia 41, 341–343 (1990)\n39. Stuchlı́k, Z.: Spherically symmetric static configurations of uniform density in spacetimes with a nonzero cosmological constant. Acta Phys. Slovaca, 50, 219–228 (2000)\n40. Stuchlı́k, Z., Hledı́k, S., Juráň, J.: Optical reference geometry of Kerr-Newman spacetimes. Class.\nQuantum Grav. 17, 2691–2718 (2000)\n41. Stuchlı́k, Z., Hledı́k, S., Šoltés, J., Østgaard, E.: Null geodesics and embedding diagrams of the interior\nSchwarzschild–de Sitter spacetimes with uniform density. Phys. Rev. D 64, 044004 (2001)\n42. Stuchlı́k, Z., Kotrlová, A.: Orbital resonances in discs around braneworld Kerr black holes. Gen.\nRelativ. Gravit. 41, 1305–1343 (2009)\n43. Stuchlı́k, Z., Schee, J.: Appearance of Keplerian discs orbiting Kerr superspinars. Class. Quantum\nGrav. 27, 215017 (2010)\n44. Stuchlı́k, Z., Török, G., Hledı́k, S., Urbanec, M.: Neutrino trapping in extremely compact objects: I.\nEfficiency of trapping in the internal Schwarzschild spacetimes. Class. Quantum Grav. 26, 035003\n(2009)\n45. Weber, F.: Pulsars as Astrophysical Laboratories for Nuclear and Particle Physics. Taylor & Francis,\nLondon (1999)\n46. Weber, F., Glendenning, N.K.: Application of the improved Hartle method for the construction of\ngeneral relativistic rotating neutron star models. Astrophys. J. 390, 541 (1992)\n\n\f"}