{"id": "http://arxiv.org/abs/0806.3907v1", "guidislink": true, "updated": "2008-06-24T14:40:30Z", "updated_parsed": [2008, 6, 24, 14, 40, 30, 1, 176, 0], "published": "2008-06-24T14:40:30Z", "published_parsed": [2008, 6, 24, 14, 40, 30, 1, 176, 0], "title": "Effective Potential of the Conformal Factor: Gravitational Average\n  Action and Dynamical Triangulations", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0806.4218%2C0806.2909%2C0806.0951%2C0806.0770%2C0806.3167%2C0806.0053%2C0806.4351%2C0806.2877%2C0806.2173%2C0806.2737%2C0806.2558%2C0806.4168%2C0806.3098%2C0806.1433%2C0806.3562%2C0806.4471%2C0806.3907%2C0806.1932%2C0806.4390%2C0806.3960%2C0806.3831%2C0806.3849%2C0806.3261%2C0806.1689%2C0806.4502%2C0806.0321%2C0806.0283%2C0806.4655%2C0806.4388%2C0806.1559%2C0806.4628%2C0806.0840%2C0806.0011%2C0806.2390%2C0806.3860%2C0806.1633%2C0806.0614%2C0806.3793%2C0806.0319%2C0806.2987%2C0806.3378%2C0806.1189%2C0806.4127%2C0806.4604%2C0806.1770%2C0806.3020%2C0806.4683%2C0806.4868%2C0806.0275%2C0806.2520%2C0806.0949%2C0806.4703%2C0806.0910%2C0806.1506%2C0806.1057%2C0806.4382%2C0806.4061%2C0806.0447%2C0806.2486%2C0806.2210%2C0806.1003%2C0806.1777%2C0806.0242%2C0806.0841%2C0806.0486%2C0806.2704%2C0806.2880%2C0806.1249%2C0806.4540%2C0806.2207%2C0806.4654%2C0806.0569%2C0806.3617%2C0806.3307%2C0806.2450%2C0806.3739%2C0806.3719%2C0806.2724%2C0806.2218%2C0806.1588%2C0806.3393%2C0806.2531%2C0806.4077%2C0806.2649%2C0806.0279%2C0806.3957%2C0806.4635%2C0806.4089%2C0806.1484%2C0806.3342%2C0806.2747%2C0806.4178%2C0806.4768%2C0806.0007%2C0806.2857%2C0806.2189%2C0806.1504%2C0806.3029%2C0806.3273%2C0806.1323%2C0806.4779&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Effective Potential of the Conformal Factor: Gravitational Average\n  Action and Dynamical Triangulations"}, "summary": "We discuss the effective potential of the conformal factor in the effective\naverage action approach to Quantum Einstein Gravity. Without invoking any\ntruncation or other approximations we show that if the theory has has a\nnon-Gaussian ultraviolet fixed point and is asymptotically safe the potential\nhas a characteristic behavior near the origin. We argue that this\ncharacteristic behavior has already been observed in numerical simulations\nwithin the Causal Dynamical Triangulation approach.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0806.4218%2C0806.2909%2C0806.0951%2C0806.0770%2C0806.3167%2C0806.0053%2C0806.4351%2C0806.2877%2C0806.2173%2C0806.2737%2C0806.2558%2C0806.4168%2C0806.3098%2C0806.1433%2C0806.3562%2C0806.4471%2C0806.3907%2C0806.1932%2C0806.4390%2C0806.3960%2C0806.3831%2C0806.3849%2C0806.3261%2C0806.1689%2C0806.4502%2C0806.0321%2C0806.0283%2C0806.4655%2C0806.4388%2C0806.1559%2C0806.4628%2C0806.0840%2C0806.0011%2C0806.2390%2C0806.3860%2C0806.1633%2C0806.0614%2C0806.3793%2C0806.0319%2C0806.2987%2C0806.3378%2C0806.1189%2C0806.4127%2C0806.4604%2C0806.1770%2C0806.3020%2C0806.4683%2C0806.4868%2C0806.0275%2C0806.2520%2C0806.0949%2C0806.4703%2C0806.0910%2C0806.1506%2C0806.1057%2C0806.4382%2C0806.4061%2C0806.0447%2C0806.2486%2C0806.2210%2C0806.1003%2C0806.1777%2C0806.0242%2C0806.0841%2C0806.0486%2C0806.2704%2C0806.2880%2C0806.1249%2C0806.4540%2C0806.2207%2C0806.4654%2C0806.0569%2C0806.3617%2C0806.3307%2C0806.2450%2C0806.3739%2C0806.3719%2C0806.2724%2C0806.2218%2C0806.1588%2C0806.3393%2C0806.2531%2C0806.4077%2C0806.2649%2C0806.0279%2C0806.3957%2C0806.4635%2C0806.4089%2C0806.1484%2C0806.3342%2C0806.2747%2C0806.4178%2C0806.4768%2C0806.0007%2C0806.2857%2C0806.2189%2C0806.1504%2C0806.3029%2C0806.3273%2C0806.1323%2C0806.4779&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We discuss the effective potential of the conformal factor in the effective\naverage action approach to Quantum Einstein Gravity. Without invoking any\ntruncation or other approximations we show that if the theory has has a\nnon-Gaussian ultraviolet fixed point and is asymptotically safe the potential\nhas a characteristic behavior near the origin. We argue that this\ncharacteristic behavior has already been observed in numerical simulations\nwithin the Causal Dynamical Triangulation approach."}, "authors": ["Jan-Eric Daum", "Martin Reuter"], "author_detail": {"name": "Martin Reuter"}, "author": "Martin Reuter", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1166/asl.2009.1033", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0806.3907v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0806.3907v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "17 pages, 2 figures", "arxiv_primary_category": {"term": "hep-th", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "hep-th", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "gr-qc", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0806.3907v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0806.3907v1", "journal_reference": "Adv.Sci.Lett.2:255-260,2009", "doi": "10.1166/asl.2009.1033", "fulltext": "arXiv:0806.3907v1 [hep-th] 24 Jun 2008\n\nMZ-TH/08-19\n\nEffective Potential of the Conformal Factor:\nGravitational Average Action and\nDynamical Triangulations\nJ.-E. Daum and M. Reuter\nInstitute of Physics, University of Mainz\nStaudingerweg 7, D–55099 Mainz, Germany\n\nAbstract\nWe discuss the effective potential of the conformal factor in the effective average\naction approach to Quantum Einstein Gravity. Without invoking any truncation or\nother approximations we show that if the theory has has a non-Gaussian ultraviolet\nfixed point and is asymptotically safe the potential has a characteristic behavior near\nthe origin. We argue that this characteristic behavior has already been observed in\nnumerical simulations within the Causal Dynamical Triangulation approach.\n\n\f1\n\nIntroduction\nOne of the problems one faces when one tries to construct a fundamental theory\n\nof quantum gravity is the absence of any experimental data or observations that necessarily would have to be explained by the theory [1–4]. In this situation it is particularly\nimportant to compare the predictions of a priori different candidate theories and to find\nout whether they are perhaps just different formulations of the same underlying theory\nor whether they really belong to different \"universality classes\". In this way one can at\nleast narrow down the set of independent possibilities among which the experiment must\ndecide in the end. Guided by the experience with Yang-Mills theory we would expect\nthat in particular the comparison of continuum and lattice approaches should be very\ninstructive and fruitful. On the side of the continuum approaches, recently a lot of efforts\nwent into the exploration of the asymptotic safety scenario [5–28] in the formulation based\nupon the gravitational average action. It aims at defining a microscopic quantum field\ntheory of gravity in terms of a complete, i.e., infinitely extended renormalization group\n(RG) trajectory on the theory space of diffeomorphism invariant functionals of the metric.\nThe limit of an infinite ultraviolet (UV) cutoff is taken by arranging this trajectory to\napproach a non-Gaussian fixed point (NGFP) at large scales (k → ∞). This NGFP of the\n\neffective average action is not only instrumental in constructing the quantum field theory\nby dictating how all generalized couplings must \"run\" when the UV regulator scale is sent\nto infinity, it also determines the physical properties of the resulting regulator-free theory\nat large physical scales, the behavior of propagators at large momenta, for instance. We\nrefer to this quantum field theory of the metric, defined in the continuum by means of\nthe effective average action, as Quantum Einstein Gravity (QEG).\nIn Yang-Mills theory, the asymptotic scaling behavior that controls the approach\nto the continuum of the corresponding lattice gauge theory can be read off from the\ncorresponding effective average action [29–32]. It is therefore plausible to ask whether\nthere is an analogous relationship between QEG and gravity on a (dynamical) lattice.\nA first comparison (of critical indices) has been attempted in [9] where the results from\nthe average action were confronted with Monte Carlo data obtained in Regge calculus\n\n1\n\n\fsimulations [33]. The results were found to be consistent, albeit within considerable error\nbars.\nA different statistical-mechanics based framework for quantum gravity that has been\ndeveloped during the past years is the Causal Dynamical Triangulation (CDT) approach\n[47–50]. It provides a background-independent, nonperturbative definition of quantum\ngravity in which the causal (i.e., Lorentzian) structure of spacetime plays a crucial role.\nOnly causally well-behaved geometries contribute to the path integral. It is regularized by\nsumming over a particular class of triangulated, piecewise flat geometries. All contributing\nspacetimes are foliated by a kind of proper-time and can be obtained by gluing together 4simplices in a way that respects this foliation. The slices of constant proper-time consist\nof spacelike tetrahedra forming a 3-dimensional piecewise flat manifold. Typically its\ntopology is assumed to be that of a three-sphere S 3 . Each configuration contributing\nto the regularized path integral can be rotated to Euclidean signature, and the rotated\npartition function can be computed by means of standard Monte Carlo methods. It was\nfound [50] that the CDT approach can generate almost classical 4-dimensional universes\non which only small quantum fluctuations are superimposed.\nIn ref. [48] an effective action for the Robertson-Walker scale factor a(t) of these\nuniverses has been extracted from the Monte Carlo data. In the present paper we are\ngoing to compare this effective action to the corresponding prediction of QEG. We shall\ndemonstrate that the latter reflects the non-Gaussian fixed point, the crucial prerequisite\nof asymptotic safety, by a characteristic \"finger print\" at small scale factors. The very\nsame finger print has actually been observed already in the CDT simulations.\nWe interprete these results as an indication pointing in the direction that QEG\nand the CDT approach could possibly describe the same underlying theory in different\nlanguages, i.e. that they are two representatives of the same \"universality class\".\nIn fact, in ref. [8, 23] another point of contact between CDT and QEG had been\nfound already: They agree on the microscopic spectral dimension of macroscopically 4dimensional spacetimes; in either case one finds the somewhat surprising result dS = 2.\nThe remaining sections of this paper are organized as follows. In Section 2 we\nanalyze the effective potential of the conformal factor in QEG and discuss in particular\n\n2\n\n\fthe impact the NGFP has on it. In Section 3 we make contact with the CDT simulations,\nand in Section 4 we present the conclusions.\n\n2\n\nThe Effective Potential of the Conformal Factor\nin QEG\nIn this section we discuss the standard effective potential (i. e., the one with vanish-\n\ning infrared cutoff, k = 0) for the conformal factor of metrics on maximally symmetric\nspacetimes with the topology of a d-dimensional sphere S d . The starting point is the exact\ngravitational effective average action [6] along some RG trajectory, Γk [gμν , ḡμν ], and the\nrelated reduced functional Γ̄k [gμν ] ≡ Γk [gμν , gμν ]. (The ghost arguments are set to zero\n\nand are not indicated explicitly.) The latter functional is assumed to have a representation\nof the form\nΓ̄k [gμν ] =\n\nX\n\nūα (k) Iα [gμν ]\n\n(2.1)\n\nα\n\nwhere {Iα [gμν ]} is an infinite set of local and nonlocal \"basis\" functionals, invariant un-\n\nder diffeomorphisms acting on gμν , and the ūα 's are the corresponding running coupling\n\nconstants. We denote their canonical mass dimensions by dα ≡ [ūα ]. Hence, since Γ̄k is\n\ndimensionless, [Iα ] = −dα . The dimensionless running couplings are defined by\nuα (k) ≡ k −dα ūα (k)\nso that we may rewrite (2.1) as\nΓ̄k [gμν ] =\n\nX\n\nuα (k) k dα Iα [gμν ]\n\n(2.2)\n\nα\n\nUp to now the metric argument gμν was completely general. At this point we\nspecialize for metrics on S d , with a variable radius φ. We parametrize them as\ngμν = φ2 ĝμν\n\n3\n\n(2.3)\n\n\fwhere ĝμν is the metric on the round S d with unit radius, and the conformal factor φ is\nposition independent. Hence gμν is a metric on a round sphere with radius φ. We shall\nR\n\u0001\n√\ndenote the volume of the unit-S d by σd ≡ dd x ĝ = 2π (d+1)/2 /Γ (d + 1)/2 .\n\nWe use conventions such that the coordinates xμ are dimensionless and φ has the\n\ndimension of a length. Hence [gμν ] = −2, and ĝμν is dimensionless, [ĝμν ] = 0.\n\nWithout having made any approximation so far, the effective average potential for\n\nthe conformal factor, Uk (φ), by definition, obtains by inserting the special argument (2.3)\ninto Γ̄k :\nUk (φ)\n\nZ\n\np\nĝ ≡ Γ̄k [gμν = φ2 ĝμν ]\n\ndd x\n\n(2.4)\n\nIn terms of the expansion (2.2) we have the exact representation\nUk (φ) = σd−1\n\nX\n\nuα (k) k dα Iα [φ2 ĝμν ]\n\n(2.5)\n\nuα (k) (kφ)dα Iα [ĝμν ]\n\n(2.6)\n\nα\n\nor, more explicitly,\nUk (φ) = σd−1\n\nX\nα\n\nTo obtain equation (2.6) we exploited that Iα [φ2 ĝμν ] = φdα Iα [ĝμν ] which holds true since\nIα has dimension −dα . (This relation can be regarded the definition of the canonical mass\n\ndimension.)\n\nEq. (2.6) makes it manifest that if we know a complete RG trajectory {uα (k), 0 ≤\n\nk < ∞} we can deduce the exact running potential from it, and in particular its k → 0\n\nlimit, the standard effective potential Ueff (φ) ≡ Uk=0 (φ). Usually we are not in the com-\n\nfortable situation of knowing trajectories exactly; nevertheless certain important properties of Ueff (φ) can be deduced on general grounds. For this purpose we shall employ the\nfollowing decoupling argument which is standard in the average action context [29, 31].\nThe basic observation is that the true, i. e. dimensionful coupling constants ūα (k)\nhave a significant running with k only as long as the number of field modes integrated\nout actually depends on k. If there are competing physical cutoff scales such as masses or\nfield amplitudes the running with k stops once k becomes smaller than the physical cutoff\n\n4\n\n\fscales. (See Appendix C.3 of [28] for an example.) In the case at hand this situation\nis realized in a particularly transparent way. The quantum metric is expanded in terms\nof eigenfunctions of the covariant (tensor) Laplacian D̄ 2 of the metric ḡμν . This metric\ncorresponds to a sphere of radius φ; hence all eigenvalues of the Laplacian are discrete\nmultiples of 1/φ2. As a result, when k has become as small as k ≈ 1/φ, the bulk of\n\neigenvalues is integrated out, and the ūα 's no longer change much when k is lowered even\nfurther. Therefore we can approximate\nUeff (φ) ≡ Uk=0 (φ) ≈ Uk=1/φ (φ)\n\n(2.7)\n\nIn order to make the approximation (2.7) strictly valid we have to be slightly more\nspecific about the precise definition of Uk (φ). The above argument could be spoiled by\nzero modes of D̄ 2 . Therefore we define Γk and Uk in terms of a functional integral over the\nfluctuation modes of the metric with a non-zero eigenvalue of D̄ 2 only. As a result, the\nactual partition function would obtain by a final integration over the zero modes which\nis not performed here. The only zero mode relevant in the case at hand is the fluctuation\nof the conformal factor. When we compare our results to the CDT simulations later on\nit will be important to keep in mind that Ueff (φ) has the interpretation of an effective\npotential in which the conformal fluctuation has not yet been integrated out since it is\nessentially this quantity that is provided by the Monte Carlo simulations.\nEq. (2.7) has a simple intuitive interpretation in terms of coarse graining: By lowering k below 1/φ one tries to \"average\" field configurations over a volume that would be\nlarger than the volume of the whole universe. As this is not possible, the running stops.\nNote that the S d topology enters here; the finite volume of the sphere is crucial.\nWith the approximation (2.7) we obtain the following two equivalent representations\nof Ueff (φ) in terms of the dimensionless and dimensionful running couplings, respectively:\nUeff (φ) = σd−1\n\nX\n\nuα (φ−1 ) Iα [ĝμν ]\n\n(2.8)\n\nX\n\nūα (φ−1 ) φdα Iα [ĝμν ]\n\n(2.9)\n\nα\n\nUeff (φ) = σd−1\n\nα\n\nAs an application of these representations we consider two special cases.\n\n5\n\n\fLet us assume the RG trajectory under consideration has a classical regime between\nthe scales k1 and k2 , meaning that ūα (k) ≈ const ≡ ūclass\nfor k1 < k < k2 . Then (2.9)\nα\n\nimplies that for k2−1 < φ < k1−1 , approximately,\nUeff (φ) = σd−1\n\nX\n\nūclass\nIα [ĝμν ] φdα\nα\n\n(2.10)\n\nα\n\nAs expected, this potential has a nontrivial φ-dependence governed by the classical couplings ūclass\n.\nα\nNext let us explore the consequences which a non-Gaussian fixed point has for the\neffective potential. We assume that the dimensionless couplings uα (k) approach fixed\npoint values u∗α for k → ∞. More precisely, we make the approximation uα (k) ≈ u∗α\n\nfor k & M with M the lower boundary of the asymptotic scaling regime. Then the\nP\nrepresentation (2.8) tells us that Ueff (φ) = σd−1 α u∗α Iα [ĝμν ] if φ . M −1 . Obviously this\npotential is completely independent of φ:\n\nUeff (φ) = const for all φ . M −1\n\n(2.11)\n\nIn typical applications (see below), M equals the Planck mass mPl ≡ l−1\nPl so that Ueff is\nconstant for φ . lPl .\n\nEq. (2.11) is one of our main results. It shows that the existence of an ultraviolet\nfixed point has a characteristic impact on the effective potential of the conformal factor:\nRegardless of all details of the RG trajectory, the potential is completely flat for small\nφ. The interpretation of this result is that for φ . M −1 the cost of energy (Euclidean\naction) of a sphere with radius φ does not depend on φ. Spheres of any radius smaller\nthan M −1 are on an equal footing. This is exactly the kind of fractal-like behavior and\nscale invariance one would expect near the NGFP [8, 10].\nWe emphasize that except for the decoupling relation (2.7) no approximation went\ninto the derivation of this result. It is an exact consequence of the assumed asymptotic\nsafety, the existence of a NGFP governing the short distance behavior. Neither has the\ntheory space been truncated nor have any fields been excluded from the quantization\n(such as in conformally reduced gravity the transverse tensors, for instance, cf. [21, 22]).\n\n6\n\n\fOn the basis of the above general argument we cannot predict how precisely, or how\nquickly the effective potential flattens when we approach the origin. However, we expect\nthat its derivative ∂Ueff /∂φ vanishes at φ = 0. This has an important physical implication.\nIn general, possible vacuum states of the system (the \"universe\") can be found from the\neffective field equation δΓk=0 /δgμν = 0. More specifically, S d -type groundstate candidates\n\u0001\nhave a radius φ0 at which ∂Ueff /∂φ (φ0 ) = 0. Thus we see that thanks to the NGFP a\n\nvanishing radius φ0 = 0 has become a vacuum candidate, the derivative of Ueff vanishes\n\nthere. (To qualify as the true vacuum it should be the global minimum.) Hence the\nuniverse has an at least metastable stationary state with φ = 0, i.e. a state with a\nvanishing metric expectation value hgμν i = 0. In this state gravity is in a phase of\nunbroken diffeomorphism invariance, see ref. [22] for a discussion of this phase in the\ncontext of asymptotic safety.\nLet us finally illustrate the above discussion in the familiar setting of the EinsteinHilbert truncation [6] in d = 4 which is defined by the ansatz\nZ\n\u0010\n\u0011\n1\n4 √\nd x g R(g) − 2Λk\nΓ̄k [gμν ] = −\n16πGk\nInserting (2.3) with φ = φ(x) we obtain\nZ\ni\np h 1\n3\n1\n2\nΓ̄k [φ ĝμν ] =\nd4 x ĝ − ĝ μν ∂μ φ∂ν φ − φ2 + Λ(k)φ4\n4πG(k)\n2\n6\nFor x-independent φ only the potential term survives, with\n\u0011\n1\n3 \u0010\n− φ2 + Λ(k) φ4\nUk (φ) =\n4πG(k)\n6\n\u0011\n3 \u0010\n1\n2 2\n4 4\n=\n− k φ + λ(k) k φ\n4πg(k)\n6\n\n(2.12)\n\n(2.13)\n\n(2.14)\n\nIf Λ(k) > 0, the case we shall always consider in the following, Uk (φ) has a minimum at\na nonzero radius given by\nφ0 (k) =\n\np\n\n3/Λ(k)\n\n(2.15)\n\nThis is exactly the radius of the S 4 which solves the ordinary Einstein equation following\nfrom the action (2.12)1 . In the second line of (2.14) we employed the dimensionless\n1\n\nBecause this space is maximally symmetric, by Palais' theorem [34], inserting the ansatz gμν = φ2 ĝμν\n\ncommutes with deriving the critical point.\n\n7\n\n\fNewton constant g(k) ≡ k 2 G(k) and cosmological constant λ(k) ≡ Λ(k)/k 2 . So there are\n\nthe following two equivalent ways of writing the effective potential:\n\n3h\n1\n1 Λ(φ−1 ) 4 i\n2\n−\nφ\n+\nφ\n4π\nG(φ−1 )\n6 G(φ−1 )\n1\n1 λ(φ−1 ) i\n3h\n−\n+\nUeff (φ) =\n4π\ng(φ−1) 6 g(φ−1)\n\nUeff (φ) =\n\n(2.16)\n(2.17)\n\nThe RG trajectories of the Einstein-Hilbert truncation have been investigated and\nclassified in [9]. Here we can concentrate on those with a positive cosmological constant,\nthose of \"Type IIIa\", because this class of trajectories seems to be the one which is behind\nthe Monte Carlo results we are going to discuss. Important regimes along a Type IIIa\ntrajectory include\nThe NGFP regime: g(k) ≈ g∗ , λ(k) ≈ λ∗ for k & M.\n\nThe k 4 regime: G(k) ≈ const, Λ(k) ∝ k 4 for kT . k . M, where kT is the \"turning\npoint\" scale at which βλ vanishes.\n\nThe classical regime: G(k) ≈ const ≡ Ḡ, Λ(k) ≈ const ≡ Λ̄ for kterm ≪ k . kT where\n\nkterm is the scale at which the Einstein-Hilbert truncation breaks down and the trajectory\nterminates at a singularity2 .\n−1/2\nIf one defines the classical Planck mass and length by mPl ≡ l−1\none finds that,\nPl ≡ Ḡ\n\napproximately, M ≈ mPl . (For further details see [9, 40, 44]; see in particular Fig. 4\nof [44].)\n\nIn the k 4 -regime, when k decreases, the cosmological constant quickly becomes\nsmaller proportional to k 4 , and the radius of the sphere \"on shell\", φ0 (k), increases proportional to 1/k 2 .\nIf the underlying RG trajectory of QEG is of Type IIIa then Ueff (φ) is constant\n−1\nin the NGFP regime φ . lPl , and it equals the classical potential for kT−1 . φ . kterm\n.\n\nNote that our ignorance about the infrared end of the trajectory entails that we have no\ninformation about the effective potential for large values of φ. The intermediate k 4 -regime\n2\n\nIf one tentatively matches the trajectory against the observed values of G and Λ one finds that\n\n−1\n−1\nkT ≈ 10−30 mPl , corresponding to kT\n≈ 10−3 cm, and kterm ≈ 10−60 mPl ≈ H0 so that kterm\nequals about\n\nthe present Hubble radius [44], [40].\n\n8\n\n\fof the trajectory gives rise to a behavior\nUeff (φ) ∝ (−φ2 + const) for kT−1 . φ . lPl .\n\n(2.18)\n\nIn the above discussion we tacitly assumed that the trajectory is such that M 2 ≈\n\nm2Pl ≫ Λ̄; otherwise no classical regime would exist.\n\nUeff\n\n2\nlPl\n\n\u008f\u008f2\nΦ0\n\nΦ2\n\nFigure 1: The effective potential for the Type IIIa trajectory discussed in the text. The\ndashed line represents the potential Uclass with the same values of Ḡ and Λ̄, but all\nquantum effects neglected.\n\nA qualitative sketch of the resulting Ueff is shown in Fig. 1. It is compared there to\nthe classical potential Uclass which would obtain if G and Λ had no k-dependence at all.\nThe crucial difference between the two is the almost constant Ueff at small φ. This regime\nis a pure quantum gravity effect, directly related to the existence of a NGFP. Quantum\nmechanically, but not classically, the universe can be stationary at small values of φ, at\nleast at φ = 0.\nAs a consequence of our assumption Λ̄ ≪ m2Pl , the Ueff = const regime ends at a\np\nradius φ ≈ lPl which is smaller than the classical \"on-shell\" radius φ̄0 = 3/Λ̄. The\n\nactual \"size of the universe\" corresponds to a scale in the classical regime of the RG\ntrajectory therefore.\n\n9\n\n\fIn the region where the quantum effects modify Uclass most strongly the term ∝ φ2\n\nis the dominant one. We can therefore say that the key effect behind the flattening of\nthe potential near the origin is the running of Newton's constant. Its consequence for the\nshape of Ueff can be understood as the result of the \"RG improvement\" [35–46]\n1 2\n1\n1\n2\nφ −→\nφ\n=\nG\nG(k = φ−1 )\ng∗\n\n(2.19)\n\nwith G(k) = g∗ /k 2 , as appropriate near the NGFP.\n\n3\n\nMaking Contact with CDT Simulations\nThe CDT approach [47–50] defines a discrete version of the Wick rotated quantum-\n\ngravitational proper-time propagator\nGEΛ,G\n\n\u0002\n\u0003\ng3 (0), g3 (t) =\n\nZ\n\nDgE e−SE [gE ]\n\n(3.1)\n\nHere SE is the Euclidean Einstein-Hilbert action, and the integration is over all 4-dimensional Euclidean geometries gE of topology S 3 × [0, 1], each with proper-time running from 0\n\nto t, and with prescribed spatial boundary geometries g3 (0) and g3 (t), respectively. In the\n\nsimulations reported in [48], for technical reasons, periodic rather than fixed boundary\nconditions have been used so that the topology of the spacetimes summed over is S 3 × S 1\n\nrather than S 3 × [0, 1]. (Furthermore, the simulations were done at constant 4-volume\n\nV4 rather than constant Λ; the corresponding propagator is related to (3.1) by a Laplace\ntransformation.)\n\nIt is instructive to visualize the typical, statistically representative 4-geometries\ncontributing to the path integral. They are characterized by a function V3 (s), 0 ≤ s ≤ t,\n\nwhere V3 (s) is the 3-volume of the spatial S 3 at proper-time s. If t is large enough,\n\na \"typical universe\" has long epochs with a very small V3 at early and late times (the\n\"stalk\") and in between a region with a large V3 (s), see Fig. 1 of ref. [48].\nIt has been shown [48] that the dynamics of these \"universes\" is well reproduced by\na minisuperspace effective action for rotated Robertson-Walker metrics\nds2 = dt2 + a2 (t) dΩ23\n\n10\n\n(3.2)\n\n\fwhere dΩ23 is the line element of the unit 3-sphere so that V3 (s) ∝ a3 (s). It reads\nZ\n\u0010 da(s) \u00112\n\u0001o\n3σ3 1 t n\nSeff [a] = −\nds − a(s)\n+ V a(s)\n8π G 0\nds\n\n(3.3)\n\nFor large a the potential V is\n1\nV (a) = −a + Λa3 ≡ Vcl (a)\n3\n\n(3.4)\n\nThe action (3.3) with (3.4) is, up to an overall minus sign, what one obtains when one\ninserts (3.2) into the Einstein-Hilbert action. (In simulations with fixed V4 the constant\nRt\nΛ is a Lagrange multiplier to be fixed such that 0 ds V3 (s) = V4 .) For small a, the\n\n(−a)-term in (3.4) is to be replaced by a function of V3 whose derivative at a = 0 behaves\nas V3ν , ν ≥ 0. A convenient parametrization, valid for all a, is\n1\nV (a) = 1 − (1 + a3 )1/3 + Λa3\n3\n\n(3.5)\n\nVHaL\n\na\n\nFigure 2: The effective potential V (a) of eq. (3.5) obtained from the Monte Carlo simulations (solid line). The dashed line shows the potential Vcl (a) from the classical EinsteinHilbert action. (From Loll et al. [48])\n\nThis potential is sketched in Fig. 2 and compared to Vcl (a). While the latter has a\nnegative slope at the origin, Vcl′ (0) = −1, the potential (3.5) with the corrected small-a\n\n11\n\n\fbehavior has vanishing derivative there: V ′ (0) = 0. This quantum induced modification\nis important since (3.5) allows for a classically stable solution a(t) = 0 which explains the\nstalk observed in the computer simulations [48].\nTo summarize: According to the Monte Carlo simulations, the effective potential\nof the Robertson-Walker scale factor agrees with the classical one for large a, but differs\nfrom Vcl at small a in a characteristic way: V (a) becomes essentially constant (zero) for\na → 0. In the parametrization (3.5) the classical V (a) ≈ −a ist turned into V (a) ≈ − 31 a3\n\nby the quantum effects, which amounts to an almost flat a-dependence for a ≪ 1.\n\nComparing Figs. 1 and 2 makes it obvious that in both cases the dominant quantum\n\ngravity effects have an analogous impact on the effective potentials Ueff (φ) and V (a),\nrespectively: Their slope at the origin , while strictly negative classically, vanishes thanks\nto the quantum effects, and for small φ, or a, the potential is essentially flat, rendering a\nstate with a = 0 or φ = 0 stationary.\nIt is plausible to assume that we are dealing with the same phenomenon in both\nRt\ncases. In fact, upon introducing the conformal time η(t) = dt′ /a(t′ ) the line element\n(3.2) assumes a form analogous to (2.3),\n\n\u0002\n\u0003\nds2 = φ(η)2 dη 2 + dΩ23\n\n(3.6)\n\nwith the conformal factor φ(η) ≡ a(t(η)). Since φ and a differ only by a time reparametriza-\n\ntion, which is irrelevant here, the potentials Ueff (φ) and V (a) are almost the same object.\n\nIn particular we defined Ueff (φ) in terms of a functional integral (or the corresponding flow\nequation) which does not include the conformal zero mode, i. e. fluctuations which merely\nchange the radius of the S 4 . Likewise its CDT counterpart V (a) results from integrating\nout all modes other than the spatially constant global scale.\nThus we see that within QEG the non-Gaussian fixed point predicts a vanishing slope\nof Ueff at φ = 0, and upon identifying Ueff with V (a) this feature is actually observed in\nthe CDT simulations: They all generate universes with a \"stalk\", and according to the\nanalysis in [48] this stalk owes its existence to the vanishing derivative of V (a) at a = 0.\nIn a certain sense, the stalk seems to realize the \"exotic\" phase of gravity when the\nmetric has zero expectation value and the group of diffeomorphisms is not broken by the\n\n12\n\n\fgroundstate (see also section 6 of [22]).\nAnother minor difference between the QEG and CDT setting, respectively, is that\nĝμν is a metric on S 4 , while dη 2 + dΩ23 refers to S 3 × [0, 1] or S 3 × S 1 . However, we do\n\nnot expect such global issues to cause qualitative changes for small conformal factors3 .\n\n(It is also interesting that with the stalk removed the computer-generated universes [50]\nare almost perfect 4-spheres S 4 .)\n\n4\n\nSummary\nWe discussed the effective potential of the conformal factor both from a QEG and a\n\nCDT perspective. We demonstrated that if QEG is asymptotically safe then it gives rise\nto a potential which becomes flat for φ → 0, allowing for a phase of gravity with vanishing\nmetric expectation value. The argument assumes the existence of an underlying UV fixed\n\npoint, but is exact otherwise. We argued that the potential V (a) \"measured\" in Monte\nCarlo simulations within the CDT approach does indeed reflect the predicted behavior\nat small scale (or conformal) factors. It is therefore plausible to assume that already the\npresently available CDT simulations, indirectly, have seen evidence for the same NGFP\nthat has been found in QEG by truncated flow equations. This hints at the possibility\nthat QEG and CDT might be related at a deeper level.\n\nAcknowledgement: M.R. would like to thank J. Ambjørn, H. Hamber, R. Loll, and\nR. Williams for helpful discussions.\n\n3\n\nThe motivation for taking ĝμν to be a S 4 metric in Section 2 is that only in the case of maximal\n\nsymmetry it is easy to identify the decoupling scale in terms of geometric data.\n\n13\n\n\fReferences\n[1] For a general introduction see C. Kiefer, Quantum Gravity, Second Edition,\nOxford Science Publications, Oxford (2007).\n[2] A. Ashtekar, Lectures on non-perturbative canonical gravity,\nWorld Scientific, Singapore (1991);\nA. Ashtekar and J. Lewandowski, Class. Quant. Grav. 21 (2004) R53.\n[3] C. Rovelli, Quantum Gravity, Cambridge University Press, Cambridge (2004).\n[4] Th. Thiemann, Modern Canonical Quantum General Relativity,\nCambridge University Press, Cambridge (2007).\n[5] S. Weinberg in General Relativity, an Einstein Centenary Survey,\nS.W. Hawking and W. Israel (Eds.), Cambridge University Press (1979);\nS. Weinberg, hep-th/9702027.\n[6] M. Reuter, Phys. Rev. D 57 (1998) 971 and hep-th/9605030.\n[7] D. Dou and R. Percacci, Class. Quant. Grav. 15 (1998) 3449.\n[8] O. Lauscher and M. Reuter, Phys. Rev. D 65 (2002) 025013 and hep-th/0108040.\n[9] M. Reuter and F. Saueressig, Phys. Rev. D 65 (2002) 065016 and hep-th/0110054.\n[10] O. Lauscher and M. Reuter, Phys. Rev. D 66 (2002) 025026 and hep-th/0205062.\n[11] O. Lauscher and M. Reuter, Class. Quant. Grav. 19 (2002) 483 and hep-th/0110021.\n[12] O. Lauscher and M. Reuter, Int. J. Mod. Phys. A 17 (2002) 993 and hep-th/0112089.\n[13] W. Souma, Prog. Theor. Phys. 102 (1999) 181.\n[14] M. Reuter and F. Saueressig, Phys. Rev. D 66 (2002) 125001 and hep-th/0206145;\nFortschr. Phys. 52 (2004) 650 and hep-th/0311056.\n[15] A. Bonanno and M. Reuter, JHEP 02 (2005) 035 and hep-th/0410191.\n\n14\n\n\f[16] For reviews on QEG see: M. Reuter and F. Saueressig, arXiv:0708.1317 [hep-th];\nO. Lauscher and M. Reuter in Quantum Gravity, B. Fauser,\nJ. Tolksdorf and E. Zeidler (Eds.), Birkhäuser, Basel (2007) and hep-th/0511260;\nO. Lauscher and M. Reuter in Approaches to Fundamental Physics,\nI.-O. Stamatescu and E. Seiler (Eds.), Springer, Berlin (2007).\n[17] R. Percacci and D. Perini, Phys. Rev. D 67 (2003) 081503;\nPhys. Rev. D 68 (2003) 044018; Class. Quant. Grav. 21 (2004) 5035.\n[18] A. Codello and R. Percacci, Phys. Rev. Lett. 97 (2006) 221301;\nA. Codello, R. Percacci and C. Rahmede, Int. J. Mod. Phys. A23 (2008) 143;\npreprint arXiv:0805.2909 [hep-th].\n[19] D. Litim, Phys. Rev. Lett. 92 (2004) 201301; AIP Conf. Proc. 841 (2006) 322;\nP. Fischer and D. Litim, Phys. Lett. B 638 (2006) 497;\nAIP Conf. Proc. 861 (2006) 336.\n[20] P. Machado and F. Saueressig, preprint arXiv:0712.0445 [hep-th].\n[21] M. Reuter and H. Weyer, preprint arXiv:0801.3287 [hep-th].\n[22] M. Reuter and H. Weyer, preprint arXiv:0804.1475 [hep-th].\n[23] O. Lauscher and M. Reuter, JHEP 10 (2005) 050 and hep-th/0508202.\n[24] M. Reuter and J.-M. Schwindt, JHEP 01 (2006) 070 and hep-th/0511021.\n[25] M. Reuter and J.-M. Schwindt, JHEP 01 (2007) 049 and hep-th/0611294.\n[26] F. Neugebohrn, arXiv:0704.3205 [hep-th].\n[27] P. Forgács and M. Niedermaier, hep-th/0207028;\nM. Niedermaier, JHEP 12 (2002) 066; Nucl. Phys. B 673 (2003) 131;\nClass. Quant. Grav. 24 (2007) R171.\n\n15\n\n\f[28] For detailed reviews of asymptotic safety in gravity see:\nM. Niedermaier and M. Reuter, Living Reviews in Relativity 9 (2006) 5;\nR. Percacci, arXiv:0709.3851 [hep-th].\n[29] C. Wetterich, Phys. Lett. B 301 (1993) 90.\n[30] M. Reuter and C. Wetterich,\nNucl. Phys. B 417 (1994) 181, Nucl. Phys. B 427 (1994) 291,\nNucl. Phys. B 391 (1993) 147, Nucl. Phys. B 408 (1993) 91;\nM. Reuter, Phys. Rev. D 53 (1996) 4430, Mod. Phys. Lett. A 12 (1997) 2777.\n[31] J. Berges, N. Tetradis and C. Wetterich, Phys. Rep. 363 (2002) 223;\nC. Wetterich, Int. J. Mod. Phys. A 16 (2001) 1951.\n[32] For reviews of the effective average action in Yang–Mills theory see:\nM. Reuter, hep-th/9602012; J. Pawlowski, hep-th/0512261; H. Gies, hep-ph/0611146.\n[33] H.W. Hamber, Phys. Rev. D 45 (1992) 507;\nPhys. Rev. D 61 (2000) 124008; arXiv:0704.2895 [hep-th];\nT. Regge and R.M. Williams, J. Math. Phys. 41 (2000) 3964 and gr-qc/0012035.\n[34] R.S. Palais, Comm. Math. Phys. 69 (1979) 19.\n[35] A. Bonanno and M. Reuter, Phys. Rev. D 62 (2000) 043008 and hep-th/0002196;\nPhys. Rev. D 73 (2006) 083005 and hep-th/0602159;\nPhys. Rev. D 60 (1999) 084011 and gr-qc/9811026.\n[36] M. Reuter and E. Tuiran, hep-th/0612037.\n[37] A. Bonanno and M. Reuter, Phys. Rev. D 65 (2002) 043508 and hep-th/0106133.\n[38] M. Reuter and F. Saueressig, JCAP 09 (2005) 012 and hep-th/0507167.\n[39] A. Bonanno and M. Reuter, Phys. Lett. B 527 (2002) 9 and astro-ph/0106468;\nInt. J. Mod. Phys. D 13 (2004) 107 and astro-ph/0210472;\n\n16\n\n\fE. Bentivegna, A. Bonanno and M. Reuter,\nJCAP 01 (2004) 001 and astro-ph/0303150.\n[40] A. Bonanno and M. Reuter, JCAP 08 (2007) 024 and arXiv:0706.0174 [hep-th].\n[41] A. Bonanno, G. Esposito and C. Rubano, Gen. Rel. Grav. 35 (2003) 1899;\nClass. Quant. Grav. 21 (2004) 5005;\nA. Bonanno, G. Esposito, C. Rubano and P. Scudellaro,\nClass. Quant. Grav. 23 (2006) 3103 and 24 (2007) 1443.\n[42] M. Reuter and H. Weyer, Phys. Rev. D 69 (2004) 104022 and hep-th/0311196.\n[43] M. Reuter and H. Weyer, Phys. Rev. D 70 (2004) 124028 and hep-th/0410117.\n[44] M. Reuter and H. Weyer, JCAP 12 (2004) 001 and hep-th/0410119.\n[45] F. Girelli, S. Liberati, R. Percacci and C. Rahmede,\nClass. Quant. Grav. 24 (2007) 3995.\n[46] J. Moffat, JCAP 05 (2005) 2003;\nJ.R. Brownstein and J. Moffat, Astrophys. J. 636 (2006) 721;\nMon. Not. Roy. Astron. Soc. 367 (2006) 527.\n[47] J. Ambjørn, J. Jurkiewicz and R. Loll, Phys. Rev. Lett. 93 (2004) 131301.\n[48] J. Ambjørn, J. Jurkiewicz and R. Loll, Phys. Lett. B 607 (2005) 205.\n[49] J. Ambjørn, J. Jurkiewicz and R. Loll, Phys. Rev. Lett. 95 (2005) 171301;\nPhys. Rev. D 72 (2005) 064014; Contemp. Phys. 47 (2006) 103.\n[50] J. Ambjørn, A. Görlich, J. Jurkiewicz and R. Loll, Phys. Rev. Lett. 100 (2008)\n091304.\n\n17\n\n\f"}