{"id": "http://arxiv.org/abs/1012.1060v1", "guidislink": true, "updated": "2010-12-06T00:49:03Z", "updated_parsed": [2010, 12, 6, 0, 49, 3, 0, 340, 0], "published": "2010-12-06T00:49:03Z", "published_parsed": [2010, 12, 6, 0, 49, 3, 0, 340, 0], "title": "A diagrammatic expansion of the Casimir energy in multiple reflections:\n  theory and applications", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1012.3783%2C1012.4509%2C1012.0637%2C1012.3530%2C1012.4028%2C1012.5650%2C1012.5675%2C1012.0826%2C1012.1776%2C1012.5874%2C1012.4200%2C1012.0254%2C1012.1750%2C1012.5496%2C1012.4303%2C1012.0820%2C1012.2104%2C1012.2618%2C1012.3572%2C1012.4703%2C1012.5664%2C1012.1273%2C1012.0939%2C1012.2807%2C1012.3123%2C1012.1215%2C1012.0045%2C1012.3967%2C1012.3115%2C1012.2967%2C1012.2557%2C1012.5463%2C1012.5730%2C1012.3609%2C1012.0331%2C1012.4751%2C1012.1037%2C1012.1180%2C1012.5292%2C1012.1205%2C1012.1849%2C1012.0072%2C1012.0423%2C1012.1583%2C1012.5793%2C1012.4891%2C1012.1554%2C1012.1811%2C1012.4938%2C1012.2941%2C1012.4184%2C1012.1919%2C1012.5738%2C1012.5296%2C1012.5554%2C1012.4941%2C1012.5234%2C1012.0510%2C1012.4563%2C1012.3358%2C1012.4347%2C1012.1060%2C1012.0476%2C1012.0704%2C1012.2593%2C1012.3388%2C1012.5152%2C1012.0425%2C1012.0153%2C1012.5356%2C1012.2024%2C1012.3759%2C1012.0833%2C1012.2384%2C1012.5169%2C1012.5847%2C1012.4893%2C1012.0450%2C1012.3412%2C1012.5586%2C1012.3885%2C1012.2909%2C1012.3535%2C1012.4031%2C1012.5257%2C1012.4913%2C1012.1341%2C1012.0418%2C1012.0422%2C1012.2577%2C1012.2683%2C1012.5806%2C1012.2362%2C1012.5317%2C1012.3789%2C1012.2153%2C1012.3334%2C1012.3602%2C1012.1582%2C1012.0935%2C1012.2657&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "A diagrammatic expansion of the Casimir energy in multiple reflections:\n  theory and applications"}, "summary": "We develop a diagrammatic representation of the Casimir energy of a multibody\nconfiguration. The diagrams represent multiple reflections between the objects\nand can be organized by a few simple rules. The lowest-order diagrams (or\nreflections) give the main contribution to the Casimir interaction which proves\nthe usefulness of this expansion. Among some applications of this, we find\nanalytical formulae describing the interaction between \"edges\", i.e.\nsemi-infinite plates, where we also give a first example of blocking in the\ncontext of the Casimir energy. We also find the interaction of edges with a\nneedle and describe analytically a recent model of the repulsion due to the\nCasimir interaction.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1012.3783%2C1012.4509%2C1012.0637%2C1012.3530%2C1012.4028%2C1012.5650%2C1012.5675%2C1012.0826%2C1012.1776%2C1012.5874%2C1012.4200%2C1012.0254%2C1012.1750%2C1012.5496%2C1012.4303%2C1012.0820%2C1012.2104%2C1012.2618%2C1012.3572%2C1012.4703%2C1012.5664%2C1012.1273%2C1012.0939%2C1012.2807%2C1012.3123%2C1012.1215%2C1012.0045%2C1012.3967%2C1012.3115%2C1012.2967%2C1012.2557%2C1012.5463%2C1012.5730%2C1012.3609%2C1012.0331%2C1012.4751%2C1012.1037%2C1012.1180%2C1012.5292%2C1012.1205%2C1012.1849%2C1012.0072%2C1012.0423%2C1012.1583%2C1012.5793%2C1012.4891%2C1012.1554%2C1012.1811%2C1012.4938%2C1012.2941%2C1012.4184%2C1012.1919%2C1012.5738%2C1012.5296%2C1012.5554%2C1012.4941%2C1012.5234%2C1012.0510%2C1012.4563%2C1012.3358%2C1012.4347%2C1012.1060%2C1012.0476%2C1012.0704%2C1012.2593%2C1012.3388%2C1012.5152%2C1012.0425%2C1012.0153%2C1012.5356%2C1012.2024%2C1012.3759%2C1012.0833%2C1012.2384%2C1012.5169%2C1012.5847%2C1012.4893%2C1012.0450%2C1012.3412%2C1012.5586%2C1012.3885%2C1012.2909%2C1012.3535%2C1012.4031%2C1012.5257%2C1012.4913%2C1012.1341%2C1012.0418%2C1012.0422%2C1012.2577%2C1012.2683%2C1012.5806%2C1012.2362%2C1012.5317%2C1012.3789%2C1012.2153%2C1012.3334%2C1012.3602%2C1012.1582%2C1012.0935%2C1012.2657&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We develop a diagrammatic representation of the Casimir energy of a multibody\nconfiguration. The diagrams represent multiple reflections between the objects\nand can be organized by a few simple rules. The lowest-order diagrams (or\nreflections) give the main contribution to the Casimir interaction which proves\nthe usefulness of this expansion. Among some applications of this, we find\nanalytical formulae describing the interaction between \"edges\", i.e.\nsemi-infinite plates, where we also give a first example of blocking in the\ncontext of the Casimir energy. We also find the interaction of edges with a\nneedle and describe analytically a recent model of the repulsion due to the\nCasimir interaction."}, "authors": ["Mohammad F. Maghrebi"], "author_detail": {"name": "Mohammad F. Maghrebi"}, "author": "Mohammad F. Maghrebi", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevD.83.045004", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1012.1060v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1012.1060v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "quant-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "quant-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "cond-mat.stat-mech", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "hep-th", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1012.1060v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1012.1060v1", "arxiv_comment": null, "journal_reference": "Phys.Rev.D83:045004,2011", "doi": "10.1103/PhysRevD.83.045004", "fulltext": "A diagrammatic expansion of the Casimir energy in multiple reflections: theory and\napplications\nMohammad F. Maghrebi\n\narXiv:1012.1060v1 [quant-ph] 6 Dec 2010\n\nCenter for Theoretical Physics, and Department of Physics,\nMassachusetts Institute of Technology, Cambridge, MA 02139, USA\nWe develop a diagrammatic representation of the Casimir energy of a multibody configuration.\nThe diagrams represent multiple reflections between the objects and can be organized by a few\nsimple rules. The lowest-order diagrams (or reflections) give the main contribution to the Casimir\ninteraction which proves the usefulness of this expansion. Among some applications of this, we find\nanalytical formulae describing the interaction between \"edges\", i.e. semi-infinite plates, where we\nalso give a first example of blocking in the context of the Casimir energy. We also find the interaction\nof edges with a needle and describe analytically a recent model of the repulsion due to the Casimir\ninteraction.\n\nI.\n\nIntroduction\n\nIn 1948, Casimir predicted an attractive force between metal plates arising from quantum fluctuations [1]. The\nadvent of experimental measurements of Casimir forces has stimulated a large interest in this field [2–4]. There have\nbeen extensive studies of the Casimir force both analytically [5–8] and numerically [9–11]. Specifically, a multipole\nscattering method has been developed and used to compute this force between multiple objects of various shapes\nand electromagnetic properties [7, 12]. This formalism allows one to compute the Casimir interaction in a multiple\nscattering scheme based on the scattering matrix of each object. The conceptual foundations of this approach can be\ntraced back to earlier multiple scattering formalisms [13, 14].\nWithin this formalism, we should compute the logarithm of the determinant (the ln det formula) of a certain matrix\nin order to compute the energy [6, 7]. This can be expanded in a series of multiple reflections. This is a particularly\nuseful expansion in the Casimir-Polder limit for small-sized objects. In this limit, the first reflection gives the leading\norder contribution while higher reflections (and partial waves) are suppressed by higher powers of the objects' length\nscale divided by the separation distance. It is not immediately clear that this would be a useful, or even sensible,\nexpansion for a more general configuration far from this limit. However, a recent work [15] on the Casimir force\nbetween non-compact objects (cones, wedges and plates) necessitated the use of such expansion: in this application\nthe partial waves are labeled by a continuous set of quantum numbers and thus it is not convenient to use the\nln det formula, which involves the determinant of a continuously labeled matrix, in its general form. The multiple\nreflections captures the ln det formula as a sum over the trace of certain operators which is well-defined for continuous\nindices. Remarkably, this expansion enjoys a rapid convergence in the number of multiple reflections regardless of any\ngeometrical limit. This observation has motivated this work in which we elaborate in detail on the derivation and\napplications of multiple-reflection expansion for multibody configurations.\nThis paper is organized as follows. In Sec. II, we derive a diagrammatic expansion of the multibody Casimir\ninteraction which is shown to be organized by a few simple rules. The convergence behavior of this expansion is\ndiscussed in Sec. III. Finally in Sec. IV, we propose some applications. As an example, we consider the interaction\nbetween edges and find very accurate analytical formulae in Sec. IV A. We study the interaction between edges and\na needle in Sec. IV B where we again find explicit analytical formulae. This is used to describe a repulsive Casimir\ninteraction for a specific configuration of the edges and the needle.\n\nII.\n\nMultiple reflections: derivation and discussion\n\nThe Casimir interaction energy between two objects can be computed by using functional integral methods. In this\napproach, the interaction can be described by charge and current multipoles which exist on each object, and are later\nintegrated out to obtain an expression for the energy only in terms of the scattering properties of the objects. For\nexample, for two objects [6, 7]\nZ\n~c ∞\nE=\ndκ tr ln (I − T1 U12 T2 U21 ) ,\n(1)\n2π 0\nwhere we replaced the logarithm of the determinant (ln det) by the trace of the logarithm (tr ln) for the sake of\nconvenience in the following discussion. Here T1 and T2 are the scattering matrices or the T -matrices which encode all\n\n\f2\nproperties of the objects including their shape (and their electromagnetic properties in the case of electrodynamics).\nThe matrices U12 and U21 are the translation matrices which capture the appropriate translations and rotations\nbetween the scattering bases for each object. Equation (1) in this form is exact and can be used to compute the\nCasimir forces between any two objects. However, as outlined in the Introduction, there are cases where we have to\nexpand the trln formula as a power series in N = T1 U12 T2 U21\n\u0012\n\u0013\nZ\n1\n~c ∞\n1\ndκ trN + trN 2 + trN 3 + * * * .\nE =−\n(2)\n2π 0\n2\n3\nThis finds a simple interpretation by noting that each term includes one more reflection (back and forth) between\nthe two objects. Diagrammatically this can be represented as in Fig. 1. The number in front of each diagram is the\ncoefficient of this term in expanding the logarithm. This expansion has been used to obtain analytical formulae for\n1\n\n1\n\n1 2\n2\n\n1\n3 1\n\n2\n\n2\n\n1\n\n2\n\n...\n\n2\n\n1\n\n1\n\n2\n\nFigure 1: Diagrammatic expansion of the Casimir energy for two objects. The vertices label the objects and the links represent\nthe translation matrices between them. A diagram with n insertions of 1 and 2 comes with a factor of 1/n. The dots represent\nhigher order diagrams.\n\nthe interaction of wedges and cones with plates [15]. Indeed the rapid convergence required only the computation of\nthe lowest few reflections. We study the convergence in a variety of cases in the next sections, but in the following\ndiscussion we focus on the derivation of multiple-reflection expansion in general. In principle, for three or more objects,\nwe can find a tr ln expression which involves the scattering matrices of all objects but in a somewhat complicated\nform. An expression for the Casimir energy for three objects, for example, is given in Eq. (III.27) of Ref. [7]. For\nmore objects, the expression for the energy will be increasingly more complicated.\nNevertheless, the tr ln formula can be expanded and organized in multiple reflections. For three objects, for example,\nthe first few diagrams are listed in Fig 2.\n1\n\n2\n\n2\n\n3\n\n3\n\n2\n\n...\n\n3\n\n1\n\n1 2\n2\n\n2\n\n...\n\n2\n\n2\n\n1\n2\n\n1\n\n***\n\n2\n1\n\n3\n\n1\n3\n\n2\n\n1\n\n3\n\n3\n\n2\n\n1\n\n1\n2 2\n\n2\n\n1\n\n3\n\n1\n\n2\n\n1\n\n3\n\n1\n\n1\n\n1\n3\n\n1\n\n1\n\n1\n2\n\n2\n\n3\n1\n\n3\n\n1\n\n3\n1\n\n2\n2\n\n2\n\n...\n\n2\n\n3\n\n***\n\n2\n\n3\n1\n\n***\n\n3\n\nFigure 2: Diagrammatic expansions of the Casimir energy for three objects. The dots represent either a permutation of the\nobjects in the same diagrams or higher-order reflections. Each diagram is accompanied with a numerical factor (1 if not stated\nexplicitly). The diagrams are listed in the order of the number of reflections. The diagrams [321] and [231], for example,\nare not identical, so they are both included while [3121] is identical to [2131] (after a cyclic transformation) and is therefore\nomitted. Furthermore the loop in [2131] can be run either way without changing the diagram (up to cyclic permutations), thus\nthe corresponding diagram does not have an arrow.\n\nOne can see that the diagrammatic expansion is organized by a few simple rules. First we state the rules for the\nCasimir interaction of an arbitrary number of objects. Later in this section we derive these rules systematically.\nLet us suppose that there are M objects which are separated from each other in the vacuum. Each diagram forms\na closed loop which consists of a certain number of insertions of the objects, and these are drawn by the wavy lines.\nThe links between the objects denote the translation matrix. We are interested in the interaction of multiple objects,\nso we ignore the diagrams with a single insertion of the T -matrix. To define our set of rules, we introduce a more\n\n\f3\nabstract notation. Consider a diagram with N insertions of the objects: we designate the objects by i1 , i2 , . . . , iN\nin the order that they appear in the diagram and represent the latter by [iN . . . i2 i1 ]. Since the diagrams are closed\nloops, they have cyclic symmetry. So, for example, [iN . . . i2 i1 ] and [iN −1 . . . i1 iN ] are identical. Note that the order\nthat the objects are listed is important. In general [iN iN −1 . . . i1 ] is different from [i1 i2 . . . iN ]. The multiple-reflection\nexpansion is organized by the following rules:\n1. Only different objects are connected by a link; an object index is not succeeded by the same index. So, for a\ndiagram defined by [iN . . . i2 i1 ], ik 6= ik+1 where N + 1 is identified with 1.\n2.\nA diagram defined by [iN . . . i2 i1 ] is symmetric if it is identical to [i1 i2 . . . iN ] up to a cyclic transformation.\nThe diagrams which are symmetric in both directions (of the loops) do not have an arrow and appear only once while\nthose which are not, appear in pairs of opposite directions.\n3. Let us define a subdiagram as a subset of the diagram which is interconnected. A diagram which is made from\nn copies of the same subdiagram comes with a combinatoric factor of 1/n. For example, a diagram represented by\n[i2 i1 i2 i1 . . . i2 i1 ] with n copies of i2 i1 should be multiplied by 1/n.\nIn short, a diagram defined by [iN . . . i2 i1 ] corresponds to the following term in the expansion of the energy\nZ\n\u0001\n~c\nE[iN ...i2 i1 ] = −\nS[iN ...i2 i1 ] dκ tr Ui1 iN TiN UiN iN −1 . . . Ti2 Ui2 i1 Ti1 ,\n2π\n\n(3)\n\nwhere the T and U represent the scattering and translation matrices respectively. The constant S is the symmetry\nfactor of the corresponding diagram and is determined by Rule 3.\nThese can be proved in general. We start from the partition function whose logarithm is proportional to the\nenergy1 . Using path-integral techniques, it is possible to express the partition function as a functional integral over\ncharge-current multipoles, Qα . This has been done in great detail in Ref. [7]. The translational invariance in time\nallows one to express the partition function as a product of all frequencies, κ,2\n\n\nN Z ∞\n κt X\n\nY Y\nX\nκ t0\n0\nZ=\n[DQα DQ∗α ] exp −\nQ∗α [Tα ]−1 Qα +\nQ∗α Uαβ Qβ .\n(4)\n 2 ~ α\n\n2 ~\nκ>0 α=1 0\nα6=β\n\nwhere it is evaluated in a time interval t0 . Note that Tα is the scattering matrix of the object α and Uαβ is the\ntranslation between the objects α and β. When integrated over the multipoles, the logarithm of the last equation\ngives the tr ln formula (up to a normalization factor). Instead of performing the functional integral, we will proceed\nas follows. The action (or the exponent of the integrand of the functional integral) defines a natural set of Feynman\nrules -by which we can organize the diagrammatic structure of the Casimir energy.\nHeretofore, we consider the T -matrices to represent the vertices in the diagrams as they naturally describe the\ninteraction (of the electromagnetic waves) with the objects. Similarly, the translation matrices are represented by\nthe links or the propagators which connect separate objects. For the sake of derivation of the diagrammatic rules,\nwe consider a different set of conventions in the following discussion. In the rest of this paper, we use the same\nconventions as we defined earlier.\n\n1\n\nα\n\n3\n\nTα\n\n2\n\n1\nα\n\nβ\n\nU αβ\n\nα 6= β\n\n(a) Feynman propagator and vertex.\n\n3\n(b) A Feynman diagram.\n\nFigure\nFeynman rules for the Casimir energy.\nThe diagram on the right corresponds to the term\nR 3:\n~c\ndκ tr(T3 U31 T1 U13 T3 U32 T2 U21 T1 U13 ) in the expansion of the trln formula.\n− 2π\n\n1\n2\n\nWe set the temperature to zero for convenience. The generalization to finite temperature is straightforward.\nThe exponent, or the action, is always real because the scattering matrix T (iκ) and the translation matrix U (iκ) are Hermitian for\nimaginary frequency.\n\n\f4\nNote that the first term in Eq. (4) is diagonal in the object indices. So, from a mathematical point of view, it is\nnatural to consider it as a Feynman propagator. The propagator is the inverse kernel, hence we must attribute a factor\nof Tα to any propagating line3 . Also, the multipoles are complex, so we must associate a direction -or an arrow- to\nthe propagator. The second term in the exponent only connects the multipoles on separate objects (it is off-diagonal\nin the object indices) and so can be more appropriately considered as an interaction vertex. These rules are depicted\nin Fig. 3(a). A typical diagram made from the latter rules is given in Fig. 3(b).\nThese diagrams are dual to the diagrams in Figs. 1 and 2, i.e., the objects are represented by lines and the\ntranslation matrices by the dashed external lines due to the different choice of conventions. The three rules which\nwere stated earlier follow straightforwardly. Rule 1 follows trivially because the translation matrix is off-diagonal.\nRule 2 holds because there is an arrow on the lines. Therefore the two triangular diagrams in Fig. 2, for example, are\nnot equivalent4 . The same arrow can be drawn on the symmetric diagrams, however, the two directions of the arrow\ngenerate the same diagram and must be counted only once. For these diagrams, the arrow is irrelevant and can be\ndropped. Finally Rule 3 follows because the cyclic symmetry of diagrams requires a symmetry factor of 1/n.\nAfter discussing the convergence of the expansion in the following section, we will give some applications of the\nmultiple-reflection expansion. To show the strength of this method, we consider the interaction of edges among\nthemselves and with dipoles. The analytical results we will find should be of both theoretical and experimental\ninterest.\n\nIII.\n\nConvergence\n\nIn the previous section, we showed that, at least formally, the Casimir energy can be expanded in a series of multiple\nreflections, or diagrams, which can be organized by a few simple rules. In this section, although lacking a general\nproof, we argue that under very generic circumstances the lowest orders of reflections dominate the Casimir energy.\nCasimir computed the force between two perfectly reflecting parallel plates [1]. A simple extension to D spatial\ndimensions generalizes the Casimir force to\nF =−\n\naD ~cA\nζ[D + 1].\ndD+1\n\n(5)\n\nIn this equation, A is the area of the plates, d is their separation distance, ζ(D + 1) is the zeta function and aD is\na constant which depends on the dimensionality. It is instructive to compute the force order by order in multiple\nreflections. The contributing diagrams are given in Fig. 1. The T -matrix for the (perfectly reflecting) plates is\nTM/E (iκ) = ∓1 where κ is the imaginary frequency, and the T -matrix of the magnetic (M) and the electric (E)\npolarizations correspond to the upper and lower signs respectively. One can then easily see that a diagram with n\ninsertions of the plate 1 and n insertions of the plate 2 contributes to the energy by\nFn = −\n\naD ~cA 1\n.\ndD+1 nD+1\n\n(6)\n\nThis result was noted earlier in the application of the optical approximation to parallel plate geometry, where the\n\"reflections\" are literally the specular reflections of ray optics [16]. So the contribution of the higher reflections to the\nforce falls off in a power-law fashion. In three dimensions, the latter converges as 1/n4 . If the plates are dielectric as\nopposed to perfect reflectors, the multiple-reflection expansion of the force converges even more rapidly. Note that\nthe T -matrix of a plate remains diagonal (in the planar wave basis) at finite conductivity. The absolute value of\nthe eigenvalues of the T -matrix can be shown to be less than (or equal to) unity for any dielectric response, i.e.,\n|TM/E (iκ)| ≤ 1 at imaginary frequency. The latter can be used to find a bound on the contribution of the n-th order\ndiagram as expanded in Fig. 1,\nFn ≤\n\n1\nF1 .\nnD+1\n\n(7)\n\nCasimir's computation of perfectly reflecting plates can also be altered by changing the geometry while keeping\nthe perfect reflectivity intact. Let us consider a wedge opposite a plate in three dimensions, which was extensively\n\n3\n4\n\nFactors of κT\ncan be absorbed in the definition of the multipoles Qα and do not play a role here.\n2~\nBy hermiticity of the T -matrices and the translation matrices, one can easily see that the two triangular diagrams are related by complex\nconjugation. The energy is real because it involves the sum of these diagrams.\n\n\f5\nstudied in Ref. [15]. The expansion in multiple reflections is found to be governed approximately by a power law\n1/n4+δ for a positive δ which is a function of the opening angle and the orientation of the wedge. So the convergence\nis more rapid than parallel plates. The perfectly reflecting plate-plate and wedge-plate configurations are both scale\ninvariant, i.e., their only length scale is the separation distance between the two objects. Therefore, the convergence in\nmultiple reflection is not controlled by any dimensionless factor and is purely numerical. Now we consider a geometry\nwhich provides an internal length scale. The interaction of a sphere of radius R with a plate at a distance d in\nthree dimensions can be studied in various regimes. If the separation distance is small (d \u001c R), proximity force\napproximation (PFA) can be used to compute the force [17]. This approximation is based on treating the objects\nlocally as parallel plates and integrating over the surfaces facing each other by using Eq. (5). In the close proximity\nlimit, PFA becomes exact. So by analogy with parallel plates, the convergence is governed by 1/n4 series in the limit\nof small sphere-plate separation. In the opposite limit where the sphere is small (d \u001d R), the energy is dominated\nby the dipole interaction [18]. In fact, the lowest reflection in the leading order of partial waves gives a force which is\nproportional to R3 /d3 . The contribution of the higher reflections is exponentially suppressed: the n-th order diagram\nas expanded in Fig. 1 becomes proportional to (R3 /d3 )n in the leading order of partial waves.\nIn summary, the expansion in multiple reflections appears to converge rapidly: in close proximity (the absence of a\nsmall parameter), the convergence is governed by a power law and is purely numerical whereas in the opposite limit,\nthe convergence is exponential and is controlled by the ratio of the object's length scale divided by the separation\ndistance. Intuitively, the convergence in reflections can be understood as follows. More reflections typically travel\nover a larger optical path. Note that in the n-th reflection, the length of a typical path traveled by the waves\nbetween two parallel plates is `path ∼ 2nd. The force in the n-th reflection is, in fact, proportional to the 1/`4path\n(see Eq. (6)) [16]. In general, the optical path increases for higher reflections. This intuition serves as our guiding\nprinciple in deciding which reflections contribute the most. The Casimir interaction of a multibody configuration can\nbe organized by a similar expansion of multiple reflections as discussed in Sec. II. In various examples that we study\nin the following section, we consider the reflections which correspond to the shortest optical paths and compute the\nCasimir interaction. We confirm the latter criterion by computing the higher orders in reflections and show that their\ncontribution is indeed much smaller than the lowest reflections.\n\nIV.\nA.\n\nApplications\n\nInteraction of edges\n\nIn this section, we consider the interaction between the edges of half plates. In Sec. IV A 1, we find an analytical\nexpression for the interaction of two edges which can be studied in various limits and configurations. In Sec. IV A 2,\nwe consider three half-plates and point to some of its interesting physical behaviors, including the non-monotonic\ndependence of the force on the separation distance. In Sec. IV A 3, we study a first example of blocking in the context\nof the Casimir energy.\n\n1.\n\nTwo half-plates\n\nThis study of the interaction between two semi-infinite plates reproduces same results reported in Ref. [19]. We\nassume that the two half-plates are parallel along their edge and define the angle that they make with the edgeto-edge axis to be φ1 and φ2 (see Fig. 4). The half-plates are separated by a distance D, and their extent along\nthe axis z (perpendicular to Fig. 4) is L \u001d D. The scattering matrix of a half-plate depends only trivially on the\naxial wavevector, the component of the wavevector parallel to the edges which we denote by kz . It depends on the\nwavevector of the incoming plane wave ~k as well as the scattered plane wave ~k 0 . Both the incoming and scattered\nwaves are defined at imaginary frequency κ. The T -matrix is given explicitly in terms of the wavevectors by [15]\n\u0012\n\u0012 0∗\n\u0013\n\u0012 0∗\n\u0013\u0013\n1\na −a\na +a\nD/N\nT ~0 ~ =\n− sec\n∓ sec\n2πδ(kz − kz0 ),\n(8)\nκk ,κk\n2\n2\n2\nwhere a is the angle that the incident\nwave makes with the half-plate while a0 is the angle of the scattered wave,\n\u0010 0plane\n\u0011\n\u0001\nk\ni.e., a = sin−1 kiκx and a = sin−1 iκx . The upper and lower signs correspond to Dirichlet (D) and Neumman (N)\nboundary conditions respectively.\nThe wavenumber is imaginary so the angles are in general complex. Let us choose the line which connects the two\nedges to be the vertical axis. We then define a = iα − φj and a0 = iα0 − φj where j = 1, 2 labels the first or the second\nhalf-plate respectively. Note that iα and iα0 are the (imaginary) angles that the waves make with the vertical axis.\n\n\f6\n\nφ1\n\ny\n\nD\nx\nz\n\nφ2\nFigure 4: The configuration of two half-plates.\n\nThe T -matrix in Eq. (8) was constructed in Ref. [15] to find the interaction of a half-plate and an infinite perfectly\nconducting plate. By incorporating the T -matrices into the translation matrices [12], we can find the Casimir energy\nthrough Eq. (1). Since the indices of the T -matrices are continuous, it is more convenient to expand the trln formula.\nWe compute the Casimir energy in the first reflection (i.e., the first diagram in Fig. 1). An analytical expression can\nbe obtained for Dirichlet, Neumann or electromagnetic boundary conditions\nE D/N = −\n\n\u0001\n~cL \u0010 π\n±\ncos2 φ1 (π − π cos φ1 + gd(iφ1 ) + gd(−iφ1 )) + φ1 → φ2\n128π 3 D2\n2\n\u0011\n\u0001\n8\n+ − 4 cos φ1 cos φ2 + 4 φ1 csc2 φ1 + φ2 csc2 φ2 csc(φ1 + φ2 ) .\n3\n\n(9)\n\nHere gd is the Gudermannian function. Because of the translational symmetry in one direction, the electromagnetic\nCasimir energy is simply the sum of Dirichlet and Neumann results. The range of validity of this expression is all\n|φ1 |, |φ2 | ≤ π/2 but it can be analytically continued to the regime where one of the angles or both exceed π/2.\nThe first reflection computation gives a very good approximation to the exact result. This has been studied in some\ndetail in Ref. [19] for various limits and configurations.\n\n2.\n\nThree half-plates\n\nIn this section, we study a three-body interaction; specifically a configuration of three half-plates. We will demon-\n\n3\n\n1\n\nh\n2d\n\n2\n\nFigure 5: The configuration of three half-plates.\n\nstrate the convergence in multiple reflections and show that to the lowest order in reflections, and for a wide range of\nconfigurations, the sum of the leading diagrams dominates the Casimir energy.\nLet us take two half-plates aligned but extended in opposite directions while keeping the third half-plate perpendicular to them along the axis midway between the two (see Fig. 5). We find the force which is exerted on the vertical\nhalf-plate. Obviously the force goes to zero at large separation distance (large positive h). It also vanishes when the\nvertical half-plate goes far below the other two. The latter is the limit that an infinite-plate is inserted between the\ntwo half-plates in which case the lateral force on the infinite plate vanishes. Given the limits, the force cannot be a\nmonotonic function of h.\nIn order to compute the force, we first construct the T -matrices. However, there are two different channels of the\nT -matrix which come into play. When an incoming wave impinges on the half-plate from one side, the scattered wave\npropagates in two directions, i.e., back to the same side and forward to the opposite side. We call the two channels,\n\n\f7\nthe LL and RL channels for left-to-left and left-to-right scattering5 (see Fig. 6). The LL channel is similar to what we\n\nL\n\nR\nTRL |φinc i\n\nTLL |φinc i\n\n|φinc i\nFigure 6: The left-left and right-left channels of the T -matrix.\n\nconsidered earlier: the incident wave angle is a = iα − (π/2 − \u000f) while the scattered wave angle is a0 = iα0 − (π/2 − \u000f).\nThis is a special case of the setup in Fig. 4 where the axis y makes a right angle with the half-plate and \u000f is a small\npositive number which is essential for the regularity of the solutions. In the RL channel the scattered angle becomes\na0 = −iα0 + (π/2 − \u000f). Putting these in Eq. (8), we find\n\u0013\u0013\n\u0012\n\u0012\n\u0013\n\u0012\n1\nα + α0\nα − α0\nD/N\nTLL α0 ,α =\n+ i\u000f\n2πδ(kz − kz0 ),\n(10)\n∓ sech\n− i csch\n2\n2\n2\nD/N\n\nD/N\n\nTRL α0 ,α = ±TLL α0 ,α .\n\n(11)\n\nInterestingly the two channels are related simply by a sign. It can be shown that this holds for any planar geometries,\ni.e., for any geometry which is part of a flat screen. This, among other applications, is discussed in Ref. [20].\nThe force on the vertical half-plate is plotted in Fig. 7. The solid (blue) curve gives the electromagnetic force which\nis computed in the lowest reflection, i.e., as the sum of the two-body forces between the vertical half-plate and either\nof the two horizontal half-plates (the first two diagrams in Fig. 8). The dotted curve shows the force which is summed\nup to the first few orders shown in Fig. 8 (including the two-body terms). The two dashed curves give the energy in\nthe first reflection for Dirichlet and Neumann boundary conditions. The Neumann result is smaller than Dirichlet by\nnearly one order of magnitude.\n-3\n\n-2\n\n-1\n\n0\n\n1\n\n2\n\n3\n\nh/d\n\n-0.001\n-0.002\n-0.003\n-0.004\n-0.005\n-0.006\n\nF d3\n~cL\nFigure 7: The force on the vertical half-plate as a function of the separation distance. The solid curve represents the\nelectromagnetic force computed by summing the two-body diagrams ([21] and [31]) only. The dots include corrections from\nhigher reflections. The dashed curves represent the force corresponding to the Dirichlet and Neumann boundary conditions.\n\n5\n\nBy symmetry, the RR and RL channels are identical to LL and LR channels, respectively.\n\n\f8\nInterestingly, we see that the maximum of the force happens before the vertical half-plate reaches the axis along\nthe horizontal ones, i.e., the force is not monotonic even when the third half-plate is above the horizontal half-plates.\nIt is clear that the convergence in multiple-reflection expansion is remarkably good for a wide range of the parameter\nh. Note that we have not taken advantage of any geometrical approximation such as the Casimir-Polder limit; nor\nhave we ignored the nonadditivity of the Casimir force by resorting to an approximation like PFA. Nevertheless, we\ncan find the force to quite good accuracy.\n3\n1\n\n2\n\n3\n\n1 1\n2\n\n3\n\n3\n1\n\n2\n3\n\n3\n1\n\n1 2\n2\n\n3\n\n3\n1\n\n2\n3\n\n1\n\n2\n\n2\n\n1\n\n2\n\n2\n\n3\n\n3\n\n3\n\n1\n\n1\n2\n\nFigure 8: The lowest-order diagrams in reflections contributing to the vertical force. The diagrams correspond to the shortest\noptical paths between the objects. The first two diagrams (`path ∼ 2d) dominate the Casimir energy. The rest of these diagrams\n(4d . `path . 6d) give small corrections to the leading order contribution.\n\n3.\n\nBlocking\n\nIn the previous section, we computed the force on the vertical semi-infinite plate. Here, we consider a similar setup\nbut focus on a different physical quantity, namely how the presence of the third object influences the interaction\nbetween the other two. Suppose that the horizontal distances of the half-plates 1 and 2 to the vertical half-plate are\nd1 and d2 respectively. (We set these equal to d later on.) The horizontal force exerted on 1 is F1 = −∂d1 E where\nE is the Casimir interaction energy. Following the line of logic of the previous section, this force can be very well\ndescribed by the lowest order diagrams. However here we are interested in how the force on 1 changes upon changing\nthe position of 2 which we can define by I12 ≡ ∂d2 F1 = −∂d1 ∂d2 E. Note that in the extreme case that the vertical\n3\n3\n\n3\n1\n\n2\n\n+\n\n+\n1\n\n2\n\n(a) Cancelation of the two-body and three-body\ndiagrams.\n\n1\n\n2\n\n1\n2\n3\n\n(b) Cancelation of the (other) three-body diagram\nagainst a fourth-order diagram.\n\nFigure 9: In the extreme limit that the object 3 is an infinite plate, the interaction diagrams cancel each other in pairs. If the\nblocking is partial, the interaction between the objects 1 and 2 is partially screened.\n\nhalf-plate completely blocks the space between 1 and 2, I12 just vanishes. Depending on whether the blocking is\npartial or complete, the interaction is partially or completely screened. We will see that multiple-reflection expansion\nprovides a natural language to better understand this.\nLet us first consider the extreme case where the vertical half-plate is almost completely blocking the way from 1 to\n2. The half-plate can be then regarded as an infinite plate. Indeed, in this limit the total energy is just the sum of the\ninteraction of the infinite plate with either of the two other objects. In the diagrammatic expansion, however, there is\na direct two-body interaction between 1 and 2. But one can see that this diagram is canceled against the three-body\ndiagram which connects the three objects (see Fig. 9(a)): The mathematical expression for these diagrams are given\nby\nZ\n~c ∞\n[21] = −\ndκ tr (U12 T2 U21 T1 ) ,\n(12)\n2π 0\nZ ∞\n~c\n[321] = −\ndκ tr (T1 U12 T2 U23 T3 U31 ) .\n(13)\n2π 0\n\n\f9\nIn the last equation we are concerned with the RL channel of T3 (the T -matrix of the infinite plate). For an infinite\nplate, this is negative unity matrix for both Dirichlet and Neumann boundary conditions\nInfnite\n\n−plate\nTRL\n= −I.\n\n(14)\n\nBy implementing this in Eq. (13) and noting that U13 U32 = U12 , we find that [21] + [321] = 0. The cancelation\nbetween these types of diagrams can be carried out to all orders of the diagrammatic expansion (see Fig. 9).\n3\n1\n\n2\n\n1\n1\n\n2\n\n1\n\n1\n\n2\n2\n3\n\n3\n\n2\n\n2\n2\n\n1\n2\n\n2\n3\n\n3\n\n1\n3\n\n1\n\n1\n3\n\n3\n\n3\n3\n\n1\n\n3\n\n1\n\n1\n1\n\n2\n\n2\n\n2\n\n3\n\n2\n\n3\n\n3\n\n1\n\n3\n\n3\n\n1\n2\n\n3\n\n1\n2\n\n3\n\n3\n\n2\n\n3\n\nFigure 10: The lowest order diagrams in reflections contributing to the interaction between the horizontal half-plates. The\ndiagrams are sorted by the typical optical paths that the waves travel between the objects. The interaction is dominated by\nthe diagrams in the first row. The rest of the diagrams only slightly modify the leading order contribution.\n\nWhen the vertical half-plate is far above the other two, the higher order diagrams do not contribute and thus there\nis no screening. Therefore, it is conceivable that the sum of the diagrams in Fig. 9 gives a first approximation to I12 .\nWe will see that this intuition is qualitatively correct but higher orders must be taken into account to improve the\nquantitative result.\nWe compute the interaction I12 by including all the diagrams shown in Fig. 10. This quantity is plotted in Fig. 11\nas the solid (red) curve. The dashed (black) curve is the resultant interaction when only the diagrams in Fig. 9 are\nincluded. Again we see that the multiple reflections enjoy a rapid convergence.\nThe interaction I12 monotonically decreases as the vertical half-plate further blocks the two objects. Interestingly,\nas it approaches them, the interaction falls off very rapidly. Even before the vertical half-plate reaches the axis along\n\nh/d\n-3\n\n-2\n\n-1\n\n0\n\n1\n\n2\n\n3\n\n-0.0002\n\n-0.0004\n\n-0.0006\n\n-0.0008\n\n-0.0010\n\nI12 d4\n~cL\nFigure 11: The interaction of the two horizontal half-plates as a function of the position of the blocking half-plate. The dashed\ncurve is the resultant force by considering the first few diagrams in the reflection expansion. The solid curve includes the\ncorrection of higher orders in reflections. The blue dashed line represents the constant to which the solid curve approaches as\nh → ∞.\n\n\f10\nthe horizontal half-plates, the interaction is substantially suppressed. After reaching this point, I12 falls off sharply\nto zero. This suggests that the interaction of two objects is greatly affected by whether or not they are visible to each\nother.\n\nB.\n\nInteraction of edges and a needle\n\nIn this section, we study the interaction between edges and a needle. In Sec. IV B 1, we consider an edge and\na needle in two dimensions and find that their interaction exhibits some unusual features. Using these results, in\nSec. IV B 2, we will find analytical results for an example of repulsion which was first proposed in Ref. [21].\n\n1.\n\nEdge vs needle\n\nIn a recent paper [21], a setup was proposed which gives rise to a repulsive Casimir force. This setup consists of\ntwo objects which can be separated by an imaginary plane. A two dimensional model of the repulsion involves a small\nelliptical perfect metal above a (perfect) metal line with a gap (see Fig. 15). The Casimir force is then computed\nbased on 2d electromagnetism.\nAs formulated in the Appendix, the electromagnetism in two dimensions (two spatial dimensions plus time) with\nperfectly-conducting boundary condition is equivalent to a scalar field theory with Neumann boundary condition. We\nexploit this fact to compute the interaction between an edge and a needle (Fig. 12).\nThe interaction can be expanded in multiple reflections as in Fig. 1. The lowest order will suffice because the ellipse\n(needle) is small compared to the separation distance [18]. In order to compute this diagram, we must know scattering\nproperties of these objects. The half-plate's T -matrix is given by Eq. (8). The T -matrix of the ellipse can be described\n(1)\nin the cylindrical coordinates where a natural basis is Hm (kr)eimφ . The scattering matrix is then labeled in this\nbasis, hence Tm,m0 . In the limit of a small ellipse with Neumann boundary condition we need a subset m, m0 ∈ {0, ±1}\nof the scattering matrix. This is further simplified by noting the inversion symmetry of the ellipse which requires\nm + m0 to be even; so m, m0 = 0 is decoupled from m, m0 = ±1. Therefore, the only nonzero components of the\nT -matrix in this subset are T00 and Tm,m0 for m, m0 = ±1. Using parity, the latter components of the T -matrix (with\nm, m0 = ±1) can be written as a superposition of Txx and Tyy where x and y are the symmetry axes of the ellipse.\nFor a small object, we need the T -matrix to be expanded to the lowest order in the wave number κ, in which limit\nthey all depend quadratically on κ, that is T00 ∼ κ2 T00 , Txx ∼ κ2 Txx , Tyy ∼ κ2 Tyy . We leave the T 's as parameters\nwithout specializing to an ellipse -the discussion applies to any geometry with the same symmetry properties as an\nellipse.\nThe T -matrix of the half-line is given in planar basis while that of the needle is defined in the cylindrical basis. We\ncan convert the two bases by\neik.x = e−κr cos(φ−a) =\n\n∞\nX\n\n(−1)m Im (κr)eim(φ−a) ,\n\n(15)\n\nm=−∞\n\nwhere φ and a are the angles of x and k respectively. So the conversion matrix is Da,m = (−1)m e−ima . The T -matrix\nof the needle can be then cast in the planar basis using the conversion matrix and the normalization factors which\nare involved in the definition of these functions [12]\nX\n0\n0 0∗\nTa0 ,a = π\n(−1)m+m eim a −ima Tm,m0 .\n(16)\nm,m0\n\nNow we can put everything together to compute the Casimir interaction energy of a half-line and a needle. The\nobjects are separated by a distance D along the needle-edge axis with respect to which the needle makes an angle\nθ0 and the half-line is tilted at an angle φ0 (see Fig. 12). The energy finds contributions from different components\nof the T -matrix. For each contribution to the Casimir interaction, we can find exact analytical formulae6 . The term\nproportional to T00 is\n\u0012\n\u0013\n~c 1\n4\n3\nE00 ∼ −\nT\n−\n+\ncsc\nφ\n(2φ\n−\nsin(2φ\n))\n.\n(17)\n00\n0\n0\n0\n64π D3\n3\n\n6\n\nHigher orders are suppressed by higher powers of the needle dimension divided by the separation distance.\n\n\f11\n\nθ0\nD\nφ0\nFigure 12: The configuration a needle versus a half-line.\n\nwhere ∼ indicates that this result is exact in the limit of a vanishing needle. It is not surprising that this expression\ndoes not depend on θ0 since the lowest partial wave (which is denoted by 0) does not detect the orientation of the\nneedle. The dependence on the separation distance is obvious for dimensional reasons. The dependence on the tilt\nangle, however, is nontrivial. Interestingly when the half-line is aligned with the axis which connects it to the needle,\nthis term becomes zero-irrespective of the separation distance. We will discuss this in more detail in the next section.\nThe dependence on the orientation of the needle comes through Txx and Tyy and is given by\nExx ≡ Txx f (φ0 , θ0 )\n\u0010 4\n~c 1\n∼−\nTxx − + cos(2θ0 ) (−2 + cot φ0 csc φ0 )\n3\n8π D\n3\n− csc φ0 3 cot φ0 + 2 sin(2θ0 ) + φ0 (−3 + cos(2θ0 + 2φ0 )) csc2 φ0 )\n\n\u0001\u0011\n\n,\n\n(18)\n\nand, by symmetry,\n\u0010\nπ\u0011\nEyy (φ0 , θ0 ) = Tyy f φ0 , θ0 +\n.\n2\n\n(19)\n\nThe sum of these expressions give the interaction of a needle with a half-line. The last equation is a consequence of\nthe symmetries of the problem. Note that these expressions all come with the same dependence on the separation\ndistance; so in principle \u0001they are all important at the leading order. A simple consistency check is that the sum\nf (φ0 , θ0 ) + f φ0 , θ0 + π2 must be independent of the orientation θ0 . That is because it gives the interaction of a\ncircle-as opposed to an ellipse-with the half-line.\nF D4\n~cTyy\n0.7\n0.6\n4\n\nFD\n~cTyy\n\n0.5\n0.4\n\n0.15\n\n0.3\n\n0.10\n\n0.2\n\n0.05\n\n0.1\nθ0\n0\n\nπ/2\n\nπ\n\n(a) The magnitude of the force for φ0 = 0.\nThe force vanishes (at least, in the lowest\nreflection) for θ0 = π/2 at all separation\ndistances.\n\nθ0\n−π\n\n−π/2\n\n0\n\nπ/2\n\nπ\n\n(b) The magnitude of the force for different orientations and\npositions of the needle including φ0 = 0. From bottom to top, the\ncurves represent φ0 = 0, π/8, π/4 and π/2 .\n\nFigure 13: The magnitude of the force as a function of the needle orientation. The force strongly depends on the orientation.\n\nIt is interesting that the complicated interaction of a needle with an edge can be described analytically. The\nnontrivial dependence on the mutual orientation can be studied at different values and limits of the angles. In the\nlimit that φ0 approaches π, the interaction becomes that of an infinite line with a dipole. A closely related problem\nof a dipole opposite an infinite conducting plate has been studied in Ref. [22] in three dimensions. In another limit,\nφ0 = 0, the needle is aligned along the axis of the half-line, in which case the orientation-dependent terms, Exx and\n\n\f12\nEyy , exhibit unusual characteristics as a function of the orientation which will be discussed in more detail below. Note\nthat in the same limit, E00 vanishes.\nHere we assume that the needle is elongated in one direction. Choosing this axis to be y, we can then neglect Exx .\nAlso the contribution from E00 is significantly smaller than the orientation dependent terms; so the total energy is\ngiven by Eyy without any loss of generality. The absolute value of the force (derived from Eqs. (18) and (19)) as a\nfunction of the needle orientation for φ0 = 0 is plotted in Fig. 13(a). The force is symmetric with respect to π/2 as it\nshould be. But it also vanishes at this point. This was first observed in Ref. [21] where it is explained by employing\nan intuitive argument. Figure 13(b) gives the magnitude of the force for a set of different angles. Away from φ0 = 0\nthe force is non-vanishing but it shows a strong dependence on the angle θ0 .\nThe direction of the force also exhibits some interesting features. Let us consider several points all at the same\ndistance from the edge. We show the direction (and the relative magnitude of the force) in a small circle around\neach point (see Fig. 14). An arrow drawn from a point on the circle should be understood as the force on the needle\nwhich is pointed from the center of the circle to that point. The force is normalized within each circle but differently\nfrom other circles. The small needle drawn in each circle is the equilibrium configuration at each point.\n\nFigure 14: The direction (and the normalized magnitude) of the force for φ0 = 0, π/8, π/4, π/2, 3π/4 and π − . See text for\nfurther description.\n\nThis plot illustrates some characteristics of the interaction of an edge with a needle:\n1. There is a strong dependence on the orientation of the needle. Both the magnitude and direction of the force\nvary strongly. In fact, when φ0 = 0 the dipole drags the force direction along with itself (parallel to its orientation).\n2. The vertical component of the force does not always point towards the half-line. For φ0 = π/8, for example, we\ncan see that for a certain range of the orientation θ0 , the (vertical) force points upward. This will be essential to the\nargument in the next section.\n3. The equilibrium configuration (the point of zero torque) strongly depends on φ0 , the relative positioning of the\ntwo objects.\n\n2.\n\nRepulsion\n\nIn this section, we follow the setup in Ref. [21] and consider the interaction between a vertical needle and a line\nwith a gap, or two half-lines (see Fig. 15).\nThe two-body interaction of a half-line with an ellipse was computed in the previous section. Here we also consider\nhigher refections. Because the ellipse is small in size, it will suffice to consider only a single reflection off of it. But\nhigher reflections from the half-lines should be included. The three-body diagram in Fig. 16 is an example. We\nwill find that the latter diagrams are also significantly smaller than the two-body diagrams. This again proves the\nusefulness of the expansion in multiple reflections. Figure 16 summarizes these statements. As a result, we can very\nprecisely describe the interaction as the sum of the two-body diagrams. Using Eqs. (18) and (19), the energy takes\nthe form\n\u0011\ncot3 φ0 \u0010\nE ∼ Tyy\n−\n24φ\n+\n6\nsin(2φ\n)\n+\n5\nsin(3φ\n)\n+\n3\nsin(4φ\n)\n−\n3\nsin(5φ\n)\n(20)\n0\n0\n0\n0\n0 .\n48πd3\n\n\f13\n\n3\n1\n\n2\n\nh\n2d\n\nφ0\n\nFigure 15: The configuration of a needle against a gap.\n\nThis expression is plotted as the bold (blue) curve in Fig. 17 where it has been also compared with the case where\nthe needle was positioned horizontally (red curve). The dashed curve belongs to a circle of the same diameter as the\nneedle and is simply obtained by summing the values of the other two curves. Note that the contribution due to T00\nis smaller by one order magnitude which is why it is neglected. The interesting point about the bold curve, also\n1\n\n2\nLeading order\n\n3\n\n3\n3\n\n3\n\n1 1\n2\n\n1\n1\n\n2\n\n...\n\n3\n\n3\n1\n\n3\n\n1\n1\n\n2\n\n3\n\nHigher-order (parametrically)\n\n2\n\n1\n\n3\n\n...\n\nHigher-order (numerically)\n\n2\n\nFigure 16: Diagrammatic expansion in multiple reflections. The two-body diagrams dominate the interaction. The higherorder diagrams with more than one needle vertex are parametrically smaller. Other higher-order diagrams are numerically\nsmaller due to the rapid convergence in higher reflections.\n\ndiscussed in the previous section, is that it vanishes for h = 0. The energy, however, is always negative so the force\non a vertical needle in the proximity of the gap is actually repulsive. This observation has been used to propose a\nmechanism of obtaining repulsion in Ref. [21]. On the other hand, the force on a horizontally-positioned needle or a\ncircle is never repulsive. These are plotted in Fig. 18. We also include the corrections to the force due to higher order\nreflections. The dots include the first correction from the three-body diagrams which is extremely small compared to\nthe leading order (shown by the solid and dashed curves). Again this shows that a systematic expansion of multiple\nreflections gives a remarkably accurate result.\nThe configuration in Fig. 15 gives rise to repulsion, but it is unstable with respect to the rotations in the plane.\n0.5\n0\n\n1.0\n\n1.5\n\n2.0\n\n2.5\n\n3.0\n\nh/d\n\n-0.02\n-0.04\n-0.06\n-0.08\n-0.10\n-0.12\n\nE d3\n~cTyy\nFigure 17: Casimir interaction energy of the vertical and horizontal needle and the circle with the gap in the leading order of\nmultiple reflections. The bold (blue) curve represents the energy of a vertical needle, the fine (red) curve gives the energy of a\nhorizontal needle and the dashed curve is the energy of a circle opposite the gap.\n\n\f14\n\nF d4\n~cTyy\n0.10\n0.05\n0.5\n\n0\n\n1.0\n\n1.5\n\n2.0\n\n2.5\n\n3.0\n\nh/d\n\n-0.05\n-0.10\n-0.15\nFigure 18: Casimir force on the vertical and horizontal needle and the circle with the gap. They are plotted as the bold (blue),\nfine (red) and the dashed curves respectively. The dots include the correction from higher reflections.\n\nAlso according to the theorem in Ref. [23], it should be unstable with respect to the displacement in the horizontal\ndirection.\n\nV.\n\nConclusions\n\nIn this work, we have developed a multiple-reflection expansion of the Casimir interaction. We have represented\nthe latter in a diagrammatic fashion and derived simple rules to organize and consistently expand it.\nWe have argued that the formal diagrammatic expansion converges rapidly and thus it is sufficient to keep only the\nlowest order diagrams in the number of reflections. We have explicitly shown the latter for various configurations.\nSpecifically, the interaction between edges (of half-plates) among themselves and with a needle has been computed.\nMost notably, we have found an analytical expression describing the interaction of two half-plates in the lowest\nreflection, that should be accurate for practical applications. Three-body interactions of half-plates are considered\nwhere we have taken advantage of the remarkable convergence in multiple reflections. Finally the interaction between\nedges and a needle is studied to find analytical formulae. The results have been used for an analytic treatment of a\nmodel of repulsion which has been proposed recently.\nA more rigorous bound on the convergence of higher order diagrams is still desired for both two-body and multibody\nconfigurations. The expansion in the lowest reflections can be a basis for both numerical and analytical studies of\ncomplex multibody configurations and geometries. The rapid convergence in diagrammatic expansion can lead to a\nremarkable simplification of the intensive computations.\n\nAcknowledgments\n\nThis research was supported by the NSF Grant No. DMR-08-03315, DARPA contract No. S-000354, and the U. S.\nDepartment of Energy (DOE) under cooperative research agreement #DF-FC02-94ER40818. I wish to thank Robert\nL. Jaffe, Mehran Kardar and Matthias Krüger for many valuable discussions. I am specially grateful to Prof. Jaffe\nand Prof. Kardar for a critical reading of the manuscript.\n\nAppendix: Electromagnetism in two dimensions\n\nIn any dimensions, the Maxwell equations can be written in their most general form as a tensor equation\n∂μ F μν = 0,\n\n(21)\n\nwhere F μν is the field strength tensor and μ, ν = 0, 1, 2, ... indicate the space-time coordinates. In two dimensions,\nthis reads\n∂1 F 10 + ∂2 F 20 = 0,\n∂0 F 01 + ∂2 F 21 = 0,\n∂0 F 02 + ∂1 F 12 = 0.\n\n(22)\n\n\f15\nWe can solve these coupled equations by introducing an auxiliary field ψ such that\nF 10 = ∂2 ψ,\nF 20 = −∂1 ψ,\nF 12 = −∂0 ψ.\n\n(23)\n\nThe gauge freedom has been fixed by this set of choices. The electromagnetic lagrangian − 14 Fμν F μν then becomes\nproportional to\n\u0001\n1\n(∂0 ψ)2 − (∇ψ)2 ,\n2\n\n(24)\n\nwhich is the lagrangian of a scalar field.\nThe boundary condition for a perfect conductor can be written in a covariant form too\n\u000fμνρ F μν nρ |Σ = 0 ,\n\n(25)\n\nwhere Σ denotes the surface of the object. In this equation, \u000f is the completely antisymmetric tensor and n is the\nvector normal to the (hyper-)surface of the object. When the auxiliary field is replaced for the field tensor, the last\nequation becomes\n∂n ψ = 0.\n\n(26)\n\nHence, the quantum electrodynamics in two spatial dimensions with perfect conductors as the boundaries is equivalent\nto a quantum scalar field theory with Neumann boundary condition.\n\n[1]\n[2]\n[3]\n[4]\n[5]\n[6]\n[7]\n[8]\n[9]\n[10]\n[11]\n[12]\n[13]\n[14]\n[15]\n[16]\n[17]\n[18]\n[19]\n[20]\n[21]\n[22]\n[23]\n\nH. B. G. Casimir, Proc. K. Ned. Akad. Wet. 51, 793 (1948).\nU. Mohideen and A. Roy, Phys. Rev. Lett. 81, 4549 (1998).\nB. W. Harris, F. Chen, and U. Mohideen, Phys. Rev. A 62, 052109 (2000).\nG. Bressi, G. Carugno, R. Onofrio, and G. Ruoso, Phys. Rev. Lett. 88, 041804 (2002).\nK. A. Milton, The Casimir Effect: Physical Manifestations of Zero-Point Energy, World Scientific, Singapore, 2001.\nO. Kenneth and I. Klich, Phys. Rev. Lett. 97, 160401 (2006).\nT. Emig, N. Graham, R. L. Jaffe, and M. Kardar, Phys. Rev. Lett. 99, 170403 (2007).\nM. Bordag, G. L. Klimchitskaya, U. Mohideen, and V. M. Mostepanenko, Advances in the Casimir effect, Oxford University\nPress, Oxford, 2009.\nH. Gies and K. Klingmüller, Phys. Rev. D 74, 045002 (2006).\nM. T. H. Reid, A. W. Rodriguez, J. White, and S. G. Johnson, Phys. Rev. Lett. 103, 040401 (2009).\nS. Pasquali and A. C. Maggs, J. Chem. Phys. 129, 014703 (2008).\nS. J. Rahi, T. Emig, N. Graham, R. L. Jaffe, and M. Kardar, Phys. Rev. D 80, 085021 (2009).\nR. Balian and B. Duplantier, Ann. Phys. (N.Y.) 104, 300 (1977).\nR. Balian and B. Duplantier, Ann. Phys. (N.Y.) 112, 165 (1978).\nM. F. Maghrebi, S. J. Rahi, T. Emig, N. Graham, R. L. Jaffe, and M. Kardar, preprint [quantph/1010.3223] (2010).\nA. Scardicchio and R. L. Jaffe, Nucl. Phys. B 704, 552 (2005).\nB. V. Derjaguin, I. I. Abrikosova, and E. M. Lifshitz, Q. Rev. Chem. Soc. 10, 295 (1956).\nH. B. G. Casimir and D. Polder, Phys. Rev. 73, 360 (1948).\nM. F. Maghrebi and N. Graham, To be published.\nM. F. Maghrebi, R. Abravanel, and R. L. Jaffe, To be published.\nM. Levin, A. P. McCauley, A. W. Rodriguez, M. T. H. Reid, and S. G. Johnson, Phys. Rev. Lett. 105, 090403 (2010).\nT. Emig, N. Graham, R. L. Jaffe, and M. Kardar, Phys. Rev. A 79, 054901 (2009).\nS. J. Rahi, M. Kardar, and T. Emig, Phys. Rev. Lett. 105, 070404 (2010).\n\n\f"}