{"id": "http://arxiv.org/abs/0707.3954v3", "guidislink": true, "updated": "2007-11-25T13:24:20Z", "updated_parsed": [2007, 11, 25, 13, 24, 20, 6, 329, 0], "published": "2007-07-26T15:41:40Z", "published_parsed": [2007, 7, 26, 15, 41, 40, 3, 207, 0], "title": "Challenging SO(10) SUSY GUTs with family symmetries through FCNC\n  processes", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0707.0368%2C0707.4315%2C0707.0185%2C0707.1842%2C0707.2354%2C0707.4162%2C0707.2457%2C0707.3578%2C0707.0121%2C0707.2558%2C0707.3151%2C0707.0213%2C0707.1864%2C0707.1808%2C0707.1127%2C0707.0011%2C0707.3794%2C0707.2653%2C0707.3339%2C0707.2716%2C0707.1685%2C0707.0774%2C0707.0590%2C0707.4233%2C0707.3438%2C0707.4009%2C0707.3787%2C0707.3994%2C0707.3624%2C0707.4614%2C0707.0349%2C0707.3143%2C0707.0086%2C0707.4486%2C0707.2932%2C0707.0135%2C0707.2757%2C0707.4149%2C0707.2735%2C0707.3345%2C0707.2777%2C0707.0316%2C0707.4348%2C0707.3061%2C0707.2438%2C0707.0206%2C0707.0653%2C0707.2196%2C0707.2060%2C0707.1909%2C0707.1628%2C0707.2919%2C0707.2085%2C0707.2023%2C0707.2814%2C0707.3954%2C0707.4535%2C0707.2322%2C0707.3413%2C0707.0678%2C0707.3902%2C0707.4098%2C0707.3063%2C0707.1246%2C0707.1393%2C0707.0749%2C0707.4264%2C0707.3572%2C0707.3212%2C0707.2906%2C0707.2226%2C0707.4427%2C0707.0983%2C0707.3587%2C0707.3600%2C0707.0346%2C0707.0565%2C0707.3313%2C0707.1129%2C0707.3640%2C0707.1184%2C0707.0290%2C0707.1427%2C0707.4212%2C0707.0156%2C0707.2746%2C0707.4487%2C0707.1493%2C0707.3696%2C0707.2344%2C0707.2294%2C0707.3239%2C0707.2271%2C0707.2029%2C0707.2326%2C0707.1325%2C0707.0915%2C0707.0788%2C0707.0400%2C0707.1356%2C0707.4395&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Challenging SO(10) SUSY GUTs with family symmetries through FCNC\n  processes"}, "summary": "We perform a detailed analysis of the SO(10) SUSY GUT model with D3 family\nsymmetry of Dermisek and Raby (DR). The model is specified in terms of 24\nparameters and predicts, as a function of them, the whole MSSM set of\nparameters at low energy scales. Concerning the SM subset of such parameters,\nthe model is able to give a satisfactory description of the quark and lepton\nmasses, of the PMNS matrix and of the CKM matrix. We perform a global fit to\nthe model, including flavour changing neutral current (FCNC) processes Bs -->\nmu+ mu-, B --> Xs gamma, B --> Xs l+ l- and the B(d,s) - bar B(d,s) mass\ndifferences Delta M(d,s) as well as the flavour changing (FC) process B+ -->\ntau+ nu. These observables provide at present the most sensitive probe of the\nSUSY mass spectrum and couplings predicted by the model. Our analysis\ndemonstrates that the simultaneous description of the FC observables in\nquestion represents a serious challenge for the DR model, unless the masses of\nthe scalars are moved to regions which are problematic from the point of view\nof naturalness and probably beyond the reach of the LHC. We emphasize that this\nproblem could be a general feature of SUSY GUT models with third generation\nYukawa unification and weak-scale minimal flavour violation.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0707.0368%2C0707.4315%2C0707.0185%2C0707.1842%2C0707.2354%2C0707.4162%2C0707.2457%2C0707.3578%2C0707.0121%2C0707.2558%2C0707.3151%2C0707.0213%2C0707.1864%2C0707.1808%2C0707.1127%2C0707.0011%2C0707.3794%2C0707.2653%2C0707.3339%2C0707.2716%2C0707.1685%2C0707.0774%2C0707.0590%2C0707.4233%2C0707.3438%2C0707.4009%2C0707.3787%2C0707.3994%2C0707.3624%2C0707.4614%2C0707.0349%2C0707.3143%2C0707.0086%2C0707.4486%2C0707.2932%2C0707.0135%2C0707.2757%2C0707.4149%2C0707.2735%2C0707.3345%2C0707.2777%2C0707.0316%2C0707.4348%2C0707.3061%2C0707.2438%2C0707.0206%2C0707.0653%2C0707.2196%2C0707.2060%2C0707.1909%2C0707.1628%2C0707.2919%2C0707.2085%2C0707.2023%2C0707.2814%2C0707.3954%2C0707.4535%2C0707.2322%2C0707.3413%2C0707.0678%2C0707.3902%2C0707.4098%2C0707.3063%2C0707.1246%2C0707.1393%2C0707.0749%2C0707.4264%2C0707.3572%2C0707.3212%2C0707.2906%2C0707.2226%2C0707.4427%2C0707.0983%2C0707.3587%2C0707.3600%2C0707.0346%2C0707.0565%2C0707.3313%2C0707.1129%2C0707.3640%2C0707.1184%2C0707.0290%2C0707.1427%2C0707.4212%2C0707.0156%2C0707.2746%2C0707.4487%2C0707.1493%2C0707.3696%2C0707.2344%2C0707.2294%2C0707.3239%2C0707.2271%2C0707.2029%2C0707.2326%2C0707.1325%2C0707.0915%2C0707.0788%2C0707.0400%2C0707.1356%2C0707.4395&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We perform a detailed analysis of the SO(10) SUSY GUT model with D3 family\nsymmetry of Dermisek and Raby (DR). The model is specified in terms of 24\nparameters and predicts, as a function of them, the whole MSSM set of\nparameters at low energy scales. Concerning the SM subset of such parameters,\nthe model is able to give a satisfactory description of the quark and lepton\nmasses, of the PMNS matrix and of the CKM matrix. We perform a global fit to\nthe model, including flavour changing neutral current (FCNC) processes Bs -->\nmu+ mu-, B --> Xs gamma, B --> Xs l+ l- and the B(d,s) - bar B(d,s) mass\ndifferences Delta M(d,s) as well as the flavour changing (FC) process B+ -->\ntau+ nu. These observables provide at present the most sensitive probe of the\nSUSY mass spectrum and couplings predicted by the model. Our analysis\ndemonstrates that the simultaneous description of the FC observables in\nquestion represents a serious challenge for the DR model, unless the masses of\nthe scalars are moved to regions which are problematic from the point of view\nof naturalness and probably beyond the reach of the LHC. We emphasize that this\nproblem could be a general feature of SUSY GUT models with third generation\nYukawa unification and weak-scale minimal flavour violation."}, "authors": ["Michaela E. Albrecht", "Wolfgang Altmannshofer", "Andrzej J. Buras", "Diego Guadagnoli", "David M. Straub"], "author_detail": {"name": "David M. Straub"}, "author": "David M. Straub", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1088/1126-6708/2007/10/055", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0707.3954v3", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0707.3954v3", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "1 + 37 pages, 5 figures, 11 tables. v3: minor typos fixed. Matches\n  JHEP published version", "arxiv_primary_category": {"term": "hep-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "hep-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0707.3954v3", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0707.3954v3", "journal_reference": "JHEP0710:055,2007", "doi": "10.1088/1126-6708/2007/10/055", "fulltext": "arXiv:0707.3954v3 [hep-ph] 25 Nov 2007\n\nPreprint typeset in JHEP style - HYPER VERSION\n\nTUM-HEP-671/07\n\nChallenging SO(10) SUSY GUTs with family\nsymmetries through FCNC processes\n\nMichaela E. Albrecht, Wolfgang Altmannshofer, Andrzej J. Buras, Diego Guadagnoli,\nand David M. Straub\nPhysik-Department, Technische Universität München,\nD-85748 Garching, Germany\n\nAbstract: We perform a detailed analysis of the SO(10) SUSY GUT model with D3 family\nsymmetry of Dermı́šek and Raby (DR). The model is specified in terms of 24 parameters\nand predicts, as a function of them, the whole MSSM set of parameters at low energy scales.\nConcerning the SM subset of such parameters, the model is able to give a satisfactory\ndescription of the quark and lepton masses, of the PMNS matrix and of the CKM matrix.\nWe perform a global fit to the model, including flavour changing neutral current (FCNC)\nprocesses Bs → μ+ μ− , B → Xs γ, B → Xs l+ l− and the Bd,s − B d,s mass differences ∆Md,s\nas well as the flavour changing (FC) process B + → τ + ν. These observables provide at\npresent the most sensitive probe of the SUSY mass spectrum and couplings predicted by the\nmodel. Our analysis demonstrates that the simultaneous description of the FC observables\nin question represents a serious challenge for the DR model, unless the masses of the\nscalars are moved to regions which are problematic from the point of view of naturalness\nand probably beyond the reach of the LHC. We emphasize that this problem could be\na general feature of SUSY GUT models with third generation Yukawa unification and\nweak-scale minimal flavour violation.\nKeywords: GUT, Supersymmetric Standard Model, B-Physics.\n\n\fContents\n1. Introduction\n\n1\n\n2. The model\n\n3\n\n3. Basic procedure\n3.1 Step 1: Parameters of the model\n3.2 Step 2: RG evolution\n\n4\n5\n6\n\n4. One-loop improved determination of low-energy observables\n\n7\n\n5. Basic formulae for FC observables\n5.1 Bs,d → μ+ μ−\n5.2 ∆Ms,d\n5.3 B → Xs γ\n5.4 B → Xs l+ l−\n5.5 B + → τ + ν\n5.6 (g − 2)μ\n\n8\n8\n10\n11\n12\n14\n15\n\n6. General picture\n\n16\n\n7. Numerical analysis\n7.1 Fitting procedure\n7.2 Scenarios\n7.2.1 m16 = 4 TeV, μ > 0\n7.2.2 m16 = 6 TeV, μ > 0\n7.2.3 m16 = 10 TeV, μ > 0\n7.2.4 m16 = 4 TeV, μ < 0\n7.3 Results\n\n17\n17\n21\n21\n22\n22\n22\n23\n\n8. Conclusions\n\n24\n\n1. Introduction\nA well-known problem of supersymmetry (SUSY) at the electroweak (EW) scale is its\nproliferation of parameters, arising if one keeps the most general allowed terms in the soft\nsector. In absence of the latter, SUSY is not phenomenologically viable, while in presence\nof a most general soft sector, SUSY largely loses its predictivity, due to the bulkiness of\nthe parameter space.\n\n–1–\n\n\fSince SUSY goes often together with the idea of Grand Unification, due to the tantalizing observation of gauge coupling unification after MSSM running, a sensible way-out to\nthe above problem is to take a 'top-down' approach. In this case one starts with the theory\nat the GUT scale – with a far simpler parameter space than the MSSM one – and runs\nall the parameters downwards through Renormalization Group Equations (RGEs). The\nlatter then dynamically generate all the mass splittings for the soft terms at the EW scale,\nwhich, in the low-energy MSSM without GUT, are treated instead as free parameters.\nAs an argument in favour of a top-down approach to the MSSM, it can be noted that\npredictive SUSY GUT models need typically two ingredients at the GUT scale. The first\none is the choice of a specific GUT gauge symmetry. Second, one has to fix the high-scale\nsoft sector with minimal assumptions on the parametric dependence, which seems justified\ndue to a higher amount of symmetry of the theory at this high scale. A further restriction\non the number of parameters and hence more predictability of the model can be obtained\nby introducing additional family symmetries. Once these different parts of the model are\nspecified, the theoretical and computational tools available today allow for a very controlled\ntheoretical error on the model parameters at low-energy, in spite of the 'long running' from\nthe GUT scale and the presence of mass thresholds.\nConcerning SUSY GUT models present on the market, while it is easy to construct\nmodels reproducing the gauge sector of the MSSM at low-energy, it is far more challenging\nto find models also correctly describing 'flavour patterns' such as quark and lepton masses\nand the CKM and PMNS matrices.\nOne such notable model has been proposed by Dermı́šek and Raby in [1]. It is an\nSO(10) SUSY GUT, augmented with a simple family symmetry, conserving R-parity at\nlow-energy. As shown in [1], this model is able to successfully fit all the parameters of the\nSM. In particular, by using some observables basically unaffected by SUSY contributions,\nit can reproduce the CKM matrix entries. Finally, it also describes the known parameters\nin the neutrino sector. In Ref. [2], the same model was also extensively studied in the\nlepton flavour sector, thereby providing a number of signatures of the model, which should\nat least in part be tested by forthcoming experiments.\nIn view of the above mentioned remarkable performance of the DR model in describing\nlow-energy observables, it is interesting to have a closer look at its SUSY spectrum, with\nthe aim of testing, e.g., the predicted mass hierarchies. Since SUSY particles have not yet\nbeen observed, such task can only be accomplished by analyzing implied loop effects in\nflavour changing neutral current (FCNC) processes. In fact, the specific mass patterns of\ngauginos, up- and down-squarks and Higgs multiplets predicted by the model, do affect\nmeasured quark FCNC observables in a peculiar way, and if such observables are well\ncontrolled, the pattern of implied corrections is testable. Fortunately, we have today a\nwhole host of such observables, which have the virtue of being at the same time precisely\nmeasured and accurately calculated within the MSSM.\nThe aim of the present paper is then an in-depth test of the model in the light of all\nthe most accurate information presently available on quark FCNCs. The flavour sector\nis often overlooked in first analyses of new physics (NP) models, due to its vastness and\nthe necessity of sometimes involved calculations. In the context of the present model, we\n\n–2–\n\n\fshow that the flavour sector has nonetheless enough sensitivity to the details of the SUSY\nspectrum, to represent a discriminating test for the model itself.\nOur paper is organized as follows. In Section 2 we give a brief overview of the DR\nmodel, focusing on those ingredients that are most relevant for our purposes. In Section 3\nwe then outline the procedure to connect the GUT scale model with low-energy observables.\nSuch procedure is well-known, but often obscured by the assumptions made on the running\nand the mass thresholds. Section 4 goes then in more detail on the determination of masses\nand couplings, through consideration of low-energy threshold effects. In Section 5 we then\npresent the collection of FCNC observables we use for the purpose of our paper. The\nemphasis here is on presenting simplified expressions, in order to provide an intuitive picture\nof the main effects, with refined formulae only used in the actual numerical analysis. In\nthe light of such intuitive expressions, Section 6 then discusses the general pattern featured\nby the corresponding FCNC observables within the DR model. An extensive analysis of\nall such features upon variation of the DR model parameters is then presented in Section\n7. Finally, Section 8 is devoted to our conclusions.\n\n2. The model\nThe DR model [1, 3] is a supersymmetric SO(10) Grand Unified Theory with an additional\nD3 × [U (1) × Z2 × Z3 ] family symmetry.\nThe above symmetry group fixes the following structure for the superpotential\nW = Wf + Wν ,\nwith\nWf = 163 10 163 + 16a 10 χa\n+ χ̄a (Mχ χa + 45\n\nφa\n\nφ̃a\n\n16a + A 16a ) ,\nM̂\n1\nWν = 16(λ2 Na 16a + λ3 N3 163 ) + (Sa Na Na + S3 N3 N3 ) .\n2\nM̂\n\n163 + 45\n\n(2.1)\n(2.2)\n\nThe first two families of quarks and leptons are contained in the superfield 16a , a =\n1, 2, which transforms under SO(10)×D3 as (16, 2A ), whereas the third family in 163\ntransforms as (16, 1B ). The two MSSM Higgs doublets Hu and Hd are contained in a\n10. As can be seen from the first term on the right-hand side of (2.1), Yukawa unification\nλt = λb = λτ = λντ at MG is obtained only for the third generation, which is directly\ncoupled to the Higgs 10 representation. This immediately implies large tan β ≈ 50 at low\nenergies.\nThe effective Yukawa couplings of the first and second generation fermions are instead\ngenerated via the Froggatt-Nielsen mechanism [4] as follows. Additional fields are introduced, i.e. the 45 which is an adjoint of SO(10), the SO(10) singlet flavon fields φa , φ ̃a , A\nand the Froggatt-Nielsen states χa , χ̄a . The latter transform as a (16, 2A ) and a (16, 2A ),\nrespectively, and receive masses of O(MG ) as Mχ acquires an SO(10) breaking VEV. Once\n\n–3–\n\n\fthey are integrated out, they give rise to effective mass operators which, together with the\nVEVs of the flavon fields, create the Yukawa couplings for the first two generations. This\nmechanism breaks systematically the full flavour symmetry and produces the right mass\nhierarchies among the fermions.\nThe obtained Yukawa matrices for up-quarks, down-quarks, charged leptons and neutrinos are\n\n\n\n\n0 ε′ ρ −ε ξ\n0 ε′ −ε ξ σ\n\n\n\n\nYu =  −ε′ ρ ε̃ ρ −ε  λ ,\nYd =  −ε′ ε̃ −ε σ  λ ,\nεξ ε\n1\nεξ ε\n1\n\n\n\n\n0\n−ε′ 3 ε ξ\n0\n−ε′ ω 23 ε ξ ω\n\n\n\n\n(2.3)\nYe =  ε′\n3 ε̃ ω 32 ε ω  λ .\n3 ε̃ 3 ε  λ , Yν =  ε′ ω\n−3 ε ξ σ −3 ε σ\n1\n−3 ε ξ σ −3 ε σ 1\n\nFrom eqs. (2.3) one can see that the flavour hierarchies in the Yukawa couplings are encoded\nin terms of the four complex parameters ρ, σ, ε̃, ξ and the additional real ones ε, ε′ , λ.\nIn order to avoid neutrino masses of the order of the other fermion masses, one invokes\nthe type-I see-saw mechanism [5, 6, 7, 8]. In particular, three SO(10) singlet Majorana fermion fields Na , N3 (a = 1, 2) are introduced via the contribution of 21 (Sa Na Na + S3 N3 N3 )\nto the superpotential.\nThe mass term 21 N MN N is produced when the flavon fields acquire VEVs hSa i = MNa\nand hS3 i = MN3 . Together with a 16 Higgs one is allowed to introduce the interaction\nterms 16 (λ2 Na 16a + λ3 N3 163 ), which in turn generate a mixing matrix V between the\nright-handed neutrinos and the additional singlets (ν V N ), when the 16 acquires an SO(10)\nbreaking VEV h16iν = v16 . The resulting effective right-handed neutrino mass terms read\nWN = ν V N +\n\n\n\n0 λ2 0\n\n\nV = v16  λ2 0 0  ,\n0 0 λ3\n\n1\nN MN N ,\n2\n\nMN = diag(MN1 , MN2 , MN3 ) .\n\n(2.4)\n\n(2.5)\n\nDiagonalization leads to the effective right-handed neutrino Majorana mass\n−1 T\nV ≡ −diag(MR1 , MR2 , MR3 ) .\nMR = −V MN\n\n(2.6)\n\nBy integrating out the EW singlets ν and N , which both receive GUT scale masses, one\nends up with the light neutrino mass matrix at the EW scale given by the usual see-saw\nformula\nM = mν MR−1 mTν .\n\n(2.7)\n\n3. Basic procedure\nIn this section, we describe the procedure which, from the specification of the model at the\nGUT scale, leads to the MSSM mass spectrum and observables at the EW scale.\n\n–4–\n\n\f3.1 Step 1: Parameters of the model\nGauge coupling sector\nWe choose as three parameters the unification scale MG , the gauge coupling αG defined\nthrough\nαG ≡ α1 (MG ) = α2 (MG ) ,\n\n(3.1)\n\nand the threshold correction ǫ3 defined through\nα3 (MG ) = αG (1 + ǫ3 ) .\n\n(3.2)\n\nThe threshold correction ǫ3 helps to obtain the right value of α3 (MZ ).\nSUSY sector\nWe have the following set of soft SUSY breaking parameters: a universal sfermion mass\nm16 , a universal gaugino mass M1/2 , a universal trilinear coupling parameter A0 , and the\nHiggs mass parameters mHu and mHd . It is well-known that at large tan β, EWSB is easier\nto achieve by allowing the soft SUSY breaking Higgs mass parameters to be split. This\nalso has the consequence that the absolute value of μ is not fixed by EWSB, as is the case\nin the CMSSM1 , but is instead a free parameter.\nYukawa matrices\nThe Yukawa matrices for up- and down-type quarks, charged leptons and neutrinos are\nparameterized as given in (2.3), with ε, ε′ , λ being real and ρ, σ, ε̃, ξ complex parameters.\nRight-handed neutrinos\nThe diagonal right-handed neutrino mass matrix is chosen to be real, which amounts to\nthree parameters MRi , with i = 1, 2, 3.\nWeak-scale parameters\nIn addition to the above GUT-scale parameters, the SUSY parameters μ and tan β have\nalso to be specified as an input at the weak scale.\nThe total number of input parameters, listed in this step and summarized in Table 1,\nis therefore 24. Once these parameters are fixed, the MSSM couplings as well as its whole\nmass spectrum (which includes the SM part) can be predicted at energies below MG , in\nparticular at MZ or any lower scale relevant for FCNC processes. Of course a subset of\nthe observables amenable to prediction is used to fix the model parameters.\nThe procedure to fix the above parameters will be addressed in detail in Section 7.\nSuch procedure uses low-energy observables, and for this reason we need to evolve the\nfundamental parameters of the theory to MZ or below, using their RGEs. The evolution\nto low energy is performed according to a procedure we will now describe.\n1\n\nVery interesting combined analyses in the framework of the CMSSM have been performed in [9, 10, 11].\nIn [12], also non-universal Higgs masses were considered, but only with vanishing A0 .\n\n–5–\n\n\fSector\n\n#\n\nParameters\n\ngauge\nSUSY (GUT scale)\ntextures\nneutrino\nSUSY (EW scale)\n\n3\n5\n11\n3\n2\n\nαG , MG , ǫ3 ,\nm16 , M1/2 , A0 , mHu , mHd ,\nǫ, ǫ′ , λ, ρ, σ, ǫ̃, ξ,\nMR1 , MR2 , MR3 ,\ntan β, μ\n\nTable 1: Parameters in the DR model.\n\n3.2 Step 2: RG evolution\nMGUT > scale > MRi\nThe RGEs of the MSSM with right-handed neutrinos [13, 14, 15] are used to run the gauge\ncouplings, Yukawa couplings, all soft SUSY breaking parameters and the right-handed\nneutrino mass matrix MR down to the mass of the heaviest right-handed neutrino. At\nthis threshold, one must rediagonalize MR and integrate out one neutrino following [16].\nThis generates the effective dimension-five neutrino mass operator. The two remaining\nthresholds are treated accordingly, with the number of neutrinos reduced by one each\ntime. In practical calculations, this procedure turns out to be computationally demanding.\nWe have thus followed the approach of integrating out all the right-handed neutrinos at a\nsingle intermediate threshold, corresponding to the mass of the lightest of them. We have\nthen checked that this approximate treatment does not have any relevant impact on either\nthe determination of the GUT-scale parameters or the low-energy predictions of the model.\nMRi > scale > MZ\nHaving constructed the effective theory without right-handed neutrinos at the scale where\nthey are integrated out, we use MSSM RGEs [17] to run the gauge couplings, Yukawa\nmatrices, soft SUSY breaking parameters and the Wilson coefficient of the neutrino mass\noperator down to the scale MZ . We use two-loop RGEs for dimensionless and one-loop for\ndimensionful parameters.\nSo, starting from the fundamental parameters of Step 1, and performing RGE evolution\nthrough Step 2, one has now the whole set of parameters of the MSSM fixed at MZ or\nbelow, to tree-level. However, for many quantities, such as gauge couplings, some SUSY\nmasses, quark masses, CKM matrix and the Higgs sector, a one-loop determination turns\nout to be mandatory, for different reasons. These issues will be discussed in the next\nsection.\nHere we would like to stress a further property of the low-scale MSSM parameters\nimplied by the DR model. The off-diagonal entries in the squark mass matrices are generated radiatively by the Yukawa couplings; in addition the quark sector features only one\nCP phase2 . These two facts allow to classify the low-energy MSSM resulting from the\n2\n\nPutting additional phases in the right-handed neutrino mass matrix would communicate corresponding\nphases to the low-energy neutrino sector, without affecting, to a very good approximation, the quark sector.\n\n–6–\n\n\fRG evolution of the DR model as belonging to the class of models with minimal flavour\nviolation (MFV) [18].\nWith the above qualifications, using the numerically determined parameters of the\ntheory, we can then evaluate effective Hamiltonians for weak decays, in particular for FCNC\nand CP-violating processes. Having these Hamiltonians at hand, it is straightforward to\nevaluate the branching ratios for various low energy processes and to compare them with\nexperiments. The latter strategy, allowing to extensively test the model in the flavour\nsector, will be dealt with in Sections 6 and 7.\n\n4. One-loop improved determination of low-energy observables\nWith low-energy observables we denote all the physical quantities that can be directly\naccessed experimentally and compared with predictions of the model. Among these quantities, some will be used to fix the model parameters, through a fitting procedure, as\ndescribed in Section 7. The others will then be genuine predictions of the model.\nTo obtain all physical observables beyond tree-level accuracy at the scale MZ , one needs\nto include one-loop corrections in the relevant formulae defining the observables themselves.\nThe inclusion of such corrections is also advocated in the analyses [1, 2]. Below, we give\nsome details of the procedure in the various cases.\nSUSY masses\nThe mass eigenstates for squarks, sleptons, charginos and neutralinos are calculated at the\nweak scale from the tree-level mass matrices [19]. The gluino pole mass is calculated at\nthe one-loop level.\nGauge sector\nWe calculate the gauge couplings αs (MZ ) and αem by including the threshold corrections\ngiven in [20]. We use tadpole corrections to the Higgs potential [20, 21] to obtain the\none-loop VEV and include one-loop SUSY corrections to the Fermi constant measured in\nmuon decay, Gμ , as well as to the W and Z boson pole masses [21].\nHiggs spectrum\nThe Higgs spectrum is represented by the masses Mh0 , MH0 , MH + , MA of the corresponding\nphysical particles. In this model H0 , H + and A are typically nearly degenerate, with only\nthe lightest Higgs mass Mh0 lying at a substantially lower value. The scale of the masses\nMH0 , MH + , MA is set in a non-trivial way by the interplay among μ, tan β, mHu,d and m16\nin the equations minimizing the Higgs potential.\nWe calculate the pseudoscalar Higgs pole mass MA following [20] and use it as an\ninput to FeynHiggs 2.5.1 [22, 23, 24, 25], which accurately calculates the masses of the\nremaining Higgs mass eigenstates, using Yukawa matrices and soft terms at the EW scale,\nwhich in turn are the result of the RG analysis.\nWe explicitly note that MA (and with it the other heavy Higgs masses) is typically\n'pushed up' by the upper bound on the BR(Bs → μ+ μ− ), so that the MA value obtained\n\n–7–\n\n\fwith any given choice of the rest of the parameters can be considered as a lower mass bound\non the heavy Higgs spectrum.\nFermion masses and CKM matrix\nAt large tan β, quark masses undergo tan β enhanced corrections that have to be included\nto the tree-level determination, represented by the running Yukawa couplings at MZ [26].\nThese corrections also modify the relations between the original CKM matrix appearing\nin the MSSM Feynman rules and the effective CKM matrix measured in tree-level decays\n[27, 28]. We closely follow the line of argument of [28] and calculate the one-loop threshold\ncorrections to quark and charged lepton mass matrices at MZ , but take into account both\nSUSY and electroweak contributions. After applying the threshold corrections, we use\nthree-loop QCD and one-loop QED RGEs to run the five light quark and three charged\nlepton masses down to their respective scales.\nThe neutrino masses and the PMNS mixing matrix, on the other hand, are left at the\ntree-level. In fact we find the threshold corrections to these quantities, discussed in [29],\nto be numerically negligible.\n\n5. Basic formulae for FC observables\nIn this section we collect formulae for various branching ratios that we will use in our\nnumerical analysis. In certain cases we show only the leading contribution for large tan β,\nin order to provide an intuitive picture of the behaviour. For example, in the case of\nBs,d → μ+ μ− decays, this corresponds to the contribution of Higgs penguins. In the\nactual numerical analysis we include all the relevant contributions, i.e., besides the SM\none, contributions from charginos, charged Higgses and gluinos. Neutralino contributions\nare generally negligible.\n5.1 Bs,d → μ+ μ−\nIn the SM, the usual Z-penguin and box diagrams result in strongly suppressed branching\nratios that are sensitive functions of the weak decay constants FBd and FBs . Eliminating\nthis dependence with the help of the well-measured mass differences ∆Ms,d [30], one finds\n[31]\nBR(Bs → μ+ μ− )SM = (3.37 ± 0.31) × 10−9 ,\n+ −\n\n−10\n\nBR(Bd → μ μ )SM = (1.02 ± 0.09) × 10\n\n(5.1)\n.\n\n(5.2)\n\nThese values should be compared with the present 95% C.L. upper bounds from CDF [32]\nBR(Bs → μ+ μ− )exp < 1.0 × 10−7 ,\n\nBR(Bd → μ+ μ− )exp < 3.0 × 10−8 ,\n\n(5.3)\n\nthat leave still a large room for NP contributions.\nIn the MSSM with large tan β, the helicity suppression in (5.1) and (5.2) is lifted by\nHiggs-mediated neutral currents [33, 34]. Their contributions can be summarized by the\n\n–8–\n\n\fapproximate formula [28, 35]\nBR(Bs → μ+ μ− ) ≃ 3.5 × 10−5\n×\n\n\"\n\ntan β\n50\n\n#6 \"\n\nτBs\n1.5 ps\n\n#\"\n\nFBs\n230 MeV\n\n#2 \"\n\n(16π 2 ǫY )2\nm4t\n,\nMA4 (1 + ǫ̃3 tan β)2 (1 + ǫ0 tan β)2\n\n|Vts |\n0.040\n\n#2\n(5.4)\n\nwhere mt ≡ mt (μt ) and\nǫ̃3 = ǫ0 + yt2 ǫY ,\n\n(5.5)\n\nwith ǫ0 and ǫY standing for gluino loop and chargino loop factors, whose full expressions\ncan be found in [28].\nWith a similar expression for BR(Bd → μ+ μ− ), one also gets\n\u0014\n\u0015\u0014\n\u0015 \u0014\n\u0015\n\u0015 \u0014\nτBd\nFBd 2 |Vtd | 2 MBd 5\nBR(Bd → μ+ μ− )\n,\n=\nBR(Bs → μ+ μ− )\nτBs\nFBs\n|Vts |\nMBs\n\n(5.6)\n\nwhere non-leading contributions have been neglected.\nObserving that the ratio (5.6) is roughly a factor of ten smaller than the corresponding\nratio of experimental bounds (5.3), it is clear that, in our framework, the current BR(Bd →\nμ+ μ− ) constraint is completely marginal with respect to the Bs counterpart, which is the\nonly channel considered in the rest of the analysis.\nWe explicitly note that, in eq. (5.4), as throughout the text, Vti denotes elements\nof the physical CKM matrix3 , to be distinguished for large tan β from the corresponding\nmatrix appearing at the Lagrangian level. The latter is denoted as 'bare' since it does\nnot yet include the large tan β-resummed effects. A similar comment applies to the quark\nmasses. In actual numerical calculations, the differences between the physical and the\n'bare' parameters have been taken into proper account as discussed in section 4.\nAt this stage, it suffices to state that ǫ0 and ǫ̃3 are at most O(10−2 ). Still, with\ntan β ≈ 50, as characteristic for the DR model, the tan β-resummed corrections in the last\nfactor in (5.4) can be significant and, depending on the sign of μ, can provide an additional\nenhancement of BR(Bs → μ+ μ− ) or respectively some suppression relative to the leading\nbehaviour (tan β)6 . One finds in the full space of parameters considered\nsign(ǫ0 ) = sign(ǫ̃3 ) = sign(μ)\n\n(5.7)\n\nand more explicitly,\n\n3\n\n2αs μ\nH2 (m2b̃ /m2g̃ , m2b̃ /m2g̃ ) ,\n2\n1\n3π mg̃\n1 At\n≈\nH2 (m2t̃1 /μ2 , m2t̃2 /μ2 ) ,\n16π 2 μ\n\nǫ0 ≈ −\n\n(5.8)\n\nǫY\n\n(5.9)\n\nIn the notation of [28], such matrix elements are written as Vtieff .\n\n–9–\n\n\fwhere mb̃i (mt̃i ) are the masses of the ith sbottom (stop), At is the soft SUSY breaking\nstop trilinear parameter4 and mg̃ the gluino mass. The function H2 is defined as [28] (see\nalso [36])\nH2 (x, y) =\n\ny log y\nx log x\n+\n.\n(1 − x)(x − y) (1 − y)(y − x)\n\n(5.10)\n\nWe emphasize that in the DR model the parameters entering ǫ0 and ǫY are strongly\ncorrelated with each other and consequently the range of values which ǫ0 and ǫY can take\nis significantly smaller than in the usual studies of the above formulae, that can be found\nin the literature.\nWe also emphasize that in the numerical analysis one can replace the above branching\nratio with the quantity [30]\nBR(Bs → μ+ μ− )\n,\n∆Ms\n\n(5.11)\n\nthereby eliminating FBs that is still inaccurately known. The only hadronic uncertainties\nin the ratio in (5.11) are present in the non-perturbative factors Bsi , that enter ∆Ms only\nlinearly and are better known from lattice calculations than the decay constant [37].\n5.2 ∆Ms,d\nThe mass differences in the Bs,d − B s,d systems, ∆Ms,d , consist, in the MSSM at large\ntan β, of the following contributions\n0\n\n+\n\n+\n\n0\n\nχ̃\ng̃\ng̃ χ̃\nχ̃\nDP\nH\nSM\n,\n+ ∆Ms,d\n+ ∆Ms,d\n+ ∆Ms,d\n+ ∆Ms,d\n+ ∆Ms,d\n∆Ms,d = ∆Ms,d\n+ ∆Ms,d\n\n(5.12)\n\ni.e. box diagrams with the SM contribution, with charged Higgses, charginos, gluinos,\ngluino-neutralino and neutralinos and finally neutral Higgs double-penguins, respectively.\nExplicit formulae for ∆Ms,d that include all the important contributions are given in [28].5\ni are taken from [37]. Besides the dominant SM contribution, the most\nThe values of Bs,d\n+\n\nχ̃\nDP . The latter\nand especially ∆Ms,d\nimportant NP contributions in the DR model are ∆Ms,d\nis strictly negative [28]\n\n∆MsDP = −12.0 ps−1\n\"\n\nmb (μt )\n×\n3.0 GeV\n\n#\"\n\nms (μt )\n0.06 GeV\n\n#\"\n\n\"\n\ntan β\n50\n\n#4 \"\n\nFBs\n230 MeV\n\n#2 \"\n\n|Vts |\n0.040\n\n#2\n\n#\nm4t (μt )\n(16π 2 ǫY )2\n2 M 2 (1 + ǫ̃ tan β)2 (1 + ǫ tan β)2 .\nMW\n3\n0\nA\n\n4\n\n(5.13)\n\nOur sign convention for At is such that the off-diagonal entry of the tree-level stop mass matrix reads\nmt (At − μ cot β). This agrees with the sign convention for A0 in [1, 2] but disagrees with the convention\nused in [19, 28].\n5\nWe mention that gluino and neutralino box contributions were not considered in [28]. In fact, we find\nthese contributions to be very small, but still included them in our numerical analysis. We did not include,\ninstead, subleading effects in the Higgs propagator appearing in DP diagrams. The latter have been recently\naddressed in [38] and play an insignificant role in the present analysis.\n\n– 10 –\n\n\fWe recall that, experimentally [39],\n(∆Ms )exp = (17.77 ± 0.10 ± 0.07)/ps ,\nto be compared with the UTfit and CKMfitter SM predictions [40, 41]\n(∆Ms )SM\nUTfit = (18.6 ± 2.3)/ps ,\n\n+5.9\n(∆Ms )SM\nCKMfitter = (18.9−2.8 )/ps .\n\n(5.14)\n\nThe CKMfitter result still allows for very sizeable NP contributions, while the UTfit\nresult bounds |∆Ms |DP to be below ≈ 3/ps provided other NP contributions in (5.12) can be\nneglected. We will see in Section 7 that in the DR model ∆Ms is slightly suppressed relative\nto the SM, but this suppression amounts to at most 5%, in accordance with experimental\nfindings.\nConcerning ∆MdDP , it is suppressed by at least two orders of magnitude relative to\n∆MsDP due to md /ms and |Vtd |2 /|Vts |2 factors and consequently in the DR model ∆Md is\nSM-like to a very good accuracy.\nFinally, we note the role played in the present model by the strong correlation [42]\nbetween the Higgs penguin contributions to BR(Bs,d → μ+ μ− ) and ∆Ms : the enhancement\nof BR(Bs,d → μ+ μ− ) in the DR model is correlated with a suppression of ∆Ms . However,\nthe data on ∆Ms do not allow for very large enhancements of BR(Bs,d → μ+ μ− ) so that\nboth observables turn into constraints on the pseudoscalar Higgs mass MA . We will come\nback to this point in Section 6.\n5.3 B → Xsγ\nAn important constraint on any NP model is the inclusive decay B → Xs γ for which the\ndata read [43, 44, 45]\nBR(B → Xs γ)exp = (3.55 ± 0.24 ± 0.10 ± 0.03) × 10−4 ,\n\n(5.15)\n\nto be compared with the SM value at the NNLO level [46]\nBR(B → Xs γ)SM = (3.15 ± 0.23) × 10−4 .\n\n(5.16)\n\nThe inclusion of certain non-perturbative effects decreases this value to (2.98 ± 0.26) ×\n[47]. The latter value, if confirmed, would put some tension on the SM prediction.\nIn any case, unless the central experimental value in (5.15) will be significantly decreased,\nNP scenarios predicting BR(B → Xs γ) to be smaller than the SM value are disfavoured.\nInstead of presenting detailed formulae for B → Xs γ in the DR model, which can be\nfound in the literature [48, 49, 50, 18], we collect here a number of qualitative properties\nof these formulae that will turn out to be useful in understanding our numerical results.\nThese properties are as follows:\n10−4\n\n• The charged and neutral Higgs contributions to BR(B → Xs γ) are strictly positive.\n• The sign of the chargino contributions relative to the SM is ruled by the following\nrelation\n+\n\nC7χ̃ ∝ +μAt tan β × sign(C7SM ) ,\n\n– 11 –\n\n(5.17)\n\n\fwith a positive proportionality factor, so it is opposite to that of the SM one for\nμ > 0 and At < 0 (cf. footnote 4).\nThis shows that the large tan β effects in B → Xs γ are not as strong as in Bs → μ+ μ− ,\nwhere the amplitude behaves as tan3 β/MA2 . However, they are typically more important\nthan in ∆Ms , since in the latter case contributions of Higgs penguins, while behaving as\n2 .\ntan4 β/MA2 , are suppressed by the ratio of the external quark masses over MW\nAmong the NP contributions to B → Xs γ, those from charginos are generically the\nlargest. In fact, the lightest chargino mass is roughly set by the lowest between μ and M2\nand in the DR model it turns out to be generically below ≈ 200 GeV. On the other hand,\nHiggs contributions are generically small in the DR model, since MA,H + are pushed up by\nthe Bs → μ+ μ− constraint. Consequently, for positive μ, the sign of the Wilson coefficient\nC7 can be reversed relative to C7SM , while ∆Ms , as stated above, cannot be modified by\nmore than ≈ 5% if the constraint from Bs → μ+ μ− is taken into account.\nIndeed, for positive μ, in order to pass the B → Xs γ constraint, the model favours the\nsolution C7 (μb ) = −C7SM (μb ). We stress here that such solution is a highly conspired one,\nsince such equality should hold at the μb scale, i.e. after running of the coefficients from\nthe matching scale. In addition, in this case SUSY is not quite a correction to the SM\nresult, but rather the opposite. As a consequence, to address this case, one would need a\ntheoretical control on the SUSY part at least as good as that on the pure SM calculation.\nThis task is in turn very hard to achieve, since e.g., one would have to accurately know\nwhere to integrate out the various sectors of the MSSM entering the SUSY contributions\nto B → Xs γ. In absence of such knowledge, one can take the approach of matching the\nwhole SUSY spectrum at a common reasonable scale. This approach works if SUSY is a\ncorrection to the SM. But in the present case, the solution C7 (μb ) = −C7SM (μb ) is extremely\nsensitive to variation on the matching scale, and the theoretical error associated completely\nout of control. We will come back to this point in section 6.\n5.4 B → Xsl+ l−\nAn important observable in our analysis will be the branching ratio for the inclusive decay\nB → Xs l+ l− and the related forward-backward asymmetry AFB . A significant progress\nin calculating this decay and its exclusive counterpart B → K ∗ l+ l− has been achieved in\nrecent years through the calculation of the NNLO QCD corrections. The corresponding\nformulae are very complicated and will not be presented here. They can be found in\n[51, 52, 53, 54, 55, 56, 57, 58, 59]. For our discussion it will be sufficient to recall the NLO\nformulae [60, 61], keeping only the dipole operator and the operators\nQ9 = (sb)V −A (μμ)V ,\n\nQ10 = (sb)V −A (μμ)A .\n\n(5.18)\n\nThe contributions of semi-leptonic scalar operators to this decay are much less important\nthan in Bd,s → μ+ μ− , since B → Xs l+ l− is not helicity suppressed. We have taken\nthem into account following [62], but their inclusion in the present discussion would only\ncomplicate matters without changing the basic picture.\n\n– 12 –\n\n\fIntroducing the normalized dilepton mass parameter\nŝ =\n\n(pμ+ + pμ− )2\ns\n≡ 2 ,\nm2b\nmb\n\n(5.19)\n\nthe invariant dilepton mass spectrum in the inclusive decay B → Xs l+ l− is roughly given\nat NLO as follows\ndΓ(B → Xs l+ l− )\n∼ (1 − ŝ)2 |Vts |2 U (ŝ) ,\ndŝ\n\n(5.20)\n\nwhere\n\u0012\n\u0013\n\u0011\n\u0010\n2\n(0)eff 2\n(0)eff\neff\n2\n2\nU (ŝ) = (1 + 2ŝ) |C̃9 (ŝ)| + |C̃10 | + 4 1 +\n|C7\n| + 12 C7\nRe(C̃9eff (ŝ)) , (5.21)\nŝ\nwith the MSSM expression for the Wilson coefficients C7 [48] and the SM ones for C9 , C10\ngiven in [60, 61, 63]6 .\nOf particular interest is the (normalized) forward-backward asymmetry in B → Xs l+ l− .\nIt becomes non-zero only at the NLO level. It is given in this approximation as follows [54]\n\"\n#\neff (ŝ) + 2C (0)eff\nŝ\nC̃\n9\n∗\n7\nAFB (ŝ) = −3 Re C̃10\n.\n(5.22)\nU (ŝ)\nThe expression for the corresponding asymmetry in the exclusive decay B → K ∗ l+ l−\ncan be found in [58, 59]. Both asymmetries vanish in the SM at a certain ŝ = ŝ0 [66], which\nin the case of the inclusive decay is determined through\n(0)eff\n\nŝ0 Re C̃9eff (ŝ0 ) + 2C7\n\n=0.\n\n(5.23)\n\nIn the SM at NLO one finds ŝ0 ≈ 0.14. At NNLO the corresponding value is ŝ0 =\n0.162 ± 0.008 [52, 53, 67, 68, 54].\nNow, as can be seen in (5.21), the very low-s region (s < 1 GeV 2 ) is dominated by\nthe coefficient C7 and does not provide more information than already contained in the\nB → Xs γ decay. Much more useful is then the low-s region (1 GeV 2 < s < 6 GeV2 ) which\nis theoretically cleaner than the high-s region, is dominated by the Wilson coefficients C9\nand C10 and is also very sensitive to the C7 -C9 interference in (5.21). For this low-s range\nthe world average coming from Belle [69] and BaBar [70] reads\nBR(B → Xs l+ l− )exp = (1.60 ± 0.51) × 10−6 .\n\n(5.24)\n\nConcerning the forward-backward asymmetry AFB , the only existing positive data\ncome from Belle [71], not yet precise enough to be conclusive on the presence of the zero.\nFor our forthcoming discussion, it will be useful to collect the following general properties of B → Xs l+ l− in the DR model that will be refined later on:\n6\n\nSUSY contributions to C9 and C10 [64, 65] are completely negligible in the DR model.\n\n– 13 –\n\n\f• The Wilson coefficients C9 and C10 receive only small NP contributions so that the\ndepartures of B → Xs l+ l− , AFB and ŝ0 from their SM values are governed by the\nmodifications of C7 .\n• Recalling that C9SM and C7SM have opposite sign, we observe that the flip of the\nsign of C7 by NP contributions will strongly enhance BR(B → Xs l+ l− ), while the\nenhancement of |C7 | without the flip of its sign will suppress this branching ratio\nrelative to the SM value [57, 72]\nBR(B → Xs l+ l− )SM = (1.58 ± 0.10) × 10−6 ,\n\n(5.25)\n\nthat is in perfect agreement with experiment.\n• The value of ŝ0 is correlated with BR(B → Xs γ) if C7 has the SM sign. It increases with increasing BR(B → Xs γ). This is a direct consequence of small NP\ncontributions to C9 in most NP models as pointed out in [73].\n• There is no zero in AFB for sign(C7 ) = −sign(C7SM ).\n5.5 B + → τ + ν\nFinally, we consider the tree-level decay B + → τ + ν. In the SM, its branching ratio is\nsimply given as follows,\n\u0012\n\u00132\nG2F mB + Mτ2\nMτ2\n+\n+\nBR(B → τ ν)SM =\n1− 2\n(5.26)\nFB2 + |Vub |2 τB + .\n8π\nmB +\nAs the decay constant FB + ≈ FBd has still sizeable uncertainties, we consider instead\nthe following ratios [74],\n\u00132\n\u0012\n3π\nVub 2\nBR(B + → τ + ν)SM\nMτ2\nMτ2\n=\n,\n(5.27)\n1\n−\n2\nτB + (∆Md )SM\nVtd\nm2B +\n4 ηB S0 (mt ) B̂Bd MW\n\u00132\n\u0012\nBR(B + → τ + ν)SM\nVub 2\nMτ2 1 mB +\nMτ2\n3π\n1− 2\n=\n,\n(5.28)\n2 ξ2 m\nτB + (∆Ms )SM\nVcb\nmB +\n4 ηB S0 (mt ) B̂Bd MW\nBs\nwhere we used FBd ≈ FB + , mBd ≈ mB + , |Vts | ≈ |Vcb | and the ratio ξ defined as\nq\nFBs B̂Bs\nq\n.\nξ=\nFBd B̂Bd\n\n(5.29)\n\nThe uncertainties on the right-hand side of (5.27) and (5.28) are comparable. In\n(5.27), the only hadronic uncertainty resides in B̂Bd , while in (5.28) there is an additional\nuncertainty in ξ. On the other hand, the ratio |Vub /Vcb |2 can be determined from tree-level\ndecays without NP pollution, while |Vtd |2 can clearly be affected by NP contributions.\nUsing the input parameters of Table 2 and 3, we find from (5.27)\n(\n(0.87 ± 0.11) × 10−4 ,\n|Vub |UTfit ,\n+\n+\nBR(B → τ ν)SM =\n(5.30)\n(1.31 ± 0.23) × 10−4 ,\n|Vub |incl ,\n\n– 14 –\n\n\fParameter\n103 |Vub |UTfit\n103 |Vub |incl\n103 |Vtd |\nB̂Bd\nξ\nηB\n\nValue\n\nRef.\n\nParameter\n\nValue\n\nRef.\n\n3.66(15)\n4.49(33)\n8.49(28)\n1.28(9)\n1.23(6)\n0.55\n\n[40]\n[75]\n[40]\n\n∆Ms [ps−1 ]\n∆Md [ps−1 ]\nmt\nmBs\nmB +\nτB + [10−12 s]\n\n17.77(12)\n0.507(5)\n161.7(2.0)\n5.3661(6)\n5.27913(31)\n1.638(11)\n\n[75]\n[75]\n\n[77]\n\n[76]\n[76]\n[76]\n\nTable 2: Input parameters for the SM prediction of BR(B + → τ + ν). Dimensionful quantities are\nexpressed in GeV, unless otherwise specified.\n\nwhere the first estimate uses the value for |Vub | resulting from the UTfit analysis of [40],\nwhile |Vub |incl is the value resulting from inclusive decays alone. The corresponding values\nfrom (5.28) read\n(\n(0.82 ± 0.12) × 10−4 ,\n|Vub |UTfit ,\n+\n+\nBR(B → τ ν)SM =\n(5.31)\n(1.24 ± 0.24) × 10−4 ,\n|Vub |incl ,\nshowing that the formulae (5.27) and (5.28) give similar results.\nWe observe that the theoretical branching ratio with |Vub |incl is closer to the experimental average between the Belle [78] and BaBar [79] results, which reads [80]\nBR(B + → τ + ν)exp = (1.31 ± 0.48) × 10−4 ,\n\n(5.32)\n\nbut the large experimental error precludes any clear cut conclusions at present. Yet, similarly to the case of the B → Xs γ decay, extensions of the SM that predict BR(B + → τ + ν)\nto be smaller than the SM value seem to be disfavoured at present.\nIn this respect two-Higgs-doublet models of type-II, like the MSSM, where each doublet\ncouples separately to up- and down-type quarks, are interesting as the interference between\nW and H + amplitudes is necessarily destructive [81]. One finds then [82, 83]\n\u0014\n\u00152 DR 2\nm2B +\nVub\ntan2 β\nBR(B + → τ + ν)DR\n= 1− 2\n.\n(5.33)\nRBτ ν =\nSM\nBR(B + → τ + ν)SM\nmH + 1 + ǫ0 tan β\nVub\nWe have explicitly shown the dependence on Vub since, in the DR model, the value of |Vub |\nturns out to be even smaller than |Vub | extracted from the UT SM fit.\n5.6 (g − 2)μ\nIn principle we should also consider (g − 2)μ , where the data seem to be above the SM\nexpectations by roughly 3σ. In many supersymmetric models one finds, for large tan β,\nμ > 0 and slepton masses O(400 GeV), additional contributions to (g − 2)μ that allow to\nfit the data. However, in the DR model, the slepton masses are larger than 1 TeV and\nthe NP contribution amounts to at most one σ of the SM value. Therefore the DR model\ncannot fit the present data on (g − 2)μ and we will not include this observable in the global\nfit, keeping also in mind that the theoretical status of (g − 2)μ is not yet fully satisfactory\n[84, 85, 86].\n\n– 15 –\n\n\f6. General picture\nHaving the formulae for the FC observables at hand, we can discuss first the general pattern\nof these observables within the DR model. A detailed numerical analysis will be presented\nin the next section.\nStep 1\nIn the DR model, due to the unification of Yukawa couplings, tan β is forced to be close to\n50. This fact, as already stressed in section 5, requires MA to be sufficiently large in order\nfor the predicted branching ratio of Bs → μ+ μ− in (5.4) to be consistent with the upper\nbound in (5.3). Typically we find MA > 450 GeV. For such large Higgs masses, one has\nMH + ≈ MA ≈ MH0 and this bound is also approximately valid for MH + and MH0 .\nStep 2\nAs already stressed in section 5.3, the large values of MH + and MA imply that NP contributions to BR(B → Xs γ) are dominated by charginos, with the positive charged and neutral\nHiggs contributions (as well as those from gluinos and neutralinos) being subleading.\nWith μ > 0 it is possible to fit the data on BR(B → Xs γ) by making the chargino\ncontribution so large that C7SUSY ≃ −2 C7SM at the μb scale. There are several problems\nwith this choice.\nFirst, there is the problem already stressed at the end of section 5.3. The possibility\nof having C7SUSY ≃ −2 C7SM at the μb scale implies that the SUSY contribution is not quite\na correction to the SM matching condition, but rather the opposite. With such a large\ncorrection coming from NP, the usual argument of neglecting NLO QCD corrections to\nNP contributions becomes invalid. One would need a control on the NP side at least as\ngood as the one present in the SM contribution. This holds not only for the anomalous\ndimension matrix [87], but also for the matching conditions of the SUSY contributions\n[88, 48, 89, 90]. Indeed, with the use of only LO matching conditions for SUSY, we find\na large sensitivity of the finely-tuned condition C7SUSY ≃ −2 C7SM to the choice of the\nmatching scale for the SUSY contributions. Such sensitivity becomes even stronger on\nthe resulting BR(B → Xs γ) and this makes a meaningful inclusion of the BR(B → Xs γ)\nconstraint in the numerical analysis practically impossible.\nSecond, there is no zero in the forward-backward asymmetry AFB , which is however\nstill elusive experimentally [71].\nThird and foremost, it has been shown in [91] that this solution for C7 is actually\nexcluded by the experimental data on BR(B → Xs l+ l− ), provided the new physics contributions to the Wilson coefficients C̃9eff and C̃10 are small. In fact, the maximal ranges of\nsuch contributions in the MSSM with MFV found in [65] are too small to bring the theory\nprediction for BR(B → Xs l+ l− ) in accordance with the experimental data. These findings\nhave also been confirmed in [72].\nIn summary, we want to stress that although we cannot meaningfully take into account\nthe case C7SUSY ≃ −2 C7SM in the numerical analysis due to the theoretical uncertainties described above, we can exclude this case and impose sign(C7 ) ≡ sign(C7SM ) as a constraint in\n\n– 16 –\n\n\fthe global fitting procedure, because of the model-independent arguments brought forward\nin the previous paragraph, which are unaffected by such uncertainties.\nStep 3\nIf μ is chosen to be positive and one attempts to be consistent with the data on B → Xs l+ l−\nin (5.24) by keeping C7 to have the SM sign, as discussed in the previous step, the negative\ncontribution of charginos tends to suppress BR(B → Xs γ) below acceptable values and\ncan only be tamed by raising the squark masses until these contributions decouple.\nStep 4\nWe next move to μ < 0. In this case, C7 has the same sign as C7SM , but due to constructive\ninterference between SM, scalar and chargino contributions, it tends to be too large, unless\nsquarks are sufficiently heavy. In this respect, we note that, for every given m16 , this case\nis not simply a reflection of the corresponding case with μ > 0. As we will see in the\nnumerical section below, for negative μ the lightest squark masses are generically higher\n(& 2 TeV) than in the corresponding positive μ case.\nStep 5\nLet us finally look at BR(B + → τ + ν). We have seen that in order to bring the SM value\nfor this branching ratio close to its central experimental value, it was necessary to choose\nthe tree-level value for |Vub | > 4 × 10−3 . In the DR model, we do not have this freedom as\n|Vub | is in principle a prediction. In practice it is an outcome of the global fit to the model\nparameters and such fit definitely prefers a low value for |Vub |, around 3.2 × 10−3 . With\nsuch value and the negative contribution from charged Higgses, we find typically\nBR(B + → τ + ν) ≤ 0.6 × 10−4 .\n\n(6.1)\n\nWhile this is not yet excluded, in view of the large experimental error in (5.32), also this\ndecay could turn out to be problematic for the DR model if the central experimental value\nwill remain above 1.0 × 10−4 and the error will decrease by a factor of two.\nFinal remarks\nIn summary, we have shown that while it is possible through choice of the parameters to\nobtain the agreement of the DR model with a given single observable discussed above,\nsimultaneous agreement for all observables is possible at most with very heavy sfermions.\nIn the next section, we will present a detailed numerical analysis of these findings.\n\n7. Numerical analysis\n7.1 Fitting procedure\nWe now turn to describe the numerical strategy adopted to test the DR model. As we\nhave seen in Section 3.1, the model is completely specified in terms of 24 parameters,\n~ After fixing them, it is possible to\nlisted in Table 1 and here collectively indicated as θ.\n\n– 17 –\n\n\freconstruct the whole MSSM at low-energy scales, with a well-controlled theoretical error.\nThe procedure, based on RGEs, which one adopts to connect the GUT scale model to low\nenergies, has been described in Sections 3.2 and 4.\nOnce the low-energy MSSM is specified, the model is testable. To this end, one needs\na suitable set of observables, whose experimental determinations Oi should be as precise as\npossible and, on the theoretical side, calculable within the MSSM with sufficient accuracy.\nSince the MSSM is the low-energy result of the GUT scale model, the theoretical prediction\n~ of the model parameters. In order to compare\nfor the observable Oi will be functions fi [θ]\ntheory predictions with experimental values, one defines a suitable χ2 -function as\n!2\nN\nobs\nX\n~ − Oi\nfi [θ]\n2 ~\nχ [θ] ≡\n,\n(7.1)\nσi\ni=1\n\nwhere the uncertainty σi associated with the ith observable is defined as\nq\nσi = (σi2 )exp + (σi2 )theo .\n\n(7.2)\n\nHere (σi )exp is the experimental RMS error and (σi )theo an estimate of the theoretical error\n~ calculation.\nassociated with the fi [θ]\n2\n~\nThe χ -function (7.1) is then minimized upon variation of the model parameters θ.\nTo this end, we have adopted the minimization algorithm MIGRAD, which is part of the\nCERNlib library [92]. The minimum value for the χ2 -function provides then a quantitative\ntest of the performance of the model in reproducing the observables entering the fit. We\nmention here that, strictly speaking, such test cannot be attached a statistically rigorous\nmeaning, i.e. it is not a 'Pearson's test', since, e.g., the χ2 -entries are not all independently\nmeasured observables. Nonetheless, the numerical value of the minimum for the function\n(7.1), as well as the single pulls in its entries, provide a good quantitative indication of the\ndetailed performance of the model for the single observables.\nThe observables used in the fit are reported in Tables 3-5. Concerning the latter, the\nfollowing comments are in order.\n• The observables in Table 3 were already used – among the others – in the previous\nstudies [1, 2] of the DR model, where the very good performance of the model in\nfitting them was demonstrated. We mention that the experimental determination\nof the observables themselves should not rely on any theoretical assumption which\nwould be invalidated in the presence of NP, i.e. one should choose observables whose\ndetermination is NP-independent. This comment applies in particular to CKMrelated quantities, among which one keeps only those measured through tree-level\nprocesses and sin 2βψKS , which gives direct access to sin 2β since the DR model has\nonly one CP phase in the quark sector.\n• The observables in Table 4, on the other hand, represent the real novelty of our study\nwith respect to the previous ones. Such FC processes are not calculated after the\nfitting procedure, but instead introduced directly in the χ2 -function. The procedure\nto calculate these FC observables has been detailed in Section 5.\n\n– 18 –\n\n\fObservable\n\nValue(σexp )\n\nRef.\n\nObservable\n\nValue(σexp )\n\nRef.\n\nMW\nMZ\n105 Gμ\n1/αem\nαs (MZ )\nMt\nmb (mb )\nmc (mc )\nms (2 GeV)\nmd (2 GeV)\nmu (2 GeV)\n\n80.403(29)\n91.1876(21)\n1.16637(1)\n137.036\n0.1176(20)\n170.9(1.8)\n4.20(7)\n1.25(9)\n0.095(25)\n0.005(2)\n0.00225(75)\n\n[76]\n[76]\n[76]\n[76]\n[76]\n[76]\n[76]\n[76]\n[76]\n[76]\n[76]\n\nMτ\nMμ\n103 Me\n|Vus |\n103 |Vub |\n102 |Vcb |\nsin 2β\n103 ∆m231 [eV2 ]\n105 ∆m221 [eV2 ]\nsin2 2θ12\nsin2 2θ23\n\n1.777(0)\n0.10566(0)\n0.511(0)\n0.2258(14)\n4.1(0.4)\n4.16(7)\n0.675(26)\n2.6(0.2)\n7.90(0.28)\n0.852(32)\n0.996(18)\n\n[76]\n[76]\n[76]\n[40]\n[41]\n[40]\n[75]\n[93]\n[93]\n[93]\n[93]\n\nTable 3: Flavour conserving observables used in the fit. Dimensionful quantities are expressed in\nGeV, unless otherwise specified.\n\nObservable\n103 ǫ\n\nValue(σexp )(σtheo )\n\nK\n\n∆Ms /∆Md\n104 BR(B → Xs γ)\n106 BR(B → Xs l+ l− ) , ql2+ l− ∈ [1, 6] GeV2\n104 BR(B + → τ + ν)\nBR(Bs → μ+ μ− )\n\n2.229(10)(252)\n35.0(0.4)(3.6)\n3.55(26)(46)\n1.60(51)(40)\n1.31(48)(9)\n< 1.0 × 10−7\n\nRef.\n[76]\n[75, 40]\n[46]\n[72]\n[80]\n[32]\n\nTable 4: FC observables used in the fit.\n\n• In addition, we included in the fitting function a number of constraints, i.e. those on\nthe lightest Higgs mass and on the lightest components of the SUSY spectrum, Table\n5, and the constraint on the BR(Bs → μ+ μ− ), Table 4. These constraints are in the\nform of suitably smoothened step functions, which are added to the χ2 -function of\neq. (7.1). If any of the constraints is violated, the step functions add a large positive\nnumber to the χ2 , while for respected constraints the returned value is zero, so that\nthe χ2 is set back to its 'unbiased' definition (7.1).\nFurther comments on the determination of\nthe theoretical errors are in order. First, one\ncan note that among the observables in Table\n3, some have a negligible experimental error. In\nthis case, we took as overall uncertainly 0.5% of\nthe experimental value, which we consider a realistic estimate of the numerical error associated\nwith the calculations7 . Concerning the theoretical errors on the flavour observables (Table 4), we\n7\n\nObservable\nMh0\nmt̃\nmχ̃+\nmg̃\n\nRef.\n\n114.4 GeV\n60 GeV\n104 GeV\n195 GeV\n\n[76]\n[76]\n[76]\n[76]\n\nTable 5: Mass bounds used in the fit.\n\nnote the following: the error on ǫK is\n\nNote that this error is more conservative than the 0.1% used in [1, 2].\n\n– 19 –\n\nLower Bound\n\n\fScale\n\nMG\n\nFit of\ntextures (ǫ, ǫ′ , . . .)\nm16 , M1/2 , A0 , mHu , mHd\nMG , αG , ǫ3\n\n{ Yukawas, SSB, gi , MR }\nMSSMRN RGEs\n\nMR3\n\nIntegrate out νR\nMSSM RGEs\n\nMZ\n\nmb\n\n{ Yukawas, SSB, gi , κν }\n\nSUSY spectrum,\nEWSB conditions,\none-loop corrections to\nmasses and mixings\n\nFit of\nμ, tan β\n\nFCNC observables\n\nχ2 function\n\nFigure 1: Schematic chart of the strategy followed in the fitting procedure.\n\nbasically that on the lattice parameter B̂K ; the error on ∆Ms /∆Md keeps into account that\non the SM contribution, dominated by ξ 2 and that on the NP contributions, dominated by\nthe scalar PL ⊗ PR operators; the error on BR(B + → τ + ν), after normalization as in eq.\n(5.27), is only that on B̂d ; the error on BR(B → Xs γ) is taken as twice the total theoretical error associated with the SM calculation [46]; finally the error on BR(B → Xs l+ l− ) is\ntaken as 25% of the experimental result, and is estimated from the spread of the theoretical\npredictions after variations of the scale of matching of the SUSY contributions.\nWe next turn to the generic strategy adopted to minimize the χ2 -function with respect\n~ We note that, among them, mH , μ and tan β are those responsible\nto the parameters θ.\nu,d\nfor EW symmetry breaking, and the χ2 -function manifests a particularly sensitive dependence on them, especially on mHu,d . As a consequence, such parameters are varied first\n(keeping the other fixed to initial guesses), in order to successfully find an EW symmetry breaking minimum, thereafter varying the rest of the parameters. This procedure is\nschematically described in the flow-chart of Fig. 1. As a final step, all the parameters are\nvaried simultaneously.\nAmong the model parameters, the ones in the SUSY sector are particularly interesting\nsince they set the scale of the SUSY particles' masses. This is especially true for m16 and\nμ. All the other parameters can be left free in the fit, since their typically allowed range of\nvariation is quite narrow. In particular, when m16 is fixed and μ is positive, the fit prefers\nregions of the remaining parameter space such that\nμ, M1/2 ≪ m16 ,\n\n− A0 ≃ 2m16 ,\n\n– 20 –\n\n(7.3)\n\n\fwhich is favoured by third generation Yukawa unification [94, 95, 96]. Concerning the\nfirst of relations (7.3), M1/2 is bounded from above because otherwise the bottom mass is\npushed up beyond acceptable values by large gluino corrections. In fact, we find that M1/2\nis most of the times chosen in the range [140, 400] GeV, where the lower bound results from\nthe chargino mass bound in Table 5.\nThe second of relations (7.3) leads to an inverted scalar mass hierarchy [97], i.e. heavy\nfirst and second generation sfermions, but lighter third generation sfermions. For the values\nof m16 considered here, namely m16 ≥ 4 TeV, and for μ > 0, this condition also helps to\nobtain the correct prediction for mb [94, 95].\nOn the other hand, the allowed interval for μ is generically wider, for every fixed value\nof m16 . As a consequence, our main strategy is to study the model behavior for different\nchoices of {m16 , μ}, and for each of them, let the rest of the parameter space free to be\ndetermined by the minimization procedure. In the next section we now turn to describe\nthe various scenarios considered in the {m16 , μ} plane.\n7.2 Scenarios\nWe considered increasing values of m16 starting from 4 TeV, which represents the 'minimum' value for successful fits to the observables of Table 3 [1, 2]. For each fixed value of\nm16 we then studied the μ dependence by performing fits with different initial guesses for\nthis parameter. All input values for the model parameters corresponding to these scenarios\nare listed in Table 6. In the following, we describe in detail our findings.\n7.2.1 m16 = 4 TeV, μ > 0\nGiven the inverted scalar mass hierarchy, the relatively low value of m16 leads to stop\nmasses below 1 TeV, resulting in a large chargino contribution to BR(B → Xs γ).\nAs a matter of fact, the preferred region of\n1\nNP contributions to the latter decay mode reverses the sign for C7 (μb ): C7 (μb ) ≃ −C7SM (μb ).\n0.5\nOn the fine-tuned character of this case we have\nalready commented in Sections 5.3 and 6. We\n∆C7\n0\n\u0080\u0080\u0080\u0080\u0080\u0080\u0080\u0080\u0080\u0080\u0080\u0080\u0080\u0080\u0080\u0080\u0080\nstress again that within the DR model, this soluCSM\n7\ntion is not viable in view of the implied enhancement to the branching ratio of B → Xs l+ l− .\n-0.5\nModel-independent analyses [91, 72] show in fact\nthat to compensate for such enhancement, one\n-1\nwould need substantial contributions to the Wil\u008e+\n\u008e0\nSM\nH\ng\u008e SM+NP\nΧ\nΧ\nson coefficients C̃9eff and C̃10 of the operators in\neq. (5.18). However, within the DR model, these Figure 2: Contributions to C (μ ) for the\n7 b\nWilson coefficients are always SM-like to an ex- scenario of section 7.2.1.\ncellent approximation.\nAs a consequence of the above, we have studied the viability of having the SM sign in\nC7 (μb ) by imposing this condition as a constraint on the χ2 function. The typical fit result\nin this case is illustrated in Table 7.\n\n– 21 –\n\n\fThe fit displays the main problem of the model in this regime for {m16 , μ}, i.e. a\n5σ discrepancy in the predicted BR(B → Xs γ). Even imposing the SM sign on C7 (μb ),\nthe contribution from charginos is still too large in magnitude, and none of the other NP\ncontributions is able to compensate for it. The situation is illustrated in Fig. 2.\nA second, though less severe, problem is the predicted value for BR(B + → τ + ν), which\nis roughly 2σ too low with respect to the experimental average (5.32). This problem is\nstrictly connected to the quite low value for |Vub | ≈ 3.2 × 10−3 predicted by the model. We\nfound this feature to hold irrespective of the values chosen for {m16 , μ}, so that it should\nbe connected to the specific Yukawa textures of the model.\n7.2.2 m16 = 6 TeV, μ > 0\nSince the BR(B → Xs γ) problem is related to the low value for μ required (at least for\npositive μ) by m16 = 4 TeV, we have tried to increase the latter in order to understand\nhow fastly decoupling is effective in mildening the problem.\nFor m16 = 6 TeV and μ > 0 the preferred\n1\nrange for μ is roughly μ ∈ [800, 1000] GeV. A\n0.8\ntypical fit result is displayed in Table 8, corresponding to the case μ = 953 GeV. As a matter\n0.6\nof fact, the discrepancy in B → Xs γ is tamed\n∆C7\n0.4\n\u0080\u0080\u0080\u0080\u0080\u0080\u0080\u0080\u0080\u0080\u0080\u0080\u0080\u0080\u0080\u0080\u0080\nto roughly 2.3σ, since chargino contributions are\nCSM\n7\nless important than in the m16 = 4 TeV cases.\n0.2\nThe various contributions to C7 (μb ) for the fit in\n0\nTable 8 are displayed in Fig. 3. By decreasing μ\nbelow ≈ 800 GeV, the prediction for B → Xs γ\n-0.2\nfastly worsens. For example, for a converged fit\n\u008e+\n\u008e0\nSM\nH\ng\u008e SM+NP\nΧ\nΧ\nwith μ = 430 GeV, we found that the discrepancy is already at the 4.2σ level. Concerning Figure 3: Contributions to C (μ ) for the\n7 b\nB + → τ + ν, as anticipated above, the predicted scenario of section 7.2.2.\nrate remains always roughly 2σ off.\nAs a final remark, while the case m16 = 6 TeV allows, for suitable μ, a smaller discrepancy in B → Xs γ, the latter comes with the price of a much higher mass for the lightest\nup-type squark, as evident by comparing the corresponding values in Table 11.\n7.2.3 m16 = 10 TeV, μ > 0\nIncreasing m16 further, the chargino contribution to BR(B → Xs γ) becomes comparable\nin size to the charged Higgs contribution, resulting in acceptable values for this branching\nratio. For example, in the fit of Table 9, the pull in this observable is reduced to 1.3σ.\nOn the other hand, the pull resulting from B + → τ + ν is not significantly ameliorated\ncompared to the previous cases. In addition, the lightest squark is as heavy as 1.9 TeV.\n7.2.4 m16 = 4 TeV, μ < 0\nWe explored also the case with negative μ. In this instance, relations in eq. (7.3) (with\nμ → |μ|) do not apparently need to be fulfilled. As a matter of fact, we found satisfactory\n\n– 22 –\n\n\ffits for a quite wide range of μ: μ ∈ −[2100, 400] and A0 is always lower in magnitude than\nthe value required by the second relation in eq. (7.3), typically leading to very small At .\nAs a consequence, the squark mass spectrum does not fulfill an inverted mass hierarchy\n[97, 96] and squark masses are generically very heavy. In this case, also heavy Higgses are\nfound to have generically larger masses, & 1.5 TeV. A typical result is shown in Table 10\nand the displayed features remain basically the same in the full allowed range for μ.\nWe observe that, in this case, negative values of μ, large squark masses and small values\nfor At imply small threshold corrections to mb and therefore allow to have successful Yukawa\nunification away from the inverted mass hierarchy condition. We have then investigated\nwhether an acceptable fit away from inverted mass hierarchy could also be obtained for\nμ > 08 . In the latter case, the most important contributions to the mb threshold correction\nhave the same sign and consequently one generically needs larger squark masses than for\nμ < 0, in order to reproduce the right mb value. In fact we find that, unless m16 & 6 TeV,\nthe prediction on mb is 4σ too large9 and consequently fits with μ > 0 and away from the\ninverted mass hierarchy perform worse than the corresponding negative μ cases.\nWe also note that, in the {m16 , μ} mass scenario considered in the present subsection,\nthe predicted value for BR(B → Xs γ) is always larger than the SM prediction and close to\nthe experimental value. In fact, small At implies negligible chargino contributions, so that\nthe main correction is the one from Higgses. However, since the lightest stop is around\n2.6 TeV, this scenario clashes with the motivation for SUSY as a solution to the Higgs\nfine-tuning problem.\n7.3 Results\nConsidering the discussion in the last section, it is apparent that for positive μ,\n50\nthe tension between the three decays B →\n40\nXs γ, B → Xs l+ l− and Bs → μ+ μ− can be\nrelieved by raising the universal sfermion\nΧ2 30\nmass m16 beyond 8 TeV. This is demon20\nstrated in Fig. 4, showing the total χ2\nand the contribution of B → Xs γ to the\n10\nχ2 for increasing values of m16 . For neg0\native μ, fits with comparable χ2 can be\n4 TeV,\n6 TeV,\n8 TeV, 10 TeV, 4 TeV,\nachieved with lower values of m16 , but not\n378 GeV 953 GeV 1360 GeV 1200 GeV-2106 GeV\nwith lighter squarks, as the lightest squark\n8m16 , Μ<\nis still very heavy in these cases.\n2\nHowever, it is well-known that the su- Figure 4: Total χ (whole bar) and contribution\n2\npersymmetric solution to the gauge hier- of B → Xs γ to the χ (red bar) for the best fits\nwith positive μ and m16 = 4, 6, 8 and 10 TeV,\narchy problem requires light third generarespectively, as well as the best fit with negative\ntion sfermions. Therefore, light stops are μ.\nfavourable to reduce fine-tuning. To show\nthe amount of splitting between fermion and sfermion masses needed in the DR model, we\nplot the lightest stop mass mt̃1 versus the total χ2 for all fits with positive as well as neg8\n9\n\nWe warmly thank R. Dermı́šek for drawing this point to our attention.\nOne should also take into account the quite precisely known value for mb assumed in the present paper.\n\n– 23 –\n\n\f1\n\nm\u008et \u0090 GeV\n\native μ we obtained (see Fig. 5). There is obviously a strong correlation between the stop\nmass and the quality of the fit, demonstrating that mt̃1 has to be at least as large as 1.8 TeV\nto cure the problems with the three aforementioned decays. This is significantly heavier\nthan the masses considered in [1, 2] and may be difficult to reconcile with naturalness.\nIn addition, a number of problems of\nthe model persist even for very large m16 .\n\u009f\u009f\n2500\nThese are the issues related to the Yukawa\n\u009f\ntextures: the up-quark mass, Vub and sin 2β,\n2000\n+\n\u009fè\nand as a result also ∆Ms /∆Md and B →\nè\nτ + ν. This is why there are no points with\nè\n1500\nχ2 . 25 in Fig. 5. The reason for the\nèèè è\nè\nmuch higher χ2 contribution from flavour\n1000\nè èè\nconserving quantities as compared to [1, 2]\nè èèèè\nè\n500\nis mainly due to updated experimental values and reduced experimental errors, espe0\ncially in |Vus |, |Vub | and mb .\n0\n10\n20\n30\n40\n50\n60\n70\nFor a given value of m16 , we found\n2\nΧ\nthat successful fits could only be obtained\nin a limited range of allowed values for μ. Figure 5: Total χ2 vs. the lightest stop mass for\nThe preferred value of μ increased with in- all obtained fits. Red circular points are fits with\ncreasing m16 , as can be seen for the best positive μ, blue squares with negative μ.\nfit points in Fig. 4. This fact could give\nrise to an additional problem. Although we did not include the dark matter density as a\nconstraint in our χ2 analysis, we conjecture that such large values of μ would give rise to a\nrelic abundance of neutralinos incompatible with the WMAP measurements, for the following reason. Because of the extremely heavy sfermions, the dominant annihilation channel\nfor the neutralino in this scenario is through an s-channel pseudoscalar Higgs. While this\nrate is already suppressed by the large MA , the coupling of neutralinos to the pseudoscalar\nHiggs is additionally suppressed by large μ. This would result in an overabundance of relic\nneutralinos incompatible with observations. Solving this problem by resonant neutralino\nannihilation with mχ̃0 ≈ MA /2, as was advocated in an extensive analysis of dark matter\nin this class of models [98, 99], is not possible because of the large MA and the small M1/2\npreferred by the fit.\n\n8. Conclusions\nIn this paper we have performed a detailed analysis of the SO(10) SUSY GUT model with\nD3 family symmetry of Dermı́šek and Raby [1, 2].\nThis model is entirely specified in terms of 24 parameters. Once they are fixed, the\nwhole MSSM parameter space (including its SM subset) is predicted at low energies with\nthe help of RGEs. The common dependence on the model parameters strongly correlates\nall the low energy observables, in contrast with the direct consideration of the MSSM at\nthe EW scale, where the CKM parameters and the fermion masses are fully independent of\n\n– 24 –\n\n\fthe SUSY particle spectrum. We find that the DR model gives a satisfactory description\nof the quark and lepton matrices as well as of the PMNS and CKM mixing matrices\nwith one exception: the CKM element |Vub | turns out to be significantly smaller than\n|Vub |incl extracted from inclusive tree-level decays and even smaller than |Vub |excl . The\nabove findings are mostly a confirmation of previous studies of the model.\nThe main novelty of our study, with respect to similar analyses of SUSY GUT models\nfound in the literature, is that we analyze simultaneously the mass spectra of quark and\nleptons, the CKM and PMNS mixing matrices, the SUSY mass spectrum and its implied\ncorrections to the FC processes Bs → μ+ μ− , B → Xs γ, B → Xs l+ l− , B + → τ + ν and the\nBd,s − B d,s mass differences ∆Md,s . The performance of the model is assessed by means of\na global fit to the above mentioned observables.\nThe inclusion of the FC processes listed above turns out to be a crucial test of the\nmass hierarchies predicted by the model for the SUSY spectrum. In fact, such hierarchies\nunavoidably manifest themselves in loop corrections, and FC observables remain the most\nsensitive probes of such corrections. Our analysis demonstrates that the simultaneous\ndescription of all the FC processes listed above is a serious challenge for the DR model.\nIn view of the specific way this failure is realized, we suspect that this is a problem of a\nwider class of SUSY GUTs in which the presence of Yukawa unification implies tan β ≃ 50,\nunless non-minimal sources of flavour violation are introduced.\nOur main message is the following one. To really assess the viability of models for\nflavour parameters, it is essential not only to verify their ability to reproduce quark and\nlepton mass spectra and mixing matrices – in itself an already notable achievement –\nbut also to test the consistency with the data on available FC processes, since the latter\nhave a simultaneous sensitivity to mixing matrices and new particles' spectra. In the DR\nmodel example, FC processes are in fact the best probes available to the SUSY part of\nthe spectrum, where information from direct detection is missing. It turns out that the\nDR model – otherwise successful for quark and lepton masses as well as for the CKM and\nPMNS matrices – is challenged only when specifically tested in the simultaneous description\nof quark FCNC processes. The failure in the description of these data makes the viability\nof the DR model questionable from the present perspective, but hopefully offers insights\non further lines of development along similar classes of models.\n\nAcknowledgements\nWe warmly acknowledge Radovan Dermı́šek and Stuart Raby for useful discussions and for\na critical reading of the manuscript. This work has been supported in part by the Cluster of\nExcellence \"Origin and Structure of the Universe\" and by the German Bundesministerium\nfür Bildung und Forschung under contract 05HT6WOA. D.G. also warmly acknowledges\nthe support of the A. von Humboldt Stiftung.\n\nNote added\nDuring the completion of the present work, a new bound on the branching ratio for Bs →\n\n– 25 –\n\n\fμ+ μ− has been presented at the HEP 2007 conference [100]. The latter results from a\ncombined analysis of the CDF and DØ data and reads\nBR(Bs → μ+ μ− )CDF+DØ < 5.8 × 10−8 ,\n\n(95% C.L.) .\n\n(8.1)\n\nThis bound represents a considerable improvement over the one given in eq. (5.3).\nIn addition, at the SUSY 2007 conference it was presented a new (preliminary) result\non the BR(B + → τ + ν) from the BaBar collaboration [101], which reads\nBR(B + → τ + ν)BaBar,prelim. = (1.2 ± 0.4stat ± 0.3bkg ± 0.2eff ) × 10−4 .\n\n(8.2)\n\nPerforming the weighted average between the result in eq. (8.2) and the Belle result [78]\none obtains\nBR(B + → τ + ν)new = (1.41 ± 0.43) × 10−4 .\n\n(8.3)\n\nThe new averages in eqs. (8.1) and (8.3) further strengthen our conclusions.\n\nReferences\n[1] R. Dermı́šek and S. Raby, Bi-large neutrino mixing and CP violation in an SO(10) SUSY\nGUT for fermion masses, Phys. Lett. B622 (2005) 327–338, [hep-ph/0507045].\n[2] R. Dermı́šek, M. Harada, and S. Raby, SO(10) SUSY GUT for fermion masses: Lepton\nflavor and CP violation, Phys. Rev. D74 (2006) 035011, [hep-ph/0606055].\n[3] R. Dermı́šek and S. Raby, Fermion masses and neutrino oscillations in SO(10) SUSY GUT\nwith D(3) × U(1) family symmetry, Phys. Rev. D62 (2000) 015007, [hep-ph/9911275].\n[4] C. D. Froggatt and H. B. Nielsen, Hierarchy of Quark Masses, Cabibbo Angles and CP\nViolation, Nucl. Phys. B147 (1979) 277.\n[5] P. Minkowski, μ → eγ at a Rate of One Out of 1-Billion Muon Decays?, Phys. Lett. B67\n(1977) 421.\n[6] M. Gell-Mann, P. Ramond and R. Slansky, Supergravity (P. van Nieuwenhuizen and D.Z.\nFreedman eds.), North-Holland, Amsterdam, 1979, p. 315; T. Yanagida, in Proceedings of\nthe Workshop on the unified theory and the baryon number of the universe (O. Sawada and\nA. Sugamoto eds.), KEK report No. 79-18, Tsukuba, Japan, 1979, p. 95; S. L. Glashow, The\nfuture of elementary particle physics, in Proceedings of the 1979 Cargèse Summer Institute\non Quarks and Leptons (M. Lévy et al. eds.), Plenum Press, New York, 1980, pp. 687-713.\n[7] R. N. Mohapatra and G. Senjanovic, Neutrino mass and spontaneous parity\nnonconservation, Phys. Rev. Lett. 44 (1980) 912.\n[8] P. Ramond, The family group in grand unified theories, hep-ph/9809459.\n[9] R. Ruiz de Austri, R. Trotta, and L. Roszkowski, A Markov chain Monte Carlo analysis of\nthe CMSSM, JHEP 05 (2006) 002, [hep-ph/0602028].\n[10] L. Roszkowski, R. Ruiz de Austri, and R. Trotta, On the detectability of the CMSSM light\nHiggs boson at the Tevatron, JHEP 04 (2007) 084, [hep-ph/0611173].\n\n– 26 –\n\n\f[11] L. Roszkowski, R. Ruiz de Austri, and R. Trotta, Implications for the constrained MSSM\nfrom a new prediction for b → sγ, 0705.2012.\n[12] J. R. Ellis, S. Heinemeyer, K. A. Olive, A. M. Weber, and G. Weiglein, The Supersymmetric\nParameter Space in Light of B-physics Observables and Electroweak Precision Data,\n0706.0652.\n[13] J. Hisano, T. Moroi, K. Tobe, and M. Yamaguchi, Lepton-Flavor Violation via\nRight-Handed Neutrino Yukawa Couplings in Supersymmetric Standard Model, Phys. Rev.\nD53 (1996) 2442–2459, [hep-ph/9510309].\n[14] S. Antusch, J. Kersten, M. Lindner, M. Ratz, and M. A. Schmidt, Running neutrino mass\nparameters in see-saw scenarios, JHEP 03 (2005) 024, [hep-ph/0501272].\n[15] S. T. Petcov, S. Profumo, Y. Takanishi, and C. E. Yaguna, Charged lepton flavor violating\ndecays: Leading logarithmic approximation versus full RG results, Nucl. Phys. B676 (2004)\n453–480, [hep-ph/0306195].\n[16] S. Antusch, J. Kersten, M. Lindner, and M. Ratz, Neutrino mass matrix running for\nnon-degenerate see-saw scales, Phys. Lett. B538 (2002) 87–95, [hep-ph/0203233].\n[17] S. P. Martin and M. T. Vaughn, Two loop renormalization group equations for soft\nsupersymmetry breaking couplings, Phys. Rev. D50 (1994) 2282, [hep-ph/9311340].\n[18] G. D'Ambrosio, G. F. Giudice, G. Isidori, and A. Strumia, Minimal flavour violation: An\neffective field theory approach, Nucl. Phys. B645 (2002) 155–187, [hep-ph/0207036].\n[19] J. Rosiek, Complete set of Feynman rules for the Minimal Supersymmetric extension of the\nStandard Model, Phys. Rev. D41 (1990) 3464. Erratum [hep-ph/9511250].\n[20] D. M. Pierce, J. A. Bagger, K. T. Matchev, and R.-J. Zhang, Precision corrections in the\nMinimal Supersymmetric Standard Model, Nucl. Phys. B491 (1997) 3–67,\n[hep-ph/9606211].\n[21] P. H. Chankowski, S. Pokorski, and J. Rosiek, Complete on-shell renormalization scheme for\nthe minimal supersymmetric Higgs sector, Nucl. Phys. B423 (1994) 437–496,\n[hep-ph/9303309].\n[22] S. Heinemeyer, W. Hollik, and G. Weiglein, FeynHiggs: A program for the calculation of the\nmasses of the neutral CP-even Higgs bosons in the MSSM, Comput. Phys. Commun. 124\n(2000) 76–89, [hep-ph/9812320].\n[23] S. Heinemeyer, W. Hollik, and G. Weiglein, The masses of the neutral CP-even Higgs bosons\nin the MSSM: Accurate analysis at the two-loop level, Eur. Phys. J. C9 (1999) 343–366,\n[hep-ph/9812472].\n[24] G. Degrassi, S. Heinemeyer, W. Hollik, P. Slavich, and G. Weiglein, Towards high-precision\npredictions for the MSSM Higgs sector, Eur. Phys. J. C28 (2003) 133–143,\n[hep-ph/0212020].\n[25] M. Frank et. al., The Higgs boson masses and mixings of the complex MSSM in the\nFeynman-diagrammatic approach, hep-ph/0611326.\n[26] M. Carena, D. Garcia, U. Nierste, and C. E. M. Wagner, Effective Lagrangian for the t̄bH +\ninteraction in the MSSM and charged Higgs phenomenology, Nucl. Phys. B577 (2000)\n88–120, [hep-ph/9912516].\n\n– 27 –\n\n\f[27] T. Blažek, S. Raby, and S. Pokorski, Finite supersymmetric threshold corrections to CKM\nmatrix elements in the large tan β regime, Phys. Rev. D52 (1995) 4151–4158,\n[hep-ph/9504364].\n0\n[28] A. J. Buras, P. H. Chankowski, J. Rosiek, and L. Slawianowska, ∆Md,s , Bd,s\n→ μ+ μ− and\nB → Xs γ in supersymmetry at large tan(β), Nucl. Phys. B659 (2003) 3, [hep-ph/0210145].\n\n[29] P. H. Chankowski and P. Wasowicz, Low energy threshold corrections to neutrino masses\nand mixing angles, Eur. Phys. J. C23 (2002) 249–258, [hep-ph/0110237].\n[30] A. J. Buras, Relations between ∆Ms,d and Bs,d → μμ in models with minimal flavour\nviolation, Phys. Lett. B566 (2003) 115–119, [hep-ph/0303060].\n[31] M. Blanke, A. J. Buras, D. Guadagnoli, and C. Tarantino, Minimal flavour violation waiting\n0\nfor precise measurements of ∆Ms , Sψφ , AsSL , |Vub |, γ and Bs,d\n→ μ+ μ− , JHEP 10 (2006)\n003, [hep-ph/0604057].\n[32] http://www-cdf.fnal.gov/physics/new/bottom/060316.blessed-bsmumu3 and CDF Public note\n8176.\n[33] S. R. Choudhury and N. Gaur, Dileptonic decay of Bs meson in SUSY models with large\ntan(β), Phys. Lett. B451 (1999) 86–92, [hep-ph/9810307].\n[34] K. S. Babu and C. F. Kolda, Higgs-mediated B0 → μ+ μ− in minimal supersymmetry, Phys.\nRev. Lett. 84 (2000) 228–231, [hep-ph/9909476].\n[35] G. Isidori and A. Retico, Scalar flavour-changing neutral currents in the large- tan(β) limit,\nJHEP 11 (2001) 001, [hep-ph/0110121].\n[36] M. Carena, A. Menon, and C. E. M. Wagner, Challenges for MSSM Higgs searches at\nHadron Colliders, 0704.1143.\n[37] D. Becirevic, V. Gimenez, G. Martinelli, M. Papinutto, and J. Reyes, B-parameters of the\ncomplete set of matrix elements of ∆B = 2 operators from the lattice, JHEP 04 (2002) 025,\n[hep-lat/0110091].\n[38] A. Freitas, E. Gasser, and U. Haisch, Supersymmetric large tan(β) corrections to ∆Md,s and\nBd,s → μ+ μ− revisited, hep-ph/0702267. See also M. Gorbahn, S. Jäger, U. Nierste and\nS. Trine. In preparation.\n[39] CDF Collaboration, A. Abulencia et. al., Observation of Bs0 -B̄s0 oscillations, Phys. Rev.\nLett. 97 (2006) 242003, [hep-ex/0609040].\n[40] UTfit website: http://www.utfit.org.\n[41] CKMfitter website: http://ckmfitter.in2p3.fr.\n[42] A. J. Buras, P. H. Chankowski, J. Rosiek, and L. Slawianowska, Correlation between ∆Ms\n0\n→ μ+ μ− in supersymmetry at large tan(β), Phys. Lett. B546 (2002) 96–107,\nand Bs,d\n[hep-ph/0207241].\n[43] Belle Collaboration, P. Koppenburg et. al., An inclusive measurement of the photon energy\nspectrum in b → sγ decays, Phys. Rev. Lett. 93 (2004) 061803, [hep-ex/0403004].\n[44] BaBar Collaboration, B. Aubert et. al., Measurement of the branching fraction and photon\nenergy moments of B → Xs γ and ACP (B → Xs+d γ), Phys. Rev. Lett. 97 (2006) 171803,\n[hep-ex/0607071].\n\n– 28 –\n\n\f[45] Heavy Flavor Averaging Group (HFAG) Collaboration, E. Barberio et. al., Averages\nof b-hadron properties at the end of 2005, hep-ex/0603003.\n[46] M. Misiak et. al., The first estimate of B(B → Xs γ) at O(α2s ), Phys. Rev. Lett. 98 (2007)\n022002, [hep-ph/0609232].\n[47] T. Becher and M. Neubert, Analysis of Br(B → Xs γ) at NNLO with a cut on photon\nenergy, Phys. Rev. Lett. 98 (2007) 022003, [hep-ph/0610067].\n[48] C. Bobeth, M. Misiak, and J. Urban, Matching conditions for b → sγ and b → s gluon in\nextensions of the standard model, Nucl. Phys. B567 (2000) 153–185, [hep-ph/9904413].\n[49] G. Degrassi, P. Gambino, and G. F. Giudice, B → Xs γ in supersymmetry: Large\ncontributions beyond the leading order, JHEP 12 (2000) 009, [hep-ph/0009337].\n[50] M. Carena, D. Garcia, U. Nierste, and C. E. M. Wagner, b → sγ and supersymmetry with\nlarge tan β, Phys. Lett. B499 (2001) 141–146, [hep-ph/0010003].\n[51] C. Bobeth, M. Misiak, and J. Urban, Photonic penguins at two loops and mt -dependence of\nBR(B → Xs l+ l− ), Nucl. Phys. B574 (2000) 291–330, [hep-ph/9910220].\n[52] H. H. Asatryan, H. M. Asatrian, C. Greub, and M. Walker, Calculation of two loop virtual\ncorrections to b → sl+ l− in the standard model, Phys. Rev. D65 (2002) 074004,\n[hep-ph/0109140].\n[53] H. H. Asatryan, H. M. Asatrian, C. Greub, and M. Walker, Complete gluon bremsstrahlung\ncorrections to the process b → sl+ l− , Phys. Rev. D66 (2002) 034009, [hep-ph/0204341].\n[54] A. Ghinculov, T. Hurth, G. Isidori, and Y. P. Yao, The rare decay B → Xs l+ l− to NNLL\nprecision for arbitrary dilepton invariant mass, Nucl. Phys. B685 (2004) 351–392,\n[hep-ph/0312128].\n[55] P. Gambino, M. Gorbahn, and U. Haisch, Anomalous dimension matrix for radiative and\nrare semileptonic B decays up to three loops, Nucl. Phys. B673 (2003) 238–262,\n[hep-ph/0306079].\n[56] C. Bobeth, P. Gambino, M. Gorbahn, and U. Haisch, Complete NNLO QCD analysis of\nB → Xs l+ l− and higher order electroweak effects, JHEP 04 (2004) 071, [hep-ph/0312090].\n[57] T. Huber, E. Lunghi, M. Misiak, and D. Wyler, Electromagnetic Logarithms in\nB → Xs l+ l− , Nucl. Phys. B740 (2006) 105–137, [hep-ph/0512066].\n[58] M. Beneke, T. Feldmann, and D. Seidel, Systematic approach to exclusive B → V l+ l− , V γ\ndecays, Nucl. Phys. B612 (2001) 25–58, [hep-ph/0106067].\n[59] M. Beneke, T. Feldmann, and D. Seidel, Exclusive radiative and electroweak b → d and\nb → s penguin decays at NLO, Eur. Phys. J. C41 (2005) 173–188, [hep-ph/0412400].\n[60] M. Misiak, The b → se+ e− and b → sγ decays with next-to-leading logarithmic QCD\ncorrections, Nucl. Phys. B393 (1993) 23–45.\n[61] A. J. Buras and M. Münz, Effective Hamiltonian for B → Xs e+ e− beyond leading logarithms\nin the NDR and HV schemes, Phys. Rev. D52 (1995) 186–195, [hep-ph/9501281].\n[62] G. Hiller and F. Krüger, More model-independent analysis of b → s processes, Phys. Rev.\nD69 (2004) 074020, [hep-ph/0310219].\n[63] G. Buchalla, A. J. Buras, and M. E. Lautenbacher, Weak decays beyond leading logarithms,\nRev. Mod. Phys. 68 (1996) 1125–1144, [hep-ph/9512380]. See also references therein.\n\n– 29 –\n\n\f[64] C. Bobeth, A. J. Buras, and T. Ewerth, B → Xs l+ l− in the MSSM at NNLO, Nucl. Phys.\nB713 (2005) 522–554, [hep-ph/0409293].\n[65] A. Ali, E. Lunghi, C. Greub, and G. Hiller, Improved model-independent analysis of\nsemileptonic and radiative rare B decays, Phys. Rev. D66 (2002) 034002, [hep-ph/0112300].\n[66] G. Burdman, Short distance coefficients and the vanishing of the lepton asymmetry in\nB → V l+ l− , Phys. Rev. D57 (1998) 4254–4257, [hep-ph/9710550].\n[67] H. H. Asatrian, H. M. Asatrian, C. Greub, and M. Walker, Two-loop virtual corrections to\nB → Xs l+ l− in the Standard Model, Phys. Lett. B507 (2001) 162–172, [hep-ph/0103087].\n[68] H. M. Asatrian, K. Bieri, C. Greub, and A. Hovhannisyan, NNLL corrections to the angular\ndistribution and to the forward-backward asymmetries in B → Xs l+ l− , Phys. Rev. D66\n(2002) 094013, [hep-ph/0209006].\n[69] Belle Collaboration, M. Iwasaki et. al., Improved measurement of the electroweak penguin\nprocess B → Xs l+ l− , Phys. Rev. D72 (2005) 092005, [hep-ex/0503044].\n[70] BaBar Collaboration, B. Aubert et. al., Measurement of the B → Xs l+ l− branching\nfraction with a sum over exclusive modes, Phys. Rev. Lett. 93 (2004) 081802,\n[hep-ex/0404006].\n[71] A. Ishikawa et. al., Measurement of forward-backward asymmetry and Wilson coefficients in\nB → K ∗ l+ l− , Phys. Rev. Lett. 96 (2006) 251801, [hep-ex/0603018].\n[72] E. Lunghi, W. Porod, and O. Vives, Analysis of enhanced tan(β) corrections in MFV GUT\nscenarios, Phys. Rev. D74 (2006) 075003, [hep-ph/0605177].\n[73] A. J. Buras, A. Poschenrieder, M. Spranger, and A. Weiler, The impact of universal extra\ndimensions on B → Xs γ, B → Xs gluon, B → Xs μ+ μ− , KL → π 0 e+ e− , and ǫ′ /ǫ, Nucl.\nPhys. B678 (2004) 455–490, [hep-ph/0306158].\n[74] K. Ikado, talk presented at FPCP 2006 (9-12 April 2006, Vancouver, Canada)\nhttp://fpcp2006.triumf.ca.\n[75] Heavy Flavor Averaging Group:\nhttp://www.slac.stanford.edu/xorg/hfag.\n[76] W.-M. Yao et. al., Review of Particle Physics, Journal of Physics G 33 (2006) 1+.\n[77] S. Hashimoto, Recent results from lattice calculations, Int. J. Mod. Phys. A20 (2005)\n5133–5144, [hep-ph/0411126].\n[78] K. Ikado et. al., Evidence of the purely leptonic decay B − → τ − ν τ , Phys. Rev. Lett. 97\n(2006) 251802, [hep-ex/0604018].\n[79] BaBar Collaboration, B. Aubert et. al., A search for B + → τ + ν recoiling against\nB − → D0 l− ν l X, hep-ex/0608019.\n[80] UTfit Collaboration, M. Bona et. al., The unitarity triangle fit in the standard model and\nhadronic parameters from lattice QCD: A reappraisal after the measurements of ∆ms and\nBR(B → τ ντ ), JHEP 10 (2006) 081, [hep-ph/0606167].\n[81] W.-S. Hou, Enhanced charged Higgs boson effects in B − → τ ν, μν and b → τ ν + X, Phys.\nRev. D48 (1993) 2342–2344.\n[82] A. G. Akeroyd and S. Recksiegel, The effect of H ± on B ± → τ ± ντ and B ± → μ± νμ , J.\nPhys. G29 (2003) 2311–2317, [hep-ph/0306037].\n\n– 30 –\n\n\f[83] G. Isidori and P. Paradisi, Hints of large tan(β) in flavour physics, Phys. Lett. B639 (2006)\n499–507, [hep-ph/0605012].\n[84] J. P. Miller, E. de Rafael, and B. L. Roberts, Muon g − 2: Review of Theory and\nExperiment, Rept. Prog. Phys. 70 (2007) 795, [hep-ph/0703049].\n[85] Muon (g − 2) Collaboration, G. W. Bennett et. al., Final report of the muon E821\nanomalous magnetic moment measurement at BNL, Phys. Rev. D73 (2006) 072003,\n[hep-ex/0602035].\n[86] K. Hagiwara, A. D. Martin, D. Nomura, and T. Teubner, Improved predictions for g − 2 of\nthe muon and αQED (MZ2 ), hep-ph/0611102.\n[87] M. Czakon, U. Haisch, and M. Misiak, Four-loop anomalous dimensions for radiative\nflavour- changing decays, JHEP 03 (2007) 008, [hep-ph/0612329]. See also references\ntherein.\n[88] M. Ciuchini, G. Degrassi, P. Gambino, and G. F. Giudice, Next-to-leading QCD corrections\nto B → Xs γ in Supersymmetry, Nucl. Phys. B534 (1998) 3–20, [hep-ph/9806308].\n[89] F. Borzumati, C. Greub, and Y. Yamada, Beyond leading-order corrections to B̄ → Xs γ at\nlarge tan β: The charged-Higgs contribution, Phys. Rev. D69 (2004) 055005,\n[hep-ph/0311151].\n[90] G. Degrassi, P. Gambino, and P. Slavich, QCD corrections to radiative B decays in the\nMSSM with minimal flavor violation, Phys. Lett. B635 (2006) 335–342, [hep-ph/0601135].\n[91] P. Gambino, U. Haisch, and M. Misiak, Determining the sign of the b → sγ amplitude,\nPhys. Rev. Lett. 94 (2005) 061803, [hep-ph/0410155].\n[92] See the CERNlib website: http://cernlib.web.cern.ch/cernlib/.\n[93] M. C. Gonzalez-Garcia and M. Maltoni, Phenomenology with Massive Neutrinos,\n0704.1800.\n[94] T. Blažek, R. Dermı́šek, and S. Raby, Predictions for Higgs and SUSY spectra from SO(10)\nYukawa unification with μ > 0, Phys. Rev. Lett. 88 (2002) 111804, [hep-ph/0107097].\n[95] T. Blažek, R. Dermı́šek, and S. Raby, Yukawa unification in SO(10), Phys. Rev. D65 (2002)\n115004, [hep-ph/0201081].\n[96] D. Auto et. al., Yukawa coupling unification in supersymmetric models, JHEP 06 (2003)\n023, [hep-ph/0302155].\n[97] J. A. Bagger, J. L. Feng, N. Polonsky, and R.-J. Zhang, Superheavy supersymmetry from\nscalar mass A-parameter fixed points, Phys. Lett. B473 (2000) 264–271, [hep-ph/9911255].\n[98] R. Dermı́šek, S. Raby, L. Roszkowski, and R. Ruiz de Austri, Dark matter and Bs → μ+ μ−\nwith minimal SO(10) soft SUSY breaking, JHEP 04 (2003) 037, [hep-ph/0304101].\n[99] R. Dermı́šek, S. Raby, L. Roszkowski, and R. Ruiz de Austri, Dark matter and Bs → μ+ μ−\nwith minimal SO(10) soft SUSY breaking II, JHEP 09 (2005) 029, [hep-ph/0507233].\n[100] See talk by A. Maciel at HEP 2007, Parallel Session \"Flavour Physics and CP Violation\",\nJuly 20, 2007.\n[101] See talk by G. De Nardo at SUSY 2007, Parallel Session \"Flavour Physics\", July 27, 2007.\n\n– 31 –\n\n\fm16\nμ\n\n4000\n378\n\n6000\n953\n\n10000\n1200\n\n4000\n−2106\n\nM1/2\nA0\ntan β\n1/αG\nMG /1016\nǫ3 /%\n(mHu /m16 )2\n(mHd /m16 )2\nMR1 /1010\nMR2 /1010\nMR3 /1010\nλ\nǫ\nǫ′\n|ρ|\n|σ|\n|ǫ̃|\n|ξ|\narg ρ\narg σ\narg ǫ̃\narg ξ\n\n147.3\n−7787.4\n49.9\n24.7\n2.45\n−3.81\n1.59\n1.86\n1.059\n−74.85\n3244.0\n0.618\n0.0473\n−0.0034\n0.0566\n1.02\n0.00964\n0.134\n3.93\n0.641\n0.484\n3.61\n\n145.6\n−11924.0\n48.8\n24.7\n3.11\n−4.12\n1.55\n1.79\n1.05\n−70.51\n3053.0\n0.583\n0.048\n−0.00338\n0.0584\n1.03\n0.00957\n0.134\n3.92\n0.617\n0.492\n3.6\n\n146.7\n−20070.0\n48.7\n24.7\n4.8\n−5.37\n1.57\n1.8\n1.072\n−71.93\n3069.0\n0.582\n0.0477\n−0.00342\n0.0574\n1.03\n0.00967\n0.134\n3.94\n0.622\n0.491\n3.61\n\n229.9\n−630.13\n49.3\n24.6\n4.96\n−5.6\n0.52\n1.0\n0.8999\n−66.94\n2718.0\n0.578\n0.048\n−0.00356\n0.0567\n0.987\n0.00999\n0.14\n3.94\n0.751\n0.505\n3.58\n\nTable 6: Input parameters for the fits presented in section 7.2 (cf. Table 1). Dimensionful\nquantities are given in units of GeV.\n\n– 32 –\n\n\fObservable\n\nExp. value\n\nFit value\n\nPull (σ)\n\nMW\nMZ\nGF × 105\n1/αem\nαs (MZ )\nMt\nmb (mb )\nmc (mb )\nms (2 GeV)\nmd (2 GeV)\nmu (2 GeV)\nMτ\nMμ\nMe\n|Vus |\n|Vub | × 103\n|Vcb |\nsin 2β\n∆m231 × 1021\n∆m221 × 1023\nsin2 2θ12\nsin2 2θ23\nǫK × 103\nBR(B → Xs γ) × 104\nBR(B → Xs l+ l− ) × 106\n∆Ms /∆Md\nBR(B + → τ + ν) × 104\n\n80.403\n91.1876\n1.16637\n137.036\n0.1176\n170.9\n4.2\n1.25\n0.095\n0.005\n0.00225\n1.777\n0.10566\n0.000511\n0.2258\n4.1\n0.0416\n0.675\n2.6\n7.9\n0.852\n0.996\n2.229\n3.55\n1.6\n35.05\n1.31\n\n80.4\n90.6\n1.16\n136.4\n0.115\n171.4\n4.31\n1.15\n0.107\n0.00741\n0.00462\n1.77\n0.106\n0.000511\n0.225\n3.26\n0.0417\n0.637\n2.6\n7.9\n0.85\n1.0\n2.32\n0.885\n1.8\n29.8\n0.336\ntotal χ2 :\n\n0.1\n1.3\n0.7\n0.9\n1.1\n0.2\n1.5\n1.2\n0.5\n1.2\n3.2\n0.4\n0.1\n0.0\n0.6\n2.1\n0.1\n1.4\n0.0\n0.0\n0.1\n0.2\n0.4\n5.0\n0.3\n1.4\n2.0\n58.3\n\nTable 7: Fit results for the case m16 = 4 TeV, μ = 378 GeV. The pull for the ith observable\nrepresents the square root of the corresponding entry in the χ2 function (7.1). Corresponding\npredictions are reported in Table 11. Dimensionful quantities are given in units of GeV.\n\n– 33 –\n\n\fObservable\n\nExp. value\n\nFit value\n\nPull (σ)\n\nMW\nMZ\nGF × 105\n1/αem\nαs (MZ )\nMt\nmb (mb )\nmc (mb )\nms (2 GeV)\nmd (2 GeV)\nmu (2 GeV)\nMτ\nMμ\nMe\n|Vus |\n|Vub | × 103\n|Vcb |\nsin 2β\n∆m231 × 1021\n∆m221 × 1023\nsin2 2θ12\nsin2 2θ23\nǫK × 103\nBR(B → Xs γ) × 104\nBR(B → Xs l+ l− ) × 106\n∆Ms /∆Md\nBR(B + → τ + ν) × 104\n\n80.403\n91.1876\n1.16637\n137.036\n0.1176\n170.9\n4.2\n1.25\n0.095\n0.005\n0.00225\n1.777\n0.10566\n0.000511\n0.2258\n4.1\n0.0416\n0.675\n2.6\n7.9\n0.852\n0.996\n2.229\n3.55\n1.6\n35.05\n1.31\n\n80.5\n90.6\n1.16\n136.5\n0.116\n169.8\n4.29\n1.14\n0.106\n0.00727\n0.00465\n1.77\n0.106\n0.000511\n0.225\n3.26\n0.0417\n0.638\n2.6\n7.9\n0.852\n0.997\n2.31\n2.34\n1.62\n30.0\n0.398\ntotal χ2 :\n\n0.2\n1.2\n0.5\n0.8\n0.5\n0.6\n1.3\n1.2\n0.4\n1.1\n3.2\n0.3\n0.1\n0.0\n0.6\n2.1\n0.1\n1.4\n0.0\n0.0\n0.0\n0.1\n0.3\n2.3\n0.0\n1.4\n1.9\n35.6\n\nTable 8: Fit results for the case m16 = 6 TeV, μ = 953 GeV. Corresponding predictions are\nreported in Table 11. Dimensionful quantities are given in units of GeV.\n\n– 34 –\n\n\fObservable\n\nExp. value\n\nFit value\n\nPull (σ)\n\nMW\nMZ\nGF × 105\n1/αem\nαs (MZ )\nMt\nmb (mb )\nmc (mb )\nms (2 GeV)\nmd (2 GeV)\nmu (2 GeV)\nMτ\nMμ\nMe\n|Vus |\n|Vub | × 103\n|Vcb |\nsin 2β\n∆m231 × 1021\n∆m221 × 1023\nsin2 2θ12\nsin2 2θ23\nǫK × 103\nBR(B → Xs γ) × 104\nBR(B → Xs l+ l− ) × 106\n∆Ms /∆Md\nBR(B + → τ + ν) × 104\n\n80.403\n91.1876\n1.16637\n137.036\n0.1176\n170.9\n4.2\n1.25\n0.095\n0.005\n0.00225\n1.777\n0.10566\n0.000511\n0.2258\n4.1\n0.0416\n0.675\n2.6\n7.9\n0.852\n0.996\n2.229\n3.55\n1.6\n35.05\n1.31\n\n80.6\n90.7\n1.16\n136.8\n0.117\n170.6\n4.22\n1.14\n0.107\n0.00741\n0.00461\n1.78\n0.106\n0.000511\n0.225\n3.26\n0.0416\n0.639\n2.6\n7.9\n0.852\n1.0\n2.33\n2.86\n1.62\n31.1\n0.517\ntotal χ2 :\n\n0.5\n1.1\n0.3\n0.4\n0.2\n0.2\n0.3\n1.2\n0.5\n1.2\n3.1\n0.1\n0.1\n0.0\n0.6\n2.1\n0.1\n1.4\n0.0\n0.0\n0.0\n0.2\n0.4\n1.3\n0.0\n1.1\n1.7\n27.4\n\nTable 9: Fit results for the case m16 = 10 TeV, μ = 1200 GeV. Corresponding predictions are\nreported in Table 11. Dimensionful quantities are given in units of GeV.\n\n– 35 –\n\n\fObservable\n\nExp. value\n\nFit value\n\nPull (σ)\n\nMW\nMZ\nGF × 105\n1/αem\nαs (MZ )\nMt\nmb (mb )\nmc (mb )\nms (2 GeV)\nmd (2 GeV)\nmu (2 GeV)\nMτ\nMμ\nMe\n|Vus |\n|Vub | × 103\n|Vcb |\nsin 2β\n∆m231 × 1021\n∆m221 × 1023\nsin2 2θ12\nsin2 2θ23\nǫK × 103\nBR(B → Xs γ) × 104\nBR(B → Xs l+ l− ) × 106\n∆Ms /∆Md\nBR(B + → τ + ν) × 104\n\n80.403\n91.1876\n1.16637\n137.036\n0.1176\n170.9\n4.2\n1.25\n0.095\n0.005\n0.00225\n1.777\n0.10566\n0.000511\n0.2258\n4.1\n0.0416\n0.675\n2.6\n7.9\n0.852\n0.996\n2.229\n3.55\n1.6\n35.05\n1.31\n\n80.7\n90.7\n1.17\n136.9\n0.118\n170.5\n4.19\n1.14\n0.0999\n0.00716\n0.00446\n1.78\n0.106\n0.000511\n0.224\n3.26\n0.0416\n0.64\n2.6\n7.9\n0.851\n0.996\n2.35\n3.34\n1.63\n31.4\n0.59\ntotal χ2 :\n\n0.7\n1.1\n0.2\n0.3\n0.0\n0.2\n0.1\n1.2\n0.2\n1.1\n3.0\n0.1\n0.2\n0.1\n1.2\n2.1\n0.0\n1.3\n0.0\n0.0\n0.0\n0.0\n0.5\n0.4\n0.0\n1.0\n1.5\n24.5\n\nTable 10: Fit results for the case m16 = 4 TeV, μ = −2106 GeV. Corresponding predictions are\nreported in Table 11. Dimensionful quantities are given in units of GeV.\n\n– 36 –\n\n\fm16\nμ\n\n4000\n378\n\n6000\n953\n\n10000\n1200\n\n4000\n−2106\n\nBR(Bs → μ+ μ− ) × 108\nŝ0\nBR(μ → eγ) × 1013\n× 1010\nδaSUSY\nμ\nMh0\nMA\nmt̃1\nmb̃1\nmτ̃1\nmχ̃01\nmχ̃+\n\n8.6\n0.022\n0.36\n+5.8\n126\n507\n640\n895\n1510\n60\n115\n\n7.7\n0.13\n0.021\n+1.6\n129\n559\n1172\n1475\n2419\n60\n119\n\n2.1\n0.14\n0.0026\n+0.52\n129\n842\n1903\n2366\n3933\n60\n120\n\n0.33\n0.16\n0.011\n−2.9\n119\n1800\n2627\n2488\n2931\n94\n189\n\nmg̃\n\n462\n\n478\n\n506\n\n703\n\n1\n\nTable 11: Predictions for the scenarios presented in section 7.2. Masses are given in units of GeV.\nŝ0 is the zero position of the forward-backward asymmetry in B → Xs l+ l− (cf. Section 5.4). The\nquantity δaSUSY\nis the SUSY contribution to aμ ≡ (g − 2)μ /2, which is currently measured to be\nμ\n−10\n+27.6 × 10\nlarger than the SM prediction [85, 86], with an uncertainty of about 8 × 10−10 .\n\n– 37 –\n\n\f"}