{"id": "http://arxiv.org/abs/0711.4524v3", "guidislink": true, "updated": "2008-10-16T20:19:35Z", "updated_parsed": [2008, 10, 16, 20, 19, 35, 3, 290, 0], "published": "2007-11-28T15:06:54Z", "published_parsed": [2007, 11, 28, 15, 6, 54, 2, 332, 0], "title": "$T_c$ Dependence of Energy Gap and Asymmetry of Coherence Peaks in\n  NdBa$_2$Cu$_3$O$_{7-δ}$", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0711.3362%2C0711.3005%2C0711.3231%2C0711.3281%2C0711.2875%2C0711.4523%2C0711.2461%2C0711.1054%2C0711.4489%2C0711.0309%2C0711.2859%2C0711.0201%2C0711.3180%2C0711.3849%2C0711.4155%2C0711.0701%2C0711.4691%2C0711.2550%2C0711.3605%2C0711.4574%2C0711.3198%2C0711.3420%2C0711.1234%2C0711.0582%2C0711.3965%2C0711.3134%2C0711.4985%2C0711.4572%2C0711.3809%2C0711.3560%2C0711.0426%2C0711.3442%2C0711.2537%2C0711.2797%2C0711.4733%2C0711.3091%2C0711.0592%2C0711.3608%2C0711.4162%2C0711.3208%2C0711.4371%2C0711.4214%2C0711.2741%2C0711.4259%2C0711.2856%2C0711.0347%2C0711.0341%2C0711.0560%2C0711.2442%2C0711.4237%2C0711.3991%2C0711.1435%2C0711.1455%2C0711.4043%2C0711.4524%2C0711.0173%2C0711.1109%2C0711.5005%2C0711.0287%2C0711.1467%2C0711.2234%2C0711.3014%2C0711.0586%2C0711.0035%2C0711.4593%2C0711.1695%2C0711.1740%2C0711.4479%2C0711.2156%2C0711.3652%2C0711.3745%2C0711.3931%2C0711.3742%2C0711.1150%2C0711.3234%2C0711.2947%2C0711.1963%2C0711.2260%2C0711.2970%2C0711.0154%2C0711.2755%2C0711.2912%2C0711.3903%2C0711.2355%2C0711.3772%2C0711.4830%2C0711.0237%2C0711.2172%2C0711.1308%2C0711.4872%2C0711.2563%2C0711.1093%2C0711.0500%2C0711.4684%2C0711.1513%2C0711.2539%2C0711.3530%2C0711.1768%2C0711.0061%2C0711.1154%2C0711.2314&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "$T_c$ Dependence of Energy Gap and Asymmetry of Coherence Peaks in\n  NdBa$_2$Cu$_3$O$_{7-δ}$"}, "summary": "We report here the results of scanning tunneling spectroscopic experiments\nperformed on hole doped NdBa$_2$Cu$_3$O$_{7-\\delta}$ single crystals of $T_c$\nvalues of 76 K, 93.5 K and 95.5 K. The energy gaps are observed to be\nincreasing with decreasing $T_c$ values. The coherence peaks are asymmetric\nwith the peaks at the filled states being larger than those at the empty ones.\nThe asymmetry increases with decreasing $T_c$. The observed asymmetry and its\n$T_c$ dependence can be explained by considering the Mott insulating nature of\nthe material at the undoped state.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0711.3362%2C0711.3005%2C0711.3231%2C0711.3281%2C0711.2875%2C0711.4523%2C0711.2461%2C0711.1054%2C0711.4489%2C0711.0309%2C0711.2859%2C0711.0201%2C0711.3180%2C0711.3849%2C0711.4155%2C0711.0701%2C0711.4691%2C0711.2550%2C0711.3605%2C0711.4574%2C0711.3198%2C0711.3420%2C0711.1234%2C0711.0582%2C0711.3965%2C0711.3134%2C0711.4985%2C0711.4572%2C0711.3809%2C0711.3560%2C0711.0426%2C0711.3442%2C0711.2537%2C0711.2797%2C0711.4733%2C0711.3091%2C0711.0592%2C0711.3608%2C0711.4162%2C0711.3208%2C0711.4371%2C0711.4214%2C0711.2741%2C0711.4259%2C0711.2856%2C0711.0347%2C0711.0341%2C0711.0560%2C0711.2442%2C0711.4237%2C0711.3991%2C0711.1435%2C0711.1455%2C0711.4043%2C0711.4524%2C0711.0173%2C0711.1109%2C0711.5005%2C0711.0287%2C0711.1467%2C0711.2234%2C0711.3014%2C0711.0586%2C0711.0035%2C0711.4593%2C0711.1695%2C0711.1740%2C0711.4479%2C0711.2156%2C0711.3652%2C0711.3745%2C0711.3931%2C0711.3742%2C0711.1150%2C0711.3234%2C0711.2947%2C0711.1963%2C0711.2260%2C0711.2970%2C0711.0154%2C0711.2755%2C0711.2912%2C0711.3903%2C0711.2355%2C0711.3772%2C0711.4830%2C0711.0237%2C0711.2172%2C0711.1308%2C0711.4872%2C0711.2563%2C0711.1093%2C0711.0500%2C0711.4684%2C0711.1513%2C0711.2539%2C0711.3530%2C0711.1768%2C0711.0061%2C0711.1154%2C0711.2314&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We report here the results of scanning tunneling spectroscopic experiments\nperformed on hole doped NdBa$_2$Cu$_3$O$_{7-\\delta}$ single crystals of $T_c$\nvalues of 76 K, 93.5 K and 95.5 K. The energy gaps are observed to be\nincreasing with decreasing $T_c$ values. The coherence peaks are asymmetric\nwith the peaks at the filled states being larger than those at the empty ones.\nThe asymmetry increases with decreasing $T_c$. The observed asymmetry and its\n$T_c$ dependence can be explained by considering the Mott insulating nature of\nthe material at the undoped state."}, "authors": ["P. Das", "M. R. Koblischka", "Th. Wolf", "P. Adelmann", "U. Hartmann"], "author_detail": {"name": "U. Hartmann"}, "author": "U. Hartmann", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1209/0295-5075/84/47004", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0711.4524v3", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0711.4524v3", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "4 pages, 1 Figure, to appear in Euro Phys. Lett", "arxiv_primary_category": {"term": "cond-mat.supr-con", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.supr-con", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "cond-mat.str-el", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0711.4524v3", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0711.4524v3", "journal_reference": "Euro Phys. Lett. 84, 47004 (2008).", "doi": "10.1209/0295-5075/84/47004", "fulltext": "Tc Dependence of Energy Gap and Asymmetry of Coherence Peaks in NdBa2 Cu3 O7−δ\nP. Das,1, ∗ M. R. Koblischka,1 Th. Wolf,2 P. Adelmann,2 and U. Hartmann3\n\narXiv:0711.4524v3 [cond-mat.supr-con] 16 Oct 2008\n\n2\n\n1\nInstitute of Experimental Physics, University of Saarland, D-66041 Saarbruecken, Germany\nForschungzentrum Karlsruhe GmbH, Institute of Solid State Physics, D-76021 Karlsruhe, Germany\n3\nInstitute of Experimental Physics, University of Saarland, D-66041 Saarbruecken, Germany\n\nWe report here the results of scanning tunneling spectroscopy experiments performed on hole\ndoped NdBa2 Cu3 O7−δ single crystals of Tc values of 76 K, 93.5 K and 95.5 K. The energy gaps are\nobserved to be increasing with decreasing Tc values. The coherence peaks are asymmetric with the\npeaks at the filled states being larger than those at the empty ones. The asymmetry increases with\ndecreasing Tc . The observed asymmetry and its Tc dependence can be explained by considering the\nMott insulating nature of the material at the undoped state.\n\nTunneling spectroscopy played an important role in\nthe understanding of superconductivity in conventional\nsuperconductors. In case of high temperature cuprate superconductors (HTSC), scanning tunneling spectroscopy\n(STS) and angle resolved photoemission spectroscopy\n(ARPES) experiments have turned out to be very important in providing detailed information on the electronic\nstructure. The cuprates being Mott insulators in the undoped state show strongly doping dependent characteristics. From the tunneling and ARPES studies, a monotonic dependence of the energy gap has been observed\non Bi2 Sr2 CaCu2 O8+δ (Bi-2212) [1, 2, 3]. However, Yeh\net al. reported that the energy gap of YBa2 Cu3 O7−δ\n(Y-123) does not vary monotonically with doping as it\ndoes for Bi-2212 [4]. In addition to the information on\nthe energy gap, STS and ARPES experiments also have\nrevealed dip and hump structures beyond the coherence\npeak in the spectroscopic data [5, 6, 7].\nApart from these features, STS data often revealed\nan asymmetry of the conductance peak heights at both\nempty and filled states [5, 6]. The peak height at the\nfilled state is usually higher than that at the empty ones.\nIn some cases, where conductance peaks are not very\nclear, the asymmetry is still clearly visible in the background of the tunneling conductance [8, 9]. The origin\nof this asymmetry so far remains unclear. Yusof et al.\nhave shown that the asymmetric peaks in the local density of states (LDOS) are related to the symmetry of the\norder parameter [10]. Using tight-binding band structure calculations for Bi-2212 and with the inclusion of\ntunneling directionality and group velocity, their calculations suggested that for dx2 −y2 symmetry the LDOS\nshould be asymmetric. The important factor giving rise\nto the asymmetry in their calculations seems to be the\ndirectionality. The calculations were performed for tunneling almost along the (π,0) direction in order to match\nthe asymmetry observed in experiments. However, in\ncase of STS, the tunneling tip positioned above the ab\nplane is unlikely to have the directional preference that,\n\n∗ Present address: Max Planck Institute for Chemical Physics of\nSolids, Noethnitzer Str. 40, D-01187 Dresden, Germany ; Electronic address: Pintu.Das@cpfs.mpg.de\n\naccording to Yusof et al., is necessary to produce the observed asymmetry [10]. On the other hand, it was shown\nthat if the energy gap function in a superconductor depends on the wave vector k through the band energy ǫk\n(i.e. ∆ ≡ ∆(ǫk )), and if the slope of ∆ at the Fermi\nenergy is positive, asymmetric peaks with the peak at\nthe occupied state higher than that at the unoccupied\none will result [11]. Recently Randeria et al. and Anderson et al. have suggested that the observed asymmetry in strongly-correlated systems like cuprates is due\nto hole doping [12, 13]. As the cuprate superconductors\nare lightly hole-doped systems, where strong Coulomb\nrepulsion prohibits double occupancy at a site, they considered the role of electron and hole occupancies in their\ncalculations, which produced an asymmetry of the coherence peaks. This theory also predicts that the asymmetry\nwould increase with underdoping. Experimentally the respective features were mostly observed for Bi-2212, where\nvery reproducible results could be obtained [5, 14, 15].\nThis is due to the fact that the surface of Bi-based systems can be easily prepared for STM/STS and ARPES\nstudies by cleaving. However, in order to gain a general understanding it is necessary to study the electronic\nstructures of different cuprate systems.\nIn a very recent work Kohsaka et al.\nobserved that the asymmetry decreases with doping in\nCa2−x Nax Cu2 Cl2 [9]. Y-123 defines another class of\nHTSC, where in addition to CuO2 layers, there is another\none-dimensional CuO chain layer. Due to the surfacerelated complexities, so far there is too little reproducible\nSTS and ARPES data on this cuprate system to suggest\nthat the features which are observed on chainless Bi-2212\ncould be generalized for the cuprates with chain layers.\nIn this work we present STS data obtained on\nNdBa2 Cu3 O7−δ (Nd-123) which is isostructural to Y123. STS studies were performed on the ab plane of\nNd-123 single crystals with Tc values of 76 K (underdoped, sample UD76) and 93.5 K (slightly underdoped,\nsample UD93). Data obtained on the bc plane of an optimally doped single crystal (Tc = 95.5 K, sample OP95)\nwill also be presented.\nThe samples are prepared as described in Ref. [16].\nX-ray diffraction patterns for the three samples show\nthat the samples are of single phase. The unit cells\n\n\f2\nhave the usual orthorhombic structure and the samples\nare twinned. STM/STS experiments were performed on\nthe as-grown samples. These were cleaned in absolute\nethanol and dried by pure He gas before mounting into\nthe STM. The STS data were obtained as dI/dV curves\nwith a lock-in amplifier using a modulation voltage of 2\nmV (rms). All data were obtained at a tunnel junction\nresistance of 500 MΩ. A negative(positive) bias addresses\nthe filled(empty) states of the sample. Platinum (80%)iridium (20%) tips were used for the measurements. All\nmeasurements were carried out at T = 4.2 K and in He\ngas environment.\nSTS data were obtained at different locations on the\nsamples. dI/dV curves show a strong variation of electronic structures. Curves with different energy gaps and\nsometimes without any signature of a clear energy gap\nwere observed on the samples. In the following, we discuss the spectra with clear energy gap features. Such\ncurves (raw data) which are representative for the superconducting state for the three samples are shown in\nFig. 1. As it is evident from the figure, the energy gap\nwith asymmetric peaks are very reproducibly observed\nfor all the three samples. On the optimally doped sample, where the STS experiments were performed on the bc\nplane, curves with energy gap features were not observed\nas frequently as in the case of the other two samples. This\nis most likely due to the fact that the probability of probing a superconducting CuO2 plane, while tunneling to or\nfrom the ab plane, is higher than that on the bc plane,\nwhere all the superconducting and nonsuperconducting\nlayers of the unit cell terminate.\nAs can be seen from Fig. 1, the curves have three important features : a peak (close to the Fermi energy),\na dip (next to the peak) and a hump (marked as P, D\nand H for the UD76 and UD93 samples) at both filled\nand empty states [17]. The dips and humps are present\non top of a nearly linear background. These features\nare very clear in the data obtained on the UD93 sample.\nApart from the PDH features, the peak heights are asymmetric with filled state heights being larger than those at\nthe empty ones.\nThe PDH features have been often observed in STS\nand ARPES data obtained at the superconducting state\nof Bi-2212 [6, 18]. Although, the physics behind the\norigin of the features is still unknown, the prior experiments suggest that these fine structures are intrinsic to\nthe CuO2 plane [19, 20]. Whether the features are due\nto any band structure or strong coupling effect similar to\nthe ones for conventional superconductors is a topic of\nintense debate [21]. Since CuO2 plane layer is the only\ncommon layer in the unit cells of Bi-2212 and Nd-123,\nthe presence of the PDH features in the spectra of Nd123 suggest that these are due to the CuO2 plane layer.\nThus, our results on Nd-123 show that these are the universal features of the cuprates.\nIn the representative curves, the conductance peaks,\nwhich indicate the gap edges, are observed at energies\nof eV = ∆. The energy gap (2∆) measured from peak-\n\nto-peak separation monotonically increases as the Tc values decrease due to underdoping. In detail we have obtained 56±4 meV for OP95, 70.6±1.5 meV for UD93 and\n117±25 meV for UD76.\nFor Nd-123, the highest Tc is obtained at an oxygen\ncontent of O7 (i.e., δ=0) [22]. Thus, there is no overdoped\nregion in the Tc -versus-doping phase diagram for this material. Since the isotherms are believed to depend on the\nNd/Ba ratio of the Nd-123 phase, the determination of\nthe exact oxygen content was not possible [23]. However,\nsince the Tc dependence on hole doping is almost linear,\nthe above values suggest a qualitatively similar dependence of ∆ on hole doping values. From the observed\ndata, the reduced gap values 2∆/kB Tc are found to be\nincreasing from 6.9 for OP95 to as high as 18 for UD76.\nThese values are in the range of values reported for both\nBi-2212 and Y-123 [24]. In general, underdoped cuprates\nwhich yield smaller Tc values are found to have large ∆\nvalues [24]. A very high value (as high as 20) for underdoped Bi-2212 has been observed by Miyakawa et al. [25].\nFor Bi-2212, ∆ decreases monotonically with an increase\nof doping and hence with increasing Tc up to optimal\ndoping [1, 2, 26]. The present data show that for Nd123 the ∆ values similarly decrease with increase of Tc\n(hence doping) up to the highest Tc value (i.e., optimal\ndoping). This contradicts the data on Y-123 reported by\nYeh et al. who observed a nonmonotonic dependence of\n∆ on doping [4].\nThe observation of identical features in different\ncuprate materials containing an additional CuO chain\nlayer in the unit cell implies that these are general features of cuprates. The strong dependence of ∆ on Tc and\nhence on hole doping observed here indicates a similar\npairing mechanism for cuprate materials with or without\nchain layers. Although, most of the STS and ARPES\nspectra at the underdoped region showed clear peaks as\nin the present data on Nd-123, in a very recent study on\nunderdoped Bi-2212, Gomes et al. observed ill-defined\nlarge gaps without sharp peaks in the dI/dV spectra [15].\nSimilar features have also been observed on underdoped\nLa2−x Bax CuO4 with x=1/8 where superconductivity is\nstrongly suppressed [27]. Here, the ill-defined gaps,\nmarked by humps across the Fermi level, have been suggested to be pseudogaps. In a recent ARPES experiments\non deeply underdoped Bi-2212, Tanaka et al. observed\ntwo distinct gap features: superconducting gap features\nwith coherence peaks close to the nodal direction and\npseudogap features without sharp peaks along the antinodal directions of the Fermi surface [28]. Considering\nthese two gap scenerios in a underdoped cuprate, it is\ntempting to suggest that the tunneling data which averages over the entire k-space might indeed give a resultant\nof both pseudogap and pairing gap. This would then lead\nto big gap values [15].\nFrom the curves shown in Fig. 1, the asymmetry has\nbeen calculated as\nA=\n\ng|p,− − g|p,+\n([g|p,− + g|p,+ ]/2)\n\n(1)\n\n\f3\nwhere g|p,− and g|p,+ are the dI/dV values at the peaks\nof the filled and empty states, respectively. The obtained values for the three representative curves for samples UD76 (brown curve), UD93 (black curve) and OP95\n(yellow curve) are A = 0.29, 0.14 and 0.05, respectively.\nIn case of conventional s wave superconductors, the coherence peaks are always symmetric. In case of HTSC,\nthe asymmetry has been mostly observed in STS data on\nBi-2212.\nThe surface of Nd-123 has been reported to be very\nstable against oxygen loss unlike that of Y-123 [29]. In\nSTS experiments on Nd-123 single crystals, Wu et al.\nhave observed asymmetric peaks [30]. However, the energy gap and the degree of asymmetry observed in their\nSTS experiments, where the tip and the sample were at\ntwo different temperatures, are very different than the\npresent data. Nishiyama et al. observed energy gaps on\nNd-123 single crystals, but the other features were absent\n[31].\nIn cuprates, which are Mott insulators in the undoped\nstate, doping of holes changes the conductivity of the\nmaterial. If x is the average hole doping value, there are\n1 − x occupied sites per unit cell. Since superconductivity is obtained only for a small range of x (typically\n5% - ∼ 25%), there is always a higher percentage of occupied (electron) states from which the electrons can be\nextracted than of empty (hole) states to which the electrons could be injected. This implies that as x increases\nthe ratio 1/x − 1 of occupied and unoccupied states decreases. In the absence of an overdoping region in the\nphase diagram of Nd-123, as x increases, eventually Tc\nincreases. This qualitatively suggests that the observed\nasymmetry is related to hole doping in the cuprates in\ngeneral. The present data on Nd-123 samples obviously\nconfirm the aforementioned predictions by Randeria et\nal. [12] and Anderson et al. [13] with respect to the relationship of asymmetry and underdoping. To further\nverify this hypothesis, the ratio of energy-integrated differential conductance is considered for the spectra shown\nin Fig. 1. The ratio is defined as\nR0\ngdV\n0\nR = R−V\n(2)\nV0\n0 gdV\n\na fixed energy range for the three samples. The respective ratios for the three representative curves for samples\nUD76, UD93 and OP95 are R = 1.175, 1.013, and 1.012,\nrespectively.\nThe R values show that the energy-integrated conductance at the filled sample state also decreases with respect\nto the empty state part with a change of Tc . This is very\nclear in the case of the two samples with a large difference of Tc (and thus doping). It is, however, not straightforward to compare the energy-integrated value in case\nof tunneling on ab and bc planes. The bc plane, being\nthe termination of the superconducting CuO2 and other\nnonsuperconducting layers of the unit cell, is ∼12 Å long\nalong the c axis. The probability, that the dI/dV curves\nobtained a few Ångstroms above this plane are affected\nby other nonsuperconducting layers is high. This would\nthen lead to broadened features in the STS curves. Thus,\nfor a very small doping difference, the energy-integrated\nvalue of the curves might be difficult to compare as in\nthe present case.\nIn summary, STS studies have been performed on\ndoped Nd-123 single crystal samples with Tc values of 76\nK, 93.5 K and 95.5 K. In the dI/dV curves with features\nlike conductance peak, dip and hump, energy gap values\nare found to be decreasing with increasing of Tc from underdoped to optimally doped samples. This is in agreement with the variation of the gap with Tc in Bi-2212\nsamples. Furthermore, the coherence peak heights are\nasymmetric with the peaks at the filled states are found\nto be higher compared to the ones at the empty states.\nThe asymmetry increases with decrease of Tc which can\nbe explained as being due to approaching the Mott insulator state.\n\nAcknowledgments\n\nwhere g = dI/dV is the measured differential conductance. The integrations are carried out over the experimental bias range of V0 = 0.1 V. The limits are chosen in\norder to be able to compare the integrated values within\n\nWe gratefully acknowledge the useful discussions with\nH. Ghosh from Max Planck Institute for Physics of Complex Solids and S. Borisenko, Leibnitz Institute of Solid\nState and Material Research (IFW), Dresden, Germany\nand thank S. Wirth from Max Planck Institute for Chemical Physics of Solids for the useful comments on our\nmanuscript.\n†\nPresent address : Max Planck Institute of Chemical\nPhysics of Solids, Noethnitzer Str. 40, 01187 Dresden,\nGermany\n\n[1] N. Miyakawa, P. Guptasarma, J. F. Zasadzinski, D. G.\nHinks, and K. E. Gray, Phys. Rev. Lett. 80, 157 (1998).\n[2] C. Renner, B. Revaz, J.-Y. Genaud., K. Kadowaki, and\nØ. Fischer, Phys. Rev. Lett. 80, 149 (1998).\n[3] J. C. Campuzano, H. Dins, M. R. Norman, H. M.\nFretwell, M. Randeria, A. Kaminski, J. Mesot,\n\nT. Takeuchi, T. Sato, T. Yokoya, et al., Phys. Rev. Lett.\n83, 3709 (1999).\n[4] N.-C. Yeh, C.-T. Chen, G. Hammerl, J. Mannhart,\nA. Schmehl, C. W. Schneider, R. R. Schulz, S. Tajima,\nK. Yoshida, D. Garrigus, et al., Phys. Rev. Lett. 87,\n087003 (2001).\n\n\f4\n[5] S. Sugita, T. Watanabe, and A. Matsuda, Phys. Rev B\n62, 8715 (2000).\n[6] S. H. Pan, E. W. Hudson, K. M. Lang, H. Eisaki,\nS. Uchida, J. C., and Davis, Nature 403, 746 (2000).\n[7] D. L. Feng, N. P. Armitage, D. H. Lu, A. Damascalli,\nJ. P. Hu, P. Bogdanov, A. Lanzara, F. Ronning, K. M.\nShen, H. Eisaki, et al., Phys. Rev. Lett. 86, 5550 (2001).\n[8] K. McElroy, D.-H. Lee, J. E. Hoffman, K. M. Lang,\nJ. Lee, E. W. Hudson, H. Esisaki, S. Uchida, and J. C.\nDavis, Phys. Rev. Lett. 94, 197005 (2005).\n[9] Y. Kohsaka, C. Taylor, K. Fujita, A. Schmidt, C. Lupien,\nT. Hanaguri, M. Azuma, M. Takano, H. Eisaki, H. Takagi, et al., Science 315, 1380 (2007).\n[10] Z. Yusof, J. F. Zasadzinski, L. Coffey, and N. Miyakawa,\nPhys. Rev. B 58, 514 (1998).\n[11] J. E. Hirsch, Phys. Rev. B 59, 11962 (1999).\n[12] M. Randeria, R. Sensarma, N. Trivedi, and F.-C. Zhang,\nPhys. Rev. Lett. 95, 137001 (2005).\n[13] P. W. Anderson and N. P. Ong, J. Phys. Chem. of Solids\n67, 1 (2006).\n[14] E. W. Hudson, S. H. Pan, A. K. Gupta, K.-W. Ng, and\nJ. C. Davis, Science 285, 88 (1999).\n[15] K. K. Gomes, A. N. Pashupathy, A. Pushp, S. Ono,\nY. Ando, and A. Yazdani, Nature 447, 569 (2007).\n[16] T. Wolf, W. Goldecker, B. Obst, G. Roth, and R. Flueckiger, J. Crys. Gr. 96, 1989 (1989).\n[17] P. Das, M. R. Koblischka, and U. Hartmann, J. Phys.\nConf. Ser. 61, 234 (2007).\n[18] D. S. Dessau, B. O. Wells, Z.-X. Shen, W. E. Spicer, A. J.\nArco, R. S. List, D. B. Mitzi, and A. Kaputilinik, Phys.\nRev. Lett. 66, 2160 (1991).\n\n[19] T. Cren, D. Roditchev, W. Sacks, and J. Klein, Eur.\nPhys. Lett. 52, 203 (2000).\n[20] . Fischer, M. Kugler, I. Maggio-Aprile, and C. Berthod,\nRev. Mod. Phys. 79, 353 (2007).\n[21] J. F. Zasadzinski, L. Coffey, P. Romano, and Z. Yosuf,\nPhys. Rev. B 68, 180504 (2003).\n[22] U. Tutsch, B. Schweiss, R. Hauff, B. Obst, T. Wolf, and\nH. Wuehl, J. Low Temp. Phys. 117, 951 (1999).\n[23] T. Wolf, A.-C. Bornarel, H. Kpfer, R. Meier-Himmer,\nand B. Obst, Phys. Rev. B 58, 6308 (1997).\n[24] G. Deutscher, Nature 397, 410 (1999).\n[25] N. Miyakawa, J. F. Zasadzinksi, L. Ozyuzer, P. Guptasarma, D. G. Hinks, C. Kendziora, and K. E. Gray,\nPhys. Rev. Lett. 83, 1018 (1999).\n[26] Y. DeWilde, N. Miyakawa, P. Guptasarma, M. Iavarone,\nL. Ozyuzer, J. F. Zasadzinski, P. Romano, D. G. Hinks,\nC. Kendziora, G. W. Crabtree, et al., Phys. Rev. Lett.\n80, 153 (1998).\n[27] T. Valla, A. V. Fedorov, J. Lee, J. C. Davis, and G. D.\nGu, Science 314, 1914 (2006).\n[28] K. Tanaka, W. S. Lee, D. H. Lu, A. Fujimori, T. Fujii,\nRusdina, I. Terasaki, D. J. Scalapino, T. P. Devereaux,\nZ. Hussain, et al., Science 314, 1910 (2006).\n[29] W. Ting, N. Koshizuka, and S. Tanaka, Appl. Phys. Lett.\n72, 2035 (1998).\n[30] A. T. Wu, N. Koshizuka, and N. Tanaka, Mod. Phys.\nLett. B 13, 735 (1999).\n[31] M. Nishiyama, G. Kinoda, S. Shibata, T. Hasegawa,\nN. Koshizuka, and M. Murakami, J. Superconduct. 15,\n351 (2002).\n\n\f5\n\n1.6\n\nOP95\n1.4\n\n2\n\n1.2\n\n1.0\n\n0.8\n\nUD93\n\nH\nP\n\ndI/dV (arb. unit)\n\n2.4\n\n1.6\n\nD\n\n0.8\n\n0.8\n\nH\n\nUD76\n\nP\n\n0.6\n\n0.4\n\n0.2\nD\n\n0.0\n-0.10 -0.05 0.00\n\n0.05\n\n0.10\n\nBias (V)\n\nFIG. 1: Representative dI/dV curves obtained at T = 4.2 K\non Nd-123 single crystals with Tc values of 76 K (ab plane),\n93.5 K (ab plane) and 95.5 K (bc plane). Spectra shown for\nUD76 were obtained along a 5 nm scan line and for UD93\nwere obtained along 20 nm line. The spectra shown for OP95\nwere obtained at the same location. The curves observed at\ndifferent locations are staggered for clarity.\n\n\f"}