{"id": "http://arxiv.org/abs/0902.0344v1", "guidislink": true, "updated": "2009-02-02T19:43:22Z", "updated_parsed": [2009, 2, 2, 19, 43, 22, 0, 33, 0], "published": "2009-02-02T19:43:22Z", "published_parsed": [2009, 2, 2, 19, 43, 22, 0, 33, 0], "title": "Frequency dependence of the radiative decay rate of excitons in\n  self-assembled quantum dots: experiment and theory", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0902.4689%2C0902.3574%2C0902.0086%2C0902.3270%2C0902.0738%2C0902.2371%2C0902.1284%2C0902.0344%2C0902.2068%2C0902.3656%2C0902.1523%2C0902.1549%2C0902.3945%2C0902.4883%2C0902.0013%2C0902.4138%2C0902.2611%2C0902.3084%2C0902.1922%2C0902.4320%2C0902.1919%2C0902.1579%2C0902.0769%2C0902.4746%2C0902.3583%2C0902.3523%2C0902.3528%2C0902.3040%2C0902.1318%2C0902.3274%2C0902.3448%2C0902.0541%2C0902.0915%2C0902.2542%2C0902.4663%2C0902.1972%2C0902.0865%2C0902.2335%2C0902.1001%2C0902.3163%2C0902.4165%2C0902.1222%2C0902.4703%2C0902.4782%2C0902.2924%2C0902.3740%2C0902.2849%2C0902.3139%2C0902.3684%2C0902.1653%2C0902.3122%2C0902.0243%2C0902.1440%2C0902.2438%2C0902.4467%2C0902.0929%2C0902.2903%2C0902.2327%2C0902.0743%2C0902.4024%2C0902.3582%2C0902.2305%2C0902.0609%2C0902.2867%2C0902.2585%2C0902.1906%2C0902.3736%2C0902.3596%2C0902.3821%2C0902.2388%2C0902.3831%2C0902.4348%2C0902.4836%2C0902.1639%2C0902.3660%2C0902.0967%2C0902.0424%2C0902.3066%2C0902.0561%2C0902.2169%2C0902.0157%2C0902.4330%2C0902.1225%2C0902.1338%2C0902.1688%2C0902.0076%2C0902.2263%2C0902.1596%2C0902.4148%2C0902.2302%2C0902.2010%2C0902.1824%2C0902.2079%2C0902.4432%2C0902.3319%2C0902.4652%2C0902.4694%2C0902.1739%2C0902.1668%2C0902.0429%2C0902.2127&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Frequency dependence of the radiative decay rate of excitons in\n  self-assembled quantum dots: experiment and theory"}, "summary": "We analyze time-resolved spontaneous emission from excitons confined in\nself-assembled $\\mathrm{InAs}$ quantum dots placed at various distances to a\nsemiconductor-air interface. The modification of the local density of optical\nstates due to the proximity of the interface enables unambiguous determination\nof the radiative and non-radiative decay rates of the excitons. From\nmeasurements at various emission energies we obtain the frequency dependence of\nthe radiative decay rate, which is only revealed due to the separation of the\nradiative and non-radiative parts. It contains detailed information about the\ndependence of the exciton wavefunction on quantum dot size. The experimental\nresults are compared to the quantum optics theory of a solid state emitter in\nan inhomogeneous environment. Using this model, we extract the frequency\ndependence of the overlap between the electron and hole wavefunctions. We\nfurthermore discuss three models of quantum dot strain and compare the measured\nwavefunction overlap to these models. The observed frequency dependence of the\nwavefunction overlap can be understood qualitatively in terms of the different\ncompressibility of electrons and holes originating from their different\neffective masses.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0902.4689%2C0902.3574%2C0902.0086%2C0902.3270%2C0902.0738%2C0902.2371%2C0902.1284%2C0902.0344%2C0902.2068%2C0902.3656%2C0902.1523%2C0902.1549%2C0902.3945%2C0902.4883%2C0902.0013%2C0902.4138%2C0902.2611%2C0902.3084%2C0902.1922%2C0902.4320%2C0902.1919%2C0902.1579%2C0902.0769%2C0902.4746%2C0902.3583%2C0902.3523%2C0902.3528%2C0902.3040%2C0902.1318%2C0902.3274%2C0902.3448%2C0902.0541%2C0902.0915%2C0902.2542%2C0902.4663%2C0902.1972%2C0902.0865%2C0902.2335%2C0902.1001%2C0902.3163%2C0902.4165%2C0902.1222%2C0902.4703%2C0902.4782%2C0902.2924%2C0902.3740%2C0902.2849%2C0902.3139%2C0902.3684%2C0902.1653%2C0902.3122%2C0902.0243%2C0902.1440%2C0902.2438%2C0902.4467%2C0902.0929%2C0902.2903%2C0902.2327%2C0902.0743%2C0902.4024%2C0902.3582%2C0902.2305%2C0902.0609%2C0902.2867%2C0902.2585%2C0902.1906%2C0902.3736%2C0902.3596%2C0902.3821%2C0902.2388%2C0902.3831%2C0902.4348%2C0902.4836%2C0902.1639%2C0902.3660%2C0902.0967%2C0902.0424%2C0902.3066%2C0902.0561%2C0902.2169%2C0902.0157%2C0902.4330%2C0902.1225%2C0902.1338%2C0902.1688%2C0902.0076%2C0902.2263%2C0902.1596%2C0902.4148%2C0902.2302%2C0902.2010%2C0902.1824%2C0902.2079%2C0902.4432%2C0902.3319%2C0902.4652%2C0902.4694%2C0902.1739%2C0902.1668%2C0902.0429%2C0902.2127&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We analyze time-resolved spontaneous emission from excitons confined in\nself-assembled $\\mathrm{InAs}$ quantum dots placed at various distances to a\nsemiconductor-air interface. The modification of the local density of optical\nstates due to the proximity of the interface enables unambiguous determination\nof the radiative and non-radiative decay rates of the excitons. From\nmeasurements at various emission energies we obtain the frequency dependence of\nthe radiative decay rate, which is only revealed due to the separation of the\nradiative and non-radiative parts. It contains detailed information about the\ndependence of the exciton wavefunction on quantum dot size. The experimental\nresults are compared to the quantum optics theory of a solid state emitter in\nan inhomogeneous environment. Using this model, we extract the frequency\ndependence of the overlap between the electron and hole wavefunctions. We\nfurthermore discuss three models of quantum dot strain and compare the measured\nwavefunction overlap to these models. The observed frequency dependence of the\nwavefunction overlap can be understood qualitatively in terms of the different\ncompressibility of electrons and holes originating from their different\neffective masses."}, "authors": ["Søren Stobbe", "Jeppe Johansen", "Philip Trøst Kristensen", "Jørn M. Hvam", "Peter Lodahl"], "author_detail": {"name": "Peter Lodahl"}, "author": "Peter Lodahl", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevB.80.155307", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0902.0344v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0902.0344v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "15 pages, 14 figures", "arxiv_primary_category": {"term": "cond-mat.other", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.other", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0902.0344v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0902.0344v1", "journal_reference": null, "doi": "10.1103/PhysRevB.80.155307", "fulltext": "APS/123-QED\n\nFrequency dependence of the radiative decay rate of excitons in self-assembled\nquantum dots: experiment and theory\nSøren Stobbe,∗ Jeppe Johansen, Philip Trøst Kristensen, Jørn M. Hvam, and Peter Lodahl†\n\narXiv:0902.0344v1 [cond-mat.other] 2 Feb 2009\n\nDTU Fotonik, Department of Photonics Engineering,\nTechnical University of Denmark, Building 343, DK-2800 Kgs. Lyngby, Denmark\n(Dated: October 28, 2018)\nWe analyze time-resolved spontaneous emission from excitons confined in self-assembled InAs\nquantum dots placed at various distances to a semiconductor-air interface. The modification of the\nlocal density of optical states due to the proximity of the interface enables unambiguous determination of the radiative and non-radiative decay rates of the excitons. From measurements at various\nemission energies we obtain the frequency dependence of the radiative decay rate, which is only\nrevealed due to the separation of the radiative and non-radiative parts. It contains detailed information about the dependence of the exciton wavefunction on quantum dot size. The experimental\nresults are compared to the quantum optics theory of a solid state emitter in an inhomogeneous\nenvironment. Using this model, we extract the frequency dependence of the overlap between the\nelectron and hole wavefunctions. We furthermore discuss three models of quantum dot strain and\ncompare the measured wavefunction overlap to these models. The observed frequency dependence\nof the wavefunction overlap can be understood qualitatively in terms of the different compressibility\nof electrons and holes originating from their different effective masses.\nPACS numbers: 78.67.Hc, 42.50.Ct, 78.47.-p\n\nI.\n\nINTRODUCTION\n\nSemiconductor quantum dots (QDs) are nanoscale\nsolid state structures that provide three-dimensional\nquantum confinement of otherwise mobile charge carriers. Self-assembled QDs of InAs embedded in GaAs provide confinement for both electrons and holes in a direct\nband gap semiconductor. Hence, they are optically active\nwith the benefits of a high quantum efficiency and compatibility with existing semiconductor technology. These\nproperties make the QDs highly promising light sources\nfor novel optical devices including optical quantum information devices1 . This has led to an increasing interest in the quantum-optical properties of QDs, and major\nachievements include the demonstration of the Purcell effect for QDs in solid-state cavities2 and strong coupling\nbetween a single QD and the optical mode of a cavity3,4 .\nVery recently also electrical tuning of such quantum photonics devices was demonstrated5,6 , which is a significant\nmilestone towards practical all-solid state cavity quantum electrodynamics devices.\nDespite the recent progress, a thorough understanding of the dynamics of light-matter coupling for QDs in\nnanostructured photonic media is still lacking. Such an\nunderstanding is required for quantitative comparisons\nbetween experiment and theory. The problem is twofold, i.e. a detailed understanding of both the optical\npart and the electronic part is required. The optical part\nis described by the local density of optical states (LDOS)\nexpressing the distribution of modes that the QD can radiate to, while the electronic part is determined by the\nexciton wavefunction for the QD. Here we will investigate\nan optical system where the LDOS can be calculated exactly, and use that to extract detailed information about\nthe QD. Our experimental results are compared to a the-\n\noretical QD model, and the effect of QD size, material\ncomposition, and strain is investigated. Such quantitative comparisons of experimental data to simple theoretical QD models are much needed in order to assess the\nfull potential of QDs in nanostructured media for, e.g.,\nsingle-photon sources7 , low-threshold lasers8, or spontaneous emission control9,10 .\nWhen interpreting spontaneous emission decay curves\nfrom QDs, it is often implicitly assumed that the QDs\nprimarily decay through radiative recombination, while\nnon-radiative processes are negligible. Unfortunately,\nthis assumption is not generally valid, and omnipresent\nnon-radiative processes must be considered. Only few\nexperiments have addressed this issue. Robert et al. established an upper bound on the contribution from nonradiative processes of 25% by measuring the ratio of the\nbi-exciton to exciton emission intensity at saturation11 .\nQuantitative measurements of the radiative and nonradiative decay rates of QDs were only carried out recently using a modified LDOS both for colloidal QDs12,13\nand for self-assembled QDs14 . Precise measurements of\nthe radiative decay rates are essential since nanophotonic\ndevices rely on the ability to manipulate the radiative\nprocesses, while non-radiative recombination leads to loss\nin the system.\nAs first pointed out by Purcell15 the radiative decay\nrate of an emitter is modified inside a structured dielectric medium, which is due to the modification of the\nLDOS. In early experiments by Drexhage16 , this effect\nwas experimentally demonstrated by positioning emitters\nin the proximity of a reflecting surface. We have recently\nemployed the modified LDOS near a semiconductor-air\ninterface as a spectroscopic tool to extract radiative and\nnon-radiative decay rates and from that infer the overlap between the electron and hole wavefunctions14 . This\n\n\f2\ntechnique relies on the fact that the radiative decay rate\nis proportional to the LDOS, while the non-radiative decay rate is unaffected. In the present paper we expand on\nour previous work in particular by comparing the measured radiative decay rate to theory, which requires a\ndetailed model of the QD electron and hole wavefunctions. We have measured the radiative decay rate at\ndifferent emission energies, which reveals the dependence\nof the QD optical properties on its size. We review the\nWigner-Weisskopf theory of spontaneous emission from\nQDs, predicting an exponential decay of the exciton population and the LDOS is derived for the applied interface\ngeometry using a Green's function technique. We furthermore show that the radiative decay rate of a QD in\na homogeneous medium is proportional to the square of\nthe overlap between electron and hole wavefunctions and\ncalculate the frequency dependence of this overlap using a simple two-band model of the QD. The QD model\nis discussed in details and compared to our experimental data employing realistic parameters as input to the\ntheory. The pronounced size dependence of the electronhole wavefunction overlap is found to originate from the\ndifferences in effective mass and binding energy of the\nelectron and hole. Furthermore, we investigate three different strain models for the QD and compare their predictions to experiment thereby providing valuable insight\non the complex strain mechanisms of self-assembled QDs.\nThis paper is organized as follows: In section II\nwe present the experimental method and in section III\nthe experimental results. In section IV we discuss the\nWigner-Weisskopf model for spontaneous emission and\nderive the relation between the radiative decay rate, the\nLDOS, and the wavefunction overlap. In section V we\ncombine the analytical expressions for the radiative rate\nwith the numerical results for the wavefunction overlap\nand compare theory with experiment. Finally, we present\nconclusions in section VI.\n\nFIG. 1: (a) Schematic band diagram illustrating the spontaneous emission process in a QD. An electron is excited optically from a valence band to a conduction band wetting\nlayer (WL) state and the generated electron and hole relax\nto the lowest energy QD state on a picosecond timescale.\nThe electron can subsequently decay by either radiative or\nnon-radiative recombination with rates Γrad and Γnrad respectively. (b) Schematic illustration of the sample under\ninvestigation. InAs QDs are embedded in GaAs and positioned at different distances z to the GaAs-air interface. (c)\nThe LDOS as a function of distance z to a GaAs-air interface\nfor a dipole orientation parallel (solid curve) or perpendicular\n(dashed curve) to the interface.\n\nwhich can be expressed as17\nΓ(r, ω, ep ) = Γhom\nrad (ω)\n\nII. EXPERIMENTAL TECHNIQUE FOR\nDETERMINING THE RADIATIVE DECAY\nRATE OF QUANTUM DOTS\n\nSpontaneous emission of a photon from a QD occurs\nwhen an electron-hole pair (an exciton) recombines, as\nillustrated schematically in Fig. 1(a). As will be shown\nrigorously in section IV, the QD radiative decay rate\nΓrad (r, ω, ep ) in a structured environment is proportional\nto the projected local density of optical states (LDOS)\nρ(r, ω, ep ), where the projection is along the direction\nep of the transition momentum matrix element, which\ncorresponds to the orientation of the transition dipole\nmoment. The LDOS is modified in an inhomogeneous dielectric medium due to optical reflections at interfaces. In\nemission experiments, the total decay rate is measured,\n\nρ(r, ω, ep )\n+ Γnrad (ω),\nρhom (ω)\n\n(1)\n\nwhere ρhom (ω) is the density of optical states for a homogeneous medium, and Γnrad (ω) is the rate for nonradiative recombination. ω is the emission frequency and\nthus ~ω the emission energy, and r the position of the\nQD. Non-radiative recombination is due to intrinsic QD\nprocesses and thus independent of the LDOS. Γhom\nrad (ω) is\nthe radiative rate that the QD would exhibit in a homogenous medium without any boundaries. In our case, the\nrefractive index of the medium is n = 3.5 corresponding\nto that of GaAs. Investigating Γhom\nrad (ω) in detail provides valuable insight into the properties of the exciton\nwavefunction confined in the QD potential.\nThe exact nature of non-radiative recombination in\nQDs is not yet fully understood. It is often implicitly\nassumed that non-radiative recombination is negligible,\nbut as we will see in the following even for very weak excitation intensities this is not a valid assumption. Possible non-radiative processes include surface recombination\n\n\f3\n20\n\nSpectrometer\n\n15\n\nCounts\n\nCryostat\n\nFlip mirror\n\n(b)\n\n10\n\nPinhole\n\n5\n0\n\nCCD\n\nAPD\n\n3 4 5 6 7 8 9 10 11 12\n\nPu\nl\nlas sed\ner\n\n(a)\n\nSample\n\nHeight [nm]\n\nIII.\n\nMEASUREMENTS OF SPONTANEOUS\nEMISSION DECAY RATES NEAR A\nSEMICONDUCTOR-AIR INTERFACE\n\nThe starting point of our investigations is a GaAs wafer\ngrown by molecular beam epitaxy (MBE). The QDs were\ngrown using the Stranski-Krastranow method on a (001)\nGaAs substrate. The growth sequence was 50 nm AlAs,\n610 nm GaAs, 2.0 monolayers (MLs) InAs, 300 nm GaAs\ncap, and finally 2.0 ML InAs. The AlAs layer was included for an optional epitaxial lift-off process, which\nwas not employed here. Both InAs layers formed selfassembled QDs, but only the embedded layer was optically active because non-radiative surface recombination dominates for QDs at the surface. However, since\n\n(a)\n\n1.6\n\n-1\n\nDecay rate [ns ]\n\n1.5\n1.4\n\nIntensity [counts]\n\n1.7\n\n1.3\n\n4\n\n10\n\n3\n\n10\n\n2\n\n10\n\n0\n\n2\n\n4\n\n6\n\n8\n\n10\n\n12\n\nTime [ns]\n\n1.2\n1.1\n1.0\n0.9\n\n0.1\n\nR\n\nat the interfaces between the QD and the surrounding\nsemiconductor material, Auger processes, and trapping\nof electron and/or holes at defects18 , and any first principles calculation of these effects is a tremendous task. Reliable ways of extracting the radiative and non-radiative\nparts of the decay rate are therefore essential.\nThe radiative and non-radiative decay rates can be\nseparated by time-resolved spontaneous emission measurements if the QDs are placed in an environment with\na known LDOS, cf. Eq. (1). A planar interface between two regions with different refractive indices is the\nmost simple example of such an inhomogeneous dielectric\nmedium19 . For this particular geometry, the LDOS can\nbe calculated exactly and without any free parameters.\nHere we employ the interface between GaAs (n = 3.5)\nand air (n = 1) as illustrated in Fig. 1(b). We calculate\nthe LDOS by a Green's function technique and the results for dipole orientations parallel or perpendicular to\nthe interface are shown in Fig. 1(c). We stress that no\nassumptions need to be made about, e.g., the QD density and the excitation beam profile in order to employ\nthis experimental technique, as opposed to alternative\nways of determining the radiative decay rate such as by\nabsorption spectroscopy20,21,22 .\n\nFIG. 3: Illustration of the optical measurement setup. The\nsample is kept at 14 K in a cryostat and illuminated by a\npulsed laser. The spontaneously emitted light is collected\nand can be directed either to a CCD camera for sample alignment or to a spectrometer equipped with a fast single photon\ncounting avalanche photodiode (APD) for time-resolved measurements.\n\n2\n\nFIG. 2: (Color online) (a) Topographic atomic force micrograph depicting a surface area of 1 × 1 μm of uncapped QDs\non the unprocessed wafer. The color scale runs from 0 nm to\n20 nm. (b) Histogram of the QD height measured by analysis\nof the AFM data. The blue line is a fit to the histogram data\nusing a log-normal distribution as discussed in the text.\n\n0.0\n1.4\n\n(b)\n\n1.2\n1.0\n0\n\n50\n\n100\n\n150\n\n200\n\n250\n\n300\n\nDistance [nm]\n\nFIG. 4: (Color online) (a) Measured fast decay rate at an\nemission energy of 1.204 eV versus the distance to the interface (black and red squares, upper trace). The blue line\nshows a theoretical fit to the data using the exact expression\nfor the LDOS and Eq. (1) for a dipole orientation parallel to\nthe semiconductor-air interface. The data points marked in\nred are excluded from the fit. The lower trace shows the slow\ndecay rate which does not depend on the distance to the interface but retains a constant value given by the dashed red\nhorizontal line. Inset: Decay curves measured for two identical QD ensembles at two different distances to the interface\nat an emission energy of 1.204 eV. The data shown with\nblue squares (black triangles) are obtained for z = 109 nm\n(z = 170 nm). The red lines are fits to the data using a biexponential model and we extract the decay rates from these\nfits. (b) Values of the goodness-of-fit parameter χ2r obtained\nfor the individual bi-exponential fits. The values obtained are\nvery close to the ideal value of unity.\n\nthe QDs at the surface were fabricated under identical\ngrowth conditions as the embedded ones, the density of\nthe active QDs can be determined by atomic force microscopy (AFM) of the sample surface. Such an atomic\nforce micrograph is shown in Fig. 2(a). The image contains detailed information about the geometry and height\n\n\f4\n1.7\n\nQuantum dot height [nm]\n\n(a)\n\n-1\n\nDecay rate [ns ]\n\n1.6\n\n5.6\n\nDecay rate [ns ]\n\n-1\n\n1.4\n1.3\n1.2\n1.1\n1.0\n0.9\n0.8\n0.80\n\n0.85\n\n0.90\n\n0.95\n\n(z,\nCorrelation |r|\n\n5.2\n\n5\n\n4.8\n\n4.6\n\n4.4\n\n4.2\n\n4\n\n1.2\n\n1.5\n\n1.00\n\n)/\n\nhom\n\n1.05\n\n(\n\n1.10\n\n1.15\n\n)\n\n1.1\n\n1.0\n\n0.9\n\n0.8\n\n0.2\n\n0.1\n\n0.0\n1.16\n\n1.00\n0.95\n\n5.4\n\n(b)\n\n1.18\n\n1.20\n\n1.22\n\n1.24\n\n1.26\n\n1.28\n\nEmission energy [eV]\n\n0.90\n0.85\n0.80\n0\n\n2\n\n4\n\n6\n\n8\n\n10\n\n12\n\n14\n\n16\n\n18\n\n20\n\n22\n\n24\n\n26\n\n28\n\nPoints excluded\n\nFIG. 5: (Color online) (a) Measured decay rate at an emission energy of 1.204 eV versus the normalized LDOS (black\nand red squares) for a dipole orientation parallel to the\nsemiconductor-air interface. The red line shows a linear fit\nwhere only the black points have been included. The red\npoints have been omitted because at these distances from the\ninterface a systematic deviation from theory was observed, as\nquantified by the data in the lower panel. (b) Correlation between data and theory for the linear regression when systematically excluding the points nearest the interface in the fit.\nThe correlation parameter converges to a value close to unity\n(dashed blue line) when seven points have been excluded.\n\n2.2\n\nFIG. 7: (Color online) (a) The total decay rate (red squares),\nradiative decay rate (black triangles) and non-radiative decay\nrate (blue circles) as a function of QD emission energy. The\nradiative rate decreases with energy but the non-radiative rate\nsimultaneously increases so that the total (measured) decay\nrate increases with increasing energy. The solid black line is\nthe result of the theoretical model of the radiative decay rate\nusing an aspect ratio of 1/2, omitting the wetting layer, and\nfor an indium mole fraction of 0.95. The top scale shows the\nheights used in the calculation. The details of this calculation\nare presented in section V.\n\nof the QDs at the surface, but the topography of the surface is convolved with the AFM tip shape function, and\nthus the width and exact geometry of the QDs cannot\nbe extracted directly. The maximum height, however, is\nnot subject to this effect and we used the AFM data in\nFig. 2(a) to obtain a histogram of the heights recorded\nfor 100 randomly selected QDs. The result is shown in\nFig. 2(b). We fit the height histogram by\u0010a log-normal\n\u0011\n2\n\n-1\n\nDecay rate [ns ]\n\n2.0\n\n1.8\n\n1.6\n\n1.4\n\n1.2\n\n1.0\n\n0.8\n0\n\n50\n\n100\n\n150\n\n200\n\n250\n\n300\n\nDistance [nm]\n\nFIG. 6: (Color online) Decay rates as a function of distance\nto the interface for six different emission energies. Each curve\nhas been vertically offset by 0.1 ns−1 for visual clarity. The fits\nhave been obtained using a systematic exclusion of data points\nnear the interface, cf. Fig. 5(b). The emission energies are\n1.170 eV (solid black squares), 1.187 eV (open black squares),\n1.204 eV (solid red circles), 1.216 eV (open red circles), 1.252\neV (solid blue diamonds), and 1.272 eV (open blue diamonds).\nFor all emission energies we note the excellent agreement with\ntheory for z > 75 nm.\n\n0\ndistribution given by f (h) = σ√h2πh\nexp − (ln(h)−μ)\n2σ2\nwith h0 = 68, σ = 0.32, and μ = 1.9, where h is a dimensionless length scale normalized to 1 nm. We find an\naverage aspect ratio defined as the height to lateral base\ndiameter ratio of 1/3.6, but due to the convolution effect\nthis is an upper bound. Since the transition energy of a\nQD depends sensitively on its height, the height distribution function is central when testing theoretical models of\nthe emission spectrum against experiments, as discussed\nin section V.\nFrom the AFM data we found a QD density of 250\nμm−2 , which corresponds to an average interdot distance\nof 60 nm. This number should be compared to typical\nlength scales for various relevant QD interactions. Carrier tunneling is negligible for distances beyond 15 nm23\nand the dipole-dipole interaction is only significant for\ndistances close to the Förster radius, which is typically\n2-9 nm17 . Therefore the measurements performed here\nprovide ensemble averaged values of single QD properties\nwith the advantage of an excellent signal-to-noise ratio in\nthe measurements.\nThe wafer was processed by standard UV lithography\nand wet chemical etching in five subsequent steps with\n\n\f1.20\n\n1.16\n\n1.12\n\n1.12\n\n1.08\n\n1.08\n\n1.04\n\n1.04\n\n1.00\n\nIntensity\n\n1.0\n\n(z=302 nm,\n\n)/\n\n1.16\n\nhom\n\n(\n\n(a)\n\n-1\n\nDecay rate [ns ]\n\n1.20\n\n)\n\n5\n\n1.00\n\n(b)\n\n0.8\n0.6\n0.4\n0.2\n0.0\n1.16\n\n1.18\n\n1.20\n\n1.22\n\n1.24\n\n1.26\n\n1.28\n\n1.30\n\nEmission energy [eV]\n\nFIG. 8: (Color online) (a) The fast decay rate obtained from\nmeasurements on the unprocessed wafer (solid black squares)\nand the total decay rate in a homogenous medium (open red\ncircles) obtained using the rigorous separation of radiative\nand non-radiative homogeneous decay rates. Evidently, the\nfrequency dependence of the normalized LDOS (solid blue\nline) for the unprocessed wafer (z = 302 nm) results in faster\ndecay rates for QDs on the unprocessed wafer than would be\nthe case in a homogeneous medium. (b) The (normalized)\ninhomogeneously broadened emission spectrum of the QDs\nobtained under weak excitation.\n\nnominal etch depths of 160 nm, 80 nm, 40 nm, 20 nm, and\n10 nm by which we obtained 32 fields with specific distances from the QDs to the semiconductor surface. The\n32 fields were nominally equidistantly spaced with 10 nm\nspacing. The wet etching was done using an etchant comprised of H3 PO4 (85%), H2 O2 (30%), and H2 O in the\nratio 3 : 1 : 60, which has an etch rate on GaAs at room\ntemperature of 1 nm/s. We found that this etchant results in surfaces of good optical quality with low surface\nroughness. A schematic illustration of the resulting sample is shown in Fig. 1(b). Finally we measured the actual\ndistance from the QDs to the semiconductor surface by\nusing a combination of secondary ion mass spectroscopy\nand surface profiling from which we found typical depth\nuncertainties of ±3.0nm.\nThe experimental setup is illustrated in Fig. 3. The\nsample was kept at 14K and irradiated by a mode-locked\nTi:sapphire laser emitting 300 fs pulses at 1.45 eV, which\ncorresponds to excitation of the wetting layer states of\nthe QD ensemble. The repetition rate was 80 MHz and\nwe used an excitation intensity of 7 kW/cm2 , which corresponds to less than 0.1 excitons per QD generated in\nthe wetting layer per pulse, i.e. only the QD ground\nstate is populated. Excitation of the WL states is advantageous since the same density of excitons is generated\nindependent of sample thickness, which would not be the\ncase for excitation in the GaAs barrier since the samples\nhave different thicknesses. The pump configuration is illustrated in Fig. 1(a). The spontaneous emission from\nthe QD ensemble was collected and then dispersed by\n\na monochromator with a spectral resolution of 2.6 meV\nfrom which it was directed onto a fast silicon avalanche\nphotodiode (APD).\nRepresentative examples of two decay curves obtained\nfor two different distances to the interface are shown in\nthe inset of Fig. 4(a). We model our data with a biexponential decay and typically find a goodness-of-fit parameter χ2r 24 of 1.2, which is close to the ideal value of\nunity, thus confirming the validity of the model. The important parameter extracted from the fit is the fast decay\nrate, which is due to recombination of bright excitons in\nthe QD, i.e., it equals the total decay rate discussed in\nthe previous section.\nWe measured the decay curves for 32 nominally\nequidistantly spaced distances to the interface. We found\nthat for the two distances closest to the interface there\nwas no detectable spontaneous emission due to the very\nclose proximity of the interface and/or damage by the\netching process. In Fig. 4(a) we show the extracted fast\ndecay rates (upper trace) versus the measured distance\nfrom the QDs to the interface for the remaining 30 samples. As shown in Fig. 4(b) we obtain values of χ2r near\nunity for the bi-exponential fits for all distances. The\nsolid blue curve is a fit to the fast decay rates using the\ncalculated LDOS for a dipole oriented parallel to the interface. When omitting the seven data points closest to\nthe interface, as discussed in detail below, we find an excellent agreement with theory. Since the slow rate (lower\ntrace) does not depend on the distance to the interface\nand therefore does not depend on the LDOS it must be\ndominated by non-radiative decay. It is attributed as due\nto the recombination of dark excitons and the dynamics\nwill be the subject of a future publication25 . In the remainder of this paper we will consider only the fast decay\nrate.\nWhen plotting the fast decay rates as a function of\nthe LDOS normalized to the density of states of a homogeneous medium, a linear dependence is expected, see\nFig. 5(a). However, close to the interface (z ≤ 75nm) the\nmeasured decay rate is found to be systematically larger\nthan expected by theory. This deviation could be due to\nenhanced recombination rates induced by, e.g., scattering\nor impurities at the semiconductor surface. In order to\nexclude these effects in our analysis of intrinsic QD properties, we systematically excluded the data points closest\nto the interface in the fit. We found that the linear regression correlation parameter26 obtained from the fit in\nFig. 5(a) saturated close to the ideal value of unity when\nexcluding the seven innermost data points, see Fig. 5(b).\nThese points were consequently abandoned in the analysis. For distances z ≥ 75nm we find an excellent agreement between theory and experiment, which allows reliable extraction of the radiative and non-radiative rates\nof the QDs.\nThe linear fit in Fig. 5(a) is based on Eq. (1) and\ncontains two free parameters, namely the homogeneous\nradiative decay rate Γhom\nrad and the non-radiative decay\n−1\nrate Γnrad . We obtain Γhom\nand\nrad = 0.95 ± 0.03ns\n\n\f6\nΓnrad = 0.11±0.03ns−1 at an emission energy of 1.204eV.\nFor reference, the theoretical curve for a dipole oriented\nperpendicular to the interface (i.e. parallel to the growth\ndirection) is shown in Fig. 1(c). Clearly, this model\ncannot fit the experimental data, which confirms that\nthe QDs are oriented in the plane perpendicular to the\ngrowth direction, which was previously established by absorption measurements27 . We measured the decay curves\nat six energies across the inhomogeneously broadened\nemission spectrum. When extracting the fast rate from\nthe fits, we obtain the curves shown in Fig. 6. The different emission frequencies shift the curves along the abscissa and more importantly the amplitude and ordinate\noffsets are changing, which corresponds to changes in Γrad\nand Γnrad . This shows directly the frequency dependence\nof Γhom\nrad and Γnrad , which will be discussed below.\nThe total decay rate in a homogeneous medium was\nextracted from Fig. 6 by the method outlined above and\nthe result is shown in Fig. 7(a). The total decay rate increases with increasing emission energy, which could suggest that the radiative rate increases with energy, as has\nbeen reported for colloidal QDs28 . However, the opposite\nturns out to be true for self-assembled QDs. In this case,\nΓhom\nrad (ω) is found to decrease with increasing energy, and\nthe overall increase in the total rate is due to the pronounced increase in Γnrad (ω) with emission energy. It\nshould be stressed that such variations in the radiative\nrate can be assessed only because a modified LDOS is employed allowing to separate radiative and non-radiative\ncontributions. The striking energy dependence of the\nradiative rate can be explained as being due to the dependence of the electron and hole wavefunctions on the\nsize of the QD, which will be discussed and analyzed in\ndetail in section V.\nHere we want to stress some potential pitfalls in the interpretation of the frequency dependence of spontaneous\nemission decay rates from QDs. As already pointed out,\nit is decisive to include the effects of non-radiative recombination and implement a technique that allows to\nseparate it from radiative recombination. Thus, an a\npriori assumption of negligible non-radiative recombination would erroneously lead to the conclusion that the\nradiative rate increases with energy. Furthermore, when\nextracting quantitative data for the QD decay rates, one\nhas to be aware of the possible influence of the presence\nof interfaces. In a homogeneous medium the LDOS is\nproportional to the emission energy squared, but this is\nnot the case in proximity of interfaces. In Fig. 8(a) we\ncompare the measured total decay rate versus emission\nenergy for an unprocessed wafer and compare to the total\nrate that QDs in a homogeneous medium would exhibit.\nThe latter has been obtained using the LDOS technique\nexplained above and provides \"undisturbed\" QD properties. For the unprocessed wafer, the distance to the\ninterface is 302 nm, and for this distance the LDOS increases with increasing energy, cf. the solid blue line in\nFig. 8(a). This frequency dependence of the LDOS modifies the measured emission rates, which should be taken\n\ninto account, and is an example of the importance of\nconsidering nearby interfaces in quantitative assessment\nof QD properties. Experimentally this issue could be\nsolved by growing a very thick capping layer on top of\nthe QDs.\n\nIV. THEORETICAL DESCRIPTION OF\nSPONTANEOUS EMISSION FROM QUANTUM\nDOTS DUE TO INTERACTION WITH THE\nQUANTIZED ELECTROMAGNETIC FIELD\n\nIn this section, we give a theoretical description of the\nradiative decay of excitons in QDs. For sufficiently small\nQDs, the energy difference between bound states in the\nQDs is much larger than the Coulomb energy and the\neffect of the Coulomb interaction on the internal exciton dynamics becomes negligible29 . This means that the\nelectron and hole comprising the exciton may be considered independent, which is the strong confinement model.\nFurthermore, we employ here a two-band description of\nthe QD including the effects of a wetting layer and strain,\nwhich is sufficient to capture the essential properties of\nQDs30,31 . Our objective here is to explore the validity\nof this model by a thorough comparison to our measurements of the radiative decay rate and the emission spectrum, which is carried out in section V. Thorough explorations of even simple QD models are much needed since\ncomplete microscopically correct QD models are outside\nreach both due to the lack of experimental knowledge\nabout exact atomic composition and computational complexity.\nSpontaneous emission occurs due to the interaction of\nthe exciton with the continuum of vacuum modes. A rigorous description of spontaneous emission requires a fully\nquantum description where both the radiation field and\nthe exciton states in the QD are quantized. We employ\nhere the Wigner-Weisskopf model of spontaneous emission, which is valid when the LDOS varies slowly with\nfrequency over the linewidth of the QD. This is an excellent approximation for the dielectric structures investigated here, but may break down for QDs in photonic\ncrystal leading to intricate non-Markovian dynamics32 .\nThe radiative coupling strength is determined by the\nelectron momentum matrix element and depends furthermore sensitively on the overlap between the electron and\nhole envelope wavefunctions that in turn gives rise to the\nfrequency dependence of the radiative decay rate. We derive here this frequency dependence, which will be compared in detail to the experimental data in section V.\n\nA.\n\nWigner-Weisskopf theory of spontaneous\nemission from quantum dots\n\nAccording to effective mass theory, the solution to the\nSchrödinger equation for an electron in a solid is given\nby Ψn (r) = Fn (r)un,0 (r), where Fn (r) is the envelope\n\n\f7\n\nFIG. 9: Schematic illustration of the QD geometry used to\ncalculate the envelope wavefunctions. We consider a lensshaped QD with lateral base diameter D and height h consisting of Inc Ga1−c As on a wetting layer (WL). The symmetry\naxis z is indicated along with the radial directions x, y.\n\nfunction, un,0 (r) is the Bloch function evaluated at the\nband edge q = 0, and n ∈ {c, v} denotes the conduction\n(c) or valence (v) band. The envelope function is the\nsolution to the effective mass Schrödinger-like equation\ngoverned by the Hamiltonian33\nH0 (r) = Hkin,n + Vn (r),\n\n(2)\n\nwhere Hkin,n is the kinetic energy operator, and Vn (r) is\nthe band confinement potential. Here we consider lensshaped QD geometries as shown in Fig. (9). For the\nconduction band the effective mass is isotropic, so that\n~2\nHkin = − 2m\n∇ * mn1(r) ∇, where m0 is the elementary\n0\nelectron mass and mn (r) is the effective mass. For the\nvalence band the anisotropy of the effective mass must be\ntaken into account, which is discussed in Appendices A\nand B.\nFor the valence band mv < 0 and Vn (r) < 0, which\nleads to negative eigenenergies. In the electron-hole\nrepresentation34 we define the hole in the valence band as\na particle with positive effective mass mh (r) = −mv (r)\nsubject to a positive confinement potential Vh (r) =\n−Vv (r) yielding positive eigenenergies. Clearly, the envelope function remains the same in the new representation, i.e. Fh (r) = Fv (r). For III-V semiconductors\nthe valence band is comprised of degenerate bands with\ndifferent effective masses. However for QDs strain lifts\nthis degeneracy and we may consider the valence band\nas a single band (the heavy hole band). We discuss details of the band structure in the presence of strain in\nAppendix A.\nWe describe the light-matter interaction by the Hamiltonian H ′ (r, t) = − mq0 p * A(r, t), where q is the elementary charge, p is the momentum operator and A(r, t)\nis the vector potential of the quantized electromagnetic\nfield. The latter is given by35,36\nX ǫμ\n\u0001\nA(r, t) =\nêμ Aμ (r)aμ e−iωμ t + A∗μ (r)a†μ eiωμ t .\nω\nμ\nμ\n(3)\n\nHere μ = (k, s) is the combined wavevector k and polarization index\nq s ∈ {1, 2}, ωμ is the optical angular frequency, ǫμ =\n\n~ωμ\n2ǫ0\n\nis a normalization constant with ǫ0\n\ndenoting the vacuum permittivity, êμ is a unit vector\nin the direction of the polarization s, Aμ (r) is the spatial field distribution function, and aμ and a†μ are the\nfield annihilation and creation operators, respectively. In\na homogeneous medium the field distribution functions\neik * r\n, where ǫr = n2 is\nare given by plane waves Aμ (r) = √\nǫr V\nthe relative static permittivity of the material. We will\nbe working in the Coulomb gauge in which the scalar\npotential of the electromagnetic field is zero and the divergence of the vector potential vanishes.\nWe consider the initial state |ii = |ci ⊗ |0i with\n|ci = Fe (r)|uc,0 i corresponding to a QD with one electron promoted to the conduction band and no photons\nin the radiation field. The final state relevant for spontaneous emission is |fμ i = |vi ⊗ |1μ i with |vi = Fh (r)|uv,0 i,\nwhere a photon is radiated to the mode μ while the\nexcited electron has decayed to the valence band. We\nhave deliberately not written the spatial dependence of\n|ci and |vi for visual clarity. We can expand the interaction Hamiltonian by insertion of complete sets to\nobtain an expression containing the raising and lowering\noperators of the electronic system, which we define as\nσ+ = |cihv| and σ− = |vihc|, respectively. It is convenient to change to the interaction picture, in which the\ntime-evolution of the raising and lowering operators are\ngiven by σ̃+ (t) = σ+ eiω0 t and σ̃− (t) = σ− e−iω0 t , where\nwe have introduced the energy of the exciton transition\n~ω0 . Furthermore, assuming that the spatial distribution\nfunctions are slowly varying on the scale of the wavefunctions they can be evaluated at the center position r0 of\nthe QD, which is the dipole approximation. The interaction Hamiltonian in the interaction picture now reads\nH ′ (r0 , t) =\nX ǫμ\nq\n−\nhc|p|viσ+ *\nêμ Aμ (r0 )aμ e−i∆μ t\nm0\nω\nμ\nμ\nX ǫμ\nq\nhv|p|ciσ− *\nêμ A∗μ (r0 )a†μ ei∆μ t ,\n−\nm0\nω\nμ\nμ\n\n(4)\n\nwhere ∆μ = ωμ − ω0 and we have omitted the two terms\nproportional to e±i∆μ t since they are rapidly oscillating\nas a function of time, which is the rotating wave approximation.\nThe general state vector of the system can be expanded\nas\nX\n|Ψ(t)i = ce (t)|ii +\ncμ (t)|fμ i,\n(5)\nμ\n\nand inserting into the Schrödinger equation in the interaction picture leads to the following equation of motion35\nd\nq2\n|hv|p|ci|2\nce (t) = −\ndt\n2~m20 ǫ0\n(6)\nZ ∞\nZ t\nρ(r0 , ω, êp ) −i(ω−ω0 )(t−t′ )\n′\n′\ne\ndω\ndt ce (t )\n×\nω\n−∞\n0\nwhere we have included an integration over a Dirac delta\nfunction in frequency, and assumed that the momentum\n\n\f8\nmatrix element is constant within the linewidth of the\nQD. ρ(r0 , ω, êp ) is the projected LDOS defined as\nX\nρ(r0 , ω, êp ) =\n|êp * êμ |2 |Aμ (r0 )|2 δ(ω − ωμ ), (7)\nμ\n\nwhere êp is the unit vector specifying the direction of\nhv|p|ci. This direction is determined by the Bloch matrix element as discussed below. Since ρ(r0 , ω, êp )/ω in\nEq. (6) is slowly varying over the linewidth of the emitter\nso that it can be evaluated at the emission frequency ω0\nand taken outside the integral. In this case the QD population decays exponentially |ce (t)|2 = e−Γrad (r0 ,ω0 ,êp )t\nwith the radiative decay rate given by\nΓrad (r0 , ω0 , êp ) =\n\nπq 2\n2 ρ(r0 , ω0 , êp )\n|hv|p|ci|\n.\n~m20 ǫ0\nω0\n\n(8)\n\nThis is the Wigner-Weisskopf result for spontaneous\nemission from solid-state emitters. It states that the radiative decay rate is proportional to the projected LDOS\nand the momentum matrix element. In the following subsection, we discuss the evaluation of these two terms. In\nthe experiment, the number of photons emitted per time\nis measured, which is given by\nN (t) = αΓrad e−(Γrad +Γnrad )t ,\n\n(9)\n\nwhere additionally the rate for non-radiative recombination has been added, and α is an overall scaling parameter determined by the detection efficiency and the total\nnumber of photons recorded during the measurement period.\nB.\n\nEvaluation of the projected LDOS and the\ntransition matrix element\n\nThe projected LDOS can be calculated using a Green's\nfunction technique. In terms of the Green's tensor\nG(r, r′ , ω), the projected LDOS is given by17,37\nρ(r, ω, êp ) =\n\n2ω\n(êp * Im (G(r, r, ω)) * êp ) ,\nπc20\n\n(10)\n\nwhere c0 is the speed of light in vacuum. The LDOS\nis a classical electromagnetic quantity obtained by solving Maxwell's equations. However, it enters the quantum optical theory of light-matter interaction where it\ndescribes the local density of vacuum modes that spontaneous emission can occur to. For the particular case\nof a semiconductor-air interface as considered here, the\nGreen's tensor is obtained by solving the following closed\nexpression17,38\nZ ∞\ni\nkρ\n(11)\nG(r, r, ω) =\ndkρ (M0 + Mr ),\n2\n8πk 0\nkz\nwhere\n\n2k 2 − kρ2\n0\n0\n\n0\n2k 2 − kρ2\n0\nM0 = \n0\n0\n2(k 2 − kz2 )\n\n\n(12)\n\nand\n\n(k 2 rs − kz rp )\n0\n0\n e2ikz z .\n0\n(k 2 rs − kz2 rp )\n0\nMr = \n0\n0\n(2kρ2 rp )\n(13)\n\n\nHere k = |k|, where k = (kρ , kz , kφ ) is the k-vector in\ncylindrical coordinates, z is the distance from the QD\nto the interface, and rs (rp ) is the Fresnel reflection coefficient for s-polarized (p-polarized) light17 . The result\nof the calculation for a GaAs-air interface is shown in\nFig. 1(c)\nWe now consider the transition matrix element. Using\nthe fact that the momentum operator is a differential\noperator (p = −i~∇), that the Bloch functions uc/v,0 (r)\nare orthogonal, which we will describe below, and that\nthe envelope functions are slowly varying on the scale of\na lattice parameter39, we obtain\n|hv|p|ci|2 ≈ |hFh |Fe i|2 |huv,0 |p|uc,0 i|2\nm0 Ep (c)\n2\n.\n≡ |hFh |Fe i| ×\n2\n\n(14)\n\nThis important result states that the transition matrix\nelement is given by the product of the electron and hole\nwavefunction overlap and the squared Bloch matrix element |huv,0 |p|uc,0 i|2 . The magnitude of the Bloch matrix\nelement is a material parameter that is expressed in terms\nof the Kane energy Ep (c)39 . c is the indium mole fraction\nin the Inc Ga1−c As alloy. The\nIn the Kane model18,40 the valence band Bloch functions are written as linear combinations of the basis functions |ux i, |uy i, and |uz i that carry the symmetry properties of p-orbitals. The specific linear combination depends on the q-vector of the envelope function. QDs\ngrown by the Stranski-Krastanov technique are typically\nflat structures placed on top of a wetting layer, and\nquantization along the growth direction (z) is therefore\ndominating41 . As a consequence we can set qx = qy = 0,\nwhich is exact in the limit of a quantum well, leading\nto q = |q|êz . In this case the heavy hole Bloch function\ncan be written as |uv,0 i = |uhh i = √12 (|ux i ± i|uy i). The\nconduction band Bloch function has s-symmetry, so the\nBloch functions for the valence and conduction bands are\northogonal as was used above. Furthermore, this means\n2\nthat the matrix element |huv,0 |p|uc,0 i| is non-zero only\nfor px and py from which we conclude that the dipole\naxis of the QD is perpendicular to the growth direction\nin agreement with our experiment.\nC.\n\nFrequency dependence of the radiative decay\nrate of quantum dots\n\nWe are now in a position to put together the results\nof the previous sections and calculate the frequency dependence of the spontaneous emission decay rates in a\nhomogenous medium. By insertion of Eq. (7) in Eq. (8)\n\n\f9\nand using the plane wave expression for the field distribution functions we readily obtain\n\n16\n\nnq\n2\nEp (c)ω |hFh (ω)|Fe (ω)i| .\n=\n6π~m0 c30 ǫ0\n\n2\n\n<\n\nΓhom\nrad (ω)\n\n2\n\n(16)\n\nHere we have indicated explicitly that the envelope wavefunctions depend on the emission energy since varying\nthe QD size, and thereby the emission energy, leads to\nmodifications of the wavefunctions. This effect will be\ndiscussed in detail in section V. Eq. (16) is the key result used to interpret the experimental measurements of\nthe radiative decay rate presented in this paper. It furthermore allows extracting an experimental value for the\noverlap between the electron and hole wavefunctions.\n\n12 10 9\n\n8\n\n7\n\n6\n\n5\n\n4\n\n3\n\n(a)\n\n0.8\n0.6\n0.4\n0.2\n0.0\n\ne\n\nThe sum over all optical modes μ can be converted to\nan integration over all k-vectors where the dispersion relation for a homogeneous medium ωμ = kμ c0 /n is used.\nThe sum over polarizations yields a factor of 2. Using\nalso Eq. (14) we obtain the important relation\n\n>\n\nX\n1\nπq\n(15)\n2 1\n|êp * êμ |2 δ(ω − ωμ ).\n|hv|p|ci|\n2\n~m0 ǫ0 ǫr V\nω0 μ\n\nh\n\n=\n\nIntensity\n\n1.0\n\n| F ( )|F ( ) |\n\nΓhom\nrad (ω)\n2\n\nQuantum dot height [nm]\n\n0.9\n0.8\n\n(b)\n\n0.7\n0.6\n0.5\n0.4\n0.3\n1.15\n\n1.20\n\n1.25\n\n1.30\n\nEmission energy [eV]\n\nFIG. 10: (Color online) (a) Measured spontaneous emission\nspectrum (black curve, normalized) and calculated spectrum\n(red curve) using the height distribution of the QDs from\nFig. 2(b) and implementing strain model 1. The resulting\nparameters have been optimized to fit the spectrum, and we\nfind an aspect ratio of 1/6 and an indium mole fraction in the\nQD of 39%. (b) Measured electron-hole wavefunction overlap\n(black squares) and the theoretical calculation (solid red line)\nusing the same parameters as in (a).\n\nV. COMPARISON BETWEEN EXPERIMENT\nAND THEORY FOR THE ELECTRON-HOLE\nWAVEFUNCTION OVERLAP\n\n0.80\n0.75\n\n0.55\n0.50\n\n<F\n\ne\n\n(\n\n0.45\n0.40\n0.35\n0.30\n\nEmission energy [eV]\n\n0.60\n\nh\n\n)\n\n0.65\n\n)|F (\n\n>|\n\n2\n\n0.70\n\n|\n\nIn this section we calculate the electron-hole wavefunction overlap and the QD emission spectrum and compare\nto our experimental results. We investigate to what extent the QD heights obtained from AFM measurements\nof uncapped QDs, cf. Fig. 2, can be used as input to\nthe models. Furthermore, we systematically test the\nmodel with experiment by varying parameters such as\nthe indium mole fraction, the QD aspect ratio, the wetting layer thickness, and the applied strain model within\nphysically realistic boundaries. The model nicely reproduces the decrease of the electron-hole wavefunction overlap with energy that we observed experimentally. However, our investigations lead to the conclusion that further knowledge of QD composition and more involved QD\nmodels would be required in order to reach full quantitative agreement between experiment and theory.\nWe describe the QD in the (ρ, z)-plane as one quarter\nof an ellipse with a fixed aspect ratio. Here ρ denotes\nthe radial direction in cylindrical coordinates. The QD\ngeometry is solved numerically in a large simulation area\nwhich spans 160 nm in the ρ-direction and 80 nm in the\nz-direction ensuring that the proximity of the boundaries\nhave no effect on the results. Further details on the numerical procedure is provided in Appendix B. We use\nthe commercial finite element software package COMSOL with an adaptive mesh to solve the effective mass\nequation (Eq. (B3)). For each QD height we obtain the\n\n0.25\n0.20\n1.16\n\n1.4\n\n1.3\n\n1.2\n\n1.1\n\n2\n\n3\n\n4\n\n5\n\n6\n\n7\n\n8\n\nQuantum dot height [nm]\n\n1.18\n\n1.20\n\n1.22\n\n1.24\n\n1.26\n\n1.28\n\nEmission energy [eV]\n\nFIG. 11: (Color online) Calculated energy dependence of\nthe squared electron and hole wavefunction overlap using the\nthree different strain models discussed in the text. The QD\naspect ratio is 1/2 and no wetting layer was included. The\ncurves are calculated for strain model 1 with c = 0.51 (blue\nline), strain model 2 with c = 0.95 (red line) and strain model\n3 with c = 0.46 (black line). The data points show the experimentally determined wavefunction overlap for these three\nindium mole fractions using the same color coding. Clearly,\nstrain model 1 does not describe the experimental data well,\nwhile both models 2 and 3 lead to very good agreement. The\ninset shows the dependence of the QD emission energy on\nheight for the three different models using the same color\ncoding as in the main figure.\n\n\f10\n0.8\n\n2\n\n0.7\n\n)\n\n>|\n\n0.6\n\nh\n\n)|F (\n\n0.5\n0.4\n6 ML\n\n0 ML\n\n|\n\n<F\n\ne\n\n(\n\n0.3\n0.2\n0.1\n0.0\n1.05\n\n1.10\n\n1.15\n\n1.20\n\n1.25\n\n1.30\n\n1.35\n\n1.40\n\n1.45\n\nEmission energy [eV]\n\nFIG. 12: (Color online) The effect of the thickness of the wetting layer on the calculated electron-hole wavefunction overlap\nwhen varying between 0 ML and 6 ML in steps of 1 ML. Here\nwe have omitted strain and otherwise used the same parameters as in Fig. 11. The experimental data for c = 0.46 are\nshown as black squares.\n0\n8\n\n2\n\n4\n\n6\n\n8\n\n10\n\n(a)\n\n2\n\n4\n\n6\n\n8\n\n10\n\n12\n8\n\n(b)\n\n6\n\n6\n\n4\n\n4\n\n2\n\n2\n\n0\n\n0\n\n-2\n\n-2\n\n0.1200\n\nz [nm]\n\n0.0900\n\n0.0600\n\n0.0300\n\n0\n10\n\n(c)\n\n(d)\n\n8\n\n8\n\n6\n\n6\n\n4\n\n4\n\n2\n\n2\n\n0\n\n0\n\n0.0500\n\nz [nm]\n\n0.0375\n\n0.0250\n\n0.0125\n\n0\n-2\n\n-2\n0\n\n2\n\n4\n\n6\n\n8\n\n[nm]\n\n10\n\n2\n\n4\n\n6\n\n8\n\n10\n\n12\n\n[nm]\n\nFIG. 13: (Color online) Color plots in the radial plane of the\namplitude of the wavefunction for electrons and holes. The\nparameters corresponding to the calculation for strain model\n2 in Fig. 11 were used. (a) Electron wavefunction for a QD\nheight of 4 nm. (b) Hole wavefunction for a QD height of\n4 nm. (c) Electron wavefunction for a QD height of 8 nm.\n(d) Hole wavefunction for a QD height of 8 nm.\n\ntransition energy and given the height distribution function measured by AFM, c.f. Fig. 2, we calculate the\nemission spectrum.\nThe fact that we observe transitions involving heavy\nholes motivates a further investigation of the analogy between QDs and quantum wells. In particular the effect of\nstrain on the electronic level structure is well-understood\nfor quantum wells18 . Strain has a significant effect on\nthe level structure also for QDs, but is often discussed\nin qualitative terms only due to the mathematical complexity and lack of experimental input on the exact QD\n\ngeometry and composition. Thus, we will in the following attempt to model the strain properties of the QD\nsimilar to the case of a quantum well and compare the\nresults to experiment. In a quantum well of InGaAs in\nGaAs the compressive strain in the plane of the quantum\nwell leads to an expansion in the direction perpendicular to the plane. This biaxial strain can be decomposed\ninto a hydrostatic and a shear component. However, as\nopposed to the case of a quantum well a QD cannot expand freely in the growth direction which suggests that\nthe hydrostatic component may dominate. Therefore, we\ncompare three different strain models including: 1) hydrostatic and shear strain, 2) only hydrostatic strain, and\n3) no strain. Strain modifies the band offsets and the valence band effective masses, which is discussed in further\ndetail in Appendix A.\nUsing the experimental data on both the QD height\ndistribution function, the emission spectrum, and the\nfrequency dependence of the wavefunction overlap, we\nexplore experimentally realistic parameters in order to\nmatch our experimental data. The first approach is to\nuse the measured QD height distribution of Fig. 2 and\ninclude both shear and hydrostatic strain. Using optimized parameters corresponding to an aspect ratio of\n1/6 and an indium mole fraction of 39% we find a very\ngood agreement with the emission spectrum, as shown in\nFig. 10(a). The electron-hole wavefunction overlap extracted from the radiative decay rate offers an additional\ntest of this parameter set. In Fig. 10(b) the experimentally determined wavefunction overlap is plotted along\nwith the resulting theory42 . The theory predicts correctly\nthat the wavefunction overlap decreases (increases) with\nemission energy (QD size), and the mechanism behind\nthis effect is discussed in detail below. However, a clear\nsystematic deviation between theory and experiment is\nobserved, which turns out to be the case for all three\nstrain models provided that the model parameters are\nconstrained to optimally reproduce the measured spectrum. We conclude from this result that the measured\nheight distribution of uncapped QDs is not very useful in\ndetermining the actual confinement volume of the overgrown QDs that the experiments are performed on. This\nis due to complex redistribution and intermixing processes of indium and gallium will occur during growth\nand subsequent regrowth43,44 , which are likely to modify\nthe QD confinement potential and strain significantly.\nThus abandoning at this point the interpretation of\nthe measured height distribution, which is closely related\nto the emission spectrum, we focus on the electron-hole\nwavefunction overlap. Keeping the aspect ratio fixed at\na realistic value of 1/2 and excluding for the moment the\nwetting layer, we obtain the overlap shown in Fig. 11.\nHere the only free parameter is the mole fraction of indium c in the QD and the different strain models are compared. Note that the experimentally determined wavefunction overlap depends on c, since it enters through\nthe Kane energy, cf. Eq. (16). We find that including both shear and hydrostatic strain leads to a disagree-\n\n\f11\nment between experiment and theory. This demonstrates\nthat the strain model developed for quantum wells fails\nin the case of QDs, which is sometimes assumed in the\nliterature33 . Good agreement between experiment and\ntheory can be obtained when including only hydrostatic\nstrain or no strain at all for c = 0.95 and c = 0.46,\nrespectively. Judging from experiments available in the\nliterature43,44 both these values of c are reasonable for\novergrown QDs, so there is no support for favoring one\nof the two surviving strain models. We are led to the conclusion that in particular shear strain is less significant for\nQDs compared to quantum wells, although further microscopic details of QD composition and geometry would be\nrequired for a further investigation of these issues.\nFigure 12 investigates the effect of the wetting layer\nthickness on the wavefunction overlap. In this case strain\nis omitted, the aspect ratio is 1/2, and the indium mole\nfraction 0.46. We find that for wetting layer thicknesses\nbelow 4 monolayer (ML) the wavefunction overlap is only\nslightly modified in the emission energy range of interest\nto the experiment. For a very thick wetting layer (6 ML),\nthe QD wavefunction is modified such that the monotonic decrease of the wavefunction overlap with energy\nobserved for all other thicknesses does not apply. This\nbehavior can be understood as follows: for very thick\nwetting layers and small QDs a significant part of both\nthe electron and hole wavefunctions are expelled from the\nQD giving rise to quantum well-like wetting layer states\nthat can have an increased mutual overlap. For the QD\nsample of the experiment the wetting layer was on the\norder of 2 ML.\nThe above discussions point to a number of subtleties\nassociated with a quantitative comparison between experiment and theory. These are mainly related to lack\nof knowledge about intrinsic properties of the QDs. Notably, the monotonic decrease in the electron-hole wavefunction overlap with emission energy is found to be a\nvery general and robust result for a large range of different parameters. The generality of this result can be\nunderstood in a simple physical picture and is related to\nthe differences in the electron and heavy hole effective\nmasses. Thus, for any indium mole fraction, we have\nfrom Eqs. (A10), (A11), and (A12) that mhh,b > me,b\nand mhh,x , mhh,z > me . This in turn leads to a smaller\n2\n0 ǫr ~\nBohr aBn = 4πǫ\nq2 m0 mn radius for holes than for electrons,\ni.e. the hole wavefunctions are more compressible than\nthe electron wavefunctions. Increasing the emission energy corresponds to decreasing the QD size. The large\nQDs emitting at small energies have a relatively large\nelectron-hole wavefunction overlap. Decreasing QD size\n(i.e. increasing emission energy) compresses the electron\nand hole wavefunctions, and since the quantum confinement effect influences the electron wavefunction more\nthan the hole wavefunction, the wavefunction overlap is\ndecreased. This effect is illustrated in Fig. 13 where the\ncalculated electron and hole wavefunctions for two different QD sizes are plotted. It is clearly observed that a\nreduction in the QD height leads to a compression of the\n\nhole envelope wavefunction while the electron wavefunction extends further into the surrounding GaAs barrier.\n\nVI.\n\nCONCLUSION\n\nWe have presented time-resolved measurements of\nspontaneous emission from self-assembled QDs near a\nsemiconductor-air interface. The interface leads to a\nmodification of the LDOS, which can be calculated in\nan exact model without any adjustable parameters. The\nexcellent agreement between theory and experiment enables separating radiative and non-radiative decay rates\nwhereby they can be determined with unprecedented accuracy. We reviewed the theory behind the experiment\nby calculating the spontaneous emission radiative decay\nrate in a full quantum model in which spontaneous emission is described by Wigner-Weisskopf theory. The radiative decay rate is proportional to the projected LDOS,\nwhich was derived using a Green's function formalism.\nFrom our measurements of the radiative decay rate at\ndifferent emission energies we extracted the frequency dependence of the overlap of the electron and hole envelope\nwavefunctions. The experimental data were compared to\ntheory by solving numerically the Schrödinger equation\nfor a QD potential including the effects of shear and hydrostatic strain. From this model the spontaneous emission spectrum, which is inhomogeneously broadened due\nto the different sizes of QDs making up the ensemble,\nand the electron-hole wavefunction overlap were derived.\nAn attempt to model the emission spectrum using the\nQD height distribution obtained by AFM on uncapped\nQDs was unsuccessful leading to the conclusion that this\nheight distribution does not properly reflect the microscopic confinement potential of overgrown QDs. Regarding the frequency dependence of the electron-hole wavefunction overlap, we found good agreement between experiment and theory with reasonable assumptions about\nQD size, geometry, strain, and wetting layer thickness\nassuming purely hydrostatic strain or no strain at all.\nIn contrast, systematic deviations were found when including both shear and hydrostatic strain. Although the\nnumerical model employed here is too simple to reflect\nthe microscopic details of the QD geometry such as, e.g.,\nindium-gallium intermixing, it reflects this simple physical picture very well. A more detailed comparison between experiment and theory is limited by the lack of\nexperimental input on the QD structure at the atomic\nscale, which would be required to verify more sophisticated QD models.\nWe finally discussed how the striking frequency dependence of the radiative decay rate, and consequently of the\nelectron-hole wavefunction overlap, can be understood\nin terms of a very simple physical picture: The heavy\nhole wavefunction is more compressible than the electron wavefunction due to the larger effective mass. A\nreduction in the QD size therefore leads to a further localization of the heavy hole wavefunction, while the elec-\n\n\f12\ntron wavefunction delocalizes into the surrounding barrier. This leads to a decrease in wavefunction overlap for\nincreasing emission energy.\nQuantitative comparison of the experimental data to\ntheory was limited by the lack of detailed experimental input about the microscopic composition of the QDs.\nCombining the detailed optical experiments presented\nhere with techniques to extract local material properties of QDs, e.g., by high resolution transmission electron microscopy (TEM), will be a very exciting future\nresearch direction that also will pinpoint the need for\nmore involved theoretical models of the QDs. We believe\nthat the technique presented here to directly access the\nlight-matter coupling strength will have important appli-\n\n∗\n†\n\n1\n\n2\n\n3\n\n4\n\n5\n\n6\n\n7\n\n8\n\n9\n\n10\n\n11\n\n12\n\n13\n\n14\n\n15\n16\n\nElectronic address: ssto@fotonik.dtu.dk\nElectronic\naddress:\npelo@fotonik.dtu.dk;\nURL: http://www.fotonik.dtu.dk/quantumphotonics\nA. Imamoglu, D. D. Awschalom, G. Burkard, D. P. DiVincenzo, D. Loss, M. Sherwin, and A. Small, Phys. Rev.\nLett. 83, 4204 (1999).\nJ. M. Gérard, B. Sermage, B. Gayral, B. Legrand,\nE. Costard, and V. Thierry-Mieg, Phys. Rev. Lett. 81,\n1110 (1998).\nJ. P. Reithmaier, G. Sȩk, A. Löffler, C. Hofmann, S. Kuhn,\nS. Reitzenstein, L. V. Keldysh, V. D. Kulakovskii, T. L.\nReinecke, and A. Forchel, Nature 432, 197 (2004).\nT. Yoshie, A. Scherer, J. Hendrickson, G. Khitrova, H. M.\nGibbs, G. Rupper, C. Ell, O. B. Shchekin, and D. G.\nDeppe, Nature 432, 200 (2004).\nC. Kistner, T. Heindel, C. Schneider, A. Rahimi-Iman,\nS. Reitzenstein, S. Höfling, and A. Forchel, Optics Express\n16, 15006 (2008).\nA. Laucht, F. Hofbauer, N. Hauke, J. Angele, S. Stobbe,\nM. Kaniber, G. Böhm, P. Lodahl, M. C. Amann, and J. J.\nFinley, arXiv:0810.3010v2 (2008).\nP. Michler, A. Kiraz, C. Becher, W. V. Schoenfeld, P. M.\nPetroff, L. Zhang, E. Hu, and A. Imamoglu, Science 290,\n2282 (2000).\nS. Reitzenstein, T. Heindel, C. Kistner, A. Rahimi-Iman,\nC. Schneider, S. Höfling, and A. Forchel, Applied Physics\nLetters 93, 061104 (2008).\nP. Lodahl, A. Floris van Driel, I. S. Nikolaev, A. Irman,\nK. Overgaag, D. Vanmaekelbergh, and W. L. Vos, Nature\n430, 654 (2004).\nB. Julsgaard, J. Johansen, S. Stobbe, T. Stolberg-Rohr,\nT. Sünner, M. Kamp, A. Forchel, and P. Lodahl, Applied\nPhysics Letters 93, 094102 (2008).\nI. Robert, E. Moreau, B. Gayral, J.-M. Gerard, and\nI. Abram, Physica E 13, 606 (2002).\nX. Brokmann, L. Coolen, M. Dahan, and J. P. Hermier,\nPhysical Review Letters 93, 107403 (2004).\nM. D. Leistikow, J. Johansen, A. J. Kettelarij, P. Lodahl,\nand W. L. Vos, Physical Review B 79, 045301 (2009).\nJ. Johansen, S. Stobbe, I. S. Nikolaev, T. Lund-Hansen,\nP. T. Kristensen, J. M. Hvam, W. L. Vos, and P. Lodahl,\nPhysical Review B 77, 073303 (2008).\nE. M. Purcell, Phys. Rev. 69, 681 (1946).\nK. H. Drexhage, J. Lumin. 1,2, 693 (1970).\n\ncations regarding proper design and characterization of\nsolid state quantum photonic devices.\n\nAcknowledgments\n\nWe wish to thank J. Højbjerg, A. Kreiner-Møller and\nJ. E. Mortensen for valuable work on the numerical model\nand C.B. Sørensen for growth of the semiconductor material. We gratefully acknowledge the Danish Research\nAgency for financial support (projects FNU 272-05-0083,\n272-06-0138 and FTP 274-07-0459).\n\n17\n\n18\n\n19\n\n20\n\n21\n\n22\n\n23\n\n24\n\n25\n\n26\n\n27\n\n28\n\n29\n30\n\n31\n\n32\n\n33\n\n34\n\n35\n\n36\n\nL. Novotny and B. Hecht, Principles of Nano-Optics\n(Cambridge University Press, 2007).\nS. L. Chuang, Physics of optoelectronic devices (Wiley,\n1995).\nR. R. Chance, A. Prock, and R. Silbey, Adv. Chem. Phys.\n37, 1 (1978).\nD. Birkedal, J. Bloch, J. Shah, L. N. Pfeiffer, and K. West,\nAppl. Phys. Lett. 77, 2201 (2000).\nR. J. Warburton, C. S. Dürr, K. Karrai, J. P. Kotthaus,\nG. Medeiros-Ribeiro, and P. M. Petroff, Phys. Rev. Lett.\n79, 5282 (1997).\nK. L. Silverman, R. P. Mirin, S. T. Cundiff, and A. G.\nNorman, Appl. Phys. Lett. 82, 4552 (2003).\nC. F. Wang, A. Badolato, I. Wilson-Rae, P. M. Petroff,\nE. Hu, J. Urayama, and A. Imamoglu, Applied Physics\nLetters 85, 3423 (2004).\nJ. Lakowicz, Principles of Fluorescense Spectroscopy\n(Springer, 2006).\nJ. Johansen, B. Julsgaard, J. M. Hvam, and P. Lodahl, In\npreparation (2008).\nN. C. Barford, Experimental measurements: precision, error and truth (Wiley, 1990).\nS. Cortez, O. Krebs, P. Voisin, and J.-M. Gérard, Phys.\nRev. B 63, 233306 (2001).\nA. F. van Driel, G. Allan, C. Delerue, P. Lodahl, W. L.\nVos, and D. Vanmaekelbergh, Physical Review Letters 95,\n236804 (2005).\nE. Hanamura, Physical Review B 37, 1273 (1988).\nR. V. N. Melnik and M. Willatzen, Nanotechnology 15, 1\n(2004).\nT. Markussen, P. Kristensen, B. Tromborg, T. W. Berg,\nand J. Mørk, Phys. Rev. B 74, 195342 (2006).\nP. Kristensen, A. F. Koenderink, P. Lodahl, B. Tromborg,\nand J. Mørk, Optics Letters 33, 1557 (2008).\nS. S. Li, J. B. Xia, Z. L. Yuan, Z. Y. Xu, W. Ge, X. R.\nWang, Y. Wang, J. Wang, and L. L. Chang, Physical Review B 54, 11575 (1996).\nH. Haug and S. W. Koch, Quantum Theory of the Optical and Electronic Properties of Semiconductors (World\nScientific, 1994).\nN. Vats, S. John, and K. Busch, Phys. Rev. A 65, 043808\n(2002).\nR. Loudon, The Quantum Theory of Light (Oxford University Press, 2000).\n\n\f13\n\nFIG. 14: Schematic illustration of the effect of strain on the\nband energies at q = 0. (a) No strain and (b) biaxial strain.\nBiaxial strain shifts both the conduction band and the heavy\nhole valence band closer to the continuum. The net effect is\nan increase in the band gap and therefore in the transition\nenergy. Importantly, the degeneracy of the light and heavy\nhole states is lifted and the lowest energy transition involves\nheavy holes only.\n\n37\n\n38\n\n39\n\n40\n\n41\n\n42\n\n43\n\n44\n\n45\n\n46\n\n47\n\nH. T. Dung, L. Knöll, and D.-G. Welsch, Physical Review\nA 62, 053804 (2000).\nM. Paulus, P. Gay-Balmaz, and O. J. F. Martin, Phys.\nRev. E 62, 5797 (2000).\nL. A. Coldren and S. W. Corzine, Diode lasers and photonic integrated circuits (Wiley, 1995).\nJ. H. Davies, The physics of low-dimensional semiconductors: An introduction (Cambridge University Press, 1998).\nA. D. Andreev and E. P. O'Reilly, Applied Physics Letters\n87, 213106 (2005).\nNote that in Fig.3.B of Ref. [14] the theoretical\ncurve plotted is mistakenly |hFh (ω)|Fe (ω)i| rather than\n|hFh (ω)|Fe (ω)i|2 .\nI. Kegel, T. H. Metzger, A. Lorke, J. Peisl, J. Stangl,\nG. Bauer, J. M. Garcı́a, and P. M. Petroff, Physical Review\nLetters 85, 1694 (2000).\nN. Liu, J. Tersoff, O. Baklenov, A. L. Holmes, Jr., and\nC. K. Shih, Physical Review Letters 84, 334 (2000).\nO. Stier, M. Grundmann, and D. Bimberg, Physical Review B 59, 5688 (1999).\nI. Vurgaftman, J. R. Meyer, and L. R. Ram-Mohan, Journal of Applied Physics 89, 5815 (2001).\nW. W. Chow and S. W. Koch, Semiconductor-laser fundamentals (Springer, 1999).\n\nAPPENDIX A: INFLUENCE OF STRAIN ON\nEXCITONS CONFINED IN QUANTUM DOTS\n\nStrain due to the lattice constant mismatch between\nInAs and GaAs is responsible for the formation of QDs\nduring MBE growth in the Stranski-Krastranov growth\nmode. This means that the QDs are highly strained and\nthis has significant impact on the electronic band structure. The interplay between geometry, chemical composition, and strain is complicated for QDs. During the\ngrowth, diffusion of In and Ga takes place, so that the\nresulting QD will consist of a significant fraction of Ga\n\neven if it is grown by pure InAs43 . Furthermore, it has\nbeen reported that In is mainly concentrated in an inverted cone inside the QD giving rise to a complex strain\nprofile44 . Complete knowledge about such complex details is still lacking, and the purpose here is to introduce\nsimple strain models and judge their validity by comparing to experimental data. We consider a lens-shaped\nQD with a lateral extension, which is larger than the\nextension in the growth direction. For this reason we approximate the strain of a QD by the model used in the\ncase of a quantum well. This is further motivated by\nthe fact that the QD is placed on top of a wetting layer,\nc.f. Fig. 9. The strain modifies the band offsets and energy gap of the QD, and the valence band degeneracy\nis lifted so that the transition with the lowest energy involves only heavy holes. This is illustrated in Fig. 14. We\nwill assume that the bulk GaAs surrounding the QD is\nunstrained, however only heavy hole bands are included\nhere as well since the influence of band mixing is minor\nin the barrier where the electron and hole wavefunctions\nare strongly damped.\nOne effect of strain is to shift the conduction and valence bands in energy. The strain describes the compression or expansion of the crystal lattice, which in general\nis described by a tensor ǫnm . For biaxial strain, which\ndescribes the strain at planar heterojunctions, only the\ndiagonal elements are relevant. We consider a thin layer\nof Inc Ga1−c As with lattice constant aQD embedded in a\nGaAs barrier with lattice constant ab . We assume that all\nstrain is incorporated in the Inc Ga1−c As layer and since\naQD > ab the strain will be compressive. We have18\nǫxx = ǫyy =\n\nab − aQD\naQD\n\nǫzz = −\n\n2C12\nǫxx , (A1)\nC11\n\nwhere C11 and C12 are the elastic stiffness constants (matrix elements of the stiffness tensor). These strain components lead to a change in band structure and thus a\nmodification of band energies and effective masses, as described by the Pikus-Bir strain model18 . Biaxial strain\ncan be decomposed into components of hydrostatic and\nshear strain. The hydrostatic compressive strain of the\nQD leads to a decrease of the band offsets exactly as for\nany hydrostatic compressive strain resulting from, e.g.,\na decrease of the temperature. For a thin strained epitaxial layer, the energy can be lowered by compensating\nthe in-plane compressive strain by an expansion in the\nz-direction (shear strain). We obtain the following heavy\nhole valence/conduction band offsets18\n∆Ehh = ∆Ev′ − Pǫ − Qǫ ,\n∆Ec = ∆Ec′ − Rǫ ,\n\n(A2)\n(A3)\n\nPǫ = av (ǫxx + ǫyy + ǫzz ),\nbv\nQǫ = − (ǫxx + ǫyy − 2ǫzz ),\n2\nRǫ = ac (ǫxx + ǫyy + ǫzz ),\n\n(A4)\n\nwhere\n\n(A5)\n(A6)\n\n\f14\nTABLE I: Material parameters for Inc Ga1−c As at cryogenic temperatures used in this work. CB and VB indicate conduction\nand valence band parameters respectively.\nQuantity\nValue for Inc Ga1−c As\nLattice constant\na\n5.6503 + 0.4050c\nBand gap\nEg\n1.515 − 1.580c + 0.475c2\nCB effective mass\nme 0.0667 − 0.0419c − 0.00254c2\nLuttinger parameter\nγ1\n1/[(1 − c)/6.98 + c/20.0]\nLuttinger parameter\nγ2\n1/[(1 − c)/2.06 + c/8.5]\nLuttinger parameter\nγ3\n1/[(1 − c)/2.93 + c/9.2]\nCB Hydrostatic def. pot. ac\n−8.013 + 2.933c\nVB Hydrostatic def. pot. av\n−1.824 + 0.024c\nVB Shear def. pot.\nbv\n−2.0 + 0.2c\nElastic stiffness constant C11\n1221 − 388.1c\nElastic stiffness constant C12\n566 − 113.4c\nStatic dielectric constant ǫr\n13.18 + 1.42c\nKane Energy\nEp (c)\n28.8 − 7.3c\n\nand we have introduced a number of quantities defined\nin Table I. ∆Ec′ (∆Ev′ ) is the unstrained conduction\n(valence) band offset which constitute 60% (40%) of the\nband gap difference between bulk and QD, so that, e.g.,\n∆Ec′ = 0.6(Eg′ (0) − Eg′ (c)). The band gap of the strained\nQD is given by\nEg (c) = Eg′ (c) + Pǫ + Qǫ + Rǫ ,\n\n2\n,\n2γ1 − γ2 − 3γ3\n1\n=\n,\nγ1 − 2γ2\n\nm′hh,k,b =\n\n(A8)\n\nm′hh,⊥,b\n\n(A9)\n\nwhere γ1 , γ2 and γ3 are Luttinger parameters46. These\nare listed along with all other relevant QD material parameters for this work in Table I. For Inc Ga1−c As,\nwe have γ2 ≈ γ3 allowing for the axial approximation. Here γ2 and γ3 are replaced by their average value\nγ̄ = (γ2 + γ3 )/2, leading to an isotropic heavy hole mass\nvalid for unstrained bulk semiconductors47\n1\n.\n(A10)\nm′hh,k,b = mhh,⊥,b =\nγ1 − 2γ̄\n\n45,46\n45,46\n45,46\n\neV\neV\neV\nGPa\nGPa\n\n45\n45\n46\n46\n46\n45\n\neV\n\n39,46\n\nThese bulk effective masses are used to describe the GaAs\nbarrier material surrounding the QDs. The strained\nheavy hole effective masses in the directions parallel with\nand perpendicular to the wetting layer plane are given\nby18,39,47\n\n(A7)\n\nwhere Eg′ (c) is the unstrained band gap of the material. These effects on the band structure are illustrated\nin Fig. 14.\nAnother important consequence of strain is that the\neffective heavy hole mass becomes highly anisotropic. In\ncontrast the effective electron mass is not modified considerably since the conduction band is much more energetically isolated than the valence bands18,46 . In our experiments the growth direction (z) is parallel to the [001]\ncrystal axis, which is perpendicular to the wetting layer\nplane (x, y) oriented along [110] and [11̄0] directions. We\nwill use mz = m⊥ = m[001] and mx = mk = m[110] . Furthermore, since the crystal structure along the [110] and\n[11̄0] axes are identical apart from a series of rotations,\nwe have that mx = my .\nThe heavy hole masses for unstrained bulk Inc Ga1−c As\nare given by\n\nUnit Reference(s)\nÅ 45\neV 45\nm0 45\n\n1\n,\nγ1 + γ̄\n1\n=\n,\nγ1 − 2γ̄\n\nmhh,k,QD =\n\n(A11)\n\nmhh,⊥,QD\n\n(A12)\n\nshowing that the parallel component is strongly modified\nby strain.\n\nAPPENDIX B: NUMERICAL MODELING OF\nENVELOPE WAVEFUNCTIONS\n\nWe solve the effective mass equation for electrons in the\nconduction band and holes in the valence band in order\nto calculate the overlap of the envelope wavefunctions.\nThe effective mass equations describing the electron and\nthe hole have the same form, but the effective hole mass\nanisotropy must be taken into account. We therefore\nconsider the anisotropic valence band problem which has\nthe isotropic conduction band problem as a special case.\nFor both electrons and holes the effective mass depends\non position due to the different effective masses in the\nQD and in the surrounding crystal matrix.\nUsing cylindrical coordinates (ρ, φ, z) and the axial approximation, the kinetic term in Eq. (2) reads\n\u0012\n\u0013\n\u0012\n~2 1 ∂\n1\nρ\n∂\n∂2\n+\n2\n2m0 ρ ∂ρ mnk (ρ, z) ∂ρ\nmnk (ρ, z)ρ ∂φ2\n\u0012\n\u0013\u0013\n∂\n1\n∂\n.\n+\n∂z mn⊥ (ρ, z) ∂z\n(B1)\n\nHkin = −\n\nUsing separation of variables F (r) = R(ρ, z)Φ(φ) the ef-\n\n\f15\nfective mass Schrödinger equation can be written as\n\nEq. (B2) is solved numerically after being reduced to\na dimensionless form in order to avoid numerical issues\n∂\nρ\n−1 ∂ 2\nrelated to the very small factors (∝ ~2 ) appearing in\nΦ(φ) =\nR(ρ, z)\n2\nthis equation. We define the new dimensionless quanΦ(φ) ∂φ\nR(ρ, z) ∂ρ\n\u0012\n\u0013 tities through ρ = kρ ρ̃, z = kz z̃, R(ρ, z) = kR R̃(ρ̃, z̃),\nmnk (ρ, z)ρ2 ∂\n1\n∂\n+\nR(ρ, z)\nV (ρ, z) = V0 Ṽ (ρ̃, z̃), E = V0 Ẽ, and V0 = ~2 /(2m0 kρ2 ),\nR(ρ, z) ∂ρ mnk (ρ, z) ∂ρ\n\u0012\n\u0013 and furthermore take kρ = kz = 1 nm so that all spatial\nmnk (ρ, z)ρ2 ∂\n∂\n1\nR(ρ, z) dimensions are measured in units of nanometer. By this\n+\ntransformation we obtain\nR(ρ, z) ∂z mn⊥ (ρ, z) ∂z\n2\n2m0 mnk (ρ, z)ρ\n\u0012\n\u0013\n(V (ρ, z) − E).\n+\n~2\n∂\n∂\n1\n∂\n1\nR̃(ρ̃,\nz̃)\n+\nR̃(ρ̃,\nz̃)\n(B2)\nmk (ρ̃, z̃)ρ̃ ∂ ρ̃\n∂ ρ̃ mk (ρ̃, z̃) ∂ ρ̃\n\u0012\n\u0013\n∂\n1\n∂\nThe left and right hand sides of this equation are inde+\nR̃(ρ̃, z̃) (B3)\npendent and they must therefore equal a constant, i.e.\n∂ z̃ m⊥ (ρ̃, z̃) ∂ z̃\n\u0013\n\u0012\n1\n∂2\n2\nl2\nΦ(φ) ∂φ2 Φ(φ) = −l . The solution of this equation is\nR̃(ρ̃, z̃) = Ẽ R̃(ρ̃, z̃),\n+\nṼ\n(ρ̃,\nz̃)\n−\nΦ(φ) = c1 cos(lφ)+c2 sin(lφ) which by the boundary conmk (ρ̃, z̃)ρ̃2\ndition Φ(0) = Φ(2π) implies that l must be an integer.\nWe are considering the ground state transition and therefore take l = 0. This leaves an equation describing the\nwhich is solved numerically using a finite element\nelectronic motion in the (ρ, z)-plane.\nmethod.\n\n\f"}