{"id": "http://arxiv.org/abs/1205.4403v2", "guidislink": true, "updated": "2012-07-10T09:09:51Z", "updated_parsed": [2012, 7, 10, 9, 9, 51, 1, 192, 0], "published": "2012-05-20T10:34:22Z", "published_parsed": [2012, 5, 20, 10, 34, 22, 6, 141, 0], "title": "Determining the dimensionality of bipartite orbital-angular-momentum\n  entanglement using multi-sector phase masks", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1205.4168%2C1205.3449%2C1205.0369%2C1205.0921%2C1205.1823%2C1205.2450%2C1205.4035%2C1205.2378%2C1205.0380%2C1205.1767%2C1205.2658%2C1205.0875%2C1205.2147%2C1205.4040%2C1205.1985%2C1205.0975%2C1205.4163%2C1205.3682%2C1205.1580%2C1205.0405%2C1205.2029%2C1205.3304%2C1205.1536%2C1205.3659%2C1205.1686%2C1205.4427%2C1205.0893%2C1205.0208%2C1205.1059%2C1205.2784%2C1205.3686%2C1205.2447%2C1205.2269%2C1205.3822%2C1205.2528%2C1205.1980%2C1205.2704%2C1205.4133%2C1205.1594%2C1205.4420%2C1205.0839%2C1205.3353%2C1205.1114%2C1205.1106%2C1205.0699%2C1205.0018%2C1205.1694%2C1205.3524%2C1205.3645%2C1205.0942%2C1205.0010%2C1205.0720%2C1205.0785%2C1205.3072%2C1205.3445%2C1205.1527%2C1205.1953%2C1205.0571%2C1205.3172%2C1205.0607%2C1205.0331%2C1205.3239%2C1205.3578%2C1205.0112%2C1205.4333%2C1205.0370%2C1205.1501%2C1205.0291%2C1205.0583%2C1205.1993%2C1205.1966%2C1205.3373%2C1205.2480%2C1205.2189%2C1205.4324%2C1205.1560%2C1205.4403%2C1205.0745%2C1205.3936%2C1205.0318%2C1205.4127%2C1205.1739%2C1205.2653%2C1205.3858%2C1205.3918%2C1205.0164%2C1205.1323%2C1205.3040%2C1205.1084%2C1205.4195%2C1205.2374%2C1205.1826%2C1205.2020%2C1205.0308%2C1205.2611%2C1205.3799%2C1205.2917%2C1205.2769%2C1205.3947%2C1205.3455%2C1205.2703&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Determining the dimensionality of bipartite orbital-angular-momentum\n  entanglement using multi-sector phase masks"}, "summary": "The Shannon dimensionality of orbital angular momentum (OAM) entanglement\nproduced in spontaneous parametric down-conversion can be probed by using\nmulti-sector phase analysers. We demonstrate a spatial light modulator-based\nimplementation of these analysers, and use it to measure a Schmidt number of\nabout 50.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1205.4168%2C1205.3449%2C1205.0369%2C1205.0921%2C1205.1823%2C1205.2450%2C1205.4035%2C1205.2378%2C1205.0380%2C1205.1767%2C1205.2658%2C1205.0875%2C1205.2147%2C1205.4040%2C1205.1985%2C1205.0975%2C1205.4163%2C1205.3682%2C1205.1580%2C1205.0405%2C1205.2029%2C1205.3304%2C1205.1536%2C1205.3659%2C1205.1686%2C1205.4427%2C1205.0893%2C1205.0208%2C1205.1059%2C1205.2784%2C1205.3686%2C1205.2447%2C1205.2269%2C1205.3822%2C1205.2528%2C1205.1980%2C1205.2704%2C1205.4133%2C1205.1594%2C1205.4420%2C1205.0839%2C1205.3353%2C1205.1114%2C1205.1106%2C1205.0699%2C1205.0018%2C1205.1694%2C1205.3524%2C1205.3645%2C1205.0942%2C1205.0010%2C1205.0720%2C1205.0785%2C1205.3072%2C1205.3445%2C1205.1527%2C1205.1953%2C1205.0571%2C1205.3172%2C1205.0607%2C1205.0331%2C1205.3239%2C1205.3578%2C1205.0112%2C1205.4333%2C1205.0370%2C1205.1501%2C1205.0291%2C1205.0583%2C1205.1993%2C1205.1966%2C1205.3373%2C1205.2480%2C1205.2189%2C1205.4324%2C1205.1560%2C1205.4403%2C1205.0745%2C1205.3936%2C1205.0318%2C1205.4127%2C1205.1739%2C1205.2653%2C1205.3858%2C1205.3918%2C1205.0164%2C1205.1323%2C1205.3040%2C1205.1084%2C1205.4195%2C1205.2374%2C1205.1826%2C1205.2020%2C1205.0308%2C1205.2611%2C1205.3799%2C1205.2917%2C1205.2769%2C1205.3947%2C1205.3455%2C1205.2703&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The Shannon dimensionality of orbital angular momentum (OAM) entanglement\nproduced in spontaneous parametric down-conversion can be probed by using\nmulti-sector phase analysers. We demonstrate a spatial light modulator-based\nimplementation of these analysers, and use it to measure a Schmidt number of\nabout 50."}, "authors": ["D. Giovannini", "F. M. Miatto", "J. Romero", "S. M. Barnett", "J. P. Woerdman", "M. J. Padgett"], "author_detail": {"name": "M. J. Padgett"}, "author": "M. J. Padgett", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1088/1367-2630/14/7/073046", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1205.4403v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1205.4403v2", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "9 pages, 5 figures", "arxiv_primary_category": {"term": "quant-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "quant-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1205.4403v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1205.4403v2", "journal_reference": null, "doi": "10.1088/1367-2630/14/7/073046", "fulltext": "arXiv:1205.4403v2 [quant-ph] 10 Jul 2012\n\nDetermining the dimensionality of bipartite\norbital-angular-momentum entanglement using\nmulti-sector phase masks\nD. Giovannini1 , F. M. Miatto2 , J. Romero1,2 ,\nS. M. Barnett2 , J. P. Woerdman3 , M. J. Padgett1\n1 School of Physics and Astronomy, SUPA, University of Glasgow, Glasgow G12\n8QQ, United Kingdom\n2 Department of Physics, SUPA, University of Strathclyde, Glasgow G4 ONG,\nUnited Kingdom\n3 Huygens Laboratory, Leiden University, PO Box 9504, 2300 RA Leiden, The\nNetherlands\n\nE-mail: miles.padgett@glasgow.ac.uk\nAbstract. The Shannon dimensionality of orbital angular momentum (OAM)\nentanglement produced in spontaneous parametric down-conversion can be probed\nby using multi-sector phase analysers [1]. We demonstrate a spatial light\nmodulator-based implementation of these analysers, and use it to measure a\nSchmidt number of about 50.\n\nSubmitted to: New J. Phys.\n\n\fDetermining the dimensionality of orbital-angular-momentum entanglement\n\n2\n\n1. Introduction\nThe photon pairs generated by spontaneous parametric down-conversion (SPDC) in a\nnon-linear crystal are correlated in their various properties, some of which can exhibit\nhigh-dimensional entanglement. The orbital angular momentum (OAM) of light is\none such property, associated with phase structures of the form eilφ , where lh̄ is the\nOAM carried by each photon [2]. As l is an integer and is theoretically unbounded,\nOAM offers a natural discrete space for exploring high-dimensional entanglement [3].\nIn SPDC with a Gaussian pump (with l = 0), the spectrum of OAM correlations\nbetween the signal and idler photons is peaked at l = 0, with tails towards high |l|\nvalues. The width and shape of the spectrum, and therefore the number of OAM\nmodes that constitute the two-photon entangled state, can be engineered directly by\nmanipulating the structure of the beam pumping the crystal [4, 5, 6] or by tuning the\nphase-matching conditions in SPDC [7].\nIt is necessary to distinguish between the entanglement of the high-dimensional\nOAM state generated by the SPDC process, whose dimensionality is described by the\nSchmidt number K [8], and that detected by the measurement stage of the system [1],\nwith Shannon dimensionality M [10]. M is in fact dependent upon both the generated\ndown-conversion OAM spectrum and the finite detection capability of our analysers.\nThe latter is expressed in terms of the number of modes D that an analyser has access\nto. By knowing the relation between these three quantities, we can infer K after\nmeasuring M with an analyser characterised by a known D.\nDetermining the measured dimensionality M of tailored high-dimensional\nentangled states can be carried out by performing appropriate selective projective\nmeasurements [9]. One such measurement is based on pairs of multi-sector phase\nplates, placed in the two arms of a down-conversion system. Each plate has N\nazimuthal angular sectors, each of which introduces a π phase shift. The number and\nangular width of the sectors of the phase analysers placed in each of the signal and\nidler arms define the superposition of OAM eigenmodes in which the two-photon state\nproduced by down-conversion is projected. By optimising the binary phase profile of\nthe phase analysers, it is possible to maximise the Shannon dimensionality D of the\nmeasurement apparatus, for any number of sectors N of the two plates.\nBy using angular phase analysers we infer the Schmidt number K, characterising\nthe effective number of azimuthal entangled OAM modes. In contrast to previous\nworks, which used micromachined phase plates [11], we implement N -sector angular\nphase analysers using spatial light modulators (SLMs) [12]. Computer-controlled\nSLMs provide a fast, convenient and reliable way of producing holographic phase masks\nwith arbitrary orientations and numbers of sectors, to be used in the measurement\nof the Shannon dimensionality of OAM entanglement. The use of multi-sector phase\nmasks to probe high-dimensional states, as opposed to narrow single-sector analysers\n[13, 14], allows the measurements of tight angular correlations whilst maintaining high\noptical throughput.\n2. Theory\n2.1. Amplitude and phase masks\nThe angular measurement of a light field can be achieved by employing an angular\nslit. The idea behind this approach is the angular analog of a linear slit: a linear\n\n\fDetermining the dimensionality of orbital-angular-momentum entanglement\n\n3\n\nslit measures a field at one linear coordinate, with an uncertainty that depends on\nthe width of the slit. An angular slit, on the other hand, measures a field at one\nangular coordinate with an uncertainty that depends on the angular width of the\nslit. As the angular position and orbital angular momentum form a pair of conjugate\nobservables, the tighter the angular correlations, the larger the spread in the OAM\nobservable [15, 16]. If one seeks high measurement accuracy, the angular slit has to\nbe very narrow and, in turn, this means that much of the light is blocked, yielding\nthe problem of lower number of counts as the measurement uncertainty decreases. A\npracticed solution to this problem is to employ phase masks, instead of amplitude\nmasks.\nThe design of the phase mask consists of an angular step plate, which is\ncharacterised by a number of sectors N and by a set of angles that describe the\nposition and width of each sector [11]. Each alternate sector applies a π phase shift.\nThe overall action of a phase plate of this kind is therefore to flip the phase of a light\nfield in each sector, about the centre of the plate, and leaving the phase unchanged\neverywhere else. Note that the action of a phase plate does not affect the radial\ndegree of freedom, as the design is radially invariant. This means that there is no\ncoupling between different eigenmodes of the radial degree of freedom, which allows\nus to restrict ourselves to the azimuthal content of the measured state. This effect can\nbe described in terms of OAM. A plane wave is turned into a superposition of different\nOAM eigenstates. The range of OAM eigenstates of which the superposition consists\ndepends on the number of sectors and on their relative positions and widths [11]. Such\neffect is analogous to the effect of an amplitude mask, without the drawback of letting\nless and less light through as the angular uncertainty is decreased.\n2.2. Measurement of Hilbert space dimensionality\nWe probe the two-photon state produced by down-conversion\n∞\nX\n|Ψi =\ncl |lis ⊗ |−lii\n\n(1)\n\nl=−∞\n\ndescribed in the OAM basis, where |lis and |lii correspond to the states of the signal\nand idler photons respectively. By expressing the projection state associated with a\nphase-mask analyser oriented at an angle α as the superposition\nX\n|A(α)i =\nλl |li eilα ,\n(2)\nl\n\nthe coincidence probability for a pair of analysers, oriented at α and β respectively, is\ngiven by\n2\n\nP (α, β) = |hA(α), B(β)| Ψi| ,\n\n(3)\n2\n\nwhere P\nhA(α), B(β)| = hA(α)| ⊗ hB(β)|. The coefficients γl = |hl| A(0)i| = |λl |2\n(with\nl γl = 1), defined by the profile of the N -sector phase masks, determine\nthe respective OAM spectrum. It is possible to design the arc sectors of each N sector phase mask in a way that maximises the Shannon dimensionality D of the\nmeasured entanglement. For each N we used the optimal arrangement of sectors,\nbased on results from [11]. The maximum number of modes D that can in principle\nbe measured by each of such optimal N -sector masks\nP can then be inferred from the\ntheoretical distribution of eigenmodes γl as D = 1/ l γl2 , as shown in [11].\n\n\fDetermining the dimensionality of orbital-angular-momentum entanglement\n\n4\n\nFigure 1. Experimental setup implementing SLM-based coincidence detection\nwith angular-sector phase masks (see text for details). The β-barium borate\n(BBO) crystal is pumped by a 355 nm laser and imaged onto two spatial light\nmodulators (SLMs). The outputs of the SLMs are then imaged onto single-mode\nfibres (SMFs).\n\nIn contrast, the Shannon dimensionality D of each N -sector mask used here was\nderived through a numerical model. The numerical model considered the distribution\nof the overlap between two identical N -sector masks within a two-dimensional region\nwith a Gaussian profile, as the orientation β of one of the masks was rotated with\nrespect to the other, α. The maximum measurable dimensionality D for each optimal\nN -sector mask is shown in fig. 4. As already noted in [11], it was found that, for N\nat least up to 14, D increases approximately linearly with N . Given the coincidence\nprobability distribution P (α − β) obtained from the numerical model, the Shannon\ndimensionality [1] can be directly calculated as\n2π\n,\n(4)\nD = R 2π\nP (α − β) d(α − β)\n0\nwhere angle β is measured with respect to α. We implemented multi-sector masks with\na number N of sectors between 1 and 16. The dimensionalities D obtained from the\nnumerical model previously described and theoretical model, the latter obtained from\nthe decomposition of each N -sector mask into eigenmodes γl and the sum over the\nfirst thousand terms of each corresponding infinite series expansion [11], were found\nto differ by less than 2.5 %.\n3. Experimental results\n3.1. Experimental setup\nImplementing phase-mask analysers using computer-controlled spatial light modulators allows for quick and effective measurement of the Schmidt number K of the\nentangled state produced by SPDC. No optical elements need to be fabricated, physically rotated or replaced when using a different multi-sector mask, as the measurement\nprocess simply involves displaying one of a set of different rotated N -sector holograms\non the SLMs and performing coincidence detection.\n\n\fDetermining the dimensionality of orbital-angular-momentum entanglement\n\n5\n\nFigure 2. Typical best Gaussian fits of coincidence probability distributions\nP (α − β) are shown for N = 5, 8, 10 and φ = 0. The inset shows the full\n−180◦ < α − β < 180◦ range used in the measurements, for the aforementioned\nvalues of N . Background subtraction was performed by assessing the experimental\naccidental coincidences.\n\nA 5 mm-thick β-barium borate (BBO) non-linear crystal cut for type-I collinear\nSPDC acts as our source of entangled photon pairs. The crystal is pumped by a\n1 W UV laser to produce frequency-degenerate entangled photon pairs at 710 nm.\nThe co-propagating signal and idler photons are separated by a non-polarizing beam\nsplitter, and redirected to SLMs. The SLMs, onto which the crystal output face is\nimaged by a 2× telescope, are encoded with N -sector phase holograms. The SLMs\nare then imaged onto single-mode fibres (SMFs), which couple the SLM output to\nsingle-photon photo-diode detectors (fig. 1), whose output is routed to coincidencecounting electronics. The coincidence counting has a timing window of 10 ns. Narrowband, 2 nm interference filters are placed in front of the detectors to ensure that the\nfrequency spread of the detected down-converted fields is small compared to the central\nfrequencies. SLMs introduce great flexibility in our measurements, but this comes at\nthe price of an overall lower detection efficiency, as the diffraction efficiency of SLMs\nis around 50 %.\nThis detection configuration is insensitive to any overall phase factors. Therefore,\nwhile the conservation of OAM in the SPDC process would require placing mutually\nphase-conjugate N -sector phase masks in the detection arms (i.e., the 0 and π phaseshifted sectors are inverted between the two masks), two identical phase masks can\nbe used instead. These phase masks are self-conjugate in case of a π phase shift. The\nfinite pixel size of the SLMs places a restriction on the width of the sectors that can\nbe displayed on the holograms. We show that we can implement optimal multi-sector\nphase masks with N = 1, . . . 16. Suppressing the centres of the holograms, where the\nN angular sectors meet in a very limited spatial region of the SLM displays, did not\nturn out to be necessary.\nThe phase-matching conditions of the down-conversion process for the BBO\ncrystal were adjusted by slightly changing the orientation of the crystal with respect\nto the propagation direction of the pump beam [17]. This allowed us to increase the\nwidth of the orbital angular momentum spectrum, and thus decrease the width of the\n\n\fDetermining the dimensionality of orbital-angular-momentum entanglement\n\n6\n\nFigure 3. Detected orbital angular momentum spectrum with projective\nmeasurements using traditional forked holograms. Shown is the coincidence\nprobability P (li , li = −ls ) for ls ∈ (−30, 30), for collinear (φ = 0) and nearcollinear (φ = −2.3) phase-matching conditions.\n\nangular correlations distribution. The intensity profile of the down-conversion emission\ncan be expressed as: I ∝ |E|2 ∝ sinc(φ+cξ)2 , where ξ is the external emission angle in\nair, c = (|ks | + |ki |)L/(2n)2 is a constant depending on the experimental parameters,\nand φ = (|kp | − |ks | − |ki |)L/2 (with L length of the crystal) determines the degree\nof non-collinearity of the process [18]. Measurements were performed for collinear\n(φ = 0) and near-collinear (φ = −2.3) phase-matching conditions.\nThe coincidence probability distribution P (α − β) was obtained by changing the\norientation β of the second phase mask over the range α ± 180◦ , where α is the\norientation of the first. We found that, for the purposes of the experiment, a Gaussian\ndistribution is an excellent empirical fit for the coincidence probability distributions\n(fig. 2). The detected number of modes M , dependent on both the source and the\ndetectors' properties, was obtained by substituting the Gaussian fit of the measured\ncoincidences to P (α − β) in eq. (4).\n3.2. Results and discussion\nThe phase masks used have no radial structure. Any sensitivity of the detection\napparatus to the radial quantum number p is therefore due to the spatial selectivity\nof the SMF coupling. Unlike full projective measurements of the down-conversion\nentangled state over a range of OAM eigenstates |li (fig. 3), a phase-mask\ndetermination of the dimensionality K of the source does not provide any direct\ninformation on the shape of the OAM spectrum.\nWe consider the OAM spectrum generated by the source and the coincidence\nprobability obtained from the numerical model, both fitted with Gaussian\ndistributions, from which the dimensionalities K and D can respectively be obtained.\nWe performed projective measurements of idler and signal over |li and |−li\nrespectively to verify the validity of the assumption concerning the OAM spectrum\n(fig. 3). The numerical model, from which the values of D for different N are obtained,\ncalculates the overlap in eq. (3). Although the theoretical shape of the distribution of\nthe coefficients γl , which characterise the action of a phase mask on a light field,\nhas own distinctive features, its implementation on an SLM makes it possible to\n\n\fDetermining the dimensionality of orbital-angular-momentum entanglement\n\n7\n\nFigure 4. Collinear phase-matching conditions. Phase mask dimensionality D\nfrom numerical model (blue points), measured M (red squares), and calculated\ndimensionality K (grey circles). We observe that D < K for N < 7; therefore,\nthe calculated M saturates to D for any given N < 7. The solid grey line shows\nthe best estimation for the number of modes K of the source, 35 ± 2.\n\nFigure 5. Near-collinear phase-matching conditions. See caption of fig. 4. Given\nthe wider spiral bandwidth in the near-collinear regime, K saturates to D for\nN < 9. The solid grey line shows the best estimation for the number of modes K\nof the source, 49 ± 2.\n\napproximate it with a Gaussian distribution. In fact, as the hologram representing\nthe phase plate is rotated on the surface of the SLM, any imperfections (finite pixel\nsize, surface roughness, slight unevenness of the phase shift, electrical fluctuations)\ninfluence the effect of the phase plate in a stochastic fashion. As this a very small\noverall effect, it does not change the dimensionality of the phase plate but rather\nsmooths out the distribution of the γl coefficients.\nWhen the dimensionality K of the generated state is very different from\nthe dimensionality D accessible to the detection system, the resulting measured\n\n\fDetermining the dimensionality of orbital-angular-momentum entanglement\n\n8\n\ndimensionality, M , is given by the smaller of the two. For cases where K and D\nare comparable, M can be approximated by noting that all three distributions are\nclose to Gaussian in form and hence their contributing widths can be combined as:\n1\n1\n1\n≃ 2+ 2\n(5)\nM2\nD\nK\nwhich gives:\nDK\n(6)\nM≃√\nD2 + K 2\nfrom which the Schmidt number K can be derived:\nDM\nK≃√\n.\n(7)\nD2 − M 2\nConsequently, the source dimensionality K can be inferred from the theoretical\ncoincidence probabilities and measured coincidence distribution. The calculated\ndimensionality for each N -sector phase mask is shown in fig. 4 (collinear phasematching) and 5 (near-collinear phase-matching). We measured Schmidt numbers of\n35 ± 2 for collinear down-conversion, and 49 ± 2 in the near-collinear case. The results\nfor source dimensionality obtained from the phase-mask analysis are compatible with\nthe Schmidt number derived from projective spiral bandwidth measurement (fig. 3),\nwith the assumption of perfect single-mode detection.\nThe mean visibility achieved in the experiment, defined here as the ratio between\nthe mean baseline of the measured coincidence probability and the peak at α − β = 0,\nwithout background subtraction, is 90 % for collinear phase-matching, and 92 % for\nnear-collinear. Systematic errors due to misalignment are found to be much larger\nthan photon statistics uncertainties.\n4. Conclusions\nWe have shown how multi-sector phase-mask analysers can be implemented using\nspatial light modulators, and used them to probe the effective number of modes in the\nhigh-dimensional bi-photon entangled state produced by parametric down-conversion.\nWe used a set of several multi-sector analysers to infer the Schmidt number for different\nphase-matching conditions, and therefore, different widths of the OAM spectrum of\nthe source.\nAcknowledgments\nThis work was supported by the UK EPSRC and the EU Future and Emerging\nTechnologies (FET) programme (HIDEAS No. FP7-ICT-221906).\nWe thank\nHamamatsu for their support. S.M.B. and M.J.P. thank the Royal Society and the\nWolfson Foundation for financial support.\nReferences\n[1] Pors J B, Aiello A, Oemrawsingh S S R, van Exter M P, Eliel E R and Woerdman J P 2008\nPhys. Rev. A 77 033845\n[2] Allen L, Beijersbergen M W, Spreeuw R J C and Woerdman J P 1992 Physical Review A 95\n8185–8189\n[3] Yao A M and Padgett M J 2011 Advances in Optics and Photonics 3 161–204\n\n\fDetermining the dimensionality of orbital-angular-momentum entanglement\n[4]\n[5]\n[6]\n[7]\n[8]\n[9]\n[10]\n[11]\n[12]\n[13]\n[14]\n[15]\n[16]\n[17]\n\n[18]\n\n9\n\nTorres J P, Deyanova Y, Torner L and Molina-Terriza G 2003 Phys. Rev. A 67 052313–1–5\nYao A M 2011 New Journal of Physics 13 053048\nMiatto F M, Yao A M and Barnett S M 2011 Physical Review A 83 033816\nDi Lorenzo Pires H, Florijn H C B and van Exter M P 2010 Phys. Rev. Lett. 104 020505\nLaw C K and Eberly J H 2004 Phys. Rev. Lett. 92 127903\nBennett C H, Brassard G, Popescu S, Schumacher B, Smolin J A and Wootters W K 1996 Phys.\nRev. Lett. 76 722–725\nPors J B, Oemrawsingh S S R, Aiello A, van Exter M P, Eliel E R, 't Hooft G W and Woerdman\nJ P 2008 Phys. Rev. Lett. 101 120502\nPors B J, Miatto F, 't Hooft G W, Eliel E R and Woerdman J P 2011 J. Opt. 13 064008\nLeach J, Jack B, Romero J, Ritsch-Marte M, Boyd R W, Jha A K, Barnett S M, Franke-Arnold\nS and Padgett M J 2009 Opt. Express 17\nLeach J, Jack B, Romero J, Jha A K, Yao A M, Franke-Arnold S, Ireland D G, Boyd R W,\nBarnett S M and Padgett M J 2010 Science 329 662–665\nDada A C, Leach J, Buller G S, Padgett M J and Andersson E 2011 Nature Physics 7 677–680\nBarnett S M and Pegg D T 1990 Physical Review A 42 6713–6720\nFranke-Arnold S, Barnett S M, Yao E, Leach J, Courtial J and Padgett M 2004 New Journal of\nPhysics 6 103\nRomero J, Giovannini D, Franke-Arnold S, Barnett S M and Padgett M J 2012 Increasing\nthe dimension in high-dimensional two-photon orbital angular momentum entanglement\narXiv:1205.1968v1 [quant-ph]\nPors B J 2011 Entangling light in high dimensions Ph.D. thesis Leiden University\n\n\f"}