{"id": "http://arxiv.org/abs/0911.4768v2", "guidislink": true, "updated": "2010-07-02T06:59:40Z", "updated_parsed": [2010, 7, 2, 6, 59, 40, 4, 183, 0], "published": "2009-11-25T06:59:14Z", "published_parsed": [2009, 11, 25, 6, 59, 14, 2, 329, 0], "title": "Scale Dependence of Halo Bispectrum from Non-Gaussian Initial Conditions\n  in Cosmological N-body Simulations", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0911.1794%2C0911.5562%2C0911.1458%2C0911.2336%2C0911.4768%2C0911.1755%2C0911.0578%2C0911.2167%2C0911.4286%2C0911.3766%2C0911.4570%2C0911.3055%2C0911.1701%2C0911.5631%2C0911.1035%2C0911.1338%2C0911.5683%2C0911.4262%2C0911.4388%2C0911.4416%2C0911.3703%2C0911.3085%2C0911.3797%2C0911.4392%2C0911.5170%2C0911.1905%2C0911.3554%2C0911.1285%2C0911.4056%2C0911.4931%2C0911.0542%2C0911.5639%2C0911.2840%2C0911.2626%2C0911.1820%2C0911.2117%2C0911.0494%2C0911.1693%2C0911.3529%2C0911.2425%2C0911.4723%2C0911.4744%2C0911.4860%2C0911.1952%2C0911.4424%2C0911.0543%2C0911.2610%2C0911.2198%2C0911.0438%2C0911.4946%2C0911.2941%2C0911.3285%2C0911.2074%2C0911.3645%2C0911.5474%2C0911.3727%2C0911.3755%2C0911.2235%2C0911.1646%2C0911.0762%2C0911.3116%2C0911.0591%2C0911.1364%2C0911.4640%2C0911.3860%2C0911.0299%2C0911.0216%2C0911.3530%2C0911.0552%2C0911.2185%2C0911.5184%2C0911.2049%2C0911.3886%2C0911.3594%2C0911.5517%2C0911.0817%2C0911.0948%2C0911.2883%2C0911.2966%2C0911.2045%2C0911.5147%2C0911.0149%2C0911.5293%2C0911.2749%2C0911.3313%2C0911.4830%2C0911.0681%2C0911.3317%2C0911.3095%2C0911.2034%2C0911.5082%2C0911.0695%2C0911.1720%2C0911.4374%2C0911.3568%2C0911.0805%2C0911.5004%2C0911.5397%2C0911.4538%2C0911.0884%2C0911.3035&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Scale Dependence of Halo Bispectrum from Non-Gaussian Initial Conditions\n  in Cosmological N-body Simulations"}, "summary": "We study the halo bispectrum from non-Gaussian initial conditions. Based on a\nset of large $N$-body simulations starting from initial density fields with\nlocal type non-Gaussianity, we find that the halo bispectrum exhibits a strong\ndependence on the shape and scale of Fourier space triangles near squeezed\nconfigurations at large scales. The amplitude of the halo bispectrum roughly\nscales as $f_nl^2$. The resultant scaling on the triangular shape is consistent\nwith that predicted by Jeong & Komatsu based on perturbation theory. We\nsystematically investigate this dependence with varying redshifts and halo mass\nthresholds. It is shown that the $f_nl$ dependence of the halo bispectrum is\nstronger for more massive haloes at higher redshifts. This feature can be a\nuseful discriminator of inflation scenarios in future deep and wide galaxy\nredshift surveys.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0911.1794%2C0911.5562%2C0911.1458%2C0911.2336%2C0911.4768%2C0911.1755%2C0911.0578%2C0911.2167%2C0911.4286%2C0911.3766%2C0911.4570%2C0911.3055%2C0911.1701%2C0911.5631%2C0911.1035%2C0911.1338%2C0911.5683%2C0911.4262%2C0911.4388%2C0911.4416%2C0911.3703%2C0911.3085%2C0911.3797%2C0911.4392%2C0911.5170%2C0911.1905%2C0911.3554%2C0911.1285%2C0911.4056%2C0911.4931%2C0911.0542%2C0911.5639%2C0911.2840%2C0911.2626%2C0911.1820%2C0911.2117%2C0911.0494%2C0911.1693%2C0911.3529%2C0911.2425%2C0911.4723%2C0911.4744%2C0911.4860%2C0911.1952%2C0911.4424%2C0911.0543%2C0911.2610%2C0911.2198%2C0911.0438%2C0911.4946%2C0911.2941%2C0911.3285%2C0911.2074%2C0911.3645%2C0911.5474%2C0911.3727%2C0911.3755%2C0911.2235%2C0911.1646%2C0911.0762%2C0911.3116%2C0911.0591%2C0911.1364%2C0911.4640%2C0911.3860%2C0911.0299%2C0911.0216%2C0911.3530%2C0911.0552%2C0911.2185%2C0911.5184%2C0911.2049%2C0911.3886%2C0911.3594%2C0911.5517%2C0911.0817%2C0911.0948%2C0911.2883%2C0911.2966%2C0911.2045%2C0911.5147%2C0911.0149%2C0911.5293%2C0911.2749%2C0911.3313%2C0911.4830%2C0911.0681%2C0911.3317%2C0911.3095%2C0911.2034%2C0911.5082%2C0911.0695%2C0911.1720%2C0911.4374%2C0911.3568%2C0911.0805%2C0911.5004%2C0911.5397%2C0911.4538%2C0911.0884%2C0911.3035&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We study the halo bispectrum from non-Gaussian initial conditions. Based on a\nset of large $N$-body simulations starting from initial density fields with\nlocal type non-Gaussianity, we find that the halo bispectrum exhibits a strong\ndependence on the shape and scale of Fourier space triangles near squeezed\nconfigurations at large scales. The amplitude of the halo bispectrum roughly\nscales as $f_nl^2$. The resultant scaling on the triangular shape is consistent\nwith that predicted by Jeong & Komatsu based on perturbation theory. We\nsystematically investigate this dependence with varying redshifts and halo mass\nthresholds. It is shown that the $f_nl$ dependence of the halo bispectrum is\nstronger for more massive haloes at higher redshifts. This feature can be a\nuseful discriminator of inflation scenarios in future deep and wide galaxy\nredshift surveys."}, "authors": ["Takahiro Nishimichi", "Atsushi Taruya", "Kazuya Koyama", "Cristiano Sabiu"], "author_detail": {"name": "Cristiano Sabiu"}, "author": "Cristiano Sabiu", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1088/1475-7516/2010/07/002", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0911.4768v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0911.4768v2", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "27 pages, 10 figures; revised argument in section 6, added appendix\n  C, JCAP accepted version", "arxiv_primary_category": {"term": "astro-ph.CO", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph.CO", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0911.4768v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0911.4768v2", "journal_reference": "JCAP 1007:002, 2010", "doi": "10.1088/1475-7516/2010/07/002", "fulltext": "arXiv:0911.4768v2 [astro-ph.CO] 2 Jul 2010\n\nScale Dependence of Halo Bispectrum from\nNon-Gaussian Initial Conditions in Cosmological\nN-body Simulations\nTakahiro Nishimichi1,3 , Atsushi Taruya2,3 , Kazuya Koyama4 ,\nCristiano Sabiu4,5\n1\n\nDepartment of Physics, School of Science, The University of Tokyo, Bunkyo-ku,\nTokyo 113-0033, Japan\n2\nResearch Center for Early Universe, School of Science, The University of Tokyo,\nBunkyo-ku, Tokyo 113-0033, Japan\n3\nInstitute for the Physics and Mathematics of the Universe, University of Tokyo,\nKashiwa, Chiba 277-8568, Japan\n4\nInstitute of Cosmology and Gravitation, Dennis Sciama Building, University of\nPortsmouth, Portsmouth, PO1 3FX, UK\n5\nDepartment of Physics & Astronomy, University College London, Gower Street,\nLondon, UK\nE-mail: takahiro.nishimichi@ipmu.jp\nAbstract. We study the halo bispectrum from non-Gaussian initial conditions.\nBased on a set of large N -body simulations starting from initial density fields with local\ntype non-Gaussianity, we find that the halo bispectrum exhibits a strong dependence\non the shape and scale of Fourier space triangles near squeezed configurations at large\n2\nscales. The amplitude of the halo bispectrum roughly scales as fNL\n. The resultant\nscaling on the triangular shape is consistent with that predicted by Jeong & Komatsu\nbased on perturbation theory. We systematically investigate this dependence with\nvarying redshifts and halo mass thresholds. It is shown that the fNL dependence of\nthe halo bispectrum is stronger for more massive haloes at higher redshifts. This\nfeature can be a useful discriminator of inflation scenarios in future deep and wide\ngalaxy redshift surveys.\n\n\f2\n1. Introduction\nThe standard cosmological model has successfully explained the observed statistical\nproperties of the cosmic microwave background (CMB) radiation and the large scale\nstructure (LSS) traced by galaxies (e.g., [1, 2]). The model usually assumes that\nthe primordial density/temperature/curvature fluctuations follow Gaussian statistics.\nRecently, however, possible deviations from standard Gaussian statistics has attracted\ngreat attention with rapid progress in observational techniques. It offers an opportunity\nto access cosmological information beyond traditional power spectrum analysis. Many\nrecent works have discussed the constraints and future detectability of possible\ndeviations from Gaussianity through the observations of CMB and LSS (e.g., [3, 4]).\nAccording to the inflationary scenarios, primordial curvature perturbations are\ngenerated during the accelerated phase of cosmic expansion. The simplest inflation\nmodels, in which the inflation takes place with the slow-roll single scalar field that has\na canonical kinetic structure, generally predicts a nearly scale-invariant spectrum of\ncurvature perturbations, and a small departure from Gaussianity. On the other hand,\na variety of inflation models that produce a large non-Gaussianity has been recently\nproposed (see [5] for a review). Among these, the models with large non-Gaussianity\ngenerated by non-linear dynamics on super-horizon scales can have a generic prediction\nfor non-Gaussian properties. Denoting a Gaussian field by ΦG (x), the Bardeen's\ncurvature perturbation during the matter era is characterized as [3]:\nn\n\no\n\nΦ(x) = ΦG (x) + fNL Φ2G (x) − hΦ2G (x)i + * * * .\n\n(1)\n\nThis type of non-Gaussianity, described as a local function of the Gaussian field, is often\ncalled local type non-Gaussianity, and the leading-order coefficient fNL , which controls\nthe strength of non-Gaussianity, has information on the generation mechanisms for nonGaussian fluctuations. Although the current constraint on the parameter fNL from CMB\ndata is −9 < fNL < 111 (95%C.L.) [1] and it is still consistent with Gaussian (fNL = 0),\nthe constraint will be tightened by the on-going CMB experiment, Planck [6]. As\nstandard inflation models generally predict |fNL| ≪ 1, detection of large non-Gaussianity\nimmediately implies the non-standard mechanism for generation of primordial curvature\nperturbations.\nIn this paper, we focus on how this type of non-Gaussianity alters the statistical\nproperties of LSS. Let us first define the power spectrum of mass density fluctuations\nassuming isotropy and homogeneity:\nhδm (k1 )δm (k2 )i ≡ (2π)3 δD (k1 + k2 )Pm (k1 ),\n\n(2)\n\nwhere δm (k) denotes the Fourier transform of the density contrast, while δD (k)\nrepresents the Dirac delta function. If the density field follows Gaussian statistics, its\npower spectrum determines all the statistical properties. Next we define the bispectrum\nof a mass density field:\nhδm (k1 )δm (k2 )δm (k3 )i ≡ (2π)3 δD (k1 + k2 + k3 )Bm (k1 , k2 , k3 ).\n\n(3)\n\n\f3\nSince this is the lowest-order non-vanishing quantity in the presence of non-Gaussianity,\nthe bispectrum is naively expected as the best measure for non-Gaussianity (e.g.,\n[7, 8, 9, 10]).\nRecently, however, the galaxy or halo power spectrum has been reconsidered in the\npresence of local and/or equilateral type primordial non-Gaussianity both analytically\nand numerically (e.g., [11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22]). The matter\npower spectrum or bispectrum is not a direct observable, and the real measurement\nof LSS gives galaxy power spectrum or bispectrum, as defined similarly to equations\n(2) and (3). Since galaxies are biased tracers of the dark matter distribution, the\ninformation of fNL is imprinted in a different manner: a new contribution coming from\nthe primordial non-Gaussianity may dominate over the Gaussian term in the galaxy\n< 0.01hMpc−1 ). This new contribution,\npower spectrum, Pg (k), at very large scales (k ∼\nwhich is sometimes referred to as the \"scale-dependent bias\" of the galaxy power\nspectrum, may be a powerful indicator to constrain fNL . Indeed, it has been recently\napplied to the clustering statistics of SDSS LRG and quasar samples, and the tight\nconstraints on fNL are comparable to those obtained from CMB measurements have\nbeen obtained [19].\nThe purpose of this paper is to examine the bispectrum of biased tracers in detail.\nWhile the matter bispectrum in the presence of primordial non-Gaussianity has been\nstudied in the literature using both perturbation theory and numerical simulations, the\ngalaxy bispectrum may significantly differ from the matter bispectrum in the presence of\nprimordial non-Gaussianity, just like the difference in the power spectra. Since the local\ntype non-Gaussianity can be straightforwardly implemented within N-body simulations,\nnumerical study on the bispectrum for the dark matter haloes is the first important step\ntoward a practical understanding of the galaxy bispectrum.\nIncidentally, Jeong and Komatsu (2009) recently proposed a new parametrized\nmodel for the halo/galaxy bispectrum ([23], see also [21]) based on the peak bias model\n[24] and the local bias model [25]. They found that the formula for the galaxy bispectrum\nused in [10] was missing important contributions from the scale dependent bias effects\nand they discovered new terms that are important at \"squeezed\" configurations where\nk1 , k2 ≫ k3 . It was argued that these new contributions enable us to put stronger\nconstraints on fNL than those obtained in [10]. It is of great importance to confirm the\nscale-dependent bias effects in the bispectrum by N-body simulations.\nThe rest of this paper is organized as follows: we first review the analytical models of\nthe power spectrum and the bispectrum of biased tracers in section 2. We then describe\nthe setup and initial conditions for N-body simulations in section 3. As a first check\nof our simulations, in section 4, we compute the matter and halo power spectra, and\nthe results are compared with previous works. Section 5 gives the main results of this\npaper, in which the simulation results for the matter and halo bispectra are presented\nand compared with predictions from analytic models, particularly focusing on their\nscale dependence. The dependence of the halo bispectrum on the halo mass threshold\nand redshift is also investigated in detail. Section 6 discusses the future prospects for\n\n\f4\ndetecting the primordial non-Gaussianity using the scale-dependent properties of the\nhalo/galaxy bispectrum. Finally, section 7 is devoted to conclusions and discussions.\n2. Theoretical models\nIn this section, we summarize the theoretical predictions of the power spectrum and\nbispectrum. We use perturbation theory to examine the matter power spectrum and\nbispectrum, and then present those of biased tracers based on the local bias model.\n< 0.1h Mpc−1 ), the non-linearity of gravitational\nFor the scales of our interest (k ∼\nevolution is moderate and the perturbation theory is valid and trustful. We especially\nfocus on the behavior of the bispectrum in the squeezed limit on large scales, where\nk ≡ k1 = k2 ≡ αk3 , k → 0 and α ≫ 1.\nLet us first consider the matter density fluctuation. We perturbatively expand this\nas\n(1)\n(2)\n(3)\nδm (k; z) = δm\n(k; z) + δm\n(k; z) + δm\n(k; z) + * * * .\n\n(4)\n\nThe linear-order solution is related to the Bardeen's curvature perturbation in equation\n(1) in Fourier space by\n(1)\nδm\n(k; z) = M(k; z)Φ(k),\n\n(5)\n\nwhere the conversion factor M is defined as\n2 k 2 T (k)D(z)\n.\n(6)\nM(k; z) ≡\n3 Ωm H02\nIn the above, Ωm is the current matter density normalized by the critical density, H0 is\ncurrent Hubble constant, T (k) denotes the matter transfer function normalized to unity\nat k → 0 and D(z) is the linear growth rate normalized to the scale factor in the limit\n(n)\nof matter dominant era. The higher-order solutions, δm\n(k; z), are formally written as\n(n)\nδm\n(k; z)\n\n=\n\nZ\n\n(1)\n(1)\nd3 q 1 * * * d3 q n δD (k − q 1...n )Fn (q 1 , . . . , q n )δm\n(q 1 ; z) * * * δm\n(q n ; z),\n\n(7)\n\nwhere q 1...n ≡ q 1 + * * * + q n , and Fn are the kernel functions (see [26] for a review).\n(1)\nThen keeping terms up to fourth order in δm\n, the power spectrum and bispectrum of\nthe matter density fluctuations are given by (e.g., [13, 10])\nPm (k; z) = P0 (k; z) + 2\n\nZ\n\nd3 q\nF2 (q, k − q)B0 (−k, q, k − q; z)\n(2π)3\n\nd3 q\n{F2 (q, k − q)}2 P0 (q; z)P0 (|k − q|; z)\n(2π)3\nZ 3 3\nd pd q\nF2 (p, k − p)F2 (q, −k − q)T0 (p, k − p, q, −k − q; z),\n+\n(2π)6\nZ\nd3 q\n+ P0 (k; z)\nF3 (k, q, −q)P0 (q; z),\n(8)\n(2π)3\n\"\n#\nP0 (k1 ; z)P0 (k2 ; z)M(k3 ; z)\nBm (k1 , k2 , k3 ; z) = 2fNL\n+ (cyc.)\nM(k1 ; z)M(k2 ; z)\n+ 2F2 (k1 , k2 )P0 (k1 ; z)P0 (k2 ; z) + (cyc.),\n(9)\n+ 2\n\nZ\n\n\f5\nwhere (cyc.) denotes the cyclic permutations over the indices and P0 , B0 , and T0 are\n(1)\nthe power-, bi-, and tri-spectra of δm\n. In equation (8), the second term is the first nontrivial correction in the presence of primordial non-Gaussianity, and the function B0\nimplies the primordial bispectrum, which corresponds to the leading-order contribution\nin equation (9). Note that the contribution coming from the primordial trispectrum T0\nis small for local type non-Gaussianity with reasonable values of fNL , and we drop this\nterm in computing Pm (see [13]).\nOn the other hand, the power spectrum of biased tracers has been recently discussed\nin the literature [11, 14, 19, 12, 20, 13], based on several different formalisms including\npeak bias, halo bias according to the peak-background split, and local bias. The\nresultant expressions of the galaxy/halo power spectrum are basically the same, and\nare summarized in the form\n)2\n(\nb̃2\n−1\n2\nfNL M (k; z)\nP0 (k; z),\n(10)\nPg (k; z) = b1 1 + 2\nb1\nwhere b1 and b̃2 are the bias parameters relating the galaxy overdensity to the matter\noverdensity. In Appendix A, we present a derivation of (10) based on the local bias\nformalism. The explicit expressions for the bias parameters b1 and b̃2 can be obtained\nboth from the peak bias and halo bias formalisms, and their results are basically the\nsame in the high-peak/threshold limit. In Appendix B, we show that in the high-peak\nlimit, there is a clear relationship between the peak bias and the local bias prescriptions,\nand the parameters b1 and b̃2 are related to each other in terms of the critical density\nof the spherical collapse model, δc ≈ 1.686, as b̃2 = δc (b1 − 1).\nIn equation (10), the factor in the braces manifestly depends on the scale, which\nis the main source for \"scale-dependent bias\". On large scales (k → 0), the function\nM is roughly proportional to k 2 , and it strongly affects the galaxy power spectrum.\nIn this respect, the scale-dependent property will be a clear indicator of primordial\nnon-Gaussianity of the local type, and it has been extensively tested against Nbody simulations. Several recent studies have suggested that some modifications to\nthis formula are required in order to model the scale-dependent bias more accurately\n[15, 16, 18]. For example, [18] proposed a slight modification to the relation of bias\nparameters, which reproduces results from N-body simulations very well:\nb̃2 = δc q (b1 − 1),\n\n(11)\n\nwith q = 0.75, which comes from the ellipsoidal collapse model.\nNow, we turn our focus to the bispectrum of biased tracers in the presence of\nprimordial non-Gaussianity. According to the analytical study by [23] (see also [21]), the\neffect of local-type primordial non-Gaussianity is mainly imprinted on the bispectrum\nof squeezed triangular configurations. The galaxy bispectrum is then expressed as\n2\nBg (k, α; z) = Bg(0) (k, α; z) + fNL Bg(1) (k, α; z) + fNL\nBg(2) (k, α; z),\n\n(12)\n\nwhere each term of the right-hand side of this equation has the following asymptotic\nform:\n2\nBg(0) (k, α; z) ≃ b21 b2 Pk→0\n(z) k 2ns α0 ,\n\n(13)\n\n\f6\n\u0014\n\nBg(1) (k, α; z) ≃ 4b31 +\n\n\u0012\n\n26\n2\n2ns −2 1\n+ I(k, α; R) b21 b̃2 Pk→0\n(z) M−1\nα ,\nk→0 (z) k\n7\n(14)\n\u0013\n\n\u0015\n\n2\n2ns −4 3\nBg(2) (k, α; z) ≃ 8 b21 b̃2 Pk→0\n(z) M−2\nα .\nk→0 (z) k\n\n(15)\n\nHere, we focused on the isosceles triangles, and parametrized their dependence as\nk ≡ k1 = k2 ≡ αk3 , and ns denotes the scalar spectral index. See Appendix A for\na more rigorous expression. The function I(k, α; R) weakly depends on k, α and the\nsmoothing scale, R, and it can be approximated as 26/7 + I(k, α; R) ∼ 34 on large\nscales. In the above, we take the limit of k → 0 and α ≫ 1, and Pk→0, Mk→0 are\ndefined through P0 (k; z) → Pk→0 (k)k ns , M(k; z) → Mk→0(z)k 2 . See Appendix A and\nalso [23] for more details.\nSimilar to the scale dependence of the galaxy/halo power spectrum in equation\n(10), the amplitude of bispectrum is also affected by the primordial non-Gaussianity\nin a scale-dependent way. In particular, the term Bg(2) , which is of quadratic order in\nfNL , becomes dominant on large scales and exhibits a behavior strongly dependent on\nk and α. Thus, we might conclude that this is the most important indicator of fNL ,\ncapable of detecting the primordial non-Gaussianity with upcoming galaxy surveys of\nlarge volumes.\nIn what follows, we will examine this scale dependence in the bispectrum of\nsimulated dark matter haloes, with particular attention on the squeezed configurations\non large scales.\n3. N-body Simulations\n3.1. Setup\nWe adopt the WMAP5 best-fit flat ΛCDM model [1]: Ωm = 0.279, ΩΛ = 0.721,\nΩb = 0.046, h = 0.701, σ8 = 0.817 and ns = 0.96, where Ωm , ΩΛ and Ωb are the\nmatter density, cosmological constant and the baryon density normalized by the critical\ndensity, h is Hubble constant normalized by 100 km s−1 Mpc−1 , σ8 is the r.m.s. linear\ndensity fluctuation smoothed by a top hat window function with radius of 8h−1 Mpc and\nns is the scalar spectral index. We calculate the linear matter transfer function using the\nCAMB code [27]. We have completed a total of 140 realizations of matter clustering data:\n20 per each of the seven values for the local-type primordial non-Gaussianity parameter,\nfNL = 0, ±100, ±300 and ±1000. All the simulations were ran with the Gadget2 code\n[28]. We adopt N = 5123 particles in boxes of side 2000h−1 Mpc, and set the softening\nlength being 0.2h−1 Mpc. The parameters adopted in the simulations are the same as in\n[29, 30]. We have tested the mass/force resolution by changing the box size and found\n< 0.3hMpc−1 )\nthat the results are well converged at large scales (∼ 1% accuracy at k ∼\nfor the matter power spectrum.\nIn setting the initial conditions, we first generate a random Gaussian field, ΦG ,\nwhose power spectrum is proportional to k ns −4 . We then apply the inverse Fourier\n\n\f7\ntransform, and add the non-Gaussian contributions in real space according to equation\n(1). Finally the real-space quantity is transformed back to the Fourier space, and\nconverted to the linear density fluctuations by multiplying M(k; z) defined in equation\n(6). We use second-order Lagrangian perturbation theory to calculate the displacement\nfield for 5123 particles placed on a regular lattice [31] at z = 31.\nWe store outputs at z = 2, 1 and 0.5, and identify haloes for each output using\na FOF group finder with linking length of 0.2 times the mean separation. We select\nhaloes in which the number of particles, N, is equal to or larger than 10, corresponding\nto the haloes with masses 4.6 × 1013 h−1 M⊙ . We also analyze haloes with N ≥ 20 and\nN ≥ 30 to see the dependence on halo mass.\nAs a first check of the reliability of our simulations, we show in Fig. 1 the ratio\nof halo mass function with and without primordial non-Gaussianity, R(M; fNL ) ≡\nnnG (M; fNL )/nG (M), at z = 0.5, where different colors correspond to different values of\nfNL : 1000, 300, 100, 0, −100, −300 and −1000 from top to bottom. Both simulations\nand theoretical models suggest that the local type non-Gaussianity alters the mass\nfunction at the high-mass tail in the literature: a positive (negative) fNL enhances\n(suppresses) the tail. As shown in Fig. 1, our simulations agree well with previously\nproposed analytical models. The plotted lines show the model proposed by [32] (solid):\nδ2\nd(σR S3 )\nδ4\n1 σR2\nS3 ec4 − 2 ec2 − 1 +\nR(M; fNL ) = 1 +\n6 δec\nσR\nσR\nd ln σR\n\"\n\n!\n\n2\nδec\n−1\nσR2\n\n!#\n\n, (16)\n\nbased on the Edgeworth expansion to the probability density function, and by [33]\n(dashed):\nδ 3 S3\nR(M; fNL ) = exp ec 2\n6 σR\n\n!\n\nq\n1\nδec\ndS3\nq\n+ 1 − δec S3 /3 , (17)\n6 1 − δec S3 /3 d ln σR\n\nobtained by the saddle-point approximation to the level excursion probability. In the\n2 1/2\n3\nabove, σR ≡ hδm\ni and S3 ≡ hδm\ni/σR4 . These quantities are given as the function of\nmass M through the relation M = (4π/3)ρm R3 , and linearly extrapolated to z = 0.5.\nWe also define δec ≡ qδc again motivated by ellipsoidal collapse model [18]. See also [16]\nfor another model designed to fit to their N-body simulations.\nThere are several claims on the systematics for the estimated halo mass by FOF,\nand in fact our mass function fits better with [33] when we correct that effect using the\nempirical formula of [34]. We conclude here that our halo catalog is accurate enough to\ninvestigate its clustering statistics.\n3.2. Measurements of the power spectrum and bispectrum\nHere, we briefly mention how to measure the power spectrum and bispectrum in our\nsimulations.\nWe assign particles (or haloes) to 10243 grid points using the Cloud-in-Cells (CIC)\nalgorithm [35]. We then Fourier transform the density field, and divide each mode by\nthe Fourier transform of the CIC kernel to correct for the effect of assignment. We\n\n\f8\n\n2.0\n\nz=0.5\nq=0.75\n\nnnG(M)/nG(M)\n\n1.5\n\n1.0\n\n0.5\nL08\nM00\n\n0.0\n\n5\n\n10+14\n\n2\n5 10+15\nM [h−1Msun]\n\n2\n\n5\n\nFigure 1. The ratio of the halo mass functions for non-Gaussian and Gaussian initial\nconditions at z = 0.5. The symbols show the measurements from our simulations,\nwhile the lines are equations (16) and (17). The values of fNL are 1000, 300, 100, 0,\n−100, −300, and −1000 from top to bottom.\n\nmade sure that the results are well converged at the scale of our interest by changing\nthe number of grid points. We logarithmically divide the measured power spectrum\nand bispectrum into wave number bins starting from kmin = 0.003hMpc−1 and with 10\nbins per decade. We select \"isosceles\" triangles, whose two longer sides, k1 and k2 , fall\ninto the same bin for the bispectrum analysis. In this sense our isosceles triangles are\nnot strictly isosceles, but we adopt this convention to reduce the statistical errors on\nthe measured bispectrum caused by small number of triangles in k-space. In plotting\nresults, we assign each data point to the logarithmic-central value of wave number in\nthat bin.\n4. Results of Power Spectrum\nIn this section, we present the power spectrum measured from N-body simulations\nWe first compare the measured matter power spectrum with the perturbation theory\nprediction. We then present the halo power spectrum, and compare it with the analytic\n\n\f9\nmodels proposed in the literature. These are important sanity checks to justify the\nresults of our simulations in subsequent sections.\n4.1. matter power spectrum\nWe first examine the matter power spectrum, in cases with non-zero fNL . Fig. 2 shows\nthe fractional difference of the matter power spectra between Gaussian and non-Gaussian\ninitial conditions measured at z = 0.5. The symbols represent fNL = 300, 100, 0, −100\n> 0.02hMpc−1 . Since we use the same set of random\nand −300 from top to bottom at k ∼\nseeds for the seven fNL parameters, the cosmic variance is effectively canceled out by\ntaking the ratios, PmnG (k; z)/PmG (k; z). Overall, the deviations from Gaussian results\nthemselves are very small (less than 1% when |fNL| = 100 in the plotted range).\nIn Fig. 2, we also plot the predictions based on perturbation theory of [13], depicted\nas continuous lines. Note that recently, Ref. [36] developed another analytical model\nbased on the Time-RG approach, which would be more accurate in the weakly nonlinear\nregime. However, the standard perturbation theory prediction of [13] is accurate enough\n< 0.05hMpc−1 ), as was shown by comparisons with\nat the scale of our interest (i.e., k ∼\nN-body simulations in Refs. [15, 16].\nFig. 2 shows that the results of our N-body simulations are in reasonably good\nagreement with the model of [13], except for the case of a large non-Gaussianity with\nfNL = 300. The discrepancy between N-body and analytic results seen in the fNL = 300\ncase might be partially ascribed to the term coming from the primordial trispectrum in\nequation (8), which is neglected in the perturbation theory calculations. Nevertheless,\nthe discrepancy remains at the sub-percent level, and thus does not seriously affect the\nlater analysis of the matter/halo bispectrum.\n4.2. halo power spectrum\nWe next consider the halo power spectrum for various values of fNL , shown in Fig.\n3. We set the minimum mass of haloes to 4.6 × 1013 h−1 M⊙ , which corresponds to 10\nN-body particles. We also show the analytical prediction of equation (10) with the\nbias parameter b1 fitted to reproduce the results of Gaussian simulations, adopting the\nrelation between bias parameters in equation (11). We plot the model with q = 1 and\nq = 0.75 by dotted and solid lines, which corresponds to the original peak bias prediction\nand the fit by [18], respectively.\nOverall, the scale dependence of the halo power spectrum discussed in the literature\ncan be clearly seen in our simulations with very small statistical errors, owing to the large\ntotal volumes. The agreement between N-body simulations and the analytic models\nbecomes better when we choose q = 0.75, consistent with [18].\nNote, however, that the choice of q = 0.75 does not necessarily imply the bestfit results: q = 0.85 gives a better fit to this particular case, and the best-fit value\nof q changes with redshift and minimum halo mass. This might indicate that there\nexists some systematic effects on the halo clustering properties in our simulations. One\n\n\f10\n\n0.015\n\nz=0.5\nPmnG(k;z)/PmG(k;z) − 1\n\n0.010\n0.005\n0.000\n\nfNL= 300\n100\n0\n−100\n−300\n\n−0.005\n−0.010\n−0.015\n\n0.005\n\n0.01\n\n0.02\n\n0.05\n\n0.1\n\nk [h Mpc−1]\nFigure 2. Fractional differences of the matter power spectra starting from nonGaussian and Gaussian initial conditions. Symbols show the results of N -body\nsimulations, while lines are perturbation theory predictions of equation (8) (fNL =\n> 0.02hMpc−1 ).\n300, 100, 0, −100, −300 from top to bottom at k ∼\n\npossibility is the difference in the halo finding algorithms: while we adopt the FOF\nfinder, [18] use a SO finder. See also [15], where they use a FOF finder and proposed a\nfit corresponding to q = 0.8.\nWe may further improve the agreement between N-body simulations and theoretical\npredictions by including some corrections to the theory. Ref. [16] showed that the\ninclusion of two corrections coming from the changes in halo mass function and the\nmatter power spectrum actually improves their results. These systematics will definitely\nbe important for the application to the upcoming surveys, however, we do not pursue\nthis issue in the present paper, since our primary focus is on the halo bispectrum.\n5. Results of Bispectrum\nIn this section, we present the bispectrum measured from N-body simulations.\nThroughout the analysis, we consider the isosceles triangles for the configuration of\nbispectrum, which are characterized by the two parameters k and α, defined by\nk ≡ k1 = k2 ≡ αk3 . We pay special attention to the squeezed triangles, α ≫ 1.\n\n\f11\n\n10+7\n\nz=0.5\n\nMmim=4.6x1013h−1Msun\nq=1.0\nq=0.75\n\nPh(k;z)\n\n10+6\n\n10+5\n\n300\n100\n0\n−100\n−300\n\n10+4\n\n10+3\n\n0.005\n\n0.01\n\n0.02\n\n0.05\n\n0.1\n\nk [h Mpc−1]\nFigure 3. The power spectrum of haloes more massive than 4.6 × 1013 h−1 M⊙ at\nz = 0.5. Symbols are results of N -body simulations, while lines are theoretical\nprediction of equation (10) with (11) where we adopt q = 1.0 for dotted lines and\nq = 0.75 for solid lines (fNL = 300, 100, 0, −100, −300 from top to bottom).\n\nWe first present the results of the matter bispectrum (Sec. 5.1), and then discuss how\nthe halo bispectrum differs from the matter bispectrum (Sec. 5.2). While we mainly\nanalyze the default halo catalog with minimum mass Mmin = 4.6 × 1013 h−1 M⊙ and\noutput redshift z = 0.5, we briefly discuss how the results are changed when we vary\nthe minimum halo mass and redshift (Sec. 5.2.3).\n5.1. matter bispectrum\nLet us present the results of the measured matter bispectrum. In Fig. 4, the symbols in\neach panel show the amplitude of the bispectrum measured from simulations for various\nfNL at a fixed triangle specified by k and α indicated in the panel. We also show the\nperturbation theory prediction of equation (9) by solid lines. Note that the value of α\nincreases from right to left, while k increases from top to bottom.\nAlthough we have very large total volume, the statistical uncertainty due to\nfiniteness of the simulated volume still affects the measurements. We thus take account\n\n\f12\nof this effect in the perturbation theory predictions: we compute the matter bispectrum\nusing the second-order perturbation theory starting from linear density field realized in\nfinite-volume boxes which were used to generate the initial conditions of the simulations,\nand take average over realizations. Namely, we compute\nh\n\n(1)\n(1)\n(1)\nRe δm\n(k1 )δm\n(k2 )δm\n(k3 )\n\ni\n\n(2)\n(1)\n(1)\n(1)\n(2)\n(1)\n(1)\n(1)\n(2)\n+ δm\n(k1 )δm\n(k2 )δm\n(k3 ) + δm\n(k1 )δm\n(k2 )δm\n(k3 ) + δm\n(k1 )δm\n(k2 )δm\n(k3 ) ,\n\n(18)\n\nand take the average over the realizations and triangles in the bin for the perturbation\ntheory prediction. As a result, the analytical predictions are in good agreements with\nmeasurements from simulations.\nThe matter bispectrum from both simulations and perturbation theory clearly\nexhibits a linear dependence on fNL for all the configurations plotted in Fig. 4. Based\non this results, we will discuss how the dependence on fNL is modified for the halo\nbispectrum.\n5.2. halo bispectrum\nWe are now in a position to show the halo bispectrum. Since this is the first numerical\nstudy on the halo bispectrum in the presence of local type non-Gaussianity, it is\nimportant to understand the N-body results in a model-independent manner. In this\nsubsection, we first show the fNL dependence of the halo bispectrum. We then consider\nthe scale dependence and compare the simulation results with the theoretical prediction\nof [23]. The dependence on the minimum halo mass and redshift is also investigated in\nsection 5.2.3.\n5.2.1. fNL dependence In order to quantitatively study the fNL dependence of the halo\nbispectrum, we use all the halo catalogs with various values of fNL , and fit the measured\nbispectrum to the polynomial form:\nBh (k, α; z|fNL ) =\n\n4\nX\n\n(i)\n\ni\nfNL\nBh (k, α; z),\n\n(19)\n\ni=0\n\nusing the standard χ2 fitting with the variance of the data points measured from Nbody simulations. For specific configurations of (k, α), we determine the parameters\n(i)\nBh using the halo catalogs with different values of fNL . We confirmed that the results\nare almost unchanged when we add higher-order polynomials with i ≥ 5.\nIn Fig. 5, we show the measured bispectrum as function of fNL for the same set of\ntriangular configurations as plotted in Fig. 4. Note again that the value of α increases\nfrom right to left panels, while k increases from top to bottom panels. The fitted results\nof Eq. (19) truncating at the first order (i = 0, 1), second order (i = 0 ∼ 2) and fourth\norder (i = 0 ∼ 4) are shown respectively as dotted, dashed and solid lines. Although\nwe do not show the points at fNL = ±1000 in order to focus on more realistic values of\nfNL , we take account of these results when we fit the N-body data to Eq. (19).\n\n\f13\n4.\n\nz=0.5\n\n10+9\n2.\n\n0.\n\nα=12.6\n\n−2.\n\nk=0.042h/Mpc\n\nα=10.0\nk=0.042h/Mpc\n\nα=7.94\nk=0.042h/Mpc\n\n1.5\n10+9\n\nPT\n\nBm(k,α;z)\n\n1.0\n\n0.5\n\n0.0\n\nα=12.6\n−0.5\n\nk=0.067h/Mpc\n\nα=10.0\nk=0.067h/Mpc\n\nα=7.94\nk=0.067h/Mpc\n\n5.\n10+8\n4.\n3.\n2.\n1.\n0.\n\nα=12.6\nk=0.106h/Mpc\n\n−1.\n\nα=10.0\nk=0.106h/Mpc\n\nα=7.94\nk=0.106h/Mpc\n\n−2.\n−1000\n\n−500\n\n0\n\n500\n\n1000 −1000\n\n−500\n\n0\n\n500\n\n1000 −1000\n\n−500\n\n0\n\n500\n\n1000\n\nfNL\nFigure 4. The matter bispectrum. Each panel shows the results for an isosceles\nconfiguration specified by α ≡ k1 /k3 and k ≡ k1 = k2 . Symbols are measurements from\nN -body simulations (the average and the standard error among different realizations)\nand solid lines are the perturbation theory predictions of equation (9).\n\n(2)\n\nThe second-order term (Bh ) becomes more significant in moving from bottom\nto top and from right to left, and in the end, the top-left panel (k = 0.042hMpc−1 ,\n(2)\n(3)\n(4)\nα = 12.6) shows strong evidence of Bh . Higher order terms (Bh and Bh ) seem to\n< 100, although they may play\nhave almost no effect on the total bispectrum when |fNL | ∼\n(2)\nsome roles at fNL = ±300 (and also ±1000). This second order term, Bh , is not seen\nin the matter bispectrum (Fig. 4) and we for the first time confirme that this really\nexists in the halo clustering in N-body simulations.\n\n\f14\n4.\n10+11\n\nMmin=4.6x1013h−1Msun\n\nz=0.5\n\n3.\n\nα=12.6\n\nα=10.0\n\nα=7.94\n\nk=0.042h/Mpc\n\nk=0.042h/Mpc\n\nk=0.042h/Mpc\n\n2.\n\n1.\n\n0.\n\n1.0\n10+11\n\nBh(k,α;z)\n\n0.8\n0.6\n0.4\n\nα=12.6\n\nα=10.0\n\nα=7.94\n\nk=0.067h/Mpc\n\nk=0.067h/Mpc\n\nk=0.067h/Mpc\n\nα=10.0\nk=0.106h/Mpc\n\nα=7.94\nk=0.106h/Mpc\n\nB(0)+fNLB(1)+fNL2B(2)\n+fNL3B(3)+fNL4B(4)\nB(0)+fNLB(1)+fNL2B(2)\nB(0)+fNLB(1)\n\n0.2\n0.0\n2.0\n+10\n\n10\n\n1.5\n\nα=12.6\nk=0.106h/Mpc\n\n1.0\n\n0.5\n\n0.0\n\n−0.5\n−400\n\n−200\n\n0\n\n200\n\n−400\n\n−200\n\n0\n\n200\n\n−400\n\n−200\n\n0\n\n200\n\n400\n\nfNL\nFigure 5. The halo bispectrum for some triangular configurations. Each panel shows\nthe result for an isosceles configuration specified by α ≡ k1 /k3 and k ≡ k1 = k2 .\nError bars are measurements from our simulations (the average and the standard error\namong different realizations) and solid lines are their 4-th order polynomial fits, while\nwe keep the terms up to second and linear order for dashed and dotted lines. We use\nthe outputs at z = 0.5 and consider the haloes more massive than 4.6 × 1013 h−1 M⊙ .\n\n\f15\n5.2.2. shape and scale dependence We next investigate the scale dependence of\n(i)\nBh (k, α; z). We show them in Fig. 6 for fNL = 100. The left panel shows the α\ndependence when the wave number k is fixed to 0.042hMpc−1 , while the right panel\ndisplays the k dependence when α = 12.6. The analytic prediction based on local bias\n(0)\n(1)\n(2)\n(see §2 and Appendix A) predicts Bh ∝ k 2 α0 , Bh ∝ k 0 α1 and Bh ∝ k −2 α3 in the\nsqueezed limit at large scales (k → 0, α ≫ 1), and we show these asymptotic scalings\nby short straight lines (normalizations are arbitrary).\nThe α dependence in the left panel is quite consistent with the theoretical\npredictions, and the results strongly indicate that the theoretical model captures the\nnature of the shape dependence. On the other hand, the k dependence measured from\nN-body simulations seems different from that predicted by the theoretical model. This\nimplies that the wave numbers shown in the figure are not sufficiently small, and the\napproximation used in deriving the theoretical predictions is not valid. We expect\nthat the asymptotic scaling appears only at the scales larger than the turn over of the\npower spectrum (i.e., T (k) ≃ 1). In fact, the value of the matter transfer function at\nk = 0.042hMpc−1 , corresponding to the wavenumber at the left-most bin in the panel,\nis T (k) = 0.293, and thus the approximation of M(k) ≃ Mk→0 k 2 used in equation (12)\ncannot be applied. One can find a similar feature in Fig. 7 of Ref. [21] where the authors\ncompute the galaxy bispectrum using one-loop perturbation theory adopting the local\nbias model. Although it illustrates the galaxy bispectrum for equilateral triangles, the\n< 0.03hMpc−1 ).\nasymptotic power law feature appears only at very large scale (i.e., k ∼\n(2)\n(1)\n(0)\nNevertheless, both simulations and theory suggest that Bh > Bh > Bh at the\n(2)\nlimit of small k. The Bh term will play an important role in constraining fNL from\nfuture surveys where we can investigate such large scales.\n5.2.3. dependence on halo mass and redshift So far, we have concentrated on the\nhaloes with Mhalo ≥ 4.6 × 1013 h−1 M⊙ at z = 0.5. In this subsection, we extend our\nanalysis to the haloes with higher mass thresholds and at different redshifts to see the\ndependence of the halo bispectrum on these quantities. For this purpose, we specifically\nconsider the squeezed triangle with k = 0.042hMpc−1 and α = 12.6, corresponding to\nthe configuration shown in the top-left panel of Fig. 5, and plot in Fig. 7 the amplitude\nof the bispectrum against fNL for different mass thresholds (left) and redshifts (right).\nIn the left hand panel, each symbol and a line respectively correspond to the\nmeasurements and the polynomial fit based on equation (19) for a fixed minimum\nmass of haloes given by Mmin = 4.6 × 1013 h−1 M⊙ (square/solid), 9.2 × 1013 h−1 M⊙\n(triangle/dashed) and 1.4 × 1014 h−1 M⊙ (circle/dotted). Similar to Fig. 5, we can see a\n(2)\nclear quadratic dependence on fNL , but the role of the quadratic term Bh seems more\nsignificant for haloes with larger minimum masses.\nIn the right hand panel, each symbol and line respectively show the measurements\nand a fit at the specific redshifts z = 0.5 (square/solid), 1 (triangle/dashed) and 2\n(circle/dotted). Here, we fix the minimum halo mass to Mmin = 4.6 × 1013 h−1 M⊙ .\nAgain, one can see the quadratic dependence on fNL , which become more important for\n\n\f16\n10+11\n\nz=0.5\n\nfNL=100\n\nz=0.5\n\n10+11\n\nk=0.042h/Mpc\n\nfNL=100\nMmin=4.6x1013h−1Msun\n\nMmin=4.6x1013h−1Msun\n\n10+10\n\nB(0)\n\nBh(k,α;z)\n\nBh(k,α;z)\n\nα=12.6\n\n(1)\n\nB\n\n10+9\n\nB(1)\n\n10+9\n\nα0\n\n2.\n\nB(2)\n\nk0\nk−2\n\nα3\n\n+8\n\nB(0)\n\nk2\n\nα1\n\nB(2)\n\n10\n\n10+10\n\n10+8\n\n5.\n\n10.0\n\n0.04\n\n0.06\n\n0.08\n\n0.1\n\nk [h Mpc−1]\n\nα\n\nFigure 6. Shape and scale dependence of the halo bispectrum. left: α dependence\nwhen k is fixed, right: k dependence when α is fixed. We plot the results at z = 0.5\nfor haloes more massive than 4.6 × 1013 h−1 M⊙ when fNL = 100. Error bars are\nmeasurements from our simulations, while dotted, dashed and solid lines are terms\n0\n1\n2\nwhich scale as fNL\n, fNL\n, and fNL\n, respectively. Short straight lines are corresponding\nanalytical prediction in the squeezed limit.\n\nhigher redshifts.\n2\n10+12\n\nMmin=4.6x1013h−1Msun\n\n2\n\nz=0.5\n\nz=2\n\n10+13\n\nMmin=1.4x1014h−1Msun\n9.2x1013h−1Msun\n\n5\n\n4.6x1013h−1Msun\n\nBh(k,α;z)\n\nBh(k,α;z)\n\n5\n2\n10+11\n0.5\n10+11\n0.0\n\n−1.0\n−400\n\n−200\n\n0\n\nfNL\n\n200\n\n10+12\n0.5\n10+12\n0.0\n\nα=12.6\nk=0.042h/Mpc\n\n−0.5\n\nz=1\n\n2\n\nα=12.6\n\nz=0.5\n\n−0.5\n400\n\n−1.0\n−400\n\nk=0.042h/Mpc\n−200\n\n0\n\n200\n\n400\n\nfNL\n\nFigure 7. left: Mass dependence of the halo bispectrum at z = 0.5. Symbols and\nlines are similar to Fig. 5, but we fix the triangular configuration to be the same as\nthe top-left panel, while changing the minimum halo mass: 4.6 × 1013 , 9.2 × 1013 and\n1.4×1014h−1 M⊙ for squares, triangles, and circles, respectively. Note that although we\ndo not show the results for fNL = ±1000, we take them into account for the polynomial\nfitting. Note also that the vertical axis is logarithmic above the dot-dashed horizontal\nline, while it is linear below it. right: same as left panel but the redshift dependence\nfor a fixed minimum halo mass (4.6 × 1013 h−1 M⊙ ). Squares, triangles, and circles\ncorrespond to z = 0.5, 1, and 2, respectively.\n\nAlthough we do not try to find the best halo catalog or optimal weighting scheme to\n\n\f17\nTable 1. The survey parameters used for the forecasts. We assume the one-to-one\ncorrespondence between haloes and galaxies to compute the minimum halo mass and\nthe bias parameter from the number density.\n\nsurvey\nIDEAL\nREALISTIC\nDEEP\n\nz V [h−3 Gpc3 ]\n1.0\n100\n1.0\n10\n2.0\n3\n\nng [h3 Mpc−3 ]\n1 × 10−3\n5 × 10−4\n3 × 10−4\n\nMmin [h−1 M⊙ ] b1\n2.8 × 1012\n1.9\n12\n5.0 × 10\n2.2\n12\n3.4 × 10\n3.3\n\ndetect the signal of fNL here, the balance between having denser samplings and getting\nhigher signals for fNL by selecting massive haloes is clearly very important. We will\ninvestigate these issues elsewhere.\n6. Prospects for future survey\nIn this section, we discuss future prospects to detect fNL through the measurements of\nthe bispectrum. We especially pay attention to the importance of the higher order term,\n(2)\nBg(2) in equation (20), which is defined in analogous to Bh in equation (19) that scales\n2\nas fNL\n.\nWe consider three representative surveys: (i) idealistic survey with a huge volume\nand a deep sampling (V = 100h−3 Gpc3 , ng = 1 × 10−3 h3 Mpc−3 , z = 1), (ii)\nrealistic survey with a large volume accessible in near future (V = 10h−3 Gpc3 , ng =\n5 × 10−4 h3 Mpc−3 , z = 1), and (iii) deep survey (V = 3h−3 Gpc3 , ng = 3 × 10−4 h3 Mpc−3 ,\nz = 2). Parameters of these three surveys roughly correspond to EUCLID [37], SuMIRe\n[38] and HETDEX [39], respectively, except for the slightly smaller value of redshift\nin the deep survey. Although the mass resolution of the current simulations are not\nsufficient to reproduce the same number density of galaxies in those surveys, it is worth\ngiving a rough estimate of the detectability.\nUnder the assumption of the one-to-one correspondence between haloes and\ngalaxies, we first estimate the minimum halo mass Mmin that reproduces the mean\ngalaxy number density, ng , for each survey. We use the mass function of [40] to derive\nthe minimum value, Mmin . We then compute the linear bias parameter, b1 , using the\nSheth & Tormen fit [41]. The resultant minimum masses and bias parameters are\nsummarized in Tab. 1.\nBased on our numerical experiments, we focus on the isosceles triangles with\nk = 0.042hMpc−1 (see the left panel of Fig. 6), and model the galaxy bispectrum\nsimilar to the halo bispectrum (19) as\nh\n\ni\n\n2\nBg (α; z, Mmin ) = B (0) (z, Mmin ) 1 + fNL αC (1) (z, Mmin ) + fNL\nα3 C (2) (z, Mmin ) .\n\n(20)\n\nWe estimate the coefficients, B (0) , C (1) and C (2) from the three halo catalogs using the\nfitting procedure described in the previous section. We then scale them to the minimum\nhalo masses for the three surveys as follows: for the coefficient B (0) , we scale as ∝ b41 .\n\n\f18\nThis is based on the fact that the term in equation (13), which scales as b21 b2 , is the\ndominant contribution at large scales, and b2 ∝ b21 at the high-peak limit (see Appendix\nB). On the other hand, we assume that C (1) and C (2) do not sensitively depend on Mmin\nand z, and treat them as constants.\nThe left hand panel of Fig. 8 illustrates the scaling of B (0) measured from the Nbody simulations. The triangles, circles and diamonds respectively correspond to the\nmeasurements from N-body simulations at z = 0.5, 1 and 2, respectively. We also show\nthe ∝ b41 scaling by three solid lines. The scaling seems to be a reasonable fit to the\nsimulations. In the right hand panel, we plot C (1) and C (2) as a function of the minimum\nhalo mass at the three redshifts (upper: C (1) , lower: C (2) ). Since we did not detect any\nsignificant change in these coefficients for different mass and redshift, we simply derive\nthe values of C (1) and C (2) from χ2 fits to the N-body data. We extrapolate the three\ncoefficients to the halo masses corresponding to the three surveys. The accuracy of\nthese scalings can only be tested using higher resolution simulations, and so leave this\nfor future work.\n10−2\n\n10+13\n\nC(1)\n−3\n\n10\n\n10+12\nideal\n\nC(2) or C(1)\n\nB(0)\n\n10−4\n\n10+11\n\ndeep realistic\nz=0.5\nz=1\n\n10−5\n\nz=2\n\n10−6\n\n10+10\n\nC(2)\n\ndeep\n\n−7\n\n10\n\nrealistic\nideal\n\n10+9\n1.0\n\n2.\n\n5.\n\n10.0\n\n20.\n\n10−8 +12\n10\n\nb1\n\n2\n\n5\n\n10+13 2\nMmin [h−1Msun]\n\n5\n\n10+14\n\n2\n\nFigure 8. Scalings of the coefficients in equation (20). We assume that B (0) ∝ b41 ,\nwhile C (1) and C (2) are treated as constants. We extrapolate these coefficients to the\nthree surveys depicted by crosses. The triangles, circles and diamonds correspond to\nthe measurements from N -body simulations at z = 0.5, 1 and 2, respectively. left: B (0)\nas a function of the linear bias. right: C (1) and C (2) as a function of the minimum\nhalo mass.\n\nFor statistical errors of these three surveys, we consider the Gaussian contribution\nas a simple estimate, and neglect the non-Gaussian error. We have [42]:\n[∆Bg (k1 , k2, k3 )]2 =\n\nV\nNtriangle\n\nh\n\nPg (k1 ) + n−1\ng\n\nih\n\nPg (k2 ) + n−1\ng\n\nih\n\ni\n\n, (21)\nPg (k3 ) + n−1\ng\n\nwhere Ntriangle denotes the number of independent triangular configurations in that bin,\nwhich roughly scales as V 2 . We count the number of triangles for each bin, Ntriangle , in\nequation (21), assuming cubic-shaped survey with the quoted volumes. See Appendix\n\n\f19\n10.0\n5.\n\nideal\ndeep\n\nS/N\n\n2.\n1.0\n0.5\n\nrealistic\n\n0.2\n0.1\n−100\n\n−50\n\n0\n\n50\n\n100\n\nfNL\nFigure 9. Signal to noise ratios from the three future surveys defined in equation\n(22). Notice this is estimated from only very limited configurations of Fourier space\ntriangles: isosceles with two longer sides being k1 = k2 = 0.042hMpc−1 .\n\nC, where we test this formula by comparison with N-body simulations and show that\nit works reasonably well. We use the linear power spectrum for Pg assuming the bias\nparameters listed in Tab. 1.\nNow we are in a position to discuss about the future possibility to detect the\nsignature of the local-type primordial non-Gaussianity. In order to quantify the\ndetectability from the α-dependence of the bispectrum, we define the signal-to-noise\nratio:\n\u0012\n\nS\nN\n\n\u00132\n\n≡\n\nX\ni\n\n[B(k, αi ; fNL ) − B(k, αi ; fNL = 0)]2\n.\n∆B(k, αi ; fNL = 0)2\n\n(22)\n\nIn evaluating Eq. (22), only the isosceles triangles with k = 0.042hMpc−1 are used,\nand the results are shown in the right hand panel of Fig. 9. It is remarkable that\neven with the very limited number of configurations for the bispectrum, detection of\nprimordial non-Gaussianity is possible in all three surveys if fNL is several dozen. This\ncan be compared with the analysis neglecting the Bg(2) term. According to [10], using\nthe full configurations of the bispectrum leads to the constraint on fNL , ∆fNL ≃ 5 − 30.\nThus, we naively expected that using the full configurations taking proper account of\nthe scale dependence of bispectrum greatly enhances the detectability of primordial\nnon-Gaussianity, and the constraints on fNL would be much tighter.\nFinally, it is interesting to note that the S/N for the deep survey depends steeply\non fNL , and it exceeds that of the realistic survey of relatively large volume. This is\n2\nprimarily due to the Bg(2) term, which scales as fNL\n, being more significant at higher\nredshift, and thus helps to detect a small non-Gaussianity. In this respect, the on-going\n\n\f20\nmission BOSS [43], aiming at precisely measuring the scale of baryon acoustic oscillations\nfrom the clustering of the LRGs at z < 0.7 and QSO absorption systems at z ∼ 2.5,\nmay be the promising probe for constraining or detecting primordial non-Gaussianity\nof local type.\n7. Conclusions and Discussion\nIn this paper, we have studied the clustering properties of dark matter haloes\nfrom cosmological N-body simulations in the presence of local-type primordial nonGaussianity. We found that the halo bispectrum measured from N-body simulations\nexhibits a strong fNL dependence which becomes most prominent for squeezed\n< 100, the\nconfigurations at large scales. In particular, for realistic values of |fNL | ∼\ndependence of the halo bispectrum on fNL is well characterized by the polynomial\nexpansions of fNL up to second order. Since the quadratic dependence on fNL does\nnot appear in the matter bispectrum at the lowest order in perturbation theory, this\nwould be a clear indicator for the existence of primordial non-Gaussianity of the local\ntype.\nWe have investigated the shape and scale dependence of the halo bispectrum arising\n2\nfrom the fNL\nterm, and the simulation results are compared with theoretical predictions\nbased on the local bias model. For the isosceles triangles characterized by α ≡ k1 /k3\nand k ≡ k1 = k2 , the dependence of the halo bispectrum on α measured from Nbody simulations is found to be consistent with theoretical predictions by [23]. We also\nexamined the dependence of the halo bispectrum on minimum halo mass and redshift,\nand showed that the amplitude of the halo bispectrum is more significant for more\nmassive haloes at higher redshifts.\nThus, the strong dependence of the halo/galaxy bispectrum on α makes the\ndetection of primordial non-Gaussianity much more promising in future surveys. As\na preliminary investigation, we have evaluated the signal-to-noise ratio for the scale\ndependence of the bispectrum in three representative surveys, and found that even\nwith the very limited number of configurations of bispectrum it is possible to detect\nprimordial non-Gaussianity if fNL is several dozen. Thus, the detectability of primordial\nnon-Gaussianity is expected to be greatly improved if we use all configurations of the\nbispectrum.\nWe leave the following tasks as a future work: (i) Study the effects of redshiftspace distortions. Since we focus on very large scales, we expect that these effects\nare accurately described by linear theory, i.e., they just enhance the amplitude of the\nbispectrum in a scale independent way. (ii) Construct more elaborate theoretical models\nthat are applicable to a wider range of triangular configurations and compare them with\nN-body simulations (iii) Run higher resolution simulations where we can populate haloes\nwith galaxies and measure the galaxy bispectrum directly from simulations. These tasks\nare clearly very important to exploit future surveys.\n\n\f21\nAcknowledgments\nWe thank T. Sousbie, R. Nichol, E. Komatsu, D. Jeong, and Y. Suto for useful\ndiscussions and comments. T. N. is supported by a Grant-in-Aid for Japan Society\nfor the Promotion of Science (JSPS) Fellows (DC1: 19-7066). A. T. is supported\nby a Grant-in-Aid for Scientific Research from JSPS (No. 21740168). K. K. is\nsupported by the European Research Council, Research Councils UK and the UK's\nScience & Technology Facilities Council (STFC). C. S. was funded by a STFC PhD\nstudentship. Numerical computations were in part carried out on Cray XT4 at Center\nfor Computational Astrophysics, CfCA, of National Astronomical Observatory of Japan.\nWe are also grateful for the computational time provided by the U.K. National Grid\nService (NGS). This work was supported in part by Grant-in-Aid for Scientific Research\non Priority Areas No. 467 \"Probing the Dark Energy through an Extremely Wide and\nDeep Survey with Subaru Telescope\", and JSPS Core-to-Core Program \"International\nResearch Network for Dark Energy\".\nAppendix A. Power spectrum and bispectrum in the local bias model\nIn this appendix, we compute the power spectrum and bispectrum of biased tracers\nadopting the local bias model.\nThe local biasing scheme is a simple prescription to relate the galaxy/halo density\nfield, δg , to matter fluctuation, δm , on large scales. In this treatment, the density\nfluctuation of galaxies/haloes smoothed over the radius R, δg , is given by a non-linear\nfunction of δm . On large scales, it can be expanded as\nb2 2\n(x; R) − σR2 } + * * *\n(A.1)\nδg (x; R) = b1 δm (x; R) + {δm\n2\n2 1/2\nwith σR being hδm\ni . For simplicity, we omit the dependence on redshifts throughout\nthe appendices. Equation (A.1) can be rewritten in Fourier space as\nδg (k; R) = b1 δm (k; R)\nZ\n1\nd3 q\n+ b2\n[δm (q; R)δm (k − q; R) − hδm (q; R)δm (k − q; R)i] .\n2\n(2π)3\n\n(A.2)\n\nUsing this relation, let us consider the galaxy-matter cross spectrum. With the\nhelp of perturbative expansion, a straightforward calculation yields\n1\nPgm (k; R) = b1 Pm (k; R) + b2\n2\n\nZ\n\nd3 q\nBm (q, k, |k − q|; R),\n(2π)3\n\n(A.3)\n\nwhich is valid up to third order in δm , and the bispectrum Bm is given by the first term\nof equation (9). For the scales of our interest, the integration at the right-hand side of\nthis equation can be separately done taking the large-scale limit. We then obtain [13]\nPgm (k; R)\n\n= b(k, fNL ; R)Pm (k; R) ;\n)\n(\nb2 σR2\n.\nb(k, fNL ; R) = b1 1 + 2fNL\nb1 MR (k)\n\n(A.4)\n(A.5)\n\n\f22\nHere, we define\nMR (k) ≡ M(k)W̃R (k),\n\n(A.6)\n\nwith W̃R being the Fourier transform of the window function.\nThe above procedure can also be applied when we calculate the galaxy auto\npower spectrum, Pg . However, the derivation is rather simplified if we recall that the\ndeterministic bias relation holds on large scales. ‡ Then, the auto and cross power\nspectra are tightly related with each other as {Pgm (k; R)}2 = Pg (k; R) Pm (k; R), which\nleads to\nn\n\nPg (k; R) = b(k, fNL ; R)\n=\n\nb21\n\no2\n\nPm (k; R)\n\nb2 σR2\n1 + 2fNL\nb1 MR (k)\n\n(\n\n)2\n\nPm (k; R).\n\n(A.7)\n\nOn large scales, the effect of window functions is irrelevant, and we simply drop the\nsubscript R. Introducing the bias parameter b̃2 ≡ b2 σR2 , we finally obtain the galaxy\npower spectrum without smoothing:\nPg (k) =\n\nb21\n\n(\n\nb̃2\n1 + 2fNL M−1 (k)\nb1\n\n)2\n\nPm (k),\n\n(A.8)\n\nwhich reproduces equation (10). In the local bias prescription, the bias parameters b1\nand b̃2 are given just as the fitting parameters. On the other hand, in the halo and peak\nbias formalisms, these parameters have a specific functional form, and are related with\neach other. We will discuss this issue in Appendix B, and derive an explicit relation\nbetween b1 and b̃2 [Eq. (B.10)].\nNext consider the galaxy bispectrum. Again, starting from equation (A.2), a\nstraightforward calculation yields [23]\nBg (k1 , k2 , k3 ; R) =\n\nb31\n\n\"\n\nBm (k1 , k2 , k3 ; R) +\n\nb2\n{Pm (k1 ; R)Pm (k2 ; R) + (cyc.)}\nb1\n#\n\nb̃2\n+ Bcorr (k1 , k2 , k3 ; R) ,\nb1\n\n(A.9)\n\nwhich is valid up to fourth order in δm . In the above, the quantities Pm and Bm are the\nmatter power spectrum and bispectrum, whose perturbative expressions are given in\nequations (8) and (9). On the other hand, the term Bcorr represents a new contribution\narising from the matter trispectrum, Tm , and it is expressed as\n1 Z d3 q\n[Tm (q, k1 − q, k2 , k3 ; R) + (cyc.)](A.10)\n.\nBcorr (k1 , k2 , k3 ; R) ≡ 2\n2σR (2π)3\nAccording to the perturbative calculation by [23], the above equation can be further\ndecomposed into several pieces as:\n2\nBcorr (k1 , k2 , k3 ; R) = fNL\nBfnG\n2 (k1 , k2 , k3 ; R)\nNL\n\n‡ This is indeed valid as long as we are concerned with the leading-order calculation. See [13] for\nalternative derivation.\n\n\f23\nh\n\nnG\n+ fNL Bm\n(k1 , k2 , k3 ; R) + BfnG1\n(k1 , k2 , k3 ; R)\nNL\n\n+4BfnG0\n(k1 , k2 , k3 ; R)\nNL\n\n3\nX\ni=1\n\n#\n\nGR (ki ) ,\n\n(A.11)\n\n< 0.1h Mpc−1 , it\nHere, the term BfnG\ncomes from the leading-order trispectrum. For k ∼\n2\nNL\nis approximated as\n\u0014\n1\n8MR (k2 )MR (k3 )Pφ (k1 ) [Pφ (k2 ) + Pφ (k3 )]\nBfnG\n(k\n,\nk\n,\nk\n;\nR)\n≈\n2\n1 2 3\nNL\n2σR2\nZ\nd3 q\nMR (q)MR (|k1 − q|)Pφ (q) + (cyc.)\n×\n(2π)3\n+ 4MR (k2 )MR (k3 )Pφ (k2 )Pφ (k3 )\nZ\nd3 q\nMR (q)MR (|k1 − q|)\n(2π)3\n\n× [Pφ (|k2 + q|) + Pφ (|k3 + q|)] + (cyc.)\n\n\u0015\n\n(A.12)\n\nwith Pφ being the power spectrum of ΦG . The explicit expressions for the other\nremaining terms are obtained by integrating the next-to-leading order contributions\nto the trispectrum. The resultant expressions become\nnG\nBm\n(k1 , k2 , k3; R)\n\n\"\n\nFR (k2 )\nFR (k1 )\n+\n= 4W̃R (k1 )W̃R (k2 )W̃R (k3 )\nMR (k1 ) MR (k2 )\n\n#\n\n(s)\n\n× Pm (k1 )Pm (k2 )F2 (k1 , k2 ) + (cyc.),\n(A.13)\n\u0014\n1\nBfnG1\n(k1 , k2 , k3 ; R) ≈ 2 8W̃R (k2 )W̃R (k3 )Pm (k2 )M(k3 )Pφ (k3 )\nNL\n2σR\nZ\nd3 q\nW̃R (|k1 − q|)W̃R (q)M(|k1 − q|)M(|k2 + q|)\n×\n(2π)3\n(s)\n\n× [Pφ (|k2 + q|) + Pφ (|k1 − q|)] F2 (−k2 , k2 + q)\n\u0015\n\n+ (5 permutation) .\n\n(A.14)\n\nThe term BfnG0\ncoincides with the first term of the matter bispectrum in equation (9).\nNL\nThe functions FR (ki ) and GR (ki ) weakly depend on the smoothing scale R. Note that\n< 0.1h\nin deriving the above expressions, we have neglected the irrelevant terms at k ∼\nMpc−1 .\nIn the expression for the galaxy bispectrum, the important findings here are a new\n2\nterm which scales as fNL\nand additional contributions which scale as fNL to the matter\nbispectrum. Although [23] further considered the term arising from a cubic correction,\ngNL Φ3G to equation (1), we do not discuss about this term in this paper. See also\n[17, 22, 21] for discussions about the gNL term. Ref. [23] evaluates the asymptotic forms\nof each term at squeezed limit (α ≫ 1, where k1 = k2 = αk3 = k) for isosceles triangular\nconfigurations, and the results are shown in equation (12) in the text. Note that Ref. [21]\nalso compute the matter and galaxy bispectrum up to the one-loop order (i.e., O(δ05 ))\nassuming local bias model for both local and equilateral type non-Gaussianity.\n\n\f24\nAlternatively we might be able to investigate the galaxy bispectrum using a similar\ndescription to the galaxy power spectrum:\nBg (k1 , k2 , k3 ; R) = b(k1 , fNL ; R) b(k2 , fNL ; R) b(k3 , fNL; R) Bm (k1 , k2 , k3 ; R).(A.15)\nWe focus on squeezed triangles at large scales, k → 0 and α ≫ 1 and drop the window\nfunction. Then we get the second-order term in fNL , which is the same as the term\nin equation (15) up to the prefactor. However, the coefficient of the term scaling as\nfNL in this prescription is 4b31 + (26/7)b21 b̃2 in this limit, which does not reproduce the\ncontribution that depends on the smoothing scale in equation (14). This prescription\nalso misses the term coming from b21 b2 [Pm (k1 )Pm (k2 )+(cyc.)]. This implies that although\nsome contributions are not included, this description captures the essence of the galaxy\n2\nbispectrum at the squeezed limit. In other words, the fNL\nterm has the same origin as\nthe scale dependent bias in the power spectrum. Although equation (A.15) seems rather\nempirical, it is naturally derived in Ref. [22], where the authors calculated the galaxy\nbispectrum using a multivariate biasing scheme [see their equations (73) - (76)].\nAppendix B. On the relation between peak biasing and local biasing models\nScale-dependence of halo power spectrum and bispectrum in the presence of primordial\nnon-Gaussianity have been derived in the literature in different ways, based on the local\nbias prescription and the halo/peak formalism. However, the resultant expressions for\npeak and halo bias coincide with each other in the high-peak/thresold limit, and there is\na clear relationship between peak bias and local bias prescriptions. The relation between\nthe linear and quadratic bias parameter plays important roles in the accurate modelling\nfor the power spectrum and the bispectrum of galaxies as seen in the previous appendix.\nIn this appendix, in order to elucidate these properties in a self-contained manner,\nwe give an explicit relationship between the local biasing and peak biasing models, and\nshow that the peak density field in the high-peak limit can be described by the local\nbiasing prescription. In the end, we obtain the relation (B.10), which was used in Sec. 4\nwhen comparing the N-body results with model prediction of halo power spectrum.\nWe also use this relation in Sec. 6 to discuss the future detectability of the local-type\nprimordial non-Gaussianity.\nWe begin by writing down the definition of peak density field. According to [24],\nit is given by\nδg (x; R) =\n\nρν (x; R)\n− 1;\nhρν (x; R)i\n\nh\n\ni\n\nρν (x; R) ≡ Θ δm (x; R) − ν σR ,\n\n(B.1)\n\nin the Lagrangian space. In the above, Θ is the Heaviside step function and ν ≡ δc /σR\nwith the critical overdensity, δc ≃ 1.686. Strictly speaking, the above definition does\nnot imply the local maximum of the density field, however, the local density specified\nabove is expected to roughly correspond to the peak in the high-threshold limit, ν ≫ 1.\nStarting with the expression (B.1), we want to derive Taylor series expansion of δg\nin terms of the local density δm . To do this, let us first expand the peak density in terms\n\n\f25\nof the Hermite polynomials:\nρν (x; R) =\n\n∞\nX\n\nRn\nHn (δm /σR ).\nn=0 n!\n\n(B.2)\n\nThe coefficient Rn is given by (e.g., [44]):\n\nRn =\n\nZ\n\n+∞\n\n−∞\n\n\n\n\n\n\n\n\n\n\ndy\n2\n√ e−y /2 Hn (y) Θ[(y−ν) σR ] =\n\n\n2π\n\n\n\n1\nν\nerfc √\n2\n2\n\n!\n\n; n = 0,\n(B.3)\n\n−ν 2 /2\n\ne\n√\n\nHn−1 (ν) ; n ≥ 1.\n2π\nIn the high-peak limit ν ≫ 1, the coefficient Rn asymptotically approaches\nν n−1\n2\nRn −→ √ e−ν /2 ,\n(B.4)\n2π\nfor n ≥ 0. Substituting this back into (B.2), we obtain\n\n\n\n\n2\n∞\n1\nνn\ne−ν /2 X\n2\n√\nHn (δm /σR ) = √ e−ν +ν(δm /σR ) ,\nρν (x; R) ≃\nν 2π n=0 n!\nν 2π\n\n(B.5)\n\n2\n\nwhere we used the relation n (xn /n!)Hn (t) = e−x /2+t x in the last equality. Now,\nP\nn\nic /n!], the\nrecalling from the cumulant expansion theorem, heitδm i = exp[ n (it)n hδm\naveraged peak density hρν i in the high-peak limit becomes\nP\n\n2\n2\n∞\nE\nX\n(ν/σR )n D\ne−ν\ne−ν\n(ν/σR ) δm\nhe\nexp\ni= √\n.(B.6)\n{δm (x; R)}n\nhρν (x; R)i ≃ √\nc\nn!\nν 2π\nν 2π\nn=0\nHence, the peak density field δg becomes\n\n\"\n\n#\n\n∞\nE\nX\n(ν/σR )n D\nν\n− 1,\n{δm (x; R)}n\nδm (x; R) −\nδg (x; R) ≃ exp\nc\nσR\nn!\nn=0\n\n\"\n\n#\n\n(B.7)\n\nwhich can be expanded in the form of local biasing expression (A.1) as\n\u0012\n\u0013\n\u0012\n\u0013\n1 ν 2 2\n1 ν 3 3\nν\n2\n3\nδm (x; R)+\n{δm (x; R)−σR }+\n{δm (x; R)−hδm\nic }+* * * .(B.8)\nδg (x; R) =\nσR\n2 σR\n3! σR\nNote that this expansion is done in Lagrangian space. Assuming the usual mapping\nfrom Lagrangian to Eulerian space, bE = 1 + bL , where bE and bL are linear bias\nparameters in Eulerian and Lagrangian space, the biasing parameters in the high-peak\nlimit can be read off by comparing equation (B.8) with equation (A.1), and are expressed\nas\nν6\nν4\nν2\n(B.9)\nb1 = 1 + , b2 = 2 , b3 = 3 , * * * .\nδc\nδc\nδc\nNote that the higher-order biasing parameters should be also modified by the mapping\nfrom Lagrangian and Eulerian space but this effect is small in the high peaks limit and\nwe simply ignore it. Then the biasing parameters have a relation\nb̃2 = δc (b1 − 1),\n\n(B.10)\n\nwhere b̃2 = b2 σR2 . For a better fit of halo power spectrum (10) to the N-body simulations,\na slight modification to the above relation might be necessary [see Eq. (11)].\n\n\f26\nAppendix C. The Sample Variance of the Matter and Halo Bispectrum\nIt is of importance to investigate the variance of the bispectrum in the presence of\nprimordial non-Gaussianity, although our simulation sets are too small to examine the\nfull covariance of the bispectrum (see e.g., [45]; the authors performed 5000 realizations\nof (1h−1 Gpc)3 volume simulations to investigate it for Gaussian initial conditions). Here\nwe show our measurements of the variance (i.e., the diagonal elements of the covariance\nmatrix) for both the matter and halo bispectrum.\nFig. C1 shows the variance of the matter (left) and halo (right) bispectrum for the\nsame configurations as in the left panel of FIg. 6 at z = 0.5. The symbols correspond to\nthe variance measured from N-body simulations, while the lines are obtained from\nequation (21). In computing equation (21), we substitute the value of the power\nspectrum measured from N-body simulations both for matter and halo. Overall, the\nanalytic predictions are good approximation of the N-body simulations, ensuring the use\nof this formula. For the variance of the matter bispectrum, there is little evidence of fNL\ndependence. This is natural because the matter power spectrum also depends on fNL\nonly weakly (see Fig. 2). On the other hand, the right panel shows a strong dependence\non fNL , reflecting a strong fNL dependence of the halo power spectrum. The prediction\nof equation (21) seems worse at larger α and larger |fNL |. Since the leading correction\nterm to this formula have the form of P (k1 )T (k2 , k3 , −k2 , −k3 ) + (cyc.), this feature is\nquite reasonable.\n2\n\n10+9\n\nz=0.5\nk = 0.042 h Mpc\n\n2\nfNL = 300\n100\n0\n−100\n−300\n\n10+8\n\n5\n\n1.0\n\nk = 0.042 h Mpc−1\n\n5\n\n∆Bh(k,α)\n\n∆Bm(k,α)\n\n5\n\nz=0.5\n\n10+11\n−1\n\n2.\n\n5.\n\n2\n10+10\n5\n2\n\n10.0\n\nα\n\n10+9\n\n1.0\n\n2.\n\n5.\n\n10.0\n\nα\n\nFigure C1. Variance of the matter (left) and halo (right) bispectrum. The symbols\nare measured from N -body simulations, while the lines are computed by equation (21).\n\nReferences\n[1] Komatsu, E. et al , 2008, ApJS, 180, 330\n[2] Tegmark, M. et al. 2006, Phys.Rev.D 69, 123507\n\n\f27\n[3]\n[4]\n[5]\n[6]\n[7]\n[8]\n[9]\n[10]\n[11]\n[12]\n[13]\n[14]\n[15]\n[16]\n[17]\n[18]\n[19]\n[20]\n[21]\n[22]\n[23]\n[24]\n[25]\n[26]\n[27]\n[28]\n[29]\n[30]\n[31]\n[32]\n[33]\n[34]\n[35]\n[36]\n[37]\n[38]\n[39]\n[40]\n[41]\n[42]\n[43]\n[44]\n[45]\n\nKomatsu, E., & Spergel, D. N., 2001, PRD 63, 063002\nCarbone, C., Verde, L., & Matarrese, S., 2008, ApJ, 684, 1\nBartolo, N., Komatsu, E., Matarrese, S., & Riotto, A., 2004, Phys. Rep. 402, 103\n[Planck Collaboration], arXiv:astro-ph/0604069\nScoccimarro, R., 2000, ApJ. 542, 1\nVerde, L., Wang, L., Heavens, A. F., & Kamionkowski, M., 2000, MNRAS, 313, 141\nScoccimarro, R., Sefusatti, E., & Zaldarriaga, M., 2004, PRD, 69, 103513\nSefusatti, E., and Komatsu, E., 2007, PRD, 76, 083004\nDalal, N., Doré, O., Huterer, D., and Shirokov, A., 2008, PRD, 77, 12351\nAfshordi, N., and Tolley, A. J., 2008, PRD, 78, 123507\nTaruya, A., Koyama, K., & Matsubara, T., 2008, PRD, 78, 123534\nMatarrese, S., and Verde, L., 2008, AJ, 677, L77\nPillepich, A., Porciani, C., and Hahn, O., 2010, MNRAS, 402, 191\nDesjacques, V., Seljak, U., & Iliev, I. T., 2009, MNRAS, 396, 85\nDesjacques, V., & Seljak, U., 2010, PRD, 81, 023006\nGrossi, M., et al , 2009, MNRAS, 398, 321\nSlosar, A., Hirata, C., Seljak, U., Ho, S., and Padmanabhan, N., 2008, JCAP, 08, 031\nMcDonald, P., 2008, PRD, 78, 123519\nSefusatti, E., 2009, PRD, 80, 123002\nGiannantonio, T., & Porciani, C., 2010, PRD, 81, 063530\nJeong, D, & Komatsu, E., 2009, ApJ, 703, 1230\nMatarrese, S., Lucchin, F., & Bonometto, S. A., 1986, ApJ, 310, 21\nFry, J. N., and Gaztanaga, E., 1993, ApJ, 413, 447\nBernardeau, F., Colombi, S., Gaztanãga, E., and Scoccimarro, R., 2002, Phys. Rep., 367, 1\nLewis, A. et al , 2000, AJ, 538, 473\nSpringel, V., 2005, MNRAS, 364, 1105\nTaruya, A., Nishimichi, T., Saito, S., & Hiramatsu, T., 2009, PRD, 80, 123503\nNishimichi, T. et al , 2009, PASJ, 61, 321\nCrocce, M., Pueblas, S., and Scoccimarro, R., 2006, MNRAS, 373, 369\nLoVerde, M., Miller, A., Shandera, S., and Verde, L., 2008, JCAP, 04, 014\nMatarrese, S., Verde, L., & Jimenez, R., 2000, ApJ, 541, 10\nWarren, M. S., Abazajian, K., Holz, D. E., Teodoro, L., 2006, ApJ, 646, 881\nHockney, R. W, & Eastwood, J. W., 1981, Computer Simulations Using Particles (New York:\nMcGraw-Hill)\nBartolo, N., Beltrán Almeida, J. P., Matarrese, S., Pietroni, M., & Riotto, A., 2010 JCAP, 03, 011\nhttp://www.ias.u-psud.fr/imEuclid/\nAihara, T., talk at the IPMU international conference on dark energy: lighting up the darkness!\nhttp://www.as.utexas.edu/hetdex/\nCrocce, M., Fosalba, P., Castander, F. J., & Gaztanãga, E., 2010, MNRAS, 403, 1353\nSheth, R. K., Tormen, G., 1999, MNRAS, 308, 119\nScoccimarro, R., Colombi, S., Fry, J. N., Frieman, J. A., Hivon, Eric, & Melott, A, 1998, ApJ,\n496, 586\nhttp://cosmology.lbl.gov/BOSS/\nMatsubara, T., 1995, APJS, 101, 1\nTakahashi. R., et al., 2009, ApJ, 700, 479\n\n\f"}