{"id": "http://arxiv.org/abs/0801.4867v1", "guidislink": true, "updated": "2008-01-31T13:31:12Z", "updated_parsed": [2008, 1, 31, 13, 31, 12, 3, 31, 0], "published": "2008-01-31T13:31:12Z", "published_parsed": [2008, 1, 31, 13, 31, 12, 3, 31, 0], "title": "Quantum communication beyond the localization length in disordered spin\n  chains", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0801.0351%2C0801.3111%2C0801.0614%2C0801.2451%2C0801.1794%2C0801.4627%2C0801.1605%2C0801.0182%2C0801.1744%2C0801.3312%2C0801.2676%2C0801.2435%2C0801.3671%2C0801.2498%2C0801.4939%2C0801.1788%2C0801.0286%2C0801.4155%2C0801.3077%2C0801.3517%2C0801.0674%2C0801.4353%2C0801.1137%2C0801.3055%2C0801.2136%2C0801.1963%2C0801.4232%2C0801.3956%2C0801.2894%2C0801.4369%2C0801.4125%2C0801.2071%2C0801.2522%2C0801.1505%2C0801.0735%2C0801.2661%2C0801.1368%2C0801.3074%2C0801.4084%2C0801.2701%2C0801.3536%2C0801.3653%2C0801.4661%2C0801.1793%2C0801.0190%2C0801.1475%2C0801.3533%2C0801.0380%2C0801.1396%2C0801.2600%2C0801.1287%2C0801.2733%2C0801.0244%2C0801.0342%2C0801.1162%2C0801.0340%2C0801.1947%2C0801.4277%2C0801.2164%2C0801.3518%2C0801.0277%2C0801.1204%2C0801.2820%2C0801.2144%2C0801.4442%2C0801.3615%2C0801.3351%2C0801.4168%2C0801.2239%2C0801.3104%2C0801.0645%2C0801.2161%2C0801.2776%2C0801.4867%2C0801.2246%2C0801.3932%2C0801.1256%2C0801.1147%2C0801.2364%2C0801.2632%2C0801.0754%2C0801.3744%2C0801.1849%2C0801.3059%2C0801.1164%2C0801.3086%2C0801.2519%2C0801.2628%2C0801.2317%2C0801.0915%2C0801.3381%2C0801.1696%2C0801.4887%2C0801.1796%2C0801.1470%2C0801.4549%2C0801.2971%2C0801.2497%2C0801.4223%2C0801.3866%2C0801.2790&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Quantum communication beyond the localization length in disordered spin\n  chains"}, "summary": "We study the effects of localization on quantum state transfer in spin\nchains. We show how to use quantum error correction and multiple parallel spin\nchains to send a qubit with high fidelity over arbitrary distances; in\nparticular distances much greater than the localization length of the chain.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0801.0351%2C0801.3111%2C0801.0614%2C0801.2451%2C0801.1794%2C0801.4627%2C0801.1605%2C0801.0182%2C0801.1744%2C0801.3312%2C0801.2676%2C0801.2435%2C0801.3671%2C0801.2498%2C0801.4939%2C0801.1788%2C0801.0286%2C0801.4155%2C0801.3077%2C0801.3517%2C0801.0674%2C0801.4353%2C0801.1137%2C0801.3055%2C0801.2136%2C0801.1963%2C0801.4232%2C0801.3956%2C0801.2894%2C0801.4369%2C0801.4125%2C0801.2071%2C0801.2522%2C0801.1505%2C0801.0735%2C0801.2661%2C0801.1368%2C0801.3074%2C0801.4084%2C0801.2701%2C0801.3536%2C0801.3653%2C0801.4661%2C0801.1793%2C0801.0190%2C0801.1475%2C0801.3533%2C0801.0380%2C0801.1396%2C0801.2600%2C0801.1287%2C0801.2733%2C0801.0244%2C0801.0342%2C0801.1162%2C0801.0340%2C0801.1947%2C0801.4277%2C0801.2164%2C0801.3518%2C0801.0277%2C0801.1204%2C0801.2820%2C0801.2144%2C0801.4442%2C0801.3615%2C0801.3351%2C0801.4168%2C0801.2239%2C0801.3104%2C0801.0645%2C0801.2161%2C0801.2776%2C0801.4867%2C0801.2246%2C0801.3932%2C0801.1256%2C0801.1147%2C0801.2364%2C0801.2632%2C0801.0754%2C0801.3744%2C0801.1849%2C0801.3059%2C0801.1164%2C0801.3086%2C0801.2519%2C0801.2628%2C0801.2317%2C0801.0915%2C0801.3381%2C0801.1696%2C0801.4887%2C0801.1796%2C0801.1470%2C0801.4549%2C0801.2971%2C0801.2497%2C0801.4223%2C0801.3866%2C0801.2790&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We study the effects of localization on quantum state transfer in spin\nchains. We show how to use quantum error correction and multiple parallel spin\nchains to send a qubit with high fidelity over arbitrary distances; in\nparticular distances much greater than the localization length of the chain."}, "authors": ["Jonathan Allcock", "Noah Linden"], "author_detail": {"name": "Noah Linden"}, "author": "Noah Linden", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevLett.102.110501", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0801.4867v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0801.4867v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "5 pages, 2 figures", "arxiv_primary_category": {"term": "quant-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "quant-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0801.4867v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0801.4867v1", "journal_reference": null, "doi": "10.1103/PhysRevLett.102.110501", "fulltext": "Quantum communication beyond the localization length in disordered spin chains\nJonathan Allcock∗ and Noah Linden†\nDepartment of Mathematics, University of Bristol,\nUniversity Walk, Bristol BS8 1TW, United Kingdom\n(Dated: January 27, 2008)\n\narXiv:0801.4867v1 [quant-ph] 31 Jan 2008\n\nWe study the effects of localization on quantum state transfer in spin chains. We show how to use\nquantum error correction and multiple parallel spin chains to send a qubit with high fidelity over\narbitrary distances; in particular distances much greater than the localization length of the chain.\n\nThe reliable communication of quantum states from\none physical location to another is most likely necessary\nif large-scale quantum computing is ever to be realised.\nSeveral years ago Bose [1] proposed using spin chains\nas the medium for such quantum state transfer. Since\nthen, there has been much interest in this area, and numerous protocols have been put forward which develop\nthis idea, improving the efficiency and fidelity of transfer using methods such as encoding the information over\nmultiple qubits in the chain [2, 3, 4, 5], using engineered\ncouplings [6, 7], multi-rail encodings [8, 9, 10] and local\nmemory [11].\nUnfortunately, any real spin chain will inevitably have\nan element of disorder inherent in the system. As pointed\nout in [12], this can cause a phenomenon now known\nas Anderson localization [13] to take place. This is the\nprocess in which the energy eigenstates of a disordered\nlattice become localized in space, rather than extending\nthroughout the system as they would in the absence of\ndisorder. This is turn inhibits state transfer beyond a\ndistance known as the localization length of the chain.\nWhile this may be useful for localizing qubits for quantum computing [14], it provides a major challenge for\nthe use of spin chains in quantum communication. Although localization has been extensively studied in solid\nstate physics, its implications for quantum information\nare not well understood [12],[5],[15, 16, 17].\nIndeed, it is not clear at first glance how the problems due to localization fit within the standard error\nparadigm considered in quantum information theory.\nFirstly, rather than being due to some coupling of the\nspin chain with the environment, localization is an intrinsic source of error. Even in the absence of disorder, the excitations carrying the quantum information\nbecome spread out along the chain. In the presence of\ndisorder, only an exponentially small part of the signal\nreaches beyond the localization length. Also, although\nwe are only trying to communicate a single qubit, the\nlocalization errors take place in the higher-dimensional\nHilbert space of the entire spin chain.\nIn this Letter we look more closely at the effect localization has on spin chain state transfer and find that,\nfor a class of standard spin chain protocols, localization\ncan effectively be viewed as a source of amplitude damping errors, where the damping parameter is dependent on\n\nthe distance propagated and the degree of disorder in the\nchain. We then show how to use multiple spin chains and\nquantum error correction to achieve high fidelity quantum information transfer over arbitrary distances; in particular over distances much greater than the localization\nlength. By considering a concatenation scheme we show\nthat, provided the disorder is not too great, the number\nof spin chains required scales only polylogarithmically\nwith the distance over which we wish to communicate.\nIn what follows we shall use the following notation and\nconventions: A spin in the |1i state will be called an\nexcitation. For a system of N spins, we shall use a bold\nfont |0i = |00...0i to denote the zero excitation state,\nand |ji = |00...010...0i to denote the single excitation\nstate with the j th spin in the state |1i and all the other\nspins in state |0i. Finally, σ~i = (σix , σiy , σiz ), where σix,y,z\nare the Pauli matrices acting on the ith spin in the chain.\nLet us consider the following communication scenario.\nAlice and Bob are at opposite ends of a chain of N spin1/2 particles described by some nearest-neighbour Hamiltonian H. Alice's task is to send, with as high a fidelity\nas possible, an unknown qubit state to Bob. We shall\nassume that the following conditions hold: (C1): The\nsystem is isolated from the environment, and thus there\nare no external sources of noise. (C2): H commutes with\nPN\nthe total Z-spin operator k σkz and hence conserves the\nnumber of excitations on the chain. (C3): The system\nstarts in the initial state |0i. For example, H could be a\nsimple Heisenberg coupling (in the absence of an external\nfield)\nX\nH = −(J/2)\nσ~i * σ~j\n(1)\n<i,j>\n\nP\nwhere <i,j> denotes that the sum is over all adjacent\nspins i and j, and J is the coupling constant between\nspins. Note that we have not yet introduced any disorder\ninto the system.\nThe communication proceeds according to [2] and [3].\nWe assume that Alice and Bob each have access to a\nnumber NA , NB respectively, of spins at their ends of the\nchain. To begin, Alice encodes the input state a |0i+b |1i\nas a state of her NA spins in such a way that the following two conditions hold. (C4): |0i is encoded as |0iA .\n(C5): |1i is encoded as |1ENC iA . Here A denotes Alice's addressable spins, A denotes all other spins, and\n\n\f2\n|1ENC iA lies in the linear span of |jiA , i.e. it is a superposition of single excitation states, where the excitations lie in Alice's domain. The system then undergoes\nunitary time evolution for some time t. Note that as a\nresult of Alice's encoding, and the fact that the Hamiltonian preserves the total number of excitations, the chain\ndynamics remain restricted to the N +1 dimensional subspace spanned by the zero and single excitation states.\nFinally, Bob applies a decoding unitary to his addressable spins. This concentrates the state onto a single spin\nwhich he then takes as the output of the transfer. The\nwhole process is equivalent to sending Alice's original\nstate down an amplitude damping channel with timedependent channel parameter γ(t) = 1 − CB (t), where\n0 ≤ CB (t) ≤ 1.\np The corresponding average fidelity is\ngiven by 1/2 + CB (t)/3 + CB (t) /6.\nThere is a convenient way to visualise the transfer process [2]. At time t the state of the system can be exPN\nPN\n2\npressed as a |0i + b j=1 cj (t) |0i, where j=1 |cj (t)| =\n2\n1. By plotting the quantities |cj (t)| against site number\nj we can produce a graph of the state. Then, the quantity CB (t) is given by the area under the graph supported\nby Bob's accessible sites. To achieve high fidelity transfer, the strategy is to choose |1ENC iA to be a wavepacket\nwith a particular shape that leads to minimal dispersion.\nWhat happens now if there is disorder present in the\nchain? Any real chain will, due to engineering limitations and thermal fluctuations, have spin-spin couplings\nthat are not described by an ideal Hamiltonian such as\n(1). In general there may be complicated time-dependent\nperturbations to the Hamiltonian, possibly coupling the\nzero and single excitation subspaces with subspaces of\nlarger numbers of excitations. However, as in [12], here\nwe consider a simpler model of randomness where the\ntotal Hamiltonian Hǫ is given by\nX\nǫj |ji hj|\n(2)\nHǫ = H +\nj\n\nwhere H is the Hamiltonian (1) and the ǫj are i.i.d real\nrandom variables drawn from some underlying distribution Pδ with bounded density, characterised by a disorder\nparameter δ (for instance, the uniform distribution in the\ninterval [−δ, δ]).\nWhat are the implications of this for state transfer?\nIn spite of the disorder, the all zero state |0i trivially\nremains an eigenstate of Hǫ and, furthermore, the chain\nevolution remains restricted to the zero and single excitation subspaces. This implies that the disordered chain\nstill behaves like an amplitude damping channel, where\nthe damping parameter depends on the area under the\ngraph in Bob's domain. Fig 1 shows how increasing the\ndegree of disorder causes the graph of the state to suffer\nfrom dispersion and reflection as it propagates. Consequently, the area under the graph in Bob's domain,\nand hence the transfer fidelity, becomes increasingly sup-\n\n|cj |2\n\nFIG. 1: Effect of localization on state propagation √\nfor a disordered Heisenberg chain with N = 501, J = 1/ 2. The\nwavepackets have been plotted at time increments δt = 25.\nDiagonal disorder was drawn from a normal distribution with\nmean zero and standard deviation δ. From top to bottom,\nδ = 0, 0.1, 0.2 and 0.3.\n\npressed. With a disordered chain, the channel parameter\nCB,δ (t) depends on both the time and the particular realization of the disorder (that is, the specific values of the\nǫj in (2)). However, for a given Pδ , the specific values\nof ǫj can only be determined probabilistically. In other\nwords, γ ≡ γδ (t) = 1 − CB,δ (t) is a stochastic function of\ntime, parameterized by δ.\nWe have investigated this claim in more depth by numerically evaluating γδ (t) for various values of t and δ,\nwith Pδ chosen to be the uniform distribution. Since the\noutcome is stochastic, we average over many trials in order to build up a mean surface (see Fig 2). This was\nfound to have the empirical form\nγδ (t) = 1 − e−αt(δ\n\n2\n\n+βδ )\n\n(3)\n\nfor some constants α and β. The same empirical form\n(3) was found to hold for Pδ chosen to be Cauchy and\nnormal distributions, although different values of α and\nβ were observed. Thus, if we know the value of δ, we can\ndeduce how far Bob can be from Alice before, on average,\nthe fidelity drops below a certain threshold. As expected,\nfor fixed δ the fidelity decays exponentially quickly as the\nstate propagates along the chain.\nThe identification of a disordered spin chain as an amplitude damping channel (albeit one with a stochastic\ndamping parameter) immediately opens up the possibility of using quantum error correction to improve the\nchannel fidelity. Alice can encode her message state into\na state of multiple qubits and send each of these qubits\ndown a separate, parallel, spin chain. Bob will then receive the multiple qubits and apply standard error correction techniques. Indeed, quantum codes specifically\ntailored to treating amplitude damping errors are already\nknown [18, 19]. However, if Alice and Bob are separated\nby a distance larger than the localization length, the amplitude damping will become too severe and this error\n\n\f3\nger, and let ǫ be a positive constant in the interval (0, 1].\nThen it is possible to send a qubit, a distance mL, with\nfidelity greater than 1 − ǫ/2, using a number of chains n\npolylogarithmic in m:\n\u0013−3\n\u0010 m \u00113 \u0012\n15p\nk\n− ln\n.\n(4)\nn = 5 > ln\nǫ\n2\n\nγδ (t)\n\nTo show this, we need the following facts regarding\nquantum channels:\n\nt\n\nδ\n\nFIG. 2: Mean surface of γ (t, δ). Red: numerical data. Green:\n2\n1 − e−αt(δ +βδ) , for α = 2.56, β = 0.029. Diagonal disorder\ndrawn from a uniform distribution in the range [−δ, δ] .\n\ncorrection protocol will fail [23].\nHowever we have the option of performing error correction at regular intervals (shorter than the localization\nlength) along the chain, intervening before the amplitude\ndamping becomes too great. Thus as long as δ is not too\nlarge, error correction can be used to correct localization errors, and achieve high fidelity state transfer over\ndistances much larger than the localization length. Furthermore, since the wavepackets propagate with a welldefined group velocity, the transmission takes a time linear in the distance over which we want to propagate.\nThe key result of this Letter is that this scheme is\nscalable. That is, the number of parallel chains needed\nto faithfully communicate a qubit grows favourably with\nthe distance we wish to send it. We show this by considering the following protocol. Alice encodes her initial\nqubit in the space of n = 5k qubits according to the 5\nqubit code [20, 21] concatenated k times. Each qubit is\nthen sent down a separate spin chain - modified via a\nchannel twirling process [22] - encoded over Alice's NA\nsites as a minimally-dispersive wavepacket in accordance\nwith [2] and [3]. (The twirling is applied to ensure that\nthe concatenation preserves the structure of the channel.)\nAt periodic intervals of distance L we will error correct,\nuntil the wavepackets reach Bob's end of the chain. Bob\nthen decodes each of the (distorted) wavepackets back\ndown to the space of single qubits, before finally decoding these 5k qubits down to the space of a single qubit.\nProvided that the number of parallel chains n scales\npolylogarithmically in the distance we wish to communicate over, we show that it is possible to send a qubit\nan arbitrary distance, with arbitrarily high fidelity using this protocol. More specifically, let L be a non-zero\nlength chosen so that after twirling, each length L of the\nchain has the depolarizing parameter p. (For the time\nbeing we will consider, for convenience, that each channel has the same value of p; we will discuss at the end of\nthe Letter how to relax this). Let m be a positive inte-\n\nLemma 1. Channel Twirling [22]. Any channel Λ\ncan be turned into a depolarizing channel with the same\nentanglement fidelity F and average channel fidelity f as\nΛ.\nA depolarizing channel with parameter p is a quantum\nchannel which, with probability (1 − p) leaves an input\nstate ρ untouched, and with probability p replaces ρ with\nthe maximally mixed state.\nLemma 2. Consider the following procedure: (a) Encoding a single qubit in the space of 5k qubits according\nto the 5 qubit code concatenated k times. (b) Sending\neach qubit down an identical depolarizing channel with\nparameter p. (c) Error correcting and decoding back to\nthe space of a single qubit. This procedure is equivalent\nto sending the qubit down a depolarizing channel with pa\u00012k\n2\n15\nrameter pk < 15\n.\n2 p\n\nProof. Consider the simpler procedure: (a) Encoding a\nsingle qubit in the space of 5 qubits according to the\n5 qubit code. (b) Sending each qubit down an identical depolarizing channel with parameter p. (c) Error\ncorrecting and decoding back to the space of a single\nqubit. Explicit calculation shows that this procedure is\nequivalent to sending the single qubit down a depolariz25 3\n15 4\n3 5\n2\ning channel with parameter 15\n2 p − 2 p + 2 p − 2p ,\nwhich, in our range of interest 0 ≤ p ≤ 1, is monotonically non-decreasing in p and (for p not zero) strictly\n2\nless than 15\n2 p . The effect of concatenating our quantum\ncode then follows by induction.\nLemma 3. Composing m identical depolarizing channels, each with channel parameter p, gives a depolarizing\nchannel with parameter 1 − (1 − p)m .\nSuppose we have at our disposal many quantum channels, each with physical length L. Let us call these basic\nchannels. By lemma 1 we can assume, without loss of\ngenerality, that these are depolarizing channels with parameter p. Now consider combining 5k of these channels\nin parallel to form a block of length L and depth (i.e.\nnumber of channels in parallel) 5k . By lemma 2 we can\nuse error correction to send a qubit down this block, and\nthe net effect is equivalent to sending the qubit down a\ndepolarizing channel with parameter pk . Let us call this\nresulting channel a k-block, in view of the fact that k levels of concatenation are involved. If we now compose m\n\n\f4\nof these blocks together to form a channel of depth 5k and\ntotal length mL, lemma 3 tells us that this is equivalent\nto a depolarizing channel with parameter\n\"\n\u0012\n\u00132k #m\n2 15\np\nptotal < 1 − 1 −\n.\n(5)\n15 2\nNow, (4) means that\n5\n\nk\n\n⇒2\n\nk\n\n>\n\n− ln\n\n!log2 5\n\n−ǫ/m\nln( 15\n)\n2 (1 − e\n\n>\n\n2\n⇒\n15\n\nm\nǫ ))\n15p\n2\n\n2\n(1 +\nln( 15\n\nln 15p\n2\n\n\u0012\n\n15\np\n2\n\n\u00132k\n\n!\n\n.\n\n(6)\n\n< 1 − e−ǫ/m\n\n⇒ ptotal < 1 − e−ǫ\n< ǫ.\n\n(7)\n\nx\nfor x > 0\nWe have used the inequalities 1 − e−x > 1+x\n−x\nand 1 − e < x for x > 0 in (6) and (7) respectively.\nSo provided that the parameter p of the fundamental depolarizing channels is less than 2/15, we are free\nto choose any m, arbitrarily large, and any ǫ, however\nclose to zero, and the overall channel will have parameter ptotal < ǫ as long as the channel depth satisfies (4).\nThe average fidelity of sending a qubit down this channel\nis then f > 1 − ǫ/2.\nWe can now directly apply this result to the case\nwhere our basic channels are the sections of the disordered spin chains. As mentioned before, each chain\nacts like an amplitude damping channel with identical\nparameter γ. If we now apply channel twirling to our\nchains they\nchannels with parame\u0002 become depolarizing\n\u0001\u0003\n√\nter p = 13 γ + 2 1 − 1 − γ . We require that p < 2/15\nso, given a degree of disorder δ, we choose a value of L\nsuch that this is true, at least with high probability. In\nother words, the degree of disorder fixes the maximum\npossible length of our basic channels, or equivalently, the\nlength before which we must error correct. We can now\nform k-blocks from our twirled chains, and compose m\nof these blocks together to form a channel of total length\nmL. It then follows that it is possible, using a number\nof disordered chains polylogarithmic in m/ǫ, to send a\nqubit a distance of mL with overall fidelity greater than\n1 − ǫ/2.\nWe have shown that for a class of spin chain protocols,\nnamely those that satisfy conditions (C1)-(C5), that localization can be viewed as a source of amplitude damping errors. Although we have focused here on the case of\ndiagonal disorder, the same holds true for more general\nmodels of disorder, provided that the disorder does not\ncouple together subspaces of different numbers of excitations. Indeed it will be realized that our protocol can\n\nbe used to deal with rather more general errors arising\nin quantum communication in spin chains and not just\nthose arising from localization.\nIn the text we have considered that each channel has an\nidentical error parameter. This is, of course, an unreasonable assumption since the errors are stochastic. However\nit is not too difficult to see that the protocol still leads to\npolylogarithmic scaling if, for example, the channels are\nguaranteed to have error parameter p below some given\nthreshold. It would be an interesting question for the future to analyse how well the protocol succeeds if one only\nknows, for example, the distribution of possible channel\nparameters..\nIt is worth making explicit the nature of the interventions needed along the chain in order to perform our\nprotocol. The syndrome measurements may be done coherently, rather than by performing von Neumann measurements. In other words, the individual chains can have\n(passive) unitary interactions between them that perform\nthe error correction. This requires clean qubits – sources\nof low entropy – to be coupled into the chains at regular\nintervals.\nFinally we observe that our results might be interesting\nin the context of solid state physics. We have shown that\nparallel disordered one-dimensional spin chains can support high fidelity \"conduction\" of quantum information\nover arbitrary distances; the number of required chains\nscaling only polylogarithmically with the distance. This\nis perhaps at odds with the intuition one might have\nfrom the well-known fact that in one dimension, disorder inevitably prevents propagation. Of course there is\nno true contradiction here. For example, our system is\nnot strictly one dimensional; the error correction leads to\nsubtle coupling of the one-dimensional chains. However\nwe believe that our techniques from quantum information may offer new insights into localization in solid state\nsystems.\nWe would like to thank Toby Cubitt and Andreas Winter for many helpful discussions. J.A. also gratefully acknowledges the support of the Dorothy Hodgkin Foundation.\n\n∗\n†\n\n[1]\n[2]\n[3]\n[4]\n[5]\n[6]\n\nElectronic address: jon.allcock@bristol.ac.uk\nElectronic address: n.linden@bristol.ac.uk\nS. Bose, Phys. Rev. Lett. 91, 207901 (2003).\nT. Osborne and N. Linden, Phys. Rev. A 69, 052315\n(2004).\nH. Haselgrove, Phys. Rev. A 72, 062326 (2005).\nD. Burgarth, V. Giovannetti, and S. Bose, Phys. Rev. A\n75, 062327 (2007).\nD. Burgarth, Eur. Phys. J. Special Topics 151, 147\n(2007).\nM. Christandl, N. Datta, A. Ekert, and A. Landahl,\nPhys. Rev. Lett. 92, 187902 (2004).\n\n\f5\n[7] M. Christandl, N. Datta, A. Ekert, and A. Landahl,\nPhys. Rev. A 71, 032312 (2005).\n[8] D. Burgarth and S. Bose, Phys. Rev. A 71, 052315\n(2005).\n[9] K. Shizume, K. Jacobs, D. Burgarth, and S. Bose, Phys.\nRev. A 75, 062328 (2007).\n[10] D. Burgarth, V. Giovannetti, and S. Bose, J. Phys. A:\nMath. Gen. 38, 6793 (2005).\n[11] V. Giovannetti and D. Burgarth, Phys. Rev. Lett. 96,\n030501 (2006).\n[12] J. Keating, N. Linden, J. Matthews, and A. Winter,\nPhys. Rev. A 76, 012315 (2007).\n[13] P. Anderson, Phys. Rev. 109, 1492 (1958).\n[14] M. Dykman, L. Santos, M. Shapiro, and F. Izrailev,\nQuant. Inf. and Comp. 5, 335 (2005).\n[15] D. Burgarth and S. Bose, New J. Phys. 7, 135 (2005).\n[16] G. D. Chiara, D. Rossini, S. Montangero, and R. Fazio,\n\nPhys. Rev. A 72, 012323 (2005).\n[17] C. Burrell and T. Osborne, Phys. Rev. Lett. 99, 167201\n(2007).\n[18] D. Leung, M. Nielsen, I. Chuang, and Y. Yamamoto,\nPhys. Rev. A 56, 2567 (1997).\n[19] A. Fletcher, P. Shor, and M. Win, quant-ph/0710.1052\n(2007).\n[20] C. Bennett, D. DiVincenzo, J. Smolin, and W. Wootters,\nPhys. Rev. A 54, 3824 (1996).\n[21] R. Laflamme, C. Miquel, J. Paz, and W. Zurek, Phys.\nRev. Lett. 77, 198 (1996).\n[22] M. Horodecki, P. Horodecki, and R. Horodecki, Phys.\nRev. A 60, 1888 (1999).\n[23] In one dimension, for any non-zero degree of disorder,\nthe localization length is finite with probability one.\n\n\f"}