{"id": "http://arxiv.org/abs/1009.4394v3", "guidislink": true, "updated": "2011-02-09T14:09:02Z", "updated_parsed": [2011, 2, 9, 14, 9, 2, 2, 40, 0], "published": "2010-09-22T15:48:43Z", "published_parsed": [2010, 9, 22, 15, 48, 43, 2, 265, 0], "title": "The effect of varying sound velocity on primordial curvature\n  perturbations", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1009.1580%2C1009.2668%2C1009.2933%2C1009.0141%2C1009.3962%2C1009.4123%2C1009.4383%2C1009.1332%2C1009.2040%2C1009.5756%2C1009.3227%2C1009.1627%2C1009.2962%2C1009.3492%2C1009.3904%2C1009.0629%2C1009.3744%2C1009.5830%2C1009.2480%2C1009.1117%2C1009.4428%2C1009.4938%2C1009.2748%2C1009.2680%2C1009.1827%2C1009.6081%2C1009.0393%2C1009.5481%2C1009.1328%2C1009.2301%2C1009.0346%2C1009.0998%2C1009.3985%2C1009.5492%2C1009.5155%2C1009.5508%2C1009.1558%2C1009.2600%2C1009.6078%2C1009.1705%2C1009.0650%2C1009.3715%2C1009.1120%2C1009.1639%2C1009.4948%2C1009.1420%2C1009.4791%2C1009.1828%2C1009.0957%2C1009.1124%2C1009.4237%2C1009.3507%2C1009.5416%2C1009.5411%2C1009.2849%2C1009.4062%2C1009.4394%2C1009.5109%2C1009.0642%2C1009.2437%2C1009.1093%2C1009.0181%2C1009.3694%2C1009.1835%2C1009.6122%2C1009.2853%2C1009.0103%2C1009.4627%2C1009.2806%2C1009.5813%2C1009.3202%2C1009.4228%2C1009.3216%2C1009.1762%2C1009.4208%2C1009.3682%2C1009.6052%2C1009.4680%2C1009.5096%2C1009.4951%2C1009.0400%2C1009.1659%2C1009.3377%2C1009.4131%2C1009.0187%2C1009.5839%2C1009.0926%2C1009.0007%2C1009.0360%2C1009.2200%2C1009.0105%2C1009.6202%2C1009.6030%2C1009.5222%2C1009.5438%2C1009.4474%2C1009.5982%2C1009.3189%2C1009.4831%2C1009.4959%2C1009.3291&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The effect of varying sound velocity on primordial curvature\n  perturbations"}, "summary": "We study the effects of sudden change in the sound velocity on primordial\ncurvature perturbation spectrum in inflationary cosmology, assuming that the\nbackground evolution satisfies the slow-roll condition throughout. It is found\nthat the power spectrum acquires oscillating features which are determined by\nthe ratio of the sound speed before and after the transition and the\nwavenumeber which crosses the sound horizon at the transition, and their\nanalytic expression is given. In some values of those parameters, the\noscillating primordial power spectrum can better fit the observed Cosmic\nMicrowave Background temperature anisotropy power spectrum than the simple\npower-law power spectrum, although introduction of such a new degree of freedom\nis not justified in the context of Akaike's Information Criterion.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1009.1580%2C1009.2668%2C1009.2933%2C1009.0141%2C1009.3962%2C1009.4123%2C1009.4383%2C1009.1332%2C1009.2040%2C1009.5756%2C1009.3227%2C1009.1627%2C1009.2962%2C1009.3492%2C1009.3904%2C1009.0629%2C1009.3744%2C1009.5830%2C1009.2480%2C1009.1117%2C1009.4428%2C1009.4938%2C1009.2748%2C1009.2680%2C1009.1827%2C1009.6081%2C1009.0393%2C1009.5481%2C1009.1328%2C1009.2301%2C1009.0346%2C1009.0998%2C1009.3985%2C1009.5492%2C1009.5155%2C1009.5508%2C1009.1558%2C1009.2600%2C1009.6078%2C1009.1705%2C1009.0650%2C1009.3715%2C1009.1120%2C1009.1639%2C1009.4948%2C1009.1420%2C1009.4791%2C1009.1828%2C1009.0957%2C1009.1124%2C1009.4237%2C1009.3507%2C1009.5416%2C1009.5411%2C1009.2849%2C1009.4062%2C1009.4394%2C1009.5109%2C1009.0642%2C1009.2437%2C1009.1093%2C1009.0181%2C1009.3694%2C1009.1835%2C1009.6122%2C1009.2853%2C1009.0103%2C1009.4627%2C1009.2806%2C1009.5813%2C1009.3202%2C1009.4228%2C1009.3216%2C1009.1762%2C1009.4208%2C1009.3682%2C1009.6052%2C1009.4680%2C1009.5096%2C1009.4951%2C1009.0400%2C1009.1659%2C1009.3377%2C1009.4131%2C1009.0187%2C1009.5839%2C1009.0926%2C1009.0007%2C1009.0360%2C1009.2200%2C1009.0105%2C1009.6202%2C1009.6030%2C1009.5222%2C1009.5438%2C1009.4474%2C1009.5982%2C1009.3189%2C1009.4831%2C1009.4959%2C1009.3291&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We study the effects of sudden change in the sound velocity on primordial\ncurvature perturbation spectrum in inflationary cosmology, assuming that the\nbackground evolution satisfies the slow-roll condition throughout. It is found\nthat the power spectrum acquires oscillating features which are determined by\nthe ratio of the sound speed before and after the transition and the\nwavenumeber which crosses the sound horizon at the transition, and their\nanalytic expression is given. In some values of those parameters, the\noscillating primordial power spectrum can better fit the observed Cosmic\nMicrowave Background temperature anisotropy power spectrum than the simple\npower-law power spectrum, although introduction of such a new degree of freedom\nis not justified in the context of Akaike's Information Criterion."}, "authors": ["Masahiro Nakashima", "Ryo Saito", "Yu-ichi Takamizu", "Jun'ichi Yokoyama"], "author_detail": {"name": "Jun'ichi Yokoyama"}, "author": "Jun'ichi Yokoyama", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1143/PTP.125.1035", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1009.4394v3", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1009.4394v3", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "12 pages, 3 figures; references added; appendix modified", "arxiv_primary_category": {"term": "astro-ph.CO", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph.CO", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1009.4394v3", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1009.4394v3", "journal_reference": "Prog. Theor. Phys. 125 (2011), 1035-1052", "doi": "10.1143/PTP.125.1035", "fulltext": "RESCEU-22-10\n\nThe effect of varying sound velocity on primordial curvature perturbations\nMasahiro Nakashima\n\n1,2 ∗\n\n, Ryo Saito\n\n1,2 †\n\n, Yu-ichi Takamizu2 ,‡ and Jun'ichi Yokoyama2,3§\n\n1\n\narXiv:1009.4394v3 [astro-ph.CO] 9 Feb 2011\n\nDepartment of Physics, Graduate School of Science,\nThe University of Tokyo, Tokyo 113-0033, Japan\n2\nResearch Center for the Early Universe (RESCEU),\nGraduate School of Science, The University of Tokyo, Tokyo 113-0033, Japan\n3\nInstitute for the Physics and Mathematics of the Universe (IPMU),\nThe University of Tokyo, 5-1-5 Kashiwanoha, Kashiwa, Chiba 277-8582, Japan\n(Dated: June 24, 2018)\nWe study the effects of sudden change in the sound velocity on primordial curvature perturbation\nspectrum in inflationary cosmology, assuming that the background evolution satisfies the slow-roll\ncondition throughout. It is found that the power spectrum acquires oscillating features which are\ndetermined by the ratio of the sound speed before and after the transition and the wavenumeber\nwhich crosses the sound horizon at the transition, and their analytic expression is given. In some\nvalues of those parameters, the oscillating primordial power spectrum can better fit the observed\nCosmic Microwave Background temperature anisotropy power spectrum than the simple power-law\npower spectrum, although introduction of such a new degree of freedom is not justified in the context\nof Akaike's Information Criterion.\nPACS numbers: 98.80.-k, 98.90.Cq\n\nI.\n\nINTRODUCTION\n\nStandard inflationary cosmology [1–3] predicts nearly scale-invariant power spectrum of the primordial perturbation\n[4–7]. Such a power-law like perturbation spectrum ∆2ζ ∝ k ns −1 , where ζ is the comoving curvature perturbation\nand ns is the scalar spectral index with ns ≃ 1 has been prefered also from a number of obserbations [8]. If we\nlook into the detailed structure of the Cosmic Microwave Background (CMB) temperature anisotropy, some hints\nof small deviations from the simplest form of the curvature perturbation power spectrum show up. Among those,\nanomalously low values of the quadrupole moment or several sharp glitches in the large scale WMAP data corresponing\nto l ∼ 20 − 40 are famous and most intensively studied [9]. Furthermore, several groups have reported strong evidence\nof the deviation from a simple power-law type power spectrum by reconstructing the primordial power spectrum from\nthe WMAP data [10–19]. In particular, Ichiki et al. [20, 21] claim that they found an oscillatory modulation localized\naround the comoving wavenumber k ≃ 0.009[Mpc−1 ] (l ≃ 120) in the power spectrum at 99.995% confidence level.\nTheoretical calculation for the power spectrum has been also sophisticated recently and some inflation models based\non a realistic high-energy physics can generate peculiar features on the curvature perturbation. Those include the\nso-called Trans-Planckian effect [22–24], particle production due to the coupling between the inflaton and another\nscalar filed [25–27], temporal violation of the slow-rolling of the inflaton field [28–35], and some other models [36, 37].\nTo go further into the accurate cosmology, it is crucial to study further the details of the primordial perturbations.\nThis leads us to the detailed structure of the inflaton Lagrangian or the true high-energy physics that has realized in\nour Universe.\nIn this paper, we concentrate on the role of the sound velocity, which is defined as the propagating speed of the\nlinear perturbation in the next section. In some high-energy physics theories, there appear non-canonical kinetic terms\nin the Lagrangian and in that case the sound velocity deviates from unity [38, 39]. Furthermore, if those kinetic terms\nof the inflaton field couple to some time-dependent variables which can be seen, for example, in DBI inflation scenario\n[40], the values of the sound velocity can change during inflation [41–43]. Then we have to consider the possibility of\nsome non-trivial dynamics of the perturbation. As a result, new degrees of freedom such as the sound velocity may\nbe observed in the CMB temperature fluctuation and be tested in the future high-precision CMB observations such\nas PLANCK or CMBpol.\n\n∗ Electronic\n\naddress:\naddress:\n‡ Electronic address:\n§ Electronic address:\n† Electronic\n\nnakashima ̇at ̇resceu.s.u-tokyo.ac.jp\nr-saito ̇at ̇resceu.s.u-tokyo.ac.jp\ntakamizu ̇at ̇resceu.s.u-tokyo.ac.jp\nyokoyama ̇at ̇resceu.s.u-tokyo.ac.jp\n\n\f2\nThis paper is organized as follows. In the next section, we comment on the background evolution in our scenario and\nintroduce the sound velocity. In sec III, the basic variables and its evolution equation for the curvature perturbation\nare described. Then we consider the paricular types of the variation of the sound velocity. The first type is a step-like\nfunction, which is discussed in Sec. IV, and the second type is a top-hat type function, which we will study in Sec.\nV. The last section is devoted to the summury and discussion.\nII.\n\nBACKGROUND ASSUMPTION AND SOUND VELOCITY\n\nIn the standard single inflaton field with a canonical kinetic term, the sound velocity cs defined by the propagation\nspeed of linear perturbation has the value equal to the speed of light, namely, cs = 1. This is easily checked by\nconsidering the action of the canonical inflaton field,\n\u0013\n\u0012\nZ\n√\n1\n1\nR + X + V (φ) , X = − g μν ∂μ φ∂ν φ,\n(2.1)\nS = d4 x −g\n2\n2\nwhere R denote the Einstein-Hilbert action and we set the reduced Planck scale to unity (8πG = 1). Expanding the\naction around the background Friedman-Robertson-Walker (FRW) metric up to second-order, then we can see that\nthe sound velocity which appears as the coefficient of the spatial derivative term is exactly equal to one.\nGeneralizing the above inflaton action to an arbitary function of the kinetic term X,\n\u0012\n\u0013\nZ\n1\n4 √\nS = d x −g\nR + P (X, φ) ,\n(2.2)\n2\nthe situation changes completely. In this action, expanding around FRW metric up to second-order, we find the sound\nvelocity is given by\nc2s =\n\nPX\n,\n2PXX X + PX\n\n(2.3)\n\nwhere the subscript X represents a derivative with respect to X. The specific second-order action for the approapriate\nperturbation variable, what we call the comoving curvature perturbation, will be presented in the next section. It\nis clear from (2.3) that, in principle, the sound velocity takes various values corresponding to the functional form\nP (X, φ) and the values of X and φ.\nIn this paper, in order to extract the effects of the change of the sound velocity alone, we study the cases it changes\nsuddenly once or twice during inflation without affecting the background evolution. The sudden change of the sound\nvelocity can be realized, for example, if the Lagrangian has terms like\nP (X, φ) ⊃ f (φ)X + [1 − f (φ)]X 2 /Λ4 , f (φ) =\n\n1\n1+\n\n,\n\n(2.4)\n\n(n ≥ 3)\n\n(2.5)\n\ne(φ−φ0 )/d\n\nor\nP (X, φ) ⊃ b(φ)X + X 2 /Λ4 , b(φ) ≃ (φ − φ0 )2 + O ((φ − φ0 )n ) ,\n\nwhere φ is a scaler field which we assume to be the inflaton and Λ is some cut-off scale. In the former case, we find\nc2s = 1 when φ ≪ φ0 and c2s = 1/3 when φ ≫ φ0 . Such a transition of the sound velocity due to the motion of the field\nφ is approximately described by a step function. In the latter case, c2s = 1/3 only when φ ≃ φ0 and at the other values\nof φ, c2s = 1. This variation is well approxmated by a top-hat type function. In generic unified theories including\nstring theory, there appears many scalar fields which have non-trivial kinetic terms and it is likely that those kinetic\nterms naturally couple to the scalar field itself in a complicated way. Here we consider simple tractable examples of\nposssible deviation from the canonical model as described above.\nIf we take these models as they are, the background evolution, in particular the slow-roll parameters, may also be\nseverely modulated unless some fine-tunning is applied. Since the effects of the sudden change of slow-roll parameters\nǫ=−\n\nḢ\n,\nH2\n\nη=\n\nǫ̇\n,\nHǫ\n\n(2.6)\n\nwhere a dot represents a derivative with respect to the physical time t, have been already studied in the literatures\n[31, 32], we concentrate on the cases only the sound velocity changes suddenly as mentioned above. Thus, we impose\nthe slow-roll conditions\n|ǫ| ≪ 1,\n\n|η| ≪ 1,\n\n(2.7)\n\n\f3\nthroughout this paper. Such a situation can be also realized in the curvaton scenario as discussed in Appendix A.\nIn the usual calculation of linear perturbation in this type of generalized non-canonical kinetic term inflation models,\nnew parameters which parametrize the time variation of the sound velocity such as\nǫs =\n\nċs\n,\ncs H\n\nηs =\n\nǫ̇s\n,\nǫs H\n\n(2.8)\n\nare introduced and additional slow-roll conditions |ǫs | < 1, |ηs | < 1 are imposed. In this paper, however, being\ninterested in the effect of the more general variation of sound velocity mentioned above, we consider the situation\nwhere these conditions are temporarily violated by the sudden change of the sound velocity.\nIn the following sections, we derive the approapriate variables for calculating the perturbation and the matching\ncondition at the transition epoch. Then we evaluate the final power spectrum for two concrete examples of the sound\nvelocity variation.\nIII.\n\nCURVATURE PERTURBATION AND BASIC EQUATION\n\nThe scalar perturbation from the Background FRW metric in the conformal Newtonian gauge is incorporated as\n\u0003\n\u0002\n(3.1)\nds2 = a2 −(1 + 2Ψ)dτ 2 + (1 + 2Φ)δij dxi dxj\n\nDenoting the inflaton perturbation δφ and the background value of the inflaton field φ̄, the most common perturbation\nvariable, namely, comoving curvature perturbation ζ is defined as [44–46]\nζ ≡ Φ+\n\nH\nδφ.\nφ̄ ̇\n\n(3.2)\n\nThe basic action and the equation of motion in the linear theory for ζ is written in terms of\nv = ζz,\n\n(3.3)\n\n√\na 2ǫ\n.\nz≡\ncs\n\n(3.4)\n\nwhere a new parameter z is defined by\n\nThe second-order action for v is derived by substituting (3.1) and φ = φ̄ + δφ into (2.2), neglecting the higher-order\nterms and using the background evolution equation. The result is\n\u0013\n\u0012\nZ\n1\nz ′′ 2\n(2)\n3\n′2\n2\nS =\n(3.5)\ndτ d x v + cs v∆v + v ,\n2\nz\nwhere a prime denotes a derivative with respect to the conformal time τ . Then, the equation of motion for Fouriertransformed perturbation variable vk is given by\n\u0013\n\u0012\nz ′′\n′′\n2 2\nvk = 0.\n(3.6)\nvk + cs k −\nz\nThe above so-called Mukhanov-Sasaki equation (3.6) is commonly used to discuss the behavior of the curvature\nperturbation. Here, however, we are interested in the time-dependence of the sound velocity, in which situation the\npotential term z ′′ /z in (3.6) is not easy to treat since the variable z also contains cs . For example, if we consider a\nstep-function-type variation of the sound velocity, a square term of (c′s /cs ) appears in z ′′ /z, which becomes the square\nof the delta function δ(τ − τ0 ) and makes the analysis impossible where τ0 denotes time when sound velocity changes.\nIt is therefore clear that the equation for vk is not suitable1 and so we should introduce a new variable uk , which\nis related to vk as [47]\n\u0010 v \u0011′\n\u0010 u \u0011′\nk\nk\n− cs k 2 u k = z\n, cs vk = θ\n,\n(3.7)\nz\nθ\n1\n\nAs discussed in Appendix A, this is not the case in the curvaton scenario.\n\n\f4\nwhere we have defined\nθ≡\n\n1\n.\ncs z\n\nThe basic equation of motion (3.6) for vk is translated into the new equation in terms of uk , which is\n\u0013\n\u0012\nθ′′\n′′\n2 2\nuk = 0.\nu k + cs k −\nθ\n\n(3.8)\n\n(3.9)\n\nNote that the term (c′s /cs ) does not exist in θ′′ /θ since the variable θ does not depend on cs due to the definition of\nθ, (3.8). We have to solve this equation under the assumption that the background evolution satisfies the slow-roll\nconditions (2.7).\nThe term θ′′ /θ is rewritten in terms of slow-roll parameters as\n\u0011\nθ′′\n1 \u0010η\n= 2\n+ǫ ,\nθ\nτ\n2\n\n(3.10)\n\n1\n.\nτ (1 − ǫ)\n\n(3.11)\n\nwhere we have used slow-roll approximation (2.7) and a useful equation\naH = −\nTherefore, we obtain the basic equation as\n\u0012\n\u0013\nν 2 − 14\nu′′k + c2s k 2 −\nuk = 0,\nτ2\n\n(3.12)\n\nwhere we have defined\n1\nη\n+ǫ+ .\n2\n4\n\n(3.13)\n\n1\n1 η\nη\n+ ǫ + ≈ + + ǫ.\n2\n4\n2 2\n\n(3.14)\n\nν2 =\nand approximate it as\nν=\n\nIV.\n\nr\n\nSTEP-LIKE VARIATION OF THE SOUND SPEED\n\nIn this section, we compute the curvature perturbation for a model such that time variation of the sound velocity\nis described by a step function as\n(\ncs1 (τ < τ0 )\ncs =\n.\n(4.1)\ncs2 (τ > τ0 )\nTo take into account the transition of the sound velocity, it is important to impose a matching condition to the solution\nin (3.9) at τ = τ0 when the sound velocity suddenly changes. The matching condition is obtained by integrating (3.9)\nin an infinitesimaly small time interval [τ0 − δτ, τ0 + δτ ], yielding two conditions;\nuk (τ0 − δτ ) = uk (τ0 + δτ ), u′k (τ0 − δτ ) = u′k (τ0 + δτ ).\n\n(4.2)\n\nHereafter, we use the following expression\nuk (τ0 − δτ ) → uk1 , uk (τ0 + δτ ) → uk2 .\nIn the regime when τ < τ0 , setting cs = cs1 leads to the equation of motion\n\u0013\n\u0012\nν 2 − 14\n′′\n2 2\nuk = 0,\nuk + cs1 k −\nτ2\n\n(4.3)\n\n(4.4)\n\n\f5\nand its solution is obtained by\nuk1 =\n(1),(2)\n\np\n\nh\ni\n−kcs1 τ d1 Hν(1) (−kcs1 τ ) + d2 Hν(2) (−kcs1 τ ) ,\n\n(4.5)\n\nwhere Hν\n(−kcs1 τ ) denote the Hankel functions and d1,2 are constants to be determined by the initial condition\nat τ → −∞. We choose the adiabatic vacuum at the initial time in terms of vk :\n1\ne−ikcs1 τ .\nvk → √\n2kcs1\n\n(4.6)\n\nFrom the equation (3.7), we find\n− cs1 k 2 uk1 = vk′ ,\n\n(4.7)\n\nwell inside the horizon, so we can take\nuk1 = √\n\ni\ne−ikcs1 τ\n2cs1 k 3/2\n\nand match it with the limiting form of the Hankel function,\nr\nh \u0010\nνπ\nπ \u0011i\n2\n(1,2)\n,\nexp i ±x −\n−\nHν (x) →\nπx\n2\n4\n\n(4.8)\n\n(x → ∞),\n\n(4.9)\n\nwhere the upper and lower signs correspond to the first and the second types, respectively. Hence it leads to the\nchoice of d1 , d2 as\n\u0012\n\u0013\nr\ni\n2ν + 1\nπ\nexp\nπi , d2 = 0.\n(4.10)\nd1 = 3/2\ncs1\n4\n2k\nNeglecting all the phase factors which is irrelevant for calculating the power spectrum, the solution uk1 takes the form\n√\n−πτ (1)\nuk1 =\nHν (−kcs1 τ ).\n(4.11)\n2k\nNext, in the regime when τ > τ0 , setting cs = cs2 leads to\n√\ni\n−kcs2 τ h ′ (1)\nαk Hν (−kcs2 τ ) + βk′ Hν(2) (−kcs2 τ ) ,\nuk2 =\n2\n\n(4.12)\n\nand it is rewritten by\n\nuk2 =\nwhere we have defined\n\n√\ni\n−πτ h\nαk Hν(1) (−kcs2 τ ) + βk Hν(2) (−kcs2 τ ) ,\n2k\n\nαk ≡\n\nr\n\ncs2 3/2 ′\nk αk ,\nπ\n\nβk ≡\n\nr\n\ncs2 3/2 ′\nk βk .\nπ\n\n(4.13)\n\n(4.14)\n\nFrom (4.2), we finally obtain the coefficients αk and βk as\ni\niπkτ0 h\n(2)\n(1)\ncs2 Hν(1) (−kcs1 τ0 )Hν+1 (−kcs2 τ0 ) − cs1 Hν(2) (−kcs2 τ0 )Hν+1 (−kcs1 τ0 ) ,\n4\ni\niπkτ0 h\n(1)\n(1)\ncs2 Hν(1) (−kcs1 τ0 )Hν+1 (−kcs2 τ0 ) − cs1 Hν(1) (−kcs2 τ0 )Hν+1 (−kcs1 τ0 ) ,\nβk = −\n4\n\nαk =\n\n(4.15)\n(4.16)\n\nwhere we have used the following relation among the Hankel functions,\n(1)\n\n(2)\n\nHν+1 (x)Hν(2) (x) − Hν+1 (x)Hν(1) (x) = −\n\n4i\n.\nπx\n\n(4.17)\n\n\f6\nWe have to estimate the power spectrum of ζ at the final time τ → 0. By using (3.7), the curvature perturbation\ncan be rewritten in terms of the variable u as\n\u0013\n\u0012\n\u0010 \u0011′\nvk\nθ′\n′\n2 uk\nζk =\n= θ uk − uk\n=θ\nz\nθ\nθ\nη\u0011\nH \u0010\n1−\n≈√\nuk .\n(4.18)\n2\n2ǫ\n\nwhere, at the last transformation, we have chosen the super-horizon limit and neglected u′k term. Therefore, we need\nthe final values expressed as uk2 (τ → 0). From the solution (4.13), we obtain\n√\n\u0013−ν\n\u0012\n−kcs2 τ\n−πτ i\n(αk − βk ),\n(4.19)\nΓ(ν)\nuk2 (τ → 0) ≃\n2k π\n2\nwhere Γ(x) denotes the Gamma function and we have used the limiting form of the Hunkel function as\n\u0010 y \u0011−ν\ni\nHν(1) (y) ≃ −Hν(2) (y) ≃ Γ(ν)\n, (y → 0).\nπ\n2\n\n(4.20)\n\n4ν Γ2 (ν) H 2\n2ν−1\n[aH(1 − ǫ)]\n(kcs2 )−2ν (1 + η) |αk − βk |2 + O(ǫ2 , η 2 ),\n8πk 2 ǫ\n\n(4.21)\n\nBy using (4.18) and (4.19), we can calculate the power spectrum of curvature perturbation as\nPζ (k) = |ζk (τ → 0)|2 ≈\n\nwhere we have used the slow-roll approximation. Hence the term |αk − βk |2 is important to determine the power\nspectrum. αk − βk can be described by using (4.15) and (4.16) as\n\u0014\n\u0011\niπkτ0 \u0010\nαk − βk =\ncs2 Jν (−kcs1 τ0 )Jν+1 (−kcs2 τ0 ) − cs1 Jν+1 (−kcs1 τ0 )Jν (−kcs2 τ0 )\n2\n\u0010\n\u0011\u0015\n+ i cs2 Nν (−kcs1 τ0 )Jν+1 (−kcs2 τ0 ) − cs1 Nν+1 (−kcs1 τ0 )Jν (−kcs2 τ0 ) ,\n(4.22)\nwhere Jν , Nν are the Bessel functions with ν = 21 + η2 + ǫ. Then we can calculate |αk − βk |2 as\n\u0014\n\u00112\nπ 2 k 2 τ02 \u0010\n2\n|αk − βk | =\ncs2 Jν (−kcs1 τ0 )Jν+1 (−kcs2 τ0 ) − cs1 Jν+1 (−kcs1 τ0 )Jν (−kcs2 τ0 )\n4\n\u0010\n\u00112 \u0015\n+ cs2 Nν (−kcs1 τ0 )Jν+1 (−kcs2 τ0 ) − cs1 Nν+1 (−kcs1 τ0 )Jν (−kcs2 τ0 )\n.\n\n(4.23)\n\nHere, we define new variables A and k0 as\n\ncs2 = Acs1 , −cs2 τ0 =\n\n1\n1\n, −cs1 τ0 =\n,\nk0\nAk0\n\n(4.24)\n\nand using them leads to\n\u0012 \u0013\u0014 \u0012\n\u0012\n\u0012 \u0013\u0014\n\u0012\n\u0012\n\u001a\n\u0013\n\u0013\u0015\n\u0013\n\u0013\u0015\nk\nk\nk\nk\nk\nk\nπ2 k2\n2 2\n2\n2\n2\n2\n2\nJν\n+ Nν\n+ Jν\nJν+1\n+ Nν+1\n|αk − βk | = 2 2 A Jν+1\n4k0 A\nk0\nAk0\nAk0\nk0\nAk0\nAk0\n\u0012 \u0013 \u0012 \u0013\u0014 \u0012\n\u0012\n\u0012\n\u0012\n\u0013\n\u0013\n\u0013\n\u0013\u0015 \u001b\nk\nk\nk\nk\nk\nk\n− 2AJν+1\nJν\nJν\nJν+1\n+ Nν\nNν+1\n.\n(4.25)\nk0\nk0\nAk0\nAk0\nAk0\nAk0\n2\n\nFinally, we can evaluate the power spectrum at the sound horizon crossing aH = kcs2 as\n\u0012\n\u0013\n(1 − ǫ)η+2ǫ H 2\n21+η+2ǫ 2 1 η\n(1 + η) |αk − βk |2\nΓ\n+ +ǫ\n.\nPζ (k) =\n8π\n2 2\nǫ\nk3\naH=kcs2\n\n(4.26)\n\nIn the lowest-order slow-roll approxmation, we can set ν = 21 , in which case the Bessel functions are expressed by\ntrigonometric functions and the modulation factor |αk − βk |2 can be recast to the following simple form (see Fig.1(a)).\n\u0012 \u0013\u0015\n\u0013\n\u0014\n\u0012\nk\n1\n2\n2\n.\n(4.27)\n− 1 sin\n|αk − βk | = A 1 +\nA2\nk0\n\n\f7\n8000\n\n1.2\n\n7000\n1.15\n\nAmp = 0.5, k0 = 0.001[Mpc -1]\nAmp = 0.5, k0 = 0.0002[Mpc-1]\nAmp = 0.5, k0 = 0.00005[Mpc -1]\n\nπ\nl(l+1)C TT\nl /2\n\nModulation\n\n6000\n1.1\n\n1.05\n\n5000\n\n4000\n\n3000\n\n1\n\n2000\n0.95\n\n1000\n\n0.9\n0.01\n\n0.1\n\n1\n\n0\n\n10\n\n10\n\nk/k 0\n\n100\n\n1000\n\nMultipole l\n\n(a)\n\n(b)\n\nFIG. 1: (a) The modulation factor in the leading-order slow-roll approxmation (4.27) in the case A = 0.9 (Amp = 0.17). (b)\nCMB temperature anisotropy spectrum for some different values of k0 . The other cosmological values are chosen as the WMAP\n7-year mean values.\n\nIn this case, neglecting the slow-roll correction in the numerator, the dimensionless power spectrum (4.26) becomes\n\u0012 \u0013\u0015\n\u0014\n\u0012\n\u0013\nH 2A\nk\n1\nk3\n2\n2\n1+\n.\n(4.28)\n− 1 sin\n∆ζ (k) ≡ 2 Pζ (k) =\n2\n2\n2π\n8π ǫcs2\nA\nk0\nThis result recovers the usual power spectrum with constant sound velocity if we take A = 1. In the large-scale limit\nk → 0, we can drop the oscillatory term and the final expression becomes\n∆2ζ (k) =\n\nH2\n,\n8π 2 ǫcs1\n\nwhich represents the power spectrum for modes which cross the horizon far before the transition time τ0 .\nTaking the result (4.28) as the input primordial power specrum, or more quantitatively speaking, taking\n\u0012\n\u0012 \u0013\u0015\n\u0013ns −1 \u0014\nk\nk\n2\n2\n∆ζ (k) = As\n1 + Amp sin\n,\nkpiv\nk0\n\n(4.29)\n\n(4.30)\n\nAs = 2.43 × 10−9 , kpiv = 0.002[Mpc−1 ], ns = 0.963,\n\nas the input one, we have computed CMB temperature anisotropy for several values of k0 (see Fig.1(b)). Comparing\n(4.30) with (4.28), we can clearly see that Amp ≡ 1/A2 − 1. The parameter k0 determines the scale under which the\nrapid modulation appears. As we expect, if the value of k0 is chosen as O(0.001[Mpc−1 ]) or smaller, then the CMB\nspectrum starts to oscillate at the relatively large scale around l ≃ 10, which may better fit some anomalous data\npoints obserbed in WMAP. Actually, as one exapmle value, if we take k0 = 0.003[Mpc−1 ], Amp = 0.087 and neglect\nthe small scale (l ≥ 200) oscillation, we have found that the χ2 -value improves 3.2 compared with the usual case of\npower-law primordial power spectrum.\nIn Fig.2, we have plotted the difference between the CMB temperature anisotropy spectrum calculated by the\nprimordial power spectrum with oscillations (4.30) and the one by the usual power-law power spectrum without\noscillations, which we denote Closc and Clstd , respectively. Here the difference is defined as\n∆Cl\nC osc − C std\n≡ l std l .\nCl\nCl\n\n(4.31)\n\nNote that the overall amplitude As in Closc is different from that used in Clstd by a factor (1 + Amp /2)−1 . We have\nalso plotted the expected scatter of Cl due to the cosmic variance, which is given by\ns\n\u0013\n\u0012\n2\n∆Cl\n, fsky = 0.65.\n(4.32)\n=\nCl CV\n(2l + 1)fsky\n\n\f8\nNote that the observational error of WMAP is cosmic-variance limited up to l ≃ 400 and it will be extended to\nl ≃ 2500 for PLANCK. Hence from this figure we can constrain Amp as Amp . 0.1 now for k0 = 10−4 [Mpc−1 ] which\ncorresponds to the largest scale that can be measured with CMB experiments.\n0.01\n$PS \u0013\u0011\u0016\n$PS \u0013\u0011\u0014\n$PS \u0013\u0011\u0013\u0014\n3/$1&.\u0003H[SHFWHG\u0003HUURU\n\nѬ Cl/Cl\n\n0.005\n\n0\n\n-0.005\n\n-0.01\n100\n\n200\n\n300\n\n400\n\n500\nMultipole l\n\n600\n\n700\n\n800\n\n900\n\n1000\n\nFIG. 2: The difference between CMB temperature anisotropy spectrum from the initial power spectrum with the oscillation and\nwithout the oscillation. We choose k0 = 0.0001[Mpc −1 ] and the obserbational detection limit in the PLANCK-like experiment\nis also depicted.\n\nThis feature in the spectrum can be compared with the Trans-Planckian signatures [22–24], with the particle\nproduction effect, or with the spectrum generated in the case the inflaton potential has a break in its slope. In the\nfirst case, the modification of the initial vacuum can change the relation and then leads to the ringing signatures in\nthe primordial power spectrum. The exact form of the pattern depends on the choice of the hypersurface on which\nthe initial condition is imposed. In the so-called Boundary Effective Field Theory (BEFT) approach [48, 49], the final\nexpression becomes\nPBEFT (k) = As\n\n\u0012\n\nk\nk0\n\n\u0013ns −1 \u0014\n\n1+\n\n\u0013\u0015\n\u0012\nβk\nk\nsin 2\nai Λ\na i Hi\n\n(4.33)\n\nwhere ai and Hi are the scale factor and the Hubble parameter on the initial condition hypersurface, respectively, and\nΛ is a cutoff scale. This is similar to our result (4.28), but the amplitude of the oscillation depends on the wavenumber\nk, which makes crucial difference with our result.\nIn the second case, Barnaby et al. [26] discuss that the particle production (PP) make a bumplike contribution to\nthe power spectrum, which is well fitted by\nPPP (k) = As\n\n\u0012\n\nk\nk0\n\n\u0013ns −1\n\n+ A⋆\n\n\u0012\n\nk\nk⋆\n\n\u00133\n\n\u0013\n\u0012\nπk 2\nexp − 2 .\n2k⋆\n\n(4.34)\n\nThe feature is localized around k⋆ , which makes sharp difference with our result.\nIn the last category, where the second derivative of the inflaton field has a sudden change at τ = τ0 , the modulation\nfactor can be calculated similarly and the final expression is also similar to our result at the first glance. However,\nthere is a big difference because in this case the slow-roll parameter has a step-like function over the transition time\nand the tilt of the spectrum takes the different values before and after the transition [33, 34].\n\n\f9\nV.\n\nTOP-HAT TYPE VARIATION\n\nIn this section, we consider the other type of variation of sound velocity, namely, the top-hat type. This is a simple\nextension of the model discussed in the last section. We parametrize the variation as\n\n\ncs1 (τ < τ0 )\ncs = cs2 (τ0 < τ < τ0′ ) .\n(5.1)\n\nc\n′\n(τ0 < τ )\ns1\nand impose the same matching condition to the wavefunction uk as in (4.2) at the two transition times τ0 and τ0′ .\nThe solutions of the equation of motion during constant sound velocity regimes are expressed in the same way as in\nthe last section and we parametrize them as follows;\n√\n−πτ (1)\nHν (−kcs1 τ ) (τ < τ0 ),\n(5.2)\nuk1 = P\n√ 2k h\ni\n−πτ\nαk1 Hν(1) (−kcs2 τ ) + βk1 Hν(2) (−kcs2 τ ) (τ0 < τ < τ0′ ),\n(5.3)\nuk2 =\n2k\n√\ni\n−πτ h\nuk3 =\nαk2 Hν(1) (−kcs1 τ ) + βk2 Hν(2) (−kcs1 τ ) (τ0′ < τ ),\n(5.4)\n2k\n\nwhere we have chosen the Bunch-Davies vacuum state at τ ≪ τ0 . Two coefficients αk1 and βk1 in (5.3) correspond to\nαk and βk in (4.13). Since the solutions and the matching conditions are the same, the coefficients αk1 and βk1 are\ngiven by (4.15) and (4.16). The matching conditions at τ = τ0′ gives the relations between αk2 , βk2 and αk1 , βk1 ;\n\"\u001a\n\u001b\niπkτ0′\n(1)\n(2)\n′\n(2)\n′\n′\n(1)\n′\ncs2 Hν+1 (−kcs2 τ0 )Hν (−kcs1 τ0 ) − cs1 Hν+1 (−kcs1 τ0 )Hν (−kcs2 τ0 ) αk1\nαk2 = −\n4\n\u001a\n\u001b #\n(2)\n(2)\n′\n(2)\n′\n′\n(2)\n′\n(5.5)\n+ cs2 Hν+1 (−kcs2 τ0 )Hν (−kcs1 τ0 ) − cs1 Hν+1 (−kcs1 τ0 )Hν (−kcs2 τ0 ) βk1 ,\nβk2\n\n\"\u001a\n\u001b\niπkτ0′\n(1)\n(1)\n′\n(1)\n′\n′\n(1)\n′\n=\ncs2 Hν+1 (−kcs2 τ0 )Hν (−kcs1 τ0 ) − cs1 Hν+1 (−kcs1 τ0 )Hν (−kcs2 τ0 ) αk1\n4\n\u001b #\n\u001a\n(1)\n(1)\n′\n(1)\n′\n′\n(1)\n′\n+ cs2 Hν+1 (−kcs2 τ0 )Hν (−kcs1 τ0 ) − cs1 Hν+1 (−kcs1 τ0 )Hν (−kcs2 τ0 ) βk1 .\n\n(5.6)\n\nWe want to know the power spectrum of the curvature perturbation at the final epoch τ → 0. As we have already\nseen, all we need is uk3 (τ → 0). Combination of the solution (5.4) and the limiting form of the Hankel function leads\nto\n√\n\u0013−ν\n\u0012\n−kcs1 τ\n−πτ i\nuk3 (τ → 0) ≃\n(αk2 − βk2 ),\n(5.7)\nΓ(ν)\n2k π\n2\nand the power spectrum of the curvature perturbation is described as\nPζ (k) ≡ |ζ(τ → 0)|2 =\n\nH2 \u0010\nη \u00112\n|uk3 (τ → 0)|2 .\n1+\n2ǫ\n2\n\n(5.8)\n\nAlso in this case, the factor to determine the modulation pattern is |αk2 − βk2 |2 , which can be calculated by inserting\n(4.15) and (4.16) into (5.5) and (5.6). The final functional form however is so complicated. We therefore show the\nresult only in the leading order slow-roll approximaton;\n\u0014\n\u0015\n1\n|αk2 − βk2 |2 ≃ cos2 [−kcs2 (τ0′ − τ0 )] + sin2 [−kcs2 (τ0′ − τ0 )] A2 sin2 (−kcs1 τ0′ ) + 2 cos2 (−kcs1 τ0′ )\nA\n\u0013\n\u0012\n1\ncos(−kcs1 τ0′ ) sin(−kcs1 τ0′ ) cos [−kcs2 (τ0′ − τ0 )] sin [−kcs2 (τ0′ − τ0 )] + O(ǫ, η).\n(5.9)\n−2 A−\nA\nAs expected, the modulation is determined by the combination of sine and cosine osillations. We can transform\n(5.9) to the following form.\n\n\f10\n1.2\n\n7000\n\n1.15\n\n6000\n1.1\n\nA=1.1, B=1.1, k0 = 0.00005[Mpc -1]\nA=1.1, B=1.1, k0 = 0.0002[Mpc-1]\nA=1.1, B=1.1, k0 = 0.001[Mpc-1]\n\nπ\nl(l+1)C TT\nl /2\n\nModulation\n\n5000\n1.05\n\n1\n\n0.95\n\n4000\n\n3000\n\n0.9\n\n2000\n0.85\n\n1000\n\n0.8\n\n0.75\n0.1\n\n1\n\n10\n\n100\n\n0\n10\n\nk/k 0\n\n100\n\n1000\n\nMultipole l\n\n(a)\n\n(b)\n\nFIG. 3: (a) The modulation factor in the leading order slow-roll approxmation (5.10) in the case A = 1.1 and B = 0.9. (b)\nCMB temperature anisotropy spectrum for some different values of k0 . The other cosmological values are chosen as the WMAP\n7-year mean values.\n\n\u0014\nA2 − 1\n(A2 − 1) sin2 [−kcs2 (τ0′ − τ0 )] − (A2 + 1) sin2 (−kcs1 τ0′ )\n2A\n\u0015\n(A − 1)2\n(A + 1)2\n2\n2\n′\n′\n′\n′\nsin [−kcs1 τ0 + kcs2 (τ0 − τ0 )] +\nsin [−kcs1 τ0 − kcs2 (τ0 − τ0 )] .\n+\n2\n2\n\n|αk2 − βk2 |2 =1 −\n\n(5.10)\n\nIt is clear in this expression that there is no modulation when A = 1 or τ0 = τ0′ , which means no change in\nsound velocity. If we consider the long-wavelength limit (k → 0), the dimensionless power spectrum of the curvature\nperturbation reduces to the same form as (4.29) in the lowest-order slow-roll approximation of the numerator, which\nis valid because the long-wavelength mode exits the Hubble horizen when the sound velocity is cs1 and superhorizen\nmode does not feel the sound velocity change.\nThe modulation factor (5.9) or (5.10) is plotted in Fig.3(a) and the CMB temperature anisotropy spectrum is\nplotted in Fig.3(b). In both figures, we defined three parameters k0 , A and B as −cs1 τ0′ = 1/k0 , τ0 = Bτ0′ and\ncs2 = Acs1 , respectively. In these figures, We can see a beat, which is very natural because we now have two\ncharactarizing parameters cs1 τ0′ and cs2 (τ0′ − τ0 ) that determines the ocsillation periods and the final modulation\npattern is the superposition of these waves. This result is easily extended to more general cases; if the variation of the\nsound velocity occurs suddenly and during it remains constant at other regimes, then the modulation of the power\nspectrum is some superpositions of several waves composed by trigonometric functions, which appears as a beat and\nthe amplitude of the oscillation is independent of the wavenumber.\nVI.\n\nSUMMARY AND DISCUSSION\n\nIn summary, we have calculated the power spectrum of the curvature perturbation in case the sound velocity\nchanges suddenly during inflation. In order to focus on the effects of the change of the sound velocity, we have\nassumed that the slow-roll parameters that reflect the background evolution are not affected and remains constant\nduring the transition of the sound velocity and found that in the shorter-wavelength modes (with larger k) compared\nwith the Hubble radius at the transition time there appears osillation patterns due to the mode mixing. In the\nsimplest model in which the sound\n\u0010 \u0011 velocity experiences only one transition, the oscillation in the power spectrum is\n2\nexpressed as ∝ 1 + Amp sin kk0 where k0 corresponds to the wavenumber that crosses the sound horizon at the\n\ntransition time, Amp is defined as Amp = 1/A2 − 1 and A is the ratio of sound velocity before and after the transition.\nDifferent from the trans-Planckian signatures or the models with a sudden change of the slow-roll parameters, the\namplitude of the oscillation does not depend on the wavenumber, which gives a clue to find an evidence of the change\n\n\f11\nA=0.995\nA=0.99\nA=0.97\n(Amp = 0.0099) (Amp = 0.0197) (Amp = 0.0574)\nk0 = 0.0001\n-0.054\n-0.11\n-0.27\nk0 = 0.0003\n-0.063\n-0.11\n-0.13\nk0 = 0.001\n-0.34\n0.60\n-0.81\nk0 = 0.003\n0.045\n0.30\n3.34\nTABLE I: This table shows the ∆χ2 values in the step-function model described in Sec.IV compared with WMAP 7-year best\nfit cosmological parameters in the simple ΛCDM model. The unit of the wavenumber k0 is Mpc−1 . For the calculation of the\nχ2 values, we exploited the WMAP-7year likelihood funcion [50].\n\nk0′ = 0.00001\nk0′ = 0.00005\nk0′ = 0.0001\nk0′ = 0.0005\n\nA = 1.005 A = 1.01 A = 1.03\n-2.26\n-1.54\n2.53\n-1.88\n-1.40\n1.28\n-1.72\n-1.25\n1.33\n-2.01\n-1.59\n2.28\n\nTABLE II: This table shows the ∆χ2 values in the top-hat function model described in Sec.V compared with WMAP 7-year\nbest fit cosmological parameters in the simple ΛCDM model. We have defined a new variable k0′ as −cs1 τ0 ≡ 1/k0′ . The\nunit of the wavenumber k0′ is Mpc−1 . Here, we fix k0 = 0.001[Mpc −1 ]. For the calculation of the χ2 values, we exploited the\nWMAP-7year likelihood funcion [50].\n\nof the sound velocity by some observations. Actually, we have computed the CMB temperature anisotropy using the\nprimordial power spectrum we have obtained and we can see the oscillating patterns in the resulting angular power\nspectrum originating in the modulation of the primordial curvature perturbations.\nThese oscillatory behaviors make it difficult to constrain the amplitude of the modulation using Markov Chain\nMonte Carlo (MCMC) analysis due to the problem of the convergence. Thus, we calculated the difference between\nthe CMB temperature spectrum from the oscillatory primordial power spectrum and the one without the oscillation\nand compared it with the scatter due to the cosmic variance. We have confirmed that if k0 = 10−4 [Mpc−1 ] the current\nCMB experiment is sensitive to Amp & 0.1 or in other words is sensitive to A . 0.95.\nTo discuss how WMAP experiment can constrain or find the amplitude of the oscillation of the primordial power\nspectrum, in Tables I and II, we have computed ∆χ2 for various parameter values in the two models we have\nconsidered. We can check from this table that in the step-function model, too small a transition scale (or too large a\ntransition wavenumber k0 ) and too large an oscillation amplitude cannot fit the present CMB anisotropy data. In the\ntop-hat function model, we have found several good improvements of ∆χ2 values, though we have more parameters\nthan step-function model in thic model. Although we have been unable to find parameter values that satisfy Akaike's\nInformation Criterion [51], several negative ∆χ2 values may give us some motivations to search for the parameter\nvalues for much better fit to WMAP data or more accurate future CMB experiment data in our model.\nAcknowledgments\n\nM.N and R.S are supported by JSPS through research fellowships. The work of Y.T is based on the financial\nsupport by Research Center of the Early Universe (RESCEU), University of Tokyo and by JSPS Grant-in-Aid for\nYoung Scientists (B) No. 21740192. The work of J.Y is supported by JSPS Grant-in-Aid for Scientific Research No.\n19340054 and Global COE Program \"The Physical Sciences Frontier\", MEXT, Japan.\nAppendix A\n\nIn this appendix, we comment on the consistent background evolution which keeps slow-roll condition during the\nsudden transition of the sound velocity. In general, the slow-roll conditions are violated by changing the sound velocity\nso rapidly like step-type funtion without numerical fine-tuning between non-canonical kinetic terms.\nOne way to overcome the difficulty is to consider the curvaton scenario [52, 53]. If the curvaton Lagrangian has the\n\n\f12\nfollowing form,\nL=\n\n1\n1\n1\n1\n∂μ φ∂ μ φ + f (φ)∂μ σ∂ μ σ + g1 (φ)(∂μ φ∂ μ φ)2 + g2 (φ)(∂μ σ∂ μ σ)2\n2\n2\n4\n4\n1\nm2 2\n1\nσ ,\n+ g3 (φ)(∂μ φ∂ μ φ)(∂ν σ∂ ν σ) + g4 (φ)(∂μ φ∂ μ σ)2 + * * * − V (φ) −\n4\n4\n2\n\n(6.1)\n\nwhere φ and σ denote the inflaton and the curvaton, respectively, and gi (φ) = O(Λ−4 ). Assuming that, during\ninflation, the curvaton is set to some constant value, we can write down the second-order Lagrangian of the curvaton\nperturbation\nL(2)\nσ =\n\nm2 2\nF (φ)2 ′2 F (φ)2 + G(φ)\n2\nσ\n−\n(∇σ)\n−\nσ .\n2a2\n2a2\n2\n\n(6.2)\n\nHere,\nF (φ)2 = f (φ) + (g3 (φ) + g4 (φ)) Xφ + * * * ,\nG(φ) = −g4 (φ)Xφ + * * * ,\n\n(6.3)\n(6.4)\n\nwhere Xφ = φ̇2 /2. Then we can read off the sound velocity for the curvaton perturbation as\nc2s =\n\nF (φ)2 + G(φ)\nf (φ) + g3 (φ)Xφ\n=\n.\nF (φ)2\nf (φ) + (g3 (φ) + g4 (φ))Xφ\n\n(6.5)\n\nIn order for cs to deviate from unity, there should be difference between the coefficients of time-derivative and of\nspace-derivative. During inflation, the background breaks the symmetry between time and space through φ̇. Because\nof the coupling ∂μ φ∂ μ σ, the sound velocity of σ can be affected by φ̇. Actually the important factor to cause the\ndeviation from unity in (6.5) is g4 (φ), namely, the coefficient of the coupling ∂μ φ∂ μ σ. This observation also implies\nthat it is difficult to change the sound velocity without affecting background evolution in generic single field inflation\nmodels since, in such models, all the higher order couplings contribute to both time and space derivatives of the\ninflaton perturbation and hence the deviation in the sound speed is related to a form of a background equation of\nmotion.\nTo be consistent with the assumption that the background value of the curvaton keeps constant, the condition\n1 dσ\nσ̇\n=\n≪1\nHσ\nσ dN\n\n(6.6)\n\nshould be satisfied, where N stands for the number of e-folds and an over dot denotes differentiation with respect to\nthe physical time. The background equation of motion for σ is\n\nwhere α ≡ Ḟ /HF . Imposing\n\n1 d2 σ\nσ dN 2\n\n\u0010 m \u00112\nd2 σ\ndσ\nσ = 0,\n+\n(3\n−\nǫ\n+\n2α)\n+\ndN 2\ndN\nHF\n\n(6.7)\n\n≪ 1, this equation tells\n\u0010 m \u00112\ndσ\n1\nσ.\n≃−\ndN\n3 − ǫ + 2α HF\n\nThus the condition (6.6) is satisfied if m/H ≪ F .\nAs for the curvaton perturbation, the second order Lagrangian can be written as\n\u0014\n\u0015\n√\n1 2\nm2 a 2 2\n2 2 1 ′2\n2\n−gL(2)\n=\na\nF\n.\nσ\nσ\n−\nc\n(∇σ)\n−\nσ\n2\n2 s\n2F 2\n\n(6.8)\n\n(6.9)\n\nIntroducing the new variable vσ ≡ zσ σ where zσ ≡ aF which corresponds to v for the inflaton scenario in the main\ntext, (6.9) can be rewritten as\n\u0013\n\u0012 2 2\n√\nzσ′′\n1 ′2 1 2\nm a\n2\n(2)\nvσ2 .\n(6.10)\n−\n−gLσ = vσ − cs (∇vσ ) −\n2\n2\n2F 2\nzσ\n\n\f13\nNow we can derive the evolution equation for the curvaton perturbation in Fourier space as\n\u0013\n\u0012\nzσ′′\nm2 a 2\n′′\n2 2\nvσk = 0.\n−\nvσk + cs k +\n2F 2\nzσ\n\n(6.11)\n\nImposing the above-derived condition m/H ≪ F , we can neglect the mass term in this equation during slow-roll\ninflation. On the other hand, the second derivative of zσ can be evalutated as\n\u0015\n\u0014\nzσ′′\ndα\n2\n.\n(6.12)\n= (aH) (1 + α)(2 − ǫ + α) +\nzσ\ndN\nIf we want to change the value of sound velocity without affecting the background evolution, F (φ) should be fixed.\nThis is achieved when f (φ) = 1 and g3 (φ) = −g4 (φ) = g(φ). In this case, c2s = 1 + g(φ)Xφ + * * * and we can\nchange only cs by choosing g(φ) as an appropriate form with F = 1. Actually, now that zσ′′ /zσ = (aH)2 (2 − ǫ), the\ntechniques to calculate the power spectrum introduced in the main text can be easily applied without introducing the\nnew perturbation variable uk which is no longer convinient to use.\n\n[1]\n[2]\n[3]\n[4]\n[5]\n[6]\n[7]\n[8]\n[9]\n[10]\n[11]\n[12]\n[13]\n[14]\n[15]\n[16]\n[17]\n[18]\n[19]\n[20]\n[21]\n[22]\n[23]\n[24]\n[25]\n[26]\n[27]\n[28]\n[29]\n[30]\n[31]\n[32]\n[33]\n[34]\n[35]\n[36]\n[37]\n[38]\n[39]\n[40]\n[41]\n[42]\n[43]\n\nA. H. Guth, Phys. Rev. D 23 (1981) 347.\nA. A. Starobinsky, Phys. Lett. B 91 (1980) 99.\nK. Sato, Mon. Not. Roy. Astron. Soc. 195 (1981) 467.\nV. F. Mukhanov and G. V. Chibisov, JETP Lett. 33 (1981) 532 [Pisma Zh. Eksp. Teor. Fiz. 33 (1981) 549].\nS. W. Hawking, Phys. Lett. B 115 (1982) 295.\nA. A. Starobinsky, Phys. Lett. B 117 (1982) 175.\nA. H. Guth and S. Y. Pi, Phys. Rev. Lett. 49 (1982) 1110.\nE. Komatsu et al., arXiv:1001.4538 [astro-ph.CO].\nJ. M. Cline, P. Crotty and J. Lesgourgues, JCAP 0309 (2003) 010 [arXiv:astro-ph/0304558].\nM. Matsumiya, M. Sasaki and J. Yokoyama, Phys. Rev. D 65, 083007 (2002) [arXiv:astro-ph/0111549].\nM. Matsumiya, M. Sasaki and J. Yokoyama, JCAP 0302, 003 (2003) [arXiv:astro-ph/0210365].\nN. Kogo, M. Matsumiya, M. Sasaki and J. Yokoyama, Astrophys. J. 607, 32 (2004) [arXiv:astro-ph/0309662].\nN. Kogo, M. Sasaki and J. Yokoyama, Phys. Rev. D 70, 103001 (2004) [arXiv:astro-ph/0409052].\nN. Kogo, M. Sasaki and J. Yokoyama, Prog. Theor. Phys. 114, 555 (2005) [arXiv:astro-ph/0504471].\nD. Tocchini-Valentini, M. Douspis and J. Silk, Mon. Not. Roy. Astron. Soc. 359, 31 (2005) [arXiv:astro-ph/0402583].\nD. Tocchini-Valentini, Y. Hoffman and J. Silk, Mon. Not. Roy. Astron. Soc. 367, 1095 (2006) [arXiv:astro-ph/0509478].\nR. Nagata and J. Yokoyama, Phys. Rev. D 78, 123002 (2008) [arXiv:0809.4537 [astro-ph]].\nR. Nagata and J. Yokoyama, Phys. Rev. D 79, 043010 (2009) [arXiv:0812.4585 [astro-ph]].\nR. Nagata and J. Yokoyama, Mod. Phys. Lett. A 23, 1478 (2008).\nK. Ichiki and R. Nagata, Phys. Rev. D 80, 083002 (2009).\nK. Ichiki, R. Nagata and J. Yokoyama, Phys. Rev. D 81, 083010 (2010) [arXiv:0911.5108 [astro-ph.CO]].\nJ. Martin and R. H. Brandenberger, Phys. Rev. D 63, 123501 (2001) [arXiv:hep-th/0005209].\nJ. Martin and R. H. Brandenberger, arXiv:astro-ph/0012031.\nR. Easther, B. R. Greene, W. H. Kinney and G. Shiu, Phys. Rev. D 66, 023518 (2002) [arXiv:hep-th/0204129].\nA. E. Romano and M. Sasaki, Phys. Rev. D 78 (2008) 103522 [arXiv:0809.5142 [gr-qc]].\nN. Barnaby, Z. Huang, L. Kofman and D. Pogosyan, Phys. Rev. D 80 (2009) 043501 [arXiv:0902.0615 [hep-th]].\nN. Barnaby and Z. Huang, Phys. Rev. D 80 (2009) 126018 [arXiv:0909.0751 [astro-ph.CO]].\nS. M. Leach and A. R. Liddle, Phys. Rev. D 63 (2001) 043508 [arXiv:astro-ph/0010082].\nS. M. Leach, M. Sasaki, D. Wands and A. R. Liddle, Phys. Rev. D 64 (2001) 023512 [arXiv:astro-ph/0101406].\nJ. A. Adams, B. Cresswell and R. Easther, Phys. Rev. D 64 (2001) 123514 [arXiv:astro-ph/0102236].\nA. A. Starobinsky, JETP Lett. 55, 489 (1992) [Pisma Zh. Eksp. Teor. Fiz. 55, 477 (1992)].\nN. Kaloper and M. Kaplinghat, Phys. Rev. D 68 (2003) 123522 [arXiv:hep-th/0307016].\nM. Joy, V. Sahni and A. A. Starobinsky, Phys. Rev. D 77 (2008) 023514 [arXiv:0711.1585 [astro-ph]].\nM. Joy, A. Shafieloo, V. Sahni and A. A. Starobinsky, JCAP 0906 (2009) 028 [arXiv:0807.3334 [astro-ph]].\nD. Battefeld, T. Battefeld, H. Firouzjahi and N. Khosravi, JCAP 1007 (2010) 009 [arXiv:1004.1417 [hep-th]].\nY. F. Cai and X. Zhang, JCAP 0906 (2009) 003 [arXiv:0808.2551 [astro-ph]].\nM. G. Jackson and K. Schalm, arXiv:1007.0185 [hep-th].\nJ. Garriga and V. F. Mukhanov, Phys. Lett. B 458 (1999) 219 [arXiv:hep-th/9904176].\nC. Armendariz-Picon, T. Damour and V. F. Mukhanov, Phys. Lett. B 458 (1999) 209 [arXiv:hep-th/9904075].\nE. Silverstein and D. Tong, Phys. Rev. D 70 (2004) 103505 [arXiv:hep-th/0310221].\nH. Wei, R. G. Cai and A. Wang, Phys. Lett. B 603 (2004) 95 [arXiv:hep-th/0409130].\nW. H. Kinney and K. Tzirakis, Phys. Rev. D 77 (2008) 103517 [arXiv:0712.2043 [astro-ph]].\nJ. Khoury and F. Piazza, JCAP 0907 (2009) 026 [arXiv:0811.3633 [hep-th]].\n\n\f14\n[44]\n[45]\n[46]\n[47]\n[48]\n[49]\n[50]\n[51]\n[52]\n[53]\n\nV. F. Mukhanov, JETP Lett. 41 (1985) 493 [Pisma Zh. Eksp. Teor. Fiz. 41 (1985) 402].\nV. F. Mukhanov, Sov. Phys. JETP 67 (1988) 1297 [Zh. Eksp. Teor. Fiz. 94N7 (1988) 1].\nM. Sasaki, Prog. Theor. Phys. 76 (1986) 1036.\nV. F. Mukhanov, \"Physical Foundations of Cosmology,\" Cambridge University Press (2005)\nB. R. Greene, K. Schalm, G. Shiu and J. P. van der Schaar, JCAP 0502 (2005) 001 [arXiv:hep-th/0411217].\nR. Easther, W. H. Kinney and H. Peiris, JCAP 0508 (2005) 001 [arXiv:astro-ph/0505426].\nD. Larson et al., arXiv:1001.4635 [astro-ph.CO].\nH. Akaike, IEEE Trans. Trans. Auto. Control 19, 716 (1974)\nT. Moroi and T. Takahashi, Phys. Lett. B 522, 215 (2001) [Erratum-ibid. B 539, 303 (2002)] [arXiv:hep-ph/0110096].\nD. H. Lyth and D. Wands, Phys. Lett. B 524, 5 (2002) [arXiv:hep-ph/0110002].\n\n\f"}