{"id": "http://arxiv.org/abs/1106.4313v2", "guidislink": true, "updated": "2011-06-23T19:27:00Z", "updated_parsed": [2011, 6, 23, 19, 27, 0, 3, 174, 0], "published": "2011-06-21T20:00:11Z", "published_parsed": [2011, 6, 21, 20, 0, 11, 1, 172, 0], "title": "An Improved Forecast of Patchy Reionization Reconstruction with CMB", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1106.4155%2C1106.3767%2C1106.1384%2C1106.1760%2C1106.0080%2C1106.2697%2C1106.0792%2C1106.3702%2C1106.2926%2C1106.2063%2C1106.4323%2C1106.0052%2C1106.0497%2C1106.3117%2C1106.5594%2C1106.3396%2C1106.2803%2C1106.4591%2C1106.0812%2C1106.2902%2C1106.1998%2C1106.2810%2C1106.1718%2C1106.2598%2C1106.1603%2C1106.5966%2C1106.1748%2C1106.4650%2C1106.3555%2C1106.4305%2C1106.5588%2C1106.2447%2C1106.3612%2C1106.0244%2C1106.1316%2C1106.0161%2C1106.4220%2C1106.2247%2C1106.2513%2C1106.3868%2C1106.5512%2C1106.2491%2C1106.1625%2C1106.4511%2C1106.1254%2C1106.1653%2C1106.3004%2C1106.0913%2C1106.5911%2C1106.2355%2C1106.2058%2C1106.0798%2C1106.4082%2C1106.4856%2C1106.4380%2C1106.0160%2C1106.0346%2C1106.4913%2C1106.2923%2C1106.1012%2C1106.2953%2C1106.0019%2C1106.1805%2C1106.0108%2C1106.1040%2C1106.4854%2C1106.3744%2C1106.3837%2C1106.2192%2C1106.0621%2C1106.5217%2C1106.1150%2C1106.2232%2C1106.4783%2C1106.3058%2C1106.4313%2C1106.5446%2C1106.1916%2C1106.1198%2C1106.2067%2C1106.2988%2C1106.6256%2C1106.0082%2C1106.5880%2C1106.6172%2C1106.5361%2C1106.5160%2C1106.1078%2C1106.6114%2C1106.5493%2C1106.5821%2C1106.2139%2C1106.2594%2C1106.3606%2C1106.5123%2C1106.5304%2C1106.4528%2C1106.1803%2C1106.2007%2C1106.4829%2C1106.0969&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "An Improved Forecast of Patchy Reionization Reconstruction with CMB"}, "summary": "Inhomogeneous reionization gives rise to angular fluctuations in the Cosmic\nMicrowave Background (CMB) optical depth tau(n) to the last scattering surface,\ncorrelating different spherical harmonic modes and imprinting characteristic\nnon-Gaussianity on CMB maps. Recently the minimum variance quadratic estimator\nhas been derived using this mode-coupling signal, and found that the optical\ndepth fluctuations could be detected with (S/N)^2 ~ 100 in futuristic\nexperiments like CMBPol. We first demonstrate that the non-Gaussian signal from\ngravitational lensing of CMB is the dominant source of contamination for\nreconstructing inhomogeneous reionization signals, even with 98% of its\ncontribution removed by delensing. We then construct unbiased estimators that\nsimultaneously reconstruct inhomogeneous reionization signals tau(n) and\ngravitational lensing potential phi(n). We apply our new unbiased estimators to\nfuture CMB experiment to assess the detectability of inhomogeneous reionization\nsignals. With more physically motivated simulations of inhomogenuous\nreionizations that predict an order of magnitude smaller optical depth power\nspectrum than previous studies, we show that a CMBPol-like experiment could\nachieve a marginal detection of inhomogeneous reionization,(S/N)^2 ~ O(1) with\nthis quadratic estimator to ~O(10) with the analogous maximum likelihood\nestimator.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1106.4155%2C1106.3767%2C1106.1384%2C1106.1760%2C1106.0080%2C1106.2697%2C1106.0792%2C1106.3702%2C1106.2926%2C1106.2063%2C1106.4323%2C1106.0052%2C1106.0497%2C1106.3117%2C1106.5594%2C1106.3396%2C1106.2803%2C1106.4591%2C1106.0812%2C1106.2902%2C1106.1998%2C1106.2810%2C1106.1718%2C1106.2598%2C1106.1603%2C1106.5966%2C1106.1748%2C1106.4650%2C1106.3555%2C1106.4305%2C1106.5588%2C1106.2447%2C1106.3612%2C1106.0244%2C1106.1316%2C1106.0161%2C1106.4220%2C1106.2247%2C1106.2513%2C1106.3868%2C1106.5512%2C1106.2491%2C1106.1625%2C1106.4511%2C1106.1254%2C1106.1653%2C1106.3004%2C1106.0913%2C1106.5911%2C1106.2355%2C1106.2058%2C1106.0798%2C1106.4082%2C1106.4856%2C1106.4380%2C1106.0160%2C1106.0346%2C1106.4913%2C1106.2923%2C1106.1012%2C1106.2953%2C1106.0019%2C1106.1805%2C1106.0108%2C1106.1040%2C1106.4854%2C1106.3744%2C1106.3837%2C1106.2192%2C1106.0621%2C1106.5217%2C1106.1150%2C1106.2232%2C1106.4783%2C1106.3058%2C1106.4313%2C1106.5446%2C1106.1916%2C1106.1198%2C1106.2067%2C1106.2988%2C1106.6256%2C1106.0082%2C1106.5880%2C1106.6172%2C1106.5361%2C1106.5160%2C1106.1078%2C1106.6114%2C1106.5493%2C1106.5821%2C1106.2139%2C1106.2594%2C1106.3606%2C1106.5123%2C1106.5304%2C1106.4528%2C1106.1803%2C1106.2007%2C1106.4829%2C1106.0969&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Inhomogeneous reionization gives rise to angular fluctuations in the Cosmic\nMicrowave Background (CMB) optical depth tau(n) to the last scattering surface,\ncorrelating different spherical harmonic modes and imprinting characteristic\nnon-Gaussianity on CMB maps. Recently the minimum variance quadratic estimator\nhas been derived using this mode-coupling signal, and found that the optical\ndepth fluctuations could be detected with (S/N)^2 ~ 100 in futuristic\nexperiments like CMBPol. We first demonstrate that the non-Gaussian signal from\ngravitational lensing of CMB is the dominant source of contamination for\nreconstructing inhomogeneous reionization signals, even with 98% of its\ncontribution removed by delensing. We then construct unbiased estimators that\nsimultaneously reconstruct inhomogeneous reionization signals tau(n) and\ngravitational lensing potential phi(n). We apply our new unbiased estimators to\nfuture CMB experiment to assess the detectability of inhomogeneous reionization\nsignals. With more physically motivated simulations of inhomogenuous\nreionizations that predict an order of magnitude smaller optical depth power\nspectrum than previous studies, we show that a CMBPol-like experiment could\nachieve a marginal detection of inhomogeneous reionization,(S/N)^2 ~ O(1) with\nthis quadratic estimator to ~O(10) with the analogous maximum likelihood\nestimator."}, "authors": ["Meng Su", "Amit P. S. Yadav", "Matthew McQuinn", "Jaiyul Yoo", "Matias Zaldarriaga"], "author_detail": {"name": "Matias Zaldarriaga"}, "author": "Matias Zaldarriaga", "arxiv_comment": "12 pages, 5 figures", "links": [{"href": "http://arxiv.org/abs/1106.4313v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1106.4313v2", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "astro-ph.CO", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph.CO", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1106.4313v2", "affiliation": "Institute for Advanced Study", "arxiv_url": "http://arxiv.org/abs/1106.4313v2", "journal_reference": null, "doi": null, "fulltext": "An Improved Forecast of Patchy Reionization Reconstruction with CMB\nMeng Su1 ,∗ Amit P.S. Yadav2 , Matthew McQuinn3 , Jaiyul Yoo4,5 , and Matias Zaldarriaga2\n1\n\narXiv:1106.4313v2 [astro-ph.CO] 23 Jun 2011\n\n2\n\nInstitute for Theory and Computation, Harvard-Smithsonian Center for Astrophysics,\n60 Garden Street, MS-10, Cambridge, MA 02138\nSchool of Natural Sciences, Institute for Advanced Study, Einstein Drive, Princeton, NJ 08540\n3\nDepartment of Astronomy, University of California, Berkeley, CA 94720\n4\nInstitute for Theoretical Physics, University of Zurich,\nWinterthurerstrasse 190, CH-8057 Zurich, Switzerland and\n5\nLawrence Berkeley National Laboratory, University of California, Berkeley, CA 94720\n\nInhomogeneous reionization gives rise to angular fluctuations in the Cosmic Microwave Background (CMB) optical depth τ (n̂) to the last scattering surface, correlating different spherical harmonic modes and imprinting characteristic non-Gaussianity on CMB maps. Recently the minimum\nvariance quadratic estimator τ̂ (n̂) has been derived using this mode-coupling signal, and found that\nthe optical depth fluctuations could be detected with (S/N )2 ∼ 100 in futuristic experiments like\nCMBPol. We first demonstrate that the non-Gaussian signal from gravitational lensing of CMB\nis the dominant source of contamination for reconstructing inhomogeneous reionization signals,\neven with 98% of its contribution removed by delensing. We then construct unbiased estimators\nthat simultaneously reconstruct inhomogeneous reionization signals τ (n̂) and gravitational lensing\npotential φ(n̂). We apply our new unbiased estimators to future CMB experiment to assess the\ndetectability of inhomogeneous reionization signals. With more physically motivated simulations of\ninhomogenuous reionizations that predict an order of magnitude smaller Clτ τ than previous studies, we show that a CMBPol-like experiment could achieve a marginal detection of inhomogeneous\nreionization, (S/N )2 ∼ O(1) with this quadratic estimator to ∼ O(10) with the analogous maximum\nlikelihood estimator.\nPACS numbers:\n\nI.\n\nINTRODUCTION\n\nReionization marks the time in which the vast majority of the hydrogen in the Universe was ionized. When\nand how this process occurred is at present poorly constrained. Current data show that it must have ended\nby z ≈ 6 because at lower redshifts there was significant\ntransmission in the Lyα forest [1]. In addition, the largescale polarization anisotropies in the cosmic microwave\nbackground (CMB) constrain the mean redshift of reionization to have been z = 10.6 ± 1.2 [2].\nIt is believed that the first galaxies in the Universe produced the ionizing photons that ultimately ionized the intergalactic gas (e.g. [3]). The morphology of reionization\nand its duration depended on the nature, abundance, and\nclustering of the ionizing sources [4, 5]. There are several\nestablished ideas for how to better constrain the morphology and the redshifts over which it occurred. These\ninclude detecting the reionization-induced suppression\nand spatial modulation in the statistics of high-redshift\nLyman-α emitting galaxies [6–8], studying H I Lymanα damping wing absorption from the neutral gas during reionization in the afterglow spectra of high-redshift\ngamma ray bursts [6, 9, 10], and directly observing 21 cm\nemission from z > 6 neutral hydrogen in the intergalactic\nmedium (e.g., Furlanetto et al. [11]). This study concentrates on using a new technique, first proposed in Dvorkin\n\n∗ Electronic\n\naddress: mengsu@cfa.harvard.edu\n\nand Smith [12], that exploits the non-Gaussianities in the\nCMB sourced by reionization to study this process.\nInhomogeneous reionization produces several secondary anisotropies in the CMB. First, extra temperature (and, to a lesser extent, polarization) anisotropies\nare generated from peculiar motion of ionized regions\nduring the entire reionization process [13–19]. These\nanisotropies are termed the kinetic Sunyaev-Zeldovich\neffect. Second, ionized bubbles scatter the local CMB\ntemperature quadrupole, generating fluctuations in the\npolarization at large scales [15, 20]. Finally, the patchy\nnature of reionization would have resulted in the Thomson scattering optical depth to recombination, τ (n̂), depending on direction [15, 16, 21–23]. Such optical depth\nfluctuations act as a modulation effect on CMB fields by\nsuppressing the primordial anisotropies with a factor of\ne−τ (n̂) , correlating different spherical harmonics. Information contained in τ (n̂) fluctuations could potentially\nprobe the duration of hydrogen reionization and the size\nof the ionized regions.\nIt is well known that gravitational lensing also imprints\na non-Gaussian signature on the CMB. Minimum variance quadratic estimator has been introduced by using\nthe coupled modes to reconstruct the projected lensing\npotential [24–27]. Recently, Dvorkin and Smith [12] followed similar technique and derived the minimum variance quadratic estimator for τ (n̂). Utilizing a toy model\nfor reionization, they estimated that the patchy reionization signal could be detected with (S/N )2 ∼ 100 for\na CMBPol-like experiment, with beam full-width halfmaximum (FWHM) of ΘFWHM = 4′ , and noise sensitiv-\n\n\f2\nTABLE I: Description of various reionization models. Distances are in comoving units.\nA\nB\nC\nD\n\nζ7 dζ/dz lmfp (Mpc)\n10\n0\n∞\n10 18\n∞\n30\n0\n10\n20 16\n10\n\nτ Lbox (Mpc)\n0.063\n200\n0.112\n200\n0.090\n200\n0.115\n200\n\nNg\n256\n256\n256\n256\n\nity ∆T = 1μk-arcmin. In this paper, we quantify the\nimpact of lensing induced non-Gaussianities on the reconstruction of τ (n̂). We show that lensing biases the\nreconstruction of τ (n̂), and as a solution we construct an\nunbiased estimator for τ (n̂) in the presence of lensing.\nThe structure of this paper is as follows. Section II\nprovides simple estimates for the size of τ (n̂) fluctuations, and it describes the cosmological reionization calculations used here to produce τ (n̂) maps. Section III derives the minimum variance quadratic estimator for τ̂ (n̂)\nin the flat sky approximation, and it quantifies the effect\non lensing on the estimator. In section VI, we summarize\nour results and discuss the implications. In Appendix B,\nwe describe in more detail our simulations to reconstruct\nτ (n̂) in the presence of lensing.\nII.\n\nINHOMOGENEOUS REIONIZATION\n\nPatchy reionization produced a line-of-sight dependent\noptical depth that can be written as\nZ\na dz\nτ (n̂) = c\nσT n̄e (z) [1 + δb (n̂, z) + δx (n̂, z)] , (1)\nH(z)\nwhere σT is the Thompson scattering optical depth, n̄e (z)\nis the average free-electron proper number density, and\nδb and δx are the over-densities in baryons and in the\nionized fraction, xi .\nThe angular power spectrum Clτ τ in the flat sky approximation can be related to the 3D ionization and density field using the Limber approximation:\n\u0014\nZ\ndη 2 2\nl\n2\nClτ τ =\nPxx (z, )\na\nσ\nn̄\n(z)\ne\nT\n2\nη\nη\n\u0015\nl\nl\n(2)\n+ 2 Pxδ (z, ) + Pδδ (z, ) ,\nη\nη\nwhere η is the conformal distance from the observer, and\nPXY is the cross power spectrum of the over-density in\nX with the overdensity in Y . This power spectrum is\nweighted heavily to the highest redshifts where there was\nreionized gas. The kinetic Sunyaev-Zeldovich effect (kSZ)\nsignal from reionization is predicted to be comparable\nto the kSZ signal after reionization. However, the kSZ\nweights by an additional v 2 factor which goes roughly as\nthe scale factor, result in its kernel peaking at lower redshifts [15]. This results in a large fraction of the kSZ coming from after reionization, we can safely neglect the low\n\nredshift part, whereas we expect most of Clτ τ to originate\nfrom during reionization. It is also clear from equation\n(2) that Clτ τ from reionization increases approximately\nlinearly with the duration of reionization for fixed mean\nredshift of reionization.\nIt is likely that reionization occurred in a patchy manner, with some regions being ionized early on in this process and others remaining neutral until the end, and with\nlittle gas at intermediate ionization states. This patchiness likely resulted in the ionization fluctuations dominating over other sources of fluctuation (i.e., Pxx ≫ Pδδ\non arcmin and larger scales [4]). Even without any knowledge of Pxx other than that reionization was patchy, there\nis an integral constraint\nClτ τ because if the ionization\nR on\n2\nfield is zeros and ones k dk/(2π 2 ) Pxx = x−1\ni − 1, where\nxi is the ionized fraction. Thus, fixing the Rreionization\nhistory and in the Limber approximation, l2 dl Clτ τ is\njust a single number independent of morphology. This\nconstraint shows that the larger the H II regions during\nreionization, the larger the fluctuations in τ (n̂)1 .\nTo estimate Clτ τ , we compute Monte-Carlo realizations\nof reionization in two hundred comoving Mpc data cubes\nusing the method developed in [28] for assigning the\nionization state to boxes with realizations of the lineartheory cosmological density field. This method is based\non the semi-analytic model for reionization in [4]. The\ndistribution of ionized gas found in the [28] method is in\nexcellent agreement with the results of detailed numerical simulations of reionization [28, 29]. Thus, we expect\nthat the τ field from this simulation will be more realistic\nthan the analytic model used in the original study of [12].\nTheir model assumed a lognormal distribution of bubbles\nwith a distribution that was independent of ionized fraction. In our calculations, the morphology of the bubbles\nis complicated and their sizes increase dramatically as xi\nincreases.\nThe method in [28] that we employ posits that the\nnumber of galaxies within a region sets its ionization\nstate. Namely, a region is ionized if 1 > ζ f , where ζ\nis a factor that encodes the efficiency that galaxies can\nionize their surroundings, and f is the total fraction that\nhas collapsed into halos with mass > m min , where mmin\nis the minimum halo mass of the sources during reionization. A point in space is marked as ionized if this\ncriterion is met for any smoothing scale centered around\nit (where the smoothing is done with a tophat in Fourier\nspace filter).\nCalculating f in detail requires high-resolution N -body\nsimulations to resolve ∼ 108 M⊙ halos – the smallest halos that were expected to form multiple generations of\nstars –, while still capturing scales much larger than the\n10 comoving Mpc bubbles. Fortunately, extended Press-\n\n1\n\nSince l3 Cl ∼ const., if the peak in the bubble scale is at smaller\nl (i.e. larger bubbles), as l2 Cl ∼ l−1 , larger bubbles result in a\nhigher peak (but at lower l i.e. larger fluctuations).\n\n\f3\nthe duration of reionization while the later parameter\nprimarily affects its morphology [5, 32].\nIn particular, bubbles that are larger than mean free\npath of ionizing photons have most of the photons produced within them absorbed by dense systems within the\nbubble rather than by diffuse gas at the bubble edge, preventing further growth [5, 32]. Thus, the parameter lmfp\nis implemented by setting the maximum smoothing scale\nused to be lmfp . We generate Monte-Carlo maps for 4\ndifferent reionization models, which are described in Table I. All of our models fall within 2σ of the best fit\nWMAP τ measurement of τ = 0.088 ± 0.015 [2].\nIn Fig. 1, the top panel shows the optical depth fluctuation power spectrum of the different reionization models\ndescribed in Table I. The corresponding reionization history of the four models are also shown in the bottom\npanel of Fig. 1. Surprisingly, the spectrum of all these\nmodels is not significantly different: All the models scales\nas l2 Clτ τ /2π ≈ constant for 200 . l . 10000. However,\nthe amplitude varies between ∼ 10−6 − 10−7 , owing to\nthe different reionization histories. An amplitude of 10−6\nis still an order of magnitude smaller that the signal considered in the previous work of [12]. It is possible that\nreionization is more extended than in our models. We\nnote that the amplitude of Clτ τ is proportional to the\nduration of reionization.2\n\nIII. STANDARD QUADRATIC ESTIMATOR OF\nPATCHY REIONIZATION FROM THE CMB\nFIG. 1: Upper panel: Optical depth power spectrum from\nthe different reionization models described in Table I. Lower\npanel: Corresponding average reionization history of these\nmodels. The mean optical depth of each model is consistent\nwith the WMAP measurement (τ = 0.088 ± 0.015).\n\nSchechter theory provides a method to calculate f in a\nmacroscopic region of size R and overdensity δR in the\nsimulations from just the linear density field [30, 31].\nTherefore, we can quickly compute the ionization field\nfrom the linear density field and rather course resolution\nusing just Fast Fourier Transforms. Our calculations take\njust minutes on a single CPU for the 2563 grids used here.\nThere is significant uncertainty in the properties of the\nfirst sources and sinks that were responsible for reionization. All of our models assume that the ionizing luminosity is proportional to the collapsed mass in halos\nabove 108 M⊙ (approximately the minimum mass threshold where the gas can cool by atomic transitions and\nform dense structures). To explore the allowed parameter space of this process, we model reionization with 3\nparameters: the ionizing efficiency of a halo ζ7 at z = 7,\nits derivative with redshift dζ/dz (assumed to be independent of z), and the mean free path of ionizing photons\nto be absorbed by an over-dense sink lmfp within an ionized region. The first two parameters primarily affect\n\nThe observed CMB temperature and polarization\nStokes parameters in the presence of inhomogeneous\nscreening caused by patchy ionizated regions are\nT (n̂) = e−δτ (n̂) T̃ (n̂) ,\n(Q ± iU )(n̂) = e−δτ (n̂) (Q̃ ± iŨ )(n̂) ,\n\n(3)\n\nwhere tildes signify the CMB Stokes parameters for a uniform reionization history with constant factor e−τ spatially modulating the observed CMB fields. We take τ\nas the mean of optical depth and δτ (n̂) as the line of\nsight dependent optical depth fluctuation field. We work\n\n2\n\nRecently it was shown that the velocity difference between the\nbaryons and dark matter that is imparted up until recombination and decays away thereafter, can suppress the formation and\nbaryonic accretion of the . 106 M⊙ halos that harbor the first\nstars [33, 34]. The standard paradigm is that these halos did not\ncontribute significantly to reionization [11], but they may have\nionized the intergalactic medium fractionally. Different regions\nin the Universe have different velocity offsets, with the coherence\nlength of this difference being hundreds of Mpc. Even if these\nfirst stars just fractionally ionized the Universe, this large-scale\nmodulation of the velocity difference could lead to larger fluctuations in τ (n̂) (and peaking at l ∼ 100) than in the models we have\nconsidered. Thus, we point out that there remains the possibility\nof generating a larger signal than in the models considered here.\n\n\f4\n\nTABLE II: Minimum variance filters for optical depth estimator τ̂ (n̂) and lensing potential estimator φ̂(n̂)\nXX ′\n\nτ\nfXX\n′ (l1 , l2 )\n\nlens\nfXX\n′ (l1 , l2 )\n\nTT\n\nClT1T + ClT2T\n\nClT1T (l * l1 ) + ClT2T (l * l2 )\n\nTE\n\nC̃lT1E cos 2(φl1 − φl2 ) + ClT2E\n\nC̃lT1E (l * l1 ) cos 2(φl1 − φl2 ) + ClT2E (l * l2 )\n\nTB\n\nC̃lT1E sin 2(φl1 − φl2 )\n\nC̃lT1E (l * l1 ) sin 2(φl1 − φl2 )\n\n+ C̃lEE\n(l * l1 ) + C̃lEE\n] cos 2(φl1 − φl2 ) [C̃lEE\n(l * l2 )] cos 2(φl1 − φl2 )\nEE [C̃lEE\n1\n1\n2\n2\n− C̃lBB\n] sin 2(φl1 − φl2 ) [C̃lEE\n(l * l1 ) − C̃lBB\n(l * l2 )] sin 2(φl1 − φl2 )\nEB [C̃lEE\n1\n2\n1\n2\n+ C̃lBB\n(l * l1 ) + C̃lBB\n] cos 2(φl1 − φl2 ) [C̃lBB\n(l * l2 )] cos 2(φl1 − φl2 )\nBB [C̃lBB\n1\n1\n2\n2\n\nin the flat-sky limit where scalar fields such as the CMB\ntemperature T and a complex field (S1 ± iS2 )(n̂) of spin\n±s can be expanded in the Fourier basis as\nZ\n\ndn̂ T (n̂)e−il*n̂ ,\n(4)\nZ\n[S1 ± iS2 ] (l) = (±1)s dn̂ [S1 (n̂) ± iS2 (n̂)]e∓siφl e−il*n̂ ,\nT (l) =\n\nwhere φl = cos−1 (n̂ * l̂). The complex field (Q ± iU )(n̂)\nis a spin ±2 field, whose Fourier harmonics are referred\nas (E ± iB)(l).\nSince the differential optical depth fluctuation is already constrained to be small, we work out the effects\nto first order in δτ (n̂). We use τ (n̂) rather than δτ (n̂)\nto specify the fluctuations of optical depth for short. It\nis simple to show that patchy reionization induces modulations in observed CMB fields that is proportional to\nτ (n̂) to the first order. The effect of such a modulation is\nto correlate different CMB modes in Fourier space. The\ncorrelations can be compactly written as\nτ\nhX(l1 )X ′ (l2 )iCMB = fXX\n′ (l1 , l2 ) τ (l) ,\n\n(5)\n\nτ\n′\nwhere X, X ′ = T, E, B, l = l1 + l2 , fXX\n′ (l, l ) is given in\nTable II, and h...iCMB signifies an ensemble average over\nCMB realizations with fixed τ (n̂) field.\nThe presence of τ (n̂) field breaks the rotational symmetry of the CMB field, correlating different modes\nwhich are not correlated assuming a Gaussian CMB\nfield. Following [24], we construct a minimum variance\nquadratic estimator τ̂XX ′ (n̂) for τ (n̂) field, or τ̂XX ′ (l) for\nτ (l) in Fourier space.\n\nτ̂XX ′ (l) = NXX ′ (l)\n\nZ\n\n\u0003 τ\nd2 l1 \u0002\nX(l1 )X ′ (l2 ) FXX\n′ (l1 , l2 ) ,\n2\n(2π)\n\nwhere l = l2 + l1 and\nNXX ′ (l) =\n\n\"Z\n\n#−1\nd2 l1 τ\nτ\nf ′ (l1 , l2 )FXX ′ (l1 , l2 )\n. (6)\n(2π)2 XX\n\nWe derive the optimal FXX ′ by minimizing the variance\nof hτ̂XX ′ (l)τ̂XX ′ (l′ )i. For XX ′ = EE, BB, and T T ,\nτ\nFXX\n(l1 , l2 ) =\n\nτ\nfXX\n(l1 , l2 )\n\nClXX,t\n2ClXX,t\n2\n1\n\n.\n\n(7)\n\n,\n\n(8)\n\nFor XX ′ = T B and EB,\nτ\nFXX\n′ (l1 , l2 ) =\n\nτ\nfXX\n′ (l1 , l2 )\n\nClX2\nClXX,t\n1\n\n′ X ′ ,t\n\nwhere\nClXX\n\n′\n\n,t\n\n= C̃lXX + ClXX\n′\n\n′\n\n,n\n\n,\n\n(9)\n\n′\n\nand ClXX ,n is the noise power spectrum. We assume the\ndetector noise is Gaussian and isotropic, to be known a\npriori. Furthermore, we assume a symmetric Gaussian\ninstrumental beam so that the noise power spectrum is\nClXX,n = ∆2X el\n\n2\n\nΘ2fwhm /(8 ln 2)\n\n,\n\n(10)\n\nwhere ∆X is the instrument noise for temperature (X =\nT ) or polarization (X = E, B), and Θfwhm is the fullwidth half-maximum (FWHM) of the Gaussian beam.\nWe\n√ assume a fully polarized detector, for which ∆E,B =\n2 ∆T .\nThe variance of the minimum variance quadratic estimator is\nhτ̃XX ′ (l1 )τ̃XX ′ (l2 )i = (2π)2 δ(l1 + l2 ){Clτ τ + NXX ′ (l)},\n(11)\nwhere NXX ′ (l) gives the dominant contribution to the\nvariance for the EB and T B estimators.\nIV.\n\nLENSING CONTAMINATION IN τ (n̂)\nRECONSTRUCTION\n\nThe optical depth estimators described in the previous\nsection neglect the effect of CMB lensing. In reality, both\nthe CMB temperature and polarization fields are gravitationally lensed by inhomogeneities in the matter distribution between the last scattering surface and z = 0. In\n\n\f5\nInput\n\nReconstructed\n\n-0.005\n\nInput\n\n0\n\nDifference\n\n0.005\n\nDifference\n\nReconstructed\n\n-0.005\n\n0\n\n0.005\n\nFIG. 2: Impact of lensing on the reconstruction of the optical depth fluctuation field τ (n̂). The upper panels assume all the\nmode-coupling of CMB maps are generated by modulations of patchy reionization only. The upper left panel shows the input\nτ (n̂) map used to modulate the CMB fields, the upper middle panel shows the reconstructed τ (n̂) map from the CMB fields\nby applying the quadratic EB estimator, and the upper right panel shows the difference between the input/reconstructed τ (n̂)\nmaps. The lower panels show the same quantities as the upper panels but with the lensing effect on the CMB maps included.\nAs is clear from the lower middle and lower right panels, additional mode-coupling of CMB fields due to lensing contaminates\nthe τ (n̂) reconstruction. In this plot, we consider the lensing signal to be only 2% of the fiducial value (i.e. the deflection\nangle power spectrum used here is Cldd /50) to approximate the residual lensing signal after applying delensing procedure on the\nobserved CMB maps. The reconstructed maps were averaged over 1000 CMB realizations for a fixed optical depth fluctuation\nτ (n̂) field. Each map is 6×6 square degrees.\n\nthis section, we show that lensing significantly bias the\nτ (n̂) reconstruction.\nBoth the τ (n̂) field and the projected lensing potential\nφlen (n̂) can generate non-Gaussianity by mixing modes\nand break the rotational invariance. This effect can be\ndetected statistically by searching for the characteristic\nfour point correlations. If the τ̂ (n̂) estimator derived\nin the previous section were applied to the lensed CMB\nmaps, it would also pick up significant spurious signal\nproduced by lensing.\nWe now quantitatively calculate the lensing bias to\nthe τ̂ (n̂) estimator. Lensing simply deflects the path of\nCMB photons from the last scattering surface resulting in\na remapping of the CMB temperature/polarization pat-\n\ntern on the sky. The deflection angle d(n̂) is related to\nφlen (n̂), the lensing gravitational potential as\nd(n̂) = ∇φlen (n̂) .\nThe lensing potential φlen (n̂) is given by\nZ r0\ndA (r0 − r)\ndr\nφlen (n̂) = −2\nΦ(r, n̂) ,\nd\nA (r)dA (r0 )\n0\n\n(12)\n\n(13)\n\nwhere dA is the co-moving distance along the line of sight;\nr0 is the comoving distance to the surface of last scattering, and Φ is gravitational potential [27].\nSimilar to the effect of screening from patchy reionization, a lensing potential mode with wavevector l mixes\nthe two polarization modes of wavevectors l1 and l2 =\n\n\f6\n10-1\n\nPatchy Signal\nττ\nReconstructed Cl\nBias After Delensing\nBias Before Delensing\n\n10-2\n\nττ\nl2 Cl /(2π)\n\n10-3\n10-4\n\n∆p=0.2 μK-arcmin\nσ=1.0'\n\n-5\n\n10\n\n(-)\n\n-6\n\n10\n\n10-7\n\n(-)\n\n-8\n\n10\n\n102\nAngular multiple l\n\n103\n\nFIG. 3: Comparison of the biased reconstruction of patchy\nreionization power spectrum Ĉlτ τ with the input fiducial\npatchy reionization induced power spectrum Clτ τ . The solid\nred line shows the Clτ τ of the reionization scenario we chose.\nThe dot magenta curve shows the biased estimate for Clτ τ ,\nwhich was calculated using Eq. (15). The lensing bias is negative at low l but positive at high l. The minimum of the bias\nat l ∼ 200 is where the sign changes. The green dashed curve\nis the same quantity extracted from simulations after averaging over 1000 realizations. Our analytic expression matches\nwell with the simulation. The blue short-dashed curve shows\nthe reconstructed Clτ τ after delensing is applied. The delensing was performed using the quadratic minimum variance\nestimator for projected lensing potential.\n\nl − l1 . Taking the ensemble average of the CMB fields for\nthe fixed φ(n̂) field, similar to Eq. (5), one gets\nφ\nlen\nhX̃(l1 )X̃ ′ (l2 )iCMB = fXX\n(l) .\n′ (l1 , l2 )φ\n\n(14)\n\nlen\nfXX\n′ (l)\n′\n\nThe form of filters\nfor different combinations of\nCMB field X and X are given in Table II. The major difference between the filters of lensing potential estimator\nφ̂(n̂) and those for the τ̂ (n̂) estimator is the additional\nfactors of ∼ l2 that appear in those for lensing owing\nto the differential in Eq. (12). This differential nature\nof lensing significantly suppress the level of lensing estilens\nmator noise since l ≫ 1 and NXX\n′ (l) is approximately\n−2\nproportional to l (see Eq. (6)).\nLet us consider a CMB sky that has been modified\nby both inhomogeneous reionization and lensing. Suppose we want to reconstruct τ (n̂) assuming that all of\nthe non-Gaussianity is from patchy reionization, which\nis equivalent to applying the τ̂ (n̂) estimator with filters\ndesigned to optimally reconstruct τ (n̂). In this case, the\nestimator measures\nhτ̂XX ′ (l)iCMB = τ (l)\nZ\nd2 l1 φ\n+ NXX ′ (l)\nf ′ F τ ′ (l1 , l2 )φlen (l) , (15)\n(2π)2 XX XX\n|\n{z\n}\nbias\n\nwhere NXX ′ is given by Eq. (6). The first term on the\nright hand side is the desired signal, and the second term\n\nφ\nis a bias that owes to lensing. Note that fXX\n′ is the\nτ\nlensing filter (see Table II) and FXX ′ (l1 , l2 ) is given by\nEq. (7) and (8).\nWe simulate a patchy reionization induced τ (n̂) field\n(model B in Table I) and modulate the CMB fields by\nthe τ (n̂) field accordingly. We compare the reconstructed\nτ (n̂) with the input field in Fig. 2 (see Appendix B for details of the simulations). The τ̂ (n̂) estimator is unbiased\nif primordial CMB fields were unlensed and only affected\nby patchy reionization. However, in the presence of lensing, the reconstructed τ (n̂) deviates significantly from\nthe fiducial signal. The lensing induced non-Gaussianity\nis rougly an order of magnitude larger than the patchy\nreionization induced non-Gaussianity.\nThe lensing induced non-Gaussianity could be reduced\nby applying lensing estimator φ̂(n̂) to reconstruct the\nlensing potential, and then \"remap\" the observed CMB\nphotons given the reconstructed φ(n̂) and Eq. (12). This\nprocess of subtracting the lensing effect from CMB is referred to as \"delensing\" (see Ref [35] for a review). To\ninvestigate the lensing bias after applying this delensing procedure, we assume the residual lensing potential\npower spectrum is only 2% of the fiducial value. The delensing fraction taken here is smaller than the predicted\ndelensing fraction for future CMB experiment, using lensing maps either externally reconstructed from large scale\nstructure/CMB temperature or from CMB polarization\nitself [36]. We find that even after delensing on the CMB\nmap, the reconstructed τ (n̂) field is still significantly contaminated by the residual lensing signal, as shown in\nFig. 2.\nIn Fig. 3, we show the reconstruction of optical depth\nfluctuation power spectrum Ĉlτ τ , and compare with the\ninput power spectrum Clτ τ . Again we choose Model B\nfor the reionization simulations, which has the highest\nlevel of τ (n̂) fluctuations. We find that the lensing induced spurious signal dominates over the fiducial signal\nby ∼ O(10 − 100), especially for l & 200. The theoretical prediction for the spurious patchy reionization signal\nfrom lensing which is calculated by Eq. (15), matches\nwell with Ĉlτ τ from the simulation. Finally we show that\neven after applying the delensing procedure with lensing\nquadratic estimator [24], the reconstructed Ĉlτ τ is still\nbiased by a factor of ∼ 10. As we show in Fig. 3, the\nlensing induced Clτ τ has two bumps one peak at large\nscale l ∼ 50 and the other peaks at small scale l ∼ 1000.\nIt is caused by the lensing bias given by Eq. (15) is negative at low l and positive at high l with a transition at\nl ≈ 200. This sign change is because the lensing bias\ninvolves the product of the lensing and tau filters [see\nEq. (15)]. The product contains a mode coupling term\nl * l1 which is caused by the derivative nature of lensing\nand gives the negative contribution at low l. Physically,\nthe lensing of CMB does not generate new power in the\nCMB fluctuations, it only move power from large scale\nto small scales [27]. We note that in principle lensing\nreconstruction is also biased by the patchy reionization\ninduced non-Gaussianity, however since lensing signal is\n\n\f7\nmuch larger than the patchy reionization signal, we don't\nexpect a significant comtanimation from patchy reionization to lensing esitmation.\nV.\n\nRECONSTRUCTING PATCHY\nREIONIZATION\nA.\n\nUnbiased Estimator\n\nThis section constructs an unbiased estimator for τ (n̂).\nAs with the quadratic estimator discussed in the previous\nsection, among all the six estimators, the EB estimator\nhas the highest S/N ratio, thus we focus on EB estimator\nin this section. For each multipole l we can define a 2by-2 Fisher matrix Flαβ ,\nZ\nd2 l1 (α)\n(β)\nαβ\n−1 BB\n)l2\nf (l1 , l2 )(C−1 )EE\nFl\n=\nl1 fEB (l1 , l2 )(C\n(2π)2 EB\nwhere α and β run over τ and φ. The element (F (−1) )αβ\nl\nof the inverse of Fisher matrix gives the variance of Clαβ .\nHence the variance of Clτ τ is:\nN (l) ≡\n\n\u0001τ τ\nF−1 l\n\n=\n\nFlφφ\nFlτ τ Flφφ − (Flτ φ )2\n\n.\n\n(16)\n\nThis is the Gaussian noise term of the unbiased τ̂ (n̂)\nestimator, which we will use to calculate (S/N )2 in Fig. 4.\nStarting from biased estimator τ̂ (n̂) and φ̂(n̂) [24], we\nhave\nhτ̂ (l)iCMB = τ (l) +\nhφ̂(l)iCMB = φ(l) +\n\nFlτ φ\nφ(l) ,\nFlτ τ\nFlφτ\nFlφφ\n\nτ (l) .\n\n(17)\n\nOne can then solve above equations for τ (l) and φ(l)\nτ (l) =\n\nFlφφ Flτ τ hτ̂ (l)iCMB − Flτ φ Flφφ hφ̂(l)iCMB\n\n,\n\nφ(l) =\n\nFlφφ Flτ τ hφ̂(l)iCMB − Flτ φ Flτ τ hτ̂ (l)iCMB\n\n.(18)\n\nFlτ τ Flφφ − (Flτ φ )2\n\nFlτ τ Flφφ − (Flτ φ )2\n\nThis estimator although unbiased is not a minimum variance estimator. In next subsection we compare the variance (Gaussian noise) of the minimum variance quadratic\nestimator with the variance of the unbiased estimator and\nshow that there is only a marginal increase in the variance\nof the unbiased estimator in comparison to the variance\nof the minimum-variance estimator.\nMaximum Likelihood Estimator: Given that the Bmode polarization is well mapped, Hirata and Seljak\n[26] found that for lensing reconstruction the maximumlikelihood estimator (which reduces the estimator noise\nfrom lensing) allows significantly better (S/N )2 than the\nquadratic estimator.\n\nFollowing Ref. [26], the lensing maximum-likelihood\nestimator can be generalized to construct a unbiased\nmaximum-likelihood estimator for τ (n̂) in the presence of\nlensing. The variance of the maximum-likelihood estimator for τ (n̂) is the same as that for the quadratic estimator τ̂ (n̂) with one exception- for maximum-likelihood\nestimator the denominator of Eq. (7) and Eq. (8) contains the unlensed CMB power spectrum, whereas the\nquadratic estimator noise contains the lensed CMB power\nspectrum [26]. The estimator noise of τ (n̂) reconstruction would no longer be saturated because of the lensed\nCMB power spectrum. Conceptually, the lensing or\npatchy reionization induced B-modes can be iteratively\ncleaned from the map, therefore we are able to reduce the\npost-cleaning B-mode power spectrum and thus reducing\nthe noise in the τ̂ (n̂) estimator. Our fundamental ability\nto clean the map is bounded by the sum of the unlensed\nCMB B-modes and the instrumental noise.\n\nB.\n\nForecasting the Detectability of Patchy\nReionization\n\nThe signal-to-noise for the detection of patchy reionization signal can be written as\n\u0010 S \u00112\nN\n\n\"\n\nfsky X\nClτ τ\n=\n(2l + 1)\n2\nN (l)\nl\n\n!2 #\n\n,\n\n(19)\n\nwhere fsky is the sky fraction; Clτ τ is the fiducial patchy\nreionization power spectrum, and N (l) is the leading order Gaussian noise of an estimator, given by Eq. (16) for\nthe unbiased quadratic estimator and given by Eq. (6)\nfor the biased minimum variance quadratic estimator.\nIn Fig. 4, dashed-lines (the lower two curves which\nalmost overlap) compare the (S/N )2 of the biased and\nunbiased quadratic estimators. The left panel is for\nthe CMBPol like experiment with with noise ∆T =\n1μk-arcmin and beam FWHM Θfwhm = 4 arcmin. The\nright panel is for the reference experiment with noise\n∆T = 0.2μk-arcmin and beam FWHM Θfwhm = 1 arcmin. As is clear from figure the (S/N )2 of unbiased estimator is only slightly lower than the (S/N )2 of biased\nestimator for both CMBPol like experiment and the reference experiment. In another word, the variance of the unbiased estimator is only marginally more (percent-level)\nthan the variance of the minimum-variance quadratic estimator. The reason for this is easy to understand- the\ncontribution to the variance from the spurious τ (n̂) signal produced by lensing is much smaller than the intrinsic\nτ̂ (n̂) estimator noise.\nIn Fig. 4, dotted-lines (the upper two lines which\nalmost overlap) compare the (S/N )2 of the biased/unbiased maximum-likelihood τ̂ (l) estimators. For\nCMBPol-like experiment, the maximum-likelihood estimator can get (S/N )2 about a factor of 10 higher than\nthe quadratic estimator.\n\n\f8\n\nFIG. 4: The cumulative (S/N )2 for the EB estimator as a function of maximum multipole l. The left panel is for a CMBPollike experiment with a beam of ΘFWHM = 4′ and the noise sensitivity ∆p = 1μK-arcmin. The right panel is a more sensitive\nexperiment with ΘFWHM = 1′ and ∆p = 0.2μK-arcmin. In both panels, we use the optical depth power spectrum Clτ τ of\nmodel B in Fig.1. The green/red dotted curves (lower two curves) which almost overlap are the (S/N )2 of the biased/unbiased\nquadratic estimators, whose noise level is given by Eq. (6) and (16) respectively. The magenta/blue dashed curves (the top two\ncurves that nearly overlap ), are the (S/N )2 of the biased/unbiased maximum-likelihood estimators. The maximum-likelihood\nestimator is calculated from the minimum variance quadratic estimator except with the lensed CMB power spectrum replaced\nby the primary CMB power-spectrum (without the presence of lensing or patchy reionization effects) as suggested in [26].\n\n100\n\n∆p=0.5 μk-arcmin\n∆p=1.0 μk-arcmin\n∆p=1.5 μk-arcmin\n∆p=2.0 μk-arcmin\nLmax=3000\n\n-5\n\n2 ττ\n\nττ\n\n10\n\nfsky(S/N)\n\nfsky(S/N)\n\n2\n\n2\n\n2\n\n10\n\n(L C /3 10 )\n\nBeam FWHM=1'\nBeam FWHM=2'\nBeam FWHM=4'\nBeam FWHM=6'\nLmax=3000\n\n-5\n\n(L C /3 10 )\n\n100\n\n1\n\n0.1\n\n1\n\n0.1\n0 0.5 1 1.5 2 2.5 3 3.5 4 4.5 5\n∆p (μK-arcmin)\n\n0\n\n1\n\n2\n\n3\n\n4\n\n5\n\n6\n\n7\n\n8\n\n9\n\n10\n\nBeam FWHM (arcmin)\n\nFIG. 5: Dependence of the total (S/N )2 on instrumental sensitivity, ∆p , (left panel) and beam size, ΘFWHM (right panel). We\nplot EB unbiased quadratic estimator as an example and calculate cumulative (S/N )2 up to lmax = 3000. Left panel, we fix\nbeam size with 1, 2, 4, and 6 arcmin respectively to calculate the (S/N )2 dependence on instrumental sensitivity. Right panel,\nwe fix ∆p with 0.5, 1.0, 1.5, and 2.0μK-arcmin to show the beam size dependence of (S/N )2 . The approximate fitting functions\nare given in Eq. (20).\n\nIn Fig. 5, we show the total (S/N )2 from the unbiased\nquadratic estimator as a function of instrumental beam\nsize and detector sensitivity respectively. We find that\nthe (S/N ) for a constant l2 Clτ τ /(2π) and for experiment\nwith ∆P > 1μk-arcmin can be approximated as\nS\nN\n\n!2\n\n≈ 5fsky\n× exp\n\n\u0012\n\n\u0012\n\nl2 Clτ τ /2π\n5 × 10−6\n\n\u0013\n\nexp\n\n−0.09ΘFWHM\n1′\n\n\u0013\n\n\u0012\n.\n\n−0.56∆p\n1μK − arcmin\n\n\u0013\n\n(20)\n\nThe (S/N )2 is more sensitive to the instrumental sensitivity rather than the beam size. For a reference\npathcy reionization signal l2 Clτ τ /2π = 5 × 10−6 , for a\nCMBPol-like or COrE-like [37] experiment we expect\n(S/N )2 ∼ O(1). For the future ground-based experiments such as the POLAR Array with ∆p = 1.41μKarcmin, ΘFWHM = 1′ , and sky coverage 100 deg2 , we\nexpect (S/N )2 ∼ O(0.01).\n\n\f9\nVI.\n\nSUMMARY AND DISCUSSION\n\nReionization marks the epoch in which the vast majority of the hydrogen in the Universe was ionized since\ncosmological recombination. When and how reionization\noccurred is at present poorly constrained. In addition to\npinning down the epoch of this cosmic phase transition,\nconstraints on the reionization history provides us information about the formation of early galaxies. Inhomogeneous reionization would have generated fluctuations in\nthe Thomson scattering optical depth τ (n̂) among different lines of sights at the level ∼ 10−3 . These modulations\nwould modify the primordial CMB temperature and polarization anisotropies by inducing a directionally dependent screening. Such screening couples different modes of\nCMB, converting E-modes to B-modes, and introduces\nnon-Gaussian signals.\nIn this paper, we used a technique that exploits the\nnon-Gaussianities in the CMB sourced by reionization\nto study this process, as first proposed in Dvorkin and\nSmith [12]. We have introduced the the minimum variance quadratic estimator in an intuitive flat sky limit\nand compared it with the estimator for lensing potential reconstruction [24]. Lensing induced non-Gaussian\nfeatures would produce a spurious τ (n̂) signal that is\nat least an order of magnitude higher than our semianalytical models predict from patchy reionization. We\nshowed that ignoring the lensing contamination would\nsignificantly bias the reconstruction of optical depth fluctuation field τ (n̂). Even after applying a delensing procedure that used the minimum variance quadratic estimator for the lensing potential φ(n̂), the residual lensing\nbias on the τ̂ (n̂) estimator was still comparable with the\nfiducial value. As a solution, we constructed an unbiased estimator to simultaneously reconstruct τ (n̂) and\nthe lensing potential φ(n̂) such that the estimate of τ (n̂)\nis not biased by lensing. We found that the S/N of the\nunbiased estimator is only degraded at the percent level\ncompared to the original biased τ (n̂) estimator.\nWe studied the detectability of patchy reionization\nby considering more detailed τ (n̂) fields using seminumerical reionization models, which unfortunately yield\nan order-of-magnitude smaller signal than previously\nconsidered [12]. As a result, we found that with the\nunbiased estimator, a CMBPol-like experiment could\nachieve a marginal detection of patchy reionization with\n(S/N )2 ∼ 1 − 10. We characterized the estimator noise\nfor various instrumental properties. We find that the\nS/N is only weakly sensitive to the FWHM of detector\nbeam with a factor of ∼2 degradation of (S/N )2 by increase FWHM from 1′ to 6′ . While the (S/N )2 decreases\nby a factor of ∼2 by increase instrumental noise from 0.5\nto 2 μk-arcmin. Similar scaling with instrumental characteristics have been quantified for lensing reconstruction\nin [24].\nLarge scale CMB fields are also modulated by smaller\nscale τ (n̂) fluctuations due to patchy reionization. As we\nconstruct the τ̂ (n̂) estimator in flat sky limit, we ignore\n\nthe patchy reionization signal from large scale E/B-mode\nwhich is generated via scattering of the local CMB temperature quadrupole by ionized bubbles. The S/N will\nbe increased by a factor of ∼2 by considering such signal\non large scales [12].\nAlthough the predicted S/N for a patchy reionization\ndetection is only marginal for a CMBPol-like experiment,\none can cross-correlate with other cosmological data sets\nthat are sensitive to the properties of patchy reionization.\nThe same population of ionized bubbles would not only\ninduce line of sight dependent optical depth of CMB,\nbut also correlate with the distribution of galaxies or the\nredshifted 21cm signal.\nAt large scales, it is expected that the distribution\nof galaxies correlates well with the neutral gas distribution [28]. One can estimate the (S/N )τ for a patchy\nreionization detection as\n2\nττ 2\n(Cchar\n) /(Clτ̂ τ̂ )2\n(S/N )2τ = lchar\n\n(21)\n\nwhere lchar is the characteristic multipole that contributes to the S/N (lchar ∼ 103 ), and Clτ̂ τ̂ is the τ̂ (n̂)\n2\nis an estiestimator variance. The scaling factor lchar\nmate for the number of modes that are contributing to\nthe signal (the result really does not rely on the fraction\nof the sky τ (n̂) is estimated).\nAn estimate for signal-to-noise that can be obtained in\ncross correlation (S/N )τ g is\nτg 2\n2\n(S/N )2τ g ≈ lchar\nfsky freion (Cchar\n) /(Clτ̂ τ̂ Cgg )\n2\nττ\n= lchar\nfsky freion r2 Cchar\n/Clτ̂ τ̂\n\n= lchar fsky freion r2 (S/N )τ ,\n\n(22)\n\nwhere fsky and freion are the fraction of the sky and reionization over which surveys overlap, r is the cross correlation coefficient of galaxies and the τ (n̂) field over the\nsame projected volume as the galaxy survey (r ∼ 1 on\nlarge scale).\nNoting that fsky . 10−4 is the current size for z ∼ 7\ngalaxy surveys, it would take a very ambitious survey\nto enhance the τ signal in cross correlation compared to\nin the auto-power. Correlating with the diffuse background light from early galaxies – the cosmic infrared\nbackground – is a related and intriguing possibility since\nthen fsky freion ∼ 1 (although, lower redshift emission\nmay be a significant noise source in this case) and may\ndeserve further study.\nThe final possibility that we discuss is cross correlating with a survey of redshifted 21cm emission from intergalactic neutral hydrogen. Such surveys do span a\nsignificant fraction of the sky and the first generation\nof such endeavors will be in a noise-dominated regime in\nwhich they could benefit from cross-correlation [38] (Note\nthat cross correlating with τ would be of little interest if\nthere existed high S/N 21cm maps). However, redshifted\n21cm analyses remove the modes with small line-of-sight\n\n\f10\nprojected wavevectors in the act of foreground cleaning,\nwhich unfortunately are the modes that contribute to the\nτ signal [39]. Thus, there would be little signal in this\ncross correlation.\n\nWe thank C. Dvorkin and K. M. Smith for helpful dis-\n\ncussions. APSY gratefully acknowledges support from\nIBM Einstein fellowship and funding from NASA award\nnumber NNX08AG40G and NSF grant number AST0807444. MM is supported by the NASA Einstein fellowship. JY is supported by the SNF Ambizione grant. MZ\nis supported by the National Science Foundation under\nPHY-0855425 and AST-0907969, and by the David and\nLucile Packard Foundation and the John D. and Catherine T. MacArthur Foundation.\n\n[1] X. Fan et al., Astron. J. 132, 117 (2006), astroph/0512082.\n[2] E. Komatsu, K. M. Smith, J. Dunkley, C. L. Bennett,\nB. Gold, G. Hinshaw, N. Jarosik, D. Larson, M. R. Nolta,\nL. Page, et al., Astrophysical Journal Supplement 192,\n18 (2011), 1001.4538.\n[3] R. Barkana and A. Loeb, Phys. Rep. 349, 125 (2001),\narXiv:astro-ph/0010468.\n[4] S. R. Furlanetto, M. Zaldarriaga, and L. Hernquist, Astrophys. J. 613, 1 (2004), arXiv:astro-ph/0403697.\n[5] M. McQuinn, A. Lidz, O. Zahn, S. Dutta, L. Hernquist,\nand M. Zaldarriaga, Mon. Not. R. Astron. Soc. 377, 1043\n(2007), arXiv:astro-ph/0610094.\n[6] J. Miralda-Escude, Astrophys. J. 501, 15 (1998),\narXiv:astro-ph/9708253.\n[7] M. McQuinn, L. Hernquist, M. Zaldarriaga, and\nS. Dutta, Mon. Not. R. Astron. Soc. 381, 75 (2007),\n0704.2239.\n[8] M. Ouchi, K. Shimasaku, H. Furusawa, T. Saito,\nM. Yoshida, M. Akiyama, Y. Ono, T. Yamada, K. Ota,\nN. Kashikawa, et al., Astrophys. J. 723, 869 (2010),\n1007.2961.\n[9] T. Totani, N. Kawai, G. Kosugi, K. Aoki, T. Yamada,\nM. Iye, K. Ohta, and T. Hattori, PASJ 58, 485 (2006),\narXiv:astro-ph/0512154.\n[10] M. McQuinn, A. Lidz, M. Zaldarriaga, L. Hernquist, and\nS. Dutta, Mon. Not. R. Astron. Soc. 388, 1101 (2008),\n0710.1018.\n[11] S. R. Furlanetto, S. P. Oh, and F. H. Briggs, Phys. Rep.\n433, 181 (2006), arXiv:astro-ph/0608032.\n[12] C. Dvorkin and K. M. Smith, Phys. Rev. D 79, 043003\n(2009), 0812.1566.\n[13] R. A. Sunyaev and Y. B. Zeldovich, Astrophys. Space\nSci. 7, 20 (1970).\n[14] R. A. Sunyaev and I. B. Zeldovich, Ann. Rev. Astron.\nAstrophys. 18, 537 (1980).\n[15] W. Hu, Astrophys. J. 529, 12 (2000), arXiv:astroph/9907103.\n[16] M. McQuinn, S. R. Furlanetto, L. Hernquist, O. Zahn,\nand M. Zaldarriaga, Astrophys. J. 630, 643 (2005),\narXiv:astro-ph/0504189.\n[17] M. G. Santos, A. Cooray, Z. Haiman, L. Knox, and\nC.-P. Ma, Astrophys. J. 598, 756 (2003), arXiv:astroph/0305471.\n[18] I. T. Iliev, U.-L. Pen, J. R. Bond, G. Mellema, and P. R.\nShapiro, Astrophys. J. 660, 933 (2007), arXiv:astroph/0609592.\n[19] P. Zhang, U.-L. Pen, and H. Trac, Mon. Not. R. Astron.\nSoc. 347, 1224 (2004), arXiv:astro-ph/0304534.\n\n[20] A. Gruzinov and W. Hu, Astrophys. J. 508, 435 (1998),\narXiv:astro-ph/9803188.\n[21] O. Doré, G. Holder, M. Alvarez, I. T. Iliev, G. Mellema,\nU.-L. Pen, and P. R. Shapiro, Phys. Rev. D 76, 043002\n(2007), arXiv:astro-ph/0701784.\n[22] N. Aghanim, S. Majumdar, and J. Silk, Reports on\nProgress in Physics 71, 066902 (2008), 0711.0518.\n[23] G. P. Holder, K. M. Nollett, and A. van Engelen, ArXiv\ne-prints (2009), 0907.3919.\n[24] W. Hu and T. Okamoto, Astrophys. J. 574, 566 (2002).\n[25] T. Okamoto and W. Hu, Phys. Rev. D 67, 083002 (2003),\narXiv:astro-ph/0301031.\n[26] C. M. Hirata and U. Seljak, Phys. Rev. D 68, 083002\n(2003), arXiv:astro-ph/0306354.\n[27] A. Lewis and A. Challinor, Phys. Rep. 429, 1 (2006),\narXiv:astro-ph/0601594.\n[28] O. Zahn, A. Lidz, M. McQuinn, S. Dutta, L. Hernquist,\nM. Zaldarriaga, and S. R. Furlanetto, Astrophys. J. 654,\n12 (2007), arXiv:astro-ph/0604177.\n[29] O. Zahn, A. Mesinger, M. McQuinn, H. Trac, R. Cen,\nand L. E. Hernquist, ArXiv e-prints (2010), 1003.3455.\n[30] J. R. Bond, S. Cole, G. Efstathiou, and N. Kaiser, Astrophys. J. 379, 440 (1991).\n[31] C. Lacey and S. Cole, Mon. Not. R. Astron. Soc. 262,\n627 (1993).\n[32] S. R. Furlanetto and S. P. Oh, Mon. Not. R. Astron. Soc.\n363, 1031 (2005), arXiv:astro-ph/0505065.\n[33] D. Tseliakhovich and C. Hirata, Phys. Rev. D 82, 083520\n(2010), 1005.2416.\n[34] N. Dalal, U. Pen, and U. Seljak, JCAP 11, 7 (2010),\n1009.4704.\n[35] K. M. Smith, A. Cooray, S. Das, O. Doré, D. Hanson, C. Hirata, M. Kaplinghat, B. Keating, M. LoVerde,\nN. Miller, et al., ArXiv e-prints (2008), 0811.3916.\n[36] K. M. Smith, D. Hanson, M. LoVerde, C. M. Hirata, and\nO. Zahn, ArXiv e-prints (2010), 1010.0048.\n[37] The COrE Collaboration, ArXiv e-prints (2011),\n1102.2181.\n[38] A. Lidz, S. R. Furlanetto, S. P. Oh, J. Aguirre, T.-C.\nChang, O. Doré, and J. R. Pritchard, ArXiv e-prints\n(2011), 1104.4800.\n[39] M. McQuinn, O. Zahn, M. Zaldarriaga, L. Hernquist,\nand S. R. Furlanetto, Astrophys. J. 653, 815 (2006),\narXiv:astro-ph/0512263.\n[40] W. Hu, S. DeDeo, and C. Vale, New Journal of Physics\n9, 441 (2007), arXiv:astro-ph/0701276.\n[41] J. Yoo and M. Zaldarriaga, Phys. Rev. D 78, 083002\n(2008), 0805.2155.\n[42] J. Yoo, M. Zaldarriaga, and L. Hernquist, Phys. Rev. D\n\nAcknowledgments\n\n\f11\n81, 123006 (2010), 1005.0847.\n[43] A. Lewis, A. Challinor, and A. Lasenby, Astrophys. J.\n538, 473 (2000), arXiv:astro-ph/9911177.\n\nAppendix A: Reconstructing Inhomogeneous\nReionization τ (n̂): Simulation Pipeline\n\nOur simulation pipeline of optical depth τ (n̂) field reconstruction follows the procedure in [40], and we modified the code developed for lensing reconstruction in\n[41, 42]. First, we generate primordial CMB polarization Qpri (n̂) and U pri (n̂) maps as Gaussian realizations\nof CMB power spectrum. We choose a standard fiducial model with a flat ΛCDM cosmology, with parameters given by Ωb = 0.045, Ωc = 0.23, H0 = 70.5, ns =\n0.96, nt = 0.0, and τ = 0.08. We calculate the theoretical\nlensed and unlensed CMB power spectrum from publicly\navailable code CAMB [43]. The primordial CMB polarizations maps are then transformed according to Eq. (3)\nto include the effect of patchy reionization. The τ (n̂) field\nwas generated from a reionization simulation described in\nSection II.\nTo include the effect of lensing, we generate a realization of lensing deflection field d(n̂) and transform the\nCMB fields Q̃(n̂) and Ũ (n̂) to Q(n̂) and U (n̂) according\nto\n(Q ± iU )(n̂) = (Q̃ ± iŨ )(n̂ + d(n̂)) .\n\n(A1)\n\nThe deflection angle at each point n̂ is calculated by taking the gradient of the lensing potential. The lensing potential power spectrum is generated using CAMB which\nwas run with nonlinear corrections using halofit [43].\nSince we want to quantify the lensing contamination,\nwe have several pipelines with different level of lensing\nsignal being removed. We define a de-lensing factor α, as\nC delen,φφ =C theory,φφ /α, where α = 1 correspond to no\nde-lensing, α → ∞ corresponds to perfect delensing, we\nuse α = 50 for Fig. (2).\nWe then Fourier transform CMB polarization maps to\nget E(l) and B(l) maps. Finally we multiply CMB E(l)\nand B(l) maps by Gaussian beam in Fourier space and\nadd instrumental noise.\nMore specifically, we closely follow Hu et al [40] to rewrite the τ̂ (n̂) estimator which is more efficient to evaluate computationally. We re-write the estimator in real\nspace\nZ\n\b\nτ̂lEB = −NlEB d2 n̂e−in̂*l Re [GEB (n̂)LB∗ (n̂)] .\n\nand LB is given by\nLB\nl =\n\nClEE\nE(l)e2iφl .\nEE\n(Cl + NlEE )\n\n(A4)\n\nNlEB is a normalization coefficient which ensure the\nunbiansdness of the estimator [40]. The results of our\nsimulations are shown in Fig. (2).\nAppendix B: Unbiased Minimum Variance\nQuadratic Estimator for Patchy Reionization\n\nThis section discusses the quadratic estimator for the\npatchy reionization induced optical depth fluctuation\nfield τ (n̂) in a more general context, demonstrating that\nthe estimator τ̂ (n̂) used in the text is the minimum variance estimator in the limit that the signal-to-noise ratio\nin lensing estimator φ̂(n̂) is much higher than in τ̂ (n̂).\nIn Fourier space, the general unbiased quadratic estimator for φ̂l and τ̂l is\nX\nφ\nQli X(l − li )X ′ (li ) − Tr(QfXX\nτ̂l =\n′ ) φl\nli\n\nφ̂l =\n\nX\nli\n\nτ\nPli X(l − li )X ′ (li ) − Tr(P fXX\n′ ) τl\n\n(B1)\n\nτ\nwhere Qli and Pli are some weighting functions, fXX\n′\nφ\nand fXX ′ is the same as in Eq. (5) and (14). The\nsum does not include\nli = 0 and we are using Tr(X) as\nP\nshorthand for li Xli . Noting that hX(l − li )X ′ (li )i =\nφ\nτ\nfXX\n′ (l−li , li )φl +fXX ′ (l−li , li )τl , we can write the above\nequation as (if we substitute the unbiased estimator φ̂l\nand τ̂l on the R.H.S.)\n\u0013\n\u0012 \u0013 \u0012P\nτ̂l\nQli X(l − li )X ′ (li )\nl\ni\nP\n(B2)\nA×\n=\n′\nφ̂l\nli Pli X(l − li )X (li )\n\nwhere\n\nA≡\n\n\u0012\n\nφ\n1\nTr(QfXX\n′)\nτ\nTr(P fXX ′ )\n1\n\n\u0013\n\n.\n\n(B3)\n\nThus, the general unbiased quadratic estimator for τl\nalone is\nX\u0002\n\u0003\nτ̂l =\n[A−1 ]11 Qli + [A−1 ]12 Pli T (l − li )T (li ) (B4)\nli\n\nWe want to derive the weighting functions Qli and Pli\nthat give us the unbiased minimum variance estimator\nτ̂l . The estimator variance is\n\n(A2)\nThe field GEB is built from the observed E(l) field (including contributions from lensing and patchy reionization) as\nGEB\n=\nl\n\nB(l)\ne2iφl .\n(ClBB + NlBB )\n\nvar[τ̂l ] = h|τ̂l |2 i\nX\nXli Cli Xli Cl−li ,\n= 2\n\n(B5)\n\nXli = [A−1 ]11 Qli + [A−1 ]12 Pli .\n\n(B6)\n\nli\n\nwhere\n(A3)\n\n\f12\nTo derive the minimum variance estimator, we want\nto minimize var[τ̂l ] subject to the conditions that\nφ\nτ\nTr[P fXX\nRather than go\n′ ] = 1 and Tr[QfXX ′ ] = 1.\nthrough this exercise, let us note first that at relevant\nφ\nτ\n2\nmultipole fXX\n′ ≪ fXX ′ because of the factor of ∼ l that\nφ\ncontributes to fXX ′ . Let us also note that the weighting\nfunction Pli that is optimal for simultaneously estimating φl with τl should be nearly identical to the minimum\nvariance quadratic weighting for estimating just φl because τl is a weak contaminant of lensing. Second note\nφ\nτ\nthat |[A−1 ]12 | ∝ Tr[P fXX\n′ ] ≪ 1 (since Tr[P fXX ′ ] = 1),\n−1\nand thus [A ]12 has magnitude that is much less than\nthat of [A−1 ]11 . Not only [A−1 ]11 ≫ [A−1 ]12 , but note\n\nthe scaling Ql /Pl ∼ l2 ≫ 1, therefore, we are justified in\nignoring the second term in Eq. (B6) and one can show\nthat the minimizing Eq. (B5) subject to the constraint\nτ\nTr[QfXX\n′ ] = 1 yields\n−1\nτ\nτ\n−1 τ\nfXX\nfXX ′ ]−1 Cl−1\nQli = Tr[C −1 fXX\n′C\n′ (li , l − li )C\nl−li ,\ni\n\n(B7)\n\nwhich yields the identical estimator to that used in the\ntext. Furthermore, because the variance of τ̂l is dominated by Qli , this explains why our unbiased estimator\nthat accounts for φl yields a result that is not much different than the biased minimum variance estimator.\n\n\f"}