{"id": "http://arxiv.org/abs/0812.4524v2", "guidislink": true, "updated": "2008-12-28T11:16:30Z", "updated_parsed": [2008, 12, 28, 11, 16, 30, 6, 363, 0], "published": "2008-12-24T12:09:46Z", "published_parsed": [2008, 12, 24, 12, 9, 46, 2, 359, 0], "title": "Nodeless differentially rotational Alfvén oscillations of crustal\n  solid-state plasma in quaking neutron star", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0812.0909%2C0812.2732%2C0812.4558%2C0812.1946%2C0812.3181%2C0812.0889%2C0812.2991%2C0812.1459%2C0812.4583%2C0812.3724%2C0812.3184%2C0812.4524%2C0812.2677%2C0812.1258%2C0812.2955%2C0812.0573%2C0812.4330%2C0812.0471%2C0812.2141%2C0812.3552%2C0812.0904%2C0812.5114%2C0812.1305%2C0812.2934%2C0812.2807%2C0812.1864%2C0812.1863%2C0812.3785%2C0812.2836%2C0812.4168%2C0812.1055%2C0812.3633%2C0812.3559%2C0812.0895%2C0812.4035%2C0812.1810%2C0812.3682%2C0812.3768%2C0812.2938%2C0812.2518%2C0812.0043%2C0812.2987%2C0812.1686%2C0812.0655%2C0812.1556%2C0812.1993%2C0812.1576%2C0812.1794%2C0812.1052%2C0812.1492%2C0812.1072%2C0812.2331%2C0812.1645%2C0812.1360%2C0812.1788%2C0812.3598%2C0812.0472%2C0812.1732%2C0812.4854%2C0812.0021%2C0812.4414%2C0812.4184%2C0812.3130%2C0812.2229%2C0812.3303%2C0812.4894%2C0812.1707%2C0812.4571%2C0812.1870%2C0812.0459%2C0812.0746%2C0812.4078%2C0812.0679%2C0812.1892%2C0812.2994%2C0812.1841%2C0812.2823%2C0812.1605%2C0812.1581%2C0812.4944%2C0812.1823%2C0812.2261%2C0812.0577%2C0812.2606%2C0812.2793%2C0812.1891%2C0812.2115%2C0812.4727%2C0812.0683%2C0812.0149%2C0812.1093%2C0812.0638%2C0812.0126%2C0812.3760%2C0812.3228%2C0812.4109%2C0812.1184%2C0812.4952%2C0812.2016%2C0812.0740%2C0812.2178&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Nodeless differentially rotational Alfvén oscillations of crustal\n  solid-state plasma in quaking neutron star"}, "summary": "The two-component, core-crust, model of a neutron star with homogenous\ninternal and dipolar external magnetic field is studied responding to\nquake-induced perturbation by substantially nodeless differentially rotational\nAlfv\\'en oscillations of the perfectly conducting crustal matter about axis of\nfossil magnetic field frozen in the immobile core. The energy variational\nmethod of the magneto-solid-mechanical theory of a viscoelastic perfectly\nconducting medium pervaded by magnetic field is utilized to compute the\nfrequency and lifetime of nodeless torsional vibrations of crustal solid-state\nplasma about the dipole magnetic-moment axis of the star. It is found that\nobtained two-parametric spectral formula for the frequency of this toroidal\nAlfven mode provides fairly accurate account of rapid oscillations of the X-ray\nflux during the flare of SGR 1806-20 and SGR 1900+14, supporting the\ninvestigated conjecture that these quasi-periodic oscillations owe its origin\nto axisymmetric torsional oscillations predominately driven by Lorentz force of\nmagnetic field stresses in the finite-depth crustal region of the above\nmagnetars.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0812.0909%2C0812.2732%2C0812.4558%2C0812.1946%2C0812.3181%2C0812.0889%2C0812.2991%2C0812.1459%2C0812.4583%2C0812.3724%2C0812.3184%2C0812.4524%2C0812.2677%2C0812.1258%2C0812.2955%2C0812.0573%2C0812.4330%2C0812.0471%2C0812.2141%2C0812.3552%2C0812.0904%2C0812.5114%2C0812.1305%2C0812.2934%2C0812.2807%2C0812.1864%2C0812.1863%2C0812.3785%2C0812.2836%2C0812.4168%2C0812.1055%2C0812.3633%2C0812.3559%2C0812.0895%2C0812.4035%2C0812.1810%2C0812.3682%2C0812.3768%2C0812.2938%2C0812.2518%2C0812.0043%2C0812.2987%2C0812.1686%2C0812.0655%2C0812.1556%2C0812.1993%2C0812.1576%2C0812.1794%2C0812.1052%2C0812.1492%2C0812.1072%2C0812.2331%2C0812.1645%2C0812.1360%2C0812.1788%2C0812.3598%2C0812.0472%2C0812.1732%2C0812.4854%2C0812.0021%2C0812.4414%2C0812.4184%2C0812.3130%2C0812.2229%2C0812.3303%2C0812.4894%2C0812.1707%2C0812.4571%2C0812.1870%2C0812.0459%2C0812.0746%2C0812.4078%2C0812.0679%2C0812.1892%2C0812.2994%2C0812.1841%2C0812.2823%2C0812.1605%2C0812.1581%2C0812.4944%2C0812.1823%2C0812.2261%2C0812.0577%2C0812.2606%2C0812.2793%2C0812.1891%2C0812.2115%2C0812.4727%2C0812.0683%2C0812.0149%2C0812.1093%2C0812.0638%2C0812.0126%2C0812.3760%2C0812.3228%2C0812.4109%2C0812.1184%2C0812.4952%2C0812.2016%2C0812.0740%2C0812.2178&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The two-component, core-crust, model of a neutron star with homogenous\ninternal and dipolar external magnetic field is studied responding to\nquake-induced perturbation by substantially nodeless differentially rotational\nAlfv\\'en oscillations of the perfectly conducting crustal matter about axis of\nfossil magnetic field frozen in the immobile core. The energy variational\nmethod of the magneto-solid-mechanical theory of a viscoelastic perfectly\nconducting medium pervaded by magnetic field is utilized to compute the\nfrequency and lifetime of nodeless torsional vibrations of crustal solid-state\nplasma about the dipole magnetic-moment axis of the star. It is found that\nobtained two-parametric spectral formula for the frequency of this toroidal\nAlfven mode provides fairly accurate account of rapid oscillations of the X-ray\nflux during the flare of SGR 1806-20 and SGR 1900+14, supporting the\ninvestigated conjecture that these quasi-periodic oscillations owe its origin\nto axisymmetric torsional oscillations predominately driven by Lorentz force of\nmagnetic field stresses in the finite-depth crustal region of the above\nmagnetars."}, "authors": ["S. I. Bastrukov", "H. -K. Chang", "I. V. Molodtsova", "J. Takata"], "author_detail": {"name": "J. Takata"}, "author": "J. Takata", "links": [{"href": "http://arxiv.org/abs/0812.4524v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0812.4524v2", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0812.4524v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0812.4524v2", "arxiv_comment": null, "journal_reference": null, "doi": null, "fulltext": "Nodeless differentially rotational Alfvén oscillations of crustal\nsolid-state plasma in quaking neutron star\n\narXiv:0812.4524v2 [astro-ph] 28 Dec 2008\n\nS.I. Bastrukov1,3 , H.-K. Chang1,2 , I.V. Molodtsova3 , and J. Takata4\nABSTRACT\nThe two-component, core-crust, model of a neutron star with homogenous internal and dipolar external magnetic field is studied responding to quake-induced\nperturbation by substantially nodeless differentially rotational Alfvén oscillations\nof the perfectly conducting crustal matter about axis of fossil magnetic field\nfrozen in the immobile core. The energy variational method of the magnetosolid-mechanical theory of a viscoelastic perfectly conducting medium pervaded\nby magnetic field is utilized to compute the frequency and lifetime of nodeless torsional vibrations of crustal solid-state plasma about the dipole magnetic-moment\naxis of the star. It is found that obtained two-parametric spectral formula for the\nfrequency of this toroidal Alfvén mode provides fairly accurate account of rapid\noscillations of the X-ray flux during the flare of SGR 1806-20 and SGR 1900+14,\nsupporting the investigated conjecture that these quasi-periodic oscillations owe\nits origin to axisymmetric torsional oscillations predominately driven by Lorentz\nforce of magnetic field stresses in the finite-depth crustal region of the above\nmagnetars.\nKey words: stars: individual (SGR 1900+14, SGR 1806-20); stars: neutron; stars:\noscillations\n\n1.\n\nIntroduction\n\nThe quasi-periodic oscillations (QPOs) recently detected in the X-ray flux of flaring\nSGR 1806-20 and SGR 1900+14 and interpreted as a manifest of quake-induced torsional\n1\n\nInstitute of Astronomy,\nNational Tsing Hua University, Hsinchu, 30013, Taiwan\n2\n\nDepartment of Physics,\nNational Tsing Hua University, Hsinchu, 30013, Taiwan\n3\n\nLaboratory of Informational Technologies,\nJoint Institute for Nuclear Research, 141980 Dubna, Russia\n4\n\nASIAA/National Tsing Hua University - TIARA, Hsinchu, Taiwan\n\n\f–2–\nvibrations of underlying magnetar (Israel et al 2005, Watts & Strohmayer 2006) are among\nthe topical themes in current development of the astroseismology of this subclass of neutron\nstars (e.g. Glampedakis et al 2007; Samuelssen & Andersson 2007; Levin 2007, van Hoven &\nLevin 2008, Lee 2007, 2008; Sotani et al 2007, 2008; Vavoulidis et al 2008) whose bursting and\nquiescent electromagnetic activity is dominated, as is commonly believed, by frozen-in fossil\nmagnetic field of extraordinary intensity (e.g., Woods & Thompson 2006, Mereghetti 2008).\nMotivated by this interest, in (Bastrukov et al 2007, 2008, 2009) several possible scenarios\nof post-quake relaxation of magnetar has been investigated with emphasis on regime of\nnodeless torsional vibrations about the dipole magnetic-moment axis of these seismically\nactive neutron stars. In particular, in (Bastrukov et al 2007b, 2008), a case of the elasticforce-driven nodeless shear oscillations, both torsional – 0 tl and spheroidal – 0 sl , locked in\nthe finite-depth crust ∆R has been studied in some details. It was found that obtained\ntwo-parametric spectral equations for the frequency of pure elastic spheroidal and torsional\nmodes as a function of multipole degree l of nodeless shear oscillations of the form (Bastrukov\net al 2008)\nω(0sl ) = ωs (l, ωe , λ),\nr\nct\nμ\n,\nω e = , ct =\nR\nρ\n\nω(0 tl ) = ωt (l, ωe , λ),\nl ≥ 1,\n∆R\nλ=1−\n, ∆R = R − Rc\nR\n\n(1)\n(2)\n\nprovide proper account of the low-frequency QPOs frequencies, supporting l-pole identification proposed in works (Watts & Strohmayer 2007, Samuelssen & Andersson 2007) and\nit was shown that the unidentified before lowest overtones of QPOs in light-curve of flaring SGR 1806-20 with frequencies 18 and 26 Hz can be interpreted as manifest of dipole,\nl = 1, spheroidal and torsion nodeless elastic shear vibrations, exhibiting features generic to\nGoldstone soft modes.\nOn the other hand, one can perhaps cast doubt on such interpretation of QPOs as being\nproduced by seismic vibrations driven by solely elastic restoring force, because it rests on a\npoorly justifiable assumption about dynamically passive role of ultra-strong magnetic field\ndefining only direction of axis about which the stellar matter undergo torsional nodeless\noscillations and remaining unaltered in the process of post-quake relaxation of magnetar.\nInstead, it seems more plausible to expect that explosive liberation of magnetic field energy\nresulting in the crust fracture by relieved magnetic field stresses – magnetic breaking associated with disruption of the magnetic field lines – must be followed, after the magnetic field\nlines reconnection, by the Lorentz-force-driven Alfvén differentially rotational oscillations of\nthe perfectly conducting star matter about axis of frozen-in homogeneous magnetic field,\neither in the entire volume or in the peripheral finite-depth crust. This line of argument has\nbeen taken into account in the magneto-solid-mechanical model of global torsional nodeless\nvibrations about the dipole magnetic moment axis of neutron star driven by the joint action\n\n\f–3–\nof Hooke's force of elastic shear stresses and Lorentz force of magnetic field stresses (Bastrukov et al 2009). The computed in this latter work the two-parametric frequency spectrum\nof the form\nω2\nB2\nω(0tl ) = ωt (l, ωe , β),\nβ = A2 =\n,\nl ≥ 2,\n(3)\nωe\n4πμ\nμ\nv2\nB2\nc2\n(4)\nωe2 = t2 , c2t = , ωA2 = A2 , vA2 =\nR\nρ\nR\n4πρ\nwas found to be consistent with data on QPOs with frequencies ν = ω/2π from the range\n30 ≤ ν ≤ 200 Hz interpreted as being produced by these global seismic vibrations of multipole\ndegree l from interval 2 ≤ l ≤ 20, but unable to explain the above mentioned lowest overtones\nin the QPOs spectrum of SGR 1806-20. Also, from the viewpoint of both outlined models\nthe nature of restoring force responsible for high-frequency QPOs with ν = 626 and ν = 1837\nHz remains uncertain.\nIn this paper, continuing investigations reported in (Bastrukov et al 2007, 2008, 2009),\nwe focus on different, to the above mentioned scenarios, case of post-quake vibrational relaxation of a neutron star. Specifically, we consider torsional nodeless Alfvén oscillations of\nthe crustal solid-state plasma, that is, seismic vibrations restored by solely Lorentz force of\nmagnetic field stresses and excited in the peripheral finite-depth seismogenic layer of neutron\nstar model with homogeneous internal and dipolar external magnetic field. In section 2, a\nbrief outline is given of equations of magneto-solid-mechanics appropriate for the perfectly\nconducting viscoelastic continuous medium pervaded by magnetic field. In section 3, the\nspectral formulae for the frequency and lifetime of this toroidal Alfvén vibration mode are\nobtained followed by discussion of inferences that can be made from considered scenario\nof seismic vibrations regarding electrodynamic properties of the neutron star matter with\nhomogeneous configuration of the frozen-in magnetic field. The relevance of considered asteroseismic model to the detected QPOs in the X-ray flux during the flare of SGR 1806-20 and\nSGR 1900+14 is assessed in section 4. The newly obtained results are briefly summarized\nin section 5.\n\n2.\n\nGoverning equations of magneto-solid-dynamics of viscoelastic perfectly\nconducting stellar matter in the presence of frozen-in magnetic field\n\nThe equation of magneto-solid-dynamics describing mechanical distortions of the perfectly conducting continuous medium of extremely high electric conductivity threaded by\nmagnetic field are\nρüi = ∇k τik + ∇k πik\n\n(5)\n\n\f–4–\nwhere ui is the field of material displacements - the basic variable of the Newtonian elastic\ndynamics of solid material continuum,\nτik =\n\n1\n[Bi δBk + Bk δBi − Bj δBj δik ],\n4π\n\nδB = ∇ × [u × B]\n\n(6)\n\nstands for the tensor magnetic field stresses (Franko et al 2000, Bastrukov et al 2009) and\nπik = 2η u̇ik ,\n\n1\nu̇ik = [∇i u̇k + ∇k u̇i ]\n2\n\n(7)\n\nis the tensor of viscose stresses πik linearly related to the rate of shear strains u̇ik with η being\nthe shear viscosity of stellar matter. This last constitutive equation expresses Newtonian law\nof viscosity which holds for both liquid and solid aggregate states of continuous medium. The\nequation of energy balance in the process of compression-free Alfvén vibrations highlighting\nits shear character reads\nZ\nZ\nZ\nρu̇2\n∂\ndV = − τik u̇ik dV − πik u̇ik dV, u̇kk = ∇k u̇k = 0.\n(8)\n∂t\n2\nThis equation is obtained by scalar multiplication of equation of magneto-solid-mechanics\n(5) with ui and integration over the star volume. To compute the frequency and lifetime\nof Alfvén oscillations, we take advantage of Rayleigh's energy variational method which\nassumes the following separable representation of fluctuating field of material displacements\nui (r, t) = ai (r)α(t)\n\n(9)\n\nwith ai (r) being the time-independent field of instantaneous displacement and amplitude α(t)\ndescribes temporal evolution of fluctuations. The tensors of fluctuating Maxwell's magnetic\nstresses and Newtonian viscous stresses are too written in similar separable form\n1\nτik (r, t) = [τ̃ik (r) − τ̃jj (r)δik ]α(t),\n2\n1\n[Bi (r) bk (r) + Bk (r), bi (r)],\nτ̃ik (r) =\n4π\nbi (r) = ∇k [ai (r) Bk (r) − ak (r) Bi (r)],\n1\nπik (r) = 2η aik (r)α(t), aik (r) = [∇i ak (r) + ∇k ai (r)].\n2\n\n(10)\n(11)\n(12)\n(13)\n\nThe idea of above separable representation of fluctuating variables is that on substituting\n(9)-(13) in (8), this latter equation is reduced to equation for α(t) having the well-familiar\nform of equation of damped oscillations\nMα̈ + D α̇ + Kα = 0, α(t) = α0 exp(−t/τ ) cos(Ωt),\n\u0002\n\u0003\n2M\nK\n, τ=\n.\nΩ2 = ω 2 1 − (ωτ )−2 , ω 2 =\nM\nD\n\n(14)\n(15)\n\n\f–5–\nwith the integral parameters of the inertia M, viscous friction D and stiffness K given by\nZ\nM = ρ(r)ai (r) ai (r) dV,\n(16)\nZ\n1\n[Bi (r)βk (r) + Bk (r)βi (r)] [∇i ak (r) + ∇k ai (r)] dV,\n(17)\nKm =\n8π\nZ\n1\nD=\nη(r)[∇i ak (r) + ∇k ai (r)] [∇i ak (r) + ∇k ai (r)] dV.\n(18)\n2\nThe above expounded equations are general in the sense that they can be used for computing\nfrequency ω of both the even-parity poloidal and odd-parity toroidal Alfvén vibrational\nmodes (Bastrukov et al 1999) and the time of viscous damping of nodeless oscillations in\na neutron star models in which the density, the magnetic field and the shear viscosity are\nconsidered to be arbitrary functions of position.\nAs was noted by McDermott et al (1988), the characteristic feature of solid-mechanical\ntreatment of the neutron star asteroseismology, having many features in common with the\none adopted in geoseismology (e.g. Lapwood & Usami 1981, Lay & Wallace 1995, Aki &\nRichards 2003), is that it deals with quake-induced shear vibrations about hydrostatic equilibrium which is presumed to exist, but with no reference to explicit form of equation of\ngravitationally equilibrium state which is normally considered as the free from anisotropic\nstresses state. The anisotropic stresses of different physical nature (elastic, magnetic or gravitational) defining restoring force of shear vibrations are regarded to come into play only after\nquake-induced perturbation. By thus relinquishing the condition of hydrostatic equilibrium\nof magnetic solid star, we gain enormous freedom in the choice of possible configurations of\nmagnetic field inside and outside the star with the only constraint that this equilibrium field\nmust obey the equations of magneto-statics. The remainder of this paper, which is sequel\nto (Bastrukov et al 2007b, 2009), considers the neutron star model with homogeneous inside\nand dipolar outside magnetic field for which this condition is of course met.\n\n3.\n\nToroidal Altvén mode of nodeless differentially rotational oscillations in the\nperipheral finite-depth seismogenic crust of a neutron star\n\nThe application of the magnetic solid star model under consideration to neutron stars\nrests on the common today belief that the frozen in the stellar material magnetic field is\nfossil (e.g. Flowers & Ruderman 1977, Bhattacharya & van den Heuvel 1991, Chanmugam\n1992, Spruit 2008). Contrary to the main sequence (MS) stars whose magnetic fields are\ngenerated by permanent flows of fluid in the self-exciting dynamo processes, in the neutron\nstars there are no nuclear energy sources to support convection, so that the fossil magnetic\n\n\f–6–\nfield is considered to be frozen in the super dense solid material continuum which before\nstarquake remains immobile being highly compressed by immense pressure of self-gravity\nwhich is counterbalanced by the degeneracy pressure of Fermi-gas of relativistic electrons in\nthe star crust and non-relativistic neutrons in the core. The magnetic field pressure constructively contributes to the total internal pressure, however its absolute value is much less\nthan the degeneracy pressure, so that magnetic pressure plays insufficient role in hydrostatic\nequilibrium of pulsars and magnetars1 , but may play substantial, if not decisive, part in the\nprocess of their post-quake relaxation (Bastrukov et al 2009).\nIn spherical polar coordinates, the components of internal homogeneous field directed\nalong the polar axis are given by\nBθ = −B sin θ,\n\nBr = B cos θ,\n\nBφ = 0\n\n(19)\n\nand external dipolar configuration is described by the field B = ∇×A, where A = [0, 0, Aφ =\nms /r 2 ] is the vector potential with the standard parametrization of the dipole magnetic\nmoment ms = (1/2)BR3 of the star of radius R and by B is understood the magnetic field\nintensity at the magnetic poles of the star, B = Bp , as is illustrated in Fig.1.\nThe material displacements in the crust undergoing non-radial differentially rotational\noscillations about magnetic axis of the star are described by the nodeless toroidal field of the\nform (Bastrukov et al 2007b, 2008b)\nu(r, t) = at (r) α(t),\nφ(r) = ∇χ(r),\nl\n\nat (r) = [φ(r) × r]\n\n∇2 χ(r) = 0\n\nχ(r) = [Al r + Bl r\n\n−l−1\n\n] Pl (ζ),\n\nζ = cos θ\n\n(20)\n(21)\n(22)\n\nThe arbitrary constants Al and Bl are eliminated from the following boundary conditions\n\u0012\n\u0013\n∂\n1\n∂\nuφ |r=Rc = 0, uφ |r=R = [Φ × R]φ , Φ = ∇r=R Pl (ζ), ∇r=R = 0,\n. (23)\n,\nR∂θ R sin θ ∂φ\nThe leftmost equation is the no-slip condition on the core-crust interface, r = Rc , implying\nthat the amplitude of differentially rotational oscillations is gradually decreases as depth of\n1\n\nAt normal nuclear density ρ = nmn = 2.8 1014 g cm−3 with m being the mass of neutron, the pressure\nof degenerate Fermi-gas of non-relativistic neutrons PF = KN R n5/3 ≈ 1033 dyn cm−2 . The typical for\nmagnetars magnetic fields 1014 < B < 1016 Gauss, so that the magnetic field pressure, PB = B 2 /(8π),\nfalls in the interval 1027 < PM < 1031 , that is, at least two order of magnitude less than PF . For this\nreason we do not take into account the Chandrasekhar-Fermi effect of magnetic flattening of spherical shape\nof star at its magnetic pole which has first been established for homogeneous magnetic field of dipolar\nexternal configuration (Chandrasekhar & Fermi 1953) and confirmed by Ferraro (1954) for a star model with\nnonhomogeneous poloidal internal and dipolar external field.\n\n\f–7–\n\nFig. 1.- The dipolar external and homogenous internal magnetic field of the twocomponent, core-crust, model of the neutron star under consideration.\nseismogenic layer is increased and turns into zero on the surface of core. The condition on\nthe star surface, r = R, is dictated by symmetry of the general toroidal solution of the vector\nLaplace equation as well as the fact that resultant expression of mass parameter of torsional\noscillations must lead to correct expression for the moment of inertia of a rigidly rotating star\n(Bastrukov et al 2008). Explicitly, the above boundary conditions are described by coupled\nalgebraic equations\nAl Rcl−1 + Bl Rc−l−2 = 0,\nAl Rl + Bl R−l−1 = R\n\n(24)\n(25)\n\nwhose solutions read\nA l = Nl ,\n\nBl = −Nl Rc2l+1 ,\n\nNl =\n\nRl+2\n.\nR2l+1 − Rc2l+1\n\n(26)\n\nThe spherical components of the nodeless toroidal field of instantaneous displacements are\ngiven by\n\u0015\n\u0014\ndPl (ζ)\nBl\nl\n.\n(27)\nar = 0, aθ = 0, aφ = Al r + l+1 Pl1 (ζ), Pl1 (ζ) = (1 − ζ 2)1/2\nr\ndζ\nThe snapshot of quadrupole, l = 2, and octupole l = 3, overtones of these axisymmetric\ndifferentially rotational vibrations about the dipole magnetic-moment axis of a neutron star\nis pictured in Fig.2.\n\n\f–8–\n\nFig. 2.- Quadrupole and octupole overtones of the nodeless differentially rotational, torsional, vibrations of crustal matter about the dipole magnetic moment axis of neutron star.\nThe mass parameter of torsional nodeless vibrations, computed in the approximation of\nuniform density of crustal matter, reads\nl(l + 1)\nmt (l, λ),\n(28)\n(2l + 1)(2l + 3)\n\u0014\n\u0015\n(2l + 1)2 2l+3 2l + 3 2(2l+1)\n2l+1\n2l+1 −2\n1 − (2l + 3)λ\n+\nmt (l, λ) = (1 − λ\n)\n,\nλ\n−\nλ\n2l − 1\n2l − 1\nRc\n,\n0 ≤ λ < 1.\n(29)\nλ =\nR\nM = 4π ρR5\n\nThe integral parameter of viscous friction D is given by\nD(0 tl ) = 4πηR\n\n2\n\n− 1)\ndt ,\n2l + 1\n\n3 l(l\n\ndt (l, λ) = (1 − λ\n\n2l+1 −1\n\n)\n\n\u0014\n\u0015\n(l + 2) 2l+1\n1−\n.\nλ\n(l − 1)\n\n(30)\n\nFor the lifetime of torsional oscillations damped by shear viscosity η of crustal material we\nobtain\nτ (0 tl ) =\n\n2τν\nmt (l, λ)\n(2l + 3)(l − 1) dt (l, λ)\n\n,\n\nτν =\n\nR2\n,\nν\n\nη\nν= .\nρ\n\n(31)\n\nIn Fig.3, the fractional lifetime is plotted as a function of multipole degree l of torsional\nnodeless oscillations for indicated values of fractional depths h of crustal seismically active\nregion of the neutron star.\nAt this point it may be appropriate to note that replacing, in the last equation for\nD(0 tl ), the coefficient of shear viscosity η by shear modulus μ of crustal matter, the resultant\nequation becomes identical to the expression for stiffness Ke (0 tl ) of the elastic-force-driven\n\n\f–9–\n\nτ(0tl)/τν\n\n0.10\n\nTorsion vibration mode\nh = 0.05\nh = 0.1\nh = 0.3\n\n0.01\n\n0.00\n\n1\n\n5\n\n10\nl\n\n15\n\n20\n\nFig. 3.- The fractional lifetime of torsion nodeless oscillations in the neutron star crust as\na functions of multipole degree l and indicated values of the fractional depth h of peripheral\nseismogeneic zone.\nnodeless oscillations (Bastrukov et all 2007b, 2008) whose general integral form is given by\nZ\n1\nKe =\nμ(r)[∇i ak (r) + ∇k ai (r)] [∇i ak (r) + ∇k ai (r)] dV\n(32)\n2\nwhere μ(r) stands for the shear modulus. Thus, in the standard two-component, corecrust, model of quaking neutron star (Franco et al 2000) presuming homogeneous density\nprofile for crustal matter ρ and constant values of transport coefficients of shear viscosity\nη and shear elasticity μ one has Ke (0 tl ) = (μ/η)D(0tl ); the frequency of elastic nodeless\nvibrations is estimated by ratio ω 2 = Ke /M (Bastrukov et all 2007b, 2008). In the limit,\nλ = (Rc /R) → 0, the analytic expression for the damping time, τ = 2M/D, of torsional\nnodeless oscillations in the crust is reduced to that for lifetime of global torsional nodeless\noscillations in the entire volume of homogeneous neutron star model (Bastrukov et al 2003,\n2007a)\nτ (0 tl ) =\n\n2τν\n.\n(2l + 3)(l − 1)\n\n(33)\n\nThe practical significance of outlined equations is that they can be used for the study of\nnodeless torsional vibrations of more wide class of celestial objects having solid seismogenic\nmantle of finite depth, such as Earth-like planets (Lay & Wallace 1995, Aki & Richards 2003)\nand white dwarf stars whose asteroseismology is the subject of intense current research (e.g.\nWinget & Kepler 2008).\nComputation of integral for the spring constant Km of the magnetic Lorentz restoring\nforce of non-radial Alfvén nodeless differentially rotational vibrations in the crust yields\nKm = B 2 R 3\n\nl(l2 − 1)(l + 1) t\nk (l, λ)\n(2l + 1)(2l − 1) A\n\n(34)\n\n\f– 10 –\nkAt (l, λ)\n\n= (1 − λ\n\n2l+1 −2\n\n)\n\n\u001a\n\n\u0014\n\u0015\u001b\n3λ2l+1\n1\n2l+1\n1+ 2\n1 − l(l + 2)(2l − 1)λ\n.\n(l − 1)(2l + 3)\n3\n\nAs a result we arrive at the spectral equation for the frequency as a function of multipole\ndegree of nodeless Alfvén oscillations\n\u0015\n\u0014\n2l + 3 kAt (l, λ)\n2\n2\nt\n2\n,\n(35)\nν (0 al [νa , h]) = νA (l − 1)\n2l − 1 mt (l, λ)\n∆R\nvA\nB\n, λ = 1 − h, h =\nωA = 2πνA =\n, vA = √\n(36)\nR\nR\n4πρ\nwhich depends, as one sees, upon two parameters – Alfvén frequency, νA = (1/2π)vA /R\nand the fractional depth, h = ∆R/R = 1 − λ, of seismogenic layer. In Fig.4 and Fig.5,\nthe fractional frequencies and periods of toroidal Alfvén vibration mode as a functions of\nmultipole degree l with indicated values of fractional depth of the seismogenic layer h are\nplotted, showing that the higher l the larger is the frequency and the shorter is the period\nof Alfvén nodeless vibrations.\nOne sees that the lowest overtone of torsion Alfvén oscillations entrapped in the crust\nis of dipole degree, l = 1. However, in the limit λ = (Rc /R) → 0 [or, in other terms,\nwhen h → 1 and kAt (l, λ)/mt (l, λ) → 1], the case when entire volume of the star sets in\nthe oscillations, the above two-parametric spectral formula is reduced to the one-parametric\nfrequency spectrum of global Alfvén torsional vibrations (Bastrukov et al 2009)\nr\n\u00151/2\n\u0014\n4π\nωA\n2l + 3\nRB 2\nt\n2\n, ωA =\n, M=\nρ R3 (37)\nν(0 al ) = νA (l − 1)\n, νA =\n2l − 1\n2π\n3M\n3\nwith the lowest overtone of quadrupole degree, l = 2. This suggests that dipole vibration\nis Goldstone's soft vibrational mode whose most conspicuous property is that the mode\ndisappears (the frequency tends to zero) when one of parameters, in our case λ, of vibrating\nsystem turns into zero (Bastrukov et al 2008).\nPhysically, the considered solid-mechanical model can be invoked to analysis of quasiperiodic oscillations of the electromagnetic emission from neutron star with approximately\nhomogenous internal and dipolar external magnetic field when quake-induced perturbation is\nfairly week, that is, does not penetrate into the deep interior of the star setting in oscillations\nonly its peripheral solid mantle of finite depth. Also, the model is appropriate for a case\nwhen the electrodynamic properties of the core material are incompatible with conditions of\nexistence of Alfvén oscillations, one of the major of which is the extremely large (effectively\ninfinite) electrical conductivity of stellar material (e.g., Chandrasekhar 1961, Mestel 1999).\nFor the solid crustal matter, which is normally considered as a metal-like solid-state plasma\ncomposed of nuclei embedded in the degenerate Fermi-gas of relativistic electrons (whose\n\n\f– 11 –\nAlfven toroidal mode\n120\n\nν(0tl)/νA\n\n100\n\n50\n\nh = 0.05\nh = 0.1\nh = 0.3\n\n0\n\nP(0tl)/PA\n\n0.2\n\nh = 0.05\nh = 0.1\nh = 0.3\n\n0.1\n\n0.0\n\n0\n\n20\n\n40\nl\n\n60\n\n80\n\nFig. 4.- Fractional frequency and period of nodeless torsional magneto-solid-mechanical\noscillations, toroidal Alfvén mode – 0 atl , entrapped in the neutron star crust as functions\nof multipole degree l at different values of the fractional depth h of peripheral seismogenic\ncrust. The value h = 1 corresponds to global torsional oscillations excited in the entire\n√\nvolume of the star. Here νA = ωA /2π, where ωA = vA /R with vA = B/ 4πρ being the\nvelocity of Alfvén wave in crustal matter of density ρ and PA = 2π/ωA .\npressure prevents the crust form gravitational contraction) this condition is certainly fulfilled\n(e.g. Chanmugham 1992). However, this is may not be the case for much denser matter of\nthe neutron star cores, because its micro-composition is dominated, according to canonical\nnotion of the neutron star, by degenerate Fermi-matter of non-relativistic neutrons (whose\npressure is responsible for the neutron star gravitational equilibrium) – the electrically neutral\nFermi-particles endowed with intrinsic spin magnetic moments. This latter property of\nneutrons suggests that the degenerate Fermi-material of the neutron star cores can be brought\nto gravitational equilibrium in the magnetically ordered state of paramagnetic permanent\nmagnetization caused by Pauli's mechanism of field-induced polarization of spin magnetic\nmoment of neutrons along the axis of frozen in the core fossil magnetic field. It is just the\ncase when the non-conducting core matter is capable of sustaining homogeneous magnetic\nfield, but is unable to support Alfvén oscillations. The structure of such paramagnetic\nneutron star model, which is extensively discussed in (Bastrukov et al 2002a, 2002b, 2003)\n\n\f– 12 –\n\nω/ωA\n\n100\n\n1\nl=1\nl=2\nl=3\nl=10\nl=50\n\n0.01\n0\n\n0.2\n\n0.4\n\n0.6\n\n0.8\n\n1\n\nh\nFig. 5.- Fractional frequency of nodeless torsional Alfvén oscillations of indicated overtone\nl as a function of the fractional depth h of peripheral seismogenic layer. The vanishing\nof dipole overtone in the limit of h → 1, the case when entire mass of neutron star sets\nin torsional oscillations about dipole magnetic moment of the star value exhibits behavior\nwhich is typical for Goldstone's soft modes.\nis schematically pictured in Fig. 6.\nIt worth noting that internal constitution of such a star does not exclude the existence\nof a fairly thin inner crust which is predominately composed of boson matter whose microconstituents are paired neutrons with average density several times less than the normal\nnuclear density, 0.1 − 0.5ρN . Such a matter permits Bose-condensate state having some\nfeatures in common with that generic to weakly compressed superfluid liquids. Understandably that such boson fraction of neutron matter, however, can only insufficiently contribute\nto the total mass budget of neutron star, because Bose-matter is unable to withstand the\npressure of self-gravity, contrary to the degenerate neutron Fermi-matter whose pressure of\ndegeneracy counterbalancing the self-gravity pressure is central to the very notion of neutron\nstar. The physical importance of thin inner crust is, most likely, in that it operates like a lubricant facilitating differentially rotational shear of conducting crust relative to much denser\nparamagnetic core. From the view point of this model, the coupling between core and crust\nis one and the same of physical nature of magnetic cohesion as that operating between samples of terrestrial metal and permanent magnet which is mediated by the lines of magnetic\nforce. The idea of decisive role of magnetic core-crust cohesion seems to be in line with\nthe starquake model of the magnetar burst (Woods and Thompson 2006) which is though\nof as disruption of magnetic field lines in the process of explosive release of magnetic field\nstresses fracturing the neutron star crust. The presented line of argument (while admittedly\n\n\f– 13 –\n\nPARAMAGNETIC NEUTRON STAR\n\nFig. 6.- The internal constitution of two-component, core-crust, model of paramagnetic\nneutron star model. The core is considered as a poorly conducting permanent magnet composed of degenerate Fermi-gas of non-relativistic neutrons in the state of paramagnetic saturation caused by Pauli's paramagnetism – field-induced alignment of spin magnetic moment\nof neutrons along the axis of uniform internal and dipolar external magnetic field frozen in\nthe star on the stage of gravitational collapse of its massive progenitor. A highly conducting\nmetal-like material of crust, composed of nuclei suspended in the degenerate Fermi-gas of relativistic electrons, is regarded as magneto-active electron-nuclear solid-state plasma capable\nof sustaining Alfvén oscillations.\nspeculative, but no more than any other considerations touching upon the internal structure\nof neutron stars) shows what inference can be made regarding electromagnetic properties of\nsuper dense stellar matter from asteroseismic model of Lorentz-force-driven torsional Alfvén\nnodeless oscillations entrapped in the finite-depth crust, provided of course that the above\nderived two-parametric spectral formula properly describe observational data on oscillating\nelectromagnetic emission from quaking neutron star. In the next section we assess this conjecture by applying the derived theoretical spectrum to modal l-pole classification of QPOs\nin the X-ray flux during the flare of SGR 1806-20 and SGR 1900+14.\n\n\f– 14 –\n4.\n\nQPOs in the X-ray flux during the flare of SGR 1806-20 and SGR 1900+14\nfrom the viewpoint of above asteroseismic model\n\nThe physics behind interconnection between oscillating lines of magnetic field frozen in\nthe star and quasi-periodic oscillations of detected electromagnetic flux has been recognized\nlong ago (e.g. van Horn 1980, Blaes et al 1988) – the quake-induced perturbation excites\ncoupled oscillations of perfectly conducting matter and the lines of frozen-in magnetic field\nwhich outside the star operates as transmitters of beam of charged particles producing coherent radiation from the neutron star magnetosphere, so that the frequency of Alfvén seismic\noscillations is considered to be equal to the frequency of quasi-periodic variations of the beam\ndirection; this asteriseismic argument regarding physical nature of quasi-periodic oscillations\nis applicable to both radio emission from glitching pulsars and high-energy emission from\nbursting magnetars.\n240\n200\n\nSGR 1900+14\n\nν, Hz\n\nνdata\nAlfven toroidal mode\n\n100\nνA = 9.8 Hz, h = 0.6\n\n0\n300\nSGR 1806-20\nνdata\n\nν, Hz\n\n200\n\nAlfven toroidal mode\n\n100\nνA = 9.4 Hz, h = 0.6\n\n0\n\n0\n\n5\n\n10\n\n15\n\nl\n\nFig. 7.- Theoretical fit of the QPOs frequency in the X-ray flux during the flare of SGRs\n1806-20 and 1900+14 by the obtained two-parametric spectral equation for the frequency of\nnodeless torsional magneto-solid-mechanical oscillations entrapped in the peripheral finitedepth crustal region of a neutron star with homogeneous internal and dipolar external magnetic field.\nAs was noted in our previous study of global Alfvén oscillations in the entire volume of\nneutron star with homogeneous internal and dipolar external field (Bastrukov et al 2009),\nit is impossible reconcile one-parametric frequency spectrum ν(0 atl ) plotted as a function of\nmultipole l, given by equation (37), with the observed QPOs frequencies (measured in Hz),\n\n\f– 15 –\nwhich, according to compilation by Sotani et al (2008), for SGR 1806-20 are 18, 26, 29, 92,\n150, 625, 1837, and for SGR 1900+14 these are 28, 54, 84, 155. Bearing this in mind, one\ncan attempt to fit the detected QPOs on the basis of derived here two-parametric spectral\nequation for torsional Alfvén nodeless oscillations entrapped in the finite-depth peripheral\ncrust. The adjustable parameters of such a fit are the Alfvén frequency νA and the fractional\ndepth of seismogenic layer h. The suggested l-pole identification is summarized in Figs. 7\nand 8. One sees that at indicated in this figures parameters, the model adequately regain the\ngeneral tendency in the data on QPOs frequencies when l are specified by integer numbers\nclearly recognizable in ticks of x-axis of Fig. 7. Deserved for special comment is that the\nlow-frequency QPOs in data for SGR 1806-20, are fairly reasonably interpreted as dipole and\nquadrupole overtones of torsional magnetic Alfvén nodeless vibrations, namely, ν(0 at1 ) = 18\nand l(0 at2 ) = 26 Hz. The high-frequency kilohertz vibrations with 627 Hz and 1870 Hz in\nthe QPOs spectrum of SGR 1806-20 highlighted in Fig.8 are unambiguously specified as\nhigh-multipole overtones, namely, as ν(0 atl=42 ) = 627 Hz and ν(0 atl=122 ) = 1870 Hz.\n5000\nSGR 1806-20\nν, Hz\n\n1000\nνdata\nAlfven toroidal mode\n\n100\nνA = 9.4 Hz, h = 0.6\n\n10\n\n0\n\n50\n\n100\n\n150\n\nl\n\nFig. 8.- The same as Fig.7, but for only SGRs 1806-20 with account for high-frequency\nQPOs.\nFrom the indicated in these figures values of νA = (1/2π)vA /R it follows that the\naverage speed of Alfvén wave vA in the crustal matter falls in the range 107 < vA < 108 cm\nsec−1 and, thus, less than the average speed of elastic shear wave whose generally accepted\nvalue is ct ≈ 108 cm sec−1 . Also noteworthy is that the existence of free vibrations with\nfrequency ω = 2πν is determined by condition ωτ >> 1, as follows from equation (15), which\nis too fulfilled; but this of course does not mean that the conversion of energy of Alfvén\nseismic crustal vibrations into heat (thermal emission) is the dominant mechanism of their\nexponential damping. All the above suggests that considered model of torsional nodeless\nAlfvén oscillations locked in the crust, provides somewhat better account of the data on\nthe QPOs frequencies, as compared to the model of global torsional nodeless vibrations of\nmagnetar under combined action of elastic Hooke's and magnetic Lorentz forces (Bastrukov\n\n\f– 16 –\net al 2009).\n\n5.\n\nSummary\n\nThe neutron stars, both pulsars and magnetars, are seismically active compact objects of\nthe end point of the evolutionary stellar track. They are, as is widely believed, to be formed\nin the magnetic-flux-conserving supernova collapse of the cores of massive stars coming\ninto existence, as sources of pulsed electromagnetic emission, with a fairly complex internal\nconstitution (e.g. Weber 1999, Bisnovatyi-Kogan 2002, Lattimer & Prakash 2007). The past\ntwo decades have seen increasing recognition that valuable tool of looking into the neutron\nstar interior provides asteroseimology. The explosive interest to current development of this\ndomain of pulsar astrophysics has been stimulated by the above mentioned discovery of\nquasi-periodic oscillations during the giant X-ray flares of SGR 1806-20 and SGR 1900+14,\nwhich has also prompted extensive investigations of radiative processes caused by ultrastrong magnetic fields of magnetars (e.g. Heyl & Hernquist 2005, Harding & Lai 2006,\nZhang et al 2007, Timokhin et al 2008, Bo Ma et al 2008, Rea et al 2008) and processes of\ntheir cooling (Yakovlev et al 2008).\nMany agree today that detected QPOs can be explained on the basis of asteroseismic\nmodels of a magnetar undergoing quake-induced torsional oscillations about its the dipole\nmagnetic-moment axis. Adhering to this attitude and taking into account that the main\nenergy source of bursting high-energy emission of magnetars is the immense store of the\nmagnetic field energy, we have set up and investigated one of such models interpreting the\nabove QPOs in terms of axisymmetric Alfvén nodeless oscillations of the crustal solid-state\nplasma about axis of homogeneous internal and dipolar external magnetic field frozen in the\nmotionless core. As is demonstrated in Figs. 7 and 8, the obtained two-parametric spectral\nequation of this model provides proper account of general trends in data on QPOs frequencies\nas well as quite reasonable their l-pole identification. The main argument in favor of such\ninterpretation is fairly accurate description of both the low-frequency (18 and 26 Hz) and\nhigh-frequency (627 and 1837 Hz) QPOs in X-ray flaring SGR 1806-20, which is presented\nin Fig.8, supporting the underlying this model conjecture about dominate role of Lorentz\nforce of magnetic field stresses in maintaining the nodeless torsional oscillations of perfectly\nconducting solid-state plasma entrapped in the peripheral finite-depth seismogenic zone of\nmagnetar.\nThe physically meaningful framework for discussion of considered scenario of post-quake\nrelaxation of magnetar provides the two-component, core-crust, model of quaking paramagnetic neutron star (Bastrukov et al 2002a, 2002b, 2003) which attributes the core matter\n\n\f– 17 –\nincapability of supporting Alfvén differentially rotational shear oscillations to poor electrical\nconductivity of central region of the star, considering the magnetar core as a motionless\nspherical bar magnet composed of degenerate Fermi-matter of non-relativistic neutrons with\nspin magnetic moments polarized along the uniform fossil magnetic field frozen in the star\non the stage of catastrophic contraction of its massive progenitor. Together with this, one\ncannot of course state that such an image of the quaking magnetar interior is unique, that is,\nthat the above QPOs cannot be explained by alternative conjectures about electrodynamic\nproperties of neutron star material, restoring forces and volumetric character of torsional\noscillations (e.g. Bastrukov et al 2007b 2008, 2009). One more of such uninvestigated alternatives is the regime of nodeless global differentially rotational vibrations of neutron star\nwith non-homogenous internal and dipolar external magnetic field presuming, thus, that\nstellar material in the total volume of magnetar possesses properties of perfect conductor.\nWe shall return to such a model of quaking neutron star in a forthcoming paper.\nThis work is a part of projects on investigation of variability of high-energy emission\nfrom compact sources supported by NSC of Taiwan, grant numbers NSC-96-2628-M-007012-MY3 and NSC-97-2811-M-007-003.\n\nREFERENCES\nAki K. & Richards P. G., 2002, Quantitative Seismology. University Science Books\nBastrukov S., Chen G.-T., Chang H.-K., Molodtsova I., & Podgainy, D., 2009, ApJ, 690, 998\nBastrukov, S. Chang, H.-K., Chen, G.-T. & Molodtsova I., 2008, Mod. Phys. Lett. A., 23,\n477\nBastrukov S., Chang H.-K., Mişicu Ş., Molodtsova I., & Podgainy D., 2007a, Int. J. Mod.\nPhys. A, 22, 3261\nBastrukov S., Chang H.-K., Takata J., Chen G.-T. & Molodtsova I., 2007b, MNRAS, 382,\n849\nBastrukov S., Molodtsova I., Podgainy D., Weber F. & Papoyan, V., 1999, PPN, 30, 436\nBastrukov S. I., Podgainy D. V., Yang J. & Weber F., 2002, MmSAI, 73, 522\nBastrukov S., Podgainy D., Yang J., & Weber F., 2002, JETP, 95, 789\nBastrukov S. I., Yang J., Podgainy D. V. & Weber F., 2003, J. Phys. G, 29, 683\n\n\f– 18 –\nBlaes O., Blandford R., Goldreich P. & Madau P., 1989, ApJ, 343, 839\nBisnovatyi-Kogan G. S., 2002, Stellar physics, Springer-Verlag\nBhattacharya D. & van den Heuvel E. P. J. 1991, Phys. Rep., 2003, 1\nBo Ma, Xiang-Dong Li, & Chen P. F., 2008, ApJ, 686, 492\nChandrasekhar S., 1961, Hydromagnetic and Hydrodynamic Stability. Oxford University\nPress\nChanmugam G., 1992, ARA&A, 30, 143\nFranco L. M., Link B. & Epstein R. I., 2000, ApJ, 543, 987\nGlampedakis K., Samuelsson L. & Andersson, N., 2007, Ap&SS, 308, 607\nHarding A. K. & Lai D., 2006, RPPh, 69, 2631\nHeyl J. S. & Hernquist L., 2005, MNRAS, 362, 777\nIsrael G. L., Belloni T., Stella L., Rephaeli Y., Gruber D. E., Casella P., Dall'Osso S., Rea\nN., Persic M. & Rothschild R. E., 2005, ApJ, 628, L53\nLattimer J.M. & Prakash M., 2007, PhR, 442, 109\nLay T. & Wallace T. C., 1995, Modern Global Seismology. Academic Press\nLee U., 2007, MNRAS, 374, 1015\nLee U., 2008, MNRAS, 385, 2069\nLevin Yu. 2007, MNRAS, 377, 159\nMcDermott P. N., Van Horn H. M. & Hansen C. J., 1988, ApJ, 325, 725\nMestel L., 1999, Stellar Magnetism. Clarendon Press, Oxford\nPotekhin A.Y. & Lai D., 2008, MNRAS, 376, 793\nRea N., Zane S., Turolla R., Lyutikov M. & Götz D., 2008, ApJ, 686, 1245\nSamuelsson L. & Andersson N. 2007b, Ap&SS, 308, 581\nSotani H., Kokkotas K. D. & Stergioulas N., 2007, MNRAS, 375, 261\nSotani H., Kokkotas K. D. & Stergioulas N., 2008, MNRAS, 385, L5\n\n\f– 19 –\nSpruit H. C., 2008, AIPC, 983, 391\nTimokhin A. N., Eichler D. & Lyubarsky Yu., 2008, ApJ, 680, 1398\nvan Horn, H. M., 1980, ApJ, 236, 899\nvan Hoven M. & Levin Y., 2008, MNRAS, 391, 283\nVavoulidis M., Kokkotas K. D. & Stavridis, A., 2008, MNRAS, 384, 1711\nWatts A. L. & Strohmayer T. E., 2006, ApJ, 637, L117\nWeber F., 1999, Pulsars as astrophysical laboratory for nuclear and particle physics. IOP\nWinget D. E. & Kepler S. O., 2008, Annu. Rev. Astron. Astrophys, 46, 157\nYakovlev D. G., Gnedin O. Y., Kaminker A. D. & Potekhin, A. Y., 2008, AIPC, 983, 379\nZhang C.M., Yin H.X., Zhao Y.H., Chang H.K. & Song, L.M. 2007, AN, 328, 491\n\nThis preprint was prepared with the AAS LATEX macros v5.2.\n\n\f"}