{"id": "http://arxiv.org/abs/1006.1929v3", "guidislink": true, "updated": "2011-01-25T14:40:39Z", "updated_parsed": [2011, 1, 25, 14, 40, 39, 1, 25, 0], "published": "2010-06-09T23:51:09Z", "published_parsed": [2010, 6, 9, 23, 51, 9, 2, 160, 0], "title": "Coherent quantum Boltzmann equations from cQPA", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1006.0960%2C1006.0197%2C1006.1438%2C1006.3891%2C1006.0595%2C1006.0559%2C1006.5195%2C1006.4198%2C1006.3010%2C1006.0719%2C1006.5814%2C1006.2506%2C1006.1381%2C1006.5651%2C1006.3628%2C1006.3804%2C1006.2101%2C1006.2697%2C1006.0910%2C1006.0136%2C1006.2933%2C1006.2216%2C1006.5044%2C1006.5250%2C1006.2058%2C1006.0942%2C1006.2199%2C1006.3999%2C1006.2125%2C1006.2964%2C1006.3962%2C1006.3468%2C1006.0398%2C1006.1929%2C1006.1011%2C1006.0302%2C1006.5249%2C1006.4997%2C1006.1698%2C1006.2281%2C1006.5100%2C1006.4400%2C1006.5547%2C1006.0622%2C1006.0929%2C1006.0839%2C1006.1864%2C1006.2311%2C1006.5692%2C1006.2440%2C1006.1112%2C1006.5383%2C1006.2791%2C1006.4112%2C1006.5949%2C1006.4123%2C1006.4894%2C1006.2259%2C1006.4866%2C1006.2627%2C1006.2324%2C1006.2683%2C1006.2235%2C1006.0521%2C1006.3055%2C1006.1206%2C1006.2704%2C1006.1904%2C1006.1911%2C1006.0119%2C1006.4185%2C1006.1602%2C1006.5116%2C1006.1513%2C1006.1477%2C1006.5470%2C1006.3125%2C1006.0534%2C1006.4926%2C1006.4202%2C1006.2441%2C1006.0809%2C1006.5599%2C1006.3399%2C1006.4572%2C1006.1555%2C1006.5074%2C1006.5669%2C1006.2717%2C1006.1552%2C1006.1303%2C1006.1001%2C1006.1258%2C1006.1115%2C1006.4719%2C1006.0525%2C1006.4111%2C1006.5033%2C1006.3108%2C1006.4001%2C1006.5329&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Coherent quantum Boltzmann equations from cQPA"}, "summary": "We reformulate and extend our recently introduced quantum kinetic theory for\ninteracting fermion and scalar fields. Our formalism is based on the coherent\nquasiparticle approximation (cQPA) where nonlocal coherence information is\nencoded in new spectral solutions at off-shell momenta. We derive explicit\nforms for the cQPA propagators in the homogeneous background and show that the\ncollision integrals involving the new coherence propagators need to be resummed\nto all orders in gradient expansion. We perform this resummation and derive\ngeneralized momentum space Feynman rules including coherent propagators and\nmodified vertex rules for a Yukawa interaction. As a result we are able to set\nup self-consistent quantum Boltzmann equations for both fermion and scalar\nfields. We present several examples of diagrammatic calculations and numerical\napplications including a simple toy model for coherent baryogenesis.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1006.0960%2C1006.0197%2C1006.1438%2C1006.3891%2C1006.0595%2C1006.0559%2C1006.5195%2C1006.4198%2C1006.3010%2C1006.0719%2C1006.5814%2C1006.2506%2C1006.1381%2C1006.5651%2C1006.3628%2C1006.3804%2C1006.2101%2C1006.2697%2C1006.0910%2C1006.0136%2C1006.2933%2C1006.2216%2C1006.5044%2C1006.5250%2C1006.2058%2C1006.0942%2C1006.2199%2C1006.3999%2C1006.2125%2C1006.2964%2C1006.3962%2C1006.3468%2C1006.0398%2C1006.1929%2C1006.1011%2C1006.0302%2C1006.5249%2C1006.4997%2C1006.1698%2C1006.2281%2C1006.5100%2C1006.4400%2C1006.5547%2C1006.0622%2C1006.0929%2C1006.0839%2C1006.1864%2C1006.2311%2C1006.5692%2C1006.2440%2C1006.1112%2C1006.5383%2C1006.2791%2C1006.4112%2C1006.5949%2C1006.4123%2C1006.4894%2C1006.2259%2C1006.4866%2C1006.2627%2C1006.2324%2C1006.2683%2C1006.2235%2C1006.0521%2C1006.3055%2C1006.1206%2C1006.2704%2C1006.1904%2C1006.1911%2C1006.0119%2C1006.4185%2C1006.1602%2C1006.5116%2C1006.1513%2C1006.1477%2C1006.5470%2C1006.3125%2C1006.0534%2C1006.4926%2C1006.4202%2C1006.2441%2C1006.0809%2C1006.5599%2C1006.3399%2C1006.4572%2C1006.1555%2C1006.5074%2C1006.5669%2C1006.2717%2C1006.1552%2C1006.1303%2C1006.1001%2C1006.1258%2C1006.1115%2C1006.4719%2C1006.0525%2C1006.4111%2C1006.5033%2C1006.3108%2C1006.4001%2C1006.5329&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We reformulate and extend our recently introduced quantum kinetic theory for\ninteracting fermion and scalar fields. Our formalism is based on the coherent\nquasiparticle approximation (cQPA) where nonlocal coherence information is\nencoded in new spectral solutions at off-shell momenta. We derive explicit\nforms for the cQPA propagators in the homogeneous background and show that the\ncollision integrals involving the new coherence propagators need to be resummed\nto all orders in gradient expansion. We perform this resummation and derive\ngeneralized momentum space Feynman rules including coherent propagators and\nmodified vertex rules for a Yukawa interaction. As a result we are able to set\nup self-consistent quantum Boltzmann equations for both fermion and scalar\nfields. We present several examples of diagrammatic calculations and numerical\napplications including a simple toy model for coherent baryogenesis."}, "authors": ["Matti Herranen", "Kimmo Kainulainen", "Pyry Matti Rahkila"], "author_detail": {"name": "Pyry Matti Rahkila"}, "author": "Pyry Matti Rahkila", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1007/JHEP12(2010)072", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1006.1929v3", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1006.1929v3", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "13 figures, 49 pages. Replaced with the published version. Typos and\n  misprints corrected. Improved coloring in some figures. One new chapter (6.1)\n  added. No changes on results", "arxiv_primary_category": {"term": "hep-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "hep-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "hep-th", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1006.1929v3", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1006.1929v3", "journal_reference": "JHEP 1012:072,2010", "doi": "10.1007/JHEP12(2010)072", "fulltext": "Preprint typeset in JHEP style - PAPER VERSION\n\nCoherent quantum Boltzmann equations from cQPA\n\narXiv:1006.1929v3 [hep-ph] 25 Jan 2011\n\nMatti Herranena , Kimmo Kainulainenb,c and Pyry Matti Rahkilab,c\na\n\nInstitut für Theoretische Teilchenphysik und Kosmologie,\nRWTH Aachen University, D–52056 Aachen, Germany\nb\nDepartment of Physics, P.O.Box 35 (YFL),\nFIN-40014 University of Jyväskylä, Finland,\nc\nHelsinki Institute of Physics, P.O. Box 64,\nFIN-00014 University of Helsinki, Finland.\ne-mail: herranen@physik.rwth-aachen.de, kimmo.kainulainen@jyu.fi,\npyry.rahkila@jyu.fi\n\nAbstract: We reformulate and extend our recently introduced quantum kinetic theory for\ninteracting fermion and scalar fields. Our formalism is based on the coherent quasiparticle\napproximation (cQPA) where nonlocal coherence information is encoded in new spectral\nsolutions at off-shell momenta. We derive explicit forms for the cQPA propagators in the\nhomogeneous background and show that the collision integrals involving the new coherence\npropagators need to be resummed to all orders in gradient expansion. We perform this\nresummation and derive generalized momentum space Feynman rules including coherent\npropagators and modified vertex rules for a Yukawa interaction. As a result we are able to\nset up self-consistent quantum Boltzmann equations for both fermion and scalar fields. We\npresent several examples of diagrammatic calculations and numerical applications including\na simple toy model for coherent baryogenesis.\nKeywords: Thermal Field Theory, Quantum Dissipative Systems, Statistical Methods.\n\n\fContents\n1. Introduction\n\n1\n\n2. cQPA for Fermions\n2.1 Approximations\n2.2 cQPA phase space structure\n2.2.1 Pole functions and thermal limit\n2.3 Quantum Boltzmann equations\n2.4 Resummed fermion collision term\n2.4.1 Consistent expansion and Σeff\n2.4.2 Collision integrals for the on-shell functions\n\n3\n4\n6\n8\n9\n11\n12\n14\n\n3. cQPA for scalar fields\n3.1 Phase space structure\n3.2 Equations of motion\n3.3 Resummed scalar collision term\n\n16\n17\n18\n20\n\n4. Momentum space Feynman rules\n4.1 Vertex rules\n\n21\n24\n\n5. Examples\n5.1 A two-loop example\n5.2 Direction independent Feynman rules\n5.3 Explicit 1-loop collision integrals for fermions\n\n28\n30\n32\n33\n\n6. Applications\n6.1 Error analysis\n6.2 A toy model for coherent baryogenesis\n\n36\n40\n41\n\n7. Conclusions and outlook\n\n43\n\n1. Introduction\nMany interesting problems in particle physics and cosmology involve coherent, relativistic quantum systems in out-of-equilibrium conditions, examples including the electroweak\nbaryogenesis [1–5], leptogenesis [6–9] and the out-of equilibrium particle production [10].\nWhile it may be straightforward to give a mathematical formulation for a given problem,\nfor example using the Schwinger-Keldysh method, it is often hard to find an approximation scheme that is accurate, but simple enough to be used in practical applications. We\n\n–1–\n\n\fhave recently developed a new transport theory for relativistic quantum systems including\nnonlocal coherence [11–13]. Our formalism is based on the observation [11] that in systems\nwith certain space-time symmetries the nonlocal coherence information is encoded in new\nspectral shell solutions for the dynamical 2-point functions at particular off-shell momenta.\nThe extended spectral structure of the two-point functions, the coherent quasiparticle approximation (cQPA) [14, 15], was first discovered in [11] and a complete transport theory\nwith collision terms for fermions was presented in [12] and for scalar fields in [13].\nIn refs. [11, 12] the fermionic transport theory was formulated using a convenient, but\nsomewhat less familiar spin-projected 2-component notation. Later, in refs. [14, 15] it was\nnoted that the collision integrals involving the coherence functions need to be resummed to\nall orders of the gradient expansion. In this paper we reformulate our formalism for fermions\nusing a more familiar 4-component Dirac notation, accompanied by a much more convenient\nparametrization of the coherence-shell solutions. We will also show that the resummation\nissue is much more generic than what was considered in [14,15]: a resummation is necessary\nfor all external and internal lines involving coherence propagators in the diagrammatic\nexpansion of all collision integrals appearing in the transport equations. Here we will show\nhow this resummation can be done such that all effects are absorbed into a redefinition\nof the effective coherence propagators. Using these results we develop an extension of the\nmomentum space Feynman rules for diagrammatic evaluation of self-energies and eventually\ncollision terms including quantum coherence effects. We will give a full discussion of single\nflavour fermion and real scalar fields, interacting via a Yukawa type of interaction. In\naddition to our extension of the usual Feynman rules to the coherent case, the main results\nof this paper include a derivation of simple, generic quantum Boltzmann equations (qBE)\nfor fermions and scalars. Fermionic equations couple the usual mass-shell distribution\nfunctions to new coherence functions with compact expressions for the collision integrals\nas traces over Dirac-matrix projections of generic self-energy functions. The scalar field\nqBE's on the other hand are cast into a form of a finite set of moment equations, again\nwith a well defined collision integral that can be evaluated diagrammatically by use of our\ncQPA Feynman rules.\nWe use our generalized Feynman rules to compute several perturbative self-energy diagrams in the Yukawa theory, including the full coherent fermion and scalar field self-energies\nat the one loop level. We also study a 2-loop example which bears resemblance to a more\ninvolved calculation with flavour mixing fields [16], necessary for a resonant leptogenesis\nproblem. These examples illustrate the ease of use of our formalism for diagrammatic evaluation of collision integrals involving the nonlocal quantum coherence effects. We also compute explicit expressions for the collision integrals following from the Yukawa interaction at\nthe one-loop level and interpret these results in terms of the mass-shell and coherence-shell\ncontributions in scattering (decay and inverse decay) processes. As a numerical application of our formalism, we solve the cQPA phase space distribution functions for a fermion\nwith a complex, homogeneous time varying mass parameter evolving smoothly from one\nphase to another, in presence of decohering interactions. These results illustrate the effect of collisions on the production and evolution of the coherence and particle numbers\nin the presence of interactions. We also build a toy model for coherent baryogenesis (see\n\n–2–\n\n\feg. ref. [17]) by assuming that the coherently evolving fermion ψ decays into the ordinary\nstandard model quarks. We compute the temporal evolution of the seed quark asymmetry\nand the ensuing baryon asymmetry and show that such a scenario, when embedded to a\nmore complete particle physics model, could be an attractive mechanism for baryogenesis.\nIn this paper we only consider the spatially homogeneous and isotropic problems.\nThis paper is organized as follows. In section 2 we briefly review the derivation of\nthe fermionic cQPA shell structure, and the equations of motion that follow from using\nthe cQPA structure as an ansatz in the full dynamical Kadanoff-Baym equations. We\nalso introduce a more convenient parametrization of the coherence propagators using the\nfamiliar 4-dimensional Dirac notation with projection operators. In section 2.4 we present\nthe resummation method giving rise to a consistent expansion of the fermion collision\nintegrals. In section 3 we repeat the analysis for scalar fields, and in section 4 we derive\nthe generalized Feynman rules for the computation of the resummed self-energies for a\nYukawa-theory. In section 5 we compute examples of the self-energy diagrams and collision\nintegrals and in section 6 we apply the formalism to a toy-model of a coherent baryogenesis.\nFinally, section 7 contains our conclusions and outlook.\n\n2. cQPA for Fermions\nWe will be using the Schwinger-Keldysh approach [18] to non-equilibrium quantum field\ntheory (for a review see ref. [19]). The basic objects of interest for us are the dynamical\nWightman functions1 S <,> :\niS < (u, v) = hψ̄(v)ψ(u)i\n\nand iS > (u, v) = hψ(u)ψ̄(v)i ,\n\n(2.1)\n\nwhere h. . .i ≡ Tr{ρ̂ . . .} denote the expectation values w.r.t. some unknown quantum\ndensity operator ρ̂. The time-ordered (Feynman) and anti-time-ordered (anti-Feynman)\n2-point functions are then related to the Wightman functions by\nSF (u, v) ≡ θ(u0 − v0 )S > (u, v) − θ(v0 − u0 )S < (u, v)\n\nSF̄ (u, v) ≡ θ(v0 − u0 )S > (u, v) − θ(u0 − v0 )S < (u, v) .\n\n(2.2)\n\nThe basic idea in the SK-approach is to write down a (Schwinger-Dyson) hierarchy of\nequations for all Greens functions in the theory, thus bypassing the need to define ρ̂ at all.\nThe main approximation is a truncation of this hierarchy to a closed set of equations for a\nrestricted set of correlators. In practice the truncation is often done already at the level of\nthe 2-point functions, assuming that the self-energy functions in the SK-equations can be\nevaluated perturbatively. In this case only the two Wightman functions (2.1) are needed\nget the closure2 . It is convenient to separate the internal and external scales by performing\nWigner transformations to the 2-point functions:\nZ\nS(k, x) ≡ d 4 r eik*r S(x + 2r , x − 2r ) ,\n(2.3)\n1\n\nNote that our sign-convention for S < is opposite to the usual one, see eg. ref. [5].\nGiven the Wightman functions, the spectral function is found from A = 2i (S > + S < ). After this the\nspectral relation SH (u, v) = −i sgn(u0 − v 0 )A(u, v) fixes the retarded and advanced correlators Sr,a ≡\nSH ± iA, which completes the maximal set of independent 2-point functions.\n2\n\n–3–\n\n\fwhere x ≡ (u + v)/2 is the average coordinate, and k is the internal momentum conjugate\nto the relative coordinate r ≡ u − v. It is straightforward to show [5, 12] that in the mixed\nrepresentation the correlators S <,> satisfy the Kadanoff-Baym equations [20]:\n(k\n/+\n\ni\n∂\n/ −m̂0 − im̂5 γ 5 )S <,> − e−i♦ {ΣH }{S <,> } − e−i♦ {Σ<,> }{SH } = ±Ccoll ,\n2 x\n\n(2.4)\n\nwhere \"+\" refers to \"<\" and \"−\" to \">\" . The collision term is given by\n\u0001\n1\nCcoll = e−i♦ {Σ> }{S < } − {Σ< }{S > } ,\n2\n\n(2.5)\n\nwhere the ♦-operator is the following generalization of the Poisson brackets:\n♦{f }{g} =\n\n1\n[∂x f * ∂k g − ∂k f * ∂x g] .\n2\n\n(2.6)\n\nWe are interested in problems where a complex mass function can be spatially or temporally\nvarying m ≡ mR (x) + imI (x), whereby the nontrivial mass operators m̂0 and m̂5 appear\nin Eq. (2.4). Their action on S-functions is defined as:\ni\n\nm *∂ S\nk\n\nm̂0,5 S(k, x) ≡ mR,I (x)e− 2 ∂x\n\nS(k, x) .\n\n(2.7)\n\nThe self-energies Σ are some complicated functionals of the correlators S <,> , and they\ncan be computed using some explicit truncation scheme, such as the 2PI effective action\nin loop expansion [19, 21]. From Eq. (2.4) we immediately see that the spectral function\nA = 2i (S > + S < ) obeys an equation identical to Eq. (2.4), but with a vanishing collision\nterm. In addition the spectral function needs to satisfy the sum-rule:\nZ\ndk0\nA(k, x)γ 0 = 1 ,\n(2.8)\nπ\nwhich follows for example from the equal time anti-commutation relations of the fermionic\nfields. We will later see that this constraint is strong enough to completely fix the spectral\nfunction in our approximation scheme. Equations (2.4) for S < and A, together with the\nsum-rule (2.8) form a complete set of equations when the interactions (a scheme to compute\nΣ) and the mass profiles are specified. In practice, these equations are too hard to be\nsolved in their full generality, and several approximations are needed to find a solvable set\nof equations.\n2.1 Approximations\nThe usual kinetic approach to non-equilibrium quantum field theory [5, 19, 22] considers\nweak interactions and slowly varying classical backgrounds. In this case the excitation\nspectrum of the system can be reasonably approximated by a singular shell structure and\nthe KB-equations (2.4) reduce to Boltzmann equations for the on-shell excitations called\nquasiparticles. Moreover, the standard approach typically makes the assumption that the\nsystem is, as a consequence of being close to a thermal equilibrium, nearly translation\ninvariant. This implies that the phase space singularity structure is also essentially the\n\n–4–\n\n\fsame as in thermal equilibrium. The key idea leading to the coherent quasiparticle approximation [11–15] scheme is to relinquish the assumption of nearly translation invariance.\nThe ensuing new solutions which describe the nonlocal quantum coherence are typically\noscillatory in the space and time coordinates in quantum scales x ∼ k −1 , which explicitly\nviolates the translation invariance. To find the cQPA we make the following approximations\nto Eqs. (2.4):\n1) We neglect the terms ∝ SH on the LHS of the KB-equations (2.4).\n2) We neglect the terms ∝ ΣH on the LHS of the KB-equations (2.4).\n3) We consider the spatially homogeneous and isotropic case with ∇S < = 0.\nThe first approximation above is made also in the standard kinetic theory and it should\nbe reasonable at least in the limit of weak interactions. It has been shown that for a\nscalar field close to thermal equilibrium the neglected terms are of higher order in the\ninteraction rate Γ than the dominant contribution from the collision term [5]. From the\npractical point of view, these terms must be neglected in order to find a singular phase space\nstructure for the spectral function, even in the usual Boltzmann approach. The second\napproximation is made only for simplicity; the ΣH corrections would merely give rise to\nmodified dispersion relations for the quasiparticles, but not change the generic structure\nof the theory. These terms could be incorporated later on. The third assumption on the\nother hand is crucial. The simple spectral structures for the coherence solutions, which\nis the heart of the cQPA, arise only in systems with particular space-time symmetries,\nincluding spatially homogeneous and isotropic, and stationary planar symmetric cases [11].\nThis paper is devoted to the former of these symmetries.\nWith the approximations 1-3 the KB-equations (2.4) can be reduced and decomposed\ninto the following Hermitian (H) and anti-Hermitian (AH) parts:\n(H) :\n(AH) :\n\n†\n)γ 0\n2k0 S̄ < = Ĥ S̄ < + S̄ < Ĥ † + iγ 0 (Ccoll − Ccoll\n\ni∂t S̄\n\n<\n\n<\n\n<\n\n†\n\n0\n\n= Ĥ S̄ − S̄ Ĥ + iγ (Ccoll +\n\n†\n)γ 0 ,\nCcoll\n\n(2.9)\n(2.10)\n\nwhere we defined a hermitian Wightman function S̄ < ≡ iS < γ 0 , and the operator\nĤ ≡ k * α + γ 0 m̂0 + iγ 0 γ 5 m̂5\n\n(2.11)\n\ncan be interpreted as a local free field Hamiltonian. Because of the spatial homogeneity\nthe mass functions mR,I (t) depend now only on time. Note that in the collisionless limit\n(Ccoll → 0) and in the zeroth order in gradients (m̂0,5 → mR,I ) only the AH-equation\ncontains an explicit time derivative of S < , while the hermitian equation becomes a purely\nalgebraic matrix equation. For this reason Eq. (2.10) is called a \"kinetic equation\", and\nit describes the time evolution of the Wightman function S < . The role of the hermitian\n\"constraint equation\" (2.9) on the other hand is to restrict the phase space structure of\nS<.\nEven after approximations 1-3 the resulting equations (2.9-2.10) remain formidable to\nsolve. Note in particular that they still involve the mass operators containing terms which\n\n–5–\n\n\fare of arbitrarily high order in gradients. In order to find a tractable set of equations we\nwill make the following two additional approximations:\n4) We will expand the non-dynamical KB-equation (2.9) to the zeroth order in the\nscattering width Γ = 2i (Σ> + Σ< ) and the mass gradients ∂t m. This gives rise to the\nsingular cQPA phase space structure.\n5) We insert the singular cQPA structure as an ansatz to the dynamical KB-equation (2.10),\nand expand also this equation to the lowest nontrivial order in Γ and ∂t m.\nAs we shall find out in the subsection 2.2 below, the cQPA phase space structure contains\ntwo independent mass-shell distribution functions fmh± and two coherence distribution\nfunctions fch± for each helicity h. When this shell structure is fed into the dynamical\nequation (2.10) and the equation is integrated over k0 , it reduces to the sought after\nquantum Boltzmann equations for the on-shell functions fα . We shall derive these equations\nin the subsection 2.3. However, because the coherence-shell functions are rapidly oscillating\nin time, a special care is needed when expanding the collision terms in these equations. A\nnovel resummation scheme that gives a consistent expansion of the collision integrals to\nleading order in Γ and ∂t m will be introduced in section 2.4.\n2.2 cQPA phase space structure\nThe most general fermionic 2-point function S(k, t) consistent with spatial homogeneity\nand isotropy consists of the terms with products of γ 0 , k * γ and γ 5 only, and thus spans 8\nof 16 independent components of the full Dirac algebra. Furthermore, we observe that the\nhelicity operator: ĥ = (k * γ 0~γ γ 5 )/|k|, commutes with the Hamiltonian (2.11), implying\nthat different helicity projections of S < do not mix in a collisionless theory, i.e. helicity is\na good quantum number. For this reason, it is convenient to decompose the 8 independent\ncomponents of the 2-point function S < (k, t) in terms of helicity projectors: Ph = 21 (1+hĥ),\nh = ±1 to get:\niS < (k, t) =\n\n1 X\nPh [γ 0 gh0 + hk̂ * γ gh3 + gh1 + iγ 5 gh2 ] ,\n2\n\n(2.12)\n\nh=±1\n\nwhere ghα (k, t) are the 8 real scalar components. Using the the chiral (Weyl) representation\nof the Dirac algebra: γ 0 = σ 1 ⊗1, ~γ = iσ 2 ⊗~σ and γ 5 = −σ 3 ⊗1, the helicity block-diagonal\nWightman function in Eq. (2.12) can be written as\nS̄ < (k, t) =\n\nX\nh=±1\n\n1\ngh< (k, t) ⊗ (1 + hk̂ * σ) ,\n2\n\n(2.13)\n\n\u0001\n<\n< i\nwhere the Bloch representation of chiral part is just gh< ≡ 12 gh0\n+ ghi\nσ .\nWe now proceed to step 4 in our approximation scheme and analyze the constraint\nequation (2.9) in the zeroth order in Γ ∼ Σ<,> (neglecting the collision term) and ∂t m. Inserting this decomposition into the constraint equation (2.9) reduces it to two independent\n\n–6–\n\n\fhomogeneous matrix equations for the helicities h = ±1 (note that the index ordering is\nhere defined as α = 0, 3, 1, 2):\n\n\nk0 h|k| −mR mI\n h|k| k\nX\n0\n0 \n\n\n0\n<\n(Bh )αβ ghβ\n= 0,\nBh = \n(2.14)\n.\n −mR 0\nk0 0 \nβ\nmI\n0\n0 k0\nEquation (2.14) may have nontrivial solutions only if\n\u0001\ndet(Bh ) = k 2 − |m|2 k02 = 0 .\n\n(2.15)\n\nThis constraint gives rise to a singular shell structure, because the solutions need to be\nproportional to either δ(k02 − k2 − |m|2 ) or δ(k0 ). The full matrix structure of the corresponding singular solutions can then be worked out by setting k0 6= 0 and k0 = 0 in\nEq. (2.14), respectively, so that the combined solution is eventually found to be [11, 12]:\nX \u0014\n<\n<\n2\n2\niS (k, t) =\nPh 2π sgn(k0 )(k\n/ + mR − iγ 5 mI )fmh\nsgn(k0 ) δ(k − |m| )\nh\n\nh\n\n+π k̂ * γ\n\n\u0010m\n\nR\n\n|k|\n\n<\nfh1\n\n\u0015\ni\nmI < \u0011\n<\n5 <\n+\nf\n+ fh1 − iγ fh2 δ(k0 ) .\n|k| h2\n\n(2.16)\n\nHere the first line is the standard one-particle mass-shell solution with dispersion relations\nk0 = ±ωk ≡ ±(k2 +|m|2 )1/2 , while the second line is a new coherence solution living at shell\n<\nk0 = 0. The real mass-shell distribution functions fmh±\n(k, t) can be related to the phase\nspace densities for particles and antiparticles via the Feynman-Stückelberg interpretation3 :\n<\nnkh (t) = fmh+\n(k, t)\n\n<\nn̄kh (t) = 1 − fmh−\n(−k, t)\n\n(2.17)\n\n<\n(k, t) describe nonlocal quantum\nand the new (real) k0 = 0-shell distribution functions fh1,2\ncoherence between these modes. The representation (2.16) for S < was derived in refs. [11,\n12]. For our purposes here it is actually more convenient to reparametrize the k0 = 0\ncoherence-shell functions as follows:\n\u0014\n\u0015\n\u0010m\nωk2\nih \u0010\nmI < \u0011\u0011\nR <\n<\n<\n<\nfch± ≡\nf ∓\n|k|fh2 + mI\nf +\nf\n.\n(2.18)\n|k| h1 |k| h2\n2(ωk2 − m2R ) h1 ωk\n\nUsing these new functions the Wightman function Eq. (2.16) becomes\niS < (k, t) = 2π\n\nX\nh±\n\n±\n\n1\nPh (k\n/± + mR − iγ 5 mI )\n2ωk\nh\n\u0010\ni\nmR \u0011 <\n<\n× fmh±\nδ(k0 ∓ ωk ) + γ 0 ∓\nfch± δ(k0 ) ,\nωk\n\n(2.19)\n\nμ\nwhere we denote k±\n= (±ωk , k). The complete singular phase space structure (2.19) is the\ncoherent quasiparticle approximation for S < .\n\n3\n\nWe associate the negative energy states with the CP- rather than C conjugates to the positive energy\nstates: n̄kh ≡ (nkh )CP .\n\n–7–\n\n\fA note on conventions. The shell functions appearing in Eq. (2.19) are labelled by three\nindices: j = m, c referring either to mass- or coherence-shell, h = ±1 referring to helicity,\nand ± referring to the positive and negative energy. These indices will be appearing, always\nin this order, in many other constructs throughout the paper. Sometimes one or the other\nof the indices is to be summed over, and in order to suppress the notational clutter we will\nalways use an implied summing convention, where a non-displayed index is summed over.\nThat is, we use for example\nX\n\nQjh± =\n\nX\n\njh±\n\nQjh =\n\nX\n\nQj = Q ,\n\n(2.20)\n\nj\n\njh\n\nwhere Q can be for example S <,> , f <,> or any other construct defined using them.\nNote that the time dependence of the on-shell functions fα is not defined yet; in the\nnext section we will use the cQPA structure as an ansatz in the dynamical equation (2.10)\nto derive the generalized quantum Boltzmann equations for fα . First however, we have to\ndetermine the cQPA propagators also for the function S > , the spectral function and the\npole propagators.\n2.2.1 Pole functions and thermal limit\nIn the collisionless limit S > and the spectral function A = 2i (S > + S < ) satisfy the same\nconstraint and kinetic equations as S < . The spectral solution must then be identical to\nA for both helicities. However, the\nEq. (2.19) with four yet undefined on-shell functions fhα\nspectral function must in addition satisfy the sum rule (2.8), which completely fixes these\nA\nA = 0 [11]. The spectral function then reduces to the familiar\n= 12 and fch±\nfunctions: fmh±\nform:\nA(k, t) = πsgn(k0 )(k\n/ + mR − iγ 5 mI )δ(k 2 − |m|2 ) .\n(2.21)\nThe retarded and advanced propagators are directly related to the spectral function:\nSr,a (u, v) = ∓2i θ(±(u0 − v0 ))A(u, v), so that they are also given by their standard expressions:\n/k + mR − iγ 5 mI\nSr,a (k, t) = 2\n.\n(2.22)\nk − |m|2 ± isgn(k0 )\u000f\nNext, the relation A = 2i (S > + S < ) together with Eqs. (2.19) and (2.21) completely specify\nS > ; it has an expression identical to Eq. (2.21), where the on shell functions are given by\n>\n<\nfmh±\n= 1 − fmh±\n\nand\n\n>\n<\nfch±\n= −fch±\n.\n\n(2.23)\n\nThus, the four on-shell functions fα< are the only dynamical variables in the cQPA; all\nother 2-point functions can be expressed in terms of these. For this reason we only need\nto consider the dynamical equations for S < and the on-shell functions fα< .\nLet us stress that the new coherence solutions appear only in the dynamical functions\nS <,> in the cQPA, but not in the spectral function A or in the pole propagators Sr,a . This\nis quite natural, as it merely expresses the fact that there cannot be coherence without the\ninterfering mass-shell excitations; coherence is a purely dynamical phenomenon. Of course\n\n–8–\n\n\fthe Feynman and anti-Feynman propagators do have well defined coherence contributions\nthat can be computed from their respective definitions:\nSF = Sr − S <\n\nSF̄ = −Sa − S < .\n\n(2.24)\n\nTo conclude this section we note that in thermal equilibrium limit the full translation invariance kills the coherence-shell contributions also from the Wightman functions S <,> [11].\nMoreover, the thermal density operator implies Kubo-Martin-Schwinger (KMS) relation\n> (k ) = eβk0 S < (k ), which fixes the remaining mass-shell functions to Fermi-Dirac\n[23]: Seq\n0\neq 0\n<\ndistribution: fmh±\n→ feq (±ωk ) ≡ 1/(e±βωk + 1). This reduces S < to the standard thermal\nform [24]:\n<\niSeq\n= 2π sgn(k0 )(k\n/ + mR − iγ 5 mI ) feq (k0 ) δ(k 2 − |m|2 ) .\n(2.25)\nThe thermal limits of the other standard propagators can then be found by using the\ngeneral relations given above.\n2.3 Quantum Boltzmann equations\nAs the final step in our approximation scheme, we insert the spectral cQPA-solution (2.19)\nas an ansatz into the kinetic equation (2.10). This will lead to a closed set of equations of\n<\n. Let us first define a useful shorthand notation:\nmotion for the dynamical variables fhα\niS < ≡ 2π\n\nX\nh±\n\n<\n<\n(Smh±\nδ(k0 ∓ ωk ) + Sch±\nδ(k0 )) ,\n\n(2.26)\n\n<\nare easily read off from Eq. (2.19). Inserting this\nwhere the spin-matrix functions Sjh±\nform to the kinetic equation (2.10) and integrating over k0 we find the master equation:\n†\niγ 0 ,\n∂t S̄ < = −i[H, S̄ < ] + γ 0 hCcoll + Ccoll\n\nwhere we denoted h. . .i ≡\n\nR\n\ndk0\n2π\n\n(. . .) and, in accordance with the notation (2.26):\n\nhS̄ < i = S̄ < =\nwhere\n\n<\nS̄jh±\n\n≡\n\n<\nSjh±\nγ0.\n\n(2.27)\n\nX\n<\n<\n(S̄mh±\n+ S̄ch±\n),\n\n(2.28)\n\nh±\n\nNote that all k0 -derivatives in the operator Ĥ have vanished in the\n\nintegration process as total derivatives, reducing Ĥ to the usual local Hamiltonian:\nH = k * α + γ 0 mR + iγ 0 γ 5 mI .\n\n(2.29)\n\nThe master equation (2.27) is in fact the most compact form of the quantum transport\nequations in the cQPA scheme. One can see that the lowest moment of the correlation\nfunction, hS̄ < i = S̄ < , corresponds to a density matrix in the Dirac indices, and what\nremains to be done is to express the collision term in Eq. (2.27) in terms of the degrees\nof freedom included in S̄ < . This is of course not possible in general, but it can be done\nin the context of the spectral cQPA ansatz. In the case of fermions it is convenient to\ngo further than just computing the collision matrices however, and rewrite Eq. (2.27) as\n\n–9–\n\n\fa set of scalar Boltzmann equations for the on-shell functions fα , in exact analogy to the\nordinary Boltzmann equation.\nWe begin by writing the integrated correlation function S̄ < as (we will drop the superscript < on fα when there is no risk of confusion):\nh\ni\nX\nS̄ < =\nPh Pk± fmh± + Rk± fch± ,\n(2.30)\nh±\n\nwhere\n\nH\u0011\nmR\n1\u0010\n1±\nand Rk± ≡ γ 0 ∓\n.\n(2.31)\n2\nωk\nωk\nHere Pk± are positive and negative energy projection operators. Indeed, using the the\nidentity H 2 = ωk2 one can easily show that HPk± = ±ωk Pk± and then\nPk± ≡\n\n2\nand Pk±\n= Pk± .\n\nPk+ Pk− = Pk− Pk+ = 0\n\n(2.32)\n\nMoreover, the coherence matrix Rk± and energy projectors Pk± obey the relations:\nPk± Rk± = Rk∓ Pk∓ = Pk± γ 0 Pk∓ ,\n\n(2.33)\n\nwhere the last equality follows from the anticommutator {H, γ 0 } = 2mR . The matrix Rk±\nis not a projector, but combined with the energy projector it acts as an effective projector\nonto the coherence solution under the trace operation, such that the on-shell functions fα\ncan be solved from Eq. (2.30) tracing over Dirac algebra:\ni\nh\nfmh± = Tr Pk± Ph S̄ <\ni\nh\n(2.34)\nfch± = ξk Tr Rk± Pk± Ph S̄ < ,\nwhere ξk ≡ ωk2 /(ωk2 − m2R ). The equations of motion for the on-shell functions fhα can\nnow be obtained from the master equation (2.27) by forming the appropriate traces, or\nalternatively by taking time-derivatives of Eqs. (2.34) and using the kinetic equation (2.27)\nfor ∂t S̄ < , the identities (2.32-2.33) and finally computing the traces over Dirac algebra.\nAfter some algebra one finds the sought after quantum Boltzmann equations:\n1\n∂t fmh± = ± (Φ0kh+ fch+ + Φ0kh− fch− ) + Cmh± [fα ]\n2\nhm\ni\n1\nR\nfch± − ∆fmh + Cch± [fα ] ,\n∂t fch± = ∓i2ωk fch± + ξk Φ0kh∓\nωk\n2\n\n(2.35)\n(2.36)\n\nwhere ∆fmh ≡ fmh+ − fmh− and all dependence on the mass gradients is encoded in\nΦ0kh± ≡\n\n\u0010 m \u00110\nR\n\nωk\n\n± ih\n\n|k|m0I\n.\nωk2\n\nAfter using cyclicity of trace the collision integrals Cjh± can be written as:\nh\ni\n†\nCmh± [fα ] = Tr γ 0 hCcoll + Ccoll\niγ 0 Pk± Ph ,\nh\ni\n†\nCch± [fα ] = ξk Tr γ 0 hCcoll + Ccoll\niγ 0 Rk± Pk± Ph .\n\n– 10 –\n\n(2.37)\n\n(2.38)\n(2.39)\n\n\fEqs. (2.35-2.36) together with the collision integrals (2.38-2.39) form a closed set of equations of motion for the on-shell functions fα , once the self-energy functionals Σ<,> appearing in the collision integrals are specified. Beyond the introduction of the convenient\n4-dimensional notation, the main contribution of this paper is to show how the collision\nterms (2.38-2.39) can be consistently computed to a given (lowest) order in gradients and\ncoupling constants. As we shall see, this is a nontrivial task due to the need for resummation of the coherence propagators, which eventually leads to a new set of momentum space\nFeynman rules.\n2.4 Resummed fermion collision term\nThe basic quantity appearing in the projected collision terms (2.38-2.39) is the zeroth\nmoment of the collision term hCcoll i. We shall now carefully explain how this quantity can\nbe expanded consistently to the leading order in the interaction width and the gradient of\nthe mass function, denoted by O1 ≡ O(Γ, ∂t m). Let us begin with a straightforward, but\nlimited in validity, derivation using the mixed space representation:\n1\nhCcoll i =\n2\n\nZ\n\ndk0 −i♦\ne ({Σ> (k, t)}{S < (k, t)} − {Σ< (k, t)}{S > (k, t)}) .\n2π\n\n(2.40)\n\nNaively, one would simply truncate the ♦-expansion to the lowest order, as was done in\nrefs. [11–13]. However, it was later realized that because of their oscillatory behaviour\nthe coherence-shell functions contribute to the leading order term at all orders of the ♦expansion [14, 15]. We can see this quite easily when we observe that to order O1 the\nequations of motion (2.35-2.36) imply that ∂t fmh± = 0 and ∂t fch± = ∓ 2iωk fch± . This\nholds true also for the full mass-shell and coherence-shell Wightman functions (in the\ndistribution sense):\n<\n∂t Sm±\n= O1 ,\n\n<\n<\n∂t Sc±\n= ∓ 2iωk Sc±\n+ O1 ,\n\n(2.41)\n\nP\n<\n<\nwhere S < ≡\n± (Sm± + Sc± ) in accordance with the notation (2.20). If we make the\nadditional assumption that ∂t Σ ∼ O2 , it is easy to show that (−i♦)p {Σ> (k, t)}{S < (k, t)} =\n<\n((±ωk ∂k0 )p Σ> )Sc±\n+ O2 when p ≥ 1. That is, we can use the naive expansion for the massshell part, but for the coherence-shell part we have to replace the −i♦-operator by ±ωk ∂k0\nacting only on the self-energy function Σ> :\n1X\nhCcoll i ≈\n2 ±\n\nZ\n\n\u0011\ndk0 \u0010 > <\n<\nΣ Sm± + (e±ωk ∂k0 Σ> )Sc±\n− (> ↔ <) ,\n2π\n\n(2.42)\n\nwhere we have dropped all terms of order O2 or higher. We can now see that the exponential\ngradient operator in Eq. (2.42) precisely translates the self-energy functions associated with\nthe coherence solutions Sc± from the actual k0 = 0 shell to the corresponding mass shells.\nThis feature will persist also in the more accurate treatment where the smallness of ∂t Σ is\nnot assumed.\n\n– 11 –\n\n\f2.4.1 Consistent expansion and Σeff\nEquation (2.42) consistently accounts for the resummation of all zeroth order gradient\ncorrections from an external coherence-shell propagator in the collision integral. This\nintroduces a correction to the naive gradient expansion of Eq. (2.40). It is easy to see\nthat the same issue is encountered with the coherence propagators that appear in the\nperturbative expansion of the self-energy Σ. Indeed, whenever the time derivative acts\non an internal coherence propagator in Σ, it returns as a leading term that propagator\nmultiplied by ±2iωq , where ωq is the energy associated with the propagator. Such terms do\nnot contain any gradient suppression and the assumption ∂t Σ ∼ O2 made below Eq. (2.41)\nfails. Thus, we need a resummation scheme also for the coherence contributions inside Σ,\nbefore a consistent gradient expansion for hCcoll i can be established. We shall now formulate\na general method of expanding hCcoll i consistently to the leading order. To this end, it is\nconvenient to rewrite Eq. (2.40) in terms of the (partially transformed) coordinate space\nfunctions:\nZ\n\u0002\n\u0003\n1\ndw0 Σ> (t, w0 , k)S < (w0 , t, k) − Σ< (t, w0 , k)S > (w0 , t, k) .\n(2.43)\nhCcoll i =\n2\nNote that this expression has only one external time t; forcing equal times exactly corresponds to integrating over the energy in the mixed representation. Because we are only\ninterested in the spatially homogeneous case, all gradients vanish in the expression (2.43).\nClearly, for the equations of motion (2.27) to close, we need to be able to express hCcoll i entirely in terms of functions Sα< (k, t). We begin by writing the propagators in the two-time\nrepresentation:\nZ\n0\nS(w0 , w00 , k) ≡\nd 3 (w − w0 ) e−ik*(w−w ) S(w, w0 )\nZ\ndk0 −ik0 (w0 −w00 )\nw0 + w00\n=\ne\nS(k0 , k,\n).\n(2.44)\n2π\n2\nInserting the spectral solution (2.26) to the definition (2.44) we get the two-time representation of our cQPA-Wightman functions (t ≡ (u0 + v0 )/2):\niS <,> (u0 , v0 , k) =\n\nXh\n±\n\ni\n<,>\n<,>\ne∓iωk (u0 −v0 ) Sm±\n(k, t) + Sc±\n(k, t) .\n\n(2.45)\n\nNote that iS < (t, t, k) = S < (k, t). We clearly need to expand the functions S <,> (w0 , t, k)\nappearing explicitly in Eq. (2.43). However, the perturbative expressions for the self-energy\nfunctions Σ<,> (t, w0 , k) in general involve further integrations over internal vertices w00 , w000 ,\nand so we will need to expand correlators S(w0 , w00 , k) with arbitrary time-coordinates w0\nand w00 with respect to the \"external\" time t = (u0 + v0 )/2. This is easily done by Taylor\nexpanding correlators around t:\n∞\n\nS <,> (k0 , k,\n\n\u0011n\nX 1 \u0010 w0 + w 0\nw0 + w00\n0\n)=\n− t ∂tn S <,> (k0 , k, t) .\n2\nn!\n2\nn=0\n\n– 12 –\n\n(2.46)\n\n\fWe can determine the derivative terms in the above equation by recursively using the zeroth\norder equations (2.41) for n ≥ 1:\n<\n= O1 ,\n∂tn Sm±\n\n<\n<\n∂tn Sc±\n= (∓i2ωk )n Sc±\n+ O1 .\n\n(2.47)\n\nThis implies that the Taylor expansion of the mass-shell functions is trivial to the lowest\norder in mass gradients, and that the coherence solutions get multiplied by a simple phase\nfactor. Inserting these results to Eq. (2.44) one finds:\ni\nXh\n0\n0\n<,>\n<,>\niS <,> (w0 , w00 , k) ≈\ne∓iωk (w0 −w0 ) Sm±\n(k, t) + e∓iωk (w0 +w0 −2t) Sc±\n(k, t) ,\n(2.48)\n±\n\nwhere we dropped terms of order O1 . As a trivial consistency check we see that this\nexpansion reduces to Eq. (2.45) as w0 → u0 and w00 → v0 . Physically the propagator (2.48) is an approximation which takes into account the rapid temporal variations\ndue to the oscillations of the coherence functions, but neglects the corrections due to\ntemporal variations in the background fields. In particular equation (2.48) implies that\nP\n<,>\niS <,> (w0 , t, k) = ± exp(∓iωk (w0 − t))S±\n, so that applying it to Eq. (2.43), we find\n\u0011\ni X\u0010 >\n<\n<\n>\nhCcoll i = −\nΣeff (±ωk )S± − Σeff (±ωk )S± ,\n2 ±\nwhere\nΣ<,>\neff (k0 , k, t)\n\n≡\n\nZ\n\ndw0 eik0 (t−w0 ) Σ<,> (t, w0 , k) .\n\n(2.49)\n\n(2.50)\n\nThe result (2.49) is similar to the equation (2.42), although in the new derivation we\ndid not assume the smallness of ∂t Σ. This is as expected, as both equations account\nfor the resummation of the external coherence propagator. However, the correct selfenergy function Σeff in Eq. (2.50) is not in general equivalent with the projected mixed\nrepresentation function Σ appearing in Eq. (2.42). Yet it is interesting to see that in the\nend, after the resummations have been carried out, Eq. (2.49) can be written in an integral\nform formally equivalent to the naive lowest order gradient expansion of the equation (2.40):\nZ\n1\ndk0 >\n<\n>\nhCcoll i ≡\n(Σ (k, t)Seff\n(k, t) − Σ<\n(2.51)\neff (k, t)Seff (k, t)) .\n2\n2π eff\nThe crucial point is that the original cQPA S <,> -functions have been replaced by the\neffective ones:\nX <,>\n<,>\n<,>\n<,>\n<,>\niSeff\n(k, t) ≡ 2π\n(Sm± (k, t) + Sc±\n(k, t)) δ(k0 ∓ ωk ) ≡ iSm\n+ iSc,eff\n.\n(2.52)\n±\n\n<,>\nThe resummed propagators iSeff\nwill also appear in perturbative expansions of the effec<,>\ntive self-energies Σeff . In section 4 we will return to this issue and derive a set of extended\nmomentum space Feynman rules that can be used to formulate perturbative expansions\nand compute arbitrary self-energy diagrams in the cQPA framework.\nAt the first sight it might look surprising that the resummations effectively pushed\nthe coherence shells back to the mass shells in the effective propagators appearing in the\n\n– 13 –\n\n\fcollision term. On the second thought this is of course perfectly natural: despite the fact\nthat the k0 = 0 solutions are real (they have been constructed explicitly in exactly solvable\nfree theories elsewhere [13, 25]), they still physically correspond to coherence information\nbetween the on-shell states. What we are observing is our theory being consistent with\nthe fact that it would make no sense to have a mere coherence information colliding with\nsomething; to have an interaction there always need to be a colliding particle present. When\nthe coherence contributions are pushed to mass-shells their role is sensible: to modulate\nthe collision frequencies of the mass-shell states depending on their state of coherence.\n2.4.2 Collision integrals for the on-shell functions\nGiven the generic result Eq. (2.49) we can write the collision terms in Eqs. (2.38-2.39)\nexplicitly as traces over the effective self-energy functions (2.50) multiplied by simple propagator matrices. To this end it is convenient to introduce some further notation, rewriting\nthe coefficient matrices Smh± and Sch± as:\n1\nKmh± (k)fmh± (k) ,\n2ωk\n1\n<\nKch± (k)fch± (k) ,\nSch±\n(k, t) ≡\n2ωk\n\n<\nSmh±\n(k, t) ≡\n\n(2.53)\n\nwhere:\nKmh± (k) ≡ (2ωk )Pk± Ph (k)γ 0 = ±(k\n/± + mR − iγ 5 mI )Ph (k)\n\n(2.54)\n\n1\nKmh± (k)Kmh∓ (k) .\n2ωk\n\n(2.55)\n\nand\nKch± (k) ≡ (2ωk )Pk± Rk± Ph (k)γ 0 =\n\nTo derive the last form for Kch± we used the identity (2.33). Note that the operators Kmh±\nand Kch± have the natural interpretations in terms of the spinor products. First, it is easy\nto show that4\nKmh± = u± (k, h)ū± (k, h) ,\n(2.56)\nwhere u± (k, h) are the free positive and negative energy spinors normalized such that\nu†± u± = 2ωk . From Eq. (2.55) one then immediately finds that the coherence propagators\nare proportional to off-diagonal spinor products:\nKch± = Ah± u± (k, h)ū∓ (k, h) ,\n\n(2.57)\n\nwhere the normalization factor\nAh± =\n\n\u0010\n1\nh|k|\nh|k| \u0011 mI mR\nū∓ (k, h)u± (k, h) =\n± ih 1 −\n.\n2ωk\nωk\nωk\n|m|2\n\n(2.58)\n\nThis observation gives rise to a natural normalization for the coherence-shell functions\nfch± ; the canonically normalized coherence functions clearly are:\n4\n\nIf one interprets our negative energy states as positive energy antiparticles by replacing k → −k for\nP\nthe negative energy solutions one finds the familiar result:\nk ± m, where m ≡ mR − iγ 5 mI .\nh Kmh± = /\n\n– 14 –\n\n\fKmh+(k)\nKmh−(k)\n\n⇒ ωk\n\nωk ⇒\n\n→ k\n⇐ ωk\nωk ⇐\n\nKch+(k)\nKch−(k)\n\n⇐ ωk\n\nωk ⇒\n\n→ k\n⇒ ωk\nωk ⇐\n\nFigure 1: Graphical representation of Dirac structures of different on-shell propagators. Three\nmomentum and fermion number flow from left to right. Arrows in fermion lines represent the\nfermion number flow and double arrows the direction of the energy flow.\n\nf ̃ch± = Ah± fch± .\n\n(2.59)\n\nWhile it will be convenient to use our initial definition of the coherence functions in practical\ncalculations, we will always present our results using the canonical normalization.\nThe fact that Kch± can be expressed as products of covariant projectors onto opposite\nenergies allows a nice pictorial representation of the propagators shown in figure 1: the\nmass-shell propagator Kmh+ corresponds to the usual positive energy states moving along\nthe direction of momentum k and Kmh− to negative energy states that move against the\ndirection of k (that is, their physical momentum is −k). The coherence propagators on the\nother hand, can be viewed as transporting states simultaneously in from both directions\n(Kch− ) or out to both directions (Kch+ ), both along and against the direction of k. From\npractical point of view however, it is important that the matrices Kmh± and Kch± form an\northogonal system with respect of Dirac traces. Indeed, using first the definitions Eq. (2.53)\nthe collision integrals (2.38-2.39) can be written as:\ni\nh\n1\n†\nCmh± [fα ] =\niγ 0 Kmh± ,\nTr hCcoll + Ccoll\n2ωk\ni\nh\nξk\n†\nCch± [fα ] =\niγ 0 Kch∓ ,\n(2.60)\nTr hCcoll + Ccoll\n2ωk\nwhere ξk ≡ ωk2 /(ωk2 − m2R ). Now using the orthogonality properties of Kjh± and the generic\nexpression for the collision term Eq. (2.49) we find\n\u0010\n\u0011\n<\n>\n<\nCmh± [fα ] = −< [ Σ>\nf\n+\nΣ\nf\n]\n−\n[\n>\n↔\n<\n]\nmh± mh±\nch∓ ch∓\n\u0010\n\u0011\n1\n<\n>\n∗ <\n∗\nCch± [fα ] = − [ Σ>\nf\n+\n(ξ\nΣ\n)\nf\n+\n(±\n↔\n∓)\n]\n−\n[\n>\n↔\n<\n]\n, (2.61)\nk ch±\nmh± ch±\nmh±\n2\n<,>\nwhere the functions Σ<,>\njh± are the following traces of the self-energy functions Σeff :\n\nh\ni\n1\nTr iΣ<,>\n(±ω\n)K\n(k)\n,\nk\nmh±\neff\n2ωk\nh\ni\n1\nTr iΣ<,>\n=\n(±ω\n)K\n(k)\n.\nk\nch∓\neff\n2ωk\n\nΣ<,>\nmh± =\nΣ<,>\nch±\n\n(2.62)\n\nAll other contributions from the collision integrals hCcoll i get annihilated by the projection\noperators inside the traces. Note that the coherence-shell self-energy functions Σ<,>\nch± get\nprojected with an \"inverted\" spin structure Kch∓ under the trace. If the coherence functions are set to be identically zero, and the source terms are neglected in the flow terms,\nequations (2.35) with the collision integrals (2.61) reduce to the usual Boltzmann equation\n\n– 15 –\n\n\ffor the mass-shell excitations. Observe however, that any departure from equilibrium, even\nin the absence of the source terms, would lead to creation of coherence through ξk -terms.\nCoherence would be created in this way for example in massive particle decays, which could\nbe of relevance for example for leptogenesis calculations.\nThe quantum Boltzmann equations (2.35-2.36) together with the explicit forms of the\ncollision integrals Eq. (2.61) constitute one of the main results of this paper. We wish to\nstress that they are generic equations in the cQPA framework, where arbitrary couplings\nof the coherently evolving system to its surroundings are encoded into the perturbative\nexpressions of the self-energy functions (2.62). As we saw in section 2.4.1, to compute\nthese functions we need special techniques that account for the resummations over the\ncoherence propagators. We will develop the necessary calculational rules in section 4, after\nwe first extend the results of this section to the case of scalar fields.\nTo conclude this section, let us stress that despite their apparent completeness, the\ncQPA quantum Boltzmann equations (2.35-2.36) correspond to an approximation scheme.\nIndeed, we found the spectral representation for the correlator in terms of the eight fα functions by expanding and solving the collisionless constraint equations (2.9) to the zeroth\norder in gradients. Because these equations were purely algebraic they had a formally exact spectral solution which was in one-to-one correspondence to the lowest moment of the\ncorrelator S. If we included gradient corrections into the constraint equations however, a\nmore complicated set of distribution functions with new independent terms (for example\n(1)\nlike ∼ aα ∂k0 δ(k 2 − m2 )) would be needed to find closure consistently order by order. In\nthis sense the qBE's (2.35-2.36) written in terms of fα 's are almost too promising; in reality\nthe heart of the cQPA-scheme remains to be that it allows a reasonable approximation for\nthe collision integral in the master equation (2.27) for the lowest moment of the correlation\nfunction S. Adding more gradients to constraint equations would lead to a more complicated ansatz, and correspondingly, to find a complete set of qBE's with the new associated\nshell-functions, more moments of the dynamical equations would be needed. Most physical observables can be written in terms of the lowest moment functions however, and in\nmost physical applications the gain in the accuracy from going to higher orders in gradients would be very limited. Our restriction to the lowest moment expansion (lowest order\nin gradients) is, at any rate, exactly analogous to the derivation of the usual Boltzmann\nequation.\n\n3. cQPA for scalar fields\nWe now formulate the cQPA formalism for scalar fields using analogous approximations to\nthe ones we introduced for fermions in section 2.1. As was shown in [13], one obtains a\nqualitatively similar phase space structure, with the mass shells at k0 = ±ωk and coherence\nshells at k0 = 0. However, the integration procedure leading to a closed set of Boltzmann\nequations is somewhat different from the fermionic case. First, since there is only one\ncomponent in the scalar field correlator ∆< (k, t), one needs to introduce a finite number of\nk0 -moments of the initial singular correlators [13]. Second, as the constraint equations for\nscalars are not algebraic there are no formally exact spectral solutions to them. In other\n\n– 16 –\n\n\fwords, the gradient expansion is slightly more delicate for scalars than for fermions. As a\nresult, it will be more convenient to present the scalar qBE's in terms of moments and use\nthe spectral solutions only to compute the collision integrals.\nWe begin with the Kadanoff-Baym equations for the Wightman functions\ni∆< (u, v) = hφ† (v)φ(u)i\n\nand\n\ni∆> (u, v) = hφ(u)φ† (v)i .\n\n(3.1)\n\nIn the Wigner representation, the Kadanoff-Baym equation for these functions become (see\ne.g. ref. [5]):\n←\n− \u0011\ni\n1\nk 2 − ∂x2 + ik0 ∂x − m2 e− 2 ∂x ∂k ∆<,> − e−i♦ {ΠH }{∆<,> } − e−i♦ {Π<,> }{∆H } = Ccoll ,\n4\n(3.2)\n>\n<\n>\n<\nwhere ∆H = ∆F − (∆ + ∆ )/2 and ΠH = ΠF − (Π + Π )/2, while ∆F and ΠF denote\nthe time-ordered (Feynman) propagator and the corresponding self-energy. The collision\nterm can be found from Eq. (2.5) with S → ∆ and Σ → Π. Proceeding through steps 1-3\nin the approximations detailed in section 2.1 and breaking equations into hermitian and\nanti-Hermitian parts we find:\n\u0010\n\n\u0010\n\n\u0011\n1\n1\nk 2 − ∂t2 − cos ( ∂tm ∂k∆0 )m2 i∆<,> = −CA\n4\n2\n\u0010\n\u0011\n1\nk0 ∂t + sin ( ∂tm ∂k∆0 )m2 i∆<,> = CH ,\n2\n\n(3.3)\n(3.4)\n\n†\n†\n)/(2i).\n)/2 and CA ≡ (Ccoll − Ccoll\nwhere CH ≡ (Ccoll + Ccoll\n\n3.1 Phase space structure\nWe now proceed to approximation step 4 and analyze the KB-equations (3.3-3.4) in the\nzeroth order in Γ and ∂t m to find out the singular phase space structure. That is, we\ninitially set:\n\u0010\n\n\u0011\n1\nk 2 − ∂t2 − m2 i∆<,> = 0\n4\nk0 ∂t i∆<,> = 0 .\n\nBecause both of these equations contain explicit time derivatives even in zeroth order,\none need to use them both to get one algebraic constraint. The appropriate approximate\nsolution was found in [13]:\n<,>\ni∆<,> (k, t) = 2π sgn(k0 )fms\n(|k|, t)δ(k 2 − m2 ) + 2π fc<,> (|k|, t)δ(k0 ) ,\nk\n0\n\n(3.5)\n\nwith sk0 = sgn(k0 ), and m = m(t). Following the fermionic analog, it will be convenient\nto define two new (dependent) coherence-shell solutions:\n\u0010\ni \u0011\n<,>\nfc±\n≡ ωk ± ∂t fc<,> .\n2\nWith these variables we can write Eq. (3.5) as:\n\n– 17 –\n\n(3.6)\n\n\fi∆<,> (k, t) =\n\n\u0011\nπ X\u0010\n<,>\n<,>\n± fm±\n(k, t)δ (k0 ∓ ω) + fc±\n(k, t)δ(k0 ) .\nωk ±\n\n(3.7)\n\nAs in the fermionic case, the KB-equation for the spectral function A = 2i (∆> − ∆< )\nis identical to the ones for ∆<,> , and consequently, the solution is of the same form as\nEq. (3.7). In addition however, the spectral function must obey the sum rule, which\nfollows from the equal time commutation relations of the field operators φ:\nZ\ni\ndk0\n(k0 + ∂t )A(k, t) = 1 .\n(3.8)\nπ\n2\nAgain the spectral relation completely determines the spectral on-shell functions, setting\nA = 0 (see ref. [13]), reducing A to its standard form:\nf±A = 12 and fc±\nA = π sgn(k0 )δ(k 2 − m2 ) .\n\n(3.9)\n\nUsing this result with the defining relation 2iA = ∆< − ∆> , one can easily show that the\ndynamic functions f > and f < are related:\n>\n<\nfm±\n= 1 + fm±\n,\n\nand\n\n>\n<\nfc±\n= fc±\n.\n\n(3.10)\n\nThat is, only half of the on-shell functions appearing in ∆<,> are free variables. In what\nfollows, we derive equations of motion for the on-shell functions fα ≡ fα< . Finally, let us\nwrite down the cQPA pole propagators which are equivalent to the standard expressions:\ni∆r,a (k, t) =\n\ni\n.\nk 2 − |m|2 ± isgn(k0 )\u000f\n\n(3.11)\n\nFrom these one can find out the cQPA Feynman and the anti-Feynman propagators:\n∆F = ∆ r + ∆ <\n∆F̄ = −∆a + ∆< ,\n\n(3.12)\n\nwhere ∆< is of course given by Eq. (3.7).\n3.2 Equations of motion\nWe again define the cQPA transport equations by treating the functions fα as free parameters, and inserting the spectral solution (3.7) as an ansatz back into the full KB-equations\n(3.3) and (3.4). Because we have only one scalar function ∆< for three unknown shell functions, we need to integrate these equations with a number of different weights functions to\nget a closure. To be specific, we will use the moment functions:\nZ\ndk0 n <\nρn (k, t) =\nk i∆ (k, t) ,\n(3.13)\n2π 0\nwhich we need at least three to get the closure. Taking the three lowest moments and\nworking to the zeroth order in gradients, we find the following invertible relations between\n\n– 18 –\n\n\fthe moments and the on-shell functions f±< and fc< :\n1\n(f+ − f− ) + fc\n2ωk\n1\nρ1 = (f+ + f− )\n2\nωk\nρ2 =\n(f+ − f− ) .\n2\n\nρ0 =\n\n(3.14)\n\nWe will clearly need three evolution equations for our three moments, and it is natural to\ndefine them as the zeroth moment of equation (3.3) and as first and second moments of\nEq. (3.4):\n1 2\n∂ ρ0 + ωk2 ρ0 − ρ2 = − hCA i\n4 t\n∂t ρ1 = hCH i\n1\n∂t ρ2 − ∂t (m2 )ρ0 = hk0 CH i .\n2\n\n(3.15)\n\nIt is now evident that the moment connections (3.14) are the key element of the cQPA\napproximation, as they will allow us to rewrite the collision integrals appearing in Eq. (3.15)\nin terms of the moments ρ0,1,2 to get the closure. Unlike in the case of fermions, we do\nnot attempt to rewrite these equations in terms of f -functions, although it could be done\nformally by differentiating the inverted equations (3.14) and using recursively the evolution\nequations (3.15). This change of variables carries a delicate issue related to the gradient\nexpansion, however. Remember that the moment equations (3.15) are exact in the sense of\ngradient expansion, and to avoid introducing a loss of accuracy in going to f -variables, one\nshould treat also the relations (3.14) as exact, despite the fact that they were computed\nonly to the lowest order in gradients. The inverted equations would thus have a mixed set of\ngradient terms, coming from both the exact moment equations and from the approximate\ninversion process. In particular, second order gradient terms would be invoked because\nof the second time derivative in the equation of motion for ρ0 . These terms should not\nbe neglected in the spirit of gradient expansion, however, as they arise from the defining\nrelations (3.14). This issue did not arise in the fermionic case where the equations of motion\ninclude only first order time derivatives. As a result of this complication we prefer to write\nour qBE's in terms of the moments rather than the f -functions in the scalar case.\nHowever, also the scalar coherence solutions are rapidly oscillating and thus the scalar\ncollision terms need to be resummed with respect to these oscillations. We can see this by\nsolving the evolution of the coherence-shell solutions to the lowest order in gradients from\nequations (3.15) in the context of the formulae (3.14) and the definition (3.6):\n∂t fc± = ∓2iωk fc± + O1 ,\n\n(3.16)\n\nwhere the correction term O1 has the same meaning as in the fermionic case. Indeed,\nequations (3.16) are identical to the zeroth order limit of fermionic qBE:s (2.36). The\nmass-shell solutions on the other hand, are constants to the lowest order: ∂t fm± = O1 ,\n\n– 19 –\n\n\fand so, analogously to equations (2.41), we find the following lowest order equations for\nthe singular shell-solutions:\n1\n∂t ∆<\nm± = O ,\n\n<\n1\n∂t ∆<\nc± = ∓2iωk ∆c± + O .\n\n(3.17)\n\n3.3 Resummed scalar collision term\nWe need to express the collision integrals appearing in Eq. (3.15) in terms of the distribution functions f± and fc± (and eventually in terms of the moments using the connection\nEq. (3.14)). The basic quantity we encounter is:\nZ\ndk0 α 1 −i♦\nhCα i =\nk e ({Π> (k, t)}{∆< (k, t)} − {Π< (k, t)}{∆> (k, t)}) .\n(3.18)\n2π 0 2\nwhere α = 0, 1. Again, to re-sum the oscillatory gradients of the distribution functions in\nthe ♦-expansion, we write Eq. (3.18) in the two-time representation:\nZ\nh\n1\nr0\nr0\nhCα i =\ndw0 (−i∂r0 )α Π> (t + , w0 )∆< (w0 , t − )\n2\n2\n2\ni\nr\nr\n0\n0\n.\n(3.19)\n−Π< (t + , w0 )∆> (w0 , t − )\n2\n2 r0 =0\nFor α = 0 this immediately reduces to a formula analogous to Eq. (2.43) for fermions. For\nα = 1 the extra ∂r0 -derivative gives rise to an additional complication, but we still continue\nto search for a consistent expansion around the external time t as before. We begin by\nwriting the spectral propagator (3.7) in the two-time representation:\nZ\nw0 + w00\ndk0 −ik0 (w0 −w00 ) <\n<\n0\ne\n∆ (k0 , k,\n)\ni∆ (w0 , w0 , k) =\n2π\n2\nh\ni\n1 X\n0\n0\n≈\n± e∓iω(w0 −w0 ) fm± (k, t) + e∓iω(w0 +w0 −2t) fc± (k, t) .(3.20)\n2ωk ±\nw +w0\n\n0\n0\nHere we Taylor expanded ∆<\n) around the external time variable t, and used the\nx (k,\n2\nrecursive zeroth order equations of motion:\n\n1\n∂tn ∆<\nm± = O ,\n\nn <\n1\n∂tn ∆<\nc± = (∓2iωk ) ∆c± + O ,\n\n(3.21)\n\nexactly as in the fermionic case. Now, using the expanded propagator (3.20) in the collision\nintegrals (3.19) we get:\nhCα i =\n\n\u0011\n(−1)α+1 X \u0010\n<\n>\n<\n[ ± iΠ>\nmα± fm± + iΠcα± fc± ] − [ > ↔ < ] ,\n2\n±\n\nwhere the effective self-energies are:\n\u0001α <,>\ni\nΠ<,>\nΠeff (±ωk )\nmα± = ±ωk + 2 ∂t\nwith\nΠ<,>\neff (k0 , k, t) ≡\n\n1\n2|k0 |\n\nZ\n\nand\n\nΠ<,>\ncα± =\n\n\u0001α <,>\ni\nΠeff (±ωk )\n2 ∂t\n\ndw0 eik0 (t−w0 ) Π<,> (t, w0 , k) .\n\n– 20 –\n\n(3.22)\n\n(3.23)\n\n(3.24)\n\n\fNote again the simplicity of these results; to get the collision integral for an arbitrary\nmoment equation, we only need to evaluate one generic function Π<,>\neff (±ωk ), which is of\nthe same form as the fermionic effective self-energy function Eq. (2.50). For the cases\n<,>\n<,>\n<,>\n<,>\n<,>\ni\nα = 0, 1 appearing in (3.26) we have: Π<,>\nm0± = Πc0± = Πeff± , Πm1± = ±ωk Πeff± + 2 ∂t Πeff±\n<,>\ni\nand Π<,>\nc1± = 2 ∂t Πeff± , so that\n\u0011\n1 X\u0010\n<\n<\n[ iΠ>\n(\nf\n±\nf\n)\n]\n−\n[\n>\n↔\n<\n]\n,\nm±\neff± c±\n2 ±\n\u0010i\n\u0011\ni\n\u0011\n1 X \u0010h\n<\n>\n<\n<\nhC1 i =\nωk iΠ>\nf\n+\n∂\niΠ\n(\nf\n±\nf\n)\n−\n[\n>\n↔\n<\n]\n. (3.25)\nt\nm±\nc±\nm±\neff±\neff±\n2 ±\n2\n\nhC0 i = −\n\nThe collision integrals appearing explicitly in Eqs. (3.15) are just real and complex parts\nof these expressions:\nhCH i = <hC0 i ,\n\nhCA i = =hC0 i and hk0 CH i = <hC1 i.\n\n(3.26)\n\nEquations (3.23) deserve some comments. First, the resummation of leading oscillatory\nterms in the ♦-expansion pushed the (zeroth moment) coherence self-energy functions onto\nmass-shells, analogously to what happened in the fermionic case. This again conforms with\nour expectation that collisions cannot be sensibly defined for pure coherence; although coherence solutions do live on k0 = 0 in the phase space, their effect is, after resummation,\nonly felt as a modification of the collision rates for the mass-shell states. Second, the\nresummation effectively transforms the moment function k0α in equation (3.18), into an\noperator (k0 + 2i ∂t )α which, after projection onto mass- and coherence shells, gives rise to\nexpressions (3.23). Obviously, a naive truncation of the diamond expansion would have\nmissed the derivative terms in (3.23). Note that these gradients cannot be ignored due to\nthe same reason that led us to perform the diamond expansions in the first place; whenever the gradient acts on any coherence function occurring in the perturbative expansion\nfor Π<,>\neff , the result is not formally suppressed by mass-gradients. Thus we have to use\nEquations (3.25) as such in the collision integrals (3.26).\nIn practical calculations it is most convenient to express the collision integrals in terms\nof fα 's and use the inverse relations of Eq. (3.14) to write them in terms of the moments\nρ0,1,2, . For the record we write the necessary inverse relations explicitly here:\n1\nρ2\nωk\ni\n1\n= (ωk ± ∂t )ρ0 −\nρ2 .\n2\nωk\n\nfm± = ρ1 ±\nfc±\n\n(3.27)\n\nNote the appearance of the quantity ∂t ρ0 , which appears as a \"hidden\" variable in the\nevolution equations (3.15).\n\n4. Momentum space Feynman rules\nWe now derive generalized Feynman rules for computing the effective self-energy functions\nΣeff and Πeff through perturbative techniques, including the coherence effects. Standard\n\n– 21 –\n\n\fmethods, such as the 2PI formalism (see e.g. [5]), exist for diagrammatic expansion of the\ntwo-time self-energies Σab (u, v) and Πab (u, v) appearing in equations (2.50) and (3.24), and\nour task is to reduce the computation of the diagrams generated by these methods into a\nset of momentum space Feynman rules. We derive these rules as usual by replacing the\npropagators in an arbitrary diagram by our resummed propagators (2.48) and (3.20) and\nperforming all time integrations related to internal vertices. The only essential complication\ncomes from the nontrivial phase structure associated with the coherence-shell parts in the\ndynamical propagators (2.48) and (3.20). We can account for all phase factors by rewriting\nall propagators in a generic 4-dimensional representation as follows:\nZ\ndk0 −ik0 (w0 −cw00 )+ik0 (1−c)t\nG(w0 , w00 , k) =\ne\nG(k0 , k, t) .\n(4.1)\n2π\nHere G can refer either to fermion or scalar propagators (the internal degrees of freedom,\n<,>\n<,>\nincluded in S(k0 , k, t), are not necessary for our treatment here): G = Sr,a , Sm±\n, Sc,eff±\n<,>\n<,>\nor G = ∆r,a , ∆<,>\nm± , ∆c,eff± , where ∆c,eff± are defined below in Eq. (4.2). The sign factor c = c(k0 ) has the \"normal\" value c = +1 for the dynamical mass-shell propagators\nG = G<,>\nand for the pole propagators G = Gr,a which do not contain any coherence som\nlutions. However, for the resummed coherence-shell propagators G = G<,>\nc,eff the sign factor\nis negative, c = −1, as required by Eqs. (2.48) and (3.20). In the latter case the overall\nphase is \"abnormal\", except in the particular case of w00 = t, where the c-terms cancel,\nand the phase factor becomes normal also for the coherence propagator. This implies that\nthe phases associated with a given vertex in a self-energy diagram are normal in all cases\nbut those where the vertex time (not equal to t) corresponds to the second time argument\nof at least one coherence propagator connected to the vertex. In these cases the signs of\nthe phases coming from the corresponding coherence lines are reversed and extra phases\nproportional to the reference time t are added. This is a general rule to be used in addition\nto the usual combinatorics after the interactions have been specified.\nLet us stress that the effective mixed representation propagators Gc,eff (k0 , k, t) in (4.1),\ncorresponding to the resummed coherence propagators (2.48) and (3.20), by definition have\ntheir poles on the mass shells. Let us recall their explicit expressions:\n<,>\n<,>\n<,>\n<,>\n<,>\niSeff±\n= iSm±\n+ iSc,eff±\n= 2π(Sm±\n+ Sc±\n) δ(k0 ∓ ωk )\n<,>\n<,>\ni∆<,>\neff± = i∆m± + i∆c,eff± =\n\nπ\n<,>\n<,>\n( ± fm±\n+ fc±\n) δ(k0 ∓ ωk ) ,\nωk\n\n(4.2)\n\nwhere S- matrix functions are defined in Eq. (2.26). Let us remind that in terms of the\ncomplex path indexing the Wightman functions correspond to the off-diagonal propagators\nS 12 ≡ S < and S 21 ≡ S > . In loop calculations we often encounter also the diagonal Feynman\nand anti Feynman propagators S 11 and S 22 . Because the novel coherence solutions only\nappear in the Wightman functions, we can find the coherent S ii -functions directly by using\nEqs. (2.24) and (3.12) together with Eqs. (4.2) and the expressions for the standard pole\npropagators given in Eqs. (2.22) and (3.11):\n11\nSeff\n=\n\n−\n<\nSr − Seff\n= SF,0 − Seff\n\n– 22 –\n\n\fk0\n\nk0\nt\n\nk0\n\nt\n\nw00\n\nw00\n\nk0\n\nFigure 2: Generic diagrams contributing to the fermionic self-energy function Σeff (left) and to\nthe scalar self-energy function Πeff (right).\n−\n22\n<\nSeff\n= −Sa − Seff\n= SF̄ ,0 − Seff\n\n∆11\neff =\n\n−\n∆r + ∆ <\neff = ∆F,0 + ∆eff\n\n−\n<\n∆22\neff = −∆a + ∆eff = ∆F̄ ,0 + ∆eff ,\n\n(4.3)\n\nwhere SF,0 , ∆F,0 , SF̄ ,0 and ∆F̄ ,0 refer to the standard vacuum Feynman- and anti Feynman\n−\npropagators. Moreover, the quantities Seff\nand ∆−\neff correspond to the effective Wightman\n<\n<\nfunctions Seff and ∆eff from which the vacuum parts have been subtracted off. Indeed, one\ncan show for example that\nSr = SF,0 + 2πiθ(−k0 )(k\n/ + mR − iγ 5 mI )δ(k 2 − |m|2 ) ,\n\n(4.4)\n\n<\nand when the delta-function is absorbed into Seff\nit exactly cancels the vacuum part (in−\n<\n<\n:\ncluded in the negative frequency mass-shell function Sm−\n∝ fm−\n= 1 − n̄) from Seff\n−\n<\nSeff\n≡ Seff\n− 2πiθ(−k0 )(k\n/ + mR − iγ 5 mI )δ(k 2 − |m|2 ) .\n\n(4.5)\n\nIt is straightforward to show that similar relations hold for all propagators in (4.3).\nThis completes our rules for the propagator functions in the 4-dimensional mixed state\nrepresentation. Before we turn to the derivation of the vertex rule, let us write down the\nHermiticity properties of our propagators in the mixed representations\n(iG(k, t))† = iG(k, t)\n<,>\n†\n(iG<,>\nc,eff± (k, t)) = iGc,eff∓ (k, t) ,\n\n(4.6)\n\n<,>\nwhere iG = S̄m±\n, S̄r,a , i∆<,>\nor i∆r,a in the first line and iG = S̄ or i∆ in the second.\nm\nNote that taking the complex conjugate flips the ± → ∓ in the coherence propagator.\nFinally, it will be useful to observe that for a real scalar field propagator\n\n∆r,a (k, t) = ∆a,r (−k, t) ,\n<\n∆>\nm,± (k, t) = ∆m,± (−k, t) ,\n<\n∆>\nc,eff± (k, t) = ∆c,eff± (k, t) ≡ ∆c,eff± (k, t) .\n\n(4.7)\n\nNote in particular that there actually exists only one distinct type of coherence propagators.\n\n– 23 –\n\n\fp00\n\nq10\n\nk0\nt\n\np(n−2)0\n\np10\n\nq20\n\n* * * q(n−2)0\n\np(n−1)0\n\nq(n−1)0\n\nk0\n\nw(n−2)0 w(n−1)0 ≡ w00\n\nw10\n\nFigure 3: A cut through an arbitrary diagram around the continuous fermion line contributing to\nΣeff . The scalar lines may be interconnected or connected to separated closed fermion loops not\nshown.\n\n4.1 Vertex rules\nIn order to define vertex rules we need to specify a concrete model. We shall adopt the\nfollowing Yukawa interactions between our scalar- and fermion fields:\nLint = −y ψ̄ φ ψ + h.c.\n\n(4.8)\n\nGeneric examples of self-energy functions generated by this interaction are shown in figure 2. Let us consider the fermionic self-energy diagrams first. The most general diagram\nhas one continuous fermion line connecting the initial and final times, accompanied by an\narbitrary number of closed fermion loops where all fermionic lines can be connected and\nassociated with an arbitrary number of scalar lines. We wish to derive a generic mixed\nspace representation for such a diagram and extract the local Feynman rules from the resulting expression. In particular we will need to show that the global phase proportional\nto the external time t, arising from our propagators (4.1) vanishes.\nConsider first a generic sub-diagram of the type shown in Fig. 3. This is the continuous\nfermion line going through an arbitrary fermionic self-energy graph. It contains n vertices\nand n − 1 fermion propagators, and the final time on the fermionic line is the special\nexternal time t. The scalar lines may either be interconnected, or they may be connected\nto closed fermion loops, not shown in the diagram. To be able to associate correct phases\nwith the vertices, we first have to introduce the notion of the ordering of the arguments\nin the two-time propagator (4.1) into the mixed representation. This can be done by\nassociating propagators with a unique direction of flow. We start by defining the flow\nin the two-time representation according to the flow of time in time-ordered propagators\nG11 (u, v); that is, from the vertex v to the vertex u. This choice induces a natural definition\nfor the flow direction in the mixed representation as being along the four-momentum of\nthe positive energy states. For fermions this corresponds choosing the direction along the\nfermion number flow. Given this definition, Eq. (4.1) implies that a fermion propagator\nwith an energy qk0 , connected to a vertex wj0 gives rise to a phase factor that depends on\nthe direction of the flow according to:\ne−iqk0 wj0\neicqk qk0 wj0 +iqk0 (1−cqk )t\n\n\"incoming\"\n\"outgoing\" .\n\nFor a neutral scalar line we do not have a similar natural orientation\n5\n\n(4.9)\n5\n\nand we have to use\n\nThis is so because we are considering a neutral scalar field here. For a charged scalar field the charge\nconservation could be used to define a natural flow orientation.\n\n– 24 –\n\n\fthe general expression:\n1\n\neisj cpk pk0 wj0 +ipk0 2 (1+sj )(1−cpk )t ,\n\n(4.10)\n\nwhere the index sj = 1 for an outgoing and sj = −1 for an incoming scalar line. The\ndefinition (4.10) is clearly consistent with the fermion phases in Eq. (4.9). (Note the\nimplicit rule that for sj = −1 we always have cpk = 1 in the associated propagator.)\nWith these definitions it is easy to show that the time integration in each of the internal\nvertices in the diagram in Fig. 3 (j runs from 1 to n − 2) gives rise to a delta-function:\nZ\ndw0j eiwj0 (cqj qj0 +sj cpj pj0 −q(j+1)0 ) eiφj t = 2π δ(cqj qj0 + sj cpj pj0 − q(j+1)0 )eiφj t ,\n(4.11)\nwhere the extra phase factor is\n1\nφj = (1 − cqj )qj0 + (1 + sj )(1 − cpj )pj0 .\n2\n\n(4.12)\n\nClearly the extra phase vanishes if cqj = 1 (normal fermion propagator) and either sj = −1\n(incoming scalar field) or sj = 1 and cpj = 1 (normal outgoing scalar propagator). Taking\ninto account the special vertices at the ends of the fermion line, and integrating over the\ntimes at internal vertices as well as over the specific time w0 , the generic expression for the\nself-energy contribution from diagram 3 becomes:\nZ\n<,>\ndw0 eik0 (t−w0 ) Σ(t, w0 , k)\nΣeff (k0 , k, t) =\n∝\n\nn\n\u0010Y\nj=1\n\n\u0011\n2πδ(cqj qj0 + sj cpj pj0 − q(j+1)0 ) eiφline t × Cloops ,\n\n(4.13)\n\nwith the understanding that qn0 ≡ k0 , and the global phase factor is\nn−1\n\nX\n1\nφj .\nφline = k0 − q10 + s0 cp0 p00 + (1 + s0 )(1 − cp0 )p00 +\n2\n\n(4.14)\n\nj=1\n\nIn the second line of Eq. (4.13) we suppressed all momentum integrations and the effective\npropagators associated with the internal lines. They can easily be inserted back afterwards.\nThe explicitly shown delta functions and phases come from the vertices in the diagram 3\nand the factor Cloops contains the contributions from all possible closed internal loops in\nthe full diagram. By a recursive use of the delta-functions in the internal vertices, one can\nshow that φline can be associated with a sum of scalar momenta:\nφline =\n\n1\n1\n(1 + s0 )p00 − (1 − s0 )cp0 p00\n2\n2\nn−1\n\nX\n1\n+ k0 − q20 + s1 cp1 p10 + (1 + s1 )(1 − cp1 )p10 +\nφj\n2\nj=2\n\n= ... =\n\nn−1\nX\nj=1\n\n=\n\nn−1\nX\n\n[ 12 (1 + sj )pj0 − 12 (1 − sj )cpj pj0 ]\n\nsj pj0 ,\n\n(4.15)\n\nj=0\n\n– 25 –\n\n\fw(n−1)0\nwn0\nqn0\nq00 = q(n+1)0\n\nw10\n\nq20\nw20\n\nq30\n\nq40\n\nw30\n\nFigure 4: A generic closed fermion loop diagram with all internal vertices. The scalar lines can\nagain be interconnected, or connected to some other loops or to a continuous line going through a\nfermion self-energy diagram.\n\nwhere in the last step we used the fact that for an incoming particle with sj = −1 we\nalways have cpj = 1, and that for an outgoing state with sj = 1 the cpj -term vanishes in\nEq. (4.15). The final sum in Eq. (4.15) would vanish if all scalar lines in the graph were\ninterconnected (no closed fermion loops in the graph), because then each energy pi0 would\nappear twice in the sum, once with sj = +1 and once with sj = −1. However, as some of\nthe lines may be connected to loops, the sum does not vanish in general. Physically this\nmeans that coherence information can be transported between separate fermion lines by\nthe scalar fields.\nNow consider a closed internal fermion loop depicted in Fig. 4. For a closed loop the\ndirection of flow could be chosen arbitrarily, but we follow our earlier definition of going\nalong the fermion number flow. The calculation proceeds similarly to the case with the\nopen fermion line, the sole difference being that now all the propagators and vertices are\ninternal ones. After a straightforward calculation one finds that for a loop with ni vertices:\ni\nCloop\n\n∝\n\nni\nY\nj=1\n\ni\n\n2πδ(cqj qj0 + sj cpj pj0 − q(j+1)0 )eiφloop t\n\n(4.16)\n\nwhere\nφiloop\n\n=\n\nni\nX\n\nφj\n\nj=1\n\n= q11 − q20 +\n\nni\n\u0003 X\n1\n(1\n+\ns\n)p\n−\n(1\n−\ns\n)c\np\n+\nφj\n1 10\n1 p1 j0\n2\n2\n\n\u00021\n\nj=2\n\n= q10 − cqn qn0 − sn cpn pn0 +\n=\n\nni\nX\n\nni\nX\nj=1\n\nsj pj0 ,\n\n[ 12 (1 + sj )pj0 − 12 (1 − sj )cpj pj0 ]\n(4.17)\n\nj=1\n\nwhere in the last step we used the fact that due to cyclicity n + 1'th and the first fermion\npropagators are the same: cnq qn0 + sn cpn pn0 = q(n+1)0 = q10 . Combining the phase factors\nfrom the open fermion line and all closed fermion loops we find that the total extra phase\n\n– 26 –\n\n\fw(l+1)0\nw(l+1)0\n\nw(n−1)0\nk0\n\nq(l+1)0\n\nqn0\nt\n\nq10\n\nql0\n\nw10\n\nk0\n\nk0\n\nwl0 ≡ w00\n\nq(l+1)0\n\nqn0\nt\n\nw(l−1)0\n\nq20\n\n***\n\nw(n−1)0\n\nq10\n\nq20\n\nw10\n\nw20\n\nql0\n\n***\n\nk0\nwl0 ≡ w00\n\nw(l−1)0\n\nw20\n\nFigure 5: Generic diagrams contributing to the scalar self-energy function Πeff where the special\ntimes t and w0 are connected with the same (left) and with different (right) closed fermion loops.\n\nproportional to the external time t, counting all 2N vertices in a diagram with a total of\nN internal scalar lines is:\nφTOT = φline +\n\nX\n\nφiloop\n\n=\n\n2N\nX\n\ni\n\nsl pl0 = 0 .\n\n(4.18)\n\nl=1\n\nThe total phase φTOT vanishes because each scalar propagator appears twice in the sum,\nboth as an outgoing (sl = +1) and an incoming (sl = −1) one with the same energies,\nand these contributions cancel pairwise. Physically the vanishing of φTOT in Eq. (4.13)\nshows that while the energy is not conserved in the internal vertices in connection with the\ncoherence propagators, the overall energy in the complete diagram is conserved.\nShowing the vanishing of the total phase factor for an arbitrary scalar self-energy\nfunction Πeff proceeds similarly to the fermionic case. In addition to the closed internal\nfermion loop one now has to evaluate the phases coming from the two sub-diagrams shown\nin Fig. 5, which express the two possible ways of connecting the special vertices t and w0\ninto a most general diagram for Πeff (t, w0 , k). It is by now quite straightforward to show\nthat the extra phase, in either of these cases becomes\nφfigs.5 =\n\nn−1\nX\nj=1(6=l)\n\nφj + (1 − cql )ql0 + qn0 − q10 + k0 = ... =\n\nn−1\nX\n\nsj pj0 .\n\n(4.19)\n\nj=1\n\nCombining this result with the all possible phases from the internal closed loops gives the\ntotal phase factor for a Πeff with N internal scalar lines:\nφscalar\nTOT = φfigs.5 +\n\nX\n\nφiloop =\n\ni\n\n2N\nX\n\nsl pl0 = 0 ,\n\n(4.20)\n\nl=1\n\nwhere the final sum over the scalar energies vanishes by the same argument as in the\nfermionic case in Eq. (4.18). This result completes our proof that the local extra phases\ncoming from the coherence propagators cancel in arbitrary self-energy diagrams. As a\nresult, we can neglect all such phases in the actual calculations and use the local momentum\nspace vertex Feynman rule:\nφψ̄ψ : y (2π)4 δ(q00 − cq q0 − sp cp p0 )δ 3 (q0 − q − sp p) .\n\n– 27 –\n\n(4.21)\n\n\f−iy(2π)4δ 3 (q′ − q + p)\n\nab\niSeff\n(q, t)\n\n×δ(q0′ − cq q0 + p0)\n\nq\n\na\n\np\n\nq\n\nb\n\nq′\n\n−iy(2π)4δ 3 (q′ − q − p)\n\ni∆ab\neff (p, t)\n\n×δ(q0′ − cq q0 − cpp0)\n\nq\n\na\n\np\n\nb\n\np\nq′\n\nFigure 6: The Feynman rules including coherence with an explicit orientation of the scalar lines\nfollowing from Eqs. (4.2 - 4.3) and Eq. (4.21). The sign functions are cp,q = −1 for the coherence\nparts of the associated propagators and cp,q = 1 otherwise.\n\nThe only difference from the usual rule then is the appearance of extra sign factors in\nthe energy delta function in association with outgoing coherence propagators, leading to\na local energy non-conservation within the loop. The complete set of momentum space\nFeynman rules for computing the fermionic and scalar self-energy functions including coherence propagators in the Yukawa theory with interaction Eq. (4.8) are shown in figure\n6. The arrows in the propagator lines indicate the direction of the flow corresponding to\nthe 4-momentum of the positive energy state.\n\n5. Examples\nWe shall now compute some examples of self-energies and collision integrals in the Yukawa\ntheory described by the Lagrangian (4.8), starting with with the simplest one-loop selfenergy diagrams shown in the upper right panel of Fig. 7. These diagrams can be obtained\nfor example from the two-particle irreducible (2PI) effective action vacuum diagram shown\non the left in Fig. 7:\nZ\ny2\nΓ2PI = −\nd4 u d4 v Tr [S(u, v) S(v, u)] ∆(u, v) ,\n(5.1)\n2 C\nwhere the integration is over the Keldysh path [11]. For example the fermion self-energy\nnow follows by a direct functional differentiation:\nΣab (u, v) = −iab\n\nh\ni\nδΓ2 [S]\niy 2 ab\nab\nba\n=\nS\n(u,\nv)\n∆\n(u,\nv)\n+\n∆\n(v,\nu)\n.\n2\nδS ba (v, u)\n\n(5.2)\n\nThis much of the calculation is straightforward even without the Feynman rules developed\nin the last section. However, to proceed further would be tedious, since the two-time\n\n– 28 –\n\n\fS ab\ny\n\ny\nS\nu\n\n∆∆abab\n\n∆\nS\n\ny\n\ny\nΓ2PI\n\n∆ba\n\nΣab\n\nv\n\nS ab\ny\n\nS ba\n\nS ab\ny\nΠab\n\nFigure 7: On left: the diagram contributing to the 2PI effective action at the lowest order for\ninteraction (4.8). On top right: the two diagrams contributing to the fermion self-energy Σab\neff (k, t)\nand on bottom right: the single diagram contributing to the scalar self-energy Πab\n(k,\nt).\neff\n\nrepresentation of Eq. (5.2) should be integrated over w0 according to Eq. (2.50) using the\ntwo-time effective propagators given by Eqs. (2.48) and (3.20), while taking great care of\nthe different phase factors in the number of coherence- and mass-shell propagators.\nWith the Feynman rules of Fig. 6 at hand none of the extensive labour discussed\nabove is needed and we can directly write down the final mixed representation expression\nfor Σeff (k, t):\nZ\ny2 X\nd4 q d4 p\nab\nba\niΣeff (k, t) =\niS ab (q, t)[i∆ab\ncp (p, t)δs,1 + i∆eff (p, t)δs,−1 ] ×\n2\n(2π)4 (2π)4 cq\nsb =±1\n\n×(2π)4 δ(k0 − cq q0 − ĉp [sb ]p0 )δ 3 (k − q − sp) . (5.3)\nThree observations are in place here: first we used a sum over the index sb together with the\nKronecker delta functions associated with the scalar propagators to account automatically\nfor the direction of the four momentum flow. Second, we defined Gab\nck to denote effective\n<,>\npropagators Eqs. (4.2 - 4.3) for which the coherence parts Gc,eff are combined with the\ncorrect cp,k -factors in the vertex δ-functions. Finally we took care of the implicit sb dependence of cp -factor in the scalar line by introducing the notation\nĉp [sb ] = cp δsb ,1 − δsb ,−1\n\n(5.4)\n\ninside the vertex delta-function. These notations will be useful later on. Note that the\nimplicit dependence in c signing out the coherent parts of the propagators still remains as\nexplained above.\nExpanding the sum in s and separating the coherence solutions, we find that for example the self-energy functions iΣ< = iΣ12 and iΣ> = iΣ21 become:\nZ\nd4 q d4 p\n<,>\n2\niΣeff (k, t) = y\n(2π)3 δ 3 (k − q − p) ×\n(2π)4 (2π)4\nh\n<,>\n× (2π)δ(k0 − q0 − p0 )iSm\n(q, t)i∆<,>\nm (p, t)\n<,>\n+ (2π)δ(k0 + q0 − p0 )iSc,eff\n(q, t)i∆<,>\nm (p, t)\n\n<,>\n+ (2π)δ(k0 − q0 + p0 )iSm\n(q, t)∆c,eff (p, t)\n\ni\n<,>\n+ (2π)δ(k0 + q0 + p0 )iSc,eff\n(q, t)∆c,eff (p, t) ,\n\n– 29 –\n\n(5.5)\n\n\f<\nwhere we used the fact ∆>\nm (−p, t) = ∆m (p, t) and ∆c,eff (p0 , −p, t) = ∆c,eff (p0 , p, t) (because\n<\nof the isotropy and the identity ∆>\nc,eff = ∆c,eff ≡ ∆c,eff ). Equation (5.5) shows explicitly\nhow different types of energy conservation are associated with the coherence propagators;\nthe delta-function associated with the Sm ∆m -term has the normal signature. Using the\nisotropy again we can combine the coherence and mass terms together under the same\ndelta function δ 4 (k − q − p) which can then be used to integrate over the momentum p,\neventually giving just:\nZ\nd4 q\n<,>\n<,>\n2\n ̃ <,> (k − q, t) ,\niΣeff (k, t) = y\niS̃eff\n(q, t)i∆\n(5.6)\neff\n4\n(2π)\n\nwhere we have further defined\n<,>\n<,>\n<,>\niS̃eff±\n= 2π(Sm±\n+ Sc∓\n) δ(k0 ∓ ωk )\n\n ̃ <,> =\ni∆\neff±\n\nπ\n<,>\n<,>\n( ± fm±\n+ fc∓\n) δ(k0 ∓ ωk ) .\nωk\n\n(5.7)\n\nNote that these functions differ from the effective propagators in Eq. (4.2) in that here the\ncoherence-shell functions appear in \"wrong\" energy shells.\nEquation (5.6) is remarkably simple; it can be obtained from the standard expression\n<,>\n ̃ <,> . Unfortunately such a\nfor Σ<,> by a direct substitution S <,> → S̃eff\nand ∆<,> → ∆\neff\nsimple rule does not generalize to arbitrary diagrams, as can be seen already from the oneloop scalar self-energy function Πeff . Indeed, a direct evaluation of the scalar self-energy\ndiagram shown in Fig. 7 gives\nZ\ny2\nd4 q1 d4 q2\nab\niΠeff (k, t) = −\nTr[iScabq (q1 , t)iScbaq (q2 , t)] ×\n1\n2\n2\n(2π)4 (2π)4\n(5.8)\n×(2π)4 δ(q20 − cq1 q10 − k0 )δ 3 (q20 − q10 − k) ,\nfrom which it is now easy to see that the self-energy functions Π<,>\neff become:\nZ\ny2\nd4 q\n>,<\n<,>\n(k,\nt)\n=\n−\niΠ<,>\n(k − q, t)] .\n(q, t)iSeff\nTr[iS̃eff\neff\n2\n(2π)4\n\n(5.9)\n\n<,>\nis made only for the fermion line which is flowing\nThat is, the substitution of S <,> → S̃eff\nout from the special vertex t, while for the fermion propagator flowing into the vertex\n<,>\n. These simplifications generalize for propagators directly\nthe substitution is S <,> → Seff\nconnected to the special t-vertex in arbitrary diagrams. In all other cases the assignment\nof energy signs in the coherence propagators is more complicated and can only be worked\nout by a use of the full Feynman rules of section 4.\n\n5.1 A two-loop example\nLet us next consider a more complicated 2-loop example. The contribution from the\ndiagram shown in Fig. 8 to Σab is:\niΣab\neff (k, t)\n\nZ Y\n3\n2\ny4 X X\nd4 qi Y d4 pj\n=\nδsf ,−sb\n[iScaf\n(q1 )iScfq2e (q2 )iScebq3 (q3 )] ×\nq1\n4\n4\n2\n2\n4\n(2π)\n(2π)\nf\nf e se ,s ,sb\n1 2 2\n\ni=1\n\nj=1\n\n– 30 –\n\n\ff\n\nq1\nk = (±ωk , k)\n\np2\nq2\n\nt, a\n\nk\n\nb\n\nq3\n\np1\ne\n\nFigure 8: The two-loop 2PI-fermion self-energy diagram. Each scalar propagator goes in both\ndirections, so the diagram represents four independent terms. The special vertex a corresponding\nto the external time t is again marked by a black dot, while the internal vertices are shown by open\ndots. Full explanation in text.\n\n× (2π)12 δ 3 (q2 − q1 − sf2 p2 )δ 3 (q3 − q2 − se1 p1 )δ 3 (k − q3 − sb2 p2 )\n\n× δ(q20 − cq1 q10 − ĉfp2 p20 )δ(q30 − cq2 q20 − ĉep1 p10 )δ(k0 − cq3 q30 − ĉbp2 p20 )\nbf\nea\nfb\n× [i∆ae\ncp1 (p1 )δse1 ,1 + i∆eff (p1 )δse1 ,−1 ] [i∆cp2 (p2 )δsf ,1 + i∆cp2 (p2 )δsb ,1 ] ,\n2\n\n2\n\n(5.10)\n\nwhere we have suppressed the t-arguments in propagators for clarity. We also continued\nusing the tagging on propagators Gab\nck introduced in the 1-loop example above, as well as\nthe Kronecker delta notation and sgk -sums to indicate all possible directings of the scalar\nvertices. We also used the shorthand ĉbp ≡ ĉp [sbp ] for the notation Eq. (5.4) in the vertex\ndelta functions. These notations unambiguously indicate the scalar momentum flow in the\ninternal vertices and whether the coherence solution is to get a nontrivial sign or not.\nNow, because the momentum p10 appears only in one of the delta-functions, we can\nabsorb the index cep1 to a scalar propagator by effecting a transformation p10 → cp1 [se ]p10 ,\n ̃ ae\nwhich amounts to the substitution ∆ae\ncp1 (p1 ) → ∆eff (p1 ). The same argument applies to\nthe energy variable q10 corresponding to the fermion propagator flowing into the special\naf\nt-vertex, which we can deal with by a change q10 → cq1 q10 , causing Scaf\nq1 (q1 ) → S̃eff (q1 ).\nBeyond these simplifications associated with the special vertex t no significant reduction is\npossible. Being careful in particular with the scalar flow direction assignments on vertices\ne and f one eventually finds:\nZ 3\n2\ny 4 X Y d4 qi Y d4 pj\naf\nab\n ̃ ae (p1 )]\n[iS̃eff\n(q1 )i∆\niΣeff (k, t) =\neff\n4\n4\n2\n(2π)\n(2π)\nfe\n\n×\n\n×\n\ni=1\n\nj=1\n\nfb\niScfq2e (q2 )iScebq3 (q3 )[i∆bf\ncp2 (p2 ) + i∆cp2 (−cp2 p2 )]\n(2π)12 δ 3 (q2 − q1 − p2 )δ 3 (q3 − q2 − p1 )δ 3 (k −\n\nq 3 + p2 ) ,\n\n× δ(q20 − q10 − cp2 p20 )δ(q30 − cq2 q20 − p10 )δ(k0 − cq3 q30 + p20 ) .\n\n(5.11)\n\n<,>\n ̃ <,> were defined in Eqs. (5.7). The special\nThe effective Wightman functions S̃eff\nand ∆\neff\n22 (G again denotes S or ∆) are given by the analogous\ndiagonal propagators G̃11\nand\nG̃\neff\neff\n−\nrelations to Eq. (4.3) with G<\nreplaced\nby G̃<\neff\neff everywhere, and the functions G̃eff again\ncorrespond to functions G̃<\neff from which the vacuum parts have been subtracted out.\n\n– 31 –\n\n\fParticular self-energy functions, and particular sub-contributions to these self-energies\nare obtained by assigning special values for the time-contour indices a, b, e and f in\nEq. (5.11). Let us consider one example here for illustration. Choosing aef b = 1112 we\nget a two-loop correction to the self-energy function Σ< = Σ12 :\nZ\ny2\nd4 q3 d4 p2 111\n<\n21\niΣeff (k, t)1112 =\niΛ (q3 , p2 , t)iSc12q3 (q3 )[i∆12\ncp2 (p2 ) + i∆cp2 (−cp2 p2 )]\n2\n(2π)4 (2π)4\n×(2π)4 δ(k0 − cq3 q30 − cp2 p20 )δ 3 (k − q3 − p2 ) ,\n(5.12)\nwhere the function Λ111 is given by\nZ\nd4 q2 d4 p1\n111\n2\n ̃ 11 (p1 )]iS 11 (q2 )\niΛ (q3 , p2 , t) ≡ y\n[iS̃ 11 (q2 + p2 )i∆\ncq2\neff\n(2π)4 (2π)4 eff\n×(2π)4 δ(q30 − cq2 q20 − p10 )δ 3 (q3 − q2 − p1 ) .\n\n(5.13)\n\nNote that the self-energy function (5.12) becomes equivalent with the 1-loop result shown\nin Eq. (5.3) when iΛ111 → 1. In this sense Λ111 can be interpreted as a one-loop vertex\nfunction correction to the 1-loop self-energy. On practical side, observe that the coherence\nparts of Sc12q3 (q3 ) in Eq. (5.12) and Sc11q2 (q2 ) in Eq. (5.13) are associated with a different phase\nspace integrals than the non-coherent parts, due to the cqi -dependence of the remaining\nenergy delta functions. This dependence is passed onto the arguments of the other propagators when one performs the integral over the remaining delta function. Of course there are\nother contributions to Σ< and also Σ> is needed to compute the corresponding collision integrals in the quantum Boltzmann equations. Nevertheless, we believe that these examples\namply display the feasibility of the use of our Feynman rules for practical diagrammatic\ncalculations in coherent perturbation expansions. In particular, a two-loop calculation\nsimilar to the one presented above, but generalized to the multiflavour case [16], will be\nrelevant in the context of resonant leptogenesis [8].\n5.2 Direction independent Feynman rules\nThe result (5.10) for the first time displays fully internal scalar and fermion propagators.\nIn particular, it shows how the internal scalar propagators combine to a form which is\ninsensitive to the choice of flow directions of the scalar lines. We can use these findings to\nreformulate the direction dependent Feynman rules of Fig. 6 in an even more useful form.\nThe complete rules can now be stated as follows:\n• Draw the diagram just as in the vacuum field theory and associate the usual vacuum\nsymmetry factor with it.\n• Give each vertex an index sbp associated with the direction of the scalar field, and use\nthe vertex Feynman rule\nφψ̄ψ : −iy (2π)4 δ(q00 − cq q0 − ĉp [sbp ]p0 )δ 3 (q0 − q − sbp p) ,\n\n(5.14)\n\nwhere ĉp [sbp ] ≡ cp δsbp ,1 − δsbp ,−1 , where cp = −1 for the coherence parts of the propagators, and cp = 1 otherwise.\n\n– 32 –\n\n\fiScabbq (q, t)\na\n\nq\n\nb\n\n−iy(2π)4δ 3 (q′ − q − sp)\n\n×δ(q0′ − cq q0 − ĉp[s]p0)\n\nq\nsp\n\niDcabpsasb (p, t)\n\nq′\na\n\np\n\nb\n\nFigure 9: The final direction independent rules including the coherence.\n\n• For each fermion line in the diagram, substitute a sign-tagged propagator Scabq (q, t),\nwhere the index cq explicitly keeps track of the coherence sign in the effective fermion\nab (q, t) defined in Eqs. (4.2-4.3).\npropagator Seff\n• For each scalar line substitute a propagator\niDcabp ,sa ,sb (p, t) ≡\n\ni\n1 h ab\na ,1 δ a\ni∆cp (p, t)δsb ,1 + i∆ba\n(p,\nt)δ\ns\ns ,−sb ,\ncp\n2\n\n(5.15)\n\nwhere ∆cd\ncp (p, t) is again the sign-tagged propagator corresponding to the effective\nscalar propagator ∆cd\neff (p, t) defined in Eqs. (4.2-4.3).\n• Sum over all indices sbp associated with all vertices.\n• All other Feynman rules associated with the momentum integrations and negative\nsigns associated with closed fermion loops are as usual.\nSpecial simplifications of the rules apply for propagators connected to the external vertex\nt; see the discussion below Eq. (5.9). These direction independent rules are presented\ngraphically in the figure 9.\n5.3 Explicit 1-loop collision integrals for fermions\nWe now compute the final expressions for the fermionic collision integrals (2.61) following\nfrom our above examples for Σeff . To keep our expressions simple we only consider the\n1-loop diagram, and that the scalar field is in thermal equilibrium with (see eg. [5]):\n<,>φ\n2\n2\ni∆<,>\neq (p) = 2π sgn(p0 )feq,sgn(p0 ) (p)δ(p − mφ ) ,\nφ\n\n(5.16)\n\n<φ\n>φ\n<φ\nwhere feq±\n(p) = 1/(e±β ωp − 1) and feq±\n(p) = 1 + feq±\n(p) with β = 1/Tφ . Using the\nequilibrium propagator (5.16) in Eq.(5.6), going back to the form with both q- and pintegrals and integrating over q0 and p0 using the on-shell delta functions in the propagators,\n\n– 33 –\n\n\fwe find\niΣ<,>\neff (±ωk , k; t)\n\n=y\n\n2\n\nX Z\nh,sp ,sq\n\nd3 p\nd3 q\n(2π)4 δ 3 (k − q − p)\n(2π)3 2ωp (2π)3\n\n<,>\n<,>\n<,>φ\n× δ(±ωk − sq ωq − sp ωpφ )feq,s\n(p)[Smh,s\n(q) + Smh,−s\n(q)] .(5.17)\np\nq\nq\n\nThe sign-factors sq,p appear in Eq. (5.17) as a result of projections on positive and negative\nenergy shells after integrations over q0 and p0 ; they should not be confused with the\norientation signs encountered in our Feynman rules. According to the standard 3-particle\nkinematics the momentum delta functions have roots only if mφ ≥ 2|m(t)| and only for\nthe signatures, δ(ωk + ωq − ωpφ ) and δ(−ωk − ωq + ωpφ ), so that each on-shell self-energy\nfunction has only one contribution coming from the sum in Eq. (5.17). Employing the\ndecompositions (2.53) we finally get:\niΣ<,>\neff (±ωk , k, t)\n\nd3 q\nd3 p\n(2π)4 δ(ωk + ωq − ωpφ )δ 3 (k − q − p)\n2ωq (2π)3 2ωpφ (2π)3\nX\n\u0001\n<,>\n<,>\n<,>φ\nKmh0 ∓ (q)fmh\n. 5.18)\n(p)\n×feq±\n0 ∓ (q; t) + Kch0 ± (q)fch0 ± (q; t) (\n\n=y\n\n2\n\nZ\n\nh0\n\nGiven Eq. (5.18) it is a simple matter to calculate the scalar self-energy functions Σ<,>\njh±\nwhich appear in Eqs. (2.61)6 . Multiplying (5.18) by the projectors Kjh± and taking the\ntraces we find:\nZ\nd3 q\nd3 p\n<,>\n<,>φ\nΣjh± =\nδ(ωk + ωq − ωpφ )δ 3 (k − q − p) feq±\n(p)\n3\nφ\n3\n2ωq (2π) 2ωp (2π)\nX\n<,>\n<,>\n2\n0\n×\n(M2mj± (h0 , h, q, k)fmh\n(5.19)\n0 ∓ (q; t) + Mcj± (h , h, q, k)fch0 ± (q; t)) ,\nh0\n\nwhere the generalized squared matrix elements are given by the traces:\nM2mj± (h0 , h, q, k) = y 2 Tr[Kmh0 ∓ (q)Kjh± (k)]\n\nM2cj± (h0 , h, q, k) = y 2 Tr[Kch0 ± (q)Kjh± (k)] ,\n\n(5.20)\n\nwith j = m, c. Note that these matrix elements are not in general real (see Eqs. (5.24-5.25)\nbelow). Given the self-energy functions Σ<,>\njh± we can now combine all terms appearing in\n6\n\nNote that the signature of the ωq and q in the energy- and momentum conservation delta functions are\ndifferent. This is because one of the fermions labelled by k and q must be an antiparticle corresponding\nto a negative energy state in our language. That is if, say, the k-state is a positive energy particle, then\nthe q state must have a negative frequency. However, since in Eq. (5.18) we wrote the energies in terms of\npositive physical frequencies, which makes the momentum q to appear with a \"wrong\" sign. The solution\nis of course that here the physical 3-momentum of the antiparticle is just −q. The same argument applies\nto the case where the k-state is an antiparticle. We could reinstate the normal signatures by a change\nk → ±k. p → ±p and q → ∓q, and the corresponding Feynman-Stückelberg reinterpretation of the\nf -factors. However, there is no practical advantage of making this change and it is easier to keep using the\nunphysical momenta instead.\n\n– 34 –\n\n\fthe r.h.s. of the Eqs. (2.61) to form the complete collision integrals Cjh± . The mass-shell\ncollision integrals are in this way found to be:\nZ\n1 X\nd3 p\nd3 q\nCmh± [fα ] = <\n(2π)4 δ̂ 4 (k − q − p) ×\n2ωk 0\n2ωq (2π)3 2ωpφ (2π)3\nh\nh\n<φ\n<\n>\n× M2mm± feq±\n(p)fmh\n0 ∓ (q)fmh± (k)\n<φ\n<\n>\n+ M2cm± feq±\n(p)fch\n0 ± (q)fmh± (k)\n\n<φ\n<\n>\n+ M2mc∓ feq∓\n(p)fmh\n0 ± (q)fch∓ (k)\ni\n<φ\n<\n>\n+ M2cc∓ feq∓\n(p)fch\n(q)f\n(k)\n− [ >↔< ] ,\n0∓\nch∓\n\n(5.21)\n\nwhere we defined a shorthand notation δ̂ 4 (k − q − p) ≡ δ(ωk + ωq − ωpφ )δ 3 (k − q − p). As\nusual, we see that the distribution products in the Boltzmann equations are independent\nof the form of the interactions, the details of which are entirely encoded in the matrix\nelements. The first line in equation (5.21), which contains only the mass-shell distribution\nfunctions, corresponds to the usual collision integral in the standard Boltzmann equations.\nIndeed, rewriting the distribution functions in terms of the usual particle and antiparticle\nnumbers, one finds for example the familiar form:\n>φ\n<\nfeq+\n(p)fh>0 − (−q)fh+\n(k) = (1 + nφeq (p))n̄h0 (q)nh (k) .\n\n(5.22)\n\nOne could similarly rewrite all the other products of distributions appearing in Eq. (5.21)\nusing the particle and antiparticle distribution functions. However, since fα 's are the\nquantities which naturally appear in all our loop calculations and in our equations of\nmotion, we will stick to this notation in what follows. The second line in Eq. (5.21) comes\nfrom an internal coherence line in our one-loop diagram, corresponding to a coherence\nmodulation of a scattering rate off a state with momentum q. The third line represents an\non-shell contribution to the collisional coupling between the mass and coherence shells in\nthe mass-shell equation, and the last term gives the coherence modulation of this collisional\ncoupling term. The coherence collision integral Cch± is somewhat more complicated:\nZ\nd3 q\nd3 p\n1 X\nCch± [fα ] =\n(2π)4 δ̂ 4 (k − q − p) ×\n2ωk 0\n2ωq (2π)3 2ωpφ (2π)3\nh ,s\nh\n<φ\n<\n>\n× M2mm± feq±\n(p)fmh\n0 ∓ (q)fch± (k)\n<φ\n<\n>\n+ M2cm± feq±\n(p)fch\n0 ± (q)fch± (k)\n\n<φ\n∗\n<\n>\n+ ξk M2mc±\nfeq±\n(p)fmh\n0 ∓ (q)fmh± (k)\n<φ\n∗\n<\n>\n+ ξk M2cc±\nfeq±\n(p)fch\n0 ∓ (q)fmh± (k)\ni\n+ (± ↔ ∓)∗ − [ >↔< ] .\n\n(5.23)\n\nThe interpretation of the various terms in this equation should be obvious now. Finally,\nfor completeness, we give the explicit expressions of the matrix elements Mab± following\n\n– 35 –\n\n\ffrom our 1-loop example. A straightforward evaluation of the traces in Eq. (5.20) gives:\nM2mm± = M20\nmR 2\nM0 ± M2R − iM2I\nM2cm± = ±\nωq\nmR 2\nM2mc± = ∓\nM0 ± M2R − iM2I\nωk\nm2R\nmR mR\nmR mR\n)M20 + (\n)M2R ± i(\n+\nM2cc± = (1 −\n−\n)M2I ,\nωk ωq\nωk\nωq\nωq\nωk\nwhere we have defined:\nh\ni\nM20 ≡ y 2 (1 + h0 h q̂ * k̂)(q * k − m2R + m2I ) + h0 h|q||k|(1 − (q̂ * k̂)2 )\nh\ni\nM2R ≡ y 2 (1 + h0 h q̂ * k̂) mR (ωq − ωk )\nh\ni\nM2I ≡ y 2 (1 + h0 h q̂ * k̂) mI (h0 |q| − h|k|) ,\n\n(5.24)\n\n(5.25)\n\nwhere q̂ * k̂ = cos θ is the angle between fermion momenta and the product of fermion four\nmomenta is q * k = 12 m2φ − |m(t)|2 . Note in particular that the squared matrix elements\nM2mm± are real and equivalent to the standard expression for a scalar field decaying to\nfermions after one makes the usual Feynman-Stückelberg interpretation of the negative\nenergy states as the positive energy antiparticles.\n\n6. Applications\nIn this section we consider numerical examples in the case where the fermion mass changes\nabruptly but continuously from zero to a finite value. To be specific, we model the change\nby a kink profile:\nm∞\nt − t0\n(1 + tanh\n)\n2\nτ\n∆θ\nt − t0\nθ(t) =\n(1 − tanh\n),\n2\nτ\n\n|m(t)| =\n\n(6.1)\n\nand we assume that the fermion is interacting with a scalar φ and another fermion field q,\nthrough a non-diagonal Yukawa-interaction term\nLint = −y ψ̄R φ qL + h.c. .\n\n(6.2)\n\nFor simplicity we also assume that the scalar φ is thermal and fermion q is in kinetic\nequilibrium with an effective chemical potential μq (t). With these assumptions the self\nenergies Σeff reduce to the usual thermal expressions, where Σ<,> are related by the KuboMartin-Schwinger relation: Σ> = eβ(k0 −μq ) Σ< , and\n0\n<\nΣ< (k) = (Σ<\n0 γ − Σ3 k̂ * γ) PR ,\n\n– 36 –\n\n(6.3)\n\n\f0.2\n\nΣ<\n\nm++\nRe Σ<c++\nIm Σ<\nc++\nΣ<\nm−+\n<\nRe Σc−+\n<\nIm Σc−+\n\n0.15\n\n0.1\n\nΣ<\nx\n0.05\n\n0.15\n\n0.1\n\nΣ<\nx\n0.05\n\n0\n\n0\n\n−0.05\n\n−0.05\n−6\n\n0.2\n\n−4\n\n−2\n\n0\n\n2\n\n4\n\n6\n\n0\n\n1\n\n2\n\nt\n\n3\n\n4\n\n5\n\n6\n\n|k|\n\nFigure 10: Shown are the various self-energy components Σ<\njh+ (for positive energies only) defined\nin Eqs. (6.8) as a function of tm∞ for a fixed |k|/m∞ ≡ 1 (left panel) and as a function of |k|/m∞\nfor a fixed tm∞ ≡ 0 (right panel). For other parameters we used t0 = 0, τ = 2/m∞ , ∆θ = −1.0,\nT = 10m∞ , mq = 10m∞ , mφ = 5m∞ , μq = 0 and y = 0.3.\n\nwhere k̂ = k/|k| and iΣ<\n0,3 are real-valued functions, whose expressions at the mass shells\nare (remember that ωk = ωk (t) depends on time through the mass function)\ny2T 2\n|I1 (±ωk , |k|)|\n8π|k|\n\u0013\n\u0012\ny2T 2\n|α| |m|2\n<\n|I0 (±ωk , |k|)| ,\nvk iΣ3 (±ωk , |k|) = ±\n|I1 (±ωk , |k|)| −\n8π|k|\nωk2\niΣ<\n0 (±ωk , |k|) =\n\nwhere we defined vk ≡ |k|/ωk and\nZ\nIn (k0 , |k|) = θ(λ)\n\nα+δ\n\ndy y n\n\nα−δ\n\n1\n,\n(ey−μq /T + 1)(ek0 /T −y − 1)\n\n(6.4)\n(6.5)\n\n(6.6)\n\nwith\nα=\nδ =\n\n|m|2 + m2q − m2φ k0\n2|m|2\n\nT\n\nλ1/2 (|m|2 , m2q , m2φ ) |k|\n2|m|2\nT\n\n,\n\n(6.7)\n\nwhere λ(a, b, c) = (a + b − c)2 − 4bc is the usual kinematic phase space function. Note that\nboth Σ0 and Σ3 have finite limit when |k| → 0 despite the apparent singularity, because the\nintegration region ∝ δ ∝ |k|. The chemical potential μq is calculated from the conservation\nof the fermionic charge in the specified interaction. For the projected self-energy functions\nΣ<,>\njh± in the collision integrals (2.61) we find the expressions:\n1\n<,>\n(1 ± hvk )(iΣ<,>\n0 (±ωk ) − hiΣ3 (±ωk ))\n2\n1\n<,>\n=−\n(hmR vk ∓ imI )(iΣ<,>\n0 (±ωk ) − hiΣ3 (±ωk )) .\n2ωk\n\nΣ<,>\nmh± =\nΣ<,>\nch±\n\n– 37 –\n\n(6.8)\n\n\fFigure 11: Shown is the excess total particle number density (nk + n̄k ) − (nk eq + n̄k eq ) (left) and\nthe magnitude of total particle - antiparticle coherence density f ̃c (k) (right).\n\nLet us note that we used the self-energy function (6.3) also in the numerical examples\nin our earlier work [12]. However, at that time the relevance of the resummation of the coherence oscillations was not realized, and so the coherence-shell self-energy was erroneously\ncomputed in ref. [12] by naively projecting Σ<,> to the k0 = 0 shell. This shows that the\neffects of resummation are nontrivial even when the primary self-energy is thermal. Typical behaviour of the self-energies is displayed in figure 10. On the left panel we show the\ntime dependence of the self-energies Σ<\njh+ over the wall region, and on the right panel their\n|k|-dependence at a fixed time tm∞ = 1 during the transition. In all figures in this section\nthe time is measured in units m−1\n∞ and the momenta in units m∞ , where m∞ is the absolute value of the mass of the fermion at the infinite future m∞ ≡ |m(t = ∞)|. Note that\nat very early times, where the ψ-field is massless, only Σ<\nm++ is nonzero as expected for\na right chiral interaction term in association with a positive helicity state. Once the field\nbecomes massive all self-energies evolve differently as a function of the increasing mass.\nIn particular the imaginary parts of Σ<\nch+ are very small and nonzero only inside the wall\n<\nregion, confined to |tm∞ | ∼ 2. In the right panel we again see that the right helicity massshell self-energy is by far the largest, while the other components rapidly become vanishing\nwhen the momentum increases and one again effectively approaches the massless limit. It\nshould also be observed that while the mass-shell functions are strictly positive definite,\nΣ<\nch+ 's which appear as cross-interaction terms between the mass- and coherence-shells in\nthe collision terms (2.61) can have either sign.\nWe have solved numerically the quantum Boltzmann equations (2.35-2.36) with collision integrals (2.61) where the projected functions Σjh± are given by Eq. (6.8) for the\nmass profile defined in Eq. (6.1). Our results are shown in Figs. 11 and 12. In the left\npanel of Fig. 11 we show the evolution of the |k|-dependent excess total particle number\nP\ndensity (nk + n̄k ) − (nk eq + n̄k eq ), where nk =\nh nkh (similarly for n̄), and nkh and\nn̄kh were defined through the Feynman-Stückelberg interpretation in Eq. (2.17). In the\n\n– 38 –\n\n\f0\nFigure 12: Shown is the total right chiral number density jR\n(k) (left) and the total charge density\n0\n(net particle - antiparticle asymmetry) j (k) (right). We used the same parameters as in Fig. 11.\n\nright panel of Fig. 11 we show the total particle-antiparticle coherence density defined as\nP\nf ̃c (k) ≡ 21 h± |f ̃ch± (k)|, where the individual coherence functions f ̃ch± are canonically\nnormalized according to Eq. (2.59). The |k|-dependent baseline for the colour coding in\nfigures was defined by the adiabatic thermal Fermi-Dirac distribution nkh eq = n̄kh eq =\n1/(exp(βωk ) + 1), which ranges from 2 at the low end to ≈ 1 at the high end of the plotted phase space area. Finally, we used parameters t0 = 0, τ = 2/m∞ and ∆θ = −1.0\nfor the kink, and T = 10m∞ , mq = 10m∞ and mφ = 5m∞ for the self-energy. For the\nYukawa coupling we used y = 0.3. As a boundary condition, all fields including the coherently evolving fermion were are assumed to be in thermal equilibrium without chemical\npotentials in the distant past.\nBoth quantities shown in Figs. 11 vanish in the equilibrium conditions, when no coherence evolution takes place. However, creation of extra excitations and coherence is clearly\nseen in the plots. As expected, most of the excitations are created in non relativistic modes\nnear the transition time. As time goes on, the asymmetry diffuses towards the higher momenta in the phase space. The exact quantitative details are of course dependent on the\nkink and the interaction parameters. The creation of the extra modes seen in the left\npanel, is associated with narrow bands of damped oscillations in the coherence distribution f ̃c shown in the right panel. Just like the difference from equilibrium, the coherence\nfunction is restricted in time to near the phase transition time and in momentum to nonor near relativistic region. The canonically normalized coherence functions are roughly by\na factor of five smaller than the deviations from equilibrium in the mass-shell functions.\nIn Fig. 12 we show some current densities derived from the same data we used to create\n0 = hψ̄γ 0 P ψi =\nFigs. 11. In the left panel we show the total right chiral number density jR\nR\nP 0\n<\n0\nh jhR . Using the cQPA correlation function we can write jhR = Tr[S̄h PR ] in terms of\n\n– 39 –\n\n\fthe on-shell distribution functions as follows:\ni\n1h\nmI\nmR <\n0\njhR\n(k) = (1 + hvk )nkh − (1 − hvk )n̄kh − hvk\n<fch+ +\n=f < ,\n2\nωk\nωk ch+\n\n(6.9)\n\nwhere the vacuum contribution has been subtracted off. The result again displays the\noscillatory behaviour driven by nonzero coherence distributions fc± in near relativistic\nmodes right after the transition. The right chirality of our chosen interaction term (6.2)\nleads to a temporal charge separation between fields ψ and q after the transition. This\neffect produces the effective chemical potential for the field q mentioned above, and a net\nP\nP\nparticle-antiparticle number density asymmetry j 0 = hψ̄γ 0 ψi = h jh0 = h Tr[S̄h< ] for\nthe field ψ. With the vacuum part again subtracted off we find:\njh0 (k) = nkh − n̄kh .\n\n(6.10)\n\nWe show the net asymmetry in the right panel of Fig. 12. Of course the total, combined\nfermion number of ψ and q fields is conserved, because no net fermion number production\ntakes place in the absence of sphaleron processes.\n6.1 Error analysis\nIn the cQPA scheme the collision terms are computed to the zeroth order of the gradient\nexpansion in time derivatives of the mass function m(t). The effects of the neglected\ngradient corrections are twofold: first, the gradient corrections to the constraint equations\nwould broaden the singular phase space structure of the 2-point functions S <> [25]. As\na result e.g. the self-energy functions in Eq. (2.49) (or in expressions (6.8)) would not be\nevaluated at exactly on shell, but rather convolved with distributions which are peaked but\nnonsingular functions at the on-shell momenta. However if, as is generally the case, the\nself-energy functions are smooth in the scale set by the width of the distribution functions,\nthe correction from this effect should be very small.\nSecond, and more importantly, there are explicit gradient corrections to the collision\nterm involving the derivatives ∂t S and ∂t Σ, which (after performing the zeroth order resummation) are proportional to mass gradients. It is not easy to estimate the precise\nnumerical error coming from neglecting these gradients. However, a naive estimate for the\nrelative error in the collision terms is given by dimensionless gradient expansion parameter:\n\u000f≡|\n\nm0\n|.\nmω\n\n(6.11)\n\nNote that \u000f depends both on time and on the momenta involved. In the example of this\nsection the bulk asymmetry is generated at momentum |k| ≈ 0.5 m∞ (see Fig. 12), and for\nthese modes, in the middle of the kink profile (6.1) at t = 0, where the gradients are largest,\nwe find \u000f ≈ 0.8. However, the error rapidly gets smaller as one moves away from the wall\nand it dies exponentially when |∆t| > τ . Thus \u000f alone does not provide a direct estimate\nof the error on the final results. Now, the quantities proportional to particle-antiparticle\nasymmetries are the most sensitive to variation of collision terms. In these cases the true\nΓ ∼ \u000fτ Γ. In the\nerror should be bounded by the product of \u000f with the wall width and Γ: δrel\n\n– 40 –\n\n\f−5\n\nx 10\n3\n2.5\n\nξeq\nq\n\nL\n\n2\n1.5\n1\n0.5\n0\n0\n\n20\n\n40\n\nt\n\n60\n\n80\n\n100\n\nμ\n\nFigure 13: Left-chiral quark chemical potential ξqL ≈ 12 TqL as a function of time. All components\nof the quark field are assumed to be in kinetic equilibrium at all times.\nΓ ∼ 0.1, suggesting our results may be accurate to within\ncurrent example we then find δrel\n10 per cent. For the \"bulk\"-quantities (not proportional to asymmetry) the collision term\nis not dominating the evolution and consequently we should expect a much smaller induced\nerror in these quantities. To test these arguments we redid our calculations by adding an\narbitrary correction to all self-energies of the form\n<,>\nΣ<,>\na;h± → Σa;h± (1 ± \u000f) ,\n\n(6.12)\n\nwhere a = m, c. Numerical results verify the analytical error estimates given above: the\nchiral number densities and charge densities shown in figure 12 and the chemical potential\nfor the q-species shown in figure 13 were seen to change by the expected 10%, while in\nthe excess of the total particle number density and the total particle antiparticle coherence\nsolutions of Fig. 11 the changes were at level < 1%. We believe that these evaluations\nprovide a generous upper limit for the true errors, because in reality not all gradient\ncorrections work coherently in the same direction.\nFinally, we wish to emphasize that these gradient corrections described above affect\nonly to the evaluation of the collision term; the flow term and thus the free theory evolution\nis exact in this approximation. Indeed, the set of distribution functions fα form a complete\nreparametrization of the components of zeroth moment integral of S < , so that even in the\nregion of large gradients where their interpretation as singular phase space distribution\nfunctions would break, they would still present the free theory evolution exactly.\n6.2 A toy model for coherent baryogenesis\nWe can construct a very simple toy model of baryogenesis using the above results. Let us\nassume that the field q in our example corresponds to a standard model quark, while ψ is\nsome new field with the complex time-varying mass m. We do not provide any details of the\nphase transition characteristics, except of noting that the order parameter field giving rise\nto ψ mass need not be related to the field φ in the interaction (6.2). While not needed for\na qualitative picture, such details would of course be necessary in a more serious modeling\n\n– 41 –\n\n\feffort. First, if q is a quark field, it would be held in kinetic equilibrium by the strong\ngauge interactions. We can assume that only one of the quarks (say the top quark) or\nany number of them are coupled to ψ through interaction (6.2); variations of this type\ncan be modeled by changing the strength of the coupling y. In addition, the strong chiral\nanomaly equilibrates the total left- and right chiral quark chemical potentials [3], whereby\nthe effective chemical potential sourcing the baryon number production is reduced by a\nfactor of two:\n1 μqL\nξqeqL ≈\n.\n(6.13)\n2 T\nGiven ξqeqL the total baryon asymmetry produced by the Electroweak anomaly can be computed from [3]:\n\u0010\n∂nB\n3\nnB \u0011\n= Γsph ξqeqL − A 3 ,\n(6.14)\n∂t\n2\nT\n5 T 4 is the Chern-Simons number diffusion rate across the energy\nwhere Γsph ≡ κsph αW\nbarrier which separates N -vacua of the SU(2) gauge theory, where κsph = 20 ± 2 [26].\nThe second term describes sphaleron-induced relaxation of the baryon asymmetry in the\nsymmetric phase:\nX\nX\nnB\nμqi +\n(6.15)\nA 2 ≡ μCS = 3\nμl i ,\nT\ni\n\ni\n\nwhere μCS is the Chern-Simons- and μl the leptonic chemical potential and constant A is\na model dependent quantity of order unity. We shall use a value A = 15/2 corresponding\nto the Standard Model particle content with flavour equilibrated chemical potentials apart\nfrom the right chiral leptons (see e.g. ref. [3]), but the actual value is not relevant. It is\nnow easy to integrate the equation (6.14) for the total baryon number produced:\nZ ∞\n3\ndt ξqeqL e−kB t ,\n(6.16)\nnB = Γsph\n2\n−∞\nwhere\nkB ≡\n\n3A Γsph\n.\n2 T3\n\nNow using ηB ≡ nB /nγ ≈ 7nB /s and η10 ≡ 1010 ηB , we find:\nZ ∞\nT\nη10 ≈ 1800(\n)\ndt̂ ξqeqL (t̂)e−k̂B t̂ ,\nm∞ −∞\n\n(6.17)\n\n(6.18)\n\nwhere t̂ ≡ tm∞ and we took g∗S = 110 for the number of entropy degrees of freedom. The\nback-scattering term k̂B ≡ kB /m∞ ≈ 1.24 × 10−6 T /m∞ is too small to affect our results\nas suggested above. For the results displayed in figures 11-12 we chose the parameters\nto optimize the display of the qualitative features of coherence solutions in the plots. We\nredid the numerical analysis for the baryogenesis model taking t0 = 0, τ = 3m∞ , ∆θ = π/2\nfor the kink, and T = 5m∞ , mq = 0, mφ = 5m∞ and y = 0.8 for the interactions. The\nresulting chemical potential ξqL (t̂) is shown in Fig. 13, and the baryon asymmetry given\nby Eq. (6.18) is\nη10 ≈ 7.5 .\n(6.19)\n\n– 42 –\n\n\fLet us point out that this model is not realistic in the sense that a single fermion complex\nmass term breaks the CPT-symmetry. The model should then be thought of being a part\nof a more complex multi-field mixing scenario where the single-field treatment can be used\nto approximate diagonal mass eigenstates in the non-degenerate limit. Another obvious\nconcern is the speed of transition giving rise to the ψ-mass. We do not try to speculate on\nthis issue any further, except note that perhaps such a \"quench\" could be effected through\na coupling to another scalar field along the lines discussed in ref. [27].\n\n7. Conclusions and outlook\nIn this work we have reformulated and extended our recently introduced quantum kinetic\ntheory for coherent, interacting fermionic and scalar fields in spatially homogeneous and\nisotropic systems. Our formalism is based on the coherent quasiparticle approximation\n(cQPA), where nonlocal coherence information is encoded in new spectral solutions at\noff-shell momenta. We have used the Schwinger-Keldysh formalism of non-equilibrium\nquantum field theory with pertinent approximations to derive the cQPA propagators in the\nspatially homogeneous background. In particular, we have now introduced the familiar 4dimensional Dirac notation for fermions, which allows us to use the standard Dirac algebra\nin the reduction of the matrix elements. The Dirac-structure of the coherence propagator\nliving at the shell k0 = 0 in particular is expressible as products of the usual mass-shell\nprojectors onto positive and negative energies, or alternatively as direct products of positive\nand negative energy eigenspinors. The coherence propagators are always rapidly oscillating\nfunctions of time.\nWe have shown that in the cQPA the Kadanoff-Baym equations for the 2-point functions in the Wigner representation reduce to a closed set of extended quantum Boltzmann\nequations (qBE) for the cQPA mass- and coherence-shell distribution functions. We observe that the collision integrals in these qBE's need to be resummed to all orders in\ngradients because of the rapid oscillations of the coherence-shell functions. We have performed this resummation and derived a set of generalized momentum space Feynman rules\nfor the theory, including effective 4-dimensional propagators endowed with the coherence,\nas well as an interaction vertex rule for a Yukawa theory. As a result of the resummation\nthe vertex rule displays a local energy non-conservation in association with the coherence\npropagators, however in a way that never violates the energy conservation at the level of\ncomplete self-energy diagrams.\nWe have given several examples of the diagrammatic calculations in our formalism,\nincluding 1-loop fermionic and scalar self-energies and a 2-loop fermionic self-energy in\na Yukawa theory. We have also applied the formalism to construct a simple toy model\nfor baryogenesis, where a coherent fermionic field is interacting with a thermal background\nscalar field and a Standard Model quark. In this model the CP-violation resulting from the\nC-breaking complex mass term of the ψ-field and the chirality breaking decay interaction\nleads to a nonzero chemical potential for the left chiral quarks, which then acts as a seed\nasymmetry biasing the Chern-Simons diffusion rate to produce baryons via the Electroweak\n\n– 43 –\n\n\fanomaly. The final baryon asymmetry created via this mechanism can be roughly of the\ncorrect magnitude to explain the observed baryon excess in the universe.\nIn this work we have considered only the case of a single fermionic and scalar field.\nA generalization of the current analysis to multiple coherently mixing fermion and scalar\nfields, including full flavour coherent propagators, flavoured quantum Boltzmann equations\nand a full set of flavour dependent Feynman rules will be presented in ref. [16]. The\nnatural applications of the formalism with multiple mixing fields include for example the\nneutrino flavour oscillations in the early universe and the resonant leptogenesis [8], where\nthe quantum coherence between the neutrino flavours may play an important role in the\ndynamics. For a realistic application to electroweak baryogenesis the formalism of this\nwork needs to be generalized to the case of a stationary planar symmetry, where the\ncoherence lives at the shell kz = 0. Based on our earlier work [11], we expect this case to\nbe highly analogous, although technically somewhat more complicated than the spatially\nhomogeneous formalism presented here. Also that formalism need to be developed for\nmany mixing fields. However, despite the fact that most realistic applications of the cQPA\nformalism appear to need a generalization to mixing fields, most novel aspects related to\nthe new coherence shells and resummation procedures necessary to define the appropriate\nFeynman rules should be qualitatively very similar to the techniques developed here.\n\nAcknowledgments\nThe work of MH was supported by the Gottfried Wilhelm Leibniz programme of the\nDeutsche Forschungsgemeinschaft. The work of PMR was supported by the Magnus Ehrnrooth foundation.\n\nReferences\n[1] A. Cohen, D. Kaplan, and A. Nelson, Progress in electroweak baryogenesis, in 43199427\n[hep-ph/9302210];\nV.A. Rubakov and M.E. Shaposhnikov, Electroweak baryon number non-conservation in the\nearly universe and in high-energy collisions, Usp. Fiz. Nauk 166 (1996) 493, Phys. Usp. 39\n(1996) 461 [hep-ph/9603208].\n[2] M. Joyce, T. Prokopec and N. Turok, Nonlocal electroweak baryogenesis. Part 2: The\nClassical regime, Phys. Rev. D 53, 2958 (1996) [hep-ph/9410282];\nElectroweak baryogenesis from a classical force, Phys. Rev. Lett. 75, 1695 (1995)\n[Erratum-ibid. 75, 3375 (1995)] [hep-ph/9408339];\nNonlocal electroweak baryogenesis. Part 1: Thin wall regime, Phys. Rev. D 53, 2930 (1996).\n[3] J. M. Cline, M. Joyce and K. Kainulainen, Supersymmetric electroweak baryogenesis, JHEP\n0007 (2000) 018 [hep-ph/0006119];\nSupersymmetric electroweak baryogenesis in the WKB approximation, Phys. Lett. B 417\n(1998) 79, [Erratum-ibid. B 448 (1999) 321] [hep-ph/9708393];\nJ. M. Cline and K. Kainulainen, A new source for electroweak baryogenesis in the MSSM,\nPhys. Rev. Lett. 85 (2000) 5519 [hep-ph/0002272].\n\n– 44 –\n\n\f[4] K. Kainulainen, T. Prokopec, M. G. Schmidt and S. Weinstock, First principle derivation of\nsemiclassical force for electroweak baryogenesis, JHEP 0106, 031 (2001) [hep-ph/0105295];\nSemiclassical force for electroweak baryogenesis: Three-dimensional derivation,\nPhys. Rev. D66 (2002) 043502 [hep-ph/0202177];\nQuantum Boltzmann equations for electroweak baryogenesis including gauge fields,\n[hep-ph/0201293].\n[5] T. Prokopec, M. G. Schmidt and S. Weinstock, Transport equations for chiral fermions to\norder h bar and electroweak baryogenesis. Part 1., Annals Phys. 314, 208 (2004)\n[hep-ph/0312110];\nTransport equations for chiral fermions to order h-bar and electroweak baryogenesis. Part II.,\nAnnals Phys. 314,267 (2004) [hep-ph/0406140].\n[6] M. Fukugita and T. Yanagida, Baryogenesis Without Grand Unification, Phys. Lett. B 174\n(1986) 45;\nS. Davidson, E. Nardi and Y. Nir, Leptogenesis, Phys. Rept. 466 (2008) 105 [arXiv:0802.2962\n[hep-ph]].\n[7] T. Endoh, T. Morozumi and Z. h. Xiong, Primordial lepton family asymmetries in seesaw\nmodel, Prog. Theor. Phys. 111 (2004) 123 [arXiv:hep-ph/0308276];\nA. Abada, S. Davidson, F. X. Josse-Michaux, M. Losada and A. Riotto, Flavour Issues in\nLeptogenesis, JCAP 0604 (2006) 004 [arXiv:hep-ph/0601083];\nE. Nardi, Y. Nir, E. Roulet and J. Racker, The importance of flavor in leptogenesis, JHEP\n0601 (2006) 164 [arXiv:hep-ph/0601084].\n[8] M. Flanz, E. A. Paschos and U. Sarkar, Baryogenesis from a lepton asymmetric universe,\nPhys. Lett. B 345 (1995) 248 [Erratum-ibid. B 382 (1996) 447] [arXiv:hep-ph/9411366];\nA. Pilaftsis, CP violation and baryogenesis due to heavy Majorana neutrinos, Phys. Rev. D\n56 (1997) 5431 [arXiv:hep-ph/9707235];\nA. Pilaftsis and T. E. J. Underwood, Resonant leptogenesis, Nucl. Phys. B 692 (2004) 303\n[arXiv:hep-ph/0309342];\nElectroweak-scale resonant leptogenesis, Phys. Rev. D 72 (2005) 113001\n[arXiv:hep-ph/0506107].\n[9] M. Garny, A. Hohenegger, A. Kartavtsev and M. Lindner, Systematic approach to\nleptogenesis in nonequilibrium QFT: vertex contribution to the CP-violating parameter, Phys.\nRev. D 80 (2009) 125027 [arXiv:0909.1559 [hep-ph]];\nSystematic approach to leptogenesis in nonequilibrium QFT: self-energy contribution to the\nCP-violating parameter, Phys. Rev. D 81 (2010) 085027 arXiv:0911.4122 [hep-ph];\nA. Anisimov, W. Buchmuller, M. Drewes and S. Mendizabal, Quantum Interference in a\nThermal Bath, Phys. Rev. Lett. 104 (2010) 121102 arXiv:1001.3856 [hep-ph];\nM. Beneke, B. Garbrecht, M. Herranen and P. Schwaller, Finite Number Density Corrections\nto Leptogenesis, arXiv:1002.1326 [hep-ph].\n[10] J. H. Traschen and R. H. Brandenberger, Particle production during out-of-equilibrium phase\ntransitions, Phys. Rev. D 42 2491 (1990);\nY. Shtanov, J. H. Traschen and R. H. Brandenberger, Universe reheating after inflation,\nPhys. Rev. D51 5438 (1995) [hep-ph/9407247];\nB. Garbrecht, T. Prokopec and M. G. Schmidt, Particle number in kinetic theory,\nEur. Phys. J. C 38, 135 (2004) [hep-th/0211219];\nJ. Berges and J. Serreau, Parametric resonance in quantum field theory, Phys. Rev. Lett. 91\n(2003) 111601 [arXiv:hep-ph/0208070];\n\n– 45 –\n\n\fJ. Berges, J. Pruschke and A. Rothkopf, Instability-induced fermion production in quantum\nfield theory, Phys. Rev. D 80 (2009) 023522 [arXiv:0904.3073 [hep-ph]].\n[11] M. Herranen, K. Kainulainen and P. M. Rahkila, Towards a kinetic theory for fermions with\nquantum coherence, Nucl. Phys. B 810 (2009) 389 [arXiv:0807.1415 [hep-ph]].\n[12] M. Herranen, K. Kainulainen and P. M. Rahkila, Quantum kinetic theory for fermions in\ntemporally varying backgrounds, JHEP 0809 (2008) 032 [arXiv:0807.1435 [hep-ph]].\n[13] M. Herranen, K. Kainulainen and P. M. Rahkila, Kinetic theory for scalar fields with nonlocal\nquantum coherence, JHEP 0905 (2009) 119 [arXiv:0812.4029v2 [hep-ph]].\n[14] M. Herranen, K. Kainulainen and P. M. Rahkila, Coherent quasiparticle approximation cQPA\nand nonlocal coherence, [arXiv:0912.2490 [hep-ph]].\n[15] M. Herranen, Quantum kinetic theory with nonlocal coherence, PhD Thesis, University of\nJyväskylä Res. Rep. 3/2009 [arXiv:0906.3136 [hep-ph]].\n[16] C. Fidler, M. Herranen, K. Kainulainen and P. M. Rahkila, Flavoured quantum Boltzmann\nequations from cQPA in preparation.\n[17] B. Garbrecht, T. Prokopec and M. G. Schmidt, Coherent baryogenesis, Phys. Rev. Lett. 92\n(2004) 061303 [arXiv:hep-ph/0304088];\nSO(10) - GUT coherent baryogenesis, Nucl. Phys. B 736 (2006) 133 [arXiv:hep-ph/0509190].\n[18] J. S. Schwinger, Brownian motion of a quantum oscillator, J. Math. Phys. 2 (1961) 407;\nL. V. Keldysh, Diagram technique for nonequilibrium processes, Zh. Eksp. Teor. Fiz. 47\n(1964) 1515 [Sov. Phys. JETP 20 (1965) 1018].\n[19] E. Calzetta and B. L. Hu, Nonequilibrium Quantum Field Theory, Cambridge, UK: Univ. Pr.\n(2008) 535 p.\n[20] L. Kadanoff and G. Baym, Quantum Statistical Mechanics, Benjamin, New York (1962).\n[21] J. M. Luttinger and J. C. Ward, Ground state energy of a many fermion system. 2, Phys.\nRev. 118 (1960) 1417:\nJ. M. Cornwall, R. Jackiw and E. Tomboulis, Effective Action For Composite Operators,\nPhys. Rev. D 10 (1974) 2428;\nK. c. Chou, Z. b. Su, B. l. Hao and L. Yu, Equilibrium And Nonequilibrium Formalisms Made\nUnified, Phys. Rept. 118 (1985) 1;\nE. Calzetta and B. L. Hu, Nonequilibrium Quantum Fields: Closed Time Path Effective\nAction, Wigner Function and Boltzmann Equation, Phys. Rev. D 37 (1988) 2878.\n[22] P. Danielewicz, Quantum Theory Of Nonequilibrium Processes. 1, Annals Phys. 152 239\n(1984);\nS. Mrowczynski and U. W. Heinz, Towards a relativistic transport theory of nuclear matter,\nAnnals Phys. 229 1 (1994).\n[23] R. Kubo, Statistical Mechanical Theory Of Irreversible Processes. I, J. Phys. Soc. Jap. 12\n(1957) 570;\nR. Kubo, M. Yokota and S. Nakajima, Statistical Mechanical Theory Of Irreversible\nProcesses. II, J. Phys. Soc. Jap. 12 (1957) 1203;\nP. C. Martin and J. S. Schwinger, Theory of many particle systems. I, Phys. Rev. 115 (1959)\n1342.\n[24] M. Le Bellac, Thermal Field Theory, Cambridge, UK: Univ. Pr. (2000) 256 p.\n\n– 46 –\n\n\f[25] K. Kainulainen, J. Pasanen and P. M. Rahkila, in preparation.\n[26] G.D. Moore and K. Rummukainen, Classical sphaleron rate on fine lattices, Phys. Rev. D. 61\n(2000) 105008.\n[27] K. Enqvist, P. Stephens, O. Taanila and A. Tranberg, Fast Electroweak Symmetry Breaking\nand Cold Electroweak Baryogenesis, arXiv:1005.0752 [astro-ph.CO].\n\n– 47 –\n\n\f"}