{"id": "http://arxiv.org/abs/1105.0510v1", "guidislink": true, "updated": "2011-05-03T08:27:26Z", "updated_parsed": [2011, 5, 3, 8, 27, 26, 1, 123, 0], "published": "2011-05-03T08:27:26Z", "published_parsed": [2011, 5, 3, 8, 27, 26, 1, 123, 0], "title": "Voting in a Stochastic Environment: The Case of Two Groups", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1105.5424%2C1105.4250%2C1105.0537%2C1105.2337%2C1105.5536%2C1105.2080%2C1105.0221%2C1105.4848%2C1105.2483%2C1105.2120%2C1105.0316%2C1105.5203%2C1105.4874%2C1105.0510%2C1105.1295%2C1105.4784%2C1105.2106%2C1105.4962%2C1105.2263%2C1105.4099%2C1105.0133%2C1105.3078%2C1105.1868%2C1105.0018%2C1105.1202%2C1105.2041%2C1105.0213%2C1105.5426%2C1105.6083%2C1105.3159%2C1105.1923%2C1105.1808%2C1105.1343%2C1105.4167%2C1105.0174%2C1105.0083%2C1105.2844%2C1105.4852%2C1105.2560%2C1105.6017%2C1105.3877%2C1105.2412%2C0812.3402%2C0812.1811%2C0812.1943%2C0812.1877%2C0812.3726%2C0812.0548%2C0812.0681%2C0812.2277%2C0812.3793%2C0812.0416%2C0812.2541%2C0812.0952%2C0812.2613%2C0812.0483%2C0812.3450%2C0812.0764%2C0812.3306%2C0812.2597%2C0812.4510%2C0812.0552%2C0812.1302%2C0812.2818%2C0812.0363%2C0812.3654%2C0812.1446%2C0812.0008%2C0812.4771%2C0812.0649%2C0812.3036%2C0812.1716%2C0812.0297%2C0812.4681%2C0812.4729%2C0812.3314%2C0812.2117%2C0812.2202%2C0812.0320%2C0812.1796%2C0812.0011%2C0812.3261%2C0812.0828%2C0812.3389%2C0812.1996%2C0812.0477%2C0812.1436%2C0812.2343%2C0812.3685%2C0812.5048%2C0812.4407%2C0812.0748%2C0812.3995%2C0812.3878%2C0812.2319%2C0812.0670%2C0812.0981%2C0812.2803%2C0812.1538%2C0812.0870%2C0812.1873&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Voting in a Stochastic Environment: The Case of Two Groups"}, "summary": "Social dynamics determined by voting in a stochastic environment is analyzed\nfor a society composed of two cohesive groups of similar size. Within the model\nof random walks determined by voting, explicit formulas are derived for the\ncapital increments of the groups against the parameters of the environment and\n\"claim thresholds\" of the groups. The \"unanimous acceptance\" and \"unanimous\nrejection\" group rules are considered as the voting procedures. Claim\nthresholds are evaluated that are most beneficial to the participants of the\ngroups and to the society as a whole.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1105.5424%2C1105.4250%2C1105.0537%2C1105.2337%2C1105.5536%2C1105.2080%2C1105.0221%2C1105.4848%2C1105.2483%2C1105.2120%2C1105.0316%2C1105.5203%2C1105.4874%2C1105.0510%2C1105.1295%2C1105.4784%2C1105.2106%2C1105.4962%2C1105.2263%2C1105.4099%2C1105.0133%2C1105.3078%2C1105.1868%2C1105.0018%2C1105.1202%2C1105.2041%2C1105.0213%2C1105.5426%2C1105.6083%2C1105.3159%2C1105.1923%2C1105.1808%2C1105.1343%2C1105.4167%2C1105.0174%2C1105.0083%2C1105.2844%2C1105.4852%2C1105.2560%2C1105.6017%2C1105.3877%2C1105.2412%2C0812.3402%2C0812.1811%2C0812.1943%2C0812.1877%2C0812.3726%2C0812.0548%2C0812.0681%2C0812.2277%2C0812.3793%2C0812.0416%2C0812.2541%2C0812.0952%2C0812.2613%2C0812.0483%2C0812.3450%2C0812.0764%2C0812.3306%2C0812.2597%2C0812.4510%2C0812.0552%2C0812.1302%2C0812.2818%2C0812.0363%2C0812.3654%2C0812.1446%2C0812.0008%2C0812.4771%2C0812.0649%2C0812.3036%2C0812.1716%2C0812.0297%2C0812.4681%2C0812.4729%2C0812.3314%2C0812.2117%2C0812.2202%2C0812.0320%2C0812.1796%2C0812.0011%2C0812.3261%2C0812.0828%2C0812.3389%2C0812.1996%2C0812.0477%2C0812.1436%2C0812.2343%2C0812.3685%2C0812.5048%2C0812.4407%2C0812.0748%2C0812.3995%2C0812.3878%2C0812.2319%2C0812.0670%2C0812.0981%2C0812.2803%2C0812.1538%2C0812.0870%2C0812.1873&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Social dynamics determined by voting in a stochastic environment is analyzed\nfor a society composed of two cohesive groups of similar size. Within the model\nof random walks determined by voting, explicit formulas are derived for the\ncapital increments of the groups against the parameters of the environment and\n\"claim thresholds\" of the groups. The \"unanimous acceptance\" and \"unanimous\nrejection\" group rules are considered as the voting procedures. Claim\nthresholds are evaluated that are most beneficial to the participants of the\ngroups and to the society as a whole."}, "authors": ["P. Yu. Chebotarev", "A. K. Loginov", "Ya. Yu. Tsodikova", "Z. M. Lezina", "V. I. Borzenko"], "author_detail": {"name": "V. I. Borzenko"}, "author": "V. I. Borzenko", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1134/S0005117911070198", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1105.0510v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1105.0510v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "11 pages, 4 figures. A preliminary version of a journal paper", "arxiv_primary_category": {"term": "cs.MA", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cs.MA", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "cs.SI", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "cs.SY", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "math.OC", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "physics.soc-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "91B12, 91B70", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1105.0510v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1105.0510v1", "journal_reference": "Automation and Remote Control 72 (2011), No. 7, 1537-1547", "doi": "10.1134/S0005117911070198", "fulltext": "ISSN 0005-1179, Automation and Remote Control, 2011, Vol. 72, No. 6, p. 345. c Pleiades Publishing, Ltd., 2011.\nOriginal Russian Text c P.Yu. Chebotarev, A.K. Loginov, Ya.Yu. Tsodikova, Z.M. Lezina, and V.I. Borzenko, 2010,\npublished in Problemy Upravleniya, 2010, No. 1, pp. 18–25.\n\nCONTROL SCIENCES\n\nVoting in a Stochastic Environment: The Case of Two Groups\n\narXiv:1105.0510v1 [cs.MA] 3 May 2011\n\nP. Yu. Chebotarev, A. K. Loginov, Ya. Yu. Tsodikova,\nZ. M. Lezina, and V. I. Borzenko\nTrapeznikov Institute of Control Sciences, Russian Academy of Sciences, Moscow, Russia\nReceived April 6, 2009\n\nAbstract-Social dynamics determined by voting in a stochastic environment is analyzed for\na society composed of two cohesive groups of similar size. Within the model of random walks\ndetermined by voting, explicit formulas are derived for the capital increments of the groups\nagainst the parameters of the environment and \"claim thresholds\" of the groups. The \"unanimous acceptance\" and \"unanimous rejection\" group rules are considered as the voting procedures. Claim thresholds are evaluated that are most beneficial to the participants of the groups\nand to the society as a whole.\n\n1. INTRODUCTION\nThis work was carried out within the framework of analyzing social dynamics determined by\ndemocratic decisions in a stochastic environment. The subject of investigation is the relationship\nbetween the parameters of social dynamics and social strategies of the participants including egoism,\ncollectivism (corporatism) and altruism. The results for the situation where a cohesive group\ncompetes with egoistic participants are reported in [1, 2]; competition between egoists and two\ncohesive groups (parties) was studied in [3]. The latter paper also considers the so-called \"snowball\nof cooperation\" mechanism which, under certain conditions, motivates those participants initially\nhaving egoistic strategies to act altruistically.\nThe present paper investigates a special case of the situation considered in [3], namely, competition of two groups. The relative simplicity of this case enables us to obtain explicit formulas for\nthe most interesting relationships.\nLet us recall the basic features of our model of voting in a stochastic environment. Being\ncomposed of a finite number of participants, the society sequentially votes for/against proposals that\nare regularly generated by the \"environment\" according to a random law. A proposal is identified\nwith a vector of capital increments of the participants; an alternative interpretation involves the\nutility values of the participants. According to the model, the capital/utility increments entering\nthe proposal are realizations of independent and identically distributed random variables. Here,\nthe normal distribution is mainly considered. During the vote, an egoistic participant supports any\nproposal that increases his/her capital. In contrast to egoists, the members of a group vote jointly\nfor those proposals that would be favorable for the whole group (the latter is characterized by a\ncertain index). In particular, a group may support proposals that increase either the capital of the\nmajority of its members or the total group capital. Each proposal is accepted (and implemented)\nor rejected under a particular voting procedure. Generally, the procedures of α-majority are used.\nThe parameter α ∈ [0, 1) determines the share of votes necessary and sufficient for the acceptance\nof a proposal.\nThe presence of a stochastic environment is the focus of the model under consideration; it\npreserves many basic phenomena of social reality. At the same time, it enables the investigation of\nthese phenomena by analytical methods.\n345\n\n\f346\n\nCHEBOTAREV, LOGINOV, TSODIKOVA, LEZINA, AND BORZENKO\n\nIn voting theory, the stochasticity assumption is often applied to choosing the voters' positions\n(see, e.g., [4]). In cooperative game theory, it is widely adopted with respect to the payments [5].\nA distinctive feature of our model is a stochastic mechanism for generating proposals for voting. In\nother words, we study a model of random walks controlled by voting. In this context, some papers\non the dynamical correction of tax rates are relevant (see, e.g., [6]); note, however, that these\nworks focus on selecting the rate itself (which is optimized within special models of production and\nconsumption) and not on the random walks in the space of individual utilities. We also mention a\nrecent survey on modelling political competition processes that involve voting [7].\n2. EXPECTED CAPITAL OF GROUP MEMBERS\nSuppose that a society consists of two groups of similar size; every group votes jointly. A natural\nvoting rule requires that the accepted proposals are supported by both groups. In the sequel, we\nuse the term unanimous acceptance group rule for this voting procedure. Suppose that the first\n(second) group supports a proposal if and only if this proposal leads to the increase in the mean\ncapital of the group members by at least t1 (respectively, t2 ). Here, the proposal support thresholds\nt1 and t2 are variable parameters which may take positive, zero, or negative values. It is interesting\nto investigate the dependence of the future capital of the groups and the whole society on the\nproposal support thresholds t1 and t2 (we will also call them claim thresholds). In addition to\nthe unanimous acceptance group rule, we will consider the rule according to which a proposal is\naccepted if and only if it is supported by at least one group. This voting procedure will be called\nthe unanimous rejection group rule, since a proposal is rejected iff it is rejected by both groups.\nIn the following theorem, we derive expressions for the average capital increments under the above\nvoting rules.\nTheorem 1. Suppose a proposal is accepted if and only if it is supported by at least one group.\nThen the mathematical expectation of the one-step capital increment 1 of a member of group i\n(i = 1, 2) is given by the formula\nM (d ̃i ) = μF3−i + (μFi + σi fi )F3−i .\n\n(1)\n\nHere, Fi = F (μi /σi ), Fi = 1 − Fi , fi = f (μi /σi ), f (*) and F (*) denote the density\n. and distribution\n√\n2\nfunction of the standard normal distribution, respectively, μi = μ − ti , σi = σ gi , ti is the claim\nthreshold of group i, gi is the size of group i, while μ and σ are the parameters of the normal\ndistribution N (μ, σ 2 ) that describes the independent capital increments forming proposals.\nSuppose a proposal is accepted if and only if it is supported by both groups. Then the mathematical\nexpectation of the one-step capital increment of a member of group i (i = 1, 2) is given by the formula\nM (d ̃i ) = (μFi + σi fi )F3−i .\n\n(2)\n\nProof. For a given proposal, let G1 (G2 ) be the event that the first (respectively, second) group\nsupports the proposal. Denote by G1 G2 the simultaneous implementation of G1 and G2 . Similarly,\nG1 G2 and G1 G2 are the simultaneous implementation of G1 and the complement of G2 , and of the\ncomplements of G1 and G2 , respectively. Let P (*) denote the event probability.\nTo prove the first statement of the theorem, we first suppose that the unanimous rejection group\nrule is used. Using the total probability formula one has\nM (d ̃i ) = M (d ̃i | G3−i ) P (G3−i ) + M (d ̃i | Gi G3−i ) P (Gi G3−i ) + M (d ̃i | Gi G3−i ) P (Gi G3−i ).\n1\n\n2\n\n(3)\n\nNotation with tilde serves to indicate actual (i.e, taking into account the acceptance of proposals) capital increments,\nas distinct from the proposed ones.\nRt\n2\n2\nf (t) = √12π e−t /2 and F (t) = √12π −∞ e−x /2 dx.\nAUTOMATION AND REMOTE CONTROL\n\nVol. 72\n\nNo. 6\n\n2011\n\n\fVOTING IN A STOCHASTIC ENVIRONMENT\n\n347\n\nOn the assumption of Gi G3−i , the proposal is rejected; hence, M (d ̃i | Gi G3−i ) = 0. Under G3−i , the proposal is accepted and independence of the proposal components implies that\nM (d ̃i | G3−i ) = μ. Similarly, the proposal is accepted under Gi G3−i , and independence of the components di yields M (d ̃i | Gi G3−i ) = M (di | Gi G3−i ) = M (di | Gi ). Next, M (di | Gi ) = M (diave | Gi )\nwith diave standing for the result of averaging the components of the proposal (these components\ncorrespond to the ith group).\nObserve that diave is a random variable having the distribution\n.\n√\ngi , and that Gi is tantamount to diave > ti . Using the formula for the\nN (μ, σi2 ), where σi = σ\nconditional mean of a normal random variable (it can be proved by integration) one finally obtains\nM (d ̃i | Gi G3−i ) = M (diave | diave > ti ) = μ +\n\nσi f i\n,\nFi\n\n(4)\n\nwhere Fi = F (μi /σi ), fi = f (μi /σi ), and μi = μ − ti . It is also easy to demonstrate that\nP (G3−i ) = F3−i . Using independence of the proposal components we have the expression\nP (Gi G3−i ) = P (Gi ) P (G3−i ) = Fi F3−i .\n\n(5)\n\nSubstituting all this into (3) yields\nσi f i\nFi F3−i = μF3−i + (μFi + σi fi )F3−i .\nM (d ̃i ) = μF3−i + μ +\nFi\n\u0012\n\n\u0013\n\nThis completes the proof of the first part.\nNow prove the second statement of the theorem. Suppose that the unanimous acceptance group\nrule is used. In this case,\nM (d ̃i ) = M (d ̃i | Gi G3−i ) P (Gi G3−i ).\n\n(6)\n\nSimilarly to the derivation of (4), one obtains\nσi f i\nM (d ̃i | Gi G3−i ) = M (diave | diave > ti ) = μ +\nFi\n\n(7)\n\nP (Gi G3−i ) = P (Gi ) P (G3−i ) = Fi F3−i .\n\n(8)\n\nand similarly to (5),\n\nSubstitute (7)–(8) in (6) to get M (d ̃i ) = (μFi + σi fi ) F3−i . This completes the proof. ♦\nOf special interest are the comparative capital increments of the groups. Indeed, it is important\nto know the capital-related performance of each group against the background of the results achieved\nby the other one. The expected one-step capital increment of Group 1 as compared with the one\nof Group 2 is expressed as M (d ̃1 − d ̃2 ). Theorem 1 enables one to obtain simple formulas for\nM (d ̃1 − d ̃2 ).\nCorollary 1. In the notation of Theorem 1, if the unanimous rejection group rule is adopted,\nthen\nM (d ̃1 − d ̃2 ) = σ1 f1 F2 − σ2 f2 F1 .\n\n(9)\n\nUnder the unanimous acceptance group rule, one has\nM (d ̃1 − d ̃2 ) = σ1 f1 F2 − σ2 f2 F1 .\nThe proof of Corollary 1 is straightforward.\nAUTOMATION AND REMOTE CONTROL\n\nVol. 72\n\nNo. 6\n\n2011\n\n(10)\n\n\f348\n\nCHEBOTAREV, LOGINOV, TSODIKOVA, LEZINA, AND BORZENKO\n\n3. ANALYSIS OF SOCIAL DYNAMICS\nIn order to apply and interpret the results obtained, let us first consider the case where the\nmean proposed capital increment is zero, i.e., the environment is neutral; suppose that the standard\ndeviation of the proposed capital increment is 10: μ = 0, σ = 10. Suppose that each group includes\n300 participants and Group 1 supports a proposal whenever it increases the total capital of the\ngroup (t1 = 0). The claim threshold t2 of Group 2 varies.\nIn the case of the unanimous acceptance group rule (sometimes, we will call it the (G1 ∧G2 )-rule),\nthe expected capital increments of the groups and the whole society versus the claim threshold t2\nof Group 2, as stated by Theorem 1, are depicted in Fig. 1.\n\nFig. 1. Expected capital increments of the groups and the society provided that the unanimous acceptance\ngroup rule is adopted (in this example, it coincides with the majority rule): 1-Group 1; 2-Group 2; 3-\nthe difference between Group 1 and Group 2; 4-the whole society. The parameters are: μ = 0; σ = 10;\ng1 = g2 = 300.\n\nIn particular, the average capital increment of Group 2 represents a symmetrical bell-shaped\ncurve. This can be explained as follows. Setting a positive Group 2 threshold (high claims) leads to\nthe rejection of some favorable to Group 2 (on the average) proposals, whereas setting a negative\nthreshold (low claims) leads to the acceptance, along with the favorable to Group 2 proposals, of\nsome proposals unfavorable to it. So both strategies decrease the expected capital increment of\nGroup 2 as against the case of t2 = 0. A noteworthy fact is that positive and negative thresholds\nof the same absolute value are equivalent. Let us prove it.\nCorollary 2. Let μ = 0. Then for fixed values of the model parameters except for t2 , any t ∈ IR,\nand under either group voting rule, M (d ̃2 | t2 = t) = M (d ̃2 | t2 = −t) holds.\nProof. Applying Theorem 1 to the case μ = 0 one obtains\nM (d ̃2 ) = σ2 f2 F1\n\n(11)\n\nfor the unanimous rejection group rule and\nM (d ̃2 ) = σ2 f2 F1\nAUTOMATION AND REMOTE CONTROL\n\n(12)\nVol. 72\n\nNo. 6\n\n2011\n\n\fVOTING IN A STOCHASTIC ENVIRONMENT\n\n349\n\nfor the unanimous acceptance group rule.\nThe\u0012required\u0013 statement follows from the facts that σ2 and F1 are independent of t2 and that\nμ − t2\nis an even function of t2 provided that μ = 0. ♦\nf2 = f\nσ2\nRemark 1. Due to (11)–(12), for both voting rules under consideration, the expression of M (d ̃2 )\nin terms of t2 is proportional to the normal density function, which is a bell-shaped curve with zero\nlimits as t2 → −∞ and t2 → ∞. Finally, if t1 = 0, then under both voting rules, M (d ̃2 ) = 21 σ2 f2\nholds. ♦\nNext we study the characteristics of social dynamics for each voting rule separately.\n3.1. The Unanimous Acceptance Group Rule\nIf the unanimous acceptance group rule is adopted, then Group 1 benefits from low (negative)\nclaim threshold t2 of Group 2. Indeed, in this case Group 2 rarely vetoes proposals beneficial to\nGroup 1 and so Group 1 can maximize its benefits. Contrariwise, if t2 is high, then Group 1 can\nrarely expect approval of proposals beneficial to it.\nNow, suppose that Group 2 aims not at maximizing the average capital increment, but at\nensuring maximum advantage over Group 1. In other words, Group 2 maximizes M (d ̃2 − d ̃1 ) rather\nthan M (d ̃2 ). A tool Group 2 can use for this is its claim threshold t2 . For instance, in the example\nillustrated by Fig. 1, M (d ̃2 − d ̃1 ) as a function of t2 attains its maximum when M (d ̃1 − d ̃2 ) attains\nits minimum, i.e., at t2 ≈ 0.46. In the proposition below, we find the \"claim threshold\" t2 that\nmaximizes M (d ̃2 − d ̃1 ) in the general case.\nProposition 1. Suppose the unanimous acceptance group rule is adopted. Then, in the notation\nof Theorem 1, the expected advantage M (d ̃2 − d ̃1 ) of a Group 2 member over a Group 1 member\nin the sense of capital increment attains its unique maximum at the claim threshold t2 of Group 2\ndefined by\nt+\n2 =μ+\n\nσ1 f 1\n.\nF1\n\n(13)\n\nProof. Differentiating (10) with respect to t2 we obtain\n\u0001\ndM (d ̃1 − d ̃2 )\n−(t2 − μ)\nd (σ1 f1 F2 − σ2 f2 F1 )\n=\n= σ1 f1 f2 * −σ2−1 − σ2 f2\nF1 .\nd t2\nd t2\nσ22\n\nSetting the derivative equal to zero results in the desired expression (13). Finding the second\nderivative of the function M (d ̃1 − d ̃2 ) ensures that a minimum has been found. Hence, (13) provides\nthe unique maximum of M (d ̃2 − d ̃1 ). ♦\nRemark 2. It should be noted that the optimal claim threshold t+\n2 found in Proposition 1 is\nindependent of the group size g2 . It is also interesting that expression (13) coincides with (4) in\nwhich i = 1. In turn, (4) with i = 1 expresses the expected capital increment of a member\nof Group 1 provided it exceeds the threshold t1 . This observation suggests the following simple\nalgorithm of estimating the optimal \"claim threshold\" t+\n2 by Group 2: (1) find the average capital\nincrements of Group 1 members according to the proposals that Group 1 supports; (2) set the\nthreshold t2 equal to the value found on Step (1) averaged over the proposals.\nThus, to achieve an advantage over Group 1, Group 2 should set its claim threshold at a higher\nlevel than Group 1 does. As has been noted before, the optimal threshold t2 is equal to the mean\nAUTOMATION AND REMOTE CONTROL\n\nVol. 72\n\nNo. 6\n\n2011\n\n\f350\n\nCHEBOTAREV, LOGINOV, TSODIKOVA, LEZINA, AND BORZENKO\n\n\"above threshold\"\nvalue of Group 1 capital increment. In particular, for the example of Fig. 1, (13)\nq\n+\n2\ngives t2 = 3π . Now, if Group 1 wishes to act in the same way (i.e., to maximize its advantage\n+\nM (d ̃1 − d ̃2 ) with respect to t2 = t+\n2 ), it should, in turn, set a higher threshold: t1 > t2 . If this\nprocess continues, it leads to an infinite increase in the claims (the process is divergent and the\ncorresponding game possesses no Nash equilibrium). ♦\nHow does the maximum comparative gain M (d ̃2 − d ̃1 ) of Group 2 depend on the fixed claim\nthreshold t1 of Group 1? It increases as t1 → −∞, since in this case Group 1 supports all proposals,\nand thus, the decisions are made by Group 2. If t1 grows, then this maximum gain decreases and\ntends to zero as t1 → ∞ since in this case, no proposals are accepted due to the veto of Group 1.\nNow consider the following question which seems quite interesting. What claim threshold t2 of\nGroup 2 is optimal for the whole society (thus, leading to the maximum expected capital increment\nof the society)? The answer is provided by the following proposition.\nProposition 2. Suppose the unanimous acceptance group rule is adopted. Then the expected\ncapital increment of the whole society attains its maximum value at the claim threshold t2 of Group 2\ngiven by\nt02\n\nσ1 f 1\ng1\nμ+\n.\n=−\ng2\nF1\n\u0012\n\n\u0013\n\n(14)\n\nProof. Theorem 1 (see (2)) implies that the expected capital increment of the whole society is\ng1 M (d ̃1 ) + g2 M (d ̃2 ) = g1 (μF1 + σ1 f1 )F2 + g2 (μF2 + σ2 f2 )F1\n= ((g1 + g2 )μF1 + g1 σ1 f1 ) F2 + g2 σ2 f2 F1 .\nThe derivative of this function with respect to t2 is\n\u0001\nd (g1 M (d ̃1 ) + g2 M (d ̃2 ))\n−(t2 − μ)\n.\n= ((g1 + g2 )μF1 + g1 σ1 f1 )f2 * −σ2−1 + g2 σ2 f2 F1\nd t2\nσ22\n\nSetting it equal to zero one obtains g2 F1 (t02 − μ) = −(g1 + g2 )μF1 − g1 σ1 f1 , which leads to (14).\nFinally, the second derivative test confirms that this point provides a unique maximum value. ♦\nRemark 3. Comparing Propositions 1 and 2 produces a somewhat unexpected result. Namely,\nat g1 = g2 those values of claim threshold t2 of Group 2 leading to the maximum advantage over\nGroup 1 (on the one hand) and to the best results for the whole society (on the other hand) turn\nout to be opposite. In particular, this is the case for the example illustrated by Fig. 1. Note that\n0\neven if g1 6= g2 , the thresholds t+\n2 and t2 always have different signs (or both are zero), since by\n(13) and (14),\nt02 = −\n\ng1 +\nt . ♦\ng2 2\n\nProposition 2 determines t2 (as a function of t1 ) that guarantees the maximum capital increment\nof the whole society. Let us maximize this maximum over t1 to find the global optimal point of the\nsociety. Obviously, the corresponding solutions t1 and t2 satisfy the system of equations\nσ2 f 2\ng2\nμ+\n;\nt1 = −\ng1\nF2\n\u0012\n\n\u0013\n\ng1\nσ1 f 1\nt2 = −\nμ+\ng2\nF1\n\u0012\n\n\u0013\n\nAUTOMATION AND REMOTE CONTROL\n\n(15)\nVol. 72\n\nNo. 6\n\n2011\n\n\fVOTING IN A STOCHASTIC ENVIRONMENT\n\n351\n\nwith σ1 , σ2 , f1 , f2 , F1 , and F2 defined in Theorem 1. Most likely, the solution of (15) cannot generally\nbe expressed in elementary functions. In particular, this applies even to the simplest case of g1 = g2\n(two groups of equal size) in which the system (15) reduces to\nt1 = −μ −\n\nσ1 f 1\n;\nF1\n\nt2 = t1 .\n\nNevertheless, the solution can be obtained numerically. For instance, the dependence on μ of\nthe claim threshold t = t1 = t2 optimal for the society is shown (in the case of g1 = g2 = 300 and\nσ = 10) in Fig. 2.\n\nFig. 2. Relationship between μ and the claim threshold t = t1 = t2 that maximizes the capital increment of\nthe whole society provided that g1 = g2 = 300 and σ = 10.\n\n\u000e√\nIn particular, for g1 = g2 = g̃ and μ = 0, the optimal threshold is t = −σy0 g̃, where y0 ≈ 0.506\nis the unique solution of the equation y = f (y)/F (y) with f (y) and F (y) designating the density\nand distribution function of the standard normal distribution.\nOne of the most instructive results of this study is that under the unanimous acceptance group\nrule, the claim threshold t of the groups that is optimal for the whole society is negative (see Fig. 2).\nIn the case g1 = g2 , it tends to zero from below as μ → −∞ and asymptotically approaches to the\nline t = −μ as μ → ∞. Negative claim thresholds of the groups can be interpreted as a willingness\nto a moderately negative result, that is, as a certain appetite for risk.\n\n3.2. The Unanimous Rejection Group Rule\nNow consider the unanimous rejection group rule (we will also call it the (G1 ∨ G2 )-rule). With\nthis procedure, for acceptance of a proposal, the support of either one group is sufficient. The\nanalytical results obtained in Section 2 are illustrated by the diagram in Fig. 3.\nIt can be easily observed that this diagram mirrors the one shown in Fig. 1. Indeed, the following\nstatement holds.\nCorollary 3. Let μ = 0. If the model parameters, except for t2 , are fixed, then for any t ∈ IR,\nMG1 ∨G2 (d ̃1 | t2 = t) = MG1 ∧G2 (d ̃1 | t2 = −t) holds, where MG1 ∧G2 (MG1 ∨G2 ) is the expectation, proAUTOMATION AND REMOTE CONTROL\n\nVol. 72\n\nNo. 6\n\n2011\n\n\f352\n\nCHEBOTAREV, LOGINOV, TSODIKOVA, LEZINA, AND BORZENKO\n\nFig. 3. Expected capital increments of the members of Groups 1 and 2 and the society under the unanimous\nrejection group rule: 1-Group 1; 2-Group 2; 3-the difference between Group 1 and Group 2; 4-the whole\nsociety; the parameters are: μ = 0; σ = 10; g1 = g2 = 300.\n\nvided the unanimous acceptance group rule (resp., the unanimous rejection group rule) is adopted.\nMoreover, at t1 = 0 one has MG1 ∨G2 (d ̃2 | t2 = t) = MG1 ∧G2 (d ̃2 | t2 = t) for any t ∈ IR.\nProof. According to Theorem 1, for μ = 0 we have:\nMG1 ∧G2 (d ̃1 | t2 = −t) = σ1 f1 F (t/σ1 ),\nMG1 ∨G2 (d ̃1 | t2 = t) = σ1 f1 (1 − F (−t/σ1 )) = σ1 f1 F (t/σ1 ) = MG1 ∧G2 (d ̃1 | t2 = −t).\nMoreover, t1 = 0 implies that MG1 ∧G2 (d ̃2 | t2 = t) = σ2 f (−t/σ2 )F (0) = MG1 ∨G2 (d ̃2 | t2 = t).\nThis completes the proof. ♦\nRemark 4. Due to Corollary 2, μ = 0 implies that M (d ̃2 | t2 = t) = M (d ̃2 | t2 = −t) for either\nvoting rule under study. Consequently, if μ = 0 and t1 = 0, then every relationship under (G1 ∨G2 )rule can be derived from the corresponding relationship obtained for the (G1 ∧ G2 )-rule by means\nof the y-axis reflection. Thus, in this case, the situations where voting is organized according to\nthe (G1 ∧ G2 )-rule and according to the (G1 ∨ G2 )-rule are, in a certain sense, dual. ♦\nNote that under the (G1 ∨ G2 )-rule, Group 1 benefits from excessive claims of Group 2 (i.e.,\nfrom high threshold t2 ). In this case, if threshold t1 is positive, but not so high, then most decisions\nare made for the benefit of Group 1. On the other hand, at a low threshold t2 , Group 2 ensures\nimplementation of almost all proposals, and so most proposals unfavorable to Group 1 pass through\nthe \"riddle\" of voting.\nNow let us consider the maximization problem for the Group 2 advantage M (d ̃2 − d ̃1 ) over\nGroup 1 provided that the (G1 ∨ G2 )-rule is adopted.\nProposition 3. Under the (G1 ∨G2 )-rule, the expected advantage M (d ̃2 − d ̃1 ) of a Group 2 member\nover a Group 1 member attains its maximum value at the claim threshold t2 defined by\nt+\n2 =μ−\n\nσ1 f 1\n.\nF1\n\nAUTOMATION AND REMOTE CONTROL\n\n(16)\nVol. 72\n\nNo. 6\n\n2011\n\n\fVOTING IN A STOCHASTIC ENVIRONMENT\n\n353\n\nProof. Differentiating (9) with respect to t2 yields:\n\u0001\n−(t2 − μ)\nd (σ1 f1 F2 − σ2 f2 F1 )\ndM (d ̃1 − d ̃2 )\n=\n= σ1 f1 f2 * σ2−1 − σ2 f2\nF1 .\nd t2\nd t2\nσ22\n\nSetting this derivative equal to zero one arrives at (16). The second derivative test confirms\nthat this unique extremum is a minimum. Thus, (16) provides a maximum value to the function\nM (d ̃2 − d ̃1 ). ♦\nThe maximum comparative gain M (d ̃2 − d ̃1 ) of Group 2 attained at the claim threshold t+\n2 tends\nto zero as t1 → −∞ (in the limit, all proposals are accepted by the votes of Group 1) and tends to\nits maximum value when t1 → ∞ (in the limit, Group 1 does not support any proposals).\nAs well as in the case of the (G1 ∧ G2 )-rule, consider the problem of maximizing, by choosing\nt2 , the capital of the whole society. The solution is provided by the following proposition.\nProposition 4. Suppose that the (G1 ∨ G2 )-rule is adopted. Then the expected capital increment\nof the whole society attains its maximum value at the Group 2 claim threshold given by\nt02 = −\n\ng1\nσ1 f 1\n.\nμ−\ng2\nF1\n\u0013\n\n\u0012\n\n(17)\n\nProof. By Theorem 1 (see Eq. (1)) the expected capital increment of the whole society is\n\u0001\n\u0001\ng1 M (d ̃1 ) + g2 M (d ̃2 ) = g1 * μF2 + (μF1 + σ1 f1 )F2 + g2 * μF1 + (μF2 + σ2 f2 )F1\n\n\u0001\n\n= (g1 + g2 )μF1 + g1 σ1 f1 + g2 σ2 F1 f2 + g1 *(μ − μF1 − σ1 f1 ) + g2 μF1 F2 .\n\nThe derivative of this function w. r. t. t2 is:\n\u0001\n\u0001\n−(t2 − μ)\nd (g1 M (d ̃1 ) + g2 M (d ̃2 ))\n= g2 σ2 F1 f2\n+ g1 *(μ − μF1 − σ1 f1 ) + g2 μF1 f2 * −σ2−1 .\n2\nd t2\nσ2\n\nSetting it equal to 0 we have: −g2 F1 (t02 − μ) = g1 *(μF1 − σ1 f1 ) + g2 μF1 , which leads to (17).\nFinally, using the second derivative test we verify that the point in question provides the maximum\nvalue. ♦\nRemark 5. Comparing Propositions 3 and 4 we obtain the following (cf. Remark 3). At g1 = g2 ,\nthe value t+\n2 of the claim threshold t2 of Group 2 that leads to the maximum advantage over Group 1\nand the value t02 that maximizes the capital of the whole society are opposite. In particular, this\n0\nis the case for the example in Fig. 3. Moreover, even if g1 6= g2 , the thresholds t+\n2 and t2 have\ndifferent signs (or both are equal to zero), since, as well as in the case of the (G1 ∧ G2 )-rule,\nt02 = −(g1 /g2 )t+\n2. ♦\nNow consider the issue of maximizing the capital increment of the whole society when the\n(G1 ∨ G2 )-rule is employed. In a certain sense, the result is dual to the one derived for the\n(G1 ∧ G2 )-rule. Namely, Proposition 4 implies that the claim thresholds of the groups, t1 and t2 ,\nthat maximize the capital increment of the whole society satisfy the following system of equations:\nσ2 f 2\ng2\nμ−\n;\nt1 = −\ng1\nF2\n\u0012\n\nAUTOMATION AND REMOTE CONTROL\n\n\u0013\n\nVol. 72\n\ng1\nσ1 f 1\nt2 = −\nμ−\n,\ng2\nF1\n\u0012\n\nNo. 6\n\n2011\n\n\u0013\n\n\f354\n\nCHEBOTAREV, LOGINOV, TSODIKOVA, LEZINA, AND BORZENKO\n\nwhere σ1 , σ2 , f1 , f2 , F1 , and F2 are defined in Theorem 1. In the simplest case g1 = g2 , the above\nsystem of equations reduces to\nt1 = −μ +\n\nσ1 f 1\n;\nF1\n\nt2 = t1 .\n\nThe dependence on μ of the claim threshold t of both groups that maximizes the capital of\nthe society is illustrated (for the case of g1 = g2 = 300 and \u000eσ = 10) in Fig. 4. In particular, for\n√\ng1 = g2 = g̃ and μ = 0, the corresponding threshold is t = σy0 g̃, where y0 ≈ 0.506 is the solution\nof the equation y = f (y)/F (y), f (y) and F (y) being the density and distribution function of the\nstandard normal distribution, respectively.\n\nFig. 4. Relationship between the parameter μ and the claim threshold t = t1 = t2 of both groups that\nmaximizes the capital increment of the whole society in the case of g1 = g2 = 300 and σ = 10.\n\nIn contrast to voting based on the (G1 ∧ G2 )-rule, the claim threshold of both groups that\nmaximizes the capital of the society under the (G1 ∨ G2 )-rule is positive (if the voting rule is not\nconservative, then the voters have to be conservative); for g1 = g2 it tends to zero from above as\nμ → ∞ and asymptotically approaches to the line t = −μ as μ → −∞ (see Fig. 4).\n4. CONCLUSION\nThis paper has studied the social dynamics determined by voting of two cohesive groups in a\nstochastic environment. Two groups of similar size (a kind of a \"two-party system\") have been\nconsidered; this makes reasonable the application of the voting procedure which requires the support\nof both groups for the acceptance of any proposal (the unanimous acceptance group rule).\nAnother procedure in which the support of either group suffices for the acceptance of a proposal\n(the unanimous rejection group rule) looks a little less natural. However, using this procedure does\nnot lead to an infinite sequence of contradictory decisions suggested by different groups since the\nproposals in the model are generated by the stochastic environment.\nEach group supports only those proposals that increase the average capital of its members by an\namount exceeding the claim threshold set by the group. The relationship between social dynamics\nand the claim thresholds of the groups was the main subject of the present study.\nAUTOMATION AND REMOTE CONTROL\n\nVol. 72\n\nNo. 6\n\n2011\n\n\fVOTING IN A STOCHASTIC ENVIRONMENT\n\n355\n\nIn particular, we have derived analytical expressions for the capital increments of the groups in\nterms of their claim thresholds. It has been shown that under the unanimous acceptance group\nrule and the equal size of the groups, the claim threshold of a group that ensures the maximum\nadvantage over the other group and the claim threshold that maximizes the capital of the whole\nsociety are opposite. Moreover, the first above threshold is equal to the average capital increment of\nthe competing group members over the proposals supported by the competing group. Furthermore,\nit turns out that the claim thresholds of the groups that maximize the capital of the whole society\nare negative, which can be interpreted as the profitability of a certain appetite for risk in the case\nof a conservative voting rule; the dependence of these thresholds on the environment favorability\nhas been established. Similar (in fact, dual) results have been obtained for the unanimous rejection\ngroup rule.\nIt should be emphasized that the phenomena observed are not only inherent in the model\nunder consideration; the most important ones have real prototypes widely discussed in the relevant\nliterature.\nREFERENCES\n1. Borzenko, V.I., Lezina, Z.M., Loginov, A.K., Tsodikova, Ya.Yu., and Chebotarev, P.Yu., Strategies of\nVoting in Stochastic Environment: Egoism and Collectivism, Autom. Remote Control , 2006, vol. 67,\nno. 2, pp. 311–328.\n2. Chebotarev, P.Yu., Analytical Expression of the Expected Values of Capital at Voting in the Stochastic\nEnvironment, Autom. Remote Control , 2006, vol. 67, no. 3, pp. 480–492.\n3. Chebotarev, P.Yu., Loginov, A.K., Tsodikova, Ya.Yu., Lezina, Z.M., and Borzenko, V.I., Analysis of\nCollectivism and Egoism Phenomena within the Context of Social Welfare, Autom. Remote Control ,\n2010, vol. 71, no. 6, pp. 1196–1207.\n4. Anderson, S.P., Kats, A., and Thisse, J.-F., Probabilistic Voting and Platform Selection in Multi-Party\nElections, Soc. Choice Welfare, 1994, vol. 11, no. 4, pp. 305–322.\n5. Suijs, J., Cooperative Decision Making in a Stochastic Environment, PhD Dissertation, Tilburg: Tilburg\nUniv., 1998.\n6. Aiyagari, S.R. and Peled, D., Social Insurance and Taxation under Sequential Majority Voting and\nUtilitarian Regimes, J. Econom. Dynam. Control , 1995, vol. 18, no. 8, pp. 1511–1528.\n7. Zakharov, A.V., The Models of Political Competition: Literature Review, Ekonom. Mat. Metody, 2009,\nvol. 45, no. 1, pp. 110–128.\n\nAUTOMATION AND REMOTE CONTROL\n\nVol. 72\n\nNo. 6\n\n2011\n\n\f"}