{"id": "http://arxiv.org/abs/0904.4918v2", "guidislink": true, "updated": "2009-12-17T15:11:48Z", "updated_parsed": [2009, 12, 17, 15, 11, 48, 3, 351, 0], "published": "2009-04-30T19:06:59Z", "published_parsed": [2009, 4, 30, 19, 6, 59, 3, 120, 0], "title": "Synchrotron Emission from Elliptical Galaxies Consequent to AGN\n  outbursts", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0904.1078%2C0904.0005%2C0904.2642%2C0904.4227%2C0904.4537%2C0904.1307%2C0904.4177%2C0904.3543%2C0904.3076%2C0904.3542%2C0904.2670%2C0904.2588%2C0904.2958%2C0904.4918%2C0904.2966%2C0904.1468%2C0904.3963%2C0904.2260%2C0904.1715%2C0904.1945%2C0904.2777%2C0904.4282%2C0904.1651%2C0904.1869%2C0904.4128%2C0904.2246%2C0904.2880%2C0904.3940%2C0904.4898%2C0904.1967%2C0904.2875%2C0904.1310%2C0904.0937%2C0904.4925%2C0904.4008%2C0904.3205%2C0904.4829%2C0904.3999%2C0904.4376%2C0904.4726%2C0904.1275%2C0904.2879%2C0904.2180%2C0904.1364%2C0904.4590%2C0904.1146%2C0904.1940%2C0904.3532%2C0904.1280%2C0904.1284%2C0904.0396%2C0904.3106%2C0904.3525%2C0904.1100%2C0904.0183%2C0904.2824%2C0904.3679%2C0904.1820%2C0904.0809%2C0904.3884%2C0904.1862%2C0904.0914%2C0904.4097%2C0904.3142%2C0904.1313%2C0904.3728%2C0904.2003%2C0904.4146%2C0904.0794%2C0904.1000%2C0904.1720%2C0904.3686%2C0904.4452%2C0904.4099%2C0904.1209%2C0904.2328%2C0904.4451%2C0904.2521%2C0904.4644%2C0904.2200%2C0904.0797%2C0904.3235%2C0904.0521%2C0904.0212%2C0904.3628%2C0904.0412%2C0904.3445%2C0904.1943%2C0904.4762%2C0904.3931%2C0904.0928%2C0904.3367%2C0904.0298%2C0904.0920%2C0904.1860%2C0904.0216%2C0904.2947%2C0904.2917%2C0904.4632%2C0904.3510%2C0904.0277&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Synchrotron Emission from Elliptical Galaxies Consequent to AGN\n  outbursts"}, "summary": "Both radiative and mechanical feedback from Active Galactic Nuclei have been\nfound to be important for the evolution of elliptical galaxies. We compute how\na shock may be driven from a central black hole into the gaseous envelope of an\nelliptical galaxy by mechanical as well as radiative feedback (in the form of\nnuclear winds) using high resolution 1-D hydrodynamical simulations. We\ncalculate the synchrotron emission from the electron cosmic rays accelerated by\nthe shocks (not the jets) in the central part of elliptical galaxies, and we\nalso study the synchrotron spectrum's evolution using the standard diffusive\nshock acceleration mechanism, which is routinely applied to the scaled volume\ncase of supernova remnants. We find good agreement quantitatively between the\nsynchrotron radio emission produced via this mechanism with extant observations\nof elliptical galaxies which are undergoing outbursts. Additionally, we also\nfind that synchrotron optical and X-ray emission can co-exist inside elliptical\ngalaxies during a certain phase of evolution subsequent to central outbursts.\nIn fact, our calculations predict a synchrotron luminosity of $\\sim 1.3\\times\n10^6 L_{\\odot}$ at the frequency 5 GHz (radio band), of $\\sim 1.1\\times 10^6\nL_{\\odot}$ at $4.3\\times10^{14}$ Hz (R band, corresponding to the absolute\nmagnitude -10.4), and of $\\sim 1.5\\times 10^{7} L_{\\odot}$ at\n$2.4\\times10^{17}$ Hz (soft X-ray, 0.5 -- 2.0 keV band).", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0904.1078%2C0904.0005%2C0904.2642%2C0904.4227%2C0904.4537%2C0904.1307%2C0904.4177%2C0904.3543%2C0904.3076%2C0904.3542%2C0904.2670%2C0904.2588%2C0904.2958%2C0904.4918%2C0904.2966%2C0904.1468%2C0904.3963%2C0904.2260%2C0904.1715%2C0904.1945%2C0904.2777%2C0904.4282%2C0904.1651%2C0904.1869%2C0904.4128%2C0904.2246%2C0904.2880%2C0904.3940%2C0904.4898%2C0904.1967%2C0904.2875%2C0904.1310%2C0904.0937%2C0904.4925%2C0904.4008%2C0904.3205%2C0904.4829%2C0904.3999%2C0904.4376%2C0904.4726%2C0904.1275%2C0904.2879%2C0904.2180%2C0904.1364%2C0904.4590%2C0904.1146%2C0904.1940%2C0904.3532%2C0904.1280%2C0904.1284%2C0904.0396%2C0904.3106%2C0904.3525%2C0904.1100%2C0904.0183%2C0904.2824%2C0904.3679%2C0904.1820%2C0904.0809%2C0904.3884%2C0904.1862%2C0904.0914%2C0904.4097%2C0904.3142%2C0904.1313%2C0904.3728%2C0904.2003%2C0904.4146%2C0904.0794%2C0904.1000%2C0904.1720%2C0904.3686%2C0904.4452%2C0904.4099%2C0904.1209%2C0904.2328%2C0904.4451%2C0904.2521%2C0904.4644%2C0904.2200%2C0904.0797%2C0904.3235%2C0904.0521%2C0904.0212%2C0904.3628%2C0904.0412%2C0904.3445%2C0904.1943%2C0904.4762%2C0904.3931%2C0904.0928%2C0904.3367%2C0904.0298%2C0904.0920%2C0904.1860%2C0904.0216%2C0904.2947%2C0904.2917%2C0904.4632%2C0904.3510%2C0904.0277&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Both radiative and mechanical feedback from Active Galactic Nuclei have been\nfound to be important for the evolution of elliptical galaxies. We compute how\na shock may be driven from a central black hole into the gaseous envelope of an\nelliptical galaxy by mechanical as well as radiative feedback (in the form of\nnuclear winds) using high resolution 1-D hydrodynamical simulations. We\ncalculate the synchrotron emission from the electron cosmic rays accelerated by\nthe shocks (not the jets) in the central part of elliptical galaxies, and we\nalso study the synchrotron spectrum's evolution using the standard diffusive\nshock acceleration mechanism, which is routinely applied to the scaled volume\ncase of supernova remnants. We find good agreement quantitatively between the\nsynchrotron radio emission produced via this mechanism with extant observations\nof elliptical galaxies which are undergoing outbursts. Additionally, we also\nfind that synchrotron optical and X-ray emission can co-exist inside elliptical\ngalaxies during a certain phase of evolution subsequent to central outbursts.\nIn fact, our calculations predict a synchrotron luminosity of $\\sim 1.3\\times\n10^6 L_{\\odot}$ at the frequency 5 GHz (radio band), of $\\sim 1.1\\times 10^6\nL_{\\odot}$ at $4.3\\times10^{14}$ Hz (R band, corresponding to the absolute\nmagnitude -10.4), and of $\\sim 1.5\\times 10^{7} L_{\\odot}$ at\n$2.4\\times10^{17}$ Hz (soft X-ray, 0.5 -- 2.0 keV band)."}, "authors": ["Y. -F. Jiang", "L. Ciotti", "J. P. Ostriker", "A. Spitkovsky"], "author_detail": {"name": "A. Spitkovsky"}, "author": "A. Spitkovsky", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1088/0004-637X/711/1/125", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0904.4918v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0904.4918v2", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "15 pages, 11 figures, resubmitted to ApJ, add one more figure, typos\n  corrected", "arxiv_primary_category": {"term": "astro-ph.CO", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph.CO", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "astro-ph.HE", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0904.4918v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0904.4918v2", "journal_reference": "Astrophys.J.711:125-137,2010", "doi": "10.1088/0004-637X/711/1/125", "fulltext": "Submitted V2 - December 16th, 2009\nPreprint typeset using LATEX style emulateapj v. 04/20/08\n\nSYNCHROTRON EMISSION FROM ELLIPTICAL GALAXIES CONSEQUENT TO AGN OUTBURSTS\nYan-Fei Jiang1 , Luca Ciotti2 , Jeremiah P. Ostriker1,3 and Anatoly Spitkovsky1\n1 Department of Astrophysical Sciences, Princeton University, NJ, USA, 08544\n2 Department of Astronomy, University of Bologna, via Ranzani 1, I-40127, Bologna, Italy\n3 IoA, Cambridge, UK\n\nand\n\narXiv:0904.4918v2 [astro-ph.CO] 17 Dec 2009\n\nSubmitted V2 - December 16th, 2009\n\nABSTRACT\nBoth radiative and mechanical feedback from Active Galactic Nuclei have been found to be important for the evolution of elliptical galaxies. We compute how a shock may be driven from a central\nblack hole into the gaseous envelope of an elliptical galaxy by such feedback (in the form of nuclear\nwinds) using high resolution 1-D hydrodynamical simulations. We calculate the synchrotron emission\nfrom the electron cosmic rays accelerated by the shocks (not the jets) in the central part of elliptical galaxies, and we also study the synchrotron spectrum's evolution using the standard diffusive\nshock acceleration mechanism, which is routinely applied to supernova remnants. We find quantitative consistency between the synchrotron radio emission produced via this mechanism with extant\nobservations of elliptical galaxies which are undergoing outbursts. Additionally, we also find that\nsynchrotron optical and X-ray emission can co-exist inside elliptical galaxies during a specific evolutionary phase subsequent to central outbursts. In fact, our calculations predict a peak synchrotron\nluminosity of ∼ 1.3 × 106 L⊙ at the frequency 5 GHz (radio band), of ∼ 1.1 × 106 L⊙ at 4.3 × 1014\nHz (corresponding to the absolute magnitude -10.4 in R band), and of ∼ 1.5 × 107 L⊙ at 2.4 × 1017\nHz (soft X-ray, 0.5 - 2.0 keV band).\nSubject headings: galaxies : ISM - radio continuum : galaxies - ISM : cosmic rays - radiation\nmechanisms : nonthermal - ISM : jets and outflows\n1. INTRODUCTION\n\nIs there direct evidence for feedback from Active Galactic Nuclei (hereafter AGN) available from the nonthermal emission of the central regions of massive galaxies? It has been observed that 10-20 percent of AGN\nare radio-loud and that the host galaxies of radioloud AGNs are usually massive elliptical galaxies (e.g.,\nHooper et al. 1995; Best 2007). The radio emission\nin radio galaxies and quasars comes from a variety\nof morphological structures, with different characteristic sizes. For example, there are compact radio cores\n(usually with flat power law spectra) coincident with\nthe nucleus of the associated optical objects, as well\nas large scale radio lobes. Other systems show radio\nlobes which may extend to several hundred kiloparsecs\nto a few megaparsecs and usually show steep power\nlaw radio spectra (e.g., Kellermann et al. 1994; Krolik\n1999; Kembhaavi & Narlikar 1999; Gilbert et al. 2004;\nMullin et al. 2006). The typical core radio luminosity\nfor FR-II sources at 5GHz is ∼ 1030 erg s−1 Hz−1 ,\nwhile the total luminosity at 178 MHz is ∼ 1033 erg\ns−1 Hz−1 (e.g., Chiaberge et al. 2000), with the spectral index (absolute value) typically smaller than 0.5 at\nthe very center and ∼ 0.7 − 0.8 at a larger radius. In\naddition to the radio observations, there are also observations in other bands for radio galaxies. For example,\nin the R-band 3CR Snapshot Survey of 252 radio galaxies, the wind-like structures seen in the contour figures\nof Martel et al. (1999) may be interpreted as produced\nby nuclear winds. Kiloparsec-scale winds are also observed in high redshift quasars (e.g., de Kool et al. 2001;\nNesvadba 2009; Nesvadba et al. 2008; Moe et al. 2009;\nCattaneo et al. 2009 and references therein). Optical\n\nsynchrotron jets are also confirmed in many sources (e.g.,\nMartel et al. 1999) and can extend to distances far outside of the body of the galaxies. Furthermore, ultraviolet and X-ray observations have also found high-velocity\noutflows in some quasars (e.g., Nesvadba et al. 2008;\nHamann et al. 2008; Nesvadba 2009; Alexander et al.\n2009; Chartas et al. 2009). Finally, although the evidence is not absolutely conclusive, there are observations (e.g., Chiaberge et al. 2000) indicating optical synchrotron from the cores of some active elliptical galaxies. The obvious question is \"what processes accelerate\ncosmic rays (hereafter CR) electrons up to the energies\nrequired to produce the observed synchrotron emission?\"\nSynchrotron emission is believed to be the mechanism responsible for the radio emission in AGNs, based\non their strong polarization (e.g., Krolik 1999). The\nrelativistic electrons, which are required for the synchrotron radio emission, can be accelerated by several\nsources. Jets are observed in most of the radio-loud\nAGNs and most investigators believe that those jets produce this radio synchrotron emission (e.g., Rees 1971;\nBlandford & Rees 1974; Sironi & Socrates 2009; also\nsee the review Mirabel & Rodrı́guez 1999 and references\ntherein). However, the energy carried by the jets is only\ndissipated in small areas near the end point or within internal reflected shocks. As the jets are driven outwards\nwith relativistic velocity, the centers of the radio contours from the jets do not overlap with the centers of the\ngalaxies (see, e.g., Kellermann et al. 1994; Mullin et al.\n2006). So, although jets are very likely responsible for\nthe displaced radio lobes, there must be other mechanisms responsible for the observed radio core emission\nat the centers of FR-II galaxies. Furthermore, in order to explain synchrotron emission in galaxies with-\n\n\f2\n\nSynchrotron Emission from Elliptical Galaxies Consequent to AGN Outbursts\n\nout jets, other sources able to accelerate electrons are\nneeded. In fact, jets are observed in ∼ 80% of FR-I radio galaxies, in ∼ 40-70% radio quasars, and even fewer\nin highly luminous FR-II galaxies (e.g., Bridle & Perley\n1984; Kembhaavi & Narlikar 1999).\nThis paper addresses the inevitable generation of\nradio synchrotron sources in elliptical galaxies consequent to central outbursts. In fact, it is now widely\naccepted that supermassive black holes (SMBHs) within\na mass range of 106 ∼ 109.5 M⊙ reside at the center of\nbulges and elliptical galaxies, and that feedback from\nthese SMHBs can profoundly affect the formation and\nevolution of these galaxies (e.g., Kormendy & Richstone\n1995; Silk & Rees 1998; Fabian 1999; Burkert & Silk\n2001; King 2003; Granato et al. 2004; Springel et al.\n2005; Sazonov et al. 2005; Hopkins et al. 2006; Hu et al.\n2006). This is strongly supported by the observed relationships between the masses of the SMBHs and various\nproperties of their host galaxies (e.g., Magorrian et al.\n1998;\nGebhardt et al. 2000;\nFerrarese & Merritt\n2000; Tremaine et al. 2002; McLure & Dunlop 2002;\nGraham & Driver 2007; Lauer et al. 2007; Lou & Jiang\n2008). In particular, in a series of works based on high\nresolution numerical simulations which include both\nradiative and mechanical feedback (Ciotti & Ostriker\n1997, 2001, 2007; Ciotti et al. 2009, hereafter Paper I),\nit has been shown how the mass loss from evolving stars\ncan drive significant nuclear activity, characterized by\nstrong and recurrent nuclear bursts, even in the absence\nof merging. This model supports the idea that the\n\"cooling flow\" phases (e.g., Peterson & Fabian 2006)\nand quasar phases are different aspects of the evolution\nof a normal elliptical galaxy. In the calculations, it is\nfound that accretion occurs in bursts, during which both\nradiative and mechanical output from the central SMBH\npushes matter out and drives shocks into the galactic\ngas. The outbursts typically combine three physically\nseparate phenomena: central star bursts, mechanical\nfeedback from winds emanating from broad-line regions\nsurrounding the SMBH, and radiative feedback from\nabsorption and scattering of hard X-ray photons. The\nresulting shocks are similar in kind (but more modest\nin degree) to the predicted outflowing blast waves\nproduced by AGNs after galaxy merging (e.g., see\nDi Matteo et al. 2005; Springel et al. 2005; Naab et al.\n2006; Sijacki et al. 2007; see also Johansson et al. 2009).\nIn this paper, we focus attention on the observational properties of the emitted synchrotron emission\nfrom the shocks that result from the recurrent bursts.\nIn fact, since the computed outflow velocities (up to\nseveral thousand kilometers per second) and densities\n(0.1 to 10 particles per cubic centimeter) are similar to\nwhat is observed in Galactic SNRs such as Tycho and\nKepler (e.g., Cassam-Chenaı̈ et al. 2007; Dickel et al.\n1988), one would expect that the same processes as\nthose we see acting in SNRs on the pc scale (specifically at the shocks' surfaces, Wang 2008) would act\non the kpc scale in galaxies. One can expect there\nto be efficient acceleration of both ionic and electronic\ncosmic rays via the well-known diffusive shock acceleration mechanism (also known as first-order Fermi\nshock acceleration, e.g., Blandford & Ostriker 1978;\nBlandford & Eichler 1987; Berezhko & Ellison 1999; see\n\nalso Treumann & Jaroschek 2008). Then, just as the\naccelerated CR electrons produce synchrotron emission\nthrough standard interactions with the (possibly amplified) magnetic field within normal SNRs, so we should\nexpect very similar processes to occur in the ISM of elliptical galaxies after outbursts. To our knowledge, this\nhas not yet been studied in quantitative detail. Using\ndiffusive shock acceleration theory, we can make a rough\nestimate of the scaling relation for luminosity, because\nthe synchrotron luminosity only depends on the CR electron density, the magnetic field B and the shock velocity.\nIf the density and velocity of the shock are fixed, the luminosity is determined by the volume occupied by CR\nelectrons and the magnetic field. The extent of emitting\nregion near the shock is determined by the synchrotron\nlosses of the electrons, which are proportional to B 2 ,\nso that the volume occupied by CR electrons goes with\nr2 /B 2 (r is the radius of the shock). Because power per\nvolume radiated by the electrons goes like B 2 , the total\nluminosity scales approximately as r2 . As the size of an\nelliptical galaxy is ∼ 100 times larger than the SNRs,\nand the densities and shock velocities in the cores of elliptical galaxies are expected to be very similar to those\nin SNRs, we expect the synchrotron luminosity from elliptical galaxy cores to be ∼ 104 - 105 larger than the\nluminosity from SNRs. Our detailed calculations (see §3)\nconfirm these rough scaling estimates.\nIn this paper, we calculate synchrotron emission from\nthe relativistic electrons accelerated by shocks during the\nevolution of an elliptical galaxy and we also show how\nthe synchrotron spectrum evolves with time. The Ciotti\n& Ostriker model for the evolution of elliptical galaxies\nprovides us with a specific scenario for computing the\nshocks, which are formed repeatedly due to the feedback of the central SMBHs. With the propagation of\nthe shock into the interstellar medium (ISM), electrons\nwill be accelerated at different positions (via the standard diffusive shock acceleration mechanism), and high\nenergy particles can be found at large radii. This is very\ndifferent from the concept sometimes proposed that CRs\nare accelerated at the center and escape to large radius,\nsince such CR electrons would suffer from large adiabatic\nlosses and become relatively ineffective radiators. In §2\nwe present the method to calculate the accelerated electron spectrum and associated synchrotron emission. In\n§3 we show the result from a single shock taken from\na numerical simulation. The main results are summarized in §4 and discussions and observational results of\nour model are given in §5.\n2. CALCULATION METHOD\n\nIn this Section, we describe the numerical model\nadopted for the simulation and we give the formulae\nfor the diffusive shock acceleration mechanism and synchrotron emission used in this paper.\n2.1. The Hydrodynamical Model\n\nThe details of hydrodynamical simulations of radiative\nplus mechanical feedback and how the kinetic energy,\nmomentum and mass of the wind are transferred to the\nISM in combined (i.e., radiative plus mechanical feedback) models are described in Paper I, while the exploration of parameter space in combined models is postponed to Ciotti et al. (2009c) (hereafter Paper III). We\n\n\fY.-F. Jiang et al.\nrecall that the code is 1-D, and that, as in Paper I, a simplified version of mechanical feedback is adopted1 , which\nis similar to that used by others (e.g., Di Matteo et al.\n2005) studying AGN feedback. The galaxy model is a\nJaffe stellar distribution embedded in a dark halo so that\nthe total density profile decreases as r−2 (Ciotti et al.\n2009b and references therein). The cooling and heating functions (Sazonov et al. 2005) include photoionization plus Compton and line heating, while the SMBH\naccretion rate is mediated by a circumnuclear accretion\ndisk modelized at the level of subgrid physics. Finally,\nthe mass return rate from evloving stellar populations is\ncomputed by using the detailed prescriptions of stellar\nevolution. A discussion of the limitations of 1-D simulation is deferred to §4.\nIn the following discussion, we focus on a specific\nmodel labeled B302 (Paper I; Paper III, in preparation),\nwhich models the radiation and mechanical feedback\nfrom AGNs to the host elliptical galaxies. This model\nhas an initial stellar mass M⋆ =2.87 × 1011 M⊙ and an\ninitial SMBH mass MBH =2.87 × 108 M⊙ . The galaxy\neffective radius is Re =6.9 kpc and the aperture central\nvelocity dispersion is σ0 =260 km s−1 . The first grid point\nin the code corresponds to Rmin =5 pc. The simulation\nstarts at 2 Gyr and lasts to 14.5 Gyr. The time evolution\nof the SMBH bolometric accretion luminosity is shown\nin Fig. 1.\nThe computations show that a cooling instability\n(Field 1965) starts as a cool (T ∼ 104 K) and dense shell\nat r ∼ 1 kpc; this shell collapses, feeds gas into the center,\nand the SMBH responds with a major burst. In more detail, the infalling shell compresses the gas inside the collapsing volume, so that more and more gas is accreted\nby the SMBH even before the cold shell reaches the center. The luminosity of SMBH increases rapidly with\ntime, and when it reaches ∼1 % of Eddington luminosity,\nthe infalling matter is pushed out by the radiation from\nthe SMBH (e.g., Ostriker et al. 1976; Milosavljević et al.\n2009). At the same time, a wind appears from the circumnuclear disk and a shock is driven into the ISM. The\nshock hits the still infalling cold shell at a very high Mach\nnumber, due to the low temperature of the shell. The\nshock continues to propagate into the galaxy; gradually\nits energy is deposited into the ISM, and it dies away with\ntime. In the meantime, reverse shock waves carry fresh\ngas to the center, and several sub-bursts are generated.\nFinally, the last burst ends the sequence. The duty cycle\n- the fraction of time that the central SMBH is in the\noutburst mode with LBH > LEdd /30 - is of the order of\n∼ 5 %, consistent with the fraction of elliptical galaxies\nseen as quasars. As commonly found in combined (i.e.,\nradiative plus mechanical feedback) models discussed in\nfull extent in Paper III, the temporal structure of each\nmajor burst is highly organized into a series of sub-bursts\n(as apparent from the temporal structure of each of the\n4 major bursts in Fig. 1), while purely mechanical feedback models present much simpler bursts, as can be seen\nby comparison with Figs. 2, 3 and 4 in Paper I. In our\ncase, each shock will accelerate electrons and protons.\nNow we focus on the first sub-burst in the last major burst around 6.5 Gyr. The SMBH bolometric accre1 In practice, the time derivative in equation (28) of Paper I is\nset to zero.\n\n3\n\nFig. 1.- Time evolution of the SMBH bolometric accretion luminosity LBH for model B302 . The nearly horizontal solid line is\nthe Eddington luminosity LEdd . There are four major bursts during the evolution history of the model, and each major burst is\ncomposed of several sub-bursts.\n\ntion luminosity LBH reaches 1 % of Eddington luminosity\nLEdd at the time 6.48 Gyr, and we define this time as the\nzero time point. With this time origin, LBH reaches 0.1\nLEdd around 0.234 Myr later, and it peaks at 0.5LEdd\nat ∆t = 0.252 Myr. Fig. 2 shows the radial profile of\nthe physical variables at ∆t = 0.204 Myr, just before\nthe peak of the burst. We can see clearly the cold shell\ninitially at 40 pc falling to the center. Fig. 3 shows the\nappearance of outflow with the solid line (∆t = 0.235\nMyr) still before the peak of the burst: the wind pushed\nout by radiation from the SMBH reaches 5.1 pc, with\na velocity of only 100 km/s (arrow A). By the time the\nshock reaches 15 pc (arrow B) the maximum velocity has\nincreased up to 3600 km/s, as it is being steadily accelerated from below, and it has hit the infalling cold shell,\nwhich results in a very high Mach number shock.\n2.2. Acceleration of Particles at the Shocks\n\nSynchrotron emission from shocks based on the diffusive acceleration mechanism has been applied to astrophysical systems on different scales. In particular, for\nSNRs there exist different nonlinear models for the structure and evolution of cosmic ray modified (strong) shocks\n(e.g., see Koyama et al. 1995; Berezhko & Ellison 1999;\nEllison et al. 2000; Lazendic et al. 2004; Ellison et al.\n2004; Berezhko & Völk 2006; Ellison et al. 2007; see the\nreviews by Reynolds 2008, Treumann & Jaroschek 2008).\nWith this method, the synchrotron spectra at different\nradii and their evolution with time can be computed and\nthen compared with the observations of SNRs, showing good agreement (e.g., Reynolds 1998; Lazendic et al.\n2004; Cassam-Chenaı̈ et al. 2007). Some researchers\nhave also carried out simulations on the scale of galaxy\nclusters to study the radio haloes and relics based on the\ndiffusive shock acceleration mechanism in the limit of test\nparticle theory (e.g., Ensslin et al. 2007; Pfrommer et al.\n\n\f4\n\nSynchrotron Emission from Elliptical Galaxies Consequent to AGN Outbursts\n\n6\n\n-7\n\n8\n-9\n-1\n\nFig. 2.- Thermal instability and the falling cold shell: the radial\nprofile of the ISM energy per unit volume E, proton number density\nnp , radial velocity v, and temperature T . Solid, dotted and dashed\nlines correspond to ∆t = 0.204, 0.214 and 0.224 Myr after LBH\nreached 0.01 LEdd (6.48 Gyr, see Fig. 1). This time is defined to\nbe the zero point. Note how the gas density in the central regions\nincreases due to compression before the cold shell (40 pc from the\ncenter at ∆t = 0.204 Myr) reaches the center.\n\n2008). Here, we apply the same techniques to the case\nof wind-driven shocks in elliptical galaxies.\nOur CR shock acceleration scheme is based on well established physical principles (the first order Fermi mechanism) but utilizes a new, quite efficient numerical implementation, which allows us to perform the analysis\nduring post-processing instead of during the runs, saving considerable computational time. We use the test\nparticle theory to calculate the electron spectrum at\nthe shock, which gives the basic characteristics of the\nnon-thermal electrons (e.g., Blandford & Ostriker 1978;\nBlandford & Eichler 1987; see also the recent review by\nReynolds 2008). Consistent with test particle theory,\nthe CRs are assumed to not change the structure of the\nshocks, so that we can use the output of the hydrodynamical code to calculate the synchrotron spectrum.\nIn order to compute the acceleration of the electrons\nand protons, first we have to identify and follow the\nshocks as they move through the ISM. Each shock is\ndriven by the combined effect of radiation and nuclear\nwinds following a burst, and it propagates into the ambient gas of the elliptical galaxy. For each hydrodynamical\noutput file, we calculate the dimensionless compression\nfactor\nr\ndiv(v)\n(1)\nδ≡\n|v|\n\nat every point on the grid. Here r is the radius, v is\nthe fluid velocity vector and |vr | is the absolute value of\nvelocity2 . As the shock strongly compresses the gas, a\n2\n\nOnly the radial component is non-zero due to adopted spherical\n\nFig. 3.- Post outburst: the radial profile of the physical variables when a burst appears at ∆t1 = 0.235 Myr. Solid, dotted\nand dashed lines correspond to ∆t = 0.235, 0.239 and 0.243 Myr.\nThe fluid radial velocity changes direction from inward to outward\nbetween ∆t1 = 0.235 Myr to ∆t2 = 0.239 Myr. The cold shell is\nstill visible in the solid line at the center. The arrows (A, B, C) indicate the positions of the shock at the three defined moments (see\nFig. 4); the shock initially accelerates (A→B) due to the SMBH\ndriving from below and then decelerates (B→C) as adiabatic losses\novercome the SMBH input.\n\nlocal deep minimum of δ marks the position of the shock.\nThe upstream sonic Mach number of the shock is given\nby\nM=\n\n|v − us |\n,\ncs\n\n(2)\n\nwhere us is the shock velocity relative to the galaxy and\ncs is the upstream sound speed. The shock velocity us is\nnumerically estimated by determining the change in the\nshock position within a time step. The upstream sound\nspeed is calculated from the upstream temperature T and\ndensity ρ as\ns\u0012\ns\n\u0013\n∂P\nγkB T\ncs =\n=\n,\n(3)\n∂ρ S\nμmp\nwhere P is the pressure, kB is the Boltzmann constant,\nμ∼\n= 0.62 is the mean molecular weight, mp is the proton\nmass, and γ = 5/3 is the adiabatic index of the gas.\nAs the magnetic field B, necessary for the synchrotron\nemission, is not included in our hydrodynamical code,\nwe must assume a fiducial value based on physical arguments. In particular, for elliptical galaxies, there is\nevidence that the ratio between the non-thermal and\nthermal pressures is about 0.1-0.2 (e.g., Churazov et al.\n2008; Churazov et al. in preparation, private communication). Here we just assume the ratio between the\nsymmetry.\n\n\fY.-F. Jiang et al.\nthermal and magnetic pressure to be\nβ≡\n\nP\n∼\n= 10,\nB 2 /(8π)\n\n(4)\n\nso that we can estimate the postshock magnetic field from\nthe thermal pressure.\nNow we summarize the basic results of the test particle theory. The 1-D momentum spectrum of the nonthermal electrons is taken to be a power law :\nf (p) = 4πp2 × C0 p−q = 4πC0 p2−q ,\n\n(5)\n\nwhere p is the momentum of the electrons and C0 is the\nnormalization of the spectrum, which will be determined\nlater. The exponent q is given by3\n3τ\n,\nq=\nτ −1\n\n(6)\n\nwhere the compression ratio τ is related to the Mach\nnumber M as\n1\nγ−1\n2\n1\n.\n(7)\n=\n+\nτ\nγ + 1 γ + 1 M2\nFrom the momentum distribution (5), and from the\nenergy-momentum relation\nr\u0010\nE \u00112\n− 1,\n(8)\n1+\np = me c ×\nme c 2\n\nwhere E and me are the kinetic energy and the rest mass\nof electrons respectively, and c is the speed of light, we\ncan express the energy spectrum of the non-thermal electrons as\nN0 (E) = 4πC0 p2−q\n\ndp\n.\ndE\n\n(9)\n\nThe energy of non-thermal electrons ranges between\nEmin (with the corresponding minimum momentum\npmin ) and Emax (with maximum momentum pmax ).\nFollowing what is done in the computations of SNRs\nand galaxy clusters (e.g., Berezhko & Ellison 1999;\nEnsslin et al. 2007), the minimum momentum pmin is related to the downstream temperature T2 by the injection\nparameter xinj :\np\npmin = xinj 2 × me kB T2 (cgs).\n(10)\n\nFor electrons, the maximum energy at the shock is determined by the balance between radiative loss and acceleration gain, which gives4 (e.g., Webb et al. 1984; Reynolds\n2008):\n8\n\nEmax = 71.65 (us /10 ) × (B2 /10\n= 44.72 u\n\ns,103 km/s\n\n−6 −0.5\n\n)\n\n−0.5\n\n× (B2,μG )\n\nerg (cgs)\n\nTeV.\n\n(11)\n\n3 Here we neglect the Alfven speed, with which the scattering\ncenters presumably move, in comparison to the flow speed. This\ncorrection is only important for low Mach number shocks. Because\nsynchrotron emission mainly comes from strong shocks, neglecting Alfven speed will not change the spectrum significantly (e.g.,\nCaprioli et al. 2009).\n4 In a typical elliptical galaxy, the energy density of IR background and star light is usually small compared with the downstream magnetic energy density. So we ignore the electrons' inverse\nCompton cooling here.\n\n5\n\nwhere B2 is the downstream magnetic field. Actually,\nin the test particle theory, the synchrotron spectrum is\nnot very sensitive to the maximum energy Emax . But\nthe cutoff of the power-law spectrum does depend on\nEmax . In order to determine the normalization of the\nelectron spectrum, we follow the approach adopted in\nsimulations of galaxy clusters (e.g., Ensslin et al. 2007;\nPfrommer et al. 2008) and smoothly connect the powerlaw momentum spectrum of electrons to the downstream\nthermal spectrum at the momentum pmin . Then the\ncoefficient C0 in equation (5) is given by\nC0 =\n\n2\nne,2\npq\ne−pmin /(2me kB T2 ) , (12)\n(2πme kB T2 )3/2 min\n\nwhere ne,2 is the downstream electron number density.\nThe test particle result is valid only when the energy\ndensity of the non-thermal particles is small enough compared to the thermal energy density so that the CRs do\nnot significantly change the structure of the shock. However, for a strong shock with a very high Mach number\n(e.g., when the shock encounters the cold shell), calculation with the above method will easily produce an electron energy density comparable to the downstream thermal energy. So in our calculations we have to choose appropriate normalization of the electron momentum spectrum for different Mach numbers, and we adopt the\nmethod used in Ensslin et al. (2007) and Pfrommer et al.\n(2008). First, we obtain the electron energy spectrum\nfrom equations (9) and (12), so that the energy density\nof the non-thermal electrons Ke,0 is\nZ Emax\nEN0 (E)dE .\n(13)\nKe,0 =\nEmin\n\nThen, the ratio between the non-thermal electron energy\ndensity and the downstream thermal energy density (in\nthe test particle theory approach) is\nξlin =\n\nKe,0\n,\n1.5n2 kB T2\n\n(14)\n\nwhere n2 is the downstream total number density. The\nratio ξlin can be very large for a shock with large M.\nNow we set a maximum ratio between the non-thermal\nelectron energy density and the downstream thermal energy density to ξmax = 0.05 (a value suggested by simulation of Keshet et al. 2003; also see Pfrommer et al.\n2008) and define a parameter χ ≡ ξlin /ξmax . The modified normalization of the electron momentum spectrum\nwe use in our calculation becomes\nC = (1 − e−χ )χ−1 C0 ,\n\n(15)\n\nso that C → C0 for χ → 0, while C → C0 /χ for very\nlarge values of χ. In other words, if ξlin is very small\ncompared with ξmax (χ ≪ 1), then C ∼ C0 and the energy\ndensity ratio is approximately ξlin . However, if ξlin is\nvery large compared with ξmax (χ ≫ 1), the final energy\ndensity ratio between the non-thermal electrons and the\ndownstream thermal energy density cannot exceed ξmax .\nRoughly speaking, the modification is important when\nM is larger than 10. Therefore, equation (9) becomes\nN (E) = 4πC p2−q\n\ndp\n,\ndE\n\n(16)\n\n\f6\n\nSynchrotron Emission from Elliptical Galaxies Consequent to AGN Outbursts\n\nand the energy density and number density of the nonthermal electrons are given by\nZ Emax\nZ Emax\nN (E)dE.(17)\nEN (E)dE , Ne =\nKe =\nEmin\n\nEmin\n\nThe finally ratio between the non-thermal electron energy density and downstream thermal energy density ξ\nis the same as equation (14) with Ke,0 replaced by Ke .\nIn particular, the injection coefficient η, a parameter determining the acceleration efficiency modeled in the diffusive shock acceleration mechanism (e.g., Ensslin et al.\n2007), is defined here to be\nη≡\n\nNe\n.\nne,2\n\n(18)\n\nAnother thing which must be emphasized is that here\nwe do not give the energy density of the non-thermal\nprotons, which is unnecessary for our purpose. By using test-particle theory we are assuming non-modified\nshocks, and the CR energy density is less than 10% of\nthermal energy density by assumption5 . This is only a\nfirst order approximation and a first step to determine\nwhether a more advanced model is merited.\n2.3. The Spectrum after the Shocks\n\nThe test particle framework described above gives the\nenergy spectrum of the non-thermal electrons at the\nshock, and we need to compute the evolution of the spectrum further downstream. For simplicity, we assume no\ndiffusion in our calculation. This means that once the accelerated electrons are generated at the shock, they are\nfrozen to the fluid element. So, while the shock propagates outwards, the non-thermal electrons are left behind\nand move with the fluid. These non-thermal electrons\nsuffer radiative and adiabatic losses, and the electron energy spectrum will change with time. The changes of\nthe electron energy and number density are well-known\n(e.g., Reynolds 1998; Cassam-Chenaı̈ et al. 2007). We\nwill describe our numerical implementation of the spectral evolution formulae of Reynolds (1998). We assume\nthat an electron with energy E0 is generated at time t0\nat radius r0 , where the mass density is ρ0 . At a later\ntime t, the electron moves to the new position r, where\nthe mass density is ρt = ρ(r, t), so that the compression\nratio of the fluid element is\nρt\n.\n(19)\nα(r, t) ≡\nρ0\nAfter the losses, the energy of the electron at time t and\nradius r is\nE(r, t) = α1/3\n\nE0\n,\n1 + ΘE0\n\n(20)\n\nwhere the quantity Θ is the result of the following integral\nZ t\n2\nBeff\n(t)α1/3 (t)dt .\n(21)\nΘ(t) ≡ A\nt0\n\n5\n\nSome observations show that in SNRs 10% of the mechanical energy of the explosion can be converted into CRs (e.g.,\nAharonian et al. 2004).\n\nThe coefficient in front of the integral is A ≡\n4e4 /(9m4e c7 ) = 1.57 × 10−3 (cgs) (e is the electron's\ncharge ) and\nq\n2 (1 + z)4 ,\n(22)\nBeff ≡ B 2 + Bcbr\n\nwhere Bcbr ≡ 3.27 μG is the magnetic field strength with\nenergy density equal to that of the CMB at the redshift\nz = 0.\nEach of the non-thermal electrons generated by the\nshock will change its initial energy according to the above\nequations, and the energy spectrum of these electrons\nwhen they are generated is given by the test particle\nresult (equation 16). As the number of electrons is conserved, at time t and radius r the energy spectrum of\nthese electrons becomes\nh E (E) i2\n0\nN (E)r,t = N (E0 )α−2/3\n.\n(23)\nE\nNote that E0 as a function of E is determined by inverting equation (20). In particular, initially the maximum energy and minimum energy of the electrons are\nEmax,0 and Emin,0 . Subsequently, the maximum energy\nand minimum energy will also change to the new maximum energy Emax and minimum energy Emin according\nto equation (20).\nOnce we obtain the energy spectrum of the electrons,\nwe can calculate the resulting synchrotron spectrum, i.e.,\nthe emissivity of the population of electrons in the energy\ninterval Emin ≤ E ≤ Emax\nZ Emax\nP(ν) N (E)dE erg s−1 cm−3 Hz−1 .(24)\nJν =\nEmin\n\nThen the luminosity Lν can be calculated by integration\nof Jν over the whole volume. In the above equation, the\nsynchrotron emission from a single electron is given by\n√ 3\nZ ∞\n3e B⊥ ν\nP(ν) =\nK5/3 (x)dx erg s−1 Hz−1 ,(25)\nme c2 νc ν/νc\nwhere K5/3 (x) is a modified Bessel function of the second\nkind, and\nνc =\n\n3eB⊥ 2\nE\n4πm3e c5\n\n(26)\n\nis the critical frequency, where E is the energy of the\nelectron and B⊥ is the magnetic field component perpendicular to the line of sight (e.g., Blumenthal & Gould\n1970; Lazendic et al. 2004). In our calculation B⊥ is approximated by B given in equation (4).\n2.4. Numerical Method\n\nAs the shock emerges from the center of our model\nelliptical galaxy and moves outwards, it will accelerate\nparticles at each position it passes through. Once the\nnon-thermal particles are generated by the shock, they\nwill be frozen in the fluid element as we assume no diffusion, and the spectrum will evolve according to equation\n(23). In practice, in our modeling, at every given time,\nthere will be non-thermal electrons within a certain radial range with the new ones produced by the shock and\nthe old ones moving out with the fluid. Accordingly, we\ncalculate the synchrotron emissivity from equation (24)\n\n\fY.-F. Jiang et al.\n\n7\n\nat each radius and then obtain the total luminosity by\nintegrating over the volume.\nIn practice, once the electrons are generated by a shock\nat certain radius r0 at time t0 , we follow the fluid element\nand compute its position rt at time t. From the hydrodynamical code, we know the velocity vr (t) and acceleration\nar (t) of each fluid element, so that the new position rt\ncan be estimated as\nrt = r0 +\n\nt\nX\nt0\n\n△r,\n\n(27)\n\nwhere the position increment △r in each time step △t is\ncalculated as\n1\n(28)\n△ r = vr (t) × △t + ar (t) × △t2 ,\n2\nFor higher numerical accuracy, the quantities vr (t) and\nar (t) of the fluid element at radius r could be approximated by the average velocity and acceleration of the two\nfluid elements at radius r and r + dr, which are given in\nthe output from the code.\nSo, in our calculation, when a shock is found at time t,\nits position is determined by the criterion given in equation (1). Then we follow the fluid element, that at time\nt was at the position of the shock according to equations (27) and (28). After one time step, we identify\nthe new position of the shock and follow a new fluid element. While following each fluid element that passed\nthe shock, we calculate the value of Θ(t) given by equation (21). In this way, we know the energy spectrum\nof the electrons from equation (23) at different positions\nat time t, and we finally calculate the total synchrotron\nspectrum. Note that our numerical method is different\nfrom the standard method which solves the continuity\nequation for electrons in the 2-D phase space at each\ntime step (e.g., Longair 1994). Instead, in our method,\nthe energy spectrum at each time step is calculated analytically according to equation (23), and we only need to\nfollow one-dimensional the fluid element, which is computationally more efficient.\n3. RESULTS FROM ONE SHOCK\n\nNow we give an example of the determination of the\nproperties of the synchrotron spectrum for a shock in\nmodel B302 . In particular, we focus on the last major\nburst in the example described in §2.1.\n3.1. Synchrotron Spectrum\n\nWe define the time when the SMBH bolometric accretion luminosity LBH reaches 1 percent of Eddington\nluminosity LEdd as the zero time point, corresponding to\n6.48 Gyr in the code. Before the shock is formed and\ncan be recognized by the code, a cold shell is falling towards the center, which can be seen clearly from Fig. 2.\nFrom Fig. 3, we can see that at a later time ∆t = 0.235\nMyr, the radial velocity changes from negative to positive, indicating the emergence of the nuclear wind and\nthe shock. The result of equation (1) is shown in Fig.\n4. At the position of the shock, the parameter δ has a\nminimum value, which confirms our criterion for finding\nthe shock.\nAt each time we find the position of the shock and\nfollow the shock until it disappears. Meanwhile, we\n\nFig. 4.- The shock-locating method. In the two top panels, the\ndimensional quantity div(v) (left) and the dimensionless function\nδ (right, equation 1) are shown for the same profiles shown in Fig.\n3. The solid, dotted and dashed lines are in time order, separated\nby 0.004 Myr. The solid line is at time ∆t1 = 0.235 Myr after the\ntime zero point. The three lines also show the movement of the\nshock, which can be used to estimate the shock velocity. There are\nthree arrows and letters in the figure to show the position of shock\nfound at different times.\n\ncalculate the energy spectrum of the non-thermal electrons accelerated by the shock with equation (16) and\nthe spectral evolution according to equation (23). Then\nthe synchrotron emissivity at each radius is calculated\nfrom equation (24) and the total synchrotron spectrum\nfor our model elliptical galaxy is the sum of the emission\nfrom different positions. So, the final spectrum is actually not from a single population of power law electrons,\nbut from electrons at different times in their evolution.\nIn Fig. 5 we show the radial profile of the magnetic field,\nthe non-thermal electron energy density and the flux for\ndifferent frequencies at the time ∆t = 0.335 Myr. The\nmagnetic field is estimated according to equation (4). At\nthis time, the shock is located at about 327 pc and the\nbump of the magnetic field is due to the compression at\nthe shock. The non-thermal electron energy density is\nestimated according to equation (17). As we assume no\ndiffusion, non-thermal electrons only exist in the radial\nregion 258 - 327 pc at this time. The non-thermal electrons around 260 pc come from the initial strong shock\n(arrow A in Fig. 4). The flux at radius R is estimated\nby νJν × R, and the fluxes of radio emission (4.84 GHz),\noptical emission (7.25 × 1014 GHz) and X-ray emission\n(2.42×1017 GHz) are labeled by solid, dashed and dotted\nlines, respectively. Though the electron energy density\naround 260 pc is large, these are \"old\" electrons that do\nnot contribute to the synchrotron emission in the three\nfrequencies by this time. The X-ray emission can only be\nfound just behind the shock, while the optical emission\ncan be found within two cells of the shock. However, the\n\n\f8\n\nSynchrotron Emission from Elliptical Galaxies Consequent to AGN Outbursts\n\n2\n\nB / μG\n\n10\n\n0\n\nFlux / erg s−1 cm−2\n\nKe/ erg cm−3\n\n10 1\n10\n\n2\n\n10\n\n3\n\n4\n\n10\n\nR / pc\n\n10\n\n−5\n\n10\n\n−10\n\n10\n\n260\n\n270\n\n280\n\n290\n\n300\n\n310\n\n320\n\n300\n\n310\n\n320\n\nR / pc\n\n−5\n\n10\n\n−10\n\n10\n\n250\n\n260\n\n270\n\n280\n\n290\n\n330\n\nR / pc\nFig. 5.- Radial profile of the magnetic field, electron energy density and synchrotron flux for three frequencies at time ∆t = 0.335\nMyr. At this time, the shock is located at about 327 pc. The upper panel shows the radial profile of magnetic field estimated according\nto equation (4) at this time. The bump around 300 pc is due to the compression by the shock. The middle panel shows the radial profile\nof electron energy density calculated according to equation (17). As we assume no diffusion, non-thermal electrons only exist in the radial\nregion 258 - 327 pc at this time. The lower panel shows the radial profile of the flux for different frequencies: radio band 4.84 GHz (solid\nline), optical band 7.25 × 1014 Hz (dash line), X-ray band 2.42 × 1017 Hz (the dot). The flux at radius R is estimated by νJν × R. Note\nthat the higher the frequency is, the closer the flux is to the shock. At this time, the X-ray emission can only be found just after the shock,\nwhile the optical emission can be found in two cells after the shock. For the radio emission, it exists in a much more extended region.\n\nradio emission can extend over almost the whole region\npassed by the shock.\nIn our model, the only free parameters needed to calculate the synchrotron emission are xinj , defined in equation (10), which is related to the minimum momentum\nof the accelerated electrons, and the saturation parameter ξmax = 0.05. In order to make the injection coefficient η (equation 18) to be about 10−4 , which is\na reasonable value used in the models of SNRs (e.g.,\nBerezhko & Ellison 1999), we take the value6 xinj = 3.6,\nthe same as the value taken in the model of Ensslin et al.\n(2007). Note that as we do not include the jet feedback\nin the hydro simulation (see Paper I), the synchrotron\nemission calculated here is not the total emission that\nwould be observed from a real elliptical galaxy. It can\n6 If x\ninj is smaller, more electrons will be accelerated and the\nemission will be stronger while the contrary is also true. However,\nas electrons with momentum around pmin do not contain most of\nthe energy for non-thermal electrons in strong shocks, the total\nspectrum is not very sensitive to xinj .\n\nonly be compared to elliptical galaxies without jets or\nto the core emission in elliptical galaxies with extended\njets. We take snapshots at four different times during\nthe evolution of the model. The resulting spectra are\nshown in Fig. 6. The change of spectral shape with time\nin this figure is due to the radiative and adiabatic losses.\nIn particular, the high frequency part disappears at late\ntimes (due to a smaller magnetic field at larger radii and\nlosses). We define the fiducial radius rh enclosing the volume within which half the energy at the frequency 5 GHz\nis emitted. The spectral index α at a certain frequency is\ndefined to be the index of the power law approximation:\nJν ∝ ν α .\n\n(29)\n\nIn practice, we calculate the spectral index by the following difference\nα=\n\nlog Jν1 − log Jν2\n,\nlog ν1 − log ν2\n\n(30)\n\nwhere the two frequencies are chosen to be ν1 = 0.17\n\n\fY.-F. Jiang et al.\n\n9\n\n∆t =0.235 Myr\n1\nr =5.114 pc\n\n35\n\n10\n\nν=5 GHz\n\nh\n\nα(5GHz)=−0.49\n14\n\nν=4.3×10\n\n30\n\n10\n\n∆t =0.275 Myr\n2\nr =112.21 pc\n\nHz\n\nh\n\nLuminosity (erg s−1 Hz−1 )\n\nα(5GHz)=−0.81\n\n25\n\n10\n\n∆t =1.035 Myr\n3\nr =1878.10 pc\nh\n\n20\n\nα(5GHz)=−0.72\n\n10\n\n15\n\n∆t4=4.635 Myr\nrh=4389.21 pc\n\n10\n\nα(5GHz)=−7.57\n10\n\n10\n\nInfrared\n\nRadio\n\nVisible\n\nUltraviolet\n\nX−ray\n\n5\n\n10\n\n8\n\n10\n\n10\n\n10\n\n12\n\n10\n\n14\n\n10\n\nν (Hz)\n\n16\n\n10\n\n18\n\n10\n\n20\n\n10\n\nFig. 6.- Synchrotron emission spectra without absorption at four different times. The solid, dash, dot and dash-dot lines are the total\nsynchrotron spectrum from the elliptical galaxy at the time ∆t1 = 0.235 Myr, ∆t2 = 0.275 Myr, ∆t3 = 1.035 Myr and ∆t4 = 4.635 Myr\nrespectively after the defined time zero. The half radius rh with each line is the radius within which half energy at the frequency 5 GHz\nis emitted. α is the spectral index defined in equation (30). The arrow labeled with 'ν = 5 GHz' is the range of observed core radio\nluminosity at 5 GHz in FR II sources (Zirbel & Baum 1995; Chiaberge et al. 2000). The arrow labeled with 'ν = 4.3 × 1014 Hz' is the range\nof observed core optical luminosities at 4.3 × 1014 Hz (wavelength λ = 7000Ȧ) in FR II sources by HST , which are believed to originate\nfrom non-thermal emission (Chiaberge et al. 2000). At the bottom of this figure, the names for different frequency bands are labeled.\n\nGHz and ν2 = 5 GHz, so that we can compare our calculation with observations in the two bands. From Figure\n6, we can see that the spectrum becomes steeper with\ntime and the absolute value of the spectral index becomes larger. The ratio ξ of the non-thermal electron energy density generated by the shock to the downstream\nthermal energy density will change for different Mach\nnumbers, as shown in Fig. 7. The non-thermal electron\nenergy density is calculated according to equation (17).\nNote that the maximum ratio is ξ ∼ 0.05, which is nearly\nreached only for very high Mach numbers. For small\nMach numbers, the ratio is only about 0.001. Roughly\nspeaking, when M is larger than 10, the saturation condition (equation 15) becomes very important. Though\nwe do not consider protons here, they will also be accelerated by the shock. As total cosmic ray energy density is\nestimated to be around 10 percent of the shock's kinetic\nenergy (e.g., Aharonian et al. 2004), the energy density\nratio between the protons and electrons will also change\nwith Mach number. For large Mach number, the en-\n\nergy density ratio between the non-thermal protons and\nnon-thermal electrons is smaller (say 10 or smaller) while\nfor small Mach number, the ratio is larger (for example\n100). The adopted test particle theory assumes that the\npost shock CR pressure is small compared to the thermal gas pressure and we find that this assumption to be\nvalid during most of the time of evolution except when\nthe shock encounters the cold shell, where the modified\nspectrum takes effect. To the first order of approximation, we neglect the pressure of CRs, which is a first step\nto determine whether a more advanced model is merited.\n3.2. Synchrotron Radio Emission\n\nWhile the shock moves outwards, it dissipates energy\ninto the ISM and finally disappears. In this example, we\ncan still see the shock at the time ∆t = 46 Myr at the\nradius 32.7 kpc, where a second shock due to the next\nsub-burst emerges. But as we have shown in Fig. 6, the\nradio emission is already almost unobservable at the time\n∆t = 4.635 Myr. In Fig. 8, we show the evolution of the\nsynchrotron emission size rh (at 5 GHz, defined as the\n\n\f10\n\nSynchrotron Emission from Elliptical Galaxies Consequent to AGN Outbursts\n35\n\n10\n\n0.05\n0.04\n\nLumiosity /erg s−1 Hz−1\n\n30\n\nξ\n\n0.03\n0.02\n0.01\n\n10\n\n25\n\n10\n\n20\n\n10\n\n15\n\n10\n\n0 0\n10\n\n1\n\n10\n\n2\n\n3\n\n10\n\n10\n\nMach Number\n\n10\n\n10\n\n0\n\n10\n\nFig. 7.- Acceleration efficiency at different Mach numbers, M.\nThe figure shows the ratio between the non-thermal electron energy density accelerated by the shock to the downstream thermal\nenergy density just after the shock ξ, as computed from the hydrodynamical code. For high M, the ratio is almost 0.05, which occurs\nwhen the shock encounters the cold shell. For small M, the ratio\ncan be around 0.001. To the degree that ξ ≪ 1, the test particle\ntheory adopted in this paper is accurate. Roughly speaking, when\nM is larger than 10, modification to the normalization (equation\n15) is important. The red dashed line is the theoretical result of the\nmodel with an assumed constant downstream temperature 5 × 107\nK, an assumed constant downstream number density 10 cm−3 , and\nan assumed maximum electron energy 100 TeV. Even for the same\nM the ratio ξ can be different for different temperature and number density.\n\n4.5\n4\n\nrh at 5 GHz/ kpc\n\n3.5\n3\n2.5\n2\n1.5\n1\n0.5\n0\n0\n\n0.5\n\n1\n\n1.5\n\n2\n\n2.5\n\n∆ t / Myr\n\n3\n\n3.5\n\n4\n\n4.5\n\n5\n\nFig. 8.- Evolution of the synchrotron radio emission size at 5\nGHz. The size rh is defined to be the radius within which half the\nenergy at the frequency 5 GHz is emitted. At around 3 Myr, the\nsize decreases because at this time there is no contribution to the 5\nGHz synchrotron radio emission from the new shock position due\nto small magnetic field. Then the emission at this band is only\nfrom the 'old' electrons, which suffer large radiation and adiabatic\nlosses and move outwards.\n\nspatial radius enclosing half of the emitted synchrotron\nluminosity at the given time). Generally, rh increases\nwith time as the non-thermal electrons, which are frozen\nin the fluid element, move outwards. However, when the\nshock propagates into the regions with low magnetic field\nstrength, there will be almost no synchrotron radio emission at 5 GHz and the apparent size will decrease at that\ntime. The size rh may change from a very small initial\nsize (5.1 pc in this example) to around 4.5 kpc. In Fig.\n9, we show the evolution of synchrotron luminosity at 3\ndifferent frequencies. Note that the spectrum shown in\n\n∆ t / Myr\n\nFig. 9.- Evolution of the synchrotron luminosity in 4 different\nbands: ν = 0.17 GHz (solid dots, radio), ν = 4.84 GHz (crosses,\nradio), ν = 7.25 × 105 GHz (triangle, optical, and the first two\npoints in this line are connected by a dash line because they will\nbe absorbed by the dust), ν = 2.42 × 108 GHz (open circles, XRay). The larger the frequency is, the sooner radiation at that\nfrequency disappears. In the four horizontal dashed lines we show\nwhat would be seen if νLν for each cited frequency band had the\npower 5 × 1038 erg s−1 .\n\nFig. 6 is the emission spectrum without allowance for\nabsorption. However, for radio bands, the optical depth\ndue to synchrotron self-absorption at 0.1 GHz initially\nis only about 10−4 and smaller at later times. The synchrotron self-absorption is thus only important for frequencies smaller than 107 Hz in this example.\n3.3. Synchrotron Emission in Other Bands\nFor optical bands, the main absorption is due to dust.\nThe optical depth due to dust absorption is calculated\nin the code (Paper I). The optical emission is absorbed\nby dust for ∆t ≤ 0.33 Myr (within 300 pc in this example), but the absorption is not important after that\ntime. A fiducial estimate of the expected mean flux\nΣo of the optical synchrotron emission is obtained as\n2\nΣo ≡ Lo /(2πrh,o\n), where Lo is the total synchrotron\nluminosity in the optical band (7.25 × 1014 Hz), and\nwhere we have neglected the difference between the radius within which half of luminosity is emitted rh,o and\nthe projected surface effective radius. We compare Σo\nwith the optical flux of our galaxy model, to see whether\nthe synchrotron optical emission can be observed or not.\nIn order to estimate the stellar flux of the galaxy model,\nwe adopt as a fiducial value for the surface brightness\nat the effective radius Σe = 22 mag/arcsec2, and for the\neffective radius Re = 6.9 kpc. At each time, we then compare the value of Σo with the stellar flux profile obtained\nfrom the de Vaucouleurs profile, i.e., with Σ⋆ (rh,o /Re ).\nThe result is shown in Fig. 10. This figure shows that\nthe synchrotron optical emission is stronger than the star\nlight only at early times. Later on, it is too faint compared with the star light. However, the optical emission\nwill be absorbed by the dust in this example at the early\ntime. So we expect to observe synchrotron optical emission at the inner part of those elliptical galaxies with little\ndust during a short time in the quasar phase. This result\nis just from one shock at the first sub-burst of the last major burst in Fig. 1. However, we stress that within each\n\n\fY.-F. Jiang et al.\n\n11\n\nΣ / erg s−1 cm−2\n\n5\n\n10\n\n0\n\n10\n\n−5\n\n10\n\n−10\n\n10\n\nLν / erg s−1 Hz−1\n\n30\n\n10\n\n25\n\n10\n\n20\n\n10\n\n4\n\nrh,o/ pc\n\n10\n\n2\n\n10\n\n0\n\n10\n\n0\n\n0.5\n\n1\n\n1.5\n\n∆ t / Myr\n\n2\n\n2.5\n\n3\n\n3.5\n\nFig. 10.- Properties of synchrotron (optical) emission in model B302 . This figure shows the time evolution of the flux Σ (upper panel),\nluminosity Lν (middle panel) and size rh,o (lower panel) at the frequency 7.25 × 1014 Hz. The dashed line in the top panel is Σ⋆ (rh,o /Re ),\ni.e., the stellar flux of a de Vaucouleurs profile with Σe = 22 mag/arcsec2 and Re = 6.9 kpc. In the upper and middle panels, the first two\npoints are connected by dotted lines because the optical emission will be absorbed by dust at that time. Note that synchrotron emission\nlasts for 2.8 Myr and then drops to zero very quickly.\n\nburst several shocks appear from the sub-bursts in the\ngalaxy almost simultaneously, which will give stronger\nemission and a higher probability of observing the synchrotron optical emission. The study of the cumulative\neffect of several co-existing shocks is beyond the reach of\nthe present investigation, and it is postponed to a future\nwork. In particular, it will be important also to consider the more realistic case of multiple shocks created by\nthe so-called \"time-dependent nuclear wind treatment\"\nwhich includes the time for the wind to reach different\nradii (see Paper I , see also §4). Right now, we have just\nchecked that, for a single shock, the time-dependent and\ntime-independent wind (neglecting the time needed for\nthe wind to reach different radii) models do produce very\nsimilar results.\nFig. 6 shows that there is also synchrotron X-ray emission for the duration of ∼ 104 yr to ∼ 105 yr at the\nvery early time of the burst. At the time ∆t = 0.235\nMyr, at the frequency 2.4 × 1017 Hz (equivalent 1 keV),\nthe luminosity is 5.76 × 1042 erg s−1 while at the frequency 1.2 × 1018 Hz (equivalent 5 keV), the luminosity\nis 1.2 × 1038 erg s−1 . The synchrotron X-ray emission\n\nlasts for only 0.32 Myr and drops to zero rapidly after that time. Typically the luminosity of the thermal\nX-ray emission in the band 0.5 − 2.0 keV from isolated\nelliptical galaxies varies from 1039 to 1041 erg s−1 (e.g.,\nMemola et al. 2009). So the synchrotron X-ray emission\nare likely to be observed only in these \"on\" state galaxies, which are only a small fraction of all galaxies. Because the spectrum of bremsstrahlung emission (energy\ndensity per Hz) is almost flat, we should expect the luminosity of bremsstrahlung optical emission to be around\n1035 to 1037 erg s−1 based on the bremsstrahlung X-ray\nemission. This is actually smaller than the synchrotron\noptical emission here.\nAs synchrotron X-ray emission is also observed from\nSNRs, we can scale down the flux of the X-rays calculated here to a typical flux of X-rays from SNRs. If synchrotron emission from SNRs and elliptical galaxies is\nfrom the same mechanism and we keep the ratio of synchrotron optical emission and synchrotron X-ray emission calculated here, we can estimate the flux of synchrotron optical emission from SNRs and see if it can\nbe observed. Because the synchrotron spectrum basi-\n\n\fSynchrotron Emission from Elliptical Galaxies Consequent to AGN Outbursts\n\nΣ / erg s−1 cm−2\n\n12\n10\n\n10\n\n0\n\n10\n\n−10\n\n10\n\nLν erg s−1 Hz−1\n\n30\n\n10\n\n25\n\n10\n\n20\n\n10\n\n4\n\nrh,X/ pc\n\n10\n\n2\n\n10\n\n0\n\n10\n0.2\n\n0.25\n\n0.3\n\n0.35\n\n0.4\n\n0.45\n\n0.5\n\n0.55\n\n0.6\n\n∆ t / Myr\nFig. 11.- Properties of the synchrotron (soft X-ray) emission in model B302 . This figure shows the time evolution of the flux Σ (upper\npanel), luminosity Lν (middle panel) and size rh,x (lower panel) at the frequency 2.41 × 1017 Hz at different times. The half radius in the\nX-ray band is almost the same as the radius of the shock, which means the synchrotron X-ray emission only exists within a narrow region\naround the shock.\n\ncally becomes steeper with time, we can use the ratio at the initial time to estimate the lower bound of\nthe synchrotron optical emission from SNRs. The synchrotron X-ray flux observed from SNR G330.2+1.0 is\nabout 10−11 erg s−1 cm−2 (Park et al. 2009). In our calculation, at the time ∆t = 0.235 Myr (see the solid line\nin Fig. 6), the X-ray flux (at 1 keV) is about 1.85 × 103\nerg s−1 cm−2 while the optical flux is about 2.83×103 erg\ns−1 cm−2 . Then we give a lower bound of synchrotron\noptical emission from SNRs to be 1.53 × 10−11 erg s−1\ncm−2 , corresponding to 44.87 mag/arc2 without absorption. Actually, in SNR G332.5-5.6, line emission with a\nflux as faint as 10−12 erg s−1 cm−2 has been observed\n(Stupar et al. 2007). It seems that the synchrotron optical emission from SNRs should be observable by the\nappropriate technique.\n4. DISCUSSION\n4.1. Observational Consequences of Our Model\nOur model has observational predictions, some of\nwhich are consistent with current radio observations and\nsome of which may be feasible Chandra source detections. First, as shown in Fig. 6, the synchrotron emis-\n\nsion at 5 GHz and 4.3 × 1014 Hz falls in the range\nof observed values in FR II sources, which means that\nour mechanism should not be neglected. Besides, recent observations at 1.4 GHz find some early-type core\ngalaxies hosting radio-loud AGN of extremely low radio\npower (Baldi & Capetti 2009), which can be interpreted\nas radio emission via the mechanism described here as it\nwould be too weak to be produced by typical jets. Second, as shown in Fig. 8, the shocks produced in the simulations easily reach the kpc scale before they die away\ngradually. The synchrotron radio emission can also go to\nthis large scale (though it is very weak). Actually, kpcscale outflows or winds have been observed in high redshift quasars (e.g., de Kool et al. 2001; Nesvadba et al.\n2008; Nesvadba 2009; Cattaneo et al. 2009), which provides strong support for our scenario based on the computed winds in the AGN simulations. In particular, a\nrecent observation (Alexander et al. 2009) finds a galaxy\nwide outflow at redshift ∼ 2, which is believed to be\na wind radiatively driven by the AGN and/or supernovae winds rather than by jets. Note that some observed X-shaped radio galaxies (e.g., Leahy & Williams\n1984; Kraft et al. 2005; Saripalli et al. 2008) provide significant support for the idea that the observed radio\n\n\fY.-F. Jiang et al.\nemission arises from shocks caused by feedback from the\nSMBHs, as the broad line winds drive shocks into the\nambient gas with a similar shape (e.g., Drew & Proga\n2000; Dorodnitsyn et al. 2008).\nThird, the duration of synchrotron emission at a certain frequency will decrease with increasing frequency.\nFor a single shock, synchrotron X-ray emission can only\nexist behind the shock, where the non-thermal electrons\nare just created. The synchrotron optical emission can\nextend to a larger region while the synchrotron radio\nemission can almost extend to the whole region where\nthe shock has passed, which can be seen from Fig. 5.\nSo, in principle, at good enough resolution we should see\nthe synchrotron emission in different bands at different\nspatial positions.\nThough synchrotron emission from our mechanism and\njets is similar to a certain extent, there are some differences that can help distinguish the two mechanisms. In\nthe following, we list four possible observational tests.\nFirst, we expect the magnetic field in the shocked material to be more randomized than the magnetic field in\nthe jets. So, the polarization of the emission from our\nmechanism will be weaker than the polarization of the\nemission from the jets, and polarization observations can\nhelp to disentangle the two mechanisms. Second, as the\nshock (and the synchrotron emission) is produced after\neach AGN outburst, emission from our mechanism will\nonly exist in a certain fraction of elliptical galaxies, proportional to the duty cycle. In practice, in a survey of\nelliptical galaxies, where the emission from jets gives the\nbackground level of core radio emission, the number of\ngalaxies with extra radio emission should be comparable\nto the duty cycle (see Paper I for a discussion of duty\ncycle of the models). Third, as the velocity of the jet is\ntypically much larger than the velocity of the shock, then\nif we can directly measure the velocity of the outflow, it\nwill be easy to tell which process dominates. Finally,\nthe variability time scale of emission from jets is shorter\nthan that of our mechanism. The variability time scale\ncan also help us tell the origin of the core radio emission.\n4.2. Possible Future Improvements of the Model\nThere are still some significant uncertainties in our\nmodel and further improvements are needed. First, the\nhydrodynamical code does not include the magnetic field,\na fundamental ingredient for the accurate computation\nof synchrotron emission. In this paper, we only assumed\na ratio between the magnetic pressure and thermal pressure to estimate the preshock magnetic field in elliptical\ngalaxies. A better method is needed to give the distribution of magnetic field and its evolution with time.\nIn fact, the magnetic field will be amplified near the\nshock due to back reaction of cosmic rays, and we roughly\nestimate that the amplified magnetic pressure should\nnot exceed about 10% of the postshock thermal pressure. A more careful calculation of this effect (e.g., Bell\n2004; Riquelme & Spitkovsky 2009; Ohira et al. 2009;\nZirakashvili & Ptuskin 2008) would be preferable. Second, we use the test-particle theory to calculate the energy spectrum of the non-thermal electrons and neglect\nthe modification of the shock structure due to the cosmic\nrays. However, as is already known in SNRs, non-linear\ntheory is needed to calculate the spectrum of the nonthermal electrons for strong shocks, especially at high\n\n13\n\nenergies (e.g., Berezhko & Ellison 1999; Lazendic et al.\n2004; Lee et al. 2008; Treumann & Jaroschek 2008;\nReynolds 2008). So in order to calculate the synchrotron\nemission more accurately, we will need to include the\ndiffusive shock acceleration mechanism into the hydrodynamical code. This greatly adds to the complexity of the\nmodeling. Third, as anticipated in §2.1, all the results\npresented here are obtained using a 1-D code. Of course,\nthis is quite a strong approximation, which precludes the\nquantitative analysis of several phenomena that almost\ncertainly take place in real galaxies. One of the most important in the present context is the possible cold shell\nfragmentation due to Rayleigh-Taylor instability following central outburst. While we could not exclude this\npossibility, we note that several properties of our 1-D\nmodels (such as the duty-cycle, mass accreted on the\ncentral SMBH, star formation, X-ray luminosity) agree\nwell with the observations, so that we are confident that\nthe basic physics of feedback is actually captured by our\nsimulations. Note also that on the kpc scale, the central outbursts, even if initially anisotropic, will necessarily become rounder and rounder as they propagate, and\ntherefore better and better approximated by our code.\nThe calculations here are based on the so-called \"timeindependent nuclear wind model\" (with mechanical as\nwell radiation feedback). In this simplified approach,\nwhich saves much simulation time, the propagation velocity of the wind along the numerical grid (Paper I, eq.\n29) is set to be infinity. Therefore, the nuclear wind mass,\nmomentum and kinetic energy are instantaneously discharged over the whole computational grid. The more realistic model is the time-dependent nuclear wind model,\nwhich will be more accurate, especially at the inner part\nof the galaxy at early times (§2.3 of Paper I). More accurate calculations of the synchrotron optical and X-ray\nemission also require the time-dependent wind model.\nFinally, effects of multiple shocks on the emission from\nthe inner galaxy and on the reacceleration of preexisting\nnonthermal particles have yet to be included.\nThese caveats aside, the presented results show that\ncentral outbursts of mechanical and radiative energy consequent to AGN flaring should produce shock accelerated\nelectrons capable of producing the non-thermal emission\nactually observed from the cores of some elliptical galaxies subsequent and consequent to AGN outbursts.\n5. CONCLUSIONS\n\nIn this paper, we have explored the observational consequences of a new mechanism for producing the synchrotron emission seen in elliptical galaxies. This idea\nis based on particle acceleration subsequent to bursts of\nenergy from the central black holes. The properties of\nthe ISM are computed from hydrodynamical simulations\nincluding radiative and mechanical feedback consequent\nto an AGN outburst. Due to this feedback, a wind is\nformed during the quasar phases, and a shock is driven\ninto the elliptical galaxy. Given standard physics, the\nshock, during its propagation into the galaxy, will accelerate electrons and protons via the diffusive shock acceleration mechanism. Synchrotron emission arises from\nthese non-thermal electrons. In this paper, we have focused on the computation of the energy spectrum of the\nintegrated synchrotron radiation. We include radiation\nloss and adiabatic loss during the evolution of these non-\n\n\f14\n\nSynchrotron Emission from Elliptical Galaxies Consequent to AGN Outbursts\n\nthermal electrons and we show the change of the synchrotron spectrum with time.\nIn general, we have found that the synchrotron radio\nemission from one shock can last about 4.7 Myr at 5 GHz,\nwhile a shock can exist for 46 Myr. During the evolution\nof the elliptical galaxy, there are several major bursts and\nseveral sub-bursts for each major burst. Roughly speaking, the shock can exist during the whole burst phase of\nthe galaxy while the radio emission (around 5 GHz) exists for 10 percent of the burst phase. Besides, our mechanism also gives marginally detectable synchrotron optical emission during the 3 Myr after a burst. The duration\nof synchrotron optical emission is about 50% of the radio\nemission at ∼ 0.17 GHz while the duration of the synchrotron X-ray emission is approximately 5% of the radio\nsynchrotron emission at ∼ 0.17 GHz. The half radius of\nthe synchrotron X-ray emission is almost the same as the\nradius of the shock, which means that the synchrotron\nX-ray emission only exists as a 'ring' around the shock\nwhile the half radii of the synchrotron radio emission\nand synchrotron optical emission are smaller than the\nshock radius, which indicates the synchrotron radio emission and synchrotron optical emission are more diffuse.\nActually, synchrotron optical emission from the cores of\nelliptical galaxies has been claimed to be observed by\nHubble Space T elescope (HST ) with a typical luminosity ∼ 1025 − 1029 erg s−1 Hz−1 (e.g., Chiaberge et al.\n2000). The detection of synchrotron X-ray emission from\nelliptical galaxy cores is on the edge of currently feasible Chandra observations (e.g., Tananbaum 2001, and\nprivate communication).\nOne point which needs to be emphasized is that the\nmechanism for synchrotron radio emission discussed here\n\nis different from that produced by jets. Current understanding of the AGN phenomena divides the activity\ninto two phases: the 'optical mode', immediately after\nthe central outburst, and 'radio mode' at low Eddington\nratios between major outbursts, when powerful jets are\nemitted. In particular, here we have discussed the particle acceleration during the optical mode, which should\nexist for each quasar event associated with the outburst\nphase. Though the synchrotron radio emission from large\nscale jets may be stronger than the presented mechanism,\nour mechanism is also important for the synchrotron\nemission at the central part of elliptical galaxies and it\ncould also be important for the evolution of the galaxy\nsince the energy is released within the gaseous envelope of\nthe galaxy. Definite observation of non-thermal emission\nfrom AGN hosting galaxy cores would strengthen the\ncase for AGN feedback. Though there may be unresolved\njets in the galaxy cores as pointed out by some observers\n(e.g., Ho 2008 and references therein), our mechanism\ncontributes comparable emission to these small jets, if\nnot larger.\nACKNOWLEDGMENT\n\nY.-F. Jiang thanks Carlos Badeness and John Hughes\nfor helpful discussions on diffusive shock acceleration\nmechanism. We also thank Roberto Fanti, Luis Ho,\nJenny Greene and Aristotle Socrates for useful discussions on cosmic rays and observational results, and Yue\nShen, Min-Su Shin and Lorenzo Sironi for useful discussions. We also thank two anonymous referees for comments that significantly improved the paper. Y.-F. Jiang\nthanks Princeton University for financial support. A.S.\nacknowledges support from NSF grant AST-0807381.\n\nREFERENCES\nAharonian, F. A., et al. 2004, Nature, 432, 75\nAlexander, D. M., Swinbank, A. M., Smail, I., McDermid, R., &\nNesvadba, N. 2009, arXiv:0911.0014\nBaldi, R. D., & Capetti, A. 2009, arXiv:0910.4261\nBell, A. R. 2004, MNRAS, 353, 550\nBest, P. N. 2007, New Astronomy Review, 51, 168\nBerezhko, E. G., & Ellison, D. C. 1999, ApJ, 526, 385\nBerezhko, E. G., & Völk, H. J. 2006, A&A, 451, 981\nBlandford, R. D., & Rees, M. J. 1974, MNRAS, 169, 395\nBlandford, R. D., & Ostriker, J. P. 1978, ApJ, 221, L29\nBlandford, R., & Eichler, D. 1987, Phys. Rep., 154, 1\nBlumenthal, G. R., & Gould, R. J. 1970, Reviews of Modern\nPhysics, 42, 237\nBridle, A. H., & Perley, R. A. 1984, ARA&A, 22, 319\nBurkert, A., & Silk, J. 2001, ApJ, 554, L151\nCaprioli, D., Blasi, P., & Amato, E. 2009, MNRAS, 396, 2065\nCassam-Chenaı̈, G., Hughes, J. P., Ballet, J., & Decourchelle, A.\n2007, ApJ, 665, 315\nCattaneo, A., et al. 2009, Nature, 460, 213\nChartas, G., et al. 2009, New Astronomy Review, 53, 128\nChiaberge, M., Capetti, A., & Celotti, A. 2000, A&A, 355, 873\nChurazov, E., Forman, W., Vikhlinin, A., Tremaine, S., Gerhard,\nO., & Jones, C. 2008, MNRAS, 388, 1062\nCiotti, L., & Ostriker, J. P. 1997, ApJ, 487, L105\nCiotti, L., & Ostriker, J. P. 2001, ApJ, 551, 131\nCiotti, L., & Ostriker, J. P. 2007, ApJ, 665, 1038\nCiotti, L., Ostriker, J. P., & Proga, D. 2009, ApJ, 699, 89 (Paper\nI)\nCiotti, L., Ostriker, J. P., & Proga, D. 2009, to be submitted\n(Paper III)\nCiotti, L., Morganti, L., & de Zeeuw, P. T. 2009b, MNRAS, 393,\n491\n\nde Kool, M., Arav, N., Becker, R. H., Gregg, M. D., White, R. L.,\nLaurent-Muehleisen, S. A., Price, T., & Korista, K. T. 2001,\nApJ, 548, 609\nDickel, J. R., Sault, R., Arendt, R. G., Korista, K. T., & Matsui,\nY. 1988, ApJ, 330, 254\nDi Matteo, T., Springel, V., & Hernquist, L. 2005, Nature, 433,\n604\nDorodnitsyn, A., Kallman, T., & Proga, D. 2008, ApJ, 675, L5\nDrew, J. E., & Proga, D. 2000, New Astronomy Review, 44, 21\nEllison, D. C., Berezhko, E. G., & Baring, M. G. 2000, ApJ, 540,\n292\nEllison, D. C., Decourchelle, A., & Ballet, J. 2004, A&A, 413, 189\nEllison, D. C., Patnaude, D. J., Slane, P., Blasi, P., & Gabici, S.\n2007, ApJ, 661, 879\nEnsslin, T. A., Pfrommer, C., Springel, V., & Jubelgas, M. 2007,\nA&A, 473, 41\nFabian, A. C. 1999, MNRAS, 308, L39\nFerrarese, L., & Merritt, D. 2000, ApJ, 539, L9\nField, G. B. 1965, ApJ, 142, 531\nGebhardt, K., et al. 2000, ApJ, 539, L13\nGilbert, G. M., Riley, J. M., Hardcastle, M. J., Croston, J. H.,\nPooley, G. G., & Alexander, P. 2004, MNRAS, 351, 845\nGraham, A. W., & Driver, S. P. 2007, ApJ, 655, 77\nGranato, G. L., De Zotti, G., Silva, L., Bressan, A., & Danese, L.\n2004, ApJ, 600, 580\nHamann, F., Kaplan, K. F., Hidalgo, P. R., Prochaska, J. X., &\nHerbert-Fort, S. 2008, MNRAS, 391, L39\nHo, L. C. 2008, ARA&A, 46, 475\nHooper, E. J., Impey, C. D., Foltz, C. B., & Hewett, P. C. 1995,\nApJ, 445, 62\nHopkins, P. F., Hernquist, L., Cox, T. J., Di Matteo, T.,\nRobertson, B., & Springel, V. 2006, ApJS, 163, 1\nHu, J., Shen, Y., Lou, Y.-Q., & Zhang, S. 2006, MNRAS, 365, 345\nJohansson, P. H., Naab, T., & Burkert, A. 2009, ApJ, 690, 802\n\n\fY.-F. Jiang et al.\nKeshet, U., Waxman, E., Loeb, A., Springel, V., & Hernquist, L.\n2003, ApJ, 585, 128\nKellermann, K. I., Sramek, R. A., Schmidt, M., Green, R. F., &\nShaffer, D. B. 1994, AJ, 108, 1163\nKembhaavi, A. K. & Narlikar, J. V. 1999, Cambridge University\nPress, Cambridge\nKing, A. 2003, ApJ, 596, L27\nKormendy, J., & Richstone, D. 1995, ARA&A, 33, 581\nKoyama, K., Petre, R., Gotthelf, E. V., Hwang, U., Matsuura,\nM., Ozaki, M., & Holt, S. S. 1995, Nature, 378, 255\nKraft, R. P., Hardcastle, M. J., Worrall, D. M., & Murray, S. S.\n2005, ApJ, 622, 149\nKrolik, J. H. 1999, Active Galactic Nuclei: From the Central\nBalck Hole to the Galactic Environment. Princeton Univ.\nPress, Princeton\nLauer, T. R., et al. 2007, ApJ, 662, 808\nLazendic, J. S., Slane, P. O., Gaensler, B. M., Reynolds, S. P.,\nPlucinsky, P. P., & Hughes, J. P. 2004, ApJ, 602, 271\nLeahy, J. P., & Williams, A. G. 1984, MNRAS, 210, 929\nLee, S.-H., Kamae, T., & Ellison, D. C. 2008, ApJ, 686, 325\nLongair, M. S. 1994, High Energy Astrophysics (Volume 2).\nCambridge University Press, Cambridge\nLou, Y.-Q., & Jiang, Y.-F. 2008, MNRAS, 391, L44\nMagorrian, J., et al. 1998, AJ, 115, 2285\nMartel, A. R., et al. 1999, ApJS, 122, 81\nMemola, E., Trinchieri, G., Wolter, A., Focardi, P., & Kelm, B.\n2009, A&A, 497, 359\nMcLure, R. J., & Dunlop, J. S. 2002, MNRAS, 331, 795\nMilosavljević, M., Couch, S. M., & Bromm, V. 2009, ApJ, 696,\nL146\nMirabel, I. F., & Rodrı́guez, L. F. 1999, ARA&A, 37, 409\nMoe, M., Arav, N., Bautista, M. A., & Korista, K. T. 2009, ApJ,\n706, 525\nMullin, L. M., Hardcastle, M. J., & Riley, J. M. 2006, MNRAS,\n372, 113\nNaab, T., Jesseit, R., & Burkert, A. 2006, MNRAS, 372, 839\nNesvadba, N. P. H. 2009, arXiv:0906.2900\n\n15\n\nNesvadba, N. P. H., Lehnert, M. D., De Breuck, C., Gilbert,\nA. M., & van Breugel, W. 2008, A&A, 491, 407\nOhira, Y., Reville, B., Kirk, J. G., & Takahara, F. 2009, ApJ,\n698, 445\nOstriker, J. P., Weaver, R., Yahil, A., & McCray, R. 1976, ApJ,\n208, L61\nPark, S., Kargaltsev, O., Pavlov, G. G., Mori, K., Slane, P. O.,\nHughes, J. P., Burrows, D. N., & Garmire, G. P. 2009, ApJ,\n695, 431\nPeterson, J. R., & Fabian, A. C. 2006, Phys. Rep., 427, 1\nPfrommer, C., Ensslin, T. A., & Springel, V. 2008, MNRAS, 385,\n1211\nRees, M. J. 1971, Nature, 229, 312\nReynolds, S. P. 1998, ApJ, 493, 375\nReynolds, S. P. 2008, ARA&A, 46, 89\nRiquelme, M. A., & Spitkovsky, A. 2009, ApJ, 694, 626\nSaripalli, L., Subrahmanyan, R., Laskar, T. & Koekemoer, A.\n2008, arXiv: 0806.3518\nSazonov, S. Y., Ostriker, J. P., Ciotti, L., & Sunyaev, R. A. 2005,\nMNRAS, 358, 168\nSijacki, D., Springel, V., di Matteo, T., & Hernquist, L. 2007,\nMNRAS, 380, 877\nSilk, J., & Rees, M. J. 1998, A&A, 331, L1\nSironi, L., & Socrates, A. 2009, arXiv:0902.1181\nSpringel, V., Di Matteo, T., & Hernquist, L. 2005, MNRAS, 361,\n776\nStupar, M., Parker, Q. A., Filipović, M. D., Frew, D. J., Bojičić,\nI., & Aschenbach, B. 2007, MNRAS, 381, 377\nTananbaum, H. 2001, X-ray Astronomy 2000, 234, 3\nTremaine, S., et al. 2002, ApJ, 574, 740\nTreumann, R. A., & Jaroschek, C. H. 2008, arXiv:0806.4046\nWang, J.-M. 2008, ApJ, 682, L81\nWebb, G. M., Drury, L. O., & Biermann, P. 1984, A&A, 137, 185\nZirakashvili, V. N., & Ptuskin, V. S. 2008, ApJ, 678, 939\nZirbel, E. L., & Baum, S. A. 1995, ApJ, 448, 521\n\n\f"}