{"id": "http://arxiv.org/abs/1203.6662v2", "guidislink": true, "updated": "2012-05-30T06:48:07Z", "updated_parsed": [2012, 5, 30, 6, 48, 7, 2, 151, 0], "published": "2012-03-29T20:21:54Z", "published_parsed": [2012, 3, 29, 20, 21, 54, 3, 89, 0], "title": "Conifold Transitions in M-theory on Calabi-Yau Fourfolds with Background\n  Fluxes", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1203.3036%2C1203.1103%2C1203.5376%2C1203.6455%2C1203.1609%2C1203.1443%2C1203.6757%2C1203.6833%2C1203.2385%2C1203.6277%2C1203.2064%2C1203.5566%2C1203.0642%2C1203.1076%2C1203.2221%2C1203.3242%2C1203.0214%2C1203.4777%2C1203.3392%2C1203.0602%2C1203.2750%2C1203.6180%2C1203.0171%2C1203.2957%2C1203.5926%2C1203.1904%2C1203.5418%2C1203.3220%2C1203.5098%2C1203.4996%2C1203.3219%2C1203.1596%2C1203.2051%2C1203.0519%2C1203.4907%2C1203.5650%2C1203.5655%2C1203.1140%2C1203.1186%2C1203.3660%2C1203.3418%2C1203.4393%2C1203.4222%2C1203.5696%2C1203.0146%2C1203.2331%2C1203.4417%2C1203.1603%2C1203.6410%2C1203.0256%2C1203.3574%2C1203.3925%2C1203.1787%2C1203.2987%2C1203.0384%2C1203.0166%2C1203.4953%2C1203.0658%2C1203.5811%2C1203.5552%2C1203.3797%2C1203.6848%2C1203.4669%2C1203.1790%2C1203.2903%2C1203.3844%2C1203.6099%2C1203.5064%2C1203.4739%2C1203.6167%2C1203.5076%2C1203.1482%2C1203.3718%2C1203.4450%2C1203.0872%2C1203.6114%2C1203.0389%2C1203.5594%2C1203.4871%2C1203.2050%2C1203.3793%2C1203.2654%2C1203.0269%2C1203.1069%2C1203.2609%2C1203.1224%2C1203.6809%2C1203.1711%2C1203.4881%2C1203.3540%2C1203.2261%2C1203.6469%2C1203.6494%2C1203.0482%2C1203.5507%2C1203.0762%2C1203.4599%2C1203.6662%2C1203.3566%2C1203.2416%2C1203.6483&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Conifold Transitions in M-theory on Calabi-Yau Fourfolds with Background\n  Fluxes"}, "summary": "We consider topology changing transitions for M-theory compactifications on\nCalabi-Yau fourfolds with background G-flux. The local geometry of the\ntransition is generically a genus g curve of conifold singularities, which\nengineers a 3d gauge theory with four supercharges, near the intersection of\nCoulomb and Higgs branches. We identify a set of canonical, minimal flux quanta\nwhich solve the local quantization condition on G for a given geometry,\nincluding new solutions in which the flux is neither of horizontal nor vertical\ntype. A local analysis of the flux superpotential shows that the potential has\nflat directions for a subset of these fluxes and the topologically different\nphases can be dynamically connected. For special geometries and background\nconfigurations, the local transitions extend to extremal transitions between\nglobal fourfold compactifications with flux. By a circle decompactification the\nM-theory analysis identifies consistent flux configurations in four-dimensional\nF-theory compactifications and flat directions in the deformation space of\nbranes with bundles.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1203.3036%2C1203.1103%2C1203.5376%2C1203.6455%2C1203.1609%2C1203.1443%2C1203.6757%2C1203.6833%2C1203.2385%2C1203.6277%2C1203.2064%2C1203.5566%2C1203.0642%2C1203.1076%2C1203.2221%2C1203.3242%2C1203.0214%2C1203.4777%2C1203.3392%2C1203.0602%2C1203.2750%2C1203.6180%2C1203.0171%2C1203.2957%2C1203.5926%2C1203.1904%2C1203.5418%2C1203.3220%2C1203.5098%2C1203.4996%2C1203.3219%2C1203.1596%2C1203.2051%2C1203.0519%2C1203.4907%2C1203.5650%2C1203.5655%2C1203.1140%2C1203.1186%2C1203.3660%2C1203.3418%2C1203.4393%2C1203.4222%2C1203.5696%2C1203.0146%2C1203.2331%2C1203.4417%2C1203.1603%2C1203.6410%2C1203.0256%2C1203.3574%2C1203.3925%2C1203.1787%2C1203.2987%2C1203.0384%2C1203.0166%2C1203.4953%2C1203.0658%2C1203.5811%2C1203.5552%2C1203.3797%2C1203.6848%2C1203.4669%2C1203.1790%2C1203.2903%2C1203.3844%2C1203.6099%2C1203.5064%2C1203.4739%2C1203.6167%2C1203.5076%2C1203.1482%2C1203.3718%2C1203.4450%2C1203.0872%2C1203.6114%2C1203.0389%2C1203.5594%2C1203.4871%2C1203.2050%2C1203.3793%2C1203.2654%2C1203.0269%2C1203.1069%2C1203.2609%2C1203.1224%2C1203.6809%2C1203.1711%2C1203.4881%2C1203.3540%2C1203.2261%2C1203.6469%2C1203.6494%2C1203.0482%2C1203.5507%2C1203.0762%2C1203.4599%2C1203.6662%2C1203.3566%2C1203.2416%2C1203.6483&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We consider topology changing transitions for M-theory compactifications on\nCalabi-Yau fourfolds with background G-flux. The local geometry of the\ntransition is generically a genus g curve of conifold singularities, which\nengineers a 3d gauge theory with four supercharges, near the intersection of\nCoulomb and Higgs branches. We identify a set of canonical, minimal flux quanta\nwhich solve the local quantization condition on G for a given geometry,\nincluding new solutions in which the flux is neither of horizontal nor vertical\ntype. A local analysis of the flux superpotential shows that the potential has\nflat directions for a subset of these fluxes and the topologically different\nphases can be dynamically connected. For special geometries and background\nconfigurations, the local transitions extend to extremal transitions between\nglobal fourfold compactifications with flux. By a circle decompactification the\nM-theory analysis identifies consistent flux configurations in four-dimensional\nF-theory compactifications and flat directions in the deformation space of\nbranes with bundles."}, "authors": ["Kenneth Intriligator", "Hans Jockers", "Peter Mayr", "David R. Morrison", "M. Ronen Plesser"], "author_detail": {"name": "M. Ronen Plesser"}, "author": "M. Ronen Plesser", "links": [{"title": "doi", "href": "http://dx.doi.org/10.4310/ATMP.2013.v17.n3.a2", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1203.6662v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1203.6662v2", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "93 pages; v2: minor changes and references added", "arxiv_primary_category": {"term": "hep-th", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "hep-th", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1203.6662v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1203.6662v2", "journal_reference": "Adv.Theor.Math.Phys. 17 (2013) 601-699", "doi": "10.4310/ATMP.2013.v17.n3.a2", "fulltext": "BONN-TH-2012-06\nLMU-ASC 20/12\nUCSB Math 2012-15\n\narXiv:1203.6662v2 [hep-th] 30 May 2012\n\nUCSD-PTH-11-16\n\nConifold Transitions in M-theory on Calabi–Yau Fourfolds\nwith Background Fluxes\n\nKenneth Intriligator1 , Hans Jockers2 , Peter Mayr3 , David R. Morrison4 , M. Ronen Plesser5\n\n2\n\n3\n\n1\n\nDepartment of Physics, University of California, San Diego, La Jolla, CA 92093, USA\n\nBethe Center for Theoretical Physics, Physikalisches Institut Universität Bonn, 53115 Bonn, Germany\n\nArnold Sommerfeld Center for Theoretical Physics, Ludwig-Maximilians-Universität, 80333 Munich, Germany\n5\n\n4\n\nDepartments of Mathematics and Physics, University of California, Santa Barbara, CA 93106, USA\n\nCenter for Geometry and Theoretical Physics, Box 90318, Duke University, Durham, NC 27708, USA\n\nAbstract\nWe consider topology changing transitions for M-theory compactifications on Calabi–\nYau fourfolds with background G-flux. The local geometry of the transition is generically\na genus g curve of conifold singularities, which engineers a 3d gauge theory with four\nsupercharges, near the intersection of Coulomb and Higgs branches. We identify a set of\ncanonical, minimal flux quanta which solve the local quantization condition on G for a given\ngeometry, including new solutions in which the flux is neither of horizontal nor vertical\ntype. A local analysis of the flux superpotential shows that the potential has flat directions\nfor a subset of these fluxes and the topologically different phases can be dynamically\nconnected. For special geometries and background configurations, the local transitions\nextend to extremal transitions between global fourfold compactifications with flux. By a\ncircle decompactification the M-theory analysis identifies consistent flux configurations in\nfour-dimensional F-theory compactifications and flat directions in the deformation space\nof branes with bundles.\nMarch 2012\n\n\fTable of Contents\n1. Introduction\n. . . . . . . . . . . . . . . . . . . . . . . . . . . . .\n2. Preliminaries: M-theory on Calabi–Yau fourfolds . . . . . . . . . . .\n3. Conifold transitions in local Calabi–Yau fourfolds . . . . . . . . . . .\nf♯\n3.1. Small resolution phases X\n. . . . . . . . . . . . . . . . . . . . . .\nf\n♭\n3.2. Deformed phase X . . . . . . . . . . . . . . . . . . . . . . . . . .\n3.3. Classification of G-flux on the local geometries . . . . . . . . . . . . . .\n3.4. Non-dynamical flux constraints for the phase transitions\n. . . . . . . . .\n3.5. M-theory three-form C-field and Cheeger-Simons cohomology . . . . . . .\n3.6. Flat directions of the superpotential and Abel-Jacobi map . . . . . . . . .\n3.7. Local transitions for special configurations . . . . . . . . . . . . . . . .\n4. Conifold transition in global Calabi–Yau fourfolds . . . . . . . . . . .\n4.1. A simple example: Extremal transition for the sextic . . . . . . . . . . .\n4.2. M-theory transitions via topological surgery . . . . . . . . . . . . . . .\n4.3. M-theory transitions via the Clemens–Schmid exact sequence\n. . . . . . .\n4.4. G-flux quantization condition . . . . . . . . . . . . . . . . . . . . .\n4.5. Non-Abelian gauge groups and relation to F-theory . . . . . . . . . . . .\n5. M-theory phases in the effective N = 2 three-dimensional field theory .\n5.1. N = 2 three-dimensional field theory . . . . . . . . . . . . . . . . . .\n5.2. Effective N = 2 field theory for M-theory on smooth fourfolds with flux . . .\n5.3. Singularities, charged matter, and the 5d → 3d reduction . . . . . . . . .\n5.4. The dynamics of 3d U (1) gauge theories for general matter fields of charge ±1\n5.5. Comparing M-theory conifold transitions with 3d field theory phase structure\n6. Conclusions . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .\nAppendix A. Calabi–Yau fourfolds and collection of (co)homology data\n.\nAppendix B. Conifold flop transitions in local Calabi–Yau fourfolds . . .\nAppendix C. The quarternionic Hopf fibration and the Milnor fibration .\nAppendix D. The Clemens-Schmid exact sequence . . . . . . . . . . . .\nD.1. Triple-point-free Clemens-Schmid exact sequences . . . . . . . . . . . .\nD.2. Conifold transition in Calabi–Yau threefolds\n. . . . . . . . . . . . . .\nD.3. Conifold transition along a genus g curve in global Calabi–Yau fourfolds . .\n\n1\n\n2\n5\n8\n8\n11\n13\n17\n20\n22\n28\n36\n37\n42\n44\n45\n47\n53\n54\n56\n57\n60\n62\n66\n69\n74\n76\n79\n79\n82\n84\n\n\f1. Introduction\nAs seen in many examples over the years, there is an intriguing interplay between the\ngeometry of string theory compactifications (in the presence of branes, or near singularities) and the dynamics of supersymmetric quantum field theories in various dimensions.\nThe geometry of Calabi–Yau manifolds and their moduli spaces can determine the nonperturbative vacuum manifold and the spectrum of BPS particles of a field theory. Extremal\ntransitions in the geometry can map to transitions between different branches of low-energy\nsupersymmetric gauge theories. Examples with 8 supercharges include transition between\nHiggs and Coulomb branches of abelian [1,2,3] and non-abelian [4,5,6] four-dimensional\nN = 2 gauge theories, three-dimensional N = 4 theories [7] and five-dimensional N = 1\ntheories [8,9,11]. For theories with four supercharges, i.e., N = 1 in four or N = 2 in\nthree dimensions, an essential new ingredient is needed to match between deformations of\na Calabi–Yau geometry and field theory dynamics: a choice of background fluxes or background branes in needed on top of the geometry, which induces an N = 1 superpotential\nin the field theory. An example is the fluxed conifold transition in a Calabi–Yau threefold,\nleading to confining glueball superpotentials in the associated non-abelian gauge theories\n[12,13].\nIn this paper, we study extremal transitions in M- and F-theory compactifications\non Calabi–Yau fourfolds, whose low energy theories are described by a certain class of\nsupersymmetric theories with four supercharges. The three-dimensional N = 2 theories\nhave again Coulomb and Higgs branches meeting at singular points of the moduli space, as\ndiscussed e.g. in ref. [14]. This turns out to have a nice parallel description in the fourfold\ngeometry, where a set of four-cycles shrinks and another set of four-cycles grows, e.g.:\nflop transition: S1♯ → S2♯\n\n≃\n\nCoulomb1 → Coulomb2\n\nconifold transition: S ♯ → S ♭\n\n≃\n\nCoulomb → Higgs\n\n(1.1)\n\nHere S ♯ denotes an algebraic four-cycle, whereas S ♭ has a generically non-zero volume with\nrespect to the holomorphic (4, 0)-form Ω. The spectrum of additional light BPS particles\nnear the transition locus arises on the S ♯ side from M2 branes wrapping small 2-cycles\nin the local geometry. It can eventually be computed in the topologically twisted theory\nassociated with M-theory compactification on the local geometry by counting the number\nof holomorphic sections of certain line bundles, similarly as in ref. [4].\n2\n\n\fAs mentioned above, a key element for four supercharges is the dependence of the\nspectrum and the superpotential obstruction on background flux. In an M-theory compactification on the fourfold one has to specify on top of the fourfold geometry X the\nbackground four-form flux G, which induces the geometric GVW superpotential [15]. Interestingly enough, a quantization condition for G enforces a non-zero flux on a four-cycle\nS ∈ H4 (X, Z) – and a non-zero superpotential – if the second Chern class c2 (X) evaluated\non a S is not even [16]. The local aspects of this quantization condition have not been\nstudied systematically so far. We identify a set of canonical, minimal flux quanta which\nsolve the quantization condition for a given four-cycle geometry.\nAs a consequence of the flux superpotential one expects that topology changing transitions between Calabi–Yau fourfolds will generally be obstructed, except when a judicious\nchoice of flux quanta has been made that solves the quantization condition. If a four-cycle\nS with minimal flux is affected by a transition with a 3d field theory interpretation, these\nflux quanta should correspond to choices in the field theory and the superpotential obstruction should be matched by the 3d spectrum and vacuum structure. Both expectations turn\nout to be true via a beautiful correspondence between sections of certain line bundles in\nthe geometry and meson operators in the field theory.\nIf X is elliptically fibered and a four-dimensional F-theory limit exists, the G-flux\nis replaced by, amongst others, gauge flux on 7-branes wrapping algebraic four-cycles D\nin X. In this case one can resort to the detailed results on the field theory spectra and\npotentials obtained from a local computation in refs. [17,18,19]. As expected, after a circle\ncompactification these results match with those obtained from M2 branes in M-theory as\ndiscussed in this note. The perhaps new point on F-theory obtained here from the Mtheory analysis are local solutions to the flux quantization condition and the interplay of\nspectra, flux quanta and superpotential obstructions near the transition point. These are\nneeded to determine the dynamics on Higgs-branches and recombination of 7-branes in a\nlocal model. Our solutions have a number of parallels to some recent discussions in the\nliterature of flux quanta in F-theory [20,21,22].\nThe low-energy gauge theory gauge fields that we consider all arise from the eleven\ndimensional M-theory 3-form C field on two-cycles, with electrically charged matter from\nM2 branes wrapped on two-cycles. Many early works have already explored aspects of\nconnecting M-theory on fourfolds with three-dimensional N = 2 gauge theory dynamics\nwith M-theory on fourfolds. To cite one example, ref. [23] explored connecting the threedimensional N = 2 gauge theory non-perturbative results, including instanton-generated\n3\n\n\fsuperpotentials [24] and the higher Nf SQED and SQCD results of [14], with M-theory\nrealizations from euclidean M5 branes wrapping six-cycles. Other early works explored aspects of the connection between M-theory background G-flux (which spontaneously breaks\nparity) and three-dimensional Chern-Simons terms, as well as type II or M-theory realizations of 3d mirror symmetry [25], and gauge theory moduli space or phase transitions via\ngeometric transitions, see, e.g., refs. [15,26,27].\nIn this paper we mostly focus on singularities which, when approached through the\nmoduli space of Kähler structures, arise in codimension one. The light M2-brane states\narise from two-cycles in one homology class and their charge singles out a U (1) gauge\ngroup. To decouple the dynamics of these degrees of freedom we work in the limit in which\nall other cycles are large, including the curve C to which S ♯ shrinks at the transition.\nMuch of the literature on string or M-theory realizations of three-dimensional gauge\ntheories uses spacetime filling D2 or M2 branes at special points in the geometry. That is\nnot our focus here. Including M spacetime filling M2 branes introduces additional fields\nand dynamics in the low-energy three dimensional quantum field theory. In particular,\nthere are moduli fields for varying the points where the M2 branes are located in the\nfourfold. We here focus on small M and, when M is non-zero, on the regions of the moduli\nspace where the M2 branes are not near the fourfold singularity, and hence they do not\nparticipate in or affect the conifold transitions. In terms of the three dimensional field\ntheory, the degrees of freedom coming from the M2 branes are, in this region of moduli\nspace, decoupled from those that we study, associated with the geometric singularity.\nInteresting new degrees of freedom will become light when the M2 branes are near the\nsingularity, and can potentially participate in the conifold transitions; we will not discuss\nthat here in detail, leaving it for future work. We will also not discuss here the interesting\nlarge M limit, where the backreaction of the M2 branes on the geometry leads to M-theory\non AdS4 × H7 . We will see here that, even without including M2 branes in the conifold\ntransition dynamics, there is already a lot of rich structure.\nThe organization of this paper is as follows: In Section 2 we set the stage for the subsequent analysis and collect various aspects of G-flux of M-theory on Calabi–Yau fourfold\ngeometries. In Section 3 we set up local Calabi–Yau fourfold geometries so as to model\nthe extremal fourfold transitions of interest. We analyze consistency conditions for Gfluxes imposed by the quantization and tadpole cancellation conditions. We examine the\nstructure and the flat directions of the flux-induced potentials. In Section 4 we embed the\n4\n\n\flocal fourfold geometries into global Calabi–Yau fourfolds, for which we again examine the\nbehavior of (consistently quantized) G-fluxes together with their flux-induced scalar potentials, as we go through extremal M-theory transitions. We discuss our findings both for\ngeneric Calabi–Yau fourfolds with a genus g curve of conifold singularities and for explicit\nCalabi–Yau fourfold examples. In particular we find particular flux configurations with\nflat directions through the extremal transition. Finally, we comment on the relationship of\nour M-theory configurations to similar F-theory compactifications. In Section 5 we discuss\nthe associated three-dimensional low energy theory, which reproduces the M-theory phase\nstructure obtained by geometric means in the previous sections.\n\n2. Preliminaries: M-theory on Calabi–Yau fourfolds\n\nIn a compactification of M-theory on a Calabi–Yau fourfold X to three dimensions,\none has to specify the background flux for the four-form G. We first collect a few basic facts\non G and the superpotential induced by it. Most importantly, G is not exactly integral,\nbut satisfies the shifted quantization condition [16]\nGZ =\n\nc2 (X)\nG\n−\n∈ H 4 (X, Z) .\n2π\n2\n\n(2.1)\n\nThis condition ensures locally that the integral of GZ over an arbitrary cycle S ∈ H4 (X, Z)\nis an integer. Globally, the shift by c2 (X)/2 is related to the integrality of the M2 brane\ntadpole\nχ(X) 1\n−\nM=\n24\n2\nOnly if c2 (X)/2 is an integral class,\n\nχ(X)\n24\n\nZ\n\nX\n\nG\nG\n∧\n.\n2π 2π\n\n(2.2)\n\nis an integer and G can be consistently set to\n\nzero by including M space-filling (anti-)M2 branes [16,28].1\n1\n\nTo avoid supersymmetry breaking by anti-M2 branes, one needs positive M2 brane charge\n\nM = −60 −\n\n1\n2\n\nR\n\nGZ (GZ + c2 (X)) ≥ 0 . Self-dual flux components G with\nX\n\nR\n\nG ∧ G > 0 reduce\n\nthe number of M2 branes M . If M gets negative, or if there are anti-self-dual flux components,\nsupersymmetry is generically broken.\n\n5\n\n\fThe conditions for unbroken supersymmetry have been derived in ref. [29] and phrased\nin terms of a superpotential2 in ref. [15]\nW=\n\nZ\n\nG\n1\nf (J) .\n∧ (Ω + J 2 ) = W (Ω) + W\n2π\n2\n\n(2.3)\n\nf (J) are the parts of the integral depending on the holomorphic (4,0)Here W (Ω) and W\nform Ω and the Kähler form J, respectively. Minimization with respect to the complex\n\nstructure deformations and Kähler deformations requires G to be of Hodge type (2,2) and\nprimitive, i.e., J ∧ G = 0, which in turn implies that G is self-dual, ∗G = G [15].\n\nThe superpotential W (Ω) vanishes if G is dual to an algebraic cycle and the twisted\nf (J) vanishes if G is Poinaré dual to a special Lagrangian cycle. There is\nsuperpotential W\n\na decomposition of H4 (X, Z) into 'vertical' and 'horizontal' sublattices with the property\nf (J) always vanishes\nthat W (Ω) always vanishes if G is in the vertical sublattice and W\nif G is in the horizontal sublattice. (See Appendix A for a thorough discussion of these\nsublattices.) It is therefore tempting to decompose G into these pieces\nGV\nGH\nG\n=\n+\n,\n2π\n2π\n2π\n\n(2.4)\n\nand treat the pieces separately. Unfortunately, this decomposition does not work within the\nlattice H 4 (X, Z) – rational coefficients must be introduced (except perhaps in exceptional\ncases).3 The generic solution to the quantization condition (2.2) will therefore arise from\na mixed G flux, where the decomposition (2.4) of GZ is not defined over the integers.\nAs will be studied in some detail below, G fluxes of mixed type also give a new\nimportant class of supersymmetric vacua. The standard solution to (2.1) is to shift G by\n2\n\nAs we will review and discuss in Section 5, W (Ω) is a true superpotential, for Higgs branch\n\nfields in Ω, whereas f\nW (J ) is not a superpotential but rather gives Chern-Simons terms and masses\n\nfor Coulomb branch moduli in J . Given the different nature of W (Ω) and W (J ), adding then\ntogether in W is perhaps curious; W, though, can contribute to the central charge of 1/4-BPS\nobjects. Moreover, as in [15], it is tempting to introduce an additional massive field, Φ, with\nW(Ω, J, Φ) having various hΦi minima that give W(Ω, J ) for the various allowed G fluxes.\n3\n\nIt has been suggested in ref. [30] that any missing cycle classes might be provided by Cayley\n\nsubmanifolds calibrated by the form Ω0 + 21 J 2 (see (2.3)), where Ω0 a fixed representative for the\nclass of Ω. Note that if calibrated cycles do not provide a basis for H4 (X, Q), the superpotential (2.3) is only valid on the sublocus of deformation space, where G is dual to a sum of calibrated\ncycles with rational coefficients, including the special case of a split flux G = GV + GH .\n\n6\n\n\fa class ω dual to an algebraic cycle, with ω − c2 (X)/2 ∈ H 4 (X, Z). This flux of a split\nf (J) for the Kähler moduli and the condition\ntype generates a twisted superpotential W\nf (J) = 0 = dW\nf (J) would exclude supersymmetric vacua for h1,1 (X) = 1 and greatly\nW\nreduce the number of vacua in general. On the other hand, a mixed flux allows to cancel\n\nthe c2 (X)/2 anomaly locally on each cycle in H4 (X, Z), as required, while at the same time\n\nthe twisted superpotential can be identically zero and there is no restriction on the Kähler\nmoduli at all.\nIn the following we will study topology changing transitions between two Calabi–Yau\nfourfolds X ♯ and X ♭ , where a number of algebraic four-cycles Si♯ shrink on the X ♯ side,\nand a number of new, generically non-algebraic cycles Sk♭ appear on the X ♭ side.4 As\nindicated in Appendix A, all of the Hodge numbers of X ♯ and X ♭ are determined by three\nspecific ones (which also determine the Euler characteristic χ, the signature σ, and the\ndecomposition of h2,2 into self-dual and anti-self-dual parts). The changes are:\nδχ\nδσ\n=\n= δh1,1 −δh1,2 +δh1,3 ,\n6\n2\n\n1,1\nδh2,2\n,\n− = δh\n\n1,1\nδh2,2\n−2δh1,2 +4δh1,3 . (2.5)\n+ = 3δh\n\nIf δχ is not a multiple of 24, integrality of the M2 brane charges M (X ♭ ) and M (X ♯ )\nrequires a jump of flux quanta during the transition. (In fact, if we keep locations of the\nspace-filling M2-branes far away from the transition, any change in χ will require a jump\nof flux quanta.) A priori it is not obvious whether this prohibits the transition or whether\nthere is a physical effect that causes this jump. As argued below, transitions are possible\nif there are appropriate new massless states at the transition point that induce a jump of\nflux by a one-loop effect.\nSince the quantization condition (2.2) implies a local constraint on each four-cycle, the\nnon-zero jump of flux must appear on four-cycles that take part in the transition. A simple\nintersection argument shows that if T ♯ is any four-cycle which transversally intersects a\nvanishing four-cycle S ♯ , the value of c2 jumps as\nZ\nZ\nZ\n(T ♯ .S ♯ )\n♭\n♯\nc2 (X ) + δc2 ,\nδc2 = ♯ ♯\nc2 (X ) =\nc2 (X ♯ ) .\n(S .S ) S ♯\nT♭\nT♯\n\n(2.6)\n\nHere T ♭ is a cycle which replaces the T ♯ after the local surgery that describes transition\nfrom X ♯ to X ♭ ; detailed examples in local and global geometries will be considered in\nSections 3 and 4.4. If δc2 is odd, quantization will require a non-zero flux on either T ♯ or\non T ♭ .\n4\n\nVarious aspects of transitions of this type have been previously studied in refs. [28,31,21,22].\n\n7\n\n\f3. Conifold transitions in local Calabi–Yau fourfolds\nAfter these preliminaries, we turn to a detailed study of the local model for the\ngeneric transition, which describes a higher-dimensional analogue of the familiar extremal\ntransitions at isolated conifold points in Calabi–Yau threefolds [1,2]. The double point of\na threefold is given by the equation\nx1 x2 − x3 x4 = 0 ,\n\n(3.1)\n\nin terms of the complex coordinates xl of C4 . The fourfold analog of a conifold point\narises from fibering this conifold singularity over a genus g curve C. To accomplish that,\nthe coordinates xl are taken to be sections of line bundles Ll over the curve C, and the\ne sing is given by the hypersurface (3.1) in the fivesingular local Calabi–Yau fourfold X\n\ndimensional complex variety L1 ⊕ L2 ⊕ L3 ⊕ L4 → C. The line bundles are required to obey\n\nthe relation L1 ⊗ L2 ≃ L3 ⊗ L4 so that x1 x2 − x3 x4 in eq. (3.1) is a well-defined section.\nAnalogously to a conifold singularity in a threefold, the singular Calabi–Yau fourfold\ne sing\n\nX\n\ncan be smoothed by either a small resolution or by a deformation along the curve C\nf\nf♭ ,\nof double points. We denote the resulting Calabi–Yau fourfolds by Xa♯ , a = 1, 2, and X\n\nrespectively. As in the case of Calabi–Yau threefolds, the two distinct small resolutions\nf\nf♭ are\nf♯ and the deformation X\nXa♯ are related by a flop [32], whereas the small resolution X\n\nconnected by an extremal transition.5\nf♯\n3.1. Small resolution phases X\n\nf♯ is a fibration of the resolved conifold O(−1) ⊕ O(−1) → P1 over\nThe local fourfold X\nf♯ , which is\nthe genus g base curve C, and it contains the compact complex surface S ♯ ⊂ X\na P1 fibration over the curve C\n\nP1\n\n/ S♯ .\n\n(3.2)\n\n\u000f\nC\n5\n\nf♯ , if the distinction between the two\nWe often neglect the index of the small resolution X\na\n\nresolved phases is not relevant. Also, we refer to local (non-compact) Calabi–Yau fourfolds with\na tilde in order to distinguish them from global (compact) Calabi–Yau fourfolds written without\na tilde, which will appear later on.\n\n8\n\n\fThe P1 -fiber arises from the small resolution of the conifold singularity (3.1), i.e.,\n\u0012\n\u0013\u0012 \u0013\nx1 x4\nu\n= 0.\nx3 x2\nv\n\n(3.3)\n\nHere [u : v] are the homogeneous coordinates of the P1 -fibers and they transform – up to\nan overall tensoring with an arbitrary line bundle – as sections of L4 and L1 . Therefore,\nthe affine coordinates z =\n\nu\nv\n\nand w =\n\nv\nu\n\nof the two coordinate patches of the P1 -fibers are\n\n−1\n−1\nsections of L4 ⊗ L−1\n1 and L1 ⊗ L4 , respectively. The line bundle L1 ⊗ L4 has degree n,\n\nn = deg L1 − deg L4 ,\n\n(3.4)\n\nwhich is an integral parameter in the geometry that determines the intersection numbers.\nThe Picard group of the surface S ♯ is generated by the divisor classes F of the generic\nfiber and C of the base curve, given by the zero section z = 0. They have the intersection\nnumbers6\nF.F = 0 ,\n\nF.C = 1 ,\n\nC.C = −n .\n\n(3.5)\n\nThe Euler characteristic of the fibration (3.2) is given by\nχ(S ♯ ) = χ(P1 ) χ(C) = 4 − 4g ,\n\n(3.6)\n\nand, with the help of the adjunction formula, we find for the total Chern class of S ♯\nc(S ♯ ) = 1 + (2[C] − (2g − 2 − n)[F ]) + (4 − 4g)dvol(S ♯ ) .\n\n(3.7)\n\nHere [C] and [F ] denotes the (1, 1)-form in H 1,1 (S ♯ ) corresponding to the divisor classes\nC and F , while dvol(S ♯ ) is the volume form generating H 4 (S ♯ , Z). The self-intersection of\nthe surface S ♯ is\nS ♯ .S ♯ = 2 − 2g ,\n\n(3.8)\n\nand its Kähler volume, measured in terms of the Kähler form J(S ♯ ) = J F ([C] + n[F ]) +\nJ C [F ], is given by\n1\nVol(S ) =\n2\n♯\n\n6\n\nZ\n\nJ(S ♯ ) ∧ J(S ♯ ) =\n\nS♯\n\nn F 2\n(J ) + J F J C .\n2\n\n(3.9)\n\nAlternatively, we could have chosen the divisor C ′ in terms of the zero section w = 0, such\n\nthat F.C ′ = 1 and C ′ .C ′ = −n′ with n′ = −n = deg L4 − deg L1 . The two divisor classes C and\nC ′ are related by C ′ = C + nF and do not intersect as C.C ′ = 0.\n\n9\n\n\fThe Kähler parameters J F and J C measure the volume of the P1 fiber and the curve C.\nf♯ we need to take into account the non-compact\nFor the local fourfold geometry X\nf♯ over the surface S ♯ . The normal bundle N S ♯ restricted\nnormal bundle directions N S ♯ ≃ X\n\nto the generic fiber F is the resolved conifold O(−1) ⊕ O(−1) → P1 , whereas the normal\nbundle restricted to zero section z = 0 is the bundle L1 ⊕ L3 . Hence, the first Chern class\nof the normal bundle is given by\nc1 (N S ♯ ) = −2[C ′ ] + (deg L1 + deg L3 )[F ] = −2[C] + (deg L2 + deg L4 )[F ] .\n\n(3.10)\n\nf♯ ) = 0, it\nFor the small resolution to yield a local smooth Calabi–Yau fourfold, i.e., c1 (X\n\nis required that c1 (N S ♯ ) = −c1 (S ♯ ). Thus with eq. (3.4) we arrive at the Calabi–Yau\nf♯ 7\ncondition for the small resolution X\ndeg L1 + deg L2 = deg L3 + deg L4 = deg KC = 2g − 2 ,\n\n(3.11)\n\nand the second Chern class of the fourfold is determined to be\nf♯ ) = −(2 − 2g) dvol(S ♯ ) .\nc2 (X\n\n(3.12)\n\nAnalogously to the analyzed small resolution (3.3), we can carry out the other small\nresolution described by the blow-up\n\u0012\nx1\nx4\n\nx3\nx2\n\n\u0013\u0012 \u0013\ns\n= 0,\nt\n\n(3.13)\n\nwhere now the homogeneous coordinates [s : t] transform as sections of L3 ⊗ L−1\n1 . Then\nthe twisting of the P1 -bundle is captured by the integer deg L1 − deg L3 .\nf\nf\nThe two distinct small resolutions X1♯ and X2♯ are related by a flop transition. We can\n\nexplicitly model this flop transition by describing the conifold fibers of the genus g curve\n\nC as a symplectic quotient V //U (1) as in refs. [33,34]. We relegate the detailed analysis of\nthe flop transition to Appendix B. Here we record that the volume integral over the surface\nf\nS2♯ , measured in terms of the Kähler coordinates J1F and J1C of the phase X1♯ , reads\nZ\n1\n1\nJ(S1♯ ) ∧ J(S1♯ ) = − (n − (2g − 2))(J1F )2 − J1F J1C .\n(3.14)\n2 S2♯\n2\nThis is the negative of (3.9), except for the shift by (g − 1) in the first term. As we\nwill see, this shift represents a quantum correction to the twisted superpotential and the\nChern-Simons coefficient in the three-dimensional gauge theory, whereas n determines the\nclassical coefficient. The shift becomes important as we trace the flux-induced twisted\nsuperpotential through the flop transition and we return to this aspect in Section 5.\n7\n\nNote that due to the relation (3.1) we arrive at the same conclusion, if we derive the Calabi–\nYau condition with the generators F and C ′ of the Picard group.\n\n10\n\n\ff♭\n3.2. Deformed phase X\n\nWe obtain the deformed conifold geometry by deforming the conifold singularity (3.1)\n\nby\nxy − uv = ǫ ,\n\n(3.15)\n\nf♭ , the deformation parameter ǫ is again a\nIn the context of the local Calabi–Yau fourfold X\n\nsection of the line bundle L1 ⊗L2 ≃ L3 ⊗L4 , which, according to the Calabi–Yau condition\nis the canonical line bundle KC .\n\nThe canonical line bundle has g global holomorphic sections and as a consequence\nf♭ ) of the Calabi–Yau fourfold\ncontributes g directions to the deformation space Def(X\n\nf♭ . Since ǫ transforms as a section of a line bundle of degree (2g − 2), a generic global\nX\nholomorphic section has (2g − 2) isolated zeros along the curve C. For a generic deformed\n\nconifold fiber – that is to say for a fiber where the deformation section ǫ is non-zero –\nthe singular conifold fiber is replaced by a deformed conifold fiber T ∗ S 3 . The (2g − 2)\n\nfibers, which are located at the zeros of the section ǫ, remain singular conifold fibers. As\n(generically) these (2g − 2) fibers are isolated, the total space of the deformed Calabi–Yau\nf♭ is smooth, even in the vicinity of singular conifold fibers. As a result, the Euler\nfourfold X\nf♭ reads\ncharacteristic of the deformed Calabi–Yau fourfold X\n\nf♭ ) = χ(S 3 )χ(C)\ne + (2g − 2) = 2g − 2 ,\nχ(X\n\n(3.16)\n\nwhere Ce is obtained by removing the vicinities of the curve C where ǫ becomes zero.\n\nf♭ , we identify homologically non-trivial\nFrom the described local fourfold geometry X\n\nfour-cycles. We obtain 2g four-cycles A♭n , n = 1, . . . , 2g of topology S 1 ×S 3 by transporting\n(generic) S 3 -fibers along a non-trivial one-cycle (which avoids the (2g − 2) singular points)\non the base C. By transporting S 3 -fibers along the path connecting two singular points pk ,\nk = 0, . . . , (2g − 3), we arrive at non-trivial four-cycle of topology S 4 . There are (2g − 3)\ninequivalent such four-cycles Bl♭ , which may be constructed by considering the paths p0 –\npl , l = 1, . . . , (2g − 3). Thus we arrive at\n4g−3\nf♭ , Z) = hhA♭ , . . . , A♭ , B ♭ , . . . B ♭\nH4 ( X\n.\n1\n2g\n1\n2g−3 ii ≃ Z\n\nThis basis of four-cycles is depicted in Fig. 1.\n\n11\n\n(3.17)\n\n\f♭\nB2g−3\n\np0\nB2♭\n\nA♭1\nA♭2\n\np2\n\nB1♭\np1\n\n♭\nB2g−4\n\np2g−4\n\np2g−3\n\nA♭3\nA♭4\n\nA♭2g−1\n\nA♭2g\n\nFig. 1. Depicted are the zeros pl of the deformation section ǫ on the genus\ng curve C. The depicted paths, supplemented by S 3 in the fiber, give rise\nf♭ , Z).\nto the four-cycles A♭n and Bl♭ , which furnish a basis of H4 (X\n\nf♭ , later on we need to derive\nFor the analysis of background fluxes in the fourfold X\n\nthe intersection numbers for the basis elements (3.17). By construction the four-cycles A♭n\n\ndo not intersect the four-cycles Bl♭ , i.e., A♭n .Bl♭ = 0. Furthermore, the four-cycles A♭n have\nvanishing8 intersection numbers among themselves, i.e., A♭n .A♭m = 0. The intersections\namong the Bl♭ cycles turn out to be\nBn♭ .Bn♭ = 2 ,\n\n♭\nBn♭ .Bm\n= 1 (n 6= m) ,\n\n(3.18)\n\nwhich yield the intersection matrix\n\n\n2 1\n\n1 2\n\u0010\n\u0011\n. .\n♭\n♭\n. .\nI = Bn .Bm = \n. .\n1 1\n1 1\n\n\n*** 1 1\n*** 1 1\n. .\n..\n. .. .. \n .\n*** 2 1\n*** 1 2\n\n(3.19)\n\nThese intersections are derived in detail in Appendix C by carefully examining the structure\nof the shrinking S 3 -fibers in the vicinity of the points pl .\nInstead of the cycles Bl♭ we can also work with the integral cycles B̂l♭ , l = 1, . . . , 2g −3,\nwhich are constructed by considering the paths p0 – p1 , p1 – p2 , . . ., p2g−4 – p2g−3 depicted\nin Fig. 2. Then starting from the intersection matrix (3.19) with respect to the basis Bl♭ ,\n8\n\nWhile the S 1 cycles depicted in Fig. 1 clearly have non-zero intersections, the associated\n\nfour-cycles can be deformed within the S 3 fiber so that they do not intersect.\n\n12\n\n\fit is straightforward to determine the intersection matrix Î of the basis B̂l♭ :9\n\n\n2 −1\n0\n −1\n2 −1\n\n\u0010\n\u0011\n 0 −1\n2\n♭\n♭\nÎ = B̂n .B̂m = \n..\n..\n ..\n.\n.\n .\n 0\n0\n0\n0\n0\n0\n\n\n0\n0\n\n0\n.. \n .\n.\n***\n2 −1 \n* * * −1\n2\n\n***\n***\n***\n..\n.\n\n0\n0\n0\n..\n.\n\n(3.20)\n\nNote that Î is just the Cartan matrix of H = SU (N ), N = 2g − 2, with the cycles B̂l♭\ncorresponding to the roots of H, and this is precisely the homology lattice of the local\nA-type singularity studied in [15,35] in connection with 2d Kazama–Suzuki CFTs. The\ndifference here is that the Landau-Ginzburg field lives on the Riemann surface C instead\nof the complex plane and the paths between the pl define points in the Jacobian of C. In\nthe fourfold geometry, periods of Ω on B̂n♭ are defined up to addition of A♭m periods.\np0\n\nB̂1♭\n\np2\n\np1\n\n♭\nB̂2g−3\n\nB̂3♭\n\np2g−4\n\np2g−3\n\nB̂2♭\n\nFig. 2. Depicted are the paths of the group-theoretic basis of cycles B̂l♭ .\n\nAs we will see, depending on the posed geometric question either the basis Bl♭ or the\ngroup-theoretical basis B̂l♭ will turn out to be more convenient.\n3.3. Classification of G-flux on the local geometries\nAfter having described the local geometry of the transition, the next important step\nis to determine the consistent G-fluxes on top of it. Since the conifold transition represents\na local surgery operation, the boundary of the local fourfold is the same in all phases\n\n9\n\nf♯\nf♭\ne ≡ ∂X\n∂X\na = ∂X .\n\n(3.21)\n\nWe have chosen our conventions such that the intersection matrix Î gives rise to the Cartan\n\nmatrix of SU (N ). This differs from the conventions used in ref. [15], where the four-cycles B̂l♭ are\noriented in such a way that the off-diagonal entries of Î become positive.\n\n13\n\n\fSimilarly the flux on the boundary does not change under a transition and must match\ne\nthroughout the different phases. In a global embedding, the geometry of the boundary ∂ X\nand the flux on it will be further restricted by the requirement that one can consistently\nextend the local data to the global fourfolds X ♯ and X ♭ .\n\nThe relevant concepts to determine the flux choices on a non-compact fourfold have\nbeen described in [15] and we review here the key results. Neglecting the shift in (2.1) for\ne Z). This group\nthe moment, the background flux G is classified by an element of H 4 (X,\n\nhas two parts of different origin, which are visible in the long exact sequence\n\nι\n4 e\ne Z) −→ H 4 (X,\ne Z)−→H\ne Z) −→ * * * ,\n* * * −→ H 3 (∂ X,\n(X, Z) −→ H 4 (∂ X,\nc\n\n(3.22)\n\nThe first part comes from the integral four-form cohomology with compact support\ne Z) ≃ H 4 (X,\ne ∂ X,\ne Z), which is supported in the interior of X.\ne This interior part\nHc4 (X,\n\nmay change due to the local dynamics and will be denoted by Gc . The second part arises\ne Z), cannot be changed by the dynamics in the\nfrom the homology of the boundary, H 4 (∂ X,\n\ninterior and hence the flux in this part will be fixed under the phase transitions. In particue Z) may include torsion classes, which capture at infinity flat – but nevertheless\nlar H 4 (∂ X,\n\ntopologically non-trivial – configurations of the three-form gauge field C [15].\nResolved phase\n\ne arises as the boundary of the normal\nFirst consider the resolved conifold phase. Here ∂ X\nf♯ , which is an S 3 -bundle fibered over S ♯ . From the Gysin long exact\nbundle N S ♯ ≃ X\nsequence we infer10\n\ne Z) ≃ Z2g ,\nH 3 (∂ X,\n\nwhich implies by Poincaré duality\n\ne Z) ≃ Z2g ⊕ Z2g−2 ,\nH 4 (∂ X,\n\ne Z) ≃ Z2g ⊕ Z2g−2 ,\nH3 (∂ X,\n\ne Z) ≃ Z2g .\nH4 (∂ X,\n\n(3.23)\n\n(3.24)\n\ne Z) is generated by a fiber S 3 of ∂ X,\ne which is the boundary of the\nThe torsion of H3 (∂ X,\ntor\n3\nconifold fiber (3.1), and it obeys in homology (2g − 2) Stor\n≃ 0.\n10\n\ne Z) arises in the Gysin sequence due to the second Chern\nThe torsion piece Z2g−2 in H 4 (∂ X,\n\ne See Appendix A for more inforclass (3.12), which is the Euler class of the S 3 -fibration in ∂ X.\n\nmation on the (co)homology groups of the local geometries that is used below.\n\n14\n\n\fThe long exact sequence (3.22) embeds the interior fluxes G♯c into the flux background\nG♯ according to\nf♯ , Z) ֒→ H 4 (X\nf♯ , Z) ,\nι : Hc4 (X\n\ne♯ 7→ (2g − 2)e♯ ∗ .\n\n(3.25)\n\nf♯ , Z), which may be identified with [S ♯ ], whereas the\nHere e♯ is the generator of Hc4 (X\nf♯ , Z) may be identified with the volume form dvol(S ♯ ). It is dual\ngenerator e♯ ∗ of H 4 (X\n\nto e♯ via the intersection pairing (3.8).11 Due to the intersection pairing T ♯ .S ♯ = 1 of the\n(algebraic12 ) four-cycle S ♯ with the non-compact (algebraic) four-cycle\nT ♯ = π −1 (p) ∩ {x1 = x3 = u = 0} ,\n\n(3.26)\n\nf♯ is a resolved conifold fiber (3.3) over some point p of C, the generator\nwhere π −1 (p) ⊂ X\ne♯ ∗ is dual to the non-compact four-cycle T ♯ . As a consequence, the background flux may\n\nbe written as13\n\n\u0001\nG♯\nk♯\nG♯\n=\ne♯ = k ♯ mod (2g − 2) [T ♯ ] + c ,\n2π\n2g − 2\n2π\n\nk♯ ∈ Z .\n\n(3.27)\n\nIn the second expression, we have separated the background flux G♯ into two contributions\nwith non-compact and compact support. The first term characterizes the topologically\ne specified by the torsion k ♯ ∈ Z2g−2 , which\nnon-trivial three-form C-field at infinity ∂ X\ne ≃ k ♯ S 3 . The second term is attributed to an\nis given by the intersection (k ♯ T ♯ ) ∩ ∂ X\ninterior background flux G♯c .\ninvariant, but changes G♯c in\n\ntor\n♯\n\nNote that a change k → k ♯ ± (2g − 2) keeps the torsion class\n\nagreement with (3.25).\n\nDeformed phase\nf♭ , the relevant part of the long exact sequence (3.22) is\nIn the deformed phase X\n11\n\nβ\nα\nι\n4 f♭\n4 f♭\n4\ne Z)−→H\ne\n0 −→ H 3 (∂ X,\nc (X , Z)−→H (X , Z)−→H (∂ X, Z) −→ 0 .\n\n(3.28)\n\ne associates\nPoincaré duality for non-compact (complex four-dimensional) manifolds X\n\ne Z) ≃ H8−q (X,\ne Z) to H q (X,\ne Z) ≃ Hq (X,\ne Z) by (the non-degenerate part of) the interHcq (X,\n\ne Z) ⊗ H8−q (X,\ne Z) → Z.\nsection pairing I : Hq (X,\n12\n\nWe continue to refer to complex submanifolds as \"algebraic\" cycles in the local case, even\n\nthough – strictly speaking – we do not have a tool such as Chow's theorem [36] which guarantees\nthat they are algebraic in the compact case.\n13\n\nSince the second Chern class (3.12) is even in the local geometry, there is no half-integral\n\nshift in the quantization condition.\n\n15\n\n\fThe part G♭c of the flux comes from (2g − 3) generators in the cokernel of the map α, which\nare Poincaré dual to the four-cycles Bl♭ and span a (2g − 3)-dimensional integral lattice Γ♭\nwith intersection form (3.19) (or, in the group basis, (3.20)):\nG♭c\n♭\nf♭ , Z)/α(H 3 (∂ X,\ne Z)) ≃ hhB1♭ , . . . B2g−3\n∈ Γ♭ = Hc4 (X\nii .\n2π\n\n(3.29)\n\nf♭ , Z) can be further\nThe background fluxes G♭ lying in the non-compact part of H 4 (X\n\ndivided into two parts, depending on whether they are mapped under β onto a none Z) or not. The fluxes G♭ in the second part span the (2g − 3)torsion four-form in H 4 (∂ X,\n0\n\n♭∗\n\ndimensional lattice Γ\n\n♭\n\ndual to Γ in (3.29):\n\nG♭0\n∈ Γ♭ ∗\n2π\n\nf♭ , Z) ,\nΓ♭ ∗ ≃ Z2g−3 ⊂ H 4 (X\n\n(3.30)\n\ne Z) reflects again the fact that the lattice Γ♭ may be viewed\nThe torsion class in H 4 (∂ X,\nas a sublattice of its dual lattice Γ♭ ∗ of index (2g − 2), i.e.,\nΓ♭ ∗ /Γ♭ ≃ Z2g−2 .\n\n(3.31)\n\ne\nBackground fluxes that map under β onto the non-torsion four-forms on the boundary ∂ X\n\nand that are orthogonal to Γ♭0 are denoted as G♭⊥ . Then the background fluxes G♭ can be\nwritten as\n\nG♭\nG♭\nG♭\n= ⊥+ 0 ,\n2π\n2π\n2π\n\n2g−3\n2g−3\nX\nX\nG♭0\n♭ ♭∗\nλ♭l ê♭l ∗ ,\nbl el =\n=\n2π\nl=1\n\n(3.32)\n\nl=1\n\nwhere e♭l ∗ are the lattice generators of Γ♭ ∗ dual to the generators e♭l of Γ♭ , i.e., e♭l .e♭m∗ = δlm\n−1\nand e♭m∗ .e♭n∗ = Imn\n, with I given in (3.19). Alternatively, one may use the SU (2g − 2)\n−1\nbasis ê♭l with ê♭m∗ .ê♭n∗ = Înm\n, as indicated in the second expression.\n\nNote that the term G♭0 describes both, the interior part G♭c and the torsion classes in\nterms of the lattice Γ♭ ∗ . The latter is exactly the cohomology lattice of the A-type local\nsingularity in ref. [15]. A flux decomposition into elements in G♭c and the torsion fluxes\ne corresponds to a decomposition of a lattice vector into root and weight vectors of\non ∂ X\nSU (2g − 2), respectively.\n\nWe can again express the lattice generators e♭l ∗ of Γ♭ ∗ in terms of dual non-compact\n\n(algebraic) four-cycles. To this end we define the non-compact four-cycles\nTl♭ = π −1 (pl ) ∩ {x1 = x3 = 0} ,\n16\n\nl = 0, . . . , 2g − 3 ,\n\n(3.33)\n\n\fwith intersection numbers Tl♭ .Bk♭ = δlk and T0♭ .Bk♭ = −1 for l, k = 1, . . . , 2g − 3.14 Due to\nthe shift in the second Chern class (2.6), the quantization condition (2.1) requires us to\nput half-integral fluxes on all the non-compact cycles Tl♭ . Hence, expressed in terms of the\nfour-cycles Tl♭ the background flux G♭0 reads\n2g−3\nX\nG♭0\n=\nt♭l [Tl♭ ] ,\n2π\n\nt♭l ∈ Z +\n\nl=0\n\n1\n,\n2\n\n(3.34)\n\nwhere the half-integral flux quanta t♭l are related to the integral flux quanta b♭l according\nto\nb♭l = t♭l − t♭0 ,\n\nl = 1, . . . , 2g − 3 .\n\n(3.35)\n\nThe torsion part contains again information about the flat topological non-trivial threee classified by the torsion element k ♭ ∈ Z2g−2 . Since the\nform C-field on the boundary ∂ X,\n\ne in the generator S 3 of the torsion subgroup of\nnon-compact four-cycles Tl♭ intersect ∂ X\ntor\n♭\ne\nH3 (∂ X, Z), the torsion k becomes\n2g−3\n\n♭\n\nk =\n\nX\nl=0\n\n2g−3\n\nt♭l\n\n=\n\nX\n\n2g−3\n\nb♭l\n\n+ (2g −\n\n2)t♭0\n\nl=1\n\n=\n\nX\n\nb♭l + (g − 1)\n\nmod (2g − 2) ,\n\n(3.36)\n\nl=1\n\nwhere we have used in the last step that t♭0 is half-integrally quantized. Note that a change\nP\nP ′\n′\nin the flux quanta b♭l −→ b♭l , such that l b♭l = l b♭l mod (2g − 2) affects G♭c , but not\ne\nthe torsion class k ♭ on the boundary ∂ X.\n3.4. Non-dynamical flux constraints for the phase transitions\n\nA conifold transition between an M-theory compactification on X ♯ and X ♭ can occur\nonly if the fluxes G♯ and G♭ in the two phases match certain conditions. A universal\nconstraint comes from the flux Φ at infinity, defined in ref. [15] as:\n1\nΦ = M+\n2\n14\n\nZ\n\nG\nG\n∧\n−\n2π 2π\n\nZ\n\nX8 (R) .\n\n(3.37)\n\nX\n\nNote that Bl♭ = Tl♭ − T0♭ up to the ambiguity of adding four-cycle classes A♭n , which, however,\n\ndo not affect the intersection numbers. The representation of the cycles Bl♭ as differences of noncompact \"algebraic planes\" Tl♭ has been discussed in detail in ref. [35] in the context of identifying\nthe chiral fields of the dual Kazama-Suzuki model. In particular, the integral of Ω over the\nnon-compact algebraic cycles Tl♭ is not zero due to contributions at infinity.\n\n17\n\n\fWe must require that this flux is constant through phase transitions among Calabi–Yau\nfourfolds, i.e.,\nΦ ≡ Φ♯1 = Φ♯2 = Φ♭ ,\nExplicitly\n\nZ\n1\n=\n+\nfa♯\n2 X\nZ\n1\nΦ♭ = M ♭ +\n2 X\nf♭\n\nΦ♯a\n\nMa♯\n\nZ\nG♯a G♯a\nX8 (Ra♯ ) ,\n∧\n−\n♯\nf\n2π\n2π\nX1\nZ\n♭\n♭\nG\nG\nX8 (R♭ ) ,\n∧\n−\n2π 2π\nf♭\nX\n\n(3.38)\n\na = 1, 2 ,\n(3.39)\n\nin terms of the M2 brane, flux and curvature contributions in the different phases.\nLet us first derive the flux constraints for extremal conifold transitions, i.e., between\nf♭ . First we observe that the background fluxes\nf♯ and X\ntwo local Calabi–Yau fourfolds X\n\nG♭⊥ of the deformed phase in (3.32) do not have a counterpart in the resolved phases in\nf♭ in\nf♯ and X\n(3.27). As a consequence there is no dynamical phase transition between X\nthe presence of non-trivial background fluxes G♭⊥ . Setting G♭⊥ ≡ 0, the condition Φ♯ = Φ♭\ncan be written as\n\n4(g − 1)(M ♭ − M ♯ ) = (g − 1)2 − (k ♯ )2 − 2(g − 1) b♭ * I −1 * b♭ ,\n\n(3.40)\n\nwhere (I −1 )mn = δmn − (2g − 2)−1 is the inverse of the intersection form (3.19) and we\nused eqs. (3.6), (3.16), (3.27) and (3.32). From (3.40) it follows, that the torsion classes\nmust match at the common boundary, i.e.,\nk♯ =\n\nX\n\nb♭l + (g − 1) = k ♭\n\nmod (2g − 2) ,\n\n(3.41)\n\nl\n\nin terms of the torsion class k ♭ of eq. (3.36). Note that this torsion condition – derived\nfrom the constraint (3.38) – agrees with the requirement to maintain the torsion class at\ne throughout the extremal transition.\nthe boundary ∂ X\n\nThe basic transitions with minimal flux are geometric transitions without a change in\n\nthe number M2 branes, i.e., M ♯ = M ♭ . In this case eq. (3.40) simplifies to\n\n(g − 1)2 − (k ♯ )2 = 2(g − 1) b♭ * I −1 * b♭ = 2(g − 1) λ♭ * Î −1 * λ♭ ,\n\n(3.42)\n\nwhere the shift of flux on the l.h.s. comes from the gravitational contribution in (3.37).\nNote that the r.h.s. of eq. (3.42) is always positive, as follows e.g. from the last expression\nand (3.20). As a consequence a transition without M2 brane participation is only possible,\n18\n\n\fif the flux quantum k ♯ of the resolved phase is in the charge window −(g −1) ≤ k ♯ ≤ (g −1).\nThe solutions to these constraints are given by\n0 ≤ k ♯ ≤ (g − 1) , b♭l ∈ {−1, 0} ,\n\nX\n\nk ♯ − (g − 1) =\n\nb♭l ,\n\nl\n\nor\n−(g − 1) ≤ k ♯ ≤ 0 , b♭l ∈ {0, 1} ,\n\n(g − 1) + k ♯ =\n\nX\n\n(3.43)\n\nb♭l .\n\nl\n\nThe fluxes G♭ and G♯ determined by (3.43), (3.27), (3.32) and G♭⊥ = 0 are then the minimal\ne ♯ and X\ne ♭ that allow for a transitions.\nflux choices on X\nRewriting the solutions (3.43) for b♭l in the group theory basis\n\nG♭\n2π\n\n= b♭l e♭l ∗ = λ♭l ê♭l ∗ , one\n\nobserves that the solution vectors λ♭l are simply the miniscule weights λ♭ of SU (2g − 2).\nThese have been already determined in refs. [15,35] as the minimal flux choices on an\nA-type singularity which lead to a (Kazama-Suzuki coset) CFT with a mass gap after a\ncircle compactification to 2d. Here we have found that the minimal fluxes (and states) of\nthe A-type singularity are at the same time the minimal fluxes (and states) relevant for\nthe fourfold conifold transition, where the group is SU (2g − 2) for the conifold fibration\nover a genus g curve. In this context, the flux constraints (3.41) and (3.42) amount to\npartitioning the shifted flux on the X ♯ side with (g − 1) − |k ♯ | flux quanta into single flux\nquanta b♭l of charge ±1 in the deformed phase X ♭ .\nNext we consider the flux constraint for a flop transition between the two resolved\nf\nf\nconifold phases X1♯ and X2♯ , which is simpler. From eq. (3.38) it already follows that\ne through the flop gives\nk ♯ = ±k ♯ . Matching the torsion class at the common boundary ∂ X\n1\n\n2\n\nk1♯ = −k2♯ .\n\n(3.44)\n\nWe summarize the possible geometric phase transitions without the participation of M2\nbranes in the following phase diagram:\n♯\n\n♯\n\nk1 = −k2\nf\nf♯\n/X\nX1♯ o\n2\nflop\n✷X ✷\n☞F\n✷✷\n☞\n✷✷\n☞☞\n☞\n✷✷extr. trans. ☞☞\n♯ (3.43) ♭ ✷\n♯\n☞☞ k♯ ≡−k2♯ (3.43)\nk ≡k1 ←→ bl ✷✷\n←→ b♭l\n☞\n✷✷\n☞\n\u0018 \u0006☞☞\nf♭\nX\n\n19\n\n(3.45)\n\n\fThe flux constraints discussed above and displayed in the diagram reflect only the necessary\nboundary conditions for a transition to exist. In addition, the transitions may be obstructed\ndynamically by the flux induced scalar potential for the deformations. Naturally, these\nobstructions cannot solely be phrased in terms of topological data, but depend on the\nactual values of the deformation 'moduli'. In the next section we therefore examine the\nflux-induced scalar potentials and exemplify their role in the context of these geometric\nphase transitions.\n3.5. M-theory three-form C-field and Cheeger-Simons cohomology\nIn the previous section we determined the torsion classes of the C-field at the boundary\nby intersecting the non-compact (algebraic) four-cycles dual to the four-form flux with the\ne In order to characterize in greater detail the C-field at the boundary, we\nboundary ∂ X.\nneed a refined description of the M-theory three-form C-field together with its four-form\n\nflux G. As explained and spelled out in ref. [37], in order to get a handle on the C-field in\nthe presence of non-trivial background fluxes, we consider the pair (C, G) as an element of\n\nCheeger-Simons cohomology [38,39]\n\u0013\n\u0012\nG\n∈ C 4 (X, Z) × C 3 (X, R) × Ω4 (X) ,\ngZ , C,\n2π\n\n(3.46)\n\nThis triple consists of a closed integral four-cocycle gZ , a real three cochain C and a closed\nfour-form\n\nG\n2π\n\nsuch that\ndgZ = 0 ,\n\ndG = 0 ,\n\nG\n− gZ = dC ,\n2π\n\n(3.47)\n\nmodulo\n(gZ , C) ∼ (gZ + dΛ, C − Λ − dρ) ,\n\n(3.48)\n\nwith (Λ, ρ) ∈ C 3 (X, Z) × C 2 (X, R).15\nIn this triple the integral cocycle gZ contains the topological information of the background flux, while the four-form G is a solution to the M-theory equations of motion, which\nto leading order is a harmonic four-form. Finally, the real three-cocycle C, which corresponds to the expectation value of three-form M-theory gauge field, captures the deviation\nof the dynamical flux G from the rigid topological integral cocycle flux gZ .\n15\n\nThis description has to be appropriately adjusted for four-form background fluxes with shifted\n\nquantization conditions according to eq. (2.1).\n\n20\n\n\fBy integrating the four-form\n\nG\n2π\n\nor equivalently the integral four-cocycle gZ over four-\n\ncycles, we extract the integral quanta of the background flux, while M2 branes wrapped\non three-cycles Σ probe the three-form gauge field C in terms of the holonomy phase [37]\n\u0012\n\u0013\nZ\nφ(C, Σ) = exp 2πi\nC .\n\n(3.49)\n\nΣ\n\nNote that this holonomy factor is well-defined, as it is invariant with respect to the transformations (3.48).\nWe now apply the Cheeger-Simons cohomology description to measure the C-field at\ne of the discussed non-compact fourfolds. The four-form flux G♯ on the\nthe boundary ∂ X\nf♯ is represented (at leading order) by a L2 harmonic form with compact\nlocal fourfold X\nsupport, as determined by the equations of motion for the real four-form G♯ , whereas\n\nthe topological flux gZ♯ – representing the integral four-cocycle of the flux – reaches out\ne At the boundary the deviation of the dynamical flux G form the\nto the boundary ∂ X.\ntopological flux gZ is characterized by the C-field, which we analyze by computing the\ne Z)\nholonomies φ(C, Σa ) over a set of generators of H3 (∂ X,\ne =\nφ(C, ∂ X)\n\nexp 2πi\n\nZ\n\n3\nStor\n\nC\n\n!\n\n\u0012\nZ\n; exp 2πi\n\n\u0013\n\nC , . . . , exp 2πi\n\nΣ1\n\nZ\n\nΣ2g\n\nC\n\n!!\n\n, (3.50)\n\n3\nwhere Stor\nand Σn , n = 1, . . . , 2g, are the generators of the torsion and non-torsion sub-\n\ngroups of the homology group (3.24), respectively.\nf♯ the holonomy phase factors (3.50) become\nFor the local fourfold X\ne =\nφ(C, ∂ X)\n\n\u0013\n\u0012\n♯\n♯\n2πik♯\n2πiν\n2πiν\n2g\n1, . . . , e\n,\ne 2g−2 ; e\n\n(3.51)\n\nwhere the first factor measures the torsion of the C-field and the subsequent factors the\nholonomies νn♯ with respect to the non-torsion three-cycles S 1 × S 2 . Note that the latter\nf♯ .\nphase factors are continuous periodic moduli of M-theory on the local fourfold X\nf♭ gives rise to similar phases at the boundary ∂ X\ne\nThe flux G♭ on the fourfold X\ne =\nφ(C, ∂ X)\n\n\u0012\n\u0013\n2πik♭\n♭\n♭\n2πiν\n2πiν\n1, . . . , e\n2g\ne 2g−2 ; e\n,\n\n(3.52)\n\nwhich capture again the torsion class k ♭ of the C-field and the non-torsion holonomies νn♭ .\n21\n\n\ff♭ the phase factors ν ♭ may be interNote that in the context of the local geometry X\nn\n\npreted as non-trivial four-form fluxes with compact support, which are Poincaré dual to\nthe cycles A♭n . Such fluxes are trivial in the cohomology with compact support, i.e., they\nf♭\nare in the kernel of the map α in the sequence (3.28). Therefore, the local geometry X\n\ndoes not impose a quantization condition on the parameters νn♭ . If, however, we couple to\nf♭ into a global compact Calabi–Yau fourfold\ngravity – by embedding the local geometry X\n\nX ♭ – a quantization condition may be imposed on the phase factors νn♭ . Therefore, by\n\nhaving a particular global compactification X ♭ in mind, we may impose even in the local\nf♭ a particular quantization condition on the parameters ν ♭ .\nsetting X\nn\n\nThus, in order to realize an extremal M-theory transition between the local geometries\nf\nf♯ , in addition to the constraints summarized in (3.45), we also need to ensure\nX ♭ and X\nthat the non-torsion holonomies match according to:\n♯\n\n♭\n\ne2πiνn = e2πiνn ,\n\nn = 1, . . . , 2g\n\n(3.53)\n\n3.6. Flat directions of the superpotential and Abel-Jacobi map\nHaving established the topological conditions on background fields, which must be\nfulfilled independently of any further details for a phase transition to exist, we now examine\nthe dynamical conditions, i.e., the unobstructed directions of the scalar potential. Along\nthese directions, the Kähler and complex structure moduli adjust such that dW = 0 and\nthe harmonic background fluxes are both primitive and of Hodge type (2, 2) [29,15]. The\nconditions on the complex structure and the Kähler moduli can be study separately on\nf (J) in eq. (2.3).\nthe two parts W (Ω) and W\nResolved phase\n\nf♯ the possible background fluxes G♯ in eq. (3.27) are Poincaré\nIn the resolved local fourfold X\nf♯ , i.e., e♯ ≃ [S ♯ ]. As a\ndual to (a rational multiple of) the algebraic surface S ♯ ⊂ X\n\nf♯ ) vanishes identically and there are no constraints\nconsequence the superpotential W (X\non the complex structure. On the other hand, due to eqs. (2.3), (3.9) and (3.27) a nonf♯ we find\nvanishing flux G♯ gives rise to a twisted superpotential. Thus, in the phase X\nf♯ ) =\nf (X\nW\n\n\u0010n\n\u0011\nk♯\nF 2\nF C\n,\n(J ) + J J\n4(g − 1) 2\n\nf♯ ) = 0 .\nW (X\n\n(3.54)\n\nf♯ tend to be dynamically lifted for non-zero flux G♯ if n 6= 0.\nand the resolved phases X\n22\n\n\fDeformed phase\nWe have already argued that a transition requires G♭⊥ = 0, and, therefore, we concentrate\non non-vanishing fluxes of type G♭0 as given in eqs. (3.32) and (3.43). These fluxes are\nrepresented by harmonic L2 four-forms.\nf♭ ) correspond to\nf (X\nThe flat directions of the flux-induced twisted superpotential W\n\nprimitive L2 fluxes G♭0 , namely\n\nf♭ ) = 0\nf (X\ndW\n\nf♭ ) = 0 ,\nfor G♭0 ∧ J(X\n\n(3.55)\n\nf♭ ) is the Kähler form of the non-compact fourfold X\nf♭ . The six form G♭ ∧\nwhere J(X\n0\nf\n2\n♭\nJ(X ) is again L harmonic and a priori needs not to vanish. For compact manifolds the\nHodge–DeRham theorem identifies harmonic forms with cohomology groups. However,\nfor non-compact Kähler manifolds a similar relationship between L2 harmonic forms and\n\ncohomology groups is only established in special cases. Therefore – despite of the vanishing\nf♭ , R) – a non-trivial flux G♭ may still fail to be primitive. In the\ncohomology group H 6 (X\n0\n\nf♭ into a compact fourfold X ♭ , we observe that\ncontext of explicit global embeddings of X\n\nthe fluxes G♭0 are primitive for the torsion class k ♭ = 0 and tend to be imprimitive for other\n\ntorsion classes k ♭ 6= 0 (c.f., Section 4.1).\n\nBefore starting with analyzing the detailed conditions on the complex structure moduli\nf♭ ), it is instructive to remember the structure of the result found in refs. [13,40]\nfrom W (X\n\nfor the closely related problem of geometric engineering of N = 1 supersymmetric four-\n\ndimensional Yang-Mills theory on Calabi–Yau threefold with flux. The non-zero flux po-\n\ntential describes a N = 1 superpotential which drives the theory to loci in the deformation\nspace with extra massless dyon states, which condense in the N = 1 vacuum [41]. The\nspectrum of massless states corresponds to a particular factorization of the Seiberg-Witten\ncurve in the parent N = 2 theory, which supports these states on vanishing cycles. The\nbeautiful interplay between the factorization of the defining equations of the effectively\none-dimensional geometry, a complex curve, and the minimization of the quantum superpotential computed by periods integrals is provided by the Abel-Jacobi theorem, which\nlinks the zeros of a linear combination of periods to the existence of a certain meromorphic\nfunction in the factorized geometry [40].\nIn the following we find a similar structure for the present minimization problem by\nreducing the superpotential for the complex structure moduli to Abel-Jacobi integrals on\n23\n\n\fthe curve C.16 The Abel-Jacobi theorem then relates the minima of the superpotential to\nthe existence of line bundles with global holomorphic sections, with the latter associated to\nthe massless 3d states that are the building blocks of the meson operators. The existence\nof these sections amounts to the split of the canonical divisor on C into two residual special\ndivisors in the sense of [42], and this condition can be written as a factorization condition\nf♭ .\non the polynomial ǫ in (3.15) representing the deformations of X\n\nf♭ ),\nIn order to explicitly find the flat directions of the flux-induced superpotential W (X\n\nwe start by evaluating (2.3) in the presence of the background flux G♭0\n!\nZ\n2g−3\n2g−3 Z\nX\nX\n1\nf♭ ) =\nΩ−\nW (X\nb♭l\nΩ .\n2g − 2 m=1 Bm\n♭\nBl♭\n\n(3.56)\n\nl=1\n\nHere we use the relations (3.32) and (3.30) to express the superpotential in terms of the\nintegers b♭l , restricted by the topological condition (3.43). For ease of notation we focus\non the window 0 ≤ k ♭ ≤ (g − 1) and label the points p0 through p2g−3 in Fig. 1 such\nthat the flux quanta (3.43) are distributed according to b♭1 = . . . = b♭(g−2)+k♭ = 0 and\nb♭(g−1)+k♭ = . . . = b♭2g−3 = −1. Integrating over the S 3 fibers we obtain\n♭\n♭\nX Z pl (z)\nX Z pl (z)\ng\n−\n1\n+\nk\ng\n−\n1\n−\nk\nf\n*\nω(z) −\n*\nω(z) .\nW (X ♭ ) =\n2g − 2\n2g − 2\np0 (z)\np0 (z)\npl ∈Z+\n\n(3.57)\n\npl ∈Z−\n\nwhere Z± denote the two point sets\n\nZ+ = {p0 , p1 , ..., pg−2+k♭ } ,\n\nZ− = {pg−1+k♭ , ..., p2g−3} ,\n\n(3.58)\n\nwith g − 1 ± k ♭ elements and Z+ ∪ Z− is the divisor of KC , by construction. Moreover, for\ngeneric moduli, ω(z) is a holomorphic one-form on the genus g curve C, which depends on\nboth the parameters of deforming section ǫ of the canonical bundle KC and the complex\nstructure moduli of the base curve C.17 Both types of moduli furnish complex structure\nf♭ , which we collectively denote by z. The\ndeformations of the local Calabi–Yau fourfold X\n\nline integrals are taken over paths as schematically depicted in Fig. 1. For criticality of\nthis superpotential we arrive at the condition\n\n\nZ pl\nZ pl (z)\nX\nX\nd−\nf♭ ) =  d+\ndW (X\n∂z ω(z)dz = 0 ,\n∂z ω(z) −\n∆\n∆\np0 (z)\np0\npl ∈Z+\n\n(3.59)\n\npl ∈Z−\n\n16\n\nWith a slight extension necessary to describe the C-fields discussed in the previous section.\n\n17\n\nExplicit examples will be considered in the next subsection.\n\n24\n\n\fwhere we used that the differential ω vanishes at the points pl and we defined the positive\nintegers\nd± =\n\ng − 1 ∓ k♭\n,\ngcd(g − 1 − k ♭ , g − 1 + k ♭ )\n\n∆ = d+ + d− =\n\n2g − 2\n. (3.60)\ngcd(g − 1 − k ♭ , g − 1 + k ♭ )\n\nAs the derivatives ∂z ω(z) for all z generate a basis of holomorphic one-forms ωα , α =\n1, . . . , g, we can formulate the criticality constraint (3.59) in terms of the map\nμ̃ : {pl } 7→\n\n\u0012Z\n\nZ\n\npl\n\nω1 , . . . ,\n\np0\n\nas\n\npl\n\nωg\n\np0\n\n\u0013\n\n,\n\n(3.61)\n\nd−\nd+\nμ̃(p0 + . . . + pg−2+k♭ ) −\nμ̃(pg−1+k♭ + . . . + p2g−3 ) = 0 ,\n∆\n∆\n\n(3.62)\n\nwhere we used linearity of μ̃. The map μ̃ is related to the Abel-Jacobi map\nμ : C → Jac(C), q 7→\n\n\u0012Z\n\nq\n\nω1 , . . . ,\n\np0\n\nZ\n\nq\n\np0\n\nωg\n\n\u0013\n\n,\n\n(3.63)\n\nby the commuting diagram\n{pl }\n\nμ̃\n/ Cg\n.\n●●\n●● μ\n●●\nP\n●●\n●# \u000f\nJac(C)\n\n(3.64)\n\nThe definition of the map μ̃ includes a specific path of integration p0 –pl , which is determined by the minimal volume condition when integrating over the S 3 fibers in eq. (3.56).\nOn the other hand, modding out by integral cycles in H1 (C, Z) defines the projection P\nand one obtains the Abel-Jacobi map μ, which is well-defined for a point q on C. Inversely,\nthe lift from μ to μ̃ requires specifying the path p0 –pl .\nTo include also the C-fields, we have to consider in addition a contribution to the\nsuperpotential from background fluxes Poincaré dual to the four-cycles A♭n . These fluxes\nf♭ ) according to (3.28).\nhave compact support and become exact in the cohomology H 4 (X\ne\nNevertheless, they enter the superpotential due to their contributions at the boundary ∂ X.\n\nIntegrating over the S 3 fibers, this flux-induced superpotential becomes\nf♭ , ν ♭ ) =\nW (X\nn\n\n2g\nX\n\nn=1\n\n25\n\nνn♭\n\nI\n\na♭n\n\nω(z) ,\n\n(3.65)\n\n\fwith a basis of one-cycles a♭n , n = 1, . . . , 2g, of H1 (C, Z). The flux parameters νn♭ give rise to\n♭\n\nthe (periodic) holonomy phases e2πiνn in the Cheeger-Simons cohomology.18 As discussed\nf♭ .\nat the end of section 3.5, these flux parameters are quantized in a global embedding of X\n\nThe generalized criticality condition for the combined superpotential from eqs. (3.57),(3.65)\ncan then be written as\n\nd−\nd+\nμ̃(p0 + . . . + pg−2+k♭ ) −\nμ̃(pg−1+k♭ + . . . + p2g−3 ) + μ̃ν (νn♭ ) = 0 ,\n∆\n∆\nwith\nμ̃ν : νn♭ 7→\n\nX\n\nνn♭\n\nn\n\nI\n\nω1 , . . . ,\n\na♭n\n\nX\n\nνn♭\n\nn\n\nI\n\nωg\na♭n\n\n!\n\n,\n\n(3.66)\n\n(3.67)\n\nwhich, analogously to (3.64), also projects onto the intermediate Jacobian Jac(C). Finally,\nby linearity of the map μ̃, we may rewrite the criticality condition (3.66) into the two\nequivalent constraints\nd−\nμ̃(p0 + . . . + p2g−3 ) − μ̃ν (νn♭ ) ,\n∆\nd+\nμ̃(p0 + . . . + p2g−3 ) + μ̃ν (νn♭ ) .\n+ . . . + p2g−3 ) =\n∆\n\nμ̃(p0 + . . . + pg−2+k♭ ) =\nμ̃(pg−1+k♭\n\n(3.68)\n\nThe projection of the map μ̃ onto the Abel-Jacobi map μ gives a nice geometric\ninterpretation of the supersymmetry conditions (3.68): Firstly, the zero of the Abel-Jacobi\nmap establishes a one-to-one correspondence with holomorphic line bundles. Namely, we\nassign to the effective divisors appearing as the arguments of the map μ̃ on the left-hand\nside of the two relations in eq. (3.68) the line bundles E±\nE+ = OC (p0 + . . . + pg−2+k♭ ) ,\n\nE− = OC (pg−1+k♭ + . . . + p2g−3 ) .\n\n(3.69)\n\nThen the supersymmetry conditions (3.68) tell us that the two line bundles must be given\nby\nd /∆\n\nE+ ≃ KC −\n\nd /∆\n\nE− ≃ KC +\n\n⊗ L0 ,\n\n⊗ L∗0 .\n\n(3.70)\n\nwhere L0 is the degree zero line bundle associated to the point −μν (νn♭ ) of the intermediate\nJacobian Jac(C). Here the root of the canonical bundle appears because the effective divisor\n18\n\nNote that the continuous values of the parameters νn♭ become only meaningful with respect\n\nto an explicitly chosen basis of four-cycles Bl♭ and A♭n .\n\n26\n\n\fp0 + . . . + p2g−3 corresponds to the canonical bundle KC of the curve C. As a result, we\nobserve that the line bundles E± fulfill\nE+ ⊗ E− ≃ KC .\n\n(3.71)\n\nFor later reference, we alternatively write the line bundles (3.70) as\n1/2\n\nE+ ≃ KC\n\n1/2\n\nin terms of the spin structure KC\n\n1/2\n\n⊗L ,\n\nE− ≃ KC\n\nL = KC\n1/2\n\n(3.72)\n\nand the degree-k ♭ line bundle\nk♭\n2g−2\n\nThe spin structure KC\n\n⊗ L∗ ,\n\n⊗ L0 .\n\n(3.73)\n\nand the (2g − 2)-th root of KC in eq. (3.73) must be chosen in\n\naccord with eqs. (3.68).\nf♭ ) is specified by the torTo recapitulate at this point, the flux superpotential W (X\n\nsion class k ♭ and the C-field parameters νn♭ and imposes the constraint (3.68) on the\nf♭ ) parametrized by the global sections ǫ of\ncomplex structure deformation space of Def(X\nthe canonical bundle KC on the family of curves C. Via the above argument, the condif♭ ) = 0 translates into the condition, that the canonical divisor splits into two\ntion dW (X\nresidual divisors associated to two line bundles E± with holomorphic sections ǫ± . The flat\nf♭ ) are therefore of the factorized form\ndirections in Def(X\nx1 x2 − x3 x4 = ǫ+ ǫ−\n\nwith ǫ± ∈ H 0 (C, E± ) .\n\n(3.74)\n\nThe above conditions (3.71) and (3.70) do not uniquely specify the line bundles E± , as\nthere is an ambiguity in taking the ∆-th root in eq. (3.70). The different choices of roots\nof the canonical bundle are distinguished by the C-field parameters νn♭ in eq. (3.68), and\nthese have to be matched as well in an extremal transition.\nAs the space of flat directions is parametrized by the deformations of ǫ that arise as the\nproduct of two global sections ǫ± of the line bundles E± , the dimension of the unobstructed\ndeformation space is\nf♭ , E ⊗ E ) = N + N − 1 .\ndim Def(X\n+\n−\n+\n−\n\n(3.75)\n\nHere N± = h0 (C, E± ) is the number of global sections of E± and the −1 accounts for\na rescaling (ǫ+ , ǫ− ) → (λǫ+ , λ−1 ǫ− ) with λ ∈ C∗ . Note that the individual number of\n27\n\n\fglobal sections N± , and thus the dimension of the deformation space (3.75), depends on\nthe complex structure of the curve C and the holonomy phase factors νn♭ . Only the index\nN+ − N− = h0 (C, E+ ) − h1 (C, E+ ) = h1 (C, E− ) − h0 (C, E− ) ,\n\n(3.76)\n\nis a topological invariant.\nf♭ ) obstructs a generic deformation\nIn summary the non-vanishing superpotential W (X\nf♭ . The flux G♭ is still consistent with the topological constraints\ninto the deformed phase X\n0\n\nf♭ ) where the zero set\n(3.45) as we move along non-flat directions of the superpotential W (X\n\nZ+ ∪ Z− of the canonical bundle does not split into the zero sets of holomorphic sections\nf♭ ) is identically\nof the two line bundles E . On the other hand, the superpotential W (X\n±\n\nzero on the flat directions determined by the factorization condition (3.74). Combining the\n\nabove results for the superpotential and the twisted superpotential, we can find dynamically\nunobstructed phase transitions at least for vanishing torsion class k ♯ = k ♭ = 0.\n3.7. Local transitions for special configurations\nTo make some of the previous findings more concrete, we consider now some special\nf♯ ) in eq. (3.54) generically prevents a\nconfigurations. Since the flux superpotential W (X\nphase transition for k ♯ 6= 0 (at least in the local case) we first focus on the most promising\nf♯ . This corresponds to\ncase of vanishing background flux G♯ in the resolved geometry X\n\nthe torsion class k ♯ = k ♭ = 0 and a flux\n♯\n\nG\n= 0,\n2π\n\nG♭0\n2π\n\n=\n\n\n\n1 X\n[Tl♭ ] −\n2\nl: pl ∈Z+\n\nX\n\nl: pl ∈Z−\n\n\n\n[Tl♭ ] ,\n\n(3.77)\n\nwhere each set Z± defined in (3.58) contains g − 1 points. While there is no potential in\nf♭ ) is given by (3.57) for k ♭ = 0\nf♯ , the flux-induced superpotential W (X\nthe resolved phase X\n1/2\n\nand the flat directions correspond to the split (3.71) with E± = KC\n\n⊗ L±1 .\n\nA particular interesting case, motivated by the existence of a global embedding, is the\n1/2\n\nfactorization E± ≃ KC . The flat directions of the superpotential then correspond to the\n1/2\n\nholomorphic global sections N+ = N− of a chosen spin structure KC\n\non C. On the genus\n\ng curve C there are 22g inequivalent spin structures or, in other words, 22g inequivalent\nsquare roots of the canonical bundle KC [43]. These are in one-to-one correspondence with\nthe 22g half-integral choices for the phases νn♭\n\b 1\nνn♭ ∈ 0,\n2\n\n, n = 1, . . . , 2g\n\n1:1\n\n←→\n28\n\n1/2\n\n22g spin structures KC\n\n(3.78)\n\n\fBy a classical result due to Riemann (and proved in modern algebraic language by Mumford\n[44]) these spin structures (also called \"theta characteristics\") can be divided into two\nclasses: for 2g−1 (2g +1) of the spin structures, the dimension of the space of global sections\nis even, while for the remaining 2g−1 (2g − 1) spin structures, the dimension of the space\nof global sections is odd, hence non-vanishing.\nAs a first example consider the case with a single global section ε = ǫ± .19 Then the\nunobstructed deformation space is one-dimensional with its flat direction parametrized by\nǫ = ε2 . As the deformation ǫ is a square, it yields (g − 1) double zeros. For explicitness we\nlabel the individual zeros in such a way that the pairs (p0 , p1 ), (p2 , p3 ), . . . , (p2g−4 , p2g−3 )\ncorrespond to the (g −1) double zeros. In this way we naturally define a basis of four-cycles\n♭\nB̂l♭ as in Fig. 2. Then the four-cycles B̂2k−1\n, k = 1, . . . , g −1 are associated to the vanishing\n\npaths p2k−2 – p2k−1 , and hence are shrunken to zero size. With these conventions and\naccording to eq. (3.77) the deformation ǫ = ε2 corresponds to a flat direction for the flux\nconfiguration\n\u0011\n1 X\u0010 ♭\n1X ♭\nG♭0\n♭\n∗\n=\n[T2k+1 ] − [T2k\n] = ê♭1 ∗ − ê♭3 ∗ + . . . + (−1)g ê♭2g−3\n=\n[B̂2k+1 ]\n2π\n2\n2\ng−2\n\ng−2\n\nk=0\n\n(3.79)\n\nk=0\n\nexpressed in terms of dual forms of the non-compact four-cycles Tl♭ or, alternatively, in\nterms of a (particular choice of) basis ê♭l ∗ Poincaré dual to the duals of the four-cycles\n♭\nB̂l♭ . Due to the vanishing of the four-cycles B̂2k−1\n, k = 1, . . . , g − 1, along the deformation\nf♭ ) = 1 Pg−2 R ♭\nΩ associated to the flux\ndirection ǫ = ε2 , the superpotential W (X\n2\n\nk=0 B̂2k+1\n\nf♭ remains\nconfiguration (3.79) is identically zero. Note that the deformed Calabi–Yau X\n\n♭\nsingular at the vanishing cycles B̂2k−1\ncorresponding to the (g − 1) double points. A five-\n\n♭\nbrane wrapped on a vanishing cycle B̂2k−1\ngives rise to a tensionless domain wall which\n♭\nconnects two vacua distinguished by a sign flip of the coefficient of [B̂2k−1\n] in (3.79).\n\nHyperelliptic curves\nFor a concrete class of phase transitions with higher dimensional deformation spaces we\nconsider next the case of a hyperelliptic curve C, where the relevant spaces of holomorphic\n19\n\nFor hyperelliptic Riemann surfaces there is always a spin structure with a single global\n\nsection, whereas for the generic Riemann surface such a spin structure is conjectured in ref. [45].\n\n29\n\n\fsections can be studied quite explicitly. A hyperelliptic curve can be described as branched\ndouble covers of P1 , which can be realized as the locus\n2g+2\n2\n\ny =\n\nY\n\n(x − wi ) .\n\n(3.80)\n\ni=1\n\nin C2 . Hyperelliptic curves C come with an involution\nι : (x, y) 7→ (x, −y) ,\n\n(3.81)\n\nwhich fixes the (2g + 2) Weierstrass points wi , i = 1, ..., 2g + 2. The divisors 2w1 ∼ 2w2 ∼\n. . . ∼ 2w2g+2 are linearly equivalent, and the canonical bundle may be represented by [45]\nKC ≃ OC ((2g − 2)wi ) for any\n\ni = 1, . . . , 2g + 2 .\n\n(3.82)\n\nAs described above, the flat directions of the superpotential arise from global holomorphic\nsections of the spin structures which have been classified in ref. [45]. Any spin structure of\na hyperelliptic curve C can be expressed in terms of divisors built out of Weierstrass points\n1/2\n\nKC\n\n= OC (c1 w1 + . . . + c2g+2 w2g+2 ) ,\n\nci ∈ Z ,\n\nX\n\nci = g − 1 .\n\n(3.83)\n\ni\n\n1/2\n\nThe zeros of the holomorphic sections of KC and KC , whose interplay led to the derivation\nof the factorization condition (3.71), are subject to the following general conditions:\n(i) The global holomorphic sections of the canonical bundle KC are odd with respect to\nthe involution ι, which implies that their (2g − 2) zeros group into (g − 1) pairs of\nzeros (p, p̂) such that p can be put at an arbitrary position while p̂ = ι(p). If a zero of\nǫ coincides with a Weierstrass point wi , than it is at least a double zero.\n(ii) A global section of a spin structure has (at least) a simple zero at every Weierstrass\npoint that appears with an odd coefficient ci in eq. (3.83) . The remaining zeros come\nagain in pairs (p, p̂) with ι(p) = p̂, with p at an arbitrary position.\nThe classification of spin structures in [45] distinguishes two classes, namely hyperelliptic\ncurves C of odd and of even genus g. We examine these two situations separately and start\n30\n\n\ffirst with odd genus curves C. For convenience we reproduce the results of this classification\nhere (with i1 < i2 < . . . < ig+1 ):\n1/2\n\n#\n1\n\n\u0001\n2g+2\n2 \u0001\n2g+2\n4\n\n..\n.\n\n\u0001\n\n2g+2\ng−1 \u0001\n2g+1\ng\n\nKC\nOC ((g − 1)w1 )\nOC ((g − 2)wi1 + wi2 )\nOC ((g − 4)wi1 + wi2 + wi3 + wi4 )\n..\n.\nOC (wi1 + . . . + wig−1 )\nOC (−w1 + wi2 + . . . + wig+1 )\n\n1/2\n\ndim H 0 (C, KC )\ng+1\n2\ng−1\n2\ng−3\n2\n\n..\n.\n1\n0\n\nf♭ , K 1/2 )\ndim Def(X\nC\ng (odd)\ng−2\ng−4\n..\n.\n1\n0\n(3.84)\n\nThe columns denote the number of distinct spin structures of a given type, the spin structure expressed by divisors, the number of global holomorphic sections, and the dimension of\nthe unobstructed deformation space (3.75). By the above arguments, this space is supposed\nto parametrize the flat directions of the flux superpotential given by the two contributions\n(3.57) and (3.65). To match these two descriptions we write the superpotential as a sum\nof two contributions\nf♭ ) = W + W =\nW (X\n+\n−\n\nZ\n\ng+ ∧ ω +\n\nZ\n\ng− ∧ ω ,\n\nwhere g± is the part of the (reduction to C of the) flux which is even/odd under the\ninvolution. Since ω is odd, W+ vanishes identically, while W− 6= 0 and puts a non-trivial\nrestriction on the deformation space.\n\nFor k ♭ = 0 the superpotential (3.57) can be expressed as a sum W =\nP\n\nl\n\nP\n\n♭\n♭\nl tl [T̂l ]\n\n=\n\nλ♭l [B̂l♭ ], with t♭l , λ♭l ∈ { 21 , − 12 }. The poles pl of the four-cycles B̂n♭ are paired by the\n\ninvolution ι and there are three different possibilities to locate the four-cycles B̂n♭ relative\nto the two sheets, as shown in Fig. 3.\n31\n\n\fa)\n\n−\n\n+\n\n−\n\n+\n\nb)\n\n−\n\n+\n\n+\n\n−\n\nc)\n\n−\n\n+\n\nFig. 3. The diagram depicts the three different local flux configurations\nappearing on hyperelliptic curves C. The dashed line indicates a branch\ncut separating the two sheets of the branched covering of P1 . As explained\nin the text, the circles and the connecting solid lines show the poles pl\ntogether with fluxes along four-cycles B̂n♭ .\n\nHere the solid circles denote the points pl , the arrows the projection to C of the cycles B̂n♭\nwith the orientation determined by the sign of the coefficients t♭l , λ♭l and the dashed line\nthe branch cut separating the two sheets of C. In the first configuration a) the zeros pl and\nι(pl ) appear with the same coefficient t♭l and both lie in a single factor ǫ± . The combined\nR\nR\nR\ncontribution of the two B̂ ♭ cycles on the two sheets is W+ = B̂ ω + ι(B̂) ω = B̂ (ω +\nι∗ (ω)) = 0. For the other two configurations the zeros pl and ι(pl ) appear with opposite\ncoefficients and lie in different factors ǫ± . The superpotential for these configurations\nis non-zero for generic position of pl , but becomes critical if the zeros pl approach a\nWeierstrass points wi as shown in Fig. 4.\n\na)\n\nb)\n\nc)\nW− = W (ν =\n\nwi\n\nwj\n\n1\n2)\n\nwj\n\nwi\n\nW− = 0\nwi\n\nFig. 4. The diagram shows the flux configurations as the poles pl in Fig. 3\napproach Weierstrass points wi and wj . Moving the poles onto the Weierstrass points realizes a flat direction in case a) whereas the superpotential\nfor the flux configuration becomes critical in case b) and c).\n\nThe superpotential for case b) in Fig. 4 is equal to a half-integer flux on a cycle a♭ij encircling\nthe points wi , wj and can be cancelled by adding a flux ν = − 12 in (3.65). For case c),\n32\n\n\fthe flux is dual to vanishing cycles and gives a zero superpotential, similarly as in the case\nN± = 1 discussed above. The number of deformations is reduced by -2 and by -1 in these\ntwo cases, respectively.\nTo compare with the results of [45] note that there is a unique maximal spin structure\n1/2\nKC ,\n\ncorresponding to the first line of table (3.84), for which the unobstructed deformation\nf♭ , K 1/2 ) realizes the entire geometric deformation space Def(X\nf♭ ). This spin\nspace Def(X\nC\n\nstructure has only even coefficients, and as a result of point (ii), we can pick two sections\nǫ± each with\n\n1\n2 (g\n\n− 1) pairs of zeros (p, p̂) where the zeros p are at arbitrary positions.\n\nThis maximal spin structure assigns to any pair of points (p, p̂) half-integral flux quanta\nof the same sign which contribute only to the configurations a) with W+ = 0, in accord\nwith the above analysis of the flux superpotential. Moreover νl♭ = 0 for all l as adding a\nflux (3.65) would induce a non-zero obstruction.\nOn general grounds, the other spin structures can be obtained from the maximal one\nby switching on half-integral C-field fluxes νl♭ along cycles a♭l . The critical points of the\nsuperpotential are then of the type b) with flux coefficients t♭l of opposite signs on two points\npl and ι(pl ). Indeed all the other spin structure in (3.84) have global sections with zeros\nat 2 ≤ 2k ≤ 2g − 2 Weierstrass points according to (ii). Let us denote these Weierstrass\npoints by wi1 to wi2k . Thus the deformations ǫ = ǫ+ ǫ− realized in terms of such a spin\nstructure has (at least) a double zero at these Weierstrass points. This constrains the\nf♭ ) by 2k conditions, explaining the dimension of the deformation\ndeformation space Def(X\n\nf♭ , K ) ⊂ Def(X\nf♭ ) in (3.84). Since the deformations ǫ exhibit these 2k\nspaces Def(X\nC\n1/2\n\ndouble points, there are 2k vanishing B-cycles in the deformed geometry and the fourfold\nf♭ remains singular at the fibers over these Weierstrass points. The sections ǫ assign\nX\n±\nnow half-integral flux quanta [Tl♭ ] of opposite sign to the two distinct zeros in the double\n\nzeros of the 2k Weierstrass point according to eq. (3.77), resulting in one unit of flux for\neach vanishing B-cycles at the Weierstrass points wi1 and wi2k .\nThe third critical configuration c) describes a half-integral flux on a vanishing cycle\nB̂ ♭ , representing a root of the AM lattice (3.20) with M = 2g − 3. A Weyl reflection of\nAM sends G/2π =\n\n1\n[B̂ ♭ ]\n2\n\n→ −G/2π. The two configurations are related by a fivebrane\n\ndomain wall wrapping B̂ and have the same number of M2 branes δM (B̂ ♭ ) = 0. Indeed,\nfor a fivebrane wrapped on a four-cycle D, we should consider the averaged flux Ḡ =\n33\n\n\f(G1 + G2 )/2 = G1 + 2π[D]/2 of the fluxes G1/2 on both sides of the domain wall [15] and\nintegrate over D to obtain\nδM (D) =\n\nZ\n\nD\n\nḠ\n=\n2π\n\nZ \u0012\n\n1\nG1\n∧ [D] + [D]2\n2π\n2\n\n\u0013\n\n.\n\n(3.85)\n\nThis is zero for the above case as Ḡ = 0.20\nWe know briefly turn to the geometries based upon hyperelliptic curves of even genus.\nIn this case the classification of spin structures reads (with i1 < i2 < . . . < ig+1 ) [45]:\n#\n2g + 2\n\u0001\n2g+2\n3 \u0001\n2g+2\n5\n\n..\n.\n\n\u0001\n\n2g+2\ng−1 \u0001\n2g+1\ng\n\n1/2\n\n1/2\n\ndim H 0 (C, KC )\n\nKC\nOC ((g − 1)w1 )\nOC ((g − 3)wi1 + wi2 + wi3 )\nOC ((g − 5)wi1 + . . . + wi5 )\n..\n.\nOC (wi1 + . . . + wig−1 )\nOC (−w1 + wi2 + . . . + wig+1 )\n\ng\n2\ng−2\n2\ng−4\n2\n\n..\n.\n1\n0\n\nf♭ , K 1/2 )\ndim Def(X\nC\ng − 1 (odd)\ng−3\ng−5\n..\n.\n1\n0\n(3.86)\n\nThe analysis of spin structures for the even genus hyperelliptic curves proceeds analogously\nto the odd genus case. For even genus there are 2g +2 maximal spin structures (as opposed\nto a single maximal spin structure for odd genus). However, no spin structure – not even the\nf♭ ),\nmaximal spin structures – can dynamically realize the entire deformation space Def(X\nbecause any spin structure has at least one odd coefficient ci in (3.83) and hence at least one\n\ndouble zero along a Weierstrass point according to (ii). As a consequence the deformation\nf♭ , K 1/2 ) is always a true subspace of Def(X\nf♭ ) for any spin structure K 1/2 .\nspace Def(X\nC\nC\n\nThe individual spin structures are again distinguished by the phase factors νn♭ as in (3.78).\nThis can be worked out explicitly by determining integral vs. half-integral flux quanta on\nthe four-cycles A♭n .\nTo summarize we have seen how the Abel-Jacobi theorem applied to the flat directions\nof the superpotential (3.57) and (3.65) reproduces the classification of spin structures on\nhyperelliptic curves obtained in ref. [45] by different means. Moreover the above argument\n20\n\nThe configurations of type c) require X to have an An singularity with n ≥ 1 in the sense of\n\nrefs. [15,35] and appear to be more general in that they need not be related to a factorization in\nthe non-hyperelliptic case.\n\n34\n\n\fexplicitly illustrates the correspondence (3.78) between spin structures and holonomy factors νn♭ in the context of hyperelliptic curves. The above arguments based on the superpotential are however not restricted to the hyperelliptic case (and not even to spin structures,\nas they apply to more general line bundles, i.e., tensor products with the flat bundle L0 ).\nIt would be interesting to study the classification of spin structures on non-hyperelliptic\ncurves from this perspective.\nIn this context note that the Z2 symmetry, which asserts the cancellation of the two\ncontributions to W+ in the configuration a), arises here from the hyperelliptic involution,\nbut can be interpreted more generally as a Z2 symmetry acting on the SU (2g − 2) lattice\n(3.30), which asserts the coincidence of the volumes of two subgroups of four-cycles (roots)\nwith identical intersections. A natural ansatz for a systematic construction of critical\nsubsets is therefore to classify and study those loci in the deformation space of SU (2g − 2),\nwhich are invariant under discrete symmetries acting on the group lattice.\nGenus 6 curves with a maximal spin structure\nf♭ built upon a genus 6 curve that\nf♯ and X\nWe now discuss the dynamics of the phases X\n\narises as the zero locus of a (generic) homogeneous degree five polynomial p5 in P2\nC = {p5 (x1 , x2 , x3 ) ≡ 0} ⊂ P2 ,\n\n(3.87)\n\nwith homogeneous coordinates x1 to x3 .\nIn order to have dynamical transitions we focus on a scenario with vanishing flux\nf♯ . Then, as discussed, the flat directions of the deformed\nG♯ = 0 in the resolved phase X\nf♭ are controlled by a spin structure E ≃ K 1/2 arising as the square root of the\nphase X\n±\n\nC\n\ncanonical bundle KC . The canonical bundle of the curve (3.87) is the line bundle O(2)\nrestricted to the curve C, namely KC ≃ O(2)|C . Its sections are homogeneous degree two\npolynomial\nq2 = z1 x21 + z2 x22 + . . . + z6 x2 x3 ,\n\n(3.88)\n\nf♭ ).\nwith six parameters z1 to z6 parametrizing the deformation space Def(X\n1/2\n\nAn obvious square root of the canonical bundle is given by KC\n\n≃ O(1)|C with three\n\nglobal sections x1 , x2 , x3 , i.e., N± = 3, which gives rise to five unobstructed deformations\nf♭ , K 1/2 ) is\n(c.f., eq. (3.75)). This five-dimensional unobstructed deformation space Def(X\nC\n\nf♭ ) parametrized\na codimension one slice in the six-dimensional deformation space Def(X\n\nby sections of the canonical bundle KC . The unobstructed deformations correspond to\n35\n\n\fthose polynomials q2 , which factorize into two linear polynomials q2 = l1 l2 with the linear\nfactors l1/2 representing sections of the spin structure O(1)|C .\nAs a side remark, we observe that the discussed spin structure O(1)|C is maximal. A\n\u0003\n\u0002\nglobal sections, which\nspin structure of a genus g curve is called maximal, if it has g+1\n2\nis the maximal number of sections for a spin structure of a curve [43]. However, a spin\nstructure can only be maximal if the curve C is either hyperelliptic or it is of genus four\nor genus six [46,45]. The curve (3.87) is not hyperelliptic, and therefore we encounter here\nan example of a maximal spin structure for the exceptional case g = 6. In the subsequent\nexamples, we come back to maximal spin structures of hyperelliptic curves.\nf♭\nVanishing G-flux on the local fourfold X\n\nIn our first scenario, we take a generic genus g curve C (g > 1) with the background fluxes\nG♯\n1\n= ± [S ♯ ] ,\n2π\n2\n\nG♭\n= 0,\n2π\n\n(3.89)\n\nin the resolved and in the deformed phase, respectively. Such fluxes correspond to the torf♭ .\nsion classes k ♯ = k ♭ = g − 1 with vanishing flux quanta b♭ on the deformed geometry X\nl\n\nf♯ is lifted due to the presence of the twisted superpotenDynamically, the resolved phase X\n\ntial (3.54), while – because of the absence of background fluxes G♭ – the deformed phase\nf♭ is unobstructed, realizing the entire deformation space of the deformed phase. ForX\nf♭ with the factorization bundles E ≃ K\nmally, we may identify the unobstructed phase X\n+\n\nC\n\nand E− ≃ OC with N+ = g and N− = 1 global holomorphic sections, giving rise to the\ng-dimensional deformation space (3.75).\n\n4. Conifold transition in global Calabi–Yau fourfolds\nIn this section we study the embedding of the local transitions into global fourfolds.\nThe globalization of the locally consistent fluxes identified above leads us to consider fluxes\nsupported on integral homology cycles of a mixed type which give a new class of solutions\nto the local anomaly conditions. We study the flat directions of the superpotential for these\nsolutions and show that these are often the only solutions which give rise to supersymmetric\nvacua and dynamically realized phase transitions.\nAt the critical points the local condition captured by the Abel-Jacobi theorem translates to the appearance of new algebraic four-cycle classes at special complex structure\n36\n\n\fwhere the polynomial of the global hypersurface allows for reducible algebraic cycles. Reducible algebraic four-cycles supporting G-flux have been already studied in the context of\nF-theory and elliptic fibrations in ref. [21].21 The correspondence between reducible algebraic cycles in Calabi–Yau threefolds and its dual fourfolds and the critical points of N = 1\nsuperpotentials via an Abel-Jacobi argument is also prominent in the works [50,51,48,52]\non N = 1 mirror symmetry.\nTo avoid being too technical from the beginning, we first consider the sextic fourfold\nas a simple example, as it illustrates already some of the distinct features of the new class\nof mixed fluxes emerging from the local discussion.\n4.1. A simple example: Extremal transition for the sextic\nBefore we delve into the general discussion of extremal M-theory transitions in Calabi–\nYau fourfolds, we first present an instructive example. Let us consider the sextic hypersurface Calabi–Yau fourfold X ♭ ≡ P5 [6] in the projective space P5 , given in terms of a general\nhomogeneous polynomial of degree six in the projective coordinates x1 , . . . , x6 of P5 . The\nfourfold X ♭ has Hodge numbers and Euler characteristic\n= 1,\nh1,1\nX♭\n\n= 0\nh2,1\nX♭\n\n= 1 752 ,\nh2,2\nX♭\n\n= 426 ,\nh3,1\nX♭\n\nχ(X ♭ ) = 2 610 .\n\n(4.1)\n\nAs the defining sextic polynomial degenerates to x5 g(x) + x6 h(x) with two degree-five\npolynomials g(x) and h(x), it develops along the codimension two locus x5 = x6 = g(x) =\nh(x) = 0 a genus 76 curve C of conifold singularities. A small resolution of this singular\ncurve yields the Calabi–Yau fourfold X ♯ with Hodge numbers and Euler characteristic22\nh1,1\n= 2,\nX♯\n\nh2,1\n= 0,\nX♯\n\nh3,1\n= 350 ,\nX♯\n\nh2,2\n= 1 452 ,\nX♯\n\nχ(X ♯ ) = 2 160 .\n\n(4.2)\n\nWe observe that the Euler characteristic changes by δχ = χ(X ♭ ) − χ(X ♯ ) = 450 =\n6 − 6 g(C), in agreement with the change in Euler characteristics deduced from eqs. (3.6)\n21\n\nA dual spectral cover description for G-fluxes supported on algebraic four-cycles has been\n\ngiven in refs. [47,48,19,49].\n22\n\nWe obtain the small resolution as follows (c.f., [53,2]). The curve C lies within P3 defined\n\nby x5 = x6 = 0. We blow up P3 within P5 , which may be realized in P5 × P1 as the locus\ns1 x5 − s2 x6 = 0 with the projective coordinates s1 , s2 of P1 . The resolved Calabi–Yau fourfold\nX ♯ is the locus 0 = s1 x5 − s2 x6 = s1 g(x) + s2 h(x) within P5 × P1 . Alternatively, we will give a\n(related) toric hypersurface realization of X ♯ in Section 4.4.\n\n37\n\n\fand (3.16) in the context of the local extremal transitions. Furthermore, the Hodge numbers change as anticipated in eq. (2.5), which we will show in general in Section 4.2 and\nSection 4.3 for such extremal transitions.\nTo describe dynamical phase transition between X ♭ and X ♯ , let us now turn to the\nbackground fluxes. Firstly, we observe that the Euler characteristic χ(X ♯ ) is divisible by 24\nand the second Chern class c2 (X ♯ ) is even in H 4 (X ♯ , Z). As consequence, the Calabi–Yau\nfourfold X ♯ together with MX ♯ =\n\n2 160\n24\n\n= 90 space-time filling M2 branes fulfills both the\n\ntadpole constraint (2.2) and the quantization condition (2.2) in the absence of background\nfluxes G♯ = 0. Thus, such a scenario represents a consistent M-theory background. Due\nto the absence of background fluxes, there are no potentials (2.3) and we arrive at a\nsupersymmetric M-theory vacuum on X ♯ with\nMX ♯ = 90 ,\n\nG♯ = 0 .\n\n(4.3)\n\nFrom a local perspective in the vicinity of the curve C – that is to say from the vantage\nf♯ of a resolved genus 76 curve C as discussed in Section 3\npoint of the local fourfold X\n\n– the vacuum (4.3) describes a local configuration with vanishing torsion class k ♯ = 0.\nFurthermore, due to the absence of homologically non-trivial three-cycles, i.e, h2,1\n= 0,\nX♯\n\nthe phase factors νn♯ are set to zero due to the embedding into the global geometry X ♯ .\nLet us now examine dynamical phase transitions into the fourfold X ♭ . The Euler\ncharacteristic of χ(X ♭ ) is not divisible by 24 and the second Chern class c2 (X ♭ ) = 15H 2\nis odd, where the class H is induced from the hyperplane class of the ambient P5 .23 Thus,\nconsistency of M-theory on the fourfold X ♭ requires a half-integrally quantized background\nflux G♭ such that the quantization condition (2.1) is met. Then the tadpole condition (2.2)\ncan be fulfilled with an integral number of space-time filling M2 branes MX ♭ .\nFor a dynamical phase transition into X ♭ , the required background flux G♭ must\nbe supersymmetric for an unobstructed deformation into X ♭ . In the discussed global\nsetting these deformations are parametrized by homogeneous polynomials of degree six\nǫ(x) according to\nx5 g(x) + x6 h(x) = ǫ(x) .\n23\n\nSince\n\nR\n\nX♭\n\n(4.4)\n\nH 2 ∧ H 2 = 6, the four form class H 2 is not divisible by two in H 4 (X ♭ , Z). Hence,\n\nc2 (X ♭ ) is not divisible by two.\n\n38\n\n\fThe deformation ǫ(x) restricts on the genus g curve C to a section of the canonical bundle\nf♭ . The analysis of the superpotential\nK , as discussed in the context of the local fourfold X\nC\n\nin the local geometry of Section 3.6 told us that – for vanishing phase factors νn♯ and for\nvanishing torsion classes k ♯ = k ♭ = 0 – the section of the canonical bundle ǫ must factor\n1/2\n\ninto sections of an appropriate spin structure KC\n\nas ǫ = ǫ+ ǫ− .24\n\nWhen the local geometry is embedded into a global fourfold X ♭ , the two local algebraic\ncycles defined by x5 = x6 = ǫi (x) = 0 must extend to globally defined algebraic cycles.\nThe easiest way to achieve this is to assume that the factorization condition globalizes, i.e.,\nthe sextic deformation ǫ(x) in eq. (4.4) has to factor into two homogeneous polynomials\nof degree three, which is a constraint on the complex structure of X ♭ . The new aspect\nin the global geometry is that for this complex structure there is a new integral algebraic\nfour-cycle class. Indeed if we set x5 = x6 = 0 in eq. (4.4), then – contrary to the generic\nsextic fourfold X ♭ near the transition – we get a reducible algebraic four-cycle with two\ncomponents T±♭ : x5 = x6 = ǫ± (x) = 0. By construction the integral four-form classes\n[T±♭ ] add up to the square of the hyperplane class, namely H 2 = [T+♭ ] + [T−♭ ].\nA global version of the local result (3.77) obtained for k ♯ = 0 in Sect. 3.6 is the flux\n\u0011\n1\u0010 ♭\nG♭\n[T+ ] − [T−♭ ] .\n=\n2π\n2\n\n(4.5)\n\nAs expected from the local analysis, this satisfies the quantization condition (2.1):\n\u0011 15\nG♭\nc2 (X ♭ )\n1\u0010 ♭\n[T+ ] − [T−♭ ] − H 2 = −7[T+♭ ] − 8[T−♭ ] .\n−\n=\n2π\n2\n2\n2\n\n(4.6)\n\nFurthermore, with the help of the intersection numbers T+♭ .T+♭ = T−♭ .T−♭ = 39 and\nT−♭ .T+♭ = −36 of the four-cycles T±♭ ,25 we determine for the flux (4.6) a tadpole-free Mtheory configuration with space-time filling M2 branes that is unchanged from (4.3)\nMX ♭ =\n\n1\n2 610\n−\n(2 * 39 + 2 * 36) = 90 .\n24\n2*4\n\n(4.7)\n\nNote that the classes [T±♭ ] continue to exist, and provide a solution to the local anomaly\ncancellation on each integral four-cycle, for any complex structure away from the factorization locus. For generic complex structure the representatives for [T±♭ ] are neither algebraic\n24\n\nExcept for the critical configurations related to An singularities.\n\n25\n\nWe calculate the Euler number of the normal bundle N T±♭ , which determines the self-\n\nintersections of T±♭ to be 39. Then we infer T−♭ .T+♭ = −36 from 6 =\n\n39\n\nR\n\nX♭\n\nH 2 ∧ H 2 = (T+♭ + T−♭ )2 .\n\n\fnor special Lagrangian and the flux (4.5) is of a mixed type. For the special complex\nstructure the lattice vectors in H 4 (X, Z) associated with the classes [T+♭ ] and [T−♭ ] become\northogonal to the class represented by Ω (see also the discussion in App. A.)\nThe flux discussed above gives rise to an unobstructed phase transition between X ♭\nand X ♯ . As for the Kähler moduli, the mixed G-flux G♭ in eq. (4.5) is primitive because\nf is zero. This feature\nof J ∧ G♭ ∼ (T+♭ + T−♭ )(T+♭ − T−♭ ) = 0. The twisted superpotential W\n\nof the new mixed solution to the anomaly constraint should be compared to the other\nobvious solution of the split type:\n\n\u0011\nG♭split\n1 2\n1\u0010 ♭\n♭\n[T+ ] + [T− ] .\n= H =\n2π\n2\n2\n\n(4.8)\n\nIn distinction to the flux (4.5), this choice of flux generates a twisted superpotential for\nthe Kähler modulus of the sextic. Note that the two configurations (4.5) and (4.8) are\nconnected by a five-brane domain wall wrapped on T− .\nOn the other hand, the mixed G-flux generates the superpotential W for the complex\nstructure deformations studied in Section 3.6. As argued there, the critical points of\nthis superpotential are precisely the complex structures for which ǫ factorizes as ǫ(x) =\nǫ+ (x)ǫ− (x). These deformations will keep both cycles T±♭ as cycles of type (2, 2), as\nexpected from the results of [29,15]. Hence, moving along factorized deformation directions,\nwe find a dynamically unobstructed phase transition from X ♯ into the deformed phase X ♭ .\nMore precisely, the 150 zeros of ǫ(x) on the genus 76 curve C split into the g − 1 = 75\nzeros pl ∈ Z± of ǫ± (x), defining the four-cycles Tl♭ that appear with positive/negative\ncoefficients in (3.77). In the global embedding these two sets of four-cycles in the local\ngeometry add up to the four-cycle classes T±♭ in X ♭ . Thus the analyzed phase transition\nrepresents a global embedding of the local transition discussed in eq. (3.43).\nExtremal transitions for other torsion classes correspond to other classes of factorizations of ǫ(x) and these again give rise to (different) new algebraic four-cycle classes in\nthe global fourfold X ♭ for special complex structures. For the sextic, a globally consistent factorization requires ǫ± to be of degree 3, 2, 1, corresponding to the torsion classes\nk ♯ = 0, 25, 50 and a net number of M2 branes 90, 92, 98, respectively. Note that the flux\ncontribution to the M2 brane charge on X ♯ has the wrong sign for k ♯ > 0 (see (2.2)) and\nindicates an obstruction towards the transition to X ♯ . These obstructed cases are similar\nto the transitions in elliptic fourfolds considered in [21], where the flux contribution on the\nresolved phase appears to have always the wrong sign.\n40\n\n\fAs a concrete example consider the factorization of ǫ(x) = ǫ5 (x)ǫ1 (x) into a degree\nfive and a degree one polynomial. In this case the G-flux becomes\n\u0011\nG♭\n1\u0010 ♭\n♭\n[T5 ] − [T1 ] ,\n=\n2π\n2\n\n(4.9)\n\nin terms of the corresponding algebraic cycles with H 2 = [T5♭ ]+[T1♭ ]. By similar arguments,\nthis flux is again consistent with the quantization constraint (2.1) and yields M ♭ = 98 due\nto the tadpole condition (2.2) (because T5♭ .T5♭ = 25, T1♭ .T1♭ = 21 and T5♭ .T1♭ = −20).\nFrom the 125 and 25 zeros of ǫ5 (x) and ǫ1 (x), respectively, we obtain 125 non-vanishing\nflux-quanta b♭l of charge one, which yield the torsion class k ♭ = 50 according to eq. (3.36).\nR\nHowever, the flux G♭ is not primitive anymore, because the intersection X ♭ G♭ ∧ H 2 = 2\n\ngives rise to a twisted superpotential\n\nf♭ = 1\nW\n2\n\nZ\n\nX♭\n\nG♭\n2\n∧ J ∧ J = JH\n,\n2π\n\n(4.10)\n\nin terms of the Kähler form J = JH H with Kähler parameter JH . In the resolved fourfold\nX ♯ the corresponding background flux G♯ is given by26\nG♯\n1\n1\n= [S ♯ ] + H̃ 2 ∈ H 4 (X ♯ , Z) ,\n2π\n3\n3\n\n(4.11)\n\nexpressed in terms of the four-form [S ♯ ] dual to the surface (3.2) and the two-form class\nH̃ induced from the hyperplane class H in P6 . As [S ♯ ] is orthogonal to H̃ 2 , the tadpole\ncondition (2.2) yields again the M2 brane number M ♯ = 98. Furthermore, the flux (4.11)\ngenerates a twisted superpotential of the form\nf♯ = 1\nW\n2\n\nZ\n\nX♯\n\nG♯\n2\n∧ J ∧ J = JH\n+ 10JH JF ,\n2π\n\n(4.12)\n\nwith the Kähler form J = JH H̃ + JF [F ], where JF is the volume of the P1 fiber F of the\nfibration S ♯ . The first term corresponds to the twisted superpotential (4.10) also appearing\nin the fourfold X ♭ . The second term arises in the extremal transition in the vicinity of the\ngenus 76 curve C, as discussed in the context of the local geometries in Section 3. This is\nthe contribution in (3.54) for the torsion class k ♯ = 50.\n26\n\nDespite the overall factor of\n\n1\n,\n3\n\na closer analysis reveals that\n\ncompatible with the quantization condition (2.1).\n\n41\n\nG♯\n2π\n\nis actually integral and thus\n\n\fHence, the factorization ǫ(x) = ǫ5 (x)ǫ1 (x) realizes a local extremal M-theory transition\nscenario along a genus 76 curve C with torsion class k ♭ = k ♯ = 50. However, in addition\nf♭ and\nto the potential terms arising in the vicinity of the local transition geometries X\nf♯ , we find an additional overall twisted superpotential term, which we attribute to the\nX\n\nchosen realization of the global embedding fourfolds X ♭ and X ♯ . As we review and discuss\n\nin section 5, twisted superpotentials yield Chern-Simons terms in the 3d field theory, and\nmixed terms, involving one dynamical and one background field, have the interpretation\n2\nof a FI term in the low-energy field theory. Then, in (4.12), the first term ∼ JH\nis a\n\ngenuine global effect present on both sides of the transition, while the second term has an\ninterpretation as a non-zero FI-term in the 3d field theory. For the above choice of global\nflux, the transition will therefore be obstructed, even in the field theory sense. This is in\naccord with the fact that again one needs 8 more M2 branes on X ♯ with flux (4.11) as in\nthe vacuum with zero flux. The FI-term can be however removed by an additional integral\nflux on X ♯ , i.e., G♯ =\n\n1\n([S ♯ ]\n3\n\nboth sides of the transition.\n\nf ♯ = −5J 2 on\n+ H̃ 2 ) − 2H̃ 2 with twisted superpotential W\nH\n\n4.2. M-theory transitions via topological surgery\n\nAs we have exemplified in the previous section, M-theory transitions among nonf♭ furnish a local description of M-theory conifold transitions\nf♯ and X\ncompact geometries X\namong compact Calabi–Yau fourfolds X ♯ and X ♭ . For a global conifold transition, we\nf♭ to be topologically glued to a common complef♯ and X\nenvision the local geometries X\n\nmentary space X c , so as to give rise to the global geometries X ♯ and X ♭ via topological\n\nsurgery according to\nf♯ ,\nX♯ = Xc ∪ X\n\nf♭\nX♭ = Xc ∪ X\n\nf♭ = −∂X c .\nf♯ = ∂ X\ne = ∂X\nwith ∂ X\n\n(4.13)\n\nThe structure of the participating cycles and chains along the extremal conifold transition\nare schematically depicted in Fig. 5 and are explained in detail below.\n42\n\n\ff♯\nX\n1 holom.\n4 cycle S ♯\n\n2g\n3 cycles Σn\n\n/\n\no\n\ntransition\n\nX♯ o\n\n⊂\n\n/ X♭\n\n(2g−3)\n4 cycles Bl♭\n\n1 holom.\n4 cycle S ♯\n\nhom.\n\n(2g−b̃3 )\n\n◗◗◗ relations\n◗◗◗\n◗◗◗\n◗◗◗\n◗◗(\n\nbs♯\n4 chains C\n\no\n\ntransition\n\n/\n\n(2g−3)\n4 cycles Bl♭\n\no\n\n(2g−b̃3 )\n4 cycles Cs♭\n\nO\n\nPoincaré duality\n\n\u000f\n\nb̃3\n3 cycles Σ♯k\n\n(2g−b̃3 )\n4 cycles A♭s\n\nO\n\n\u000f\n\no\n\no\n\n6\n♠♠♠\n\n2g\n4 cycles A♭n\n\nhom.♠♠♠♠\n\nPoincaré duality\nb̃3\n5 cycles Π♯k\n\nf♭\nX\n\n⊃\n\ntransition\n\n/\n\nb̃3\nb♭k\n5 chains Π\n\n♠\n♠♠♠relations\n♠♠♠\n\nFig. 5. The diagram summarizes the topological properties of the conifold transition between the compact fourfold X ♯ and X ♭ . It shows the\nf♯ and\nhomological structure of cycles inherited from the local fourfold X\nf♭ and their resulting homological relations in the embedding compact\nX\nCalabi–Yau fourfolds.\n\nf♯ ⊂ X ♯ represents\nIn the compact Kähler fourfold X ♯ the algebraic four-cycle S ♯ ⊂ X\n\na non-trivial class in H4 (X ♯ , Z). In addition, there are 0 ≤ b̃3 ≤ 2g three cycle classes\ne Z) together\nΣ♯ , k = 1, . . . , b̃3 , arising from the 2g non-torsion three-cycles Σn in H3 (∂X,\nk\n\nwith (2g − b̃3 ) relations in homology. These relations are geometrically realized by (2g − b̃3 )\nS\nbs♯ , s = 1, . . . , 2g − b̃3 , with ∂ C\nbs♯ ⊂ (\nfour-chains, C\nn Σn ). Finally, the cycle classes in\n\nH5 (X ♯ , Z), which are Poincaré dual to the non-trivial three cycles Σ♯k , are denoted by\nΠ♯k , k = 1, . . . , b̃3 .\n\nAs we go through the conifold transition to the fourfold X ♭ , the algebraic four-cycle\nS ♯ disappears, and instead we obtain (2g − 3) new four-cycle classes Bl♭ , l = 1, . . . , 2g −\nf♭ , Z). Furthermore, all\n3, which correspond to the local B-cycle classes (3.17) in H (X\n4\n\nf♭ (because\ne Z) become homologically trivial in X\nthe three-cycles classes Σn ∈ H3 (∂X,\nf♭ , Z) ≃ 0). Thus, there are (2g − b̃ ) three cycle classes in H (∂ X,\ne Z) that are\nH3 ( X\n3\n3\nf♭ , Z). Then – due to the long exact homology sequence\ntrivial in both H (X c , Z) and H (X\n3\n\n3\n\nf♭ , Z) → . . . – we find that there\ne Z) → H3 (X c , Z) ⊕ H3 (X\n. . . → H4 (X ♭ , Z) → H3 (∂ X,\n43\n\n\fare (2g − b̃3 ) non-trivial four-cycle classes, Cs♭ , s = 1, . . . , 2g − b̃3 , in H4 (X ♭ , Z), which\nb♯ . The Poincaré dual\nin the transition come from closing off the (2g − b̃3 ) four-chains C\ns\n\nfour-cycle classes to\n\nCs♭\n\ncorrespond to appropriate (linear combinations of) four-cycles,\n\nA♭s , s = 1, . . . , 2g − b̃3 , of the 2g local four-cycles A♭n , n = 1, . . . , 2g, in eq. (3.17), while\n\nthe remaining local A-type cycles become trivial in the global geometry X ♭ , as they are\nb ♭ , k = 1, . . . , b̃3 . These chains come from the five cycles Π♯ ,\nbounded by b̃3 five chains Π\nk\n\nk\n\nwhich open up as we go through the conifold transition.\n\n4.3. M-theory transitions via the Clemens–Schmid exact sequence\nWe will now compare the topology and Hodge structures on X ♯ and X ♭ using the\nClemens–Schmid exact sequence, which is reviewed in Appendix D.1 and demonstrated\nfor Calabi–Yau threefold conifold transitions in Appendix D.2. To apply this to our fourfold extremal transition, we must first construct a semistable degeneration. Here, such a\ndegeneration is a certain (smooth) fibration of Calabi–Yau fourfolds over a disk ∆, where\na normal-crossing component of the singular central fiber is birational equivalent to the\nresolved fourfold X ♯ , while the non-central (smooth) fourfold fibers describe the deformed\nCalabi–Yau fourfold X ♭ . With the constructed semistable degeneration the Clemens–\nSchmid exact sequence allows us to calculate the change in Hodge structure as we go\nthrough the extremal fourfold transition. The details of this computation are relegated to\nAppendix D.3, and we now summarize the result of this analysis.\nBy transitioning from the central fiber of the constructed semi-stable degeneration (D.10) to deformed Calabi–Yau geometry X ♭ of the generic smooth fiber, we arrive\nat the Hodge diamond (D.14) of the fourfold X ♭ :\n1\n0\n\n0\n1,1\n\nhX ♯ − 1\n\n0\n2,1\n\ndim H p,q (X ♭ ) =\n\n3,1\n\n2,1\n2,2\n\n2,1\n\n2,1\n\n2,1\n\n3,1\n\n2,1\n\nhX ♯ − h̃\n\n2,1\n1,1\nhX ♯\n\n0\n\n0\nhX ♯ − h̃ +g\n\n2,1\n\nhX ♯ − h̃\n\n0\n\n2,1\n\nhX ♯ − 2h̃ +4g − 4\n\nhX ♯ − h̃ +g\n\n1\n\n2,1\n\nhX ♯ − h̃\n\nhX ♯ − h̃\n\n0\n\n0\n\n2,1\n\n−1\n\n0\n\n1\n0\n\n0\n0\n\n1\n\n(4.14)\n44\n\n\fHere we express the Hodge diamond of X ♭ in terms of the Hodge numbers hp,q\nof the\nX♯\nresolved Calabi–Yau fourfold X ♯ . The number h̃2,1 refers to the number of harmonic (2, 1)forms participating in the extremal transition. They are in the image of the canonical map\nH 2,1 (X ♯ ) → H 2,1 (S ♯ ) and therefore disappear with the cycle S ♯ , as we go through the\nextremal transition form X ♯ to X ♭ . By comparing with the topological properties of the\nconifold transition we can now also identify the number b̃3 of non-trivial three-cycles Σ♯k\nof X ♯ in Fig. 5 with the number h̃2,1 of participating (2, 1)-forms according to\nb̃3 = h̃2,1 + h̃1,2 = 2 h̃2,1 .\n\n(4.15)\n\nFurthermore, we can associate the remaining (h2,1\n− h̃2,1 ) three-forms as part of the comX♯\nplementary space X c (c.f., eq. (4.13)). Hence, they arise as non-trivial three-forms in both\nfourfold geometries X ♭ and X ♯ . Finally, we note that the determined Hodge diamond\n(4.14) yields the characteristic change of Hodge numbers advertised in eqs. (2.5).\n4.4. G-flux quantization condition\nIn the following we consider the change of G-flux quantization during an extremal\ntransition X ♯ to X ♭ , where the four-cycle S ♯ with self-intersection S ♯ .S ♯ = 2 − 2g < 0\nshrinks and disappears from H4 (X ♯ , Z).27 The algebraic cycle S ♯ need not be a generator of\nthe homology lattice H4 (X ♯ , Z), but instead it could be homologous to a linear combination\nof generators of H4 (X ♯ , Z). However, for the considered transition S ♯ is the only fourcycle vanishing in the resolved geometry X ♯ (see Fig. 5). As a result, for the extremal\n♯\n♯\nwith S ♯ ∼ l S1/l\ntransitions under consideration S ♯ can only be a multiple of generator S1/l\n\nin homology. As result the self-intersection of S ♯ must factor as 2 − 2g = l2 m, and we have\n♯\n♯\n= m. Furthermore, as the intersection pairing of H4 (X ♯ , Z)\n.S1/l\nintersection numbers S1/l\n♯\n= 1, and we can write the dual\nis unimodular, there is always a dual cycle T ♯ with T ♯ .S1/l\n\nintegral four-form as\n[T ♯ ] =\n\n1\n([S ♯ ] + Θ) ∈ H 4 (X ♯ , Z) ,\nm 1/l\n\n(4.16)\n\nwhere Θ is a four-form such that [T ♯ ] is integral. Firstly, Θ is integral itself because\nR\n♯\n♯\nbecause S ♯ [T ♯ ] =\n] are integral. Secondly, Θ is orthogonal to S1/l\nboth m[T ♯ ] and [S1/l\n1/l\n\n♯\n= 1.\nT ♯ .S1/l\n27\n\nFor a discussion of the quantization condition in F-theory on elliptic fibrations, see\n\nrefs. [49,54,20,55].\n\n45\n\n\fIn order to determine consistent G-flux, we need to look at the second Chern class of\n♯\n\nX . The second Chern class of X ♯ takes the following form\n♯\n] − l Θ + ∆c2 ,\nc2 (X ♯ ) = −l m [T ♯ ] + ∆c2 = −l [S1/l\n\nwhere the integral piece ∆c2 must be orthogonal to S ♯ to yield\n\nR\n\nc (X\nS♯ 2\n♯\n\n(4.17)\n♯\n\n)=\n\nR\n\n2g − 2 in agreement with eq. (3.12). Then we make for the G-flux G the ansatz\nG♯\n∆G\n= κ [T ♯ ] +\n,\n2π\n2π\n\nf♯ ) =\n\nc (X\nS♯ 2\n\nκ∈Z,\n\n(4.18)\n\nwith ∆G orthogonal to T ♯ such that the quantization condition (2.1) is fulfilled. Note that\nκ is integrally quantized because l m in eq. (4.17) is even.\nf♯ the cycle T ♯ reduces to l copies of the non-compact cycles\nIn the local geometry X\n\n(3.26). Therefore, the flux G♯ corresponds to the local torsion class k ♯ = κ l, whereas the\nf♯ . As a\nflux ∆G is attributed to the complement X c of the non-compact local geometry X\n\nside remark, we observe here that the global embedding geometry X ♯ restricts the globally\npossible torsion classes to multiples of l where l must obey l2 | χ(C).\n\nAs we go through the extremal transition to X ♭ the second Chern class (4.17) becomes\nc2 (X ♭ ) = −l Θ + ∆c2 ,\n\n(4.19)\n\nbecause the contributions Θ and ∆c2 are associated to the complementary geometry X c ,\nand, as we transition to X ♭ , we (generically) do not generate any new holomorphic fourforms that could contribute to the the second Chern class c2 (X ♭ ). As a check we find\nthat\n\nZ\n\nX♭\n\nc22 (X ♭ )\n\n−\n\nZ\n\nwhich, according to ref. [28], agrees with\n\nX♯\n\nδχ\n3\n\nc22 (X ♯ ) = 2g − 2 ,\n=\n\nχ(X ♯ )\n3\n\n−\n\n(4.20)\n\nχ(X ♭ )\n.\n3\n\nSimilarly, the flux ∆G just carries over to X ♭ , and we arrive at the G-flux\nG♭\n∆G\nG♭\n= 0+\n.\n2π\n2π\n2π\n\n(4.21)\n\nFor the four-form flux G♭0 , we make the ansatz\n\u0011\nG♭0\n1\u0010 ♭\n[T+ ] − [T−♭ ] ,\n=\n2π\n2\n46\n\n(4.22)\n\n\fwith the four-forms\n[T±♭ ]\n\n1\n=\nm\n\n\u0012\n\u0012\n\u0013 \u0013\nlm\n♭\n±[B ] +\n±κ Θ .\n2\n\n(4.23)\n\nf♭ and is chosen such that the four-forms [T ♭ ]\nHere [B♭ ] arises from the local geometry X\n±\n\nbecome integral.28\n\nAs T±♭ is integral, we note that the quantization condition (2.1) is fulfilled\nc2 (X ♭ )\nG♭0\n−\n= [T+♭ ] +\n2π\n2\n\n\u0012\n\n∆G\n− ∆c2\n2\n\n\u0013\n\n∈ H 4 (X ♭ , Z) .\n\n(4.24)\n\nFurthermore, the flux (4.22) arises from the flux component κ[T ♯ ] in eq. (4.18), as both\nG-fluxes (4.18) and (4.21) have the (fractional) four-form part\nDue to the flux contribution\n\n2\n♭\nm [B ],\n\nκ\nmΘ\n\nin common.\n\nf♭\nthe G-flux G♭0 becomes in the local geometry X\n\nthe local flux (3.34). Requiring that the four-forms [T±♭ ] are integral, does not entirely fix\nthe four-form component [B♭ ]. Its structure, however, is constraint by the local tadpole\ncondition (3.36) examined in detail in Section 3. In particular, requiring no change in the\nnumber of space-time filling M2 branes along the transition, we get further constraints on\nthe choice of [B♭ ].\n4.5. Non-Abelian gauge groups and relation to F-theory\nThe topology changing transitions considered in the previous sections proceed via Higgsing of a U (1) factor in the gauge group, with the gauge field arising from the three-form\nreduced on the P1 fiber over the curve C on the resolved side. This can be generalized in a\nstraightforward way to phase transitions that involve singularities with several intersecting\nP1 , leading to non-Abelian gauge groups with various matter representations.29\nA comprehensive study of the relevant fourfold singularities in the context of F-theory\nand twisted 8-dimensional SYM has appeared in refs. [17,18,19]. The essential local geometry is that of an ADE singularity (possibly with monodromy) over a surface SG ∈ X ♯ ,\nwhich is enhanced over a matter curve C ⊂ SG . For the F-theory compactification on\n28\n\nUsing long exact Mayer-Vietoris singular homology sequences for the topological surgeries\n\nf♭ , we can argue that we can always find a form B♭ such that T±♭\nf♯ and X ♭ = X c ∪ X\nX = Xc ∪ X\n♯\n\nbecomes integral.\n29\n\nParallel discussions for the case of Calabi–Yau threefold singularities can be found e.g. in\n\nrefs. [4,5,56,57,58,59,10]\n\n47\n\n\fa fourfold X to four dimensions, X has to be elliptically fibered and this is related to\nM-theory on X by S 1 compactification. The existence of an elliptic fibration in the compactification of the normal bundle to SG restricts the possible gauge and matter content,30\nbut is otherwise inessential to the local analysis of the gauge theory engineered by the\nlocal singularity. The results of our M-theory analysis is therefore slightly more general,\nbut directly applicable to the F-theory compactification to four dimensions, if the 3d spectrum fulfills the four-dimensional anomaly constraints and an elliptic fibration exists. In\nparticular the M-theory picture must reproduce the results of refs. [17,18] in this case and\nwe will indeed see explicitly in Section 5 that this is the case for the spectrum obtained\nfrom a topological twist in M-theory.\nAs discussed above, a topological transition to a deformed manifold X ♭ in the presence\nof consistently quantized fluxes describes a motion along a flat direction in the parameter\nspace of the non-Abelian space-time gauge theory associated with this local geometry.\nAlternatively, this can be viewed as a microscopic engineering of a G bundle over the\nsurface SG in the internal Calabi–Yau space.\nAs is clear from the analysis of [17,18], the spectrum and the superpotential couplings\nwill depend very much on the details of a concrete geometry, and in particular on the\nchoice of quantized G-flux, which captures topological data of the gauge bundle on SG\nin the F-theory picture. Instead of trying to be general we restrict here to illustrate the\napplication of the results of the M-theory analysis on topological transitions in a simple\nnon-Abelian example.\nOur non-Abelian example is a SU (6) gauge theory that repoduces the sextic compactification of Section 4.1 as the end point of a chain of topology changing transitions. For\nthe engineering of the SU (6) gauge group, we need an A5 surface singularity with local\nequation\nxy + z 6 = 0 .\n\n(4.25)\n\nThe engineering of global elliptic fibrations with the appropriate singularities is wellunderstood, but the requirement of X being elliptic leads to slightly more complicated\ngeometries then needed for our purposes. To study the 3d physics associated with the\ntransition it suffices to study the case without elliptic fibration. Since the difference is not\n30\n\nAs is expected from the fact that the constraints from four-dimensional anomalies are more\n\nrestrictive then those from Z2 anomalies in three dimensions.\n\n48\n\n\fessential for the local physics we will anyway often comment on the F-theory picture and\nheavily borrow from the results of [17,18].31\nTo make contact with the sextic example, we identify x and z with the homogeneous\ncoordinates x5 , x6 on P6 and y with a degree 5 polynomial p5 (xi ) depending only on the\nother coordinates xi , i = 1, ..., 4. Equation (4.25) then describes an A5 singularity over a\nquintic hypersurface SG : p5 (xi ) = 0 in P3 (x1 , x2 , x3 , x4 ) with Hodge numbers\nh0,0 (SG ) = 1 ,\n\nh1,0 (SG ) = 0 ,\n\nh1,1 (SG ) = 45 ,\n\nh2,0 (SG ) = 4 ,\n\nχ(SG ) = 55 . (4.26)\n\nMore generally, an Ak−1 singularity over SG gives rise to a G = SU (k) gauge theory\nin 3d with h2,0 = 4 chiral multiplets in the adjoint representation [60][17]. Adding additional monomials allowed for the general sextic in P6 (x1 , ..., x6) to (4.25) describes (partial)\nresolutions of the singularity with k ≤ 5. As a concrete model we consider a chain of hypersurfaces Xk , k = 0, ..., 6 that arise as the zero of the polynomial\nPk =\n\nX\n\n(b)\np6−a−b xb5 xa6\n\nk\nY\n\na+n(b−1)\n\nx6+n\n\n,\n\n(4.27)\n\nn=1\n\na,b\n\nin the toric ambient spaces P[∆k ] with homogeneous coordinates xi , i = 1, ..., 6 + k. The\ntoric ambient spaces P[∆k ] describe a k-fold blow up of P6 and can be described as in\n[61,62] by a series of polyhedra ∆k , k = 0, . . . , 6, specified by the vertices of the dual\n∗\npolyhedra ∆∗k = {ν0∗ , . . . ν6+k\n}:\n\nν0∗\n0 0\n∗\nν1 −1 −1\nν2∗\n1 0\n∗\n0 1\nν3\n∗\nν4\n0 0\n∗\n0 0\nν5\n∗\nν6\n0 0\n\n∆∗0\n0 0 0\n−1 −1 −1\n0 0 0\n0 0 0\n1 0 0\n0 1 0\n0 0 1\n\nThe vertices νi∗ fulfill the relations\n\nν7∗\nν8∗\nν9∗\n∗\nν10\n∗\nν11\n∗\nν12\nP\n\nvertices\n0\n1\n0\n2\n0\n3\n0\n4\n0\n5\n0\n6\n\n1\n1\n1\n1\n1\n1\n(4.28)\n\nlia νi∗ = 0 with\n\nl1 = (−6, 1, 1, 1, 1, 1, 1, 06) ,\n31\n\n0\n0\n0\n0\n0\n0\n\nBlowup\n0\n0\n0\n0\n0\n0\n\nl2 = (−1, 0, 0, 0, 0, 1, 1, −1, 05) ,\n\n(4.29)\n\nIt is self-evident, that the Coulomb branches of the resolved singularities can arise in F-theory\n\nonly after compactification on S 1 .\n\n49\n\n\fand lia = −2δa+4,i + δa+4,i−1 + δa+4,i+1 for a = 3, ..., 6. Appropriate linear combinations\nof the la define a phase in the Kähler moduli space of the toric hypersurfaces [34,62].\n(l)\n\nThe sections pk in (4.27) are generic degree k polynomials in the coordinates xi ,\n(1)\n\ni = 1, ..., 4 and the defining quintic polynomial of SG is p5\n\n= 0. The coefficients of the\n\nhomogeneous monomials in Pk parameterize the complex structure moduli space of the\nCalabi–Yau fourfolds Xk with independent Hodge numbers h2,1 (Xk ) = 0 and\n\nCY4\nX0\nX1\nX2\nX3\nX4\nX5\nX6\n\n1,1\n\nh\n\n1\n2\n3\n4\n5\n6\n6\n\nHodge\nh3,1\n426\n350\n299\n268\n252\n246\n246\n\nnumbers\nh3,1\nh2,2\nnp\n(0) 1 752\n(0) 1 452\n(4) 1 252\n(8) 1 132\n(12) 1 072\n(16) 1 052\n(20) 1 052\n\nEuler characteristic Singularity structure\nχ\nmod 24\nC\ng(C)\nSG\n2 610\n18\n2 160\n0\nA0\n76\n1 860\n12\nA2\n51\nA1\n1 680\n0\nA3\n31\nA2\n1 590\n6\nA4\n16\nA3\n1 560\n0\nA5\n6\nA4\n1 560\n0\nA5\n\n(4.30)\n\nFor each of this partial resolutions with 2 ≤ k ≤ 5, there is an Ak singularity over SG ⊂\nXk+1 with local equation\n(1)\n\n(0)\n\n(0)\n\nx5 p5 + xk+1\np5−(k+1) = 0 .\np6−(k+1) + xk+2\n6\n6\n\n(4.31)\n\nAs specified in the rightmost column, this singularity enhances over the genus g matter\n(1)\n\n(0)\n\ncurve Xk+1 ⊃ Ck+1 : p5 = 0 = p6−(k+1) to Ak+1 . The Euler characteristic and genus of\nthe complete intersection curves Ck+1 are\nχ(Ck+1 ) = −5(5 − k)(6 − k) ,\n\n\u0013\n\u0012\n6−k\n+1 ,\ng(Ck+1 ) = 5 *\n2\n\nk = 0, . . . , 4 .\n\n(4.32)\n\nThe enhancement of the singularity on C gives rise to matter in the fundamental representation of G [6,57,17]. As alluded to above, the local geometry is almost identical to the\nmatter curves representing intersecting 7-branes in an F-theory compactification, except\nfor the absence of a global elliptic fibration. The topological twist and the spectrum for this\nlocal geometry has been computed in ref. [17], and is reproduced by the results reported\nin Sections 5.3 and 5.5.\nIn the M-theory compactification on Xk , a generic point in the Kähler moduli corresponds naively to a Coulomb branch of G, where the gauge symmetry is broken to\n50\n\n\fG = U (1)rk G . Moreover there is a common bare mass for the fundamentals proportional\nto the volume of the single extra P1 in the resolution of the Ak singularity over Ck , which\nagain represents a Coulomb vev for the U (1) associated with the single mass parameter.\nExcept for a possible obstruction from the flux configuration, the moduli spaces of two\nmanifolds Xk+1 and Xk can be connected by a topology changing transition, where the\nextra P1 over Ck+1 ⊂ Xk+1 shrinks, each step giving rise to a local conifold transition of\nthe type described in Section 3. The change in the Hodge numbers in (4.30) in each step\nis of the expected form\n∆h1,1 = +1 ,\n\n∆h3,1 = −g ,\n\n∆h2,2 = −4(g − 1) ,\n\n∆χ = −6(g − 1) .\n\n(4.33)\n\nIn F-theory language, transitions of this type describes a process, where a stack of parallel\n7-branes is deformed to a set of intersecting branes, which recombine under addition of\nfluxes [17,21].\nThe spectrum of the 3d theory obtained from the local A5 singularity over SG in X6\nis that of an SU (6) theory with 4 adjoint chiral multiplets. Giving a vev to scalars in\nthe Cartan subalgebra breaks SU (6) → U (1)5 . There are two different types of Coulomb\nbranches depending on whether the scalars J a in the 3d vector multiplet or the scalars\nz α in the chiral multiplet get a vev. The second branch is also available in the F-theory\ncompactification (if the global embedding X would be chosen to be elliptic) and then\ndescribes a deformation of parallel 7-branes to intersecting 7-branes [17].\nIn the partial resolutions (4.30), the Cartan part of the adjoint fields correspond to\nthe non-polynomial deformations h3,1\nnp , which are frozen in the hypersurface representation\nand can not be represented by coefficients in Pk in the given representation of Xk as a\nhypersurface in P[∆k ]. The number of non-polynomial deformations h3,1\nnp in (4.30) matches\nthe number 4 * rk(G) of neutral components of the four adjoint hypermultiplets. Indeed\nthe difference in the hypersurface equations for X6 and X5 is that the 4 coefficients of the\n(0)\n\npolynomial p1\n\n∈ Γ(KSG ) are set to zero in X6 . Since the adjoint chiral multiplet are\n\nsections of the canonical bundle KSG , these coefficients should be identified with a vev\nfor the 4 chiral multiplets lying in a U (1) ⊂ SU (6) subgroup. Thus the moduli of the\nhypersurface X6 with 20 frozen deformations describes a pure 3d Coulomb-branch U (1)5\nwith vev's only of the 3d vector multiplet J a , while the transition to X5 describes moving\nfrom a pure 3d C-branch to a mixed U (1)4 × U (1)z Coulomb-branch, where the subscript\nz denotes a non-zero vev of a neutral scalar in the chiral multiplet.\n51\n\n\f(0)\n\nThe zero locus of the section p1\n\ndefines a genus six curve C5 ⊂ X5 above which the\n\nsingularity enhances to A5 ; the local deformation theory for the genus six case was one of\nthe examples treated in detail in Section 3.7. M2 Branes wrapping the extra node account\nfor the charged components of the adjoint chiral multiplets with a 3d mass proportional\nto the vev in the vector multiplet. In the F-theory context, a SU (6) stack of parallel\nD7-branes is deformed to a SU (5) stack intersected by a single brane [17].\nStarting from X5 the partial resolutions are related successively by conifold transitions\nXk+1 ≃ X ♯ → Xk ≃ X ♭ , upon condition of appropriate background flux. Some or all of\nthe Coulomb and/or Higgs branches will be lifted, depending on the choice of consistent\nG-flux and C-fields analyzed in Section 3, leading to many components of the N = 1\ndeformation space with different spectra and disconnected in the field theory limit. For a\nsuitable triangulation the charges for the toric C∗ actions encoding the Mori cone of P[∆k ]\nfor k = 5 are\nP[∆5 ] p x1\nω1 −1 1\nω2 −1 0\n0 0\nω3\nω4\n0 0\n0 0\nω5\nω6\n0 0\n\nx2\n1\n0\n0\n0\n0\n0\n\nx3\n1\n0\n0\n0\n0\n0\n\nx4 x5 x6 x7 x8 x9 x10 x11\n1 −4 0 0 0 0\n0\n1\n0\n1 0 0 0 0\n1 −1\n0\n0 0 0 0 1 −2\n1\n0\n0 0 0 1 −2\n1\n0\n0\n0 0 1 −2 1\n0\n0\n0\n0 1 −2 1 0\n0\n0\n\n(4.34)\n\nFor 1 ≤ k < 5 the toric divisors Dl : {xl = 0} are blown down for l > k + 6 and\nthe charge vectors in each step related by ω1 (Xk ) = ω1 (Xk+1 ) + ω2 (Xk+1 ), ω2 (Xk ) =\nω2 (Xk+1 ) + ω3 (Xk+1 ), ω2+α (Xk ) = ω3+α (Xk+1 ), α = 1, ..., k − 1. With these definitions,\n♯\nthe classes of the surfaces Sk+1\n⊂ Xk+1 , which are the P1 -fibrations over the curves Ck+1\n\n(3.2), are\n♯\nSk+1\n≃ (4 Dk+6 + 5 Dk+7 ) ∩ Dk+7 ⊂ Xk+1 ,\n\nk = 0, . . . , 4 .\n\n(4.35)\n\nFor k even, χ = 0 mod 24 on Xk+1 and a flux in the torsion class k ♯ = 0 gives rise\nto a flat direction for the conifold transition from Xk+1 → Xk as shown in Section 3. For\n1 < k < 4 odd, χ 6= 0 mod 24 on Xk+1 and a canonical flux solving the local quantization\ncondition is in the torsion class k ♯ = ±(g(Ck+1 ) − 1), i.e.,\n1 ♯\nG♯\n= ± [Sk+1\n],\n2π\n2\n52\n\n(4.36)\n\n\fwhich leads to the twisted superpotential\nf (Xk ) = ± 5(6 − k) J1 J2 ± nk J 2 ,\nW\n2\n4 2\n\nnk = 5(6 − k)(k − 1) ,\n\n(4.37)\n\nA full analysis of the different disconnected branches of the N = 1 deformation space,\ndistinguished by the fluxes consistent with the local quantization condition, is beyond the\nscope of this exposition. It would be interesting to work out more details for a concrete\nmodel with a phenomenological perspective. This will require also a further study of nongeneric configurations. E.g. note that if we start with zero flux on X5 and blow down\n(1)\n\n(0)\n\nthe first P1 fiber over C5 : p5 = 0 = p1 , the critical points of the superpotential on X4\ndescribe the local singularity\nX5 → X4 : xy + z 6 + p1 z 5 → xy + z 6 + p1 z 5 + p2 z 4 ,\n\n(4.38)\n\nwith p2 factorized into two linear polynomials as p2 = t1 .s1 . On this locus, the genus 16\n(1)\n\n(0)\n\ncurve X4 ⊃ C4 : p5 = 0 = p2\n\ndegenerates to two genus 6 curves intersecting each other\n\nand the original genus 6 curve. The intersection points may induce further superpotential\ncouplings, as described in [17].\n\n5. M-theory phases in the effective N = 2 three-dimensional field theory\n\nIn this section, we first review aspects of N = 2 three-dimensional U (1) gauge theories with charged matter fields. We discuss the interplay among global symmetries, phase\nstructures, Chern-Simons terms and parity anomalies of such field theories. By constructing such theories by dimensional reduction of certain five-dimensional field theories with\neight supercharges, we associate the resulting three-dimensional field theories with the analyzed conifold transitions in M-theory. While completing this manuscript, the paper [63]\nappeared, which has a certain overlap with the aspects discussed in this section.\n53\n\n\f5.1. N = 2 three-dimensional field theory\nWe briefly review a few aspects, mostly following the notation of ref. [14]. The algebra\nof three dimensional N = 2 (four supercharges) admits a U (1)R symmetry32 and a real\nμ\ncentral term Z, {Qα , Q̄β } = 2σαβ\nPμ + 2iǫαβ Z, with all other anticommutators vanishing.\n\nThe matter multiplets are in chiral33 superfields X, similar to those of 4d N = 1, [Q̄α , X] =\n0, with CPT conjugate anti-chiral superfields X̄, with [Qα , X̄] = 0.\nConsidering, say a U (1)r Abelian34 gauge theory, with vector multiplets V a ,\na = 1, . . . , r, one can form associated linear multiplets Σa = ǫαβ D̄α Dβ V a , with D2 Σa =\nD̄2 Σa = 0, i.e. the same as for a conserved current, D2 J = D̄2 J = 0. Indeed, abelian\ngauge fields lead to U (1)J global conserved currents, j μ = ǫμνρ Fνρ , that shifts the scalar\ndual of the photon, with Σ the corresponding superspace conserved current. The bottom\ncomponents of Σa are the real scalars of the Coulomb branch, Σa | = J a .35\nThe lagrangian terms involving the gauge multiplet include\nLN=2 ⊃\n\nZ\n\n\u0012\n\nkab a b\nd θ τab Σ Σ + V Ja +\nΣ V\n4π\n4\n\na\n\nb\n\na\n\n\u0013\n\n,\n\n(5.1)\n\n(summing repeated indices) where τ ∼ g −2 give the gauge kinetic terms, and kab give the\nN = 2 supersymmetric Chern-Simons terms:\n1\nkab μνρ a b\n1\na\nF b μν + 12 τab ∂μ J a ∂ μ J b +\nǫ Aμ Fνρ − 2 kac kbd τ cd J a J b . (5.2)\nLN=2 ⊃ − τab Fμν\n4\n4π\n8π\n32\n\nFor 3d, N -extended supersymmetry (2N supercharges) it's an SO(N )R symmetry.\n\n33\n\nThe terminology is in analogy with 4d, even though there is no chirality in 3d, since there is\n\nno analog of γ5 and all 3d fermions ψα are two-component. Also similar to 4d, the coupling of the\nreal scalar in the N = 2 vector multiplet (the A4 component in reducing from 4d) distinguishes\nbetween 3d chiral superfield matter in representations r vs r̄. So, much as in 4d, we can distinguish\nbetween vector-like (real or r ⊕ r̄) vs chiral matter representations in 3d N = 2 theories.\n34\n\nThe non-Abelian case is similar, since the gauge group is anyway broken to the Cartan U (1)r\n\non the Coulomb branch. We will briefly remark about the differences for the non-Abelian case.\nOne difference, for the case of non-Abelian N = 2 pure Yang-Mills, with no matter, is that\ninstantons generate a non-perturbative, runaway superpotential that lifts the Coulomb branch\n[24]. For non-Abelian gauge theories with matter, instantons have too many fermion zero modes\nto generate a superpotential, though there can be other non-perturbative effects, see e.g. [14].\n35\n\nNote that we refer to the bottom component of Σ by the roman letter J , whereas we use the\n\ncalligraphic letter J for the conserved currents.\n\n54\n\n\fThe Chern-Simons terms give masses ∼ kab to the gauge fields, and the last term in\n(5.2) give supersymmetry-preserving superpartner masses to the J a , lifting the Coulomb\nbranch. The N = 2 Chern-Simons terms in (5.1) can be expressed in terms of the \"twisted\nf (Σ) = 1 kab Σa Σb ,36 where the term in Lagrangian is\nsuperpotential\" W\n2\n\nLN=2 ⊃\n\nZ\n\nf (Σ) V a .\nd4 θ ∂a W\n\n(5.3)\n\nThe V a Ja sum in (5.1) can include both dynamical gauge fields coupled to gauge\ncurrents, and also background gauge fields coupled to any global currents; for background\ngauge fields, τai → ∞, and Σi ∼ m̃ coupling to a global symmetry gives the real mass\nR\nterm parameters, m̃. Fayet-Iliopoulous terms d4 θ ξa V a can be regarded as mixed ChernSimons couplings between the dynamical field V a and a background field Σi , ξa ∼ kai Σi .\nThe central term Z can get contributions from real mass terms or FI terms,\nZ =\n\nX\n\nqi m̃i ,\n\n(5.4)\n\ni\n\nwhere qi is the charge of the field under a global U (1)i symmetry, m̃i is the real mass that\ncan be regarded as a U (1)i background field, m̃i = Σi |, and the sum includes U (1)J , with\nmJ = ξ the FI parameter.\nThe N = 2 supersymmetric Chern-Simons term coefficients kab in (5.1) to (5.3) include\nboth classical and one-loop contributions,\ntotal\ncl\nkab\n= kab\n+\n\n1X\n(qf )a (qf )b sign(Mf ) ,\n2\n\n(5.5)\n\nf\n\nwhere f runs over all fermions, (qf )a is its charge under U (1)a and Mf is its real mass,\nincluding the contribution from the J a expectation values on the Coulomb branch, Mf =\nP\ntotal\nm̃f + a (qf )a J a . There is a quantization condition kab\n∈ Z or 12 Z.37\n36\n\nAgain, f\nW (Σ) is not a superpotential in 3d, since Σ is real, but reduces in 2d to a superpo-\n\ntential for twisted chiral superfields.\n37\n\nFor non-Abelian groups, gauge invariance quantizes k total , independent of any details. For\n\nAbelian groups, the quantization relies on having compact U (1)s, and considering the theory on\na compact spacetime X3 , with the normalization of the gauge field specified via\n\nH\n\nA ∈ 2π Z. The\n\nquantization condition depends on X3 : if X3 is restricted to be spin, as is required for compactification of M -theory (or having fermions for that matter), one gets k ∈\n\n1\n2\n\nZ; the half-integer\n\ncase is is referred to as Abelian spin-Chern-Simons [64,65]. This is similar to compactification of\nM-theory to 5d, where the spin restriction on X5 gives ctotal ∈ Z (rather than c ∈ 6Z).\n\n55\n\n\fIf the charged matter spectrum representation is vector-like, with all matter chiral\nsuperfields in real or r ⊕ r̄ representations, the induced Chern-Simons term vanishes. For\nexample, for U (1) with chiral matter of charge +1 and −1, the conjugate fields have\nopposite sign(Mf ) and make canceling contributions to (5.5). This can also be understood\nin terms of the non-renormalization theorems given in ref. [14] related to the non-coupling\nof chiral vs linear multiplets: the Chern-Simons term cannot depend on chiral multiplets, so\nit cannot depend on complex masses which is a background chiral multiplet. So vector-like\nmatter can be decoupled with arbitrarily large complex mass mC , with (5.5) unaffected. In\nthe non-Abelian case, the induced Chern-Simons term on the Coulomb branch is related to\nP\nthe cubic Casimir, essentially k = k cl + 21 f d3 (rf ) [14], where the sum runs over all chiral\n\nsuperfields. See ref. [66] for a detailed discussion and the more precise statement. The\n\nupshot is a connection between the one-loop induced Chern-Simons terms of the 3d theory\nand the 4d Tr F 3 gauge anomaly: the 3d induced Chern-Simons term vanishes precisely if\nthe matter content would be gauge anomaly free in 4d.\n5.2. Effective N = 2 field theory for M-theory on smooth fourfolds with flux\nM-theory compactified on a smooth Calabi–Yau fourfold (with or without flux) yields\nat low energies three-dimensional N = 2 – i.e., four supercharges – supergravity coupled\nto matter and vector multiplets. As shown in refs. [29,15,67], reducing eleven-dimensional\nsupergravity, along with the additional eleven-dimensional M-theory C ∧ G ∧ G and C ∧ X8\nand purely gravitational interactions, leads to the N = 2 three-dimensional supergravity\nLagrangian for the U (1)h\n\n1,1\n\nCoulomb branch moduli J a , with gauge kinetic terms and\n\nChern-Simons terms as in (5.1). In particular, three-dimensional Chern-Simons terms\narise from the reduction of the M-theory eleven-dimensional Chern-Simons term C ∧ G ∧ G\non fourfold compactifications with non-trivial four-form background fluxes G [68,67]\nZ\nG\nf\n∧ ωa ∧ ωb ,\n(5.6)\nkab = ∂a ∂b W =\nX 2π\nwhere ωa is a basis for H 1,1 (X, Z). The quantization condition is kab ∈ Z or kab ∈ Z +\n\n1\n2\n\nwhere the latter possibility is because, as discussed in the above footnote, the 3d spacetime\nis necessarily a spin manifold. In comparing with the lagrangian derived in ref. [67], we can\nrestore the three-dimensional Planck mass scale M3 ,38 and consider the low-energy, gravity\n38\n\nThe canonical scaling dimensions are assigned as ∆[z α ] =\na\n\nthe vector multiplet has ∆[J ] =\n\n∆[Aaμ ]\n\n1\n2\n\nthe free scalar field dimension,\n\n= 1, ∆[τab ] = ∆[1/e ] = −1, and ∆[f\nW ] = 2.\n2\n\n56\n\n\fdecoupling limit, M3 → ∞. For example LSUGRA\n⊂\n3d\n\nM3\n1 f2\n2 R − M3 W ,\n\nwhich decouple in this\n\nlimit. The remaining terms are the twisted superpotential Chern-Simons terms (5.6). In\naddition to the terms in ref. [67], we have the charged matter contributions, from wrapped\nM2 branes, and their superpotential interactions.\n5.3. Singularities, charged matter, and the 5d → 3d reduction\nThe smooth-fourfold theory of the previous subsection is a three dimensional abelian\ngauge theory, without charged matter. Geometric singularities are needed to obtain nonAbelian groups or charged matter. In our construction of the fourfold as coming from\na threefold that is fibered over a genus g curve C, we can take the shrinking P1 in the\nthreefold fiber to be very small compared with the curve C, i.e. writing the Kähler class\nJ = JF + JC for the sizes of the threefold fiber and the curve C, respectively, we can\nconsider the limit JF ≪ JC , which leads to the mass hierarchy M11d→5d ≫ M5d→3d . The\nthree-dimensional matter spectrum can then be analyzed by first reducing M-theory on\nthe threefold, which yields a low-energy five dimensional N = 1 (eight supercharge) theory.\nThe five dimensional gauge theory is next reduced (fibered) over the curve C to reduce to\nthe three-dimensional N = 2 (four supercharge) theory.\nLet us briefly outline how the latter reduction works, for a general five-dimensional\nN = 1 gauge theory, reduced to three dimensions on a genus g curve C. The fivedimensional theory in flat spacetime would have SO(4, 1) × SU (2)R isometry group, and\nreduction on C breaks SU (4, 1) → SO(2, 1) × U (1)L , where the eight supercharges of\nfive-dimensions transform in the (2s , ± 21 , 2) of SO(2, 1) × U (1)L × SU (2)R . Four of these\nsupercharges are preserved if the theory is twisted, modifying the U (1)L factor of the\nLorentz group to U (1)′L , with generator\nJL′ = JL + J3\nwhere JL is the 2d U (1)L generator, J3 =\n\n1\n2 σ3\n\n(5.7)\n\nis the Cartan generator of SU (2)R , and\n\nthe preserved supercharges have JL′ = 0. The four preserved supercharges have a threedimensional U (1)R symmetry, with generator given by R3d = 2JL , so the four supercharges\ntransform under SO(2, 1) × U (1)R as (2s , ±1).\nThe five-dimensional N = 1 (eight supercharge) fields are\n\n\n\nAμ\n5d-vector =  λ\nψ ,\n5d-hyper =  q+\nφR\n57\n\nψq +\nψq†−\n\n\n\n† \n,\nq−\n\n(5.8)\n\n\fwhere SU (2)R acts on the rows, with J3 = ± 12 . All 5d spinors in (5.8) reduce as ψ d=5 →\n′\n\nd=2\nd=2\nd=3\nd=2\n(ψαd=3 ⊗ ψ+\n) ⊕ (ψαd=3 ⊗ ψ−\n), where ψα=1,2\nis a two-component 3d spinor and ψ±\nis\n\na 2d spinor of U (1)L Lorentz charge JL = ± 12 .\nConsider first reducing the 5d-vector multiplet in (5.8) on C. Collecting the fields\naccording to their U (1)L′ spin (5.7), there are fields with JL′ = 0, which assemble into a\n3d N = 2 vector multiplet. There are also fields with JL′ = ±1, which assemble into a\n3d N = 2, adjoint valued chiral multiplet. Reducing on C, the U (1)L′ = 0 fields yield a\nmassless 3d, N = 2 vector multiplet, from the constant mode on C (along with a massive\ntower from the other modes of the laplacian on C). The JL′ = ±1 fields are 1-forms on\nthe curve C, e.g. Az,z̄ = A4 ± iA5 , and thus the C laplacian zero modes are given by the\ng holomorphic and g anti-holomorphic 1-forms on C. We thus obtain, in addition to the\n3d N = 2 massless vector multiplet, g additional massless, 3d N = 2 chiral multiplets,\nφi=1...g , in the adjoint representation of the gauge group G. The scalar components of\nthese g chiral multiplets φi come from the g holomorphic 1-form Az components of the\nfive dimensional gauge field on C.39 The coupling of Az to charged matter implies that\nφi have superpotential couplings to charged matter in three dimensions. For g = 1,\nthe supersymmetry is enhanced to three dimensional N = 4 and Φ is the adjoint chiral\nsuperfield of the N = 4 vector multiplet.\nNow consider reducing a five dimensional matter hypermultiplets in (5.8) on C. Collecting the fields according to their U (1)L′ spin, we find a 3d N = 2 chiral superfield, q+ ,\nin some representation r of the gauge group, with U (1)L′ spin JL′ = + 12 , and a 3d N = 2\nchiral superfield q− , in conjugate representation r of the gauge group, with U (1)L′ spin\nJL′ = 12 . Upon reducing on C, we get massless 3d chiral superfields from the zero modes\nof the two-dimensional Dirac operator on C with U (1)L′ spin ± 12 . The five-dimensional\nhypermultiplet thus reduces to massless three-dimensional chiral multiplets as:\nf =1...N+\n\n(5d − hyper) → q+\n\nf ̃=1...N−\n\n⊕ q−\n\n,\n\n(5.9)\n\nwhere N± are the numbers of U (1)L spin ± 21 fermion zero modes of the two-dimensional\nDirac operator in representation r:\nf =1...N+\n\nD\n/ 2 χ+\n39\n\nf ̃=1...N−\n\n= 0,\n\nD\n/ 2 χ−\n\n= 0.\n\nIndeed, the 2g real scalars in these multiplets are the 2g Wilson loops\n\nthe 2g one-cycles associated with the four-cycles An in Fig. 1.\n\n58\n\n(5.10)\nH\n\nαn\n\nA, where αn are\n\n\fFor example, for a U (1) gauge group and a 5d hypermultiplet of charge 1, the reduction\non a genus g curve C yields the three-dimensional spectrum given by:\n3d N = 2 multiplet\nVector multiplet V\n\nneutral chiral\nmultiplets φi\ni = 1, . . . , g\ncharged chiral\nf\nmultiplets q+\nf = 1, . . . , N+\n\n3d field\nφ\nλ0\nλ′0\nAμ\ni\nφ = Aiz\nλiz\nλiz̄\nf\nq+\nψqf+\nf\nψ ′ q+\n\nSO(2, 1)\n1\n2s\n2s\n3\n1\n2s\n2s\n1\n2s\n2s\n\nU (1)g\n0\n0\n0\n0\n0\n0\n0\n+1\n+1\n+1\n\ncharged chiral\n\nf\nq−\n\n1\n\n−1\n\n0\n\n ̃\nψqf−\nf ̃\nψ ′ q−\n\n2s\n\n−1\n\n−1\n\n2s\n\n−1\n\n1\n\n ̃\n\nf ̃\nq−\n\nmultiplets\nf ̃ = 1, . . . , N−\n\nU (1)R\n0\n+1\n−1\n0\n2\n1\n−1\n0\n−1\n1\n\n(5.11)\n\nThe multiplicities N± of the charged chiral multiplets are governed by the zero-modes\nof the two-dimensional Dirac operator on C twisted by the background flux FC . Note also\nthat the gauge covariant derivatives in (5.10) contain the gauge connection on C, so the\nfermion zero modes are affected by the expectation values of the g, gauge adjoint chiral\nmultiplets φi=1...g that came from the 5d vector multiplet. Non-zero expectation values of\n ̃\n\nf\nf\nthe φi=1...g can give 3d complex masses to pairs q+\n, q−\n. In terms of the 3d gauge theory\n\nobtained by dimensional reduction on C, this effect is accounted for by a superpotential,\nW =\n\ng N+ N−\nXX\nX\n\n ̃\n\nf i f\ncif f ̃ Tr q+\nφ q−\n\n(5.12)\n\ni=1 f =1 f ̃=1\n\nwith Tr over the gauge indices. For the case of g = 1, where supersymmetry is enhanced,\nthis is the expected superpotential of 3d N = 4 supersymmetric gauge theories. The\nconstants cif f ̃ can be determined by a topological calculation (independent of the metrics),\nas we will exhibit shortly in the connection with M-theory. The 3d complex masses obtained\nfrom (5.12) for non-zero hφi i affects the phase structure of the 3d field theory, for example\nlifting Higgs branch moduli.\n59\n\n\fWhile the solutions (5.10) and the numbers N± depend on the φi moduli, the difference\nN+ − N− is the topological index that's independent of the φi moduli (since hφi i gives\ncomplex masses to pairs, q+ and q− in pairs). This index is that of the two-dimensional\nDirac operator on C twisted by the background flux FC . In particular, for the case of a\nU (1) gauge theory,\nindex(/\nD2 ) = N+ − N− =\n\nZ\n\nC\n\nFC\n= n(1 − g) .\n2π\n\n(5.13)\n\nThe FC flux in (5.13) corresponds to a magnetic monopole and is thus quantized (see e.g.\nsection 14.4 in ref. [69]) as Aα = 12 nωα , where ωα is the U (1)L spin connection on C and\nn is an integer unit of flux. For g = 1 there is enhanced supersymmetry and the theory is\nnecessarily vector-like, fitting with the vanishing index (5.13). For g 6= 1 and n 6= 0 flux\nunits, the three-dimensional theory has chiral matter, N+ 6= N− .\n5.4. The dynamics of 3d U (1) gauge theories for general matter fields of charge ±1\nThe analysis in [14] focused on the vectorlike matter case, N+ = N− = Nf , noting the\nbranched moduli space of vacua, with the Higgs branch, and two distinct quantum Coulomb\nbranches, all meeting at the origin. We here generalize this to allow for N+ 6= N− .\nf =1...N+\n\nConsider a U (1) gauge theory with N+ chiral superfields q+\nN− chiral superfields\n\nf ̃=1...N−\nq−\n\nq+\nq−\nM\nV±\n\nof charge +1, and\n\nof charge −1. The fields and global symmetries are\n\nU (1)R\n\nU (1)J\n\nU (1)A\n\n0\n0\n0\nNf\n\n0\n0\n0\n±1\n\n1\n1\n2\n−Nf\n\nSU (N+ ) SU (N− )\nN+\n1\nN+\n1\n\n1\nN−\nN−\n1\n\n(5.14)\n\nf g̃\nq− are the N+ × N− gauge invariant mesons, and V± are chiral superfields\nwhere M f g̃ = q+\n\nlabeling the Coulomb branch, which can be obtained from Σ by dualizing the gauge field\nto a compact, real scalar. The U (1)R is an R-symmetry and we could just as well have\ne (1)R = U (1)R + rU (1)A . The charges of V±\nchosen a different basis of the U (1)s, e.g. U\n\nunder the global symmetries follow from a one-loop diagram coupling the global currents\nto the gauge fields [14], and here Nf ≡ 21 (N+ + N− ).\n\nFor N+ N− 6= 0, there is a N+ +N− −1 complex dimensional Higgs branch moduli space\nof classical vacua when Wtree = 0. The Higgs branch can be parameterized by expectation\n60\n\n\fvalues of the N− N+ meson gauge invariants, subject to their classical constraint coming\nf g̃\nfrom M f g̃ = q+\nq− :\n\nMHiggs : hM f g̃ i\n\nwith\n\nrank(M ) = 1.\n\n(5.15)\n\nThe case N+ = N− was discussed in [14,70]. As in that case, the moduli space generally\nseparates into three branches: The Higgs branch (5.15) with hJi = 0, and two distinct\nCoulomb branches, Coulomb± with hM i = 0, and sign(J) = ±1. The quantum Coulomb\nbranches are parameterized by the chiral superfields V± in (5.14).\nThe q+ and q− fields get real masses on the Coulomb branch, m̃+ + J and m̃− − J,\nrespectively, where m̃± are in the adjoint of SU (N± ) × U (1)A . For vanishing real masses,\nthe Chern-Simons term on the branch Coulomb± is given by (5.5) to be\n1\ntotal\nk±\n= k cl ± (N+ − N− )\n2\n\n(5.16)\n\nwith ± 21 (N+ − N− ) the quantum contribution from integrating out the massive fields q+\nand q− fields. When N+ 6= N− , generally k total 6= 0, lifting both Coulomb branches. It\nis possible to tune k cl to leave one of the two Coulomb branches unlifted. Note that k cl\ncancels if we consider the difference of the Chern-Simons coefficient on the two Coulomb\nbranches, which is given by the topological index:\ntotal\ntotal\nk+\n− k−\n= N+ − N− .\n\n(5.17)\n\nRecall first the case N+ = N− = Nf > 0, with kcl = 0 so the two Coulomb branches\nare unlifted and meet the Higgs branch at the origin. The theory at the origin flows to\nan interacting SCFT [14] that can be described by a dual effective theory of the gauge\ninvariant moduli fields in (5.14), with\nW = −Nf (V+ V− det M )1/Nf .\n\n(5.18)\n\nFor Nf = 1 the dual theory (5.18) is non-singular and provides a complete dual description\nof the low-energy theory and interacting SCFT at the origin. For Nf > 1, the superpotential (5.18) is singular, corresponding to the fact that additional degrees of freedom are\nneeded to describe the interacting SCFT at the origin.\nSCFTs are generic in 3d, so anything pointing toward additional degrees of freedom\nbeyond the moduli fields can be regarded as some evidence for an interacting SCFT.\n61\n\n\fIn particular, singular moduli spaces or moduli spaces with branches are some general\nevidence pointing toward an interacting SCFT at the singularity.\nLet us now discuss the N+ 6= N− cases. For kcl = 0, the Coulomb branches are lifted\ntotal\nby the Chern-Simons terms k±\n6= 0, so the moduli space consists only of the Higgs\n\nbranch (5.15). Whenever both N+ > 1 and N− > 1, the Higgs branch (5.15) is singular\nat the origin (the classical singularity can not be smoothed by quantum effects), which\nsuggests an interacting SCFT there.\nOn the other hand, for N+ > 1 and N− = 1, the N+ dimensional Higgs branch is\ni\nsmoothly parameterized by the mesons M i = q+\nq− , so it is possible that the theory with\n\nk cl = 0, and hence lifted Coulomb branches for N+ 6= 1, is an IR free smoothly confined\ntheory of the mesons M i , without additional SCFT degrees of freedom at the origin. A\nweak test of such a scenario is the Z2 parity anomaly matching [14] analog of 't Hooft\ni\nanomaly matching for the global symmetries. The microscopic fields (q+\nand q− and the\n\nU (1) multiplet) in (5.14) give kRR = 12 N+ , kRA = kAA = 12 (N+ + 1) mod integers. The\nMi low energy fields give kRR =\n\n1\nN ,\n2 +\n\nkRA = 0, kAA = 0 mod integers. So the parity\n\nanomalies involving U (1)A do not match for N+ even, suggesting again an interacting\nSCFT at the origin in that case. Only N+ odd and N− = 1 might have an IR free theory\nof mesons, rather than a SCFT.\ntotal\ntotal\nIf N+ 6= N− and k cl is tuned so that k+\nor k−\nin (5.16) vanishes, then there is\n\nan unlifted Coulomb branch, intersecting the Higgs branch (5.15) at the origin, and there\nagain we expect an interacting SCFT at the intersection point on the moduli space.\n5.5. Comparing M-theory conifold transitions with 3d field theory phase structure\nReducing M-theory on the ruled surface S ♯ – as analyzed in Section 3 – actually\nleads to two three-dimensional U (1) gauge fields, U (1)F and U (1)C , coming from reducing\nC3 on either P1 or C in (3.2). In terms of the 11 → 5 → 3 reduction, C 11d → A5d ∧\n3d\n3d\nJF + C 5d → A3d\nF ∧ JF + AC ∧ JC . The U (1)F gauge field AF comes from the five-\n\ndimensional gauge field A5d , while U (1)C comes from the five-dimensional C 5d 3-form\ngauge field. We are interested in the JF ≪ JC limit where the interesting dynamics is\nin the U (1)F gauge theory, and we can take a low-energy limit where the U (1)C gauge\ntheory essentially decouples, together with the gravity multiplet (it comes from C 5d , in\nthe five-dimensional gravity multiplet). The point is that U (1)F has light charged matter,\nfrom M2 branes wrapping the small P1 , whereas all matter charged under U (1)C is much\n62\n\n\fheavier for JC ≫ JF , as it gets a large real mass m̃ ∼ JC on the Coulomb branch. It is\nin this limit that we make contact with the three-dimensional field theory associated to\nthe spectrum (5.11). Let us know discuss how this correspondence between the M-theory\ngeometry and the discussed 3d field theory comes about.\nAs we discussed above, the numbers N± of massless 3d chiral superfields, coming from\nthe solutions of the Dirac operator zero modes (5.10), are determined by the number of\nflux units, with index given by (5.13). Lifting the 5d gauge theory results to M -theory on\nS ♯ , the background flux FC arises from integrating out the P1 -fibers. We therefore identify\nthe index (5.13) with the torsion classes in eq. (3.41)\nZ\n\nS♯\n\nG♯\n=\n2π\n\nZ\n\nC\n\nFC\n2π\n\n⇒\n\nk ♯ = k ♭ = N+ − N− = index(/\nD2 ) .\n\n(5.19)\n\nThe moduli dependence of zero modes (5.10) enters in the M-theory transition through\nthe dynamical obstructions induced form the flux superpotential (3.56). In particular, the\ndeformation sections (3.74), which are the global sections of the line bundles E± in (3.72),\nare in one-to-one correspondence with the zero mode structure of the Dirac operators\n(5.10). Identifying the U (1) line bundle L with the line bundle L in eq. (3.73) arising in the\n1/2\n\nM-theory transition and using the previous definitions E+ = KC\n\n1/2\n\n⊗ L and E+ = KC\n\n⊗ L∗\n\nin eq. (3.72), we get a 1-1 correspondence\n1:1\n\nf =1,...,N±\n\nH 0 (C, E± ) ←→ { χ±\n\n},\n\nwhich implies for the multiplicities N+ and N− of the charged chiral fields q+ and q−\nN+ = h0 (C, E+ ) ,\n\nN− = h1 (C, E− ) .\n\nAs discussed in the previous sections, interacting SCFTs are generic at the origin\nof 3d N = 2 gauge theories with non-zero matter content, and in particular occur at the\ntransition point in the moduli space between Higgs and Coulomb branches. The interacting\nSCFT at the transition point has additional degrees of freedom. In the M-theory geometry\ndescription, M2 branes give a natural source for the additional degrees of freedom. Indeed,\nthere are tensionless domain walls located at the singularity, which is another tell-tale sign\nof an interacting SCFT, where the number of M2 branes can change. This is because at\nthe origin of the Higgs branch the SU (N+ ) × SU (N− ) flavor symmetry is restored, which\n63\n\n\fimplies that there are vanishing cycles supporting tensionless domain walls with δM 6= 0\ncomputed by eq. (3.85).\nIf the 3d theory is related to a 4d theory by a circle compactification, we recover\nthe result ref. [17] in the four-dimensional theory from F-theory compactification on the\nfourfold. As in that case, the index of the charged chiral matter fields q+ and q− can be\nwritten, using Serre duality and the Riemann-Roch theorem, as\n1/2\n\nN+ − N− = h0 (C, KC\n\n1/2\n\n⊗ L) − h1 (C, KC\n\n⊗ L)\nZ\nFC\n1/2\n= (1 − g) + c1 (L ⊗ KC ) =\n.\nC\nC 2π\nZ\n\n(5.20)\n\nThe latter equality in the second line of (5.20) can again be directly understood as the\nstatement of the index theorem for the two-dimensional twisted Dirac operator (5.13).\nThe spectrum obtained form the dimensional reduction of the 5d multiplets (5.8) upon\nC and their associated geometric sections are summarized in the following table:\nfields\nSupercharge\nVector multiplet\n\nHypermultiplet\n\n′\n\n(Q, Q )\nφ\n(λ, ψ)\nAμ\nAz\n†\n(q+ , q−\n)\nψq +\nψq −\n\nSO(2, 1)\n\nU (1)L\n\nU (1)g\n\nSU (2)R\n\nsections of\n\n2s\n1\n2s\n3\n1\n1\n2s\n2s\n\n+1/2\n0\n+1/2\n0\n+1\n0\n+1/2\n+1/2\n\n0\n0\n0\n0\n0\n+1\n+1\n−1\n\n2\n1\n2\n1\n1\n2\n1\n1\n\nKC\nOC\n1/2\nKC\nOC\nKC\nL\n1/2\nKC ⊗ L\n1/2\nKC ⊗ L∗\n\n1/2\n\n(5.21)\n\nHere (Q, Q′ ) is the pair of pseudo-real spinorial supercharges of five-dimensional N = 1\nsupersymmetry. Performing the topological twist (5.7), which corresponds to tensoring\nthe sections of the fields in table (5.21) with KCJ3 according to their quantum number of\nthe Cartan generator J3 of SU (2)R , we obtain the 3d N = 2 supercharges with U (1)L′\nspin J3′ = 0 and arrive at the 3d spectrum of table (5.11).\nIn the geometry, the coefficients cif f ̃ in (5.12) are determined by the integrals\nci f f ̃ =\n\nZ\n\nC\n\n ̃\n\n(ǫf+ ǫf− ) ∧ μ̄i ,\n\n(5.22)\n\nwhere ǫ± are the sections of E± associated with the matter fields, and μ̄i the (0, 1)-form\nfor the i-th Wilson line, see eq. (4.105) in ref. [17].\n64\n\n\fWith these identifications at hand we can now compare the phase structure of the discussed 3d field theory with the local M-theory geometries of Section 3. The two resolved\nf\nf\nphases X1♯ and X2♯ map to the two Coulomb branches with sign(φ) > 0 and sign(φ) < 0.\nIndeed, as computed explicitly in Appendix B, the flop transition (3.45) induces the discontinuous jump in the Chern-Simons term according to the flux-induced twisted super-\n\npotentials integrated over the two flopped volumes (3.9) and (3.14). This matches the\nexpected jump as induced form the chiral spectrum (5.5), in agreement with (5.17)\n∆k = index(/\nD2 ) = N+ − N− .\nIn the context of both the M-theory geometry and the associated 3d field theory, the\npresence of non-vanishing Chern-Simons couplings from twisted superpotentials lift those\nbranches geometrically in the former and field theoretically the latter description.\nf♭ is identified with the Higgs branch of the 3d\nThe deformed M-theory geometry X\n\nfield theory. The dimension of this Higgs branch (5.15) agrees with the dimension of the\nunobstructed deformation space (3.75). In particular the factorized deformations ǫ = ǫ+ ǫ−\nin eq. (3.74) get mapped to the gauge invariant mesonic operators M f g̃ .\n\nLet us emphasize that this correspondence holds not only on the level of multiplicities\nand of dimensionality of moduli spaces, but also on the level of moduli spaces itself. In\nthe local M-theory transition the moduli of the background fluxes FC are mapped to the\nmoduli of the line bundle (3.73), while both in the 5d-to-3d reduction and in the geometric\nM-theory conifold transition, the moduli of the curve C enter through their dependence on\nthe structure of global sections. The underlying reason for this correspondence is that the\nAlbanese map of the ruled surface S ♯ gets identified with the Abel Jacobi map of the curve\nC [42], which in turn encods both the dynamically unobstructed deformation directions in\nSection 3 and the field-theoretic spectrum (5.11).\nAccordingly, as discussed in Section 3, non-zero C-field backgrounds correspond to\nnon-zero Wilson lines φi and also lift massless fields via the couplings (5.12),(5.22). If\nh2,1 (X ♯ ) = h2,1 (X ♭ ) = 0, all the fields φi are non-dynamical and their expectation values\nare fixed by the global embedding geometry. A very explicit example is provided by the\nhyperelliptic cases studied in Section 3.7, where a choice of half-integer C-field values corre1/2\n\nsponds to a choice of a particular spin structure KC . The latter will be fixed in a global\nembedding and in turn determine the actual number of holomorphic sections/massless\nfields given in eqs (3.84),(3.86). Similarly, the fields φi associated to (2, 1)-forms participating in the M-theory transition (c.f. eq. (4.15)) are dynamical and further reduce the\nHiggs branch dimension by their equations of motion, e.g., setting Fφi = 0.\n65\n\n\f6. Conclusions\nWe examine topological changing transition for M-theory compactification on CalabiYau fourfolds, which give rise to three-dimensional theories with four supercharges. Compared to extremal transitions of M-theory/type II string compactifications on Calabi-Yau\nthreefolds, which result in low energy effective theories with eight supercharges, a crucial\nnew ingredient emerges due to the presence of non-trivial background G-fluxes. Therefore, the central theme of this work is the interplay among the quantization conditions of\nG-fluxes, the contribution of G-fluxes to the tadpole cancellation condition and the flat\ndirections of the flux-induced scalar potential in the effective three-dimensional description.\nTo model the conifold transitions of interest, we first analyze non-compact local\nCalabi-Yau fourfolds with a genus g curve of conifold singularities. Geometrically, we\nfind three phases – two small resolutions and one deformation – that smooth the singular\nfourfold geometry.40 By including the M-theory G-flux we find a rich structure of consistent flux configurations governing the dynamics along such a conifold transition. The\nflux configurations at the boundary constrains and determines the dynamics in the interior. We argue that finding the flat directions of the flux-induced superpotential in the\nM-theory description is mapped to the classical problem of studying global holomorphic\nsections of divisors on Riemann surfaces: Namely, the canonical line bundle of the genus\ng curve factorizes into the two line bundles E± as determined by the background G-flux\ndata. The global holomorphic sections of the factors E± then give rise to flat directions of\nthe flux-induced superpotential. We illustrate our findings for particular curves of genus\ng (mainly for hyperelliptic curves), but as our result holds more generally, it would be\ninteresting to apply our techniques so as to study linear systems of line bundles on generic\nRiemann surfaces.\nThe geometrically derived factorization condition enjoys a beautiful interpretation\nin the associated three-dimensional U (1) gauge theory. The M-theory phase structure\nmatches with the phase structure of such gauge theories, i.e., the two resolved phases\ncorrespond to the two Coulomb branches whereas the deformed phase maps to a Higgs\nbranch. Moreover, the global sections of the factored bundles E± are in one-to-one correspondence with the ±1 charged chiral spectrum of the U (1) gauge theory. The products\n40\n\nNote the interesting distinction from the familiar case of type II string theories on a Calabi–\n\nYau threefold: in that case, the two small resolutions unify into a single branch of the moduli\nspace [32].\n\n66\n\n\fof such sections – realizing the flat directions of M-theory in the deformed phase – correspond in the field theory to gauge invariant mesonic condensates, which parametrize the\nHiggs branch of the three-dimensional U (1) gauge theory. Moreover, in the two Coulomb\nbranches these charged multiplets become massive, they are integrated out and generate\n(for a non-vanishing index of the chiral spectrum) a Chern-Simons coupling at one loop.\nWe demonstrate that the characteristic structure of such one-loop Chern-Simons terms is\nreproduced by the M-theory phases attributed to the two small resolutions.\nAt the transition point itself, the structure of the global symmetries together with\ntheir anomaly structure of the U (1) gauge theory signal the emergence of new degrees of\nfreedom giving evidence for a non-trivially interacting three-dimensional N = 2 SCFT.\nClearly, it would be interesting to further investigate such a N = 2 SCFT at the transition\npoint. To make direct contact with the M-theory description we believe that a detailed\nanalysis of the quantum effects is necessary.\nBy embedding the local Calabi-Yau fourfold geometries into compact Calabi-Yau fourfolds, we realize conifold extremal transitions in the context of global M-theory compactification. A consistent choice of G-flux also specifies the boundary conditions of the associated\nlocal M-theory geometry. The quantization condition imposed by the global Calabi-Yau\nfourfold imposes further constraints on the possible realization of G-flux in the local Mtheory geometries. In order to realize a dynamically unobstructed conifold transition in\nthis global setting, we find a consistently quantized background G-flux of \"mixed type\".\nAs explained, these flux backgrounds of mixed type include G-flux quanta, which reside\nin both the vertical and horizontal cohomology of the Calabi-Yau fourfold. Such G-flux\nconfigurations reflect the factorization condition discovered for flat directions in the local\nCalabi-Yau fourfold transitions. In the global fourfold the factorization condition signals\nthe appearance of non-generic algebraic four-cycle supported with G-flux and extremizing\nthe flux-induced superpotential.\nThe class of local geometries for the conifold transitions studied here comprises geometries of \"matter curves\" in gauge theories from F-theory, studied in depth in refs. [17,18,19].\nThe local solutions to the quantization and flatness conditions for the G flux (potential)\nencountered in our M-theory analysis thus carry over to solutions for the 7-brane dynamics\nin F-theory compactifications, provided the 3d spectrum is anomaly free in the 4d sense\nand the normal bundle allows for an elliptic fibration. The extension to non-Abelian SU (n)\ngauge theories is demonstrated at the hand of an explicit example of a chain of topologically distinct fourfolds with An−1 surface singularities, connected by extremal conifold\n67\n\n\ftransitions along curves of varying genera. We discuss consistency of G-fluxes for the individual fourfolds in the transition chain, but we do not examine the implications of the\nflux-induced potentials at the level of the underlying non-Abelian phase structure, and we\nhope to return to this analysis elsewhere.\nThe M-theory analysis again parallels the F-theory discussion in [17,18] and we hope\nthe results on the M-theory classification of consistent fluxes and the flat directions of their\npotential also prove useful in the context of F-theory in the future.\nA somewhat curious observation that deserves further study is the relation between\nthree different objects, namely the phase transitions in (possibly interacting superconformal) 3d field theory on one hand, the fluxes for the associated extremal fourfold transition consistent with the local quantization condition on the other hand, and finally\nthe close connection of these fluxes to 2d Kazama-Suzuki models based on the group\nG = SU (M )/(SU (M − l) × SU (l) × U (1)) described in refs. [15,35]. In the present context, M = 2g − 2 was related to the genus g of the curve C of conifold singularities and the\ninteger l = ||k ♯ | − (g − 1)| is related to the index k ♯ of the 3d field theory. This connection\nmight be interesting from the point of a possible group theoretical classification of the\ncomponents of the vacuum space as well as for a better understanding of the field theory\nspectrum at the 3d conformal fixed points.\n\nAcknowledgements:\nWe would like to thank Mina Aganagic, Murad Alim, Andrés Collinucci, Thomas Grimm,\nSergei Gukov, Jonathan Heckman, Christoph Mayrhofer, Sakura Schäfer-Nameki, and\nTimo Weigand for useful discussions and correspondence. H.J. and D.R.M. would like\nto thank Arnold Sommerfeld Center of the LMU Munich, the Banff International Research Station, and the Simons Center for Geometry and Physics for hospitality at various\nstages of this project. H.J. would also like to thank the Kavli Institute for Theoretical\nPhysics, where this project was initiated; D.R.M. would also like to thank the Aspen\nCenter for Physics for hospitality. K.I. is supported in part by DOE-FG03-97ER40546.\nH.J. is supported by the DFG grant KL 2271/1-1. P.M. is supported by the program\n\"Origin and Structure of the Universe\" of the German Excellence Initiative and the\nDeutsche Forschungsgemeinschaft. D.R.M. is supported in part by NSF Grant DMS1007414. M.R.P. is supported in part by NSF Grant DMS-0606578.\n68\n\n\fAppendix A. Calabi–Yau fourfolds and collection of (co)homology data\nIn this appendix we collect some information on the cohomology groups of the global and\nlocal fourfolds used in the text.\nHodge numbers\nA compact Calabi–Yau fourfold X has Hodge numbers hp,q satisfying the usual Hodge\nsymmetry hq,p = hp,q , Poincaré duality hn−p,n−q = hp,q and the Calabi–Yau condition\nh0,0 = h4,0 = 1, h1,0 = h2,0 = h3,0 = 0. This apparently leaves four independent Hodge\nnumbers h1,1 , h2,1 , h3,1 , and h2,2 , but as shown in [28] they are not independent:\n−h1,1 + h2,1 − h3,1 = 8 −\n−2h2,1 + h2,2 = 12 +\n\nχ\n6\n\n2χ\n3\n\n(where χ is the Euler characteristic of X), from which it follows that\nh2,2 = 44 + 4h1,1 − 2h2,1 + 4h3,1 .\nThe Kähler form J of the Calabi–Yau fourfold also determines a Lefschetz decomposition of the cohomology. The second cohomology has a one-dimensional imprimitive\npart spanned by [J] and the orthogonal complement (J 3 )⊥ ⊂ H 2 (X) is the primitive part\n2\nHprim\n(X). The fourth cohomology has two imprimitive parts: one spanned by [J 2 ] and\n2\nthe other of the form J ∧ Hprim\n(X).\n\nHomology four-cycles and H 4 (X, Z): global case\nFor a compact Calabi–Yau fourfold X, Poincaré duality asserts that if Ei is a basis of fourcycles for H4 (X, Z), then there exists another basis of four-cycles Ei∗ such that Ei ∩ Ej∗ =\nδij . Thus H 4 (X, Z) ≃ H4 (X, Z) is an unimodular lattice of rank b4 = 2 + 2h1,3 + h2,2 . The\nsignature of the lattice is the pair (n+ , n− ), with the (anti-)self-dual forms contributing\nto the positive (negative) part of dimension n+ (n− ). From the Hodge index theorem\n(working over C), the forms of type (4,0) and (0,4) and primitive (2,2)-forms contribute to\nn+ , forms of type (3,1) and (1,3) to n− . Of the imprimitive (2,2) forms, those coming from\n1,1\nJ ∧ Hprim\n(a space of dimension h1,1 − 1) contribute to n− while the form J 2 contributes\n\n1 to n+ . Putting these together, we find\n(n+ , n− ) = (2 + h2,2 − (h1,1 − 1), 2h3,1 + (h1,1 − 1)).\n69\n\n\fOn the other hand, from the Hirzebruch signature theorem it follows that [15]\nσ = n+ − n− = 8(\n\nχ\n+ 4),\n24\n\n(A.1)\n\nwhich also follows from the relations above:\nn+ − n− = 4 + h2,2 − 2h1,1 − 2h3,1 = 48 + 2h1,1 − 2h2,1 + 2h3,1 = 32 +\n\nχ\n.\n3\n\nIf c2 (X) is even, H 4 (X, Z) is even [16], and the lattice Γn+ ,n− ≃ H 4 (X, Z) is unique\nup to isometry [71], with inner product\n(e∗i , e∗j )\n\n≃ H\n\n⊕\n\nb4 −σ\n2\n\n⊕\n\n⊕σ\nE8 8\n\n,\n\nH=\n\n\u0012\n\n0\n1\n\n1\n0\n\n\u0013\n\n.\n\n(A.2)\n\nHere E8 denotes the Cartan matrix of E8 and we write the formula for σ > 0, with the\nobvious changes for σ < 0. If c2 (X) is odd, then H 4 (X, Z) is odd [16] and the lattice is\nagain unique up to isometry [71], this time taking the form\n(e∗i , e∗j ) ≃ (1)⊕n+ ⊕ (−1)⊕n− .\n\n(A.3)\n\nVertical and horizontal cohomology\nSlightly modifying the construction in [72,73,30], we decompose the even cohomology of X\ninto \"vertical\" and \"horizontal\" parts. The vertical cohomology is the subring of H ∗ (X, Z)\ngenerated by H 2 (X, Z). That is, the vertical cohomology consists of all linear combinations\nof expressions Ji1 ∧ * * * ∧ Jik for integral Kähler classes Jiα . These classes are always of\ntype (k, k), no matter what complex structure is chosen on X, and can be thought of as\n\"complete intersections\" of divisors on X.\nOn the other hand, the horizontal cohomology is the subset of H 4 (X, Z) which is\northogonal to Ji ∧ Jj for every pair of Kähler classes Ji and Jj . These classes are always\nprimitive, no matter what Kähler structure is chosen on X.\nFinding appropriate supersymmetric four-cycles to represent a given integral cycle\nclass is a challenging problem. When the class has type (2,2), the celebrated Hodge\nconjecture asserts that there should be an algebraic cycle representing the class (which\nwould provide a supersymmetric cycle). A class which is not in the vertical cohomology\ncan only be of type (2,2) for a proper subset of the complex structures on X.\nOn the other hand, when the class is primitive, it has all of the cohomological properties one expects of a special Lagrangian cycle (although unfortunately we have no general\n70\n\n\fexistence results which would guarantee that it is a special Lagrangian cycle. A special\nLagrangian representative would be supersymmetric. Note that a class which is not in the\nhorizontal cohomology can only satisfy this primitivity assumption (the \"cohomological\nspecial Lagrangian\" assumption) for a proper subset of the Kähler structures on X.\nThere is a third possibility for a supersymmetric representative, described in [30]:\nthere could be a representative for the cohomology class which is a Cayley cycle, which\nwould give a 1/4-BPS cycle.\nNote that the intersection form restricted to the horizontal cohomology will not in\ngeneral be unimodular. Thus, the decomposition of H 4 (X, Z) into vertical and horizontal\npieces cannot in general be done over the integers: one needs rational coefficients. We refer\nto a four-cycle with components in both spaces as a mixed four-cycle.\nMoreover, although a basis of integral cycles for these vertical/horizontal subspaces\ncan be determined by fourfold mirror symmetry as described in [68,74], these will not\ngenerate H 4 (X, Z), which is the relevant group for the (appropriately shifted) G-flux.\nAs a simple example consider the sextic X in P5 with h1,1 (X) = 1 generated by the\nR\nhyperplane H with X H 4 = 6. The generator of non-primitive four-forms in HV2,2 (X)\nR\nis the dual of an irreducible sextic in P3 of class H 2 with X (H 2 )2 = 6. The primitive\npart is expected to be generated (over the rationals) by duals of special Lagrangian cycles.\n\nThe basis of algebraic and special Lagrangian cycles generates a finite index sublattice of\nH4 (X, Z). A basis of H 4 (X, Z) necessarily includes a mixed class of the form e = 61 H 2 + θ,\nwith θ a rational multiple of a form dual to a special Lagrangian cycle, possibly dual to a\nCayley cycle.\nMirror symmetry and the Hodge conjecture\nWe have identified certain cycles – the integral (p, p) cycles – as being suitable for fluxes that\nminimize the superpotential, and other cycles – the integral primitive cycles – as being\nsuitable for fluxes that minimize the twisted superpotential. Mirror symmetry between\npairs of Calabi–Yau fourfolds should exchange several things: the horizontal and vertical\ncohomologies should be exchanged, the integral (p, p) cycles (which may include more\ncycles than just the vertical cohomology) should be exchanged with the integral primitive\ncycles (which may include more cycles than just the horizontal cohomology).\nTo get supersymmetric representatives of cycles, calibrated cycles should be used, and\nthe two natural calibrations for Calabi–Yau fourfolds – the Kähler calibration and the\n71\n\n\fspecial Lagrangain calibration – should also be exchanged under mirror symmetry (since\nthey lead to different types of branes). Since the Hodge conjecture can be interpreted as\nasserting that any integral (p, p) cycles is, up to torsion, a rational linear combination of\nKähler-calibrated cycles (i.e., algebraic cycles), it is tempting to formulate the following:\nMirror Hodge Conjecture. If G is a middle-dimensional cycle on a compact Calabi–\nYau manifold such that [G] ∧ J is an exact form, then, up to torsion, G is a rational linear\ncombination of special Lagrangian cycles.\nAlthough not as well motivated by mirror symmetry, one can go on to formulate the:\nSymplectic Hodge Conjecture. If G is a middle-dimensional cycle on a compact symplectic manifold such that [G] ∧ ω is an exact form (where ω is the symplectic form), then,\nup to torsion, G is a rational linear combination of Lagrangian cycles.\nCohomology groups of local fourfolds\ne of the local fourfolds X\ne ♯ and X\ne ♭ is\nAs described in the text, the common boundary ∂ X\ne Z) can\na S 3 bundle with base S ♯ . The integral cohomology and homology groups H 3 (∂ X,\nbe computed from the Gysin long exact sequence, or the Leray spectral sequence, to be\n\nZ\n\n 2g\ne Z) ≃ Z2\nH q (∂ X,\n\n Z2g\nZ ⊕ Z2g−2\n\nq\nq\nq\nq\n\n\nZ\n\n 2g\ne Z) ≃ Z2\nHq (∂ X,\n\n Z2g\nZ ⊕ Z2g−2\n\n= 0, 7\n= 1, 3, 6\n,\n= 2, 5\n=4\n\nq\nq\nq\nq\n\n= 0, 7\n= 1, 4, 6\n.\n= 2, 5\n=3\n\nf♭ , we determine their\nf♯ and X\nBy exploiting the fibered structure of the local fourfolds X\ncohomology groups to be\n\n\nZ\n\n 2g\nZ\nq f♯\nH (X , Z) ≃\n2\n\nZ\n0\n\nq = 0, 4\nq = 1, 3\n,\nq=2\nelse\n\n\nZ\n\n 2g\nZ\nq f♭\nH (X , Z) ≃\n4g−3\n\nZ\n0\n\nq = 0, 2, 5\nq=1\n.\nq=4\nelse\n\ne ♯/♭ , Z) ≃ Hq (X\ne ♯/♭ , Z) ≃ Hc8−q (X\ne ♯/♭ , Z), we can also deduce\nVia the duality relations H q (X\ne ♯/♭ , Z) of compact support, which are Poincaré dual to the\nthe cohomology groups H 8−q (X\nc\n\ne ♯/♭ , Z).\nhomology groups Hq (X\n\nHodge structure of the stable degeneration components X and Y\nAs described in the section 4.3 in the semi stable degeneration – relevant to the extremal\n72\n\n\ftransition X ♭ to X ♯ – the Calabi–Yau fourfold X ♭ degenerates into two four-dimensional\ncomponent varieties X and Y intersecting transversely in the three-dimensional variety\nE. Since the variety X is the blowup of X ♯ along the genus g curve C, its non-vanishing\nHodge numbers read [42]\nh0,0 (X) = h4,4 (X) = h4,0 (X) = h0,4 (X) = 1 ,\nh1,1 (X) = h3,3 (X) = h1,1 (X ♯ ) + 1 ,\nh2,1 (X) = h1,2 (X) = h3,2 (X) = h2,3 (X) = h2,1 (X ♯ ) + g ,\n\n(A.4)\n\nh3,1 (X) = h1,3 (X) = h3,1 (X ♯ ) ,\nh2,2 (X) = h2,2 (X ♯ ) + 2 ,\nexpressed in terms of the Hodge numbers h1,1 (X ♯ ), h2,1 (X ♯ ), h3,1 (X ♯ ), and h2,2 (X ♯ ) of the\nCalabi–Yau fourfold X ♯ .\nThe variety Y is a quadratic hypersurface inside a P4 bundle of the genus g curve C.\nFor generic fibers over C the quadric fibers are of rank 5, while there are 2g − 2 non-generic\npoints on C, where the quadric fibers drop to rank 4. Using topological surgery techniques\nin the vicinity of the points of C, where the quadric fibers degenerate to rank 4, the Hodge\nnumbers of the variety Y can be derived\nh0,0 (Y ) = h4,4 (Y ) = 1 ,\nh1,0 (Y ) = h0,1 (Y ) = h4,3 (Y ) = h3,4 (Y ) = g ,\nh2,1 (Y ) = h1,2 (Y ) = h3,2 (Y ) = h2,3 (Y ) = g ,\n\n(A.5)\n\nh1,1 (Y ) = h3,3 (Y ) = 2 ,\nh2,2 (Y ) = 2g .\nFinally, the non-vanishing Hodge numbers of the intersection E, which is a P1 × P1 bundle\nof the curve C, are given by\nh0,0 (E) = h3,3 (E) = 1 ,\nh1,1 (E) = h2,2 (E) = 3 ,\nh1,0 (E) = h0,1 (E) = h3,2 (E) = h2,3 (E) = g ,\n\n(A.6)\n\nh2,1 (E) = h1,2 (E) = 2g .\nWith the help of eqs. (A.5), (A.4) and (A.6), we will evaluate the maps in eq. (D.1), where\nX [0] is the disjoint union of X and Y and X [1] ≡ E.\n73\n\n\fAppendix B. Conifold flop transitions in local Calabi–Yau fourfolds\nf\nf\nTo describe the flop transition between the two small resolutions X1♯ and X2♯ , we\n\ndescribe the conifold fibers of the genus g curve C as a symplectic quotient V //U (1) as in\nrefs. [33,34]. To this end we introduce gauged linear σ-model fields s1 , s2 and s3 , s4 with\nU (1) charge +1 and −1, respectively. As usually, these gauged linear σ-model fields are\nconstrained by the D-term\n|s1 |2 + |s2 |2 − |s3 |2 − |s4 |2 = r ,\n\n(B.1)\n\ne sing (for r = 0) and the\nwhere the parameter r distinguishes among the singular phase X\nf\nf\ntwo small resolutions X1♯ (for r > 0) and X2♯ (for r < 0) [34]. In the following we collectively\nfr .\ndenote the geometry of these three phases by X\n\nIn addition to their U (1) charges the fields s1 to s4 transform as sections of line bundles\nfr is realized as the non-trivial\nS1 to S4 over the curve C, and therefore the local fourfold X\n\nfibration\n\n/X\nfr .\n\nV //U (1)\n\n(B.2)\n\nπ\n\n\u000f\nC\n\nThe coordinates x1 to x4 in eq. (3.1) arise as the gauge invariant combinations\nx1 = s 1 s 3 ,\n\nx2 = s 2 s 4 ,\n\nx3 = s 1 s 4 ,\n\nx4 = s 2 s 3 ,\n\n(B.3)\n\nwhich fulfill the relation (3.1) by construction. Moreover, the line bundles Sl are related\nto the line bundles Ll according to41\nL1 = S1 ⊗ S3 ,\n\nby\n\nL2 = S2 ⊗ S4 ,\n\nL3 = S1 ⊗ S4 ,\n\n(B.4)\n\nf\nf\nThe (compact) surfaces S1♯ and S2♯ of the small resolutions X1♯ and X2♯ are now given\nr > 0 : S1♯ = {s3 = s4 = 0} ,\n\n41\n\nL4 = S2 ⊗ S3 .\n\nr < 0 : S2♯ = {s1 = s2 = 0} .\n\n(B.5)\n\nIn terms of the line bundles Ll , these relations specify the line bundles Sl up to a line bundle\n\nP, i.e., S1/2 ∼ S1/2 ⊗ P and S3/4 ∼ S3/4 ⊗ P −1 . Note, however, that the line bundle P cancels\nout in the symplectic quotient V //U (1).\n\n74\n\n\fFurthermore, we define the divisor class Dl = {sl = 0} and Dp = π −1 (p) in terms of a\npoint p on the curve C. Note that these divisor classes do not depend on the parameter r\nfr is a normal variety for all values of r (as the conifold singularities\nbecause the fourfold X\nfr for r = 0 at codimension two). As a consequence, we can also define the\narise in X\nfr ) (because H 2,0 (X\nfr ) = 0) in a r-independent way by means\ncohomology elements H 2 (X\nof Poincaré duality. Thus, we define the (1, 1)-forms ωl and ωp as duals of the divisors Dl\nand Dp .\n\nLet us first concentrate on the phase r > 0. The surface S1♯ intersects Dp at a generic\nP1 -fiber F1 , i.e.,\nF1 = S1♯ .Dp .\n\n(B.6)\n\nThe generic fiber F1 yields according to ref. [34] the intersection numbers\nF1 .D1/2 = S1♯ .Dp .D1/2 = 1 ,\n\nF1 .D3/4 = S1♯ .Dp .D3/4 = −1 ,\n\nF1 .Dp = S1♯ .Dp .Dp = 0 .\n(B.7)\n\nThe vanishing intersection is a consequence of the fact that two generic fibers F1 are nonintersecting. Furthermore, S1♯ intersects the divisors D1/2 in the two sections C1′ and C1 ,\ni.e.,\nC1 = S1♯ .D2 ,\n\nC1′ = S1♯ .D1 ,\n\n(B.8)\n\nand we arrive at their intersections\nC1 .Dp = 1 ,\n\nC1 .D1 = 0 ,\n\nC1 .D2 = deg L4 − deg L1 = −n ,\n\nC1′ .Dp = 1 ,\n\nC1′ .D2 = 0 ,\n\nC1′ .D1 = deg L1 − deg L4 = n ,\n\n(B.9)\n\nand the self-intersection\nS1♯ .S1♯ = 2 − 2g .\n\n(B.10)\n\nThe vanishing intersections are a consequence of the fact that the two sections C1 and C1′\nare disjoint in S1♯ . The intersections C1 .D2 = S1♯ .D2 .D2 and C1′ .D1 = S1♯ .D1 .D1 and the\nself-intersection of S1♯ are calculated by using eqs. (B.4) and the fact that – on the level of\nthe performed intersection calculus – we have the relations D1 +D3 ∼ (deg S1 +deg S3 )Dp ,\nD2 + D3 ∼ (deg S2 + deg S3 )Dp and so on. By inspecting the resulting intersection numbers (B.7) and (B.9), we readily identify the curves C1 and F1 with the curves C and F (and\nC1′ with C ′ ) of eq. (3.5). The Kähler form is again given by J(S1♯ ) = J1F (ω2 + n ωp ) + J1C ωp\n(c.f., eq. (3.9)), and, as before, we find the Kähler volume\nZ\nn\n1\nJ(S1♯ ) ∧ J(S1♯ ) = (J1F )2 + J1F J1C ,\n2 S1♯\n2\n75\n\n(B.11)\n\n\fwhere J1F and J1C measure the volumes of the curves F1 and C1 .\nWe now turn to the phase r < 0. In particular, we are interested how the volume\nintegral (B.11) behaves as we traverse from the r > 0 phase to the r < 0 phase. The divisors\nand their dual (1, 1)-forms remain invariant, but we need to recalculate the intersection\nnumbers. Using similar arguments as for the intersection numbers in the phase r > 0, we\nfind for r < 0\nS2♯ .Dp .D1/2 = −1 ,\n\nS2♯ .Dp .D3/4 = 1 ,\n\nS2♯ .D3 .D4 = 0 ,\n\nS2♯ .D2 .D2 = n − (2g − 2) ,\n(B.12)\n\nand\nS2♯ .S2♯ = 2 − 2g .\n\n(B.13)\n\nWith these intersection numbers we immediately infer the volume integral (3.14) of the\nsurface S2♯ expressed in terms of the Kähler coordinates J1F and J1C .\n\nAppendix C. The quarternionic Hopf fibration and the Milnor fibration\nf♭ , we must\nIn order to control the intersection properties of the four-cycles Bl♭ on X\n\ntake some care in how they are defined. Our main tools are the Milnor fibration [75] and\nthe quaternionic Hopf fibration.\n\nLocally near a zero of ǫ, we can use ǫ as a local coordinate on the curve C, and regard\nf♭ → C. The fiber of the map over 0 has a singular point,\nǫ as locally describing the map X\nf♭ with respect to\nand locally near that singular point, there are four coordinates x on X\nl\n\nwhich the function ǫ takes the form\n\nǫ = x1 x2 − x3 x4 .\nWe will use these coordinates to describe the fourfold near such a zero, which is isomorphic\nto a neighborhood of the origin in C4 .\nThe function ǫ = ǫ(xl ) : C4 → C defines an isolated hypersurface singularity, and\nMilnor found a very elegant way to describe the topology near such a singularity. Let\nSr7 = {kx1 k2 + kx2 k2 + kx3 k2 + kx4 k2 = r 2 } be the sphere of radius r in C4 . The Milnor\nfibration is the map\nǫ\nkǫk\n\n: Sr7 − (Sr7 ∩ {ǫ = 0}) → S 1 ,\nSr7 −(Sr7 ∩{ǫ=0})\n\n76\n\n\fand its fibers, the Milnor fibers, are in general homotopic to a wedge of 3-spheres. In\nour case, the function ǫ describes the simplest isolated hypersurface singularity, and the\nMilnor fiber is diffeomorphic to T ∗ S 3 , the cotangent bundle of the 3-sphere. A 3-sphere\nin the Milnor fiber is a vanishing cycle, since there is a four-chain whose boundary is the\n3-sphere, given by taking the cone over S 3 ⊂ Sr7 to get a bounding four-chain Σ4 ⊂ B8r ,\nwhere B8r is the 8-ball of radius r.\nAs we will show momentarily, a generating 3-sphere in the Milnor fiber can be deformed to a 3-sphere contained in the fiber of the map ǫ. Our strategy for giving an explicit\ndescription of the four-cycles Bl♭ is as follows. We have a path joining p0 to pl on C. In\nf♭ → C. Near\nthe middle of this path, we follow a 3-sphere within the fiber of the map X\n\neach endpoint, though, we stop following the path, and follow instead the deformation of\nthe 3-sphere in the fiber of ǫ to a 3-sphere in the Milnor fiber of small radius, concluding\nby using the bounding four-chain Σ4 to close off the four-cycle.\nIn order to describe the behavior explicitly near the origin, we use the quaternionic\n\nHopf fibration. Let us introduce quaternion variables q1 = x1 + x4 j and q2 = x3 + x2 j\nwhich allow us to regard C4 as H2 . Note that the quaternionic conjugate q1 = x̄1 − x4 j\nsatisfies q1 q1 = kq1 k2 = kx1 k2 + kx4 k2 .\nThere is a natural map H2 → HP1 ∼\n= S 4 defined by (q1 , q2 ) 7→ [q1 , q2 ]. If q1 6= 0 then\nq2\nq2 q1\n(x3 + x2 j)(x̄1 − x4 j)\n] = [1,\n] = [1,\n]\n2\nq1\nkq1 k\nkx1 k2 + kx4 k2\n(x̄1 x3 + x2 x̄4 ) + (x1 x2 − x3 x4 )j\n= [1,\n].\nkx1 k2 + kx4 k2\n\n[q1 , q2 ] = [1,\n\nIf we restrict this map to the sphere Sr7 ⊂ H2 of radius r, we get the quaternionic Hopf\nfibration S 7 → S 4 whose fibers are 3-spheres. More explicitly, if we fix σ + τ j ∈ H ⊂ S 4 ,\nthen the quaternionic Hopf fiber over σ + τ j defined by\nx̄1 x3 + x2 x̄4\n= σ,\nkx1 k2 + kx4 k2\n\nx1 x2 − x3 x4\n= τ ,\nkx1 k2 + kx4 k2\n\nkx1 k2 + kx2 k2 + kx3 k2 + kx4 k2 = r 2\n\nis a three-sphere.\nWe have chosen our coordinates very carefully, to insure that τ /kτ k = ǫ/kǫk. Thus,\nthe three-spheres in the quaternionic Hopf fibration are contained in the Milnor fibers for\nthe function ǫ = x1 x2 − x3 x4 . (Note that the complex variable σ labels a real 2-parameter\n77\n\n\ffamily of such 3-spheres within a fixed Milnor fiber labeled by τ . We denote that 3sphere by Sσ3 if we need to emphasize this dependence on parameters.) The advantage\nof this description is that we can immediately see that the bounding four-chains Σ4 are\nquaternion-linear subspaces of H2 , and so are nonsingular four-manifolds with boundary.\nMoreover, any two such bounding four-chains meet transversally in a single point, with\nintersection number +1 (using the natural orientation of the quaternions). This reflects a\nwell-known property of the quaternionic Hopf fibration, analogous to the same property\nof the ordinary Hopf fibration: any two fibers Sj3 ⊂ S 7 (j = 1, 2) of the quaternionic Hopf\nfibration have linking number 1 in the 7-sphere.\nTo finish our story, we must show that the Hopf fiber Sσ3 in the Milnor fiber over\nτ /kτ k can be naturally deformed to a 3-sphere in the fiber ǫ−1 (τ ) of the holomorphic map\nǫ. Assume that σ 6= 0, which imples that x1 and x4 do not simultaneously vanish on Sσ3 .\nWe rescale, defining\n\nxl\n,\nx\nbl = p\nkx1 k2 + kx4 k2\n\nl = 1, 2, 3, 4 .\n\nThe defining equations for the fiber of the Hopf fibration become\nx\nb̄1 x\nb3 + x\nb2 x\nb̄4 = σ ,\n\nx\nb1 x\nb2 − x\nb3 x\nb4 = τ ,\n\nkb\nx1 k2 + kb\nx4 k 2 = 1 .\n\nc3 is contained in ǫ−1 (τ ). (Note that kb\nThat is, the rescaled 3-sphere S\nx1 k2 + kb\nx2 k 2 +\nσ\nkb\nx3 k2 + kb\nx4 k2 = r 2 (kx1 k2 + kx4 k2 ) does not constrain the variables, but rather, allows the\ndefinition\n\nkx1 k2 + kx4 k2 =\n\nkb\nx1 k2 + kb\nx2 k2 + kb\nx3 k2 + kb\nx4 k 2\n,\nr2\n\nwhich can be used to construct the inverse transformation.)\nLet us now consider the intersection number of two such cycles Bl♭ .Bl♭′ . Near each\npoint pj , the bundle of 3-spheres in fibers is an oriented bundle, so we can fix a consistent\norientation of the 3-spheres throughout a neighborhood of pj . We can also fix a common\norientation for all paths emanating from pj , either pointing towards the point or pointing\naway from the point. Note that changing the orientation of all of the 3-spheres changes\nthe orientations of both Bl♭ and Bl♭′ , and thus does not change the intersection number.\nSimilarly, changing the orientation of all of the paths emanating from pj does not change\nthe intersection number.\nWe computed a local contribution to the intersection number at a point pj by using\nthe natural orientation of the quaternions. Given a choice of how to orienting paths\n78\n\n\femanating from pj , the quaternion orientation determines an orientation of all of the 3spheres. Whichever orientation it is, it is the same orientation for both four-cycles, so the\nlocal contribution of + 1 to the intersection number is correct.\nGlobally, if l 6= l′ then Bl♭ and Bl♭′ are given by paths from p0 to pl and pl′ , respectively.\nIf we choose the tangent directions of those two paths at p0 to be different, then we can\nuse the computation above to conclude that the intersection number is 1.\nOn the other hand, if l = l′ , we can choose two different paths from p0 to pl , and\nwe can take them to have differnt tangent directions at p0 and also at pl . Thus, at each\nendpoint we get a contribution of 1, for a total intersection number of 2.\n\nAppendix D. The Clemens-Schmid exact sequence\nD.1. Triple-point-free Clemens-Schmid exact sequences\nThe original sources for the Clemens–Schmid exact sequence are refs. [76,77]; we follow\nthe exposition in ref. [78], which is based in part on refs. [79,80,81].\nA semistable degeneration is a Kähler manifold X of dimension d + 1 together with\na map X → ∆ to the unit disk such that the fibers Xt := π −1 (t) for t 6= 0 are compact\nS\ncomplex manifolds of dimension d and X0 = Xi is reduced divisor with each Xi a compact\ncomplex manifold of dimension d, such that all intersections of distinct components Xi1 ,\n\n. . . , Xik are transverse. (\"Reduced\" means that the function t has a simple zero along\neach Xi .)\nWe will consider a special case of this, in which Xi meets Xj transversally for i 6= j,\nbut all triple intersections Xi ∩ Xj ∩ Xk (i, j, k distinct) are empty. In this case, we call\nthe degeneration triple-point-free following refs. [82,83].\nFor a triple-point-free degeneration, define X [0] to be the disjoint union of the components Xi , and X [1] to be the disjoint union of the intersections Xij := Xi ∩ Xj . There\nare restriction maps\nH m (X [0] ) −→ H m (X [1] ) ,\nand we define\n\nE20,m := Ker(H m (X [0] ) −→ H m (X [1] )) ,\nE21,m := Coker(H m (X [0] ) −→ H m (X [1] )) .\n79\n\n(D.1)\n\n\fAs the notation suggests, these are the E2 terms in a spectral sequence, which degenerates\nat E2 and converges to the cohomology of X0 . In practice, this means that there are short\nexact sequences\n0 −→ E21,m−1 −→ H m (X0 ) −→ E20,m −→ 0 .\n\n(D.2)\n\nFor brevity, we denote H m (X0 ) by H m . It turns out that this is also isomorphic to\nthe cohomology of the total space H m (X ). (For general semistable degenerations, the\nconstruction involves more strata X [k] , and is much more complicated.)\nThese cohomology groups carry mixed Hodge structures. This means that there is a\n\"weight\" filtration on cohomology whose graded pieces carry Hodge structures of the given\nweight.42 In the triple-point-free case, the weight filtration has only two non-trivial terms:\nWm−1 H m = E21,m−1 , and Wm H m = H m (with Wm−2 H m = {0}); the corresponding\nW\nW\ngraded pieces Grm−1\nH m := Wm−1 H m and Grm\nH m := Wm H m /Wm−1 H m carry Hodge\n\nstructures of weights m − 1 and m, respectively.\nThere is an induced filtration, with induced Hodge structures of negative weight, on\nthe homology Hm . The weights of the Hodge structures are −m and −m + 1.\nOn the other hand, the cohomology of the general fibers H m (Xt ) admit a monodromy\ntransformation T with a logarithm N , and the limit as t → 0 of the Hodge structures on\nm\n. The monH m (Xt ) gives another mixed Hodge structure. Let us denote this limit by Hlim\n\nodromy weight filtration is in general a somewhat complicated linear algebra construction\nusing N , but in the case that N 2 = 0 (which corresponds to our triple-point-free situation)\nit takes a simple form:\nm\nWm−1 Hlim\n= Im(N ) ,\n\nm\nWm Hlim\n= Ker(N ) ,\n\nm\nm\nWm+1 Hlim\n= Hlim\n.\n\n(D.3)\n\nSo there is a Hodge structure of weight m − 1 on Im(N ), a Hodge structure of weight m\nm\non Ker(N )/Im(N ) and a Hodge structure of weight m + 1 on Hlim\n/Ker(N ).\n\nThe Clemens–Schmid exact sequence is an exact sequence of mixed Hodge structures:\nα\n\ni∗\n\nβ\n\nN\n\nα\n\nm\nm\n−→H2n−m −→H m+2 −→ * * * .\n−→Hlim\n* * * −→ H2n−m+2 −→H m −→Hlim\n42\n\nA Hodge structure of weight k on a vector space V is a decomposition V ⊗ C ∼\n=\n\nwith V q,p = V p,q .\n\n80\n\nL\n\n(D.4)\np+q=k\n\nV p,q\n\n\fLet us describe the various maps in this sequence. N is the logarithm of monodromy, as\ndescribed above. i∗ is just the restriction of a cohomology class from the total space X to\nthe fiber Xt . α is the composition of Poincaré duality on the total space\nH2n−m+2 (X ) −→ H m (X , ∂X ) ,\nwith the natural map from relative cohomology to absolute cohomology\nH m (X , ∂X ) −→ H m (X ) ,\nwhile β is the composition of Poincaré duality on the fiber\nH m (Xt ) −→ H2n−m (Xt ) ,\nwith the homology push-forward\ni\n\n∗\nH2n−m (Xt )−→H\n2n−m (X ) .\n\nThe Clemens–Schmid exact sequence induces exact sequences on the graded pieces,\nwhich are morphisms of (pure) Hodge structures. There are four such exact sequences:\nthree isomorphisms\nN\n\nW\nm\nW\nm\n0 −→ Grm+1\nHlim\n−→Grm−1\nHlim\n−→ 0 ,\ni∗\n\nW\nm\nW\nHlim\n−→ 0 ,\n0 −→ Grm−1\nH m −→Grm−1\nβ\n\nW\nm\nW\n0 −→ Grm+1\nHlim\n−→Grm−2n+1\nH2n−m −→ 0 ,\n\n(D.5)\n(D.6)\n(D.7)\n\nand a more interesting one\nβ\n\nα\n\ni∗\n\nm−2\nW\nW\nm\nW\nW\n0 −→ Grm−2\nHlim\nHlim\n−→ 0 .\n−→Grm−2n−2\nH2n−m+2 −→Grm\nH m −→Grm\n\n(D.8)\n\nThus, the crucial things to calculate in any example are the kernel and cokernel of\nW\nW\nα : Grm−2n−2\nH2n−m+2 −→ Grm\nHm ,\n\nfor each m.\n81\n\n(D.9)\n\n\fD.2. Conifold transition in Calabi–Yau threefolds\nThe Clemens–Schmid exact sequence can be used to study three-dimensional conifold\ntransitions [53,2] in the general geometric setting of refs. [84,85,86,87]. This has previously\nbeen worked out in ref. [88]; we review it here to establish notation and familiarity with\nour setup.\nWe take a family Xe of Calabi–Yau threefolds Xs depending on s ∈ ∆ which acquires\n\nδ nodes at s = 0. Our key assumption is that the δ vanishing cycles for these nodes\n\nonly span a subspace of dimension σ := δ − ρ within H 3 (Xs ). Since the vanishing cycles\n3\n3\nspan the image of N on Hlim\n, this implies that W2 Hlim\n= Im(N ) has rank σ, and so that\n3\nGr2W H 3 ∼\nalso has rank σ.\n= Gr2W Hlim\n\nTo obtain a semistable degeneration, we would like to blowup the nodes, but a simple\ncomputation shows that the resulting central fiber would not be reduced (i.e., the function\ns would have a double zero along the exceptional divisor). The way forward is pointed to\nby Mumford's semistable reduction theorem [89], and we make the \"basechange\" s = t2\nbefore blowing up the nodes.\nIt is worth making the local computation to see what is going on. We have\nx 1 x 2 − x 3 x 4 = t2 ,\nand we are blowing up the origin in that space. At t = 0 we see two (local) components:\none of them, X, is the blowup of the original fiber Xe0 at the node. Note that this is\n\nthe not the familiar small blowup which replaces the node by a P1 but rather a bigger\n\nblowup which replaces it by a quadric surface P1 × P1 . The other local component Y is\nthe exceptional divisor of the blowup, isomorphic to a nonsingular quadric hypersurface in\nP4 . Note that X ∩ Y = E ∼\n= P1 × P1 .\nMore globally, we will have X and δ exceptional divisors Y1 , . . . , Yδ , one for each node,\nS\nwith X0 = X ∪ Yi . X is the blowup of X ♯ along the rational curves Si♯ with exceptional\n\ndivisors Ei ⊂ X, and Xt coincides with X ♭ .\n\nTo compute the cohomology of X0 and its weight filtration, we must study the maps\nH m (X [0] ) → H m (X [1] ), which in this case can be written as\nH m (X ♯ ) ⊕ Blm ⊕\n\nM\n\nH m (Yi ) −→\n82\n\nM\n\nH m (Ei ) ,\n\n\fwhere Blm represents the addition to the cohomology of X ♯ caused by the blowup. ExL\nL\nZ[Ei ] and Bl4 =\nZ[ei ].\nplicitly, if ei ⊂ Ei is the fiber of Ei → Si♯ , then Bl2 =\n\nIn the cases m = 1 and m = 5, all of the constituents of the cohomology vanish, so we\n\nconclude that W1 H 1 , W1 H 2 , W5 H 5 , and W5 H 6 all vanish. In the case m = 3, the only\nnonvanishing constitutent is H 3 (X ♯ ), so W3 H 3 = H 3 (X ♯ ) and W3 H 4 vanishes.\nIn the case m = 0, the maps H 0 (Yi ) → H 0 (Ei ) are isomorphisms, so the kernel is\njust W0 H 0 = H 0 (X ♯ ) and the cokernel W0 H 1 vanishes. In the case m = 6, the right side\nL 6\nvanishes and we simply get W6 H 6 = H 6 (X ♯ ) ⊕\nH (Yi ) = Zδ+1 .\nIn the case m = 4, since Gr4W H 5 vanishes, the map\nH 4 (X ♯ ) ⊕\n\nM\n\nZ[ei ] ⊕\n\nM\n\nH 4 (Yi ) −→\n\nM\n\nH 4 (Ei )\n\nis surjective, and its kernel must be W4 H 4 = H 4 (X ♯ ) ⊕ Zδ .\n\nFinally, in the case m = 2, since Gr2W H 3 has rank σ and it is the cokernel of the map\nH 2 (X ♯ ) ⊕\n\nM\n\nZ[Ei ] ⊕\n\nM\n\nH 2 (Yi ) −→\n\nthe kernel of that map is W2 H 2 = H 2 (X ♯ ) ⊕ Zσ .\n\nM\n\nH 2 (Ei ) ,\n\nNow we can use the Clemens–Schmid exact sequence to relate the cohomology and\nHodge structures of X ♯ and X ♭ . We focus on the \"interesting\" part of the sequence. If\nm = 4, this reads\n2\nW\n4\n0 −→ Gr2W Hlim\n−→ Gr−4\nH4 −→ Gr4W H 4 −→ Gr4W Hlim\n−→ 0 .\n\nNote that there is no monodromy here, so the first and last terms coincide with H 2 (X ♭ )\nand H 4 (X ♭ ), respectively. Since the middle two groups have the same rank, the kernel\nand cokernel must also have the same rank. This simply expresses Poincaré duality for\nH ∗ (X ♭ ), and we learn nothing new.\nIf m = 3, our sequence reads\n1\nW\n3\n0 −→ Gr1W Hlim\n−→ Gr−5\nH5 −→ Gr3W H 3 −→ Gr3W Hlim\n−→ 0 .\n\nThe first two terms vanish, so this gives an isomorphism between the last two terms. The\nlast term is only part of H 3 (X ♭ ), and in fact we have\n3\nH 3 (X ♭ ) = Gr3W Hlim\n⊕ Z2σ = H 3 (X ♯ ) ⊕ Z2σ .\n\n83\n\n\fNote that at the level of Hodge structures, the limit of the Hodge structures on H 3 (Xt )\nas t → 0 retains a piece of smaller rank which coincides with H 3 (X ♯ ) and has a Hodge\nstructure of weight 3, while the other part of the cohomology goes to parts of the limiting\nmixed Hodge structure of weights 2 and 4.\nFinally, if m = 2, our sequence reads\n0\nW\n2\n0 −→ Gr0W Hlim\n−→ Gr−6\nH6 −→ Gr2W H 2 −→ Gr2W Hlim\n−→ 0 .\n\nThe first two terms have ranks 1 and δ + 1, respectively, and the third term is isomorphic\nto H 2 (X ♯ ) ⊕ Zσ . Thus,\n2\nH 2 (X ♯ ) = Gr2W Hlim\n⊕ Zδ−σ = H 2 (X ♭ ) ⊕ Zδ−σ .\n\nD.3. Conifold transition along a genus g curve in global Calabi–Yau fourfolds\nTo apply the Clemens–Schmid exact sequence to our fourfold extremal transition\nbetween the Calabi–Yau fourfolds X ♯ and X ♭ , we must first construct a semistable degeneration, which relates one to the other.\nOur deformed Calabi–Yau fourfold has a local equation of the form\nx1 x2 − x3 x4 = ǫ ,\nwhere x1 , x2 , x3 , x4 , and ǫ are sections of the bundles L1 , . . . , L4 , and KC over C,\nrespectively. We make a one-parameter deformation of this for t ∈ ∆ (the unit disk),\napproaching the singular Calabi–Yau space at t = 0, as follows. For that purpose, we use\nthe equation\nx 1 x 2 − x 3 x 4 = t2 ǫ ,\n\n(D.10)\n\nwhere t is the coordinate on the disk ∆. We will resolve singularities by blowing up\nx1 = . . . = x4 = t = 0, which gives a variety that is still fibered over C. (We can treat ǫ as\na local coordinate on C.)\nWe can in fact regard eq. (D.10) as defining the deformation more globally. When we\ndo the blowup, on the central fiber we don't get the usual \"small\" blowup X ♯ , but rather,\nthe proper transform in that blowup is a variety X which is the blowup of X ♯ along S ♯ .\nThere is also an exceptional divisor Y of this blowup map in the ambient space, and all\n84\n\n\ftogether the blown up total space gives a family X mapping to the disk via t, such that\nthe central fiber is X0 = X ∪ Y .\nTo see the structure more clearly, we blow up in the ambient space in terms of the\nlocal coordinates z0 to z4 with z0 =\n\nt\nx1 ,\n\nz1 = x1 , z2 =\n\nx2\nx1 , . . . , z4\n\n=\n\nx4\nx1 .\n\n(These local\n\ncoordinates are again appropriate sections over the curve C.) Then the equation (D.10)\nbecomes\nz2 − z3 z4 − z02 ǫ = 0 ,\n\n(D.11)\n\nwhile the reduced form of the resulting semistable degeneration reads\nt = z0 z1 .\nThe components z0 = 0 and z1 = 0 intersect the (local) hypersurface equations (D.11)\ntransversly and gives rise to the varieties X and Y , respectively.\nIntrinsically, we can describe Y – locally given as z1 = 0 – as a quadratic hypersurface\ninside a P4 bundle over C. More precisely, the bundle is P(L1 ⊕ L2 ⊕ L3 ⊕ L4 ⊕ O) (spanned\nby x1 , . . . , x4 , and t) when ǫ giving a coefficient in the equation. As a consequence, the\nfibers of Y → C are quadrics of rank 5 for generic points of C, dropping to rank 4 precisely\nat the 2g − 2 zeros of the section ǫ of the canonical bundle.\nWe let E = X ∩ Y , which locally is given by z0 = z1 = 0. This is a P1 × P1 bundle\nover C; more precisely, it is the fibration {x1 x2 − x3 x4 = 0} ⊂ P(L1 ⊕ L2 ⊕ L3 ⊕ L4 ).\nThe cohomology of the central fiber X0 is governed by the short exact sequence (D.2),\nwhich – together with the relations (D.1) for the disjoint union X [0] of X and Y ,\nW\nand for X [1] ≡ E – results into the (non-vanishing) graded pieces Grm−1\nH m (X0 ) and\nW\nGrm\nH m (X0 ). The for us relevant graded cohomology groups together with their mixed\n\nHodge structures – carrying weight and Hodge filtrations – are recorded here43\nGr1W H 2 (X0 ) =\n\nM\n\nV1p,q ,\n\ndim V1p,q = (0, 0) ,\n\nV2p,q ,\n\ndim V2p,q =\n\np+q=1\n\nGr2W H 2 (X0 ) =\n\nM\n\np+q=2\n43\n\n\u0010\n\n0, h1,1\n,0\nX♯\n\n\u0011\n\n(D.12)\n,\n\nTo derive the mixed Hodge structure of the central fiber X0 , we need further cohomology\n\ndata of the component varieties X and Y , which we have collected in Appendix A.\n\n85\n\n\fand\nGr3W H 4 (X0 ) =\n\nM\n\nV3p,q ,\n\ndim V3p,q =\n\nV4p,q ,\n\ndim V4p,q =\n\np+q=3\n\nGr4W H 4 (X0 ) =\n\nM\n\np+q=4\n\n\u0010\n\u0011\n0, g − h̃2,1 , g − h̃2,1 , 0 ,\n\n\u0010\n\u0011\n2,2\n3,1\n1, h3,1\n,\nh\n+\n2g\n−\n1,\nh\n,\n1\n.\n♯\n♯\n♯\nX\nX\nX\n\n(D.13)\n\nThese graded cohomology groups are expressed in terms of the Hodge numbers hp,q\nof the\nX♯\nCalabi–Yau fourfold X ♯ . h̃2,1 denotes the number of harmonic (2, 1)-forms participating\nin the extremal transition. That is to say, 0 ≤ h̃2,1 ≤ g refers to the number of (2, 1)-forms\nthat are in the image of the canonical map H 2,1 (X ♯ ) → H 2,1 (S ♯ ) and therefore disappear\ntogether with the cycle S ♯ in the extremal transition to the fourfold X ♭ .\nFirst, let's see how the vanishing cycles of the family behave. The limiting mixed\nHodge structure on H 4 (Xt ) as t → 0 will have Hodge structures of three weights (c.f.,\neqs. (D.3)), determined by the behavior of N , the logarithm of monodromy. The vanishing\ncycles are in Im(N ), and give a Hodge structure of weight 3, which, according to the\nClemens–Schmid exact sequence (c.f., eq. (D.6)), is identified with Gr3W H 4 (X0 ) in (D.13).\nThus, there is no (3, 0) part of this Hodge structure; the (2, 1) and (1, 2) parts of dimension\n3,1\n2,2\n(g − h̃2,1 ) contribute to Hlim\nand Hlim\n, respectively.\n\nThe cokernel of N gives a Hodge structure of weight 5. This cokernel is isomorphic to\nIm(N ) due to eq. (D.5). The non-vanishing (g − h̃2,1 )-dimensional (3, 2) and (2, 3) parts\n2,2\n1,3\ncontribute to Hlim\nand to Hlim\n, respectively.\n4\n– corresponding to a Hodge structure of weight 4 –\nThe remaining portion of Hlim\n\ngoes over to H 4 (X0 ), and we shall see how much of it matches with H 4 (X ♯ ). The Clemens–\nSchmid exact sequence tells us together with (D.13) (by evaluating the cokernel (D.9) in\nthe sequence (D.8)) that the weight 4 contribution of the limiting mixed Hodge contains\n(4, 0), (3, 1), (2, 2), (1, 3) and (0, 4) pieces. The the two one-dimensional (4, 0) and (0, 4)\nparts are associated to the holomorphic (4, 0)-form and the anti-holomorphic (0, 4)-form\nof X ♯ . The h3,1\ndimensional (3, 1) and (1, 3) pieces are identified with the complex\nX♯\nstructure deformations of the fourfold X ♯ . Finally, the (2, 2) part is (h2,2\n+ 2g − 4)X♯\ndimensional. Only (h2,2\n− 1) of these forms are associated with (2, 2)-forms of X ♯ . The\nX♯\nremaining (2g − 3) (2, 2)-pieces, which go over to H 4 (X0 ), are associated with the (2g − 3)\nfour-forms [Bl♭ ] and map to forms in H 4 (Y ).\n86\n\n\fThus, in summary the Hodge diamond of X ♭ expressed in terms of the Hodge numbers\n4\nof X ♯ and decomposed into the pieces of the limiting mixed Hodge structure of Hlim\nreads\n\nH p,q (X ♭ ) =\n\nM\n\np,q\nW\nGrm\nHlim\n,\n\n(D.14)\n\nm\n\nwith\n\n0\n0\n0\np,q\nW\ndim Grm\nHlim\n=\n\n0\n1\n0\n\n0\n0\n0\n\n0\n0\n0\n\n0\n0\n0\n\ng − h̃\n3,1\nhX ♯\n0\n\n2,1\n\n0\n0\n0\n\n0\n1\n0\n\n0\n2,1\n2,1\nhX ♯ − h̃\n0\n\n0\n1,1\nhX ♯ − 1\n0\n\n0\n0\n0\n\n0\n2,1\n2,1\nhX ♯ − h̃\n0\n\n0\n0\n0\n\n0\n0\n0\n\ng − h̃\n2,2\nhX ♯ +2g − 4\n2,1\ng − h̃\n\n0\n3,1\nhX ♯\n2,1\ng − h̃\n\n0\n1,1\nhX ♯ − 1\n0\n\n0\n0\n0\n\n0\n2,1\n2,1\nhX ♯ − h̃\n0\n\n0\n0\n0\n\n2,1\n\n0\n1\n0\n\n0\n2,1\n2,1\nhX ♯ − h̃\n0\n\n0\n0\n0\n\n0\n0\n0\n\n0\n1\n0\n\n.\n\n(D.15)\n\nThe triplet at a position (p, q) in the Hodge diamond corresponds to the three weights\nW\n\nwith respect to the limiting monodromy weight filtration, i.e.,\n\np,q\n\ndim Grp+q−1 Hlim\np,q\nW\ndim Grp+q Hlim\nW\np,q\ndim Grp+q+1 Hlim\n\n. Note that\n\nthe indicated decomposition (D.14) only holds in the limit t → 0, whereas for finite t the\nHodge type of the individual graded pieces get corrected. Nevertheless, also for finite t the\nare obtained by summing up the entries of the triplets, that is to say\nHodge numbers hp,q\nX♭\np,q\np,q\np,q\nW\nW\nW\n= dim Grp+q−1\nHlim\n+ dim Grp+q\nHlim\n+ dim Grp+q+1\nHlim\n.\nhp,q\nX♭\n\n87\n\n\fReferences\n[1] A. Strominger, \"Massless black holes and conifolds in string theory,\" Nucl. Phys. B\n451, 96 (1995) [arXiv:hep-th/9504090].\n[2] B. R. Greene, D. R. Morrison and A. Strominger, \"Black hole condensation and the\nunification of string vacua,\" Nucl. Phys. B 451, 109 (1995) [arXiv:hep-th/9504145].\n[3] B. R. Greene, D. R. Morrison and C. Vafa, \"A geometric realization of confinement,\"\nNucl. Phys. B 481, 513 (1996) [arXiv:hep-th/9608039].\n[4] S. H. Katz, D. R. Morrison and M. Ronen Plesser, \"Enhanced gauge symmetry in\ntype II string theory,\" Nucl. Phys. B 477, 105 (1996) [arXiv:hep-th/9601108].\n[5] A. Klemm and P. Mayr, \"Strong coupling singularities and non-abelian gauge symmetries in N = 2 String Theory,\" Nucl. Phys. B 469, 37 (1996) [arXiv:hep-th/9601014].\n[6] P. Berglund, S. H. Katz, A. Klemm and P. Mayr, \"New Higgs transitions between\ndual N = 2 string models,\" Nucl. Phys. B 483, 209 (1997) [arXiv:hep-th/9605154].\n[7] K. Hori, H. Ooguri and C. Vafa, \"NonAbelian conifold transitions and N=4 dualities\nin three-dimensions,\" Nucl. Phys. B 504, 147 (1997). [arXiv:hep-th/9705220].\n[8] E. Witten, \"Phase transitions In M-theory and F-theory,\" Nucl. Phys. B 471, 195\n(1996) [arXiv:hep-th/9603150].\n[9] D. R. Morrison and N. Seiberg, \"Extremal transitions and five-dimensional supersymmetric field theories,\" Nucl. Phys. B 483, 229 (1997) [arXiv:hep-th/9609070].\n[10] K. A. Intriligator, D. R. Morrison and N. Seiberg, \"Five-dimensional supersymmetric\ngauge theories and degenerations of Calabi–Yau spaces,\" Nucl. Phys. B 497, 56 (1997)\n[arXiv:hep-th/9702198].\n[11] D. -E. Diaconescu and R. Entin, \"Calabi–Yau spaces and five-dimensional field theories with exceptional gauge symmetry,\" Nucl. Phys. B 538, 451 (1999) [arXiv:hepth/9807170].\n[12] C. Vafa, \"Superstrings and topological strings at large N,\" J. Math. Phys. 42, 2798\n(2001). [arXiv:hep-th/0008142].\n[13] F. Cachazo, K. A. Intriligator and C. Vafa, \"A Large N duality via a geometric transition,\" Nucl. Phys. B 603, 3 (2001). [arXiv:hep-th/0103067].\n[14] O. Aharony, A. Hanany, K. A. Intriligator, N. Seiberg and M. J. Strassler, \"Aspects\nof N = 2 supersymmetric gauge theories in three dimensions,\" Nucl. Phys. B 499, 67\n(1997) [arXiv:hep-th/9703110].\n[15] S. Gukov, C. Vafa and E. Witten, \"CFT's from Calabi–Yau four-folds,\" Nucl. Phys.\nB 584, 69 (2000) [Erratum-ibid. B 608, 477 (2001)] [arXiv:hep-th/9906070].\n[16] E. Witten, \"On flux quantization in M-theory and the effective action,\" J. Geom.\nPhys. 22, 1 (1997) [arXiv:hep-th/9609122].\n88\n\n\f[17] C. Beasley, J. J. Heckman and C. Vafa, \"GUTs and exceptional branes in F-theory I,\" JHEP 0901, 058 (2009) [arXiv:0802.3391 [hep-th]].\n[18] C. Beasley, J. J. Heckman and C. Vafa, \"GUTs and exceptional branes in F-theory II: Experimental predictions,\" JHEP 0901, 059 (2009) [arXiv:0806.0102 [hep-th]].\n[19] R. Donagi, M. Wijnholt, \"Model building with F-theory,\" [arXiv:0802.2969 [hep-th]].\n[20] J. Marsano and S. Schäfer-Nameki, \"Yukawas, G-flux, and Spectral Covers from Resolved Calabi-Yau's,\" JHEP 1111, 098 (2011). [arXiv:1108.1794 [hep-th]].\n[21] A. P. Braun, A. Collinucci and R. Valandro, \"G-flux in F-theory and algebraic cycles,\"\nNucl. Phys. B 856, 129 (2012). [arXiv:1107.5337 [hep-th]].\n[22] S. Krause, C. Mayrhofer and T. Weigand, \"Gauge Fluxes in F-theory and Type IIB\nOrientifolds,\" [arXiv:1202.3138 [hep-th]].\n[23] D. -E. Diaconescu and S. Gukov, \"Three-dimensional N=2 gauge theories and degenerations of Calabi-Yau four folds,\" Nucl. Phys. B 535, 171 (1998). [hep-th/9804059].\n[24] I. Affleck, J. A. Harvey and E. Witten, \"Instantons and (Super)Symmetry Breaking\nin (2+1)-Dimensions,\" Nucl. Phys. B 206, 413 (1982)..\n[25] K. A. Intriligator and N. Seiberg, \"Mirror symmetry in three-dimensional gauge theories,\" Phys. Lett. B 387, 513 (1996). [hep-th/9607207].\n[26] S. Gukov and D. Tong, \"D-brane probes of special holonomy manifolds, and dynamics\nof N = 1 three-dimensional gauge theories,\" JHEP 0204, 050 (2002). [arXiv:hepth/0202126].\n[27] S. Gukov, J. Sparks, D. Tong, \"Conifold transitions and five-brane condensation\nin M theory on spin(7) manifolds,\" Class. Quant. Grav. 20, 665-706 (2003). [hepth/0207244].\n[28] S. Sethi, C. Vafa and E. Witten, \"Constraints on low-dimensional string compactifications,\" Nucl. Phys. B 480, 213 (1996) [arXiv:hep-th/9606122].\n[29] K. Becker and M. Becker, \"M-theory on eight-manifolds,\" Nucl. Phys. B 477, 155\n(1996) [arXiv:hep-th/9605053].\n[30] K. Becker, M. Becker, D. R. Morrison, H. Ooguri, Y. Oz, Z. Yin, \"Supersymmetric\ncycles in exceptional holonomy manifolds and Calabi–Yau 4 folds,\" Nucl. Phys. B480,\n225-238 (1996). [arXiv:hep-th/9608116].\n[31] I. Brunner, M. Lynker and R. Schimmrigk, \"Unification of M- and F-theory Calabi–\nYau fourfold vacua,\" Nucl. Phys. B 498, 156 (1997) [arXiv:hep-th/9610195].\n[32] P. S. Aspinwall, B. R. Greene and D. R. Morrison, \"Calabi-Yau moduli space, mirror\nmanifolds and space-time topology change in string theory,\" Nucl. Phys. B 416, 414\n(1994). [arXiv:hep-th/9309097].\n89\n\n\f[33] V. Guillemin and S. Sternberg, \"Birational equivalence in the symplectic category,\"\nInvent. Math. 97, 485 (1989).\n[34] E. Witten, \"Phases of N = 2 theories in two dimensions,\" Nucl. Phys. B 403, 159\n(1993) [arXiv:hep-th/9301042].\n[35] T. Eguchi, N. P. Warner, S. -K. Yang, \"ADE singularities and coset models,\" Nucl.\nPhys. B607, 3-37 (2001). [arXiv:hep-th/0105194].\n[36] W.-L. Chow, \"On compact complex analytic varieties,\" Amer. J. Math. 71 (1949)\n893-914.\n[37] G. W. Moore, \"Anomalies, Gauss laws, and Page charges in M-theory,\" Comptes\nRendus Physique 6, 251 (2005). [arXiv:hep-th/0409158].\n[38] J. Cheeger and J. Simons, \"Differential characters and geometric invariants,\" Lecture\nNotes in Math. 1167, 50-80 (1985).\n[39] M. J. Hopkins and I. M. Singer, \"Quadratic functions in geometry, topology, and\nM-theory,\" J. Diff. Geom. 70, 329 (2005) [arXiv:math/0211216 [math.AT]].\n[40] F. Cachazo and C. Vafa, \"N=1 and N=2 geometry from fluxes,\" [arXiv:hepth/0206017].\n[41] N. Seiberg and E. Witten, \"Electric - magnetic duality, monopole condensation, and\nconfinement in N=2 supersymmetric Yang-Mills theory,\" Nucl. Phys. B 426, 19 (1994),\n[Erratum-ibid. B 430, 485 (1994)]. [arXiv:hep-th/9407087].\n[42] P. Griffiths and J. Harris, \"Principles of Algebraic Geometry,\" John Wiley & Sons,\n(1978).\n[43] N. Hitchin, \"Harmonic spinors,\" Advances in Math. 14, 1 (1974).\n[44] D. Mumford, \"Theta-characteristics on algebraic curves,\" Ann. Ecole Norm. Sup. (4)\n4 181-192 (1971).\n[45] C. Bär and P. Schmutz, \"Harmonic spinors on Riemann surfaces,\" Ann. Global Anal.\nGeom. 10, 263, (1992).\n[46] H. Martens, \"Varietes of special divisors on a curve II,\" J. Reine Angew. Math. 233,\n89 (1968).\n[47] G. Curio and R. Y. Donagi, \"Moduli in N=1 heterotic / F theory duality,\" Nucl. Phys.\nB 518, 603 (1998). [hep-th/9801057].\n[48] H. Jockers, P. Mayr and J. Walcher, \"On N=1 4d effective couplings for F-theory and\nheterotic vacua,\" Adv. Theor. Math. Phys. 14, 1433 (2010) [arXiv:0912.3265 [hep-th]].\n[49] J. Marsano, N. Saulina and S. Schäfer-Nameki, \"A Note on G-Fluxes for F-theory\nModel Building,\" JHEP 1011, 088 (2010). [arXiv:1006.0483 [hep-th]].\n[50] D. R. Morrison and J. Walcher, \"D-branes and normal Functions,\" [arXiv:0709.4028\n[hep-th]].\n90\n\n\f[51] J. Walcher, \"Calculations for mirror symmetry with D-branes,\" JHEP 0909, 129\n(2009) [arXiv:0904.4095 [hep-th]].\n[52] M. Alim, M. Hecht, H. Jockers, P. Mayr, A. Mertens and M. Soroush, \"Type II/Ftheory Superpotentials with Several Deformations and N=1 Mirror Symmetry,\" JHEP\n1106, 103 (2011). [arXiv:1010.0977 [hep-th]].\n[53] P. Candelas, P. S. Green and T. Hübsch, \"Rolling among Calabi–Yau vacua,\" Nucl.\nPhys. B 330, 49 (1990).\n[54] A. Collinucci and R. Savelli, \"On Flux Quantization in F-Theory,\" JHEP 1202, 015\n(2012). [arXiv:1011.6388 [hep-th]].\n[55] A. Collinucci and R. Savelli, \"On Flux Quantization in F-Theory II: Unitary and\nSymplectic Gauge Groups,\" [arXiv:1203.4542 [hep-th]].\n[56] A. Klemm, W. Lerche, P. Mayr, C. Vafa and N. P. Warner, \"Self-Dual strings and N=2\nsupersymmetric field theory,\" Nucl. Phys. B 477, 746 (1996) [arXiv:hep-th/9604034].\n[57] S. H. Katz and C. Vafa, \"Matter from geometry,\" Nucl. Phys. B 497, 146 (1997).\n[arXiv:hep-th/9606086].\n[58] S. H. Katz, A. Klemm and C. Vafa, \"Geometric engineering of quantum field theories,\"\nNucl. Phys. B 497, 173 (1997). [arXiv:hep-th/9609239].\n[59] S. Katz, P. Mayr and C. Vafa, \"Mirror symmetry and exact solution of 4-D N=2 gauge\ntheories: 1.,\" Adv. Theor. Math. Phys. 1, 53 (1998). [arXiv:hep-th/9706110].\n[60] S. H. Katz and C. Vafa, \"Geometric engineering of N=1 quantum field theories,\" Nucl.\nPhys. B 497, 196 (1997) [arXiv:hep-th/9611090].\n[61] V. V. Batyrev, \"Dual polyhedra and mirror symmetry for Calabi–Yau hypersurfaces\nin toric varieties,\" J. Alg. Geom. 3, 493 (1994) [arXiv:alg-geom/9310003].\n[62] D. A. Cox and S. Katz, \"Mirror Symmetry and Algebraic Geometry,\" Mathematical Surveys and Monographs, Vol. 68, American Mathematical Society, Providence,\n(2000).\n[63] T. W. Grimm and H. Hayashi, \"F-theory fluxes, Chirality and Chern-Simons theories,\"\nJHEP 1203, 027 (2012). [arXiv:1111.1232 [hep-th]].\n[64] D. Belov, G. W. Moore, \"Classification of Abelian spin Chern-Simons theories,\"\n[arXiv:hep-th/0505235].\n[65] A. Kapustin, N. Saulina, \"Topological boundary conditions in abelian Chern-Simons\ntheory,\" Nucl. Phys. B845, 393-435 (2011). [arXiv:1008.0654 [hep-th]].\n[66] E. Poppitz and M. Unsal, \"Index theorem for topological excitations on R3 × S 1 and\nChern-Simons theory,\" JHEP 0903, 027 (2009). [arXiv:0812.2085 [hep-th]].\n[67] M. Haack and J. Louis, \"M-theory compactified on Calabi–Yau fourfolds with background flux,\" Phys. Lett. B 507, 296 (2001) [arXiv:hep-th/0103068].\n91\n\n\f[68] P. Mayr, \"Mirror symmetry, N = 1 superpotentials and tensionless strings on Calabi–\nYau four-folds,\" Nucl. Phys. B 494, 489 (1997) [arXiv:hep-th/9610162].\n[69] M. B. Green, J. H. Schwarz and E. Witten, \"Superstring Theory. Vol. 2: Loop Amplitudes, Anomalies And Phenomenology,\" Cambridge Monographs On Mathematical\nPhysics, Cambridge University Press, (1987).\n[70] J. de Boer, K. Hori, Y. Oz, \"Dynamics of N=2 supersymmetric gauge theories in\nthree-dimensions,\" Nucl. Phys. B500, 163-191 (1997). [arXiv:hep-th/9703100].\n[71] J. H. Conway, N. J. A. Sloane, \"Sphere Packings, Lattices and Groups\". Springer\n1988.\n[72] B. R. Greene, D. R. Morrison, M. R. Plesser, \"Mirror manifolds in higher dimension,\"\nCommun. Math. Phys. 173, 559-598 (1995). [arXiv:hep-th/9402119 [hep-th]].\n[73] H. Ooguri, Y. Oz, Z. Yin, \"D-branes on Calabi–Yau spaces and their mirrors,\" Nucl.\nPhys. B477, 407-430 (1996). [arXiv:hep-th/9606112].\n[74] A. Klemm, B. Lian, S. S. Roan and S. T. Yau, \"Calabi–Yau fourfolds for M- and\nF-theory compactifications,\" Nucl. Phys. B 518, 515 (1998) [arXiv:hep-th/9701023].\n[75] J. Milnor, \"Singular Points of Complex Hypersurfaces,\" Princeton University Press,\n(1968).\n[76] W. Schmid, \"Variation of Hodge structure: the singularities of the period mapping,\"\nInvent. Math. 22 211-319 (1973).\n[77] C. H. Clemens, \"Degeneration of Kähler manifolds,\" Duke Math. J. 44, 215-290\n(1977).\n[78] D. R. Morrison, \"The Clemens–Schmid exact sequence and applications,\" Topics in\nTranscendental Algebraic Geometry (P. Griffiths, ed.), Annals of Math. Studies 106,\nPrinceton University Press, Princeton, 101-119 (1984).\n[79] P. Griffiths and W. Schmid, \"Recent developments in Hodge theory: a discussion of\ntechniques and results,\" Discrete subgroups of Lie groups and applications to moduli\n(Internat. Colloq., Bombay, 1973), Oxford Univ. Press, 31-127 (1975).\n[80] M. Cornalba and P. A. Griffiths, \"Some transcendental aspects of algebraic geometry,\"\nAlgebraic geometry (Humboldt State Univ., Arcata, Calif., 1974), Proc. Sympos. Pure\nMath. 29, Amer. Math. Soc., 3-110 (1975).\n[81] U. Persson, \"On degenerations of algebraic surfaces,\" Memoirs Amer. Math. Soc., 189\n(1977).\n[82] B. Crauder and D. R. Morrison, \"Triple-point-free degenerations of surfaces with\nKodaira number zero,\" The Birational Geometry of Degenerations (R. Friedman and\nD. R. Morrison, eds.), Progress in Math. 29, Birkhäuser, Boston, Basel, Stuttgart,\n353-386 (1983).\n92\n\n\f[83] B. Crauder and D. R. Morrison, \"Minimal models and degenerations of surfaces with\nKodaira number zero,\" Trans. Amer. Math. Soc. 343, 525-558 (1994).\n[84] C. H. Clemens, \"Double solids,\" Adv. in Math. 47, 107-230 (1983).\n[85] C. H. Clemens, \"Homological equivalence, modulo algebraic equivalence, is not finitely\ngenerated,\" Publ. Math. IHES 58, 19-38 (1983).\n[86] R. Friedman, \"Simultaneous resolution of threefold double points,\" Math. Ann. 274\n671-689 (1986).\n[87] D. R. Morrison, \"Through the looking glass,\" Mirror Symmetry III (D. H. Phong,\nL. Vinet, and S.-T. Yau, eds.), AMS/IP Stud. Adv. Math. 10, International Press,\nCambridge, 263-277 (1999) [arXiv:alg-geom/9705028].\n[88] D. E. Diaconescu, R. Donagi and T. Pantev, \"Geometric transitions and mixed Hodge\nstructures,\" Adv. Theor. Math. Phys. 11, 65–89 (2007) [arXiv:hep-th/0506195].\n[89] G. Kempf, F. F. Knudsen, D. Mumford, and B. Saint-Donat, \"Toroidal embeddings.\nI,\" Lecture Notes in Math. 339, Springer-Verlag, Berlin (1973).\n\n93\n\n\f"}