{"id": "http://arxiv.org/abs/0705.2745v1", "guidislink": true, "updated": "2007-05-18T17:23:59Z", "updated_parsed": [2007, 5, 18, 17, 23, 59, 4, 138, 0], "published": "2007-05-18T17:23:59Z", "published_parsed": [2007, 5, 18, 17, 23, 59, 4, 138, 0], "title": "Long-Term Evolution of Massive Black Hole Binaries. III. Binary\n  Evolution in Collisional Nuclei", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0705.0867%2C0705.3344%2C0705.3066%2C0705.1357%2C0705.3037%2C0705.0310%2C0705.0170%2C0705.3078%2C0705.1571%2C0705.1386%2C0705.0054%2C0705.0451%2C0705.1154%2C0705.3229%2C0705.4233%2C0705.0962%2C0705.4413%2C0705.3118%2C0705.2242%2C0705.1726%2C0705.1858%2C0705.1659%2C0705.4655%2C0705.2745%2C0705.4300%2C0705.0339%2C0705.0908%2C0705.3768%2C0705.4014%2C0705.0223%2C0705.4004%2C0705.2757%2C0705.0576%2C0705.1396%2C0705.3648%2C0705.1744%2C0705.3120%2C0705.4092%2C0705.1860%2C0705.4335%2C0705.2623%2C0705.3841%2C0705.1468%2C0705.4123%2C0705.4361%2C0705.2422%2C0705.3919%2C0705.0716%2C0705.2871%2C0705.0467%2C0705.1598%2C0705.0779%2C0705.0401%2C0705.3963%2C0705.3644%2C0705.3281%2C0705.3512%2C0705.0896%2C0705.1828%2C0705.0112%2C0705.0413%2C0705.1635%2C0705.1024%2C0705.3036%2C0705.2585%2C0705.2796%2C0705.4403%2C0705.3404%2C0705.1257%2C0705.0499%2C0705.1122%2C0705.4560%2C0705.0189%2C0705.4612%2C0705.1872%2C0705.3909%2C0705.2353%2C0705.0521%2C0705.2555%2C0705.0149%2C0705.3889%2C0705.4113%2C0705.1507%2C0705.0103%2C0705.0528%2C0705.2589%2C0705.3123%2C0705.4636%2C0705.3518%2C0705.1683%2C0705.2788%2C0705.2392%2C0705.4550%2C0705.1718%2C0705.0802%2C0705.0525%2C0705.0758%2C0705.1488%2C0705.2394%2C0705.3840%2C0705.1255&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Long-Term Evolution of Massive Black Hole Binaries. III. Binary\n  Evolution in Collisional Nuclei"}, "summary": "[Abridged] In galactic nuclei with sufficiently short relaxation times,\nbinary supermassive black holes can evolve beyond their stalling radii via\ncontinued interaction with stars. We study this \"collisional\" evolutionary\nregime using both fully self-consistent N-body integrations and approximate\nFokker-Planck models. The N-body integrations employ particle numbers up to\n0.26M and a direct-summation potential solver; close interactions involving the\nbinary are treated using a new implementation of the Mikkola-Aarseth chain\nregularization algorithm. Even at these large values of N, two-body scattering\noccurs at high enough rates in the simulations that they can not be simply\nscaled to the large-N regime of real galaxies. The Fokker-Planck model is used\nto bridge this gap; it includes, for the first time, binary-induced changes in\nthe stellar density and potential. The Fokker-Planck model is shown to\naccurately reproduce the results of the N-body integrations, and is then\nextended to the much larger N regime of real galaxies. Analytic expressions are\nderived that accurately reproduce the time dependence of the binary semi-major\naxis as predicted by the Fokker-Planck model. Gravitational wave coalescence is\nshown to occur in <10 Gyr in nuclei with velocity dispersions below about 80\nkm/s. Formation of a core results from a competition between ejection of stars\nby the binary and re-supply of depleted orbits via two-body scattering. Mass\ndeficits as large as ~4 times the binary mass are produced before coalescence.\nAfter the two black holes coalesce, a Bahcall-Wolf cusp appears around the\nsingle hole in one relaxation time, resulting in a nuclear density profile\nconsisting of a flat core with an inner, compact cluster, similar to what is\nobserved at the centers of low-luminosity spheroids.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0705.0867%2C0705.3344%2C0705.3066%2C0705.1357%2C0705.3037%2C0705.0310%2C0705.0170%2C0705.3078%2C0705.1571%2C0705.1386%2C0705.0054%2C0705.0451%2C0705.1154%2C0705.3229%2C0705.4233%2C0705.0962%2C0705.4413%2C0705.3118%2C0705.2242%2C0705.1726%2C0705.1858%2C0705.1659%2C0705.4655%2C0705.2745%2C0705.4300%2C0705.0339%2C0705.0908%2C0705.3768%2C0705.4014%2C0705.0223%2C0705.4004%2C0705.2757%2C0705.0576%2C0705.1396%2C0705.3648%2C0705.1744%2C0705.3120%2C0705.4092%2C0705.1860%2C0705.4335%2C0705.2623%2C0705.3841%2C0705.1468%2C0705.4123%2C0705.4361%2C0705.2422%2C0705.3919%2C0705.0716%2C0705.2871%2C0705.0467%2C0705.1598%2C0705.0779%2C0705.0401%2C0705.3963%2C0705.3644%2C0705.3281%2C0705.3512%2C0705.0896%2C0705.1828%2C0705.0112%2C0705.0413%2C0705.1635%2C0705.1024%2C0705.3036%2C0705.2585%2C0705.2796%2C0705.4403%2C0705.3404%2C0705.1257%2C0705.0499%2C0705.1122%2C0705.4560%2C0705.0189%2C0705.4612%2C0705.1872%2C0705.3909%2C0705.2353%2C0705.0521%2C0705.2555%2C0705.0149%2C0705.3889%2C0705.4113%2C0705.1507%2C0705.0103%2C0705.0528%2C0705.2589%2C0705.3123%2C0705.4636%2C0705.3518%2C0705.1683%2C0705.2788%2C0705.2392%2C0705.4550%2C0705.1718%2C0705.0802%2C0705.0525%2C0705.0758%2C0705.1488%2C0705.2394%2C0705.3840%2C0705.1255&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "[Abridged] In galactic nuclei with sufficiently short relaxation times,\nbinary supermassive black holes can evolve beyond their stalling radii via\ncontinued interaction with stars. We study this \"collisional\" evolutionary\nregime using both fully self-consistent N-body integrations and approximate\nFokker-Planck models. The N-body integrations employ particle numbers up to\n0.26M and a direct-summation potential solver; close interactions involving the\nbinary are treated using a new implementation of the Mikkola-Aarseth chain\nregularization algorithm. Even at these large values of N, two-body scattering\noccurs at high enough rates in the simulations that they can not be simply\nscaled to the large-N regime of real galaxies. The Fokker-Planck model is used\nto bridge this gap; it includes, for the first time, binary-induced changes in\nthe stellar density and potential. The Fokker-Planck model is shown to\naccurately reproduce the results of the N-body integrations, and is then\nextended to the much larger N regime of real galaxies. Analytic expressions are\nderived that accurately reproduce the time dependence of the binary semi-major\naxis as predicted by the Fokker-Planck model. Gravitational wave coalescence is\nshown to occur in <10 Gyr in nuclei with velocity dispersions below about 80\nkm/s. Formation of a core results from a competition between ejection of stars\nby the binary and re-supply of depleted orbits via two-body scattering. Mass\ndeficits as large as ~4 times the binary mass are produced before coalescence.\nAfter the two black holes coalesce, a Bahcall-Wolf cusp appears around the\nsingle hole in one relaxation time, resulting in a nuclear density profile\nconsisting of a flat core with an inner, compact cluster, similar to what is\nobserved at the centers of low-luminosity spheroids."}, "authors": ["David Merritt", "Seppo Mikkola", "Andras Szell"], "author_detail": {"name": "Andras Szell"}, "author": "Andras Szell", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1086/522691", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0705.2745v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0705.2745v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "21 pages", "arxiv_primary_category": {"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0705.2745v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0705.2745v1", "journal_reference": null, "doi": "10.1086/522691", "fulltext": "D RAFT VERSION O CTOBER 23, 2018\nPreprint typeset using LATEX style emulateapj v. 08/22/09\n\nLONG-TERM EVOLUTION OF MASSIVE BLACK HOLE BINARIES. III.\nBINARY EVOLUTION IN COLLISIONAL NUCLEI\nDAVID M ERRITT\n\narXiv:0705.2745v1 [astro-ph] 18 May 2007\n\nDepartment of Physics, 85 Lomb Memorial Drive, Rochester Institute of Technology, Rochester, NY 14623\nand\nCenter for Computational Relativity and Gravitation, School of Mathematical Sciences, 78 Lomb Memorial Drive, Rochester Institute of Technology, Rochester,\nNY 14623\n\nS EPPO M IKKOLA\nTurku University Observatory, Tuorla, 21500 Piikkiö, Finland\n\nA NDRAS S ZELL\nDepartment of Physics, 85 Lomb Memorial Drive, Rochester Institute of Technology, Rochester, NY 14623\nDraft version October 23, 2018\n\nAbstract\nIn galactic nuclei with sufficiently short relaxation times, binary supermassive black holes can evolve beyond\ntheir stalling radii via continued interaction with stars. We study this \"collisional\" evolutionary regime using\nboth fully self-consistent N-body integrations and approximate Fokker-Planck models. The N-body integrations employ particle numbers up to 0.26 × 106 and a direct-summation potential solver; close interactions\ninvolving the binary are treated using a new implementation of the Mikkola-Aarseth chain regularization algorithm. Even at these large values of N, two-body scattering occurs at high enough rates in the N-body\nsimulations that the binary is never fully in the diffusively-repopulated (i.e. large-N) loss cone regime, which\nprecludes a simple scaling of the results to real galaxies. The Fokker-Planck model is used to bridge this gap;\nit includes, for the first time in this context, binary-induced changes in the stellar density and potential. The\nFokker-Planck model is shown to accurately reproduce the results of the N-body integrations, and is then extended to the much larger N regime of real galaxies. Analytic expressions are derived that accurately reproduce\nthe time dependence of the binary semi-major axis as predicted by the Fokker-Planck model. Gravitational\nradiation begins to dominate the binary's evolution after a time that is always comparable to, or less than, the\nrelaxation time measured at the binary's gravitational influence radius; the observed correlation of nuclear relaxation time with velocity dispersion implies that coalescence in ≤ 10 Gyr will occur in nuclei with σ <\n∼ 80\n6 M . The coalescence time depends only weakly on binary\n2\n×\n10\nkm s−1 , i.e. with binary black hole mass <\n⊙\n∼\nmass ratio. Formation of a core, or \"mass deficit,\" is shown to result from a competition between ejection\nof stars by the binary and re-supply of depleted orbits via two-body scattering. Mass deficits as large as ∼ 4\ntimes the binary mass are produced before the gravitational radiation regime is reached; however, after the\ntwo black holes coalesce, a Bahcall-Wolf cusp appears around the single hole in approximately one relaxation\ntime, resulting in a nuclear density profile consisting of a flat core with an inner, compact cluster, similar to\nwhat is observed at the centers of low-luminosity elliptical galaxies. We critically evaluate recent claims that\nbinary-star interactions can induce rapid coalescence of binary supermassive black holes even in the absence\nof loss cone refilling.\nSubject headings:\n1. INTRODUCTION\n\nThis paper is the third in a series investigating the evolution\nof binary supermassive black holes at the centers of galaxies.\nA massive binary hardens via exchange of energy and angular\nmomentum with passing stars, but this process is self-limiting,\nsince the interacting stars are ejected from the nucleus with\nvelocities of order the relative velocity of the two black holes.\nContinued hardening of the binary requires a repopulation of\nthe depleted orbits. Paper I (Milosavljević & Merritt 2003)\ndiscussed various mechanisms by which this can occur, including collisional loss-cone repopulation, secondary slingshot, chaotic stellar orbits, and Brownian motion of the binary. These different mechanisms typically obey different\nscalings of the binary hardening rate with the number N of\nstars and with time; in the large-N limit and in a spherical or\naxisymmetric potential, the hardening rate (defined as the rate\n\nof change of the binary's energy) is predicted to scale roughly\nas N −1 , i.e. inversely with the relaxation time, and hence to be\nvery small for values of N characteristic of massive elliptical\ngalaxies (Valtonen 1996; Yu 2002).\nIn Paper II (Berczik et al. 2005), a direct-summation Nbody code, combined with a parallel GRAPE cluster, was\nused to carry out integrations of binary evolution in galaxy\nmodels with large, low-density cores. Because of their low\ncentral density, the relaxation time at the center of these models was relatively long (compared with orbital periods), and\ncollisional loss cone refilling was shown to occur at a lower\nrate than the loss of stars to the binary, i.e. the binary's loss\ncone remained nearly empty. This is the same (\"diffusive\")\nregime believed to characterize binary evolution in real galaxies (Milosavljević & Merritt 2001). The N-body hardening\nrates were compared with the predictions of simple loss-cone\n\n\f2\n\nMerritt, Mikkola & Szell\n\ntheory and found to be in reasonable agreement.\nThe Plummer models used in Paper II were not good representations of real galaxies. In this paper, we present a new\nset of simulations based on galaxy models that more closely\napproximate real galaxies, with power-law central density\ncusps. In order to deal efficiently with interactions involving the binary, we incorporate the Mikkola-Aarseth chainregularization algorithm (Mikkola & Aarseth 1990, 1993)\ninto our N-body code, including both the effects of nearby\nstars as perturbers of the chain, and the effects of the chain\non the surrounding stars. The resulting N-body algorithm\nis coupled with a GRAPE-6 special-purpose computer and\nused to carry out extended integrations of binaries with various values of N, up to the limit N ≈ 0.26 × 106 set by the\nGRAPE's memory. In order to more accurately characterize\nthe N-dependence of the evolution, multiple integrations are\ncarried out starting from different random realizations of the\nsame initial conditions and averaged.\nEven at the large values of N allowed by the GRAPE-6,\ntwo-body (star-star) scattering occurs at a high enough rate in\nthe N-body simulations that the binary is never fully in the\nempty-loss-cone regime. This fact precludes a simple scaling\nof the N-body results to real galaxies. We therefore develop\na Fokker-Planck model that can be applied to nuclei with any\nvalue of N, i.e. any value of M12 /m⋆ , where M12 ≡ M1 + M2\nand m⋆ are the mass of the binary and of a single star, respectively. Our Fokker-Planck model is unique in that it allows\nfor the joint evolution of the binary and of the stellar nucleus;\nit can therefore reproduce the creation of a core, or \"mass\ndeficit\" (Milosavljević et al. 2002), as the binary ejects stars.\nThe Fokker-Planck model is first tested by comparison with\nthe N-body results, and is then applied to the much larger-N\nregime of real galaxies. In this way we are able to make the\nfirst detailed predictions about the joint evolution of massive\nbinaries and stars at the centers of galaxies.\nThe time scale that limits binary evolution in our models\nis the relaxation time, defined as the time for (mostly distant)\ngravitational encounters between stars to establish a locally\nMaxwellian velocity distribution. Assuming a homogenous\nand isotropic distribution of equal-mass stars, the relaxation\ntime is approximately\nTr ≈\n\n0.34σ3\nG2 ρm⋆ ln Λ\n\n−1\n−1\n≈ 1.2 × 1010 yr σ3100 ρ−1\n5 m̃⋆ ln Λ15\n\n(1a)\n(1b)\n\n(Spitzer 1987). Here, σ100 is the 1d stellar velocity dispersion\nin units of 100 km s−1 , ρ5 is the stellar mass density in units\nof 105 M⊙ pc−3 , m̃⋆ = m⋆ /M⊙ , and ln Λ15 = ln Λ/15, where\nln Λ is the Coulomb logarithm and Λ ≈ 0.4N (Spitzer 1987).\nFigure 1 shows estimates of Tr , measured at the supermassive black hole's influence radius rh , for the ACS/Virgo sample of early-type galaxies (Côté et al. 2004). The influence\nradius was defined in the usual way via\nM⋆ (rh ) = 2M•\n\n(2)\n\nand the black hole mass was inferred from the measured value\nof σ via the the M• − σ relation,\n4.86\nM• ≈ 5.72 × 106M⊙ σ100\n\n(3)\n\n(Ferrarese & Ford 2005). A stellar mass of 1M⊙ was assumed.\n\nF IG . 1.- Relaxation times, measured at the supermassive black hole's influence radius, in the ACS/Virgo sample of galaxies (Côté et al. 2004), versus\nthe central stellar velocity dispersion. Filled symbols are galaxies in which\nthe black hole's influence radius is resolved; star is the Milky Way.\n\nFigure 1 reveals a tight correlation between Tr (rh ) and σ. A\nleast-squares fit to the points (shown as the dashed line in the\nfigure) gives\n7.47\nTr (rh ) ≈ 1.16 × 1011 yr σ100\n1.54\n≈ 8.0 × 109 yr M•,6\n\n(4a)\n(4b)\n\nwhere M•,6 ≡ M• /106M⊙ . The results presented in this paper\nare only relevant to galaxies in which the nuclear relaxation\ntime is not much longer than galaxy lifetimes; according to\n−1\nFigure 1, this is the case for galaxies with σ <\n∼ 80 km s .\nThis is roughly the velocity dispersion near the center of the\nMilky Way; hence, the sort of evolution that is modelled here\nis most relevant to spheroids that are not much brighter than\nthe Milky Way bulge.\nThe N-body techniques are described in §2 and §3 and the\nresults of the N-body integrations are presented in §4. In §5\nthe Fokker-Planck model is described and compared with the\nN-body results. Predictions of the Fokker-Planck model in the\nlarge-N regime corresponding to real galaxies are presented in\n§6. §7 and §8 discuss the implications for evolution of binary\nsupermassive black holes in real galaxies, and §9 presents a\ncritical comparison with other proposed models of binary evolution. §10 sums up.\n2. N-BODY TECHNIQUES\n\nOur N-body algorithm was an adaptation of the NBODY1\ncode of Aarseth (1999) to the GRAPE-6 special purpose\nhardware. The code uses a fourth-order Hermite integration\nscheme with individual, adaptive, block time steps (Aarseth\n2003). For the majority of the particles, the forces and force\nderivatives were calculated via a direct-summation scheme\nusing the GRAPE-6. More details of the particle advancement scheme can be found in Paper II. As discussed there, the\ncode contains two parameters that affect the speed and accuracy of the calculation, the particle softening length ε and the\ntime-step accuracy parameter η.\nClose encounters between the massive particles (\"black\nholes\"), or between black holes and stars, require prohibitively small time steps in such a scheme. To avoid this\n\n\fBinary Black Holes\n\n3\n\nsituation, we adopted a chain regularization algorithm for the\ncritical interactions (Mikkola & Aarseth 1990, 1993), as follows. Let ri , i = 1, ..., N be the position vectors of the particles. We first identify the subset of n particles to be included in the chain; the precise criterion for inclusion is presented below, but in the late stages of evolution, the chain\nalways included the two black holes as its lowest members.\nWe then search for the particle that is closest to either end of\nthe chain and add it; this operation is repeated recursively until all n particles are included. Define the separation vectors\nRi = ri+1 − ri where ri+1 and ri are the coordinates of the two\nparticles making up the ith link of the chain. The canonical\nmomenta Wi corresponding to the coordinates Ri are given in\nterms of the old momenta via the generating function\nn−1\n\nS=\n\n∑ Wi * (ri+1 − ri).\n\n(5)\n\ni=1\n\nNext, we apply KS regularization (Kustaanheimo & Stiefel\n1965) to the chain vectors, regularizing only the interactions\nbetween neighboring particles in the chain. Let Qi and Pi be\nthe KS transformed Ri and Wi coordinates. After applying\nthe time transormation δt = gδs, g = 1/L, where L is the Lagrangian of the system (L = T −U, where T is the kinetic and\nU is the potential energy of the system). We obtain the regularized Hamiltonian Γ = g(H(Qi , Pi ) − E0 ), where E0 is the\ntotal energy of the system. The equations of motion are then\nP′i = −\n\n∂Γ\n,\n∂Qi\n\nQ′i =\n\n∂Γ\n∂Pi\n\nF IG . 2.- The average time step, as defined in the text, during two integrations of a binary black hole at the center of a Dehen-model galaxy.\nN = 20,000, and the softening length and time-step parameters of the Nbody code were ε = 10−6 ,η = 0.01. In the absence of the chain, the average\ntime step drops to very low values once the binary begins to harden.\n\n(6)\n\nwhere primes denote differentiation with respect to the time\ncoordinate s. Because of the use of regularized coordinates,\nthese equations do not suffer from singularities, as long as\ncare is taken in the construction of the chain.\nSince it is impractical to include all N particles in the chain,\nwe must consider the effects of external forces on the chain\nmembers. Let F j be the perturbing acceleration acting on the\njth body of mass m j . The perturbed system can be written in\nHamiltonian form by simply adding the perturbing potential:\nn\n\nδU = − ∑ m j r j * F j (t).\n\n(7)\n\nj=1\n\nOnly one chain was defined at any given time. At the start\nof the N-body integrations, there was no regularization, and\nall particles were advanced using the variable-time-step Hermite scheme. The first condition that needed to be met before\n\"turning on\" the chain was that one of the particles (including\npossibly a black hole) achieved a time step shorter than tchmin\nand passed a distance from one of the black holes smaller than\nrchmin . If this condition was satisfied, it was then checked\nwhether the encounter resulted in a deflection angle greater\nthan 2δ = π/2, where\n\u0015−1/2\n\u0014\nR2V04\n;\n(8)\ncos δ = 1 + 2\nG (m1 + m2)2\nhere R is the impact parameter, V0 is the pre-encounter relative\nvelocity, and m1 and m2 are the masses of the two particles.\nThis condition is equivalent to\nm1 + m2 > RV02 .\n\n(9)\n\nEach star closer to the black hole than rchmin was then added\nto the chain, and the two black holes were always included.\n\nF IG . 3.- Relative energy error over 100 time units of of a set of integrations\nlike those in Fig. 2, for various values of the softening length ε, and with the\nchain.\n\nThe values of tchmin and rchmin were determined by carrying\nout test runs; we adopted tchmin ≈ 10−5 − 10−6 and rchmin ≈\n10−4 − 10−3 in standard N-body units.\nThe chain's center of mass was a pseudoparticle as seen by\nthe N-body code and was advanced by the Hermite scheme in\nthe same way as an ordinary particle. However, when integrating the trajectories of stars near to the chain, it is essential\nto resolve the inner structure of the chain. Thus for stars inside\na critical rcrit1 radius around the chain, the forces from the individual chain members were taken into account. The value\nof rcrit1 was set by the size of the chain to be rcrit1 = λRch\n\n\f4\n\nMerritt, Mikkola & Szell\n\nwith Rch the spatial size of the chain and λ = 100. In addition, the equations of motion of the chain particles must include the forces exerted by a set of external perturber stars.\nWhether or not a given star was listed as a perturber was deter−1/3\nmined by a tidal criterion: r < Rcrit2 = (m/mchain )1/3 γmin Rch\nwhere mchain represents the mass of the chain, m is the mass\nof the star, and γmin was chosen to be 10−6 ; thus rcrit2 ≈\n102 (m/mchain )1/3 Rch .\nThe membership of the chain changed under the evolution\nof the system. Stars were captured into the chain if their orbits approached the binary closer than Rch . Stars were emitted\nfrom the chain if they got further from both of the black holes\nthan 1.5Rch . The difference between the emission and absorption distances was chosen to avoid a too-frequent variation of\nthe chain membership. When the last particle left the chain,\nthe chain was eliminated and the integration turned back to\nthe Hermite scheme, until a new chain was created.\nIn what follows, we refer to the N-body code without chain\nas NB1, and the code including chain as CHNB1. We carried\nout a number of tests to see how the performance and accuracy of the NB1 code were affected by inclusion of the chain.\nTypically, one integration step of the chain required about\nfive times as much cpu time as a single call to the GRAPE6, due to the complex nature of the chain and the generally\nlarge number of perturber particles. Thus our code is quicker\nthan a basic Hermite scheme code (NB1) only if the smallest time steps are about an order of magnitude shorter than\nthe next smallest time steps, and if in addition those particles\nwould be assigned to the chain. It is easy to show that in the\ncase of a galaxy including a central, massive binary system\nthis condition is usually fulfilled. The Hermite time step of\nthe binary is considerably smaller than the time steps of the\nstars, due to their close orbit and fast evolution. Of course,\nthe performance of both codes depends on the two parameters\nη (time step parameter) and ε (particle softening length) that\ndetermine the accuracy of the star-star interactions. In what\nfollows, we fixed η = 0.01 based on the results of the tests in\nPaper II. In CHNB1, ε was always set to zero.\nFigures 2-4 show the results of our performance tests. Figure 2 plots the average time step as a function of time in\nboth codes, for integrations of a binary black hole in a galaxy\nmodel following Dehnen's (1993) density law:\nρ(r) =\n\n(3 − γ)Mgal\na\nγ\n4π\nr (r + a)4−γ\n\n(10)\n\nwith γ = 1.2 and N = 20, 000 particles. The two black holes\nhad equal masses, M1 = M1 = 0.01Mgal , and were placed intially on a circular orbit with separation 0.10a. We defined the\naverage time step as t/Ntimesteps (t), where Ntimesteps (t) was the\ntotal number of integration time steps until time t, including\nonly the time steps of particles outside the chain. It can be\nseen that in the early stages of the evolution, the time steps are\nabout the same in both cases. However as the binary becomes\nharder, the NB1 time steps become smaller and smaller, in\norder to achieve the necessary precision in the integration of\nthe binary. In the code with the chain, the average time step\nhardly changes after the binary begins to harden. The binary\nis integrated by the regularized equations, hence the step size\nof the NB1 integration remains relatively large. The average\nstep size of the CHNB1 code was about 2.5 × 10−5 (in units\nwhere G = Mgal = a = 1), while in the NB1 integration it was\n3 × 10−6. The resulting net speed-up with the chain is more\n\nF IG . 4.- Results of a set of test integrations with and without the chain.\nInitial conditions consisted of a binary of mass M1 = M2 = 0.005 and separation 0.1, in a Dehnen-model galaxy with γ = 1.2 and N = 20,000.\n\nthan a factor of two.\nFigure 3 shows the energy error in a set of integrations of\nthe same model but with various different softening lengths\nε, compared with the energy error in an integration with the\nchain (and ε = 0). It can be seen that the energy conservation\nof the CHNB1 code is about as good as the best results from\nthe NB1 integrations. However, the latter occur when the soft-\n\n\fBinary Black Holes\n\n5\n\nF IG . 5.- Evolution of 1/a, the inverse binary semi-major axis (left column), and e, the binary eccentricity (right column), in the full set of N-body integrations.\n\n\f6\n\nMerritt, Mikkola & Szell\n\nening length is very large, much too large for accurate integration of the binary. This is shown in Figure 4. It is evident from\n−5\nthat figure that with larger softening lengths, ε >\n∼ 10 , the integration of the binary is not very accurate. However, even\nwith very small ε, the evolution of the distance between the\nblack holes includes \"spiky\" behaviors, due apparently to the\nvery sensitive nature of the eccentricity evolution with respect\nto the precision of the integration (Figure 4b,c).\nThese results suggest that chain regularization is an accurate and efficient way to integrate binary black holes at the\ncenters of galaxies. It can keep track of the evolution of the\nbinary with high precision, and the calculation time is substantially faster than a plain Hermite integration when the latter is used with a reasonable (i.e. sufficiently small) softening\nparameter.\n3. INITIAL CONDITIONS\n\nAll of our integrations adopted Dehnen's model, equation (10), for the initial galaxy, with γ = 0.5. To this model\nwere added two particles, the \"black holes,\" with masses\nM1 = M2 = 0.005 in units of the galaxy mass. (Henceforth\nwe write M12 ≡ M1 + M2 .) The black holes were placed\nsymmetrically about the center of the galaxy at x = ±0.1.\nThe initial velocities of the black holes were chosen to be\nvy = ±0.16 yielding nearly circular initial orbits. These initial\nconditions are similar to those adopted in some earlier studies\n(Quinlan & Hernquist (1997); Nakano & Makino (1999)) although they are probably less realistic than initial conditions\nthat place one of the two massive particles exactly at the center (e.g. Merritt & Szell (2006)). Henceforth we adopt units\nsuch that the gravitational constant G, the total mass in stars\nMgal , and the Dehnen scale length a are equal to one. In these\nunits, the crossing time (GMgal /a3 )−1/2 is also equal to one.\nA standard expression for rh , the radius of influence of a\nsingle black hole at the center of a galaxy, is\nM⋆ (rh ) = 2M•\n\n(11)\n\nwith M• the black hole mass and M⋆ (r) the mass in stars\nwithin a sphere of radius r . The semi-major axis length of\na \"hard\" binary is sometimes defined in terms of rh as (e.g.\nMerritt & Wang (2005))\nah =\n\nα\n\nrh\n(1 + α) 4\n2\n\n(12)\n\nwith α ≡ M2 /M1 ≤ 1 the binary mass ratio, and we adopt that\ndefinition here. Setting M• = M12 = 0.005 + 0.005 = 0.01 and\nα = 1, the values of rh and ah for our N-body models are\nrh = 0.264,\n\nah = 0.0165.\n\n(13)\n\nThese expressions ignore the changes that the two black holes\ninduce in the mass distribution of the galaxy when forming a\nhard binary, but are useful as points of reference.\nBased on the results of Papers I and II, once the binary has\ninteracted with and ejected most of the stars on intersecting\norbits, its subsequent evolution is dependent on the continued scattering of stars into its sphere of influence; since the\nscattering time scale increases with N, the binary's decay rate\nshould decrease as N increases. In order to better characterize\nthis N-dependence, the initial conditions were realized using\nsix different values of N, N = (8192, 16384, 32768, 65536,\n131072, 262144), or N = 2 p, p = (13, 14, 15, 16, 17, 18). (In\nwhat follows, we refer to these different N-values via the\n\nTABLE 1\nPARAMETERS OF THE N- BODY INTEGRATIONS\nName\n8K\n16K\n32K\n65K\n131K\n262K\n\nN\n8192\n16384\n32768\n65536\n131072\n262140\n\nnint\n18\n8\n6\n4\n2\n1\n\nshorthand 8K, 16K, ..., 262K). The largest of these N values is close to the maximum number of particles that can be\nhandled in the GRAPE-6 memory. In order to decrease the\n\"noise\" associated with the evolution for small N, we carried\nout nint multiple integrations at each N, in which the initial\nstellar postions and velocities were calculated using different\nseeds for the random number generator. All of these integrations were continued until a time Tmax = 350; when scaled to\na typical luminous elliptical galaxy with crossing time ∼ 108\nyr, this corresponds to ∼ 1010 yr. Table 1 gives the parameters\nof the N-body integrations.\n4. N-BODY RESULTS\n\nInitially the two black holes move on nearly independent\norbits about the center of the galaxy. The orbits decay, and\nat t ≈ 10 the black holes form a hard binary. After this, the\nsemimajor axis a of the binary shrinks as the two black holes\ninteract with stars and eject them from the nucleus via the\ngravitational slingshot. Figure 5 shows the evolution of 1/a\nand e, the orbital eccentricity, in the full set of integrations for\nt ≥ 20. The scatter in the values of 1/a and e at a given time\nis considerable in the integrations with smallest N. Nevertheless a clear trend is apparent: both 1/a and e evolve less, on\naverage, as N is increased.\n4.1. Binary Hardening\nIn order to clarify the N-dependence of the evolution, we\ncomputed averages over the nint independent integrations of\na−1 (t) and e(t). Figure 6 shows the mean evolution of 1/a\nfor the six different N values. The early evolution (Fig. 6a),\nuntil t ≈ 10, is essentially N-independent. In this regime, the\nhardening of the binary is driven by dynamical friction against\nthe stars, and the rate of binding energy increase is a function\nonly of the stellar density, which is the same for each of the\nN-body models.\nAt t ≈ 10, the binary hardening rate begins to show a clear\nN-dependence, in the sense of more gradual hardening for\nlarger N. In Merritt (2006), the separation at which this occurs was defined as the \"stalling radius,\" since in the limit of\nlarge N the binary would stop evolving at this point. Based on\n−1\nFigure 6, a−1\nstall ≈ ah ≈ 60 and tstall ≈ 10.\nt\nthe\nN-dependence\nof the evolution is striking\nAt t >\n∼ stall\n(Fig. 6b). As in Paper II, we define the instantaneous hardening rate as\n\u0012 \u0013\nd 1\n.\n(14)\ns(t) ≡\ndt a\n\nFigure 7 shows hsi(t) computed by fitting smoothing splines\nto the averaged a−1 (t) curves of Figure 6b. Mean hardening rates are roughly constant with time for each N. The Ndependence of the hardening rate is shown in Figure 8. Here,\nhsi was computed by fitting a straight line to ha−1 i(t) in an\ninterval ∆t = 50 centered on ha−1 i(r) = 750; in this way, the\n\n\fBinary Black Holes\n\n7\n\nF IG . 6.- Short-term (a) and long-term (b) evolution of the mean value of 1/a in the N-body integrations. Horizontal line in panel (a) indicates approximately\nwhere the transition occurs between N-independent and N-dependent evolution; this is also roughly the \"stalling radius\" defined in Merritt (2006), and the \"hard\nbinary\" separation defined in Yu (2002).\n\ndifferent hardening rates are being compared at similar values of the binary semi-major axis, chosen to be roughly the\nminimum value reached in the integration with largest N. The\ndependence of hsi on N is approximately a power law,\nlog10 s ≈ 2.27 − 0.357 log10 N.\n\n(15)\n\nThe ∼ N −0.4 dependence is considerably flatter than the ∼\nN −1 dependence expected in a diffusively-refilled loss cone\n(Milosavljević & Merritt 2003). This fact precludes any simple extrapolation of the data in Figure 8 to the much larger N\nregime of real galaxies.\nWe can compare these hardening rates with the predictions\nof scattering experiments in a fixed, infinite, homogeneous\nbackground:\n\u0012 \u0013\nd 1\nGρ\ns≡\n=H\n(16)\ndt a\nσ\n\nwith ρ and σ the mass density and 1d velocity dispersion of\nthe stars, and H a dimensionless rate coefficient that depends\non the binary separation, mass ratio and eccentricity. For a\nhard, equal-mass, circular-orbit binary, H ≈ 16 (Hills 1983;\nMikkola & Valtonen 1992; Quinlan 1996a; Merritt 2001).\nUnfortunately, neither ρ nor σ are well defined for our Nbody models: ρ is formally divergent as r → 0 (eq. 10), and σ\ndrops to zero at the origin in the absence of the central binary\n(Dehnen 1993). We can crudely evaluate equation (16) by setting ρ ≈ 0.595(0.338) and σ ≈ 0.216(0.244), the mean and\nmass-weighted, rms values within a sphere of radius 0.1(0.2)\nabout the center of the (binary-free) Dehnen model. The results, with H = 16, are s ≈ 44(22). These are likely to be\noverestimates: the central density of the galaxy drops as the\nbinary ejects stars and the central velocity dispersion is increased by the presence of the binary. If we decrease ρ by a\nfactor of two to account for ejections and set σ equal to the\nrms velocity dispersion in the γ = 0.5 Dehnen model containing a central, M = 0.01 point mass, the predicted hardening\nrates drop to ∼ 13(8). These numbers are reasonably con-\n\nsistent with the low-N hardening rates shown in in Figure 8,\ns ≈ 6.5, suggesting that the binary is approximately in the\n\"full loss cone\" regime at these low values of N.\n4.2. Eccentricity Changes\n\nThe N-dependence of the eccentricity evolution (Figure 9)\nis not quite so transparent. Although the two black holes\nwere initially placed on circular trajectories, perturbations\nfrom passing stars sometimes resulted in very non-zero eccentricities developing around or even before the time the\nbinary became hard. This was especially true in the smallN integrations (Fig. 5); for N = 8K, the mass ratio between\nblack hole and star was only 40 and a single star-binary interaction at early times could induce a substantial change in\nthe binary's orbit. Once established at early times, these\neccentricities tended to persist. Spurious changes in e in\nsmall-N-body simulations have been noted by other authors\n(Quinlan & Hernquist 1997; Milosavljević & Merritt 2001).\nHowever the general trend in Figures 5 and 9 is clearly toward smaller eccentricities for larger N.\nStatements about eccentricity evolution of massive binaries\nare often based on the results of three-body scattering experiments (Mikkola & Valtonen 1992; Quinlan 1996a; Merritt\n2001). In these experiments, changes in e are typically expressed in terms of changes in a as\n\u001c\n\u0012 \u0013\u001d\n\u001c \u001d\nd\n1\nde\n=K\n(17)\nln\ndt\ndt\na\nwhere K = K(e, a) is a dimensionless rate coefficient and\nhi indicates averages over impact parameter and velocity at\ninfinity. Mikkola & Valtonen (1992) and Quinlan (1996)\ngive approximate analytic fits to K1 (e, a, v∞ ), the impactparameter-averaged rate coefficient describing changes in e\ndue to interaction of the binary with stars of a single velocity\nv∞ . These expressions for K1 can be converted into expressions for K by averaging over an assumed velocity distribution at infinity, and Quinlan (1996, Fig. 9) shows the results of\n\n\f8\n\nMerritt, Mikkola & Szell\n\nF IG . 7.- Binary hardening rate as a function of time, computed as an average over the nint independent integrations at each N. Line styles have the\nsame meaning as in Figure 6. Tick marks indicate where the hardening rate\nwas evaluated for Fig. 8, i.e., at ha−1 i = 750.\n\nF IG . 9.- Evolution of the mean value of e. Each line is an average of the e\nvalues in the various N-body integrations that started from different random\nrealizations of the same initial conditions. Dashed lines show solutions to\nequation (20).\n\nComparing these predictions quantitatively with the Nbody experiments is desirable, but problematic for a variety\nof reasons, the most important of which is probably the strong\ndependence of K on σ/Vbin , where σ is the stellar velocity dispersion (assumed independent of position) and Vbin the binary\norbital velocity. In galaxy models like ours, σ is a steep function of radius near the galaxy's center and it is not clear what\nvalue to choose.\nIn the limit of large binding energy, Vbin ≫ σ, the velocity\nat infinity is irrelevant and K as determined by the scattering\nexperiments becomes independent of a. Mikkola & Valtonen\n(1992) find for K in this limit the approximate expression\n\u0001\ni\n\u0001m\n1 − e2 h\n(18a)\n1 − e2 − 1 ,\nK(e) ≈\n2e\nm = 0.3e2 − 0.8\n(18b)\n\nF IG . 8.- N-dependence of the binary hardening rate, computed by fitting\na (t) in an interval ∆t = 50 centered on a−1 = 700. Asterices: N-body\nresults (Fig. 6(b)), computed as averages over the set of ensembles at each\nN. Filled circles: Fokker-Planck results (Fig. 14), omitting the \"secondary\nslingshot.\" Open circles: Fokker-Planck results, including the \"secondary\nslingshot.\"\n−1\n\nsuch a calculation. (Sesana et al. 2006 present similar plots.)\nEvolution is always found to be in the direction of increasing\neccentricity, i.e. K ≥ 0, excepting possibly in the case of soft,\nnearly-circular binaries (Quinlan 1996, Fig. 9d-f). Evolution\nrates tend to increase with increasing hardness of the binary,\nreaching maximum values of K ≈ 0.2 for equal-mass binaries\nwith e ≈ 0.75 and falling to zero at e = 0 and e = 1. This\nis at least qualitatively consistent with Figure 9, which shows\nde/d ln(1/a) generally increasing at late times, i.e. for larger\nbinding energies.\n\nwhile Quinlan (1996) gives, for an equal-mass binary in the\nlarge-binding-energy limit,\n\u0001k\n(19a)\nK(e) ≈ e 1 − e2 0 (k1 + k2 e) ,\n(k1 , k2 , k3 ) = (0.731, 0.265, 0.230).\n\n(19b)\n\nFigure 10 shows that the two expressions are in good agreement.\nA rough value of σ/Vbin in our simulations is ∼ 2a1/2,\nwhere σ has been set to ∼ 0.2, its mean value within a\nsphere of radius 0.1 (neglecting the effects of the binary). For\n−1\na−1 in the range 500 <\n∼ 2500 (Fig. 6), this expression\n∼a <\n>\n0.04.\nFigure 9 from Quinlan (1996)\nσ/V\ngives 0.1 >\nbin ∼\n∼\nsuggests that K(e) reaches its large-binding-energy limit for\nσ/Vbin <\n∼ 0.05, so our simulations should be in or near this\nregime at late times.\nAccordingly, Figure 9 shows solutions to\nde = K(e) d ln a−1\n\n(20)\n\nusing Quinlan's expression for K(e). The agreement with the\nN-body results is quite reasonable, especially for the larger\n\n\fBinary Black Holes\n\n9\n\ndeficit since the time at which a = ah ; as above, we take this\ntime to be t = 10 (Fig. 6).\nWhen plotted vs. ah /a (Fig. 11b), the N-dependence of the\nevolution almost disappears, allowing the differential mass\ndeficit to be expressed almost uniquely in terms of the change\nin semi-major axis. As shown below, a binary would not be\nexpected to evolve past a−1 ≈ 100a−1\nh before gravitational\nwave losses begin to dominate the evolution, implying a maximum mass deficit of ∼ 5M12 ; however an extrapolation of this\nprediction to the much larger N regime of real galaxies would\nbe dangerous. Figure 12 shows averaged density profiles at\nvarious times for the integrations with N = 65K.\n5. THE FOKKER-PLANCK MODEL\n\nF IG . 10.- Two approximations, derived from three-body scattering experiments, for the coefficient K (eq. 17) describing the rate of eccentricity evolution in the limit of large binding energy. Solid line: Quinlan (1996); dashed\nline: Mikkola & Valtonen (1992). The solid line was used to computed the\nevolutionary tracks (dashed lines) in Fig. 9.\n\nvalues of N. Nevertheless, we stress again that the final eccentricity values in our N-body simulations are influenced\nstrongly by noise-induced changes in e at early times, and\nthese changes would be much smaller in the large-N regime\nof real galaxies.\n4.3. Mass Deficits\nAs the binary hardens, it ejects stars from the nucleus and\nlowers its density. These density changes are sometimes estimated from scattering experiments in a fixed background\nlike those described above, e.g. the change in core mass\nis equated with the mass \"ejected\" by the binary. However the fact that the binary continues to harden at late times\n(Fig. 6b) implies that depopulated orbits are continually being\nre-supplied. Changes in nuclear density are therefore a competition between ejection of stars (some of which may remain\nbound to the core) and re-population of orbits by gravitational\nscattering. A number of other mechanisms can also influence\nthe evolution of the central density; for instance, loss of matter from the core lowers its binding energy and causes it to\nexpand. The net effect of these various processes is difficult\nto estimate without full N-body simulations.\nWe follow the standard practice of describing changes in\ncore mass in terms of the mass deficit Mde f , defined by\nMilosavljević et al. (2002) as the difference in integrated mass\nbetween the density profile and the initial density profile,\nwithin the region influenced by the binary. Mass deficits\nhave been estimated in a number galaxies (Milosavljević et al.\n2002; Ravindranath et al. 2002; Graham 2004; Merritt 2006)\nusing assumed forms for the pre-existing density profile. Figure 11 shows Mde f versus time, and versus binary semi-major\naxis, for the averaged N-body integrations.\nAs in previous work (Milosavljević & Merritt 2001; Merritt\n2006), we find that the mass deficit increases suddenly when\na ≈ ah , to a value Mde f ≈ M12 . Since the initial conditions\nadopted here are rather artificial – neither of the black hole\nparticles was placed at the center, for instance – the value\nwhich we find for Mde f at this time may not accurately reflect the value following a real galaxy merger. We therefore\npresent in Figure 11 Mde f − Mde f ,h , the change in the mass\n\nAs shown in Figure 8, the N-dependence of binary\nhardening rate in the N-body simulations is s ∼ N −0.4 .\nThis is substantially flatter than the ∼ N −1 dependence\nexpected in a diffusively-repopulated (\"empty\") loss cone\n(Milosavljević & Merritt 2003), which makes it difficult to\nextrapolate the N-body results to the regime of real galaxies.\nIn this section we develop a Fokker-Planck model that can reproduce the N-body results and which can also be applied to\nsystems with arbitrarily large N. Unlike previous treatments\nof this problem based on encounter theory, we allow the radial\ndistribution of matter to evolve in our Fokker-Planck models,\ndue both to loss of stars that interact with the binary, and to\ndiffusion in energy of non-interacting stars. These improvements will be shown to be crucial for accurately reproducing\nthe N-body results. They also allow us, for the first time, to\nmake quantitative predictions about the evolution of the mass\ndeficit in galaxies where binary evolution is driven by collisional loss-cone repopulation.\n5.1. Loss-cone Dynamics\n\nConsider a spherical galaxy containing a massive central\nbinary that acts like a sink, ejecting stars that come sufficiently\nclose to it. Let E = −v2 /2 + ψ(r) be the binding energy per\nunit mass of a star in the combined potential Φ(r) = −Ψ(r)\nof the galaxy and the binary; the latter is approximated as\n−GM12 /r. The binary defines a loss cone of orbits that satisfy\nJ<\n∼ Jlc (E), where\n2\n[ψ(rlc ) − E] ≈ 2GM12 rlc ;\nJlc2 (E) = 2rlc\n\n(21)\n\nhere J is the angular momentum per unit mass of a star and\nrlc is the radius of the ejection sphere around the binary.\nSuppose that the binary has interacted with and ejected all\nstars that were initially on orbits satisfying J ≤ Jlc . (In Fig. 6,\nthis appears to have occurred by a time of ∼ 15.) The binary's\nsubsequent hardening is limited by the rate at which stars are\nscattered onto previously depleted loss-cone orbits. A fundamental quantity is the ratio qlc (E) between the orbital period\nP(E) and the (orbit-averaged) time scale for diffusional refilling of the consumption zone (Paper I):\nqlc (E) ≡\n\n1\nRlc (E)\n\nI\n\ndr\nh(∆R)2 i\nlim\n.\nvr R→0 2R\n\n(22)\n\nHere R ≡ J 2 /Jc (E)2 is a dimensionless angular momentum\nvariable, 0 ≤ R ≤ 1, with Jc (E) the angular momentum of a\ncircular orbit of energy E, and h(∆R)2 i is the diffusion coefficient associated with R. The limit R → 0 in equation (22)\nreflects the approximation that only very eccentric orbits are\nscattered into the binary; the orbital period is likewise defined\n\n\f10\n\nMerritt, Mikkola & Szell\n\nF IG . 11.- Evolution of the mass deficits in the N-body integrations, vs. time (a) and semi-major axis (b). ah is the binary separation at t = 10, when the hard\nbinary forms, and Mde f ,h is the mass deficit at this time. Line styles have the same meaning as in Figure 6.\n\nF IG . 12.- Evolution of the mean density profile in the 64K integrations.\nBlack: t = 0; red: t = 50; blue: t = 150; green: t = 250; orange: t = 350.\n\nin terms of a J = 0 orbit. This approximation breaks down\nfor the most bound orbits but as we show, almost all of the\nloss cone repopulation comes from stars weakly bound to the\nbinary.\nIn the case of orbits with periods much shorter than the refilling time (qlc ≪ 1), the system is \"diffusive\" and the loss\ncone is largely empty. For orbits with periods much longer\nthan the refilling time (qlc ≫ 1), the system is in the \"pinhole\" or \"full loss cone\" regime. In a galaxy containing a binary with fixed rlc , qlc increases with decreasing E, i.e. with\nincreasing distance from the binary. The energy at which\nqlc = 1 is defined as the critical energy, Ecrit , that separates\nempty- from full loss cone regimes. The N-dependence of the\nproblem appears via the angular momentum diffusion coeffi-\n\n\u0001\ncient h ∆R2 i, which scales (approximately) linearly with the\nmean stellar mass, i.e. inversely with N for a fixed mass of the\ngalaxy (Paper I). Other factors that influence qlc are the degree\nof central concentration of the galaxy (high central density\nimplies larger qlc ) and the size rlc of the interaction sphere\n(i.e. the binary semi-major axis). Milosavljevic & Merritt\n9\n(2003) show that massive binaries in real galaxies (N >\n∼ 10 )\nare essentially always in the empty loss cone regime, even in\nthe extreme case of a ρ ∼ r−2 stellar density cusp, due to the\nlong relaxation times and to the large physical size of a binary.\nAs a first step toward understanding the evolution of the binary in our N-body simulations, we plot in Figure 13a qlc (E)\nfor our initial galaxy model, assuming two values for rlc at\n−1\neach N: rlc\n= 100, corresponding to the time t ≈ 15 when\nthe hardening rate has just begun to exhibit a dependence on\nN (Fig. 6); and rlc = a(t = 350), the final value of a (different\nfor each N). This figure suggests that none of the integrations\nwas fully in the empty loss cone regime characteristic of real\ngalaxies; even for N = 262k, qlc > 1 except at energies close\nto ψ(rh ) (as defined above, rh is the gravitational influence radius of the central mass, i.e. the radius containing a mass in\nstars equal to twice M12 ). As the binary hardens, qlc increases\nin all of the simulations, and at the final time step, qlc > 1 at\nE < ψ(rh ) for all N, i.e. the binary has evolved essentially\ncompletely into the full loss cone regime.\nA more useful characterization of the binary's loss cone\nis shown in Figure 13b. For this figure, the flux of stars\ninto rlc was computed, and broken into two parts: the flux\nFfull originating from stars at energies such that qlc ≥ 1; and\nFempty , from stars with energies such that qlc < 1. The energydependent flux F (E) can be derived from the orbit-averaged\nequation describing diffusion in J (Eq. 19, Paper I):\n\u0012\n\u0013\n∂N\nRlc\n∂\n∂N\nR\n,\n=\nqlc\n∂t\nP\n∂R\n∂R\n\n(23)\n\nwhere N (E, R,t) = 4π2 P(E)Jc2 (E) f (E, R,t) is the number\n\n\fBinary Black Holes\n\n11\n\nF IG . 13.- (a) The function qlc (E) that describes the ratio of the orbital period at E to the timescale for diffusional refilling of the loss cone; q ≫ 1 indicates\nthat the loss cone is \"full,\" and real galaxies have qlc < 1. Line styles have the same meaning as in Figure 6. Thick curves show qlc for a−1 = 100, when binary\nhas just entered the N-dependent phase of its evolution (Fig. 6). Thin curves show qlc for the binary at the final time step, t = 350; the binary separation at this\ntime is different for each N. The radius of the loss sphere has been set to a. Vertical dotted line is E = ψ(rh ). (b) The fraction of the flux of stars into the binary's\nloss cone that is contributed at energies where qlc ≥ 1, i.e., where the loss cone is essentially full. Lines show predictions for N = (0.5,1,2,4) × 106 . These plots\nignore binary-induced changes in the mass distribution of the galaxy.\n\ndensity of stars in the (E, R) plane. 1 . The flux into the binary is\n\u0014\n\nd\nF (E)dE = −\ndt\n\nZ 1\nR0\n\n\u0015\n\nN (E, R,t)dR dE\n\n\u00151\n\u0014\ndN\nRlc\ndE\n= − qlc R\nP\ndR R0\n\u0014\n\u0015\n∂f\n= 4π2 Jlc2 (E)qlc (E) R\ndE.\n∂R R0\n\nF (E)dE = 4π2 Jlc2 (E)qlc (E)\n(24a)\n(24b)\n(24c)\n\nIn these expressions, f has been allowed to fall to zero at an\nangular momentum R0 (E) that is different from Rlc (E). Cohn\n& Kulsrud (1979) derived an approximate expression for R0 :\n\u001a\nexp(−qlc ),\nqlc (E) > 1\nR0 (E) = Rlc (E)×\n√\nexp(−0.186qlc − 0.824 q), qlc (E) < 1.\nFor qlc ≪ 1, R0 ≈ Rlc but as qlc increases, the loss cone is\nlargely full and R0 ≈ 0. Finally, we adopt the steady-state\nsolution to equation (23) for f , i.e.\nf (R; E) =\n\nln (R/R0 )\nf (E)\nln (1/R0 ) − 1\n\n(assuming R0 ≪ 1) implying a diffusive flux\n\n(25)\n\n1 We assume in writing equation (23) that the orbit-averaged FokkerPlanck equation can be applied near the loss-cone boundary. This is valid\nfor the diffusively-repopulated loss cone of a binary in a real galaxy, but may\nnot be valid at low energies in the N-body simulations since the loss cone is\nnearly full and the separation of time scales on which the orbit-averaging is\nbased breaks down. Nevertheless equation (23) is traditionally applied even\nin this regime (Cohn & Kulsrud 1978; Magorrian & Tremaine 1999). Our expression for the flux does tend to the correct limit in the full loss cone regime,\nqlc ≫ 1. See Shapiro & Marchant (1982) for a treatment of the loss cone that\nis not based on the orbit-averaged approximation\n\nf (E)\ndE.\nln (1/R0 ) − 1\n\n(26)\n\nHere, f = 01 f (E, R)dR is the isotropic f that has the same\ntotal number of stars at each E as the true f (E, R).\nAs noted above, the loss cone of a binary black hole in a\nreal galaxy is essentially empty, i.e. almost all of the stars\nscattered into the binary would come from energies E > Ecrit .\nFigure 13b shows the results of applying equation (26) to our\ninitial N-body model, with rlc = a and with a allowed to vary\n−1\nover the range 100 ≤ a−1 ≤ at=350\n. In this figure, Ff ull is\nthe flux integrated from 0 to Ecrit and F is the total flux. At\nthe start of the N-body integrations, Figure 13b suggests that\nthe binary in the larger-N models (N >\n∼ 64k) is essentially in\nthe empty loss cone regime, Ff ull ≪ F. However by the final\ntime step, the binary has shrunk and entered into the \"pinhole\" regime, Ff ull > Fempty , for all N. In the integrations\nwith N <\n∼ 16k, the binary is in the full loss cone regime from\nthe start.\nFigure 13b also includes curves for the cases N =\n(0.5, 1, 2, 4) × 106. Values of N up to 4 × 106 are now computationally feasible via direct-summation codes combined with\nspecial-purpose hardware (Harfst et al. 2006), and Figure 13b\nsuggests that this N value is large enough to place the binary\neffectively in the empty loss cone regime for most of its evolution. (The minimum required N would be larger than this if\nthe binary were given the smaller mass, ∼ 10−3 Mgal , typical\nof black holes in real galaxies, or if the galaxy model were\nmore centrally concentrated.)\nFigure 13 illustrates the difficulty of scaling the binary evolution observed in our N-body simulations to real galaxies. In\nthe empty loss cone (i.e. diffusive, large-N) limit, the supR\n\n\f12\n\nMerritt, Mikkola & Szell\n\n\u0001\nply of stars to the binary scales as h ∆R2 i ∝ m⋆ ∝ N −1 for\na fixed total galaxy mass (ignoring the weak dependence of\nthe Coulomb logarithm on N). In the full loss cone (pinhole, small-N) limit, the loss cone flux is independent of N.\nIn between these limiting cases, one expects (Paper I) that\nthe flux, and hence the hardening rate of the binary, scales as\n∼ N −β , 0 < β < 1. This is consistent with the s ∼ N −0.36 dependence observed here (equation 15). Figure 13b suggests\nthat of order N ≈ 107 stars would be required before the binary is comfortably in the empty loss cone regime, allowing\nits evolution to be reliably scaled to larger values of N.\nEven if we were in this regime, the expressions given above\nfor the flux of stars into the binary's loss cone might not\naccurately predict the binary's evolution, since they ignore\nchanges in the galaxy's structure. Figure 12 suggest that these\nchanges are significant: the density near the galaxy's center\nchanges by a factor ∼ 2 as the binary hardens. We now consider a model that includes both changes in the binary due to\ninteraction with stars, as well as binary-induced changes in\nthe stellar distribution, and that can be reliably scaled to the\nlarge-N regime of real galaxies.\n\nFE is the energy-directed flux, given by\nFE = −DEE\n\n∂f\n− DE f\n∂E\n\u0014\n\nDEE = 64π4 G2 m⋆ ln Λ q(E)\n\u0015\nZ ∞\ndE ′ q(E ′ ) f (E ′ ) ,\n+\nE\n\nDE = −64π4G2 m⋆ ln Λ\n\nThe J-directed flux of stars into the binary, described by\nequation (26), implies a decrease in the number of stars at\n< Jc (E). In Paper I, this decrease was followed by in<J ∼\nJlc ∼\ntegrating equation (23) forward in time at fixed E. The justification for treating the problem in this restricted way was the\ndifference in time scales between E- and J-diffusion; the former occurs in a time ∼ Tr while the latter requires ∼ (ah /r)Tr .\nThe evolution of f (J; E) and F (E) over the shorter of these\ntime scales was followed starting from a completely emptied\nloss cone and the change in the density of the core was computed from the changes in N(J; E) at every E.\nIn the present paper, we focus on changes that take place\nover the longer of these two time scales, ∼ Tr . This allows\nus to largely ignore the initial conditions, and to assume that\nan expression like (25) is an adequate description of the Jdependence of f at every E. However it also implies that we\ncan not ignore changes in E, which occur on timescales of\n∼ Tr .\nOn these longer time scales, the evolution of the density\nnear the binary is a competition between loss of stars that diffuse onto low-J orbits and are ejected by the binary, as described by F (E), and replenishment due to stars that diffuse\nin energy from regions of lower E, i.e. larger radius. Beyond a certain radius, the relaxation time is so long that the\nE-directedRflux can not compensate for the integrated losscone flux, F (E)dE, and the mean density within this radius\nmust drop – implying the creation of a mass deficit.\nWe can approximate the evolution of the galaxy/binary system in this late-time regime via a modification of the orbitaveraged Fokker-Planck equation for f (E):\n∂FE\n∂N\n=−\n− F (E,t),\n∂t\n∂E\n\n(27)\n\nwhere F is the J-directed flux defined in equation (26), and\n\nZ ∞\nE\n\n0\n\ndE ′ f (E ′ )\n(28b)\n\ndE ′ p(E ′ ) f (E ′ )\n\n(28c)\n\nIn these expressions, f (E) is understood to be the mass\ndensity of stars in phase space associated with the function\nf (E) defined above, and the quantities FE and F are mass\nfluxes. N(E)dE = 4π2 p(E) f (E)dE is energy-space distribution, with p(E) and q(E) the phase-space weighting factors,\n\np(E) = 4\n\nZ rmax (E)\n\nv(r)r2 dr,\n\n(29a)\n\n0\n\nq(E) =\n5.2. Evolutionary Model\n\n(28a)\nZ E\n\n4\n3\n\nZ rmax (E)\n\nv3 (r)r2 dr,\n\n(29b)\n\n0\n\nand v = [2Φ(r) − 2E]1/2 . Near the binary, where the poten3 |E|−5/2 and\ntial is close to Keplerian, p(E) ≈ 2−3/2 πG3 M12\n1/2\n3\n3\n−3/2\nq(E) = (2 π/6)G M12 |E|\n. ln Λ ≈ ln(M12 /m⋆ ) is the\nCoulomb logarithm. Henceforth f and N are explicitly defined as mass (not number) densities, and F is the mass flux\ninto the binary's loss cone.\nAn equation like (27), in which the J-dependence of f\nis contained implicitly in F (E,t), was first written by Bahcall & Wolf (1977). It has since been adopted by a number of other authors to describe the evolution of the distribution of stars, compact objects or dark matter around a single\nsupermassive black hole (Murphy et al. 1991; Merritt 2004;\nHopman & Alexander 2006). It is being used for the first time\nin the present paper to describe the evolution of the stellar\ndistribution about a binary black hole. Since F scales only\n−1\nas ∼ log rlc\n(equation 26), the ratio of the two terms on the\nright hand side of equation (27) is not greatly affected by the\nmuch greater (in linear extent) size of the loss cone of a binary\ncompared with a single black hole.\nThe relation between the flux into the binary's loss cone and\nthe rate of change of its semi-major axis a is\n\u0012\n\u0013\nZ\nd GMμ\n= − F (E,t)∆EdE\n(30)\ndt\n2a\nwith μ ≡ M1 M2 /M, the binary reduced mass and ∆E(E) the\nmean specific energy change of stars, originally at energy E,\nthat interact with the binary. In Paper II, we set\nGμ\n∆E = ∆EHills = −hCi ,\na\n\u0012 \u0013\nZ\nd 1\n2hCi\ns(t) ≡\n=\nF (E,t)dE.\ndt a\naM\n\n(31a)\n(31b)\n\nThe coefficient hCi is independent of energy for stars that interact with a \"hard\" binary (Hills 1983; Mikkola & Valtonen\n1992; Quinlan\n1996a). Hardness is defined as Vbin /σ, where\np\nVbin = GM12 /a is the relative velocity of the components of\n\n\fBinary Black Holes\n\n13\n\nF IG . 14.- (a) Fokker-Planck evolution of binary semi-major axis in a set of integrations designed to mimic the N-body simulations with N = 65k. Dot-dashed\nline: fixed potential and density; dashed line: fixed potential, evolving density; thin solid line: evolving density and potential, no re-ejections; thick solid line:\nevolving density and potential with re-ejections. (b) Fokker-Planck integrations with parameters chosen to mimic the N-body simulations with various N; color\ncoding is the same as in the N-body figures above. Thin lines: no re-ejections; solid lines: with re-ejections.\n\nthe binary and σ is the stellar velocity dispersion in the unperturbed galaxy. An equal-mass binary is in the \"hard\" regime\nwhen Vbin /σ >\n∼ 3 (Quinlan 1996a). In the current models,\n\u0012 \u00131/2\nVbin\n1\n≈ 0.36\nσp\na\n\n(32)\n\nwith σ p ≈ 0.278 the peak velocity dispersion in the γ = 0.5\nDehnen model. The N-dependent phase of binary evolution\nbegins at a−1 ≈ 100 in the N-body models (Fig. 6), hence\nVbin /σ p >\n∼ 3.6 and equation (31) is expected to be accurate.\nIn Paper II, setting hCi ≈ 1.25 was found to reproduce the Nbody hardening rates. Yu (2002) argued for a similar value of\nhCi.\nExpressions like (31a) were derived from scattering experiments that allowed for the possibility of multiple interactions\nbetween star and binary. However the confining effect of\nthe galaxy's gravitational potential was ignored. As noted in\nMilosavljević & Merritt (2003), stars ejected once by the binary can interact with it again as they return to the nucleus on\nnearly-radial orbits. If the energy change during the first interaction is not large enough to eject the star completely from\nthe galaxy, it will experience one or more \"secondary slingshots\", and the total energy extracted from the binary by the\nstar will be the sum of the discrete energy changes during the\ninteractions.\nA minimum condition for re-ejection is that a star remain\nbound to the galaxy after its first interaction with the binary, E + ∆E >\n∼ 0. Most stars that interact with the binary have apocenters ∼ rh (Milosavljević & Merritt 2003);\nsince the gravitational potential at this radius is dominated\nby the galaxy, we can write this condition for re-ejection as\n|∆E| <\n∼ Φ⋆ (0) with Φ⋆ (0) the central value of the galaxy's\n(stellar) gravitational potential. The γ = 0.5 Dehnen models\nused here have Φ⋆ (0) ≈ 0.67 in the adopted units, implying\na−1 <\n∼ 200 for re-ejection.\n\nEven if a star satisfies this condition, re-ejection will only\nbe effective if the star remains in the binary's loss cone for\nlonger than an orbital period, i.e. if q(E) <\n∼ 1. Re-ejection will\nalso fail for a star with apocenter greater than some rmax ≫ rh ,\nsince the overall potential in a real galaxy is never precisely\nspherical and the star will be perturbed from its nearly radial\norbit on the way in or out Vicari et al. (2006).\nWe considered a modified form of equation (31) that\naccounts for re-ejections. Let ∆Emax = Φ(rmax ) − Φ(rh ).\nRe-ejection was assumed to occur if the following conditions were both satisfied: (i) |∆EHills | < |∆Emax |; (ii) q(E +\n∆EHills ) < qmax ≈ 1. Condition (i) guarantees that the star\nremains bound to the galaxy after the first ejection, with\napocenter ≤ rmax . This condition is roughly equivalent to\n−1\nGμ/a < Φgal (0) ≈ 1 and is satisfied for a−1 <\n∼ 500 ≈ 5ah\nin our models, i.e. during the early phases of binary evolution. Condition (ii) guarantees that the star will remain within\nthe binary loss cone for of order one orbital period or longer\nafter the first ejection; this condition is satisfied at large (i.e.\nbound) values of E (Fig. 13).\nFor a−1 greater than ∼ 160, which occurs shortly after formation of a hard binary (Fig. 5), even a single re-ejection\nwould give a star enough energy to escape the galaxy. Hence,\nat energies such that conditions (i) and (ii) were both satisfied, we set ∆E = 2∆EHills , while if either condition was not\nsatisfied, re-ejection was assumed not to occur and we set\n∆E = ∆EHills . This scheme has two parameters, qmax and rmax ;\nthe results are weakly dependent on rmax for rmax ≫ rh and we\nfixed rmax = 100rh . The consequences of varying qmax are discussed below.\nFinally, we need to account for changes in the gravitational potential as the stellar distribution evolves. (We ignore possible changes in the mass of the binary.) Here we\nfollow Hénon's (1961) scheme of assuming that f remains a\nfixed function of the radial adiabatic invariant as the potential is adjusted. Our numerical schemes for advancing f was\n\n\f14\n\nMerritt, Mikkola & Szell\n\nF IG . 15.- Evolution of the mass deficit in the suite of Fokker-Planck integrations presented in Fig. 14. Line styles have the same meaning as in Figure 6.\n\nbased closely on the algorithms described by Cohn (1980) and\nQuinlan (1996b).\n5.3. Comparison with the N-Body Integrations\n\nFigure 14(a) compares the evolution of a−1 in a set of\nFokker-Planck integrations with initial conditions chosen to\nmimic those in the N-body integrations (γ = 0.5, M = 0.01,\na−1 (t = 0) = 0.01). Fixing ρ(r) and Φ(r) (dot-dashed curve)\nis equivalent to the assumptions made by Yu (2002), who ignored changes in the stellar distribution as the binary evolved.\nAllowing the density and potential to evolve (solid lines) results in a considerably lower hardening rate for the binary.\nIncluding the secondary-slingshot (heavy solid line) increases\nthe hardening rate but only slightly; as explained above, once\nthe binary becomes hard, most stars that interact with it are\nejected completely from the galaxy and do not return to the\nbinary's sphere of influence.\nFigure 14(b), which can be compared with Figure 6(b),\nshows the evolution of binary semi-major axis in a set of\nFokker-Planck integrations with the same values of N as in\nthe N-body integrations. The correspondence is quite good;\nthe Fokker-Planck integrations show a slightly steeper dependence of the binary hardening rate on N (Fig. 8). The evolution of the mass deficit as derived from the Fokker-Planck\nintegrations is shown in Figure 15 (cf. Fig. 11). Here the\ncorrespondence is not quite as good, but still reasonable; the\nweak dependence of Mdef on N for large N is well reproduced.\n6. PREDICTIONS OF THE FOKKER-PLANCK MODEL FOR LARGE N\n\nHaving established that the Fokker-Planck model can\nmimic the joint binary/galaxy evolution seen in the N-body\n5\nintegrations, for various values of N <\n∼ 10 , we now extend\nthis model to the much larger N regime of real galaxies. The\ngoal is both to predict the long-term evolution of a massive\nbinary in a real galaxy, and also to record the changes in the\ncentral structure of the galaxy.\nResults for a galaxy containing a binary with M12 ≡ M1 +\nM2 = 10−3Mgal and two mass ratios α ≡ M2 /M1 = (1, 0.1)\n\nare shown in Figures 16 and 17 respectively. The initial\ngalaxy model was a Dehnen sphere, equation (10), with γ =\n0.5. This is the shallowest central slope that is consistent\nwith an isotropic phase-space distribution around a central\npoint mass; it is also a fair representation of the core profiles that are produced during the \"rapid\" phase of cusp destruction that accompanies the initial formation of the massive binary (Merritt & Szell 2006). Fokker-Planck integrations were carried out for different values of N ≡ Mgal /m⋆ =\n(106 , 107 , ..., 1012 ). The time axis in these plots is the relaxation time measured at the binary's influence radius in the initial model; all integrations were continued until t = 4Tr (rh ).\nEquation (12) was used to set the initial value of a; quantities\nlike the mass deficit in Figures 16 and 17 should be interpreted\nas the accumulated change in these quantities after the binary\nfirst becomes \"hard.\" Unless otherwise stated, re-ejections\nwere ignored.\nIn all of the integrations, the binary begins in the diffusive, or empty loss cone, regime (qlc ≫ 1) due to its large\ninitial separation, and evolves toward the pinhole, or full loss\ncone, regime (qlc >\n∼ 1) as it hardens. The transition to the\npinhole regime occurs later for larger N; for N = 1012 (the\nheavy curves in Figs. 16 and 17) the binary remains essentially in the diffusive regime until the end of the integration at\n4Tr (rh ). However we argue below that evolution of binaries in\nreal galaxies would typically be expected to terminate before\nthe pinhole regime is reached.\n6.1. Binary Hardening Rates\n\nFigures 16 and 17 show that at large N, the binary hardening\ntime,\na\n,\n(33)\nThard ≡\nȧ\ntends to a fixed fraction of Tr (rh ) at any given a. This is\nthe \"empty loss cone\" regime. The ratio Thard /Tr (rh ) increases from ∼ 0.1 at large a, i.e. early times, to ∼ 0.3 when\na ≈ 10−5ah , with a weak dependence on binary mass ratio.\n\n\fBinary Black Holes\n\n15\n\nF IG . 16.- Joint binary-galaxy evolution in Fokker-Planck models with M1 = M2 and M12 = 10−3 Mgal . (a) Binary semi-major axis; (b) binary hardening time;\n(c) mass deficit as a function of time, and (d) mass deficit as a function of binary separation. Different lines correspond to different values of N ≡ Mgal /m⋆ :\nN = 106 ,107 ,...,1011 ,1012 (thick line). Symbols mark the time teq at which the binary hardening rate equals the gravitational radiation evolution rate, assuming a\nbinary mass of 105 M⊙ (squares), 106 M⊙ (circles), 107 M⊙ (triangles), and 108 M⊙ (stars). Filled symbols denote models in which N is roughly equal to its value\nin real galaxies, for each value of M• . Dashed lines in panels (a) and (b) are the analytic model described in the text.\n\nWe will argue below that binary black holes in real galaxies\nlie close to the large-N hardening curves throughout much of\ntheir evolution and so it is of interest to develop an analytic\nunderstanding of this regime.\nSince qlc (E) (equation 22) is the ratio of the orbital period to the diffusional loss cone refilling time at energy E,\ni.e. qlc (E) ≈ P(E)/[Rlc (E)Tr (E)], we can rewrite the flux of\nstars into the binary, equation (26), as\n\nF (E)dE ≈ 4π2 Jc2 (E)P(E)Tr−1 (E)\n\nf (E)\ndE. (34)\nln (1/R0 ) − 1\n\nAssuming a fixed mass model for the galaxy, the flux into the\nbinary, integrated over one relaxation time, scales therefore as\n\nF (E)Tr (E) ∝ [ln (1/R0) − 1]−1\n\n\u0003−1\n\u0002\n, qlc ≪ 1;\n≈ ln R−1\nlc\n\n≈ q−1\nlc ,\n\nqlc ≫ 1.\n\n(35a)\n(35b)\n(35c)\n\nThe binary hardening rate is fixed by F and a (equation 31b),\nso these expressions imply that the binary's evolution over\na specified number of relaxation times will be smaller for\nsmaller N, i.e. larger qlc ; while in the large-N limit, the evolution rate at a given a will be determined solely by Tr . These\npredictions are consistent with the upper panels of Figures 16\nand 17.\nThe gradual decrease with time of the hardening rate is due\nto two factors: the decreasing size of the binary, and the declining density of the core. Again ignoring changes in the\ncore structure, the expressions given above can be used to estimate how the hardening rate varies with a. The result, in the\n\n\f16\n\nMerritt, Mikkola & Szell\nfor α ≡ M2 /M1 = 1, and\n\nlarge-N limit, is\nThard\n1 a\n≡\n∝ ln\nTr ȧ\nTr\n\n\u0010a \u0011\nh\n\na\n\n,\n\n(36)\n\nThe results are shown as the dashed lines in Figures 16b\nand 17b. We found good fits for\nB = (0.08, 0.09)\n\n(38)\n\nfor α = (1, 0.1) respectively. The weak dependence of the\nfitting parameters on binary mass ratio reflects the lack of a\nmass ratio dependence in the evolution equations (31).\nIntegrating equation (37) gives a simple expression for the\ntime dependence of the binary semi-major axis:\ns\n\u0010a \u0011\nB\nB2 2 t\nh\nln\n+\n(39)\n=− +\na\nA\nA2 A Tr (rh )\nwhere t is defined, as in Figures 16 and 17, as the time since\nthe binary first became hard, i.e. the time since a = ah . This\nfunction is plotted in Figures 16a and 17a, where it again provides an excellent fit to the large-N evolution curves.\nWe now show that real black hole binaries are expected to\nbe in this empty loss cone regime throughout most or all of\ntheir evolution. Maximum traversal of the tracks in Figures 16\nand 17 will occur if no physical process, aside from interactions with stars, affects the hardening rate until the gravitational radiation regime is reached. The time scale associated\nwith gravitational radiation is (Peters 1964)\na\nTgr =\nȧ\n\n5 c5 a 4\n=\n2\n64 G3 μM12\ngr\n\n(40)\n\nwhere μ ≡ M1 M2 /M12 is the reduced mass of the binary and a circular orbit has been assumed. Following\nMerritt & Milosavljević (2005), Tgr can be expressed in terms\nof M• ≡ M12 and ah using the M• − σ relation, equation (3),\nas\nα3\nM −0.65 ã4−2\n(41)\nTgr ≈ 5.7 × 1010yr\n(1 + α)6 •,6\nwith ã ≡ a/ah and ã−2 = a/(0.01ah).\nWe define teq as the time when Thard = Tgr . In order to extract teq in physical units from the Fokker-Planck integrations,\nwe need to assign a value in years to Tr (rh ). This we do via\nthe straight-line fit to the data in Figure 1. Combining equations (4), (37), and (41) the condition Thard = Tgr becomes\n\u0010a \u0011\ni\n\u0010 a \u00114 h\nh\nh\n−2.19\nA ln\n+ B = 7.1 × 108α3 (1 + α)−6 M•,6\na\na\n(42)\nwith M•,6 ≡ M• /106 M⊙ . We define aeq as the value of a that\nsatisfies this equation. For M• = (105 , 106 , 107 , 108 )M⊙ , i.e.\nσ ≈ (44, 70, 112, 180) km s−1 , and using the values of A and\nB derived above, equation (42) implies\nah /aeq ≈ (315, 93, 27, 8.0)\n\n(44)\n\nteq ≈ (0.73, 0.53, 0.35, 0.20) × Tr(rh )(α = 1),\n≈ (0.65, 0.54, 0.27, 0.13) × Tr(rh )(α = 0.1).\n\n(45)\n(46)\n\nfor α = 0.1. The corresponding times are\n\ni.e. the fractional change in a over one relaxation time is\nweakly dependent on a for large N.\nWe tried fitting a similar function to the large-N hardening\ncurves in Figures 16 and 17, i.e.\n\u0010a \u0011\n1 a\nh\n+ B.\n(37)\n= A ln\nTr ȧ\na\n\nA = (0.016, 0.017),\n\nah /aeq ≈ (140, 40, 12, 3.5)\n\n(43)\n\nThe values just computed for aeq and teq correspond to\nthe large-N (empty loss cone) limit of the Fokker-Planck\nequation, i.e. to the heavy curves in Figures 16 and 17.\nThe filled symbols in those figures show where Thard = Tgr\non the four tracks that best correspond to the four values just considered for M• . Since M• ≈ 1 × 10−3 Mgal\n(Merritt & Ferrarese 2001), we set N = (108 , 109 , 1010 , 1011 )\nfor M• = (105 , 106 , 107 , 108 )M⊙ . The symbols confirm that\n5.5\nbinary black holes of mass M• >\n∼ 10 M⊙ remain essentially\nin the empty loss cone regime throughout their evolution. For\nbinaries of mass M• = 105 M⊙ , the evolution just prior to the\ngravitational radiation regime begins to depart from that of\na diffusive loss cone, resulting in somewhat lower hardening\nrates than predicted by equations (37) and (39). The discrepancy with the analytic expressions would be expected to increase still more for binaries of still lower mass (if such exist).\n6.2. Mass Deficits\nNext we consider the effect of the binary on the structure\nof the galaxy's core. Evolution of mass deficits is plotted in\nthe lower panels of Figures 16 and 17. Particularly striking\nare the panels showing Mdef vs. binary hardness, ah /a. As\nwas true in the N-body integrations, long-term evolution of\nthe binary generates mass deficits that are very well predicted\nby the change in binding energy of the binary black hole, i.e.\nby ah /a. This dependence is accurately described by\n\nMdef\n≈ (1.8, 1.6) log10 (ah /a)\nM12\n\n(47)\n\nwhere the numbers in parentheses refer to α = (1, 0.1) respectively. The mass deficits generated between formation of a\nhard binary, and the start of the gravitational radiation regime,\nare given by setting a = aeq in this expression, i.e.\nMdef ≈ (4.5, 3.5, 2.6, 1.6)M12 (α = 1)\n≈ (3.4, 2.6, 1.7, 0.9)M12 (α = 0.1).\n\n(48)\n(49)\n\nfor M12 = (105 , 106 , 107 , 108 )M⊙ . These values should be\nadded to the mass deficits Mdef,h generated during the rapid\nphase of binary formation, i.e. Mdef,h ≈ 0.7α0.2 M12 (Merritt\n2006).\nMass deficits in these models are not related in a simple way\nto the mass in stars \"ejected\" by the binary. The flux of stars\ninto the binary constitutes a loss term, −F (E,t), on the right\nhand side of equation (27), and in the absence of any other\ninfluences, the density of stars near the center of the galaxy\nwould drop in response to this term. Removal of stars also\nreduces the gravitational force near the center, contributing to\nthe expansion. However the second term on the right hand\nside of equation (27), −∂FE /∂E, has the opposite effect. This\nterm represents the change in N(E,t) due to diffusion of stars\nin energy; as the mass deficit increases, so do the gradients in\nf , which tend to increase the energy flux and counteract the\ndrop in density.\n\n\fBinary Black Holes\n\n17\n\nF IG . 17.- Like Fig. 16 but for M2 = 0.1M1 and M12 = 10−3 Mgal .\n\nIn principle, these two terms could balance, at least over\nsome range in energies, allowing the binary to harden without\ngenerating a mass deficit. This would require\nFE (E) =\n\nZ ∞\n\nF (E)dE,\n\n(50)\n\nE\n\ni.e. the inward flux of stars due to energy diffusion at energy\nE must equal the integrated loss to the binary at all energies\ngreater than E. However, at sufficiently great distances from\nthe binary, the relaxation time is so long that the local FE (E)\nmust drop below the integrated loss term, implying that the\ndensity within this radius will drop. Growth of a mass deficit\nreflects the imbalance between these two terms.\nWe illustrate\nthis imbalance in Figure 18 which shows\nR\nFE (E) and F (E)dE in the Fokker-Planck integration with\nα = 1 at a time ∼ Tr (rh ). The lowest energy in the figure\ncorresponds roughly to the outer edge of the binary-generated\ncore.\nYet another mechanism contributes to the growth of mass\ndeficits in the Fokker-Planck models. Even in the absence of\nthe loss term associated with the binary, the nuclear density\nprofile adopted here for the initial models, ρ ∼ r−0.5 , implies\n\na \"temperature inversion,\" i.e. a velocity dispersion that increases with radius. Relaxation drives such a nucleus toward\na locally \"isothermal\" form before the onset of core collapse,\ncausing the central density to drop (Quinlan 1996b). The binary contributes to this process by maintaining a flat density\nprofile near the center, forcing the temperature inversion to\npersist.\n\n7. IMPLICATIONS FOR BINARY EVOLUTION IN GALAXIES\n\nEquation (39), based on the Fokker-Planck integrations,\naccurately describes the evolution of a hard binary in the\n5.5\nempty loss cone regime (i.e. in galaxies with M12 >\n∼ 10 M⊙ )\ngiven the relaxation time at rh , while equation (4), based\non observed properties of galactic nuclei (Fig. 1), provides\nthe mean value of Tr (rh ) for galaxies with black hole mass\nM• = M12 . Together with equation (40) for the gravitational\nradiation time scale, these relations can be used to predict\nmean evolution rates and binary separations in real galaxies\ngiven (M• , α) ≡ (M2 /M1 ).\nIncluding the effect of energy lost to gravitational radiation,\n\n\f18\n\nMerritt, Mikkola & Szell\n\nF IG . 18.- Fluxes in the Fokker-Planck integration with N = 107 and α = 1,\nat a time ∼ Tr (rh ).\n\nthe binary's semi-major axis evolves as\n\u0012 \u0013\n\u0012 \u0013\n\u0012 \u0013\nd 1\nd 1\nd 1\n=\n+\ndt a\ndt a hard dt a gr\ni.e.\nd\nT (a)−1 ≡ a\ndt\n\n\u0012 \u0013\n1\n−1\n= Thard\n(a) + Tgr−1 (a).\na\n\n(51)\n\n(52)\n\nThe time for the separation to drop from ah to a is\n1010 yr ×\n\nZ ymax\n0\n\nAy + B\nC + D (Ay + B)e4y\n\n(53)\n\nwhere\n\nF IG . 19.- Time to coalescence starting from a = ah as a function of binary\nmass. Solid curves are derived from equation (53) with ymax = ∞; black/thick:\nα = 1; blue/thin: α = 0.1. Dotted curves show the evolution time from a =\naeq to a = 0, i.e. the time spent in the gravitational radiation regime only.\nEquation 55 gives accurate analytic approximations to tcoal (M12 ;α).\n\nM12 end where coalescence times are much longer than a\nHubble time.\nBased on Figure 19, binary black holes would be expected\nto reach gravitational wave coalescence in 10 Gyr in galaxies\n6\nwith M12 <\n∼ 2 × 10 M⊙ .\nFigure 20 shows the probability predicted by equation (52)\nof finding the binary in a unit interval of ln a,\nP(ln a) ∝ a\n\nC = 1.25M6−1.54,\n−9 −3\n\nD = 1.75 × 10 α\n\n(54a)\n(1 + α)\n\n6\n\nM60.65\n\n(54b)\n\nand ymax = ln(ah /a). The full time to coalescence, tcoal , starting from ah is given by setting ymax = ∞ in this expression.\nFigure 19 shows tcoal as a function of M12 for α = (1, 0.1).\nShown separately on this figure is the time to evolve from\na = aeq to a = 0, i.e. the time spent in the gravitational radiation regime alone. The latter time is a factor ∼ 10 shorter\nthan the total evolution time tcoal , which motivates fitting the\nfollowing functional form to tcoal (M12 ; α):\n2\n\nY = C1 + C2 X + C3 X ,\n\u0012\n\u0013\ntcoal\nY ≡ log10\n,\n1010 yr\n\u0013\n\u0012\nM12\n.\nX ≡ log10\n106 M⊙\n\n(55a)\n(55b)\n(55c)\n\n(This functional form is the integral of equation 39.) A leastsquares fit to the curves in Figure 19 gives\nα = 1 : C1 = −0.372, C2 = 1.384, C3 = −0.025 (56a)\nα = 0.1 : C1 = −0.478, C2 = 1.357, C3 = −0.041.(56b)\nThe fit of the analytic expressions is better than 2% (α = 1)\nand 5% (α = 0.1); most of the deviations occur at the high-\n\nda\ndt\n\n−1\n\n∝ T (a),\n\n(57)\n\nfor four values of M12 and for α = (1, 0.1). Viewed at a random time before coalescence, a hard binary is most likely to\nbe seen at a ≈ 2aeq , although the distributions are nearly flat\n7\nfor 1 ≤ ah /a <\n∼ 10 M⊙ , evolution for 10\n∼ 2ah /aeq . For M12 >\nGyr would only bring the binary separation slightly below ah ;\nin these galaxies the most likely separation to find a binary\nwould be the stalling radius (Merritt 2006).\n8. IMPLICATIONS FOR THE STRUCTURE OF GALAXY CORES\n\nIn the most luminous spheroids, mass deficits generated by\na binary black hole are likely to persist for the lifetime of\nthe galaxy, since relaxation times are much too long for starstar scattering to alter the phase-space density (cf. Fig. 1).\nIn collisional nuclei on the other hand, relaxation times are\nshort enough that the stellar distribution can be substantially\naffected by gravitational encounters after the binary black\nhole has coalesced into a single black hole. A Bahcall-Wolf\n(1976) cusp will form in a time ∼ Tr (rh ) after the binary\nblack hole coalesces into a single hole, inside a radius ∼ 0.2rh\n(Merritt & Szell 2006). In addition, the structure of the nucleus beyond the cusp will continue to evolve, as two-body encounters drive the stellar \"temperature\" profile toward isothermality prior to the onset of core collapse (Quinlan 1996b).\nThe nuclear density profile at some time after coalescence will\ndepend on how far along the evolutionary tracks of Figs. 16\n\n\fBinary Black Holes\n\nF IG . 20.- Probability of finding a binary black hole in a unit interval\nof ln a. From left to right, curves are for M12 = (0.1,1,10,100) × 106 M⊙ .\nSolid(dashed) curves are for M2 /M1 ≡ α = 1(0.1). Open circles indicate\na = aeq ; filled circles correspond to an elapsed time since a = ah of 1010 yr.\nFor the two smallest values of M• , the latter time occurs off the graph to the\nright.\n\nand 17 the binary evolved before coalescing, as well as on the\nelapsed time since coalescence.\nFigure 21 illustrates these competing effects with a concrete example. A Fokker-Planck integration with N = 109 and\nα = 1 was carried out until a time t = teq ; teq was computed\nas above assuming a binary mass of 106 M⊙ . The binary was\nassumed to become a single black hole at this time; the integration was then continued for a time Tr (rh ), but with the\nbinary loss term F (E ) set to zero. As the figure shows, a\nρ ∼ r−7/4 cusp is generated at r <\n∼ 0.2rh . The net result is a\nflat core containing at its center a compact star cluster around\nthe black hole. The stellar mass within the cusp is ∼ 0.1M• .\nIf binary coalescence were assumed to take place sooner\nthan ∼ teq (due e.g. to gas-dynamical torques), the mass\ndeficit would be smaller than the value ∼ 3.5M12 generated\nin this integration, resulting in a nuclear density profile more\nlike those of Merritt & Szell (2006). As shown in that paper, a regenerated cusp can closely approximate the (coreless)\ndensity profile at the center of the Milky Way if the elapsed\ntime since binary coalescence is >\n∼ 8 Gyr. In the integration\nof Figure 21, on the other hand, the larger mass deficit is not\ncompletely \"erased\" by formation of the cusp.\nA nuclear cusp like that in Figure 21 would be unresolved in all but the nearest galaxies. In fact, recent observations suggest the presence of compact stellar nuclei (\"nuclear star clusters\") at the centers of most spheroids fainter\nthan ∼ 109 L⊙ (Rossa et al. 2006; Wehner & Harris 2006;\nFerrarese et al. 2006). The mean mass associated with the nuclei is a fraction ∼ 0.2% that of the host galaxy with a ±1σ\nrange of 0.06% − 0.52% (Ferrarese et al. 2006). If we assume\nthat low-luminosity spheroids contain massive black holes\nand that the ratio of black hole mass to spheroid mass is similar to the mean value ∼ 0.12% characteristic of more luminous galaxies (Merritt & Ferrarese 2001), the observed nuclei\nwould have masses that are fractions 0.5 − 4 that of the black\n\n19\n\nF IG . 21.- Stellar density and mass profiles in a Fokker-Planck integration\nwith N = 109 . The binary black hole was assumed to coalesce at t = teq\n(based on an assumed binary mass of 106 M⊙ ) and the integration was then\ncontinued, without the binary sink term, for one relaxation time at rh . A\nBahcall-Wolf cusp is generated at r <\n∼ 0.2rh ; the stellar mass within the cusp\nis ∼ 0.1M• . Dashed line is the initial galaxy model.\n\nholes. This is somewhat larger than the value Mcusp /M• ≈ 0.1\nin the example of Figure 21; on the other hand it is possible\nthat black holes in faint spheroids carry a larger fraction of the\nspheroid mass. The compact nuclei might also form in very\ndifferent ways, e.g. from gas that accumulates at the center.\n9. ALTERNATE MODELS FOR BINARY EVOLUTION\n\nYu (2002) computed evolutionary tracks for binary black\nholes at the centers of a sample of early-type galaxies for\nwhich detailed luminosity profiles were available. Evolution\nbeyond a ≈ ah was modelled using the second term on the\nright hand side of equation (27), i.e. the J-directed flux of\nstars into the binary. The stellar distribution function was assumed fixed in time; binary-induced changes in the structure\nof the nucleus were ignored, as were changes in stellar energy,\nalthough the time scales associated with both sorts of change\nare comparable to the time scale for loss cone repopulation.\nAs shown here (Figure 14), allowing for changes in the structure of the nucleus in a Fokker-Planck model reduces the binary hardening rate by a factor ∼ 2. Yu (2002) concluded that\n−1\nbinary black holes in spherical galaxies with σ <\n∼ 90 km s\ncould coalesce in a Hubble time. This velocity dispersion corresponds to a binary mass of ∼ 3.5 × 106M⊙ (eq. 3). Yu's conclusion is consistent with, but slightly more optimistic than,\nthe one reached in the current study (see Fig. 19); the differences are probably due to Yu's neglect of the back-reaction of\nthe binary on the nucleus. As in the current study, Yu found a\nweak dependence of coalescence time on binary mass ratio.\nSome recent studies have inferred rapid evolution of supermassive binary black holes at the centers of spherical galaxies, even in the absence of collisional loss-cone repopulation. Sesana et al. (2007) used detailed three-body scattering\nexperiments to evaluate the effectiveness of the \"secondary\nslingshot\" (Milosavljević & Merritt 2003) at extracting energy from massive binaries after they had reached the stalling\nradius a ≈ ah in spherical galaxies. They found that binaries\ncould shrink beyond ah by factors of ∼ 4(2) for mass ratios\nof 1(0.1); for mass ratios below ∼ 0.01 the secondary sling-\n\n\f20\n\nMerritt, Mikkola & Szell\n\nshot was found to be ineffective. Almost all of this evolution\ntook place within a few galaxy crossing times after the hard\nbinary had formed; after this time, all of the stars that were\noriginally within the binary's loss cone had been completely\nejected from the galaxy.\nIn spite of this very modest evolution, Sesana et al. (2007)\nconcluded that \"even in the absence of other mechanisms\ndriving orbital decay, pairs involving genuinely supermassive\n5\nholes [i.e. with combined mass >\n∼ 10 M⊙ ] should not stall\".\nThis optimistic conclusion appears to have been based on an\nevaluation of the mass \"ejected\" by the binary (their Fig. 5),\nrather than on the more fundamental criterion of binary separation. The time to coalescence once a binary reaches the\ngravitational radiation regime is 1/4 of the time Tgr defined in\nequation (41); coalescence occurs in a time of t9 Gyr if\na\n0.16 0.25\n≈ (0.015, 0.034) × M•,6\nt9\nah\n\n(58)\n\nwhere the numbers in parentheses correspond to α = (1, 0.1)\nrespectively. The a/ah values in equation (58) are ∼ 15 times\nsmaller than those found by Sesana et al. (2007) after the secondary slingshot had run its course, implying that the binaries\nin their model galaxies would stall at separations far outside\nthe gravitational radiation regime unless extremely eccentric.\nSesana et al. (2007)'s results might still be taken to imply\nthat massive binaries commence their long-term, relaxationdriven evolution starting from separations somewhat smaller\nthan ∼ ah , as assumed here. However such an effect was\nnot apparent in the fully self-consistent N-body simulations of\nMerritt (2006). This is probably due to the neglect by Sesana\net al. of the changes in nuclear structure that accompany binary formation. Sesana et al. computed the initial population\nof stars available to undergo reejections by assuming a singular isothermal sphere density profile, ρ ∝ r−2 , and counting\nthe number of stars on orbits that intersected the binary. Even\nif such a steep density profile were present intially, it would\nbe converted into a core of much lower density by the time\na ≈ ah , and the number of stars available for the secondary\nslingshot would be much less than Sesana et al. estimated.\nIn the Fokker-Planck integrations presented here (§5), the\ninclusion of the secondary slingshot had almost no effect on\nthe long-term behavior of a(t).\nZier (2006a,b) also argued that stars near a binary black\nhole at the time of its formation could drive the binary to the\ngravitational radiation regime in a very short time. Zier ignored the secondary slingshot, but assumed that a dense cluster of stars would be bound to the binary at the time that its\nseparation first reached ∼ ah . He found that a cluster having\ntotal mass ∼ M12 , distributed as a steep power-law around the\nbinary, ρ ∼ r−γ , γ >\n∼ 2.5, could extract enough energy from it\nvia the gravitational slingshot that Tgr would fall below 1010\nyr. While no detailed justification for such dense massive\nclusters was presented, Zier argued that \"Low angular momentum matter accumulates in the center\" of merging galaxies, and that \"Each of the BHs will carry a stellar cusp with a\nmass of about its own\" after the merger. As noted above, recent observations do suggest the presence of compact nuclei\nat the centers of low-luminosity spheroids.\nN-body simulations of Zier's model have yet to be carried out, although Milosavljević & Merritt (2001) did follow the evolution of merging galaxies with initial, ρ ∼\nr−2 cusps around each of the black holes, close to the\nvalue γ = 2.5 above which Zier infers rapid coalescence.\n\nMilosavljević & Merritt (2001) observed a rapid phase of evolution of the binary, during which the density cusps were destroyed and a dropped by a factor of ∼ a few below ah . However this was still far above the separation at which gravitational radiation would be efficient.\nAn early, heuristic model for binary evolution was presented by Merritt (2000) based on the results of the N-body\nexperiments that had been carried out up to that date. The\nmodel assumed that the rate of supply of stars to the binary\nwas determined by local parameters (density, velocity dispersion) and was independent of the nuclear relaxation time. The\nmodel was able to mimic the binary hardening rates seen in\nsome N-body experiments (Quinlan & Hernquist 1997; Chatterjee, Hernquist & Loeb 2003); when scaled to real galaxies, it predicted binary coalescence times that were nearly\nindependent of galaxy mass. However, the N-body results\non which the model was based were subsequently called into\nquestion when they could not be reproduced using more accurate integrators (Makino & Funato 2004; Berczik, Merritt\n& Spurzem 2005). M. Volonteri and co-authors adopted the\nMerritt (2000) prescription for binary evolution as a component of their semi-analytic models of black hole growth\n(Volonteri et al. 2003a,b, 2005), and their models can therefore be expected to substantially over-estimate the rate of bi7\nnary evolution in galaxies with M• >\n∼ 10 M⊙ .\n10. SUMMARY\n\n1. Accurate, long-term N-body integrations of binary supermassive black holes at the centers of realistically dense\ngalaxy models were carried out using particle numbers up to\n0.26 × 106 . A new implementation of the Mikkola-Aarseth\nchain regularization algorithm was used to treat close interactions involving the black hole particles. The dependence of\nthe binary's hardening rate on particle number was quantified\nby averaging the results of independent integrations.\n2. A Fokker-Planck model was developed that includes, for\nthe first time, changes in the stellar density and potential due\nto star-binary interactions. The Fokker-Planck model was verified by comparison with the averaged N-body integrations.\n3. Based on the Fokker-Planck integrations and on empirical scaling relations, binary evolution in real galaxies was\nshown to take place in the \"empty loss cone\" (diffusive)\nregime for binaries with total mass above about 105.5M⊙ . This\nregime is out of range of particle numbers currently feasible\nvia direct N-body simulation but can be efficiently treated via\nthe Fokker-Planck approximation.\n4. Accurate analytical expressions were derived that reproduce the predictions of the Fokker-Planck model for the timedependence of binary semi-major axis (equation 39) and the\ntime to coalescence (equation 55) in the diffusive regime.\n5. Based on the Fokker-Planck integrations and on empirical scaling relations, gravitational-radiation coalescence\nwill occur in 10 Gyr or less for galaxies with binary masses\n6\n−1\n<\n∼ 2 × 10 M⊙ or central velocity dispersions <\n∼ 80 km s ;\nthe coalescence time depends only weakly on binary mass ra7\ntio (Fig. 19). Binaries with masses >\n∼ 10 M⊙ will remain\nstalled for a Hubble time.\n6. A core, or \"mass deficit,\" is created as a result of competition between ejection of stars by the binary and re-supply of\ndepleted orbits via gravitational (star-star) encounters. Mass\ndeficits as large as ∼ 4(M1 + M2 ) were found to be generated\nbefore coalescence (Fig. 16,17).\n7. After the black holes coalesce, a Bahcall-Wolf cusp\n\n\fBinary Black Holes\nforms around the single hole in approximately one relaxation\ntime, resulting in a nuclear density profile with a flat core and\nan inner, compact cluster (Fig. 21), similar to what is observed\nat the centers of low-luminosity spheroids.\n\n21\n\nThis work was supported by grants AST-0206031,\nAST-0420920 and AST-0437519 from the NSF, grant\nNNG04GJ48G from NASA, and grant HST-AR-09519.01-A\nfrom STScI.\n\nREFERENCES\nAarseth, S. J. 1999, PASP, 111, 1333\nAarseth, S. J. 2003, Ap&SS, 285, 367\nBaranov, A. S. 1984, Soviet Astronomy, 28, 642\nBerczik, P., Merritt, D. & Spurzem, R. 2005, ApJ, 633, 680 (Paper II)\nChatterjee, P., Hernquist, L., & Loeb, A. 2003, ApJ, 592, 32\nCohn, H. 1980, ApJ, 242, 765\nCohn, H., & Kulsrud, R. M. 1978, ApJ, 226, 1087\nCôté, P., et al. 2004, ApJS, 153, 223\nDehnen, W. 1993, MNRAS, 265, 250\nEbisuzaki, T., Makino, J., & Okumura, S. K. 1991, Nature, 354, 212\nFerrarese, L., et al. 2006, ApJ, 644, L21\nFerrarese, L., & Ford, H. 2005, Space Science Reviews, 116, 523\nFukushige, T., Makino, J., & Kawai, A. 2005, ArXiv Astrophysics e-prints,\narXiv:astro-ph/0504407\nGovernato, F., Colpi, M., & Maraschi, L. 1994, MNRAS, 271, 317\nGraham, A. W. 2004, ApJ, 613, L33\nHarfst, S., Gualandris, A., Merritt, D., Spurzem, R., Portegies Zwart, S., &\nBerczik, P. 2006, ArXiv Astrophysics e-prints, arXiv:astro-ph/0608125\nHeggie, D. C., & Mathieu, R. D. 1986, LNP Vol. 267: The Use of\nSupercomputers in Stellar Dynamics, 267, 233\nHemsendorf, M., Sigurdsson, S., & Spurzem, R. 2002, ApJ, 581, 1256\nHernquist, L., & Ostriker, J. P. 1992, ApJ, 386, 375\nHills, J. G. 1983, AJ, 88, 1269\nHopman, C., & Alexander, T. 2006, ApJ, 645, L133\nKandrup, H. E., Sideris, I. V., Terzić, B., & Bohn, C. L. 2003, ApJ, 597, 111\nKing, I. R. 1966, AJ, 71, 64\nKustaanheimo, P. & Stiefel, E. 1965, J. Reine Angew. Math. 218, 204\nLightman, A. P., & Shapiro, S. L. 1977, ApJ, 211, 244\nMagorrian, J., & Tremaine, S. 1999, MNRAS, 309, 447\nMakino, J., & Aarseth, S. J. 1992, PASJ, 44, 141\nMakino, J., & Funato, Y. 2004, ApJ, 602, 93\nMakino, J., Fukushige, T., Okumura, S. K., & Ebisuzaki, T. 1993, PASJ, 45,\n303\nMerritt, D. 2000, Dynamics of Galaxies: from the Early Universe to the\nPresent, 197, 221\nMerritt, D. 2001, ApJ, 556, 245\nMerritt, D. 2004, Physical Review Letters, 92, 201304\nMerritt, D. 2006a, ApJ, 648, 976\nMerritt, D., Harfst, S., & Bertone, G. 2007, Phys. Rev. D, 75, 043517\nMerritt, D. & Szell, A. 2006, ApJ, 648, 890\nMerritt, D., & Ferrarese, L. 2001, MNRAS, 320, L30\n\nMerritt, D., & Milosavljević, M. 2005, Living Reviews in Relativity, 8, 8\nMerritt, D., & Poon, M. Y. 2004, ApJ, 606,\nMerritt, D., & Wang, J. 2005, ApJ, 621, L101\nMikkola, S., & Aarseth, S. J. 1990, Celestial Mechanics and Dynamical\nAstronomy, 47, 375\nMikkola, S., & Aarseth, S. J. 1993, Celestial Mechanics and Dynamical\nAstronomy, 57, 439\nMikkola, S., & Valtonen, M. J. 1992, MNRAS, 259, 115\nMilosavljević, M., & Merritt, D. 2001, ApJ, 563, 34\nMilosavljević, M., & Merritt, D. 2003, ApJ, 596, 860 (Paper I)\nMilosavljević, M., Merritt, D., Rest, A., & van den Bosch, F. C. 2002,\nMNRAS, 331, L51\nMurphy, B. W., Cohn, H. N., & Durisen, R. H. 1991, ApJ, 370, 60\nNakano, T. & Makino, J. 1999, ApJ, 510, 155\nPeters, P. C. 1964, Physical Review , 136, 1224\nPlummer, H. C. 1911, MNRAS, 71, 460\nQuinlan, G. D. 1996a, New Astronomy, 1, 35\nQuinlan, G. D. 1996b, New Astronomy, 1, 255\nQuinlan, G. D. & Hernquist, L. 1997, New Astronomy, 2, 533\nRajagopal, M., & Romani, R. W. 1995, ApJ, 446, 543\nRavindranath, S., Ho, L. C., & Filippenko, A. V. 2002, ApJ, 566, 801\nRossa, J., van der Marel, R. P., Böker, T., Gerssen, J., Ho, L. C., Rix, H.-W.,\nShields, J. C., & Walcher, C.-J. 2006, AJ, 132, 1074\nSaslaw, W. C., Valtonen, M. J., & Aarseth, S. J. 1974, ApJ, 190, 253\nSesana, A., Haardt, F., & Madau, P. 2007, ApJ, 660, 546\nSpitzer, L. 1987, Dynamical Evolution of Globular Clusters (Princeton:\nPrinceton University Press)\nThorne, K. S., & Braginskii, V. B. 1976, ApJ, 204, L1\nValtonen, M. J. 1996, Comments on Astrophysics, 18, 191\nVicari, A., Capuzzo-Dolcetta, R., & Merritt, D. 2006, ArXiv Astrophysics\ne-prints, arXiv:astro-ph/0612073\nVolonteri, M., Haardt, F., & Madau, P. 2003a, ApJ, 582, 559\nVolonteri, M., Madau, P., & Haardt, F. 2003b, ApJ, 593, 661\nVolonteri, M., Madau, P., Quataert, E., & Rees, M. J. 2005, ApJ, 620, 69\nWehner, E. H., & Harris, W. E. 2006, ApJ, 644, L17\nYu, Q. 2002, MNRAS, 331, 935\nZier, C. 2006, ArXiv Astrophysics e-prints, arXiv:astro-ph/0610457\nZier, C. 2006, MNRAS, 371, L36\nZier, C., & Biermann, P. L. 2001, A&A, 377, 23\n\n\f"}