{"id": "http://arxiv.org/abs/1106.2152v1", "guidislink": true, "updated": "2011-06-10T19:43:10Z", "updated_parsed": [2011, 6, 10, 19, 43, 10, 4, 161, 0], "published": "2011-06-10T19:43:10Z", "published_parsed": [2011, 6, 10, 19, 43, 10, 4, 161, 0], "title": "Effects of Confinement and Orientation on the Thermoelectric Power\n  Factor of Silicon Nanowires", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1106.5343%2C1106.2296%2C1106.3014%2C1106.6110%2C1106.0158%2C1106.3274%2C1106.6343%2C1106.3493%2C1106.3279%2C1106.1968%2C1106.4578%2C1106.0508%2C1106.2115%2C1106.4278%2C1106.5135%2C1106.1118%2C1106.3445%2C1106.0476%2C1106.4644%2C1106.0311%2C1106.5108%2C1106.2325%2C1106.5089%2C1106.3151%2C1106.0722%2C1106.2837%2C1106.4964%2C1106.2621%2C1106.3864%2C1106.4223%2C1106.0421%2C1106.1201%2C1106.2276%2C1106.2556%2C1106.4903%2C1106.5146%2C1106.1235%2C1106.0580%2C1106.2971%2C1106.4873%2C1106.4727%2C1106.0691%2C1106.0954%2C1106.3234%2C1106.4464%2C1106.1835%2C1106.4172%2C1106.2695%2C1106.2737%2C1106.3197%2C1106.1813%2C1106.5824%2C1106.0963%2C1106.2752%2C1106.4397%2C1106.2956%2C1106.0573%2C1106.2536%2C1106.0618%2C1106.0706%2C1106.5671%2C1106.2324%2C1106.0164%2C1106.4734%2C1106.1075%2C1106.6015%2C1106.5426%2C1106.5219%2C1106.5281%2C1106.5484%2C1106.3494%2C1106.5757%2C1106.5016%2C1106.0712%2C1106.1204%2C1106.4674%2C1106.3315%2C1106.4683%2C1106.4805%2C1106.5555%2C1106.0005%2C1106.4068%2C1106.5062%2C1106.5556%2C1106.5598%2C1106.0359%2C1106.4968%2C1106.5894%2C1106.3965%2C1106.3266%2C1106.2804%2C1106.6058%2C1106.4412%2C1106.5087%2C1106.2152%2C1106.2313%2C1106.5170%2C1106.3711%2C1106.4064%2C1106.5998%2C1106.0048&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Effects of Confinement and Orientation on the Thermoelectric Power\n  Factor of Silicon Nanowires"}, "summary": "It is suggested that low dimensionality can improve the thermoelectric (TE)\npower factor of a device, offering an enhancement of the ZT figure of merit. In\nthis work the atomistic sp3d5s*-spin-orbit-coupled tight-binding model and the\nlinearized Boltzmann transport theory is applied to calculate the room\ntemperature electrical conductivity, Seebeck coefficient, and power factor of\nnarrow 1D silicon nanowires (NWs). We present a comprehensive analysis of the\nthermoelectric coefficients of n-type and p-type NWs of diameters from 12nm\ndown to 3nm, in [100], [110], and [111] transport orientations at different\ncarrier concentrations. We find that the length scale at which the influence of\nconfinement on the power factor can be observed is at diameters below 7nm. We\nshow that contrary to the current view, the effect of confinement and geometry\non the power factor originates mostly from changes in the conductivity which is\nstrongly affected, rather than the Seebeck coefficient. In general, enhanced\nscattering at these diameter scales strongly degrades the conductivity and\npower factor of the device. We identify cases, however, for which confinement\nlargely improves the channel's conductivity, resulting in ~2-3X power factor\nimprovements. Our results may provide guidance in the design of efficient low\ndimensional thermoelectric devices.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1106.5343%2C1106.2296%2C1106.3014%2C1106.6110%2C1106.0158%2C1106.3274%2C1106.6343%2C1106.3493%2C1106.3279%2C1106.1968%2C1106.4578%2C1106.0508%2C1106.2115%2C1106.4278%2C1106.5135%2C1106.1118%2C1106.3445%2C1106.0476%2C1106.4644%2C1106.0311%2C1106.5108%2C1106.2325%2C1106.5089%2C1106.3151%2C1106.0722%2C1106.2837%2C1106.4964%2C1106.2621%2C1106.3864%2C1106.4223%2C1106.0421%2C1106.1201%2C1106.2276%2C1106.2556%2C1106.4903%2C1106.5146%2C1106.1235%2C1106.0580%2C1106.2971%2C1106.4873%2C1106.4727%2C1106.0691%2C1106.0954%2C1106.3234%2C1106.4464%2C1106.1835%2C1106.4172%2C1106.2695%2C1106.2737%2C1106.3197%2C1106.1813%2C1106.5824%2C1106.0963%2C1106.2752%2C1106.4397%2C1106.2956%2C1106.0573%2C1106.2536%2C1106.0618%2C1106.0706%2C1106.5671%2C1106.2324%2C1106.0164%2C1106.4734%2C1106.1075%2C1106.6015%2C1106.5426%2C1106.5219%2C1106.5281%2C1106.5484%2C1106.3494%2C1106.5757%2C1106.5016%2C1106.0712%2C1106.1204%2C1106.4674%2C1106.3315%2C1106.4683%2C1106.4805%2C1106.5555%2C1106.0005%2C1106.4068%2C1106.5062%2C1106.5556%2C1106.5598%2C1106.0359%2C1106.4968%2C1106.5894%2C1106.3965%2C1106.3266%2C1106.2804%2C1106.6058%2C1106.4412%2C1106.5087%2C1106.2152%2C1106.2313%2C1106.5170%2C1106.3711%2C1106.4064%2C1106.5998%2C1106.0048&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "It is suggested that low dimensionality can improve the thermoelectric (TE)\npower factor of a device, offering an enhancement of the ZT figure of merit. In\nthis work the atomistic sp3d5s*-spin-orbit-coupled tight-binding model and the\nlinearized Boltzmann transport theory is applied to calculate the room\ntemperature electrical conductivity, Seebeck coefficient, and power factor of\nnarrow 1D silicon nanowires (NWs). We present a comprehensive analysis of the\nthermoelectric coefficients of n-type and p-type NWs of diameters from 12nm\ndown to 3nm, in [100], [110], and [111] transport orientations at different\ncarrier concentrations. We find that the length scale at which the influence of\nconfinement on the power factor can be observed is at diameters below 7nm. We\nshow that contrary to the current view, the effect of confinement and geometry\non the power factor originates mostly from changes in the conductivity which is\nstrongly affected, rather than the Seebeck coefficient. In general, enhanced\nscattering at these diameter scales strongly degrades the conductivity and\npower factor of the device. We identify cases, however, for which confinement\nlargely improves the channel's conductivity, resulting in ~2-3X power factor\nimprovements. Our results may provide guidance in the design of efficient low\ndimensional thermoelectric devices."}, "authors": ["Neophytos Neophytou", "Hans Kosina"], "author_detail": {"name": "Hans Kosina"}, "author": "Hans Kosina", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevB.83.245305", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1106.2152v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1106.2152v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "49 pages, 11 figures", "arxiv_primary_category": {"term": "cond-mat.mes-hall", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.mes-hall", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1106.2152v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1106.2152v1", "journal_reference": "Physical Review B, Vol.83, No.24, 245305, 2011", "doi": "10.1103/PhysRevB.83.245305", "fulltext": "Effects of Confinement and Orientation on the Thermoelectric\nPower Factor of Silicon Nanowires\n\nNeophytos Neophytou and Hans Kosina\nInstitute for Microelectronics, TU Wien, Gusshausstrasse 27-29/E360, A-1040 Wien, Austria\ne-mail: {neophytou|kosina}@iue.tuwien.ac.at\n\nAbstract\nIt is suggested that low dimensionality can improve the thermoelectric (TE)\npower factor of a device, offering an enhancement of the ZT figure of merit. In this work\nthe atomistic sp3d5s*-spin-orbit-coupled tight-binding model and the linearized\nBoltzmann transport theory is applied to calculate the room temperature electrical\nconductivity, Seebeck coefficient, and power factor of narrow 1D silicon nanowires\n(NWs). We present a comprehensive analysis of the thermoelectric coefficients of n-type\nand p-type NWs of diameters from 12nm down to 3nm, in [100], [110], and [111]\ntransport orientations at different carrier concentrations. We find that the length scale at\nwhich the influence of confinement on the power factor can be observed is at diameters\nbelow 7nm. We show that contrary to the current view, the effect of confinement and\ngeometry on the power factor originates mostly from changes in the conductivity which\nis strongly affected, rather than the Seebeck coefficient. In general, enhanced scattering at\nthese diameter scales strongly degrades the conductivity and power factor of the device.\nWe identify cases, however, for which confinement largely improves the channel's\nconductivity, resulting in ~2-3X power factor improvements. Our results may provide\nguidance in the design of efficient low dimensional thermoelectric devices.\n\nIndex terms: thermoelectrics, tight-binding, atomistic, sp3d5s*, Boltzmann transport,\nSeebeck coefficient, thermoelectric power factor, silicon, nanowire, ZT.\n\n1\n\n\fI. Introduction\nThe ability of a material to convert heat into electricity is measured by the\ndimensionless figure of merit ZT=σS2T/(ke+kl), where σ is the electrical conductivity, S is\nthe Seebeck coefficient, and ke and kl are the electronic and lattice part of the thermal\nconductivity, respectively. Thermoelectric devices have traditionally found use only in\nniche applications for reasons of low efficiency and high prices. The parameters that\ndetermine ZT are interdependent such that ZT remains low. In addition, some of the best\nthermoelectric materials are rare earth, or toxic materials. Recently, however, lowdimensional thermoelectric devices based on 1D nanowires (NWs), thin films, as well as\n1D/2D superlattices [1, 2, 3, 4, 5, 6] and commonly available materials such as Si and Ge\nhave been realized. Low-dimensional materials offer the capability of improved\nthermoelectric performance. The length scale offers a degree of freedom in engineering S,\nσ, and kl through partial control over the dispersions and scattering mechanisms of both\nelectrons and phonons. As a result, enhanced ZT values in nanostructures compared to\ntheir bulk material's values were achieved.\n\nEnhanced thermoelectric performance was recently demonstrated for silicon NWs\n[1, 2]. Although bulk silicon has a ZTbulk ~ 0.01, the room temperature ZT of silicon NWs\nwas experimentally demonstrated to be ZT~0.5. Most of this improvement has been a\nresult of suppressed phonon conduction (kl) from enhanced boundary scattering [1, 7]. It\nhas also been suggested, however, that low dimensionality can be beneficial for\nincreasing the power factor (σS2) of the device as well [8, 9, 10, 11]. Hicks and\nDresselhaus pointed out that channels of lower dimensionality can potentially improve\nthe Seebeck coefficient [8]. The sharp features in the low-dimensional density of states\nDOS(E) function can improve S, as this quantity is proportional to the energy derivative\nof DOS(E). Mahan and Sofo have further shown that thermoelectric energy conversion\nthrough a single energy level (zero-dimensional channel) can reach the Carnot efficiency\nwhen the lattice part of the thermal conductivity is zero [12].\n\n2\n\n\fOther theoretical studies, focusing on the effect of bandstructure and utilizing\nballistic transport, have indeed verified benefits to the power factor from dimensionality\n[11, 13, 14, 15]. The magnitude of these benefits, however, was only modest <2X. Vo et\nal. in Ref. [16] have consider ab-initio calculations and linearized Boltzmann transport\ntheory under the constant relaxation time approximation to investigate the thermoelectric\nproperties of Si NWs of 1.1nm and 3nm in diameter. Although these diameters are\npossibly too small for any practical considerations, they have shown that ZT values\naround unity can be achieved if the thermal conductivity is reduced below kl=2W/mK.\nIn this work, we calculate the thermoelectric coefficients (σ, S and ke) of Si NWs\nof larger diameters up to D=12nm. We employ atomistic calculations for electronic\nstructures and linearized Boltzmann theory [12, 17] for transport. We use the full energy\ndependence for the relaxation times of the scattering mechanisms considered. We present\na comprehensive analysis of the thermoelectric coefficients of cylindrical NWs in terms\nof: i) n-type and p-type, ii) of diameters from D=3nm up to D=12nm, iii) in [100], [110]\nand [111] transport orientations, and iv) for different carrier concentrations. Using\nexperimentally measured lattice thermal conductivity values we estimate the NWs' ZT.\nThe focus of this work is on the effects of geometry on the thermoelectric power factor\nthrough electronic structure variations. Therefore most calculations are performed at\nroom temperature, but we also show that the main conclusions are valid for other\ntemperatures as well.\n\nWe show that at room temperature, S can be improved for NWs with diameters\nbelow ~7nm [11]. At these diameter scales, however, the scattering mechanisms, and\nespecially surface roughness scattering (SRS), become increasingly important and\nsignificantly reduce the power factor. This is the case for all n-type NWs and [100] ptype NWs. Interestingly, however, in p-type [111] and [110] NWs, diameter scaling\nimproves the channels' conductivity [18, 19] and results in enhanced power factors. Our\nresults indicate that the quantity that controls improvements and variations in the power\nfactor is the electrical conductivity, whereas the changes in the Seebeck coefficient as a\n\n3\n\n\fresult of diameter scaling or transport orientation are small, contrary to current thinking,\nand contrary to results deduced from ballistic calculations [11, 15].\n\nThe paper is organized as follows: In section II, we describe the numerical\napproach: i) the tight-binding model, and ii) the derivation of the scattering rates from\nlinearized Boltzmann theory and the atomistic dispersions. In section III we perform an\nanalysis of the thermoelectric coefficients of n-type NWs and in section IV of p-type\nNWs. In section V we discuss the effect of temperature, calculate an estimate for the ZT\nfigure of merit and discuss the possible implications of NW surface reconstruction on our\nresults. Finally, in VI we conclude.\n\nII. Approach\nA. Atomistic modeling:\nTo obtain the bandstructure of the NWs both for electrons and holes for which\nspin-orbit coupling is important, a well calibrated atomistic model is used. The nearest\nneighbor sp3d5s*-SO tight-binding (TB) model [18, 20, 21, 22] captures all the necessary\nband features, and in addition, is robust enough to computationally handle larger NW\ncross sections as compared to ab-initio methods. As an indication, the unit cells of the\nNWs considered in this study contain from ~150 to ~5500 atoms, and the computation\ntime needed varies from a few hours to a few days for each case on a single CPU. Each\natom in the NW unit cell is described by 20 orbitals including spin-orbit-coupling. The\nmodel itself and the parameterization used [20], have been extensively calibrated to\nvarious experimental data of various natures with excellent agreement, without any\nmaterial parameter adjustments [23, 24, 25, 26, 27]. The model provides a simple but\neffective way for treatment of the surface truncation by hydrogen passivation of the\ndangling bonds on the surfaces [28]. What is important for this work, the Hamiltonian is\nbuilt on the diamond lattice of silicon, and the effect of different orientations is\nautomatically included, which impacts the interaction and mixing of various bulk bands.\n\n4\n\n\fWe consider cylindrical silicon NWs in three different transport orientations [100], [110],\nand [111] and diameters varying from D=12nm down to D=3nm. Strain fields [29, 30], as\nwell as relaxation of the NW surfaces are neglected in this study, but in section V we\nbriefly discuss the possible implications of surface relaxation on our results.\n\nThe strong influence of bandstructure in the transport properties of narrow NW\nand ultra-thin-body channels is stressed in our previous works. For n-type NWs, we\npreviously showed that the effective masses change as the diameter is scaled below 7nm,\neven up to 90% depending on the orientation [18]. More importantly, for p-type NWs we\nshowed that the carrier velocities can change by a factor of ~2X with confinement (~4X\nvariations in m*), again depending on the orientation. In this case, the subband curvature\nis in addition sensitive to electrostatic potential variations in the cross section of the\nNWs, an effect that cannot be captured with simplified effective mass electronic structure\nmodels [19, 31, 32]. This behavior is attributed to the strong anisotropy of the heavy-hole\nband. Indeed, the origin of most of these features can be traced back to and understood\nfrom the bandstructure of bulk Si. These dispersion variations will affect the transport\nproperties of the NWs, but can also provide additional degrees of freedom for\nperformance optimization. An electronic structure model capable of capturing such\neffects is therefore essential in investigating the influence of confinement in ultra narrow\nNW channels.\n\nB. Boltzmann theory:\nIn Linearized Boltzmann formalism, the electrical conductivity (σ), the Seebeck\ncoefficient (S), and the electronic part of the thermal conductivity (ke) are defined as:\n\n\n f 0 \n   E ,\n E \n\n  q0 2  dE  \nE0\n\nS\n\nq0 kB\n\n\n\n\n\n f 0 \n\n E  EF \n,\nk BT \n\n dE   E    E  \n\nE0\n\n5\n\n(1a)\n\n(1b)\n\n\f2\n\n\n\n E  EF \n f \n 0  kB T  dE   0    E  \n ,\n E \n k BT \nE0\n2\n\n e   0  T S 2 .\n\n(1c)\n(1d)\n\nThe transport distribution function   E  is defined as [12, 17]:\n\nE \n\n1\nvn 2  k x  n  k x    E  En  k x  \n\nA kx ,n\n\n1\n  vn 2  E  n  E g1nD  E  .\nA n\nwhere vn  E  \n\n(2)\n\n1 En\nis the bandstructure velocity,  n  k x  is the momentum relaxation\nk x\n\ntime for a state in a specific kx-point and subband n, and:\n\ng 1nD  En  \n\n1\n\n1\n2 vn  E \n\n(3)\n\nis the density of states for 1D subbands (per spin).\n\nThe focus of this work is on the effects of confinement and orientation on the\nthermoelectric power factor through the modifications of the electronic structure. Since\nthe focus is geometry, all calculations are performed at room temperature and the effect\nof phonon drag in the calculation of the Seebeck coefficient is not considered in Eq. (1b).\nPhonon drag is primarily a low temperature effect with temperature dependence T 9/2 [33,\n34] and has a significant contribution to the thermopower at T<50K. At room temperature\nits contribution is insignificant as discussed in Refs [33, 34, 35, 36]. In section V we\ndiscuss the role of temperature, and show that the trends and conclusions we describe at\nroom temperature still hold at different temperatures as well.\n\nC. Scattering rate calculation:\nThe transition rate Sn,m  k x , k x ' for a carrier in an initial state kx in subband n to a\nfinal state kx' in subband m is extracted from the atomistic dispersions and wave form\noverlaps using Fermi's Golden Rule [37, 38] as:\n\n6\n\n\fSn ,m  k x , k x '  \n\n2\n\nH kmx ,',nkx   Em  k x '  En  k x   E  .\n2\n\n(4)\n\nThe calculation of the relaxation times involves an integral equation [39, 40, 41,\n42]:\n\n v  k '   k '  f  k '  \n1\n  Sn ,m  k x , k x '  1  m x m x m x \n\n n  k x  m,kx '\nvn  k x  n  k x  f n  k x  \n\n\n(5)\n\nWhile self-consistent solutions of this may be found, this is computationally very\nexpensive, especially for atomistic calculations. Therefore, it is common practice to\nsimplify the problem. For isotropic scattering (ADP, ODP, IVS) the term in the\nparenthesis reduces to unity upon integration over the solid angle due to symmetry\nconsiderations (Sn,m is angle independent). In 1D the angle  can take only two values:\n\n  0 and    . The momentum relaxation rates are, therefore, equal to the scattering\nrates. This holds for any bandstructure. For elastic intravalley, intrasubband scattering\n(even if anisotropic, i.e. SRS, or impurity scattering), and under the parabolic band\nassumption, the term simplifies to:\n\n1\n\nvm  k x ' m  k x ' f m  k x '\nvn  k x  n  k x  f n  k x \n\n 1\n\nvm  k x '\nvn  k x \n\n 1\n\nvm  k x ' / mm*\nvn  k x  / m\n\n*\nn\n\n 1\n\npx '\npx\n\ncos \n\n(6)\n\nwhich is the usual term used in the calculation of the momentum relaxation times [38,\n39]. Although this is strictly valid for intrasubband transitions only, it is often used for\nintersubband transitions as well (assuming a weak kx dependence of   k x  [41]). In\ngeneral, however, one should solve the full integral equation. As mentioned by Fischetti\net al. in Refs. [40, 41], however, often sufficiently accurate results are obtained using the\nabove approximations, without the need to evaluate numerically demanding integral\nequations. In this work, we calculate the relaxation times by:\n\n v  k ' \n1\n  Sn ,m  k x , k x '  1  m x \n\n n  k x  m,kx '\nvn  k x  \n\n\n(7)\n\nThe Fermi functions in Eq. (5) cancel for elastic processes. For inelastic, isotropic\nprocesses (as all the inelastic processes we consider) the term in brackets reduces to unity\n\n7\n\n\fanyway after integration over kx. Although admittedly in 1D   k x  in the numerator and\ndenominator of Eq. (5) can vary with kx, we still drop it as it is commonly done in the\nliterature [43, 44, 45, 46]. This will only affect the SRS and impurity scattering results at\nlarger diameters where intersubband transitions can be important, but at larger diameters\nthe electronic structure approaches bulk like, and the variation of   k x  with kx is\nsmaller. Indeed, our mobility calculations at larger diameters approach bulk behavior for\nall the scattering mechanisms described.\n\nThe matrix element between a carrier in an initial state kx in subband n, and a\ncarrier in a final state kx' in subband m, is computed using the scattering potential\n\nU S  r  as:\n\n\nH\n\nm,n\nk x ', k x\n\n \n\n \n\n1\n  Fm* R eikx ' xU S  r  Fn R eikx x d 2 Rdx,\n \n\n(8)\n\nwhere the total wavefunction of a state is decomposed into a plane wave eikx x in the x-\n\n \n\ndirection, and a bound state Fv R in the transverse plane R and  is the normalization\nvolume.\n\n1.Phonon scattering:\nIn the case of phonon scattering, we extend the approach described in Ref.\n[38] for bulk and 2D carriers, to 1D carriers. The perturbing potential is defined as:\n\nU S  r   Aq K q e i q.r t \n\n(9)\n\nwhere Aq is associated with the lattice vibration amplitude, K q with the deformation\npotential, and momentum transfer q  r  Q  R  qx x. In this case, the matrix element is:\n\n\nH\n\nm,n\nk x ', k x\n\n \n\n \n\nFm* R eikx ' x\nFn R eikx x 2\n\nAq K q e iQR e iqx x\nd Rdx,\nA\nLx\nA\nLx\n\n\n(10)\n\nwhere Lx is the length of the unit cell. The integral over the transport direction x becomes\na Kronecker-delta expressing momentum conservation in the transport direction,\n\n8\n\n\f \n\nH kmx ,',nkx  I kmx ,',nkx Q Aq K q kx ',kx  qx\n\n(11)\n\nwith\n\n \n\nI kmx ,',nkx Q \n\n \n\n1\nkmx ,',nkx R e iQR d 2 R ,\n\nAR\n\nkm,',nk  R   Fm,k\nx\n\nx\n\n R\n\n*\n\nx'\n\n(12a)\n\n \n\nFn,kx R .\n\n(12b)\n\nWhen integrating and taking the square of the matrix element, the integral for the\nform factor is also evaluated as:\n2\n\nI kmx ,',nkx\n\n\n\n \n\n \n\n*\n1\n iQ R  R '\nd 2 R  d 2 R ' kmx ,',nkx R kmx ,',nkx R e\n2 \nA R\nR'\n\n(13)\n\nThe summation over the lateral momentum before substitution into Eq. (7) can be\nperformed as:\n\nI\n\n2\n\nm,n\nk x ', k x\n\n\n\nkR\n\n \n\n2\n\n km ,',nk  R \n\n A\n\nx\n\n2\n\nd 2R\n\nx\n\nA\n\nR\n\n\n\n \n\n*\n1\n iQ R  R '\nd 2Qe\nd 2 R  d 2 R '  kmx ,',nk x R  kmx ,',nk x R\n2 \n\n4 A Q\nR\nR'\n\nA\n\n(14)\n\nA\nm,n\nk x ', k x\n\nA\n\nHere, 1/ Akmx ,',nkx has the units of m-2. For computational efficiency of the calculation of the\nform factor overlap, on each atom we add the probability density of the components of\neach multi-orbital wavefunction, and afterwards perform the final/initial state overlap\nmultiplication. In such way, we approximate the form factor components of a lattice atom\nat a specific location R0 by:\n\nkm,',nk\nx\n\n2\nx\n\n  Fn,kx Fm,kx '*  Fn,kx Fm,kx '*\n\n\n  Fn ,kx Fn ,k x\n\n\n\n\n *\n\n\n\nF\n\n\n\n\n\nm ,k x '\n\n\n\n*\nm,kx '\n\nF\n\n  Fn ,kx\n\n\n\n\n2\n\nF\n\n\n\n\n\nm,kx '\n\n2\n\n Fn ,k x\n\n2\n\nFm,k x '\n\n2\n\n(15)\n\nwhere  runs over the TB orbitals of a specific atom. This computes the overlaps using\nthe probability density of each state, as in a single orbital (i.e. effective mass) model,\nalthough we still keep the kx-dependence of the wavefunctions. Indeed, our numerical\n\n9\n\n\foverlaps agree with the analytical expressions for the wavefunction overlaps if one\nassumes sine/cosine wavefunctions and parabolic bands, which can be derived to be\n\n1\n9\n1\n1\n\n for inter-band transitions [13, 38].\nfor intra-band and\nAnm 4 A\nAnm A\n\nThe approximation in Eq. (15) is important because it reduces the memory needed\nin the computation by 20X, allowing simulations of large NW cross sections with only\nminimal expense in accuracy. Even after this simplification, the storage of the probability\ndensity for the larger diameter NWs requires several Giga bytes of memory. It would\nhave been computationally prohibitive to perform the calculations for the larger diameter\nNWs using the actual wavefunctions, at least on a single CPU.\n\nThe transition rate for phonon scattering is then given by:\n\nSn ,m  k x , k x '  \n\nwhere Aq\n\n2\n\n2\n\nI kmx ,',nkx\n\n2\n\nKq\n\n2\n\nAq  kx ',kx  qx   Em  k x '  En  k x    ph \n2\n\n(16)\n\n1 1\n\nN \n\n\n1 \n2 2\n\n, ρ is the mass density, and Nω is the number of\n\n2  ph\n\nphonons given by the Bose-Einstein distribution.\n\nThe relaxation rate of a carrier in a specific subband n as a function of energy is\nthen given by:\n\n1\n\n\n\nn\nph\n\nE\n\n1\n\nN \n\n\n2\n \n\n  ph\n\n\n1\nx \n Lx\n\nwhere\n\nKq\n\nA\nm\n\n1\n\n2\n\n2\n\nkx kx '\nnm\n\nk\n\n\n\nx\n\n', k x\n\n1\n q   Em  k x '   En  k x    ph  \n\nx\n\n\n\nvm  k x '  \n ,\nvn  k x   \n\n\n(17)\n\n ph is the phonon energy, and we have used   ALx . For acoustic phonon\n\nscattering (ADP or IVS), it holds that K q\n\n10\n\n2\n\n q 2 DADP 2 , whereas for optical phonon\n\n\fscattering (ODP for holes, IVS for electrons) it holds that K q\n\n2\n\n DO 2 , where DADP and\n\nD0 are the scattering deformation potential amplitudes. For inter-valley scattering (IVS)\nin the conduction band we include all relevant g- and f-processes. Specifically for elastic\nacoustic deformation potential scattering (ADP), after applying the equipartition\napproximation, the relaxation rate becomes:\n\n2 DADP 2 k BT  1\n\n\n nADP  E \ns2  Lx\n1\n\nA\n\nm,kx '\n\n1\n\nkx kx '\nnm\n\nk\n\n\n\nx ', k x  qx\n\n  Em  k x '  En  k x   1 \n\n\nvm  k x '  \n,\nvn  k x   \n\n(18)\n\nwhere  s is the sound velocity in Si.\n\n2. Surface roughness scattering:\nFor SRS, we assume a 1D exponential autocorrelation function [47] for the\nroughness given by:\n\n  x    x '  2rms e\n\n2 x  x ' / LC\n\n(19)\n\nwith Δrms = 0.48nm and LC = 1.3nm [46]. Surface roughness is assumed to cause a band\nedge shift. The scattering strength is derived from the shift in the band edges with\nquantization\n\nEC ,V\nD\n\n[48, 49]. The transition rate is derived as:\n\n2  E   2 2 rms 2 LC\n k x , k x '   q0 C ,V  \nD   2  qx 2 LC 2\n\n2\n\nS\n\nSRS\nn,m\n\n\n   Em  k x '  En  k x   ,\n\n\n(20)\n\nwhere qx  kx  kx '. This surface roughness model is more simplified than the ones\ndescribed Refs. [46, 50, 51, 52], that account for additional Coulomb effects, the\nwavefunction deformation at the interface, and the position of electrons in the channel. In\nthis work, however, we ignore these effects since they only cause quantitative changes in\nour results. We assume that they are lumped into an enhanced roughness Δrms. Qualitative\ntrends in this work mostly originate from geometry-induced electronic structure\nvariations. In addition, we only consider channels with flat potential in their cross section,\nin which case the probability density is mostly concentrated in the middle of the channel\nand is relatively flat near the interface [31], which can partially justify our approximation.\nAs described by various authors, the band edge variation is the dominant SRS mechanism\n\n11\n\n\fin ultra scaled channels [46, 48, 49, 53, 54]. In Refs [46, 49] it was shown that that the\nSRS limited low-field mobility in ultra thin nanostructures follows a L6 behavior, where L\nis the confinement length scale, originating from subband shift due to quantization.\n\n3. Impurity scattering:\nAssuming the x direction to extend to infinity, the scattering potential for screened\nCoulomb ionized impurities is given by:\n\nUS r  \n\nq0 2\n\ne\n\n4 s 0\n\n\n\n\n\n R  R '\n\n2\n\n x 2 / LD\n\n\n\n2\n\nR  R'  x\n\n,\n\n(21)\n\n2\n\nwhere R is the position of an electron in the 2D cross section at x  0 , feeling the\n\n\n\n\n\ninfluence of an impurity at x, R ' . The screening length LD is given by:\n\nLD \n\n s 0 kBT 1/2  F \n.\nq0 2 n 3/2  F \n\n(22)\n\nwhere   F  is the Fermi-Dirac integral of order α and n is the carrier concentration.\nThe matrix element for an impurity-electron scattering then becomes:\n\n \n\nH kmx ,',nkx R '  \nR\n\n\nFn ,kx R  1\n\nA  Lx\n\n\n \n\n\n\nq0 2 eiqx x e\n 4 s 0\n\n\n\n Fm,kx ' R\ndx \nd 2R\n2\nA\nR  R '  x2 \n\n\n\n\n\n\n R  R '\n\n2\n\n x 2 / LD\n\n \n\n\n\n(23)\n\nwhere the expression in the parenthesis is the Green's function of the infinite channel\ndevice. For a cylindrical channel, the expression in the parenthesis is the modified Bessel\n\n\n\n\n\nfunction of second kind of order zero, K0 q, R ' [46, 55, 56, 57]. Again, as in the case of\nphonon scattering, we have used the probability density on each atomic site instead of the\nactual wavefunctions, which largely reduces the computational complexity.\n\nThe total transition rate due to impurity scattering is computed after taking the\nsquare of the matrix element, multiplying by the number of impurities in the normalized\ncross sectional area of the NW in the length of the unit cell (NILx), and integrating over\n\n12\n\n\fthe distribution of impurities in the cross sectional area of the NW (over R ' ). The\nimpurities are assumed to be uniformly distributed on the atomic lattice points. The\ntransition rate is then given by:\n.\nSnimp\n,m  k x , k x ' \n\n2 \nm,n\n   N I Lx  H kx ',kx R '\n R'\n\n \n\n2\n\n\nd 2 R '    Em  k x '   En  k x  \n\n\n(24)\n\nD. General scattering considerations:\n\n1. Scattering state selection:\nElastic and inelastic scattering processes are considered. We consider bulk\nphonons, and bulk Si scattering \"selection rules\". For n-type NWs, the elastic processes\n(elastic phonons, SRS, impurity scattering) are only treated as intra-valley, whereas\ninelastic ones (inelastic phonons) are only treated as inter-valley (IVS). Although all\nvalleys in the electronic structure of bulk Si collapse from 3D to 1D k-space in our\ncalculations, we carefully chose the final scattering states for each event such that we\nfollow the bulk processes. For inelastic transitions all six f- and g-type processes in Si are\nincluded [38, 58]. For p-type, we consider ADP and ODP processes which can be intraband and inter-band as well as intra-valley and inter-valley.\n\n2. Bulk vs. confined phonons:\nThe full dispersion of confined phonons is neglected. Bulk phonons provide an\nease of modeling and allow the understanding the effects on bandstructure on the\nthermoelectric coefficients, still with good qualitative accuracy in the results. Spatial\nconfinement mostly affects acoustic phonons by \"bending\" of the acoustic modes, which\nresults in lower than the bulk \"effective\" group velocity [59]. Optical phonons are not\naffected significantly by confinement [60, 61]. Such effects, however, will only affect our\nresults quantitatively (and as we show below, only slightly), whereas the qualitative\nbehavior, which originates from the influence of geometry on bandstructure will not be\naffected. As described by several authors, the effect of phonon confinement on the\nmobility for the thinnest NWs examined in this work can be of the order of 10-20%\n13\n\n\f(further reduction in mobility) and declines fast as the diameter increases [43, 44, 45, 60].\nEspecially in the case of p-type channels, studies have shown that using confined or bulk\nphonons makes very little difference in mobility calculations [62]. Similar studies in\nGaAs NWs also indicated the same result [63]. These observations, however, strongly\ndepend on the boundary conditions one uses for the calculation of the confined phonon\nmodes, which introduces an additional uncertainty [43, 44, 60].\n\nThe deformation potential parameters we use are the same as in Ref. [38], with\nholes\nholes\nelectrons\n 13.24x1010 eV / m , DADP\n 9.5 eV from\nthe exceptions of DODP\n 5.34 eV , and DADP\n\nRefs [37, 43, 44] which are more relevant for NWs. These are higher than the bulk values\n[38]. It is common practice to employ larger electron-phonon deformation potential\nvalues to explain phonon-limited transport trends in nanostructures [46, 64, 65, 66],\nwhich could partially account for phonon confinement effects. Buin et al. [43, 44]\ncalculated the mobility of NWs up to D=3nm using the same TB model and both\nconfined and bulk phonons. In this work, by using the same parameters we were able to\nbenchmark our results for mobility for the D=3nm NW bulk phonon case with a good\nagreement, before extending to larger diameters. As discussed in Ref. [43, 44], however,\nthe most accurate deformation potentials for NWs may finally be obtained by comparing\nmobility with experimental data [43, 64, 65], which for NWs at this time are sparse.\nDifferent sets of parameters will indeed change the magnitude of the phonon-limited\nresults, in particular that of the electrical conductivity. The thermoelectric coefficient\ntrends with diameter and orientation, however, will not be affected.\n\n2. Strength of each scattering mechanism:\nClearly, the presence of additional scattering mechanisms (interface roughness\nscattering and especially impurity scattering at high impurity concentrations) also limits\nthe conductivity, and the relative effect of phonons and especially acoustic phonon\nconfinement on the total conductivity will be even smaller [60]. This is illustrated in\nTable I, which reports the percentage contributions to the total scattering rate of the four\ndifferent scattering mechanisms separately (column-wise): ADP (long wavelength intravalley acoustic), IVS (inter-valley, inelastic), SRS and impurity scattering. The results are\n\n14\n\n\ffor the narrowest D=3nm n-type, [100] NW, for which the effect of acoustic phonon\nconfinement will be the strongest. The rows show cases of different scattering situations.\nThe individual contributions are extracted by weighting each energy dependent relaxation\nrate by the Fermi distribution and integrate over all energy (carrier concentration\nn=1018/cm3 is assumed for placing the Fermi level for rows one-five and n=1019/cm3 for\nrows six-seven). Phonon scattering is always included, whereas SRS and impurity\nscattering are gradually added. The first row shows that if only phonon scattering is\nconsidered, the effect of ADP and IVS are almost equal. When SRS is included (second\nand third rows), most of the contribution to the relaxation rate originates from SRS. For\nroughness Δrms1=0.24nm (second row) the contribution of the ADP scattering to the total\nscattering rate is 17% and drops to 6% when the Δrms increases to Δrms2=0.48nm (the one\nused throughout the manuscript). Once impurity scattering is considered (assuming\nn0=1018/cm3) in the fourth and fifth row under weak and stronger SRS respectively, then\nthe contribution of ADP drops to 6% and 4%. In rows six and seven we increase the\nimpurity concentration to n0=1019/cm3 (the one used throughout the manuscript). The\nADP contribution drops even further to only 4% and 3% for the cases of weak and\nstronger SRS. Impurity scattering at such high concentrations dominates the scattering\nprocesses. Indeed, this is in agreement with results based on impurity scattering in bulk Si\nwhere it is well known that the mobility drops by almost an order of magnitude from the\nphonon-limited value at such high concentrations [67]. The main point is that SRS and\nimpurity scattering dominate the scattering rates. The contribution of acoustic phonons to\nthe total scattering rate is not large once these two mechanisms are considered. Using\nbulk phonons for simplicity instead of confined phonons, therefore, might slightly\noverestimate our conductivity results, but it would not alter the qualitative trends we\npresent and the conclusions of this work.\n\nWe note that similar atomistic studies that couple semi-empirical tight-binding (or\nDFT) to Boltzmann transport are also discussed in the literature for either NWs of smaller\ndiameters, fewer scattering processes, or different channel structures and materials [16,\n44, 68, 69]. In this work we focus on the effect of dimensionality and geometry, how it\ninfluences the electronic structure, and through this the TE coefficients. We consider\n\n15\n\n\frelatively \"large\" diameters up to D=12nm in order to identify the transition of the\nthermoelectric power factor from 3D bulk-like (D=12nm) to 1D like behavior (D=3nm),\nsince the electronic structure of Si at D=12nm is already almost bulk-like. We have made\nseveral approximations when computing the scattering rates, but we believe that the\neffect of these on the results will only be quantitative, since any qualitative behavior is\nmostly electronic structure related.\n\nIII. n-type NW TE coefficients\nIn this part, a comprehensive analysis of the thermoelectric coefficients in n-type\nNWs of different orientations and diameters is performed.\n\nA. n-type NWs: Phonon limited TE coefficients\nSince the Seebeck coefficient is proportional to the energy derivative of the DOS,\nit has been suggested that low dimensional channels, with sharp features in their energy\nDOS(E) function, would be beneficial for thermoelectric devices [8, 9]. On the other\nhand, the electrical conductivity degrades in nanostructures due to stronger phonon\nscattering and enhanced SRS. The two processes act inversely proportional in defining\nthe power factor σS2. A careful analysis of the two quantities is needed to determine\nwhether benefits to the power factor σS2 can be expected from ultra narrow low\ndimensional materials.\nFigure 1 shows the thermoelectric coefficients σ, S, and σS2 of n-type NWs in the\n[100] (blue), [110] (red) and [111] (green) transport orientations, for D=3nm (solid) and\nD=12nm (dashed) as a function of the electron concentration. In this case, only phonon\nscattering is considered. Further on we will also consider the effect of SRS and impurity\nscattering. Figure 1a shows the conductivity of the NWs. At the same carrier\nconcentration, the conductivity of the NWs with the smaller diameter D=3nm, is reduced\nfrom that of the D=12nm diameter NWs.\n\n16\n\n\fAgain, comparing at the same carrier distribution, the Seebeck coefficient in Fig.\n1b increases as the diameter reduces. For smaller diameters some orientation dependence\nis observed, due to the different electronic structures of the NWs. This anisotropy is\nminimized for larger diameters both for the conductivity and especially for the Seebeck\ncoefficient. In Ref. [16], Vo et al., have also observed some orientation dependence. The\norientation dependence, however, in all cases is small to make a strong case for a\npreferential design direction for n-type NW thermoelectric devices.\n\nFigure 1c shows the power factor of the n-type NWs. The trends are similar for\nNWs in all transport orientations. The power factor of all D=3nm NWs is reduced\ncompared to the power factor of the D=12nm NWs, except for very high carrier\nconcentrations, following the trend of electrical conductivity shown in Fig. 1a. Some\norientation dependence can be observed, following the same order and relative magnitude\nas the conductivity in Fig. 1a. It is evident from this, that the effect of the electrical\nconductivity is stronger in influencing the power factor than that of the Seebeck\ncoefficient. Therefore, although narrower NWs can be beneficial to the Seebeck\ncoefficient, thinning the diameter has a stronger degrading effect on the conductivity due\nto enhanced scattering, and the power factor is overall reduced.\n\nThe difference in the behavior of the NWs of different diameter and orientation in\nboth σ and S originates from the position of the Fermi level with respect to their band\nedge EC  EF . The closer EC resides to EF , the higher is the conductivity and the lower\nthe Seebeck coefficient. The EC  EF is plotted in Fig. 2 versus the carrier concentration\nfor all the NWs of Fig. 1. The bandedges of all D=12nm NWs reside at almost the same\ndistance away from EF, and therefore a very small anisotropy is observed, especially in S.\nThe bandedges of the D=3nm NWs reside farther from EF compared to those of the\nD=12nm NWs. This may appear counter intuitive since one would have expected that\nthe smaller number of subbands in the thinner NW will force EC to be closer to EF at the\nsame carrier concentration. It appears this way because the carrier concentration is\nnormalized to the diameter. Considering a NW at a specific carrier concentration and\nspecific EC-EF, as the diameter is reduced, if the number of subbands in the energy region\n17\n\n\fof relevance decreases linearly with the cross sectional area of the NW, then EC-EF will\nstay the same. Once a single subband remains, reducing the diameter does not further\nreduce the number of subbands. To keep the carrier concentration constant with\ndecreasing diameter, EC-EF increases.\nAt D=3nm, the differences in σ and S originate from the different effective masses\nand degeneracies of the subbands, which control EC  EF . At a given carrier\nconcentration, the smaller the effective mass and degeneracy are, the closer EF resides to\nEC. In such case, the conductivity is higher and the Seebeck coefficient lower. The\nbandedge of the [110] NW, with a two-fold degenerate lowest valley and the lightest\nmass (m*=0.16m0) [18] resides closer to EF compared to the other two NW types. The\n[100] NW with four-fold degenerate valley of mass m*=0.27m0 follows, whereas the\n[111] NW, with six-fold degenerate valleys and heavier mass (m*=0.55m0), resides the\nfurthest from EF compared to the other two NW types. As described in Ref. [18],\nconfinement changes the masses of the NW subbands compared to the bulk m*=0.19m0 in\n[110], m*=0.19m0 in [100] and m*=0.43m0 in [111] directions [18, 70, 71].\nAs a result, the conductivity of the [110] NW is the largest, followed by the [100]\nNW, whereas that of the [111] is the lowest (Fig. 1a). The reverse is observed for the\nSeebeck coefficient, since the two quantities are inversely related (Fig. 1b). For the\nD=3nm NWs, therefore, some degree of orientation dependence can be observed, which\nwas not evident for the larger diameter NWs. The power factor follows the orientation\nand magnitude trend of σ, rather than that of S, despite the fact that it depends linearly on\nσ but quadratically on S. Changes in σ are much larger than changes in S, because σ\ndepends exponentially on EC  EF , whereas S depends linearly. At least for carrier\nconcentrations up to n=5x1019/cm3, σS2 is lower for the D=3nm NWs (Fig. 1c) following\nthe trend of σ. The influence of confinement and geometry, therefore, is stronger on the\nconductivity which affects the power factor stronger. We note here that the increase in S\nwith diameter reduction is only partially the improvement described by Hicks and\nDresselhaus in Refs [8, 9] which originates from the shape of the 1D DOS(E) function.\n\n18\n\n\fThat effect will be more pronounced when comparing at the same EC  EF rather than\nthe same carrier concentration [13]. What we describe can be explained by changes in\n\nEC  EF , which are determined from the normalization of the charge distribution by the\ncross sectional area and the rate at which the number of subbands in the NW are reduced\ncompared to the reduction of the cross sectional area.\n\nB. n-type NWs: The effect of confinement\nFrom Fig. 1, the peak of the power factor appears around electron concentrations\nof n=1019/cm3. In order to clearly observe the diameter dependence on the results, Fig. 3\npresents the thermoelectric coefficients of all NWs at n=1019/cm3 versus their diameter.\nAt this carrier concentration, which is high but practically achievable, the Fermi level\nresides very close to the band edges for most of the NW cases as seen in Fig. 2. The band\nedge of the D=3nm [111] NW is the furthest away from the Fermi level at this\nconcentration, which causes the peak in its power factor to appear at concentrations\nbeyond 1020/cm3 (see Fig. 1c), which are too high. The dashed lines in the sub-figures of\nFig. 3 indicate the phonon limited thermoelectric coefficients. The solid lines additionally\ninclude the effect of SRS. Figure 3a shows the electrical conductivity. Clearly, in all\ncases the conductivity degrades as the diameter reduces. The phonon limited degradation\nvaries from 0.5X to ~3X depending on the orientation, with the [110] oriented NWs\nbeing less affected as also described in Ref. [72]. Once SRS is included, a further ~2X\nconductivity reduction is observed for the smaller diameter NWs. SRS is weaker for the\nD=12nm NWs. The Seebeck coefficient in Fig. 3b increases as the diameter reduces, a\nreverse trend compared to conductivity. The increase is at most ~2X, and as explained\nearlier it originates from fact that EC  EF is larger for NWs of smaller diameters. SRS\nonly causes a slight additional increase in S, indicating that S is at first-order scattering\nindependent. The power factor in Fig. 3c reduces with diameter, especially when SRS is\nincluded in the calculation. The increase in S for lower diameters cannot compensate the\nlarge degradation in conductivity. For the cases of [110] and [111] NWs, a maximum can\nbe obtained around D=7nm, whereas for the [100] NWs the power factor is reduced\nmonotonically with diameter reduction. From this figure, the [100] NW performs slightly\n\n19\n\n\fbetter at D=12nm, the [110] at D=3nm, whereas in the intermediate diameter ranges, the\n[111] NWs are slightly advantageous. This orientation dependence is, however, small.\n\nWe mention here that ballistic simulations using the Landauer approach [11, 13,\n15] suggest the contrary, that diameter scaling will improve the power factor. It is\nbecause the ballistic approach captures the improvement in the Seebeck coefficient which\nis scattering independent at first order, but not the degradation in the conductivity which\nhas a stronger sensitivity to scattering mechanisms and geometry.\n\nC. n-type NWs: The effect of impurity scattering\nCarrier concentrations of n=1019/cm3 at which the peak of the power factor\nappears can be achieved with different methods. Since direct impurity doping is what is\ntraditionally used in TE devices, we demonstrate here the effect of such a high impurity\ndoping on the thermoelectric coefficients. In Fig. 4, we show σ, S, and σS2 as in Fig. 3,\nbut we now include phonons, SRS, and impurity scattering (solid lines). We still show\nthe phonon limited results in dashed lines for comparison.\n\nFigure 4a shows the electrical conductivity. Clearly, in all cases, impurity\nscattering causes a strong degradation in the conductivity at the entire diameter range. For\nsmaller diameters the degradation is caused by both the SRS and impurity scattering,\nhowever at larger diameters the degradation is mostly due to impurity scattering. The\ndegradation is of the order of 6X-8X depending on the orientation and diameter, with the\n[110] oriented NWs being less affected. This is consistent with the almost one order of\nmagnitude drop in mobility observed for MOSFET devices at such high doping\nconcentrations [67]. The Seebeck coefficient in Fig. 4b increases with the introduction of\nimpurity scattering in the calculation by ~20% if one compares the solid versus dashed\nlines (phonon limited). The power factor in Fig. 4c decreases due to impurities by ~4X\nfollowing the conductivity reduction trend, since this quantity is affected more than the\nSeebeck coefficient.\n\n20\n\n\fFrom these results it is obvious, therefore, that direct doping of the channel will\ncause large degradation in performance, and alternative strategies to achieve high carrier\ndensities should be employed for high efficiency thermoelectric devices as also\nmentioned by Ryu et al. [66]. Such methods can be: i) gated channels [66, 73], or ii)\nremote modulation doping (or charge transfer) techniques [74, 75]. Another important\nobservation is that similar to the effect of geometry, introduction of additional scattering\nmechanisms affect the conductivity much stronger than the Seebeck coefficient. Power\nfactor optimization strategies in low dimensional channels, therefore, should focus in\nimproving (or not reducing) σ and not necessarily in optimizing S.\n\nIV. p-type NW TE coefficients\nA possible way to improve a channel's conductivity is through bandstructure\nengineering. Strain is a possible direction which has been applied to MOSFET channel\ndevices with success [29]. Here we describe a different mechanism in p-type channels\nthat originates solemnly from confinement. In certain cases the electronic structure\nundergoes significant changes with confinement [19]. Through careful engineering of the\ntransport and confinement orientations as well as feature size, the subbands can become\nlighter and large improvements in conductivity can be achieved [19, 31, 32]. This is\nshown in Fig. 5 for p-type [110] and [111] NWs. In Fig. 5a and 5b, we show the (100)\nand (11-2) heavy-hole band bulk Si energy surfaces. The bandstructure of the [110] and\n[111] NWs, respectively, will be formed by bands of high curvature, residing away from\nthe center of each of these surfaces as shown by the lines in the figures and described in\nRef. [19, 31]. The actual NW subband envelopes for diameters ranging from D=12nm to\nD=3nm are shown in Fig. 5c and 5d. This increase in the subband curvature with\nconfinement can provide an improvement in the carrier velocities by ~2X [19]. The\neffective masses of the bands in these NWs can reduce from m*=0.4m0 to values below\nm*=0.2m0 solely due to confinement [31, 37, 44, 72]. On the other hand, the mass of the\n[100] NWs still remains high (m*~m0).\n\n21\n\n\fIn this part, a comprehensive analysis of the thermoelectric coefficients in p-type\nNWs of different orientations and diameters is performed. We follow the same approach\nas for n-type NWs above.\n\nA. p-type NWs: Phonon-limited TE coefficients\nFigure 6 shows the electrical conductivity, Seebeck coefficient and power factor\nfor p-type NWs of D=3nm (solid lines) and D=12nm (dashed lines) in the [100] (blue),\n[110] (red) and [111] (green) transport orientations versus the hole concentration. Only\nphonon scattering is considered here. In contrast to what was shown in Fig. 1a for n-type\nNWs, the electrical conductivity in Fig. 6a is strongly anisotropic and diameter\ndependent. At D=12nm, the [111] NW has the largest conductivity, followed by the [110]\nNW, whereas the [100] NW lacks behind. As the diameter reduces, the conductivity of\nthe [100] NW reduces, a similar behavior as in n-type NWs. The conductivity of the\n[111] and [110] NWs, however, strongly increases, originating from the large curvature\nincrease in the NW dispersions with diameter decrease as explained earlier.\n\nFor the Seebeck coefficients in Fig. 6b, only that of the [100] p-type NW\nincreases as the diameter scales to D=3nm. For the [110] and [111] NWs, S slightly\nsuffers since it is inversely proportional to the electrical conductivity, which undergoes a\nlarge increase. Only a small degradation is observed in S, because on the one hand\n\nEC  EF tends to increase with diameter scaling, but on the other hand the reduction in\nthe effective masses of the bands tend to reduce EC  EF . Finally, EC  EF does not\nchange much and S is affected only slightly. The power factor for the [111] and the [110]\nNWs in Fig. 6c largely increases by ~3X for the smaller diameter NWs, in contrast to the\n[100] NW power factor which only changes marginally.\n\nAs in the case of n-type NWs, the power factor is strongly influenced by the\nconductivity, rather than the Seebeck trend. Benefits to the power factor can therefore be\nachieved mainly though bandstructure modifications that affect the conductivity, and less\nthrough improvements in the Seebeck coefficient.\n\n22\n\n\fB. p-type NWs: The effect of confinement\nFigure 7 shows the p-type NW thermoelectric coefficients versus diameter at\np=1019/cm3, approximately the hole concentration at which the power factors peak in Fig.\n6c. The dashed lines indicate results for which only phonon scattering is included,\nwhereas the solid lines results for which phonons and SRS are included. Figure 7a shows\nclearly that the phonon-limited conductivity of [111] and [110] NW orientations is\nincreased by more than a factor of 8X as the diameter is scaled. This increase is large\nenough to compensate for the effect of SRS. Once SRS is included, the conductivity still\nremains a factor of ~2X higher for the smaller diameters compared to the larger ones.\nStrong orientation dependence is evident. The [111] NWs provide ~2X higher\nconductivity than the [110] ones. The conductivity of the [100] NWs is much lower, and\nis additionally decreased with diameter scaling.\n\nStrong orientation and diameter dependence is also evident in the Seebeck\ncoefficients of Fig. 7b. At larger diameters, S is almost the same for all NW orientations.\nAs the diameter is reduced, S increases in the [100] NW case, whereas it decreases in the\n[110] and [111] cases. At the smaller diameters, the [100] NWs have almost ~2X larger S\nthan the other two orientations. The ~2X advantage in S of the [100] NWs over the other\norientations is not enough to compensate for the large differences in their conductivity.\nAs a result, the power factor shown in Fig. 7c, is higher for the [111] and [110] NWs,\nwhereas still remains low for the [100] NWs. Including SRS in the results, increases S\nonly slightly. Therefore, the ~2X reduction in conductivity due to SRS, directly translates\nto a power factor reduction.\n\nV. Analysis and Discussion\nA. The effect of temperature\nUp to this point, our analysis was performed at room temperature, and we have\nfocused on the effect of geometry, confinement, and orientation on the thermoelectric\ncoefficients. Here, we show that the main trends and conclusions we have presented hold\n\n23\n\n\fat different temperatures as well. The effect of temperature changes the strength of\nphonon scattering and the shape of the Fermi distribution. The geometry trends, however,\nare still unchanged. This is shown in Fig. 8 for the n-type [111] NW, but the trends are\nvery similar for the rest of the NW families as well.\n\nFigure 8a shows the phonon-limited electrical conductivity of the NW as a\nfunction of diameter for three different temperatures, T=150K, 300K and 450K. The\ncarrier concentration is assumed to be n=1019/cm3. Phonon scattering strength increases\nas the temperature increases, and therefore the conductivity decreases with temperature\nincrease at all diameter ranges. The Seebeck coefficient on the other hand, in Fig. 8b,\nfollows the reverse trend, increasing with raising temperature. Part of the reason has to do\nwith the increase in EC  EF as the temperature increases. The inset of Fig. 8b shows the\n\nEC  EF for the D=12nm NW as a function of the carrier concentration for the three\ndifferent temperatures. At higher temperatures, the Fermi distribution spreads out more,\nfilling up more states in the bands. To maintain the same carrier concentration, EF shifts\nfarther away from the band edge EC, which increases the Seebeck coefficient. The\ntemperature dependence is stronger at larger diameters D=12nm, whereas at D=3nm it is\nnegligible. The dispersion of the D=12nm NW consists of many more subbands. More\ncarriers are picked as the temperature increases, which causes a larger EC  EF shift. The\npower factor in Fig. 8c is more affected by the larger conductivity changes, and therefore\nreduces with temperature increase. The basic trends are retained for the rest of the NW\ntypes as well.\n\nHere, we note that we do not consider the effect of phonon drag in the calculation\nof the Seebeck coefficient in the analysis above, as we focus on the effect of geometry.\nInclusion of phonon drag is significantly demanding involving several phonon scattering\nmechanisms. Reference [2] points out the importance of phonon drag for T~150K, and,\ntherefore, our calculated S at this temperature could be underestimated. In that work, it\nwas claimed that phonon drag can enhance the ZT significantly and further analysis of\nthis concept will be very promising and useful [35]. In general, however, such an effect is\n\n24\n\n\fnot observed for temperatures above T~100K, especially for nanostructures where\nboundary scattering is significant [1, 76, 77].\n\nThe results in Fig. 8 only considered the effect of phonon scattering. Such an\nanalysis will relevant for the case of undoped, or charge transfer thermoelectric devices\nusing methods as described in Refs [66, 73, 75]. As we have seen in Fig. 4, however, the\neffect of impurity scattering dominates the amplitude of the thermoelectric coefficients at\nthe high impurity concentrations of n0=1019/cm3 where the peak of the power factor\nappears. As discussed in Ref. [38], the impurity scattering limited conductivity increases\nwith temperature because the faster moving carriers are deflected less. Of course the\nscreening length LD (Eq. 22) increases with\n\nT , which tends to increase scattering, but\n\nthe former process dominates. Although phonon scattering tends to decrease the\nconductivity as the temperature raises, at n0=1019/cm3 impurity scattering dominates both\nthe amplitude and the temperature dependence, and the overall conductivity increases.\nThe Seebeck coefficient on the other hand is scattering independent at first order, and its\ntemperature variation is very similar to what is shown in Fig. 8b. Therefore, although the\nmagnitude of the power factor is lower when impurities are considered, the decreasing\ntrend in the power factor with temperature observed for the phonon-limited result, will\nnot hold in the impurity scattering dominated case. Rather, the power factor will increase\nas the temperature increases because, both: i) the impurity dominated conductivity and ii)\nthe Seebeck coefficient, both increase with temperature and will determine the power\nfactor temperature behavior.\n\nFigure 9 illustrates this behavior by plotting the power factor of the n-type, [111],\nD=12nm NW, for carrier concentrations n=1019/cm3, as a function of temperature. Figure\n9a shows the phonon-limited result which has a monotonic decrease with temperature\nincrease as in Fig. 8c. Indeed, this behavior is in agreement with recent experimental\nobservations for gated, undoped thermoelectric devices [66]. Figure 9b shows the phonon\nplus impurity limited result which has the opposite trend. It demonstrates that the\ntemperature dependence of the impurity scattering-limited conductivity dominates the\ntemperature dependence of the power factor, rather than the temperature dependence of\n\n25\n\n\fthe phonon-limited conductivity. This behavior is also in agreement with experimental\nobservations for the power factor in devices with heavily doped channels [1]. We\nmention that the magnitude of the impurity dominated result is much lower than the\nphonon-limited result. Since impurity scattering has such strong detrimental effect on the\nconductivity, utilizing methods to achieve high carrier concentrations other than direct\ndoping would be beneficial [66, 73, 74, 75].\n\nB. n-type NWs: The ZT figure of merit\nRecent reports on thermal conductivity measurements have shown that the\nthermal conductance of Si NWs with diameters scaled down to D=15nm or D=20nm can\nbe as low as k=1-2W/mK [1, 78, 79], two orders of magnitude lower than its bulk\nmaterial value. As a result, the room temperature thermoelectric figure of merit (ZT) of\nsilicon NWs was measured to be ZTNW~0.5, greatly enhanced from the bulk Si value\nZTbulk~0.01. Using kl=2W/mK for the lattice thermal conductivity, we estimate the\nexpected ZT using the calculated power factors and ke for the NWs considered in this\nstudy. We consider separately both, the effects of phonon, SRS and impurity scattering\nfor concentrations 1019/cm3. The ZT values we report are just estimates since kl can be\neven lower, as well as orientation dependent [80, 81], in which cases ZT can be different\nand even higher.\n\nFigure 10 shows the results for the ZT figure of merit versus diameter for the ntype NWs in [100] (blue), [110] (red) and [111] (green) NW orientations. Figure 10a\nshows phonon-limited results (dashed lines) and phonon plus SRS limited results (solid\nlines). The trends in all cases follow the power factor trends described in the previous\nsections. ZT values close to unity can be achieved for the larger NW diameters. For the\nsmaller diameters, the ZT values are lower, even below ZT~0.5. Figure 10b shows\nphonon plus SRS plus impurity scattering limited results (solid lines). The phononlimited results (dashed lines – same as in Fig. 10a) are also shown for comparison\npurposes. Again the influence of impurity scattering at such high concentrations causes a\nlarge degradation in the ZT, bringing it at values close to ZT~0.2, a factor of ~4X lower\nthan the phonon-limited result.\n\n26\n\n\fC. p-type NWs: The ZT figure of merit\nThe corresponding ZT results for p-type NWs are shown in Fig. 11. For p-type\nNWs the ZT values are somewhat lower than for the n-type NWs. The phonon-limited ZT\nin Fig. 11a (dashed lines) picks up for smaller diameters for the [111] and [110] NWs and\nreaches around unity, but at larger diameters ZT drops to ~0.2. SRS (solid lines in Fig.\n11a) causes the ZT at lower diameters to reduce to ZT~0.5. The trends again follow the\npower factor trends described in Fig. 7. Finally, the influence of impurity scattering for\nconcentrations of p0=1019/cm3 in Fig. 11b (solid lines) causes a large degradation in the\nZT, bringing it at values close to ZT~0.1, a factor of ~4X lower than the phonon-limited\nresult (dashed lines).\n\nD. Assumptions and design optimization\nThe value kl=2W/mK used for the calculation of ZT is measured for D=15nm Si\nNWs [79]. This might be even smaller for smaller NW diameters or even orientation\ndependent [80, 81]. In addition, the SRS strength is subject to the parameters used for the\nautocorrelation length LC and the Δrms value. These can be varying depending on the\ntechnology process, and be subject to the properties of the different confining surfaces\n[32]. The phonon scattering strength depends on the magnitude of the electron-phonon\ninteraction used. It is suggested that the DADP in NWs is as high as DAPD=14.7eV [46]\ninstead of DAPD=9.5eV used in our calculations. Additionally, the effect of phonon\nconfinement is not taken into account, although studies have shown that it can only result\nin 10~20% correction in the conductivity [43, 44, 45, 60, 62]. Depending on all these\nassumptions, the power factor and ZT could potentially change. Nevertheless, the\nmagnitude of the results of our calculation is in agreement with other reports, both\ntheoretical [16, 82] and experimental [1, 2, 6, 66]. More importantly, the topological\ntrends we describe, and their importance on σ over S will still hold. To that effect, the\nbenefits of scaling the diameter in p-type [111] and [110] NWs, point toward design\ndirections for nanoscale devices with enhanced performance.\n\n27\n\n\fThe assumptions mentioned above affect our results mostly quantitatively. One\nassumption that might have qualitative influence is the fact that we have ignored the\neffect of NW surface relaxation and reconstruction. The electronic structure might be\naltered upon reconstruction, especially for the narrower D=3nm NWs. It is useful,\ntherefore, to provide an estimate of how this effect can influence our results for these\nnarrow NWs. Theoretical reports that discuss the effect of passivation and relaxation of\nNW surfaces using ab-initio methods [83, 84, 85, 86] conclude that the physical structure\nis still diamond-like, and does not change in any noticeable way even for ultra-thin NWs\ndown to 1nm in diameter [84]. This is also evident from SEM and TEM images of the\ncross sections of NWs down to very small diameters even D=3nm in several instances in\nthe literature [87, 88, 89, 90, 91]. These images show that the structure is still diamondlike, without any observable deformations. The theoretical studies show that the Si-Si\nsurface bond lengths change only by <1.5%, whereas in the cores of the NWs the bond\nvariation is negligible, (<0.1%) [83, 85, 92]. The bandgaps, on the other hand, change\nupon passivation and are strongly influenced by the choice of passivation agents (some of\nthe common ones are -H, -OH, and –NH2, and SiO2) [86].\nWith regard to the effective masses of the subbands, which have the main\ninfluence on the electronic properties we investigate, Vo et al. [83] using ab-initio\nmethods have calculated that upon hydrogen passivation and reconstruction, the electron\nand hole masses of Si NWs of D=3nm change as follows. For electrons: [100] ~15%\nincrease, [110] ~7% decrease, [111] ~15% increase. For holes: [100] ~30% decrease,\n[110] no change, [111] no change. The p-type [100] NW is the one affected the most. As\ndescribed by Buin et al. in Ref. [43], the mobility of single subband 1D narrow NWs\n3/2\nfollows the relation   meff\n. A 30% reduction in the effective mass will roughly result\n\nin ~70% increase in the mobility and accordingly the conductivity. Although this is a\nlarge deviation, the conductivity we report for this NW is much lower than that of the\nother NWs, anyway, and therefore our anisotropy conclusions will not be altered. In the\ncase of electrons in [100] and [111] NWs the NW conductivity might be ~30% lower\nthan what our calculations show, once relaxation is considered. Again, for this case, our\nresults show that the conductivity for these NWs is lower than that of the [110] NW, and\n\n28\n\n\ftherefore the conclusion with regards to anisotropy are still valid. Indeed, in another work\nVo et al. [16] reported conductivity calculations for D=1.1nm relaxed NWs in different\ntransport orientations. Although a different transport model and different diameters were\nused, the conductivity trends they present are very similar to the trends we present in our\nwork (but for the D=3nm NWs). Regarding the n-type [110] D=1nm NWs, Liang et al.\n[93] have also shown that reconstruction effects are minimal on the NW's ballistic\nperformance, precisely because of the small variation of the effective mass upon\nreconstruction, as also calculated by Vo et al in Ref. [83]. We, therefore, believe that\nreconstruction might somewhat affect the magnitude of the conductivity we calculate in\nsome cases, but noticeably only for the D=3nm p-type [100] NW. The effect, however,\ndoes not seem to be strong enough to alter the anisotropy behavior we describe.\n\nOur results show that the influence of any design parameters, such as diameter,\norientation, or even carrier type, is much stronger on the conductivity of NWs, rather than\nthe Seebeck coefficient, which does not change significantly. The higher power factor\nand ZT appear in NWs with the highest conductivity, rather than the highest Seebeck\ncoefficient. We note that when considering purely ballistic transport the results indicate\nthe reverse, namely that the NWs with the largest Seebeck coefficient exhibit the largest\npower factors and ZT [11, 15]. For optimal results, the electronic structure can be\nengineered using quantization and band engineering. One needs to keep σ high, by\nutilizing light effective mass subbands, or using strain engineering to reduce the effective\nmasses of the subbands. In nanostructures, band engineering is partially possible,\nespecially when utilizing devices in different orientations. From the observations about ptype [111] and [110] NWs, benefits can be achieved through proper optimization studies.\nIdeally one should also target the increase in S by allowing more valleys nearby in\nenergy, or using transport orientations with subbands of higher degeneracy, but this\nshould not be in the expense of σ.\n\n29\n\n\fVI. Conclusion\nGeometry and confinement effects on the room temperature thermoelectric\ncoefficients (σ, S, σS2, ke, ZT) of n- and p-type silicon NWs are investigated. Different\ntransport orientations and diameters from D=12nm down to D=3nm are considered.\nAtomistic electronic structures and linearized Boltzmann transport including all relevant\nscattering mechanisms are employed. We find that in Si, confinement effects can have an\ninfluence on the power factor at length scales below ~7nm. We find that the influence of\nconfinement and geometry on the power factor originates mostly from changes in the\nconductivity which is strongly affected, rather than the Seebeck coefficient which is\nweakly affected. These trends are preserved over a range of different temperatures.\n\nIn general, enhanced scattering (phonon and especially SRS) at these diameter\nscales strongly degrades the power factor of the device. In special cases such as p-type\n[110] and [111] oriented NWs, however, confinement largely improves the channel's\nconductivity without significantly reducing the Seebeck coefficient. Improvements in the\npower factor of ~2-3X can as a result be achieved. Benefits to the power factor can\ntherefore be achieved though bandstructure modifications that influence the conductivity\nand not through improvements in the Seebeck coefficient.\n\nFor n-type NWs, at D=3nm, the [110] NW has slightly higher performance than\nNWs in other orientations because its subbands acquire lighter effective mass under\ndiameter scaling, whereas at D=12nm the [100] NW performs better. Distinctly, the\nconductivity and power factor of p-type [111] and [110] NWs improves as the diameter\nscales below D=7nm. We estimate that ZT values close to unity can be achieved, in\nagreement with experimental observations. We finally show that the maximum power\nfactor is achieved at carrier concentrations of 1019/cm3 as in the case of the bulk material.\nImpurity scattering strongly degrades the power factor at such concentrations. Large\nimprovements can be achieved, however, if other possible ways to achieve high carrier\nconcentrations other than direct doping are utilized.\n\n30\n\n\fAcknowledgements\nThis work was supported by the Austrian Climate and Energy Fund, contract No. 825467.\n\n31\n\n\fReferences\n[1] A. I. Hochbaum, R. Chen, R. D. Delgado, W. Liang, E. C. Garnett, M. Najarian, A.\nMajumdar, and P. Yang, Nature, vol. 451, pp. 163-168, 2008.\n[2] A.I. Boukai, Y. Bunimovich, J. T.-Kheli, J.-K. Yu, W. A. G. III, and J. R. Heath,\nNature, vol. 451, pp. 168-171, 2008.\n[3] R. Venkatasubramanian, E. Siivola, T. Colpitts, and B. O' Quinn, Nature, vol. 413,\npp. 597-602, 2001.\n[4] W. Kim, S. L. Singer, A. Majumdar, D. Vashaee, Z. Bian, A. Shakouri, G. Zeng, J. E.\nBowers, J. M. O. Zide, and A. C. Gossard, Appl. Phys. Lett., vol. 88, p. 242107, 2006.\n[5] Y. Wu, R. Fan, and P. Yang, Nano Lett., vol. 2, no. 2, pp. 83-83, 2002.\n[6] J. Tang, H.-T. Wang, D. H. Lee, M. Fardy, Z. Huo, T. P. Russell, and P. Yang, Nano\nLett., 10, 10, 4279-4283, 2010.\n[7] P. Martin, Z. Aksamija, E. Pop, and U. Ravaioli, Phys. Rev. Lett., 102, 125503, 2009.\n[8] L.D. Hicks, and M. S. Dresselhaus, Phys. Rev. B, vol. 47, no. 24, p. 16631, 1993.\n[9] M. Dresselhaus, G. Chen, M. Y. Tang, R. Yang, H. Lee, D. Wang, Z. Ren, J.-P.\nFleurial, and P. Gagna, Adv. Mater., vol. 19, pp. 1043-1053, 2007.\n[10] J. P. Heremans, V. Jovovic, E. S. Toberer, A. Samarat, K. Kurosaki, A.\nCharoenphakdee, S. Yamanaka, and G. J. Snyder, Science, 321, 554, 2008.\n[11] N. Neophytou, M. Wagner, H. Kosina, and S. Selberherr, J. Electr. Materials, vol.\n39, no. 9, pp. 1902-1908, 2010.\n[12] G. D. Mahan and J. O. Sofo, Proc. Natl. Acad. Sci. USA, vol. 93, pp. 7436-7439,\n1996.\n[13] R. Kim, S. Datta, and M. S. Lundstrom, J. Appl. Phys., vol. 105, p. 034506, 2009.\n[14] C. Jeong, R. Kim, M. Luisier, S. Datta, and M. Lundstrom, J. Appl. Phys. 107,\n023707 2010.\n[15] G. Liang, W. Huang, C. S. Koong, J.-S. Wang, and J. Lan, J. Appl. Phys. 107,\n014317, 2010.\n[16] T. T.M. Vo, A. J. Williamson, and V. Lordi, Nano Lett., vol. 8, no. 4, pp. 11111114, 2008.\n\n32\n\n\f[17] T. J. Scheidemantel, C. A.-Draxl, T. Thonhauser, J. V. Badding, and J. O. Sofo,\nPhys. Rev. B, vol. 68, p. 125210, 2003.\n[18] N. Neophytou, A. Paul, M. Lundstrom, and G. Klimeck, IEEE Trans. Elect. Dev.,\nvol. 55, no. 6, pp. 1286-1297, 2008.\n[19] N. Neophytou, S. G. Kim, G. Klimeck, and H. Kosina, J. Appl. Phys., 107, 113701,\n2010.\n[20] T. B. Boykin, G. Klimeck, and F. Oyafuso, Phys. Rev. B, vol. 69, no. 11, pp.\n115201-115210, 2004.\n[21] G. Klimeck, S. Ahmed, B. Hansang, N. Kharche, S. Clark, B. Haley, S. Lee, M.\nNaumov, H. Ryu, F. Saied, M. Prada, M. Korkusinski, T. B. Boykin, and R. Rahman,\nIEEE Trans. Electr. Dev., vol. 54, no. 9, pp. 2079-2089, 2007.\n[22] J. C. Slater and G. F. Koster, Phys. Rev., vol 94, no. 6 (1954).\n[23] R. C. Bowen, G. Klimeck, R. Lake, W. R. Frensley and T. Moise, J. of Appl. Phys.\n81, 3207 (1997).\n[24] J. Wang, PhD thesis, Purdue University (2005).\n[25] G. Klimeck, S. Ahmed, N. Kharche, M. Korkusinski, M. Usman, M. Prada, and T.\nB. Boykin, IEEE Trans. Electr. Dev., vol. 54, no. 9, pp. 2090-2099, 2007.\n[26] N. Kharche, M. Prada, T. B. Boykin, and G. Klimeck, Appl. Phys. Lett., vol. 90, no.\n9, p. 092109 (2007).\n[27] R. Rahman, C. J. Wellard, F. R. Bradbury, M. Prada, J. H. Cole, G. Klimeck, and L.\nC. L. Hollenberg, Phys. Rev. Lett., vol 99, no. 3, p. 036403 (2007).\n[28] S. Lee, F. Oyafuso, P. Von, Allmen, and G. Klimeck, Phys. Rev. B, vol. 69, pp.\n045316-045323 (2004).\n[29] S.E. Thompson et al., IEEE Trans. Electr. Dev., vol. 51, no. 11, pp. 1790-1797\n(2004).\n[30] M. Saitoh, S. Kobayashi, and K. Uchida, Int. Elec. Dev. Meeting, IEDM, pp. 711714 (2007).\n[31] N. Neophytou, A. Paul, and G. Klimeck, IEEE Trans. Nanotechnol., vol. 7, no. 6,\npp. 710-719, 2008.\n[32] N. Neophytou and G. Klimeck, Nano Lett.,vol. 9, no. 2, pp. 623-630, 2009.\n\n33\n\n\f[33] D. M. Rowe, \"Thermoelectrics Handbook: Macro to Nano,\" CRC Press, Taylor and\nFrancis Group, 2006.\n[34] G. S. Nolas, J. Sharp, and H. J. Goldsmid, \"Thermoelectrics: Basic Principles and\nNew Materials Developments,\" Springer, 2001.\n[35] C. J. Vineis, A. Shakouri, A. Majumdar, and M. C. Kanatzidis, Adv. Mater., 22,\n3970-3980, 2010.\n[36] E. B. Ramayya and I. Knezevic, in Proc. of Intern. Workshop on Comput.\nElectronics, IWCE, 2009.\n[37] N. Neophytou and H. Kosina, Nano Lett., vol. 10, no. 12, pp. 4913-4919 (2010).\n[38] M. Lundstrom, \"Fundamentals of Carrier Transport,\" Cambridge University Press,\n2000.\n[39] D. K. Ferry and S. M. Goodnick, \"Transport in Nanostructures,\" Cambridge\nUniversity Press, 1997.\n[40] M. V. Fischetti, J. Appl. Phys., 89, 1232, 2001.\n[41] M. V. Fischetti, Z. Ren, P. M. Solomon, M. Yang, and K. Rim, J. Appl. Phys., 94,\n1079, 2003.\n[42] D. Esseni and A. Abramo, IEEE Trans. Electr. Dev., 50, 7, 1665, 2003.\n[43] A. K. Buin, A. Verma, A. Svizhenko, and M. P. Anantram, Nano Lett., vol. 8, no. 2,\npp. 760-765, 2008.\n[44] A. K. Buin, A. Verma, and M. P. Anantram, J. Appl. Phys., vol. 104, p.\n053716, 2008.\n[45] E. B. Ramayya, D. Vasileska, S. M. Goodnick, and I. Knezevic, J. Appl. Phys., vol.\n104, p. 063711, 2008.\n[46] S. Jin, M. V. Fischetti, and T. Tang, Jour. Appl. Phys., 102, 83715. 2007\n[47] S. M. Goodnick, D. K. Ferry, C. W. Wilmsen, Z. Liliental, D. Fathy, and O. L.\nKrivanek, Phys. Rev. B, vol. 32, p. 8171, 1985.\n[48] H. Sakaki, T. Noda, K. Hirakawa, M. Tanaka, and T. Matsusue, Appl. Phys. Lett.,\nvol 51, no. 23, p. 1934, 1987.\n[49] K. Uchida and S. Takagi, Appl. Phys. Lett., vol. 82, no. 17, pp. 2916-2918, 2003.\n\n34\n\n\f[50] R. E. Prange and T.-W. Nee, Phys. Rev., vol. 168, 779, 1968.\n[51] T. Ando, A. Fowler, and F. Stern, Rev. Mod. Phys., vol. 54, p. 437, 1982.\n[52] D. Esseni, IEEE Trans. Electr. Dev., vol. 51, no. 3, p. 394, 2004.\n[53] T. Fang, A. Konar, H. Xing, and D. Jena, Phys. Rev. B, 78, 205403, 2008.\n[54] J. Wang, E. Polizzi, A. Ghosh, S. Datta, and M. Lundstrom, Appl. Phys. Lett., 87,\n043101, 2005.\n[55] J. Lee and H. N. Spector, J. Appl. Phys., vol. 57, no. 2, p. 366, 1985.\n[56] S. D. Sarma and W. Lai, Phys. Rev. B, vol. 32, no. 2, p. 1401, 1985.\n[57] P. Yuh and K. L. Wang, Appl. Phys. Lett., vol. 49, no. 25, p. 1738, 1986.\n[58] C. Jacoboni and L. Reggiani, Rev. Mod. Phys., vol. 55, 645, 1983.\n[59] J. C. Li, C. L. Wang, H. Peng, M. X. Wang, R. Z. Zhang, H. C. Wang, J. Liu, M. L.\nZhao, and L. M. Mei, J. Appl. Phys., 108, 063702, 2010.\n[60] L. Donetti, F. Gamiz, J. B. Roldan, and A. Godoy, J. Appl. Phys., vol. 100, p.\n013701, 2006.\n[61] A. Balandin, and K. L. Wang, Phys. Rev. B, 58, pp. 1544-1549, 1998.\n[62] L. Donetti, F. Gamiz, N. Rodriquez, and A. Godoy, IEEE Electr. Dev. Lett., vol. 30,\nno. 12, p. 1338, 2009.\n[63] N. Nishiguchi, Pys. Rev. B, 54, 1494, 1996.\n[64] M. V. Fischetti and S. E. Laux, J. Appl. Phys., 80, 2234, 1996.\n[65] T. Yamada and D. K. Ferry, Solid-State Electron., 38, 881, 1995.\n[66] H. J. Ryu, Z. Aksamija, D. M. Paskiewicz, S. A. Scott, M. G. Lagally, I. Knezevic,\nand M. A. Eriksson, Phys. Rev. Lett., vol. 105, p. 256601, 2010.\n[67] H. Kosina and G. K.-Grujin, Solid-State Electronics, vol. 42, no. 3, pp. 331-338\n(1998).\n[68] V. M. Fomin and P. Kratzer, Phys. Rev. B, vol. 82, 045318, 2010.\n[69] V. M. Fomin and P. Kratzer, Physica E, vol. 42, 906, 2010.\n\n35\n\n\f[70] F. Stern and W. E. Howard, Phys. Rev. 163, 816, 1967.\n[71] A. Rahman, M. S. Lundstrom, and A. W. Ghosh, J. Appl. Phys. 97, 053702, 2005.\n[72] M. P. Persson, A. Lherbier, Y.-M. Niquet, F. Triozon, and S. Roche, Nano Lett., 8,\n4146, 2008.\n[73] S. Goswami, C. Siegert, S. Shamim, M. Pepper, I. Farrer, D. A. Ritchie, and A.\nGhosh, Appl. Phys. Lett., 97, 132104, 2010.\n[74] P. Zhang, E. Tewaarwerk, B.-N. Park, D. E. Savage, G. K. Celler, I. Knezevic, P. G.\nEvans, M. A. Eriksson, and M. G. Lagally, Nature Lett., 439, 703, 2006.\n[75] T. He, J. He, M. Lu, B. Chen, H. Pan, W. F. Reus, W. M. Nolte, D. P. Nackashi, P.\nD. Franzon, and J. M. Tour, J. Am. Chem. Soc., 128, 14537, 2006.\n[76] L. Weber, M. Lehr, and E. Gmelin, Phys. Rev. B, 46, 15, 9511-9514, 1992.\n[77] E. Shapira, A. Tsukernik, and Y. Selzer, Nanotechnology, 18, 485703, 2007.\n[78] D. Li, Y. Wu, R. Fan, P. Yang, and A. Majumdar, Appl. Phys. Lett., vol. 83, p.\n3186, 2003.\n[79] R. Chen, A. I. Hochbaum, P. Murphy, J. Moore, P. Yang, and A. Majumdar, Phys.\nRev. Lett., vol. 101, p. 105501, 2008.\n[80] T. Markussen, A.-P. Jauho, and M. Brandbyge, Nano Lett., vol. 8, no. 11, pp. 37713775, 2008.\n[81] Z. Aksamija and I. Knezevic, Phys. Rev. B, 82, 045319, 2010.\n[82] T. Markussen, A.-P. Jauho, and M. Brandbyge, Phys. Rev. B, 79, 035415, 2009.\n[83] T. Vo, A. J. Williamson, and G. Galli, Phys. Rev. B, 74, 045116, 2006.\n[84] M. Nolan, S. O' Callaghan, G. Fagas, and J. C. Green, Nano Lett., 7, 34-38, 2007.\n[85] M.-F. Ng, L. Zhou, S.-W. Yang, L. Y. Sim, V. C. Tan and P. Wu, Phys. Rev. B, 76,\n155435, 2007.\n[86] B. Aradi, L. E. Ramos, P. Deak, Th. Koehler, F. Bechstedt, R. Q. Zhang, and Th.\nFrauenheim, Phys. Rev. B, 76, 035305, 2007.\n\n36\n\n\f[87] K. H. Cho, Y. C. Jung, B. H. Hong, S. W. Hwang, J.H. Oh, D. Ahn, S. D. Suk, K. H.\nYeo, D.-W Kim, D. Park, and W.-S. Lee, IEEE Int. Elec. Dev. Meeting, IEDM, 543,\n(2006).\n[88] K. H. Cho, K.H. Yeo, Y.Y Yeoh, S. D. Suk, M. Li, J. M. Lee, M.-S. Kim, D.-W.\nKim, D. Park, B. H. Hong, Y. C. Jung, and S. W. Hwang, Appl. Phys. Lett., 92, 052102\n(2008).\n[89] T. Tezuka, E. Toyoda, S. Nakaharai, T. Irisawa, N. Hirashita, Y. Moriyama, N.\nSugiyama, N. Taoka, Y. Yamashita, O. Kiso, T. Yamamoto, and S. Takagi, IEEE Int.\nElec. Dev. Meeting, IEDM, 887 (2007).\n[90] S. D. Suk, M. Li, Y. Y. Yeoh, K. H. Yeo, K. H. Cho, I. K. Ku, H. Cho, W. J. Jang,\nD.-W. Kim, D. Park, and W.-S. Lee, IEEE Int. Elec. Dev. Meeting, IEDM, 891, (2007)\n[91] S. Bangsaruntip, G. M. Cohen, A. Majumdar, Y. Zhang, S. U. Engelmann, N. C.\nFuller, L. M. Gignac, S. Mittal, J. S. Newbury, M. Guillorn, T. Barwicz, L. Sekaric, M.\nM. Frank, and J. W. Sleight, IEEE Int. Elec. Dev. Meeting, IEDM, 297, (2009).\n[92] W. H. Qi and S. T. Lee, Chemical Physics Letters, 483, 247-249, 2009.\n[93] G. Liang, D. Kienle, S. K. R. Patil, J. Wang, A. W. Ghosh, and S. V. Khare, IEEE\nTrans. Nanotechnol. 6, 225, 2007.\n\n37\n\n\fTable I:\nADP\n\nIVS\n\nSRS\n\nImpurity\n\n1) Δrms=0, n0=0\n\n49\n\n51\n\n-\n\n-\n\n2) Δrms1,\n\nn0=0\n\n17\n\n18\n\n65\n\n-\n\n3) Δrms2,\n\nn0=0\n\n6\n\n6\n\n88\n\n-\n\n4) Δrms1,\n\nn01\n\n6\n\n6\n\n23\n\n65\n\n5) Δrms2,\n\nn01\n\n4\n\n4\n\n54\n\n38\n\n6) Δrms1,\n\nn02\n\n4\n\n4\n\n14\n\n78\n\n7) Δrms2,\n\nn02\n\n3\n\n3\n\n38\n\n56\n\nTable I caption:\nThe percentage of the separate contributions of the individual scattering mechanisms to\nthe total relaxation rate for the n-type, [100], D=3nm NW. The different scattering\nmechanisms are shown column-wise. Different combinations of scattering conditions are\nshown row-wise. Phonon scattering is always included, whereas SRS and impurity\nscattering are gradually added. In the first row only phonon scattering is considered. Δrms1\ncorresponds to Δrms=0.24nm, and Δrms2 to Δrms=0.48nm (the one used throughout the\nmanuscript). n01 corresponds to impurity concentration n0=1018/cm3, and n02 to impurity\nconcentration n0=1019/cm3 (the one used throughout the manuscript).\n\n38\n\n\fFigure 1:\n\n(a)\n\n(b)\n\n(c)\n\nFigure 1 caption:\nThermoelectric coefficients for n-type NWs in [100] (blue), [110] (red) and [111] (green)\ntransport orientations for diameters D=3nm (solid lines) and D=12nm (dashed lines)\nversus carrier concentration. (a) The electrical conductivity. (b) The Seebeck coefficient.\n(c) The power factor. Only phonon scattering (ADP and IVS) are considered.\n\n39\n\n\fFigure 2:\n\nFigure 2 caption:\nEC  EF for n-type NWs of D=12nm (dashed lines) and D=3nm (solid lines) versus the\ncarrier concentration. [100] (blue), [110] (red) and [111] (green) transport orientations are\nshown.\n\n40\n\n\fFigure 3:\n(a)\n\n(b)\n\n(c)\n\nFigure 3 caption:\nThermoelectric coefficients for n-type NWs in [100] (square-blue), [110] (triangle-red),\nand [111] (circle-green) transport orientations versus the NW diameter. The carrier\nconcentration is n=1019/cm3. (a) The electrical conductivity. (b) The Seebeck coefficient.\n(c) The power factor. Dashed lines: Only phonon scattering (ADP and IVS) is\nconsidered. Solid lines: Phonon scattering and SRS are considered.\n\n41\n\n\fFigure 4:\n(a)\n\n(b)\n\n(c)\n\nFigure 4 caption:\nThermoelectric coefficients for n-type NWs in [100] (square-blue), [110] (triangle-red),\nand [111] (circle-green) transport orientations versus the NW diameter. (a) The electrical\nconductivity. (b) The Seebeck coefficient. (c) The power factor. Solid lines: Phonon\nscattering, SRS and impurity scattering are considered. The impurity concentration is\nn0=1019/cm3. Dashed lines: Only phonon scattering (ADP and IVS) is considered.\n\n42\n\n\fFigure 5:\n\n(a)\n\n(b)\n\n(100) surface\n\n(c)\n\n(11-2) surface\n\n(d)\n\nFigure 5 caption:\nBandstructure variations with confinement. (a) The (100) heavy-hole band energy surface\nof bulk Si. (b) The (11-2) heavy-hole band energy surface of bulk Si. Energy contours at\n-0.2eV and -1eV are shown. (c) The subband envelopes (higher subbands) for [110] ptype NWs as the diameter scales. (d) The subband envelopes for [111] p-type NWs as the\ndiameter scales. Envelopes for the D=12, 9, 6, and 3nm are shown. a0, a0', and a0'' are the\nunit cell lengths.\n\n43\n\n\fFigure 6:\n\n(a)\n\n(b)\n\n(c)\n\nFigure 6 caption:\nThermoelectric coefficients for p-type NWs in [100] (blue), [110] (red) and [111] (green)\ntransport orientations for diameters D=3nm (solid) and D=12nm (dashed) versus the\ncarrier concentration. (a) The electrical conductivity. (b) The Seebeck coefficient. (c) The\npower factor. Only phonon scattering (ADP and ODP) are considered.\n\n44\n\n\fFigure 7:\n(a)\n\n(b)\n\n(c)\n\nFigure 7 caption:\nThermoelectric coefficients for p-type NWs in [100] (square-blue), [110] (triangle-red)\nand [111] (circle-green) transport orientations versus the NW diameter. The carrier\nconcentration is p=1019/cm3. (a) The electrical conductivity. (b) The Seebeck coefficient.\n(c) The power factor. Solid lines: Phonon scattering (ADP and ODP) and SRS are\nconsidered. Dashed lines: Only phonon scattering is considered.\n\n45\n\n\fFigure 8:\n(a)\n\n(b)\n\n(c)\n\nFigure 8 caption:\nPhonon-limited thermoelectric coefficients for n-type [111] NWs under different\ntemperatures versus the NW diameter. The carrier concentration is n=1019/cm3. (a) The\nelectrical conductivity. (b) The Seebeck coefficient. (c) The power factor. T=150K,\n300K, and 450K are considered.\n\n46\n\n\fFigure 9:\n(a)\n\n(b)\n\nFigure 9 caption:\nThe power factor of the n-type [111] D=12nm NW versus temperature. The carrier\nconcentration is n=1019/cm3. (a) Phonon limited results. (b) Phonon plus impurity\nscattering limited results, with impurity concentration n0=1019/cm3.\n\n47\n\n\fFigure 10:\n(a)\n\n(b)\n\nFigure 10 caption:\nThe ZT figure of merit versus diameter for n-type NWs in [100] (square-blue), [110]\n(triangle-red) and [111] (circle-green) transport orientations. The carrier concentration is\nn=1019/cm3. (a) Dashed lines: Only phonon scattering (ADP and IVS) is considered.\nSolid lines: Phonon scattering and SRS are considered. (b) Dashed lines: Only phonon\nscattering (ADP and IVS) is considered (same as in (a)). Solid lines: Phonon scattering,\nSRS and impurity scattering are considered. The impurity concentration is n0=1019/cm3.\n\n48\n\n\fFigure 11:\n(a)\n\n(b)\n\nFigure 11 caption:\nThe ZT figure of merit versus diameter for p-type NWs in [100] (square-blue), [110]\n(triangle-red) and [111] (circle-green) transport orientations. The carrier concentration is\np=1019/cm3. (a) Dashed lines: Only phonon scattering (ADP and ODP) is considered.\nSolid lines: Phonon scattering and SRS are considered. (b) Dashed lines: Only phonon\nscattering (ADP and ODP) is considered (same as in (a)). Solid lines: Phonon scattering,\nSRS and impurity scattering are considered. The impurity concentration is p0=1019/cm3.\n\n49\n\n\f"}