{"id": "http://arxiv.org/abs/0909.5307v2", "guidislink": true, "updated": "2009-09-30T09:05:49Z", "updated_parsed": [2009, 9, 30, 9, 5, 49, 2, 273, 0], "published": "2009-09-29T10:55:06Z", "published_parsed": [2009, 9, 29, 10, 55, 6, 1, 272, 0], "title": "Integrated photonic qubit quantum computing on a superconducting chip", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0909.0192%2C0909.1846%2C0909.5077%2C0909.2247%2C0909.0996%2C0909.3331%2C0909.2376%2C0909.2105%2C0909.0880%2C0909.4761%2C0909.1940%2C0909.1068%2C0909.5159%2C0909.1030%2C0909.4821%2C0909.3815%2C0909.2697%2C0909.1976%2C0909.3104%2C0909.2010%2C0909.3665%2C0909.3583%2C0909.2180%2C0909.4972%2C0909.2591%2C0909.4719%2C0909.5277%2C0909.0952%2C0909.2542%2C0909.5307%2C0909.5534%2C0909.3226%2C0909.1252%2C0909.2539%2C0909.2274%2C0909.1939%2C0909.4793%2C0909.0415%2C0909.1773%2C0909.3206%2C0909.1553%2C0909.3253%2C0909.4978%2C0909.2254%2C0909.1655%2C0909.4315%2C0909.3340%2C0909.4374%2C0909.2707%2C0909.0162%2C0909.2500%2C0909.4307%2C0909.2258%2C0909.4652%2C0909.0561%2C0909.3685%2C0909.3444%2C0909.2384%2C0909.4289%2C0909.2793%2C0909.2068%2C0909.4090%2C0909.5093%2C0909.2496%2C0909.3906%2C0909.0426%2C0909.3132%2C0909.4018%2C0909.5293%2C0909.1067%2C0909.5141%2C0909.1787%2C0909.4443%2C0909.2819%2C0909.1691%2C0909.1148%2C0909.3519%2C0909.4076%2C0909.1367%2C0909.3455%2C0909.0147%2C0909.1809%2C0909.5526%2C0909.1315%2C0909.2312%2C0909.2790%2C0909.3006%2C0909.1728%2C0909.2257%2C0909.0835%2C0909.0452%2C0909.0417%2C0909.3018%2C0909.3292%2C0909.4755%2C0909.3068%2C0909.2386%2C0909.3014%2C0909.1290%2C0909.4063%2C0909.3257&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Integrated photonic qubit quantum computing on a superconducting chip"}, "summary": "We study a quantum computing system using microwave photons in transmission\nline resonators on a superconducting chip as qubits. We show that all control\nnecessary for quantum computing can be implemented by coupling to Josephson\ndevices on the same chip, and take advantage of their strong inherent\nnonlinearities to realize qubit interactions. We analyze the gate error rate to\ndemonstrate that our scheme is realistic even for Josephson devices with\nlimited decoherence times. A conceptually innovative solution based on existing\ntechnologies, our scheme provides an integrated and scalable approach to the\nnext key milestone for photonic qubit quantum computing.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0909.0192%2C0909.1846%2C0909.5077%2C0909.2247%2C0909.0996%2C0909.3331%2C0909.2376%2C0909.2105%2C0909.0880%2C0909.4761%2C0909.1940%2C0909.1068%2C0909.5159%2C0909.1030%2C0909.4821%2C0909.3815%2C0909.2697%2C0909.1976%2C0909.3104%2C0909.2010%2C0909.3665%2C0909.3583%2C0909.2180%2C0909.4972%2C0909.2591%2C0909.4719%2C0909.5277%2C0909.0952%2C0909.2542%2C0909.5307%2C0909.5534%2C0909.3226%2C0909.1252%2C0909.2539%2C0909.2274%2C0909.1939%2C0909.4793%2C0909.0415%2C0909.1773%2C0909.3206%2C0909.1553%2C0909.3253%2C0909.4978%2C0909.2254%2C0909.1655%2C0909.4315%2C0909.3340%2C0909.4374%2C0909.2707%2C0909.0162%2C0909.2500%2C0909.4307%2C0909.2258%2C0909.4652%2C0909.0561%2C0909.3685%2C0909.3444%2C0909.2384%2C0909.4289%2C0909.2793%2C0909.2068%2C0909.4090%2C0909.5093%2C0909.2496%2C0909.3906%2C0909.0426%2C0909.3132%2C0909.4018%2C0909.5293%2C0909.1067%2C0909.5141%2C0909.1787%2C0909.4443%2C0909.2819%2C0909.1691%2C0909.1148%2C0909.3519%2C0909.4076%2C0909.1367%2C0909.3455%2C0909.0147%2C0909.1809%2C0909.5526%2C0909.1315%2C0909.2312%2C0909.2790%2C0909.3006%2C0909.1728%2C0909.2257%2C0909.0835%2C0909.0452%2C0909.0417%2C0909.3018%2C0909.3292%2C0909.4755%2C0909.3068%2C0909.2386%2C0909.3014%2C0909.1290%2C0909.4063%2C0909.3257&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We study a quantum computing system using microwave photons in transmission\nline resonators on a superconducting chip as qubits. We show that all control\nnecessary for quantum computing can be implemented by coupling to Josephson\ndevices on the same chip, and take advantage of their strong inherent\nnonlinearities to realize qubit interactions. We analyze the gate error rate to\ndemonstrate that our scheme is realistic even for Josephson devices with\nlimited decoherence times. A conceptually innovative solution based on existing\ntechnologies, our scheme provides an integrated and scalable approach to the\nnext key milestone for photonic qubit quantum computing."}, "authors": ["Lianghui Du", "Yong Hu", "Zheng-Wei Zhou", "Guang-Can Guo", "Xingxiang Zhou"], "author_detail": {"name": "Xingxiang Zhou"}, "author": "Xingxiang Zhou", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1088/1367-2630/12/6/063015", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0909.5307v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0909.5307v2", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "5 pages, 3 figures", "arxiv_primary_category": {"term": "quant-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "quant-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0909.5307v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0909.5307v2", "journal_reference": "New J. Phys. 12 (2010) 063015", "doi": "10.1088/1367-2630/12/6/063015", "fulltext": "Integrated photonic qubit quantum computing on a superconducting chip\nLianghui Du, Yong Hu, Zheng-Wei Zhou, Guang-Can Guo and Xingxiang Zhou∗\n\nWe study a quantum computing system using microwave photons in transmission line resonators\non a superconducting chip as qubits. We show that all control necessary for quantum computing\ncan be implemented by coupling to Josephson devices on the same chip. We take advantage of the\nstrong nonlinearities inherent in Josephson junctions to realize qubit interactions. We analyze the\ngate error rate to demonstrate that our scheme is realistic even for Josephson devices with limited\ndecoherence times. A conceptually innovative solution based on existing technologies, our scheme\nprovides an integrated and scalable approach to the next key milestone for photonic qubit quantum\ncomputing.\nPACS numbers: 03.67.Lx, 85.25.Dq, 42.50.-p\n\nDespite the vast potential of quantum computers, no\nperfect physical implementation has been found for quantum computers. This can be seen by examining two representative systems. Josephson device based superconducting systems are easily integrable and scalable, but\nare plagued by the short decoherence times of Josephson\nqubits due to coupling to their complex solid-state environment. Photonic qubits, which have superb coherence\nproperties, suffer from the fact that photons do not interact easily. Also, systems based on conventional bulk\noptical devices are hard to miniaturize and scale.\nRecognizing the importance of integrated systems for\nscalable quantum computing, a number of investigators\nhave demonstrated on-chip waveguide based quantum\ngates for photonic qubits recently [1]. This is a significant step that may represent the future direction of photonic qubit quantum computing technologies. However,\nit is a daunting task to achieve a fully integrated photonic qubit quantum computer using conventional technologies including those developed in the latest experiments. This is because conventional optical devices such\nas lasers, lenses, optical cavities and photo detectors are\nbulk devices based on very different technologies and no\nprocess exists yet to integrate them on the same chip [2].\nTherefore, alternative realistic approaches to fully integrated photonic qubit quantum computing systems are\nhighly valuable.\nWe combine the strengths of photonic and superconducting systems to realize fully integrated photonic qubit\nquantum computing. Our physical system is a superconducting chip on which high-Q transmission line resonators (TLRs) and Josephson devices are fabricated.\nThe same system has been used for study of cavity QED\nbased on Josephson qubits [3, 4, 5]. However, in our\nscheme the quantum information is carried by the microwave photon modes in the TLRs and the Josephson\njunctions play the role of optical devices. For high-Q\nTLRs the photons have a long life time [12] which is a\nmajor advantage. Easy operation and accurate control\n\nare available because Josephson devices can be fabricated\nwith great precision and controlled conveniently by monitoring their electrical signals. A further key advantage is\nwe can use the strong nonlinearities inherent in Josephson devices to induce interactions between photons. It is\nshown that high gate fidelities can be achieved even for\nJosephson devices with limited decoherence times making\ntheir unavoidable noisy environment no longer a limiting\nfactor. Therefore, our scheme is a realistic approach to\nscalable photonic qubit quantum computing.\nWe start by considering the two identical TLRs shown\nin Fig.1(a).\nThe TLR mode frequencies are given by ω =\n√\nnπ/ LC, n an integer and L and C the total inductance\nand capacitance of the TLR. We use the n = 2 mode. For\nL = 0.5nH and C = 5pF, its frequency ω0 /2π ≈ 20GHz.\nThe second-quantized voltage\np and current associated\n†\nwith this mode is V (x, t) = ~ω0 /C cos 2πx\nl (â(t)+ â (t))\np\n†\nand I(x, t) = −i ~ω0 /L sin 2πx\nl (â(t)−â (t)), where l the\nlength of the TLR, x ∈ [−l/2, l/2] the position along the\nTLR, and â(t) = âe−iω0 t the mode's annihilation operator.\n\n3.2\n3.5\n\nCC\n\nIb\nCC\n\nA\n\nIb'\nCr\n\nerror probability (D)\n\narXiv:0909.5307v2 [quant-ph] 30 Sep 2009\n\nKey Laboratory of Quantum Information and Department of Physics,\nUniversity of Science and Technology of China, Chinese Academy of Sciences, Hefei, Anhui 230026, China\n(Dated: November 5, 2018)\n\n3\n3\n\n2.8\n2.6\n\n2.5\n\n2.4\n\n2\n\nB\n\n2.2\n1.5\n0\n0.1\n0.2\n0.3\nκ/2π(MHz) 0.4\n0.5 0\n\n(a)\n\n2\n\n1\n\n3\n2\nΓ2/2π(MHz)\n\n4\n\n5\n\n1.8\n\n(b)\n\nFIG. 1: (a) A photonic qubit based on two TLRs. A and B\nare capacitively coupled to the coupling CBJJ via Cc . B is\nalso coupled to the right CBJJ via Cr . (b) Error probability\n(10−D ) in realizing the photon transfer operation between\nA and B as a function of the photon loss rate κ and CBJJ\ndephasing rate Γ2 .\n\n\f2\nFor the pair of identical TLRs in Fig.1(a), we introduce\na single photon of frequency ω0 and it being in the l eft or\nr ight TLR denotes the logic 0 or 1 state [6] for a single\nqubit. This is analogous to the conventional optical cavity mode representation of photonic qubit where the information is encoded by which cavity the photon is in [7].\nNotice for a dilution refrigerator temperature of 40mK,\nthe thermal photon number in the TLRs is smaller than\n10−10 and thus the 0 or 1 photon state for the TLRs is\nan excellent approximation. To effect arbitrary transformations on this single qubit, we need to be able to shift\nthe relative energies of the TLRs and transfer photons between them, which implement the functionalities of phase\nshifters and beam splitters in optics. We realize this by\ncoupling the TLRs capacitively to current biased Josephson junctions (CBJJ) as shown in Fig. 1 (a). As the simplest Josephson qubit, CBJJ has the advantage that its\nlevel splitting can be easily adjusted by the bias current.\nApproximating the CBJJs as two-state systems with adjustable energy splittings Ωc and Ωr [8], we can write\nthe system Hamiltonian H = ~ω0 (â† â + b̂† b̂) + 21 ~Ωc σcz +\n1\nz\n+\n†\n† −\n+\n† −\n2 ~Ωr σr + ~gc [(â + b̂)σc + (â + b̂ )σc ] + ~gr (b̂σr + b̂ σr )\nz,±\n[9], where σc,r are the Pauli matrices of the coupling\nand right CBJJ, â, b̂ are the annihilation operators for\nphotons in theptwo TLRs, and the coupling strengths\ngc,r = ω0 Cc,r / 2C(CJc,r + 2Cc,r ), CJc,r the capacitance\nof the coupling and right CBJJ.\nSince the CBJJ energies can be easily adjusted by tuning the bias current, we can control the interactions between the TLRs and CBJJs. To transfer photons between\nthe TLRs, we adjust the bias currents of the CBJJs to\ntune Ωr faraway from ω0 so the right CBJJ has no effect. We further tune the coupling CBJJ close to resonance with ω0 and work in the dispersive region where\nthe magnitude of detuning ∆c = Ωc − ω0 is much greater\nthan gc . Assuming the CBJJ was prepared in the ground\nstate, its virtual excitation gives rise to the following effective Hamiltonian for the TLRs [4] in the rotating frame\ndefined by the uncoupled TLR Hamiltonian:\nHef f =\n\n~gc2\n~g 2\n(âb̂† + â† b̂) + c (â† â + b̂† b̂).\n∆c\n∆c\n\n(1)\n\nSince there is only 1 photon in the system, â† â + b̂† b̂ = 1,\nenergy shifts described in the second term in Hef f is a\nconstant. The first exchange term implements the photon\ntransfer operation. A photon can be transferred between\ngc2\n, which is about 20MHz\nthe two TLRs with a rate 2π∆\nc\nfor CJc = 0.5pF, Cc = 23fF, and ∆c /2π = 2GHz [10, 11].\nTo shift the relative energies of the TLRs, we tune\nthe coupling CBJJ far off resonance and tune the right\nCBJJ into the dispersive region. Similarly, an effective\nHamiltonian (~gr2 /∆r )b̂† b̂ results which gives a relative\nphase when the photon is in the right TLR.\nWe need to study the decoherence properties of our\nscheme to analyze its reliability. The photonic qubits\n\nhave superb coherence and their life times are orders of\nmagnitude longer than that of superconducting qubits.\nFor TLRs fabricated on superconducting chips, a high\nquality factor of 106 − 107 has been demonstrated [12].\nFor TLR frequencies of tens of GHz, the photon loss rate\nκ/2π can be as low as KHz. In contrast, the CBJJ has\na short decoherence time, and we assume its dephasing\nrate Γ2 /2π ≈1MHz. The CBJJ's decay rate from the\nexcited state Γ1 /2π is on the order of 0.1MHz.\nA major advantage of our scheme is that the relatively lossy CBJJ does not damp the coherence of the\nphotonic qubits much since it is only virtually excited.\nThe CBJJ's decay from the virtually excited state increases the photon's loss rate by (gc,r /∆c,r )2 Γ1 , which\nis not a concern since (gc,r /∆c,r )2 Γ1 is no greater than\nκ. To study the effect of the CBJJ's dephasing rate Γ2 ,\nwe model the dephasing effect as the result of a random\nfluctuation δn in the CBJJ's energy splitting. This introduces an uncertainty in the detuning during for instance\na photon transfer operation, ∆c = Ωc − ω0 → ∆c + δn .\nTherefore, the system will have a random Hamiltonian\nHnoise = −~(gc /∆c )2 δn (â† b̂ + âb̂† ) in addition to that in\nEq. (1). Assuming the distribution of δn is Gaussian, we\ncan estimate the photonic qubit's decoherence time due\nto Hnoise by using the free induction decay function [13].\nSince the free inductor decay function is determined by\nthe spectral density of δn , which in turn is related to the\nCBJJ's dephasing rate Γ2 , it can be estimated that the\ng2\nsystem's dephasing rate is no greater than 2( ∆c2 )Γ2 .\nc\n\nFollowing the quantum theory of damping, we now calculate the gate error of a photon transfer operation under the influence of cavity loss and CBJJ dephasing. using the Master equation for the qubit's density matrix ρ,\ndρ/dt = −i[Hef f , ρ] + κ[âρâ† − 21 â† âρ − 21 ρâ† â] + κ[b̂ρb̂† −\ngc 2\n1 †\n1\n†\n†\n†\n†\n†\n2 b̂ b̂ρ − 2 ρb̂ b̂] + 2( ∆c ) Γ2 [(â b̂ + âb̂ )ρ(â b̂ + âb̂ ) − ρ].\nThe gate error probability of a single qubit bit flip is plotted in Fig. 1(b) as a function of κ and Γ2 . The result\nindicates that, for already demonstrated Γ2 /2π = 1MHz\nand κ/2π = 10kHz [14], the gate error is on the order of\n10−3 .\nThe manipulations demonstrated so far perform linear\noptics. We still need a mechanism to induce interactions\nbetween photons. This is a major difficulty in conventional optics. However, at microwave frequencies, we can\ntake advantage of the strong nonlinearities in Josephson\ndevices to interact photons.\nWe consider the low current biased 4-junction SQUID\n(FJS) device [15] in Fig. 2(a). The two small identical\nSQUIDs are coupled inductively to TLR C of length l at\npositions ±l/4. (This does not mean that the FJS must\nextend to a length of l/2 because the TLR can be layed\nout in a zig-zag fashion.) Since l is much larger than\nthe dimension of the FJS, we can adopt the long wave\napproximation and use the TLR current at the SQUIDs'\nlocations in calculating the SQUIDs' flux bias. At the\n\n\f3\nl/2\n\nl/4\n\n0\n\nl/4\n\nl/2\n\nC\nMC\n\nMC\nCS\n\nCS\n1\n\n3\n\nIb\n\u0003\n\u009eC\n\n2.5\n\n2\n\ngate error (Q)\n\n\u0003\n\u0010\u009eC\n\n4\n\nCS\n\nCS\n\n\u009eD\nMD\n\n2\n1.5\n1\n0.5\n0\n\n20\n\nD\n\n(a)\n\nλ/δωs\n\n40\n\n60\n\n(b)\nA B\n\nC\n\nD\n\nE\n\nF\n\n\u0003Ă\u0003\u0003\u0003\u0003\u0003\u0003\u0003\u0003\u0003\u0003\u0003\u0003\u0003\u0003\u0003\u0003\u0003\u0003\u0003\u0003\u0003\u0003\u0003\u0003\u0003\u0003\u0003\u0003\u0003\u0003\u0003\u0003\u0003\u0003\u0003\u0003\u0003\u0003\u0003\u0003\u0003\u0003\u0003\u0003\u0003\u0003\u0003\u0003\u0003\u0003\u0003\u0003\u0003\u0003\u0003\u0003\u0003\u0003\u0003\u0003\u0003\u0003\u0003\u0003\u0003\u0003\u0003Ă\n\n(c)\n\nFIG. 2: (a) The 4-junction SQUID to interact photons. (b)\nDependence of the error probability (10−Q ) of a controlled\nphase gate on the ratio between photon transfer rate λ and\nuncertainty in photon energy shift ωs . (c) The setup for controlled photon interaction. The circuit in the dashed-line box\nis that in (a). The TLRs are coupled to CBJJs (not shown)\nso that single bit operations including photon transfer can be\nperformed.\n\ntwo coupling points, the TLR currents are the largest in\nmagnitude and opposite in direction. The main loop is\ncoupled to TLR D at l/4.\nAssuming there is no other external flux bias, the small\nSQUIDs and big loop are biased by the TLR currents\n†\nIC = ∓iI\n= −iID0 (dˆ − dˆ† ), where\np C0 (ĉ − ĉ ) and ID p\nIC0 =\n~ωc /Lc and ID0 =\n~ωd /Ld the zero point\ncurrent fluctuations in the TLRs, Lc,d the inductance of\nthe TLRs and ĉ, dˆ the annihilation operators for photons\nin C and D. We can work out the system's Hamiltonian,\nH = HT LR +HF JS +Hint , where HT LR = ~(ωc +ωsc )ĉ† ĉ+\nˆ HF JS = − EC ∂ 22 − ~Ib φ − 4E 0 cos φ, and\n~(ωd + ωsd )dˆ† d,\nJ\n2 ∂φ\n2e\nHint = ~ωint ĉ† ĉdˆ† dˆ = ~ωint n̂c n̂d .\n\n(2)\n\nIn these equations, Ec = (2e)2 /4(CJ + Cs ) and EJ =\n~Ic /2e are the charging energy and Josephson energy of\nthe junctions, where CJ and Ic are the junctions' capacitance and critical current. φ is the average phase\nof the 4 junctions determined by the low bias current\nIb ≈ 0 of the FJS. The frequency shift ωsc = −2EJ0 (φ2 χ2c +\nχ2c χ2d )/~, ωsd = −2EJ0 (φ2 χ2d + χ2c χ2d )/~ where χc =\nπMC IC0 /(πLs Ic + Φ0 ), χd = πMD ID0 /[π(Ls + LL )Ic +\nΦ0 ], Ls and LL are the self-inductances of the small\nSQUIDs and the circuit loop. To simplify the expressions, we set χ = χc = χd and denote the photon frequency shift ωs ≡ ωsc = ωsd . The photon interaction\nstrength ωint = −4EJ0 χ4 cos φ/~. In deriving the system\nHamiltonian, we have used the rotating wave approximation and dropped terms that will be oscillating fast in the\n\nrotating frame defined by HT LR . We have also dropped\nterms involving creation and annihilation of two photons.\nThese terms have no effect since there is no more than 1\nphoton in the TLRs in our scheme.\nWe operate with a low bias current Ib ≈ 0 for the FJS\nso that hcosφi is large and the FJS' energy splitting is\nfar away from the frequencies of the TLR photons. Thus,\nthe FJS will not be excited by the TLR photons and they\nhardly get entangled. The FJS then acts as a \"nonlinear\nmedium\" and Eq. (2) describes the interaction between\nphotons in C and D modulated by the FJS' phase. For\nIc = 50μA, Ls ≈ 10pH, and MC ≈ 80pH [16], the photon\ninteraction strength ωint ≈ 1MHz, much greater than the\nphoton loss rate. Unfortunately, there are difficulties in\nusing this interaction for quantum computing. First, φ\nhas fluctuations in it due to the FJS' charging energy and\nthus the interaction strength is not a constant. Also, it\nis not easy to turn off the interaction. Tuning φ close to\nπ/2 requires biasing the FJS close to its critical current\nwhich makes the system unstable. The uncertainty in φ\ngrows too.\nTo have the photons interact only when needed, we\nuse a setup shown in Fig. 2 (c). Here TLRs A, B and\nE, F are two qubits with photons being in A and F\nrepresenting their logic 0 state. When both qubits are\nin the 1 state, we can use the photon transfer operation\ndiscussed earlier to transfer the photons from B and E to\nthe auxiliary TLRs C and D whose frequencies are made\ndifferent than that of the qubit TLRs by ωs to account\nfor their energy shifts. Once the photons are in C and D\nthey can interact due to coupling to the FJS. Afterwards,\nwe transfer them back to B and E.\nTo stabilize the FJS' phase, we shunt its junctions\nwith large capacitances Cs as shown in Fig. 2(a).\nAt low bias currents the FJS' behavior can be very\nwell approximated by that of a harmonic oscillator\nand the distribution\np √ of φ is given by its ground state\nα/ π exp[−α2 (φ − φ0 )2 /2], where α =\nwave\nfunction\np\n~Ib\n4\n0\n4EJ cos φ0 /Ec and φ0 = hφi = arcsin 8eE\nIf we\n0 .\nJ\nchoose a total capacitance CJ + Cs = 20pF, the relative uncertainty δ(ωint )/ωint ≈ 10−4 . Such a small error\nis not a concern for the photon interaction term. However uncertainties in the photon energy shift terms ~ωs\ncan be comparable to ~ωint and can cause large errors.\nWe employ a two-phase technique in the spirit of spinecho to address this problem. In phase 1, we first\ndo a photon transfer operation between B, C and E,\nD with a speed relatively fast compared to ωint and\nδωs = −2EJ0 χ2 δ(φ2 )/~, the uncertainty in the photon\nfrequency shift. We then wait for a desired interaction\ntime t = π/ωint after which we do another photon transfer between B, C and E, D. In phase 2, we first perform\na bit flip for the 2 qubits, in other words do a photon\ntransfer operation between A, B and E, F . We then repeat phase 1. At the end, we perform a bit flip on the\n\n\f4\n\nTLR\n3\n\n|eLj\n|fLj\n|gLj\n\nefficiency(P)\n\ntwo qubits again. In this process, depending on their initial states the qubits will acquire the same random phase\ndue to δωs in either phase 1 or 2, thus removing the effect\nof the randomness in the photon energy shifts. The end\nresult is a π phase shift on the 2-qubit states if they are\nboth in 0 or 1 initially. This is equivalent to a controlled\nphase gate and it enables universal quantum computing\nin combination with the single qubit operations.\nIf the photon transfer operation between B, C and\nE, D was perfect, the controlled phase gate would be\nexact. phase shift in C and D could be eliminated completely. However, since the photons in C and D will\ninteract with the FJS even during the photon transfer,\nour control phase gate will have errors. This can be seen\nby examining the system Hamiltonian during the photon\ntransfer (in the rotating frame) H = ~λbc (b̂† ĉ + b̂ĉ† ) +\nˆ The\nˆ − ~ωint ĉ† ĉdˆ† d.\nˆ † ) − 2E 0 χ2 φ2 (ĉ† ĉ + dˆ† d)\n~λde (dˆ† ê + dê\nJ\nfirst two terms are used for the photon transfer operation, however the remaining terms cannot be turned off\nmaking the photon transfer imperfect. Obviously, the fidelity of our controlled phase gate will be improved by\nmaking the photon transfer frequency λbc and λde large\ncompared to δωs and ωint . We numerically studied our\ncontrol phase gate using the full Hamiltonian and plotted the gate error in Fig 2 (b). We set λ ≡ λbc = λde .\nFor our choice of system parameters, λ/δωs ≈ 20 and the\ngate error is on the order of 10−3 .\nOur microelectronic system is easily scalable as shown\nin Fig. 2 (c). We can extend the setup for the control\nphase gate in both ends to integrate many TLR qubits on\nthe same chip with an FJS between each pair of qubits.\nThis is a 1d architecture with controllable interactions\nbetween adjacent qubits that can be scaled to a large\nnumber of qubits.\nIn order to perform photonic qubit quantum computing, we still need to be able to generate and detect single\nphotons. Photon generation on superconducting chip has\nbeen demonstrated experimentally [17, 18, 19]. For photon detection [20, 21], we again consider a CBJJ coupled\nto a TLR of frequency ω0 as shown in Fig. 3 (a). The\nCBJJ is prepared in the ground state |gi in the well of its\nwashboard potential. We also make use of an unstable\nexcited state |ei where the CBJJ can tunnel to the voltage state with a large rate Γ. By adjusting the CBJJ's\nbias current, we can tune the CBJJ in resonance with ω0 .\nThe CBJJ will then be excited by the TLR photon to |ei.\nWhen it escapes from |ei, a detectable voltage appears\nacross the CBJJ.\nThough an easy and reliable method, our scheme may\nfail to detect a photon in the TLR due to the photon decay and the CBJJ's intra-well decay and decoherence. The TLR photon may decay before being detected by the CBJJ. The CBJJ's intra-well decay from\n|ei to |gi and its finite decoherence time are concerns\ntoo. To study the influence of the photon loss rate\nand CBJJ's intra-well decay and decoherence on the ef-\n\n2.5\n2\n1.5\n1\n0.5\n0\n\n(a)\n\n1000\n\n2000\nΓ/κ\n\n3000\n\n4000\n\n(b)\n\nFIG. 3: (a) The photon detection scheme. (b) The dependence of detector efficiency(1−10−P ) on the ratio between the\nescape rate Γ and photon loss rate κ. The coupling strength\ngtd /2π = 100MHz, photon loss rate κ/2π = 10kHz, CBJJ\ndecay and dephasing rate γT /2π = 100kHz, γφ /2π = 1MHz.\n\nficiency of our photon detector, we model it as a 3state system shown in Fig. 3 (a), where |f i represents the voltage state. We use the Master equation\ndρ/dt = −i[H, ρ] + Lρ. Here, ρ is the density matrix\nof the system, the system Hamiltonian H = δâ† â +\ngtd (â† σge + âσeg ), the detuning δ = ω0 − μ, μ the frequency difference between |ei and |gi. The Liouvillian\nγ\nLρ = κ2 L[â]ρ+ Γ2 L[σef ]ρ+ γ2T L[σeg ]ρ+ 2φ Σi=g,e L[|iihi|]ρ,\nwhere L[Ô]ρ ≡ 2ÔρÔ† − Ô† Ôρ − ρÔ† Ô. κ is the decay rate of the photon in the TLR, γT and γφ are the\nintra-well decay rate and dephasing rate of the CBJJ,\nσij = |iihj| for i, j = g, e, f , and σz = |eihe| − |gihg|.\nAssuming initially there is a photon in the TLR and\nthe CBJJ is in |gi, we plot the detecting efficiency (the\nprobability the CBJJ ends up in |f i) in Fig. 3 (b) as\na function of Γ/κ. As can be seen, the efficiency is\nhigh even for moderately large escaping rate Γ. For\nΓ/2π = 20MHz [22] and κ/2π = 10kHz, the detection\nefficiency is above 99%. Also, it is demonstrated in our\nsimulation that the influence of γφ to the detection efficiency is minor and thus the detecting CBJJ does not\nneed to have long decoherence times.\nIn summary, we have shown that, by using TLR microwave photons as qubits and Josephson devices as optical devices, a superconducting chip provides an ideal implementation for fully integrated photonic qubit quantum\ncomputing. Thanks to our careful design, high gate fidelities can be achieved and thus our scheme is a realistic\napproach. Since our system is based on existing mature\ntechnologies, fast experimental progress can be expected\nto bring integrated photonic qubit quantum computing\nto reality. The novel idea of using on-chip microwave photons as qubits also opens the possibility of investigating\nmany interesting optical quantum effects in an integrated\nsystem.\nThis work was supported by NNSF of China\n(Grant Nos. 10875110, 60621064, 10874170) and National Fundamental Research Program of China (No.\n\n\f5\n2006CB921900).\n[9]\n[10]\n[11]\n∗\nElectronic address: xizhou@yahoo.com\n[1] A. Politi, M. J. Cryan, J. G. Rarity, S. Yu, and J.\nL.O'Brien, Science 320, 646 (2008).\n[2] R. G. Hunsperger, Integrated Optics, Springer, 2002.\n[3] F. Plastina and G. Falci, Phys. Rev. B 67, 224514 (2003).\n[4] X. Zhou et al., Phys. Rev. A 69, 030301(R) (2004).\n[5] A. Blais, R. S. Huang, A. Wallraff, S. M. Girvin, and R.\nJ. Schoelkopf, Phys. Rev. A. 69, 062320 (2004).\n[6] I. L. Chuang and Y. Yamamoto, Phys. Rev. A 52, 3489\n(1995).\n[7] M. A. Nielsen and I. L.Chuang, \"Quantum computation\nand quantum information,\" Cambridge University Press,\n2000.\n[8] Notice that even though we use the 2-state formalism for\nthe CBJJ for the convenience of keeping only the relevant terms in the system Hamiltonian, our scheme does\nnot rely on treating the CBJJ as a 2-state system. The\nCBJJ will only be virtually excited so potential prob-\n\n[12]\n[13]\n[14]\n[15]\n[16]\n[17]\n[18]\n[19]\n[20]\n[21]\n[22]\n\nlems with the 2-state approximation such as insufficient\nanharmonicity do not affect our results at all.\nY. Hu et al., Phys. Rev. A 75, 012314 (2007).\nA. Wallraf et al., Nature (London) 431, 162 (2004).\nM. A. Sillanpaa, J. I. Park, and R. W. Simmonds, Nature\n(London) 448, 438 (2007).\nP. K. Day et al., Nature (London) 425, 817 (2003).\nG. Ithier et al., Phys. Rev. B 72, 134519 (2005).\nJ. M. Martinis, Quantum Inf. Process. 8, 81(2009).\nX. Zhou and A. Mizel, Phys. Rev. Lett. 97, 267201\n(2006).\nS. H. W. van der Ploeg et al., Phys. Rev. Lett. 98, 057004\n(2007).\nB. T. H. Varcoe, S. Brattke, M. Weidinger and H.\nWalther, Nature (London) 403, 743 (2000).\nA. A. Houck et al., Nature (London) 449 328 (2007).\nM. Hofheinz et al., Nature (London) 454, 310 (2008).\nG. Romero, J. J. Garcia-Ripoll, and E. Solano, Phys.\nRev. Lett. 102, 173602 (2009).\nF. Helmer, M. Mariantoni, E. Solano, and F. Marquardt,\nPhys. Rev. A 79, 052115 (2009).\nK. B. Cooper et al., Phys. Rev. Lett. 93, 180401 (2004).\n\n\f"}