{"id": "http://arxiv.org/abs/0904.2963v2", "guidislink": true, "updated": "2009-04-20T22:15:32Z", "updated_parsed": [2009, 4, 20, 22, 15, 32, 0, 110, 0], "published": "2009-04-20T08:18:40Z", "published_parsed": [2009, 4, 20, 8, 18, 40, 0, 110, 0], "title": "How to suppress the shot noise in galaxy surveys", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0904.2271%2C0904.1790%2C0904.3250%2C0904.1203%2C0904.0126%2C0904.4358%2C0904.4369%2C0904.4653%2C0904.2378%2C0904.1825%2C0904.3448%2C0904.2339%2C0904.4542%2C0904.2816%2C0904.0036%2C0904.4871%2C0904.2408%2C0904.1461%2C0904.1230%2C0904.1199%2C0904.4380%2C0904.4786%2C0904.4260%2C0904.1434%2C0904.0473%2C0904.4002%2C0904.3850%2C0904.3804%2C0904.1462%2C0904.1324%2C0904.4365%2C0904.4373%2C0904.1478%2C0904.4793%2C0904.2828%2C0904.1959%2C0904.2235%2C0904.0271%2C0904.4385%2C0904.4823%2C0904.1303%2C0904.4156%2C0904.4418%2C0904.2295%2C0904.4092%2C0904.1812%2C0904.2963%2C0904.1569%2C0904.4023%2C0904.4063%2C0904.2120%2C0904.3655%2C0904.1192%2C0904.1241%2C0904.4479%2C0904.3570%2C0904.2756%2C0904.2960%2C0904.2912%2C0904.1038%2C0904.1418%2C0904.0349%2C0904.2672%2C0904.0851%2C0904.2323%2C0904.3668%2C0904.1066%2C0904.3486%2C0904.2016%2C0904.0006%2C0904.2049%2C0904.2403%2C0904.3650%2C0904.2371%2C0904.0918%2C0904.0355%2C0904.1708%2C0904.3027%2C0904.0716%2C0904.2831%2C0904.1998%2C0904.0377%2C0904.2064%2C0904.1278%2C0904.2139%2C0904.2895%2C0904.1491%2C0904.2189%2C0904.4039%2C0904.4101%2C0904.1796%2C0904.4579%2C0904.4773%2C0904.0773%2C0904.3478%2C0904.4490%2C0904.0604%2C0904.0680%2C0904.1935%2C0904.3828%2C0904.0683&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "How to suppress the shot noise in galaxy surveys"}, "summary": "Galaxy surveys are one of the most powerful means to extract the cosmological\ninformation and for a given volume the attainable precision is determined by\nthe galaxy shot noise sigma_n^2 relative to the power spectrum P. It is\ngenerally assumed that shot noise is white and given by the inverse of the\nnumber density n. In this paper we argue one may be able to considerably\nimprove upon this: in the halo picture of cosmological structure all of the\ndark matter is in halos of varying mass and galaxies are formed inside these\nhalos, but for the dark matter mass and momentum conservation guarantee that\nnonlinear effects cannot develop a white noise in the dark matter power\nspectrum on large scales. This suggests that with a suitable weighting a\nsimilar effect may be achieved for galaxies, suppressing their shot noise. We\nexplore this idea with N-body simulations by weighting central halo galaxies by\nhalo mass and find that the resulting shot noise can be reduced dramatically\nrelative to expectations, with a 10-30 suppression at the highest number\ndensity of n=4*10^-3 (Mpc/h)^3 resolved in our simulations. For specific\napplications other weighting schemes may achieve even better results and for\nn=3*10^-4(Mpc/h)^3 we can reduce sigma_n^2/P by up to a factor of 10 relative\nto uniform weighting. These results open up new opportunities to extract\ncosmological information in galaxy surveys, such as the recently proposed\nmulti-tracer approach to cancel sampling variance, and may have important\nconsequences for the planning of future redshift surveys. Taking full advantage\nof these findings may require better understanding of galaxy formation process\nto develop accurate tracers of the halo mass.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0904.2271%2C0904.1790%2C0904.3250%2C0904.1203%2C0904.0126%2C0904.4358%2C0904.4369%2C0904.4653%2C0904.2378%2C0904.1825%2C0904.3448%2C0904.2339%2C0904.4542%2C0904.2816%2C0904.0036%2C0904.4871%2C0904.2408%2C0904.1461%2C0904.1230%2C0904.1199%2C0904.4380%2C0904.4786%2C0904.4260%2C0904.1434%2C0904.0473%2C0904.4002%2C0904.3850%2C0904.3804%2C0904.1462%2C0904.1324%2C0904.4365%2C0904.4373%2C0904.1478%2C0904.4793%2C0904.2828%2C0904.1959%2C0904.2235%2C0904.0271%2C0904.4385%2C0904.4823%2C0904.1303%2C0904.4156%2C0904.4418%2C0904.2295%2C0904.4092%2C0904.1812%2C0904.2963%2C0904.1569%2C0904.4023%2C0904.4063%2C0904.2120%2C0904.3655%2C0904.1192%2C0904.1241%2C0904.4479%2C0904.3570%2C0904.2756%2C0904.2960%2C0904.2912%2C0904.1038%2C0904.1418%2C0904.0349%2C0904.2672%2C0904.0851%2C0904.2323%2C0904.3668%2C0904.1066%2C0904.3486%2C0904.2016%2C0904.0006%2C0904.2049%2C0904.2403%2C0904.3650%2C0904.2371%2C0904.0918%2C0904.0355%2C0904.1708%2C0904.3027%2C0904.0716%2C0904.2831%2C0904.1998%2C0904.0377%2C0904.2064%2C0904.1278%2C0904.2139%2C0904.2895%2C0904.1491%2C0904.2189%2C0904.4039%2C0904.4101%2C0904.1796%2C0904.4579%2C0904.4773%2C0904.0773%2C0904.3478%2C0904.4490%2C0904.0604%2C0904.0680%2C0904.1935%2C0904.3828%2C0904.0683&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Galaxy surveys are one of the most powerful means to extract the cosmological\ninformation and for a given volume the attainable precision is determined by\nthe galaxy shot noise sigma_n^2 relative to the power spectrum P. It is\ngenerally assumed that shot noise is white and given by the inverse of the\nnumber density n. In this paper we argue one may be able to considerably\nimprove upon this: in the halo picture of cosmological structure all of the\ndark matter is in halos of varying mass and galaxies are formed inside these\nhalos, but for the dark matter mass and momentum conservation guarantee that\nnonlinear effects cannot develop a white noise in the dark matter power\nspectrum on large scales. This suggests that with a suitable weighting a\nsimilar effect may be achieved for galaxies, suppressing their shot noise. We\nexplore this idea with N-body simulations by weighting central halo galaxies by\nhalo mass and find that the resulting shot noise can be reduced dramatically\nrelative to expectations, with a 10-30 suppression at the highest number\ndensity of n=4*10^-3 (Mpc/h)^3 resolved in our simulations. For specific\napplications other weighting schemes may achieve even better results and for\nn=3*10^-4(Mpc/h)^3 we can reduce sigma_n^2/P by up to a factor of 10 relative\nto uniform weighting. These results open up new opportunities to extract\ncosmological information in galaxy surveys, such as the recently proposed\nmulti-tracer approach to cancel sampling variance, and may have important\nconsequences for the planning of future redshift surveys. Taking full advantage\nof these findings may require better understanding of galaxy formation process\nto develop accurate tracers of the halo mass."}, "authors": ["U. Seljak", "N. Hamaus", "V. Desjacques"], "author_detail": {"name": "V. Desjacques"}, "author": "V. Desjacques", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevLett.103.091303", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0904.2963v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0904.2963v2", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "4 pages, 3 figures", "arxiv_primary_category": {"term": "astro-ph.CO", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph.CO", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0904.2963v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0904.2963v2", "journal_reference": "Phys.Rev.Lett.103:091303,2009", "doi": "10.1103/PhysRevLett.103.091303", "fulltext": "How to suppress the shot noise in galaxy surveys\n\narXiv:0904.2963v2 [astro-ph.CO] 20 Apr 2009\n\nUroš Seljak\n\n1,2,3\n\n, Nico Hamaus 1 , Vincent Desjacques1\n\n1\nInstitute for Theoretical Physics, University of Zurich, Zurich,\nSwitzerland 2 Physics Department and Lawrence Berkeley National Laboratory,\nUniversity of California, Berkeley, California 94720,\nUSA; 3 Ewha University, Seoul 120-750, S. Korea;\n(Dated: April 20, 2009)\n\nGalaxy surveys are one of the most powerful means to extract the cosmological information and\nfor a given volume the attainable precision is determined by the galaxy shot noise σn2 relative to the\npower spectrum P . It is generally assumed that shot noise is white and given by the inverse of the\nnumber density n̄. In this paper we argue one may be able to considerably improve upon this: in the\nhalo picture of cosmological structure all of the dark matter is in halos of varying mass and galaxies\nare formed inside these halos, but for the dark matter mass and momentum conservation guarantee\nthat nonlinear effects cannot develop a white noise in the dark matter power spectrum on large\nscales. This suggests that with a suitable weighting a similar effect may be achieved for galaxies,\nsuppressing their shot noise. We explore this idea with N-body simulations by weighting central halo\ngalaxies by halo mass and find that the resulting shot noise can be reduced dramatically relative\nto expectations, with a 10-30 suppression at the highest number density of n̄ = 4 × 10−3 (Mpc/h)3\nresolved in our simulations. For specific applications other weighting schemes may achieve even\nbetter results and for n̄ = 3 × 10−4 (Mpc/h)3 we can reduce σn2 /P by up to a factor of 10 relative to\nuniform weighting. These results open up new opportunities to extract cosmological information in\ngalaxy surveys, such as the recently proposed multi-tracer approach to cancel sampling variance, and\nmay have important consequences for the planning of future redshift surveys. Taking full advantage\nof these findings may require better understanding of galaxy formation process to develop accurate\ntracers of the halo mass.\nPACS numbers: 98.80\n\nGalaxy clustering has been one of the leading methods to measure the clustering of dark matter in the past\nand with upcoming redshift surveys such as SDSS-III and\nJDEM/EUCLID this will continue to be the case in the\nfuture. Galaxies are easily observed and by measuring\ntheir redshift one can determine their three-dimensional\ndistribution. This is currently the only large scale structure method that provides 3-dimensional information.\nOn large scales galaxies trace the dark matter up to a\nconstant of proportionality called bias b, so the galaxy\npower spectrum can be directly related to the dark matter power spectrum shape, which contains a wealth of\ninformation such as the scale dependence of primordial\nfluctuations, signatures of massive neutrinos and matter density etc. In recent years the baryonic acoustic\noscillations (BAO) feature in the power spectrum has\nbeen emphasized, which can be used as a standard ruler\nand in combination with cosmic microwave background\nanisotropies can provide a redshift distance test [1].\nFor the power spectrum measurement there are two\nsources of error: one is the sampling (sometimes called\ncosmic) variance, the fact that each mode is a gaussian\nrandom realization and all the cosmological information\nlies in its variance, which cannot be well determined on\nthe largest scales because the number of modes is finite.\nSecond source of noise is the shot noise due to the discrete sampling of galaxies, σn2 , which under the standard\nassumptions of Poisson sampling equals the inverse of the\nnumber density n̄. The total error on the power spectrum\nP is σP /P = (2/N )1/2 (1+σn2 /P ), where N is the number\n\nof modes measured and scales linearly with the volume of\nthe survey. While the above expression suggests there is\nnot much benefit in reducing the shot noise to σn2 /P ≪ 1\nsince sampling variance error remains, recent work suggests there are potential gains in that limit, since we may\nbe able to reduce the damping of the BAO better [2].\nRecently a new multi-tracer method has been developed where by comparing two differently biased tracers of\nthe same structure one can extract cosmological information in a way that the sampling variance error cancels out\n[3]. There are several applications of this method, such\nas measuring the primordial non-gaussianity [3], redshift\nspace distortion parameter β [4] or relation between the\nHubble parameter and the angular diameter distance [4].\nIn all these applications one can achieve significant gains\nin the error of the extracted cosmological parameters if\nσn2 /P ≪ 1. Thus in all of these applications the galaxy\nshot noise relative to the power spectrum is the key quantity that controls the ultimate level of cosmological precision one can achieve with galaxy surveys.\nThe relation between the galaxy and the dark matter clustering can be understood with the halo model\n[5, 6, 7], where all of the dark matter is divided into\ncollapsed halos of varying mass. There are two contributions to the dark matter clustering: first is the correlation\nbetween two separate halos, which is assumed to be proportional to the linear theory spectrum times the product\nof the two halo biases, while the second contribution is\nthe one halo term which includes the clustering contributions from the individual halo itself. One obtains the\n\n\f2\ndark matter power spectrum prediction by adding up the\ncontributions from all the halos. Since galaxies are assumed to form inside the halos one can write analogous\nexpressions for galaxy clustering power spectrum once\none specifies the occupation distribution of galaxies as a\nfunction of halo mass.\nOne consequence of the halo model is that the one halo\nterm is dominated by the most massive halos and reduces\nto white noise k 0 for very small wavemode amplitude\nk ≪ R−1 , where R is the size of the largest halos. For\ngalaxies this is believed to be a valid description of the\nshot noise amplitude in the low k limit. It distinguishes\nbetween the galaxy and the halo number density, but for\na typical survey the fraction of halos with more than one\ngalaxy in it is small, 5-30% [8], and here we will ignore\nthis distinction and assume for simplicity there is only\none galaxy in each halo at its center.\nFor the dark matter, the nonlinear evolution of structure requires local mass and momentum conservation and\nas a result the low k limit of nonlinear contribution is predicted to scale as k 4 and not k 0 [9]. This is indeed seen\nin simulations [10], making this prediction of the halo\nmodel invalid. While this is often seen as a deficiency of\nthe halo model, here we take it as an opportunity: if the\ndark matter has no white noise tail in the k → 0 limit\nthen in the context of the halo model where all the dark\nmatter is in the halos and the halo size becomes irrelevant in k ≪ R−1 limit it should be possible to achieve\nthe same effect with galaxies, if one can enforce the local mass and momentum conservation. The most natural\npossibility is to weight the galaxies by the halo mass.\nThe purpose of this letter is to explore this idea with\nnumerical simulations. We employ a suite of large Nbody simulations using Gadget II code, which include\nfour 10243 particles in a (1.6h−1 Gpc)3 box and one simulation with 15363 particles in a (1.3h−1 Gpc)3 box. The\nfiducial cosmological model has a scale invariant spectrum with amplitude σ8 = 0.81, matter density Ωm =\n0.28 and Hubble parameter H0 = 70km/s/Mpc. We\nran Friends of Friends halo finder and kept all the halos\nwith more than 20 particles, with the lowest halo mass\nof 6 × 1012 h−1 M⊙ and 1012 h−1 M⊙ , respectively.\nIf a tracer has an overdensity δh with a bias bh , then\nthe relation to the dark matter overdensity δm in Fourier\nspace can be written as δh = bh δm + n, where n is shot\nnoise with a power spectrum n2 = σn2 and we assume\nit is uncorrelated with the signal, ie hδm ni = 0 (the operations should be taken separately on real and imaginary components of the Fourier modes). Thus we define\nσn2 = (δh − bh δm )2 and bias is bh = (Phh /Pmm )1/2 =\nPhm /Pmm , where Phh = δh2 − σn2 , Phm = hδm δh i\n2\n. This is equivalent to choosing σn2\nand Pmm = δm\nsuch that the cross correlation coefficient is unity, r ≡\nPhm /(Phh Pmm )1/2 = 1. Thus our definition of the shot\nnoise includes all sources of stochasticity between the\nhalos and the dark matter, so it is the most conservative. This can be done as a function of k and so allows for a possibility that noise is not white. We do\n\nnot assume a constant bias, although we find that for\nk ≪ 0.1h/Mpc this is generally true. Another way to\ndefine the shot noise is through the power spectrum fluc2\ntuations, (δh2 − Phh − σn2 )2 = (2/N )(Phh\n+ (σn2 )2 ). We\nfind this definition in general has larger variance, but is\non average in agreement with the definition above, which\nwe will use in the following.\nWe begin by first investigating the shot noise when\neach halo has equal weight. The simplest case is that\nof a bin in halo mass, for which we remove the top\n10% of the most massive halos in a simulation and take\nthe remaining ones to match a given abundance. As\nshown in figure 1 the prediction σn2 = n̄−1 is satisified\nfor n̄ = 10−4 (h/Mpc)3 , but is lower than simulations at\nhigher abundances, by a factor of 3 for our highest number density of n̄ = 4 × 10−3(h/Mpc)3 . Second possibility\nis that of a mass threshold, where all of the halos above\ncertain minimum cutoff are populated. This gives a bit\nlower shot noise than mass bins for the same abundance.\nOverall, we find that weighting the galaxies uniformly\nleads to a shot noise power that can be larger than the\nusually assumed n̄−1 , so the standard error analysis may\nbe overly optimistic and shot noise should be a free parameter determined from the data itself.\nNext we investigate the shot noise for non-uniform\nhalo dependent weighting wi for the same mass threshold sample. P\nWe compare\nP the simulations to the expectation σe2 = V i wi2 /( i wi )2 , where V is the volume and\nthe sum is over all the halos. At a given number density this expression is minimized for uniform weighting\n(where it equals n̄−1 ), so non-uniform weighting generally increases the expected shot noise. As argued above\nwi = Mi , where Mi is the halo mass, is the natural implementation of the idea to enforce mass and momentum\nconservation for the halos. The results are shown in figure 1. We see that the predicted and measured shot noise\namplitudes differ significantly and the difference reaches\na factor of 10-30 at the highest abundance in our simulations, n̄ = 4 × 10−3 (h/Mpc)3 . This demonstrates that\nthis is not a simple Poisson sampling of the field and that\nmass and momentum conservation work to suppress the\nshot noise relative to expectations.\nOther weightings may also improve the results relative to naive expectations and may work even better\nfor specific applications. For example, weighting by\nf (M ) = M/(1 + (M/1014 h−1 M⊙ )0.5 ), shown in figure\n1, improves upon the mass weighting. This weighting\nequals the halo mass weighting over the mass range of\nM < 1014 h−1 M⊙ , while giving a lower weight to the\nhigher mass halos relative to the mass weighting. Weighting by the halo mass gives a very large weight to the most\nmassive halos and this non-uniform weighting leads to a\nsignificant increase in the naive shot noise prediction σe2\nrelative to the number density of halos. Therefore, if\nthe conservation of mass and momentum is not perfect\nfor the most massive halos the residual shot noise may\nstill be large, which may explain why downweighting high\nmass halos may work better. On the other hand, simply\n\n\f3\n100\n\n104\nσn2\n\nσn 2 / P\n\n10-1\n\n10\n\n3\n\n10-2\n\nuniform (bin)\nuniform (threshold)\nmass\nf(mass)\nn = 1×10-4 (h/Mpc)3\n\n-4\n\n3\n\n-4\n\nn = 3×10 (h/Mpc)\n\n10-3\n\nn = 1×10 (h/Mpc)\n\n3\n\nbub = 1.48\nbut = 2.00\nbM = 2.61\nbf(M)= 2.37\n\n-4\n\n3\n\nn = 3×10 (h/Mpc)\n\nbub = 1.31\nbut = 1.55\nbM = 2.22\nbf(M)= 1.96\n\nn = 4×10-3 (h/Mpc)3\n-1\n\n10\n\nσn2\n\nσn 2 / P\n\n103\n\n10-2\n\n-4\n\n3\n\n-3\n\nn = 7×10 (h/Mpc)\n0.01\n\n0.10\nk [h/Mpc]\n\n3\n\n-4\n\nn = 4×10 (h/Mpc)\n0.01\n\n10-3 n = 7×10 (h/Mpc)\n\n0.10\n\n0.01\n\nk [h/Mpc]\n\nFIG. 1: Shot noise power spectrum σn2 measured in simulations for uniform weighting of halos in a mass bin and\nmass threshold, mass weighting and f (M ) = M/(1 +\n(M/1014 h−1 M⊙ )0.5 weighting, for several different abundances, corresponding at z = 0 to mass thresholds of\n4 × 1013 h−1 M⊙ , 1.4 × 1013 h−1 M⊙ /h, 6 × 1012 h−1 M⊙ and\n1012 h−1 M⊙ /h, from the lowest to the highest abundance, respectively. Straight lines (same color/line style) are the expected shot noise σe2 for each of the weightings (equal for the\nmass bin and mass threshold with uniform weighting).\n\nbub = 0.97\nbut = 1.02\nbM = 1.76\nbf(M)= 1.50\n\nbub = 1.22\nbut = 1.31\nbM = 2.02\nbf(M)= 1.75\n0.10\n\n0.01\n\n0.10\nk [h/Mpc]\n\nk [h/Mpc]\n\nFIG. 2: Same as figure 1, but for σn2 /P . Also shown are the\nbias values for the different cases.\n\n104\n\n103\n\n102\n\nσM = 0\nσM = 0.1\nσM = 0.5\nσM = 1.0\n\nM weighting\nn = 3×10-4 (h/Mpc)3\n\nf(M) weighting\nn = 3×10-4 (h/Mpc)3\n\nM weighting\nn = 4×10-3 (h/Mpc)3\n\nf(M) weighting\nn = 4×10-3 (h/Mpc)3\n\n103\nσn2\n\neliminating the halos above 1014 h−1 M⊙ while preserving\nmass weighting below that mass completely erased any\nadvantages. We also tried weighting by the halo bias b,\nwhich was argued to minimize σ 2 /P [12], and found no\nimprovements relative to uniform weighting, as expected\nsince it is close to uniform weighting for most of the halos\nand therefore does not implement the mass and momentum conservation efficiently. It is possible that one may\nbe able to further improve the signal to noise by optimizing the weights, but the optimization will depend on the\nspecific application one has in mind (e.g. non-gaussianity,\nredshift space distortions, BAO etc.) and is beyond the\nscope of this paper.\nFor actual applications we want to minimize σn2 /P .\nFigure 2 shows the results for the same cases as in figure\n1. We see there are significant improvements in σn2 /P relative to the uniform weighting and that mass and modified mass give comparable results, with improvements\nin excess of 10 possible relative to the uniform weighting. While these results are all at z = 0 where we have\nthe highest density of halos, we also computed them at\nhigher redshifts. At z = 0.5 and n̄ = 3 × 10−4 (h/Mpc)3 ,\ntarget density for SDSS-III, we find a factor of 3-10 improvement at BAO scale in mass weighting relative to\nthe uniform, comparable to z = 0 case at the same number density. This means that the achievable error on\ncosmological parameters from BAO can be improved significantly for the same number of objects measured. Alternatively, a significantly lower number of objects may\nbe needed to achieve the same precision and one can re-\n\n3\n\nσn2\n\n102\n\n102\n\n101\n0.01\n\n0.10\nk [h/Mpc]\n\n0.01\n\n0.10\nk [h/Mpc]\n\nFIG. 3: Effects of log-normal scatter σ in halo mass observable on the shot noise σn2 for mass and f (M ) = M/(1 +\n(M/1014 h−1 M⊙ )0.5 ) weights, for n̄ = 3 × 10−4 (h/Mpc)3 and\nn̄ = 4 × 10−3 (h/Mpc)3 . Scatter hardly affects the bias, so the\nrelative effects of scatter are the same for σn2 /P and we do\nnot show them here.\n\nduce the target number density by nearly a factor of 3.\nNote that SDSS-III plan is to oversample the galaxies at\nthe BAO scale to use reconstruction to reduce the damping of BAO, which can be done better if the shot noise is\nlower. It is also possible that imposing the local mass and\nmomentum conservation will minimize systematic shifts\nin the BAO position relative to the dark matter that may\notherwise be problematic [13], but we leave this investigation for the future.\nSo far we ignored the real world complications such as\nthe imprecise knowledge of the halo mass. To investigate\nthis we add a log-normal scatter with rms variance σ to\neach halo mass and recompute the analysis. Fig 3 shows\nthe results for mass and modified mass f (M ) weighting:\nfor the latter we see that scatter of 50% in mass increases\n\n\f4\nσn2 /P by about 50% for lower abundance and a factor of\n2 for higher abundance. Since this is a realistic scatter\nfor optically selected clusters [14] there is thus realistic\npossibility that we can apply such analysis to the real\ndata and achieve these gains. In practical applications\none would try to identify the best halo mass tracer as\na function of halo mass, for example central galaxy luminosity in the galactic halos and richness or total luminosity for the cluster halos. In order to minimize the\nscatter one must understand the relation between the\ngalaxy observables and the underlying halos, so progress\nin galaxy formation studies will be needed to maximize\nthe gains. We find that for the mass weighting scatter\nhas a larger effect, such that for σ = 0.5 the degradation\nin σn2 /P is a factor of 2-3. Once the scatter becomes too\nlarge there is no longer any local mass and momentum\nconservation and we find that for σ = 1 the shot noise\nis worse than for uniform weighting. Another potential\ncomplication is the effect of redshift space distortions,\nsince the observed radial distance is a sum of the true radial distance and peculiar velocity (divided by the Hubble\nparameter). We find a modest (50%) increase in σn2 /P ,\nwhere P in redshift space is the spherically averaged (i.e.\nmonopole) power spectrum. Since redshift space contains much more information than just the monopole it\nis possible that one may be able to use the additional\ninformation to reduce this degradation and we leave this\nfor a future investigation.\nThese results are particularly relevant for the multitracer methods where the data are analyzed in terms of\nratios of different tracers and for which the sampling variance error cancels, such as those recently proposed for\nnon-gaussianity [3], redshift space distortions and Hubble versus angular distance relation [4]. For these there\nis no lower limit on the achievable error decreases as long\nas σn2 /P decreases and the method proposed here could\n\nlead to a significant reduction of errors relative to previous expectations. We see from figure 2 that for mass\nweighting at 4 × 10−3 (h/Mpc)3 σn2 /P ∼ 10−3 on large\nscales, so this could give a signal to noise of 30 for a single mode, compared to 0.7 for the single tracer method,\nequivalent to 3 orders of magnitude reduction in volume\nneeded to reach the same precision. Note that this is\nnot unreachable, since the existing SDSS survey achieves\nn̄ ∼ 10−2 (h/Mpc)3 for the redshift survey of the main\nsample.\nEqually impressive improvements may be possible for\nfuture redshift surveys such as JDEM/EUCLID or BigBOSS, which are expected to operate at redshifts up to\nz ∼ 2. Their target number density could be as high\nas n̄ ∼ 10−3 (h/Mpc)3 or higher, and the method proposed here could lead to a dramatic reduction of errors or,\nequivalently, to a several-fold reduction in the number of\nmeasured redshifts required to reach the target precision,\nwith potentially important implications for the design of\nthese missions. The weights can be further optimized for\nspecific applications, specially for the multi-tracer methods that cancel out the sampling variance error. This\napproach holds the promise to become the most accurate\nmethod to extract both the primordial non-gaussianity\nand the dark energy equation of state and its full promise\nshould be explored further with more realistic simulations. In parallel we should develop better our understanding of galaxy formation to relate the galaxy observables to the underlying halo mass with as little scatter as\npossible.\nWe thank V. Springel for making the Gadget-2 code\navailable to us and P. McDonald, D. Eisenstein and R.\nSmith for useful comments. This work is supported by\nthe Packard Foundation, the Swiss National Foundation\nunder contract 200021-116696/1 and WCU grant R322008-000-10130-0.\n\n[1] D. J. Eisenstein, I. Zehavi, D. W. Hogg, R. Scoccimarro,\nM. R. Blanton, R. C. Nichol, R. Scranton, H.-J. Seo,\nM. Tegmark, Z. Zheng, et al., Astrophys. J. 633, 560\n(2005).\n[2] D. J. Eisenstein, H.-J. Seo, E. Sirko, and D. N. Spergel,\nAstrophys. J. 664, 675 (2007), arXiv:astro-ph/0604362.\n[3] U. Seljak, Physical Review Letters 102, 021302 (2009),\n0807.1770.\n[4] P. McDonald and U. Seljak, ArXiv e-prints (2008),\n0810.0323.\n[5] J. A. Peacock and R. E. Smith, Mon. Not. R. Astron. Soc.\n318, 1144 (2000).\n[6] U. Seljak, Mon. Not. R. Astron. Soc. 318, 203 (2000).\n[7] R. Scoccimarro, R. K. Sheth, L. Hui, and B. Jain, Astrophys. J. 546, 20 (2001).\n[8] R. Mandelbaum, U. Seljak, G. Kauffmann, C. M. Hirata,\nand J. Brinkmann, Mon. Not. R. Astron. Soc. 368, 715\n(2006), astro-ph/0511164.\n\n[9] P. J. E. Peebles, The large-scale structure of the universe (Research supported by the National Science Foundation. Princeton, N.J., Princeton University Press,\n1980. 435 p., 1980).\n[10] M. Crocce and R. Scoccimarro, Phys. Rev. D 77, 023533\n(2008), 0704.2783.\n[11] N. Dalal, O. Doré, D. Huterer, and A. Shirokov, Phys.\nRev. D 77, 123514 (2008), arXiv:0710.4560.\n[12] W. J. Percival, L. Verde, and J. A. Peacock,\nMon. Not. R. Astron. Soc. 347, 645 (2004), arXiv:astroph/0306511.\n[13] R. E. Smith, R. Scoccimarro, and R. K. Sheth, Phys.\nRev. D 77, 043525 (2008), arXiv:astro-ph/0703620.\n[14] E. Rozo, E. S. Rykoff, A. Evrard, M. Becker, T. McKay,\nR. H. Wechsler, B. P. Koester, J. Hao, S. Hansen, E. Sheldon, et al., ArXiv e-prints (2008), 0809.2794.\n\n\f"}