{"id": "http://arxiv.org/abs/0909.0850v1", "guidislink": true, "updated": "2009-09-04T10:50:15Z", "updated_parsed": [2009, 9, 4, 10, 50, 15, 4, 247, 0], "published": "2009-09-04T10:50:15Z", "published_parsed": [2009, 9, 4, 10, 50, 15, 4, 247, 0], "title": "Dielectric Anomalies in a New Manganocuprate, Gd3Ba2Mn2Cu2O12", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0909.5094%2C0909.4135%2C0909.1577%2C0909.2265%2C0909.2361%2C0909.3881%2C0909.0359%2C0909.3944%2C0909.0993%2C0909.4295%2C0909.4832%2C0909.1738%2C0909.1152%2C0909.3474%2C0909.0488%2C0909.5471%2C0909.4807%2C0909.0538%2C0909.4629%2C0909.0460%2C0909.3433%2C0909.3945%2C0909.0848%2C0909.5421%2C0909.4623%2C0909.1453%2C0909.1116%2C0909.2185%2C0909.1163%2C0909.1546%2C0909.0302%2C0909.0384%2C0909.5298%2C0909.1287%2C0909.2246%2C0909.5233%2C0909.5654%2C0909.2311%2C0909.3320%2C0909.4142%2C0909.5353%2C0909.5594%2C0909.1011%2C0909.1136%2C0909.4488%2C0909.5103%2C0909.0928%2C0909.4230%2C0909.2821%2C0909.1565%2C0909.5454%2C0909.4967%2C0909.4518%2C0909.2512%2C0909.0657%2C0909.3833%2C0909.0631%2C0909.2033%2C0909.0850%2C0909.5270%2C0909.3540%2C0909.3278%2C0909.3684%2C0909.5102%2C0909.0855%2C0909.4717%2C0909.0739%2C0909.2857%2C0909.0738%2C0909.1897%2C0909.3520%2C0909.1234%2C0909.0101%2C0909.5046%2C0909.0685%2C0909.0081%2C0909.5586%2C0909.5025%2C0909.3015%2C0909.4822%2C0909.1758%2C0909.0818%2C0909.4045%2C0909.2457%2C0909.2367%2C0909.0522%2C0909.4728%2C0909.3415%2C0909.2147%2C0909.1693%2C0909.5151%2C0909.1835%2C0909.1457%2C0909.3375%2C0909.5269%2C0909.3255%2C0909.3595%2C0909.4508%2C0909.0851%2C0909.3536%2C0909.4902&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Dielectric Anomalies in a New Manganocuprate, Gd3Ba2Mn2Cu2O12"}, "summary": "Dielectric response has been studied for a new manganocuprate,\nGd3Ba2Mn2Cu2O12 (Gd3222) as a function of temperature (100 - 300 K) and\nfrequency (75 kHz to 1 MHz). The dielectric constant (e) exhibits a two step\nincrease (two peaks) in e(T) with increasing temperature from 100 to 300 K. The\nfirst peak is seen around 150 K and the second one around 210 K (both for 75\nkHz). Increasing frequency shifts both the peaks to higher temperature side.\nThe behavior of dielectric constant (e) and dielectric loss (tan_delta) matches\nwith glassy behavior observed in many dipolar molecules.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0909.5094%2C0909.4135%2C0909.1577%2C0909.2265%2C0909.2361%2C0909.3881%2C0909.0359%2C0909.3944%2C0909.0993%2C0909.4295%2C0909.4832%2C0909.1738%2C0909.1152%2C0909.3474%2C0909.0488%2C0909.5471%2C0909.4807%2C0909.0538%2C0909.4629%2C0909.0460%2C0909.3433%2C0909.3945%2C0909.0848%2C0909.5421%2C0909.4623%2C0909.1453%2C0909.1116%2C0909.2185%2C0909.1163%2C0909.1546%2C0909.0302%2C0909.0384%2C0909.5298%2C0909.1287%2C0909.2246%2C0909.5233%2C0909.5654%2C0909.2311%2C0909.3320%2C0909.4142%2C0909.5353%2C0909.5594%2C0909.1011%2C0909.1136%2C0909.4488%2C0909.5103%2C0909.0928%2C0909.4230%2C0909.2821%2C0909.1565%2C0909.5454%2C0909.4967%2C0909.4518%2C0909.2512%2C0909.0657%2C0909.3833%2C0909.0631%2C0909.2033%2C0909.0850%2C0909.5270%2C0909.3540%2C0909.3278%2C0909.3684%2C0909.5102%2C0909.0855%2C0909.4717%2C0909.0739%2C0909.2857%2C0909.0738%2C0909.1897%2C0909.3520%2C0909.1234%2C0909.0101%2C0909.5046%2C0909.0685%2C0909.0081%2C0909.5586%2C0909.5025%2C0909.3015%2C0909.4822%2C0909.1758%2C0909.0818%2C0909.4045%2C0909.2457%2C0909.2367%2C0909.0522%2C0909.4728%2C0909.3415%2C0909.2147%2C0909.1693%2C0909.5151%2C0909.1835%2C0909.1457%2C0909.3375%2C0909.5269%2C0909.3255%2C0909.3595%2C0909.4508%2C0909.0851%2C0909.3536%2C0909.4902&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Dielectric response has been studied for a new manganocuprate,\nGd3Ba2Mn2Cu2O12 (Gd3222) as a function of temperature (100 - 300 K) and\nfrequency (75 kHz to 1 MHz). The dielectric constant (e) exhibits a two step\nincrease (two peaks) in e(T) with increasing temperature from 100 to 300 K. The\nfirst peak is seen around 150 K and the second one around 210 K (both for 75\nkHz). Increasing frequency shifts both the peaks to higher temperature side.\nThe behavior of dielectric constant (e) and dielectric loss (tan_delta) matches\nwith glassy behavior observed in many dipolar molecules."}, "authors": ["Sudhindra Rayaprol", "Anjana Dogra", "S. D. Kaushik", "Kiran Singh", "S. Bhattacharya", "G. Anjum", "Y. Kumar", "N. K. Gaur", "Ravi Kumar"], "author_detail": {"name": "Ravi Kumar"}, "author": "Ravi Kumar", "arxiv_comment": "1 PDF file, Submitted", "links": [{"href": "http://arxiv.org/abs/0909.0850v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0909.0850v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "cond-mat.mtrl-sci", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.mtrl-sci", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "cond-mat.other", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0909.0850v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0909.0850v1", "journal_reference": null, "doi": null, "fulltext": "Dielectric Anomalies in a New Manganocuprate,\nGd3Ba2Mn2Cu2O12\nSudhindra Rayaprol1,*, Anjana Dogra2, S. D. Kaushik1, Kiran Singh3, S. Bhattacharya4,\nG. Anjum5, Y. Kumar6, N. K. Gaur3, and Ravi Kumar6\n1\n\nUGC-DAE Consortium for Scientific Research, Mumbai – 400085\n2\n\n3\n4\n\nNational Physical Laboratory, New Delhi – 110012\n\nDepartment of Physics, Barkatullah University, Bhopal – 462026\n\nTPPED, Bhabha Atomic Research Centre, Trombay, Mumbai – 400085\n5\n\nDepartment of Physics, Aligarh Muslim University, Aligarh\n6\n\nInter University Accelerator Centre, New Delhi – 110067\n\n* Corresponding Author\nDr. Sudhindra Rayaprol\nUGC-DAE Consortium for Scientific Research, Mumbai Centre\nR-5 Shed, BARC Campus, Trombay\nMumbai – 400085\nINDIA\nTel. # +91-22-25594727\nFax # +91-22-25505402\nEmail:\n\nsudhindra@csr.ernet.in / rayaprol@gmail.com\n\n1\n\n\fAbstract\nDielectric response has been studied for a new manganocuprate, Gd3Ba2Mn2Cu2O12\n(Gd3222) as a function of temperature (100 – 300 K) and frequency (75 kHz to 1 MHz).\nThe dielectric constant (ε) exhibits a two step increase (two peaks) in ε(T) with increasing\ntemperature from 100 to 300 K. The first peak is seen around 150 K and the second one\naround 210 K (both for 75 kHz). Increasing frequency shifts both the peaks to higher\ntemperature side. The behavior of dielectric constant (ε) and dielectric loss (tanδ)\nmatches with glassy behavior observed in many dipolar molecules. 3D Variable range\nhopping type conduction was observed from the analysis of the resistivity data. The\nresults obtained are discussed in light of similar dielectric behavior observed in chargeordered manganites.\nKeywords: Manganocuprates, Dielectric constant, 3D-VRH\nPACS: 77.22.Gm, 75.47.Lx\n1.\n\nIntroduction\nThe research on cuprate and manganite compounds has been on centre stage for\n\nlast few decades. The novel physical properties of layered perovskite cuprate and\nmanganite compounds have led to volumes of work on basic sciences as well as on the\ntechnological front [1, 2]. Several years since their discoveries, the research on these two\nsystems continues unhindered since both the systems offer great freedom in exploring\ncrystal chemistry as well as modifying physical properties through chemical control (by\nsubstitutions, doping etc). This on one hand enriched the solid-state chemistry of layered\noxide compounds, and on the other hand gave rise to new compounds with interesting\nphysical\n\nproperties.\n\nThe\n\nrare\n\nearth\n\nmanganites,\n\nLnMnO3\n\nexhibits\n\ncolossal\n\n2\n\n\fmagnetoresistance when doped with electron or holes (where Ln = trivalent lanthanide\nion). Several electron doped LnMnO3 (n-type) perovskites e.g., Ca1-xLnxMnO3 are very\ngood thermoelectric materials also. In recent times, many studies are devoted in studying\nmultiferroic properties of LnMnO3 type compounds [3]. Many charge ordered manganite\nsystems, typically of the type Ln0.5A0.5MnO3 (A = divalent alkali metal ions) have\nexhibited dielectric (multiferroic) properties [3, 4].\nRecently it was found that the cubic-perovskite related compound, CaCu3Ti4O12\n(CCTO) exhibits colossal dielectric constant (CDC) [5]. The term CDC is used since\nCCTO exhibits almost temperature independent dielectric constant (ε) in the temperature\nrange 100 – 600 K, which drops almost by order of 3 below 100 K. The observation of\ndielectric properties in cuprates containing transition metal ions like CCTO opens up a\nnew avenue in the search for novel materials exhibiting multiferroic properties.\nHervieu\n\net\n\nal\n\n[6]\n\nsynthesized\n\na\n\nnew\n\nmanganocuprate\n\ncompound,\n\nEu3Ba2Mn2Cu2O12 which is a made up of the blocks of Eu2MnO4 (K2NiF4 type) separated\nby layered perovskite EuBa2Cu2MnO8 (R123 type). The structural determination of\nEu3Ba2Mn2Cu2O12 has been done in detail by Hervieu et al and Field et al [6, 7] using\nhigh resolution electron microscopy (HREM) and powder neutron diffraction (PND)\nrespectively. From the analysis of the resistivity data of Eu3222, activation energy (Ea) of\n0.17 eV was observed in the temperature range of 100 – 300 K indicating the localization\nof the charge carriers [6]. The insulating behavior and localization of charge carries rule\nout the mixed valence state for Cu, therefore the most likely possibility of oxidation\nstates suggests that Mn is in two valence states Mn3+ and Mn4+. From the HREM studies\n\n3\n\n\fHervieu et al concludes that among various possibilities of oxidation states for Mn and\nCu, the most likely (or closest) oxidation states for the ions would be given as:\n\nEu33+ Ba22+ Mn 3+ Mn 4+ Cu 22+ O122−\n\n---- (1)\n\nThe presence of Mn3+/4+ states presents a scenario similar to the ones observed usually in\nmanganites. For a typical half-doped manganite exhibiting charge-ordering, the oxidation\nstates can be exhibited as\n\n( Ln 03.+5 A02.+5 )( Mn 03.+5 Mn 04.+5 )O 32 −\n\n--- (2)\n\nThe equal distribution of Mn3+ and Mn4+ valence states is believed to give rise to\nthe charge-ordering in the half-doped manganites [2, 9].\nTherefore, on summarizing these observations, i.e., (i) CDC was observed in a\ncopper-titanate system (CCTO), (ii) equal distribution of Mn3+/4+ in Eu3222, similar to\nthe charge-ordered manganites; the studies on manganocuprates (Ln3222) promises\nexciting novel physical properties.\nOur recent study on Gd3222 establishes that it is an isostructural compound of\nEu3Ba2Mn2Cu2O12 [8]. The low temperature studies on Gd3222 exhibits anomalous\nmagnetic behavior and a spin-glass like state at temperatures below 10 K. Gd3222 also\nexhibits a magnetocaloric effect (MCE) of about 27 J/mol K at 10 K under a field change\nof 10 Tesla [8]. Encouraged by the initial results on the manganocuprates we present here\nthe resistivity behavior of Gd3222 measured as a function of temperature. We have also\nstudied the dielectric response of Gd3222 in a temperature range of 100 – 300 K at\nvarious frequencies between 75 kHz to 1 MHz. The results are discussed to exhibit the\nmulti-functional properties of Gd3222 compound and to study the inter-relationship\namong various phenomenons.\n4\n\n\f2.\n\nExperimental Details\nThe polycrystalline samples were prepared by solid-state reaction method using\n\nhigh purity (minimum stated purity > 99.9%) starting compounds of Gd2O3, BaCO3,\nMnO2 and CuO. X-ray diffraction (XRD) patterns were recorded for the powdered\nsamples to check the phase purity. The title compound crystallizes in a tetragonal unit\ncell, space group I4/mmm. Details of sample synthesis and XRD are given by Rayaprol et\nal [8]. Resistivity for the Gd3222 compound was measured using the four probe\ngeometry on a closed cycle refrigerator (CCR) based cryostat. The dielectric\nmeasurements of both the systems were made using HP LCR meter (model No. Agilent\n4285A) in the temperature range of 100 K–300 K at certain selected frequencies.\n3.\n\nResults and discussion\n\n3.1\n\nResistivity measurements\nIn Fig. 1 the resistivity (ρ) as a function of temperature for Gd3222 sample in the\n\ntemperature ranges 100 – 300 K is presented. The room temperature resistivity value for\nGd3222 was 65Ωcm, which increases with decreasing temperature, exhibiting\nsemiconductor like behavior. In the study of transport properties of layered manganite\nsystems, the semiconducting behavior of resistivity is explained by several mechanisms\nsuch as small polaron hopping, Mott's 2D or 3D variable range hopping. Gupta et al [10]\nhas recently showed that from the analysis of the variation of activation energy (Ea) with\nrespect to temperature, the mechanism responsible for conduction in layered manganites\ncan be proposed. According to Sarathy et al [11] the temperature dependence of Ea can\nbe expressed as:\nk B T 2 ⎛ dρ ⎞\nEa = −\n⎜\n⎟\nρ ⎝ dT ⎠\n\n--- (3)\n\n5\n\n\fWhere, Ea = activation energy, kB = Boltzmann's constant, ρ = resistivity.\nA general expression for elucidating the mechanism of conduction can be given as:\n\n⎛B⎞\nρ = ρ 0exp⎜ ⎟\n⎝T ⎠\n\nγ\n\n--- (4)\n\nWhere B = constant, Ea/kB\nγ = 1 exhibits nearest neighbor hopping,\n= 1⁄4 exhibits Mott's 3D variable range hopping,\n= 1⁄2 exhibits Mott's 2D variable range hopping, and\n= 1⁄3 exhibits Efros-Shklovskii's variable range hopping\nTherefore combining equations (3) and (4), the expression for Ea(T) can be given as\n\nEa = εT δ ; where ε = γB γ k B and δ = 1 − γ = 3\n\n4\n\n--- (5)\n\nFor 3D Mott variable range hopping the expression is given as\nEa = εT\n\n3\n\n4\n\n--- (6)\n\nThe relation between ε and Mott's parameter T0 is given as\n\nε=\n\n1\n1\n(T0 ) 4 k B\n4\n\n--- (7)\n\nIn figure 2, the activation energy calculated using equation (3), is plotted against\nthe temperature of measurement. The solid line passing through the calculated Ea data is\nthe best fitted from the equation (5). The value of δ obtained from the fit is 0.72, and very\nclose to the expected value of 3/4 (= 0.75) for Mott's 3D variable range hopping\nmechanism (see equations (6) and (7) also). The inset in Fig. 1 shows the plot of ρ vs.\n1/T-1/4, i.e., the three dimensional variable range hopping (VRH) model. The solid line\npassing through the data points is the linear fit of the data. The linearity of the plot shows\n\n6\n\n\fthat the conduction mechanism in Gd3222 is governed by hopping of charges in 3dimensions.\nThe Mott's 3D variable range hopping is expressed as:\n⎛T ⎞\nρ = ρ 0 exp⎜ 0 ⎟\n⎝T ⎠\n\n1\n\n4\n\n--- (8)\n\nwhere T0 = the Mott's parameter.\nSarathy et al has shown that using the values of T0, we can calculate the density of states,\nN(EF) using the relation,\nT0 =\n\n16α 3\nk B N ( EF )\n\n--- (9)\n\nWhere α (numerical coefficient) is taken as 2.5/nm. Using the equation (9), the calculated\ndensity of state for Gd3222 is of the order of 1020 eV-1 cm-3. This value is close to the\nvalues expected for charged ordered manganites and bi-layered manganites exhibiting\nlarge magnetoresistance [10, 11].\n3.2\n\nDielectric measurements\nThe dielectric response of Gd3222 as a function of temperature is shown in Fig. 3.\n\nThe figure exhibits two plateaus (peaks in first derivative) around 150 and 210 K for 75\nMHz. With increasing frequency, the peak magnitude of the peak decreases marginally,\nhowever the plateau (or say peak for clarity) shifts to higher temperature on increasing\nthe frequency. Similarly tanδ (Fig. 4) also exhibits peaks corresponding to ε(T) and they\nalso exhibit frequency dependence. The frequency dependence of ε(T) exhibits dielectric\nrelaxation, and this can be explained by Vogel-Fulcher (VF) law, given as:\n\n⎛\n\n⎞\n− Ea\n⎟\n⎟\n(\n)\n−\nk\nT\nT\na ⎠\n⎝ B p\n\nν = ν 0 exp⎜⎜\n\n--- (10)\n\n7\n\n\fWhere, ν0 is the pre-exponential factor or also known as the characteristic frequency (ν0 =\n1012 Hz), Ea/kB represents the activation barrier and Ta is known as the freezing\ntemperature. Tp is the temperature of maxima in ε(T, ν) plot. In Fig. 5, we have plotted the\nVF relation for both peaks of Gd3222. The straight line passing through the data lines is\nthe linear fit of the data points, exhibiting that the dielectric relaxation in the\nmanganocuprates are glassy type. However, it must be cautioned here that, to completely\nelucidate the relaxation behavior in Gd3222 more detailed dielectric results are required\nand also the contribution of intrinsic and extrinsic effects to the dielectric constants\nshould also be evaluated.\n4.\n\nConclusions\n\nA new manganocuprate have been studied for its dielectric behavior at various\nfrequencies in the temperature range 100 – 300 K. The dielectric constant (ε) increases by\ntwo orders of magnitude in the case of Gd3222. The plot of ε(T, ν) exhibits relaxation\npeaks which are frequency dependent. The dielectric dispersion of the manganocuprates\nis similar to that of manganite systems exhibiting charge-ordering. The resistivity data for\nGd3222 also establishes similarity in the conduction mechanism between the\nmanganocuprates as well as charge-ordered manganites. Therefore, it would be\ninteresting to extend the present studies on the lines of perovskite manganites to\nunderstand the underlying physics of this interesting compound.\n\n8\n\n\fReferences\n\n[1]\n\nJ. C. Philips, Physics of High Tc superconductors, Academic Press Inc. London,\n(1989).\n\n[2]\n\nY. Tokura, Colossal Magnetoresistive Oxides, Gordon and Breach Publishers,\nAmsterdam (2000)\n\n[3]\n\nW. Eerenstein, N. D. Mathur and J. F. Scott, Nature 442 (2006) 759.\n\n[4]\n\nE. L. Nagaev, Physics – Uspheki 39 (1996) 781\n\n[5]\n\nM. A. Subramanian, Dong Li, N. Duan, B. A. Reisner, and A. W. Sleight, J. Solid\nState Chem. 151 (2000) 323\n\n[6]\n\nM. Hervieu, C. Michael, R. Genouel, A. Maignan and B. Raveau, J. Solid State\nChem. 115 (1995) 1\n\n[7]\n\nM. A. L. Field, C. S. Knee and M. T. Weller J. Solid State Chem. 167 (2002) 237\n\n[8]\n\nS. Rayaprol, K. Singh, S. Jammalamadaka, N. Mohapatra, N. K. Gaur and E. V.\nSampathkumaran, Solid State Commun. 147 (2008) 353\n\n[9]\n\nJ. M. D. Coey, M. Viret and S von Molnár, Adv. Phys. 48 (1999) 167\n\n[10]\n\nAjai K. Gupta, Vijay Kumar, and Neeraj Khare, Solid State Sci. 9 (2007) 817\n\n[11]\n\nVijaya K. Sarathy, S. Parashar, A. R. Raju and C. N. R. Rao, Solid State Sci. 4\n(2002) 353\n\n9\n\n\fFigures Captions\n\nFigure 1\n\n(colour online) Resistivity (ρ) as a function of temperature for\nGd3Ba2Mn2Cu2O12. The linear variation of ρ as a function of T-1/4 is shown\nin the inset.\n\nFigure 2\n\nThe\n\ntemperature\n\ndependence\n\nof\n\nactivation\n\nenergy\n\n(Ea)\n\nfor\n\nGd3Ba2Mn2Cu2O12, calculated from the resistivity data (shown in Fig. 1).\nThe straight line passing through the data points (175 < T(K) < 240) is the\nbest fit of the equation (5). See text for details.\nFigure 3\n\n(colour online) Dielectric constant (ε) as a function of temperature,\nmeasured at different frequencies for Gd3Ba2Mn2Cu2O12.\n\nFigure 4\n\n(colour online) Dielectric loss (tan δ) as a function of temperature,\nmeasured at different frequencies for Gd3Ba2Mn2Cu2O12.\n\nFigure 5\n\nThe Vogel-Fulcher plot for Gd3Ba2Mn2Cu2O12. The straight lines passing\nthrough the data points are the linear fits according to equation (10).\n\n10\n\n\fGd3Ba2Mn2Cu2O12\n4\n\n10\n\n3\n\nρ\n\nρ (Ω cm)\n\n10\n\n4\n\n10\n\n2\n\n10\n\n10\n\n3\n\n0.24\n\n0.26\n\nT\n\n10\n\n-1/4\n\n(K\n\n0.28\n-1/4\n\n)\n\n2\n\n150\n\n200\n\nT (K)\n\n250\n\n300\n\n\fGd3Ba2Mn2Cu2O12\nEa (Experimental)\n\n0.20\n\nEa (eV)\n\nEa (Calculated)\n\n0.16\n\n0.12\nδ\n\nEa = εT\n\nε = 0.00347 (±0.00079)\nδ = 0.72497 (±0.04202)\n\n0.08\n\n150\n\n200\n\n250\n\nT (K)\n\n300\n\n\f15000\n\nGd3Ba2Mn2Cu2O12\nν = 75 kHz\n\nε\n\n10000\n\n275 kHz\n475 kHz\n675 kHz\n875 kHz\n1 MHz\n\nPeak 2\n\n5000\nPeak 1\n\n0\n100\n\n150\n\n200\n\nT (K)\n\n250\n\n300\n\n\f4\n\nGd3Ba2Mn2Cu2O12\nν = 75 kHz\n\ntan δ\n\n3\n\n275 kHz\n475 kHz\n675 kHz\n875 kHz\n1 MHz\n\n2\n\nPeak 2\n\n1\nPeak 1\n\n0\n100\n\n150\n\n200\n\nT (K)\n\n250\n\n300\n\n\fGd3Ba2Mn2Cu2O12\n\nTp (K)\n\n250\n\nPeak 2\n\n200\n\nPeak 1\n150\n0.060\n\n0.064\n\n0.068\n\n1/ln(ν0/ν)\n\n0.072\n\n\f"}