{"id": "http://arxiv.org/abs/0904.3725v2", "guidislink": true, "updated": "2009-04-24T13:15:46Z", "updated_parsed": [2009, 4, 24, 13, 15, 46, 4, 114, 0], "published": "2009-04-23T16:03:51Z", "published_parsed": [2009, 4, 23, 16, 3, 51, 3, 113, 0], "title": "Efficient fitting of multiplanet Keplerian models to radial velocity and\n  astrometry data", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0904.0319%2C0904.0862%2C0904.4863%2C0904.0284%2C0904.4511%2C0904.3698%2C0904.0307%2C0904.1021%2C0904.1164%2C0904.2252%2C0904.3998%2C0904.1600%2C0904.3327%2C0904.0235%2C0904.0935%2C0904.0253%2C0904.2021%2C0904.1304%2C0904.3856%2C0904.1853%2C0904.3185%2C0904.2750%2C0904.3985%2C0904.2544%2C0904.2724%2C0904.4300%2C0904.1926%2C0904.2115%2C0904.3809%2C0904.2518%2C0904.2234%2C0904.2866%2C0904.0911%2C0904.4001%2C0904.1079%2C0904.1080%2C0904.2683%2C0904.2253%2C0904.3605%2C0904.3331%2C0904.4794%2C0904.0313%2C0904.1084%2C0904.2994%2C0904.0445%2C0904.2717%2C0904.0054%2C0904.3725%2C0904.2826%2C0904.3186%2C0904.1788%2C0904.3488%2C0904.2725%2C0904.0399%2C0904.4841%2C0904.3715%2C0904.4034%2C0904.3491%2C0904.2350%2C0904.3914%2C0904.0343%2C0904.3810%2C0904.0491%2C0904.1260%2C0904.2124%2C0904.1633%2C0904.1944%2C0904.4836%2C0904.2709%2C0904.0223%2C0904.0261%2C0904.2376%2C0904.0104%2C0904.3465%2C0904.0408%2C0904.0805%2C0904.4612%2C0904.4696%2C0904.0509%2C0904.2375%2C0904.3644%2C0904.1184%2C0904.1821%2C0904.3551%2C0904.2355%2C0904.0353%2C0904.3777%2C0904.0749%2C0904.1739%2C0904.2548%2C0904.1843%2C0904.2660%2C0904.1789%2C0904.0517%2C0904.4801%2C0904.4504%2C0904.2679%2C0904.1269%2C0904.0525%2C0904.4467%2C0904.4560&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Efficient fitting of multiplanet Keplerian models to radial velocity and\n  astrometry data"}, "summary": "We describe a technique for solving for the orbital elements of multiple\nplanets from radial velocity (RV) and/or astrometric data taken with 1 m/s and\nmicroarcsecond precision, appropriate for efforts to detect Earth-massed\nplanets in their stars' habitable zones, such as NASA's proposed Space\nInterferometry Mission. We include details of calculating analytic derivatives\nfor use in the Levenberg-Marquardt (LM) algorithm for the problems of fitting\nRV and astrometric data separately and jointly. We also explicate the general\nmethod of separating the linear and nonlinear components of a model fit in the\ncontext of an LM fit, show how explicit derivatives can be calculated in such a\nmodel, and demonstrate the speed up and convergence improvements of such a\nscheme in the case of a five-planet fit to published radial velocity data for\n55 Cnc.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0904.0319%2C0904.0862%2C0904.4863%2C0904.0284%2C0904.4511%2C0904.3698%2C0904.0307%2C0904.1021%2C0904.1164%2C0904.2252%2C0904.3998%2C0904.1600%2C0904.3327%2C0904.0235%2C0904.0935%2C0904.0253%2C0904.2021%2C0904.1304%2C0904.3856%2C0904.1853%2C0904.3185%2C0904.2750%2C0904.3985%2C0904.2544%2C0904.2724%2C0904.4300%2C0904.1926%2C0904.2115%2C0904.3809%2C0904.2518%2C0904.2234%2C0904.2866%2C0904.0911%2C0904.4001%2C0904.1079%2C0904.1080%2C0904.2683%2C0904.2253%2C0904.3605%2C0904.3331%2C0904.4794%2C0904.0313%2C0904.1084%2C0904.2994%2C0904.0445%2C0904.2717%2C0904.0054%2C0904.3725%2C0904.2826%2C0904.3186%2C0904.1788%2C0904.3488%2C0904.2725%2C0904.0399%2C0904.4841%2C0904.3715%2C0904.4034%2C0904.3491%2C0904.2350%2C0904.3914%2C0904.0343%2C0904.3810%2C0904.0491%2C0904.1260%2C0904.2124%2C0904.1633%2C0904.1944%2C0904.4836%2C0904.2709%2C0904.0223%2C0904.0261%2C0904.2376%2C0904.0104%2C0904.3465%2C0904.0408%2C0904.0805%2C0904.4612%2C0904.4696%2C0904.0509%2C0904.2375%2C0904.3644%2C0904.1184%2C0904.1821%2C0904.3551%2C0904.2355%2C0904.0353%2C0904.3777%2C0904.0749%2C0904.1739%2C0904.2548%2C0904.1843%2C0904.2660%2C0904.1789%2C0904.0517%2C0904.4801%2C0904.4504%2C0904.2679%2C0904.1269%2C0904.0525%2C0904.4467%2C0904.4560&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We describe a technique for solving for the orbital elements of multiple\nplanets from radial velocity (RV) and/or astrometric data taken with 1 m/s and\nmicroarcsecond precision, appropriate for efforts to detect Earth-massed\nplanets in their stars' habitable zones, such as NASA's proposed Space\nInterferometry Mission. We include details of calculating analytic derivatives\nfor use in the Levenberg-Marquardt (LM) algorithm for the problems of fitting\nRV and astrometric data separately and jointly. We also explicate the general\nmethod of separating the linear and nonlinear components of a model fit in the\ncontext of an LM fit, show how explicit derivatives can be calculated in such a\nmodel, and demonstrate the speed up and convergence improvements of such a\nscheme in the case of a five-planet fit to published radial velocity data for\n55 Cnc."}, "authors": ["J. T. Wright", "A. W. Howard"], "author_detail": {"name": "A. W. Howard"}, "author": "A. W. Howard", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1088/0067-0049/182/1/205", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0904.3725v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0904.3725v2", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "ApJS accepted", "arxiv_primary_category": {"term": "astro-ph.SR", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph.SR", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0904.3725v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0904.3725v2", "journal_reference": null, "doi": "10.1088/0067-0049/182/1/205", "fulltext": "Draft version October 28, 2018\nPreprint typeset using LATEX style emulateapj v. 08/22/09\n\nEFFICIENT FITTING OF MULTI-PLANET KEPLERIAN MODELS TO RADIAL VELOCITY AND\nASTROMETRY DATA\nJ. T. Wright\n\narXiv:0904.3725v2 [astro-ph.SR] 24 Apr 2009\n\n226 Space Sciences Building, Astronomy Department, Cornell University, Ithaca, NY 14853\nemail: jtwright@astro.cornell.edu\n\nand\nA. W. Howard1\n601 Campbell Hall, Astronomy Department, University of California, Berkeley, CA 94720\nDraft version October 28, 2018\n\nABSTRACT\nWe describe a technique for solving for the orbital elements of multiple planets from radial velocity\n(RV) and/or astrometric data taken with 1 m/s and μas precision, appropriate for efforts to detect\nEarth-massed planets in their stars' habitable zones, such as NASA's proposed Space Interferometry\nMission. We include details of calculating analytic derivatives for use in the Levenberg-Marquardt\n(LM) algorithm for the problems of fitting RV and astrometric data separately and jointly.\nWe also explicate the general method of separating the linear and nonlinear components of a model\nfit in the context of an LM fit, show how explicit derivatives can be calculated in such a model, and\ndemonstrate the speed up and convergence improvements of such a scheme in the case of a five-planet\nfit to published radial velocity data for 55 Cnc.\nSubject headings: astrometry - planetary systems - methods: data analysis - methods: numerical\n- techniques: radial velocities\n1. INTRODUCTION\n\n1.1. Fitting Kepelerian Curves\nThe discovery of over 27 multiple-planet systems in recent years (Wright et al. 2009) has required algorithms\nfor disentangling the radial-velocity signature of such\ncomplex systems. Because the parameters describing a\nradial velocity (RV) or astrometric curve are nonlinear,\nthere is no way to fit for them analytically, and they\nmust be found through an algorithmic search. Fitting\nfor the Keplerian parameters of a single orbital companion is usually straightforward given a good period guess,\nand if necessary a \"brute force\" mapping of the χ2 space\nis usually not computationally prohibitive. Fitting multiple planets involves searching a correspondingly higherdimensional space and can require substantial computing\ntime.\nThere is an art to searching such χ2 spaces efficiently,\nand in this context there are many \"tricks\" for finding\nthe global minimum. For instance, a Lomb-Scargle periodogram (Scargle 1982) is often used to identify promising periods for prospective planets, and all of the tallest\npeaks can be used as starting guesses for the fitting algorithm. In hierarchical systems, the dominant planet can\nbe fit for alone, its signal subtracted from the data, and\nadditional planets can be searched for among the residuals. This process can then be repeated until all of the\nplanets have been identified, and then a full, multi-planet\nfit on the original data starting at the values found for\nthe individual planets.(e.g. Fischer et al. 2008).\nIn many multi-planet systems, planet-planet interactions can significantly alter the radial velocity (RV) or\nastrometric signature of the system. In such cases where\ninteractions are important, a full dynamical (Newtonian)\n1\n\nTownes Fellow, Space Sciences Laboratory, UC Berkeley\n\nfit involving an n-body code must be used to properly fit\nthe data and to ensure the short- and long-term stability of the solution. Even in these cases, a multi-planet\nKeplerian (kinematic) fit, which simply adds the reflex\nsignatures of single planets and ignores planet-planet interactions, is still useful for efficiently identifying planets\nand providing good initial guesses to the n-body codes.\nThe Levenberg-Marquardt method (LM; Levenberg\n1944; Marquardt 1963) is an efficient algorithm for finding a local minimum in a nonlinear χ2 space (given good\nguesses), and is well-suited for the application of RV\nand astrometric fitting (Press et al. 1992). As a concrete example, we refer in this work to a useful IDL2\nimplementation of this technique, MPFIT by Craig Markwardt3 (Markwardt 2009). Like most implementations\nof the algorithm, MPFIT requires a user-defined function\nthat accepts, as an argument, trial values for the parameters being solved for, evaluates the model at those\nvalues, and returns the corresponding residuals to the\ndata. MPFIT then uses this information to step through\nparameter space and locate the minimum in χ2 using a\ncombination of Newton's method and a steepest-descent\nmethod. Uncertainties in these parameters can then be\ncalculated by mapping the χ2 space near this minimum\n(e.g. Wright et al. 2007) or through error \"bootstrapping\" (e.g. Butler et al. 2006).\nThe user-defined function in MPFIT also optionally\nreturns the values of the derivatives of these residuals with respect to the parameters being fit, computed\n\"analytically\" or \"explicitly\". Absent these derivatives,\n2 IDL is a commercial programming language and environment\nby ITT Visual Information Solutions. http://www.ittvis.com/idl/\n3 Available at http://purl.com/net/mpfit.\nMPFIT is a port\nof MINIPACK-1 from FORTRAN, and is also available in C and\nPython.\n\n\f2\n\nWright & Howard\n\nMPFIT will calculate numerical derivatives with small\nsteps in the fitted parameters and calculating the resulting change in the residuals. he user must choose step sizes\nthat are not too large - thereby missing fine structure\nin the χ2 space - or too small - increasing compute\ntime and potentially losing numerical precision. Adding\nexplicit-derivative capability to MPFIT, or any implementation of the LM algorithm, obviates the need for explicitly providing step-sizes, and can greatly improve performance in terms of the number of steps taken and the\nCPU time consumed per step.\nThe LM algorithm is useful for finding the best-fitting\nparameters of a nonlinear model to a set of data from\na \"frequentist\" perspective. A Bayesean approach can\nprovide for more robust estimates of parameter uncertainties, especially when those uncertainties are large.\nOne Bayesean method of exploring complex or highdimensional spaces is the Markov chain Monte Carlo\nmethod (MCMC; Metropolis et al. 1953; Hastings 1970),\nwhich has been productively employed in the context of\norbital fitting (e.g. Ford 2004; Driscoll & Fischer 2005;\nBalan & Lahav 2008).\nFuture space missions, such as NASA's Space Interferometry Mission (SIM Lite), will obtain μas astrometry of\nnearby stars, referenced to an inertial astrometric grid.\nThese measurements will be sufficiently precise to detect\nEarth-mass planets with orbital periods shorter than the\nmission lifetime. Since multiple-planet systems are common,4 interpreting these data in conjunction with precise\nradial velocity data will require algorithms that can efficiently and robustly search the large nonlinear parameter\nspace of multiple-planet systems.\nIn this paper, we describe the method of efficiently\nfitting multi-Keplerian models to such high precision\nRV and astrometric data separating the parameters\ninto linear and nonlinear components in the context\nof a LM algorithm, and provide the explicit derivatives used in such a fit. With modifications, the principles here can also be applied to MCMC methods, as\nwell (Catanzarite, Zhai, & Shao 2009; Bakos et al. 2009,\ne.g.).\n1.2. Plan\nWe begin with an elementary exposition to familiarize\nthe reader with our notation (detailed in Table 2) and\nprovide context for the later discussion. In §2, we explicate the method of exploiting linear parameters in the\nKepler problem using the example of an RV time series.\nThe calculation of explicit derivatives in §2.4 is general\nto any application of the LM algorithm where the model\ncontains both linear and nonlinear parameters. We apply this method to the problem of astrometric data in §3\nand specifically to the problem of combined astrometric\nand RV data in §3.3. We discuss nonlinear terms relevant\nto μas astrometric work and how to accommodate them\nin §4. In §5 we quantify the improvement in speed and\nconvergence from exploiting linear parameters and from\nthe use of explicit derivatives in the LM algorithm.\n2. AN EXAMPLE: RADIAL VELOCITIES\n4 At least 1/4 of known planetary systems show evidence of\nmultiple companions (Wright et al. 2007)\n\n2.1. Costs and Benefits of Exploiting Linear\nParameters\nWhen fitting RV data, there are 5n + 1 Keplerian parameters to be fit, where n is the number of planets:5 P ,\nthe period of the planet's orbit; K, the semi-amplitude of\nthe radial velocity signal; e, the eccentricity of the orbit;\nω, the argument of periastron; tp , a date of periastron\npassage; and γ, the apparent radial velocity of the center\nof mass of the system6\nExploiting linear parameters, as described below, reduces the search space to 3n dimensions (corresponding\nto P , e, and tp for each planet) and combines the other\norbital elements into a set of linear parameters, which\ncan be solved analytically (and therefore quickly and exactly) at each step in the search. The exact, analytic\nsolution of these linear parameters greatly increases the\nspeed and stability of search algorithms, but at a cost:\nthe nonlinear parameters cannot be varied independently\nof the linear parameters.\nFurther reduction in the number of nonlinear parameters per planet is certainly possible. By exploiting an epicyclic or harmonic series expansion one can\nreduce the problem to only one nonlinear parameter per planet, Pj . Cumming et al. (2003) and Ford\n(2008) analyze the RV problem in the case of a circular orbits, and discuss the relationship between periodograms and Bayesian approaches to orbit fitting.\nKonacki & Maciejewski (1999) pursued a method analogous to ours in their approach to RV curve fitting, and\nKonacki, Maciejewski, & Wolszczan (2002) did the same\nfor astrometry. Such approximations offer a different set\nof costs and benefits to the one presented here. For instance, when K and e are both large, it may require a\nlarge number of terms to adequately describe a set of\nRV data. We may pursue such an approach in a future\nversion of our code.\nThe linear parameters in our treatment are not coefficients in a series expansion; rather, we recast the problem, separating linear parameters, which can be solved\nfor exactly with linear algebra, from nonlinear parameters, which must be solved for algorithmically (using\nLM). As described in §2.2, the linear parameters are algebraic combinations of K, ω, γ, and an optional trend\nparameter, while P , tP , and e are nonlinear parameters.\nTwo complications are introduced by exploiting linear parameters. First, because the linear parameters are\ncomputed analytically, and not algorithmically, their errors and covariances with the nonlinear parameters are\nnot computed automatically in the procedure outlined\nhere. (They also cannot be held fixed in the fit, although\nthe issue of fixing the trend parameter can be finessed –\nsee §2.6). The second complication is that computation\nof the explicit derivatives for the LM algorithm is not\nstraightforward: in the context of the algorithm, the Keplerian model is not a simple function of the 3n nonlinear\nparameters being fit, but also depends on the data. For\nexample, increasing the nonlinear parameter e slightly\n5 Occasionally, an additional \"trend\" parameter is used to fit out\nlong-term RV trends caused by massive, long-period companions.\nThe other two elements, i, the inclination, and Ω, the position angle\nof the ascending node, can only be determined astrometrically.\n6 In practice, γ is degenerate with an arbitrary instrumentdependent RV offset.\n\n\fFitting Keplerian Curves\nnot only changes the model because it is more eccentric,\nbut also because at this new value of e the linear parameters have different values. These complications can\nbe avoided if one uses the linear basis of the orbits presented here in an ordinary, nonlinear 5n + 1 parameter\nfit, but the convergence and speed-up benefits will not\nbe as great.\nThe sections below describe a general method of calculating an n-planet Keplerian radial velocity model given\nvalues for the 3n nonlinear parameters, and of calculating\nthe derivatives of that model with respect to those parameters. These equations can be used in a user-defined\nfunction for input to an LM minimization code, or a\nbrute-force χ2 map.\n2.2. Linear Parameters in the Radial Velocity Problem\nWe wish to find the parameters of the n-planet model\nu(t) =\n\nn\nX\nj=1\n\n[Kj (cos(ωj + fj (t)) + ej cos ωj )] + γ + d * (t − t0 )\n\n(1)\nwhich best fits the set of observed radial velocities ~v , measured at times ~t, with uncertainties ~σ in a least-squares\nsense. Here, Kj and ωj are the usual Keplerian parameters for planet j, γ is the time-independent velocity offset, d is the trend parameter, fj (t) is the true anomaly of\nplanet j at time t, and t0 is a conveniently chosen epoch\nof the observations. The true anomaly is defined implicitly in terms of the other three Keplerian parameters\n(Pj , tp,j , and ej ) through the relations\ns\nEj (t)\n1 + ej\nfj (t)\ntan\n=\n(2)\ntan\n2\n1 − ej\n2\nEj (t) − ej sin Ej (t) =\n\n2π(t − tp,j )\n= Mj (t)\nPj\n\n(3)\n\nj=1\n\nwhere\nKj cos ωj\n\n(5)\n\ncj = −Kj sin ωj\n\n(6)\n\nand\nv0 = γ +\n\nn\nX\n\nKj ej cos ωj\n\n(7)\n\nj=1\n\nThese linear parameters can be converted back to Keplerian orbital elements through the relations\nq\nKj = h2j + c2j\n(8)\n7\n\ntan ωj =\n\nInstead of tp , many authors (especially dynamicists) prefer\nto parameterize orbits in terms of the mean longitude at epoch,\ndefined as M (t0 ) + Ω + ω.\n\n−cj\nhj\n\n(9)\n\n(where ωj is chosen so that sin ωj has the sign of the\nnumerator) and\nγ = v0 −\n\nn\nX\n\nKj ej cos ωj\n\n(10)\n\nj=1\n\nThe masses of the orbiting planets can be inferred from\ntheir corresponding semi-amplitudes Kj , defined for a\nsingle-planet system with planet mass m and stellar mass\nm∗ as\n\u0012 3 3 \u0013\n2πG\nm sin i\nK3 =\n(11)\n3\nP (1 − e2 ) 2 (m∗ + m)2\nwhere G is Newton's gravitational constant. The fraction in parentheses is known as the mass function of the\nsystem.\nThe problem can now be divided into two parts: an\nalgorithmic search through parameter space for the bestfit nonlinear parameters Pj , ej , and tp,j with a computer\nroutine such as an LM or an MCMC code, and at each\nstep in that search an analytic solution for the linear\nparameters that fit best there.\n2.3. Solving for the Linear Parameters\nGiven a set of values for the nonlinear parameters, we\ncan fit for the linear parameters in Eq. 4 through χ2 minimization. We denote the row vector of linear parameters\n~ = {h1 , c1 , h2 , c2 . . . hn , cn , v0 , d}\nβ\n\n(12)\n\nWe define χ2 the usual way:\nχ2 =\n\nN\nX\n(vk − u(tk ))2\nk=1\n\nIn Eq. 3 (known as Kepler's Equation) Ej is called the\neccentric anomaly of planet j, and M is known as the\nmean anomaly.7\nWe identify the linear parameters by rewriting Eq. 1\nas\nn\nX\n[hj cos fj (t) + cj sin fj (t)] + v0 + d * (t − t0 ) (4)\nu(t) =\nhj =\n\n3\n\n(13)\n\nσk2\n\nand minimize it with respect to each of the linear parameters in β~ simultaneously:\nN\n\nX vk − u(tk ) ∂ u\n∂χ2\n= −2\n∂βl\nσk2\n∂βl\nk=1\n\n=0\n\n(14)\n\nt=tk\n\nWe can express this more compactly by invoking matrix\nalgebra. For the problem of Keplerian orbits, we define\nthe matrix F as\n\n\ncos f1,1 cos f1,2 . . .\n sin f1,1 sin f1,2 . . . \n cos f\n\n2,1 cos f2,2 . . . \n\n sin f2,1 sin f2,2 . . . \n\n\n\n\n..\n..\nF=\n(15)\n\n.\n.\n\n\n cos fn,1 cos fn,2 . . . \n\n\n sin fn,1 sin fn,2 . . . \n\n1\n1\n... \nt1 − t0 t2 − t0 . . .\n\nwhere fj,k ≡ fj (tk ). This allows us to write the model\nvelocities at times ~t (Eq. 1) as\n~\n~u = βF\n\n(16)\n\n\f4\n\nWright & Howard\n\nWe also define the diagonal weight matrix W such that\nWkl = δkl /σk2\n\n(17)\n\nwhere we have used the Kronecker delta symbol. We can\nthen write the system of equations in Eq. 14 as\n∂χ2\nT\n~\n= −2(~v − βF)WF\n= ~0\n~\n∂β\n\n(18)\n\n~ we have\nSolving for β\nβ~ = ~v WFT ǫ\n\n(19)\n\nwhere we have denoted the error matrix (also called the\nvariance-covariance matrix)\nǫ = (FWFT )−1\n\n(20)\n\nEq. 19 represents the general solution to the linear\nleast-squares problem for an appropriately defined F. In\nthe context of Keplerian fits, given a set of nonlinear\nparameters P , e, and tp for each planet, the remaining\n~ using\nKeplerian orbital elements can be found from β\nEqs. 8–10.\n\nFor the case of a Keplerian RV model, from Eq. 15 we\nhave\n\n\n′\n′\n− sin f1,1 f1,1\n− sin f1,2 f1,2\n...\n′\n′\n cos f1,1 f1,1\ncos f1,2 f1,2\n... \n\n\n′\n′\n − sin f2,1 f2,1 − sin f2,2 f2,2 . . . \n\n\n′\n′\ncos f2,2 f2,2\n... \n cos f2,1 f2,1\n\ndF \n..\n..\n\n=\n(26)\n\n\n.\n.\ndx\n\n\n′\n′\n − sin fn,1 fn,1 − sin fn,2 fn,2 . . . \n cos f f ′\n′\ncos fn,2 fn,2\n... \n\n\nn,1 n,1\n\n0\n0\n... \n0\n0\n...\n\n′\n′\nwhere fj,k\n≡ dfj,k /dx. Note that since fj,k\nrefers to the\ntrue anomaly of planet j, it vanishes when x refers to a\nparameter of a different planet (e.g., dfj,k /dPl = 0 when\nj 6= l). This means that the matrix dF/dx has only\ntwo nonzero rows. We can therefore suppress subscripts\nbelow for clarity.\nWe can calculate the nonzero derivatives as\n∂f\n∂f dE\ndf\n=\n+\n(27)\ndx\n∂x ∂E dx\nwhere, from Kepler's Equation (Eq. 3), we have\n\n−2π(t − tp )/P 2\ndE\n=\ndP\n1 − e cos E\n\n2.4. Calculation of Explicit (Analytic) Derivatives for\nUse in the LM Algorithm\nThe derivative of the model velocities ~u with respect\nto any nonlinear parameter can be found from Eq. 16:\n~\nd~u\ndβ\ndF\n=\nF + β~\ndx\ndx\ndx\n\n(21)\n\nwhere x stands for any of the nonlinear parameters (here,\nPj , ej , or tp,j ).\nFrom Eq. 19 we have\n!\n~\ndβ\ndF T\nT dǫ\n(22)\n= ~v W\nǫ+F\ndx\ndx\ndx\n\nsin E\ndE\n=\nde\n1 − e cos E\nand from Eq. 2 we have\nr\n∂f\n1 + e 1 + cos f\n=\n∂E\n1 − e 1 + cos E\n\n(29)\n(30)\n\n(31)\n\nFrom Eq. 2 we can also write\n\n2 tan(E/2) cos2 (f /2)\n∂f\n√\n=\n∂e\n(1 − e) 1 − e2\n\n(32)\n\n∂f\n∂f sin E\n=\n∂e\n∂E 1 − e2\n\n(33)\n\n(24)\n\n∂f\n∂f\n=0\n=\n∂P\n∂tp\n\n(34)\n\n(25)\n\nEqs. 22–34 can be used to calculate the terms in Eq. 21,\nyielding the explicit derivatives used by LM method fitting routines, such as MPFIT.\n\nFrom the definition of a matrix inverse we can express\nthe last derivative as\n\u0013\n\u0012\ndǫ\nd −1\nǫ\n(23)\n= −ǫ\nǫ\ndx\ndx\nUsing Eq. 20 we then have\n\u0001\ndǫ\nd\nFWFT ǫ\n= −ǫ\ndx\ndx\n\u0012\n\u0013 \u0012\n\u0013T !\ndF\ndF\n= −ǫ\nǫ\nWFT +\nWFT\ndx\ndx\n\ndE\n−2π/P\n=\ndtp\n1 − e cos E\n\n(28)\n\nbut it is more computationally convenient to note that\nthis happens to simplifiy to\n\nFinally,\n\nEqs. 16–24 are not specific to the RV Kepler problem, but\nare a general method of calculating explicit derivatives\nin a model with both linear and nonlinear parameters,\nand so can be applied to any analogous problem. For\ninstance, the problem of fitting an orbit using astrometric\ndata also has linear parameters as we show in §3.\n2.5. Explicit Derivatives for the Radial Velocity Model\n\n2.6. Variations on the n-Planet RV Model\nIn the context of the Kepler problem, the above equations include a parameter for a linear trend in the data.\nIn practice, fitting for such a trend will only occasionally\nbe necessary. When not needed the d parameter in β~ and\nthe bottom rows of the F and dF/dx matrices can simply\nbe left out of the calculations. Similarly, the trend parameter can effectively be held fixed at a nonzero value\n\n\fFitting Keplerian Curves\nby simply subtracting the desired value from the data\nbefore fitting.\nThese matrices can also be easily extended to handle\nthe case of combining data from multiple telescopes between which there exist RV offsets. This is accomplished\nby extending the data vectors ~v , ~t, and ~σ to include data\nfrom all telescopes, and extending the vector β~ to include\na separate offset parameter for each telescope after the\nfirst. The corresponding rows of F must then be filled\nwith 1's in those columns corresponding to data from\nthe appropriate telescope, and 0's elsewhere. Naturally,\nin dF/dx the elements of these rows are all 0.\n\nwhere R is the 3-D rotation matrix\n\"\ncos Ω sin Ω\nRz (Ω) = − sin Ω cos Ω\n0\n0\n\nA = a( cos Ω cos ω∗ − sin Ω sin ω∗ cos i)\nB = a( sin Ω cos ω∗ + cos Ω sin ω∗ cos i)\nF = a(− cos Ω sin ω∗ − sin Ω cos ω∗ cos i)\nG = a(− sin Ω sin ω∗ + cos Ω cos ω∗ cos i)\nC = a sin ω∗ sin i\nH = a cos ω∗ sin i\n\n(35)\n(36)\n(37)\n(38)\n(39)\n(40)\n\n0\n0\n1\n\n#\n\n(42)\n\nand ω∗ is the argument of periastron of the orbit of the\nstar.\nWe can transform the Thiele-Innes constants back to\nKeplerian orbital elements of the planet with the relations:\nB−F\nA+G\n−(B + F )\ntan(ω∗ − Ω) =\nA−G\n\u0012 \u0013\ni\n(A\n− G) cos(ω∗ + Ω)\ntan2\n=\n2\n(A + G) cos(ω∗ − Ω)\ntan(ω∗ + Ω) =\n\n3. APPLICATIONS TO ASTROMETRY\n\n3.1. Astrometry Alone\nThe above method can also be extended to the problem of fitting for the Keplerian elements of an orbit from\nastrometric data. Here we present a simplified model\nof μas astrometric data of the sort that might be provided by a space observatory such as NASA's Space Interferometry Mission (SIM Lite). We anticipate modifying our algorithms for a more realistic model of interferometric data and its noise sources (Sozzetti 2005;\nEriksson & Lindegren 2007; Catanzarite, Law, & Shao\n2008) in the near future.\nThe linear basis for astrometric coordinates are the\nThiele-Innes constants (e.g. Binnendijk 1960), and are\nwell documented as useful tools for astrometric curvefitting (e.g. Casertano et al. 2008). The astrometric perturbations caused by an orbiting companion can be described in terms of six astrometric orbital elements: in\naddition to e and tp , we have a, the semi-major axis of\nthe star's apparent orbit on the sky in units of arc; Ω,\nthe longitude of the ascending (approaching) node (measured as a position angle on the sky); i, the inclination\nof the orbit on the sky (such that i = 0 corresponds\nto a face-on, clockwise orbit); and ω∗ , the longitude of\nperiastron of the star's orbit.8\nThe Thiele-Innes constants are defined in terms four\nof the astrometric elements of the star's orbit about the\nsecondary:\n\n5\n\n(43)\n(44)\n(45)\n\na = (A cos ω∗ − F sin ω∗ ) cos Ω−\n(A sin ω∗ + F cos ω∗ ) sin Ω sec i\n\n(46)\n\nω = ω∗ + π\n\n(47)\n\nand\nwhere the quadrants of ω∗ −Ω and ω∗ +Ω are determined\nby the signs of the numerators in Eqs. 43 & 44. These\nrelations leave a ±π ambiguity in ω∗ , ω, and Ω that can\nonly be resolved by radial velocities, without which convention dictates that we choose the solution with Ω < π.\nThe Thiele-Innes constants C and H are closely related\nto the c and h constants of Eqs. 5 & 6. The set of six\nconstants have the identity\na2 = A2 + B 2 + C 2 = F 2 + G2 + H 2\n\n(48)\n\nIn astrometry there are five parameters that describe\na star's motion in the absence of orbiting companions:\n∆α0 cos δ and ∆δ0 , the difference between the true and\nnominal position of the system at t0 ; μα and μδ , the\nproper motions in the RA and Dec directions; and ̟, the\nparallax of the system. Our model for the astrometric\ndisplacement of a star due to parallax, proper motion,\nand a system of unseen planets in terms of the ThieleInnes constants at times ~τ is:\nPn\n∆δk =\nj=1 [Aj Xj,k + Fj Yj,k ]+\n(49)\n∆δ0 + ̟Πδ,k + μδ (τk − t0 )\nPn\n∆αk cos δ =\nj=1 [Bj Xj,k + Gj Yj,k ]+\n(50)\n∆α0 cos δ + ̟Πα,k + μα (τk − t0 )\nwhere X and Y are the so-called elliptical rectangular\ncoordinates, defined as\n\nThese constants can be quickly computed using rotation\nXj,k = cos Ej (τk ) − ej\n(51)\nq\nmatrices:\n2\n(52)\nYj,k = 1 − ej sin Ej (τk )\n\"\n#\nA\nB\nC\nF\nG\nH\n= aRz (ω∗ )Rx (i)Rz (Ω) where E is the eccentric anomaly and the quantities Πα,k\nand Πδ,k refer to the astrometric displacements due to\na sin i sin Ω −a sin i cos Ω a cos i\nparallax in the α and δ directions9 during observation\n(41)\n8 The orbital parameters of the star and those of the unseen\ncompanion are all identical except a, which differs by a factor of\nm/m∗ , and ω, which differs by π.\n\n9 In this paper the bare symbols α and δ will always refer to the\nnominal right ascension and declination of a star at t0 , absent the\neffects of parallax and astrometric displacement from companions.\n\n\f6\n\nWright & Howard\n\nk, which are given by [cite Supplement to Astronomical\nAlmanac here]:\n\nΠα,k = rx (τk ) sin α − ry (τk ) cos α\n\n(53)\n\nΠδ,k = (rx (τk ) cos α + ry (τk ) sin α) sin δ − rz (τk ) cos δ\n(54)\nHere (rx , ry , rz ) represent the Cartesian components in\nequatorial coordinates of the position of the observatory,\n~r, at time τ with respect to the Solar System barycenter\n(in units of AU when ̟ is in arcsec). These values for\nthe Earth are available from the NASA Jet Propulsion\nLaboratory Solar System ephimerides,10 but for μas and\nspaceborne work the precise position of the observatory\nitself is required.\nNote that since a is the apparent semi-major axis of the\nstar's orbit in units of arc, its relationship to the mass\nof the secondary depends on the method of astrometry\nused. For astrometric perturbations due to an unseen\nplanet, (that is, absolute astrometric displacements with\nrespect to the sidereal frame, as measured by SIM Lite)\nwe have from Kepler's Third Law\n\na3 =\n\n3\n\n3\n\n̟ m\nP2\n(m∗ + m)2\n\n(55)\n\nwhere a is measured in arcseconds when P is measured\nin years, ̟ is the parallax in arcseconds, and m is the\nmass of the unseen companion and m∗ is the mass of the\nstar in solar massses.11\nWe can now extend Eq.16 to the case of 2-D data by\ndefining our vector of N measurements taken at times ~τ :\n\n[∆δ1 , ∆δ2 . . . ∆δN , ∆α1 cos δ, ∆α2 cos δ . . . ∆αN cos δ]\n(56)\nand our model with linear parameters for n planets:\n\nβ~ = [A1 , B1 , F1 , G1 . . . An , Bn , Fn , Gn ,\n∆δ0 , ∆α0 cos δ, μδ , μα , ̟]\n10\n\n(57)\n\nhttp: //ssd.jpl.nasa.gov\nIn the case where the binary orbit is measured as a separation and position angle of one star with respect to another\n(i.e., relative astrometry) the measured separation is given by\na3 = ̟ 3 (m∗ + m)P 2 . The application of the techniques here for\nmultiple-planet systems with relative astrometry is not straightforward, and is beyond the scope of this manuscript.\n11\n\nand matrix F =\n\nX1,1\nX1,2\n0\n0\n\n Y\nY1,2\n\n1,1\n\n0\n0\n\n X2,1\nX2,2\n\n\n0\n0\n Y\nY2,2\n\n2,1\n\n0\n0\n\n\n.\n..\n..\n\n.\n\n Xn,1\nXn,2\n\n\n0\n0\n\nYn,2\n Yn,1\n\n0\n0\n\n\n1\n1\n\n\n0\n0\n\n τ1 − t0 τ2 − t0\n\n0\n0\nΠδ,1\nΠδ,2\n\n...\n...\n...\n...\n...\n...\n...\n...\n\nX1,N\n0\n0\n0\nX1,1\nX1,2\nY1,N\n0\n0\n0\nY1,1\nY1,2\nX2,N\n0\n0\n0\nX2,1\nX2,2\nY2,N\n0\n0\n0\nY2,1\nY2,2\n..\n..\n..\n.\n.\n.\nXn,N\n0\n0\n0\nXn,1\nXn,2\nYn,N\n0\n0\n0\nYn,1\nYn,2\n1\n0\n0\n0\n1\n1\nτN − t0\n0\n0\n0\nτ1 − t0 τ2 − t0\nΠδ,N\nΠα,1\nΠα,2\n\n...\n...\n...\n...\n...\n...\n...\n...\n\n0\n\nX1,N\n0\nY1,N\n0\nX2,N\n0\nY2,N\n..\n.\n...\n...\n0\n...\n. . . Xn,N\n...\n...\n0\n...\n. . . Yn,N\n...\n...\n0\n...\n...\n1\n...\n...\n0\n...\n. . . τN − t0\n...\n. . . Πα,N\n(58)\nThe nonzero components of dF/dx can be calculated\nfrom:\ndX\ndP\ndX\ndtp\ndX\nde\ndY\ndP\ndY\ndtp\ndY\nde\n\ndE\nsin E\ndP\ndE\n=−\nsin E\ndtp\ndE\n=−\nsin E − 1\nde\np\ndE\n= 1 − e2 cos E\ndP\np\ndE\n= 1 − e2 cos E\ndtp\np\ne sin E\ndE\n= 1 − e2 cos E\n−√\nde\n1 − e2\n=−\n\n(59)\n(60)\n(61)\n(62)\n(63)\n(64)\n\nand Eqs. 28–30.\n3.2. Astrometry in Arbitrary Coordinates\nAstrometry does not always deliver contemporaneous\n(∆α cos δ, ∆δ) pairs at a common time t. In the general\ncase, a baseline determines the 1-D displacement of a star\nfrom some reference at an intermediate position angle on\nthe sky (i.e., not necessarily 0 [as in the case for ∆δ] or\nπ/2 [as for ∆α cos δ]). We can combine Eqs. 49 & 50 to a\nmore general form to accommodate a heterogeneous set\nof such data :\nPn\nρθ,k =\nj=1 [(Aj Xj,k + Fj Yj,k ) cos θk +\n(Bj Xj,k + Gj Yjk ) sin θk ]+\n(∆δ0\n+ ̟Πδ,k + μδ (τk − t0 )) cos θk +\n(∆α0 cos δ + ̟Πα,k + μα (τk − t0 )) sin θk\n(65)\nwhere ρ is the separation and θ the position angle of the\nmeasurement.\nInterestingly, we could also use the other two ThieleInnes constants to achieve the same result by defining\na new linear parameter scheme where the astrometric\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\fFitting Keplerian Curves\ndisplacements are described as:\nPn\nρθ,k =\nj=1 [Hj Sj,k + Cj Tj,k ]+\n(∆δ0\n+ ̟Πδ,k + μδ (τk − t0 )) cos θk +\n(∆α0 cos δ + ̟Πα,k + μα (τk − t0 )) sin θk\n(66)\nwhere S and T are defined for the kth measurement and\njth planet as\n\u0015\n\u0014\nSj,k\n=\nT\nj,k\n\n\u0014\n\n\u0015\nXj,k\nYj,k\n(67)\nThis scheme uses only two linear parameters, instead of\nfour, per planet, and so will not be as efficient, but it\nis still useful because it can be easily combined with the\nradial velocity scheme of §2.2. We demonstrate this in\n§3.3 with a procedure that can accommodate any combination of radial velocity and astrometric data.\nWe can recover the parameters a and ω from the linear\nparameters C and H given the nonlinear parameter i by:\ncos(Ωj − θk ) csc ij − sin(Ωj − θk ) cot ij\n− sin(Ωj − θk ) cot ij − cos(Ωj − θk ) csc ij\n\na2j =\n\n\u0015\u0014\n\nCj2 + Hj2\n\nsin2 ij\n−Cj\ntan ωj =\n−Hj\n\n(68)\n(69)\n\nwhere ωj is chosen so sin ωj has the same sign as −Cj .\n3.3. Combining Astrometry with Radial Velocities\nCombining astrometric data with radial velocity\ndata is not as simple as combining the RV-only and\nastrometry-only schemes outlined above, because the six\nlinear parameters (A, B, F, G, and c and h) are a combination of only five Keplerian elements (K, a, Ω, ω, and\ni), and the problem is thus overconstrained. One solution would be to minimize χ2 subject to the appropriate\nconstraints using Lagrange multipliers, but the resulting\nset of nonlinear equations may not be guaranteed to have\na unique solution and would be difficult to solve for the\ncase of an arbitrary number of planets.\nAnother solution is to adapt the C and H constants to\naccommodate general astrometric data, and these constants are closely related to the scheme for RV data used\nin §2.2. To do this, we define our vector of measurements\nto be\n[~v , ρ\n~θ~]\n(70)\nwhere the velocities are taken at times ~t and the astrometry at times ~τ , and define our model, as in Eq. 16:\n~ = [H1 , C1 , H2 , C2 . . . Hn , Cn , v0 , d,\nβ\n∆δ0 , ∆α0 cos δ, μδ , μα , ̟]\n\n(71)\n\nFrom Eqs. 5, 6, 41, & 55 we have:\nhj = −λj Hj\ncj = λj Cj\n\n(72)\n(73)\n\nwhere we have introduced a λ, a combination of nonlinear\norbital parameters of planet j which has units of velocity\n\n7\n\nand has the value\nλj =\n\n2πAU\nq\n̟P\n ̃ j 1 − e2j\n\n(74)\n\nwhen the estimated parallax, ̟,\n ̃ is expressed in arcseconds.\nThe parameters Hj , Cj , and v0 can be transformed\ninto m3j /(m∗ + mj )2 , ωj , and γ with Eqs. 8–11 & 72–73.\nThe appearance of ̟ in the definition of λj (and therefore in Cj and Hj ) indicates a fundamental nonlinearity\nin the combined RV-astrometry problem: the parallax\nis not a truly linear parameter. However, because it is\nnearly linear, if a good estimate of the parallax is available then this can be used in the formula for λj (we indicate the approximate nature of the parallax term with a\ntilde). Once the parallax is solved for more precisely, the\nfit can be re-run with an improved estimate of ̟. This\nprocedure should converge very quickly, and we will use\nit again to deal with other, smaller nonlinear terms in\n§4.\nThe first columns of the F matrix, corresponding to\nthe radial velocity measurements, now read\n\n\n− cos f1,1 λ1 − cos f1,2 λ1\n sin f1,1 λ1\nsin f λ\n − cos f λ − cos f1,2 λ1\n\n2,1 2\n2,2 2\n sin f2,1 λ2\nsin f2,2 λ2\n\n\n..\n..\n\n.\n.\n\n − cos fn,1 λn − cos fn,2 λn\n\n sin fn,1 λn\nsin fn,2 λn\n\n1\n1\n\n\nt1 − t0\nt2 − t0\n\n\n0\n0\n\n\n0\n0\n\n0\n0\n\n\n0\n0\n0\n0\n\n...\n...\n...\n...\n...\n...\n...\n...\n...\n...\n...\n...\n...\n\n(75)\n\nand the rest of the columns, corresponding to the astrometric measurements, read\nS1,1\nS1,2\nT1,1\nT1,2\nS2,1\nS2,2\nT2,1\nT2,2\n..\n..\n.\n.\nSn,1\nSn,2\nTn,1\nTn,2\n0\n0\n0\n0\ncos θ1\ncos θ2\nsin θ1\nsin θ2\n(τ1 − t0 ) cos θ1\n(τ2 − t0 ) cos θ2\n(τ1 − t0 ) sin θ1\n(τ2 − t0 ) sin θ2\nΠδ,1 cos θ1 + Πα,1 sin θ1 Πδ,2 cos θ2 + Πα,2 sin θ2\n\n...\n...\n...\n...\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n...\n...\n...\n...\n...\n...\n...\n...\n...\n(76)\nFor the nonlinear parameters Pj , Tp,j , and ej , the two\nnonzero rows of dF/dx can be calculated from:\n\n\f8\n\nWright & Howard\n\nd\ndλ\n( cos f (t)λ) = − sin f (t)f ′ (t)λ + cos f (t)\n(77)\ndx\ndx\ndλ\nd\n(− sin f (t)λ) = − cos f (t)f ′ (t)λ − sin f (t)\n(78)\ndx\ndx\nwhere\ndλ\nλ\n=−\ndP\nP\neλ\ndλ\n=\nde 1 − e2\ndλ\ndλ dλ\n=0\n=\n=\ndΩ\ndi dtp\n\n(79)\n(80)\n(81)\n\nand\n\u0014\n\ndS/dx\ndT /dx\n\n\u0015\n\n\u0014\n\ncos(Ω − θ) csc i − sin(Ω − θ) cot i\n− sin(Ω − θ) cot i − cos(Ω − θ) csc i\n\n\u0014\n\ndS/dΩ\ndT /dΩ\n\n\u0014\n\n− sin(Ω − θ) csc i − cos(Ω − θ) cot i\n− cos(Ω − θ) cot i\nsin(Ω − θ) csc i\n\n=\n\u0015\u0014\n\ndX/dx\ndY /dx\n\n\u0015\u0014\n\nX\nY\n\n\u0015\n\n(82)\nand Eqs. 27–34, 59–64. Now we have introduced two\nadditional nonlinear parameters, Ω and i.\n\u0015\n\n=\n(83)\n\u0015\n\np̂ = [cos α cos δ, sin α cos δ, sin δ]\n\nα̂ = [0, 0, 1] × p̂\n\n\u0014\n\ndS/di\ndT /di\n\n\u0014\n\n− cos(Ω − θ) csc i cot i sin(Ω − θ) csc2 i\nsin(Ω − θ) csc2 i\ncos(Ω − θ) csc i cot i\n\n(88)\n\nthen the unit vectors pointing east and north are given\nby\n\nand\n\u0015\n\nwhere, vr is the bulk radial velocity of the star,12 D is\nthe star's distance13 and μ is the total proper motion\nin radians per unit time. This term will be absorbed\ninto the linear parameter d, if present, and so could be\nignored.\nParallax changes - The change in parallax of nearby\nstars due to their radial velocity may be of order 0.3\nμas/yr. The shape of the parallactic motion is also a\nfunction of position on the sky, and thus of the proper\nmotion. These changes can be of order 5 μas/yr. The\nradial velocity term is given by:\nvr\n̟\n ̇ = −̟\n(86)\nD\nProper motion changes - The flip side of secular acceleration is proper motion change due to change in distance. This effect can be of order 3 μas/yr and is given\nby:\nvr\n(87)\n~μ ̇ = −~μ\nD\nCurvilinear effects - The curvilinear nature of spherical coordinates can produce what are essentially nonlinear terms depending on how astrometric displacements\nare defined. These effects are on the same order as the\nabove proper motion changes, and more pronounced near\nthe poles. For μas astrometry, it suffices to handle these\neffects by employing a rectilinear grid:\nIn this work, astrometric displacements labeled\n∆α cos δ and ∆δ do not strictly refer to changes in the\nright ascension and declination of the star, but refer to\ndisplacements along rectilinear axes along those dimensions at the nominal position of the star. That is, if the\nunit vector pointing to the nominal position of the star\nfrom the Solar System barycenter is defined:\n\nδ̂ = p̂ × α̂\n\n=\n\n(89)\n(90)\n\nand the astrometric displacements are given by\n\u0015\u0014\n\n\u0015\nX\nY\n(84)\n\n4. NONLINEAR TERMS\n4.1. Sources of Nonlinearity\nThere are several small nonlinear terms which are important at the m/s and μas level, especially for the\nnearby and high-proper motion stars likely to be observed by SIM Lite.\nSecular acceleration - A star with significant proper\nmotion will have the radial component of its space velocity change with position on the sky, resulting in a\nsecular change in the radial velocity up to ∼1 m/s/yr for\nthe most extreme cases. Secular acceleration is given, to\nfirst order, by:\n\nv̇r = Dμ2\n\n(85)\n\n∆δ ≡ p̂′ * δ̂\n∆α cos δ ≡ p̂′ * α̂\n\n(91)\n(92)\n\nwhere p̂′ is the displaced position of the star and δ̂ and\nα̂ are constant.\nInterferomteric cross terms - The 1-D interferometric\nmeasurement of astrometric displacement on the sky may\nbe complicated by the motion of the reference and target\nstars. That is, the calculation of θ in Eq. 65 may require\nproper motion advanced or parallax corrected positions\nin a manner specific to the details of a particular instrument's measurement of θ. These cross terms are likely\n12 This quantity v defines the true radial velocity of the system\nr\nwith respect to the Solar System barycenter. It differs from the\nspectroscopic parameter γ in that the latter is often measured with\nrespect to a fiducial frame and can include non-Doppler effects\nsuch as instrumental offsets, gravitational redshift, and convective\nblueshift.\n13 D is distinguished here from the inverse parallax ̟ −1 simply\nfor convenience of units.\n\n\fFitting Keplerian Curves\nto be small, and so they can estimated and refined in the\nsame manner as the other nonlinear terms, if necessary.\nRV-astrometry cross terms - The RV semi-amplitude\nK is related to the astrometric semi-major axis, a, by\nthe parallax, and so ̟ is not strictly a linear parameter\nin the combined astrometry-RV problem. This effect can\nbe large if the parallax is small or not known, and should\nnot be ignored for any system.\nRelativistic Terms - Gravitational deflection by Solar\nSystem objects and relativistic stellar aberration produce\nlarge, time dependent astrometric displacements that depend on the position of the star, and are therefore slightly\nnonlinear. Because these displacements can be calculated to better than μas precision given an estimate of\nthe star's true position to arcsecond precision, these effects are ignored here.\n4.2. Incorporating Nonlinear Terms\nImplementing these small nonlinear effects in our\nmodel requires good estimates of the astrometric parameters (when astrometric data is available, these parameters can be estimated from a first-pass solution assuming\nno planetary companions). The system is then solved using these estimates to calculate the second-order terms\nabove. Below, we indicate these estimated astrometric\nparameters with a tilde to distinguish them from the\nsolved parameters. These estimates can then be iteratively refined if necessary, but convergence should be\nvery fast for SIM Lite data.\nWe can include these nonlinear terms by making the\nfollowing substitutions to the bottom 3 rows of the matrix F in Eqs. 58 & 76:\n\u0013\n\u0012\nvr\n(τk − t0 )\n(93)\nτk − t0 → 1 − (τk − t0 )\n2D̃\n\u0012\n\u0013\nvr\nΠα,k → 1 − (τk − t0 )\nΠα,k\n(94)\nD̃\n\u0013\n\u0012\nvr\nΠδ,k\n(95)\nΠδ,k → 1 − (τk − t0 )\nD̃\nand in the definitions of Πk (Eqs. 53 & 54):\n ̃ 0 cos δ + (τk − t0 )μ ̃α )~r * p̂ (96)\nΠα,k → Πα,k + (∆α\n ̃ 0 + (τk − t0 )μ ̃δ )~r * p̂ (97)\nΠδ,k → Πδ,k + (\n∆δ\n\nwhere the quantities in parentheses have units of radians.\n ̃ 0 will likely be zero\n ̃ 0 cos δ and ∆δ\nThe estimated terms ∆α\nat first, but may be iteratively refined with the other\nestimated parameters.\nFinally, the secular acceleration can be accommodated\nby simply subtracting off the appropriate, approximate\nlinear trend to the RV data, or, if the trend parameter is\npresent, allowing it to be absorbed in d.\nThis procedure of estimating and refining linear astrometric terms will also work for the nonlinear term introduced by the appearance of ̟ in H and C in Eqs. 72 &\n72. Alternatively, the parallax can be treated as a nonlinear parameter from the outset and eliminated from the\n~ entirely.\nlinear coefficients in β\n5. IMPLEMENTATION\n\n5.1. Public code\n\n9\n\nWe have implemented these algorithms into a set of\nIDL software routines which we have made available publicly for the fitting of radial velocity data.14 The software package includes RVLIN, the user-defined function\nthat may be passed to MPFIT, and RV FIT MP, a \"wrapper\" routine that employs MPFIT to fit a multi-planet\nKeplerian model to a user-supplied set of radial velocity data. We anticipate maintaining and improving this\npackage, and eventually incorporating astrometric and\ntransit data analysis. This code, or components of it,\nare currently used by members of the California Planet\nSearch. Below, we discuss our software package's performance.\n5.2. Speed-up From the Use of Explicit Derivatives\nThe use of explicit derivatives above in an LM code\nsignificantly speeds up the algorithm by avoiding unnecessary calculation of numerical derivatives. To quantify\nthis improvement, we tested two cases with published RV\ndata, the 2-planet system HD 217107 (Vogt et al. 2005)\nand the 5-planet system 55 Cnc (Fischer et al. 2008) (in\nboth cases assuming no jitter). We combined the Lick\nand Keck RV data sets for both cases, solving for all\n5n + 2 parameters (including the RV offset between the\ntwo telescopes). We ran over 2,500 trials, where in each\ntrial we started the search with different initial guesses\nfor the orbital elements, each randomly drawn from a\nnormal distribution with a width given by the uncertainty in each parameter and centered on its best-fit\nvalue.15 We compared the total time taken for these\ntrials on a 2.6 GHz Intel Core 2 Duo MacBook Pro running IDL 7.0 using explicit derivatives to the time taken\non the same machine with same initial guesses using numerical derivatives.\nIn the case of HD 217107, the use of explicit derivatives\nsped up the calculation by a factor of 2.3. The improvement in the case of 55 Cnc was even larger, a factor of\n4. The total number of steps taken by MPFIT to converge\non a solution was similar in the cases with and without\nexplicit derivatives, indicating that our step sizes for the\nnumeric derivatives were well chosen.\n5.3. Convergence Benefits of Exploiting Linear\nParameters\nWe employed a custom version of the multi-planet\nfitting routine often employed by the California and\nCarnegie Planet search as a baseline to test the improvement in convergence of the algorithm described in this\nwork. This routine, which derives from code described\nin Marcy & Butler (1992) and Valenti, Butler, & Marcy\n(1995), is essentially an LM algorithm for searching all\n5n + 1 parameters with carefully chosen step-sizes for\nnumerical derivatives.16\nUsing the same hardware described above, we again\nfit the Fischer et al. (2008) 55 Cnc RV data from two\n14\n\nAvailable at http://exoplanets.org/code/\nAlthough dynamical fits are more precise, here we are only\nconcerned with the algorithm's convergence in the region of the\nglobal χ2 minimum for a purely Keplerian fit. The initial guesses\nfor the parameters in this and the test in § 5.3 were thus drawn\nnear their values at this (presumed) global minimum.\n16 That is to say, the only significant differences between the\nbaseline code and the code described in § 5.1 is the exploitation of\nlinear parameters.\n15\n\n\f10\n\nWright & Howard\n\nFraction of fits successful\n\n1.2\n1.0\n\nLinear Fit (Explicit Derivatives)\nLinear Fit (Numerical Derivatives)\nFully Nonlinear Fit (15 Pars Varied)\nFully Nonlinear Fit (25 Pars Varied)\n\n0.8\n0.6\n0.4\n0.2\n0.0\n0\n2\n4\n6\n8\n10\nDeviation of Initial Guesses From Best Fit (σ)\n\nFig. 1.- Sensitivity of RV-only fitting algorithms to initial guesses on the 5-planet, two-telescope RV data for 55 Cnc\n(Fischer et al. 2008). Initial guesses to four fitting routines were\nrandomly varied from their best-fit values by various factors of their\nrespective uncertainties. The linear parameter fitting algorithm\ndescribed in this work converged on the best solution for a wide\nrange of initial guesses, including ∼ 50% of cases with guesses 10σ\nfrom nominal. A full, 26-parameter nonlinear fit required guesses\nwithin 1.5-σ of the best-fit value, or within 2σ if only the 15 truly\nnonlinear parameters were varied.\n\ntelescopes. We drew the initial guesses for every parameter from normal distributions centered on the Keplerian best-fit values and with width given by sσx , where\nσx is the parameter uncertainty quoted in Fischer et al.\n(2008) and s is a scale factor. We varied s smoothly\nfrom 0 (where the initial guesses were the best-fit values\nexactly) to 10 (where every parameter is independently,\nrandomly altered by 10σx ) over 4000 trials.\nWe did not attempt to fit for the telescope offset at\neach trial, as this particular routine was not optimized\nfor such a task. We also did not vary the γ parameter\nfrom its best-fit value (though we did fit for it), as no\nuncertainties were given for γ in Fischer et al. (2008).\nWe compared the results of this custom code to our\nLM code employing linear parameters (§5.1) with both\nexplicit and numerical derivatives. In some sense, this\nis not a fair test since the linear parameter models do\nnot require or accept initial guesses for K and ω, and\nthus the initial guesses are closer to the best-fit values\n(since they differ in only 15 dimensions space, whereas\nthe guesses for the nonlinear routine they differ in 25 dimensions.) We thus also ran an additional test, where\nthe fully-nonlinear routine was provided the best-fit values for K and ω for each planet, and thus had only 15\nparameters varied (but still had all 26 parameters to fit).\nWith this exception, we provided the same initial guesses\nto each of the four schemes in each trial.\nWe recorded the final χ2 reported by each routine for\neach trial and compared this with χ2min , the best-fit value.\nWe deemed any trial for which (χ2 − χ2min ) < 2 to be a\n\"successful\" convergence on the correct parameters.17 At\neach tested value of s, we weighted the full set of trials\nby a Gaussian window 75 trials wide (corresponding to\n∼ 0.19σ) and calculated the fraction on trials that were\nsuccessful.\nIn Figure 1 we plot the fraction of successful tests as\n17 χ2\nmin ∼ 2910. Our results are only weakly sensitive to the\nprecise definition of \"successful\"\n\na function of s. The use of numerical derivatives had no\noverall effect on the convergence of the linear pramater\nroutine, but was slower, on average, by a factor of 4.\nEven with initial guesses 10σx from the best-fit values\nin all 15 parameters, the linear parameter routine found\nthe global minimum of χ2 in roughly half of all trials.\nThe fully-nonlinear routine, searching a 26-dimensional\nspace, required much better initial guesses to achieve convergence. With the same 15 parameters varied, fits with\ninitial parameters off by 3σx had only a 20% chance of\nproperly converging. With all 25 orbital parameters varied, the initial guesses had to be within 1.5-σx of their\nproper value to have a 50% chance of convergence. With\n26 dimensions to search, there are many wrong paths\nfor the LM algorithm to follow away from the global χ2\nminimum.\n6. CONCLUSIONS\n\nApplying linear parameters to the problem of fitting Keplerian curves to radial velocity and astrometry\ndata significantly improves the efficiency and reliability\nof multi-planet Keplerian fitting routines. This technique can be applied to many methods of searching this\ncomplex, nonlinear, multi-parameter χ2 space, including\nthe Levenberg-Marquardt method, Markov chain Monte\nCarlo algorithms, and brute force approaches. Table 1\nsummarizes the various schemes used in this work.\nWe have identified the nonlinear terms relevant for μas\nastrometry and m/s radial velocity work (such as that\nby SIM Lite and its supporting RV data), and shown\nhow to incorporate these terms into a linear parameter\nscheme. In §2.4 we have provided analytic forms for explicit derivatives relevant to various applications of the\nKepler problem.\nIn the case of RV-only data, use of explicit derivatives\ncan speed up a fitting routine by a factor of 2–4, depending on the number of planets being fit. Use of linear\nparameters greatly improves the convergence properties\nof a multi-planet fitting routine. In the case of an actual 5-planet fit, a linear parameter model requires initial guesses within 10σx of their correct values in only 15\nparameters to have a 50% chance of convergence, while\na full, 26-parameter search requires all 26 parameters to\nbe specified within 1.5-σx .\nThe principle improvement from use of linear parameters comes from reducing the search space for an n-planet\nmodel. In the case of RV fitting, the reduction is from\nexploiting the linearity of 2n + 1 of the 5n + 1 fitted parameters, leaving only 3n nonlinear parameters to be fit\nalgorithmically. The problem of fitting astrometric orbits can be similarly treated by exploiting the linearity\nof 4n + 5 of the 7n + 5 parameters, leaving, again, only\n3n nonlinear parameters to be with a nonlinear fitting\nroutine. When combining RV and astrometric data, as\nwill be the case for SIM Lite, only 2n + 6 of the 7n + 6\nmodel parameters are usefully linear under the scheme\ndescribed here, leaving 5n nonlinear parameters.\nWe have derived a general expression for the explicit\nmodel derivatives for models employing linear parameters in nonlinear fits, appropriate for application in the\nLM method. This result is general and can be applied to\nproblems beyond Keplerian fitting – indeed to any model\nwith both linear and nonlinear parameters.\n\n\fFitting Keplerian Curves\nEric Agol inspired §2 by pointing out how to exploit\nthe linear parameters in the problem of RV fitting in the\ncontext of MPFIT. He has provided substantial guidance\nand ideas for this and future versions of our code. We\nthank him, Eric Ford, Matthew Muterspaugh, Tom Loredoo, and Alessandro Sozzetti for careful readings of this\nmanuscript and their many substantive and constructive\nsuggestions.\nOur membership on a SIM Planet-Finding Astrometry Analysis Team (PI Matthew Muterspaugh) motivated §§3 & 4 of this work, and we are grateful to all of\nthe Teams involved for their efforts and insights into the\n\n11\n\nproblem. We thank Jeff Valenti and Nikolai Piskunov for\nencouraging us to calculate the explicit derivatives for a\ngeneral linear least-squares problem. Nikolai Piskunov\nprovided insight into the sources of instability in the\nLM search algorithm. Matthew Muterspaugh provided\nguidance with the problem of fitting astrometric orbits\nand understanding the small astrometric cross terms.\nWe thank Martin Sirk, Sam Halverson, and John Asher\nJohnson for their work employing and debugging various\nversions of our code. J.T.W received support from NSF\ngrant AST-0504874, and A.W.H. received support from\nNASA contract NAS7-03001 (JPL#1336910).\n\nREFERENCES\nBakos, G. Á., Torres, G., Pál, A., Hartman, J., Kovács, G.,\nNoyes, R. W., Latham, D. W., Sasselov, D. D., Sipőcz, B.,\nEsquerdo, G. A., Fischer, D. A., Johnson, J. A., Marcy, G. W.,\nButler, R. P., Isaacson, H., Howard, A., Vogt, S., Kovács, G.,\nFernandez, J., Moór, A., Stefanik, R. P., Lázár, J., Papp, I., &\nSári, P. 2009, arXiv:0901.0282v1\nBalan, S. T., & Lahav, O. 2008, ArXiv 0805.3532, 805\nBinnendijk, L. 1960. Properties of double stars; a survey of\nparallaxes and orbits., Philadelphia, University of Pennsylvania\nPress [1960]\nButler, R. P., Wright, J. T., Marcy, G. W., Fischer, D. A., Vogt,\nS. S., Tinney, C. G., Jones, H. R. A., Carter, B. D., Johnson,\nJ. A., McCarthy, C., & Penny, A. J. 2006, ApJ, 646, 505–522\nCasertano, S., Lattanzi, M. G., Sozzetti, A., Spagna, A., Jancart,\nS., Morbidelli, R., Pannunzio, R., Pourbaix, D., & Queloz, D.\n2008, A&A, 482, 699–729\nCatanzarite, J., Law, N., & Shao, M. 2008, ArXiv e-prints, 807\nCatanzarite, J., Zhai, C., & Shao, M. 2009, In American\nAstronomical Society Meeting Abstracts, volume 213 of\nAmerican Astronomical Society Meeting Abstracts, pp.\n456.03–+\nCumming, A., Marcy, G. W., Butler, R. P., & Vogt, S. S. 2003, In\nASP Conf. Ser. 294: Scientific Frontiers in Research on\nExtrasolar Planets, pp. 27–30\nDriscoll, P., & Fischer, D. 2005, In Bulletin of the American\nAstronomical Society, volume 37 of Bulletin of the American\nAstronomical Society, pp. 1269–+\nEriksson, U., & Lindegren, L. 2007, A&A, 476, 1389–1400\nFischer, D. A., Marcy, G. W., Butler, R. P., Vogt, S. S., Laughlin,\nG., Henry, G. W., Abouav, D., Peek, K. M. G., Wright, J. T.,\nJohnson, J. A., McCarthy, C., & Isaacson, H. 2008, ApJ, 675,\n790–801\nFord, E. B. 2004, In The Search for Other Worlds, S. S. Holt and\nD. Deming, eds., volume 713 of American Institute of Physics\nConference Series, pp. 27–30\n\nFord, E. B. 2008, AJ, 135, 1008–1020\nHastings, W. 1970, Biometrika, 57\nKonacki, M., & Maciejewski, A. J. 1999, ApJ, 518, 442–449\nKonacki, M., Maciejewski, A. J., & Wolszczan, A. 2002, ApJ, 567,\n566–578\nLevenberg, K. 1944, Quart. Appl. Math., 2, 164–168\nMarcy, G. W., & Butler, R. P. 1992, PASP, 104, 270–277\nMarkwardt, C. B. 2009, ArXiv 0902.2850\nMarquardt, D. 1963, SIAM J. Appl. Math., 11, 431–441\nMetropolis, N., Rosenbluth, A. W., Rosenbluth, M. N., Teller,\nA. H., & Teller, E. 1953, Journal of Chemical Physics, 21,\n1087–1092\nPress, W. H., Teukolsky, S. A., Vetterling, W. T., & Flannery,\nB. P. 1992. Numerical recipes in FORTRAN. The art of\nscientific computing, Cambridge: University Press, -c1992,\n2nd ed.\nScargle, J. D. 1982, ApJ, 263, 835–853\nSozzetti, A. 2005, PASP, 117, 1021–1048\nValenti, J. A., Butler, R. P., & Marcy, G. W. 1995, PASP, 107,\n966–+\nVogt, S. S., Butler, R. P., Marcy, G. W., Fischer, D. A., Henry,\nG. W., Laughlin, G., Wright, J. T., & Johnson, J. A. 2005,\nApJ, 632, 638–658\nWright, J. T., Marcy, G. W., Fischer, D. A., Butler, R. P., Vogt,\nS. S., Tinney, C. G., Jones, H. R. A., Carter, B. D., Johnson,\nJ. A., McCarthy, C., & Apps, K. 2007, ApJ, 657, 533–545\nWright, J. T., Upadhyay, S., Marcy, G. W., Fischer, D. A., Ford,\nE. B., & Johnson, J. A. 2009, ApJ, 693, 1084–1099\n\n\f12\n\nWright & Howard\nTABLE 1\nSummary of Linearization Schemes\n\nInputs\nNonlinear parameters\nTransformed linear parameters\nLinear parameters\n\nRadial Velocities\n\nAstrometry\n\nRadial Velocities\n& Astrometry\n\n~\nv (~t), μ̃, ̟,\n ̃\nPj , tp,j , ej\n\n~ τ ), ∆δ(~\n~ τ ), μ ̃α , μ ̃δ , vr , ̟\n∆α(~\n ̃\nPj , tp,j , ej\n\n~\nv (~t), ρ\n~θ~ (~\nτ ), μ ̃α , μ ̃δ , vr , ̟\n ̃\nPj , tp,j , ej , Ωj , ij\n\ncj , hj , v0 → ωj , Kj , γ\nd\n\nAj , Bj , Fj , Gj → ωj , Ωj , ij , aj\n∆δ0 , ∆α0 , μδ , μα , ̟\n\nj\nCj , Hj , v0 → ωj , (m +m\n2,γ\n∗\nj)\nd, ∆δ0 , ∆α0 , μδ , μα , ̟\n\nm3\n\nNote. - The transformed linear parameters v0 and γ and all of the linear parameters appear once per system. The subscript\nj on the other parameters indicates that there are n such parameters, one for each companion in the system.\n\n\fFitting Keplerian Curves\n\n13\n\nTABLE 2\nVariables and symbols used in this manuscript\nSymbol\n\nMeaning\n\nExample equation\n\n ̃\n\nA tilde indicates a first approximation as opposed to a fitted parameter\nThiele-Innes constants\nAstrometric semi-major axis of a star's orbit in units of arc\nNominal right ascension of a system at the epoch of observations, t0\nConstant unit east vector\nVector of linear parameters\nLinear parameter in RV fitting corresponding to a component of a planet's RV signature\nLinear parameter in RV fitting corresponding to an RV trend\nDistance to a system\nMeasured astrometric displacements in units of arc in the α̂ and δ̂ directions\nNominal declination of a system at the epoch of observations, t0\nConstant unit north vector\nKronecker delta\nConstant (and often instrument dependent) offset in a set of RV data\nEccentric anomaly of a planet (a function of time)\nEccentricity of a planet\n~\nMatrix defined such that the model ~\nu = βF\nTrue anomaly of a planet (a function of time)\nPosition angle of astrometric displacement such that θ = 0 refers to ∆δ\nLinear parameter in RV fitting corresponding to a component of a planet's RV signature\nInclination of a planet's orbit with respect to the sky\nSubscript indicating a quantity corresponds to the jth planet\nRV semi-amplitude of a star's orbit due to planet\nSubscript indicating a quantity corresponds to the kth observation\nA combination of nonlinear orbital parameters\nMean anomaly\nMass of the primary component of a binary or planetary system\nMass of a smaller component of a binary or planetary system\nProper motion. The total proper motion is given by μ2 = μ2α + μ2δ\nNumber of planets in a system\nNumber of observations being fit\nThe statistic\nPeriod of a planet\nUnit nominal position vector of a star in barycentric equatorial coordinates\nFunctions (of time and ~\nr ) describing unit parallactic motion\nThe mathematical constant\nParallax of a system\nThe 3-D rotation matrix about the x- or z-axis.\nObservatory position in barycentric equatorial coordinates (a function of time)\nMeasured astrometric displacement in the direction of position angle θ\nScale of random deviation of initial guesses from nominal in units of σx\nAstrometric terms in the F matrix\nMeasurement uncertainty\nUncertainty in an orbital parameter, x\nTime of a radial velocity observation\nFiducial time at the epoch of the observations\nTime of periastron passage of a planet\nTime of an astrometric observation\nModel values, such as velocities or astrometric displacements\nMeasured radial velocities\nLinear parameter corresponding to a constant offset in a set of RV data\nRadial velocity of a system's barycenter with respect to Solar System barycenter\nDiagonal matrix containing weights of measured data\nElliptical rectangular coordinates of a planet (functions of time)\nAs a variable, can stand for any parameter, such as Pj , tp,j , or ej\nPosition angle of the ascending (approaching) node of a planet\nArgument of periastron of a planet's orbit\nArgument of periastron of a star's orbit due to a planet. ω = ω∗ + π\n\n93\n41\n55\n\nA, B, C, F, G, H\na\nα\nα̂\n~\nβ\nc\nd\nD\n∆α cos δ, ∆δ\nδ\nδ̂\nδkl\nγ\nE\ne\nF\nf\nθ\nh\ni\nj\nK\nk\nλ\nM\nm∗\nm\nμ, μα , μδ\nn\nN\nχ2\nP\np̂\nΠα , Πδ\nπ\n̟\nRx (ω), Rz (ω)\n~\nr , rx , ry , rz\nρθ\ns\nS, T\nσ\nσx\nt\nt0\ntp\nτ\nu\nv\nv0\nvr\nW\nX, Y\nx\nΩ\nω\nω∗\n\n89\n12\n6\n6\n93\n49 & 50\n90\n17\n1\n2\n1\n15 & 58\n2\n42\n5\n41\n1\n1\n14\n72\n3\n55\n55\n58\n1\n15\n14\n3\n88\n53 & 54\n55 & 58\n42\n53 & 54\n65\n§5.3\n67\n14 & 17\n14 & 17\n1\n93\n3\n56, 58\n1 & 16\n14\n7\n85\n17\n51 & 52\n21\n41\n1\n41\n\n\f"}