{"id": "http://arxiv.org/abs/0803.2001v3", "guidislink": true, "updated": "2008-08-20T13:10:50Z", "updated_parsed": [2008, 8, 20, 13, 10, 50, 2, 233, 0], "published": "2008-03-13T16:33:19Z", "published_parsed": [2008, 3, 13, 16, 33, 19, 3, 73, 0], "title": "Canonical quantization of gauge fields in static space-times with\n  applications to Rindler spaces", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0803.0691%2C0803.0034%2C0803.0581%2C0803.2117%2C0803.0929%2C0803.2438%2C0803.3237%2C0803.3500%2C0803.0015%2C0803.0848%2C0803.3851%2C0803.0289%2C0803.3769%2C0803.2602%2C0803.0036%2C0803.2397%2C0803.4229%2C0803.2001%2C0803.3478%2C0803.0138%2C0803.3828%2C0803.2475%2C0803.2144%2C0803.3976%2C0803.3055%2C0803.2293%2C0803.2416%2C0803.1173%2C0803.2310%2C0803.2658%2C0803.0980%2C0803.3110%2C0803.2202%2C0803.2181%2C0803.0451%2C0803.2084%2C0803.3101%2C0803.2847%2C0803.0316%2C0803.3258%2C0803.3420%2C0803.3137%2C0803.3612%2C0803.3635%2C0803.2686%2C0803.1111%2C0803.3075%2C0803.1511%2C0803.0133%2C0803.1743%2C0803.1827%2C0803.0531%2C0803.0999%2C0803.3113%2C0803.3898%2C0803.0013%2C0803.3870%2C0803.2008%2C0803.0370%2C0803.0315%2C0803.1240%2C0803.3095%2C0803.0771%2C0803.2090%2C0803.0570%2C0803.3414%2C0803.2225%2C0803.0652%2C0803.3887%2C0803.2262%2C0803.2824%2C0803.3974%2C0803.1248%2C0803.0953%2C0803.3438%2C0803.0579%2C0803.0835%2C0803.3878%2C0803.2379%2C0803.3618%2C0803.3069%2C0803.3566%2C0803.1352%2C0803.1948%2C0803.3591%2C0803.3576%2C0803.2919%2C0803.1757%2C0803.0445%2C0803.2440%2C0803.2056%2C0803.2651%2C0803.3914%2C0803.1737%2C0803.3453%2C0803.0904%2C0803.3394%2C0803.2795%2C0803.3957%2C0803.1335%2C0803.3389&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Canonical quantization of gauge fields in static space-times with\n  applications to Rindler spaces"}, "summary": "The canonical quantization in Weyl gauge of gauge fields in static\nspace-times is presented. With an appropriate definition of transverse and\nlongitudinal components of gauge fields, the Gauss law constraint is resolved\nexplicitly for scalar and spinor QED and a complete non-perturbative solution\nis given for the quantized Maxwell-field coupled to external currents. The\nformalism is applied in investigations of the electromagnetic field in Rindler\nspaces. The relation of creation and annihilation operators in Minkowski and\nRindler spaces is established and initial value problems associated with\nbremsstrahlung of a uniformly accelerated charge are studied. The peculiar\nscaling properties of scalar and gauge theories in Rindler spaces are discussed\nand various quantities such as the photon condensate or the interaction energy\nof static charges and of scalar sources are computed.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0803.0691%2C0803.0034%2C0803.0581%2C0803.2117%2C0803.0929%2C0803.2438%2C0803.3237%2C0803.3500%2C0803.0015%2C0803.0848%2C0803.3851%2C0803.0289%2C0803.3769%2C0803.2602%2C0803.0036%2C0803.2397%2C0803.4229%2C0803.2001%2C0803.3478%2C0803.0138%2C0803.3828%2C0803.2475%2C0803.2144%2C0803.3976%2C0803.3055%2C0803.2293%2C0803.2416%2C0803.1173%2C0803.2310%2C0803.2658%2C0803.0980%2C0803.3110%2C0803.2202%2C0803.2181%2C0803.0451%2C0803.2084%2C0803.3101%2C0803.2847%2C0803.0316%2C0803.3258%2C0803.3420%2C0803.3137%2C0803.3612%2C0803.3635%2C0803.2686%2C0803.1111%2C0803.3075%2C0803.1511%2C0803.0133%2C0803.1743%2C0803.1827%2C0803.0531%2C0803.0999%2C0803.3113%2C0803.3898%2C0803.0013%2C0803.3870%2C0803.2008%2C0803.0370%2C0803.0315%2C0803.1240%2C0803.3095%2C0803.0771%2C0803.2090%2C0803.0570%2C0803.3414%2C0803.2225%2C0803.0652%2C0803.3887%2C0803.2262%2C0803.2824%2C0803.3974%2C0803.1248%2C0803.0953%2C0803.3438%2C0803.0579%2C0803.0835%2C0803.3878%2C0803.2379%2C0803.3618%2C0803.3069%2C0803.3566%2C0803.1352%2C0803.1948%2C0803.3591%2C0803.3576%2C0803.2919%2C0803.1757%2C0803.0445%2C0803.2440%2C0803.2056%2C0803.2651%2C0803.3914%2C0803.1737%2C0803.3453%2C0803.0904%2C0803.3394%2C0803.2795%2C0803.3957%2C0803.1335%2C0803.3389&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The canonical quantization in Weyl gauge of gauge fields in static\nspace-times is presented. With an appropriate definition of transverse and\nlongitudinal components of gauge fields, the Gauss law constraint is resolved\nexplicitly for scalar and spinor QED and a complete non-perturbative solution\nis given for the quantized Maxwell-field coupled to external currents. The\nformalism is applied in investigations of the electromagnetic field in Rindler\nspaces. The relation of creation and annihilation operators in Minkowski and\nRindler spaces is established and initial value problems associated with\nbremsstrahlung of a uniformly accelerated charge are studied. The peculiar\nscaling properties of scalar and gauge theories in Rindler spaces are discussed\nand various quantities such as the photon condensate or the interaction energy\nof static charges and of scalar sources are computed."}, "authors": ["F. Lenz", "K. Ohta", "K. Yazaki"], "author_detail": {"name": "K. Yazaki"}, "author": "K. Yazaki", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevD.78.065026", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0803.2001v3", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0803.2001v3", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "Extended Sec. IV F and minor corrections", "arxiv_primary_category": {"term": "hep-th", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "hep-th", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "gr-qc", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0803.2001v3", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0803.2001v3", "journal_reference": "Phys.Rev.D78:065026,2008", "doi": "10.1103/PhysRevD.78.065026", "fulltext": "FAU-TP3-08-02\n\nCanonical quantization of gauge fields in static space-times with\napplications to Rindler spaces\nF. Lenz a ,∗ K. Ohta b ,† and K. Yazaki\n\nc‡\n\narXiv:0803.2001v3 [hep-th] 20 Aug 2008\n\na\n\nInstitute for Theoretical Physics III\nUniversity of Erlangen-Nürnberg\nStaudstrasse 7, 91058 Erlangen, Germany\nb\n\nInstitute of Physics\nUniversity of Tokyo\nKomaba, Tokyo 153, Japan\nc\n\nCollege of Arts and Sciences\nTokyo Woman's Christian University\nSuginami-ku, Tokyo 167-8585, Japan\nand\nEn'yo Radiation Laboratory,\nNishina Accelerator Research Center,\nRIKEN, Wako, Saitama 351-0198, Japan\n(Dated: August 20, 2008)\n\nAbstract\nThe canonical quantization in the Weyl gauge of gauge fields in static space-times is presented.\nWith an appropriate definition of transverse and longitudinal components of gauge fields, the Gauss\nlaw constraint is resolved explicitly for scalar and spinor QED and a complete non-perturbative\nsolution is given for the quantized Maxwell-field coupled to external currents. The formalism is\napplied in investigations of the electromagnetic field in Rindler spaces. The relation of creation and\nannihilation operators in Minkowski and Rindler spaces is established and initial value problems\nassociated with bremsstrahlung of a uniformly accelerated charge are studied. The peculiar scaling\nproperties of scalar and gauge theories in Rindler spaces are discussed and various quantities such\nas the photon condensate or the interaction energy of static charges and of scalar sources are\ncomputed.\n\n∗\n\nElectronic address: flenz@theorie3.physik.uni-erlangen.de\nElectronic address: ohta@nt1.c.u-tokyo.ac.jp\n‡\nElectronic address: yazaki@phys.s.u-tokyo.ac.jp\n†\n\n1\n\n\fContents\n\n2\n\nI. Introduction\nII. Canonical quantization of the electromagnetic field in static space-times\nA. The electromagnetic field in Weyl gauge\nB. Transverse gauge fields\nC. Maxwell field and external currents\n1. Decoupling of external currents\n2. Time evolution\nD. Quantum Electrodynamics\n1. Scalar QED\n2. Spinor QED\nE. SU(N) Yang-Mills fields in Weyl gauge\n\n4\n4\n5\n6\n6\n11\n11\n11\n13\n14\n\nIII. Scalar fields in Rindler space\nA. The wave equation\nB. Hamiltonian and scale transformations\nC. Unruh temperature\n\n15\n15\n16\n18\n\nIV. Electromagnetic fields in Rindler space\nA. Canonical formalism\nB. Normal modes of transverse gauge fields\nC. Hamiltonian and scale transformations\nD. Unruh temperature of the radiation field\nE. Gauge fields coupled to external currents\nF. Initial value problems and bremsstrahlung\n1. Scalar radiation\n2. Photons\nG. The interaction energy of static charges in accelerated frames\n\n19\n19\n20\n21\n23\n27\n31\n31\n32\n35\n39\n\nV. Conclusions\n\nI.\n\nAcknowledgments\n\n41\n\nReferences\n\n41\n\nINTRODUCTION\n\nOver the past decade the study of quantum fields in curved space-time has attracted\nconsiderable attention. With the formulation of the AdS/CFT correspondence the possibility\nhas emerged that theories such as QCD can be formulated effectively as non-interacting\nquantum field theories in curved space-time. With string theory inspired choices of the spacetime metric one has been able to describe non-perturbative phenomena such as confinement\nand chiral symmetry breaking with their associated phase transitions and a series of specific\nissues has been addressed concerning the spectrum of QCD, the dynamics of Wilson loops\nor thermodynamic properties of the quark-gluon plasma such as its viscosity. Our studies\n\n2\n\n\fare intended to improve and extend our understanding of the peculiar properties of the\ndynamics of quantized fields, in particular of gauge fields, in static space-times.\nStudies of quantized gauge fields in curved space-times have been carried out almost\nexclusively in the (general) covariant Lorenz gauge. The explicit covariance of the resulting\nformulation is achieved at the expense of keeping redundant quantum fields. In static spacetimes the existence of a timelike Killing vector singles out the time direction and the Weyl\n(temporal) gauge becomes a natural choice for a canonical formulation of gauge theories in\nterms of physical degrees of freedom only, e. g. in terms of transverse photons or gluons.\nIn the first part of this work we will carry out the canonical quantization of gauge fields in\narbitrary static space-times in the Weyl gauge with the Gauss law acting as a constraint on\nthe space of physical states. The Gauss law will be implemented explicitly for the Maxwell\nfield coupled to external currents and for scalar and spinor QED. An essential element in\nthis construction is the metric-dependent separation of vector fields into longitudinal and\ntransverse components with the longitudinal degrees of freedom described by the eigenstates\nof the longitudinal conjugate momentum, i. e. of the longitudinal electric field operator. The\ncoupling of the Maxwell field to external time dependent c-number currents is treated in\ndetail and the time evolution operator is constructed without invoking perturbation theory.\nThe coupling to charged scalar and spinor fields is also briefly discussed. First steps in the\nquantization of non-Abelian gauge theories will be carried out and the strategy for resolving\nthe Gauss law constraint will be indicated for specific space-times.\nIn the application of the general formalism we will study the dynamics of electromagnetic\nfields in Rindler space. Rindler spaces play a special role in the study of quantum fields in\ncurved space-times. On the one hand, a Rindler space can be viewed as space-time under\nthe influence of a static, homogeneous gravitational field like the field close to the horizon\nof a Schwarzschild black hole. On the other hand, according to the equivalence principle,\na Rindler space can be be interpreted as part of a Minkowski space (Rindler wedge) as\nseen by a uniformly accelerated observer. This equivalence offers the unique possibility\nto relate explicitly the Heisenberg field operators in Rindler space to those in Minkowski\nspace and to connect creation and annihilation operators in the two spaces via a Bogoliubov\ntransformation. In this way the Minkowski-space vacuum is seen to differ from the Rindlerspace vacuum [1, 2, 3] by an acceleration induced thermal radiation of Rindler particles [3]\n(Unruh effect).\nBesides important conceptional issues concerning e.g. the classical and quantum mechanical aspects of the Unruh radiation and its detection, its relation to Hawking radiation,\nthe Casimir effect in Rindler spaces or the absence of radiation in the frame where a uniformly accelerated external charge is at rest (for a discussion of some of the open issues\ncf. [4]), investigations have also addressed the phenomenological relevance and experimental\nverification of the Unruh effect (for a review cf. [5]). Among various topics we mention the\ndepolarization of charged particles by acceleration (cf. [6]), the acceleration induced decay\nof particles [7, 8] or the description of the thermalization in relativistic heavy ion collisions\nin terms of the Unruh effect [9]. Experimental developments in atomic physics and optics\nafford new opportunities for experimental investigations of the Unruh radiation. Despite\nthe phenomenological relevance of electrodynamics most of the investigations of the Unruh\neffect have been carried out in the context of scalar field theory. The rather few applications\nto the Maxwell field are mostly based on the quantization in the (covariant) Lorenz-gauge\n(cf. [10, 11, 12, 13]). In related problems, Gupta-Bleuler quantization in a modified Feynman\ngauge [14] and the Weyl gauge in a semiclassical calculation [15] have been used.\n3\n\n\fAfter a short review of the properties of quantized scalar fields in Rindler space, we\nwill apply the general quantization scheme in the Weyl gauge to electromagnetic fields in\nRindler spaces and will construct explicitly the expansion of the gauge field in terms of the\ntransverse eigenmodes of the Maxwell equation. We will identify a symmetry related to\nscale transformations which is peculiar to Rindler spaces and has important implications for\nthe spectrum of scalar and gauge field theories. The vector character of the gauge field and\nits gauge dependence make the relation between the Heisenberg field operators in inertial\nand accelerated frames intricate. The central result of the analysis of this relation is the\nexpression of the creation and annihilation operators of the transverse degrees of freedom\nin Rindler space in terms of the corresponding operators in Minkowski space. Based on\nthis result, a complete solution of initial value problems related to external currents will\nbe given. Equipped with these tools we address the issue of bremsstrahlung of charges at\nrest in the accelerated frame and consider the case that the external charges are switched\non adiabatically. The dynamics of the longitudinal degrees of freedom will be studied in\na calculation of the Coulomb interaction of two charges at rest in uniformly accelerated\nframes. In comparison to the dynamics of scalar fields we will find significant differences in\nthe dynamics of both the longitudinal and the transverse components of the gauge fields.\nWe will indicate consequences of our results for the structure of uniformly accelerated atoms\nand discuss possible implications for the phase structure of Yang-Mills theories and QCD in\nRindler spaces.\nII. CANONICAL QUANTIZATION OF THE ELECTROMAGNETIC FIELD IN\nSTATIC SPACE-TIMES\nA.\n\nThe electromagnetic field in Weyl gauge\n\nHere we carry out the canonical quantization of the Maxwell field in a static but otherwise\ngeneral d + 1 dimensional space-time. A static metric has the following structure (i, j =\n1, . . . , d)\nds2 = g00 (x)dx0 dx0 + gij (x) dxi dxj , x = (x1 , . . . , xd ) .\n(1)\nThe Lagrangian of the Maxwell field A coupled to a conserved external current j is given by\ni\np h 1\nL = |g| − g μρ g νσ (∂μ Aν − ∂ν Aμ )(∂ρ Aσ − ∂σ Aρ ) − g μν Aμ jν ,\n(2)\n4\n\nwith the associated equations of motion\np\np\n∂μ |g|g μρ g λσ (∂ρ Aσ − ∂σ Aρ ) − |g| j λ = 0 .\n\n(3)\n\nThe antisymmetry of the field-strength implies current conservation\np\n1\np ∂μ |g| j μ = 0 .\n|g|\n\n(4)\n\nThe canonical quantization is most conveniently carried out in the Weyl gauge\nA0 (x0 , x) = 0.\n4\n\n(5)\n\n\fIn this gauge, the Gauss law (λ = 0 in Eq. (3)) reads\np\n\u0001 p\n|g| g 00 ∂0 Ai + |g| j 0 = 0 .\n∂i\n\n(6)\n\nwith the energy density of the magnetic field\n1p\nV [A] =\n|g|g ik g jl (∂i Aj − ∂j Ai )(∂k Al − ∂l Ak ) .\n4\n\n(9)\n\nThe components of the conjugate momentum Πi (x) and the Hamiltonian are given by (cf.\nEq. (2))\np\n∂L\nΠi =\n= − |g| g 00 ∂0 Ai ,\n(7)\n∂∂0 Ai\nZ\nZ\nn 1 g\no\np\nij\ni j\nd\ni j\nd\np\nΠ Π + V [A] ,\n(8)\nH = HA + d x |g|gij A j , HA = d x −\n2 |g| g 00\n\nIn the Weyl gauge, the Gauss law (6) is not an equation of motion but rather constrains the\nlongitudinal electric field\np\n(10)\nG = ∂i Πi − |g|j 0 = 0 .\n\nThe quantization in the Weyl gauge is standard. We postulate canonical commutation\nrelations\n1\n(11)\n[Πi (x0 , x), Aj (x0 , x′ )] = δij δ(x − x′ ) .\ni\nNo redundant degrees of freedom are present in this formulation though a residual gauge\nsymmetry still exists. It is easy to verify that the Gauss law operator (10) commutes with\nthe Hamiltonian\n[G, H] = 0 .\n(12)\nThus, the generator of time independent gauge transformations G, can be diagonalized\nsimultaneously with the Hamiltonian. One defines as the space of physical states |Ψi the\nspace of eigenstates of G with eigenvalue 0,\nG|Ψi = 0 .\nB.\n\n(13)\n\nTransverse gauge fields\n\nThe invariance under time independent gauge transformations can be exploited to further\nsimplify the formalism. The strategy now depends on the details of the theory as well as\non the properties of the metric. In the canonical formulation of the Maxwell theory or\nof QED in flat space the reduction to \"Coulomb gauge\" is natural. In this formulation\nstatic charges are not coupled to the radiation field. We will show in the following sections,\nthat this implementation of the residual gauge symmetry can be achieved for the Maxwell\nfield coupled to an external current and for QED in an arbitrary static space-time by an\nappropriate generalization of the concept of longitudinal and transverse fields. To this end\nwe introduce a decomposition of vector fields into longitudinal and transverse components\nwhich generalizes the flat space definition to static curved space-time and define the following\nprojection operators on transverse and longitudinal fields\nP ij = g ij + ∂ i\n\n1\n∂j ,\n∆\n5\n\nQij = −∂ i\n\n1\n∂j ,\n∆\n\n(14)\n\n\fwith the Laplacian\n∆ = −∂i ∂ i .\n\n(15)\n\nThe projection operators satisfy the standard requirements\nP ij P jk = P ki ,\n\nQij Qjk = Qik ,\n\nP ki + Qik = δik ,\n\nP ij Qjk = 0 ,\n\n(16)\n\nand\n∂i P ij = 0,\n\n∂i Qij = ∂j .\n\n(17)\n\nWe also note the hermiticity of the Laplacian (15)\nZ\nZ\nd\nd xf (x) ∆g(x) = dd x∆f (x) g(x) .\nAs in flat space, these properties guarantee the orthogonality of longitudinal and transverse\ncomponents of vector fields\nZ\ndd xP ji V j (x) Qi k W k (x) = 0 ,\n(18)\nand\n\nZ\n\nd\n\nd\n\nxP ji V j (x) Wi (x)\n\n=\n\nZ\n\ndd xP ji V j (x) Pi k W k (x) .\n\n(19)\n\nWe denote the transverse components of gauge and electric fields by\nÂi = P ij Aj ,\n\nΠ̂i = P ij Πj .\n\n(20)\n\nThis definition of the transverse fields and the canonical commutation relations imply\n\u0011\n1\u0010 i\n[Π̂i (x0 , x), Âj (x0 , x′ )] =\ng j δ(x − x′ ) − ∂ i ∂j′ D(x, x′ ) ,\n(21)\ni\n\nwith\n\n1 ′\n|x i .\n(22)\n∆\nEvidently, this is the generalization of the transverse commutation relations of electric and\ngauge fields in flat space.\nD(x, x′ ) = hx|\n\nC.\n1.\n\nMaxwell field and external currents\nDecoupling of external currents\n\nWe first consider the Maxwell field coupled to an external current. This system is described by the Hamiltonian (8)\nZ\no\nn 1 g\np\nij\ni j\nd\ni j\n(23)\nH= d x − p\nΠ Π + V [Â] + |g|gij A j .\n2 |g| g 00\n\nIn this case of a c-number current, the terms linear in the gauge and electric field operators\ncan be eliminated by a unitary transformation and the Hamiltonian can be formulated in\n6\n\n\fterms of transverse degrees of freedom only. We define a transformation which shifts fields\nand conjugate momenta\nW = eiΦ(t) = ei\n\nR\n\nd d x(−Πk αk +Ak pk )\n\nW † Ai W = Ai + αi ,\n\n,\n\nW † Πi W = Πi + pi .\n\n(24)\n\nThe Hamiltonian transforms as follows\nH ′ = W † HW − iW † ∂t W ,\n\n(25)\n\nand the Gauss law in the transformed space of physical states becomes\n\u0010\n\u0011\np\np\n\u0001\n0 = W † ∂i Πi − |g| j 0 W |ψ ′i = ∂i Πi − |g| j 0 + ∂i pi |ψ ′ i .\n\n(26)\n\nActing on the transformed states\n\n|ψ ′ i = W † |ψi ,\n\n(27)\n\nthe electric field operator is decomposed accordingly into transverse and longitudinal components\n\u0010\np\n\u0001\u0011 ′\ni\n′\ni\ni 1\n0\nk\n(28)\nΠ |ψ i = Π̂ − ∂\n|g| j − ∂k p |ψ i .\n∆\nFor computing the time derivative we rewrite W\nW = e−i\n\nR\n\nd d xΠk αk\n\nei\n\nR\n\nd d xAk pk\n\ni\n\ne2\n\nR\n\nd d xαk pk\n\n.\n\n(29)\n\nA straightforward calculation yields the following decomposition of the Hamiltonian\nH ′ = H0 + H1 + h(t) .\ninto the Hamiltonian of the uncoupled Maxwell field H0\nZ\n\u0010 1\n\u0011\n1\nH0 = d d x − gij p\nΠ̂i Π̂j + V [Â] ,\n2\n|g| g 00\n\n(30)\n\n(31)\n\nthe contribution H1 , linear in A and Π\nZ\nhp\n\u0001i\n1p\n1\n1 p\nk\nik jl\ni\ni\n0\nd\ni\n,\n|g| Ak j +\n|g| g g fij Fkl + ṗ Ai − Π̂ α̇i − p\n|g| j\nH1 = d x\nΠ̂ p̂i −∂i\n2\n∆\n|g| g 00\n(32)\nand the c-number contribution to the Hamiltonian h(t)\nZ\nnp\n\u0011\n\u0010\np\n1p\n1\nd\ni\nik jl\ni\ni 1\np\nh(t) =\nd x\n|g|αi j +\n|g| g g fij fkl −\n|g| j0\np̂ − ∂\n4\n∆\n2 |g| g 00\n\u0010\n\u0011\n\u0001o\n1 p\n1 p\n1 i\nṗ αi − pi α̇i .\n(33)\n* p̂i − ∂i\n|g| j0 + α̇i ∂ i ( |g|j 0 − ∂k pk ) +\n∆\n∆\n2\n\nWe have introduced the c-number field strength of the auxiliary gauge fields α\nfij = ∂i αj − ∂j αi ,\n\nand have denoted the time derivatives of the auxiliary gauge (αi ) and electric (pi ) fields by\na dot. The auxiliary fields are used to make H1 (32) vanish. The terms linear in Ai do not\ncontribute if\np\np\n\u0001\n|g| j i + ∂l\n|g| g ik g jlfkj + ṗi = 0 ,\n(34)\n7\n\n\for written in terms of transverse and longitudinal components\npi(l) = −∂ i\n\n1p\ni\n|g|j 0 − E(l)\n(x) ,\n∆\n\np\np\n\u0001\n1p\nṗˆi = − |g| j i − ∂l\n|g| g ik g jlfkj + ∂ i\n|g|∂0 j 0 . (35)\n∆\n\nThe longitudinal electric field if acting on the transformed states (cf. Eq. (28)) is given by\ni\nthe integration constant E(l)\n\u0010\n\u0011\ni\nΠi |ψ ′ i = Π̂i + E(l)\n(x) |ψ ′ i .\n\n(36)\n\nVanishing of the terms linear in Π̂ requires\nα̇i = ∂i Ω̇ − p\n\n\u0010\n\u0011\n1 p\n1\np̂i − ∂i\n|g| j 0 ,\n∆\n|g| g 00\n\n(37)\n\nwhere Ω is an arbitrary function. Here the gauge freedom arises, since the projection on the\ntransverse conjugate momentum Π̂ leaves the longitudinal component of α undetermined.\nWe differentiate this equation with respect to time, use Eq. (34) and current conservation\n(Eq. (4)) to derive the following wave equation\np\np\np\np\n\u0001\n0 = − |g| g 00 α̈i + |g| g 00 ∂ i Ω̈ + |g| j i + ∂l\n|g| g ik g jl fkj .\n(38)\n\nWith the gauge choice Ω = 0, this wave equation is nothing else than the equation of motion\n(3) in the Weyl gauge.\nThus provided the auxiliary functions are chosen to satisfy the equations of motion (34) and\n(37) the Hamiltonian is a sum of the Hamiltonian of the Maxwell field formulated in terms\nof transverse degrees of freedom and of a c-number contribution accounting for the effect of\nexternal currents\nH ′ = H0 + h(t) .\n(39)\nFor solutions of the equation of motion (34) and (37) the c-number part h(t) (33) simplifies\nZ\nnp\no\np\n1\nd\nk\ni\n0\nh(t) =\nd x\n(40)\n|g|αk j − α̇i E(l) + Ω̇ |g|j .\n2\n\nIt is advantageous to eliminate the longitudinal component of the auxiliary field with the\nfollowing choice of the gauge function Ω\nZ\no\n\u0011\nnp\np\np\n1\n1\n1 \u0010\n0\ni\ni 1\n|g|j ) , h(t) =\n|g|αk j k + Ω̇ |g|j 0 . (41)\n(p̂ − ∂\ndd x\nΩ̇ = − ∂i p\n∆\n∆\n2\n|g|g 00\n\nBesides the standard coupling of the transverse gauge field to the current and the instantaneous Coulomb interaction energy hC (t), an additional term arises from the coupling of the\ncharges to the transverse electric field\nZ\no\nnp\np\n1\n1\ni\nd\nk\n0 1\np̂ + hC (t) ,\n(42)\nh(t) = −\nd x\n|g|α̂k j + |g|j ∂i p\n2\n∆\n|g|g 00\nZ\np\n1\n1\n1\n1p\nhC (t) =\n|g|j 0 .\n(43)\ndd x |g|j 0 ∂i p\n∂i\n00\n2\n∆\n∆\n|g|g\n8\n\n\fThe appearance of the equations of motion (38) of the Maxwell field coupled to an external\ncurrent for the auxiliary fields had to be expected. In the classical context our procedure\namounts to decompose the field in a homogeneous solution (Ai , Πi ) of the Maxwell equations\nand an inhomogeneous solution (αi , pi ).\nThe Maxwell equations for the auxiliary fields αi and pi imply a useful identity for the\nexponent Φ(t) of the unitary transformation (24). We decompose the exponent of W into\ntransverse and longitudinal contributions\nZ\n\u0001\nΦ(t) = d d x − Πk αk + pk Ak = Φ̂(t) + Φ(l) (t) ,\n(44)\nuse Eq. (35) to rewrite Φ(l) (t), transform to Heisenberg operators and derive with the help\nof the equations of motion (3) and (38)\nZ\nZ\np\nd\n1\n1p\nd\ni\nΦ̂H = − d xÂHi |g|j + d d xΠ̂iH\n|g|j 0 ∂i p\n.\n(45)\ndt\n∆\n|g|g 00\n\nIn the first term, only the transverse component of the current\np\n1\nJˆi = (gki + ∂ i ∂k ) |g| j k\n∆\n\n(46)\n\ncouples to the transverse component of the gauge field (cf. Eq. (19)). The second term couples\nstatic charges to the radiation field. It arises since in general, in a static metric, like in the\nSchwarzschild or the standard AdS metric\nd−1\n\nds2 =\n\nX\n\u0001\n1\n02\ni2\n2\ndx\n−\ndx\n−\ndu\nu2\ni=1\n\n(47)\n\nthe ratio of conjugate momentum to electric field varies in space.\nThe above expressions simplify if the coordinates can be chosen such that the metric satisfies\np\n∂i ( |g|g 00 ) = 0 .\n(48)\nIn this case, as in flat space-time, the equation of motion (38)\np\np\n\u0001\nˆ i + Jˆi + ∂l\n|g| g ik g jlfkj ,\n0 = − |g| g 00 α̈\n\n(49)\n\ndoes not couple radiation field and static charges (cf. Eq. 45)). The expression for the energy\n(cf. Eq. (42)) contains the standard coupling of transverse gauge field and current and the\nelectrostatic interaction (cf. Eq. (43))\nZ\np\n1\nh(t) = −\ndd x |g|α̂k j k + hC (t) ,\n(50)\n2\nZ\nZ\np\np\n1\nd\nd x |g(x)| dd x′ |g(x′ )|j 0 (t, x)D(x, x′ )j 0 (t, x′ ) .\n(51)\nhC (t) = −\n2\n\nThe transverse part Φ̂ of the exponent of the unitary transformation is given by the coupling\nof the transverse gauge field to the current\nZ\nd\nΦ̂H = − d d xÂHi Jˆi .\n(52)\ndt\n9\n\n\fPresence or absence of coupling of the time component of the current to the radiation\nfield is not an intrinsic property of the particular static space-time. It depends on the\nchoice of the coordinates. If the condition (48) is not fulfilled one may construct a timeindependent coordinate transformation xi → x′ i which decouples charges from the radiation\nfield, provided it satisfies the constraint\n\u0001\np\n∂ x′,1. . . , x′ d\n\u0001 = g 00 |g| ,\ndet\n(53)\n∂ x1 , . . . , xd\nup to a multiplicative constant. For instance, as is easily verified, the coordinate transformation\nZ r\nr′ 3\n(t, r, θ, φ) → (t, ρ, σ, φ) with ρ =\ndr ′ ′\n, σ = cos(θ)\nr − 2M\n\napplied to the Schwarzschild-metric [16] with Schwarzschild-radius 2M or the coordinate\ntransformation\n(xμ , u) → (xμ , v = u−d+2 )\n\napplied to the AdS metric (47) decouple static charges and radiation field. This decoupling\ndoes not necessarily simplify the calculation. In the case of the Schwarzschild metric, for\ninstance, the coordinate transformation cannot be inverted in closed form which prevents\nan explicit formulation of the dynamics. Another simple example for such a coordinate\ntransformation will be discussed for the Rindler space in Sec. IV A.\nFor the sake of comparison we compile here the relevant results for a scalar field coupled to\nan external source\no\np n 1 \u0002 μν\n\u0003\n2 2\ng ∂μ φ ∂ν φ − m φ − ρφ .\n(54)\nL = |g|\n2\nIn analogy with Eq. (24) we define the following unitary transformation\nZ\nZ\np\niφ(t)\nd\nw=e\n, φ(t) = d x(−πα + φp) = d d x |g|g 00 (−φ̇α + φα̇),\n(55)\nwith the conjugate pairs of field operators φ, π and auxiliary fields α, p solving the inhomogeneous field equations\np\np\np\np\n|g|g 00 α̈ + ∂i ( |g|g ij ∂j α) + |g|m2 α + |g|ρ = 0 .\n(56)\nThe exponent φ(t) satisfies\n\nd\nφ(t) = −\ndt\n\nZ\n\np\nd d x |g|ρφ .\n\n(57)\n\np\nd d x |g|ρ α .\n\n(59)\n\nAfter decoupling the external source by the transformation w, the Hamiltonian (cf. Eq.(25))\nis given by\nH sc ′ = H0sc + hsc (t) ,\n(58)\nwith\n\n1\nh (t) =\n2\nsc\n\nZ\n\n10\n\n\f2.\n\nTime evolution\n\nTo illustrate in this general context the consequences of our results we consider a typical\ninitial value problem as it arises when external sources are present. More detailed issues will\nbe addressed later in the application to Rindler space.\nWe assume that the external current is vanishing beyond some time in the past\nj μ (t, x) = 0 for t ≤ t0 .\nWe calculate the time evolution of the state |ψ(t0 )i by transforming this state at t0 into\nthe primed basis (Eq. (27)), let it evolve under the influence of H ′ (39) and transform back\nto the unprimed basis at time t. We furthermore require the auxiliary fields to satisfy the\ninitial conditions\nαi (t0 , x) = pi (t0 , x) = 0 .\nThus the time evolution is given by\n−iH0 (t−t0 )−i\n\n|ψ(t)i = W (t) e\n\nRt\n\nt0\n\ndt′ h(t′ )\n\n|ψ(t0 )i ,\n\n(60)\n\nand the expectation value of a gauge invariant observable O(Πi , Âi ) by\nhψ(t)|O(Π, Â)|ψ(t)i = hψ(t0 )|OH |ψ(t0 )i ,\nwith the Heisenberg operator\nOH = eiH0 (t−t0 ) W † (t)O(Π, Â)W (t) e−iH0 (t−t0 )\n\u0011\n\u0010\n1 p\n|g| j 0 , ÂiH + α̂i ,\n= O Π̂iH + p̂i − ∂ i\n∆\n\n(61)\n\nwhere we have used the transformation properties (24) of gauge and electric fields, the\nGauss law in the original basis (10) and, in integrating the equation of motion (35) of the\nlongitudinal electric field, we have dropped a time independent integration constant. The\nHeisenberg operators are defined with respect to H0\nΠ̂i −iH0 (t−t0 )\nΠ̂iH\ne\n.\n= eiH0 (t−t0 )\nÂi\nÂi,H\nExpression (61) summarizes the results of our discussion. Gauge and electric fields are given\nby the sum of the standard operator valued solution of the homogeneous Maxwell-equations\nand a special classical solution of the inhomogeneous Maxwell equation.\nD.\n1.\n\nQuantum Electrodynamics\nScalar QED\n\nHere we briefly discuss the necessary modifications of the formalism if the gauge field is\ncoupled to a charged matter field rather than to an external current. We first consider the\ncase of a scalar charged matter field with the action of the coupled system given by\nZ\ni\np h 1 μ ν\nd+1\nν μ\nμ\nμ †\n2 †\nS = d x |g| − (∂ A − ∂ A )(∂μ Aν − ∂ν Aμ ) + (∂ + ieA )φ (∂μ − ieAμ )φ − m φ φ .\n4\n(62)\n11\n\n\fThe quantization of the gauge field in the Weyl gauge proceeds as before. The canonical\nmomentum of the scalar field is given by\np\n∂L\nπ=\n= |g| g 00 ∂0 φ† ,\n∂(∂0 φ)\n\nand the Gauss law constraint keeps its form (10)\n\u0010\np\nG|ψp i = ∂i Πi − |g| j 0 )|ψp i = 0 ,\n\n(63)\n\nwith the following definition of the charge density\ne\nj 0 = −i p (φ† π † − πφ) .\n|g|\n\n(64)\n\nThe resulting Hamiltonian in the Weyl gauge (cf. Eq. (8))\n(\n)\nZ\nh\ni\np\n1\nπ † π − |g| (∂ i + ieAi )φ† (∂i − ieAi )φ − m2 φ† φ\nH = HA + d d x p\n00\n|g| g\n\nstill contains longitudinal gauge field components. As above they can be eliminated by an\nunitary gauge fixing transformation which we choose as follows\no\nn Z\np\n1\n(65)\nw = exp i dd x |g|j 0 ∂i Ai ,\n∆\n\nwith j 0 given in (64). This transformation acts on both the gauge and matter field. The\ntransformed electric field reads\n1p\nΠ′ i = w † Πi w = Πi − ∂ i\n|g| j 0 ,\n(66)\n∆\nand thus in the space of the transformed physical states\n|ψp′ i = w|ψp i ,\nthe Gauss law operator vanishes\nG′ |ψp′ i = ∂i Πi |ψp′ i = 0 .\n\n(67)\n\nThe transformation w rotates the phase of the matter field, with the gauge function containing the longitudinal field operator\n1\n\nβ\n\nw † φ w = e−ie ∆ ∂β A φ ,\n\n1\n\nβ\n\nw † πw = eie ∆ ∂β A π ,\n\nand eliminates the longitudinal component of the gauge field from the covariant derivative\n\u0001\n\u0001\n1\nβ\nw † ∂α − ieAα φ w = e−ie ∆ ∂β A ∂α − ieÂα φ .\n\nUnlike in the case of the Maxwell field coupled to an external current, here the unitary\ntransformation is time independent and we find for the transformed Hamiltonian\nH ′ = w † Hw = HA′ + hC\nZ\nio\nn\np h\n1\nπ † π − |g| (∂ i + ieÂi )φ† (∂i − ieÂi )φ − m2 φ† φ ,\n+ d dx p\n|g| g 00\n12\n\n(68)\n\n\fwith the transformed Hamiltonian of the Maxwell field (Eq. (8))\nZ\nn 1 g\no\np\n\u00011 j\n1\nij\n′\n†\nΠ̂i Π̂j + j 0 |g|gij ∂ i p\nΠ̂ + V [Â] , (69)\nHA = w HA w = d d x − p\n2 |g| g 00\n|g|g 00 ∆\nand the Coulomb-energy operator\nZ\n1p\n1p\n1\ng ij\nd\np\n|g|j 0 ) ∂j\n|g|j 0 ) .\n∂i\nhC = −\nd x\n00\n2\n∆\n∆\n|g| g\n\n(70)\n\nWe thus have achieved a canonical formulation of scalar QED free of redundant degrees of\nfreedom. We note that also in this dynamical treatment of the current, static charges do\ncouple to the transverse electric field in general static space-times.\n2.\n\nSpinor QED\n\nFor the coupled system of the Maxwell and a charged spin 1/2 field with action\nZ\np n 1\n\u0002\n\u0003 o\nS = d d x |g| − (∂ μ Aν − ∂ ν Aμ )(∂μ Aν − ∂ν Aμ ) + ψ̄ γ μ i(∇μ − ieAμ ) − m ψ , (71)\n4\n\nwe proceed analogously. The space-time dependent γ matrices satisfy the anticommutation\nrelations\n{γ μ , γ ν } = 2g μν ,\n(72)\nand the covariant derivative ∇μ is given by\n\n∇μ = ∂μ − Γμ\nwith Γμ determined by the \"spin connection\" [17]. Here we neither need the explicit expressions for the γ matrices nor for Γμ (for details see for instance [18]) and only mention that\nΓμ can be chosen time-independent for static metrics. From the action (71) we read off the\nexpression for the time component of the current (cf. Eq. (2))\nj 0 = −eg 00 ψ † ψ .\n\n(73)\n\nThe conjugate momentum is given by\np\nπ = i |g|g 00 ψ † ,\n\nand the following equal-time anticommutation relations are postulated\n{ψα (x0 , x), ψβ (x0 , x′ )} = p\n\n1\n|g|g 00\n\nδαβ δ(x − x′ ) .\n\n(74)\n\nAfter elimination of the longitudinal gauge field components by the unitary transformation\n(65) with the charge density given in Eq. (73) the final form of the Hamiltonian reads\nZ\np\n\u0002\n\u0003\n′\n′\n(75)\nH = HA + d d x |g| ψ̄ γ k i(∇k − ieÂk ) + m + ig 00 Γ0 ψ ,\n\nand the Gauss law constraint (67) insures the vanishing of the longitudinal component of the\nconjugate momentum in the space of physical states.\n13\n\n\fE.\n\nSU(N) Yang-Mills fields in Weyl gauge\n\nThe first step in the above procedure is straightforwardly generalized to Yang-Mills gauge\nfields. Starting from the action (with the summation convention applied also to the color\nlabels a, b, c)\nZ\np h 1 μρ νσ a a i\nd+1\n(76)\nS = d x |g| − g g Fμν Fρσ ,\n4\nwith the field strength components\na\nFμν\n= ∂μ Aaν − ∂ν Aaμ + gY M f abc Abμ Acν ,\n\na = 1, . . . , N 2 − 1\n\n(77)\n\none easily verifies that in the Weyl gauge\nAa0 = 0 ,\nthe formal expression for the conjugate momentum (7) remains unchanged\np\n∂L\n=\n−\nΠa i =\n|g| g 00 ∂0 Aa i ,\n∂∂0 Aai\n\n(78)\n\nand so do the commutation relations\n\n1\n[Πa i (x0 , x), Abj (x0 , x′ )] = δab δij δ(x − x′ ) .\ni\nAlso the structure of the Hamiltonian is the same as in (8)\nZ\no\nn 1 g\nij\nai aj\nd\nΠ Π + V [A] ,\nH= d x − p\n2 |g| g 00\n\n(79)\n\nwith the magnetic field energy given by\n\n1p\n|g|g ik g jl Fija Fkla .\n4\nThe Gauss law is implemented as constraints on the physical states\n\u0011\n\u0010\na\na\nabc b\nG |Ψp i = 0 , G = ∂i δac + gY M f Ai Πc i .\nV [A] =\n\n(80)\n\n(81)\n\nAs in electrodynamics, the components of the Gauss law operator commute with the Hamiltonian\n[Ga , H] = 0 ,\nand satisfy, as in flat space, the commutation relations\n[Ga (x), Gb (y)] = igY M f abc Gc (x)δ(x − y) .\n\n(82)\n\nTogether with the commutation relations (82), the vanishing commutator of Hamiltonian and\nGauss law operator indicates, as in the Maxwell case, the possibility of eliminating degrees\nof freedom. In Yang-Mills theory, the appearance of Gribov horizons prevents an explicit\nconstruction of the Hamiltonian in the Coulomb gauge by elimination of the longitudinal\nfields already in flat space. Depending on the structure of space-time axial gauges may be\nmore appropriate. The Rindler space or the AdS metric, for instance, singles out one space\ndirection and no further reduction of the symmetry occurs if the axial gauge is defined with\nrespect to this direction. With the technique of elimination of redundant degrees of freedom\nby unitary transformations the Gauss law constraint (81) can be fully implemented [19, 20]\nand the gauge field component with respect to the particular space direction disappears.\n14\n\n\fIII.\nA.\n\nSCALAR FIELDS IN RINDLER SPACE\nThe wave equation\n\nIn order to prepare our discussion of gauge fields, we sketch in this section the treatment\nof scalar fields in Rindler space and its connection to scalar fields in Minkowski space. We\nfollow here closely the treatment given in [1]. We consider a scalar field in a frame which is\nuniformly accelerated in the 1-direction with respect to an inertial frame (coordinates (t, x1 )).\nCoordinates in the accelerated system can be chosen to be related to the coordinates (t, x1 )\nin the right Rindler wedge\n\b\nR+ = xμ |t| ≤ x1\n(83)\nin the following way\n\nt(τ, ξ) =\n\n1 aξ\ne sinh aτ ,\na\n\nx1 (τ, ξ) =\n\n1 aξ\ne cosh aτ .\na\n\n(84)\n\nThe range of τ, ξ is\n− ∞ ≤ τ , ξ ≤ ∞.\n\n(85)\n\nds2 = e2aξ (dτ 2 − dξ 2 ) − dx2⊥ .\n\n(86)\n\nThe metric of the Rindler space-time with d − 1 transverse directions (x⊥ ) is given by\n\nThe action of a self interacting scalar field reads\nZ\n\b\n1\nS=\ndτ dξ d d−1 x⊥ (∂τ φ)2 − (∂ξ φ)2 − (m2 φ2 + (∇⊥ φ)2 − 2V (φ)) e2aξ .\n2\nThe equation of motion for a non-interacting scalar field\ni\nh\n∂τ2 − ∆s + m2 e2aξ φ = 0 ,\n\nwith the Laplacian\n\n∆s = ∂ξ2 + e2aξ ∇2⊥ ,\n\n(87)\n\n(88)\n\n(89)\n\nis solved with the ansatz\nφ = e−iωτ eik⊥ x⊥ φ(ξ) .\nWith\nm2⊥ = m2 + k2⊥ ,\n\n(90)\n\nthe wave equation for φ reads\n−\n\nd2 φ\n+ m2⊥ e2aξ φ = ω 2 φ .\n2\ndξ\n\n(91)\n\nm⊥ aξ\ne ,\na\n\n(92)\n\nφ(z) = ki ωa (z)\n\n(93)\n\nIn terms of the variable\nz=\nthe eigenfunctions\n\n15\n\n\fare (appropriately normalized) MacDonald functions\nkiμ (z) =\n\n1 p\n2μ sinh πμ Kiμ (z),\nπ\n\nwhich form a complete orthonormal set\nZ ∞\ndz\nkiμ (z) kiν (z) = δ(μ − ν),\nz\n0\nB.\n\nZ\n\n(94)\n\n∞\n0\n\ndμ kiμ (z) kiμ (z ′ ) = zδ(z − z ′ ) .\n\n(95)\n\nHamiltonian and scale transformations\n\nAccording to the action (87), the momentum conjugate to the scalar field φ is\nπ = ∂τ φ ,\nand the Hamiltonian of a free scalar field in the accelerated system reads\nZ\n\b\n1\nsc\ndξ d d−1 x⊥ π 2 + (∂ξ φ)2 + (m2 φ2 + (∇⊥ φ)2 ) e2aξ .\nH0 =\n2\n\n(96)\n\n(97)\n\nWe quantize the scalar field by requiring canonical commutation relations\n[π(τ, ξ, x⊥ ), φ(τ, ξ ′, x′⊥ )] =\n\n1\nδ(ξ − ξ ′ ) δ(x⊥ − x′⊥ ) .\ni\n\nThe creation and annihilation operators defined by the normal-mode expansion of φ\nZ\ndω d d−1 k⊥\n√\n(a(ω, k⊥ )e−iωτ +ik⊥ x⊥ + a† (ω, k⊥ )eiωτ −ik⊥ x⊥ ) ki ωa (z)\nφ(τ, ξ, x⊥ ) =\n(d−1)/2\n2ω (2π)\n\n(98)\n\n(99)\n\nsatisfy standard commutation relations\n[a(ω, k⊥ ), a† (ω ′, k′⊥ )] = δ(ω − ω ′ )δ(k⊥ − k′⊥ ) .\n\n(100)\n\nWith the help of the orthogonality relation (95) the Hamiltonian (97) can be expressed in\nterms of creation and annihilation operators\nZ\nZ ∞\nsc\nd−1\nH0 = d k ⊥\ndω ωa† (ω, k⊥ )a(ω, k⊥ ) .\n(101)\n0\n\nThe energies of the elementary excitations, the \"Rindler particles\", are independent of the\ntransverse momentum, giving rise to an infinite degeneracy of all eigenstates of H0sc including\nthe vacuum. This degeneracy is a consequence of a symmetry. We consider first the case\nof a massless field. For m = 0 and vanishing V (φ) the action (87) is invariant under the\ntransformation\nφ(τ, ξ, x⊥ ) −→ e(d−1)aξ0 /2 φ(τ, ξ ′, x′⊥ ) ,\n(102)\nconsisting of a translation in ξ and a rescaling of the perpendicular coordinates x⊥\nξ ′ = ξ + ξ0 ,\n16\n\nx′⊥ = eaξ0 x⊥ .\n\n(103)\n\n\fThe limit of infinitesimal transformations determines the generator of the symmetry\n\u0013\u001b\n\u001a\n\u0012\nZ\nd−1\nd−1\n+ x⊥ ∇⊥\nφ.\n(104)\nQ = dξd x⊥ π(ξ, x⊥ ) ∂ξ + a\n2\nThe Hamiltonian H0,scm=0 , the components i 6= 1 of the momentum operator\nZ\nPi = i dξdd−1x⊥ π(ξ, x⊥ )∂i φ(ξ, x⊥ )\nand the generator Q form the algebra\n\u0002 sc\n\u0003\n\u0002\n\u0003\nH0, m=0 , Q = 0 ,\nPi , Q = −iaPi ,\n\n\u0002\n\n\u0003\nPi , H0,scm=0 = 0 i 6= 1 .\n\n(105)\n\n(106)\n\nFurthermore H0,scm=0 and Q commute with the generator of rotations\n\u0002 ij sc\n\u0003 \u0002\n\u0003\nM ij = xi P j − xj P i ,\nM , H0, m=0 = M ij , Q = 0 , i, j = 2, . . . , d − 1 ,\n\nand thus by applying rotations and the transformations (102), a stationary state with a given\nperpendicular momentum can be transformed into a stationary state of the same energy and\nwith arbitrary perpendicular momentum.\nBy the coordinate change x1 = eaξ /a, the transformation (102,103) can be converted into\na scale transformation in all spatial coordinates xi with the standard form of the commutator\nbetween the generator of the scale transformations Q and Pi . As a special property of Rindler\nspace, the transformation (102) does not affect the time coordinate and leaves therefore\nthe (dimensionful) Hamiltonian invariant under scale changes. Expressed in terms of the\nMinkowski-space coordinates (84), the transformation (102) becomes the standard scale\ntransformation of the fields in the Rindler wedge of the Minkowski space including the\nscaling of the time coordinate. Unlike the Rindler space Hamiltonian, the Minkowski space\nHamiltonian changes under these transformations and no degeneracy in the spectrum results.\nThe energies of the Rindler particles do not depend either on their mass. After Fourier\ntransform in the perpendicular coordinates the following transformation of the fields\nφ(τ, ξ, k⊥) −→ φ(τ, ξ + ξ0 , λ(k2⊥ ) k⊥ )γ(k⊥ ) ,\nwith\nλ\n\n2\n\n(k2⊥ )\n\n−2aξ0\n\n=e\n\nm2 −2aξ0\n+ 2 (e\n− 1) ,\nk⊥\n\nγ 2 (k⊥ ) = det\n\n\u0001\n∂\nλ(k2⊥ )kJ ,\n∂kI\n\n(107)\n\n(108)\n\nleaves the action invariant. The generator of the symmetry is non-local\n(\nZ\n\u0011\n\u0010d − 1\n+ x⊥ ∇⊥ φ\nQ = dξdd−1x⊥ π(ξ, x⊥ ) ∂ξ + a\n2\n)\n\u0010d − 3\n\u0011Z\n+a m2\n+ x⊥ ∇⊥\ndd−1 y⊥ g(|x⊥ − y⊥ |)φ(τ, ξ, y⊥ ) .\n2\nwith the non-locality determined by the static propagator\n) 1\nΓ( d−3\n2\n.\ng(x⊥ ) = (d−1)/2\n4π\nxd−3\n⊥\n17\n\n\fC.\n\nUnruh temperature\n\nUp to this point we have discussed the quantized scalar field with its excitations, the\n\"Rindler particles\", as a field theory in a space with a simple but non-trivial metric. The\nmain interest in studying this field theory is its relation with the corresponding theory in\nMinkowski space. Starting point for connecting the dynamics in inertial and uniformly\naccelerated systems is the requirement that the value of a scalar field is the same in inertial\n(φ̃) and accelerated (φ) frames\nφ(τ, ξ, x⊥ ) = φ̃(t, x)\n\nt,x=t,x(τ,ξ)\n\n.\n\n(109)\n\nIn the inertial frame we have the standard normal-mode expansion\nZ\ndd k\n√\n(ã(k)e−iωk t+ikx + ã† (k)eiωk t−ikx ) .\nφ̃(t, x) =\n2ωk (2π)d/2\nBy projecting Eq. (109) on the normal modes of the field φ in the accelerated system (cf. [21])\nand with the help of the identity (cf. [22])\ns\n\u0012\n\u0013\nZ ∞\ndz\nΩ\niπ\n2\niκz\ncos\nβk − aτ −\n(110)\nk Ω (z)e = Ω\nz ia\na\n2\nsinh π Ωa\n0\na\nwith\n\nk1\n,\nm⊥\nthe relation between creation and annihilation operators in the two frames\nZ ∞\nh πΩ\ni\nπΩ\nΩ\ndk1\n1\n√\nei a βk e 2a ã(k1 , k⊥ ) + e− 2a ã† (k1 , −k⊥ ) ,\na(Ω, k⊥ ) = q\na sinh π Ω −∞ 2π2ωk\nκ = sinh(βk − aτ ) ,\n\nsinh βk =\n\n(111)\n\n(112)\n\na\n\nis obtained. With this result the average particle number in the Minkowski space vacuum\n|0M i as seen by the accelerated observer is easily computed\nh0M |a† (Ω, k⊥ )a(Ω′ , k′⊥ )|0M i =\n\n1\n2π Ω\na\n\ne\n\n−1\n\nδ(Ω − Ω′ )δ(k⊥ − k′⊥ ) .\n\n(113)\n\nThe particle number exhibits a thermal distribution. In comparison with thermal distributions in Minkowski space the thermal distribution of \"Rindler particles\" does not suppress\nstates of arbitrarily large transverse momentum k⊥ . Furthermore there is no degeneracy\nrelated to the motion in the direction of the acceleration. There are no modes of excitations\nincoming from positive ξ. For various applications, regularization of the infinities related to\nthe degeneracy of the energy with respect to the transverse momenta is required and the detailed form of the resulting distribution will depend on this regularization of the ultraviolet\nmomenta. The regularization may be achieved by introducing a sharp ultraviolet cutoff as\nused e.g. in the calculation [23] of the entropy of a scalar field in Rindler space. An effective\nregularization [10, 24, 25], affecting also the infrared properties, is obtained by modifying\nthe Rindler space and introducing an infinite barrier which confines the system to ξ > 0.\nIn Minkowski space this corresponds to an accelerated \"mirror\". Such boundary conditions\n18\n\n\fbreak the scale invariance of the action (cf. Eq. (102)) and therefore lift the degeneracy of\nthe eigenstates of the Hamiltonian. For instance, the requirement for the eigenfunctions φ\n(93) to vanish at ξ = 0 can be satisfied only if (for m = 0) this point is in the classically\nallowed regime of the Schrödinger-like equation (91). This implies roughly\nω 2 ≥ k2⊥ .\nThus the boundary condition results in a connection between the energy and the transverse\nmomentum. With this regularization, and for ξ ≫ a−1 , the local distribution becomes\nPlanckian [10] provided the \"improved\" energy momentum tensor is used.\nAs has been shown in [3] (cf. [26], [5]) the thermal distribution arises due to the elimination\nof the degrees of freedom in the left Rindler wedge\n\b\nR− = xμ x1 ≤ −|t| .\n(114)\n\nAfter this elimination, the dynamics in the right Rindler wedge is described by the density\nmatrix\nsc\n−2πH0sc /a\nρ = ρ0 e−2πH0 /a , ρ−1\n,\n(115)\n0 = tr e\nwith the Rindler space Hamiltonian (101).\nIV.\nA.\n\nELECTROMAGNETIC FIELDS IN RINDLER SPACE\nCanonical formalism\n\nHere we apply the canonical formalism developed above to the Maxwell field in Rindler\nspace-time. The Rindler metric (86) singles out the 1-direction and in the following we will\nrefer to the d spatial components (with x1 = ξ) with small and to the d − 1 perpendicular\ncomponents with capital Latin letters. The simplicity of the metric (86) gives rise to significant simplifications in the expressions of the relevant operators of the quantized theory. In\nparticular, with\np\n|g|g 00 = 1 ,\n\nit belongs to the class of metrics (48) where static charges do not couple to the transverse\nelectric field. In the transformation (cf. Eq. (53)) to the frequently used coordinate x′ 1 =\n1\neax /a (cf. [1],[2]) this simplifying feature gets lost and charge densities either external\nor associated with matter fields couple to the radiation field. On the other hand, this\ncoordinate transformation makes the construction of longitudinal and transverse gauge fields\nidentical to that in Minkowski space. We will now discuss the details of the quantized noninteracting Maxwell field in Rindler space using the metric (86). As shown in Sec. II C 1 the\ncoupling to external charges can be accounted for by including the classical solutions to the\ncorresponding inhomogeneous equations of motion (34) and (37) and will be addressed in\nSec. IV E. In Rindler space, the explicit form of the action of the Maxwell field (cf. Eq. (1))\nreads\nZ\nd h\nn\nX\n1\nd−1\n−2aξ\n2\nS =\n(∂0 AI − ∂I A0 )2\ndτ dξd x⊥ e\n(∂0 A1 − ∂1 A0 ) +\n2\nI=2\n−(∂1 AI − ∂I A1 )\n\n2\n\ni\n\n2aξ\n\n−e\n\nd\nX\n\no\n(∂I AJ − ∂J AI )2 ,\n\nJ>I=2\n\n19\n\n(116)\n\n\fand, in terms of transverse fields, the Hamiltonian (31) is given by\n1\nH0 =\n2\n\nZ\n\ndξd\n\nd−1\n\nn\n\n2aξ\n\nx⊥ e\n\n12\n\nΠ̂\n\n+\n\nd\nX\n\nI2\n\nΠ̂\n\nI=2\n\n+\n\nd\nX\n\n2\nF1I\n\n2aξ\n\n+e\n\nI=2\n\nd\nX\n\n2\nFIJ\n\nJ>I\n\n\u0001o\n\n,\n\n(117)\n\nwith\nFij = ∂i Âj − ∂j Âi .\n\nTo complete this explicit formulation of the dynamics we have calculated the canonical commutators (21) and sketch here the calculation for i = j = 1. Using the identity (cf. Eq. (15))\n1 + ∂1\n\n1\n1 2aξ 2\n∂1 =\ne ∂i ,\n∆\n∆s\n\n(118)\n\nand the completeness relation of the eigenfunctions of the Laplacian ∆s of the scalar wave\nequation (89) (cf. Eq. (95)) we obtain\nZ d−1\nZ\nd k⊥ 2 ik⊥ (x⊥ −x′⊥ )\na2\n1\n′\n[Π̂ (τ, x ), Â1 (τ, x)] = −i\n(119)\nd\nω\nz\ne\nki ω (z ′ )ki ωa (z) ,\n(2π) d−1\nω2 a\nwith the variable z defined by (cf. Eq. (92))\nz=\n\nk⊥ aξ\ne .\na\n\n(120)\n\nThis integral, and similar ones for the other commutators, can be evaluated in closed form.\nFor d = 3 for instance, we obtain\n\u0011−1/2\ni 2aξ 2 \u0010 4\n′\n[Π̂1 (τ, x′ ), Â1 (τ, x)] =\ne ∇⊥ s + 4s2 ea(ξ+ξ ) /a2\n(121)\n2πa\n\nwith the geodesic distance\n\ns2 =\n\n\u00112\n1 \u0010 aξ\naξ ′\ne\n−\ne\n+ (x⊥ − x′⊥ )2 .\na2\n\n(122)\n\nUsing similar identities, the commutator of the other components of the transverse gauge\nfields and the conjugate momenta can be calculated.\nB.\n\nNormal modes of transverse gauge fields\n\nThe equation of motion of the transverse fields are obtained by transverse projection of\nthe equations of motion (3) (or more easily from Eq. (49) by the substitution α̂i → Âi )\n∂τ2 Â1 − ∆s Â1 = 0 ,\n\n(123)\n\n∂τ2 ÂI − ∆s ÂI − 2ae2aξ ∂ I Â1 = 0 ,\n\n(124)\n\nwith the Laplacian ∆s of the scalar wave equation (89). With the ansatz\nÂI = âI +\n\n1 I\n∂ ∂1 Â1 ,\n∇2⊥\n\n20\n\n(125)\n\n\fthe equations of motion (124) of the perpendicular components ÂI of the transverse gauge\nfields turn into the wave equation of a scalar field\n∂τ2 âI − ∆s âI = 0 .\n\n(126)\n\nThe normal mode expansion of Â1 satisfying the equation of motion (123) for a vanishing\ncurrent is essentially that of a scalar field (Eq. (99))\nZ\ni\ndω d d−1 k⊥ a2 h\n−iωτ +ik⊥ x⊥\n√\n(127)\na\n(ω,\nk\n)e\n+\nh.c.\nz 2 ki ωa (z) .\nÂ1 (τ, ξ, x⊥ ) =\n1\n⊥\n(d−1)/2 ωk\n(2π)\n2ω\n⊥\nTo derive the normal mode expansion for the perpendicular components we observe that the\ntransversality condition (cf. Eqs. (17,20)) applied to Eq.(125) yields\n∂I âI = 0 ,\n\n(128)\n\nwhich, as in flat space can be implemented by defining creation and annihilation operators\nwith respect to a transverse basis eLi (k⊥ ), L = 2, . . . , d − 1 of polarization vectors with\nthe properties\nd\nX\nI=2\n\nkI eLI (k⊥ )\n\n= 0,\n\nd\nX\n\n′\neLI (k⊥ )eLI (k⊥ )\n\n= δL,L′ ,\n\nd−1\nX\nL=2\n\nI=2\n\neLI (k⊥ ) eLJ (k⊥ ) = δIJ −\n\nkI kJ\n. (129)\nk2⊥\n\nThe normal mode expansion\nZ\ndω d d−1 k⊥\n√\nÂI (τ, ξ, x⊥ ) =\n2ω (2π)(d−1)/2\nd−1\ni\nhn X\na kI\ndo\n*\neLI (k⊥ )aL (ω, k⊥ ) + i\nki ωa (z)e−iωτ +ik⊥ x⊥ + h.c. ,\na1 (ω, k⊥ )z\nωk⊥\ndz\nL=2\n\n(130)\n\nis thereby expressed in terms of the d − 2 unconstrained amplitudes aL , L = 2, d − 1.\nWith the above choice of the normalization in Eqs. (127) and (130), and requiring standard\ncommutation relations for creation and annihilation operators\n[ai (ω, k⊥ ), a†j (ω ′, k′⊥ )] = δij δ(ω − ω ′) δ(k⊥ − k′⊥ ) ,\n\ni, j = 1, . . . , d − 1 ,\n\n(131)\n\nthe commutation relations of the transverse gauge fields (cf. Eq.(119)) as implied by the\ncanonical commutation relations (11) and the definition of the transverse gauge fields (20)\nare satisfied.\n\nC.\n\nHamiltonian and scale transformations\n\nIn terms of the creation and annihilation operators, the Hamiltonian is given by\nH0 =\n\nZ\n\nd\n\nd−1\n\nk⊥\n\nZ\n\ndωω\n\nd−1\nX\ni=1\n\n21\n\na†i (ω, k⊥ )ai (ω, k⊥ ) .\n\n(132)\n\n\fThe same degeneracy with respect to the transverse momenta occurs as for the scalar field\n(cf. Eq. (101)) and can be analyzed following the discussion in Sec. III B. The transformation\nof the Maxwell field leaving the action (116) invariant is given by (cf. Eqs. (102), (103))\nA1,0 (τ, ξ, x⊥ ) → e(d−3)aξ0 /2 A1,0 (τ, ξ ′ , x′⊥ ) ,\nAI (τ, ξ, x⊥ ) → e(d−1)aξ0 /2 AI (τ, ξ ′, x′⊥ ) .\n\n(133)\n\nThe perpendicular components AI carry the same weight as the scalar field (102). The\nidentity\n∂i Ai (τ, ξ, x⊥ ) → e(d+1)aξ0 /2 ∂i′ Ai (τ, ξ ′, x′⊥ )\n\nguarantees that under the symmetry transformation, longitudinal and transverse components of the gauge field do not mix. The generator of the symmetry transformations,\n( d\n)\nZ\ni\nX h\n\u0001\nd\n−\n1\nQ = dξdx⊥\nΠi ∂ξ + a\n+ x⊥ ∇⊥ Ai − a Π1 A1 ,\n2\ni=1\n\nthe Hamiltonian and the perpendicular components of the momentum operator\nPI = i\n\nZ\n\ndξd\n\nd−1\n\nx⊥\n\nd\nX\n\nΠk (τ, ξ, x⊥ )∂I Ak (τ, ξ, x⊥ )\n\nk=1\n\nsatisfy the commutation-relations (106). Together with the rotations in the perpendicular\ncoordinates, these transformations are responsible for the degeneracy of the stationary states.\nThe basis for extending the symmetry considerations to interacting gauge fields is the\nbehavior of the (gauge-) covariant derivative under the scale transformations (Eqs. (133),\nand (103))\n∂1 − ieA1 (τ, ξ, x⊥ ) → ∂1′ − iê(ξ0 ) A1 (τ, ξ ′, x′⊥ )\n\u0001\n∂I − ieAI (τ, ξ, x⊥ ) → eaξ0 ∂I′ − iê(ξ0 ) AI (τ, ξ ′, x′⊥ ) ,\n\n(134)\n\nê(ξ0 ) = e(d−3)aξ0 /2 e .\n\n(135)\n\nwith the \"running coupling constant\"\n\nUnder the combined transformation of the scalar (102) and the gauge field (133) the action\nof scalar QED with a massless scalar field is thus reproduced up to a change in the coupling\nconstant\nS[A, φ, e] → S[A, φ, ê(ξ0 )]\n\nİn the 4-dimensional Rindler space (d = 3), the combined transformation of scalar and gauge\nfields leaves the action invariant. The same argument applies for massless fermions coupled\nto gauge fields with action (cf. [24], [27])\nZ\nn\n\u0001\n\u0001\n\u0001o\na\nS = dτ dξdd−1x⊥ ψ̄ i γ 0 ∂0 − ieA0 + γ 1 ∂1 + − ieA1 + eaξ γ I ∂I − ieAI ψ ,\n2\n\nwith γ μ denoting here the flat space Dirac matrices. The transformation of the fermion\nfields\nψ(τ, ξ, x⊥ ) → e(d−1)aξ0 /2 ψ(τ, ξ ′, x′⊥ ) ,\n(136)\n22\n\n\fcombined with the transformation of the gauge fields yields\nS[A, ψ, e] → S[A, ψ, ê(ξ0 )] .\n\n(137)\n\nFinally we may apply this reasoning to SU(N) gauge theories and use the transformation\n(133) for each color component of the gauge field with the resulting transformations of the\nfield strength components (77)\na\na\nF01\n(τ, ξ, x⊥ , gY M ) → e(d−3)aξ0 /2 F01\n(τ ′ , ξ ′ , x′⊥ , ĝY M (ξ0 )) ,\n\n(138)\n\nwith\nĝY M (ξ0 ) = e(d−3)aξ0 gY M .\na\na\na\nThe transformation of the other components of the field strength F0I\n, F1I\n, FIJ\ndiffer in their\n(d−3)aξ0 /2\n(d−1)aξ0 /2 (d−1)aξ0 /2 (d+1)aξ0 /2\nweights, with e\nin (138) being replaced by e\n,e\n,e\nrespectively. Similarly if massless fermion fields are minimally coupled to the gauge fields each of\ntheir color components ψ α is subjected to the transformation (136) with the total change in\nthe action given by\nS[A, ψ, gY M ] → S[A, ψ, ĝY M (ξ0 )] .\n(139)\n\nThus, in 4-dimensional Rindler space, the combined transformation (138,136) leaves the\naction of QCD (with massless quarks) invariant.\nD.\n\nUnruh temperature of the radiation field\n\nFollowing the method outlined in Sec. III C we derive the relation of the gauge field\noperators between inertial and accelerated frames. We denote with Ãi (t, x, x⊥ ) the gauge\nfield in the inertial system in the Weyl gauge\nÃ0 (t, x, x⊥ ) = 0.\nUnder the coordinate transformation (84) the i ≥ 2 components of the gauge field remain\ninvariant, while\nÃ′′0 = eξa Ã1 sinh aτ , Ã′′1 = eξa Ã1 cosh aτ .\n(140)\nThe transformed field Ã′′ can be identified with the gauge field A defined in the accelerated\nsystem only up to a gauge transformation. In particular for the comparison with A we have\nto transform Ã′′ to the Weyl gauge. This is achieved by the gauge transformation\nÃ′μ = Ã′′μ − ∂μ χ(τ, ξ, x⊥ ) ,\n\n(141)\n\nwith ∂μ denoting the derivatives with respect to the coordinates τ, ξ, x⊥ . The gauge function\nZ τ\nχ(τ, ξ, x⊥ ) =\ndτ ′ Ã′′0 (τ, ξ, x⊥ ) + χ(0) (ξ, x⊥ )\n(142)\nis determined only up to a τ −independent arbitrary function χ(0) reflecting the residual\ngauge invariance in the Weyl gauge. At this level the transformed fields Ã′ can be identified\nwith the gauge fields A\nAi (τ, ξ, x⊥ ) = Ã′i (t, x)\n.\n(143)\nt,x=t,x(τ,ξ)\n\n23\n\n\fFor translating this identity into a relation between the creation and annihilation operators,\nwe have to eliminate the longitudinal components. The Gauss law requires in the space of\nphysical states (with ∂ ̃ denoting the partial derivatives with respect to t, x)\nΠ̃i(l) = −∂ ̃0 Ãi(l) = 0 ,\ni.e. the longitudinal gauge field is time independent and can therefore be written as\nÃμ(l) = ∂ ̃μ λ̃(x, x⊥ ) .\n\n(144)\n\nThe transverse field satisfies the covariant transversality condition\n∂ ̃μ Ãˆμ = 0.\nWe write the components of the gauge field after the coordinate transformation to the\naccelerated frame (140) as\nÃ′′μ = Ãˆ′′μ + Ã′′(l) μ ,\n\nÃ′′(l)μ = ∂μ λ̃ ,\n\n(145)\n\nwhere Ãˆ′′μ denotes the transformed components of the part of the gauge field which is transverse in the inertial frame. After gauge transformation to the Weyl gauge (141)\n1 ′′\nÃ − ∂μ χ(0) (ξ, x⊥ )\n∂0 0\n\u0001\n1 ˆ′′\nÃ0 + ∂0 λ̃ − ∂μ χ(0) (ξ, x⊥ )\n= Ãˆ′′μ + ∂μ λ̃ − ∂μ\n∂0\n\nÃ′μ = Ã′′μ − ∂μ\n\nwe arrive at\n\n(146)\n\n1 ˆ′′\nÃ′μ = Ãˆ′′μ − ∂μ\nÃ − ∂μ χ(0) (ξ, x⊥ ) .\n(147)\n∂0 0\nHere the term ∂μ χ(0) (ξ, x⊥ ) appears as an yet undetermined, possible zero mode when inverting ∂0 . According to Eq. (147), and after adjusting properly this τ independent gradient\n(i.e. subtracting the τ -independent longitudinal field in the accelerated frame), the transverse field in the accelerated frame is given in terms of the transverse field in the inertial\nsystem. We therefore identify the transverse components of the fields appearing in Eq. (143)\nÂi (τ, ξ, x⊥ ) = Ãˆ′i (t, x)\n\nt,x=t,x(τ,ξ)\n\n.\n\n(148)\n\nThe explicit expressions for the transverse gauge fields transformed from the inertial to the\naccelerated frame are\nZ τ\n\u0001\nˆ\n′\nξa\nξa\nÃ1 (ξ, τ, x⊥ ) = e Ã1 t(τ, ξ), x(τ, ξ), x⊥ − ∂ξ e\ndτ ′ Ã1 (t(ξ, τ ′ ), x(ξ, τ ′ ), x⊥ ) sinh aτ ′ ,\nÃˆ′I (ξ, τ, x⊥ ) = ÃI t(τ, ξ), x(τ, ξ), x⊥ − ∂I eξa\n\u0001\n\nZ\n\n(149)\n\nτ\n\ndτ ′ Ã1 (t(ξ, τ ′ ), x(ξ, τ ′ ), x⊥ ) sinh aτ ′ , (150)\n\nwith the standard normal mode expansion of the transverse gauge field in the inertial frame\nÃˆi (t, x) =\n\nZ\n\nd−1\n\nhX\ni\ndd k\nΛ\n−iωk t+ikx\n√\nẽ\n(k)\nã\n(k\n,\nk\n)e\n+\nh.c.\n.\nΛ\n1\n⊥\n2ωk (2π)d/2 Λ=1 i\n24\n\n(151)\n\n\fThe d − 1 dimensional transverse basis ẽΛ (k) is defined in analogy with Eq. (129), and\nthe annihilation ãΛ (k1 , k⊥ ) and creation ã†Λ (k1 , k⊥ ) operators satisfy standard commutation\nrelations.\nFrom this point on we may proceed along similar lines as in the case of the scalar field\nand project Eq. (148) onto the normal modes of the transverse gauge fields in the accelerated system (cf. Eqs. (127) and (130)). Here we give the details for the i = 1 component of\nEq. (148). Projection of Â1 yields (cf. Eq. (120))\nZ\n\u0011\n1\n(2π)(d−1)/2 a2 \u0010\ndξd d−1x⊥ Â1 (τ, ξ, x⊥ ) 2 ki Ω (z)e−ik⊥ x⊥ = √\na1 (Ω, k⊥ )e−iΩτ + a†1 (Ω, −k⊥ )eiΩτ .\na\nz\n2ΩΩk⊥\n(152)\nProjecting the right-hand side of (148) and using the definition (149) we obtain\nZ\nZ\nd−1\ndk1\n1 X Λ\n1\nˆ\n−ik⊥ x⊥\nd−1\n′\n√\n√\n=\nki Ω (z)e\ndξd x⊥ Ã1 (t, x)\nẽ1 (k1 , k⊥ )ãΛ (k1 , k⊥ )\na\nt,x=t,x(τ,ξ) z 2\n2π 2ωk Λ=1\nZ τ\nZ ∞\nn cosh aτ Z ∞ dz\na\ndz\n′\niκ(τ )z\n′\n′\n−\nk\nΩ (z)e\nki Ω (z)eiκ(τ )z\ndτ\nsinh\naτ\n*\ni\n2\n2\na\na\nk⊥\nz\nk⊥\nz\n0\nZ τ 0\nZ ∞\no\ndz\na\n′\ndτ ′ sinh aτ ′ sinh(βk − aτ ′ )\nki Ω (z)eiκ(τ )z + (h.c., k⊥ → −k⊥ ) . (153)\n−i\na\nk⊥\nz\n0\nThe quantities κ and βk are defined in Eq.(111). The above expression contains two divergent\nintegrals over z near z = 0. However, a partial integration of the second one with respect\nto τ gives an integrated term which cancels the first one leaving a convergent integral over\nz. This contribution together with the other convergent term gives\nZ\nZ ∞\nωk a2\n1\ndk1\n1\nˆ\nd−1\n′\n−ik⊥ x⊥\n√\n√\ndξd x⊥ Ã1 (t, x)\n=\ni\nk\nΩ (z)e\nia\n2\nΩ\nt,x=t,x(τ,ξ) z 2\n2π 2ωk k⊥\n−∞\n(\ns\nd−1\nX\n2\nΩ\u0010\niπ \u0011 Λ\n*\nsin\nβk − aτ −\nẽ (k1 , k⊥ )ãΛ (k1 , k⊥ )\na\n2 1\naΩ sinh π Ωa Λ=1\n)\nΩ\u0010\niπ \u0011 ⋆ Λ\n†\n+ sin\n− βk + aτ −\nẽ (k1 , −k⊥ )ãΛ (k1 , −k⊥ ) .\n(154)\na\n2 1\n\nIdentification of Eqs. (152) and (154) establishes the relation between the creation and annihilation operators in the two coordinate systems,\nZ\n1 ωk i Ω β k\n1\ndk\n√ 1 √\na1 (Ω, k⊥ ) = q\ne a\nk\n2ω\nΩ\n2π\n⊥\nk\na sinh π π\nd−1 h\ni\nX\nπΩ\nπΩ\n*\ne 2a ẽΛ1 (k1 , k⊥ )ãΛ (k1 , k⊥ ) − e− 2a ẽ⋆1 Λ (k1 , −k⊥ )ã†Λ (k1 , −k⊥ ) .\nΛ=1\n\nThe relation of the perpendicular gauge field components are obtained in a similar manner.\nThe final result for the relation between the creation and annihilation operators in the inertial\nand the accelerated frames (cf. the corresponding expression (112) for the scalar field) reads\nZ\nh πΩ\ni\ndk1\n1\n1\n†\niΩ\nβk\n− πΩ\na\n2a\n2a\n√\n√\ne b̃i (k1 , k⊥ ) + e\nai (Ω, k⊥ ) = q\ne\nb̃i (k1 , −k⊥ ) . (155)\n2π 2ωk\na sinh π Ωa\n25\n\n\fThe appearance of the 2 systems of polarization vectors, the d−2 dimensional basis of polarization vectors eL (k⊥ ) in Eq. (129) and the d − 1 dimensional basis ẽΛ (k1 , k⊥ ) in Eq. (151),\nmade the following redefinition of the creation and annihilation operators necessary\nb̃L (k1 , k⊥ ) =\n\nd−1 X\nd−1\nX\n\nẽΛI (k1 , k⊥ )eLI (k⊥ )ãΛ (k1 , k⊥ ) ,\n\nI=2 Λ=1\n\n2 ≤ L ≤ d− 1,\n\n(156)\n\nand the rescaling\nd−1\nωk X Λ\nb̃1 (k1 , k⊥ ) =\nẽ (k1 , k⊥ ) ãΛ (k1 , k⊥ ) ,\nk⊥ Λ=1 1\n\n(157)\n\nresulting in a system of creation and annihilation operators with standard commutation\nrelations\n\u0003\n\u0002\nb̃i (k1 , k⊥ ), b̃†j (k1′ , k′⊥ ) = δij δ(k1 − k1′ )δ(k⊥ − k′⊥ ) i, j = 1, . . . , d − 1 .\n(158)\n\nAs a consequence, the result (113) for the scalar field applies directly to the Maxwell field\nand we find for the average particle number for the d − 1 degrees of freedom in the inertial\nframe ground state\nh0M |a†i (Ω, k⊥ )aj (Ω′ , k′⊥ )|0M i =\n\n1\n2π Ω\na\n\ne\n\n−1\n\nδij δ(Ω − Ω′ )δ(k⊥ − k′⊥ ) .\n\n(159)\n\nWith the relation (155) between the Rindler and Minkowski space creation and annihilation\noperators, we can proceed as in the case of the scalar field [3],[26]. The relation of the left\nRindler wedge operators with the Minkowski operators differs from the relation (155) only\nin the sign of the phase Ωβk /a. Given these two sets of equations the Minkowski vacuum\ncan be expressed in terms of correlated product states in R+ and R−\np\nY\nX\ne−πnα Ωα /a |nα i+ ⊗ |nα i− , Nα = 1 − e−2πΩα /a .\n(160)\n|0M i =\nNα\nα\n\nnα\n\nThe structure of this relation is the same as for the scalar field [26]. The index α specifies\nbesides transverse momenta k⊥ and energy Ω (cf. Eq. (155)) the d − 1 polarization states.\nFor observables built exclusively from degrees of freedom in R+ , the matrix elements are\ngiven in terms of the density matrix (115) with the Hamiltonian (132) of the Maxwell field.\nWe illustrate this result by computing the energy density of the Maxwell field. As for\nthermal expectation values we calculate the expectation values in the Minkowski vacuum by\nassuming the operators to be normal ordered with respect to the Rindler vacuum. Using the\nnormal mode expansion of the gauge fields (127), (130) the properties of the polarization\nvectors (129) and the above relation between Rindler and Minkowski space creation and\n\n26\n\n\fannihilation operators we find for the electric and magnetic energy densities (cf. Eq. (117))\nh0M |HE |0M i =\n=\nh0M |HB |0M i =\n=\n\nd\nn\no\nX\n1\nh0M | : e2aξ Π̂1 2 +\nΠ̂I 2 : |0M i\n2\nI=2\nZ\nh\n1\nd−2 (1−d)aξ\ndω 2π ω\n(d − 1)a e\nω2 +\ne a −1\nd\nd\nn\no\nX\nX\n1\n2\n2aξ\n2\nh0M | :\nF1I + e\nFIJ : |0M i\n2\nI=2\nJ>I\nZ\nh\n1\nd−2 (1−d)aξ\ndω 2π ω\n(d − 1)a e\nω2 +\ne a −1\n\ni\na2\n(d − 1) I(d − 2, ω)\n2\n\ni\na2\n(d − 1)(d − 2) I(d − 2, ω) ,\n2\n(161)\n\nwith (cf. [22])\naΩλ\nI(λ, ω) =\n2ω(2π)λ+1\n\nZ\n\n∞\n0\n\nxλ ki2ω (x) dx =\na\n\n) \u00101 + λ\nω λ Γ2 ( 1+λ\nω\u0011 2\nΩλ\n2\nΓ\n,\nsinh\nπ\n2\n+\ni\n(2π)λ+3\na Γ(1 + λ)\n2\na\n\nand Ωλ denotes the volume of the λ-dimensional sphere. For d = 3 our result for the energy\ndensity\nZ\n1 −2aξ\nω 2 + a2\nh0M |HE + HB |0M i = 2 e\nωdω 2π ω\n(162)\nπ\ne a −1\nagrees with the results obtained in [10], [25] and with the result for classical random radiation\nin [28]. The spectrum differs from the Planck spectrum, i.e. the density of states is not that\nof black-body radiation. In agreement with earlier findings [11] we note that as a result of\nthe integration over k⊥ (cf. [29]) and the property\n\u00012\n+ iμ\n1\n1\n= μ−1 2πμ\n,\n\u0011 2 2πμ\ne −1\ne +1\nΓ 1 + iμ\nΓ\n\n1\n2\n\n(163)\n\nthe characteristic Bose-Einstein denominator is replaced in odd space-time dimensions d + 1\nby the Fermi-Dirac denominator 1 + exp(2πω/a) .\nFrom Eq. (161) we conclude that the action density\nZ\n1\n(d − 1)(3 − d) d (1−d)aξ\ndω 2π ω\nh0M |s|0M i = h0M |HE − HB |0M i =\na e\nI(d − 2, ω) (164)\n4\ne a −1\nvanishes for d = 3, is positive for d = 2 and negative for d ≥ 4. Thus in Rindler space,\nthe Maxwell field develops in general a non-vanishing photon condensate. In 5 and higher\ndimensional Rindler spaces the photon condensate is dominated by the magnetic fluctuations\nas is the case for the gluon condensate in (4-dimensional) QCD [30].\nE.\n\nGauge fields coupled to external currents\n\nHere we discuss the relation between the gauge fields in inertial and accelerated frames if\nexternal currents are present. This is an important topic when comparing the observations\n27\n\n\fof inertial and accelerated observers. In particular the absence of bremsstrahlung for the\nco-accelerated observer has been a central issue in this discussion.\nAs above we start with the identification of the Heisenberg operators in the Rindler space and\nin the right Rindler wedge R+ of Minkowski space. According to the results of Secs. II C 1\nand II C 2, the identification of the fields involves on the one hand the Heisenberg operators\nof the Maxwell field in the absence of sources and on the other the (c-number) solutions of\nthe classical Maxwell equations coupled to the external currents. Therefore the identification\n(148) of the transverse gauge field operators remains valid together with the relation (155)\nbetween creation and annihilation operator. The c-number part is obtained by solving the\nequations of motion (49) for the classical transverse gauge field α̂i which in Rindler space\nread (cf.Eqs. (123), (124))\n1\n∂j (e2aξ j j ) ,\n∆\n1\n∂τ2 α̂I − ∆s α̂I − 2ae2aξ ∂ I α̂1 = e2aξ j I + ∂ I ∂j (e2aξ j j ) .\n∆\n∂τ2 α̂1 − ∆s α̂1 = e2aξ j 1 + ∂ 1\n\nThe c-number solutions of the Maxwell equation in the two frames are easily identified. We\nmay for instance solve the equations of motion in Minkowski space, perform the coordinate\ntransformation to Rindler space, carry out the necessary gauge transformations to the Weyl\ngauge and compute the transverse gauge field and the electric field. In this procedure it\nis essential that in the space of physical states, the eigenvalue of the longitudinal electric\nfield operator is a solution of the Maxwell equations. Furthermore the gauge freedom of the\nauxiliary fields α (Eq. (37)) and the freedom in the choice of the time independent integration\ni\nconstants E(l)\n(x) in Eq. (35) and χ0 (ω, k⊥ ) to be derived below (Eq. (168)) are essential for\nestablishing the relation between the classical fields in Minkowski and Rindler spaces.\nGiven the general structure (61) of the Heisenberg field operators after decoupling of the\nexternal currents and given the relation (155) between Minkowski and Rindler space creation\nand annihilation operators, it is obvious that at the level of fields or bilinears of fields\nthe classical considerations concerning the relation between Minkowski and Rindler space\nobservables are essentially unchanged. In the case of the energy momentum tensor the\nclassical result is modified only by an additive contribution from the Unruh radiation of\nthe free Maxwell field. In particular, the resolution of the equivalence principle paradox\nconcerning the absence of radiation in a co-accelerated frame given in [31] remains valid\n(cf. also [32]).\nThe interplay between classical and quantum fields becomes more subtle in the time\nevolution of the states. For this purpose it is convenient to express the unitary transformation\nW (24) in terms of the amplitudes of the normal modes introduced in Sec. IV B. We start\nwith the identity (45) (cf. also Eq. (46))\nZ\nd\nΦ̂H = − dξe2aξ d d−1 x⊥ ÂHi j i .\n(165)\ndτ\nWritten in terms of the normal mode expansions (127, 130) this equation reads\ndΦ̂H\n=−\ndτ\n\nZ\n\ndω\n\nZ\n\nd d−1 k⊥\n\nd−1 \u0010\n\u0011\nX\nai (ω, k⊥ )e−iωτ Jˆi (τ, ω, k⊥ ) + h. c. ,\ni=1\n\n28\n\n\fwith\nZ\nZ\nd d−1 x⊥ ik⊥ x⊥ ∞ a2 z 2\n1\n1\nˆ\ne\ndz 2\nJ (τ, ω, k⊥ ) = √\n(2π)(d−1)/2\nk⊥\n2ω 3\n0\n\u0010a\nkI\nd\u0011\n(166)\n*\nki ωa (z) ,\nzj 1 (τ, z, x⊥ ) + i j I (τ, z, x⊥ )\nk⊥\nk⊥\ndz\nZ\nZ\nd\naz X L\n1\nd d−1 x⊥ ik⊥ x⊥\nL\nˆ\ne\ne (k⊥ )j I (τ, z, x⊥ )ki ωa (z) .\ndz 2\nJ (τ, ω, k⊥ ) = √\n(2π)(d−1)/2\nk⊥ I=2 I\n2ω\n\n(167)\n\nIntegration over time and transformation back to Schrödinger operators yields\nΦ̂(τ ) = −\n\nZ\n\ndω\n\nwith\ni\n\nχ (τ, ω, k⊥ ) =\n\nZ\nZ\n\nd d−1 k⊥\n\nd−1 \u0010\nX\ni=1\n\nτ\n\n\u0011\nai (ω, k⊥ )χi (τ, ω, k⊥ ) + h. c. ,\n\n′\ndτ ′ eiω(τ −τ ) Jˆi (τ ′ , ω, k⊥ ) + χi0 (ω, k⊥ )eiωτ .\n\n(168)\n\nThe arbitrariness in the time integration of Φ̂H reflects the ambiguity in the choice of Green's\nfunction. The choice χi0 (ω, k⊥ ) = 0 corresponds to the retarded and\nZ ∞\n′\ni\nχ0 (ω, k⊥ ) = −\ndτ ′ e−iωτ Jˆi (τ ′ , ω, k⊥ )\nto the advanced propagator.\nThe time evolution in the longitudinal and in the transverse sector of the Hilbert space are\nindependent of each other. The unitary transformation W (24) is a product of operators\nacting separately on the state vectors in the corresponding sector\nW (τ ) = eiΦ̂(τ ) eiΦ(l) (τ ) ,\n\n|ψ(τ )i = |ψ̂(τ )i |ψ(l) (τ )i ,\n\nwith |ψ(l) i being eigenstates of the longitudinal electric field. Since |ψ(l) (τ0 )i is a state with\nvanishing electric field we conclude that at time τ\nΠi(l) |ψ(l) (τ )i = −∂ i\n\n1 2aξ 0\ne j (τ, ξ, x⊥ )|ψ(l) (τ )i ,\n∆\n\ni.e. the longitudinal electric field is given by the Coulomb field generated (instantaneously)\nby the charge density j 0 .\nWith the ground state as the initial state we find\niΦ̂(τ ) −iH0 (τ −τ0 )\n\ne\n\ne\n\n|0i = C(χ) exp\n\nn\n\n−i\n\nZ\n\ndω d\n\nd−1\n\nk⊥\n\nd−1\nX\n\na†i (ω, k⊥ )χi ⋆ (τ, ω, k⊥)\n\ni=1\n\nwhere C(χ) arises from normal ordering exp Φ̂\no\nn 1Z\ndωd d−1k⊥ |χi (τ, ω, k⊥ )|2 .\nC(χ) = exp −\n2\n29\n\no\n\n|0i ,\n\n(169)\n\n(170)\n\n\fBy projection of the time evolved ground state on the relevant Fock components, the associated probabilities and henceforth the photon production rates are easily calculable without\nhaving to invoke perturbation theory in the coupling.\nFormally the above expression together with the definition (168) of χ apply to the time\nevolution in Minkowski space as well, with the Fourier components given by\nˆL\n\nJ (t, k) =\n\nZ\n\n(2π)\n\nd dx\n√\nd/2\n\nikx\n\n2ωk\n\ne\n\nd\nX\n\neLI (k)ĵ I (t, x) ,\n\nI=1\n\nL = 1, . . . , d − 1.\n\n(171)\n\nThe study of the time evolution is pertinent to the issue of bremsstrahlung generated by\na uniformly accelerated charge and observed either in the inertial or in the co-accelerated\nframe. The probability to observe the system at the time τ in a state characterized by\nthe occupation numbers mα , with α standing for ω, k⊥ and the polarization, is given by\n(cf. Eqs. (115), (160))\nhY\ni Y\nX\n(172)\ne−2πnα Ωα /a |Mmα ,nα |2 .\nP (0M → {mα }) = tr\n|mα ihmα |ρ(τ ) =\nNα2\nα\n\nα\n\nnα\n\nAfter a straightforward calculation one obtains the following closed expression for these\nmatrix elements\n√\nμ(nα ,mα )\nX\nnα ! mα !\n(−1)k mα −k ⋆nα −k\nnα +mα − 12 |χα |2\nMmα ,nα = (−i)\ne\nχα\nχα\n,\n(173)\n(nα − k)!(mα − k)! k!\nk=0\nwith\nμ(nα , mα ) = Min (nα , mα ) .\nExpression (172) together with the matrix elements (173) contain the complete information\nabout the time evolution. In the perturbative limit only the term k = μ(nα , mα ) is retained\nand the one photon emission and absorption probabilities become\n|Mnα +1,nα |2 ≈ (nα + 1) |χα |2 ,\n\n|Mnα −1,nα |2 ≈ nα |χα |2 .\n\n(174)\n\nMost of the discussion on the connection between Rindler and Minkowski space have\nbeen carried out in the context of scalar field theory. We conclude this section by compiling\nthe equations relevant for such studies. According to Eq. (57), the exponent of the unitary\ntransformation w (55) satisfies in Rindler space the differential equation\nZ\nZ\n\u0010\n\u0011\ndφH\n2aξ\n= − e dξ dx⊥ ρφ = − dωdd−1k⊥ a(ω, k⊥ ) e−iωτ ρ(τ, ω, k⊥ ) + h.c. ,\ndτ\nwhere we have used the normal mode expansion in Eq. (99) and have introduced\nZ\n1\ndd−1 x⊥\nρ(τ, ω, k⊥ ) = √\neik⊥ x⊥ ki ωa (z)ρ(τ, z, x⊥ ) .\nazdz\n(d−1)/2\n2\n(2π)\n2ω k⊥\n\n(175)\n\nCarrying out the time integration and transforming back to Schrödinger operators we find\nZ\n\u0010\n\u0011\nφ(τ ) = dω dd−1 k⊥ a(ω, k⊥ )χ(τ, ω, k⊥ ) + h.c. ,\n30\n\n\fχ(τ, ω, k⊥ ) =\n\nZ\n\nτ\n\n′\n\ndτ ′ eiω(τ −τ ) ρ(τ ′ , ω, k⊥) + χ0 (ω, k⊥ )eiωτ .\n\nThe c-number contribution to the energy (59) is given by\nZ\n1\nsc\ne2aξ dξ dd−1 x⊥ ρ(τ, ξ, x⊥ )α(τ, ξ, x⊥ ) ,\nh (τ ) =\n2\nwith the solution α of the inhomogeneous wave equation (cf. Eqs. (88) and (89))\ni\nh\n∂τ2 − ∆s + m2 e2aξ α = −e2aξ ρ .\nF.\n\n(176)\n\n(177)\n\n(178)\n\nInitial value problems and bremsstrahlung\n\nImportant for understanding the relation between physics in Rindler and Minkowski\nspaces is the issue of bremsstrahlung of a uniformly accelerated charge. While observed\nin an inertial frame, a co-accelerated observer will measure a static electric field rather\nthan photons. In the context of classical physics [31] this puzzle has been resolved by\nthe observation that the radiation is emitted into a region which is inaccessible to the coaccelerated observer. In a quantum mechanical treatment and considering the static charge\nas a limit of an accelerated charge, some remnant of the radiation has been found to persist\n[12, 33] and to get enhanced by the divergence of the occupation probability (cf. Eq. (159))\nin the infrared limit. The net result is an emission and absorption rate of photons in the \"coaccelerated \" frame whose sum is identical to the production rate in the inertial frame. This\nmethod has been applied also to the case of a uniformly accelerated scalar source [34] , [35]\nand has been extended in a calculation of the emission rate of a Unruh-DeWitt detector [36].\nWe will verify these results within our approach and in order to avoid difficulties associated\nwith an \"eternal\" acceleration we will analyze the relation between the physics in Rindler\nand Minkowski spaces in the presence of a uniformly accelerated charge by formulating an\nappropriate initial value problem.\n1.\n\nScalar radiation\n\nWe assume a pointlike scalar source to be located at the fixed position ξ = 0, x⊥ = 0\n(cf. Eq. (175))\nq(τ )\n1\nρ(τ, ω, k⊥ ) = q0 σ(τ )ρ(ω, k⊥ ) = √\n,\nki ωa (k⊥ /a)\n(d−1)/2\n(2π)\n2ω\n\n(179)\n\nwith its strength\nq(τ ) = q0 σ(τ )\nbeing turned on in the interval\nwith\n\nτ0 ≤ τ ≤ τ0 + δτ ,\nσ(τ ) = 0 for τ ≤ τ0 ,\n\nσ(τ ) ≈ 1 for τ ≥ τ0 + δτ .\n\n31\n\n(180)\n\n\fFor times later than τ0 + δτ , σ(τ ) may differ from the asymptotic value by exponentially\nsuppressed corrections as is the case with the following ansatz\nσ(τ ) = θ(τ − τ0 ) (1 − e−λ(τ −τ0 ) ) ,\n\nλ ∼ 1/δτ .\n\nIn perturbation theory, the rate of emission of one particle with frequency ωα is given by\n(cf. Eq. (174))\nZ τ\nd|χα |2\nsin ωα (τ − τ ′ ) dσ(τ ′ )\n2\n2\nr+ (ωα , k⊥ ) = (nα + 1)\n= (nα + 1) q0 ρ(ωα , k⊥ ) 2σ(τ )\n.\ndτ ′\ndτ\nωα\ndτ ′\nτ0\n(181)\nWe have used χ0 = 0 and carried out an integration by parts. In this way the integral\neffectively extends only over the time interval (180). At asymptotic times τ ≫ τ0 + δτ only\nfrequencies ωα ≪ 1/δτ contribute, i.e. turning on the source affects only long wavelength\nmodes and we can write\nr+ (ωα , k⊥ ) ≈ 2(nα + 1) q02 ρ(ωα , k⊥ )2\n\nsin ωα (τ − τ0 )\n→ 2π(nα + 1)q02 ρ(ωα , k⊥ )2 δ(ωα ) . (182)\nωα\n\nAt this point we essentially can follow the arguments given in [35]. We note that for ω ≪ a\n(cf. Eq. (94), (175))\n√\n2ω\nK0 (k⊥ /a) ,\n(183)\nρ(ω, k⊥ ) →\na (2π)d/2\nand therefore the rate r(ωα , k⊥ ) vanishes. However the divergent occupation probability in\nthe Unruh heat bath compensates the infrared decrease of the rate. The total rate observed\nlong after the source has been switched on is given by\nr+ (k⊥ ) =\n\nZ\n\n∞\n0\n\ndω(1 − e−2πω/a )\n\n∞\nX\n\n(nω + 1)e−2πnω ω/a r+ (ω, k⊥ ) =\n\nnω =0\n\nq02\nK02 (k⊥ /a) . (184)\nd\na(2π)\n\nDue to the infrared enhancement by the Unruh heat bath, the emission rate remains affected\nat arbitrary late times by the process of turning on the source. The absorption rate r−\n(cf. Eq. (174)) is identical to the emission rate and, in agreement with the result of [35] the\ntotal rate r = r+ + r− can be shown to coincide with the one particle production rate. This\nis a straightforward calculation in Minkowski space with the scalar source given by (here\nthe corrections from switching on the source are negligible for sufficiently late times)\nρ(t, k) =\n\n2.\n\n1\n\n(2π)\n\n√\nd/2\n\n2ωk\n\nq eik1\n\n√2\n\nt +1/a2\n\n1\np\n.\n2\na t + 1/a2\n\nPhotons\n\nIn Weyl gauge, the source of the radiation is the spatial part of the current. If generated\nby a point charge at rest at ξ = 0 in the accelerated frame the only non vanishing spatial\ncomponent of the current in the inertial frame is given by\nj 1 (t, x, x⊥ ) = q0 √\n\n√\n\u0001\na2 t\nδ(x⊥ )δ ax − a2 t2 + 1 .\n1 + a2 t2\n32\n\n(185)\n\n\fFrom Eqs. (171) and (168) it is straightforward to derive the following expression for χ1\nZ t\nq\n2\nat′\nq02 k⊥ 2\n2\n−ikt′ +ik1 t′ 2 + 12\n′\n1\na\n√\ndt\n.\n(186)\nχ (t, k) =\ne\n(2π)d 2k k 2\n1 + a2 t′ 2\nFrom here on we follow the computation [33] of the total emission rate of photons with given\ntransverse momentum k⊥ . By integrating the above expression over the 1-component of the\nphoton momenta and dividing by the proper time during which the charge is accelerated we\nobtain\nZ ∞\n\u0010k \u0011 2\n1\n2q02\n2\n⊥\nr(k⊥ ) =\nK\ndk1 χ1 (t, k1 , k⊥ ) =\n.\n(187)\n1\nT (t) −∞\n(2π)d a\na\nChanges in r(k⊥ ) due to switching on or off the current are negligible if the acceleration\nlasts for a sufficiently long (proper) time T (t).\nIn electrodynamics, current conservation requires a more complicated procedure for comparing photon emission and absorption rates in accelerated and inertial frames. We adopt\nthe dipole arrangement of [12, 33] with the following current in the accelerated frame\nj 0 = q0 σ(τ )e−2aξ [δ(ξ) − δ(ξ − L)]δ(x⊥ ) ,\n\nj 1 = q0 σ̇(τ )e−2aξ θ(ξ)θ(L − ξ)δ(x⊥ ) ,\n\n(188)\n\nwith the time dependence σ(τ ) to be specified later. In the limit L → ∞, the normal mode\ncomponent of the current defined in Eq. (166) is given by\nr\nπω\n2q\nσ̇(τ\n)\n1\n0\nsinh\nM(k⊥ , ω) ,\n(189)\nJˆ1 (τ, ω, k⊥ ) =\nd+1\na\na\nω(2π) 2\nwith\nM(k⊥ , ω) =\n\nω2\n+\na\nak⊥\n\nk⊥\n−Ki′ ω ( )\na\n\nZ\n\n∞\nk⊥\na\n\ndz\nKi ωa (z) ,\nz\n\nwhich implies (cf. Eq. (168) with χ0 = 0) the following expression for χ1\nr\n2q0 eiωτ\n1\nπω\n1\nχ (τ, ω, k⊥) = f (τ, ω)\nsinh\nM(k⊥ , ω) ,\nd+1\na\na\nω(2π) 2\nwhere f (τ, ω) is defined as\nf (τ, ω) =\n\nZ\n\nτ\n\n′\n\ndτ ′ e−iωτ σ̇(τ ′ ) .\n\n(190)\n\n(191)\n\n(192)\n\nAfter including the occupation probabilities of the Rindler photons in the Minkowski vacuum, the photon emission rate (cf. Eq. (187)) becomes\nZ\n\u0010\n\u0011\n1\n1 ∞\ndω|χ1(τ, ω, k⊥)|2 1 +\n.\n(193)\nr+ (k⊥ ) =\n2πω\nτ 0\n1 − e− a\n\nIt is now easy to verify that the choice of the time dependence\n√\nσ(τ ) = 2 cos Eτ θ(τ )θ(T − τ ) ,\n\n(194)\n\nand taking the consecutive limits T → ∞ and E → 0 reproduces the result obtained in\n[12, 33]\nk⊥ 2\nq02\nK1 ( ) ,\n(195)\nr+ (k⊥ ) =\nd\n(2π) a\na\n33\n\n\fwhich, after multiplication with a factor of 2 accounting for the process of absorption of\nphotons, agrees with the inertial frame result (187).\nFor interpretation of this correspondence between the results for the total rates in the\ninertial and accelerated frame as an effect of switching on and off the coupling to the radiation\nfield the modulation of the current is not necessary. This can be verified with the following\nchoice for σ(τ )\ni\nih\nh\n2\n2\n(196)\nσ(τ ) = 1 − e−λ(τ −τ0 ) 1 − e−λ(τ +τ0 ) θ(τ + τ0 )θ(τ0 − τ ) .\nThis parametrization guarantees that no discontinuities in time and space component of the\ncurrent occur when turning on or off the coupling. Furthermore we require\nλτ02 ≫ 1 ,\nsuch that in a time interval of size 2τ0 and up to exponentially suppressed corrections\n2\n(∼ e−4λτ0 ), the time component of the current is constant and non-vanishing while the\nspatial component vanishes. Up to such exponentially suppressed contributions, we obtain\nfor f (τ, ω) (cf. Eq. (192) and [22])\nr\nh\nd\nπ −ω2 /4λ\nd \u0010ω\n3 ω 2 \u0001\u0011i\nf (τ, ω) ≈ 2λ i cos ωτ0\n.\ne\n+ sin ωτ0\nF\n;−\n1;\n1 1\ndω λ\ndω λ\n2 4λ\n\nAssuming λ to be chosen sufficiently large in comparison to the relevant frequencies this\nexpression simplifies\nλ ≫ ω 2 , |f (τ, ω)|2 ≈ 4 sin2 ωτ0 ,\n(197)\n\nand assuming furthermore the total time 2τ0 of non-vanishing σ(τ ) to be large on the scale\nof the acceleration aτ0 ≫ 1, the ω integration in (193) can be carried out in closed form\nand yields a result identical to (195). In agreement with [12, 33], the time averaged total\nrates for the parametrizations (194) and (196) coincide with the time averaged emission\nrate (187) of a uniformly accelerated charge in Minkowski\nas expected on the basis of\nR d p space\nμ\nthe invariance of the coupling term in the action d x |g|j Aμ under general coordinate\ntransformations.\nIn addition to the time averaged rate we can determine the time evolution of emission and\nabsorption probabilities under the influence of a current whose time component\n√ is turned\non at the time −τ0 and turned off at τ0 . Furthermore we assume the time (1/ λ) needed\nfor turning on or off to be much smaller than the total time where the charge is turned on\n(σ(τ ) ≈ 1). Since ultimately we are only interested in small frequencies (cf. Eq. (197)) we\ndo not need to further specify the details of the time dependent coupling q0 σ(τ ) (Eq. (188)).\nFor ω 2 ≪ λ, Eq. (192) yields\nh\ni\nf (τ, ω) ≈ θ(τ + τ0 ) eiωτ0 − e−iωτ0 θ(τ − τ0 ) .\n(198)\nFor τ > τ0 we reproduce the result (197) and therefore the correct value for the total\nrate independent of the details of the process of turning on and off the charge. Unlike\nthe rate of scalar radiation (182) which remains constant after turning on the charge, the\nelectromagnetic rate (∼ ∂τ |f (τ, ω|2)) is different from zero only during turning on or off the\ncharge where the spatial 1-component of the current is non vanishing. For −τ0 < τ < τ0\n34\n\n\fand for ω ≪ a the probability for observing a photon emitted with energy ω and transverse\nmomentum k⊥ is given by (cf. Eq. (191))\n\u0010 \u0011\n4πq02\n2\n2 k⊥\n1\n,\n(199)\nK\nχ (τ, ω, k⊥ ) = (nω + 1) 2\nωa (2π)d+1 1 a\n\nif the initial state contains nω photons. This probability exhibits a linear divergence with\nvanishing photon energy which is further enhanced by the occupation probability of the\nUnruh heat bath. The divergence disappears in the process of switching off the charge and\nthe finite value of the averaged rate (195) results. (Details of the time evolution can be\nstudied using the parametrization (196).) In the time interval −τ0 < τ < τ0 a co-accelerated\nobserver measures a surplus of Rindler photons of small but finite energies in the Unruh heat\nbath due to spontaneous emission. The probability for this surplus diverges like ω −1 with\ndecreasing photon energy. As far as the origin of this divergence is concerned we cannot\nrule out at this point that, although independent of the details of the switching on and\noff processes, it is related to the particular class of parametrizations (188). Nevertheless,\nwithin this class of parametrizations the divergence is unacceptable. It signals a failure of\nthe perturbative treatment of the coupling to the external current and one might expect on\nthe basis of the non-perturbative expression (173) that a summation of higher order terms\nwill cure this problem. In this context it also may be worthwhile to examine the quantum\nmechanical consequences of the modification of the retarded Green's function method in the\ncalculation of the classical radiation field of a uniformly accelerated charge [37],[31].\nG.\n\nThe interaction energy of static charges in accelerated frames\n\nIn this section we discuss the physics associated with the longitudinal degrees of freedom\nin Rindler space. As the radiation field, also the Coulomb field in Rindler space generated\neither by external charges or charged matter fields differs in a characteristic way from that\nin Minkowski space. Starting point for our discussion is the expression (51) for the Coulomb\nenergy of static charge according to which the interaction energy of pointlike charges e1 , e2 ,\nlocated at ξ1 , x⊥ and ξ2 , 0⊥ respectively, is given by\nVC = −e1 e2 D(ξ1 , x⊥ , ξ2 , 0⊥ ) ,\n\n(200)\n\nwith the Green's function associated with the Laplacian (15) defined in Eq. (22). In Rindler\nspace, after a Fourier transform in x⊥ this Green's function satisfies\n\u0012\n\u0013\n∂ 1 ∂\n1 (′)\n2\nv\n− k⊥ g(v, v ′) = avδ(v − v ′ ) , v (′) = eaξ ,\n∂v v ∂v\na\nwith the solution\ng(v, v ′) = −av< I1 (k⊥ v< )v> K1 (k⊥ v> ) .\n\n(201)\n\nThe integration over k⊥ can be expressed in terms of Legendre functions of the second kind\n(cf. [22])\nZ d−1\nd k⊥\nI1 (k⊥ v< )K1 (k⊥ v> ) eik⊥ x⊥\nD(ξ1 , x⊥ , ξ2 , 0⊥ ) = −av1 v2\n(2π) d−1\ni−(d−3)/2\n√\nd\nia h\n2\n2\n−1/4 2 −1\n2−1\n−\nπζ\n=\n(u) ,\n(202)\nu\n(u\n−\n1)\nQ\n1\n2\n(2π)3/2\n35\n\n\fwith\nζ 2 = 2v1 v2 .\n\n(203)\n\ns2\n,\nζ2\n\n(204)\n\nThe variable u is given by\nu=1+\nwith\n\ns2 = (v1 − v2 )2 + x2⊥ ,\n\n(205)\n\nthe geodesic distance (cf. Eq. (122)). With this result, the interaction energy (200) of two\noppositely charged sources e1 = e = −e2 can be written as\nπ\n\nd\ne−i 2 (d−2) e2\n−1\n2\na VC = − 3/2 d/2 d−3 (u2 − 1)−(d−2)/4 Q1/2\n(u) ,\n2 π\nζ\n\n−1\n\nd ≥ 2.\n\n(206)\n\nThe above dimensionless quantity depends on the geodesic distance s (205) and in addition,\ndue to the loss of translational symmetry, on the variable ζ (203). If we vary the geodesic\ndistance, with the \"center of mass\" of the charges\nζ2 =\n\n2\nexp a(ξ1 + ξ2 )\na2\n\nkept fixed, the variable ζ defines the scale in which the dimensionful quantities, the geodesic\ndistance\ns\ns̃ = ,\nζ\nand the charges e1 , e2 are measured. This suggests to introduce the dimensionless coupling\nconstant\ne2\nẽ2 = d−3 ,\n(207)\nζ\nrunning with the value of the center of mass. This definition is in accordance with the\ndefinition (135) of ê determined from the scaling properties of the action of the Maxwell\nfield\n\u0010 a \u0011d−3\n\u0001\n1\nẽ2 = √\nê2 − (ξ1 + ξ2 ) .\n2\n2\nThe appearance of an effective scale set by one of the coordinates in curved spaces is reminiscent of the AdS/CFT duality where the scale is set by the coordinate transverse to the\n4-dimensional Minkowski like space [38], [39].\nIn the limit of small geodesic distances the above expression reduces to (cf. [40] Ch. III)\na−1 VC\n\n−→\ns̃→0\n\nd\nẽ2\n1\nΓ(\n−\n1)\n25/2 π d/2\n2\ns̃d−2\ni\nh\n1 2\n5\nẽ ln s̃ + 2 − ln 2\n3\n2\n22 π\n\n−\n\n−→\ns̃→0\n\nd ≥ 3,\nd = 2,\n\n(208)\n\nd ≥ 2.\n\n(209)\n\nand we find for large geodesic distances\na−1 V C\n\n−→\ns̃→∞\n\n−\n\nΓ( d2 + 12 ) 2 −d−1\nẽ s̃\n,\n8π (d−1)/2\n36\n\n\f1.0\n\n0.5\ns\n0.5\n\n1.0\n\n1.5\n\n0.0\n\n−0.5\n\nV −1.0\n\n−1.5\n\n−2.0\n\nFIG. 1: The interaction energy (206) (solid lines) for d = 1, 2, 3 and the small distance approximation (208) (dashed lines) as a function of the geodesic distance s. Up to an additive constant the\nsmall distance approximation coincides with the interaction energy of static charges in the inertial\nsystem. The curves for d = 1 and d = 2 are shifted by 0.5\n\nUp to additive constants, the interaction energies coincide for small distances of the charges\nwith the corresponding expressions for charges at rest in inertial systems while at large\ndistances the interaction energies of charges at rest in accelerated systems are suppressed\nby three powers of 1/s. For d = 1, an elementary calculation yields\na−1 V C =\n\nẽ2 √ 2\ns̃ s̃ + 2 ,\n4\n\nd = 1.\n\n(210)\n\nAgain, the small distance limit coincides with the flat space result. Figure 1 shows the\ninteraction energies in inertial and accelerated frames for d = 1, 2, 3. It displays the faster\ndecrease with s of the interaction energies in the accelerated frame for d ≥ 2 which in\nparticular implies a change from the logarithmic rise of the interaction energy for d = 2\nto a power law decay. For d = 1 the increase of the interaction energy is enhanced by the\nacceleration.\nWe finally remark that the above calculation is independent of the quantum state of the\ntransverse gauge degrees of freedom. We have used Gauss' law which is valid for any physical\nstate. In particular our calculation applies equally to the ground state in the inertial and to\nthe ground state in the accelerated system.\nIt is instructive to compare the interaction energy of static charges coupled to the Maxwell\nfield with that of static sources coupled to a massless scalar field. According to Eqs. (177)\nand (178), the energy arising from the coupling of static sources to the scalar field is given\nby\nZ\nZ\n1\n′\nsc\n2aξ\nd−1\nh =\ne dξd x⊥ e2aξ dξ ′ dd−1 x′⊥ ρ(ξ, x⊥ )Ds (ξ, x⊥ , ξ ′ , x′⊥ )ρ(ξ ′ , x′⊥ ) ,\n2\nwith the scalar Green's function (cf. Eq. (89))\nDs (ξ, x⊥ , ξ ′ , x′⊥ ) = hξ, x⊥ |\n37\n\n1 ′ ′\n|ξ , x⊥ i .\n∆s\n\n\fTherefore the interaction energy of two pointlike sources of strength q1 , q2 reads\nVsc = q1 q2 Ds (ξ1 , x⊥ , ξ2 , 0⊥ ) .\n\n(211)\n\nUnlike in Minkowski space, interaction energies of static sources coupled to scalar or vector\nfields are not given in terms of the same Green's functions. They exhibit different spatial\ndependences. The Laplacians ∆s (89) for scalar and ∆ (15) for vector fields are related to\neach other by\n2\n∆s = ∆ + ∂v\nv\nand a similar calculation as in (202) yields the following ratio of propagators\nd/2−1\n\n√\nQ−1/2 (u)\nDs (ξ1 , x⊥ , ξ2 , 0⊥ )\n1\n−a(ξ1 +ξ2 )\n2\n2 + s̃2 ) .\n=\ne\n(1\n+\ns̃\n+\ns̃\n= 2\nD(ξ1, x⊥ , ξ2 , 0⊥ )\na v1 v2 Qd/2−1 (u)\n1/2\n\n(212)\n\nWe observe that the dependence of the interaction energy of scalar sources on the distance\n(s̃) coincides at small distances with that of static charges, and thus with the flat space\nresult. At large distances the interaction energy is suppressed with respect to the flat space\nresult by only one power of s̃.\nFor d = 3, as for all odd spatial dimensions, the interaction energy can be expressed in\nterms of elementary functions. We find from (206) (cf.[22])\n\u0012\n\u0013\ne2\n1 + s̃2\nVC =\na 1− √\n.\n(213)\n4π\n2s̃2 + s̃4\nThe modification of the asymptotics by acceleration would change significantly the spectrum\nof atoms or molecules. In particular one would expect that a hydrogen atom should exhibit\nonly a finite number of bound states separated from the threshold by a finite gap. The effect\nof the acceleration should be most strongly pronounced in \"Rydberg\" atoms i.e. atoms in\nhighly excited and very weakly bound states, (cf.[41] for a study of Rydberg atoms in the\nSchwarzschild metric). In low lying states and in the perturbative limit aaB ≪ 1, with aB\nthe Bohr radius, the modifications of the kinetic energy are actually dominant. This can be\neasily verified using the following Hamiltonian for the hydrogen atom in Rindler space\n1\n1 2\n2\nH = m(e2aξ − 1) −\n(∂ + e2aξ ∂⊥\n) + e2 D(ξ, x⊥ , 0, 0⊥ ) .\n2\n2m ξ\n\n(214)\n\nFor energies small in comparison to the electron's rest mass, this effective Hamiltonian is\nderived from the scalar field action (62) and the expression (70) for the interaction energy\nof a static proton with the charge density of the (scalar) electron (64). Besides x⊥ = 0, for\nsimplicity ξproton = 0 has been assumed.\nThe suppression of long range forces by acceleration may also be of relevance for YangMills theories and QCD and could be taken as an indication for deconfinement by acceleration. It has been actually argued [9] that the Unruh effect provides a new mechanism for\nthermalization through the deceleration occurring when two relativistic heavy ions collide\nand, for instance, could trigger restoration of chiral symmetry. On the basis of our results\none might conjecture that in Rindler space a confined phase in Yang-Mills theories or a\nchirally broken phase in QCD does not exist at all. The thermal distribution of photons (cf.\nEq. (159)) or of massive scalars (cf. Eq. (113)) is independent of the value of the transverse\n38\n\n\fmomenta and mass of the \"Rindler particles\" resulting in an ultraviolet divergence of the\nentropy which requires regularization [23]. This degeneracy can be expected to remain true\nas far as the elementary excitations of interacting theories (cf. [42], [23]), for instance the\n\"Rindler pions\" in QCD, or \"Rindler glueballs\" in Yang-Mills theories are concerned. In\nturn, the existence of a confined phase in Yang-Mills theories in Rindler spaces appears to\nbe incompatible with the expected degeneracy of the ground state, the large contributions of\nthe one-particle states to the entropy or the missing gap in the spectrum. As far as the issue\nof thermalization in relativistic heavy ion collisions is concerned, it is not straightforward\nto apply these considerations without having studied the changes in the dynamics if the\nacceleration does not last forever.\nV.\n\nCONCLUSIONS\n\nIn this work we have presented the canonical quantization of gauge fields in static spacetimes and have applied the formalism to the electromagnetic field in Rindler spaces. The\nexistence of a timelike Killing vector in static space-times makes the quantization of gauge\nfields in the Weyl gauge very similar to that in flat space-time. For electromagnetic fields,\nwe have developed a general scheme for treatment of the Gauss law which appears in the\nWeyl gauge as a constraint on the physical states. The two crucial elements in this construction are the definition of metric dependent transverse and longitudinal fields and the\ndecoupling of the longitudinal degrees of freedom. This decoupling is achieved by a unitary\ngauge fixing transformation and enables explicit determination of the stationary states of\nthe longitudinal degrees of freedom. We have shown that in general static space-time the\ntime component of currents either external or generated by charged matter fields is coupled\nto the radiation field and have discussed the possibility to eliminate this coupling by a suitably chosen coordinate transformation. A complete construction of the stationary states\nand an explicit non-perturbative solution of initial value problems has been given in case\nthe electromagnetic field is coupled to external currents only. As far as further formal developments are concerned it would be interesting to consider alternatives to the elimination\nof longitudinal degrees of freedom. The decoupling of these degrees of freedom is one particular option for resolving the Gauss law constraint. As in flat space and depending on the\nmetric or on prescribed boundary conditions elimination of other degrees of freedom may\nbe more practical, for instance, the elimination of a particular component of the gauge field\n(cf. [43]). Such an alternative could be promising for curved space-times like Rindler or AdS\nspaces where one of the spatial directions is singled out and, most likely, will be necessary for\nresolving the Gauss law in non-Abelian gauge theories. Furthermore it appears promising to\nextend our formal development and include stationary space-times [44][45] where the basis\nof the canonical quantization in the Weyl gauge, the existence of a time-like Killing vector,\npersists. If successful, such an extension would permit applications to metrics like the Kerr\nmetric.\nUsing the tools developed for gauge fields in general static space-times we have studied\nthe dynamics of the electromagnetic field in Rindler spaces. We have constructed the normal\nmodes of the transverse gauge fields and expressed the Hamiltonian in terms of the associated\ncreation and annihilation operators. We have identified the symmetry which is responsible\nfor the degeneracy of the energy eigenvalues with respect to the momentum components\nperpendicular to the direction of the homogeneous gravitational field and have shown that\nthe Rindler space Hamiltonians of a non-interacting scalar and of the Maxwell field are\n39\n\n\finvariant under scale transformations. We have extended these symmetry considerations to\nscalar and spinor QED with massless charged matter fields and to SU(N) QCD with massless\nquarks and found that in 4-dimensional Rindler space these interacting systems exhibit at\nthe tree level this exact symmetry. It remains to be seen which signatures of this symmetry\nwill be left after accounting for the quantum effects of the interactions.\nObserved in a uniformly accelerated frame, Minkowski space-time appears as a Rindler\nspace. We have studied in detail the ensuing relation of quantized electromagnetic fields\nin Rindler and Minkowski spaces and have established the relation between the creation\nand annihilation operators of the corresponding transverse fields. We have derived nonperturbative expressions for transition rates for photon emission and absorption induced\nby external currents and, for the sake of comparison, the corresponding transition rates for\nmassless scalar fields. The absence of radiation of a uniformly accelerated charge in the\nco-accelerated frame has been an important issue in the discussion of the Unruh effect. It\nhas been argued that the rate of response, i.e. the sum of absorption and emission rate,\nmust be the same in inertial and accelerated frames. This conjecture is supported by our\nresults for both scalar and electromagnetic sources. The time evolution of emission and\nabsorption amplitudes differ significantly for scalar and electromagnetic radiation. In particular, after turning on the charge, the amplitude for photon emission exhibits an infrared\ndivergence which disappears after the charge is turned off while the rate of scalar radiation\nremains constant after turning on the source. Additional investigations, in particular of contributions from higher order perturbation theory are necessary. For further clarification of\nbremsstrahlung processes, an analysis of the dynamics of appropriately constructed UnruhDeWitt detectors for gauge fields seems to be mandatory. So far almost all investigations of\nthe response of uniformly accelerated detectors have dealt with scalar radiation (for a survey\ncf. [5]). A dipole-detector coupled to the electromagnetic field has been introduced in [11]\nand used in a study of an accelerated hydrogen atom [46] for a comparison of atomic level\nshifts arising from coupling to scalar and gauge fields respectively. A similar Hamiltonian,\nfor instance of a harmonic oscillator with a dipole coupling to the electric field, could be\nused as a model of an \"electromagnetic\" detector. For such a detector coupled to a scalar\nfield non-perturbative results are available [47]. Our method of decoupling gauge fields and\nexternal currents by unitary transformations is actually very similar to the method of solution applied in [47] and should be readily generalizable as long as the dynamics remains\nbilinear in all degrees of freedom.\nBesides the initial value problem associated with bremsstrahlung, Rindler spaces offer\nthe opportunity for analytical studies of other non-trivial properties of quantized gauge\nfields. We have computed the photon condensate which appears in a uniformly accelerated\nsystem in space-time dimensions different from four and have investigated the electrostatic\ninteraction of two charges at rest in Rindler space. While in comparison with Minkowski\nspace the short distance behavior of the interaction energy is the same, its asymptotics\nis suppressed by three powers of the distance. For the interaction energy of two sources\ncoupled to a massless scalar field we obtain in comparison with Minkowski space again the\nsame small distance behavior and also an asymptotic suppression however by one power\nof the distance only. As for the density of states of the transverse degrees of freedom we\nthus also find a significant difference between scalar and longitudinal degrees of freedom.\nThe asymptotic suppression of the electrostatic energy changes qualitatively the spectrum\nof the hydrogen atom. Together with the expected absence of a gap in the spectrum and the\ndegeneracy of the one-particle states this asymptotic suppression of the electrostatic energy\n40\n\n\fcan be taken as a hint that non-Abelian gauge theories in Rindler spaces may not exhibit\nconfinement.\nAlthough we have concentrated the discussion on gauge fields in Rindler spaces or equivalently gauge fields in uniformly accelerated systems, extensions to general stationary accelerated frames ([48, 49]) appear to be feasible and of particular interest for the experimental\nverification of the Unruh effect. One also can expect analytical results from a study of the\nUnruh effect for gauge fields in AdS spaces (cf. [50]).\nAcknowledgments\n\nIt is a pleasure to express our sincere thanks to Tetsuo Matsui for his collaboration in\nthe early phase of this project. F. L. is grateful for support by a fellowship of the Japan\nSociety for the Promotion of Science and for the hospitality at the Institute of Physics at\nthe University of Tokyo, Komaba. K. O. and K. Y. would like to thank their collaborator\nF. L. for the support of stay and the hospitality at the University of Erlangen. K.Y. is\nalso supported by the Grant-in-Aid for the Scientific Research of JSPS No.15540288 and\nNo.19540306 and thanks Wolfgang Bentz who is the principal investigator of the latter.\n\n[1]\n[2]\n[3]\n[4]\n[5]\n[6]\n[7]\n[8]\n[9]\n[10]\n[11]\n[12]\n[13]\n[14]\n[15]\n[16]\n[17]\n[18]\n[19]\n[20]\n\nS. A. Fulling, Phys. Rev. D 7, 2850, (1973)\nP. C. W. Davies, J. Phys. A 8, 609, (1975)\nW. G. Unruh, Phys. Rev. D 14, 870, (1976)\nS. A. Fulling, J. Mod. Opt. 52, 2207, (2005)\nL. C. B. Crispino, A. Higuchi and G. E. A. Matsas, Rev. Mod. Phys. 80, 787, (2008), grqc/0710.5373\nJ. S. Bell and J. M. Leinaas, Nucl. Phys. B 284, 488, (1987)\nR. Müller, Phys. Rev. D 56, 953, (1997)\nD. A. T. Vanzella and G. E. A. Matsas, Phys. Rev. D 63, 014010, (2000), hep-ph/0002010\nD. Kharzeev, K. Tuchin, Nucl. Phys. A 753, 316, (2005), hep-ph/0501234\nP. Candelas and D. Deutsch, Proc. Roy. Soc. Lond. A. 354, 79, (1977)\nS. Takagi, Prog. Theor. Phys. Suppl. 88, 1, (1986)\nA. Higuchi, G. E. A. Matsas and D. Sudarsky, Phys. Rev. D 45, R3308, (1992)\nR. M. Avagyan, A. A. Saharian, A. H. Yeranyan, Phys. Rev. D 66, 085023, (2002),\nhep-th/0207073\nL. C. B. Crispino, A. Higuchi and G. E. A. Matsas, Phys. Rev. D 63, 124008, (2001),\ngr-qc/0011070\nG. Cognola, P. Lecca, Phys. Rev. D 57, 1108, (1998), hep-th/9706065\nC. W. Misner, K. S. Thorne and J. A. Wheeler, Gravitation, W.H. Freeman and Company,\n1973\nD. R. Brill and J. A. Wheeler, Rev. Mod. Phys. 29, 465, (1957), and Errata Rev. Mod. Phys.\n33, 623, (1961)\nM. Nakahara, Geometry, Topology and Physics, Adam Hilger 1990\nF. Lenz, H. W. L. Naus, M. Thies, Ann. of Phys. 233, 317, (1994)\nF. Lenz, K. Ohta and K. Yazaki, to be published\n\n41\n\n\f[21] V. F. Mukhanov and S. Winitzki, Quantum Effects in Gravity, Cambridge University Press\n2007\n[22] I. S. Gradshteyn and I. M. Ryzhik, Table of Integrals, Series and Products, Academic Press\n1965\n[23] L. Susskind and J. Lindesay, Black Holes, Information and the String Theory Revolution,\nWorld Scientific, 2005\n[24] N. D. Birrell and P. C. W. Davies, Quantum fields in curved space, Cambridge University Press\n1982\n[25] A. A. Saharian, Class. Quant. Grav. 19, 5039, (2002), hep-th/0110029\n[26] W. G. Unruh and R. M. Wald, Phys. Rev. D 29, 1047, (1984)\n[27] D. Oriti, Nuovo Cim. B 115, 1005 (2000), gr-qc/9912082\n[28] T. H. Boyer, Phys. Rev. D 21, 2137, (1980)\n[29] W. G. Unruh, Phys. Rev. D 34, 1222, (1986)\n[30] M. A. Shifman, A. I. Vainshtein and V. I. Zakharov, Nucl. Phys. B 147, 385, (1979),\nNucl. Phys. B 147, 448, (1979)\n[31] D. G. Boulware, Ann. of Phys. 124, 169, (1980)\n[32] A. Higuchi and G. E. A. Matsas, Phys. Rev. D 48, 689, (1993)\n[33] A. Higuchi, G. E. A. Matsas and D. Sudarsky, Phys. Rev. D 46, 3450, (1992)\n[34] G. E. A. Matsas, Phys.Lett. B 380, 24, (1996), gr-qc/9605009\n[35] H. Ren and E. J. Weinberg, Phys. Rev. D 49, 6526, (1994), hep-th/9312038\n[36] D. E. Diaz, J. Stephany, Class. Quant. Grav. 19, 3753, (2002), gr-qc/0111041\n[37] H. Bondi and T. Gold, Proc. Roy. Soc. Lond. A. 229, 416, (1955)\n[38] J. Polchinski, M. J. Strassler, Phys. Rev. Lett., 88, 031601, (2002), hep-th/0109174\n[39] K. Becker, M. Becker, and J. H. Schwarz, String Theory and M-Theory, Cambridge University\nPress 2007\n[40] A. Erdelyi, W. Magnus, F. Oberhettinger, F. G. Tricomi, Higher Transcendental Functions,\nVol. I, McGraw Hill 1953\n[41] F. Pinto, Phys. Rev. Lett. 70, 3839, (1993)\n[42] W. G. Unruh and N. Weiss, Phys. Rev. D 29, 1656, (1984)\n[43] F. Lenz, H. W. L. Naus, K. Ohta, M. Thies, Ann. of Phys. 233, 17, (1994)\n[44] S. A. Fulling, Aspects of Quantum Field Theory in Curved Space-Time, Cambridge University\nPress 1989\n[45] R. M. Wald, Quantum Field Theory in Curved Spacetime and Black Hole Thermodynamics,\nThe University of Chicago Press 1994\n[46] R. Passante, Phys. Rev. A 57, 1590, (1998)\n[47] S.-Y. Lin and B. L. Hu, Phys. Rev. D 73, 124018, (2006), gr-qc/0507054\n[48] J. R. Letaw, J. D. Pfautsch, Phys. Rev. D 24, 1491, (1981)\n[49] J. I. Korsbakken, J. M. Leinaas, Phys. Rev. D 70, 084016, (2004), hep-th/0406080\n[50] S. Deser, O. Levin, Class. Quant. Grav. 14, L163, (1997), gr-qc/9706018\n\n42\n\n\f"}