{"id": "http://arxiv.org/abs/1112.0984v1", "guidislink": true, "updated": "2011-12-05T16:40:11Z", "updated_parsed": [2011, 12, 5, 16, 40, 11, 0, 339, 0], "published": "2011-12-05T16:40:11Z", "published_parsed": [2011, 12, 5, 16, 40, 11, 0, 339, 0], "title": "Finite element 3D modeling of mechanical behavior of mineralized\n  collagen microfibrils", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1112.5250%2C1112.5821%2C1112.0584%2C1112.0814%2C1112.5639%2C1112.1838%2C1112.0678%2C1112.2235%2C1112.3557%2C1112.1083%2C1112.3274%2C1112.1062%2C1112.2932%2C1112.0210%2C1112.3742%2C1112.2399%2C1112.5697%2C1112.1814%2C1112.3836%2C1112.2844%2C1112.0656%2C1112.0787%2C1112.5470%2C1112.2891%2C1112.5011%2C1112.2958%2C1112.4755%2C1112.4803%2C1112.3887%2C1112.0984%2C1112.0829%2C1112.5406%2C1112.5471%2C1112.4766%2C1112.0925%2C1112.6199%2C1112.3727%2C1112.4401%2C1112.1200%2C1112.0498%2C1112.3206%2C1112.5420%2C1112.4100%2C1112.0889%2C1112.2653%2C1112.2264%2C1112.2855%2C1112.6420%2C1112.1723%2C1112.3799%2C1112.3164%2C1112.6288%2C1112.4674%2C1112.2266%2C1112.6086%2C1112.1192%2C1112.1595%2C1112.4550%2C1112.2528%2C1112.0146%2C1112.1960%2C1112.1558%2C1112.5474%2C1112.5731%2C1112.1134%2C1112.0778%2C1112.1471%2C1112.3778%2C1112.5439%2C1112.2512%2C1112.3552%2C1112.1094%2C1112.4407%2C1112.5106%2C1112.3313%2C1112.5251%2C1112.4670%2C1112.3480%2C1112.0277%2C1112.2025%2C1112.2195%2C1112.1237%2C1112.4888%2C1112.2110%2C1112.2876%2C1112.5551%2C1112.5087%2C1112.2992%2C1112.2067%2C1112.1904%2C1112.2656%2C1112.5752%2C1112.5343%2C1112.2859%2C1112.5227%2C1112.6227%2C1112.5213%2C1112.3830%2C1112.3046%2C1112.2931%2C1112.4768&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Finite element 3D modeling of mechanical behavior of mineralized\n  collagen microfibrils"}, "summary": "The aim of this work is to develop a 3D finite elements model to study the\nnanomechanical behaviour of mineralized collagen microfibrils, which consists\nof three phases, (i) collagen phase formed by five tropocollagen (TC) molecules\nlinked together with cross links, (ii) a mineral phase (Hydroxyapatite) and\n(iii) impure mineral phase, and to investigate the important role of individual\nproperties of every constituent. The mechanical and the geometrical properties\n(TC molecule diameter) of both tropocollagen and mineral were taken into\nconsideration as well as cross-links, which was represented by spring elements\nwith adjusted properties based on experimental data. In the present paper an\nequivalent homogenised model was developed to assess the whole microfibril\nmechanical properties (Young's modulus and Poisson's ratio) under varying\nmechanical properties of each phase. In this study both equivalent Young's\nmodulus and Poisson's ratio which were expressed as functions of Young's\nmodulus of each phase were obtained under tensile load with symmetric and\nperiodic boundary conditions.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1112.5250%2C1112.5821%2C1112.0584%2C1112.0814%2C1112.5639%2C1112.1838%2C1112.0678%2C1112.2235%2C1112.3557%2C1112.1083%2C1112.3274%2C1112.1062%2C1112.2932%2C1112.0210%2C1112.3742%2C1112.2399%2C1112.5697%2C1112.1814%2C1112.3836%2C1112.2844%2C1112.0656%2C1112.0787%2C1112.5470%2C1112.2891%2C1112.5011%2C1112.2958%2C1112.4755%2C1112.4803%2C1112.3887%2C1112.0984%2C1112.0829%2C1112.5406%2C1112.5471%2C1112.4766%2C1112.0925%2C1112.6199%2C1112.3727%2C1112.4401%2C1112.1200%2C1112.0498%2C1112.3206%2C1112.5420%2C1112.4100%2C1112.0889%2C1112.2653%2C1112.2264%2C1112.2855%2C1112.6420%2C1112.1723%2C1112.3799%2C1112.3164%2C1112.6288%2C1112.4674%2C1112.2266%2C1112.6086%2C1112.1192%2C1112.1595%2C1112.4550%2C1112.2528%2C1112.0146%2C1112.1960%2C1112.1558%2C1112.5474%2C1112.5731%2C1112.1134%2C1112.0778%2C1112.1471%2C1112.3778%2C1112.5439%2C1112.2512%2C1112.3552%2C1112.1094%2C1112.4407%2C1112.5106%2C1112.3313%2C1112.5251%2C1112.4670%2C1112.3480%2C1112.0277%2C1112.2025%2C1112.2195%2C1112.1237%2C1112.4888%2C1112.2110%2C1112.2876%2C1112.5551%2C1112.5087%2C1112.2992%2C1112.2067%2C1112.1904%2C1112.2656%2C1112.5752%2C1112.5343%2C1112.2859%2C1112.5227%2C1112.6227%2C1112.5213%2C1112.3830%2C1112.3046%2C1112.2931%2C1112.4768&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The aim of this work is to develop a 3D finite elements model to study the\nnanomechanical behaviour of mineralized collagen microfibrils, which consists\nof three phases, (i) collagen phase formed by five tropocollagen (TC) molecules\nlinked together with cross links, (ii) a mineral phase (Hydroxyapatite) and\n(iii) impure mineral phase, and to investigate the important role of individual\nproperties of every constituent. The mechanical and the geometrical properties\n(TC molecule diameter) of both tropocollagen and mineral were taken into\nconsideration as well as cross-links, which was represented by spring elements\nwith adjusted properties based on experimental data. In the present paper an\nequivalent homogenised model was developed to assess the whole microfibril\nmechanical properties (Young's modulus and Poisson's ratio) under varying\nmechanical properties of each phase. In this study both equivalent Young's\nmodulus and Poisson's ratio which were expressed as functions of Young's\nmodulus of each phase were obtained under tensile load with symmetric and\nperiodic boundary conditions."}, "authors": ["Abdelwahed Barkaoui", "Ridha Hambli"], "author_detail": {"name": "Ridha Hambli"}, "author": "Ridha Hambli", "links": [{"title": "doi", "href": "http://dx.doi.org/10.5301/JABB.2011.8876", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1112.0984v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1112.0984v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "Journal of Applied Biomaterials and Biomechanics 9, 3 (2011) xxx", "arxiv_primary_category": {"term": "physics.med-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "physics.med-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "physics.bio-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "q-bio.TO", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1112.0984v1", "affiliation": "Prisme", "arxiv_url": "http://arxiv.org/abs/1112.0984v1", "journal_reference": null, "doi": "10.5301/JABB.2011.8876", "fulltext": "1\n\nFinite element 3D Modelling of Mechanical Behaviour of Mineralized\nCollagen Microfibrils\nAbdelwahed BARKAOUI, Ridha HAMBLI\nPRISME Laboratory, EA4229, University of Orleans\nPolytech' Orléans, 8, Rue Léonard de Vinci 45072 Orléans, France\nridha.hambli@univ-orleans.fr\nabdelwahed.barkaoui@univ-orleans.fr\n\nAbstract. The aim of this work is to develop a 3D finite elements model to study the\nnanomechanical behaviour of mineralized collagen microfibrils, which consists of\nthree phases, (i) collagen phase formed by five tropocollagen (TC) molecules linked\ntogether with cross links, (ii) a mineral phase (Hydroxyapatite) and (iii) impure mineral\nphase, and to investigate the important role of individual properties of every\nconstituent. The mechanical and the geometrical properties (TC molecule diameter)\nof both tropocollagen and mineral were taken into consideration as well as crosslinks, which was represented by spring elements with adjusted properties based on\nexperimental data. In the present paper an equivalent homogenised model was\ndeveloped to assess the whole microfibril mechanical properties (Young's modulus\nand Poisson's ratio) under varying mechanical properties of each phase. In this study\nboth equivalent Young's modulus and Poisson's ratio which were expressed as\nfunctions of Young's modulus of each phase were obtained under tensile load with\nsymmetric and periodic boundary conditions.\nKeywords: Mineralized collagen microfibril; TC molecules; Mineral; Cross-links;\nFinite elements; Mechanical properties.\n1. Introduction\nHierarchical structures in bio-composite such as bone tissue have many\nscales or levels, specific interactions between these levels and highly complex\narchitecture in order to achieve its biological and mechanical functions (1). These\n\n\f2\n\ncomplexity and heterogeneity of bone tissue require a multiscale modelling to\nunderstand its mechanical behaviour and its remodelling mechanism (2). In long\nbones, like the femur, three parts are distinguished, from the center outward: the\nmarrow, the spongy bone and cortical bone. Human cortical bone structure consists\nof six structural scale levels which are the (macroscopic) cortical bone, osteonal,\nlamellar, fibrous, fibril and microfibril Fig. 1. In fact, microscopic analysis reveals a\ncomplex architecture that can be described as hollow cylinders juxtaposed next to\neach other and sealed by a matrix. The cylinders are called osteon, the holes are\nnamed Haversian canals and the matrix is the interstitial system. Further analysis\nshows that osteons are in fact an assembly of cylindrical strips embedded in each\nother and each lamella is composed of a network of collagen fibers with a helical\norientation and inserted into hydroxyapatite crystals. The orientation of collagen\nfibers may be different between two consecutive lamellae. Every fiber is formed by a\nset of fibrils. Each fibril is in turn composed of microfibrils. Finally, each microfibril is a\nhelical arrangement of five TC molecules (3).\n\nFigure1. The multiscale hierarchical structure of cortical bone\n\nAt ultrastructure level, mineral and collagen are arranged into higher hierarchical\nlevels to form microfibrils, fibrils and fibers (4-6). The existence of sub-structures in\ncollagen fibrils has been a debate for years. Recent studies suggest the presence of\nmicrofibrils in fibrils, experimental works prove that all collagen-based tissues are\n\n\f3\n\norganized into hierarchical structures, where the lowest hierarchical level consists of\ntriple helical collagen molecules (7-9) and the multiscale structure was defined as\ntriple helical collagen molecules - microfibrils – fibrils - fibers. A longitudinal\nmicrofibrillar structure with a width of 4 - 8 nm was visualized in both hydrated (10)\nand dehydrated (11). Three-dimensional image reconstructions of 36 nm-diameter\ncorneal collagen fibrils also showed a 4 nm repeat in a transverse section, which was\nrelated to the microfibrillar structure (12). Using X-ray diffraction culminating in an\nelectron density map, (8) suggested the presence of right-handed super twisted\nmicrofibrillar structures in collagen fibrils.\nExperimentally, single tropocollagen molecules and mechanical properties of fibrils of\nmineralized collagen studies have been performed by several authors (13-15). Other\nstudies on the hydrated collagen microfibril in the small strain regime based on X-ray\ndiffraction (16, 17) and atomic force microscopy (AFM) (9-15) were also achieved to\ninvestigate the stress-strain relation and the elastic properties of microfibrils. Further\nmore study of the effect of collagen-mineral deformation processes (18) was realized\nto estimate the mechanical properties of mineralized collagen fibrils and bone tissue.\nRecently an atomistic model of collagen microfibril dynamic has been developed (5).\nThis model in fact interprets in full details the mechanical behavior at the microfibril\nlevel, on other side it requires extremely computational power due to its size. In spite\nof all these efforts towards this scale, a 3D FE model which can represent\nultrastructre of mineralized collagen that takes into consideration the TC, mineral\nphases as well as the cross-links are still absent.\nIn the current work as an attempt to be more close to the reality, a 3D FE model is\nproposed to study the mechanical behavior of mineralized collagen\n\nmicrofibril\n\nconsidering these aspects: (i) the dimensions and composition of the constituents\n(mineral, TC molecules and gross-links). (ii) Studying the effect of elastic mechanical\n\n\f4\n\nproperties of constituents on the whole microfibril structure. The proposed 3D finite\nelement model gives the ability to study bone mechanical properties at nanoscopic\nscale and permit easily parametric studies to investigate the effect of mechanical and\ngeometrical parameters (mineral density, cross-links, elastic properties of bone\ncomponent,...etc) related to bone quality.\n2. Methods and tools\nIn this section we discuss: (i) the structure of the microfibril and the mechanical\nbehaviour of these elementary constituents, (ii) selection and development of 3D\nfinite element model.\nThe microfibril is a helical assembly of five TC molecules (rotational symmetry of\norder 5), which are offset one another with apparent periodicity of 67 nm Fig. 2. This\nperiodical length is denoted by the letter D and it's used as a primary reference scale\nin describing the structural levels. The helical length of a collagen molecule is 4.34 D\n≈ 291 nm and the discrete gap (hole zone) is 0.66 D ≈ 44 nm ( = 35 nm in some other\nreferences) between two consecutive TC molecules type1 in a strand. These gaps in\nbone are the sites of nucleation for hydroxyapatite crystals (the mineral component of\nbone tissue) to be deposited (19, 20). Those five molecules create a cylindrical\nformation with a diameter 3.5–4 nm and its length is unknown. The orientation and\naxial arrangement of TC molecules in the microfibril have been deducted from an\nelectron-microscopic observation showing transverse striations with a period D. The\norigin of this streaking was performed by a gradation in the arrangement of elements\nthat are staggered tropocollagen with themselves at an interval D. The strength and\nstability during maturation of the microfibrils are achieved by the development of\nintermolecular cross-links (21, 22).\n\n\f5\n\nFigure2. Schematic illustration of the TC triple helix molecules and the formation of\nthe microfibril\n\nA microfibril is composed of the TC molecule type I linked together by cross-links and\nmineral phases:\nTropocollagen molecules: At the lowest hierarchical level, bone structure is\ncomposed of TC molecules which can be viewed as a of rod about 300 nm long and\n1.5 nm in diameter, made up of three polypeptide strands, each of which is a lefthanded helix (23). The arrangement of the TC molecules comes from the strong\nchemical bonds (cross-linking) that form between adjacent collagen molecules\nthroughout the collagen bundles (4, 6). Force-strain curve during tensile load of a\nsingle TC molecule reported in (4), shows an initial linear elastic regime followed by\nonset of nonlinear, stiffening behaviour at larger strains beyond approximately 30–\n35% strain. It has been suggested by (14) that regime I is characterized by uncoiling\nof the TC molecule and regime II is associated with a larger modulus due to\nstretching of covalent bonds. In this work the tensile test are conducted in small\nstrain (ε <2%), that's why the TC molecule are considered with linear elastic\nbehaviour.\nMineral: The mineral phase is almost entirely composed of impure hydroxyapatite\ncrystals Ca10 (PO4) 6 (OH) 2. Those crystals are plate like a shape. The size of the\nmineral plates varies among different kinds of bones, different animals and even\ndifferent measurement techniques, e.g., transmission electron microscopy (TEM) and\nsmall-angle X-ray scattering (SAXS) (24). A wide range of mineral plate dimensions\n\n\f6\n\nhas been reported in the literature: 15–150 nm in length, 10–80 nm in width and 2–7\nnm in thickness, while the distance between the neighboring plates is on same the\norder as the thickness (25). Hydroxyapatite mineral is stiff and extremely fragile\nexhibiting elastic isotropic behaviour (26-28)\nMechanical properties of hydroxyapatite and TC molecules crystals reported\nin the literature are grouped in table 1.\nTable 1. Mechanical properties of phases ( tropocollagen molecules and Hydroxyapatite\ncrystals)\nYoung's modulus (GPa)\n\nPhases\n\nTropocollagen molecules\n\nHydroxyapatite crystals\n\n2.7\n2.4\n0.35-12\n1.5\n2.8-3\n114\n150\n170\n\nPoisson's ratio\n0.27\n--0.38\n-0.30\n0.27\n0.33\n\nsource\nSansalone, et al ,2007\n(29)\nVesentini, et al 2005\n(30)\nSun et al 2002\n(13)\nWagner and Weiner, 1998 (31)\nSasaki and Odajima(1996)(16)\nWagner and Weiner, 1998(31)\nCowin ,1989\n(32)\nCurrey (1969)\n33)\n\nCross-links: Joining two TC molecules. The microfibril structure is stabilized through\nintermolecular cross-links, formed between telopeptides and adjacent triple helical\nchains through lysine–lysine covalent. Recently, Uzel et al. (6) proposed a\nrheological model of cross-links behavior with three regimes: (i) Elastic regime, (ii)\ndelayed response due to the unraveling of the telopeptide and (iii) the friction\nrepresenting the intermolecular slippage. As the present work focus on the small\ndeformation of microfibril, only the first regime (elastic) was taken in consideration. In\norder to represent the FE behavior of a cross-link, linear spring elements of tensile\nstiffness Kcr (34) were used:\nWhere:\nKcr= 17 kcal/mol/A2 = 1181.143 e-11N/nm (1 kcal/mol/A ≈ 69.48 pN)\nGeometry FE model:\nA repetitive portion of mineralized collagen microfibril was selected; it is a cylindershaped with a diameter of 4 nm. There are some studies suggest that collagen\n\n\f7\n\nmicrofibrils have a quasi-hexagonal structure (35). Smith et al. (36) consider that\neach microfibril consists of exactly five molecules in a generic circular cross section.\nIn the current work, the smith model was adopted.\nFig.3 illustrates the unfolding in plane of chosen repetitive portion with mentioning of\ndimensions and provision of each phase.\n\nFigure3. Illustrated in plans of mineralized collagen fibril and unfolding in plane of repetitive\nportion of mineralized collagen microfibril structures. The model consists of three phases: (i)\nTC molecules, (ii) pure mineral: crystalline hydroxyapatite located within gaps created by the\nTC assembly; (iii) impure mineral: water, crystalline hydroxyapatite and porosity (light grey).\nCross-links are connecting the TC molecules.\n\nThe proposed model is a periodic repetitive portion with specific geometry properties\ngiven in table 2.\nTable 2. geometry properties of proposed model\nlength of model: L\nlength of tropocollagen molecule: l\nradius of model: R\nradius of tropocollagen molecule: r\ndiscrete gaps (hole zone): G\nperiodicity : D\n\n340 nm\n300 nm\n~ 2 nm\n0.7 nm\n40 nm\n67 nm\n\nA three- dimensional finite element model of mineralized collagen microfibril with\nsymmetric and periodic boundary conditions is considered here, with an array of 5\ntropocollagen molecules cross-linked together using springs, the all is put into a\nmineral matrix. This study focuses on the elastic behaviour of the mineralized\n\n\f8\n\ncollagen microfibril in the small strain regime (ε < 2%). Plasticity and rupture in both\nphases (TC and mineral) and relative sliding on the interface between two phases\nwas not considered here. The bottom surface of the microfibril was encastred and an\nuniaxial force (F) along the axis of the collagen molecules was applied to the top\nsurface of the microfibril. Deformation and microfibril elongation is computed by the\nFE model. Each collagen domain represents a collagen triple helix in a wet\nenvironment described as homogeneous elastic phase considering that a single\ncollagen molecule would not exhibit shear deformation. Then each collagen domain\ndeforms only in tension, similar to the situation present in bead models of\ncollagen (4).\n\nFigure4. Proposed 3D FE model of mineralized collagen microfibrils\n\nBoth pure and impure portion of mineral have been assumed as homogeneous\nphase because of these reasons: (i) The aim of this study was to propose a realistic\n3D finite element model of mineralized microfibril, present model can be enhanced in\nfuture works by including more details and refinements, (ii) To simplify the design of\nour finite element model and (iii) Due to lack of information dealing with the\nmechanical properties of the immature phase located at the between the TC\nmolecules in transversal direction. In the finite element model, same mechanical\nproperties are introduced for both phases.\n\n\f9\n\nThe mineralized collagen microfibril composed of the three phases is considered an\nelastic material and the constitutive law used is given by:\n(1)\nis the Cauchy stress component,\ncomponents of elasticity tensor\n\nthe linear strains and\n\nare the\n\nThe proposed FE model was coupled to an optimization algorithm based on\nminimizing to this finite element model to minimize the spring back without having\nrecourse to an experimental database. The developed inverse identification algorithm\nconsists in minimizing the objective function, which is the difference between the\npredicted force-displacement curves obtained respectively by the equivalent\n(monophase) model and the 3D simulation using the multiphase model. This method\ncalled inverse identification used to calculate equivalent proprieties.\n3. Computational results\nAs mentioned above, from the previous literatures, both mechanical and\ngeometrical properties of collagen and mineral have not fixed values because of the\nnature of the alive human bone tissue. In fact these variations have a significant\ninfluence on the properties of the collagen mineralized microfibril in the nano-scale\nand on the cortical bone in the macro-scale. A parametric study was performed in\norder to investigate the influence of both geometrical (TC molecule diameter) and\nmechanical parameters on the mechanical behaviour of the microfibril.\nFig. 5 depicts that the equivalent Young's modulus of the microfibril is increased with\nincreasing of the Young's modulus of the mineral. Fig.6 shows the effect of crosslinks number on equivalent Young's modulus. A non linear curve is obtained. It is\ncomposed of two parts: (i) from N = 1 to N = 20, the cross-links number has an effect\nand (ii) a constant value \"plateau value\". It also shows that when the quantity of\ncollagen increases, the microfibrils ductility increases.\n\n\f10\n\nFigure5. Equivalent Young's modulus of a\ncollagen microfibril as a function of the\nYoung's modulus of mineral Em at\nEc= 2.7GPa and N=1.\n\nFigure6. Equivalent Young's modulus of a\ncollagen microfibril as a function of the crosslinks number under varying TC diameter\nEc=2.7GPa and Em= 114GPa and N=1.\n\nFig. 7 shows that if the Young's modulus of the mineral increases, the\nequivalent Poisson's ratio decreases due to the hardness of the mineral material i.e.\nas its Young's modulus increases the hardness of the collagen microfibril increases,\nand its ductility decreases. On other side as the Young's modulus of collagen (soft\nand elastic material) increases ,the ductility of whole structure increases, which can\nbe expressed by the increase of Poisson's ratio as shown in Fig. 8.\n\nFigure7. Passion's ratio of a collagen\nmicrofibril as a function of the Young's\nmodulus of mineral Em with Young's\nmodulus of collagen Ec= 2.7GPa and\nnumber of cross-links N=1.\n\nFigure8. Passion's ratio of a collagen\nmicrofibril as a function of the Young's\nmodulus of collagen Ec with Young's\nmodulus of mineral Em= 114GPa and\nnumber of cross-links N=1.\n\n\f11\n\nFig. 9 shows that Von Mises stress increase when the Em increases; it means\nthat the microfibril becomes more rigid and resistant\n\nFigure9. FE Von Mises stress contours under varying mineral Young's modulus at\nEc=2.7GPa and N=0.\n\n4. Discussion and Conclusion\nBone is a composite material, where the nanoscale characteristics of\nindividual constituents are important to the overall quality of bone and their\nmechanical properties (37). On the nanoscale, it is important to determine the\ninfluence of the structural properties of individual TC molecules and the single\nmineralized crystallites within the bone matrix. Physical and mechanical properties of\neach constituent, such as mineral crystal size and orientation, collagen diameter and\norientation, and hardness and elastic modulus of nanoscale structures are all\n\n\f12\n\ncharacteristics that contribute to the fragility and strength of mineralized collagen\nmicrofibrils.\nThe collagen network in bone provides resistance against fractures and may\nbe susceptible to change with aging and disease (38). For example, in osteogenesis\nimperfecta, a disease characterized by decreased material properties and bone\nfragility, some mutations in the amino-acid sequence of type I collagen can lead to\nthe formation of branched fibers responsible for brittle bone and abnormal\nmineralization (39). The major role of Collagen, as it is known, is to give bone its\nductile properties, so understanding how collagen microfibrils are oriented as well as\nknowing their geometry is important to study the bone quality (40, 41). The\norientation of the collagen within the bone matrix is important to bone stiffness and\nstrength (42, 43). Although the classical convention says that collagen is primarily\ncorrelated to the post-yield properties of bone, collagen can have an effect as well on\nbone's tensile stiffness, and perhaps its strength, although this is less clear (44, 45).\nIn other side, although collagen may have some influence on the pre-yield\nproperties, the mineral fraction is widely acknowledged to have a greater impact on\nthe pre-yield mechanical properties than collagen does. Collagen content and crosslinking are more closely related to the post-yield properties of bone, and have a\nprofound effect on bone's toughness, ductility, and viscoelasticity (46, 47). There are\nalso studies showing the importance of the mineral phase with its density,\nmechanical properties, arrangement and orientation of crystal leaves which it is\nconstituted of. Bone mineral density is the gold-standard for assessing bone quantity\nand diagnosing osteoporosis. Although bone mineral density measurements assess\nthe quantity of bone, the quality of the tissue is an important predictor of fragility (48).\nAlso studies have shown that fluoride treatments for osteoporosis negatively alter\ncrystal structure (49, 50), decreasing elasticity and bone strength and thereby\n\n\f13\n\nincreasing fracture risk, (51, 52). In agreement with these facts, this work confirm that\nthe decreasing of ductility of the collagen microfibrils is caused by the increasing of\nthe Young's modulus of mineral phase, clarified by the curve of the equivalent\nPassion's ratio as a function of the Young's modulus of mineral phase ( Fig. 7).\nThe graph Fig.9 shows that the number of cross-link has a most influence on\nthe increase in the equivalent Young's modulus. if increase the number of cross-link\nincrease the bone material will be more stiffness , however when N > 20 Young's\nmodulus does not depend on the cross-link number and it remains at constant value\n\"plateau value\", same observation has been also found by J.Buehler (4) in his\nmolecular multi-scale study of collagen fibril, where it is found that the yield stress\nand fracture stress depend on the cross-link density \"β\" only when β < 25 and it is\ninterpreted as the plateau value can be explained by a change in molecular\ndeformation mechanism from predominantly shear (for β < 25) to molecular fracture\n(for β >25) .\nThus, a 3D multiscale study is necessary since the model 2D, although it\nreflects the mechanical properties of the phases, it doesn't allow us to present\nmicrofibrils with their specific arrangements as well the orientation of their TC\nmolecules. Our proposed model combines the two features geometric and\nmechanical of each phase. The results found confirm the functionality of this 3D finite\nelement model and justify the results found by above theoretical and experimental\nstudies. The individual properties of the collagen fibers and mineral crystals cannot\nfully explain the mechanical behaviour of the bone matrix. Rather, it is the interaction\nand orientation of the constituents that could influence bone quality (53), this\ncondition is satisfied by the model being proposed which takes into account the effect\nof cross-links whose importance maturity to bone's mechanical proprieties stays\n\n\f14\n\nunclear (54, 55) and the manner in which the molecules of tropocollagen are linked\nthat can have a profound effect on the strength, stiffness and fragility of the tissue.\nIn this paper we study for the first time the mechanical behaviour of microfibrils\nusing the 3D finite element model and the inverse identification method. The Results\nfound in this study seems logical and consistent among, they prove functionality and\nreliability of this model which can be also used to investigate many other phenomena\nand role of same parameters linked to mechanical and biological behaviour of bone\nin this scale. This work also allows us to understand better this nanoscale and study\nthe upper level scale which is the collagen fibril with the same methods by using the\nresults found in this scale. But before proceeding to the next level to reach cortical\nbone's one, it is necessary to improve these results by studying the effects related to\nmechanical characteristic of constituents. With the model being proposed, we try to\nmodel microfibrils and touch on the reality, but this model is still limited owing to the\nspecific arrangement of collagen molecules, the orientation of mineral crystals, the\ncomplicated distribution of each phase and in the manner of modelling the cross-links\nThe current work studied the microfibril mechanical behaviour under tensile\nand compression tests. In tension/compression, the shape of the model is not\nimportant since the reaction depends only on the area of the section. The shape play\na role during the bending and torsion tests, if the quasi –hexagonal structure of\nmicrofibrils is admitted, this model cannot be used for torsional and bending.\n\nAcknowledgements\nThis work has been supported by French National Research Agency (ANR)\nthrough TecSan program (Project MoDos, n°ANR-09-TECS-018).\nReferences\n\n\f15\n\n1. Sergey V. Dorozhkin, Nanosized and nanocrystalline calcium orthophosphates, Acta\nBiomaterialia 6 (2010) 715–734.\n2. Hambli R., Katerchi H. and Benhamou\nremodelling\n\nsimulation\n\nusing\n\ncoupled\n\nC.L., Multiscale methodology for bone\nfinite\n\nelement\n\nand\n\nneural\n\nnetwork\n\ncomputation,Biomechanics and Modeling in Mechanobiology ,10-1 (2010) 133-145.\n3. Jae-Young Rhao, liisa Kuhn-Spearing, Peter Zioupos, Mechanical properties and\nhierarchical structure of bone, medical Engineering &Physics 20(1998) 92-102.\n4. Buehler, M.J., Nanomechanics of collagen fibrils under varying cross-link densities:\natomistic and continuum studies. Journal of the Mechanical Behavior of Biomedical\nMaterials 1 (1) (2008) 59–67\n5. Gautieri A., Vesentini S., Redaelli A. and Buehler M.J., , Hierarchical structure and\nnanomechanics of collagen microfibrils from the atomistic scale up, Nano Letters\n9;11(2) (2011) 757-66.\n6. Uzel S.G.M., Buehler M.J., Molecular structure, mechanical behavior and failure\nmechanism of the C-terminal cross-link domain in type I collagen. Journal of the\nMechanical Behavior of Biomedical Materials, 4 (2011) 153–161\n7. Hulmes, D.J.S., T.J. Wess, D.J. Prockop, and P. Fratzl, Radial Packing, Order, And\nDisorder In Collagen Fibrils. Biophysical Journal,. 68(5) (1995) 1661-1670.\n8. Orgel, J.P.R.O., T.C. Irving, A. Miller, and T.J. Wess, Microfibrillar structure of type I\ncollagen in situ. P. Natl. Acad. Sci. USA. 103(24) , (2006) 9001-9005.\n9. Aladin, D.M., K.M. Cheung, A.H. Ngan, D. Chan, V.Y. Leung, C.T. Lim, K.D. Luk, and\nW.W. Lu, Nanostructure of collagen fibrils in human nucleus pulposus and its\ncorrelation with macroscale tissue mechanics,.J Orthop Res. 28(4) (2010) 497-502.\n10. Raspanti M, Congiu T, Guizzardi S. Tapping-mode atomic force microscopy in fluid of\nhydrated extracellular matrix. Matrix Biol. 20 (2001) 601-604.\n11. Baselt DR, Revel JP, Baldschwieler JD. Subfibrillar structure of type I collagen\nobserved by atomic force microscopy. Biophys. J, 65 (1993) 2644-2655.\n12. Holmes DF, Gilpin CJ, Baldock C, Ziese U, Koster AJ, Kadler KE. Corneal collagen\nfibril structure in three dimensions: structural insights into fibril assembly, mechanical\nproperties, and tissue organization. Proc. Natl. Acad. Sci. USA, 98 (2001) 7307-7312.\n13. Sun Y., Z. Luo A. Fertala and K. An, Direct quantification of the flexibility of type I\ncollagen monomer. Biochemical And Biophysical Research Communications, 295(2)\n(2002) 382-386.\n14. Buehler, M.J. and S.Y. Wong, Entropic elasticity controls nanomechanics of single\ntropocollagen molecules. Biophysical Journal, 93(1) (2007) 37-43.\n15. van der Rijt, J.A.J., K.O. van der Werf, M.L. Bennink, P.J. Dijkstra, and J. Feijen,\nMicromechanical testing of individual collagen fibrils. Macromolecular Bioscience,\n6(9) (2006) 697-702.\n\n\f16\n\n16. Sasaki, N.; Odajima, S. J. Biomech., Elongation mechanism of collagen fibrils and\nforce-strain relations of tendon at each level of structural hierarchy, 29 (9) (1996)\n1131–1136\n17. Gupta, H.S., W. Wagermaier, G.A. Zickler, D.R.B. Aroush, S.S. Funari, P. Roschger,\nH.D. Wagner, and P. Fratzl, Nanoscale deformation mechanisms in bone. Nano\nLetters, 5(10) (2005) 2108-2111\n18. Jäger, I., and P. Fratzl. Mineralized collagen fibrils: a mechanical model with a\nstaggered arrangement of mineral particles. Biophys. J. 79 (2000) 1737–1746.\n19. A. Blažej, A. Galatík, J. Galatík, M. Mládek, Technologie kůže a kožešin, SNTL Praha\n(1984).\n20. P.Bruckner, D. E Birk, Collagen, (2005).\n21. M. Stančíková, R. Stančík, Z. Gubzová, J. Rovenský, Collagen in the Treatment of\nRheumatic Diseases - Oral Tolerance, Bratislavské listy (1999)\n22. Stephen C. Cowin, Do liquid crystal-like flow processes occur in the supramolecular\nassembly of biological tissues, J. Non-Newtonion Fluid Mech. 119 (2004) 155-162.\n23. Landis, W. J., K. J. Hodgens, J. Arena, M.-J. Song, and B. F. McEwen. Structural\nrelations between collagen and mineral in bone by high voltage electron microscopic\n(1996) 192–202.\n24. Posner AS Crystal chemistry of bone mineral. Physiol Rev 49 (1969) 760–792\n25. Rubin MA, Jasiuk I, Taylor J, Rubin J, Ganey T, Apkarian RP TEM analysis of the\nnanostructure of normal and osteoporotic human trabecular bone. Bone 33 (2003)\n270–282.\n26. Vashishth, D., The role of collagen matrix in skeletal fragility.Current Osteoporosis\nReports 5 (2007) 62–66.\n27. Thomas Siegmund, Matthew R. Allen, David B.Burr, 2008. Failure of mineralized\ncollagen fibrils: Modeling the role of collagen cross-linking, Journal of Biomechanics\n41 (2008) 1427–1435.\n28. Pidaparti RM, Chandran A, Takano Y, Turner CH, Bone mineral lies mainly outside\ncollagen fibrils: predictions of a composite model for osteonal bone. J Biomech 29\n(1996) 909–916.\n29. Vittorio Sansalone, Thibault Lemaire, Salah Naili, Modélisation multi-échelle des\npropriétés mécaniques de l'os : Étude à l'échelle de la fibrille, C. R. Mecanique 335\n(2007) 436–442.\n30. Vesentini, S.; Fitie, C. F. C.; Montevecchi, F. M.; Redaelli, A. Molecular assessment\nof the elastic properties of collagenlike homotrimer sequences. Biomech. Model\nMechanobiol. 3 (2005) 224–234.\n31. Weiner, S., and H. D. Wagner, The material bone. Structure–mechanical function\nrelations. Annu. Rev. Material Sci. 28 (1998) 271–298.\n\n\f17\n\n32. Cowin, S.C., Bone Mechanics. CRC Press, Boca Raton, (1989) 255–255.\n33. Currey, J. D., The relationship between the stiffness and the mineral content of bone.\nJ. Biomech. 2 (1969) 477– 480.\n34. Buehler M.J, Keten S., Ackbarow T., Theoretical and computational hierarchical\nnanomechanics of protein materials: Deformation and fracture, Progress in Materials\nScience 53 (2008) 1101–1241\n35. Lee J, Scheraga HA, Rackovsky S., Computational study of packing a collagen-like\nmolecule: quasi-hexagonal vs \"Smith\" collagen microfibril model. Biopolymers.,40(6)\n(1996) 595-607.\n36. Smith, J.W., Molecular Pattern in Native Collagen, Nature, 219 (1968) 157-158.\n37. M. E. Ruppel & L. M. Miller & D. B. Burr, the effect of the microscopic and nanoscale\nstructure on bone fragility, Osteoporos Int 19 (2008) 1251–1265.\n38. Deepak Vashishth, The Role of the Collagen Matrix in Skeletal Fragility, Current\nOsteoporosis Reports 2007, 5:62–66, Current Medicine Group LLC ISSN (2007)\n1544-1873.\n39. Baum J and Brodsky B Folding of peptide models of collagen and misfolding in\ndisease. Curr Opin Struct Biol 9 (1999) 122–128.\n40. Oxlund H, Barckman M, Ortoft G et al Reduced concentrations of collagen cross-links\nare associated with reduced strength of bone. Bone 17 (1995) 365S–371S.\n41. McCalden RW, McGeough JA, Barker MB et al, Agerelated changes in the tensile\nproperties of cortical bone The relative importance of changes in porosity,\nmineralization, and microstructure. J Bone Joint Surg Am 75 (1993) 1193–1205.\n42. Reilly DT, Burstein AH, Frankel VH The elastic modulus for bone. J Biomech 7 (1974)\n271–275.\n43. Evans FG, Vincentelli R Relation of collagen fiber orientation to some mechanical\nproperties of human cortical bone. J Biomech 2 (1969) 63–71.\n44. Garnero P, Borel O, Gineyts E et al, Extracellular posttranslational modifications of\ncollagen are major determinants of biomechanical properties of fetal bovine cortical\nbone. Bone 38 (2006) 300–309.\n45. Zioupos P, Currey JD, Hamer AJ, The role of collagen in the declining mechanical\nproperties of aging human cortical bone. J Biomed Mater Res 45 (1999) 108–116.\n46. Paschalis E, Ilg A, Verdelis K et al, Spectroscopic determination of collagen crosslinks at the ultrastructural level, and its application to osteoporosis. Bone 23 (1998)\nS342.\n47. Yamauchi MM, Young DR, Chandler GS, Crosslinking and new bone collagen\nsyntheses in immobilized and recovering primate osteoporosis. Bone 9 (1988) 415.\n48. Aaron JE, de Vernejoul MC, Kanis JA, The effect of sodium fluoride on trabecular\narchitecture. Bone 12 (1991) 307–310\n\n\f18\n\n49. Eriksen EF, Mosekilde L, Melsen F, Effect of sodium fluoride, calcium, phosphate,\nand vitamin D2 on trabecular bone balance and remodeling in osteoporotics. Bone 6\n(1985) 381–389.\n50. Gambacciani M, Spinetti A, Taponeco F et al, Treatment of postmenopausal vertebral\nosteopenia\n\nwith\n\nmonofluorophospate:\n\na\n\nlong-term\n\ncalcium-controlled\n\nstudy.\n\nOsteoporos Int 5 (1995) 467–471\n51. Haguenauer D, Welch V, Shea B et al, Fluoride for the treatment of postmenopausal\nosteoporotic fractures: a metaanalysis. Osteoporos Int 11 (2000) 727–738.\n52. S. Viguet-Carrin AE P. Garnero AE P.D. Delmas, the role of collagen in bone strength,\nOsteoporos Int 17 (2006) 319–336.\n53. Currey JD., Role of collagen and other organics in the mechanical properties of bone.\nOsteoporos Int 14 (2003) S29–S36.\n54. Zioupos P, Currey JD, Hamer AJ The role of collagen in the declining mechanical\nproperties of aging human cortical bone. J Biomed Mater Res 45 (1999) 108–116.\n55. Bailey AJ, Sims TJ, Ebbesen EN et al, Age-related changes in the biochemical\nproperties of human cancellous bone collagen: relationship to bone strength. Calcif\nTissue Int 65 (1999) 203–210.\n\n\f"}