{"id": "http://arxiv.org/abs/0905.3498v3", "guidislink": true, "updated": "2012-06-12T16:57:46Z", "updated_parsed": [2012, 6, 12, 16, 57, 46, 1, 164, 0], "published": "2009-05-21T14:48:16Z", "published_parsed": [2009, 5, 21, 14, 48, 16, 3, 141, 0], "title": "Bright and Dark Helices of Light", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0905.2903%2C0905.1330%2C0905.2004%2C0905.2630%2C0905.0623%2C0905.1547%2C0905.4744%2C0905.1280%2C0905.3764%2C0905.4464%2C0905.3627%2C0905.1540%2C0905.2228%2C0905.1422%2C0905.3310%2C0905.1310%2C0905.2814%2C0905.0796%2C0905.3411%2C0905.4271%2C0905.1574%2C0905.3890%2C0905.2164%2C0905.1014%2C0905.1419%2C0905.2601%2C0905.3107%2C0905.3936%2C0905.0029%2C0905.0559%2C0905.4856%2C0905.2480%2C0905.1110%2C0905.3584%2C0905.2946%2C0905.2949%2C0905.3955%2C0905.4499%2C0905.1463%2C0905.1046%2C0905.4001%2C0905.2723%2C0905.1008%2C0905.2663%2C0905.1696%2C0905.4797%2C0905.3628%2C0905.3806%2C0905.2520%2C0905.1150%2C0905.2548%2C0905.1048%2C0905.0051%2C0905.2532%2C0905.0322%2C0905.3444%2C0905.0767%2C0905.2023%2C0905.0376%2C0905.0929%2C0905.2435%2C0905.3418%2C0905.2793%2C0905.4106%2C0905.3308%2C0905.1589%2C0905.0399%2C0905.4026%2C0905.4405%2C0905.2894%2C0905.1566%2C0905.1133%2C0905.2142%2C0905.0930%2C0905.4954%2C0905.2325%2C0905.0410%2C0905.3912%2C0905.3094%2C0905.3811%2C0905.0599%2C0905.1080%2C0905.0732%2C0905.1912%2C0905.2883%2C0905.0436%2C0905.2127%2C0905.4867%2C0905.4732%2C0905.3332%2C0905.0032%2C0905.0632%2C0905.1308%2C0905.1159%2C0905.0515%2C0905.1042%2C0905.3152%2C0905.2598%2C0905.0122%2C0905.3498%2C0905.4517&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Bright and Dark Helices of Light"}, "summary": "Laser beams can be made to form bright and dark intensity helices of light.\nSuch helices have a pitch length on the order of a wavelength and may have\napplications in lithography and the manipulation of particles through optical\nforces. The formation of bright helices is more strongly constrained by optical\nresolution limits than that of dark helices, corresponding scaling laws are\nderived and their relevance for photo-lithography pointed out. It is shown how\nto arrange dark helices on a grid in massively parallel fashion in order to\ncreate handed materials using photo-lithographic techniques.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0905.2903%2C0905.1330%2C0905.2004%2C0905.2630%2C0905.0623%2C0905.1547%2C0905.4744%2C0905.1280%2C0905.3764%2C0905.4464%2C0905.3627%2C0905.1540%2C0905.2228%2C0905.1422%2C0905.3310%2C0905.1310%2C0905.2814%2C0905.0796%2C0905.3411%2C0905.4271%2C0905.1574%2C0905.3890%2C0905.2164%2C0905.1014%2C0905.1419%2C0905.2601%2C0905.3107%2C0905.3936%2C0905.0029%2C0905.0559%2C0905.4856%2C0905.2480%2C0905.1110%2C0905.3584%2C0905.2946%2C0905.2949%2C0905.3955%2C0905.4499%2C0905.1463%2C0905.1046%2C0905.4001%2C0905.2723%2C0905.1008%2C0905.2663%2C0905.1696%2C0905.4797%2C0905.3628%2C0905.3806%2C0905.2520%2C0905.1150%2C0905.2548%2C0905.1048%2C0905.0051%2C0905.2532%2C0905.0322%2C0905.3444%2C0905.0767%2C0905.2023%2C0905.0376%2C0905.0929%2C0905.2435%2C0905.3418%2C0905.2793%2C0905.4106%2C0905.3308%2C0905.1589%2C0905.0399%2C0905.4026%2C0905.4405%2C0905.2894%2C0905.1566%2C0905.1133%2C0905.2142%2C0905.0930%2C0905.4954%2C0905.2325%2C0905.0410%2C0905.3912%2C0905.3094%2C0905.3811%2C0905.0599%2C0905.1080%2C0905.0732%2C0905.1912%2C0905.2883%2C0905.0436%2C0905.2127%2C0905.4867%2C0905.4732%2C0905.3332%2C0905.0032%2C0905.0632%2C0905.1308%2C0905.1159%2C0905.0515%2C0905.1042%2C0905.3152%2C0905.2598%2C0905.0122%2C0905.3498%2C0905.4517&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Laser beams can be made to form bright and dark intensity helices of light.\nSuch helices have a pitch length on the order of a wavelength and may have\napplications in lithography and the manipulation of particles through optical\nforces. The formation of bright helices is more strongly constrained by optical\nresolution limits than that of dark helices, corresponding scaling laws are\nderived and their relevance for photo-lithography pointed out. It is shown how\nto arrange dark helices on a grid in massively parallel fashion in order to\ncreate handed materials using photo-lithographic techniques."}, "authors": ["Ole Steuernagel"], "author_detail": {"name": "Ole Steuernagel"}, "author": "Ole Steuernagel", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1364/OE.20.014371", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0905.3498v3", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0905.3498v3", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "9 pages, 5 figures", "arxiv_primary_category": {"term": "quant-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "quant-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "cond-mat.mes-hall", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "physics.optics", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0905.3498v3", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0905.3498v3", "journal_reference": "Optics Express, Vol. 20, Issue 13, pp. 14371-14379 (2012)", "doi": "10.1364/OE.20.014371", "fulltext": "Bright and dark helices of light\nOle Steuernagel\n\narXiv:0905.3498v3 [quant-ph] 12 Jun 2012\n\nSchool of Physics, Astronomy and Mathematics, University of Hertfordshire, Hatfield, AL10\n9AB, UK\nO.Steuernagel@herts.ac.uk\n\nAbstract: Laser beams can be made to form bright and dark intensity\nhelices of light. Such helices have a pitch length on the order of a wavelength and may have applications in lithography and the manipulation\nof particles through optical forces. The formation of bright helices is\nmore strongly constrained by optical resolution limits than that of dark\nhelices, corresponding scaling laws are derived and their relevance for\nphoto-lithography pointed out. It is shown how to arrange dark helices on a\ngrid in massively parallel fashion in order to create handed materials using\nphoto-lithographic techniques.\nOptics Express 13 14371–14379 (2018) doi = 10.1364/OE.20.014371\nOCIS codes: (260.3160) Interference; (220.3740) Lithography; (220.4000) Microstructure\nfabrication; (110.4235) Nanolithography; (160.1585) Chiral media.\n\nReferences and links\n1. L. Allen, M. W. Beijersbergen, R. J. C. Spreeuw, and J. P. Woerdman, \"Orbital angular momentum of light and\nthe transformation of Laguerre-Gaussian laser modes,\" Phys. Rev. A 45, 8185–8189 (1992).\n2. M. Padgett and L. Allen, \"Light with a twist in its tail,\" Cont. Phys. 41, 275–285 (2000).\n3. M. Padgett, J. Courtial, and L. Allen, \"Light's Orbital Angular Momentum,\" Physics Today 57, 35–40 (2004).\n4. M. Harris, C. A. Hill, and J. M. Vaughan, \"Optical helices and spiral interference fringes,\" Opt. Commun. 106,\n161–166 (1994).\n5. J. M. Vaughan, \"Interferometry, atoms and light scattering: one hundred years of optics,\" J. Opt. A: Pure Appl.\nOpt. 1, 750–768 (1999).\n6. J. Leach, S. Keen, M. J. Padgett, C. Saunter, and G. D. Love, \"Direct measurement of the skew angle of the\nPoynting vector in a helically phased beam,\" Optics Express 14, 11919–11924 (2006).\n7. O. Steuernagel, \"Equivalence between focused paraxial beams and the quantum harmonic oscillator,\" Am. J.\nPhys. 73, 625–629 (2005).\n8. J. Lekner, \"LETTER TO THE EDITOR: Helical light pulses,\" J. Opt. A: Pure Appl. Opt. 6, L29–L32 (2004).\n9. J. Hamazaki, Y. Mineta, K. Oka, and R. Morita, \"Direct observation of Gouy phase shift in a propagating optical\nvortex,\" Opt. Express 14, 8382–8392 (2006).\n10. S. M. Baumann, D. M. Kalb, L. H. MacMillan, and E. J. Galvez, \"Propagation dynamics of optical vortices due\nto Gouy phase,\" Opt. Express 17, 9818–9827 (2009).\n11. J. Becker, P. Rose, M. Boguslawski, and C. Denz, \"Systematic approach to complex periodic vortex and helix\nlattices,\" Opt. Express 19, 9848–9862 (2011).\n12. K. Volke-Sepúlveda and R. Jáuregui, \"All-optical 3D atomic loops generated with Bessel light fields,\" J. Phys.\nB: At. Mol. Phys. 42, 085303 (2009).\n13. K. Staliunas, \"Vortex Creation in Bose-Einstein Condensates by Diffraction on a Helical Light Grating,\"\nhttp://www.arxiv.org/abs/cond-mat/9912268 (1999).\n14. M. Bhattacharya, \"Lattice with a twist: Helical waveguides for ultracold matter,\" Opt. Commun. 279, 219–222\n(2007).\n15. J. F. Nye and M. V. Berry, \"Dislocations in Wave Trains,\" Royal Society of London Proceedings Series A 336,\n165–190 (1974).\n16. S. Kuhr, W. Alt, D. Schrader, M. Müller, V. Gomer, and D. Meschede, \"Deterministic Delivery of a Single\nAtom,\" Science 293, 278–281 (2001).\n17. D. Meschede and H. Metcalf, \"Atomic nanofabrication: atomic deposition and lithography by laser and magnetic\nforces,\" J. Phys. D: Appl. Phys. 36, R17–R38 (2003).\n\n\f18. L. Marrucci, C. Manzo, and D. Paparo, \"Optical spin-to-orbital angular momentum conversion in inhomogeneous\nanisotropic media,\" Phys. Rev. Lett. 96, 163905 (2006).\n19. J. Leach, M. R. Dennis, J. Courtial, and M. J. Padgett, \"Laser beams: Knotted threads of darkness,\" Nature 432,\n165–165 (2004).\n20. M. P. MacDonald, L. Paterson, K. Volke-Sepulveda, J. Arlt, W. Sibbett, and K. Dholakia, \"Creation and Manipulation of Three-Dimensional Optically Trapped Structures,\" Science 296, 1101–1103 (2002).\n21. F. Pampaloni and J. Enderlein, \"Gaussian, Hermite-Gaussian, and Laguerre-Gaussian beams: A primer ,\"\nhttp://www.arxiv.org/abs/physics/0410021 (2004).\n22. H. A. Haus, Electromagnetic Noise and Quantum Optical Measurements (Springer, Heidelberg, 2000).\n23. L. Paterson, M. P. MacDonald, J. Arlt, W. Sibbett, P. E. Bryant, and K. Dholakia, \"Controlled Rotation of Optically Trapped Microscopic Particles,\" Science 292, 912–914 (2001).\n24. K. Dholakia, G. C. Spalding, and M. MacDonald, \"Optical tweezers: The next generation,\" Phys.World 15, 31–35\n(2002).\n25. M. P. MacDonald, K. Volke-Sepulveda, L. Paterson, J. Arlt, W. Sibbett, and K. Dholakia, \"Revolving interference\npatterns for the rotation of optically trapped particles,\" Opt. Commun. 201, 21–28 (2002).\n26. S. Chu, \"Nobel Lecture: The manipulation of neutral particles,\" Rev. Mod. Phys. 70, 685–706 (1998).\n27. S. W. Hell, \"Far-Field Optical Nanoscopy,\" Science 316, 1153–1158 (2007).\n28. Y. Kim, H. Jung, S. Kim, J. Jang, J. Y. Lee, and J. W. Hahn, \"Accurate near-field lithography modeling and\nquantitative mapping of the near-field distribution of a plasmonic nanoaperture in a metal,\" Opt. Express 19,\n19296–19309 (2011).\n29. S. Kawata, H.-B. Sun, T. Tanaka, and K. Takada, \"Finer features for functional microdevices,\" Nature 412, 697–\n698 (2001).\n30. A. Sihvola, \"Metamaterials in electromagnetics,\" Metamaterials 1, 2–11 (2007).\n31. I. V. Semchenko, S. A. Khakhomov, and S. A. Tretyakov, \"Chiral metamaterial with unit negative refraction\nindex,\" Eur. Phys. J. Appl. Phys. 46, 032607 (2009).\n32. M. Tonouchi, \"Cutting-edge terahertz technology,\" Nature Photonics 1, 97–105 (2007).\n33. Y. B. Gaididei, P. L. Christiansen, P. G. Kevrekidis, H. Büttner, and A. R. Bishop, \"Localization of nonlinear\nexcitations in curved waveguides,\" New J. Phys. 7, 52–52 (2005).\n34. P. Exner and M. Fraas, \"A remark on helical waveguides,\" Phys. Lett. A 369, 393–399 (2007).\n35. X.-L. Qi and S.-C. Zhang, \"Field-induced gap and quantized charge pumping in a nanoscale helical wire,\" Phys.\nRev. B 79, 235442 (2009).\n\n1.\n\nIntroduction\n\nIn recent years there has been considerable interest in monochromatic light beams, such as\nLaguerre-Gauss beams [1], carrying orbital angular momentum. These are known to have helical wave fronts [1–3] which have been investigated using interferometric techniques [4–6].\nSeveral approaches that create helical beams using the action of Gouy's phase [7] have been\nsuggested [8] and experimentally implemented [9, 10], combinations of plane waves have been\nused [11], whilst the use of Bessel-beams has also been suggested [12].\nFew setups have been envisaged using counterpropagating monochromatic beams, although\nonly these yield helices with pitch lengths on the order of their wavelength. Notable exceptions\nstudying bright helices are [12–14]. Here, dark helices are investigated for the first time; they\nare not resolution limited and therefore provide us with better contrast than bright helices.\nIn section 2 bright and dark intensity helices of light are introduced in terms of screw dislocations [15] of ordinary standing waves. This allows us to quantify some of their basic characteristics. In section 3 it is shown that using superpositions with unequal weight to generate\nthe intensity helices allows us to control their widths. Section 4 describes the scaling of the\nelectric field strength around dark and bright intensity helices and how this limits the resolution\nof bright helices compared to dark ones. Section 5 shows how both types can be arranged in\nlarge arrays in massively parallel fashion making them potentially suitable for the creation of\nhelical metamaterial using bulk lithography. Section 6 concludes with a survey of applications\nand the outlook.\n\n\f2.\n\nHelices through interference\n\nBright and dark interference fringes extending across a standing wave's cross-section are ubiquitous. In optics they have found applications in Lippmann's photography and Gabor's holography. They arise in laser cavities and interferometry and are used as transporters [16] and\nimaging elements [17] in atom optics. They are on the order of half a wavelength λ of the\ninterfering light apart and since light beams are more than a wavelength wide and can overlap\nover considerable areas these bright fringes often resemble very tall stacks of pancakes [16].\nThey can also be slightly modified (the pancakes become deformed), due to the dispersive effects of Gouy's phase, in interfering multimode beams [7]. Instead of using the superposition\nof identical beams we want to consider the interference between two monochromatic, collinear,\ncounterpropagating partial waves with different orbital angular momenta [1,2]. In this case one\ncan imagine the pancakes (which are centered on the beam axis, compare Fig. 1 (a) top) to be\ncut open on one side, then splayed open and glued to the opposing cut faces of their neighbours, compare Fig. 1 (a) middle. In the most tightly wound case such a screw dislocation [15]\nyields a helix with pitch length z1 = λ /2, see Fig. 1. The common pancake stack scenario can\n(a)\n\n(b)\n\n(c)\n\n0.5\n\ny\n\n0\n–0.5\n\n–0.5\n0\n\n–0.5\n\nz0\n\nx\n\n0.5\n0.5\n\nFig. 1. (a) illustrates the 'pancake' scenario explaining that helices form with pitch heights\nwhich are integer multiples of λ /2. (b) shows the superposition 12 u0,0 (x, y, z)+u0,1 (x, y, −z)\nyielding a single bright helix (red line) enveloping a single dark helix (black line) with the\nminimal pitch length λ /2 [colored mesh was numerically determined as the locations with\n90% of peak intensity]. (c) shows the magnitude |E| of its focal field distribution illustrating\nquadratic variation of |E| around the maximum and linear variation around the minimum.\nIn (b) and (c) the x- and y-axes are given in units of focal beam radius w0 , z-axis in units of\nλ , in (c) the peak intensity is normalized to unity.\n\nbe viewed as the special case of a degenerate helix with orbital angular momentum difference\nl − l 0 = 0 and associated pitch length z0 = 0. Alternatively to linking up nearest neighbours, the\ncut-open pancakes can be connected to their second nearest neighbour with pitch length z2 = λ\nleaving the nearest neighbour to form part of a second helix on the opposite side of the beam\naxis, compare Fig. 1 (a) bottom and Fig. 2.\nIn general the helices' pitch lengths zl−l 0 (orbital angular momentum quantization implies\nthat l is an integer [1]) are determined by the difference l − l 0 in orbital angular momentum\nof the used laser beams and obey zl−l 0 = λ (l − l 0 )/2. A negative helix length zl−l 0 describes\ninverted handedness. Different superpositions can yield a larger number of intertwined helices\nand concentric shells of helices, compare Fig. 2. Per nodal shell, there tend to exist a number\nof |l − l 0 | separate bright helices with dark helically wound regions between them, see references [2,3] and text following eq. (1) below. Details depend on the mode structures and relative\nweights of the employed superpositions, see sections 2 and 4.\nThe helices' widths can be controlled through the width of the laser beams' waists 2w0 . Their\nlengths are practically limited by the laser beams' divergence. If the beams' cross-sections are\n\n\f(a)\n\n(b)\nI 1\n\n1\n–1\n\n0.5\n0\n\ny 0\n–1\n\n1\n\n0\n\n1\n\nx\n–0.5\n1\n\n0\n\nz\n\n0.5\n\ny\n\n0\n\n0\n–1\n\nx\n\n–1\n\nFig. 2. Superposition u0,2 (x, y, z) + 12 u1,0 (x, y, −z) yields a pair of dark and bright helices\nwith pitch λ (a); its focal intensity distribution (b) [all units as in Fig. 1, note that compared\nto Fig. 1 the helices' orientation is reversed].\n\nelliptically deformed, so are the helices. Suitable laser beam modes that carry orbital angular\nmomentum, such as Laguerre-Gauss–modes [1], are readily available [2–5,18] and the required\nsuperpositions are straightforward to implement [19]. The relative phases of the interfering\nbeams can be shifted such that the intensity-helices revolve around their main axis (including\nvery rapid rotations through frequency detuning between the two opposing beams [18, 20]).\nFor specificity, we will consider the paraxial Laguerre-Gauss modes U p,l (x, y, z) [1, 21]\n(formed from 'generalized Laguerre polynomials' L p,|l| rather than, say, orbital angular momentum carrying Bessel-beams [12])\ns\n2\np!\nU p,l (zR , λ ; r, φ , z) =\n(1 + δ0,l )π (p + |l|)!\n!\u0012\n√ !|l|\n\u0013\n2r\neilφ\nr2\n×\nL p,|l| 2\nw (z)\nw (z)\nw (z)2\n\"\n#\nik r2\nr2\n− i (2 p + |l| + 1) ζ (z) +\n× exp −\n.\n(1)\n2ρ(z)\nw (z)2\nHere λ is the laser's wavelength and k = 2π/λ its wave number; x and y are the transverse\ncoordinates, and z parameterizes the beam axis. Kronecker's δ -function takes care of the correct\nnormalization. The azimuthal angle φ is connected to the transverse coordinates via the relation eilφ = (x + iy)l : l is the integer orbital angular momentum index with the associated orbital\nangular momentum Ll = h̄l [1, 2]. The discrete radial index p counts the number\nq of nodal rings\np\n2\n2\nin the radial direction r = x + y . The beam radii are given by w(z) = w0 1 + z2 /z2R with\np\nthe beam waist radius w0 = λ zR /π where zR is the Rayleigh-length which also parameterizes\nthe Gouy-phase shifts ζ (z) = arctan(z/zR ) and the wavefront radii ρ(z) = (z2 + z2R )/z [1, 21].\nIn order to form bright (or dark) light helices we have to create constructive (or destructive)\ninterference along the entire phase front. For this it suffices to interfere two radially matching pure Laguerre-Gauss laser modes, with suitably chosen amplitudes C and C0 , travelling in\nopposite directions, namely, to form a superposition\nE(x, y, z;t) = E(x, y, z;t) * P = [C u p,l (x, y, z) +C0 u0p0 ,l 0 (x, y, −z)] * e−iωt * P ,\n\n(2)\n\n\fwhere we used ω = c0 k for the angular frequency of the light and the paraxial solutions\nu p,l (x, y, z) = U p,l (x, y, z)eikz .\n\n(3)\n\nWe assume that the laser is uniformly polarized and the wave front curvatures can be neglected.\nThus the electric field E is a scalar field multiplied with the polarization vector P [22]. From\nthis superposition we can extract the spatially fast-oscillating term ei(kz+lφ ) which yields the\ninterference term cos(2kz + (l − l 0 )φ ). When a full turn (∆φ = 2π) along the intensity helix is\ntracked the ensuing spatial shift yields the pitch length in the z-direction\nzl−l 0 = (l − l 0 )2π/(2k) = λ (l − l 0 )/2 .\n\n(4)\n\nThis confirms the intuitive description in terms of a screw dislocation given above. Note that the\ninterference between two beams travelling in the same direction yields interference fringes [4]\nbut not helical intensity spirals on the wavelength scale; instead it forms intensity rods which\nare modulated by Gouy's phase thus forming rods with a twist [8, 23], very similar to those\ndisplayed in Fig. 1 of reference [24].\nIntuitively, this should not be too surprising since in a forward-only configuration light following a helical path would travel superluminally. The effects discussed here are not a consequence of Gouy's phase, unlike the helical intensity distributions considered in references [8]\nand [25] or the nodal lines investigated in reference [19], all giving rise to 'half-oscillations' [7]\non the scale of the beam's Rayleigh length.\nThe effects discussed here necessarily require interference of two counterpropagating partial\nwaves; this implies that the medium needs to be sufficiently transparent. Also note that reflection by a mirror inverts the helicity of a mode and therefore beams carrying orbital angular\nmomentum, say within a laser cavity, form intensity helices (but not single standalone helices\nsince |l − l 0 | 6= 1 in the reflection case).\n3.\n\nSome features of single dark helix beams\n\nIn this section some features of the single-helix superposition\nΣ(x, y, z;C) = C * u0,0 (x, y, z) + u0,1 (x, y, −z)\n\n(5)\n\nof an ordinary Gaussian beam u0,0 with a counterpropagating Laguerre-Gauss mode u0,1 with\none unit of orbital angular momentum are elucidated.\nThe single-helix superposition Σ(C) forms a single bright and a single dark helix, the Gaussian beam's relative weight fixes√the dark helix' radius since the field's zero in the focal plane\noccurs at (x0 , y0 , 0) = (−C w0 / 2, 0, 0). The stronger the field of the added Gaussian beam\nthe more the zero of the Laguerre-Gaussian mode gets displaced from the beam axis, compare\nFigs. 2 and 4. For small values of the coefficient C the dark helices are slim and steep, yet,\nunlike bright helices they remain distinguishable, see Fig. 4.\nIn general, determination of the precise form of helices along the beam axis requires solving\nan implicit problem. For beams formed from superpositions of the form (2) (of which Σ(C)\nof eq. (5) is a special case) the following mapping allows for a quick determination of the\napproximate location of the helices.\nq\n(x(z) + iy(z)) = (x0 + iy0 ) (1 + z2 /z2R ) exp(iχ(z))\n(6)\nwith the phase\n\nχ(z) = −(2(1 + p + p0 ) + |l| + |l 0 |)ζ (z) +\n\nkr2\n+ 2kz.\nρ(z)\n\n(7)\n\n\fThis is to be read as a complex-plane representation of a mapping of a helix' focal plane location (x0 , y0 ) to its location (x(z), y(z)) along the beam axis.\nNext we determine the field gradients for a dark helix formed\n√ from a single-helix beam Σ(C)\nat the intensity zero in the focal plane (x0 , y0 , 0) = (−Cw0 / 2, 0, 0)\n√\n∂x E = 2 π exp(−C2 /2)/(zR λ ),\n(8)\n∂y E = −i∂x E,\n\n(9)\n\np\n∂z E = C(−3λ +C λ + 4zR π)/ 2πzR λ * ∂y E ;\n2\n\nand\n\n(10)\n\nhere, the complex phases represent the gradients' phase differences within the optical cycle.\nThe gradients can be used to derive the exact pitch angle α the helix forms with the focal plane\n√\n\u0013\n\u0012\n\u0013\n\u0012\n−∂y E\n2πzR λ\n= − arctan\n.\n(11)\nα = arctan\n∂z E\nC(−3λ +C2 λ + 4zR π)\nIn this derivation\nthe first step arises from the observation that since the helix passes through\n√\n(−C w0 / 2, 0, 0) its tangent vector has the form τ = (0, τy , τz ). Since the helix is dark it moreover fulfils the condition τy * ∂y E + τz * ∂z E = 0 which implies eq. (11) above. For large values\nof C and zR /λ this expression conforms with the 'naive' expectation |α| ≈ arctan(h/x0 ) =\narctan(λ /(23/2 πCw0 )).\nWith the abbreviation g = ∂z E/∂y E, we can write down the normalized focal tangent vector τ = (1+g2 )−1/2 (0, −g, 1) and complete the associated Frenet trihedron by forming the third\nvector η = x̂ × τ = −(1 + g2 )−1/2 (0, 1, g).\nA dark helix can be used as the core of a blue-detuned [26], helical atom waveguide [14].\nWhereas τ points in the direction of free movement, x̂ = (1, 0, 0) and η form the principal axes\nof the local transverse trapping potential\nV (x, η) ∝ |∂x E|2 x2 + |∂η E|2 η 2 ,\nwhere ∂η E = η * ∇ (E)\nwith\n(12)\ns\n2zR π + 9C2 λ − 6C4 λ − 24C2 πzR +C6 λ + 8C4 πzR + 16C2 π 2 z2R /λ\n∂η E = −i∂x E *\n(13)\n2zR π\nThis can be used to determine the transverse potential's trapping frequencies and their\nanisotropy ratio A = ωx /ωη [14], which is plotted in Fig. 3.\n\nA\n\n1\n\n0.5\n\n0\n0\n5\n0.1\n\n10\n\nzR\n\n15\n\n0.2\n\nC\n\n20\n\nFig. 3. The frequency anisotropy A = ωx /ωη = |∂x E|/|∂η E| of the transversal trapping\npotential of dark helices of a single-helix beam Σ(C). The anisotropy A < 1, A ≈ 1 if one\nuses small helix radii (C small); qualitatively the same behaviour was seen for bright helices\nin reference [14] [zR measured in units of λ ].\n\n\f(a)\n\n(b)\n\n1\n1\n\nI 0.5\n0\n0\n–1\n\n–1\n\nx\n\n0\n\ny\n\nlog10 (I(x, y, 0))\n\n0\n\n–2\n–4\n–6\n\n1\n0 x\n–1\n\n–8\n\n1\n\n1\n\n0\n\ny\n\n–1\n\nFig. 4. The focal intensity distribution of superposition u0,2 (x, y, z) + u0,0 (x, y, −z) (a) and\n1\nu0,0 (x, y, −z) (b) demonstrate that narrowly\nits logarithm for superposition u0,2 (x, y, z) + 10\nwound bright helices self-overlap and become ill defined whereas dark helices remain distinguishable [coordinate axes scaled in units of beam width w0 ].\n\n4.\n\nDark helices are more sharply contoured than bright helices\n\nUnlike bright features dark features can provide superresolution [27]. This allows us to create\nstructures with spatial extensions below the diffraction limit. To see how the optical resolution\nlimit constrains bright helices much more than dark ones, recall that bright helices are centered on the maximum position rM of the local electric field. According to Fourier's theorems\nmonochromatic light fields in free space have to be smooth and differentiable, they cannot have\nspikes. Therefore, the field's magnitude, when moving by a small displacement δ r away from\nthe core of the helix, can at best drop quadratically with δ r, namely, with κ as the maximal\nlocal curvature we have\n|δ EM (δ r)| = |E(rM )| − |E(rM + δ r)| ≤\n\n|κ|\n* (δ r)2 + O((δ r)3 ) .\n2\n\n(14)\n\nAround a zero at location rm the field instead typically rises linearly (unless one tracks the helix\ncore), this variation is bounded by the largest local gradient γ\n|δ Em (δ r)| ≈ |E(rm + δ r)| − 0 ≤ |γ| * |δ r| + O((δ r)2 ) .\n\n(15)\n\nThis difference in the scaling of the variation of the local field magnitude allows for sharper\ndefinition of dark helices compared with bright ones; this is represented graphically in the field\nmagnitude plot of panel (c) of Fig. 1, in the comparison in Fig. 4, and in the 'spikiness' of\nthe dark helices' intensity profiles in Fig. 5 (b) and (c). Note that the location of the bright\nhelices in these two plots are harder to make out than those of the dark ones. One might be\ntempted to argue that a logarithmic plot 'unfairly' pronounces the presence of dark helices over\nbright ones, but photoresists, for example, tend to have logarithmic response functions [28] so\nthe use of Figs. 4 (b), and 5 (b) and (c) is quite suitable when trying to gauge outcomes in a\nphoto-lithographic application.\n5.\n\nLattices of dark helices\n\nIt is possible to embed dark helical beams into a background of roughly uniform illumination.\nTo this end a hexagonal lattice is used because it has high symmetry and can be very tightly\npacked. Ordinarily, regions of completely destructive interference of such tightly packed beams\nwould be unavoidable. In order to make certain that no dark areas other than the desired dark\n\n\fy\n\n4\n\n(b)\n\n2\n\n–2\n\n2\n0\n\nx\n\nlog10 (I(x, y, 0))\n\n(a)\n\n–2\n–3\n–4\n–5\n–6\n–7\n\n–2\n5\n0\n\n5\n\ny\n–4\n\n(c)\n\n–5\n\nx\n\n(d)\n\n–4\n\nI(x, y, 0)\n\nlog10 (I(x, y, 0))\n\n0\n\n–5\n\n–6\n\n5\n1\n0 x\n\n0.5\n\n–8\n\n–10\n\n5\n0\n\n5\n0\n\ny\n\n–5\n\n–5\n\nx\n\n0\n–5\n\n5\n\n0\n\ny\n\n–5\n\nFig. 5. A set of parallel equal Gaussian beams u0,0 (x − XG , y −YG , z) travelling along the zaxis and with their beam axes centered on a set of grid points {(XG ,YG , 0)} of a hexagonal\nlattice is arranged into three sub-lattices with different polarization orientations (beam centers and respective beam polarizations indicated by arrows in panel (a); nearest neighbour\ndistance 2.3 w0 ). Despite its tight packing this sub-lattice arrangement avoids destructive\ninterference between beams of equal polarization and yields a roughly uniformly bright\nbackground, see panels (b) and (c). The focal intensity distribution of a single dark helix\ncreated from the superposition Σ(x, y, z; 81 ) of eq. (5) is displayed in panel (d) together with\nan artist's impression of the location of its dark helix as a black line. Such dark helices\ncan be inserted into the bright background without losing their contrast, (b) and (c), for details see section 5. Massively parallel or sparse implementation of dark helices with good\ncontrast is possible. All position coordinate axes are scaled in units of beam width w0 .\n\nhelices are created, we partition the lattice into three triangular sub-lattices with different polarization directions, see colour-coding of Fig. 5 (a). In our examples, the hexagonal lattice is\neither filled with ordinary Gaussian u0,0 -beams, Fig. 5 (b), or with single-helix beams Σ(C),\nsee Fig. 5 (c); one of which is displayed in Fig. 5 (d).\nIn case 5 (b), the lattice beam u0,0 (x, y, z) at the origin (black arrow) is removed, a very\nweak +y-polarized beam is superimposed to remove spill-over from the nearest neighbours\nand a single-helix beam Σ(x, y, z; 81 ) inserted at the origin. This construction demonstrates that\na single dark helix can be embedded into a bright uniform background. Alternatively, the entire\nlattice is formed from helical beams with equal strength, see Fig. 5 (c); where, on account of\nthe slightly wider lattice spacing, no spill-over compensation is applied.\n\n\fThe logarithmic intensity plots 5 (b) and (c) confirm that the background intensity is quite\nuniform (varies less than an order of magnitude) and yet allows for embedded dark spirals with\nexcellent intensity contrast: the helix cores are at least four orders of magnitude darker than the\nbackground.\n6.\n\nApplications, conclusions and outlook\n\nThe generation of bright and dark intensity helices from paraxial laser beams was studied. Such\nintensity helices of light may turn out to be applied in nanolithography of bulk media [29] to\ncreate sharply contoured helical imprints in potentially massively parallel fashion.\nIn section 4 the variation of the electric field magnitude in the immediate vicinity of intensity\nhelices was characterized. This variation scales linearly for dark and quadratically for bright\nhelices.\nThe very much sharper intensity contrasts this scaling implies for dark helices may turn out\nto be of considerable practical importance. The logarithmic intensity plots of Fig. 5 (b) and (c)\nshow that we can create sharp spikes of the intensity distribution of dark helices whereas this is\nimpossible for bright helices. This observation is relevant for lithographic applications because\nphotoresists tend to show logarithmic responses to the magnitude of the irradiating field [28].\nIn order to demonstrate the versatility of the approach presented here it was shown that single\ndark helices can be sparsely embedded in a uniform bright background but also tightly packed\ninto a dense hexagonal grid embedded in a uniform bright background.\nThe intensity helices' defined handedness might, for example, help with the production of\nchiral optical meta-materials [30, 31], possibly using longer wavelengths such as from THzradiation [32].\nFiltering of handed molecules, through a membrane with photo-lithographically etched helical holes or via handedness-sensitive trapping in solution, might become possible.\nFor the manipulation of ultra-cold gas clouds via the optical dipole force, dark (blue-detuned)\nand bright (red-detuned [14]) helical beams may turn out to be useful [26].\nThe fact that helices can be made to intertwine, see section 2, opens up the possibility of\nstudying intertwined transport. In the presence of gravity or other uniform force fields a helix\nthat is tilted away from vertical by more than its pitch angle can potentially serve as a microscopic Archimedean-screw transporter [16] or a helical ratchet-potential. Transport along helices\nis expected to show localization behaviour [33, 34] and other interesting quantum-transport\nphenomena [35].\nAcknowledgment\nI would like to thank Paul Kaye for proof-reading of this manuscript.\n\n\f"}