{"id": "http://arxiv.org/abs/0908.0281v2", "guidislink": true, "updated": "2009-10-02T08:11:33Z", "updated_parsed": [2009, 10, 2, 8, 11, 33, 4, 275, 0], "published": "2009-08-03T15:32:53Z", "published_parsed": [2009, 8, 3, 15, 32, 53, 0, 215, 0], "title": "Hybrid photonic-bandgap accelerating cavities", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0908.1238%2C0908.3387%2C0908.0964%2C0908.4146%2C0908.4342%2C0908.3580%2C0908.3506%2C0908.3134%2C0908.1334%2C0908.2179%2C0908.4329%2C0908.2979%2C0908.3364%2C0908.1064%2C0908.0675%2C0908.2650%2C0908.3421%2C0908.4261%2C0908.3035%2C0908.3667%2C0908.3675%2C0908.2741%2C0908.3290%2C0908.4000%2C0908.0945%2C0908.2868%2C0908.2351%2C0908.2273%2C0908.2476%2C0908.4574%2C0908.3392%2C0908.0118%2C0908.0856%2C0908.3674%2C0908.3719%2C0908.4006%2C0908.0670%2C0908.1125%2C0908.1248%2C0908.2953%2C0908.3686%2C0908.1262%2C0908.0522%2C0908.1765%2C0908.3378%2C0908.0972%2C0908.4405%2C0908.2760%2C0908.0281%2C0908.0643%2C0908.2800%2C0908.0597%2C0908.1573%2C0908.3383%2C0908.1414%2C0908.4107%2C0908.0350%2C0908.2528%2C0908.2817%2C0908.3868%2C0908.3792%2C0908.1090%2C0908.2703%2C0908.2332%2C0908.0138%2C0908.2167%2C0908.2025%2C0908.2404%2C0908.3870%2C0908.1032%2C0908.2466%2C0908.2324%2C0908.3291%2C0908.1333%2C0908.4075%2C0908.0380%2C0908.2322%2C0908.2255%2C0908.2638%2C0908.4565%2C0908.2342%2C0908.3859%2C0908.3736%2C0908.3619%2C0908.2750%2C0908.3040%2C0908.3989%2C0908.1775%2C0908.1626%2C0908.2566%2C0908.0286%2C0908.3854%2C0908.4433%2C0908.3296%2C0908.2870%2C0908.2350%2C0908.2729%2C0908.3399%2C0908.2270%2C0908.3538%2C0908.0244&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Hybrid photonic-bandgap accelerating cavities"}, "summary": "In a recent investigation, we studied two-dimensional point-defected photonic\nbandgap cavities composed of dielectric rods arranged according to various\nrepresentative periodic and aperiodic lattices, with special emphasis on\npossible applications to particle acceleration (along the longitudinal axis).\nIn this paper, we present a new study aimed at highlighting the possible\nadvantages of using hybrid structures based on the above dielectric\nconfigurations, but featuring metallic rods in the outermost regions, for the\ndesign of extremely-high quality factor, bandgap-based, accelerating\nresonators. In this framework, we consider diverse configurations, with\ndifferent (periodic and aperiodic) lattice geometries, sizes, and\ndielectric/metal fractions. Moreover, we also explore possible improvements\nattainable via the use of superconducting plates to confine the electromagnetic\nfield in the longitudinal direction. Results from our comparative studies,\nbased on numerical full-wave simulations backed by experimental validations (at\nroom and cryogenic temperatures) in the microwave region, identify the\ncandidate parametric configurations capable of yielding the highest quality\nfactor.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0908.1238%2C0908.3387%2C0908.0964%2C0908.4146%2C0908.4342%2C0908.3580%2C0908.3506%2C0908.3134%2C0908.1334%2C0908.2179%2C0908.4329%2C0908.2979%2C0908.3364%2C0908.1064%2C0908.0675%2C0908.2650%2C0908.3421%2C0908.4261%2C0908.3035%2C0908.3667%2C0908.3675%2C0908.2741%2C0908.3290%2C0908.4000%2C0908.0945%2C0908.2868%2C0908.2351%2C0908.2273%2C0908.2476%2C0908.4574%2C0908.3392%2C0908.0118%2C0908.0856%2C0908.3674%2C0908.3719%2C0908.4006%2C0908.0670%2C0908.1125%2C0908.1248%2C0908.2953%2C0908.3686%2C0908.1262%2C0908.0522%2C0908.1765%2C0908.3378%2C0908.0972%2C0908.4405%2C0908.2760%2C0908.0281%2C0908.0643%2C0908.2800%2C0908.0597%2C0908.1573%2C0908.3383%2C0908.1414%2C0908.4107%2C0908.0350%2C0908.2528%2C0908.2817%2C0908.3868%2C0908.3792%2C0908.1090%2C0908.2703%2C0908.2332%2C0908.0138%2C0908.2167%2C0908.2025%2C0908.2404%2C0908.3870%2C0908.1032%2C0908.2466%2C0908.2324%2C0908.3291%2C0908.1333%2C0908.4075%2C0908.0380%2C0908.2322%2C0908.2255%2C0908.2638%2C0908.4565%2C0908.2342%2C0908.3859%2C0908.3736%2C0908.3619%2C0908.2750%2C0908.3040%2C0908.3989%2C0908.1775%2C0908.1626%2C0908.2566%2C0908.0286%2C0908.3854%2C0908.4433%2C0908.3296%2C0908.2870%2C0908.2350%2C0908.2729%2C0908.3399%2C0908.2270%2C0908.3538%2C0908.0244&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "In a recent investigation, we studied two-dimensional point-defected photonic\nbandgap cavities composed of dielectric rods arranged according to various\nrepresentative periodic and aperiodic lattices, with special emphasis on\npossible applications to particle acceleration (along the longitudinal axis).\nIn this paper, we present a new study aimed at highlighting the possible\nadvantages of using hybrid structures based on the above dielectric\nconfigurations, but featuring metallic rods in the outermost regions, for the\ndesign of extremely-high quality factor, bandgap-based, accelerating\nresonators. In this framework, we consider diverse configurations, with\ndifferent (periodic and aperiodic) lattice geometries, sizes, and\ndielectric/metal fractions. Moreover, we also explore possible improvements\nattainable via the use of superconducting plates to confine the electromagnetic\nfield in the longitudinal direction. Results from our comparative studies,\nbased on numerical full-wave simulations backed by experimental validations (at\nroom and cryogenic temperatures) in the microwave region, identify the\ncandidate parametric configurations capable of yielding the highest quality\nfactor."}, "authors": ["E. Di Gennaro", "C. Zannini", "S. Savo", "A. Andreone", "M. R. Masullo", "G. Castaldi", "I. Gallina", "V. Galdi"], "author_detail": {"name": "V. Galdi"}, "author": "V. Galdi", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1088/1367-2630/11/11/113022", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0908.0281v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0908.0281v2", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "13 pages, 5 figures, 3 tables. One figure and one reference added;\n  minor changes in the text", "arxiv_primary_category": {"term": "physics.acc-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "physics.acc-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "physics.optics", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0908.0281v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0908.0281v2", "journal_reference": "New J.Phys.11:113022,2009", "doi": "10.1088/1367-2630/11/11/113022", "fulltext": "arXiv:0908.0281v2 [physics.acc-ph] 2 Oct 2009\n\nHybrid photonic-bandgap accelerating cavities\nE. Di Gennaro1 , C. Zannini2 , S. Savo2 , A. Andreone2 , M. R.\nMasullo3 , G. Castaldi4 , I. Gallina4 , and V. Galdi4\n1\n\nCNISM and Department of Physics, University of Naples \"Federico II,\" Naples,\nItaly\n2\nCNR-INFM \"Coherentia\" and Department of Physics, University of Naples\n\"Federico II,\" Naples, Italy\n3\nINFN – Naples Unit, Naples, Italy\n4\nWaves Group, Department of Engineering, University of Sannio, Benevento, Italy\nE-mail: masullo@na.infn.it\nAbstract. In a recent investigation, we studied two-dimensional point-defected\nphotonic bandgap cavities composed of dielectric rods arranged according to various\nrepresentative periodic and aperiodic lattices, with special emphasis on possible\napplications to particle acceleration (along the longitudinal axis). In this paper, we\npresent a new study aimed at highlighting the possible advantages of using hybrid\nstructures based on the above dielectric configurations, but featuring metallic rods\nin the outermost regions, for the design of extremely-high quality factor, bandgapbased, accelerating resonators. In this framework, we consider diverse configurations,\nwith different (periodic and aperiodic) lattice geometries, sizes, and dielectric/metal\nfractions. Moreover, we also explore possible improvements attainable via the use\nof superconducting plates to confine the electromagnetic field in the longitudinal\ndirection. Results from our comparative studies, based on numerical full-wave\nsimulations backed by experimental validations (at room and cryogenic temperatures)\nin the microwave region, identify the candidate parametric configurations capable of\nyielding the highest quality factor.\n\nPACS numbers: 42.70.Qs, 42.60.Da, 29.20.-c\n\nSubmitted to: New J. Phys.\n\n\fHybrid photonic-bandgap accelerating cavities\n\n2\n\n1. Introduction and background\nThe next-generation colliders (which require large-current and high-energy beams) and\nthe needs of medical and industrial applications of accelerators (which ask for compact\nand easy-to-fabricate structures) constitute a pressing demand for the development of\nresonators based on novel, unconventional concepts. Amongst a number of problems\nthat the design of new accelerators has to face, the most important is probably the\nsuppression of higher-order modes (HOMs) in the resonant accelerating cavities, which\nmay produce beam instabilities or power losses.\nDue to the energy transfer between the bunched beam, which is traveling through,\nand the cavity, the amplitude and the distribution of the electromagnetic (EM) field\ninside the cavity will be different from the case in the absence of particles. The harmonic\ncontent of the bunched beam is the driving source of this transfer. Moreover, the use\nof high-intensity beams, generally associated with short bunches, implies an increase of\nthe higher-order harmonics. The energy transfer between the beam and the cavity will\nbe effective only if the high-order harmonics are synchronous with the cavity modes.\nIn this case, a fraction of the excited EM field will remain in the resonant cavity until\nit is naturally damped. Such phenomenon, called \"beam loading\" of the accelerating\ncavity, gives rise to both transverse and longitudinal coupled-bunch instabilities, and\nincreases linearly with the beam intensity. As a consequence, the particle current is\nseverely limited if the instability growth rate is larger than the natural damping. The\nfundamental mode can be compensated by varying the amplitude and phase of the\nfeeding voltage, but the detrimental HOMs need to be detuned. Possible solutions to\nthis problem (at no expense to the accelerator performance) are based on connecting to\nthe cavity a number of waveguides with various cut-off frequencies. Such HOM-removal\nmechanism works very well at relatively low operational frequencies, but becomes rather\ncumbersome as the frequency increases.\nWithin this context, it is presently a real challenge to design and build a compact,\nHOM-free, accelerating structure, able at the same time to efficiently couple the EM\nfield to the particle beam.\nPeriodic photonic crystals (PCs) have been proposed in the past as candidates\nfor accelerating cells in microwave or laser-driven particle accelerators [1]. The key\nconcept underlying these structures is the presence of a photonic bandgap (PBG),\ntypical of dispersive media, which prevents, within a specific frequency band, the EM\npropagation along the periodicity directions of the PC. In such structures, a PBG\ncavity (or waveguide) can be realized by introducing one or more localized lattice\ndefects, thereby producing \"field trapping\" nearby the defect zone within the forbidden\nfrequency window. This mechanism therefore allows to design a frequency-selective\nstructure for the EM propagation, acting, e.g., as a perfectly \"reflecting wall\" at a\ncertain frequency, while exhibiting a transparent response in the remaining part of\nthe spectrum. By adequately shaping the geometry around the defect, the trapped\nmode can be optimized so as to work as the operating accelerating mode. Metallic\n\n\fHybrid photonic-bandgap accelerating cavities\n\n3\n\nPC structures have already been used to realize a new kind of large-gradient accelerator\nwith an effective suppression of HOM wakefields [2]. Prototypes of fully-metallic (superand normal-conducting) mono-modal PC cavities have been constructed and tested at\ndifferent working frequencies [3].\nPrevious (numerical and experimental) studies have also demonstrated that alldielectric structures can be used to confine the desired excited mode, eliminating or\nreducing the characteristic metallic losses at the frequency of operation. Dielectric\nmaterials may also be beneficial in order to cope with radio-frequency (RF) breakdown\nphenomena that may easily occur in structures where large accelerating field gradients\nneed to be achieved.\nMoreover, the existence of PBG and related phenomena is not restricted to\nperiodic crystals. In fact, a large body of numerical and experimental studies have\ndemonstrated the possibility of obtaining similar effects also in aperiodically-ordered\nstructures, typically referred to as \"photonic quasicrystals\" (PQCs) (see, e.g., [4, 5, 6]\nfor recent reviews of the subject). PQC structures are receiving a growing attention\nin a variety of fields and application scenarios (see, e.g., [7]), mainly driven by the\nhigher level of (weak) symmetry achievable and the extra degrees of freedom available,\nas compared to their periodic counterparts. In particular, experimental studies on PQCbased optical microcavities have demonstrated the possibility of obtaining high quality\nfactors and small modal volumes [8], thereby providing further degrees of freedom in\ntailoring the mode confinement. In this framework, it is also worth mentioning possible\nalternative strategies based on brute-force numerical optimization of the spatial lattice\ngeometry [9]. For the case of dielectric structures, by comparison with a periodic lattice\nexhibiting comparable performance, this strategy may allow a considerable saving in\nthe number of rods, although it is not entirely clear how this sparsification translates\ninto a reduction of the overall structure size.\nIn a recent investigation [10], we explored the possible application of 2-D pointdefected PQC cavities composed of dielectric rods arranged according to various\nrepresentative aperiodic (Penrose and dodecagonal) geometries, and terminated by two\nmetallic plates in order to confine the field along the longitudinal direction. More\nspecifically, we carried out a parametric study of the confinement properties as a function\nof the structure size, filling fraction, and losses, so as to identify the best performing\nconfigurations, and we compared them with a reference periodic counterpart. Although\nthe results were very encouraging, we found that the major limitation in the development\nof compact, intrinsically mono-modal (and hence HOM-free), high-quality-factor cavities\narises from the conduction losses due to the metallic plates, irrespective of the geometry\nconsidered. A possible device to overcome this limitation amounts to replacing copper\nwith a superconducting material, thereby rendering the in-plane radiation the dominant\nloss mechanism. In this framework, a systematic study needs to be pursued in order\nto assess to what extent the actual improvements in the cavity performance might\njustify the higher complexity introduced by the necessity of operating at cryogenic\ntemperatures.\n\n\fHybrid photonic-bandgap accelerating cavities\n\n4\n\nThis paper, following up on our previous work, is aimed at highlighting the\npossible advantages of using metallic rods in the outermost regions of (periodic and\naperiodic) dielectric structures, for the design and fabrication of PBG-based hybrid\n(normal metallo-dielectric and superconducting metallo-dielectric) high-quality-factor\naccelerating resonators. The basic underlying idea is to find out a suitable tradeoff between dielectric and metal content, so as to improve the in-plane confinement\nwithout significantly increasing the conduction losses. To this aim, we compare different\nconfigurations of these hybrid structures, with diverse sizes, lattice geometries, and\ndielectric/metal fractions.\nAccordingly, the rest of the paper is laid out as follows. In Sec. 2, we present the\nresults of our numerical full-wave studies, first on dielectric-rod structures (focusing on\nthe effects of the metallic plates), and subsequently on hybrid structures consisting of\ndielectric and metallic rods. In Sec. 3, we validate the above results via experimental\nmeasurements at room and cryogenic temperatures. Finally, in Sec. 4, we provide some\nconcluding remarks and hints for future research.\n2. Numerical studies\nOur numerical full-wave studies of the EM response of the structures of interest are\nbased on the combined use of the 3-D commercial software CST Microwave Studio [11]\n(for modeling volumetric and surface losses) and an in-house 2-D simulator based on the\nfinite-difference-time-domain (FDTD) technique [12] (for modeling the radiative losses\nnot accounted for in the 3-D simulator).\n2.1. Dielectric PBG cavities\nThe dielectric structures of interest are composed of sapphire cylindrical rods of radius r\nand relative dielectric permittivity 9.2, with typical loss-tangent values ranging between\n10−6 and 10−8 , depending on the temperature of operation. As in [10], the rods are\narranged according to two representative PQC geometries, based on the dodecagonal\n(12fold-symmetric [13], Figure 1(b)) and Penrose (10fold-symmetric [14], Figure 1(c))\ntilings, respectively, and a reference periodic (triangular) PC structure (Figure 1(a)).\nThe removal of the central rod creates the defect region and allows for the beam transit\naperture. The mode of interest for the particle acceleration along the longitudinal\ndirection is the T M010 − like (fundamental mode), with the electric field parallel to the\nrods.\nAll configurations are characterized by a lattice constant (corresponding to the\nperiod in the triangular case, or to the tile sidelength in the aperiodic cases, cf. Figure 1)\nchosen as a = 0.75 cm, so as to yield comparable values of the fundamental mode\nresonant frequency (around 16.5 GHz). The rods height is h = 0.6 cm. Different\ntransverse sizes are considered, by varying the radius R as an integer multiple of the\n\n\fHybrid photonic-bandgap accelerating cavities\n\n5\n\nFigure 1. Point-defected PBG mono-modal cavities, with periodic triangular (a), and\naperiodic dodecagonal (b) and Penrose (c) lattice geometries.\n\nlattice constant a (see Figure 1). As a figure of merit, we use the standard quality factor,\nω0 E\n,\n(1)\nP\nwhere ω0 is the resonant radian frequency, E is the EM energy stored in the cavity,\nand P is the average power loss. In our simulations, the resonant frequency and the\nquality factors pertaining to volumetric and surface losses are computed via standard\npost-processing routines available in the CST Microwave Studio eigen-solver [11]. The\nradiative quality factor is instead computed from the 2-D FTDT analysis (with all\ndielectric and metallic elements assumed as lossless), by processing the time-signal\nevolution via a harmonic inversion tool [15] based on a low-storage \"filter diagonalization\nmethod.\" The overall quality factor QT can then be obtained by combining the\nconducting (QC ), dielectric (QD ), and radiative (QR ) quality factors via\n1\n1\n1\n1\n=\n+\n+\n.\n(2)\nQT\nQC\nQR QD\nNote that, within the parametric ranges of interest, the dielectric quality factor QD\nis much higher than the other two factors, and its contribution in (2) is accordingly\nnegligible.\nAs shown in [10], and compactly summarized in Table 1, for a moderate cavity size\n(R ≤ 5a) and a filling factor r/a = 0.2, a judicious choice of a PQC geometry turns out\nto provide sensible improvement in the field confinement as compared with the periodic\nreference configuration.\nIn dielectric-rod cavities, as expectable, the conducting quality factor QC is almost\nthe same for all configurations and cavity sizes, since it depends mainly on the surface\nconductivity of the metallic plates.\nConversely, the radiative quality factor QR strongly depends on the geometry and\nsize of each structure. The field confinement in these cavities is weaker than that\nachievable via fully-metallic structures, and represents the main factor affecting the\ncavity performance when very compact (R = 3a) structures are needed.\nFor R = 5a, instead, QR improves from 4.08 × 104 (triangular) to 1.47 × 105\n(dodecagonal). For this size, the total quality factor QT of dielectric (periodic or\naperiodic) structures is much higher than those obtained in the case of fully-metallic\nperiodic PBG cavities (∼ 4×103 at room temperature) of comparable resonant frequency\nQ=\n\n\fHybrid photonic-bandgap accelerating cavities\n\n6\n\nTable 1. Simulation results for the selected lattice geometries, assuming cavity sizes\nR = 3a, 4a, 5a and filling factor r/a = 0.2. QC , QR , and QT are the conducting,\nradiative, and total quality factors, respectively. The last column indicates the weight\nof the conduction losses in the total quality factor.\nR = 3a\nTriangular\nDodecagonal\nPenrose\n\n(1 −\n\nQT\nQR )\n\nQC\n\nQR\n\nQT\n\n1.05 × 104\n1.07 × 104\n1.06 × 104\n\n7.74 × 102\n1.87 × 103\n4.37 × 102\n\n7.20 × 102\n1.65 × 103\n4.23 × 102\n\n0.05\n0.09\n0.02\n\n1.19 × 104\n1.18 × 104\n1.14 × 104\n\n5.70 × 103\n1.72 × 104\n5.00 × 103\n\n3.80 × 103\n7.00 × 103\n3.48 × 103\n\n0.32\n0.59\n0.30\n\n1.19 × 104\n1.19 × 104\n1.22 × 104\n\n4.08 × 104\n9.30 × 104\n1.47 × 105\n\n9.20 × 103\n1.05 × 104\n1.13 × 104\n\n0.77\n0.89\n0.92\n\nR = 4a\nTriangular\nDodecagonal\nPenrose\nR = 5a\nTriangular\nDodecagonal\nPenrose\n\n[16]. This is mainly due to the reduction of conduction losses resulting from the use of\ndielectric (instead of metallic) rods.\nIn such a case, therefore, the primary source of dissipation is given by the surface\nlosses of the metallic plates. The replacement of copper with a superconducting material\nappears the way to go, even if the required low-temperature operation implies an\nincreased complexity. Nevertheless, in order to achieve the performance required for\naccelerating cavities, one still needs to reduce the radiation leaks, which would otherwise\nlimit the total quality factor.\n2.2. Hybrid PBG cavities\nIn order to reduce the radiative losses, without sacrificing the performance improvement\nattainable via superconducting technologies, one may think of replacing some dielectric\nrods (intuitively, those located in the outermost regions, where the field is weaker), with\nmetallic ones, thereby obtaining a \"hybrid\" metallo-dielectric PBG cavity. We present\nhere the results pertaining to hybrid structures of size R = 5a, based on the above\nselected lattice geometries (triangular, dodecagonal, Penrose).\nTable 2 compares the FDTD-simulated radiative quality factors pertaining to the\ndielectric-rod reference case with those pertaining to hybrid PBG cavities featuring one\nor two peripheral \"rings\" made of metallic (copper) rods. Here, and henceforth, the\nhybrid structures are labeled as D + M, with D and M denoting the number of rings\nmade of dielectric and metallic rods, respectively. Note that, in the aperiodic cases,\nthe \"rings\" are not regularly shaped, and their definition may be ambiguous. In our\nsimulations, they were defined via radial inequalities (e.g., for a total cavity size of\n\n\fHybrid photonic-bandgap accelerating cavities\n\n7\n\nR = 5a, the outermost ring is defined as exterior to the radial domain R′ = 4a, and so\non); this ensures the inclusion of a comparable number of metallic rods for the different\nlattice geometries.\nTable 2. Simulated radiative quality factors QR for hybrid PBG cavities of total size\nR = 5a (with r/a = 0.2), featuring zero (i.e., fully-dielectric), one, and two peripheral\nrings of metallic (copper) rods.\nDielectric+Metallic\n\nTriangular\n\nDodecagonal\n\nPenrose\n\n5+0\n4+1\n3+2\n\n4.08 × 104\n1.78 × 106\n2.50 × 108\n\n9.30 × 104\n7.44 × 106\n5.85 × 107\n\n1.47 × 105\n2.51 × 106\n3.93 × 108\n\nOne readily observes that the inclusion of metallic rods dramatically improves the\nconfinement properties of the PBG cavities. In particular, in the periodic case, there\nis a two-order-of-magnitude step increase in the radiative quality factor, which brings\nits value to over 108 (very close to what predicted for the Penrose geometry) when two\nperipheral copper rings are included. The dodecagonal geometry, which exhibits the\nbest performance in the 4+1 configuration, is outperformed by the other geometries in\nthe 3+2 configuration.\nThe field-confinement improvements are also evident in the corresponding\n(transverse) electric-field maps shown in Figure 2.\nSpecifically, Figs. 2(a), 2(d), and 2(g) show the results pertaining to the dielectricrod cavities (5+0 configuration). The field maximum intensity (centered at the defect\nposition) is almost the same in the three different cases, but the spatial distribution\nevidences the better confinement properties of the Penrose geometry, as confirmed by\nthe data reported in Table 1. The improvement in the radiative quality factor of the\nhybrid cavities is already sensible when the first (outermost) peripheral metallic ring is\nincluded (see Figs. 2(b), 2(e), and 2(h)), and becomes striking in the 3+2 configuration\n(see Figs. 2(c), 2(f), and 2(i)). This is in agreement with the trend shown in Table 2.\nMore difficult, however, is to discern from the plots the different performance in terms of\nQR values exhibited by the three geometries for each hybrid (4+1 or 3+2) configuration.\nFigure 3 shows the simulated total quality factors pertaining the three lattice\ngeometries, as a function of the temperature T and of the number of metallic rings.\nDirect-current conductivity is assumed to vary (with the temperature) according to the\ndata reported in [17] for high-purity electropolished copper. As a reference, the behavior\nof a fully-metallic periodic structure is also displayed.\nLooking at these behaviors, the advantage of using a dielectric-rod structure\n(empty markers) instead of a fully-metallic one (solid line) is fairly clear. Similarly,\nhybrid structures with one (semi-empty markers) or two (full markers) metallic rings\noutperform (the more the lower the temperature) the fully-dielectric ones. It is also\nevident that the inclusion of metallic rings progressively brings the radiation losses to\na negligible level; in this regime, the dominant source of dissipation comes from the\n\n\fHybrid photonic-bandgap accelerating cavities\n\n(a)\n\n8\n\n(b)\n\n(c)\n\n0\n−10\n−20\n\n(d)\n\n(e)\n\n(f)\n\n−30\n−40\n−50\n\n(g)\n\n(h)\n\n(i)\n−60\n−70\n−80\n\nFigure 2. Simulated electric-field intensity maps (in dB) for the hybrid PBG cavities\nof size R = 5a (with r/a = 0.2), featuring zero, one or two peripheral \"rings\" of copper\nrods (displayed as black empty circles), and different lattice geometries: triangular\n((a), (b), (c)), dodecagonal ((d), (e), (f)), Penrose ((g), (h), (i)).\n\nmetallic plates, and the responses (as a function of the temperature) of the different\ngeometries tend to become identical. A possible solution might be the replacement of\ncopper with a high-temperature superconductor (HTS), to cover the inner surface of\nthe confinement plates. Setting the operational temperature at about 30 K, this would\ndetermine a three-order-of-magnitude reduction of the surface losses, and therefore a\ncorresponding increase of the related conduction quality factor. It is important to stress\nthat use of HTS peripheral rod rings would only add further complexity to the structure\n(because of the necessity of efficiently cooling down them too), without any significant\nimprovement in the overall quality factor.\nIt therefore appears that a judicious combination of i) superconducting plates, ii)\nlow-loss dielectric rods (in the interior region), and iii) metallic rods (in the outermost\nregion) may open up new perspectives in the development of novel monomodal, PBG\nbased, high-quality-factor open cavity for the acceleration of energetic particle beams at\nvery high operational frequencies. The use of peripheral metallic rings certainly improves\nthe confinement properties of the PBG resonators, while maintaining the advantages\nforeseen for dielectric cavities (reduction of breakdown phenomena, moderate fabrication\n\n\fHybrid photonic-bandgap accelerating cavities\n\n9\n\n35000\n\ntriangular 5+0\ndodecagonal 5+0\n\n30000\n\nPenrose 5+0\n\nQuality Factor\n\ntriangular 4+1\ndodecagonal 4+1\n\n25000\n\nPenrose 4+1\ntriangular 3+2\n\n20000\n\ndodecagonal 3+2\nPenrose 3+2\ntriangular 0+5\n\n15000\n10000\n5000\n0\n\n50\n\n100\n\n150\n\n200\n\n250\n\n300\n\nTemperature [K]\n\nFigure 3. Simulated temperature dependence of the total quality factor for triangular,\ndodecagonal and Penrose PBG hybrid cavities of size R = 5a (with r/a = 0.2), and\nfeaturing zero, one or two copper rings, compared with the behavior expected for a\nfully metallic triangular cavity (solid curve).\n\ncomplexity, etc.). Figure 4 displays the total quality factor QLP of a hybrid PBG cavity\nof size R = 5a as a function of the number of metallic rings for the geometries of\ninterest, at a temperature of operation of 30 K, assuming lossless plates and a dielectric\nloss-tangent of 10−8 (which is a reasonable value for single-crystal sapphire at low\ntemperatures), so as to better highlight the role of the copper rods.\n\ntriangular\ndodecagonal\nPenrose\n\n7\n\n10\n\n6\n\nQLP\n\n10\n\n5\n\n10\n\n4\n\n10\n\n0\n\n1\n\n2\n\n3\n\n4\n\n5\n\nnumber of metallic-rod rings\nFigure 4. Estimated total quality factor QLP as a function of the number of metallic\n(copper) rod rings for triangular, dodecagonal, and Penrose PBG hybrid structures of\nsize R = 5a (with r/a = 0.2) at a temperature of 30 K, assuming lossless plates and\ndielectric loss-tangent of 10−8 . Dotted curves are guide-to-eye only.\n\n\fHybrid photonic-bandgap accelerating cavities\n\n10\n\nAs can be observed, QLP first increases (reaching its maximum for the 3+2\nconfiguration), and then it starts decreasing (reaching its minimum for the fully-metallic\n0+5 configuration). As expected, increasing the number of metallic rings levels the\nperformance of the hybrid cavities, irrespective of the different spatial arrangements\nof the rods. Another interesting feature observable in Figure 4 is that the Penrose\ngeometry, in spite of its higher radiative quality factor, is largely outperformed by the\nother two geometries in the 3+2 configuration. This is attributable to the slight (∼10%)\nlarger number of copper rods in outermost metallic rings (as compared to the triangular\nand dodecagonal cases), with a detrimental effect on the level of conduction losses for\nthis geometry.\n3. Experimental results\nIn order to validate the above findings and explore their technological viability, we\nfabricated some prototypes of the simulated structures, by suitably placing the dielectric\n(single-crystal sapphire) and metallic (oxygen-free high-conductivity copper) rods (of\nradius r = 0.15 cm and height h = 0.6 cm) between two copper plates, inserted in a\ncryogenic box. The whole system is then cooled down to about 100 K by introducing\nliquid nitrogen. The operation temperature is monitored using a Si-diode sensor placed\non one of the copper plates. Both the feed and pick-up antennas are placed on the top\nplate, far enough from the central region where the EM field reaches its maximum to\nensure that all measurements are performed in the weak coupling limit. The resonant\ncavity is then connected to a HP8720C network analyzer and the quality factors\nat room and cryogenic temperatures are evaluated by the standard −3 dB method,\nlooking at the frequency transmission curve at the resonance. For the experimental\ncharacterization, we considered hybrid cavities with the three different geometries and\nR = 5a, having a single peripheral metallic ring (4+1 configuration). As a representative\nexample, Figure 5 shows the measured transmission parameter |S12 | pertaining to the\nPenrose geometry, from which the monomodality of the cavity within the whole bandgap\nfrequency region (12.5–18 GHz) is fairly evident.\nIn Table 3, the experimental quality factors are reported at 300 K and 100 K, and\ncompared with the results obtained from the numerical simulations. Note that, unlike\nin [17], the surface of the copper used in our experiments was not chemically treated\nor polished (to remove impurities, oxide layers, etc.). This was accordingly taken into\naccount in the numerical simulations by slightly (10 %) increasing the value of the\ncopper surface impedance with respect to the data reported in [17].\nThere is a very nice agreement between measurements and simulations, confirming\nthe validity of our initial assumptions. The data show that losses, at both room and\ncryogenic temperatures, are essentially dominated by the conductive contribution due to\nthe metallic plates, and consequently determine an upper limit for the total quality factor\nof the order of 104 , irrespective of the geometrical configurations, as already evidenced\nin Figure 3. One can accordingly conjecture that the insertion of superconducting\n\n\fHybrid photonic-bandgap accelerating cavities\n\n11\n\n-60\n\n-80\n\n|S\n\n12\n\n| [dB]\n\n-70\n\n-90\n\n-100\n\n-110\n13\n\n14\n\n15\n\n16\n\n17\n\n18\n\nFrequency [GHz]\n\nFigure 5. Transmission parameter |S12 | measured as a function of the frequency for a\nPenrose (4+1) point-defect cavity. In the frequency region between the dashed-dotted\nvertical line, the frequency sampling has been increased in order to capture the sharp\nresonant peak.\nTable 3. Measured total quality factor at room (300 K) and cryogenic (100 K)\ntemperatures for triangular, dodecagonal and Penrose PBG hybrid cavities with\nR = 5a and a single peripheral metallic ring (i.e., 4+1 configuration).\nGeometry\nTriangular\nDodecagonal\nPenrose\n\nQ100K\nexp\n\nQ100K\nsim\n\nQ300K\nexp\n\nQ300K\nsim\n\n1.84 × 104\n1.95 × 104\n2.00 × 104\n\n1.90 × 104\n1.94 × 104\n1.96 × 104\n\n1.14 × 104\n1.12 × 104\n1.05 × 104\n\n1.05 × 104\n1.07 × 104\n1.07 × 104\n\nplates, with the corresponding reduction of conduction losses of three or more orders\nof magnitude, would have already for this configuration a tremendous impact on the\nquality factor (and hence on the overall performance) of an accelerating cavity operating\nat such high frequencies. Another interesting conclusion that can be drawn is that the\nuse of conventional low critical temperature materials like niobium, very common in the\ndevelopment of superconducting accelerating cavities, in this case is unnecessary, since\nthe overall quality factor of hybrid cavities of such compact size would be inherently\nlimited (by radiation losses) to values on the order of 107 (see Figure 4). HTS materials\nmay be used instead, with an obvious simplification of the related cryogenic technology,\nand corresponding cost reduction.\n4. Conclusions\nIn this paper, we have explored hybrid configurations of point-defected PBG cavities,\nshowing that a clever blend of superconducting materials, low-loss dielectrics, and\n\n\fHybrid photonic-bandgap accelerating cavities\n\n12\n\nhighly conducting metals may pave the way to the development of novel monomodal,\ncompact, high-performance, accelerating cavities. Via a systematic study of geometrical\nconfigurations, size, and dielectric/metal fractions, we showed that suitably dimensioned\nhybrid open structures may attain high in-plane EM radiation confinement, without\nsignificant increase in the conduction losses. The exploitation of superconducting\nmaterials (in the terminating plates) would render the fabrication of this new type of\nresonators extremely rewarding, even if at the expense of a higher operational complexity\nintroduced by the cryogenic technology. Our preliminary experimental results at 100\nK show that this route is technologically viable, especially for the development of very\ncompact, hybrid, PBG cavities based on HTS materials.\nAcknowledgments\nThis work was supported in part by the Campania Regional Government via a 2006\ngrant (L.R. N. 5 - 28.03.2002) on \"Electromagnetic-bandgap quasicrystals: Study,\ncharacterization, and applications in the microwave region.\" Stimulating discussions\nwith Prof. V. G. Vaccaro (University of Naples \"Federico II\"), as well as the technical\nsupport of F. M. Taurino and S. Marrazzo, are gratefully acknowledged.\nReferences\n[1] B. Cowan, M. Javanmard, and R. Siemann. Photonic crystal laser accelerator structures. In Proc.\nParticle Accelerator Conference, volume 3, pages 1855–1857, Portland, OR, USA, 2003.\n[2] E. I. Smirnova, A. S. Kesar, I. Mastovsky, M. A. Shapiro, and R. J. Temkin. Demonstration\nof a 17-GHz, high-gradient accelerator with a photonic-band-gap structure. Phys. Rev. Lett.,\n95(7):074801, 2005.\n[3] M. Masullo, A. Andreone, E. Di Gennaro, F. Francomacaro, G. Lamura, V. Palmieri, D. Tonini,\nM. Panniello, and V. Vaccaro. PBG superconducting resonant structures. In Proc. European\nParticle Accelerator Conf., pages 454–456, Edinburgh, Scotland, 2006.\n[4] W. Steurer and D. Sutter-Widmer. Photonic and phononic quasicrystals. J. Phys. D, 40(13):R229–\nR247, 2007.\n[5] A. Della Villa, V. Galdi, S. Enoch, G. Tayeb, and F. Capolino. Photonic quasicrystals: Basics\nand examples. In F. Capolino, editor, Metamaterials Handbook, vol. I, chapter 27. CRC Press,\nBoca Raton, FL, USA, 2009.\n[6] D. N. Chigrin and A. V. Lavrinenko. Photonic applications of two-dimensional quasicrystals. In\nF. Capolino, editor, Metamaterials Handbook, vol. II, chapter 28. CRC Press, Boca Raton, FL,\nUSA, 2009.\n[7] E. Maciá. The role of aperiodic order in science and technology. Rep. Progr. Phys., 69(2):397–441,\n2006.\n[8] K. Nozaki and T. Baba. Quasiperiodic photonic crystal microcavity lasers. Appl. Phys. Lett.,\n84(24):4875–4877, 2004.\n[9] C. A Bauer, G. R. Werner, and J. R. Cary. Truncated photonic crystal cavities with optimized\nmode confinement. J. Appl. Phys., 104:053107, 2008.\n[10] E. Di Gennaro, S. Savo, A. Andreone, V. Galdi, G. Castaldi, V. Pierro, and M. R. Masullo. Mode\nconfinement in photonic quasicrystal point-defect cavities for particle accelerators. Appl. Phys.\nLett., 93(16):164102, 2008.\n\n\fHybrid photonic-bandgap accelerating cavities\n\n13\n\n[11] CST Microwave Studio. CST – Computer Simulation Technology, Wellesley Hills, MA, USA,\n2008.\n[12] A. Taflove and S. C. Hagness. Computational Electrodynamics: The Finite-Difference TimeDomain Method, Third Edition. Artech House, Norwood, MA, USA, 2005.\n[13] M. Oxborrow and C. L. Henley. Random square-triangle tilings: A model for twelvefold-symmetric\nquasicrystals. Phys. Rev. B, 48(10):6966–6998, 1993.\n[14] M. Senechal. Quasicrystals and Geometry. Cambridge University Press, Cambridge, UK, 1995.\n[15] Harminv. http://ab-initio.mit.edu/harminv.\n[16] M. R. Masullo, A. Andreone, E. Di Gennaro, F. Francomacaro, G. Lamura, V.G. Vaccaro,\nG. Keppel, V. Palmieri, and D. Tonini. A study on a mono-modal accelerating cavity based on\nphotonic band gap concepts. In Proc. Int. Workshop on Physics at a multi-MW proton source,\npages 15–19, Firenze, Italy, 2004.\n[17] S. Inagaki, E. Ezura, J.F. Liu, and H. Nakanishi. Thermal expansion and microwave surface\nreactance of copper from the normal to anomalous skin effect region. J. Appl. Phys.,\n82(11):5401–5410, 1997.\n\n\f"}