{"id": "http://arxiv.org/abs/0907.0678v1", "guidislink": true, "updated": "2009-07-03T17:11:28Z", "updated_parsed": [2009, 7, 3, 17, 11, 28, 4, 184, 0], "published": "2009-07-03T17:11:28Z", "published_parsed": [2009, 7, 3, 17, 11, 28, 4, 184, 0], "title": "Design and Analysis of an Attack Resilient and Adaptive Medium access\n  Control Protocol for Computer Networks", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0907.2074%2C0907.4183%2C0907.5350%2C0907.4366%2C0907.3084%2C0907.3983%2C0907.0678%2C0907.3038%2C0907.4672%2C0907.2768%2C0907.1240%2C0907.0709%2C0907.5075%2C0907.0376%2C0907.1078%2C0907.2087%2C0907.1088%2C0907.1069%2C0907.4275%2C0907.3864%2C0907.2705%2C0907.0551%2C0907.0953%2C0907.4557%2C0907.2710%2C0907.5070%2C0907.5326%2C0907.1323%2C0907.5184%2C0907.4107%2C0907.1861%2C0907.2563%2C0907.0745%2C0907.0483%2C0907.3069%2C0907.3119%2C0907.2219%2C0907.3226%2C0907.3622%2C0907.2137%2C0907.0699%2C0907.4062%2C0907.0513%2C0907.4141%2C0907.1808%2C0907.1981%2C0907.5465%2C0907.0802%2C0907.5296%2C0907.2692%2C0907.0758%2C0907.4050%2C0907.5489%2C0907.4772%2C0907.3762%2C0907.3954%2C0907.4607%2C0907.4954%2C0907.0049%2C0907.0521%2C0907.2593%2C0907.2386%2C0907.0390%2C0907.1992%2C0907.1067%2C0907.0602%2C0907.1793%2C0907.2412%2C0907.1234%2C0907.1782%2C0907.4739%2C0907.2390%2C0907.3827%2C0907.1353%2C0907.0130%2C0907.0420%2C0907.1826%2C0907.1058%2C0907.2196%2C0907.0697%2C0907.1784%2C0907.3161%2C0907.1896%2C0907.4120%2C0907.4243%2C0907.0628%2C0907.1444%2C0907.2097%2C0907.4969%2C0907.3125%2C0907.0853%2C0907.1755%2C0907.1964%2C0907.1450%2C0907.2945%2C0907.0669%2C0907.0360%2C0907.1382%2C0907.5147%2C0907.4406%2C0907.2693&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Design and Analysis of an Attack Resilient and Adaptive Medium access\n  Control Protocol for Computer Networks"}, "summary": "The challenge of designing an efficient Medium Access Control (MAC) protocol\nand analyzing it has been an important research topic for over 30 years. This\npaper focuses on the performance analysis (through simulation) and modification\nof a well known MAC protocol CSMA/CD. The existing protocol does not consider\nthe wastage of bandwidth due to unutilized periods of the channel. By\nconsidering this fact, performance of MAC protocol can be enhanced. The purpose\nof this work is to modify the existing protocol by enabling it to adapt\naccording to state of the network. The modified protocol takes appropriate\naction whenever unutilized periods detected. In this way, to increase the\neffective bandwidth utilization and determine how it behaves under increasing\nload, and varying packet sizes. It will also include effects of attacks i.e.\nDenial of service attacks, Replay Attack, Continuous Channel Access or\nExhaustion attack, Flooding attack, Jamming (Radio interference) attack,\nSelective forwarding attack which degrade performance of MAC protocol. In\nContinuous Channel Access or Exhaustion attack, a malicious node disrupts the\nMAC protocol, by continuously requesting or transmitting over the channel. This\neventually leads a starvation for other nodes in the network w.r.t channel\naccess. remedy may be the network ignores excessive requests without sending\nexpensive radio transmissions. This limit however cannot drop below the\nexpected maximum data rate the network has to support. This limit is usually\ncoded into the protocol during the design phase and requires additional logic\nalso. Repeated application of these exhaustion or collision based MAC layer\nattacks can lead into unfairness.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0907.2074%2C0907.4183%2C0907.5350%2C0907.4366%2C0907.3084%2C0907.3983%2C0907.0678%2C0907.3038%2C0907.4672%2C0907.2768%2C0907.1240%2C0907.0709%2C0907.5075%2C0907.0376%2C0907.1078%2C0907.2087%2C0907.1088%2C0907.1069%2C0907.4275%2C0907.3864%2C0907.2705%2C0907.0551%2C0907.0953%2C0907.4557%2C0907.2710%2C0907.5070%2C0907.5326%2C0907.1323%2C0907.5184%2C0907.4107%2C0907.1861%2C0907.2563%2C0907.0745%2C0907.0483%2C0907.3069%2C0907.3119%2C0907.2219%2C0907.3226%2C0907.3622%2C0907.2137%2C0907.0699%2C0907.4062%2C0907.0513%2C0907.4141%2C0907.1808%2C0907.1981%2C0907.5465%2C0907.0802%2C0907.5296%2C0907.2692%2C0907.0758%2C0907.4050%2C0907.5489%2C0907.4772%2C0907.3762%2C0907.3954%2C0907.4607%2C0907.4954%2C0907.0049%2C0907.0521%2C0907.2593%2C0907.2386%2C0907.0390%2C0907.1992%2C0907.1067%2C0907.0602%2C0907.1793%2C0907.2412%2C0907.1234%2C0907.1782%2C0907.4739%2C0907.2390%2C0907.3827%2C0907.1353%2C0907.0130%2C0907.0420%2C0907.1826%2C0907.1058%2C0907.2196%2C0907.0697%2C0907.1784%2C0907.3161%2C0907.1896%2C0907.4120%2C0907.4243%2C0907.0628%2C0907.1444%2C0907.2097%2C0907.4969%2C0907.3125%2C0907.0853%2C0907.1755%2C0907.1964%2C0907.1450%2C0907.2945%2C0907.0669%2C0907.0360%2C0907.1382%2C0907.5147%2C0907.4406%2C0907.2693&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The challenge of designing an efficient Medium Access Control (MAC) protocol\nand analyzing it has been an important research topic for over 30 years. This\npaper focuses on the performance analysis (through simulation) and modification\nof a well known MAC protocol CSMA/CD. The existing protocol does not consider\nthe wastage of bandwidth due to unutilized periods of the channel. By\nconsidering this fact, performance of MAC protocol can be enhanced. The purpose\nof this work is to modify the existing protocol by enabling it to adapt\naccording to state of the network. The modified protocol takes appropriate\naction whenever unutilized periods detected. In this way, to increase the\neffective bandwidth utilization and determine how it behaves under increasing\nload, and varying packet sizes. It will also include effects of attacks i.e.\nDenial of service attacks, Replay Attack, Continuous Channel Access or\nExhaustion attack, Flooding attack, Jamming (Radio interference) attack,\nSelective forwarding attack which degrade performance of MAC protocol. In\nContinuous Channel Access or Exhaustion attack, a malicious node disrupts the\nMAC protocol, by continuously requesting or transmitting over the channel. This\neventually leads a starvation for other nodes in the network w.r.t channel\naccess. remedy may be the network ignores excessive requests without sending\nexpensive radio transmissions. This limit however cannot drop below the\nexpected maximum data rate the network has to support. This limit is usually\ncoded into the protocol during the design phase and requires additional logic\nalso. Repeated application of these exhaustion or collision based MAC layer\nattacks can lead into unfairness."}, "authors": ["Piyush Kumar Shukla", "Dr. S. Silakari", "Dr. Sarita Singh Bhadoria"], "author_detail": {"name": "Dr. Sarita Singh Bhadoria"}, "author": "Dr. Sarita Singh Bhadoria", "arxiv_comment": "10 pages, International Journal of Computer Science and Information\n  Security", "links": [{"href": "http://arxiv.org/abs/0907.0678v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0907.0678v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "cs.CR", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cs.CR", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "cs.NI", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0907.0678v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0907.0678v1", "journal_reference": "IJCSIS May 2009 Issue, Vol. 1, No. 1", "doi": null, "fulltext": "Designing And Analysis Issues For An\nAttack Resilient and Adaptive Medium\nAccess Control Protocol for Computer\nNetworks: An Exclusive Survey\nPiyush Kumar Shukla,\n\nS. Silakari, Dept. of CSE, UIT,\n\nS.S. Bhadouria, Dept. of EC,\n\nDept. of CSE, UIT, RGPV,\nBhopal, M.P., INDIA,\npphdw@yahoo.com\n\nRGPV, Bhopal, M.P., INDIA,\nssilakari@yahoo.com\n\nMITS, Gwalior,\nSaritamts61@yahoo.co.in\n\nAbstract- Now a days we are trying to improve\nthrough put and efficiency of existing MAC\nprotocols used, suffering from different problem\nlike Request to send and clear to send message\npropagation, and channel chapter effect or\nUnfairness due to using Binary Exponential\nBackoff\nalgorithm,\neffect\nof\nnoise\nin\ncommunication path, but it may be Possible to\ncause an attack by Manipulating traffic in the\nMAC layer and propagate attack to the routing\nlayer then we are in a dilemma how to improve\nperformance of MAC layer protocols .\nDifferentiation of attack and congestion in wireless\nnetwork is a big issue. We promote and prefer a\ndynamic contention window size for utilizing\nunused slots but dynamic behavior increases\nuncertainty and randomness in protocol behavior\nand also uneasiness to detecting attacks. It may be\npossible that a node is maliciously increasing the\ndata traffic into the network, and also affecting the\nbackoff process, it is mandatory to learn pattern\nthe pattern of the attack so that we can discard him\nas early as possible. Behavior of Malicious node\nduring attack is also burning issue and how much\nperformance of MAC protocol degraded as per\nincreasing the number of Malicious nodes. At what\npercentage of total nodes involve in any\ncommunication.\nWe have to identify the parameter on which we can\nwork to strengthen MAC layer protocol against\nattacks.\nKeywords- Attack, Wireless Sensor Network, ZMAC, S-MAC, MAC, Collision, BEB\n\n1. Introduction\nIf we have to improve Performance of MAC\nlayer protocol than we have to work in such a\nway that routing information is always available\nto MAC layer and we are able to sense falls\npackets, we have to modified existing protocol or\ndevelop a new protocol that can consider this\nproblem and can discard false packets or can\nmodify contention window after immediate\ninformation of these packets/detection of\nmalicious node.\nIts the time of failure of exercise have done to\ndecide minimum and maximum contention\nwindow size for different traffic conditions when\nattacker utilize or misuse the unused available\nslots . although duration of the effect of attacks is\ndepend on traffic and obviously on the ratio of\nmalicious packets and on actual packets. It may\nbe possible that we are not affected by attacks\nwhen its ratio is near to 0.0\nIf X is the actal packets and Y is malicious\npackets that we can derive different conditions to\nevaluate performance of MAC protocol (Z)\nduring attacks.\nZ=Y/X.. Can be evaluated and results can be a\ndeciding factor about when and how to increase\nContention window size.\n\n\fHow to achieve better performance with Attack\nResilience MAC Protocol/ procedure to built up\nan atmosphere for Resilience protocol\nDue to innovations in the technology and due to\nrapid growth in the field of Computer Network\nand Internet, The role of Computer Network [1]\nfor users to access the Internet has become more\nimportant. If we have a broadcast network [2][ to\naccess the channel, the key issue is how to\ndetermine who gets to use the channel, when\nthere is a competition for it. Broadcast channels\nare sometimes referred to as Multi Access\nChannels or Random Access Channels. It is\nbased on a particular Medium Access Control\n(MAC) [3, 6] protocol used extensively in\nproviding network access for a collection of end\nusers. These protocols belong to a sub-layer of\nthe data link layer called the MAC sub-layer.\nAny varying channel allocation protocol or\nscheme can be apply, tries to get better\nutilization when the traffic is unpredictable or\nfluctuating. In contention resolution approaches,\nusers transmit a packet when they have data\nto send, if multiple users transmit at the same\ntime a collision occurs and the packets must\nbe retransmitted according to some rule.\nRandom access protocols are different from\nother types of MAC protocols in one property; a\ntransmission is not guaranteed to be a successful\none.\nIn random access or contention methods, no\nstation is superior to another station and none is\nassigned the control over another. At each\ninstance, a station that has data to send uses a\nprocedure defined by the protocol to make a\ndecision on whether or not to send. This decision\ndepends on the state of the medium (idle or\nbusy). In other words, each station can transmit\nwhen it desires on the condition [4] that it\nfollows the predefined procedure, including the\ntesting of the state of the medium.\nTwo features give this method its name. First,\nthere is no scheduled time for a station to\ntransmit. Transmission is random among the\nstations. That is why these methods are called\nrandom access. Second, no rules specify which\nstation should sent next. Stations compete with\none another to access the medium. That is why\nthese methods are also called contention\nmethods.\n\nIn the case of a collision, retransmissions are\nrequired for all unsuccessful transmissions until\nthey are successful this collision may be\nincreases due to attack. To avoid further\ncollisions of the same set of collided\ntransmissions, the retransmission of an\nunsuccessful transmission is scheduled in a\nrandomly chosen future time hoping that other\nretransmissions will not be scheduled to the\nsame future time and simultaneously we have to\nlearn the pattern of packets due to malicious\nattacks [22, 24, 33]. This leads to the\ndevelopment of retransmission algorithms for\nrandom access protocols. Random Access\nSystems are relatively insensitive to the number\nof active stations in the system so their\nperformance is best when there are a large\nnumber of lightly loaded sources. However their\nperformance degrade in the case of malicious\nattacks which include Denial of Service Attack,\nReplay Attack, Continuous Channel Access or\nExhaustion attack, Flooding attack, Jamming\n(Radio interference) attack, Selective forwarding\nattack. The need of a MAC protocol with the\nability to identify threats and capability to\ndiscard these useless packet is required otherwise\nperformance of shared medium may be\ndegraded. We Focus Our Efforts on further\nimproving the channel allocation scheme and\ninclude increase in data traffic due to various\nattacks, we can adopt a Pattern matching\napproach to learn and mitigate the attacks [28].\nAn Efficient and Adaptive Medium Access\nControl Scheme using Pattern matching from the\nAttacks can be design to improve the\nperformance of Media Access Control protocol.\n\n2. Analysis of work done to explain\nattacks on networks\nIn this author said that There are basically three\nlevels of DoS attacks [1], growing both in\nsophistication and seriousness of attack effects.\nThe simplest attack exploits errors and bugs in\nthe design and source code of a network\noperating system. The second level of attack\nexploits known artifacts of a particular system\nimplementation or protocol, often due to limited\nstorage or capacity, to introduce delay, to\nsaturate a system, or otherwise limit\naccessibility. The third and most damaging level\nof attack uses very specific features of the\nnetwork protocol to mount the attack. These\nattacks are specifically designed to look like\nnormal usage. Protecting against DoS attacks is a\n\n\fdifficult and complex problem. There is no\nsingle approach or answer to increasing our\nresiliency and protection against them. In fact,\nthe solution will likely be a combination of\napproaches, including optimizing server settings,\nusing network topologies that minimize attack\neffects, and sweeping changes to protocols and\nrouter behaviour.\nIn this it is explained that Attack model is the\nfoundation for organizing and implementing\nattacks [2] against the target system in Attack\nResistance Test. By redefining the node of the\nattack tree model and re-describing the relation\nof the attack tree nodes, we build a penetration\nattack tree model which can describe, organize,\nclassify, manage and schedule the attacks for\nAttack Resistance Test. The organization method\nof the penetration attack tree is designed in this\npaper, and an algorithm of attack serialization is\nput forward. We also design and realize a\npenetration attack system whose attack scheme is\nthe instance of the model. In the end we present\nan execution example of the penetration attack\nsystem. The example shows that the penetration\nattack model can describe the logical relationship\nof the attacks detailed and effectively, and its\nserialization result can provide the guidance for\npenetration attack. Authors said that in the\nmultimedia applications over the mobile ad hoc\nnetworks, the goodput and delay performance of\nUDP packets is very sensitive to the congestion\ntargeted DDoS attacking. this paper, they\nanalyze this type of attacking in details for the\nfirst time to our knowledge. they figure out the\nprinciples of the attacking from the analysis of\nnetwork capacity and classify the attacking into\nfour categories: Pulsing attacking, Round Robin\nattacking, Self-whisper attacking and Flooding\nattacking.\nThe defense schemes are also proposed, which\nincludes the detection of RTS/CTS packets,\nsignal interference frequency and retransmission\ntime and response stage with ECN marking\nmechanism. Survey of the security in mobile ad\nhoc networks are given in paper [6], however,\nthey discuss more about secure routing protocols\nand key management schemes, and few concerns\nof the MAC DDoS attacking behaviors. Y.\nZhang et al [7] figure out there are different\npossible attacks to the different layer in the\nprotocol stack, however, they leave the\ndescription of detail attacking patterns and DDoS\nattacking in the future works. V. Gupta et al [8]\npoints out there are attacking to route layer and\n\nMAC layer even within the end-to-end\nauthentication network. If there are two collusion\nnodes, in which one is sender and the other is\nreceiver, these two nodes will launch the attacks\neasily. But their given attacking patterns in their\nsimulation study are simple and may be easy to\ndetect, and they do not discuss distributed\nattacking. P. Kyasanur et al [9] proposes to\nmodify 802.11 MAC protocol to solve the\nmisbehavior of selfish nodes. In their scheme,\nthe receiver will determine the backoff value of\nsender, so receiver can punish sender by\nincrementing the backoff value when finding\nsender has some misbehaviors. G. Noubir [10]\ndescribes a type of DoS attacking with power\nconsuming as its target.\nThey argue that in the RTS/CTS handshaking\npackets the NAV value is vulnerability for the\nattacker can utilize this value to estimate the\ncoming transmission event and send a bit data to\ninterfere the normal frame. It will result in the\nlarge number of damage and retransmission of\nnormal frame, which consume large energy on\nthe normal side and only with low energy cost on\nthe attacking side. However, this attacking may\nbe easy detected for its obvious conflict with the\nsending behavior defined in the MAC protocol.\nOther researches use game theory to deal with\nthe problem of selfish nodes [11]. They design\ndistributed protocol make the nodes converge to\nNash equilibrium of bandwidth by allocating a\ncost to each node before its access to channel.\nI. Aad [12] analyzes the DoS attacking to closeloop protocol, such TCP and open-loop protocol,\nsuch as UDP. They describe a JellyFish attacking\nto TCP through a packets disordering, period\npackets dropping and delay variance jittering to\nmake the TCP functional maladjustment. They\nalso describe a Black Hole attacking to the UDP,\nin which the nodes in the path will drop packets\nlike a black hole.\nFor the wired DDoS, papers [13] and [10]\ndescribe the shrew attacks and RoQ attacks,\nwhich are all\nconcerns to protocol and congestion. Shrew\nattacking can make TCP go into timeout status\nand start slow start phase frequently. The RoQ\nattack is to compromise the protocol\nvulnerability for the reduction of quality of\nservice.\nIn this paper, we analyze congestion based\nDDoS attacking in mobile ad hoc networks for\nthe first time to our knowledge. We figure out\nthe principles of the attacking using network\ncapacity analysis and classify the attacking into\n\n\ffour categories: Pulsing attacking, Round Robin\nattacking, Self-whisper attacking and Flooding\nattacking. The defense schemes are given\nincluding the detection signal of RTS/CTS\npackets, interference\nfrequency\nand\nretransmission times and the ECN marking\nresponse mechanism Attack graphs have been\nused to show multiple attack paths in large scale\nnetworks.\nThey have been proved to be useful utilities for\nnetwork hardening and penetration testing.\nHowever, the basic concept of using graphs to\nrepresent attack paths has limitations. In this\npaper, we propose a new approach, the attack\ngrammar, to model and analyze network attack\nsequences. Attack grammars are superior in the\nfollowing areas: First, attack grammars express\nthe interdependency of vulnerabilities better than\nattack graphs. They are especially suitable for\nthe IDS alerts correlation. Second, the attack\ngrammar can serve as a compact representation\nof attack graphs and can be converted to the\nlatter easily. Third, the attack grammar is a\ncontext-free grammar. Its logical formality\nmakes it better comprehended and more easily\nanalyzed. Finally, the algorithmic complexity of\nour attack grammar approach is quartic with\nrespect to the number of host clusters, and\nanalyses based on the attack grammar have a run\ntime linear to the length of the grammar, which\nis quadratic to the number of host clusters.\nIn this paper, we have proposed a grammarbased approach to modeling and analyzing multistep network attack sequences. Methods for\nmodelling attacks with PDA are proposed and\nalgorithms for constructing, simplifying and\nanalyzing the attack grammars are demonstrated.\nThe underlying purpose of the new approach is\nto conquer the limitations of using graphs in\nprevious researches. However, since the\nalgorithm complexity for converting attack\ngrammars to attack graphs is merely linear to the\nlength of the grammar, it is also possible and\ninstructive to construct attack graphs using our\nmethod.\nOne possible future work might be finishing our\ntool and trying out the attack grammar on\nrealistic networks. Another potential work is to\ncombine our approach to existing IDS\napplications for alerts correlation. Most cyberattacks are not single attack actions[18]. They\nare multi-step attacks composed by a set of\n\nattack actions. Although techniques used by\nattackers can be diverse, attack patterns are\ngenerally finite. So we need to find attack steps\nthat are correlated in an attack scenario. By\nstudying the patterns of multi-step cyber attacks,\nan algorithm is presented for correlating multistep cyber attacks and constructing attack\nscenario system based on modeling multi-step\ncyber attacks. When alerts appear, the algorithm\nturns them into corresponding attack models\nbased on the knowledge base and correlates\nthem, whether alert or not is based on the\nweighted cost in the attack path graph and the\nattack degree of the corresponding host.\nAnd attack scenarios can be constructed by\ncorrelating the attack path graphs. Moreover, the\nmodel can detect intrusion alerts in real time and\nrevise the attack. A novel attack pattern\nmodeling method was proposed to correlate\nsingle attack actions and construct attack\nscenarios in this paper. By our approach, firstly,\nthe raw alerts are preprocessed. Then, the attack\npath graphs are constructed by correlated\nmultiple alerts. Based on the attack path graphs,\nattack scenarios are generated.\nThe results are forwarded to the security\nadministrator for the intrusion analysis. One of\nthe most important works in the future is to infer\nthe full scope of the attack from the attack\nscenarios which allows for deeper analysis.\nAnother direction of our future research is to\ncreate better and more sophisticated pattern for\nthe individual steps which the attacker takes to\ncompromise a system. In addition we plan to test\nour approach using data captured from a live\nnetwork.\nA Proactive Test Based Differentiation ract-\nLow rate DoS attacks are emerging threats to the\nTCP traffic, and the VoIP traffic in the Internet.\nThey are hard to detect as they intelligently send\nattack traffic inside the network to evade current\nrouter based congestion control mechanisms. We\npropose a practical attack model in which botnets\nthat can pose a serious threat to the Internet are\nconsidered. Under this model, an attacker can\nscatter bots across the Internet to launch the low\nrate DoS attack, thus essentially orchestrating the\nlow rate DoS attack that uses random and\ncontinuous IP address spoofing, but with valid\nlegitimate IP addresses. It is difficult to detect\nand mitigate such an attack.\nWe propose a low rate DoS attack detection\nalgorithm, which relies on the core characteristic\n\n\fof the low rate DoS attack in introducing high\nrate traffic for short periods, and then uses a\nproactive test based differentiation technique to\nfilter the attack packets. The proactive test was\noriginally proposed to defend DDoS attacks and\nlow rate DoS attacks which tend to ignore the\nnormal operation of network protocols, but it is\ntailored here to differentiate the legitimate traffic\nfrom the low rate DoS attack traffic instigated by\nbotnets. It leverages on the conformity of\nlegitimate flows, which obey the network\nprotocols. It mainly differentiates legitimate\nconnections by checking their responses to the\nroactive tests which include puzzles for\ndistinguishing botnets from human users. We\nfinally evaluate and demonstrate the performance\nof the proposed low rate DoS attack detection\nand mitigation algorithm on the real Internet\ntraces.\nThe end host based defense strategy against the\nlow rate TCP DoS attack is randomization of the\nminimum RTO [2] [23], but it cannot defend\nagainst an RoQ attack as it exploits the network\nelement, and not the end host's vulnerability. A\nfew router based defense systems have been\nproposed to mitigate the low rate DoS attacks. In\n[24], a modified AQM scheme is proposed to\npenalize bursty flows, but it lacks accurate\nidentification of the attack flow, and can penalize\nlegitimate bursty short-lived TCP flows. It does\nnot consider the spoofing problem of an RoQ\nattack. The RoQ attacks can use source and\ndestination IP address spoofing, and they do not\nhave well-defined periodicity, and so schemes\nlike [25]-[27] may not filter these attack packets\naccurately. The scheme proposed in [28] may not\nbe scalable, and can be deceived by the IP\naddress spoofing, although it can detect any\nperiodic pattern in the flows. The wavelet based\napproach [5] relies on detecting variability of the\nincoming\ntraffic\nrate\nand\noutgoing\nacknowledgments for detecting the low rate TCP\nDoS attack, but this approach cannot mitigate the\nRoQ attack which does not try to completely\nshutdown the competing flows. The extent of the\nIP spoofing problem in the Internet today is\ndemonstrated in [13], and thus the spoofing issue\ncannot be ignored. Sarat and Terzis [29]\nsuggested to decrease the buffer size by means of\na mathematical analysis based on [30] to expose\nthe attack flow to the AQM schemes like REDPD, but unfortunately it cannot mitigate the RoQ\nattack, in which the average rate is lower than\nthe low rate TCP DoS attack. In this authors\nproposed a detection system to detect new breed\n\nof DoS attacks in the Internet known as low rate\nDoS attacks. Our detection system was shown to\ndetect and mitigate these attacks even if an\nattacker uses IP address spoofing.\nWe have evaluated the feasibility of the proposed\nlow rate DoS attack algorithm on real Internet\ntraces. As part of the future work, we are\nplanning to test the effectiveness of the proposed\ndetection system by using the NSF Deterlab test\nbed.\nIn this field we can see that lot of work has done\nand still research work is going on due to new\ntechnologies. In Collision attack, the adversary\nmay only need to induce a collision in one octet\nof a transmission [11]. A minute change in the\ndata portion of the packet will result in a\nchecksum change, hence requiring an expensive\nexponential back off in some MAC protocols.\nError Correcting Codes can be used to tolerate\nvariable levels of corruptions in the messages at\nany layer. However these error-correcting codes\ncan only work up to a threshold of corruption\nand they themselves induce additional\ncomputational and communicational costs. The\nattack is based on partial key exposure\nvulnerability [28] in the RC4 stream cipher.\nDenial-of-Service attacks [19], and jamming in\nparticular, are a threat to wireless networks\nbecause they are at the same time easy to mount\nand difficult to detect and stop. This paper\nproposes a distributed intrusion detection system,\nin which each node monitors the traffic flow on\nthe network and collects relevant, as mobile ad\nhoc network applications are deployed, security\nemerges as a central requirement. This paper\nintroduces the wormhole attack [20], a severe\nattack in ad hoc networks that is particularly\nchallenging to defend against. The wormhole\nattack is possible even if the attacker has not\ncompromised any hosts.\nNetwork security in a wireless LAN environment\nis a unique challenge. Whereas wired networks\nsend electrical signals or pulses through cables,\nwireless signals propagate through the air.\nBecause of this, it is much easier to intercept\nwireless signals. This extra level of security[]\ncomplexity adds to the challenges network\nadministrators. As organizations continue to\nspend millions of dollars to ensure corporate,\ncustomer and financial data is protected, they\ndon't realize wireless devices entering the work\nplace render these millions of dollars of\ninvestment potentially obsolete. Hackers [22]\narmed with tools like hunter killer, Air Jack, the\n\n\fEvil Twin phishing attack etc. can compromise.\nWhat three things about WLANs wireless LANs\nstrike fear into their hearts, and the answers are\nlikely to be similar: Security, Security, and\nSecurity [23]. Sure, you want good coverage.\nSure, you want to minimize drops. As with any\nother type of network, an analyzer [24] is one of\nthe first purchases that a wireless network\nadministrator should make. In addition to the\ntraditional functions of protocol analysis and\ndiagnostic tool, wireless network analyzers can\nbe used to address many of the security concerns\nthat may cause to reduce performance of\nnetworks. As networking evolves to support both\nwired and wireless access, securing corporate\nnetworks [25] from attack becomes ever more\nessential. Intel IT is using a new security method\nto authenticate devices, validate them against\nsecurity compliance policies, and remediate\nspecific problems before they connect to Intel's\nnetworks. There is little wonder why wireless\nnetworks have become so ubiquitous the last few\nyears.\n\nAvoidance (CSMA/CA) [16] is a widespread\ntechnique\nused\nin\nmodern\nwireless\ncommunication systems to allow multiple users\nto share the same frequency resource (band). A\nCSMA/CA compliant system must sense the inchannel power before transmitting. If the\nmeasured power is below a certain threshold,\nmeaning that the medium is actually not busy,\nthen the transmission begins. Else, after a\nrandom back-off period, another attempt is\nperformed. Common examples of wireless\nsystems using CSMA/CA are Wi-Fi networks\n(IEEE 802.11 standard) and IEEE 802.15.4 [17]\nwireless sensor networks (WSN).\n\nWireless access points [26] are inexpensive, easy\nto install, and most of all, handy. Although\nwireless networking can make life a lot easier for\nyour users though, they can also become a\nsecurity nightmare.Data transfer that relies on\ncarrier sense, which let the nodes detect if other\nnodes are currently transmitting, are particularly\nvulnerable to DoS. Link-layer security\narchitecture can prevent this type of attack by\ndetecting unauthorized packets when they are\nfirst injected into the network, thus putting a stop\nto energy and bandwidth waste. TinySec support\ntwo different security options: Authenticated\nEncryption and Authentication only. In\nauthentication encryption mode, data payload is\nencrypted and the entire packet is secured by a\nMAC. In contrast, a packet is only secured with\nMessage Authentication Code in authentication\nmode thereby decreases the power consumption.\n\nA distinctive feature of Z-MAC is that its\nperformance is robust to Synchronization error,\nSlot assignment failure and time varying channel\nconditions; in the worst case, its performance\nalways falls back to that of CSMA, Z-MAC is\nimplemented in TinyOS. Performance of ZMAC in Wireless Mess Network and Mobile ad\nhoc Networks has to be analyzed.\n\n3. Understanding MAC layer protocols\nIn this, only CSMA in fading channels is\ndiscussed. Predicting the channel condition\nbased on channel state information and\nregulating the load into the channel accordingly\nto improve the throughput in faded CSMA\nchannel, In this, finding prediction error of\nchannel state estimation and relevant\nconsequences in load regulated CSMA is not\nexplained and practical settings is also lacking.\nCarrier Sense Multiple Access with Collision\n\nWe have seen that hybrid MAC protocol, called\nZ-MAC [31] for Wireless Sensor Network\nCombined the Strength of Both CSMA and\nTDMA. Like CSMA, ZMAC achieves high\nchannel utilization under low contention and like\nTDMA, achieve high channel utilizations under\nhigh contention and reduced collision among\ntwo-hop neighbor at a low cost.\n\nThe performance of modern\nwireless\ncommunication systems are strictly related to the\nadopted medium access mechanism. An effective\none, based on the Carrier Sense Multiple Access\nwith Collision Avoidance technique, is here in\nafter investigated. In particular, the performance\nof a CSMA/CA-based wireless sensor networks,\ndesigned for industrial monitoring [13] and\nperforming both cyclic polling and acyclic alarm\nmanagement, are analyzed. Effects of in-channel\ninterference are also studied. The aim of the\npaper is to gain, from practical experiments,\nresults and guidelines useful for the\nmeasurement and optimization of CSMA/CAbased sensor network performance, when\nemployed for industrial monitoring. In such\ndirection, a suitable IEEE 802.15.4 wireless\nsensors' tested has been deployed and a high\nlayer protocol for industrial monitoring has been\nimplemented.\nIn this, one class of applications envisaged for\nthe IEEE 802.15.4 LR-WPAN (low data rate\n\n\fwireless personal area network) standard is\nwireless sensor networks for monitoring and\ncontrol applications. In this, an analytical\nperformance model for a network in which the\nsensors are at the tips of a star topology [14], and\nthe sensors need to transmit their measurements\nto the hub node so that certain objectives for\npacket delay and packet discard are met. In this,\nwe first carry out a saturation throughput\nanalysis of the system; i.e., it is assumed that\neach sensor has an infinite backlog of packets\nand the throughput of the system is sought. After\na careful analysis of the CSMA/CA MAC that is\nemployed in the standard, and after making a\ncertain decoupling approximation, It was identify\nan embedded Markov renewal process, whose\nanalysis yields a fixed point equation, from\nwhose solution the saturation throughput can be\ncalculated. It was found that with the default\nback-off parameters the saturation throughput\ndecreases sharply with increasing number of\nnodes. In this, Manzur Ashraf derive throughput\nof a threshold based transmission policy, namely\nload regulated CSMA [15], taking into account\nthe propagation delay of the medium and the\noffered load at a different probability of the\nfading channel but analytical framework of\nCSMA/CA has not yet been analyzed.\nIn Continuous Channel Access or Exhaustion\nattack, a malicious node disrupts the MAC\nprotocol, by continuously requesting or\ntransmitting over the channel. This eventually\nleads a starvation for other nodes in the network\nw.r.t channel access [32]. One of the\ncountermeasures to such an attack is Rate\nLimiting as described in [Wood02]. Here, the\nnetwork ignores excessive requests without\nsending expensive radio transmissions. This limit\nhowever cannot drop below the expected\nmaximum data rate the network has to support.\nThis limit is usually coded into the protocol\nduring the design phase and requires additional\nlogic also. Repeated application of these\nexhaustion or collision based MAC layer attacks\ncan lead into unfairness. This kind of attack is a\npartial DoS [32] attack, but results in marginal\nperformance degradation. One major defensive\nmeasure against such attacks is the usage of\nsmall frames, so that any individual node seizes\nthe channel for a smaller duration only. However\nthe adversary can still cause starvation by\nfrequently requesting for channel, while others\ngo on a random back off. Wireless\ncommunications are vulnerable to interception\nand attack, making it essential that you take\nevery precaution in securing your wireless\n\nnetwork. Wi-Fi is an abbreviation for wireless\nFidelity [27] and is used to refer generically to\nany type of wireless network based on the IEEE\n802.11 standard. Wi-Fi offers users easy wireless\nnetwork set-up, access, and use, but because the\nstandard was designed with only limited security\ncapabilities.\nLearn about the pervasive nature of wireless\ncommunications [32], and discover some\nsecurity methods that will protect your network\nagainst unauthorized external access. Wireless\nnetworks have been a ripe target for attacks [30]\never since the emergence and widespread\nadoption of the 802.11b. Security capabilities of\nwireless devices can often be confusing and\ndifficult to set up and administer - and have been\nunder constant scrutiny and attack in the trade\npress.\nAt national level there is little to report but at\ninternational level there are noteworthy\ncontributions, which are taken as base reference\nfor my research work.\n4. Proposed methodology\nWe have to construct an system through which\nwe can learn the pattern of attacks and also we\ncan classify then in 3 parts as unknown and\nunidentified pattern attack, known but un\nidentified patter attack and last is known and\nidentified pattern. It is possible by maintaining\ndatabase of previous pattern of attacks\nWe can adopt a system and can generate real\ntime attack and also we can detect there pattern\nby passing them into an updated Intrusion\ndetection system and those new papttern can be\nstore or accumulate with available previous data\nbase collection of attacks.\nThe MAC Protocols in current state can be\nconsiderably inefficient due to poor channel\nutilization during dynamic/fluctuating load\ntraffic. The Problem gets worse when the\nchannel is subjected to different kind of\nvulnerabilities especially malicious attacks\nwhich results into drastically increase in data\ntraffic and thereby further decrease the effective\nchannel bandwidth utilization.\nIn our proposed work we focus our effort to\ndevise an efficient and attack resilient MAC\nprotocol for Computer network.\nIn this investigation we first survey the various\nchannel allocation schemes and adaptive\nalgorithm dealing with increase data traffic. We\nhave implemented the concept of adaptive\ncontention window size, as per BEB (Binary\nExponential Backoff algorithm). Simulation\n\n\fresult by Standard Network Simulator, shows\nthat performance of adaptive CSMA/CD is\nimproved comparable to original one. Our\nsurvey will also include approaches which sense\nand adopt to the various threats, this will\nenabling us to critically investigating the\nproblem of existing techniques to mitigate the\nchallenges in Medium Access Controls.\nSubsequently We Focus Our Efforts on further\nimproving the channel allocation scheme and\ninclude increase in data traffic due to various\nattacks.\nWe have to develop an Adaptive, Medium\nAccess Control Protocol using which can learn\npattern of attacks and mitigate them.\n\nTransmission Control of Random Access\nCommunication Channels,\" IEEE Transactions on\nInformation Theory, vol. IT-33, no. 2, pp. 219-223,\nMarch 1987.\n[6]\n\nS. S. Lam, \"A Carrier Sense Multiple Access\nProtocol for Local Networks,\" Computer Networks,\nvol. 4, pp. 21-32, 1980.\n\n[7]\n\nJ. L. Hammond and P. J. P. O'Reilly, \"Performance\nAnalysis of Local Computer Networks,\" AddisonWesley, 1988.\n\n[8]\n\nWu Xing-feng, Liu Yuan-an, \"A Survey of WLAN\nQoS Systems Based on IEEE 802.11\", IJCSNS\nInternational Journal of Computer Science and\nNetwork Security, Vol. 7, No. 3, March 2007.\n\n[9]\n\nM. L. Molle, \"A New Binary Logarithmic\nArbitration Method for Ethernet,\" Technical Report\nCSRI-298, The University of Toronto, April 1994.\n\n[10]\n\nW. M. Kiesel and P. J. Kuehn, \"A New CSMA/CD\nProtocol for Local Area Networks with Dynamic\nPriorities and Low Collision Probability,\" IEEE\nJournal on Selected Areas in Communications, vol.\n1, no. 5, pp. 869-876, November 1983.\n\n[11]\n\nYounggoo Kwon, Yuguang Fang and Haniph\nLatchman, \"A Novel MAC Protocol with Fast\nCollision Resolution for Wireless LANs\", IEEE\nINFOCOM 2003.\n\n[12]\n\nRoberto Verdure, Flavia Fabbri, Chiara Buratti,\n\"Area Throughput for CSMA Based Wireless\nSensor Networks\", IEEE EW2008, 22-25 June 2008,\nPrague, Czech Republic.\n\n[13]\n\nAnis KOUBAA, Mário ALVES, Eduardo TOVAR,\n\"A Comprehensive Simulation Study of Slotted\nCSMA/CA for IEEE 802.15.4 Wireless Sensor\nNetworks\", Technical Report, TR-060601, Version:\n1.0, IPP-HURRAY, Portugal, June, 2006.\n\n[14]\n\nT.R. Park, T.H. Kim, G.Y. Choi, S.Choi and W.H.\nKwon, \"Throughput and Energy Consumption\nAnalysis of IEEE 802.15.4 slotted CSMA/CA\",\nElectronic Letters Online No. 20051662, IEE, 2005.\n\n[15]\n\nPrasan Kumar Sahoo, Jang-Ping Sheu, \"Modeling\nIEEE 802.15.4 based wireless sensor network with\npacket retry limits\", Proceedings of the 5th ACM\nsymposium on Performance evaluation of wireless\nad hoc, sensor, and ubiquitous networks, Vancouver,\nBritish Columbia, Canada, pp 63-70, 2008,\nISBN:978-1-60558-236-8.\n\n[16]\n\nJianliang Zheng, Myung J. Lee, \"A Comprehensive\nPerformance Study of IEEE 802.15.4\", Proc. IEEE\njournal on selected areas in communications, vol.\n21, pp. 229-239, Feb. 2003.\n\n[17]\n\nJ. Heidemann, W. Ye, and D. Estrin, \"An energyefficient MAC protocol for wireless sensor\nnetworks,\" In Proceedings of the 21stInternational\nAnnual Joint Conference of the IEEE Computer and\nCommunications Societies (INFOCOM 2002), New\nYork, NY, June 2002.\n\n5. Conclusion and Future work.\nWe know that there are so many possible attacks\nin wireless and wired networks so it required\nlarge database collection for storing patern of all\nof them and it will also increase complexity of\nsystems as well as we have to put more time to\nsearch and match the pattern while attack is\nperformed Identifying difference between\nsudden increase in traffic and attack is only\npossible when we have some rules and some\nprevious learned pattern of attacks .\nAs per our survey work, Assessments of the\nexisting Medium Access Control Protocols with\nrespect to handling increased data traffic caused\nby malicious Attacks. We aim to develop An\nAttack Resilient approach for increasing the\nchannel utilization for Medium Access Control\nProtocol.\n6. References\n[1]\n\nAndrew S. Tanenbaum, \"Computer Networks (Fifth\nEdition)\", PHI.\n\n[2]\n\nBehrouz A Forouzan, \"Data Communications and\nNetworking (Fourth Edition)\", McGraw Hill\nPublications.\n\n[3]\n\nN. Abramson, \"The ALOHA System – Another\nJoint\nAlternative\nfor\nComputer\nCommunications,\" Fall Computer Conference,\nAFIPS Conference Proceedings, Vol. 37, 281-285\n(1970)\n\n[4]\n\nA. Takagi, S. Yamada, and S. Sugawara,\n\"CSMA/CD\nwith\nDeterministic\nContention\nResolution,\" IEEE Journal on Selected Areas in\nCommunications, vol. 1, no. 5, pp. 877-884,\nNovember 1983.\n\n[5]\n\nD. J. Aldous, \"Ultimate Instability of Exponential\nBack-Off Protocol for Acknowledgement-Based\n\n\f[18]\n\n[19]\n\nManzur Ashraf, Aruna Jayasuriya, Sylvie Perreau,\n\"On Load Regulated CSMA\", The 28th ICDCS\nWorkshops 2008.\nChris Karlof, Naveen Sastry, David Wagner,\n\"TinySec: A Link Layer Security Architecture for\nWireless Sensor Networks\", in proceedings of 2nd\nInternational Conference on Embedded networked\nsensor systems, pp: 162-175, November 2004,\nISBN: 1-58113-879-2.\n\n[20]\n\nAdrian Perrig, Robert Szewczyk, Victor Wen, David\nCuller, J. D. Tygar, \"SPINS: Security Protocols for\nSensor Networks\", in proc. of Wireless Networks\narchive, vol.8, no.5, pp: 521-534, September 2002.\n\n[21]\n\nArchana Bharathidasan, Vijay Anand Sai Ponduru\n\"Sensor Networks: An Overview\" Potentials, IEEE\nProceedings, vol. 22, no. 2, pp: 20- 23, May 2003,\nDoi:10.1109/MP.2003.1197877.\n\n[22]\n\nFluhrer, Mantin, and Shamir \"A Key Recovery\nAttack on the 802.11b Wired Equivalent Privacy\nProtocol (WEP)\", the link-layer security protocol for\n802.11b wireless networks, IEE, WEPE 802.11,\nAttack, Wi-Fi, Wireless, Network Security, Wireless\nLANs, Security, Networking, White papers, 2005.\n\n[23]\n\nChibiao Liu, and James Yu, Member, IEEE, \"A\nSolution to WLAN Authentication and Association\nDoS Attacks\" School of Computer Science,\nTelecommunications, and Information Systems,\nDePaul University, Chicago, IL 60604, USA,\ncorresponding author, phone: 312-362-5938.\n\n[24]\n\n\"Packet Leashes: A Defense against Wormhole\nAttacks\nin\nWireless\nNetworks\",\nWhite\npapersTAGS: Network, Wireless.\n\n[25]\n\n\"What Is Wireless Security\", Wireless Security, WiFi, Wireless, Networking , Book chapters 2005-0430.\n\n[26]\n\n\"AirDefense: Best Practices for Deploying & Securing\nWireless Networks\",TAGS: AirDefense, Network,\nBest Practice, Wireless Network, Wi-Fi, Wireless,\nNetworking, Security, White papers.\n\n[27]\n\n\"WPA2 Security: Choosing the Right WLAN\nAuthentication Method for Homes and Enterprises\",\nAsk a hundred C TAGS: Global Knowledge\nNetwork Inc., WLAN, Wi-Fi, Wireless, Security,\nNetworking, White papers 2008-04-09.\n\n[28]\n\n\"Seven Security Problems Revisited: Using a\nWireless\nAnalyzer\nto\nAddress\nSecurity\nVulnerabilities for 802.11a and 802.11b Radio\nBands\", TAGS: Security, IEEE 802.11, Network,\nVulnerability,\nWireless And Mobility, White\npapers 2002-12-01.\n\n[29]\n\n[30]\n\n\"Enforcing Network Security on Connection\", TAGS:\nNetwork, Compliance, Intel Corp., Intel IT,\nNetworking, Security, Network Security, White\npapers 2007-02-01.\n\"The importance of an effective wireless access\npolicy\", TAGS: access point, Brien M. Posey\nMCSE, Security, wireless network, Technical\narticles 2006-06-26.\n\n[31]\n\n\"Wireless Data Security\", TAGS: Security, Network,\nWireless Network, Wireless, Wireless Wide Area\nNetworks, Wi-Fi, Networking, White papers, 2007.\n\n[32]\n\n\"10 things you should know about securing wireless\nconnections\", TAGS: Wireless Network, Wi-Fi,\nWireless, Download resources 2005-09-22, White\nPaper.\n\n[33]\n\n\"A Study of On-Off Attack Models for Wireless Ad\nHoc Networks\" , TAGS: Network, Bucknell\nUniversity, Attack, Wi-Fi, Wireless, Networking,\nSecurity, White papers 2006-09-14.\n\n[34]\n\n\"What 2006-03-30\" is Wireless Security\", Network,\nWireless Security, Wi-Fi, Wireless, Networking ,\nBook chapters Network, Attack,\nNetworking,\nSecurity, Wireless. White papers, 2006.\n\n[35]. \"Attacks and Defenses Utilizing Cross-Layer\nInteractions in Cross-Layer Interactions in\nMANET\", John S. Baras and Svetlana Radosavac ,\nDepartment\nof\nElectrical\nand\nComputer\nEngineering, Institute for Systems Research,\nUniversity of Maryland College Park, NATO\nCross-Layer Workshop, NRL, June 2-3, 2004\n[36]\n\n\"DOMINO: A system to detect greedy misbehavior\nin IEEE 802.11 hotspots\", M. Raya, J.-P. Hubaux\nand I. Aad appear in MobiSys 2004.\n\n[37].\n\n\"ASSESSING AND QUANTIFYING DENIAL OF\nSERVICE ATTACKS\" William J. Blackert The\nJohns Hopkins University Applied Physics\nLaboratory (JHU/APL), Laurel, MD 20723 ,2001\nIEEE.\n\n[38].\n\n\"Design and Application of Penetration Attack Tree\nModel Oriented to Attack Resistance Test\" 2008\nInternational Conference on Computer Science and\nSoftware Engineering, ZHU Ning, CHEN Xin-yuan,\nZHANG Yong-fu, XIN Si-yuan Institute of\nElectronic Technology, Information Engineering\nUniversity Zhengzhou,\nChina\nzhuning_2006@126.com,\nDOI\n10.1109/CSSE.2008.1137\n\"Attack Diagnosis: Throttling Distributed Denial of\nService Attacks Close to the Attack Sources\"\nRuiliang Chen and Jung-Min Park Bradley\nDepartment of Electrical and Computer Engineering\nVirginia Polytechnic Institute and State University\nBlacksburg, VA 24061 {rlchen, jungmin}@vt.edu\n\n[39].\n\n[40]\n\nProceedings of the Seventh IEEE International\nSymposium on Multimedia (ISM'05) 0-7695-24893/05 $20.00 © 2005 IEEE, Authorized licensed use\nlimited to: UNIVERSITY INSTITUTE OF\nTECHNOLOGY. Downloaded on May 28, 2009 at\n07:34 from IEEE Xplore.\n\n[41]\n\nIEEE, \"IEEE Standard for Information Technology\nTelecommunications and Information Exchange\nbetween Systems – Specific Requirements – Part 11:\nWireless LAN MAC and PHY Specifications,\"\nIEEE Std 802.11-1999, IEEE, New York, 1999.\n\n[42]\n\nH. Yang, H. Luo, F. Ye, S. Lu, L. Zhang, \"Security\nin Mobile Ad Hoc Networks: Challenge and\n\n\fSolutions\", IEEE Wireless Communications, Feb.\n2004.\n[43]\n\nY. Zhang and W. Lee, \"Intrusion Detection in\nWireless ad hoc Networks\", ACM MOBICOM\n2000.\n\n[44]\n\nV. Gupta, S. Krishnamurthy, and M. Faloutsos,\n\"Denial of Service Attacks at the MAC Layer in\nWireless Ad Hoc Networks,\" IEEE MILCOM,\n2002.\n\n[45]\n\nP. Kyasanur, and N. Vaidya, \"Detection and\nHandling of MAC Layer Misbehavior in Wireless\nNetworks,\" in Proceeding of the International\nConference on Dependable Systems and Networks\n(DSN), June 2003\nG. Noubir and G. Lin, \"Low-Power DoS Attacks in\nData Wireless LANs and Countermeasures\", ACM\nMOBIHOC2003, Poster Session, 2003.\n\n[46]\n\n[47]\n\nA. B. MacKenzie and S. B. Wicker. Stability of\nMultipacket Slotted Aloha with Selfish Users and\nPerfect Information, In Proceedings of IEEE\nINFOCOM 2003, San Francisco, CA, April 2003.\n\n[48]\n\nI. Aad, J.P. Hubaux, E.W.Knightly, Denial of\nService Resilience in Ad Hoc Networks,\nMOBICOM2004,\nSept.\n26-Oct.1,\n2004,\nPhiladelphia, Pennsylvania, USA.\n\n[49]\n\nAleksandar Kuzmanovic, Edward W. Knightly,\nLow-Rate TCP-Targeted Denial of Service Attacks,\nProceedings of the 2003 conference on Applications,\ntechnologies, architectures, and protocols for\ncomputer\ncommunications,\nAugust\n2003,\nSIGCOMM2003, Karlsruhe, Germany Pages: 75 –\n86.\n\n[50]\n\nMina Guirguis, Azer Bestavros, Ibrahim Matta and\nYuting Zhang. Reduction of Quality (RoQ) Attacks\non Internet End-Systems, INFOCOM2005, Miami,\nFlorida, Mar. 2005.\n\n[51]\n\nP. Gupta and P.R.Kumar, The Capacity of Wireless\nNetworks, IEEE Transaction on Information Theory,\n46(2): 388-404, March 2000.\n\n[52]\n\nThe\nNetwork\nSimulator\nhttp://www.isi.edu/nsnam/ns/index.html.\n\n[53]\n\nThe CMU Monarch Project, \"Wireless and Mobility\nExtension to ns\"\n\n[55]\n\nDaniel Geer, John Harthorne. Penetration Testing:\nA Duet[C]. Proceedings of the 18th Annual\nComputer Security Applications Conference\n(ACSAC.02). Las Vegas, NV, USA, December 913, 2002. Washington D.C.: IEEE CS Press, 2002:\n185-195.\n\n[56]\n\nS J Templeton, K Levitt. A requires/provides model\nfor computer attacks. The New Security Paradigms\nWorkshop, Cork Ireland, 2000.\n\n[57]\n\nK Daley, R Larson, J Dawkins. A structural\nframework for modelling multi-stage network\nattacks. The Int'l Conf on Parallel Processing\nWorkshops, Vancouver, BC, Canada, 2002.\n\nNS-2,\n\n[58]\n\nZHUGE Jian-wei, XU Hui, PAN Ai-min. An Attack\nKnowledge Model Based on Object-Oriented\nTechnology [J]. Journal of Computer Research and\nDevelopment, 2004, 41 (7).\n\n[59]\n\nWANG Xiao-cheng, LIU En-de, XIE Xiao-quan.\nAttack Classification Research and A Distributed\nNetwork Intrusion Detection System [J]. Journal of\nComputer Research and Development, 2001, 38(6):\n\n\f"}