{"id": "http://arxiv.org/abs/0912.0904v2", "guidislink": true, "updated": "2013-12-09T00:58:46Z", "updated_parsed": [2013, 12, 9, 0, 58, 46, 0, 343, 0], "published": "2009-12-04T20:23:50Z", "published_parsed": [2009, 12, 4, 20, 23, 50, 4, 338, 0], "title": "Shortening the Hofer length of Hamiltonian circle actions", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0912.3015%2C0912.3890%2C0912.1840%2C0912.2621%2C0912.4910%2C0912.1908%2C0912.1652%2C0912.2857%2C0912.3380%2C0912.0206%2C0912.2340%2C0912.0424%2C0912.3110%2C0912.0311%2C0912.3569%2C0912.0080%2C0912.4815%2C0912.2315%2C0912.5129%2C0912.0089%2C0912.0710%2C0912.0064%2C0912.2455%2C0912.4069%2C0912.2932%2C0912.4299%2C0912.3919%2C0912.2360%2C0912.3146%2C0912.0739%2C0912.0245%2C0912.4633%2C0912.4834%2C0912.0148%2C0912.3830%2C0912.5383%2C0912.4028%2C0912.5077%2C0912.3744%2C0912.4921%2C0912.4348%2C0912.0928%2C0912.0500%2C0912.0650%2C0912.5529%2C0912.0523%2C0912.2384%2C0912.0568%2C0912.1020%2C0912.5082%2C0912.4033%2C0912.5135%2C0912.4119%2C0912.2749%2C0912.3692%2C0912.4933%2C0912.1193%2C0912.0611%2C0912.2722%2C0912.2121%2C0912.1863%2C0912.2405%2C0912.4932%2C0912.2326%2C0912.2223%2C0912.3238%2C0912.5355%2C0912.1195%2C0912.1584%2C0912.2907%2C0912.2312%2C0912.2298%2C0912.2602%2C0912.4473%2C0912.0544%2C0912.0209%2C0912.4526%2C0912.1636%2C0912.1748%2C0912.0536%2C0912.4968%2C0912.3656%2C0912.3670%2C0912.2677%2C0912.0049%2C0912.4156%2C0912.2487%2C0912.3331%2C0912.5303%2C0912.2839%2C0912.4928%2C0912.3275%2C0912.4675%2C0912.0904%2C0912.2840%2C0912.1135%2C0912.4417%2C0912.2699%2C0912.4922%2C0912.4920%2C0912.3797&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Shortening the Hofer length of Hamiltonian circle actions"}, "summary": "A Hamiltonian circle action on a compact symplectic manifold is known to be a\nclosed geodesic with respect to the Hofer metric on the group of Hamiltonian\ndiffeomorphisms. If the momentum map attains its minimum or maximum at an\nisolated fixed point with isotropy weights not all equal to plus or minus one,\nthen this closed geodesic can be deformed into a loop of shorter Hofer length.\nIn this paper we give a lower bound for the possible amount of shortening, and\nwe give a lower bound for the index (\"number of independent shortening\ndirections\"). If the minimum or maximum is attained along a submanifold B, then\nwe deform the circle action into a loop of shorter Hofer length whenever the\nisotropy weights have sufficiently large absolute values and the normal bundle\nof B is sufficiently un-twisted.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0912.3015%2C0912.3890%2C0912.1840%2C0912.2621%2C0912.4910%2C0912.1908%2C0912.1652%2C0912.2857%2C0912.3380%2C0912.0206%2C0912.2340%2C0912.0424%2C0912.3110%2C0912.0311%2C0912.3569%2C0912.0080%2C0912.4815%2C0912.2315%2C0912.5129%2C0912.0089%2C0912.0710%2C0912.0064%2C0912.2455%2C0912.4069%2C0912.2932%2C0912.4299%2C0912.3919%2C0912.2360%2C0912.3146%2C0912.0739%2C0912.0245%2C0912.4633%2C0912.4834%2C0912.0148%2C0912.3830%2C0912.5383%2C0912.4028%2C0912.5077%2C0912.3744%2C0912.4921%2C0912.4348%2C0912.0928%2C0912.0500%2C0912.0650%2C0912.5529%2C0912.0523%2C0912.2384%2C0912.0568%2C0912.1020%2C0912.5082%2C0912.4033%2C0912.5135%2C0912.4119%2C0912.2749%2C0912.3692%2C0912.4933%2C0912.1193%2C0912.0611%2C0912.2722%2C0912.2121%2C0912.1863%2C0912.2405%2C0912.4932%2C0912.2326%2C0912.2223%2C0912.3238%2C0912.5355%2C0912.1195%2C0912.1584%2C0912.2907%2C0912.2312%2C0912.2298%2C0912.2602%2C0912.4473%2C0912.0544%2C0912.0209%2C0912.4526%2C0912.1636%2C0912.1748%2C0912.0536%2C0912.4968%2C0912.3656%2C0912.3670%2C0912.2677%2C0912.0049%2C0912.4156%2C0912.2487%2C0912.3331%2C0912.5303%2C0912.2839%2C0912.4928%2C0912.3275%2C0912.4675%2C0912.0904%2C0912.2840%2C0912.1135%2C0912.4417%2C0912.2699%2C0912.4922%2C0912.4920%2C0912.3797&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "A Hamiltonian circle action on a compact symplectic manifold is known to be a\nclosed geodesic with respect to the Hofer metric on the group of Hamiltonian\ndiffeomorphisms. If the momentum map attains its minimum or maximum at an\nisolated fixed point with isotropy weights not all equal to plus or minus one,\nthen this closed geodesic can be deformed into a loop of shorter Hofer length.\nIn this paper we give a lower bound for the possible amount of shortening, and\nwe give a lower bound for the index (\"number of independent shortening\ndirections\"). If the minimum or maximum is attained along a submanifold B, then\nwe deform the circle action into a loop of shorter Hofer length whenever the\nisotropy weights have sufficiently large absolute values and the normal bundle\nof B is sufficiently un-twisted."}, "authors": ["Yael Karshon", "Jennifer Slimowitz"], "author_detail": {"name": "Jennifer Slimowitz"}, "author": "Jennifer Slimowitz", "arxiv_comment": "43 pages. To appear in the Journal of Symplectic Geometry", "links": [{"href": "http://arxiv.org/abs/0912.0904v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0912.0904v2", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "math.SG", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "math.SG", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "53D35", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0912.0904v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0912.0904v2", "journal_reference": null, "doi": null, "fulltext": "arXiv:0912.0904v2 [math.SG] 9 Dec 2013\n\nSHORTENING THE HOFER LENGTH OF HAMILTONIAN\nCIRCLE ACTIONS\nYAEL KARSHON AND JENNIFER SLIMOWITZ\nAbstract. A Hamiltonian circle action on a compact symplectic manifold is known to be a closed geodesic with respect to the Hofer metric\non the group of Hamiltonian diffeomorphisms. If the momentum map\nattains its minimum or maximum at an isolated fixed point with isotropy\nweights not all equal to plus or minus one, then this closed geodesic can\nbe deformed into a loop of shorter Hofer length. In this paper we give a\nlower bound for the possible amount of shortening, and we give a lower\nbound for the index (\"number of independent shortening directions\"). If\nthe minimum or maximum is attained along a submanifold B, then we\ndeform the circle action into a loop of shorter Hofer length whenever the\nisotropy weights have sufficiently large absolute values and the normal\nbundle of B is sufficiently un-twisted.\n\nContents\n1. Introduction\n2. Preliminaries\n3. New results and further questions\n4. Shortening a non-effective circle action\n5. Shortening a combined action\n6. Disjoining discs in C\n7. Disjoining a family of discs\n8. Shortening on a manifold with an isolated maximum\n9. Symplectic vector bundles\n10. Shortening on a manifold with an arbitrary maximum\n11. The index of the positive Hofer length functional\nReferences\n\n2\n6\n9\n15\n16\n21\n23\n25\n27\n34\n38\n42\n\nPart of this research was conducted at the Hebrew University of Jerusalem and was\npartially supported by the Israel Science Foundation, founded by the Academy of Sciences\nand Humanities. Jennifer Slimowitz acknowledges support by an NSF/NATO Postdoctoral\nFellowship during the time that this work was done.\n1\n\n\f2\n\nY. KARSHON AND J. SLIMOWITZ\n\n1. Introduction\nA Hamiltonian circle action on a compact symplectic manifold (M, ω) can\nbe viewed as a loop in the group Ham(M, ω) of Hamiltonian diffeomorphisms,\nparametrized by R/Z. We are concerned with deforming this loop, through\nloops in Ham(M, ω), into a loop whose Hofer length is smaller. In short,\nwe call such a deformation \"shortening\". The reader may go directly to\nSection 3 for the precise statements of the new results that we prove in this\npaper.\nOne motivation for such a study comesRfrom Riemannian geometry, where\n1\none studies the action functional γ 7→ 0 kγ̇(t)k2 dt on spaces of loops or\npaths with fixed endpoints in a compact Riemannian manifold. Critical\npoints are geodesics; the index of a critical point is finite and is equal to the\nnumber (counting multiplicity) of conjugate points along the geodesic; every\nhomotopy class contains a minimal geodesic. Morse theory in this context\nhas played a major role in the study of the topology of compact Lie groups.\nSee Milnor's book [17].\nThe infinite dimensional group Ham(M, ω) is a central object in symplectic geometry. It has a natural Finsler metric, introduced by Hofer, which\ninduces a non-trivial distance function. The length of a path γ : [0, 1] →\nHam(M, ω) with respect to this Finsler metric is called the Hofer length of\nγ. It is equal to the sum of the positive Hofer length and the negative Hofer\nlength; see section 2.\nThere have been various attempts to extend to this setting notions that\nhad been applied successfully to the action functional of Riemannian geometry. The situation here is more difficult and it is not yet clear to what\nextent the analogy can be carried out. But the partial results that exist are\nbeautiful and deep. A main theme is to express Morse properties of Hofer's\nfunctional on a space of paths in Ham(M, ω) in terms of the dynamics of the\nflows on M given by these paths.\nThere are several notions of \"geodesic path\" in Ham(M, ω). With all of\nthese notions, every time-independent Hamiltonian flow is geodesic. (But\nnot every geodesic is time-independent.) Thus, every Hamiltonian circle\naction is a geodesic loop in Ham(M, ω).\nStarting with a Hamiltonian circle action {φt : M → M }0≤t≤1 on a compact connected symplectic manifold, here is a sample of known results. Considering the opposite circle action gives the analogous results with \"maximum\" replaced by \"minimum\" and \"positive Hofer length\" replaced by\n\"negative Hofer length\".\n(1) Suppose that the circle action is semi-free near the set where the\nmomentum map is maximal. (Semi-free means that only the trivial\ngroup and the entire circle occur as stabilizers.) Then its positive\n\n\fSHORTENING HOFER LENGTH OF CIRCLE ACTIONS\n\n3\n\nHofer length is minimal among homotopic loops. See [19], the paragraph after Thm. 1.21, whose proof relies on [15, Thm. 1.9].\nIn particular, if the circle action is semi-free on M then it is lengthminimizing among homotopic loops in Ham(M, ω). This was already\nshown by McDuff-Slimowitz [14, Theorem 1.4].\nAnother consequence is that, if the circle action is semi-free near\nthe set where the momentum map is maximal, then the circle action is non-contractible in Ham(M, ω). This was already shown by\nMcDuff-Tolman [15, Theorem 1.1].\n(2) Suppose that the momentum map attains its maximum at an isolated\nfixed point and that the circle action is not semi-free near the maximum. Then the circle action can be deformed to a loop in Ham(M, ω)\nwhose Hofer length is smaller. See Ustilovsky [24, Theorem 1.2.E].\n(3) If n is a sufficiently large integer, then the non-effective circle action\n{φnt }0≤t≤1 can be deformed into a loop of smaller Hofer length. See\nPolterovich [18, p. 86].\nLet B be the set where the momentum map attains its maximum.\nIf there exists a Hamiltonian diffeomorphism g such that g(B) ∩ B =\n∅, then the non-effective circle action {φ2t }0≤t≤1 can be deformed to\na loop in Ham(M, ω) of smaller Hofer length. See Polterovich [18,\nTheorem 8.2.H].\nMany results in the literature apply to spaces of paths in Ham(M, ω)\nwith fixed endpoints and to geodesic loops or paths that are possibly timedependent. We refer the reader to the papers by Hofer [7], Bialy-Polterovich [3],\nYi Ming Long [12], Siburg [22], Ustilovsky [24], Lalonde-McDuff [10, 11],\nMcDuff-Slimowitz [14], McDuff [13], and Savelyev [19, 20]. Polterovich's\nbook [18] contains systematic explanations of many results in the subject.\nExample 1.1. Let e2πit ∈ S 1 act on CP2 by [u, z, w] 7→ [u, e−2πit z, e2πit w],\nwith the Fubini Study form normalized such that the momentum map is\n(|w|2 − |z|2 )/(|u|2 + |z|2 + |w|2 ) + constant. Take an equivariant blow-up\nat the point [0, ⋆, 0] where the momentum map is minimal. This yields a\nHamiltonian circle action on a symplectic manifold (M, ω) whose isotropy\nweights where the momentum map is maximal are −1, −2 and whose isotropy\nweights where the momentum map is minimal are 1, 1. It is an effective circle\naction that represents a non-trivial element of π1 (M, ω) (by the above item\n(1), applied to the minimum) but that can be deformed into a shorter loop\nin Ham(M, ω) (by the above item (2), applied to the maximum).\nTypically, to show that a geodesic cannot be deformed to a loop of smaller\nHofer length requires \"hard\" holomorphic curve techniques, whereas to show\nthat a geodesic can be shortened is possible with \"soft\" techniques.\n\n\f4\n\nY. KARSHON AND J. SLIMOWITZ\n\nIn this paper we use \"soft\" techniques to explore the behaviour of the\nHofer length functional as we deform a Hamiltonian circle action within the\nspace of loops in Ham(M, ω). Starting with a circle action is a very restrictive\nassumption, but it allows us to obtain new results that do not follow from\ngeneral existing results. Our new results are sketched in the abstract and\nstated in Section 3. In brief,\n⋆ Our Theorem 3.1 is the first quantitative shortening estimate for\neffective Hamiltonian circle actions.\n⋆ Our Theorem 3.7, Theorem 3.9, and Corollary 3.12 are the first shortening results that apply when the extrema of the momentum map\nare not necessarily displaceable and the circle action is effective.\n⋆ Our Theorem 3.17 gives a lower bound on the index of the Hofer\nlength functional. It confirms a prediction of Yasha Savelyev. (But\nsee Remark 1.2.)\nWe now give an overview of the paper.\nIn Section 2 we review standard background material. The purpose of this\nreview is to remind equivariant symplectic geometers of facts about timedependent Hamiltonian flows and to remind symplectic topologists of facts\nabout momentum maps. In Section 3 we state our results, give examples,\nand pose further questions.\nIn Sections 4–7 we develop the main tools for the later proofs of our main\nresults. We warm up by describing, in Section 4, Polterovich's shortening\ntrick for non-effective circle actions (item (3) in the above sample of known\nresults). In our later proofs we use variations of this Polterovich trick; we\ngive such variations in Section 5: take a Hamiltonian circle action with\nmomentum map H, and assume that, near the set where H is maximal,\nwe can write H = K + F where K and F also generate circle actions.\nAlso assume that the sets where K and F are maximal have non-empty\nintersection, and that there exists a symplectic isotopy that disjoins the first\nof these sets from the second. Finally, assume that the infimum of the sum\nof K and F is equal to the sum of their infima. We deduce that the circle\naction can be deformed to a shorter loop in Ham(M, ω), and we estimate\nthe amount by which this loop is shorter. Our actual statement is slightly\nmore technical; see Lemma 5.1. The qualitative part of this result can be\nstrengthened if H decomposes, near its maximum, into a sum of more than\ntwo momentum maps; see Lemma 5.10. Sections 6 and 7 contain variations\non the simple fact that a disc of area A1 can be disjoined from a disc of area\nA2 inside a disc of area greater than A1 + A2 . See Lemmas 6.1 and 7.1.\nIn Section 8 we prove our first new result, Theorem 3.1: when the momentum map attains its maximum at an isolated fixed point and one of\n\n\fSHORTENING HOFER LENGTH OF CIRCLE ACTIONS\n\n5\n\nthe isotropy weights has absolute value ≥ 2, we give a lower bound for the\namount of possible shortening, in terms of the gap between the two largest\ncritical values of the momentum map. The proof consists of the following\nsteps. There exists an equivariant Darboux chart whose image is the entire\nset of points where the momentum map is larger than the second-largest\ncritical value; this set can be identified with an ellipsoid in Cn . We view\nthis ellipsoid as a family of discs in C parametrized by points in a subset of\nCn−1 , where the circle action on the C component is non-effective. From the\nresults of Section 5 we get shortening by an amount that depends on the size\nof a family of discs that can be disjoined from another such family through\na Hamiltonian isotopy supported in the ellipsoid. Such an estimate, in turn,\nis obtained from the results of Section 7. For effective circle actions, these\nare the first shortening results that are quantitative.\nIn Sections 9 and 10 we prove our second new result (more precisely,\nset of results). We now allow the momentum map to attain its maximum\nalong a submanifold B of positive dimension. To describe a neighbourhood\nof B in M , we use Sternberg's minimal coupling procedure and Weinstein's\nsymplectic tubular neighbourhood theorem. Let E denote the normal bundle\nof B in M . In the simplest case, we may assume that E has k sections that\nare nowhere all vanishing, where k + 1 is the smallest absolute value of an\nisotropy weight in E. In the general case, we make a similar assumption for\na sub-bundle E ′ of E. The idea of the proof is to express the circle action\nas a composition of k + 1 circle actions on a neighbourhood of B and to\nthen apply the results of Section 5. For the precise results, and for some\nspecial cases, see Theorems 3.7 and 3.9 and Corollary 3.12. These are the\nfirst shortening results when the maximum is attained along a manifold that\nis not necessarily displaceable and the circle action is effective.\nFinally, in Section 11, we prove our third new result, Theorem 3.17: we\ngive a lower bound for the index of the Hofer length functional, assuming that\nthe momentum map attains its maximum at an isolated fixed point. Composing with an equivariant Darboux chart, we may work with a linear circle\naction on Cn that rotates the coordinates of Cn with speeds −k1 , . . . , −kn ,\nwhere the kj s are positive integers. We write the action on the jth coordinate as a composition of kj terms, φt ◦. . . ◦φt , where φ−t generates the scalar\nmultiplication circle action. We obtain a family of shortenings by applying\nPolterovich's trick of Section 4 to the different factors of these compositions:\nin each coordinate, we conjugate all but one of the φt s by a translation\nof C. Varying over the two\nPdimensional family of translations of C, independently in each one of the (kj − 1)Pconjugations, we obtain a family of loops\nin Ham(M, ω) that depends on 2 (kj − 1) real parameters and such that\nthe original circle action corresponds to the origin in the parameter space\n\n\f6\n\nY. KARSHON AND J. SLIMOWITZ\nP\n\nR2 (kj −1) . An explicit computation\nthen shows that the Hofer length of\nP\nthese loops, as a function on R2 (kj −1) , achieves its maximum at the origin,\nand its Hessian is negative definite at the origin. This confirms one direction\nof a prediction for the index that was made by Yasha Savelyev.\nRemark 1.2. While completing this paper, we learned that Savelyev [21] can\nnow confirm his conjecture with the methods of Ustilovsky [24].\n\nThis paper is the outgrowth of a joint project that took place in the years\n1999-2001. Yael Karshon takes the responsibility for any errors that might\nbe present.\nAcknowledgement We thank Leonid Polterovich for inspiring conversations and helpful suggestions. We thank Yasha Savelyev for suggesting to\ncompute the index of the Hofer length functional and telling us his conjecture for its value. We also thank Fabian Ziltener and Brian Lee for helpful\ndiscussions. Finally, we are grateful to the referee for his or her extremely\nthorough report and numerous helpful comments.\n\n2. Preliminaries\nThe purpose of this section is to remind equivariant symplectic geometers\nof facts about time-dependent Hamiltonian flows and to remind symplectic\ntopologists of facts about momentum maps.\nHamiltonian isotopies. Let (M, ω) be a symplectic manifold. A smooth\npath of symplectomorphisms is a map t 7→ ψt , from an interval I to the\ngroup of symplectomorphisms of (M, ω), such that the map (t, m) 7→ ψt (m)\nfrom I × M to M is smooth. Such a path is a Hamiltonian isotopy if its\nd\nψt = Xt ◦ ψt , is generated by a smooth\nvelocity vector field, defined by dt\nfunction H : I × M → R, by Hamilton's equations dHt = −ι(Xt )ω, where\nHt (*) = H(t, *). The function H = {Ht }t∈I is called the Hamiltonian. If the\nHamiltonian isotopy {ψt } is compactly supported, its Hofer length is\n\u0013\nZ \u0012\nlength{ψt }t∈I =\nmax Ht (x) − min Ht (x) dt.\nx∈M\n\nx∈M\n\nI\n\nA symplectomorphism is Hamiltonian if it can be connected to the identity\nmap by a Hamiltonian isotopy.\n\n\fSHORTENING HOFER LENGTH OF CIRCLE ACTIONS\n\n7\n\nThe positive and negative Hofer length functionals. Suppose that M\nis compact. The Hamiltonian {Ht } is normalized if\nZ\nHt ω n = 0 for all t.\nM\n\nThe positive Hofer length functional associated to a Hamiltonian isotopy\n{φt }a≤t≤b in Ham(M, ω) is the number\nZ b\nmax Ht dt\nl+ (φ) =\na\n\nM\n\nwhere {Ht }a≤t≤b is the normalized Hamiltonian that generates the isotopy.\nThe negative Hofer length functional is, similarly,\nZ b\nmax −Ht dt.\nl− (φ) =\na\n\nM\n\nThe Hofer length of φ is then l+ (φ) + l− (φ).\n\nConjugation. If {ψt } is a Hamiltonian isotopy, generated by {Ht }, and b\nis a symplectomorphism, then {bψt b−1 } is a Hamiltonian isotopy, generated\nby {Ht ◦ b−1 }. If Ht is normalized then Ht ◦ b−1 is also normalized.\nReparametrization. Let {ψt } be a Hamiltonian isotopy, generated by a\nfunction {Ht }. Let t = t(τ ) be a smooth function. Then ψ τ := ψt(τ ) is a\ndt\nHamiltonian isotopy, generated by the product H τ := Ht(τ ) dτ\n.\nd\nIndeed, let ξt be the vector field that generates the isotopy, so that dt\nψt =\ndt\ndt\nξt ◦ ψt and dHt = −ι(ξt )ω. Let ξ τ = ξt(τ ) dτ\n. Then dH τ = dHt(τ ) dτ\n=\nd\nd\ndt\n−ι(ξ τ )ω and dτ ψ τ = dt ψt |t=t(τ ) dτ = ξ τ ◦ ψ τ .\nComposition and inverse. If {ψtK }t∈I is a Hamiltonian isotopy generated\nby {Kt }t∈I , and {ψtF }t∈I is a Hamiltonian isotopy generated by {Ft }t∈I , then\n{ψtK ◦ ψtF }t∈I is a Hamiltonian isotopy generated by {Kt + Ft (ψtK )−1 }t∈I ,\n−1 is a Hamiltonian isotopy generated by −K ◦ ΨK . If K and F\nand (ΨK\nt\nt\nt\nt\nt )\n\u0001−1\n.\nand −Kt ◦ ΨK\nare normalized, so are Kt + Ft ψtK\nt\nThe group of Hamiltonian symplectomorphisms is denoted Ham(M, ω).\nPaths in the Hamiltonian group. If {ψt } is a smooth path in the group\nof symplectomorphisms of (M, ω), and for each t the symplectomorphism ψt\nis in the subgroup Ham(M, ω), then {ψt } is a Hamiltonian isotopy. This is\na result due to Banyaga [2, p.190, prop. II.3.3]. In textbooks, the proof is\noften omitted or is intertwined with proofs of more difficult facts. We recall\nthe proof.\nd\nψt = ξt ◦ψt . The path {ψt }\nLet ξt be the velocity vector field, defined by dt\nis a Hamiltonian isotopy if and only if ι(ξt )ω is exact for all t, if and only\n\n\f8\n\nY. KARSHON AND J. SLIMOWITZ\n\nRt\nif the H 1 (M ; R)-valued integral\nR xFlux({ψτ }0≤τ ≤t ) := 0 [ι(ξτ )ω]dτ is zero for\nall t. (We then set Ht (x) = − x0 ι(ξt )ω.)\nThe evaluation of the flux on a smooth loop γ : S 1 → M is equal to the\nsymplectic area of the surface γ̃ : S 1 ×[0, t] → M given by γ̃(s, τ ) := ψτ (γ(s));\nthis follows from Stokes's formula. It follows that the flux of a closed loop\nof symplectomorphisms is a class in H 1 (M ; R) whose evaluation on elements\nof H1 (M ; Z) takes values in the countable set hω, H2 (M ; Z)i. Such classes\nmake up a countable subgroup of H 1 (M ; R).\nSuppose that {ψt } is a path of symplectomorphisms and that each ψt is\nHamiltonian. Then for each t the path {ψτ }0≤τ ≤t can be completed to a\nclosed loop of symplectomorphisms by a Hamiltonian isotopy. This completion does not effect the flux. So t 7→ Flux({ψτ }0≤τ ≤t ) is a continuous map\nthat takes values in a countable subgroup of H 1 (M ; R). Such a map must\nbe constant. Since it is zero for t = 0, it is zero for all t.\nHamiltonian circle actions. Let (M, ω) be a symplectic manifold with a\ncircle action generated by a Hamiltonian H : M → R. The momentum map\nfor the circle action is the Hamiltonian H.\nThe critical points of H are the fixed points for the circle action. Let\np ∈ M be such a point. The linearized isotropy action on Tp M is linearly equivariantly symplectomorphic to Cn with the standard symplectic\nform and with the circle acting as a subgroup of (S 1 )n , namely, e2πit *\n(z1 , . . . , zn ) = (e2πik1 t z1 , . . . , e2πikn t zn ). The integers k1 , . . . , kn , which measure the speeds at which the linearized S 1 -action rotates its eigenspaces, are\ncalled the isotropy weights at p. They are unique up to permutation. This\nisomorphism Tp M ∼\n= Cn carries the Hessian of H to the quadratic form\n2\nπk1 |z1 | + . . . + πkn |zn |2 . So if H attains its maximum at p then all the\nisotropy weights at p are non-positive.\nThe equivariant Darboux theorem asserts that a neighbourhood of p in\nM is equivariantly symplectomorphic to a neighbourhood of the origin in\nTp M . In particular, if p is an isolated fixed point then the isotropy weights\nat p are all non-zero. Thus, at least one isotropy weight at p has absolute\nvalue greater than one if and only if every neighbourhood of p contains a\npoint whose stabilizer is finite and non-trivial. Also, the set Bmax where H\nis maximal is a symplectic submanifold, and the circle acts on the fibres of\nits normal bundle with negative weights.\nThe momentum map H is a Bott-Morse function with even indices and\ncoindices. Assuming that M is compact and connected, this implies that the\nlevel sets of H are connected and that preimages of intervals are connected.\nThus, the maximum of H is attained along a connected component of the\nfixed point set. If a fixed point p is a local maximum for H then it is\nalso a global maximum. If a neighbourhood of p in M is equivariantly\n\n\fSHORTENING HOFER LENGTH OF CIRCLE ACTIONS\n\n9\n\nP\nsymplectomorphic\nto the ellipsoid {z |\nkj π|zj |2 < ǫ} with the momentum\nP\n2\nmap − kj π|zj | , then this neighbourhood contains all the points in M\nwhere H is ǫ-close to its maximum.\nSee [1, 5].\n3. New results and further questions\nIn this section we state our main results. We prove them in Sections 8,\n10, and 11. We also give some examples, corollaries, and further questions.\nIn each of these results, we start with a Hamiltonian circle action, viewed\nas a loop in the group of Hamiltonian diffeomorphisms, and we deform it to a\nloop whose Hofer length is smaller. Moreover, throughout the deformation,\nthe negative Hofer length remains constant, and the positive Hofer length\neventually becomes smaller without ever becoming larger than the initial\none.\nShortening on a manifold with an isolated maximum.\nTheorem 3.1. Let (M, ω) be a compact connected symplectic manifold with\na Hamiltonian circle action. Suppose that the momentum map attains its\nmaximum at an isolated fixed point and that at least one of the isotropy\nweights at that point has absolute value greater than one. Let d be a positive\nnumber that is smaller than the gap between the two largest critical values\nof the momentum map. Then the circle action can be deformed to a loop\nin Ham(M, ω) whose Hofer length is smaller than that of the original circle\naction by 2d/9.\nRemark 3.2. In Theorem 3.1, we can choose the deformation such that the\npositive Hofer length never exceeds the initial one and the negative Hofer\nlength remains constant. Specifically, let H denote the momentum map, let\npmax denote the point where H attains its maximum, let α denote the gap\nbetween the two largest critical values of H, and consider the subset of M\ngiven by\n{m | H(m) > H(pmax ) − α}.\n\n(3.3)\n\nWe can choose the deformation such that the normalized deformed Hamiltonians remain greater than H(pmax ) − α on the set (3.3) and coincide with H\noutside this set.\nRemark 3.4. In Theorem 3.1, we actually obtain a better estimate than 29 d.\nIf one of the isotropy weights is even then we can shorten by 14 d. Otherwise,\nlet −k1 be the weight whose absolute value is largest; then we can shorten\nby 14 (1 − k12 )d. When k1 = 3, this becomes 92 d.\n1\n\n\f10\n\nY. KARSHON AND J. SLIMOWITZ\n\nThis is the first quantitative result for shortening of loops in Ham(M, ω)\nthat are effective circle actions. We prove it in Section 8.\nThe estimate of Theorem 3.1 is far from sharp, as we see in the following\nexample.\nExample 3.5. Let a, b be positive integers that are relatively prime. Let\ne2πit ∈ S 1 act on CP2 by [u, z, w] 7→ [u, e−2πita z, e2πitb w], with the FubiniStudy form normalized such that the momentum map is (−a|z|2 +b|w|2 )/(|u|2 +\n|z|2 + |w|2 ) + constant. The Hofer length of this action is a + b. The isotropy\nweights at the maximum are −b, −(a + b); the isotropy weights at the minimum are a, a + b. Applying the shortening result of Theorem 3.1 and the\nanalogous result with maximum replaced by minimum, for any ǫ > 0 we\ncan deform the circle action to a loop of Hofer length < 7/9(a + b) + ǫ.\nThis upper bound is greater than one. But the action can be deformed to\na loop of Hofer length one or zero, so the bound is not optimal. (To see\nthat the action can be deformed to a loop of Hofer length one or zero, notice that the action extends to an action of PU(3), that π1 (PU(3)) ∼\n= Z/3Z,\nand that the non-trivial elements of π1 (PU(3)) are represented by the actions [u, z, w] 7→ [u, e−2πit z, w] and [u, z, w] 7→ [u, z, e2πit w], which have Hofer\nlength equal to one.)\nRemark 3.6. The above example is inspired by Proposition 1.3 of the paper [16] of McDuff and Tolman: if G is a compact Lie group with trivial\ncentre and M is a coadjoint orbit of G, then every non-trivial element of\nπ1 (G) is represented by a sub-circle of G that acts on M semi-freely.\nShortening on a manifold with an arbitrary maximum.\nRecall that, on a compact connected symplectic manifold with a Hamiltonian circle action, the set where the momentum map is maximal is a\nconnected symplectic submanifold.\nIn the following theorem, a subset B of a symplectic manifold M is symplectically k-displaceable in a neighbourhood V if there exist k symplectomorphisms b1 , . . . , bk of M , each connected to the identity through a path of\nsymplectomorphisms supported in V , such that B ∩ b1 (B) ∩ . . . ∩ bk (B) = ∅.\nIn the symplectic literature, \"B is displaceable\" often means that there\nexists a Hamiltonian symplectomorphism g such that B ∩ g(B) = ∅. Thus,\na set can be symplectically k-displaceable in every neighbourhood without\nbeing displaceable (even when k = 1).\nTheorem 3.7. Let (M, ω) be a compact connected symplectic manifold with\na Hamiltonian circle action. Let Bmax be the set where the momentum map\nis maximal. Let −k1 , . . . , −ks denote the distinct weights for the circle action\non the normal bundle of Bmax , and let k := min{k1 , . . . , ks } − 1. Suppose\n\n\fSHORTENING HOFER LENGTH OF CIRCLE ACTIONS\n\n11\n\nthat Bmax is symplectically k-displaceable in every neighbourhood. Then the\ncircle action can be deformed through loops in Ham(M, ω) into a loop of\nsmaller Hofer length.\nRemark 3.8. In Theorem 3.7, we can choose the deformation such that the\npositive Hofer length never exceeds the initial one and the negative Hofer\nlength remains constant. Specifically, let H denote the momentum map. For\nevery positive number α, we can choose the deformation such that the normalized deformed Hamiltonians remain between H(Bmax ) − α and H(Bmax )\non the set {m ∈ M | H(m) > H(Bmax ) − α} and coincide with H outside\nthis set.\nIn practice, the easiest way to show that a symplectic submanifold is\nsymplectically k-displaceable in every neighbourhood is to show that its normal bundle has k sections that are nowhere all vanishing. (k-displaceability\nthen follows from the symplectic tubular neighbourhood theorem (9.5) and\nLemma 9.10.) More generally, we have the following theorem.\nTheorem 3.9. Let (M, ω) be a compact connected symplectic manifold with\na Hamiltonian circle action. Let Bmax be the set where the momentum map\nis maximal. Let E ′ → Bmax be an S 1 -invariant subbundle of the normal\nbundle to Bmax in M , and let −k1′ , . . . , −ks′ ′ be the distinct weights for the\ncircle action on E ′ . Let\nk′ = min{k1′ , . . . , ks′ ′ } − 1.\nSuppose that\n(3.10)\n\nE ′ has k′ sections that are nowhere all vanishing.\n\nThen the circle action can be deformed through loops in Ham(M, ω) into a\nloop of smaller Hofer length.\nRemark 3.11. In Theorem 3.9, we can choose the deformation such that\nthe positive Hofer length never exceeds the initial one and the negative\nHofer length remains constant. Specifically, let H denote the momentum\nmap. For every positive number α, we can choose the deformation such that\nthe normalized deformed Hamiltonians remain between H(Bmax ) − α and\nH(Bmax ) on the set {m ∈ M | H(m) > H(Bmax ) − α} and coincide with H\noutside this set.\nTheorem 3.9 has the following corollaries.\nCorollary 3.12. Let (M, ω) be a compact symplectic manifold with a Hamiltonian circle action. Let Bmax be the subset of M where the momentum map\nattains its maximum. Let E denote the normal bundle of Bmax in M and\n−k1 , . . . , −ks the distinct weights for the circle action on E. Suppose that\none of the following conditions holds.\n\n\f12\n\nY. KARSHON AND J. SLIMOWITZ\n\n(1) The normal bundle of Bmax in M has a trivial sub-bundle on which\nthe circle acts with a weight of absolute value ≥ 2.\n(In particular, this holds under the assumptions of Theorem 3.1.)\n(2) We have\ndim Bmax\nkj > 1 +\ncodim Bmax\nfor all j ∈ {1, . . . , s}.\n(3) After a possible relabeling, assume that k1 < . . . < ks . Let Ej denote\nthe sub-bundle where the circle acts with weight −kj . There exists\nj ∈ {1, . . . , s} such that\n(kj − 1) rank(Ej ⊕ . . . ⊕ Es ) > dim Bmax .\n(For j = 1, this condition amounts to case (2).)\nThen the circle action can be deformed through loops in Ham(M, ω) to a loop\nof smaller Hofer length.\nMoreover, we can choose a deformation with the properties described in\nRemark 3.11.\nProof of Corollary 3.12. In each of the three cases, (3.10) holds for an appropriate choice of sub-bundle E ′ :\n(1) Let E ′ be a trivial sub-bundle of E on which S 1 acts with a weight\n−k1′ of absolute value k1 ≥ 2. Then k′ = k1′ − 1 ≥ 1, and (3.10) holds\nbecause E ′ is trivial.\n(2) Let E ′ = E. Then rank E ′ = codim Bmax . Our assumption on the\ndim Bmax\n′\n′\nweights give k′ > codim\nBmax . So k rank E > dim Bmax , and (3.10)\nholds for generic sections.\n(3) Let E ′ = Ej ⊕ . . . ⊕ Es . Then k′ = kj − 1. The assumption on\nthe weights gives k′ rank E ′ > dim Bmax , and again (3.10) holds for\ngeneric sections.\nIn each of these cases, the shortening result follows from Theorem 3.9. \u0003\nRemark 3.13. Let k and k′ be as in Theorems 3.7 and 3.9. Existence of k′\nsections of E ′ that are nowhere all vanishing does not necessarily imply the\nexistence of k sections of E that are nowhere all vanishing, because k′ can\nbe larger than k. So Theorem 3.9 does not follow from Theorem 3.7.\nRemark 3.14. Informally, the assumptions of Theorems 3.7 and 3.9 and\nCorollary 3.12 mean that the normal bundle is \"sufficiently untwisted\".\nRemark 3.15. There seems to be an interesting relationship with the work\nof McDuff-Tolman. In the terminology of Section 1.1 of McDuff-Tolman's\npaper [15], the component Bmax is homologically visible if and only if the\nEuler class of the obstruction bundle (E1 ⊗ Ck1 −1 ) ⊕ . . . ⊕ (Es ⊗ Cks −1 )\n\n\fSHORTENING HOFER LENGTH OF CIRCLE ACTIONS\n\n13\n\nis non-zero. Here, k1 , . . . , ks are the weights of the circle action on the\nnormal bundle, and Ej is the subbundle on which the circle acts with weight\nkj . By Theorem 1.2 of [15], if Bmax is homologically visible then the circle\naction is non-contractible in Ham(M, ω). (We are not sure whether Bmax\nbeing homologically visible further implies that the circle action is minimal\namong homotopic loops. Proposition 3.3 of [15] might be relevant.) The\ncondition (3.10) of our Theorem 3.9 implies that Bmax is not homologically\nvisible. (k′ sections of E ′ that are nowhere all vanishing can be considered\n′\nas a non-vanishing section of E ′ ⊗ Ck . Writing E ′ = E1′ ⊕ . . . ⊕ Es′ where\nthe circle acts on Ej′ with weight kj , we get a nonvanishing section of (E1′ ⊗\n′\n′\nCk ) ⊕ . . . ⊕ (Es′ ′ ⊗ Ck ). Because k′ ≤ kj′ − 1 for all j = 1, . . . , s′ , we get\n′\n′\na non-vanishing section of (E1′ ⊗ Ck1 −1 ) ⊕ . . . ⊕ (Es′ ′ ⊗ Cks −1 ). Because\nthis is a subbundle of the obstruction bundle, the obstruction bundle has a\nnon-vanishing section, and hence its Euler class is zero.)\nWe prove Theorems 3.7 and 3.9 in Section 10. These are the first shortening results that apply to situations when the maximum is not necessarily\ndisplaceable.\nExample 3.16. Let e2πit ∈ S 1 act on CP4 by\n[z0 , z1 , z2 , z3 , z4 ] 7→ [z0 , z1 , e−2πit z2 , e−2πit*2 z3 , e−2πit*3 z4 ],\nwith momentum map (−|z2 |2 − 2|z3 |2 − 3|z4 |2 )/(|z0 |2 + |z1 |2 + |z2 |2 + |z3 |2 +\n|z4 |2 ) + constant. The momentum map attains its maximum along the submanifold Bmax = {[z0 , z1 , 0, 0, 0]}, which is isomorphic to CP1 . The negative\nisotropy weights along Bmax are −1, −2, −3. The momentum map attains\nits minimum at the isolated fixed point [0, 0, 0, 0, z4 ]. The isotropy weights\nat the minimum are 1, 2, 3, 3. In the notation of item (3) of Corollary 3.12,\napplied at Bmax , we have the following values.\nj kj\n1 1\n2 2\n3 3\n\nrank Ej\n2\n2\n2\n\nWe can apply item (3) of Corollary 3.12 to either E2 ⊕ E3 or E3 . Also\napplying Theorem 3.1 at the minimum, we conclude that the circle action can be deformed to a loop whose positive Hofer length and negative\nHofer length are both smaller. Nevertheless, the circle action is not contractible in Ham(M, ω): it is homotopic (in PU(5)) to the circle action\n[z0 , z1 , z2 , z3 , z4 ] 7→ [e−2πit z0 , z1 , z2 , z3 , z4 , z5 ], which is semi-free and thus\nnon-contractible (by item (1) on p. 2).\n\n\f14\n\nY. KARSHON AND J. SLIMOWITZ\n\nThe index of the Hofer positive length functional.\nTheorem 3.17. Let (M, ω) be a 2n dimensional compact connected symplectic manifold with a Hamiltonian circle action. Suppose that the momentum\nmap attains its maximum at an isolated fixed point. Let −k1 , . . . , −kn be\nthe isotropy weights at the maximum, with possible\nrepetitions. Then there\nP\nexists a neighbourhood D of the origin in R 2(kj −1) , and, for each λ ∈ D,\n(λ)\na loop {ψt }0≤t≤1 in Ham(M, ω), such that the following properties hold.\n(0)\nFor λ = 0, the loop {ψt }0≤t≤1 is the given circle action. The function\n(λ)\nλ 7→ length({ψt }) is smooth, λ = 0 is a critical point of this function, and\nthe Hessian of this function at λ = 0 is negative definite.\nRemark 3.18. In fact, we can choose the deformation such that the negative\nHofer length remains constant. Specifically, let H denote the momentum\nmap, and let pmax denote the point where H attains its maximum. For every\npositive number α, we can choose the deformation such that the normalized\ndeformed Hamiltonian remains between H(pmax ) − α and H(pmax ) on the\nset {m ∈ M | H(m) > H(pmax ) − α} and coincides with H outside this set.\nSavelyev [19, 20], in the setup of Theorem 3.17, predicted that the index\nof the positive Hofer length functional on the space\nP of loops in Ham(M, ω)\nat the given Hamiltonian circle action is equal to\n2(ki − 1). Theorem 3.17\nis a sense\nin\nwhich\nthe\nindex\nof\nthe\npositive\nHofer\nlength functional is at\nP\n2(k\n−\n1).\nSo\nTheorem\n3.17\nconfirms\nthe\n≥\ndirection of Savelyev's\nleast\ni\ni\nprediction. (But see Remark 1.2.)\nFurther questions.\n(1) Are there examples where the estimate of Theorem 3.1 is sharp?\n(2) Can the estimate of Theorem 3.1 be improved in the presence of high\nisotropy weights?\nAs noted by Polterovich, this question is also interesting for noneffective circle actions obtained by iterating an effective circle action,\nas it may provide information on the asymptotic norm of the homotopy class of the effective circle action (see [18]).\n(3) Under the assumptions of Theorem 3.7 or of Theorem 3.9, can one\nobtain a quantitative estimate?\n(4) In Theorem 3.9, can the condition (3.10) be replaced by the condition\nthat Bmax not be homologically visible? (Cf. Remark 3.15.)\n(5) Can Theorem 3.17 be extended to cases in which the maximum is\nattained along a manifold of positive dimension?\n(6) Savelyev's prediction for the index of the positive Hofer length functional is an even number. Polterovich expects the index to be even in\n\n\fSHORTENING HOFER LENGTH OF CIRCLE ACTIONS\n\n15\n\nadditional cases. On a compact connected manifold, a Morse function with even indices and coindices has nice topological properties:\nevery local minimum is a global minimum, and the level sets are\nconnected. Palais-Smale-Morse theory does not apply to the space\nof loops in Ham(M, ω), but we may seek analogies.\nIf a loop in the Hamiltonian group is a local minimum for the\npositive Hofer length functional, is it also a global minimum in its\nhomotopy class?\nSuppose that a homotopy class in π1 (Ham(M, ω)) contains two\ncircle actions that are semi-free near the set where the momentum\nmap is maximal. (Cf. item (1) on p. 2.) Can we deform one to the\nother through loops of constant positive Hofer length?\n4. Shortening a non-effective circle action\nTo warm up, we describe a procedure, which we learned from Leonid\nPolterovich, for shortening a non-effective Hamiltonian circle action by displacing the set where its momentum map is maximal.\nLet H : M → R be a time independent Hamiltonian. Suppose that 21 H\ngenerates a circle action, {φt }0≤t≤1 , so that H generates the non-effective\ncircle action\n(4.1)\n\nψtH = φ2t = φt ◦ φt .\n\nLet b : M → M be a symplectomorphism. Then\n(4.2)\n\nψtH := {φt b φt b−1 }0≤t≤1\n\nis a loop in Ham(M ), based at the identity, and generated by the Hamiltonian\n1\n1\nH t = H + Hb−1 φ−1\n(4.3)\nt .\n2\n2\nIf H is normalized, so is H t .\nIf b can be connected to the identity through a path of symplectomorphisms, then the loop (4.2) is a deformation of the loop (4.1). Since H t (x) ≤\nmax H and H t (x) ≥ min H for all x ∈ M and all t,\n(4.4)\n\nlength({ψtH }) ≤ length({ψtH }),\n\nand this is a strict inequality if max H t < max H for some t.\nH\nDenote by Bmax\nthe subset of M where H takes its maximal value. If\nH\nH\nBmax ∩ b(Bmax ) = 0 then, for t = 0, the maximum of H 0 = 21 H + 12 Hb−1 is\nstrictly smaller than that of H.\nWe have shown that, if there exists a symplectic isotopy that displaces\nthe set where the momentum map is maximal, then the non-effective circle\naction can be deformed to a loop of shorter Hofer length. A similar argument\n\n\f16\n\nY. KARSHON AND J. SLIMOWITZ\n\ngives a quantitative result: if there exists a symplectic isotopy that displaces\nthe set where the momentum map is ǫ-close to its maximum, then the noneffective circle action can be deformed to a loop whose Hofer length is shorter\nby ǫ from that of the original circle action.\n5. Shortening a combined action\nIn this section we give variations of Polterovich's trick that apply to effective circle actions. We begin with a lemma that we will use to prove\nTheorem 3.1. The lemma has two parts – a qualitative part and a quantitative part.\nWe say that a symplectomorphism b disjoins a set A from a set B if\nb(A) ∩ B = ∅.\nLemma 5.1. Let (M, ω) be a compact symplectic manifold. Let H : M → R\nbe the momentum map for a circle action {ψtH }0≤t≤1 . Let\ni : (U, ω0 ) → (M, ω)\nbe an open symplectic embedding. Suppose that\ni∗ H = K + F\n\n(5.2)\n\non U ,\n\nwhere K and F generate commuting circle actions {ψtK }0≤t≤1 and {ψtF }0≤t≤1\non U .\nLet N̂ : U → R be a function that Poisson commutes with K and F and\nsatisfies\ninf (K + F ) =\n\n(5.3)\n\ninf K + inf F\nN̂ −1 (α)\n\nN̂ −1 (α)\n\nfor every α ∈ R.\n\nN̂ −1 (α)\n\nAlso suppose that\n(5.4)\n\ni(U ) does not meet the set where H is minimal.\n\n(1) Let\nH\nBmax\n= {m ∈ M | H is maximal at m },\nK\nBmax\n= {u ∈ U | K is maximal at u },\nF\nBmax\n= {u ∈ U | F is maximal at u }.\n\nand\nSuppose that\n(5.5)\n\nH\nBmax\n⊂ i(U )\n\nand\n\nK\nF\nBmax\n∩ Bmax\n6= ∅.\n\nSuppose that there exists a symplectomorphism b : U → U that disK and such that b can be connected to the identity\nF\nfrom Bmax\njoins Bmax\nthrough a path of symplectomorphisms that are compactly supported\nin U and that preserve the function N̂ .\n\n\fSHORTENING HOFER LENGTH OF CIRCLE ACTIONS\n\n17\n\nThen the circle action {ΨH\nt } can be deformed, through loops in\nH\nHam(M, ω), to a loop {Ψt } whose Hofer length is smaller.\n(2) Let ǫ > 0. Let\nNǫH = {m ∈ M | H(m) > max H − ǫ},\nNǫK = {u ∈ U | K(u) > max K − ǫ},\nNǫF = {u ∈ U | F (u) > max F − ǫ}.\n\nand\nSuppose that\n(5.6)\n\nNǫH ⊂ i(U )\n\nand\n\nK\nF\nBmax\n∩ Bmax\n6= ∅.\n\nSuppose that there exists a symplectomorphism b : U → U that disjoins NǫF from NǫK and such that b can be connected to the identity\nthrough a path of symplectomorphisms that are compactly supported\nin U and that preserve the function N̂ .\nThen the circle action {ΨH\nt } can be deformed, through loops in\nH\nHam(M, ω), to a loop {Ψt } whose Hofer length is smaller than that\nof {ΨH\nt } by at least ǫ.\nIn each of these two cases, the deformation can be chosen such that the normalized deformed Hamiltonians remain between inf H(i(U )) and max H(M )\non the set i(U ) and coincide with H outside this set, so the positive Hofer\nlength never exceeds the initial one and the negative Hofer length remains\nthe same throughout the deformation.\nProof. Because K and F generate commuting circle actions, K ◦ ψtF = K\nand F ◦ ψtK = F for all t.\nH ⊂ i(U ), i∗ H = K + F , and B K ∩ B F\nBecause Bmax\nmax\nmax 6= ∅,\n\u0001\nH\nK\nF\n(5.7)\nBmax\n= i Bmax\n∩ Bmax\n.\nLet b : U → U be a compactly supported symplectomorphism of U .\nThe loop\n(\n\u0001\ni ◦ ψtK ◦ bψtF b−1 ◦ i−1 on i(U )\nH\nψt =\noutside i(U )\nψtH\n\nis generated by the Hamiltonian H t : M → R that is given by\n(\n\u0001\nK + F b−1 (ψtK )−1 ◦ i−1 on i(U )\nHt =\n(5.8)\nH\noutside i(U ).\nIf H is normalized, so is H t .\nIf b can be connected to the identity through a compactly supported symplectic isotopy, then the loop {ψtH } is a deformation of the loop {ψtH } in\nHam(M, ω).\n\n\f18\n\nY. KARSHON AND J. SLIMOWITZ\n\nBy (5.7) and (5.8), we have max H t ≤ max H for all t. So the positive\nHofer length of {ψtH } does not exceed that of the circle action {ψtH }.\nIf b preserves N̂ , then, by (5.3), (5.4), (5.8), and because ψtK preserves N̂ ,\nwe have min H t = min H for all t. So the negative Hofer length of {ψtH } is\nequal to that of the circle action {ψtH }.\nF\nK . Then, for t = 0, we have\nSuppose that b disjoins Bmax\nfrom Bmax\n−1\nmax H 0 = max(K + F b ) < max K + max F = max H. This strict inK ∩ B F b−1 , being equal to B K ∩ b(B F ), is empty.\nequality is because Bmax\nmax\nmax\nmax\n(In fact, max H t < max H for all t; this follows from K + F b−1 (ψtK )−1 =\nF ) = ∅.) Because the inequality\nK\n∩ b(Bmax\n(K + F b−1 )(ψtK )−1 and Bmax\nmax H t ≤ max H holds for all t and is strict for t = 0, the positive Hofer\nlength of {ψtH } is strictly smaller than that of the circle action {ψtH }.\nThis completes the proof of the first, qualitative, part of the lemma.\nTo prove the second, quantitative, part of the lemma, suppose now that\nb disjoins NǫF from NǫK , let m be a point in M , and we will show that\nH t (m) ≤ max H − ǫ for all t.\nSuppose that m is not in i(U ), and, thus, also not in NǫH . Then H t (m) =\nH(m) and H(m) ≤ max H − ǫ, so\nH t (m) ≤ max H − ǫ.\nNow suppose that m is in i(U ), say, m = i(u) for u ∈ U . By (5.8),\nH t (m) = K(u) + F (u′ )\nwhere u′ = b−1 (ψtK )−1 (u). If H t (m) is ǫ-close to max H, then u ∈ NǫK and\nu′ ∈ NǫF , that is,\n(5.9)\n\nu ∈ NǫK ∩ ψtK (b(NǫF )).\n\nBecause K = K ◦ ψtK , The set NǫK is preserved under ψtK , so we can\nrewrite (5.9) as u ∈ ψtK (NǫK ∩ b(NǫF )). But, by assumption, NǫK ∩ b(NǫF ) is\nempty. So H t (m) cannot be ǫ-close to max H, and again we conclude that\nH t (m) ≤ max H − ǫ. So H t (m) ≤ max H − ǫ for all m ∈ M and for all t.\nSince H t is normalized, we conclude that the positive Hofer lengths satisfy\n\u0003\nl+ ({ψtH }) ≤ l+ ({ψtH }) − ǫ, as required.\nThe second, quantitative, part of Lemma 5.1 does not automatically extend to more than two summands. The first, qualitative, part does extend\nto more than two summands. We now give such an extension. We will use\nit to prove Theorems 3.7 and 3.9.\nLemma 5.10. Let (M, ω) be a compact symplectic manifold. Let H : M → R\nbe the momentum map for a circle action {ψtH }0≤t≤1 . Let\ni : (U, ω0 ) → (M, ω)\n\n\fSHORTENING HOFER LENGTH OF CIRCLE ACTIONS\n\n19\n\nbe an open symplectic embedding. Suppose that\ni∗ H = H(0) + H(1) + . . . + H(k)\n\n(5.11)\n\non U\n\nwhere H(0) , H(1) , . . . , H(k) generate commuting circle actions on U .\nLet\nH\nBmax\n= {m ∈ M | H is maximal at m}\nand, for each 0 ≤ j ≤ k,\n(j)\nBmax\n= {u ∈ U | H(j) is maximal at u}.\n\nSuppose that\nH\nBmax\n⊂ i(U )\n\n(5.12)\n\nand\n\n(0)\n(1)\n(k)\nBmax\n∩ Bmax\n∩ . . . ∩ Bmax\n6= ∅.\n\nSuppose that\nk\n\u0001 X\ninf H(j)\ninf H(0) + H(1) + . . . + H(k) =\n\n(5.13)\n\nU\n\nand that\n(5.14)\n\nj=0\n\nU\n\ni(U ) does not meet the set where H is minimal.\n\nSuppose that there exist symplectomorphisms b1 , . . . , bk of U such that\n(0)\n(1)\n(k)\nBmax\n∩ b1 (Bmax\n) ∩ . . . ∩ bk (Bmax\n)=∅\n\n(5.15)\n\nand such that each bj can be connected to the identity through a path of\nsymplectomorphisms that is compactly supported in U .\nThen the circle action {ψtH } can be deformed, through loops in Ham(M, ω),\nto a loop {ψ t } whose Hofer length is smaller.\nThe deformation can be chosen such that the normalized deformed Hamiltonians remain between inf H(i(U )) and max H(M ) on the set i(U ) and\ncoincide with H outside this set, so the positive Hofer length never exceeds\nthe initial one and the negative Hofer length remains the same.\nProof. Denote by\n(0)\n\n(k)\n\n{ψt }0≤t≤1 , . . . , {ψt }0≤t≤1\nthe circle actions on U that are generated by H(0) , . . . , H(k) . Let b1 , . . . , bk\nbe arbitrary compactly supported symplectomorphisms of U . For each j ∈\n{0, . . . , k}, let\n\u0011\n\u0010\n\u0011\n\u0010\n(j)\n(1)\n(0)\n(j) −1\n.\n(5.16)\nb\nψ t := ψt ◦ b1 ψt b−1\n◦\n*\n*\n*\n◦\nb\nψ\nj t\n1\nj\nThis is a loop in Ham(U, ω0 ). We have the following three facts:\n(j)\n\n(1) {ψ t } is generated by the Hamiltonian\n(5.17)\n\n(j)\n\n(0)\n\n(j−1) −1\n\n−1\nH t := H(0) + H(1) b−1\n+ . . . + H(j) b−1\n1 (ψ t )\nj (ψ t\n\n)\n\n.\n\n\f20\n\nY. KARSHON AND J. SLIMOWITZ\n\n(2) Outside a compact subset of U ,\n(j)\n\nψt\n\n(0)\n\n= ψt\n\n(1)\n\n◦ ψt\n\n(j)\n\n◦ . . . ◦ ψt\n\nand\n\n(j)\n\nH t = H(0) + H(1) + . . . + H(j) .\n\n(3) For all t,\nZ \u0010\n\u0011\n(j)\n(5.18)\nH t − (H(0) + H(1) + . . . + H(j) ) ω0n = 0.\nU\n\nFacts (1) and (2) are shown by induction on j. As for Fact (3), by (5.17),\nthe left hand side of (5.18) is the sum over m = 1, . . . , j of\nZ\nZ\n\u0010\n\u0011\n(m−1) −1\n−1\nn\nH(m) ω0n .\nH(m) ◦ bm ◦ (ψ t\nω0 −\n(5.19)\n)\nU\n\nU\n\n(m−1)\n\nThe map b−1\n)−1 is a symplectomorphism, so it preserves the volume\nm ◦(ψ t\nform ω0n , and so (5.19) vanishes.\nBy the above items (1) and (2), we can define a loop in Ham(M, ω) by\n(\n(k)\ni ◦ ψ t ◦ i−1 on i(U )\nψ t :=\non M r i(U ),\nψtH\nand it is generated by the Hamiltonian\n(\n(k)\nH t ◦ i−1 on i(U ),\nH t :=\n(5.20)\nH\non M r i(U ).\nBy the above item (3), if H is normalized, so is H t .\nFrom (5.11), (5.13), (5.14), (5.17), and (5.20), we deduce that min H t =\nM\n\nmin H. So the negative Hofer length of {ψ t } is equal to that of the circle\nM\n\naction {ψtH }.\nFrom (5.11), (5.12), (5.17), and (5.20), we see that max H t ≤ max H for\nM\n\nM\n\nall t, with a strict inequality when t = 0 if b1 , . . . , bk satisfy (5.15). InteR1\nR1\ngrating, we get the inequality 0 max H t dt ≤ 0 max Hdt, and if b1 , . . . , bk\nM\n\nM\n\nsatisfy (5.15) then this inequality is strict (because in this case the pointwise inequality between the integrands is strict in a neighbourhood of t = 0).\nThat is, the positive Hofer length of {ψ t } does not exceed that of {ψtH }, and,\nif b1 , . . . , bk satisfy (5.15), then the positive Hofer length of {ψ t } is strictly\nsmaller than that of {ψtH }.\nThe lemma is obtained by applying this argument as b1 , . . . , bk vary over\nsmooth paths of symplectomorphisms that start with the identity, are compactly supported in U , and end with b1 , . . . , bk that satisfy (5.15).\n\u0003\n\n\fSHORTENING HOFER LENGTH OF CIRCLE ACTIONS\n\n21\n\n6. Disjoining discs in C\nFor every neighbourhood of the origin in C, there exists a Hamiltonian\nisotopy, supported in this neighbourhood, that disjoins the origin from itself.\nSuch an isotopy can be generated by a function F : C → R whose Hamilton∂\non a\nian vector field is zero outside the given neighbourhood, is equal to − ∂x\n∂\nneighbourhood of the origin, and is equal to a non-negative multiple of − ∂x\neverywhere on the x-axis. For example, if the given neighbourhood contains\nthe set {z | π|z|2 ≤ 3ǫ}, we may take the function F (z) = y ρ(π|z|2 /ǫ − 1)\nwhere y is the imaginary part of z and where ρ(s) is equal to one for s ≤ 0,\nR1 − 1\nR1 − 1\nto zero for s ≥ 1, and to ( s e τ (1−τ ) dτ )/( 0 e τ (1−τ ) dτ ) for 0 ≤ s ≤ 1.\nFor our quantitative results we will need to keep track of the sizes of\nneighbourhood of the origin that get disjoined. We do so in the following\nlemma.\nLemma 6.1. There exists a smooth family of functions\nFtA,ǫ : C → R\n\n,\n\n0 ≤ t ≤ 1,\n\nparametrized by A ≥ 0 and 0 < ǫ < 1, such that FtA,ǫ (z) = 0 for z outside the\ndisc {z | π|z|2 < 1 + A + ǫ} and such that the Hamiltonian flow bA,ǫ\nt : C→C\nA,ǫ\n2\nof Ft , at time t = 1, carries the disc {z | π|z| ≤ 1} into the annulus\n{z | A < π|z|2 < 1 + A + ǫ}.\nRemark 6.2. Smooth family means that the function (A, ǫ, t, z) 7→ FtA,ǫ (z)\nfrom [0, ∞) × (0, 1) × [0, 1] × C to R is smooth in the usual sense. It follows\nthat the function (A, ǫ, t, z) 7→ bA,ǫ\nt (z) is smooth.\nLemma 6.1 is used in the next section, in the proof of Lemma 7.1. The\nrest of this section is devoted to the proof of Lemma 6.1. The reader may\nskip the proof and proceed to the next section.\nLemma 6.3. There exists a smooth family of (time independent) functions\nH ǫ : C → R, parametrized by 0 < ǫ < 1, whose Hamiltonian flows bǫt have\nthe following properties.\n• For every t, the diffeomorphism bǫt is the identity map outside the\ndisc\n{z | π|z|2 < 1 + ǫ}.\n\n(6.4)\n\n• For t > 1, the diffeomorphism bǫt carries the disc\n{z | π|z|2 ≤ 1}\n\n(6.5)\ninto the slit disc\n(6.6)\n\n{z | π|z|2 < 1 + ǫ} r the non-negative x-axis.\n\n\f22\n\nY. KARSHON AND J. SLIMOWITZ\n\nProof. We choose H ǫ such that, for each ǫ, the Hamiltonian vector field of\n∂\non the segment [0, √1π ]\nH ǫ is zero outside the disc (6.4), is equal to − √1π ∂x\n∂\nof the x-axis, and is equal to a non-negative multiple of − ∂x\non the rest of\nthe x-axis.\nFor example, we may take H ǫ (z) = √1π yρ((π|z|2 − 1)/ǫ) where y is the\nimaginary part of z and where ρ(s) is equal to 1 for s ≤ 0, to 0 for s ≥ 1,\nand is non-negative.\nǫ , at times\nFor each t, the Hamiltonian\nq flow generated by the function H q\n\na segment of the form [− 1+ǫ\nπ , xt ];\nq\nif t > 1, then xt < 0. Also, this flow carries the segment [ √1π , 1+ǫ\nπ ] to the\nq\nsegment [xt , 1+ǫ\nπ ], and it is the identity map outside the disc (6.4). Thus,\nit satisfies the requirements of the lemma.\n\u0003\nt ≥ 0, carries the segment [−\n\n1+ǫ √1\nπ , π ] to\n\nLemma 6.7. There exists a smooth family of functions Htǫ,δ : C → R,\nparametrized by 0 < ǫ < 1 and 0 < δ < ǫ, whose Hamiltonian flows\nbǫ,δ\nt : C → C have the following properties.\n2\n• The diffeomorphism bǫ,δ\nt is the identity map outside the disc {z | π|z| <\nt + 1 + ǫ}.\n• The diffeomorphism bǫ,δ\nt carries the set\n\n(6.8)\n\n{reiθ | δ ≤ πr 2 ≤ 1 + ǫ − δ , δ ≤ θ ≤ 2π − δ}\nto the set\n\n(6.9)\n\n{reiθ | t + δ ≤ πr 2 ≤ t + 1 + ǫ − δ , δ ≤ θ ≤ 2π − δ}.\n\nProof. We choose Htǫ,δ whose Hamiltonian vector field vanishes outside the\n1 ∂\nannulus {z | t < π|z|2 < 1 + t + ǫ} and, on the set (6.9), it is equal to 2πr\n∂r .\n2\n(Then, on the set (6.9), the derivative of the function π|z| along this vector\nfield is equal to one.) The Hamiltonian flow generated by the function Htǫ,δ ,\nat time t ≥ 0, will carry the set (6.8) to the set (6.9), as required.\nθ δ\n2\nTo be explicit, we may take Htǫ,δ (reiθ ) = − 2π\nρ1 (θ)ρǫ,δ\n2 (πr − t) where\n0 ≤ θ < 2π and t ≤ πr 2 ≤ 1 + t + ǫ, where ρδ1 : [0, 2π] → R is a smooth family\nof functions that vanish to all orders at θ = 0 and θ = 2π and such that ρδ1\nis equal to one on [δ, 2π − δ], and where ρǫ,δ\n2 : R → R is a smooth family of\nfunctions that vanish outside [0, 1 + ǫ] and such that ρǫ,δ\n2 is equal to one on\n[δ, 1 + ǫ − δ].\n\u0003\nProof of Lemma 6.1. Every closed subset of C which is contained in the slit\ndisc\n(6.10)\n\n{z | π|z|2 < 1 + ǫ} r the non-negative x-axis\n\n\fSHORTENING HOFER LENGTH OF CIRCLE ACTIONS\n\n23\n\nis also contained in a set of the form\n{reiθ | δ ≤ πr 2 ≤ 1 + ǫ − δ , δ ≤ θ ≤ 2π − δ}\nfor some δ > 0. Moreover, for every closed subset of (0, 1) × C which is\ncontained in the product of the open segment (0, 1) with the slit disc (6.10),\nthere exists a positive smooth function ǫ 7→ δǫ such that the closed subset is\nalso contained in the subset\n(6.11)\n\n{(ǫ, reiθ ) | 0 < ǫ < 1 , δǫ ≤ πr 2 ≤ 1 + ǫ − δǫ , δǫ ≤ θ ≤ 2π − δǫ }\n\nof (0, 1) × C.\nLet bǫt be the Hamiltonian flows of Lemma 6.3. Because (ǫ, z) 7→ (ǫ, bǫt (z))\nis a diffeomorphism of (0, 1) × C, it carries the set {(ǫ, z) | π|z|2 ≤ 1} to a\nclosed subset of (0, 1) × C. For t > 1, by the second item of Lemma 6.3, this\nclosed subset is contained in the product of (0, 1) with the slit disc (6.10). Fix\nT > 1, and fix a smooth function ǫ 7→ δǫ such that the set {(ǫ, bǫT (z)) | π|z|2 ≤\n1} is contained in the set (6.11).\nLet bǫ,δ\nt be the Hamiltonian flows of Lemma 6.7.\nLet ρ : [0, 1] → [0, 1] be a smooth function that takes 0 to 0 and 1 to 1 and\nwhose derivatives of all orders vanish at the endpoints 0 and 1. For example,\nR1 − 1\nRs − 1\nwe may take ρ(s) = 0 e s(1−s) ds/ 0 e s(1−s) ds. The Hamiltonian flow\n(\nbǫT ρ(2τ )\n0 ≤ τ ≤ 1/2\nbA,ǫ\n=\nτ\nǫ,δǫ\nbAρ(2τ −1) 1/2 ≤ τ ≤ 1\nsatisfies the requirements of Lemma 6.1.\n\n\u0003\n\n7. Disjoining a family of discs\nThe purpose of this section is to prove the following quantitative result,\nwhich is later used in the proof of Theorem 3.1. Recall that a function from\na topological space X to a topological space Y is proper if the preimage of\nevery compact subset of Y is a compact subset of X.\nLemma 7.1. Let W be a symplectic manifold and N : W → [0, r) a proper\nfunction. Let A1 , A2 : [0, r) → R be smooth functions such that the set\nC := {x ∈ [0, r) | A1 (x) ≥ 0 and A2 (x) ≥ 0}\nis compact. Let U be an open subset of C × W that contains the set\n\b\n(7.2)\n(z, w) | N (w) ∈ C and π|z|2 ≤ A1 (N (w)) + A2 (N (w)) .\n\nThen there exists a symplectic isotopy, compactly supported in U , that disjoins the set\n\b\n(z, w) | π|z|2 ≤ A1 (N (w))\n\n\f24\n\nY. KARSHON AND J. SLIMOWITZ\n\nfrom the set\n\n\b\n(z, w) | π|z|2 ≤ A2 (N (w))\nand that preserves the function (z, w) 7→ N (w).\nLemma 7.1 is, more or less, a parametrized version of the fact that a disc\nof area A1 can be disjoined from a disc of area A2 inside any disc of area\ngreater than A1 + A2 . The symplectic isotopy moves the w coordinate but\nit does not change the value of N (w). For a fixed value of N (w), the effect\nof the isotopy on the z coordinate is independent of the w coordinate.\n\u0001\nProof. The map (z, w) 7→ π|z|2 , N (w) from C × W to [0, ∞) × [0, r) is\nproper, hence closed. So the image of the complement of U under this map\nis a closed subset of [0, ∞) × [0, r). This image is disjoint from the compact\nset\n{(s, x) ∈ [0, ∞) × [0, r) | x ∈ C and s ≤ A1 (x) + A2 (x)}\nso it has a positive distance from this set. Let ǫ be a positive number that is\nsmaller than half of this distance and is smaller from the difference r−max C.\nThen V := (C +(−ǫ, ǫ))∩[0, r) is an open neighbourhood of C in [0, r) whose\nclosure in [0, r) is compact, and U contains the set\n(7.3)\n\b\n(z, w) | N (w) ∈ closure(V ) and π|z|2 ≤ A1 (N (w)) + A2 (N (w)) + ǫ .\nA ,A\n\nLet F t 1 2 : C → R be a smooth family of functions, defined for t ∈ [0, 1]\nand A1 , A2 ∈ R, such that, when A1 ≥ 0 and A2 ≥ 0, the time-dependent\nA ,A\nfunction z 7→ F t 1 2 (z) vanishes outside the set given by π|z|2 ≤ A1 + A2 + ǫ\nA1 ,A2\nand its Hamiltonian flow bt\n, at time t = 1, carries the set {z | π|z|2 ≤ A1 }\ninto the set {z | A2 < π|z|2 ≤ A1 + A2 + ǫ}. For example, we may set\nA1 ,A2\n\nFt\n\n(z) := cFtA,ǫ (z/c)\n\nǫ/2\nA2\n, and ǫ =\n, and where FtA,ǫ\nA1 + ǫ/2\nA1 + ǫ/2\nA1 ,A2\nA ,A\nis as in Lemma 6.1. (The Hamiltonian flow bt\nof F t 1 2 relates to the\nA1 ,A2\n(z) = cbA,ǫ\nHamiltonian flow bA,ǫ\nof FtA,ǫ (z) by bt\nt (z/c).)\nt\nLet ρ : [0, r) → R be a smooth function that vanishes outside V and such\nthat ρ|C ≡ 1. Let\n\nwhere c =\n\np\n\nA1 + ǫ/2, A =\n\nA1 (N (w)),A2 (N (w))\n\nHt (z, w) = ρ(N (w))F t\n\n(z).\n\nThis function vanishes outside the compact set (7.3). Its Hamiltonian flow\npreserves the function N (w). We will show, for every N0 , that this flow, at\ntime t = 1, disjoins\n(7.4)\n\n{(z, w) | π|z|2 ≤ A1 (N0 ) and N (w) = N0 }\n\n\fSHORTENING HOFER LENGTH OF CIRCLE ACTIONS\n\n25\n\nfrom\n(7.5)\n\n{(z, w) | π|z|2 ≤ A2 (N0 ) and N (w) = N0 }.\n\nWhen N0 ∈ C, the restriction of the Hamiltonian flow of Ht to the level\nset {N (w) = N0 } is\n\u0010\n\u0011\nA1 ,A2 N\nbt (z, w) = bt\n, bT (z,w,t) (w)\nA1 ,A2\n\nis the Hamiltonian\nwhere A1 = A1 (N0 ), where A2 = A2 (N0 ), where bt\nA1 ,A2\nN\non C, where bT is the Hamiltonian flow of N on W (with time\nflow of F t\nparameter T ), and where T (z, w, t) is some real valued function of z, w, t.\nAt t = 1, this flow carries the set\n\b\n(z, w) | π|z|2 ≤ A1 (N0 ) and N (w) = N0\n\ninto the set\n\b\n(z, w) | A2 (N0 ) < π|z|2 ≤ A1 (N0 ) + A2 (N0 ) + ǫ and N (w) = N0 ,\n\nso it disjoins (7.4) from (7.5).\nWhen N0 6∈ C, one of the sets (7.4) and (7.5) is empty. So the flow\ntrivially disjoins the set (7.4) from the set (7.5).\n\u0003\n8. Shortening on a manifold with an isolated maximum\nIn this section we prove Theorem 3.1 and Remarks 3.2 and 3.4. We recall\nthe statement:\nLet (M, ω) be a compact connected symplectic manifold with\na Hamiltonian circle action. Suppose that the momentum\nmap attains its maximum at an isolated fixed point and that\nat least one of the isotropy weights at that point has absolute\nvalue greater than one. Let d be a positive number that is\nsmaller than the gap between the two largest critical values of\nthe momentum map. Then the circle action can be deformed\nto a loop in Ham(M, ω) whose Hofer length is smaller than\nthat of the original circle action by 2d/9.\nWe can choose the deformation such that the positive Hofer\nlength never exceeds the initial one and the negative Hofer\nlength remains constant. Specifically, let H denote the momentum map, let pmax denote the point where H attains its\nmaximum, let α denote the gap between the two largest critical values of H, and consider the subset of M given by\n\n(8.1)\n\n{m | H(m) > H(pmax ) − α}.\n\n\f26\n\nY. KARSHON AND J. SLIMOWITZ\n\nWe can choose the deformation such that the normalized deformed Hamiltonians remain greater than H(pmax )−α on the\nset (8.1) and coincide with H outside this set.\nWe actually obtain a better estimate than 92 d. If one of\nthe isotropy weights is even then we can shorten by 14 d. Otherwise, let −k1 be the weight whose absolute value is largest;\nthen we can shorten by 14 (1 − k12 )d. When k1 = 3, this becomes 92 d.\n\n1\n\nProof of Theorem 3.1 and Remarks 3.2 and 3.4. Let −k1 , . . . , −kn be the isotropy\nweights at pmax . The equivariant Darboux theorem implies that the integers\nkj are positive. We assume that at least one of them is greater than one.\nWithout loss of generality,\n(8.2)\n\nk1 = a + b\n\nwhere a and b are positive integers.\nThe point pmax is the only critical point of H in the set (8.1), and the\nmomentum map H is proper as a map from this set to the ray (H(pmax ) −\nα, ∞). There exists an equivariant symplectomorphism from the subset of\nCn given by\nNαH = {z | π(k1 |z1 |2 + . . . + kn |zn |2 ) < α},\nwith the circle action generated by the momentum map H(z1 , . . . , zn ) =\n−k1 π|z1 |2 − . . . − kn |zn |2 to the subset (8.1) of M ; denote it\ni : NαH → M.\nThis follows from [9, Proposition 2.8] (which should have been stated with\n|zj |2 instead of the typo |zj |).\nLet\nN (z2 , . . . , zn ) := π(k2 |z2 |2 + . . . + kn |zn |2 ).\nWe will apply Lemma 5.1 with U = NαH ,\nK(z1 , . . . , zn ) := H(pmax ) − πb|z1 |2 ,\nand\nF (z1 , . . . , zn ) := −πa|z1 |2 − N (z2 , . . . , zn ).\nLet 0 < d < α and let s = 29 d. By Lemma 5.1, to shorten by amount\ns, it is enough to disjoin the set NsK = {z | πb|z1 |2 < s} from the set\nNsF = {z | πa|z1 |2 +N (z2 , . . . , zn ) < s} by a compactly supported symplectic\nisotopy of NαH that preserves the function\nN̂ (z1 , z2 , . . . , zn ) := N (z2 , . . . , zn ).\n\n\fSHORTENING HOFER LENGTH OF CIRCLE ACTIONS\n\n27\n\nWrite the sets NsK and NsF as\ns\ns−N\nNsK = {z | π|z1 |2 < } and NsF = {z | π|z1 |2 <\n}.\nb\na\nBy Lemma 7.1, with A1 (N ) = s/b and A2 (N ) = (s − N )/a, for any open\nneighbourhood U of the set\ns s−N\n+\n}\nb\na\nthere exists a symplectic isotopy, compactly supported in U , that disjoins\nNsF from NsK and that preserves the function N̂ . So it is enough to show\nthat the set (8.3) is contained in the set NαH .\nBecause a + b = k1 , we can rewrite the set (8.3) as\n(8.3)\n\n(8.4)\n\n{z | π|z1 |2 ≤\n\n{z |\n\nb\nab\nπ|z1 |2 +\nN ≤ 1}.\nsk1\nsk1\n\nAlso, we rewrite the set NαH as\nk1\n1\nπ|z1 |2 + N < 1}.\nα\nα\nIt remains to show that the set (8.4) is contained in the set (8.5). This is\nequivalent to requiring that\n\n(8.5)\n\n{z |\n\nk1\nb\n1\nab\n≥\nand\n≥ .\nsk1\nα\nsk1\nα\nBecause a ≤ k1 , the first of these inequalities implies the second.\nIf k1 is even, write k1 = a + b where b = a. Then ab/k12 = 1/4, which\nis greater than 2/9. If k1 is odd, write k1 = a + b where b = a + 1. Then\nab/k12 = 1/4(1 − 1/k12 ) which, because k1 ≥ 3, is greater than or equal to\n1/4(1−1/9) = 2/9. In either case, if s = 2/9d and d < α, then s < (ab/k12 )α,\nwhich is equivalent to the required inequality.\n\u0003\n9. Symplectic vector bundles\nIn this section we apply the symplectic tubular neighbourhood theorem\nto describe a neighbourhood of a fixed component in a manifold with Hamiltonian circle action in terms of a symplectic vector bundle, and we give some\nresults about symplectic vector bundles that we will use in the next section.\nLemma 9.1. Let\nπ: E → B\nbe a symplectic vector bundle, i.e., a vector bundle with a fibrewise symplectic\nform. There exists on the total space E a closed two-form ωΘ with the\nfollowing properties.\n\n\f28\n\nY. KARSHON AND J. SLIMOWITZ\n\n(1) The pullback of ωΘ to the fibres of E coincides with the fibrewise\nsymplectic forms.\n(2) The pullback of ωΘ by the zero section of E is zero.\n(3) At the points of the zero section, the fibres of E are ωΘ -orthogonal\nto the zero section.\nMoreover, if a compact Lie group K acts on E by bundle automorphisms,\nthen ωΘ can be chosen to be K invariant.\nProof. Let 2n = rankE, and let\nG = Sp(R2n )\nbe the group of symplectic linear transformations of R2n . Let P → B be the\nprincipal G bundle (with a right G action) whose fibre Eb over a point b of\nB consists of the set of linear symplectic isomorphisms from R2n to Eb .\nWe identify E with the associated bundle\nP ×G R2n ,\nin which [pa, z] = [p, az] for all p ∈ P , z ∈ R2n , and a ∈ G.\nLet Θ ∈ Ω1 (P, g) be a connection one-form; use the same symbol, Θ, to\ndenote its pullback to P × R2n . Let ω0 be the standard symplectic form on\nR2n . Let ΦR2n : R2n → g∗ be the quadratic momentum map for the G-action\non R2n . Let h*, *i denote the pairing between g∗ and g. Then hΦR2n , Θi is a\nG-invariant real valued one-form on P × R2n . The difference ω0 − d hΦR2n , Θi\ndescends to a closed two-form ωΘ on P ×G R2n with the desired properties.\nIf a compact Lie group K acts on E by bundle automorphisms, then, by\naveraging, we can choose the connection one-form Θ to be K-invariant. The\nresulting two-form ωΘ is then K-invariant.\n\u0003\nLet (B, ωB ) be a symplectic manifold, let π : E → B be a symplectic vector\nbundle, and let a compact Lie group K act on E by bundle automorphisms\nthat descend to symplectomorphisms of (B, ωB ). Let ωΘ be a closed twoform as in Lemma 9.1. The corresponding coupling form is\n(9.2)\n\nωE := π ∗ ωB + ωΘ .\n\nIt has the following properties.\n(1) Its pullback to the fibres coincides with the fibrewise symplectic\nforms.\n(2) Its pullback by the zero section coincides with ωB .\n(3) At the points of the zero section, the fibres of E are ωE -orthogonal\nto the zero section.\nConsequently, ωE is non-degenerate near the zero section, and the normal\nbundle of the zero section in (E, ωE ) is isomorphic to E → B as symplectic\nvector bundles.\n\n\fSHORTENING HOFER LENGTH OF CIRCLE ACTIONS\n\n29\n\nRemark 9.3. The construction that we just described is Shlomo Sternberg's\nminimal coupling [23]. For more details, see chapter 1 of the book [4] by\nGuillemin, Lerman, and Sternberg.\nLemma 9.4. Let π : E → B be a symplectic vector bundle, and let the circle\ngroup act on E by fibrewise linear symplectic transformations. Let ωE be an\ninvariant closed two-form on the total space of E whose pullback to the fibres\ncoincides with the fibrewise symplectic form. Let H : E → R be the fibrewise\nquadratic momentum map for the fibrewise circle action. Then H is also a\nmomentum map for the circle action on the total space (E, ωE ).\nProof. Let ξ denote the vector field that generates the circle action. The\none-form ι(ξ)ωE is closed and vanishes on the zero section, so it is exact; so\nthere exists a momentum map\nHE : E → R\nfor the circle action on (E, ωE ). (ωE need not be nondegenerate.) Because\nξ = 0 along the zero section, HE is locally constant along the zero section.\nAdding a locally constant function, we may assume that HE vanishes along\nthe zero section. Because the pullback of ωE to the fibres coincides with\nthe fibrewise symplectic form, the restriction of HE to each fibre is also\na momentum map for the fibrewise circle action; because it vanishes on\nthe zero section, it must coincide with the fibrewise quadratic momentum\nmap, H.\n\u0003\nNow let B be a connected component of the fixed point set of a circle\naction on a symplectic manifold (M, ω), and let E be the normal bundle\nof B in M . Then B is a symplectic submanifold, and E can be identified\nwith the symplectic orthocomplement of T B in T M |B . Moreover, the circle\naction on M induces a circle action on E by bundle automorphisms. Let ωE\nbe an invariant coupling form on E, as described above. In this setting, we\nhave the following symplectic tubular neighbourhood theorem.\n\n(9.5)\n\nThere exists an invariant neighbourhood U of the zero section in E and an equivariant symplectic open embedding\n(U, ωE ) → (M, ω) whose restriction to the zero section is\nthe identity map on B and, under the natural identification\nof T E|B with T M |B , whose differential is the identity map\nat every point of B.\n\n(This follows from the classical tubular neighbourhood theorem in differential topology, combined with Theorem 4.1 of Alan Weinstein's paper [25],\nkeeping track of a group action as explained in the last paragraph of Section\n3 of [25].)\n\n\f30\n\nY. KARSHON AND J. SLIMOWITZ\n\nLemma 9.6. Let E → B be a symplectic vector bundle with a fibrewise\ncircle action. Suppose that all the weights are negative; denote the weights\nby −k1 , . . . , −ks and let\nk = min{k1 , . . . , ks } − 1.\nThen there exist k+1 commuting fibrewise circle actions on E, with fibrewise\nquadratic momentum maps\nH(j) : E → R\n\n,\n\n0 ≤ j ≤ k,\n\nwith the following properties.\n(i) The Hj are are negative outside the zero section, and their sum\nH(0) + H(1) + . . . + H(k)\nis the fibrewise quadratic momentum map for the given circle action\non E.\n(ii) There exist arbitrarily small neighbourhoods U of the zero section\nthat are invariant under the k + 1 commuting fibrewise circle actions, whose intersections with the fibres of E are connected, and\nthat satisfy\n(9.7)\n\ninf\nU\n\nk\nX\nj=0\n\nH(j) =\n\nk\nX\nj=0\n\ninf H(j) .\nU\n\nRemark 9.8. This lemma is about fibrewise structures. It does not require\na two-form on the total space of E.\nProof. Fix an invariant fibrewise compatible complex structure and Hermitian metric on E. (Because the weights are all negative, such a metric is\nunique.) After eliminating repetitions, we may assume that the positive\nnumbers k1 , . . . , ks are distinct. Let Ej denote the −kj th weight space for\nthe circle action on E, so that E decomposes as E1 ⊕ . . . ⊕ Es . The function\nz 7→ πkzj k2 ,\nfor z = (z1 , . . . , zs ) ∈ E1 ⊕ . . . ⊕ Es , is a momentum map for the scalar multiplication circle action on the Ej factor. The quadratic fibrewise momentum\nmap for the given circle action on E is\n(9.9)\n\n− k1 πkz1 k2 − . . . − ks πkzs k2 .\n\nFor each j, because kj ≥ k + 1, we can decompose kj as\nkj = a0j + a1j + . . . + akj\nwhere aij are positive integers. We get a decomposition of (9.9) into the\nsum\nH(0) + H(1) + . . . + H(k) ,\n\n\fSHORTENING HOFER LENGTH OF CIRCLE ACTIONS\n\n31\n\nwhere\nH(i) (z) = −ai1 πkz1 k2 − . . . − ais πkzs k2\ngenerates the fibrewise circle action on E that rotates the jth coordinate\nwith speed −aij . Because the numbers aij are positive, the functions H(j)\nare negative outside the zero section.\nFinally, every neighbourhood of the zero section contains a neighbourhood\ns\nT\nof the form U =\n{z | πkzj k2 < ǫ}, and such a U satisfies the requirements\nj=1\n\nof part (ii) of the lemma.\n\n\u0003\n\nLemma 9.10. Let (B, ωB ) be a symplectic manifold, let E → B be a symplectic vector bundle, let ωE be a coupling form (see (9.2)), and let U be\nan open subset of E where ωE is non-degenerate. Let k be a positive integer. Suppose that there exist k sections of E that are nowhere all vanishing.\nThen there exist smooth functions g1 , . . . , gk : U → R whose Hamiltonian\nvector fields are nowhere all tangent to the zero section of E.\nProof. Let ξ1 , . . . , ξk be sections of E → B that are nowhere all vanishing.\nFix j ∈ {1, . . . , k}. Let gj : E → R be the function whose restriction to the\nfibre over b is the linear functional ι(ξj (b))ωEb , where ωEb is the symplectic\nform on the fibre over b. Identifying E with the vertical subbundle of T E|B ,\nthe Hamiltonian vector field of gj |U is equal to ξj at the points of the zero\nsection. Because ξ1 , . . . , ξk are vertical and nowhere all vanishing, they are\nnowhere all tangent to the zero section.\n\u0003\nRemark 9.11. Each of the following assumptions on an oriented vector bundle E → B implies that there exist k sections that are nowhere all vanishing.\nLet e(E) denote the Euler class of the bundle.\n(a) dim B < k rank E.\n(b) dim B = k rank E and e(E)k = 0.\n(c) rank E = 2, e(E) = 0, and k ≥ 1.\nProof. If dim B < k rank E then, for any generic choice of k sections of\nE, these sections are nowhere all vanishing. This gives (a). If the rank of a\nbundle is equal to the dimension of its base, or if the rank of a bundle is equal\nto 2, then the Euler class being zero implies the existence of a non-vanishing\nsection. Applying this to the bundle |E ⊕ .{z\n. . ⊕ E} gives (b); applying it to E\nk times\n\ngives (c).\n\n\u0003\n\nIn preparation for the proof of Theorem 3.9, which involves a subbundle of the normal bundle, we now give a refinement of the minimal coupling\n\n\f32\n\nY. KARSHON AND J. SLIMOWITZ\n\nconstruction. Let (B, ωB ) be a symplectic manifold, let π : E → B be a symplectic vector bundle, and let a compact Lie group K act on E by symplectic\nbundle automorphisms. Let E ′ be a K-invariant symplectic sub-bundle of\nE.\nLet E ′′ be the symplectic orthocomplement of E ′ in E. Then E = E ′ ⊕E ′′ ,\nand we have a pullback diagram:\np′′\n\n(9.12)\n\nE −−−−→ E ′′\n\n\n\n\np′ y\nπ ′′ y\nπ′\n\nE ′ −−−−→ B.\nLet ωΘ′ and ωΘ′′ denote K-invariant two-forms on E ′ and E ′′ with the properties listed in Lemma 9.1. The corresponding coupling forms on E ′ and on\nE are\n∗\nω E ′ = π ′ ω B + ω Θ′\nand\n∗\n\n(9.13)\n\n∗\n\nωE = π ∗ ωB + p′ ωΘ′ + p′′ ωΘ′′\n∗\n∗\n= p′ ωE ′ + p′′ ωΘ′′ .\n\nThe proof of Theorem 3.9 will use the following lemma. In it, we view\nE ′ as the subset of E consisting of the set of points whose fibrewise E ′′\ncoordinate is zero, i.e., the preimage under p′′ of the zero section of E ′′ .\nLemma 9.14. Let (B, ωB ) be a symplectic manifold, let E → B be a symplectic vector bundle, and let E ′ and E ′′ be symplectic sub-bundles such that\nE = E ′ ⊕ E ′′ . Let ωE ′ be a coupling form on E ′ and let ωE be a coupling\nform on E that is compatible with ωE ′ in the sense of (9.13). Let U ′ be a\nneighbourhood of the zero section in E ′ where ωE ′ is non-degenerate, and let\nU be a neighbourhood of the zero section in E where ωE is non-degenerate\nand that is contained in p′ −1 (U ′ ).\nLet g1′ , . . . , gk′ : U ′ → R be smooth functions whose Hamiltonian vector\nfields in U ′ are nowhere all tangent to the zero section of E ′ . Let g1 , . . . , gk : U →\nR be their pullbacks under p′ |U : U → U ′ . Then, at each point of the zero\nsection of E, the Hamiltonian vector fields of g1 , . . . , gk are tangent to E ′\nand are not all tangent to the zero section of E.\nProof. Viewing E ′ as a subset of E (namely, the p′′ -preimage of the zero\nsection of E ′′ ), for every point q ∈ E ′ we have a natural decomposition\n(9.15)\n\nT E|q = T E ′ |q ⊕ E ′′ |π(q) .\n\nLet ξ1′ , . . . , ξk′ be the Hamiltonian vector fields of g1′ , . . . , gk′ in U ′ . Let\nξ ̃′ 1 , . . . , ξ ̃′ k be the corresponding sections of T E|E ′ ∩U . That is, under the\n\n\fSHORTENING HOFER LENGTH OF CIRCLE ACTIONS\n\n33\n\ndecomposition (9.15), we have\nξ ̃′ j = ξj′ ⊕ 0.\nIn particular, ξ ̃′ j are tangent to the subset E ′ of E, and they satisfy p′∗ ξ ̃′ j =\nξj′ . The vectors p′′ ∗ ξ ̃′ j are tangent to the zero section of E ′′ , so they are in the\nnull space of ωθ′′ . It is enough to show that, along E ′ ∩ U , the Hamiltonian\nvector fields of g1 , . . . , gk are equal to ξ ̃′ 1 , . . . , ξ ̃′ k . Fix j ∈ {1, . . . , k}. We\nnow compute: along E ′ ∩ U ,\ndgj\n\n∗\n\n= p′ dgj′\n\nby the definition of gj\n\n′∗\n\nby the definition of ξj′\nbecause p′∗ ξ ̃′ j = ξj′\nj\n\u0001\n∗\n= −ι(ξ ̃′ j ) ωE − p′′ ωΘ′′\nby (9.13)\n= −ι(ξ ̃′ j )ωE\nbecause p′′ ∗ ξ ̃′ j is in the null space of ωθ′′ .\n\n= −p ι(ξj′ )ωE ′\n∗\n= −ι(ξ ̃′ )p′ ωE ′\n\nSo dgj = −ι(ξ ̃′ j )ωE , as required.\n\n\u0003\n\nWe will also use the following variant of Lemma 9.6.\nLemma 9.16. Let E → B be a symplectic vector bundle with a fibrewise\ncircle action whose weights are all negative. Let\nE = E ′ ⊕ E ′′\nbe a decomposition of E into two invariant symplectic subbundles that are\nfibrewise symplectically orthogonal. Let −k1 , . . . , −ks be the distinct weights\nfor the circle action on E ′ . Let\nk = min{k1 , . . . , ks } − 1.\nThen there exist k+1 commuting fibrewise circle actions on E, with fibrewise\nquadratic momentum maps\nH(j) : E → R\n\n,\n\n0 ≤ j ≤ k,\n\nthat preserve the decomposition E = E ′ ⊕ E ′′ , that commute with the given\ncircle action on each of E ′ and E ′′ , and that have the following properties.\n(i) The function H(0) vanishes on the zero section on E and is negative\noutside it, the functions H(1) , . . ., H(k) all vanish on E ′′ and are\nnegative outside it, and the sum\nH(0) + H(1) + . . . + H(k)\nis the fibrewise quadratic momentum map for the given circle action\non E.\n\n\f34\n\nY. KARSHON AND J. SLIMOWITZ\n\n(ii) There exist arbitrarily small neighbourhoods U of the zero section in\nE that are invariant under these k + 1 circle actions and under the\ngiven circle actions on E ′ and on E ′′ , whose intersections with the\nfibres of E are connected, and that satisfy\n(9.17)\n\ninf\nU\n\nk\nX\nj=0\n\nH(j) =\n\nk\nX\nj=0\n\ninf H(j) .\nU\n\nProof. Fix an invariant fibrewise compatible complex structure and Hermitian metric on each of E ′ and E ′′ . Let Ej denote the −kj th weight space for\nthe circle action on E ′ , so that E decomposes as E1 ⊕ . . . ⊕ Es ⊕ E ′′ . The\nfunction\nz 7→ πkzj k2 ,\nfor z = (z1 , . . . , zs , z ′′ ) ∈ E1 ⊕ . . . ⊕ Es ⊕ E ′′ , is a momentum map for the\nscalar multiplication circle action on the Ej factor. The quadratic fibrewise\nmomentum map for the given circle action on E is\n−k1 πkz1 k2 − . . . − ks πkzs k2 − N̂ (z ′′ )\nwhere N̂ : E ′′ → R is the negative of the fibrewise quadratic momentum map\nfor the fibrewise circle action on E ′′ . Decompose each kj as\nkj = a0j + a1j + . . . + akj\nwhere aij are positive integers. The lemma then holds with\nH(i) (z) = −ai1 πkz1 k2 − . . . − ais πkzs k2\nfor 1 ≤ i ≤ k, with\nH(0) (z) = −a01 πkz1 k2 − . . . − a0s πkzs k2 − N̂ (z ′′ ),\nand with neighbourhoods of the zero section of the form\nU = {z | πkzj k2 < ǫ for j = 1, . . . , s, and N̂ (z ′′ ) < ǫ}\nfor small ǫ > 0.\n\u0003\n10. Shortening on a manifold with an arbitrary maximum\nIn this section we prove Theorems 3.7 and 3.9, with Remarks 3.8 and 3.11.\nWe begin by recalling the statement of Theorem 3.7 and Remark 3.8:\nLet (M, ω) be a compact connected symplectic manifold with\na Hamiltonian circle action. Let Bmax be the set where the\nmomentum map is maximal. Let −k1 , . . . , −ks denote the\ndistinct weights for the circle action on the normal bundle of\nBmax , and let k := min{k1 , . . . , ks } − 1. Suppose that Bmax is\nsymplectically k-displaceable in every neighbourhood. Then\n\n\fSHORTENING HOFER LENGTH OF CIRCLE ACTIONS\n\n35\n\nthe circle action can be deformed through loops in Ham(M, ω)\ninto a loop of smaller Hofer length.\nWe can choose the deformation such that the positive Hofer\nlength never exceeds the initial one and the negative Hofer\nlength remains constant. Specifically, let H denote the momentum map. For every positive number α, we can choose\nthe deformation such that the normalized deformed Hamiltonians remain between than H(Bmax )−α and H(Bmax ) on the\nset {m ∈ M | H(m) > H(Bmax ) − α} and coincide with H\noutside this set.\nProof of Theorem 3.7 and Remark 3.8. Let E denote the normal bundle of\nBmax in (M, ω); recall that its fibrewise symplectic structure and circle action\nare induced from M . Apply Lemma 9.6 to obtain k + 1 commuting fibrewise\ncircle actions on E, with fibrewise quadratic momentum maps\n′\nH(j)\n:E→R ,\n\n0≤j≤k\n\nthat are negative outside the zero section, whose sum\n′\n′\n′\nH(0)\n+ H(1)\n+ . . . + H(k)\n\nis the fibrewise quadratic momentum map for the given circle action on E\n(the one induced from M ), and such that part (ii) of Lemma 9.6 holds (with\n′ \").\n\"H(j) \" replaced by \"H(j)\nThese circle actions fit together into a (not necessarily faithful) action of\nthe torus T := (S 1 )k+1 , whose diagonal acts by the given circle action on E.\nApply Lemma 9.1 and Equation (9.2), with K = T , to obtain a T -invariant\ncoupling form ωE on E. Consider the given circle action on M and the\ninduced circle action on E, and apply the symplectic tubular neighbourhood\ntheorem (9.5), to obtain an invariant neighbourhood U of the zero section\nin E on which ωE is nondegenerate and an equivariant open symplectic\nembedding\ni : (U, ωE ) → (M, ω)\nwhose restriction to the zero section is the identity map on Bmax and, under\nthe natural identification of T E|Bmax with T M |Bmax , whose differential is the\nidentity map at every point of Bmax .\nFix a positive number, α > 0. After possibly shrinking U , we may assume\nthat i(U ) ⊂ {m ∈ M | H(m) > H(Bmax ) − α}, and that U satisfies the\nrequirements in part (ii) of Lemma 9.6: U is invariant under the entire T\naction on E, the intersections of U with the fibres of E are connected, and\ninf\nU\n\nk\nX\nj=0\n\n′\nH(j)\n\n=\n\nk\nX\nj=0\n\n′\ninf H(j)\n.\nU\n\n\f36\n\nY. KARSHON AND J. SLIMOWITZ\n\nLet H : M → R be the momentum map on M . We have\n\u0011\n\u0010\n′\n′\n′\n(10.1)\ni∗ H = H(Bmax ) + H(0)\n+ H(1)\n+ . . . + H(k)\n\nU\n\n= H(0) + H(1) + . . . + H(k) ,\n\n′ | and where H\n′\nwhere H(0) = H(Bmax )+H(0)\nU\n(j) = H(j) |U for each 1 ≤ j ≤ k.\n(The intersection with U of each fibre of E is an invariant connected open\nneighbourhood of the origin in the fibre. In this neighbourhood, the left and\nright hand sides of (10.1) are momentum maps for the same circle action\nwith the same value at the origin, so they are equal.)\n′ ,\nBecause the T action on E preserves ωE and by Lemma 9.4, the maps H(0)\n′ , . . ., H ′\nH(1)\n(k) are momentum maps for the k + 1 commuting circle actions\non the total space (E, ωE ) and not only fibrewise. So H(0) , H(1) , . . . , H(k)\ngenerate commuting circle actions on (U, ωE ).\n(j)\nWe are now in the setup of Lemma 5.10. The sets Bmax where the functions H(j) attain their maximum are all equal to the zero section of E. This\nimplies the condition (5.12) of Lemma 5.10. It also reduces the last condition of Lemma 5.10 to the condition that the zero section is symplectically\nk-displaceable in U . This condition then follows from that Bmax is symplectically k-displaceable in i(U ). Theorem 3.7 and Remark 3.8 then follows\nfrom Lemma 5.10.\n\u0003\n\nNext, we prove Theorem 3.9 and Remark 3.11. We recall the statement:\nLet (M, ω) be a compact connected symplectic manifold with\na Hamiltonian circle action. Let Bmax be the set where the\nmomentum map is maximal. Let E ′ → Bmax be an S 1 invariant subbundle of the normal bundle to Bmax in M , and\nlet −k1′ , . . . , −ks′ ′ be the distinct weights for the circle action\non E ′ . Let\nk′ = min{k1′ , . . . , ks′ ′ } − 1.\nSuppose that\n(10.2)\n\nE ′ has k′ sections that are nowhere all vanishing.\nThen the circle action can be deformed through loops in\nHam(M, ω) into a loop of smaller Hofer length.\nWe can choose the deformation such that the positive Hofer\nlength never exceeds the initial one and the negative Hofer\nlength remains constant. Specifically, let H denote the momentum map. For every positive number α, we can choose\nthe deformation such that the normalized deformed Hamiltonians remain between H(Bmax ) − α and H(Bmax ) on the\n\n\fSHORTENING HOFER LENGTH OF CIRCLE ACTIONS\n\n37\n\nset {m ∈ M | H(m) > H(Bmax ) − α} and coincide with H\noutside this set.\nProof of Theorem 3.9 and Remark 3.11. Let E denote the normal bundle of\nBmax in (M, ω); recall that its fibrewise symplectic structure and circle action\nare induced from M . Let E ′′ be the fibrewise symplectic orthocomplement\nof E ′ in E, so E = E ′ ⊕ E ′′ . Apply Lemma 9.16 to obtain k′ + 1 commuting\nfibrewise circle actions on E, with fibrewise quadratic momentum maps\n′\nH(j)\n:E→R ,\n\n0 ≤ j ≤ k′\n\n′\nsuch that H(0)\nvanishes on the zero section of E and is negative outside it,\n′\n′\n′ +\nH(1) , . . . , H(k′ ) vanish on E ′′ and are negative outside it, the sum H(0)\n′ + . . . + H′\nH(1)\n(k ′ ) is the fibrewise quadratic momentum map for the given\ncircle action on E, and part (ii) of Lemma 9.16 holds (with \"k\" and \"H(j) \"\n′ \").\nreplaced by \"k′ \" and \"H(j)\nThese k′ +1 circle actions, together with the given circle actions on E ′ and\non E ′′ , fit together into a fibrewise action of a torus T . Apply Lemma 9.1 and\nEquations (9.2) and (9.13) to obtain T invariant coupling forms ωE ′ on E ′\nand ωE on E. Consider the given circle action on M and the induced circle\naction on E, and apply the symplectic tubular neighbourhood theorem (9.5)\nto obtain an invariant neighbourhood U of the zero section in E on which\nωE is nondegenerate and an equivariant symplectic open embedding\n\ni : (U, ωE ) → (M, ω)\nwhose restriction to the zero section is the identity map on Bmax and, under\nthe natural identification of T E|Bmax with T M |Bmax , whose differential is the\nidentity map at every point of Bmax .\nFix a positive number, α > 0. After possibly shrinking U , we may assume\nthat i(U ) ⊂ {m ∈ M | H(m) > H(Bmax ) − α} and that U satisfies the\nrequirements in part (ii) of Lemma 9.16: U is T invariant, the intersections\nof U with the fibres of E are connected, and\n′\n\n′\n\ninf\nU\n\nk\nX\nj=0\n\n′\nH(j)\n\n=\n\nk\nX\nj=0\n\n′\ninf H(j)\n.\nU\n\nLet H : M → R denote the momentum map on M . We have\n\u0010\n\u0011\n′\n′\ni∗ H = H(Bmax ) + H(0)\n+ . . . + H(k\n(10.3)\n′)\nU\n\n= H(0) + H(1) + . . . + H(k′ ) ,\n\nwhere\n\n\u0011\n\u0010\n′\nH(0) = H(Bmax ) + H(0)\n\nU\n\n\f38\n\nY. KARSHON AND J. SLIMOWITZ\n\nand where\n\n\u0011\n\u0010\n′\nH(j) = H(j)\n\nU\n\nfor each\n\n1 ≤ j ≤ k′ .\n\n(The intersection of U with each fibre of E is an invariant connected open\nneighbourhood of the origin in the fibre. In this neighbourhood, the left and\nright hand sides of (10.3) are momentum maps for the same circle action\nwith the same value at the origin, so they are equal.)\nBecause the T action on E preserves ωE and by Lemma 9.4, the maps\n′\n′ , . . ., H ′\n′\nH(0) , H(1)\n(k ′ ) are momentum maps for the k + 1 commuting circle\nactions on the total space (E, ωE ) and not only fibrewise. So H(0) , H(1) , . . .,\nH(k′ ) generate commuting circle actions on (U, ωE ).\n(0)\n\nWe are now in the setup of Lemma 5.10. The set Bmax where H(0) attains\n(j)\n\nits maximum is equal to the zero section, and, for 1 ≤ j ≤ k′ , the set Bmax\nwhere H(j) attains its maximum is the intersection of U with the image\nof E ′′ in E. Slightly abusing notation, we write these sets as Bmax and\nas E ′′ ∩ U . To apply Lemma 5.10, we need to find symplectomorphisms\nb1 , . . . , bk′ of U , each connected to the identity through a path of compactly\nsupported symplectomorphisms of U , such that\n(10.4)\n\nBmax ∩ b1 (E ′′ ∩ U ) ∩ . . . ∩ bk′ (E ′′ ∩ U ) = ∅.\n\nLet U ′ be a neighbourhood of the zero section in E ′ where ωE ′ is nondegenerate. By Lemma 9.10, there exist functions g1′ , . . . , gk′ ′ on U ′ whose\nHamiltonian vector fields are nowhere all tangent to the zero section of E ′ .\nFor j = 1, . . . , k ′ , let gj = ρ(gj′ ◦ p′ ) where p′ : E → E ′ is the projection\nmap and where ρ : U → R is a cutoff function that is equal to 1 near the\nzero section of E and has compact support in U . Lemma 9.14 implies that,\nat each point of Bmax , the Hamiltonian vector fields of g1 , . . . , gk′ are tang\ngent to E ′ and are not all tangent to Bmax . Let ψtg1 , . . . , ψt k′ be the corresponding flows. If t is a sufficiently small positive number, the intersecg\ntion Bmax ∩ ψtg1 (E ′′ ∩ U ) ∩ . . . ∩ ψt k′ (E ′′ ∩ U ) is empty. Lemma 5.10, with\ng\nb1 , . . . , bk′ taken to be ψtg1 , . . . , ψt k′ , gives the result of Theorem 3.9 and\nRemark 3.11.\n\u0003\n11. The index of the positive Hofer length functional\nIn this section we prove Theorem 3.17 and Remark 3.18. We recall the\nstatement, with slight change of notation (HM instead of H):\nLet (M, ω) be a 2n dimensional compact connected manifold\nwith a Hamiltonian circle action. Suppose that the momentum map attains its maximum at an isolated fixed point.\nLet −k1 , . . . , −kn be the isotropy weights at the maximum,\nwith possible repetitions. Then there exists a neighbourhood\n\n\fSHORTENING HOFER LENGTH OF CIRCLE ACTIONS\n\n39\n\nP\n\nD of the origin in R 2(kj −1) , and, for each λ ∈ D, a loop\n(λ)\n{ψt }0≤t≤1 in Ham(M, ω), such that the following proper(0)\nties hold. For λ = 0, the loop {ψt }0≤t≤1 is the given circle\n(λ)\naction. The function λ 7→ length({ψt }) is smooth, λ = 0\nis a critical point of this function, and the Hessian of this\nfunction at λ = 0 is negative definite.\nIn fact, we can choose the deformation such that the negative Hofer length remains constant. Specifically, let HM\ndenote the momentum map, and let pmax denote the point\nwhere HM attains its maximum. For every positive number\nα, we can choose the deformation such that the normalized\ndeformed Hamiltonian remains between HM (pmax ) − α and\nHM (pmax ) on the set {m ∈ M | HM (m) > HM (pmax ) − α}\nand coincides with HM outside this set.\nProof of Theorem 3.17 and Remark 3.18. We set the following notation.\nφt : C → C ,\n\nφt (z) = e−2πit z\n\nfor t ∈ R.\n\nβλ : C → C , βλ (z) = z + λ for λ ∈ C.\nLet pmax denote the point where the momentum map HM attains its\nmaximum. By the equivariant Darboux theorem, near pmax , we can identify\nthe manifold with Cn , the action with the product action\n(φk1 t ) × . . . × (φkn t ),\n\n(11.1)\n\nand the momentum map with the function\nz 7→ HM (pmax ) − N (z),\nwhere\n\u0001\nN (z) = π k1 |z1 |2 + . . . + kn |zn |2 .\n\n(11.2)\n\n(We will use variants of the symbol N to denote variations and combinations of norm-square functions, and we will use variants of the symbol H to\ndenote momentum maps.)\nIf k is an integer greater than 1, the non-effective circle action φkt on C\nhas the deformation\n(11.3)\n\n(λ)\n\nφt\n\n:= φt ◦ βλk−1 ◦ φt ◦ . . . ◦ βλ2 ◦ φt ◦ βλ1 ◦ φt ◦ β−λ1 −...−λk−1 ,\n\nparametrized by (λ) = (λ1 , . . . , λk−1 ) ∈ Ck−1 and generated by\n(λ)\n\n(11.4) H t\n\nφ−1 + . . .\nφ−1 βλ−1\nφ−1 + Hβλ−1\n:= H + Hβλ−1\nk−1 t\nk−2 t\nk−1 t\n−1\n−1\n−1 −1\nφ−1\n. . . + Hβλ−1\nt βλ2 φt * * * βλk−1 φt ,\n1\n\n\f40\n\nY. KARSHON AND J. SLIMOWITZ\n\nwhere H(z) = −π|z|2 . (We\nP will use the symbol (λ), with brackets, for a\nparameter in Ck−1 or in C (ki −1) and the symbol λ, without brackets, for a\nparameter in C.)\nApplying such a deformation to each factor of (11.1), we get a family of\ndeformations\nof the product action. This family is parametrized by elements\nP\nof C (ki −1) . When we view the parameter (λ) as an element ((λ)1 , . . . , (λ)n )\nof the n-fold product Ck1 −1 × . . . × Ckn −1 , the deformation is\n(λ)1\n\nφ\n\n(11.5)\n\n(λ)n\n\n× ... × φ\n\n,\n\nand it is generated by\n(λ)1\n\n(λ)\n\nHt (z) := H t\n\n(11.6)\n\n(λ)n\n\n(z1 ) + . . . + H t\n\n(zn ).\n\nWith the help of cut-off functions, this deformation can be plugged into\nthe original manifold to obtain a family of deformations of the original\nP circle\naction, parametrized by λs in a neighbourhood D of the origin in C (ki −1) ,\nand generated by a function that in a neighbourhood of p can be identi(λ)\nfied with z 7→ HM (pmax ) + Ht (z) and that attains its maximum in that\nneighbourhood. We give the details later.\nWe now turn to the relevant computation on Cn . We consider the function\n\u0013\nZ 1\u0012\n(λ)\n(λ) 7→\nmaxn Ht (z) dt\nz∈C\n\n0\n\nP\nC (ki −1)\n\nfrom\nto R. By (11.4) and (11.6), this function is everywhere nonpositive and vanishes at the origin. We will show that this function is quadratic in the real and imaginary parts of λ, and that it is strictly negative\nwhen λ 6= 0. This will imply that the function is smooth and that its Hessian\nat the origin is negative definite, as required.\nBy (11.6), it is enough to consider separately each of the functions (λ)i 7→\nR1\n(λ)i\ndt. Omitting the index i, for each 0 ≤ t ≤ 1 we consider the\n0 max H t\nC\n\nfunction\n(11.7)\n\n(λ) 7→\n\nZ\n\n0\n\n1\u0012\n\n(λ)\nmax H t\nz∈C\n\n\u0013\n\ndt\n\nfrom Ck−1 to R. We claim that it is a quadratic function of the real and\nimaginary parts of λ whose coefficients are trigonometric polynomials in\nt, and that it is everywhere non-positive, vanishes at λ = 0, and strictly\nnegative for λ 6= 0 when t = 0.\n(λ)\nExpanding the expression (11.4), we get that H t (z) is equal to −π times\n(11.8) |z|2 + |e2πit z − λk−1 |2 + |e2πi*2t z − e2πi*t λk−1 − λk−2 |2 + . . .\n+ |e2πi(k−1)t z − e2πi(k−2)t λk−1 − . . . − e2πi*2t λ3 − e2πit λ2 − λ1 |2 .\n\n\fSHORTENING HOFER LENGTH OF CIRCLE ACTIONS\n\n41\n\nExpanding further, this is equal to\n|z|2 + |z|2 + |λk−1 |2 − 2Re(e2πit z * λk−1 )\n+ |z|2 + |e2πit λk−1 + λk−2 |2 − 2Re(e2πi*2t z * (e2πit λk−1 + λk−2 ))\n+ ...\n+ |z|2 + |e2πi(k−2)t λk−1 + . . . + e2πi*2t λ3 + e2πit λ2 + λ1 |2\n− 2Re(e2πi(k−1)t z * (e2πi(k−2)t λk−1 + . . . + e2πi*2t λ3 + e2πit λ2 + λ1 )).\n(λ)\n\nThus, H t (x+ iy) is equal to −π times kx2 + ky 2 + ax + by + c, where each of\na, b is a linear function of the real and imaginary parts of λ1 , . . . , λk−1 whose\ncoefficients are trigonometric polynomials in t and where c is a quadratic\nfunction of the real and imaginary parts of λ1 , . . . , λk−1 whose coefficients are\ntrigonometric polynomials in t. Completing the square, this function attains\nb\na2\nb2\na\nand y = − 2k\n, and its minimal value is c− 4k\n− 4k\nits minimum when x = − 2k\nwhich, as required, is a quadratic function of the real and imaginary parts\nof λ1 , . . . , λk−1 whose coefficients are trigonometric polynomials in t.\nFinally, if λ 6= 0, then at least one of the summands in (11.8) is strictly\npositive when z = 0, whereas the first summand is strictly positive when\nz 6= 0, so the minimal value of the function (11.8) is strictly positive.\nThis completes our computation in Cn . We now return to our manifold M .\nFix a symplectomorphism f : U → M from a neighbourhood U of the origin\nin Cn onto a neighbourhood of pmax in M such that f (0) = pmax and such\nthat (f ∗ HM )(z) = HM (pmax ) − N (z), where N (*) is given in (11.2). Given a\npositive number α, we may choose U such that i(U ) ⊂ {m ∈ M | HM (m) >\nHM (pmax ) − α}.\nLet ǫ be a positive number that is sufficiently small so that the set {z ∈\nCn | N (z) ≤ ǫ} is contained in U . Then the subset of M where HM is\nǫ-close to its maximum HM (p) is contained in f (U ). (See the facts about\nHamiltonian circle actions in §2.)\nLet ρ : [0, ∞) → [0, 1] be a smooth function that is equal to one on [0, ǫ/2]\nand is equal to zero outside [0, ǫ). Use the same symbol, ρ, to denote the\n(λ)\n(ρ*λ)\n(z) is equal to Ht (z)\nfunction z 7→ ρ(N (z)) on Cn . Then the function Ht\nwhen N (z) ≤ ǫ/2 and is equal to −N (z) when N (z) > ǫ.\nThe function on M\n\n(ρ*λ)\n\n(*) ◦ f −1\nHM (pmax ) + Ht\n(λ)\n(11.9) HM t :=\nwhen HM is ǫ-close to its maximum\n\n\nHM\nelsewhere\nis smooth and it generates a deformation of our loop.\n\n\f42\n\nY. KARSHON AND J. SLIMOWITZ\n\nIf the original momentum map HM is normalized, so is the deformed\nHamiltonian (11.9). The argument is similar to (5.18).\nP\n\nLet D be a neighbourhood of the origin in C (ki −1) that is small enough\nso that, for every λ ∈ D, the following facts are true.\n(λ)\n\n- For every t, the function Ht (z) attains its maximum at a unique\npoint of Cn , and this point lies in {z | N (z) ≤ ǫ/4}.\n- This maximum is greater than −ǫ/4.\n- For every ν and z such that 0 ≤ ν ≤ 1 and ǫ/2 ≤ N (z) ≤ ǫ, we have\n(ν*λ)\n(z) ≤ −ǫ/4 for all t.\nHt\n(λ)\n\nThis is possible because Ht (z) is smooth in the variables λ, z, and t, is\nquadratic in z, and is equal to −N (z) when λ = 0.\n(λ)\n(ρ*λ)\n(z) and Ht (z) have the\nThen, for every λ and t, the functions Ht\nsame maximal value, and they attain it at the same (unique) point z.\n(λ)\n\nDenote by ψt the family of loops in Ham(M, ω) that are generated by\nthe functions (11.9). By our choice of D, for every λ ∈ D, the positive Hofer\nlength of the corresponding loop is\nZ 1\n(λ)\n(λ)\nmaxn Ht (z)dt.\nl+ ({ψt }) = HM (pmax ) +\n0 z∈C\n\nBy this and our computation in\n\nCn ,\n\nthe function\n(λ)\n\nλ 7→ l+ ({ψt })\nfrom D to R takes its maximal value at the origin and its Hessian at the\norigin is negative definite. This completes the proof of Theorem 3.17 and\nRemark 3.18.\n\u0003\nReferences\n[1] M. Atiyah, Convexity and commuting hamiltonians, Bull. London Math. Soc. 14\n(1982), 1–15.\n[2] A. Banyaga, Sur la structure du groupe des diffomorphismes qui prservent une forme\nsymplectique, Comment. Math. Helv. 53 (1978), 174–227.\n[3] M. Bialy and L. Polterovich, Geodesics of Hofer's metric on the group of Hamiltonian\ndiffeomorphisms, Duke Math. J. 76 (1994), 273–292.\n[4] V. Guillemin, E. Lerman, and S. Sternberg, Symplectic fibrations and multiplicity\ndiagrams, Cambridge University Press, 1996.\n[5] V. Guillemin and S. Sternberg, Convexity properties of the moment mapping, Invent.\nMath. 67 (1982), 491–513.\n[6] H. Hofer, On the topological properties of symplectic maps, Proceedings of the Royal\nSociety of Edinburgh 115 A (1990), 25–28.\n[7] H. Hofer, Estimates for the energy of a symplectic map, Comment. Math. Helv. 68\n(1993), 48–72.\n\n\fSHORTENING HOFER LENGTH OF CIRCLE ACTIONS\n\n43\n\n[8] H. Hofer and E. Zehnder, Symplectic Invariants and Hamiltonian Dynamics,\nBirkhauser, Boston, MA (1994).\n[9] Y. Karshon and S. Tolman, The Gromov width of complex Grassmannians, Algebraic\nand Geometric Topology 5 (2005), 911–922.\n[10] F. Lalonde and D. McDuff, Hofer's L∞ -geometry: energy and stability of Hamiltonian\nflows parts I and II, Invent. Math. 122 (1995), 1–33 and 35–69.\n[11] F. Lalonde and D. McDuff, Local non-squeezing theorems and stability, Geom. and\nFunc. Analysis vol. 5, No. 2 (1995), 364–386.\n[12] Yi Ming Long, Geodesics in the compactly supported Hamiltnoian diffeomorphisms\ngroup, Math. Z. 220 (1995), no. 2, 279–294.\n[13] D. McDuff, Geometric variants of the Hofer norm, J. Sympl. Geom. 1 (2002), p.197–\n252.\n[14] D. McDuff and J. Slimowitz, Hofer-Zehnder capacity and length minimizing Hamiltonian paths, Geom. Topol. 5 (2001), 799–830.\n[15] D. McDuff and S. Tolman, Topological properties of Hamiltonian circle actions, IMRP\nInt. Math. Res. Pap., (2006), 1–77.\n[16] D. McDuff and S. Tolman, On nearly semifree circle actions, arXiv:math/0503467\n[math.SG].\n[17] J. Milnor, Morse theory, Princeton University Press, 1969.\n[18] L. Polterovich, The geometry of the group of symplectic diffeomorphisms, Lectures in\nMathematics ETH Zrich Birkhäuser Verlag, Basel, 2001.\n[19] Y. Savelyev, Quantum characteristic classes and the Hofer metric, Geom. Topol. 12\n(2008), no. 4, 2277–2326.\n[20] Y. Savelyev, Virtual Morse theory on Ω Ham(M, ω), J. Diff. Geom. 84 (2010), no. 2,\n409–425.\n[21] Y. Savelyev, Proof of the index conjecture in Hofer geometry, arXiv:1204.3098\n[math.SG], to appear in Math. Res. Letters.\n[22] K. Siburg, New minimal geodesics in the group of symplectic diffeomorphisms, Calc.\nVar. Part. Diff. Eq. 3 (1995), 299–309.\n[23] S. Sternberg, Minimal coupling and the symplectic mechanics of a classical particle\nin the presence of a Yang–Mills field, Proc. Nat. Acad. Sci. U.S.A. 74 (1977), no. 23,\n5253–5254.\n[24] I. Ustilovsky, Conjugate points on geodesics of Hofer's metric, Differential Geometry\nand its Applications 6 (1996), 327–342.\n[25] A. Weinstein, Symplectic manifolds and their Lagrangian submanifolds, Advances in\nMathematics 6, 329–346 (1971).\n[26] A. Weinstein, Lectures on symplectic manifolds, CBMS Lecture Notes 29, A.M.S.,\nProvidence RI, 1977.\nDepartment of Mathematics, University of Toronto, 40 St.George Street,\nToronto ON M5S 2E4 Canada\nE-mail address: karshon@math.toronto.edu\nE-mail address: jslimowi@nsf.gov\n\n\f"}