{"id": "http://arxiv.org/abs/1107.1569v2", "guidislink": true, "updated": "2012-01-17T14:03:05Z", "updated_parsed": [2012, 1, 17, 14, 3, 5, 1, 17, 0], "published": "2011-07-08T07:31:46Z", "published_parsed": [2011, 7, 8, 7, 31, 46, 4, 189, 0], "title": "Constraints on Shift-Symmetric Scalar-Tensor Theories with a Vainshtein\n  Mechanism from Bounds on the Time Variation of G", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1107.3585%2C1107.3005%2C1107.4025%2C1107.2548%2C1107.1973%2C1107.1235%2C1107.3860%2C1107.1726%2C1107.5671%2C1107.2056%2C1107.3517%2C1107.3119%2C1107.2763%2C1107.5628%2C1107.5613%2C1107.0321%2C1107.0995%2C1107.4993%2C1107.1569%2C1107.0121%2C1107.3046%2C1107.4015%2C1107.5385%2C1107.1606%2C1107.3463%2C1107.6032%2C1107.1891%2C1107.3751%2C1107.5387%2C1107.0387%2C1107.3902%2C1107.4584%2C1107.0923%2C1107.0976%2C1107.1865%2C1107.4961%2C1107.0035%2C1107.5293%2C1107.2896%2C1107.5974%2C1107.1878%2C1107.1479%2C1107.2061%2C1107.2028%2C1107.0177%2C1107.3931%2C1107.5655%2C1107.4071%2C1107.2499%2C1107.2488%2C1107.5703%2C1107.1794%2C1107.5243%2C1107.5463%2C1107.1332%2C1107.1034%2C1107.2523%2C1107.2637%2C1107.4257%2C1107.2888%2C1107.5029%2C1107.1408%2C1107.4626%2C1107.3181%2C1107.5447%2C1107.2862%2C1107.1617%2C1107.0784%2C1107.2772%2C1107.0498%2C1107.4387%2C1107.4901%2C1107.4779%2C1107.0631%2C1107.2564%2C1107.1246%2C1107.0473%2C1107.3166%2C1107.0542%2C1107.3953%2C1107.3858%2C1107.3516%2C1107.2403%2C1107.2076%2C1107.4084%2C1107.4843%2C1107.4278%2C1107.5057%2C1107.1042%2C1107.4118%2C1107.3112%2C1107.4477%2C1107.0698%2C1107.4888%2C1107.0975%2C1107.4568%2C1107.1842%2C1107.0495%2C1107.1492%2C1107.5319%2C1107.0241&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Constraints on Shift-Symmetric Scalar-Tensor Theories with a Vainshtein\n  Mechanism from Bounds on the Time Variation of G"}, "summary": "We show that the current bounds on the time variation of the Newton constant\nG can put severe constraints on many interesting scalar-tensor theories which\npossess a shift symmetry and a nonminimal matter-scalar coupling. This\nincludes, in particular, Galileon-like models with a Vainshtein screening\nmechanism. We underline that this mechanism, if efficient to hide the effects\nof the scalar field at short distance and in the static approximation, can in\ngeneral not alter the cosmological time evolution of the scalar field. This\nresults in a locally measured time variation of G which is too large when the\nmatter-scalar coupling is of order one.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1107.3585%2C1107.3005%2C1107.4025%2C1107.2548%2C1107.1973%2C1107.1235%2C1107.3860%2C1107.1726%2C1107.5671%2C1107.2056%2C1107.3517%2C1107.3119%2C1107.2763%2C1107.5628%2C1107.5613%2C1107.0321%2C1107.0995%2C1107.4993%2C1107.1569%2C1107.0121%2C1107.3046%2C1107.4015%2C1107.5385%2C1107.1606%2C1107.3463%2C1107.6032%2C1107.1891%2C1107.3751%2C1107.5387%2C1107.0387%2C1107.3902%2C1107.4584%2C1107.0923%2C1107.0976%2C1107.1865%2C1107.4961%2C1107.0035%2C1107.5293%2C1107.2896%2C1107.5974%2C1107.1878%2C1107.1479%2C1107.2061%2C1107.2028%2C1107.0177%2C1107.3931%2C1107.5655%2C1107.4071%2C1107.2499%2C1107.2488%2C1107.5703%2C1107.1794%2C1107.5243%2C1107.5463%2C1107.1332%2C1107.1034%2C1107.2523%2C1107.2637%2C1107.4257%2C1107.2888%2C1107.5029%2C1107.1408%2C1107.4626%2C1107.3181%2C1107.5447%2C1107.2862%2C1107.1617%2C1107.0784%2C1107.2772%2C1107.0498%2C1107.4387%2C1107.4901%2C1107.4779%2C1107.0631%2C1107.2564%2C1107.1246%2C1107.0473%2C1107.3166%2C1107.0542%2C1107.3953%2C1107.3858%2C1107.3516%2C1107.2403%2C1107.2076%2C1107.4084%2C1107.4843%2C1107.4278%2C1107.5057%2C1107.1042%2C1107.4118%2C1107.3112%2C1107.4477%2C1107.0698%2C1107.4888%2C1107.0975%2C1107.4568%2C1107.1842%2C1107.0495%2C1107.1492%2C1107.5319%2C1107.0241&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We show that the current bounds on the time variation of the Newton constant\nG can put severe constraints on many interesting scalar-tensor theories which\npossess a shift symmetry and a nonminimal matter-scalar coupling. This\nincludes, in particular, Galileon-like models with a Vainshtein screening\nmechanism. We underline that this mechanism, if efficient to hide the effects\nof the scalar field at short distance and in the static approximation, can in\ngeneral not alter the cosmological time evolution of the scalar field. This\nresults in a locally measured time variation of G which is too large when the\nmatter-scalar coupling is of order one."}, "authors": ["Eugeny Babichev", "Cedric Deffayet", "Gilles Esposito-Farese"], "author_detail": {"name": "Gilles Esposito-Farese"}, "author": "Gilles Esposito-Farese", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevLett.107.251102", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1107.1569v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1107.1569v2", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "RevTeX4 format; v.2: 5 pages, title changed, matches published\n  version", "arxiv_primary_category": {"term": "gr-qc", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "gr-qc", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "astro-ph.CO", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "hep-th", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1107.1569v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1107.1569v2", "journal_reference": "Phys. Rev. Lett. 107, 251102 (2011)", "doi": "10.1103/PhysRevLett.107.251102", "fulltext": "Constraints on Shift-Symmetric Scalar-Tensor Theories with a Vainshtein Mechanism\nfrom Bounds on the Time Variation of G\nEugeny Babichev,1, 2 Cédric Deffayet,2, 3 and Gilles Esposito-Farèse3\n1\n\narXiv:1107.1569v2 [gr-qc] 17 Jan 2012\n\nLaboratoire de Physique Théorique d'Orsay, Bâtiment 210,\nUniversité Paris-Sud 11, F-91405 Orsay Cedex, France\n2\nAstroParticule & Cosmologie, UMR 7164-CNRS,\nUniversité Denis Diderot-Paris 7, CEA, Observatoire de Paris,\n10 rue Alice Domon et Léonie Duquet, F-75205 Paris Cedex 13, France\n3\nGRεCO, Institut d'Astrophysique de Paris, UMR 7095-CNRS,\nUniversité Pierre et Marie Curie-Paris 6, 98bis boulevard Arago, F-75014 Paris, France\n(Dated: July 7, 2011)\nWe show that the current bounds on the time variation of the Newton constant G can put\nsevere constraints on many interesting scalar-tensor theories which possess a shift symmetry and\na nonminimal matter-scalar coupling. This includes, in particular, Galileon-like models with a\nVainshtein screening mechanism. We underline that this mechanism, if efficient to hide the effects\nof the scalar field at short distance and in the static approximation, can in general not alter the\ncosmological time evolution of the scalar field. This results in a locally measured time variation of\nG which is too large when the matter-scalar coupling is of order one.\nPACS numbers: 04.50.Kd, 98.80.-k\n\nMany theories in which gravity is modified with respect to general relativity (GR) contain, in addition to\nthe metric, a scalar field which is coupled directly to matter. Such scalar-tensor theories appear naturally in low\nenergy limits of string theory and are also obtained from\nphenomenological brane-world constructions (such as the\nDGP model [1]). Some are also of current interest as able\nto produce an interesting cosmology via a large distance\nmodification of gravity. In such theories, in contrast to\nGR, matter not only interacts via the helicity-2 graviton,\nbut also via the exchange of the scalar field. In general,\none faces the following dilemma: Either this field is coupled to matter with gravitational strength, as required\nto produce order one deviations from GR, but then the\ntheory cannot pass local tests of gravity, or the coupling\nis very small, but then there are no significant effects\nof the scalar. A canonical example is the Brans-Dicke\ntheory [2, 3] and its extensions [4] whose parameters are\ntightly constrained by the local tests of gravity and observations of binary pulsars (see for instance [5]).\nA way out of this dilemma is provided by the Vainshtein mechanism, first proposed in the context of massive gravity [6, 7] (a proof was recently provided in [8]).\nIndeed, close to localized bodies, this allows to screen\neffects which lead to large deviations from GR at large\ndistances. This mechanism was also shown to be present\nin the DGP brane model [1] as well as its decoupling limit\n[9]. It was later generalized and shown to apply to a large\nclass of scalar-tensor models, called in [10]\"k-mouflage\"\ngravity models, with a non-linear kinetic self-interaction\nof a scalar field providing a self-screening of the scalar\nforce à la Vainshtein (hence the name k-mouflage). This\nclass contains in particular the Galileon model [11], and\nits covariantized versions [12–15]. Many applications of\nthe Galileon model and its extensions to the late-time\nacceleration, including minimally coupled [16–19] as well\n\nas non-minimally coupled models [20–22], have been considered, while various constraints coming from cosmology as well as from local observations have been studied\n[17, 19, 23–25].\nIn this paper, we point out that in spite of the fact that\nthe Vainshtein screening indeed allows to pass most of\nthe constraints coming from local observations by cutting\noff the spatial variation of the scalar field near massive\nbodies, the tests on the constancy of the Newton constant\nmay easily rule out many models. Indeed, we show that\nin many shift-symmetric models, the evolution with time\nof the scalar field is (approximately) the same everywhere\nand it follows its cosmological behavior. If the scalar is\ndirectly coupled to matter, this induces a variation of\nthe Newton constant G, which is tightly constrained by\na number of observations (see, e.g., the review [26]). The\nmost stringent bounds come from binary-pulsar data [27]\nand above all Lunar Laser Ranging experiments [28], the\nlatter giving |Ġ/G| < 1.3 × 10−12 yr−1 , or in terms of\nthe Hubble value today, H0 , |Ġ/G| < 0.02H0 . As we\nwill see below, the time variation of the scalar field is\ngenerically of order of the Hubble scale H0 (unless it is\nin the \"cosmological\" screening regime with a tiny energy\nscale M ≪ H0 ). This, whenever the direct coupling of\nthe scalar field to matter is of order of one, induces a too\nlarge variation of Newton's constant, |Ġ/G| ∼ H0 .\nWe consider the following general action,\nZ\n√\nM2\nS = P d4 x −g (R + Ls + LNL ) + Sm [g̃μν , ψm ] ,\n2\n(1)\nwhere R is the Ricci scalar of the metric gμν , Ls =\n2\n− (∂φ) is the standard kinetic term of a scalar field φ\n(normalized to be dimensionless), LNL describes some\ngeneric nonlinear self-interaction of φ, and the matter\nfields (collectively denoted as ψm ) are minimally coupled\n\n\f2\nto the physical metric g̃μν = A2 (φ)gμν . Because of this\ncoupling, gravity is modified at large distances through\na scalar exchange, while GR is supposed to be restored\nat small distances thanks the Vainshtein screening effect\nmade possible by the self-interaction LNL . This screening occurs for rather generic nonlinear interaction terms\nLNL [10] and we do not specify a precise from of it. We\nhowever assume that LNL is shift symmetric, i.e., it does\nnot change under the transformation φ → φ + const. For\nexample, we can choose LNL to be in the Galileon or kessence families. For dimensional reasons LNL must contain a mass scale M . We will assume that this is the only\nadditional scale entering our action. In general, this scale\nis fixed by phenomenological requirements, e.g. to get\npresent day acceleration of the Universe from Galileons,\nM should be of order of the Hubble scale H0 .\nNote that by a conformal transformation, action (1)\ncan always be rewritten in a form where matter is only\nminimally coupled to one metric g̃μν , going to the socalled Jordan frame. Here we will work rather in the\nEinstein frame (1), with the understanding that our results would apply to any theory whose action can be put\nin the form (1) by a suitable field redefinition. We will\nalso not consider effects that can arise, even in theories\nwith minimal coupling to gravity in the Einstein frame,\ndue to the non-linear kinetic coupling of the graviton to\nthe scalar field (called \"kinetic braiding\" in [16]).\nThe variation of Eq. (1) with respect to the metric gμν\ngives the (modified) Einstein equations,\n(st)\n(NL)\n(m)\nMP2 Gμν = Tμν\n+ Tμν\n+ Tμν\n,\n(st)\n\n(NL)\n\n(2)\n\n(m)\n\nwhere Tμν , Tμν and Tμν are respectively the energymomentum tensors for the standard scalar kinetic term,\nits nonlinear term, and the matter contribution. The\nequation of motion for the scalar field is\nμ\n∇μ (∇μ φ + JNL\n) = −α(φ)MP−2 T (m) ,\n\n(3)\nμ\nJNL\n\nis\nwhere α(φ) ≡ d ln (A) /dφ, the nonlinear current\nobtained by variation of LNL with respect to the gradient\nμ\nof the scalar field, JNL\n≡ − 12 δLNL /δφ,μ , and T (m) is\nthe trace of the matter energy-momentum tensor in the\nEinstein frame. Note that the field equations (3) can\nalways be written as the divergence of a current, because\nof shift symmetry. We also rescale the Planck mass so\nthat A(φ) = 1 at present. We stress that the trace of the\nmatter energy-momentum tensor defined in the Einstein\n(m)\nframe, Tμν , differs by the factor A4 (φ) from the trace of\nthe (conserved) Jordan-frame energy momentum tensor.\nHowever, as we will see below, the time variation of φ is\nsmall (of order of the Hubble scale or less), so that the\nchange of φ with time can be neglected in the r.h.s. of (3),\ngiving only small corrections. For instance, if A(φ) = eφ ,\nthe approximation A4 (φ) ≈ 1 is valid for |φ| ≪ 1, i.e.,\nfor |∆t| ≪ H −1 .\nThe cosmological evolution of the scalar field, φcosm (t)\ncan be easily read from (3),\n\u0001\n0\n= α(φ)MP−2 T (m) . (4)\nφ̈cosm + 3H φ̇cosm − ∇0 JNL\n\nThree different cosmological regimes can be identified.\nIn a regime where the cosmological energy density of the\nscalar field, ρφ , is subdominant compared to the matter energy density, ρm , ρφ ≪ ρm , the scalar field equation (4) is decoupled from the metric equation (2). Then\nfrom the Einstein equations it follows that ρm = 3MP2 H 2 ,\nthus the r.h.s. of (4) is ∼ αH 2 . If the scalar field is\naway from the \"cosmological\" Vainshtein regime (i.e.,\nwhen the nonlinear term in the l.h.s. of (4) is negligible), then from Eq. (4) one can see that a particular\nsolution to (4) is |φ̇cosm | ∼ αH. Notice that the general\nsolution also\na homogeneous decaying solution\n\u0001\nR contains\nC0 exp −3 dtH with an arbitrary constant C0 , however unless this constant (or, equivalently, the initial condition) is fine tuned, the time variation of φ remains of\norder of αH.\nIn the second regime matter is again dominant, ρφ ≪\nρm , but the scalar field is in the cosmological Vainshtein\nregime. Then Eq. (4) contains, in addition to H, also the\n\"nonlinear\" scale M . Therefore the solution to (4) generically contains a combination of scales H and M . When\nthis scale is small with respect to H0 , the time evolution\nof φcosm may thus be suppressed, |φ̇cosm | ≪ H0 . This is\nthe cosmological analog of the original Vainshtein mechanism.\nThe third regime is realized in the case when the scalar\nfield is dominant, ρφ ≫ ρm , and in particular when the\nlate-time acceleration of the Universe is driven by the\nscalar field. In this case, both the metric and the scalar\nfield equations depend only on one dimensionful parameter, M , which is of order of H0 . We thus conclude that\nthe typical value of the present variation of the scalar\nfield is the Hubble scale, |φ̇cosm | ∼ H0 .\nLet us consider now the local effects caused by the\nconformal coupling of the scalar field. For a slow time\nevolution, φcosm (t) can be written as the linear approximation,\nφcosm (t) = φcosm (t0 ) + φ̇cosm (t0 ) t.\n\n(5)\n\nNote that (5) imposes the boundary value of the field far\nfrom localized sources. The solution to the full equation\nof motion (3) at any point of space-time (including the\nregions close to massive bodies, in particular, inside the\nVainshtein radius) depends on both time and space coordinates. The key observation here is that thanks to the\nshift symmetry of the equation of motion, the PDE (3)\nallows separation of variables in the following way,\nφ(t, r) = φ(r) + φ̇cosm (t0 )t + φcosm (t0 ),\n\n(6)\n\nwhere r is the distance to the source. It is not difficult\nto see that the above ansatz (which has also been used\nin other contexts [29]) \"passes through\" the full equation\nof motion (3), giving an ordinary differential equation of\nthe second-order on φ(r), with possible remnants from\nthe time-dependence in a form of a constant, φ̇cosm (t0 ).\nThe last two terms in the above ansatz give the boundary\ncondition for the PDE imposed by the cosmological evolution (5), provided we choose the radial dependent part\n\n\f3\nof (5), φ(r), to vanish at infinity. Now, the ODE on φ(r)\nis of the second order, and supplied with two boundary\nconditions, φ(r = ∞) = 0 and φ′ (r = 0) = 0 (the last\none comes from the regularity at the origin), which is\nin general sufficient to find a unique solution. Provided\nthat this solution is non singular (which is in some cases\na strong mathematical requirement), and assuming that\n(5) is a good approximation for the time-dependent cosmological evolution of φ, our ansatz gives a solution for\nall times to the field equation (3) for a spherical source\ncentered at r = 0. The key point of this paper is that the\ntime derivative of φ(t, r) is found to be independent of\nr, i.e., it is set by the cosmological evolution even inside\nthe regions where the Vainshtein screening operates.\nIt is worth mentioning that our ansatz (6) and boundary conditions are in fact selecting a particular class of solutions. Indeed, if formulated in terms of a Cauchy problem, they implies φ(t = 0, r) = φ(r) and φ̇(t = 0, r) =\nφ̇cosm (t0 ). In principle, there is no reason not to choose\nsome radially dependent initial velocity, φ̇(r) = C(r). In\ncontrast to (6), such solutions, however, are not stationary, and they should relax to the stationary one, assuming that the latter is stable. A numerical check of this\nrelaxation, as required by the nature of the field equations, goes however far beyond the scope of this paper.\nLet us consider a couple of illustrative examples. First,\nas the non-linear term, we take one of the Galileon Lagrangians, namely,\nLNL = −M −2 \u0003φ(∂φ)2 ,\n\n(7)\n\nand the coupling to matter A(φ) = eφ . It is not difficult to find that the evolution of φcosm in two different\ncosmological regimes is in accord to our general findings\n(we assume here a vanishing cosmological constant): (i)\nwhen ρφ ≪ ρm and the nonlinear term is subdominant\nin (4) then φ̇cosm = −2H; (ii) when ρφ ≪ ρm and the\nnonlinear term is dominant in (4) then φ̇2cosm = 2M 2 /3.\nThe time dependent solution for the scalar field around\na body of mass m is then given by (6) with,\ns\n\"\n\u0012\n\u0013#\n2\n2\nφ̇\n16Gm\nrM\n−1 + 1 +\n1 + cosm\n. (8)\nφ′ (r) =\n4\nM 2 r3\n2M 2\nNote that the last piece inside the parentheses is due\nto the cosmological time evolution of φ. As a second\nexample we consider a scalar field Lagrangian with the\nthe signs of the scalar field kinetic terms flipped with\nrespect to previous example, and the coupling to matter\nA(φ) = e−φ . This Lagrangian√ allows self-accelerating\n√\nsolution [16], with H 2 = M 2 /(3 6) and φ̇ = 6H, while\nthe time-dependent stationary solution for the scalar field\nis still given by (6) with the same radial-dependent part\n(8).\nThe time-dependence of φ leads to a variation of the\neffective Newton constant with time. This can be seen\nby making the conformal transformation to the Jordan\n(physical) frame, with the metric g̃μν . Generically, there\n\nare two effects, which enter the final result for the evolution of Newton's constant: the exchange of helicity-0\nmodes and the rescaling of the coordinates via the conformal transformation of the metric. It should be noted\nthat in standard scalar-tensor theories (without screening\nmechanisms), these effects are of the same order, so that\nthey even can compensate each others (as in Barker's\ntheory [30]) giving no change of G. In our case, however, the exchange of φ is screened by the Vainshtein\nmechanism, so that only one effect - the stretching\nof coordinates - is important. As a result, the effective Planck mass in the action gains a dependence on\nφcosm (t), M̃P = A−1 (φcosm ) MP . Thus, the observed\nNewton constant evolves with time as\nĠ/G ≈ 2αφ̇cosm (t).\n\n(9)\n\nAs we have seen before, depending on the regime,\n|φ̇cosm | ∼ αH (in the matter domination regime) or\n|φ̇cosm | ∼ H (when the scalar field is dominant). Therefore, presently one has |Ġ/G| ∼ α2 H0 if the scalar field\nis subdominant and away from the cosmological screening, and |Ġ/G| ∼ αH0 when the scalar field is dominant,\nin particular, when it drives the late-time acceleration of\nthe universe. This applies in particular for a constant α,\ni.e., a conformal coupling g̃μν = e2αφ gμν .\nThe observational constraints from Lunar Laser Ranging give |Ġ/G| < 0.02H0 which is enough to rule out\ntheories of the kind considered here with a scalar coupling to matter of the order of the gravitational one (i.e.,\nα ≈ 1). In order for a theory to explain the accelerated expansion of the universe at present days, and pass\nthe constraints on the variation of G, one should assume\nα < 0.01. It is interesting to note that a similar constraint on the matter-scalar coupling constant was obtained for the covariant Galileon theory from a combined\nanalysis of supernovae, baryonic acoustic oscillations and\ncosmic microwave background [22].\nLet us now briefly discuss the case of non shiftsymmetric theories. There is a class of such theories\nwhich can be put in the form (1) by suitable field redefinitions, in which case our conclusions apply. When\nthis is not the case, the situation must be carefully reanalyzed. Indeed, the fact that the ansatz (6) leads to\na mere ODE to solve for φ(r) is a direct consequence of\nthe shift symmetry and it might be that some screening\nof the time variation of G occurs when this symmetry is\nlost. For example, we may introduce a mass term in the\naction, m2 φ2 , which explicitly breaks the shift symmetry. If the mass is big enough (say, much bigger than the\npresent Hubble scale, H0 ), then the cosmological evolution of φ is suppressed, because the scalar follows the\nminimum of the effective potential, φ̇min ∼ αH Ḣ/m2 .\nHowever, such theories do not possess either an interesting self-accelerating scenario driven by the kinetic term.\nWe also stress that even in the shift-symmetric case, it\nmight be that the ODE obeyed by φ(r) does not possess\nregular solutions, or that it leads to a stationary solution\n(6) which happens to be unstable as a solution of the\n\n\f4\nPDE (3). If so, it may open a way out of our conclusions,\nnecessitating the use of a more general ansatz than (6) to\nsolve the field equations, which could in turn result in a\nVainshtein suppression of the time variation of G in the\nsolar system.\nIt is also interesting to mention another possibility of\navoiding any significant time evolution of G, namely, to\nviolate our assumption of a conformal matter-scalar coupling. In particular, in the relativistic MOND theory,\ncalled TeVeS [31], where the physical metric is related to\nthe Einstein one in a disformal way, the time variation\nof the Newton constant is strictly zero [32]. This is a\nconsequence of the different scalings of time and space\ncoordinates with A(φcosm ) when one imposes that the\nphysical metric g̃μν tends to the Minkowski metric at\nspatial infinity. This absence of time variation of G also\napplies to other theories with disformal coupling, in particular to the improved relativistic MOND [33], where the\nk-mouflage screening has been used to pass solar-system\nand binary-pulsar constraints.\nLet us finally underline that the DGP brane model,\nalthough equivalent to a scalar-tensor theory of the\nGalileon type in the UV (in particular in the decoupling\nlimit [9]), is not fully described by such a theory at cosmological scales (IR limit). Therefore our analysis does not\napply to the DGP model, and this explains why Ref. [34]\ndid not find any local time variation of G.\nTo conclude, we have shown that a generic scalartensor theory with conformal coupling of a scalar field\nto matter, and with a shift symmetry of the scalar La-\n\ngrangian, is tightly constrained by the bounds on time\nvariation of the Newton constant. The models which fall\ninto this category are not only standard (massless) BransDicke-like theories, but also those featuring a Vainshtein\nscreening mechanism due to the kinetic self-coupling, in\nparticular non-minimally coupled Galileon models. We\nargued that the local time evolution of the scalar field\nis set by its cosmological evolution and not screened by\nthe Vainshtein effect, which is only able to suppress the\n\"fifth force\" due to the exchange of helicity-0 degree of\nfreedom. The time derivative of the scalar field is of\norder of the Hubble scale, unless the whole universe is\nin the screening regime (\"cosmological\" Vainshtein effect\nwith M ≪ H0 ). This induces a time evolution of Newton's constant of the same order. This result applies for\nboth the matter domination and the scalar field domination cosmological regimes. It also does not depend on\na particular form of the non-linear self-interaction term,\nprovided it is shift-symmetric. The key point is that the\ntime dependence in (6), which is crucial in (9), is the\nsame irrespectively of the precise structure of LNL . The\nevolution of the Newton constant is, however, tightly constrained by observations, |Ġ/G| . 0.02H0 , therefore the\nconformal coupling on such theories is constrained too.\nFor example, if the non-minimal coupling is of the form\nexp (2αφ), then |α| should be less than 10−2 .\n\n[1] G. R. Dvali, G. Gabadadze, and M. Porrati, Phys. Lett.\nB 485, 208 (2000) [arXiv:hep-th/0005016].\n[2] P. Jordan, Nature (London) 164, 637 (1949); Schwerkraft\nund Weltall (Vieweg, Braunschweig, 1955); Z. Phys. 157,\n112 (1959); M. Fierz, Helv. Phys. Acta 29, 128 (1956).\n[3] C. Brans and R. H. Dicke, Phys. Rev. 124, 925 (1961).\n[4] T. Damour and G. Esposito-Farèse, Class. Quant. Grav.\n9, 2093 (1992).\n[5] G. Esposito-Farèse, Fundam. Theor. Phys. 162, 461\n(2011) [arXiv:0905.2575 [gr-qc]].\n[6] A. I. Vainshtein, Phys. Lett. B 39, 393 (1972).\n[7] C. Deffayet, G. R. Dvali, G. Gabadadze, and A. I. Vainshtein, Phys. Rev. D 65, 044026 (2002) [hep-th/0106001].\n[8] E. Babichev, C. Deffayet, and R. Ziour, Phys. Rev. Lett.\n103, 201102 (2009) [arXiv:0907.4103 [gr-qc]]; Phys. Rev.\nD 82, 104008 (2010) [arXiv:1007.4506 [gr-qc]]; JHEP\n0905, 098 (2009) [arXiv:0901.0393 [hep-th]].\n[9] M. A. Luty, M. Porrati, and R. Rattazzi, JHEP 0309,\n029 (2003) [arXiv:hep-th/0303116 [hep-th]].\n[10] E. Babichev, C. Deffayet, and R. Ziour, Int. J. Mod.\nPhys. D 18, 2147 (2009) [arXiv:0905.2943 [hep-th]].\n[11] A. Nicolis, R. Rattazzi, and E. Trincherini, Phys. Rev. D\n79, 064036 (2009) [arXiv:0811.2197 [hep-th]].\n[12] G. W. Horndeski, Int. J. Theor. Phys. 10, 363 (1974).\n[13] C. Deffayet, G. Esposito-Farèse, and A. Vikman, Phys.\nRev. D 79, 084003 (2009) [arXiv:0901.1314 [hep-th]].\n[14] C. Deffayet, S. Deser, and G. Esposito-Farèse, Phys. Rev.\n\nD 80, 064015 (2009) [arXiv:0906.1967 [gr-qc]]; Phys. Rev.\nD 82, 061501 (2010) [arXiv:1007.5278 [gr-qc]].\nC. Deffayet, X. Gao, D. A. Steer, and G. Zahariade,\narXiv:1103.3260 [hep-th].\nC. Deffayet, O. Pujolas, I. Sawicki, and A. Vikman,\nJCAP 1010, 026 (2010) [arXiv:1008.0048 [hep-th]].\nS. Nesseris, A. De Felice, and S. Tsujikawa, Phys. Rev.\nD 82, 124054 (2010) [arXiv:1010.0407 [astro-ph.CO]].\nA. De Felice and S. Tsujikawa, Phys. Rev. Lett. 105,\n111301 (2010) [arXiv:1007.2700 [astro-ph.CO]].\nA. De Felice, R. Kase, and S. Tsujikawa, Phys. Rev. D\n83, 043515 (2011) [arXiv:1011.6132 [astro-ph.CO]].\nN. Chow and J. Khoury, Phys. Rev. D 80, 024037 (2009)\n[arXiv:0905.1325 [hep-th]].\nF. P. Silva and K. Koyama, Phys. Rev. D 80, 121301\n(2009) [arXiv:0909.4538 [astro-ph.CO]]; A. De Felice\nand S. Tsujikawa, arXiv:1008.4236 [hep-th]; R. Gannouji and M. Sami, Phys. Rev. D 82, 024011 (2010)\n[arXiv:1004.2808 [gr-qc]]; A. De Felice, S. Mukohyama,\nand S. Tsujikawa, Phys. Rev. D 82, 023524 (2010)\n[arXiv:1006.0281 [astro-ph.CO]]; A. De Felice and S. Tsujikawa, JCAP 1007, 024 (2010) [arXiv:1005.0868 [astroph.CO]].\nA. Ali, R. Gannouji, and M. Sami, Phys. Rev. D 82,\n103015 (2010) [arXiv:1008.1588 [astro-ph.CO]].\nP. Brax, C. Burrage, and A.-C. Davis, [arXiv:1106.1573\n[hep-ph]]; C. Burrage and D. Seery, JCAP 1008, 011\n\nWe thank Jérôme Martin for discussions. The work\nof C.D. and G.E.-F. was in part supported by the ANR\ngrant \"THALES\".\n\n[15]\n[16]\n[17]\n[18]\n[19]\n[20]\n[21]\n\n[22]\n[23]\n\n\f5\n(2010) [arXiv:1005.1927 [astro-ph.CO]].\n[24] T. Kobayashi, Phys. Rev. D 81, 103533 (2010)\n[arXiv:1003.3281 [astro-ph.CO]].\n[25] T. Kobayashi, H. Tashiro, and D. Suzuki, Phys. Rev. D\n81, 063513 (2010) [arXiv:0912.4641 [astro-ph.CO]].\n[26] C. M. Will, Living Rev. Rel. 9, 3 (2005) [gr-qc/0510072].\n[27] A. T. Deller, J. P. W. Verbiest, S. J. Tingay,\nand M. Bailes, Astrophys. J. 685, L67 (2008)\n[arXiv:0808.1594 [astro-ph]]; K. Lazaridis, N. Wex\net al., Mon. Not. R. Astron. Soc. 400, 805 (2009)\n[arXiv:0908.0285 [astro-ph.GA]].\n[28] J. G. Williams, S. G. Turyshev, and D. H. Boggs, Phys.\nRev. Lett. 93, 261101 (2004) [arXiv:gr-qc/0411113].\n[29] E. Babichev, Phys. Rev. D 83, 024008 (2011)\n[arXiv:1009.2921 [hep-th]].\n\n[30] B. M. Barker, Astrophys. J. 219, 5 (1978).\n[31] J. D. Bekenstein, Phys. Rev. D 48, 3641 (1993)\n[arXiv:gr-qc/9211017];\nJ.\nD.\nBekenstein\nand\nR. H. Sanders, Astrophys. J. 429, 480 (1994)\n[arXiv:astro-ph/9311062]; R. H. Sanders, Astrophys. J.\n480, 492 (1997) [arXiv:astro-ph/9612099]; J. D. Bekenstein, Phys. Rev. D 70, 083509 (2004) [Erratum-ibid. D\n71, 069901 (2005)] [arXiv:astro-ph/0403694].\n[32] J. D. Bekenstein and E. Sagi, Phys. Rev. D 77, 103512\n(2008) [arXiv:0802.1526 [astro-ph]].\n[33] E. Babichev, C. Deffayet, and G. Esposito-Farèse,\narXiv:1106.2538 [gr-qc].\n[34] A. Lue and G. Starkman, Phys. Rev. D67, 064002 (2003)\n[astro-ph/0212083].\n\n\f"}