{"id": "http://arxiv.org/abs/0901.1327v1", "guidislink": true, "updated": "2009-01-09T23:08:02Z", "updated_parsed": [2009, 1, 9, 23, 8, 2, 4, 9, 0], "published": "2009-01-09T23:08:02Z", "published_parsed": [2009, 1, 9, 23, 8, 2, 4, 9, 0], "title": "X-ray emission from GPS and CSS sources", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0901.0776%2C0901.2574%2C0901.1387%2C0901.0083%2C0901.4646%2C0901.0633%2C0901.0422%2C0901.3460%2C0901.4569%2C0901.1418%2C0901.4745%2C0901.4068%2C0901.2027%2C0901.1913%2C0901.4662%2C0901.3034%2C0901.3246%2C0901.4202%2C0901.4672%2C0901.4689%2C0901.2323%2C0901.0288%2C0901.3623%2C0901.1905%2C0901.1071%2C0901.2273%2C0901.4299%2C0901.4304%2C0901.4813%2C0901.4441%2C0901.3014%2C0901.0272%2C0901.0414%2C0901.4729%2C0901.0299%2C0901.0941%2C0901.2895%2C0901.0887%2C0901.4674%2C0901.1021%2C0901.3757%2C0901.2064%2C0901.0400%2C0901.1610%2C0901.1414%2C0901.1042%2C0901.4268%2C0901.2987%2C0901.0325%2C0901.3367%2C0901.1513%2C0901.1241%2C0901.1616%2C0901.4800%2C0901.4789%2C0901.3153%2C0901.2079%2C0901.4914%2C0901.3467%2C0901.0691%2C0901.1309%2C0901.4873%2C0901.1907%2C0901.2439%2C0901.4829%2C0901.2120%2C0901.2691%2C0901.0987%2C0901.1339%2C0901.0842%2C0901.1960%2C0901.1696%2C0901.0738%2C0901.2648%2C0901.1265%2C0901.4629%2C0901.0013%2C0901.1327%2C0901.0445%2C0901.3682%2C0901.3796%2C0901.0898%2C0901.0957%2C0901.1850%2C0901.3966%2C0901.1104%2C0901.1665%2C0901.1853%2C0901.3527%2C0901.0619%2C0901.1013%2C0901.1085%2C0901.4242%2C0901.4412%2C0901.2328%2C0901.3340%2C0901.0467%2C0901.3818%2C0901.3183%2C0901.4382%2C0901.2086&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "X-ray emission from GPS and CSS sources"}, "summary": "Many X-ray observations of GigaHertz Peaked Spectrum and Compact Steep\nSpectrum sources have been made with Chandra X-ray Observatory and XMM-Newton\nObservatory over the last few years. The X-ray spectra contribute the important\ninformation to the total energy distribution of the compact radio sources. In\naddition the spatial resolution of Chandra allows for studies of the X-ray\nmorphology of these sources on arcsec scales and provide a direct view of their\nenvironments. This paper gives a review of the current status of the X-ray\nobservations and their contribution to our understanding of the nature of these\ncompact radio sources. It also describes primary physical processes that lead\nto the observed X-ray emission and summarize X-ray emission properties expected\nfrom interactions between an expanding radio source and the intergalactic\nenvironment.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0901.0776%2C0901.2574%2C0901.1387%2C0901.0083%2C0901.4646%2C0901.0633%2C0901.0422%2C0901.3460%2C0901.4569%2C0901.1418%2C0901.4745%2C0901.4068%2C0901.2027%2C0901.1913%2C0901.4662%2C0901.3034%2C0901.3246%2C0901.4202%2C0901.4672%2C0901.4689%2C0901.2323%2C0901.0288%2C0901.3623%2C0901.1905%2C0901.1071%2C0901.2273%2C0901.4299%2C0901.4304%2C0901.4813%2C0901.4441%2C0901.3014%2C0901.0272%2C0901.0414%2C0901.4729%2C0901.0299%2C0901.0941%2C0901.2895%2C0901.0887%2C0901.4674%2C0901.1021%2C0901.3757%2C0901.2064%2C0901.0400%2C0901.1610%2C0901.1414%2C0901.1042%2C0901.4268%2C0901.2987%2C0901.0325%2C0901.3367%2C0901.1513%2C0901.1241%2C0901.1616%2C0901.4800%2C0901.4789%2C0901.3153%2C0901.2079%2C0901.4914%2C0901.3467%2C0901.0691%2C0901.1309%2C0901.4873%2C0901.1907%2C0901.2439%2C0901.4829%2C0901.2120%2C0901.2691%2C0901.0987%2C0901.1339%2C0901.0842%2C0901.1960%2C0901.1696%2C0901.0738%2C0901.2648%2C0901.1265%2C0901.4629%2C0901.0013%2C0901.1327%2C0901.0445%2C0901.3682%2C0901.3796%2C0901.0898%2C0901.0957%2C0901.1850%2C0901.3966%2C0901.1104%2C0901.1665%2C0901.1853%2C0901.3527%2C0901.0619%2C0901.1013%2C0901.1085%2C0901.4242%2C0901.4412%2C0901.2328%2C0901.3340%2C0901.0467%2C0901.3818%2C0901.3183%2C0901.4382%2C0901.2086&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Many X-ray observations of GigaHertz Peaked Spectrum and Compact Steep\nSpectrum sources have been made with Chandra X-ray Observatory and XMM-Newton\nObservatory over the last few years. The X-ray spectra contribute the important\ninformation to the total energy distribution of the compact radio sources. In\naddition the spatial resolution of Chandra allows for studies of the X-ray\nmorphology of these sources on arcsec scales and provide a direct view of their\nenvironments. This paper gives a review of the current status of the X-ray\nobservations and their contribution to our understanding of the nature of these\ncompact radio sources. It also describes primary physical processes that lead\nto the observed X-ray emission and summarize X-ray emission properties expected\nfrom interactions between an expanding radio source and the intergalactic\nenvironment."}, "authors": ["Aneta Siemiginowska"], "author_detail": {"name": "Aneta Siemiginowska"}, "author": "Aneta Siemiginowska", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1002/asna.200811172", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0901.1327v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0901.1327v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "6 pages, 9 figures, to appear in the proceedings of the '4th Workshop\n  on Compact Steep Spectrum and Gigahertz-Peaked Spectrum Radio Sources', AN in\n  press", "arxiv_primary_category": {"term": "astro-ph.HE", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph.HE", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0901.1327v1", "affiliation": "Harvard-Smithsonian Center for Astrophysics", "arxiv_url": "http://arxiv.org/abs/0901.1327v1", "journal_reference": null, "doi": "10.1002/asna.200811172", "fulltext": "Astron. Nachr. / AN 999, No. 88, 789 – 795 (2006) / DOI please set DOI!\n\nX-ray Emission from GPS and CSS Sources\nAneta Siemiginowska1,⋆\nHarvard-Smithsonian Center for Astrophysics, 60 Garden St., Cambridge, MA 02138, USA\n\narXiv:0901.1327v1 [astro-ph.HE] 9 Jan 2009\n\nThe dates of receipt and acceptance should be inserted later\nKey words\n\nX-rays: galaxies - active, jets - radio\n\nMany X-ray observations of GigaHertz Peaked Spectrum and Compact Steep Spectrum sources have been made with\nChandra X-ray Observatory and XMM-Newton Observatory over the last few years. The X-ray spectra contribute the\nimportant information to the total energy distribution of the compact radio sources. In addition the spatial resolution of\nChandra allows for studies of the X-ray morphology of these sources on arcsec scales and provide a direct view of their\nenvironments. This paper gives a review of the current status of the X-ray observations and their contribution to our\nunderstanding of the nature of these compact radio sources. It also describes primary physical processes that lead to the\nobserved X-ray emission and summarize X-ray emission properties expected from interactions between an expanding\nradio source and the intergalactic environment.\nc 2006 WILEY-VCH Verlag GmbH & Co. KGaA, Weinheim\n\n1 Introduction\nA standard picture of a radio source shows a large scale\nemission in forms of lobes and hot spots that are often connected to the radio core by narrow jets. Such emission spans\nhundreds of kiloparsecs and can be studied in details in\nnearby sources, for example in the closest powerful FRII\nradio source Cygnus A (FR II, z = 0.056). However, the\nmorphology of the X-ray emission is very different. The\nChandra X-ray Observatory image of Cygnus A (Wilson,\nYoung & Shopbell 2000, Smith et al. 2002) shows a more\ncircular diffuse X-ray emission surrounding the radio source\nwith two prominent hot spots and a filamentary structure. A\nprimary source of this X-ray emission is a hot (a few keV)\nthermal cluster gas, while the radio emission is mainly due\nto non-thermal particles accelerated in the jet, lobes and hot\nspots.\nThe nearby (3.7 Mpc) radio source Centaurus A is much\nsmaller than Cygnus A. It has a double lobe radio structure\nonly slightly larger than its host galaxy. The source morphology is very rich, showing an absorbed core, dust lanes,\njet, counter-jet, radio lobes and shocks in multi-wavelength\nobservations. X-ray emitting components can be resolved in\nX-rays because of the source proximity. They provide critical information about the physics and processes that are\nhappening in this source (e.g. Kraft et al. 2007). GPS radio sources are embedded within the host galaxy and their\nmulti-wavelength morphology might be similar to Cen A.\nHowever, if they are more distant their X-ray components\nmay not be resolved.\nWhat type of processes can generate an X-ray emission?\nThermal emission is associated with a hot plasma with temperatures of a few keV and is observed in clusters of galax⋆ Corresponding author: e-mail: asiemiginowska@cfa.harvard.edu\n\nies or halos of some active galaxies. There have been some\nfailed attempts to detect such emission surrounding GPS\nsources in the past searches for a \"confinement medium\"\nof the radio source (Antonelli & Fiore 1997, O'Dea et al.\n2000, Siemiginowska et al. 2003) in the past. Non-thermal\nemission associated with relativistic particles requires acceleration processes and is observed in jets, or shock regions\nresulting from interactions between the radio source and the\nISM. Relativistic particles emit radio synchrotron photons\nand radio observations can give information about the distribution of particles. X-ray synchrotron emission requires\nvery high energy electrons (γ ∼ 107 − 108 ) that have short\n(∼ 10 years) synchrotron life times. Therefore any X-ray\nsynchrotron emission requires an on-going re-acceleration\nprocess.\nStudies of interactions between the radio source and the\ninterstellar and intergalactic medium can provide information about the energy that is deposited into the IGM by the\nexpanding radio source. This is important to our understanding of the feedback process. GPS/CSS sources are observed\nat the early stage of their growth, where such interactions\nare strong. In addition theoretical models predict that a relatively strong X-ray emission should be associated with GPS\nand CSS sources.\n\n2 X-ray Emission of Radio Sources: Models\nThere are several theoretical predictions of the X-ray emission from evolving radio sources. Begelman & Cioffi (1989)\nfollowing Scheuer (1974), draw a general picture of an\nevolving radio source where the shocked IGM creates an\noverpressured cocoon surrounding a double radio structure\nwith lobes, jets and a bow shock bounding the cocoon. The\nshock heated material emits X-rays. Reynolds, Heinz &\nBegelman (2001) present numerical simulations of a radio\n\nc 2006 WILEY-VCH Verlag GmbH & Co. KGaA, Weinheim\n\n\f790\n\nsource expansion within a uniform medium with three\nphases of the evolution: a supersonic cocoon, subsonic sideways expansion with a weak shock and supersonic jet, and\na final sonic boom phase. Each phase is characterized by a\ndifferent morphology of the X-ray emitting gas that is being heated by the expanding source. Sutherland & Bicknell\n(2007a, 2007b) shows a similar view of the radio source\nevolution within a clumpy medium (see also Bicknell &\nSutherland 2006). Also in this simulations the X-ray emission is the result of interactions and the X-ray luminosity depends on the density and clumpiness of the medium. They\ndiscuss the time dependent (0.1-10 keV) X-ray emissivity\nwith the maximum of the X-ray luminosity reached within\nthe first few ∼ 104 years.\nHeinz, Reynolds & Begelman (1998) consider an evolution of GPS sources within the uniform environment of the\nhost galaxy. The simulated X-ray surface brightness shows\nthe shock discontinuity moving outwards with time. X-ray\ndetections of such discontinuity require high spatial resolution and dynamic range observations in nearby sources. The\nshock of Cen A is seen as a factor of ∼ 10 jump at ∼ 7 kpc\naway from the nucleus and it is ∼ 600 pc wide (Kraft et\nal. 2007). It has not been detected in any observations of\nGPS sources so far, possibly due to the requirement of high\nsignal-to-noise data and spatial resolution that have not been\nobtained in the existing observations.\nRecently Stawarz et al.(2008) presented a spectral emission model for GPS sources (see also Ostorero et al. in this\nProceedings). The main contribution to the spectral energy\ndistribution comes from the radio lobes and hot spots of the\n< 1 kpc size radio source embedded in the radiation field of\nthe host galaxy. The X-ray emission is due to Inverse Compton scattering off the relativistic electrons within the radio\nsource. The UV-disk photons and IR-dust photons provide\nthe external radiation field to the hot spots, lobes and jet.\nThis field dominates in smaller sources, while the synchroton photon field intrinsic to the lobes dominates in larger\nsources, and GPS/CSS sources exceeding 1 kpc in size will\nbe dominated by the synchrotron self-Compton emission\nprocess in the X-ray band. The predicted X-ray luminosity\ndepends on a few model parameters such as a jet power,\nphoton fields and the density of the ISM. Note that this\nmodel relates the X-ray emission to the radio source components while the simulations described above consider the\nemission from the hot gas heated by the radio source.\nBoth type of the X-ray emission, thermal and nonthermal, will be present in GPS sources. Hot thermal gas\nwill produce an X-ray spectrum with emission lines, while\nthe non-thermal continuum does not have any spectral features. High resolution X-ray spectra are needed in order to\ndisentangle these two emission components.\n\n3 X-ray Observations of GPS/CSS Sources\nBefore Chandra and XMM-Newton there was only one GPS\ngalaxy detected in X-rays by ASCA (O'Dea et al. 2000) and\n\nc 2006 WILEY-VCH Verlag GmbH & Co. KGaA, Weinheim\n\nAneta Siemiginowska: X-ray Emission\n\nFig. 1\nLeft: XMM-Newton EPIC X-ray image of\nMkn668 (z=0.076). A 30′′ radius circle is marked around\nthe source. The source is unresolved on this scale. A 30′′\nscale bar equivalent to 44 kpc is shown in the right corner.\nRight: Chandra ACIS-S image of Q1143-245 at z=1.95.\n5′′ scale corresponding to 42.6 kpc at the source redshift is\nmarked in the left corner. Note that the radio source size is\nmuch smaller than the resolution of these two instruments.\nseveral GPS quasars detected with HEAO-1 and ROSAT\n(see O'Dea 1998 for a summary). During the last decade\nthere have been several efforts to increase the number of\nX-ray detections. Guainazzi et al. (2004, 2006) and Vink et\nal. (2006) present X-ray samples of GPS galaxies, Siemiginowska et al. (2003, 2005, 2008) discuss X-ray emission\nin GPS/CSS quasars. Worrall et al.(2004) and O'Dea et al.\n(2006) study details of the X-ray emission in a single GPS\nsource.\nChandra and XMM-Newton observational capabilities\nare complementary. Chandra exceptional point spread function (PSF) allows for studies of X-ray morphology with ∼\n1 arcsec resolution and the highest dynamic range available\nin the X-ray band today (Van Speybroeck et al. 1997, Weisskopf et al. 2000). Because of its low background it gives\nefficient detections of very faint sources and relatively good\nquality spectra within 0.5-7 keV. The PSF of the XMMNewton is too large for studies of the X-ray morphology\nof GPS sources (Kirsch et al. 2004), but a very high effective area of the telescope gives high quality spectra within\n0.5-10 keV energy range.\nThe spatial resolution of modern X-ray telescopes is still\nmuch worse than the resolution obtained by radio observations. Figure 1 shows the X-ray image of a nearby GPS\nsource Mkn 668 at z=0.076 (1 arcsec = 1.46 kpc). A double\nradio structure (< 10 pc) is fully enclosed within the Xray point source observed with XMM-Newton EPIC camera. The highest redshfit GPS source in the X-ray sample\nis plotted in Figure 2. Q1143-245 (z=1.95) is an unresolved\nX-ray point source in the Chandra ACIS-S observation and\n1.5′′ corresponds to ∼ 12 kpc at the quasar distance.\nTable 1 lists the physical size in kpc for a source located\nat different redshifts. 1 arcsec corresponds to a physical size\nof 179 parsec in Cen A, while it corresponds to 8 kpc for a\nsource at redshift 1. The redshift distribution for a sample of\nsources observed so far in X-rays is plotted in Figure 2. The\npeak distribution of the GPS galaxies is at z ∼ 0.3−0.4 and\nfor a radio source smaller than < 10 kpc cannot be resolved\nwith the current X-ray telescopes. For the GPS quasars the\n\nwww.an-journal.org\n\n\fAstron. Nachr. / AN (2006)\n\nTable 1\n\n791\n\nPhysical Size vs. Redshfit\nRedshift\n\n1′′\nkpc\n\n5 ′′\nkpc\n\nExample\nGPS Source\n\n0.00087\n0.01\n0.076\n0.1\n0.668\n1\n\n0.0179\n0.202\n1.46\n1.8\n7\n8\n\n0.0895\n1\n7.3\n9\n35\n40 7\n\nCen A\n\n6\n\n0108+338\n\nNumber of Sources\n\nMkn 668\n\nQuasars\n\nGalaxies\n\n4\n\n2\n\nupper limits\n0\n1\n\n2\n\n3\n20\n\n4\n\n−2\n\nlog NH [10 cm ]\n\nFig. 3\nDistribution of the intrinsic absorption column\nin GPS galaxies. The histogram includes both Chandra\nand XMM-Newton observations from Guainazzi et al.\n(2004, 2006), Vink et al. (2006), Siemiginowska et al.2008,\nTengstrand et al. (2008). Detections are plotted with the\nsolid red curve and upper limits with the dashed blue curve.\nThe observed columns in GPS quasars reported by Siemiginowska et al. (2008) are marked by a big arrow and all are\nbelow NH < 1021 atoms cm−2 .\nFig. 2 Redshift distribution of GPS and CSS sources observed in X-rays. The histogram includes both Chandra and\nXMM-Newton observations and consists of 19 galaxies and\n13 quasars. The galaxies are marked by a solid red line and\nquasars by a dashed blue line and a shaded region. 5′′ scale\ncorresponding to size < 10 kpc and > 40 kpc is marked\nby arrows. The data points are from Guainazzi et al. (2004,\n2006), Vink et al. (2006) and Siemiginowska et al. (2008).\n\ndistribution spans evenly the redshift between 0.4 − 2. At\nredshift z > 1 the 5 arcsec size of a point source contains\na source exceeding > 40 kpc in size. GPS radio structure\nis smaller than < 1 kpc, CSS < 10 kpc, so any associated\nX-ray emission (as in Stawarz et al. 2008 model) would not\nbe resolved.\nAn unresolved X-ray point source will contain a source\nsmaller than < 3′′ in Chandra and < 15′′ in XMM-Newton\nobservations. There, in most GPS/CSS we can only study\nX-ray spectral properties and may be able to disentangle\ndifferent emission components, evaluate absorption properties and intrinsic source luminosity. However, an X-ray\nemission on scales larger than the PSF size can be studied\nwith Chandra in nearby sources (see Fig. 2), e.g. a diffuse\nemission associated with cocoon, Narrow Emission Line regions, super winds, X-ray cluster or relic emission. In addition larger scale jets associated with the radio source could\nbe detected if their length exceeds > 3′′ .\n\nwww.an-journal.org\n\n3.1 Compact Source: X-ray Spectra\nGPS sources are faint in X-rays and have varying quality\nof the X-ray spectrum, from a detection of a source with\njust a few counts in a short ∼ 5 ksec Chandra exposure to\na relatively good spectra with > 1000 counts in a longer\n20-30 ksec XMM-Newton observations. Most spectra do\nnot show any strong emission lines, except for Mkn 668\n(Guainazzi et al.2004), and can be characterized by an absorbed power law model. Such a model provides an estimate\nof an X-ray flux and probes the X-ray absorption properties.\nFigure 3 shows a distribution of the intrinsic absorption\ncolumn in GPS galaxies observed so far in X-rays. There is\na peak at ∼ 1022 atoms cm−2 in the distribution and most\nof the galaxies are absorbed in X-rays. On the other hand\nthe quasars show no intrinsic absorption with detection limits below < 1021 atoms cm−2 (Siemiginowska et al. 2008).\nThe GPS galaxies show an anticorrelation between the Xray absorption column and the radio source size (Guainazzi\net al. 2006, Vink et al. 2006) similar to the one noticed in the\nobservations of HI 21 cm absorption by Pihlströem, Conway & Vermeulen (2003). This may indicate an evolutionary phase in radio source growth in which the initially enshrouded nucleus is being \"clear out\" by an expanding radio\nsource.\nGiven the X-ray spectra and the observed absorbing column one can determine the source intrinsic X-ray luminosity. The new observations indicate that the GPS galaxies\nare not X-ray quiet. Their X-ray luminosity corrected for\n\nc 2006 WILEY-VCH Verlag GmbH & Co. KGaA, Weinheim\n\n\f792\n\nAneta Siemiginowska: X-ray Emission\n\nWe can summarize the main observational results based\non the X-ray spectra:\n\nFig. 4\nRadio loudness of the GPS quasars from\nSiemiginowska et al.(2008) compared to the other radioloudquasars from Elvis et al.(1994). GPS/CSS quasars are\nmarked by shaded histogram and they are more radio loud.\n\n• Absorption: (1) high (> 1022 cm−2 ) column densities\nare common in galaxies; (2) there is a tentative dependence of the column density on the distance between\nthe hot spots/lobes X-ray; (3) X-ray column density is\nalways larger than the HI column observed in radio.\n• Intrinsic X-ray Luminosity: (1) GPS galaxies are not Xray quiet; (2) GPS/CSS quasars show an indication that\nthey are X-ray weak.\n• X-ray loudness: (1) X-ray to radio luminosity ratios are\nsimilar to the ratios observed in FRI galaxies;\n(2) GPS/CSS quasars are the most radio loud objects.\n3.2 X-ray Morphology (on kpc scales)\nGPS radio structure is much smaller than the spatial resolution capabilities of the current X-ray instruments, so the\nGPS source remains unresolved (even in the lowest redshift\nsources) in all X-ray observations to date. X-ray morphology on scales exceeding the GPS source size can be studied with Chandra. Several types of X-ray morphology have\nbeen detected in the GPS and CSS sources:\n\nFig. 5 Radio loudness in comparison to the B-band luminosity for a different classes of sources in Sikora et al.\n(2007). The location of the GPS quasars (circle) and galaxies (triangle) is marked on the original diagram of Sikora et\nal. Most GPS sources are more radio loud, optically brighter\nand located outside a range (marked by a dashed line) observed in the other sources. Note B-luminosity for GPS\ngalaxies is typically undetermined, because of the intrinsic\nabsorption of the nucleus.\n\nabsorption exceeds 1042 ergs s−1 and matches the X-ray\nluminosities of GPS quasars and FRII type radio galaxies\n(Guainazzi et al.2006, Tengstrand et al. 2008).\nWith the new observations we can also study the spectral\nenergy distribution of the GPS sources from radio to X-rays.\nSuch analysis indicate that the GPS/CSS quasars are more\nradio loud than the other radio loud quasars (see Fig. 4),\nwhere the radio loudness is defined as a ratio between the\nradio and optical (B band) luminosity. A comparison with\na larger sample of variety of radio loud objects in Sikora,\nStawarz & Lasota (2007) shows that the GPS quasars and\ngalaxies are most radio luminous for a given optical luminosity (see Fig. 5). This may suggest a higher radiative efficiency in a younger (smaller) GPS source as postulated by\nthe theory (see Begelman, 1997).\n\nc 2006 WILEY-VCH Verlag GmbH & Co. KGaA, Weinheim\n\n• X-ray jets were detected on large scales up to hundreds\nkpc away from the GPS source: PKS1127-145 (Siemiginowska et al. 2002, 2007), B2 0738+393 (Fig.6,\nSiemiginowska et al. 2003).\n• an irregularly shaped diffuse X-ray emission:\nPKS B1345+125 (Siemiginowska et al. 2008, Guainazzi\net al. in preparation)\n• a secondary X-ray emission associated with a radio\nsource located 20′′ to the west of a double nucleus GPS\ngalaxy PKS 0941-080 (Siemiginowska et al. 2008)\n• an X-ray emission associated with a cluster of galaxies\nat the GPS source redshift: CSS quasar 3C186 is in the\ncenter of an X-ray cluster (Siemiginowska et al. 2005)\nA large scale X-ray emission associated with the GPS\nsource may also indicate intermittency of a central AGN.\nBaum et al. (1990) postulated that an extended radio emission detected ∼ 20′′ away from the GPS galaxy 0108+388\nis a relic of an earlier active phase of the source. Reynolds\n& Begelman (1997) argued that intermittent activity can explain the observed statistics of GPS sources. Intermittency\nor \"modulated jet activity\" has been considered as a mechanism shaping the morphology of large scale jets (for details\nsee Stawarz et al. 2004 and examples: 3C273 by Stawarz\n2004, and Jester et al. 2006; PKS1127-145 Siemiginowska\net al. 2007). The newborn portion of the jet resembles the\nGPS source, but at later time it will be observed as a knot in\nthe extended jet.\nA large scale emission allows also for studies of interactions between the radio source and the environment. A\ndetection of an X-ray cluster in the Chandra observation\nof 3C186 (Fig.7) provided a way to study the surroundings\nof the radio source. The measured temperature and density\n\nwww.an-journal.org\n\n\fAstron. Nachr. / AN (2006)\n\nFig. 6 A smoothed Chandra ACIS-S (0.3-7 keV) image\nof B2 0738+393 overlayed with the radio contours (VLA1.4 GHz). The X-ray jet is narrow, curves and follows the\nradio structure to the south. The jet ends with a hot spot at\nthe southernmost part of the radio lobe. A knot at ∼ 13 arcsec away from the core and its emission is consistent with\nthe X-rays being created by the inverse Compton scattering\nof the cosmic microwave background (CMB) photons and\nrequires jet bulk Lorentz factors of a few (Γbulk ∼ 5 − 7)\n(see Siemiginowska et al. (2003) for details).\n\nFig. 7 Smoothed Chandra ACIS-S (0.3-7 keV) image of\n3C 186 The diffuse cluster emission extends to ∼120 kpc\nfrom the central quasar. The 10 arcsec (82 kpc) size is\nmarked. The direction of an unresolved 2 arcsec radio jet\nis also marked.\n\nof the X-ray emitting hot cluster gas allow for an estimate\nof the gas pressure. This in turn could be compared to the\npressure measured in the radio lobes. In 3C186 the pressure\nin the radio lobes exceeded the thermal gas pressure by 2\norders of magnitude (Siemiginowska et al.2005). This observation therefore allowed to conclude that the jet is not\nfrustrated and the radio source expands with no disruptions.\nFig.8 shows smoothed Chandra ACIS-S images of\nPKS B1345+125 in the soft (0.5-2 keV) and hard (2-10 keV)\nbands. The diffuse X-ray emission seen in the soft band may\noriginate as a thermal emission associated with the galaxy\nhalo. Its size agrees with the size of the extended optical line\nregion studied kinematically in the optical and described by\n\nwww.an-journal.org\n\n793\n\nFig. 8\nSmoothed Chandra ACIS-S images of\nPKS 1345+125. Left: The soft (0.5-2 keV) band showing\nthe extended emission surrounding the core. Them 10′′ scale\nis marked at the left corner and it is the same in both images.\nRight: The hard(2-7 keV) band image. It is dominated by\nthe unresolved core.\n\nHolt, Tadhunter & Morganti (2003). The X-ray emission is\nalso stretched towards the South-West similarly to the optical emission and is aligned also agrees with the VLBI jet\naxis (Stanghellini et al. 2001) suggesting that it may be related to the expanding GPS source. More detailed discussion is presented in Guainazzi et al. (2008 in preparation).\nInterestingly there is so far no detection of a hot (kT∼ a\nfew keV) cocoon that is predicted by theoretical models of\nthe expanding radio source. Is this because we did not observe the right targets or we are limited by the spatial resolution of the telescopes. O'Dea et al. (2006) reported a thermal component in an XMM-Newton spectrum of 3C303.1\n(z=0.267). They suggest that this thermal emission could\nbe due to plasma heated by the shock of the expanding radio source. The source is unresolved in this X-ray observation and only the spectrum could be used to disentangle the\nemission components. Future Chandra observation may allow for more detailed investigations of the X-ray properties\non a few arcsec scales.\n\n4 Conclusions and Future Perspectives\nA number of pointed X-ray observations of GPS and CSS\nsources has increased significantly over the last decade.\nHowever, a complete sample is still not available and there\nis therefore no statistically solid and systematic study of the\nX-ray properties of such a sample. The current observed\ntrends need to be confirmed in the future. We are continuing our efforts to obtain X-ray observations of all the GPS\nsources in Stanghellini et al. (1998) and making a slow\nprogress.\nThere are many remaining questions as we do not know\nanswers to the observed correlations, the processes dominating X-ray emission, radio source environment. The basic questions about the nature of the activity is still not answered: Is the radio source intermittent? Is the source short\n\nc 2006 WILEY-VCH Verlag GmbH & Co. KGaA, Weinheim\n\n\f794\n\nlived? Does the GPS radio structure fade away? Many questions that have been asked at this workshop were related to\nthe source nature and evolution. They have to be investigated using multi-wavelength data. Samples that cover radio-optical-UV-X-rays-γ-rays are needed to test models and\nunderstand source nature and connection to a population of\nlarge scale radio sources.\nThere are plans for future X-rays and γ-rays missions\nthat will become active and provide new information about\nthe high energy processes in the GPS sources. FERMI\n(GLAST) has been successfully launched this year. This is\nthe first γ-ray instrument capable of detecting GPS sources\nif they emit γ-rays. FERMI will collect the data at γ-ray\nenergies > 1022 Hz) that may provide tests and possible\nconstraints on the emission processes from the GPS radio\nlobes predicted by Stawarz et al (2008).\nNew high energy X-ray missions with a large collective area such as NuStar (Harrison et al. 2005, Koglin et\nal. 2005) and EXIST (Grindlay 2007) are being built and\nwill become available in the near future. They will be capable of detecting X-ray emission from GPS/CSS sources\nand will provide low resolution X-ray spectra at energies\n>10 keV for the first time. The high resolution X-ray spectra will become available in the next decade when the Xray International Observatory (IXO) is placed on orbit. This\nnew mission will also have good imaging capabilities. However, the highest resolution X-ray spectra will allow for detailed studies of the absorption and emission line structure,\nso will give information about properties of the gas intrinsic to the source and also of a thermal emission components. For example we will be able to distinguish between\nthe shock heated plasma emission and the synchrotron nonthermal emission in 3C303.1 presented by O'Dea (2008) at\nthis workshop.\nAcknowledgements. SOC and LOC members are acknowledged\nfor organization of a great meeting. This research is funded in part\nby NASA contract NAS8-39073 and grant NNX07AQ55G. Partial\nsupport for this work was provided by the National Aeronautics\nand Space Administration through Chandra Award Number GO56113X, GO7-8103X-R issued by the Chandra X-Ray Observatory\nCenter, which is operated by the Smithsonian Astrophysical Observatory for and on behalf of NASA under contract NAS8-39073.\n\nReferences\nAntonelli, L. A., Fiore, F.: 1997, Memorie della Societa Astronomica Italiana, 68, 299\nBaum, S. A., O'Dea, C. P., de Bruyn, A. G., Murphy, D. W.: 1990,\nA&A, 232, 19\nBegelman, M. C., Cioffi, D. F. 1989: ApJ , 345, L21\nBegelman, M. C.: 1997, \"The Most Distant Galaxies\" (Dordrecht:\nReidel), Proceedings of the KNAW Colloquium held in Amsterdam, October 15-17, 1997, ArXiv Astrophysics e-prints,\narXiv:astro-ph/9712107\nBicknell, G. V., Sutherland, R. S.: 2006, AN , 327, 235\nElvis, M., et al.: 1994, ApJS , 95, 1\nGuainazzi, M. et al.: 2008, in preparation\n\nc 2006 WILEY-VCH Verlag GmbH & Co. KGaA, Weinheim\n\nAneta Siemiginowska: X-ray Emission\nGuainazzi, M., Siemiginowska, A., Stanghellini, C., Grandi, P., Piconcelli, E., Azubike Ugwoke, C.: 2006, A&A, 446, 87\nGuainazzi, M., Siemiginowska, A., Rodriguez-Pascual, P.,\nStanghellini, C.: 2004, A&A, 421, 461\nGrindlay, J. E.: 2007, The Central Engine of Active Galactic Nuclei, 373, 711\nHarrison, F. A., et al.: 2005, Experimental Astronomy, 20, 131\nHeinz, S.,Reynolds,C. S., Begelman,M. C.: 1998, ApJ , 501, 126\nJester, S., Harris, D. E., Marshall, H. L., Meisenheimer, K.: 2006,\nApJ , 648, 900\nHolt, J., Tadhunter, C. N., Morganti, R.: 2003, MNRAS , 342, 227\nKirsch, M. G. F., et al.: 2004, Proc. SPIE, 5488, 103\nKraft, R. P., et al.: 2007, ApJ , 665, 1129\nKoglin, J. E., et al.: 2005, Proc. SPIE, 5900, 266\nO'Dea, C. P., Mu, B., Worrall, D. M., Kastner, J., Baum, S., de\nVries, W. H.: 2006, ApJ , 653, 1115\nO'Dea, C. P., De Vries, W. H., Worrall, D. M., Baum, S. A.,\nKoekemoer, A.: 2000, AJ , 119, 478\nO'Dea, C. P.: 1998, PASP , 110, 493\nOstorero, L., et al. 2008, this Proceedings\nPihlströem, Y. M., Conway, J. E., Vermeulen, R. C.: 2003, A&A,\n404, 871\nReynolds, C. S., Heinz, S., Begelman, M. C.: 2001, ApJ , 549,\nL179\nScheuer, P. A. G.: 1974, MNRAS , 166, 513\nSiemiginowska, A., LaMassa, S., Aldcroft, T. L., Bechtold, J.,\nElvis, M.: 2008, ApJ , 684, 811\nSiemiginowska, A., Stawarz, Ł., Cheung, C. C., Harris, D. E.,\nSikora, M., Aldcroft, T. L., Bechtold, J.: 2007, ApJ , 657,\n145\nSiemiginowska, A., Cheung, C. C., LaMassa, S., Burke, D. J., Aldcroft, T. L., Bechtold, J., Elvis, M., Worrall, D. M.: 2005,\nApJ , 632, 110\nSiemiginowska, A., et al.: 2003, ApJ , 595, 643\nSiemiginowska, A., Aldcroft, T. L., Bechtold, J., Brunetti, G.,\nElvis, M., Stanghellini, C.: 2003, Publications of the Astronomical Society of Australia, 20, 113\nSiemiginowska, A., Bechtold, J., Aldcroft, T. L., Elvis, M., Harris,\nD. E., Dobrzycki, A.: 2002, ApJ , 570, 543\nSikora, M., Stawarz, Ł., Lasota, J.-P.: 2007, ApJ , 658, 815\nSmith, D. A., Wilson, A. S., Arnaud, K. A., Terashima, Y., Young,\nA. J.: 2002, ApJ , 565, 195\nStanghellini, C., O'Dea, C. P., Dallacasa, D., Baum, S. A., Fanti,\nR., Fanti, C.: 1998, A&AS, 131, 303\nStanghellini, C., Dallacasa, D., O'Dea, C. P., Baum, S. A., Fanti,\nR., Fanti, C.: 2001, A&A, 377, 377\nStawarz, Ł., Ostorero, L., Begelman, M. C., Moderski, R.,\nKataoka, J., Wagner, S.: 2008, ApJ , 680, 911\nStawarz, Ł.: 2004, ApJ , 613, 119\nStawarz, Ł., Sikora, M., Ostrowski, M., Begelman, M. C.: 2004,\nApJ , 608, 95\nSutherland, R. S., Bicknell, G. V.: 2007a, ApJS , 173, 37\nSutherland, R. S., Bicknell, G. V.: 2007b, Ap&SS , 311, 293\nTengstrand, O., Guainazzi, M., Siemiginowska, A., Fonseca\nBonilla, N., Labiano, A., Worrall, D., Grandi, P., Piconcelli:\n2008, A&A, submitted\nvan Speybroeck, L. P., Jerius, D., Edgar, R. J., Gaetz, T. J., Zhao,\nP., Reid, P. B.: 1997, Proc. SPIE, 3113, 89\nVink, J., Snellen, I., Mack, K.-H., Schilizzi, R.: 2006, MNRAS ,\n367, 928\nWeisskopf, M. C., Tananbaum, H. D., Van Speybroeck, L. P.,\nO'Dell, S. L.: 2000, Proc. SPIE, 4012, 2\nWilson, A. S., Young, A. J., Shopbell, P. L.: 2000, ApJ , 544, L27\n\nwww.an-journal.org\n\n\fAstron. Nachr. / AN (2006)\n\n795\n\nWorrall, D. M., Hardcastle, M. J., Pearson, T. J., Readhead,\nA. C. S.: 2004, MNRAS , 347, 632\n\nwww.an-journal.org\n\nc 2006 WILEY-VCH Verlag GmbH & Co. KGaA, Weinheim\n\n\f"}