{"id": "http://arxiv.org/abs/0801.2389v1", "guidislink": true, "updated": "2008-01-15T21:48:00Z", "updated_parsed": [2008, 1, 15, 21, 48, 0, 1, 15, 0], "published": "2008-01-15T21:48:00Z", "published_parsed": [2008, 1, 15, 21, 48, 0, 1, 15, 0], "title": "The shape distribution of asteroid families -- evidence for evolution\n  driven by small impacts", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0801.2490%2C0801.3666%2C0801.0669%2C0801.4470%2C0801.4770%2C0801.4300%2C0801.4420%2C0801.3464%2C0801.1623%2C0801.0036%2C0801.0417%2C0801.4837%2C0801.4673%2C0801.4675%2C0801.2673%2C0801.4016%2C0801.2840%2C0801.2502%2C0801.3804%2C0801.0123%2C0801.0513%2C0801.0111%2C0801.1105%2C0801.4381%2C0801.2043%2C0801.1854%2C0801.2343%2C0801.2389%2C0801.3851%2C0801.2789%2C0801.1590%2C0801.3185%2C0801.2008%2C0801.2127%2C0801.0688%2C0801.1748%2C0801.0290%2C0801.2355%2C0801.0019%2C0801.1937%2C0801.3226%2C0801.3096%2C0801.1306%2C0801.4670%2C0801.4177%2C0801.2979%2C0801.2608%2C0801.1698%2C0801.4824%2C0801.4490%2C0801.3752%2C0801.4438%2C0801.2465%2C0801.3498%2C0801.1047%2C0801.1742%2C0801.1161%2C0801.4594%2C0801.2388%2C0801.0847%2C0801.3606%2C0801.4884%2C0801.3655%2C0801.0788%2C0801.0042%2C0801.0031%2C0801.4068%2C0801.2836%2C0801.0130%2C0801.4104%2C0801.4915%2C0801.4117%2C0801.4399%2C0801.4287%2C0801.3598%2C0801.0921%2C0801.1117%2C0801.3595%2C0801.4784%2C0801.0476%2C0801.0472%2C0801.2029%2C0801.2078%2C0801.0048%2C0801.1606%2C0801.4603%2C0801.3984%2C0801.2945%2C0801.4249%2C0801.1456%2C0801.3166%2C0801.2036%2C0801.0592%2C0801.3503%2C0801.0940%2C0801.0914%2C0801.2933%2C0801.1062%2C0801.1756%2C0801.4279%2C0801.2926&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The shape distribution of asteroid families -- evidence for evolution\n  driven by small impacts"}, "summary": "A statistical analysis of brightness variability of asteroids reveals how\ntheir shapes evolve from elongated to rough spheroidal forms, presumably driven\nby impact-related phenomena. Based on the Sloan Digital Sky Survey Moving\nObject Catalog, we determined the shape distribution of 11,735 asteroids, with\nspecial emphasis on eight prominent asteroid families. In young families,\nasteroids have a wide range of shape elongations, implying\nfragmentation-formation. In older families we see an increasing number of rough\nspheroids, in agreement with the predictions of an impact-driven evolution. Old\nfamilies also contain a group of moderately elongated members, which we suggest\ncorrespond to higher-density, more impact-resistant cores of former fragmented\nasteroids that have undergone slow shape erosion. A few percent of asteroids\nhave very elongated shapes, and can either be young fragments or tidally\nreshaped bodies. Our results confirm that the majority of asteroids are\ngravitationally bound ``rubble piles''.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0801.2490%2C0801.3666%2C0801.0669%2C0801.4470%2C0801.4770%2C0801.4300%2C0801.4420%2C0801.3464%2C0801.1623%2C0801.0036%2C0801.0417%2C0801.4837%2C0801.4673%2C0801.4675%2C0801.2673%2C0801.4016%2C0801.2840%2C0801.2502%2C0801.3804%2C0801.0123%2C0801.0513%2C0801.0111%2C0801.1105%2C0801.4381%2C0801.2043%2C0801.1854%2C0801.2343%2C0801.2389%2C0801.3851%2C0801.2789%2C0801.1590%2C0801.3185%2C0801.2008%2C0801.2127%2C0801.0688%2C0801.1748%2C0801.0290%2C0801.2355%2C0801.0019%2C0801.1937%2C0801.3226%2C0801.3096%2C0801.1306%2C0801.4670%2C0801.4177%2C0801.2979%2C0801.2608%2C0801.1698%2C0801.4824%2C0801.4490%2C0801.3752%2C0801.4438%2C0801.2465%2C0801.3498%2C0801.1047%2C0801.1742%2C0801.1161%2C0801.4594%2C0801.2388%2C0801.0847%2C0801.3606%2C0801.4884%2C0801.3655%2C0801.0788%2C0801.0042%2C0801.0031%2C0801.4068%2C0801.2836%2C0801.0130%2C0801.4104%2C0801.4915%2C0801.4117%2C0801.4399%2C0801.4287%2C0801.3598%2C0801.0921%2C0801.1117%2C0801.3595%2C0801.4784%2C0801.0476%2C0801.0472%2C0801.2029%2C0801.2078%2C0801.0048%2C0801.1606%2C0801.4603%2C0801.3984%2C0801.2945%2C0801.4249%2C0801.1456%2C0801.3166%2C0801.2036%2C0801.0592%2C0801.3503%2C0801.0940%2C0801.0914%2C0801.2933%2C0801.1062%2C0801.1756%2C0801.4279%2C0801.2926&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "A statistical analysis of brightness variability of asteroids reveals how\ntheir shapes evolve from elongated to rough spheroidal forms, presumably driven\nby impact-related phenomena. Based on the Sloan Digital Sky Survey Moving\nObject Catalog, we determined the shape distribution of 11,735 asteroids, with\nspecial emphasis on eight prominent asteroid families. In young families,\nasteroids have a wide range of shape elongations, implying\nfragmentation-formation. In older families we see an increasing number of rough\nspheroids, in agreement with the predictions of an impact-driven evolution. Old\nfamilies also contain a group of moderately elongated members, which we suggest\ncorrespond to higher-density, more impact-resistant cores of former fragmented\nasteroids that have undergone slow shape erosion. A few percent of asteroids\nhave very elongated shapes, and can either be young fragments or tidally\nreshaped bodies. Our results confirm that the majority of asteroids are\ngravitationally bound ``rubble piles''."}, "authors": ["Gyula M. Szabo", "Laszlo L. Kiss"], "author_detail": {"name": "Laszlo L. Kiss"}, "author": "Laszlo L. Kiss", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1016/j.icarus.2008.01.019", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0801.2389v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0801.2389v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "Accepted by Icarus. 22 pages, 1 table, 6 figures, 31 figure panels", "arxiv_primary_category": {"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0801.2389v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0801.2389v1", "journal_reference": null, "doi": "10.1016/j.icarus.2008.01.019", "fulltext": "Title of the paper:\nThe shape distribution of asteroid families – evidence for evolution driven by small impacts\nAuthors:\n\narXiv:0801.2389v1 [astro-ph] 15 Jan 2008\n\nGyula M. Szabó1,2∗ , László L. Kiss3\n1 Magyary\n\nFellow, School of Physics A28, University of Sydney, NSW 2006, Australia,\nof Experimental Physics, University of Szeged, 6720 Szeged, Hungary,\n3 School of Physics A28, University of Sydney, NSW 2006, Australia\n∗ E-mail: szgy@titan.physx.u-szeged.hu\n\n2 Department\n\nProposed runnung head:\nThe shape distribution of asteroid families\nName and address to which editorial correspondence and proofs should be directed:\nGyula M. Szabó\nUniversity of Szeged\nDept. Experimental Physics\nDóm tér 9.\nH-6720 Szeged, Hungary\ne-mail: szgy@titan.physx.u-szeged.hu\n\n1\n\n\fAbstract\nA statistical analysis of brightness variability of asteroids reveals how their shapes evolve from\nelongated to rough spheroidal forms, presumably driven by impact-related phenomena. Based on\nthe Sloan Digital Sky Survey Moving Object Catalog, we determined the shape distribution of\n11,735 asteroids, with special emphasis on eight prominent asteroid families. In young families,\nasteroids have a wide range of shape elongations, implying fragmentation-formation. In older\nfamilies we see an increasing number of rough spheroids, in agreement with the predictions of an\nimpact-driven evolution. Old families also contain a group of moderately elongated members,\nwhich we suggest correspond to higher-density, more impact-resistant cores of former fragmented\nasteroids that have undergone slow shape erosion. A few percent of asteroids have very elongated\nshapes, and can either be young fragments or tidally reshaped bodies. Our results confirm that the\nmajority of asteroids are gravitationally bound \"rubble piles\".\nKey words:\n\n2\n\n\f1.\n\nIntroduction\n\nAbout one third of all known asteroids belong to families (Zappala et al. (1995)), which are\nclusters of asteroids believed to result from collisional disruption of parent bodies (O'Brien and Greenberg\n(2005)). The hypothesis of collisional origin is based entirely on the observed similarity of dynamical and spectral properties, and not on the understanding of the collisional physics itself\n(Michel et al. (2001)). Members of asteroid families share similar orbital elements (semimajor axis,\neccentricity and orbital inclination) (Nesvorny et al. (2005)) and chemical composition (Ivezic et al.\n(2002)). They often have low density which suggests a high porosity – the asteroids are often made\nof gravitationally bound fragments or \"rubble piles\" (Richardson et al. (2004)). This structure is\nconsistent with a collisional origin, and explains both the lack of fast rotators among asteroids\nlarger than a few hundred meters (Pravec and Harris (2000)) and the presence of large craters\nrevealed by close-up surface images (Chapman et al. (1999)). The rotational rates of the asteroids display a Maxwellian distribution, indicating angular momentum redistribution by collisions\n(Binzel (1988); Fulchignoni (2001)). As such, prominent asteroid families are therefore important\ntracers of high-velocity impacts, one of the principal geologic processes affecting small bodies in\nthe Solar System.\nFig 1. comes here\nCollisions modify the shape and size of an asteroid. The most energetic collisions disrupt\nthe bodies and generate a number of smaller, gravitationally unbound fragments which will evolve\nfurther as new individual asteroids. The less energetic collisions can only fragment the body and/or\nform craters, without disruption. Collisions are rare, and therefore cannot be observed directly, and\ntheir complete understanding requires numerical experiments that have to reproduce the observable\nconstraints of the impacts. Currently these constraints are: asteroid size distribution, the number\nof asteroid families, the age distribution of meteorites, and surface cratering of 5 asteroids which\nwere encountered by spacecraft. The last of these cannot be easily interpreted, because craters\ncan overlap or be completely saturated, and crater size depends on the impactor/crater scaling\nlaw model. The other constraints are only sensitive to the most energetic, disruptive collisions.\nSignificant information on the less energetic impacts may be extracted from asteroid shapes: it\nhas been proposed (Richardson et al. (2004); Korycansky and Asphaug (2003)) that the shape of\nasteroids can evolve with age due to several microimpacts. However, there are only a few asteroids\nwith known shape and hence the evolutionary effects could not have not been fully exploited yet.\nWhile sizes can be constrained relatively easily from absolute photometry (Eddington (1910)),\ndetermining shapes is much more difficult. Space missions have visited only a few asteroids\nand shapes for these have been determined accurately (Fujiwara et al. (2006); Abe et al. (2006);\nOkada et al. (2006); Saito et al. (2006)). Radar observations have revealed shapes of Near-Earth\n3\n\n\fObjects encountering the Earth ( e.g. Ostro et al. (2006)), while high-resolution imaging is restricted to the largest asteroids (Tanga et al. (2003); Marchis et al. (2006)). For the rest of the\nasteroid belt, time-resolved photometry is the only method to determine the shape. The key effect\nis the rotation: it causes periodic brightness variations which, in principle, reveal the shape of a\ngiven asteroid if there are enough data for full inversion of the lightcurve, or at least for fitting a triaxial ellipsoid. Despite the relatively simple principles of the method, there has been slow progress\nbecause of the time-consuming nature of the observations. Recent advances in all-sky surveys offer\nnew approaches to the problem. These surveys often observe thousands of asteroids in a night, and\nwith the appropriate data processing the shape distribution can be constrained. Here we deduce\nthe shape distribution of 11,735 main-belt asteroids belonging to eight prominent asteroid families,\nusing data from the Sloan Digital Sky Survey (SDSS).\nSDSS was a deep imaging survey covering over a quarter of the Celestial Sphere in the\nNorthen Galactic Cap, resulting in high-quality photometric measurements of 50 million stars and\na similar number of galaxies. Although its main purpose was cosmology, SDSS has also collected\n204,305 measurements of asteroids, listed in the SDSS Moving Object Catalog 3 (SDSS MOC)\n1 (Ivezic et al. (2001)). Of these, 67,637 data points have been linked to 26,847 known asteroids\n(Ivezic et al. (2002)). This means that all the identified asteroids have been observed an average of\n2.5 times. The calibration of the SDSS is very accurate because all measurements were acquired\nwith the same instrument and from the same observing site. Therefore, systematic effects are minimized and the individual brightness measurements are accurate to 1–2% down to magnitude 20 in\nr band.\n\n2.\n\nData and Analysis\n\nWe selected eight asteroid families for a detailed analysis of the shape distribution and its\npossible evolution. We chose families with at least 400 pairs of measurements from SDSS that\nalso have a published age determination (Nesvorny et al. (2005); Carruba et al. (2005)). This is\nsatisfied for five families (Flora, Vesta, Eos, Eunomia, Themis). We also included two very old\nfamilies (Koronis, Hygiea) and one quite young (Massalia), each with fewer than 400 pairs of\nobservation, which helped expand the analysis to a broader range of ages. We selected the family\nmembers according to their orbital elements (Szabó et al. (2004)). The selection criteria and the\nnumber of members are summarized in Table 1, while their positions in the orbital semi-major axis\n– orbital inclination plane are plotted in Fig. 1.\n1\n\nAvailable at http://www.sdss.org\n\n4\n\n\fBrightness variations are caused by rotation of a non-spherical body and also by changing\ngeometric conditions (the Sun-asteroid-Earth angle and the Sun-asteroid and asteroid-Earth distances). To reduce the geometric effects, we restricted our sample to those asteroids for which the\ngeometric conditions of the two independent observations were very similar.\nThe selection steps from SDSS MOC were as follows. In order to minimize the effect of\nvariable angle from the opposition, we selected only those objects for which the change of this\nangle was less than 2.5 degrees. Similarly, because the variation of the solar phase affects the\nbrightness of the asteroid, we required this to change by less than 1.5 degree change in it. In order\nto guarantee that rotational phases were uncorrelated, only pairs of observations more than 1 day\napart were considered. The typical rotational periods of asteroids fall between 0.3 d and 0.6 d and\nthe lightcurve regularly has two maxima and two minima. Consequently, our smallest sampling\ninterval is comparable or longer than one hump on the light curve in virtually all cases, resulting\nin uncorrelated sampling. In order to avoid the increased photometric errors at the faint end, we\nrequired m < 20 in the r photometric band.\nThis way we ended up with 11,735 pairs of photometric observations. The resulting cumulative distribution of the measured brightness variations is plotted with the thick line in Fig. 2A. We\nsee that for about 80% of the asteroids the difference between the two measurements was less than\n0.2 mag, but that some large differences of up to 0.8 mag, indicating highly elongated shapes.\nWe tested that the chosen magnitude limit of r < 20 is not too faint by checking whether\nfainter asteroids in our sample showed apparently larger brightness variations. A positive result\nwould have implied that either the selection limit was not strict enough or the smaller asteroids were\nmore elongated in the examined size range. We found the contrary: using a Kolmogorov-Smirnov\ntest we compared the brightness variations of bright (< 18.5 magnitude) and faint (between 18\nand 20 magnitude) objects, and found them to be indistinguishable. This shows both the high\nquality of the data for the faintest asteroids in the sample and the independence of the average\nshape elongation on size in the studied 1–30 km diameter range.\nAs the brightness depends on the Sun-asteroid and the asteroid-Earth distances, the measurements were converted to absolute magnitudes as:\n∆mobs\n1,2 = |m1 − 5 log(D1 R1 ) − m2 + 5 log(D2 R2 )|,\n\n(1)\n\nHere D1 , R1 and D2 , R2 are the geocentric (D) and heliocentric (R) distances of the asteroid in\nAU, at the epochs of the two observations. We used r-band magnitudes because they are the most\naccurate in the color range of asteroids. The outlined procedure reduced the geometrical effects\nbelow ≈ 0.02 magnitudes in ∆mobs\n1,2 .\nTable 1. comes here\n5\n\n\f3.\n\nMethods of fitting\n\nIf we know only the brightness difference displayed by an asteroid between two epochs, the\nexact shape elongation cannot be determined. However, the distribution of the shape elongation can\nbe determined for a large ensemble of asteroids with a statistical inversion. We have developed this\nmethod to determine the shape distribution from sparsely sampled observations of many asteroids.\nThe basic idea is to use the two-point statistics of photometry to determine the shape elongation,\nwhich we parametrize by the shape axis ratio, a/b.\nThe light variations of asteroids are due to the departures from a spherical symmetry, primarily\nthe elongation of the shape. Rotation causes periodic variation of the illuminated surface, producing\nmeasurable brightness changes. The photometric amplitude reflects the ratio of the largest and\nsmallest projected area observed during a rotation, which is approximately the a/b axis ratio of the\nbest-fit ellipsoid.\nAssuming a triaxial ellipsoid with axes a > b > c that is rotating around the c axis, and given\nthe aspect angle θ (the angle between the line of sight and the axis of rotation), the projection of\nthe shape can be calculated (Connelly and Ostro, 1984). Expressed in magnitudes, the brightness\nvaries as\n\u0013\n\u0012 2\nsin θ sin2 φ sin2 θ cos2 φ cos2 θ\n+\n+\n,\n(2)\nm(φ) = m0 + 1.25 log\na2\nb2\nc2\nwhere φ is the rotational phase and m0 is the maximum brightness.\nIf an asteroid has been sparsely observed, there is no way to determine the rotational period –\nconsequently the rotational phases and their relation to each other also remain unknown. From a\nlarge sample, however, we can deduce the shape distribution as follows. Let us consider brightness\nmeasurements at two randomly chosen rotational phases φ1 and φ2 , whose difference\n∆m1,2 = |m(φ1 ) − m(φ2 )|\n\n(3)\n\nwill be the basis of our method. In the case of a single pair of observations, one cannot find a direct\nrelation between ∆mobs\n1,2 and a/b because of the unknown rotational phases. For a statistically large\nsample, however, the distribution of the observed brightness differences can be compared to model\npredictions. The idea is that spherical asteroids never cause large brightness change while more\nelongated ones sometimes do. Thus, if φ1 and φ2 are independent and uniformly distributed, the\ndifferent values of ∆mobs\n1,2 are predicted to have different probabilities. By comparing the model\npredictions to observations, the distribution of a/b can be constrained as follows.\nThe cumulative distribution function of the observations is\n1\nξ(∆m1,2 ) =\nnumber(∆mobs\n1,2 < ∆m1,2 ).\nnumberall\n6\n\n(4)\n\n\fWe compare this to the cumulative distribution function of the models, which was calculated from\none million simulated observations by putting random observational phases in Eqs. 2-3.\nFig. 2. comes here\nWith the help of these template simulations, we reconstructed the observed brightness variations as the linear combination of models for differently elongated bodies. We calculated the\ntemplate cumulative distribution of brightness variations for 17 values of a/b ≡ 1.1, 1.2, 1.3, 1.4,\n1.5, 1.6, 1.7, 1.8, 1.9, 2.0, 2.2, 2.4, 2.6, 2.8, 3.0, 3.5, 4.0, each taken from 106 model observations\nfrom a Monte Carlo experiment. We simulated 17 × 106 observations with independent and uniformly distributed rotational phases. The observed cumulative distribution was calculated using\nEq. 4.\nEach thin line in Fig. 2A shows the expected distribution of magnitude differences for a\npopulations of asteroids having a single value of a/b.\nA comparison of the thick line and the thin lines in Fig. 2A shows that the observed brightness changes came from a mixture of asteroid shapes. We therefore fitted a linear combination\nof the templates to the measured curve. For this we applied a non-negative least squares method\n(Lawson and Hanson (1974)). The best fit coefficients directly give the a/b shape distribution responsible for the observed variability. This can simply be interpreted as the most probable shape\ndistribution in a family. The uncertainties of each coefficients are less than ±3% in all cases and\nin all a/b bins. We plot the shape distribution for the whole sample with the black solid line in Fig.\n2B.\nWe tested this result using asteroid shapes estimated from full rotational lightcurves. As of\nwriting this paper, there are 1,207 asteroids in the literature for which multi-epoch full lightcurves\nwere published in the past 70 years (Magnusson and Kryszczynska (2007)). For each asteroid,\nthe maximum amplitude can be easily converted to a/b shape elongation. The maximal observed\namplitude corresponds to the perpendicular aspect angle of the rotation axis, therefore its value is\napproximately the a/b axis ratio of the best-fit ellipsoid. We plot the resulting distribution with\nthe orange (grey in BW) shaded histogram in Fig. 2B. The two curves shown are completely\nindependent and their excellent agreement confirms the reliability of our method, which opens a\nnew way forward to determine asteroid shapes on a massive scale.\nFig 3. comes here\nBefore turning to the results, we shortly discuss the two-point brightness variation functions\nfor the 8 asteroid families (Fig 3). In the upper panels we plot the cumulative distributions, while\nthe lower panels show the difference of the observed functions with respect to that of the whole\nsample (Fig. 2, thick line). Here the observational data are shown by different symbols for different\n7\n\n\ffamilies (see the labels) while the smooth lines represent the fitted models.\nVisual inspection shows that some asteroid families (such as Massalia) contain many elongated asteroids which display large amplitude two-point brightness variations on average. This\nis indicated by the downward dip in their cumulative distribution around 0.m 1–0.m 2, showing that\na larger fraction of asteroids in this family exhibited variations over a few tenth of a magnitude.\nSimilarly, in other families (such as the Vestas) the asteroids are more rounded in shape, which is\nindicated by the higher rate of small (< 0.2 mag) variations.\n\n4.\n\nShape distribution of asteroid families\nFig. 4. comes here\n\nThe shape distributions for the eight selected families are plotted in Fig. 4. In order to separate\nage and distance effects, the families have been grouped in two sequences. The Massalia-Koronis\nsequence (Fig 3 A–D) shows families with a wide range of ages (Massalia: 150 million years to\nKoronis: 2500 million years). The Vesta–Themis sequence (Fig 3 E–H) contains very old families\nat different heliocentric distances.\nAn important model parameter is the distribution of θ, which is related to the average pole\ninclination of the model asteroids. First we assumed that all asteroids have a rotation axis which is\nperpendicular to the line of sight, θ = 90 degrees. However, the choice of the average inclination\ndoes not greatly affect the interpretation. In order to show this, we present here a second solution\nwhich takes the different inclinations into account. In this calculation, the ecliptic longitude of the\npole was randomly oriented, but the latitude was fixed to be 50 degrees, because the average spin\naxis inclination is 50 degrees for 104 asteroids with known pole orientation listed by (Magnusson\n(2005)). The number of highly elongated objects have increased, but in general, results are very\nsimilar to those given by the first calculation (Fig. 4).\nFig. 5. comes here\nThe shape distribution of the Massalia family confirms that young families display a variety\nof shapes. The mean a/b is 1.39, significantly larger than that of the mean of the full sample and\nvery close to the value of a/b = 1.41 obtained from the laboratory experiments with catastrophic\ncollisions of monolithic targets (Cappacioni et al. (1984); Catullo et al. (1984); Ryan (2000)). In\nthe Massalia–Koronis sequence, the fraction of spheroids (a/b < 1.2) rises prominently toward the\nolder families, finally exceeding 50% in the old Koronis family.\nThe discussed asteroid families have various orbital and structure properties (size distribution,\nconcentration etc.) which are not correlated with age. So the age dependent variations in the shape\n8\n\n\fdistribution are not due to the variation of orbital or structural parameters. We interpret this marked\nchange in the shape distribution with an evolutionary effect: the young bodies, whose shapes are\npresumably determined by collisional disruption, are reshaped into more rounded forms in 1–2\nbillion years.\nIn order to check this conclusion again, we examined possible correlations between the distribution of the observed brightness variation and the eccentricity, inclination, solar phase at the\nepoch of observation and the size of asteroids, while no correlations have been found. This proves\nthat the variation of the shape distribution is age dependent, i.e. an evolutional outcome.\nFig. 6. comes here\nSeveral families in Fig. 4 show bimodal distribution of the axis ratios. Being a fundamental\nresult, we test its robustness. For instance, possible photometric problems in the dataset could\nresult in very large but spurious variation, which might then lead to a second or third peak in the\na/b distribution. Following a Referee's suggestion, we clipped the large values from the cumulative\ntwo-point brightness variation (all measurements having ∆m1,2 > 0.65 were ignored) and repeated\nthe determination of the a/b distribution. The results (Fig 6) confirm the presence of the second\npeak.\nWe suggest this evolution to be due to impact-driven reshaping and impact-induced seismic activity erosion. After the families were formed, the asteroids have been eroded by continuous impact\ncratering and possibly further disruptive collisions. The impact origin theory of shape evolution\n(Leinhardt et al. (2000)) argues that subcatastrophic impacts (an excavation followed by the launch,\norbit and reimpact of ejecta) rearrange the regolith layer of the colliding bodies. This process has\nhad enough time to reshape the older asteroids by now. Numerical simulations of this scenario\nKorycansky and Asphaug (2003) revealed that both oblate and cigar-like elongated prolate shapes\nevolve to become close to oblate spherical after about 10,000 impacts. The more rapidly the body\nwas spinning, the more flattened the outcome, with a/b between 1.0–1.35 in all calculations. The\nimpact-induced seismic activity theory (Richardson et al. (2004)) predicts that subcatastrophic impacts generate seismic shaking in the target asteroid, and the regolith layer moves then downslope.\nIn case of an Eros-like, 1.5 km sized asteroid, covered by a layer of regolith tens of meter thick,\n0.5–10-meter-sized impactors are the best candidates for such process. This process is in agreement with the surface structures and the erased small craters on Eros (Richardson et al. (2004);\nChapman et al. (2002)).\nBoth subcatastrophic impacts and impact-induced seismic activity require enough time for\nreshaping before the characteristic shape properties are destroyed by a catastrophic collision. This\nassumes quite a steep power-law for the size distribution of impactors, with only a few large bodies.\nSuch a steep population explains the crater population of some asteroids (Greenberg et al. (1994))\n9\n\n\fand is also in agreement with the idea that large family-forming asteroids have been battered and\npre-shattered by softer impacts prior to the family-forming disruption (Michel et al. (2004)). Our\nresults lead to the conclusion that shapes indeed evolve toward spherical symmetry, in agreement\nwith the predictions. We suggest that impact reshaping and impact-induced seismic activity are\ndominant processes in the late evolution of asteroid shapes.\nThe Vesta–Themis (Fig 4. E–H) sequence shows that the erosion depends on the semi-major\naxis of the orbit. These four families are quite old, with estimated ages of about 2 billion years,\nwhile their heliocentric distances range from 2.35 AU to 3.2 AU. Our results imply that the erosion of shapes becomes slower with the increasing heliocentric distance. This can be qualitatively\nexplained by the effect of smaller orbital velocities at large solar distances, which lead to less energetic collisions with impactors. There may also be an effect from different chemical compositions\n(silicates and basalts close to the Sun, chondrites farther out), since different materials can fragment\ndifferently (Korycansky and Asphaug (2003)).\nSome of the shape distributions are multimodal (Eos, Koronis, Eunomia, Hygiea, Themis),\nwhich might indicate different compositions and/or internal structures. Among Near-Earth asteroids at least three types have been identified: \"strengthless bodies\" with high porosity close to equilibrium shapes (Ostro et al. (2006)); \"potatoes\", which have larger density and a somewhat irregular\nshape; and irregular two-lobed \"dog bones\" or \"dumbbell\"-shaped asteroids (Ostro et al. (2000)),\nwhich look like merged bodies. Simulations have shown that strengthless bodies do not have perfectly symmetrical shapes (mainly because of the stochastic nature of cratering) (Korycansky and Asphaug\n(2003)), thus we may identify the peaks at a/b =1.2 in the evolved families with the loosest structure rubble piles. The second clump at around a/b =1.5–1.7 may consist of the higher-density\nfragments, either rubble piles or monolithic structures, which evolve more slowly toward the spherical shape. There is a third population of very elongated members in all families, which are similar\nto the extreme examples of Geographos (Ostro et al. (1995)) and Cerberus (Szabó et al. (2002)),\nboth belonging to the Earth Crossing Objects. Our results show that such asteroids exist all over\nthe Main Belt (see also the \"dog-bone\" like asteroid Kleopatra Ostro et al. (2000)). It has been\nsuggested that the single-convex side, elongated bodies such as 1620 Geographos and 433 Eros\ncan be formed by tidal forces during close encounters with Earth and Venus, and about 2% of the\nrubble piles are likely to suffer tidal shaping (Bottke et al. (1999)). While this mechanism might\nexplain the strong elongation in the Near-Earth population, it is hardly applicable to the Main Belt.\nIndeed, the shape of the Main Belt asteroid Kleopatra was ascribed to an exotic sequence of collisional events (Ostro et al. (2000)). Our results shows that very elongated asteroids (a/b >2) make\nup a few percent, suggesting that those exotic collisional events may have happened much more\nfrequently than has been anticipated: up to 4–5 percent of asteroids in certain families (Flora, Eos,\nThemis, Hygiea) have very elongated shapes.\n\n10\n\n\fTo conclude, the main results of the paper are as follows. We have determined the shape\ndistribution for almost 12,000 minor planets from pairs of accurate brightness measurements using\nthe SDSS database. The overall distribution is in good agreement with that based on long-term\nphotometric monitoring but increases the sample by more than an order of magnitude. Our large\nsample allows us to investigate differences between minor planet families for the first time. We have\ndetermined the empirical shape distribution function for eight large families, which are defined by\ntheir clumpiness in the phase space of orbital elements and have estimated dynamical ages. We find\na tendency for old families to have significantly rounder members, which we interpret as evidence\nfor accumulated shaping by low-energy impacts.\nThis work has been supported by the Magyary Zoltán Public Foundation for Higher Education, the Bolyai János Research Fellowship and a University of Sydney Postdoctoral Research\nFellowship.\n\nReferences\nAbe M, et al. 2006. Near-Infrared Spectral Results of Asteroid Itokawa from the Hayabusa Spacecraft, Science, 312, 1334.\nBinzel R.P. Collisional evolution in the EOS and Koronis asteroid families - Observational and\nnumerical results, 1998, Icarus, 73, 303.\nBottke W. F. Jr., Richardson D. C., Michael, P., Love S.G. 1999. 1620 Geographos and 433 Eros:\nShaped by Planetary Tides?, AJ, 117, 1921.\nBowell, E., 2007, Introduction to ASTORB, available from ftp://ftp.lowell.edu/pub/elgb/astorb.html\nCappacioni, F., Cerroni, P., Coradini, M., Farinella, P., Flamini, E., Martelli, G., Paolicchi, P.,\nSmith, P. N., Zappala, V. 1984. Nature, 308, 832.\nCarruba V., Michtchenko T.A., Roig F., Ferraz-Mello, S., Nesvorný, D. 2005. On the V-type asteroids outside the Vesta family. I. Interplay of nonlinear secular resonances and the Yarkovsky\neffect: the cases of 956 Elisa and 809 Lundia, A&A, 441, 819\nCatullo, V., Zappala, V., Farinella, P., Paolicchi, P. 1984. Analysis of the shape distribution of\nasteroids, A&A, 138, 464\nChapman, C. R., Merline, W. J., Thomas, P. 1999. Cratering on Mathilde, Icarus, 40, 28.\n\n11\n\n\fChapman C.R., Merline, W. J. Thomas, P. C., Joseph, J., Cheng, A., F., Izenberg, N. 2002. Impact\nHistory of Eros: Craters and Boulders, Icarus, 155, 104\nEddington, A.S. 1910. The envelope of comet Morehouse, MNRAS, 70, 442\nFujiwara A et al., 2006. The Rubble-Pile Asteroid Itokawa as Observed by Hayabusa, Science,\n312, 1330.\nFulchiogni M., 2001, Asteroids, article in: Encyclopedia of Astronomy and Astrophysics (ed.\nMurdin P.) Inst. of Physics Publishing, Bristol\nGreenberg R., Nolan M.C., Bottke W. F. Jr., Kolvoord D. A., Veverka J. 1994. Collisional history\nof Gaspra, Icarus, 107, 84\nIvezić, Ž., Tabachnik, S., Rafikov, R., et al. 2001. Solar System Objects Observed in the Sloan\nDigital Sky Survey Commissioning Data, Astron. Journal, 122, 2749\nIvezić, Ž, Lupton, R. H.; Jurić, M., Tabachnik, S., Quinn, T., Gunn, J. E., Knapp, G. R., Rockosi,\nC. M., Brinkmann, J., Color Confirmation of Asteroid Families, AJ, 124, 2943\nKorycansky, D.G., Asphaug, E. 2003. Impact evolution of asteroid shapes1. random mass redistribution, Icarus, 163, 374.\nLawson, C. L., Hanson, B. J., 1974, Solving Least Squares Problems, Prentice-Hall, Englewood\nCliffs, NJ\nLeinhardt Z. M., Richardson D. C., Quinn T. 2000. Direct N-body Simulations of Rubble Pile\nCollisions, Icarus, 146, 133.\nMagnusson P., Kryszczynska A., 2007,\nAsteroid\nhttp://www.astro.amu.edu.pl/Science/Asteroids/\n\nspin\n\nvector\n\ndeterminations,\n\nMagnusson, P., Neese, C., 2005, NASA Planetary Data System, EAR-A-5-DDR-ASTEROIDSPIN-VECTORS-V4.2\nMarchis, F., Kaasalainen, M., Hom, E. F. Y., Berthier, J., Enriquez, J., Hestroffer, D., Le Mignant,\nD., de Pater, I. 2006. Shape, size and multiplicity of main-belt asteroids, Icarus, 185, 39\nMichel, P., Benz, W., Tanga, P., Richardson, D.C., 2001. Collisions and Gravitational Reaccumulation: Forming Asteroid Families and Satellites, Science, 294, 1696.\nMichel, P., Benz, W., Richardson, D.C. 2004. Catastrophic disruption of asteroids and family formation: a review of numerical simulations including both fragmentation and gravitational\nreaccumulations, P&SS, 52, 1109\n12\n\n\fNesvorny D., Botke W.F., Vokrouhlický D, Morbidelli, A., Jedicke, R., 2005 Asteroid families,\nProc. IAUS 229, 289.\nO'Brien, D.P., Greenberg, R. 2005. The collisional and dynamical evolution of the main-belt and\nNEA size distributions, Icarus, 178, 179.\nOkada, T., Shirai, K., Yamamoto, Y., Arai, T., Ogawa, K., Hosono, K., Kato, M. 2006, Science,\n312, 1338.\nOstro, S.J., Hudson, R. S., Nolan, M. C., Margot, J.-L., Scheeres, D. J., Campbell, D. B., Magri,\nCh., Giorgini, Jon D., Yeomans, D. K. 2000. Science, 288, 836.\nOstro S.J., Jurgens, R. F., Rosema, K. D. et al. 1996. Radar Observations of Asteroid 1620 Geographos, Icarus, 121, 46\nOstro S. J., et al. 2006, Radar Imaging of Binary Near-Earth Asteroid (66391) 1999 KW4, Science,\n314, 1276.\nPravec P.,Harris A. W. 2000. Fast and Slow Rotation of Asteroids, Icarus, 148, 12 .\nRichardson D. C., Leinhardt Z. M., Melosh H. J., Bottke W. F. Jr., Asphaug E., 2002, Gravitational\nAggregates: Evidence and Evolution, in: Asteroids III (eds. Bottke W. F. Jr., Cellino A.,\nPaolicchi P., Binzel R. P.), Univ. Arizona Press, Tucson, 501.\nRichardson, J. E., Melosh, H. J., Greenberg, R. 2004. Impact-Induced Seismic Activity on Asteroid\n433 Eros: A Surface Modification Process, Science, 306, 1526.\nRyan, E.V. 2000. Asteroid Fragmentation and Evolution of Asteroids, Ann. Rev. Earth & Planet\nSci., 28, 367.\nSaito J., et al. 2006. Detailed Images of Asteroid 25143 Itokawa from Hayabusa, Science, 312,\n1341.\nSzabó, Gy.M., Ivezić, Ž, Jurić, M., Lupton, R., Kiss, L.L. 2004. Color Variation of Asteroids in\nSDSS Moving Object Catalog, MNRAS, 348, 987.\nSzabó, Gy.M., Csák, B., Sárneczky, K., Kiss, L. L. 2002. Photometric observations of 9 Near-Earth\nObjects, A&A, 375, 285.\nTanga, P., Hestroffer, D., Cellino, Lattanzi, M., Di Martino, M., Zappalá, V. 2003. Asteroid observations with the Hubble Space Telescope. II. Duplicity search and size measurements for 6\nasteroids, A., A&A 471, 733.\n\n13\n\n\fZappala, V., Bendjoya, P., Cellino, A., Farinella, P., Froeschle, C. 1995. Asteroid families: Search\nof a 12,487-asteroid sample using two different clustering techniques. Icarus, 116, 291.\n\nThis preprint was prepared with the AAS LATEX macros v5.0.\n\n14\n\n\fTable 1: Selection volumes of asteroid families in the space of orbital elements. The number of\nidentified objects and the estimated ages are also given.\nFamilies ap\nsin i\ne\nN\nAge\nRef\nAU\nGyr\nFlora\n2.16–2.32 0.04–0.125 0.10–0.18 819 0.5, 1.0 Carruba et al. (2005); Nesvorny et al. (2005)\nVesta\n2.28–2.41 0.10–0.135 0.07–0.13 482 >1.3\nCarruba et al. (2005)\nMassalia 2.35–2-46 0.01–0.04\n0.14–0.18 132 0.15\nNesvorny et al. (2005)\nEunomia 2.52–2.72 0.19–0.26\n0.12–0.19 824 2.5\nNesvorny et al. (2005)\nKoronis\n2.81–2.96 0.03–0.05\n0.00–0.10 214 2.5\nNesvorny et al. (2005)\nEos\n2.95–3.10 0.15–0.20\n0.04–0.11 540 1.3\nNesvorny et al. (2005)\nThemis\n3.03–3.23 0–0.6\n0.11–0.20 968 2.5\nNesvorny et al. (2005)\nHygiea\n3.08–3.23 0.07–0.11\n0.10–0.16 193 2.0\nNesvorny et al. (2005)\n\n15\n\n\fFigure captions\nFig. 1. The orbits of 26,847 asteroids in the SDSS MOC 3 catalog. Families studied in this\npaper are labeled.\nFig. 2. A. the observed cumulative distribution of brightness differences of 11,735 SDSS\nMOC asteroids (thick line) with the model templates for discrete a/b ≡1.1,1.2,1.3... shape elongations (thin lines). B: the shape distribution for all the 11,735 asteroids determined by our method\n(thick line) and the histogram of shapes from 1207 published lightcurves (shaded area). The excellent agreement confirms the reliability of the statistical approach.\nFig. 3. Upper panels: the cumulative brightness variation of the examined families; lower\npanels: the difference in respect to the cumulative brightness variation in the whole sample. Individual symbols show the observational data, smooth lines represent the fitted models. The two\ngroup of families are the same as in Fig. 4.\nFig. 4. The evolution of shape distribution in asteroid families. A-D: (Massalia to Koronis)\nfamilies of 150 to 2500 million years show the dependence on age: the more elongated members\nof young families erode in time toward rough spheroids, whose relative frequency increases up\nto 50%. E-H: (Vesta to Themis) old families at increasing heliocentric distances – the farther the\nfamily, the more elongated its members. Note the distinct peaks of the distributions.\nFig. 5. The same as Fig 4, but calculated with model asteroids having randomly orinted spin\naxis with a fixed latitude of 50 degrees.\nFig. 6. The same as Fig 4, but ignoring asteroids with ∆m1,2 > 0.m 65, with which we checked\nthe robustness of the bimodal distributions.\n\n16\n\n\fFig. 1. The orbits of 26,847 asteroids in the SDSS MOC 3 catalog. Families studied in this paper\nare labeled.\n\n17\n\n\fcumulative distribution\n\n1\n0.8\n0.6\n0.4\n0.2\n0\n\nA\n0\n\n0.2\n\n0.4\n\n0.6\n\n0.8\n\ntwo-point brightness variation (magnitude)\n\nnormalised frequency\n\n0.4\nfull lightcurves\nSDSS two-epoch data\n\n0.3\n\n0.2\n\n0.1\n\nB\n0\n\n1\n\n1.25\n\n1.5\n\n1.75\n\n2\n\n2.25\n\n2.5\n\n2.75\n\n3\n\naxis ratio\nFig. 2. A. the observed cumulative distribution of brightness differences of 11,735 SDSS MOC\nasteroids (thick line) with the model templates for discrete a/b ≡1.1,1.2,1.3... shape elongations\n(thin lines). B: the shape distribution for all the 11,735 asteroids determined by our method (thick\nline) and the histogram of shapes from 1207 published lightcurves (shaded area). The excellent\nagreement confirms the reliability of the statistical approach.\n\n18\n\n\fFig. 3. Upper panels: the cumulative brightness variation of the examined families; lower panels:\nthe difference in respect to the cumulative brightness variation in the whole sample. Individual\nsymbols show the observational data, smooth lines represent the fitted models. The two group of\nfamilies are the same as in Fig. 4.\n\n19\n\n\fnorm. freq.\n\n0.5\n0.4\n0.3\n0.2\n0.1\n0\n0.5\n0.4\n0.3\n0.2\n0.1\n0\n0.5\n0.4\n0.3\n0.2\n0.1\n0\n\nnorm. freq.\n0.5\n0.4\n0.3\n0.2\n0.1\n0\n\nMassalia\n\nA\n1\n\n1.5\n\n2\n\n2.5\n\n3\n\nHELIOCENTRIC DISTANCE\n\nAGE\n\n0.5\n0.4\n0.3\n0.2\n0.1\n0\n\nFlora\n\nB\n1\n\n1.5\n\n2\n\n2.5\n\n3\n\nEos\n\nC\n1\n\n1.5\n\n2\n\n2.5\n\n3\n\nD\n1.5\n\n2\n\n2.5\n\n0.5\n0.4\n0.3\n0.2\n0.1\n0\n0.5\n0.4\n0.3\n0.2\n0.1\n0\n\nKoronis\n\n1\n\n0.5\n0.4\n0.3\n0.2\n0.1\n0\n\n3\n\naxis ratio\n\nVesta\n\nE\n1\n\n1.5\n\n2\n\n2.5\n\n3\n\nEunomia\n\nF\n1\n\n1.5\n\n2\n\n2.5\n\n3\n\nHygiea\n\nG\n1\n\n1.5\n\n2\n\n2.5\n\n3\n\nThemis\n\nH\n1\n\n1.5\n\n2\n\n2.5\n\n3\n\naxis ratio\n\nFig. 4. The evolution of shape distribution in asteroid families. A-D: (Massalia to Koronis) families\nof 150 to 2500 million years show the dependence on age: the more elongated members of young\nfamilies erode in time toward rough spheroids, whose relative frequency increases up to 50%. E-H:\n(Vesta to Themis) old families at increasing heliocentric distances – the farther the family, the more\nelongated its members. Note the distinct peaks of the distributions.\n\n20\n\n\fN/Ntot\n\n0.4\n\nMassalia\n\n0.3\n\n0.2\n\n0.2\n\n0.1\n\n0.1\n\n0\n\n1\n\n1.5\n\n2\n\n0.4\n\n2.5\n\n3\n\n0\n\n3.5\n\nFlora\n\n0.3\n0.2\n0.1\n\nAGE\n\n0.4\n\n0.3\n\nHELIOCENTRIC DISTANCE\n\nN/Ntot\n\n0\n\n1\n\n1.5\n\n2\n\n0.4\n\n2.5\n\n3\n\n3.5\n\nEos\n\n0.3\n0.2\n0.1\n0\n\n1\n\n1.5\n\n2\n\n0.4\n\n2.5\n\n3\n\n3.5\n\n0\n\n1\n\n1.5\n\n2\n\n3\n\n3.5\n\n3\n\n3.5\n\n3\n\n3.5\n\nHygiea\n\n0.2\n0.1\n0\n\n0\n\na/b\n\n2.5\n\n0.3\n\n0.1\n3.5\n\n3.5\n\nEunomia\n\n0.4\n\n0.2\n\n3\n\n3\n\n0.1\n\n0.1\n2.5\n\n2.5\n\n0.2\n\n0.2\n\n2\n\n2\n\n0.3\n\n0.3\n\n1.5\n\n1.5\n\n1\n\n1.5\n\n2\n\n0.4\n\nKoronis\n\n1\n\n1\n\n0.4\n\n0.3\n\n0\n\nVesta\n\n2.5\nThemis\n\n1\n\n1.5\n\n2\n\n2.5\n\na/b\n\nFig. 5. The same as Fig 4, but calculated with model asteroids having randomly orinted spin axis\nwith a fixed latitude of 50 degrees.\n\n21\n\n\fnorm. freq.\n\n0.5\n0.4\n0.3\n0.2\n0.1\n0\n0.5\n0.4\n0.3\n0.2\n0.1\n0\n0.5\n0.4\n0.3\n0.2\n0.1\n0\n\nnorm. freq.\n0.5\n0.4\n0.3\n0.2\n0.1\n0\n\nMassalia\n\nA\n1\n\n1.5\n\n2\n\n2.5\n\n3\n\nHELIOCENTRIC DISTANCE\n\nAGE\n\n0.5\n0.4\n0.3\n0.2\n0.1\n0\n\nFlora\n\nB\n1\n\n1.5\n\n2\n\n2.5\n\n3\n\nEos\n\nC\n1\n\n1.5\n\n2\n\n2.5\n\n3\n\nD\n1.5\n\n2\n\n2.5\n\n0.5\n0.4\n0.3\n0.2\n0.1\n0\n0.5\n0.4\n0.3\n0.2\n0.1\n0\n\nKoronis\n\n1\n\n0.5\n0.4\n0.3\n0.2\n0.1\n0\n\n3\n\naxis ratio\n\nVesta\n\nE\n1\n\n1.5\n\n2\n\n2.5\n\n3\n\nEunomia\n\nF\n1\n\n1.5\n\n2\n\n2.5\n\n3\n\nHygiea\n\nG\n1\n\n1.5\n\n2\n\n2.5\n\n3\n\nThemis\n\nH\n1\n\n1.5\n\n2\n\n2.5\n\n3\n\naxis ratio\n\nFig. 6. The same as Fig 4, but ignoring asteroids with ∆m1,2 > 0.m 65, with which we checked the\nrobustness of the bimodal distributions.\n\n22\n\n\fThis figure \"orbits.jpg\" is available in \"jpg\" format from:\nhttp://arxiv.org/ps/0801.2389v1\n\n\f"}