{"id": "http://arxiv.org/abs/0810.3830v1", "guidislink": true, "updated": "2008-10-21T13:41:12Z", "updated_parsed": [2008, 10, 21, 13, 41, 12, 1, 295, 0], "published": "2008-10-21T13:41:12Z", "published_parsed": [2008, 10, 21, 13, 41, 12, 1, 295, 0], "title": "Capability of the PAMELA Time-Of-Flight to identify light nuclei:\n  results from a beam test calibration", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0810.5094%2C0810.0517%2C0810.5317%2C0810.4231%2C0810.3446%2C0810.1692%2C0810.1065%2C0810.1854%2C0810.3189%2C0810.3506%2C0810.2685%2C0810.0766%2C0810.4659%2C0810.4349%2C0810.5077%2C0810.1311%2C0810.2289%2C0810.3683%2C0810.1784%2C0810.1339%2C0810.0870%2C0810.2431%2C0810.3541%2C0810.2562%2C0810.3677%2C0810.3830%2C0810.1268%2C0810.1470%2C0810.0003%2C0810.0202%2C0810.5311%2C0810.2940%2C0810.5443%2C0810.2717%2C0810.1514%2C0810.1838%2C0810.0893%2C0810.3321%2C0810.2454%2C0810.1431%2C0810.0939%2C0810.3395%2C0810.1246%2C0810.1546%2C0810.0413%2C0810.5580%2C0810.0471%2C0810.5296%2C0810.4029%2C0810.2052%2C0810.0425%2C0810.0590%2C0810.0275%2C0810.0748%2C0810.4179%2C0810.0438%2C0810.5329%2C0810.3536%2C0810.2684%2C0810.1064%2C0810.1551%2C0810.1317%2C0810.1597%2C0810.0217%2C0810.3051%2C0810.5486%2C0810.4868%2C0810.3268%2C0810.5554%2C0810.0854%2C0810.0677%2C0810.0704%2C0810.4848%2C0810.2357%2C0810.4794%2C0810.5485%2C0810.3310%2C0810.3096%2C0810.2276%2C0810.1375%2C0810.2272%2C0810.1825%2C0810.0995%2C0810.3564%2C0810.0061%2C0810.1946%2C0810.3703%2C0810.0143%2C0810.2737%2C0810.0887%2C0810.3171%2C0810.0220%2C0810.1018%2C0810.1993%2C0810.4022%2C0810.0539%2C0810.1448%2C0810.1189%2C0810.0319%2C0810.5435%2C0810.1738&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Capability of the PAMELA Time-Of-Flight to identify light nuclei:\n  results from a beam test calibration"}, "summary": "PAMELA is a space telescope orbiting around the Earth since June 2006. The\nscientific objectives addressed by the mission are the measurement of the\nantiprotons and positrons spectra in cosmic rays, the hunt for anti-nuclei as\nwell as the determination of light nuclei fluxes from Hydrogen to Oxygen in a\nwide energy range and with very high statistics. In this paper the charge\ndiscrimination capabilities of the PAMELA Time-Of-Flight system for light\nnuclei, determined during a beam test calibration, will be presented.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0810.5094%2C0810.0517%2C0810.5317%2C0810.4231%2C0810.3446%2C0810.1692%2C0810.1065%2C0810.1854%2C0810.3189%2C0810.3506%2C0810.2685%2C0810.0766%2C0810.4659%2C0810.4349%2C0810.5077%2C0810.1311%2C0810.2289%2C0810.3683%2C0810.1784%2C0810.1339%2C0810.0870%2C0810.2431%2C0810.3541%2C0810.2562%2C0810.3677%2C0810.3830%2C0810.1268%2C0810.1470%2C0810.0003%2C0810.0202%2C0810.5311%2C0810.2940%2C0810.5443%2C0810.2717%2C0810.1514%2C0810.1838%2C0810.0893%2C0810.3321%2C0810.2454%2C0810.1431%2C0810.0939%2C0810.3395%2C0810.1246%2C0810.1546%2C0810.0413%2C0810.5580%2C0810.0471%2C0810.5296%2C0810.4029%2C0810.2052%2C0810.0425%2C0810.0590%2C0810.0275%2C0810.0748%2C0810.4179%2C0810.0438%2C0810.5329%2C0810.3536%2C0810.2684%2C0810.1064%2C0810.1551%2C0810.1317%2C0810.1597%2C0810.0217%2C0810.3051%2C0810.5486%2C0810.4868%2C0810.3268%2C0810.5554%2C0810.0854%2C0810.0677%2C0810.0704%2C0810.4848%2C0810.2357%2C0810.4794%2C0810.5485%2C0810.3310%2C0810.3096%2C0810.2276%2C0810.1375%2C0810.2272%2C0810.1825%2C0810.0995%2C0810.3564%2C0810.0061%2C0810.1946%2C0810.3703%2C0810.0143%2C0810.2737%2C0810.0887%2C0810.3171%2C0810.0220%2C0810.1018%2C0810.1993%2C0810.4022%2C0810.0539%2C0810.1448%2C0810.1189%2C0810.0319%2C0810.5435%2C0810.1738&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "PAMELA is a space telescope orbiting around the Earth since June 2006. The\nscientific objectives addressed by the mission are the measurement of the\nantiprotons and positrons spectra in cosmic rays, the hunt for anti-nuclei as\nwell as the determination of light nuclei fluxes from Hydrogen to Oxygen in a\nwide energy range and with very high statistics. In this paper the charge\ndiscrimination capabilities of the PAMELA Time-Of-Flight system for light\nnuclei, determined during a beam test calibration, will be presented."}, "authors": ["D. Campana", "R. Carbone", "G. De Rosa", "G. Osteria", "S. Russo", "W. Menn", "V. Malvezzi", "L. Marcelli", "P. Picozza", "R. Sparvoli", "L. Bonechi", "M. Bongi", "S. Ricciarini", "E. Vannuccini", "."], "author_detail": {"name": "."}, "author": ".", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1016/j.nima.2008.10.014", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0810.3830v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0810.3830v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "17 pages, 9 figures, accepted for pubblication in NIMA", "arxiv_primary_category": {"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0810.3830v1", "affiliation": "INFN, Section of Florence, Florence", "arxiv_url": "http://arxiv.org/abs/0810.3830v1", "journal_reference": "Nucl.Instrum.Meth.A598:696-701,2009", "doi": "10.1016/j.nima.2008.10.014", "fulltext": "arXiv:0810.3830v1 [astro-ph] 21 Oct 2008\n\nCapability of the PAMELA Time-Of-Flight to\nidentify light nuclei: results from a beam test\ncalibration\n\nD. Campana a, R. Carbone a,d, G. De Rosa b, G. Osteria a,∗,\nS. Russo b , W. Menn c , V. Malvezzi d, L. Marcelli d, P. Picozza d,\nR. Sparvoli d, L. Bonechi e, M. Bongi f , S. Ricciarini f ,\nE. Vannuccini f\na INFN,\nb Dept.\n\nof Physics, University of Naples and INFN, Naples (Italy)\n\nc Dept.\nd Dept.\n\nSection of Naples, Naples (Italy)\n\nof Physics, University of Siegen, Siegen (Germany)\n\nof Physics, University of Rome Tor Vergata and INFN, Rome (Italy)\n\ne Dept.\n\nof Physics, University of Florence and INFN, Florence (Italy)\nf INFN,\n\nSection of Florence, Florence (Italy)\n\nAbstract\nPAMELA is a space telescope orbiting around the Earth since June 2006. The scientific objectives addressed by the mission are the measurement of the antiprotons\nand positrons spectra in cosmic rays, the hunt for anti-nuclei as well as the determination of light nuclei fluxes from Hydrogen to Oxygen in a wide energy range and\nwith very high statistics. In this paper the charge discrimination capabilities of the\nPAMELA Time-Of-Flight system for light nuclei, determined during a beam test\ncalibration, will be presented.\nKey words: Scintillation detectors, Cosmic rays, Abundances, Satellite-borne\nexperiment\nPACS: 29.40.Mc, 96.50.S-, 96.50.sb, 95.40.+s\n\n∗ Corresponding authour: Address: Complesso Universitario di Monte S.Angelo\nVia Cintia 80126 Naples - ITALY; Phone: +39 081 676167; E-mail:\ngiuseppe.osteria@na.infn.it\n\nPreprint submitted to Elsevier\n\n3 November 2018\n\n\f1\n\nIntroduction\n\nThe PAMELA apparatus is designed to study charged particles in the cosmic\nradiation. It is hosted by a Russian Earth-observation satellite, the ResursDK1, that was launched into space by a Soyuz rocket on the 15th June 2006\nfrom the Baikonur cosmodrome (Kazakhstan). The satellite orbit is elliptical\nand semi-polar, with an inclination of 70.0◦ and an altitude varying between\n350 km and 600 km. The mission will last nominally for three years. The main\nscientific goal of the experiment is the precise measurement of the cosmic-ray\nantiproton and positron energy spectra. The satellite orbit and the mechanical design of the apparatus allow the identification of these particles in an\nunprecedented energy range (between 50 MeV and 270 GeV for positrons and\nbetween 80 MeV and 190 GeV for antiprotons) and with high statistics (∼ 104\nantiprotons and ∼ 105 positrons per year). Additionally PAMELA is searching\nfor antimatter in the cosmic radiation, with a sensitivity for the anti-He/He\nratio of the order of ∼ 10−7 .\n\nPAMELA is also aimed to extensively study the abundances and composition\nof light cosmic rays (up to Oxygen) over almost three decades of energy. In\norder to clarify the role of the different mechanisms that act in the propagation\nand transport of galactic cosmic rays it is fundamental to have more precise\nand extended data on the relative abundances of the constituents of galactic\ncosmic rays and especially on the ratio of secondary to primary particles, such\nas the Boron/Carbon ratio.\n\nThis paper will illustrate the light-charge identification capabilities of the\nPAMELA Time-Of-Flight (TOF) system, as evaluated during a beam test\nperformed at the GSI laboratory - Germany - in February 2006. The TOF\nsystem is a key detector for the PAMELA instrument, providing trigger for\nacquisition, measuring the particle flight time (necessary to reject the albedo\nbackground component) and determining the absolute value of the particle\ncharge. The paper is organized as follows: after an overview of the PAMELA\ninstrument (section 2), the GSI beam test (set-up of the detector, available\nbeams, operational details) is described in section 3. Section 4 is dedicated to\nthe determination of the TOF time resolution from the beam data, obtained\nwith two different methods, and finally section 5 reports the charge resolution of PAMELA TOF system for several elements, ranging from Proton to\nCarbon.\n2\n\n\fFig. 1. A sketch of the PAMELA telescope. The method of discrimination between\nparticle and antiparticle with the magnetic spectrometer is illustrated. The main\ndirection of the magnetic field B inside the spectrometer is also shown.\n\n2\n\nThe PAMELA instrument and the Time-Of-Flight system\n\nThe PAMELA apparatus, shown in Figure 1, is composed by several subdetectors: TOF system, anticoincidence system, magnetic spectrometer with\nmicrostrip silicon tracking system, W/Si electromagnetic imaging calorimeter,\nshower-tail-catcher scintillator (S4) and neutron detector. A detailed description of the PAMELA instrument and an overview of the mission can be found\nin [1].\nThe instrument has maximum diameter of 102 cm and height of 120 cm; its\nmass is 470 kg, the maximum power consumption is 355 W. The magnetic spectrometer determines the charge sign and momentum of the incoming particle\nthrough the trajectory reconstruction in the magnetic field; downward-going\nparticles are identified with the time-of-flight measurement operated by TOF.\n3\n\n\fThe final identification (i.e. antiprotons against electrons etc.) is provided by\nthe combination of the calorimeter and neutron detector information for kinetic energies above 1 GeV and by the velocity measurement (obtained from\nthe trajectory and time-of-flight) at lower energies.\nIn what follows a synthetic description of the TOF system will be given; further details on the TOF detectors and electronics can be found in references\n[2] and [3] respectively.\nThe TOF system is composed of 6 layers of segmented plastic scintillators,\narranged in three double planes (S1, S2, S3 in Figure 1). The distance between S1 and S2 is around 30 cm, while the S1-S3 distance is around 77 cm.\nEach layer is divided into several identical paddles (strips), whose number and\ndimensions vary from layer to layer, for a total of 24 paddles. For each double plane, the paddles of the upper layer are orthogonal to those of the lower\nlayer, therefore allowing to get a bidimensional geometrical measurement of\nthe impact point of charged particles. The plastic scintillator material, BC404, manufactured by Bicron company, is characterized by a rise time of 700 ps\nand decay time of 1.8 ns. Both ends of each scintillator paddle are glued to an\nadiabatic UV-transmitting plexiglas light guide. The gluing is obtained with\nan optical cement, mod. BC-600 manufactured by Bicron. Each paddle is readout at each of its two ends by a photomultiplier tube (PMT) mod. R5900 by\nHamamatsu Photonics. The R5900 is a 10-stage metal package head-on PMT,\nwith rise time of 1.5 ns, achieving an amplification of about 4 × 106 at 900 V.\nIt has a square section of 25.7 × 25.7 mm2 and was chosen for its mechanical robustness, limited size and small weight (25.5 g). Since the core of the\nPAMELA apparatus is a permanent magnet, the PMTs have been shielded\nfrom the residual magnetic field of the spectrometer with a 1 mm thick μ-metal\nscreen [2].\nThe anode pulse of each PMT is converted both in charge (ADC) and time\n(TDC). The ADC measurements can be used to determine the Z of the incoming particle. The combined TDC information of the whole TOF is used\nto generate the main PAMELA trigger and to measure the flight time of the\nincoming particle. The geometry of the TOF planes has been chosen to match\nthe geometric acceptance of the spectrometer. The standard trigger configuration requires the coincidence of at least one TDC signal from each of the\nthree TOF double planes.\n\n3\n\nGSI beam test\n\nDuring its construction phase, PAMELA was tested three times with beams of\nprotons and electrons at the CERN SPS accelerator, to study the performance\nof the subdetectors with relativistic particles. Because of the tight schedule of\nPAMELA integration, however, it was not possible to perform a beam test of\n4\n\n\fFig. 2. The experimental set-up of PAMELA prototype at the GSI beam test. S1,\nS2 and S3 are the TOF system scintillators, while P1÷P5 are the silicon modules\nof the tracking system.\n\nthe flight model with light nuclei before its delivery to Russia in March 2005.\nFor this reason such a light-nuclei test was performed by using prototypes of\nthe PAMELA TOF and tracking system in a dedicated mechanical arrangement, on February 2006 at the GSI (Gesellschaft für Schwerionenforschung,\nDarmstadt, Germany) beam accelerator. Figure 2 shows the arrangement of\nthe instrument under test: in this set-up each TOF plane is formed by just\none paddle (indicated as S1, S2, S3 in the picture), while the prototype of\ntracking system is composed by 5 Si detector modules (P1 to P5).\nThe main aim of the test was the determination of the time resolution of\nthe TOF system and of the charge resolution both for the TOF and for the\ntracking system for light nuclei. In particular, the behaviour of these detectors\nwas studied, to determine the amount of variation from linearity of the corresponding read-out electronics with energy releases due to Z > 1 particles.\nThe test results on TOF performance will be presented in the next sections;\nresults for tracking system will not be discussed here as they will be published\nelsewhere.\nData were taken during four full days. PAMELA was the secondary beam\nuser for part of this time (during nights); when main user, it was possible to\nchoose the best available value for beam intensity (around 1000 particles/spill,\nwith a 4 s spill duration and a 3 s interval between subsequent spills); other5\n\n\fwise, the intensity was much higher (up to 108 particles/spill) thus resulting\nin high trigger rate but also in a large fraction of multi-particle events in the\ndetectors. For some runs, polyethylene or aluminium targets were employed\nto produce secondaries; besides, during night hours the presence of biological\ntest-tubes of the main beam user, upstream the PAMELA prototype, acted as\na target. The instrument was normally placed along the beam line, one meter\nbeyond the target position. For some acquisitions the instrument was moved\nto a different position, at the same distance but along a 45◦ radial line from\nthe target with respect to the beam line, to record only secondaries scattered\nat this high angle; these particles were mostly low-energy protons and He nuclei. Table 1 summarizes the different configurations used for the test. Three\nprimary beams were available: 12 C with kinetic energy of 1200 MeV/n, 12 C\nwith 200 MeV/n, 50 Cr with 500 MeV/n.\nThe TOF paddles used at GSI are identical to the ones of the corresponding\nflight-model layer; the dimensions of the paddles selected for the GSI test are:\n(40.8 × 5.5 × 0.7) cm3 for S1, (18.0 × 7.5 × 0.5) cm3 for S2 and (18.0 × 5.0 ×\n0.7) cm3 for S3. The three paddles were arranged with their main (longitudinal)\ndimension along the vertical axis. The S1-S3 distance at GSI was around 80 cm\n[4], while the S1-S2 distance was around 67 cm, greater than in the flight\nmodel. For this beam test the high voltages of the PMTs have been chosen in\nsuch a way to obtain a gain of 1 × 106 which, according to our calibrations,\ncorrespond to HV values varying from 780 V to 820 V.\nAs in the flight model, each paddle is read-out by two PMTs, thus giving a\ntotal of six ADC and six TDC signals. The trigger configuration requires the\ncoincidence of at least one TDC signal from S1 and S2 paddles. The read-out\nelectronics employed in this test is the same as for the flight model [3]. Concerning the prototype of tracking system used for the test, each detector module\nand its corresponding read-out electronics are identical to the ones employed\nin the flight model [5] [6]. To simplify the whole structure five silicon detector\nmodules have been assembled in a simple aluminum frame in such a way to\nkeep them aligned. The double-sided silicon sensors (5.33 × 7.00) cm2 provide two independent impact coordinates on each plane. The high-resistivity\nn-type Si bulk is segmented with 1024 read-out microstrips for each side: p+\nstrips on the junction side (implantation pitch 25.5 μm, read-out pitch 51 μm)\nand n+ strips on the ohmic side (implantation and read-out pitch 66.5 μm).\nJunction-side (X-view) strips are orthogonal to ohmic-side (Y-view) ones.\n\n4\n\nTOF time resolution and β measurements\n\nTwo different methods have been used here to measure the time resolution of\nthe TOF system. The first one combines information from the timing mea6\n\n\fTable 1\nBEAMS AVAILABLE AT THE GSI TEST\nParticle\n\nEnergy (MeV/n)\n\n12 C\n\n1200\n\n12 C\n\n1200\n\n12 C\n\n200\n\n12 C\n\n200\n\n50 Cr\n\n500\n\n50 Cr\n\n500\n\n50 Cr\n\n500\n\nTarget\n\nAngle (deg.)\n\nEvents\n\n0\n\n269896\n\n0\n\n123194\n\n45\n\n30378\n\n45\n\n196139\n\n0\n\n15976\n\n×\n\n0\n\n173960\n\n×\n\n45\n\n52241\n\n×\n×\n\nsurements of the TDCs and the position measurement of the tracking system;\nwith this method it is possible to get the intrinsic time resolution of a TOF\npaddle. The second approach takes into account only the measurements of the\nTOF itself using the measurements of two paddles, as a result one will get the\ntime resolution of the full TOF system.\nIn the first method we determine the intrinsic time resolution of a single\npaddle by taking information from both TOF and tracker. The position of the\nhit point along the scintillator x is proportional to the difference of the time\nmeasurements t1 and t2 at the two sides of the scintillator itself:\nx=\n\nvef f (t1 − t2 )\n+K\n2\n\n(1)\n\nwhere vef f is the signal velocity inside the scintillator.\nIf the position of the incident particle along the paddle as determined from\nthe timing of the pulses in the two PMTs (in units of picoseconds) is plotted\nversus the position as determined by the tracker, we obtain the scatter plot\nshown in figure 3.\nA linear fit to the distribution is shown as well. This fit is used to derive\nthe residuals for each event, thus getting finally the distribution of timing\ndeviations from the tracker-position which is shown in figure 4.\nAssuming negligible uncertainty in the projected position, the width of a Gaussian fitted to this distribution can be taken as the intrinsic time resolution of\nthe paddle ∆tSi .\nIn this way it is possible to evaluate the time resolution of the single paddle\nof the TOF system for each family of nuclei (produced by fragmentation)\nfrom Hydrogen to Carbon, as summarized in table 2. As expected, we see\n7\n\n\fEntries\np0\np1\n\n1800\n1600\n\n21050\n-121.4 ± 2.2\n12.34 ± 0.05\n\n1400\n1200\n1000\n800\n600\n400\n200\n0\n-200\n-40\n\n-20\n\n0\n\n20\n\n40\n\n60\n\n80\n100 120 140\nTrack projection on S3\n\nFig. 3. Scatter plot of the crossing coordinate along paddle S3 as reconstructed\nthrough TDC measurement (in units of ps) versus the position measured by the\ntracking system (in mm). The linear fit and the corresponding bin measurements\nare superposed. The fit parameter p1 represents ve f f in cm/ns. The points with\nlarge error bars are due to poor statistics (regions of the paddle reached only by\nfew particles).\n\nan improvement in the time resolution for higher charges, since such particles\nproduce more photons in the scintillator as for a proton of equal MeV/nucleon\n(according to the Bethe-Bloch equation the energy release and therefore the\nnumber of photons created in the scintillator increases with the square of the\ncharge Z of the particle).\nFor ions of small Z it is necessary to take into account the Time-Walk effect [7].\nIn order to evaluate the dependence of the time resolution from the amplitude\nof the signal, the quantity to be considered is, for each PMT of a given paddle,\nthe residual of each event from a linear fit analogous to that shown in figure\n3 for the S3 paddle, versus the amplitude of the signal of the same PMT. The\npoints in the resulting plots show a trend which is well fitted (see figure 5) by\na typical function [8]:\np1\np2\ntij = T DCij − (p0 + q\n)\n+\nADCij ADCij\n\n,\n\n(2)\n\nwhere i (=1,2) is the PMT index and j (=1,2,3) is the scintillator paddle index.\n8\n\n\fevents\n\nEntries\nConstant\nMean\nSigma\n\n70\n\n461\n65.54 ± 4.49\n-17.12 ± 2.56\n50.08 ± 2.38\n\n60\n50\n40\n30\n20\n10\n0\n-500\n\n-400\n\n-300\n\n-200\n\n-100\n\n0\n\n100\n\n200\n\n300\n400\n500\nResiduals (ps)\n\nFig. 4. Residual distribution for Boron sample in the S3 paddle; the standard deviation of this distribution is the intrinsic time resolution of this layer in ps.\nTable 2\nTIME RESOLUTION OF S3 PADDLE FOR DIFFERENT SAMPLES OF NUCLEI\nZ\n\n∆t (ps)\n\n∆t after Time-Walk correction(ps)\n\n1\n\n146.5±0.9\n\n117.3±0.7\n\n2\n\n131±5\n\n122±4\n\n3\n\n118±4\n\n114±4\n\n5\n\n50±2\n\n50±2\n\n6\n\n46.5±0.3\n\n46.5±0.3\n\nBy operating this time-amplitude correction we improved the time resolution\nup to Lithium (see last column of table 2).\nTo get the time resolution of the TOF with the second method we use two\nTOF paddles to derive the actual velocity β for a particle. Using the two\npaddles A and B we get four TDC measurements, t1 and t2 from paddle\nA, t3 and t4 from paddle B. While the difference of two measurements from\na paddle is proportional to the position of the particle in the paddle (see\nequation 1), the sum of the two measurements can be taken as the \"mean\ntime\" [9]. Thus the difference of the two sums will be proportional to the\nparticle velocity between the two counters. If we define the \"difference of\n9\n\n\fEntries\n21050\np0\n60.52 ± 6.58\np1\n-1150 ± 168.4\np2\n403.4 ± 1012.9\n\n60\n40\n20\n0\n-20\n-40\n-60\n-80\n-100\n-120\n0\n\n100\n\n200\n\n300\n\n400\n\n500\n\n600\n\n700\n800\nADC (ch)\n\nFig. 5. Differences between the position of the hit point along the paddle S3 as\nreconstructed by the TOF alone with respect to the same position reconstructed\nby the tracking system, plotted versus the amplitude (in units of ADC channels) of\nthe signal of one of the two PMTs of the paddle.\n\nsums\" DS as DS = (t1 + t2 ) − (t3 + t4 ), we derive a simple equation between\nDS and the velocity β of the particle [10]:\nDS = K1 + K2\n\n1\nβcosθ\n\n,\n\n(3)\n\nwhere K1 and K2 are two parameters which depend on the experimental setup,\nθ is the zenith angle. K2 depends solely on known values: K2 = 2L\n, where L\nc\nis the distance between the scintillator paddles and c is the speed of light. K1\nmust be derived from the data itself, since it depends on unknown features of\nthe experimental setup like cable lengths. To evaluate K1 we measure DS for\nparticles of known β and invert the equation 3. For this purpose we use, for\neach of the three types of beam, only data acquired with direct exposition of\nthe apparatus to the beam (without polyethylene or aluminum target). The\nobtained values of K1 for each couple of scintillators are consistent.\nWith the calculated values of the K1 and K2 constants we can reconstruct β.\n10\n\n\fevents\n\nEntries\n155257\n2.085e+04 ± 71\nConstant\nMean\n0.9002 ± 0.0001\nSigma\n0.02119 ± 0.00005\n\n22000\n20000\n18000\n16000\n14000\n12000\n10000\n8000\n6000\n4000\n2000\n0\n0.7\n\n0.75\n\n0.8\n\n0.85\n\n0.9\n\n0.95\n\n1\n\n1.05\n\n1.1\nBeta\n\nFig. 6. Distribution of the velocity of particles β (in units of speed of light) measured\nbetween the planes S1 and S2 for a 1200 MeV/n 12 C beam.\nTable 3\nResolution for time-of-flight and beta measurement\nIons\n12 C\n\n1200 MeV/n\n\nPaddles\n\nTheor. β\n\nMeasured Mean β\n\n∆t(ps)\n\nS1-S2\n\n0.899\n\n0.90±0.02\n\n67\n\n0.902±0.019\n\n62\n\n0.568±0.009\n\n61\n\n0.570±0.007\n\n62\n\n0.760±0.016\n\n63\n\n0.760±0.015\n\n68\n\nS1-S3\n12 C\n\n200 MeV/n\n\nS1-S2\n\n0.568\n\nS1-S3\n50 Cr\n\n500 MeV/n\n\nS1-S2\n\n0.759\n\nS1-S3\n\nBy exposing the instrument to a monochromatic beam of particles with fixed\nkinetic energy (which is the same sample selected to evaluate K1 ), the width of\nthe distribution of the reconstructed β (an example is in figure 6) determines\nthe time resolution on the measurements of time of flight, according to the\nsimple relation ∆t = ∆β cβL2 .\nTable 3 summarizes the results of the measurements of time resolution of the\nTOF system with different beams and for different combinations of paddles.\n11\n\n\fFor the determination of the particle velocity it is possible to use any combination of planes, like also planes S2 and S3, but being the distance between\nthem of only 13 cm, the error ∆β will be much larger than for the other two\ncombinations, therefore it was not used in our analysis.\nThe measured resolution is consistent with expectations and with tests in\nlaboratory [11]. Since the actual β for a particle is derived from two paddles,\nwe expect to the first order the simple propagation of errors:\n∆tjk =\n\nq\n\n(∆tSj )2 + (∆tSk )2\n\n,\n\n(4)\n\nwhere ∆tjk is the resolution of the full TOF using DS, and ∆tSj and ∆tSk\nare the intrinsic errors of the paddles derived\n√ with the first method. In the\nmost simple case this will just give a factor 2 if the paddles have the same\nintrinsic resolution. Results for C nuclei are in agreement with the results for\nthe intrinsic resolution,\n√ as one can notice comparing values from tables 2 and\n3, being ∆tSi ≃ ∆t/ 2 from the DS method.\n5\n\nCharge resolution for light nuclei\n\nTo study the charge resolution of TOF for light nuclei we tried to have a\ndata sample widely spread out in energy so to simulate as well as possible the\nsituation in flight. Therefore, the full available statistics for C beams has been\nconsidered, namely the 12 C beam at 1200 MeV/n, with and without target, and\nthe sample at 200 MeV/n, with and without target, and recorded at angles of\nboth 0◦ and 45◦ . First step of the analysis was the selection of the data sample\nto be analyzed. The initial data volume was reduced by an amount of 10-15%\neliminating noisy events or small runs acquired in improper conditions.\nThe particle charge is determined by the energy deposits in any of the three\nTOF planes in conjunction with the velocity measurement from the TOF,\nthat can be derived both by the top and the central and by the top and the\nbottom scintillators. The three scintillator layers enable three independent\ncharge determinations, thus improving significantly the charge resolution.\nThe measurement of the energy released inside the scintillator by the passing\nparticle is proportional to the mean charge deposited, Q, which can be measured by converting the ADC signal (in units of ADC channels) into charge\n(in units of pC) and correcting this value for the attenuation of light in the\nscintillator. By plotting this charge measurement versus the particle velocity\nwe saw that points related to nuclei of different Z fall into different bands\n(figure 7); by fitting these bands it was possible to assign to every Z a mean\nvalue of charge deposit at the minimum of ionization.\n12\n\n\fEntries\n\n97588\n\nCharge (pC)\n\n1000\n900\n800\n700\n600\n500\n400\n300\n200\n100\n00.1\n\n0.2\n\n0.3\n\n0.4\n\n0.5\n\n0.6\n\n0.7\n\n0.8\n\n0.9\n\n1\n\n1.1\nBeta\n\nFig. 7. The energy deposit in S2 as a function of the measured velocity β. The\nparticles fall into charge bands. The 3 solid lines identify H, He, Li bands by means\nof phenomenological functions. The dark areas correspond to the particles with\ngreater statistics in our sample. The three darkest areas are: Carbon ions of the\nbeam at 1200 MeV/n (on the top-right), Boron ions (fragment) and low energy\nprotons (recorded at angle of 45◦ ). The β value used in this plot is not corrected\nfor the Time-Walk effect and this explains the relatively big number of He and Li\nnuclei in the region with β > 1.\n\nThe results show that Q increases linearly with Z 2 in good approximation\nfor S1 and S2, while for S3 a loss of linearity is observed (see figure 8). The\nbehaviour can be justified by looking at the number of photoelectrons (PE)\nproduced in each PMT, which is related to Q through the formula:\nPE =\n\nQ\ne*G\n\n,\n\n(5)\n\nwhere Q is the released charge, e is the charge of the electron and G is the gain\nof the PMT. The mean number of photoelectrons produced in S3 is greater\nthan the one produced in S1 and S2 paddles, because S3 is thicker than S2\n(more photons produced) and shorter than S1 (less attenuation). Apparently,\nhence, the charge released in S3 by the heavier ions covers a region of the\ndynamical range in which the system loses linearity.\nTo evaluate the contribution of this non-linearity of the PMT output, we\n13\n\n\fNumber of PEs S3up\nNumber of PEs S3dwn\nBirks' function for S3up\nBirks' function for S3dwn\nTheoretical line without saturation\nExpected trend with PMT saturation\n\n1600\n\n1400\n\nNumber of PEs\n\n1200\n\n1000\n\n800\n\n600\n\n400\n\n200\n\n0\n\n0\n\n5\n\n10\n\n15\n\nZ\n\n20\n\n25\n\n2\n\nFig. 8. Loss of linearity for S3 paddle versus Z 2 of the incident particle.\n\nobserve that, with our electronic base, the measured gain value of the R5900\nPMT's is constant when the number of photoelectrons is lower than ∼ 700;\nabove this value the relation between the two quantities deviates gradually\nfrom linearity 1 . This deviation corresponds to a loss of gain of about 10%\nfrom ∼ 700 to ∼ 1100 PE (Be region) and about 15% from ∼ 1000 to ∼ 1500\nPE (B region).\nFigure 8 shows the comparison between the \"ideal\" behaviour of P E versus\nZ 2 (full line, obtained assuming that the gain is constant with Z) with the\nexpected dependence taking into account the loss of gain of PMT's (dasheddotted line) and the actual measurements of P E operated by the two PMTs\nassociated to S3 which are affected by PMT saturation. Apparently the saturation of the PMTs is not sufficient to explain the loss of linearity. The\n\n1\n\nDue to limitations on total weight and power budget for the TOF system, it was\nnot possible to set-up a separate ADC acquisition chain exploiting the dynode signal\nof the PMT or use a different electronic base.\n\n14\n\n\fTable 4\nCHARGE DISCRIMINATION FOR TOF\nNuclei\n\nZ\n\nPaddle\n\nσZ\n\nH\n\n1\n\nS2\n\n0.08\n\nS3\n\n0.07\n\nS2\n\n0.4\n\nS3\n\n0.3\n\nS2\n\n0.3\n\nS3\n\n0.2\n\nHe\n\nLi\n\nBe\n\nB\n\nC\n\n2\n\n3\n\n4\n\nS2\n\n5\n\n6\n\nS3\n\n0.3\n\nS2\n\n0.17\n\nS3\n\n0.2\n\nS2\n\n0.15\n\nS3\n\n0.17\n\nexperimental points were fitted by a 3-parameters function (dotted lines):\nP E = p0 +\n\np1 Z 2\n1 + p2 Z 2\n\n.\n\n(6)\n\nBy using this calibration function for a given PMT, it is possible to associate\na value of Z to each particle by measuring the number of photoelectrons. The\nparticle Z measured by a given paddle can be calculated as the mean between\nthe two independent PMT measurements.\nThe plot of Z distribution for the paddles S2 and S3 is shown in figure 9,\nwith Gaussian fits superposed on the data. The number of events relative to\nProtons and Carbons are divided by a factor 8 in order to make more visible\nthe peaks for different values of Z.\nTable 4 shows the charge resolutions (standard deviations of the Gaussian\nfits) obtained with the previous method for nuclei from H to C and for S2 and\nS3 paddles. The charge uncertainty is less than 0.1 for protons and 0.16 for\nC (in units of proton charge e). These results are extremely satisfactory for\nPAMELA TOF, since they are of the same order of magnitude of other space\nmissions that measured nuclei and isotopes in the cosmic radiation, like the\nISOMAX balloon-borne mission [12].\n15\n\n\fEvents\n\nEntries\n\n43053\n\n900\n800\n700\n600\n500\n400\n300\n200\n100\n1\n\n2\n\n3\n\n4\n\n5\n\n6\n\n7\nZ\n\nEvents\n\nEntries\n\n43053\n\n500\n\n400\n\n300\n\n200\n\n100\n\n1\n\n2\n\n3\n\n4\n\n5\n\n6\n\n7\nZ\n\nFig. 9. Charge distribution obtained for particles with different beta and incident\nangle as measured by the TOF (top: paddle S2; bottom: paddle S3). The number of\nevents for Z = 1 and Z = 6 are divided by a factor 8, in order to make more visible\nthe peaks for different values of Z. Gaussian fits are superposed on the data.\n\nConclusion\nThis paper has shown the charge identification capabilities of PAMELA TimeOf-Flight system, as evaluated during a beam test. The test was performed\nat the GSI Laboratory in Darmstadt (Germany), in February 2006, with a\ntechnological copy of the PAMELA TOF and tracking system.\nMonochromatic beams of Carbon and Chromium were used for the test, which\nlasted 4 days in a 24 hours/day cycle. By means of polyethylene and aluminum\ntargets, and positioning the instrument at different angles with respect to the\n16\n\n\fbeam axis, it was possible to study the charge resolution of the TOF for all\nlight nuclei from Hydrogen to Carbon, and across a wide energy interval. Results show that the PAMELA Time-Of-Flight reaches very good performance\nin the identification of light-nuclei, thanks to the design and quality of the\nscintillating paddles.\nFurthermore, beam test data were used to estimate the time resolution of the\nTOF, which resulted in agreement with laboratory tests.\n\nAcknowledgments\nWe acknowledge the staff working at GSI, and especially dr. Dieter Schardt,\nfor the excellent professionalism and friendly collaboration they offered us\nduring our work in the laboratory. We would like also to thank the followings\ntechnicians of the INFN structure of Naples for their valuable contribution to\nthe realization of the apparatus: P. Parascandolo, G. Passeggio, G. Pontoriere,\nE. Vanzanella.\n\nReferences\n[1] P. Picozza et al., Astropart. Phys, 2007, 27, p. 296.\n[2] G. Barbarino et al., NIM A, 2008, 584, p. 319.\n[3] G. Osteria et al., NIM A, 2004, 518, p. 161.\n[4] G. Barbarino et al., Nuclear Physics B, 2003, 125, p. 298.\n[5] S. Straulino et al., NIM A, 2004, 530, p. 168.\n[6] S. Ricciarini et al., NIM A, 2007, 582, p. 892.\n[7] W. Braunschweig et al., NIM 134, 1976, p. 261.\n[8] M. Ambrosio et al., NIM A, 2002, 486, p. 663.\n[9] D. Alvisi et al., NIM A, 1999, 437, Issues 2-3, p. 212.\n[10] R. Carbone et al., NIM A, 2008, 588, Issues 1-2, p. 235.\n[11] G. Osteria et al., NIM A, 2004, 535, p. 152.\n[12] G. A. de Nolfo et al., The Astrophysical Journal, 2004, 611, p. 892.\n\n17\n\n\f"}