{"id": "http://arxiv.org/abs/0709.3804v2", "guidislink": true, "updated": "2008-02-13T18:01:41Z", "updated_parsed": [2008, 2, 13, 18, 1, 41, 2, 44, 0], "published": "2007-09-24T16:11:26Z", "published_parsed": [2007, 9, 24, 16, 11, 26, 0, 267, 0], "title": "Simple and secure quantum key distribution with biphotons", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0709.0987%2C0709.4057%2C0709.3865%2C0709.2240%2C0709.1422%2C0709.1912%2C0709.1325%2C0709.4313%2C0709.2978%2C0709.2084%2C0709.1436%2C0709.4103%2C0709.1935%2C0709.2352%2C0709.4146%2C0709.2879%2C0709.2041%2C0709.0161%2C0709.0465%2C0709.2696%2C0709.2877%2C0709.1717%2C0709.3046%2C0709.3685%2C0709.3819%2C0709.0092%2C0709.0829%2C0709.2523%2C0709.3214%2C0709.4073%2C0709.0997%2C0709.3269%2C0709.2658%2C0709.0922%2C0709.4586%2C0709.4389%2C0709.1632%2C0709.1441%2C0709.0898%2C0709.4097%2C0709.0683%2C0709.1557%2C0709.2473%2C0709.3092%2C0709.2509%2C0709.3476%2C0709.2265%2C0709.3080%2C0709.4351%2C0709.1731%2C0709.3356%2C0709.3343%2C0709.4480%2C0709.3166%2C0709.2804%2C0709.4622%2C0709.2560%2C0709.2353%2C0709.2331%2C0709.3482%2C0709.2115%2C0709.3460%2C0709.1187%2C0709.2637%2C0709.1997%2C0709.0029%2C0709.2897%2C0709.0914%2C0709.3163%2C0709.3712%2C0709.4302%2C0709.3886%2C0709.0499%2C0709.2769%2C0709.3740%2C0709.1437%2C0709.2811%2C0709.4290%2C0709.1500%2C0709.4063%2C0709.3804%2C0709.2698%2C0709.2236%2C0709.0522%2C0709.3329%2C0709.2777%2C0709.4431%2C0709.2301%2C0709.3409%2C0709.2826%2C0709.4640%2C0709.0468%2C0709.4232%2C0709.3658%2C0709.2049%2C0709.2384%2C0709.0186%2C0709.2667%2C0709.3016%2C0709.3171%2C0709.3421&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Simple and secure quantum key distribution with biphotons"}, "summary": "The best qubit one-way quantum key distribution (QKD) protocol can tolerate\nup to 14.1% in the error rate. It has been shown how this rate can be increased\nby using larger quantum systems. The polarization state of a biphoton can\nencode a three level quantum system - a qutrit. The realization of a QKD system\nwith biphotons encounters several problems in generating, manipulating and\ndetecting such photon states. We define those limitations and find within them\na few protocols that perform almost as well as the ideal qutrit protocol. One\nadvantage is that these protocols can be implemented with minor modifications\ninto existing single photon systems. The security of one protocol is proved for\nthe most general coherent attacks and the largest acceptable error rate for\nthis protocol is found to be around 17.7%. This is the first time, to the best\nof our knowledge, that the security of qutrit QKD protocols is rigorously\nanalyzed against general attacks.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0709.0987%2C0709.4057%2C0709.3865%2C0709.2240%2C0709.1422%2C0709.1912%2C0709.1325%2C0709.4313%2C0709.2978%2C0709.2084%2C0709.1436%2C0709.4103%2C0709.1935%2C0709.2352%2C0709.4146%2C0709.2879%2C0709.2041%2C0709.0161%2C0709.0465%2C0709.2696%2C0709.2877%2C0709.1717%2C0709.3046%2C0709.3685%2C0709.3819%2C0709.0092%2C0709.0829%2C0709.2523%2C0709.3214%2C0709.4073%2C0709.0997%2C0709.3269%2C0709.2658%2C0709.0922%2C0709.4586%2C0709.4389%2C0709.1632%2C0709.1441%2C0709.0898%2C0709.4097%2C0709.0683%2C0709.1557%2C0709.2473%2C0709.3092%2C0709.2509%2C0709.3476%2C0709.2265%2C0709.3080%2C0709.4351%2C0709.1731%2C0709.3356%2C0709.3343%2C0709.4480%2C0709.3166%2C0709.2804%2C0709.4622%2C0709.2560%2C0709.2353%2C0709.2331%2C0709.3482%2C0709.2115%2C0709.3460%2C0709.1187%2C0709.2637%2C0709.1997%2C0709.0029%2C0709.2897%2C0709.0914%2C0709.3163%2C0709.3712%2C0709.4302%2C0709.3886%2C0709.0499%2C0709.2769%2C0709.3740%2C0709.1437%2C0709.2811%2C0709.4290%2C0709.1500%2C0709.4063%2C0709.3804%2C0709.2698%2C0709.2236%2C0709.0522%2C0709.3329%2C0709.2777%2C0709.4431%2C0709.2301%2C0709.3409%2C0709.2826%2C0709.4640%2C0709.0468%2C0709.4232%2C0709.3658%2C0709.2049%2C0709.2384%2C0709.0186%2C0709.2667%2C0709.3016%2C0709.3171%2C0709.3421&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The best qubit one-way quantum key distribution (QKD) protocol can tolerate\nup to 14.1% in the error rate. It has been shown how this rate can be increased\nby using larger quantum systems. The polarization state of a biphoton can\nencode a three level quantum system - a qutrit. The realization of a QKD system\nwith biphotons encounters several problems in generating, manipulating and\ndetecting such photon states. We define those limitations and find within them\na few protocols that perform almost as well as the ideal qutrit protocol. One\nadvantage is that these protocols can be implemented with minor modifications\ninto existing single photon systems. The security of one protocol is proved for\nthe most general coherent attacks and the largest acceptable error rate for\nthis protocol is found to be around 17.7%. This is the first time, to the best\nof our knowledge, that the security of qutrit QKD protocols is rigorously\nanalyzed against general attacks."}, "authors": ["I. Bregman", "D. Aharonov", "M. Ben-Or", "H. S. Eisenberg"], "author_detail": {"name": "H. S. Eisenberg"}, "author": "H. S. Eisenberg", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevA.77.050301", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0709.3804v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0709.3804v2", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "4 pages, 4 figures, calculation error corrected, new Fig. 4, 2 new\n  Refs. and 2 omitted", "arxiv_primary_category": {"term": "quant-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "quant-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0709.3804v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0709.3804v2", "journal_reference": null, "doi": "10.1103/PhysRevA.77.050301", "fulltext": "Simple and secure quantum key distribution with biphotons\nI. Bregman,1 D. Aharonov,1 M. Ben-Or,1 and H.S. Eisenberg2\n1\n\nDept. of Computer Science, Hebrew University of Jerusalem, Jerusalem 91904, Israel\nRacah Institute of Physics, Hebrew University of Jerusalem, Jerusalem 91904, Israel\n\narXiv:0709.3804v2 [quant-ph] 13 Feb 2008\n\n2\n\nThe best qubit one-way quantum key distribution (QKD) protocol can tolerate up to 14.1% in the\nerror rate. It has been shown how this rate can be increased by using larger quantum systems. The\npolarization state of a biphoton can encode a three level quantum system - a qutrit. The realization\nof a QKD system with biphotons encounters several problems in generating, manipulating and\ndetecting such photon states. We define those limitations and find within them a few protocols\nthat perform almost as well as the ideal qutrit protocol. One advantage is that these protocols can\nbe implemented with minor modifications into existing single photon systems. The security of one\nprotocol is proved for the most general coherent attacks and the largest acceptable error rate for\nthis protocol is found to be around 17.7%. This is the first time, to the best of our knowledge, that\nthe security of qutrit QKD protocols is rigorously analyzed against general attacks.\nPACS numbers: 03.67.Dd, 42.50.Ex\n\nIn order to establish an unconditionally secure communication channel between two parties (traditionally called\nAlice and Bob), they have to share a random sequence\nof bits known only to them - a one time pad. Quantum\nkey distribution (QKD) is a scheme that exploits the details of quantum measurements for generating such a key.\nIn the most basic protocol (referred to as BB84 after its\ninventors Bennett and Brassard[1]), Alice sends Bob a series of two level quantum systems, referred to as qubits.\nThe states are randomly chosen from two sets, each of\nthem contains two orthogonal states that represent the\nlogical zero and one. The two sets relate to each other in a\nmutually-unbiased way, i.e. the probability of measuring\nany particular state when given a state from a different\nset is 1/2. Thus, if Alice chooses to send a state from the\nfirst set, a measurement in the basis of the other, either\nby Bob or by an eavesdropper (called Eve), will give no\ninformation about Alice's choice.\nTo create the required secret key, a few more steps\nshould be carried out through a classical channel, not\nnecessarily secured. First, Alice and Bob compare their\nmeasurement bases and sift only those bits which were\nmeasured in identical bases. From the remaining key,\nthey reveal a portion and compare the results in order\nto estimate the noise parameter. This noise can result\neither from a real physical noise in the channel as well\nas from Eve's measurements. Next, they perform two\ntransformations on the key, one to correct for errors and\nthe second, called privacy amplification, to reduce the\namount of mutual information between them and Eve.\nA QKD protocol is characterized by a few parameters.\nThe ratio between the number of remaining bits after\ncompleting this procedure to the number of bits before\nit, is called the rate of the protocol. The merit function\nthat characterizes a specific protocol shows its rate as a\nfunction of the disturbance, the error probability that the\nchannel and Eve have created. The higher the critical\ndisturbance, where the rate approaches zero, the more\n\nuseful is the protocol. In recent years, the lower bound\non the critical error rate of BB84 was improved several\ntimes and the best known result is about 12.4%[2].\nThe BB84 protocol can be extended in many ways.\nThe first simple way is to add an extra base that is\nmutually-unbiased with both others[3]. It can be easily\nshown that only one mutually unbiased base (MUB) can\nbe added to the BB84 protocol. According to Ref. [2],\nthe current critical error rate of this three MUB protocol\nis around 14.1%. Another approach is to use quantum\nsystems of higher dimensionality[4]. A three level system can represent a quantum trit (qutrit) and a general d-level system can represent a qudit. A possible\nadvantage is the larger number of MUB, up to d + 1\nfor a d-dimensional protocol[5]. Previously, generalized\nprotocols that use qutrits and higher dimensional quantum systems have been suggested and their security was\nstudied[4, 6]. A potential advantage of improved rates\nfor such protocols was shown by examining various attack schemes[7, 8, 9, 10, 11, 12]. However, to the best of\nour knowledge, the exact values of the critical error rates\nfor qutrit protocols subject to general attacks have never\nbeen calculated prior to this work.\nThere are a few approaches for the realization of more\nthan two level quantum systems with light. One is by\ndiscriminating between modes of different orbital angular\nmomentum[13, 14]. Another approach is to use several\nspatial modes[15] or time bins[16]. A different approach\nthat has been studied extensively in recent years is the\nqutrit representation of the polarization state of two indistinguishable photons - a biphoton[17, 18]. A general\nbiphoton state can be written as\n|ψ2 i = α0 |2, 0i + α1 |1, 1i + α2 |0, 2i ,\n\n(1)\n\nwhere |nh , nv i is a Fock representation of nh (nv ) horizontally (vertically) polarized photons. The general state\nψ2 is represented by a complex vector ᾱ = (α0 , α1 , α2 )\nwith four degrees of freedom (3 complex numbers less a\n\n\f2\ngeneral phase and normalization). This scheme can be\nalso extended to higher dimensions by adding more photons, but in this Letter we focus on qutrits.\nThere are a few difficulties with generating arbitrary biphoton states[19] as well as when trying to\nmanipulate[20] and detect them. Optical parametric\ndown-conversion (PDC) is the obvious choice as a generating scheme, but there are only two types of processes\navailable; type I that creates states of the |2, 0i and |0, 2i\nforms, and type II that creates |1, 1i (both in a collinear\nscheme). If a non-collinear scheme is used, type I can\ncreate the |1, 1i type as well. In order to create a general state as in Eq. 1, a sensitive interferometer that\nincludes both type I and II crystals is required. Moreover, as we will show later, it is impossible to transform\nefficiently by means of linear optics a state created with\none PDC process into an arbitrary biphoton state. Finally, as transformations are limited, efficient detection is\nonly possible for the three basic vectors (the components\nof Eq. 1, defined as the 'measurement basis') and their\navailable transformations within those limits. Detection\nof a general state is only possible with a beam-splitter\nsetup that detects a general state only 1 out of 4 tries.\nIn this Letter, we define the subset of biphoton states\nwhich is easily generated, manipulated and detected. We\nfind biphoton QKD protocols within these limits that are\nmore secure and efficient than the best single photon protocol. Critical error rates are derived for various qutrit\nprotocols subject to general attacks, and compared to the\nbest possible qutrit protocol of 4 MUB[4].\nFirst, we shall define the set of allowed transformations. When a biphoton is transmitted through a linear\noptics setup, the polarization state of both of its photons experience the same single photon unitary transformation. The set of all possible unitary transformations\non a single photon polarization can be mapped onto the\nPoincaré sphere (or the Bloch sphere for a general qubit\nrealization), such that Û (θ, φ) describes the operation\nthat transforms the state at the north pole to the coordinates (θ, φ). Thus, if we position the state |1, 0i at the\nnorth pole, a general operation will transform it into\nÛ (θ, φ)|1, 0i = cos(θ/2)|1, 0i + sin(θ/2)eiφ |0, 1i .\n\n(2)\n\nWe name the north pole state as the 'anchor' state and\nthe set of Û operators as the single photon operations. In\nthis single photon case it is trivial to show that whatever\nanchor state is chosen, the Û operators will always cover\nthe whole single photon polarization space. There are\na few simple rules to note. A trivial 2π rotation along\nany great circle will bring any state to itself, while a π\nrotation will transform any state to its orthogonal state.\nMoreover, a rotation by only π/2 along such a path always transforms between two mutually unbiased states.\nWe shall now find the set of states that can be\nreached by applying Û to the biphoton measurement basis. Choosing the states |2, 0i and |1, 1i as the anchors\n\n2,0 + 2,0\n90\n135\n\n45\n\nθ\n\n2,0 − 2,0\n\n1,1\n\n45\n\nφ\n\n180\n\n2,0 − 2,0\n0\n\n0\n\n225\n\n315\n270\n\n2,0 + 2,0\n\nFIG. 1: A top projection from the north pole of an orthogonal\ntriplet basis on the |1, 1i dome. The empty circles are states\nidentical to their 180◦ opposites. Four states on this manifold\nare mutually-unbiased to the triplet. These four states are\nnot orthogonal between themselves.\n\nand applying the single photon operations, we get\nθ\n1\nθ\nÛ (θ, φ)(1, 0, 0) = (cos2 ( ), √ sin(θ)eiφ , sin2 ( )e2iφ ) ,(3)\n2\n2\n2\n−1\n1\nÛ (θ, φ)(0, 1, 0) = ( √ sin(θ), cos(θ)eiφ , √ sin(θ)e2iφ ) ,(4)\n2\n2\nas the new ᾱ vectors, respectively. By allowing only two\nparameter operations from a finite set of anchor states,\nwe defined a two dimensional subset of the general biphoton four dimensional space. As the |0, 2i state appears\nat the south pole of the sphere defined by the |2, 0i anchor, there is a full overlap between spheres defined by\nthese two states. On the other hand, the |1, 1i state\ndoes not appear on the |2, 0i sphere, thus defining a nonoverlapping sphere that can not be reached from the |2, 0i\nsphere by single photon operations.\nIt is possible to identify a few great circle rotation rules\nfor the two new spheres, that would be useful later when\nwe will look for possible QKD protocols in this subset.\nFirst, the |2, 0i sphere inherited all of the properties from\nthe |1, 0i single photon sphere. A 2π rotation returns to\nthe original state, a π rotation transforms between two\northogonal states and π/2 between two states whose projection on each other is 1/2. In the case of the |1, 1i\nsphere, there is an interesting difference. The same rules\nstill apply, but for half the angles. A π rotation returns\nto the original state, a π/2 rotation transforms between\ntwo orthogonal states and π/4√between two states whose\nprojection on each other is 1/ 2. We can identify an orthogonal vector triplet on the |1, 1i sphere as three states\nwith π/2 in between them. A simple example for such a\ntriplet is the |1, 1i state and two 'bunched' states such as\n|2, 0i + |2, 0i and |2, 0i − |2, 0i[21]. Curiously, the state\nwhich is exactly in the middle of any such triplet (at the\ntetrahedral point, about 54.7◦ from all the triplet states)\n\n\f3\n2,0\n\na)\n\n1,1\n\nb)\n\n2,0\n\n1.0\n\n1,1\n0.8\n\nb\n\nI -I\n\ne\n\n0.6\n\n0,2\n\n0,2\n\nFIG. 2: a) The umbrella protocol: two mutually-unbiased\nbases within the single-photon operation subspace. b) The\nthree rays protocol: three ray-type bases that are not perfectly mutually-unbiased.\n\n0.4\n\n0.2\n\n0.0\n0.00\n\n0.05\n\n0.10\n\n0.15\n\n0.20\n\n0.25\n\n0.30\n\n0.35\n\n0.40\n\nE\nis mutually unbiased with them (see Fig. 1). As opposite\npoints on the |1, 1i sphere are identical, it is enough to\nconsider only the upper half of the sphere (a dome).\nThe rotation rules convert the task of finding MUB to\na packaging problem. Is it possible to pack two triplet\nbases together on the |1, 1i dome and preserve mutuallyunbiased relationship? By examining Fig. 1 it is easy to\nsee that it is impossible. On the other hand, we recognize a second general type of an orthogonal basis. If we\nposition the dome concentrically inside the |2, 0i sphere\nsuch that both of their north poles point in the same direction, every ray that passes through the sphere center\nwill cut the subspace at three points, two on the sphere\nand one on the dome. This ray triplet contains three orthogonal states. The simplest example is the vertical ray\nthat defines the measurement basis.\nWe define two possible protocols whose security will be\nchecked here. The first protocol has two perfectly MUB\nand the second has three (or more) which are not. Apart\nfrom the measurement basis which is included in both\nprotocols, the additional basis of the first protocol is\n\u001a\n\u001b\n1\n1\n1\n√ (1, 1, −1), √ (1, τ, −τ 2 ), √ (1, τ 2 , −τ ) , (5)\n3\n3\n3\n2\n\nwhere τ = ei 3 π . Notice how this basis is equivalent to the\nsecond Fourier basis in Ref. [4], up to a minus sign at the\nlast position. We name this protocol after its umbrella\nshape (see Fig. 2a). The two additional bases of the\nsecond protocol are of the ray type:\n\u001a\n\u001b\n√\n1\n1\n1 √\n(1, 2, 1), √ (1, 0, −1), (1, − 2, 1) ,\n(6)\n2\n2\n2\n\u001a\n\u001b\n√\n1\n1 √\n1\n(1, 2i, −1), √ (1, 0, 1), (−1, 2i, 1) .\n2\n2\n2\nAlthough the three bases are only close to mutuallyunbiased, this protocol is appealing because of its symmetry and similarity to the three bases protocol for qubits[3]\n(see Fig. 2b). Additionally, we considered a protocol\n\nFIG. 3: Intercept and resend analysis of a few QKD protocols.\nQubit protocols are in thin lines - dotted for BB84 and solid\nfor the 3 MUB extension. Thick lines are for qutrit protocols dotted, dashed, dot-dashed and solid for the umbrella, 3 rays,\n7 rays and 4 MUB, respectively.\n\nwith 7 ray bases in order to check whether adding rays\nimproves the protocol. The 7 rays are the three of the\nprevious protocol, plus the four rays through the tetrahedral points (the directions are identical to the 7 solid\ncircles in Fig. 1)\nThe simplest eavesdropping attack scheme is the 'intercept and resend' approach. Showing that a protocol\nis secure against this limited attack does not imply security against general attacks. It is only used here for\ncomparison between different protocols. We calculated\nBob and Eve mutual information with Alice with the\nmethod of Ref. [4] and plotted the difference between\nthem as a function of the error rate for a few protocols\n(see Fig. 3). There is a clear hierarchy between qubit\nand qutrit protocols. The umbrella protocol is better\nthan any other using qubits, while the 3 rays protocol\nis even better than the umbrella protocol even though it\ndoes not include perfectly MUB. As expected, the best\nperformance belongs to the 4 MUB protocol, that marks\nthe upper limit for any qutrit protocol. Surprisingly, the\n7 rays protocol performs very close to ideal. All critical\nvalues are much higher than the real limits as this attack\nscheme is far from ideal.\nIn order to prove the ultimate security that is required\nfrom a QKD protocol, we use the general method introduced in Ref. [2, 22]. The advantage of this method over\nother previous security proofs is its easy extendability to\nhigher dimension while proving security against the most\ngeneral coherent attacks. The scheme results in a convex\nnonlinear optimization problem for every error rate value.\nHere, we only prove unconditional security for the 4 MUB\nand the umbrella protocols as they correspond to simpler\n\n\f4\na QKD protocol. We suggested a few possible protocols\nwithin this subspace. The security of these protocols was\nanalyzed and compared to standard qubit protocols. A\nlarge improvement was shown compared to qubits, even\nfor the umbrella protocol, which has only two MUB. The\nunconditional security of the umbrella and the 4 MUB\nprotocols was proved by extending a previous proof for\nqubits. This is the first time, to the best of our knowledge, that qutrit protocols have received such a rigorous\ntreatment.\n\n1.0\n\n0.8\n\nb\n\nI -I\n\ne\n\n0.6\n\n0.4\n\n3x2\n\n2x3\n\n4x3\n\n0.2\n\n0.0\n0.00\n\n0.05\n\n0.10\n\n0.15\n\n0.20\n\nH.S.E. and I.B. would like to thank the Israeli Science\nFoundation for supporting this work under grants 366/06\nand 1057/05, respectively. The authors wish to thank B.\nKol and N. Gisin for helpful discussions.\n\nE\nFIG. 4: Key generation rate analysis for a general coherent\nattack. Solid (dashed) lines are for calculation with (without)\nnoise optimization. Presented results are for 3 qubit and 2 and\n4 qutrit MUB (3x2, 2x3 and 4x3 respectively).\n\nsets of constraints than the ray protocols. Nevertheless,\nit is only reasonable to assume that as the performance of\nthe ray type protocols according to intercept and resend\nanalysis is between the 4 MUB and umbrella protocols,\ntheir performance against general coherent attacks will\nbe in this range as well.\nAfter deriving the constraints, we optimized numerically the target function (the protocol rate) with the\nCVXOPT convex optimization package[23]. Both procedures, with and without noise addition, were calculated. The results are plotted in figure 4. For the 3 MUB\nqubit protocol we reproduced the known critical values\nof 14.1% (12.7%) (with and without noise optimization).\nWe find proven lower bounds of 17.7% (16.0%), 20.3%\n(18.25%) and 21.1% (19.1%) for the critical error rates\nof the 2 (the umbrella), 3 and 4 MUB qutrit protocols,\nrespectively. The 3 qutrit MUB graph is not presented\nhere as it can't be realized within the borders of our subset. These values are considerably higher than the best\nvalue for qubit protocols to date. Just two MUB gives\nmost of the gain between qubits and qutrits, as previously suggested by weaker security analysis[11, 12].\nWe have left open an important issue regarding any\nqutrit protocol with biphotons. Namely, what is the relation between the single photon (qubit) error rate of\na certain channel and the qutrit error probability when\ntransmitting biphotons? This issue will be addressed in\na later work.\nIn conclusion, we defined the single photon operation subspace of the polarized biphoton representation\nof qutrits. This subspace includes states which are easy\nto generate and detect, and thus are easy to implement in\n\n[1] Ch.H. Bennett and G. Brassard, in Proceedings of the\nIEEE International Conference on Computers, Systems\nand Signal Processing, Bangalore, India (IEEE, New\nYork, 1984), p. 175.\n[2] B. Kraus, N. Gisin and R. Renner, Phys. Rev. Lett. 95,\n080501 (2005).\n[3] D. Bruss, Phys. Rev. Lett. 81, 3018 (1998).\n[4] H. Bechmann-Pasquinucci and A. Peres, Phys. Rev. Lett.\n85, 3313 (2000).\n[5] W.K. Wootters and B.D. Fields, Ann. Phys. (N.Y.) 191,\n363 (1989).\n[6] V. Karimipour, A. Bahraminasab and S. Bagherinezhad,\nPhys. Rev. A 65, 052331 (2002).\n[7] H. Bechmann-Pasquinucci and W. Tittel, Phys. Rev. A\n61, 062308 (2000).\n[8] M. Bourennane, A. Karlsson and G. Björk, Phys. Rev. A\n64, 012306 (2001)\n[9] D. Bruss and C. Macchiavello, Phys. Rev. Lett. 88,\n127901 (2002).\n[10] M. Bourennaneet et al., J. Phys. A 35, 10065 (2002)\n[11] N. Cerf et al., Phys. Rev. Lett. 88, 127902 (2002).\n[12] F. Caruso, H. Bechmann-Pasquinucci and C. Macchiavello, Phys. Rev. A 72, 032340 (2005).\n[13] A. Mair, A. Vaziri, G. Weihs, and A. Zeilinger, Nature\n412, 313 (2001).\n[14] S. Gröblacher et al., New J. of Phys. 8, 75 (2006).\n[15] L. Bartůšková et al., Phys. Rev. A 74, 022325 (2006).\n[16] R.T. Thew, A. Acı́n, H. Zbinden and N. Gisin, Phys.\nRev. Lett. 93, 010503 (2004).\n[17] A.V. Burlakov et al., Phys. Rev. A 60, R4209 (1999).\n[18] M.V. Chekhova, L.A. Krivitsky, S.P. Kulik and G.A.\nMaslennikov, Phys. Rev. A 70, 053801 (2004).\n[19] Yu.I. Bogdanov et al., Phys. Rev. A 70, 042303 (2004);\nYu.I. Bogdanov et al., Phys. Rev. Lett. 93, 230503\n(2004).\n[20] B.P. Lanyon et al., quant-ph/0707.2880v2 (2007).\n[21] C.K. Hong, Z.Y. Ou and L. Mandel, Phys. Rev. Lett. 59,\n2044 (1987).\n[22] R. Renner, N. Gisin and B. Kraus, Phys. Rev. A 72,\n012332 (2005).\n[23] http://abel.ee.ucla.edu/cvxopt\n\n\f"}