{"id": "http://arxiv.org/abs/0705.1568v2", "guidislink": true, "updated": "2007-10-04T13:10:21Z", "updated_parsed": [2007, 10, 4, 13, 10, 21, 3, 277, 0], "published": "2007-05-10T23:41:18Z", "published_parsed": [2007, 5, 10, 23, 41, 18, 3, 130, 0], "title": "Ab-initio formulation of the 4-point conductance of interacting\n  electronic systems", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0705.1538%2C0705.1425%2C0705.2629%2C0705.0568%2C0705.0485%2C0705.4497%2C0705.1682%2C0705.2977%2C0705.1914%2C0705.3249%2C0705.2083%2C0705.3638%2C0705.0865%2C0705.2622%2C0705.2725%2C0705.4629%2C0705.4185%2C0705.2204%2C0705.3551%2C0705.2325%2C0705.3436%2C0705.3291%2C0705.4257%2C0705.1038%2C0705.2107%2C0705.3257%2C0705.4667%2C0705.0598%2C0705.4087%2C0705.1772%2C0705.2708%2C0705.3444%2C0705.2346%2C0705.1531%2C0705.2563%2C0705.3301%2C0705.0033%2C0705.0465%2C0705.2698%2C0705.0012%2C0705.0651%2C0705.0826%2C0705.0046%2C0705.0537%2C0705.1412%2C0705.1218%2C0705.1213%2C0705.1280%2C0705.1823%2C0705.2065%2C0705.3827%2C0705.2096%2C0705.3426%2C0705.0522%2C0705.1567%2C0705.2816%2C0705.2768%2C0705.3194%2C0705.0506%2C0705.3402%2C0705.0073%2C0705.1722%2C0705.3825%2C0705.1568%2C0705.2912%2C0705.1270%2C0705.4474%2C0705.0064%2C0705.2460%2C0705.2250%2C0705.1657%2C0705.1167%2C0705.0304%2C0705.2513%2C0705.1537%2C0705.4417%2C0705.2545%2C0705.0327%2C0705.0039%2C0705.1178%2C0705.1394%2C0705.2188%2C0705.2938%2C0705.3710%2C0705.0937%2C0705.3611%2C0705.2658%2C0705.4652%2C0705.1731%2C0705.4679%2C0705.3125%2C0705.3254%2C0705.4200%2C0705.0633%2C0705.2044%2C0705.3065%2C0705.4090%2C0705.4057%2C0705.1791%2C0705.2625%2C0705.4310&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Ab-initio formulation of the 4-point conductance of interacting\n  electronic systems"}, "summary": "We derive an expression for the 4-point conductance of a general quantum\njunction in terms of the density response function. Our formulation allows us\nto show that the 4-point conductance of an interacting electronic system\npossessing either a geometrical constriction and/or an opaque barrier becomes\nidentical to the macroscopically measurable 2-point conductance. Within\ntime-dependent density-functional theory the formulation leads to a direct\nidentification of the functional form of the exchange-correlation kernel that\nis important for the conductance. We demonstrate the practical implementationof\nour formula for a metal-vacuum-metal interface.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0705.1538%2C0705.1425%2C0705.2629%2C0705.0568%2C0705.0485%2C0705.4497%2C0705.1682%2C0705.2977%2C0705.1914%2C0705.3249%2C0705.2083%2C0705.3638%2C0705.0865%2C0705.2622%2C0705.2725%2C0705.4629%2C0705.4185%2C0705.2204%2C0705.3551%2C0705.2325%2C0705.3436%2C0705.3291%2C0705.4257%2C0705.1038%2C0705.2107%2C0705.3257%2C0705.4667%2C0705.0598%2C0705.4087%2C0705.1772%2C0705.2708%2C0705.3444%2C0705.2346%2C0705.1531%2C0705.2563%2C0705.3301%2C0705.0033%2C0705.0465%2C0705.2698%2C0705.0012%2C0705.0651%2C0705.0826%2C0705.0046%2C0705.0537%2C0705.1412%2C0705.1218%2C0705.1213%2C0705.1280%2C0705.1823%2C0705.2065%2C0705.3827%2C0705.2096%2C0705.3426%2C0705.0522%2C0705.1567%2C0705.2816%2C0705.2768%2C0705.3194%2C0705.0506%2C0705.3402%2C0705.0073%2C0705.1722%2C0705.3825%2C0705.1568%2C0705.2912%2C0705.1270%2C0705.4474%2C0705.0064%2C0705.2460%2C0705.2250%2C0705.1657%2C0705.1167%2C0705.0304%2C0705.2513%2C0705.1537%2C0705.4417%2C0705.2545%2C0705.0327%2C0705.0039%2C0705.1178%2C0705.1394%2C0705.2188%2C0705.2938%2C0705.3710%2C0705.0937%2C0705.3611%2C0705.2658%2C0705.4652%2C0705.1731%2C0705.4679%2C0705.3125%2C0705.3254%2C0705.4200%2C0705.0633%2C0705.2044%2C0705.3065%2C0705.4090%2C0705.4057%2C0705.1791%2C0705.2625%2C0705.4310&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We derive an expression for the 4-point conductance of a general quantum\njunction in terms of the density response function. Our formulation allows us\nto show that the 4-point conductance of an interacting electronic system\npossessing either a geometrical constriction and/or an opaque barrier becomes\nidentical to the macroscopically measurable 2-point conductance. Within\ntime-dependent density-functional theory the formulation leads to a direct\nidentification of the functional form of the exchange-correlation kernel that\nis important for the conductance. We demonstrate the practical implementationof\nour formula for a metal-vacuum-metal interface."}, "authors": ["P. Bokes", "J. Jung", "R. W. Godby"], "author_detail": {"name": "R. W. Godby"}, "author": "R. W. Godby", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevB.76.125433", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0705.1568v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0705.1568v2", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "cond-mat.mtrl-sci", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.mtrl-sci", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "cond-mat.mes-hall", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0705.1568v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0705.1568v2", "arxiv_comment": null, "journal_reference": "Phys. Rev. B 76, 125433 (2007)", "doi": "10.1103/PhysRevB.76.125433", "fulltext": "Ab-initio formulation of the 4-point conductance of interacting electronic systems\nP. Bokes,1, 2, ∗ J. Jung,3, 1 and R. W. Godby1\n1 Department\n\nof Physics, University of York, Heslington, York YO10 5DD, United Kingdom\nof Physics, Faculty of Electrical Engineering and Information Technology,\nSlovak University of Technology, Ilkovičova 3, 812 19 Bratislava, Slovak Republic\n3 Physics Division, National Center for Theoretical Sciences, P.O. Box 2-131, Hsinchu, Taiwan\n(Dated: November 30, 2018)\n\narXiv:0705.1568v2 [cond-mat.mtrl-sci] 4 Oct 2007\n\n2 Department\n\nWe derive an expression for the 4-point conductance of a general quantum junction in terms of the density\nresponse function. Our formulation allows us to show that the 4-point conductance of an interacting electronic\nsystem possessing either a geometrical constriction and/or an opaque barrier becomes identical to the macroscopically measurable 2-point conductance. Within time-dependent density-functional theory the formulation\nleads to a direct identification of the functional form of the exchange-correlation kernel that is important for the\nconductance. We demonstrate the practical implementation of our formula for a metal-vacuum-metal interface.\nPACS numbers: 73.63.-b, 71.15.Mb, 73.40.Jn, 05.60.Gg\n\nI.\n\nINTRODUCTION\n\nImpressive progress has been achieved within the nonequilibrium Green's function (NEGF) formulation of quantum transport using the simple ground-state density-functional\nexchange-correlation potential in a self-consistent formulation1,2 (NEGF-DFT). However, limitations of the latter approximation were recently identified3,4,5,6,7,8,9,10 . For instance, NEGF-DFT's omission of the derivative-discontinuity\nin the exchange-correlation energy functional was found responsible for serious errors in transport calculation through\nlocalized resonant levels5,6 . Improvements through an (spin) unrestricted NEGF-DFT formulation have been argued to\ndescribe properly some aspects of the Coulomb blockade in\nquantum junctions7. At this level of the theory the exchangecorrelation potential of the equilibrium system, vxc , is responsible for the electron interaction effects.\nIn a further theoretical development, Na Sai et al.3 identified a dynamical correction to the resistance of a quantum\njunction stemming from the contribution of the exchangecorrelation electric field to the overall drop in the total potential. They estimated the correction within time-dependent\ncurrent-density functional theory11 (TDCDFT) and showed\nthat it has its origin in the non-local density-dependence of the\nfunctional. The very applicability of time-dependent densityfunctional theory (TDDFT) to the problem of quantum transport in the long-time limit has been discussed in depth by Stefanucci and Almbladh8 and by Di Ventra and Todorov9.\nSeveral authors have proposed alternative treatments that\navoid the complexities of the exchange-correlation kernels\nof TD(C)DFT, either by treating the central region with the\nconfiguration integration method12,13 while approximating the\nnon-equilibrium distribution of the electrons, or by using the\nusual NEGF-DFT approach in combination with a model selfenergy within the central region14. More systematic approach\nto the self-energy can be obtained through well tested approximations like the GW method15,16 . Due to the large computational demand so far only very small systems with restricted\nsize of the basis set could be studied. However, the results are\nencouraging, e.g. the Kondo effect phenomenology seems to\n\nbe well described within the self-consistent GW method16.\nNonetheless, a systematic approach for addressing the conductance of a fully interacting system at the ab-initio level\nis not available. This is partly due to the fact that the very\nformulation of the NEGF formalism17 is based on the concept of noninteracting electrodes and demands partitioning of\nthe system and the electron-electron interaction18. Stefanucci\nand Almbladh8 showed that the partitioning can be avoided in\nprinciple but practical inclusion of the many-body interactions\ninto the formalism seems to be extremely cumbersome. Fortunately, partitioning is not necessary within the linear response\nformulation. Several authors have addressed the conductance\nof interacting system of electrons within the framework of the\nKubo formalism arriving at a 2-point Landauer-like formula\nfor the conductance10,19,20,21 by making certain assumptions\nabout the steady-state total electric field. There is, however,\na problem with this derivation since it ignores the charge redistribution in the conducting system when the steady state is\nforming. In fact, ignoring these aspects one quickly arrives\nat various unphysical corrections to the conductance22. The\nproblem of charge redistributions has been first pointed out\nby Thouless23. Later Kamenev and Kohn24 cast it into a selfconsistent framework for many-terminal conductance.\nIn our work we further develop the formalism that treats the\ncharge redistribution correctly, find its physical interpretation\nin terms of a time-dependent transient process that leads to\nthe establishment of a current-carrying steady state, and derive a closed formula for the 4-point conductance that is welldefined formally as well as physically.\nTo describe quantum transport it is necessary to consider\nthe production of a steady state with nonzero current in a\ngeneric quantum junction, starting from the ground state (or\nmore generally, from an equilibrium ensemble at finite temperature). Physically, we expect to achieve a steady state that\nhas a uniform average current I flowing through the system,\naccompanied by a total potential exhibiting a drop V across\nit. As was advocated many years ago by Landauer25, V arises\nfrom the resistivity dipole, a local charge imbalance of a piledup charge in the front and depleted charge behind a quantum\njunction. Physically such a state is reached by attaching a\nmacroscopic battery to the circuit that pumps electrons from\n\n\f2\none electrode to the other until a certain potential difference\nbetween these two is established. For modeling purposes this\nmechanism cannot be used directly42. Here we will use a\nconstruct based on an auxiliary homogeneous vector potenR\ntial ~Aaux (t) = − 0t ~E aux (t ′ )dt ′ , pointing in the direction of the\neventual flow of current, giving a momentum transfer to all\nthe electrons in the infinite system within a finite interval of\ntime. (This auxiliary vector potential is similar in spirit to the\none used by R. Gebauer and R. Car to model a nanojunction\nusing periodic boundary conditions26. There, in contrast to\nour work, the vector potential grows linearly in time for all\nt > 0 and the work exerted on the system must be dissipated\nvia auxiliary phonons located in the electrodes.) The infinite\nextent of the system is formally essential to our treatment. It\nis necessary for a continuous spectrum and for giving a momentum transfer at t = 0 to infinitely many electrons present\nin the system so that the current will flow for all times t > 0.\nHowever, we would like to mention already at this point that\nin practical calculations the necessity of the infinite extension\ncan be relaxed so that the formulation can be used for practical\nab-initio calculations.\n\nII.\n\nTHE NON-LOCAL CONDUCTIVITY AND\nCONDUCTANCE\n\nThe response of the current density to a general external\nelectric field is given within the linear response theory by27\n~j(~r,t) =\n\nZ t\n\ndt ′\n\n−∞\n\nZ\n\n~σ (~r,~r′ ;t − t ′ ) * ~E ext (~r′ ,t ′ ).\nd 3 r ′~\n\n(1)\n\nFor simplicity we introduce a symbolic notation for the above\n~σ ⋆ ~E ext . In our work, the role of the\nequation in the form ~j = ~\nexternal field is taken by the auxiliary field ~E aux that is homogeneous and has only a finite duration, i.e. it is absent for large\ntimes and it bears no information about the drop in potential in\nthe long-time limit. The latter is contained within the induced\nfield ~E i (~r,t), which appears explicitly when considering the\nirreducible (or proper) conductivity28,29 ,\n~σ irr ⋆ (~\n~j = ~\n~σ ⋆ ~E aux = ~\nE aux + ~E i ).\n\n(2)\n\nThe induced field accounts for the electron-electron interaction at the Hartree level, which is usually referred to as the\nlong-range effects of the Coulomb interaction, whereas the\nrest of the interactions between electrons, the short range part,\nis included within the irreducible conductivity. The quantity\nin which we are primarily interested in is the conductance,\ndefined as G = I/V where V is a voltage drop. For G, the detailed spatial and time dependence of the current density and\nthe induced field while the steady current is being established\nare of no relevance. We define the voltage drop as the overall\ndrop in potential of the induced field ~E i along the current flow\n(along the z axis) between far left and far right,\nV = lim\n\nZ +∞\n\nt→∞ −∞\n\ndzEzi (~r,t),\n\n(3)\n\n1111\n0000\n0000\n1111\n0000\n1111\n0000\n1111\n0000\n1111\n0000\n1111\n0000\n1111\n0000\n1111\n0000\n1111\n0000\n1111\n0000\n1111\n0000\n1111\n0000\n1111\n0000\n1111\n0000\n1111\n0000\n1111\n0000\n1111\n0000\n1111\n0000\n1111\n0000\n1111\n0000\n1111\n0000\n1111\n0000\n1111\n0000\n1111\n0000\n1111\n0000\n1111\nj=0\n0000\n1111\n0000\n1111\n0000\n1111\n0000\n1111\n0000\n1111\n0000\n1111\n0000\n1111\n\n∆μ\nV\n\nj>0\nI>0\n\n11111\n00000\n00000\n11111\n00000\n11111\n00000\n11111\n00000\n11111\n00000\n11111\n00000\n11111\n00000\n11111\n00000\n11111\n00000\n11111\n00000\n11111\n00000\n11111\n00000\n11111\n00000\n11111\n00000\n11111\n00000\n11111\n00000\n11111\n00000\n11111\n00000\n11111\n00000\n11111\n00000\n11111\n00000\n11111\n00000\n11111\n00000\n11111\n00000\n11111\n00000\n11111\n00000\n11111\n00000\n11111\n00000\n11111\n00000\n11111\n00000\n11111\n00000\n11111\n00000\n11111\n00000\n11111\n00000\n11111\n00000\n11111\n\nFIG. 1: (Color-online) Measurement of the voltage between the\nmacroscopic electrodes, where the current density is zero, gives the\ntwo-point conductance G2P = I/(∆ μ /e). Measuring the voltage drop\ninside the simulation box (supercell), where the current density is\nnonzero, gives the four-point conductance G4P = I/V . Increasing\nthe supercell the two quantities approach each other (see Sec. V).\n\nwhich will be indicated by a superscript 4P in the associated\n4-point conductance, G4P . This definition is most suitable\nfor ab-initio modeling and does not suffer from ambiguities\npresent when one considers two chemical potentials. In mesoscopic physics, the above definition of conductance is referred\nto as the 4-point conductance (hence the superscript) since\nit represents measurement of the voltage drop using contacts\ndifferent from those acting as a source and drain of the current. In the extreme case of a 1D conducting channel of noninteracting, but locally neutral electrons it reduces to the wellknown expression G4P = (2e2 /h)(T /R). This is in contrast\nwith the most frequently encountered 2-point conductance,\nG2P , where the voltage drop is understood to be the difference\nin electro-chemical potentials of the two macroscopic electrodes, ∆μ /e (see Fig. 1). Since the electrodes are not part of\nthe quantum-mechanical model of the conducting channel, the\nfamiliar Landauer result G2P = (2e2 /h)T is believed not to be\nderivable from the Kubo formalism30 and its plausible derivations are always accompanied with steps motivated by physical insight and arguments about phase-incoherent adiabatically widening electrodes31. Here we show that for a nanocontact between massive electrodes the 4-point conductance approaches the 2-point Landauer formula. However we never\nmake a reference to ∆μ /e and we consistently work with the\ndrop in the induced electrostatic potential only. Our claims for\nits applicability for the experimental 2-point conductance follow from the fact that for massive electrodes connected with a\nnanojunction the current density in the electrodes goes to zero\nand thereby the drop in the induced (Hartree) potential is an\nexcellent indicator of the phenomenological quantity ∆μ /e.\nThe latter argument serves as a motivation to use the G4P as\nconceptually and formally well defined quantity to characterize systems of fully interacting electrons in any geometry of\nthe junction.\n\n\f3\nIII. SINGULARITY IN THE RESPONSE FUNCTION AND\nTHE 2-POINT CONDUCTANCE\n\nAn essential property of the conductivity response function\nof extended systems capable of coherent transport is their singular long range character for large times or – equivalently –\nas the frequency approaches zero21 . To show this behavior explicitly we need to introduce a few geometrical details of the\nstudied nanojunction which do not restrict the generality of\nour argument. We consider a geometry where z is a direction\nof the current flow, q a reciprocal vector in that direction, and\nfor clarity we assume that the system can be put into a periodic supercell along the x, y directions. The conductance G4P\nis then a conductance for the area of the supercell S. To find\nthe current flowing through S, we integrate Eq. (2) across the\ncross-sectional area. This naturally leads to the cross-section\nintegrated conductivity32\n\nσ irr (z, z′ ;t) =\n\nZ Z\n\nS S\n\n~σ irr (~r,~r′ ;t) * d~S′,\nd~S * ~\n\n(4)\n\nwhich relates the current to the z-component of the total field,\nI(z,t) =\n\nZ t\n\ndt ′\n\nZ ∞\n\n−∞\n\ndz′ σ irr (z, z′ ;t − t ′ )(E aux (t ′ ) + E i (z′ ,t ′ )).\n\n(5)\nThe singular long-range character appears as the independence of σ irr (z, z′ ;t) on z and z′ as t → ∞ which when performing the Fourier transforms z, z′ → q, q′ and t → ω + iα ,\ntakes the form21\nlim σ irr (q, q′ , ω + iα ) = 2π G2Pδ (q)δ (q′ ),\n\nω →0\n\n(6)\n\nwhere we have formally introduced the 2-point conductance,\nG2P , as the strength of the above mentioned singular character.\nTo extract the strength we introduce a linear functional G σ []\nσ\n\nG [σ ] = lim\nirr\n\nα →0+\n\nZ Z\n\ndqdq′ irr\nσ (q, q′ ; iα ),\n2π\n\n(7)\n\nfor which we simply have G2P = G σ [σ irr ]. It has been shown\npreviously that this identification is correct for noninteracting\nelectrons21. Further motivation to refer to it as a 2-point conductance for interacting systems will be discussed in Section\nV.\nIV.\n\nONSET OF THE CURRENT INSIDE THE\nELECTRODES\n\nThe Eq. (5) can now be analyzed in the light of the above\nobservations. First, let us consider a distant part of one of the\nelectrodes, |z| ≫ 0, for times such that 1/EF ≪ t ≪ |z|/vF ,\nwhere EF and vF are the Fermi energy and Fermi speed respectively. In this regime, the response in the electrodes\n(|z| ≫ 0) is determined by the electrode itself, independently\nof the nanojunction. After a short relaxation time (∼ 1/EF )\nthe auxiliary field establishes a uniform (i.e. z-independent)\ncurrent inside the electrode\nI(z,t) =\n\nZ\n\ndz′\n\nZ t\n\n−∞\n\ndt ′ σ irr,e (z, z′ ;t − t ′)E aux (t ′ ),\n\n(8)\n\nwhere σ irr,e is the irreducible conductivity of the electrode\nonly43 while preserving the local charge neutrality within the\nelectrode. We are free to choose any time-dependence of the\nfield as long as it delivers finite change of momentum for each\nelectron and thus establishes the eventual steady current; the\nmost convenient choice is E aux (t) = −Aaux δ (t), where Aaux is\nthe magnitude of the change in the homogeneous vector potential at t = 0.\nThis picture is not valid as one approaches the region of\nthe nanojunction, i.e. for z ∼ 0. Still, since the current will\nkeep coming from the left electrode and disappearing into the\nright electrode (there is always such |z| ≫ 0 that for any time\nt we have t ≪ |z|/vF and hence the above analysis can be\napplied), the charge will have to pile up in front of the junction\nand similarly deplete behind the junction, creating a resistivity\ndipole25. The incoming current cannot be decreased by some\nform of reflected front/disturbance from the junction since this\nwould break the local charge neutrality within the electrode,\nleading to strong opposing fields. Hence the dipole around\nthe junction and therefore the drop in the induced potential V\nwill grow, increasing the current in the junction region until\nit becomes equal to the current, I, deep inside the electrode,\nas described in the preceding paragraph. This will be possible\nsince in the linear regime we expect I = G4PV .\nHaving in mind this physical process, the established uniform current at long times expressed by Eq. (8) for the distant\nelectrode applies at all positions including z = 0. We express\nthe electrode conductivity σ irr,e in reciprocal space for long\ntimes as\nI(t → ∞) = − lim\n\nZ\n\nα →0+\nσ\nirr,e\n\n= F [σ\n\ndqσ irr,e (q, q′ = 0; iα )Aaux\n]Aaux ,\n\n(9)\n(10)\n\nwhere we use a small imaginary frequency iα to perform the\nlong-time limit27 . The linear functional F σ [] will be further\ndiscussed in Section VII.\n\nV.\n\nTHE 4-POINT FORMULATION OF THE\nCONDUCTANCE\n\nThe above physical picture can be directly used within\nEq. (5). We write the conductivity of the whole system as\nthe conductivity of an infinitely long electrode alone, σ irr,e ,\nplus a further term, σ irr, j , characterizing the presence of the\njunction: σ irr = σ irr,e + σ irr, j . Eq. (5) is thereby cast into the\nform\nI = σ irr,e ⋆ E aux + σ irr, j ⋆ E aux + σ irr ⋆ E i .\n\n(11)\n\nEvaluating this equation at z = 0 and using the definitions of\nthe functionals F σ and G σ , the equation (11) can be written\nas\nI = F σ [σ irr,e ]Aaux + F σ [σ irr, j ]Aaux + G σ [σ irr ]V. (12)\nFrom Eq. (8) we know that in the long-time limit, the first\nterm on the RHS is itself equal to I, so that the second and\n\n\f4\nthird terms sum to zero, from which we easily arrive at the\ncentral result of this paper\nG4P =\n\nF σ [σ irr,e ]\nF σ [σ irr,e ] − F σ [σ irr ]\n\n× G σ [σ irr ],\n\n(13)\n\nwhere we have used theR fact that F σ [σ irr, j ] = F σ [σ irr ] −\nF σ [σ irr,e ] and that V = dzE i (z) = E i (q = 0).\nIt is very instructive to apply the above result for a simple\n1D non-interacting gas with a single scattering center44 . For\nthis system, the noninteracting conductivity in the small frequency limit has a form24\n\nσ 0 (q, q′ ; iα ) =\n\n2 vF α\nδ (q − q′)\nπ v2F q2 + α 2\n2\nvF α\n2 vF α\n(14)\n−R 2 2\n2\n2\nπ vF q + α π vF (q′ )2 + α 2\n\nThe irreducible conductivity of the homogeneous 1D gas, corresponding here to the electrode in the general case is simply\nthe first part of the above expression\n\nσ 0,e (q, q′ ; iα ) =\n\n2 vF α\nδ (q − q′ ).\nπ v2F q2 + α 2\n\n(15)\n\nIt is straightforward to see that using the above forms we\nhave G σ [σ 0 ] = (1 − R)/π = T /π , F σ [σ 0,e ] ∼ vF /πα and\nF σ [σ 0, j ] ∼ RvF /πα , and we arrive at the 4-point conductance G4P = (1/π )(T /R). The arguments of local charge neutrality in the electrodes and its consequences are very closely\nrelated to the original comment by Thouless23 and a more recent work by Kamenev and Kohn24. In the form presented in\nEq. (13) it is valid for nanojunctions of any shape as long as\nwe can put them into a supercell, including the extreme case\nof a planar metal-vacuum-metal junction for which we will\ndemonstrate its applicability in Section VII.\nThe generality of Eq. (13) can be used to show the equivalence of the 2-point and 4-point conductances for nanojunctions with massive electrodes. The demonstration is based\non the observation that for such a geometry F σ [σ irr,e ] ≫\nF σ [σ irr ] and hence the prefactor containing the F []s in\nEq. (13) goes to 1. The mentioned inequality is immediately clear from the following argument: F σ [σ irr,e ] gives the\ncurrent flowing in the electrodes when the vector potential is\nchanged from zero to Aaux , whereas F σ [σ irr ] formally gives\ncurrent as a response to the same disturbance but in a fictitious\nsystem having the same geometry as the real nanojunction but\nfor which the long-range Coulomb interaction is missing. This\nimplies that the local charge neutrality is not enforced (since\nonly the irreducible response enters F σ ) and as a result most\nof the electrons coming from one electrode will be reflected\nfrom the nanojunction and decrease the current. Hence the resulting current will be much smaller in this second case and\nthe inequality is fulfilled. This formally justifies Landauer's\narguments in favor of the expression G = T /π as the conductance of a nanojunction between two phase-randomizing and\nadiabatically widening reservoirs. As we can clearly see, it is\nonly the widening that is really needed to have the conductance of the junction as a whole be given by Eq. (7). This explains our motivation to refer to the latter quantity as a 2-point\n\nconductance even for interacting electronic systems. The argument applies also to opaque barriers, not necessarily having\na constriction, which has been explored in previous works33,34\nand is also demonstrated in Section VII.\n\nVI.\n\nINCLUSION OF EXCHANGE AND CORRELATION\nINTO CONDUCTANCE\n\nHaving established the validity and generality of Eq. (13)\nwe can proceed to approximations that go beyond noninteracting or Hartree-like interacting electrons. The simplest way to do so is within the framework of time-dependent\ndensity-functional theory. Some doubt about the applicability\nof the latter might arise from the dynamics deep in the electrode described in Section IV. There, the induced current is\ndominated by a divergenceless component that cannot be related to a time-dependent density, which is the only physically\nrelevant quantity within the TDDFT. However, at the level of\nFermi-liquid theory, this divergenceless current is identical to\nthat of a non-interacting system due to the backflow of quasiparticles35 . Hence for this part we do not expect corrections\narising from the exchange and correlation and we should expect F σ [σ irr,e ] = F σ [σ 0,e ], where σ 0,e is the non-interacting\nconductivity of the electrode. On the other hand, the response\ndescribed by the rest of Eq. (11), leading to the voltage drop in\nthe induced potential, is essentially localized around the nanojunction and is completely described by the time- and spacedependence of the electronic density which is amenable to the\nTDDFT approach.\nTo cast our theory into the TDDFT framework, we need to\nreformulate the functionals F σ and G σ since the conductivity\nis not directly accessible within TDDFT. The irreducible conductivity is simply related to the irreducible polarization21,28\n\nσ irr (q, q′ , iα ) = −\n\nα irr\nχ (q, q′ ; iα ),\nqq′\n\n(16)\n\nwhich is conveniently calculated via the density response\nfunction calculation within TDDFT. To incorporate this we\nalso introduce new functionals of the irreducible polarization\n\nα irr\nχ (q, q′ ; iα )],\nqq′\nα\nG [χ irr ] = G σ [− ′ χ irr (q, q′ ; iα )].\nqq\n\nF [χ irr ] = F σ [−\n\n(17)\n(18)\n\nfor which we give explicit expressions suitable for direct numerical evaluation in reciprocal and real space representation\nin the Appendix. The irreducible polarization satisfies the\nDyson equation\n\nχ irr (q, q′ ; iα ) = χ 0 (q, q′ ; iα ) +\nZ\n\ndq′′ dq′′′ χ 0 (q, q′′ ; iα ) fxc (q′′ , q′′′ ; iα )χ irr (q′′′ , q′ ; iα ), (19)\n\nwhere χ 0 (q, q′ ; iα ) is the non-interacting Kohn-Sham density response function, and fxc (q′′ , q′′′ ; iα ) is a non-local\nfrequency-dependent exchange-correlation kernel36. The\n\n\f5\nabove two equations give the 4-point conductance of an interacting electronic system: for a given kernel fxc one needs\nto invert the Dyson equation (19), substitute the result into\nEq. (16) and employ the general expression Eq. (13).\nHowever, we can gain more insight by multiplying Eq. (19)\nby −α /(qq′ ) and taking the limit α → 0. Clearly, the resulting left-hand-side is singular in q, with the strength being G2P according to Eq. (6). The strength of the first term\non the right-hand-side of (19) multiplied by the same factor\ngives the 2-point conductance of the non-interacting KohnSham system, G2P,0 . The difference between these the two,\ni.e. the correction due to the exchange-correlation kernel,\nis then nonzero only if the last term in Eq. (19) also leads\nto a singular form. This observation can be used to deduce the forms of the kernel that do influence the conductance, since the general character of χ for small α is well\nknown. The most interesting choice, making use of the charα\n′\nacter of χ 0/ir ∼ qq′ , is fxc (q, q′ ; iα ) = qq\n′ A(q, q ; iα ) where A\nis well-behaved: A(q, q′ ; iα ) → Rdyn = A(q = 0, q′ = 0) 6= 0\nfor α → 0. The resulting 4-point conductance then takes the\nform\nG4P =\n\nF [χ 0,h ]\n(1 + G [χ 0 ]Rdyn )F [χ 0,h ] − F [χ 0]\n\nG [χ 0 ]. (20)\n\nIn the case of a narrow junction between massive electrodes\nand using the arguments leading to Eq. (13), we obtain\nG4P ≈\n\nG [χ 0 ]\nG0\n.\n=\n0\ndyn\n1 + G [χ ]R\n1 + RdynG0\n\n(21)\n\ni.e. in this very important case Rdyn represents part of the\ndynamical resistance, having origin in exchange-correlation\neffects and can be accounted for by adding this resistance in\nseries with the Kohn-Sham result.\nAn approximate correction of this form has, in fact, been\nidentified by Na Sai et al.3 for interacting electronic systems\nwith weakly inhomogeneous potential along the direction of\nthe current flow. For such systems it is possible to show that a\npurely longitudinal exchange-correlation electric field used in\ntheir treatment within TDCDFT11,36 is equivalent to a contribution to the TDDFT kernel of the asymptotic form for small\nq, q′\n(η )\n\nfxc (q, q′ ; ω ) ≈ −\n\niω\nA\nqq′\n\nZ\n\ndz\n\n4η\n3\n\n\u0012\n\n∂z n(z)\nn(z)2\n\n\u00132\n\n=−\n\niω 2 dyn\nA R (22)\nqq′\n\nwhere A is the cross-sectional area of the considered system,\nn(z) is the electronic density and η is the dynamical viscosity of a homogeneous electron gas11 . We should note that\nfor homogeneous systems Rdyn = 0 since ∂z n(z) = 0. This\n(η )\nis important since the functional form fxc given above and\nthe limiting process would not lead to a finite result for a homogeneous system. It is interesting to note that the nonlocal\ncharacter of the kernel, i.e. f xc ∼ 1/q2 has been found also responsible for significant improvement in the ab-initio studies\nof the optical spectra in many materials37,38 .\n\nA very popular approximation for the exchange-correlation\nkernel is the adiabatic local-density approximation (ALDA)39\n(ALDA)\n\nfxc\n\nALDA 0\n(r, r′ ) = fxc\n[n (r)]δ (r − r′ )\n\n(23)\n\nd (n εxc (n ))/dn ,\n\n(24)\n\nALDA 0\nfxc\n[n ] =\n\n2\n\n0\n\n0\n\n2\n\n(Here εxc (n0 ) is the exchange-correlation energy per particle of a homogeneous electron gas (HEG) of density\nn0 ), leading to a kernel in the reciprocal space of the\n(ALDA)\n(ALDA)\nform fxc\n(q, q′ ; ω ) = fxc\n(q − q′ ; ω ) → B(ω )δ (q −\n′\nq ), B(ω ) → B 6= 0 for ω → 0. It has been argued by several authors that ALDA should not contribute to any change\nin the conductance.3,6 The basis of this argument comes from\nthe fact that one can account for the exchange and correlation effects either via the exchange correlation kernel, or by\nusing the exchange-correlation electric field. The latter can\nbe shown to contribute to the conductance only if there is a\nnonzero drop of the exchange-correlation potential across the\nsystem, which is absent within any local or semi-local approximations. The argument is valid also within our theory when\napplied to Eq. (11). However, it is interesting to explore the\nconsequences if one stays within the kernel-based treatment.\nHere the proper definition of the 4-point conductance is essential. If one directly uses the 2-point formula in Eq. (7) for\nmetal-vacuum-metal interfaces, one finds nontrivial ALDA\ncorrections solely due to the fact that the Kohn-Sham conductivity does redistribute the charge at long distances when a localized Kohn-Sham potential with nonzero drop is applied22.\nThe numerical results for metal-vacuum-metal presented in\nSection VII show a cancellation between these ALDA corrections within G [χ irr ] and those entering F [χ irr ] within the precision of the numerics so that the G4P coming from Eq. (13)\nremains unaffected by the ALDA kernel, as it should be. It is\nimportant to emphasize this point because studies of exchange\nand correlation effects using the 2-point formula only for 1D\natomic chains20 or quantum wires19 may easily lead to incorrect conclusions.\n\nVII. CONDUCTANCE OF A METAL-VACUUM-METAL\nINTERFACE\n\nThe metal-vacuum-metal junction is one of the simplest\nsystems for ab-initio study of electronic transport and hence it\nconveniently serves as a demonstration that the formula (13)\ncan be numerically implemented even for realistic systems.\nIn practical implementations we cannot work with an infinite\nsystem, for which the response function that enters the functionals F [ ] and G [ ] is needed. Instead, we take a finite system with z ∈ (−L, L) with zero boundary conditions at the end\npoints. This brings certain restriction on the zero-frequency\nextrapolation that we will discuss below. The two perpendicular directions can be dealt with easily in the reciprocal space\nfor this particular system.\nIn our calculations we employ two jellium slabs of thickness l and density given by rs = 3.0 a.u., separated by a distance d, i.e. 2l + d < 2L where the supercell extends from −L\n\n\f10\n\n30\n\n8\n\n29\n28\n\n6\n\n27\n4\n\n26\n\n2\n0\n\nl (a.u.)\n\nG2P × 105 (a.u.)\n\n6\n\n.\n\n25\n0\n\n0.05\nl\nl\nl\nl\n\n0.1\nα (a.u.)\n\n0.15\n\n24\n0.2\nl = 27.2\nExact\nαmin (l)\n\n= 24.0\n= 24.8\n= 25.6\n= 26.4\n\nFIG. 2: (Color-online) Dependence of G2P (α ) = Gα [ χ 0 ] on frequency α for several electrode widths l (vacuum is fixed for d =\n8 a.u.). For frequencies below the thick line, given by αmin (l) = vF /l,\nthe finite size effects appear, so that α ∼ 0.05 are used for extrapolation to zero. The vertical shifts of the individual curves is caused by\nthe oscillation of the Fermi energy (see also Fig. 3).\n\nto L. The calculation of χ 0 (z, z′ ; iα ) is performed at the selfconsistent LDA level40. Subsequently for the ALDA calculation we invert the Dyson equation, Eq. (4), in real space and\nthereby calculate the irreducible response χ irr (z, z′ ; iα ). The\ninclusion of the non-local kernel, such as that arising from\nthe viscosity of the electron liquid, can be done directly via\nEq. (20), avoiding the inversion of the Dyson equation. For\nthe evaluation of F [ ] and G [ ] we employ their real space\nform (Appendix), integrating over the simulation cell,\nGα [χ irr ] = α\nFα [χ irr ] = α\n\nZ 0 Z L\n\ndzdz′ χ irr (z, z′ ; iα ),\n\n−L 0\nZ L\nZ 0\n\ndz\n\n−L\n\n−L\n\ndz′ χ irr (z, z′ )z′ ,\n\n(25)\n(26)\n\nkeeping α finite for the moment. For extrapolation we need\nto use imaginary frequencies α ≪ EF so that the transient dynamics is removed from the response function. On the other\nhand, the finite extent of the electrodes restricts the limiting\nprocedure for α → 0; one can go down no more than to imaginary frequencies αmin ≈ vF /l (vF ≈ 0.64 a.u. for rs = 3 a.u.).\nTo demonstrate the precision and scaling of our calculation\nwe first present calculations for a non-selfconsistent squarebarrier potential (width 8 a.u., height 0.25 a.u.) between\ntwo 3D electrodes (EF = 0.2 a.u.). The chosen values are\nreasonably close to our self-consistent potential but at the\nsame time allow for comparison of with the exact value of\nG2P = limα →0 Gα [χ 0 ] using the analytically known form of\nthe transmission probability. The calculated values of Gα [χ 0 ]\nshown in the Fig. 2 for finite slabs and finite frequencies\nclearly show finite size effects below αmin . However, even for\nfrequencies larger than αmin we observe a remanent horizontal\noscillatory dependence of the conductance curves on the electrodes' width. Even though the amplitude of the oscillations\nfor smaller widths are substantial, the overall convergence to\nthe exact value is evident. The oscillatory character of the\nFermi energy can be effectively used for identifying the most\nsuitable system widths for an optimal estimate of the infinite\n\nFIG. 3: (Color-online) Dependence of the extrapolated G2P on the\nelectrodes' widths l for d = 8.0 a.u for a square-barrier potential.\nThe inset shows the oscillations in the Fermi energy and the conductance G2P in a restricted range of l for a self-consistent calculation.\nChoosing widths for which the Fermi energy attains its minima (indicated with dots) leads to a stable estimate of the conductance of the\ninfinite system.\n\nsystem conductance. One should choose the widths for which\nthe Fermi energy attains local minima (inset in Fig. 3), which\nis the method we use within our work.\nSimilar extrapolation to zero frequency can be done for\nF [ ], or even better for α × F [ ] which approaches a constant\nvalue for an infinite system. However, since our aim is to calculate the 4-point conductances, we directly extrapolate the\nexpression (20) which behaves very similarly as the G2P (α )\ndescribed in detail in the preceding paragraph.\nWe now apply our methodology to a fully self-consistent\ncalculation for a sequence of vacuum widths d = 1, . . . , 10 a.u.\nto study the effect of the recently suggested viscosity-related\nexchange-correlation correction due to Na Sai et al.3 , and to\nexplore the cancellation of ALDA corrections between F [ ]\nand G [ ]. The overall dependence of the conductance on d\nis exponential. For clarity of presentation we show first the\nexponentially decreasing form of the calculated Kohn-Sham\nconductance, G4P\n0 , in the upper panel of Fig. 4; the small symbols indicate error bars in G4P\n0 due to uncertainty in the extrapolation to zero frequency. For this system the absolute values\nof the corrected conductances after inclusion of either TDDFT\nkernel – ALDA kernel or viscosity kernel – lie within these\nindicated error bars. As we have discussed in Section VI, the\nALDA does not lead to any correction, but numerically this result is not trivial. In fact both, the G [χ ALDA ] and F [χ ALDA ] do\nchange due to the presence of the exchange-correlation kernel\n(24), but these changes are canceled in the total expression for\nthe 4-point conductance (13) within the numerical precision\nof the extrapolation to zero frequency. On the other hand, the\ncorrections due to the finite viscosity of the electron liquid do\nlead to a small but systematic decrease in the conductance,\nwhich is about 5% in the examined range of relative conductances3,4 . While this is smaller than the error bar of the extrapolated conductance, since the viscosity correction itself does\nnot involve extrapolation (Eq. 24), the resulting error bar of\nthe relative correction, shown in the lower panel of Fig. 4, is\nnoticeably smaller than the correction itself, and thus the cor-\n\n\f7\n10−1\nG (a.u.)\n\n10\n\ndauer formula for broadening or opaque nanojunctions. Furthermore, we have utilized our formulation for examining the\nexchange and correlation effects on the conductance within\nthe time-dependent density functional theory. We have shown\nthat the long time limit determines the functional form of the\nexchange-correlation kernel that can lead to nonzero corrections. The exposed theory can be also used for ab-initio calculations for which the achievable precision in conductance\ncalculation for a given size of a finite-size simulation cell has\nbeen demonstrated on a simple metal-vacuum-metal junction.\n\nG4P\n0\n\n−2\n\n10−3\nrs = 3.0\n\n10−4\n10−5\n1\n\n4P\nG4P\nη /G0\n\nG4P /G4P\n0\n\n0.99\n0.98\n0.97\n0.96\n\nAcknowledgments\n\n0.95\n0.94\n\n1\n\n2\n\n3\n\n4\n\n5 6\nd (a.u.)\n\n7\n\n8\n\n9\n\n10\n\n(G4P − G2P )/G4P\n\nFIG. 4: (Color-online) The Kohn-Sham conductance G4P\n0 with error\nbars resulting from uncertainty in the extrapolation to zero frequency\n(upper panel) and the viscosity-corrected conductance Gη4P (shown\nrelative to G4P\n0 ) (lower panel), as a function of the vacuum width d.\nOnly the corrections due to the non-local kernel lead to changes in\nthe conductance. The ALDA kernel does not affect the Kohn-Sham\nresult within numerical error.\n\n1\n0.8\n0.6\n0.4\n0.2\n0\n-0.2\n\nThis research was supported by the Slovak grant agency\nVEGA (project No. 1/2020/05), the NATO Security Through\nScience Programme (EAP.RIG.981521) and the EU's 6th\nFramework Programme through the NANOQUANTA Network of Excellence (NMP4-CT-2004-500198).\n\nIX. APPENDIX: EVALUATION OF FUNCTIONALS F\nAND G .\n\nThe functionals F [ ] and G [ ] were given explicitly in the\nFourier-transformed form in Eqs. (9), (10) and Eq. (7) respectively. In numerical calculations it is more advantageous and\nnumerically stable to use their representation in real space. To\nachieve this, we use the inverse transform of the irreducible\ndensity response function defined by\n0\n\n2\n\n4\n6\nd (a.u.)\n\n8\n\n10\n\nFIG. 5: (Color-online) The relative difference between the 4-point\nand 2-point Kohn-Sham conductances. The difference between the\ntwo diminishes for opaque barriers.\n\nχ (q, q′ ) =\n\nZ\n\nIn conclusion, we have presented a unified formalism,\nbased on singular character of response functions, that gives\nthe conductance of a general system of interacting electrons.\nWe have derived a closed formula for the 4-point conductance\nin terms of the many-body response functions: the irreducible\nconductivity or the irreducible density response. The formulation allows for clear demonstration of the validity of the Lan-\n\nZ\n\ndq iqz0\ne χ (q, q′ ).\nq\n\n(28)\n\nSince χ (q, .) ∼ q for small q, the integral is well defined and\nwe can choose to interpret the apparent singularity 1/q as\n1/(q + iδ ) or 1/(q − iδ ) with δ → 0+ . Taking the former\n(the final result is independent of this choice) and using the\ninverse transform (27) we find\nf (z0 ) = −i\n\nVIII. CONCLUSION\n\n(27)\n\nSeveral times we will have to resolve the integral of the type\nf (z0 ) =\n\nrection is significant.\nFinally we numerically demonstrate the appropriateness of\nthe 2-point conductance, G2P = G [χ ] for opaque barriers. The\ngraph in Fig. 5 clearly shows that for d > 4 the F [ ]-dependent\nprefactor is very close to 1, which supports our arguments in\nSec. V as well as is in agreement with previous numerical\nwork33\n\ndzdz′ −iqz\n′ ′\ne\nχ (z, z′ )eiq z .\n2π\n\nZ\n\n′ ′\n\ndzdz′ θ (z0 − z)χ (z, z′ )eiq z ,\n\n(29)\n\nwhere θ (z) is the unit step function.\nUsing the definition of G [ ] and using the integral (29) twice\nwith z0 = 0 we readily obtain\nG [χ ] = lim α\nα →0+\n\nZ 0\n\n−∞\n\ndz\n\nZ ∞\n0\n\ndz′ χ (z, z′ ; iα ).\n\n(30)\n\nThe real-space form of the F is obtained using again the\n\n\f8\n′ ′\n\nsince we can Taylor expand e−iq z with the linear term giving\nthe only nonzero contribution.\n\nFourier transform:\nF [χ ] = α\n\nZ\n\n= −iα\n= α\n\n∗\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n13\n14\n\n15\n16\n17\n18\n19\n20\n21\n22\n23\n24\n25\n26\n\ndq\nqq′\nZ ∞\n\nZ 0\n\n−∞\n\n0\n\ndz\n\nZ\n\n′ ′\ndzdz′ −iqz\ne\nχ (z, z′ )eiq z\n2π\n\nZ ∞\n\n′ ′\n\neiq z\ndz χ (z, z ) ′\ndz\nq\n−∞\nZ ∞\n\n−∞\n\n(31)\nq′ =0\n\n′\n\n′\n\ndz′ χ (z, z′ )z′\n\n(32)\nq′ =0\n\n(33)\n\nElectronic address: peter.bokes@stuba.sk\nJ. Taylor, M. M. Brandbyge, and K. Stokbro, Phys. Rev. Lett. 89,\n138301 (2002).\nH. Basch, R. Cohen, and M. A. Ratner, Nano Lett. 5, 1668 (2005).\nN. Sai, M. Zwolak, G. Vignale, and M. DiVentra, Phys. Rev. Lett.\n94, 186810 (2005).\nJ. Jung, P. Bokes, and R. W. Godby, Phys. Rev. Lett. 98, 259701\n(2007).\nC. Toher, A. Filippetti, S. Sanvito, and K. Burke, Phys. Rev. Lett.\n95, 146402 (2005).\nM. Koentopp, K. Burke, and F. Evers, Phys. Rev. B 73, 121403(R)\n(2006).\nJ. J. Palacios, Phys. Rev. B 72, 125424 (2005).\nG. Stefanucci and C. O. Almbladh, Phys. Rev. B 69, 195318\n(2004).\nM. DiVentra and T. N. Todorov, J. Phys.: Condens. Matter 16,\n8025 (2004).\nM. Koentopp, C. Chang, K. Burke, and R. Car,\ncond-mat/0703591v1 (2007).\nG. Vignale, C. A. Ullrich, and S. Conti, Phys. Rev. Lett. 79, 4878\n(1997).\nP. Delaney and J. C. Greer, Phys. Rev. Lett. 93, 036805 (2004).\nG. Fagas, P. Delaney, and J. C. Greer, Phys. Rev. B 73, 241314(R)\n(2006).\nA. Ferretti, A. Calzolari, R. DiFelice, F. Manghi, M. J. Caldas,\nM. B. Nardelli, and E. Molinari, Phys. Rev. Lett. 94, 116802\n(2005).\nP. Darancet, A. Ferretti, D. Mayou, and V. Olevano, Phys. Rev. B\n75, 075102 (2007).\nK. Thygesen and A. Rubio, J. Chem. Phys. 126, 091101 (2007).\nY. Meir and N. S. Wingreen, Phys. Rev. Lett. 68, 2512 (1992).\nR. E. Prange, Phys. Rev. 131, 1083 (1963).\nF. Malet, M. Pi, M. Barranco, and E. Lipparini, Phys. Rev. B 72,\n205326 (2005).\nE. Prodan and R. Car, cond-mat/0702192 (2007).\nP. Bokes and R. W. Godby, Phys. Rev. B 69, 245420 (2004).\nP. Bokes, J. Jung, and R. W. Godby, cond-mat/0604317 (2006).\nD. J. Thouless, Phys. Rev. Lett. 47, 972 (1981).\nA. Kamenev and W. Kohn, Phys. Rev. B 63, 155304 (2001).\nR. Landauer, Z. Phys. B: Condens. Matter 68, 217 (1987).\nR. Gebauer and R. Car, Phys. Rev. Lett. 93, 160404 (2004).\n\n27\n28\n29\n30\n31\n32\n33\n34\n35\n36\n37\n38\n39\n40\n41\n42\n\n43\n\n44\n\nR. Kubo, in Lectures in Theoretical Physics, Vol. 1, edited by W.\nE.cBrittin and L. G. Dunham (Interscience, New York, 1959).\nD. Pines and P. Nozieres, The Theory of Quantum Liquids (W. A.\nBenjamin, Inc., New York, 1966).\nG. F. Giuliani and G. Vignale, Quantum Theory of the Electron\nLiquid (Cambridge University Press, Cambridge, 2005).\nG. Mahan, Many-Particle Physics (Kluwer Academic/Plenum\nPublishers, New York, 2000).\nR. Landauer, in Analogies in Optics and Micro Electronics, edited\nby W. van Haeringen and D. Lenstra (Kluwer, Dordrecht, 1990).\nF. Sols, Phys. Rev. Lett. 67, 2874 (1991).\nH. Mera, P. Bokes, and R. W. Godby, Phys. Rev. B 72, 085311\n(2005).\nK. Carva and I. Turek, Czech. J. of Physics 54, D257 (2004).\nP. Nozieres, Theory of interacting Fermi systems (W. A. Benjamin, Inc., New York, 1964).\nG. Vignale and W. Kohn, Phys. Rev. Lett. 77, 2037 (1996).\nS. Botti, A. Fourreau, F. Nguyen, Y.-O. Renault, F. Sottile, and L.\nReining, Phys. Rev. B 72, 125203 (2005).\nL. Reining, V. Olevano, A. Rubio, and G. Onida, Phys. Rev. Lett.\n88, 66404 (2002).\nE. K. U. Gross and W. Kohn, Phys. Rev. Lett. 55, 2850 (1985).\nJ. Jung, P. Garcia-Gonzalez, J. F. Dobson, and R. W. Godby, Phys.\nRev. B 70, 205107 (2004).\nN. Sai, N. Bushong, R. Hatcher, and M. DiVentra, Phys. Rev. B\n75, 115410 (2007).\nRecently, clear signatures of the resistivity dipoles were found in\ntime-dependent simulations when starting from a charged initial\nstate41 .\nFor simplicity of presentation we assume that the induced field\ninside the electrode is absent, as is exactly true for jellium electrodes, used later in Sec. VII. Generalization for an electrode with\natomic structure is straightforward: The induced field ~\nE i is split\ni,e\n~\ninto the local field induced inside the electrode, E (which has\nan average value zero over the electrode's unit cell), and the difference ~E i, j = ~E i − ~E i,e . The latter then defines the potential drop\naccording to Eq. 3 and the former needs to be included into the\nresponse entering the functional F σ [σ̃ ] where σ̃ = σ ⋆ (1 + χ e )\nwith χ e = δ E i,e /δ E aux .\nFrom here on we use the atomic units with h̄ = me = e = 1.\n\n\f"}