{"id": "http://arxiv.org/abs/1004.0568v1", "guidislink": true, "updated": "2010-04-05T06:18:26Z", "updated_parsed": [2010, 4, 5, 6, 18, 26, 0, 95, 0], "published": "2010-04-05T06:18:26Z", "published_parsed": [2010, 4, 5, 6, 18, 26, 0, 95, 0], "title": "Hysteresis in the magneto-transport of Manganese-doped Germanium:\n  evidence for carrier-mediated ferromagnetism", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1004.4831%2C1004.3008%2C1004.5396%2C1004.5584%2C1004.3883%2C1004.2275%2C1004.4577%2C1004.0711%2C1004.3985%2C1004.4113%2C1004.4144%2C1004.3973%2C1004.3374%2C1004.2822%2C1004.2056%2C1004.2916%2C1004.1553%2C1004.2153%2C1004.0708%2C1004.0277%2C1004.0055%2C1004.0245%2C1004.3899%2C1004.0357%2C1004.1002%2C1004.2134%2C1004.3117%2C1004.0349%2C1004.1855%2C1004.3254%2C1004.3216%2C1004.4827%2C1004.4315%2C1004.5484%2C1004.1718%2C1004.0851%2C1004.3611%2C1004.2532%2C1004.0160%2C1004.4772%2C1004.5537%2C1004.0261%2C1004.1941%2C1004.3844%2C1004.1676%2C1004.1666%2C1004.4885%2C1004.1334%2C1004.0236%2C1004.1017%2C1004.2242%2C1004.2699%2C1004.0568%2C1004.4090%2C1004.3897%2C1004.3749%2C1004.5486%2C1004.1561%2C1004.0781%2C1004.1369%2C1004.1524%2C1004.4514%2C1004.2378%2C1004.4057%2C1004.4376%2C1004.2368%2C1004.2961%2C1004.3316%2C1004.3378%2C1004.3868%2C1004.4975%2C1004.3869%2C1004.1392%2C1004.1560%2C1004.0348%2C1004.0962%2C1004.0045%2C1004.0743%2C1004.4379%2C1004.4262%2C1004.3337%2C1004.5373%2C1004.3946%2C1004.4819%2C1004.1819%2C1004.3525%2C1004.3383%2C1004.1976%2C1004.4351%2C1004.1583%2C1004.4704%2C1004.4082%2C1004.0112%2C1004.1721%2C1004.1260%2C1004.4333%2C1004.3229%2C1004.3102%2C1004.3741%2C1004.2626%2C1004.4227&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Hysteresis in the magneto-transport of Manganese-doped Germanium:\n  evidence for carrier-mediated ferromagnetism"}, "summary": "We report the fabrication of Ge:Mn ferromagnetic semiconductors by Mn-ion\nimplantation into Ge followed by pulsed laser annealing. Benefiting from the\nshort time annealing, the hole concentration in Mn-implanted Ge has been\nincreased by two orders of magnitude from 10$^{18}$ to over 10$^{20}$\ncm$^{-3}$. Likely due to the high hole concentration, we observe that the\nlongitudinal and Hall resistances exhibit the same hysteresis as the\nmagnetization, which is usually considered as a sign of carrier-mediated\nferromagnetism.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1004.4831%2C1004.3008%2C1004.5396%2C1004.5584%2C1004.3883%2C1004.2275%2C1004.4577%2C1004.0711%2C1004.3985%2C1004.4113%2C1004.4144%2C1004.3973%2C1004.3374%2C1004.2822%2C1004.2056%2C1004.2916%2C1004.1553%2C1004.2153%2C1004.0708%2C1004.0277%2C1004.0055%2C1004.0245%2C1004.3899%2C1004.0357%2C1004.1002%2C1004.2134%2C1004.3117%2C1004.0349%2C1004.1855%2C1004.3254%2C1004.3216%2C1004.4827%2C1004.4315%2C1004.5484%2C1004.1718%2C1004.0851%2C1004.3611%2C1004.2532%2C1004.0160%2C1004.4772%2C1004.5537%2C1004.0261%2C1004.1941%2C1004.3844%2C1004.1676%2C1004.1666%2C1004.4885%2C1004.1334%2C1004.0236%2C1004.1017%2C1004.2242%2C1004.2699%2C1004.0568%2C1004.4090%2C1004.3897%2C1004.3749%2C1004.5486%2C1004.1561%2C1004.0781%2C1004.1369%2C1004.1524%2C1004.4514%2C1004.2378%2C1004.4057%2C1004.4376%2C1004.2368%2C1004.2961%2C1004.3316%2C1004.3378%2C1004.3868%2C1004.4975%2C1004.3869%2C1004.1392%2C1004.1560%2C1004.0348%2C1004.0962%2C1004.0045%2C1004.0743%2C1004.4379%2C1004.4262%2C1004.3337%2C1004.5373%2C1004.3946%2C1004.4819%2C1004.1819%2C1004.3525%2C1004.3383%2C1004.1976%2C1004.4351%2C1004.1583%2C1004.4704%2C1004.4082%2C1004.0112%2C1004.1721%2C1004.1260%2C1004.4333%2C1004.3229%2C1004.3102%2C1004.3741%2C1004.2626%2C1004.4227&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We report the fabrication of Ge:Mn ferromagnetic semiconductors by Mn-ion\nimplantation into Ge followed by pulsed laser annealing. Benefiting from the\nshort time annealing, the hole concentration in Mn-implanted Ge has been\nincreased by two orders of magnitude from 10$^{18}$ to over 10$^{20}$\ncm$^{-3}$. Likely due to the high hole concentration, we observe that the\nlongitudinal and Hall resistances exhibit the same hysteresis as the\nmagnetization, which is usually considered as a sign of carrier-mediated\nferromagnetism."}, "authors": ["Shengqiang Zhou", "Danilo Buerger", "Arndt Muecklich", "Christine Baumgart", "Wolfgang Skorupa", "Carsten Timm", "Peter Oesterlin", "Manfred Helm", "Heidemarie Schmidt"], "author_detail": {"name": "Heidemarie Schmidt"}, "author": "Heidemarie Schmidt", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevB.81.165204", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1004.0568v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1004.0568v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "14 pages, 7 figures, to be published at Phys. Rev. B (2010)", "arxiv_primary_category": {"term": "cond-mat.mtrl-sci", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.mtrl-sci", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1004.0568v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1004.0568v1", "journal_reference": "Phys. Rev. B 81, 165204 (2010)", "doi": "10.1103/PhysRevB.81.165204", "fulltext": "Hysteresis in the magneto-transport of Manganese-doped\nGermanium: evidence for carrier-mediated ferromagnetism\n\narXiv:1004.0568v1 [cond-mat.mtrl-sci] 5 Apr 2010\n\nShengqiang Zhou (周生强),1, ∗ Danilo Bürger,1 Arndt Mücklich,1\nChristine Baumgart,1 Wolfgang Skorupa,1 Carsten Timm,2\nPeter Oesterlin,3 Manfred Helm,1 and Heidemarie Schmidt1\n1\n\nInstitute of Ion Beam Physics and Materials Research, Forschungszentrum\nDresden-Rossendorf, P.O. Box 510119, 01314 Dresden, Germany\n\n2\n\nInstitut für Theoretische Physik, Technische Universität Dresden, 01062 Dresden, Germany\n3\n\nINNOVAVENT GmbH, Bertha-von-Suttner-Str. 5, 37085 Göttingen, Germany\n(Dated: November 21, 2018)\n\nAbstract\nWe report the fabrication of Ge:Mn ferromagnetic semiconductors by Mn-ion implantation into\nGe followed by pulsed laser annealing. Benefiting from the short time annealing, the hole concentration in Mn-implanted Ge has been increased by two orders of magnitude from 1018 to over\n1020 cm−3 . Likely due to the high hole concentration, we observe that the longitudinal and Hall\nresistances exhibit the same hysteresis as the magnetization, which is usually considered as a sign\nof carrier-mediated ferromagnetism.\n\n∗\n\nElectronic address: S.Zhou@fzd.de\n\n1\n\n\fI.\n\nINTRODUCTION\n\nDiluted ferromagnetic semiconductors (FMS) are considered to be promising materials\nfor spintronic applications. FMS exhibit strong magneto-transport effects, namely negative\nmagnetoresistance (MR) and the anomalous Hall effect (AHE).[1, 2] GaAs:Mn has been intensively investigated during the last 20 years and is considered as the prototype FMS. Practically, it is desirable to have a FMS compatible with silicon technology. Manganese-doped\ngermanium prepared using low-temperature molecular-beam epitaxy (LT-MBE) proves to\nbe most promising due to the effective suppression of precipitate formation.[3–6] Two conclusions have been well established: (i) Mn segregation is unavoidable even at growth temperatures below 70 ◦ C.[3–7] (ii) Mn-rich precipitates, mainly Mn5 Ge3 and Mn11 Ge8 , form\ninside the Mn-diluted Ge matrix when the growth temperature is higher than 70 ◦ C [8, 9] or\nduring ion implantation at elevated temperatures [10]. On the other hand, various experiments evidence that diluted Mn ions are in the 2+ state [11–13] and act as double acceptors\nin Ge. A substitutional occupation of Fe, Cu, and Ag in Ge was confirmed recently. [14]\nThus, Mn-rich regions are embedded inside the Ge matrix together with substitutional Mn\nions. The appearance of Mn-rich regions can be demonstrated by transmission electron\nmicroscopy and by zero-field-cooling/field-cooling (ZFC/FC) magnetization measurements.\n[4, 5, 8]\nWe notice that pronounced MR and AHE in the Ge:Mn system have been reported.[3,\n4, 6, 15–17] However, there are fundamental open questions. First of all, the correlation\nbetween magnetization, MR, and AHE, which is a hallmark of the GaAs:Mn FMS,[1, 2]\nhas not been proven for Ge:Mn so far. For isotropic and anisotropic magnetic samples the\nMR and AHE curves measured in van der Pauw geometry always reflect the field dependence of magnetization perpendicular to the sample surface. For example, GaAs:Mn grown\non GaAs(001) has its hard axis of magnetization perpendicular to the sample surface. As\nexpected the corresponding AHE curve does also not show an open hysteresis loop and is perfectly correlated with the hard axis magnetization perpendicular to the sample surface.[18]\nThe reported MR and AHE in Ge:Mn are likely caused by superparamagnetic Mn ions or\nprecipitates [19] or by a two-band-like conduction.[20] Note that only paramagnetic coupling\nbetween Mn impurities in Ge:Mn was revealed by X-ray magnetic circular dichroism [13].\nSecondly, measurements of the resistivity versus temperature often reveal a small activation\n2\n\n\fenergy of several meV at low temperatures, [3, 15, 19, 21] which is much smaller than the\nthermal ionization energy of Mn in Ge. [22] Thirdly, the AHE curves measured above 10 K\nusually reveal a reversal in slope. [4, 15, 16, 23] On the other hand, below 10 K the AHE\nhas been reported to be absent. [19]\nWe believe that the origin of these puzzling observations lies in the less effective substitution of Mn at Ge sites, which results in too low a hole concentration, making carrier-mediated\nferromagnetism impossible. In previous work, the ferromagnetism in Ge:Mn has been nonquantitatively but plausibly explained by the formation of bound magnetic polarons (BMP).\n[3, 5, 8, 23] According to the model of Kaminski and Das Sarma [24] for GaAs:Mn with 8.5%\nMn (Ref. 25) the critical hole concentration for percolation at 10 K amounts to 3×1019 cm−3 .\nThe hole concentrations realized in Ge:Mn grown by LT-MBE [3, 4, 6, 15, 21, 26] are mostly\nwell below the threshold value of 3×1019 cm−3 , which indicates the possible unsuitability of\nthe LT-MBE approach to achieve a large hole concentration in Ge:Mn.\nIn this article we show that the hole concentration in Mn-implanted Ge can be strongly\nincreased by short-time annealing.\n\nThe largest hole concentration achieved is around\n\n2.1 × 1020 cm−3 in samples after pulsed laser annealing (PLA), showing negative MR and\nAHE with the same hysteresis as the magnetization at low temperatures.\n\nII.\n\nEXPERIMENTAL\n\nNearly intrinsic, n-type Ge(001) wafers were implanted with Mn ions. The implantation\nenergy and fluence were 100 keV, 30 keV and 5×1016 cm−2 , 1×1016 cm−2 , respectively,\nresulting in a box-like distribution of Mn ions with concentration around 10 % over a depth\nof 100 nm. During implantation the wafers were flow-cooled with liquid nitrogen to avoid\nthe formation of any Mn-rich secondary phase. Pulsed laser annealing was performed using\na laser ASAMA 80-8 and an optical system VOLCANO from INNOVAVENT GmbH. The\npulse duration was 300 ns at a wavelength of 515 nm. The introduced energy density was 1.5\nJ/cm2 . During annealing, the sample surface was scanned by a laser beam which was focused\nto a 2 mm×40 μm large stripe with a frequency of 50 kHz, instead of a large, symmetric\nlaser spot of 5×5 mm2 used for GaAs:Mn. [27, 28] Structural analysis were performed\nusing secondary ion mass spectrometry (SIMS) and transmission electron microscopy (TEM,\nFEI Titan). Magnetization properties were investigated with a superconducting quantum\n3\n\n\fDepth profile of\nMn concentration\n\nglue\n\nA\n\n50 nm\n\nB\n\n100 nm\n\n50 nm\n\nFIG. 1: Cross-sectional TEM image recorded on PLA annealed Mn-implanted Ge. The image\nreveals Mn-rich tadpole-like regions, labeled A and B. Relative compositions of region A and B are\ngiven in units of atomic percent in the corresponding EDS spectra (see inset). The vertical scale\nbar indicates the distance from the sample surface. The depth of the implanted and molten layer\namounts to ca. 100 nm. There is no structural change between the implanted/unimplanted layers\nafter PLA. The depth profile of the Mn concentration obtained by SIMS is shown as the red curve.\n\ninterference device (SQUID, Quantum Design MPMS) magnetometer. Magneto-transport\nwas measured with a magnetic field applied perpendicularly to the film plane in van der\nPauw geometry.\n\nIII.\nA.\n\nRESULTS AND DISCUSSION\nStructural properties\n\nFig. 1 shows the cross-sectional TEM image. In a ca. 60 nm thick top layer there are\nsome tadpole-like regions with a size of 10–20 nm. Relative composition measurements by\nmeans of energy dispersive spectroscopy (EDS) reveal that those tadpole-like regions are\nMn-rich (inset of Fig. 1). For instance, there are around 19 at.% and 26 at.% Mn in region\nA and B, respectively. This large Mn concentration does not correspond to any known Ge-\n\n4\n\n\fFIG. 2: The field dependent (a) magnetization (M ), (b) Hall resistance (R xy ) and (c) longitudinal\nresistance (R xx ) at 5 K. Hysteresis appears for both R xx and R xy curves, with the same coercivity\nas for M. The longitudinal resistivity is around 0.015 Ω-cm if assuming a thickness of 100 nm.\n\nMn phase [4]. On the other hand, the Mn-rich regions in the top layer are not percolating.\nUsing high-resolution TEM, we found that the areas between the Mn-rich structures and\nthe regions in the depth of 60–100 nm are coherent with the single crystalline Ge matrix.\nUsing SIMS (shown as the read curve along the depth scale in Fig. 1), we observed an\naccumulation of Mn in the ca. 40 nm thick top layer after PLA. In the depth between 50–\n100 nm, Mn ions are uniformly distributed. We do not have an accurate absolute calibration,\nbut the measurement is consistent with a Mn concentration of a few percent in this region.\nTherefore, by structural analysis we can conclude that after PLA the near-surface layer of\nMn-implanted Ge contains Mn-rich tadpole-like regions, while most of the Mn is incorporated\nin a single crystalline Ge:Mn matrix.\n\nB.\n\nMagnetism and Magneto-transport\n\nFig. 2 shows the comparison of the field-dependent magnetization, Hall resistance, and\nlongitudinal resistance at 5 K measured on the Ge:Mn sample after PLA, and represents a\ncentral result of the current paper. The involvement of holes in the ferromagnetism is unambiguously confirmed by the appearance of the AHE, and, especially, by the clear hysteresis\nloop in the Hall resistance. Note that the presence of ferromagnetic characteristics in SQUID\nmeasurements alone could also be caused by ferromagnetic precipitates, e.g., Mn5 Ge3 , in addition to or instead of a FMS. At low temperature, hysteresis appears in both the Hall and\n5\n\n\fFIG. 3: (a) Magnetoresistance and (b) Hall resistance measured at different temperatures (for\nclarity, the curves at 10 K and 20 K are multiplied by the factors indicated in the figure). The\ncusp-like features in Rxy and electron-like high-field slope at low temperatures are due to twoband-like conduction [20].\n\nlongitudinal resistance curves, with the same coercive field as in the magnetization. Such\na correlation between AHE, MR, and magnetization is usually considered as the signature\nof FMS, [1, 2] where the same set of holes contribute to ferromagnetism and transport\n[29]. This also has been observed in compensated GaAs:Mn [25] and insulating GaP:Mn.\n[30] However, to our knowledge, the correlation between AHE, MR, and magnetization has\nnever been observed for other Ge:Mn samples.\nHere we point out that the hysteretic MR and AHE behavior only persists up to around\n7.5 K as shown in Figs. 3(a) and (b). By a linear fitting of the Hall curves at large fields [Fig.\n3(b)], we can calculate the hole concentration to be 2.1×1020 cm−3 , which does not change\nbetween 2.5 and 7.5 K. However, the hole concentration could be largely underestimated due\nto the influence of the AHE, as in the case of the GaAs:Mn system. [31] Nevertheless, if we\ncompare the hole concentration with the implantation fluence, we find that approximately\n3.5% of the Mn atoms result in electrically active holes by neglecting any compensation\neffect from interstitial Mn. Above 7.5 K the sample only shows positive MR and AHE\nwithout hysteresis, similar as reported in the literature. [3, 4, 15, 16, 19, 23] In Ref. 4, an\nextensive discussion is given to understand the large positive MR in Ge:Mn. We proposed\n6\n\n\fFIG. 4: Comparison between magnetization (M ) and Hall resistance (R xy ) curves with the magnetic field from -10000 to 10000 Oe. The signal is scaled for a better visibility. At 5 K, both M\nand R xy curves overlap with each other, while above 7.5 K there is no correlation between M and\nR xy .\n\nthat a two-band-like conduction could induce the large positive MR and anomalous Hall\nresistance. [20, 32]\nAbove 7.5 K, the carriers contributing mainly to the electrical transport are not involved\nin carrier-induced ferromagnetism. Thus, the Hall effect behaves differently from the magnetization which exhibits hysteresis. As shown in Figs. 4, at 5 K both M and R xy curves\noverlap with each other, while above 7.5 K there is no correlation between M and R xy .\nFig. 5 shows the temperature-dependent magnetization at 10000 Oe and the coercive\nfield, as well as the ZFC/FC curves at 50 Oe. We notice three distinct temperature regimes:\n(i) a weak temperature dependence of the coercive field below 10 K, (ii) a large drop of\ncoercive field above 10 K, and (iii) a large drop of magnetization (in a field of 10000 Oe) at\naround 100 K. Together with the ZFC/FC curves, we can infer the following: Below 10 K,\nmagnetic percolation occurs through the whole sample. Between 10 and 60 K, individual Mnrich regions are spontaneously magnetized, and by applying a large field, the magnetization\nof the entire sample decreases only slightly with increasing temperature. Above the peak\nin the ZFC/FC curves, the ferromagnetic exchange collapses in most of the Mn-rich regions\nand the magnetization drops quickly with increasing temperature. We would like to point\nout, however, that concerning its magnetization properties the sample is still ferromagnetic\nabove 100 K, as reported in the literature. [4–6, 23, 33]\nThe most noticeable feature is the ZFC peak in the temperature range from 60 to 70 K.\nThe peak position does not change upon increasing the field up to 500 Oe (not shown). For\nnormal magnetic nanoparticles the corresponding ZFC peak moves to lower temperatures\n\n7\n\n\fFIG. 5: Temperature-dependent magnetization at 10000 Oe and the coercivity together with the\nZFC/FC magnetization curves at 50 Oe. It can be viewed as a simple magnetic phase diagram of\nthe sample.\n\nwhen applying a larger magnetic field. [34] Therefore, the Mn-rich regions are different\nfrom crystalline secondary phases. Such Mn-rich regions in Ge were also observed by other\ngroups, [3, 5, 23] but the magnetic-field-independent ZFC peaks were found at a much\nlower temperature around 18 K. The ferromagnetism in those regions is believed to be\nhole-mediated. [5, 23] The ZFC/FC peaks in our samples occur at higher temperatures,\nwhich indicates a stronger ferromagnetic coupling inside the Mn-rich regions. According to\nthe model of Kaminski and Das Sarma, [24] the ferromagnetic transition in these regions\nleads to an immediate decrease in the hopping energy which gives rise to a non-monotonic\ntemperature dependence of the sample resistance. A resistance peak at around T C of Mnrich regions has been observed experimentally by Li et al. [23] and is in fact also visible in\nthe temperature-dependent resistance as shown in Fig. 6. At low temperature, there are two\nregions of fundamentally different behavior: Below 10 K, the resistance is nearly constant,\ni.e., quasi metallic. From 10 to 20 K the resistance decreases steeply with an activation\nenergy of 4 meV. Such a temperature dependence appears to be a rather universal feature\nof Mn-doped Ge, [3, 15, 19, 21] and is attributed to impurity band conduction. [4, 19, 21]\nWe will discuss below that this activation energy of 4 meV is related with the temperaturedependent occupation of the ground and first excited state of the Mn double acceptor which\nform impurity bands in Ge:Mn.\n\n8\n\n\fFIG. 6: Temperature-dependent longitudinal resistance (R xx ) at zero field. The hump around\n60–70 K indicated by the arrow coincides with the peak in the ZFC curves, which is related to\nMn-rich regions. The inset shows ln(Rxx ) vs. reciprocal temperature.\nMn\nd-states\nMn\np-states\n\nMn\np-states\n\nMn\nd-states\n\nFIG. 7: Sketch of single-particle states (not to scale) introduced by Mn double acceptors in Ge\nbefore (black) and after (red) hybridization, see text. The spin of the lower lying Mn d-shells is\nassumed to point upward. Spin-orbit coupling is ignored. Bold (dashed) arrows indicate occupied\n(unoccupied) states. The valence band (VB) and conduction band (CB) edges are indicated.\nC.\n\nTheoretical picture of Ge:Mn\n\nIn analogy to substitutional Mn in GaAs:Mn, [35] we discuss the microscopic picture of\nsubstitutional Mn in Ge. The three Mn p-orbitals form the bound acceptor states of Mn and\nare subject to a crystal field of tetrahedral symmetry. They belong to the three-dimensional\ntd (Γ5 ) representation of the tetrahedral group Td , which can be interpreted as a state with\norbital angular momentum l = 1. Together with the spin s = 1/2, one finds that the\n9\n\n\facceptor state is sixfold degenerate. In the same Td crystal field, the five Mn d -orbitals split\ninto three orbitals with t2 character and two with e character. In accordance with Hund's\nrules for small crystal fields, all five are singly occupied and the electron spins are aligned.\nLet us assume that the d -shell spin is pointing upward. The five Mn d -orbitals with the\nd -shell spin pointing downward are unoccupied. The separation between the spin upward\nand spin downward Mn d -orbitals (Fig. 7) is mostly due to the on-site Coulomb repulsion.\nThe t2 -type spin-up d -orbitals hybridize with the t2 -type spin-up acceptor states. This leads\nto level repulsion, which shifts the spin-up acceptor states (\"dangling-bond hybrid\", DBH)\nupward in energy, as shown in Fig. 7. Analogously, level repulsion between the unoccupied\nspin-down d -orbitals and the spin-down acceptor states shifts the latter downward in energy.\nMn is a double acceptor. The hole binding energy is found to be 0.16 eV from the valence\nband and 0.37 eV from the conduction band for the neutral and singly charged acceptor,\nrespectively. [22] In Fig. 7 the neutral acceptor is represented as two bound holes going into\nthe single-particle states of highest electronic energy. Consequently, two spin-up electrons\nare missing and the total spin is reduced from what one would get from the Mn p-orbitals\nand d -orbitals alone. In this sense, the exchange interaction between the Mn d -states and\nacceptor p-states is antiferromagnetic.\nTo obtain the full picture, many-particle effects and spin-orbit coupling have to be taken\ninto account. In the neutral Mn double acceptor with two bound holes, i.e., the d5 + 2h\ncomplex likely relevant here, the electrons should combine to give a total angular momentum\nof magnitude j = 2 according to Hund's rules. Due to the antiferromagnetic interaction with\nthe Mn d -shell spin S = 5/2 we obtain a total angular momentum F = j + S with F = 1/2\nin the ground state and F = 3/2 in the first excited state. The splitting between the groundstate doublet and the excited state quartet has not been determined so far. We attribute\nthe thermal activation energy of 4 meV from 10 to 20 K as shown in Fig. 6 to the transition\nbetween the total angular momentum states F = 1/2 and F = 3/2 of neutral Mn double\nacceptors. The exchange interaction can be written as ǫj*S = 2ǫ [F (F +1)−j(j+1)−S(S+1)].\nConsequently, the splitting between the ground state (j = 2, S = 5/2 and F = 1/2) and\nthe first excited state (j = 2, S = 5/2 and F = 3/2) is 3ǫ/2 ∼4 meV and the exchange\nconstant ǫ is 2.7 meV. This is comparable to ǫ in GaAs:Mn amounting to 2.5–5.5 meV. [29]\nFurthermore, independently of the third Hund coupling compared to ǫ, the calculated spin\npolarization of the holes in the ground state amounts to -0.33. If the third Hund coupling\n10\n\n\fis small compared to ǫ, as is likely the case, the calculated spin polarization in the first\nexcited state amounts to -0.44. Due to the increased spin polarization in the first excited\nstate compared to the ground state, the hole mobility in the first excited state is likely also\nhigher than in the ground state due to the suppression of spin-flip scattering. We therefore\npropose that the thermally activated behavior seen in Fig. 6 around 10–20 K is due to the\nfirst excited state becoming accessible, which opens another conducting channel with a larger\nmobility. However, a definite explanation for the resistance drop is not possible at present\ndue to the strong anomalous Hall effect, which inhibits a complete determination of carrier\nconcentration and mobility as a function of temperature.\nNote that the microscopic picture of an antiferromagnetic coupling between holes and Mn\nions is consistent with the macroscopic picture of the BMP theory proposed by Kaminski\nand Das Sarma. [24] When the temperature is low, the ferromagnetic transition will first\noccur locally in the regions with larger carrier concentration. As the temperature decreases,\nthese finite-size regions, which have random shapes and positions, grow and merge, and\nfinally percolation over the whole sample occurs. Therefore, the Ge:Mn FMS material will\nbe rather described as a combination of Mn-rich and Mn-poor regions with diluted Mn ions.\nThe substitutional Mn ions introduce holes, acting as seeds for BMPs. The number and size\nof BMPs increase with the hole concentration and with decreasing temperature, respectively.\nWithin such a picture we can understand the investigated Ge:Mn sample and also shed\nlight on the absence of hysteretic MR and AHE in the literature. The hole concentration\nis the critical parameter for FMS behavior, as seen for GaAs:Mn. [25] A large enough\nhole concentration (2.1×1020 cm−3 ) gives rise to the carrier-mediated ferromagnetism\nthroughout the Ge:Mn sample presented here. In addition to the sample discussed here,\nwe also investigated Ge:Mn samples with lower hole concentration. In those samples we\nobserved ferromagnetism up to around 100 K, but no hysteretic magneto-transport down\nto 5 K. [36] This appears similar to Refs. 4–6, 23, 33, where a ferromagnetic phase with\na high T C was reported due to the Mn-rich regions, but the hysteretic magneto-transport\nwas absent, most likely due to the low hole concentration.\n\n11\n\n\fIV.\n\nCONCLUSION\n\nIn conclusion, using the approach of Mn-ion implantation into Ge and subsequent pulsed\nlaser annealing, we have been able to increase the hole concentration by two orders of magnitude compared to LT-MBE growth. Below 10 K, we observe negative magnetoresistance\nand anomalous Hall effect, exhibiting the same hysteresis as the magnetization. In contrast,\nsuch effects are absent in samples with a smaller hole concentration. The magnetic and\nmagneto-transport properties can be qualitatively well explained within a picture of dopant\nsegregation and the formation of bound magnetic polarons.\n\nAcknowledgments\n\nFinancial\n\nsupport\n\nfrom\n\nthe\n\nBundesministerium\n\nfür\n\nBildung\n\nund\n\nForschung\n\n(FKZ13N10144) is gratefully acknowledged.\n\n[1] H. Ohno, H. Munekata, T. Penney, S. von Molnár, and L. L. Chang, Phys. Rev. Lett. 68,\n2664 (1992).\n[2] D. Ferrand, J. Cibert, A. Wasiela, C. Bourgognon, S. Tatarenko, G. Fishman, T. Andrearczyk,\nJ. Jaroszyski, S. Koleśnik, T. Dietl, et al., Phys. Rev. B 63, 085201 (2001).\n[3] Y. D. Park, A. T. Hanbicki, S. C. Erwin, C. S. Hellberg, J. M. Sullivan, J. E. Mattson, T. F.\nAmbrose, A. Wilson, G. Spanos, and B. T. Jonker, Science 295, 651 (2002).\n[4] M. Jamet, A. Barski, T. Devillers, V. Poydenot, R. Dujardin, P. Bayle-Guillemaud, J. Rothman, E. Bellet-Amalric, A. Marty, J. Cibert, R. Mattana, S. Tatarenko, Nat. Mater. 5, 653\n(2006).\n[5] D. Bougeard, S. Ahlers, A. Trampert, N. Sircar, and G. Abstreiter, Phys. Rev. Lett. 97,\n237202 (2006).\n[6] A. P. Li, C. Zeng, K. van Benthem, M. F. Chisholm, J. Shen, S. V. S. N. Rao, S. K. Dixit,\nL. C. Feldman, A. G. Petukhov, M. Foygel, H. H Weitering, Phys. Rev. B 75, 201201 (2007).\n[7] T. Devillers, M. Jamet, A. Barski, V. Poydenot, P. Bayle-Guillemaud, E. Bellet-Amalric,\nS. Cherifi, and J. Cibert, Phys. Rev. B 76, 205306 (2007).\n[8] A. P. Li, J. Shen, J. R. Thompson, and H. H. Weitering, Appl. Phys. Lett. 86, 152507 (2005).\n\n12\n\n\f[9] S. Ahlers, D. Bougeard, N. Sircar, G. Abstreiter, A. Trampert, M. Opel, and R. Gross, Phys.\nRev. B 74, 214411 (2006).\n[10] S. Zhou, A. Shalimov, K. Potzger, N. M. Jeutter, C. Baehtz, M. Helm, J. Fassbender, and\nH. Schmidt, Appl. Phys. Lett. 95, 192505 (2009).\n[11] J.-S. Kang, G. Kim, S. C. Wi, S. S. Lee, S. Choi, S. Cho, S. W. Han, K. H. Kim, H. J. Song,\nH. J. Shin, A. Sekiyama, S. Kasai, S. Suga, B. I. Min, Phys. Rev. Lett. 94, 147202 (2005).\n[12] S. Picozzi, L. Ottaviano, M. Passacantando, G. Profeta, A. Continenza, F. Priolo, M. Kim,\nand A. J. Freeman, Appl. Phys. Lett. 86, 062501 (2005).\n[13] P. Gambardella, L. Claude, S. Rusponi, K. J. Franke, H. Brune, J. Raabe, F. Nolting, P. Bencok, A. T. Hanbicki, B. T. Jonker, C. Grazioli, M. Veronese, C. Carbone, Phys. Rev. B 75,\n125211 (2007).\n[14] S. Decoster, S. Cottenier, B. De Vries, H. Emmerich, U. Wahl, J. G. Correia, and A. Vantomme, Phys. Rev. Lett. 102, 065502 (2009).\n[15] F. Tsui, L. He, L. Ma, A. Tkachuk, Y. S. Chu, K. Nakajima, and T. Chikyow, Phys. Rev.\nLett. 91, 177203 (2003).\n[16] C. Zeng, Z. Zhang, K. van Benthem, M. F. Chisholm, and H. H. Weitering, Phys. Rev. Lett.\n100, 066101 (2008).\n[17] J. X. Deng, Y. F. Tian, S. M. He, H. L. Bai, T. S. Xu, S. S. Yan, Y. Y. Dai, Y. X. Chen,\nG. L. Liu, and L. M. Mei, Appl. Phys. Lett. 95, 062513 (2009).\n[18] H. Ohno, A. Shen, F. Matsukura, A. Oiwa, A. Endo, S. Katsumoto, and Y. Iye, Appl. Phys.\nLett. 69, 363 (1996).\n[19] O. Riss, A. Gerber, I. Y. Korenblit, A. Suslov, M. Passacantando, and L. Ottaviano, Phys.\nRev. B 79, 241202(R) (2009).\n[20] S. Zhou, D. Bürger, M. Helm, and H. Schmidt, Appl. Phys. Lett. 95, 172103 (2009).\n[21] N. Pinto, L. Morresi, M. Ficcadenti, R. Murri, F. D'Orazio, F. Lucari, L. Boarino, and\nG. Amato, Phys. Rev. B 72, 165203 (2005).\n[22] H. H. Woodbury and W. W. Tyler, Phys. Rev. 100, 659 (1955).\n[23] A. P. Li, J. F. Wendelken, J. Shen, L. C. Feldman, J. R. Thompson, and H. H. Weitering,\nPhys. Rev. B 72, 195205 (2005).\n[24] A. Kaminski and S. Das Sarma, Phys. Rev. B 68, 235210 (2003).\n[25] S. U. Yuldashev, H. C. Jeon, H. S. Im, T. W. Kang, S. H. Lee, and J. K. Furdyna, Phys. Rev.\n\n13\n\n\fB 70, 193203 (2004).\n[26] S. Ahlers, D. Bougeard, H. Riedl, G. Abstreiter, A. Trampert, W. Kipferl, M. Sperl,\nA. Bergmaier, and G. Dollinger, Physica E 32, 422 (2006).\n[27] D. Bürger, S. Zhou, M. Pandey, C. Viswanadham, J. Grenzer, O. Roshchupkina, W. Anwand,\nH. R. V. Gottschalch, M. Helm, and H. Schmidt, Phys. Rev. B 81, 115202 (2010).\n[28] M. A. Scarpulla, R. Farshchi, P. R. Stone, R. V. Chopdekar, K. M. Yu, Y. Suzuki, and O. D.\nDubon, J. Appl. Phys. 103, 073913 (2008).\n[29] T. Dietl, H. Ohno, F. Matsukura, J. Cibert, and D. Ferrand, Science 287, 1019 (2000).\n[30] M. A. Scarpulla, B. L. Cardozo, R. Farshchi, W. M. H. Oo, M. D. McCluskey, K. M. Yu, and\nO. D. Dubon, Phys. Rev. Lett. 95, 207204 (2005).\n[31] T. Omiya, F. Matsukura, T. Dietl, Y. Ohno, T. Sakon, M. Motokawa, and H. Ohno, Physica\nE 7, 976 (2000).\n[32] S. M. Watts, S. Wirth, S. von Molnár, A. Barry, and J. M. D. Coey, Phys. Rev. B 61, 9621\n(2000).\n[33] C. Jaeger, C. Bihler, T. Vallaitis, S. T. B. Goennenwein, M. Opel, R. Gross, and M. S. Brandt,\nPhys. Rev. B 74, 045330 (2006).\n[34] S. Zhou, K. Potzger, J. von Borany, R. Grötzschel, W. Skorupa, M. Helm, and J. Fassbender,\nPhys. Rev. B 77, 035209 (2008).\n[35] P. Mahadevan and A. Zunger, Phys. Rev. B 68, 075202 (2003).\n[36] S. Zhou, D. Bürger, C. Baumgart, A. Mücklich, W. Skorupa, C. Timm, P. Oesterlin, M. Helm,\nand H. Schmidt (2010), unpublished.\n\n14\n\n\f"}