{"id": "http://arxiv.org/abs/1012.0818v1", "guidislink": true, "updated": "2010-12-03T19:03:54Z", "updated_parsed": [2010, 12, 3, 19, 3, 54, 4, 337, 0], "published": "2010-12-03T19:03:54Z", "published_parsed": [2010, 12, 3, 19, 3, 54, 4, 337, 0], "title": "Perspectives on Gamma-Ray Pulsar Emission", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1012.5842%2C1012.5911%2C1012.1262%2C1012.2757%2C1012.2747%2C1012.4235%2C1012.0395%2C1012.2713%2C1012.0782%2C1012.4636%2C1012.5623%2C1012.5180%2C1012.5662%2C1012.2578%2C1012.1453%2C1012.5609%2C1012.4171%2C1012.3777%2C1012.2344%2C1012.2639%2C1012.0818%2C1012.5794%2C1012.0633%2C1012.4962%2C1012.5966%2C1012.0023%2C1012.3343%2C1012.0345%2C1012.0669%2C1012.1915%2C1012.5800%2C1012.4047%2C1012.4775%2C1012.2908%2C1012.4922%2C1012.5928%2C1012.5452%2C1012.1360%2C1012.4531%2C1012.1762%2C1012.1254%2C1012.4653%2C1012.3009%2C1012.2733%2C1012.5437%2C1012.1122%2C1012.5473%2C1012.3640%2C1012.3186%2C1012.0991%2C1012.4246%2C1012.2145%2C1012.2797%2C1012.2285%2C1012.0922%2C1012.3049%2C1012.2698%2C1012.3597%2C1012.3899%2C1012.5242%2C1012.1594%2C1012.3635%2C1012.2795%2C1012.0560%2C1012.4506%2C1012.3713%2C1012.0890%2C1012.5764%2C1012.4201%2C1012.5630%2C1012.2970%2C1012.1500%2C1012.5013%2C1012.2407%2C1012.4911%2C1012.2091%2C1012.2203%2C1012.1009%2C1012.2151%2C1012.0632%2C1012.5006%2C1012.1376%2C1012.2154%2C1012.5126%2C1012.0222%2C1012.4216%2C1012.4580%2C1012.6017%2C1012.1904%2C1012.4232%2C1012.4754%2C1012.2079%2C1012.2295%2C1012.3811%2C1012.2564%2C1012.3103%2C1012.2033%2C1012.1190%2C1012.2093%2C1012.2239%2C1012.2895&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Perspectives on Gamma-Ray Pulsar Emission"}, "summary": "Pulsars are powerful sources of radiation across the electromagnetic\nspectrum. This paper highlights some theoretical insights into non-thermal,\nmagnetospheric pulsar gamma-ray radiation. These advances have been driven by\nNASA's Fermi mission, launched in mid-2008. The Large Area Telescope (LAT)\ninstrument on Fermi has afforded the discrimination between polar cap and slot\ngap/outer gap acceleration zones in young and middle-aged pulsars. Altitude\ndiscernment using the highest energy pulsar photons will be addressed, as will\nspectroscopic interpretation of the primary radiation mechanism in the LAT\nband, connecting to both polar cap/slot gap and outer gap scenarios. Focuses\nwill mostly be on curvature radiation and magnetic pair creation, including\npopulation trends that may afford probes of the magnetospheric accelerating\npotential.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1012.5842%2C1012.5911%2C1012.1262%2C1012.2757%2C1012.2747%2C1012.4235%2C1012.0395%2C1012.2713%2C1012.0782%2C1012.4636%2C1012.5623%2C1012.5180%2C1012.5662%2C1012.2578%2C1012.1453%2C1012.5609%2C1012.4171%2C1012.3777%2C1012.2344%2C1012.2639%2C1012.0818%2C1012.5794%2C1012.0633%2C1012.4962%2C1012.5966%2C1012.0023%2C1012.3343%2C1012.0345%2C1012.0669%2C1012.1915%2C1012.5800%2C1012.4047%2C1012.4775%2C1012.2908%2C1012.4922%2C1012.5928%2C1012.5452%2C1012.1360%2C1012.4531%2C1012.1762%2C1012.1254%2C1012.4653%2C1012.3009%2C1012.2733%2C1012.5437%2C1012.1122%2C1012.5473%2C1012.3640%2C1012.3186%2C1012.0991%2C1012.4246%2C1012.2145%2C1012.2797%2C1012.2285%2C1012.0922%2C1012.3049%2C1012.2698%2C1012.3597%2C1012.3899%2C1012.5242%2C1012.1594%2C1012.3635%2C1012.2795%2C1012.0560%2C1012.4506%2C1012.3713%2C1012.0890%2C1012.5764%2C1012.4201%2C1012.5630%2C1012.2970%2C1012.1500%2C1012.5013%2C1012.2407%2C1012.4911%2C1012.2091%2C1012.2203%2C1012.1009%2C1012.2151%2C1012.0632%2C1012.5006%2C1012.1376%2C1012.2154%2C1012.5126%2C1012.0222%2C1012.4216%2C1012.4580%2C1012.6017%2C1012.1904%2C1012.4232%2C1012.4754%2C1012.2079%2C1012.2295%2C1012.3811%2C1012.2564%2C1012.3103%2C1012.2033%2C1012.1190%2C1012.2093%2C1012.2239%2C1012.2895&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Pulsars are powerful sources of radiation across the electromagnetic\nspectrum. This paper highlights some theoretical insights into non-thermal,\nmagnetospheric pulsar gamma-ray radiation. These advances have been driven by\nNASA's Fermi mission, launched in mid-2008. The Large Area Telescope (LAT)\ninstrument on Fermi has afforded the discrimination between polar cap and slot\ngap/outer gap acceleration zones in young and middle-aged pulsars. Altitude\ndiscernment using the highest energy pulsar photons will be addressed, as will\nspectroscopic interpretation of the primary radiation mechanism in the LAT\nband, connecting to both polar cap/slot gap and outer gap scenarios. Focuses\nwill mostly be on curvature radiation and magnetic pair creation, including\npopulation trends that may afford probes of the magnetospheric accelerating\npotential."}, "authors": ["Matthew G. Baring"], "author_detail": {"name": "Matthew G. Baring"}, "author": "Matthew G. Baring", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1063/1.3629488", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1012.0818v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1012.0818v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "8 pages, 2 figures, to appear in Proc. of the \"Astrophysics of\n  Neutron Stars 2010\" Conference, eds. E. Gogus, T. Belloni & U. Ertan (AIP\n  Conf. Proc., New York)", "arxiv_primary_category": {"term": "astro-ph.HE", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph.HE", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1012.0818v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1012.0818v1", "journal_reference": null, "doi": "10.1063/1.3629488", "fulltext": "To appear in Proc. of the Astrophysics of Neutron Stars 2010 Conference\neds. E. Göğüş, T. Belloni & U. Ertan (AIP Conf. Proc., New York).\n\nPerspectives on Gamma-Ray Pulsar Emission\n\narXiv:1012.0818v1 [astro-ph.HE] 3 Dec 2010\n\nMatthew G. Baring\nDepartment of Physics and Astronomy, MS-108, Rice University, P. O. Box 1892,\nHouston, TX 77251-1892, USA Email: baring@rice.edu\nAbstract. Pulsars are powerful sources of radiation across the electromagnetic spectrum. This\npaper highlights some theoretical insights into non-thermal, magnetospheric pulsar gamma-ray\nradiation. These advances have been driven by NASA's Fermi mission, launched in mid-2008. The\nLarge Area Telescope (LAT) instrument on Fermi has afforded the discrimination between polar cap\nand slot gap/outer gap acceleration zones in young and middle-aged pulsars. Altitude discernment\nusing the highest energy pulsar photons will be addressed, as will spectroscopic interpretation of\nthe primary radiation mechanism in the LAT band, connecting to both polar cap/slot gap and outer\ngap scenarios. Focuses will mostly be on curvature radiation and magnetic pair creation, including\npopulation trends that may afford probes of the magnetospheric accelerating potential.\nKeywords: Pulsars; non-thermal mechanisms; magnetic fields; neutron stars; gamma-rays\nPACS: 95.30.Cq; 95.30.Gv; 95.30.Sf; 95.85.Pw; 97.60.Gb; 97.60.Jd\n\nINTRODUCTION\nPrior to the launch of the Compton Gamma-Ray Observatory (CGRO) in 1991, the\ngamma-ray pulsar database was extremely limited. CGRO extended the population to\nseven sources, all of them young pulsars, and only Geminga had no definitive observation of a radio pulsar counterpart. There were also a few marginal CGRO detections,\nincluding the millisecond pulsar PSR J0218+4232. Following the launch of the Fermi\nGamma-Ray Space Telescope on June 11, 2008, the gamma-ray pulsar database has\ngrown rapidly, with over 75 sources now observed with high significance. Most of these\nare again young pulsars with higher spin-down luminosities than the average for radio pulsars. Yet, a sizable millisecond pulsar (MSP) population has emerged, at present\nnumbering more than twenty. Moreover, the improved photon counts captured by the\nFermi Large Area Telescope has enabled blind pulsation searches, those without prior\nknowledge of a radio timing ephemeris. The LAT has discovered over 20 pulsars in blind\nsearches of the gamma-ray data alone, and only a few have since had radio confirmation.\nThe improved pulse-phase spectroscopy enabled by Fermi has clarified the probable\nlocale of the gamma-ray emission region. The two major competing models for the site\nof this emission are the polar cap (PC) near the stellar surface (e.g. [10, 12]) and the\nouter gap (OG) near the light cylinder (e.g. [9, 20]). Super-exponential turnovers due to\nmagnetic pair creation are expected for PC models at the maximum photon energies\nin the GeV band, as opposed to exponential shapes for OG models. Discrimination\nby Fermi-LAT between these two shapes was anticipated prior to launch [19]. In the\nvast majority of LAT pulsar spectra, the turnovers are exponential, thereby favoring the\nOG scenario [2]. Furthermore, the separation of peaks in pulsars with more than one\npulse peak is generally of the order of 0.3–0.5 in phase, indicating a broad radiation\n\n\fcone that is consistent only with high altitude emission locales for dipolar fields (e.g.\n[26]). This evidence has ushered in a new era for the γ -ray pulsar paradigm. Here,\nsome perspectives pertaining to this new era are offered, focusing first on lower bounds\nto the emission radius from magnetic pair creation physics. In addition, the GeV-band\nturnover energies EMAX are assessed in terms of the canonical radiation-reaction-limited\ncurvature emission picture, touching upon population characteristics for γ -ray pulsars.\n\nMAGNETIC PAIR CREATION BOUNDS FOR THE MINIMUM\nALTITUDE OF EMISSION\nThe emergence of gamma-rays from pulsars is probably intimately coupled to the generation of electron-positron pairs in their magnetospheres. Such a connection between\nradiation emission and pair creation was posited in early radio-pulsar pictures [21, 24].\nIn the inner magnetosphere of young pulsars, the dominant pair production process involves a single photon interacting with the B field, γ → e+ e− , with its non-magnetic,\nquantum counterpart γγ → e+ e− only becoming competitive at high altitudes. Hence,\nγ → e+ e− is the preserve of polar cap (PC; [10]) and slot gap (SG; [18]) gamma-ray\npulsar models. It is a first-order QED process that is kinematically forbidden in field-free\nregions, but can take place in an external magnetic field, which can absorb momentum\nperpendicular to B. Its generic physics properties are summarized in [6]. Due to energy\nconservation, its rate Rpp possesses an absolute threshold energy, εγ ≥ 2/ sin θkB . Here\nθkB is the angle the photon momentum vector k makes with the magnetic field B, and\nthe photon energy εγ is in units of me c2 , a convention adopted hereafter.\nAbove threshold, Rpp , which is averaged here over photon polarizations, exhibits a\nlarge number of resonances, corresponding to thresholds for the creation of pairs in\nexcited states; these aggregate to exhibit a characteristic sawtooth structure (e.g. [6, 11]).\nIn pulsar contexts, considerable ranges of field strengths and photon angles θkB are\nsampled during magnetospheric propagation: the resulting convolution smears out the\nsawtooth appearance into a continuum. In this regime, the dependence on εγ can be\napproximated by a compact asymptotic expression (e.g. [13]; and references in [6]):\nr\n\u001b\n\u001a\nB\n8\n3 3 αf c B\npp\nε sin θkB ≪ 1 ,\nsin θkB exp −\n, Υ≡\n(1)\nR ≈\n8 2 λ–c Bcr\n3Υ\nBcr γ\nwhere Υ is the critical asymptotic expansion parameter. Here, α f = e2 /(h̄c) is the\nfine structure constant, λ–c = h̄/(me c) = 3.862 × 10−11 cm is the electron Compton\nwavelength over 2π , and Bcr = m2e c3 /(eh̄) = 4.413 × 1013 Gauss is the quantum critical\nfield, where the cyclotron energy equals me c2 . Near threshold, this asymptotic result\nis an imprecise description of Rpp [11], and can be improved considerably by careful\ntreatment of the associated mildly-relativistic regimes for the produced pairs (e.g. [4]).\nIn polar cap pulsar models [10, 21, 24], primary curvature photon emission is emitted\nat very small angles to the magnetic field, well below pair threshold (e.g. [8]). These\nphotons will convert into pairs only after traveling a distance s that is a fraction of the\nfield line radius of curvature ρc . Above the polar cap, the radius of field curvature is\nρc = [Prc/2π ]1/2 for a pulsar period P , and exceeds the neutron star radius RNS . Pair\n\n\fcreation ensues for small angles such that sin θkB ∼ s/ρc , and the argument Υ of the\nexponential becomes a fraction of unity, i.e., when εγ B sin θkB & 0.2 Bcr . Accordingly,\nin young pulsars, pair production will usually occur somewhat or well above threshold\nwhen B ≪ 0.1 Bcr , and the attenuation mean free path λpp ∼ ρc /ε max{2, 0.2Bcr /B}\nwill then be much less than RNS . Consequently, the optical depth τγ (εγ ) for one-photon\npair opacity will be a rapidly-varying function of εγ , producing a dramatic attenuation\nsignature at the escape energy εesc , which typically lies above 100 MeV (see [8]).\nThe upshot is that attenuation by γ → e+ e− should impose a super-exponential cutoff\nin pulsar γ -ray spectra of the approximate form dnγ /d εγ ∝ exp{−α exp[−εesc /εγ ]} for\nsome constant α . If εesc ∼ εMAX ≡ EMAX /me c2 , the severity of the cutoff should produce\n[10, 12] a sharp turnover that is distinguishable from those generated by other mechanisms. It was widely anticipated [19] that the Fermi-LAT instrument would discern the\nprecise shape of such cutoffs in Vela and other pulsars, and accordingly discriminate\nbetween the polar cap and outer gap models for their high energy emission. It has in fact\ndone so. Early on in the first year of observations by Fermi, the high count rates for Vela\npermitted the exclusion of super-exponential turnovers at a high level of significance\n[1]. This has become possible for the pool of 39 young pulsars listed in the Fermi-LAT\nPulsar Catalog in [2], all of which reveal significant turnovers in the 1-10 GeV band\nconsistent with simple exponentials. This clearly demonstrates that γ → e+ e− is not\nproducing the observed turnovers, proving that τγ (εγ ) < 1 for εγ . εMAX .\nThis undeniable absence of the signature of active magnetic pair creation in gammaray pulsar signals can be inverted to provide robust lower bounds to emission altitudes,\na protocol that has been adopted in a number of Fermi-LAT pulsar papers. Defining a\nmarginal magnetic pair opacity criterion τγ (εMAX ) ≈ 1 near the pulsar surface, rearrangement yields an approximate dependence of pair creation cutoff energies εMAX on B0 , R0\nand pulsar period P (in seconds). Setting EMAX ≡ εMAX me c2 , this can be summarized in\na relation [5] that corresponds to near-surface emission ( r . 2RNS ):\n(\n\u0012\n\u00131/2\n\u0012\n\u00133 )\n√\nr\n0.1 Bcr\nr\nEMAX ∼ 0.4 P\nmax 1,\nGeV .\n(2)\nRNS\nB0\nRNS\nThis encapsulates the character of accurate numerics derived from codes employed in\n[14] and [8], which include pronounced effects of general relativity on spacetime curvature, field enhancement and photon energy. In flat spacetime, the altitudinal dependence\nis weaker, corresponding to εMAX ∝ (r/RNS )5/2 (e.g. [16, 27]) above the magnetic poles.\nThe pair opacity εMAX trend can be expressed alternatively as a combination of\nobservables appropriate for this inner gap (polar cap) discussion. The form is\nlog10\n\nEMAX\n7\n≈ σIG + log10 χIG + 0.25 ,\n1 GeV\n2\n\nσIG = − log10 B12 +\n\n1\nlog10 P\n2\n\n. (3)\n\nwhich clearly encapsulates an anti-correlation with Ṗ , as does Eq. (2), since B0 =\n3.2 × 1019 (P Ṗ)1/2 [17]. Here χIG = r/RNS is the scaling of the radius appropriate for\npolar cap considerations. Figure 1 plots the phase space corresponding to Eq. (3), using\nthe measured spectroscopic cutoffs Ec for young Fermi-LAT pulsars in Table 4 of [2] to\n\n\fFIGURE 1. The inferred maximum pulsar emission energies EMAX as a function of the key polar cap\n(inner gap) magnetic pair creation attenuation parameter σIG defined in Eq. (3). The spectral parameters\nused are the cutoff energies Ec listed in Table 4 of [2], the First Fermi-LAT Catalog of Gamma-ray\nPulsars. For the 37 pulsars constituting the black points, EMAX = 2.5Ec was set; for the Crab and Vela,\nEMAX = 3.5Ec (see text). The high-field CGRO Comptel pulsar B1509-58 (J1513-5908) is also displayed.\nNo LAT millisecond pulsars are depicted. The fiducial linear relationship in Eq. (3) is displayed as the\ndiagonal lines for four different emission altitudes, r/RNS = 1 (surface), 2, 3, 4 , as labelled.\n\nbenchmark the maximum energies EMAX . Since these cutoffs are exponential in character, the action of magnetic pair creation can be ruled out at energies below the window\naround Ec . For this reason, a representative setting of EMAX = 2.5Ec was deployed in\nthe Figure for most of the pulsars, the set of 37 with points in black. This value can be\nadjusted on a case-by-case basis, depending on the photon counting statistics. Accordingly, the alternative value of EMAX = 3.5Ec was adopted for the Crab and Vela pulsars.\nMotivations for these exceptions are as follows: the Crab, possesses high energy emission reflected in its pulsed detection by MAGIC [3], and Vela, because its impressive\ncount rate as the brightest LAT-band pulsar in the sky permits extraordinary spectroscopic determination of its turnover [1]. The uncertainties in Ec were scaled similarly,\nyielding the EMAX error bars in the Figure. PSR B1509-58, the young, high-field pulsar\ndetected by Comptel on CGRO, but not by EGRET, was also placed in the Figure using\nan inferred EMAX value from the spectral results displayed in [14]. It is the only gammaray pulsar that might be consistent with γ → e+ e− attenuation operating near the stellar\nsurface. Observe that no millisecond pulsars (with σIG < −2 ) are exhibited in Fig. 1 as\ntheir surface fields are so low that γ → e± pair creation is exponentially improbable in\ntheir magnetospheres. The phase space plot in Figure 3 clearly demonstrates that there\nis no correlation between εMAX and σIG or Ṗ in the LAT pulsar population.\n\n\fCURVATURE RADIATION AT HIGH ALTITUDES\nGiven the above discussion it is evident that the Fermi GeV-band spectral cutoffs in\nyoung pulsars are probably related to the primary emission mechanism. Dating from the\nearly models of [24], this mechanism is postulated to be curvature radiation, the elementary dipole radiation resulting from pairs accelerating in the curved magnetospheric\nfields. The formalism for the curvature radiation emissivity is identical to that for classical synchrotron radiation [15, 22], but with the electron Larmor radius rL = γe me c2 /(eB)\nbeing replaced by the radius of field curvature, ρc . Accordingly, the characteristic dimensionless (i.e., in units of me c2 ) photon energy scales for curvature radiation, εc , and\nsynchrotron emission εs , are\n\nεc =\n\n3 3 λ–c\nγ\n2 e ρc\n\n,\n\n3 3 λ–c\n3 B 2\nsin θe ≡\nγ\nγ sin θe\n2 e rL\n2 Bcr e\n\nεs =\n\n.\n\n(4)\n\nFor curvature emission to seed pulsar gamma-ray signals, εc must exceed a few GeV in\nthe magnetosphere; this is routinely satisfied in polar cap (e.g. [12]), slot gap [18] and\nouter gap (e.g. [20]) models, for both young pulsars and millisecond ones.\nAt its characteristic photon energy, the differential emissivity per electron scales as\nα f c/λ–c γe−2 (e.g. see Eq. (2) of [7]) for both the curvature and synchrotron processes.\nWhen this emissivity scale is multiplied by the square of the photon energy scale\nin Eq. (4), the corresponding magnitudes for the curvature radiation and synchrotron\ncooling rates result; in full form these rates are\n\nγ̇CR = −\n\n2 r0 c 4\nγ\n3 ρc2 e\n\n,\n\nγ̇syn = −\n\n2 r0 c 2 2\nγ sin θe\n3 rg2 e\n\n.\n\n(5)\n\nHere rg = me c2 /(eB) = λ–c Bcr /B is c divided by the cyclotron frequency, and r0 =\nα f λ–c = e2 /(mec3 ) is the classical electron radius. The precise numerical factors can be\nderived using the synchrotron formulation of [22]; for the curvature process this requires\nthe specialization to pitch angles θe = π /2 . From Eq. (5) one derives the criterion for\nthe dominance of a synchrotron signal over a curvature one: γe . ρc sin θe /rg . While\nθe ≈ 0 is presumed for the primary emission, pair creation usually generates secondary\nphotons at significant angles to the field, so that this inequality is almost always satisfied:\nsynchrotron photons therefore abound in subsequent generations of a cascade. Since\nρc /rg ≫ 1015 near the polar cap in young pulsars, only very small θe are required to\nspawn the swamping of primary curvature emission by a synchrotron component in the\ninner magnetosphere. This possibility should be borne in mind for future refinements of\nthe gamma-ray pulsar paradigm.\nThe maximum Lorentz factor of the electrons emitting in gamma-ray pulsars is a\nfunction of the accelerating potential adopted in a given model. If the electric field component along the local magnetic field is Ek (presumed positive), then the energy gain\nrate in the electrostatic gap is γ̇acc me c2 = eEk c , i.e. the electron speed c times the force.\nThe maximum possible electron Lorentz factor γMAX is realized when this gain equals\nthe loss rate due to radiative cooling, which is the radiation-reaction limit generally ascribed to curvature emission in gamma-ray pulsar models. Setting −eEk /(me c) equal to\n\n\fthe first result in Eq. (5) yields a maximum e− Lorentz factor γMAX ∼ [3ρc2 Ek /(2e)]1/4 ,\nwhich can then be inserted into Eq. (4) to specify the approximate maximum photon\nenergy (in units of me c2 ) for curvature radiation reaction-limited acceleration:\n\nεMAX\n\n\u0012 \u00133/4\n\u0012 \u00137/4\n3\n1/2 Ek\n=\nλ–c ρc\n2\ne\n\n.\n\n(6)\n\nThis form for εMAX is routinely cited in Fermi-LAT publications on gamma-ray pulsars\n(e.g. [2]). In principal, the observed cutoff energy can be less than this value if attenuation by pair production, magnetic or two-photon, is efficient, or the acceleration is\nterminated by mechanisms other than curvature cooling. Hence, the observed GeV-band\nturnovers in dozens of young pulsars in the First Fermi-LAT Pulsar Catalog provide\nlower bounds to the accelerating potential, modulo the altitude of emission.\nA natural, fiducial scale for the parallel electric field can be obtained from Lorentz\ntransformations associated with a rotating magnetosphere. This establishes r~Ω × ~B/c\nas the co-rotational component of ~E , providing the ideal MHD contribution. Yet within\nthe plasmasphere, a non-co-rotational, parallel component Ek emerges due to departures\nfrom Goldreich-Julian current flow (e.g. [23, 25]): it is putatively of the same order of\nscaling ∼ rΩB/c . This is the most optimistic scenario, being adopted for example in\nthe seminal outer gap pulsar model of [9], and leads to Ek ∼ e/(r0λ–c )χ −2 BLC/Bcr for\nχ = r/RLC describing the scaling of the acceleration/emission radius in terms of the\nlight cylinder radius RLC = Pc/(2π ) that will be employed hereafter. These define socalled thick outer gaps (e.g. [28]). Here BLC is the field strength at r = RLC , essentially\nalong the last open field line. Note that the dependence of Ek , BLC and the radius of\ncurvature on the obliquity of the rotator, and colatitude Θ , is omitted in this discussion.\nUsing the scaled radius of curvature νc = ρc /(χ RLC ) , one can then insert this nominal\nvalue for Ek into Eq. (6). This can be cast in terms of observables P and Ṗ . For a\nsurface polar field B0 = 3.2 × 1019(P Ṗ)1/2 ≡ 1012 B12 Gauss and a neutron star radius of\nRNS = 106 cm, since BLC = B0 (RNS /RLC )3 , setting P = 0.1P−1 sec yields a result of\n1/2\n\nEMAX\n\n8.0νc\n≈\nχ\n\n(εk B12 )3/4 (P−1 )−7/4 GeV\n\n.\n\n(7)\n\nThis scaling is commensurate with that obtained in Eq. (4) of [20]. Clearly EMAX\nrises monotonically as the acceleration locale moves from the light cylinder towards\nthe neutron star surface, due to the rapidly rising inductive B -field. An additional\nelectrostatic decrement factor εk ≤ 1 has been introduced in Eq. (7) to facilitate the\nsubsequent discussion. It is an acceleration efficiency factor, representing the departure\nof Ek below the fiducial, optimistic value of Ek ∼ rΩB/c ; in general it is a function of\nthe altitude parameter χ , the colatitude Θ and the rotator obliquity angle α .\nTo interpret this outer magnetospheric curvature radiation cutoff scaling, Figure 2 displays the phase space corresponding to Eq. (7), plotting log10 Ec versus the appropriate\ncombination of observables P and Ṗ ; in this graph, the cutoff energy Ec serves as a\nproxy for EMAX . For the curvature radiation expectation in an outer gap (OG) near the\n\n\fFIGURE 2. Observed Fermi-LAT pulsar emission cutoff energies as a function of the key outer gap\ncurvature radiation reaction-limited acceleration parameter σOG defined in Eq. (8). The data come\nfrom the First Fermi-LAT Pulsar Catalog [2], with classic spinning-down pulsars (SDPs) in black, and\nmillisecond pulsars (MSPs) in blue, as indicated. The Crab pulsar point from the Fermi dataset is\nhighlighted, noting that its Ec from the MAGIC detection [3] is considerably higher. The diagonal lines\nlabelled with χ = r/RLC values constitute solutions of Eq. (8) for εk = 1 and νc = 1 .\n−1/2 −3/4\n)\nεk\n\nlight cylinder, this is (for χ̂ = χ νc\nlog10\n\nEMAX\n≈ σOG − log10 χ̂ − 0.85 ,\n1 GeV\n\nσOG =\n\n3\n7\nlog10 B12 − log10 P\n4\n4\n\n.\n\n(8)\n\nThe graph is derived from the LAT pulsar data in Tables 1 and 4 of [2]. Since the\nEMAX values appear in a relatively narrow range, with considerable spread in σOG ,\nthere appears to be no clear linear correlation, just the suggestion of one. The diagonal\nlines corresponding to χ̂ = 1, 0.1, 10−2 in the Figure provide an approximate guide\nto read off the scaled altitude. It is clear that this case of maximal Ek cannot quite\naccommodate the turnover energies of the LAT pulsars being attributed to coolinglimited curvature emission within the light cylinder: the observations mandate that the\nelectrostatic decrement lie in the range 0.05 . εk . 1 if χ = 1 . This essentially implies\nacceleration potentials somewhat weaker than the co-rotational benchmark rΩB/c , or\nconsiderably so (i.e., εk . 10−2 ) if the outer gap emission altitude lies well within\nthe light cylinder radius, i.e. χ . 0.1 . This observational diagnostic becomes less\nconstraining if some two-photon pair attenuation is active in the emission region, thereby\nlowering the observed cutoff energy Ec below the curvature radiation EMAX .\n\n\fThe phase space plot in Fig. 2 exhibits a remarkable property - that the youngish,\ndipole-torque spin-down pulsars (SDPs) and old, recycled millisecond pulsars (MSPs)\noccupy the same locale. The x-coordinate, σOG , is an approximate linear function of\nlog10 BLC , and the field BLC is fairly similar for the two populations (see Table 1 of [2],\nand compare Fig. 2 here with their Figure 7 that displays the array of Fermi-LAT pulsar\nεMAX values versus log10 BLC ). This approximate coincidence of BLC values in SDPs and\nMSPs was, of course, well-known for the radio pulsar population. Yet, the clustering of\nthe gamma-ray EMAX around similar values for SDPs and MSPs is a new insight enabled\nby Fermi. It is strongly suggestive that similar physical acceleration locales and radiative\nemission mechanisms operate in the two populations.\nConcluding Remarks: The picture of high altitudes for γ -ray emission in young pulsars\nis now well-established. Yet questions still remain. Is the primary mechanism curvature\nemission, or can small-angle synchrotron radiation contribute significantly to the signal?\nWhat is the role of two-photon pair creation in controlling the range of observed εMAX ?\nDoes magnetic pair production at low altitudes still enhance the multiplicity of pairs\nbeing pumped into surrounding pulsar wind nebulae? These issues will capture the focus\nof theorists in the years to come as the Fermi pulsar legacy further unfolds.\n\nREFERENCES\n1.\n2.\n3.\n4.\n5.\n6.\n7.\n8.\n9.\n10.\n11.\n12.\n13.\n14.\n15.\n16.\n17.\n18.\n19.\n20.\n21.\n22.\n23.\n24.\n25.\n26.\n27.\n28.\n\nAbdo, A., et al. 2009, ApJ, 696, 1084.\nAbdo, A., et al. 2010, ApJ Supp., 187, 460.\nAliu, E., et al. 2008, Science, 322, 1221.\nBaring, M. G. 1988, M.N.R.A.S., 235, 51.\nBaring, M. G. 2004, Adv. Space Res., 33, 552.\nBaring, M. G. 2008, in Proc. CASYS '07 Conference Computing Anticipatory Systems, ed. D. M.\nDubois (AIP Conf. Proc. 1051, New York), p. 53.\nBaring, M. G. & Braby, M. L. 2004, ApJ, 613, 460.\nBaring, M. G. & Harding A. K. 2001, ApJ, 547, 929.\nCheng K. S., Ho C. & Ruderman M. 1986, ApJ, 300, 500.\nDaugherty, J. K. & A. K. Harding 1982, ApJ, 252, 337.\nDaugherty, J. K. & Harding A. K. 1983, ApJ, 273, 761.\nDaugherty, J. K. & Harding A. K. 1996, ApJ, 458, 278.\nErber, T. 1966, Rev. Mod. Phys., 38, 626.\nHarding A. K., Baring, M. G. & Gonthier, P. L. 1997, ApJ, 476, 246.\nJackson, J. D. 1975, Classical Electrodynamics (Wiley and Sons, New York)\nLee, K. J., et al. 2010, M.N.R.A.S., 405, 2103.\nManchester, R. N. & Taylor, J. H. 1977, Pulsars (Freeman, San Francisco).\nMuslimov, A. G. & A. K. Harding 2003, ApJ, 588, 430.\nRazzano, M. & Harding, A. K. 2007, in The First GLAST Symposium, eds. S. Ritz, P. F. Michelson\n& C. Meegan (AIP Conf. Proc. 921) p. 413.\nRomani, R. W. 1996, ApJ, 470, 469.\nRuderman, M. A. & Sutherland, P. G. 1975, ApJ, 196, 51.\nRybicki, G. & Lightman, A. 1979, Radiative Processes in Astrophysics, (Wiley & Sons, New York)\nShibata S. 1995, M.N.R.A.S., 276, 537.\nSturrock, P. A. 1971, ApJ, 164, 529.\nTakata, J., Shibata, S., Hirotani, K. & Chang, H-K. 2006, M.N.R.A.S., 366, 1310.\nWatters, K. P., Romani, R. W., Weltevrede, P. & Johnston, S. 2009, ApJ, 695, 1289.\nZhang, B. & Harding, A. K. 2000, ApJ, 532, 1150.\nZhang L. & Cheng K. S. 1997, ApJ, 487, 370.\n\n\f"}