{"id": "http://arxiv.org/abs/0909.4164v1", "guidislink": true, "updated": "2009-09-23T09:57:56Z", "updated_parsed": [2009, 9, 23, 9, 57, 56, 2, 266, 0], "published": "2009-09-23T09:57:56Z", "published_parsed": [2009, 9, 23, 9, 57, 56, 2, 266, 0], "title": "Galaxies and Cladistics", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0909.1303%2C0909.5131%2C0909.3402%2C0909.1192%2C0909.2216%2C0909.4221%2C0909.4095%2C0909.4479%2C0909.2658%2C0909.4164%2C0909.5394%2C0909.5049%2C0909.2913%2C0909.5052%2C0909.5490%2C0909.2014%2C0909.5663%2C0909.0957%2C0909.4147%2C0909.1115%2C0909.1892%2C0909.0754%2C0909.2582%2C0909.0498%2C0909.4525%2C0909.1527%2C0909.0155%2C0909.4577%2C0909.3514%2C0909.2432%2C0909.1109%2C0909.2337%2C0909.1160%2C0909.2971%2C0909.4062%2C0909.5412%2C0909.4340%2C0909.0202%2C0909.1384%2C0909.5081%2C0909.2123%2C0909.4194%2C0909.3374%2C0909.4393%2C0909.2692%2C0909.3516%2C0909.4628%2C0909.0293%2C0909.1717%2C0909.2560%2C0909.4165%2C0909.2637%2C0909.1420%2C0909.2886%2C0909.4000%2C0909.0935%2C0909.4358%2C0909.2687%2C0909.4594%2C0909.4163%2C0909.2422%2C0909.2578%2C0909.4789%2C0909.3309%2C0909.0617%2C0909.4006%2C0909.1726%2C0909.4973%2C0909.1873%2C0909.2465%2C0909.2535%2C0909.4889%2C0909.1337%2C0909.1069%2C0909.2966%2C0909.2948%2C0909.0563%2C0909.5597%2C0909.0630%2C0909.4529%2C0909.5622%2C0909.2567%2C0909.4866%2C0909.3181%2C0909.4392%2C0909.1176%2C0909.2571%2C0909.1352%2C0909.3002%2C0909.1928%2C0909.4496%2C0909.4048%2C0909.3352%2C0909.3588%2C0909.4778%2C0909.0627%2C0909.3630%2C0909.1470%2C0909.5676%2C0909.5062%2C0909.1886&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Galaxies and Cladistics"}, "summary": "The Hubble tuning fork diagram, based on morphology and established in the\n1930s, has always been the preferred scheme for classification of galaxies.\nHowever, the current large amount of multiwavelength data, most often spectra,\nfor objects up to very high distances, asks for more sophisticated statistical\napproaches. Interpreting formation and evolution of galaxies as a ?transmission\nwith modification' process, we have shown that the concepts and tools of\nphylogenetic systematics can be heuristically transposed to the case of\ngalaxies. This approach, which we call ?astrocladistics', has successfully been\napplied on several samples. Many difficulties still remain, some of them being\nspecific to the nature of both galaxies and their diversification processes,\nsome others being classical in cladistics, like the pertinence of the\ndescriptors in conveying any useful evolutionary information.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0909.1303%2C0909.5131%2C0909.3402%2C0909.1192%2C0909.2216%2C0909.4221%2C0909.4095%2C0909.4479%2C0909.2658%2C0909.4164%2C0909.5394%2C0909.5049%2C0909.2913%2C0909.5052%2C0909.5490%2C0909.2014%2C0909.5663%2C0909.0957%2C0909.4147%2C0909.1115%2C0909.1892%2C0909.0754%2C0909.2582%2C0909.0498%2C0909.4525%2C0909.1527%2C0909.0155%2C0909.4577%2C0909.3514%2C0909.2432%2C0909.1109%2C0909.2337%2C0909.1160%2C0909.2971%2C0909.4062%2C0909.5412%2C0909.4340%2C0909.0202%2C0909.1384%2C0909.5081%2C0909.2123%2C0909.4194%2C0909.3374%2C0909.4393%2C0909.2692%2C0909.3516%2C0909.4628%2C0909.0293%2C0909.1717%2C0909.2560%2C0909.4165%2C0909.2637%2C0909.1420%2C0909.2886%2C0909.4000%2C0909.0935%2C0909.4358%2C0909.2687%2C0909.4594%2C0909.4163%2C0909.2422%2C0909.2578%2C0909.4789%2C0909.3309%2C0909.0617%2C0909.4006%2C0909.1726%2C0909.4973%2C0909.1873%2C0909.2465%2C0909.2535%2C0909.4889%2C0909.1337%2C0909.1069%2C0909.2966%2C0909.2948%2C0909.0563%2C0909.5597%2C0909.0630%2C0909.4529%2C0909.5622%2C0909.2567%2C0909.4866%2C0909.3181%2C0909.4392%2C0909.1176%2C0909.2571%2C0909.1352%2C0909.3002%2C0909.1928%2C0909.4496%2C0909.4048%2C0909.3352%2C0909.3588%2C0909.4778%2C0909.0627%2C0909.3630%2C0909.1470%2C0909.5676%2C0909.5062%2C0909.1886&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The Hubble tuning fork diagram, based on morphology and established in the\n1930s, has always been the preferred scheme for classification of galaxies.\nHowever, the current large amount of multiwavelength data, most often spectra,\nfor objects up to very high distances, asks for more sophisticated statistical\napproaches. Interpreting formation and evolution of galaxies as a ?transmission\nwith modification' process, we have shown that the concepts and tools of\nphylogenetic systematics can be heuristically transposed to the case of\ngalaxies. This approach, which we call ?astrocladistics', has successfully been\napplied on several samples. Many difficulties still remain, some of them being\nspecific to the nature of both galaxies and their diversification processes,\nsome others being classical in cladistics, like the pertinence of the\ndescriptors in conveying any useful evolutionary information."}, "authors": ["Didier Fraix-Burnet"], "author_detail": {"name": "Didier Fraix-Burnet"}, "author": "Didier Fraix-Burnet", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1007/978-3-642-00952-5", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0909.4164v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0909.4164v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "Talk given at the \"12th Evolutionary Biology Meeting\" held in\n  Marseille, France, Sept. 24-26, 2008", "arxiv_primary_category": {"term": "astro-ph.CO", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph.CO", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "astro-ph.IM", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "q-bio.QM", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0909.4164v1", "affiliation": "LAOG", "arxiv_url": "http://arxiv.org/abs/0909.4164v1", "journal_reference": "Evolutionary Biology. Concept, Modeling, and Application,\n  Pontarotti, Pierre (Ed.) (2009) 363-378", "doi": "10.1007/978-3-642-00952-5", "fulltext": "Galaxies and cladistics\nDidier Fraix-Burnet\nOctober 26, 2018\n\narXiv:0909.4164v1 [astro-ph.CO] 23 Sep 2009\n\nLaboratoire d'Astrophysique de Grenoble, UMR5571 CNRS/Université Joseph Fourier\ndidier.fraix-burnet@obs.ujf-grenoble.fr\nOriginal text published in\nEvolutionary Biology. Concept, Modelization and Application , 2009, Pontarotti, P. (Ed.), Springer, pp. 363 − 378\nDOI 10.1007/978-3-642-00952-5\nAbstract\nThe Hubble tuning fork diagram, based on morphology and established in the 1930s, has always been the\npreferred scheme for classification of galaxies. However, the current large amount of multiwavelength data, most\noften spectra, for objects up to very high distances, asks for more sophisticated statistical approaches. Interpreting\nformation and evolution of galaxies as a 'transmission with modification' process, we have shown that the concepts\nand tools of phylogenetic systematics can be heuristically transposed to the case of galaxies. This approach that\nwe call ``astrocladistics'', has successfully been applied on several samples. Many difficulties still remain, some of\nthem being specific to the nature of both galaxies and their diversification processes, some others being classical in\ncladistics, like the pertinence of the descriptors in conveying any useful evolutionary information.\n\n1. Introduction\nGalaxies have been discovered quite recently with respect to the History of Humanity, since it was in 1922 by\nEdwin Hubble. Our own galaxy, called the Milky Way, was rather well known at this epoch. Hubble found that\nthere are indeed many other similar objects situated at very far distances from us, much farther away than the\ndimension of the Milky Way. Galaxies are now known to be fundamental entities of the Universe and can be defined\nas self-gravitating ensemble of stars, gas and/or ≪ dust ≫ (dust being mainly grains for astronomers).\nTypical big galaxies like our own are about 100 000 light-years across. Shapes are basically those defined by\nHubble, that is spiral, elliptical and irregular. This reflects the orbits of the stars that can be distributed in a\ndisk (spirals), in a regular three dimension structure (ellipticals), or in a more disturbed fashion (irregulars). In\nspiral galaxies, density waves create spiral arms, sometimes with a bar-like structure around the centre of the\ngalaxy. These density waves are not necessarily long-lasting, but they tend to concentrate gas and dust so that star\nformation is mostly associated with them.\nSelf-gravitating objects have probably appeared early in the Universe (which age is now established to be 13.7\n109 years), in association with the very slightly inhomogeneous distribution of gravitational matter. The structure\nof the Universe is shaped by the dark energy (70% of the Universe total energy), that causes the expansion, and the\ngravitational field that is fashioned essentially by the dark matter (26%). Galaxies are made up of baryonic matter\nwhich represents only 4% of the composition of the Universe. The primeval inhomogeneities of the gravitational\npotential are observed at the recombination epoch (time when the Universe became transparent at an age of about\n400 000 years) thanks to their thermal radiation that the expansion of the Universe has now \"cooled\" down to 3K\n(e.g. Hinshaw et al. 2009)). These early overdensities have grown up by condensation to form bigger and bigger\nstructures called halos and filaments. The baryonic matter is gravitationally affected by the evolution of the dark\nmatter distribution, and collapses of small scale entities created the first light emitting objects (first stars at about\n400 millions years) whose distribution can be observed now in the infrared (Kashlinsky et al. 2005). Currently,\nmost distant galaxies can be seen at redshifts about 6 or 7, equivalent to distances of about 12 Gyr or 90% of the\nage of the Universe in lookback time. Since the Universe is in expansion, it was denser at these earlier epochs, so\nthat interactions and collisions between self-gravitating objects were frequent. This certainly explains why galaxies\n1\n\n\fobserved at large distances seem rather disturbed and do not fit the Hubble morphological classification (van den\nBergh 1998).\nThere are typically about 108 – 1012 stars in a galaxy. Once formed from the collapse of a cloud of gas and\ndust, stars evolve by themselves depending on their initial mass and chemical composition. The environment has\nvery little effect on them, they essentially never collide, die, nor disappear. Only the most massive ones explode\nas supernovae, injecting into the interstellar medium some of their gas that is enriched in heavy atomic elements\n(\"metallic\", i.e. heavier than Beryllium and Lithium) and leaving a dense remnant that can be a neutron star or a\nsmall black hole.\nGalaxies generally have a lot of gas and dust which properties evolve because of stellar radiation and density\nperturbations. The chemistry of atoms, molecules and grains is local and very complex, but the orbital motions\nrather rapidly homogenize somehow the chemical properties within a galaxy. In particular, the collapse of molecular\nclouds that leads to the formation of stars generally happens more or less simultaneously over a significant fraction\nof the volume of the galaxy. This phenomenon relates global characteristics of galaxies with small scales processes,\nbut it also smears out traces of past localized events.\nThe properties of the three fundamental constituents (stars, gas and dust) fully describe a given galaxy, provided\nwe have access to them at all places in the three dimensions. This implies that the full description of a galaxy\nis already complex. Moreover, any gravitational perturbation, either caused by external passing-by galaxies or by\ninternal interactions, modifies the shape of the galaxy, and possibly properties of gas and dust. Even internal events,\nlike the explosion of many supernovae at nearly the same time or density waves, may have a strong influence. Since\nthere are so many components in a single galaxy, since their mutual interactions through radiation, shock waves,\ngravitational perturbations, chemical and physical processes and so on, are essentially non-linear and chaotic, the\nevolution of a galaxy truly belongs to the complex sciences.\nNowadays, observations are becoming very detailed and numerous. Systematic surveys feed databases comprising\nmillions of galaxies for which we have images and spectra. Big telescopes and very sensitive detectors allow us to\nobserve objects from the distant past (galaxies at high redshifts). This is somewhat reminiscent of paleontology, and\nlike evolutionary biologists, astronomers want to understand the relationships between distant and nearby galaxies,\nlike our own. Strangely enough, the Hubble classification, born from the Hubble diagram, is still frequently used as a\nsupport to describe galaxy evolution, even though it ignores all observables except morphology (i.e. Hernandez and\nCervantes-Sodi 2006, Cecil and Rose 2007). Indeed, the Hubble classification is very successful not only because it is\nsimple but also because the global shape of a galaxy grossly summarizes several physical properties. In particular,\nstar formation is more efficient in disks and it seems that spiral galaxies have also more gas than ellipticals.\nObviously, the distribution of the stellar orbits is related to the history of a galaxy. Numerical simulations are\neasier to make with stars and gravitation only, the gas and dust components requiring more complicated equations\nand much more computer power. Thus, many simulations have shown precisely how the structures of galaxies\ntransform themselves during interactions or merging (Bournaud et al. 2005). For instance, ellipticals have been\nshown to result from the merging of two galaxies of similar masses. However, the inclusion of gas in the simulations\nnow leads to other possible formation scenarii (Bournaud et al. 2007, Ocvirk et al. 2008).\nOther classifications of galaxies are somehow inherited from this morphological Hubble classification and are\nmost often dictated by the instrument used to make the observations of the sample. Correlation plots are used to\nmake crude classification in a very few number of categories (often 2 like blue and red, high and low intensity for\na given wavelength, more or less metallic, ...). This is most of the time sufficient for some physical modelling, but\nit cannot describe the huge diversity of galaxies across the Universe and their now recognized complex history in a\nvery objective and synthetic way.\nThe understanding of galaxy formation and evolution, which we prefer to call galaxy diversification, is a major\nchallenge of contemporary astrophysics. Abandoning the one-parameter classification approach and using all available descriptors means taking a methodological step equivalent to the one biologists took after Adanson and Jussieu\nin the 18th century. Today the tools do exist, and ordination methods, essentially the one of Principal Component\nAnalysis, are being used more often, mainly to automatically separate stars and quasars from galaxies on large\nimages of the sky (e.g. Cabanac et al. 2002). A few attempts to apply clustering methods have been made recently,\nstill with little success in identifying new classes that convince the astronomical community (e.g. Chattopadhyay\n& Chattopadhyay 2006). From our point of view, there are two difficulties here. The first one is that the PCA\ncomponents are non-physical, hence very difficult to interpret and model in the way astrophysicists are used to.\nThe second one, more important in our point of view, is that evolution, an unavoidable fact, is not at all taken\ninto account. By mixing together objects at different stages of evolution, any physical significance of a classification\nis undoubtedly lost. This was precisely our motivation for developing astrocladistics in 2001 (Fraix-Burnet et al\n2006a, 2006b, 2006c).\n\n\f2. The astrocladistics project\n2.1 A phylogenetic framework for the galaxies\nAs we have seen in the Introduction (Sect. 1), the baryonic matter is immersed in the gravitational field that is\nshaped by the dominating dark matter. Even though its nature is totally unknown, the dark matter is supposedly\naffected only by gravitation. This is a relatively simple physics and it enabled the first numerical simulations of the\ncosmological evolution of the gravitational field in the expanding Universe from the observed primordial fluctuations\nup to the present time. Since matter attracts matter, tiny overdensities, called halos, progressively grow in mass\nand size by merging together. This is the hierarchical model of formation of the large structures in the Universe.\nThe evolution of dark matter halos is generally represented by a \"merger tree\", a typical one being shown on\nFig. 1a (Stewart et al. 2008). Many small halos at the top (redshift of about 7 equivalent to about 13 Gyr ago)\nof the tree merge while time goes downward to yield large dark matter halos observed in galaxy clusters. These\nmerger trees indeed represent the genealogy of a single halo. A schematic representation these trees is often used,\nbut they tend to suggest that small halos disappear with time. This is not true, and the tree on Fig. 1a clearly\nshows that some of them \"survive\". Hence, at any epoch in the Universe, halos of different sizes with different\nmerging histories coexist.\nFrom the astrocladistics point of view, the hierarchical evolution of the dark matter halos is better represented\non a phylogenetic tree, where mass (or size) is the only criterion for diversity (Fig. 1b). This tree describes the\nevolution of the environment in which galaxies form and evolve.\nGalaxies are made up of baryonic matter which is sensitive to gravitation, but also to electromagnetic, weak and\nstrong interactions, as well as radiation and thermodynamics. Its physics is thus very complex and there are many\nprocesses that can strongly affect its gravitational behaviour. Probably because of the first cosmological numerical\nsimulations that were able to take the sole gravitation into account, galaxies are generally thought of as being at\nthe center of dark matter halos. As a consequence, the hierarchical formation scenario seems to apply naturally to\ngalaxies, and has been very popular up to now (e.g. Baugh 2006, Avila-Reese 2007).\nHowever, the old formation scenario for galaxies, called the monolithic model, gains new consideration thanks to\nnew numerical simulations and observations. This model indeed describes the collapse of a cloud of gas, and includes\nall the necessary physics which is not included in the pure hierarchical model. Merging of galaxies does exist, but\nit cannot be of the same nature as for the dark matter since the gravitational energy can be transformed into heat,\nshocks or radiation. Consequently, the diversification of galaxies cannot follow the same simple hierarchical scenario\nas that of the dark matter represented on Fig. 1.\nAstrocladistics makes it clear that the formation and the evolution of galaxies, governed by a complex physics,\noccur in an environment whose evolution, distinct and largely independent, is governed by the sole gravitation.\nGalaxies interact between each other while they move in the gravitational field shaped by the dark matter. To a\nfirst approximation, galaxies can be good tracers of the dark matter, but as recent observations show, the two can\nsometimes be well disconnected.\nIt is still difficult to tell what the very first objects were. Since the Universe was essentially homogeneous at the\nrecombination epoch, the primordial gas was certainly not very clumpy. With time, with the growth of the tiny\ninitial fluctuations in dark matter halos, gas density began to increase in some places. When these seeds became\ngravitationally bound, we could call them galaxies. It is probable that the first stars formed very rapidly during\nthis process. These very first galaxies were probably already quite diverse in mass content (gas/stars) but very\nsimilar otherwise. They also subsequently merged rapidly, interacted strongly with their neighbours, forming new\nand still more diverse objects. The expansion of the Universe definitively separated large regions that make what\nwe call superclusters and clusters of galaxies. These can be seen as islands in which the corresponding populations\nof galaxies have evolved on their own, possibly creating some evolutionary divergence.\nHowever, the physics is the same everywhere (cosmological principle), the environment is purely gravitational\nand differs from place to place only by its shape in the curved space-time. We thus expect a lot of similarities\nbetween different \"populations\" of galaxies due to convergent and parallel evolutions. Unfortunately, our quest to\nunderstanding diversification is somewhat complicated by the finite velocity of light. We have not access to the\nentire Universe, hence to the entire galaxy diverstiy, that is contemporary to us because when galaxies are a bit far\naway, we see them as they where when the light was emitted. We are like paleontologists, except that we do not\nhave access to the entire present diversity. Nonetheless recent observations seem to suggest that galaxy evolution\nhas been very gentle in the last 1Gyr or so.\n\n\fFigure 1: (a) A \"typical\" merger tree for an individual dark matter halo with mass ≃ 1012.5 solar masses at present\ntime (redshift=0). Time progresses downward, with the redshift printed on the left hand side. The bold, vertical\nline at the center corresponds to the main progenitor, with filled circles proportional to the radius of each halo. The\nminimum mass halo shown in this diagram has m = 109.9 solar masses. Solid and dashed lines and circles correspond\nto isolated field halos, or subhalos, respectively. The dashed lines that do not merge with main progenitor represent\nsurviving subhalos at z = 0. Such trees are indeed genealogical trees for individual halos. Taken from Stewart et al\n2008 and reproduced by permission of the AAS. (b) The corresponding phylogenetic tree as seen by astrocladistics.\nThere is no time scale in this representation. Mass or size is the sole diversification criterion and increases downward.\nEach bifurcating node corresponds to a merger event and indicates the first occurrence in the Universe of a halo of\na given mass. The chronology thus goes from left to right.\n\n2.2 Transmission with modification among galaxies\nGalaxy formation is now acknowledged to occur continuously during the Hubble time (Hoopes et al. 2007). In\nextragalactic astrophysics, evolution and formation are generally not clearly distinguished. Indeed, galaxy evolution\nis more like galaxy transformation, that leads to the formation of new kinds of objects. Formation often seems to be\nemployed as if big spiral and elliptical galaxies are at the end of evolution. To our point of view, \"galaxy formation\nand evolution\" can be more precisely called galaxy diversification, in which evolution means transformation and\nformation refers to diversity.\nThere are 5 transformation processes for galaxies: assembling, secular evolution, interaction, accretion/merging,\nejection/sweeping. In all these cases, the fundamental material of a galaxy, stars, gas and dust, is transmitted to the\nnew object, somewhat modified. These modifications are mainly kinematical because the gravitational perturbations\nchange the orbits, hence the distribution of the objects. The stars are otherwise unaffected, except that new ones\ncan be formed from the perturbed gas and dust. These latter two constituents can also be modified in density,\ntemperature and composition.\nSchematically, galaxy diversification can be depicted like in Fig. 2. At a given time, a galaxy undergoes a\ntransformation event to form a new object made with the same constituents but modified. Between two such\n\n\fFigure 2: A schematic view depicting the transmission with modification process in galaxy diversification. For\nany transformation event, gas, dust and stars are transmitted to the new object generally with some modification\nof their properties. Secular evolution is defined as the evolution of a totally isolated galaxy. It thus occurs all the\ntime, and even if it is not violent in general, it can sometimes lead to a significant transformation.\n\nevents, stars get older and essentially cooler (redder). This is part of the secular evolution, which is the evolution\nof a totally isolated galaxy. Secular evolution is a transformation process driven by internal phenomena (stellar\nageing, interaction between the three constituents, density waves, shock waves due to supernovae, instabilities, ...)\nwhich is generally slow and non-violent. However, after a certain time, the galaxy can be so different that it can be\ndescribed as a new object and even belong to a different class of objects. Like for living species, the modifications\nare gradual and at some level of details, the splitting in different species is somewhat arbitrary. Thus, secular\nevolution can also be a transformation event participating to the diversification of galaxies.\nFigure 2 shows that it is possible to see the transformation of galaxies as a transmission with modification process.\nIt is not exactly a darwinian process in the sense that there is no natural selection (even though big galaxies survive\nmore easily and tend to swallow small ones!). Also, there is no duplication, but each transformation process is a\nreplication mechanism, because the new object has inherited all constituents and most of their properties. Since\nthe transformation events are always random, this is equivalent to a replication with \"spontaneous mutations\". In\naddition, the environment, which is gravitational, has a strong influence on the occurrence and properties of all the\ngalaxy transformation processes.\nGalaxy diversification is thus characterized by replication, randomness and environment. It follows a branching\npattern can be expected. This is why cladistics should be applicable to this problem. However, it might not be so\nsimple since mergers are probably frequent at least near the beginning of the Universe, so that reticulation (\"hybridation\" or horizontal transfer) could be present. Cladistic analyses of several samples of galaxies can investigate\nthis. As shown in Fraix-Burnet et al. (2006a, 2006b) and confirmed by all the robust cladograms we have obtained\nso far, reticulation does not seem to be dominant. Yet, this conclusion must be seen as preliminary and more\ninvestigation should be done, particularly with very distant objects.\n\n3. Applying cladistics to galaxies\nAstrophysics is an observational science, not an experimental one. It is not possible to weigh a galaxy or to return\nit to see what is behind. We simply collect photons, at all wavelengths (from gamma-rays and X-rays to the radio\ndomain, with the ultraviolet, optical, infrared, far-infrared and sub-mm in between), that are emitted by every\ncomponent at every place in a galaxy. The level of details is limited by the faintness and the small apparent\nprojected size of the objects, particularly those at very high distances from us. Both improve with the diameter\nof the photon collector (the mirror of the telescope) and with the sensitivity of the detectors. Requirements for\nthe astronomical observations are a strong thrust for technology research and development, and recent progresses\nin this domain have changed the scale in the amount of data concerning galaxies. But still, each picture element\n(\"pixel\", i.e. the smallest detail) is a mixture of the light emission from many stars and gas/dust clouds situated\nalong the line of sight and across a region which size depends on the distance of the galaxy.\nBasically, observations result in the recording of spectra. Apart from the structure, given by imagery or relative\nspatial positioning, spectra contain all the physical and chemical information that is possible to get from remote\nobjects. Systematic surveys of the sky now provide spectra for millions of galaxies. However, in addition to the\nlimitations mentioned above, there are limits coming from the spectral resolution of the detectors and from Doppler\neffects due to the differential motions of the galaxy components that enlarge and blur absorption and emission lines.\nAs a consequence, physical and chemical conditions at each part of a galaxy are always partial and averaged.\nMeasuring characteristics from spectra is also not sufficient to derive physical or chemical quantities, some\n\n\fcombinations must be used like ratios of several emission lines. Moreover, models must most often be used to\ndisentangle the complexity of the emitting region and to translate spectral information into physical quantities.\nUnfortunately, these models necessarily introduce some subjectivity. Thus, truly intrinsic descriptors of galaxies\nare not easy to obtain, and this is certainly a specific difficulty of astrocladistics.\nAnyhow, descriptors in extragalactic astrophysics are always continuous variables since, apart from spectral\ninformation, the other information we can measure is the dimension (size and position of individual components\nwithin the galaxy). The only exception is the morphology. It is traditionally based on the Hubble classification\nrepresented by the Hubble diagram, most often with the use of a discrete scale distinguishing different kinds of\nelliptical and spiral galaxies. However, in our astrocladistic project, we have chosen not to use this parameter for\nseveral reasons. The first one is that this is a very crude way of discretizing a shape parameter because it is essentially\nmade by eye. The second reason is that this discretization is not homogeneous in the sense that differences between\nspirals are given the same weight as between ellipticals, while they are not of the same nature (shape and number\nof the spiral arms which are density waves, not physical structures, for the first ones, and estimation of roundness\nfor the latter ones ; de Vaucouleurs 1994). The third reason is that it is not clear at what level this descriptor\ncan be informative regarding evolution. Finally, we know that the Hubble classification is correlated with quite a\nfew global properties of galaxies (kinematics, amount of gas and star formation most notably), so it is certainly\nredundant with other descriptors, quantitative and objective, coming from the spectrum.\nFor such an exploratory project like astrocladistics, choices have to be made right at the beginning to focalize\nthe research. Up to now, we have chosen to discretize all observables into 10 or 30 bins, depending on the error bars\nestimated by the observers and on the distribution of values among the sample. This allows us to use parsimony\nas the optimisation criterion, which seems to be the simplest strategy to implement for a cladistic analysis. These\nfirst choices already enabled us to obtain very positive results. Other paths can now be explored.\nLast but not least, we do not have a multivariate classification of galaxies at our disposal. We have to assume\nthat each galaxy represents a \"species\" that will have to be defined later on. It is consequently difficult to define an\noutgroup that is necessary to root the tree and help the interpretation of the evolutionary scenario. Most generally,\nwe root the trees with the object that is the less metallic, that is in which the relative abundance of heavy atomic\nelements is the lowest (heavy elements are only produced in stars, and cannot be primordial). But we are aware\nthat this choice is made on one character only.\n\n4. The first extragalactic trees\nThe first application of astrocladistics was performed on a sample of galaxies issued from a cosmology simulation.\nThis work used 50 objects and 50 characters (observables), corresponding to 5 \"lineages\" sampled at 10 epochs.\nIn such simulations, each entity, called a galaxy, that appears, is given a number. Only accretion or merging are\nconsidered, and a new number is attributed each time such an event occurs. It is then easy to follow the tree of\ntransformations of an initial galaxy into its different descendants. The simulations calculate the radiation from\ngalaxies and transpose it into the same observables as obtained from real telescopes. This work was intended to\nillustrate the concepts and practical methodology of astrocladistics, and to show how the correct ``genealogy'' can\nbe reconstructed (Fraix-Burnet et al. 2006a, 2006b) from usual observables.\nMore importantly, a small sample of real galaxies (Dwarf Galaxies of the Local Group, 36 objects, 24 characters)\nhave also successfully been analysed, providing the first evolutionary galaxy tree ever established (Fraix-Burnet et\nal. 2006c). These dwarf galaxies are very numerous throughout the Universe. Most of them are satellites of big\ngalaxies like our own. They supposedly have been the first galaxies at the beginning of the Universe and are thus\nbelieved to be the building blocks that merged to make bigger and bigger galaxies. A fully resolved tree obtained on\na subset is represented in Fig. 3. Bootstrap and decay values indicated at the nodes show that it is very robust. The\ngroupings are consistent with our current knowledge of these particular objects, with a more refined classification.\nThis tree clearly implies that the nature of the ancestors are of irregular shape. The other type, the spheroidals, are\nconsequently more evolved. This question is debated in the astrophysical community and is naturally addressed by\nastrocladistics in a multivariate way. It is important to note that the characters used in this analysis are a mixture\nof observables (like colours, fluxes in different spectral lines and composition ratios) and derived quantities (like\nmasses, maximum rotational velocities, velocity dispersion, star formation rate). Such kind of information is more\ndifficult to obtain with other more distant galaxies.\nWe subsequently performed a cladistic study of 222 galaxies of the Virgo cluster using 41 characters that were\nall observables. Because of too many unknown parameters, we were able to build a robust tree for 123 objects only,\nand used it to construct a supertree. Figure 4 shows the cladogram with 123 galaxies. It took us some time to\nunderstand the astrophysical consequence of the regularity of the (largely unbalanced) tree that is also found on\n\n\fFigure 3: Cladogram of 14 Dwarf galaxies of the Local Group obtained with 24 characters (observables and derived\nquantities). Bootstrap values (above) and Decay indices (below) are indicated for each node. The outgroup (SagDig)\nhas been chosen because it contains the lowest amount of metallic material, suggesting that it is made up of more\nprimordial material (see Fraix-Burnet et al 2006c for details on this work). Image credits: NGC 55 : David Malin;\nLGS 3 and Pegasus DIG: Deidre A. Hunter; Antlia: Mike Irwin; NGC 185: David M. Delgado; NGC 147: Walter\nNowotny; Sag Dig: Hubble Heritage Team (AURA / STScI), Y. Momany (U. Padua) et al., ESA, NASA; Leo A,\nSextans B, IC 1613 and IC 10: Corradi, R.L.M. et al., 2003, ING Newsletter No. 7, p. 11; NGC 3109: NASA/\nSTScI; Phoenix: Knut Olsen (CTIO) & Phillip Massey (Lowell Observatory), (NOAO / CTIO / KPNO); NGC 205:\nAtlas Image [or Atlas Image mosaic] courtesy of 2MASS/UMass/IPAC-Caltech/NASA/NSF.\n\nthe supertree. In fact, this is due to the sole stellar evolution which is hidden in nearly all of the observables. It\nis consequently highly redundant and dominant in this multivariate analysis. The astrophysical outcome is thus\nslightly disappointing. We obtained similar results on other samples: poor gas galaxies of the field (comprising 227\nobjects and 37 characters), galaxies from a big survey (500 objects with 60 characters analysed so far).\nFrom the astrocladistic point of view, all these studies shows that our approach is successful in constructing\ncladograms of galaxies in several different types of samples. Nevertheless, the regular trees found when using solely\nobservables reveal that stellar evolution is universally present and acts as a parallel evolution. It does not bring much\ninformation on galaxy diversity, and disturbs the multivariate analyses. We call it \"cosmic evolution\" because it is\nuniversal and does not lead to a sufficient transformation of the galaxy, like secular evolution in general or the other\ntransformation processes. Even in the most violent cases, a given stellar population continues to age unperturbed\nand its radiation properties are unaffected unless the population itself is changed for instance with the addition\nof newborn stars. Somehow, we could think the cosmic evolution as a kind of ontogeny for galaxies. We looked\nfor a way to remove it from the observables because it obviously hampers the search for \"speciation\". We used\nvarious synthetic stellar populations, modelling artificial lineages with specific properties. We restricted ourselves\nto small samples (30 objects). Our idea was to scrutinize each observable in a very well controlled sample. By\n\n\fVCC 0664\nVCC 0324\nVCC 1699\nVCC 0491\nVCC 0459\nVCC 1791\nVCC 1554\nVCC 1725\nVCC 1356\nVCC 0552\nVCC 1091\nVCC 1686\nVCC 0162\nVCC 1678\nVCC 2037\nVCC 1569\nVCC 2033\nVCC 0699\nVCC 0971\nVCC 0787\nVCC 0975\nVCC 0848\nVCC 1450\nVCC 1758\nVCC 0465\nVCC 1189\nVCC 1410\nVCC 0827\nVCC 0801\nCG014034\nVCC 1393\nVCC 1205\nCG043034\nVCC 1524\nVCC 1929\nVCC 0865\nVCC 0066\nCG043071\nVCC 0849\nVCC 1581\nVCC 0809\nVCC 1508\nVCC 0221\nVCC 1486\nVCC 0024\nVCC 1193\nVCC 0957\nVCC 1532\nVCC 0692\nVCC 1675\nVCC 0938\nVCC 0382\nCG043093\nVCC 1575\nVCC 0836\nVCC 0187\nVCC 0025\n\nVCC 0921\nVCC 1987\nCG071060\nVCC 1811\nVCC 1379\nVCC 0058\nVCC 0939\nVCC 0145\nVCC 0131\nVCC 0667\nVCC 0851\nVCC 1118\nVCC 0688\nVCC 0979\nVCC 1290\nVCC 0508\nVCC 0307\nVCC 0912\nVCC 0655\nVCC 1932\nVCC 0152\nVCC 0157\nVCC 1972\nVCC 1002\nVCC 1516\nVCC 1588\nVCC 0393\nVCC 0089\nVCC 0483\nCG100004\nVCC 2066\nVCC 0226\nVCC 0874\nVCC 2058\nVCC 0073\nVCC 1676\nVCC 1868\nVCC 1943\nVCC 0092\nVCC 0559\nVCC 0873\nVCC 1859\nVCC 1086\nVCC 0656\nVCC 1196\nVCC 1540\nVCC 1690\nVCC 1145\nVCC 0758\nVCC 1401\nVCC 1730\nVCC 0958\nVCC 0857\nVCC 1615\nVCC 1727\nVCC 1110\nVCC 1043\nVCC 1619\nVCC 0792\nVCC 1630\nVCC 1030\nVCC 0685\nVCC 0369\nVCC 0355\nVCC 2070\nVCC 0167\n\nFigure 4: Cladogram for 123 galaxies of the Virgo cluster with 41 observables. Note the regularity of the tree\nindicating the cosmic evolution (star ageing) which is highly redundant.\n\n\ftrials and errors, we found some combinations of several observables that make the corrected characters to remain\nessentially constant between transformation events (Fraix-Burnet et al. in prep). The physical interpretation of\nthese corrected characters is still unclear, but the important result is that they lead to physically consistent clades\nfor these simple synthetic stellar populations. Application to real objects is under progress.\nGlobular clusters are self-gravitating ensembles of stars without dust or gas. In a sense, they are simple galaxies,\nsomehow like our synthetic stellar populations. Taking advantage of our experience gained so far, we performed a\ncladistic analysis of 54 globular clusters of our Galaxy by choosing 4 properties. Three of them are intrinsic and\ncomes from their conditions of formation. They are not affected by cosmic evolution. The other one is the colour\nand measures the age of the stars, it is thus a direct indicator of the cosmic evolution. We gave it a weight half of\nthe other ones, and effectively rank the clusters chronologically within the lineages or groupings that are defined by\nthe other three characters. Our result tree gathers the objects in a new classification that brings a very convincing\nscenario for the formation of these objects and consequently for some episodes in the building up of our own galaxy.\nThis result is the first spectacular outcome of astrocladistics and will hopefully convince more astronomers to invest\nin this novel approach (Fraix-Burnet, Davoust & Charbonnel 2009).\n\n5. Some open questions\nIt is now clear that cladistics can be applied and be useful to the study of galaxy diversification. Many difficulties,\nconceptual and practical, have been solved, but many remain in the exploration of this large research field. To\nbegin with, it is well possible that probabilistic methods, instead of parsimony, might be better suited for the\nquantitative nature of the variables and the evolution of galaxies. In this respect, the use of the continuous data\nwithout discretization will have to be investigated seriously, even with parsimony (Wiens 2001, MacLeod 2002,\nGoloboff et al. 2006, Gonzàlez-Rosé et al. 2008).\nThere are difficulties that seem to be intrinsic to astrophysics. Most notably, we have millions of objects, but a\nfew tens of descriptors. Of course the situation will improve with time, in particular with integral-field spectroscopy\n(spectra of detailed regions in the galaxy, e.g. Ensellem et al. 2007). Spectra might not be currently employed at\ntheir full capacity of description. But it is not clear whether they would lead to the discrimination of hundreds\nof classes. Perhaps this is an erroneous target, perhaps galaxies cannot be classified with such a refinement. But\nthis is already a matter of using multivariate clustering methods and interpreting their results usefully. We are\nconvinced that improvements can be made here. In any case, cladistics is supposed to identify clades, that are\nevolutionary groups, whereas the concept of \"species\" is not defined at all in astrophysics, and we have even not\nconverged toward groupings based on multivariate analyses.\nThis is probably more than a conceptual question because clustering with continuous data and large intraspecific\nvariance is a very complicated problem in itself. Sophisticated statistical tools must be used, but the question of\ncharacterizing the groups in this context is not very clear to us at this time. This probably requires a different\nculture that is not yet present in astrophysics. Incidentally, this also points to the relevance of discretization we\nhave used so far particularly when measurement uncertainties are sometimes quite large. Our results definitively\nshow that we are not wrong, but it might be possible to do better.\nThe possible predominance of reticulation is a concern for cladistics in general, and we foresee to investigate\nthis question very soon. In some ways, galaxy diversification has similarities with bacteria diversification for which\nreticulation methods have been considerably developed recently. We intend to take advantage of these advances.\nIt would already be interesting to detect some reticulation in the samples we have studied so far. The equivalent\nof hybridation or horizontal transfer certainly comes through the merging of two galaxies. Since the Universe is\nin expansion, object density was higher at earlier times, and interactions and merging were more common. As a\nconsequence, reticulation could be a problem for distant galaxies, that is when the Universe was young.\nA very important step for astrocladistics is our assessment of the influence of the cosmic evolution and our\nability to correct for it or avoid it in the character selection. But there are probably other kinds of parallel or\nconvergent evolutions, and reversals as well. Hence, we are now concentrating our efforts on finding the most\npertinent descriptors. For this we must detail all the possible quantities we can get from the observations, to see\nhow they behave during the different transformation processes and whether they can be reliable tracers of past\nevents from a cladistic point of view. Biologists pretty well know that this is a crucial work, apparently without an\nend.\n\n\f6. Conclusion\nThe astrocladistic project has now reached a solid base as far as concepts and tools are concerned. First results\nhave shown the usefulness of this approach, and unavoidable difficulties are being solved one after one. This triggers\nthe hope of being able to map galaxy evolution from the very first objects of the Universe, some 14 Gyr ago, but\nthere is still a long way to go. Astrocladistics opens a new way to analyse galaxy evolution and a path towards a\nnew systematics of galaxies.\nExtragalactic astrophysics is currently undergoing a scaling revolution. The number of objects and the amount\nof data it has to cope with already impose new statistical tools to be used, and this will certainly get worse with\nstill bigger telescopes and more sensitive detectors. Less than a century after their discoveries, galaxies come by\nmillions in our databases. This is a cultural revolution, in particular because the complexity of these objects and\ntheir evolution become more obvious.\nAstrocladistics is fascinating in combining a multivariate statistical philosophy with evolutionary concepts. It\nis fascinating as an interdisciplinary research field. But it is also quite a difficult approach, not intuitive at all,\nand does not fit well in the usual methods of physicists. This is a huge research field, very exploratory, with\nmany possible paths to follow. We still lack spectacular astrophysical outcomes, but most astrophysicists are very\nenthusiastic, because they agree that there is an obvious need for multivariate and evolutionary methods to study\ngalaxy diversification.\n\nReferences\nAvila-Reese V. (2007) Understanding Galaxy Formation and Evolution. Ap&SS Proceedings, Solar, stellar and\ngalactic connections between particle physics and astrophysics, Carramiñana A, Guzmán F S, Matos T (eds),\nSpringer (2007), 115-165. http://arxiv.org/abs/astro-ph/0605212\nBaugh C.M. (2006) A primer on hierarchical galaxy formation: the semi-analytical approach. Reports on Progress\nin Physics, Volume 69, Issue 12, 3101-3156. http://arxiv.org/abs/astro-ph/0610031\nBournaud F., Jog C.J., Combes F. (2005) Galaxy mergers with various mass ratios: Properties of remnants.\nAstronomy and Astrophysics 437, 69-85. http://arxiv.org/abs/astro-ph/0503189\nBournaud F., Jog C.J., Combes F. (2007) Multiple minor mergers: formation of elliptical galaxies and constraints\nfor the growth of spiral disks. Astronomy and Astrophysics 476, 1179-1190. http://arxiv.org/abs/0709.3439\nCabanac RA, de Lapparent V, Hickson P (2002) Classification and redshift estimation by principal component\nanalysis. Astronomy & Astrophysics 389, 1090–1116. http://arxiv.org/abs/astro-ph/0206062\nCecil G., Rose J.A. (2007) Constraints on Galaxy Structure and Evolution from the Light of Nearby Systems.\nRep. Prog. Phys. 70, 1177-1258. http://arxiv.org/abs/0706.1332v2\nChattopadhyay T., Chattopadhyay A.K. (2006) Objective classification of spiral galaxies having extended rotation\ncurves beyond the optical radius. The Astronomical Journal 131, 2452–2468.\nde Vaucouleurs G. (1994) Global Physical Parameters of Galaxies. In: Quantifying Galaxy Morphology at High\nRedshift. Space Telescope Science Institute (Baltimore, USA), April 27-29 1994.\nhttp://www.stsci.edu/institute/conference/galaxy-morphology/program2.html.\nEmsellem E., Cappellari M., Krajnović D., van de Ven G. , Bacon R., Bureau M., Davies R.L., de Zeeuw\nP.T., Falcón-Barroso J., Kuntschner H., McDermid R., Peletier R.F., Sarzi M. (2007) The SAURON project\n– IX. A kinematic classification for early-type galaxies. Mon. Not. R. Astron. Soc. 379, 401-417.\nhttp://arxiv.org/abs/astro-ph/0703531v3\nFraix-Burnet D, Choler P, Douzery E, Verhamme A (2006a) Astrocladistics: a phylogenetic analysis of galaxy\nevolution. I. Character evolutions and galaxy histories. Journal of Classification 23, 31-56.\nhttp://arxiv.org/abs/astro-ph/0602581\nFraix-Burnet D, Douzery E, Choler P, Verhamme A (2006b) Astrocladistics: a phylogenetic analysis of galaxy\nevolution. II. Formation and diversification of galaxies. Journal of Classification 23, 57-78.\nhttp://arxiv.org/abs/astro-ph/0602580\n\n\fFraix-Burnet D, Choler P, Douzery E (2006c) Towards a Phylogenetic Analysis of Galaxy Evolution : a Case\nStudy with the Dwarf Galaxies of the Local Group, Astronomy & Astrophysics 455, 845-851.\nhttp://arxiv.org/abs/astro-ph/0605221\nFraix-Burnet, D., Davoust, E., Charbonnel, C. (2009) The environment of formation as a second parameter for\nglobular cluster classification. Monthly Notices of the Royal Astronomical Society, in press.\nhttp://fr.arxiv.org/abs/0906.3458\nGoloboff P.A., Mattoni C.I., Quinteros A.S. (2006) Continuous characters analyzed as such. Cladistics 22, 589–601.\nGonzàlez-José R., Escapa I., Neves W.A., Cúneo R., Pucciarelli H.M. (2008) Cladistic analysis of continuous\nmodularized traits provides phylogenetic signals in Homo evolution. Nature 453, 775-779.\nHernandez X, Cervantes-Sodi B (2006) A dimensional study of disk galaxies. 11th Latin-AmericanRegional IAU\nMeeting 2005, RevMexAA (Serie de Conferencias), 26, 97–100. http://arxiv.org/abs/astro-ph/060225\nHinshaw G., Weiland J.L., Hill R.S., Odegard N., Larson D., Bennett C.L., Dunkley J., Gold B., Greason M.R.,\nJarosik N., Komatsu E., Nolta M.R., Page L., Spergel D.N., Wollack E., Halpern M., Kogut A., Limon\nM., Meyer S.S., Tucker G.S., Wright E.L. (2009) Five-Year Wilkinson Microwave Anisotropy Probe (WMAP)\nObservations: Data Processing, Sky Maps, and Basic Results. Astrophysical Journal Supplements180:225-245.\nhttp://arxiv.org/abs/0803.0732\nHoopes C.G., Heckman T.M., Salim S. et al. (2007) The Diverse Properties of the Most Ultraviolet-Luminous\nGalaxies Discovered by GALEX. Astroph. J. Suppl. Series 173, 441–456.\nhttp://arxiv.org/abs/astro-ph/0609415\nKashlinsky A., Arendt R.G., Mather J., Moseley S.H. (2005) Tracing the first stars with fluctuations of the cosmic\ninfrared background. Nature 438, 45-50. doi:10.1038/nature04143\nMacLeod N. (2002). Phylogenetic signals in morphometric data, pp. 100-138. In: MacLeod N., and Forey, P.L.\n(eds.), Morphology, Shape, and Phylogeny. Taylor & Francis, London.\nOcvirk P., Pichon C., Teyssier R. (2008) Bimodal gas accretion in the Horizon-MareNostrum galaxy formation\nsimulation. Mon. Not. R. Astron. Soc. 390, 1326-1338.\nStewart K.R., Bullock J.S., Wechsler R.H., Maller A.H., Zentner A.R. (2008) Merger Histories of Galaxy Halos and\nImplications for Disk Survival. The Astrophysical Journal 683, 597-610. http://arxiv.org/abs/0711.5027\nvan den Bergh, S. (1998) Galaxy Morphology and Classification. Cambridge University Press\nWiens J.J. (2001) Character Analysis in Morphological Phylogenetics: Problems and Solutions. Syst. Biol. 50,\n689–699.\n\n\f"}