{"id": "http://arxiv.org/abs/1110.0884v1", "guidislink": true, "updated": "2011-10-05T02:54:32Z", "updated_parsed": [2011, 10, 5, 2, 54, 32, 2, 278, 0], "published": "2011-10-05T02:54:32Z", "published_parsed": [2011, 10, 5, 2, 54, 32, 2, 278, 0], "title": "Detonative Propagation and Accelerative Expansion of the Crab Nebula\n  Shock Front", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1110.6839%2C1110.2758%2C1110.5583%2C1110.1782%2C1110.4214%2C1110.2286%2C1110.0683%2C1110.5994%2C1110.5975%2C1110.4070%2C1110.5246%2C1110.3388%2C1110.0884%2C1110.3794%2C1110.5926%2C1110.3597%2C1110.4547%2C1110.2534%2C1110.5339%2C1110.3384%2C1110.5059%2C1110.2093%2C1110.4287%2C1110.5292%2C1110.2060%2C1110.6368%2C1110.0176%2C1110.5540%2C1110.0753%2C1110.4510%2C1110.6426%2C1110.1017%2C1110.2277%2C1110.1558%2C1110.5514%2C1110.4833%2C1110.5260%2C1110.1519%2C1110.1198%2C1110.4771%2C1110.3857%2C1110.5261%2C1110.6874%2C1110.5598%2C1110.6567%2C1110.3153%2C1110.4470%2C1110.5288%2C1110.6751%2C1110.2766%2C1110.2762%2C1110.0232%2C1110.5037%2C1110.2052%2C1110.3903%2C1110.2064%2C1110.3036%2C1110.2026%2C1110.1261%2C1110.1416%2C1110.3444%2C1110.5769%2C1110.3617%2C1110.5248%2C1110.4227%2C1110.2323%2C1110.4856%2C1110.2081%2C1110.1653%2C1110.2282%2C1110.1419%2C1110.4864%2C1110.1413%2C1110.1585%2C1110.2968%2C1110.4971%2C1110.3944%2C1110.6859%2C1110.5372%2C1110.0357%2C1110.0568%2C1110.4253%2C1110.0017%2C1110.2013%2C1110.0354%2C1110.1616%2C1110.3185%2C1110.0473%2C1110.4276%2C1110.1597%2C1110.6144%2C1110.4782%2C1110.2706%2C1110.6595%2C1110.1001%2C1110.5373%2C1110.5343%2C1110.0977%2C1110.3546%2C1110.2783%2C1110.3813&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Detonative Propagation and Accelerative Expansion of the Crab Nebula\n  Shock Front"}, "summary": "The accelerative expansion of the Crab nebula's outer envelope is a mystery\nin dynamics as a conventional expanding blast wave decelerates when bumping\ninto the surrounding interstellar medium. Here we show that the strong\nrelativistic pulsar wind bumping into its surrounding nebula induces\nenergy-generating processes and initiates a detonation wave that propagates\noutward to form the current outer edge, namely the shock front, of the nebula.\nThe resulting detonation wave, with a reactive downstream, then provides the\nneeded power to maintain propagation of the shock front. Furthermore,\nrelaxation of the curvature-induced reduction of the propagation velocity from\nthe initial state of formation to the asymptotic, planar state of\nChapman-Jouguet propagation explains the observed accelerative expansion. The\nessential role of detonative propagation in the structure and dynamics of the\nCrab nebula offers potential richness in incorporating reactive fronts in the\ndescription of various astronomical phenomena.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1110.6839%2C1110.2758%2C1110.5583%2C1110.1782%2C1110.4214%2C1110.2286%2C1110.0683%2C1110.5994%2C1110.5975%2C1110.4070%2C1110.5246%2C1110.3388%2C1110.0884%2C1110.3794%2C1110.5926%2C1110.3597%2C1110.4547%2C1110.2534%2C1110.5339%2C1110.3384%2C1110.5059%2C1110.2093%2C1110.4287%2C1110.5292%2C1110.2060%2C1110.6368%2C1110.0176%2C1110.5540%2C1110.0753%2C1110.4510%2C1110.6426%2C1110.1017%2C1110.2277%2C1110.1558%2C1110.5514%2C1110.4833%2C1110.5260%2C1110.1519%2C1110.1198%2C1110.4771%2C1110.3857%2C1110.5261%2C1110.6874%2C1110.5598%2C1110.6567%2C1110.3153%2C1110.4470%2C1110.5288%2C1110.6751%2C1110.2766%2C1110.2762%2C1110.0232%2C1110.5037%2C1110.2052%2C1110.3903%2C1110.2064%2C1110.3036%2C1110.2026%2C1110.1261%2C1110.1416%2C1110.3444%2C1110.5769%2C1110.3617%2C1110.5248%2C1110.4227%2C1110.2323%2C1110.4856%2C1110.2081%2C1110.1653%2C1110.2282%2C1110.1419%2C1110.4864%2C1110.1413%2C1110.1585%2C1110.2968%2C1110.4971%2C1110.3944%2C1110.6859%2C1110.5372%2C1110.0357%2C1110.0568%2C1110.4253%2C1110.0017%2C1110.2013%2C1110.0354%2C1110.1616%2C1110.3185%2C1110.0473%2C1110.4276%2C1110.1597%2C1110.6144%2C1110.4782%2C1110.2706%2C1110.6595%2C1110.1001%2C1110.5373%2C1110.5343%2C1110.0977%2C1110.3546%2C1110.2783%2C1110.3813&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The accelerative expansion of the Crab nebula's outer envelope is a mystery\nin dynamics as a conventional expanding blast wave decelerates when bumping\ninto the surrounding interstellar medium. Here we show that the strong\nrelativistic pulsar wind bumping into its surrounding nebula induces\nenergy-generating processes and initiates a detonation wave that propagates\noutward to form the current outer edge, namely the shock front, of the nebula.\nThe resulting detonation wave, with a reactive downstream, then provides the\nneeded power to maintain propagation of the shock front. Furthermore,\nrelaxation of the curvature-induced reduction of the propagation velocity from\nthe initial state of formation to the asymptotic, planar state of\nChapman-Jouguet propagation explains the observed accelerative expansion. The\nessential role of detonative propagation in the structure and dynamics of the\nCrab nebula offers potential richness in incorporating reactive fronts in the\ndescription of various astronomical phenomena."}, "authors": ["Yang Gao", "Chung K. Law"], "author_detail": {"name": "Chung K. Law"}, "author": "Chung K. Law", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevLett.107.171102", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1110.0884v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1110.0884v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "5 pages, 3 figures, accepted for publication in PRL", "arxiv_primary_category": {"term": "astro-ph.SR", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph.SR", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1110.0884v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1110.0884v1", "journal_reference": null, "doi": "10.1103/PhysRevLett.107.171102", "fulltext": "Detonative Propagation and Accelerative Expansion of the Crab Nebula Shock Front\nYang Gao1 and Chung K. Law1,2,∗\n\narXiv:1110.0884v1 [astro-ph.SR] 5 Oct 2011\n\n1\n\nCenter for Combustion Energy and Department of Thermal Engineering,\nTsinghua University, Beijing 100084, China\n2\nDepartment of Mechanical and Aerospace Engineering,\nPrinceton University, Princeton, NJ 08544-5263, USA\n(Dated: September 9, 2018)\n\nThe accelerative expansion of the Crab nebula's outer envelope is a mystery in dynamics as\na conventional expanding blast wave decelerates when bumping into the surrounding interstellar\nmedium. Here we show that the strong relativistic pulsar wind bumping into its surrounding nebula\ninduces energy-generating processes and initiates a detonation wave that propagates outward to form\nthe current outer edge, namely the shock front, of the nebula. The resulting detonation wave, with\na reactive downstream, then provides the needed power to maintain propagation of the shock front.\nFurthermore, relaxation of the curvature-induced reduction of the propagation velocity from the\ninitial state of formation to the asymptotic, planar state of Chapman-Jouguet propagation explains\nthe observed accelerative expansion. The essential role of detonative propagation in the structure\nand dynamics of the Crab nebula offers potential richness in incorporating reactive fronts in the\ndescription of various astronomical phenomena.\nPACS numbers: 95.30.Lz, 98.58.Mj, 47.40.Rs\n\nThe Crab nebula is the most observed supernova remnant since its birth in A.D. 1054. Its explicit birth date,\ntogether with accurate observations of its subsequent\nevolvement through optical [1–3] and radio [4] facilities\nin the last several decades, has yielded rich information\non its structure and dynamics. In particular, it is shown\nthat this nebula has two major features, namely optical line-emitting filaments, which are supposed to be the\ndense condensations of the thermal gas [2, 3], and an\nexpanding radio synchrotron bubble shell, which is recognized as the outer edge of the nebula composed of light\nrelativistic gas and magnetic fields [4]. Furthermore, using observations from 1939 to 1992, and by assuming a\nconstant expansion speed for the nebula, the date of the\nsupernova outburst was estimated to be A.D. 1130±16\n[3], which is 76 years after the historically observed date\nof A.D. 1054. This discrepancy then implies that the\nnebula expansion is actually accelerative. A similar result was obtained through an analysis of the nebula's\nradio shell [4], at rd ≈ 2 pc = 6 × 1018 cm. Based on the\nmost recent result that the current expansion velocity of\nthe nebula shell is vp ∼ 1.5 × 108 cm s−1 , and if a constant acceleration v̇c is assumed, one can then estimate\nthat the acceleration is 0.82 × 10−3 cm s−2 .\nThe above observation, however, cannot be satisfactorily explained by current understanding of the dynamics\nof the expanding front, on two counts, both based on the\nenergy source needed to sustain the front propagation.\nFirst, it has been suggested that the energy from the spin\ndown of the central pulsar provides the needed energy\nsource [5, 6]. However, it is not clear as how the spindown energy of the central pulsar, carried by the pulsar\nwind, can be transferred to the kinetic energy needed to\nsupport the expansion of the nebula's outer edge. This is\nbecause the matching radius of the strong MHD shock,\n\nrs ≈ 3 × 1017 cm = 0.1 pc, formed by the highly relativistic pulsar wind bumping into the surrounding nebula, is much smaller than the outer edge of the nebula,\nrd ≈ 2 pc, to induce effective coupling (see Fig. 1 for an\nillustration of these radii). Second, present theoretical\nconsiderations generally describe the outer edge of the\nCrab nebula as the front of a (magneto) hydrodynamic\nblast wave that bumps into the surrounding interstellar\nmedium (ISM) [7]. However, since a conventional expanding blast wave decelerates [8] as it transfers kinetic\nenergy to its surrounding, such a feature not only contradicts the accelerative nature of the nebula's outer shell, it\ncannot even support the steady expansion of the front. It\nis emphasized that the acceleration, while low in magnitude, being just ∼ 5% in the entire life of ∼1,000 years, is\nnevertheless finite and as such accentuates the observed\nabsence of deceleration.\nIn view of the above concerns, it is of intrinsic interest to explore whether there are other energy sources and\ncoupling mechanisms for the observed accelerative expansion of the nebula shock front. We suggest herein that\nthe shock front is actually a detonation wave, which is\na shock wave with an exothermic, reactive downstream.\nThe exothermic heat release then provides the needed\nenergy for the sustenance of the propagation. Furthermore, relaxation of the front curvature upon expansion\nfacilitates the front propagation, thereby resulting in the\nobserved accelerative expansion. We now present our\ninterpretation and implementation of the detonative description of the nebula shock front propagation, with corresponding estimates of the various dynamic and thermodynamic parameters supporting such a mechanism.\nDetonation wave at the nebula envelope To facilitate\nappreciation of the role of the detonation wave on the\nproblem at hand, it is instructive to first discuss its struc-\n\n\f2\nISM\n\nnebula\n\npulsar wind\npulsar\n10\n\n2\n\n1\n\n0.1\n\n0.1\n\n1\n\nRadius (pc)\n2\n10\n\nMHD shock\nr\n\ns\n\ndetonation wave\nr\n\nd\n\nFIG. 1: Schematic structure of the Crab nebula. The cross\nin the center represents the pulsar. The region immediately\naround the pulsar is the pulsar wind domain, bounded by the\nsurrounding nebula with an interface of strong MHD shock\nat rs = 0.1 pc. Beyond this radius is the nebula region, with\nan outer edge at rd = 2 pc, where the detonation wave forms\nas the nebula expands into the ISM.\n\nture, initiation and propagation based on understanding\nlargely gained from studies of reactive gasdynamics [8, 9].\nBriefly, in the wave stationary frame, a detonation wave\nconsists of a leading hydrodynamic shock which slows\nthe incoming supersonic flow to subsonic and changes its\nthermodynamic states according to the equation of state\nof the medium. This leads to the Neumann state immediately downstream of the shock. For conventional materials including that of interest in the nebula, the density,\npressure and temperature are increased upon crossing the\nshock, which induces reaction of the material after an ignition delay length, lig . This forms the ZND structure\nof the detonation wave. For reactions that are highly\ntemperature sensitive, the subsequent emergence of the\nreactions is abrupt and basically complete, in the manner of a step function. Figure 2 shows a schematic of the\nprofiles of the various properties.\nPropagation of a detonation wave is affected by the\ndownstream rarefaction waves that continuously overtake the shock front and weaken its strength until the\nvelocity downstream of lig becomes sonic. For 1D planar propagation without loss, the sonic state is attained\nat downstream infinity and steady-state propagation is\nattained, resulting in the Chapman-Jouguet (C-J) mode\nof propagation. This feature of detonation propagation\ntherefor assures the non-deceleration of the Crab nebula\nshock front. The acceleration, however, is due to the\nrelaxation of the so-called curvature effect. Specifically\nfor an expanding front the divergence of the streamline\ndownstream of the shock slows down the flow velocity,\nadvances the sonic state from far downstream towards\nthe front, and consequently reduces the propagation velocity from the C-J value, with the reduction increasing\n\nwith increasing front curvature. This curvature-induced\nreduction has three implications. First, there exists a\nminimum, critical radius Rcr for the initiation of the detonation propagation. Second, once initiated and the front\ncurvature relaxes as it expands, the propagation velocity\nwould continuously increase to approach the C-J value.\nThird, a minimum, critical energy is needed for a detonation to attain its critical radius.\nWe shall now apply the above understanding to analyze the propagation of the nebula front. Referring to\nFig. 1, it is proposed that from the beginning of the\nnebula's evolution, the pulsar wind has been pushing its\nsurrounding medium outward continuously until the interface expanded to rs , at which a forward and a reverse detonation fronts are simultaneously formed, with\nthe forward front propagating outward and the reverse\nfront propagating inward. The continuously expanding,\nforward detonation wave then forms the outer envelope\nof the Crab nebula observed today. The motion of the\nlatter, however, is rapidly arrested by the outwardly directed pulsar wind, forming the MHD shock. The radius\nrs , at which the reverse detonation front is stabilized, can\nthus be identified as the critical radius for detonation initiation, which we shall discuss in following context.\nOur analysis is based on a spherically symmetric model\ndescribing the roughly spherical nebula's outer shell as\nwas observed [4]. As a first attempt to the detonation\ninterpretation of the nebula's expanding shell, we do not\nconsider the filament structure of the nebula region [2, 3],\nbut will make some observations of its possible effects\nlater. We further note that previous analysis [7] shows\nthat in order to convert the kinetic energy flux effectively\ninto the observed synchrotron luminosity, the ratio of\nthe magnetic field energy to the particle kinetic energy\nshould be very small. Then it is reasonable to neglect the\nmagnetic field when considering the energy components\nin this wind-nebula shock at rs , as well as in the more\ndistant nebula regions where the detonation takes place.\nIn addition, we also assume that the gravitational energy\nis much smaller than the kinetic energy of the flow.\nWith the above assumptions, the problem simplifies\nto that of the structure and propagation of a spherically expanding detonation wave which have already been\nwell analyzed [10, 11], and was presented in [9]. We\nshall therefore simply state the key results relevant for\nthe present problem. Through estimates of the various\ndynamic and thermodynamic parameters governing the\npresent process, we shall demonstrate that the observed\nphenomena associated with the expanding nebula front\nare consistent with the description based on detonation\ntheory.\nParametric structure of the detonation wave We define the radius Rs , the propagation speed D, the heat\nof reaction qc and the reaction induction length lig for\nthe detonation wave. The corresponding dimensionless\nvariables are l̂ig = lig /Rs , q̂c = qc γ/a2u and D̂ = D/au\n\n\f3\nthe Mach number of the detonation velocity, where a =\np\nγp/ρ is the sound speed, γ is the adiabatic index and\nthe subscript u denotes the upstream ISM. Focusing on\nthe evolution of the detonation Mach number, we can\nexpress it as D̂ = D̂CJ (1 − ∆), where ∆ ≪ 1 is a small\nnumber representing its deviation from the asymptotic\nC-J value caused by the curvature stretch. Then we have\n[9]\n2\nD̂CJ\n= 2(γ + 1) + 2(γ 2 − 1)\n\nq̂c\nq̂c\n≈ 2(γ 2 − 1) ,\nγ\nγ\n\nTABLE I: Gas parameters of the detonation front: upstream\nISM (u), Neumann state (N) and burned C-J state (C-J).\nT\nu\nρ\np\na\nM\n(K)\n(km s−1 ) (cm−3 )\n(Pa)\n(km s−1 )\nu\n104\n1500\n0.5 6.2 × 10−14\n9\n170\n7\nN 1.4 × 10\n74\n10\n1.6 × 10−9\n340\n0.22\nC-J 7.5 × 107\n790\n1.1\n0.9 × 10−9\n790\n0.9\n\n(1)\n9\n\n10\n\n7\n\nqc ≈ 5.9 × 1012 J/mol = 61 MeV/atom,\n\n(3)\n\nwhich is relatively large compared to typical values of\nlight nuclear reactions and those of chemical reactions.\nIt is also noted that in the above calculations, the adiabatic index of the upstream ISM gas has been assumed\nto be γ = 1.1, resulting in a large thermal capacity,\ncp ≈ cv ≈ 10R, with R being the molar gas constant.\nThe index γ = 1.1 is intermediate of isothermal (γ = 1)\nand adiabatic (γ = 5/3 for monatomic gas) fluids, and is\na typical value for ISM with partially effective thermal\nconduction. Furthermore, detonation cannot occur for\nisothermal ISM gas with γ = 1, while for the adiabatic\nlimit case of γ = 5/3, the reaction energy release qc will\ndecrease to ∼1/6 its current value, and the velocity deviation ∆ will decrease to 1/4 its current value. These\nvariations will cause tuning of the detonation parameters, but will not change the principal conclusions made\nin this letter.\nWe can further calculate the physical parameters describing the Neumann state just downstream of the shock\nfront but before the reactions are initiated [9]. After the\nreactions have taken place, the downstream (burned) gas\nwill eventually approach the C-J state, whose parameters can also be readily determined. Parameters of the\nupstream state, the Neumann state and the burned C-J\nstate are listed in Table I and schematically shown in Fig.\n2.\nIt is noted that under the Neumann temperature TN =\n1.4 × 107 K, some nuclear reactions, e.g. the p-p cycle\n[13], are able to be initiated. However, as the density in\nthe nebula region is smaller by a factor of ∼ 10−25 compared to that in the stellar central regions, reaction rates\n\nT (K)\n\n103\n\nN\n\nu\n0\n\nC−J\n1\n\nχ (lig)\n\n2\n\n10−1\n\n3\n\nu\n\nC−J\n\nN\n0\n\n1\n\nχ (lig)\n\n2\n\n3\n\n−8\n\n104\n\n10\n\nVelocity\n\nPressure\n\n10−10\n\n3\n\n10\n\n10−12\n\n2\n\n10\n\n10\n\n10\n\np (Pa)\n\nfor large values of q̂c relevant for the present situation of\nstrong detonation, which has an estimated Mach number\nof 170 (see Table I). The typical temperature of the unburned upstream ISM is [12] Tu ∼ 104 K and the density\nis ρu ∼ 0.5 cm−3 . Other parameters of the upstream ISM\nare readily calculated and listed in Table I. Furthermore,\naccording to eq. (1), the heat of reaction that supports\nthe expansion of the detonation wave is estimated as\n\nDensity\n1\n\n100\n\n105\n\nu (km s−1)\n\n(2)\n\nρ (cm−3)\n\n10\n\n8γ 2\n∆= 2\nl̂ig .\nγ −1\n\n2\n\n10\n\nTemperature\n\nu\n\nC−J\n\nN\n0\n\n1\n\nχ (lig)\n\n2\n\n3\n\n10−14\n\nC−J\n\nN\n\nu\n0\n\n1\n\nχ (lig)\n\n2\n\n3\n\nFIG. 2: Temperature, density, velocity and pressure of the upstream ISM, the compressed Neumann state and the burned\nC-J gas are shown as step functions in each panels. The Neumann state crosses the induction length of lig = 1.0×10−4 pc,\nwhile the upstream and burned gas extends outward to infinite and inward to the inner edge of the nebula, respectively.\n\nof these nuclear processes are very small. Since typical\nheats of chemical reaction are also very small, alternative energy-generating processes need to be identified to\nsupply the energy of qc ≈ 61 MeV/atom. One possible\nenergy source for the detonation is the inverse Compton\nprocess [14, 15], which is a commonly used mechanism\nin astrophysics. Crab nebula's high energy γ-ray emissions and flares are supposed to be produced by inverse\nCompton scatterings [16, 17], and very probably, part of\nthe high energy photons will interact with the nebula gas\nto support expansion of the envelope.\nInitiation of the detonation wave The standing inward shock front (see Fig. 1 and reference [7]) is assumed\nto be the radius where the forward and reverse detonations began to form and separated in the early days of\nthe nebula evolution. Since the reverse shock is expected\nto be immediately captured by the pulsar wind, the radius of its front varies little since the formation of the\nbinary detonations. Consequently the critical radius for\nthe formation of the forward propagating detonation can\nbe identified as that of the standing MHD reverse shock,\nnamely Rcr = rs = 0.1 pc.\nDirectly referring to eq. (14.8.29) in [9] that relates the\ninduction length and the critical radius, and assuming\nβ = 4, which is consistent with the reaction activation\n\n\f4\ntemperature estimated based on the Neumann state, the\ninduction length can be estimated as\n(4)\n\nwhich is a small number compared to the radius of the\ndetonation wave, rd = 2 pc, and is therefore consistent\nwith the requirement of the formulation. We then have\nthe quantitative expression of eq. (2):\n∆=\n\n0.004 pc\n8γ 2 ˆ\nlig ≈\n.\n2\nγ −1\nRs\n\n(5)\n\nAttainment of the critical radius for the detonation\ninitiation requires the initial blast wave to possess a\ncorresponding critical energy Ecr [18]. Referring to eq.\n(14.8.30) in [9], we find:\nEcr =\n\n\u0012\n\n8jeβγ 2\nγ2 − 1\n\n\u0013j+1\n\n2 j+1\nkj ρu DCJ\nlig ≈ 3 × 1045 erg,\n\nCJ\n\n1450\n\n1400\n0.1\n\n0.5\n\n1\n\n1.5\n\n2\n\nRs (pc)\n\nFIG. 3: Increase of the detonation propagation velocity as a\nfunction of the wave front radius. The detonation velocity is\n∼ 1425 km s−1 at Rs = 0.1 pc where the detonation begins\nand gradually approaches the C-J velocity of ∼ 1500 km s−1\nas the wave expands.\n\n(6)\n\nwhere j = 2 and kj = 5.31 for the spherical geometry.\nThis critical energy is much smaller than the part of pulsar spin-down energy carried by the pulsar wind, estimated to be ∼ 1049 erg [7, 19]. So the energy carried\nby the relativistic pulsar wind is sufficient to initiate the\nforward detonation wave. For those supernova remnant\nsystems whose pulsar wind energies are not large enough\nto reach the critical value of Ecr ∼ 3 × 1045 erg, detonation cannot be successfully initiated; instead, it will decelerate as it defuses into the surrounding medium. We\ncan therefore classify those nebulae around supernovae\ninto two groups: namely acceleratively expanding ones\nled by detonation waves, and defused ones formed by decelerating blast waves.\nAccelerative expansion of the detonation front Subsequent to attaining the critical radius, the forward detonation then propagates with the velocity\nD = DCJ (1−∆) = 1.5×103 ×(1−\n\nD\n1500\n\nD (km s−1)\n\n\u0012\n\u0013−1\n16eγ 2\nlig ∼ Rcr β 2\n≈ 1.0 × 10−4 pc,\nγ −1\n\n1550\n\n0.004 pc\n) km s−1 (7)\nRs\n\nin the nebula domain that begins at rs = 0.1 pc and\nends at the current nebula envelope at rd = 2 pc. The\nvariation of the nebula envelope velocity as a function of\nthe envelope radius is shown in Fig. 3, demonstrating\nan accelerative expansion of the wave front. It is seen\nthat at the early age of the nebula, when Rs is slightly\nlarger than 0.1 pc, the propagation velocity of the detonation is smaller than its present value by about 5 percent. Furthermore, the detonation velocity accelerates\nmore rapidly in the early days of the front formation,\nand gradually approaches the C-J velocity as it evolves.\nWe have therefore successfully explained the accelerative\npropagation of the nebula front.\n\nSummary and Discussion In this first attempt to integrate detonation features in the structure and dynamics\nof the Crab nebula, we have demonstrated that the concept is a viable one in terms of the observed phenomena\nas well as the various estimated dynamic and thermodynamic parametric values associated with the description. In particular, the following understanding has been\ngained. (1) There is a supersonic detonation wave at\nthe front of the expanding nebula with a Mach number\nof ∼170; the wave is supported by downstream energygenerating reactions. (2) The surrounding ISM is compressed to a temperature of 107 − 108 K and a density\nof 1 − 10 cm−3 by the initial shock and the subsequent\nreactive heating. (3) The envelope of the nebula is accelerating due to relaxation of the front curvature as it\nevolves to the planar limit upon continuous expansion.\nWe close this discourse with some additional considerations. First, there is another possible mechanism involving the pulsar wind energy that may account for the\naccelerative expansion of the Crab nebula outer envelope.\nThat is, the downstream reaction of the inward detonation may last for a long time, in which case the delayed\nexothermic reaction takes place close to the outer envelope and provides the kinetic energy needed for its accelerative expansion. This mechanism is similar to the\nflame acceleration in obstructed channels [20]. However,\nit is an open issue to confirm the existence of delayed\nexothermic reactions in the Crab nebula.\nSecond, it is noted that the filament structure of the\nnebula could be related to the well-established cellular\nmorphology of detonation fronts [9]. These cells are consequences of interacting triple-shock ensembles, which\nin turn generate complex local subsonic and supersonic\nflows that could be manifested as filaments downstream\nof the front. The presence of cells could also increase the\n\n\f5\narea of the front and consequently its global propagation\nrate. If the increase of the flame area is itself accelerative,\nthen it could constitute an additional mechanism for the\nobserved accelerative expansion of the nebula.\nIt is also of interest to investigate whether the detonation structure suggested here exists in other supernova\nremnants (SNRs), such as those well-observed SNRs in\ndifferent evolution phases. Applications of detonation\nand deflagration theories to describe the chemical or nuclear processes in all kinds of ISM shocks are also merited.\nThis work was supported by the startup fund for the\nCenter for Combustion Energy at Tsinghua University.\n\ncklaw@princeton.edu\nJ. C. Duncan, Astrophys. J. 89, 482 (1939).\nV. Trimble, Astron. J. 73, 533 (1968).\nR. L. Nugent, Publ. Astron. Soc. Pac. 110, 831 (1998).\nM. F. Bietenholz, P. P. Kronberg, D. E. Hogg, P. S. Wilson, Astrophys. J. 373, L59 (1991)\n[5] M. Bejger, P. Haensel, Astron. Astrophys. 405, 747\n(2003)\n[6] R. N. Manchester, J. H. Taylor, Pulsars (Freeman, San\n∗\n[1]\n[2]\n[3]\n[4]\n\nFrancisco, CA, 1977)\n[7] C. F. Kennel, F. V. Coroniti, Astrophys. J. 283, 694\n(1984)\n[8] L. D. Landau, E. M. Lifhshitz, Fluid Mechanics (Pergamon Press, New York, 1959)\n[9] C. K. Law, Combustion Physics (Cambridge University\nPress, New York, 2006)\n[10] L. He, P. Clavin, J. Fluid Mech. 277, 227 (1994)\n[11] J. Yao, S. Stewart, Combust. Flame 100, 519 (1995)\n[12] K. M. Ferrière, Rev. Mod. Phys. 73, 1031 (2001)\n[13] M. Harwit, Astrophysical Concepts (Springer-Verlag\nPress, New York, 1998)\n[14] R. J. Gould, Phys. Rev. Lett. 15, 577 (1965)\n[15] O. C. De Jager, A. K. Harding, Astrophys. J. 396, 161\n(1992)\n[16] A. A. Abdo, et al., Science 331, 739 (2011)\n[17] M. Tavani, et al., Science 311, 736 (2011)\n[18] Ya. B. Zeldovich, G. I. Barenblatt, V. B. Librovich, G.\nM. Makhviladze, The Mathematical Theory of Combustion and Explosions (Eng. ed., Mcneill D. H., Consultants\nBureau, New York and London, 1985)\n[19] J. J. Hester, Annu. Rev. Astron. Astrophys. 46, 127\n(2008)\n[20] V. Bychkov, D. Valiev, L.-E. Eriksson, Phys. Rev. Lett.\n101, 164501 (2008)\n\n\f"}