{"id": "http://arxiv.org/abs/1110.0396v1", "guidislink": true, "updated": "2011-10-03T16:11:19Z", "updated_parsed": [2011, 10, 3, 16, 11, 19, 0, 276, 0], "published": "2011-10-03T16:11:19Z", "published_parsed": [2011, 10, 3, 16, 11, 19, 0, 276, 0], "title": "Calibrating 15 years of GOLF data", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1110.5160%2C1110.4734%2C1110.0737%2C1110.3509%2C1110.3921%2C1110.4731%2C1110.1162%2C1110.1550%2C1110.0240%2C1110.3580%2C1110.4164%2C1110.6158%2C1110.0625%2C1110.6615%2C1110.4911%2C1110.5864%2C1110.1125%2C1110.4537%2C1110.0421%2C1110.0579%2C1110.4005%2C1110.1562%2C1110.2642%2C1110.4093%2C1110.6294%2C1110.0527%2C1110.3962%2C1110.2006%2C1110.5903%2C1110.2665%2C1110.0765%2C1110.1065%2C1110.0541%2C1110.6643%2C1110.5108%2C1110.1409%2C1110.1995%2C1110.3885%2C1110.6485%2C1110.3540%2C1110.1949%2C1110.3584%2C1110.4360%2C1110.1487%2C1110.1686%2C1110.3763%2C1110.0512%2C1110.5942%2C1110.3165%2C1110.6221%2C1110.1682%2C1110.4775%2C1110.1464%2C1110.3609%2C1110.0522%2C1110.6251%2C1110.6404%2C1110.6022%2C1110.4293%2C1110.1641%2C1110.4883%2C1110.5243%2C1110.0091%2C1110.6088%2C1110.0448%2C1110.4948%2C1110.0396%2C1110.4755%2C1110.1772%2C1110.3670%2C1110.1947%2C1110.6351%2C1110.4797%2C1110.6583%2C1110.2546%2C1110.1565%2C1110.3527%2C1110.5377%2C1110.5739%2C1110.0467%2C1110.3930%2C1110.2084%2C1110.3639%2C1110.1053%2C1110.3588%2C1110.3330%2C1110.4954%2C1110.3413%2C1110.3236%2C1110.4439%2C1110.6007%2C1110.0488%2C1110.6603%2C1110.2979%2C1110.2288%2C1110.4832%2C1110.1697%2C1110.4362%2C1110.0327%2C1110.3473%2C1110.3601&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Calibrating 15 years of GOLF data"}, "summary": "The GOLF resonant scattering spectrophotometer aboard SoHO has now provided\n15 years of continuous high precision Sun-as-a-star radial-velocity\nmeasurements. This length of time series provides very high resolution in the\nfrequency domain and is combined with very good long-term instrumental\nstability. These are the requirements for measuring the low-l low-frequency\nglobal oscillations of the Sun that will unlock the secrets of the solar core.\nHowever, before the scientifically interesting gravity and mixed modes of\noscillation fully reveal themselves, a correction and calibration of the whole\ndata set is required. Here we present work towards producing a 15 year GOLF\ndata set corrected for instrumental ageing and thermal variation.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1110.5160%2C1110.4734%2C1110.0737%2C1110.3509%2C1110.3921%2C1110.4731%2C1110.1162%2C1110.1550%2C1110.0240%2C1110.3580%2C1110.4164%2C1110.6158%2C1110.0625%2C1110.6615%2C1110.4911%2C1110.5864%2C1110.1125%2C1110.4537%2C1110.0421%2C1110.0579%2C1110.4005%2C1110.1562%2C1110.2642%2C1110.4093%2C1110.6294%2C1110.0527%2C1110.3962%2C1110.2006%2C1110.5903%2C1110.2665%2C1110.0765%2C1110.1065%2C1110.0541%2C1110.6643%2C1110.5108%2C1110.1409%2C1110.1995%2C1110.3885%2C1110.6485%2C1110.3540%2C1110.1949%2C1110.3584%2C1110.4360%2C1110.1487%2C1110.1686%2C1110.3763%2C1110.0512%2C1110.5942%2C1110.3165%2C1110.6221%2C1110.1682%2C1110.4775%2C1110.1464%2C1110.3609%2C1110.0522%2C1110.6251%2C1110.6404%2C1110.6022%2C1110.4293%2C1110.1641%2C1110.4883%2C1110.5243%2C1110.0091%2C1110.6088%2C1110.0448%2C1110.4948%2C1110.0396%2C1110.4755%2C1110.1772%2C1110.3670%2C1110.1947%2C1110.6351%2C1110.4797%2C1110.6583%2C1110.2546%2C1110.1565%2C1110.3527%2C1110.5377%2C1110.5739%2C1110.0467%2C1110.3930%2C1110.2084%2C1110.3639%2C1110.1053%2C1110.3588%2C1110.3330%2C1110.4954%2C1110.3413%2C1110.3236%2C1110.4439%2C1110.6007%2C1110.0488%2C1110.6603%2C1110.2979%2C1110.2288%2C1110.4832%2C1110.1697%2C1110.4362%2C1110.0327%2C1110.3473%2C1110.3601&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The GOLF resonant scattering spectrophotometer aboard SoHO has now provided\n15 years of continuous high precision Sun-as-a-star radial-velocity\nmeasurements. This length of time series provides very high resolution in the\nfrequency domain and is combined with very good long-term instrumental\nstability. These are the requirements for measuring the low-l low-frequency\nglobal oscillations of the Sun that will unlock the secrets of the solar core.\nHowever, before the scientifically interesting gravity and mixed modes of\noscillation fully reveal themselves, a correction and calibration of the whole\ndata set is required. Here we present work towards producing a 15 year GOLF\ndata set corrected for instrumental ageing and thermal variation."}, "authors": ["Guy R. Davies", "Rafael A. García"], "author_detail": {"name": "Rafael A. García"}, "author": "Rafael A. García", "arxiv_comment": "4 pages, 3 figures. To appear in the SF2A 2011 Proceedings", "links": [{"href": "http://arxiv.org/abs/1110.0396v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1110.0396v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "astro-ph.SR", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph.SR", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1110.0396v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1110.0396v1", "journal_reference": null, "doi": null, "fulltext": "SF2A 2011\nG. Alecian, K. Belkacem, S. Collin, R. Samadi and D. Valls-Gabaud (eds)\n\nCALIBRATING 15 YEARS OF GOLF DATA\n\narXiv:1110.0396v1 [astro-ph.SR] 3 Oct 2011\n\nG. R. Davies 1 and R. A. Garcı́a1\nAbstract. The GOLF resonant scattering spectrophotometer aboard SoHO has now provided 15 years of\ncontinuous high precision Sun-as-a-star radial-velocity measurements. This length of time series provides very\nhigh resolution in the frequency domain and is combined with very good long-term instrumental stability.\nThese are the requirements for measuring the low-l low-frequency global oscillations of the Sun that will\nunlock the secrets of the solar core. However, before the scientifically interesting gravity and mixed modes\nof oscillation fully reveal themselves, a correction and calibration of the whole data set is required. Here we\npresent work towards producing a 15 year GOLF data set corrected for instrumental ageing and thermal\nvariation.\nKeywords:\n\n1\n\nSun, helioseismology, instrumentation\n\nIntroduction\n\nThe Global Oscillations at Low Frequency (GOLF) instrument measures the Sun-as-a-star radial velocity field\n(Gabriel et al. 1995, 1997). Raw measurements are made in intensity and then corrected and calibrated to\nproduce final residual velocities (Garcı́a et al. 2005). The ability of this calibration process to produce high\nquality and very long time series (15 years) is important as GOLF is forced to operate in a single wing mode\n(Pallé et al. 1999). The scientific motivation for an improved calibration comes from the need for a stable 15\nyear time series. This will allow detailed analysis of the impact of the solar cycle on helioseismic parameters\n(Broomhall et al. 2009b; Salabert et al. 2009) and the detection of new low-frequency oscillations. Low-frequency\noscillations have low signal-to-noise ratios making their detection a significant challenge. Recent reports on the\nsignature of g modes (Turck-Chièze et al. 2004) and their fingertips (Garcı́a et al. 2007, 2008) sparked much\ndebate. An improvement in GOLF performance at low frequency could reveal the secrets of the solar core.\n2\n\nGOLF observations\n\nGOLF makes measurements of intensity, I, integrated over narrow bands in wavelength, λ, and integrated over\nthe visible surface of the solar disk, S. We can state this as a simple model,\nZ Z\nI=\nI (λ, S, vlos )W (λ, S, vlos ) dλ dS,\n(2.1)\nλ\n\nS\n\nwhere I is the solar D1 and D2 absorption line spectrum, W is the instrumental weighting, and vlos is the\nline-of-sight velocity between GOLF and the Solar surface. Given the measured intensity, the solar line function,\nand the instrumental weighting it would be possible to determine vlos . However, all three components contain\nsome level of uncertainty and/or cannot be sufficiently modeled (Ulrich et al. 2000). So we make simplifications\nand propose a method that relies on the following statement: a well corrected instrument will give intensity\nmeasurements that are only a function of vlos . This gives us the definition of a parameter for good - the\ncorrespondence of intensity and line-of-sight velocity.\nTo achieve the best possible GOLF signal-to-noise ratio, it is necessary to correct for long term instrumental\neffects and to provide a stable calibration that minimizes non-solar variation in mode amplitude. Previous work\n1\n\nLaboratoire AIM, CEA/DSM-CNRS-Université Paris Diderot; IRFU/SAp, Centre de Saclay, 91191 Gif-sur-Yvette Cedex,\nFrance\nc Société Francaise d'Astronomie et d'Astrophysique (SF2A) 2011\n\n\f238\n\nSF2A 2011\n\nhas tackled these two aspects one after another. However, the gain of the instrument (photons detected divided\nby photons collected) and the instrument sensitivity (dI/dvlos ) are coupled. The two processes must be treated\nconcurrently to give an optimum calibration. Figure 1 shows GOLF raw-intensity measurements as a function\nof time. There are two processes that are clearly visible: the yearly variation in the Sun-instrument line-of-sight\nvelocity; and the ageing of the instrument. Further to this there is a less obvious variation of instrumental gain\nwhich is a function of the temperature of the instrument.\nTo account for all effects present in Fig. 1 we modify equation 1. We add the ageing of the instrument\n\nFig. 1. GOLF raw-intensity measurements as a function of time. Red lines mark breaks in continuity due to instrumental\nadjustments. The obvious effects displayed are the ageing of the photomultiplier tubes (PMT near exponential decay),\nthe Sun-instrument line-of-sight velocity (one year period), and the discontinuities due switching between the \"red\" and\n\"blue\" wings and PMT high voltage adjustment.\n\n(probably dominated by the ageing of the photomultiplier tubes) P (t), the variation in flux as a function of the\nspacecraft-Sun distance F (d), and the variation in gain due to the changes in instrument temperature K(T ).\nThis gives\nZ Z\nI = P (t)F (d)K(T )\n\nI (λ, S, vlos )W (λ, S, vlos ) dλ dS.\nλ\n\n(2.2)\n\nS\n\nGiven the simple model of the the underlying system and a goodness-of-fit parameter, we can use the 15 years\nof GOLF observation to determine instrumental parameters. First we must define the parameters and functions\ndescribing the instrument.\nThe ageing of the instrument is expected to de dominated by the exponential loss of efficiency in GOLF's\nphotomultiplier tubes. From GOLF's measurements we find that the rate of ageing varies as a function of time.\nTo describe this in the simplest possible manner we use the following function,\nP (t) = p0 exp −(t(p1 + p2 t)).\n\n(2.3)\n\nThe change in flux due to the variation in the spacecraft-Sun distance is determined by the solid angle presented\nby the GOLF aperture. It is trivial to how that\nF (d) = f02 /d2 ,\n\n(2.4)\n\nwhere f0 is a reference distance.\nFor the gain of the instrument due to temperature we use the form of Garcı́a et al. (2005),\nK(t) = 1 − k1 (T − k0 ) − k2 (T − k0 )2 ,\n\n(2.5)\n\n\fGOLF 15 years\n\n239\n\nwhere k0 is a reference temperature. Variations in instrumental gain due to temperature have a number of\npossible sources: variation in the vapour cell stem temperature; variation in the detector temperature (PMT\nand counting electronics); and other sources including the temperature of the interference filters. Rather than\nconsidering a function for each temperature we note that each of the measured temperatures (particularly\nthe cell stem and detectors) are well correlated. Using this we apply a single correction using only the stem\ntemperature, which is the measured temperature with the greatest precision.\nWe must also describe the sensitivity of the instrument (dI/dvlos ). In this work we use the derivative of a\nfourth order polynomial as we know this has been successfully applied to similar but ground based instruments\n(Elsworth et al. 1995; Broomhall et al. 2009a),\n4\n\nX\ndI\ni−1\n=\nai i vlos\n.\ndvlos\ni=1\n\n(2.6)\n\nWe have developed more sophisticated models of the instrumental sensitivity that require more space for description than is available here. The full description will be presented in Davies et al. (in prep.).\n\n3\n\nResults\n\nWe show an example of the new correction and calibration technique applied to 387 days of GOLF data. Figure 2\nshows the strong correspondence between the Sun-instrument line-of-sight velocity and the calibrated velocities\nreturned by the new method. In addition, Fig. 2 shows the residual velocities (measured velocity less vlos )\nwhich show both the impact of solar surface activity (period around 13 days) and solar oscillations (period of\nabout 5 minutes and amplitude of a few m s−1 ). Figure 3 shows the power spectrum of the residual velocities.\nThe frequency domain again shows the presence of solar surface activity and solar oscillations.\n\nFig. 2. Calibrated velocity as a function of Sun-instrument line-of-sight velocity. Residual velocities shown in red with\nscale on the right ordinate. The impact of solar surface activity in the residuals can be clearly seen as a near 13 day\nperiod fluctuation. The magnitude of the solar oscillation signal is a few m s−1 .\n\n\f240\n\nSF2A 2011\n\nFig. 3. Power spectrum of the 387 day residuals using the new correction and calibration method. Black: power\nspectrum. Red: 20 point boxcar smoothed power spectrum. Vertical lines: overtones of the Carrington rotation rate\n(highlighting peaks in the power spectrum due to solar surface activity). The \"five minute\" modes are clearly visible at\nhigh frequency (≈ 3 mHz).\n\n4\n\nConclusions\n\nHere we present work focusing on achieving a stable correction and calibration of GOLF data that could be\napplied to 15 years of observations. We demonstrate that we can achieve a good correspondence between the\nSun-instrument line-of-sight velocity and the calibrated velocity. The calibrated velocities show the signatures\nof both solar surface activity and solar oscillations.\nThe GOLF instrument is a cooperative effort of many individuals, to whom we are indebted. SoHO is a mission of international\ncooperation between ESA and NASA. The authors thanks the support of the CNES.\n\nReferences\nBroomhall, A.-M., Chaplin, W. J., Davies, G. R., et al. 2009a, MNRAS, 396, L100\nBroomhall, A.-M., Chaplin, W. J., Elsworth, Y., Fletcher, S. T., & New, R. 2009b, A&A, 503, 241\nElsworth, Y., Howe, R., Isaak, G. R., et al. 1995, A&AS, 113, 379\nGabriel, A. H., Charra, J., Grec, G., et al. 1997, Sol. Phys., 175, 207\nGabriel, A. H., Grec, G., Charra, J., et al. 1995, Sol. Phys., 162, 61\nGarcı́a, R. A., Jiménez, A., Mathur, S., et al. 2008, Astronomische Nachrichten, 329, 476\nGarcı́a, R. A., Turck-Chièze, S., Boumier, P., et al. 2005, A&A, 442, 385\nGarcı́a, R. A., Turck-Chièze, S., Jiménez-Reyes, S. J., et al. 2007, Science, 316, 1591\nPallé, P. L., Régulo, C., Roca Cortés, T., et al. 1999, A&A, 341, 625\nSalabert, D., Garcı́a, R. A., Pallé, P. L., & Jiménez-Reyes, S. J. 2009, A&A, 504, L1\nTurck-Chièze, S., Garcı́a, R. A., Couvidat, S., et al. 2004, ApJ, 604, 455\nUlrich, R. K., Garcı́a, R. A., Robillot, J.-M., et al. 2000, A&A, 364, 799\n\n\f"}