{"id": "http://arxiv.org/abs/1112.2007v3", "guidislink": true, "updated": "2012-04-05T19:34:18Z", "updated_parsed": [2012, 4, 5, 19, 34, 18, 3, 96, 0], "published": "2011-12-09T02:40:31Z", "published_parsed": [2011, 12, 9, 2, 40, 31, 4, 343, 0], "title": "Radiative corrections to anti-neutrino proton scattering at low energies", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1112.3100%2C1112.2593%2C1112.5139%2C1112.6265%2C1112.2315%2C1112.0645%2C1112.4346%2C1112.5831%2C1112.1035%2C1112.3192%2C1112.0302%2C1112.6345%2C1112.0324%2C1112.2090%2C1112.2649%2C1112.4743%2C1112.1586%2C1112.5021%2C1112.3717%2C1112.2487%2C1112.1082%2C1112.3997%2C1112.4462%2C1112.5879%2C1112.5520%2C1112.5231%2C1112.3222%2C1112.2342%2C1112.3651%2C1112.1683%2C1112.0098%2C1112.5748%2C1112.2014%2C1112.6029%2C1112.2180%2C1112.3378%2C1112.0348%2C1112.5043%2C1112.2676%2C1112.6212%2C1112.5843%2C1112.4506%2C1112.1927%2C1112.2048%2C1112.1049%2C1112.3022%2C1112.1266%2C1112.2557%2C1112.5448%2C1112.6239%2C1112.2040%2C1112.0254%2C1112.3594%2C1112.3947%2C1112.3134%2C1112.0906%2C1112.6054%2C1112.5210%2C1112.4827%2C1112.1085%2C1112.0166%2C1112.2007%2C1112.2527%2C1112.3010%2C1112.3688%2C1112.2761%2C1112.0740%2C1112.4119%2C1112.2008%2C1112.0374%2C1112.3509%2C1112.6111%2C1112.0516%2C1112.3967%2C1112.2952%2C1112.1348%2C1112.5749%2C1112.5304%2C1112.6297%2C1112.1149%2C1112.3700%2C1112.2062%2C1112.4010%2C1112.0268%2C1112.4727%2C1112.5178%2C1112.6084%2C1112.0126%2C1112.2893%2C1112.4653%2C1112.6051%2C1112.1530%2C1112.1851%2C1112.6206%2C1112.4077%2C1112.4535%2C1112.4892%2C1112.4345%2C1112.0513%2C1112.1432%2C1112.0305&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Radiative corrections to anti-neutrino proton scattering at low energies"}, "summary": "For the low-energy anti-neutrino reaction, $\\bar{\\nu}_e + p \\to e^+ + n$,\nwhich is of great current interest in connection with on-going high-precision\nneutrino-oscillation experiments, we calculate the differential cross section\nin a model-independent effective field theory (EFT), taking into account\nradiative corrections of order $\\alpha$. In EFT, the short-distance radiative\ncorrections are subsumed into well-defined low-energy constants the values of\nwhich can in principle be determined from the available neutron beta-decay\ndata. In our low-energy EFT, the order-$\\alpha$ radiative corrections are\nconsidered to be of the same order as the nucleon recoil corrections, which\ninclude the \"weak magnetism\" contribution. These recoil corrections have been\nevaluated as well. We emphasize that EFT allows for a systematic evaluation of\nhigher order corrections, providing estimates of theoretical uncertainties in\nour results.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1112.3100%2C1112.2593%2C1112.5139%2C1112.6265%2C1112.2315%2C1112.0645%2C1112.4346%2C1112.5831%2C1112.1035%2C1112.3192%2C1112.0302%2C1112.6345%2C1112.0324%2C1112.2090%2C1112.2649%2C1112.4743%2C1112.1586%2C1112.5021%2C1112.3717%2C1112.2487%2C1112.1082%2C1112.3997%2C1112.4462%2C1112.5879%2C1112.5520%2C1112.5231%2C1112.3222%2C1112.2342%2C1112.3651%2C1112.1683%2C1112.0098%2C1112.5748%2C1112.2014%2C1112.6029%2C1112.2180%2C1112.3378%2C1112.0348%2C1112.5043%2C1112.2676%2C1112.6212%2C1112.5843%2C1112.4506%2C1112.1927%2C1112.2048%2C1112.1049%2C1112.3022%2C1112.1266%2C1112.2557%2C1112.5448%2C1112.6239%2C1112.2040%2C1112.0254%2C1112.3594%2C1112.3947%2C1112.3134%2C1112.0906%2C1112.6054%2C1112.5210%2C1112.4827%2C1112.1085%2C1112.0166%2C1112.2007%2C1112.2527%2C1112.3010%2C1112.3688%2C1112.2761%2C1112.0740%2C1112.4119%2C1112.2008%2C1112.0374%2C1112.3509%2C1112.6111%2C1112.0516%2C1112.3967%2C1112.2952%2C1112.1348%2C1112.5749%2C1112.5304%2C1112.6297%2C1112.1149%2C1112.3700%2C1112.2062%2C1112.4010%2C1112.0268%2C1112.4727%2C1112.5178%2C1112.6084%2C1112.0126%2C1112.2893%2C1112.4653%2C1112.6051%2C1112.1530%2C1112.1851%2C1112.6206%2C1112.4077%2C1112.4535%2C1112.4892%2C1112.4345%2C1112.0513%2C1112.1432%2C1112.0305&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "For the low-energy anti-neutrino reaction, $\\bar{\\nu}_e + p \\to e^+ + n$,\nwhich is of great current interest in connection with on-going high-precision\nneutrino-oscillation experiments, we calculate the differential cross section\nin a model-independent effective field theory (EFT), taking into account\nradiative corrections of order $\\alpha$. In EFT, the short-distance radiative\ncorrections are subsumed into well-defined low-energy constants the values of\nwhich can in principle be determined from the available neutron beta-decay\ndata. In our low-energy EFT, the order-$\\alpha$ radiative corrections are\nconsidered to be of the same order as the nucleon recoil corrections, which\ninclude the \"weak magnetism\" contribution. These recoil corrections have been\nevaluated as well. We emphasize that EFT allows for a systematic evaluation of\nhigher order corrections, providing estimates of theoretical uncertainties in\nour results."}, "authors": ["U. Raha", "F. Myhrer", "K. Kubodera"], "author_detail": {"name": "K. Kubodera"}, "author": "K. Kubodera", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevC.85.045502", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1112.2007v3", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1112.2007v3", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "Text, especially regrading the 1/m_N corrections, has been augmented\n  following comments by the referee. 14 pages, 1 figure. To be published in\n  Phys. Rev C", "arxiv_primary_category": {"term": "hep-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "hep-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "nucl-th", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1112.2007v3", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1112.2007v3", "journal_reference": null, "doi": "10.1103/PhysRevC.85.045502", "fulltext": "Radiative corrections to anti-neutrino proton\nscattering at low energies\n\narXiv:1112.2007v3 [hep-ph] 5 Apr 2012\n\nU. Raha, F. Myhrer and K.Kubodera\nDepartment of Physics and Astronomy, University of South Carolina,\nColumbia, SC 29208\n\nAbstract\nFor the low-energy anti-neutrino reaction, ν̄e + p → e+ + n, which is of great\ncurrent interest in connection with on-going high-precision neutrino-oscillation\nexperiments, we calculate the differential cross section in a model-independent\neffective field theory (EFT), taking into account radiative corrections of order α.\nIn EFT, the short-distance radiative corrections are subsumed into well-defined\nlow-energy constants the values of which can in principle be determined from\nthe available neutron beta-decay data. In our low-energy EFT, the order-α\nradiative corrections are considered to be of the same order as the nucleon\nrecoil corrections, which include the \"weak magnetism\" contribution. These\nrecoil corrections have been evaluated as well. We emphasize that EFT allows\nfor a systematic evaluation of higher order corrections, providing estimates of\ntheoretical uncertainties in our results.\n\n\f1\n\nIntroduction\n\nLow-energy anti-neutrinos from nuclear reactors are well suited to determine the\nneutrino mixing angle θ13 , which is important for the search of CP violation in the\nleptonic sector; see, e.g., Refs. [1, 2]. The Double-Chooz [3], Daya Bay [4], and RENO\nCollaborations [5] are aiming to measure θ13 with very high precision with the use of\nν̄e 's produced in nuclear reactors. The present upper bound to this quantity reported\nby the Chooz [3] and MINOS [6] Collaborations is: θ13 < 11.4◦ .\nThe Double-Chooz, Daya Bay and RENO experiments monitor the inverse betadecay reaction on a hydrogen target\nν̄e + p → e+ + n\n\n(1)\n\nfor a known anti-neutrino energy flux. The positron yield is measured as a function\nof the positron energy. An accurate extraction of the mixing angle θ13 from an\nanalysis of the measured positron yield requires a precise knowledge of the radiative\ncorrections (RCs). In earlier papers [7, 8, 9], the relevant RCs were evaluated in the\ntheoretical framework developed by Sirlin and Marciano [10, 11]. In this framework,\nto be referred to as the S-M approach, the RCs of order α are decomposed into\nso-called outer and inner corrections. The outer correction is a universal function\nof the lepton energy and is independent of the details of hadron physics, whereas\nthe inner correction is influenced by short-distance physics and the hadron structure.\nThe inner corrections coming from γ and weak-boson loop diagrams are divided into\nhigh-momentum and low-momentum parts. The former is evaluated in the currentquark picture, while the latter is computed with the use of the phenomenological\nelectroweak-interaction form factors of the nucleon. Although the estimates of inner\ncorrections in the S-M formalism are considered to be reliable to the level of accuracy\nquoted in the literature, the possibility that these estimates may involve some degree\nof model dependence is not totally excluded.\nWe present here a calculation of the RCs to order α based on effective field theory (EFT). We use heavy-baryon chiral perturbation theory (HBχPT), which is an\neffective low-energy theory of QCD, see e.g. Ref [12]. In HBχPT the short distance\nhadronic and electroweak processes are subsumed into a well-defined set of low-energy\nconstants (LECs). In other words, these LECs systematically parameterize the inner\ncorrections of the S-M approach. Therefore, insofar as there are enough sources of information to determine the values of these LECs, HBχPT leads to model-independent\nresults with systematic estimates of higher-order corrections. The use of HBχPT to\ncalculate electroweak transition amplitudes for the nucleon and few-nucleon systems\n1\n\n\fwere pioneered in Refs. [13, 14, 15], and subsequently there have been many important developments. In Ref. [16], we presented the first ever EFT-based calculation\nof RCs for the neutron β-decay process, n → p + e− + ν̄e . Because in HBχPT the\nnucleons are treated as point-like, it is expected on general grounds that the order-α\nRCs are common between neutron β-decay and inverse β-decay. Meanwhile, it should\nbe mentioned that, in the counting scheme adopted here and in Ref.[16], the order-α\nRCs are of the same order as the m−1\nnucleon-recoil corrections including the \"weak\nN\nmagnetism\" contributions,1 and hence a consistent EFT calculation should include\nthese recoil corrections simultaneously. We present here such an EFT calculation,\ntaking advantage of the fact that the m−1\n-expansion is a natural part of our counting\nN\nscheme and thus dictates how to incorporate recoil corrections order by order (see\nlater in the text).\nSince exactly the same LECs are involved in the EFT calculations of inverse βdecay and neutron β-decay, we can in principle use the existing neutron β-decay\ndata to determine those LECs and make a model-independent estimation of RCs for\nthe inverse β-decay, provided that the m−1\nrecoil corrections are properly taken into\nN\naccount. In this connection, we note that an attempt has been made in the literature [7, 19] to directly relate the neutron decay rate with the inverse β-decay cross\nsection, assuming that the order-α corrections (RCs and recoil corrections combined)\nare common between these processes. As mentioned, this assumption is justified as\nfar as the genuine RCs of order α is concerned. However, as described later in the\ntext, our calculation shows differences between the m−1\ncorrections for inverse βN\ndecay, Eq. (1), and those for neutron β-decay. We therefore caution against writing\nthe cross section for the reaction in Eq. (1) in terms of the neutron mean life, τn , as\nadvocated in Refs. [7, 19].\nThis paper is organized as follows. In section 2 we explain a theoretical framework\nto be used and present the results for the order-α RCs. In section 3 we consider the\nrecoil corrections and compare our results with an earlier work[19]. Section 4 gives a\nsummary of our calculations and conclusions. The appendix describes some technical\ndetails concerning the HBχPT treatment of the infrared singularity.\n\n2\n\nThe QED corrections\n\nWe use here essentially the same theoretical framework as in Ref. [16], in which we\ncalculated RCs for neutron β-decay. We therefore give only a brief recapitulation of\n1\n\nThe importance of the nucleon-recoil corrections was emphasized by, e.g., Vogel and Beacom [19].\n\n2\n\n\four formalism, relegating details to Ref. [16].\nOur calculation is based on the Q̄/Λχ -expansion scheme, where Q̄ ∼ Eν −∆N −me\n(∆N = mn −mp ) represents a typical four-momentum transfer for incident low-energy\nreactor anti-neutrinos (Eν ≤ 10 MeV), and Λχ ≃ 4πfπ ≈ 1 GeV (fπ = 92.4 MeV\nis the pion-decay constant) is the chiral scale. It is to be noted that the expansion\nparameter in our scheme is very small and that, as explained in more detail below,\nthe lowest order recoil corrections ∼ Q̄/mN are of the same order as the lowest order\nradiative corrections; viz., Q̄/mN ∼ α/(2π) ∼ Q̄/Λχ ∼ 10−3 , where mN = (mp+mn )/2.\nThe leading order (LO) transition matrix element for the inverse β-decay, Eq.(1),\nis evaluated ignoring nucleon recoil and radiative corrections. The next-to-leading\norder (NLO) corrections in our counting scheme are the recoil corrections (∼ Q/mN )\nand the radiative corrections (∼ α/(2π)). The recoil corrections, which include the\n\"weak magnetism\" term, will be specified in Eq.(5) below. For the sake of the transparency of presentation, we shall in this paper separate these corrections from the\nm−1\n(kinematic) corrections to the phase-space.\nN\nThe effective lagrangian relevant to our calculation includes the relativistic leptonic weak interaction current and the LO and NLO heavy-baryon lagrangian\nLef f = LQED + LN N + LN N ψψ ,\n\n(2)\n\nwhere\nLQED\nLN N\nLN N ψψ\n\n1\nα\n1\n= − F μνFμν −\n(∂ *A)2 + 1+ e1 ψ̄e (iγ *D)ψe + me ψ̄e ψe + ψ̄ν iγ *∂ψν , (3)\n4\n2ξA\n4π\n\u0014\n\u0015\nα\n= N̄ 1 +\ne2 (1 + τ3 ) (iv * D)N ,\n(4)\n8π!\n\u0015\n\u0013\n\u0012\n\u0013\n\u0014\u0012\ni\u001a\nα\nGF Vud h\nα\nμ\nμ\n+\n=− √\n1+ eV v − 2gA 1+ eA S N\nψ̄e γμ (1 − γ5 )ψν N̄τ\n4π\n4π\n2\n\u0015 \u001b\n\u0015\n\u0014\n\u0014\n← →\n← →\n← →\n1\nμ\nμ\nμ ν\nμν\n+\nN̄ τ i(v v −g )( ∂ − ∂ )ν −2iμV S , S *( ∂ + ∂ ) −2igA v S *( ∂ − ∂ ) N .\n+\n2mN\n(5)\n\u0012\n\n\u0013\n\nLQED in Eq.(3) is the usual QED lagrangian, where Fμν = ∂μ Aν −∂ν Aμ , and Dμ =\n∂μ +ieAμ is the covariant derivative; for the gauge parameter ξA , we use here ξA =\n1 (Feynman gauge). LN N is the heavy-nucleon lagrangian including the photonnucleon interaction, and LN N ψψ is the low-energy LO and NLO current-current weak\ninteraction. We give in Eq.(5) the explicit forms of NLO nucleon-recoil terms dictated\nby HBχPT. In the above, gA = 1.267 is the axial coupling constant, while vμ is the\nnucleon velocity vector, and S μ is the nucleon spin; they satisfy v * S = 0. We choose\n3\n\n\fhere v μ = (1, ~0) and S μ = (0, ~σ/2). In the NLO part of the lagrangian the nucleon\nisovector magnetic moment μV = μp −μn = 4.706. The low-energy constants (LECs),\ne1 , e2 , eV and eA , are counter-terms which regulate the ultraviolet (UV) divergences of\nthe virtual photon-loop diagrams. These LECs incorporate the short-range radiative\nphysics that is not probed in a low-energy process. The LECs, e1 and e2 , are related\nto the wave-function renormalization factors of the positron and proton, respectively.\nThe LECs, eV and eA , are related to the Fermi and Gamow-Teller amplitudes. The\nFermi coupling constant, GF = 1.166 × 10−5 GeV−2 , is determined from muon decay,\nand the CKM matrix element, |Vud | = 0.97418 ± 0.00027, is given by the PDG [20].\nFor later convenience, we rearrange the LECs in Eq.(5) by rewriting the hadronic\npart in the first line in Eq.(5) as\nα\nN̄ τ [v −2g̃A S ]N +\neV N̄ τ + [v μ −2g̃A S μ ]N + O(α2 ) ,\n4π\n+\n\nμ\n\nμ\n\n\u0012\n\n\u0013\n\nα\n(eA−eV )].\nwhere we have introduced the redefined axial coupling constant, g̃A = gA [1+4π\nAs in the neutron β-decay case [16], to the order of our concern, gA can always be\nreplaced by g̃A . This also applies to the NLO recoil contributions since the m−1\nrecoil\nN\ncorrections are of the same order as order-α corrections in the adopted counting\nscheme. The order-α radiative corrections to the nucleon magnetic moments are for\nthe same reason of higher order in our scheme and hence neglected in this work.\nIn this paper we derive a model-independent expression for the lowest order radiative and recoil corrections to the reaction, ν̄e (pν ) + p(pp ) → e+ (pe ) + n(pn ), where\nthe four-momentum of each particle is indicated in the parentheses. We shall concentrate on an experimental setup in which none of the particle spins are monitored by\nthe detector. There is one subtle aspect of the above reaction which deserves some\ndiscussion. In experiments, the final state positron will always be accompanied by\n(often undetected) soft bremsstrahlung photons. If the bremsstrahlung photon energy, Eγ is less than the detector resolution, ∆, the energy recorded by the detector is\nthe sum of the actual outgoing positron energy, Ee , and the bremsstrahlung photon\nenergy, Eγ ; i.e., E = Ee + Eγ is what is measured as the \"detected positron\"\nenergy,\nq\n2\nwith the corresponding \"detected positron\" momentum being |p| = E − m2e . The\ntwo processes we evaluate are ν̄e + p → e+ + n and ν̄e + p → e+ + γ + n. Due to\nthe finite detector resolution the second bremsstrahlung process is not observed; it\nonly contributes to the RCs of the first process, i.e., the soft bremsstrahlung photons\nare an integral part of the \"detected positron\". Thus, the first process has become,\nν̄e (pν ) + p(pp ) → e+ (p) + n(pn ), where the positron momentum pe has been replaced\nby p in order to indicate that the soft bremsstrahlung process has been incorporated\n\n4\n\n\finto this \"effective\" reaction. The cross section for this \"effective\" reaction is given\nin terms of the effective invariant amplitude M:\ndσ =\n=\n\n1\n4mp Eν\n\n1 X\nd3 p\nd3 pn\n4 (4)\n(2π)\nδ\n(p\n+p\n−p−p\n)\n|M|2\nν\np\nn\n(2π)3 2E (2π)3 2En\n2 spins\n\nZ\n\nGF Vud\n√\n2\n\n!2\n\nh\n\ni\n\nf (E) (1+3gA2 ) G1 (β) + (1−gA2 ) G2 (β)β cos θe d(cos θe ) ,\n\n(6)\n\nq\n\nwhere β = |p|/E = E 2 − m2e /E is the velocity of the outgoing \"detected positron\"\nfor a given incident (anti-)neutrino beam energy, Eν and detector reading, E; cos(θe ) =\np̂ν * p̂, and f (E) is the phase-space factor to be discussed later in the text (see,\nEq. (17)). The two velocity-dependent functions, Gi (β) (i = 1, 2), are written up to\nNLO as\nGi (β) = 1 +\n\n1 recoil\nα rad\nGi (β) +\nG\n(β) ,\n2π\nmN i\n\n(7)\n\nHere Girad (β) (see, Eqs. (10) and (11)) represent the lowest-order radiative corrections,\nand Girecoil (β) (see, Eq. (18)), which will be evaluated in the next section, represent\nthe recoil corrections arising from the lagrangian in Eq.(5). The calculation of the\nfunction Girad (β) is described next.\nFor the analysis of the radiative corrections, we explicitly distinguish between the\noutgoing positron and the bremsstrahlung photon. There are two distinct categories\nof radiative corrections, the bremsstrahlung and the virtual photon loop corrections.\nThe corresponding Feynman diagrams are shown in Fig. 1. Since O(α) and O(m−1\nN )\nare of the same order in our counting scheme, the invariant matrix element, Mbr for\nbremsstrahlung is evaluated assuming En = mn . The differential cross section for the\nradiative process, ν̄e (pν )+p(pp ) → e+ (p̃e )+n(pn)+γ(k̃)2 , is given by\nd3 p̃e\nd3 k̃\n(2π)3 2Ẽe (2π)3 2Ẽγ\n1 X\n|Mbr |2 ,\n× (2π)δ(Eν − ∆N − Ẽγ − Ẽe )\n2 spins\n\ndσbr (ν̄e p → e+ nγ) =\n\n1\n8mp mn Eν\n\nZ\n\n(8)\n\nwhere Ẽ = Ẽe + Ẽγ = Eν − ∆N is the maximum energy of the \"detected positron\"\nin the static nucleon approximation, i.e., me ≤ E ≤ Ẽ. The bremsstrahlung matrix\n2\n\nThe four-momenta, p̃e and k̃ denote momenta in the static nucleon approximation, i.e., pe =\n−1\n−1\np̃e − O(m−1\nN ), k = k̃ − O(mN ), and correspondingly, E = Ẽ − O(mN ).\n\n5\n\n\felement squared with the static neutron is\n1X\n|Mbr |2 =\n2\n\neGF Vud\n√\n2\n\n!2\n\n32mn mp Ẽe Eν\nẼγ (p̃e * k̃)\n\n(1 + 3gA2 )(p̃e * k̃)\n× −\nẼγ\n(\n\n\"\n\nh 2Ẽ 2\n\n!\n\n1 − gA2\n1+\n1 + 3gA2\n\n#\"\n\n+ Ẽe Ẽγ + p̃e * k̃ + Ẽγ2\n\n!\n\np̃e * pν\nẼe Eν\n\n#\n\nm2e Ẽγ (Ẽe + Ẽγ ) i\nẼe\nẼe (p̃e * k̃)\n!\n2\ni\nh\nm\nẼ\n2\nẼ\n+\nẼ\nγ\ne\nγ\ne\n−\n+ (1 − gA2 ) (p̃e * pν )\nẼe Eν\nẼe Eν (p̃e * k̃)\n! )\nh\ni\nm2e Ẽγ\nẼe + Ẽγ\n2\n−\n+ (1 − gA ) (k̃ * pν )\n.\nẼe Eν\nẼe Eν (p̃e * k̃)\n+ (1+3gA2 )\n\ne\n\n−\n\n(9)\n\nWe note that the above expression for |Mbr |2 is identical to that for neutron βdecay derived in Ref. [16]. We also remark that Eq.(9) was derived earlier by Fukugita\nand Kubota [9], who used the S-M approach [10, 11] and a finite photon mass in order\nto regulate the infrared (IR) singularity. In the integration over the bremsstrahlung\nphoton energy in Eq.(8) the maximum photon energy occurs when Ẽe = me , i.e.,\nẼγmax = Ẽ − me .3 In this context, the same question again arises as to whether\nor not the experiment can distinguish between the two final states, n + e+ + γ and\nn+e+ . If the detector resolution in the experimental setup is such that one can detect\nphotons with an energy Ẽγ in the interval ∆ ≤ Ẽγ ≤ Ẽγmax , we should integrate the\nbremsstrahlung photon energy Ẽγ = |k̃| from 0 to ∆ in Eq. (8). However, if the\nexperiment is unable to distinguish these two final states, we should integrate from 0\nto Ẽγmax . In order to compare with earlier works, we concentrate here on the latter\ncase. The integral over the radiative photon spectrum invariably gives rise to an IR\nsingularity. We use dimensional regularization to deal with the IR singularity; some\ndetails regarding the bremsstrahlung integral are presented in the appendix. As is\nwell known, the IR singularity appearing in Eq.(8) is cancelled by the contributions\nfrom virtual photon-loop diagrams in accordance with Bloch and Nordsieck [17], see\nalso [18]. The evaluation of the loop diagrams in dimensional regularization can be\nfound in the literature, see, e.g., Ref. [16]. It is notable that, apart from the so-called\n\"Coulomb factor\" π 2 /β, which arises in, e.g. neutron β-decay from a photon-loop\nP\n\n3\n\nThe approximate integrals considered in Ref. [7] give the analytic expression in Ref. [9] provided\nthe lower limits of the integrals are changed from 1 MeV to me .\n\n6\n\n\fdiagram, the matrix element given by these virtual photon loops is identical to the\none in neutron β-decay.\nThe UV-divergencies originating from the photon loop diagrams are regulated by\nthe LECs in the lagrangian. These LECs are renormalized by the usual effective field\ntheoretical method based on dimensional regularization of the loop integrals, see e.g.,\nRefs. [12, 22]. The finite LECs renormalized at the scale μ are\n2\neR\nV,A (μ )\n\n1\n3\n3\n2\nμ2\n= eV,A − (e1 + e2 ) +\n− γE + ln(4π) + 1 + ln\n2\n2 d−4\n2\nm2N\n\u0014\n\n\u0015\n\n!\n\n.\n\nThe LEC, eR\n(μ2 ), which was introduced by Ando et al. [16] in the evaluation of the\nV\nRC for neutron β-decay, subsumes short distance physics not probed at low energies\nand depends on the regularization scale μ.\nCombining the bremsstrahlung\nq and virtual photon-loops contributions calculated\nto order α, and noting that β̃ = Ẽ 2 − m2e /Ẽ = β + O(m−1\nN ), we obtain, neglecting\n−1\nrad\nrad\nO(mN ) contributions, Gi (β̃) ≃ Gi (β), i = 1, 2, appearing in Eq.(7). Dropping\nterms of O(α m−1\nN ), we choose to write the results in the following form:\n\u0014\n\u0015\u0014\n\u0015\nα R 2\nα\nα rad\nG (β) = 1+ ẽV (μ ) 1+ δout (β)\n(10)\n1+\n2π 1\n2π\n2π\nα R 2\nα\nα rad\nδ̃out (β) ,\n(11)\nG2 (β) = 1 +\nẽV (μ ) 1 +\n2π\n2π\n2π\nwhere the \"inner\" corrections, which are independent of β, are encoded in the LEC\n5\n2\nR\n2\nR\n2\nẽR\nV (μ ) and defined as ẽV (μ ) = eV (μ ) + 4 . The \"outer\" radiative corrections constitute the well-known, model-independent, long-distance QED corrections that do not\ncontain any hadronic effects, and are given by\n\u0014\n\n1+\n\n\u0015\u0014\n\n!\n\n\u0015\n\n!\n\n23 8\n8 2 1+β\n2β\nmN\n+\n−\n+ L\nln\nδout (β) = 3 ln\nme\n4\nβ\n1+β\n4β\n1−β\n!\n#\n!\n!\n!\"\n4β 2\n3β 7\n1+β\n1\n1+β\n+4 ln\n−1 +\nln\nln\n+\n1−β 2 2β\n1−β\n4 4β\n1−β\n\u0012\n\n\u0013\n\ns\n!\n!\n√\n\u0013\n3\n8\n1−β\n1− 1−β 2\nmN\n+ +4\n+ L 1−\nδ̃out (β) = 3 ln\nme\n4\nβ2\nβ\n1+β\n! \"\n!\n!\n#\n1\n3\n1\n1\n1+β\n2 1+β\n+\n+\n− −\nln\n− 2 ln\n2β 8 8β 2\n1−β\n2β\n1−β\n!\n# \"\n!√\n#\n\"\n√\n1+β + 1−β\n1+β\n1+β\n1\n√\n√\n−1 ln\nln\n.\n−4\n2β\n1−β\n2β\n1+β− 1−β\n\n(12)\n\n\u0012\n\n7\n\n(13)\n\n\fThe above expressions for δout and δ̃out reproduce the results obtained by Fukugita\nand Kubota [9]. We also note that δout ≡ h(Ê, E0 ), where h(Ê, E0 ) is the function\nintroduced by Sirlin [23].\nAs mentioned, eR\n(μ2 ) also appears in the expression for the RC for neutron βV\ndecay. Therefore, it is in principle possible to determine eR\n(μ2 ) using relevant highV\nprecision low-energy data involving baryons. Due to lack of useful experimental data,\nAndo et al. [16] determined eR\n(μ2 ) at μ = mN by comparing their results for neutron\nV\nβ-decay with those obtained in the S-M approach [10, 11].\n\n3\n\nThe m−1 recoil corrections\nN\n\nAs mentioned, these corrections have two different origins. One comes from the\nlagrangian itself, and the other arises from the expansion of the kinematic factors\nin the phase-space integral. Below we treat these two types of recoil corrections\nseparately and compare our results with those in Ref. [19]. It is to be noted again\nthat, in evaluating the O(m−1\nN ) corrections, we can neglect O(α) radiative effects,\nsince O(α m−1\n)\nterms\nare\nof\nhigher\norder in our counting scheme. One can, therefore,\nN\nassume that the outgoing positron energy, Ee ≈ E, and correspondingly, the positron\nvelocity, βe ≈ β.\nKinematic (phase space) corrections\nThe phase space factor, f (E), appearing in Eq.(6) to the lowest order (LO) in the\nm−1\nexpansion is given by f (Ẽ) = Ẽ 2 β̃/π with the neutron regarded as being static,\nN\ni.e., En = mn +O(m−1\n). To NLO, the above expression for f (E) needs to be corrected\nN\nto incorporate the kinetic energy of the recoil neutron from the relation En = mn +\n(pν −pe )2 /(2mN )+O(m−2\n). Corresponding to this change in En , we have\nN\nE = Eν −∆N −(pν −pe )2 /(2mn ) + * * * = Ẽ − (pν −pe )2 /(2mn ) + * * *\n\"\n!\n#\n1\n∆2N − m2e\n−2\n= Ẽ 1 −\n+ O(mN ) ,\nEν (1− β̃ cos θe ) +\nmN\n2Ẽ\n\n(14)\n\nwhere, as earlier, Ẽ = Eν − ∆N , and the positron velocity becomes\n1 1− β̃ 2\nβ = β̃ 1 −\nmN\nβ̃ 2\n\"\n\n!\n\n∆2 − m2e\n+ O(m−2\n) ,\nEν (1− β̃ cos θe ) + N\nN\n2Ẽ\n!\n\n8\n\n#\n\n(15)\n\n\fq\n\nwhere β̃ = Ẽ 2 − m2e /Ẽ. Note that the positron energy, E and the velocity, β, are\nequal to the recoil-corrected Ee(1) and ve(1) in Ref. [19], respectively. Reflecting these\nchanges, the phase space integral in Eq.(6) needs to be corrected as follows:\nZ\n\nf (E) mn + En\n(dF )\nδ(F )\n4π\nEn\n\u0012\n\ndF\ndE\n\n\u0013\n\nF =0\n\n!−1\n\nh\n\ni\n\n(1 + 3gA2 ) + (1 − gA2 )β cos θe , (16)\n\nwhere F = Eν − ∆N − E − (pν − pe )2 /(2mN ) + * * *. The factor (mn + En )/En ≃ 2 in\nEq.(16) has corrections of order m−2\n, and the Jacobian factor produces the following\nN\nNLO phase space factor in Eq.(6):\nE\nE2β\n1−\nf (E) =\nπ\nmN\n\"\n\n!\n\n#\n\nEν\n1−\ncos θe + O(m−2\nN ) ,\nβE\n\n(17)\n\nwhere the expressions for E and β are given in Eqs. (14) and (15).\nCorrections from the next-to-leading-order lagrangian\nThe m−1\ncorrections to the Lagrangian are explicitly written in Eq.(5). As noted\nN\nbefore, the radiative corrections to these additional terms in the Lagrangian are of\nhigher order than NLO in our counting and hence need not be considered here. Evaluating the NLO lagrangian recoil correction contributions, illustrated in diagram (a)\nin Fig. 1, we obtain the recoil terms in Eq.(7)\n1 − 2gA μV + gA2\n1 + 2gA μV + gA2\n= β E\n−\nE\nν\n1 + 3gA2\n1 + 3gA2\n!\n!\n2\n2\n1\n−\n2g\nμ\n+\ng\n1\n+\n2g\nμ\n+\ng\nA\nV\nA\nV\nA\nA\n− Eν\n.\nG2recoil (β) = E\n1 − gA2\n1 − gA2\n\nG1recoil (β)\n\n!\n\n2\n\n!\n\n(18)\n\nComparing these results with those obtained for neutron β-decay [16], we note that\nthere are several relative sign differences.4 Apart from the m−1\nN phase-space cor−1\nrections in neutron β-decay, the mN corrections (arising from the Lagrangian m−1\nN\ninteraction terms) relevant to the neutron life-time are contained in the C0 factor in\nEq.(14) of Ref. [16]. Noting that in neutron beta-decay Eemax = Eν + Ee + O(m−1\nN ),\nwe may rewrite the C0 factor as\n1\nC0 (Ee ) = 1 +\nmN\n4\n\n(\n\n2\n\nβ Ee\n\n1 + 2μV gA + gA2\n1 + 3gA2\n\n!\n\n+ Eν\n\n1 − 2μV gA + gA2\n1 + 3gA2\n\n!)\n\nThis is in contrast to the order-α RCs which are universal at NLO in effective field theory.\n\n9\n\n\fComparison of C0 with G1recoil (β) in Eq.(18) clearly indicates that the m−1\nrecoil corN\nrections are not identical for the neutron β-decay and the inverse β-decay. Moreover,\nsince the weak-magnetism term is dominant, the difference between C0 and G1recoil (β)\nare of the same magnitude as the corrections themselves.\nCombining the m−1\nJacobian factor in the square brackets in Eq. (17), and the reN\ncoil correction arising from the lagrangian, Eq. (18), we confirm the recoil corrections\ngiven in Eqs. (12) and (13) in Ref. [19]. We prefer to keep these two m−1\ncorrections\nN\nseparate since one is of a kinematical origin (phase space correction), whereas the\nother is of a dynamical origin arising from the transition matrix element.\n\n4\n\nDiscussion\n\nIn this paper we have derived a model-independent expression for the radiative and\nm−1\ncorrections for the low-energy anti-neutrino proton reaction to next-to-leadingN\norder in an effective field theory approach. We have shown that short-distance physics\nnot probed in this low-energy reaction can be subsumed into a single low-energy constant eR\n(μ2 ). In the Q̄/Λχ -expansion scheme adopted here, the O(α) and O(Q/mN )\nV\ncorrections are considered to be of the same order for the reactor anti-neutrino energy range. We have found that the m−1\ncorrections appearing in Eq. (18), which\nN\noriginate from the lagrangian Eq. (5), are different from the m−1\ncorrections found\nN\nin neutron β-decay, see e.g., Ref. [16]. Therefore, to the order under consideration, it\nis not advisable to write the inverse beta-decay cross section (or the positron yield)\nin terms of the neutron mean life τn , as advocated in Ref. [7].\nThe short-distance hadronic physics associated with the LEC, eR\n(μ2 ), was extenV\n2\nsively discussed in Refs. [10, 11]. The processes involved in eR\nV (μ ) were studied from\nan effective field theoretical perspective in Ref. [16]. In principle, we should be able\nto determine the LEC, eR\n(μ2 ), from high-precision experimental data. Relegating\nV\n2\nthis determination to future study, we choose here to estimate eR\nV (μ ) at the scale\nμ = mN by comparing the short-distance radiative corrections calculated in the S-M\napproach [10, 11] and the expressions obtained in EFT in Ref. [16]. The result is\n!\n\nmZ\nmp\n2\nẽR\n+ln\n+2C +Ag = 18.31 − .25 + 1.78 − 0.34 = 19.5,\nV (mN ) = 4 ln\nmp\nmA\n\u0012\n\n\u0013\n\n(19)\n\nwhere, for the sake of definiteness, the value of the axial matching mass mA =1.2 GeV\nhas been used although its value involves uncertainty [10, 11]. With this value of\n2\nẽR\nV (mN ), the correction term involving LEC in Eqs. (10) and (11) is estimated to be\n2\n(α/2π) ẽR\nV (mN ) ≃ 0.023. The dominant first term in Eq. (19) arises from well-known\n10\n\n\fadditional box diagrams with Z-exchange, replacing the photon-exchange, in electroweak theory [10, 11]. This electro-weak physics can be naturally included in our\napproach. However, for an easy comparison with the neutron beta-decay radiative\ncorrections evaluated in Ref. [16], we prefer to keep this contribution in the above\nLEC. As for the last two terms in Eq. (19), we remark that Ag involves genuine\nshort-distance hadron-structure physics, whereas the constant C arises from photonloop diagrams in which the photon couples to the nucleon magnetic moments and\nalso from the hadronic form factors. The long-range parts of these corrections are\nnaturally included in EFT at higher orders than considered in this paper.\nAs a final comment we note that in our work we have used the value of the\nFermi constant GF determined from the muon lifetime measurement. The theoretical\nexpression for GF is evaluated in standard electroweak theory, and it naturally in2\ncludes log-terms involving mZ . These log-terms appear in our expression for eR\nV (μ ),\nEq. (19), and was also considered in Ref. [16], see e.g., Refs. [10, 11] for details.\nIn summary the integrated cross section for reaction (1) is\nẼ 2 β̃\nα\n(1 + 3gA2 ) 1 + G1rad (β̃)\nπ\n2π\n(\n!\n!\nh\n1\n1 + β̃ 2\n∆2N − m2e\nrecoil\n× 1+\nG\n(β̃) − Ẽ −\nEν +\nmN 1\n2Ẽ\nβ̃ 2\n!\n)\n2\ni\n1 − gA Eν\n(2 + β̃ 2 )\n+\n1 + 3gA2\n3\n\nσ = (GF Vud )2\n\n\u0012\n\n\u0013\n\n(20)\n\nq\n\nwhere as before, Ẽ = Eν − (mn − mp ) and β̃ = Ẽ − m2e /Ẽ, and where all m−1\nN\ncorrections in Eq.(20) except G1recoil (β) of Eq.(18) originate from the phase-space\nfactor f (E), Eq.(17).\nAcknowledgements We are grateful to V. Gudkov and T. Kubota for useful\ndiscussion. This work is supported in part by the National Science Foundation grants,\nPHYS-0758114 and PHY-1068305.\n\nAppendix\nWe use dimensional regularization to isolate the IR singularity. The 3-dimensional\nintegral over k̃ in Eq.(8) is replaced with a d = 4 − 2ǫ dimensional integral where\n\n11\n\n\fǫ < 0 for the purpose of handling the IR singularity, i.e. Eq.(8) is rewritten as\n1\ndσbr\nμ4−d\n=\ndcosθe\n32mn mp Eν (2π)d\n\nZ\n\nẼ−me\n\n0\n\nd|k̃| |k̃|\n\nd−2 d−2\n\nd\n\n!\n\n|p̃e | 1 X\nΩ ̃\n|Mbr |2 , (21)\nk |k̃| 2 spin\n\nq\n\n(Ẽ −|k̃|)2 −m2e . We note that in dimensional regularization, the angular\nR\nˆ = cos θ )\nˆ e * k̃\nintegration dd−2 Ω  ̃ yields (p̃\nk\nk\nwhere p̃e =\n\nμ4−d\n(2π)d\n\nZ\n\ndd−2 Ω  ̃ [1 − cos2 θk ]\nk\n[1 − β̃cos(θk )]2\n\ni\n2\n1+ β̃\n4\nμ4−d h\n1+|ǫ|\n(γ\n−ln(4π))\n− + ln\n=\nE\n3\n2\n3\n8π\nβ̃\nβ̃\n1− β̃\n(\n\n\"\n\n!#\n\n4|ǫ|\nC(β̃) + O(ǫ2 )\n+\n2\nβ̃\n\n)\n\n,\n\nq\n\nwhere β̃ = Ẽ 2 − m2e /Ẽ and the function C(β̃) is given by (see e.g. Refs. [21])\n!\"\n\n!#\n\n1\n1\n1+ β̃\n1+ β̃\nC(β̃) = 1 +\n1 − ln\nln\n2\n2β̃\n1− β̃\n1− β̃\n!\n#\n!\n\"\n2β̃\n1\n1 + β̃\n1\n−1 + L\n,\nln\n+ 2 ln2\nβ̃ 1 + β̃\n2β̃\n1 − β̃\n\n(22)\n\nand L(x) is the Spence function\nL(x) = −Li2 (x) =\n\nZ\n\n0\n\nx\n\ndt\n\nln(1 − t)\n.\nt\n\nThe integral over the photon momentum dk̃ k̃ d−5 ∝ 1/|ǫ| exhibit the IR-singularity.\nWhen we combine our expression for the integrated bremsstrahlung cross section with\nthe contributions from the virtual photon loops, we find that the IR singularity is\nremoved as it should.\nR\n\nReferences\n[1] K. Anderson et al., \"White paper report on using nuclear reactors to search for\na value of θ13 \", (2004). http://www.hep.anl.gov/minos/reactor13/white.html\n[2] H. Minakata, H. Sugiyama, O. Yasuda, K. Inoue and F. Suekane, Phys.Rev. D\n68, 033017 (2003) [arXiv:hep-ph/0211111]; Erratum ibid. D70 059901 (2004).\n12\n\n\f[3] The Chooz Collaboration, M. Apollonio et al., Eur. Phys. J. C 27,\n331 (2003). The first results from this collaboration can be found at\nhttp://doublechooz.in2p3.fr/Public/public.php and Y. Abe et al. (Double Chooz\nCollaboration), arXiv:1112.6353.\n[4] Daya Bay Collaboration, X. Guo et al., arXiv: hep-ex/0701029 DOE proposal\n(2007); F.P. An et al. (Daya Bay Collaboration), arXiv:1203.1669; see also the\nhome page of this experimental collaboration http://dayabay.bnl.gov\n[5] RENO Collaboration, J.K. Ahn et al., arXiv:1003.1391 [hep-ex] Technical Design\nReport (2010). A web page of this experimental collaboration can be found at\nhttp://hcpl.knu.ac.kr/neutrino/neutrino.html\n[6] P. Adamson et al. (MINOS Collaboration), Phys. Rev. D 82, 051102 (2010);\nPhys. Rev. Lett. 106, 181801 (2011); Phys. Rev. Lett. 107, 021801 (2011).\n[7] P. Vogel, Phys. Rev. D29, 1918 (1984)\n[8] S.A. Fayans, Yad. Fiz. 42, 929 (1985) [Sov. J. Nucl. Phys. 42, 590 (1985)].\n[9] M.Fukugita and T. Kubota,\nActa Phys. Polon.\n(2004)[arXiv:hep-ph/0403149]; Erratum: arXiv:hep-ph/0403149\n\nB35,\n\n1687\n\n[10] A. Sirlin, Nucl. Phys. B71, 29 (1974); A. Sirlin, Nucl. Phys. B100, 291 (1975);\nA. Sirlin, arXiv:hep-ph/0309187 (2003)\n[11] W.J. Marciano and A. Sirlin, Phys. Rev. Lett. 56, 22 (1986).\n[12] V. Bernard, N. Kaiser and U.-G. Meissner, Int. J. Mod. Phys. E4, 193 (1995).\n[13] M. Rho, Phys. Rev. Lett. 66,1275 (1991).\n[14] T.-S. Park, D.-P. Min and M. Rho, Phys. Rep. 233, 341 (1993).\n[15] T.-S. Park, D.-P. Min and M. Rho, Nucl. Phys. A, 596, 515 (1996).\n[16] S. Ando et al., Phys. Lett. B 595, 250 (2004).\n[17] F. Bloch and A. Nordsieck, Phys. Rev. 52, 54 (1937).\n[18] T. Kinoshita, J. Math. Phys. 3, 650 (1962); T.D. Lee and M. Nauenberg, Phys.\nRev. 133, B1549 (1964); N. Nakanishi, Prog. Theor. Phys. 19, 159 (1958).\n13\n\n\f[19] P. Vogel and J.F. Beacom, Phys. Rev. D 60, 053003 (1999).\n[20] Review of Particle Physics by the Particle Data Group, C. Amsler et al., Phys.\nLett. B 667, 1 (2008)\n[21] R. Gastmans and R. Meuldermans, Nucl. Phys. B 63, 277 (1973); W.J. Marciano\nand A. Sirlin, Nucl. Phys. B 88, 86 (1975).\n[22] S. Scherer, Adv. Nucl. Phys., 27, 2001 (2003).\n[23] A. Sirlin, Phys. Rev. D bf 84, 014021 (2011); arXiv:1105.2842 [hep-ph].\n\n14\n\n\fe+\n\nν̄e\n\ne+\n\nν̄e\n\ne+\n\nν̄e\n\nγ\n\np\n\n(a)\n\nn\n\ne+\n\nν̄e\n\np\n\nγ\n\nn\n\n(b)\n\ne+\n\nν̄e\n\np\n\n(c)\n\nn\n\ne+\n\nν̄e\nγ\n\nγ\nγ\np\n\n(d)\n\nn\n\ne+\n\nν̄e\n\np\n\nn\n\n(e)\n\ne+\n\nν̄e\n\np\n\n(f)\n\nn\n\ne+\n\nν̄e\n\n∝ e1\n∝ eV , eA\n∝ e2\np\n\n(g)\n\nn\n\np\n\n(h)\n\nn\n\np\n\n(i)\n\nn\n\nFigure 1: Feynman diagrams contributing to the cross section which includes O(α)\nQED corrections: (a) - leading order (LO) Born amplitude; (b) and (c) -\nbremsstrahlung amplitudes; (d), (e) and (f) - virtual photon-loop diagrams; (g)\nand (h) - counter-term amplitudes involving the LECs e1 and e2 , respectively; (i) -\ncounter-term amplitudes involving both of the LECs, eV and eA . The m−1\ncorrection\nN\nis represented by diagram (a) but with the use of the vertex that arises from the\nm−1\n(NLO) part of the lagrangian in Eq.(5). To the order of our concern we do not\nN\nconsider diagrams in which a photon couples to the nucleon magnetic moments since\nthis is O(α/mN ) or NNLO.\n\n15\n\n\f"}