{"id": "http://arxiv.org/abs/0807.0309v1", "guidislink": true, "updated": "2008-07-02T09:47:49Z", "updated_parsed": [2008, 7, 2, 9, 47, 49, 2, 184, 0], "published": "2008-07-02T09:47:49Z", "published_parsed": [2008, 7, 2, 9, 47, 49, 2, 184, 0], "title": "Counterparty risk valuation for CDS", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0807.4821%2C0807.0438%2C0807.1041%2C0807.0657%2C0807.2679%2C0807.1256%2C0807.2952%2C0807.1556%2C0807.0309%2C0807.2168%2C0807.2363%2C0807.4435%2C0807.1905%2C0807.3503%2C0807.4888%2C0807.4465%2C0807.0465%2C0807.3707%2C0807.3581%2C0807.3871%2C0807.1579%2C0807.2949%2C0807.1994%2C0807.0923%2C0807.4793%2C0807.2736%2C0807.2901%2C0807.4347%2C0807.2651%2C0807.0802%2C0807.2649%2C0807.3692%2C0807.0520%2C0807.1060%2C0807.4343%2C0807.0275%2C0807.3927%2C0807.3077%2C0807.5011%2C0807.3764%2C0807.2832%2C0807.3292%2C0807.1794%2C0807.4727%2C0807.1234%2C0807.4784%2C0807.0675%2C0807.2002%2C0807.4773%2C0807.3476%2C0807.2338%2C0807.3466%2C0807.1298%2C0807.3560%2C0807.4679%2C0807.4208%2C0807.3898%2C0807.2218%2C0807.2092%2C0807.2538%2C0807.2129%2C0807.2797%2C0807.2748%2C0807.2344%2C0807.1605%2C0807.3777%2C0807.3069%2C0807.2637%2C0807.3811%2C0807.4402%2C0807.0026%2C0807.1017%2C0807.3951%2C0807.1543%2C0807.1906%2C0807.1441%2C0807.3205%2C0807.0848%2C0807.0408%2C0807.2876%2C0807.4509%2C0807.2846%2C0807.0952%2C0807.2451%2C0807.4580%2C0807.2671%2C0807.4298%2C0807.4549%2C0807.3744%2C0807.3388%2C0807.2109%2C0807.2200%2C0807.2561%2C0807.4221%2C0807.0387%2C0807.2409%2C0807.4409%2C0807.4418%2C0807.1015%2C0807.3980%2C0807.2424&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Counterparty risk valuation for CDS"}, "summary": "The valuation of counterparty risk for single name credit derivatives\nrequires the computa- tion of joint distributions of default times of two\ndefault-prone entities. For a Merton-type model, we derive some formulas for\nthese joint distribu- tions. As an application, closed formulas for\ncounterparty risk on a CDS or for a first-to-default swap on two underlyings\nare obtained.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0807.4821%2C0807.0438%2C0807.1041%2C0807.0657%2C0807.2679%2C0807.1256%2C0807.2952%2C0807.1556%2C0807.0309%2C0807.2168%2C0807.2363%2C0807.4435%2C0807.1905%2C0807.3503%2C0807.4888%2C0807.4465%2C0807.0465%2C0807.3707%2C0807.3581%2C0807.3871%2C0807.1579%2C0807.2949%2C0807.1994%2C0807.0923%2C0807.4793%2C0807.2736%2C0807.2901%2C0807.4347%2C0807.2651%2C0807.0802%2C0807.2649%2C0807.3692%2C0807.0520%2C0807.1060%2C0807.4343%2C0807.0275%2C0807.3927%2C0807.3077%2C0807.5011%2C0807.3764%2C0807.2832%2C0807.3292%2C0807.1794%2C0807.4727%2C0807.1234%2C0807.4784%2C0807.0675%2C0807.2002%2C0807.4773%2C0807.3476%2C0807.2338%2C0807.3466%2C0807.1298%2C0807.3560%2C0807.4679%2C0807.4208%2C0807.3898%2C0807.2218%2C0807.2092%2C0807.2538%2C0807.2129%2C0807.2797%2C0807.2748%2C0807.2344%2C0807.1605%2C0807.3777%2C0807.3069%2C0807.2637%2C0807.3811%2C0807.4402%2C0807.0026%2C0807.1017%2C0807.3951%2C0807.1543%2C0807.1906%2C0807.1441%2C0807.3205%2C0807.0848%2C0807.0408%2C0807.2876%2C0807.4509%2C0807.2846%2C0807.0952%2C0807.2451%2C0807.4580%2C0807.2671%2C0807.4298%2C0807.4549%2C0807.3744%2C0807.3388%2C0807.2109%2C0807.2200%2C0807.2561%2C0807.4221%2C0807.0387%2C0807.2409%2C0807.4409%2C0807.4418%2C0807.1015%2C0807.3980%2C0807.2424&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The valuation of counterparty risk for single name credit derivatives\nrequires the computa- tion of joint distributions of default times of two\ndefault-prone entities. For a Merton-type model, we derive some formulas for\nthese joint distribu- tions. As an application, closed formulas for\ncounterparty risk on a CDS or for a first-to-default swap on two underlyings\nare obtained."}, "authors": ["Christophette Blanchet-Scalliet", "Frédéric Patras"], "author_detail": {"name": "Frédéric Patras"}, "author": "Frédéric Patras", "links": [{"href": "http://arxiv.org/abs/0807.0309v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0807.0309v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "q-fin.PR", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "q-fin.PR", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "math.PR", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0807.0309v1", "affiliation": "JAD", "arxiv_url": "http://arxiv.org/abs/0807.0309v1", "arxiv_comment": null, "journal_reference": null, "doi": null, "fulltext": "arXiv:0807.0309v1 [q-fin.PR] 2 Jul 2008\n\nCounterparty risk valuation for CDS.\nChristophette Blanchet-Scalliet\nUniversité de Lyon\nCNRS, UMR 5208, Institut Camille Jordan\nEcole Centrale de Lyon\nUniversité Lyon 1\nINSA de Lyon\n36 avenue Guy de Collongue\n69134 Ecully Cedex - FRANCE\nFrédéric Patras∗\nUniversité de Nice et CNRS\nUMR 6621, J.-A. Dieudonné\nParc Valrose\n06108 Nice Cedex 2 - FRANCE\nVersion of November 2, 2018\n\nAbstract\nThe valuation of counterparty risk for single name credit derivatives\nrequires the computa- tion of joint distributions of default times of two\ndefault-prone entities. For a Merton-type model, we derive some formulas\nfor these joint distribu- tions. As an application, closed formulas for counterparty risk on a CDS or for a first-to-default swap on two underlyings\nare obtained.\n\n1\n\nIntroduction\n\nDefault Risk has become one of the key issues of contemporary finance. In\npractice, default risk computations are directly involved in three, closely connected, but still separated areas: first, the pricing of single and multiname\ncredit derivatives (ABS, CDS, CDOs...), second, risk valuation for regulatory,\nrisk management and economic capital valuation purposes, third, rating assignements. The present article is focused mainly on the first two aspects of\nrisk valuation. Notice however that the next generation of rating methodologies\nwill most probably have to include advanced correlation tools such as the ones\nconsidered here.\nAlthough deriving new formulas for credit derivative transactions on two\nassets, our main interest will be on counterparty risk. Once again, this is a\n∗ Consultant,\n\nZeliade Systems.\n\n1\n\n\fcentral argument, both for regulatory purposes (counterparty risk was already\na key issue in the Basel 1 agreements, but its relevance and complexity was\nemphasized by the later improvements of the set of rules, see e.g. [1, 9, 2]) and\nalso for practical risk management.\nConcretely, the 2007 \"subprime\" credit crisis has emphasized how a mispricing of counterparty risk could be dangerous. Before the crisis, financial\ninstitutions engaged heavily in credit derivatives transactions for hedging purposes. One of the main side effects of the crisis has been to reveal that their\ncounterparties were not reliable: monoline insurers (who act traditionaly as\nguarantees for municipalities-type bond emissions but engaged more recently in\nthe ABS business) faced downgrades and/or bankruptcy, whereas some companies offering CDS protection have also been on the wedge of bankruptcy due\nto spread widenings and collateral agreements. In spite of these facts, in the\npresent state of the art quantitative counterparty risk assessment is still largely\nin infancy.\nWe address here one of the fundamental questions in the field, namely we\nintroduce a Merton-type model and derive formulas for the joint distributions\nof the default events -and other relevant joint probabilities- of two default-prone\nentities. Closed formulas for counterparty risk on a CDS transaction or for a\nfirst-to-default swap on two underlyings follow.\nNotice that we refrain to seek for the outmost generality or for a complete list\nof pricing formulas that could be obtained using the methods developed in the\npresent article. Most credit derivatives on two underlyings with time-dependent\npayoffs can actually be priced using our results. The exercise of deriving the\ncorresponding formulas is left to the interested reader.\n\n2\n\nModeling two dimensional default risk.\n\nRecall that we are interested in modeling the counterparty risk on a credit risk\ntransaction. This involves (in general and depending of the particular features of\nthe transaction) the computation of various joint laws. For example, for a vanilla\ncredit default swap, the computation relies on the distribution of the default\ntime of the counterparty and the conditional distribution (w.r. to the default\nof the counterparty) of the values of the CDS contract. The same methodology\ncan be applied to the valuation of first-to-default contracts on two underlyings\nwhen the payoff is time-dependent (see section 4 of the present article; the\ntime-independent case has been addressed in [8, 17, 13]).\nWe follow Merton's structural approach to risk, where the default of a company is triggered by its firm value falling below a threshold (see [12] or e.g. [4,\nChap. 3]). It is well-known that the original Merton methodology, where the\nthreshold is determined by the firm's liabilities, as well as its natural refinements\nsuch as the Black-Cox first passage time formulas [3], give qualitatively good\nbut numerically poor results. For example, the structural method will rank correctly the risks of two companies but will not be able to predict the spreads of\nthe corresponding CDS. For pricing purposes, the correct way to use the Merton\nand Black-Cox models is to calibrate their parameters on the market prices of\nthe securities issued by the companies. Doing so insures that the models price\ncorrectly the risk. This is the ground for their various uses, either in credit risk\nmeasurement (think to the Basel 2 Vasicek-type large pool formulas [15, 9]),\n\n2\n\n\feither for pricing purposes (think to the one-factor Gaussian copula model for\nCDO tranches [14]).\nNotice that the computations we are interested in require to go beyond\nthe existing formulas for two-dimensional credit risk in the structural approach\n[8, 17, 13]. Indeed, the formulas in these articles rely mainly on the computation\nof the probability that one (and only one) out of two firms defaults or that the\ntwo firms default before a given maturity, whereas pricing counterparty risk for\na CDS transaction requires (among others) the exact knowledge of default times\ndistributions.\nWe have tried to keep some balance between generality and the choice of too\nrestrictive assumptions. Notice that the model may be simplified by selecting a\nsuitable subset of meaningful parameters, depending on the particular situations\nand/or the available set of data. In the end, the model we use is as follows.\nWe label 1 and 2 the two default-prone entities. In view of applications to\ncounterparty risk, the counterparty will be labelled 2. We write τ1 (resp. τ2 ) for\nthe random time when the first (resp. second) entity defaults. Since we work\nin the structural model, defaults are triggered when two log-normal processes\nV1 and V2 associated respectively to the first and second entity fall below a\nbarrier process. As in Black-Cox [3], we assume that the barrier is described by\na time-dependent deterministic process vi (t) := Ki eγi t . At last, we assume that\nthe risk-neutral dynamics of the processes V1 and V2 are given by:\ndVi (t)\n= (r − ki )dt + σi dBi (t),\nVi (t)\nwhere r is the constant short-term interest rate and Bi , i = 1, 2 are two Brownian motions. The coefficient ki is a payout ratio representing net payouts/inflows\nby the firm, see e.g. the account of Merton's approach in [4, Chap.2]. Notice\nthat we use a risk-neutral dynamics since we are interested in pricing formulas,\nbut the same construction holds with a real-life dynamics (just replace r − ki\nby the drift under the historical probability).\nAt last, we assume that the Brownian motions B1 and B2 are correlated:\nCov(B1 (t), B2 (t)) = ̺t. This is an important assumption that reflects the fact\nthat the counterparty of a CDS transaction is usually a well-rated company\nthat will not default excepted in a very bad macroeconomic environment. In\nparticular, if the counterparty defaults, one may expect CDS spread on other\nentities to widen considerably simultaneously. This phenomenon is accounted\nfor by a positive correlation coefficient. It is the main reason, together with\nthe dynamical aspects of the problem, why simplistic counterparty risk models\nfail, both theoretically and empirically, to account for counterparty-driven loss\nexpectations on derivative contracts.\n\n3\n\nCounterparty risk\n\nIn this section, we derive a closed formula for the counterparty default leg of a\nCDS contract, that is the present value (PV) of the expected losses on a vanilla\nsingle-name credit derivative transaction due to the default of the protection\nseller. Notice that the notion of counterparty default leg should not be confused\nwith the usual notion of default leg for a CDS contract, that is, the present value\nof future payments by the protection seller.\n3\n\n\fWe follow standard market practices. Namely, we assume that the CDS\ncontract has a notional value C and that, if the underlying entity defaults, the\nbuyer of protection receives (1 − Ru ) * C from the seller of protection, where Ru\nstands for the recovery rate of the underlying entity. Similarly, if the counterparty (the protection seller) defaults at t on the CDS contract, we assume that\nthe buyer of protection receives (1 − Rc ) * Vt+ , where Vt+ = sup(0, Vt ) stands for\nthe positive part of the market value of the CDS contract at t, and where Rc\nstands for the counterparty recovery rate. The present moment is normalized\nto t = 0 in what follows, it may or may not coincide with the inception of the\nCDS contract.\n\n3.1\n\nCounterparty default leg\n\nUsing the joint law of the default time of the counterparty and of the underlying\nentity for the CDS, we compute the default probability of the underlying entity\nconditional to the default of the counterparty, and obtain a closed formula for\nthe counterparty default leg.\nThe coupon payments rate (CDS spread) by the protection buyer is written s.\nWe assume continuous payments of the fees: in practice, fees are payed quarterly\n(and sometimes semi-annually), but due to the payments-in-arrears conventions,\nthe continuous payments assumption is a reasonable one. It is usually defined,\nat inception of the contract, by equalizing the fee and default legs of the CDS\ncontract (see Section 3.3. Some empirical adjustment is sometimes done for\nthe counterparty default risk, taking into account advanced risk management\nparameters such as netting agreements. Our computation of the counterparty\ndefault leg leads to a new, sounder, methodology, to assess the fair value of this\nadjustment.\nFirst, the theoretical counterparty default leg Dc is given by\nDc\n\n=\n\n(1 − Rc ) * E[e−rτ2 * sup(0, p(V1 (τ2 ), τ2 ))1τ2 <(T ∧τ1 ) ]\n\nwhere p(V1 (τ2 ), τ2 ) is the market price of the CDS contract at t = τ2 (when\nτ1 ≥ τ2 ). The value p(V1 (τ2 ), τ2 ) is obtained as the difference between the\ndefault and fee legs, that is:\np(V1 (τ2 ), τ2 ) = Dl (V1 (τ2 ), τ2 ) −\n\nsC\n* E[(1 − e−r((T ∧τ1 )−τ2 ) )1τ1 ≥τ2 |Fτ2 ]\nr\n\nwhere we write Ft , as usual, for the natural filtration of the probability space\nunderlying the two Brownian motions B1 (t), B2 (t).\nNotice that the term T ∧ τ1 can be, in most situations, safely replaced by T\nin the previous expansion. This is because, for standard values for the spreads\nand implied default probabilities in single-name default risk computations, the\ncomputation of the fee leg conditional to the hypothesis that no default occurs\nis a good first-order approximation to the unconditional fee leg. The following\ncomputations could be simplified accordingly.\nNow, the value of Dl (V1 (τ2 ), τ2 ) is given by:\nDl (V1 (τ2 ), τ2 ) =\n\nE[C(1 − Ru )e−r(τ1 −τ2 ) 1τ2 ≤τ1 ≤T |Fτ2 ]\n\n4\n\n\fTheorem 3.1 The counterparty default leg Dc is given by:\nDc = C(1 − Rc )\n\"\n\n\u0013\n\u0012\n−μτ2 + α(T − τ2 )\n−μτ2 − α(T − τ2 )\ns\n√\n√\n)+e−μτ2 (β+α) N (\n)\n∗E 1τ2 <(T ∧τ1 ) e−rτ2 (1−Ru + ) e−μτ2 (β−α) N (\nr\nT − τ2\nT − τ2\n!\n#\n\u0012\n\u0013\n\u0010\n−μτ2 − β(T − τ2 )\n−μτ2 + β(T − τ2 ) \u0011\ns\n−r(T −τ2 )\n−2μτ2 β\n√\n√\n1−N (\nN(\n− 1−e\n)−e\n)\nr\nT − τ2\nT − τ2\n+\n\nwhere ν1 := r − k1 − γ1 − 21 σ12 , α :=\nIndeed,\n\nq\n\nν12\nσ12\n\n+ 2r, β :=\n\nν1\nσ1 ,\n\nμτ2 :=\n\nV (τ )\nln( v 1 (τ2 ) )\n1 2\n\nσ1\n\n.\n\nh\ns\np(V1 (τ2 ), τ2 )1τ2 <(T ∧τ1 ) = C1τ2 <(T ∧τ1 ) E (1 − Ru )e−r(τ1 −τ2 ) 1τ2 ≤τ1 <T − 1τ2 <τ1\nr\ni\ns\ns\n+ e−r(τ1 −τ2 ) 1τ2 ≤τ1 <T + e−r(T −τ2 ) 1τ2 ≤T <τ1 |Fτ2\nr\nr\nand therefore\n\u0010 h\ni\ni\nhs\ns\np(V1 (τ2 ), τ2 )1τ2 <(T ∧τ1 ) = C1τ2 <(T ∧τ1 ) E (1−Ru + )e−r(τ1 −τ2 ) 1τ2 ≤τ1 <T |Fτ2 −E 1τ2 <τ1 |Fτ2\nr\nr\nhs\ni\u0011\n+E e−r(T −τ2 ) 1τ2 ≤T <τ1 |Fτ2 .\nr\nThe Theorem follows by standard computations of integrals over Gaussian\ndensities that are sketched in the Appendix 1.\n\n3.2\n\nExplicit formulas\n\nRecall that τi = inf{t, Vi (t) ≤ Ki eγi t }. The condition Vi (t) ≤ Ki eγi t can be\nγi t\ni\n) and y0i = ln Vi (0) −\nrewritten: Wi (t) ≥ y0i , where Wi (t) = ln( KViie(t) ) − ln( VK\ni (0)\nln Ki . Equivalently, Wi (t) is the diffusion process:\ndWi (t) = −νi t − σi dBi (t),\nwith Wi (0) = 0 and νi := r − ki − γi − 12 σi2 .\nLet us define Z(t) by:\n\u0012 −1\n\u0013\u0012 1\n\u0013\n−1\n1\nσ1\ny0 − W1 (t)\np −̺σ2 −1\n.\nZ(t) = (Z1 (t), Z2 (t))∗ = p\ny02 − W2 (t)\n0\n1 − ̺2 σ2\n1 − ̺2\nWe get:\n\ndZ1 (t) = φ1 dt + dX1 (t), dZ2 (t) = φ2 dt + dX2 (t),\nwhere X(t) is a standard planar Brownian motion and\nφ1 =\n\nν1 σ2 − ν2 σ1 ̺\nν2\np\n, φ2 =\n.\nσ2\n1 − ̺2\n\nσ1 σ2\n\nIn particular, Z(t) is a 2-dim. Brownian motionpwith drift and the barrier\n1 − ̺2 Z1 (t) + ̺Z2 (t) = 0.\nconditions Vi (t) = vi (t) now read: Z2 (t) = 0 and\n5\n\n\fWe want to compute the default leg Dc , that is, equivalently:\nE[h(B1 (τ2 ), τ2 )1τ2 ≤(T ∧τ1 ) ] = E[h̃(Z1 (τ2 ), τ2 )1τ2 ≤(T ∧τ1 ) ]\nZ T Z +∞\nh̃(r, s)P (τ2 ∈ ds, Z1 (τ2 ) ∈ da)dsda\n=\n0\n\n0\n\nwhere h(x, t) :=\n\u0012\n\u0013\n−μx,t + α(T − t)\ns\n−μx,t − α(T − t)\n√\n√\n)+e−μx,t (β+α) N (\ne−rt (1−Ru + ) e−μx,t (β−α) N (\n)\nr\nT −t\nT −t\n\u0012\n\u0013!\n\u0010\n−μx,t − β(T − t)\n−μx,t + β(T − t) \u0011\ns\n−r(T −t)\n−2μx,t β\n√\n√\n1−N (\n)−e\nN(\n)\n,\n− 1−e\nr\nT −t\nT −t\n+\n\n−y01 −ν1 t\nσ1\n\np\n+ 1 − ρ2 *z, t).\nμx,t := σ1−1 (ν1 t+σ1 x+ln V1 (0)−ln K1 ) and h̃(z, t) = h(\nApplying the Girsanov theorem, (Z1 (t), Z2 (t))∗ is a classical Brownian motion\nfor the probability law Q:\nφ2\nφ2\ndQ\n2\n1\n= e−φ1 X1 (T )−φ2 X2 (T )−[ 2 + 2 ]T Pa.s.\ndP\n\nLet r0 eiθ0 := Z1 (0) + iZ2 (0) =\n\ny01 σ2 −̺y02 σ1\nσ1 σ2\n\n√\n\n1−̺2\n\n+i\n\ny02\nσ2 .\n\nLemma 3.2 We have, for (a, 0) ∈ R2 s.t. a > 0 :\nP(τ2 ∈ dt, τ2 = τ2 ∧ τ1 , Z1 (τ2 ) ∈ da) =\n\neφ1 (a−r0 cos(θ0 ))−φ2 r0 sin(θ0 )−\n∞\nX\n\nn=0\n\n~ 2 := φ2 + φ2 , α := arcsin(̺) +\nwhere ||φ||\n1\n2\nfunction of index nπ/α.\n\nπ\n2\n\nn sin\n\n~ 2t\n||φ||\n2\n\nπ\nα2 ta\n\ne−(a\n\n2\n\n+r02 )/2t\n\nar0\nnπθ0\nInπ/α (\n)dadt.\nα\nt\n\nand Inπ/α is the modified Bessel\n\nThe Lemma follows from Thm. in Appendix 2 (up to a straightforward\nadaptation\nsince we consider here a polyhedral domain D := {(x, y) ∈ R2 |y ≥\np\n2\n0, 1 − ̺ x + ̺y ≥ 0} with a horizontal lower –instead of an upper– boundary,\nso that the signs have to be changed accordingly in the formulas).\nIndeed, according to [5] (see also [13, pp.697]), we have, for (a, b) in a neighborhood of (a, 0) with b > 0:\nf (a, b, t)dadb = Q(Z(t) ∈ (da, db), τ1 ∧ τ2 > t)\n∞\nnπθ0\nμr0\nnπθ\n2μ −(μ2 +r02 )/2t X\ne\nsin\nInπ/α (\n)dμdθ,\nsin\nαt\nα\nα\nt\nn=0\n√\nwhere θ := arctg( ab ), μ := a2 + b2 . Therefore, we have:\n\n=\n\nQ(τ2 = τ2 ∧ τ1 , τ2 ∈ dt, Z1 (τ2 ) ∈ da) =\nand the proof follows.\n6\n\n∞\nπ −(a2 +r02 )/2t X\nar0\nnπθ0\ne\nInπ/α (\n)dadt,\nn sin\nα2 ta\nα\nt\nn=0\n\n\fTheorem 3.3 The counterparty default leg Dc of the CDS is given by:\n\nDc\n\n=\n\nC(1 − Rc )\n\nZ\n\nT\n\n0\n\nZ\n\n+∞\n\nh̃(μ, t)eφ1 (μ−r0 cos(θ0 ))−φ2 r0 sin(θ0 )−\n\n~ 2t\n||φ||\n2\n\n0\n\n∞\nπ −(μ2 +r02 )/2t X\nμr0\nnπθ0\ne\nInπ/α (\n)dtdμ.\nn sin\n2\nα tμ\nα\nt\nn=0\n\nNotice that although involving a double integral on Gaussian densities and\nBessel function (which asymptotic behavior is well-understood, making numerical approximations easy and efficient), this kind of higher order integrals is\nhighly familiar in physics (heat conduction in solids, cross-sections computations, acoustics...) and can be handled efficiently. However these techniques are\nnot, for the time being, of our competence, and we postpone to further work the\nnumerical analysis of the problem. For the use of Bessel functions in physics,\nwe refer to the classical treatises such as [5, 7, 16].\n\n3.3\n\nFair price of a CDS\n\nIn this section, we take advantage of our computation of the counterparty default\nleg to compute the fair price of a CDS contract at an arbitrary time (normalized\nagain to t = 0 in this section) between the inception of the contract and its\nmaturity T . As usual, it is obtained as difference between the default and fee\nlegs, but, contrary to the usual pricing formulas, we take into account exactly\nthe effect of the counterparty default leg.\nNotice that we insist in deriving exact formulas but, for practical purposes,\nit may be convenient to use the standard approximation schemes to simplify\nthe use of the formulas and fasten the computations. For example, in order to\ncompute the fee leg, it may be convenient to assume that defaults can occur\nonly at times ti , i = 1...n, so that the following integral expressions can be\nsafely replaced by finite sums involving only the computation of the default\nprobabilities P(τ1 ∧ τ2 ≤ t).\nLet us write Ds for the \"standard\" default leg of the CDS, that is, the present\nvalue of the cash-flows corresponding to payments by the seller of protection if\nthere is a default occurring on the assets underlying the CDS contract. The\ntotal default leg Dtot of the CDS contract is given by the sum Ds + Dc , where\nDc is given by Thm. 3.3.\nLemma 3.4 The standard default leg is given by:\nZ T Z +∞\n~ 2T\n||φ||\neφ1 (μ cos(α)−r0 cos(θ0 ))+φ2 (μ sin(α)−r0 sin(θ0 ))− 2\nDs = C(1 − Ru )\n0\n\n0\n\n2\n\ne−(μ\n\n+r02 )/2t\n\n∞\nX\n\n(−1)n+1 n sin\n\nn=0\n\nπ\nα2 tμ\n\nμr0\nnπθ0\nInπ/α (\n)dμdt\nα\nt\n\nThe proof follows from the same reasoning as the one of Lemma 3.2 and can\nbe omitted.\nNotice that:\nQ(τ1 ∈ dt, τ1 = τ1 ∧ τ2 , Z1 (t) + iZ2 (t) = dμ * eiα ) =\n7\n\n\f∞\nπ −(μ2 +r02 )/2t X\nμr0\nnπθ0\ne\nInπ/α (\n)dμdt\n(−1)n+1 n sin\n2\nα tμ\nα\nt\nn=0\n\nLet us write s for the spread of the CDS contract (the continuous coupon\nrate served by the protection buyer to the protection seller, till the end of the\ncontract, or the default of the underlying, or the default of the protection seller);\ns is fixed at inception of the contract and remains constant till the maturity T .\nRecall that the fee leg of a credit derivative contract is the present value of\ncumulated payments by the protection buyer. We write from now on τ for\nτ1 ∧ τ2 .\nLemma 3.5 The fee leg F of the CDS contract is given by:\n1 − e−rτ\n1 − e−rT\nP(τ ≥ T ) + E[\n1τ ≤T ]\nr\nr\n\nF s−1 =\n1 − e−rT\n=\nr\n\nZ\n\n∞\n\n0\n\nZ\n\nα\n\neφ1 (μ cos(κ)−r0 cos(θ0 ))+φ2 (μ sin(κ)−r0 sin(θ0 ))−\n\n0\n\n2\n\ne−(μ\n\n+r02 )/2T\n\n∞\nX\n\nn=1\n\n+\n\nZ\n\nT\n\n0\n\nZ\n\n+∞\n0\n\n1−e\nr\n2\n\ne−(μ\n\n−rt\n\nsin\n\neφ1 (μ cos(α)−r0 cos(θ0 ))+φ2 (μ sin(α)−r0 sin(θ0 ))−\n\n+r02 )/2t\n\n∞\nX\n\n+\n\n0\n\nT\n\nZ\n\n0\n\n+∞\n\n1−e\nr\n\n−rt\n\ne\n\n2μ\nαT\n\nnπκ\nnπθ0\nμr0\nsin\nInπ/α (\n)dμdκ\nα\nα\nT\n\n(−1)n+1 n sin\n\nn=0\n\nZ\n\n~ 2T\n||φ||\n2\n\n~ 2T\n||φ||\n2\n\nπ\nα2 tμ\n\nnπθ0\nμr0\nInπ/α (\n)dμdt\nα\nt\n\nφ1 (μ−r0 cos(θ0 ))−φ2 r0 sin(θ0 )−\n\n~ 2t\n||φ||\n2\n\n∞\nπ −(μ2 +r02 )/2t X\nμr0\nnπθ0\ne\nInπ/α (\n)dtdμ\nn sin\nα2 tμ\nα\nt\nn=0\n\nThe first term was computed in [13, p.698], the last two follow from our\nprevious computations.\nTheorem 3.6 The fair price of a CDS, taking into account the counterparty\nrisk, is given by:\nDtot − F\nwhere F and Dtot are given by the previous Lemmas.\n\n4\n\nFirst-to-default on two underlyings\n\nAs was mentioned in the introduction, most credit derivative transactions on\ntwo default-prone instruments with time-dependent payoffs can be priced using\nthe techniques developed in the present article. As an example, we derive the\nfair spread of a first-to-default contract on two underlyings.\nMost notations are as above, when we were dealing with the counterparty\nrisk on a CDS, and we do not recall them excepted when necessary. The only\ndifference is that, now, the two default-prone entities are treated on the same\nfooting. We still write C for the notional value of the contract and assume a\ngiven recovery rate R (e.g. 40%) so that, at the first default occuring before the\nmaturity of the contract, the buyer of protection will receive C(1 − R) (recall\n8\n\n\fthis is the very definition of a first-to-default contract; on the other hand, the\nbuyer of protection pays a continuous fee -still called the \"spread\"- till the first\ndefault occurs or till the maturity of the contract if no default occurs before the\nmaturity).\nLemma 4.1 The default leg of the contract is given by:\nZ T Z +∞\n~ 2T\n||φ||\nD = C(1−R)[\ne−rt eφ1 (μ cos(α)−r0 cos(θ0 ))+φ2 (μ sin(α)−r0 sin(θ0 ))− 2\n0\n\n0\n\n2\n\ne−(μ\n\n+r02 )/2t\n\n∞\nX\n\n(−1)n+1 n sin\n\nn=0\n\n+\n\nZ\n\n0\n\nT\n\nZ\n\n+∞\n\nμr0\nnπθ0\nInπ/α (\n)dμdt\nα\nt\n\ne−rt eφ1 (μ−r0 cos(θ0 ))−φ2 r0 sin(θ0 )−\n\n0\n\nπ\nα2 tμ\n\n~ 2t\n||φ||\n2\n\n∞\nπ −(μ2 +r02 )/2t X\nμr0\nnπθ0\ne\nInπ/α (\n)dtdμ]\nn sin\n2\nα tμ\nα\nt\nn=0\n\nOn the other hand, the fee leg is given by the same formula as in Lemma 3.5\n-this is because the coupon is served by the protection buyer till a first default\noccur in both cases (a CDS with counterparty risk or a first-to-default swap on\ntwo underlyings).\nTheorem 4.2 The fair spread s of a first-to-default swap on two underlyings\nat inception of the contract is given by\ns=\n\nD\nF′\n\nwhere D is given by Lemma 4.1 and F ′ = F s−1 by Lemma 3.5.\n\n5\n\nAppendix 1: Theoretical default legs for CDS\n\nWe include in this section a proof of the formulas for the market price of a CDS\nconditional to the default of the counterparty. These are classical computations\nand/or variations thereof. We give therefore only short indications and refer to\n[4, Chap. 3] for further details.\nThe notations are as in Section 3; N stands as usual for the cumulated\nstandard normal distribution.\nLemma 5.1 On the set τ2 < τ1 , we have:\nP (τ1 ≤ T |Fτ2 ) = N (\n\n−2\n−Yτ2 − ν1 (T − τ2 )\n−Yτ2 + ν1 (T − τ2 )\n√\n√\n) + e−2ν1 σ1 Yτ2 N (\n),\nσ1 T − τ2\nσ1 T − τ2\n\n(t)\n1 (0)\nwhere Yt := ln( Vv11(t)\n) = ln( VK\n) + ν1 t + σ1 B1 (t), ν1 := r − k1 − γ1 − 12 σ12 .\n1\n\nThe lemma is a direct application of Cor. 3.1.1 in [4].\nLemma 5.2 For a, b, c ∈ R with b < 0 and c2 > a:\nZ y\nd+c\nd−c\nb − cx\ng(y) +\nh(y)\neax dN ( √ ) =\nx\n2d\n2d\n0\n√\n√ ), h(y) := eb(c+d) N ( b+dy\n√ ).\nwith d = c2 − 2a, g(y) := eb(c−d) N ( b−dy\ny\ny\n9\n\n\fSee Lemma 3.2.1, Fla. 3.16 in [4].\nCorollary 5.3 We have, on τ1 > τ2 :\nE[e−r(τ1 −τ2 ) 1τ1 <s |Fτ2 ] =\n= e−μτ2 (β−α) N (\nwhere α :=\n\nq\n\nν12\nσ12\n\n−μτ2 + α(s − τ2 )\n−μτ2 − α(s − τ2 )\n√\n√\n) + e−μτ2 (β+α) N (\n),\ns − τ2\ns − τ2\n\n+ 2r, β :=\n\nν1\nσ1 ,\n\nμτ2 :=\n\nYτ2\nσ1\n\n.\n\nIndeed by the previous lemmas,\nE[e\n\n=\n\nZ\n\nT\n\n−r(τ1 −τ2 )\n\ne−r(s−τ2 ) [dN (\n\nτ2\n\n1τ1 <T |Fτ2 ] =\n\nZ\n\nT\n\nτ2\n\ne−r(s−τ2 ) dP (τ1 ≤ s|Fτ2 )\n\n−2\n−Yτ2 + ν1 (s − τ2 )\n−Yτ2 − ν1 (s − τ2 )\n√\n√\n) + e−2ν1 σ1 Yτ2 dN (\n)]\nσ1 s − τ2\nσ1 s − τ2\n\nα + β −μτ (β−α) −μτ2 − α(T − τ2 ) α − β −μτ (β+α) −μτ2 + α(T − τ2 )\n√\n√\n=\n)+\n)+\nN(\nN(\ne 2\ne 2\n2α\n2α\nT − τ2\nT − τ2\n−2\n\n+e−2ν1 σ1\n\nYτ2\n\n[\n\nα − β −μτ (−β−α) −μτ2 − α(T − τ2 ) α + β −μτ (−β+α) −μτ2 + α(T − τ2 )\n√\n√\n)+\n)],\nN(\nN(\ne 2\ne 2\n2α\n2α\nT − τ2\nT − τ2\n\nand the formula follows.\n\n6\n\nAppendix 2: First hitting time in a polyhedral\ndomain\n\nOur results rely largely on the following two-dimensional extension of a Theorem\nof Daniels, see [6, Fla 3.1]. This natural extension is important in view of\napplications to multidimensional Brownian processes, particularly in the setting\nof credit risk. It was first announced without a proof in [11] and could be easily\nextended to higher dimensional cases. We could not find a proof in the literature,\nand include therefore a short demonstration in this appendix.\n(x ,y )\nLet Zt 0 0 (abbreviated to Zt when no confusion can arise), a planar Brownian starting at (x0 , y0 ) evolving in a polyhedral domain D with absorbing boundary ∂D. We write τ for the first hitting time of the boundary and f (x0 , y0 , x, y, t)\n(abbreviated to f (x, y, t) when no confusion can arise) for the density of the surviving process:\nf (x, y, t)dxdy := P (Zt ∈ (dx, dy), τ > t)\n\nWe look for the distribution of hitting times: P (τ ∈ dt, Zτ ∈ dp), dp ∈ ∂D\nand can assume (up to a planar rotation) that ∂D is horizontal and an upper\nboundary for D in the neighborhood of p, so that dp is a horizontal line element:\ndp = (da, b), with p = (a, b) ∈ ∂D.\nTheorem 6.1 We have:\n\nP (τ ∈ dt, Zτ = (da, b)) =\n10\n\n−\n\n1 ∂\nf (a, b, t)dadt.\n2 ∂b\n\n(1)\n\n\fSketch of the proof : Let us write φ(x, y, ∆t)dadt for P (τ ∈ dt, Zτ ∈\n(da, b)|Zt−∆t = (x, y)), where in practice we will choose ∆t << 1 and study\nthe asymptotics when ∆t goes to 0. From Daniels' theorem [6, Fla 3.1] which\ncomputes the first exit density for a one-dimensional BM, together with the\nindependence of the horizontal and vertical components of a two-dimensional\nBM, we get, in a neighborhood of (a, b):\nφ(x, y, ∆t) ∼\n=\n\n(a − x)2\n(b − y)2\n1\nexp\n−\n*\nexp\n−\n* (b − y)\n2π∆t2\n2∆t\n2∆t\n\nThen,\nP (τ ∈ dt, Zτ ∈ (da, b))da\n\n−1\n\ndt\n\n−1\n\nZ\n\n=\n\nf (x, y, t − ∆t)φ(x, y, ∆t)dxdy\n\nD\n\n∼\n=\n\nZ\n\n[f (a, y, t−∆t)+(x−a)fx′ (a, y, t−∆t)+\n\n(x − a)2 ′′\nfx (a, y, t−∆t)]φ(x, y, ∆t)dxdy\n2\n\nD\n\nBy symmetry, in a neighborhood of (a, b) in D, φ(x, y, ∆t) ∼\n= φ(2a−x, y, ∆t),\nso that the second term of the expansion vanishes. Since ∂D is an absorbing\nboundary, f (a, b, t − ∆t) = fx′ (a, b, t − ∆t) = fx′′ (a, b, t − ∆t) = 0 and the third\nterm reads:\nZ\nZ +∞\n(x−a)2\n1\n1\n(x − a)2 ′′\n(x − a)2\n√\ne− 2∆t dx\nfx (a, y, t − ∆t)φ(x, y, ∆t)dxdy ∼\n= −\n2\n∆t −∞\n2\n2π∆t\nD\nZ b\n′′\n(b−y)2 ∂f\n1\nx\ne− 2∆t\n(a, b, t − ∆t)dy\n∗\n(b − y)2 √\n∂y\n2π∆t\n−∞\n= O(∆t)\n\nSimilarly, the first term reads:\nZ\n\nf (a, y, t − ∆t)φ(x, y, ∆t)dxdy\n\n∼\n=\n\nZ\n\nb\n\nb\n\n=\n\nZ\n\nD\n\n−∞\n\n−∞\nZ b\n\n= −\n\n(b − y) − (b−y)2\n√\ne 2dt f (a, y, t − ∆t)dy\n2π∆t3/2\n\nZ\n\n−∞\n\n(b − y) − (b−y)2\n√\ne 2∆t f (a, y, t − ∆t)dy\n2π∆t3/2\n\n−∞\n\n(b − y)2 − (b−y)2 ′\n√\ne 2∆t fy (a, b, t − ∆t)dy\n2π∆t3/2\n\n1\n= − fy′ (a, b, t − ∆t)\n2\nThe Theorem follows.\n\nReferences\n[1] Bank for International Settlements, OTC Derivatives:\nsettlement\nprocedures and counterparty risk management, Basel, Sept. 1998.\nhttp://www.bis.org\n11\n\n∞\n\n(x−a)2\n1\n√\ne− 2∆t dx\n2π∆t1/2\n\n\f[2] Basel Committee on Banking Supervision, The Application of Basel 2 to\ntrading activities and the treatment of double default effects, July 2005,\nhttp://www.bis.org\n[3] F. Black and J.C. Cox, Valuing corporate securities: Some effects of bond\nindenture provisions. J. Finance. 31 (1976) 351-367.\n[4] T. Bielecki and M. Rutkowski, Credit risk: modeling, valuation and hedging. Springer Finance. Springer-Verlag, Berlin, 2002.\n[5] H.S. Carslaw and J.C. Jaeger, Conduction of heat in solids, New York, The\nClarendon Press, 1988.\n[6] H. Daniels, Sequential tests constructed from images, Ann. Stat. 10 (1982),\n394-400.\n[7] A. Gray, G.B. Mathews, A treatise on Bessel functions and their applications to physics, New York, Dover Publications, 1966.\n[8] H. He, W. Keirstead and J. Rebholz, Double lookbacks. Math. Finance 8\n(1998), no. 3, 201–228.\n[9] J. Hull, Risk Management and Financial Institutions, Pearson (2007).\n[10] K. Itô and H. McKean, Diffusion processes and their sample paths, Die\nGrundlehren der mathematischen Wissenschaften, Band 125, SpringerVerlag (1974).\n[11] S. Iyengar, Hitting lines with two-dimensional Brownian motion, SIAM J.\nAppl. Math. 45 (6) (1985) 983-989.\n[12] R. C. Merton, On the pricing of corporate debt: The risk structure of\ninterest rates. J. Finance. 29, (1974), 449-470.\n[13] F. Patras, A reflection principle for correlated defaults, Stoch. Processes\nAppl. 116 (2006) 690-698.\n[14] Ph. Schönbucher, Credit derivatives pricing models, Wiley, 2003.\n[15] O. Vasicek, Probability of Loss on a Loan Portfolio, working paper, KMV,\n1987, published as: Loan Portfolio Value, Risk, Dec. 2002.\n[16] G. Watson, A treatise on the theory of Bessel functions, 2nd ed., Cambridge\nUniversity Press, 1962.\n[17] C. Zhou, An analysis of default correlations and multiple defaults, Review\nof Financial Studies, 14 (2) (2001), 555-576.\n\n12\n\n\f"}