{"id": "http://arxiv.org/abs/0911.1728v3", "guidislink": true, "updated": "2011-02-07T15:35:30Z", "updated_parsed": [2011, 2, 7, 15, 35, 30, 0, 38, 0], "published": "2009-11-09T17:19:44Z", "published_parsed": [2009, 11, 9, 17, 19, 44, 0, 313, 0], "title": "Mass Varying Neutrinos, Quintessence, and the Accelerating Expansion of\n  the Universe", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0911.5582%2C0911.0162%2C0911.3520%2C0911.0386%2C0911.4149%2C0911.2598%2C0911.4366%2C0911.3226%2C0911.5300%2C0911.4445%2C0911.5315%2C0911.0314%2C0911.3611%2C0911.0935%2C0911.3416%2C0911.1943%2C0911.0080%2C0911.0584%2C0911.1728%2C0911.4274%2C0911.2978%2C0911.1752%2C0911.5721%2C0911.3744%2C0911.0598%2C0911.1356%2C0911.2246%2C0911.5619%2C0911.3861%2C0911.0418%2C0911.0304%2C0911.1451%2C0911.1876%2C0911.0967%2C0911.3859%2C0911.1378%2C0911.3357%2C0911.2897%2C0911.1178%2C0911.1490%2C0911.2370%2C0911.1282%2C0911.4972%2C0911.0778%2C0911.1946%2C0911.0929%2C0911.5335%2C0911.4918%2C0911.0312%2C0911.0919%2C0911.1521%2C0911.5105%2C0911.4279%2C0911.0412%2C0911.4026%2C0911.1087%2C0911.2401%2C0911.4530%2C0911.0439%2C0911.5669%2C0911.4700%2C0911.2668%2C0911.0101%2C0911.3145%2C0911.1493%2C0911.4193%2C0911.2565%2C0911.1802%2C0911.5712%2C0911.4737%2C0911.0206%2C0911.2029%2C0911.5226%2C0911.0626%2C0911.5713%2C0911.0594%2C0911.4964%2C0911.0168%2C0911.2666%2C0911.2143%2C0911.2971%2C0911.5174%2C0911.2180%2C0911.4822%2C0911.2078%2C0911.4673%2C0911.0854%2C0911.5069%2C0911.4487%2C0911.3170%2C0911.1189%2C0911.3449%2C0911.2496%2C0911.0205%2C0911.2914%2C0911.3672%2C0911.2089%2C0911.5252%2C0911.4808%2C0911.1676%2C0911.0183&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Mass Varying Neutrinos, Quintessence, and the Accelerating Expansion of\n  the Universe"}, "summary": "We analyze the Mass Varying Neutrino (MaVaN) scenario. We consider a minimal\nmodel of massless Dirac fermions coupled to a scalar field, mainly in the\nframework of finite temperature quantum field theory. We demonstrate that the\nmass equation we find has non-trivial solutions only for special classes of\npotentials, and only within certain temperature intervals. We give most of our\nresults for the Ratra-Peebles Dark Energy (DE) potential. The thermal\n(temporal) evolution of the model is analyzed. Following the time arrow, the\nstable, metastable and unstable phases are predicted. The model predicts that\nthe present Universe is below its critical temperature and accelerates. At the\ncritical point the Universe undergoes a first-order phase transition from the\n(meta)stable oscillatory regime to the unstable rolling regime of the DE field.\nThis conclusion agrees with the original idea of quintessence as a force making\nthe Universe roll towards its true vacuum with zero \\Lambda-term. The present\nMaVaN scenario is free from the coincidence problem, since both the DE density\nand the neutrino mass are determined by the scale M of the potential. Choosing\nM ~ 10^{-3} eV to match the present DE density, we can obtain the present\nneutrino mass in the range m ~ 10^{-2}-1 eV and consistent estimates for other\nparameters of the Universe.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0911.5582%2C0911.0162%2C0911.3520%2C0911.0386%2C0911.4149%2C0911.2598%2C0911.4366%2C0911.3226%2C0911.5300%2C0911.4445%2C0911.5315%2C0911.0314%2C0911.3611%2C0911.0935%2C0911.3416%2C0911.1943%2C0911.0080%2C0911.0584%2C0911.1728%2C0911.4274%2C0911.2978%2C0911.1752%2C0911.5721%2C0911.3744%2C0911.0598%2C0911.1356%2C0911.2246%2C0911.5619%2C0911.3861%2C0911.0418%2C0911.0304%2C0911.1451%2C0911.1876%2C0911.0967%2C0911.3859%2C0911.1378%2C0911.3357%2C0911.2897%2C0911.1178%2C0911.1490%2C0911.2370%2C0911.1282%2C0911.4972%2C0911.0778%2C0911.1946%2C0911.0929%2C0911.5335%2C0911.4918%2C0911.0312%2C0911.0919%2C0911.1521%2C0911.5105%2C0911.4279%2C0911.0412%2C0911.4026%2C0911.1087%2C0911.2401%2C0911.4530%2C0911.0439%2C0911.5669%2C0911.4700%2C0911.2668%2C0911.0101%2C0911.3145%2C0911.1493%2C0911.4193%2C0911.2565%2C0911.1802%2C0911.5712%2C0911.4737%2C0911.0206%2C0911.2029%2C0911.5226%2C0911.0626%2C0911.5713%2C0911.0594%2C0911.4964%2C0911.0168%2C0911.2666%2C0911.2143%2C0911.2971%2C0911.5174%2C0911.2180%2C0911.4822%2C0911.2078%2C0911.4673%2C0911.0854%2C0911.5069%2C0911.4487%2C0911.3170%2C0911.1189%2C0911.3449%2C0911.2496%2C0911.0205%2C0911.2914%2C0911.3672%2C0911.2089%2C0911.5252%2C0911.4808%2C0911.1676%2C0911.0183&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We analyze the Mass Varying Neutrino (MaVaN) scenario. We consider a minimal\nmodel of massless Dirac fermions coupled to a scalar field, mainly in the\nframework of finite temperature quantum field theory. We demonstrate that the\nmass equation we find has non-trivial solutions only for special classes of\npotentials, and only within certain temperature intervals. We give most of our\nresults for the Ratra-Peebles Dark Energy (DE) potential. The thermal\n(temporal) evolution of the model is analyzed. Following the time arrow, the\nstable, metastable and unstable phases are predicted. The model predicts that\nthe present Universe is below its critical temperature and accelerates. At the\ncritical point the Universe undergoes a first-order phase transition from the\n(meta)stable oscillatory regime to the unstable rolling regime of the DE field.\nThis conclusion agrees with the original idea of quintessence as a force making\nthe Universe roll towards its true vacuum with zero \\Lambda-term. The present\nMaVaN scenario is free from the coincidence problem, since both the DE density\nand the neutrino mass are determined by the scale M of the potential. Choosing\nM ~ 10^{-3} eV to match the present DE density, we can obtain the present\nneutrino mass in the range m ~ 10^{-2}-1 eV and consistent estimates for other\nparameters of the Universe."}, "authors": ["G. Y. Chitov", "T. August", "A. Natarajan", "T. Kahniashvili"], "author_detail": {"name": "T. Kahniashvili"}, "author": "T. Kahniashvili", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevD.83.045033", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0911.1728v3", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0911.1728v3", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "29 pages, 7 figures. V. 3: Analysis of the dynamics of the Universe\n  and some refs. added; extended version to be published in PRD", "arxiv_primary_category": {"term": "astro-ph.CO", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph.CO", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "hep-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0911.1728v3", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0911.1728v3", "journal_reference": "Phys.Rev.D83:045033,2011", "doi": "10.1103/PhysRevD.83.045033", "fulltext": "Mass Varying Neutrinos, Quintessence, and the Accelerating\nExpansion of the Universe\nGennady Y. Chitov,1 Tyler August,1 Aravind Natarajan,2 and Tina Kahniashvili2, 1, 3\n\narXiv:0911.1728v3 [astro-ph.CO] 7 Feb 2011\n\n1 Department\n\nof Physics, Laurentian University,\nRamsey Lake Road, Sudbury, ON, P3E 2C6, Canada\n2 McWilliams Center for Cosmology and Department of Physics,\nCarnegie Mellon University, 5000 Forbes Ave, Pittsburgh, PA 15213, USA\n3 National Abastumani Astrophysical Observatory,\nIlia Chavchavadze State University, 2A Kazbegi Ave, Tbilisi, GE-0160, Georgia\n(Dated: October 30, 2018)\nWe analyze the Mass Varying Neutrino (MaVaN) scenario. We consider a minimal\nmodel of massless Dirac fermions coupled to a scalar field, mainly in the framework of\nfinite temperature quantum field theory. We demonstrate that the mass equation we\nfind has non-trivial solutions only for special classes of potentials, and only within\ncertain temperature intervals. We give most of our results for the Ratra-Peebles\nDark Energy (DE) potential. The thermal (temporal) evolution of the model is\nanalyzed. Following the time arrow, the stable, metastable and unstable phases\nare predicted. The model predicts that the present Universe is below its critical\ntemperature and accelerates. At the critical point the Universe undergoes a firstorder phase transition from the (meta)stable oscillatory regime to the unstable rolling\nregime of the DE field. This conclusion agrees with the original idea of quintessence\nas a force making the Universe roll towards its true vacuum with zero Λ-term. The\npresent MaVaN scenario is free from the coincidence problem, since both the DE\ndensity and the neutrino mass are determined by the scale M of the potential.\nChoosing M ∼ 10−3 eV to match the present DE density, we can obtain the present\nneutrino mass in the range m ∼ 10−2 − 1 eV and consistent estimates for other\nparameters of the Universe.\nPACS numbers:\n\nI.\n\nINTRODUCTION\n\nNeutrino mass related questions are of great interest for particle physics as well as for\ncosmology (for reviews see Ref. [1] and references therein). Current upper limits on the\nsum of neutrino masses from cosmological observations are of the order of 1 eV [2–4], while\nneutrino oscillations give a lower bound of roughly 0.01 eV [5, 6], making neutrino mass an\nestablished element of particle physics. Furthermore, understanding the origin of neutrino\nmass opens a window into understanding physical processes beyond the standard model of\nparticle physics [7–10].\nIt is now well established that about seventy four percent of the Universe is comprised\nof dark energy (DE) (for reviews see Ref. [11] and citation therein). The present stage of\nevolution of the Universe is governed by this dominant DE contribution, and the Universe\nexperiences an accelerating expansion [12, 13]. The nature of DE is still unknown, and it is\none of the major questions of modern cosmology. There are, broadly speaking, three major\n\n\f2\npossibilities proposed to explain the DE [11]. Most straightforwardly, and in good agreement\nwith the current observational data, it can be present just as the cosmological constant [11].\nSecondly, the DE can be accommodated in some framework of the modified non-Einsteinian\ngravity theories (see, e.g., Refs. [14, 15]). And lastly, following the original proposals [16, 17]\non the DE originating from a scalar field action similar to the inflaton field, there has been\na lot of activity in constructing and analyzing various trial scalar field Lagrangians to model\nthe DE [13]. Note, that it is even unclear what kind of scalar field potential governs the\ninflationary expansion of the Universe [18], and as the result, the effective quantum field\nthat adequately describes inflation is still under debate [19]. A similar observation can be\ndrawn from analyzing many potentials proposed for the DE action [13].\nOn the other hand, several cosmological and astrophysical observations imply that about\ntwenty two percent of the Universe consists of dark matter (DM) [11], if we admit the general\nrelativity theory of gravity. Most probably DM is formed through massive weakly interacting\nparticles (WIMPs), and the nature of these particles is also still unknown. There are several\nrecent observations performed by PAMELA [20] and GLAST missions which indicate DM\nparticle annihilations [21]. Recently it was proposed that both these observations could be\nused to test baryogenesis [22] which is one of the important problems of the standard particle\nphysics model.\nAnother puzzling question in modern cosmology is the coincidence problem - the density\nof DE is comparable to the present energy density of DM. In turn, the latter is comparable\n(within the order of magnitude), to the energy density of cosmological neutrinos [1, 2]). Is\nthere a mechanism explaining this coincidence? A very convincing answer to this question is\ngiven by the mechanism of DM mass generation via various types of DM-DE couplings, ranging from Yukawa to more exotic ones. [23–28] The mass of the DM particle in this approach\nis naturally time-dependent, and they were coined Varying Mass Particles (VAMPs). Various DE–DM interaction models have been constrained by observations of Supernovae type\nIa [29], the age of the Universe [30–32], Cosmic Microwave Background (CMB) anisotropies\n[33, 34], and Large Scale Structure (LSS) formation [35].\nFardon, Nelson and Weiner elaborated on the VAMP mechanism in the context of neutrinos. [36]1 . In their model the relic neutrinos, i.e., fermionic field(s), interact with a scalar\nfield via the Yukawa coupling. If the decoupled neutrino field is initially massless, then the\ncoupling generates a (varying) mass of neutrinos in this DE-neutrinos model. This mass\nvarying neutrino (MaVaN) scenario is quite compelling, since it connects the origin of neutrino mass to the DE, and solves the additional coincidence problem of why the neutrino\nmass and DE are of comparable scales [38]. (For more on the coincidence, see, e.g. [39]). To\nconsider neutrinos as particles which get their mass through the coupling is attractive for\nparticle physics, as well as for its cosmological consequences. However there are significant\nissues that have to be resolved for the sake of viability of the MaVaN scenario. Most notably,\nit has been shown [40] that the model of Ref. [36] suffers from a strong instability due to\nthe negative sound speed squared of the DE-neutrino fluid (see also [41]).\nAny DM-DE coupling induces observable changes in large scale structure formation [42].\nThe main reason for this is due to the presence of additional DM contributions (perturbations) in the equation of motion which determines the dynamics of the scalar field. The\nchanges in the dynamics are drastic when massive neutrinos are coupled to DE [40]. In\nthis case the squared sound speed of the DE-neutrino fluid defined as c2s = δP /δρ, (where\n1\n\nThe DE-neutrino coupling and the baryogenesis constraints have been also studied also in Ref. [37]\n\n\f3\nδ represents the variation, and P and ρ are pressure and energy density of the DE-neutrino\nfluid) is negative. The negative squared sound speed results in an exponential growth of\nscalar perturbations. [43–46]\nAfter the critique in Ref. [40], the issue of stability of the DE-neutrinos fluid has been\naddressed by many authors [41, 46–53]. Various physical assumptions were made in those\nreferences in order to avoid the exponential clustering of neutrinos. In particular, to achieve\nstability, proposals were put forward to make the DE-DM model more complicated, e.g., by\nextending it to a multi-component scalar field, or by promoting its supersymmetry. [49, 51]\nWe however are not inclined to pursue this line of thought and will explore the simplest\npossible \"minimal\" model. As we will demonstrate, the occurrence of the instability in the\ncoupled DE-neutrinos model is meaningful, and we will explore the physical implications of\nthis phenomenon. Note that Wetterich and co-workers [46] have already analyzed various\nimplications of the instability in the MaVaN model on the dynamics of neutrino clustering.\nIn this paper we re-address the analysis of the DE-neutrinos coupled model. What is\nreally new in our results, to the best of our knowledge, apart from a consistent equation\nfor the equilibrium condition, is the analysis of the thermal (i.e. temporal) evolution of the\nMaVaN model and prediction of its stable, metastable and unstable phases. The analysis\nof the dynamics in the unstable phase results in, for the first time in the framework of the\nMaVaN scenario, a picture of the present-time Universe totally consistent with observations.\nOur findings are in line with the original proposal [16, 17] of the DE potential (quintessence)\nto model the Universe slowly rolling towards its true vacuum (Λ = 0). As it turns out, the\npresent Universe, seen as a system of the coupled DE (quintessence) field and fermions\n(neutrinos) is below its critical temperature. It is similar to a supercooled liquid which has\nnot crystallized yet: its high temperature (meta)stable phase became unstable, but the new\nlow-temperature stable phase (Λ = 0) is still to be reached. The Afshordi-Zaldarriaga-Kohri\ninstability corresponding to c2S < 0 is just telling us this.\nThe rest of the paper is organized as follows: In Section II we give the outlook of the\nmodel and formalism applied and derive the basic equations for the coupled model. In\nSection III we present the qualitative analysis of the equation which yields the fermionic\n(neutrino) mass. Section IV contains analysis of the coupled model with the Ratra-Peebles\nDE potential at equilibrium. The dynamics of the model applied to the whole Universe is\nstudied in Section V. The results are summarized in the concluding Section VI.\nII.\n\nMODEL AND FORMALISM. BASIC EQUATIONS\nA.\n\nOutlook\n\nIn this paper we focus on the case when the scalar field potential U(φ) does not have\na non-trivial minimum, and the generation of the fermion mass is due to the breaking of\nchiral symmetry in the Dirac sector of the Lagrangian. A non-trivial solution of the fermionic\nmass equation is a result of the interplay between the scalar and fermionic contributions.\nWe consider the most natural and intuitively plausible Yukawa coupling between the Dirac\nand the scalar fields.\nThe key assumption is that the fermionic mass generation can be obtained from minimization of the thermodynamic potential. That is, the coupled system of the scalar bosonic\nand fermionic fields is at equilibrium, at least at some temperatures. This will be analyzed\nbelow more specifically. We assume the cosmological evolution, governed by the scale factor\n\n\f4\na(t) to be slow enough that the coupled system is at equilibrium at a given temperature\nT (a). Then the methods of thermal quantum field theory [54, 55] can be applied.\nThis problem is rather well studied with quantum field theory and statistical physics\nin different contexts [54–56]. The major conceptual difficulty in applying quantum fieldtheoretical methods for the dark-energy scalar field is the lack of \"well-behaved\" potentials\ninteresting for cosmological applications. For instance, a class of the very popular inverse\npower law slow-rolling quintessence potentials [13] are singular at the origin. Consequently,\nthe field theory should be understood as a sort of effective theory, and we plan to address\nthis issue more deeply in our future work.\nAs far as the fermionic sector of the theory is concerned, one needs to distinguish two\ndifferent cases pertinent for neutrino applications:\n(i) an equal number of fermions and antifermions, i.e., zero chemical potential μ = 0;\n(ii) a surplus of particles over antiparticles, and small non-zero chemical potential.\nFor the bounds on the neutrino chemical potential, see Refs. [1, 57]. If experiments\nconfirm neutrinoless double beta decay, i.e., that neutrinos are Majorana fermions, then\nthe lepton number is not conserved [8], and one cannot introduce a (non-zero) chemical\npotential. Then case (i) above is applicable, proviso that the Majorana fields are utilized\ninstead of the Dirac ones. For the case (i) with Dirac fermions the ground state corresponds\nto a complete annihilation of fermion-antifermion pairs, i.e. the fermions completely vanish\nin the zero-temperature limit.\nAssumption of the fermion-antifermion asymmetry and (conserving) particle surplus, i.e.,\nof a non-zero chemical potential, results in the fermionic contributions which survive the zerotemperature limit. However the smallness of the zero-temperature contribution renders this\nissue rather academic. Indeed, for the neutrinos we are interested in this study, by assuming\nthe maximal particle surplus n◦ ∼ 115 cm−3 , onep\ngets the Fermi momentum kF ∼ 3*10−4 eV.\n−2\nFor m ∼ 10 eV, one obtains μ(T = 0) = εF = kF2 + m2 = m + O(10−4 eV). This results\nin a non-trivial vacuum with the particle surplus frozen within an extremely narrow Fermi\nshell m ≤ ε ≤ εF . Thus, trying to grasp the essential physics in this study from possibly\nthe simplest \"minimal model\", we assume the fermions to be described by a Dirac spinor\nfield with zero chemical potential.\nIn this work we will use the standard methods of general relativity and finite-temperature\nquantum field theory extended for fields living in a spatially flat Universe with the\nFriedmann-Lemaı̂tre-Robertson–Walker (FLRW) metric where the line element is ds2 =\ndt2 − a2 (t)dx2 . Here t is the physical time and a(t) is the scale factor, which can be obtained\nfrom the Friedmann equations [9, 10]\n\u0012 \u00132\nȧ\n8πG\n2\nH (t) =\n=\nρtot ,\n(1)\na\n3\n4πG\nä\n(ρtot + 3Ptot ) .\n(2)\nḢ(t) + H 2 (t) = = −\na\n3\nEqs. (1)-(2) also lead to the continuity equation\nρ̇tot +\n\n3ȧ\n(ρtot + Ptot ) = 0 .\na\n\n(3)\n\nHere the dot represents the physical time derivative and ρtot and Ptot are the total energy\ndensity and pressure of the Universe. In accordance with the (standard) ΛCDM model, the\nUniverse is assumed to consist of (1) DE, (2) cold DM (CDM) made of weakly interacting\n\n\f5\nmassive particles, presumably MDM > 1 ∼ 10 GeV, (3) photons, and (4) baryons. The\nDM and baryon density parameters today are ΩDM = ρDM (tnow )/ρcr ≈ 0.22 and Ωb =\nρb (tnow )/ρcr ≈ 0.04. Here ρcr = 3H02/(8πG) = 8.1h2 × 10−47 GeV4 is the critical density\ntoday, tnow defines the current time, H0 = 2.1h×10−42 GeV is the present Hubble parameter,\nG is the Newton constant, and h ≈ 0.72 is the Hubble parameter in units of 100 km/sec/Mpc.\nThe photon contribution to the energy density today can be neglected. The flatness of the\nUniverse leads to the relative energy density of the DE-neutrino coupled fluid Ωφν ≈ 0.74.\nTo ensure the accelerated expansion of the Universe today, the r.h.s. of Eq. (2) must be\npositive at t = tnow .\nIn this paper we will not assume the existence of the cosmological constant Λ, as the\nΛCDM model suggests. Instead we accept the hypothesis of the dynamical dark energy\ndescribed by a scalar field. This is a bold assumption and a highly debatable issue. We\nvindicate our approach a posteriori by the consistent picture we arrive at the end. For a\nreview and/or alternative approaches, see, e.g., Refs. [13, 58, 59]. The massless neutrinos\nare described by the conventional Dirac Lagrangian. The resulting model is given by the\ncoupled Dirac and scalar fields. The grand thermodynamic potential of the coupled model\ncan be derived from the euclidian functional integral representation of the grand partition\nfunction. The dynamics of the coupled model is governed by the Friedmann equations.\nThroughout the paper we use natural units where ~ = c = kB = 1.\nB.\n\nBosonic Scalar Field\n\nThe bosonic scalar field Hamiltonian in the FLRW metric reads as [9, 60]\nZ\nh1\ni\n1\n3 3\n2\n2\nHB = a d x φ̇ + 2 (∇φ) + U(φ) ,\n(4)\n2\n2a\nR\nwhere the comoving volume V = d3 x, while the physical volume Vphys = a3 (t)V . Since\nthis field does not carry a conserved charge (number), the chemical potential μ = 0. The\ngrand partition function in the functional integral representation:\nZ\nE\n−β Ĥ\nZB ≡ Tr e\n= Dφ e−SB\n(5)\nwith the bosonic euclidian action\nZ β Z\nh1\ni\n1\nE\n3 3\n2\n2\nSB =\ndτ a(t) d x (∂τ φ) + 2 (∇φ) + U(φ) ,\n2\n2a\n0\n\n(6)\n\nwhere φ = φ(x, τ ).\nIt is instructive to find the partition function of the free scalar field U(φ) = 12 Mb2 φ2\nfollowing the methods explained by Kapusta and Gale [54] for the case of the Minkowski\nmetric. Rescaling of the field\nφ̃ = a3/2 φ\n(7)\n\nchanges the partition function (5) by a thermodynamically irrelevant prefactor. The functional integration over φ̃ of the Gaussian action gives\nZ\nq\n\u0010\n\u0011i\n√ 2\nd3 k h\n2\n2 /a2 + log 1 − e−β Mb +k 2 /a2\n+\nk\n.\n(8)\nM\nβ\nlog ZB = −V\nb\n(2π)3\n\n\f6\nThen the density (with respect to the physical volume) of the thermodynamic potential is\ngiven by\n\nwhere ε =\n\n1\nΩB ≡ − 3 log ZB = −PB\nβa V\nZ\n\u0001\u0003\n1\nd3 k \u0002\nε + log 1 − e−βε ,\n=\n3\n(2π)\nβ\n\n(9)\n\np\nMb2 + k 2 and PB is the pressure due to the bosonic field.\nC.\n\nFree Dirac Spinor Field\n\nThe Dirac Hamiltonian in the FLRW metric is [60]\nZ\n\u0001\nı\nHD = a3 d3 x ψ̄ − γ * ∇ + m ψ .\na\n\n(10)\n\nThe grand partition function is given by the following Grassmann functional integral:\nZ\nE\n−β(Ĥ−μQ̂)\nZD ≡ Tr e\n= D ψ̄Dψ e−SD\n(11)\nR\nwhere the conserved charge (lepton number) operator Q̂ = a3 d3 xψ † ψ and the euclidian\naction\nZ β Z\n\u0011\n\u0010 ∂\nı\no\nE\n3 3\no\n(12)\n− γ * ∇ + m − μγ ψ(x, τ ).\nSD =\ndτ a(t) d x ψ̄(x, τ ) γ\n∂τ\na\n0\nBy rescaling the Grassmann fields (7) and using the standard techniques [54], we get the\nthermodynamic potential density (pressure) as a function of the chemical potential and\ntemperature:\n1\nlog ZD = −PD\nβa3 V\nZ\n\u0001 1\n\u0001\u0003\n1\nd3 k \u0002\n−βε−\n−βε+\nε\n+\nlog\n1\n+\ne\n+\nlog\n1\n+\ne\n,\n= −2\n(2π)3\nβ\nβ\n\nΩD ≡ −\n\nwhere\n\nε(k) =\n\n√\n\nm2 + k 2 ,\n\n(13)\n\n(14)\n\nand ε± = ε(k) ± μ. The first term on the r.h.s. of Eq. (13) corresponds to the vacuum\ncontribution to the thermodynamic potential (pressure):\nZ\nd3 k\nε(k)\n(15)\n− Ω0 = P0 = 2\n(2π)3\nIntroducing the notation for the Fermi distribution function\nnF (x) ≡\n\n1\n,\neβx + 1\n\nEq. (13) can be brought to the following form:\nZ ∞ 4\n\u0003\n1\nk dk \u0002\n− ΩD = PD = P0 + 2\nnF (ε− ) + nF (ε+ )\n3π 0 ε(k)\n\n(16)\n\n(17)\n\n\f7\nD.\n\nCoupled Model: Scalar Field and Dirac Massless Fermions\n\nLet us consider a scalar bosonic field interacting via a Yukawa coupling with massless\nDirac fermions. The euclidian action of the model in the FLRW metric reads:\nZ β Z\nE\nE\nS = SB + SD m=0 + g\ndτ a3 d3 x φψ̄ψ\n(18)\n0\n\nThe path integral for the partition function of the coupled model is:\nZ\nZ = DφD ψ̄Dψ e−S\nThe Grassmann fields can be formally integrated out resulting in\nZ\nZ\n\u0002\n\u0003\n−S(φ)\nZ = Dφ e\n= Dφ exp − SBE + log DetD̂(φ) ,\n\n(19)\n\n(20)\n\nwhere the Dirac operator\n\nD̂(φ) = γ o\n\nı\n∂\n− γ * ∇ + gφ(x, τ ) − μγ o\n∂τ\na\n\n(21)\n\nThe thermodynamic potential Ω of the model (18) at tree level can be found by evaluating\nthe path integral (20) in the saddle-point approximation. Assuming the existence of a\nconstant (x, τ )-independent field φc which minimizes the action S(φ), the term log DetD̂\ncan be evaluated exactly, and fermionic contribution to the thermodynamic potential is\ngiven by Eqs. (13) or (17) with the fermionic mass\nm = gφc .\n\n(22)\n\nThe bosonic contribution to the partition function in this approximation is simply Z ∝\nexp[−βa3 V U(φc )] . The thermodynamic potential density is given then by\nΩ(φc ) = U(φc ) + ΩD (φc ) .\n\n(23)\n\nSelf-consistency of the employed saddle-point approximation naturally coincides with the\ncondition of minimum of the thermodynamic potential at equilibrium (at fixed temperature\nand chemical potential):\n∂Ω(φ)\n=0,\n(24)\n∂φ φ=φc\nand\n\n∂ 2 Ω(φ)\n∂φ2\n\nφ=φc\n\n>0,\n\n(25)\n\nNote that a non-trivial solution φc of Eq. (24) (if it exists) is called the classical field: it\nis the average of the bosonic field, i.e., φc = hφi. Eqs. (22,23,24) can be brought to the\nequivalent form:\nU ′ (φc ) + gρs = 0 ,\n(26)\n\n\f8\nwhere the scalar fermionic density (a.k.a. the chiral density) ρs is given by the following\nexpression:\nZ\n\u0003\nhN̂i\n∂ΩD\nm ∞ k 2 dk \u0002\nρs ≡\nnF (ε− ) + nF (ε+ ) ,\n(27)\n=\n= ρ0 + 2\nV\n∂m\nπ 0 ε(k)\nR\nand N̂ = d3 xψ̄ψ. Here ρ0 stands for the vacuum contribution to the chiral condensate:\nZ\nm ∞ k 2 dk\n∂Ω0\n=− 2\n.\n(28)\nρ0 ≡\n∂m\nπ 0 ε(k)\nNote that even if the time, i.e., a(t), does not enter explicitly in the equations for the\nthermodynamic quantities of the coupled, fermionic or bosonic models (9,13,23,26,27), and\nthey look like their counterparts in a flat static Universe, such parameters as, e.g., the\ntemperature and chemical potential in those equations are time-dependent, i.e., T = T (a)\nand μ = μ(a). The particular form of the dependencies T (a) and μ(a) must be determined\nfrom the Friedmann continuity equation (3) which relates the energy density ρ(T ) and\npressure P (T ) to the evolution of a(t)[9, 10]. In addition, the fermionic mass m ∝ φc in the\ncoupled model is also time varying, since the time enters into φc (26) via T, μ, and all three\nfunctions m(a), T (a) and μ(a) are governed by the Friedmann equations (1,2,3).\nThe present theory works consistently for the physical quantities (bosonic or fermionic)\nmeasured with respect to their vacuum contributions. So, in the rest of the paper we\nwill employ the thermodynamic quantities with subtracted vacuum contributions, keeping\nhowever, the same notations, e.g.:\nΩD 7→ ΩD − Ω0 , PD 7→ PD − P0 , ρs 7→ ρs − ρ0 .\n\n(29)\n\nThen, according to Volovik [61], the pressure and energy of the pure and equilibrium vacuum\nis exactly zero. (The renormalization of the vacuum terms is, of course a very subtle issue.\nThere are alternative approaches to this problem known from the literature. See, e.g.,\n[62, 63].)\nIII.\n\nANALYSIS OF THE MASS (GAP) EQUATION: GENERAL PROPERTIES\n\nIn cases interesting for cosmological applications, the scalar field potential U(φ) does not\nhave a non-trivial minimum, and the generation of the fermion mass (i.e. a solution of (24)\n0 < φc < ∞) is due to the interplay between the scalar and fermionic contributions to the\ntotal thermodynamic potential (23).\nFrom now on we adapt our equations for the case of equal number of fermions and\nantifermions and μ = 0, as discussed in Sec. II A. Keeping in mind the neutrinos, we assume\nan extra flavor index of fermions with the number of flavors s. (For neutrinos s = 3.) We\nalso assume the flavor degeneracy of the fermionic sector.\nBefore proceeding further, we need to make some important observations regarding the\nbehavior of the coupled model in two limiting cases. Assuming that a non-trivial solution\nof (24) with finite m exists, the fermionic contribution to the thermodynamic potential\n(pressure) (17) can be written as:\n− ΩD = PD =\n\n2s\nIp (βm) , μ = 0 ,\n3π 2 β 4\n\n(30)\n\n\f9\nwhere the integral defined as\nIp (κ) ≡\n\nZ\n\n∞\n\n(z 2 − κ2 )3/2\ndz\nez + 1\n\nκ\n\ncan be evaluated analytically in two cases:\n( 7π4 π2 2\n− 8 κ + O(κ4 ) , κ < 1\n120\nIp (κ) =\n3κ2 K2 (κ) + O(e−2κ ) , κ & 1\n\n(31)\n\n(32)\n\nwhere Kν (x) is the modified Bessel function of the second kind.\nIn the (classical) low-temperature regime\nβm ≡\n\nm\n≫1\nT\n\n(33)\n\nthe above equation results in\n2sm2\nK2 (βm) + O(e−2βm ) .\nπ2β 2\n\n− ΩD = PD =\nTo leading order\n\n− ΩD = PD ≈\n\n√\n\n2s\n\nπ 3/2\n\nT (T m)3/2 e−m/T .\n\n(34)\n\n(35)\n\nThe chiral condensate density (27)\n2sm\nρs = 2 2\nπ β\n\nZ\n\n∞\nβm\n\n1\n\n(z 2 − (βm)2 ) 2\ndz , μ = 0\nez + 1\n\n(36)\n\ncan be also evaluated in the low-temperature limit as\nρs =\n\n2sm2\nK1 (βm) + O(e−2βm ) ,\n2\nπ β\n\nwhich gives to leading order\nρs ≈\n\n√\n\n2s\n\nπ 3/2\n\n(T m)3/2 e−m/T .\n\n(37)\n\n(38)\n\nIn this limit the fermions enter the regime of a classical ideal gas. Indeed, the fermionic\nparticle (antiparticle) density\nZ ∞\n1\nz(z 2 − (βm)2 ) 2\ns\ndz\n(39)\nn+ = n− = 2 3\nπ β βm\nez + 1\nin the low-temperature limit yields\nn± =\n\nsm2\nK2 (βm) + O(e−2βm ) ,\n2\nπ β\n\n(40)\n\nand to leading order:\nn± ≈ √\n\ns\n(T m)3/2 e−m/T .\n3/2\n2π\n\n(41)\n\n\f10\nWe see from Eqs. (34,40) that up to terms O(e−2βm ), the fermions satisfy the ideal gas\nequation of state\nPD ≈ (n+ + n− )T ,\n(42)\nand the chiral density is equal to the total particle density n.\nρs ≈ n ≡ n+ + n− .\n\n(43)\n\nIn the (ultra-relativistic) high-temperature regime\nm\n≪1\nT\none obtains\n− ΩD = PD ≈\n\n7π 2 s 4\ns\nT − (mT )2 .\n180\n12\n\n(44)\n\n(45)\n\nTo leading order the chiral condensate is\ns\nρs ≈ mT 2 ,\n6\n\n(46)\n\nwhile the particle density is\n3sζ(3) 3\nT .\n(47)\n2π 2\nNow we can make some general observations of the fermionic mass generation in the\ncoupled model:\n(i) It is obvious from the sign of ρs (cf. 27,36) that non-trivial solutions of (26) are\nimpossible for a monotonically increasing potential U(φ). That rules out some popular\npotentials, e.g., U ∝ log(1 + φ/M) [13, 36] for this Yukawa-coupling driven scenario of the\nmass generation.\n(ii) The monotonously decreasing slow-rolling DE potentials ([16, 17] and for reviews,\nsee [11, 13]), e.g., U ∝ φ−α or U ∝ exp[−Aφγ ], do have a window of parameters wherein\nnon-trivial solutions of (26) exist. As we can see from (38), for those decreasing potentials\nthe mass equation (26) always has a trivial solution m = gφc = ∞ for the minimum of\nthe thermodynamic potential (23). 2 This solution corresponds to a \"doomsday\" vacuum\nstate [61], when the Universe reached its true ground state with zero dark energy density\nand completely frozen out fermions. A non-trivial solution of (26), corresponding to another\nminimum of the potential (23), is totally due to the fermionic contribution. Since the latter\nfreezes out in the limit T → 0, it is clear qualitatively that such a solution 0 < m < ∞ can\nexist only above a certain temperature. For a more quantitative account of these phenomena\nwe need to assume some specific form of the DE potential. This will be done in the following\nsection.\n(iii) To explain the differences between the present study and earlier related work on\nmass varying fermions (see [23, 24, 36, 40] and more references there), some clarifications\nare warranted. It is usually assumed in the literature that the low-temperature regime\nformulas are applicable, and according to (43) ρs = n. The approximation for (26) then can\nbe written as ∂U/∂m + n = 0. The latter is interpreted as a result of minimization of some\nn± ≈\n\n2\n\nRecall that the grand thermodynamical potential is equal to the free energy for the case μ = 0.\n\n\f11\neffective potential Ueff = U + nm with fixed n, which always has a non-trivial minimum\n0 < m < ∞ for the class of decreasing potentials U, see, e.g., [23, 24]. It turns out that such\nan approximation changes the picture qualitatively.\nIn what follows, we explore in detail the predictions of the consistent mass equation (26)\non the mass varying scenario for the coupled model with a specific DE potential ansatz.\nIV.\n\nCOUPLED MODEL WITH THE RATRA-PEEBLES QUINTESSENCE\nPOTENTIAL\nA.\n\nMass Equation and Critical Temperature\n\nNow we analyze in detail our coupled model for a particular choice of U(φ), the so-called\nRatra-Peebles quintessence potential [16] :\nU(φ) =\n\nM α+4\n,\nφα\n\n(48)\n\nwhere α > 0. It is convenient to introduce the dimensionless parameters\n∆≡\n\nM\ngφ\nΩ\n, κ≡\n, ΩR ≡ 4 .\nT\nT\nM\n\n(49)\n\nThen the mass equation (26) can be written as:\nαπ 2 α α+4\ng ∆\n= Iα (κ) ,\n2s\nwhere we introduced\nIα (κ) ≡ κα+2\n\nZ\n\n∞\n\n√\n\nz 2 − κ2\ndz .\nez + 1\n\nκ\n\n(50)\n\n(51)\n\nAccording to the relation Eq. (22) between the fermionic mass m and the classical field, we\nget m = T κc , where κc is the solution of Eq. (50) corresponding to the minimum of the\nthermodynamic potential which reads now as (cf. Eq. (31)):\nΩR = g\n\nα\n\n\u0010 ∆ \u0011α\nκ\n\n−\n\n2 1\nIp (κ) .\n3π 2 ∆4\n\n(52)\n\nThe dimensionless Yukawa coupling constant g ∼ 1. To reduce the number of model parameters\nwe can set g = 1. This is equivalent to the simultaneous rescaling gφ →\n7 φ̃ and\nα\nMg α+4 7→ M̃ . 3 For simplicity, we also restrict the number of flavors s = 1.\nWe define the mass of the scalar field as:\nm2φ =\n3\n\n∂ 2 U(φ)\n∂φ2\n\nφ=φc\n\n.\n\n(53)\n\nOne can check this scaling also holds for the dynamics of the model, considered in Section V. In particular,\nthe neutrino masses do not depend on the value of g. To avoid cluttering of notations we will drop tildes\nin the rescaled parameters.\n\n\f12\nIn terms of the dimensionless parameters it reads\n\u0010 ∆ \u0011 α+2\nmφ p\n2\n= α(α + 1)\nM\nκc\n\n(54)\n\nIt is important to realize that the integral Iα (κ) on the r.h.s. of the mass equation is\nbounded. The quantitative parameters of the function Iα (κ) depend on α, but its shape\nis always similar to the curve shown in Fig. 1 for α = 1. So, there exists a maximal ∆crit\n(critical temperature Tcrit ) such that for ∆ > ∆crit (T < Tcrit ) only a trivial solution m = ∞\nexists, and the stable vacuum has zero energy and pressure.\n\nΩR\n\nIα(κ)\n3.5\n\n0.5\n\n(d)\n\n3\n(c)\n2.5\n\n0\n(b)\n\n0\n\n2\n\n4\n\n6\n\n8\n\n10\n\n12\n\n14\n\n16\n\nκ\n\n2\n1.5\n-0.5\n\n1\n\n(a)\n\n0.5\nκ0\n\nκcrit\n\n2\n\n4\n\nκ\n\n0\n0\n\n6\n\n8\n\n10\n\n12\n\n(d)\n(c)\n(b)\n(a)\n\n-1\n\nFIG. 1: (Color online) Left: Graphical solutions of the mass equation (50) for different values\nof ∆ ≡ M/T (α = 1). Right: dimensionless density of the thermodynamic potential (52). The\nthermodynamically stable solutions of Eq. (50) indicated by the large dots correspond to the minima\nof the potential. The arrows indicate the unstable solutions of the mass equation, corresponding\nto the maxima of the potential.\n\nThe mass equation Eq. (50) is solved numerically for various values of its parameters, and\nthe characteristic results are shown in Fig. 1. The numerical results can be complemented\nby an approximate analytical treatment of the problem. The latter turns out to be quite\naccurate and greatly helps in gaining intuitive understanding of the results.\nIt is easy to evaluate Iα (κ) to leading order:\n( π2 α+2\nκ\n,\nκ<1\n12\nIα (κ) ≈\n(55)\nκα+3 K1 (κ) , κ & 1\n\n18\n\n20\n\n\f13\nFor the critical point where Iα′ (κcrit ) = 0, we obtain:\n\n5\nκcrit ≈ ν , ν ≡ α + ;\n(56)\n2\nr\nπ ν −ν\nIα (κcrit ) ≈\nν e .\n(57)\n2\nThe most important conclusion we draw from Fig. 1 is that there are three phases in the\nmodel's phase diagram. We analyze each of them in the following subsections.\n1.\n\nStable (massive) phase: ∆ < ∆◦ (T◦ < T < ∞)\n\nIn this range of parameters the equation (50) has two nontrivial solutions. The root\nκc < κ◦ indicated with a large dot in Fig. 1 (case a) gives the fermionic mass and corresponds\nto a global minimum of the potential. So it is a thermodynamically stable state. In this\nphase Ω(κc ) < 0, so the pressure is positive P > 0. Another non-trivial root of (50)\ncorresponds to a thermodynamically unstable state (maximum of Ω indicated with an arrow\nin Fig. 1). There is a trivial third root of the mass equation κ = ∞. At these temperatures\nit corresponds to the metastable vacuum state Ω = 0.\nIn the high-temperature region of this phase where ∆ ≪ 1 the fermionic mass is small\n(see Fig. 2):\n2\n\u0010√ M \u0011 α+2\n2\nm\n≈\n6α\n∝ T − α+2\n(58)\nM\nT\nThe fermionic contribution to the thermodynamic potential is dominant, and it behaves to\nleading order as the potential of the ultra-relativistic fermion gas (cf. Eq. (45)):\n2α\n7π 2 4\n(59)\nT + O(T α+2 ) .\n180\nOne can check that the subleading term in the above expression combines the DE potential\ncontribution and the first fermionic mass correction, which are both of the same order.\nIt is important to stress that in this coupled model with the slow-rolling potential Eq. (48),\nthe mass generation does not follow a conventional Landau thermal phase transition scenario.\nThere is no critical temperature below which the chiral symmetry is spontaneously broken\nα+4\nand the mass is generated. Instead the mass grows smoothly as κc ∝ ∆ α+2 , albeit starting\nfrom the \"point\" T = ∞. From physical grounds we expect the applicability of the model\nto have the upper temperature bound:\n\nΩ = −P = −\n\nT . TRD ,\n\n(60)\n\nwhere TRD is roughly the temperature of the boundary between inflation and the radiationdominated era. The high-temperature result (59) shows that the stable massive phase of\nthe present model can indeed be extended up to those temperatures.\nThe scalar field and fermionic masses demonstrate opposite temperature dependencies.\nThe scalar field is \"heavy\" at high temperatures:\nr\nα+1\nT , ∆≪1,\n(61)\nmφ ≈\n6\nhowever its mass decreases together with the temperature. In contrary, the fermionic mass\nm monotonously increases with decreasing temperature. The exact numerical results for the\ntwo masses are shown in Fig. 2\n\n\f14\n\n6\n\nm/M\nmΦ/M\n\n5\n4\n3\n2\n1\n0\n0\n\n0.2\n\n0.4\n\n0.6\n\n0.8\n\n1\n\nΔ\n\nFIG. 2: (Color online) Masses of the fermionic and scalar fields (m and mφ resp.) as functions of\n∆ ≡ M/T , α = 1. At ∆ > ∆crit (T < Tcrit ) the stable phase corresponds to m = ∞ and mφ = 0\n2.\n\nMetastable (massive) phase: ∆◦ < ∆ < ∆crit (Tcrit < T < T◦ )\n\nUpon increasing ∆ we reach a certain value ∆◦ corresponding to a critical temperature T◦\nwhen the thermodynamic potential has two degenerate minima Ω(κ◦ ) = P (κ◦ ) = Ω(∞) = 0.\nThis is shown in Fig. 1 (case b). After this point, when the temperature decreases further in\nthe range ∆◦ < ∆ < ∆crit (here ∆crit stands for the maximal value of ∆ when a non-trivial\nsolution of the gap equation (50) exists, see Fig. 1), the two minima of the thermodynamic\npotential exchange their roles. The root κc now becomes a metastable state with Ω(κc ) > 0,\ni.e., with the negative pressure P (κc ) < 0, while the stable state of the system corresponds\nto the true stable vacuum of the Universe [61] Ω(∞) = P (∞) = 0. See Fig. 1 (case c).\nThe system's state in the local minimum Ω(κc ) is analogous to a metastable supercooled\nliquid. We disregard the exponentially small probability of tunneling of the fermions from\nthe metastable state Ω(κc ) into the vacuum state Ω(∞) = 0[18]. Accordingly, the fermionic\nmass in this phase is determined by the root κc of (50).\nIn the metastable phase κc & 1, so by using Eqs. (52,32,50) we obtain the potential:\n\u0010 ∆ \u0011α n\nα\n3α o\nΩR ≈\n(62)\n1−\n− 2 .\nκc\nκc 2κc\nFrom the above result we can find the metastability point Ω(κ◦ ) = 0 as\nr\nα\u0010\n6\u0011\nκ◦ ≈\n1+ 1+\n2\nα\n\n(63)\n\nOn finds from the above equation, e.g., how the mass approaches its critical value:\n\u00111/2\n\u0010 T\n−1\n,\nmcrit − m ∝\nTcrit\n\n(65)\n\nExpanding Iα (κ) near its maximum and using Eqs. (55,56,57) along with the gap equation\nEq. (50), we obtain the following equation:\n\u0010 ∆ \u0011α+4\n(κc − κcrit )2\n≈1−\n.\n(64)\n2ν\n∆crit\n\n\f15\nor the ratios of temperatures and masses at the metastable and critical points. These latter\nparameters are given in Table I.\nTABLE I: Masses, critical temperatures and potentials for various values of α. All the parameters\nused in this table are defined in the text.\nα\n\nTcrit\nT◦\n\n∆crit\n\nm◦\nmcrit\n\nmcrit\nM\n\nmcrit\nφ\nM\n\nTcrit\nM\n\n1\n2\n4\n10\n\n0.90\n0.95\n0.98\n0.99\n\n0.91\n1.04\n1.44\n3.00\n\n0.558\n0.70\n0.81\n0.91\n\n3.86\n4.35\n4.52\n4.16\n\n0.187\n0.130\n0.048\n2 * 10−3\n\n1.10\n0.97\n0.70\n0.33\n\n3.\n\nΩcrit\nM4\n\nρcrit\nM4\n\n0.15\n0.84\n0.02\n0.25\n−4\n6 * 10\n0.02\n−8\n7 * 10 9 * 10−6\n\nw(Tcrit )\n-0.18\n-0.09\n-0.03\n-0.008\n\nCritical point: ∆ = ∆crit (T = Tcrit ) and phase transition\n\nThe critical point of the model corresponds to the case when the two roots of the mass\nequation Eq. (50) merge, and the minimum of the potential disappears. One can check that\ninstead of the minimum this is an inflection point of the the potential, i.e., Ω′′R (κcrit ) = 0.\nThis situation is shown in Fig. 1 (case d). At this point the system is in the unstable state\nwith the fermionic mass\nmcrit\n= κcrit ≈ ν .\n(66)\nTcrit\nIn particular, this implies that the fermions are non-relativistic at the critical temperature.\nFrom Eqs. (57,50) we find the critical parameter (see Table I for its numerical values)\n\u0010 √2\n\u0011 1\nν −ν α+4\n∆crit ≈\nν\ne\n,\n(67)\nαπ 3/2\nwhich allows us to evaluate the critical temperature\n\nM\n.\n∆crit\n\n(68)\n\n5 \u0010 ∆crit \u0011α 4\nM\n2ν\nν\n\n(69)\n\nTcrit =\nWe can also find the potential at Tcrit :\nΩcrit ≈\n\nThus, from the viewpoint of equilibrium thermodynamics at T = Tcrit the model must\nundergo a first-order (discontinuous) phase transition and reach its third thermodynamically\nstable (at T < Tcrit ) phase corresponding to the vacuum Ω(κ = ∞) = P (κ = ∞) = 0. During\nthis transition the fermionic mass given at the critical point by Eq. (66) and the scalar field\nmass\n\u0010 ∆ \u0011 α+2\np\n2\ncrit\nα(α\n+\n1)\nmcrit\n≈\nM\n(70)\nφ\nν\nboth jump to their values in the vacuum state m = ∞ and mφ = 0. See Fig. 2.\n\n\f16\nHowever, the above arguments are based on the minimization of the thermodynamic\npotential (i.e. maximization of entropy) at equilibrium. To address the question of how\nsuch a system behaves as the Universe evolves towards the new equilibrium vacuum state,\nwe need to analyze the dynamics of this phase transition. More qualitatively, we need to\nstudy how the particle at the point κcrit at the critical temperature (see Fig. 1) rolls down\ntowards its equilibrium at infinity. This issue will be addressed in Section V.\nB.\n\nEquation of State\n\nWe define the equation of state in the standard form:\nP = wρ ,\n\n(71)\n\nwhere the total pressure in this model is obtained from Eq. (52), while the total energy\ndensity (ρ) and its dimensionless counterpart (ρR ) are determined by the following equation:\n\u0010 ∆ \u0011α\nρ\n2 1\nρR ≡ 4 =\n(72)\n+ 2 4 Iε (κ) .\nM\nκ\nπ ∆\nHere we define the integral\n\nIε (κ) ≡\n\nZ\n\nκ\n\n∞\n\n√\nz 2 z 2 − κ2\ndz ,\nez + 1\n\nwhich can be evaluated in two limits of our interest:\n( 7π4 π2 2\n− 24 κ + O(κ4 ) ,\nκ<1\n120\nIε (κ) =\n3κ2 K2 (κ) + κ3 K1 (κ) + O(e−2κ ) , κ & 1\n\n(73)\n\n(74)\n\nIn the high-temperature region of the stable massive phase where ∆ ≪ 1, the fermionic\ncontribution is dominant, and the energy density to leading order is that of the ultrarelativistic fermion gas (cf. Eq. (59))\nρ=\n\n2α\n7π 2 4\nT + O(T α+2 ) .\n60\n\n(75)\n\nThus, in this regime the model follows approximately the equation of state of a relativistic\ngas with w ≈ 13 .\nIn the region κc & 1 which includes the metastable phase and the critical point, we obtain\nby using Eqs. (72,74,50,62):\n\u0010 ∆ \u0011α n\n3α\n9α o\nρ≈\n(76)\n1+α+\n+ 2 ,\nκc\nκc\n2κc\nand\nw≈−\n\n1−\n\nα\nκc\n\n1+α+\n\n−\n\n3α\nκc\n\n3α\n2κ2c\n\n+\n\n9α\n2κ2c\n\n(77)\n\nThe last equation follows very closely the results of the exact numerical calculations shown\nin Fig. 3. At the critical point we evaluate\n\n\f17\n\nw\n\nα=1\nα=2\nα=4\n\n0.4\n\n0.2\n\n0\n\nΔcrα=1 Δcrα=2\n\nΔcrα=4\n\n-1\n0\n\n0.2\n\n0.4\n\n0.6\n\n0.8\n\n1\n\n1.2\n\n1.4\n\n1.6\n\nΔ\n\nFIG. 3: (Color online) w ≡ P/ρ for several values of α. At ∆ > ∆crit (α), i.e., T < Tcrit (α) the\nequilibrium value w = −1 exactly.\n\nρcrit ≈\n\n\u0010∆\n\ncrit\n\nν\n\n\u0011α n\n\n3α o 4\n1+α+\nM ,\nν\n\n(78)\n\nand making a rough estimate, we get a lower bound:\nw≈−\n\n1\n5\n2 ν(1 + α +\n\n3α\n)\nν\n\n1\n≥− , ∀α≥1.\n4\n\n(79)\n\nThus for any power law α ≥ 1, the parameter w of this model at equilibrium cannot cross\nthe bound w < − 13 , necessary for accelerating expansion of the Universe ä > 0. 4\nAt T < Tcrit we obtain the equilibrium value of w in the stable vacuum state from\nEqs. (52,72):\nP (κ)\n= −1 .\n(80)\nw = lim\nκ→∞ ρ(κ)\nSo the true vacuum in this model corresponds to the Universe with a cosmological constant\nin the limit Λ → 0.\nC.\n\nSpeed of Sound\n\nWe define the sound velocity as\nc2s =\n\n4\n\ndP\ndt\ndρ\ndt\n\n=\n\ndP\nd∆\ndρ\nd∆\n\n,\n\n(81)\n\nThe relation (79) w(Tcrit ) & − 41 holds for the model which contains only the DE-neutrino coupled fluid.\nIn a more realistic model for the Universe, baryons and DM also contribute to the total energy density,\nand as a consequence w(Tcrit ) increases, see Sec. V.\n\n\f18\nwhere to obtain the second expression we used the fact that the time enters our formulas\nonly through the temperature T (a(t)), so\nd\nd∆ d\n=\n.\ndt\ndt d∆\n\n(82)\n\nLet us first consider the temperatures T ≥ Tcrit , i.e., ∆ ≤ ∆crit . Then\n∂ρ\n∂ρ dκ\ndρ\n=\n+\n*\nd∆\n∂∆ ∂κ d∆\n\nκ=κc\n\n,\n\n(83)\n\nwhere κ is related to ∆ through the gap equation (50):\ndκ\nd∆\n\nκ=κc\n\n≡ κ̇c =\n\nα + 4 Iα (κc )\nα + 4 \u0010 d log Iα (κc ) \u0011−1\n=\n.\n∆ Iα′ (κc )\n∆\ndκ\n\n(84)\n\nNote that for the pressure the following relation\n∂P\ndP\n=\nd∆\n∂∆\n\n(85)\n\nholds, since\n\n∂P\n=0\n∂κ κ=κc\nis just another form of the gap equation (24). Thus\nc2s =\n\n∂P\n∂∆\n∂ρ\n∂ρ\n+ ∂κ\nκ̇c\n∂∆\nκ=κc\n\n(86)\n\n.\n\n(87)\n\nIn the high-temperature regime ∆ ≪ 1 (κc ≪ 1), it is even easier to use the explicit\nasymptotic expansions for P (∆) and ρ(∆) in the definition (81) instead of the above formula\n(87). A straightforward calculation gives the result\nc2s ≈\n\n2(α+4)\n1\n− b∆ α+2 , b > 0 ,\n3\n\n(88)\n\nconsistent with the earlier observation that for ∆ ≪ 1 the model behaves as an ultrarelativistic Fermi gas.\nIn the case κc & 1 we find\nα + 4 κc\nκ̇c ≈\n,\n(89)\n∆ ν − κc\nand\nν − κc\nc2s ≈\n.\n(90)\n4\nα(α + 4)(1 + αν\n)\nEverywhere at T > Tcrit , including the stable and metastable massive phases c2s > 0, so the\nmodel is stable with respect to the density fluctuations. The sound velocity vanishes in the\n+\nlimit T → Tcrit\nas\n√\n(91)\ncs ∝ ν − κc → 0 .\n\nQualitatively, the vanishing speed of sound is due to divergent κ̇c (84,89) at the critical\npoint.\n\n\f19\n\ncs2\nα=1\nα=2\nα=4\n\n0.4\n\n0.2\n\n0\n\nΔcrα=1 Δcrα=2\n\nΔcrα=4\n\n-1\n0\n\n0.2\n\n0.4\n\n0.6\n\n0.8\n\n1\n\n1.2\n\n1.4\n\n1.6\n\nΔ\n\nFIG. 4: (Color online) The square of the sound velocity for several values of α. At ∆ > ∆crit (α),\ni.e., T < Tcrit (α) the equilibrium value c2s = −1 exactly.\n\nThe above analytical results are in excellent agreement with the numerical calculations\nof c2s from the formula (87) shown in Fig. 4. At the temperatures T < Tcrit there is no gap\nequation relating κ and ∆, so the sound velocity is easily calculated to yield the value in\nthe equilibrium vacuum state:\n∂P\n∂∆\nκ→∞ ∂ρ\n∂∆\n\nc2s = lim\n\n= −1 .\n\n(92)\n\nThat what is expected for a barotropic perfect liquid with a constant w, where c2s = w.\nV.\n\nDYNAMICS OF THE COUPLED MODEL AND OBSERVABLE UNIVERSE\nA.\n\nScales and Observable Universe\n\nIn order to make a connection between the above model results and the observable Universe, we need to first conclude where we are now with respect to the critical temperatures\nT◦ and Tcrit . As one can see from Table I for α ∼ 1, the model has T◦ ∼ Tcrit ∼ M. We\nidentify the current equilibrium temperature of the Universe with the cosmic background\nradiation temperature T = 2.275 K = 2.4 * 10−4 eV. Then we see right away that we cannot\nbe above the critical temperature of the coupled model, since:\n(i) assumption T > Tcrit leads to M . 10−4 eV, which in turn implies too small densities\nρ ∼ M 4 ∼ 10−16 eV4 , i.e, four orders of magnitude less than the observable density;\n(ii) At T > Tcrit the equation of state has w > − 41 (see Fig. 3), which is not even enough to\nget a positive acceleration ä > 0, while the observable value w ≈ −1. [13]\nSo, the first qualitative conclusion is that we are currently below the critical temperature.\nThe Universe has already passed the stable and metastable phases and is now unstable, i.e.\nit is in the transition toward the stable \"doomsday\" vacuum m = ∞ and Ω = 0.\nSince at the temperature of metastability P◦ = 0, the transition occurs somewhere between the beginning of the matter-dominated era (TM D ≈ 16500 K ≈ 1.42 eV) and now,\ni.e., 1.4 eV & Tcrit > Tnow ∼ 2.4 * 10−4 eV. Because of Eq.(68) this inequality gives us the\n\n\f20\npossible range of the model's single parameter M:\n2.4 * 10−4 eV < M . 1.4 eV.\n\n(93)\n\nAs we will show in the following, other consistency checks of the model bring the upper\nbound of M much lower.\nB.\n\nUniverse Before the Phase Transition\n\nIn order to apply the results of the coupled model for the calculation of the parameters\nof the observable Universe, we need to incorporate the matter (we will just add up the dark\nand conventional baryonic matter together) and the radiation. Assuming a spatially flat\nUniverse, the total energy density is critical, so\nρtot = ργ,now /a4 + ρM,now /a3 + ρφν (∆) = ρcr =\n\n3H 2\n,\n8πG\n\n(94)\n\nwhere from now on we denote ρφν the energy density of the coupled model given by Eq. (72).\nTo relate our model's parameters to the standard cosmological notations, we assume that\nthe temperature is evolving as that of the blackbody radiation, i.e., T = Tnow /a. Then\n∆≡\n\nMa\nM\nM\n=\n=\n.\nT\nTnow\nTnow (1 + z)\n\n(95)\n\nWe know that\n\nπ2 4\nT ,\n(96)\n15\nand we set the current density of the coupled scalar field to the observable value of the dark\nenergy, i.e., 3/4 of the critical density:\nργ =\n\nρφν,now =\n\n3 3H02\n*\n≈ 31 * (10−3 eV)4 ,\n4 8πG\n\n(97)\n\nand\n\n1 3H02\n*\n.\n4 8πG\nThe equations above allow us to plot the relative energy densities\n\n(98)\n\nρM,now ≈\n\nΩ# ≡ ρ# /ρtot\nas functions of redshift (or temperature) up to the critical point, see Fig. 5.\nhigh-temperature limit, the matter term is sub-leading and\nρtot ≈ ργ + ρφν ≈\n5\n\nπ2\n7\u0001\n1 + T4 .\n15\n4\n\n(99)\n5\n\nIn the\n\n(100)\n\nWe apologize for some abuse of notations, but using the same Greek letter for the grand thermodynamic\npotential and relative densities seems to be standard now. Since these quantities are mainly discussed in\ndifferent sections of the paper, we hope the reader will not be confused.\n\n\f21\n\n106\n\nT (eV)\n102\n\n104\n\n100\n\n10-2\n\n1\n\n1\n\nΩφν\nΩγ\nΩM\n\n0.8\n\n0.8\n\n0.6\n\n0.4\n\n0.4\n\nΩ\n\n0.6\n\n0.2\n\nzcr\n\nz*\n\n0\n\n0.2\n\n0\n1010\n\n108\n\n106\n\n104\n\n102\n\n100\n\nz+1\n\nFIG. 5: (Color online) Relative energy densities plotted up to the current redshift (temperature,\nupper axis): Ωφν – coupled DE and neutrino contribution; Ωγ – radiation; ΩM – combined baryonic\nand dark matters. Parameter M = 2.39 * 10−3 eV (α = 0.01), chosen to fit the current densities,\ndetermines the critical point of the phase transition zcr ≈ 3.67. The crossover redshift z ∗ ≈ 0.83\ncorresponds to the point where the Universe starts its accelerating expansion.\n\nIn this limit, then\n\n7\n4\n≈ 0.636 , Ωγ =\n≈ 0.363 ,\n(101)\n11\n11\nwhich agrees well with the numerical results displayed in Fig. 5. At the critical point the\nmatter strongly dominates and ρM /ργ,φν & 102 .\nThe equation of state parameter of the entire Universe, wtot , is given by Ptot = wtot ρtot .\nSince the matter contribution PM = 0, then Ptot = Pγ + Pφν , where Pγ = 13 ργ and the\npressure of the coupled model Pφν is obtained from Eq. (52). The numerical results of wtot\nare given in Fig. 6.\nΩφν =\n\n106\n\n104\n\nT (eV)\n102\n\n100\n\n10-2\n\n0.4\n\n0.4\n\n0.2\n\n0.2\n\nw\n\n0\n\n0\n\n-0.2\n\n-0.2\n\n-0.4\n\n-0.4\n\n-0.6\n\n-0.6\nzcr z*\n\n-0.8\n\n-0.8\n1010\n\n108\n\n106\n\n104\n\n102\n\n100\n\nz+1\n\nFIG. 6: (Color online) Equation of state parameter wtot = Ptot /ρtot for M = 2.39 * 10−3 eV\n(α = 0.01) plotted up to the current redshift (temperature, upper axis).\n\n\f22\nTo analyze the dynamics of the coupled model we need, in principle, to go beyond the\nsaddle-point approximation applied in the previous sections and solve the equation of motion:\nφ̈ + 3H φ̇ +\n\n∂Ω\n=0.\n∂φ\n\n(102)\n\nAbove the transition point (T > Tcrit ) the dynamics is quite simple. Let us analyze perturbations to the saddle-point solution of (24):\nφ(t) ≡ φc + ψ(t) .\n\n(103)\n\nTaylor-expanding the thermodynamic potential of the coupled model\n1\n∂Ω\n= ω 2 ψ + Ω′′′ (φc )ψ 2 + ...\n∂φ\n2\n\n(104)\n\nwith ω 2 ≡ Ω′′ (φc ), we obtain from (102) the equation of a damped harmonic oscillator to\nthe leading order:\nψ̈ + 3H ψ̇ + ω 2 ψ = 0 .\n(105)\nSo, the quintessence field φ(t) oscillates around its saddle-point value φc with ψ(t) ∝\n3\neıωt− 2 Ht . The damping is very small, since as one can check\n3\nω≫ H .\n2\n\n(106)\n\nThe violation of the above condition and breaking down of the oscillating regime occurs in\nthe vicinity of the critical point, which is the inflection point of the potential (ω = 0). This\nis the well-known phenomenon of the critical slowing down near phase transition. Retaining\nthe first non-vanishing term in (104), the equation of motion in the vicinity of the critical\npoint reads:\n1\nψ̈ + 3H ψ̇ + Ω′′′ (φc )ψ 2 = 0 .\n(107)\n2\nNeglecting the small damping term in this equation, its solution can be found analytically\nvia a hypergeometric function. Since the explicit form of this solution is not very interesting\nat this point, we just emphasize the qualitative conclusion of the analysis: the fluctuation\nψ(t) oscillates near the classical field φc in the stable (metastable) phase at T > Tcrit , and\n+\nit enters the run-away (power-law) regime when T → Tcrit\n.[64]\nC.\n\nLate-Time Acceleration of the Universe. Towards the End of Times\n\nThe equilibrium methods are not applicable below the phase transition, and we study\nthe dynamics of the model from the equation of motion (102) together with the Friedmann\nequations (1,2,3). Solution of the Dirac equations yields ρs ∝ a−3 for the chiral density [66],\nso the equation of motion (102) at a ≤ acrit reads:\n\u0010 a \u00113\n∂U\ncrit\nφ̈ + 3H φ̇ = −\n− ρs,crit\n.\n∂φ\na\n\n(108)\n\n\f23\nFrom the results of the previous section we evaluate the chiral density at the critical point:\nρs,crit ≈ α\n\n\u0010∆\n\ncrit\n\nν\n\n\u0011α+1\n\nM3 .\n\n(109)\n\nThe system of the integro-differential equations (108,1,2,3) was solved numerically. All the\nquantities entering those equations are defined in the previous subsection, except that one\nneeds to include the extra term 12 φ̇2 in the computation of both ρtot and Ptot . However\nthe numerical results show that in the regimes of the parameters we are interested, the\nkinetic term can be safely neglected. Since the critical point of the model lies in the matterdominated regime (cf. Fig. 5), we start with the Hubble parameter H = 2/3t (a ∝ t2/3 ).\nAt the latest times (z . 1) the Hubble parameter was determined self-consistently from the\nnumerical solution of the Friedmann equations.\nWe find numerically that the quintessence field φ(t) from the critical point to the present\ntime oscillates quickly (with the period τ ∼ 10−27 Gyr) around the smooth (\"mean value\")\nsolution φ̄(t), where the \"mean\" φ̄ nullifies the r.h.s. of the equation of motion (108).\nRelating the mean values with the physically relevant observable quantities, we can easily\nobtain the key results analytically. (They are checked against direct numerical calculations\nand found to be accurate within 5 % at most). Thus we get\nφ̄ = φcrit *\n\n\u00101 + z\n\nρφ̄ = ρφ,crit *\n\ncrit\n\n3\n\u0011 α+1\n\n,\n1+z\n3α\n\u0010 1 + z \u0011 α+1\n1 + zcrit\n\n(110)\n,\n\n(111)\n\nν\nM and ρφ,crit ≈ ( ∆νcrit )α M 4 . Having a free model parameter M, we'll set\nwhere φcrit ≈ ∆crit\nit by matching the current density of the scalar field ρφ,now to the observable value of the\nDE density (97), so\n3α\n\u0001 α+1\n− α+4\nT\n.\n(112)\nM = ν α ρφ,now α+4 ∆−α\nnow\ncrit\n\nThe exponent of the quintessence potential α is now the only parameter which can be varied.\nWe define the time-dependent mass via the solution of the motion equation as m(t) = φ̄(t),\nthus obtaining an estimate for the present-time neutrino mass. Results for various α are\ngiven in Table II. There we also calculate the critical points parameterized by the redshifts\nzcrit and the crossover points z ∗ . The latter is defined as the redshift at which the Universe\nstarts its late-time acceleration, i.e., where wtot = − 31 . For the present time we find\nnow\nwtot\n≈−\n\n3\n.\n4\n\n(113)\n\nAs we infer from the data of Table II, the range of exponents α ≪ 1 corresponds to more\nrealistic predictions for the neutrino mass [1, 7, 8] and for the crossover redshift z ∗ [65].\nFor α = 0.01 we plot the evolution of the relative energy densities, the equation of state\nparameter, and the neutrino mass in Figs. 5,6,7.\nWe consider the quite artificial case of small quintessence exponent α as an ansatz crossing\nover smoothly from physically plausible potentials with, say, α = 1 or 2 to the logarithmic\npotential\n\u0010\nM\u0011\nU(φ) = M 4 1 + α log\n.\n(114)\nφ\n\n\f24\n\nTABLE II: Model's parameters and observables for various α. All the entries in this table are\ndefined in the text.\nα\n\nM (eV)\n\nmnow (eV)\n\nzcrit\n\nz∗\n\n2\n1\n1/2\n10−1\n10−2\n10−3\n\n9.75 * 10−2\n1.69 * 10−2\n6.33 * 10−3\n2.81 * 10−3\n2.39 * 10−3\n2.36 * 10−3\n\n167\n44.6\n17.0\n2.82\n0.27\n0.027\n\n392\n76.6\n27.7\n8.73\n3.67\n1.60\n\n4.9\n2.3\n1.5\n0.93\n0.83\n0.82\n\n106\n\n104\n\nT (eV)\n102\n\n100\n\n10-2\n\n0.3\n\n0.3\n\n0.25\n\n0.25\n\nmν\n\n0.2\n\n0.2\n\n0.15\n\n0.15\n\n0.1\n\n0.1\n\n0.05\n\n0.05\n\n0\n\n0\nzcr z*\n\n-0.05\n1010\n\n108\n\n106\n\n104\n\n102\n\n-0.05\n\n100\n\nz+1\n\nFIG. 7: Neutrino mass m for M = 2.39 * 10−3 eV (α = 0.01) plotted up to the current redshift\n(temperature, upper axis).\n\nThe latter often appears in various contexts [13, 36].6\nVI.\n\nCONCLUSIONS\n\nIn this paper we analyzed the MaVaN scenario in a framework of a simple \"minimal\"\nmodel with only one species of the (initially) massless Dirac fermions coupled to the scalar\nquintessence field. By using the methods of thermal quantum field theory we derived for\nthe first time (in the context of the MaVaN or, even more broadly, the VAMP models) a\n6\n\nThe numerical results for small parameter α, as e.g. α = 0.01 taken for the plots, are virtually indistinguishable for the cases of the Ratra-Peebles (48) or logarithmic (114) potentials. However the\nRatra-Peebles potential at more \"natural\" α = 1, 2 allows to probe the coupled fermionic-quintessence\nmodels in the search of heavy DM particle candidates.\n\n\f25\nconsistent equation for fermionic mass generation in the coupled model.\nWe demonstrated that the mass equation has non-trivial solutions only for special classes\nof potentials and only within certain temperature intervals. It appears that these results\nhave not been reported in the literature on VAMPs before now.\nWe gave most of the results for the particular choice of a trial DE potential – the RatraPeebles quintessence potential. This potential has all the necessary properties we needed for\nour task: it is simple, it satisfies the criteria we found for non-trivial solutions of the mass\nequation to exist, and it has only one dimensionfull parameter- the energy scale M to tune.\nAlso, at small values of the exponent α it effectively crosses over to the case of a logarithmic\npotential. We have checked that other potentials, e.g., exponential, lead to a qualitatively\nsimilar picture, but they have at least one more energy scale to handle, which we consider\nas an unnecessary complication at this point.\nWe analyzed the thermal (i.e. temporal) evolution of the model, following the time\narrow. Contrary to what one might expect from analogies with other contexts, like, e.g.,\ncondensed matter, the model does not generate the mass via a conventional spontaneous\nsymmetry breaking below a certain temperature. Instead it has a non-trivial solution for\nthe fermionic mass evolving \"smoothly\" from zero at the \"point\" T = ∞. The scalar field\nis infinitely heavy at the same point. More realistically, we assumed the model is applicable\nstarting at the temperatures somewhere in the beginning of the radiation-dominated era.\nWe found that the DE contribution in this regime is subleading, and the model behaves as\nan ultra-relativistic Fermi gas at those temperatures.\nThis regime corresponds to a stable phase of the model given by a global minimum of the\nthermodynamic potential Ω(φ). The temperature/time dependent minimum hφi generates\nthe varying fermionic mass m ∝ hφi.\nWith increase in time, as the temperature decreases, the model reaches the point of\nmetastability where its pressure (P ) vanishes. From our estimates of the model's scales,\nwe showed that this happens during the matter-dominated era of the Universe. At this\npoint the system's ground state becomes doubly degenerate, and the potential Ω = 0 at the\nnon-trivial (finite) minimum hφi as well as at the trivial vacuum φ = ∞.\nFurther on, at lower temperatures the system stays in the metastable (supercooled) state\nuntil it reaches the critical point where the local minimum of the thermodynamic potential\ndisappears and it becomes an inflexion point. At this critical temperature the model undergoes a first-order (discontinuous) phase transition. At the critical point the equilibrium\nvalues of the fermionic and the scalar field masses discontinuously jump to the 'doomsday\"\nvacuum state values m = ∞ and mφ = 0, respectively. The square of the sound velocity and\nequation of state parameter w have the equilibrium values corresponding to the de Sitter\nUniverse with a cosmological constant, i.e. c2s = w = −1. It is worth pointing out that\nc2s > 0 in both the stable and metastable phases, and the sound velocity vanishes reaching\nthe critical temperature from above.\nSince the equilibrium approach is not applicable below the critical temperature, we find\nparameters of the model from direct numerical solution of the equation of motion and the\nFriedmann equations. The single scale M of the quintessence potential is chosen to match\nthe present DE density, then other parameters of the Universe are determined. We obtain a\nconsistent picture: the phase transition has occurred rather recently at zcrit . 5 during the\nmatter-dominated era, and the Universe is now being driven towards the stable vacuum with\nzero Λ-term. The expansion of the Universe accelerates starting from z ∗ ≈ 0.83. Setting\nα = 0.01 for M ≈ 2.4 * 10−3 eV, we end up with the neutrino mass m ≈ 0.27 eV.\n\n\f26\nThe present results allow us to propose a completely new viewpoint not only on the\nMaVaN, but on the quintessence scenario for the Universe as well. The common concerns\nabout the slow-rolling mechanism for the DE relaxation toward the Λ = 0 vacuum are related\nto the question of what is the mechanism to set the initial value of the scalar field φ where\nit evolves (rolls down) from. Our results demonstrate that up to recent times (i.e. above the\ncritical temperature) the quintessence field was locked around its average (classical) value\nhφi. Its value is determined by the scale M and the temperature. The average hφi gives\nthe fermionic mass at the same time. The scalar field is rigid (i.e. massive), although it\nsoftens (i.e., its mass decreases) as the system approaches the critical temperature. Above\nthe critical temperature the scalar field can only oscillate around its equilibrium value hφi.\nAt the critical point the minimum of the thermodynamic potential becomes the inflexion\npoint, the scalar field looses its rigidity (mass). Then the field can only roll down towards\nthe new stable ground state Ω = 0 at φ = ∞. So physically, the critical point corresponds\nto the transition of the Universe from the stable oscillatory to the unstable rolling regime.\nA more sophisticated numerical study of the kinetics after the critical point is warranted\nin order to address such issues as the detailed description of the crossover between different\nregimes, and the clustering of neutrinos. These and some other questions are relegated to\nour future work.\nAcknowledgments\n\nWe highly appreciate useful comments and discussions with D. Marfatia, B. Ratra, and N.\nWeiner. We are grateful to N. Arhipova, D. Boyanovsky, R. Brandenberger, O. Chkvorets,\nH. Feldman, A. Gruzinov, L. Kisslinger, the late L. Kofman, S. Lukyanov, and U. Wichoski for helpful discussions and communications. We thank the anonymous referee for\nconstructive criticism and comments which stimulated us to undertake deeper analyses of\nthe model, and especially of its dynamics. G.Y.C. thanks the Center for Cosmology and Particle Physics at New York University for hospitality. We acknowledge financial support from\nthe Natural Science and Engineering Research Council of Canada (NSERC), the Laurentian\nUniversity Research Fund (LURF), Scientific Co-operation Programme between Eastern\nEurope and Switzerland (SCOPES), the Georgian National Science Foundation grants #\nST08/4-422. T.K. acknowledges the support from NASA Astrophysics Theory Program\ngrant NNXlOAC85G and the ICTP associate membership program. A.N. thanks the Bruce\nand Astrid McWilliams Center for Cosmology for financial support.\n\n[1] A. D. Dolgov, Phys. Atom. Nucl. 71, 2152 (2008) [arXiv:0803.3887 [hep-ph]]; Physics Reports\n370, 333 (2002).\n[2] J. Lesgourgues and S. Pastor, Phys. Rept. 429, 307 (2006) [arXiv:astro-ph/0603494].\n[3] A. Strumia and F. Vissani, arXiv:hep-ph/0606054.\n[4] S. Hannestad, Ann. Rev. Nucl. Part. Sci. 56, 137 (2006) [arXiv:hep-ph/0602058].\n[5] S. Eidelman et al. [Particle Data Group], Phys. Lett. B 592, 1 (2004).\n[6] H. Abele, Prog. Part. Nucl. Phys. 60, 1 (2008).\n[7] R. N. Mohapatra, et al, Rep. Prog. Phys. 70, 1757 (2007).\n\n\f27\n[8] F. T. Avignone, S. R. Elliott and J. Engel, Rev. Mod. Phys. 80, 481 (2008) [arXiv:0708.1033\n[nucl-ex]].\n[9] S. Weinberg, Cosmology, Oxford University Press, New York (2008).\n[10] S. Dodelson, Modern Cosmology, Academic Press, San Diego (2003).\n[11] P. J. E. Peebles and B. Ratra, Rev. Mod. Phys. 75, 559 (2003) [arXiv:astro-ph/0207347].\n[12] S. M. Carroll, eConf C0307282, TTH09 (2003) [AIP Conf. Proc. 743, 16 (2005)]\n[arXiv:astro-ph/0310342].\n[13] E. J. Copeland, M. Sami and S. Tsujikawa, Int. J. Mod. Phys. D 15, 1753 (2006)\n[arXiv:hep-th/0603057].\n[14] S. Nojiri and S. D. Odintsov, Phys. Rev. D 68, 123512 (2003).\n[15] S. M. Carroll, A. De Felice, V. Duvvuri, D. A. Easson, M. Trodden and M. S. Turner, Phys.\nRev. D 71, 063513 (2005).\n[16] B. Ratra and P. J. E. Peebles, Phys. Rev. D 37, 3406 (1988)\n[17] C. Wetterich, Nucl. Phys. B 302, 668 (1988).\n[18] A. Linde, Lect. Notes Phys. 738, 1 (2008) [arXiv:0705.0164 [hep-th]]; Particle physics and\nInflationary Cosmology, Chur, Switzerland: Harwood (1990) [arXiv: hep-th/0503203].\n[19] S. Weinberg, Phys. Rev. D 77, 123541 (2008) [arXiv:0804.4291 [hep-th]].\n[20] E. Mocchiutti et al., arXiv:0905.2551 [astro-ph.HE].\n[21] E. A. Baltz et al., JCAP 0807, 013 (2008) [arXiv:0806.2911 [astro-ph]].\n[22] K. Kohri, A. Mazumdar, N. Sahu and P. Stephens, Phys. Rev. D 80, 061302 (2009)\n[arXiv:0907.0622 [hep-ph]].\n[23] G. W. Anderson and S. M. Carroll, arXiv:astro-ph/9711288.\n[24] M. B. Hoffman, arXiv:astro-ph/0307350.\n[25] G. R. Farrar and P. J. E. Peebles, Astrophys. J. 604, 1 (2004) [arXiv:astro-ph/0307316].\n[26] M. Kawasaki, H. Murayama and T. Yanagida, Mod. Phys. Lett. A 7, 563 (1992).\n[27] J. Garcia-Bellido, Int. J. Mod. Phys. D 2, 85 (1993) [arXiv:hep-ph/9205216].\n[28] D. Comelli, M. Pietroni and A. Riotto, Phys. Lett. B 571, 115 (2003) [arXiv:hep-ph/0302080].\n[29] U. Alam, V. Sahni, T. D. Saini and A. A. Starobinsky, Mon. Not. Roy. Astron. Soc. 354, 275\n(2004) [arXiv:astro-ph/0311364]; L. Amendola, M. Gasperini and F. Piazza, JCAP 0409, 014\n(2004) [arXiv:astro-ph/0407573]. M. Szydlowski, T. Stachowiak and R. Wojtak, Phys. Rev. D\n73, 063516 (2006) [arXiv:astro-ph/0511650]; H. Li, B. Feng, J. Q. Xia and X. Zhang, Phys.\nRev. D 73, 103503 (2006) [arXiv:astro-ph/0509272]. Z. K. Guo, N. Ohta and S. Tsujikawa,\nPhys. Rev. D 76, 023508 (2007) [arXiv:astro-ph/0702015].\n[30] U. Franca and R. Rosenfeld, Phys. Rev. D 69, 063517 (2004) [arXiv:astro-ph/0308149].\n[31] U. Franca, M. Lattanzi, J. Lesgourgues and S. Pastor, Phys. Rev. D 80, 083506 (2009)\narXiv:0908.0534 [astro-ph.CO].\n[32] G. Huey and B. D. Wandelt, Phys. Rev. D 74, 023519 (2006) [arXiv:astro-ph/0407196].\n[33] B. Wang, J. Zang, C. Y. Lin, E. Abdalla and S. Micheletti, Cosmological Parameters,\" Nucl.\nPhys. B 778, 69 (2007) [arXiv:astro-ph/0607126].\n[34] R. Mainini and S. Bonometto, JCAP 0709, 017 (2007) [arXiv:0709.0174 [astro-ph]].\n[35] T. Koivisto, Phys. Rev. D 72, 043516 (2005) [arXiv:astro-ph/0504571]; R. Rosenfeld, Phys.\nRev. D 75, 083509 (2007) [arXiv:astro-ph/0701213]; S. Das, P. S. Corasaniti and J. Khoury,\nPhys. Rev. D 73, 083509 (2006) [arXiv:astro-ph/0510628]; X. J. Bi, B. Feng, H. Li and\nX. M. Zhang, neutrinos,\" Phys. Rev. D 72, 123523 (2005) [arXiv:hep-ph/0412002]; M. Manera and D. F. Mota, Mon. Not. Roy. Astron. Soc. 371, 1373 (2006) [arXiv:astro-ph/0504519];\nL. Amendola, G. Camargo Campos and R. Rosenfeld, Phys. Rev. D 75, 083506 (2007)\n\n\f28\n\n[36]\n[37]\n[38]\n[39]\n[40]\n[41]\n[42]\n[43]\n\n[44]\n[45]\n[46]\n\n[47]\n\n[48]\n\n[49]\n[50]\n[51]\n[52]\n[53]\n[54]\n\n[arXiv:astro-ph/0610806]; G. J. Stephenson, J. T. Goldman and B. H. J. McKellar, Int. J. Mod.\nPhys. A 13, 2765 (1998) [arXiv:hep-ph/9603392]; S. Matarrese, M. Pietroni and C. Schimd,\nJCAP 0308, 005 (2003) [arXiv:astro-ph/0305224]; A. V. Maccio, C. Quercellini, R. Mainini,\nL. Amendola and S. A. Bonometto, Phys. Rev. D 69, 123516 (2004) [arXiv:astro-ph/0309671];\nF. Vernizzi, Phys. Rev. D 69, 083526 (2004) [arXiv:astro-ph/0311167]; H. Li, M. Z. Li and\nX. M. Zhang, Phys. Rev. D 70, 047302 (2004) [arXiv:hep-ph/0403281]; K. Cheung and\nO. Seto, Phys. Rev. D 69, 113009 (2004) [arXiv:hep-ph/0403003]; A. Nusser, S. S. Gubser\nand P. J. E. Peebles, Phys. Rev. D 71, 083505 (2005) [arXiv:astro-ph/0412586]. S. S. Gubser\nand P. J. E. Peebles, Phys. Rev. D 70, 123510 (2004) [arXiv:hep-th/0402225].\nR. Fardon, A. E. Nelson and N. Weiner, JCAP 0410, 005 (2004) [arXiv:astro-ph/0309800].\nP. Gu, X. Wang and X. Zhang, Phys. Rev. D 68, 087301 (2003).\nR. D. Peccei, Phys. Rev. D 71, 023527 (2005) [arXiv:hep-ph/0411137].\nJ. Grande, J. Sola and H. Stefancic, JCAP 0608, 011 (2006) [arXiv:gr-qc/0604057]; J. Grande,\nA. Pelinson and J. Sola, Phys. Rev. D 79, 043006 (2009) [arXiv:0809.3462 [astro-ph]].\nN. Afshordi, M. Zaldarriaga and K. Kohri, Phys. Rev. D 72, 065024 (2005)\n[arXiv:astro-ph/0506663].\nM. Kaplinghat and A. Rajaraman, Phys. Rev. D 75, 103504 (2007) [arXiv:astro-ph/0601517].\nV. Pettorino and C. Baccigalupi, Phys. Rev. D 77, 103003 (2008) [arXiv:0802.1086 [astro-ph]].\nO. E. Bjaelde, A. W. Brookfield, C. van de Bruck, S. Hannestad, D. F. Mota, L. Schrempp\nand D. Tocchini-Valentini, JCAP 0801, 026 (2008) [arXiv:0705.2018 [astro-ph]]; O. E. Bjaelde\nand S. Hannestad, Phys. Rev. D 81, 063001 (2010) [arXiv:0806.2146 [astro-ph]].\nR. Bean, E. E. Flanagan and M. Trodden, Phys. Rev. D 78, 023009 (2008) [arXiv:0709.1128\n[astro-ph]]; New J. Phys. 10, 033006 (2008) [arXiv:0709.1124 [astro-ph]].\nJ. Valiviita, E. Majerotto and R. Maartens, JCAP 0807, 020 (2008) [arXiv:0804.0232 [astroph]].\nC. Wetterich and V. Pettorino, arXiv:0905.0715 [astro-ph.CO]; V. Pettorino, D. F. Mota,\nG. Robbers and C. Wetterich, AIP Conf. Proc. 1115, 291 (2009) [arXiv:0901.1239 [astro-ph]];\nL. Amendola, M. Baldi and C. Wetterich, Phys. Rev. D 78, 023015 (2008) [arXiv:0706.3064\n[astro-ph]]; C. Wetterich, Phys. Lett. B 655, 201 (2007) [arXiv:0706.4427 [hep-ph]];\nD. F. Mota, V. Pettorino, G. Robbers and C. Wetterich, Phys. Lett. B 663, 160 (2008)\n[arXiv:0802.1515 [astro-ph]]; V. Pettorino, D. F. Mota, G. Robbers and C. Wetterich, AIP\nConf. Proc. 1115, 291 (2009) [arXiv:0901.1239 [astro-ph]].\nA. W. Brookfield, C. van de Bruck and L. M. H. Hall, Phys. Rev. D 77, 043006 (2008)\n[arXiv:0709.2297 [astro-ph]]; A. W. Brookfield, C. van de Bruck, D. F. Mota and D. TocchiniValentini, Phys. Rev. Lett. 96, 061301 (2006) [arXiv:astro-ph/0503349]; Phys. Rev. D 73,\n083515 (2006) [Erratum-ibid. D 76, 049901 (2007)] [arXiv:astro-ph/0512367].\nA. E. Bernardini and O. Bertolami, Phys. Rev. D 77, 083506 (2008) [arXiv:0712.1534 [astroph]]; Phys. Lett. B 662, 97 (2008) [arXiv:0802.4449 [hep-ph]]; Phys. Lett. B 684, 96 (2010)\n[arXiv:0909.1280 [gr-qc]]; Phys. Rev. D 80, 123011 (2009) [arXiv:0909.1541 [gr-qc]].\nR. Takahashi and M. Tanimoto, Phys. Lett. B 633, 675 (2006) [arXiv:hep-ph/0507142].\nR. Takahashi and M. Tanimoto, JHEP 0605, 021 (2006) [arXiv:astro-ph/0601119].\nR. Fardon, A. E. Nelson and N. Weiner, JHEP 0603, 042 (2006) [arXiv:hep-ph/0507235].\nC. Spitzer, arXiv:astro-ph/0606034.\nK. Ichiki and Y. Y. Keum, JCAP 0806, 005 (2008) [arXiv:0705.2134 [astro-ph]]; JHEP 0806,\n058 (2008) [arXiv:0803.2274 [hep-ph]].\nJ.I. Kapusta and C. Gale, Finite-Temperature Field Theory: Principles and Applications,\n\n\f29\n\n[55]\n[56]\n[57]\n\n[58]\n\n[59]\n\n[60]\n[61]\n\n[62]\n[63]\n\n[64]\n\n[65]\n[66]\n\nSecond Edition, Cambridge University Press, Cambridge (2006).\nJ. Zinn-Justin, Quantum Field Theory and Critical Phenomena, 4th edition, Clarendon Press,\nOxford (2002).\nW. Greiner, L. Neise, and H. Stöcker, Thermodynamics and Statistical Mechanics, SpringerVerlag, New York (1995).\nS. Hannestad, JCAP 0305, 004 (2003) [arXiv:astro-ph/0303076]; V. Barger, J. P. Kneller,\nH. S. Lee, D. Marfatia and G. Steigman, Phys. Lett. B 566, 8 (2003) [arXiv:hep-ph/0305075];\nA. Melchiorri and C. J. Odman, Phys. Rev. D 67, 081302 (2003) [arXiv:astro-ph/0302361];\nS. D. Stirling and R. J. Scherrer, Phys. Rev. D 66, 043531 (2002) [arXiv:astro-ph/0206173];\nJ. Hamann, J. Lesgourgues and G. Mangano, JCAP 0803, 004 (2008) [arXiv:0712.2826 [astroph]].\nI. L. Shapiro and J. Sola, Phys. Lett. B 475, 236 (2000) [arXiv:hep-ph/9910462]; JHEP 0202,\n006 (2002) [arXiv:hep-th/0012227]; I. L. Shapiro, J. Sola, C. Espana-Bonet and P. RuizLapuente, Phys. Lett. B 574, 149 (2003) [arXiv:astro-ph/0303306]; I. L. Shapiro, J. Sola and\nH. Stefancic, JCAP 0501, 012 (2005) [arXiv:hep-ph/0410095]; J. Sola, J. Phys. A 41, 164066\n(2008) [arXiv:0710.4151 [hep-th]].\nF. Bauer, J. Sola and H. Stefancic, Phys. Lett. B 678, 427 (2009) [arXiv:0902.2215 [hep-th]];\nPhys. Lett. B 688, 269 (2010) [arXiv:0912.0677 [hep-th]]; D. A. Demir, Found. Phys. 39,\n1407 (2009) [arXiv:0910.2730 [hep-th]]. S. Basilakos, M. Plionis and J. Sola, Phys. Rev. D 80,\n083511 (2009) [arXiv:0907.4555 [astro-ph.CO]].\nN.D. Birrel and P.C.W. Davies, Quantum Fields in Curved Space, Cambridge University Press,\nCambridge (1982).\nG. E. Volovik, Phil. Trans. Roy. Soc. Lond. A 366, 2935 (2008) [arXiv:0801.0724 [gr-qc]];\nF. R. Klinkhamer and G. E. Volovik, Phys. Rev. D 77, 085015 (2008) [arXiv:0711.3170 [grqc]]; G. E. Volovik, The Universe in a Helium Droplet, Clarendon Press, Oxford (2003);\nG. E. Volovik, JETP Lett. 80, 531 (2004); JETP Lett. 77, 769 (2003).\nH. J. de Vega and N. G. Sanchez, arXiv:astro-ph/0701212.\nE. V. Gorbar and I. L. Shapiro, JHEP 0302, 021 (2003) [arXiv:hep-ph/0210388]; JHEP 0306,\n004 (2003) [arXiv:hep-ph/0303124]; I. L. Shapiro and J. Sola, Phys. Lett. B682, 105 (2009)\n[arXiv:0910.4935[hep-th]].\nA detailed analysis of the vicinity of the critical point shows that it is an unstable degenerate\nsaddle–node of the differential equation (107). See, e.g., N.N. Bautin and E.A. Leontovich,\nMethods of the Qualitative Analysis of Dynamical Systems on a Plane, Second Edition, Nauka,\nMoscow (1990).\nE. E. O. Ishida, R. R. R. Reis, A. V. Toribio and I. Waga, Astropart. Phys. 28, 547 (2008)\n[arXiv:0706.0546 [astro-ph]].\nS. M. R. Micheletti, arXiv:1009.6198 [gr-qc].\n\n\f"}