{"id": "http://arxiv.org/abs/0706.1672v1", "guidislink": true, "updated": "2007-06-12T12:01:52Z", "updated_parsed": [2007, 6, 12, 12, 1, 52, 1, 163, 0], "published": "2007-06-12T12:01:52Z", "published_parsed": [2007, 6, 12, 12, 1, 52, 1, 163, 0], "title": "Resonant phenomena in extended chaotic systems subject to external\n  noise: the Lorenz'96 model case", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0706.0686%2C0706.3804%2C0706.1137%2C0706.2757%2C0706.1776%2C0706.1239%2C0706.2362%2C0706.2069%2C0706.4415%2C0706.2784%2C0706.2077%2C0706.3934%2C0706.4387%2C0706.1285%2C0706.3639%2C0706.3217%2C0706.4019%2C0706.3458%2C0706.2697%2C0706.3752%2C0706.2894%2C0706.1418%2C0706.3128%2C0706.0207%2C0706.0231%2C0706.0857%2C0706.4114%2C0706.3455%2C0706.1927%2C0706.1501%2C0706.2372%2C0706.1698%2C0706.1268%2C0706.2230%2C0706.2129%2C0706.0683%2C0706.1277%2C0706.1996%2C0706.1993%2C0706.3440%2C0706.4435%2C0706.2198%2C0706.0766%2C0706.4182%2C0706.0947%2C0706.3568%2C0706.3117%2C0706.1470%2C0706.0772%2C0706.1014%2C0706.0679%2C0706.4016%2C0706.1926%2C0706.3898%2C0706.2712%2C0706.0022%2C0706.3029%2C0706.2619%2C0706.2386%2C0706.2603%2C0706.1251%2C0706.0871%2C0706.1255%2C0706.2361%2C0706.4026%2C0706.2834%2C0706.4313%2C0706.2148%2C0706.1999%2C0706.1781%2C0706.3020%2C0706.1899%2C0706.3561%2C0706.0735%2C0706.0893%2C0706.3867%2C0706.2235%2C0706.3878%2C0706.3267%2C0706.2521%2C0706.1672%2C0706.3095%2C0706.2249%2C0706.0728%2C0706.1773%2C0706.2694%2C0706.0508%2C0706.3887%2C0706.2924%2C0706.2021%2C0706.0056%2C0706.1611%2C0706.0257%2C0706.2434%2C0706.2535%2C0706.3922%2C0706.1836%2C0706.1329%2C0706.4119%2C0706.2823%2C0706.2992&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Resonant phenomena in extended chaotic systems subject to external\n  noise: the Lorenz'96 model case"}, "summary": "We investigate the effects of a time-correlated noise on an extended chaotic\nsystem. The chosen model is the Lorenz'96, a kind of \"toy\" model used for\nclimate studies. Through the analysis of the system's time evolution and its\ntime and space correlations, we have obtained numerical evidence for two\nstochastic resonance-like behavior. Such behavior is seen when both, the usual\nand a generalized signal-to-noise ratio function are depicted as a function of\nthe external noise intensity or the system size. The underlying mechanism seems\nto be associated to a \"noise-induced chaos reduction\". The possible relevance\nof these and other findings for an \"optimal\" climate prediction are discussed.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0706.0686%2C0706.3804%2C0706.1137%2C0706.2757%2C0706.1776%2C0706.1239%2C0706.2362%2C0706.2069%2C0706.4415%2C0706.2784%2C0706.2077%2C0706.3934%2C0706.4387%2C0706.1285%2C0706.3639%2C0706.3217%2C0706.4019%2C0706.3458%2C0706.2697%2C0706.3752%2C0706.2894%2C0706.1418%2C0706.3128%2C0706.0207%2C0706.0231%2C0706.0857%2C0706.4114%2C0706.3455%2C0706.1927%2C0706.1501%2C0706.2372%2C0706.1698%2C0706.1268%2C0706.2230%2C0706.2129%2C0706.0683%2C0706.1277%2C0706.1996%2C0706.1993%2C0706.3440%2C0706.4435%2C0706.2198%2C0706.0766%2C0706.4182%2C0706.0947%2C0706.3568%2C0706.3117%2C0706.1470%2C0706.0772%2C0706.1014%2C0706.0679%2C0706.4016%2C0706.1926%2C0706.3898%2C0706.2712%2C0706.0022%2C0706.3029%2C0706.2619%2C0706.2386%2C0706.2603%2C0706.1251%2C0706.0871%2C0706.1255%2C0706.2361%2C0706.4026%2C0706.2834%2C0706.4313%2C0706.2148%2C0706.1999%2C0706.1781%2C0706.3020%2C0706.1899%2C0706.3561%2C0706.0735%2C0706.0893%2C0706.3867%2C0706.2235%2C0706.3878%2C0706.3267%2C0706.2521%2C0706.1672%2C0706.3095%2C0706.2249%2C0706.0728%2C0706.1773%2C0706.2694%2C0706.0508%2C0706.3887%2C0706.2924%2C0706.2021%2C0706.0056%2C0706.1611%2C0706.0257%2C0706.2434%2C0706.2535%2C0706.3922%2C0706.1836%2C0706.1329%2C0706.4119%2C0706.2823%2C0706.2992&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We investigate the effects of a time-correlated noise on an extended chaotic\nsystem. The chosen model is the Lorenz'96, a kind of \"toy\" model used for\nclimate studies. Through the analysis of the system's time evolution and its\ntime and space correlations, we have obtained numerical evidence for two\nstochastic resonance-like behavior. Such behavior is seen when both, the usual\nand a generalized signal-to-noise ratio function are depicted as a function of\nthe external noise intensity or the system size. The underlying mechanism seems\nto be associated to a \"noise-induced chaos reduction\". The possible relevance\nof these and other findings for an \"optimal\" climate prediction are discussed."}, "authors": ["Jorge A. Revelli", "Miguel A. Rodriguez", "Horacio S. Wio"], "author_detail": {"name": "Horacio S. Wio"}, "author": "Horacio S. Wio", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1016/j.physa.2008.01.110", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0706.1672v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0706.1672v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "Submitted to Europhysics Letters (LaTex, 12 pgs, 5 figures)", "arxiv_primary_category": {"term": "nlin.CD", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "nlin.CD", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "cond-mat.stat-mech", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "physics.ao-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0706.1672v1", "affiliation": "IFCA, Spain", "arxiv_url": "http://arxiv.org/abs/0706.1672v1", "journal_reference": null, "doi": "10.1016/j.physa.2008.01.110", "fulltext": "Resonant phenomena in extended chaotic systems subject to\nexternal noise: the Lorenz'96 model case\nJorge A. Revelli,1, ∗ Miguel A. Rodriguez,1, † and Horacio S. Wio1, ‡\n1\n\nInstituto de Fı́sica de Cantabria, Universidad de\n\nCantabria and CSIC, E-39005 Santander, Spain\n\nAbstract\n\narXiv:0706.1672v1 [nlin.CD] 12 Jun 2007\n\nWe investigate the effects of a time-correlated noise on an extended chaotic system. The chosen\nmodel is the Lorenz'96, a kind of \"toy\" model used for climate studies. Through the analysis of the\nsystem's time evolution and its time and space correlations, we have obtained numerical evidence\nfor two stochastic resonance-like behavior. Such behavior is seen when both, the usual and a\ngeneralized signal-to-noise ratio function are depicted as a function of the external noise intensity\nor the system size. The underlying mechanism seems to be associated to a noise-induced chaos\nreduction. The possible relevance of these and other findings for an optimal climate prediction are\ndiscussed.\nPACS numbers:\n\n∗\n†\n‡\n\nElectronic address: revelli@ifca.unican.es\nElectronic address: rodrigma@ifca.unican.es\nElectronic address: wio@ifca.unican.es\n\n1\n\n\fI.\n\nINTRODUCTION\n\nThe last decades have witnessed a growing interest in the study of the effect of noise on\ndynamical systems. It was proved that, under some conditions, when a nonlinear dynamical\nsystem is subject to noise, new phenomena can arise, phenomena that only occur under the\neffect of such noise. All these phenomena are lump together under the name noise-induced\nphenomena. A few examples are: stochastic resonance in zero-dimensional and extended\nsystems [1, 2, 3], noise-induced transitions [4], noise-induced phase transitions [5, 6], noiseinduced transport [7, 8], noise-sustained patterns [9, 10], noise-induced limit cycle [11].\nClearly, some of the above indicated noise-induced phenomena occur in spatially extended\nsystems, where another phenomena of great relevance exists: spatio-temporal chaos [12].\nHowever, studies on the effect of noise on spatially extended chaotic systems are scarce [13].\nThere are studies on chaotic systems where the pseudo-random behavior of the system is\nthe trigger of phenomena usually associated with the effect of a real stochastic process (see\nfor instance [14, 15]). Hence, we can refer to the presence of a deterministic noise, that is a\npseudo-noisy behavior associated to the chaotic character of the system.\nAmong others, one of the most relevant and largely analyzed application of studies of\nchaos in extended systems corresponds to climate prediction. These kind of problems have\nbeen described by Lorenz [17] as falling into two categories. On one hand those which\ndepend on the initial conditions, while on the other are those depending on the boundaries.\nHowever, both kind of prediction problems are affected by errors in the model equations\nused to approximately described the behavior of real systems.\nIn a recent work [16], and with the aim to improve the limited weather predictability that\nresults from a combination of initial conditions uncertainty and model error, it was presented\na study of the effect of a stochastic parametrization in the Lorenz'96 model [18, 19]. It is\nwell known that much of the current error in weather predictability derives from the practice\nof representing the effects of process occurring at unresolved scales by using simple forms of\ndeterministic parametrization, attempting to summarize the effects of small-scale processes\nin terms of larger-scale, resolved, prognostic variables.\nIn this work, and with a similar objective as in a previously indicated paper [16], we\ninvestigate the effect of a time-correlated noise on an extended chaotic system, analyzing the\ncompetence between the above indicated deterministic noise and a real stochastic process.\n2\n\n\fIn order to perform such a study we have chosen the Lorenz'96 model [17]. In spite of the\nfact that it is a kind of toy-model, at variance with the cases studied in [13], it has a clear\ncontact with real systems as it is of interest for the analysis of climate behavior and weather\nprediction [16, 18, 19]. In fact, this model has been heuristically formulated as the simplest\nway to take into account certain properties of global atmospheric models. To reach our\nobjective, we have assumed that the only model parameter is time dependent and composed\nof two parts, a constant deterministic contribution plus a stochastic one.\nThrough the analysis of the system's temporal evolution and its time and space correlations, we have obtained numerical evidence for two stochastic resonance-like (SR) [1]\nbehaviors. Such behaviors are seen when both, the usual signal-to-noise ratio (SNR) and\na generalized function SNRglob (that we call global SNR), are depicted as function of the\nexternal noise intensity or the system size. In accord with what was shown in previous works\n[1], a SR phenomenon can occur in systems without external periodic forcing, but having an\ninternal typical frequency. Hence, it seems reasonable to assume that the present resonances\ntypically occur at frequencies corresponding to a system's internal quasi-periodic behavior,\nas well as at an optimal system's size. Finally, we discuss the possible relevance of these\nfindings for climate prediction.\n\nII.\n\nTHE MODEL AND RESPONSE MEASURES\nA.\n\nThe Model Lorenz'96\n\nThe equations corresponding to the Lorenz'96 model [17, 18] are\nẋj (t) = −xj−1 (xj−2 − xj+1 ) − xj + F.\n\n(1)\n\nj = 1, 2, 3, . . . , N,\nwhere ẋj (t) indicates the time derivative of xj (t). In order to simulate a scalar meteorological\nquantity extended around a latitude circle, we consider periodic boundary conditions: x0 =\nxN , x−1 = xN −1 .\nAs indicated before, the Lorenz'96 model [17] has been heuristically formulated as the\nsimplest way to take into account certain properties of global atmospheric models. The terms\nincluded in the equation intend to simulate advection, dissipation and forcing respectively.\n3\n\n\fIn contrast with other toy models used in the analysis of extended chaotic systems and based\non coupled map lattices, the Lorenz'96 system exhibits extended chaos (F > 9/8), with a\nspatial structure in the form of moving waves [17]. The length of these waves is close to 5\nspatial units. It is worth noting that the system has scaled variables with unit coefficients,\nhence the time unit is the dissipative decay time. In these units the group velocity of the\nwaves is close to vgr = 1.20 implying a eastward propagation. If, as done by Lorenz, we\nassociate the time unit to 5 days and the system size of 40 to the length of a latitude circle,\nwe have a highly illustrative representation of a global model. If in addition we adjust the\nvalue of the parameter F to give a reasonable signal to noise ratio (Lorenz considered F = 8)\nthe model could be most adequate to perform basic studies of predictability. Hence, within\nthis framework, the signal analyzed in this paper would correspond to the passing of waves\nin a generic observational site, in what is a simple mimic of forecasting at an intermediate\ntime range.\n\nB.\n\nStochastic contribution\n\nAs indicated before, here we assume that the model parameter F becomes time dependent,\nand has two contributions, a constant and a random one\nFj (t) = Fmed + Ψj (t),\n\n(2)\n\nwith Ψj (t) a dichotomic process. That is, Ψj (t) adopts the values ±∆, with a transition\nrate γ: each state (±∆) changes according to the waiting time distribution ψi (t) ∼ e−γt .\nThe noise intensity for this process is defined through [20, 21] ξ =\n\nC.\n\n∆2\n.\n2γ\n\nSystem Response\n\nAs a measure of the SR system's response we have used the signal-to-noise ratio (SNR)\n[1]. To obtain the SNR we need to previously evaluate S(ω), the power spectral density\n(psd), defined as the Fourier transform of the correlation function [20, 21]\nZ ∞\nS(ω) =\neiωτ hxj (0)xj (τ )i dτ,\n\n(3)\n\n−∞\n\nwhere h i indicates the average over realizations. As we have periodic boundary conditions\nsimulating a closed system, hxj (0)xj (τ )i has a homogeneous spatial behavior. Hence, it is\n4\n\n\fenough to analyze the response in a single site.\nWe consider two forms of SNR. In one hand the usual SNR measure at the resonant\nfrequency ωo (that is, in fact, at the frequency associated to the highest peak in S(ω)) is\nR ωo +σ\nd̟S(̟)\no −σ\nSNR = R ωoω+σ\n,\n(4)\nd̟S\n(̟)\nback\nωo −σ\nwhere 2σ is a very small range around the resonant frequency ωo , and Sback (ω) corresponds\n\nto the background psd. On the other hand we consider a global form of the SNR (SNRglob )\ndefined through\n\nR ωmax\n\ndωS(ω)\nωmin\n,\nSNRglob = R ωmax\ndωS\n(ω)\nback\nωmin\n\n(5)\n\nwhere ωmin and ωmax define the frequency range where S(ω) has a reach peak structure\n(with several resonant frequencies).\n\nIII.\n\nRESULTS\n\nWe have analyzed the typical behavior of trajectories as x1 (t) − xmed−T , where xmed−T is\nthe time average. It is worth commenting that when the Lorenz96 system evolves without\nexternal noise (that is Fj (t) is constant), the time evolution shows a random-like behavior,\nwith the main feature that the amplitude of the oscillator is constant over all the time.\nHowever, when the system is subject to a random force as described in Eq. (2), the temporal\nresponse decays, due to the fact that the interaction between the intrinsic evolution and the\nexternal noise produces a dissipative contribution on the system. Hence the system's time\nevolution consists of a transitory regime and a stationary one. This was analyzed through the\nbehavior of the \"decay\" of hx1 (t) − xmed−T i. We assumed that this decay can be adjusted\nby an exponential law. The decay parameter (λ) only depends on Fmed and it does not\ndepend neither on the system size nor on the noise intensity. This analysis is relevant when\nstudying the effects of noise on the stationary regime. From those results it was possible to\nanticipate, and approximately identify, the existence of two regimes: a weak or undeveloped\nchaos for Fmed < 6.0, and strong or completely developed chaos for Fmed > 6.0.\nThe typical numbers we have used in our simulations are: averages over 103 histories,\nand ∼ 104 simulation time steps (within the stationary regime, see later).\nWe have evaluated the psd S(ω) in a standard way. Figure 1-a shows the typical form of\nthe psd S(ω) for a couple of values of Fmed (Fmed = 4.5, 7.8) and for a noise intensity ∆ = 0.1\n5\n\n\f1E-3\n\n60\n\na\n\nb\n\n1E-5\n\n50\n\n1E-7\n\nS(k)\n\nS(\n\n)\n\n40\n\n1E-9\n\n1E-11\n\n30\n\n20\n\n10\n1E-13\n\n0\n1E-15\n0,01\n\n0,1\n\n1\n\n10\n\n0,0\n\n100\n\n0,1\n\nk / 2\n\n(arb. units)\n\n0,2\n\n0,3\n\n0,4\n\n0,5\n\n(arb. units)\n\nFIG. 1: (a) S(ω) for a couple of values of Fmed (Fmed = 4.5, 7.8) and for a small noise intensity\n(ξ = 5 × 10−4 , ∆ = 0.1 and N = 128). (b) Spatial spectrum for N = 256, ∆ = 0.001 and γ = 10,\nfor several values of Fmed : continuous line Fmed = 5, dashed Fmed = 6, dotted Fmed = 7 and\ndash-dotted Fmed = 8 .\n\n(ξ = 5 × 10−4 ). The figure shows a rich peak structure within the interval 0.22 < ω < 1.3.\nIt is worth to comment that the frequencies associated to the different peaks seems to\ncorrespond to the harmonics of the main (or first) peak frequency. In Fig. 1-b, we show the\nform of S(k), the associated spatial spectrum. Here we depict the spectrum for fixed values\nof the system's size (N = 256), and noise intensity (∆ = 0.001 and γ = 10), and different\nvalues of Fmed . The independence of the position of the peak (indicating a single spatial\nstructure of wavelength k/2π = 0.2) is apparent. However there is a strong dependence on\nthe peak intensity when varying Fmed , from a net peak for underdeveloped chaos (Fmed = 5)\nto a reduced peak for well developed chaos (Fmed = 8). It is worth here remarking that there\nis no dependence (or eventually a very weak one) of this behavior on the noise intensity.\nFigure 2 shows the dependence of SNRglob –for a space-temporal noise– on ∆ for fixed\nvalues of N and a couple of values of Fmed . It shows a peak for ∆ ∼ 6 − 7 × 10−3 , that\ncorresponds to the fingerprint of the more usual form of SR. The insert shows the same case\nbut for SNR.\nThe analysis of the dependence of SNRglob on Fmed have also shown the existence of\nthe previously indicated two regimes: a weak or undeveloped chaos for Fmed < 6.0, and a\nstrong or completely developed chaos for Fmed > 6.0. Those regimes are characterized by\n\n6\n\n\f100\n\nS N R\n\n100\n\n10\n\n1\n1E-5\n\n1E-4\n\n1E-3\n\n0,01\n\n0,1\n\n1\n\n10\n\nS N R\n\nGLOBAL\n\n(arb. units)\n\n1\n1E-5\n\n1E-4\n\n1E-3\n\n0,01\n\n0,1\n\n1\n\n(arb. units)\n\nFIG. 2: SN Rglob vs ∆, for fixed values of N = 64 and γ = 10; and a couple of values of Fmed :\nwhite circles Fmed = 5, black squares Fmed = 6. The insert shows the behavior of the usual SN R\nfor the same cases.\n\nthe existence of well defined peaks in the psd, in the former case, and a less defined peak\nstructure in the latter case, as seen in Fig. 1a .\nIt is worth to detach the strong similarities in the behavior of SNR and SNRglob –which\nbecomes apparent when comparing the main Fig. 2 with its insert– indicating that the\nsecond one is an adequate and more versatile measure to characterize the system's response.\nHence, due to the clearness in the determination of SNRglob (compared with the difficulties\nfor a correct determination of SNR for large values of Fmed ) in what follows we adopt it for\nthe system's analysis.\nIn Fig. 3 we depict the dependence of SNRglob on N, for the case of space-temporal\nnoise, for fixed values of ∆ = 0.1 and γ = 5 (ξ = 0.001) and a couple of values of Fmed .\n7\n\n\f16\n\n50\n\n40\n\nS N R\n\n14\n\n30\n\n20\n\n10\n\n12\n\n0\n0\n\n100\n\n200\n\n300\n\n400\n\n500\n\nS N R\n\nGLOBAL\n\nN (Oscillator Number)\n\n10\n8\n6\n4\n2\n\n0\n\n100\n\n200\n\n300\n\n400\n\n500\n\nN (Oscillator Number)\n\nFIG. 3: SN Rglob vs N , for fixed values of ∆ = 0.1 and γ = 5 (ξ = 0.001), and a couple of values of\nFmed : white circles Fmed = 5, black squares Fmed = 6. The insert shows the behavior of the usual\nSN R for the same cases.\n\nThe existence of the peak at N ∼ 60 for Fmed = 5.0 is apparent. In addition, we observe an\nincrease of SNRglob for large values of N. However, for Fmed = 6.0, the peak has disappeared,\nas well as the increase with larger values of N. The presence of the peak at N ∼ 60 indicates\na kind of system-size stochastic-resonance (SSSR) [23]. The insert shows the same case but\nfor SNR. Again, as indicated above, the nice agreement between the behavior of SNRglob\nand that of SNR.\nThe figures clearly show that the system's response (SNR) is stronger when the system is\nin the underdeveloped chaos range than when it is in the highly-developed chaos one. Our\nresults also show that the main resonant frequency does not depend on the noise intensity,\nsystem size, or correlation rate.\nWe want to close this section commenting that the SR phenomena found here looks\n8\n\n\f1E-5\n\n1E-9\n\nS(\n\n)\n\n1E-7\n\n1E-11\n\n1E-13\n\n1E-15\n0,01\n\n0,1\n\n1\n\n10\n\n100\n\n(arb. units)\n\nFIG. 4: S(ω) with and without external noise, for F = 5 and γ = 10. Continuous line ∆ = 0,\ndot-line ∆ = 0.1.\n\nsimilar to the so called internal signal SR [22]. In previous studies it was shown that in\nsome systems having an internal typical frequency, SR can occur not only at the frequency\nof an external driving signal, but at the frequency corresponding to the internal periodic\nbehavior [22]. Regarding the present mechanism of SR, what we can indeed comment is that\nthe increase in the SNR is related not to a reinforcement of the peak high respect to the\nnoisy background at a given frequency, but with a reduction of the pseudo (or deterministic)\nnoisy background when turning on the real noise. That is, the interplay between \"real\"\nnoise and \"deterministic\" noise conforms a kind of noise-induced chaos reduction. Figure 4\nshows, for fixed values of F and γ, the behavior of S(ω) in both cases: with (∆ 6= 0) and\nwithout noise (∆ = 0). The above indicated reduction trend, as the real noise is turned on,\nis apparent. However, the present mechanism is not completely clear so far, and requires\nfurther studies.\n\nIV.\n\nCONCLUSIONS\n\nWe have investigated the effect of a time-correlated noise on an extended chaotic system,\nanalyzing the competence between the indicated deterministic or pseudo-noise and the real\nrandom process. For our study we have chosen the Lorenz'96 model [17] that, in spite of\n9\n\n\fthe fact that it is a kind of toy model, is of interest for the analysis of climate behavior\n[16, 19]. It worth remarking that it accounts in a simple way of the spatial structure of\ngeostrophic waves and the dynamics of tropical winds. The time series obtained at a generic\nsite xi (t) mimics the passing of such waves, which is in fact a typical forecast event. We\nhave assumed that the unique model parameter F , is time dependent and composed of two\nparts, a constant deterministic, and a stochastic contribution in a spatial-temporal form.\nWe have done a thorough analysis of the system's temporal evolution and its time and\nspace correlations. From our results it is clear that, using two complementary SNR measures,\na usual and a global one, we have obtained numerical evidence for two SR-like behaviors.\nIn one hand a \"normal\" SR phenomenon occur at frequencies that seem to correspond\nto a system's quasi-periodic behavior. On the other hand, we have found a SSSR-like\nbehavior, indicating that there is an optimal system size for the analysis of the spatial\nsystem's response. As indicated before, the effect of noise is stronger when the chaos is\nunderdeveloped.\nWe argue that these findings are of interest for an optimal climate prediction. It is clear\nthat the inclusion of the effect of an external noise, that is a stochastic parametrization\nof unknown external influences, could strongly affect the deterministic system response,\nparticularly through the possibility of an enhanced system's response in the form of resonantlike behavior. It is worth here remarking the excellent agreement between the resonant\nfrequencies and wave length found here, and the estimates of Lorenz [18].\nThe effect of noise is weak respect to changes in the spatial structure, with the main frequencies remaining unaltered, but it is strong concerning the strength of the \"self-generated\"\ndeterministic noise. In fact, in such a system and at the resonant frequencies, forecasting\ncould be improved by the external noise due to the effect of suppression of the self-generated\nchaotic noise. The detailed analysis of such an aspect will be the subject of a forthcoming\nstudy [24].\n\nAcknowledgments\n\nWe acknowledge financial support from MEC, Spain, through Grant No. CGL200402652/CLI. JAR thanks the MEC, Spain, for the award of a Juan de la Cierva fellowship.\nHSW thanks to the European Commission for the award of a Marie Curie Chair during\n10\n\n\fpart of the development of this work.\n\nAcknowledgements\n\nWe acknowledge financial support from MEC, Spain, through Grant No. CGL200402652/CLI. JAR thanks the MEC, Spain, for the award of a Juan de la Cierva fellowship.\nHSW thanks to the European Commission for the award of a Marie Curie Chair during\npart of the development of this work.\n\n[1] L. Gammaitoni, P. Hänggi, P. Jung and F. Marchesoni, Rev. Mod. Phys. 70, 223 (1998).\n[2] J. F. Lindner, B. K. Meadows, W. L. Ditto, M. E. Inchiosa and A. Bulsara, Phys. Rev. E 53,\n2081 (1996);\n[3] H. S. Wio, Phys. Rev. E 54, R3045 (1996); F. Castelpoggi and H. S. Wio, Europhys. Lett.\n38, 91 (1997); F. Castelpoggi and H. S. Wio, Phys. Rev. E 57, 5112 (1998); S. Bouzat and\nH. S. Wio, Phys. Rev. E 59, 5142 (1999); H. S. Wio, S. Bouzat and B. von Haeften, in Proc.\n21st IUPAP International Conference on Statistical Physics, STATPHYS21, A.Robledo and\nM. Barbosa, Eds., published in Physica A 306C 140-156 (2002).\n[4] W. Horsthemke and R. Lefever, Noise-Induced Transitions: Theory and Applications in\nPhysics, Chemistry and Biology, (Springer, Berlin, 1984).\n[5] C. Van den Broeck, J. M. R. Parrondo and R. Toral, Phys. Rev. Lett. 73, 3395 (1994); C.\nVan den Broeck, J. M. R. Parrondo, R. Toral and R. Kawai, Phys. Rev. E 55, 4084 (1997).\n[6] S. Mangioni, R. Deza, H. S. Wio and R. Toral, Phys. Rev. Lett. 79, 2389 (1997);\nS. Mangioni, R. Deza, R. Toral and H. S. Wio, Phys. Rev. E 61, 223 (2000).\n[7] P. Reimann, Phys. Rep. 361, 57 (2002); R. D. Astumian and P. Hänggi, Physics Today, 55\n(11) 33 (2002).\n[8] P. Reimann, R. Kawai, C. Van den Broeck and P. Hänggi, Europhys. Lett. 45, 545 (1999); S.\nMangioni, R. Deza and H.S. Wio, Phys. Rev. E 63, 041115 (2001).\n[9] J. Garcı́a-Ojalvo, A. Hernández-Machado and J. M. Sancho, Phys. Rev. Lett. 71, 1542 (1993);\nJ. Garcı́a-Ojalvo and J. M. Sancho, Noise in Spatially Extended Systems (Springer-Verlag, New\nYork, 1999).\n\n11\n\n\f[10] B. von Haeften and G. Izús, Phys. Rev. E 67, 056207 (2003), G. Izús, P. Colet, M. San Miguel\nand M. Santagiustina, Phys. Rev. E 68, 036201 (2003).\n[11] S. Mangioni and H. S. Wio, Phys. Rev. E 67, 056616 (2003).\n[12] T. Bohr, M.H. Jensen, G. Paladin and A. Vulpiani, Dynamical Systems Approach to Turbulence, (Cambridge U.P., Cambridge, 1998).\n[13] J.M. Gutiérrez, A. Iglesias and M.A. Rodrı́guez , Phys. Rev. Lett. 48, 2507 (1993); H. Wang\nand Q. Ouyang, Phys. Rev. E 65 046206 (2002); G. A. Gottwald and I. Melbourne, Physica\nD 212, 100 (2005); G. Ambika, K. Menon and K.P. Harikrishnan, Europhys. Lett. 73, 506\n(2006).\n[14] V. S. Anishchenko, A. B. Neiman and M. A. Safanova, J. Stat. Phys. 70, 183 (1993); V. S.\nAnishchenko, M. A. Safanova and L. O. Chua, Int. J. Bifurcation and Chaos Appl. Sci. Eng.\n4, 441 (1994).\n[15] D. Hennig, L. Schimansky-Geier and P. Hänggi, Europhys. Lett. 78, 20002 (2007).\n[16] D. S. Wilks, Quaterly J. of the Royal Meteor. Soc. B 131, 389 (2005)\n[17] E. N. Lorenz, The essence of chaos, (U.Washington Press, Washington, 1996).\n[18] E. N. Lorenz and K. A. Emanuel, J. Atmosph. Sci. 55, 399 (1998).\n[19] D. Orrell, J. Atmosph. Sci. 60, 2219 (2003)\n[20] N. van Kampen; Stochastic Processes in Physics and Chemistry, (North Holland, 1982)\n[21] C. W. Gardiner; Handbook of Stochastic Methods, 2nd Ed. (Springer-Verlag, Berlin, 1985).\n[22] H. Gang, T. Ditzinger, C.Z. Ning and H. Haken, Phys. Rev. Lett. 71, 807 (1993); S. Zhong\nand H. Xin, J. Phys Chem. 104, 297 (2000); A. F. Rosenfeld, C. J. Tessone, E. Albano and\nH. S. Wio, Phys. Lett. 280, 45 (2001).\n[23] B. von Haeften, G. G. Izús and H. S. Wio, Phys. Rev. E 72, 021101 (2005).\n[24] J. A. Revelli, M. A. Rodriguez and H. S. Wio, to be submited to Europ. Phys. J. B.\n\n12\n\n\f"}