{"id": "http://arxiv.org/abs/0909.1787v1", "guidislink": true, "updated": "2009-09-09T18:56:07Z", "updated_parsed": [2009, 9, 9, 18, 56, 7, 2, 252, 0], "published": "2009-09-09T18:56:07Z", "published_parsed": [2009, 9, 9, 18, 56, 7, 2, 252, 0], "title": "Energy gaps, topological insulator state and zero-field quantum Hall\n  effect in graphene by strain engineering", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0909.0192%2C0909.1846%2C0909.5077%2C0909.2247%2C0909.0996%2C0909.3331%2C0909.2376%2C0909.2105%2C0909.0880%2C0909.4761%2C0909.1940%2C0909.1068%2C0909.5159%2C0909.1030%2C0909.4821%2C0909.3815%2C0909.2697%2C0909.1976%2C0909.3104%2C0909.2010%2C0909.3665%2C0909.3583%2C0909.2180%2C0909.4972%2C0909.2591%2C0909.4719%2C0909.5277%2C0909.0952%2C0909.2542%2C0909.5307%2C0909.5534%2C0909.3226%2C0909.1252%2C0909.2539%2C0909.2274%2C0909.1939%2C0909.4793%2C0909.0415%2C0909.1773%2C0909.3206%2C0909.1553%2C0909.3253%2C0909.4978%2C0909.2254%2C0909.1655%2C0909.4315%2C0909.3340%2C0909.4374%2C0909.2707%2C0909.0162%2C0909.2500%2C0909.4307%2C0909.2258%2C0909.4652%2C0909.0561%2C0909.3685%2C0909.3444%2C0909.2384%2C0909.4289%2C0909.2793%2C0909.2068%2C0909.4090%2C0909.5093%2C0909.2496%2C0909.3906%2C0909.0426%2C0909.3132%2C0909.4018%2C0909.5293%2C0909.1067%2C0909.5141%2C0909.1787%2C0909.4443%2C0909.2819%2C0909.1691%2C0909.1148%2C0909.3519%2C0909.4076%2C0909.1367%2C0909.3455%2C0909.0147%2C0909.1809%2C0909.5526%2C0909.1315%2C0909.2312%2C0909.2790%2C0909.3006%2C0909.1728%2C0909.2257%2C0909.0835%2C0909.0452%2C0909.0417%2C0909.3018%2C0909.3292%2C0909.4755%2C0909.3068%2C0909.2386%2C0909.3014%2C0909.1290%2C0909.4063%2C0909.3257&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Energy gaps, topological insulator state and zero-field quantum Hall\n  effect in graphene by strain engineering"}, "summary": "Among many remarkable qualities of graphene, its electronic properties\nattract particular interest due to a massless chiral character of charge\ncarriers, which leads to such unusual phenomena as metallic conductivity in the\nlimit of no carriers and the half-integer quantum Hall effect (QHE) observable\neven at room temperature [1-3]. Because graphene is only one atom thick, it is\nalso amenable to external influences including mechanical deformation. The\nlatter offers a tempting prospect of controlling graphene's properties by\nstrain and, recently, several reports have examined graphene under uniaxial\ndeformation [4-8]. Although the strain can induce additional Raman features\n[7,8], no significant changes in graphene's band structure have been either\nobserved or expected for realistic strains of approx. 10% [9-11]. Here we show\nthat a designed strain aligned along three main crystallographic directions\ninduces strong gauge fields [12-14] that effectively act as a uniform magnetic\nfield exceeding 10 T. For a finite doping, the quantizing field results in an\ninsulating bulk and a pair of countercirculating edge states, similar to the\ncase of a topological insulator [15-20]. We suggest realistic ways of creating\nthis quantum state and observing the pseudo-magnetic QHE. We also show that\nstrained superlattices can be used to open significant energy gaps in\ngraphene's electronic spectrum.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0909.0192%2C0909.1846%2C0909.5077%2C0909.2247%2C0909.0996%2C0909.3331%2C0909.2376%2C0909.2105%2C0909.0880%2C0909.4761%2C0909.1940%2C0909.1068%2C0909.5159%2C0909.1030%2C0909.4821%2C0909.3815%2C0909.2697%2C0909.1976%2C0909.3104%2C0909.2010%2C0909.3665%2C0909.3583%2C0909.2180%2C0909.4972%2C0909.2591%2C0909.4719%2C0909.5277%2C0909.0952%2C0909.2542%2C0909.5307%2C0909.5534%2C0909.3226%2C0909.1252%2C0909.2539%2C0909.2274%2C0909.1939%2C0909.4793%2C0909.0415%2C0909.1773%2C0909.3206%2C0909.1553%2C0909.3253%2C0909.4978%2C0909.2254%2C0909.1655%2C0909.4315%2C0909.3340%2C0909.4374%2C0909.2707%2C0909.0162%2C0909.2500%2C0909.4307%2C0909.2258%2C0909.4652%2C0909.0561%2C0909.3685%2C0909.3444%2C0909.2384%2C0909.4289%2C0909.2793%2C0909.2068%2C0909.4090%2C0909.5093%2C0909.2496%2C0909.3906%2C0909.0426%2C0909.3132%2C0909.4018%2C0909.5293%2C0909.1067%2C0909.5141%2C0909.1787%2C0909.4443%2C0909.2819%2C0909.1691%2C0909.1148%2C0909.3519%2C0909.4076%2C0909.1367%2C0909.3455%2C0909.0147%2C0909.1809%2C0909.5526%2C0909.1315%2C0909.2312%2C0909.2790%2C0909.3006%2C0909.1728%2C0909.2257%2C0909.0835%2C0909.0452%2C0909.0417%2C0909.3018%2C0909.3292%2C0909.4755%2C0909.3068%2C0909.2386%2C0909.3014%2C0909.1290%2C0909.4063%2C0909.3257&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Among many remarkable qualities of graphene, its electronic properties\nattract particular interest due to a massless chiral character of charge\ncarriers, which leads to such unusual phenomena as metallic conductivity in the\nlimit of no carriers and the half-integer quantum Hall effect (QHE) observable\neven at room temperature [1-3]. Because graphene is only one atom thick, it is\nalso amenable to external influences including mechanical deformation. The\nlatter offers a tempting prospect of controlling graphene's properties by\nstrain and, recently, several reports have examined graphene under uniaxial\ndeformation [4-8]. Although the strain can induce additional Raman features\n[7,8], no significant changes in graphene's band structure have been either\nobserved or expected for realistic strains of approx. 10% [9-11]. Here we show\nthat a designed strain aligned along three main crystallographic directions\ninduces strong gauge fields [12-14] that effectively act as a uniform magnetic\nfield exceeding 10 T. For a finite doping, the quantizing field results in an\ninsulating bulk and a pair of countercirculating edge states, similar to the\ncase of a topological insulator [15-20]. We suggest realistic ways of creating\nthis quantum state and observing the pseudo-magnetic QHE. We also show that\nstrained superlattices can be used to open significant energy gaps in\ngraphene's electronic spectrum."}, "authors": ["F. Guinea", "M. I. Katsnelson", "A. K. Geim"], "author_detail": {"name": "A. K. Geim"}, "author": "A. K. Geim", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1038/nphys1420", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0909.1787v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0909.1787v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "cond-mat.mes-hall", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.mes-hall", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "cond-mat.mtrl-sci", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0909.1787v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0909.1787v1", "arxiv_comment": null, "journal_reference": "Nature Phys.6:30-33,2010", "doi": "10.1038/nphys1420", "fulltext": "Energy gaps, topological insulator state and zero-field quantum Hall effect\nin graphene by strain engineering\nF. Guinea1, M. I. Katsnelson2 & A. K. Geim3\n\n1\n\nInstituto de Ciencia de Materiales de Madrid (CSIC), Sor Juana Inés de la Cruz 3, Madrid 28049, Spain\n2\nInstitute for Molecules and Materials, Radboud University Nijmegen, Nijmegen, The Netherlands\n3\nManchester Centre for Mesoscience and Nanotechnology, University of Manchester, Manchester, UK\n\nAmong many remarkable qualities of graphene, its electronic properties attract particular interest due\nto a massless chiral character of charge carriers, which leads to such unusual phenomena as metallic\nconductivity in the limit of no carriers and the half-integer quantum Hall effect (QHE) observable\neven at room temperature [1-3]. Because graphene is only one atom thick, it is also amenable to\nexternal influences including mechanical deformation. The latter offers a tempting prospect of\ncontrolling graphene's properties by strain and, recently, several reports have examined graphene\nunder uniaxial deformation [4-8]. Although the strain can induce additional Raman features [7,8], no\nsignificant changes in graphene's band structure have been either observed or expected for realistic\nstrains of ~10% [9-11]. Here we show that a designed strain aligned along three main crystallographic\ndirections induces strong gauge fields [12-14] that effectively act as a uniform magnetic field exceeding\n10 T. For a finite doping, the quantizing field results in an insulating bulk and a pair of countercirculating edge states, similar to the case of a topological insulator [15-20]. We suggest realistic ways\nof creating this quantum state and observing the pseudo-magnetic QHE. We also show that strained\nsuperlattices can be used to open significant energy gaps in graphene's electronic spectrum.\nIf a mechanical strain Δ varies smoothly on the scale of interatomic distances, it does not break the sublattice\nsymmetry but rather deforms the Brillouin zone in such a way that the Dirac cones located in graphene at\npoints K and K' are shifted in the opposite directions [2]. This is reminiscent of the effect induced on charge\ncarriers by magnetic field B applied perpendicular to the graphene plane [2,12-14]. The strain-induced,\npseudo-magnetic field BS or, more generally, gauge field vector potential A have opposite signs for\ngraphene's two valleys K and K', which means that elastic deformations, unlike magnetic field, do not\nviolate the time-reversal symmetry of a crystal as a whole [12-14,21,22].\nBased on this analogy between strain and magnetic field, we ask the following question: Is it possible to\ncreate such a distribution of strain that it results in a strong uniform pseudo-field BS and, accordingly, leads\nto a \"pseudo-QHE\" observable in zero B? The previous attempts to engineer energy gaps by applying strain\n[5-7] seem to suggest a negative answer. Indeed, the hexagonal symmetry of the graphene lattice generally\nimplies a highly anisotropic distribution of BS [21,22]. Therefore, the strain is expected to contribute\nprimarily in the phenomena that do not average out in a random magnetic field such as weak localization\n[13,14]. Furthermore, a strong gauge field necessitates the opening of energy gaps due to Landau\nquantization, δE ≈ 400K ⋅ B (>0.1 eV for BS =10T) whereas no gaps were theoretically found for uniaxial\nstrain as large as ≈25% [4]. The only way to induce significant gaps, which was known so far, is to spatially\nconfine carriers (δE ≈0.1 eV requires 10 nm wide ribbons) [1,2]. Contrary to these expectations, we have\nfound that by applying stresses with triangular symmetry, it is possible to generate a uniform quantizing BS\nequivalent to tens of Tesla so that the corresponding gaps exceed 0.1 eV and are observable at room\ntemperature.\nA two-dimensional strain field uij (x, y ) leads to a gauge field [23,24]\n\nβ ⎛ u xx − u yy ⎞\n\n⎜\n⎟\n(1)\na ⎜⎝ − 2u xy ⎟⎠\nwhere a is the lattice constant, β = −∂ ln t / ∂ ln a ≈ 2 , t the nearest-neighbour hopping parameter, and the xA =\n\naxis is chosen along a zigzag direction of the graphene lattice. In the following, we consider valley K, unless\n\n1\n\n\fstated otherwise. One can immediately see that BS can only be created by non-uniform shear strain. Indeed,\nfor dilation (isotropic strain), equation (1) leads to A = 0 and, for the uniform strain previously considered in\nrefs. [4-6], to A = const which also yields zero BS.\nUsing polar coordinates (r ,θ ) , equation (1) can be rewritten as\n\nAr =\n\nβ ⎡⎛ ∂ur\n\n⎤\nu 1 ∂uθ ⎞\n⎛ 1 ∂u r uθ ∂uθ ⎞\n− r −\n+ −\n⎜\n⎟ cos 3θ + ⎜ −\n⎟ sin 3θ ⎥,\n⎢\n∂r ⎠\na ⎣⎝ ∂r\nr r ∂θ ⎠\nr\n⎝ r ∂θ\n⎦\n\n(2)\n\nβ ⎡⎛ ∂uθ\n\n⎤\nu\n1 ∂u r ⎞\n⎛ 1 ∂uθ u r ∂u r ⎞\n+ θ −\n+ −\nAθ = ⎢⎜ −\n⎟ cos 3θ + ⎜\n⎟ sin 3θ ⎥\n∂r ⎠\na ⎣⎝ ∂r\nr r ∂θ ⎠\nr\n⎝ r ∂θ\n⎦\nwhich yields the pseudo-magnetic field\n\nBS =\n\n∂Ay\n∂x\n\n−\n\n∂Ax 1 ∂Ar ∂Aθ Aθ\n=\n−\n−\n∂y r ∂θ\n∂r\nr\n\n(3).\n\nIn the radial representation, it is easy to show that uniform BS is achieved for the following displacements:\nu r = cr 2 sin 3θ , uθ = cr 2 cos 3θ\n(4)\nwhere c is a constant. The strain described by (4) and its crystallographic alignment are shown in Figures 1a\nand 1b, respectively. This yields uniform BS = 8βc / a (given in units h / e ≡ 1 ). For a disk of diameter D,\nwhich experiences a maximum strain Δm at its perimeter, we find c = Δ m / D . Assuming achievable Δm =\n\n10% and D = 100 nm, we find BS ≈ 40T, the effective magnetic length l B =\n\naD\n≈4 nm and the largest\n8β Δ m\n\nLandau gap of ≈0.25 eV. Note that distortions (4) are purely shear and do not result in any changes in the\narea of a unit cell, which means that there is no effective electrostatic potential generated by such strain [23].\n\na\n\nc\n\nb\n[001]\n\nd\n\n[010]\n\n[100]\n\nFigure 1. Designed strain can generate a strictly uniform pseudo-magnetic field in graphene. (a) Distortion\nof a graphene disc which is required to generate uniform BS. The original shape is shown in blue. (b)\nOrientation of the graphene crystal lattice with respect to the strain. Graphene is stretched or compressed\nalong three equivalent crystallographic directions <100>. Two graphene sublattices are shown in red and\ngreen. (c) Distribution of the forces applied at disk's perimeter (arrows), which would create the strain\nrequired in (a). The uniform colour inside the disk indicates strictly uniform pseudo-magnetic field. (d) The\nshown shape allows uniform BS to be generated only by normal forces applied at the sample's perimeter. The\nlength of arrows indicates the required local stress.\nThe lattice distortions in Fig. 1a can be induced by in-plane forces F applied only at the perimeter and, for\nthe case of a disc, they are given simply by\n\n2\n\n\fFx (θ ) = 4cμ sin (2θ ),\n\nFy (θ ) = 4cμ cos(2θ )\n\n(5)\n\nwhere μ is the shear modulus. Fig. 1c shows the required force pattern. It is difficult to create such strain\nexperimentally because this involves tangential forces and both stretching and compression. To this end, we\nhave solved an inverse problem to find out whether uniform BS can be generated by normal forces only.\nThere exists a unique solution for the shape of a graphene sample, which allows this and is plotted in Fig. 1d\n(see Supplementary Information, part I).\nA strong pseudo-magnetic field should lead to Landau quantization and a QHE-like state. The latter is\ndifferent from the standard QHE because BS has opposite signs for charge carriers in valleys K and K' and,\ntherefore, generates edges states that circulate in opposite directions. The co-existence of gaps in the bulk\nand counter-propagating states at the boundaries without breaking the time-reversal symmetry is reminiscent\nof the topological insulators [15-20] and, in particular, the quantum valley Hall effect in \"gapped graphene\"\n[20] and the quantum spin Hall effect induced by strain [16]. The latter theory has exploited the influence of\nthree-dimensional strain on spin-orbit coupling in semiconductor heterostructures, which can lead to quasiLandau quantization with opposite BS acting on two spins rather than valleys. Weak spin-orbit coupling\nallows only tiny Landau gaps <1 μeV [16] which, to be observable, would require temperatures below 10\nmK and carrier mobilities higher than 107 cm2/Vs. Our approach exploits the unique strength of pseudospinorbit coupling in graphene, which leads to δE > 0.1 eV and makes the strain-induced Landau levels\nrealistically observable.\nThe two cases described above prove that by using strain it is possible to generate a strong uniform BS and\nobserve the pseudo-QHE. They also provide the general concept that if the strain is applied along all three\n<100> crystallographic directions to match graphene's symmetry, this prevents the generated fields from\nchanging sign. Experimentally, it is a difficult task to generate such a complex distribution of forces as\nshown in Fig. 1. Below we develop the above concept further and show that the pseudo-QHE can be\nobserved in geometries that are easier to realize, even though they do not provide a perfectly uniform BS.\nLet us consider a regular hexagon with side length L and normal stresses applied evenly at its three nonadjacent sides and along <100> axes (Fig. 2a). Our numerical solution for this elasticity problem shows that\nBS has a predominant direction (positive for K and negative for K') and is rather uniform close to the\nhexagon's centre. Assuming L = 100 nm and Δm = 10%, we find for Fig. 2a that BS varies between ±22 T but\nis ≈20 T over most of the hexagon's central area. For other L and Δ, one can rescale the plotted values of BS\nby using expression BS ∝ Δ m / L . We have also examined other geometries (Supplementary Information)\nand always found a nearly uniform distribution of BS near samples' centre.\nTo verify that the non-uniform BS in Fig. 2a leads to well-defined Landau quantization, we have calculated\nthe resulting density of states D(E). This analysis necessitates tight-binding calculations that were carried out\nfor a graphene hexagon with zigzag edges (see Supplementary Information). Our computational power has\nlimited the size of the studied hexagons to L ≈30 nm. Fig. 2b plots our results for Δm =1% (BS ≈7T at the\nhexagon centre) and compares them for the case of the same hexagon in B = 0 and 10T but without strain. In\nthe absence of strain or B, the peak at zero E is due to the states localized at zigzag edges [2]. One can also\nsee that both non-uniform BS and uniform B generate Landau levels and the quality of the induced\nquantization is rather similar. The zero-E peak in Fig. 2b is dominated by zigzag states in all three cases\nwhereas the other levels are slightly broadened by non-uniform BS. The influence of the inhomogeneity in BS\non the zero level should, in general, be minimal because magnetic field inhomogeneity does not lead to\nbroadening of this level [25]. We emphasize that the presence of a significant density of states between\npseudo-Landau levels in Fig. 2b is mostly due to small L used in our numerical calculations. For micrometer\nhexagons, the corresponding gaps (even when averaged over the whole sample) should be well resolved if\nonly slightly smeared by non-uniform BS.\n\n3\n\n\fFigure 2. Stretching graphene along <100> axes generates a pseudo-magnetic field that is rather uniform at\nthe centre. (a) Distribution of BS for a regular hexagon stretched by its three sides oriented perpendicular to\n<100>. Other examples are given in Supplementary Information. (b) Normalized density of states for the\nhexagon in (a) with L = 30 nm and Δm = 1%. The black curve is for the case of no strain and no magnetic\nfield. The peak at zero E is due to states at zigzag edges. The blue curve shows the Landau quantization\ninduced by magnetic field B = 10 T. The pseudo-magnetic field with BS ≈ 7 T near the hexagon's centre\ninduces the quantization shown by the red curve. A comparison between the curves shows that the finite\ndensity of states between the pseudo-Landau levels is due to the small sample size in the tight-binding\ncalculations.\nIn order to create the required strain experimentally, one can generally think of exploiting the difference in\nthermal expansion of graphene and a substrate [11] and apply temperature gradients along <100> axes. For\nthe case of quasi-uniform BS, there are many more options available, including the use of suspended samples\nand profiled substrates. For example, a graphene hexagon can be suspended by three metallic contacts\nattached to its sides, similar to the technique used to study suspended graphene [26,27], and the strain can\nthen be controlled by gate voltage. Alternatively, a quasi-uniform BS can be created by depositing graphene\nover triangular trenches (Supplementary Information).\nTo probe the pseudo-Landau quantization, one can employ optical techniques, for example, Raman\nspectroscopy that should reveal extra resonances induced by BS [28]. One can also use transport\nmeasurements in both standard and Corbino-disk geometries. In the former case, the counter-propagating\nedge states imply that contributions from two valleys cancel each other and no Hall signal is generated\n(ρxy=0) [15-20]. At the same time, the edge transport can lead to longitudinal resistivity ρxx = h/4e2N where\nN is the number of spin-degenerate Landau level at the Fermi energy. This non-zero quantized ρxx has the\nsame origin as in so-called dissipative QHE where two edge states with opposite spins propagate in opposite\ndirections [29]. In spin-based topological insulators, the edge transport is protected by slow spin flip rates\n[15,16,29]. In our case, atomic-scale disorder at the edges is likely to mix the counter-circulating states on a\nsubmicron scale (Supplementary Information). Therefore, instead of quantization in ρxx we may expect\nhighly-resistive metallic edge states, similar to the case discussed in ref. [29]. The suppression of the edgestate ballistic transport does not affect the pseudo-Landau quantization in graphene's interior, where\nintervalley scattering is very weak [13,30] and should not case any extra level broadening. Highly-resistive\nedges should in fact make it easier to probe pseudo-Landau gaps in the bulk. In the Corbino geometry, the\nedge-state mixing is irrelevant, and we expect two-probe ρxx to be a periodic function of gate voltage and\nshow an insulating behaviour between pseudo-Landau levels. Furthermore, the outer contact can be used to\ncover perimeter regions with non-uniform BS (such as in Fig. 2) which should improve the quality of\nquantization.\n\n4\n\n\fFigure 3. Energy gaps can be opened in strained graphene superlattices. (a) Strain with triangular symmetry\ncan be created by depositing graphene on profiled surfaces. The corrugations shown in (a) result in the\ndistribution of pseudo-magnetic field plotted in (b). BS varies between ±0.5T (red to violet) with the\nperiodicity twice shorter than in (a). (c) Low energy bands induced by the periodic strain. The bands are\nsymmetric with respect to zero E.\nFinally, we point out that the developed concept can be employed to create gaps in bulk graphene. Imagine a\nmacroscopic graphene sheet deposited on top of a corrugated surface with a triangular landscape (Fig. 3a). In\nthe following calculations, we have fixed the graphene sheet at the landscape's extrema and allowed the\nresulting in-plane displacements to relax [21,22] (at the nanoscale, graphene should then be kept in place by\nvan der Waals forces). The resulting pseudo-magnetic superlattice is plotted in Fig. 3b whereas Fig. 3c\nshows the resulting energy spectrum. Close to zero E, there is a continuous band of electronic states, in\nagreement with the fact that zero level is insensitive to field's inhomogeneity [25]. At higher E, there are\nmultiple gaps with δE >100 K. The relatively small gaps are due to the weak shear strain induced in this\ngeometry (Δm <0.1%). By improving the design of strained superlattices, it must be possible to achieve much\nlarger gaps. We believe that the suggested strategies to observe the pseudo-Landau gaps and QHE are\ncompletely attainable and will be realized sooner rather than later.\n\nAcknowledgements\nThis work was supported by the EPSRC (UK), the Royal Society, Office of Naval Research and Air Force Office of\nScientific Research.\nAuthor contributions\nAll authors contributed extensively to the work presented in this paper.\n\n5\n\n\f1. Geim, A. K. & Novoselov, K. S. The rise of graphene. Nature Mater. 6, 183-191 (2007).\n2. Castro Neto, A. H., Guinea, F., Peres, N. M. R., Novoselov, K. S., Geim, A. K. The electronic properties of graphene.\nRev. Mod. Phys. 81, 109-162 (2009).\n3. Novoselov, K. S. et al. Room temperature quantum Hall effect in graphene. Science 315, 1379 (2007).\n4. Pereira, V. M., Castro Neto, A. H. & Peres, N. M. R. Tight-binding approach to uniaxial strain in graphene. Phys.\nRev. B 80, 045401 (2009).\n5. Ni, Z., Yu, T., Lu, Y. H., Wang, Y. Y., Feng, Y. P., Shen, Z. X. Uniaxial Strain on Graphene: Raman Spectroscopy\nStudy and Band-Gap Opening. ACS Nano 3, 483 (2009).\n6. Farjam, M. & Rafii-Tabar, H. Comment on \"Band structure engineering of graphene by strain: First-principles\ncalculations\". arXiv:0903.1702.\n7. Mohiuddin, T. M. G. et al. Uniaxial strain in graphene by Raman spectroscopy: G peak splitting, Gruneisen\nparameters and sample orientation. Phys. Rev. B 79, 205433 (2009).\n8. Huang, M., et al. Raman spectroscopy of graphene under uniaxial stress: Phonon softening and determination of the\ncrystallographic orientation. Proc. Natl. Acad. Sci. USA 106, 7304 –7308.\n9. Lee, C., Wei, X., Kysar, J., Hone J. Measurement of the elastic properties and intrinsic strength of monolayer\ngraphene, Science 321, 385-388 (2008).\n10. Kim, K. S. et al. Large-scale pattern growth of graphene films for stretchable transparent electrodes. Nature 457,\n706-710 (2009).\n11. Bao, W. et al. Ripple texturing of suspended graphene atomic membranes. arXiv:0903.0414.\n12. Sasaki, K., Kawazoe, Y. & Saito, R. Local energy gap in deformed carbon nanotubes. Prog. Theor. Phys. 113, 463\n(2005).\n13. Morozov, S. V. et al. Strong suppression of weak localization in graphene. Phys. Rev. Lett. 97, 016801 (2006).\n14. Morpurgo, A. F., Guinea, F. Intervalley scattering, long-range disorder, and effective time-reversal-symmetry\nbreaking in graphene. Phys. Rev. Lett. 97, 196804 (2006).\n15. Kane, C. L. & Mele, E.J. Quantum spin Hall effect in graphene. Phys. Rev. Lett. 95, 226801 (2005).\n16. Bernevig, B. A. & Zhang, S. C., Quantum spin Hall effect. Phys. Rev. Lett. 96, 106802 (2006).\n17. Moore, J. E. & Balents, L. Topological invariants of time-reversal-invariant band structures. Phys. Rev. B 75,\n121306 (2007).\n18. Qi, X.-L., Hughes, T. L. & Zhang, S.-C. Topological field theory of time-reversal invariant insulators. Phys. Rev. B\n78, 195424 (2008).\n19. Martin, I., Blanter, Ya. M., Morpurgo, A. F. Topological confinement in bilayer graphene, Phys. Rev. Lett. 100,\n036804 (2008).\n20. Semenoff, G. V., Semenoff, V., Zhou, F., Domain walls in gapped graphene, Phys. Rev. Lett. 101, 087204 (2008).\n21. Guinea, F., Horovitz, B., Le Doussal, P. Gauge field induced by ripples in graphene. Phys. Rev. B 77, 205421\n(2008).\n22. Wehling, T. O., Balatsky, A. V., Tsvelik, A. M., Katsnelson, M. I., Lichtenstein, A. I. Midgap states in corrugated\ngraphene: Ab initio calculations and effective field theory. Europhys. Lett. 84, 17003 (2008).\n23. Suzuura, H. & Ando, T. Phonons and electron-phonon scattering in carbon nanotubes. Phys. Rev. B 65, 235412\n(2002).\n24. Mañes, J. L. Symmetry based approach to electron-phonon interactions in graphene. Phys. Rev. B 76, 045430\n(2007).\n25. Giesbers A. J., Zeitler U., Katsnelson M. I., Ponomarenko L. A., Mohiuddin T. M., Maan J. C. Quantum-Hall\nActivation Gaps in Graphene. Phys. Rev. Lett. 99, 206833 (2007).\n26. Bolotin, K. I., et al. Ultrahigh electron mobility in suspended graphene. Solid State Commun. 146, 351-355 (2008).\n27. Xu, D., Skachko, I., Barker, A., Andrei, E. Y. Approaching ballistic transport in suspended graphene. Nature Nano\n3, 491-495 (2008).\n28. García-Flores, A. F., Terashita, H., Granado, E., Kopelevich, Y. Landau levels in bulk graphite by Raman\nspectroscopy. Phys. Rev. B 79, 113105 (2009).\n29. Abanin, D. A., Novoselov, K. S., Zeitler, U., Lee, P. A., Geim, A. K. & Levitov, L. S. Dissipative quantum Hall\neffect in graphene near the Dirac point. Phys. Rev. Lett. 98, 196806 (2007).\n30. Tikhonenko, F. V., Horsell, D. W., Gorbachev, R. V., Savchenko, A. K. Weak localization in graphene flakes. Phys.\nRev. Lett. 100, 056802 (2008).\n\n6\n\n\fSUPPLEMENTARY INFORMATION:\nEnergy gaps and zero-field quantum Hall effect in graphene by strain engineering\nF. Guinea, M. I. Katsnelson, A. K. Geim\nI. Let us explain first how the two dimensional elasticity theory was used to find the shape shown in Fig. 1d\nof the main text.\nThe distribution of stress σ in a two dimensional case is known to be independent of material's Poisson ratio\n[S1]. The distortions that determine the gauge field are proportional to σ and given by\n\nu xx − u yy =\n\nσ xx − σ yy\nσ xy\n,\n, u xy =\n2μ\n2μ\n\n(S1)\n\nwhere μ is the shear modulus. Its value for graphene is ≈ 10 eV/Ǻ2 (see ref. [S2]).\nAccording to equations (1) and (3) of the main text and after choosing a coordinate system such that the xaxis coincides with one of the zigzag directions, we find that the uniformity of pseudo-magnetic field\nrequires the following stress distribution\n\nσ xx = −σ yy = Cy\n\n(S2)\n\nσ xy = Cx\n\nwhere C is a constant.\nLet us find a boundary at which this stress distribution creates only normal forces. We will use polar\ncoordinates in which the boundary is described as r = r (θ ) with the normal vector n x (θ ),n y (θ ) . Then, the\n\n(\n\n)\n\ncondition that the forces are strictly normal to the boundary reads\n\nσ xx nx + σ xy n y = f (θ )nx\n\n(S3).\n\nσ xy nx + σ yy n y = f (θ )n y\nThis means that the stress tensor at this boundary has the following structure\n\n⎛\n⎝\n\n1\n2\n\n⎞\n⎠\n\nσ ij = 2 f (θ )⎜ ni n j − δ ij ⎟\n\n(S4).\n\nThis equation has a solution if\n\n(σ xx − f )(σ yy − f ) − σ xy 2 = 0\n\nor, substituting our sigma's, it can be re-written as f (θ ) = ±Cr (θ ) .\nThen,\n\nn x ± r + y ± 1+ sin θ\nn\ndy\nand, at the same time, x = − . Coming back to the polar coordinates,\n=\n=\nny\ndx\nny\nx\ncos θ\n\nwe find the following equation for the required shape\n\nd ln r sin θ m cos 2θ\n.\n=\ndθ\ncosθ ± sin 2θ\n\n(S5).\n\nIts solution\n\nr (θ ) =\n\nconst\n[(cosθ / 2 m sin θ / 2)(± 1 + 2 sin θ )]2 / 3\n\n(S6)\n\nis plotted in Fig. 1d. The required distribution of normal forces is given by F (θ ) ∝ ± r (θ ) where sign ±\nindicates that uniform BS can be achieved by both compression and stretching.\nII. To calculate the distribution of pseudo-magnetic field BS, which is shown in Fig. 2a, we have solved the\ncorresponding elasticity problems numerically.\nr\nThe stress distribution σ ij (r ) induced inside the hexagon in Fig. 2a is caused by forces F applied at the\nperimeter in the direction normal to the edge. They are either zero or constant for different hexagon sides.\n\n7\n\n\fr\n\nr\n\nThe stress distribution can be written as σ ij (r ) = Fsij (r L ) where L is the length of the hexagon side. Using\n\nr\n\nequation (S1) we can then find the strain distribution in graphene. To calculate sij (u ) , we have used a\n\ntriangular mesh with 35 nodes along each side of the hexagon and the central forces acting between the\nnearest neighbour nodes. This has yielded BS plotted in Fig. 2a. Another example of pseudo-magnetic field in\na strained graphene sample is shown below (Fig. S1).\nThe electronic states inside the hexagon in Fig. 2b were calculated by using a honeycomb lattice with the\nsame periodicity as the triangular lattice used to obtain the induced strain in Fig. 2a. In order to make these\ncalculations applicable to hexagons with sides larger than 35 graphene lattice constants a, we have exploited\nthe scaling properties of the low energy eigenstates of the Dirac equation in effective gauge field A. The\neigenenergies ε i in a lattice of length L = N × a described by hopping parameters tij = t + Δtij are related\nto those in a lattice with L′ = N ′ × a and hopping parameters tij′ = t ′ + Δtij′ by ε i′ = ε i × N N ′ provided that\n\ntij′ = t × N N ′ + Δtij × N ′ N . This scaling relationship ensures that the Fermi velocity and the flux\ndistribution remain the same within the two lattices. The equivalence between the two systems is valid only\nfor ε i′ << t ′ and Δtij′ << t ′ . These constraints have limited the maximum size that could be studied in our\nwork to about L′ ≈ 10 × N × a and maximum strain to Δ ≈ β Δt ij′ t ′ ≈ 0.01 .\n\nFigure S1. Distribution of BS inside a graphene disk stretched along the <100> axes indicated by the red\narrows. The colour scheme is the same as in Fig. 2a. The white (blank) areas correspond to divergences in\nthe induced strain and BS because the forces are applied locally, at three points along the perimeter. In the\nreal situation, these divergences would correspond to high values of BS, which depend on detailed\ndistribution of stress at the sample boundary.\nIII. An interesting alternative to generate the pseudo-magnetic field is to apply a constant pressure P to\ngraphene suspended over an aperture with designed geometry. In this case, BS can be calculated as follows.\nThe distribution of in-plane u(x,y) and out-of-plane h(x,y) deformations can be found numerically by\nminimization of the free energy [S3]\n\nF=\n\nκ\n\ndxdy (∇ h )\n2∫\n2\n\n2\n\n+\n\n(\n\n)\n\n1\ndxdy 2 μ uij2 + λ uii2 − P ∫ dxdy h\n∫\n2\n\n(S6),\n\nwhere κ , λ , μ are the bending rigidity and the two in-plane elastic constants, respectively, and\n\n1 ⎛ ∂u ∂u j ∂h ∂h ⎞⎟\n+\nuij = ⎜ i +\n2 ⎜⎝ ∂x j ∂xi ∂xi ∂x j ⎟⎠\n\n8\n\n(S7)\n\n\fis the deformation tensor. If out-of-plane displacements are larger than the length scale given by κ / μ ,\nwhich is of the order of the interatomic distance a, we can generally neglect the first term in equation (S6)\n[S1].\nAssuming that a graphene membrane covers an aperture of a characteristic size L, the out-of-plane\ndeformations can be represented as\n1/ 3\n\n⎛ PL ⎞\n⎟⎟\nh( x, y ) = L⎜⎜\n⎝ μ ⎠\n\n⎛x y ⎞\nH ⎜ , ,ν ⎟\n⎝L L ⎠\n\n(S8)\n\nwhere H is the dimensionless function that depends on the membrane's geometry, and ν the Poisson ratio.\nFollowing refs. [S4-S6], we find that equation (S8) leads to the pseudo-magnetic field\n\nΦ ⎛ PL ⎞\n⎟\nB S ( x, y ) = β 0 ⎜⎜\naL ⎝ μ ⎟⎠\n\n2/3\n\n⎛x y ⎞\nB ⎜ , ,ν ⎟\n⎝L L ⎠\n\n(S9)\n\nwhere Φ 0 = πhc / e is the flux quantum and, to avoid a bulky expression, we introduce another\ndimensionless function B that relates to H .\n\na\nb\nFigure S2. Deformation and pseudo-magnetic field induced in graphene suspended over a triangular\naperture. (a) Height profile H according to equation (S8). (b) Pseudo-magnetic field B for the deformation\nshown in a. The spatial scale for both plots is given in units L.\nWe have calculated H ( x, y ) and B ( x, y ) numerically for the case of an equilateral triangular aperture with\nthe sides normal to the <100> axes of the graphene membrane. Our results in Figure S2 demonstrate that the\npseudo-magnetic field is nearly uniform inside the hole, yielding B of about 0.3. Assuming L = 100 nm and\n\nP = 100 atm, we find BS ≈4 T. The induced strain can be estimated as (PL / μ ) and, at this pressure,\nreaches only a few percent, that is, even higher BS can be achieved at higher P. Note that the pressure on a\nsuspended membrane can also be induced by electric field [S6]. In terms of charge density n, this pressure is\n2/3\n\ngiven by P = 2π (ne ) , and P =100 atm corresponds to n ≈ 8x1012 cm-2.\n2\n\nIV. To calculate H and B in Figure S2, we have employed the elastic lattice model described previously in\n\nr\n\n(\n\nsection II. We have taken a triangular lattice with nodes {m, n} placed at positions rmn = m + n / 2, 3n / 2\n\n)\n\nr\nwhere m,n are integers. For each node, we assume displacement u mn . The elastic energy of the lattice is the\nsum of energies over all the springs connecting nearest neighbour nodes, which are given by\n\n9\n\n\fK r r r\n( rkl + ukl − rmn − urmn − 1)2 where K is related to the elastic constants as λ = μ = 3 K [S7]. The\n2\n4\npinning of the graphene sheet to the scaffold at the perimeter nodes {o, p} is described by adding\nK pin r 2\nuop , and the constant pressure (force) is applied in z direction. The calculations were\nterm ε pin ,op =\n2\ndone for a membrane with 820 nodes (L = 40), K = 1 and K pin = 100 . The numerical results show that\n\nε kl ;mn =\n\nmax[H ( x, y )] ≈ 0.15 ± 0.03\n\nand\n\nthe\n\nfield\n\nvaries slowly inside\n\nthe\n\nhole,\n\nwith\n\nan\n\naverage\n\nB ( x, y ) ≈ 0.3 ± 0.03 . Note that the triangular-lattice model implies λ = μ and, therefore, ν = 1 / 3 . In\n\ngraphene, the Poisson ratio is ~0.15 [S2] but we do not expect that this discrepancy would result in\nsignificantly different values of H , B and BS.\nV. In the following, we estimate a mixing rate for counter-propagating valley-polarized edge states.\nIn the case of a singly-charged impurity, the matrix element that determines the backscattering is given by\nr\nk + e 2 r k − ≈ e 2 a (the wavefunctions are assumed to be extended along the edge channel). The density of\nstates is D(E ) ≈ v F l B , where l B is the width of the edge channel and v F the Fermi velocity. Then, the\nreflection coefficient R into another valley can be estimated in the Born approximation as\n\n(\n\nR ≈ e2 vF\n\n) (a l ) . The number of impurities per unit length is\n2\n\n2\n\nn1D ≈ nl B where n is the impurity\nl\nas\nthe\nchannel\nlength\n\nB\n\nconcentration.\n\nThe\n\ntransmission\n\ndecays\n\nwith\n\nT ≈ exp(− Rn1D l ) ≈ exp[−(e 2 v F ) na 2l l B ] . For graphene, e 2 v F ≈ 1 , and the mean free path in our one2\n\nchannel one-dimensional problem becomes of the same order of magnitude as the localization\nlength ξ ≈ l B na 2 . For typical Bs =10T ( l B ≈ 8 nm) and n ≈ 1011 cm −2 , we find ξ ≈ 10 2 − 10 3 μm.\nIn the case of edge roughness, it can be modeled by a succession of vacancies. We approximate each\nvacancy by a local potential with a strength comparable to the bandwidth of the π electrons, v F a . Using\n\n( )\n\nthe Born approximation, we find that the scattering matrix element is\n\n(\n\nR ≈ a l B , so that the mean free path is now ξ ≈ l B a\n2\n\n2\n\n2\n\n2\n\n)n\n\nk + v F a k − ≈ v F a and\n\n. The density of defects (vacancies) n1D\nis expected to be strongly sample dependent. In the worst case scenario of atomic-scale edge roughness,\nn1D ≈ 10 per nm and we still find ξ ≈ 10 2 − 103 nm . The reason for this is that the scattering is suppressed\n1D\n\nby the smallness of a l B . Note that edge roughness does not influence the strain-induced Landau\nquantization in graphene's interior.\nS1. Landau, L. D. & Lifshitz, E. M. Theory of Elasticity, Pergamon Press, Oxford (1959).\nS2. Zakharchenko, K. V., Katsnelson, M. I. & Fasolino, A. Finite temperature lattice properties of graphene\nbeyond the quasiharmonic approximation. Phys. Rev. Lett. 102, 046808 (2009).\nS3. Nelson, D., Piran, T. & Weinberg, S. (Editors) Statistical Mechanics of membranes and Surfaces, World\nScientific, Singapore, 2004.\nS4. Guinea, F., Horovitz, B., Le Doussal, P. Gauge field induced by ripples in graphene. Phys. Rev. B 77,\n205421 (2008).\nS5. Wehling, T. O., Balatsky, A. V., Tsvelik, A. M., Katsnelson, M. I., Lichtenstein, A. I. Midgap states in\ncorrugated graphene: Ab initio calculations and effective field theory. Europhys. Lett. 84, 17003 (2008).\nS6. Fogler, M., Guinea, F. & Katsnelson, M. I. Pseudomagnetic fields and ballistic transport in a suspended\ngraphene sheet. Phys. Rev. Lett. 101, 226804 (2008).\nS7. Seung, H. S., & Nelson, D. R., Defects in flexible membranes with crystalline order, Phys. Rev. A 38,\n1005 (1988).\n\n10\n\n\f"}