{"id": "http://arxiv.org/abs/1012.3144v3", "guidislink": true, "updated": "2011-01-21T16:52:17Z", "updated_parsed": [2011, 1, 21, 16, 52, 17, 4, 21, 0], "published": "2010-12-14T19:40:58Z", "published_parsed": [2010, 12, 14, 19, 40, 58, 1, 348, 0], "title": "Effective Gravitational Wave Stress-energy Tensor in Alternative\n  Theories of Gravity", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1012.3100%2C1012.0165%2C1012.3161%2C1012.3404%2C1012.0691%2C1012.3448%2C1012.2851%2C1012.0180%2C1012.1565%2C1012.5603%2C1012.3268%2C1012.4579%2C1012.3392%2C1012.3324%2C1012.3247%2C1012.2122%2C1012.2805%2C1012.3393%2C1012.2762%2C1012.2587%2C1012.3421%2C1012.1775%2C1012.2653%2C1012.2447%2C1012.3058%2C1012.2011%2C1012.4446%2C1012.3073%2C1012.3756%2C1012.1421%2C1012.4091%2C1012.2929%2C1012.5457%2C1012.4222%2C1012.3144%2C1012.1228%2C1012.1552%2C1012.1540%2C1012.2042%2C1012.2799%2C1012.1044%2C1012.3966%2C1012.3511%2C1012.3150%2C1012.2726%2C1012.5432%2C1012.1822%2C1012.5030%2C1012.5532%2C1012.3352%2C1012.0805%2C1012.2193%2C1012.3914%2C1012.5220%2C1012.3665%2C1012.2354%2C1012.4820%2C1012.3945%2C1012.0911%2C1012.5560%2C1012.4316%2C1012.2389%2C1012.3680%2C1012.3735%2C1012.5574%2C1012.3333%2C1012.6008%2C1012.6012%2C1012.1384%2C1012.0123%2C1012.2689%2C1012.2003%2C1012.1656%2C1012.0405%2C1012.1398%2C1012.1909%2C1012.0641%2C1012.0471%2C1012.4402%2C1012.2266%2C1012.0148%2C1012.3839%2C1012.5238%2C1012.0341%2C1012.4250%2C1012.2615%2C1012.5901%2C1012.2411%2C1012.5752%2C1012.4912%2C1012.3270%2C1012.1063%2C1012.3135%2C1012.5398%2C1012.5063%2C1012.5236%2C1012.1134%2C1012.5961%2C1012.1219%2C1012.3990%2C1012.0539&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Effective Gravitational Wave Stress-energy Tensor in Alternative\n  Theories of Gravity"}, "summary": "The inspiral of binary systems in vacuum is controlled by the stress-energy\nof gravitational radiation and any other propagating degrees of freedom. For\ngravitational waves, the dominant contribution is characterized by an effective\nstress-energy tensor at future null infinity. We employ perturbation theory and\nthe short-wavelength approximation to compute this stress-energy tensor in a\nwide class of alternative theories. We find that this tensor is generally a\nmodification of that first computed by Isaacson, where the corrections can\ndominate over the general relativistic term. In a wide class of theories,\nhowever, these corrections identically vanish at asymptotically flat, future,\nnull infinity, reducing the stress-energy tensor to Isaacson's. We exemplify\nthis phenomenon by first considering dynamical Chern-Simons modified gravity,\nwhich corrects the action via a scalar field and the contraction of the Riemann\ntensor and its dual. We then consider a wide class of theories with dynamical\nscalar fields coupled to higher-order curvature invariants, and show that the\ngravitational wave stress-energy tensor still reduces to Isaacson's. The\ncalculations presented in this paper are crucial to perform systematic tests of\nsuch modified gravity theories through the orbital decay of binary pulsars or\nthrough gravitational wave observations.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1012.3100%2C1012.0165%2C1012.3161%2C1012.3404%2C1012.0691%2C1012.3448%2C1012.2851%2C1012.0180%2C1012.1565%2C1012.5603%2C1012.3268%2C1012.4579%2C1012.3392%2C1012.3324%2C1012.3247%2C1012.2122%2C1012.2805%2C1012.3393%2C1012.2762%2C1012.2587%2C1012.3421%2C1012.1775%2C1012.2653%2C1012.2447%2C1012.3058%2C1012.2011%2C1012.4446%2C1012.3073%2C1012.3756%2C1012.1421%2C1012.4091%2C1012.2929%2C1012.5457%2C1012.4222%2C1012.3144%2C1012.1228%2C1012.1552%2C1012.1540%2C1012.2042%2C1012.2799%2C1012.1044%2C1012.3966%2C1012.3511%2C1012.3150%2C1012.2726%2C1012.5432%2C1012.1822%2C1012.5030%2C1012.5532%2C1012.3352%2C1012.0805%2C1012.2193%2C1012.3914%2C1012.5220%2C1012.3665%2C1012.2354%2C1012.4820%2C1012.3945%2C1012.0911%2C1012.5560%2C1012.4316%2C1012.2389%2C1012.3680%2C1012.3735%2C1012.5574%2C1012.3333%2C1012.6008%2C1012.6012%2C1012.1384%2C1012.0123%2C1012.2689%2C1012.2003%2C1012.1656%2C1012.0405%2C1012.1398%2C1012.1909%2C1012.0641%2C1012.0471%2C1012.4402%2C1012.2266%2C1012.0148%2C1012.3839%2C1012.5238%2C1012.0341%2C1012.4250%2C1012.2615%2C1012.5901%2C1012.2411%2C1012.5752%2C1012.4912%2C1012.3270%2C1012.1063%2C1012.3135%2C1012.5398%2C1012.5063%2C1012.5236%2C1012.1134%2C1012.5961%2C1012.1219%2C1012.3990%2C1012.0539&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The inspiral of binary systems in vacuum is controlled by the stress-energy\nof gravitational radiation and any other propagating degrees of freedom. For\ngravitational waves, the dominant contribution is characterized by an effective\nstress-energy tensor at future null infinity. We employ perturbation theory and\nthe short-wavelength approximation to compute this stress-energy tensor in a\nwide class of alternative theories. We find that this tensor is generally a\nmodification of that first computed by Isaacson, where the corrections can\ndominate over the general relativistic term. In a wide class of theories,\nhowever, these corrections identically vanish at asymptotically flat, future,\nnull infinity, reducing the stress-energy tensor to Isaacson's. We exemplify\nthis phenomenon by first considering dynamical Chern-Simons modified gravity,\nwhich corrects the action via a scalar field and the contraction of the Riemann\ntensor and its dual. We then consider a wide class of theories with dynamical\nscalar fields coupled to higher-order curvature invariants, and show that the\ngravitational wave stress-energy tensor still reduces to Isaacson's. The\ncalculations presented in this paper are crucial to perform systematic tests of\nsuch modified gravity theories through the orbital decay of binary pulsars or\nthrough gravitational wave observations."}, "authors": ["Leo C. Stein", "Nicolas Yunes"], "author_detail": {"name": "Nicolas Yunes"}, "author": "Nicolas Yunes", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevD.83.064038", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1012.3144v3", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1012.3144v3", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "19 pages. v3: Clarified averaging properties and gauge choice.\n  Version accepted to PRD", "arxiv_primary_category": {"term": "gr-qc", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "gr-qc", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "astro-ph.CO", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "hep-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "hep-th", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1012.3144v3", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1012.3144v3", "journal_reference": "Phys.Rev.D83:064038,2011", "doi": "10.1103/PhysRevD.83.064038", "fulltext": "Effective Gravitational Wave Stress-energy Tensor in Alternative Theories of Gravity\nLeo C. Stein and Nicolás Yunes\n\narXiv:1012.3144v3 [gr-qc] 21 Jan 2011\n\nDepartment of Physics and MIT Kavli Institute,\n77 Massachusetts Avenue, Cambridge, MA 02139\n(Dated: October 23, 2018)\nThe inspiral of binary systems in vacuum is controlled by the stress-energy of gravitational radiation and any other propagating degrees of freedom. For gravitational waves, the dominant\ncontribution is characterized by an effective stress-energy tensor at future null infinity. We employ\nperturbation theory and the short-wavelength approximation to compute this stress-energy tensor\nin a wide class of alternative theories. We find that this tensor is generally a modification of that\nfirst computed by Isaacson, where the corrections can dominate over the general relativistic term. In\na wide class of theories, however, these corrections identically vanish at asymptotically flat, future,\nnull infinity, reducing the stress-energy tensor to Isaacson's. We exemplify this phenomenon by\nfirst considering dynamical Chern-Simons modified gravity, which corrects the action via a scalar\nfield and the contraction of the Riemann tensor and its dual. We then consider a wide class of\ntheories with dynamical scalar fields coupled to higher-order curvature invariants, and show that\nthe gravitational wave stress-energy tensor still reduces to Isaacson's. The calculations presented\nin this paper are crucial to perform systematic tests of such modified gravity theories through the\norbital decay of binary pulsars or through gravitational wave observations.\nPACS numbers: 04.30.-w, 04.50.Kd, 04.25.Nx, 04.20.Fy\n\nI.\n\nINTRODUCTION\n\nFeynman has argued that no matter how beautiful or\nelegant a certain theory is, or how authoritative its proponents, if it does not agree with experiments, then it\nmust be wrong. For the past 40 years, this philosophy has\nbeen applied to gravitational theories with great success.\nMany modified gravity theories that were prominent in\nthe 1970's, have now been essentially discarded, as they\nwere found to disagree with Solar System experiments\nor binary pulsar observations [1]. Similarly, this decade\nis beginning to bring a wealth of astrophysical information that will be used to constrain new modified gravity\ntheories. In fact, precision double binary pulsar observations [2–4] have already allowed us to constrain modified\ntheories to exciting new levels [5, 6]. Future gravitational wave (GW) observations on Earth, with the Advanced Laser Interferometer Gravitational Observatory\n(aLIGO) [7–9], aVIRGO [10] and its collaborators, and in\nspace, through the Laser Interferometer Space Antenna\n(LISA) [11–14], will allow new precision tests of strong\nfield gravity [15].\nSuch tests of alternative theories of gravity will be very\nsensitive to the motion of compact bodies in a regime\nof spacetime where gravitational fields and velocities are\nlarge, i.e. the so-called strong-field. Gralla [16] has shown\nthat motion in classical field theories that satisfy certain\nconditions (the existence of a Bianchi-like identity and\nfield equations no higher than second-order) is \"universally\" geodesic to leading-order in the binary system's\nmass-ratio, with possible deviations from geodesicity due\nto the bodies' internal structure. He also argues that one\nmight be able to relax the second condition, as it does not\nseem necessary. In fact, motion in certain higher-order\ntheories, such as Chern-Simons modified gravity [17], is\n\nalready known to be purely geodesic to leading-order in\nthe mass-ratio, without influence of internal structure\ndue to additional symmetries in the theory.\nTests of modified gravity theories in the strong-field,\nhowever, not only require a prescription for the conservative sector of motion, but also of the dissipative sector,\nthat which describes how the objects inspiral. Geodesic\nmotion must thus be naturally corrected by a radiationreaction force that drives non-geodesic motion toward an\nultimate plunge and merger [18]. Similarly, one can think\nof such motion as geodesic, but with varying orbital elements [19–23] (energy, angular momentum and Carter\nconstant). The rate of change of such orbital elements\nis governed by the rate at which all degrees of freedom\n(gravitational and non-gravitational) radiate.\nIn the gravitational sector and to leading order in the\nmetric perturbation, such a rate of change is controlled\nby an effective stress-energy tensor for GWs, first computed by Isaacson in General Relativity (GR) [24, 25]. In\nhis approach, Isaacson expanded the Einstein equations\nto second order in the metric perturbation about an arbitrary background. The first-order equations describe the\nevolution of gravitational radiation. The second-order\nequation serves as a source to the zeroth-order field equations, just like a stress-energy tensor, and it depends on\nthe square of the first-order perturbation. This tensor\ncan then be averaged over several gravitational wavelengths, assuming the background length scale is much\nlonger than the GW wavelength (the short-wavelength\napproximation). In this approximation, Isaacson found\nthat the effective GW energy-momentum tensor is proportional to the square of first partial derivatives of the\nmetric perturbation, i.e. proportional to the square of\nthe gravitational frequency. Components of this stressenergy then provide the rate of change of orbital elements, leading to the well-known quadrupole formula.\n\n\f2\nAlternative theories of gravity generically lead to a\nmodified effective GW stress-energy tensor. It is sometimes assumed that this stress-energy tensor will take the\nsame form as in GR [26, 27], but this need not be the case.\nIn GR, the scaling of this tensor with the GW frequency\nsquared can be traced to the Einstein-Hilbert action's\ndependence on second-derivatives of the metric perturbation through the Ricci scalar. If the action is modified\nthrough the introduction of higher-powers of the curvature tensor, then the stress-energy tensor will be proportional to higher powers of the frequency. Therefore,\nthe consistent calculation of the modified Isaacson tensor needs to be carried out until terms similar to the GR\ncontribution (proportional to frequency squared) are obtained. This in turn implies that calculations of effective\nenergy-momentum tensors in modified gravity theories\nto leading-order in the GW frequency can sometimes be\ninsufficient for determining the rate of change of orbital\nelements.\nIn this paper, we present a formalism to compute the\nenergy-momentum tensor consistently in generic classical field theories. We employ a scheme where the action itself is first expanded in the metric perturbation\nto second order, and the background metric and metric\nperturbation are treated as independent fields. Varying\nwith respect to the background metric leads to an effective GW stress-energy tensor that can then be averaged\nover several wavelengths. This produces results equivalent to Isaacson's calculation.\nWe exemplify this formulation by first considering CS\ngravity [17]. This theory modifies the Einstein-Hilbert\naction through the addition of the product of a scalar field\nwith the contraction of the Riemann tensor and its dual.\nThis scalar field is also given dynamics through a kinetic\nterm in the action. The leading-order contribution to the\nCS-modified GW stress-energy tensor should appear at\norder frequency to the fourth-power, but Sopuerta and\nYunes [28] have shown that this contribution vanishes at\nfuture null infinity.\nWe here continue this calculation through order frequency cubed and frequency squared and find that such\nCS modifications still vanish at future null infinity. This\nis because the background scalar field must decay at a\ncertain rate for it to have a finite amount of energy in\nan asymptotically-flat spacetime. If one insists on ignoring such a requirement, such as in the case of the\nnon-dynamical theory, then frequency-cubed CS modifications to the energy-momentum do not vanish.\nWe explicitly calculate such modifications for a canonical embedding, where the scalar field is a linear function\nof time in inertial coordinates. This is similar to previous work [29] that calculated another effective stressenergy tensor for the non-dynamical version of ChernSimons. In this case, the dominant modification to the\nradiation-reaction force is in the rate of change of radiated momentum, which leads to so-called recoil velocities after binary coalescence. In GR, such recoil is proportional to the product of the (mass) quadrupole and\n\noctopole when multipolarly decomposing the radiation\nfield. In non-dynamical CS gravity with a canonical embedding, the recoil is proportional to the square of the\nmass quadrupole, which dominates over the GR term.\nWe then construct a wide class of alternative theories\nthat differ from GR through higher order curvature terms\nin the action coupled to a scalar field. We compute the\nGW stress-energy-momentum tensor in such theories and\nfind that corrections to the Isaacson tensor vanish at future null infinity provided the following conditions are\nsatisfied: (i) the curvature invariants in the modification\nare quadratic or higher order; (ii) the non-minimally coupled scalar field is dynamical; (iii) the modification may\nbe modeled as a weak deformation away from GR; (iv)\nthe spacetime is asymptotically flat at future null infinity. These results prove that the effective stress-energy\ntensor assumed in [26, 27] is indeed correct1 .\nEven if the effective GW energy-momentum tensor is\nidentical to that in GR, in terms of contractions of first\nderivatives of the metric perturbation, this does not imply that GWs will not be modified. First, background\nsolutions could be modified. For example, in dynamical\nCS gravity, the Kerr metric is not a solution to the modified field equations for a rotating black hole (BH) [30],\nbut it is instead modified in the shift sector [31]. Second,\nthe solution to the GW evolution equation could also\nbe modified. For example, in non-dynamical CS gravity, GWs become amplitude birefringent as they propagate [32–34]. Third, additional degrees of freedom may\nalso be present and radiate, thus changing the orbital\nevolution. All of these facts imply that even if the Isaacson tensor correctly describes the effective GW energymomentum tensor, GWs themselves can and generically\nwill be modified in such alternative theories.\nIn the remainder of this paper we use the following\nconventions. Background quantities are always denoted\nwith an overhead bar, while perturbed quantities of firstorder with an overhead tilde. We employ decompositions\nof the type gμν = ḡμν + ǫ h̃μν + O(ǫ2 ), where gμν is\nthe full metric, ḡμν is the background metric and h̃μν\nis a small perturbation (ǫ ≪ 1 is a book-keeping parameter). Covariant differentiation with respect to the\n ̄ B , while covariant\nbackground metric is denoted via ∇\nμ ν\ndifferentiation with respect to the full metric is denoted\nvia ∇μ Bν . Symmetrization and antisymmetrization are\ndenoted with parentheses and square brackets around the\nindices respectively, such as A(μν) ≡ [Aμν + Aνμ ]/2 and\nA[μν] ≡ [Aμν − Aνμ ]/2. We use the metric signature\n(−, +, +, +) and geometric units, such that G = c = 1.\nThis paper is organized as follows: Section II describes\nthe perturbed Lagrangian approach used in this paper\nto compute the effective GW stress-energy tensor. Sec-\n\n1\n\nThe authors of [26, 27] presented an energy loss formula which\nwas not evaluated at I + . In the limit of r → ∞, their energy\nloss formula reduces to the Isaacson formula.\n\n\f3\ntion III applies this framework to GR. Section IV discusses dynamical CS gravity. Section V computes the full\neffective stress-energy tensor in this theory. Section VI\ngeneralizes the calculation to a wider class of alternative\ntheories. Section VII concludes and points to future research.\nII.\n\nPERTURBED LAGRANGIAN APPROACH\n\nIsaacson [24, 25] introduced what is now the standard technique to obtain an effective stress-energy tensor\nfor gravitational radiation, via second-order perturbation\ntheory on the equations of motion. This technique requires an averaging procedure to construct an effective\nstress-energy tensor. This is because of the inability to\nlocalize the energy of the gravitational field to less than\nseveral wavelengths of the radiation, and because of the\nambiguities of the metric perturbation on distances of order the wavelength due to gauge freedom2 . Isaacson employed the Brill-Hartle [37] averaging scheme, although\none can arrive at an identical quantity by using different\nschemes [38–40], e.g. Whitham or macroscopic gravity.\nAn alternative approach to derive field equations and\nan effective stress-energy tensor for GWs is to work at the\nlevel of the action. One possibility is to use the Palatini\nframework [41, 42], where the connection is promoted to\nan independent field that is varied in the action, together\nwith the metric tensor. Such a framework, however is\nproblematic in alternative theories of gravity, as it need\nnot lead to the same field equations as variation of the\naction with respect to the metric tensor only.\nA similar but more appropriate approach is that of\nsecond-variation [43]. In this approach, the action is first\nexpanded to second order in the metric perturbation, assuming the connection is the Christoffel one Γσμν . Then,\nthe action is promoted to an effective one, by treating the\nbackground metric tensor and the metric perturbation as\nindependent fields. Variation of this effective action with\nrespect to the metric perturbation and the background\nmetric yields the equations of motion. The former variation leads to the first-order field equations, when the\nbackground field equations are imposed. The latter variation leads to the background field equations to zeroth\norder in the metric perturbation and to an effective GW\nstress-energy tensor to second order.\nLet us begin by expanding all quantities in a power\nseries about a background solution\nφ = φ̄ + ǫφ̃ + ǫ2 φ̃ ̃ + O(ǫ3 ) ,\n\n(1)\n\nwhere ǫ ≪ 1 is an order counting parameter and φ represents all tensor fields of the theory with indices suppressed: φ̄ is the background field, φ̃ is the first-order\n\n2\n\nGauge freedom in perturbation theory stands for the freedom\nto identify points between the physical and \"background\" manifolds [35, 36].\n\nperturbation to φ, and φ̃ ̃ is the second-order perturbation. The action can then be expanded, as\n ̃ + O(ǫ3 ) , (2)\nS[φ] = S (0) [φ̄] + S (1) [φ̄, φ̃] + S (2) [φ̄, φ̃, φ̃]\nwhere S (1) is linear in φ̃ and S (2) is quadratic in φ̃ but\n ̃ We now define the effective action as Eq. (2)\nlinear in φ̃.\nbut promoting φ̄ and φ̃ to independent fields.\nOne might wonder why the field φ̃ ̃ is not also treated\nas independent. First, variation of the action with respect to φ̃ ̃ would lead to second-order equations of motion, which we are not interested in here. Second, the\nvariation of the action with respect to φ̃ cannot intro ̃ because the product of\nduce terms that depend on φ̃,\nφ̃ and φ̃ ̃ never appears in Eq. (2), as this would be of\nO(ǫ3 ). Third, the variation of the action with respect\n ̃ which vanish\nto φ̄ can only introduce terms linear in φ̃,\nupon averaging, as we describe in Sec. II A. This is because averages of any odd number of short-wavelength\nquantities generically vanish. Therefore, we can safely\nneglect all terms that depend on φ̃ ̃ in the effective action, which renders Eq. (2) a functional of only φ̄ and\nφ̃.\nAs in the standard approach, the second-order variation method still requires that one performs a shortwavelength average of the effective stress-energy tensor.\nUpon averaging, the variation of the first-order piece of\nthe action S (1) with respect to φ̄ vanishes because it generates terms linear in φ̃. Since S (1) does not contribute\nto the effective stress-energy tensor, we can safely drop\nit from the effective action for now.\nThe effective action reduces to\nS eff [φ̄, φ̃] = S eff(0) [φ̄] + S eff(2) [φ̄, φ̃] .\n\n(3)\n\nNaturally, the variation of S eff(0) with respect to the background metric ḡμν yields the background equations of\nmotion. The effective stress-energy tensor comes from\naveraging the variation of S eff(2) with respect to ḡμν ,\nδS\n\neff(2)\n\n=ǫ\n\n2\n\nZ\n\n√\nd4 x −ḡ δḡμν tμν ,\n\neff\nTμν\n≡ −2ǫ2 hhtμν ii ,\n\n(4a)\n(4b)\n\nwhere the factor of 2 is conventional for agreement with\nthe canonical stress-energy tensor, and hh ii is the averaging operator, which we discuss below. One of the\nimmediate benefits of working from an action principle\ncomes from the diffeomorphism invariance of the action.\nThe diffeomorphism invariance immediately implies that\nthe variation of the total action with respect to the metric is divergence free [42]. When the matter stress-energy\ntensor is itself divergence free, then the gravity sector –\nthe sum of the stress-energy of non-minimally coupled\ndegrees of freedom and the effective stress-energy tensor\nof gravitational waves – will also be divergence free.\n\n\f4\nA.\n\nShort-wavelength averaging\n\nThe goal of the averaging scheme is to distinguish radiative quantities, those which are rapidly-varying functions of spacetime, from Coulomb-like quantities, those\nwhich are slowly-varying functions. This is accomplished\nby defining the operator hh ii as a linear integral operator.\nThis operator may either be an average over the phase of\nthe rapidly varying quantities or over spacetime. If the\nintegral is over spacetime, there is an averaging kernel\nwith characteristic length scale Lave that separates the\nforeground short-wavelength λGW from the background\nlength scale Lbg , that is, λGW ≪ Lave ≪ Lbg .\nThe details of the averaging scheme are not as important as their properties [38–40], since one arrives at\nequivalent results using different schemes. The most useful properties of hh ii are:\n1. The average of a product of an odd number of\nshort-wavelength quantities vanishes.\n2. The average of a derivative of a tensor vanishes, e.g.\nfor some tensor expression T μ αβ , hh∇μ T μ αβ ii = 0.\n3. As a corollary to the above, integration by parts can\nbe performed, e.g. for tensor expressions Rμ α , Sβ ,\nhhRμ α ∇μ Sβ ii = −hhSβ ∇μ Rμ α ii.\nLet us briefly mention where some of these properties come from and some caveats. When considering\nmonochromatic functions, an odd oscillatory integral has\nan average value about zero, while an even oscillatory integral has a non-zero average. This is enough to find that\nthat averages of expressions linear in a short-wavelength\nquantity will vanish. Expressions at third (and higher\nodd) order would vanish for monochromatic radiation,\nbut not in general. However, these are at sufficiently\nhigh order that we neglect them.\nThe vanishing of averages of derivatives is a subtle\npoint. In the spacetime average approach, this is found\nby integrating by parts, leaving a term with a derivative\non the averaging kernel. This term is smaller than nonvanishing averages by a factor of O(λGW /Lave ) and depends on the averaging kernel. From physical grounds,\nthe choice of averaging kernel should not affect any physical quantities, so the average should in fact vanish identically. From the action standpoint, the average of a\nderivative can be seen to arise from an action term which\nis a total divergence. Since total divergences in the action do not affect the equations of motion, the average of\na derivative vanishes.\nA similar argument holds for integration by parts. In\nthe Brill-Hartle average scheme, integration by parts incurs an error of order O(λGW /Lave ) from a derivative\nof the averaging kernel. From the action standpoint,\nthough, integration by parts at the level of the action\nincurs no error, since there is no averaging kernel in the\naction.\nThe fact that the variation of S (1) with respect to φ̄\ndoes not contribute to the effective stress-energy tensor is\n\na direct consequence of property (1) above. The vanishing of all terms linear in φ̃ ̃ upon averaging is also a consequence of (1). As one can see, these properties greatly\nsimplify all further calculations.\nB.\n\nVarying Christoffel and curvature tensors\n\nLet us now consider what types of terms arise from\nthe variation of the effective action with respect to ḡμν .\nIn order to perform this variation properly, any implicit\ndependence of the action on ḡμν must be explicitly revealed; for example, terms which contain the trace h̃ must\nbe rewritten as ḡμν h̃μν . Indices should appear in their\n\"natural\" positions (see Sec. II D), for indices raised and\nlowered with the metric have implicit dependence on it.\nFurthermore, since we are approaching gravity from the\nmetric formulation, rather than the Palatini formulation,\nthere will be contributions from the variation of ∇μ and\ncurvature tensors.\nConsider a term in the effective action such as\nZ\n√\nex.1\nS\n= d4 x −ḡ T γ***δ*** ∇μ S α*** β*** ,\n(5)\nwhere g is the determinant of the metric and\nT γ***δ*** , S α*** β*** are some tensor expressions, with all indices contracted in some fashion, as the action must\nbe a scalar. When such a term is varied with ḡμν\n√ →\nḡμν +δḡμν , besides the obvious contributions from δ −ḡ,\nand explicit dependence of T γ***δ*** , S α*** β*** on ḡμν , there\nare also contributions from varying the Christoffel connection Γλμβ in ∇μ . The general expression is\nδ(∇μ S α1 ***αn β1 ***βm ) = ∇μ (δS α1 ***αn β1 ***βm )+\nm\nn\nX\nX\nαi ***λ***\nδ Γ̄λμβj S α1 ***αn ***λ*** , (6)\nδ Γ̄μλ S\n+\nβ1 ***βm −\ni=1\n\nj=1\n\nwhere * * * λ * * * in the ith term of a sum means replacing\nαi or βi in the index list with λ; and where\ni\n1h\nσ\nδ Γ̄σμν = − ḡλμ ∇ν δḡλσ + ḡλν ∇μ δḡλσ − ḡμα ḡνβ ∇ δḡαβ .\n2\n(7)\nCurvature tensors also depend on derivatives of the\nconnection, so one naturally expects terms of the form\n∇ρ ∇σ δḡμν from the variation of curvature quantities,\ni.e. the Riemann tensor Rμ ναβ , Ricci tensor Rμν , or Ricci\nscalar R. For example, one can show that\nδ R̄μ ναβ = 2∇[α δ Γ̄μβ]ν ,\n\n(8)\n\nwhere the contribution from Γ ∧ Γ cancels [42]. Upon\nintegration by parts any scalar in the action that contains curvature tensors, one can convert a term containing ∇ρ ∇σ δḡμν into\nZ\n√\nex.2\n(9)\nδS\n= d4 x −ḡ P σ μν ∇σ δḡμν .\n\n\f5\nIn fact, many terms in the variation of the action can be\nwritten in the form of Eq. (9).\nThe contribution of Eq. (9) to the effective stressenergy tensor is found by integrating by parts and then\naveraging, according to Eq. (4). Upon averaging, however, one finds that such terms do not contribute to the\neffective stress-energy tensor because\neff,ex.2\nTμν\n= 2hh∇σ P σ μν ii ,\n\n(10)\n\nvanishes according to property (2) in Sec. II A.\nThe above arguments and results imply that the variations of curvature tensors and connection coefficients\nwith respect to ḡμν do not contribute to the effective\nstress-energy tensor. Only metric tensors which are raising, lowering, and contracting indices in the action contribute to this tensor. We can thus concentrate on these,\neff\nwhen computing Tμν\n.\nC.\n\nContributions at asymptotic infinity\n\nWhen calculating the radiation-reaction force to leading order in the metric perturbation, it is crucial to\naccount for all the energy-momentum loss in the system. The first contribution is straightforward: energymomentum is radiated outward, toward future, null infinity, I + . Since the stress-energy tensor is covariantly\nconserved, the energy-momentum radiated to I + can be\ncalculated by performing a surface integral over a twosphere at future, null infinity3 .\nHowever, not all energy-momentum loss escapes to\ninfinity, as energy can also be lost due to the presence of trapped surfaces in the interior of the spacetime.\nTrapped surfaces can effectively absorb GW energymomentum, which must also be accounted for, e.g. in\nthe calculation of EMRI orbits around supermassive\nBHs [44, 45]. Calculations of such energy-momentum\nloss at the BH horizon are dramatically more complicated than those at I + and we do not consider them\nhere.\nWhat is the relative importance of energy-momentum\nlost to I + and that lost into trapped surfaces? To answer this question, we can concentrate on the magnitude\nof the leading-order energy flux, as the argument trivially\nextends to momentum. The post-Newtonian (PN) approximation [46], which assumes weak-gravitational fields\nand slow velocities, predicts that the energy flux carried\nout to I + is proportional to v 10 to leading-order in v,\nwhere v is the orbital velocity of a binary system in a\nquasi-circular orbit (see e.g. [46]). On the other hand, a\ncombination of the PN approximation and BH perturbation theory predicts that, to leading-order in v, the energy flux carried into trapped surfaces is proportional to\n\n3\n\nWe will not consider spacetimes which are not asymptotically\nflat, e.g. de Sitter space; the calculations are more involved in\nsuch spacetimes.\n\nv 15 for spinning BHs and v 18 for non-spinning BHs [47].\nBH GW flux absorption is then clearly smaller than the\nGW flux carried out to I + if v < 1, which is true for\nEMRIs for which the PN approximation holds.\nIntuitively, this hierarchy in the magnitude of energymomentum flux lost by BH binaries can be understood\nby considering the BH as a geometric absorber in the\nradiation field. Radiation which is longer in wavelength\nthan the size of the BH is very weakly absorbed. Only\nat the end of an inspiral will the orbital frequency be\nhigh enough that GWs will be significantly absorbed by\nthe horizon. Notice that this argument is independent\nof the particular theory considered, only relying on the\nexistence of trapped surfaces. This result does not imply\nthat BH absorption should be neglected in EMRI modeling, but just that it is a smaller effect than the flux\ncarried out to infinity [44, 45].\nIn the remainder of the paper, we will only address\nenergy-momentum radiated to I + and relegate any analysis of radiation lost into trapped surface to future work.\nThe only terms which can contribute to an energymomentum flux integral on a 2-sphere at I + are those\nwhich decay as r−2 , since the area element of the sphere\ngrows as r2 . No terms may decay more slowly than r−2 ,\nas the flux must be finite, i.e. the effective stress-energy\ncannot scale as r−1 , as a constant or with positive powers of radius. Similarly, any terms decaying faster than\nr−2 do not contribute, as they would vanish at I + . Of\ncourse, to determine which terms contribute and which\ndo not, one must know the leading asymptotic forms of\nall quantities in the effective stress-energy tensor.\nIn GR, as we shall see in Sec. III, the only fields appearing in the effective stress-energy tensor are the background metric ḡμν and derivatives of the metric perturbation h̃μν . As one approaches I + , ḡμν ∼ ημν in Cartesian\ncoordinates, while |h̃μν | ∼ r−1 ∼ |∇ρ h̃μν |. Curvature\ntensors scale as |Rμνδσ | ∼ r−3 , since they quantify tidal\nforces. For a theory that is a deformation away from\nGR, and far away from regions of strong curvature, these\nasymptotic forms cannot change.\nConsider now terms in the general effective action at\norder O(ǫ2 ) that contain background curvature tensors.\nDue to their ordering, they would contribute to the effective stress-energy. One such term is\n\nS ex.3 = ǫ2\n\nZ\n\n√\nρ\nd4 x −ḡ ∇ρ φ̃σ1 ∇α φ̃β2 R βσκ ḡακ ,\n\n(11)\n\nwhere φ̃1 , φ̃2 are the first-order perturbations to two\nfields in the theory (e.g. the metric perturbation h̃μν\nand the CS scalar perturbation θ̃ that we introduce in\nSec. V). Since there is no contribution to the effective\nstress-energy tensor from the variation of curvature quantities (see Sec. II B), the only contributions to the effec-\n\n\f6\ntive stress-energy comes from\n\u0013\n\u001c\u001c\u0012\n1\nακ\nα\nκ\neff,ex.3\n2\n− ḡμν ḡ + δ (μ δ ν) *\nTμν\n= −2ǫ\n2\nEE\nρ\n, (12)\n* ∇ρ φ̃σ1 ∇α φ̃β2 R βσκ\n| {z } | {z } | {z }\nr −1\n\nr −1\n\nr −3\n\nwhich has the same functional form as the integral. Note\nthat the curvature tensor always remains when varying\nwith respect to ḡμν .\nCombining this result with the asymptotic arguments\nabove, such terms can be ignored as one approaches I + .\nEach of the first-order fields possess a radiative part that\nscales as r−1 . The square of the first-order fields would\nthen satisfy the r−2 scaling requirement for the flux integral. The curvature tensor, however, scales as r−3 , which\nimplies that the term in Eq. (12) vanishes at I + .\nWe then conclude that terms in the action that contain\nbackground curvature quantities at O(ǫ2 ) may be ignored\nin calculating the effective stress-energy tensor at I + .\nAs an immediate corollary to this simplification, we may\nalso freely commute background covariant derivatives if\nwe are interested in the stress-energy tensor at infinity\nonly, since the commutator is proportional to background\ncurvature tensors.\n\nIf we delayed imposing the Lorenz gauge condition until after the calculation of the effective stress-energy tensor, we would find the same effective tensor as if we had\nimposed the gauge condition at the level of the action.\nHaving said that, one should not impose the gauge condiμν\nαβ\ntion when varying with respect to h̃ as clearly ∇α h̃\nmust also be varied.\nIII.\n\nEFFECTIVE STRESS-ENERGY IN GR\n\nLet us now demonstrate the principles described in the\nprevious section by deriving the standard Isaacson stressenergy tensor in GR. Consider the Einstein-Hilbert action,\nZ\n√\nSGR = κ d4 x −g R,\n(16)\nwhere κ = (16πG)−1 . Now perturb to second order to\nform the effective action,\neff(0)\n\neff\nSGR\n= SGR\n\neff(0)\n\nSGR\nD.\n\nImposing gauge in the effective action\n\neff(2)\n\nSGR\n\nWe will choose as our dynamical field not h̃μν but\nμν\nrather h̃ , where the underline stands for the tracereverse operation, and we take the \"natural\" position\nof the indices to be contravariant. The resulting stressenergy tensor is equal to the one calculated using h̃μν\nafter evaluating both of them on-shell, i.e. imposing the\nequations of motion.\nWe also impose a gauge condition to simplify future\nexpressions: the Lorenz gauge condition,\n∇μ h̃\n\nμν\n\n= 0.\n\n(13)\n\nTypically one may not impose a gauge condition at the\nlevel of the action. However, in our case, the gauge condition in Eq. (13) has the important property of having all\nof the indices in their natural positions: the contraction\nof the indices does not involve the metric.\nConsider a term in the effective action that contains\nthis divergence,\nZ\n√\nαβ\nex.4\n2\nS\n=ǫ\nd4 x −ḡ Tβ ∇α h̃ ,\n(14)\nwith Tβ some tensor expression at first order in ǫ. The\nα index that is contracted above does not require the\nαβ\nmetric for such contraction. Therefore, ∇α h̃\nalways\nremains upon variation,\n\u001c\u001c\u0012\n\u001d\u001d\n\u0013\n1\nδTβ\nαβ\neff,ex.4\n− ḡμν Tβ + μν ∇α h̃\n.\nTμν\n= −2ǫ2\n2\nδḡ\n(15)\n\neff(2)\n\n+ SGR ,\n\n(17a)\n\nZ\n\n√\nd4 x −ḡ R̄,\nZ\n,1\n,2\n= ǫ2 κ d4 x Leff\n+ Leff\n,\nGR\nGR\n=κ\n\n(17b)\n(17c)\n\nwhere\n,1\nLeff\nGR =\n\nand\n\n\u0011\n\u0010 α βμ\nαβ\n1√ h\n−ḡ 4R̄αβ 2h̃ μ h̃ − h̃ h̃\n8\n\u0010 2\n\u0011i\nαβ\n+R̄ h̃ − 2h̃αβ h̃\n, (17d)\n\n\u0014\nαβ\nμ\n1\nμ\nL\n= −ḡ −h̃ ∇α ∇μ h̃ β − (∇μ h̃)(∇ h̃)−\n8\nμ\nνα\nμν\nαβ\nμ\n1\n(∇μ h̃ α )(∇ν h̃ ) + (∇ν h̃)(∇μ h̃ ) − h̃ ∇μ ∇α h̃ β\n2\n1\nμν\nαβ\n ̄ h̃αβ − 1 h̃\u0003\n ̄ h̃\n+ h̃∇μ ∇ν h̃ + h̃ \u0003\n2\n4\n\u0015\n3\n1\nν μα\nμ αβ\n− (∇μ h̃να )(∇ h̃ ) + (∇μ h̃αβ )(∇ h̃ ) , (17e)\n2\n4\neff,2\nGR\n\n√\n\nand (R̄μν , R̄) refer to the background Ricci tensor and\nscalar respectively. The integrands have been written\nμν\nin terms of the trace-reversed metric perturbation, h̃ .\n,1\n+\nFrom Sec. II C, Leff\nbecause\nGR does not contribute at I\nit depends explicitly on curvature quantities, so we ignore\n,2\nit. The variation and averaging of Leff\nproduces the\nGR\nIsaacson stress-energy tensor.\nBy integrating by parts, all terms in Eq. (17e) can\nρσ\n\nκλ\n\nbe written as (∇α h̃ )(∇β h̃ ) (with indices contracted\nρσ\n\nto form a scalar) rather than h̃ ∇α ∇β h̃\n\nκλ\n\n(again, with\n\n\f7\n,2\nindices contracted). Leff\nis thus rewritten in the more\nGR\ncompact form\n\u0014\n√\nνα\nμ\n1\nLMT = −ḡ (∇μ h̃ )(∇ν h̃ α )−\n2\n\u0015\n1\n1\nμ αβ\nμ\n− (∇μ h̃αβ )(∇ h̃ ) + (∇μ h̃)(∇ h̃) , (18)\n4\n8\n\nwhich is the expression that appears in MacCallum and\nTaub [43]. With this simplified expression at hand, we\nμν\ncan promote h̃ to an independent dynamical field in\nμν\nEq. (17) and vary it with respect to both ḡμν and h̃\nto obtain the effective stress-energy tensor and the firstorder equations of motion respectively.\nLet us first derive the first-order equations of motion.\nμν\nVarying Eq. (17) with respect to h̃ , we find\n ̄ h̃μν − 2∇α ∇(μ h̃ν)α − 1 ḡμν \u0003\n ̄ h̃ = 0 ,\n\u0003\n2\n\n2∇α ∇β h̃\n\n ̄ h̃ = 0 .\n+\u0003\n\n(19b)\n\nWe can now impose the Lorenz gauge on Eq. (19b), which\n ̄ h̃ = 0. If h̃ = 0 is further imposed on an\nthen leads to \u0003\ninitial hypersurface while maintaining Lorenz gauge, then\nthe evolution equation preserves the trace-free gauge [41].\nThe combination of these two gauge choices (Lorenz\ngauge plus trace-free) is the transverse-tracefree gauge,\nor TT gauge.\nAfter commuting derivatives in Eq. (19a) and imposing\nTT gauge, the tensor equation of motion reads\n ̄ h̃μν + 2R̄μανβ h̃αβ = 0 ,\n\u0003\n\nIV.\n\nwhere\n\u001c\u001c\n\nαβ\n1\n1\nα\n∇μ h̃ ∇ν h̃αβ − ∇α h̃βμ ∇ h̃ν β\n4\n2\n1\n1\nα\n− ∇μ h̃∇ν h̃ + ∇α h̃μν ∇ h̃\n8\n4\n\u001d\u001d\n1\n−1/2\n,\n(20b)\nLMT\n+ ḡμν (−ḡ)\n2\n\nwhich we refer to as the MacCallum-Taub\ntensor. Terms\nμ\nthat depend on the trace h̃ μ in this tensor can be eliminated in TT gauge.\n\nCHERN-SIMONS GRAVITY\n\nCS gravity is a modified theory introduced first by\nJackiw and Pi [32] (for a recent review see [17]). The\ndynamical version of this theory modifies the EinsteinHilbert action through the addition of the following\nterms:\nS = SEH + SCS + Sθ + Smat ,\n\n(21)\n\nwhere\nSEH = κ\n\nZ\n\nZ\n\nd4 x\n\n√\n−g R ,\n\n√\nd4 x −g θ ∗R R ,\nZ\n√\nβ\nSθ = −\nd4 x −g gμν (∇μ θ) (∇ν θ) ,\n2\nZ\n√\nSmat = d4 x −g Lmat .\nSCS\n\n(19c)\n\nwhere R̄μανβ is the background Riemann tensor. At I + ,\n ̄ h̃μν = 0, which leads to the\nthis equation reduces to \u0003\nstandard dispersion relation for GWs, traveling at the\nspeed of light.\nLet us now calculate the effective stress-energy tensor.\nNote that the first term in LMT may be integrated by\nparts and covariant derivatives commuted to form the\nLorenz gauge condition, so the first term may be ignored.\nVarying the action with respect to ḡμν , we find\n\u001c\u001c\n\u001d\u001d\n1\n1 eff\nδ\n2\n√\nκGμν = −ǫ κ\n≡ TMT\nLMT\nμν , (20a)\nμν\n−ḡ δḡ\n2\neff\n2\nTMT\nμν = 2ǫ κ\n\nNotice that this expression is only valid at I + and in\nTT gauge. As mentioned earlier, this tensor cannot be\nused to model energy-momentum loss through trapped\nsurfaces, since then curvature quantities cannot be ignored.\n\n(19a)\n\nwhose trace is\nαβ\n\nLet us now evaluate the MacCallum-Taub tensor on shell, by imposing the equations of motion\n[Eq. (19)]. When short-wavelength averaging, derivatives that are contracted together can be converted into\nthe d'Alembertian via integration by parts; such terms\nvanish at I + . What results is the usual Isaacson stressenergy tensor,\nDD\u0010\n\u0011\u0010\n\u0011EE\nαβ\neff\n2κ\nTGR\n∇μ h̃\n∇ν h̃αβ\n.\n(20c)\nμν = ǫ\n2\n\nα\n=\n4\n\n(22)\n\nThe quantity κ = (16πG)−1 is the gravitational constant,\nwhile α and β are coupling constants that control the\nstrength of the CS coupling to the gravitational sector\nand its kinetic energy respectively. In the non-dynamical\nversion of the theory, β = 0 and there are no dynamics for\nthe scalar field, which is promoted to a prior-geometric\nquantity.\nThe quantity θ is the CS field, which couples to the\ngravitational sector via the parity-violating Pontryagin\ndensity, ∗R R, which is given by\n∗\n\nR R := Rαβγδ ∗Rαβγδ =\n\n1 αβμν\nε\nRαβγδ Rγδ μν ,\n2\n\n(23)\n\nwhere the asterisk denotes the dual tensor, which we construct using the antisymmetric Levi-Civita tensor εαβμν .\nThis scalar is a topological invariant, as it can be written\nas the divergence of a current\n\u0012\n\u0014\n\u0013\u0015\n1\n1 τ η\nμαβγ σ\n∗\nτ\nΓατ\n. (24)\nR R = 4∇μ ε\n∂β Γγσ + Γβη Γγσ\n2\n3\n\n\f8\nEquation (21) contains several terms that we describe\nbelow: the first one is the Einstein-Hilbert action; the\nsecond one is the CS coupling to the gravitational sector;\nthe third one is the CS kinetic term; and the fourth one\nstands for additional matter degrees of freedom. The\nCS kinetic term is precisely the one that distinguishes\nthe non-dynamical and the dynamical theory. In the former, the scalar field is a priori prescribed, while in the\ndynamical theory, the scalar field satisfies an evolution\nequation.\nThe field equations of this theory are obtained by varying the action with respect to all degrees of freedom:\n\u0011\n1 \u0010 mat\nα\n(θ)\n,\n(25a)\nTμν + Tμν\nGμν + Cμν =\nκ\n2κ\nα∗\nβ\u0003θ = − R R ,\n(25b)\n4\n(θ)\n\nmat\nwhere Tμν\nis the matter stress-energy tensor and Tμν is\nthe CS scalar stress-energy:\n\u0014\n\u0015\n1\n(θ)\nTμν\n= β (∇μ θ)(∇ν θ) − gμν (∇σ θ)(∇σ θ) . (26)\n2\n\nThe C-tensor C μν is given by\nC αβ = (∇σ θ) εσδν(α ∇ν Rβ) δ + (∇σ ∇δ θ) ∗Rδ(αβ)σ . (27)\nMany solutions to these field equations have been\nfound.\nIn their pioneering work, Jackiw and Pi\nshowed that the Scwharzschild metric is also a solution in CS gravity [32]. Later on, a detailed analysis showed that all spherically symmetric spaces, such\nas the Friedman-Robertson-Walker metric, are also solutions [30]. Axially-symmetric spaces, however, are\nnot necessarily solutions, because the Pontryagin density does not vanish in this case, sourcing a non-trivial\nscalar field. Specifically, this implies the Kerr metric is\nnot a solution.\nA slowly-rotating solution, however, does exist in dynamical CS gravity. Yunes and Pretorius [31] found that\nwhen the field equations are expanded in the Kerr parameter a/M ≪ 1 and in the small-coupling parameter\nζ ≡ ξ/M 4 = α2 /(βκM 4 ) ≪ 1, then the CS field equations have the solution\n\u0012\n\u0013\n12 M\n27 M 2\n5 Ma\nsin2 θdtdφ ,\n+\nds̄2 = ds2Kerr + ζ 4 1 +\n8 r\n7 r\n10 r2\n\u0012\n\u0013\n5 α a cos θ\n2M\n18M 2\nθ̄ =\n1+\n,\n(28)\n+\n8 β M r2\nr\n5r2\nto second order in a/M and to first order in ζ, assuming no matter sources. These equations employ BoyerLindquist coordinates (t, r, θ, φ) and ds2Kerr is the Kerr\nline element. The solution for θ may also include an\narbitrary additive constant, but this constant is unimportant, since only derivatives of θ enter the CS field\nequations. Recently, the same solution has been found\nto linear order in a/M in the Einstein-Cartan formulation of the non-dynamical theory [48].\n\nThe divergence of the field equations reduce to\nmat\n∇μ Tμν\n= 0. This is because the divergence of the Einstein tensor vanishes by the Bianchi identities. Meanwhile, the divergence of the C-tensor exactly cancels the\ndivergence of the CS scalar field stress-energy tensor,\nupon imposition of the equations of motion [Eq. (25b)].\nTherefore, test-particle motion in dynamical CS gravity\nis exactly geodesic4 . This result automatically implies\nthe weak-equivalence principle is satisfied.\nThe gravitational perturbation only possesses two independent, propagating degrees of freedom or polarizations. Jackiw and Pi showed that this was the case in\nthe non-dynamical theory [32], while Sopuerta and Yunes\ndid the same in the dynamical version [28]. One can also\nshow easily that a transverse and approximately traceless\ngauge exists in dynamical CS gravity. The trace of the\nfield equations take the interesting form\n\u0011\n1 \u0010 mat\n−R=\n(29)\nT\n+ T (θ) ,\n2κ\nwhere R is the Ricci scalar and T is the trace of the stressenergy tensor. Notice that the trace of the C-tensor vanishes identically.\nmat\nIn vacuum (Tμν\n= 0) and when expanding to linear\norder about a Minkowski background, Eq. (29) reduces\nto\n ̄ h̃ = β (∇σ θ̄)(∇σ θ̄) .\n\u0003\n2κ\n\n(30)\n\nwhere h̃ ≡ η μν hμν is the trace of the metric perturbation,\n ̄ is the d'Alembertian operator with respect to the back\u0003\nground metric and θ̄ is the background scalar field. Since\nthe latter must satisfy the evolution equation [Eq. (25b)],\nwe immediately see that θ ∝ α/β. This means that the\nright-hand side of Eq. (30) is proportional to ζ. To zeroth order in the small-coupling approximation, h̃ then\nsatisfies a free wave equation and can thus be treated as\nvanishing. Deviations from the trace-free condition can\nonly arise at O(ζ) and they are suppressed by factors of\nthe curvature tensor, as θ̄ must satisfy Eq. (25b). Approaching I + , the right hand side of Eq. (30) vanishes.\nThis allows one to impose TT gauge at future null infinity.\nV.\n\nEFFECTIVE STRESS-ENERGY IN CS\nGRAVITY\n\nThe perturbed Lagrangian for the Einstein-Hilbert action has already been calculated, so here we need only\nconsider the contribution from SCS . At O(ǫ2 ), there are\na large number of terms generated (we used the package\n\n4\n\nThis statement is true only in the absence of spins, since otherwise the CS effective worldline action would contain new selfinteraction terms.\n\n\f9\nxPert [49–53] to calculate the perturbations). Many of\nthese terms are irrelevant when considering their contribution at I + .\nLet us classify the types of terms that arise in SCS . At\nO(ǫ2 ), these are of two types:\n1. the second-order part of one field, or\n\n2. the product of first-order parts of two fields.\nAs mentioned in Sec. II A, terms containing the secondorder part of one field are linear in a short-wavelength\nquantity, which vanishes under averaging. Thus we only\nneed √\nto consider the latter case. There are five fields in\nSCS ( −g, ε, θ, \u0001R, and ∗R), so one would at first think\nthat there are 52 = 10 types of terms arising; however,\nfrom the definition of the Levi-Civita tensor, we have\n√\n−g εαβμν = sign(g) [αβμν] ,\n(31)\nwhere [αβμν] is the Levi-Civita symbol,\nwhich is not a\n√\nspacetime field. The combination −g εαβμν therefore\nhas no perturbation, and there are only three spacetime\n\u0001\nfields which contribute. We are left with only 32 = 3\npossibilities for the types of terms that could appear, corresponding to two perturbed fields and one unperturbed\none among the set (θ, Rαβσδ , Rαβσδ ). Two of these possibilities are actually the same by exchanging the two\ncopies of Rαβσδ .\nTherefore, we are left with only the following two types\nof terms in the CS Lagrangian density:\n√\nLθ̃R̃ ∼ −ḡ ε̄αβμν θ̃ R̃γ δαβ R̄δ γμν\n(32a)\n√\nδ\nαβμν\nγ\nLR̃R̃ ∼ −ḡ ε̄\n(32b)\nθ̄ R̃ δαβ R̃ γμν\n\nwhere R̃γ δαβ is the first-order perturbation to the Rieμν\nmann tensor, in terms of h̃ . Variation of these terms\nwith respect to the background metric yields the CS contributions to the effective stress-energy tensor, while variation with respect to the metric perturbation yields CS\ncorrections to the first order equations of motion.\nA.\n\nVariation with respect to the Perturbation\n\nJust as in GR, the final expression for the stress-energy\ntensor must be put on-shell by imposing the equations of\nmotion. The first-order equations of motion of dynamical\nCS gravity, in vacuum and at I + , are\nαh\n(θ)\n ̄ h̃μν = − 1 T̃μν\n ̄ h̃γ(μ ε̄αβγ ν)\n\u0003\n+\n∇α θ̄ ∇β \u0003\nκ\nκ\n\u0010\n\u0011i\nβγ\nδ\nβ\n+∇α ∇β θ̄ ε̄α γδ(μ ∇ ∇ν) h̃ − ∇ h̃ν) γ . (33)\n\nImposing these equations of motion is easier when taking advantage of the weak-coupling limit, ζGW ≪ 1, where\nζGW ≡ α∇θ/(κλGW ) quantifies the size of the deformation away from GR. Let us then expand the metric perturbation in a Taylor series\nh̃μν =\n\n∞\nX\n\n(n)\n\n(ζGW )n h̃μν .\n\nn=0\n\n(34)\n\nTo zeroth-order, it is clear that Eq. (33) reduces to\n ̄ h̃(0)\n\u0003\nμν = 0, which is the standard GR equation of motion. To next order, the the leading-order piece of the\nright-hand side vanishes and one is then left with\n\u0010\n\u0011\n ̄ h̃(1) = α ∇α ∇β θ̄ ε̄α γδ(μ ∇δ ∇ν) h̃βγ − ∇β h̃ γ\n\u0003\nμν\n(0)\nν) (0)\nκ\n1 (θ)\n− T̃μν\n.\n(35)\nκ\nIn the remainder of this section, we drop the superscripts\nthat indicate ζGW -ordering.\nB.\n\nVariation with respect to the Background\n\nLet us first discuss terms of type Lθ̃R̃ under variation\nwith respect to ḡμν . From Sec. II B, only total derivative\nterms arise from δ R̄γ δαβ , and these vanish upon averaging. The remaining terms contain R̄γ δαβ , which must\nvanish at I + . Thus, as mentioned before, terms in the\neffective action which contain curvature tensors do not\ncontribute to the effective stress-energy tensor at I + .\nWe are then only left with LR̃R̃ . Writing these in terms\nμν\nof h̃ , the effective action reads\nZ\neff(2)\n2α\n,1\n,2\nSCS = ǫ\nd4 x Leff\n+ Leff\n,\n(36)\nCS\nCS\n4\nwhere\n√\nρ\n,1\nLeff\n= + −ḡ ε̄αβγδ θ̄ ∇ ∇β h̃α σ ∇δ ∇ρ h̃σγ , (37a)\nCS\n√\nρ\n,2\nLeff\n= − −ḡ ε̄αβγδ θ̄ ∇β ∇ρ h̃α σ ∇σ ∇δ h̃ γ . (37b)\nCS\nNaively, one might think that these expressions lead to\nan effective stress-energy tensor at O(λ−4\n). This is preGW\nmature, however, as there can be a cancellation of λ−4\nGW terms that lead to a less steep wavelength dependence.\nOne should try to move as many derivatives away from\nthe perturbed quantities as possible before proceeding.\nIn fact, we know that this must be possible from [32]:\nthe Pontryagin density can be written as the divergence\nof a 4-current, so at least one derivative can be moved off\nμν\nof h̃ . This automatically implies that there cannot be\nλ−4\nterms in the effective stress-energy tensor, as shown\nGW\nexplicitly by Yunes and Sopuerta [28].\n,1\nLet us transform Leff\nin the following way. The LeviCS\nCivita tensor is contracted onto two derivative operators\n(∇β and ∇δ ). One may integrate by parts to move one\nof these derivative operators onto the remaining terms\nin Eq. (37a). This generates two types of terms: one\nwith three derivatives acting on the metric perturbation\nand one with one derivative on the CS scalar (the term\nacting on the Levi-Civita tensor or the determinant of\nthe metric vanishes by metric compatibility). Let us focus on the former first. Because of the contraction onto\nthe Levi-Civita tensor, only the antisymmetric part of\nthe second derivative operator would contribute. Such a\ncombination is nothing but the commutator of covariant\n\n\f10\nderivatives, which can be written as the Riemann tensor,\nand thus vanishes at I + . The remaining term with a\ncovariant derivative of the CS scalar does not generically\nvanish. Dropping terms proportional to the Riemann\n,1\ntensor, Leff\nbecomes\nCS\n√\nρ\n,1\nLeff\n= −ḡε̄αβγδ ∇α θ̄ ∇ h̃β σ ∇δ ∇ρ h̃σγ .\n(38a)\nCS\nEquation (37b) can be analyzed with the property discussed in Sec. II D: Lorenz gauge may be imposed at\nthe level of the action for the purposes of calculating the\neffective stress-energy tensor. This means that if one\nintegrates by parts, moving ∇σ and ∇ρ onto remaining terms, the only term that survives is proportional\nμν\nto θ̄, as the divergence of h̃ vanishes (after commuting derivatives, dropping Riemann terms and imposing\n,2\nbecomes\nLorenz gauge). Thus Leff\nCS\n,2\nLeff\n=\nCS\n\n√\n−ḡε̄αβγδ ∇ρ ∇σ θ̄ ∇α h̃β σ ∇γ h̃δ ρ .\n\neff\neff\neff,1\neff,2\nTCS\nμν = TMTμν + TCSμν + TCSμν ,\n\nand\n\nC.\n\n∇σ ∇ρ θ̄ ε̄α (μ γδ ∇|α| h̃ν) σ ∇γ h̃\n\nρ\nδ\n\nEE\n\n.\n\nThe equation of motion may be imposed anywhere\neff\n ̄ h̃αβ may be formed in TCS\n\u0003\nμν via integration by parts.\nThere is no contraction of derivative operators onto each\neff,2\nother in TCS\nμν , so it remains unchanged. In the final two\neff,1\nterms of TCS\nμν , the derivative operator ∇ρ may be moved\nρ\nonto ∇α θ̄ ∇ h̃κλ . This would generally make two terms,\n2\n ̄ h̃κλ is O(ζGW\nbut the term proportional to ∇α θ̄ \u0003\n) relative to the Isaacson piece, so we only keep one term.\nThis gives\nDD\n\u0010\neff,1\n2α\nTCS\nε̄αβγδ ∇α θ̄ ∇(μ h̃|β| σ ∇ν) ∇δ h̃σγ\nμν = −ǫ\n2\n\u0011\nρ\n+ ∇ρ ∇α θ̄ ∇ h̃β(μ ∇|δ| h̃ν)γ\nEE\nσ\nρ\n.\n+ 2∇ρ ∇α θ̄ ε̄α (μ γδ ∇ h̃ν)σ ∇δ h̃ γ (41)\n\nαβ\n1\nρ\n∇μ h̃αβ ∇ν h̃ − ∇ρ h̃αμ ∇ h̃ν α\n2\n\u001d\u001d\n1\nρ αβ\n(42a)\n− ḡμν ∇ρ h̃αβ ∇ h̃\n4\n\nwhere\n\neff,2\nTMT\nμν\n\nDD\n\nEE\nρ\n∇ρ h̃αμ ∇ h̃ν α\nEE\nκ DD\nρ αβ\n= −ǫ2\nḡμν ∇ρ h̃αβ ∇ h̃\n.\n4\n\neff,1\n2\nTMT\nμν = −ǫ κ\n\n(42b)\n(42c)\n\nIntegrating by parts, imposing the equations of motion\nEq. (35), and integrating by parts again where appropriate, these contributions to the effective stress-energy\ntensor at I + are\nEE\nα\n(θ)\nh̃ (μ T̃ν)α\n\u0010\n\u0011\nα DD\nργ\nδ α\nρ\n− ǫ2\n∇σ ∇ρ θ̄ ∇ h̃ μ ε̄σ γδ(α ∇ν) h̃ − ∇ h̃ν) γ\n2\nEE\n+ (μ ↔ ν)\n(42d)\n\neff,1\n2\nTMT\nμν = −ǫ\n\n(40b)\n\nImposing the On-Shell Condition\n\n\u001c\u001c\n\neff\neff,1\neff,2\n= TGR\nμν + TMTμν + TMTμν ,\n\n(39)\n\neff,1\neff,2\neff,1\nwhere TCS\nμν and TCSμν are due to the variation of LCS\n,2\nand Leff\nrespectively. These expressions are\nCS\nh\n\u0010\nDD\neff,1\n2α\n∇α θ̄ ε̄αβγδ ∇(μ h̃|β| σ ∇ν) ∇δ h̃σγ\nTCS\nμν = −ǫ\n2\n\u0011\nρ\n− ∇ h̃β(μ ∇|δ| ∇ρ h̃ν)γ\niEE\nσ\nρ\n, (40a)\n− 2ε̄α (μ γδ ∇ h̃ν)σ ∇δ ∇ρ h̃ γ\n\neff,2\n2\nTCS\nμν = −ǫ α\n\neff\n2\nTMT\nμν = ǫ κ\n\n(38b)\n\nWith these simplified Lagrangian densities at hand, we\ncan now compute the total effective stress-energy tensor\nfor GWs in CS gravity:\n\nDD\n\neff\neff\nLet us now evaluate TMT\nμν on shell. Since TMTμν is\n0\nO((ζGW ) ), imposing the equation of motion Eq. (35) will\nintroduce terms of O(ζGW ), which are kept since they are\neff,1\neff,2\nthe same order as TCS\nμν and TCSμν . We can also impose\na gauge condition. We have already imposed the Lorenz\ngauge throughout at the level of the action. We may\nfurther specialize this to the TT gauge. While the TT\ngauge may not be imposed globally, it may be imposed\nat I + , where the effective stress-energy tensor is being\nevaluated. In TT gauge,\n\neff,2\nTMT\nμν =\n\nDD\n\n1\neff,1\nḡ ḡαβ TMT\nαβ .\n4 μν\n\n(42e)\n\neff\n+\nFinally, we may write an expression for TCS\nμν at I\nafter imposing the equations of motion,\n\neff\neff\neff\nTCS\nμν = TGRμν + δTCSμν\n\nδT\n\neff\nCSμν\n\n=T\n\neff,1\nMTμν\n\n+T\n\neff,2\nMTμν\n\n(43a)\n+T\n\neff,1\nCSμν\n\n+T\n\neff,2\nCSμν\n\n, (43b)\n\neff\nwhere δTCS\ncontains the Chern-Simons correcμν\ntion at O(ζGW ).\nThe summands are taken from\nEqs. (40b), (41), (42d), and (42e). Putting them together\nfor convenience, the final result is\n\n\f11\n\u001d\u001d\n1\nα\nαβ (θ)\n(θ)\nh̃ (μ T̃ν)α + ḡμν h̃ T̃αβ\n4\nDD\n\u0010\n\u0010\nh δ α\n\u0011\n\u0011\nργ\nργ\nρ\nδ α\nρ\n2α\n−ǫ\n∇σ ∇ρ θ̄ ∇ h̃ μ ε̄σ γδ(α ∇ν) h̃ − ∇ h̃ν) γ + ∇ h̃ ν ε̄σ γδ(α ∇μ) h̃ − ∇ h̃μ) γ\n2\n\u0010\n\u0011\nργ\nρ\n1\nδ αβ\nρ\n+ ḡμν ∇ h̃ ε̄σ γδ(α ∇β) h̃ − ∇ h̃β) γ + 2ε̄α (μ γδ ∇|α| h̃ν) σ ∇γ h̃ δ\n2\ni\n\neff\n2\nδTCS\nμν = −ǫ\n\n\u001c\u001c\n\nρ\n\nρ\n\n+ ε̄σβγδ ∇ h̃β(μ ∇|δ| h̃ν)γ + 2ε̄σ (μ γδ ∇ h̃ν)σ ∇δ h̃\nEE\n.\n+ ε̄αβγδ ∇α θ̄ ∇(μ h̃|β| σ ∇ν) ∇δ h̃σγ\n\nIn the above, we have organized the terms by their\nscaling with powers of wavelength. The first line contains terms which scale as λ0GW and λ−1\n; the first of\nGW\nthese corresponds to a \"mass\" term in the effective stressenergy tensor. Both of these scale more slowly with inverse wavelength than the GR contribution, so they are\nsubdominant. The next three lines have the same scaling\n−2\nwith inverse wavelength as GR, λGW\n. The final line scales\nmore strongly with inverse wavelength, λ−3\n. This term\nGW\nin principle could dominate over the GR term in the high\nfrequency limit.\nNotice that the effective stress-energy tensor presented\nhere is applicable to both the dynamical and the nondynamical version of CS gravity. Also note that if θ were\na constant, rather than a function, the effective stressenergy tensor would be identical to that of GR (which\nis expected, since, in that case, the modification to the\naction is purely a boundary or topological term).\n\nD.\n\nIn dynamical CS gravity\n\neff\nFrom asymptotic arguments, we can argue that δTCS\nμν\n+\ndoes not contribute to dissipation laws at I in the dynamical version of CS gravity. As mentioned in Sec. II C,\nthe dissipation of energy, linear and angular momentum\nof a system is computed by integrating components of the\nstress-energy tensor on a 2-sphere at I + . Since the area\nof the 2-sphere grows as r2 , for the dissipation integrals\nto be finite, the components of the stress-energy tensor\nmust fall-off at least as r−2 . In fact, only the r−2 part\nof the stress-energy contributes as one takes the r → ∞\nlimit. Therefore, any part of the stress-energy tensor that\ndecays faster than r−2 does not contribute to dissipation\nlaws.\nThe CS correction to the effective stress-energy tensor,\neff\n−2\nδTCS\nin the dynamical\nμν , always falls off faster than r\ntheory. To see this, we must analyze the behavior of θ,\nwhich is restricted. This restriction comes from demanding that the field θ sourced by an isolated system and\nin an asymptotically flat space contains a finite amount\nof energy. The energy in θ is computed by integrating\n(θ)\nthe time-time component of Tμν on a hypersurface of\nconstant time and Rover all space. For the energy to be\n∞\nfinite, the integral\n(∇θ)2 r2 dr (in an asymptotically\n\nσ\n\nγ\n\n(44)\n\nflat, Cartesian spatial slice, appropriate to I + ) must be\nfinite. This restricts ∇θ to fall off at least faster than\nr−3/2 . We then conclude that the CS correction to the\neff,1\nenergy-momentum tensor must vanish at I + , as TMT\nμν ,\neff,2\neff,1\neff,2\n−7/2\nTMTμν , TCSμν and TCSμν decay at least as r\nor faster.\nThe only contribution at I + to the effective stressenergy of GWs in dynamical CS gravity which decays as\nr−2 is the GR part,\neff\neff\nTCS\nμν = TGRμν .\n\n(45)\n\nAgain, we stress that this only accounts for the outgoing GW radiation. However, the same argument as\nin Sec. II C holds; the correction to the energy flux absorbed by trapped surfaces is only important at the end\nof an inspiral, both in GR and deformations away from\nGR. This is supported by the small velocity, small mass\nratio expansion of [47] (see also [44, 45]).\nE.\n\nIn non-dynamical CS gravity\n\nIn the dynamical theory, since the scalar field θ must\ncarry a finite energy, we were able to argue for the vaneff\n+\nishing of δTCS\nμν at I . In the non-dynamical theory,\nthere is no such demand and no further simplification\n(θ)\ncan be made beyond the vanishing of Tμν . However, for\na particular choice of θ̄ field, the effective stress-energy\ntensor may be evaluated. We demonstrate this below.\nIn the canonical embedding\n\nThe canonical embedding of non-dynamical CS gravity\nis given by [32]\nvμ ≡ ∇μ θ̄ =\n ̇ (1/μ, 0, 0, 0) ,\n\n(46)\n\nin Cartesian coordinates in the asymptotically-flat part\nof the spacetime. Approaching infinity, this yields\n∇α ∇β θ̄ = 0\n\n(47)\n\neff,2\nso by extension TCS\nμν = 0, the first-order equation of\n2\n ̄ h̃μν = 0 + O(ζGW\nmotion becomes \u0003\n), the final two terms\neff,1\neff,1\neff,2\nof TCSμν vanish, and TMTμν = 0 = TMT\nμν . Notice that\n\n\f12\nhere there is no amplitude birefringence in flat spacetime\nas θ̈ = 0 [33, 34, 54, 55].\neff,1\nThe first term of TCS\nμν is the only O(ζGW ) correction\nwhich survives. The total stress-energy tensor in the\ncanonical embedding of non-dynamical Chern-Simons\ngravity at I + , with this correction, is\neff\neff\neff\nTCS\nμν = TGRμν + δTCSμν ,\nEE\nDD\neff\n2α\nδTCS\n∇α θ̄ ε̄αβγδ ∇(μ h̃|β| σ ∇ν) ∇δ h̃σγ\nμν = −ǫ\n2 DD\nEE\nα\nε̄ijk ∇(μ h̃|i| σ ∇ν) ∇k h̃σj\n= +ǫ2\n,\n(48)\n2μ\n\nwhere ε̄ijk is the Levi-Civita tensor on the 3-space orthogonal to (∂/∂t)μ , and the sign change arises from the\nfactor of sign(g) in Eq. (31).\neff\nFrom the form of the correction δTCS\nμν , we can briefly\nmention the leading modification to radiation reaction in\na binary inspiral at Newtonian order. At this order, there\nis no modification to the trajectories of the two bodies\nfrom the θ̄ field. Since the first-order equation of motion\nis identical to that of GR at order O(ζGW ), the leading\nGR\nsolution to h̃μν is the same as in GR, h̃μν = h̃μν .\neff\nInserting this solution in TT gauge into δTCS\nμν , the energy, linear momentum, and angular momentum radiated\nby the system can be computed. Adopting a Cartesian\ncoordinate system at asymptotic infinity, the correction\nto the radiated quantities is given by\nZ\nZ\nCS\n2\neff\neff\nδ Ė = − dΩ r δTCS0j nj = + dΩ r2 δTCS\n(49a)\n00\nZ\nZ\neff\neff\nδ ṖiCS = + dΩ r2 δTCS\ndΩ r2 δTCS\n(49b)\nij nj = −\ni0\nZ\n(−3)\n(49c)\nδ J ̇iCS = − dΩ r2 εijk xj δTCSkl nl ,\n(−3)\n\neff\nwhere δTCSμν is the part of δTCS\nμν which decays as\nr−3 [56]. In evaluating these integrals, the only angular\ndependence is in factors of ni or xi . An angular integral\nof an odd number of such factors vanishes, while an integral of an even number of them reduces to a symmetrized\nproduct of Kronecker delta tensors. These factors arise\nexplicitly in the definitions of Eqs. (49) and from spatial\neff\nderivatives acting on h̃μν in Tμν\n. The most important\neff\neff\ndifference between TGRμν and δTCS\nμν is the parity of the\nnumber of derivatives, which leads to the following behaviour.\nIn GR, the leading contribution to Ė GR is from the\n(mass quadrupole)2 combination. Compare this with the\neff\n2\nsame integral for δTCS\n00 , where the (mass quadrupole)\nterm has an odd number of factors of ni , and thus vanishes. The leading contribution is then from the product\nof the mass quadrupole and mass octupole.\nThe same situation takes place in calculating J ̇i . In\nGR, the leading contribution is from the product of mass\nquadrupole with itself. In the correction from CS gravity,\nthe mass quadrupole squared term has an odd number\nof factors of ni ; the dominant contribution is again from\nthe mass quadrupole times the mass octupole.\n\nFinally, the situation is different in the calculation of\nṖi . In GR, the quadrupole squared contribution to Ṗi has\nan odd number of ni factors. The dominant contribution\nis from the mass quadrupole times the mass octupole.\nHowever, for the CS correction, the quadrupole squared\nterm has an even number of factors of ni . Using\n1\nÏ TT (t − r) ,\n8πκr ij\n\nTT\n\nh̃ij =\n\n(50)\n\nthis evaluates to\nδ ṖiCS = −\n\nα\n(3) (4)\nεijk Ilj Ilk ,\n120πκ2 μ\n\n(51)\n\nwhere Iij is the reduced quadrupole moment of the mat(n)\nter, and Iij ≡ (d/dt)n Iij .\nFor a binary in a circular orbit about the ẑ-axis with\nmasses m1 , m2 , total mass m = m1 +m2 , symmetric mass\nratio η = m1 m2 /m2 , separation d, and orbital frequency\nω, we find the momentum flux correction to be\nδ ṖzCS = −\n\n8α\n(ηmd2 )2 ω 7 ,\n15πκ2 μ\n\n(52a)\n\nor, in terms of the velocity v = ωd, with Kepler's third\nlaw v 2 = m/d,\n\u0012\n\u0013\n128\nα\nCS\nδ Ṗz = −\nη 2 v 13 ,\n(52b)\n15 κμm\nwhere notice that the quantity in parentheses is dimensionless. This is to be compared with the leading\nmomentum luminosity in GR, which is proportional to\nṖzGR ∝ η 2 v 11 δm/m, where δm = m1 − m2 [57]. Although\nthe GR effect is two powers of v stronger, it depends on\nthe difference in masses, whereas the non-dynamical CS\ncorrection only depends on the total mass. This implies\nthat in the limit of comparable masses m1 ≈ m2 , the recoil velocity would not asymptote to zero in CS gravity,\nas it does in GR for non-spinning binaries.\nA physical interpretation of this effect is related to\nthe parity-violating nature of the theory. When one\nchooses a canonical embedding, the action becomes\nparity-violating as the Pontryagin density is parity odd.\nThe embedding coordinate chooses a (temporal) direction to which the modification to the Einstein equations\ncan couple to, inducing a new term in the stress-energy\nthat is proportional to the curl of the metric perturbation. Because kicks are predominantly generated during\nmerger, the CS modification is indeed dominant over the\nGR result, leading to the first, non-linear, strong-field\nmodification computed in CS gravity.\nVI.\n\nEFFECTIVE STRESS-ENERGY TENSOR\nOF MODIFIED GRAVITY THEORIES\n\nLet us now consider a broader class of modified gravity\ntheories. There is an infinite variety of GR modifications\none could construct. However, there are several properties that are desirable and that we require here:\n\n\f13\n1. Metric theories: the action depends on a symmetric\nmetric tensor that controls the spacetime dynamics.\n\nConsider then a modified gravity theory defined by the\naction\n\n2. Deformations of GR: analytically controllable and\nsmall corrections to the Einstein-Hilbert action\nwith a continuous GR limit.\n\nS = SEH + Smat + Sint + Sθ ,\n\n3. High-Rank Curvature: corrections depend on\nquadratic or higher products of the Riemann tensor, Ricci tensor, or Ricci scalar.\n4. Minkowski stable:\nthe theory must admit\nMinkowski spacetime as a stable vacuum solution,\nand future null infinity should be asymptotically\nflat for isolated matter spacetimes.\nBesides the metric, there may be new fields introduced\nwhich are considered part of the \"gravity sector\". This\ndistinction means that said fields are not minimally coupled, i.e. they may be coupled to connection and curvature quantities. These additional fields may be of any\nspin: scalars, spinors, vectors, etc. For simplicity, we will\nonly consider scalar fields here, but the results may also\nbe extended to higher spin fields. Scalar fields are wellmotivated from quantum completions of GR, e.g. moduli\nfields are common appearances in string theoretical models [58].\n\nA.\n\nAction\n\nIn defining a modified gravity theory, let us consider\nwhat terms may arise in the action. These terms must include the Einstein-Hilbert and matter terms, along with\nmodifications built from additional scalar fields and curvature invariants. Additionally, it ought to contain a dynamical term for the scalars that couple to the curvature\ninvariants, as we will motivate in Sec. VI B.\nIn principle,\nthere are an infinite number of curvature invariants to consider.\nThe\nfirst few of these are simple to construct:\nΛ, R, R2 , ∇μ R∇μ R, Rμν Rμν , Rαβμν Rαβμν , . . .,\nwhere Λ is any scalar constant, e.g. the cosmological\nconstant. These may be specified by their rank, r,\nwhich is the number of curvature tensors which are\ncontracted together, and by further specifying a list of r\nnon-negative integers {λ1 , . . . , λr }, where λi specifies the\nnumber of derivatives acting on the ith curvature tensor.\nFor a rank r and case {λi }ri=1 , there are a finite number\nof independent curvature invariants corresponding to the\nnumber of ways to contract indices. Thus all curvature\ninvariants may be countably enumerated, assigning some\nnumber n to each independent invariant.\nWe here consider only combinations of algebraic curvature invariants, i.e. λi = 0 for all cases. This means we\ndo not allow modifications that depend on derivatives of\ncurvature tensors. Such a simplification is a good one,\nfrom the standpoint that it automatically guarantees the\nfield equations to be no higher than fourth-order.\n\n(53a)\n\nwhere Sθ is the canonical kinetic term for θ,\nZ\n√\nβ\nd4 x −g gμν [(∇μ θ)(∇ν θ) + 2V (θ)] ,\nSθ = −\n2\n(53b)\nwith V an arbitrary potential function; and where Sint\nis the interaction term between the scalar θ and some\nalgebraic combination of curvature tensors, for example\nZ\n√\nSint,0 = α0 d4 x −g f0 (θ)Λ\n(53c)\nZ\n√\n(53d)\nSint,1 = α1 d4 x −g f1 (θ)R\nZ\n√\nSint,2 = α2 d4 x −g f2 (θ)R2 ,\n(53e)\nor generally\nSint = α\n\nZ\n\n√\nd4 x −g f (θ)R ,\n\n(53f)\n\nwith f an arbitrary \"coupling function\" and R an algebraic combination of curvature invariants. Alternatively,\nnotice that we could have assigned each term proportional to αi a separate θi coupling with its associated\nkinetic and potential terms. The arguments presented\nbelow would also hold for such constructions.\nB.\n\nDynamical scalar fields\n\nThe requirement for the scalar θ to be dynamical arises\nfrom demanding diffeomorphism invariance in the theory.\nConsider the infinitesimal transformation of the action\nunder a diffeomorphism generated by the vector field v μ .\nSpecifically, look at the terms containing θ, i.e. the sum\nSmod = Sint + Sθ . The infinitesimal transformation under\nthe diffeomorphism is\n\u0013\n\u0012\n\u0013\nδ\nδ\nLint Lv gμν +\nLint Lv θ\nδSmod = d x\nδgμν\nδθ\n\u0012\n\u0013\n\u0012\n\u0013\nZ\nδ\nδ\n+ d4 x\nLθ Lv gμν +\nLθ Lv θ , (54)\nδgμν\nδθ\nZ\n\n4\n\n\u0012\n\nwhere Lint is the interaction Lagrangian density, Lθ is\nthe kinetic Lagrangian density, and Lv stands for the Lie\nderivative along v μ .\nFor a theory to be diffeomorphism invariant, the infinitesimal transformation in the total action must vanish, δS = 0. Since Lv θ may be arbitrary for some θ and\nsome v μ , the functional multiplying Lv θ must vanish for\nδS to vanish. This means\nδ\n(Lint + Lθ ) = 0 .\nδθ\n\n(55)\n\n\f14\nWhen the scalar field θ has dynamics, i.e. β 6= 0, then\nEq. (55) is identical to the equations of motion of the\nfield θ and is therefore automatically satisfied. However,\nif the field is not dynamical, β = 0, then Eq. (55) gives\nf ′ (θ)R = 0 .\n\n(56)\n\nExcept in the case where f ′ (θ) = 0, this is an additional\nconstraint on the geometry of spacetime, namely that\nR = 0. Given that the equations of motion already saturate the number of equations for the degrees of freedom\npresent, this would be an overconstrained system. This\nis in fact the case in the non-dynamical version of CS\ngravity, as discussed in [30, 59]. We therefore only admit dynamical scalar fields, or terms with no scalar field\ndependence (f (θ) = const.).\n\nC.\n\nSpecial cases: zeroth and first rank\n\nBefore doing a calculation for a general curvature invariant R, let us briefly discuss some special cases. As\nwe will see, curvature invariants of zeroth and first rank\nwill not be considered.\nZeroth rank\n\nAt zeroth rank, there is only one algebraic curvature\ninvariant: a constant. The non-constant part of f0 (θ)\nmay simply be reabsorbed into the potential V (θ). This\ngives a minimally coupled scalar field, which may be absorbed into Smat . The constant part of f0 leads to a\n\"cosmological constant.\" Since we are only considering\ntheories which are Minkowski stable and asymptotically\nflat, this cosmological part must vanish.\n\nFirst rank\n\nThere is only one algebraic curvature invariant of rank\n1, the Ricci scalar R. If we allow f to be a non-constant\nfunction, we would have a classical scalar-tensor theory, akin to Brans-Dicke theory (see e.g. [1]). The effective GW stress-energy tensor for scalar-tensor theory\nhas been computed, for example in Brans-Dicke theory\n(see [60]), so we do not consider it here. Since we already\ninclude the Einstein-Hilbert term in Eq. (53a), there can\nbe no additional term linear in R without affecting Newton's constant. Thus we only consider quadratic and\nhigher rank curvature invariants.\n\nD.\n\nCubic and Higher Ranks\n\nAt cubic rank, one can easily show that there\nare five algebraic invariants that may not be\nfactored as products of lower rank invariants\n\n(Rμ ν Rν ρ Rρ μ ,\nRμν Rαβ Rμανβ ,\nRαβ μν Rμν ρσ Rρσ αβ ,\n∗ ρσμν κλ\n∗\nαβ ρ\nR\nR μν Rρσκλ , and Rρσ R α Rσ β ) and four that\nmay be factorized (R3 , RRμν Rμν , RRμναβ Rμναβ , and\nR ∗ Rρ σ μν Rσ ρμν ). The arguments that follow work for\nall of them, so for concreteness we choose just one:\nRμ ν Rν ρ Rρ μ . The modification to the action arising\nfrom this term is\nZ\n√\nSex.5 = α d4 x −g f (θ)Rμ ν Rν ρ Rρ μ .\n(57)\nThe contribution from this term to the effective action\nat second order is\n\"\nZ\nh̃ \u0010 ′\neff(2)\n2\n4 √\nSex.5 = ǫ α d x −ḡ\nf (θ̄)θ̃ R̄μ ν R̄ν ρ R̄ρ μ\n2\n\u0011\n+3f (θ̄) R̃μ ν R̄ν ρ R̄ρ μ + 3f ′ (θ̄)θ̃ R̃μ ν R̄ν ρ R̄ρ μ\ni\n+3f (θ̄)R̃μ ν R̃ν ρ R̄ρ μ . (58)\n\nImmediately we see that all terms have at least one power\nof background curvature tensors. This means that each\nterm can be written similarly to an earlier example in\nSec. II C, in Eq. (11). When evaluating this effective\nstress- energy tensor at I + , all of the background curvature tensors vanish. This automatically implies that cubic and higher rank terms in the action do not contribute\nto the effective stress energy tensor at asymptoticallyflat, future null infinity.\nThe stress-energy tensor is then given by the\nMacCallum-Taub tensor, Eq. (20b), which need not be\nidentical to the GR one yet, as one must first impose the\nfirst-order equations of motion at I + . These equations\ncould be modified by the introduction of higher-order operators in the action. Let us analyze such equations again\nthrough the example of Eq. (57). As the calculation depends only on the rank of the curvature invariant appearing in the action and not on its specific form, the\nresults shown below extend to all cubic and higher rank\nalgebraic curvature invariants as well.\nThe equation of motion arising from Eq. (57) is\nα\ng f (θ)Rα β Rβ γ Rγ α\n2 μν\n\u0001\n3α \u0002\ngμν ∇α ∇β f (θ)Rα γ Rγβ + \u0003 (f (θ)Rμγ Rγ ν )\n+\n2\n\u0001\u0003\nmat\n(θ)\n−2∇β ∇(μ f (θ)Rγ ν) Rβ γ = Tμν\n+ Tμν\n. (59)\n\nκGμν + 3αf (θ)Rμβ Rβ γ Rγ ν −\n\nThe important feature to note is that all terms containing\nα, that is, all terms deforming away from GR, are cubic or\nquadratic in curvature tensors. This is a general feature:\nfrom a term in the action of rank r, terms in the equations\nof motion will be of rank r and rank r − 1.\nNow consider evaluating the first-order equations of\nmotion at asymptotically-flat, future null infinity, which\nwe need in order to put the MacCallum-Taub stressenergy tensor on-shell. We will not write out the full\nfirst-order equations of motion; it suffices to say that the\n\n\f15\nmodification terms (those terms containing α) are of rank\nr, r − 1, and r − 2 in the first-order equations of motion.\nWhen going to I + , only the terms of rank 0 survive,\n ̄ h̃μν .\ne.g. \u0003\nImmediately we see that the only modifications to the\naction that affect the first-order equations of motion at\nI + are those of rank 2 and lower. Thus for modifications\nthat are cubic and higher, the first-order equations of\n ̄ h̃ = 0.\nmotion at I + are simply those of GR, \u0003\nμν\nInserting this asymptotically-flat, on-shell condition\ninto the MacCallum-Taub stress-energy tensor yields the\nIsaacson stress-energy tensor. Cubic and higher rank\nmodifications to the Lagrangian do not modify the effective stress-energy tensor due to GWs. We again emphasize that radiation reaction will still be different in\na higher order theory because of different motion in the\nstrong field, additional energy carried in the scalar field\nθ, and energy carried down horizons being different. But\nthe energy of a GW at I + is the same as in GR.\nE.\n\nQuadratic terms\n\nLet us now consider quadratic deformations to the action, as these are the only ones left to study, and let us\nclassify the types of modifications possible. There are two\nimportant characteristics that we use for such a classification. The first depends on the nature of the curvature\nquantity R. This quantity may either be topological or\nnot. A curvature quantity that is topological may be expressed as the divergence of a current, R = ∇μ Kμ . As\nwe mentioned in Sec. IV, Eq. (24), the Pontryagin density, ∗R R, is a topological curvature invariant. In metric\ngravity, the only other non-vanishing, algebraic, second\nrank curvature invariant that is topological is the GaussBonnet term,\nG = Rαβμν Rαβμν − 4Rμν Rμν + R2 ,\n\n(60)\n\nas the Nieh-Yan invariant vanishes in torsion-free theories.\nThe second characteristic we can use to classify theories is the behaviour of the scalar field θ, which depends\non the potential V (θ). The two possibilities are a potential that is flat, V (θ) = 0, or one that is non-flat,\nV varying with θ. A flat potential does not choose out\nany preferred values of the scalar field, whereas a nonflat potential must be bounded from below for stability,\nand thus has a global minimum (or several minima). The\npresence or absence of a preferred field value is important\nin the limit going to I + .\nFor non-flat potentials, without loss of generality, the\nglobal minimum can be shifted to θ = 0 by simultaneously shifting the potential function and the coupling\nfunction f . Such a shift does not affect the derivative\nterm in the kinetic term for θ, since it simply adds a\nglobal constant to the field. The only problematic situation is if the global minimum is in the limit θ → ±∞,\nwhich we do not allow here.\n\nWe begin by discussing the asymptotic behaviour of θ,\nwhich satisfies the sourced wave equation\nβ (\u0003θ − V ′ (θ)) = −αf ′ (θ)R .\n\n(61a)\n\nAt I + , the right hand side vanishes. Furthermore, if\nwe are interested in static or quasistatic background solutions for θ̄ around which we can expand, time derivatives in the d'Alembertian will vanish leaving only the\nLaplacian,\n2\n\n∇ θ̄ − V ′ (θ̄) = 0 .\n\n(61b)\n\nFor a non-flat potential, V ′ (θ) 6= 0, the zeroth order\nasymptotic solution will be θ̄ going to the minimum of\nthe potential, which we have shifted to θ̄ = 0.\nFor a flat potential, the background equation of motion\nfor θ, Eq. (61b), at I + becomes\n2\n\n∇ θ̄ = 0 .\n\n(61c)\n\nThere are two asymptotic solutions: θ asymptotes to a\nconstant or θ asymptotes to a function linear in Cartesian coordinates. The latter case would contribute a con(θ)\nstant stress-energy tensor Tμν at I + . This would lead\nto an asymptotically de Sitter spacetime, not an asymptotically flat spacetime. Therefore, we only consider the\ncase where θ asymptotes to a constant.\nThe equation of motion Eq. (61c) does not determine\nto what value θ̄ asymptotes. A boundary condition is required in this case. Again, without loss of generality, for\nsome given asymptotic value determined by some boundary condition, the field and coupling function f (θ) may\nbe shifted so as to redefine the asymptotic value to be\nθ → 0 without changing the physics.\nA boundary condition is not required if the theory is\n\"shift symmetric.\" In a shift symmetric theory, the translation operation θ → θ + c, where c is a constant, leaves\nthe equations of motion invariant. Such a theory, therefore, must have equations of motion that depend only on\nthe derivative ∇μ θ. Such is the case, for example, if the\naction depends on a topological term multiplied by some\nscalar field, f (θ)∇μ Kμ , as then the action can be rewritten as (∇μ f (θ))Kμ via integration by parts. Of course,\nin this case, the potential must also be flat and f must be\nlinear for the theory to be shift-symmetric. Such types\nof corrections arise naturally in the low-energy limit of\nstring theory [17, 61–63].\nLet us rewrite the action and split the interaction term\ninto a dynamical and non-dynamical part. Since we can\nalways shift the field, potential, and coupling function so\nthat the asymptotic value is θ → 0, let us define\nα′ ≡ αf (0)\nF (θ) ≡ f (θ) − f (0) .\n\n(62a)\n(62b)\n\nThen, the interaction term in Eq. (53f) may be rewritten\nas\nSint = Sn-d + Sdyn\n(62c)\nZ\nZ\n√\n√\n= α′ d4 x −g R + α d4 x −g F (θ)R .\n\n\f16\nField\n\nAsymptotic form\n\nField\n\nḡ\nΓ̄\nR̄\nR̄ ∼ R̄2\n(n)\nh̃, ∇ h̃\n\nO(1 + r −1 )\nr −2\nr −3\nr −6\nr −1\n\n∇θ̄\nθ̄\nF (θ̄)\nF (n) (θ̄)\n(n)\nθ̃, ∇ θ̃\n ̃ ∼ (∇2 h̃)2\nR̃\n\n2\n\nR̃ ∼ R̄(∇ h̃)\n\nr −4\n\nAsymptotic form only if they were multiplied by terms that asymptote as\nAt least r −3/2\nAt least r −1/2\nAt least r −1/2\nO(1)\nr −1\nr −2\n\nTABLE I. The asymptotic forms of fields appearing in the\neffective action for a rank 2 modification to the action. All\ntensor indices have been suppressed.\n\nThe first term is the non-dynamical part, i.e. the part\nthat does not couple to the scalar field, while the second\npart is the dynamical part. If R is a topological curvature invariant, then the first term in Eq. (62c) does not\ncontribute to the equations of motion, as it is the integral\nof a total derivative.\n1.\n\nDynamical contribution\n\nLet us perturb Sdyn to second order to calculate the\ncontribution to the effective action, keeping in mind that\nθ̃ ̃ and  ̃h̃ do not contribute. This part of the effective\naction is\nZ\nh\n√\neff(2)\n ̃\n2\nSdyn = ǫ α d4 x −ḡ F (θ̄) R̃\n!\nh̃\n′\n+\nF (θ̄) + F (θ̄) θ̃ R̃\n2\n\u0011\n1\u0010 2\nh̃ − 2h̃μν h̃μν F (θ̄) R̄\n+\n8\n\u0011 \u0015\n1\u0010\n′\n′′\n2\n+\nh̃ F (θ̄)θ̃ + F (θ̄) θ̃ R̄ . (63)\n2\n\nTo determine the contribution to the effective stress energy tensor at I + , again analyze the asymptotic form of\nall of the fields appearing in Eq. (63). The asymptotic\nforms are summarized in Table I.\nThe simplest way to see that the dynamical part of\nthe effective action does not contribute at I + is to ex ̃ Since curvature\namine the asymptotics of R̄, R̃, and R̃.\ntensors R̄αβμν are tidal tensors, they goes as r−3 ; since\nR̄ contains two curvature tensors, it scales as r−6 . The\nslowest decaying (i.e. leading) part of R̃ roughly comes\nfrom R̄R̃ (with indices suppressed); the leading part of R̃\n2\nis ∇ h̃, which, being radiative, goes as r−1 . This means\n ̃ goes as\nthat R̃ ∼ r−4 . Similarly, the leading part of R̃\n2\n2\n ̃ ∼ r−2 .\n(∇ h̃)(∇ h̃), so R̃\nExamining the effective action, Eq. (63), we see that\nthere are no terms that decay as r−2 , which are the\nonly ones that can contribute to the GW effective stressenergy tensor at I + . Any term with R̄ or R̃ already\n ̃ could remain, and\ndecay too quickly; only terms with R̃\n\nO(1).\nHaving performed the splitting into the dynamical and\n ̃ is multiplied by √−ḡF (θ̄) in\nnon-dynamical parts, R̃\nthe effective action. This splitting was specifically constructed so that F (0) = 0. Since F must be differentiable\nat θ = 0, F (θ̄) must go to zero at least as fast as θ̄ goes\nto zero, which is at least r−1/2 .\nWe have thus shown that the dynamical part of the\ninteraction term does not contributed to the effective\nstress-energy tensor at I + directy. However, it could\nstill contribute indirectly through the imposition of the\nfirst order field equations. We examine this in a later\nsection.\n2.\n\nNon-dynamical contribution\n\nLet us now consider Sn-d in Eq. (62c). This term generically contributes to the effective stress-energy tensor of\nGWs at I + . To show this contribution, consider the\ngeneral rank 2 modification as the linear combination of\nthe four independent rank 2 curvature invariants\nαR ≡ α1 R2 + α2 Rμν Rμν + α3 Rαβμν Rαβμν + α4 ∗R R ,\n(64a)\nand absorb f (0) into the coefficients α′i in the nondynamical part,\nα′ R ≡ α′1 R2 + α′2 Rμν Rμν + α′3 Rαβμν Rαβμν + α′4 ∗R R .\n(64b)\nNote that this form also includes the Weyl squared invariant, which is a dependent linear combination of the above\nterms, C αβμν Cαβμν = R2 /3 − 2Rαβ Rαβ + Rαβμν Rαβμν ,\nwhich is considered in [26, 27]. The Pontryagin density ∗R R, being a topological invariant, does not contribute to the action in Sn-d , so we may drop the final\nterm. Similarly, if the linear combination is proportional to the Gauss-Bonnet (or Euler) invariant, which\nhas α1 = 1 = α3 , α2 = −4, then R would be topological\nand there would be no contribution to Sn-d and hence no\ncontribution to the effective stress-energy tensor of GWs.\nThe calculation of the effective action for the nondynamical term is straightforward but long, so we do not\nshow the√steps here. An outline of the calculation is to\nperturb −gR to second order; the only parts that may\n+\ncontribute to\n√ an effective stress-energy tensor at I are\nof the form −ḡR̃R̃, where again we have suppressed indices on the perturbed curvature tensor R̃. This is calculated in terms of the trace-reversed metric perturbation\nμν\nh̃ . As before, Lorenz gauge may be imposed at the level\nof the action.\nAll ρσ\nterms that remain will be of the form\nμν\n∇α ∇β h̃ ∇κ ∇λ h̃ with all indices contracted to form\nμν\na scalar. If any derivative is contracted onto h̃ , by integrating by parts and commuting covariant derivatives,\nμν\none may form the Lorenz gauge condition ∇μ h̃ = 0 and\nignore the term in the effective action. Thus the only surviving terms have derivatives contracted together, which\n\n\f17\n ̄ h̃μν and \u0003\n ̄ h̃μν \u0003\n ̄ h̃.\n ̄ h̃ \u0003\ncan be put into one of two forms, \u0003\nAfter the explicit calculation, the prefactors are found\nand\nZ\nh\n√\nǫ2\neff(2)\n ̄ h̃\n ̄ h̃ \u0003\nSn-d =\nd4 x −ḡ (α′1 − α′3 ) \u0003\n4\ni\n ̄ h̃μν . (65)\n ̄ h̃μν \u0003\n+ (α′2 + 4α′3 ) \u0003\n\nNote again that α4 does not appear, and if α1 , α2 , α3\nare in the Gauss-Bonnet ratio, then the effective action\nof Eq. (65) vanishes.\nPutting all indices in their natural positions, so as to\nexpose implicit metric dependence, and varying the effective action of Eq. (65) with respect to ḡμν , the contribution to the effective stress-energy tensor is\nDD\n\u0010\n\u0011\neff\n2\n ̄ h̃ \u0003\n ̄ h̃μν − ∇μ ∇ν h̃\n(α′1 − α′3 ) \u0003\nTn-d\nμν = ǫ\n\u0010\n ̄ h̃αμ \u0003\n ̄ h̃ν α\n+ (α′2 + 4α′3 ) \u0003\n\u0011EE\n ̄ h̃αβ ∇(μ ∇ν) h̃αβ\n.\n(66)\n−\u0003\nWe then find that the effective stress-energy tensor\nof GWs at I + is given by the MacCallum-Taub stressenergy tensor (coming from the Einstein-Hilbert action)\nplus the direct contribution from the non-dynamical part\neff\nof the rank 2 interaction term, Tn-d\nμν ,\neff\n\nTμν = T\n\neff\nMTμν\n\n+T\n\neff\nn-dμν\n\n.\n\nand the trace of this equation is\n ̄ h̃ = 2 (3α1 + α2 + α3 ) f (θ̄)\u0003\n ̄\u0003\n ̄ h̃ .\nκ\u0003\n\nAgain we see that if the α coefficients are in the GaussBonnet ratio, the GR equation of motion is recovered at\nI +.\nThis wave equation can be seen to be a massive wave\n ̄ h̃μν , with\nequation for the auxiliary variable r̃μν ≡ \u0003\n2\nmass m ∼ 1/λ̄, where λ̄ ∼ |αi |f (0)/κ. In the weak\ncoupling limit, λ̄/λGW ≪ 1, the equations simplify considerably. This simplification comes from treating the\nsolution to the full theory as a deformation away from\nGR; this means expanding the fields as power series in a\nsmall parameter, namely ζ̄ = (λ̄/λGW )2 . As in Eq. (34),\nwe impose\nh̃μν =\n\n∞\nX\n\n(n)\n\nζ̄ n h̃μν ,\n\n(0)\n\nand similarly for other fields, where the zeroth field h̃μν\nis the GR solution. Inserting this expansion in the firstorder equation of motion Eq. (68) and matching order by\norder gives\n(n+1)\n\n ̄ h̃\nκ\u0003\nμν\n\n= − (2α1 + α2 + 2α3 ) f (θ̄)\n\n\u0001\n ̄ − gμν \u0003\n ̄\u0003\n ̄ h̃(n)\n× ∇μ ∇ν \u0003\n(n)\n\n ̄\u0003\n ̄ h̃μν , (70a)\n− (α2 + 4α3 ) f (θ̄)\u0003\n\nfor all orders n ≥ 0, and\n ̄ h̃(0)\n\u0003\nμν = 0 ,\n\n3.\n\nFirst-order equations of motion\n\nWe need the first-order equations of motion at I + of\nthe full theory, including both the dynamical and nondynamical terms of the action. At I + , however, θ̄ and\n∇μ θ̄ decay at least as r−1/2 and r−3/2 . The only remaining dependence on θ̄ is through f (θ̄) → f (0).\nThe general zeroth and first-order equations of motion\nare quite long, so we do not reproduce them here, but\nthey do simplify as r → ∞. These equations are linear in h̃μν and θ̃, which are both radiative and decay\nas r−1 . This r−1 scaling is the asymptotic scaling of\nthe first-order equations of motion, as there are terms\n ̄ h̃μν that appear with no curvature tensors\nof the form \u0003\nor background scalar field θ̄ multiplying them. However,\nall terms containing θ̃ have curvature tensors multiplying\nthem, so they decay faster than the leading behaviour of\nr−1 .\nKeeping only the terms that go as r−1 , the first-order\nequation of motion in Lorenz gauge at asymptoticallyflat, future null infinity is\n\u0001\n ̄ − ḡμν \u0003\n ̄\u0003\n ̄ h̃\n ̄ h̃μν = − (2α1 + α2 + 2α3 ) f (θ̄) ∇μ ∇ν \u0003\nκ\u0003\n ̄\u0003\n ̄ h̃μν ,\n(68a)\n− (α2 + 4α3 ) f (θ̄)\u0003\n\n(69)\n\nn=0\n\n(67)\n\nThe only remaining part of the calculation is to put the\nstress-energy tensor on-shell, that is, to impose the firstorder equations of motion at I + .\n\n(68b)\n\n(70b)\n\nfor the GR solution.\nSubstituting Eq. (70b) into\nEq. (70a) and iteratively solving the field equations one\norder at a time, we find at all orders that\n(n)\n ̄ h̃μν\n\u0003\n= 0.\n\n(70c)\n\nThis is the GR first-order equation of motion, and just\nas in GR, we may specialize the Lorenz gauge to the\nTT gauge at I +5 . This expansion has discontinuously\nturned the massive wave equation into a massless one by\nkilling the massive modes in the limit of m → ∞. Such\nan order-reduction procedure, where certain solutions are\neliminated through perturbative constraints, has been\nshown to select the physically correct ones in all studied cases [31, 65, 66].\nWe can now evaluate the complete effective stressenergy tensor of GWs at I + . As shown in Sec. VI E 1,\n\n5\n\nTo prove that the TT gauge exists at I + for this theory, the\nproof in Appendix A of Flanagan and Hughes (FH) [64] must\nbe extended. Their Eq. (A.12) must be replaced by our (68a)\nand a small coupling expansion performed. The result will again\nbe (70c), which is identical to FH's Eq. (A.12).\n\n\f18\nthere is no direct contribution from the dynamical part\nof the interaction term. Section VI E 2 showed that the\nnon-dynamical part does contribute directly, but imposing Eq. (70c) forces this contribution to also vanish. Since\nthe MacCallum-Taub tensor on-shell is equal to the Isaacson tensor, we then have\neff\neff\neff\nTμν\n= TMT\nμν + Tn-dμν\n\n\u0001\n\n ̄ h̃ =0)\n(\u0003\nαβ\n\neff\n= TGR\nμν .\n\n(71)\n\nThat is, the effective GW stress-energy tensor is identical\nto the Isaacson one at I + for this wide class of modified\ngravity theories.\nVII.\n\nCONCLUSIONS\n\nWe have here addressed the energy content of GWs\nin a wide class of modified gravity theories. We focused\non theories that are weak deformations away from GR\nand calculated the effective stress-energy tensor where\nGWs are extracted: in the asymptotically-flat region of\nspacetime.\nThe main calculation tool we employed was the perturbed Lagrangian approach. We demonstrated the calculation explicitly for GR, recovering the Isaacson effective stress-energy tensor. We also explicitly calculated\nthis effective tensor in dynamical modified CS gravity,\nwhere again the result at I + reduces to the Isaacson\ntensor. The features of CS gravity that lead to the effective stress-energy tensor being identical to the one in\nGR are the dynamical nature of the scalar field and the\ntopological nature of the curvature correction to the action.\nWe then generalized this finding to all action modifications of a similar nature: a dynamical scalar field coupled\nto a scalar curvature invariant of rank 2 or higher in a\nspacetime that is asymptotically flat. For scalar curvature invariants of rank 3 or higher, we showed that there\nis no modification to the stress-energy tensor or the equations of motion at I + . For rank 2, we calculated the\ncontribution to the effective stress-energy tensor and to\nthe first-order equation of motion. In the weak coupling\nlimit, the only solutions to the first-order equations of\nmotion satisfy the GR first-order equations of motion at\n ̄ h̃μν = 0. Evaluating the effective stressI + , namely \u0003\nenergy tensor on-shell with these solutions leads, again,\nto the Isaacson stress-energy tensor.\n\n[1] C.\nM.\nWill,\nLiving\nReviews\nin\nRelativity\n9\n(2006),\narXiv:gr-qc/0510072,\nhttp://www.livingreviews.org/lrr-2006-3.\n[2] M. Burgay et al., Nature. 426, 531 (2003),\narXiv:astro-ph/0312071.\n[3] A. G. Lyne et al., Science 303, 1153 (2004),\narXiv:astro-ph/0401086.\n\nA few caveats are in order. As we have stressed before, this result is evaluated at asymptotically-flat, future null infinity, so it does not apply to cosmological\nspacetimes, e.g. de Sitter spacetime. Not all of the energy that is lost by a system is carried away by GWs to\nI + : there is also radiation in the scalar field (which is\n(θ)\ncalculated straightforwardly from Tμν ), and both GWs\nand the scalar field radiation are lost to trapped surfaces.\nAll of these effects must be accounted for in calculating\nthe radiation-reaction of a system. Finally, we did not\naddress modifications to the action of the form f (θ)R,\nwhich reduce to a classical scalar-tensor theory.\nThere are several avenues open for future work. Considering classical scalar-tensor modifications is one possible extension. The work should also be extended to\nthe next simplest spacetimes, those that are asymptotically de Sitter. This is appropriate for calculating GWs\nfrom inflation, for example. Extending this approach to\ncalculating energy lost to trapped surfaces is another possibility.\nThe most natural application of this work is in tests\nof GR with pulsar binaries and with GWs emitted by\nEMRIs. The former problem requires performing a postKeplerian expansion of the motion of bodies orbiting each\nother. The latter requires knowing the BH spacetime\n(background) solution in the class of modified gravity\ntheories and the geodesic or non-geodesic motion on that\nspacetime. Both of these programs require knowledge of\nradiation-reaction in GWs at I + , which we have here\ncomputed for a large class of modified gravity theories.\n\nACKNOWLEDGMENTS\n\nWe are grateful to Stephen Green, Ted Jacobson,\nEanna Flanagan, Eric Poisson, Leor Barack, Nathan\nJohnson-McDaniel, Scott Hughes, and an anonymous referee for valuable discussions. LCS acknowledges support\nfrom NSF Grant PHY-0449884 and the Solomon Buchsbaum Fund at MIT. NY acknowledges support from the\nNASA through Einstein Postdoctoral Fellowship Award\nNumber PF9-00063 and PF0-110080 issued by the Chandra X-ray Observatory Center, which is operated by the\nSmithsonian Astrophysical Observatory for and on behalf of the National Aeronautics Space Administration\nunder contract NAS8-03060.\n\n[4] M. Kramer et al., Science 314, 97 (2006),\narXiv:astro-ph/0609417.\n[5] N. Yunes and D. N. Spergel, Phys. Rev. D80, 042004\n(2009), arXiv:0810.5541 [gr-qc].\n[6] N. Yunes and S. A. Hughes, Phys. Rev. D 82, 082002\n(Oct. 2010), arXiv:1007.1995 [gr-qc].\n[7] \"LIGO,\" www.ligo.caltech.edu.\n\n\f19\n[8] A. Abramovici et al., Science 256, 325 (1992).\n[9] L.\nS.\nCollaboration\n(LIGO\nScientific)(2007),\narXiv:0711.3041 [gr-qc].\n[10] \"VIRGO,\" www.virgo.infn.it.\n[11] \"LISA,\"\nwww.esa.int/science/lisa,\nlisa.jpl.nasa.gov.\n[12] T. Prince, American Astronomical Society Meeting 202,\n3701 (May 2003).\n[13] K. Danzmann and A. Rudiger, Class. Quant. Grav. 20,\nS1 (2003).\n[14] K. Danzmann, Advances in Space Research 32, 1233\n(Oct. 2003).\n[15] B. F. Schutz, J. Centrella, C. Cutler, and S. A.\nHughes(2009), arXiv:0903.0100 [gr-qc].\n[16] S. E. Gralla, Phys. Rev. D81, 084060 (2010),\narXiv:1002.5045 [gr-qc].\n[17] S. Alexander and N. Yunes, Phys. Rept. 480, 1 (2009),\narXiv:0907.2562 [hep-th].\n[18] L. Barack, Class. Quant. Grav. 26, 213001 (2009),\narXiv:0908.1664 [gr-qc].\n[19] A. Pound and E. Poisson, Phys. Rev. D77, 044013\n(2008), arXiv:0708.3033 [gr-qc].\n[20] S. E. Gralla and R. M. Wald, Class. Quant. Grav. 25,\n205009 (2008), arXiv:0806.3293 [gr-qc].\n[21] A.\nPound,\nPhys. Rev.\nD81,\n024023\n(2010),\narXiv:0907.5197 [gr-qc].\n[22] A.\nPound,\nPhys. Rev.\nD81,\n124009\n(2010),\narXiv:1003.3954 [gr-qc].\n[23] A. Pound(2010), arXiv:1006.3903 [gr-qc].\n[24] R. A. Isaacson, Phys. Rev. 166, 1263 (Feb. 1968).\n[25] R. A. Isaacson, Phys. Rev. 166, 1272 (Feb. 1968).\n[26] W. Nelson, J. Ochoa, and M. Sakellariadou, Phys. Rev.\nD82, 085021 (2010), arXiv:1005.4276 [hep-th].\n[27] W.\nNelson,\nJ.\nOchoa,\nand\nM.\nSakellariadou,\nPhys. Rev. Lett.\n105,\n101602\n(2010),\narXiv:1005.4279 [hep-th].\n[28] C. F. Sopuerta and N. Yunes, Phys. Rev. D80, 064006\n(2009), arXiv:0904.4501 [gr-qc].\n[29] D. Guarrera and A. J. Hariton(2007), gr-qc/0702029.\n[30] D. Grumiller and N. Yunes, Phys. Rev. D77, 044015\n(2008), arXiv:0711.1868 [gr-qc].\n[31] N. Yunes and F. Pretorius, Phys. Rev. D 79, 084043\n(Apr. 2009), arXiv:0902.4669 [gr-qc].\n[32] R. Jackiw and S. Y. Pi, Phys. Rev. D68, 104012 (2003),\ngr-qc/0308071.\n[33] S. Alexander, L. S. Finn, and N. Yunes, Phys. Rev. D78,\n066005 (2008), arXiv:0712.2542 [gr-qc].\n[34] N. Yunes, R. O'Shaughnessy, B. J. Owen, and\nS. Alexander, Phys. Rev. D82, 064017 (2010),\narXiv:1005.3310 [gr-qc].\n[35] K. Nakamura, Progress of Theoretical Physics 113, 481\n(Mar. 2005), arXiv:gr-qc/0410024.\n[36] K.\nNakamura,\nArXiv\ne-prints(Nov.\n2007),\narXiv:0711.0996 [gr-qc].\n[37] D. R. Brill and J. B. Hartle, Physical Review 135, 271\n(Jul. 1964).\n[38] R. M. Zalaletdinov, General Relativity and Gravitation\n24, 1015 (Oct. 1992).\n[39] R. M. Zalaletdinov, General Relativity and Gravitation\n28, 953 (Aug. 1996).\n[40] R. Zalaletdinov, ArXiv General Relativity and Quantum\nCosmology e-prints(Oct. 2004), arXiv:gr-qc/0411004.\n[41] C. W. Misner, K. Thorne, and J. A. Wheeler, Gravitation\n\n(W. H. Freeman & Co., San Francisco, 1973).\n[42] S. M. Carroll, Spacetime and geometry: An introduction\nto general relativity (Benjamin Cummings, 2004).\n[43] M. A. H. MacCallum\nand A. H. Taub,\nCommunications in Mathematical Physics\n30,\n153\n(Jun. 1973).\n[44] N. Yunes, A. Buonanno, S. A. Hughes, M. Coleman Miller, and Y. Pan, Phys. Rev. Lett. 104, 091102\n(2010), arXiv:0909.4263 [gr-qc].\n[45] N. Yunes et al.(2010), arXiv:1009.6013 [gr-qc].\n[46] L. Blanchet, Living Rev. Relativity 9, 4 (2006),\ngr-qc/0202016.\n[47] Y. Mino, M. Sasaki, M. Shibata, H. Tagoshi, and\nT. Tanaka, Progress of Theoretical Physics Supplement\n128, 1 (1997), arXiv:gr-qc/9712057.\n[48] M.\nCambiaso\nand\nL.\nF.\nUrrutia(2010),\narXiv:1010.4526 [gr-qc].\n[49] J. Martı́n-Garcı́a, R. Portugal, and L. Manssur,\nComputer Physics Communications 177, 640 (Oct.\n2007), arXiv:0704.1756 [cs.SC].\n[50] J. M. Martı́n-Garcı́a, D. Yllanes, and R. Portugal, Computer Physics Communications 179, 586 (Oct.\n2008), arXiv:0802.1274 [cs.SC].\n[51] J. M. Martı́n-Garcı́a, Computer Physics Communications\n179, 597 (Oct. 2008), arXiv:0803.0862 [cs.SC].\n[52] D. Brizuela, J. M. Martı́n-Garcı́a, and G. A. Mena\nMarugán, General Relativity and Gravitation 41, 2415\n(Oct. 2009), arXiv:0807.0824 [gr-qc].\n[53] \"xAct,\" http://www.xact.es/.\n[54] S. Alexander and J. Martin, Phys. Rev. D71, 063526\n(2005), hep-th/0410230.\n[55] N. Yunes, R. O'Shaughnessy, B. J. Owen, and\nS. Alexander, Phys. Rev. D 82, 064017 (Sep. 2010),\narXiv:1005.3310 [gr-qc].\n[56] K. S. Thorne, Rev. Mod. Phys. 52, 299 (1980).\n[57] L. Blanchet, M. S. S. Qusailah, and C. M. Will, Astrophys. J. 635, 508 (2005), astro-ph/0507692.\n[58] J. Polchinski, String theory. Vol. 2: Superstring theory\nand beyond (Cambridge University Press, Cambridge,\nUK, 1998).\n[59] N. Yunes and C. F. Sopuerta, Phys. Rev. D77, 064007\n(2008), arXiv:0712.1028 [gr-qc].\n[60] C. M. Will, Theory and Experiment in Gravitational Physics, by Clifford M. Will, pp. 396. ISBN\n0521439736. Cambridge, UK: Cambridge University\nPress, March 1993. (1993).\n[61] S. H. S. Alexander, M. E. Peskin, and M. M.\nSheikh-Jabbari, Phys. Rev. Lett. 96, 081301 (2006),\nhep-th/0403069.\n[62] S. H. S. Alexander and J. Gates, S. James, JCAP 0606,\n018 (2006), hep-th/0409014.\n[63] S. J. Gates, Jr., S. V. Ketov, and N. Yunes, Phys. Rev. D\n80, 065003 (Sep. 2009), arXiv:0906.4978 [hep-th].\n[64] É.\nÉ.\nFlanagan\nand\nS.\nA.\nHughes,\nNew Journal of Physics\n7,\n204\n(Sep.\n2005),\narXiv:gr-qc/0501041.\n[65] É. É. Flanagan and R. M. Wald, Phys. Rev. D 54, 6233\n(Nov. 1996), arXiv:gr-qc/9602052.\n[66] R. Woodard, in The Invisible Universe: Dark Matter and\nDark Energy, Lecture Notes in Physics, Berlin Springer\nVerlag, Vol. 720, edited by L. Papantonopoulos (2007)\npp. 403–+, arXiv:astro-ph/0601672.\n\n\f"}