{"id": "http://arxiv.org/abs/0707.1285v1", "guidislink": true, "updated": "2007-07-09T15:30:43Z", "updated_parsed": [2007, 7, 9, 15, 30, 43, 0, 190, 0], "published": "2007-07-09T15:30:43Z", "published_parsed": [2007, 7, 9, 15, 30, 43, 0, 190, 0], "title": "Second-order QCD corrections to the thrust distribution", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0707.4138%2C0707.3430%2C0707.2384%2C0707.4495%2C0707.1774%2C0707.1140%2C0707.2957%2C0707.0108%2C0707.4195%2C0707.3294%2C0707.0263%2C0707.0184%2C0707.1522%2C0707.0764%2C0707.1561%2C0707.0992%2C0707.2864%2C0707.2613%2C0707.4428%2C0707.2691%2C0707.2459%2C0707.1223%2C0707.3740%2C0707.0611%2C0707.2386%2C0707.3159%2C0707.2214%2C0707.1285%2C0707.1857%2C0707.4036%2C0707.1073%2C0707.3393%2C0707.3648%2C0707.3368%2C0707.1061%2C0707.4144%2C0707.2312%2C0707.2539%2C0707.0743%2C0707.0800%2C0707.3378%2C0707.1126%2C0707.1199%2C0707.0297%2C0707.2903%2C0707.4533%2C0707.2773%2C0707.2587%2C0707.1182%2C0707.3945%2C0707.2143%2C0707.0285%2C0707.2452%2C0707.2770%2C0707.3724%2C0707.3436%2C0707.1426%2C0707.2981%2C0707.4467%2C0707.0061%2C0707.4251%2C0707.4555%2C0707.0537%2C0707.2099%2C0707.3241%2C0707.3502%2C0707.3765%2C0707.3939%2C0707.3735%2C0707.2555%2C0707.1461%2C0707.2568%2C0707.4222%2C0707.2759%2C0707.1905%2C0707.0125%2C0707.3753%2C0707.2132%2C0707.3416%2C0707.0790%2C0707.1592%2C0707.1300%2C0707.3677%2C0707.4670%2C0707.0987%2C0707.4065%2C0707.1430%2C0707.1340%2C0707.2082%2C0707.1673%2C0707.2907%2C0707.3453%2C0707.1179%2C0707.0947%2C0707.0371%2C0707.1505%2C0707.3943%2C0707.3989%2C0707.4419%2C0707.0840%2C0707.1361&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Second-order QCD corrections to the thrust distribution"}, "summary": "We compute the next-to-next-to-leading order (NNLO) QCD corrections to the\nthrust distribution in electron-positron annihilation. The corrections turn out\nto be sizable, enhancing the previously known next-to-leading order prediction\nby about 15%. Inclusion of the NNLO corrections significantly reduces the\ntheoretical renormalisation scale uncertainty on the prediction of the thrust\ndistribution.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0707.4138%2C0707.3430%2C0707.2384%2C0707.4495%2C0707.1774%2C0707.1140%2C0707.2957%2C0707.0108%2C0707.4195%2C0707.3294%2C0707.0263%2C0707.0184%2C0707.1522%2C0707.0764%2C0707.1561%2C0707.0992%2C0707.2864%2C0707.2613%2C0707.4428%2C0707.2691%2C0707.2459%2C0707.1223%2C0707.3740%2C0707.0611%2C0707.2386%2C0707.3159%2C0707.2214%2C0707.1285%2C0707.1857%2C0707.4036%2C0707.1073%2C0707.3393%2C0707.3648%2C0707.3368%2C0707.1061%2C0707.4144%2C0707.2312%2C0707.2539%2C0707.0743%2C0707.0800%2C0707.3378%2C0707.1126%2C0707.1199%2C0707.0297%2C0707.2903%2C0707.4533%2C0707.2773%2C0707.2587%2C0707.1182%2C0707.3945%2C0707.2143%2C0707.0285%2C0707.2452%2C0707.2770%2C0707.3724%2C0707.3436%2C0707.1426%2C0707.2981%2C0707.4467%2C0707.0061%2C0707.4251%2C0707.4555%2C0707.0537%2C0707.2099%2C0707.3241%2C0707.3502%2C0707.3765%2C0707.3939%2C0707.3735%2C0707.2555%2C0707.1461%2C0707.2568%2C0707.4222%2C0707.2759%2C0707.1905%2C0707.0125%2C0707.3753%2C0707.2132%2C0707.3416%2C0707.0790%2C0707.1592%2C0707.1300%2C0707.3677%2C0707.4670%2C0707.0987%2C0707.4065%2C0707.1430%2C0707.1340%2C0707.2082%2C0707.1673%2C0707.2907%2C0707.3453%2C0707.1179%2C0707.0947%2C0707.0371%2C0707.1505%2C0707.3943%2C0707.3989%2C0707.4419%2C0707.0840%2C0707.1361&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We compute the next-to-next-to-leading order (NNLO) QCD corrections to the\nthrust distribution in electron-positron annihilation. The corrections turn out\nto be sizable, enhancing the previously known next-to-leading order prediction\nby about 15%. Inclusion of the NNLO corrections significantly reduces the\ntheoretical renormalisation scale uncertainty on the prediction of the thrust\ndistribution."}, "authors": ["A. Gehrmann-De Ridder", "T. Gehrmann", "E. W. N. Glover", "G. Heinrich"], "author_detail": {"name": "G. Heinrich"}, "author": "G. Heinrich", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevLett.99.132002", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0707.1285v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0707.1285v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "4 pages", "arxiv_primary_category": {"term": "hep-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "hep-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0707.1285v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0707.1285v1", "journal_reference": "Phys.Rev.Lett.99:132002,2007", "doi": "10.1103/PhysRevLett.99.132002", "fulltext": "ZU-TH 16/07, IPPP-07-36, Edinburgh 2007/10, HEPTOOLS 07-016\n\nSecond-order QCD corrections to the thrust distribution\nA. Gehrmann-De Riddera , T. Gehrmannb , E.W.N. Gloverc, G. Heinrichd\na\nInstitute for Theoretical Physics, ETH, CH-8093 Zürich, Switzerland\nInstitut für Theoretische Physik, Universität Zürich, CH-8057 Zürich, Switzerland\nInstitute of Particle Physics Phenomenology, Department of Physics, University of Durham, Durham, DH1 3LE, UK\nd\nSchool of Physics, The University of Edinburgh, Edinburgh EH9 3JZ, Scotland\n(Dated: November 26, 2018)\nb\n\nc\n\narXiv:0707.1285v1 [hep-ph] 9 Jul 2007\n\nWe compute the next-to-next-to-leading order (NNLO) QCD corrections to the thrust distribution\nin electron-positron annihilation. The corrections turn out to be sizable, enhancing the previously\nknown next-to-leading order prediction by about 15%. Inclusion of the NNLO corrections significantly reduces the theoretical renormalisation scale uncertainty on the prediction of the thrust\ndistribution.\nPACS numbers: 12.38.Bx, 13.66.Bc, 13.66.Jn, 13.87.-a\n\nThree-jet production cross sections and related event\nshape distributions in e+ e− annihilation processes are\nclassical hadronic observables which can be measured\nvery accurately and provide an ideal proving ground for\ntesting our understanding of strong interactions. The deviation from simple two-jet configurations is proportional\nto the strong coupling constant, so that by comparing the\nmeasured three-jet rate and related event shapes with\nthe theoretical predictions, one can determine the strong\ncoupling constant αs .\nThe theoretical prediction is made within perturbative\nQCD, expanded to a finite order in the coupling constant.\nThis truncation of the perturbative series induces a theoretical uncertainty from omitting higher order terms.\nIt can be quantified by the renormalisation scale dependence of the prediction, which is vanishing for an all-order\nprediction. The residual dependence on variations of the\nrenormalisation scale is therefore an estimate of the theoretical error.\nSo far the three-jet rate and related event shapes have\nbeen calculated [1, 2] up to the next-to-leading order\n(NLO), improved by a resummation of leading and subleading infrared logarithms [3, 4] and by the inclusion of\npower corrections [5].\nQCD studies of event shape observables at LEP [6] are\nbased around the use of NLO parton-level event generator programs [7]. It turns out that the current error on αs\nfrom these observables [8] is dominated by the theoretical uncertainty. Clearly, to improve the determination of\nαs , the calculation of the NNLO corrections to these observables becomes mandatory. We present here the first\nNNLO calculation of the thrust distribution, which is an\nevent shape related to three-jet production.\nThe thrust variable for a hadronic final state in e+ e−\nannihilation is defined as [9]\n\u0013\n\u0012P\npi * ~n|\ni |~\nP\n,\nT = max\n~\nn\npi |\ni |~\nwhere pi denotes the three-momentum of particle i, with\nthe sum running over all particles. The unit vector ~n is\nvaried to find the thrust direction ~nT which maximises\nthe expression in parentheses on the right hand side.\n\nLO\nNLO\n\nγ ∗ → q q̄g\n∗\n\nγ → q q̄g\nγ ∗ → q q̄ gg\nγ ∗ → q q̄ q q̄\n\nNNLO γ ∗\nγ∗\nγ∗\nγ∗\nγ∗\n\n→ q q̄g\n→ q q̄ gg\n→ q q̄ q q̄\n→ q q̄ q q̄ g\n→ q q̄ g g g\n\ntree level\none loop\ntree level\ntree level\ntwo loop\none loop\none loop\ntree level\ntree level\n\nTABLE I: Partonic contributions to the thrust distribution in\nperturbative QCD.\n\nIt can be seen that a two-particle final state has fixed\nT = 1, consequently the thrust distribution receives\nits first non-trivial contribution from three-particle final\nstates, which, at order αs , correspond to three-parton final states. Therefore, both theoretically and experimentally, the thrust distribution is closely related to three-jet\nproduction.\nThree-jet production at tree-level is induced by the\ndecay of a virtual photon (or other neutral gauge boson)\ninto a quark-antiquark-gluon final state. At higher orders, this process receives corrections from extra real or\nvirtual particles. The individual partonic channels that\ncontribute through to NNLO are shown in Table I. All of\nthe tree-level and loop amplitudes associated with these\nchannels are known in the literature [10, 11, 12, 13].\nFor a given partonic final state, thrust is computed according to the same definition as in the experiment, which\nis applied to partons instead of hadrons. At leading order, all three final state partons must be well separated\nfrom each other, to allow T to differ from the trivial twoparton limit. At NLO, up to four partons can be present\nin the final state, two of which can be clustered together,\nwhereas at NNLO, the final state can consist of up to\nfive partons, such that as many as three partons can be\nclustered together. The more partons in the final state,\nthe better one expects the matching between theory and\nexperiment to be.\n\n\f2\nThe two-loop γ ∗ → q q̄g matrix elements were derived in [10] by reducing all relevant Feynman integrals\nto a small set of master integrals using integration-byparts [14] and Lorentz invariance [15] identities, solved\nwith the Laporta algorithm [16]. The master integrals [17] were computed from their differential equations [15] and expressed analytically in terms of one- and\ntwo-dimensional harmonic polylogarithms [18].\nThe one-loop four-parton matrix elements relevant\nhere [12] were originally derived in the context of NLO\ncorrections to four-jet production and related event\nshapes [19, 20]. One of these four-jet parton-level event\ngenerator programs [20] is the starting point for our calculation, since it already contains all relevant four-parton\nand five-parton matrix elements.\nThe four-parton and five-parton contributions to threejet-like final states at NNLO contain infrared real radiation singularities, which have to be extracted and\ncombined with the infrared singularities [21] present in\nthe virtual three-parton and four-parton contributions to\nyield a finite result. In our case, this is accomplished by\nintroducing subtraction functions, which account for the\ninfrared real radiation singularities, and are sufficiently\nsimple to be integrated analytically. Schematically, this\nsubtraction reads:\nZ\n\u0001\nR\nS\ndσN\ndσN N LO =\nN LO − dσN N LO\ndΦ5\nZ\n\u0011\n\u0010\nV S,1\nV,1\n−\ndσ\ndσN\n+\nN N LO\nN LO\nZ\nZ\nZdΦ4\nV,2\nV S,1\nS\ndσN\ndσ\n+\ndσN\n+\n+\nN LO\nN LO ,\nN N LO\ndΦ5\n\ndΦ4\n\ndΦ3\n\nS\nwhere dσN\nN LO denotes the real radiation subtraction\nterm coinciding with the five-parton tree level cross\nR\nsection dσN\nN LO in all singular limits [22]. Likewise,\nV S,1\ndσN N LO is the one-loop virtual subtraction term coincidV,1\ning with the one-loop four-parton cross section dσN\nN LO\nin all singular limits [23]. Finally, the two-loop correction\nV,2\nto the three-parton cross section is denoted by dσN\nN LO .\nWith these, each line in the above equation is individually infrared finite, and can be integrated numerically.\nSystematic methods to derive and integrate subtraction terms were available in the literature only to\nNLO [24, 25], with extension to NNLO in special\ncases [26]. In the context of this project, we fully developed an NNLO subtraction formalism [27], based on\nthe antenna subtraction method originally proposed at\nNLO [20, 25]. The basic idea of the antenna subtraction\napproach is to construct the subtraction terms from antenna functions. Each antenna function encapsulates all\nsingular limits due to the emission of one or two unresolved partons between two colour-connected hard partons. This construction exploits the universal factorisation of phase space and squared matrix elements in all unresolved limits. The individual antenna functions are obtained by normalising three-parton and four-parton treelevel matrix elements and three-parton one-loop matrix\n\nelements to the corresponding two-parton tree-level matrix elements. Three different types of antenna functions\nare required, corresponding to the different pairs of hard\npartons forming the antenna: quark-antiquark, quarkgluon and gluon-gluon antenna functions. All these can\nbe derived systematically from matrix elements [28] for\nphysical processes.\nThe factorisation of the final state phase space into\nantenna phase space and hard phase space requires a\nmapping of the antenna momenta onto reduced hard momenta. We use the mapping derived in [29] for the threeparton and four-parton antenna functions. To extract the\ninfrared poles of the subtraction terms, the antenna functions must be integrated analytically over the appropriate\nantenna phase spaces, which is done by reduction [30] to\nknown phase space master integrals [31].\nWe tested the proper implementation of the subtraction by generating trajectories of phase space points\napproaching a given single or double unresolved limit.\nAlong these trajectories, we observe that the antenna\nsubtraction terms converge towards the physical matrix\nelements, and that the cancellations among individual\ncontributions to the subtraction terms take place as expected. Moreover, we checked the correctness of the subtraction by introducing a lower cut (slicing parameter) on\nthe phase space variables, and observing that our results\nare independent of this cut (provided it is chosen small\nenough). This behaviour indicates that the subtraction\nterms ensure that the contribution of potentially singular\nregions of the final state phase space does not contribute\nto the numerical integrals, but is accounted for analytically. A detailed description of the calculation will be\ngiven elsewhere [32].\nThe resulting numerical programme, EERAD3, yields\nthe full kinematical information on a given multi-parton\nfinal state. It can thus be used to compute any infraredsafe observable related to three-particle final states at\nO(α3s ). As a first application, we present results for\nthe NNLO corrections to the thrust distribution here.\nLeaving aside numerically small pure singlet-corrections\n(which come from γ ∗ → ggg and related final states, and\nappear first at NNLO), the theoretical expression for the\nthrust distribution through to NNLO can be expressed by\nthree dimensionless coefficients (A, B, C), which depend\nonly on T and not on the scale of the process or on coupling constants and quark charges. These are obtained as\ncoefficients of the thrust distribution normalised to the\ntree-level cross section σ0 for e+ e− → q q̄, evaluated for\nαs = αs (Q), where Q is the centre-of-mass energy of the\nprocess:\n\u0010 α \u0011 dA \u0010 α \u00112 dB \u0010 α \u00113 dC\n1 dσ\ns\ns\ns\n=\n+\n+\n.\nσ0 dT\n2π dT\n2π\ndT\n2π\ndT\nThe experimentally measured thrust distribution\n1 dσ\nσhad dT\ncan then be expressed in terms of A, B, C by expanding\nσhad around σ0 . If the renormalisation scale of αs is\n\n\f(1-T) 1/σhad dσ/d T\n\n3\n0.5\nNNLO\n\n0.4\n\nNLO\nLO\n\n0.3\nQ = MZ\n\n0.2\n\nαs (MZ) = 0.1189\n\n0.1\n0\n\n0\n\n0.1\n\n0.2\n\n0.3\n\n0.4\n\n1-T\n\nδ (%)\n\nFIG. 1: Thrust distribution at Q = MZ .\n25\nNNLO\n\n20\n\nNLO\nLO\n\n15\n10\n\ninclusion of higher-order corrections stabilises the prediction, and the uncertainty δ is reduced by about 30%\nbetween NLO and NNLO. The increase in uncertainty\nabove 1 − T = 0.33 is due to the vanishing of the leading\norder contribution; the perturbative fixed-order description and its theoretical error become unreliable beyond\nthis point.\nIn Figure 3, we compare the theoretical NNLO prediction for the thrust distribution to experimental data from\nthe ALEPH experiment [34]. Similar measurements were\ncarried out by all LEP experiments [35]. The NNLO correction is positive and for the same value of αs , yields\na prediction that is larger than at NLO. This indicates\nthe need for an improved determination of αs from event\nshape data, which takes the newly computed NNLO corrections into account. Work on this is ongoing.\nIn this letter, we presented the first NNLO calculation of event shapes related to three-jet production\nin e+ e− annihilation. We developed a numerical pro-\n\n5\n0\n\n0\n\n0.1\n\n0.2\n\n0.3\n\n0.4\n\n10\n\n1-T\n\n10\n\nFIG. 2: Relative scale-uncertainty on thrust distribution at\ndifferent orders in perturbation theory.\n\nmaxμ (σ(μ)) − minμ (σ(μ))\nδ=\n2σ(μ = MZ )\nis displayed in Figure 2. It can be clearly seen how the\n\n-3\n\nQ = 206 GeV\n\n10\n10\n10\n\n-1\n-3\n\nQ = 200 GeV\n\n10\n10\n10\n\n-1\n-3\n\nQ = 189 GeV\n\n10\n10\n10\n\n1/σhad dσ/d T\n\nchosen to be μ 6= Q, additional terms proportional to\npowers of ln(μ2 /Q2 ) appear, which are again expressed\nin terms of A, B, C and of the coefficients of the QCD\nβ-function.\nIn the numerical evaluation, we use MZ =\n91.1876 GeV and αs (MZ ) = 0.1189 [8]. Figure 1 displays\nthe perturbative expression for the thrust distribution at\nLO, NLO and NNLO, evaluated for μ = Q = MZ . It\ncan be seen that inclusion of the NNLO corrections enhances the thrust distribution by around (15-20)% over\nthe range 0.03 < (1 − T ) < 0.33. Outside this range, one\ndoes not expect the perturbative fixed-order prediction\nto yield reliable results. For (1 − T ) > 0.33, the leadingorder prediction vanishes due to kinematical constraints\nfrom having only three partons in the final state; at NLO,\n(1 − T ) > 0.42 is kinematically forbidden, and the spherical limit T → 0.5 is reached only for infinitely many\npartons in the final state. For T → 0, the convergence of\nthe perturbative series is spoilt by powers of logarithms\nln(1 − T ) appearing in higher perturbative orders, thus\nnecessitating an all-order resummation of these logarithmic terms [3, 4], and a matching of fixed-order and resummed predictions [33].\nTo estimate the theoretical error inherent to the perturbative prediction, we vary the renormalisation scale in\nthe interval μ ∈ [MZ /2; 2 MZ ]. The relative uncertainty\nat each order\n\n10\n\n-1\n\n-1\n-3\n\nQ = 183 GeV\n\n10\n10\n10\n\n-1\n-3\n\nQ = 172 GeV\n\n10\n10\n10\n\n-1\n-3\n\nQ = 161 GeV\n\n10\n10\n10\n\n-1\n-3\n\nQ = 133 GeV\n\n10\n10\n10\n\nNNLO\nNLO\nLO\n\n-1\n-3\n\n0\n\nαs (MZ) = 0.1189\nQ = 91 GeV\n\n0.1\n\n0.2\n\n0.3\n\n0.4\n\n0.5\n\n1-T\nFIG. 3: NNLO thrust distribution compared to experimental\ndata from ALEPH [34].\n\n\f4\ngramme which can compute any infrared-safe observable\nthrough to O(α3s ), which we applied here to determine\nthe NNLO corrections to the thrust distribution. These\ncorrections are moderate, indicating the convergence of\nthe perturbative expansion. Their inclusion results in\na considerable reduction of the theoretical error on the\nthrust distribution. Our results will allow a significantly\n\nimproved determination of the strong coupling constant\nfrom jet observables.\nAcknowledgement: This research was supported in\npart by the Swiss National Science Foundation (SNF)\nunder contract 200020-109162, by the UK Science and\nTechnology Facilities Council and by the European Commission under contract MRTN-2006-035505 (Heptools).\n\n[1] R.K. Ellis, D.A. Ross and A.E. Terrano, Nucl. Phys. B\n178 (1981) 421.\n[2] Z. Kunszt, Phys. Lett. B 99 (1981) 429; J.A.M. Vermaseren, K.J.F. Gaemers and S.J. Oldham, Nucl. Phys.\nB 187 (1981) 301; K. Fabricius, I. Schmitt, G. Kramer\nand G. Schierholz, Z. Phys. C 11 (1981) 315; L. Clavelli\nand D. Wyler, Phys. Lett. B 103 (1981) 383.\n[3] S. Catani, G. Turnock, B.R. Webber and L. Trentadue,\nPhys. Lett. B 263 (1991) 491.\n[4] S. Catani, L. Trentadue, G. Turnock and B.R. Webber,\nNucl. Phys. B 407 (1993) 3.\n[5] G.P. Korchemsky and G. Sterman, Nucl. Phys. B 437\n(1995) 415; Y.L. Dokshitzer and B.R. Webber, Phys.\nLett. B 352 (1995) 451; 404 (1997) 321; Y.L. Dokshitzer,\nA. Lucenti, G. Marchesini and G.P. Salam, JHEP 9805\n(1998) 003.\n[6] O. Biebel, Phys. Rept. 340 (2001) 165; S. Kluth, Rept.\nProg. Phys. 69 (2006) 1771.\n[7] Z. Kunszt and P. Nason, in Z Physics at LEP 1, CERN\nYellow Report 89-08, Vol. 1, p. 373; S. Catani and\nM.H. Seymour, Phys. Lett. B 378 (1996) 287.\n[8] S. Bethke, Prog. Part. Nucl. Phys. 58 (2007) 351.\n[9] S. Brandt, C. Peyrou, R. Sosnowski and A. Wroblewski,\nPhys. Lett. 12 (1964) 57; E. Farhi, Phys. Rev. Lett. 39\n(1977) 1587.\n[10] L.W. Garland, T. Gehrmann, E.W.N. Glover, A. Koukoutsakis and E. Remiddi, Nucl. Phys. B 627 (2002) 107\nand 642 (2002) 227.\n[11] S. Moch, P. Uwer and S. Weinzierl, Phys. Rev. D 66\n(2002) 114001.\n[12] E.W.N. Glover and D.J. Miller, Phys. Lett. B 396\n(1997) 257; Z. Bern, L.J. Dixon, D.A. Kosower and\nS. Weinzierl, Nucl. Phys. B 489 (1997) 3; J.M. Campbell, E.W.N. Glover and D.J. Miller, Phys. Lett. B 409\n(1997) 503; Z. Bern, L.J. Dixon and D.A. Kosower, Nucl.\nPhys. B 513 (1998) 3.\n[13] K. Hagiwara and D. Zeppenfeld, Nucl. Phys. B 313\n(1989) 560; F.A. Berends, W.T. Giele and H. Kuijf,\nNucl. Phys. B 321 (1989) 39; N.K. Falck, D. Graudenz\nand G. Kramer, Nucl. Phys. B 328 (1989) 317.\n[14] F.V. Tkachov, Phys. Lett. B 100 (1981) 65; K. Chetyrkin\nand F.V. Tkachov, Nucl. Phys. B 192 (1981) 159.\n[15] T. Gehrmann and E. Remiddi, Nucl. Phys. B 580 (2000)\n485.\n[16] S. Laporta, Int. J. Mod. Phys. A 15 (2000) 5087.\n[17] T. Gehrmann and E. Remiddi, Nucl. Phys. B 601 (2001)\n248; 601 (2001) 287.\n[18] E. Remiddi and J.A.M. Vermaseren, Int. J. Mod. Phys. A\n15 (2000) 725; T. Gehrmann and E. Remiddi, Comput.\nPhys. Commun. 141 (2001) 296; 144 (2002) 200.\n\n[19] L.J. Dixon and A. Signer, Phys. Rev. Lett. 78 (1997)\n811; Phys. Rev. D 56 (1997) 4031; Z. Nagy and Z. Trocsanyi, Phys. Rev. Lett. 79 (1997) 3604; S. Weinzierl and\nD.A. Kosower, Phys. Rev. D 60 (1999) 054028.\n[20] J. Campbell, M.A. Cullen and E.W.N. Glover, Eur. Phys.\nJ. C 9 (1999) 245.\n[21] S. Catani, Phys. Lett. B 427 (1998) 161; G. Sterman and\nM.E. Tejeda-Yeomans, Phys. Lett. B 552 (2003) 48.\n[22] A. Gehrmann-De Ridder and E.W.N. Glover, Nucl. Phys.\nB 517 (1998) 269; J. Campbell and E.W.N. Glover, Nucl.\nPhys. B 527 (1998) 264; S. Catani and M. Grazzini,\nPhys. Lett. B 446 (1999) 143; Nucl. Phys. B 570 (2000)\n287; F.A. Berends and W.T. Giele, Nucl. Phys. B 313\n(1989) 595; V. Del Duca, A. Frizzo and F. Maltoni, Nucl.\nPhys. B 568 (2000) 211.\n[23] Z. Bern, L.J. Dixon, D.C. Dunbar and D.A. Kosower,\nNucl. Phys. B 425 (1994) 217; D.A. Kosower, Nucl. Phys.\nB 552 (1999) 319; D.A. Kosower and P. Uwer, Nucl.\nPhys. B 563 (1999) 477; Z. Bern, V. Del Duca and C.R.\nSchmidt, Phys. Lett. B 445 (1998) 168; Z. Bern, V. Del\nDuca, W.B. Kilgore and C.R. Schmidt, Phys. Rev. D 60\n(1999) 116001.\n[24] Z. Kunszt and D.E. Soper, Phys. Rev. D 46 (1992) 192;\nS. Frixione, Z. Kunszt and A. Signer, Nucl. Phys. B 467\n(1996) 399; S. Catani and M.H. Seymour, Nucl. Phys. B\n485 (1997) 291.\n[25] D.A. Kosower, Phys. Rev. D 57 (1998) 5410; 71 (2005)\n045016.\n[26] S. Catani and M. Grazzini, hep-ph/0703012.\n[27] A. Gehrmann-De Ridder, T. Gehrmann and E.W.N.\nGlover, JHEP 0509 (2005) 056.\n[28] A. Gehrmann-De Ridder, T. Gehrmann and E.W.N.\nGlover, Nucl. Phys. B 691 (2004) 195; Phys. Lett. B\n612 (2005) 36; 612 (2005) 49.\n[29] D.A. Kosower, Phys. Rev. D 67 (2003) 116003.\n[30] C. Anastasiou and K. Melnikov, Nucl. Phys. B 646\n(2002) 220.\n[31] A. Gehrmann-De Ridder, T. Gehrmann and G. Heinrich,\nNucl. Phys. B 682 (2004) 265.\n[32] A. Gehrmann-De Ridder, T. Gehrmann, E.W.N. Glover\nand G. Heinrich, in preparation.\n[33] R.W.L. Jones, M. Ford, G.P. Salam, H. Stenzel and\nD. Wicke, JHEP 0312 (2003) 007.\n[34] A. Heister et al. [ALEPH Collaboration], Eur. Phys. J.\nC 35 (2004) 457.\n[35] G. Abbiendi et al. [OPAL Collaboration], Eur. Phys. J.\nC 40 (2005) 287; P. Achard et al. [L3 Collaboration],\nPhys. Rept. 399 (2004) 71; J. Abdallah et al. [DELPHI\nCollaboration], Eur. Phys. J. C 29 (2003) 285.\n\n\f"}