{"id": "http://arxiv.org/abs/0803.2624v2", "guidislink": true, "updated": "2008-05-02T11:50:32Z", "updated_parsed": [2008, 5, 2, 11, 50, 32, 4, 123, 0], "published": "2008-03-18T14:03:09Z", "published_parsed": [2008, 3, 18, 14, 3, 9, 1, 78, 0], "title": "A Markov Process Inspired Cellular Automata Model of Road Traffic", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0803.1869%2C0803.1496%2C0803.0068%2C0803.0229%2C0803.0559%2C0803.2887%2C0803.1804%2C0803.0318%2C0803.2455%2C0803.0829%2C0803.0899%2C0803.3865%2C0803.1956%2C0803.2282%2C0803.1486%2C0803.3681%2C0803.2535%2C0803.1548%2C0803.0977%2C0803.4287%2C0803.2351%2C0803.3047%2C0803.0407%2C0803.0336%2C0803.0055%2C0803.1140%2C0803.3556%2C0803.2984%2C0803.0751%2C0803.2426%2C0803.1902%2C0803.2446%2C0803.2564%2C0803.0786%2C0803.0395%2C0803.1192%2C0803.2624%2C0803.4050%2C0803.3447%2C0803.2991%2C0803.2481%2C0803.4366%2C0803.1152%2C0803.3308%2C0803.0564%2C0803.3908%2C0803.0021%2C0803.2102%2C0803.2702%2C0803.0994%2C0803.4286%2C0803.0270%2C0803.1278%2C0803.1319%2C0803.0154%2C0803.1886%2C0803.1014%2C0803.3795%2C0803.2437%2C0803.0548%2C0803.3747%2C0803.2550%2C0803.1469%2C0803.4363%2C0803.4456%2C0803.1246%2C0803.1959%2C0803.2483%2C0803.2306%2C0803.1432%2C0803.0706%2C0803.1524%2C0803.0199%2C0803.3109%2C0803.0972%2C0803.0692%2C0803.4009%2C0803.1409%2C0803.1328%2C0803.2007%2C0803.4464%2C0803.1967%2C0803.4439%2C0803.0194%2C0803.4511%2C0803.2968%2C0803.2037%2C0803.2791%2C0803.0773%2C0803.3336%2C0803.2187%2C0803.0128%2C0803.3913%2C0803.2141%2C0803.1017%2C0803.1589%2C0803.1905%2C0803.0629%2C0803.2580%2C0803.3413%2C0803.4030&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "A Markov Process Inspired Cellular Automata Model of Road Traffic"}, "summary": "To provide a more accurate description of the driving behaviors in vehicle\nqueues, a namely Markov-Gap cellular automata model is proposed in this paper.\nIt views the variation of the gap between two consequent vehicles as a Markov\nprocess whose stationary distribution corresponds to the observed distribution\nof practical gaps. The multiformity of this Markov process provides the model\nenough flexibility to describe various driving behaviors. Two examples are\ngiven to show how to specialize it for different scenarios: usually mentioned\nflows on freeways and start-up flows at signalized intersections. The agreement\nbetween the empirical observations and the simulation results suggests the\nsoundness of this new approach.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0803.1869%2C0803.1496%2C0803.0068%2C0803.0229%2C0803.0559%2C0803.2887%2C0803.1804%2C0803.0318%2C0803.2455%2C0803.0829%2C0803.0899%2C0803.3865%2C0803.1956%2C0803.2282%2C0803.1486%2C0803.3681%2C0803.2535%2C0803.1548%2C0803.0977%2C0803.4287%2C0803.2351%2C0803.3047%2C0803.0407%2C0803.0336%2C0803.0055%2C0803.1140%2C0803.3556%2C0803.2984%2C0803.0751%2C0803.2426%2C0803.1902%2C0803.2446%2C0803.2564%2C0803.0786%2C0803.0395%2C0803.1192%2C0803.2624%2C0803.4050%2C0803.3447%2C0803.2991%2C0803.2481%2C0803.4366%2C0803.1152%2C0803.3308%2C0803.0564%2C0803.3908%2C0803.0021%2C0803.2102%2C0803.2702%2C0803.0994%2C0803.4286%2C0803.0270%2C0803.1278%2C0803.1319%2C0803.0154%2C0803.1886%2C0803.1014%2C0803.3795%2C0803.2437%2C0803.0548%2C0803.3747%2C0803.2550%2C0803.1469%2C0803.4363%2C0803.4456%2C0803.1246%2C0803.1959%2C0803.2483%2C0803.2306%2C0803.1432%2C0803.0706%2C0803.1524%2C0803.0199%2C0803.3109%2C0803.0972%2C0803.0692%2C0803.4009%2C0803.1409%2C0803.1328%2C0803.2007%2C0803.4464%2C0803.1967%2C0803.4439%2C0803.0194%2C0803.4511%2C0803.2968%2C0803.2037%2C0803.2791%2C0803.0773%2C0803.3336%2C0803.2187%2C0803.0128%2C0803.3913%2C0803.2141%2C0803.1017%2C0803.1589%2C0803.1905%2C0803.0629%2C0803.2580%2C0803.3413%2C0803.4030&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "To provide a more accurate description of the driving behaviors in vehicle\nqueues, a namely Markov-Gap cellular automata model is proposed in this paper.\nIt views the variation of the gap between two consequent vehicles as a Markov\nprocess whose stationary distribution corresponds to the observed distribution\nof practical gaps. The multiformity of this Markov process provides the model\nenough flexibility to describe various driving behaviors. Two examples are\ngiven to show how to specialize it for different scenarios: usually mentioned\nflows on freeways and start-up flows at signalized intersections. The agreement\nbetween the empirical observations and the simulation results suggests the\nsoundness of this new approach."}, "authors": ["Fa Wang", "Li Li", "Jianming Hu", "Yan Ji", "Danya Yao", "Yi Zhang", "Xuexiang Jin", "Yuelong Su", "Zheng Wei"], "author_detail": {"name": "Zheng Wei"}, "author": "Zheng Wei", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1142/S0129183109013509", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0803.2624v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0803.2624v2", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "revised according to the helpful comments from the anonymous\n  reviewers", "arxiv_primary_category": {"term": "physics.data-an", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "physics.data-an", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0803.2624v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0803.2624v2", "journal_reference": "International Journal of Modern Physics C, Volume 20, Issue 01,\n  pp. 117-131 (2009).", "doi": "10.1142/S0129183109013509", "fulltext": "Submitted to Physical Review E, 2008\n\nA Markov Process Inspired Cellular Automata Model of\nDeparture Headways\n\narXiv:0803.2624v2 [physics.data-an] 2 May 2008\n\nFa Wang, Li Li, Jianming Hu, Yan Ji, Danya Yao,\nYi Zhang, Xuexiang Jin, Yuelong Su, Zheng Wei∗\n(Dated: received: March 18, 2008; revised: November 4, 2018)\n\nAbstract\nTo provide a more accurate description of the driving behaviors in vehicle queues, a namely\nMarkov-Gap cellular automata model is proposed in this paper. It views the variation of the gap\nbetween two consequent vehicles as a Markov process whose stationary distribution corresponds to\nthe observed distribution of practical gaps. The multiformity of this Markov process provides the\nmodel enough flexibility to describe various driving behaviors. Two examples are given to show\nhow to specialize it for different scenarios: usually mentioned flows on freeways and start-up flows\nat signalized intersections. The agreement between the empirical observations and the simulation\nresults suggests the soundness of this new approach.\nPACS numbers: 02.50.-r,45.70.Vn,89.40.-a,\n\n∗\n\nDepartment of Automation,\n\nTsinghua University,\n\nli-li@mail.tsinghua.edu.cn\n\n1\n\nBeijing China 100084;\n\nElectronic address:\n\n\fI.\n\nINTRODUCTION\n\nTraffic flow is a many-body system of strongly interacting vehicles. Various models are\npresented to understand the observed rich variety of physical phenomena exhibited by traffic\nflow [1], [2], [3]. From the viewpoint of vehicles' queuing dynamics, these models generally\ndepict four kinds of traffic flows: 1) static queues (e.g. vehicles parked on a line [4], [5],\n[6], [7], and vehicle queues fully-stopped in front of signalized intersections [8]), 2) stable\nmoving queues (vehicle platoons) which includes the well-known Kerner's synchronized flow\nand wide-moving jams [9], 3) free-flows formulating no explicit queues, and 4) unstable\nqueues which contains complex inter-arrival and inter-departure queuing interactions [10],\n[11].\nThe queues with complex interactions between its elements attract increasing attentions\nrecently. In many known approaches, the dynamics of flows are described on N stronglylinked particles under fluctuations [2], [3]. Since the governing interaction forces or potentials\nare not directly measurable for traffic flow applications, the statistical distributions of particles are often investigated instead. For example, the important phase transition phenomena\nof traffic flow were studied by using scattering theory in [10], [12]. Differently in [13], random\nmatrix theory was applied to predict the space-gap distribution between vehicles in threephrase flows. However, these studies focus on the steady-state statistics. Two questions\nthus arise as: 1) can we design microscopic simulation models (e.g. car-following, cellular\nautomata) that meanwhile yields such statistical properties; 2) how to depict the transientstate statistics of inter-arrival and inter-departure queuing interactions. This paper aims to\npropose a simple yet useful CA model to partly answer these two questions.\nIn the field of traffic flow modeling, cellular automata (CA) based microscopic traffic\nsimulation has received constant interests in the last decade, because of its efficiency on fast\nsimulation and ability to imitate the driving behaviors to explain some complex phenomena\n[14]. However, many CA models are designed to study the phase transitions of traffic flow\nonly, i.e. [15], [16]. The rather low accuracy on vehicles' velocity and acceleration, which is\nuseful in computer implementations, prevents them to incorporate further more features.\nTo deal with this problem, a new CA model is proposed in this paper. It models the\nvariation of the gap between two consequent vehicles as Markov process, whose stationary\ndistribution can be designed to reflect the distribution of empirical gap data. Because it is\n2\n\n\fa dynamic model, it can simulate the inter-arrival and inter-departure queuing interactions,\ntoo. Moreover, the velocity adjusting rule can be gotten in a concise and unified way, which\ncontains no intractable formulations and fits for fast simulations.\nTo prove its soundness, this general model is specialized to explain the interesting phenomena of traffic breakdown of freeway traffic flow and departure headways at signalized\nintersections. The agreement between the empirical and simulation results indicates that\nthis new model approvingly reveals the implicit interactions between queuing vehicles. The\nresults also prove the statement given in [10] that the interdeparture time statistics is dominated by spatial interactions among the elements in a queue rather than the arrival or exit\nprocesses for a relatively long queue.\n\nII.\n\nTHE MARKOV-GAP CA MODEL\n\nThe model proposed here is a multi-cell CA model on a unidirectional, single-lane lattice,\nin which a vehicle is allowed to span a number of consecutive cells in the longitudinal\ndirection; see Fig. 1. Multi-cell type is chosen here for modeling the possible small gaps\nduring slow moving scenarios.\n\nlengthi \u000e1\n\ngapi \u000e1 (t )\n\nlengthi\n\nFIG. 1: Diagram of the mutil-cell CA model.\n\nUsually, CA models of road traffic contain two modes: free-driving mode, following/\nbraking mode. In the following/braking mode, a driver adjusts his/her vehicle to keep an as\nclose as possible but not too close distance gap. Due to various reasons (inability to predict\nthe leader's action or make precise driving actions, possibility to be absent minded, etc.),\nhe/she cannot maintain a constant gap. Suppose altogether we have N possible gaps whose\nlengthes range from 0 cell to (N − 1) cells. If at time t, the length of the gap is n; at the\nnext time (t + 1), the length may still remain n, or possibly change to an adjacent value,\ni.e. (n − 1), (n + 1), etc.\n3\n\n\fAbstractly, this variation process of a gap during following can be viewed as a transferring\nprocess between N states, where each state denotes a distinct gap in length. Statistically,\nconsidering the relatively long-time driving behaviors of many drivers, the transferring probability from state i to j would approach a steady value. That is, the drivers' car-following\nactions can be depicted by a Markov Chain characterizing the variation process of gap. To\nour best knowledge, only [17] proposed a state-transition model similar to this model in a\nvague way, but it does not mention the Markov transferring probability.\nNotice that the above Markov Chain is positive recurrent and aperiodic, it yields a steadystate (stationary) distribution, which straightforwardly corresponds to the empirical distributions of gap distance in traffic flow applications [18], [19]. This makes the model able to\nyield expected statistical features on gap/headways.\nIndeed, it is not required to discretize the steady-state distribution into the minimal\ndivision level (the length of a cell here), because to consider too many transition states\nwould be unnecessary and time consuming. In this paper, the so called Markov Chain\nAggregation technique used in [20], [21], [22] is employed to combine some neighboring\nstates and thus simplify transition matrix. Without losing much generality, we can further\nassume that a state (may span a number of consecutive cells) can only transfer to itself or\nthe strictly neighboring state (noticing the simulation time span is usually short and the\nspeed is limited, this assumption is reasonable). Thus, the transition matrix of the Markov\nChain can be written into a tridiagonal matrix as:\n\n\n r0\n\n p1\n\n\n 0\n\n ..\n .\n\n0\n\nq0\n\n0\n\n0\n\n***\n\nr1 q1 0\n\n***\n\np2 r2 q2\n\n\n\n0 \n\n0 \n\n.. \n. \n\n.. \n. \n\n\n(1)\n\n* * * * * * 0 pn−1 rn−1\n\nwhere pi , ri , qi are the probabilities that transfer from state i to the lower, current and\nhigher states, respectively.\nLet p0 = qn−1 = 0, we have\npi + ri + qi = 1\nfor i ∈ {0, 1, ..., N − 1}.\n4\n\n(2)\n\n\fAs well known, there exist numerous solutions for the potential transition matrix (1).\nClearly any a valid solution could be used for simulation, but we generally have two more\nrequirements for constructing Markov Chain for simulations: 1) lower time complexity of the\nformulation algorithm; and 2) faster convergency speed of the obtained Markov Chain, since\nit determines how many rounds of simulations are needed before drawing a satisfactory\nconclusion [20], [23]. To meet these two requirements, we can formulate such a matrix\nconstruction problem into a Semidefinite Programming (SDP) problem (e.g. SDP-(19) in\n[24]), which is easy to solve. In the rest of this paper, let's assume the associated transition\nmatrices (1) have already been obtained, since how to derive such a matrix does not accord\nwith the main theme here.\nSuppose the gap between the (i − 1)th and ith vehicle is in the nth state at time t, which\nindicates that the gap of the ith vehicle satisfies gi (t) ∈ [gnlow , gnup ]. Here, gnlow and gnup denote\nthe lower and upper boundaries of the nth state, respectively.\nBased on the above Markov transition idea, the gap might be enlarged into the (n + 1)th\nstate with probability qn due to deceleration. In the simulation, an arbitrary random number\n+\ngf\n(t+1) will be uniformly generated in [g low , g up ] and assigned as the potential forthcoming\nn+1\n\ni\n\nn+1\n\ngap. And the expected velocity vi of the ith vehicle at time (t + T ) should be\n−\n+\nf\nvf\ni (t + T ) = vi−1 (t) − [gi (t) − gi (t)]/T\n\n(3)\n\nSimilarly, when acceleration, the velocity should be adjusted as\n\nup\n−\nlow\nwhere gf\ni (t) ∈ [gn−1 , gn−1 ].\n\n+\n−\nf\nvf\ni (t + T ) = vi−1 (t) − [gi (t) − gi (t)]/T\n\n(4)\n\nNoticing most CA models of road traffic consists of an accelerating rule to make the\n\nvehicle approach the highest possible speed and a braking rule to avoid collisions, we can\nsimilarly write the whole updating rules as:\n1) If gi (t) > Gmax , where Gmax denotes the maximum coupling distance; the vehicle is in\nfree-driving scheme, then it will approach the highest velocity as\nvi (t + T ) = min{vi (t) + a+\nmax × T, vmax }\n\n5\n\n(5)\n\n\fElse if vi (t) −vi−1 (t) > [gi (t) −G]/H, there exists a risk to collide, and thus let the vehicle\nbrake\n\nvi (t + T ) = vi (t) − D × T\n\n(6)\n\nwhere G, H and D are constants denoting the minimum safety gap, deceleration time and\nbraking decelerating rate, respectively.\nOtherwise, the velocity of the vehicle is updated as follows, where the max, min functions\nare added to guarantee that the velocity and ac/decelerating rates are within the limits.\n\nvi (t + T ) =\n\n\n+\n\nf\n\nmin{vi (t) + a+\n\nmax × T, vi (t + T ), vmax } , with pn\n\nvi (t)\n\n\n\n max{vi (t) − a−\n\n, with rn\n\nmax\n\n−\n× T, vf\ni (t + T ), 0}\n\n(7)\n\n, with qn\n\n2) The position of vehicle is then updated as\n\nxi (t + T ) = xi (t) + vi (t) × T\n\n(8)\n\nSimulations show that the multiformity of this Markov process provides the model enough\nflexibility to describe diversified driving behaviors. The transferring matrix can be explicitly determined by the investigation data from drivers or implicitly estimated through the\nobserved distribution of gap.\nHowever, the above model should not be directly applied, if the velocity of vehicles varies\nin a relatively large range. This is primely because drivers would like to keep a roughly\nconstant time headway instead of gap distance. (As shown in [6], [13], the time-headway\ndistributions computed for the free-flow, synchronized flow, and moving jam traffic phases\ndo not differ too much in shape and mean values.) Usually, the larger the velocity is, the\nlarger the gap distance should be. Thus, the aforementioned transition matrix (1)) should\nbe modified to be velocity-dependent in such situations. Examples of implementing this\ntrick will be shown in the coming sections.\n\nIII.\n\nA SPECIALIZATION FOR FLOWS ON FREEWAYS\n\nTo illustrate the effectiveness of the proposed model, a specialized form is used to reproduce spontaneous traffic breakdowns and moving jams that have been observed for flows\n6\n\n\fon freeways. The velocity of a vehicle may vary significantly in such situations. However,\nto assign a Markov matrix (1) for each velocity (more precisely to make the model into a\ntime-dependent continuous time Markov process) is troublesome for fast simulations; thus\nthe aggregation idea is used again.\nSuppose we only consider J Markov Chains, each of which corresponds to a certain range\nof velocity. When the velocity of the ith vehicle vi (t) fall into the jth velocity range at time\nt, we will apply the jth Markov transition matrix in velocity updating. In the following\nsimulation, five transition matrices are designed (in a sense to the five speed stages of a car);\nsee Fig. 2. All the five distributions are uniformly discretized histogram (5 segments, 3.3m\nper segment for velocity range [0, 9]; 4 segments, 4.1m per segment for velocity range [9, 18];\nand 3 segment, 5.5m per segment for the rests). The discretized stationary distributions are\nassigned as Table. I with respect to the practical observations [10], [11], [13]. The associated\n\nProbability\n\nvmax in (5) and (7) are also set the 9m/s, 18m/s, ..., for each range respectively.\n\n9\n18\n\n(m/s)\n\n27\n36\n45\n0\n\n7\n\n14\n\n21\n\n28\n\n35\n\n42\n\n49\n\n56\n\nGap\n\n(m)\n\nFIG. 2: The assumed discretized steady-state gap distributions according to different velocities.\n\nHere, the length of each cell is set as 0.1m. The length of each vehicle is uniformly set\nas 4m. The maximum coupling distance between two consecutive vehicles is set as 52.5m,\nwhich means the follower will enter free navigation mode if the gap to its leader is greater\nthan 52.5m.\nThe velocity is updated once T = 1s. The maximum velocity of a vehicle is set to vmax =\n2\n45m/s, the maximum accelerating rate is a+\nmax = 7.5m/s , and the maximum decelerating\n\n7\n\n\fTABLE I: The discretized gap distributions according to different velocities.\nIndex\n\nVelocity range(m/s)\n\nGap range(m)\n\nProbability in each segment\n\n1\n\n[0,9]\n\n[0.5,17]\n\n[0.10,0.35,0.32,0.20,0.03]\n\n2\n\n[9,18]\n\n[9,25.5]\n\n[0.30,0.33,0.28,0.09]\n\n3\n\n[18,27]\n\n[18,34.5]\n\n[0.42,0.45,0.13]\n\n4\n\n[27,36]\n\n[27,43.5]\n\n[0.41,0.0.45,0.14]\n\n5\n\n[36,54]\n\n[36,52.5]\n\n[0.41,0.43,0.16]\n\n2\nrate is a−\nmax = 15m/s . A fully stopped vehicle will start to move only if the gap ahead is\n\ngreater than 2.2m. And the braking parameters are set as G = 0.5m, H = 7s, D = 15m/s2 .\n\n45\nlocal measurement\ngloble measurement\n\nGlobal space−mean velocity (m/s)\n\n40\n35\n30\n25\n20\n15\n10\n5\n0\n\n0\n\n500\n\n1000\n1500\n2000\nGlobal density (veh/K )\n\n2500\n\n3000\n\ng\n\nFIG. 3: The (k, v̄s ) diagram for the proposed model, obtained by local and global measurements.\n\nFig. 3 and Fig. 4 show the (k, v̄s ) and (k, q) diagrams for the proposed model, obtained\nby local and global measurements. These microscopic traffic stream characteristics are\nmeasured according to [14]. Here, Kg denotes the length of the closed single-lane system,\nwhich is 27000m. It can be seen from Fig. 3 that the local measurements interestingly tend\nto form clusters around certain space-mean velocities, which corresponds to the so called\noptimal velocities predicated in [25], [26], [27]. These clusters appear as branches in Fig. 4,\n8\n\n\f0.8\nlocal measurement\ngloble measurement\n0.7\n\nGlobal flow (veh/s)\n\n0.6\n\n0.5\n\n0.4\n\n0.3\n\n0.2\n\n0.1\n\n0\n\n500\n\n1000\n1500\n2000\nGlobal density (veh/Kg)\n\n2500\n\n3000\n\nFIG. 4: The (k, q) diagram for the proposed model, obtained by local and global measurements.\n\ntoo. This indicates that the most important merit of the optimal velocity models has been\ninherited by the proposed model, though via a different interpretation of the dynamical\nequilibrium between traffic flow velocity and density. Moreover, it yields the right headway\ndistribution as observed other than that given in Fig.7 of [25].\nBesides, the local measurements in Fig. 4 also discriminate Kerner's three-phase flows:\nthe free-flow regime contains only a few data points on line starts from the original point;\nthe synchronized regime is visible as a wide scatter of the data points, having various speeds\nbut relatively high flows; and synchronized-flow, and jammed regimes contains the data\npoints in the wide-moving jam correspond to Kerner's line J. Thus, the proposed model\ncan reproduce the traffic phenomena of phase transitions formation observed in real traffic.\nIt should be pointed out that the highest flow rate of the proposed model is larger than\nthat of NaSch model [15], mainly because of the different settings of vehicle's length.\n\n9\n\n\fIV.\n\nANOTHER SPECIALIZATION FOR START-UP FLOW AT SIGNALIZED IN-\n\nTERSECTIONS\n\nAnother specialization is proposed in this section to explain the distributions of the\nobserved departure headway. Results indicate that the proposed model can also depict the\ntransient-state statistics of unstable queues.\nDeparture headways are usually defined as the times that elapse between consecutive\nvehicles when vehicles in a queue start crossing the stop line (or any other reference line)\nat a signalized intersection after the light turns green. Modeling departure headways at signalized intersections attracts constant research efforts due to its importance. Most previous\nworks focus on the mean departure headways of the first tens of vehicles. The results show\nthat the headways tend to decrease sequentially as queue position increases, and a steady\nheadway will be reached since the fourth or the fifth vehicle, i.e. [18], [19], [28]. Further\ninvestigations shows that each of these departure headways follows a log-normal distribution\n(whose logarithm is normally distributed) respectively and their mean values decrease to a\nsaturation value gradually [29], [30]; see Fig. 5.\nOnly the movements of the first few vehicles, which are fully stopped when the light\nturns green, are recorded and examined. The vehicles whose length is too long (more than\n10m) are discarded as well as their following vehicles. The sample sizes decrease according\nto the positions due to this data pre-processing process. The statistics of the observed\ndeparture headways are listed in Table. II. Kolmogorov-Smirnov (K-S) hypothesis test is\nused here to check whether the empirical distributions are similar to the estimated lognormal distributions, and Jarque-Bera (J-B) hypothesis test is used to check the departure\nof the distribution of empirical headways' logarithm from normality [31]. The criteria level\nis set as 95%, which means the hypothesis will be accepted if the value is greater than 0.05.\nBy specializing the above Markov-Gap CA model, we can give a explanation of such\nphenomena. Here, the length of each cell is set as 0.1m. The length of each vehicle is still\n4m. Here, only four transition matrices are designed; see Fig. 6. All the four distributions are\nuniformly discretized into 9 states (9 segments, 2m per segment) discretized histogram. If\nthe velocity of a vehicle lies in [0, 4]m/s, then the gap variation process is assumed to follows\nthe log-normal distribution with mean 1.9 and stand deviation 0.8. After discretizing, the\nallowable gap range is divided into 9 monospaced states between 2m to 20m. Similarly, we\n10\n\n\fheadway2\nheadway3\nheadway4\nheadway5\nheadway6\nheadway7\nheadway8\nheadway9\n\n0.8\n0.7\n0.6\n\nDensity\n\n0.5\n0.4\n0.3\n0.2\n0.1\n0\n\n1\n\n1.5\n\n2\n\n2.5\n3\n3.5\nTime headway (s)\n\n4\n\n4.5\n\n5\n\nFIG. 5: The empirical distributions of departure headways identified from the histograms observed.\nThe departure headway data used here are collected from several intersections in Beijing, China\nduring 2006 to 2007 by using video cameras. The recording time is from 9:00 AM to 10:00 AM,\nwhen the traffic flow is not too crowded. The queuing length does not grow so long (typically 5 ∼ 9\nvehicles) in this period.\n\nhave the other settings as shown in Table. III. The maximum coupling distance between\ntwo consecutive vehicles is set as 27m.\nThe initial gaps of the vehicles are assigned as random numbers following a normal\ndistribution (μinitgap = 1.7m, σinitgap = 0.1). The velocity is updated once T = 0.50 ∼ 0.70s\nrandomly, because human drivers usually cannot make decision or take action in a too short\ntime). The maximum velocity of a vehicle is set to vmax = 16m/s here, and the maximum\n−\n2\nac/decelerating rate is a+\nmax = amax = 6m/s . And the braking parameters are set as\n\nG = 0.5m, H = 12.5s, D = 6m/s2 .\nBefore the simulation, all the vehicles are fully stopped. And the departure of a vehicle\nstarts one by one (a vehicle will start to move only if the gap ahead is greater than 2.2m).\nThe first vehicle will steadily accelerate to 16m/s in the 16s (accelerating rate 1m/s2 ) and\nthen keep this speed.\n\n11\n\n\fTABLE II: The Kolmogorov-Smirnov (K-S) and Jarque-Bera (J-B) hypothesis testing results of\nempirical departure headways. μ and σ denote the mean and standard deviation of the logarithm\nof data respectively.\nSample size\n\nK-S test\n\nJ-B test\n\nμ\n\nσ\n\n2\n\n423\n\n0.4282\n\n0.2730\n\n1.0569\n\n0.3353\n\n3\n\n423\n\n0.3788\n\n0.3089\n\n0.9639\n\n0.3210\n\n4\n\n422\n\n0.1684\n\n0.3028\n\n0.8920\n\n0.3171\n\n5\n\n416\n\n0.3050\n\n0.3157\n\n0.8701\n\n0.3163\n\n6\n\n394\n\n0.4635\n\n0.3657\n\n0.8089\n\n0.3127\n\n7\n\n298\n\n0.3261\n\n0.1849\n\n0.7372\n\n0.2991\n\n8\n\n146\n\n0.8587\n\n0.1060\n\n0.6670\n\n0.2996\n\n9\n\n42\n\n0.8544\n\n0.5000\n\n0.5849\n\n0.2945\n\nProbability\n\nPostion\n\n4\n\n(m/s)\n\n8\n12\n\n16\n0\n\n3\n\n6\n\n9\n\n12\n\n15\n\n18\n\n21\n\n24\n\n27\n\nGap\n\n(m)\n\nFIG. 6: The assumed discretized steady-state gap distributions according to different velocities.\n\nResults below show that the resulting mean departure headways (400 rounds of simulations for several times) following a similar but faster decreasing pattern to the empirical\nones; see Fig. 7. The statistics of a set of simulated departure headways are given in Table. IV (the criteria level is still 95%). The simulated headways do not decrease exactly\nlike empirical ones, partly because: 1) the empirical samples for the last few positions are\nlimited and may be biased, 2) the simple braking rule (5) is still not accurate enough to\ndepict the real tracking dynamics. More efforts will be put into here for better concordance\n\n12\n\n\fTABLE III: The designed discretized log-normal type gap distributions according to different velocities. μ̄ and σ̄ denote the mean and standard deviation of the logarithm of data respectively.\nIndex\n\nVelocity range(m/s)\n\nGap range(m)\n\nμ̄\n\nσ̄\n\n1\n\n[0,4]\n\n[2,20]\n\n1.9\n\n0.8\n\n2\n\n[4,8]\n\n[4,22]\n\n2.2\n\n0.7\n\n3\n\n[8,12]\n\n[7,25]\n\n2.5\n\n0.5\n\n4\n\n[12,16]\n\n[9,27]\n\n2.7\n\n0.45\n\nbetween the empirical and simulated data. However, it is apparent that this model captures\nthe main features of the driving behaviors in a discharging queue and therefore yields an\naccordant macroscopic statistic result through a minimal description of their microscopic\ninteractions.\n\nheadway 2\nheadway 3\nheadway 4\nheadway 5\nheadway 6\nheadway 7\nheadway 8\nheadway 9\n\n0.8\n0.7\n0.6\n\nDensity\n\n0.5\n0.4\n0.3\n0.2\n0.1\n0\n\n1\n\n1.5\n\n2\n\n2.5\n3\n3.5\nTime headway (s)\n\n4\n\n4.5\n\n5\n\nFIG. 7: The distributions of a typical set of departure headways identified from the histograms\nobtained in simulation\n\nFurther simulations also reveal that:\n1) The general shapes of the simulated departure headways distributions will be roughly\nkept according to different aggregation ratio, unless the number of states is too small. This\n13\n\n\fTABLE IV: The Kolmogorov-Smirnov (K-S) and Jarque-Bera (J-B) hypothesis testing results of\na typical set of simulated departure headwaysμ̂ and σ̂ denote the mean and standard deviation of\nthe logarithm of data respectively.\nPostion\n\nSample size\n\nK-S test\n\nJ-B test\n\nμ̂\n\nσ̂\n\n2\n\n400\n\n0.7525\n\n0.0325\n\n0.9623\n\n0.2993\n\n3\n\n400\n\n0.3678\n\n0.0501\n\n0.8540\n\n0.3211\n\n4\n\n400\n\n0.6651\n\n0.0706\n\n0.8283\n\n0.3268\n\n5\n\n400\n\n0.5992\n\n0.2564\n\n0.7336\n\n0.3104\n\n6\n\n400\n\n0.7980\n\n0.3834\n\n0.6992\n\n0.3035\n\n7\n\n400\n\n0.8780\n\n0.1100\n\n0.6413\n\n0.2726\n\n8\n\n400\n\n0.6681\n\n0.7080\n\n0.6520\n\n0.2673\n\n9\n\n400\n\n0.0912\n\n0.1979\n\n0.6265\n\n0.2595\n\nproves the Markov Chain Aggregation technique in (1) is applicable.\n2) The variation trend of mean departure headways is not very sensitive to the initial\npositions and velocities of the vehicles, which fits the facts observed.\n\nAcknowledgments\n\nThis work was supported in part by National Basic Research Program of China\n(973 Project) 2006CB705506, Hi-Tech Research and Development Program of China (863\nProject) 2006AA11Z208, and National Natural Science Foundation of China 50708055.\n\n[1] D. Chowdhury, L. Santen, A. Schadschneider, Phys. Rep. 329, 199 (2000).\n[2] D. Helbing, Rev. Mod. Phys. 73, 1067 (2001).\n[3] R. Mahnke, J. Kaupuzs, I. Lubashevsky, Phys. Rep. 408, 1 (2005).\n[4] J. W. Lee, Physica A 331, 531 (2004).\n[5] S. Rawal, G. J. Rodgers, Physica A 346, 621 (2005).\n[6] B. S. Kerner, S. L. Klenov, A. Hiller, and H. Rehborn, Phys. Rev. E 73, 046107 (2006).\n[7] A.Y. Abul-Magd, Physica A 368, 536 (2006).\n\n14\n\n\f[8] X. Jin, Y. Su, Y. Zhang, L. Li, arXiv:0803.2619\n[9] B. S. Kerner, The Physics of Traffic (Springer, Heidelberg, 2004).\n[10] D. Helbing, M. Treiber, A. Kesting, Physica A 36, 62 (2006).\n[11] M. Schonhof, D. Helbing, Transp. Sci. 41, 135 (2007).\n[12] M. Krbalek, D. Helbing, Physica A 333, 370 (2004).\n[13] A. Y. Abul-Magd, Phys. Rev. E 76, 057101 (2007).\n[14] S. Maerivoet, B. De Moor, Phys. Rep. 419, 1 (2005).\n[15] K. Nagel, M. Schreckenberg, J. Phys. I 2, 2221 (1992).\n[16] D. Helbing, M. Schreckenberg, Phys. Rev. E 59, 2505 (1999).\n[17] B. Son, T. Kim, T. Lee, in Lecture Notes in Computer Science 3481, 863 (2005).\n[18] R. T. Luttinen, Transp. Res. Rec. 1365, 92 (1992).\n[19] P. G. Michael, F. C. Leeming, W. O. Dwyer, Transp. Res. F, 3, 55 (2000).\n[20] W. J. Stewart, Introduction to the Numerical Solution of Markov Chains, (Princeton University Press, Priceton, 1994).\n[21] W. M. Spears, in Proceedings of the Congress on Evolutionary Computation, (1999).\n[22] G. Bolch, S. Greiner, H. de Meer, K. S. Trivedi, H. de Meer, K. S. Trivedi, Queueing Networks and Markov Chains: Modeling and Performance Evaluation with Computer Science\nApplications, 2nd ed., (John Wiley and Sons, 2006).\n[23] S. P. Meyn, R. L. Tweedie, Markov Chains and Stochastic Stability, (Springer-Verlag, New\nYork, 1993).\n[24] S. Boyd, P. Diaconis, and L. Xiao, SIAM Review 46, 667 (2004).\n[25] M. Bando, K. Hasebe, A. Nakayama, A. Shibata, Y. Sugiyama, Phys. Rev. E, 51, 1035 (1995).\n[26] D. Helbing, B. Tilch, Phys. Rev. E 58, 133 (1998).\n[27] R. Jiang, Q. S. Wu, Z. J. Zhu, Phys. Rev. E 64, 017101 (2001).\n[28] Y. Chang, P. Zhang, L. Mao, Z. Gong, in Proceedings of Traffic and Granular Flow 05, (2005).\n[29] L. Li, F. Wang, in Lecture Notes in Computer Science 4153, 105 (2006).\n[30] Y. Su, Z. Wei, S. Cheng, D. Yao, Y. Zhang, L. Li, Z. Zhang, Z. Li, in Transportation Research\nBoard Annual Meeting CD, (2008).\n[31] C. W. Gardiner, Handbook of Stochastic Methods for Physics, Chemistry and the Natural\nSciences, (Springer-Verlag, New York, 1983).\n\n15\n\n\f"}