{"id": "http://arxiv.org/abs/1003.4215v2", "guidislink": true, "updated": "2010-03-23T22:10:45Z", "updated_parsed": [2010, 3, 23, 22, 10, 45, 1, 82, 0], "published": "2010-03-22T17:03:17Z", "published_parsed": [2010, 3, 22, 17, 3, 17, 0, 81, 0], "title": "Point Charge Dynamics Near a Grounded Conducting Plane", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1003.5347%2C1003.2179%2C1003.1114%2C1003.2742%2C1003.1391%2C1003.6011%2C1003.1941%2C1003.1222%2C1003.1845%2C1003.3567%2C1003.1247%2C1003.4797%2C1003.5019%2C1003.4392%2C1003.3767%2C1003.3698%2C1003.1145%2C1003.0015%2C1003.0007%2C1003.2290%2C1003.6031%2C1003.2585%2C1003.5882%2C1003.6019%2C1003.3953%2C1003.5825%2C1003.0986%2C1003.0849%2C1003.3362%2C1003.2890%2C1003.0121%2C1003.3662%2C1003.3328%2C1003.5392%2C1003.2852%2C1003.5874%2C1003.5384%2C1003.5868%2C1003.1969%2C1003.3281%2C1003.3121%2C1003.4820%2C1003.2911%2C1003.3745%2C1003.1369%2C1003.2506%2C1003.2329%2C1003.0427%2C1003.2252%2C1003.3236%2C1003.2835%2C1003.3899%2C1003.6035%2C1003.5532%2C1003.2572%2C1003.0312%2C1003.4670%2C1003.4780%2C1003.5068%2C1003.4584%2C1003.4081%2C1003.2729%2C1003.4331%2C1003.2108%2C1003.4692%2C1003.5619%2C1003.1866%2C1003.4072%2C1003.0206%2C1003.0872%2C1003.4564%2C1003.0964%2C1003.0527%2C1003.3579%2C1003.5680%2C1003.4215%2C1003.1649%2C1003.3326%2C1003.1477%2C1003.0645%2C1003.2808%2C1003.4891%2C1003.1004%2C1003.3230%2C1003.0924%2C1003.0242%2C1003.5463%2C1003.1196%2C1003.1926%2C1003.1478%2C1003.4310%2C1003.3211%2C1003.1381%2C1003.3945%2C1003.5631%2C1003.5093%2C1003.3365%2C1003.2204%2C1003.2853%2C1003.1054%2C1003.1741&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Point Charge Dynamics Near a Grounded Conducting Plane"}, "summary": "The classic image problem in electromagnetism involves a grounded infinite\nconducting plane and a point charge. The force of attraction between the point\ncharge and the plane is identified using an equivalent-field picture of an\nimage charge with opposite sign equidistant behind the plane resulting in a\n1/{\\it r}$^{\\rm 2}$ force of attraction between the original charge and the\nplane. If the point charge is released from rest it will reach the plane in a\ntime $\\tau$. This time $\\tau$ has not been calculated correctly up to now.\nClarification of the inconsistency is presented along with a correct solution\nto the classic image problem. Other electromagnetism problems are mentioned\nwith attractive 1/{\\it r}$^{\\it n}$ forces (where {\\it n} $\\ge$ 1). Such\nsituations arise between a point charge and a line charge (1/{\\it r}), between\na line charge and a point dipole (1/{\\it r}$^{2}$), between a point charge and\na point dipole (1/{\\it r}$^{3})$, and between a point dipole and a second point\ndipole (1/{\\it r}$^{4}$).", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1003.5347%2C1003.2179%2C1003.1114%2C1003.2742%2C1003.1391%2C1003.6011%2C1003.1941%2C1003.1222%2C1003.1845%2C1003.3567%2C1003.1247%2C1003.4797%2C1003.5019%2C1003.4392%2C1003.3767%2C1003.3698%2C1003.1145%2C1003.0015%2C1003.0007%2C1003.2290%2C1003.6031%2C1003.2585%2C1003.5882%2C1003.6019%2C1003.3953%2C1003.5825%2C1003.0986%2C1003.0849%2C1003.3362%2C1003.2890%2C1003.0121%2C1003.3662%2C1003.3328%2C1003.5392%2C1003.2852%2C1003.5874%2C1003.5384%2C1003.5868%2C1003.1969%2C1003.3281%2C1003.3121%2C1003.4820%2C1003.2911%2C1003.3745%2C1003.1369%2C1003.2506%2C1003.2329%2C1003.0427%2C1003.2252%2C1003.3236%2C1003.2835%2C1003.3899%2C1003.6035%2C1003.5532%2C1003.2572%2C1003.0312%2C1003.4670%2C1003.4780%2C1003.5068%2C1003.4584%2C1003.4081%2C1003.2729%2C1003.4331%2C1003.2108%2C1003.4692%2C1003.5619%2C1003.1866%2C1003.4072%2C1003.0206%2C1003.0872%2C1003.4564%2C1003.0964%2C1003.0527%2C1003.3579%2C1003.5680%2C1003.4215%2C1003.1649%2C1003.3326%2C1003.1477%2C1003.0645%2C1003.2808%2C1003.4891%2C1003.1004%2C1003.3230%2C1003.0924%2C1003.0242%2C1003.5463%2C1003.1196%2C1003.1926%2C1003.1478%2C1003.4310%2C1003.3211%2C1003.1381%2C1003.3945%2C1003.5631%2C1003.5093%2C1003.3365%2C1003.2204%2C1003.2853%2C1003.1054%2C1003.1741&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The classic image problem in electromagnetism involves a grounded infinite\nconducting plane and a point charge. The force of attraction between the point\ncharge and the plane is identified using an equivalent-field picture of an\nimage charge with opposite sign equidistant behind the plane resulting in a\n1/{\\it r}$^{\\rm 2}$ force of attraction between the original charge and the\nplane. If the point charge is released from rest it will reach the plane in a\ntime $\\tau$. This time $\\tau$ has not been calculated correctly up to now.\nClarification of the inconsistency is presented along with a correct solution\nto the classic image problem. Other electromagnetism problems are mentioned\nwith attractive 1/{\\it r}$^{\\it n}$ forces (where {\\it n} $\\ge$ 1). Such\nsituations arise between a point charge and a line charge (1/{\\it r}), between\na line charge and a point dipole (1/{\\it r}$^{2}$), between a point charge and\na point dipole (1/{\\it r}$^{3})$, and between a point dipole and a second point\ndipole (1/{\\it r}$^{4}$)."}, "authors": ["Kevin L. Haglin"], "author_detail": {"name": "Kevin L. Haglin"}, "author": "Kevin L. Haglin", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1119/1.3467049", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1003.4215v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1003.4215v2", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "6 pages, 4 figures", "arxiv_primary_category": {"term": "physics.class-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "physics.class-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1003.4215v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1003.4215v2", "journal_reference": null, "doi": "10.1119/1.3467049", "fulltext": "Point Charge Dynamics Near a Grounded Conducting Plane\nKevin L. Haglin∗\n\narXiv:1003.4215v2 [physics.class-ph] 23 Mar 2010\n\nDepartment of Physics and Astronomy, Saint Cloud State University,\n720 Fourth Avenue South, St. Cloud, MN 56301\n(Dated: March 25, 2010)\nThe classic image problem in electromagnetism involves a grounded infinite conducting plane and\na point charge. The force of attraction between the point charge and the plane is identified using an\nequivalent-field picture of an image charge with opposite sign equidistant behind the plane resulting\nin a 1/r 2 force of attraction between the original charge and the plane. If the point charge is released\nfrom rest it will reach the plane in a time τ . This time τ has not been calculated correctly up to\nnow. Clarification of the inconsistency is presented along with a correct solution to the classic image\nproblem. Other electromagnetism problems are mentioned with attractive 1/r n forces (where n ≥\n1). Such situations arise between a point charge and a line charge (1/r ), between a line charge and\na point dipole (1/r 2 ), between a point charge and a point dipole (1/r 3 ), and between a point dipole\nand a second point dipole (1/r 4 ).\n\nI.\n\nINTRODUCTION\n\nPoint masses under the influence of Newtonian gravity\nand point charges under the influence of Coulombic attraction experience a 1/r 2 force. Particles in this picture\nwill approach one another according to Newtonian (nonrelativistic) dynamics and if released from rest will reach\nthe force center in a time that is typically shown to be\nproportional to the initial separation to the three-halves\npower. This type of solution appears in various places in\ntextbooks as an application of gravitational forces[1, 2],\nand in electromagnetism textbooks surrounding the classic image problem[3–5]. Unfortunately, the solution leading to this result is plagued with superluminal (i.e. faster\nthan light speed) transport and hence cannot be formally\ncorrect.\nIn addition to relativistic effects, action-at-a-distance\ntype forces require propagation of information about the\nforce. News of changing particle positions must propagate to the other particle before any changes can be\nrealized and the news travels at a fixed (finite) speed,\nnamely, the speed of light. Care must be taken to properly account for these retardation effects. The ultimate\neffect is to extend the time it takes for the particle to\nreach the force center as compared with an assumption\nof instantaneous updating.\nThe electromagnetic category of problem is discussed\nin this paper, but the same formalism can be applied to\nthe gravitational problem as well. The solution discussed\nbelow for problems of this type incorporates Einstein's\nspecial relativity and includes the effects of field retardation. In Section II the classic image problem is discussed\nand solved taking special relativity into account. After\nall, when particle separation approaches zero with an inverse squared force law, infinite kinetic energies are possible. This has all the earmarks of superluminal dynamics.\nConsistent results without any superluminal dynamics\n\n∗\n\nare presented in Section (II). The Liénard-Wiechart potentials are employed in Sect. (III) to take into account\nthe retardation effects. Sect. (III) also includes a brief\ndiscussion to illustrate conditions under which the differences between the old (wrong) solution and the new (correct) solution are important. Discussion of the correspondence to analagous gravitational problems is included in\nSection (IV). A conclusion is included to summarize the\nmain findings and to introduce other problems in electromagnetism where such effects could be important.\n\nII.\n\nTHE CLASSIC IMAGE PROBLEM\n\nThe classic image problem in electromagnetism involves a grounded infinite conducting plane and a point\ncharge. The force of attraction between the point charge\nand the plane is identified using an equivalent picture of\nan image charge equidistant behind the plane of opposite\nsign. The field configuration in the half-space of the point\ncharge is mathematically equivalent to the picture where\nan image charge of equal magnitude and opposite sign\nresides equidistant behind the plane. Hence, the field\nconfiguration of the point charge and the plane is mathematically equivalent to the the field between the point\ncharge and the image charge in the space of interest.\nIf released from rest, the charge begins to move toward\nthe plane, which also moves the image charge closer to\nthe midpoint between the charge and the image. Consequently, the force of attraction between the charge and\nthe image rapidly increases. The expectation in the textbooks is that Newton's 2nd law can be employed to write\na second-order differential equation to be solved for ~r(t ).\nTypically, one is asked to show that the time to reach the\nplane is[4]\nτ=\n\nπd p\n2πǫ0 md ,\nq\n\n(1)\n\nwhere q is the charge, m is the mass and d is the initial\nbetween the point charge and the plane. The\n\nklhaglin@stcloudstate.edu; http://www.feynman.stcloudstate.edu/haglin/\nseparation\n\n\f2\npermittivity of free space appears as ǫ0 which implies a\nparticular system of units (SI).\nStart with a point charge q of mass m released from\nrest a distance d from an infinite grounded conducting\nplane (see Fig.1). An image charge q ′ = –q placed a distance d behind the plane will result in the correct boundary condition for the electric potential V (0) = 0 and\nthe correct field configuration for x ≥ 0. Consequently,\nby uniqueness theorem arguments, one knows that the\nimage configuration is mathematically equivalent to the\noriginal problem. As soon as the original charge moves,\nso too will the image charge (very much like two gravitating masses approaching one another; however, the image\ncharge is not a physical charge so it does not introduce\nkinetic energy into the picture).\n\ntime derivative to a spatial derivative through dt = vdx,\nwe can write\n−q 2\nd(γv)\n=m\n,\n16πǫ0 x2\ndt\n−q 2 dx\n= v γ 3 dv .\n16πǫ0 m x2\n\n(5)\n\nThe Lorentz factor γ = (1−v 2 /c 2 )−1/2 appears characteristically to modify the dynamics appropriately when\nthe kinetic energy is not small compared with the rest\nenergy. This expression can be integrated to find\nq\n\u00012\n\u0001\nl2 1 − xd + 2lx 1 − xd\n\u0001\nv = −c\n,\n(6)\nl 1 − xd + x\n\nwhere a characteristic length l = q 2 /(16πǫ0 mc 2 ) appears. Notice that v (d ) = 0 and v (0) = −c (with the\nminus sign pointing to the direction) as it must to avoid\nsuperluminal transport. For a specific choice of charge,\nmass, and\np initial separation [d /(cτ ) = 0.5, where d /(cτ )\n= (1/π) 8l/d], a comparison is presented in Fig. 2 of\nthe relativistic versus nonrelativistic expressions for the\nspeed. For this particular configuration, the difference\nseems significant.\n\nFIG. 1. Problem setup: Point charge released from rest a\ndistance d from a grounded infinite conducting plane.\n\nThe one-dimensional equation of motion under these\nconditions is (positive x to the right)\n−q 2\nd 2x\n=\nm\n,\n16πǫ0 x2\ndt 2\n\n(2)\n\nwhere the initial conditions in time are x (0) = d and\nv (0) = 0, with the endpoint condition x (τ ) = 0. Upon\nintegrating once and applying the initial condition(s) one\ncan write\ns\n\u0012\n\u0013\ndx\n1\n1\nq2\n=v =\n−\n.\n(3)\n−\n8πǫ0 m x d\ndt\nAlready here there is a problem! When the charge\nreaches the plane the value of x becomes 0. Therefore, the\nparticle's speed becomes unbounded-clearly unphysical.\nStill, if one proceeds to integrate once again to find an\nexpression relating time t and position x , one finds\nr r\n\u0014\n\u0015\n\u0012r \u0013\n2\n2 x\nx\nx\nt = τ 1 − sin−1\n+\n. (4)\n1−\nπ\nd\nπ d\nd\nSetting x = 0 identifies the time to reach the plane, but\none must remember that particle's speed has become infinite at that moment.\nHow can this be corrected? The first step toward a\ncomplete solution is to use the relativistic expression for\nthe particle's momentum p = mγv . Then, changing the\n\nFIG. 2. Magnitude of velocity divided by c versus distance\ntraveled (that is, 1 minus the position divided by d ) for a\npoint charge released from rest near a grounded conducting\nplane. The solid curve (Eq. 6) describes relativistic dynamics\nand the dashed curve corresponds to nonrelativistic dynamics\n(Eq. 3).\n\nThe next task is clearly to integrate Eq. (6) to find an\nexpression for t as a function of x . Specifically, we must\nintegrate\n\u0011\n\u0010\n′\nZ d\nl 1 − xd + x ′\nq\ndx′ .\n(7)\nct =\n′ \u00012\n′\u0001\nx\nx\nx\nl2 1 − d + 2lx′ 1 − d\n\nThe integral can be done in closed form and written as\n\n\f3\nt\n=\nτ\n\nr !\u0012\n\u00132 \u0010 \u0011 (\"\n\u0013#\n1\nπ\nd\nl\n√\n−1\n4\nd\nl\n2\n\nv\nu \u0012 \u0013\u0012\n√ \u0012 \u0013\u0012\n√ r\n\u00132\n\u0013!2\nu\n1 l\n2x d\n2 l\n2d\n2d\n\n\n* 1 − t\n−1 +1−\n−\n−1\n\n8 d\nl\nd\nl\n4\nd\nl\n\n\u0012\n\nd\ncτ\n\n\n+\n\n\n\n\u0014\n\nl\n4d\n\n\u0012\n\n2d\n−1\nl\n q\nx\nd\n\nsin−1  q\n\nd\nl\n\n1\n16\n\n\u0013\u0012\n\n\u0013\n\u0015\nd\n−1 +1\nl\nq\n\n\u0001\n\u0001\n− 41 dl 2d\n−\n1\n−1\n− 14 2d\nl\n−1\nl\n\nq\n\u00012 1 − sin\n\u00012\n\u0001 2d\n1\nl\n2d\n−\n1\n+\n+\nd\nl\n2\n16\nl −1\n\nA position-time analysis is now possible by comparing\nEqs. (4) and (8). The comparison is shown in Fig. (3)\nwith the solid curve representing relativistic dynamics\nand the dashed curve displaying the nonrelativistic expression. The same choice is made here for the dimensionless parameter as was made previously [namely,\nd /(cτ ) = 0.5].\n\n\n\n .\n\n1d\n\n(8)\n\n2l\n\nNow that we have the expression for t as a function of\nx , it is a straightforward exercise to take x to zero and\nidentify the time to reach the plane. By setting x → 0,\nthen t → T , and we have,\n\u0012 \u0013(\n\u0012 \u00132 2\n1\nπ\nd\nd\nT\n=\n−\nτ\nτc\n2\nτc\n16\n\"\n\u0012\n\u0013\n\u0012 \u00133 #\n1 \u0010τc\u0011\nd\nπ\nd\nπ3\n+\n+\n+\nπ d\nτ c 16 128 τ c\n!#)\n\"\n\u0001\nd 2\nπ2\n−2\nπ\n−1\n8\nτc\n,\n(9)\n− sin\n*\n\u0001\nπ2\nd 2\n2\n+2\n8\n\nτc\n\nwhere τ is the original nonrelativistic expression given by\nEq. (1). We remark that if c → ∞, the right hand side\napproaches 1, so T → τ .\nA comparison between the nonrelativistic expression\nfor the time to reach the plane as compared with the fully\nrelativistic expression is ultimately useful to be able to\nidentify the conditions under which the original textbook\nexpression fails. This comparison is deferred until after\na discussion of the field-retardation effects.\nFIG. 3. Position (distance traveled in units of d is \"1−x/d \")\nversus time for a point charge released from rest near a\ngrounded conducting plane. The dimensionless parameter is\nchosen to be d /(cτ ) = 0.5. The solid curve corresponds to relativistic dynamics and dashed curve uses the nonrelativistic\nexpression.\n\nThe slope of the tangent line is of course a measure of\nthe magnitude of the instantaneous velocity. However,\nit cannot be read off directly since there is a factor of\nd /(τ c) in the ratio. And yet, notice that the dashed\ncurve exhibits a slope for its tangent line near x = 0\nthat is very large. Numerically the magnitude of the\nvelocity exceeds 1 (in units of c) for t /τ ≥ 0.62 in the\ndashed curve. At t /τ = 0.8 the speed exceeds 2, and\nit exceeds 4 at t /τ of 0.96. Furthermore, we point out\nthat the relativistically consistent curve displays a slope\ncorresponding to a speed less than 1 throughout, only\ndoes the speed approach 1 at the point x = 0.\n\nIII.\n\nFIELD RETARDATION EFFECTS\n\nThe discussion of the previous section improves upon\nthe nonrelativistic analysis which is typically used to find\nthe time to reach the plane. However, it too is lacking in\nsome respects. When the charge is a distance x from the\nplane and moving toward the plane, the force it experiences is different from a static Coulomb picture because\nthe \"electromagnetic news\" travels at the speed of light.\nHence, the electric field it experiences must be related to\nthe electric and magnetic potentials at some earlier time\n(the so-called retarded time). Simply put, it takes a time\nx /c for information on the particle dynamics to reach the\nplane. The charge configuration on the plane is updated\n(which means the image charge location is updated) and\nthen that information requires a time x /c to get back\nto the point charge. This type of physical circumstance\n\n\f4\nis describable by the Liénard-Wiechart potentials for a\nmoving point charge[6, 7].\nSuppose the charge is located at position x and moving\nwith a velocity −v (again, positive x to the right). The\ngeneral problem to calculate the retarded potentials is\nnontrivial, but when the motion is one-dimensional it\nsimplifies significantly. In particular, the electric field\nexperienced by the charge in this case is reduced by two\npowers of γ. It can therefore be written as\n\u0013\n\u0012\n\u0001\n1\n−q\n1 − v 2 /c2 .\n(10)\nE=\n4πǫ0 4x2\n\nThe force drawing the charge toward the plane is therefore velocity dependent and it is reduced as compared\nwith the static case. Consequently, the relativistic and\nproperly time-delayed equation of motion is\n\u0012\n\u0013\n−q 2\nv2\nd(γv)\n1− 2 =m\n.\n(11)\n16πǫ0 x2\nc\ndt\n\nRemarkably, this too can be integrated to find the velocity as a function of position. It becomes\ns\n\u00132/3\n\u0012\ndx\nxd\n. (12)\n= v = −c 1−\ndt\nxd + 3l(d − x)\n\nAnother integral is required to identify a relationship between position and time in this relativistically consistent\nand properly casual description of the dynamics. Unfortunately, a closed form expression has not been found.\nInstead, the integral will be carried out numerically for\nthe case of interest here. That is, the time T to reach\nthe plane will be computed and displayed graphically to\nhelp clarify the size of the effects. In particular, the time\nT is\n\u0001\nZ 1\nd\nT\nτ c dz\nr\n=\ni \u00112/3 . (13)\n\u0010 .h\nτ\n\u0001\n0\nd 2\n3π 2\n1 − z z + 8 τ c (1 − z)\n\nTime T is normalized here by the original nonrelativistic\ntime. A ratio of 1 indicates that the original nonrelativistic expression is completely satisfactory. Deviations from\n1 indicate that relativistic effects and/or field retardation\neffects become important.\nThe time to reach the plane is again a function of the\ndimensionless parameter d /(τ c). In Fig. (4) the full solution is plotted as a function of d /(τ c). One must keep\nin mind that the dimensionless parameter is related to\nthe charge, mass, and initial separation through\nr\n1 8l\nq\nd\n√\n=\n=\n.\n(14)\nτc\nπ d\nπ 2πǫ0 mc2 d\nGraphical results indicate that so long as the dimensionless parameter d /(τ c) is less than roughly 0.1, then\nthe nonrelativistic expression for the time is completely\nadequate. For values of the parameter greater than 1\nthe relativistic and retardation effects become very important. What remains to be considered is to identify\nthe physical situations that correspond to each of these\nregimes.\n\nFIG. 4. Time to reach the plane versus scaled initial separation. Solid curve includes relativistic corrections, dashed\ncurve includes relativistic correction plus retarded (LiénardWiechart) potentials.\n\nIV.\n\nDISCUSSION\n\nThere is of course some concern about using a solution for τ that involves superluminal transport. However, we have identified the crossover point where the\nrelativistic expression must be used (see Fig 4). If a particular application falls to the left of the crossover point\non Fig. (4), then the nonrelativistic formulation is completely adequate. It will be useful to consider a few example configurations to get a feel for this dimensionless\nparameter d /(τ c). Typical laboratory-type charges are\nmicrocoulombs, with typical masses in the milligram-togram range, and initial separations in the neighborhood\nof tens of centimeters.\nFor the typical configuration described above, the important parameter comes out to be of the order 10−6\nas can be seen from the information in Table I. Consequently, the nonrelativistic solution is completely sufficient for this case. We emphasize that even though the\nnonrelativistic expression for the total time to reach the\nplane is valid, it does not mean the particle was completely nonrelativistic. Rather, the time spent moving\nrelativistically was such a small part of the total time\nthat relativistic corrections are unimportant. It is especially reassuring to notice that the number 10−6 is several\norders of magnitude smaller than the region in Fig. (4)\nwhere the relativistic and retardation effects begin to be\nimportant.\nNext we explore the case of an electron released from\nrest a distance 10 cm from a grounded conducting plane.\nAgain from the table we extract the important dimensionless parameter for this case to be a number of the order of 10−8 (even smaller than the previous case!). This\ntoo is completely legitimately described by nonrelativistic formulae. The argument that saves the nonrelativis-\n\n\f5\nq\n1μC\nelectron\nelectron\nproton\n\nd\n1 (cm)\n0.1 (meter)\n1 (fm)\n10 (fm)\n\nm\n1 milligram\nme\nme\nmp\n\nd /(τ c)\n∼ 10−6\n7.5×10−8\n∼1\n∼ 6×10−3\n\nTABLE I. Comparison of different physical configurations\nand the resulting dimensionless parameter d/(τ c) which determines the region of applicability of relativity and fieldretardation effects.\n\ntic expression is that even though the last tiny fraction\nof the trip to the grounded plane is superluminal, the\ncharge spends so little time moving faster than light that\nthe the deviation from the \"correct\" time is immeasurably small. So, once again, the nonrelativistic expression\nis sufficient.\nLastly, we investigate extreme cases where relativistic\nand retardation effects could be important. Consider an\nelectron released from rest a distance 1 femtometer from\na grounded conducting plane. The important parameter\ndetermining the dynamics is again the number d/(τ c)\nwhich comes out to be of the order 1 for this configuration. The nonrelativistic expression will fail noticeably\nfor this case. Not only is relativity important for the\ndynamics, but field retardation effects are very important. A proton released 10 fm from the plane results in\na parameter d /(τ c) of 10−3 .\nBefore concluding, it is useful to extend the solution\npresented above for the electrical charges to the case of\ntwo gravitating point masses. Consider two point masses\nm initially separated by a distance 2d . We have immediately solved that problem as well using a correspondence\nbetween charge and mass, and between the inverse of the\npermittivity of free space and Newton's universal gravitational constant. The above dynamical expressions relating position, velocity and time hold for the case of gravity\nwhile the relevant dimensionless parameter becomes\n√ r\nd\n2 mG\n,\n(15)\n=\nτc\nπ\ndc 2\nwhere G is Newton's universal gravitational constant.\nFor most configurations this parameter is extremely\nsmall. Hence, once again, the nonrelativistic expression\nfor the time to reach the center of mass is completely safe\nto use.\nV.\n\nCONCLUSION\n\nThe classic image problem of a point charge near a\ngrounded conducting plane invites the notion of a mathematical tool of replacing the grounded plane with a fictitious charge (a so-called image charge) which, together\nwith the original charge, produces the same electric potential in the region of interest and respects the boundary\nconditions. The existence and uniqueness theorems indicate that the scalar potential and therefore the (vector)\n\nelectric fields must be equivalent. It is a beautiful solution to an otherwise difficult problem.\nThe follow-up problem involves computing the time it\ntakes the charge to reach the plane when the charge is released from rest. A straightforward (although incorrect)\nanalysis from nonrelativistic classical mechanics results\nin an expression for the time which is proportional to\nthe initial separation to the three-halves power, also roportional to the square root of the mass, and inversely\nproportional to the charge. We have pointed out in this\narticle the serious formal flaw in that proposed solution.\nThe flaw is linked to the observation that the velocity of\nthe charged particle exceeds the speed of light for a small\nportion of its trip toward the grounded plane. It is very\nimportant to sort out when the solution is still valid and\nacceptable, and when it is noticeably inadequate. This\nhas been the purpose of our article.\nWe have shown that the relativistic version of the problem is completely tractable and results in subluminal\ndynamics which changes the expression for the time to\nreach the plane by monotonically increasing the result as\na function of the dimensionless parameter d /(τ c).\nA more sophisticated approach to point charge dynamics near a grounded conducting plane must include fieldretardation effects. This has also been added to the solution discussed in this paper. Using time-delayed fields\n(Liénard-Wiechart potentials) increases further the time\nrequired for the particle to reach the plane. Both effects,\nrelativistic and retardation influences, are easily understood in terms of their tendency to increase the time for\nthe particle to reach the plane.\nFinally, we briefly mention other problems where these\nsame effects could be important. First, a point charge\nq of mass m near a fixed line charge −λ experiences\na force that is proportional to 1/r . The nonrelativistic\ntime\np to reach the line charge can be computed as[8] τ =\nπd ǫ0 m/(λq). However, the charge goes superluminal\nas it reaches the line charge. A point dipole p of mass\nm near a fixed line charge −λ experiences a 1/r 2 force.\nUsing nonrelativistic dynamics againpwe find the time to\nreach the line charge is τ = (πd /4) πǫ0 md/(pλ). Furthermore, a point charge q of mass m near a point dipole\np of mass m will experience an inverse cube force (1/r3 ).\nThe nonrelativistic time for the two to meet at the midpoint (each of which is initially\na distance d away from\np\nthe midpoint) is τ = d 2 2 πǫ0 m/(pq ). And lastly, two\nidentical point dipoles p with mass m will experience\na force proportional to 1/r 4 . The nonrelativistic expression for the time to reach the midpoint is[9] τ = (2/3)κd 2\n√\nπǫ0 md /p, where the constant κ can be computed as\nZ π/2 h\ni\nκ=\nsin2/3 θ dθ = 1.12 . . .\n(16)\n0\n\nIn each case above, analytic or numerical expressions for\nvelocity as a function of position and position as a function of time can be identified. Relativistic corrections\nand field retardation effects are equally readily obtainable. For increasingly steeper r -dependence, one might\n\n\f6\nexpect that the effects could be increasingly more important. The small-distance behavior determines the relative\nimportance of the effects, and hence the dipole-dipole is\nthe most sensitive to these effects.\n\n[1] R. Resnick, D. Halliday and K.S. Krane, Physics, Vol. 1,\nFifth Edition, J. Wiley & Sons, Inc., 328 (2002).\n[2] S.T. Thornton and J.B. Marion, Classical Dynamics of\nParticles and Systems, Fifth Ediction, Brooks/Cole, 205\n(2004).\n[3] B.F. Bayman and M. Hammermesh, A Review of Undergraduate Physics, J. Wiley & Sons, Inc., 117 (1986).\n[4] D.J. Griffiths, Introduction to Electrodynamics, Third Edition, Prentice Hall Inc., 155 (1999).\n[5] S. Palit, Principles of Electricity and Magnetism, Alpha\nScience International Ltd., 48 (2005).\n[6] J.D. Jackson, Classical Electrodynamics, Third Edition,\n661 (1999).\n[7] D.J. Griffiths, Introduction to Electrodynamics, Third Edition, Prentice Hall Inc., 435 (1999).\n[8] The\nto find τ is proportional to I =\nR ∞ expression\n√ −η\ndη\nη\ne\n.\nSquare\nthe integral, which becomes a dou0\n\nACKNOWLEDGMENTS\n\nThis work was supported in part by the National Science Foundation under grant No. PHY-0555521.\n\nble integral over η and ν. Change variables to u = η + ν\nand v = η − ν. The area element dη dν becomes 2du dv.\nThe resulting\nintegral is soluble with the result coming out\n√\nas I = π/2.\n[9] In\ncase,\nis proportional to κ =\nR ∞ this−(5/3)η\n√ τ\n2η .\ndη\ne\n/\n1\n−\ne\nExpanding and integrat0\ning term by term gives\n∞\nX\n(2n − 3)!!\nκ=3\n(6n − 1) (n − 1)! 2n−1\nn=1\n\n1\n1\n3\n15\n+\n+\n+\n+ ...\n5\n22\n136\n1104\n= 1.12 . . .\nThe same result comes from numerically integrating\nEq. (16).\n=3\n\nn\n\no\n\n\f"}