{"id": "http://arxiv.org/abs/1002.4292v1", "guidislink": true, "updated": "2010-02-23T10:44:33Z", "updated_parsed": [2010, 2, 23, 10, 44, 33, 1, 54, 0], "published": "2010-02-23T10:44:33Z", "published_parsed": [2010, 2, 23, 10, 44, 33, 1, 54, 0], "title": "Are large distance Heegaard splittings generic ?", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1002.0616%2C1002.2966%2C1002.4008%2C1002.2339%2C1002.1698%2C1002.1677%2C1002.0344%2C1002.3124%2C1002.2009%2C1002.0270%2C1002.1052%2C1002.3446%2C1002.0546%2C1002.0535%2C1002.0810%2C1002.2530%2C1002.1201%2C1002.3499%2C1002.1160%2C1002.4292%2C1002.2005%2C1002.4181%2C1002.1891%2C1002.0098%2C1002.3140%2C1002.3636%2C1002.4134%2C1002.5007%2C1002.0190%2C1002.4509%2C1002.2743%2C1002.0015%2C1002.2292%2C1002.4538%2C1002.2551%2C1002.0771%2C1002.2509%2C1002.3023%2C1002.4426%2C1002.3146%2C1002.2285%2C1002.1672%2C1002.1551%2C1002.2470%2C1002.2857%2C1002.0063%2C1002.2337%2C1002.0132%2C1002.0484%2C1002.4350%2C1002.0636%2C1002.3674%2C1002.2626%2C1002.0855%2C1002.1376%2C1002.2413%2C1002.4108%2C1002.4560%2C1002.0792%2C1002.1245%2C1002.0610%2C1002.3652%2C1002.1973%2C1002.0226%2C1002.0807%2C1002.3399%2C1002.4640%2C1002.2483%2C1002.0417%2C1002.4025%2C1002.4904%2C1002.2714%2C1002.2881%2C1002.1715%2C1002.0557%2C1002.0920%2C1002.0677%2C1002.4104%2C1002.1405%2C1002.0058%2C1002.0980%2C1002.1784%2C1002.2238%2C1002.4442%2C1002.1492%2C1002.1365%2C1002.2777%2C1002.1371%2C1002.3667%2C1002.2428%2C1002.2110%2C1002.3253%2C1002.2181%2C1002.2668%2C1002.4414%2C1002.1082%2C1002.3752%2C1002.4428%2C1002.0482%2C1002.0956%2C1002.0112&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Are large distance Heegaard splittings generic ?"}, "summary": "In a previous paper we introduced a notion of \"genericity\" for countable sets\nof curves in the curve complex of a surface S, based on the Lebesgue measure on\nthe space of projective measured laminations in S. With this definition we\nprove that for each fixed g > 1 the set of irreducible genus g Heegaard\nsplittings of high distance is generic, in the set of all irreducible Heegaard\nsplittings. Our definition of \"genericity\" is different and more intrinsic then\nthe one given via random walks.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1002.0616%2C1002.2966%2C1002.4008%2C1002.2339%2C1002.1698%2C1002.1677%2C1002.0344%2C1002.3124%2C1002.2009%2C1002.0270%2C1002.1052%2C1002.3446%2C1002.0546%2C1002.0535%2C1002.0810%2C1002.2530%2C1002.1201%2C1002.3499%2C1002.1160%2C1002.4292%2C1002.2005%2C1002.4181%2C1002.1891%2C1002.0098%2C1002.3140%2C1002.3636%2C1002.4134%2C1002.5007%2C1002.0190%2C1002.4509%2C1002.2743%2C1002.0015%2C1002.2292%2C1002.4538%2C1002.2551%2C1002.0771%2C1002.2509%2C1002.3023%2C1002.4426%2C1002.3146%2C1002.2285%2C1002.1672%2C1002.1551%2C1002.2470%2C1002.2857%2C1002.0063%2C1002.2337%2C1002.0132%2C1002.0484%2C1002.4350%2C1002.0636%2C1002.3674%2C1002.2626%2C1002.0855%2C1002.1376%2C1002.2413%2C1002.4108%2C1002.4560%2C1002.0792%2C1002.1245%2C1002.0610%2C1002.3652%2C1002.1973%2C1002.0226%2C1002.0807%2C1002.3399%2C1002.4640%2C1002.2483%2C1002.0417%2C1002.4025%2C1002.4904%2C1002.2714%2C1002.2881%2C1002.1715%2C1002.0557%2C1002.0920%2C1002.0677%2C1002.4104%2C1002.1405%2C1002.0058%2C1002.0980%2C1002.1784%2C1002.2238%2C1002.4442%2C1002.1492%2C1002.1365%2C1002.2777%2C1002.1371%2C1002.3667%2C1002.2428%2C1002.2110%2C1002.3253%2C1002.2181%2C1002.2668%2C1002.4414%2C1002.1082%2C1002.3752%2C1002.4428%2C1002.0482%2C1002.0956%2C1002.0112&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "In a previous paper we introduced a notion of \"genericity\" for countable sets\nof curves in the curve complex of a surface S, based on the Lebesgue measure on\nthe space of projective measured laminations in S. With this definition we\nprove that for each fixed g > 1 the set of irreducible genus g Heegaard\nsplittings of high distance is generic, in the set of all irreducible Heegaard\nsplittings. Our definition of \"genericity\" is different and more intrinsic then\nthe one given via random walks."}, "authors": ["Martin Lustig", "Yoav Moriah"], "author_detail": {"name": "Yoav Moriah"}, "author": "Yoav Moriah", "arxiv_comment": "27 pages 5 figures", "links": [{"href": "http://arxiv.org/abs/1002.4292v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1002.4292v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "math.GT", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "math.GT", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "M57", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1002.4292v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1002.4292v1", "journal_reference": null, "doi": null, "fulltext": "ARE LARGE DISTANCE HEEGAARD SPLITTINGS\nGENERIC ?\n\narXiv:1002.4292v1 [math.GT] 23 Feb 2010\n\nMARTIN LUSTIG AND YOAV MORIAH1\nAbstract. In a previous paper [4] we introduced a notion of\n\"genericity\" for countable sets of curves in the curve complex of\na surface Σ, based on the Lebesgue measure on the space of projective measured laminations in Σ. With this definition we prove\nthat for each fixed g ≥ 2 the set of irreducible genus g Heegaard\nsplittings of high distance is generic, in the set of all irreducible\nHeegaard splittings. Our definition of \"genericity\" is different and\nmore intrinsic then the one given via random walks.\n\n1. Introduction\n1.1. The main result. In this paper we use the definition of a generic\nsubset of a countable set, introduced in Definition 4.1 of [4] (see also\nsubsection 1.2 below), to investigate whether for each fixed genus g ≥\n2 the set of high distance Heegaard splittings is generic in the set\nof all irreducible Heegaard splittings. For this purpose, we consider\nirreducible Heegaard diagrams composed of two complete decomposing\nsystems D, E on a closed surface Σ, i.e. two curve systems which both\ndecompose Σ into pair-of-pants. We define the set SN OW (Σ) of such\npairs (D, E), by requiring the pairs to have the additional property that\nthey do not have waves (see Definition 2.1) with respect to each other.\nA pair of such curve systems, which determine a Heegaard splitting that\nis of distance greater or equal to some n ∈ N, will be said to belong to\nSN OWn (Σ) ⊂ SN OW (Σ). For precise definitions see Sections 2 and\n3 below. Our main result is:\nTheorem 6.5. Let Σ be a closed surface of genus g ≥ 2. Then for any\ninteger n ≥ 1 the set SN OWn−1 (Σ) is generic in the set SN OW (Σ).\nDate: November 5, 2018.\nKey words and phrases. Train tracks, Curve complex, Heegaard distance, Heegaard splittings, Generic.\n1\nThis research is supported by a grant from the High Council for Scientific and\nTechnological Cooperation between France and Israel.\n1\n\n\f2\n\nMARTIN LUSTIG AND YOAV MORIAH1\n\nThe fact that a Heegaard splitting is high distance has important\nconsequences for the geometry of the 3-manifold determined by it.\nHence the question, raised in the title of this paper, is natural and\nrelevant. Indeed, since the distance is measured in the curve complex\nC(Σ), which is not locally finite, it is a priory not clear, despite of the\nfact that C(Σ) has infinite diameter, whether one should expect random\npoints in C(Σ) to be close or far away from each other. The question\nbecomes even less evident if asked for subsets of C(Σ) with infinite diameter, such as the handlebody sets D(V ) and D(W ), which are used\nto determine the distance of a Heegaard splitting M = V ∪Σ W , see\nsection 2.\nThere are several ways to attack this question, and this paper presents\none which is described in detail in subsection 1.3. J. Maher [5] has provided another such approach, based on random walks in the mapping\nclass group and the issuing notion of a \"random 3-manifold\", which\nwas introduced and investigated by N. Dunfield and W. Thurston in\n[1].\n1.2. The notion of \"genericity\" used in this paper. It is well\nknown that making mathematical sense of the term \"generic\" is particularly problematic when considering subsets of countable sets Y . In\nthe \"classic\" setting a set A ⊂ Y would be called generic if and only\nif the complement Y r A is finite. This definition is very restrictive\nand, in practice, there are many cases where intuitively one would like\nto call a set generic, yet it does not satisfy this criterium. A common\nmethod to deal with this situation is the following: One considers a\nfamily of finite subsets Yn ⊂ Y that exhaust Y (typically given by enumerating Y = {y1 , y2 , . . .}, and by defining Yn = {y1 , y2 , . . . , yn }). One\nn ∩A)\n, and defines A to be generic\nthen computes the the ratio ρn = #(Y#Y\nn\nif ρn tends to 1. Of course, the obtained limit ratio depends heavily on\nthe particular chosen enumeration of Y .\nAnother difficulty with statements about \"genericity\" is that of double counting. A typical example here is to count group presentations\ninstead of groups, so that the same group may well be counted several\ntimes, or even infinitely often. The problem arises when in the given\nmathematical context it is impossible to count the objects in question\ndirectly, so that double counting becomes unavoidable.\nIn this paper we do indeed consider a countable set Y as base set,\nbut we use the fact that our set Y is given as subset of a space X that\nis already equipped with a natural measure, or rather, measure class.\n\n\fARE LARGE DISTANCE HEEGAARD SPLITTINGS GENERIC ?\n\n3\n\nThis enables us to use the following definition, which was introduced\nin a previous paper [4]. It is motivated by the observation that a\n\"generic\" point with rational coordinates in the unit square [0, 1]×[0, 1]\nshould rightfully be expected to lie in the interior rather than on the\nboundary of [0, 1] × [0, 1].\nDefinition 1.1. Let X be a topological space, provided with a Borel\nmeasure μ. Let Y ⊂ X be a (possibly countable) subset, which is a\n*\ndisjoint union Y = A ∪ B. The set A is called generic in Y (or simply\ngeneric, if Y = X) if the closure A of A has measure μ(A) > 0, and the\nclosure B of B has measure μ(B) = 0. (Here \"closure\" always means\n\"closure in X\".)\nNotice that in this definition the sets A and B may well not be disjoint, although A and B are assumed to be disjoint. Note also, that this\ndefinition of genericity extends to sets Y that are not embedded but are\njust mapped to X, by a properly chosen \"natural\" map. Furthermore,\nnote that this definition does not depend on the actual measure μ but\nrather only on its measure class.\nThe following is an immediate consequence of the above definition:\nLemma 1.2 (Lemma 4.3 (1) of [4]). Given sets X, Y and A as in\nDefinition 1.1. Then A is generic in Y if and only if the closure A\ncontains a set Z which is open in Y and of full measure μ(Z) = μ(Y ) >\n0, and which is disjoint from Y r A.\n\u0003\nWe will specify precisely in the next subsection the sets X, Y, A and\nthe measure μ that are used in this paper.\n1.3. Measures and objects. The Borel measure space X, as in the\nlast subsection, that is used in this paper is the space PML(Σ) ×\nPLM(Σ), where PML(Σ) is the space of projective measured laminations on a \"model surface\" Σ of genus g ≥ 2. As shown by Thurston,\nthe space PML(Σ) is a (6g − 7)-dimensional sphere, equipped with a\ncanonical p.l.-structure, and thus with a canonical Lebesgue measure\nclass.\nThe countable subset Y ⊂ X, required by this definition of the\nterm \"generic\" in the statement of Theorem 6.5, is a set of pairs\n(D, E) ∈ PML(Σ)2 , called SN OW (Σ), where D and E are curve systems on Σ that satisfy a certain combinatorial condition, see Definition\n2.3. However, in order to focus on the objects of our primary interest,\nnamely Heegaard splittings, we have to be more careful, in order to\n\n\f4\n\nMARTIN LUSTIG AND YOAV MORIAH1\n\navoid a potential double-counting problem as evoked in the previous\nsubsection:\nA marked Heegaard surface of genus g is a surface Sg of genus g\nembedded in a 3-manifold M , with handlebody complementary components V and W , which is equipped with a marking homeomorphism\nθ : Σ → Sg . Two such marked Heegaard surfaces, with markings θ\nand θ0 , are equal if there exists a homeomorphism h : M → M which\nis isotopic to the identity, such that θ0 = h ◦ θ. Let S g denote the set\nof marked Heegaard surfaces of genus g ≥ 2, and let Sng be the subset\nof those Heegaard surfaces of distance ≥ n. Here the distance of a\nmarked Heegaard surface Sg is measured in the curve complex of the\nmodel surface Σ: More precisely, one measures the distance between\nthe two handlebody sets D(V ) and D(W ) that are given by the θ−1 images of all meridian curves in Sg , for each of the two complementary\nhandlebodies V and W respectively.\nNow choose a map σS : S g → SN OW (Σ), (Sg , θ) 7→ (D, E), where\nθ(D) and θ(E) are systems of meridian curves on V and W respectively.\nThere are infinitely many such maps, and none seems to be prefered in\nany obvious way. In Section 7 we prove for any such map σS :\nCorollary 1.3. For any integers g ≥ 2 and n ≥ 0 the set σS (Sng ) is\ngeneric in the set σS (S g ).\nAcknowledgments. We would like to thank the High Council for\nScientific and Technological Cooperation between France and Israel\nfor supporting this project, the Department of Mathematics at the\nTechnion Haifa Israel and LATP at the Université P. Cézanne - AixMarseille III in Marseilles France for their hospitality.\n2. Preliminaries\nMost of the definitions we recall here are standard. We use the terminology of our previous papers [3] and [4], where also some more details\ncan be found. Definitions 2.3 (b) and 2.6 are new.\nThroughout this paper Σ will denote a closed orientable surface of\ngenus g ≥ 2. We will frequently consider essential simple closed curves\nDi (or Ej ) on Σ, and we will not distinguish notationally between\ncurves and isotopy classes of them.\nA curve D is called tight with respect to a system E = {E1 , . . . , Er } of\npairwise disjoint essential simple closed curves Ei in Σ if the number of\n\n\fARE LARGE DISTANCE HEEGAARD SPLITTINGS GENERIC ?\n\n5\n\nintersection points with E can not be strictly decreased by an isotopy of\nD. The same terminology is used for arcs α which have their endpoints\non E, where the endpoints cannot leave E throughout the isotopy.\nDefinition 2.1. Let P ⊂ Σ be a pair-of-pants, i.e. a sphere with three\nopen disks removed.\n(a) A simple arc in P which has its two endpoints on different\ncomponents of ∂P will be called a seam.\n(b) A simple arc in P which has both endpoints on the same component of ∂P , and is not ∂-parallel, will be called a wave.\n(c) An essential simple closed curve D ⊂ Σ has a wave (or a seam)\nwith respect to a system of curves E ⊂ Σ if D is tight with\nrespect to E and if D contains a subarc that is a wave (or a\nseam) in a complementary component Pi of E in Σ which is a\npair-of-pants.\nDefinition 2.2. For any closed surface Σ as above we define the curve\ncomplex C(Σ) as follows: A closed m-simplex is the isotopy class of a set\n{D0 , . . . , Dm } of mutually disjoint non-parallel essential simple closed\ncurves on Σ. On the 1-skeleton C 1 (Σ) of C(Σ) there is a well defined\nmetric dC given by assigning length 1 to every edge (= a 1-simplex).\nThe complex C(Σ) is of finite dimension 3g − 4 and is not locally\nfinite. It is known (see [7]) to be hyperbolic in the sense introduced by\nGromov, and it admits a natural action of the mapping class group of\nΣ.\nDefinition 2.3. (a) The set D = {D0 , . . . , D3g−4 } of (isotopy classes\nof) curves in Σ defined by a maximal dimensional simplex in C(Σ) is\ncalled a complete decomposing system of Σ. All of its complementary\ncomponents are pairs-of-pants. The set of complete decomposing systems of Σ (up to isotopy) is denoted by CDS(Σ). There is a canonical\nidentification between CDS(Σ) and the set of maximal dimensional\nsimplices of C(Σ).\n(b) Any two complete decomposition systems D, D0 ∈ CDS(Σ) satisfy\nthe symmetric no wave condition (or SN OW ), if each curve in D has\nno waves with respect to any of the curves of D0 , and vice versa. Define\nSN OW (Σ) to be the set of all pairs of complete decomposing systems\nwhich are SN OW .\nAny complete decomposing system D = {D0 , . . . , D3g−4 } ⊂ C(Σ)\ndetermines a handlebody VD with boundary ∂VD = Σ, which is defined\nby by declaring that all the curves Di bound disks in VD . Conversely,\n\n\fMARTIN LUSTIG AND YOAV MORIAH1\n\n6\n\ngiven a handlebody V with an identification ∂V = Σ, then the set D(V )\nof curves in C 0 (Σ) which bound disks in V (called meridian curves on\n∂V ) is called the handlebody set determined by V . Such a set D(V ) is\nthe vertex set of a subcomplex of C(Σ) which is connected (see [6]).\nThe following is well known and easy to prove:\nRemark 2.4. Let D ∈ CDS(Σ) be a complete decomposing system,\nwith associated handlebody VD as above. Then any meridian curve\nD ∈ D(VD ) is either contained in D, or else D has a wave with respect\nto D .\nAny two maximal dimensional simplexes σ, τ ⊂ C(Σ) determine a\nHeegaard splitting M = V ∪Σ W for some 3-manifold M . Here V and\nW are the handlebodies determined by the two complete decomposing\nsystems that are given by σ and τ respectively.\nGiven a Heegaard splitting M = V ∪Σ W of some 3-manifold M ,\nHempel (see [2]) defines the distance of the Heegaard splitting as follows:\nd(V, W ) = min{dC (D, E) | D ∈ D(V ), E ∈ D(W )}\nNote that a handlebody set has infinite diameter in C(Σ). Hence, for\nrandomly chosen D ∈ D(V ), E ∈ D(W ), the distance dC (D, E) may be\narbitrary large. However, combinatorial conditions for choosing curves\nD, E which realize d(V, W ) are given in [3].\nA crucial ingredient in the arguments of this paper is Lemma 1.3 of\nHempel [2] which can be restated as follows:\nLemma 2.5. Any irreducible Heegaard splitting M = V ∪Σ W admits\na pair of complete decomposing systems D ∈ D(V ), E ∈ D(W ) which\nsatisfy the condition SN OW .\nDefinition 2.6. A pair (D, E) ∈ CDS(Σ) is said to have property\nSN OWn , if (D, E) ∈ SN OW (Σ) and if in addition the handlebodies\nV and W , determined by D and E respectively, satisfy d(V, W ) ≥ n.\nThe set of all such pairs (D, E) is denoted by SN OWn (Σ).\n3. Train tracks and Laminations\n3.1. Basics.\nIn this subsection we recall some basic definitions and notations. For\na more detailed exposition see [3] and [4]:\n\n\fARE LARGE DISTANCE HEEGAARD SPLITTINGS GENERIC ?\n\n7\n\n3.1. (a) A train track τ in Σ is a closed subsurface with a singular\nI-fiberation: The interior of τ is fibered by open arcs, and the fibration\nextends to a fiberation of the closed surface τ by properly embedded\nclosed arcs (the I-fibers), except for finitely many singular points (also\ncalled cusp points) on ∂τ , where precisely two fibers meet. We call\nthese fibers singular fibers. We admit the case that a fiber is doubly\nsingular, i.e. both of its endpoints are singular points.\n(b) Two singular fibers are adjacent if they share a singular point as a\ncommon endpoint. A maximal connected union of singular or doubly\nsingular I-fibers is called an exceptional fiber. It is either homeomorphic\nto a closed interval, or to a simple closed curve on Σ. In the latter case\nit will be called a cyclic exceptional fiber. We explicitely admit this\nsecond case, although in the classical train track literature this case is\nsometimes suppressed.\n(c) Following Thurston, one usually pictures a singular point P ∈ ∂τ in\nsuch a way that any two arcs from ∂τ , which intersect in P , converge\ntowards P from the \"same direction\", thus giving rise to a cusp point\non the boundary of the corresponding complementary component of τ\nin Σ.\n(d) We define the type of a complementary component ∆ of τ in Σ as\ngiven by the genus of ∆, the number of boundary components of ∆,\nand the number of cusp points on each of its boundary components.\nIf ∆ is simply connected, we speak of an n-gon if there are precisely n\ncusp points on ∂∆. For example, if ∂∆ contains precisely three cusp\npoints, we say that ∆ is a triangle. An arc of ∂∆ which joins two\nadjacent cusp points is called a side of ∆.\nIf ∆ is simply connected, one usually requires ∆ to have at least 3\ncusp points on ∂∆.\n(e) A train track τ in Σ is called filling, if all complementary components of τ in Σ are simply connected, and if each of them has at least\n3 cusp points on its boundary. The train track τ is called maximal, if\nevery complementary component is a triangle.\n\n3.2. (a) A lamination L in Σ is a non-empty closed subset Σ which is\nthe union of (possibly non-closed) simple curves, called leaves, that are\ngeodesic with respect to some hyperbolic structure on Σ. A lamination\nL provided with a transverse measure μ is called a measured lamination, and its projective class is denoted by [L, μ]. The space PML(Σ)\n\n\f8\n\nMARTIN LUSTIG AND YOAV MORIAH1\n\nof all projective measured laminations [L, μ] on Σ, where L is the support of μ, is known to be homomorphic to a (6g−7)-dimensional sphere,\noften refereed to as the \"Thurston boundary of Teichmüller space\".\n(b) It is well known that PML(Σ) contains a dense subset of uniquely\nergodic laminations: In this case [L, μ] is uniquely determined by L.\nHence, in this case we can write L ∈ PML(Σ). In particular, every\nessential simple closed curve D ⊂ Σ by itself is a uniquely ergodic\nlamination, so that one has a canonical embedding C 0 (Σ) ⊂ PML(Σ).\nA complete decomposing system D on Σ is a lamination that is\nnot uniquely ergodic, so that it defines a finite dimensional simplex\nin PML(Σ). By associating to D the barycenter of this simplex (i.e.\nthe curves of D all carry the same weight) we obtain a well defined\nembedding CDS(Σ) ⊂ PML(Σ).\n(c) A lamination L in a surface Σ is called maximal if all of its complementary regions are triangles. A lamination L ⊂ Σ is called minimal\nif every leaf is dense in L. (This terminology refers to the partial order\non the set of laminations given by the inclusion.) A lamination which\nsatisfies both of these conditions is called minimal-maximal. Such laminations are totally arational, i.e. they do not contain any closed curve\nas leaf.\nAgain, the set of uniquely ergodic minimal-maximal laminations is\nwell known to be dense in PML(Σ).\n3.3. (a) An arc, a closed curve or a lamination in Σ is carried by a train\ntrack τ ⊂ Σ if it is contained in τ and throughout transverse to the\nI-fibers of τ . A curve can be carried by τ if after a suitable isotopy it is\ncarried by τ . The set of projective measured laminations [L, μ] which\nhave as support a lamination L carried by τ is denoted by PML(τ ).\n(b) Two simple arcs carried by τ are parallel if they intersect the same\nI-fibers, and these intersections occur on the two arcs in precisely the\nsame order. An arc, a closed curve or a lamination on Σ which is\ncarried by τ is said to cover τ if it meets every I-fiber of τ .\n(c) A train track τ 0 is carried by a train track τ if every I-fiber of τ 0 is a\nsubarc of an I-fiber of τ . Note that every curve (or arc or lamination)\ncarried by τ 0 is also carried by τ .\n(d) Given a train track τ and a lamination L carried by it, the notion of\na \"derived\" train τ1 with respect to L is formally defined in subsection\n2.3 of [4]. In slightly informal terms, τ1 is the train track obtained from\nτ by splitting τ at every cusp point along a unzipping path, which is a\npath disjoint from L that covers τ . If L is maximal-minimal, such a\n\n\fARE LARGE DISTANCE HEEGAARD SPLITTINGS GENERIC ?\n\n9\n\ntrain track always exists and is uniquely determined by τ and L. The\ntrain track τ1 obtained by splitting along shortest possible such paths\nis said to be derived from τ with respect to L, or simply derived from\nτ.\nNotice that L is always carried by τ1 , and that τ1 is carried by τ .\nMore generally, every sequence of unzipping paths leads to a new train\ntrack that is carried by the original one.\n(e) If τ 0 is derived from τ , then every curve (or lamination) that is\ncarried by τ 0 covers τ , by Lemma 2.9 of [3]. The proof of this lemma\nshows that the same is true for any arc which runs parallel on τ 0 to at\nleast one entire side of one of the connected components complementary\nto τ 0 , or parallel to one of the unzipping paths used to derive τ 0 from\nτ.\nDefinition 3.4. Let τ ⊂ Σ be a train track, and let L be a lamination\ncarried by τ . We say that L is n-gregarious with respect to τ if τ can\nbe derived n times with respect to L, i.e. there exists an n-tower of\nderived train tracks\nτ = τ0 ⊃ τ1 ⊃ . . . ⊃ τn\nsuch that L is carried by τn .\nWe conclude this subsection by stating a result from an earlier paper\nwhich is crucially used later on:\nProposition 3.5 (Proposition 2.12 in [3]). Let τ0 ⊃ τ1 ⊃ . . . ⊃ τn be\nan n-tower of derived train tracks in Σ. Assume that τ0 (and hence of\nany of the τi ) is maximal. Let D be a simple closed curve carried by\nτn . Then any essential simple closed curve D0 which satisfies\ndC (D, D0 ) ≤ n\nis carried by τ0 .\n3.2. Tight train tracks.\nPart (a) of the following definition has been introduced in [4]:\nDefinition 3.6. (a) A maximal train track τ ⊂ Σ is called tight with\nrespect to some complete decomposing system E on Σ if the following\nconditions are satisfied:\n(1) For any curve Ek ∈ E the intersection Ek ∩ τ is a disjoint union\nof (possibly exceptional) I-fibers of τ .\n\n\f10\n\nMARTIN LUSTIG AND YOAV MORIAH1\n\n(2) For every connected component ∆j complementary to τ the\nintersection segments with any Ek ∈ E are arcs with endpoints\non two distinct sides of ∆j .\n(3) Each of the three cusps of any complementary component ∆j\nis contained in some of the Ek .\n(b) A train track τ ⊂ Σ is called tight if it is tight with respect to some\ncomplete decomposing system E ∈ CDS(Σ).\nThe condition (3) of Definition 3.6 (a) is equivalent to stating that\nevery singular I-fiber of τ lies on some of the curves Ei ∈ E . We also\nwould like to point out that the notion of a tight train track is a fairly\ngeneral one: for example, a train track which is tight with respect to\nE may well carry a wave with respect to E.\nProposition 3.7 (Proposition 2.11 [4]). Let E be a complete decomposing system of Σ, and let τ be a maximal train track that is tight\nwith respect to E. Let c be a simple closed curve (or a finite collection\nof such) on Σ that is tight with respect to E and contains a subarc β\nwhich covers τ . Then c can be carried by τ .\n\u0003\nComplete decomposing systems D carried by train tracks have been\ninvestigated in [3]. It has been shown there that, for any maximal\ntrain track τ , every pair-of-pants P which is complementary to such a\nsystem D is either of \"eye glass shape\" or \"Θ-graph shape\". That is: P\nalways contains precisely two of the triangles that are complementary\ncomponents of τ , say ∆1 and ∆2 . More precisely, P is the regular\nneighborhood of the union of ∆1 and ∆2 , and of three arcs γ1 , γ2 γ3\nthat are carried by τ and have the cusps of ∆1 and ∆2 as endpoints.\nWe say that P has Θ-graph shape if every γk , for k = 1, 2, 3, connects a\ncusp of ∆1 to a cusp of ∆2 . On the other hand, P has eye glass shape\nif only one of the γk connects a cusp of ∆1 to a cusp of ∆2 , while each\nof the other two γh join two cusps from the same ∆i .\nRemark 3.8. If P is Θ-graph shaped, then any wave β in P can be\ncarried by τ . Furthermore β has to run parallel on τ to at least one\nentire side of one of the two connected components complementary to\nτ which are contained in P . This is an easy consequence of the above\ndefinitions (compare also Lemma 4.4 of [3]).\nThe following lemma has been stated and proved as Lemma 4.6 in [3],\nfor the special case where τ is a complete fat train track. We follow the\n\n\fARE LARGE DISTANCE HEEGAARD SPLITTINGS GENERIC ?\n\n11\n\nproof given there, except for the quote of Lemma 3.9 of [3], which has\nbeen generalized and corrected in Lemma 2.11 of [4], see Proposition\n3.7 above.\nLemma 3.9. Let τ ⊂ Σ be a maximal tight train track, and let τ 0 ⊂ τ\nbe a train track derived from τ . Let D be a complete decomposing system\nin Σ which is carried by τ 0 , with the property that every pair-of-pants\ncomplementary to D has Θ-graph shape. Let D ⊂ Σ be an essential\nsimple closed curve which is tight with respect to D, and assume that\nsome arc β from the set of arcs D − D is a wave with respect to D.\nThen D can be carried by τ .\nProof. By assumption τ is tight with respect to some system E ∈\nCDS(Σ). We can then isotope the curve D so that it is tight with\nrespect to E, while keeping it tight with respect to D. This can be\ndone, for example, by making every curve geodesic with respect to\nsome hyperbolic structure on Σ.\nLet P be the pair-of-pants complementary to D that contains the\nwave β. By assumption P has Θ-graph shape, so that by Remark 3.8\nthe wave β is carried by τ 0 , and β has to run parallel on τ 0 to at least one\nentire side of one of the two connected components complementary to\nτ 0 which are contained in P . Thus, by paragraph 3.3 (e) of subsection\n3.1, β covers τ . Hence we can apply Proposition 3.7 to conclude that\nD is carried by τ .\n\u0003\nCorollary 3.10. Let τ be a maximal tight train track. For some integer n ≥ 1, consider a complete decomposing system D ∈ CDS(τ ) which\nis n-gregarious with respect to τ , with the property that every complementary components has Θ-graph shape. Then every meridian curve\nD ∈ D(VD ) for the handlebody VD determined by D is (n−1)-gregarious\nwith respect to τ .\nMore specifically, if D is carried by τn , for some n-tower of derived\ntrain tracks τ = τ0 ⊃ . . . ⊃ τn−1 ⊃ τn , then D is carried by τn−1 .\nProof. Any curve D which bounds an essential disk in VD must either\nbelong to D, or else contain a wave with respect to D (see Remark 2.4).\nHence Lemma 3.9 shows that the curve D is (n − 1)-gregarious on τ .\n\u0003\n\n\f12\n\nMARTIN LUSTIG AND YOAV MORIAH1\n\n4. Transverse train tracks\nWe will now consider simultaneously two train tracks τ1 and τ2 on Σ,\nand for simplicity we assume that both are maximal. In order to work\nwith them, they have to be placed in a \"tight position\" with respect\nto each other. To control this, we observe that after a suitable isotopy\nwe may assume that the closure of every complementary component of\nτ1 ∪ τ2 is an m-gon, with vertices that are either cusp points on ∂τ1\nor ∂τ2 , or they are corners, i.e. points that belong to the intersection\n∂τ1 ∩ ∂τ2 . Hence the sides of these m-gons are arcs from ∂τ1 or from\n∂τ2 that do not contain any cusp point in their interior.\nDefinition 4.1. Two maximal train tracks τ1 , τ2 ⊂ Σ will be called\ntransverse if the following conditions hold:\n(1) Each connected component of τ1 ∩ τ2 , with the two inherited\nI-fiberings, is homemorphic to the standard square with horizontal and vertical interval fibers.\nIn particular, every intersection arc of ∂τi with τj , for {i, j} =\n{1, 2}, is a fiber in the I-fibering of τj . Furthermore the intersection τ1 ∩ τ2 does not contain any of the cusp points on either\n∂τ1 or ∂τ2 .\n(2) Every complementary component of τ1 ∪ τ2 in Σ is an m-gon\n(as defined above), with m ≥ 3.\nProposition 4.2. Let τ1 , τ2 ⊂ Σ be maximal transverse train tracks on\nΣ. If L1 , L2 are laminations covering τ1 and τ2 respectively, then L1\nand L2 intersect minimally.\nProof. If the minimal intersection number is not realized by L1 and\nL2 then there are leaves l1 ∈ L1 and l2 ∈ L2 which have a pair of\nintersection points that can be cancelled out by an isotopy. Hence there\nis a complementary region of l1 ∪ l2 in Σ that is a bigon. Either this\nbigon is innermost among all such bigons, or we can find an innermost\none by passing to other leaves l10 , l20 .\nIt follows that the segments of l10 and l20 which form the bigon are\noutermost (on the side of the bigon) on the branches of the train tracks\nτ1 and τ2 respectively, which carry these segments. Since by assumption\neach Li covers τi , it follows that the bigon meets τ1 ∪ τ2 only in a\ncollar around its boundary. Hence, the remainder of the bigon is a\ncomplementary component of τ1 ∪ τ2 which inherits the bigon shape.\nThis contradicts condition (3) of Definition 4.1 and thus our assumption\nthat the train tracks are transverse.\n\n\fARE LARGE DISTANCE HEEGAARD SPLITTINGS GENERIC ?\n\n13\n\n\u0003\nSince two maximal train tracks on Σ can never be disjoint, one obtains directly from the above proposition:\nCorollary 4.3. Let τ1 , τ2 ⊂ Σ be maximal transverse train tracks, and\nsuppose that L is a lamination that can be carried by both τ1 and τ2 .\nThen L can not cover both train tracks.\n\u0003\nProposition 4.4. Let τ and τ 0 be maximal transverse tight train tracks,\nand let n ≥ 1 be any integer. Let D ∈ CDS(τ ) be n-gregarious with\nrespect to τ , and let E ∈ CDS(τ 0 ) be 2-gregarious with respect to τ 0 .\nFurthermore assume that all of the complementary components of D\nand E in Σ have Θ-graph shape, with respect to τ and τ 0 respectively.\nThen the handlebodies VD and WE determined by D and E respectively\nsatisfy:\nd(VD , WE ) ≥ n − 1\nProof. We apply Corollary 3.10 to obtain that any meridian curve D\nfor VD is (n − 1)-gregarious on τ . Similarly, any meridian curve E for\nWE is 1-gregarious on τ 0 .\nThus, by paragraph 3.3 (e) of subsection 3.1, the curve E covers τ 0 .\nBut τ 0 is transverse to τ , so that by Corollary 4.3 the curve E can not\ncover τ . Hence, again by paragraph 3.3 (e) of subsection 3.1, E is not\ncarried by any train track τ1 derived from τ . Thus we can now apply\nProposition 3.5 to conclude that d(D, E) ≥ n − 1. This shows that\nd(VD , WE ) ≥ n − 1, as claimed.\n\u0003\nLemma 4.5. (a) Let U ⊂ PML(Σ) be any non-empty open set.\nThen there is a maximal tight train track τ ⊂ Σ such that U contains\nPML(τ ).\nb ⊂ PLM(Σ)2 contains the product\n(b) Every non-empty open set U\nPML(τ ) × PML(τ 0 ), for some transverse maximal tight train tacks τ\nand τ 0 .\nProof. (a) The set of uniquely ergodic minimal-maximal laminations is\ndense in PML(Σ) (see paragraph 3.2 (c) of subsection 3.1), so that\nU contains such a lamination L. We choose, at random, a hyperbolic\nstructure on Σ, and isotope the lamination L into geodesic position.\n\n\f14\n\nMARTIN LUSTIG AND YOAV MORIAH1\n\nLet E be any complete decomposing system of Σ, also assumed to be\nin geodesic position.\nConsider a complementary component ∆ of L, which by the minimalmaximal condition on L is an ideal hyperbolic triangle embedded into\nΣ. The (geodesic) curves of E cut through ∆, always entering and\nexiting ∆ through two distinct (geodesic) boundary sides. Notice that\nin the direction of each of the cusps of ∆ there are infinitely many\nintersection segments of E ∩ ∆, since E is a complete decomposing\nsystem and since no infinite half-leaf of L can stay within any of the\ncomplementary pairs-of-pants, as L is minimal-maximal.\nFor any \u000f > 0 we can consider the subsurface ∆\u000f ⊂ ∆ which is given\nby all points of distance ≥ \u000f from the boundary ∂∆. The subsurfaces\n∆\u000f are triangles with almost geodesic boundary edges (for small values\nof \u000f), and by a proper variation of \u000f we can force a cusp point of its\nboundary to lie on one of the intersection arcs of E ∩ ∆. We do this for\neach of the three cusp points individually, and vary \u000f accordingly in a\ncontinuous fashion along the triangle sides, to obtain a pseudo-geodesic\nhyperbolic triangle ∆0 which has all three cusp points on E.\nOnce the pseudo-hyperbolic triangles ∆0i are obtained for all of the\ncomplementary components of L, we fiber the complement of the union\nof E and of all ∆0i by small geodesic arcs which run \"parallel\" to the\nintersection arcs of E with Σ r (∪∆0i ), so that the closure of Σ r (∪∆0i )\nbecomes indeed a maximal train track τ which is tight with respect to\nE, and τ carries L.\nNow, if all of the parameters \u000f > 0 in the above construction have\nbeen chosen small enough, the resulting train track τ carries only laminations L0 which, when isotoped into geodesic position, intersect E\nin points that are very close to intersection points of E ∩ L, and the\nintersection angles of E with L0 will be very close to the corresponding\nangles with L. Hence L0 is very close to L in PLM(Σ). This shows\nthat for sufficiently small \u000f the set PML(τ ) will be contained in U .\n(b) By the denseness of the uniquely ergodic minimal-maximal laminations (see paragraph 3.2 (c) of subsection 3.1) we can find a pair (L, L0 )\nb which in addition satisfies L =\nof such laminations in U\n6 L0 . Hence, if\nwe perform the same procedure as in part (a) with respect to the same\nhyperbolic structure on Σ, for both laminations, for sufficiently small\n\u000f-parameters the resulting train tracks τ, τ 0 will be tight and maximal\nas before, and PML(τ ) × PML(τ 0 ) ⊂ U × U . In addition, up to\nmaking \u000f even smaller, the train tracks τ and τ 0 will be transverse with\nrespect to each other.\n\u0003\n\n\fARE LARGE DISTANCE HEEGAARD SPLITTINGS GENERIC ?\n\n15\n\n5. Density of SN OW\nLet τ be a maximal train track on Σ, and let D be a complete\ndecomposing system carried by τ .\nDefinition 5.1. We say that D is calm with respect to τ (or simply D\nis calm) if none of the transverse I-fibers of τ contains a subarc that is\na wave with respect to D. The set of such calm complete decomposing\nsystems carried by τ will be denoted by CCDS(τ ).\nThe proof of the following lemma is elementary and thus left to the\nreader. The reader should compare its statement to that of Remark\n3.8 which is also about waves on calm complete decomposing systems.\nLemma 5.2. Let τ be a maximal train track on Σ. Then any complete decomposing system D carried by τ is calm if and only if every\ncomplementary pair-of-pants has Θ-graph shape.\n\u0003\nThe following is a crucial ingredient for the main result of this paper:\nProposition 5.3. Every maximal train track τ ⊂ Σ carries some complete decomposing system D which is calm.\nProof. Since the train track τ is maximal, all of its complementary\nregions in Σ are triangles. Choose an arbitrary partition of these regions\ninto pairs ∆i , ∆0i . Consider the pair ∆1 and ∆01 of complementary\nregions, and denote by c1 , c2 , c3 the cusps of ∆1 and by c01 , c02 , c03 those\nof ∆01 . We will build a Θ-shaped pair-of-pants out of ∆1 and ∆01 by\nconstructing three paths γi,j as above, which are carried by τ and\nconnect the cusp ci to the cusp c0j .\nWe will show below that, using an appropriate lamination L carried\nby τ , one can find such paths γi,j by exhibiting finite subsegments li,j\nof some leaf l of L. This subsegment li,j has endpoints R, S on the\nsame (singular) I-fibers I1 and I2 of τ as the two cusps ci and c0j . One\nthen moves the ends of li,j by an I-fiber preserving isotopy so that\n∗\nit reaches a position li,j\nwith endpoints on ci and c0j . The problem,\nof course, is that the isotopy can only be performed if li,j is properly\nchosen: this means that the interior of li,j does not intersect either of\nthe subsegments [R, ci ] ⊂ I1 or [S, c0j ] ⊂ I2 , i.e. the subsegments on the\ntwo singular I-fibers which are bounded by the cusps and the endpoints\nof li,j . The following procedure avoids this problem:\n\n\fMARTIN LUSTIG AND YOAV MORIAH1\n\n16\n\n(1) By the denseness of the set of uniquely ergodic minimal-maximal\nlaminations (see paragraph 3.2 (c) of subsection 3.1) there exists such a lamination L that covers τ . For any sides δ of ∆1\nand δ 0 of ∆01 there are boundary leaves of L which run parallel along all of δ or δ 0 . Since in minimal-maximal laminations\nevery leaf is dense, any non-boundary leaf l of L will contain\na finite segment l0 which starts with a subsegment that runs\nparallel to δ and ends in a subsegment that runs parallel to δ 0 ,\nsee Figure 1. By possibly passing to a smaller subsegment we\ncan assume that l0 is a minimal such finite segment of l, i.e., it\ncontains no proper subsegment with the same property. It follows that the subsegment l1,1 of l0 , obtained from l0 by cutting\noff the initial and the terminal subarcs parallel to δ and to δ 0\nrespectively, connects the singular fiber of a cusp of ∆1 (say c1 )\nto the singular fiber of a cusp of ∆01 (say c01 ). Note that l1,1 is\nproperly chosen in the above defined sense, by our minimality\nrequirement on l1,1 . Isotope l1,1 as above along the fibers to get\n∗\n∗\n.\nwhich connects c1 to c01 and set γ1,1 = l1,1\na path l1,1\n\nl\n\nτ\nΔ'1\n\nc'1\n\nδ\n\nl1,1\n\nδ'\n\nI - fibers\n\nΔ1\n\nc1\n\nτ\n\nl\n\nFigure 1.\n(2) Split τ open along γ1,1 to get a train track τ 0 , and consider some\nuniquely ergodic minimal-maximal lamination (again called L)\nthat fills τ 0 . Let δ and δ 0 be the sides of ∆1 and ∆01 respectively\nwhich are situated opposite the cusps c1 and c01 . Now proceed\n\n\fARE LARGE DISTANCE HEEGAARD SPLITTINGS GENERIC ?\n\n17\n\nprecisely in the same manner as above in part (1). As before,\n∗\nwe obtain a simple arc l2,2\ncarried by τ 0 that connects c2 to c02 .\n∗\n.\nWe set γ2,2 = l2,2\nAs before we split τ 0 open along γ2,2 to obtain a train track τ 00 , and\nagain we are looking for a simple arc on some leaf of a lamination L\nthat is uniquely ergodic minimal-maximal and which fills τ 00 , in order\nto connect c3 to c03 . At this point, however, the problem of finding a\n∗\n, becomes more delicate:\nproperly chosen segment l3,3\n(3) We first chose an arc d on the boundary of τ 00 that starts at c3 ,\nruns along a side of ∆1 , then proceeds along either γ1,1 or γ2,2 ,\nand finally runs along a side of ∆01 , to end at c03 .\nSince L is minimal-maximal and fills τ 00 , we can find a nonboundary leaf l in L which contains a finite segment d1 that\nruns parallel to d. We now consider an arc on l which starts\nat an endpoint of d1 . Since every leaf of L is dense in L, any\nsufficiently long such arc contains a segment d2 of l that is\nparallel to d and d1 and lies between them. As before, we\nassume that the arc l is minimal, i.e. it doesn't contain a proper\nsubarc which has the same properties as used above to define l.\nIf d1 and d2 are traversed in the same direction when travelling along l, then the segment on l between d1 and d2 is the\ndesired properly chosen arc l3,3 . (See Figure 2.)\nIf not, consider an arc on l with the same initial point but\nwhich runs in the opposite direction. As above, if the arc is\nsufficiently long, it will contain a subarc d3 that runs between\nd and d2 (where, as before, we assume that d3 is the first occurrence of such a subarc when travelling along l). Again, if l\ntraverses d1 and d3 in the same direction, the subpath between\nd1 and d3 is the desired properly chosen subsegment l3,3 (note\nthat d2 is not part of this subpath !). If the directions are opposite, then the subpath of l which connects d2 to d3 is the\n∗\ndesired properly chosen segment l3,3 . As before, set γ3,3 = l3,3\n.\n(See Figure 3.)\nWe now split τ 00 open along γ3,3 , to obtain a train track τ1 , which\nhas an I-fibering by subarcs of the I-fibers of τ , and which has as\ncomplementary surfaces one pair-of-pants (which contains ∆1 and ∆01\nas subsurfaces), while all of the other complementary subsurfaces coincide with the complementary subsurfaces ∆i and ∆0i (i 6= 1) of the\n\n\fMARTIN LUSTIG AND YOAV MORIAH1\n\n18\n\nd\n\nd\n\nd1\n\nc'1\n\nΔ' 1\n\nc'3\n\nd1\n\nl\n\nd2\n\nd2\n\nc1\nc3\n\nΔ1\n\nFigure 2.\noriginal train track τ . We now repeat the same procedure as before,\nfor τ1 instead of τ and ∆2 , ∆02 instead of ∆1 , ∆01 .\nWe proceed iteratively until none of the ∆i , ∆0i are left: In this process, we obtain more and more complementary components of the resulting train tracks τi which are pairs-of-pants, and less and less triangles ∆j , ∆0j . It is possible that in this process the train track decomposes into more than one connected component, so that we are perhaps\nforced to reorganize the pairing of the triangles. However, by an elementary Euler characteristic argument, if the boundary curve of some\npair-of-pants separates the surface Σ, then on each side there must be\nan even number of triangles, so that we can continue the iteration procedure with τi being a connected component of the train track obtained\nafter the (i - 1)-th iteration step.\nAfter the last step of our iteration none of the triangles is left over, so\nthat the union of all connected components of the train track doesn't\nhave any cusps in its boundary: It is hence a disjoint union of fibered\nannuli Ai .\nEvery connected component in the complement of these annuli is a\npair-of-pants which by construction has Θ-shape with respect to the\nI-fibering of the original train track τ . We can now contract each of\n\n\fARE LARGE DISTANCE HEEGAARD SPLITTINGS GENERIC ?\n\n19\n\nd\n\nd1\n\nd1\n\nd\n\nc'1\nc'3\n\nd\n\nd2\n\nd3\n\nl\n\nd2\n\nd3\n\nc1\nc3\n\nFigure 3.\nthe annuli Ai by an I-fiber-preserving isotopy until the two boundary\ncurves coincide. The resulting curve system D is precisely the desired\ncomplete decomposing system: It is carried by τ , and each complementary pair-of-pants has Θ-graph shape. It follows from Lemma 5.2 that\nD is calm with respect to τ .\n\u0003\nCorollary 5.4. For every maximal train track τ ⊂ Σ the set CCDS(τ )\nof calm complete decomposing systems carried by τ is dense PML(τ ).\nProof. By Lemma 4.5 (a) for every open set U in PML(τ ) there is a\nmaximal train track τ 0 such that U contains PML(τ 0 ). Since the set\nof uniquely ergodic minimal-maximal laminations is dense in PML(Σ)\n(see paragraph 3.2 (c) of subsection 3.1), there is such a lamination L\nin PML(τ ) ⊂ U . Since L is maximal, it covers τ 0 . Hence we can split\nτ 0 following the leaves of L, until the I-fibers of τ 0 are small enough\nso that they can be isotoped simultaneously onto I-fibers of τ , thus\nshowing that τ 0 is carried by τ . Now we apply Proposition 5.3 to\nobtain a complete decomposing system D which is calm with respect\nto τ 0 , and hence also with respect to τ .\n\n\f20\n\nMARTIN LUSTIG AND YOAV MORIAH1\n\n\u0003\nLemma 5.5. Let τ and τ 0 be maximal transverse train tracks on Σ,\nand let D and D0 be complete decomposing systems carried by τ and τ 0\nrespectively. Let τ1 and τ10 be the 1-derived train tracks with respect to\nD and D0 . We have:\n(i) If D and D0 are calm with respect to τ and τ 0 respectively, then\nthey are SN OW .\n(ii) If D and D0 are carried by τ1 and τ10 and are SN OW , then they\nare calm with respect to τ and τ 0 respectively.\nProof. (i) If there was a wave ω, say on D with respect to D0 , then, by\ntransversality of τ and τ 0 , there are precisely two possibilities:\nEither ω is contained in one of the \"doubly-fibered\" crossing of the\ntwo train tracks, thus giving rise (see Figure 4) to a wave with respect\nto D0 on some of the transverse I-fibers of τ 0 , in contradiction to the\nassumption that D0 is calm.\n\nD'\n\nl'\nτ'\n\nτ\n\nω\n\nD\n\nl\n\nFigure 4. The darkened arc ω is a wave on D with\nrespect to D0 .\nThe other possibility is that the wave ω (up to small initial and\nterminal segments that belong to τ 0 ) is contained in one of the complementary components ∆ of τ 0 , so that ω connects two of the curves of\n\n\fARE LARGE DISTANCE HEEGAARD SPLITTINGS GENERIC ?\n\n21\n\nD0 that are outermost on τ 0 . But since all of the complementary components of τ 0 are triangles, ∆ is divided by ω into a part that contains\ntwo cusps, and another part that contains a single cusp (see Figure\n5). Isotope this wave (so that its endpoints move on D0 ) in the direction of the \"single-cusp\", until it slides over that cusp, so that it will\nreach a position parallel to a segment of one of the transverse I-fibers\nof τ 0 . Thus it will define a wave on such an I-fiber, giving the same\ncontradiction as in the first case.\n\nD'\nτ'\n\nω\n\nΔ'\n\nτ'\nD'\n\nFigure 5.\n(ii) Assume by way of contradiction that, say, D is not calm with\nrespect to τ . This means that there is a transverse I-fiber of τ which\ncontains a wave ω with respect to D. That is, ω is an arc with both\nend points on the same leaf l ∈ D. Since D is carried by the derived\ntrain track τ1 , the two endpoints of ω are contained in two subarcs of\nl which run parallel (on τ ) to each other along a path α that covers τ ,\nsee 3.3 (e) of subsection 3.1.\nHence ω can be isotoped in τ along the path α, and during this\nisotopy its endpoints never \"split\" across a cusp point of τ .\nAs τ and τ 0 are transverse, the isotopy along α will eventually take\nω into some \"doubly-fibered\" intersection rectangle of τ ∩ τ 0 , where ω\nbecomes an arc which is parallel to a fiberof τ . But that means that\n\n\f22\n\nMARTIN LUSTIG AND YOAV MORIAH1\n\nthere is some arc on a leaf of D0 which is parallel to ω and hence D0 will\ncontain a wave with respect to D. So that D and D0 are not SN OW .\n\u0003\nProposition 5.6. The subset of pairs (D, D0 ) that are SNOW is dense\nin PML(Σ)2 .\nProof. Every lamination on Σ is carried by some maximal train track\nτi ⊂ Σ, so that PML(Σ) is the union over a suitable (countable)\nfamily of subspaces PML(τi ) ⊂ PML(Σ). In each PML(τi ) the set\nCCDS(τi ) is dense, by Corollary 5.4.\nHence the set CCDS(τi )×CCDS(τj ) is dense in PML(τi )×PML(τj ),\nfor all pairs of indices i, j, and the union of them is equal to PML(Σ)2 .\nBy Lemma 5.5 (a) any pair of complete decomposing systems (D, D0 ) ∈\nCCDS(τi ) × CCDS(τj ) is SN OW . Hence the set SN OW (Σ) is dense\nin PML(Σ)2 .\n\u0003\n6. Open and dense subsets of SN OW (Σ)\nWe consider maximal train tracks τ and τ 0 on Σ, and we assume\nthat they are transverse. Given two complete decomposing systems\nD, E ∈ CDS(Σ). The handlebodies they determine are denoted by\nVD , WE respectively.\nDefinition 6.1. We denote the subset of PML(τ ) given by all ngregarious laminations (see Definition 3.4) by Gn (τ ), and define Gn P(τ )\n= Gn (τ ) ∩ P(τ ). Here P(τ ) denotes the set of all laminations that define positive weight on each I-fiber of the train track τ .\nProposition 6.2. Let τ and τ 0 be maximal transverse train tracks, and\nlet n ≥ 1 be an integer. Then one has:\n(a) The subset Gn P(τ ) × G2 P(τ 0 ) is open and of full measure in\nPML(τ ) × PML(τ 0 ).\n(b) The subset Gn PCCDS (τ, τ 0 ) :=\n(CCDS(τ ) × CCDS(τ 0 )) ∩ (Gn P(τ ) × G2 P(τ 0 ))\nis dense in Gn P(τ ) × G2 P(τ 0 ).\n(c) Every pair (D, E) ∈ Gn PCCDS (τ, τ 0 ) satisfies:\nd(VD , WE ) ≥ n − 1\n\n\fARE LARGE DISTANCE HEEGAARD SPLITTINGS GENERIC ?\n\n23\n\nProof. (a) This has been proved as Propositions 3.10 and 3.11 in [4].\n(b) This follows directly from the fact that CCDS(τ ) and CCDS(τ 0 )\nare dense in PML(τ ) and PML(τ 0 ) respectively (see Corollary 5.4),\nsince the subsets Gn P(τ ) and G2 P(τ 0 ) are open.\n(c) This statement is a direct consequence of Proposition 4.4.\n\u0003\nWe also recall the following:\nRemark 6.3. (a) The union of all products P(τ )×P(τ 0 ), over all pairs\nτ, τ 0 of tight maximal transverse train tracks on Σ, is an open and dense\nset in PM L(Σ)2 .\nThis is a direct consequence of Lemma 4.5 (b) and the fact that the\nsets P(τ ) are open by definition.\n(b) In particular, the above union is of full measure in PML(Σ)2 .\nThis follows directly from statement (a) and from the fact that our\nmeasure is a Lebesgue measure on the manifold PML(Σ)2 .\nRemark 6.4. In the proof of the next theorem we need to compare, for any pair of transverse maximal train tracks τ and τ 0 , the set\nSN OW (Σ)∩(PLM(τ )×PLM(τ 0 )) with the set CCDS(τ )×CCSD(τ 0 ).\nFrom Proposition 5.5 one doesn't quite get equality of the two sets,\nsince in part (ii) of this proposition one needs the additional property\nthat the curve systems D and D0 are carried by once derived train\ntracks τ1 ⊂ τ and τ10 ⊂ τ 0 .\nHowever, if we restrict our attention to those systems that are in\naddition 1-gregarious, this extra condition is always satisfied, so that\nProposition 5.5 proves:\nSN OW (Σ) ∩ (G1 P(τ ) × G1 P(τ 0 )) =\n(CCDS(τ ) × CCSD(τ 0 )) ∩ (G1 P(τ ) × G1 P(τ 0 ))\nTheorem 6.5. For any integer n ≥ 1, the set SN OWn−1 (Σ) is generic\nin the set SN OW (Σ).\nProof. This proof is an application of the genericity criterium stated in\nLemma 1.2 (1), with the notation used there specified as follows:\n(1) X = PM L(Σ)2\n(2) Y = SN OW (Σ)\n(3) A = SN OWn−1 (Σ)\n\n\f24\n\nMARTIN LUSTIG AND YOAV MORIAH1\n\n(4) Z = ∪ Gn P(τ ) × G2 P(τ 0 ), where the union is taken over all\npairs of transverse maximal tight train tracks τ, τ 0 on Σ.\nAccording to Lemma 1.2 (1) it suffices to show that:\n(a) Z is contained in the closure of SN OWn−1 (Σ),\n(b) Z is open and of full measure in PM L(Σ)2 , and\n(c) that this set Z is disjoint from SN OW (Σ) r SN OWn−1 (Σ).\n(a) By Lemma 5.5 (i) and Proposition 6.2 (c), for any two transverse\nmaximal tight train tracks τ, τ 0 on Σ, every pair (D, E) ∈ Gn PCCDS (τ, τ 0 )\nis SN OW and d(VD , WE ) ≥ n − 1. We obtain:\nGn PCCDS (τ, τ 0 ) ⊂ SN OWn−1 (Σ)\nBy Proposition 6.2 (b) the set Gn PCCDS (τ, τ 0 ) is dense in Gn P(τ ) ×\nG2 P(τ 0 ). Thus Z is contained in the closure of all Gn PCCDS (τ, τ 0 ) and\nthus in the closure of SN OWn−1 (Σ).\n(b) The set Gn P(τ )×G2 P(τ 0 ) is open and of full measure in PML(τ )×\nPML(τ 0 ), by Proposition 6.2 (a). Hence this set is of full measure in\nthe open subset P(τ ) × P(τ 0 ) ⊂ PML(τ ) × PML(τ 0 ). By Remark 6.3\nthe union of all P(τ ) × P(τ 0 ) is open and of full measure in PML(Σ)2 .\nHence the union Z of all Gn P(τ )×G2 P(τ 0 ) is open and of full measure\nin PML(Σ)2 .\n(c) The intersection of SN OW (Σ) with the union Z of all Gn P(τ ) ×\nG2 P(τ 0 ) is the union of the intersections of SN OW (Σ) with any of\nthe individual sets Gn P(τ ) × G2 P(τ 0 ). Consider therefore the set\nSN OW (Σ) ∩ (Gn P(τ ) × G2 P(τ 0 )). This set is contained in the product set G1 P(τ ) × G1 P(τ 0 ), by definition. However, the intersection of\nG1 P(τ ) × G1 P(τ 0 ) with SN OW (Σ) is precisely\n(CCDS(τ ) × CCSD(τ 0 )) ∩ (G1 P(τ ) × G1 P(τ 0 )) ,\nby Remark 6.4. Hence we obtain\nSN OW (Σ) ∩ (Gn P(τ ) × G2 P(τ 0 )) =\nSN OW (Σ) ∩ (G1 P(τ ) × G1 P(τ 0 )) ∩ (Gn P(τ ) × G2 P(τ 0 )) =\n(CCDS(τ )×CCSD(τ 0 ))∩(G1 P(τ )×G1 P(τ 0 ))∩(Gn P(τ )×G2 P(τ 0 )) =\n(CCDS(τ ) × CCSD(τ 0 )) ∩ (Gn P(τ ) × G2 P(τ 0 )) =\nGn PCCDS (τ, τ 0 ) ,\nwhere the last equation is simply the definition of Gn PCCDS (τ, τ 0 ). We\ncan now apply Proposition 6.2 (c) to obtain that this set is contained\nin SN OWn−1 (Σ). Thus Z is disjoint from SN OW (Σ)rSN OWn−1 (Σ).\nThis finishes the proof of the theorem.\n\n\fARE LARGE DISTANCE HEEGAARD SPLITTINGS GENERIC ?\n\n25\n\n\u0003\n\n7. Generic Heegaard splittings have large distance\nIn this section we study, for a surface Σ of a fixed genus g ≥ 2, the\nset Hg , defined as follows: Recall that a handlebody set D(V ) ⊂ C(Σ)\nis given by some identification Σ = ∂V , where V is a handlebody\nand D(V ) consists precisely of those curves on Σ that are identified\nby Σ = ∂V with meridians of V . We define the set Hg to consist of\nall pairs (D(V ), D(W )) of handlebody sets in C(Σ). Of course, the\nidentifications ∂V = Σ = ∂W define a closed 3-manifold M which\ncontains Σ as a Heegaard surface.\nWe further define Hng ⊂ Hg to be the set of such pairs which are of\ndistance ≥ n.\nBy Lemma 2.5 each irreducible Heegaard splitting admits a pair of\ncomplete decomposing systems (D, E) which are in SN OW (Σ). Hence\nthere exist a map\nσH : Hg → SN OW (Σ) ⊂ PML(Σ)2\nsuch that σH (D(V ), D(W )) = (D, E) satisfies D ∈ D(V ), E ∈ D(W ).\nThere are many different possible choices for the map σH , and none\nof them may merit the attribute \"natural\". However, we point out that\nthe results of this section hold for any such map σH .\nAs in the previous sections, the natural Lebesgue measure class on\nPML(Σ)2 naturally defines generic subsets of σH (Hg ).\nCorollary 7.1. For any integers g ≥ 2 and n ≥ 0 the set σH (Hng ) is\ngeneric in the set σH (Hg ).\nNotice that there is a canonical bijection between the set S g of\nmarked Heegaard surfaces as introduced in subsection 1.3, and the set\nHg studied here: The marking homeomorphism θ : Σ → Sg of a marked\nHeegaard surface Sg in a 3-manifold M , with complete meridian decomposing systems D and E for the two handlebody complements of Sg in\nM , defines canonically a pair of handlebody sets D(Vθ−1 (D) , D(Vθ−1 (E) ),\nand conversely. Since the described canonical bijection between S g\nand Hg is clearly distance preserving, the statement of Corollary 7.1 is\nequivalent to that of Corollary 1.3.\nBefore proving Corollary 7.1, we will state a more general fact about\ngeneric sets in the subset SN OW (Σ) of PML(Σ)2 :\n\n\f26\n\nMARTIN LUSTIG AND YOAV MORIAH1\n\nProposition 7.2. Let H be a subset of SN OW (Σ), and assume that\nHn = H ∩ SN OWn (Σ) has the following property:\n(∗) For every pair of transverse maximal train tracks τ, τ 0 the set\nHn ∩ Gn P(τ ) × G2 P(τ 0 ) is dense in Gn P(τ ) × G2 P(τ 0 ).\nThen Hn is generic in H.\nProof. This follows directly from the observation that the hypothesis\n(∗) on Hn is the only ingredient necessary in order to be able to apply\nthe proof of Theorem 6.5 word-by-word, with SN OWn (Σ) replaced by\nHn and SN OW (Σ) replaced by H.\n\u0003\nProof of Corollary 7.1. Apply Proposition 7.2 to H = σH (Hg ) and\nHn = σH (Hng ): It suffices to show that property (∗) holds, in order\nto conclude that σH (Hng ) is generic in σH (Hg ).\nWe now prove statement (∗): For this purpose we need to show that\nany non-empty open set U ⊂ Gn P(τ ) × G2 P(τ 0 ) contains a point from\nσ(Hng ).\nConsider any pair (L, L0 ) of minimal-maximal uniquely ergodic laminations in Gn P(τ )×G2 P(τ 0 ). Recall (see paragraph 3.2 (c) of Section\n3) that the set of such pairs is dense in PML(Σ)2 , and hence dense in\nGn P(τ ) × G2 P(τ 0 ), since the latter is an open subset of PML(Σ). So\nU contains such a pair (L, L0 ).\nThe open neighborhood U of (L, L0 ) contains the open set P(τk ) ×\n0\n) for sufficiently large k, m ≥ 1, where τk is the train track obP(τm\n0\nis the\ntained from τ by deriving k times in the direction of L, and τm\n0\ntrain track obtained from τ by by deriving m times in the direction of\nL0 . Without loss of generality, we can assume that k ≥ n and m ≥ 2.\n0\n0\nLet τk+1 and τm+1\nbe train tracks once more derived from τk and τm\nrespectively.\nBy Proposition 5.6 the set SN OW (Σ) is dense in PML(Σ). Since\n0\n0\nP(τk+1 ) × P(τm+1\n) is open, there is a pair (D, E) ∈ P(τk+1 ) × P(τm+1\n)\nwhich is SN OW . We now conclude, by Corollary 3.10, that the pair\n(D0 , E 0 ) ∈ σH (Hg ), which determines the same pair of handlebodies\n0\nV, W as (D, E), satisfies (D0 , E 0 ) ∈ P(τk ) × P(τm\n) ⊂ U . From our\nassumptions k ≥ n and m ≥ 2 we conclude that (D0 , E 0 ) ∈ σH (Hng ).\nThis shows that σH (Hng )∩(Gn P(τ )×G2 P(τ 0 )) is dense in Gn P(τ )×\n2\nG P(τ 0 ), as desired.\n\u0003\n\n\fARE LARGE DISTANCE HEEGAARD SPLITTINGS GENERIC ?\n\n27\n\nReferences\n[1] N. Dunfield, W. Thurston, Finite covers of random 3-manifolds Invent. Math.\n166 (2006), no. 3, 457 - 521.\n[2] J. Hempel, 3-manifolds as viewed from the curve complex, Topology 40 (2001),\n631 - 657.\n[3] M. Lustig, Y. Moriah, High distance Heegaard splittings via fat train tracks.\narXiv:0706.0599 math.GT.\n[4] M. Lustig, Y. Moriah, Horizontal Dehn surgery and genericity in the curve\ncomplex arXiv:0711.4492v1\n[5] J. Maher, Random walks on the mapping class group, Preprint 2006,\narXiv:math.GT/0604433.\n[6] D. McCullough, Virtually geometrically finite mapping class groups of 3manifolds. J. Differential Geom. 33 (1) (1991), 1 - 65 .\n[7] H. Masur, Y. Minsky, Geometry of the complex of curves I: hyperbolicity, Inventiones. Mathematicae 138 (1999), 103 - 149.\nMathématiques (LATP), Université P. Cézanne - Aix-Marseille III,\n52 Ave. Escad. Normandie-Niemen, 13397 Marseille 20, France\nE-mail address: martin.lustig@univ-cezanne.fr\nDepartment of Mathematics, Technion, Haifa, 32000 Israel\nE-mail address: ymoriah@tx.technion.ac.il\n\n\f"}