{"id": "http://arxiv.org/abs/0905.3791v4", "guidislink": true, "updated": "2009-10-23T05:00:17Z", "updated_parsed": [2009, 10, 23, 5, 0, 17, 4, 296, 0], "published": "2009-05-23T06:42:14Z", "published_parsed": [2009, 5, 23, 6, 42, 14, 5, 143, 0], "title": "Maximally entangled three-qubit states via geometric measure of\n  entanglement", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0905.1644%2C0905.3456%2C0905.4820%2C0905.1649%2C0905.3317%2C0905.0755%2C0905.1175%2C0905.4501%2C0905.1387%2C0905.0192%2C0905.2417%2C0905.0078%2C0905.2986%2C0905.4201%2C0905.3198%2C0905.1955%2C0905.3776%2C0905.1641%2C0905.0513%2C0905.4868%2C0905.4216%2C0905.0752%2C0905.0660%2C0905.0223%2C0905.3901%2C0905.3674%2C0905.0747%2C0905.2344%2C0905.0228%2C0905.2425%2C0905.3525%2C0905.3538%2C0905.0722%2C0905.2220%2C0905.2968%2C0905.2420%2C0905.2099%2C0905.4829%2C0905.3476%2C0905.4457%2C0905.2605%2C0905.3946%2C0905.1094%2C0905.3230%2C0905.4885%2C0905.1256%2C0905.2513%2C0905.1189%2C0905.3125%2C0905.3089%2C0905.1537%2C0905.1646%2C0905.4700%2C0905.3798%2C0905.0746%2C0905.1162%2C0905.3421%2C0905.3712%2C0905.2916%2C0905.1485%2C0905.0383%2C0905.3865%2C0905.3249%2C0905.0481%2C0905.4825%2C0905.0414%2C0905.0018%2C0905.3376%2C0905.4574%2C0905.4879%2C0905.1059%2C0905.2395%2C0905.0670%2C0905.2490%2C0905.2257%2C0905.3864%2C0905.0142%2C0905.1081%2C0905.2323%2C0905.3101%2C0905.3791%2C0905.2555%2C0905.4003%2C0905.3968%2C0905.1632%2C0905.1795%2C0905.3638%2C0905.4187%2C0905.2078%2C0905.0101%2C0905.4006%2C0905.2865%2C0905.3984%2C0905.0045%2C0905.3497%2C0905.0057%2C0905.2064%2C0905.2808%2C0905.4730%2C0905.3006%2C0905.4650&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Maximally entangled three-qubit states via geometric measure of\n  entanglement"}, "summary": "Bipartite maximally entangled states have the property that the largest\nSchmidt coefficient reaches its lower bound. However, for multipartite states\nthe standard Schmidt decomposition generally does not exist. We use a\ngeneralized Schmidt decomposition and the geometric measure of entanglement to\ncharacterize three-qubit pure states and derive a single-parameter family of\nmaximally entangled three-qubit states. The paradigmatic\nGreenberger-Horne-Zeilinger (GHZ) and W states emerge as extreme members in\nthis family of maximally entangled states. This family of states possess\ndifferent trends of entanglement behavior: in going from GHZ to W states the\ngeometric measure and the relative entropy of entanglement and the bipartite\nentanglement all increase monotonically whereas the three-tangle and\nbi-partition negativity both decrease monotonically.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0905.1644%2C0905.3456%2C0905.4820%2C0905.1649%2C0905.3317%2C0905.0755%2C0905.1175%2C0905.4501%2C0905.1387%2C0905.0192%2C0905.2417%2C0905.0078%2C0905.2986%2C0905.4201%2C0905.3198%2C0905.1955%2C0905.3776%2C0905.1641%2C0905.0513%2C0905.4868%2C0905.4216%2C0905.0752%2C0905.0660%2C0905.0223%2C0905.3901%2C0905.3674%2C0905.0747%2C0905.2344%2C0905.0228%2C0905.2425%2C0905.3525%2C0905.3538%2C0905.0722%2C0905.2220%2C0905.2968%2C0905.2420%2C0905.2099%2C0905.4829%2C0905.3476%2C0905.4457%2C0905.2605%2C0905.3946%2C0905.1094%2C0905.3230%2C0905.4885%2C0905.1256%2C0905.2513%2C0905.1189%2C0905.3125%2C0905.3089%2C0905.1537%2C0905.1646%2C0905.4700%2C0905.3798%2C0905.0746%2C0905.1162%2C0905.3421%2C0905.3712%2C0905.2916%2C0905.1485%2C0905.0383%2C0905.3865%2C0905.3249%2C0905.0481%2C0905.4825%2C0905.0414%2C0905.0018%2C0905.3376%2C0905.4574%2C0905.4879%2C0905.1059%2C0905.2395%2C0905.0670%2C0905.2490%2C0905.2257%2C0905.3864%2C0905.0142%2C0905.1081%2C0905.2323%2C0905.3101%2C0905.3791%2C0905.2555%2C0905.4003%2C0905.3968%2C0905.1632%2C0905.1795%2C0905.3638%2C0905.4187%2C0905.2078%2C0905.0101%2C0905.4006%2C0905.2865%2C0905.3984%2C0905.0045%2C0905.3497%2C0905.0057%2C0905.2064%2C0905.2808%2C0905.4730%2C0905.3006%2C0905.4650&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Bipartite maximally entangled states have the property that the largest\nSchmidt coefficient reaches its lower bound. However, for multipartite states\nthe standard Schmidt decomposition generally does not exist. We use a\ngeneralized Schmidt decomposition and the geometric measure of entanglement to\ncharacterize three-qubit pure states and derive a single-parameter family of\nmaximally entangled three-qubit states. The paradigmatic\nGreenberger-Horne-Zeilinger (GHZ) and W states emerge as extreme members in\nthis family of maximally entangled states. This family of states possess\ndifferent trends of entanglement behavior: in going from GHZ to W states the\ngeometric measure and the relative entropy of entanglement and the bipartite\nentanglement all increase monotonically whereas the three-tangle and\nbi-partition negativity both decrease monotonically."}, "authors": ["Sayatnova Tamaryan", "Tzu-Chieh Wei", "DaeKil Park"], "author_detail": {"name": "DaeKil Park"}, "author": "DaeKil Park", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevA.80.052315", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0905.3791v4", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0905.3791v4", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "final version, to appear in PRA", "arxiv_primary_category": {"term": "quant-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "quant-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0905.3791v4", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0905.3791v4", "journal_reference": "Phys. Rev. A 80, 052315 (2009)", "doi": "10.1103/PhysRevA.80.052315", "fulltext": "Maximally entangled three-qubit states via geometric measure of\nentanglement\nSayatnova Tamaryan\n\narXiv:0905.3791v4 [quant-ph] 23 Oct 2009\n\nTheory Department, Yerevan Physics Institute, Yerevan, 375036, Armenia\nTzu-Chieh Wei\nInstitute for Quantum Computing and Department of Physics and Astronomy,\nUniversity of Waterloo, Waterloo, Ontario, Canada and\nDepartment of Physics and Astronomy,\nUniversity of British Columbia, Vancouver, British Columbia, Canada\nDaeKil Park\nDepartment of Physics, Kyungnam University, Masan, 631-701, Korea\n\nAbstract\nBipartite maximally entangled states have the property that the largest Schmidt coefficient\nreaches its lower bound. However, for multipartite states the standard Schmidt decomposition\ngenerally does not exist. We use a generalized Schmidt decomposition and the geometric measure\nof entanglement to characterize three-qubit pure states and derive a single-parameter family of\nmaximally entangled three-qubit states. The paradigmatic Greenberger-Horne-Zeilinger (GHZ)\nand W states emerge as extreme members in this family of maximally entangled states. This family\nof states possess different trends of entanglement behavior: in going from GHZ to W states the\ngeometric measure, the relative entropy of entanglement, and the bipartite entanglement all increase\nmonotonically whereas the three-tangle and bi-partition negativity both decrease monotonically.\nPACS numbers: 03.67.Mn, 03.65.Ud\n\n1\n\n\fI.\n\nINTRODUCTION\n\nMaximally entangled states are in essence the natural units of entanglement with which\none would like to compare all quantum states. A well-motivated approach to compare different entangled states and quantify their entanglement is to consider how they can transform\nto each other under local operations and classical communications (LOCC) in the asymptotic regime. The main question is then to quantify the optimal rate of conversion between\ntwo given states [1]. For bipartite systems this gives rise to the two basic operational entanglement measures: the entanglement cost (EC) [1, 2] and the distillable entanglement\n(ED) [1, 3], with Bell states [4, 5] emerging as the standard metric of entanglement. While\nthe latter measure is the rate at which copies of the maximally entangled state can be concentrated from those of a given state, the former is the rate at which copies of the maximally\nentangled state need to be consumed for the preparation of the given state [2, 3, 6, 7].\nIn contrast, there is no simple and unique characterization of a maximally entangled\nstate in multi-partite settings. It has been a long standing question whether there exists a\nfinite minimal reversible entanglement generating set (MREGS) [8], as the states in MREGS\nwould provide several distinct metrics of entanglement and hence the generalization of ED\nand EC would become possible. In addition to the issue of interconversion in the asymptotic\nlimit, another challenge lies in the fact that multi-partite states can be entangled in several\ninequivalent ways [9, 10] and that the number of these likely grows exponentially with the\nnumber of parties [10].\nPerhaps, to get to certain handle of these problems it is useful, as an initial stage, to\nelucidate an important question of which pure states can be regarded as the maximally\nentangled states [11]. A clear definition of these states and the search of an effective method\nfor deriving them could offer a step towards understanding multipartite entanglement, including the structure of the Hilbert space and multipartite entanglement measures. Any\nmultipartite entanglement measure is perhaps a likely starting point for such a definition of\nmaximally entangled states, as for each measure there must exist a set of states which are\nmaximally entangled. However, these states may not be maximally entangled using a different measure. Therefore, one then has to choose an entanglement measure that gives rise\nto a set of maximally entangled states that include the known ones in the set. Furthermore,\nthe selected measure should be suitable for any number of parties with any dimensions, in\n2\n\n\forder for the notion of maximal entanglement be properly quantified.\n\n√\nIn the setting of three qubits, the GHZ state |GHZi ≡ (|000i + |111i)/ 2 [12] and\n√\nthe W state |W i ≡ (|001i + |010i + |100i)/ 3 [9] have been realized as two inequivalent\nentangled states that cannot be transformed to each other via LOCC nor even stochastically. GHZ state seems to be the most natural generalization of Bell states and possesses\na maximum tri-partite entanglement characterized by the three-tangle [13]. On the other\nhand, W state possesses zero three-tangle and yet maximizes the residual bi-partite entanglement [9]. In some sense, both states are maximally entangled. However, the exact\nvalue of entanglement depends on the choice of entanglement measures, and it is likely\nthat different measures may give different ordering of the entanglement quantity. For example, using the relative entropy of entanglement (ER) [14], one has ER (GHZ) = 1 and\nER (W) = log2 (9/4) > 1 [15]. However, using the negativity N across any bi-partition, one\n√\nobtains N(GHZ) = 1 > N(W) = 2 2/3 [16]. Hence, the notion of being maximally entangled can depend on the choice of entanglement measures. In the setting of two qubits, in\ncontrast, the Bell states emerge as the ones that possess maximal entanglement, independent\nof the choice of measures. Nonetheless, the dependence does appear when one consider twoqubit mixed states, and the form of maximally entangled two-qubit mixed states [17, 18, 19]\n(e.g., parametrized by entropy) can actually vary [19].\nHere we characterize maximal entanglement of three-qubit pure states via the geometric\nmeasure of entanglement [20]. Under this measure, the W state turns out to possess the\nmaximal entanglement. To see whether the GHZ can fit into our picture, we investigate\nthe maximal entanglement with a single parameter γ, which we call the \"gauge\" phase\n(which appears in the generalized Schmidt decomposition [21, 22, 23] and to be defined\nbelow), in analogue to the two-qubit maximally entangled mixed states parametrized by\nthe entropy. We derive the whole family of maximally entangled states (characterized by\nthe gauge phase) and show that both GHZ and W emerge as maximally entangled states\nat two different gauge phases, at the opposite ends of this family. Interestingly, in going\nfrom GHZ to W as the gauge phase increases, the geometric measure and the relative\nentropy of entanglement and the bipartite entanglement all increase monotonically whereas\nthe three-tangle and bipartite negativity both decrease monotonically (see Fig. 6). The two\ndifferent trends of these entanglement monotones for this family of states imply that no\nstates in the family can be interconverted deterministically to each other via LOCC using\n3\n\n\fa single copy [24]. Furthermore, our analysis of using three-tangle shows that any states\ncan be probabilistically converted to one another via stochastic LOCC in the family except\nto/from the W state. This is because the whole family of the maximally entangled threequbit states, except the W state, belong to the GHZ-class, a classification introduced by\nDür, Vidal and Cirac [6].\nThe paper is organized as follows. In Sec. II we use a generalized Schmidt decomposition\nto parameterize three-qubit states. In Sec. III we consider the case of vanishing gauge phase\nand obtain the GHZ-state. In Sec. IV we consider the case of maximal gauge phase and\nobtain the W-state. In Sec. V we consider the general case and derive an one-parameter\nfamily of maximally entangled states. Furthermore, we discuss several entanglement properties and interconversion of states in the family of the maximally entangled states. In Sec.\nVI we make concluding remarks.\n\nII.\n\nGENERALIZED SCHMIDT DECOMPOSITIONS\n\nIn general one needs fourteen real parameters to describe a three-qubit pure state.\nCarteret et al. [21] and Acı́n et al. [22] have independently proposed generalizations of\nthe Schmidt decomposition in multipartite settings (three qubits, in particular) to reduce\nthe number of necessary parameters. The generalized Schmidt decomposition (GSD) that\nwe shall use is a variant [23] that is closely related to the geometric measure, and hence\nit is more appropriate to our discussions here. Let us briefly discuss this decomposition.\nFor any multi-qubit pure state, one can always search a closest product state to it, and the\nlocal states of the closest product state and their orthonormal states uniquely (up to phases)\ndetermine the local bases one uses to express the multi-qubit state. One can also relabel\nthe closest product as |000i and the local state orthonormal to |0i by |1i, and arrive at the\nfollowing expression [23]:\n|ψi = g|000i + t1 |011i + t2 |101i + t3 |110i + eiγ h|111i,\n\n(1)\n\nwhere the labels within each ket refer to qubits A, B and C (or 1, 2 and 3) in that order\nand will be suppressed whenever no confusion occurs. Furthermore, the parameters in the\ndecomposition satisfy\ng ≥ ti , h ≥ 0, −π/2 ≤ γ ≤ π/2, and g 2 + h2 + t21 + t22 + t23 = 1.\n4\n\n(2)\n\n\fThe reason that we do not have |001i, |010i, and |100i is that the component |000i is the\nclosest product state and if there were any of the three other components, one could have\nabsorbed them and increased the maximal overlap g. We shall refer to γ the \"gauge phase\",\nas such a factor will necessarily appear in any such decomposition but it may be associated\nwith |111i or with |100i, as in Ref. [22]. In what follows we shall analyze only positive values\nof the gauge phase since the maximal overlap g is an even function on γ.\nWhy do we choose to parametrize the family of maximally entangled states by γ (or\nequivalently the phase in Ref. [22])? Consider the unitary three-qubit gate: control-controlphase (CCP) gate that multiplies the computational state |111i by a phase factor eiφ but\nleaves unchanged the remaining seven basis states |000i, |001i, . . . |110i. This gate can be\nused to generate entanglement (one says that it is an entangling gate). If we start with the\n(un-normalized) product state (|0i + |1i)(|0i + |1i)(|0i + |1i) and apply to it the CCP gate,\n\none obtain |000i+|001i+|010i+|100i+|110i+|101i+|011i+eiφ|111i. It can be shown that\nthis state is entangled and has a three-tangle τ = | sin φ|/8 and, moreover, the reduced twoqubit state can also be entangled, depending on φ. The states in the generalized Schmidt\nform (1) with fixed g, t1, t2 , t3 , h but different γ's can be connected by the entangling CCP\ngate with an appropriate value of phase φ. In contrast, any local unitary transformation that\nchanges any of the five magnitude parameters will generally change the values of the others\nand most likely take the state out of the generalized Schmidt form. Since any three-qubit\npure state can be made into this form by local unitary transformations, it seems natural to\ntake the gauge phase γ as the parameter to search for the family of maximally entangled\nstates.\nThe decomposition into the form (1) captures all the three-qubit pure states, up to local\nunitary transformations. It is thus a convenient starting point for searching maximally\nentangled three-qubit states. When |000i is the closest product state and the parameters\nsatisfy condition (2), we shall refer to the decomposition as being in the canonical form. In\nthis canonical form, the nearest product state |000i is a stationary point for ψ and should\nsatisfy the stationarity equations [20, 21], which represent a nonlinear eigenvalue problem:\nhi1 i2 |ψi = μi |i3 i, hi1 i3 |ψi = μi |i2 i, hi2 i3 |ψi = μi |i1 i,\n\n(3)\n\nwhere we can always restrict ourselves to μi ≥ 0 by adjusting phases of local states |ii.\nThe above stationary conditions arise from the requirement that the overlap with product\n5\n\n\fstates be extremal under the constraint that product states be normalized; for derivation,\nsee Refs. [20, 30]. The resulting equations generalize the linear eigenvalue problem to a\nnonlinear form, which has many features different from the linear scenario [30]. (When\nthe number of parties is two, the generally nonlinear eigenvalue equation becomes linear.)\nThe largest Schmidt coefficient is the maximal nonlinear eigenvalue, i.e. g = max(μi ), and\ni\n\nthus the nearest product state is the dominant eigenvector of stationarity equations. As\nmentioned earlier, it uniquely defines the factorizable basis of GSD consisting of |000i and\nits complimentary orthogonal product states [23].\nOur goal is to find a family of maximally entangled states, parameterized by the gauge\nphase γ. First, we observe that the coefficient g in the canonical decomposition measures the\noverlap (or the angle) from ψ to the closest unentangled state [20, 25] and cannot decrease\nunder LOCC [26, 27]. Hence it should be minimal for the maximally entangled states for all\nother possible parameters (t and h) given fixed gauge phase γ. The crucial point then lies\nin finding the lower bound on g [28]. In the case of generic three-qubit states stationarity\nequations have six solutions. Let μ1 be the largest eigenvalue and hence g = μ1 . Then\nclearly we have\ng ≥ μ = max(μ2 , μ3 , ..., μ6 ).\n\n(4)\n\nThis is a strong lower bound on g. If one can compute all the eigenvalues μi , then one\ncan find the lowest value of g directly. We shall first do this for special cases γ = 0 and\nγ = π/2, and the celebrated GHZ and W states emerge as the maximally entangled states,\nrespectively.\nIn general, the derivation of eigenvalues μi gives rise to unsolvable equations [29, 30].\nFortunately, there is a realizable method that gives the desired lower bound. The essence of\nthe method is the following. If the three-qubit state is maximally entangled, then the above\ninequality would be saturated. Consequently g must coincide with μ and thus the largest\neigenvalue of stationarity equations should be degenerated. This requirement imposes a\ncondition (i.e., degeneracy condition) on state parameters, which can then be deduced from\n√\nstationarity equations. An example is the GHZ state (|000i + |111i)/ 2, where |000i and\n√\n|111i are two such \"degenerate\" states with μ = 1/ 2. Following the above procedure we\nderive the degeneracy condition for three-qubit states and single out states satisfying this\ncondition. Next we find among these states the one with the minimal g (over the remaining\nfree parameters) for a given value of the gauge phase.\n6\n\n\fWe have seen that the GHZ and W states emerge as maximally entangled states in\ndifferent contexts, such as via three-tangle and residual bipartite entanglement, respectively,\nand they are invariant under permuting parties. It is thus natural to assume that maximally\nentangled states can be made symmetric. This ansatz will be verified against numerical\nexperiments (see Fig. 5). Thus, we shall work with the assumption that t1 = t2 = t3 ≡ t\nand consider from now on states of the form\n|ψi = g|000i + t|011i + t|101i + t|110i + eiγ h|111i.\n\n(5)\n\nEigenvalues μi of the state Eq.(5) satisfy a polynomial equation of degree 12 and are\nroots of the characteristic polynomial [30]. Local states |ii satisfy the analogous polynomial\nequation and the general case remains to some extent intractable. However, at extreme\nvalues of the gauge phase γ = 0 and γ = π/2 this polynomial equation can be factorized\nto cubic equations. Another major step towards analytic solutions is the following. Each\nof these cubic equations can be further factorized to a linear and quadratic equations. This\nobservation allows us to find all roots of the characteristic polynomial. Some of them have\nno associated eigenvectors and hence are irrelevant. Some others never maximize the overlap\nsince their value is smaller than max(h, t) in whole state parameter space [31]. Remaining\nsolutions are listed in the Appendix.\n\nIII.\n\nGHZ STATE\n\nConsider first the case γ = 0. All of these states are symmetric and have real coefficients\n|ψ0 i = g|000i + t(|011i + |101i + |110i) + h|111i.\n\n(6)\n\nOwing to these properties the eigenvector with eigenvalue μ is symmetric, i.e. has a form\n|qqqi, and its constituents |qi have real coefficients. In this reason we will derive here only\nsymmetric solutions as the asymmetric ones give strictly μ < g.\nWe parameterize the pure one-qubit state |qi by a single angle |qi = cos θ|0i + sin θ|1i\nand insert it into Eq. (3). The result is a pair of equations for unknowns θ and μ\ng cos2 θ + t sin2 θ = μ cos θ,\n\nh sin2 θ + t sin 2θ = μ sin θ.\n\n(7)\n\nThese equations have an obvious solution μ1 = g, cos θ = 1 reflecting the fact that the state\nis already written in Schmidt normal form. The second solution is given by solving tan θ\n7\n\n\ffrom dividing the first equation by the latter on both sides. We then arrive at\ntan θ =\nwhere r0 = h +\nfollows:\n\np\n\nhr0 + 4t2\nμ2 = p 2\n,\nr0 + 4t2\n\nr0\n,\n2t\n\n(8)\n\nh2 + 8t2 − 4gt. This solution gives rise to a basis {|qi, |pi} defined as\n2t|0i + r0 |1i\n,\n|qi = p 2\nr0 + 4t2\n\nr0 |0i − 2t|1i\n|pi = p 2\n.\nr0 + 4t2\n\n(9)\n\nTo obtain the maximal entanglement we require that μ1 = μ2 . Because |qqqi is another,\nequally good dominant eigenvector, one can construct a new Schmidt decomposition of |ψ0 i\nwhose factorizable basis consists of {|qi, |pi} instead of {|0i, |1i} . This new decomposition\nmust not differ from the original one, since coefficients of the canonical form are uniquely\ndefined by state parameters. This in turn means that the basis defined by {|qi, |pi} results\nin a Schmidt form equivalent to Eq. (6):\n|ψ0 i = g|qqqi + t (|qppi + |pqpi + |ppqi) + h|pppi.\n\n(10)\n\nBy expanding the l.h.s. of this equality in the computation basis {0, 1} and identifying the\ncorresponding coefficients with those in Eq. (6), we arrive at the following three conditions\non state parameters\n2t(g − t)\n4t2 (r0 − h)\nhr0 + 4t2\np\np\np\n=\ng,\n=\nt,\n= t(2h − r0 ).\nr02 + 4t2\nr02 + 4t2\nr02 + 4t2\n\n(11)\n\nBy taking the ratios of the first two equations and the latter two equations, and then\neliminating r0 , we obtain the following single condition on state parameters,\ngh2 = (g + t)2 (g − 2t).\n\n(12)\n\nWe remark that Eq. (12) uniquely solves Eq. (11) and is in fact the degeneracy condition\nthat forces the correct Schmidt decomposition.\nLet us rewrite the degeneracy condition in the following form g(g 2 −h2 −3t2 ) = 2t3 . Since\n\nt ≥ 0 it follows that g 2 ≥ h2 + 3t2 . Then from the normalization condition g 2 + h2 + 3t2 = 1,\n\nit further gives that g 2 ≥ 1/2 and the lower bound g 2 = 1/2 is reached at t = 0, g = h. The\nresulting maximal entangled state is the celebrated GHZ state\n|GHZi =\n\n|000i + |111i\n√\n.\n2\n8\n\n(13)\n\n\fIV.\n\nW STATE\n\nConsider now the case γ = π/2. This case includes all W-class states. Indeed, the\nthree-tangle of a generic state Eq. (1) is given by\nτ = 4g\n\nq\ng 2h4 + 16t21 t22 t23 + 8gh2t1 t2 t3 cos 2γ.\n\n(14)\n\nIt vanishes if either\ngh2 = 0 and t1 t2 t3 = 0\n\n(15)\n\ngh2 = 4t1 t2 t3 6= 0 and γ = ±π/2.\n\n(16)\n\nor\n\nThe states satisfying Eq. (15) are bi-separable, namely, separable with respect to A:BC,\nB:AC, or C:AB bipartition [6, 23], and the maximally entangled states are Bell states between\nBC, AC or AB.\nIn Eq. (16) the case of γ = −π/2 is equivalent to that of γ = π/2 because the period\nof the angle γ is π and the point −π/2 should be identified with π/2. All states satisfying\nEq. (16) are W-class states [6] and conversely any W-class state has a Schmidt decomposition\nwith coefficients Eq. (16). Thus generic pure three-qubit states have 5 independent real\nparameters, whiles W-class states have 3 of them.\nStationarity equations give four relevant solutions and one of them is symmetric (under\nqubit permutations) while the remaining three others are not. The easiest way for finding the\nsymmetric solution |qqqi is to set |qi = eiπ/3 (cos θ|0i + i sin θ|1i) and solve the stationarity\nequation (3), just like what we did for the GHZ case. The solution is\ntan θ =\nwhere rπ = h +\n\nrπ\n,\n2t\n\nhrπ + 4t2\n,\nμ= p\nrπ2 + 4t2\n\n(17)\n\np\nh2 + 8t2 + 4gt. Since rπ and r0 differ only by the sign of t, the degeneracy\n\ncondition forcing g = μ can be obtained by taking t to −t in Eq. (12):\ngh2 = (g − t)2 (g + 2t).\n\n(18)\n\nIn the case of GHZ, the degeneracy condition is sufficient for finding the maximally\nentangled state, but in the present case we need one more condition by examining three\nother relevant solutions of stationarity equations. The first solution is symmetric under the\n9\n\n\fpermutation of qubits A and B, but asymmetric under other permutations and has a form\n|qqq ′i. Other two solutions, with symmetric qubit pairs (A,C) and (B,C) respectively, give\nthe same eigenvalue. Thus, it suffices to consider the first solution of these in addition to that\nin Eq. (17). Its constituent state |qi, up to an irrelevant phase factor, can be parameterized\n\nby two angles, that is |qi = cos θ|0i + eiφ sin θ|1i. (Similar parametrization can be used for\n|q ′ i.) Straightforward but tedious algebra from solving the stationarity conditions (3) gives\nrise to the equations obeyed by angles θ and φ\ncos 2θ =\n\nh2 + gt − g 2\n,\nh2 + g 2 − 3gt\n\nsin φ =\n\nh\ntan θ,\n2g\n\n(19)\n\nas well as the corresponding eigenvalue μ′ being\ng 2 h2 − 4gt3\n.\nμ = 2\ng + h2 − 3gt\n′2\n\n(20)\n\nWe shall present in the Appendix a simpler derivation using another approach outlined in\nthe next section.\nThus far we have obtained two different eigenvalues, namely μ and μ′ , and consequently\ng has two different lower bounds. As argued previously, for the maximally entangled state\nboth lower bounds should be saturated and this in turn uniquely defines state parameters.\nIndeed, by using μ′ = g it follows that (g + t)(g − 2t)2 = 0 and hence g = 2t (as g, t ≥ 0).\nThen the degeneracy condition (18) forces h2 = 2t2 . These two conditions together with the\n√\nnormalization condition give g = 2/3, t = 1/3, and h = 2/3 and thus yield the following\n\nmaximally entangled state for γ = π/2\n√\n2\n1\n2\n|111i.\n|ψπ/2 i = |000i + (|011i + |101i + |110i) + i\n3\n3\n3\n\n(21)\n\nThis form turns out to be the generalized Schmidt normal form for the W-state. Indeed,\none can easily verify that U ⊗ U ⊗ U|ψπ/2 i = |W i, where\n|W i =\n\n|100i + |010i + |001i\n√\n,\n3\n\n\n√\n2\n−i\n1\nU=√ \n√ .\n3\n1 i 2\n\n(22)\n\nThus, W state is the maximally entangled state for γ = π/2. It should be remarked that\nat g = 2t and h2 = 2t2 the fraction defining the angle θ in Eq. (19) is indefinite since both\nexpressions in denominator and numerator vanish. The reason is that the state |ψπ/2 i(as well\nas the W-state) is an exceptional state [32] and has countless nearest product states defined\n10\n\n\f√\nsolely by the condition tan θ = 2 2 sin φ [33]. All of these product states are equally distant\nfrom |ψπ/2 i (i.e., infinitely degenerate) and form a circle around it. This infinite degeneracy\nis best captured when viewed in the computational basis. To be more precise, the closest\nproduct states to W-state were previously shown [15] to be of the form\n!⊗3\nr\nr\n2\n1\n|0i + e−iχ\n|1i\n,\neiχ/2\n3\n3\n\n(23)\n\nwhere the arbitrariness of the phase χ clearly shows the infinite degeneracy.\nThe eigenvalue μ′ also exhibits interesting features. If g = 2t, then μ′ = g and thus the\nsolution Eq. (19) maximizes the overlap. On the other hand, if gh2 = 4t3 but g 6= 2t, then\nthe solution minimizes the overlap, i.e., resulting in μ′ = 0. In order to obtain further insight\ninto this, we relates μ′ to the three-tangle τ . For the states in question τ = 4g(gh2 − 4t3 )\nand μ′ can be written as\n2\n\nμ′ =\n\ng2τ\n.\nτ + 4g(g + t)(g − 2t)2\n\n(24)\n\nThis shows clearly when the asymmetric eigenvalue μ′ takes the maximal value and the\nminimal value.\n\nV.\n\nGENERAL CASE\n\nHaving warmed up by the previous two examples, we consider now the general case. The\nGHZ and W are two special cases of the following treatment.\n\nA.\n\nDerivation of the degeneracy condition\n\nFor symmetric states any solution of stationarity equations is symmetric under the permutation of either the qubit pair AB, or AC or BC [34]. Without loss of generality we\nconsider a solution that contains a symmetric pair A and B, i.e. the product state has a\nform |qqq ′ i which, of course, does not exclude the possibility |q ′ i = |qi. Furthermore, theorem 1 of Ref. [35] states that the maximal overlap is uniquely determined even if one party\nof the global pure state is traced out. This enables us to express the maximal overlap in\nterms of the reduced density matrix ρAB as follows\n\u0001\nAB 1\n2\nTr\nρ\n̺\n⊗\n̺\n,\ng 2 = max\n1 2\n̺ ,̺\n\n11\n\n(25)\n\n\fwhere ̺1 and ̺2 are single-system pure state densities. The density matrix ρAB can be\nexpanded in terms of identity operator and the Pauli matrices σ's,\nρAB =\n\n\u0011\n1\u0010\n11 ⊗ 11 + r * σ ⊗ 11 + r * 11 ⊗ σ + σ * G * σ ,\n4\n\n(26)\n\nwhere r is the Bloch vector of the qubit A(B) and the correlation matrix G is defined by\nthe formula Gij = Tr(ρAB σi ⊗ σj ). Explicitly\nr = (2ht cos γ, 2ht sin γ, g 2 − h2 − t2 )\nand\n\n\n\n2t2 + 2gt\n\n0\n\n−2ht cos γ\n\n(27)\n\n\n\n\n\n\n\n2\nG=\n0\n2t − 2gt −2ht sin γ  .\n\n\n2\n2\n2\n−2ht cos γ −2ht sin γ g + h − t\n\n(28)\n\nAs ρAB is symmetric under permuting parties, one can set ̺1 = ̺2 = ̺ [36]. Denote by u\nthe Bloch vector of the density matrix ̺ that gives rise to the maximum of g 2 , then Eq. (25)\ncan be rewritten as\n1\ng 2 = (1 + 2u * r + u * Gu).\n4\n\n(29)\n\nBy introducing a Lagrange multiplier λ that constraints u * u = 1, the vector u satisfies the\nfollowing equation\nr + Gu = λu.\n\n(30)\n\nSince λ uniquely defines u and g, two solutions have the same eigenvalue if and only if they\nhave the same Lagrange multiplier. By direct substitution, it is easy to see that for the\nsolution uz = 1 we have λ0 = 2(g 2 − t2 ) and therefore the largest eigenvalue of Eq. (30)\nis degenerate if there are two solutions at λ = λ0 . Inserting this value into Eq. (30), one\nsees that the necessary and sufficient condition for the existence of the second solution\ncorresponding to λ = λ0 is det(G − λ0 11) = 0, which can be rewritten as\n(g 2 − t2 )2 (g 2 − 4t2 ) = gh2 (g 3 − 3gt2 + 2t3 cos 2γ).\n\n(31)\n\nThis is the degeneracy condition for arbitrary symmetric states and the solutions contain\nall three-qubit states that can be regarded as maximally entangled. When γ = 0, Eq. (31)\nreduces to Eq. (12) and when γ = π/2, it reduces either to Eq. (18) or g = 2t. The latter is\nequivalent to Eq. (20).\n12\n\n\fB.\n\nMaximally entangled three-qubit states.\n\nThe degeneracy condition Eq. (31) can be considered as an algebraic equation of degree six\nfor g, where t and γ are free parameters and h2 can be further eliminated by the normalization\ncondition h2 = 1 −g 2 −3t2 . It has six roots g(t, γ) and as far as we are looking for the largest\neigenvalue, we should always take the largest root. In what follows we will use the notations\ng1 for the largest root and g2 for the second largest root. Equation (31) gives different types\nof lower bounds depending on whether or not cos 2γ is positive and below we consider these\ntwo cases.\nConsider first states for which 0 ≤ γ ≤ π/4. The degeneracy condition can be rewritten\nas follows\ng 2 (g 2 − 3t2 )(g 2 − 3t2 − h2 ) = 4t6 + 2gh2 t3 cos 2γ.\n\n(32)\n\nThe right-hand side of this equation is positive and either g 2 ≤ 3t2 or g 2 ≥ 3t2 + h2 holds.\n\nTo find the maximal overlap we should take the latter case g 2 ≥ 3t2 + h2 and then from\n\nthe normalization condition it follows that g is minimal when t = 0 and g = h. Thus the\n√\nonly maximally entangled state in this class is the GHZ state: (|000i + eiγ |111i)/ 2. It\ncan be understood by reference to Fig. 1, where γ is taken to be π/6 for illustration. The\nsolid line represents the largest root g1 (t) and the dashed line represents the next root g2 (t)\nas functions on t. It should be stressed that the largest root g1 (t) never intersects with\nother roots and therefore it is the largest Schmidt coefficient for all values of t. Moreover,\ng1 (t) is a monotonically increasing function and our goal is to find its infimum (and hence\nthe supremum of the geometric measure), which is reached at t = 0, giving rise to the\nGHZ-state [37].\nConsider now the interval π/4 < γ < π/2. Now the situation is different since g1 and g2\nare not monotonic functions. In Fig. 2 g1 (t) (solid line) and g2 (t) (dashed line) are plotted at\nγ = 2π/5. The largest root g1 (t) has a minimum whiles the next root g2 (t) has a maximum\nat t = 0.31943. These two roots never intersect unless γ = π/2. Therefore the minimum of\nthe function g1 (t) is the lower bound of the largest Schmidt coefficient. When γ increases,\nthe minimum of g1 moves towards larger γ and decreases. Concurrently, the maximum of\ng2 moves towards larger γ and increases. Thus, in the range π/4 < γ < π/2, one needs\nto search for the minimum value of g1 (t) over the allowable range of t, in order to find the\nmaximal entangled states.\n13\n\n\f1\n2\n\n0\n1\n3\n\n0\n\nFIG. 1: (Color online) Plots of t-dependencies of the largest g1 (t) (solid line) and next g2 (t) (dashed\nline) roots of the degeneracy condition for γ = π/6. g1 (t) is the largest Schmidt coefficient and has\na minimum at t = 0 which gives the GHZ-state.\n\n1\n2\n\n1\n2 0\n\n1\n3\n\nFIG. 2: (Color online) Plots of t-dependencies of the largest g1 (t) (solid line) and next g2 (t)\n(dashed line) roots of the degeneracy condition for γ = 2π/5. g1 (t) has a minimum whiles g2 (t)\nhas a maximum at t = 0.31943. These roots never intersect unless γ = ±π/2.\n\ng\n\n2\n\u0080\u0080\u0080\u0080\n3\n1\n\u0080\u0080\u0080\u0080\n2\n\n1\n\u0080\u0080\u0080\u0080\n4 0\n\n1\n\u0080\u0080\u0080\u0080\n4\n\n1\n\u0080\u0080\u0080\u0080\n3\n\nt\n\nFIG. 3: (Color online) Plots of t-dependencies of the largest g1 (t) (solid line) and next g2 (t) (dashed\nline) roots of the degeneracy condition for γ = π/2. The two curves touch at (1/3, 2/3).\n\n14\n\n\fg\n\nGHZ\n\n1\n2\n\nW\n\n2\n3\n\nh\n\n2\n\n3\n\np\n4\n\n0\n\np\n2\n\ng\n\nFIG. 4: (Color online) The gauge phase γ-dependence of the largest Schmidt coefficient g as well\n√\nas h of maximally entangled states. g is constant and equal to 1/ 2 within 0 ≤ γ ≤ π/4, then\nit decreases monotonically and becomes 2/3 at γ = π/2. Similarly, h is constant and equal to\n√\n√\n1/ 2 within 0 ≤ γ ≤ π/4, then it decreases monotonically and becomes 2/3 at γ = π/2. The\nparameter t is obtained from the normalization g2 + 3t2 + h2 = 1.\ng\n\n3\n\u0080\u0080\u0080\u0080\n4\n\n1\n\u0080\u0080\u0080\u0080\u0080\u0080\u0080\u0080\u0080\n\u008f!!!!\n2\n2\n\u0080\u0080\u0080\u0080\n3\n\nΠ\n\u0080\u0080\u0080\u0080\n4\n\nΠ\n\u0080\u0080\u0080\u0080\n2\n\nΓ\n\nFIG. 5: (Color online) The maximal overlap g vs. the gauge phase γ for the family of maximally\nentangled three-qubit states (red solid curve) as well as randomly generated states (dots). This\nshows that the family of states we have derived are indeed maximally entangled (with minimal\noverlap g).\n\nWhen γ = π/2 minimum of g1 and maximum of g2 coincide at t = 1/3 and this minimum\nvalue of g1 yields the W-state. This is illustrated in Fig. 3.\nWe remark that the inequality mint g1 (t) > maxt g2 (t) holds for fixed γ 6= π/2. This\nfeature is verified numerically for all values 0 ≤ γ < π/2. This means that, given a fixed γ,\n15\n\n\fthe minimum of the function g1 (t) is the lower bound on g and also provides justification\nfor the parametrization of maximally entangled states by the gauge phase. The minimum of\ng1 gives the value of the maximal overlap g for the maximally entangled state at a given γ.\nTogether with the value of t where the minimum of g1 is achieved, the complete description\nof the maximally entangled state is obtained (as h is determined via the normalization\ncondition).\nIn Figure 4 we shows the dependence of the g and h on the gauge phase γ. The dependence\nof t on γ can be inferred from the normalization g 2 +3t2 +h2 = 1. This then defines the family\nof the maximally entangled three-qubit states. The parameters g and h are both constant\n√\nand equal to 1/ 2 within the interval 0 ≤ γ ≤ π/4, then decrease with γ, with g reaching\n√\n2/3 and h reaching 2/3 at γ = π/2. We remark that we have assumed the maximally\nentangled states have the permutation invariant form (5), and this is supported by our\nnumerical test that states generated randomly do not achieve g below (or entanglement\nabove) those of the maximally entangled states; see Fig. 5.\n\nC.\n\nSurvey of maximally entangled states\n\nOnce the maximally entangled three-qubit states (and hence their maximal overlap) have\nbeen obtained as a function of the gauge phase γ, it is of interest to compare the results\nwith other measures. Two other quantities of relevance are the aforementioned three-tangle\nτ [13] and the residual bipartite entanglement Er [9]. We show the γ-dependence of τ\nand Er for the maximally entangled three-qubit states in Fig. 6. We also compare the\nγ-dependence of yet two other measures, the bi-partition negativity (N) and the relative\nentropy of entanglement (ER ) in Fig. 7. The three-tangle τ and the negativity N decrease\nmonotonically for γ ∈ [π/4, π/2], whereas the residual bipartite entanglement Er and the\nrelative entropy of entanglement ER increase and achieve Er = 4/3 and ER = log2 (9/4) at\nγ = π/2 for the W-state. The geometric measure for the maximally entangled states is equal\nto 1−g 2 , and hence, as can be inferred from Fig. 4, it increases monotonically. To summarize\nthe behaviors of three different measures, we have that, in going from GHZ to W as γ\nincreases, the geometric measure and the relative entropy of entanglement and the bipartite\nentanglement all increase monotonically whereas the three-tangle and the negativity both\ndecrease monotonically.\n16\n\n\fΤ, Er\n4\n\u0080\u0080\u0080\u0080\n3\n1\n\n1\n\u0080\u0080\u0080\u0080\n2\n\n0\n0\n\nΠ\n\u0080\u0080\u0080\u0080\n4\n\nΠ\n\u0080\u0080\u0080\u0080\n2\n\nΓ\n\nFIG. 6: (Color online) The phase dependence of three-tangle τ (red solid curve) and the residual\nbipartite entanglement Er (blue dashed curve) vs. γ for the family of maximally entangled threequbit states.\n\nInstead of the geometric measure, one may well use other entanglement measures to derive\nthe maximally entangled states. Conversely, having at one's disposal the set of maximally\nentangled states one can analyze and compare different entanglement measures. In this\nview the behaviors of the different measures can be understood as follows. The three-tangle\nquantifies genuine tripartite, i.e. GHZ-type, entanglement, but does not detect W-type\nentanglement at all [38]. Then all states within the interval −π/4 ≤ γ ≤ π/4 possess only\nGHZ-type entanglement and in going away from these states, the three-tangle detects the\nresidual of GHZ-type entanglement. In this regards it decreases with γ from τ = 1 at\nGHZ-state and vanishes at W-state. On the contrary, the residual bipartite entanglement\nquantifies the W-type entanglement and does not detect the GHZ-type entanglement at\nall. Hence its behavior is opposite to that of the three-tangle. The negativity quantifies\nentanglement across bi-partition. As the GHZ state is equivalent to a Bell state if one makes\nthe bi-partition A:BC, it possesses the largest negativity N = 1. The W state possesses less\n√\nnegativity N = 2 2/3. And the family becomes less and less similar to GHZ as one increases\nthe gauge phase, one expects a gradual interpolation of the negativity between these values.\nThe situation of the geometric measure is very different from these measures. It quantifies\nwhole entanglement present in the state and, owing to this, detects an one-parameter set\nof maximally entangled states. The behavior of the relative entropy of entanglement for\nthis family is qualitatively similar to that of the geometric measure, and this is expected\nas the geometric measure can be used to provide lower bounds on the relative entropy of\n\n17\n\n\fN, ER\n1.2\n\n1.1\n\n1\n\n0.94\nΠ\n4\n\nΠ\n2\n\nΓ\n\nFIG. 7: (Color online) The phase dependence of the negativity N (red solid curve) and the relative\nentropy of entanglement ER (blue dashed curve) vs. γ for the family of maximally entangled threequbit states.\n\nentanglement [15], with GHZ and W states saturating the bounds.\nIt is interesting to note that the manifold of GHZ-class maximally entangled states is an\nopen manifold in a sense that there is no state within GHZ-class states that has the global\nmaximal geometric measure of entanglement (which is actually possessed by the W-state).\nIndeed, let us analyze γ = π/2 case once again. The three-tangle τ of these states is given\nby the formula τ = 4g(gh2 − 4t3 ) and the degeneracy condition Eq. (18) can be rewritten as\nfollows\n4g(g + t)2 (g − 2t) = τ.\n\n(33)\n\nAll of these states are GHZ-class state unless the limit τ = 0 (and hence g = 2t, which means\nthat the asymmetric solution comes into action) is reached. Near this limit g depends on τ\np\nby the asymptotic formula g = 2/3 + 3τ /8 + O(τ ) which can be derived from Eq.(33). On\n\nthe other hand, if 0 ≤ γ < π/2 then g > 2/3. Thus the largest Schmidt coefficient of the\nGHZ-class states comes arbitrarily close to 2/3 but never reaches it as the lower bound is\nonly achieved by the W state. What about the interconversion between states in the family\nof the maximally entangled states? We have seen that in going from GHZ to W the geometric measure of entanglement and the bipartite entanglement both increase monotonically\nwhereas the three-tangle decreases monotonically (see Fig. 6). The two different trends of\nthese entanglement monotones for this family of states imply that deterministic interconversion via LOCC among these maximally entangled three-qubit states is not possible. The\nresults of the three-tangle τ and the Dür-Vidal-Cirac classification of entangled states [6]\n18\n\n\fshow that under stochastic LOCC, any pure states can be probabilistically converted to one\nanother within the same class, and that there are five classes of three-qubit pure states: one\nclass of completely separable states, three classes of biseparable states, GHZ-class and Wclass states. But states in one class cannot be converted to any other in a different class even\nwith SLOCC. In our case, the whole family of the maximally entangled three-qubit states,\nexcept the W state (which has τ = 0), belong to the GHZ-class (with τ > 0). Therefore,\nunder SLOCC, any states in the family of maximally entangled three-qubit states can be\nprobabilistically converted to one another in the family except to/from the W state.\n\nVI.\n\nCONCLUDING REMARKS\n\nWe use a generalized Schmidt decomposition and the geometric measure of entanglement\nto characterize three-qubit pure states and derive a single-parameter (characterized by the\ngauge phase) family of maximally entangled three-qubit states. The resulting family of\nmaximally entangled states connect continuously from GHZ to W state. The paradigmatic\nGreenberger-Horne-Zeilinger (GHZ) and W states emerge as extreme members in this family\nof maximally entangled states.\nThis family of maximally entangled states turn out to possess interesting features of\nentanglement. In going from GHZ to W the geometric measure and the relative entropy of\nentanglement and the bipartite entanglement all increase monotonically whereas the threetangle and the negativity both decrease monotonically. This clearly exemplifies the ordering\nissue in the multipartite entanglement. It also implies that deterministic interconversion via\nLOCC among these maximally entangled three-qubit states is not possible. However, the\nresults of the three-tangle τ and the Dür-Vidal-Cirac classification of entangled states show\nthat under stochastic LOCC, any states in the family of maximally entangled three-qubit\nstates can be probabilistically converted to one another in the family (except to/from the\nW state).\nIn general, three-qubit pure states require 14 real independent parameters to completely\ncharacterize. The use of local-unitary equivalence helps to reduce the number of parameters necessary for the characterization of entangled states. Via the generalized Schmidt\ndecomposition, we have navigated through the remaining vast space and identified the oneparameter maximally entangled states via the geometric measure. But one may as well use\n19\n\n\fother entanglement measures. Will other measures give rise to such a non-trivial family of\nstates? For example, using the gauge phase as the parametrization and the three-tangle\nas the characterization of entanglement, one obtains that the maximally entangled states\n√\nbeing (|000i + eiγ |111i)/ 2, which are essentially the same GHZ state. Such featureless\nfamily of states also arise when the characterization of entanglement is replaced by negativity. On the other hand, when using the relative entropy of entanglement, one expects that\nthe resulting family of maximally entangled states will have similar feature to those via the\ngeometric measure, albeit not identical. (It is because that the geometric measure serves\nas a lower bound of the relative entropy of entanglement.) Perhaps the procedure that we\nhave gone through to identify the maximally entangled states can serve as two purposes: (1)\nto explore certain cross section of Hilbert space via suitable parametrization and choice of\nentanglement measures; (2) to investigate and compare the behavior of entanglement measures via the resulting family of maximally entangled states: whether they are interesting or\nfeatureless. In doing so, one may identify certain distinct states or classify various measures\nof entanglement. In the former respect, it remains to be seen whether the derived family\nof entangled states can be of any use in quantum information processing tasks previously\nunexplored. In the latter respect, one thus has that the various entanglement measures\ndiscussed in the present paper can be divided into two different groups: (a) the geometric\nmeasure of entanglement, the relative entropy of entanglement, and the residual bi-partite\nentanglement; (b) the three-tangle and the negativity.\nWhile the nonlinear eigenvalues of the W state are infinitely degenerate, eigenvalues of the\nGHZ-class states are doubly degenerate and thus no invertible local operations can match\nthem. As a remark, it is interesting to see that the whole W-class states have only a single\nrepresentative in the above one-parameter family of maximally entangled states, namely, the\nW state, which can be regarded geometrically as the center of the largest full-sphere with\nno unentangled states.\nThe W-class states form a boundary set for pure three-qubit states and the boundary\nis the limit γ → π/2, gh2 → 4t1 t2 t3 . Accordingly, the W-state is the the endpoint of\nmaximally entangled pure states [11]. The boundary behavior of entanglement is different\nand owing to this the set of GHZ states is noncompact. Hence GHZ-class states should have\nnoncountably infinite collection of maximally entangled states approaching to the W-state.\nSeveral outstanding questions remain: does the minimal reversible entanglement gener20\n\n\fating set exist? If so, what does it consist of? Can the family of states derived in the\npresent paper constitute in part the generating set? As the consideration of such questions\ninvolve reversible conversion of states in the asymptotic limit, few progress has been made.\nUnfortunately, in the present paper such questions are not answered and remain open.\n\nAcknowledgments\n\nST thanks Anthony Sudbery and Levon Tamaryan for stimulating discussions. TCW is\nsupported by IQC, NSERC and ORF. DKP is supported by the National Research Foundation (F01-2008-000-10039-0).\n\nAPPENDIX A: SOLUTIONS OF STATIONARITY EQUATIONS\n\nAs indicated above, we have found all six solutions of stationarity equations for γ = 0\nand γ = π/2. In general these equations have two types of solutions: the nearest separable\nstates for highly and slightly entangled three qubit states, respectively. There are no slightly\nentangled states within the subclass of symmetric states and corresponding solutions are\nirrelevant since μ < g and the equality μ = g is never saturated.\nAt γ = 0 the stationarity equation (30) along the axis y reduces to\n(2gt − 2t2 )uy = λuy\n\n(A1)\n\nEither uy = 0 or λ = 2t2 − 2gt. The second case does not give a true maximum since λ < 0.\nSimilar situation occurs at γ = π/2. The stationarity equation (30) along the axis x\nreduces to\n(2t2 + 2gt)ux = λux\n\n(A2)\n\nThe case ux = 0 gives three symmetric solutions, while the remaining case λ = 2t2 + 2gt\ngives three asymmetric solutions.\nThus at extreme values of the gauge phase stationarity equations are factorized to cubic\nequations. One of the roots of these cubic equations is either sin θk = 0 or tan θk = ±(g±t)/h,\nwhere the angle θk defines the weights of computational basis vectors in the local state as\nfollows |ik i ∼ cos θk |0i + eiφ sin θk |1i. Hence we know one root of each cubic equation and\nwe can find the other two by solving a quadratic equation. In this way we find all roots of\nthe characteristic polynomial.\n21\n\n\fa. Solutions in the case of γ = 0. We list them as follows.\nSolution 1 (symmetric, standard)\n|q1 q2 q3 i = |000i,\n\nμ = g.\n\nSolution 2 (symmetric, relevant)\n|q1 q2 q3 i = |qqqi,\n\n2t|0i + r+ |1i\n,\n|qi = p 2\nr+ + 4t2\n\nhr+ + 4t2\nμ= p 2\n,\nr+ + 4t2\n\n2t|0i + r− |1i\n|qi = p 2\n,\nr− + 4t2\n\nhr− + 4t2\np\nμ=\n,\n2\nr−\n+ 4t2\n\nSolution 3 (symmetric, irrelevant)\n|q1 q2 q3 i = |qqqi,\n\nSolution 4 (asymmetric, irrelevant)\n|q1 q2 q3 i = |qqq ′ i,\n\nh|0i − (g + t)|1i\n|qi = p\n,\nh2 + (g + t)2\n\nμ2 =\n\nr+ = h +\n\np\n\nr− = h −\n\np\n\ng 2 h2 + t2 (g + t)2\n,\nh2 + (g + t)2\n\nh2 + 8t2 − 4gt.\n\nh2 + 8t2 − 4gt.\n\n|q ′i =\n\nhqq|ψ0 i\n.\nμ\n\nSolution 5 (asymmetric, irrelevant, permutation of fourth solution)\n|q1 q2 q3 i = |qq ′ qi.\nSolution 6 (asymmetric, irrelevant, permutation of fourth solution)\n|q1 q2 q3 i = |q ′ qqi.\nb. Solutions in the case of γ = π/2. Solutions for γ = π/2 are:\nSolution 1 (symmetric, standard)\n|q1 q2 q3 i = |000i,\n\nμ = g,\n\nSolution 2 (symmetric, relevant)\n|q1 q2 q3 i = |qqqi,\n\n2t|0i + irπ |1i\n,\n|qi = eiπ/3 p\nrπ2 + 4t2\n\nhrπ + 4t2\nμ= p\n,\nrπ2 + 4t2\n\n2t|0i − isπ |1i\n,\n|qi = eiπ/3 p\ns2π + 4t2\n\nhsπ − 4t2\nμ= p\n,\ns2π + 4t2\n\nSolution 3 (symmetric, irrelevant)\n|q1 q2 q3 i = |qqqi,\n\nSolution 4 (asymmetric, relevant)\n|q1 q2 q3 i = |qqq ′i,\ncos 2θ =\n\n|qi = cos θ|0i + eiφ sin θ|1i,\n\nh2 + gt − g 2\n,\nh2 + g 2 − 3gt\n\nsin φ =\n22\n\nh\ntan θ.\n2g\n\n2\n\nrπ =\n\np\nh2 + 4gt + 8t2 + h.\n\nsπ =\n\np\nh2 + 4gt + 8t2 − h.\n\nμ′ =\n\ng 2 h2 − 4gt3\n,\ng 2 + h2 − 3gt\n\n\fSolution 5 (asymmetric, relevant, permutation of fourth solution)\n|q1 q2 q3 i = |qq ′ qi.\nSolution 6 (asymmetric, relevant, permutation of fourth solution)\n|q1 q2 q3 i = |q ′ qqi.\n\n[1] C. H. Bennett, H. J. Bernstein, S. Popescu, and B. Schumacher, Phys. Rev. A 53, 2046 (1996).\n[2] W. K. Wootters, Phys. Rev. Lett. 80, 2245 (1998).\n[3] C. H. Bennett, D. P. DiVincenzo, J. A. Smolin and W. K. Wootters, Phys. Rev. A 54,\n3824(1996).\n[4] A. Einstein, B. Podolsky, N. Rosen, Phys. Rev. 47, 777 (1935).\n[5] J. S. Bell, Physics (Long Island City, N.Y.) 1, 195 (1964).\n[6] G. Vidal and J. I. Cirac, Phys. Rev. Lett. 86, 5803 (2001).\n[7] M. Horodecki, P. Horodecki, and R. Horodecki, Phys. Rev. Lett 80, 5239 (1998).\n[8] C. H. Bennett, S. Popescu, D. Rohrlich, J. A. Smolin, and A. V. Thapliyal, Phys. Rev. A 63,\n012307 (2000).\n[9] W. Dür, G. Vidal and J. I. Cirac, Phys.Rev. A 62, 062314 (2000).\n[10] F. Verstraete, J. Dehaene, B. De Moor, and H. Verschelde, Phys. Rev. A 65, 052112 (2002).\n[11] D. Cavalcanti, F. G. S. L. Brandäo and M. O. Terra Cunha, Phys. Rev. A 72, 040303 (2005).\n[12] D. M. Greenberger, M. A. Horne, and A. Zeilinger, Bell's Theorem, Quantum Theory, and\nConceptions of the Universe, M. Kafatos, ed., Kluwer, Dordrecht, 1989.\n[13] V. Coffman, J. Kundu and W. K. Wootters, Phys. Rev. A 61, 052306 (2000).\n[14] V. Vedral, M. B. Plenio, M. A. Rippin, and P. L. Knight, Phys. Rev. Lett. 78, 2275 (1997).\n[15] M. B. Plenio and V. Vedral, J. Phys. A 34, 6997 (2001). T.-C. Wei, M. Ericsson, P. M.\nGoldbart, and W. J. Munro, Quantum Inf. Comput. 4, 252 (2004).\n[16] K. Życzkowski, P. Horodecki, A. Sanpera, and M. Lewenstein, Phys. Rev. A 58, 883 (1998).\n[17] W. J. Munro, D. F. V. James, A. G. White, and P. G. Kwiat, Phys. Rev. A 64, 030302 (2001).\n[18] F. Verstraete, K. Audenaert, and B. de Moor, Phys. Rev. A 64, 012316 (2001).\n[19] T.-C. Wei, K. Nemoto, P. M. Goldbart, P. G. Kwiat, W. J. Munro, and F. Verstraete, Phys.\nRev. A 67, 022110 (2003).\n\n23\n\n\f[20] T.-C. Wei and P. M. Goldbart, Phys. Rev. A 68, 042307 (2003).\n[21] H. A. Carteret, A. Higuchi, and A. Sudbery, J. Math. Phys. 41, 7932 (2000).\n[22] A. Acı́n, A. Andrianov, L. Costa, E. Jané, J. I. Latorre, and R. Tarrach, Phys. Rev. Lett. 85,\n1560 (2000).\n[23] L. Tamaryan, D.K. Park and S. Tamaryan, arXiv:0809.1290v2 [quant-ph].\n[24] G. Vidal, J. Mod. Opt. 47, 355 (2000).\n[25] R. Werner and A. Holevo, J. Math. Phys. 43, 4353 (2002).\n[26] V. Vedral, M. B. Plenio, M. A. Rippin, P. L. Knight, Phys. Rev. Lett. 78, 2275 (1997).\n[27] O. Biham, M. A. Nielsen and T. J. Osborne, Phys. Rev. A 65, 062312 (2002).\n[28] O. Gühne, M. Reimpell, and R. F. Werner, Phys. Rev. Lett. 98, 110502 (2007).\n[29] L. Tamaryan, D. K. Park, J.-W Son, and S. Tamaryan, Phys. Rev. A 78, 032304 (2008).\n[30] J. J. Hilling and A. Sudbery, arXiv:0905.2094v2[quant-ph].\n[31] These solutions are minimazing the overlap. Stationarity equations do not differ maximums\nand mimimus and give both extremes. Surprisingly, there is a solution which, depending on\nstate parameters, maximizes the overlap for some states and minimizes for some other states.\nThis solution is presented in section IV.\n[32] P. Parashar and S. Rana, Phys. Rev. A 80, 012319 (2009).\n√\n[33] Notice, the maximal angle θmax is given by tan θmax = 2 2 and this is the angle between sides\nof a regular tetrahedron.\n[34] L. Tamaryan, D. K. Park and S. Tamaryan, Phys. Rev. A 77, 022325 (2008).\n[35] E. Jung, M. R. Hwang, H. Kim, M. S. Kim, D. K. Park, J. W. Son and S. Tamaryan, Phys.\nRev. A 77, 062317 (2008).\n[36] R. Hübener, M. Kleinmann, T.-C. Wei, C. González-Guillén, and O. Gühne, Phys. Rev. A\n80, 032324 (2009).\n[37] Notice, when t = 0 the phase γ can be further made zero by chaning local phases as eiγ can\nbe absorbed in the definition of the product state |111i. It turns out that for 0 ≤ γ ≤ π/4 the\nmaximally entanglement is achieved when t = 0 and GHZ is the only maximally entangled\nstate in this range.\n[38] For mixed state the three tangle does not properly quantify even some GHZ-type states [39].\n[39] E. Jung, D. K. Park and J. W. Son, Phys. Rev. A 80, 010301(R) (2009).\n\n24\n\n\f"}