{"id": "http://arxiv.org/abs/0810.1001v3", "guidislink": true, "updated": "2009-01-19T10:20:53Z", "updated_parsed": [2009, 1, 19, 10, 20, 53, 0, 19, 0], "published": "2008-10-06T16:17:31Z", "published_parsed": [2008, 10, 6, 16, 17, 31, 0, 280, 0], "title": "Light localization induced enhancement of third order nonlinearities in\n  a GaAs photonic crystal waveguide", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0810.1327%2C0810.4432%2C0810.5307%2C0810.5708%2C0810.2718%2C0810.2678%2C0810.4018%2C0810.0368%2C0810.2578%2C0810.4746%2C0810.1887%2C0810.1525%2C0810.5450%2C0810.4594%2C0810.3437%2C0810.3823%2C0810.4961%2C0810.3238%2C0810.0338%2C0810.4256%2C0810.4607%2C0810.1399%2C0810.2114%2C0810.0377%2C0810.0051%2C0810.2635%2C0810.5201%2C0810.0508%2C0810.1659%2C0810.1335%2C0810.1374%2C0810.4006%2C0810.4227%2C0810.2481%2C0810.5490%2C0810.4501%2C0810.2229%2C0810.0309%2C0810.2213%2C0810.2621%2C0810.4147%2C0810.3312%2C0810.5011%2C0810.1330%2C0810.4266%2C0810.0638%2C0810.2466%2C0810.0682%2C0810.3139%2C0810.1001%2C0810.3598%2C0810.3797%2C0810.2188%2C0810.0731%2C0810.4774%2C0810.0391%2C0810.0040%2C0810.4950%2C0810.2386%2C0810.3968%2C0810.1837%2C0810.0346%2C0810.3623%2C0810.5660%2C0810.4602%2C0810.5475%2C0810.4895%2C0810.4295%2C0810.1210%2C0810.2402%2C0810.4948%2C0810.5602%2C0810.3816%2C0810.2524%2C0810.1456%2C0810.1799%2C0810.4297%2C0810.2261%2C0810.1420%2C0810.0619%2C0810.3724%2C0810.0127%2C0810.4222%2C0810.4882%2C0810.1752%2C0810.0924%2C0810.1315%2C0810.5272%2C0810.1481%2C0810.3358%2C0810.2015%2C0810.3267%2C0810.2385%2C0810.4505%2C0810.2710%2C0810.1814%2C0810.2576%2C0810.3515%2C0810.1730%2C0810.0600%2C0810.1313&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Light localization induced enhancement of third order nonlinearities in\n  a GaAs photonic crystal waveguide"}, "summary": "Nonlinear propagation experiments in GaAs photonic crystal waveguides (PCW)\nwere performed, which exhibit a large enhancement of third order\nnonlinearities, due to light propagation in a slow mode regime, such as\ntwo-photon absorption (TPA), optical Kerr effect and refractive index changes\ndue to TPA generated free-carriers. A theoretical model has been established\nthat shows very good quantitative agreement with experimental data and\ndemonstrates the important role that group velocity plays. These observations\ngive a strong insight into the use of PCWs for optical switching devices.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0810.1327%2C0810.4432%2C0810.5307%2C0810.5708%2C0810.2718%2C0810.2678%2C0810.4018%2C0810.0368%2C0810.2578%2C0810.4746%2C0810.1887%2C0810.1525%2C0810.5450%2C0810.4594%2C0810.3437%2C0810.3823%2C0810.4961%2C0810.3238%2C0810.0338%2C0810.4256%2C0810.4607%2C0810.1399%2C0810.2114%2C0810.0377%2C0810.0051%2C0810.2635%2C0810.5201%2C0810.0508%2C0810.1659%2C0810.1335%2C0810.1374%2C0810.4006%2C0810.4227%2C0810.2481%2C0810.5490%2C0810.4501%2C0810.2229%2C0810.0309%2C0810.2213%2C0810.2621%2C0810.4147%2C0810.3312%2C0810.5011%2C0810.1330%2C0810.4266%2C0810.0638%2C0810.2466%2C0810.0682%2C0810.3139%2C0810.1001%2C0810.3598%2C0810.3797%2C0810.2188%2C0810.0731%2C0810.4774%2C0810.0391%2C0810.0040%2C0810.4950%2C0810.2386%2C0810.3968%2C0810.1837%2C0810.0346%2C0810.3623%2C0810.5660%2C0810.4602%2C0810.5475%2C0810.4895%2C0810.4295%2C0810.1210%2C0810.2402%2C0810.4948%2C0810.5602%2C0810.3816%2C0810.2524%2C0810.1456%2C0810.1799%2C0810.4297%2C0810.2261%2C0810.1420%2C0810.0619%2C0810.3724%2C0810.0127%2C0810.4222%2C0810.4882%2C0810.1752%2C0810.0924%2C0810.1315%2C0810.5272%2C0810.1481%2C0810.3358%2C0810.2015%2C0810.3267%2C0810.2385%2C0810.4505%2C0810.2710%2C0810.1814%2C0810.2576%2C0810.3515%2C0810.1730%2C0810.0600%2C0810.1313&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Nonlinear propagation experiments in GaAs photonic crystal waveguides (PCW)\nwere performed, which exhibit a large enhancement of third order\nnonlinearities, due to light propagation in a slow mode regime, such as\ntwo-photon absorption (TPA), optical Kerr effect and refractive index changes\ndue to TPA generated free-carriers. A theoretical model has been established\nthat shows very good quantitative agreement with experimental data and\ndemonstrates the important role that group velocity plays. These observations\ngive a strong insight into the use of PCWs for optical switching devices."}, "authors": ["A. Baron", "A. Ryasnyanskiy", "N. Dubreuil", "P. Delaye", "Q. Vy Tran", "S. Combrie", "A. de Rossi", "R. Frey", "G. Roosen"], "author_detail": {"name": "G. Roosen"}, "author": "G. Roosen", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1364/OE.17.000552", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0810.1001v3", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0810.1001v3", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "6 pages", "arxiv_primary_category": {"term": "physics.optics", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "physics.optics", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0810.1001v3", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0810.1001v3", "journal_reference": "Alexandre Baron, Aleksandr Ryasnyanskiy, Nicolas Dubreuil,\n  Philippe Delaye, Quynh Vy Tran, Sylvain Combrie, Alfredo de Rossi, Robert\n  Frey, and Gerald Roosen, Opt. Express 17, 552-557 (2009)", "doi": "10.1364/OE.17.000552", "fulltext": "Light localization induced enhancement of third\norder nonlinearities in a GaAs photonic crystal\nwaveguide\nAlexandre Baron1*, Aleksandr Ryasnyanskiy1, Nicolas Dubreuil1, Philippe Delaye1,\nQuynh Vy Tran2, Sylvain Combrié2, Alfredo de Rossi2, Robert Frey1, Gerald Roosen1\n1\n\nLaboratoire Charles Fabry de l'Institut d'Optique, CNRS, Univ Paris-Sud, Campus Polytechnique, RD128, 91127,\nPalaiseau Cedex, France\n2\nThales Research and Technology, RD128, 91767, Palaiseau, France\n*\nCorresponding author: alexandre.baron@institutoptique.fr\n\nAbstract: Nonlinear propagation experiments in GaAs photonic crystal\nwaveguides (PCW) were performed, which exhibit a large enhancement of\nthird order nonlinearities, due to light propagation in a slow mode regime,\nsuch as two-photon absorption (TPA), optical Kerr effect and refractive\nindex changes due to free-carriers generated by TPA. A theoretical model\nhas been established that shows a very good quantitative agreement with\nexperimental data and demonstrates the important role that the group\nvelocity plays. These observations give a strong insight into the use of\nPCWs for optical switching devices.\n©2008 Optical Society of America\nOCIS codes: (190.0190) Nonlinear optics; (130.5296) Photonic crystal waveguides; (190.3270)\nKerr effect; (190.4180) Multiphoton processes; (300.6420) Nonlinear spectroscopy; (160.6000)\nSemiconductor materials.\n\nReferences and links\n1.\n2.\n3.\n4.\n5.\n6.\n7.\n8.\n9.\n10.\n11.\n12.\n13.\n\nN. G. R. Broderick, P. Millar, D. J. Richardson, J. S. Aitchson, R. De La Rue, and T. Krauss, \"Spectral\nfeatures associated with nonlinear pulse compression in Bragg gratings,\" Opt. Lett. 25, 740-742 (2000).\nM. Astic, P. Delaye, R. Frey, G. Roosen, R. André, N. Belabas, I. Sagnes, and R. Raj, \"Time resolved\nnonlinear spectroscopy at the band edge of 1D photonic crystals,\" J. Phys. D: Appl. Phys. 41, 224005\n(2008).\nL. Razzari, D. Träger, M. Astic, P. Delaye, R. Frey, G. Roosen, and R. André, \"Kerr and four-wave mixing\nspectroscopy at the band edge of one-dimensional photonic crystals,\" Appl. Phys. Lett. 86, 231106 (2005).\nM. Roussey, F. I. Baida, and M. -P. Bernal, \"Experimental and theoretical observations of the slow-light\neffect on a tunable photonic crystal,\" J. Opt. Soc. Am. B 24, 1416-1422 (2007).\nT. Tanabe, M. Notomi, S. Mitsugi, A. Shinya, E. Kuramochi, \"Fast bistable all-optical switch and memory\non a silicon photonic crystal on-chip,\" Opt. Lett. 30, 2575-2577 (2005).\nY. Tanaka, H. Kawashima, N. Ikeda, Y. Sugimoto, H. Kuwatsuka, T. Hasama, H. Ishikawa, \"Optical\nbistable operations in AlGaAs-based photonic crystal slab microcavity at telecommunication wavelengths,\"\nIEEE Photon. Technol. Lett. 18, 1996-1998 (2006).\nE. Weidner, S. Combrié, A. de Rossi, N. -V. -Q. Tran, and S. Cassette, \"Achievement of ultrahigh quality\nfactors in GaAs photonic crystal membrane nanocavity,\" App. Phys. Lett. 90, 101118 (2007).\nS. Combrié, A. De Rossi, Q. V. Tran, H. Benisty, \"GaAs photonic crystal cavity with ultrahigh Q:\nmicrowatt nonlinearity at 1.55 μm,\" Opt. Lett. 33, 1908-1910 (2008).\nH. Oda, K. Inoue, Y. Tanaka, N. Ikeda, Y. Sugimoto, H. Ishikawa, and K. Asakawa, \"Self-phase\nmodulation in photonic-crystal-slab line-defect waveguides,\" App. Phys. Lett. 90, 231102 (2007).\nL. H. Frandsen, A. V. Lavrinenko, J. Fage-Pedersen, and P. I. Borel, \"Photonic crystal waveguides with\nsemi-slow-light and tailored dispersion,\" Opt. Express 14, 9444-9450 (2006).\nM. D. Settle, R. J. P. Engelen, M. Salib, A. Michaeli, L. Kuipers, and T. F. Krauss, \"Flatband slow light in\nphotonic crystals featuring spatial pulse compression and terahertz bandwidth,\" Opt. Express 15, 219-26\n(2007).\nS. Kubon, D. Mori, and T. Baba, \"Low-group-velocity and low-dispersion slow light in photonic crystal\nwaveguides,\" Opt. Lett. 32, 2981-2983 (2007).\nJ. Li, T. P. White, L. O'Faolain, A. Gomez-Iglesias, and T. F. Krauss, \"Systematic design of the flat band\nslow light in photonic crystal waveguides,\" Opt. Express 16, 6227-6232 (2008).\n\n\f14. S. Combrié, A. de Rossi, L. Morvan, S. Tonda, S. Cassette, D. Dolfi and A. Talneau, \"Time-delay\nmeasurement in singlemode, low-loss photonic crystal waveguides,\" Electron. Lett. 42, 86 (2006).\n15. S. Combrié, N-V-Q. Tran, E. Weidner, A. de Rossi, S. Cassette, P. Hamel, Y. Jaouën, R. Gabet, and A.\nTalneau, \"Investigation of group delay, loss, and disorder in a photonic crystal waveguide by lowcoherence reflectometry,\" Appl. Phys. Lett. 90, 231104 (2007).\n16. R. Frey, Ph. Delaye, G. Roosen, Nanophotonics, H.Rigneault, J.-M. Lourtioz, C. Delalande, and A.\nLevenson, (Eds. ISTE, 2006), chapter 6.\n17. P. Delaye, M. Astic, R. Frey, and G. Roosen, \"Transfer-matrix modeling of four-wave mixing at the band\nedge of a one-dimensional photonic crystal,\" J. Opt. Soc. Am. B 22, 2494-2504 (2005).\n18. T. F. Krauss, \"Slow light in photonic crystal waveguides,\" J. Phys. D: Appl. Phys. 40, 2666-2670 (2007).\n19. A. Ryasnyanskiy, N. Dubreuil, P. Delaye and G. Roosen, \"Fourier transformed picosecond synchronously\npumped optical parametric oscillator without spectral filtering elements,\" J. Europ. Opt. Soc. Rap. Public.\n3, 08037 (2008).\n20. S. Combrié, E. Weidner, A. de Rossi, S. Bansropun, S. Cassette, A. Talneau, and H. Benisty, \"Detailed\nanalysis by Fabry-Perot method of slab photonic crystal line-defect waveguides and cavities in aluminiumfree material system,\" Opt. Express 14, 7353-7361 (2006).\n21. Q. Lin, O. J. Painter, and G. P. Agrawal, \"Nonlinear optical phenomena in silicon waveguides: modeling\nand applications,\" Opt. Express 15, 16604-16644 (2007).\n22. M. Dinu, F. Quochi, and H. Garcia, \"Third-order nonlinearities in silicon at telecom wavelengths,\" App.\nPhys. Lett. 82, 2954-2956 (2003).\n23. D. E. Aspnes, \"Recombination at semiconductor surfaces and interfaces,\" Surface Science 132, 406 (1983).\n24. T. G. Ulmer, R. K. Tan, Z. Zhou, S. E. Ralph, R. P. Kenan, C. M. Verber, and A. J. SpringThorpe, \"Twophoton absorption-induced self-phase modulation in GaAs-AlGaAs waveguides for surface-emitted secondharmonic generation,\" Opt. Lett. 24, 756-758 (1999).\n25. A. A. Said, M. Sheik-Bahae, D. J. Hagan, T. H. Wei, J. Wang, J. Young, and E. W. Van Stryland,\n\"Determination of bound-electronic and free-carrier nonlinearities in ZnSe, GaAs, CdTe and ZnTe,\" J. Opt.\nSoc. Am. B 9, 405-414 (1992).\n26. J. S. Blakemore, \"Semiconductoring and other major properties of gallium arsenide,\" J. Appl. Phys. 53,\nR123 (1982).\n\n1. Introduction\nPhotonic crystal waveguides (PCWs) are known to exhibit peculiar propagation\ncharacteristics, such as strong transverse confinement and slow-light propagation. As a result,\nnonlinearities in such structures can be considerably enhanced. Therefore, PCWs are really\ninteresting for developing very small and very fast optical devices. In that sense, it is\nimportant to master both the experimental and theoretical actions of slow-light induced light\nlocalization on nonlinearities. Nonlinear propagation measurements showing an enhancement\nof performances due to light localization at the band edge of 1D photonic crystals have\npreviously been reported [1-3]. The effect of group velocity reduction has already been\ninvestigated in the case of electro-optic effects [4] and low command power optical switches\nhave already been demonstrated in silicon [5], AlGaAs [6] and GaAs [7] microcavities. As a\nmatter of fact it has very recently been demonstrated [8] that due to two-photon absorption\n(TPA) in GaAs cavities, nonlinearities can appear at a microwatt-level. So, combining slowlight properties of PCWs along with strong nonlinearities in III-V semiconductor devices such\nas GaAs, presents an undeniable opportunity, notably for optical switching.\nThe purpose of this letter is to report an experimental observation and a complete\nunderstanding of the third-order nonlinearities enhancement (TPA and self-phase modulation)\ndue to reduced group velocity in a PCW. By doing so, generalization of the local field theory\nof nonlinear homogenous media to the case of PCWs is achieved. Self phase modulation in a\nAlGaAs PCW has already been observed [9], but the nonlinear behavior has not been related\nto group velocity reduction or local field effects. Our experiment is performed using thin\nGaAs photonic crystal membrane waveguides. In order to clearly address optical\nnonlinearities enhancement, we choose a sample in which group velocity reduction with low\ndispersion and long enough interaction length can be achieved. Even though low-groupvelocities and low dispersion (LVLD) (with vg ! c / 30 ) have recently been achieved in\nPCWs [10-13], we decided to operate with the well-known W1 PCW for which fabrication\nand characterization are well mastered. In this structure a low dispersion value can be\n\n\fachieved in a moderate slow light regime ( vg ! c / 8 ) [10] with a low disorder effect allowing\nto work with longer (≈1mm) PCWs. Our waveguides are 250 nm in thickness and the lattice\nperiod a of the photonic crystal, consisting of air holes of r = 0.3 ! a in radius, are 410 nm\n[14]. The guides are obtained by omitting one row of holes in the !K direction and are 0.98\nmm long.\n2. Linear regime\nPrior to nonlinear characterization, we achieved a linear transmission spectroscopy of the\nPCW, using a tunable CW laser around 1550 nm. Figure 1(a) shows the transmitted spectrum\nand reveals fringes due to the Fabry-Perot effect between the input and output facets of the\nguide. Using the decreasing spectral distance !\" between fringes, we are able to determine\nthe group index ng = ! 2 / (2L\"! ) of the mode at different wavelengths. The measured ng are\nmarked by crossmarks in Fig. 1(b). It is clear that ng increases with the wavelength and is\nlargely superior to the bulk index n0 = 3.37 in accordance with the classical dispersion band\ndiagram for W1 waveguides [15]. A quadratic fit for ng is represented by a solid line and is\nused to calculate a group velocity dispersion (GVD) of -7.105 ps2 km-1 around 1550 nm. This\nreduction of the group velocity of the mode inside the waveguide is directly connected to light\nlocalization with a field enhancement in the waveguide that is customarily described using the\nlocal field factor f [16,17]. In the case of slow modes, f is equal to the square root of the\nslow down factor ( ng / n0 )[16,18] and is plotted in Fig. 1(b). As the third order nonlinearity is\nenhanced by f 4 [3,17], a large enhancement is expected for TPA and Kerr processes.\n\nFig. 1. (a) Linear transmission of the W1 guide (TE mode). Insets correspond to close-ups of\nthe transmission for a 1 nm width. (b) Wavelength dependence of calculated group index\n(crossmarks). A quadratic fit is represented by the continuous line. The dashed line represents\nthe f factor, calculated using the fitted curve of ng.\n\n3. Nonlinear regime\n3.1 Experimental setup and results\nLet us now emphasize on the nonlinear characteristics of the PCW in order to show the light\nlocalization induced enhancement of nonlinear interactions. To characterize our sample,\naround 1550 nm in the picosecond regime, we specifically developed an optical parametric\noscillator (OPO) with a pulse duration of ! L = 12 ps and a repetition rate of F = 80 MHz. The\npulses have a spectral width that is close to the Fourier limit (0.5 nm) [19], so as to have a fine\ncharacterization of the slow modes and resonant features of the PCW. Injection into the guide\nis achieved by using a microscope objective for which the numerical aperture is 0.85. Another\nobjective, identical to the previous one, is used to collimate the transmitted beam at the output\n\n\fof the guide. The beam is then injected into a single-mode fiber that is linked to an optical\nspectrum analyzer (OSA) with a 0.02 nm spectral resolution.\n\nFig. 2. Plot of power Pout after output microscope objective vs power Pin before input\nmicroscope objective. The thick and dashed lines denote the theoretical curve with and without\nslow light enhancement. Dots correspond to experimental data.\n\nFigure 2 shows a power dependent transmission curve recorded at 1550 nm, where ng = 6.14 .\n\nPin and Pout are the peak-powers at input and output of the injection and collection\nmicroscope objectives respectively and are obtained by multiplying the measured average\npower by (F ! \" L )#1 . Dots show the experimental data, which largely drifts away from the\nlinear evolution demonstrating nonlinear absorption, due to TPA. Taking into account light\nlocalization in the PCW and neglecting linear absorption, which is estimated to be less than\n1dB/mm for our guide [20], the output can be written as [21]:\nPout = K 2 Pin / (1 + Kf 4 !TPA LPin / Aeff ) ,\n\n(1)\n\nwhere !TPA = 10 cm/GW [22] is the bulk TPA coefficient of GaAs, Aeff = 0.1 μm2 is the\neffective mode area and L is the guide length. The coupling efficiency K is assumed to be\nidentical at input and output and was determined equal to 5.7 ! 10 \"3 from the linear\ntransmission measurement that takes place at low power. Note that in equation (1), !TPA has\nbeen replaced by f 4 !TPA , as it must be done for a third order nonlinear process [16] with\nf =1.35, determined from Fig. 1(b). Using this correction, theory (continuous line on Fig. 2)\nand experiment (dots) are remarkably well in accordance with no adjustable parameters. If we\nneglect the local field correction, we obtain the dashed line, which is clearly unsatisfactory\nbecause it is significantly higher than the experimental results. These observations definitely\ndemonstrate, as already noticed in [3], that the propagation of a beam with reduced group\nvelocity cannot be described using the bulk material nonlinear coefficients. Note that the\nnonlinear absorption is 2.5 times larger in the PCW than in the bulk material which definitely\ndemonstrates the major role played by group velocity reduction in the nonlinear interaction.\nSecond, we analyzed the transmitted spectrum (Fig. 3(a)) around 1554 nm, wavelength\nfor which we observed the best results. The black and green line represent the spectra\nrecorded at 8 W and 80 W peak power respectively. These powers were measured before the\ninjection microscope objective. At lower power, the spectrum is identical to the input\nspectrum with the additional Fabry-Perot modulations observed in the CW regime (Fig. 1(a)).\nNotice that the pulse shape is expected to be conserved as the dispersive length\nLD = ! L2 / GVD in our experiment (205 mm) is much larger than L. For an 80 W incident peak\npower, the spectrum has notably broadened. The Fabry-Perot spectral oscillations were\neliminated by temporally filtering the signal autocorrelation function at half the round trip\ntime inside the guide. As a matter of fact, by doing so, spectral interferences are suppressed\n\n\fbecause the first and second pulses are integrated without temporally overlapping. The filtered\nspectrum is represented by the red line on Fig. 3(a). After propagation inside the guide, the\npulse undergoes both blue and red shifts, which are the result of self-phase modulation.\n\nFig. 3. (a) High and low injection power transmitted spectra through the guide (green and black\ncurve respectively). The red curve represents the filtered high power spectrum. (b) Theoretical\nsimulation of the transmitted spectrum for an 80 W incident peak power with (i.e. f=1.4) and\nwithout (i.e. f=1) slow light enhancement (red and blue line respectively).\n\nWe already have evidence of TPA as shown by the first experiment. Free-carriers induced by\nTPA have the effect of decreasing the index of refraction. If we hypothesize that carrier\nlifetime is much larger than the pulse duration, which is reasonable to assume given the\ndimensions of the guide [23], a refractive index change !n(z, t) proportional to the carrier\ndensity N(z, t) is induced. Consequently, due to self phase modulation, the spectrum must\nexhibit a blue-shift, which indicates that free-carrier index change (FCI) does not fully explain\nthe spectral split observed. This split is in fact due to self phase modulation induced by Kerr\neffect. Given the sign of the nonlinear Kerr index ( n2 = 1.6 ! 10 \"17 m2/W for bulk GaAs [22]),\nthe leading edge of the pulse is red-shifted, whereas the trailing edge is blue-shifted. So Kerr\neffect and FCI have opposite signs on the leading edge, but have the same sign on the trailing\nedge, which means that a greater part of the pulse is blue-shifted. This is consistent with the\nobserved spectrum, because the blue-shifted peak is stronger than the red-shifted one.\n3.2 Numerical simulation\nBeyond the qualitative agreement, we investigate the effect of the f factor for a thorough\nquantitative description. In the same way !TPA is multiplied by f 4 , n2 should be multiplied\nby the same amount, because it is proportional to the real part of ! (3) . However, FCI is an\neffective fifth order process resulting from the mixing of a linear process (polarizability of\nfree-carriers) and a third order nonlinear process (TPA generating free-carriers), for which the\ncorrecting local field factor is f 6 .\nTaking all the nonlinear processes into account, intensity I(z, t) and phase ! (z, t) of the\npropagating beam are governed by:\n\n! I(z, t) / ! z = \" f 4 #TPA I 2 (z, t)\n\n(2)\n\n!\" (z, t) / ! z = k0 [ f n2 I(z, t) + f # n N(z, t)] ,\n4\n\n2\n\n(3)\n\n\fwhere k0 is the free space wave vector and ! n = \"7 # 10 \"21 cm3 is the refractive index change\nper carrier-pair density and can be calculated using the Drude model [23-25]. Integration of\nEq. (2) leads to Eq. (1). Light intensity is governed by TPA (free-carrier absorption is\nneglected considering its low value [26]), while phase is influenced by optical Kerr effect and\nFCI due to TPA generated free-carriers with a density:\nt\n\nN(z, t) =\n\n&\n\nf 4 !TPA (2!\" 0 )#1 I 2 (z, $ ) d$ .\n\n(4)\n\n#%\n\nUsing Eqs. (2), (3) and (4), we numerically simulated the nonlinear propagation of the pulse\nthrough the guide. The result of this simulation enabled us to calculate the theoretical output\nspectrum for an 80 W incident peak power, which is plotted in red in Fig. 3(b). We observe a\nvery good agreement between the simulated curve and the experimental curve from Fig. 3(a),\nconsidering that there are no adjustable parameters. The peak intensity of the injected pulse is\ndetermined using the measured value of K = 6 ! 10 \"3 , measured at low power for this\nexperiment. The large nonlinear modification of the spectrum is therefore obtained for an\ninjected peak power of only 0.5 W ( ! K ! 80 W). Note that the simulated temporal phase\nreveals a maximum phase shift of almost 2! for the red curve on Fig. 3(b). Finally, for the\nsame peak power, the simulated spectrum, obtained when neglecting light localization\n( f = 1 ), is represented on Fig. 3(b) in blue. It does not exhibit any clear spectral shift or\nbroadening and clearly demonstrates the essential role of group velocity reduction in the\nenhancement of nonlinear effect at low peak powers.\n4. Conclusion\nIn summary, we have performed nonlinear propagation experiments in a slow-mode PCW,\ndemonstrating a large enhancement of nonlinear optical processes such as TPA, optical Kerr\neffect and refractive index changes due to TPA generated free-carriers. We clearly see that the\nrefractive index change due to TPA-induced free-carriers, which is an effective fifth order\nprocess, is enhanced by a factor f 6 ! 8 compared to the bulk material, while the Kerr\nnonlinear index is enhanced by f 4 ! 4 . The very good quantitative agreement between\ntheory and experiment proves the soundness of our model and clearly shows that reduction of\nthe group velocity can be exploited to optimize nonlinearities. Despite the moderate reduction\nof the group velocity of v g ! c / 7 achieved in our waveguide, a maximum nonlinear phase\nshift of ! is predicted with a peak power of only 0.3 W. This performance is due to the strong\nnonlinear properties of GaAs and to our manufacturing control that allows the realization of\nmillimeter length samples with low disorder effects. Stronger reduction of v g as obtained\nrecently in LVLD PCWs [8-10], would be interesting for nonlinear applications but should be\nhandled with care. Indeed increasing the local field factor f enhances the higher order\nnonlinearities, such as three-photon absorption or free-carrier index changes [2], more rapidly\nthan the lower order two-photon absorption or Kerr effect, leading to necessary trade-offs in\nthe conception of nonlinear devices.\nAcknowledgments\nA. Ryasnyanskiy acknowledges the RTRA \"Triangle de la physique\" for financial support.\n\n\f"}