{"id": "http://arxiv.org/abs/0707.4377v1", "guidislink": true, "updated": "2007-07-30T11:41:12Z", "updated_parsed": [2007, 7, 30, 11, 41, 12, 0, 211, 0], "published": "2007-07-30T11:41:12Z", "published_parsed": [2007, 7, 30, 11, 41, 12, 0, 211, 0], "title": "Fractal dimension and size scaling of domains in thin films of\n  multiferroic BiFeO3", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0707.4368%2C0707.2173%2C0707.2120%2C0707.2762%2C0707.4377%2C0707.4431%2C0707.1284%2C0707.2645%2C0707.3016%2C0707.3259%2C0707.3089%2C0707.4414%2C0707.1914%2C0707.0070%2C0707.0569%2C0707.1501%2C0707.4148%2C0707.3836%2C0707.0752%2C0707.1408%2C0707.2502%2C0707.1916%2C0707.2752%2C0707.3602%2C0707.0683%2C0707.3256%2C0707.0304%2C0707.3307%2C0707.2571%2C0707.1156%2C0707.3555%2C0707.4596%2C0707.0931%2C0707.2928%2C0707.1906%2C0707.4262%2C0707.3260%2C0707.1278%2C0707.0528%2C0707.1813%2C0707.2865%2C0707.0782%2C0707.1645%2C0707.0142%2C0707.2342%2C0707.1492%2C0707.1841%2C0707.0220%2C0707.2480%2C0707.0737%2C0707.0733%2C0707.0608%2C0707.4037%2C0707.3747%2C0707.3699%2C0707.3318%2C0707.1380%2C0707.0820%2C0707.1925%2C0707.2225%2C0707.2252%2C0707.1009%2C0707.3362%2C0707.3512%2C0707.2433%2C0707.2150%2C0707.1457%2C0707.2292%2C0707.3462%2C0707.2663%2C0707.3892%2C0707.3361%2C0707.1969%2C0707.3303%2C0707.4529%2C0707.0902%2C0707.3047%2C0707.1971%2C0707.0023%2C0707.2400%2C0707.3767%2C0707.0991%2C0707.1677%2C0707.3428%2C0707.2606%2C0707.1386%2C0707.2189%2C0707.1785%2C0707.3020%2C0707.0175%2C0707.0093%2C0707.0256%2C0707.3118%2C0707.4651%2C0707.3214%2C0707.1002%2C0707.1423%2C0707.2862%2C0707.3955%2C0707.3841%2C0707.3040&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Fractal dimension and size scaling of domains in thin films of\n  multiferroic BiFeO3"}, "summary": "We have analyzed the morphology of ferroelectric domains in very thin films\nof multiferroic BiFeO3. Unlike the more common stripe domains observed in\nthicker films BiFeO3 or in other ferroics, the domains tend not to be straight,\nbut irregular in shape, with significant domain wall roughening leading to a\nfractal dimensionality. Also contrary to what is usually observed in other\nferroics, the domain size appears not to scale as the square root of the film\nthickness. A model is proposed in which the observed domain size as a function\nof film thickness can be directly linked to the fractal dimension of the\ndomains.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0707.4368%2C0707.2173%2C0707.2120%2C0707.2762%2C0707.4377%2C0707.4431%2C0707.1284%2C0707.2645%2C0707.3016%2C0707.3259%2C0707.3089%2C0707.4414%2C0707.1914%2C0707.0070%2C0707.0569%2C0707.1501%2C0707.4148%2C0707.3836%2C0707.0752%2C0707.1408%2C0707.2502%2C0707.1916%2C0707.2752%2C0707.3602%2C0707.0683%2C0707.3256%2C0707.0304%2C0707.3307%2C0707.2571%2C0707.1156%2C0707.3555%2C0707.4596%2C0707.0931%2C0707.2928%2C0707.1906%2C0707.4262%2C0707.3260%2C0707.1278%2C0707.0528%2C0707.1813%2C0707.2865%2C0707.0782%2C0707.1645%2C0707.0142%2C0707.2342%2C0707.1492%2C0707.1841%2C0707.0220%2C0707.2480%2C0707.0737%2C0707.0733%2C0707.0608%2C0707.4037%2C0707.3747%2C0707.3699%2C0707.3318%2C0707.1380%2C0707.0820%2C0707.1925%2C0707.2225%2C0707.2252%2C0707.1009%2C0707.3362%2C0707.3512%2C0707.2433%2C0707.2150%2C0707.1457%2C0707.2292%2C0707.3462%2C0707.2663%2C0707.3892%2C0707.3361%2C0707.1969%2C0707.3303%2C0707.4529%2C0707.0902%2C0707.3047%2C0707.1971%2C0707.0023%2C0707.2400%2C0707.3767%2C0707.0991%2C0707.1677%2C0707.3428%2C0707.2606%2C0707.1386%2C0707.2189%2C0707.1785%2C0707.3020%2C0707.0175%2C0707.0093%2C0707.0256%2C0707.3118%2C0707.4651%2C0707.3214%2C0707.1002%2C0707.1423%2C0707.2862%2C0707.3955%2C0707.3841%2C0707.3040&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We have analyzed the morphology of ferroelectric domains in very thin films\nof multiferroic BiFeO3. Unlike the more common stripe domains observed in\nthicker films BiFeO3 or in other ferroics, the domains tend not to be straight,\nbut irregular in shape, with significant domain wall roughening leading to a\nfractal dimensionality. Also contrary to what is usually observed in other\nferroics, the domain size appears not to scale as the square root of the film\nthickness. A model is proposed in which the observed domain size as a function\nof film thickness can be directly linked to the fractal dimension of the\ndomains."}, "authors": ["G. Catalan", "H. Bea", "S. Fusil", "M. Bibes", "P. Paruch", "A. Barthelemy", "J. F. Scott"], "author_detail": {"name": "J. F. Scott"}, "author": "J. F. Scott", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevLett.100.027602", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0707.4377v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0707.4377v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "4 pages, 3 figures", "arxiv_primary_category": {"term": "cond-mat.mtrl-sci", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.mtrl-sci", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0707.4377v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0707.4377v1", "journal_reference": null, "doi": "10.1103/PhysRevLett.100.027602", "fulltext": "Fra tal dimension and size s aling of domains in thin \u001clms of\nmultiferroi BiFeO3\nG. Catalan1 ,∗ H. Béa2 , S. Fusil2, M. Bibes3 , P. Paru h4 , A. Barthélémy2 , and J. F. S ott1\n\narXiv:0707.4377v1 [cond-mat.mtrl-sci] 30 Jul 2007\n\n1\n\nCentre for Ferroi s, Department of Earth S ien es,\n\nUniversity of Cambridge, Cambridge CB2 3EQ, United Kingdom\n\n2\n\nUnité Mixte de Physique CNRS/Thales,\n\nRoute départementale 128, 91767 Palaiseau, Fran e\n\n3\n\nInstitut d'Ele tronique Fondamentale, CNRS,\nUniv.\n\n4\n\nParis-Sud, 91405 Orsay, Fran e and\n\nLaboratory of Atomi\n\nand Solid State Physi s,\n\nCornell University, Itha a, New York, USA\n\n(Dated: O tober 23, 2018)\n\nAbstra t\nWe have analyzed the morphology of ferroele tri domains in very thin \u001clms of multiferroi\nBiFeO3 . Unlike the more ommon stripe domains observed in thi ker \u001clms BiFeO3 or in other\nferroi s, the domains tend not to be straight, but irregular in shape, with signi\u001c ant domain wall\nroughening leading to a fra tal dimensionality. Also ontrary to what is usually observed in other\nferroi s, the domain size appears not to s ale as the square root of the \u001clm thi kness. A model is\nproposed in whi h the observed domain size as a fun tion of \u001clm thi kness an be dire tly linked\nto the fra tal dimension of the domains.\n\n∗\n\nEle troni\n\naddress: g at05\bes . am.a .uk\n\n1\n\n\fMultiferroi materials are urrently attra ting a great deal of attention on a ount of\ntheir interesting physi s and potential appli ations [1℄. Of these, possibly the most studied\nis the perovskite BiFeO3 (BFO), one of the very few materials whi h is multiferroi (ferroele tri and antiferromagneti ) at room temperature [2, 3℄. Its lead-free nature and large\nremanent polarization [4℄ have already motivated Fujitsu to use it as the a tive layer in prototype ferroele tri memories [5℄; also, sub-latti e magneti swit hing using voltage has been\ndemonstrated [6℄, whi h may \u001cnd its way into spintroni appli ations via ex hange bias [7℄.\nThe possible oupling between ferroele tri and antiferromagneti domains has triggered a\n\u001durry of work on the morphology and fun tional properties of the domains [6, 8, 9, 10, 11℄.\nThe ferroele tri domains are generally found to be straight-walled, and to follow the wellknown s aling law of Landau, Lifshitz and Kittel (LLK) [12, 13, 14℄, that is, their domain\nsize grows proportionally to the square root of \u001clm thi kness [10℄.\nBFO has a omplex phase sequen e, both in bulk and in thin \u001clm form. In bulk, it goes (on\nooling) from ubi to orthorhombi to rhombohedral, with a re ently-dis overed possible\nmetal-insulator transition at high-temperature [15℄. The room-temperature rhombohedral\nphase is normally mono lini for epitaxial thin \u001clms, but it appears to be tetragonal below\na riti al thi kness, whi h for BFO grown epitaxially on SrTiO3 substrates is of the order\nof 100nm [16℄. We have analyzed the morphology and s aling of the domains in the smallthi kness (tetragonal) regime and found it to be fundamentally di\u001berent from that observed\nat higher thi kness: i) the domains are not straight, but irregular in shape; ii) there is\nsigni\u001c ant domain wall roughness with a fra tal dimensionality; and iii) the average domain\nsize does not s ale as the square root of the \u001clm thi kness. Taking into a ount the fra tal\nnature of the domain walls, we have derived a new relation whi h a ounts for the anomalous\ndomain size behaviour, with the s aling exponent being a fun tion of the fra tal Hausdor\u001b\ndimension.\nThe thin \u001clms of BFO were grown by pulsed laser deposition on SrTiO3 with a ondu tive\nbu\u001ber layer of (La,Sr)MnO3 [17℄, and the ferroele tri domain morphology was studied by\nway of piezo-response atomi for e mi ros opy (PFM). In Figure 1 we show the surfa e\ntopology and PFM response of some \u001clms. The shape of these \"virgin\" domains is highly\nirregular, and not orrelated with topography. Irregularly-shaped domains have also been\nseen in mu h thinner \u001clms (30nm or less [11℄), so it appears to be a general property of ultrathin BFO, with the riti al thi kness depending on the hoi e of substrate and ele trode, as\n2\n\n\fFIG. 1: Surfa e topography and PFM s ans of domains in BFO \u001clms of di\u001berent thi kness. The\nPFM antilever was oriented along a h100i axis\n\nwell as growth onditions.\nFigure 2 shows the average domain period as a fun tion of \u001clm thi kness. For omparison,\nequivalent data for domains in other ferroi systems (ferroele tri or ferromagneti ) are\nin luded. While ferroele tri domains are generally smaller than ferromagneti domains\n[18, 19, 20, 21℄, the ferroele tri domains in multiferroi BFO are noti eably bigger than\nthose in \"pure\" ferroele tri s. This suggests a higher energy ost of the domain walls [21,\n22℄, possibly due to the ontribution from the magnetoele tri\n\noupling term. Even more\n\nsurprising is the fa t that the domain periodi ity does not s ale as the square root of the\n\u001clm thi kness. In our ase, the exponent for the thi kness dependen e in w = Adγ (where w\nis domain period and d is \u001clm thi kness) is around γ ≃ 3/4. This is not due to the fa t that\nthe domains are of mosai -type rather than stripes, sin e su h domains are also predi ted\nto follow the γ =1/2 s aling [14℄, so a di\u001berent explanation is required.\nIn order to gain further insight into this problem we have studied the morphology of\nthe domain walls. Firstly, using the program WSxM [23℄, we have analyzed the ratio of\nperimeters (P ) to areas (A) for the spontaneous domains [24℄. The s aling is su h that\n3\n\n\fBFO domain period (nm)\n\n200\n\n100\n80\n60\n40\nIn-plane\nOut-of-plane\n20\n10\n\n100\n\nFilm thickness (nm)\n\nFerroic domain period (nm)\n\n1000\nγ=0.53\n\n100\nγ=0.55\n\nγ=0.75\nγ=0.46\n\n10\n\nBiFeO3\nβ-PbTiO3 [18]\nα-PbTiO3 [18]\nCo [19]\nBaTiO3 [20]\n\nγ=0.49\n\n1\n\n1\n\n10\n100\nFilm thickness (nm)\n\n1000\n\nFIG. 2: Above, periodi ity of in-plane and out-of-plane domain ontrast in the PFM s ans as a\nfun tion of BFO \u001clm thi kness. The straight lines are least-\u001ct squares giving s aling exponents\nof 0.70±0.07 (out-of-plane) and 0.81±0.04 (in-plane). Below, omparison between the ferroele tri\ndomain periodi ity of BFO and the domain periodi ity of other ferroi s found in the literature.\nP ∝ AHk /2 , where Hk is the Hausdor\u001b dimension of the domain walls in their proje tion\n\non the x-y plane a essible by the PFM; if the domain walls were perfe tly smooth, Hk =1,\notherwise 1 ≤ Hk ≤ 2. Plotting log(P ) vs log(A) (\u001cgure 3), Hk = 1.45 ± 0.2 was obtained.\nThis value is in lose agreement with that found in BFO-doped lead zir onium-titanate\n(PZT) \u001clms, where fra tal ferroele tri domains were written using a PFM tip via liquid\nele trodes [25℄.\nTo relate these observations to the nature of the domain walls, we have also dire tly\nmeasured the domain wall roughness of AFM-written linear domains, reated by alternate\nappli ations of negative and positive voltage (± 8V) to the \u001clm surfa e. The resulting domain\nwalls were analyzed using the pair- orrelation method des ribed by Paru h et al. [26℄. The\n4\n\n\forrelation fun tion of relative displa ements essentially measures the lo al varian e of the\ndomain wall position from an elasti ally ideal \u001dat on\u001cguration as a fun tion of the length\nL along the wall, and is predi ted to show a power-law growth at equilibrium, governed by a\nhara teristi roughness exponent zeta. We observe su h a power law growth at short length\ns ales (L<100 nm) followed by a saturation of the orrelation fun tion. The value of the\nroughness exponent ζ ∼ 0.5 − 0.6 is higher than that observed in PZT [26℄, and ould be an\nindi ation of either a lower dimensionality (being lose to the theoreti ally predi ted value\nof ζ =2/3 for a one-dimensional elasti domain wall in random bond disorder potential), or\npossibly a di\u001berent type of disorder playing an important role in a system with ombined\nmagneti and ele tri e\u001be ts [27℄.\nThere are additional self- onsisten y he ks possible for the fra tal Hausdor\u001b dimension,\nrequiring time-resolved data for urrent transients [28℄. For well-annealed PZT, analysis of\nI(t) yielded [29℄ H = 2.55 ± 0.25, ompatible with the present results on BFO assuming\nstraight walls normal to the \u001clm surfa e, that is, H = Hk + H⊥ =1.5+1.0 where Hk and\nH⊥ are, respe tively, the in-plane and out-of-plane omponents of the fra tal dimension. A\n\nsimilar result was also inferred for SBN (strontium barium niobate) by Kleemann et al. [30℄,\nwho observed a dimensionality of 1 < H −1 < 1.7, inferring H = 2.35±0.35. The dimensionality of 2.5 is also ompatible with hypers aling near riti al points in ferroele tri s [31, 32℄.\nFinally, it is also worth mentioning the work of Yu and Randall [33℄, who showed fra tal-like\n(dentriti ) domain stru tures in relaxor ferroele tri s, although the fra tal dimension was\nnot al ulated in that ase.\nThe fra tal nature of the domain walls, and even the spe i\u001c Hausdor\u001b dimension of ∼ 2.5,\nappear therefore to be rather more general than previously thought, so it is important to\nunderstand how fra tal walls may a\u001be t domain s aling. A fra tal distribution of domain\nsizes (Cantor sets) has been analysed [34℄ for ferroele tri stripe domains, but the walls in\nthese studies were straight, and a onventional LLK exponent γ = 1/2 was still found, unlike\nthat of our \u001clms. Here, instead, we have modi\u001ced the domain size s aling problem in order\nto in orporate the fra tal roughening. The LLK law arises from the need to minimize the\ntotal energy of the domains and that of the domain walls. The energy density of the domains\nis proportional to their size w (irrespe tive of whether they are stripe-type or mosai -type\n[14℄):\n\n5\n\n\f(1)\n\nEdomain = Uw\n\nWhere U is a onstant arising from either depolarization, demagnetization, strain, or\na ombination of them. The energy of the\n\ndomain walls\n\nis proportional to their number\n\ndensity, whi h is found dividing the area of the \u001clm by the area of ea h domain, i.e., N =\nL2 /w 2=number of domain walls. The energy of ea h domain wall is equal to its energy\n\ndensity (σ ) times the area of the wall, whi h is essentially the domain perimeter times the\nthi kness of the \u001clm: σP d. If the domain walls are fra tal, then the domain perimeter does\nnot s ale linearly with the average domain size w, but fra tally as P = wHk , where Hk is\nthe Hausdor\u001b dimension. Hen e Ewall = σwHk d. The energy of all the domain walls in the\nrystal is thus Ewall × N = σwHk dL2 /w2 , and the energy density (per unit area of \u001clm) is\nfound dividing by L2 . Thus:\nd\nw2\n\nEwalls = σw Hk\n\n(2)\n\nThe optimum domain size is found by adding (1) and (2) and minimizing with respe t to\nw . This leads to\n\nw=\n\nh\n\n„\n\n\u0001 σi\n2 − Hk\nU\n\n1\n3−Hk\n\n«\n\nd\n\n„\n\n1\n3−Hk\n\n«\n\n= kd\n\n„\n\n1\n3−Hk\n\n«\n\n(3)\n\nThe above treatment assumes that the domain walls are straight in the verti al dire tion.\nOtherwise, the verti al size of the domain walls would s ale as dH⊥ , and Eq. 3 would be ome\ninstead:\nw = kd\n\n„\n\nH⊥\n3−Hk\n\n«\n\n(4)\n\nFor H⊥ =Hk =1 (\u001dat walls) we re over the standard Kittel result γ = 1/2.\nPFM does not allow establishing whether the walls are rough or straight along the zdire tion. Previous work in PZT [26℄ and Bi4 Ti3 O12 [35℄ shows that domain walls may be\nrough along one dire tion and \u001dat along another, due to anisotropy in the strength of the\ndipole-dipole and elasti intera tions. Here, omparison between eq. 3, eq. 4, and the\nmeasured domain periodi ity as a fun tion of thi kness an help to indire tly determine H⊥ .\nFor the measured Hk ≃ 3/2, assuming straight walls along the verti al dire tion, eq. 3\npredi ts a value γ ≃2/3 for the exponent in w = kdγ . If, on the other hand we assume that\n6\n\n\f16\n15\n\nln(P)[Å]\n\n14\n13\n12\n11\n10\n9\n10\n-15\n\nCorrelation function B(L) (m2)\n\n10\n\n11\n1\n2\n3\n\n12\n4\n5\n6\n\n13 14 15\n2\nln(A)[Å ]\n\n16\n\n17\n\n18\n\n7\n\n500 nm\n-16\n\n10\n\n4\n\n2\n3\n\n1\n\n10\n\n-8\n\n10\nLengthscale L (m)\n\n6\n5\n\n7\n\n-7\n\nFIG. 3: Above, perimeter as a fun tion of area for spontaneously formed domains. The slope of\nthe log-log plot is related to the Hausdor\u001b dimension: P ∝ AHk /2 . Below, orrelation fun tion for\nthe roughness of the written domain walls as a fun tion of lengths ale, measured for a 70 nm thi k\nBFO \u001clm. An average value of the roughness exponent exponent ζ =0.56 is obtained for the seven\ndomain walls indi ated. This higher value of ζ for BFO ompared to that for PZT suggests either\na lower dimensionality in a random bond pinning s enario, or the presen e of stronger individual\npinning enters whi h ould also be responsible for the fra tal stru ture of the spontaneous domains\nin the BFO \u001clms.\nHk =H⊥ , then eq. 4 predi ts γ =1 instead (although it is worth mentioning that values of\nγ approa hing 1 would also be onsistent with the lassi al theory for ferroelasti domains,\n\nwhi h predi ts γ =1 for small thi kness [36℄). The a tual measured value for the periodi ity\nof the in-plane domains is (see Figure 2) γ ≈0.7-0.8, whi h suggests that the domain walls\nare anisotropi ally roughened, being more irregular in the horizontal dire tion than in the\nverti al one.\nThe present theoreti al framework is valid not just for BFO, but for any ferroi (ferroele tri , ferromagneti or ferroelasti ) material with fra tal walls. Although it is onsistent\n7\n\n\fwith the empiri al results, the domains in the thinnest \u001clms are lose to the resolution limit\nof PFM, and thus there is a substantial error bar asso iated with their measured periodi ity.\nAlso, the value of the s aling exponent γ appears to be di\u001berent for out-of-plane and in-plane\nvariants (Figure 2-a), although the di\u001beren e is within the statisti al error. Finally, while\nthe fra tal analysis was performed on the samples with best signal-to-noise ratio, there may\nstill be some ele troni noise ontribution to the fra tal dimension.\nIn summary, we have analyzed the domain periodi ity and domain morphology of very\nthin \u001clms of BFO and found: i) the spontaneous ferroele tri domains in BFO are generally\nbigger than those in other ferroele tri s, onsistent with an in reased energy ost of the\ndomain walls due to magnetoele tri\n\noupling; ii) the domains are irregularly shaped and\n\nhara terized by a fra tal dimension; iii) the domain size does not s ale as the square root\nof the \u001clm thi kness; and iv) the unusual s aling an be dire tly related to the the fra tal\ndimension of the walls. Spe i\u001c further tests on the fra tal dimensionality inferred are\nsuggested, parti ularly the use of swit hing urrent transients. We hope that these \u001cndings\nwill motivate more resear h into the physi s of domain walls in ferroi and multiferroi\nsystems.\nWe a knowledge \u001cnan ial support from ANR-FEMMES and from a Marie Curie Fellowship (GC).\n\n[1℄ M. Fiebig, J. Phys. D 38, 123 (2005); W. Eerenstein, N. Mathur, J. F. S ott, Nature 442,\n759-765 (2006); S. W. Cheong, M. Mostovoy, Nature Materials 6,13-20 (2007) R. Ramesh, N.\nSpaldin, Nature Materials 6, 21-29 (2007).\n[2℄ G. Smolenskii, V. Isupov, A. Agranovskaya, and N. Kranik, Sov. Phys. Solid State 2, 2651\n(1961).\n[3℄ J. R. Teague, R. Gerson, W. J. James, Solid State Commun. 8, 1073-1074 (1970); I. Sosnovska,\nT. Peterlin-Neumaier, E. Stei hele, J. Phys. C 15, 4835-4846 (1982).\n[4℄ J. Wang et al., S ien e 299, 1719-1722 (2003).\n[5℄ http://www.fujitsu. om/my/news/pr/fmal_20060808.html\n[6℄ T. Zhao et\n\nal.\n\n, Nature Materials 5, 823-829 (2006).\n\n[7℄ H. Béa, M. Bibes, S. Cheri\u001c, F. Nolting, B. Warot-Fonrose, S. Fusil, G. Herranz, C. Deranlot,\n\n8\n\n\fE. Ja quet, K. Bouzehouane, and A. Barthélémy, Appl. Phys. Lett. 89, 242114 (2006).\n[8℄ F. Zavali he, R. Das, D. M. Kim, C. B. Eom, S. Y. Yang, P. Shafer, and R. Ramesh, Appl.\nPhys. Lett. 87, 182912 (2005)\n[9℄ Y.-H. Chu, Q. Zhan, L. W. Martin, et\n\n, Advan ed Materials 18, 2307-2311, (2006).\n\nal.\n\n[10℄ Y. B. Chen, M. B. Katz, X. Q. Pan, R. R. Das, D. M. Kim, S. H. Baek, and C. B. Eom, App.\nPhys. Lett. 90, 072907 (2007).\n[11℄ Y. H. Chu, T. Zhao, M. P. Cruz, Q. Zhan, P. L. Yang, L. W. Martin, M. Huijben, C. H. Yang,\nF. Zavali he, H. Zheng, and R. Ramesh, Appl. Phys. Lett. 90, 252906 (2007).\n[12℄ L. Landau, E. Lifshitz, Phys. Zeits. Sowjetunion 8, 153-169 (1935).\n[13℄ C. Kittel, Phys. Rev. 70, 965-971 (1946).\n[14℄ C.Kittel, Rev. Mod. Phys. 21, 541-583 (1949).\n[15℄ R. Palai, R.S. Katiyar, J.F. S ott, arXiv: ond-mat/0705.2883 (2007).\n[16℄ H. Béa, M. Bibes, S. Petit, J. Kreisel and A. Barthélémy, Phil. Mag. Lett. 87, 165-174 2007\n[17℄ H. Béa, M. Bibes, A. Barthélémy, K. Bouzehouane, E. Ja quet, A. Khodan, J.-P. Contour,\nS. Fusil, F. Wy zisk, A. Forget, D. Lebeugle, D. Colson, and M. Viret, Appl. Phys. Lett. 87,\n072508 (2005).\n[18℄ M. Hehn, S. Padovani, K. Ounadjela and J. P. Bu her Phys. Rev. B 54 3428 (1996).\n[19℄ S. K. Strei\u001ber, J. A. Eastman, D. D. Fong, Carol Thompson, A. Munkholm, M.V. Ramana\nMurty, O. Au iello, G. R. Bai, and G. B. Stephenson, Phys. Rev. Lett. 89, 67601 (2002).\n[20℄ A. S hilling, T. B. Adams, R. M. Bowman, J. M. Gregg, G. Catalan, and J. F. S ott, Physi al\nReview B 74, 024115 (2006).\n[21℄ G. Catalan, J. F. S ott, A. S hilling, J. M. Gregg, Journal of Physi s: Condensed Matter 19,\n022201 (2007)\n[22℄ V. A. Stephanovi h, I. A. Lukyan huk and M. G. Karkut Phys. Rev. Lett. 94 047601 (2005)\n[23℄ http://www.nanote .es\n[24℄ In order to minimize spurious ontributions from ele troni noise to the apparent wall roughening, we analysed only the samples with the biggest signal-to-noise ratio (35 and 70nm), and\nthen only those domains with an area bigger than 6 pixels.\n[25℄ B. J. Rodriguez, S. Jesse, A. P. Baddorf, S-H. Kim, and S. V. Kalinin, Phys. Rev. Lett. 98,\n247603 (2007)\n[26℄ P. Paru h, T. Giamar hi, and J.-M. Tris one, Phys. Rev. Lett. 94, 197601 (2005).\n\n9\n\n\f[27℄ For a random \u001celd system ζ = (4 − def f )/3, giving a domain wall dimensionality of 2.5 for\nthe observed values of zeta. However, we note that studies in both pure ferromagneti and\nferroele tri materials both showed random bond rather than random \u001celd disorder, making\nthe random \u001celd s enario less likely. It is also worth emphasizing that the non-integer e\u001be tive\ndimensions extra ted from the roughness analysis do not imply a real fra tal stru ture of the\nwalls, although a fra tal stru ture would give non-integer dimensions.\n[28℄ Y. Ishibashi and Y. Takagi, J. Phys. So . Jpn. 31, 506-512 (1971).\n[29℄ J. F. S ott et al. J. Appl. Phys. 64, 787-792 (1988).\n[30℄ W. Kleemann, J. De , S. A. Prosandeev, T. Braun, and P. A. Thomas,Ferroele tri s 334, 3\n(2006).\n[31℄ J. F. S ott, J. Phys. Condens. Mat. 18, 7123 (2006).\n[32℄ J. F. S ott, Ferroele tri s 349, 157 (2007).\n[33℄ H. Yu and C. A. Randall, J. Appl. Phys. 86, 5733 (1999).\n[34℄ T. Ozaki, T. Senju, E. Nakamura, J. Phys. So . Japan 62, 3027 (1993); T. Ozaki and J.\nOhgami, J . Phys. Condens. Matter 7,1711-1720 (1995).\n[35℄ Shini hi Katayama, Yuji Nogu hi and Masaru Miyayama, Advan ed Materials (in press).\n[36℄ N. A. Pertsev and A. G. Zembilgotov, J. Appl. Phys. 78, 6170-6180 (1995).\n\n10\n\n\f"}