{"id": "http://arxiv.org/abs/1012.0495v1", "guidislink": true, "updated": "2010-12-02T16:56:19Z", "updated_parsed": [2010, 12, 2, 16, 56, 19, 3, 336, 0], "published": "2010-12-02T16:56:19Z", "published_parsed": [2010, 12, 2, 16, 56, 19, 3, 336, 0], "title": "Do we Need to Solve the Exozodi Question? If Yes, How to Best Solve It?", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1012.1042%2C1012.0444%2C1012.5711%2C1012.2385%2C1012.3687%2C1012.5917%2C1012.2038%2C1012.6019%2C1012.2308%2C1012.3554%2C1012.0533%2C1012.3911%2C1012.2972%2C1012.5769%2C1012.0768%2C1012.3428%2C1012.3330%2C1012.4021%2C1012.1788%2C1012.0019%2C1012.4107%2C1012.3297%2C1012.0495%2C1012.4681%2C1012.1526%2C1012.1925%2C1012.4166%2C1012.2470%2C1012.3814%2C1012.3357%2C1012.0878%2C1012.4120%2C1012.4892%2C1012.1801%2C1012.0130%2C1012.2584%2C1012.0268%2C1012.4984%2C1012.3024%2C1012.5363%2C1012.4263%2C1012.4226%2C1012.1152%2C1012.2960%2C1012.0400%2C1012.0238%2C1012.0763%2C1012.3435%2C1012.2903%2C1012.3959%2C1012.3294%2C1012.3985%2C1012.4806%2C1012.2150%2C1012.1442%2C1012.2073%2C1012.4206%2C1012.5459%2C1012.0468%2C1012.2248%2C1012.2984%2C1012.0335%2C1012.3942%2C1012.2811%2C1012.1294%2C1012.4651%2C1012.1142%2C1012.2612%2C1012.1265%2C1012.4036%2C1012.3559%2C1012.5768%2C1012.5406%2C1012.4849%2C1012.3975%2C1012.4568%2C1012.1445%2C1012.3303%2C1012.5619%2C1012.3350%2C1012.1804%2C1012.0029%2C1012.3582%2C1012.0218%2C1012.0711%2C1012.0416%2C1012.1186%2C1012.4341%2C1012.0381%2C1012.4985%2C1012.0677%2C1012.5867%2C1012.3808%2C1012.2359%2C1012.1957%2C1012.4572%2C1012.0583%2C1012.0302%2C1012.2450%2C1012.5505%2C1012.3098&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Do we Need to Solve the Exozodi Question? If Yes, How to Best Solve It?"}, "summary": "When observing an extrasolar planetary system, the most luminous component\nafter the star itself is generally the light scattered and/or thermally emitted\nby a population of micron-sized dust grains. These grains are expected to be\ncontinuously replenished by the collisions and evaporation of larger bodies\njust as in our solar zodiacal cloud. Exozodiacal clouds (\"exozodis\") must\ntherefore be seriously taken into account when attempting to directly image\nfaint Earth-like planets (exoEarths, for short). This paper summarizes the oral\ncontributions and discussions that took place during the Satellite Meeting on\nexozodiacal dust disks, in an attempt to address the following two questions:\nDo we need to solve the exozodi question? If yes, how to best solve it?", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1012.1042%2C1012.0444%2C1012.5711%2C1012.2385%2C1012.3687%2C1012.5917%2C1012.2038%2C1012.6019%2C1012.2308%2C1012.3554%2C1012.0533%2C1012.3911%2C1012.2972%2C1012.5769%2C1012.0768%2C1012.3428%2C1012.3330%2C1012.4021%2C1012.1788%2C1012.0019%2C1012.4107%2C1012.3297%2C1012.0495%2C1012.4681%2C1012.1526%2C1012.1925%2C1012.4166%2C1012.2470%2C1012.3814%2C1012.3357%2C1012.0878%2C1012.4120%2C1012.4892%2C1012.1801%2C1012.0130%2C1012.2584%2C1012.0268%2C1012.4984%2C1012.3024%2C1012.5363%2C1012.4263%2C1012.4226%2C1012.1152%2C1012.2960%2C1012.0400%2C1012.0238%2C1012.0763%2C1012.3435%2C1012.2903%2C1012.3959%2C1012.3294%2C1012.3985%2C1012.4806%2C1012.2150%2C1012.1442%2C1012.2073%2C1012.4206%2C1012.5459%2C1012.0468%2C1012.2248%2C1012.2984%2C1012.0335%2C1012.3942%2C1012.2811%2C1012.1294%2C1012.4651%2C1012.1142%2C1012.2612%2C1012.1265%2C1012.4036%2C1012.3559%2C1012.5768%2C1012.5406%2C1012.4849%2C1012.3975%2C1012.4568%2C1012.1445%2C1012.3303%2C1012.5619%2C1012.3350%2C1012.1804%2C1012.0029%2C1012.3582%2C1012.0218%2C1012.0711%2C1012.0416%2C1012.1186%2C1012.4341%2C1012.0381%2C1012.4985%2C1012.0677%2C1012.5867%2C1012.3808%2C1012.2359%2C1012.1957%2C1012.4572%2C1012.0583%2C1012.0302%2C1012.2450%2C1012.5505%2C1012.3098&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "When observing an extrasolar planetary system, the most luminous component\nafter the star itself is generally the light scattered and/or thermally emitted\nby a population of micron-sized dust grains. These grains are expected to be\ncontinuously replenished by the collisions and evaporation of larger bodies\njust as in our solar zodiacal cloud. Exozodiacal clouds (\"exozodis\") must\ntherefore be seriously taken into account when attempting to directly image\nfaint Earth-like planets (exoEarths, for short). This paper summarizes the oral\ncontributions and discussions that took place during the Satellite Meeting on\nexozodiacal dust disks, in an attempt to address the following two questions:\nDo we need to solve the exozodi question? If yes, how to best solve it?"}, "authors": ["O. Absil", "C. Eiroa", "J. -C. Augereau", "C. A. Beichman", "W. C. Danchi", "D. Defrère", "M. Fridlund", "A. Roberge"], "author_detail": {"name": "A. Roberge"}, "author": "A. Roberge", "arxiv_comment": "\"Pathways Towards Habitable Planets\", proceedings of a workshop held\n  14 to 18 September 2009 in Barcelona, Spain", "links": [{"href": "http://arxiv.org/abs/1012.0495v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1012.0495v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "astro-ph.SR", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph.SR", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "astro-ph.EP", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1012.0495v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1012.0495v1", "journal_reference": "ASP Conf Series, vol 430, 2010, p. 293", "doi": null, "fulltext": "**FULL TITLE**\nASP Conference Series, Vol. **VOLUME**, **YEAR OF PUBLICATION**\n**NAMES OF EDITORS**\n\nPanel Meeting on Exozodiacal Dust Disks\n\narXiv:1012.0495v1 [astro-ph.SR] 2 Dec 2010\n\nO. Absil,1 C. Eiroa,2 J.-C. Augereau,3 C. A. Beichman,4 W. C. Danchi,5\nD. Defrère,1 C. V. M. Fridlund,6 and A. Roberge5\nAbstract.\nWhen observing an extrasolar planetary system, the most luminous component after the star itself is generally the light scattered and/or\nthermally emitted by a population of micron-sized dust grains. These grains\nare expected to be continuously replenished by the collisions and evaporation of\nlarger bodies just as in our solar zodiacal cloud. Exozodiacal clouds (\"exozodis\")\nmust therefore be seriously taken into account when attempting to directly image faint Earth-like planets (exoEarths, for short). This paper summarizes the\noral contributions and discussions that took place during the Satellite Meeting\non exozodiacal dust disks, in an attempt to address the following two questions:\nDo we need to solve the exozodi question? If yes, how to best solve it?\n\n1.\n\nImpact of Exozodis on ExoEarth Imaging with Optical Telescopes\n\nThe most obvious effect of exozodiacal dust on optical wavelength direct observations of Earth-like planets is to increase exposure times. Light scattered off\nthe local zodiacal dust and the exozodiacal dust around nearby stars will be\nmixed with the planet signal in both images and spectra. The larger the final\nPSF, the more background will be mixed in. This background will likely be the\nlargest source of noise, if the stellar light is canceled by 10−10 at the planet pixel.\nIn the background limited case, the exposure time to image a planet is linearly proportional to the exozodi surface brightness. Obviously, if the exozodi\nis too bright, the integration time to get the required planet SNR becomes prohibitively long. How do various optical mission concepts perform under varying\nlevels of exozodi? Using publicly available information, it is very hard to come\nup with estimates that can be reasonably compared. In addition, most groups\nassume a fixed exozodi level for calculating their mission performance, typically\none zodi, which is not tremendously informative. There is a strong need for\nuniform mission performance analysis that pushes to high exozodi levels.\nThat being said, Fig. 1 illustrates the decline in mission performance with\nincreasing exozodi brightness for an optical mission. These preliminary calcula1\n\nDept. AGO, Université de Liège, 17 Allée du Six Août, B-4000 Sart Tilman, Belgium\n\n2\n\nDepartamento de Fı́sica Teórica, C-XI, Universidad Autónoma de Madrid, 28049 Madrid, Spain\n\n3\n\nLAOG–UMR 5571, CNRS and Université Joseph Fourier, BP 53, F-38041 Grenoble, France\n\n4\n\nNExScI, California Institute of Technology, 770 S Wilson Ave, Pasadena, CA 91125, USA\n\n5\n\nExoplanets and Stellar Astrophysics Laboratory, NASA-GSFC, Greenbelt, MD 20771, USA\n\n6\n\nESA-ESTEC, PO Box 299, Keplerlaan 1 NL, 2200AG Noordwijk, The Netherlands\n\n1\n\n\f2\n\nAbsil et al.\n\nTotal Habitable Zones\n\n17.4 Earths\n\n60\n\nTotal\nstars: 134\n\nAt each exozodi level, total mission time ~ 5.0 years\nand total integration time ~ 1.5 years.\nηEarth = 0.25\n\n114\n\n40\n\n94\n84 78\n6.7 Earths\n71 67\n65 62\n60 58 56\n54 53 52 51 50\n49 49 48 47 46 45 45\n44 43\n\n20\n0\n0\n\n20\n40\n60\nExozodi Brightness (one zodi brightness)\n\n80\n\n100\n\nFigure 1. Total habitable zones searched vs. exozodi surface brightness.\nEach grey bar represents a possible observing program, assuming η⊕ = 0.25\nand the parameters of the New Worlds Observer mission concept (for details,\nsee Turnbull et al. 2010). The numbers superimposed on some of the grey\nbars are the total numbers of stars observed in the programs. The y-axis\nis the total habitable zones searched, which is the sum of the completeness\nvalues for all the individual stars observed. A star's completeness value is\nthe probability that a habitable zone planet would be detected in a single\nvisit, given the possible range of system inclinations and planet eccentricities.\nThe expected number of exoEarths characterized is the total habitable zones\nsearched times η⊕ . To generate a program for each exozodi level, stars were\nchosen in order of decreasing weighting factor (completeness / exposure time)\nuntil the total on-target integration time reached 1.5 years or the total mission\ntime reached 5 years, whichever came sooner. The total integration times were\ncalculated assuming that for η⊕ × 100 = 25% of the targets, a spectrum with\nS/N ≥ 10 and R = 100 was obtained in addition to the imaging observation.\nTotal mission times include 11 days per target for moving the occulter.\n\ntions were done assuming the parameters of the New Worlds Observer mission\nconcept (4-m telescope, broad-band imaging channel covering 500 to 700 nm),\nbut the general behavior should be similar for other optical wavelength missions using either external occulters or internal coronagraphs. However, it is\nimportant to note that these calculations include only statistical errors due to\nlocal zodiacal background, exozodiacal background, and unsuppressed starlight.\nPossible systematic errors associated with modeling light scattered off a nonuniform exozodiacal dust distribution and removing it from a planet image have\nnot been thoroughly characterized for optical missions. Furthermore, confusion\nbetween planets and exozodiacal dust structures like resonant clumps remains\npoorly studied, although initial attempts to evaluate its impact on mission performance appear in Savransky et al. (2009) and Turnbull et al. (2010).\n2.\n\nImpact of Exozodis on ExoEarth Imaging with IR Interferometry\n\nThe mid-infrared wavelength range presents several advantages for Earth-like\nplanet characterization. In addition to including spectral bands of water, carbon dioxide and ozone, the contrast between a star and an exoEarth is only\n∼ 107 whereas it is ∼ 1010 in the visible. However, resolving the habitable zone\n\n\fPanel Meeting on Exozodis\n\n3\n\nFigure 2. Left: Simulated image of the thermal flux produced by a 10-zodi\nface-on exozodiacal dust cloud in the 6-20 μm range. The simulation includes\nthe presence of an Earth-mass planet located at 1 AU on the x-axis, and\nassumes a Dohnanyi size distribution for the dust grains (Stark & Kuchner\n2008). Right: Corresponding dirty map computed for an Emma X-array\nnulling interferometer, obtained by cross-correlating the measured signal with\ntemplates for the expected signal from a point source at each location on the\nsky plane (Defrère et al. 2010).\n\naround nearby stars in the mid-infrared would require a gigantic telescope with a\ndiameter up to 100 m. Space-based interferometry is therefore considered as the\nmost promising technique to achieve this goal. A large effort has been carried\nout during the past decade to define a design that provides excellent scientific\nperformance while minimizing cost and technical risk. This has resulted in a\nconvergence and consensus on a single mission architecture consisting of a noncoplanar X-array, called Emma (see e.g. Cockell et al. 2009), using four collector\nspacecraft and a single beam combiner spacecraft. Such a design enables the\nimplementation of phase chopping, a technique which suppresses from the final\noutput all sources having point-symmetric brightness distributions.\nThe impact of exozodis on the mission performance is twofold: on one hand,\ntheir point-symmetric component contributes to the overall shot noise and can\ntherefore drive the required integration time to detect exoEarths, while on the\nother hand, asymmetric structures in exozodis (such as resonant clumps) are\nnot suppressed by phase chopping and thereby contribute as possible biases (or\nfalse positives), which could prevent the detection of small planets.\nConsidering the Emma X-Array design with four 2-m apertures, pointsymmetric exozodis of about 100 zodis can be tolerated while preserving 75% of\nthe mission outcome, i.e., surveying the habitable zone of at least 150 targets\nwith > 90% completeness during the 2-yr search program. However, when including the resonant structures created by an exoEarth orbiting at 1 AU around\na Sun-like star (see left part of Fig. 2), the asymmetry created by the hole in\nthe dust distribution near the planet significantly contributes to the final detected signal (see dirty map in the right part of Fig. 2) and can thereby prevent\nfrom detecting the planet itself. The tolerable dust density then goes down to\nabout 15 times the solar zodiacal dust density. This upper limit on the tolerable\nexozodiacal dust density gives an estimation of the typical sensitivity that precursor instruments will need to reach on exozodiacal disks in order to prepare\nthe scientific program of future exoEarth characterization missions.\n\n\f4\n3.\n\nAbsil et al.\nCurrent Exozodiacal Disk Detection Efforts\n\nTwo main techniques are been used to evaluate the amount of exozodiacal dust\naround main sequence stars. Infrared spectro-photometry can reveal the presence of an excess emission on top of the expected stellar photospheric flux. This\nrequires high-accuracy photometry in the mid-infrared regime, which is generally\ndone from space, e.g., using the various instruments on board the Spitzer Space\nTelescope. The intrinsic accuracy of Spitzer photometry limits the sensitivity\nto exozodiacal disks about 1000 times more luminous than the solar zodiacal\ncloud (assuming the same brightness distribution, see e.g. Bryden et al. 2006).\nNote that, even with an infinite accuracy on the photometry, this technique\nwould still be limited to an accuracy of about 1% by the capability to predict\nthe mid-infrared stellar photospheric flux.\nThe second way to detect exozodiacal disks overcomes this limitation by\nangularly separating the signal of the star from its surrounding dust disk. The\nrequested angular resolution can generally be achieved only with infrared interferometry. Two types of interferometers are contributing to exozodi surveys: high-accuracy near-infrared interferometers such as CHARA/FLUOR and\nVLTI/VINCI (see e.g. Absil et al. 2006, 2009), and mid-infrared nulling interferometers such as MMT/BLINC and the Keck Interferometer Nuller (see e.g.\nLiu et al. 2009; Colavita et al. 2009). Both types of instruments reach a typical accuracy of 10−3 on the disk/star contrast, which corresponds to roughly\n1000 zodis in the K band and 300 zodis in the N band. These observations\nare however still restricted to a small amount of targets, due either to limited\nobserving time or to the limiting magnitude of the instrument. A new generation of nulling interferometers, such as the LBTI or the ALADDIN project on\nthe ground, or FKSI in space, could significantly improve the current sensitivity\nto exozodiacal disks, pushing the detection limit down to ∼ 30 zodi from the\nground or ∼ 1 zodi from space (see other paper by Absil et al. in this volume).\n\n4.\n\nCurrent Exozodiacal Disk Modeling Efforts\n\nThe current exozodi modeling efforts follow two main paths. On the one hand,\nradiative transfer codes for optically thin disks are being employed to reproduce\nthe scarce exozodi measurements, in particular near- and mid-infrared interferometric data (see e.g. Fig. 3), and show that the solar system zodiacal spectrum\ndoes not match the spectral energy distributions (SEDs) of detected exozodiacal\ndisks. The fit to the 2.2 μm excesses with the solar system zodiacal model indeed\nindicates densities a few thousand times larger than the zodiacal density (e.g.,\nabout 3000 zodis for Vega and 5000 zodis for Fomalhaut), but this model predicts much too large flux (by about an order of magnitude) in the mid-infrared\ncompared to the observations. Dust much closer to the star (down to the sublimation radius at a fraction of an AU), and with a sufficient amount of refractory\nmaterial, are required to shift the spectrum to shorter wavelengths and match\nthe current data sets. Spectral decomposition techniques are also being developed to reproduce extreme Spitzer/IRS spectra showing unusually large amount\nof warm dust and clear spectral solid-state features (e.g. Lisse et al. 2009).\n\n\fPanel Meeting on Exozodis\n\n5\n\nFigure 3. A possible fit to the photometric excesses (represented with diamonds) and interferometric observations (filled circle at 2.2 μm) of the τ Ceti\nexozodi (from Di Folco et al. 2007). Dashed line: thermal emission from the\nbest-fit disk model. Solid line: includes the scattered light contribution. Dotted line: approximative blackbody fit to the long-wavelength excesses produced by a Kuiper-like belt. Dashed-dotted line: total emission from the\nstar-disk system.\n\nOn the other hand, dynamical models employing classical N-body codes\nare being used to assess the influence of planets on the shape of exozodiacal\ndisks and discuss the dust production mechanisms. Some models for instance\nsimulate the sculpting of an asteroid/dust belt by a planet due to their capture in mean motion resonances (e.g. Stark & Kuchner 2008). Larger scale\nmodels, involving the outward migration of a planet toward a Kuiper belt\nare currently being developed, basically relying on the assumption that exozodis are fed by the outer, much more massive disk regions, thereby linking\nthe inner and outer regions of planetary systems. This can either be due to\na sudden event, e.g., a Nice LHB-like model (Booth et al. 2009), or be more\nprogressive (Augereau et al., in prep.). The amount of dust produced can be\nassessed for individual systems following this methodology, but it is very sensitive to the assumed planetary system architecture. Finally, collisional models,\nusing statistical approaches, can evaluate the lifetime of asteroid belts due to\ncollisions (e.g. Krivov et al. 2006; Thébault & Augereau 2007). An ISSI working group has been assembled to further discuss the modeling of exozodis (see\nhttp://www.issibern.ch/teams/exodust/).\n5.\n\nConclusions and Recommendations\n\nThis short review illustrates how the final SNR for direct exoEarth detection\ndepends on the quantity of exozodiacal dust around main sequence stars. On\none hand, it drives the required integration time to detect the planetary signal\nas soon as its density reaches a few tens of zodis, and on the other hand, its potential asymmetries induce biases and false positives, which in turn demand the\nplanetary systems to be observed longer in order to extract the actual planetary\nsignal. If space missions had an unlimited lifetime, this wouldn't be a major\nissue, as one would just skip the inappropriate targets, or integrate longer to\n\n\f6\n\nAbsil et al.\n\neventually reveal their planets. However, space missions are limited in time, and\nthe exozodi issue could thus become a major hurdle in case bright exozodis are\ncommon. The sensitivity of current exozodi finders (∼ 300 zodis at best) is not\nappropriate to assess whether exozodis in the 10–100 zodi range are common or\nnot. A dedicated effort to solve this question is therefore mandatory.\nThree possible avenues have been identified to make sure that exoEarth\nimaging missions will be capable of reaching their goals:\n• Perform an exozodi survey with a sensitivity of ∼ 30 zodis on a statistically\nmeaningful sample of main sequence stars to constrain the distribution of\nexozodi brightness down to an appropriate level. Space missions can then\nbe designed (in terms of aperture size and mission lifetime) to cope with\nthe inferred mean exozodi level.\n• Measure the exozodi level with an accuracy of ∼ 10 zodis on all the candidate mission targets, once the targets have been identified (e.g., Sun-like\nstars hosting exoEarth(s), detected through high-precision astrometric or\nradial velocity surveys).\n• Use the fact that the statistical distribution of cold debris disks will soon\nbe known at a level similar to the density of the solar Kuiper belt thanks to\nHerschel. Extrapolating the statistics of cold debris disks towards that of\nwarm exozodis is however not straightforward based on theoretical models,\nand needs to be backed up by observational data anyway.\nThe Panel therefore recommends that significant efforts and support be\nput in next generation exozodi finders, starting with LBTI and continuing with\nmid-term ground-based, balloon-borne or space projects such as ALADDIN or\nFKSI. The Panel also underscores the importance of continued modeling efforts\nto better understand the origin and dynamics of second generation dust grains\naround main sequence stars.\nAcknowledgments. O.A. acknowledges the financial support from an F.R.S.FNRS postdoctoral fellowship, and from the Communauté Française de Belgique\n(ARC – Académie universitaire Wallonie-Europe).\nReferences\nAbsil, O., Di Folco, E., Mérand, A., et al. 2006, A&A, 452, 237\nAbsil, O., Mennesson, B., Le Bouquin, J.-B., et al. 2009, ApJ, 704, 150\nBooth, M., Wyatt, M. C., Morbidelli, A., Moro-Martin, A., & Levison, H. 2009, MNRAS, 399, 385\nBryden, G., Beichman, C. A., Trilling, D. E., et al. 2006, ApJ, 636, 1098\nCockell, C., Herbst, T., Léger, A., et al. 2009, Exp. Astron., 23, 435\nColavita, M. M., Serabyn, G., Millan-Gabet, R., et al. 2009, PASP, 121, 1120\nDefrère, D., Absil, O., den Hartog, R., Hanot, C., & Stark, C. 2010, A&A, 509, A9\nDi Folco, E., Absil, O., Augereau, J.-C., et al. 2007, A&A, 475, 243\nKrivov, A., Löhne, T., & Sremčević, M. 2006, A&A, 455, 509\nLisse, C. M., Chen, C. H., Wyatt, M. C., et al. 2009, ApJ, 701, 2019\nLiu, W., Hinz, P., Hoffman, W., et al. 2009, ApJ, 693, 1500\nSavransky, D., Kasdin, N. J., & Vanderbei, R. J. 2009, in Proc. SPIE, 7440, 15\nStark, C. C., & Kuchner, M. J. 2008, ApJ, 686, 637\n\n\fPanel Meeting on Exozodis\nThébault, P. & Augereau, J.-C. 2007, A&A, 472, 169\nTurnbull, M. C., Roberge, A., Cash, W. C., et al. 2010, in prep\n\n7\n\n\f"}