{"id": "http://arxiv.org/abs/1108.2087v1", "guidislink": true, "updated": "2011-08-10T03:06:42Z", "updated_parsed": [2011, 8, 10, 3, 6, 42, 2, 222, 0], "published": "2011-08-10T03:06:42Z", "published_parsed": [2011, 8, 10, 3, 6, 42, 2, 222, 0], "title": "Fabrication of Glass Micro-Cavities for Cavity QED Experiments", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1108.3195%2C1108.5205%2C1108.2337%2C1108.3324%2C1108.3815%2C1108.1820%2C1108.4979%2C1108.4708%2C1108.0296%2C1108.5103%2C1108.2646%2C1108.2632%2C1108.6038%2C1108.4380%2C1108.2774%2C1108.1646%2C1108.2844%2C1108.4930%2C1108.3069%2C1108.4107%2C1108.3051%2C1108.3092%2C1108.4044%2C1108.1077%2C1108.1445%2C1108.2662%2C1108.2920%2C1108.5708%2C1108.0964%2C1108.4500%2C1108.5063%2C1108.3550%2C1108.3325%2C1108.4497%2C1108.6195%2C1108.1620%2C1108.5561%2C1108.3721%2C1108.1140%2C1108.0064%2C1108.0067%2C1108.2363%2C1108.4995%2C1108.1622%2C1108.4002%2C1108.2290%2C1108.3759%2C1108.3106%2C1108.6149%2C1108.3684%2C1108.1881%2C1108.0713%2C1108.0491%2C1108.1951%2C1108.4106%2C1108.1130%2C1108.0997%2C1108.2789%2C1108.2765%2C1108.1678%2C1108.2041%2C1108.2423%2C1108.4249%2C1108.0651%2C1108.5243%2C1108.0994%2C1108.2985%2C1108.4473%2C1108.3794%2C1108.5482%2C1108.2087%2C1108.3868%2C1108.3809%2C1108.3972%2C1108.4541%2C1108.2243%2C1108.1862%2C1108.2755%2C1108.0727%2C1108.0584%2C1108.0043%2C1108.1889%2C1108.1323%2C1108.0613%2C1108.0083%2C1108.2725%2C1108.3365%2C1108.5489%2C1108.1225%2C1108.0500%2C1108.0079%2C1108.6050%2C1108.2241%2C1108.4169%2C1108.5076%2C1108.1356%2C1108.5573%2C1108.3499%2C1108.2582%2C1108.2850%2C1108.4318&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Fabrication of Glass Micro-Cavities for Cavity QED Experiments"}, "summary": "We report a process for fabricating high quality, defect-free spherical\nmirror templates suitable for developing high finesse optical Fabry-Perot\nresonators. The process utilizes the controlled reflow of borosilicate glass\nand differential pressure to produce mirrors with 0.3 nanometer surface\nroughness. The dimensions of the mirrors are in the 0.5-5mm range making them\nsuitable candidates for integration with on-chip neutral atom and ion\nexperiments where enhanced interaction between atoms and photons are required.\nMoreover the mirror curvature, dimension and placement is readily controlled\nand the process can easily provide an array of such mirrors. We show that\ncavities constructed with these mirror templates are well suited to quantum\ninformation applications such as single photon sources and atom-photon\nentanglement.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1108.3195%2C1108.5205%2C1108.2337%2C1108.3324%2C1108.3815%2C1108.1820%2C1108.4979%2C1108.4708%2C1108.0296%2C1108.5103%2C1108.2646%2C1108.2632%2C1108.6038%2C1108.4380%2C1108.2774%2C1108.1646%2C1108.2844%2C1108.4930%2C1108.3069%2C1108.4107%2C1108.3051%2C1108.3092%2C1108.4044%2C1108.1077%2C1108.1445%2C1108.2662%2C1108.2920%2C1108.5708%2C1108.0964%2C1108.4500%2C1108.5063%2C1108.3550%2C1108.3325%2C1108.4497%2C1108.6195%2C1108.1620%2C1108.5561%2C1108.3721%2C1108.1140%2C1108.0064%2C1108.0067%2C1108.2363%2C1108.4995%2C1108.1622%2C1108.4002%2C1108.2290%2C1108.3759%2C1108.3106%2C1108.6149%2C1108.3684%2C1108.1881%2C1108.0713%2C1108.0491%2C1108.1951%2C1108.4106%2C1108.1130%2C1108.0997%2C1108.2789%2C1108.2765%2C1108.1678%2C1108.2041%2C1108.2423%2C1108.4249%2C1108.0651%2C1108.5243%2C1108.0994%2C1108.2985%2C1108.4473%2C1108.3794%2C1108.5482%2C1108.2087%2C1108.3868%2C1108.3809%2C1108.3972%2C1108.4541%2C1108.2243%2C1108.1862%2C1108.2755%2C1108.0727%2C1108.0584%2C1108.0043%2C1108.1889%2C1108.1323%2C1108.0613%2C1108.0083%2C1108.2725%2C1108.3365%2C1108.5489%2C1108.1225%2C1108.0500%2C1108.0079%2C1108.6050%2C1108.2241%2C1108.4169%2C1108.5076%2C1108.1356%2C1108.5573%2C1108.3499%2C1108.2582%2C1108.2850%2C1108.4318&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We report a process for fabricating high quality, defect-free spherical\nmirror templates suitable for developing high finesse optical Fabry-Perot\nresonators. The process utilizes the controlled reflow of borosilicate glass\nand differential pressure to produce mirrors with 0.3 nanometer surface\nroughness. The dimensions of the mirrors are in the 0.5-5mm range making them\nsuitable candidates for integration with on-chip neutral atom and ion\nexperiments where enhanced interaction between atoms and photons are required.\nMoreover the mirror curvature, dimension and placement is readily controlled\nand the process can easily provide an array of such mirrors. We show that\ncavities constructed with these mirror templates are well suited to quantum\ninformation applications such as single photon sources and atom-photon\nentanglement."}, "authors": ["Arpan Roy", "Murray D. Barrett"], "author_detail": {"name": "Murray D. Barrett"}, "author": "Murray D. Barrett", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1063/1.3658391", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1108.2087v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1108.2087v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "3 pages", "arxiv_primary_category": {"term": "quant-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "quant-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "physics.optics", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1108.2087v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1108.2087v1", "journal_reference": null, "doi": "10.1063/1.3658391", "fulltext": "Fabrication of Glass Micro-Cavities for Cavity QED Experiments\nArpan Roy1 and Murray D. Barrett1, a)\nCentre for Quantum Technologies and Department of Physics, National University of Singapore, 3 Science Drive 2,\n117543 Singapore\n\narXiv:1108.2087v1 [quant-ph] 10 Aug 2011\n\nWe report a process for fabricating high quality, defect-free spherical mirror templates suitable for developing\nhigh finesse optical Fabry-Perot resonators. The process utilizes the controlled re-flow of borosilicate glass\nand differential pressure to produce mirrors with 0.3 nanometer surface roughness. The dimensions of the\nmirrors are in the 0.5 − 5 mm range making them suitable candidates for integration with on-chip neutral\natom and ion experiments where enhanced interaction between atoms and photons are required. Moreover the\nmirror curvature, dimension and placement is readily controlled and the process can easily provide an array\nof such mirrors. We show that cavities constructed with these mirror templates are well suited to quantum\ninformation applications such as single photon sources and atom-photon entanglement.\nHigh finesse optical cavities have been widely used\nto enhance the interaction between atoms and photons.\nMost of these experiments have been restricted to macroscopic Fabry-Perot cavities made from super polished,\nconcave mirrors with resulting cavity finesses in the order of a million1 . The potential applications of this\ntechnology has motivated research into other fabrication\nmethods to provide greater flexibility in experimental\ndesign. Notable examples of this are the use of fiber\nbased cavities2 , and silicon based processing3,4 . Both\nthese approaches have been motivated by the desire to incorporate the cavity technology with atom chips5–9 and\nion traps. The potential of these approaches has been\ndemonstrated2,5 with each having their own unique advantages and disadvantages. Silicon based processing relies on the sophisticated fabrication techniques that have\nbeen well developed by industry. Cavities based on this\napproach can have very small dimensions which leads to a\nsmall mode volume and a very high atom-cavity coupling\nfactor3,4 . However, the small dimensions make it difficult to combine these cavities with atomic physics experiments, particularly for ion traps where anomalous heating scales strongly with the atom-to-surface distance10 .\nFiber based cavities2 have been successfully integrated\nwith atom chips but integration with ion traps is still\nlikely to be problematic. Moreover mode coupling to the\ncavity is completely determined by the fiber geometry\nand cannot be easily controlled. This has limited experiments to atom detection where one is not concerned with\nthe mode in which the photon exits the cavity. Atomphoton entanglement and remote entanglement, which\nare of interest to quantum information processing, require the exiting photon to be in a well defined mode of\nthe electromagnetic field.\nHere we report a process for fabricating high quality\nspherical mirror templates using a controlled re-flow of\nborosilicate glass. Our process provides mirror curvatures in the 0.5−5 mm range. These dimensions are small\nenough to capitalize on the advantages of shrinking the\ndimensions of the cavity mirrors11,12 but large enough\n\na) Electronic\n\nmail: phybmd@nus.edu.sg\n\nto avoid problems associated with surface charging and\nsmall atom-surface distances10 . In addition, our process\nallows us to fabricate near hemispherical mirrors suitable\nfor enhanced light collection from a single ion13,14 or neutral atom15 , tight focussing of light to an atom16,17 and\nthe possible suppression of spontaneous emission in the\npresence of a spherical reflector.18 .\nFabrication methods using re-flowed borosilicate glass\nhave been used before to create mirrors for high finesse\ncavities19 but controlling the location and dimensions of\nthe mirrors was problematic and mirror curvatures were\ntypically < 200μm. Instead, we utilize a modification\nof a method used to micro-fabricate vapour cells20 . This\ntechnique used the expansion of trapped gas to blow glass\ninto a spherical shell. Here we use a trapped partial vacuum to deform the glass into the desired concave surface.\nBlind holes approximately 2 mm deep are first drilled\ninto a Macor substrate. Macor is used as it is easily\nmachinable and has similar mechanical and thermal expansion properties to borosilicate. The substrate is then\nplaced into a high temperature vacuum furnace with a\n100 μm thick coverslip placed loosely over the blind holes.\nThe furnace is sealed and evacuated to a pressure of\n300 mBar. The temperature is then ramped at the rate\nof 5 ◦ C/min to a final temperature of 800 ◦ C. At this\ntemperature the borosilicate glass softens and bonds to\nthe Macor, securing the blind holes with a vacuum tight\nseal. Air is then introduced into the furnace at a fixed\npressure, typically 700 mBar. Under these conditions,\nthe glass behaves like a visco-elastic membrane with a\ncircular boundary. The pressure difference and the surface tension together give rise to the spherical shape of\nthe mirror template and the deformation process can be\naccurately modeled in a similar way to the treatment of\nmicro-fabricated vapor cells.20 . Controlling the pressure\ndifference and the dimensions of the cylindrical holes allows us to deterministically tune the radius of curvature\nof the resulting mirror substrate.\nAn important part of the fabrication process is returning the furnace to room temperature. Borosilicate glass\nneeds to be cooled down slowly and uniformly, otherwise stresses form within its matrix leading to weakening\nand shattering at lower temperature. For this reason,\nthe temperature is reduced at 3 ◦ C/min from 800 ◦ C to\n\n\f2\n557 ◦ C which is the annealing point for borosilicate glass.\nAt the annealing point stresses in the glass matrix can\nslowly relax20 . For our samples, 30 mins at 557 ◦ C is sufficient to reduce the stresses and eliminate the possibility\nof shattering as the glass returns to room temperature.\nThe glass is further cooled at 2 ◦ C/min to 529 ◦ C which\nis the strain point of borosilicate D263 glass. Beyond the\nstrain point the temperature can be safely dropped to\nroom temperature at the maximum rate allowed by the\nfurnace. Throughout the cooling process, the pressure in\nthe furnace is maintained at 700 mBar.\nMirrors were fabricated having a range of radius of curvatures (0.5 mm − 5 mm) made on MACOR substrates\nwhere the hole diameter varied from 1 mm to 3 mm. The\nsurface profile was measured with an optical profiler that\nhad a field of view of approximately 100 μm. The resulting profile was first fitted to a circle and the residuals are\ngiven in Fig 1(a). The root-mean-square (rms) roughness\ncalculated from these residuals is about 0.6 nm. However this is dominated by a large variation with a spatial\nperiod of about 50 μm clearly visible in the data. We\nbelieve this to be an artifact of the optical profiler due to\nits presence in all test samples. As this spatial period is\nnot likely to impact on any practical application anyway,\nwe use a 6th order polynomial fit to better quantify the\nroughness and the residuals are given in Fig 1(b). The\nsurface roughness determined from these residuals are\ntypically 0.3 nm which is at the limits of the profiler sensitivity and comparable to best cavity mirror substrates\navailable today.22\nSurface roughness results in scattering losses which\nlimits the maximum possible reflectivity of the mirror21 .\nWhen the surface roughness is much smaller then the\nwavelength of light, the scattering losses, S, are given\nby21 :\n\" \u0012\n\u00132 # \u0012\n\u00132\n4πσ\n4πσ\nS = 1 − exp −\n≈\n,\n(1)\nλ\nλ\nwhere σ is the rms surface roughness and λ is the wavelength of interest. Using an operating wavelength of\nλ = 780 nm, appropriate for 87 Rb atoms, and our measured roughness of σ = 0.3 nm we infer that losses of\n25 ppm or less should be possible with these substrates.\nTo better assess the suitability of the substrates for\nhigh finesse cavities, samples were coated with a high reflective coating and test cavities constructed. A target\ntransmission of 100 ppm was chosen to ensure that scattering losses would not dominate the cavity losses resulting in negligible cavity transmission. Four half symmetric\ncavities were constructed consisting of a flat mirror and a\ncurved mirror with curvatures 0.7, 2, 5 and 100 mm. The\n100 mm curvature and flat mirrors were super-polished\nsubstrates available from the same company that provided the coating service22 and were coated in the same\ncoating run as the custom substrates. For each cavity we\ndetermine the cavity finesse, F, and the single atom cooperativity, η. The finesse is a figure of merit for comparing\n\nFIG. 1. Top (a) Surface roughness obtained after fitting\nthe surface profile to a circle. Below(b) Surface roughness\nobtained after fitting the surface profile to a 6th order polynomial fit.\n\nthe quality of different resonators and the single atom\ncooperativity quantifies the importance of cavity QED\neffects23 . The parameters are given by the expressions23\nF=\n\nc\n,\n2L∆νc\n\nη=\n\n24F\nπk 2 w2\n\n(2)\n\nwhere ∆νc is the linewidth of the cavity (FWHM), k =\n2π/λ and w is the waist of the cavity mode which can be\ndetermined from the cavity geometry24 . Thus, F and η\ncan be completely determined by the length of the cavity,\nthe curvature of the mirrors, and the linewidth of the\ncavity.\nThe linewidth of the cavity is measured by modulating\nthe laser with a broadband electro-optic modulator at a\nknown frequency. The resulting sidebands are then used\nto calibrate the frequency sweep as the laser is scanned\nacross the resonance. This provides a measurement of\nthe cavity linewidth to better than 1%.\nThe radius of curvature is determined by maximizing\nthe overlap of a focused beam with its reflection from\nthe curved surface. The output from a single mode fiber\nis collimated and then focussed by an aspheric lens to\na waist of about 2 μm. The curved mirror is then used\nto reflect the light back through the fiber. The power\nreflected back through the fiber is maximized when the\ncurvature of the laser wavefront and the mirror are equal.\nThis occurs at two points along the axis of a focused\nGaussian beam and it is p\neasily shown that these two\n2 /R2 where z is the\npoints are separated by R 1 − 4zR\nR\n24\nRayleigh length . This allows a measurement of R which\nis accurate to about 20 μm for the tight curvature mirrors. For the 100 mm curvature mirrors we simply use\nthe value specified by the manufacturer.\nThe length of the cavity is measured using a high power\noptical microscope. The calibrated focus adjustment allows us to measure the axial distance between the bottom\n\n\f3\nof the mirror and a reference point on the mirror holder.\nTogether with the holder dimensions we can then determine the length to an accuracy of about 25 μm.\nThe measurements are summarized in Table I. Since\nthe cavity finesse dropped sharply for the smaller curvature mirrors, we also measured their transmission directly. The expected finesse is then calculated assuming\nthat the transmission dominates the cavity losses. The\nexcellent agreement with the measured finesse and the\nvalues calculated from the measured transmission indicates that the finesse is completely dominated by the\nquality of the coatings and not the surface quality. The\ndrop in the coating performance for small curvature mirrors is most likely due to shadowing effects arising from\nthe large angular variation of the substrate surface and\nmay be avoidable in future by further optimizing the\ncoating run to specific curvatures25 . However we note\nthat, even with the degraded coating for tighter radius\nof curvature, the η values indicate that the cavities are\nstill suitable for cavity QED applications. We also note\nthat the 2 and 5 mm curvature mirrors result in cavities\nwhich satisfy the stronger condition of strong coupling23 .\nMoreover, since the cavity losses are dominated by transmission losses we can expect photons generated within\nthe cavity to appear at the output with very high probability.\nROC\n(mm)\n100\n5\n2\n0.7\n\nL\nT\nFinesse\nFinesse\n(mm) (ppm) (expected)\n(obtained)\n2.075 100 31400± 2000 32200 ± 550\n2.53 200 22000 ± 2000 19900 ± 340\n0.32 350 13870 ± 1200 14200 ± 1460\n0.25 1500\n3850 ± 70\n3820 ± 500\n\nη\n1\n3.8\n9.2\n5.4\n\nTABLE I. Summary of experimental cavities. Expected finesse is calculated based on the measured transmission,T.\nLength, L, and curvatures, RoC are measured as discussed\nin text.\n\nIn conclusion, we have successfully demonstrated the\nfabrication of spherical mirror substrates over a wide\nrange of dimensions and demonstrated their potential application as Fabry Perot resonators in cavity QED applications. The dimensions of the mirrors produced, bridge\nthe gap between existing commercially available mirrors\n\nand micro-mirrors based on silicon processing or fiber\nmachining. This provides greater flexibility for incorporating optical resonators and light collection optics with\nmicro-fabricated ion traps and atom chips.11,14\n\nACKNOWLEDGMENTS\n\nWe acknowledge technical assistance from Nick Lewty,\nAarthi Dhanapaul, Jovan Kwek, and Kyle Arnold. This\nresearch was supported by the National Research Foundation and the Ministry of Education of Singapore, as\nwell as by A-STAR under project No. SERC 052 123\n0088.\n1 M.\n\nKhudaverdyan et al., New Journal of Physics 10, 073023\n(2008).\n2 D. Hunger et al., New Journal of Physics 12, 065038 (2010).\n3 M. Trupke et al., Applied Physics Letters 87, 211106 (2005).\n4 G. Biedermann et al., Applied Physics Letters 97, 181110 (2010).\n5 M. Trupke et al., Physical review letters 99, 63601 (2007).\n6 Y. Colombe et al., Nature 450, 272 (2007).\n7 A. Haase, B. Hessmo, and J. Schmiedmayer, Optics letters 31,\n268 (2006).\n8 M. Wilzbach et al., Fortschritte der Physik 54, 746 (2006).\n9 P. Horak et al., Physical Review A 67, 043806 (2003).\n10 R. Epstein et al., Physical Review A 76, 033411 (2007).\n11 D. Leibrandt, Integrated chips and optical cavities for trapped\nion quantum information processing, Ph.D. thesis (2009).\n12 P. Herskind et al., .\n13 J. Merrill et al., Arxiv preprint arXiv:1105.4905 (2011).\n14 G. Shu, N. Kurz, M. Dietrich, and B. Blinov, Physical Review\nA 81, 042321 (2010).\n15 R. Noek et al., Optics letters 35, 2460 (2010).\n16 J. Goldwin and E. Hinds, Optics Express 16, 17808 (2008).\n17 M. Tey et al., Nature Physics 4, 924 (2008).\n18 G. Hétet, L. Slodička, A. Glätzle, M. Hennrich, and R. Blatt,\nPhysical Review A 82, 063812 (2010).\n19 G. Cui et al., Optics express 14, 2289 (2006).\n20 E. Eklund and A. Shkel, Microelectromechanical Systems, Journal of 16, 232 (2007).\n21 A. S. Petr Beckmann, The scattering of electromagnetic waves\nfrom rough surfaces (Artech House, 1987).\n22 Superpolished mirrors and mirror coatings were provided by Advanced Thin Films.\n23 H. Tanji-Suzuki et al., \"Interaction between atomic ensembles and optical resonators: Classical description,\" (2011),\narXiv:quant-ph/1104.3594v1.\n24 Siegman, Lasers (University Science Books, 1986).\n25 Scot Davidson, Advanced Thin Films, Private communication.\n\n\f"}