{"id": "http://arxiv.org/abs/1006.0242v1", "guidislink": true, "updated": "2010-06-01T20:19:13Z", "updated_parsed": [2010, 6, 1, 20, 19, 13, 1, 152, 0], "published": "2010-06-01T20:19:13Z", "published_parsed": [2010, 6, 1, 20, 19, 13, 1, 152, 0], "title": "High cooperativity coupling of electron-spin ensembles to\n  superconducting cavities", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1006.1021%2C1006.0693%2C1006.4022%2C1006.1644%2C1006.5610%2C1006.0966%2C1006.0758%2C1006.4874%2C1006.2295%2C1006.4606%2C1006.4381%2C1006.0516%2C1006.0444%2C1006.3928%2C1006.2926%2C1006.0995%2C1006.1546%2C1006.5189%2C1006.0056%2C1006.1116%2C1006.3360%2C1006.2694%2C1006.2835%2C1006.0511%2C1006.0399%2C1006.2248%2C1006.5022%2C1006.5154%2C1006.3957%2C1006.0947%2C1006.1093%2C1006.1002%2C1006.3177%2C1006.0189%2C1006.0466%2C1006.0470%2C1006.1201%2C1006.3982%2C1006.0028%2C1006.0242%2C1006.5597%2C1006.3426%2C1006.2487%2C1006.5092%2C1006.2210%2C1006.0697%2C1006.2992%2C1006.3295%2C1006.1406%2C1006.3551%2C1006.1844%2C1006.4981%2C1006.2122%2C1006.4934%2C1006.0025%2C1006.4316%2C1006.4549%2C1006.3222%2C1006.4164%2C1006.2015%2C1006.1257%2C1006.5259%2C1006.3243%2C1006.3495%2C1006.2779%2C1006.4798%2C1006.1579%2C1006.0847%2C1006.4494%2C1006.1262%2C1006.3081%2C1006.3826%2C1006.0823%2C1006.5048%2C1006.2474%2C1006.0862%2C1006.0280%2C1006.4758%2C1006.4617%2C1006.3149%2C1006.1084%2C1006.5184%2C1006.1924%2C1006.0490%2C1006.4816%2C1006.0724%2C1006.2567%2C1006.0467%2C1006.4087%2C1006.1849%2C1006.3381%2C1006.3988%2C1006.0320%2C1006.3783%2C1006.2587%2C1006.4002%2C1006.5508%2C1006.2354%2C1006.4587%2C1006.5498%2C1006.2880&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "High cooperativity coupling of electron-spin ensembles to\n  superconducting cavities"}, "summary": "Electron spins in solids are promising candidates for quantum memories for\nsuperconducting qubits because they can have long coherence times, large\ncollective couplings, and many quantum bits can be encoded into the spin-waves\nof a single ensemble. We demonstrate the coupling of electron spin ensembles to\na superconducting transmission-line resonator at coupling strengths greatly\nexceeding the cavity decay rate and comparable to spin linewidth. We also use\nthe enhanced coupling afforded by the small cross-section of the transmission\nline to perform broadband spectroscopy of ruby at millikelvin temperatures at\nlow powers. In addition, we observe hyperfine structure in diamond P1 centers\nand time domain saturation-relaxation of the spins.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1006.1021%2C1006.0693%2C1006.4022%2C1006.1644%2C1006.5610%2C1006.0966%2C1006.0758%2C1006.4874%2C1006.2295%2C1006.4606%2C1006.4381%2C1006.0516%2C1006.0444%2C1006.3928%2C1006.2926%2C1006.0995%2C1006.1546%2C1006.5189%2C1006.0056%2C1006.1116%2C1006.3360%2C1006.2694%2C1006.2835%2C1006.0511%2C1006.0399%2C1006.2248%2C1006.5022%2C1006.5154%2C1006.3957%2C1006.0947%2C1006.1093%2C1006.1002%2C1006.3177%2C1006.0189%2C1006.0466%2C1006.0470%2C1006.1201%2C1006.3982%2C1006.0028%2C1006.0242%2C1006.5597%2C1006.3426%2C1006.2487%2C1006.5092%2C1006.2210%2C1006.0697%2C1006.2992%2C1006.3295%2C1006.1406%2C1006.3551%2C1006.1844%2C1006.4981%2C1006.2122%2C1006.4934%2C1006.0025%2C1006.4316%2C1006.4549%2C1006.3222%2C1006.4164%2C1006.2015%2C1006.1257%2C1006.5259%2C1006.3243%2C1006.3495%2C1006.2779%2C1006.4798%2C1006.1579%2C1006.0847%2C1006.4494%2C1006.1262%2C1006.3081%2C1006.3826%2C1006.0823%2C1006.5048%2C1006.2474%2C1006.0862%2C1006.0280%2C1006.4758%2C1006.4617%2C1006.3149%2C1006.1084%2C1006.5184%2C1006.1924%2C1006.0490%2C1006.4816%2C1006.0724%2C1006.2567%2C1006.0467%2C1006.4087%2C1006.1849%2C1006.3381%2C1006.3988%2C1006.0320%2C1006.3783%2C1006.2587%2C1006.4002%2C1006.5508%2C1006.2354%2C1006.4587%2C1006.5498%2C1006.2880&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Electron spins in solids are promising candidates for quantum memories for\nsuperconducting qubits because they can have long coherence times, large\ncollective couplings, and many quantum bits can be encoded into the spin-waves\nof a single ensemble. We demonstrate the coupling of electron spin ensembles to\na superconducting transmission-line resonator at coupling strengths greatly\nexceeding the cavity decay rate and comparable to spin linewidth. We also use\nthe enhanced coupling afforded by the small cross-section of the transmission\nline to perform broadband spectroscopy of ruby at millikelvin temperatures at\nlow powers. In addition, we observe hyperfine structure in diamond P1 centers\nand time domain saturation-relaxation of the spins."}, "authors": ["D. I. Schuster", "A. P. Sears", "E. Ginossar", "L. DiCarlo", "L. Frunzio", "J. J. L. Morton", "H. Wu", "G. A. D. Briggs", "R. J. Schoelkopf"], "author_detail": {"name": "R. J. Schoelkopf"}, "author": "R. J. Schoelkopf", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevLett.105.140501", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1006.0242v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1006.0242v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "4pgs, 4 figures", "arxiv_primary_category": {"term": "cond-mat.mes-hall", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.mes-hall", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "cond-mat.supr-con", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "quant-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1006.0242v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1006.0242v1", "journal_reference": null, "doi": "10.1103/PhysRevLett.105.140501", "fulltext": "High cooperativity coupling of electron-spin ensembles to superconducting cavities\nD. I. Schuster∗ ,1 A. P. Sears∗ ,1 E. Ginossar,1 L. DiCarlo,1 L. Frunzio,1\nJ. J. L. Morton,2 H. Wu,2 G. A. D. Briggs,2 and R. J. Schoelkopf1\n\narXiv:1006.0242v1 [cond-mat.mes-hall] 1 Jun 2010\n\n2\n\n1\nDepartment of Applied Physics and Physics, Yale University\nDepartment of Materials, University of Oxford, Oxford OX1 3PH, United Kingdom\n(Dated: May 29, 2018)\n\nElectron spins in solids are promising candidates for quantum memories for superconducting\nqubits because they can have long coherence times, large collective couplings, and many quantum\nbits can be encoded into the spin-waves of a single ensemble. We demonstrate the coupling of electron spin ensembles to a superconducting transmission-line resonator at coupling strengths greatly\nexceeding the cavity decay rate and comparable to spin linewidth. We also use the enhanced coupling afforded by the small cross-section of the transmission line to perform broadband spectroscopy\nof ruby at millikelvin temperatures at low powers. In addition, we observe hyperfine structure in\ndiamond P1 centers and time domain saturation-relaxation of the spins.\n\nAn eventual quantum computer, like its classical analog, will make use of a variety of physical systems specialized for different tasks. Just as a classical computer uses\ncharge-based transistors for fast processing and magnetic\nhard drives for long term information storage, a quantum\ncomputer might use superconducting qubits for processing [1] and ensembles of electron spins as quantum memories [2, 3], linked by single microwave photons. Although\nother microscopic systems have been proposed for use in\na hybrid architecture [4–7], electron spins complement\nsuperconducting qubits particularly well. They feature\nsimilar transition frequencies, do not require trapping,\nand can be packed densely. Furthermore, a single ensemble could be used to store many qubits using holographic\nencoding techniques [3] demonstrated classically for nuclear [8] and electron [9] spins.\nIn this Letter, we demonstrate the first step toward realizing a solid-state quantum memory: coupling an electron spin ensemble to an on-chip superconducting cavity\nat powers corresponding to a single cavity photon. We\nobserve megahertz spin-photon interaction strengths in\nboth ruby Cr3+ spins and N substitution (P1) centers\nin diamond. A parallel effort by Kubo, et. al.[? ] sees\nsimilar coupling to nitrogen vacancy (NV) centers in diamond. In doing so we develop a platform for the study of\nelectron spin resonance (ESR) physics in picoliter mode\nvolumes, millikelvin temperatures, and attowatt powers.\nFinally, we perform time-resolved saturation/relaxation\nmeasurements of the P1 centers, a precursor to full pulsed\ncontrol of the system.\nESR studies the microwave response of electron spins\nat their resonant frequency in a magnetic field. Samples\nare conventionally placed inside a 3D high quality-factor\n(Q) cavity which enhances the sensitivity by confining\nphotons with the spins and extending the interaction\ntime [10]. In this work, several 1D cavities are capacitively coupled to a common feedline on a sapphire chip.\nWe place the spins within the mode volume by fabricating the device on doped sapphire (ruby - Fig. 1a), attaching a substrate on top of an existing device (diamond\n\n- Fig. 1b), or simply spin-coating the surface (DPPH not shown). The single spin-photon coupling is given by\ngs /2π = m0 (μ0 ω/2h̄Vc )1/2 , where m0 is the spin's magnetic dipole moment. The single spin coupling can be\nenhanced by using small mode volume cavities [11, 12].\nUsing a superconducting cavity allows use of extreme aspect ratios while maintaining high Q. In this case by\nusing a 1D (Vc ∼ d2 λ) rather than a 3D (Vc ∼ λ3 ) cavity,\nwe increase the coupling by the ratio of the wavelength to\nthe cavity width, λ/d ∼ 1000. Using an ensemble the effective collective coupling is gs,eff ≈ M 1/2 gs . Employing\na large number of spins M ∼ 1011−13 enables megahertz\ninteraction strengths. Because the resonators are made\nfrom superconducting thin films, they can maintain a\nhigh Q despite their extreme aspect ratio and ∼ 200 mT\napplied in-plane magnetic fields [13].\nTransmission through the ruby chip feedline is plotted\nin Fig. 1c from 10 to 14.5 GHz as a function of the inplane magnetic field. The most striking features are the\ntransitions of the spin-3/2 Cr3+ which are visible over a\nbroad frequency range.\nThey can be identified by diagonalizing the ruby\nHamiltonian [14]\n~ *S\n~ − D(Sz2 − 5 ),\nHr = −m0,r B\n4\n\n(1)\n\n~ is the spin-3/2\nwith m0,r /2π = 27.811 MHz/mT, S\noperator, ẑ is defined along the ĉ axis, and 2D/2π =\n11.46 GHz. In addition to the Zeeman term there is a\nlarge crystal field in ruby that separates the levels into\ntwo doublets (Sz = ±3/2 and Sz = ±1/2). The measured spectroscopic lines correspond to transitions between the doublets. When a magnetic field is applied at\nangle with respect to the ĉ axis the levels within each\ndoublet are hybridized giving the observed curvature in\nthe transitions. Because of the relatively high doping\n∼ 1019−20 cm−3 and because the spins efficiently fill the\nmode volume of the feedline, absorption at the transition\nfrequencies of the Cr3+ spins is visible even without the\naid of a cavity. From the 5% absorption dips we estimate\n\n\f2\n14.50\n\nb)\n\n6000\n\na)\n\n5000\n\n14.45\n\nelbow coupler\n\ndevice diamond\n\nc)\nCavity mode\n\nFrequency (GHz)\n\n14.30\n\n13\n\nBox modes\n\n1-4\n\n12\n\n2-4\n\n1-3\n11\n\nBox mode\n\n2-3\n10\n0\n\n20\n\n40\n\n60\n\n80\n\n100\n\n120\n\n140\n\nMagnetic Field (mT)\n\nFIG. 1. Cavity-spin devices and broadband spectroscopy of\nruby. a) Five λ/4 resonators with fundamental frequencies\nfrom 4 to 8 GHz coupled to a common feedline fabricated on\na ruby substrate. The coupling Q is determined by the length\nof the elbow coupler running parallel to the feedline. b) A\npiece of synthetic diamond glued on top of a similar device on\nan undoped c-plane sapphire substrate. c) The transmission\nspectrum of the ruby device when a magnetic field is applied\nparallel to the Nb thin film. The dashed curves indicate ruby\ntransitions. Fit uses only two parameters, the magnet current to field ratio and the angle between the magnetic field\nand crystal ĉ axis which is found to be 64.6◦ . To compensate\nfor frequency dependent attenuation in the microwave lines,\neach point is divided by the mean of all points with the same\nfrequency (row). The three broad horizontal lines are resonances with the copper sample holder, whereas the narrow\nline at ∼ 14.35 GHz is the second mode of the longest superconducting transmission line resonator. A higher resolution\nscan of the area within the red box is shown in Fig. 2a.\n\nthat there are approximately 1013 spins interacting with\nthe feedline.\nIn addition to the spectrum measured via the feedline, several magnetic field insensitive resonances are evident in Fig. 1c. The bottom three broad modes are\nresonances in the sample holder, while the narrow mode\nat 14.35 GHz is the superconducting transmission line\ncavity. Both the modes of the copper sample holder and\nthe superconducting cavities can be used to manipulate\nspins, but we focus on the on-chip cavities which are\nhigher Q and have typically been used in qubit experiments [1].\n\ncavity\n\n4000\n\n14.40\n14.35\n\n14\n\nb)\n\nQuality Factor, Q\n\nfeedline\n\nFrequency (GHz)\n\nresonator\n\na)\n\n3000\n2000\n\nfeedline\nspins\n40\n\n50\n\n1000\n60\n\n70\n\nMagnetic Field (mT)\n\n40\n\n50\n\n60\n\n70\n\nMagnetic Field (mT)\n\nFIG. 2. a) Transmission spectrum as a function of frequency\nand magnetic field near resonance with the second mode of\none of the superconducting cavities. The nearly vertical feature in the transmission spectrum at 60 mT is due to the\n1 ↔ 4 transition in the spins coupled to the feed line. An\navoided crossing with the superconducting cavity is visible\nindicating coupling to M = 4 × 1012 spins. The abrupt jumps\nin the cavity frequency are thought to be due to flux penetrating the superconducting film causing changes in the effective\ninductance of the cavity. b) Fit using Eq. 2, to the Q of the\ncavity, which is partially damped by the spins.\n\nIn a higher resolution scan (Fig. 2a) an avoided crossing is present where the 1 ↔ 4 transition approaches\nthe cavity at 14.35 GHz. Also visible are the interacting spins within the feedline which are unaffected by the\ncavity-spin coupling. The cavity line in Fig. 2a is repelled\nby more than its linewidth and on resonance it is damped\nprimarily by the spins. Because of flux jumps (due to a\nsmall component of the field perpendicular to the superconducting film), it is difficult to precisely fit frequency\nversus field. However, the Q of the cavity is relatively\nunaffected by these jumps, and can be used to extract\nthe same information.\nThe cavity Q is given by\nQ=\n\n∆2 + γ22\nωr ,\n+ κ (∆2 + γ22 )\n\n2\n2gs,eff\nγ2\n\n(2)\n\nwhere both the spins and the cavity are modeled as\nsingle-mode harmonic oscillators with detuning ∆, cavity frequency ωr /2π = 14.35 GHz, and spin frequency\ndegenerate at B=60 mT with the spin resonance tuning\nat rate meff /2π = 52.4 MHz/mT. The cavity linewidth\nκ/2π = ωr /2πQ = 1.3 MHz is independently measured\naway from resonance. The collective coupling strength\nand spin decoherence rate are determined from the fit to\nbe gs,eff /2π = 38 MHz and γ2 /2π = 96 MHz. The latter\nis probably primarily due to broadening by strong hyperfine interactions with 27 Al nuclear spins [15]. The coupling is much larger than the decoherence rates measured\nin both the cavity and typical superconducting qubits [1].\nA dimensionless measure of the coupling strength in cavity QED [? ] is the cooperativity C = g 2 /κγ2 ≈ 11.5.\nSince C > 1 the coupling is strong in the sense that\nat resonance nearly every photon entering the cavity is\ncoherently transferred into the spins. In order to make\n\n\f3\na)\n\n∆t = 1 s\n\na)\n\nb)\n\nPs ≈ 100 pW\n\n5000\n\n155\n\nMagnetic Field, B (mT)\n\n165 145\n\n155\n\n165\n\nMagnetic Field, B (mT)\n\nFIG. 3. Experimental (a) and analytically calculated (b)\ntransmission spectrum of cavity-diamond spin system. In\nboth plots, 5 spin resonances due to the anisotropic hyperfine splitting are observable (see text for details). The dashed\nlines in (b) refer to bias fields used in Fig. 4.\n\nretrieval possible a spin system with smaller linewidth is\nrequired.\nUsing the diamond sample we are able to observe\nhyperfine splittings and perform time-domain saturation/relaxation experiments. ESR active P1 centers [16]\nare visible via absorption spectroscopy (Fig. 3), but we\ndid not observe resonance with NV centers, which have\nbeen studied in a parallel publication [? ].\nThe observed splittings can be understood by considering the transitions of the Hamiltonian [16]\n~ *S\n~ + AS\n~ * I,\n~\nHd = −m0,d B\n\n(3)\n\nwhere m0,d /2π = 28.04 MHz/mT and the hyperfine coupling tensor A/2π = (81.33, 81.33, 114.03) MHz. Here,\n~\nthe ẑ direction corresponds to the diamond 111 axis, S\n~\nare the electron spin-1/2 operators, and I are the nuclear\nspin-1 operators. This describes a nitrogen atom with an\nextra, nearly-free electron, and a hyperfine spectrum due\nto the I = 1 nuclear spin of 14 N. This splits the line into\nthree: mI = −1, 0, 1. The outer two lines are further\nsplit by anisotropy in the hyperfine coupling depending\non which carbon the nitrogen substitutional's electron\nprefers. Selection rules suppress transitions which change\nmI , giving a total of five lines shown in Fig. 3b, and observed in Fig. 3a.\nThe model in Fig. 3b treats each of the twelve possible\ntransitions (three hyperfine transitions and anisotropies\ndue to the four bond angles) as an independent harmonic\noscillator with each oscillator uniformly coupled to the\ncavity. When aligned along one of the bond angles degeneracies reduce the spectrum to the five lines visible\nin Fig. 3. The effective coupling strengths used were 5\nMHz for the central peak, 3.5 MHz for the satellite peaks,\nalong with 30 MHz linewidths for each of the transitions.\nThe large linewidth is most likely due to additional paramagnetic impurities [17] or magnetic field inhomogeneity.\nAlthough this device was not designed to perform precise rotations on the spins, it is possible to saturate the\n\n1.00\n\nb)\n\n0.95\n\n4000\n\nS21\n\n4.412\n145\n\nPRF ≈ 100 fW\n\n0s\n\n6000\n4.416\n\nweak cont. meas.\n\nSat\n\n4.420\n\nQuality Factor, Q\n\nFrequency (GHz)\n\n4.424\n\n0.90\n0.85\n\n3000\n\n10 s\n\nc)\n9s\n2s\n0.5 s\n0s\n\n0.80\n\n2000\n\n4.420 4.425 4.430 4.435\nFrequency (GHz)\n\n1000\n0\n\n0\n\n2\n\n4\n\nTime (s)\n\n6\n\n8\n\nFIG. 4. Saturation/relaxation measurement of diamond. a)\nA saturating pulse (P ≈ 100 pW) is applied to the cavity, depolarizing the spins. The response of the resonator is probed\ncontinuously with a weak probe PRF ≈ 100 fW which does not\nsignificantly excite the spins. b) Measurement of resonator Q\nas a function of time immediately after a 1 second saturation\npulse. The two curves are measured at the locations of the\nmagnetic field indicated in Fig. 3b by the dashed lines where\nthe spins are on (red) and off (blue) resonance with the resonator. c) Measurements were taken at each frequency and\nthe reconstructed cavity resonance fit at each time slice to determine the Q as a function of time. Each curve corresponds\nto a different time indicated by an arrow in (b). The off resonance (blue) curves show almost no time response and lie on\ntop of each other.\n\nspins incoherently and observe their recovery in the timedomain. The data in Fig. 3a are measured at 100 fW\n∼ 100 photons in the cavity. Whereas at low powers the\ncavity is strongly damped by the spins, saturation begins at Ps = h̄ωγγ2 κ/2gs2 ∼ 10 pW ∼ 105 photons and\nby Ps ≈ 100 pW the cavity Q is restored to nearly its\nunloaded value. In Fig. 4 two experiments are shown\nat magnetic fields corresponding to the dashed lines in\nFig. 3b, where the spins are on (red) and off (blue) resonance with the cavity. This is done at several frequency\npoints near the cavity resonance, allowing us to observe\nthe evolution of the cavity lineshape with time after the\nsaturation pulse. In Fig. 4c one can see that immediately\nafter the saturation pulse the resonator has a high Q. As\nthe spins relax the resonator becomes strongly damped\nonce more on a timescale of seconds. A lifetime of ∼ 1 s\nis consistent with an estimate based on the saturation\npower and the linewidth measured in Fig. 3 [18]. However, it is difficult to extract the relaxation time quantitatively because the curve is not exponential. This could\nbe attributed to the presence of other ESR centers [19],\nheating of the host lattice via the spins, or some other\ntype of saturable impurity which is suspected to play a\n\n\f4\nrole in the decay of superconducting cavities [20]. There\nappears to be a small time dependence in the off resonance trace in Fig. 4b. This is also consistent with broadband saturable impurities [18, 20] and might point to a\ntechnique by which such impurities could be temporarily\nneutralized.\nFigures 1 - 4 show that these devices can be used as\nspectrometers of electron spin resonance. The sensitivity\nof an ideal ESR spectrometer is a complicated function of\nboth instrument and sample parameters, including ESR\nlinewidths, spin lifetimes (which are themselves temperature and magnetic field dependent). By substituting in\nfor the mode volume and saturation power the typical\nsensitivity formula in Weil [10] can be re-expressed in\nthe terms of cavity QED, highlighting the fundamental\nprocesses in detection:\nNmin\n\n6π\n=\ns(s + 1)\n\n\u0012\n\ngs2\nτ\nκ\n\n\u0013−1/2\n\n\u0012\nρs\n\n2γ2\nγ\n\n\u00131/2\n\nn1/2\na .\n\n(4)\n\nHere, s is the total spin, τ is the integration time,\nρs = tanh (h̄ω/kB Ts ) is the polarization of the spins at\ntemperature Ts , and na = kB TN /h̄ω is the effective number of noise photons added by the detector. In essence\nthe sensitivity is given by the number of spins required\nto give na scattered photons (at rate gs2 /κ) in one integration time. Thermal depolarization (ρs ), and inhomogenous broadening (2γ2 /γ) worsen sensitivity from the\ncase of ideal spins at zero temperature. Conventional\nESR instruments have Q = 10, 000, gs /2π ∼ 0.02 Hz\n(Vc = 10 μL), TN = 30000 K, typical saturation powers of Ps ∼ 100 mW, and operate from 300 K down to\n1 K [10]. These typically produce an Nmin of ∼ 109\n(polarized) spins. Our current devices have Q=5000,\ngs /2π ∼ 20 Hz (Vc = 10 nL), and TN ∼ 10 K, and function from 4 K down to 20 mK. The small mode volume\nof the 1D resonators also reduces the optimal Ps allowing\nthe study of samples at low temperatures where cooling\npower is limited. Under similar conditions these parameters predict a spin sensitivity of Nmin ∼ 104 , worsened\nto about Nmin ∼ 108 due to the inhomogenous broadening of the spins measured here. The sample contained\napproximately ∼ 1012 which were readily detected even\nwithout the use of standard ESR techniques such as field\nmodulation.\nThrough further development, future devices could\nhave Q = 100, 000, gs = 1 kHz (Vc = 1 pL using electron beam lithography), and na = 1/2 using a quantum\nlimited amplifier [21]. For these values gs /κ ∼ 100 photons/s, and it should be possible to detect Nmin ∼ 1\nusing a cavity and perhaps even strong coupling if superconducting qubits can be used to mediate the interactions [22, 23].\nTo move forward towards a quantum spin memory several improvements must be made. Most importantly a\nmore coherent electron spin candidate is required. In\n\naddition, because superconducting qubits might be adversely affected by magnetic fields, an ideal candidate\nwould have a ZFS such that at B = 0, h̄ω \u001d kB T , which\ncould come from crystal field splittings as with the ruby\nshown here, NV− centers, etc. Crystal field split spins\nhave the advantage that they can be tuned with small inplane magnetic fields allowing in-situ adjustment of the\nspin frequency and holographic encoding [3]. Other candidates such as spins with large hyperfine splittings [9]\nmight also be interesting as they can be insensitive to\nsmall magnetic field fluctuations. This comes at the expense of not being tunable with such fields. In addition,\nthey must have long coherence times, requiring control\nover line broadening due to dipolar couplings, nuclear\nspins, strain variations (for crystal field splittings) and\ninhomogeneous bias fields. New resonator designs could\nimprove the static and microwave magnetic field uniformities, allowing spin-echo techniques to be applied.\nWe have demonstrated coupling of large ensembles of\nelectron spins to both broadband coplanar waveguide\ntransmission lines and resonators. The coupling is sufficiently strong to exceed all qubit and cavity decay rates\nwith large cooperativity, but is still limited by the spin\nlinewidth. The system also shows promise as a general\nESR tool allowing good sensitivity in a broadband system, and exquisite sensitivity in a high Q cavity. The\nsmall mode-volume makes it ideally suited for studying picoliter scale samples, especially 2D systems such\nas graphene or semiconducting heterostructures. Further applications could include maser amplification and\nsingle-photon microwave to optical upconversion\n∗\nD.I.S and A.P.S contributed equally to this work. The\nauthors would like to acknowledge P. Doering at Apollo\nDiamond for providing the synthetic diamond sample, G.\nUlas for help performing room temperature ESR as well\nas discussions with S. Lyon, M. Reed, and G. Brudvig.\nWe acknowledge support for this work is from Yale University (D.I.S.) as well as CNR-Istituto di Cibernetica,\nPozzuoli, Italy (L.F.).\n\n[1] L. DiCarlo, J. M. Chow, J. M. Gambetta, L. S. Bishop,\nB. R. Johnson, D. I. Schuster, J. Majer, A. Blais, L. Frunzio, S. M. Girvin, and R. J. Schoelkopf, Nature, 460, 240\n(2009).\n[2] A. Imamoglu, Physical Review Letters, 102, 083602\n(2009).\n[3] J. H. Wesenberg, A. Ardavan, G. A. D. Briggs, J. J. L.\nMorton, R. J. Schoelkopf, D. I. Schuster, and K. Molmer,\nPhysical Review Letters, 103, 070502 (2009).\n[4] M. Wallquist, K. Hammerer, P. Rabl, M. Lukin, and\nP. Zoller, Physica Scripta, T137, 014001 (2009).\n[5] J. M. Taylor, C. M. Marcus, and M. D. Lukin, Physical\nReview Letters, 90, 206803 (2003).\n[6] J. Verdu, H. Zoubi, C. Koller, J. Majer, H. Ritsch, and\nJ. Schmiedmayer, Physical Review Letters, 103, 043603\n\n\f5\n(2009).\n[7] A. Andre, D. DeMille, J. M. Doyle, M. D. Lukin, S. E.\nMaxwell, P. Rabl, R. J. Schoelkopf, and P. Zoller, Nature\nPhysics, 2, 636 (2006).\n[8] A. G. Anderson, R. L. Garwin, E. L. Hahn, J. W. Horton,\nG. L. Tucker, and R. M. Walker, Journal of Applied\nPhysics, 26, 1324 (1955).\n[9] H. Wu, R. E. George, A. Ardavan, J. H. Wesenberg,\nK. Mlmer, D. I. Schuster, R. J. Schoelkopf, K. M. Itoh,\nJ. J. L. Morton, and G. A. D. Briggs, 0908.0101 (2009).\n[10] J. A. Weil and J. R. Bolton, Electron Paramagnetic Resonance: Elementary Theory And Practical Applications\n(Wiley, 2007) p. 548.\n[11] G. Boero, M. Bouterfas, C. Massin, F. Vincent, P. Besse,\nR. S. Popovic, and A. Schweiger, Review of Scientific\nInstruments, 74, 4794 (2003).\n[12] R. Narkowicz, D. Suter, and I. Niemeyer, Review of\nScientific Instruments, 79, 084702 (2008).\n[13] H. J. Mamin, R. Budakian, and D. Rugar, Review of\nScientific Instruments, 74, 2749 (2003).\n[14] J. Weber, Reviews of Modern Physics, 31, 681 (1959).\n[15] N. Laurance, E. C. McIrvine, and J. Lambe, Journal of\n\nPhysics and Chemistry of Solids, 23, 515 (1962).\n[16] J. H. N. Loubser and J. A. van Wyk, Reports on Progress\nin Physics, 41, 1201 (1978).\n[17] J. V. Wyk, E. Reynhardt, G. High, and I. Kiflawi, Journal of Physics D: Applied Physics, 30, 1790 (1997).\n[18] J. M. Martinis, K. B. Cooper, R. McDermott, M. Steffen,\nM. Ansmann, K. D. Osborn, K. Cicak, S. Oh, D. P. Pappas, R. W. Simmonds, and C. C. Yu, Physical Review\nLetters, 95, 210503 (2005).\n[19] E. C. Reynhardt, G. L. High, and J. A. van Wyk, The\nJournal of Chemical Physics, 109, 8471 (1998).\n[20] J. Gao, M. Daal, A. Vayonakis, S. Kumar, J. Zmuidzinas,\nB. Sadoulet, B. A. Mazin, P. K. Day, and H. G. Leduc,\nApplied Physics Letters, 92, 152505 (2008).\n[21] N. Bergeal, F. Schackert, M. Metcalfe, R. Vijay, V. E.\nManucharyan, L. Frunzio, D. E. Prober, R. J. Schoelkopf,\nS. M. Girvin, and M. H. Devoret, Nature, 465, 64 (2010).\n[22] J. Twamley and S. D. Barrett, 0912.3586 (2009).\n[23] D. Marcos, M. Wubs, J. M. Taylor, R. Aguado, M. D.\nLukin, and A. S. Sorensen, 1001.4048 (2010).\n\n\f"}