{"id": "http://arxiv.org/abs/1008.5331v2", "guidislink": true, "updated": "2010-09-10T13:39:33Z", "updated_parsed": [2010, 9, 10, 13, 39, 33, 4, 253, 0], "published": "2010-08-31T14:46:18Z", "published_parsed": [2010, 8, 31, 14, 46, 18, 1, 243, 0], "title": "Topological phase effects", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1008.3380%2C1008.0440%2C1008.0740%2C1008.1201%2C1008.2886%2C1008.2405%2C1008.1916%2C1008.2157%2C1008.4753%2C1008.0886%2C1008.2852%2C1008.4244%2C1008.2545%2C1008.3884%2C1008.2535%2C1008.4667%2C1008.3940%2C1008.1328%2C1008.3172%2C1008.0257%2C1008.3285%2C1008.3446%2C1008.4697%2C1008.4141%2C1008.2429%2C1008.2533%2C1008.3762%2C1008.1780%2C1008.4551%2C1008.4890%2C1008.3394%2C1008.2597%2C1008.0953%2C1008.4949%2C1008.3635%2C1008.4129%2C1008.1961%2C1008.4686%2C1008.0211%2C1008.2947%2C1008.0682%2C1008.4936%2C1008.4280%2C1008.3516%2C1008.5065%2C1008.5131%2C1008.4071%2C1008.5331%2C1008.0621%2C1008.4205%2C1008.1799%2C1008.3910%2C1008.2231%2C1008.5201%2C1008.5060%2C1008.3552%2C1008.5397%2C1008.3636%2C1008.3982%2C1008.1398%2C1008.0841%2C1008.2634%2C1008.4801%2C1008.3960%2C1008.4913%2C1008.1475%2C1008.4504%2C1008.4680%2C1008.3137%2C1008.4453%2C1008.3248%2C1008.2336%2C1008.2906%2C1008.3084%2C1008.5343%2C1008.5341%2C1008.0268%2C1008.4682%2C1008.2240%2C1008.2742%2C1008.4413%2C1008.1697%2C1008.4271%2C1008.3758%2C1008.4238%2C1008.4773%2C1008.0122%2C1008.1379%2C1008.4347%2C1008.2917%2C1008.4462%2C1008.4138%2C1008.3993%2C1008.1861%2C1008.4024%2C1008.0374%2C1008.4037%2C1008.1319%2C1008.0929%2C1008.4039%2C1008.2551&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Topological phase effects"}, "summary": "Quantum eigenstates undergoing cyclic changes acquire a phase factor of\ngeometric origin. This phase, known as the Berry phase, or the geometric phase,\nhas found applications in a wide range of disciplines throughout physics,\nincluding atomic and molecular physics, condensed matter physics, optics, and\nclassical dynamics. In this article, the basic theory of the geometric phase is\npresented along with a number of representative applications.\n  The article begins with an account of the geometric phase for cyclic\nadiabatic evolutions. An elementary derivation is given along with a worked\nexample for two-state systems. The implications of time-reversal are explained,\nas is the fundamental connection between the geometric phase and energy level\ndegeneracies. We also discuss methods of experimental observation. A brief\naccount is given of geometric magnetism; this is a Lorenz-like force of\ngeometric origin which appears in the dynamics of slow systems coupled to fast\nones.\n  A number of theoretical developments of the geometric phase are presented.\nThese include an informal discussion of fibre bundles, and generalizations of\nthe geometric phase to degenerate eigenstates (the nonabelian case) and to\nnonadiabatic evolution. There follows an account of applications.\nManifestations in classical physics include the Hannay angle and kinematic\ngeometric phases. Applications in optics concern polarization dynamics,\nincluding the theory and observation of Pancharatnam's phase. Applications in\nmolecular physics include the molecular Aharonov-Bohm effect and nuclear\nmagnetic resonance studies. In condensed matter physics, we discuss the role of\nthe geometric phase in the theory of the quantum Hall effect.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1008.3380%2C1008.0440%2C1008.0740%2C1008.1201%2C1008.2886%2C1008.2405%2C1008.1916%2C1008.2157%2C1008.4753%2C1008.0886%2C1008.2852%2C1008.4244%2C1008.2545%2C1008.3884%2C1008.2535%2C1008.4667%2C1008.3940%2C1008.1328%2C1008.3172%2C1008.0257%2C1008.3285%2C1008.3446%2C1008.4697%2C1008.4141%2C1008.2429%2C1008.2533%2C1008.3762%2C1008.1780%2C1008.4551%2C1008.4890%2C1008.3394%2C1008.2597%2C1008.0953%2C1008.4949%2C1008.3635%2C1008.4129%2C1008.1961%2C1008.4686%2C1008.0211%2C1008.2947%2C1008.0682%2C1008.4936%2C1008.4280%2C1008.3516%2C1008.5065%2C1008.5131%2C1008.4071%2C1008.5331%2C1008.0621%2C1008.4205%2C1008.1799%2C1008.3910%2C1008.2231%2C1008.5201%2C1008.5060%2C1008.3552%2C1008.5397%2C1008.3636%2C1008.3982%2C1008.1398%2C1008.0841%2C1008.2634%2C1008.4801%2C1008.3960%2C1008.4913%2C1008.1475%2C1008.4504%2C1008.4680%2C1008.3137%2C1008.4453%2C1008.3248%2C1008.2336%2C1008.2906%2C1008.3084%2C1008.5343%2C1008.5341%2C1008.0268%2C1008.4682%2C1008.2240%2C1008.2742%2C1008.4413%2C1008.1697%2C1008.4271%2C1008.3758%2C1008.4238%2C1008.4773%2C1008.0122%2C1008.1379%2C1008.4347%2C1008.2917%2C1008.4462%2C1008.4138%2C1008.3993%2C1008.1861%2C1008.4024%2C1008.0374%2C1008.4037%2C1008.1319%2C1008.0929%2C1008.4039%2C1008.2551&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Quantum eigenstates undergoing cyclic changes acquire a phase factor of\ngeometric origin. This phase, known as the Berry phase, or the geometric phase,\nhas found applications in a wide range of disciplines throughout physics,\nincluding atomic and molecular physics, condensed matter physics, optics, and\nclassical dynamics. In this article, the basic theory of the geometric phase is\npresented along with a number of representative applications.\n  The article begins with an account of the geometric phase for cyclic\nadiabatic evolutions. An elementary derivation is given along with a worked\nexample for two-state systems. The implications of time-reversal are explained,\nas is the fundamental connection between the geometric phase and energy level\ndegeneracies. We also discuss methods of experimental observation. A brief\naccount is given of geometric magnetism; this is a Lorenz-like force of\ngeometric origin which appears in the dynamics of slow systems coupled to fast\nones.\n  A number of theoretical developments of the geometric phase are presented.\nThese include an informal discussion of fibre bundles, and generalizations of\nthe geometric phase to degenerate eigenstates (the nonabelian case) and to\nnonadiabatic evolution. There follows an account of applications.\nManifestations in classical physics include the Hannay angle and kinematic\ngeometric phases. Applications in optics concern polarization dynamics,\nincluding the theory and observation of Pancharatnam's phase. Applications in\nmolecular physics include the molecular Aharonov-Bohm effect and nuclear\nmagnetic resonance studies. In condensed matter physics, we discuss the role of\nthe geometric phase in the theory of the quantum Hall effect."}, "authors": ["J. M. Robbins"], "author_detail": {"name": "J. M. Robbins"}, "author": "J. M. Robbins", "arxiv_comment": "Manuscript of an article published in the Encyclopedia of Applied\n  Physics in 1997, 59 pages", "links": [{"href": "http://arxiv.org/abs/1008.5331v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1008.5331v2", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "quant-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "quant-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1008.5331v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1008.5331v2", "journal_reference": "Encyclopedia of Applied Physics, Vol 21, 1997, Wiley-VCH", "doi": null, "fulltext": "arXiv:1008.5331v2 [quant-ph] 10 Sep 2010\n\n[Topological phase effects]\n[JM Robbins]\n1\n\n1\n\n\fTOPOLOGICAL PHASE EFFECTS\nJM Robbins\nNovember 2, 2018\n\nAbstract\nQuantum eigenstates undergoing cyclic changes acquire a phase\nfactor of geometric origin. This phase, known as the Berry phase, or the\ngeometric phase, has found applications in a wide range of disciplines\nthroughout physics, including atomic and molecular physics, condensed\nmatter physics, optics, and classical dynamics. In this article, the basic\ntheory of the geometric phase is presented along with a number of\nrepresentative applications.\nThe article begins with an account of the geometric phase for cyclic\nadiabatic evolutions. An elementary derivation is given along with\na worked example for two-state systems. The implications of timereversal are explained, as is the fundamental connection between the\ngeometric phase and energy level degeneracies. We also discuss methods of experimental observation. A brief account is given of geometric\nmagnetism; this is a Lorenz-like force of geometric origin which appears\nin the dynamics of slow systems coupled to fast ones.\nA number of theoretical developments of the geometric phase are\npresented. These include an informal discussion of fibre bundles, and\ngeneralizations of the geometric phase to degenerate eigenstates (the\nnonabelian case) and to nonadiabatic evolution. There follows an account of applications. Manifestations in classical physics include the\nHannay angle and kinematic geometric phases. Applications in optics\nconcern polarization dynamics, including the theory and observation\nof Pancharatnam's phase. Applications in molecular physics include\nthe molecular Aharonov-Bohm effect and nuclear magnetic resonance\nstudies. In condensed matter physics, we discuss the role of the geometric phase in the theory of the quantum Hall effect.\n\n∗\n\nBasic Research Institute in the Mathematical Sciences\nHewlett-Packard Laboratories Bristol\nFilton Road, Stoke Gifford, Bristol BS12 6QZ\nand\nSchool of Mathematics\nUniversity Walk, Bristol BS8 1TW\n\n2\n\n\fIntroduction\n2 Basic Account of the Geometric Phase\n\n3\n\n2.1 Quantum adiabatic theorem\n\n4\n\n2.2 The geometric phase\n\n4\n\n2.3 Two-state systems\n\n5\n\n2.4 Degeneracies\n\n7\n\n2.5 Time-reversal symmetry\n\n9\n\n2.6 Experimental observation\n\n10\n\n2.7 Geometric magnetism\n\n11\n\n3 Theoretical Developments\n\n13\n\n3.1 Geometric phase as holonomy\n\n13\n\n3.1.1 Fibre bundles.\n\n13\n\n3.1.2 Connections and curvature.\n\n14\n\n3.1.3 Geometric phase revisited.\n\n15\n\n3.1.4 Chern classes.\n\n15\n\n3.2 Degenerate eigenstates and nonabelian geometric phases\n\n16\n\n3.3 Nonadiabatic evolution\n\n19\n\n3.4 Geometric metric tensor\n\n21\n\n3.5 Beyond adiabaticity\n\n22\n\n3.5.1 Corrections to the geometric phase\n\n22\n\n3.5.2 The geometric amplitude\n\n24\n\n4 Classical Systems\n\n26\n\n3\n\n\f4.1 The Hannay angle\n\n26\n\n4.1.1 The classical adiabatic theorem.\n\n26\n\n4.1.2 Basic account of the Hannay angle.\n\n27\n\n4.1.3 Examples.\n\n28\n\n4.1.4 Semiclassical limit.\n\n29\n\n4.1.5 Classical reaction forces.\n\n30\n\n4.2 Symmetry and kinematic geometric phases\n\n31\n\n4.2.1 Falling cats and swimming paramecia.\n\n31\n\n4.2.2 Geometric phases and symmetry reduction.\n\n33\n\n4.2.3 Optimization and control.\n\n35\n\n5 Optics\n\n35\n\n5.1 Geometric phase of coiled light.\n\n36\n\n5.2 Pancharatnam's phase.\n\n37\n\n6 Molecular and Condensed Matter Physics\n\n40\n\n6.1 Pseudorotation in triatomic molecules\n\n40\n\n6.2 Nuclear magnetic resonance\n\n42\n\n6.3 The quantum Hall effect\n\n44\n\nGlossary\n\n48\n\nWorks Cited\n\n48\n\nFurther Reading\n\n50\n\n4\n\n\f1\n\nIntroduction\n\nIn a paper published in 1984, Sir Michael Berry (1984) found that a quantum\nsystem undergoing adiabatic evolution acquires a phase factor of purely geometrical origin. This discovery, now called the Berry phase, or the geometric phase, initiated a tremendous surge of research in a range of disciplines\nacross physics. Berry and subsequent workers quickly established connections to a number of apparently disparate phenomena, including amongst\nothers the Aharonov-Bohm effect (Aharonov and Bohm 1959), its molecular physics analogue (Mead and Truhlar 1979), polarization optics (Pancharatnam 1956), the quantum Hall effect (Thouless et al. 1982), and the\nFoucault pendulum (Eco 1989). Beyond providing a unified description of\nthese phenomena, the geometric phase led to predictions of new effects, subsequently observed experimentally, and a number of substantial extensions\nand generalizations. Among these, the discovery by JH Hannay (1985) of an\nanalogous effect in classical mechanics, the Hannay angle, stimulated much\nnew research in purely classical physics.\nThe mathematical phenomenon which underlies the geometric phase is\nholonomy. Holonomy describes transformations in a quantity induced by\ncyclic changes in the variables which control it. An example from geometry\nis the rotation of vectors parallel transported along closed paths on a curved\nsurface. The mathematics of holonomy and curvature has long played a\nrole in physics through general relativity and quantum field theory. With\nBerry's work came the appreciation of a broader scope of application. Whenever a physical system is divided into parts and one attempts to describe a\nsubsystem in isolation, the influence of the others is manifested through geometric phase effects. The pervasiveness througout physics of this reductive\nprocedure accounts for the ubiquity of the geometric phase. Introducing\na collection of major papers in the field, A Shapere and F Wilczek(1989)\nwrote, \"We believe that the concept of a geometric phase, repeating the\nhistory of the group concept, will eventually find so may realizations and\napplications in physics that it will repay study for its own sake, and become\npart of the lingua franca.\"\nAn introductory account of the geometric phase is given in Section 2.\nThis is followed in Section 3 by a discussion of several theoretical developements. Applications to classical systems, optics, and molecular and condensed matter physics are given in Sections 4–6. The topics chosen for\ndiscussion meant to be representative rather than comprehensive. Among\nseveral omissions, we mention the theory of fractional statistics, which is\ncovered extensively in the volume by Shapere and Wilczek (1989a), and applications to elementary particle physics, which are reviewed by Aitchison\n(1987). The historical development of the subject is discussed by Berry\n(1990a).\n\n5\n\n\f2\n\nBasic Account of the Geometric Phase\n\nThe geometric phase was discovered by Sir Michael Berry in 1983 in the\ncourse of a critical reexamination of the adiabatic theorem in quantum mechanics. This theorem says, in essence, that if a quantum system is changed\nsufficiently slowly, it does not undergo transitions. Thus a system initially\nin an eigenstate of a slowly changing Hamiltonian remains in the evolved\neigenstate. Berry considered the overall phase accumulated by the changing\neigenstate and found an unexpected contribution. This extra phase is of\na geometrical nature, in that it does not depend on the rate at which the\nadiabatic process is carried out.\nOne way that a slowly varying Hamiltonian can arise physically is when\nthe system under consideration interacts with another, much slower system.\nThis leads to the consideration of the quite general problem of two coupled\nsystems evolving on different time scales. In this context, the geometric\nphase describes an effect on the fast system produced by the slow one. As\naction in physics is accompanied by reaction, there is a reciprocal effect on\nthe slow system generated by the fast. This takes the form of an effective\nvector potential in the slow Hamiltonian; the associated Lorentz-like force is\ncalled geometric magnetism. The same geometry underlies both geometric\nmagnetism and the geometric phase.\nThis geometrical structure is intimately connected to degeneracies in\nthe energy spectrum. A typical Hamiltonian has a nondegenerate spectrum\n(excepting systematic degeneracies due to symmetry, which are discussed\nin Section 3.2). Varying a single parameter (eg time itself in the case of a\ntime-dependent Hamiltonian) is unlikely to produce any degeneracies; typically two or three parameters (the number depends on whether time-reversal\nsymmetry is present or not) must be adjusted independently in order to find\none. Nevertheless, the presence of degeneracies in Hamiltonians which are,\nin some sense, near the Hamiltonians of the adiabatic process, are largely\nand sometimes wholly responsible for the geometric phase. This connection\nunderlies several applications, including to the quantum Hall effect (Section 6.3).\n\n2.1\n\nQuantum adiabatic theorem\n\nAdiabatic invariants are quantities which are nearly conserved when the\nenvironment of an isolated system is slowly changed (slowly means in comparison with the system's internal dynamics). Adiabatic theorems provide\nestimates as to how accurately this conservation is respected. In quantum\nmechanics, the adiabatic invariants are the probabilities Pn = |hn|ψi|2 to\nbe in energy eigenstates. These are constant for stationary Hamiltonians,\nbut vary if H is time-dependent. The quantum adiabatic theorem states\nthat as dH/dt goes to zero, so do the probabilities of transitions between\n6\n\n\feigenstates (the rate depends on how smooth dH/dt is), so that the Pn are\nnearly constant. Therefore, within the adiabatic approximation, dynamics\nunder a slowly varying Hamiltonian H(t) is essentially no more complicated\nthan under a stationary one. In particular, if |ψi begins in an eigenstate, it\nremains in one ( nonadiabatic transitions are discussed in Section 3.5), and\nits evolution is determined up to a phase factor.\nWe shall now examine this phase. Suppose that at t = 0, |ψi is in the nth\neigenstate |ni (assumed nondegenerate) of H. For its subsequent evolution\nwe may write\n\u0012\n\u0013\nZ t\n|ψ(t)i ≈ exp −i/~\nEn (τ )dτ |n(t)i.\n(2.1)\nIn so doing we have explicitly identified part of the overall phase, the time\nintegral of the frequency En /~, which is called the dynamical phase. It is\njust the phase one would expect for a solution of the Schrödinger equation.\nAny remaining phase is contained implicitly in the eigenstate |n(t)i. Its\nphase is determined by requiring that hn|(i~∂t − H)|ψi vanish (it would\nautomatically if |ψ(t)i were an exact solution of the Schrödinger equation).\nThis leads to the condition\nhn|ṅi = 0,\n(2.2)\nwhich determines the phase of |n(t)i given an initial choice at t = 0.\n\n2.2\n\nThe geometric phase\n\nWhat Berry discovered is that condition (2.2) yields a path-dependent phase\nfactor. This phase factor is particularly interesting when the Hamiltonian\nis cycled, ie made to return to itself after some time. Then it depends only\non the cycle itself, and not, in contrast to the dynamical phase, on the rate\nat which the Hamiltonian is cycled. For this reason it is called, as well as\nthe Berry phase, the geometric phase.\nTo discuss this further, it helps to formulate the problem slightly differently. Suppose the time dependence of the Hamiltonian is expressed through\nits dependence on some external parameters R = (X, Y, Z), which are made\nto vary slowly in time along a path R(t). Then the eigenstates |n(R)i depend on R as well, and (assuming no degeneracies) are determined for each\nR up to an overall phase. Let us choose this phase to vary smoothly but\notherwise arbitrarily with R. By fixing the phase independently of the dynamics, we may no longer satisfy the condition (2.2) along every path R(t).\nWe therefore allow for an additional phase factor exp(iγn (t)) in the adiabatic\nansatz (2.1), which becomes\n\u0013\n\u0012\nZ t\nEn (R(τ )) dτ exp(iγn (t))|n(R(t))i.\n(2.3)\n|ψ(t)i ≈ exp −i/~\n0\n\n7\n\n\fThe condition hn|(i~∂t − H)|ψi = 0 now yields an evolution equation for γn .\nThis may be written in the form γ̇n (t) = −An (R(t)) * Ṙ(t), where An (R) is\na vector field in parameter space given by\nAn (R) = Im hn(R)|∇n(R)i,\n\n(2.4)\n\nor equivalently,\nin terms of eigenfunctions ψn (x, R) = hx|n(R)i, by An (R) =\nR\nIm ψn∗ (x, R)∇ψ(x, R)dx (here ∇ acts on the parameters R).\nIf the Hamiltonian is cycled around a closed curve C in parameter space,\nthen |ψ(t)i acquires a geometric phase\nγn (C) = −\n\nZ\n\n0\n\nT\n\nAn * Ṙ dt =\n\nI\n\nC\n\nAn * dR.\n\n(2.5)\n\nIts expression as a line integral reveals its geometrical character; the geometric phase depends only on the cycle C, and not on the manner in which\nthe cycle is traversed in time. Using Stokes' theorem, γn can be expressed\nas\nZ\n(2.6)\nγn (C) = − Vn (R) * dS,\nS\n\nthe flux of the vector field Vn = ∇ × An through a surface S in parameter\nspace whose boundary is C. Vn is given by\nVn = Im h∇n| × |∇ni.\n\n(2.7)\n\nFrom (2.6) it is evident that only cycles which enclose nonzero area can\nhave nontrivial geometric phases. For example, γn (C) vanishes for cycles\nconsisting of a path and its retrace.\nIt is easy to see that the geometric phase does not depend on the choice\nof phase for |n(R)i. Indeed, under the change of phase\n|n(R)i → exp(iχ(R))|n(R)i,\n\n(2.8)\n\nAn (R) transforms according to An (R) → An (R) + ∇χ(R); this shift by a\nperfect gradient leaves its integral round a closed loop, γn , and its curl, Vn ,\nunchanged. Thus, the geometric phase is an intrinsic property of the family\nof eigenstates |n(R)i.\nIt is useful to draw an analogy with electromagnetism, in which An\ncorresponds to the vector potential and Vn to the magnetic field. The geometric phase γn corresponds to a magnetic flux. The change of phase (2.8)\ncorresponds to a gauge transformation, which shifts the vector potential by\na gradient and leaves the magnetic field unchanged.\nSubstituting the first-order perturbation expansion\n|∇ni =\n\nX hm|∇H|ni\n|mi + hn|∇ni |ni\n(En − Em )\n\nm6=n\n\n8\n\n(2.9)\n\n\finto (2.7) leads to a useful formula,\nVn = Im\n\nX hn|∇H|mi × hm|∇H|ni\n.\n(En − Em )2\n\n(2.10)\n\nm6=n\n\nIn this form, the independence of Vn on the eigenstate phases is manifest.\nAnother formula with this property is\nVn = Tr (ρn ∇ρn × ∇ρn ),\n\n(2.11)\n\nwhere ρn = |nihn| is the density operator. It too is useful in applications.\nOne of the applications discussed by Berry (1984) is to the AharonovBohm effect (Aharonov and Bohm 1959). The Aharonov-Bohm effect describes the dependence of quantum mechanics on electromagnetic fields in\nregions of space which are physically excluded. This dependence is mediated through the vector and scalar potential, whose relation to the electric\nand magnetic fields is nonlocal. The most celebrated example concerns an\nelectron moving in the vicinity of an inpenetrable perfect solenoid of infinite\nextent. Since outside the solenoid the magnetic field is zero, the classical mechanics of the electron is insensitive to any magnetic flux inside the solenoid.\nBut the quantum mechanical behaviour of the electron does depend on the\ninterior flux, as Y Aharonov and D Bohm showed by calculating its scattering cross-section (a prediction subsequently experimentally confirmed by\nChambers (1960)).\nThe Aharonov-Bohm effect can be understood in terms of interference\nbetween de Broglie waves passing on opposite sides of the solenoid. The\nphase difference between the two waves includes the integral\nI\ne\nA(s) (R) * dR\n(2.12)\nγAB =\n~c C\nof the vector potential A(s) (R) of the solenoid round a loop C enclosing it.\n(In (2.12), c is the speed of light and −e the electron charge.) The AharonovBohm phase γAB is just 2π times the magnetic flux in the solenoid measured\nin units of the flux quantum hc/e.\nIt may be regarded as a geometric phase in the following manner. We\nimagine the electron confined to a large box, centred at R, which is not\npenetrated by the solenoid. The eigenstates of the electron |n(R)i depend\nparametrically on R; changes in R induce gauge transformations in the\neigenfunctions. One finds that Im hn(R)|∇n(R)i = e/~cA(s) , so that in\nthis case the geometric vector potential (2.4) coincides with the physical\nvector potential of the solenoid. On being transported (not necessarily adiabatically in this case) round the solenoid, the electron eigenstates acquire\na geometric phase which is precisely the Aharonov-Bohm phase.\n\n9\n\n\f2.3\n\nTwo-state systems\n\nTwo-state systems provide a canonical example of the geometric phase. The\nrequisite calculations are easily carried out, and the main features of the\ngeneral case are represented. The parameterized family of Hamiltonians can\nbe written in the form\nH(R) = E(R)I + F(R) * σ,\n\n(2.13)\n\nwhere I is the identity and σ are the Pauli spin matrices. The term E(R)I\nshifts the energy by a constant and affects neither the eigenstates nor their\ngeometric phases. Both of these are determined by the field F(R).\nAn illustrative example is a spin-1/2 particle in a uniform magnetic\nfield. The parameters R are then just the components of the field, so that\nF(R) = 12 μR, where μ is the magnetic moment. The eigenstates\n\u0012\n\u0013\n\u0012\n\u0013\ncos θ/2\n− sin θ/2\n| + (R)i =\n, | − (R)i =\n(2.14)\neiφ sin θ/2\neiφ cos θ/2\ndepend on the polar angles (θ, φ) of R, and the energy levels E± (R) =\n± 12 μ~R on its magnitude. Straightforward calculation using (2.4) and (2.7)\nyields\n1R\n1 1 − cos θ\nφ̂, V± (R) = ±\n.\n(2.15)\nA± (R) = ±\n2 R sin θ\n2 R3\nThus, A± and V± are respectively the vector potential and magnetic field of\na magnetic monopole of strength ±2π at the origin. Under the influence of\na slowly varying magnetic field R(t) taken through a cycle C, a Rspin initially\nin an up-state returns to itself\nR with a dynamical phase −μ/2~ Rdτ and a\ngeometric phase γ+ (C) = − S V+ * dS. Gauss's law implies that\nγ+ (C) = −\n\n1\n× solid angle subtended by C.\n2\n\n(2.16)\n\nThis spin-1/2 geometric phase has been observed in neutron spin rotation\nexperiments by Bitter and Dubbers (1987). A special case is when C is\nconfined to a plane containing the origin. Then its solid angle is 2π times\nthe number of times m the origin is enclosed, and the corresponding phase\nfactor is (−1)m . This corresponds to the well-known sign change of spin-1/2\nparticles under rotations through 2π.\nIt is straightforward to generalize these results to the case of arbitrary\nF(R) in (2.13). The flux field is then given by\nFi ∇Fj × ∇Fk\n1\nV± (R) = ± ǫijk\n2\nF3\n\n(2.17)\n\n(ǫijk is the antisymmetric Levi-Cevita symbol), and it has monopole sources\nat points where F vanishes. The monopoles have strength ±2πσ, where σ is\n10\n\n\fthe sign of the (assumed nonvanishing) determinant det ∂Fi /∂Rj evaluated\nwhere F = 0.\nAs is familiar from Dirac's analysis of magnetic monopoles (Dirac 1931),\nthere is necessarily a string of singularities of the vector potential attached\nto the monopole. The position of the string depends on the choice of gauge,\nand Dirac's quantization condition for electric charge follows from demanding that these choices be physically indistinguishable. In the context of the\ntwo-state geometric phase, the monopole strings of A± (R) lie along discontinuities in the phases of |±(R)i. When the eigenstates are chosen as in (2.14),\nthese discontinuities lie along the negative z axis. By varying the phase of\nthe eigenstates (as in (2.8)), the string can be made to pass in and out of\na given cycle C. As it does, the geometric phase γ± (C) changes by ±2π.\nTherefore, the geometric phase factor exp(iγ± (C)) remains unchanged, and\nthere are no observable consequences.\n\n2.4\n\nDegeneracies\n\nIn the spin-1/2 example, the flux fields V± (R) are generated by point\nsources of strength ±2π at the origin R = 0. What makes the origin special is that it is the only point in parameter space where the energy levels\nare degenerate. This relationship between the geometric phase and energy\nlevel degeneracies turns out to be quite general. In the absence of symmetries, a typical Hamiltonian in a parameterized family has a nondegenerate\nspectrum. However, at certain points in parameter space, belonging to the\nso-called degenerate set, two (or more) energy levels become degenerate. In\nthe absence of time-reversal symmetry (the time-reversal symmetric case is\ndiscussed in the following section), the dimension of the degenerate set is\ntypically three less than the dimension of parameter space itself. Thus, for\nthe three-parameter families H(R) we have been considering, degeneracies\noccur at isolated points. We have already seen this to be the case in the\nspin-1/2 example. (Note that there, the magnetic field is responsible for\nbreaking time-reversal symmetry.)\nMore generally, let us consider the behaviour of the flux field Vn (R) in the\nneighbourhood of a degeneracy R∗ between two eigenstates, say the nth and\nn−1st, of an arbitrary family of Hamiltonians. As En (R)−En−1 (R) is small\nnear R∗ , perturbation theory (cf (2.9)) implies that the dominant component of |∇ni lies along |n − 1i. Therefore, for the purposes of approximating\nVn (which is defined in terms of |∇ni), the Hamiltonian can be restricted\ndefn\n\nto the nearly-degenerate subspace spanned by the states |1i = |n(R∗ )i and\ndefn\n\n|2i = |n − 1(R∗ )i. One obtains in this way a two-state system of the form\n\n11\n\n\f(2.13), where the field F(R) is given by\nh1|H(R)|1i − h2|H(R)|2i\n.\n2\n(2.18)\nIn the neighbourhood of R∗ , Vn (R) is given approximately by (2.17).\nThere it has a single monopole source at the degeneracy R∗ of strength ±2π.\nWe may apply a similar analysis in the neighbourhood of each degeneracy\nof |ni to obtain\nX\n±2πδ(R − R∗ ).\n(2.19)\n∇ * Vn =\nFx = Re h1|H(R)|2i, Fy = Im h1|H(R)|2i, Fz =\n\nR∗\n\nThus, the flux field for the nth eigenstate has monopole sources of strength\n±2π at points where |ni is degenerate. (Their sign depends on whether the\ndegeneracy is with the state above or below, and also on the sign of the determinant det ∂Fi (R∗ )/∂Rj .) Vn may in addition have a purely divergenceless\ncontribution.\nIt follows that the flux of Vn through a closed surface in parameter space\nis 2π times the number of degeneracies, counted with their signs, contained\nwithin.\n\n2.5\n\nTime-reversal symmetry\n\nThe presence of time-reversal symmetry imposes constraints on the geometric phase. These are strongest when the eigenstates themselves are timereversal symmetric, so we consider such cases first. Then the wave functions\nψn (x, R) = hx|n(R)i can be chosen to be real, and the geometric phase\nfactor is necessarily a sign ±1, so that γn is an integer multiple of π. In this\ncase, the geometric phase depends only on the topology of the closed curve,\nnot on its geometry. As C is deformed, unless γn (C) changes discontinuously, it necessarily remains constant. It can change (discontinously) when\nC passes through degeneracies (points R∗ where |ni is degenerate). For systems with time-reversal symmetry, the dimension of this degenerate set is\ntypically two less than the dimension of parameter space, so that it consists\nof lines in three-dimensional parameter space, or points in two-dimensional\nparameter space. The geometric phase γn (C) is π times the number of degeneracies enclosed by C, counted with the appropriate sign. An important\nconsequence is that the flux field Vn has delta-function singularities at the\nenergy level degeneracies and is zero elsewhere.\nThe spin-1/2 example of Section (2.3) provides an illustration if we fix Y\n(the y-component of the magnetic field) to be zero. Then the spin Hamiltonian 12 μB.σ is real symmetric rather than complex Hermitian, and we can\ntake its eigenvectors to be real. The parameter space is the XZ plane, and\nthe solid angles subtended by curves in this plane are multiples of 2π. The\ngeometric phase γ± (C) is just ±π times the number of times C encircles the\n12\n\n\forigin. Another example concerns the electronic ground state of triatomic\nmolecules X3 (cf Section 6.1).\nIn cases where the eigenstates are themselves not time-reversal symmetric, and instead occur in pairs related by time-reversal, the constraints on\nthe geometric phases are much weaker. They are no longer necessarily multiples of π (ie, the phase factors are no longer necessarily real). However,\ngeometric phases for states related by time-reversal necessarily have opposite\nsigns.\n\n2.6\n\nExperimental observation\n\nSince the physical properties of a quantum system does not depend on its\noverall phase, one could wonder whether the geometric phase is observable.\nNumerous experiments have shown that it is.\nMost direct experimental studies of the geometric phase belong to one\nof three types. The first is the 'one state, two Hamiltonian' experiment.\nAn ensemble of states initially in an energy eigentate is coherently divided\ninto two streams. The first evolves under a constant Hamiltonian, while the\nHamiltonian driving the second is cyclically varied. The two streams are\nthen recombined and allowed to interfere, and their relative phase determined. The relative phase includes both dynamical and geometric contributions, and to extract the geometric term the dynamical phase must either be\nmade to vanish, or else subtracted off explicitly. Examples are the optical\npolarization experiments discussed in Section 5.2.\nThe second type is the 'two state, one Hamiltonian' experiment. Here\nan initial state |ψi i is prepared in a superposition αi |mi + βi |ni of energy\neigenstates. The Hamiltonian governing its evolution is taken through an\nadiabatic cycle. The final state |ψf i = αf |mi + βf |ni is physically distinguishable from the initial one, as the relative phase of the superposed\neigenstates has changed. Part of this (observable) change in the relative\nphase involves the difference γm − γn in geometric phases. The observation of optical activity in coiled fibres by Tomita and Chiao (1986) (see\nSection 5.1) provides an example of this second type.\nIn the third type of experiment, the adiabatic cycle is performed not\nonce but\nR repeatedly, with period T . With each cycle, |ni acquires a phase\nφ = − En (R(t)dt/~ + γn , so that there appears in its mean angular frequency ω = φ/T a geometric shift δωg = γn /T . This frequency shift can be\ndetected in spectroscopic measurements, and is the basis for nuclear magnetic resonance studies of the geometric phase (cf Section 6.2).\n\n2.7\n\nGeometric magnetism\n\nSo far we have been regarding the evolution of the parameters R as externally prescribed. Now let us suppose the parameters of the Hamiltonian\n\n13\n\n\fH(R) are dynamical variables in their own right. For example, they could\nbe the coordinates of a heavier (and therefore slower) system to which the\noriginal one, the fast system, is coupled. For definiteness, we take the Hamiltonian of the coupled system to be of the form P 2 /2M + H(R), where P\nis the momentum of the slow system, and the dependence on the fast coordinates and momenta is left implicit in H(R). Both systems are to be\ntreated quantum mechanically. The geometric phase describes an effect on\nthe fast system due to the slow. There is a corresponding influence on the\nslow system due to the fast.\nThis is the natural setting for the Born-Oppenheimer approximation, in\nwhich the fast and slow systems are the electrons and nuclei of a molecule.\n(For consistency with the preceding discussion, we denote the nuclear coordinates by a single vector R; it is easy to adapt the notation to accomodate more than one nucleus.) By assuming that the electronic state rapidly\nadjusts to changes in the nuclear configuration, one is led to look for approximate eigenfunctions of the form Ψn (r, R) = ψn (R)φn (r, R), where the\nelectronic wavefunction φn (r, R) is an eigenstate with energy En (R) of the\nelectronic Hamiltonian H(R), in which the nuclear coordinates appear as\nparameters. The nuclear wavefunction ψn (R) is an eigenstate of the nuclear\nHamiltonian −~2 ∇2 /2M + En (R); the electronic energy plays the role of\na potential. The Born-Oppenheimer approximation consists of neglecting\nthe weak variation of the electronic wave function φn (r, R) with the nuclear\ncoordinates. (It is essentially the adiabatic approximation (2.1) adapted to\ncoupled systems.)\nThis was the context for seminal work in this subject by CA Mead and\nD Truhlar in 1979. The primary objective of this work, which anticipated\ncertain aspects of the geometric phase, was to derive corrections to the BornOppenheimer approximation. Such corrections appear when the momentum\noperator P = −i~∇ is applied to the putative eigenstate ψn (R)|n(R)i. The\nresult, −i~ (∇ψn |ni + ψn |∇ni), is no longer proportional to the electronic\neigenstate |n(R)i. However, if we neglect electronic components orthogonal\nto |ni, we obtain −i~ (∇ψn |ni + ψn hn|∇ni) |ni, which is. The effect on the\nnuclear Schrödinger equation is to redefine the momentum operator,\ndefn\n\nPψ = (−i~∇ + ~An )ψ,\n\n(2.20)\n\nHere An (R) is given by (2.4). Thus, the field whose line integral gives\nthe electronic geometric phase appears as a vector potential in the nuclear\nHamiltonian. There it corresponds to an effective magnectic field Vn =\n∇ × An which modifies the nuclear dynamics. This is called geometric\nmagnetism.\nThe situation described above is quite general. Whenever there are two\ncoupled systems evolving on different time scales, we can effect an approximate description of the slow system by averaging over the fast motion.\n14\n\n\fThere appears in the slow dynamics an effective vector potential and associated magnetic field. The vector potential and magnetic field are precisely\nthe fields whose line integrals and fluxes describe the geometric phase. (In\ncases where the coupling involves not only the slow coordinates but the slow\nmomenta as well, this description has to be modified somewhat.)\nGeometric magnetism is responsible for a variety of phenomena. Mead\nand Truhlar analysed its effects in nuclear rotation-vibration spectra, which\nhave since been observed experimentally (cf Section 6.1). These effects can\nbe nontrivial even when time-reversal symmetry is present (cf Section 2.5),\ndue to the change in sign of the electronic wavefunction φn (r, R) when the\nnuclear coordinates R are carried round a degenerate configuration. Like\nthe magnetic field of the Aharonov-Bohm effect (Section 2.2), the flux field\nVn (R) in this case vanishes everywhere except at these degenerate configurations, where it is singular. Mead (1980) has called this the \"molecular\nAharonov-Bohm effect\".\nGeometric magnetism survives in the classical limit. When this limit is\napplied to the slow system alone, it leads to geometric phase modifications\nof the semiclassical (Bohr-Sommerfield) quantization conditions. These are\ndiscussed by Kuratsuji and Iida (1985), Wilkinson (1984), and Littlejohn\nand Flynn (1991).\nThe situation where both the fast and slow systems are fully classical\nis discussed in Section 4.1.5. Here let us mention a simple but compelling\nillustration discussed by Li and Mead (1992). Let us consider the BornOppenheimer approximation applied to an atom, rather than the molecule.\nThe electronic energy levels En (R) depend on the atom's centre-of-mass R,\nand appear as potentials in the equations of motion R̈ = −∇En + F(R),\nalong with the external force F(R). In the absence of external potentials, the\nenergy levels are independent of R, and F ≡ 0; the centre-of-mass behaves\nas a free particle. Now suppose the atom moves in a uniform magnetic field.\nThe energy levels are still R-independent (by translation invariance), but\nthere now appears in the centre-of-mass dynamics the Lorentz force F =\n+ZeṘ × B. The predictions of this analysis are spectacularly unphysical;\nwalking through the earth's magnetic field, you would experience a vertical\nforce sufficient to hurl you into the air. What is missing from this analysis\nis geometric magnetism from the electrons; the field Vn (R) introduces into\nthe centre-of-mass dynamics a second Lorentz force which either exactly\nor nearly (in case the electron eigenstate has a nonzero magnetic moment)\ncancels the first.\n\n3\n\nTheoretical Developments\n\nA number of theoretical developments of the geometrical phase are described. These include its mathematical setting in terms of holonomy under\n\n15\n\n\fparallel transport, as well as several generalizations which remove the assumptions of nondegeneracy and adiabaticity.\n\n3.1\n\nGeometric phase as holonomy\n\nObjects rigidly transported round a closed path in a curved space can return\nwith a different orientation – this is holonomy. Here is a simple (and surely\nphysical) example. Hold your right arm outstretched before you with your\npalm facing down. Keeping your wrist rigid, swing your arm into your chest,\nthen raise it clockwise in front of you, and finally swing it away downwards\nuntil it is outstretched before you again. Your arm has returned to its\noriginal position, but your hand has turned clockwise through 90◦ .\nThe mathematical setting for this phenomenon is the theory of connections on fibre bundles. What follows in Sections 3.1.1– 3.1.4 is an informal\naccount of the relation between this theory and the geometric phase. No attempt is made at mathematical precision; the intention is to convey a sense\nof the principal ideas involved. Some standard references are (Eguchi et al\n1980) and (Nash and Sen 1983).\n3.1.1\n\nFibre bundles\n\nA fibre bundle E is a space, or manifold, composed of two smaller ones,\nthe base manifold B and the fibre F . The fibre bundle is constructed by\nattaching a copy of the fibre to each point of the base in a particular way.\nThe simplest case, a trivial fibre bundle, is where E is just the cartesian\nproduct B × F of the base with the fibre. A general fibre bundle cannot be\nso expressed. While it is always possible to partition it into smaller pieces\nwhich are themselves cartesian products Mα × F of subsets of the base with\nthe fibre, these pieces may fit together in an interesting and nontrivial way,\nwhich reflects the topological properties of the bundle.\nThe configuration space E of an outstretched arm can be described as a\nfibre bundle. In this case, the base manifold is the unit sphere, whose polar\ncoordinates (θ, φ) determine the arm's direction. The fibre is the unit circle,\nwhose single angle coordinate χ describes the orientation of the hand relative\nto some reference position. In this case E is not simply the cartesian product\nM × F . This is because it is not possible to assign, in a continuous way, a\nreference hand position for every arm direction. This is a consequence of the\n\"hairy ball theorem\", ie the fact that it is impossible to comb flat a hairy\nball without introducing singularities (eg crowns, cowlicks, bald patches).\nAs in the arm example, it is often the case in physical applications that\nthe fibre describes internal degrees of freedom. Usually the fibre has some\nadditional mathematical structure as well. If it is a real or complex vector\nspace (describing spin degrees of freedom, for example), then E is called a\nreal or complex vector bundle. If the vector space is one-dimensional, E is\n\n16\n\n\fcalled a line bundle (real or complex). Or else, the fibre might be a group\n(for example, the two- or three-dimensional rotation group, describing the\naxial or spatial orientation of a rigid body). Then E is called a principal\nbundle.\n3.1.2\n\nConnections and curvature\n\nTo a given path P on the base there correspond innumerable paths in the\nfibre bundle which project down to it; a motion in the base leaves the fibre\nmotion undetermined. A connection is a rule for associating to P a particular\npath P̂ through a given point in the bundle, the lifted path (see Fig. 1). A\npoint moving along the lifted path P̂ is said to be parallel transported. The\nconnection rule is expressed in differential form by making the fibre velocity\na linear function of the base velocity, which can also depend on the base and\nthe fibre positions. For vector bundles, the dependence on fibre position\nshould be linear as well. There are analogous restrictions in the case of\nprincipal bundles. In physical applications, a particular connection is often\nsuggested by kinematical or dynamical considerations, eg, moving your arm\nwithout unnecessarily twisting your wrist.\nLet us consider the lift Ĉ of a closed path C on the base (see Fig. 2).\nIts endpoints necessarily lie in the same fibre, but they need not coincide.\nIf they do not, the difference between the endpoints is called the holonomy\nof C. In the outstretched arm example, C is the spherical right triangle\ndescribed by your arm, and its holonomy is the π/2 turn of your hand\nwhich results from traversing it in the manner prescribed. In case there is\nholonomy for arbitrarily small closed paths, the connection is said to have\ncurvature. Curvature describes the infinitesimal holonomy acquired round\nan infinitesimal closed paths, and may be expressed in terms of derivatives\n(a generalized curl) of the connection.\nLet us consider a very simple example. We take the base M to be threedimensional Euclidean space {R ∈ R3 }, the fibre F to be one-dimensional\ncomplex vector space {z ∈ C}, and the bundle E to be their cartesian\nproduct {(R, z) ∈ R3 × C}. Thus E is a trivial complex line bundle. A\nconnection specifies the fibre velocity ż as a function of the fibre position\nz, R and Ṙ whose dependence on z and Ṙ is linear. This relation may\nbe expressed as ż = (W(R) * Ṙ) z, where W(R) is a complex vector field.\nW(R) is called the connection form, or simply the connection.\nGiven a\u0010motion R(t) in the\n\u0011 base, its lifted motion in the fibre is given by\nR\nz(t) = exp R(t) W(R) * dR z0 , where z0 denotes the initial position in the\nfibre of the lifted path. If R(t) describes\na closed path, then its holonomy is\nH\nthe scalar factor exp Γ, where Γ = R(t) W(R) * dR. Using Stokes' theorem,\nwe may express Γ as the flux of a vector field V = ∇ × W through a surface\nS bounded by C. V is the curvature of the connection W.\n\n17\n\n\fOf particular relevance to the geometric phase is the case in which the\nconnection preserves the length |z(t)| of vectors along the lifted path. Then\nthe connection is said to be hermitian. The connection form W(R) is purely\nimaginary, and may be written as iA(R), where A(R) is real.\n3.1.3\n\nThe geometric phase revisited\n\nAfter seeing a preliminary version of Berry's 1984 paper, B Simon (1983)\nobserved that the geometric phase finds its natural mathematical expression\nas the holonomy of a connection on a fibre bundle. The fibre bundles in\nquestion are the complex line bundles E (n) associated with nondegenerate\neigenstates of a quantum Hamiltonian H(R). The base manifold is the\nparameter space (we continue to assume this to be R3 ), and the fibres are\nvectors |ψi in Hilbert space which satisfy the Schrödinger equation (H(R) −\nEn (R))|ψi = 0; these are just the unnormalized nth eigenstates, and are\ndetermined up to a complex scalar.\nGiven an eigenstate |ψi of H(R), a connection determines an eigenstate\n|ψi+|dψi of the nearby Hamiltonian H(R+dR) by fixing its norm and phase.\nOn physical grounds it is sensible to require that the connection conserve\nprobability, ie that |ψi + |dψi and |ψi both have unit norm. This implies\nthat Re hψ|dψi = 0. The simplest rule for fixing the phase of |ψi + |dψi is\nto take Im hψ|dψi = 0 as well. This determines completely a connection on\nE (n) , which is defined by the relation\nhψ|dψi = 0.\n\n(3.1)\n\nUnder parallel transport round a closed path C, an eigenstate |ψi acquires\na phase factor exp(iγn ). This phase factor, the holonomy of C, is precisely\nthe geometric phase factor. This follows by noting that the connection (3.1)\nis just the condition (2.2) derived from adiabatic evolution.\nThere is an exact mathematical analogy between the outstretched arm\nand a variant of the spin example of Section 2.3. If a spin-1 (instead of a\nspin-1/2) particle, initially in its down-state, is driven by a magnetic field\nwhich is slowly cycled round a closed path C, then its geometric phase γ1 is\nprecisely the turn in the hand of an arm describing the same circuit. Both\nare equal to the solid angle subtended by C.\n3.1.4\n\nChern classes\n\nSome fibre bundles are trivial cartesian products M × F , and others are\nnot. Topology lies at the root of this distinction, and characteristic classes\nmake this distinction precise. They describe an intrinsic twistedness in fibre\nbundles which cannot be combed away. Bundles whose characteristic classes\nare the same can be smoothly transformed into one another; bundles whose\ncharacteristic classes are different cannot.\n18\n\n\fFor complex vector bundles, the characteristic classes are called Chern\nclasses. The number of Chern classes is equal to the dimension of the fibre.\nThe rth Chern class associates an integer cr (N ), the Chern number, to every\n2r-dimensional, boundaryless submanifold N of the base manifold M . Thus,\nthe first Chern class assigns an integer c1 (S) to every closed surface S in M .\nThere are various ways to calculate Chern numbers. Among these, there are\nformulas in terms of integrals over N involving the curvature.\nAn illustrative example is the celebrated Gauss-Bonnet theorem\nR from\nclassical differential geometry. The theorem states that the integral S KdS\nof the Gaussian curvature K over a closed one-sided surface S is equal to\n2π times an integer χ, the Euler characteristic. The Euler characteristic is\na topological feature of the surface. It is related by the formula χ = 2 − 2g\nto the genus g, the number of handles on S when it is regarded through\na topologist's eyes as a many-handled sphere. The Gauss-Bonnet theorem\ncan be verified immediately for theRunit sphere (K = 1, g = 0). What is\nremarkable is the implicationR that S KdS = 4π for any surface smoothly\ndeformable to a sphere, but S KdS 6= 4π for any surface (such as a torus)\nwhich is not.\nThe Gauss-Bonnet theorem can be formulated in terms of fibre bundles.\nThe bundle consists of the surface S (the base) together with its tangent\nvectors at each of its points (the fibres). A connection is defined through\nthe Riemannian rule for parallel transport on a curved surface. By identifying two-dimensional real tangent vectors with one-dimensional complex\nones, the fibre bundle may be regarded as a complex line bundle,\nand its\nR\nfirst Chern number c1 (S) turns out to be twice the integral S KdS of the\nGaussian curvature.\nReturning to considerations of the geometric phase, let us consider the\ncomplex line bundles E (n) of quantum eigenstates, discussed in the preceed(n)\ning section. Each has a single Chern class c1 which assigns an integer to\nevery closed surface S in parameter space. This integer is given by\nZ\nI\n(n)\n∇ * Vn dR,\n(3.2)\nVn * dS =\nc1 (S) =\nB\n\nS\n\nwhere in the second equation we have used the divergence theorem; B is\na three-dimensional region bounded by S. From (2.19), the last integral\nis precisely the number of energy level degeneracies (points R∗ ∈ B where\nEn (R∗ ) = En±1 ) contained in S, counted with their appropriate sign (see\nSection 2.4). In terms of the electromagnetic analogy (Section 2.2), it is\nthe number of magnetic monopoles in S counted with their charge. Thus,\nenergy level degeneracies manifest themselves in the nontrivial topology of\nthe eigenstate line bundles E (N ) .\n\n19\n\n\f3.2\n\nDegenerate eigenstates and nonabelian geometric phases\n\nIf a system possesses a sufficient degree of symmetry, its energy levels will\nbe degenerate. Two examples are the angular momentum multiplets of rotationally symmetric systems, and Kramers degeneracy in systems with timereversal symmetry and an odd number of fermions. If the symmetry persists\nthroughout the parameterized family H(R), then so do these degeneracies.\nUnder a slowly varying Hamiltonian H(R(t)), the adiabatic theorem implies\nthat transitions to states outside a degenerate multiplet are small. However,\ntransitions to states within the multiplet need not be, no matter how slow\nthe variation (transitions between degenerate states cost no energy).\nF Wilczek and A Zee (1984) generalized Berry's analysis to degenerate\neigenstates. They showed that under adiabatic cycling round a closed circuit\nC, such states need not return to themselves up to a phase, but instead can\nevolve into new states within the multiplet. The transformation from initial\nto final states is generated by a unitary matrix U (C), called the nonabelian\ngeometric phase. Nonabelian geometric phases can be interpreted as holonomy, but of a more general sort than was considered in Section 3.1.3. There\nis a corresponding generalization of geometric magnetism.\nThe analysis, which runs parallel to the nondegenerate case, proceeds as\nfollows. Let E(R) denote an r-fold degenerate energy level whose degenerate\neigenspace is spanned by an orthonormal basis |j(R)i, j = 1, 2, . . . , r. We\nconsider evolution under a slowly changing Hamiltonian H(R(t)) of states\n|ψj (t)i initially equal to |j(R(0))i. Neglecting transitions to states outside\nthe multiplet, we look for approximate solutions of the form\n\u0013X\n\u0012\nZ t\nr\nUjk (t)|k(R(t))i,\nE(R(t))dτ\n|ψj (t)i = exp −i/~\n0\n\n(3.3)\n\nk=1\n\nie, a superposition of evolving degenerate eigenstates multiplied by an overall\ndynamical phase factor. For the inner products hψk (t)|ψj (t)i to be conserved\nin time, the r×r matrix U (t) must be unitary. Its evolution is determined by\nrequiring hk(R)|(i~∂t −H)|ψj (t)i to vanish for each k (it would automatically\nif ψj (t) were an exact solution of the Schrödinger equation). This leads to\nthe equation of motion\nU̇ (t) = −iU (t) A(R(t)) * Ṙ = −iU (t)A(t),\n\n(3.4)\n\nwhere A(R) = (A(x) , A(y) , A(z) )(R) is a vector of r × r Hermitian matrices\nwhose matrix elements are given by\n(α)\n\nAjk (R) = −ihk(R)|∇α j(R)i,\nand A(t) = A(R(t)) * Ṙ(t).\n20\n\n(3.5)\n\n\fThe solution of (3.4) is given by the time-ordered product\n\u0013\n\u0012 Z t\nA(τ ) dτ\nU (t) = T exp −i\n0\nZ Z\nZ\nA(τ ) dτ +\n=I+\n0<τ <t\n\n0<τ <τ ′ <t\n\nA(τ )A(τ ′ ) dτ dτ ′ + * * * , (3.6)\n\nwhere I is the identity matrix. The time ordering indicates that in expanding\nthe exponential of the integral, all matrices are to be ordered with later times\nto the right. If the matrices A(τ ) at different times commute with each other,\nthen the ordering of the factors is irrelevant, and the r.h.s.\n\u0010 of R(3.6) simplifies\n\u0011\nR\nR\nt\n2\nto I + 0<τ <t A(τ ) dτ + ( 0<τ <t A(τ ) dτ ) /2! + * * * = exp −i 0 A(τ ) dτ , eg\nthe ordinary exponeniated integral. In particular, if r = 1, then A(τ ) is a\nscalar, and U (t) is simply a phase factor.\nSuppose the Hamiltonian is taken round a closed cycle C. Then the relation between initial and final states is described, apart from the dynamical\nphase factor, by the unitary matrix\n\u0013\n\u0012 I\nA(R) * dR .\n(3.7)\nU (C) = T exp −i\nC\n\nU (C) is the nonabelian geometric phase. The terminology derives from the\nfact that the factors A(R)*dR in the time-ordered product do not in general\ncommute. They do, however, in the nondegenerate case r = 1; then U (C)\nis just the ordinary (abelian) geometric phase factor exp(iγ(C)). Like the\nordinary geometric phase, U (C) depends only on the path C and not on the\nrate at which it is traversed.\nFor infinitesimal circuits, U (C) is of the form I + iΓ(C), where Γ(C) is\nan infinitesimal Hermitian matrix given by the flux of the covariant curl of\nA,\nV = ∇ × A − A × A,\n(3.8)\nthrough the infinitesimal area bounded by C. (Note that because the components of A are matrices, the cross product A × A does not vanish, just\nas the cross product σ × σ = 2iσ of Pauli matrices does not vanish.) This\nresult does not extend to finite circuits, though, as there is no nonabelian\nversion of Stokes' theorem.\nLike the ordinary geometric phase, U (C) may be interpreted as holonomy, but now on a complex r-dimensional vector bundle rather than a line\nbundle. The base manifold is parameter space (R3 in the examples considered here), and the fibers are the degenerate eigenspaces spanned by |j(R)i.\nThe matrix-valued vector field A(R) is the connection form, which describes\nhow states in the fibres are parallel transported along paths R(t) in the base.\nV(R) is the associated curvature form.\n\n21\n\n\fThe nonabelian geometric phase does not depend on the choice of basis\n|j(R)i in any intrinsic way. Under a unitary change of basis\n|j(R)i →\n\nr\nX\n\nWjk (R)|k(R)i,\n\n(3.9)\n\nk=1\n\nthe nonabelian version of the gauge transformation (2.8), U (C) transforms\naccording to U (C) → W U (C)W † . This unitary conjugation represents simply the change of basis applied to U (C) and leaves its observable properties\nunchanged. The fields A(R) and V(R) transform according to\nA → W AW † − i∇W W †,\n\nV → W VW †\n\n(3.10)\n\nunder (3.9). These transformation properties characterize the potential and\nfield strength of Yang-Mills field theories, generalizing the electromagnetic\nanalogy with the geometric phase (cf Section 2.2) to the nonabelian case.\nGiven a particular closed circuit C, one can choose the basis |j(R)i\nso as to diagonalize U (C). Then under parallel-transport round C, each\nbasis state returns to itself up to a phase factor. Under certain conditions,\none can find a basis which diagonalizes every holonomy, regardless of C.\nIn such cases, the degenerate and nondegenerate cases are essentially the\nsame. In general, though, there is no choice of basis which renders every\nU (C) diagonal. What distinguishes the general case is that the generators\nof the symmetries responsible for the degeneracies depend on parameters\nthemselves. A particular example, the Λ-doubling of electron doublets in\ndiatomic molecules, is discussed by Moody et al. (1986).\nThe discussion of geometric magnetism in the Born-Oppenheimer approximation (cf Section 2.7) can also be generalized to the degenerate case.\nAs before, we regard the parameters R as the coordinates of a slow system\nto which the original one, the fast system, is coupled. The Hamiltonian\nis given by P 2 /2M + H(R), where P is the slow momentum and the dependence on the fast coordinates and momenta is left implicit in H(R).\nWe look for approximate eigenfunctions of the coupled system in which the\nfast system belongs\nPr to a degenerate multiplet of H(R). These are of the\nform Ψ(r, R) =\nj=1 ψj (R)φj (r, R), where φj (r, R) = hr|j(R)i are the\nfast eigenfunctions (which depend parametrically on the slow variables R).\nSubstituting this ansatz into the stationary Schrödinger equation and making approximations similar to those in the nondegenerate case (the details\nare omitted), one sees that the slow system is described by a multicomponent wavefunction ψ(R) = (ψ1 (R), . . . , ψr (R)) which is an eigenfunction of\nthe matrix-valued Hamiltonian\nH = (PI − A)2 /2M + E(R) I.\n\n(3.11)\n\nHere A(R) is the matrix-valued vector potential of (3.5) and I is the identity\nmatrix. Thus, coupling to a degenerate eigenstate introduces a generalized\n22\n\n\fform of geometric magnetism, in which the slow Hamiltonian acquires spin\ndegrees of freedom which are coupled to a Yang-Mills-like potential.\nFinally, there is a connection between the nonabelian geometric phase\nhigher-order degeneracies, ie points in parameter space where two or more\ndegenerate levels coalesce. These points act as generalized monopoles sources\nfor the nonabelian field V.\n\n3.3\n\nNonadiabatic evolution\n\nGeometric phases appear in contexts other than adiabatic evolution. An\nimportant generalization was found by Y Aharonov and J Anandan (1987),\nwho showed that geometric phases accompany any cyclic evolution, not necessarily adiabatic, of a quantum state. Subsequently, J Samuel and R Bhandari (1988) showed that geometric phases can arise in evolutions which are\nnonunitary, not cyclic, and even discontinuous. What underlies these generalizations is a natural prescription for the parallel transport of quantum\nphase factors.\nThe setting for the Aharonov-Anandan phase is quite general. A state\n|ψ(t)i evolves according to the Schrödinger equation (i~∂t − H(t))|ψi = 0\nunder a (usually) time-dependent Hamiltonian H(t). After a time T the\nstate is presumed to return to itself up to a phase factor, so that |ψ(T )i =\nexp(iβ)|ψ(0)i. In the trivial case where H is time-independent and |ψi is an\neigenstate, β is simply the dynamical phase −ET /~. Guided by this simple\ncase, we are led to subtract from β a generalized dynamical phase, namely\nthe time integral of the expectation value of energy\nZ T\nZ\n1 T\nhψ|ψ̇i dt.\n(3.12)\nhψ|H|ψi dt = Im\nβd = −\n~ 0\n0\ndefn\n\nThe phase which remains, βg = β − βd , is given by\nβg = β − βd = arg hψ(0)|ψ(T )i − Im\n\nZ\n\nT\n0\n\nhψ|ψ̇i dt\n\n(3.13)\n\nWhat makes the decomposition β = βd + βg interesting is that βg is, in a\nsense to be explained, a geometric phase. First, βg depends only on the path\nthrough Hilbert space described by |ψ(t)i, and not on the rate this path is\ntraversed. Indeed, the state |ψ̃(t)i = |ψ(τ (t))i describes the same path but,\nbecause of the reparameterization t → τ (t), at a different rate. However, it\nis easy to verify that its geometric phase βg , as given by (3.13), is the same as\n|ψ(t)i's, even though its dynamical phase is different (and it may no longer\nsatisfy the Schrödinger equation). Second, βg does not depend on the overall\nphase of |ψ(t)i. Indeed, if |ψ(t)i is replaced by |ψ̃(t)i = exp(iφ(t))|ψ(t)i in\n(3.13), a simple calculation shows that βg is unchanged. Such a substitution\ncan be useful in evaluating (3.13). As |ψ(t)i is periodic up to a phase, the\n23\n\n\fdensity matrix ρψ (t) = |ψ(t)ihψ(t)| is strictly periodic, and over the time\n0 < t < T describes a closed curve C in the space of density matrices. What\nthe preceding discussion shows is that βg is a geometric property of C. It\ndepends not on the rate with which C is traversed, and it can be computed\nwith (3.13), substituting any state |ψ̃(t)i whose density |ψ̃(t)ihψ̃(t)| is equal\nto ρψ (t).\nThe geometric phase for adiabatic cycles can be obtained as a special case of (3.13). Within the adiabatic approximation, a solution to the\nSchrödinger equation for a slowly cycled Hamiltonian H(R(t)) is given by\n|ψ(t)i = exp(iβ(t))|n(R(t))i (cf (2.3)). From (3.12), the dynamical phase\nRT\nβd is given by −1/~ 0 En (R(t))dt. The geometric phase is easily computed\nfrom (3.13) if |ψ̃(t)i = |n(R(t))i is substituted for |ψ(t)i (this is permissible,\nsince the two differ by an overall phase). Since arghn(R(0)|n(R(T ))i = 0,\nRT\nH\n ̇\nβg is given by −Im 0 hψ̃|ψ̃idt = −Im hn(R)|∇n(R)i * dR, in agreement\nwith (2.5).\nWhat underlies this general setting for the geometric phase is once more\nthe mathematics of connections and fibre bundles. However, now all of\nHilbert space is regarded as a fibre bundle! The base manifold H̄ consists\nof all pure state density matrices ρ, normalized so that Tr ρ = 1. (This\nis sometimes called the projective Hilbert space.) The fibre attached to ρ\nconsists of all state vectors |ψi whose density matrices |ψihψ| are equal to\nρ. (Thus states in the same fibre differ only by a phase factor.) To an\ninfinitesimal displacement dρ there corresponds displacements |dψi in the\nfibre satisfying |ψ+dψihψ+dψ| = ρ+dρ. With a little algebra this reduces to\n|dψi − hψ|dψi|ψi = dρ. This equation does not determine |dψi uniquely; to\nany solution can be added infinitesimal imaginary component idα|ψi along\n|ψi. A connection fixes this component and determines a particular |dψi for\na given dρ. A natural choice is to require that\nhψ|dψi = 0.\n\n(3.14)\n\nThis connection is precisely the condition (2.2) found by Berry for adiabatic\ncycles, but now generalized to arbitrary cycles in Hilbert space. Its holonomy\nis precisely the geometric phase βg (3.13).\nThis setting admits further generalizations. For example, one can calculate a geometric phase for a nonunitary evolution |φ(t)i, for which hφ|φi is no\ndefn\n\nlonger constant, simply by evaluating (3.13) with |ψ(t)i = |φ(t)i/[hφ|φi]1/2 .\nIn fact, one can calculate a geometric phase for an open path |ψ(t)i,\nwhere |ψ(T )i and |ψ(0)i are no longer proportional. The formula (3.13) for\nβg can be computed for open paths, and the result does not depend on the\nparameterization in time of |ψ(t)i, and remains unchanged by the change of\nphase |ψ(t)i → exp(iφ(t))|ψ(t)i. Further insight into the interpretation of\nthe geometric phase for open paths is given in the following Section 3.4.\n\n24\n\n\fThere is also a discrete version of the formula (3.13). Given a sequence of\nstates |ψ1 i, |ψ2 i, . . . |ψN i, one can associate a phase according to the formula\nβg = arghψ1 |ψ2 ihψ2 |ψ3 i . . . hψN |ψ1 i.\n\n(3.15)\n\nOne sees easily that βg does not depend on the overall phases of the states\n|ψj i. If there are just two states, then βg = arg |hψ1 |ψ2 i| = 0 identically.\nBut if N > 2, the phase βg is typically nonvanishing. Note that |ψN i need\nnot be proportional to |ψ1 i – the sequence of states need not close on itself.\nThe formula (3.15) is the discrete analogue of (3.13), and defines a geometric phase for discontinuous evolutions. Thus, a geometric phase can be\ndefined for processes which include measurements and wavefunction collapse.\nA version of formula (3.15) appears in work of Pancharatnam in optics, in\nwhich |ψj i represent polarization states. Panchartnam's contributions are\ndiscussed in Section 5.2.\n\n3.4\n\nGeometric metric tensor\n\nHow close are two quantum states |ψi and |φi? The usual quantum mechanical measure of distance is the Hilbert space norm ||ψ−φ|| of their difference.\nThere is another, first introduced by J Provost and G Vallee (1980), namely\nthe quantity 1 − |hψ|φi|2 /hψ|ψihφ|φi. Clearly this vanishes if the states are\nthe same. What distinguishes it from the Hilbert space norm is that it is\nunchanged if |φi or |φi are multiplied by a complex scalar. In fact, what\nthis quantity really describes is the distance between their normalized density matrices ρψ = |ψihψ|/hψ|ψi and ρφ = |φihφ|/hφ|φi, and indeed can be\nalternatively expressed as 1 − Tr ρψ ρφ . For infinitesimally displaced states\n|φi = |ψ + dψi, a little algebra gives\nhdψ|I − ρψ |dψi\n1\nhdψ|dψi hdψ|ψihψ|dψi\n=\n−\n= − Tr (dρψ )2 .\n2\nhψ|ψi\nhψ|ψi\n2\nhψ|ψi\n(3.16)\nThis quantity defines a metric on the space of normalized density matrices\nH̄ (or equivalently, the projective Hilbert space).\nThe quantum metric enters into the analysis of the geometric phase in a\nnumber of interesting ways. Below we describe two aspects: a deeper understanding of the geometric phase for open paths, and physically significant\ncorrections to the Born-Oppenheimer approximation.\nThe quantum metric determines geodesics, ie curves ρ(s) which minimize, or at least render stationary, the distance between two given density\nmatrices in H̄. These are most easily described in terms of their corresponding state vectors; it may be shown that if |ψ(s)i satisfies d2 |ψi/ds2 + |ψi = 0\nand if |ψ(0)i, |ψ ′ (0)i are normalized and orthogonal to one another, then the\ncurve ρψ (s) = |ψ(s)ihψ(s)| is a geodesic with respect to the metric (3.16),\ndefn\n\nds2 (dψ) =\n\n25\n\n\fand the parameter s along the curve is its arclength. (The solutions |ψ(s)i\nare of the form cos s |ψ(0)i + sin s |ψ ′ (0)i.)\nA simple illustration is provided by two-state systems. In this case, H̄\nmay be identified with the unit sphere (in the context of polarization optics,\nthis is the Poincaré sphere – see Section 5.2); each density matrix ρ may be\nexpressed in the form (I + ê.σ)/2, where ê is a unit vector and σ are the\nPauli matrices. The quantum metric (3.16) reduces to the usual metric on\nthe sphere (up to a scalar factor), and the geodesics are the arcs of great\ncircles.\nAs shown in the previous Section 3.3, geometric phases can be defined\nvia (3.13) for open as well as closed paths in H̄. The two cases may be related as follows. An open path P may be closed by joining its endpoints with\na geodesic. The resulting closed path, it turns out, has the same geometric\nphase as P . The geometric phase for continuous and discontinuous evolutions, (3.13) and (3.15), may be similarly related; given a closed sequence of\ndensity matrices ρ1 , ρ2 , . . . ρN , ρ1 , we can construct a closed polygonal path\nρ(s) in H̄ by connecting its points with geodesics. ρ(s) turns out to have\nthe same geometric phase as the discrete sequence ρj .\nThe quantum metric also plays a role in the Born-Oppenheimer description of the dynamics of a slow system coupled to a fast one (cf Section 2.7).\nThere it appears\nin the slow Hamiltonian as an additional scalar potential\nP\n2 (|∇ n(R)i)/2M , which produces a 'geometric electric'\n(ds\nΦn (R) =\nα\nα\nforce. The scalar potential appears at a higher order of adiabatic expansion\nthan the vector potential An (R); with appropriate scalings,\nthe geometric\np\nmagnetic force Ṙ × Vn is of the order of the square root m/M of the mass\nratio of the fast and slow systems, whereas the \"geometric electric force\"\n−∇Φ is of the order m/M . However, the electric force can become significant in the vicinity of degeneracies R∗ (ie, points where the fast energy level\nEn (R) becomes degenerate). There the force is repulsive, and so tends to\nsteer the slow dynamics away from points where the Born-Oppenheimer approximation would break down. A discussion of the scalar potential can be\nfound in the reviews of Berry (1989) and Jackiw (1988). Additional terms\nin the slow dynamics of comparable order to geometric electricity have been\nanalyzed by Weigert and Littlejohn (1993).\n\n3.5\n3.5.1\n\nBeyond adiabaticity\nCorrections to the geometric phase\n\nFor the adiabatically cycled eigenstates described by Eq. (2.3), the dynamical and geometric phases are but the first two terms in an asymptotic expansion for the total phase. An elegant iterative scheme for evaluating higher\norder corrections was developed by MV Berry (1987c). These corrections to\nthe geometric phase turn out to be geometric phases themselves. The full\n\n26\n\n\fasymptotic series diverges in a manner which reveals in a fundamental way\nthe breakdown of the adiabatic approximation.\nThe method is illustrated by the example of a spin-1/2 particle in a\nmagnetic field (cf Section 2.3). We consider a time-dependent Hamiltonian H0 (τ ) = 21 μB0 (τ ) * σ, cyclic over the infinite interval [−∞, ∞] with\nB0 (±∞) = B∗ ẑ. B0 (τ ) is analytic, and we assume that B0 (τ ) ≥ Bmin\nfor all τ , so that the Hamiltonian does not pass through any degeneracies.\nτ = ǫt is a dimensionless time, and ǫ a small parameter (with dimensions\nof frequency) describing the slow rate of change of the Hamiltonian. (The\ncorresponding dimensionless small parameter is δ = ǫ~/μBmin .)\nLet us consider the evolution of a spin state |ψ(t)i with initial condition\n|ψ(−∞)i = |−i. The analysis is facilitated by transforming to a rotating\nframe in which the direction b̂0 of the magnetic field is fixed (say, for definiteness, along z). Such a frame is described by a rotation matrix R0 (τ )\nsatisfying\nb̂0 (τ ) = R0 (τ ) * ẑ.\n(3.17)\nThis condition does not determine R0 (τ ) uniquely, but only up to a rotation\n(applied from the left) about b̂0 . Differentiating with respect to τ (this is\ndenoted by a dot  ̇), we obtain a condition\n ̇\nb̂0 (τ ) = ω 0 (τ ) × b̂0 (τ )\n\n(3.18)\n\nP\non the angular velocity ω 0 of the frame, where ω0i = 21 jkl ǫijk R0kl Ṙ0jl\n(ǫijk is the Levi-Cevita symbol). (3.18) does not determine ω 0 uniquely,\nbut only up to its component along b̂0 . We fix this indeterminacy (and the\ncorresponding indeterminacy in R0 ) by requiring that\nω 0 * b̂0 = 0.\n\n(3.19)\n\n(3.19) is a condition for parallel transport, analogous to the requirement of\nmoving your arm without unnecessarily twisting your wrist (cf Section 3.1).\nIn the rotating frame, the Hamiltonian H1 (τ ) is given by 21 μB1 (τ ) * σ,\nwhere\nB1 (τ ) = B0 (τ )ẑ − BL1 (τ )\n(3.20)\n\nis the effective magnetic field. BL1 (τ ) = ǫ~/2μ R−1\n0 (τ ) * ω 0 (τ ) is the Larmor\nfield induced in the rotating frame (the magnetic analogue of the Coriolis\nforce). As the rotation is slow, the Larmor field is small (of order ǫ), and in\nthe lowest order adiabatic approximation (cf Sections 2.1, 2.2) it is simply\nneglected. Then H1 (τ ) is diagonal, and the time-dependent Schrödinger\nequation is easily solved. The geometric phase γ− (C0 ), half the solid angle\nof the cycle C0 described by B0 (τ ), appears as a direct consequence of the\nparallel transport condition (3.19) when the solution is transformed back to\nthe fixed frame.\n27\n\n\fIf the Larmor field is not neglected, then B1 (τ ) may be regarded as a\nslowly-varying magnetic field to which the above procedure may be applied\nas before. That is, we transform to a second rotating frame R1 (τ ) in which\nb̂1 (τ ) is fixed along z. The frame is uniquely determined by imposing the\nparallel transport condition ω 1 * b̂1 = 0. Note that because b̂1 differs from\nẑ by terms of order ǫ, the angular velocity ω1 is of order ǫ. In this second\nframe, H2 (τ ) = 12 μB2 (τ ) * σ, where the effective magnetic field B2 (τ ) is\ngiven by B1 σz − BL2 (τ ), with BL2 (τ ) = ǫ~/2μ R−1 (τ ) * ω 1 (τ ). The new\nLarmor field BL2 is of order ǫ2 .\nIt is easy to see that this procedure can be performed iteratively; we\ncan transform through successive rotating frames Rn (τ ) to compensate the\nLarmor fields BLn (τ ) induced in the preceding ones. The geometric phase\nand its corrections emerge when the sequence of rotations is unravelled and\nthe solution transformed back to the fixed frame. One obtains a formal\nseries\n∞\nX\nγ− (C0 ) +\nγ− (Ck ),\n(3.21)\nk=1\n\nin which the corrections to the geometric phase are themselves geometric\nphases; γ− (Ck ) is half the solid angle of the cycle Ck described by Bk (τ ).\nIt turns out that the series (3.21) is divergent. Although successive\ncycles Ck initially decrease in extent by a factor of ǫ, asymptotically the\nterms γ− (Ck ) behave as ǫk k!, a form characteristic of divergent asymptotic\nseries (Dingle 1973). An optimal approximation is obtained by truncating\nthe series at its smallest term k ∼ 1/ǫ, for which ǫk k! ∼ exp(−1/ǫ) is\nexponentially small.\nThat the series (3.21) diverges can be understood on general grounds.\nIf, on the contrary, the series converged, along with the infinite sequence of\nrotating frames, than upon transforming back to the fixed frame, we would\nobtain an exact solution |ψ(t)i of the Schrödinger equation which would begin and end, at t = −∞ and t = +∞ respectively, in the spin-down state\n|−i. This would imply a vanishing transition probability h+|ψ(+∞)i. But it\nis known that, with the exception of some special Hamiltonians, the transition probability is not zero, but instead (for B0 (τ ) analytic) is exponentially\nsmall, of order exp(−1/ǫ) (Dykhne 1962). These exponentially small transitions (the subject of the following section) signal the ultimate failure of the\nadiabatic approximation, and cannot be captured by the iterative scheme.\nIt follows that this scheme must inevitably diverge.\n3.5.2\n\nThe geometric amplitude\n\nAdiabatic evolution is an approximation. For typical slowly varying Hamiltonians H(τ ), where τ = ǫt, no matter how small the rate of change ǫ,\nthere are transitions between evolving eigenstates. The transition probabil-\n\n28\n\n\fity vanishes as ǫ goes to zero, and if H depends analytically on τ it does so\nexponentially rapidly (faster than any power of ǫ).\nIn a study of adiabatic evolution in two-state systems, MV Berry (1990b)\nfound that this transition probability may contain a geometric factor. The\nsetting is similar to that of the preceding Section 3.5.1. We consider a\ntwo-state Hamiltonian H(τ ) = R(τ ) * σ, where R(τ ) is analytic in the dimensionless time τ = ǫt and is nonvanishing for real τ . As τ → ±∞, R(τ )\napproaches limiting values R±∗ which need not coincide, so that R(τ ) need\nnot be closed. From (2.3), the adiabatic solution for the up-state is given\nby |ψ(t)i = exp(iδ+ (t) + iγ+ (t))| + (R(τ ))i, where the eigenstates | ± (R)i\nare given by (2.14) and the evolving dynamical and geometric phases δ+ (t)\nand γ+ (t) are given explicitly by\nZ τ\nZ\n1 τ\n1\nR(τ ) dτ, γ+ (t) = −\n(1 − cos θ)φ̇ dτ.\n(3.22)\nδ+ (t) = −\nǫ~ 0\n2 0\nHere (R, θ, φ) denote the polar coordinates of R(τ ), and the dot  ̇ denotes the\nderivative with respect to τ . We have used (2.15) for the vector potential\nA+ (R).\nNonadiabatic transitions may be attributed to roots of R(τ ) in the complex τ -plane. The dominant contribution to the transition amplitude comes\nfrom the root τc closest to the real axis. (We assume τc is a simple zero of\nR2 (τ ), so that it is a square-root branch point of R(τ ).) Davis and Pechukas\n(1977) showed that the transition amplitude may be obtained by analytically continuing the adiabatic solution around the branch point τc . (Under\nthis continuation, the up- and down-states |+(R(τ ))i and |−(R(τ ))i are interchanged.) The transition probability P+− = |h−(R(∞))|ψ(∞)i|2 is given\nby a product of factors exp(−|∆+ |) exp(Γ+ ), whose exponents are obtained\nfrom the analytical continuation of the dynamical and geometrical phases.\nExplicitly, we have that\nZ τc\nI\n1\n4\nR(τ ) dτ, Γ+ = − Im cos θ dφ.\n(3.23)\n∆+ (t) = Im\n~ǫ\n2\n0\nIn the expression for Γ+ , the contour is taken round the cut joining τc and\nits complex conjugate τc∗ .\nThe factor exp(Γ+ /2) is the geometric amplitude. It depends only on\nthe cycle followed by R(τ ), not on the slowness parameter ǫ nor on ~. It\ncan be shown to vanish if R(τ ) lies in a plane, or if R(τ ) can be rotated into\nitself about an axis through the origin. Thus it vanishes for the well-known\nLandau-Zener model R(τ ) = (a, a, Aτ ) (Zener 1930), for which R(τ ) describes a vertical line. A simple example with nonzero geometric amplitude\nis R(τ ) = (a cos(ωτ 2 ), a sin(ωτ 2 ), Aτ ). It describes a helix on the cylinder\nof radius a which winds for τ < 0 and unwinds for τ > 0. For this curve Γ+\nis given by −a2 ω sgn A/A2 .\n29\n\n\fThe geometric amplitude was observed by Zwanziger et al (1991) in a\nnuclear magnetic resonance experiment (cf Section 6.2). A time-dependent\nspin Hamiltonian with the requisite properties was generated by applying a\nmodulated rf magnetic field to a sample of spin-1/2 nuclei, and the induced\nmagnetization was observed in a rotating frame. The logarithm of the transition probability P+− was plotted as a function of the slowness parameter\nǫ. Theory predicts that this plot should be linear (due to the dynamical\namplitude) with a nonzero intercept (due to the geometric amplitude). This\nbehaviour was confirmed in the experiment, with good quantitative agreement between the observed and predicted value of Γ+ .\n\n4\n\nClassical Systems\n\nFollowing Berry's discovery of the geometric phase, JH Hannay (1985) found\nan analogous phenomenon in classical mechanics. Adiabatically cycled classical oscillators undergo a shift in their phase of oscillation. Part of this\nshift is simply the time integral of the frequency. But there appears in addition a purely geometrical contribution, now known as the Hannay angle.\nThe Hannay angle includes and generalizes such well-known phenomena as\nthe precession of the Foucault pendulum. In many cases it may be directly\nobserved. The Hannay angle emerges as the classical (~ → 0) limit of the\nBerry phase (in cases where chaos is absent from the classical dynamics).\nIn the context of coupled systems, it leads to classical geometric magnetism\nin the slow dynamics.\nF Wilczek and A Shapere (1989b-1989d) studied phenomena in classical\nkinematics similar to the Hannay angle. A simple example is the manner\nin which falling cats and platform divers change their spatial orientations\nthrough a cycle of internal motions. Provided their (conserved) angular momentum is zero, the change in their orientation does not depend on the rate\nat which the internal motions are performed. Classical geometric phases\nof this type have been investigated systematically by J Marsden, R Montgomery and coworkers (Marsden et al. 1991, Marsden 1992) as part of a\ngeneral theory of Hamiltonian dynamics with symmetry.\n\n4.1\n4.1.1\n\nThe Hannay Angle\nThe Classical Adiabatic Theorem\n\nImagine a swinging pendulum slowly shortened to half its original length.\nDuring this process, is anything conserved, either exactly or approximately?\nThis question is addressed by the classical adiabatic theorem. While energy\nis not conserved (work is being done), there is an approximately conserved\nquantity, the classical adiabatic invariant, the action.\n\n30\n\n\fThe classical adiabatic theorem is most simply described for systems\nof one degree of freedom, so we concentrate on this case. The dynamics\nin the two-dimensional phase plane is described by Hamilton's equations\nq̇ = ∂p H, ṗ = −∂q H. The classical Hamiltonian H(q, p, R) is taken to\ndepend on parameters R (like the quantum Hamiltonians of Section 2). If\nthese are held fixed, then energy is conserved, and orbits lie on contours\nof H. Let us assume the motion is bounded, so that the energy contours\nare closed. The orbits go round them periodically with oscillation frequency\nω = (∂E I)−1 , where\nZ\n1\ndq dp\n(4.1)\nI(E, R) =\n2π H(q,p,R≤E\nis the action. Apart from the factor of 2π, it is just the area enclosed by the\norbit of energy E. If the parameters vary in time, then energy is no longer\nconserved. However, if the variation is slow compared to the oscillation\nfrequency ω, then the action (4.1) is nearly conserved, and the variation of\nthe energy is determined implicitly by\ndefn\n\nI(E(t), R(t)) = I0 = I(E(0), R(0)).\n\n(4.2)\n\nThis is the classical adiabatic theorem.\nIn higher dimensions, the classical adiabatic theorem generalizes provided the dynamics is either integrable or ergodic. Integrable systems are\ncharacterized by a high degree of symmetry. They possess N independent\nconstants of the motion (where N is the number of degrees of freedom) which\nare in involution (that is, the Poisson bracket between any pair of them vanishes). Typical orbits in an integrable systems execute periodic or quasiperiodic motion on N -dimensional tori embedded in the 2N -dimensional phase\nspace, and the equations of motion may be solved more or less explicitly.\nIn sharp contrast stand the ergodic systems, for which energy is the only\nconstant of the motion. Typical orbits cover the (2N − 1)-dimensional energy surface uniformly, so that time averages and microcanonical ensemble\naverages coincide. The adiabatic theorems in higher dimensions are rather\nmore difficult to state and considerably harder to prove. The difficulty is\nrelated to the fact that the adiabatic invariants are not as well conserved as\nin the one-dimensional case (Lochak and Meunier 1988).\n4.1.2\n\nBasic account of the Hannay angle\n\nThe classical adiabatic theorem (4.2) determines the time evolution of the\nenergy of a one-dimensional oscillator under a slowly changing Hamiltonian.\nJ Hannay (1985), motivated by Berry's analysis of the quantum geometric\nphase, asked a more refined question: what is the evolution of the phase of\noscillator?\n31\n\n\fTo frame this question precisely we introduce canonical coordinates, the\naction-angle variables (θ, I). These are related to q, p by a canonical transformation q = q(θ, I, R), p = p(θ, I, R) which depends on parameters. The\naction I, the generalized momentum, determines the energy of the orbit\naccording to (4.1). The angle θ, the generalized coordinate, describes the\nphase of the oscillator, and varies periodically around the orbit with period\n2π. Expressed in terms of action-angle variables, the Hamiltonian H(I, R) is\nindependent of θ, so the canonical equations of motion, θ̇ = ∂I H, I ̇ = −∂θ H,\ndefn\nimply that I is constant while θ evolves at a constant frequency ω = ∂I H.\nNow suppose the parameters R of the Hamiltonian are taken slowly\nround a closed cycle C, returning to their original values R(0) after a time\nT . Since the action is nearly conserved, a trajectory returns approximately\nto the contour of H(I, R(0)) that it started on. Of course, it will be displaced\nby an angle ∆θ along the orbit from its initial position. Hannay obtained\nthe two dominant contributions to ∆θ (the corrections are of order 1/T).\nRT\nThe first is the dynamical angle θd = 0 ω(I, R(t))dt. It is simply the\ntime integral of the frequency, taking into account its slow variation with\nparameters. The second, unexpected, contribution,\nI\n∂\nA(I, R) * dR,\n(4.3)\nθg (I, C) = −\n∂I C\nis the geometric angle, or the Hannay angle. It is expressed in terms of the\nline integral of a vector field A(I, R) given by\nA(I, R) =\n\n1\n2π\n\nZ\n\n2π\n\np(θ, I, R)∇q(θ, I, R) dθ.\n\n(4.4)\n\n0\n\nThe Hannay angle is geometric in the same sense as the geometric phase; it\ndepends only on the parameter cycle C, and not on the rate it is traversed.\nUsing Stokes'Rtheorem, the Hannay angle can also be expressed as the surface\nintegral −∂I S V(I, R) * dS, where S is a surface bounded by C and V =\n∇ × A. From (4.4),\n1\nV(I, R) =\n2π\n\nZ\n\n0\n\n2π\n\n∇p(θ, I, R) × ∇q(θ, I, R) dθ.\n\n(4.5)\n\nAs with the geometric phase, the presence of time-reversal symmetry (cf\nSection 2.5) imposes constraints on the Hannay angle. In particular, if the\norbits themselves are time-reversal symmetric (for all values of parameters),\nthen the Hannay angle vanishes identically.\nLike the geometric phase, the Hannay angle may be interpreted as the\nholonomy of a connection on a fibre bundle (cf Section 3.1.3). The parameters R constitute the base manifold, and the fibres attached to them are\norbits of the Hamiltonian H(q, p, R) with given action I. These orbits are\n32\n\n\fparameterized by the angle θ, and the connection ∂I A(I, R) describes how\nθ changes under parallel transport.\nThe Hannay angle can be detected by determining the initial and final\nangles of an adiabatically cycled oscillator, and subtracting from their difference the dynamical angle θd . As θd depends only on the parameter cycle\nR(t), it can be computed without solving the equations of motion explicitly. In this way, Hannay's analysis, together with the adiabatic theorem\n(4.2), provides a complete asymptotic solution of the equations of motion\nfor slowly varying Hamiltonians in one dimension. The analysis generalizes\ndirectly to integrable systems in higher dimensions, where there are as many\nHannay angles as there are degrees of freedom. However, detecting them can\nbe a more delicate matter, as the adiabatic theorem and corrections thereto\nbecome more complicated in higher dimensions (Golin et al. 1989). For ergodic systems, there is no general analogue of the Hannay angle, though a\nrelated holonomy phenomenon emerges in some special cases (Robbins 1994,\nJarzynski 1995, Schroer 1996).\n4.1.3\n\nExamples\n\nA bead moving freely round a planar wire loop provides a simple example\nof the Hannay angle. Suppose the bead has unit mass, and the loop has\ncircumference C, area A, and is otherwise arbitrary in shape. While the\nsystem as a whole has time-reversal symmetry, the individual orbits do not\n(they are either clockwise or counterclockwise). The action I is just the\nvelocity v, and the angle θ = 2πs/C is proportional to the distance s along\nthe wire. Suppose the loop is slowly rotated once around an interior point\nover a time T , and let ∆s denote the total distance the bead has travelled\nduring this time. The dynamical contribution sd (which is C/2π times the\ndynamical angle θd ) is just vT (the adiabatic theorem implies v is nearly\nconstant). The geometric contribution sd may be computed to be −4πA/C 2 .\nIt accounts for the distance the bead has slipped as the wire turned. For a\nfixed circumference C, sd assumes its maximal value, C, for a circular loop;\nin this case, the bead simply slips a full revolution. For thin, elongated\nloops, sd approaches zero; the only slippage occurs at the hairpin turns.\nThe second example is the family of harmonic oscillators H = (Z −\nX)p2 /2 + Y pq + (Z + X)q 2 , where the term in qp breaks time-reversal symmetry. For X 2 + Y 2 < Z 2 , the motion is bounded and oscillatory, and we\nconsider adiabatic cycles confined to this region of parameter space. The\nflux field V of (4.5) may be computed to be\nV(I, R) = −\n\nR\nI\n.\n2\n2 (Z − X 2 − Y 2 )3/2\n\n(4.6)\n\nNote that because V is linear in I, the Hannay angle θg is independent of\nI. θg may be described geometrically as follows. We regard the parameter\n33\n\n\fspace as three-dimensional Minkowski space, in which X and Y are spacelike coordinates, Z is time-like, and the region X 2 + Y 2 < Z 2 is the interior\nof the light-cone. Then θg (C) is the area of the projection of the closed\ncurve C onto the unit mass shell Z 2 − X 2 − Y 2 = 1.\nThe precession of a Foucault pendulum is yet another example of a Hannay angle. Consider a spherical pendulum initially set to oscillate in a plane.\nDuring the course of a day, the axis of gravity (whose direction represents\nthe parameters of the pendulum) is carried once round a line of latitude\nα. At the day's end, the plane of oscillation has turned through an angle\n2π(1−cos α). This is just the solid angle described by the axis of gravity, and\nmay be computed as a Hannay angle using (4.3). In fact, the phenomenon\ndescribed by the Hannay angle is more general. If one could adiabatically\nbut otherwise arbitrarily turn the earth around, returning it to its original\norientation, the plane of oscillation of the spherical pendulum would still\nprecess through an angle equal to the solid angle subtended by the earth's\naxis. The spherical pendulum is a two-degree of freedom system, integrable\nbecause of its axial symmetry. Therefore, it has two Hannay angles, one\neach for its polar and azimuthal degrees of freedom. For planar oscillations,\nhowever, only the azimuthal Hannay angle, which describes the Foucault\nprecession, is nonzero.\nLet us briefly mention two final examples drawn from plasma physics\nand astronomy, respectively. Littlejohn (1988) found a Hannay angle in the\ncyclotron oscillations of charged particles in strong magnetic fields. Berry\nand Morgan (1996) (see also Golin et al. (1989)) compute \"the Hannay\nangle of the world\", an annual displacement of the earth along its orbit of\napproximately −150 meters (or −2 × 10−4 seconds of arc) caused by the\nadiabatic and periodic variation of Jupiter's gravitational field.\n4.1.4\n\nSemiclassical limit\n\nFollowing Hannay's work, Berry (1985) showed that the Hannay angle emerges\nin the semiclassical limit of the geometric phase. The precise relation between the two is given by\n~→0,n→∞\n\nγn+1 (C) − γn (C) −−−−−−−→ θg (I, C),\nn~=I\n\n(4.7)\n\nin which classical action is related to the quantum number by the semiclassical quantization condition I = n~. (4.7) conforms to the usual relation\nbetween quantum phases and classical angles, a more familiar instance being the relation (En+1 − En )/~ → ω between energy levels and frequencies,\nwhose time integral connects the dynamical phase and the dynamical angle.\nThe result (4.7) is derived by substituting the WBK approximation for the\neigenstates |n(R)i into the formula (2.4) for the quantum vector potential\nAn . One obtains thereby the expression (4.4) for the classical vector poten34\n\n\ftial. This analysis extends to integrable systems in more than one dimension,\nfor which semiclassical eigenfunctions may be similarly determined.\nOn the other hand, for systems whose classical dynamics is chaotic, the\nquantum geometric phase has no classical limit in general. However, the\nvector field Vn , when averaged over quantum number, does have a classical\nlimit (Robbins and Berry 1992), which turns out to play a role in the classical\nBorn-Oppenheimer approximation (cf Section 4.1.5). The classical limit\n\u0013\n\u0012\nZ ∞\n1\nV (E, R) = −\nh∇Ht (q, p, R) × ∇H(q, p, R)i dt\n∂E ∂E Ω(E, R)\n2∂E Ω(E, R)\n0\n(4.8)\nis expressed in terms of the time integral of an antisymmetric correlation function\nR of the parameter gradient of the Hamiltonian, ∇H(q, p, R).\nΩ(E, R) = H(q,p,R)≥E dN qdN p denotes the phase volume inside the energy\nshell H = E, h*i denotes the normalized microcanonical average on the energy shell, and ∇Ht denotes the function ∇H evolved for a time t with the\nclassical dynamics. In one dimension, (4.8) is equivalent to (4.5).\n4.1.5\n\nClassical reaction forces\n\nAs in Section 2.7, we suppose the parameters R are no longer externally\nprescribed, but instead are the coordinates of a slow system to which the\noriginal one, the one-dimensional oscillator of Section 4.1.1, is coupled. Both\nsystems are governed by classical mechanics. We take their Hamiltonian to\nbe P 2 /2M + H(q, p, R), where P is the slow momentum. The Hannay angle\ndescribes a holonomy in the fast dynamics induced by the slow dynamics.\nAs in the quantum case, there is a reciprocal effect on the slow dynamics\ninduced by the fast dynamics. This effect is found by averaging over the fast\nmotion. According to the adiabatic theorem, the action of the fast system\nis nearly constant. In the lowest order approximation, we treat the action\nas strictly constant. Then the energy H(I, R) acts as an potential in the\nslow dynamics, whose effective Hamiltonian is given by P 2 /2M + H(I, R).\nThis is the classical analogue of the Born-Oppenheimer approximation.\nFirst-order corrections account for the fluctuations of the action about\nits mean. These generate an effective vector potential in the slow Hamiltonian, so that P → P − A(I, R). The vector potential is precisely the field\n(4.4) whose line integral gives the Hannay angle. This is classical geometric\nmagnetism.\nOne example of geometric magnetism is the precession of a symmetric top\n(Berry and Robbins 1993a). In this case, the top's axis is the slow system,\nand the rotation about this axis is the fast system. Another example from\nplasma physics is the drift of the guiding centre of electrons in strong, slowlyvarying magnetic fields (Littlejohn 1988). The guiding centre, ie the centre\nof the instantaneous Larmor orbit, constitutes the slow degrees of freedom\n35\n\n\f(it remains fixed in constant fields), and the motion about the guiding centre,\nthe fast degree of freedom.\nGeometric magnetism generalizes to higher dimensional fast systems,\nboth integrable and chaotic. In the latter case, geometric magnetism is\npartnered by an additional dissipative force, deterministic friction; the slow\ndynamics is no longer conservative, as the chaotic motion of the fast system\nacts as an effective heat bath. The magnetic and dissipative forces appear\nas the antisymmetric and symmetric parts of a linear response tensor (Berry\nand Robbins 1993b, Jarzynski 1993).\n\n4.2\n\nSymmetry and kinematic geometric phases\n\nKinematic geometric phases arise in systems with symmetry. They describe\nthe evolution in degrees of freedom which the symmetry acts upon (eg,\norientational degrees of freedom in case of rotational symmetry). Their\nstructure depends only on how the symmetry is realized, and not on the\ndetails of the dynamics. The geometric character of their evolution is exactly\nenforced by the equations of motion, and does not depend on assumptions of\nadiabaticity. In the following sections, two different treatments of kinematic\ngeometric phases are described.\n4.2.1\n\nFalling cats and swimming paramecia\n\nEven with nothing to push against, bodies in free fall, such as cats and platform divers, can change their orientation through internal motions. Perhaps\ncounterintuitive at first, this phenomenon is a direct conseqence of conservation of angular momentum, and can be calculated as such. The main\ndifficulty in doing so is in the definition of the body's orientation. This\nproblem does not arise for truly rigid bodies, whose every configuration is\nrelated to a chosen reference by a unique rotation. But for an body which\ncan bend and twist and stretch, ie which has internal degrees of freedom, it\nis not clear which configurations are \"upright\" and which ones are \"tilted\".\nThere are various prescriptions for determining orientation. One is to refer to the orientation of the principal axes of inertia. Another is through the\nEckart frame, a common convention in molecular physics. Both presciptions\nhave particular advantages; neither is well defined in all cases.\nIn fact, the structure of the solution emerges most clearly if the definition\nof orientation is made more or less arbitrarily. This is the point of view taken\nby Shapere and Wilczek(1989b). For simplicity, suppose the body consists\nof a finite number N of masses mα at positions rα . No assumption is made\nconcerning their dynamics, except that they obey Newton's laws and that\nthere are no external forces. By choosing\na suitable\nreference frame, we may\nP\nP\nassume that the centre of mass α mα rα / α mα begins and remains at\nthe origin.\n36\n\n\fBy some means, certain configurations (R1 , . . . , RN ) are designated to\nbe \"upright\". This designation must be consistent, in that if two configurations are related by a rotation, then only one of them can be upright. It\nmust also be complete, so that every configuration can be made upright by\napplying a rotation. If both these conditions hold, then every configuration\n(r1 , . . . , rn ) can be obtained by applying a unique rotation R to a unique\nupright configuration (R1 , . . . , RN ). The body's motion,\nrα (t) = R(t) * Rα (t),\n\nα = 1, . . . , N\n\n(4.9)\n\nis then determined by the evolution of its orientation R(t) and its internal\ndynamics R1 (t), . . . , RN (t). In the language of rigid body dynamics, Rα (t)\ndescribes the motion in the body frame, and rα (t) the motion in the space\nframe.\nAn object fixed in the space frame appears to rotate with angular velocity\n−Ω(t) in the body frame. Ω(t) is defined by the relation\nṘ * R = R * (Ω × R),\n\n(4.10)\n\nwhich can be made to hold for arbitrary vectors R.\nRegardless\nof the details of the dynamics, the total angular momentum\nP\nl = α mα rα × vα in the space frame must be conserved. Conservation of\nangular momentum leads to the relation\n!\nX\n−1\n(4.11)\nmα Rα × Vα\nΩ(t) = I * L −\nα\n\nbetween the angular velocity Ω, angular\nmomentum L = R−1 * l, velocities\nP\nVα = R ̇α , and inertia tensor Iij = α mα (Rα2 δij − Rαi Rαj ) in the body\nframe. Given the internal dynamics Rα (t), the relations (4.10) and (4.11)\nmay be used to determine the orientation R(t).\nThe case of zero angular momentum (l = L = 0) is particularly interesting. Then one can show that the orientation R(t) does not depend on\nthe rate of the internal dynamics. (One can, in effect, multiply through\nby dt in (4.10) and (4.11).) In particular, if the internal motion is periodic along a cycle C, then after one period it generates an overall rotation\nRg = R(T )R(0)−1 of the body. The rotation Rg depends only on the cycle\nC, and not on the rate it is traversed. It is a purely geometrical quantity, a\nnonabelian analogue (rotations do not commute) of the Hannay angle. It is\nthe means by which a cat dropped upside-down manages to land on its feet.\nLike the other geometric phases considered so far, this can be described\nin terms of holonomy on a fibre bundle. The fibre bundle is the configuration\nspace of the masses mα , constrained to have centre of mass at the origin.\nThe base manifold consists of the distinct internal configurations, no two\nof which can be made to coincide by a rotation. (Mathematically, this is\n37\n\n\fthe quotient of the configuration space by the rotation group.) It can be\nparameterized by the upright configurations, provided these are always welldefined. The fibre consists of the different possible orientations of a given\ninternal configuration, and may be parameterized by the rotation group.\nA connection determines an infinitesimal rotation δR for an infinitesimal\nchange of internal configuration δRα , and the physically relevant connection\nis determined by conservation of angular momentum. Parallel transport\nround a closed cycle C in the base yields the holonomy Rg . The curvature\nof this connection, which describes the net rotation after an infinitesimal\ncyclic change of shape, may be computed using a formula analogous to\n(3.8).\nThe designation of upright configurations is arbitrary, and one can always\nchoose them differently. It can be verified that the holonomies Rg do not\ndepend intrinsically on this choice, and that the various quantities which\ndescribe the orientation transform sensibly when a different choice is made.\nIn particular, the curvature and connection transform according to equations\nsimilar to (3.10).\nA more complex example studied by Shapere and Wilczek(1989c) concerns swimming through viscous fluids at low Reynolds number. High viscosity and low velocity means that bodies remain at rest unless acted upon\nby a force – a realization of Aristotelian mechanics! Bodies locomote by\nexecuting a series of internal motions, ie swimming strokes. Conservation of\nlinear and angular momentum determine the consequent changes in position\nand orientation, but now the motion of the fluid must be taken into account.\nSolving the fluid dynamical problem leads to a relation similar to (4.11) for\nboth the linear and angular velocity in terms of rates of change of shape.\nApplications in biology include locomotion of microrganisms.\n4.2.2\n\nGeometric phases and reduction\n\nKinematic geometric phases can be framed in terms of the general theory of\nsymmetry in Hamiltonian systems, called reduction. This formulation, extensively developed by J Marsden, R Montgomery and coworkers (Marsden\net al. 1991, Marsden 1992), has led to a unified perspective on a variety of\ngeometric phase phenomena as well as a number of interesting examples.\nDynamics is simplified by the presence of symmetry, and Hamiltonian\ndyanamics especially so. A symmetry always reduces the dimension of a\ndynamical system by one, but in the Hamiltonian case, it reduces it by two.\nIndeed, when there is sufficient symmetry, the systems are integrable, and\nthe dynamics can be solved analytically (cf Section 4.1.1).\nThe simplest symmetry is translation invariance in an ignorable coordinate qN . Hamilton's equation ṗN = −∂H/∂qN = 0 (more generally,\nNoether's theorem) implies that the conjugate momentum pN is conserved.\nFixing its value pN = pN 0 leads to a Hamiltonian H(q1 , . . . , qN −1 , p1 , . . . , pN −1 , pN 0 )\n38\n\n\fin two fewer variables. Once their dynamics is obtained, the evolution of the\nignorable coordinate may be determined by integrating Hamilton's equation\nq̇N = ∂pN H(q1 , . . . , qN −1 , p1 , . . . , pn−1 , pN 0 ). The theory of reduction extends this analysis to general symmetries. As in the simple example, the\nanalysis consists of two stages. The first is reduction, wherein the conserved\nmomenta are fixed, the ignorable coordinates ignored, and Hamilton's equations expressed in terms of a reduced set of coordinates. In all but the\nsimplest cases, finding these coordinates is a nontrivial task (Jacobi's \"elimination of the node\" in the rotationally symmetric N -body problem is a\nrepresentative example.) The second state is reconstruction, wherein the\nevolution of the ignorable coordinates is determined from the reduced dynamics. It is in the reconstruction stage than kinematic geometric phases can\nappear. It turns out that the equations of motion for the ignorable coordinates can be separated into dynamical and geometric terms. The geometric\nterm depends only on the path described by the reduced dynamics, and not\non the rate it is traversed. The dynamical term, by constrast, does depend\non the rate. Moreover, the form of the geometrical term depends only the\nrealization of the symmetry, and not on the details of the Hamiltonian.\nIn the example discussed in the preceding section, the flexible body composed of N point masses, the ignorable coordinates correspond to R, the\nbody's orientation, the conserved momentum to the space-fixed angular momentum l, and the internal coordinates Rα (t) to the reduced system. The\nevolution of R(t) is obtained by integrating the linear system (4.10), in\nwhich angular velocity Ω(t) is given in terms of the reduced dynamics by\n(4.11). Eq. (4.11) is an example of a reconstruction formula divided into\n−1\nits dynamical and geometric parts.\nP The first term, I * L, is the dynamic\n−1\ncontribution. The second, I *( α mα Rα ×Vα ), is the geometric contribution. As discussed above, its integral depends only on the path C described\nby the internal dynamics Rα (t).\nR Montgomery (1991) found an even simpler example in the dynamics\nof a free rigid body. Its configuration (with its centre of mass fixed at\nthe origin) is described by a rotation R, for which it will be convenient to\nuse the Euler angle parameterization, R = Rz (φ)Ry (θ)Rz (ψ). The spacefixed angular momentum l is a constant of the motion, and without loss of\ngenerality we can assume it lies in the z direction. The body-fixed angular\nmomentum L(t) = R(t) * l has polar coordinates (θ(t), φ(t)) on the sphere\nof constant radius radius L = |L| = |l|. Its dynamics is determined by the\nEuler equations L̇ = Ω × L, where Ω = I −1 * L is the angular velocity and I\nis the inertia tensor. The Euler equations describe the reduced dynamics, in\nwhich L, or equivalently θ and φ, are the reduced coordinates. The ignorable\ncoordinate is ψ.\nUnder the Euler equation, L executes a periodic motion with period T .\nThe fact that L(T ) = L(0) implies that rigid body returns after one period\nto its original orientation, up to a rotation about the direction L(T ). Indeed,\n39\n\n\fone has that R(T ) = R(0)Rz (∆ψ) = RL(T ) (∆ψ)R(0), so that the amount\nof rotation, ∆ψ = ψ(T ) − ψ(0), is just the shift in the ignorable coordinate\nψ. With a little algebra, the equation of motion for ψ may be written in the\nform\nψ̇ = 2E + cos θ φ̇,\n(4.12)\nwhere E = 21 L * I −1 * L is the conserved rotational energy. (4.12) is another\nexample of a reconstruction formula divided into dynamical and geometric contributions. In this case, the dynamical contribution integrates to\nH2ET , where as the geometric contribution gives (modulo 2π) the solid angle\nC cos θdφ described by the body-fixed angular momentum L(t) over a single\nperiod.\nAnother example, due to Alber and Marsden (1992), concerns phase\nshifts in soliton collisions. A spectacular property of certain nonlinear partial\ndifferential equations, such as the Korteweg-de Vries equation Ut + 6U Ux +\nUxxx = 0, is the existence of solitons. These are waveforms U (x − vt) which\npropagate at a fixed velocity v whilst maintaining their shape, the nonlinearity in the wave dynamics just balancing the dispersion. When two solitons\ncollide, they emerge after a complicated but transient period of interaction\nessentially intact. The only signature of their collision is a shift ∆x in their\nposition x ± ∆x − vt (+ for the faster soliton, − for the slower one). This\nshift, which may be determined from an asymptotic analysis of the exact\nsolutions, can be interpreted as a geometric phase. The same analysis applies to a variety of other integrable nonlinear partial differetial equations,\nincluding the nonlinear Schrödinger equation and the Klein-Gordan equation.\n4.2.3\n\nOptimization and control\n\nThe study of kinematic geometric phases suggests a problem in optimization.\nWhat is the most efficient internal motion for producing a given holonomy?\nAs a specific example, consider a satellite orbiting the earth in a fixed orientation, so that its angular momentum about its centre of mass is zero. It\nis desired to change its orientation using as little energy as possible. The\nobvious method of applying external torques (supplied by jets attached to\nsatellite, for example) has the drawback that any uncompensated force or\ntorque leaves the satellite in a state of translation or rotation. The alternative is execute a sequence of internal motions (eg, flywheels driven by motors,\nfor example); in the manner described above, these generate a change the\norientation without altering the total linear or angular momentum.\nThe problem of finding the most efficient cycle with a given holonomy\nleads to a constrained variational problem in the internal degrees of freedom.\nIt may also be formulated in terms of control theory. The solution depends\nvery much on how efficiency is measured. In certain circumstances, it may\nbe advantageous to make some sizeable internal motions initially in order\n40\n\n\fto achieve a configuration for which the geometric phase curvature form (cf\nSection 3.1.2) is large; then much smaller subsequent motions can produce\nrelatively large effects. In other situations, it may be necessary to restrict\nto small motions about some equilibrium configuration; in this case, the\nvariational problem may be analyzed in terms of infinitesimal circuits. The\nsolutions often have a physical interpretation in terms of motion in a magnetic, or more generally, a Yang-Mills field. Shapere and Wilczek (1989d)\nfind efficient swimming strokes through viscous media in two- and threedimensions under various conditions. Marsden (1992) describes a number\nof other examples.\n\n5\n\nOptics\n\nOptics has provided fertile ground for studying the geometric phase. (For a\nrecent comprehensive survey of experimental activity, see Bhandari (1996)).\nMost investigations have concentrated on polarization effects. The polarization of a beam of monochromatic, coherent light behaves like a quantum\nmechanical spin, and under cyclic evolutions (and noncyclic ones as well) acquires a geometric phase similar to that of a spinning particle in a magnetic\nfield (cf Section 2.3) There are various ways to change polarization. One\nis by varying the direction of propagation, as the polarization vector must\nremain transverse to it (Tomita and Chaio 1986); in this case the polarization has a spin-1, or vectorial character. Another is through optical activity\ninduced by anisotropic media, in which case the polarization has a spin-1/2\ncharacter (Pancharatnam 1956, Bhandari and Samuel 1988, Bhandari 1988).\nA beam of light passing through a cycle of polarization states may be recombined with a second beam whose polarization has remained unchanged.\nTheir total phase difference (dynamical + geometrical) can be determined,\nfor example, from their interference pattern. In certain cases, the dynamical\nphase shift can be made to vanish. In others, it can be explicitly computed\nand subtracted from the total phase. In either case, one obtains a measurement of the geometric phase.\n\n5.1\n\nGeometric phase of coiled light\n\nIn a straight, single-mode optical fibre of circular cross-section, there is\nno preferred polarization; whatever the polarization state of the source,\nit is preserved along the fibre. This is no longer so if the fibre is made\nto bend and wind; then the polarization must change in order to remain\ntransverse to the axis of propagation t̂. Provided the radius of curvature\nR = ||dt̂/ds||−1 is large compared to the wavelength λ (here s measures\ndistance along the fibre), then the polarization vector d̂(s) of the electric\ndisplacement D(s, ρ) = Re ei(2πs/λ−ωt) f (ρ)d̂(s) (where f (ρ) is the radial\n\n41\n\n\fmodal profile) evolves along the fibre according to\ndd̂\n= −(t̂.d̂).t̂.\nds\n\n(5.1)\n\nThe corrections to this approximate solution of Maxwell's equations are of\norder λ/R.\nFor a general elliptical polarization, d̂ is complex. Within the adiabatic\napproximation, both its real and imaginary parts d̂r and d̂i remain orthogonal to the direction of propagation t̂, and each satisfies (5.1) separately.\nAs a function of s, t̂(s) describes a curve C on the unit sphere, and the\nvectors d̂r (s) and d̂i (s) are tangent to the sphere at t̂(s). Equation (5.1) is\nthe condition for their parallel transport. (Infinitesimal parallel transport of\na tangent vector d̂ at t̂ to a tangent vector d̂ + dd̂ at t̂ + dt̂ is accomplished\nby rigidly transporting d̂ to t̂ + dt̂, and then projecting the result onto the\ntangent plane there.) If the curve C is made to close on itself, the vectors d̂r\nand d̂i return rotated through an angle θg equal to the solid angle subtended\nby C. θg is the geometric phase, depending only on the geometry of C.\nTomita and Chiao (1986) observed this effect by introducing linearly\npolarized light from a He-Ne laser into a length of helically wound optical\nfibre whose initial and final directions coincided. The direction of linear\npolarization of the emergent beam was measured and found to have turned\nthrough an angle equal to the solid angle subtended by the cycle of directions. The experiment was performed with helices of both fixed and variable\npitch, as well as for fibres constrained to lie in the xy plane. In this last\ncase, the cycle of directions lies on the equator of the unit sphere, and the\nsubtended solid angle is a multiple of 2π. As predicted, the direction of its\nlinear polarization remains unchanged.\nThe original analysis of the Tomita-Chiao experiment was based on quantum mechanical considerations, treating a photon propagating in the fibre\nas a spin-one particle whose helicity s.t̂ is constrained to be ±1. (Classically\nthis corresponds to left- and right-circularly polarized light.) Just as a spin\nwith nonzero magnetic moment tracks the direction of a slowly changing\nmagnetic field (cf Section 2.3), the helicity tracks the direction of propagation t̂, and acquires a geometric phase equal to the solid angle described by\nt̂. By decomposing a linear polarization into a superposition of left- and\nright-circular polarizations, the observed rotation of linear polaration may\nbe recovered.\nA systematic derivation, however, requires more detailed analysis, and\nthis is most easily carried out within the context of classical (rather than\nquantum) electromagnetic theory. Indeed, the essential features of such an\nanalysis are contained in early work by SM Rytov (1938) and VV Vladimirsky\n(1941), who derived and interpreted the parallel transport law (5.1) for polarization in the geometric optics limit (see (Berry 1990) for a discussion).\n\n42\n\n\fStrictly speaking, geometrical optics is not appropriate for single-mode fibres (the transverse wavelength is comparable to the fibre diameter). Berry\n(1987a) has carried out a classical analysis using the full Maxwell equations,\nand it is the conclusions of this analysis which are presented above.\nKitano et al. (1987) performed an experiment related to Tomita and\nChiao's, in which the cylic change in the direction of propagation was accomplished nonadiabatically through a series of discrete reflections from\nmirrors. These reflections reverse helicity instead of conserving it, and the\ncalculation of the geometric phase must be appropriately modified.\n\n5.2\n\nPancharatnam's phase\n\nWhen light passes through a homogeneous medium, its direction of propagation remains constant. However, if the medium is optically anisotropic, the\npolarization can change. Such changes in polarization are accompanied by\na geometric phase, discovered in this context by S. Pancharatnam in 1956.\n(See (Berry 1987b) for a contemporary discussion of Pancharatnam's work.)\nFor definiteness we consider plane electromagnetic waves propagating in the\nz direction with\n√ fixed wavenumber k and frequency ω. The electric field\nE(r, t) = Re Iei(kz−ωt) |Ai is described by the intensity IA and normalized\npolarization vector |Ai = (Ax , Ay ), whose complex components determine\nthe phase and relative intensity along x and y. (Dirac notation is used for\ncomplex two-vectors to highlight an analogy below with two-state systems.)\nGiven two such waves, what is their relative phase? Unless their polarization states |Ai and |Bi happen to be proportional, it is not clear that the\nquestion is a sensible one. Pancharatnam found a natural and physically\nrelevant prescription for their√phase difference\nby considering the intensity\n√\nIA+B of their superposition, IA |Ai + IB |Bi. This is given by\np\n(5.2)\nIA+B = IA + IB + 2 IA IB Re hA|Bi.\n\nFor fixed individual intensity IA and IB , the superposed intensity depends\nonly on the interference term, and is maximized when hA|Bi = 1. This is\nPancharatnam's criterion for polarizations being in phase. More generally,\nthe relative phase between two polarizations is taken to be arghA|Bi (this is\nwell-defined unless |Ai and |Bi are orthogonal). It is the amount by which\nthe phase of one polarization must be retarded relative to the second in\norder that the intensity of their superposition be a maximum.\nBeing in phase is not a transitive relation; if |Ai is in phase with |Bi,\nand |Bi in phase with |Ci, then, in general, |Ci is not in phase with |Ai.\nThe nontrivial relative phase arghC|Ai has a simple geometrical interpretation. To every polarization state |Ai we associate a vector eA on the unit\nsphere, namely its spin expectation value hA|σ|Ai (a unit vector) rotated\nthrough π/2 about the y-axis. This is how polarization is represented, up\nto an overall phase factor, on the Poincaré sphere. The y-rotation, a matter\n43\n\n\fof convention, puts the left and right circular polarizations at the north and\nsouth pole of the Poincaré sphere, and the linear polarizations at the equator. (In more mathematical language, the Poincaré sphere is the projective\nHilbert space for two-state systems – cf Section 3.3.)\nOne can show that the relative phase arghC|Ai is equal to minus half\nthe solid angle subtended by the spherical triangle eA eB eC on the Poincaré\nsphere, constructed by joining A, B and C with arcs of great circles. A direct\ndemonstration (Pancharatnam's) uses formulas from spherical trigonometry. Another way is to realize that a sequence of polarization states |ψ(t)i\nparallel-transported according to (3.14) along great circles on the Poincaré\nsphere are, according to Pancharatnam's criterion, in phase with each other.\nThus arghC|Ai is precisely the geometric phase accumulated under parallel\ntransport round eA eB eC , for which the half-solid-angle formula is discussed\nin Section 2.3.\nTo establish a connection between the geometry and an observable effect,\nan analysis of the physical polarization dynamics is required. Pancharatnam\nconsidered systems of ideal polarizers, or analyzers, which completely transmit a polarization state eA and completely absorb the state −eA orthogonal\nto it in such a way that the incident and transmitted states are always\nin phase. Ideal polarizers are nearly approximated by very thin polarizing plates. (Mathematically they are represented the hermitian projection\noperator |AihA|.) Therefore, if a polarization cycle is generated by ideal\npolarizers, one may conclude that the initial and final polarizations differ by\nPancharatnam's phase.\nPolarization cycles can also be generated by ideal retarders; these are\nperfectly transparent devices which introduce a relative phase difference between two given orthogonal polarization states eA and −eA . A particular\nexample is a quarter-wave plate, for which the orthogonal states are linearly polarized and the phase difference is π/2. (Mathematically, they are\nrepresented by exp(−iea * σ/2), a two-dimensional unitary matrix with determinant one.) Polarization cycles generated by ideal retarders produce\na dynamical phase in addition to Pancharatnam's phase. The dynamical\nphase is easily calculated, however.\nFinally, one can consider optical activity generated by a transparent,\nbirefringent gyrotropic medium, which generates relative phase differences\nbetween orthogonal polarization states whose orientation varies with position. When the variation is sufficiently slow over a wavelength, a beam\nremains in a polarization state determined by the locally uniform dielectric\ntensor. Berry (1987b) applied an adiabatic analysis to Maxwell's equations\nfor this system and calculated the phase for a polarization cycle generated\nby a spatially periodic medium. The underlying structure is identical to a\nspin-1/2 particle in a slowly changing magnetic field (Section 2.3). There is\na dynamical phase and a geometric phase, and the geometric phase is just\nPancharatnam's.\n44\n\n\fObservations of Pancharatnam's phase are based on two-beam interferometry. Such experiments were initiated by Pancharatnam himself, though\ncurrent versions are greatly improved with the availability of laser sources.\nSchematically, a plane wave with polarization |Ai is split into two coherent\nbeams which propagate along the arms of an interferometer. Beam 1 propagates freely, while beam 2 passes through a sequence of optical elements\nwhich induce a polarization cycle. The beams are then recombined, and\ntheir total relative phase determined from their interference. Differences in\ndynamical phases are determined and subtracted, and the geometric phase\nsubsequently measured.\nBhandari (1988) uses laser interferometry methods to measure changes\nin the geometric phase, rather than the geometric phase itself. These are\nreadily generated (while keeping the relative dynamical phases fixed) by\ncontinuously rotating a half-wave plate in the polarization cycle.\nKwiat and Chiao (1991) observed Pancharatnam's phase in single-photon\ninterference experiments using a source of two-photon entangled states. One\nphoton, the idler, passed through a narrow-band energy filter to a detector. Observation of this photon fixed the energy of its partner, which was\nmade to pass through an interferometer as above. Detection rates varied in\naccordance with the intensity, which depends directly on Pancharatnam's\nphase. Various coincidence detectors were used to confirm that genuine\nsingle-photon interference was being observed.\nFinally, Berry and Klein (1996) perform a modern version of Pancharatnam's experiment, measuring relative phase by direct observation of the\ninterference fringes. They also investigate the relation between discrete and\ncontinuous polarization cycles by varying the number of optical components.\n\n6\n\nMolecular and Condensed Matter Physics\n\nSeveral applications of the geometric phase to molecular spectroscopy (Section 6.1), nuclear magnetic resonance (Section 6.2), and the quantum Hall\neffect (Section 6.3) are discussed. Amongst a number of applications which\nhave been omitted from discussion, we mention λ-doubling of rotational\nlevels in diatomic molecules (Moody et al. 1986), and atomic and reactive\nmolecular scattering (Mead and Truhlar 1979, Zygelman 1987, Mead 1992,\nKuppermann and Wu 1993).\n\n6.1\n\nPseudorotation in triatomic molecules\n\nOrdinarily, the angular degrees of freedom of a spinless system have integer\nquantum numbers. This is because, ordinarily, the angular momentum Lφ\nconjugate to an angle φ is taken to be −i~∂φ ; its eigenfunctions exp(iνφ)\nare single-valued only if ν is an integer. The Aharonov-Bohm effect (cf\nSection 2.2) provides an exception. In the presence of a magnetic flux line\n45\n\n\fon the z axis, with flux αhc/e, the azimuthal angular momentum of an\nelectron is given by −i~∂φ +α, the constant term α coming from the magnetic\nvector potential A(s) (ρ, φ, z) = α/ρ φ̂. Therefore, the eigenvalues of Lφ are\nno longer integral multiples of ~, but are given by instead by (m + α)~,\nwhere m is integral.\nAs discussed in Section 2.7, there emerges in the Born-Oppenheimer approximation a molecular analogue of the Aharonov-Bohm effect. For a given\nelectric state |ni, the nuclear configuration space is threaded by a magnetic\nflux concentrated at points where |ni is degenerate. This flux appears in\nthe nuclear Hamiltonian as a geometric vector potential (2.4). As discussed\nby Mead (1992), a triatomic molecule X3 composed of identical atoms (eg,\nalkali metal trimers such as Na3 ) provides a simple class of examples. A\nstriking consequence of the molecular Aharonov-Bohm effect is the appearance of anomolous half-integer quantum numbers. Their existence has now\nbeen confirmed experimentally (Delaćratez et al. 1986). While this phenomenon had been antipated by Longuet-Higgens et al. (1958), it is most\nnaturally understood in the context of the geometric phase.\nThe nuclear configuration space for a triatomic molecule has nine degrees\nof freedom. Six correspond to overall translational and rotational motion,\nwhich can be ignored in this discussion, leaving three internal vibrational\ndegrees of freedom. These may be parameterized by the internuclear distances R12 , R23 , R13 . Thus, the internal nuclear configuration space Q is\nthe space of noncongruent triangles (the Rij 's determining the lengths of\nthe triangle's sides) with vertices distinguished.\nIn the Born-Oppenheimer approximation, the electronic energy levels\nand eigenstates are regarded as functions on the internal configuration space\nQ. Assuming the molecular Hamiltonian has time-reversal symmetry, we expect degeneracies of the electronic states to lie along one-dimensional curves\nin Q (cf Section 2.5).\nIt turns out that some of these degeneracies can be determined by symmetry considerations alone. For equilateral configurations R12 = R23 =\nR13 = a, the nuclear configuration is invariant under the dihedral group D3\nof symmetries of the equilateral triangle. Therefore, the electronic eigenstates |n(a, a, a)i must transform according to an irreducible representation,\nor irrep, of D3 (Tinkham 1964). The group D3 has two one-dimensional\nirreps, associated with states which are either invariant or else change sign\nunder the symmetry operations, and a two-dimensional irrep, associated\nwith a degenerate pair of states which transform into each other under the\nsymmetry operations. Therefore, if |p(a, a, a)i transforms according to the\ntwo-dimensional irrep, then |p(R12 , R23 , R13 )i is necessarily degenerate along\nthe curve R12 = R23 = R13 = a (with a > 0) in Q. Under parallel-transport\nround this curve (cf (2.2)), |pi changes sign.\nOne might expect the energy Ep (R12 , R23 , R13 ) of this state to assume\n\n46\n\n\fits minimum in an equilateral configuration. The Jahn-Teller effect (Jahn\nand Teller 1937) shows this is not the case. It turns out to be energetically\nfavourable for the molecule to assume an asymmetrical configuration, so\nthat when it is in its p-electronic state, the ground vibrational state of the\nmolecule is distorted.\nTo analyze the vibrational motion, it is useful to introduce cylindri2 +\ncal coordinates (ρ, φ, z) in Q. The vertical coordinate z, given by R12\n2 + R2 , determines the length scale; oscillations in z describe uniform\nR23\n13\ndilations and\nof the nuclei. The radial coordinate ρ, given\n√ contractions √\n2 + ( 3 − 1)R2 − ( 3 + 1)R2 , describes the degree of distortion;\nby 2R12\n23\n13\nρ = 0 corresponds to equilateral configurations. Thus, it is along the z axis\nthat the electronic\n|p(ρ, φ, z)i is degenerate. The azimuthal angle φ,\n√ state\n−1\n2 )/(2R2 − R2 − R2 )], describes the direction\n2\ngiven by tan [ 3(R23 − R13\n13\n23\n12\nof the distortion. Displacements in φ are called pseudorotations. A 2πpseudorotation returns the nuclei to their original positions, while a 2π/3\nrotation induces a cyclic permutation amongst them.\nA systematic calculation of the vibrational Hamiltonian Hvib requires\nan explicit expression for the electronic energy Ep (R12 , R23 , R13 ) along with\na careful derivation of the kinetic energy in the (ρ, φ, z) coordinates. Such\na treatment is described by Mead (1992); however, for this discussion an\napproximate form will suffice. The potential is taken to be harmonic in z\nand ρ and independent of φ, and the kinetic energy to be of the standard\nform. Thus\nHvib =\n\nL2φ\np2ρ\n1\n1\np2z\n+\n+ M ωρ2 (ρ − ρ0 )2 + M ωz2 (z − z0 )2 ,\n+\n2\n2M\n2M ρ\n2M\n2\n2\n\n(6.1)\n\nwhere (ρ0 , φ0 ) denotes the asymmetrical configuration which minimizes Ep .\nThe vibrational energy levels are characterized by three quantum numbers\nj, m, k, for the respecive degrees of freedom ρ, φ, z. They are given approximately by\n(m~)2\n1\n1\n+ (k + )~ωz ,\nE(j, m, k) = (j + )~ωρ +\n2\n2I\n2\n\n(6.2)\n\nwhere the azimuthal moment of inertia I is taken to be M ρ20 (the approximation consists of ignoring the dependence of I on the radial quantum number\nj).\nThe presence of the electronic degeneracy along the z axis introduces\na geometric vector potential Ap = αφ̂/ρ into the nuclear Hamiltonian,\nwhich accounts for the sign change of the electronic eigenstate under parallel\ntransport. (In the chosen coordinates, α = 23 .) Its effect is to replace the\npseudoangular momentum operator Lφ = −i~∂φ by −i~∂φ + 32 ~, just as in\nthe magnetic Aharonov-Bohm effect. Thus, the pseudorotational quantum\nnumber m in (6.2) is half-integral.\n47\n\n\fThe half-integral quantization of pseudorotation was confirmed in a systematic spectral analysis of the vibrational spectrum of Na3 be G Delacretez,\nER Grant, RL Whetten, L Wöste, and JW Zwanziger (1986). A sequence\nof rovibrational levels corresponding to radial and pseudorotational motion\nwere identified. It was found that the observed spectrum could be fitted to\n(6.2) only by assigning half-integer quantum numbers to the pseudoangular momentum. The result is an excellent agreement between observed and\ncalculated energy levels.\n\n6.2\n\nNuclear magnetic resonance\n\nAn rf magnetic field applied to polarized spins generates transitions between\ntheir stationary states. When the field is in resonance with the spin precession frequency, the transition probabilities can become large, even though\nthe rf field may be weak. Transitions are manifested in oscillations of the spin\nmagnetic moment, whose amplitude and frequency can be measured with\ngreat accuracy. This is the basis for nuclear spin resonance experiments.\nIn nuclear magnetic resonance (NMR), the nuclear spins are polarized by\na static magnetic field. In nuclear quadrupole resonance (NQR), the spins\nare polarized by an electric field gradient (in the ambient crytalline potential, for example) which couples to the spin though the nuclear quadrupole\nmoment.\nMoody et al. (1986) and Cina (1986) pointed out that cyclic variations\nin the rf field would generate geometric phases in the nuclear spins, which\ncould be detected as shifts in the frequency spectrum of the nuclear magnetic\nmoment (this is an example of the third type of experiment described in\nSection 2.6). Pursuing this suggestion, several groups have carried out NMR\nstudies of the geometric phase, including its adiabatic (Tycho 1987, Suter\net al. 1987), nonadiabatic (Suter et al. 1988), and nonabelian (Zwanziger et\nal. 1990b) versions. These experiments have not only confirmed theoretical\npredictions, but have also brought to light interesting new phenomena in\nNMR spectroscopy.\nIn an NMR experiment, the nuclear spins (let s = 1/2, say) are initially\npolarized by a strong static magnetic field Bz ẑ; the spin eigenstates |±i\nhave energies ±~ω0 /2, where ω0 = γBz is the Larmor frequency and γ\nthe gyromagnetic ratio. For nonstationary states, the magnetic moment\nM(t) = ~γhψ(t)|σ|ψ(t)i/2 precesses about ẑ at the Larmor frequency, so\nthat its frequency spectrum has a single peak at ω0 .\nA weak, circularly polarized rf field, Brf (t) = Bx cos ωtx̂ + By sin ωtŷ,\nis then applied. (Weak means that Brf ≪ Bz ). The subsequent dynamics\nis most easily analyzed in a rotating frame turning about ẑ with angular frequency ω. There the effective magnetic field Brot is static, and the\n\n48\n\n\fHamiltonian is given by\n1\nHrot = γ~Brot * σ,\n2\n\nBrot = (Bx x̂ + By ŷ + (Bz − ω/γ)ẑ) .\n\n(6.3)\n\nThe spin eigenstates |±irot in the rotating frame are polarized along Brot\nwith energies ±~ωrot /2, and the magnetic moment Mrot (t) precesses about\nBrot with frequency ωrot, where ωrot = γBrot . Near resonance, where ω ≈\nω0 , the axis of precession is nearly perpendicular to ẑ (even though Brf ≪\nBz ).\nThe magnetic moment M(t) in the laboratory frame is obtained by turning Mrot (t) through an angle −ωt about ẑ. The effect of the rf field is to\nsuperpose a slow longitudinal nutation (of frequency ωr ) on the fast Larmor\nprecession of M(t) about ẑ (of frequency ω0 ). In consequence, the frequency\nspectrum of the magnetic moment has additional peaks at ω0 ± ωrot .\nThe Hamiltonian Hrot of (6.3) depends parametrically on the components of the rf and static magnetic fields, Bx , By and Bz , and vanishes for\nBx = By = 0 and Bz = ω/γ. If these components are slowly modulated\nthrough a cycle C, with a period T much greater than the precession period\n2π/ωrot in the rotating frame, then the eigenstates |±irot of Hrot evolve adiabatically, and acquire with each modulation cycle a geometric phase γ± (C)\ngiven by half the solid angle, α, described by C with respect to (0, 0, ω/γ) (cf\nSection 2.3). These geometric phases produce shifts ∓ 21 ~α/T in the energies\n± 21 ~ωrot of the unmodulated Hamiltonian Hrot , and in turn shift the precession frequency of the magnetic moment from ωrot to ωrot − α/T . (This shift\nis the magnetic analogue of the daily precession of the Foucault pendulum\ndiscussed in Section 4.1.3.)\nThese frequency shifts were observed by D Suter, GC Chingas, RA Harris, and A Pines (1987) in the NMR response of proton spins in a water/acetone sample. The adiabatic cycle C was produced by placing the\nmagnetization detector in a frame rotating with angular frequency ωdet\nabout ẑ. In the detector frame, the effective magnetic field turns about\nẑ with angular frequency δ = ω − ωdet ; for small enough δ, the spins adiabatically track the turning field. A variation of this experiment was subsequently performed by D Suter, KT Mueller, and A Pines (1988), in which\nthe geometric phase was observed as a rotation in the spin-echoed magnetic\nmoment. This technique enabled observation of the individual geometric\nphases γ± rather than the difference γ+ − γ− . The spins were taken through\nnonadiabatic cycles, thereby incorporating the Aharonov-Anandan phase (cf\nSection 3.3).\nIn a nuclear quadrupole resonance experiment, the spin polarization is\ninduced by an inhomogeneous electric field rather than a static magnetic\nfield. Gradients in the electric field couple to spin through the nuclear\nelectric quadrupole moment. The effective spin Hamiltonian is of the form\nHQ = ~ωQ (S * n̂)2 , where S denotes the dimensionless spin operators and n̂\n49\n\n\fthe symmetry axis of the electric field gradient tensor (assumed to be axially\nsymmetric). The eigenstates |m(n̂)i are polarized along n̂ with energies\n~ωQ m2 . Note that these are doubly degenerate for m 6= 0.\nGeometric phase effects in the NQR spectrum of 35 Cl (for which s = 3/2)\nwere studied by R Tycko (1987). In the experiment, a coherent superposition\nof eigenstates of HQ was created at t = 0 by an rf pulse; the induced\nmagnetic moment M(t) was then observed and spectrally analyzed. The\nspectrum of HQ consists of two degenerate doublets with energies 49 ~ωQ\nand 41 ~ωQ (corresponding to m = ±3/2 and m = ±1/2 respectively), so\nthat the magnetic moment spectrum has a single peak at frequency 2ωQ .\nAdiabatic cycling of HQ was achieved by rotating a crystalline sample of\nNaClO3 with angular frequency ωR ≪ ωQ about an axis inclined to the\nsymmetry direction n̂. With each rotation, the spin eigenstates acquire\ngeometric phases βm (these may be computed explicitly), which shift their\nenergies by ~βm ωR /2π and lift the double degeneracies. For the particular\ngeometry realized in Tycko's experiment, theory predicts that the single\npeak in the√magnetic moment spectrum is split into three at frequencies 2ωQ\nand 2ωQ ± 3ωR /π. Precisely this splitting was observed in the experiment.\nSince HQ has degenerate energy levels, one might expect nonabelian\ngeometric phases (cf Section 3.2) to appear. As shown by Tycko (1987) and\nsubsequently by A Zee (1988), the experiment can be analyzed completely\nin terms of the ordinary (abelian) geometric phase. The nonabelian vector\npotentials A(±3/2) and A(±1/2) of (3.5) (there is one for each degenerate\ndoublet of HQ ) can be evaluated explicitly; they involve matrix elements\nof the spin angular momentum between degenerate states. For m = ±3/2,\nthe off-diagonal matrix elements vanish identically (S has nonzero matrix\nelements only between states with m differing by one), and the diagonal\nmatrix elements yield the ordinary geometric phases β±3/2 . For m = ±1/2,\nthese off-diagonal elements do not vanish. However, for the adiabatic cycles\nused in the experiment, in which n̂ is turned about a fixed axis, a basis for\nthe m = ±1/2 doublet can found which diagonalizes A(±1/2) . During the\ncycle there are no transitions between these basis vectors, and each acquires\nan ordinary geometric phase β±1/2 .\nZee (1988) shows that more general adiabatic cycles of n̂ generate genuine nonabelian geometric phases in the NQR spectrum. JW Zwanziger, M\nKoenig and A Pines (1990b) performed an experiment to observe these nonabelian effects. The more complicated adiabatic cycles were generated by\nmounting the NaClO3 crystal on a double rotor. Careful analysis predicts\nthat the NQR resonance should be split into five peaks instead of three.\nThis is precisely what was observed, with excellent quantitative agreement\nbetween theory and experiment.\n\n50\n\n\f6.3\n\nThe quantum Hall effect\n\nCharged particles in crossed uniform electric and magnetic fields experience\na net drift along the direction E×B normal to both – this is the basis for the\nHall effect. The Hall effect concerns specifically the behaviour of electrons\nin a planar conductor to which a perpendicular magnetic field B = Bẑ and\na tangential electric field E = Ex̂ are applied. The resulting current density\nhas a transverse component jy = σH E. σH is the Hall conductance. Using\nclassical theory, one obtains for large magnetic fields that\nc\nσH\n≈\n\nnec\n,\nB\n\n(6.4)\n\nwhere n is the two-dimensional electron density.\n(Alternatively, one can consider conductors of finite transverse extent,\neg long thin wires. Then the current density is necessarily longitudinal,\nwhereas the electric field has a transverse component. In this case it is easier\nto compute the Hall resistance ρH = Ey /j. Classical theory gives ρcH =\nB/nec for all magnetic fields, not just large ones. The Hall conductance and\nresistance are the off-diagonal elements of the conductance and resistivity\ntensors σ and ρ = σ −1 , and the relation between them, σH = ρH /(ρ2O + ρ2H ),\ndepends on the longitudinal or Ohmic resistivity ρO .)\nFor large magnetic fields and at low temperatures, the classical prediction (6.4) fails; what is actually observed is a spectacular phenomenon, the\nquantum Hall effect. As B is increased, instead of falling off monotonically as 1/B, the Hall conductance goes through a series of plateaus where\nits value is constant, separated by intervals of monotonic decrease. These\nconstant values are sample-independent, and satisfy with extremely high\naccuracy (about one part in ten million) the quantization condition\nσH = r\n\ne2\n.\nhc\n\n(6.5)\n\nAs B increases, the coefficient r takes on integer values, and decreases with\nB in unit steps until it reaches one. This is the regime of the integer quantum\nHall effect (von Klitzing et al. 1980). As B is increased still further, one\nenters the regime of the fractional quantum Hall effect (Tsui et al. 1982); r\ntakes on rational values (< 1) with odd denominators.\nThe theory of the quantum Hall effect begins with the quantum mechanics of two-dimensional electrons in magnetic fields. The one-electron\nstationary states are the Landau levels EN = ~ωc (N + 1/2), N = 0, 1, 2, . . .,\nwhere ωc = eB/mc is the classical cyclotron frequency. The Landau levels\nare highly degenerate; each can accomodate B/Φ0 electrons per unit area\n(Φ0 = hc/e is the quantum of magnetic flux). In real materials, the crystalline potential, impurities, and electron-electron interactions all serve to\nbreak this degeneracy. However, for sufficiently large magnetic fields, there\n51\n\n\fis negligible mixing between the Landau levels, so that each is split by the\nperturbations into B/Φ0 sublevels per unit area.\nIf the electron density in the sample is n, then the ground state has the\nfirst ν = nΦ0 /B Landau levels filled, the uppermost only partially if ν has\na fractional part. (Thus, the larger the B-field, the fewer occupied Landau\nlevels.) The integer quantum Hall effect can now be explained by making\ntwo assumptions: i) only a small proportion of sublevels in each Landau\nlevel can carry current, and ii) each filled Landau level contributes precisely\ne2 /hc to the Hall conductance. Together, these imply that a nearly empty\nLandau level contributes nothing to the Hall conductance, as the occupied\nsublevels are unlikely to be the current-carrying ones, whereas, conversely,\na nearly full one contributes e2 /hc. From these qualitative considerations\nfollows σH = [ν]e2 /hc ([ν] denotes the integer nearest ν), precisely (6.5),\nwith r = [ν].\nThe first assumption can be justified on the basis of localization theory – most of the sublevels are localized, whereas only extended states can\ncarry current. For the second assumption, DJ Thouless, M Kohmoto, MP\nNightingale and M den Nijs (TKN2 ) found, in 1982, a topological explanation. In retrospect, their argument can be seen as an application of the\ntheory of the geometric phase. (Indeed, this connection was drawn as early\nas 1983 by Simon.)\nIn outline, their analysis is as follows. We consider an electron in two\ndimensions in a uniform magnetic field Bẑ and periodic crystalline potential V (x, y), with periods a and b in x and y. Because the vector potential A = (By/2, −Bx/2) is not periodic, neither is the Hamiltonian\nmv 2 /2 + V (x, y), in which v = (p + eA/c)/m is the velocity. However, the\nHamiltonian is invariant under the magnetic translation operators Tx and\nTy , which shift x and y by a and b while leaving the velocity (rather than\nthe momentum) unchanged. (Explicitly, Tx = exp(−iapx /~ + iπBay/Φ0 )\nand Ty = exp(−ibpy /~ − iπBxb/Φ0 ).)\nWhile the magnetic translation operators commute with the Hamiltonian, they do not necessarily commute with each other. In general, Tx Ty =\nexp(2πiBab/Φ0 )Ty Tx . But if we take the flux Bab through a unit cell to\nbe a rational multiple p/q of the magnetic flux quantum Φ0 , then (Tx )q –\na translation by qa in x – and Ty do commute, and Bloch's theorem applies. In this case, the energy levels form a band structure, whose bands\nǫn (k) are periodic over the first Brillouin zone [0, 2π/qa] × [0, 2π/b]. The\nstationary states ψk,n (r) are Bloch waves exp(ik.r)uk,n (r), where uk,n (r) is\nan eigenfunction of the Hamiltonian\n1\nH(k) = m(−i~∇ + eA/c + ~k)2 + V (x, y)\n2\n\n(6.6)\n\nwith energy ǫk,n satisfying the generalized periodic boundary conditions\nuk,n (x, y) = exp(iπBqay/Φ0 )uk,n (x+qa, y) = exp(−iπBxb/Φ0 )uk,n (x, y+b)\n52\n\n\fover the unit cell. (These are obeyed rather than ordinary periodic boundary conditions because we are dealing with magnetic rather than ordinary\ntranslation operators.) For convenience we will sometimes denote the indices\nn, k by a single label α.\nThe Hall conductance can now be calculated perturbatively. An applied\nelectric field Ex̂ generates perturbed eigenstates |u′α i = |uα i + |δuα i, and\ninduces transverse current densities jy = σH E. To lowest order in perturbation theory, these are given by −e * 2Re huα |vy |δα i/A0 . Here A0 is the\narea of the sample, and the transverse velocity vy = −i~∂y − eBx/c + ~ky\nincludes a contribution from the Bloch vector. Note that vy may be expressed as ∂H/∂~ky . From first-order perturbation theory, huβ |δuα i =\nhuβ | − eEx|uα i/(ǫ(α) − ǫ(β)), β 6= α. Combining these results with the\nidentity [x, H] = −i~vx , we obtain the Kubo formula\nσH =\n\nX X\nhuα |∇k H|uβ i × huβ |∇k H|uiα\ne2\nIm\nA0 ~c\n(ǫα − ǫβ )2\n\n(6.7)\n\nǫ(α)<ǫF β6=α\n\nfor the Hall conductance of the ground state. It includes contributions from\nall states below the Fermi energy ǫF .\nSuppose we regard H(k) as a family of Hamiltonians parameterized by\nthe Bloch vector k. Under parallel transport round a closed cycle C in the\nfirst Brillouin zone, the eigenstate |un,k i acquires a geometric phase γn,k (C),\nwhich may be expressed (cf Section 2.2) as the integral of the flux field\nVn (k) = Im h∇k un,k |×|∇k un,k i over the interior of C. Amongst the various\nexpressions for Vn (k) given in Section 2.2, we note that (2.10), which involves\nmatrix elements of the gradient of the Hamiltonian, is contained precisely in\nthe formula (6.7) P\nfor the\nP Hall conductance. This allows us to rewrite (6.7)\nas σH = e2 /A0 ~c n P k Vn (k). Finally, for samples large compared with\nthe unitRcell, the sum k over Bloch vectors may be replaced by an integral\nA0 /4π 2 d2 k over the first Brillouin zone. Thus we obtain\nσH =\n\ne2 X\nσn ,\nhc n\n\n(6.8)\n\nR\nwhere σn = d2 kVn k is the conductance (in units of e2 /hc) of the nth band.\nTKN2 show that σn is an integer. This follows by first noting that Vn (k)\nis periodic over the Brillouin zone (even though |un,k i is not), so that the\ndomain of the k-space integral is a closed torus Tk . Indeed, one can show that\nVn (k) is given by Im h∇k ψn,k | × |∇k ψn,k i plus a perfect curl (whose integral\nover the torus vanishes by Stokes' theorem). The Bloch states |ψn,k i are\nperiodic (up to a phase factor!) over the first Brillouin zone, and constitute\na complex line bundle (cf Section 3.1.4) over Tk with curvature Vn (k). The\nintegral over Tk of the curvature over the torus is the first Chern number, an\ninteger. For large magnetic fields, the bands coalesce into nearly degenerate\n53\n\n\fsublevels (p per band) associated with the Landau levels of a pure magnetic\nHamiltonian. One can show that sum of Chern numbers from a given Landau\nlevel is equal to one. This completes the topological explanation for the\nquantization of Hall conductance. TKN2 also calculate the Chern numbers\nfor individual sublevels, which are obtained from the solutions of certain\nDiaphontine equations in p and q.\nTKN2 was the first of a number of important applications of geometric\nphase methods to the study of the quantum Hall effect. Several subsequent\nworks address the fractional effect, where electron-electron interactions come\ninto play. Niu, Thouless and Wu (1984) show how the results of TKN2 could\nbe generalized to accomodate them. Arovas et al. (1984) calculate properties\nof the elementary excitations of Laughlin's many-body fractional-quantumHall ground state (Laughlin 1983) using geometric phase arguments. Concerning the integer case, Arovas et al (1988) establish a topological criterion\nfor localization in terms of Chern numbers. Wilkinson (1984) incorporates\nthe geometric phase into semiclassical calculations of the single-particle energy spectrum.\nFinally, we mention studies by Avron and coworkers (Avron et al. 1988,\nAvron 1995) of electron transport in quantum systems. While not specifically concerned with the quantum Hall effect, they elucidate essentially similar topological mechanisms. One class of models consists of planar networks\nof one-dimensional wires whose closed loops Ci are threaded by magnetic\nfluxes φi normal to the plane. The physical properties of the network are Φ0 periodic in the fluxes (fluxes differing by an integral number of flux quanta\nare related by a gauge transformation). Fixing all but two of the fluxes,\nthe stationary state |ψn (φi , φj )i constitute a complex line bundle over the\ntwo-torus of fluxes (the analogue of the first Brillouin zone). The associated\nChern number, the integral of the curvature, has the following physical interpretation: it represents the average with respect to φi of the number of\nelectrons transported round Ci as φj is increased adiabatically by one flux\nquantum.\nGlossary\ndynamical phase The time integral of the energy of an evolving quantum\nstate divided by Planck's constant ~.\ngeometric phase A phase factor accumulated by a cycled quantum eigenstate which depends only on the geometry of its evolution.\ngeometric magnetism Effective Lorentz-like force which appears in the\ndynamics of a slow system coupled to a fast one after the fast degrees\nof freedom have been averaged away.\n54\n\n\fHannay angle Displacement in the angle variables of adiabatically cycled\nintegrablesystems of purely geometric origin.\nholonomy Change in phase induced by parallel transport of a quantum\nstate around a closed curve.\nintegrable system A Hamiltonian system with as many constants of the\nmotion in involution as there are degrees of freedom.\nparallel transport A prescription to determine the overall phase of an\nevolving quantum state.\nreduction General theory of Hamiltonian dynamics in the presence of symmetry.\n\nReferences\n[1] Aharonov Y & Anandan J 1987 Phys. Rev. Lett. 58 145 – 148\n[2] Aharonov Y & Bohm D 1959 Phys. Rev. 115 484–491\n[3] Aitchison IJR 1987 Acta Phys. Polonica B18 207–235\n[4] Alber MS & Marsden JE 1992 Comm. Maths. Phys. 149 217–240\n[5] Arovas D, Schrieffer JR & Wilczek F 1984 Phys. Rev. Lett. 53\n722-723\n[6] Arovas DP, Bhatt RN, Haldane FDM, Littlewwod PB &\nRammal R 1988 Phys. Rev. Lett. 60 619–622\n[7] Avron JE, Raveh A, Zur B 1988 Rev. Mod. Phys. 60 873–915\n[8] Avron JE 1995 Mesoscopic Quantum Physics, Les Houches, Session\nLXI E. Akkermans et al, eds, Elsevier Science B.V., p. 741–791\n[9] Berry MV 1984 Proc. Roy. Soc. Lond A 392 45–57\n[10] Berry MV 1985 J. Phys. A 18 15–27\n[11] Berry MV 1987a Nature, Lond. 326 277–278\n[12] Berry MV 1987b J. Mod. Optics 34 1401–1407\n[13] Berry MV 1987c Proc. Roy. Soc. Lond. A 414 31–46\n[14] Berry MV 1989 Scientific American 256 no 12, 34–40\n\n55\n\n\f[15] Berry MV 1989 Geometric Phases in Physics, A Shapere & F Wilczek,\neds., Singapore: World Scientific, p. 7–28\n[16] Berry MV 1990a Physics Today December, 34–40\n[17] Berry MV 1990b Proc. Roy. Soc. Lond. A 430 405–411\n[18] Berry MV 1990 Sir Charles Frank 80th Birthday Festschrift RG\nChamber et al, eds., Adam Hilger, Bristol\n[19] Berry MV & Robbins JM 1993a Proc. Roy. Soc. Lond A 442, 641–\n658\n[20] Berry MV & Robbins JM 1993b Proc. Roy. Soc. Lond A 442, 659–\n672\n[21] Berry MV & Klein S 1996 Journal of Modern Optics 43 165-180\n[22] Berry MV & Morgan MA Nonlinearity 9 787-799\n[23] Bhandari R \"Polarization of light and topological phases\", submitted\nto Physics Reports, 1996\n[24] Bhandari R & Samuel J 1988 Phys. Rev. Lett. 60 1211–1214\n[25] Bhandari R 1988 Phys. Lett. A 133 1–3\n[26] Bitter T & Dubbers D 1987 Phys. Rev. Lett. 59 251–254\n[27] Chambers RG 1960 Phys. Rev. Lett. 5 3–5\n[28] Cina JA 1988 Chem. Phys. Lett. 132 393–395\n[29] Delacret́ez G, Grant ER, Whetten RL, Wöste L &\nZwanziger JW 1986 Phys. Rev. Lett. 59 161-164\n[30] Dingle RB 1973 Asymptotic expansions: their derivation and interpretation New York and London: Academic Press\n[31] Dirac PAM 1931 Proc. Roy. Soc. Lond. A 133 60\n[32] Dykhne AM 1962 Sov. Phys. JETP 14 941-943\n[33] Eco U 1989 Foucault's pendulum New York: Harcourt Brace Jovanovich\n[34] Eguchi T, Gilkey PB, & Hanson, AJ 1980 Phys. Rep. 66, 213-393\n[35] Golin S, Knauf A & Marmi S 1989 Comm. Math. Phys 110 33-49\n[36] Hannay JH 1985 J. Phys. A 18, 221–230\n56\n\n\f[37] Jackiw R 1988 Int. J. Mod. Phys. A3, 285–297\n[38] Jahn, HA & Teller, E 1937 Proc. Roy. Soc. Lond. A 161 220–235\n[39] Jarzynski C 1993 Phys. Rev. Lett. 71 839-842\n[40] Jarzynski C 1995 Phys. Rev. Lett. 74 1732–1735\n[41] Kuppermann A & Wu YSM 1993 Chem. Phys. Lett. 205 577-586\n[42] Kuratsuji H & Iida S 1985 Prog. Theo. Phys. 74 439–445\n[43] Kwiat PG & Chiao RY 1991 Phys. Rev. Lett. 66 88-91\n[44] Littlejohn RG 1988 Phys. Rev. A 38 6034-6045\n[45] Littlejohn RG & Flynn WG 1992 Phys. Rev. A 44 5239–5256\n[46] Laughlin RB 1983 Phys. Rev. Lett. 50 1395–1398\n[47] Li Yin & Mead CA 1992 Theor. Chim. Acta 82 397-406\n[48] Lochak P & Meunier C 1988 Multiphase averaging for classical systems. New York: Spinger\n[49] Longuet-Higgins HC, Öpik U, Pryce MHL & Sack RA 1958\nProc. Roy. Soc. 244 1–\n[50] Marsden JE, O'Reilly OM, Wicklin FJ, & Zombro BW 1991\nNonlinear Science Today 1 4–11, 14–21\n[51] Marsden JE 1992 Lectures on Mechanics Cambridge University\nPress, Cambridge\n[52] Mead CA & Truhlar DG 1979 J. Chem. Phys. 70(05) 2284–2296\n[53] Mead CA 1980 Chem. Phys. 49 23–40\n[54] Mead CA 1992 Rev. Mod. Phys. 64 51–85\n[55] Montgomery R 1991 Am. J. Phys 59 394-398\n[56] Moody J, Shapere A & Wilczek F 1986 Phys. Rev. Lett. 56 893–\n896\n[57] Nash C & Sen S 1983 Topology and geometry for physicists New York:\nAcademic\n[58] Niu Q, Thouless DJ, & Wu YS 1985 Phys. Rev. B 31 3372–3377\n[59] Pancharatnam 1956 Proc. Ind. Acad. Sci. A 44 247\n57\n\n\f[60] Provost J & Vallee G 1980 Comm. Math. Phys. 76, 289 – 301\n[61] Robbins JM & Berry MV 1992 Proc. Roy. Soc. Lond A 436, 631–661\n[62] Robbins JM 1994 J. Phys. A 27 1179–1189\n[63] Rytov SM 1938 Dokl. Akad. Nauk. USSR 18, 263; reprinted in B\nMarkovsky & VI Vinitsky, Topological Phases in Quantum Theory,\nWorld Scientific, Singapore (1989), p. 6\n[64] Samuel J & Bhandari R 1988 Phys. Rev. Lett. 60 2339 – 2342\n[65] Schroer CG 1996 J. Phys. A 29 3289-3297\n[66] Shapere A & Wilczek F (eds) 1989a Geometric phases in physics\nSingapore: World Scientific\n[67] Shapere A & Wilczek F 1989b Am. J. Phys. 57 514–518\n[68] Shapere A & Wilczek F 1989c J. Fluid.Mech. 198 557–585\n[69] Shapere A & Wilczek F 1989d J. Fluid.Mech. 198 587–599\n[70] Simon B 1983 Phys. Rev. Lett. 51 2167–2170\n[71] Suter D, Chingas GC, Harris RA & Pines A 1987 Mol. Phys. 61\n1327–1340\n[72] Suter D, Mueller KT & Pines A 1987 Phys. Rev. Lett. 60 221–223\n[73] Thouless DJ, Kohmoto M, Nightingale MP & den Nijs M 1982\nPhys. Rev. Lett. 49 405–408\n[74] Tinkham M 1964 Group theory and quantum mechanics New York:\nMcGraw Hill\n[75] Tsui DC, Stormer HL, & Gossard AC 1982 Phys. Rev. Lett. 48\n1559\n[76] Tomita A & Chiao R 1986 Phys. Rev. Lett. 57 937–940\n[77] Tycko R 1987 Phys. Rev. Lett. 58 2281-2284\n[78] Vladimirkii VV 1941 Dokl. Akad. Nauk. USSR 21, 222; reprinted in\nB Markovsky & VI Vinitsky, Topological Phases in Quantum Theory,\nWorld Scientific, Singapore (1989), p. 11\n[79] von Klitzing K, Dorda G & Pepper M 1980 Phys. Rev. Lett. 45\n494\n[80] Von Neumann J & Wigner EP 1929 Phys. Z 30 467–470\n58\n\n\f[81] Weigert S & Littlejohn RG 1993 Phys. Rev. A 47 3506-3512\n[82] Wilczek F & Zee A 1984 Phys. Rev. Lett. 52 141–144\n[83] Wilkinson M 1984 J. Phys. A 17 3459–3476\n[84] Zee A 1984 Phys. Rev. A 38 1–6\n[85] Zener C 1932 Proc. Roy. Soc. Lond. A 137 696–702\n[86] Zwanziger JW, Koenig M, & Pines A 1990a Annu. Rev. Phys.\nChem. 41 601–646\n[87] Zwanziger JW, Koenig M, & Pines A 1990b Phys. Rev. A 42\n3107-3110\n[88] Zwanziger JW, Rucker SP & Chingas GC 1991 Phys. Rev. A 43\n3232-3240\n[89] Zygelman B 1987 Phys. Lett. A 125 476–481\n\n59\n\n\f"}