{"id": "http://arxiv.org/abs/0708.4028v1", "guidislink": true, "updated": "2007-08-29T21:38:06Z", "updated_parsed": [2007, 8, 29, 21, 38, 6, 2, 241, 0], "published": "2007-08-29T21:38:06Z", "published_parsed": [2007, 8, 29, 21, 38, 6, 2, 241, 0], "title": "Spontaneous soliton symmetry breaking in two-dimensional coupled\n  Bose-Einstein condensates supported by optical lattices", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0708.2704%2C0708.0714%2C0708.2396%2C0708.1610%2C0708.4343%2C0708.0848%2C0708.3039%2C0708.4182%2C0708.0792%2C0708.3669%2C0708.1346%2C0708.4311%2C0708.4024%2C0708.2068%2C0708.3171%2C0708.2633%2C0708.3679%2C0708.4384%2C0708.0735%2C0708.3839%2C0708.0100%2C0708.2553%2C0708.0667%2C0708.0053%2C0708.2255%2C0708.4299%2C0708.2778%2C0708.4314%2C0708.4064%2C0708.1531%2C0708.2467%2C0708.0275%2C0708.2675%2C0708.3205%2C0708.3472%2C0708.3868%2C0708.0204%2C0708.0288%2C0708.1564%2C0708.3426%2C0708.4034%2C0708.0299%2C0708.3522%2C0708.0812%2C0708.3023%2C0708.1443%2C0708.0353%2C0708.2752%2C0708.1671%2C0708.2035%2C0708.1110%2C0708.2462%2C0708.2157%2C0708.0797%2C0708.0687%2C0708.1815%2C0708.0993%2C0708.3682%2C0708.4213%2C0708.3973%2C0708.3214%2C0708.3277%2C0708.2370%2C0708.1335%2C0708.4019%2C0708.2794%2C0708.0135%2C0708.2950%2C0708.0028%2C0708.0620%2C0708.1916%2C0708.0138%2C0708.1930%2C0708.4112%2C0708.3944%2C0708.0253%2C0708.1979%2C0708.0584%2C0708.3445%2C0708.2710%2C0708.1267%2C0708.1800%2C0708.2123%2C0708.3137%2C0708.1448%2C0708.1249%2C0708.0788%2C0708.4252%2C0708.0612%2C0708.1285%2C0708.1796%2C0708.1164%2C0708.0557%2C0708.2942%2C0708.0014%2C0708.4028%2C0708.2460%2C0708.2164%2C0708.3237%2C0708.0413%2C0708.3735&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Spontaneous soliton symmetry breaking in two-dimensional coupled\n  Bose-Einstein condensates supported by optical lattices"}, "summary": "Models of two-dimensional (2D) traps, with the double-well structure in the\nthird direction, for Bose-Einstein condensate (BEC) are introduced, with\nattractive or repulsive interactions between atoms. The models are based on\nsystems of linearly coupled 2D Gross-Pitaevskii equations (GPEs), where the\ncoupling accounts for tunneling between the wells. Each well carries an optical\nlattice (OL) (stable 2D solitons cannot exist without OLs). The main subject of\nthe work is spontaneous symmetry breaking (SSB) in two-component 2D solitons\nand localized vortices. We demonstrate that, in the system with attraction or\nrepulsion, SSB occurs in families of symmetric or antisymmetric solitons (or\nvortices), respectively. The corresponding bifurcation destabilizes the\noriginal solution branch and gives rise to a stable branch of asymmetric\nsolitons or vortices. In the model with attraction, all stable branches\neventually terminate due to the onset of collapse. Stable asymmetric solitons\nin higher finite bandgaps, and vortices with a multiple topological charge are\nfound too. The models also give rise to first examples of \\textit{embedded\nsolitons%} and \\textit{embedded vortices}(the states located inside Bloch\nbands) in two dimensions. In the linearly-coupled system with opposite signs of\nthe nonlinearity in the two cores, two distinct types of stable solitons and\nvortices are found, dominated by either the self-attractive component or the\nself-repulsive one. In the system with a mismatch between the two OLs, a\n\\textit{pseudo-bifurcation} is found: when the mismatch attains its largest\nvalue ($\\pi $), the bifurcation does not happen, as branches of different\nsolutions asymptotically approach each other but fail to merge.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0708.2704%2C0708.0714%2C0708.2396%2C0708.1610%2C0708.4343%2C0708.0848%2C0708.3039%2C0708.4182%2C0708.0792%2C0708.3669%2C0708.1346%2C0708.4311%2C0708.4024%2C0708.2068%2C0708.3171%2C0708.2633%2C0708.3679%2C0708.4384%2C0708.0735%2C0708.3839%2C0708.0100%2C0708.2553%2C0708.0667%2C0708.0053%2C0708.2255%2C0708.4299%2C0708.2778%2C0708.4314%2C0708.4064%2C0708.1531%2C0708.2467%2C0708.0275%2C0708.2675%2C0708.3205%2C0708.3472%2C0708.3868%2C0708.0204%2C0708.0288%2C0708.1564%2C0708.3426%2C0708.4034%2C0708.0299%2C0708.3522%2C0708.0812%2C0708.3023%2C0708.1443%2C0708.0353%2C0708.2752%2C0708.1671%2C0708.2035%2C0708.1110%2C0708.2462%2C0708.2157%2C0708.0797%2C0708.0687%2C0708.1815%2C0708.0993%2C0708.3682%2C0708.4213%2C0708.3973%2C0708.3214%2C0708.3277%2C0708.2370%2C0708.1335%2C0708.4019%2C0708.2794%2C0708.0135%2C0708.2950%2C0708.0028%2C0708.0620%2C0708.1916%2C0708.0138%2C0708.1930%2C0708.4112%2C0708.3944%2C0708.0253%2C0708.1979%2C0708.0584%2C0708.3445%2C0708.2710%2C0708.1267%2C0708.1800%2C0708.2123%2C0708.3137%2C0708.1448%2C0708.1249%2C0708.0788%2C0708.4252%2C0708.0612%2C0708.1285%2C0708.1796%2C0708.1164%2C0708.0557%2C0708.2942%2C0708.0014%2C0708.4028%2C0708.2460%2C0708.2164%2C0708.3237%2C0708.0413%2C0708.3735&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Models of two-dimensional (2D) traps, with the double-well structure in the\nthird direction, for Bose-Einstein condensate (BEC) are introduced, with\nattractive or repulsive interactions between atoms. The models are based on\nsystems of linearly coupled 2D Gross-Pitaevskii equations (GPEs), where the\ncoupling accounts for tunneling between the wells. Each well carries an optical\nlattice (OL) (stable 2D solitons cannot exist without OLs). The main subject of\nthe work is spontaneous symmetry breaking (SSB) in two-component 2D solitons\nand localized vortices. We demonstrate that, in the system with attraction or\nrepulsion, SSB occurs in families of symmetric or antisymmetric solitons (or\nvortices), respectively. The corresponding bifurcation destabilizes the\noriginal solution branch and gives rise to a stable branch of asymmetric\nsolitons or vortices. In the model with attraction, all stable branches\neventually terminate due to the onset of collapse. Stable asymmetric solitons\nin higher finite bandgaps, and vortices with a multiple topological charge are\nfound too. The models also give rise to first examples of \\textit{embedded\nsolitons%} and \\textit{embedded vortices}(the states located inside Bloch\nbands) in two dimensions. In the linearly-coupled system with opposite signs of\nthe nonlinearity in the two cores, two distinct types of stable solitons and\nvortices are found, dominated by either the self-attractive component or the\nself-repulsive one. In the system with a mismatch between the two OLs, a\n\\textit{pseudo-bifurcation} is found: when the mismatch attains its largest\nvalue ($\\pi $), the bifurcation does not happen, as branches of different\nsolutions asymptotically approach each other but fail to merge."}, "authors": ["Arthur Gubeskys", "Boris A. Malomed"], "author_detail": {"name": "Boris A. Malomed"}, "author": "Boris A. Malomed", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevA.76.043623", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0708.4028v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0708.4028v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "20 pages, 23 figs, accepted to PRA", "arxiv_primary_category": {"term": "nlin.PS", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "nlin.PS", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0708.4028v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0708.4028v1", "journal_reference": null, "doi": "10.1103/PhysRevA.76.043623", "fulltext": "Spontaneous soliton symmetry breaking in two-dimensional coupled\nBose-Einstein condensates supported by optical lattices\nArthur Gubeskys and Boris A. Malomed\n\narXiv:0708.4028v1 [nlin.PS] 29 Aug 2007\n\nDepartment of Physical Electronics, School of Electrical Engineering,\nFaculty of Engineering, Tel Aviv University, Tel Aviv 69978, Israel\nModels of two-dimensional (2D) traps, with the double-well structure in the third direction, for\nBose-Einstein condensate (BEC) are introduced, with attractive or repulsive interactions between\natoms. The models are based on systems of linearly coupled 2D Gross-Pitaevskii equations (GPEs),\nwhere the coupling accounts for tunneling between the wells. Each well carries an optical lattice\n(OL) (stable 2D solitons cannot exist without OLs). The linear coupling splits each finite bandgap\nin the spectrum of the single-component model into two subgaps. The main subject of the work is\nspontaneous symmetry breaking (SSB) in two-component 2D solitons and localized vortices (SSB\nwas not considered before in 2D settings). Using variational approximation (VA) and numerical\nmethods, we demonstrate that, in the system with attraction or repulsion, SSB occurs in families\nof symmetric or antisymmetric solitons (or vortices), respectively. The corresponding bifurcation\ndestabilizes the original solution branch and gives rise to a stable branch of asymmetric solitons or\nvortices. The VA provides for an accurate description of the emerging branch of asymmetric solitons.\nIn the model with attraction, all stable branches eventually terminate due to the onset of collapse.\nStable asymmetric solitons in higher finite bandgaps, and vortices with a multiple topological charge\nare found too. The models also give rise to first examples of embedded solitons and embedded vortices\n(the states located inside Bloch bands) in two dimensions. In the linearly-coupled system with\nopposite signs of the nonlinearity in the two cores, two distinct types of stable solitons and vortices\nare found, dominated by either the self-attractive component or the self-repulsive one. In the system\nwith a mismatch between the two OLs, a pseudo-bifurcation is found: when the mismatch attains its\nlargest value (π), the bifurcation does not happen, as branches of different solutions asymptotically\napproach each other but fail to merge.\nPACS numbers: 03.75.Lm, 05.45.Yv, 42.65.Tg, 47.20.Ky\n\nI.\n\nINTRODUCTION\n\nA great variety of dynamical patterns in Bose-Einstein condensates (BECs) can be supported by optical\nlattices (OLs), i.e., spatially periodic potentials induced by laser beams illuminating the BEC [1]. A wellknown species of such patterns are gap solitons in condensates composed of repulsively interacting atoms.\nGap solitons in BEC were predicted theoretically [2]-[4], and then created in a \"cigar-shaped\" (i.e., nearly onedimensional, 1D) crossed-beam optical trap, to which a longitudinal OL was added. In self-attractive media,\nthe OL potential makes it possible to trap a usual soliton at a required position, and generates stable multisoliton complexes [6]. In the case of a very deep OL, the corresponding Gross-Pitaevskii equation (GPE) [7]\nreduces to a discrete nonlinear Schrödinger (NLS) equation [8], which supports well-known solitons, including\nstaggered ones [9].\nAnother topic which has drawn a great deal of interest, in terms of BEC [10] and nonlinear optics [11]\nalike, is spontaneous symmetry breaking (SSB) in matter waves or optical beams trapped in settings based\non double-well potentials (using the terminology widely adopted in optics [11], the medium corresponding\nto each potential well is sometimes called a \"core\" below). If two parallel \"cigar-shaped\" traps are strong\nenough, the system may be described by a pair of one-dimensional GPEs with linear coupling between\nthem [12], hence the destabilization of symmetric solitons and spontaneous transition to asymmetric ones\nin the double cigar-shaped trap, filled with self-attractive condensate, is described in the same way as the\nformation of asymmetric solitons in the well-studied model of dual-core nonlinear optical fibers [16] (in\nnonlinear optics, the SSB of 1D solitons was also studied in dual-core models with non-Kerr nonlinearities,\nsuch as quadratic [17] and cubic-quintic [18]). On the other hand, if the dual-core BEC waveguide is realized\nas a set of two parallel finite-width potential troughs, separated by a finite buffer layer, which are embedded\nin a 2D (horizontal) trap and tightly confined in the transverse (vertical) direction, the SSB in the respective\ndouble-core solitons can be examined in the framework of the full 2D GPE (i.e., considering the tunneling\nacross the buffer layer explicitly, rather than approximating it by the linear coupling between the two 1D\nequations) [19]. Both models predict a subcritical symmetry-breaking bifurcation for solitons in the self-\n\n\f2\nattractive condensate [which means that branches of asymmetric solutions emerge as unstable ones at the\nSSB point, and originally go backward (for which reason the bifurcation is also called a backward one), but\nthen turn forward, stabilizing themselves at the turning point].\nThe objective of the present work is to find symmetric, antisymmetric and asymmetric families of 2D BEC\nsolitons, and similar families of localized vortices (alias vortex solitons), in the system built as a stacked\npair of \"pancake-shaped\" traps, each carrying a two-dimensional OL. The traps are linearly coupled by\ntunneling across the buffer layer separating them. This model is a natural extension of a double-trap system\nrecently studied in the 1D setting [12] (in optics, spontaneous symmetry breaking in 1D multi-component gap\nsolitons was studied in models of dual-core [13] and triple-core [14] fiber Bragg gratings). The generalization\nto the higher dimension is significant, because 2D solitons are drastically different from their 1D counterparts\n[15], especially in the case of the self-attractive nonlinearity (the existence of the respective 2D solitons is\nfundamentally restricted by the possibility of collapse). Besides that, the new species of vortex solitons is\npossible in 2D geometry [15]. To the best of our knowledge, SSB in 2D solitons or vortices has never been\nconsidered before.\nWe will examine different physically relevant versions of the model, with attractive or repulsive nonlinearity\nin each trap (following Ref. [12], they are referred to as AA and RR systems, i.e., \"attractive-attractive\"\nand \"repulsive-repulsive\"). In the AA system, the solitons originate in the semi-infinite gap of the linear\nspectrum, while in the RR system one may expect to find solitons in finite bandgaps induced by the OL\n(we will consider the first two gaps, each of them being split into two subgaps under the action of the linear\ncoupling between the traps). In some cases (similar to what was found in the 1D model [12]), families of\nsolitons and vortices extend across Bloch bands separating the (sub)gaps, thus becoming embedded solitons\n[20]. As a matter of fact, the present paper reports the first examples of 2D embedded solitons (and vortices).\nA mixed (AR) system, with self-attraction in one trap and self-repulsion in the parallel one, will be\nconsidered too. As is known, the sign of the interaction between atoms can be reversed by means of the\nFeshbach resonance imposed by external magnetic field [21]; accordingly, the signs may be made opposite in\nthe two traps by applying the magnetic field which is inhomogeneous across the \"pancake\" stack. Solitons\nin 1D settings of the latter type, but without OLs, were elaborated in Refs. [22]; a 2D generalization was\nconsidered too (with no OLs either) [23], but it does not give rise to stable solitons.\nIn the normalized form, 2D models considered in this work are based on a system of linearly coupled GPEs\nfor the mean-field wave functions in the two flat traps, ψ(x, y, t) and φ(x, y, t),\niψt + ∇2 ψ + ε [cos(2x) + cos(2y)] ψ + λ1 |ψ|2 ψ + κφ = 0,\n(1a)\niφt + ∇2 φ + ε [cos(2x + ∆1 ) + cos(2y + ∆2 )] φ + λ2 |φ|2 φ + κψ = 0,\nwhere x and y are planar coordinates, ∇2 ≡ ∂ 2 /∂x2 + ∂ 2 /∂y 2 , λ1,2 = +1 and −1 correspond to the\nattractive and repulsive nonlinearity in the cores, real linear-coupling coefficient κ is proportional to the rate\nof tunneling across the potential barrier separating the parallel traps (\"cores\"), and ε is the strength of the\nOLs, whose period is scaled to be π. We assume equal depths of the OLs in both traps, while asymmetry\nbetween the lattices may be introduced by mismatches (phase shifts) in the x- and y-directions, ∆1 and ∆2 .\nWe will chiefly deal with the symmetric system, i.e., ∆1 = ∆2 = 0; nevertheless, effects produced by the\nmismatches will be addressed too (in fact, we will consider the case of the largest possible mismatch in the\ndiagonal or horizontal direction, i.e., ∆1 = ∆2 = π, or ∆1 = π, ∆2 = 0, respectively). In optical models,\nvarious effects of the mismatch between linearly-coupled Bragg gratings on gap solitons supported by the\ngratings were studied in Refs. [24].\nThe 2D form of Eqs. (1a) implies that the \"pancake\"-shaped traps are tightly confined in the transverse\n(Z) direction, which allows one to reduce the underlying 3D GPE to two dimensions, as performed, in the\ngeneral form, in Refs. [25]. Together with normalizations of the OL period and nonlinearity constants\nadopted in Eqs. (1a), this implies that variables t and (x, y) in Eqs. (1a) are related to physical time T and\ncoordinates (X, Y ) by\nπ2 ħ\nπ\nT, (x, y) ≡ (X, Y ) ,\n(2)\n2md2\nd\nwhere m is the atomic mass, and d the OL period in physical units, while the scaled wave functions are\nrelated to their counterparts, Ψ and Φ, in the 3D space as follows:\n\u001b\n\u0012\n\u001a\n\u0013\n\u001b\n\u001a\nr\ni\nmω⊥ 2\nπ\n1\nψ(x, t)\nΨ(X, Y, Z, T )\nexp − ω⊥ T −\n(3)\nZ .\n=\nΦ(X, Y, Z, T )\n2 |as | d2 φ(x, t)\n2\n2~\nt≡\n\n\f3\nHere ω⊥ is the transverse trapping frequency, and as the s-wave scattering length of atomic collisions (as < 0\nfor attractive interactions).\n\u0001 Due to the normalizations, the lattice strength is represented by ε = 2E/Erec ,\n2\nwhere Erec = (πħ) / md2 is the lattice recoil energy, and E the depth of the periodic potential in physical\nunits.\nThe AA and RR systems may be experimentally realized in 7 Li [26] or 85 Rb [27], and 87 Rb [1] condensates,\nrespectively. In this work, the analysis is presented in the range of κ ∼ 1 in Eqs. (1a). With regard to\nEqs. (2), the corresponding normalized tunnel-coupling time, tcoupl = π/(2κ), translates, for d ∼ 1 μm, into\nphysical time Tcoupl ∼ 10 μs and 100 μs, for lithium and rubidium, respectively. A prediction most essential\nto the experiment is the number of atoms expected in stable solitons. Assuming an experimentally relevant\nvalue of the trapping frequency – for instance, ω⊥ ≃ 2π × 100 Hz for the rubidium condensate (then, the\ncorresponding transverse-confinement size is estimated to be ∼ 1 μm, i.e., comparable to the OL period) –\nand translating the results reported below into physical units, we conclude that the symmetry-breaking 2D\nsolitons are built of ∼ 103 atoms. In vortex solitons, the number of atoms is larger, roughly, by a factor of\n10.\nThe paper is organized as follows. In Section II, we focus on relevant mathematical formulations, which\ninclude the linear spectrum of the coupled system, stationary equations for solitons, and the setting for the\nvariational approximation (VA) describing symmetric and asymmetric solitons in the AA and RR systems.\nSystematic numerical results for solitons in symmetric AA and RR systems (and comparison with predictions\nof the VA) are reported in Section III, while Section IV reports numerical results for vortex solitons, in the\nsame systems. Findings for asymmetric systems (of the AR type, as well as ones with mismatched OLs) are\ncollected in Section V. Section VI concludes the paper.\nII.\n\nFORMULATIONS: THE LINEAR SPECTRUM, STATIONARY EQUATIONS, AND\nVARIATIONAL APPROXIMATION\nA.\n\nLinear spectra\n\nBefore looking for soliton solutions, it is necessary to identify the system's spectrum within the framework\nof the linearized equations. First, we consider the symmetric system, with ∆1 = ∆2 = 0, and look for\nsolutions with chemical potential μ as\n{ψ(x, y, t), φ(x, y, t)} = [α(x, y) ± β(x, y)] e−iμt .\n\n(4)\n\nSubstituting this in the linearized version of Eqs. (1a), we arrive at a 2D eigenvalue problem based on the\ndecoupled equations,\n∇2 α(x, y) + ε [cos(2x) + cos(2y)] α(x, y) = −(μ + κ)α(x, y),\n∇2 β(x, y) + ε [cos(2x) + cos(2y)] β(x, y) = −(μ − κ)β(x, y).\n\n(5a)\n(5b)\n\nEach one of these equations is tantamount to the eigenvalue problem for the single GPE with a 2D lattice and\neffective chemical potential μ′ = μ ± κ. The spectrum generated by the linearization of the single-component\nGPE is well known, see Refs. [3] and references therein. Figure 1 shows a typical example of the spectrum of\nthe 2D coupled system with the zero mismatch. We observe that the linear coupling in Eqs. (1a) splits the\nfinite gaps of the single-component model BEC into pairs of subgaps, which is similar to what was observed,\nunder the action of the linear coupling, in the 1D counterpart of the present system [12].\nTo show in detail how the gaps split into subgaps, in Fig. 2 we display the dependence of the chemical\npotential on vectorial quasi-momentum (kx , ky ) in the diagonal direction (kx = ky ≡ k), in the uncoupled\nsystem and in its coupled counterpart with κ = 1, both pertaining to ε = 8. The new, nearly flat, branch of\nthe μ(k) dependence, which appears in the latter case around μ = −7.5, explains the splitting of former gap\n1 into subgaps 1a and 1b by a new very narrow Bloch band, cf. Fig. 1. At other values of ε, the splitting\nmechanism is quite similar.\nFigure 2 and all others in this paper display numerical results for OL strength ε = 8 (a moderately deep\nlattice), which corresponds to the most typical situation. As for coupling constant κ, the results are displayed\nfor κ = 1 (which also helps to presents generic findings), unless a different value of κ is indicated.\nAs shown in Fig. 3, we also examined the transformation of the linear spectrum under the action of\nthe diagonal mismatch between the OLs in the two traps, assuming ∆1 = ∆2 ≡ ∆. In this case, the\n\n\f4\n10\n\n10\n\n8\n\n8\n\n6\n\n6\n\nGap 3\n\n4\n\n4\n\n2\n\nGap 2\n\nμ\n\nμ\n\n2\n\n0\n\nGap 2b\n\n0\n\nGap 2a\n−2\n\n−2\n\nGap 1\n\n−4\n\nGap 1b\n\n−4\n\nsemi−infinite gap\n−6\n\n−6\n\n−8\n\n−8\n\n−10\n\n0\n\n1\n\n2\n\n3\n\n4\n\nε\n\n5\n\n6\n\n7\n\n8\n\n−10\n\n9\n\nGap 1a\n\nsemi−infinite gap\n\n0\n\n1\n\n2\n\n(a)\n\n3\n\n4\n\nε\n\n5\n\n6\n\n7\n\n8\n\n9\n\n(b)\n\nFIG. 1: (Color online) The spectrum of the linearized 2D system with aligned optical lattices\n(∆1 = ∆2 = 0). Throughout the paper, all numerically obtained results are given for ε = 8, which makes it\npossible to display the findings in a generic form. Here and in figures following below, Bloch bands are\nshaded. (a) The uncoupled system, κ = 0; (b) the coupled one, with κ = 1 (unless specified otherwise, all\nfigures in the paper pertain to κ = 1).\n6\n\n8\n\n4\n\n6\n4\n\n2\n\n2\n0\n\nμ\n\nμ\n\n0\n−2\n\n−2\n−4\n−4\n−6\n\n−6\n\n−8\n−10\n−1\n\n−8\n\n−0.5\n\n0\n\n0.5\n\n1\n\n−10\n−1\n\n−0.5\n\n0\n\nk\n\nk\n\n(a)\n\n(b)\n\n0.5\n\n1\n\nFIG. 2: (Color online) The dependence of chemical potential μ on quasi-momentum k (in the diagonal\ndirection, see text) in the uncoupled system, κ = 0 (a), and in the coupled one, κ = 1 (b). In both cases,\n∆1 = ∆2 = 0 and ε = 8. The new nearly flat branch of the dependence, observed around μ = −7.5,\nexplains the splitting of gap 1 into subgaps 1a and 1b in Fig. 1.\nlinearized equations cannot be decoupled; nevertheless, the computation is straightforward, as we can use the\nseparability of the linear operator to construct eigenfunctions of the 2D model as products of eigenfunctions\nof the corresponding 1D models [12]. Figure 3 demonstrates that, with the increase of ∆, the subgaps\ngenerated by the coupling-induced splitting tend to shrink, which resembles the trend observed in the 1D\nmodel [12].\n\n\f5\n2\n\n0\n\n−2\n\nμ\n\n−4\n\n−6\n\n−8\n\n−10\n\n−12\n\n0\n\n0.5\n\n1\n\n1.5\n\n∆\n\n2\n\n2.5\n\n3\n\nFIG. 3: (Color online) The change of the linear spectrum with the increase of diagonal mismatch ∆\nbetween the lattices in the coupled traps, for κ = 2.\n\nB.\n\nStationary equations\n\nStationary solutions to the full nonlinear system of Eqs.\n(1a) are looked for as {ψ, φ} =\n{u(x, y), v(x, y)} e−iμt , with real functions u and v to be found from equations\nμu + ∇2 u + ε [cos(2x) + cos(2y)] u + λ1 u3 + κv = 0,\n(6a)\n2\n\n3\n\nμv + ∇ v + ε [cos(2x + ∆1 ) + cos(2y + ∆2 )] v + λ2 v + κu = 0.\nIn the symmetric models, i.e., AA and RR ones (λ1 = λ2 = ±1) with zero mismatch (∆1 = ∆2 = 0),\nsymmetric (u = v) and antisymmetric (u = −v) solutions can be expressed in terms of a stationary solution\nof the single-component GPE with chemical potential μ, to be denoted as û0 (x, y; μ):\nu(x, y; μ) = ±v(x, y; μ) = û0 (x, y; μ ± κ).\n\n(7)\n\nSimilar to the situation in the 1D model [12], we conclude from Eq. (7) that, when the gap splitting occurs,\nthe symmetric and antisymmetric solitons will be moved to the lower and upper subgaps, respectively. In\nsome cases, they may end up in Bloch bands separating the subgaps, thus becoming embedded solitons,\nexamples of which are presented below.\nTo find general asymmetric soliton solutions and SSB bifurcations linking them to their symmetric and\nantisymmetric counterparts, we solved the full system of stationary equations (6a) numerically. The stability\nof all solitons was examined by direct simulations of Eqs. (1a). Soliton families are characterized (see below)\nby norms of the two components and the total norm,\nZ Z\n\b 2\nu (x, y), v 2 (x, y) dxdy, N ≡ Nu + Nv ,\n(8)\n{Nu , Nv } =\nFor asymmetric solutions, we define the asymmetry ratio [12] as\nΘ = |Nu − Nv | / (Nu + Nv ) .\n\n(9)\n\nThe total norm, together with the energy, are dynamical invariants of Eqs. (1a).\nC.\n\nVariational approximation for the symmetric system\n\nThe symmetric version of Eqs. (6a) (λ1 = λ2 ≡ λ, ∆1 = ∆2 = 0) can be derived from the following\nLagrangian:\n\n\f6\n\nL =\n\nZ Z\n\n\u0001\n\u0001\n\u0001\nμ |u|2 + |v|2 − |∇u|2 + |∇v|2 + ε [cos(2x) + cos(2y)] |u|2 + |v|2\n\u0001\n\u0003\n+ (λ/2) |u|4 + |v|4 + κ (u∗ v + uv ∗ ) .\n\u0002\n\n(10)\n\nA simple real isotropic Gaussian ansatz [28], with single width W but different amplitudes A and B pertaining\nto the two components, may be adopted for the solitons:\n\u0012 2\n\u0013\nx + y2\n(u, v) = (A, B) exp −\n.\n(11)\n2W 2\nThe total norm of this expression is [see Eq. (8)]\n\u0001\nN = πW 2 A2 + B 2 .\n\n(12)\n\n\u0001\n\u0001\n\u0001\n2\nLeff /π = μ A2 + B 2 W 2 − A2 + B 2 + 2ε A2 + B 2 W 2 e−W\n\u0001\n+ (λ/4) A4 + B 4 W 2 + 2κABW 2 .\n\n(13)\n\nThe substitution of ansatz (11) in Lagrangian (10) yields the corresponding effective Lagrangian,\n\nVariational equations following from this Lagrangian can be conveniently written as\n\u0001\n\u0001\n∂Leff /∂ A2 + B 2 = ∂Leff /∂ (AB) = ∂Leff /∂ W 2 = 0.\n\n(14)\n\n(15)\n\nFor symmetric and antisymmetric solitons, defined by A = sB with s = ±1, Eqs. (15) amount to a set of\ntwo equations,\n\u0011\n\u0010\n2\n(16)\nN ≡ 2πW 2 A2 = 8πλ 1 − 2εW 4 e−W ,\n\u0001\n2\n(17)\nμ + sκ = −W −2 − 2εe−W 1 − 2W 2 .\n\nIn the attractive model (λ = +1), Eqs. (16) and (17) are tantamount to those analyzed in the framework\nof the VA in Refs. [28] and [29]. It was demonstrated that the norm of the 2D soliton takes values in the\nfollowing intervals:\n(attr)\n0 < N < Nmax\n≡ 8π, if ε > εcr ≡ e2 /8 ≈ 0.92;\n\n(18)\n(attr)\nNmin\n\n≡ 8π (1 − ε/εcr) < N < 8π, if ε < εcr .\n\n(attr)\n\nNote that Nmax = 8π corresponds, in terms of the VA [30], to the norm of the Townes soliton, i.e., the\nlocalized solution of the 2D NLS equation in free space, which is unstable against collapse [31] (while the\n(attr)\nOL stabilizes 2D solitons [28, 33]). In fact, the vanishing of Nmin at ε > εcr in Eqs. (18) is an artifact\nof the VA [28], explained by the fact that Gaussian ansatz (11) is not appropriate for multi-peaked solitons\nsupported by the strong OL.\nIn the repulsive model (λ = −1), variational equations (16) and (17) which, essentially, pertain to the\nsingle-component setting, predict solitons only if the OL is strong enough [29]. Indeed, a straightforward\nconsideration of Eq. (16) demonstrates that, in this case, solutions exist only for ε > εcr , the norm of the\nsolution family being limited to interval\n(rep)\n0 < N < Nmax\n≡ 8π (ε/εcr − 1)\n\n(19)\n\n[εcr is the same as in Eq. (18)]. The comparison of Eq. (19) with known numerical results for 2D gap solitons\n(1)\n[3, 34] demonstrates that the nonexistence of solitons in the repulsive model at ε < εcr is another artifact\nof the VA, signalling that gap solitons cannot be approximated by simple Gaussian ansatz (11) for ε < εcr .\n\n\f7\nFor asymmetric solitons, with A2 6= B 2 , Eqs. (15) can be cast in the following form:\n\u0014 \u0010\n\u0015\n\u0011 q\n\u00012\n2\nA2 + B 2 = 2 λ W −2 − 2εW 2 e−W +\nW −2 − 2εW 2 e−W 2 + 2κ2 ,\nAB = 2λκ,\n\nμ = −2εe−W\n\n2\n\n1−W\n\n\u0001\n2\n\nq\n\u00012\n− λ W −2 − 2εW 2 e−W 2 + 2κ2 .\n\nWith regard to Eq. (20), norm (12) of the asymmetric solitons becomes\n\u0015\n\u0014 \u0010\n\u0011 q\n\u0001\n2 2\n4 −W 2\n4\n−W\n2\n4\n1 − 2εW e\n+ 2κ W ,\n+\nN = 2π λ 1 − 2εW e\n\n(20)\n(21)\n(22)\n\n(23)\n\nVariational solutions for the asymmetric solitons are meaningful if they satisfy an obvious condition,\nA2 + B 2 ≥ 2 |AB|. In fact, the asymmetric solitons bifurcate from symmetric or antisymmetric ones [if,\nrespectively, λ = +1 or −1, as follows from Eq. (21)] precisely at point A2 + B 2 = 2 |AB|. Soliton families\npredicted by the VA, i.e., obtained by numerical solution of Eqs. (20) - (23), are represented by the corresponding dependences N = N (μ) in Figs. 4 and 7, along with their counterparts found from the numerical\nsolution of full stationary equations (6a).\nIII.\n\nNUMERICAL RESULTS: SOLITONS\n\nA.\n\nSymmetric attraction-attraction system\n\nIn Fig. 4, we display a generic example of families of antisymmetric, symmetric and asymmetric stationary\nsolitons in the AA model with zero mismatch between the lattices (∆ = 0). The families were found from\nsystematic numerical solutions of Eqs. (6a). Figure 4 also includes the solution families as predicted, for the\nsame case, by the VA, which demonstrates good agreement between the variational and numerical results,\nfor all the three types of solitons (at small values of the norm, the variational branches are indistinguishable\nfrom their numerical counterparts). A typical example of comparison of the profiles of asymmetric solitons\nproduced by the numerical solution and VA is presented in Fig. 5.\nWe observe in Fig. 4(a) that the symmetric-soliton branch undergoes a supercritical bifurcation at some\ncritical value of the norm, giving rise to the branch of asymmetric solitons, which is the manifestation of\nthe SSB in this setting (note that the bifurcation point is very accurately predicted by the VA). Symmetric\nsolitons are stable before the bifurcation, and unstable afterwards, while asymmetric solitons emerge as\nstable solutions [recall the stability of the solutions was identified by direct simulations of Eqs. (1a)].\nOn the other hand, the family of antisymmetric solitons never bifurcates, i.e., it never gets destabilized\nthrough SSB. As a consequence of that, the system features bistability, when the antisymmetric solutions\nare stable simultaneously with either symmetric or asymmetric ones (below or above the bifurcation point,\nrespectively). It is worthy to note that all branches of the solutions satisfy the Vakhitov-Kolokolov (VK)\ncriterion, dN/dμ < 0, which is a necessary stability condition [31, 32]. It is also noteworthy that the stable\nbranch of antisymmetric solitons displayed in Fig. 4(a) continues across the (narrow) Bloch band separating\nthe semi-infinite gap and subgap 1a. Inside the narrow band, this family represents 2D embedded solitons\n(which are stable in direct simulations). As far as we know, this is the first example of 2D embedded solitons\nreported in any model.\nThe above results resemble findings recently reported in the 1D system [12]. However, in the 2D case we\nobserve an additional destabilization mechanism in the AA system, through collapse of the soliton of any\ntype, when its norm becomes too large. In particular, the antisymmetric branch, which would be totally\nstable in the 1D case, loses its stability in the 2D system when the soliton's norm exceeds the corresponding\ncollapse threshold. Direct simulations demonstrate that, in this situation, the unstable antisymmetric soliton\nis first transformed into a strongly asymmetric structure; eventually, the high-amplitude component collapses,\nforming a singularity, while its counterpart with the lower amplitude decays into quasi-linear waves, as shown\nin Fig. 6.\nThe evolution of symmetric solitons destabilized by the SSB bifurcation is not affected by the collapse.\nSimilar to what was reported in the study of the 1D model [12], the unstable symmetric solitons clearly tend\nto rearrange themselves into stable asymmetric counterparts (examples are not shown here, as they are not\n\n\f8\n20\ngap 1a\n\nsemi−infinite gap\n18\n\n1.2\n16\n1\n\nan\n\n14\ns\n\n12\n\nΘ\n\nu\n\nN +N\n\nv\n\n0.8\n\n10\nas\n\n0.6\n\n8\n6\n\n0.4\n\n4\n0.2\n2\n0\n\n−24\n\n−22\n\n−20\n\n−18\n\n−16\n\n−14\n\nμ\n\n−12\n\n−10\n\n0\n\n−8\n\n−24\n\n−22\n\n−20\n\n−18\n\n(a)\n\n−16\n\nμ\n\n−14\n\n−12\n\n−10\n\n−8\n\n(b)\n\nFIG. 4: (Color online) Families of 2D solitons found in the symmetric attraction-attraction model\n(λ1 = λ2 = 1, ∆1 = ∆2 = 0). Symmetric, antisymmetric and asymmetric solutions are labeled by \"s\",\n\"an\", and \"as\", respectively. Dashed-dotted lines represent solutions (of all the three types) produced by\nthe variational approximation, while solid and dotted lines depict, respectively, numerically found stable\nand unstable solutions. (a) The soliton's total power versus the chemical potential. (b) Ratio Θ [see Eq.\n(9)] for the family of asymmetric solitons. The same conventions for labelling solution families of different\ntypes (variaitonal/numerical, stable/unstable, symmetric/antisymmetric/asymmetric) are adopted in other\nfigures.\n3\n2.5\n2\n\nu,v\n\n1.5\n1\n0.5\n0\n−0.5\n−1\n−3\n\n−2\n\n−1\n\n0\n\n1\n\n2\n\n3\n\nx,y\n\nFIG. 5: (Color online) Comparison of profiles of the 2D soliton in the attraction-attraction model, as found\nfrom the numerical solution and predicted by the variational approximation (solid and dashed curves,\nrespectively). Shown are cross sections of the soliton along x- and y-axes, for μ = −12. Norms of the two\ncomponents of the soliton are Nu ≈ 4.5 and Nv ≈ 0.4.\nessentially different from what was observed in the 1D system). The branch of the asymmetric solitons is\nalso subject to the collapse, but this happens on a remote portion of the N (μ) curve, which could not be\nshown in Fig. 4.\nB.\n\nSymmetric repulsion-repulsion system\n\nA generic example of families of solitons found in the RR model is shown in Fig. 7. In subgap 1b, the VA\npredicts the solutions very accurately. For this case, the comparison of numerical and variational asymmetric\n\n\f9\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\nFIG. 6: (Color online) Evolution of an antisymmetric 2D soliton (with μ = −16) in the\nattraction-attraction model, which is destabilized by the collapse. (a) The initial state at t = 0; (b) the\nformation of an asymmetric state at t = 4; (c) the collapse of the high-amplitude component and decay of\nthe low-amplitude one, at t = 6; (d) the evolution of the entire pattern in the cross section along x = 0.\nHere and in similar figures presented below, panels display the side-by-side juxtaposition of the two\ncomponents, |u| and |v|.\nsoliton profiles is displayed in Fig. 8. On the other hand, the VA also predicts asymmetric solutions in subgap\n2a, where such solutions could not be found in the numerical form, therefore the extension of the asymmetric\nbranch into the latter subgap is an artifact of the variational method. It is noteworthy too that the stable\nbranch of symmetric solitons crosses the Bloch band separating subgaps 1a and 1b, thus providing for the\nfirst example of 2D embedded solitons in a self-defocusing medium. These embedded solitons are stable, as\nillustrated by an example of the evolution of a perturbed soliton shown in Fig. 9.\nThe situation in the RR system is closer to what was found for its 1D counterpart in Ref. [12] (because\ncollapse does not occur with repulsive nonlinearity): the antisymmetric branch undergoes a supercritical\nbifurcation, which gives rise to stable asymmetric solitons, while the symmetric branch does not bifurcate\nand remains always stable (the VK criterion does not apply to gap solitons in models with the repulsive\nnonlinearity). Note that, like in Fig. 4, the bifurcation point is very accurately predicted by the VA. The\nasymmetric solitons are stable whenever they exist, hence the bistability between symmetric and antisymmetric or asymmetric solitons takes place here. The antisymmetric solitons, destabilized by the SSB bifurcation,\ntransform themselves into persistent localized breathers, see an example in Fig. 10. The breather features\noscillations in its two components, with equal amplitudes and phase shift π/2 between them.\nLastly, stable asymmetric solitons have also been found in higher bandgaps, an example of which is given\n\n\f10\n45\nGap 1a\n\nGap 2a\n\nGap 1b\n\nGap 1a\n\n40\n\nGap 2a\n\nGap 1b\n\n1.2\n\n35\n1\n\n0.8\n\nΘ\n\n25\n\nu\n\nN +N\n\nv\n\n30\n\ns\n\n20\n\n0.6\n\nan\n15\n\n0.4\n10\n\nas\n0.2\n\n5\n0\n−10\n\n−8\n\n−6\n\n−4\n\nμ\n\n−2\n\n0\n−10\n\n0\n\n−8\n\n−6\n\n(a)\n\nμ\n\n−4\n\n−2\n\n0\n\n(b)\n\nFIG. 7: (Color online) The same as in Fig. 4, but for families of solitons in the symmetric\nrepulsion-repulsion model (λ1 = λ2 = −1, ∆ = 0). The portion of the asymmetric-soliton branch in subgap\n2a is an artifact of the variational approximation.\n3\n2.5\n2\n\nu,v\n\n1.5\n1\n0.5\n0\n−0.5\n−1\n−6\n\n−4\n\n−2\n\n0\n\n2\n\n4\n\n6\n\nx,y\n\nFIG. 8: (Color online) Comparison of profiles of asymmetric solitons, as predicted by the VA and found in\nthe numerical form (dashed and solid lines, respectively), in the symmetric repulsive-repulsive model. In\nthis case, μ = −4, and Nu ≈ 10.5, Nv ≈ 0.6.\nin Fig. 11. Typically, the solitons in higher bandgaps are less tightly bound, featuring well-pronounced\nsidelobes.\nIV.\n\nNUMERICAL RESULTS: VORTICES\n\nA.\n\nSymmetric attraction-attraction system\n\nIn the model based on the single-component GPE in two dimensions with the OL and attractive nonlinearity, stable solutions in the form of localized vortices with topological charge (\"spin\") S = 1 were reported\nin Refs. [28] and [33], and their (also stable) counterparts with S > 2 were found in Ref. [35]. Before\nproceeding to the new problem of the SSB in two-component vortices, it is relevant to recapitulate basic\nresults obtained for vortex solitons in the single-component model. Figure 12 shows a generic example of\nfamilies of vortex-soliton solutions with S = 1 in this model. The most compact \"crater-shaped\" vortices,\nwhich feature a single peak with a hole in the center, are always unstable. However, the vortices built as 4-\n\n\f11\n\nFIG. 9: (Color online) Evolution of a perturbed symmetric embedded soliton in the symmetric\nrepulsion-repulsion model is shown in the cross-section along x = 0. The chemical potential of the\nunperturbed soliton is μ = −7.54, placing it into the Bloch zone separating subgaps 1a and 1b. The norm\nof the soliton is N ≈ 8. The soliton is obviously stable.\n\nFIG. 10: (Color online) Spontaneous transformation of an unstable antisymmetric soliton (with μ = −3.5)\ninto a persistent breather, in the symmetric repulsion-repulsion model (λ1 = λ2 = −1, ∆ = 0).\n\nFIG. 11: (Color online) An example of a stable asymmetric soliton found, in the symmetric\nrepulsion-repulsion system, in subgap 2a, with μ = 1.\n\n\f12\n160\nsemi−infinite gap\n\ngap 1\n\n140\n120\n\nnorm\n\n100\n\n8 peaks\n\n80\n60\n40\n\n4 peaks\n\n1 peak\n\n20\n0\n−20\n\n−15\n\n−10\n\nμ\n\n−5\n\n0\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\nFIG. 12: (Color online) Localized vortices with topological charge S = 1 in the single-component model\nwith attraction (λ = 1). (a) Three solution families (unstable single-peak crater-shaped vortices, and stable\n4- and 8-peak vortex complexes) are represented by the dependence of their norm on the chemical\npotential. (b)-(d) Examples of the three species of localized vortices, with (μ = −4.5, N ≈ 20),\n(μ = −20, N ≈ 76), and (μ = −12, N ≈ 78), respectively.\nand 8-peak complexes, with phase shifts, respectively, π/2 or π/4 between the peaks (which corresponds to\nthe net phase circulation of 2π, i.e., S = 1), constitute entirely stable families (Fig. 12 includes examples of\nall the three species of localized vortices). These complexes are quite similar to examples of stable vortices\nreported in Refs. [28] and [33].\nWe have found the SSB of two-component vortex solitons in the symmetric AA system (λ1 = λ2 = +1,\n∆ = 0). Families of 4- and 8-peak vortices of the symmetric, antisymmetric and asymmetric types, found\nin the coupled system, are shown in Figs. 13 and 14, along with examples of respective stable asymmetric\nvortices.\nThe stability of these solutions was identified, as above, by direct simulations. Symmetric vortices get\ndestabilized by the bifurcation and tend to spontaneously rearrange into asymmetric ones, which emerge as\nstable solutions, while antisymmetric vortices do not bifurcate. At large values of the norm, the localized\nvortices are subject to collapse.\n\n\f13\n100\nsemi−infinite gap\n\ngap 1a\n\n90\n80\nan\n\n70\ns\n\nnorm\n\n60\n50\n40\n\nas\n\n30\n20\n10\n0\n−20\n\n−15\n\n−10\n\nμ\n\n−5\n\n(a)\n\n(b)\n\nFIG. 13: (Color online) 4-peak vortices with topological charge S = 1, in the symmetric\nattraction-attraction system, with κ = 2. (a) Families of the symmetric, antisymmetric, and asymmetric\nvortex solutions represented by N (μ) curves. (b) An example of a stable asymmetric vortex, for μ = −18\nand N = 36.5.\n160\nsemi−infinite\ngap\n\n140\n120\n\nnorm\n\n100\n\ngap 1a\n\nan\ns\n\n80\n60\n\nas\n\n40\n20\n0\n−20\n\n−15\n\n−10\n\nμ\n\n−5\n\n(a)\n\n(b)\n\nFIG. 14: (Color online) The same as in Fig. 13, but for 8-peak vortices. In panel (b), an example of the\nstable asymmetric vortex is displayed for μ = −18, N = 73.5.\n\nB.\n\nSymmetric repulsion-repulsion system\n\nIn the repulsive model with the OL, localized vortices may be treated as a species of 2D solitons of the gap\ntype [4, 34]. First, in Fig. 15 we present families of vortex solitons in the single-component model. Similar to\nwhat was shown above for the attractive model, the single-peak (crater-shaped) vortices are unstable, while\nmultiple-peak vortical complexes are stable. However, in the repulsive model only the (unstable) single-peak\nand (stable) 8-peak structures carry topological charge S = 1, while the 4-peak entity is a complex bound\nstate of several vortices. Indeed, the phase distribution in the latter state, displayed in Fig. 16, suggests\nthat it may be interpreted as a structure built of of five vortices: one, with S = 1, is located in the center,\nbeing surrounded by four constituent vortices, each carrying charge S = −1.\nIn the coupled (two-component) RR system, we observed SSB in both types of stable vortex states, 4peak and 8-peak ones, as shown in Fig. 17. Similar to what was demonstrated above for the solitons,\nthe asymmetric branch bifurcates from the antisymmetric one, while the family of the symmetric vortices\ndoes not bifurcate and remains entirely stable, thus giving rise to the bistability, together with the stable\n\n\f14\n\ngap 1\n\n300\n\ngap 2\n\n250\n\nnorm\n\n200\n8 peaks\n150\n\n100\n4 peaks\n\n1 peak\n\n50\n\n0\n−10\n\n−8\n\n−6\n\n−4\n\nμ\n\n−2\n\n0\n\n2\n\n4\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\nFIG. 15: (Color online) Localized vortices in the single-component model with repulsion (λ = −1). (a)\nNorm versus the chemical potential for three species of vortex solitons: single-peak, 4-peak, and 8-peak\nones. (b)-(d): Examples of vortices of these types, with (μ = 1.5, N ≈ 35), (μ = −2.5, N ≈ 135), and\n(μ = −3.5, N ≈ 208), respectively.\n\n(a)\n\nFIG. 16: (Color online) The phase pattern in the 4-peak vortex complex in the single-component repulsive\nmodel, whose density profile is displayed in Fig. 15(c).\n\n\f15\n200\ngap 1a\n\ngap 1b\n\n300\n\ngap 2a\n\n180\n160\n\ngap 1a\n\ngap 1b\n\n250\n\n140\n200\n\nnorm\n\nnorm\n\n120\ns\n\n100\n80\n\ns\n150\n\nan\n\nan\n100\n\n60\n40\n\nas\n\nas\n\n50\n\n20\n0\n−10\n\n−8\n\n−6\n\nμ\n\n−4\n\n−2\n\n0\n\n0\n−10\n\n−9\n\n−8\n\n(a)\n\n−7\n\n−6\n\nμ\n\n−5\n\n−4\n\n−3\n\n−2\n\n(b)\n\nFIG. 17: (Color online) Families of 4-peak (a) and 8-peak (b) vortices in the symmetric repulsion-repulsion\nsystem.\nFIG. 18: (Color online) A stable asymmetric vortex with topological charge S = 2, found in the symmetric\nrepulsion-repulsion system. In this case, μ = 1 (which falls in subgap 2a). Norms of the components are\nNu ≈ 272, Nv ≈ 13. Note the difference in the x- and y- scales in the figure (in fact, the vortex is invariant\nwith respect to x ↔ y).\n\nasymmetric vortices. Antisymmetric two-component vortices destabilized by the SSB bifurcation develop\ninto persistent breathers. A noteworthy feature of Fig. 17 is the fact that the branch of symmetric solutions\n(both 4- and 8-peak ones) crosses the Bloch band between subgaps 1a and 1b, which provides for the first\nexample of (stable) embedded vortex solitons.\nStable asymmetric vortices residing in higher bandgaps, as well as stable vortices with higher vorticity,\nS > 1, have been found too. In particular, Fig. 18 displays an example of a stable 8-peaked vortex with\nS = 2, found in subgap 2a.\nV.\n\nASYMMETRIC MODELS\n\nAs explained in Introduction, the symmetry of coupled equations (1a) may be broken by opposite signs of\nthe nonlinearity in the two cores (in the AR system, with λ1 = −λ2 = +1), or by mismatches between the\nlattices in them, ∆1,2 6= 0. We did not aim to perform an exhaustive analysis of the asymmetric models, but\nexamples of stable solitons in these models have been found.\n\n\f16\n4\n\n2.5\n\n3.5\n2\n\nu\n\n3\n\nv\n1.5\n\n2.5\n\n1\n\nu,v\n\nu,v\n\n2\n1.5\n\n0.5\n\n1\n0.5\n\n0\n\n0\n\nv\n\n−0.5\n\nu\n\n−0.5\n−1\n\n0\n\n0.5\n\n1\n\n1.5\n\n2\n\nx,y\n(a)\n\n2.5\n\n3\n\n3.5\n\n4\n\n−1\n\n0\n\n1\n\n2\n\n3\n\n4\n\n5\n\n6\n\n7\n\n8\n\nx,y\n(b)\n\nFIG. 19: (Color online) Stable solitons in the coupled attraction-repulsion system\n(λ1 = −λ2 = 1, ∆1,2 = 0). The solitons' profiles are even functions of x and y, and are invariant with\nrespect to transformation x ↔ y. (a) A soliton with the dominant self-attractive component. It has\nμ ≈ −13 (which falls in the semi-infinite gap), and Nu ≈ 5.7, Nv ≈ 0.26. (b) A soliton with the dominant\nself-repulsive component, found with μ ≈ −5.7 (which belongs to subgap 1a) and Nu ≈ 0.55, Nv ≈ 5.35.\nFigure 19 shows stable solitons in the AR system. Solutions of two types have been found in it: one with\na dominant self-repulsive component sitting in subgap 1a, and another one with the dominant self-attractive\ncomponent found, as should be expected, in the semi-infinite gap. Stability of the solitons have been verified\nby direct simulations.\nStable 8-peak vortices with S = 1 have also been found in the AR model. Vortices with dominant selfattractive and self-repulsive components are located in the semi-infinite gap and subgap 1a, respectively.\nTheir examples are not shown here, as they are very similar to the 8-peak asymmetric solitons found in the\nAA and RR models, that were reported above.\nWe have also studied the system with the mismatch between the OLs, concentrating on two most interesting\ncases, with ∆1 = π, ∆2 = 0 or ∆1 = ∆2 = π in Eqs. (1a). In either case, the phase mismatch was given the\nlargest possible value (π). As in the 1D model with nonzero mismatch [12], quasi-symmetric and asymmetric\nsolutions have been identified, as states with Nu = Nv and Nu 6= Nv , respectively. In the mismatched\nsystem, asymmetric solitons have peaks in the two components located at the same position, while in quasisymmetric solutions the peaks are slightly separated. Typical profiles of quasi-symmetric and asymmetric\nsolutions in the misaligned AA system are shown in Fig. 20 for ∆1 = ∆2 = π (this choice corresponds to the\nlargest diagonal mismatch). Direct simulations demonstrate that the quasi-symmetric solitons are always\nunstable in this case (an explanation of this feature is given below), while the asymmetric solitons are stable,\nbeneath the collapse threshold.\nFurther, Fig. 21 depicts the dependence of the asymmetry ratio, defined as per Eq. (9), on coupling coefficient κ. In the case of the maximum horizontal mismatch, ∆1 = π, ∆2 = 0, we observe that the bifurcation\nwhich breaks the (quasi-)symmetry of solitons at a critical value of κ is replaced by the pseudo-bifurcation,\ni.e., the branch of asymmetric solutions asymptotically approaches its quasi-symmetric counterpart with\nthe increase of κ, but the bifurcation does not happen, since the two branches never merge. A similar\nphenomenon was reported in the 1D model with ∆ = π [12]. The replacement of the bifurcation by the\npseudo-bifurcation is observed only in the case of the largest mismatch, ∆1 = π and/or ∆2 = π, and it explains the above-mentioned total instability of the family of quasi-symmetric solitons, as the corresponding\nbranch never has a chance to get stabilized by the inverse bifurcation (if one considers the evolution of the\nsolutions with the increase of κ at fixed total norm N ).\nA new feature specific to the 2D system is that, in the system with the largest diagonal mismatch,\n∆1 = ∆2 = π, the numerical procedure suddenly ceases to converge at some critical value of κ, and no\nasymmetric solitons are found past this point. For instance, at κ = 15.485 a stable asymmetric soliton with\na regular profile can be found, but when the coupling increases to κ = 15.490, the soliton is lost. The shape\nof the Θ(κ) dependence in Fig. 21(b) strongly suggests that the branch of asymmetric solitons terminates,\n\n\f17\n\n(a)\n\n(b)\n\nFIG. 20: (Color online) Soliton profiles in the attraction-attraction model with the maximum diagonal\nmismatch between the lattices in the cores, ∆1 = ∆2 = π, for κ = 10, and N = 5. (a) A stable asymmetric\nsoliton; (b) an unstable quasi-symmetric soliton.\n1\n\n1\n\n0.9\n0.9\n0.8\n0.8\n\n0.7\n\n0.7\n\nΘ\n\nΘ\n\n0.6\n0.5\n\n0.6\n\n0.4\n0.3\n\n0.5\n\n0.2\n0.4\n0.1\n0\n\n0\n\n10\n\n20\n\nκ\n\n30\n\n40\n\n50\n\n0\n\n(a)\n\n2\n\n4\n\n6\n\n8\n\nκ\n\n10\n\n12\n\n14\n\n16\n\n(b)\n\nFIG. 21: (Color online) The asymmetry ratio, defined as per Eq. (9), as a function of the linear-coupling\nconstant in the misaligned (∆1 = π, ∆2 = 0) attraction-attraction model with fixed total norm of the\ntwo-component soliton, N = 5. (a) The pseudo-bifurcation. (b) The termination of the family of\nasymmetric soliton solutions.\nin this case, due to a tangent bifurcation, which results from collision and mutual annihilation of the branch\nwith an additional branch of unstable solutions, that we did not aim to find.\nOther types of stable solitons and vortices have also been found in the misaligned system of the AA type.\nIn particular, an example of a soliton with two peaks in one component and a single peak in the other is\nshown in Fig. 22.\nStable asymmetric solitons in the RR system with misaligned lattices have been found too. A typical\nstable asymmetric soliton in this system is shown in Fig. 23\nVI.\n\nCONCLUSION\n\nWe have introduced experimentally relevant models of two stacked flat BEC traps, with attractive or\nrepulsive interactions between atoms. Each flat trap carries an OL (optical lattice), stable 2D solitons being\n\n\f18\n\nFIG. 22: (Color online) A stable soliton in the diagonally mismatched (∆1 = ∆2 = π) attraction-attraction\nsystem. In this case μ = −9, and Nu = 0.8, Nv = 1.6.\n\nFIG. 23: (Color online) An example of a strongly asymmetric stable soliton in the diagonally mismatched\n(∆1 = ∆2 = π) repulsion-repulsion system with κ = 10. This soliton has μ = −11, and Nu = 4.4, Nv = 1.6.\nimpossible without it. First, it was demonstrated that the linear coupling splits every finite bandgap in\nthe linear spectrum of the single-component model into two subgaps, which are separated by narrow Bloch\nbands. The main issue, addressed in this work by means of the VA (variational approximation) and numerical\nmethods, is SSB (spontaneous symmetry breaking) in families of solitons and localized vortices, as a result\nof the competition of three factors: the attractive or repulsive nonlinearity in each core, the action of the\nOL potential, and the linear coupling between the cores. Similar to what was found in the zero-dimensional\nsetting [10] (this means a double-well potential without any transverse dimension) and one-dimensional\nmodels [12, 19], the SSB occurs in families of symmetric or antisymmetric states, in the case of the attractive\nor repulsive nonlinearity, respectively. In either case, the corresponding bifurcation destabilizes the branch\nof symmetric or antisymmetric solitons or vortices, giving rise to a stable branch of asymmetric solutions.\nThe VA, based on the Gaussian ansatz, yields an accurate prediction for the bifurcation and the branch of\nasymmetric solitons generated by the bifurcation. A feature specific to the 2D setting is the termination of\nall stable branches in the AA (attraction-attraction) system due to the onset of collapse.\nStable asymmetric solitons sitting in higher finite bandgaps, and localized vortices with multiple values of\nthe topological charge have been found too. In addition, the models considered in this work give rise to first\nexamples of (stable) embedded solitons and embedded vortices (localized states found inside Bloch bands\nseparating the subgaps) in any 2D setting.\nSolitons and localized vortices were also considered in the linearly-coupled systems whose symmetry is\nbroken by opposite signs of the nonlinearity in the two traps, or by a mismatch between the OLs in them. In\n\n\f19\nthe former case, the system gives rise to two distinct types of stable solitons and vortices, which are dominated\nby either a self-attractive component or self-repulsive one, which sit, respectively, in the semi-infinite gap,\nor in a finite bandgap. In the system with mismatched lattices, the phenomenon of the pseudo-bifurcation\n(which was recently reported in the 1D system [12]) was found: when the mismatch takes the largest value (π)\nin any direction (horizontal or diagonal), the SSB bifurcation fails to happen, as branches of asymmetric and\nquasi-symmetric (or quasi-antisymmetric) solutions asymptotically approach each other, but never merge.\nThis work was supported, in a part, by the Israel Science Foundation through the Center-of- Excellence\nGrant No. 8006/03 and the German-Israel Foundation (GIF) through Grant No. 149/2006.\n\n[1] O. Morsch and M. Oberthaler, Rev. Mod. Phys. 78, 179 (2006).\n[2] F. Kh. Abdullaev, B. B. Baizakov, S. A. Darmanyan, V. V. Konotop, and M. Salerno, Phys. Rev. A 64, 043606\n(2001); I. Carusotto, D. Embriaco, and G. C. La Rocca, ibid. 65, 053611 (2002); B. B. Baizakov, V. V. Konotop\nand M. Salerno, J. Phys. B 35, 5105 (2002).\n[3] E. A. Ostrovskaya and Y. S. Kivshar, Phys. Rev. Lett. 90, 160407 (2003); 93, 160405 (2004); Opt. Exp. 12, 19\n(2004).\n[4] E. A. Ostrovskaya and Y. S. Kivshar, Phys. Rev. Lett. 93, 160405 (2004).\n[5] B. Eiermann, Th. Anker, M. Albiez, M. Taglieber, P. Treutlein, K.-P. Marzlin, and M. K. Oberthaler, Phys.\nRev. Lett. 92, 230401 (2004).\n[6] B. A. Malomed, Z. H. Wang, P. L. Chu, and G. D. Peng, J. Opt. Soc. Am. B 16, 1197 (1999); G. L. Alfimov,\nV. V. Konotop, and M. Salerno, Europhys. Lett. 58, 7 (2002); V. A. Brazhnyi and V. V. Konotop, Mod. Phys.\nLett. B 18, 627 (2004).\n[7] F. Dalfovo, S. Giorgini, L. P. Pitaevskii, and S. Stringari, Rev. Mod. Phys. 71, 463 (1999).\n[8] A. Trombettoni and A. Smerzi, Phys. Rev. Lett. 86, 2353-2356 (2001); G. L. Alfimov, P. G. Kevrekidis, V. V.\nKonotop, and M. Salerno, Phys. Rev. E 66, 046608 (2002).\n[9] P. G. Kevrekidis, K. Ø. Rasmussen, and A. R. Bishop, Int. J. Mod. Phys. B 15, 2833 (2001).\n[10] G. J. Milburn, J. Corney, E. M. Wright, and D. F. Walls, Phys. Rev. A 55, 4318-4324 (1997); A. Smerzi, S.\nFantoni, S. Giovanazzi, and S. R. Shenoy, Phys. Rev. Lett. 79, 4950-4953 (1997); J. Ruostekoski and D. F. Walls,\nPhys. Rev. A 58, R50-R53 (1998); S. Raghavan, A. Smerzi, S. Fantoni, and S. R. Shenoy, ibid. 59, 620-633 (1999);\nL. Salasnich, A. Parola, and L. Reatto, ibid. 60, 4171-4174 (1999); E. A. Ostrovskaya, Y. S. Kivshar, M. Lisak,\nB. Hall, F. Cattani, and D. Anderson, ibid. 61, 031601 (2000); J. E. Williams, ibid. 64, 013610 (2001); W. H.\nAschbacher , J. Frohlich, G. M. Graf, K. Schnee, and M. Troyer, J. Math. Phys. 43, 3879 (2002); L. Salasnich,\nA. Parola, and L. Reatto, J. Phys. B - At. Mol. Opt. Phys. 35, 3205 (2002); P. Coullet and N. Vandenberghe,\nibid. 35, 1593-1612 (2002); T. G. Tiecke, M. Kemmann, C. Buggle, I. Shvarchuck, W. von Klitzing, and J. T.\nM. Walraven, J. Opt. B - Quant. Semicl. Opt. 5, S119 (2003); E. Sakellari, N. P. Proukakis, and C. S. Adams,\nJ. Phys. B - At. Mol. Opt. Phys. 37, 3681 (2004); R. K. Jackson and M. I. Weinstein, J. Stat. Phys. 116, 881\n(2004); M. Jaaskelainen and P. Meystre, Phys. Rev. A 71, 043603 (2005); E. Infeld, P. Ziń, J. Gocalek, and\nM. Trippenbach, Phys. Rev. E 74, 026610 (2006); Q.-X. Yuan and G.-H. Ding, Phys. Lett. A 344, 156 (2005);\nG. Theocharis, P. G. Kevrekidis, D. J. Frantzeskakis, and P. Schmelcher, Phys. Rev. E 74, 056608 (2006); M.\nAnderlini, J. Sebby-Strabley, J. Kruse, J. V. Porto, and W. D. Phillips, J. Phys. B - At. Mol. Opt. Phys. 39,\nS199 (2006).\n[11] P. G. Kevrekidis, Z. G. Chen, B. A. Malomed, D. J. Frantzeskakis, and M. I. Weinstein, Phys. Lett. A 340, 275\n(2005).\n[12] A. Gubeskys and B. A. Malomed, Phys. Rev. A 75, 063602 (2007).\n[13] W. C. K. Mak, P. L. Chu and B. A. Malomed, J. Opt. Soc. Am. B 15, 1685 (1998); Phys. Rev. E 69, 066610\n(2004).\n[14] A. Gubeskys and B. A. Malomed, Eur. Phys. J. D 28, 283 (2004).\n[15] B. A. Malomed, D. Mihalache, F. Wise, and L. Torner, J. Optics B: Quant. Semics. Opt. 7, R53 (2005).\n[16] P. L. Chu, B. A. Malomed, and G. D. Peng, J. Opt. Soc. Am. B 10, 1379 (1993); N. Akhmediev and A. Ankiewicz,\nPhys. Rev. Lett. 70, 2395 (1993); B. A. Malomed, I. Skinner, P. L. Chu, and G. D. Peng, Phys. Rev. E 53, 4084\n(1996).\n[17] W. Mak, B. A. Malomed, and P. L. Chu, Phys. Rev. E 55, 6134 (1997); ibid. 57, 1092 (1998).\n[18] R. Driben, B. A. Malomed, and P. L. Chu, J. Phys. B: At. Mol. Opt. Phys. 39, 2455 (2006); L. Albuch and B.\nA. Malomed, Mathematics and Computers in Simulation 74, 361 (2007).\n[19] M. Matuszewski, B. A. Malomed, and M. Trippenbach, Phys. Rev. A 75, 063621 (2007).\n[20] J. Yang, B. A. Malomed, and D. J. Kaup, Phys. Rev. Lett. 83, 1958-1961 (1999); A. R. Champneys, B. A.\nMalomed, J. Yang, and D. J. Kaup, Physica D 152-153, 340 (2001).\n[21] S. Inouye, M. R. Andrews, J. Stenger, H. J. Miesner, D. M. Stamper-Kurn, and W. Ketterle, Nature 392, 51\n(1998); E. A. Donley, N. R. Claussen, S. L. Cornish, J. L. Roberts, E. A. Cornell, and C. E. Wieman, ibid. 412,\n\n\f20\n295 (2001).\n[22] V. S. Shchesnovich, B. A. Malomed, and R. A. Kraenkel, Physica D 188, 213-240 (2004); V. S. Shchesnovich, S.\nB. Cavalcanti, R. A. Kraenkel, Phys. Rev. A 69, 033609 (2004).\n[23] V. S. Shchesnovich and S. B. Cavalcanti, Phys. Rev. A 71, 023607 (2005); V. S.\nShchesnovich and S. B. Cavalcanti, J. Phys. A Math. Gen. 38, 6917 (2005).\n[24] A. A. Sukhorukov and Y. S. Kivshar. Phys. Rev. Lett. 97, 233901 (2006); Y. Tsofe and B. A. Malomed, Phys.\nRev. E 75, 056603 (2007).\n[25] L. Salasnich, Laser Phys. 12, 198 (2002); L. Salasnich, A. Parola, and L. Reatto, Phys. Rev. A 65, 043614 (2002);\nY. B. Band, I. Towers, and B. A. Malomed, Phys. Rev. A 67, 023602 (2003).\n[26] K. E. Strecker, G. B. Partridge, A. G. Truscott and R. G. Hulet, Nature 417, 150 (2002); L. Khaykovich, F.\nSchreck, G. Ferrari, T. Bourdel, J. Cubizolles, L. D. Carr, Y. Castin, and C. Salomon, Science 256, 1290 (2002).\n[27] S. L. Cornish, S. T. Thompson, and C. E. Wieman, Phys. Rev. Lett. 96, 170401 (2006).\n[28] B. B. Baizakov, M. Salerno, and B. A. Malomed, Europhys. Lett. 63, 642 (2003); see also\nan article in Nonlinear Waves:\nClassical and Quantum Aspects, ed. by F. Kh. Abdullaev and\nV. V. Konotop, pp. 61-80 (Kluwer Academic Publishers:\nDordrecht, 2004; also available at\nhttp://rsphysse.anu.edu.au/ ̃asd124/Baizakov 2004 61 NonlinearWaves.pdf).\n[29] A. Gubeskys, B. A. Malomed and I. Merhasin, Stud. Appl. Math. 115, 255 (2005).\n[30] M. Desaix, D. Anderson and M. Lisak, J. Opt. Soc. Am. B 8, 2082 (1991).\n[31] L. Bergé, Phys. Rep. 303, 259 (1998).\n[32] M. G. Vakhitov and A. A. Kolokolov, Sov. J. Radiophys. Quantum Electr. 16, 783 (1973).\n[33] J. Yang and Z. H. Musslimani, Opt. Lett. 28, 2094 (2003).\n[34] H. Sakaguchi and B. A. Malomed, J. Phys. B 37, 2225 (2004).\n[35] H. Sakaguchi and B. A. Malomed, Europhys. Lett. 72, 698 (2005).\n\n\f"}