{"id": "http://arxiv.org/abs/1011.4160v1", "guidislink": true, "updated": "2010-11-18T09:39:21Z", "updated_parsed": [2010, 11, 18, 9, 39, 21, 3, 322, 0], "published": "2010-11-18T09:39:21Z", "published_parsed": [2010, 11, 18, 9, 39, 21, 3, 322, 0], "title": "$M_F$-dependent Hyperfine Induced Transition Rates in an External\n  Magnetic Field for Be-like $^{47}$Ti$^{18+}$", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1011.4420%2C1011.4401%2C1011.4830%2C1011.2484%2C1011.1336%2C1011.6230%2C1011.0492%2C1011.4332%2C1011.5034%2C1011.1811%2C1011.1942%2C1011.1356%2C1011.1482%2C1011.2911%2C1011.3979%2C1011.0325%2C1011.0157%2C1011.6303%2C1011.3981%2C1011.1204%2C1011.0450%2C1011.3242%2C1011.3829%2C1011.0030%2C1011.0844%2C1011.2542%2C1011.4554%2C1011.0427%2C1011.0758%2C1011.5871%2C1011.1491%2C1011.4959%2C1011.4975%2C1011.3680%2C1011.5596%2C1011.2166%2C1011.1509%2C1011.2509%2C1011.0394%2C1011.4303%2C1011.0769%2C1011.5859%2C1011.1174%2C1011.4381%2C1011.3986%2C1011.1195%2C1011.2201%2C1011.1792%2C1011.1298%2C1011.5886%2C1011.0435%2C1011.4032%2C1011.1077%2C1011.3787%2C1011.5330%2C1011.4105%2C1011.1048%2C1011.5297%2C1011.6505%2C1011.1820%2C1011.2872%2C1011.4500%2C1011.2114%2C1011.6111%2C1011.5823%2C1011.5073%2C1011.0024%2C1011.2957%2C1011.0395%2C1011.3331%2C1011.4657%2C1011.2935%2C1011.5399%2C1011.3890%2C1011.4160%2C1011.4815%2C1011.3409%2C1011.1165%2C1011.0513%2C1011.6170%2C1011.2071%2C1011.6327%2C1011.3310%2C1011.5086%2C1011.1894%2C1011.0654%2C1011.5491%2C1011.5726%2C1011.1466%2C1011.0601%2C1011.0132%2C1011.4440%2C1011.1635%2C1011.5344%2C1011.5224%2C1011.6662%2C1011.2930%2C1011.2884%2C1011.4720%2C1011.0010%2C1011.5216&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "$M_F$-dependent Hyperfine Induced Transition Rates in an External\n  Magnetic Field for Be-like $^{47}$Ti$^{18+}$"}, "summary": "Hyperfine induced $2s2p~^3P_0 \\rightarrow 2s^2~^1S_0$ transition rates in an\nexternal magnetic field for Be-like $^{47}$Ti were calculated based on the\nmulticonfiguration Dirac-Fock method. It was found that the transition\nprobability is dependent on the magnetic quantum number $M_F$ of the excited\nstate, even in the weak field. The present investigation clarified that the\ndifference of the hyperfine induced transition rate of Be-like Ti ions between\nexperiment [Schippers {\\sl et al.}, Phys Rev Lett {\\bf 98}, (2007) 033001(4)]\nand theory does not result from the influence of external magnetic field.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1011.4420%2C1011.4401%2C1011.4830%2C1011.2484%2C1011.1336%2C1011.6230%2C1011.0492%2C1011.4332%2C1011.5034%2C1011.1811%2C1011.1942%2C1011.1356%2C1011.1482%2C1011.2911%2C1011.3979%2C1011.0325%2C1011.0157%2C1011.6303%2C1011.3981%2C1011.1204%2C1011.0450%2C1011.3242%2C1011.3829%2C1011.0030%2C1011.0844%2C1011.2542%2C1011.4554%2C1011.0427%2C1011.0758%2C1011.5871%2C1011.1491%2C1011.4959%2C1011.4975%2C1011.3680%2C1011.5596%2C1011.2166%2C1011.1509%2C1011.2509%2C1011.0394%2C1011.4303%2C1011.0769%2C1011.5859%2C1011.1174%2C1011.4381%2C1011.3986%2C1011.1195%2C1011.2201%2C1011.1792%2C1011.1298%2C1011.5886%2C1011.0435%2C1011.4032%2C1011.1077%2C1011.3787%2C1011.5330%2C1011.4105%2C1011.1048%2C1011.5297%2C1011.6505%2C1011.1820%2C1011.2872%2C1011.4500%2C1011.2114%2C1011.6111%2C1011.5823%2C1011.5073%2C1011.0024%2C1011.2957%2C1011.0395%2C1011.3331%2C1011.4657%2C1011.2935%2C1011.5399%2C1011.3890%2C1011.4160%2C1011.4815%2C1011.3409%2C1011.1165%2C1011.0513%2C1011.6170%2C1011.2071%2C1011.6327%2C1011.3310%2C1011.5086%2C1011.1894%2C1011.0654%2C1011.5491%2C1011.5726%2C1011.1466%2C1011.0601%2C1011.0132%2C1011.4440%2C1011.1635%2C1011.5344%2C1011.5224%2C1011.6662%2C1011.2930%2C1011.2884%2C1011.4720%2C1011.0010%2C1011.5216&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Hyperfine induced $2s2p~^3P_0 \\rightarrow 2s^2~^1S_0$ transition rates in an\nexternal magnetic field for Be-like $^{47}$Ti were calculated based on the\nmulticonfiguration Dirac-Fock method. It was found that the transition\nprobability is dependent on the magnetic quantum number $M_F$ of the excited\nstate, even in the weak field. The present investigation clarified that the\ndifference of the hyperfine induced transition rate of Be-like Ti ions between\nexperiment [Schippers {\\sl et al.}, Phys Rev Lett {\\bf 98}, (2007) 033001(4)]\nand theory does not result from the influence of external magnetic field."}, "authors": ["Jiguang Li", "Chenzhong Dong", "Per Jönsson", "Gediminas Gaigalas"], "author_detail": {"name": "Gediminas Gaigalas"}, "author": "Gediminas Gaigalas", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1016/j.physleta.2010.12.081", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1011.4160v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1011.4160v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "physics.atom-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "physics.atom-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1011.4160v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1011.4160v1", "arxiv_comment": null, "journal_reference": null, "doi": "10.1016/j.physleta.2010.12.081", "fulltext": "arXiv:1011.4160v1 [physics.atom-ph] 18 Nov 2010\n\nMF -dependent Hyperfine Induced Transition Rates in\nan External Magnetic Field for Be-like 47Ti18+\nJiguang Li\n1\n\n2\n\n1 ∗\n, Chenzhong\n\nDong\n\n1,2 †,\n\nPer Jönsson\n\n3\n\nand Gediminas Gaigalas\n\n4,5\n\nCollege of Physics and Electronic Engineering, Northwest Normal University, Lanzhou 730070, China\nKey Laboratory of Atomic and Molecular Physics & Functional Materials of Gansu Province, Lanzhou 730070, China\n3\n4\n\nCenter for Technology Studies, Malmö University, Malmö S-20506, Sweden\n\nDepartment of Physics, Vilnius Pedagogical University, Studentu̧ 39, Vilnius LT-08106, Lithuania\n5\n\nInstitute of Theoretical Physics and Astronomy, A. Gostautǒ 12, Vilnius LT-01108, Lithuania\n\nAbstract\nHyperfine induced 2s2p 3 P0 → 2s2 1 S0 transition rates in an external magnetic\nfield for Be-like\n\n47 Ti\n\nwere calculated based on the multiconfiguration Dirac-Fock\n\nmethod. It was found that the transition probability is dependent on the magnetic\nquantum number MF of the excited state, even in the weak field. The present\ninvestigation clarified that the difference of the hyperfine induced transition rate\nof Be-like Ti ions between experiment [Schippers et al., Phys Rev Lett 98, (2007)\n033001(4)] and theory does not result from the influence of external magnetic field.\n\nPACS: 31.30.Gs, 32.60.+i\nKeywords: Hyperfine induced transition; Zeeman effect; MCDF method.\n∗\n\nPresent address: Chimie Quantique et Photophysique, CP 160/09, Université Libre de Bruxelles,\n\nBrussels B-1050, Belgium.\n†\nCorrespondence author: Dongcz@nwnu.edu.cn\n\n1\n\n\f1\n\nIntroduction\n\nThe hyperfine induced transition (HIT) rate of the 2s2p 3 P0 level for Be-like\n\n47\n\nTi ions has\n\nbeen measured with high accuracy by means of resonant electron-ion recombination in the\nheavy-ion storage-ring TSR of the Max-Planck Institute for Nuclear Physics, Heidelberg,\nGermany [1]. However, the measured transition rate AHIT = 0.56(3) s−1 differs from all\npresent theoretical results AHIT ≈ 0.67 s−1 [2, 3, 4] by about 20%. In the theoretical\ncalculations the major part of the electron correlation, which always causes the dominant\nuncertainty, has been taken into account very elaborately. As a result, it is desirable to\nfind out other reasons for the difference.\nIn this letter, we focus on the influence of the magnetic field present in the heavy-ion\nstorage-ring on the HIT rate. The HIT rate in an external magnetic field depends on the\nmagnetic quantum number MF of the excited state, even in a relatively weak field. This\neffect, combined with the non-statistical distribution of the magnetic sublevel population\nof the excited level, might lead to the difference in transition rate mentioned above.\n\n2\n\nTheory\n\nIn presence of the magnetic field, the Hamiltonian of an atom with non-zero nuclear spin\nI is\nH = Hf s + Hhf s + Hm ,\n\n(1)\n\nwhere Hf s is the relativistic fine-structure Hamiltonian that includes the Breit interaction. Hhf s is the hyperfine interaction Hamiltonian, which can be written as a multipole\nexpansion\nHhf s =\n\nX\n\nT(k) * M(k) ,\n\n(2)\n\nk61\n\nwhere T(k) and M(k) are spherical tensor operator in electronic and nuclear space, respectively [5]. Hm is the interaction Hamiltonian with the external homogeneous magnetic field\nB,\nHm = (N(1) + ∆N(1) ) * B,\n\n(3)\n\nwhere N(1) are first-order tensor with the similar form of T(1) , ∆N(1) is the so called\nSchwinger QED correction [6].\n\n2\n\n\fWe choose the direction of the magnetic field as the z-direction, and only MF is a\ngood quantum number. The wavefunction of the atomic system can thus be written as an\nexpansion\ne Fi =\n|ΥΓIM\n\nX\n\ndΓJF |ΥΓIJF MF i.\n\n(4)\n\nΓJF\n\nThe total angular momentum F is coupled by the nuclear I and electronic J angular momentum. The Υ and Γ are the other quantum numbers labeling the nuclear and electronic\nstates, respectively.\nThe coefficients dΓJF in Eq. (4) are obtained through solving the eigenvalue equation\nusing HFSZEEMAN package [7]\nHd = Ed,\n\n(5)\n\nwhere H is the interaction matrix with elements\nHΓJF,Γ′ J ′ F ′ = hΥΓIJF MF |Hf s + Hhf s + Hm |ΥΓ′ IJ ′ F ′ MF i.\n\n(6)\n\nThe readers are referred to Ref. [6, 7] for a detailed derivation of the different matrix\nelements .\nFor the present problem, the wavefunction of the 3 P0 state can be written\n|\"2s2p 3 P0 I MF \"i = d0 |2s2p 3 P0 I F (= I) MF i +\n\nX\n\ndS;F ′ |2s2p S P1 I F ′ MF i. (7)\n\nS(=1,3);F ′\n\nThe quotation marks in the left-hand wave function emphasize the fact that the notation is\njust a label indicating the dominant character of the eigenvector. Remaining interactions\nbetween 2s2p 3 P0 and higher members of the Rydberg series can be neglected due to large\nenergy separations and comparatively weak hyperfine couplings [8]. Furthermore, those\nperturbative states with different total angular momentum F can be neglected because of\nrelatively weak magnetic interaction. As a result, Eq. (7) is simplified to\n|\"2s2p 3 P0 I MF \"i = d0 |2s2p 3 P0 I F (= I) MF i +\n\nX\n\ndS |2s2p S P1 I F (= I) MF i. (8)\n\nS=1,3\n\nSimilarly, the wavefunction of the ground state is approximatively written\n|\"2s2 1 S0 I MF \"i = |2s2 1 S0 I F (= I) MF i,\nwhere all perturbative states were neglected for the same reasons as mentioned above.\n3\n\n(9)\n\n\fThe one-photon 2s2p 3 P0 → 2s2 1 S0 E1 transition becomes allowed via mixing with\nthe perturbative states of 2s2p 3 P1 and 2s2p 1 P1 (see Eq. (8)) induced by both the offdiagonal hyperfine interaction and the interaction with the magnetic field. The decay rate\na(MFe )HIT from the excited state |\"2s2p 3 P0 I MFe \"i to the ground state |\"2s2 1 S0 I MFg \"i\nin s−1 is given by\na(MFe )HIT =\n\n2.02613 × 1018 X\n|h\"2s2 1 S0 I MFg \"|Pq(1) |\"2s2p 3 P0 I MFe \"i|2 ,\nλ3\nq\n\n(10)\n\nSubstitute Eq. (8) and (9) into above formula, then\np\n2.02613 × 1018 X X p g\n|\ndS 2F (= I) + 1 2F e (= I) + 1\n3\nλ\nq\nS\n!(\n)\nF g (= I) 1 F e (= I)\nJ g (= 0) F g (= I) I\nh2s2 1 S0 ||P (1) ||2s2p S P1 i|2.\n×\nF e (= I) J e (= 1) 1\n−MFg (=I) q MFe e (=I)\n\na(MFe )HIT =\n\n(11)\nApplying standard tensor algebra, the Eq. (11) is further simplified to\n!\n18\nX\nX\nI\n1\nI\n2.02613 × 10\n(2I+1)\n|\ndS\nh2s2 1 S0 ||P (1) ||2s2p S P1 i|2 ,\na(MFe )HIT =\ng\n3\ne\n3λ\n−MI q MI\nq\nS\n(12)\n\nwhere λ is the wavelength in Å for the transition and h2s2 1 S0 ||P (1) ||2s2p S P1 i the reduced\nelectronic transition matrix element in a.u..\nFrom the Eq. (12) we can obtain the Einstein spontaneous emission transition probability [9]\nA(MFe )HIT =\n\nX\n\na(MFe )HIT\n\nMFg\n\n=\n\n2.02613 × 1018 X\n|\ndS h2s2 1 S0 ||P (1) ||2s2p S P1 i|2 .\n3λ3\nS\n\n(13)\n\nIt should be noticed that in present approximation of weak magnetic field, i.e., neglecting those perturbative states with different total angular quantum number F , the formula\nfor the transition rate (see Eq. 13) is similar to the one where the transition is induced\nby only hyperfine interaction [2, 3]. However, a significant difference exists in the mixing\ncoefficients dS by virtue of incorporating the magnetic interaction into the Hamiltonian for\nthe present work.\n4\n\n\fThe electronic wavefunctions are computed using the GRASP2K program package [10].\nHere the wavefunction for a state labeled γJ is approximated by an expansion over jjcoupled configuration state functions (CSFs)\n|γJi =\n\nX\n\nci Φ(γi J).\n\n(14)\n\ni\n\nIn the multi-configuration self-consistent field (SCF) procedure both the radial parts of\nthe orbitals and the expansion coefficients ci are optimized to self-consistency. In the\npresent work a Dirac-Coulomb Hamiltonian is used, and the nucleus is described by an\nextended Fermi charge distribution [11]. The multi-configuration SCF calculations are\nfollowed by relativistic CI calculations including Breit interaction and leading QED effects.\nIn addition, a biorthogonal transformation technique introduced by Malmqvist [12, 13] is\nused to compute reduced transition matrix elements where the even and odd parity wave\nfunctions are built from independently optimized orbital sets.\n\n3\n\nResults and discussion\n\nAs a starting point SCF calculations were done for the configurations belonging to the\neven and odd complex of n = 2, respectively. Valence correlation was taken into account\nby including CSFs obtained by single (S) and double (D) excitations from the even and\nodd reference configurations to active sets of orbitals. The active sets were systematically increased up to n 6 5. The SCF calculations were followed by CI calculations in\nwhich core-valence and core-core correlations and the Breit interaction and QED effects\nwere incorporated. Based on this correlation model, we calculated the hyperfine induced\n2s2p 3 P0 → 2s2 1 S0 E1 transition rate for Be-like 47 Ti ions in absence of the magnetic field\nto AHIT = 0.66 s−1 , where the experimental wavelength 346.99 Å [14] was used to re-scaled\nthe rate.1 The value is in good agreement with the other theoretical results: AHIT = 0.67\ns−1 by Cheng et al. [2] and AHIT = 0.677 s−1 by Andersson et al. [3].\nRecent theoretical calculations are all in disagreement with the experimental measurement A = 0.56(3) s−1 [1] by about 20%. It is hypothezised that the discrepancy results\nfrom the effect of magnetic field present in the storage ring. Actually, the magnetic field\n1\n\nThe nucleus of\n\n47\n\nTi has the nuclear spin I = 5/2, nuclear dipole moment μ = −0.78848 in μN and\n\nelectric quadrupole moment Q = 0.3 in barns [15].\n\n5\n\n\feffect has already been noticed and been discussed in previous experiment measuring the\nlifetime of the hyperfine state of metastable level 5d 4 D7/2 for Xe\n\n+\n\nusing the ion storage\n\nring CRYRING at the Manne Siegbahn Laboratory (Stockholm) [16]. Returning to the\npresent problem, experiment was conducted in the heavy-ion storage-ring TSR where the\nrigidity of the ion beam is given as B × ρ = 0.8533 T [1], and the bending radius of the\nstorage ring dipole magnets is ρ = 1.15m [17]. As a result, the magnetic field in the experiment has been 0.742 T. Considering the factual experimental environment, we calculated\nthe hyperfine induced 2s2p 3 P0 → 2s2 1 S0 E1 transition rate of Be-like\n\n47\n\nTi ion in the\n\nexternal magnetic field B=0.5 T, B=0.742 T and B=1 T, respectively. With assistance\nof Eq. (12) and Eq. (13), we obtained the transition rate a(MFe )HIT from the excited\nZeeman state to the ground Zeeman state, the Einstein transition probability A(MFe )HIT\nof the excited state, and the corresponding lifetime τ . Computational results are displayed\nin Table 1. As can be seen from this table, the transition rates A(MFe )HIT for each of\nthe individual excited states \"2s2p 3 P0 I MFe \" are obviously different because the mixing\ncoefficients dS in Eq. (13) depend on the magnetic quantum number MFe of the excited\nstate.\nAs can be found from Table 1, the lifetime of 3 P0 level is still not sensitive to the\nsublevel specific lifetimes, if the magnetic sublevels are populated statistically (the lifetimes\nP\ne\nτ =\nM e τ (MF )/(2I + 1) = 1.52s, 1.52s, 1.53s in the external magnetic field B=0.5T,\nF\n\n0.742T and 1T, respectively). In this case, the zero-field lifetime within the exponential\n\nerror can be obtained, as made in Ref. [1], through only a fit of one exponential decay\ncurve instead of 6 exponential decay curves with slightly different decay constants. To the\ncontrary, in the experiment measuring the HIT rate of the 2s2p 3 P0 level of the Be-like\nTi ion, the level concerned was produced through beam-foil excitation [18]. As we know,\nthe cross sections with magnetic sublevels for ion-atom collision are different [19, 20], and\nthe magnetic sublevel population is in general not statistically distributed. Combining this\nfact with the MF -dependent HIT rate in an external field, the transition probability of 3 P0\nlevel cannot be obtained by statistical average over all magnetic sublevel. However, we also\nnoticed that an external magnetic field can lower the transition rate only for those magnetic\nsublevels with MF > 0. In other word, only if these specific magnetic sublevels with\nMF > 0 were populated, it is possible to explain or decrease the discrepancy between the\nmeasured and theoretical HIT rates for Be-like 47 Ti. In fact, such extreme orientation of the\nstored ions seems improbable by means of beam-foil excitation. Moreover, the experimental\n6\n\n\fheavy-ion storage-ring was only partly covered with dipole magnets (this fraction amounts\nto 13%) [17]. It further reduces the influence of magnetic field on the lifetime of level.\nTherefore, we still cannot clarify the disagreement between experimental measurement\nand theoretical calculations at present even though the influence of an external magnetic\nfield was taken into account.\n\n4\n\nSummary\n\nTo sum up, we have calculated the hyperfine induced 2s2s 3 P0 → 2s2 1 S0 E1 transition rate\nin an external magnetic field for each of the magnetic sub-hyperfine levels of\n\n47\n\nTi18+ ions\n\nbased on the multiconfiguration Dirac-Fock method. It was found that the transition rate\nis dependent on the magnetic quantum number MFe of the excited state, even in relatively\nweak magnetic fields. Considering the influence of an external magnetic field, we still did\nnot explain the difference in the HIT rate of Be-like Ti ion between experiment and theory.\n\nAcknowledgment\nWe would like to gratefully thank Prof. Stefan Schippers and Prof. Jianguo Wang for helpful discussions. The referees' very valuable suggestions should be acknowledged. This work\nis supported by the National Nature Science Foundation of China (Grant No. 10774122,\n10876028), the specialized Research Fund for the Doctoral Program of Higher Education\nof China (Grant No. 20070736001) and the Foundation of Northwest Normal University\n(NWNU-KJCXGC-03-21). Financial support by the Swedish Research Council is gratefully acknowledged.\n\nReferences\n[1] S. Schippers et al., Phys. Rev. Lett 98, (2007) 033001(4).\n[2] K. T. Cheng, M. H. Chen and W. R. Johnson, Phys. Rev. A 77 (2008) 052504(14).\n[3] M. Andersson, Y. Zou, R. Hutton and T. Brage, Phys. Rev. A 79 (2009) 032501(15).\n[4] J. G. Li and C. Z. Dong, Plasma Sci. Tech. 12 (2010) 364-368.\n7\n\n\f[5] C. Schwartz, Phys. Rev. 97 (1955) 380-395.\n[6] K. T. Cheng and W. J. Childs, Phys. Rev. A 31 (1985) 2775-2784.\n[7] M. Andersson and P. Jönsson, Comput. Phys. Commun. 178 (2008) 156-170.\n[8] T. Brage, P. G. Judge, A. Aboussaı̈d, M. R. Godefroid, P. Jönsson, A. Ynnerman, C.\nFroese Fischer and D. S. Leckrone, ApJ 500 (1998) 507-521.\n[9] R. D. Cowan, The theory of atomic and struture and spectra, (University of Califonia,\nBerkely, 1981).\n[10] P. Jönsson, X. He, C. Froese Fischer and I.P. Grant, Comput. Phys. Commun. 177\n(2007) 597-622.\n[11] F. A. Parpia and A. K. Mohanty, Phys. Rev. A 46 (1992) 3735-3745.\n[12] P. Å. Malmqvist, Int. J. Quant. Chem. 30 (1986) 479-494.\n[13] J. Olsen, M. Godefroid, P. Jönsson, P.Å. Malmqvist and C. Froese Fischer, Phys. Rev.\nE 52 (1995) 4499-4508.\n[14] Y. Ralchenko, A. E. Kramida, J. Reader and NIST ASD Team (2008). NIST Atomic\nSpectra Database (v 3.1.5) [online]. Available : http://physics.nist.gov/asd3\n[2008, June 26] National Institute of Standards and Technology, Gaithersburg, MD.\n[15] N. J. Stone, At. Data Nucl. Data Tables 90 (2005) 75-176.\n[16] S. Mannervik et al., Phys. Rev. Lett. 76 (1996) 3675-3678.\n[17] P. Baumann et al., Nucl. Instrum. Methods A 268 (1988) 531-537.\n[18] S. Schippers, (private communication).\n[19] F. H. Mies, Phys. Rev. A 7 (1973) 942-957, 957-967.\n[20] Th. Stoehlker, et al. Phys. Rev. A 57 (1998) 845-854.\n\n8\n\n\fTable 1: Hyperfine induced 2s2p 3 P0 → 2s2 1 S0 E1 transition rates in presence of magnetic\nfield B=0.5 T, B=0.742 T and B=1 T for Be-like\n\n47\n\nTi ion. a represents the transition\n\nprobability from the excited state \"2s2p 3 P0 I MFe \" to the ground state \"2s2 1 S0 I MFg \",\nA is the Einstein transition probability from the excited state \"2s2p 3 P0 I MFe \". τ is the\nlifetime of excited state \"2s2p 3 P0 I MFe \". The experimental wavelength (λ) 346.99 Å[14]\nwas used in this calculations, where the influence of hyperfine interaction and magnetic\nfield was neglected.\nB=0.5 T\nMeF\n\nMgF\n\n∆M\n\n5/2\n\n5/2\n\n3/2\n\n1/2\n\n-1/2\n\n-3/2\n\n-5/2\n\nB=0.742 T\n\nB=1 T\n\na (s−1 )\n\nA (s−1 )\n\nτ (s)\n\na (s−1 )\n\nA (s−1 )\n\nτ (s)\n\na (s−1 )\n\nA (s−1 )\n\nτ (s)\n\n0\n\n0.44\n\n0.61\n\n1.64\n\n0.42\n\n0.59\n\n1.71\n\n0.40\n\n0.56\n\n1.78\n\n3/2\n\n-1\n\n0.17\n\n5/2\n\n1\n\n0.18\n\n0.60\n\n1.67\n\n3/2\n\n0\n\n0.16\n\n0.16\n\n0.15\n\n1/2\n\n-1\n\n0.29\n\n0.28\n\n0.27\n\n3/2\n\n1\n\n0.30\n\n0.64\n\n1.56\n\n0.68\n\n1.47\n\n0.73\n\n1.38\n\n0.77\n\n1.30\n\n0.17\n0.63\n\n0.65\n\n1.59\n\n0.18\n\n1.54\n\n0.30\n\n0.16\n0.62\n\n0.65\n\n1.62\n\n1.55\n\n0.17\n\n0.29\n\n1/2\n\n0\n\n0.02\n\n0.02\n\n0.02\n\n-1/2\n\n-1\n\n0.33\n\n0.33\n\n0.33\n\n1/2\n\n1\n\n0.35\n\n-1/2\n\n0\n\n0.02\n\n0.02\n\n0.02\n\n-3/2\n\n-1\n\n0.31\n\n0.31\n\n0.31\n\n-1/2\n\n1\n\n0.32\n\n-3/2\n\n0\n\n0.18\n\n0.18\n\n0.19\n\n-5/2\n\n-1\n\n0.20\n\n0.20\n\n0.21\n\n-3/2\n\n1\n\n0.20\n\n-5/2\n\n0\n\n0.51\n\n0.67\n\n0.69\n\n0.71\n\n1.49\n\n0.35\n\n1.44\n\n0.32\n\n1.40\n\n0.21\n0.53\n\n9\n\n0.68\n\n0.71\n\n0.74\n\n1.48\n\n1.41\n\n1.35\n\n0.35\n\n0.33\n\n0.22\n0.55\n\n\f"}