{"id": "http://arxiv.org/abs/1101.0696v1", "guidislink": true, "updated": "2011-01-04T10:37:55Z", "updated_parsed": [2011, 1, 4, 10, 37, 55, 1, 4, 0], "published": "2011-01-04T10:37:55Z", "published_parsed": [2011, 1, 4, 10, 37, 55, 1, 4, 0], "title": "Efimov Trimers in a Harmonic Potential", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1101.0278%2C1101.4568%2C1101.3470%2C1101.4284%2C1101.5582%2C1101.4292%2C1101.1034%2C1101.5903%2C1101.3168%2C1101.1031%2C1101.3229%2C1101.0333%2C1101.1367%2C1101.5712%2C1101.3913%2C1101.4965%2C1101.3426%2C1101.2808%2C1101.3189%2C1101.3915%2C1101.6036%2C1101.1507%2C1101.2043%2C1101.0949%2C1101.0696%2C1101.0823%2C1101.1068%2C1101.2228%2C1101.5275%2C1101.5479%2C1101.3163%2C1101.5170%2C1101.3994%2C1101.5685%2C1101.1676%2C1101.0055%2C1101.5680%2C1101.5486%2C1101.2734%2C1101.0759%2C1101.5614%2C1101.0834%2C1101.1282%2C1101.4180%2C1101.5209%2C1101.0561%2C1101.4033%2C1101.1378%2C1101.3222%2C1101.2487%2C1101.5943%2C1101.5925%2C1101.0553%2C1101.4459%2C1101.0300%2C1101.1032%2C1101.5192%2C1101.2999%2C1101.1158%2C1101.5116%2C1101.4860%2C1101.3925%2C1101.1281%2C1101.4373%2C1101.0138%2C1101.5979%2C1101.5541%2C1101.4357%2C1101.3390%2C1101.2140%2C1101.5815%2C1101.2190%2C1101.3635%2C1101.0076%2C1101.3186%2C1101.5100%2C1101.6066%2C1101.5581%2C1101.2933%2C1101.3589%2C1101.3157%2C1101.5648%2C1101.1759%2C1101.2591%2C1101.1743%2C1101.1698%2C1101.4990%2C1101.4368%2C1101.4586%2C1101.0006%2C1101.1928%2C1101.5395%2C1101.3529%2C1101.3104%2C1101.0469%2C1101.0441%2C1101.3920%2C1101.2251%2C1101.3281%2C1101.2338%2C1101.5101&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Efimov Trimers in a Harmonic Potential"}, "summary": "We study the Efimov effect in a harmonic oscillator in the hyperspherical\nformulation, and show how a reduced model allows for a description that is a\ngeneralization of the Efimov effect in free space and leads to results that are\neasily interpreted. Efimov physics may be observed by varying the value of the\nscattering length, since in the regime where the trimers have a mixed harmonic\noscillator and Efimov character, the inelastic properties of these states are\nstill manageable. The model also allows for the study of non-universal Efimov\ntrimers by including the effective range scattering parameter. While we find\nthat in a certain regime the effective range parameter can take over the role\nof the three-body parameter, interestingly, we obtain a numerical relationship\nbetween these two parameters different from what was found in other models.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1101.0278%2C1101.4568%2C1101.3470%2C1101.4284%2C1101.5582%2C1101.4292%2C1101.1034%2C1101.5903%2C1101.3168%2C1101.1031%2C1101.3229%2C1101.0333%2C1101.1367%2C1101.5712%2C1101.3913%2C1101.4965%2C1101.3426%2C1101.2808%2C1101.3189%2C1101.3915%2C1101.6036%2C1101.1507%2C1101.2043%2C1101.0949%2C1101.0696%2C1101.0823%2C1101.1068%2C1101.2228%2C1101.5275%2C1101.5479%2C1101.3163%2C1101.5170%2C1101.3994%2C1101.5685%2C1101.1676%2C1101.0055%2C1101.5680%2C1101.5486%2C1101.2734%2C1101.0759%2C1101.5614%2C1101.0834%2C1101.1282%2C1101.4180%2C1101.5209%2C1101.0561%2C1101.4033%2C1101.1378%2C1101.3222%2C1101.2487%2C1101.5943%2C1101.5925%2C1101.0553%2C1101.4459%2C1101.0300%2C1101.1032%2C1101.5192%2C1101.2999%2C1101.1158%2C1101.5116%2C1101.4860%2C1101.3925%2C1101.1281%2C1101.4373%2C1101.0138%2C1101.5979%2C1101.5541%2C1101.4357%2C1101.3390%2C1101.2140%2C1101.5815%2C1101.2190%2C1101.3635%2C1101.0076%2C1101.3186%2C1101.5100%2C1101.6066%2C1101.5581%2C1101.2933%2C1101.3589%2C1101.3157%2C1101.5648%2C1101.1759%2C1101.2591%2C1101.1743%2C1101.1698%2C1101.4990%2C1101.4368%2C1101.4586%2C1101.0006%2C1101.1928%2C1101.5395%2C1101.3529%2C1101.3104%2C1101.0469%2C1101.0441%2C1101.3920%2C1101.2251%2C1101.3281%2C1101.2338%2C1101.5101&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We study the Efimov effect in a harmonic oscillator in the hyperspherical\nformulation, and show how a reduced model allows for a description that is a\ngeneralization of the Efimov effect in free space and leads to results that are\neasily interpreted. Efimov physics may be observed by varying the value of the\nscattering length, since in the regime where the trimers have a mixed harmonic\noscillator and Efimov character, the inelastic properties of these states are\nstill manageable. The model also allows for the study of non-universal Efimov\ntrimers by including the effective range scattering parameter. While we find\nthat in a certain regime the effective range parameter can take over the role\nof the three-body parameter, interestingly, we obtain a numerical relationship\nbetween these two parameters different from what was found in other models."}, "authors": ["Jacobus Portegies", "Servaas Kokkelmans"], "author_detail": {"name": "Servaas Kokkelmans"}, "author": "Servaas Kokkelmans", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1007/s00601-011-0237-6", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1101.0696v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1101.0696v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "15 pages, 9 figures", "arxiv_primary_category": {"term": "cond-mat.quant-gas", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.quant-gas", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1101.0696v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1101.0696v1", "journal_reference": "Few-Body Syst. 51, 219 (2011)", "doi": "10.1007/s00601-011-0237-6", "fulltext": "Few-Body Systems manuscript No.\n(will be inserted by the editor)\n\nJacobus Portegies * Servaas Kokkelmans\n\narXiv:1101.0696v1 [cond-mat.quant-gas] 4 Jan 2011\n\nEfimov Trimers in a Harmonic Potential\n\nReceived: date / Accepted: date\n\nAbstract We study the Efimov effect in a harmonic oscillator in the hyperspherical formulation, and\nshow how a reduced model allows for a description that is a generalization of the Efimov effect in free\nspace and leads to results that are easily interpreted. Efimov physics may be observed by varying the\nvalue of the scattering length, since in the regime where the trimers have a mixed harmonic oscillator\nand Efimov character, the inelastic properties of these states are still manageable. The model also allows\nfor the study of non-universal Efimov trimers by including the effective range scattering parameter.\nWhile we find that in a certain regime the effective range parameter can take over the role of the\nthree-body parameter, interestingly, we obtain a numerical relationship between these two parameters\ndifferent from what was found in other models.\nKeywords Efimov effect * Optical lattice * Feshbach resonance * Effective range\n\n1 Introduction\nIn 1970, Efimov described a phenomenon occurring in a three-particle system of identical bosons, in\nwhich there is an accumulation of bound states near the point of zero energy and diverging scattering\nlength of the interparticle interaction [1]. Efimov was inspired by the physics of the nucleus of the\ntritium atom. However, the experimental signature for the existence of such Efimov states was not\nobserved in nuclear physics, but in a gas of ultracold cesium atoms [2] by studying three-body recombination. The reason that properties predicted for nuclear physics few-body systems can be derived\nfrom ultracold atoms lies in the fact that the two systems are connected through universal relations,\nthat are irrespective of the specific nature of the interparticle interactions.\nSince the first observations in cesium, the Efimov effect has received a lot of attention [3; 4]. Several\ngroups now have observed Efimov physics by studying three-body recombination in a variety of atomic\nsystems [5; 6; 7; 8; 9; 10; 11; 12; 13; 14]. Evidence for the existence of trimers appears as some distinct\nfeatures (resonances) in the recombination rate coefficient. In Fig. 1 the energies of the Efimov trimers\nare shown, as a function of the inverse two-body scattering length 1/a.\nA crucial advantage of ultracold atoms with respect to nuclear systems is that the interparticle\ninteractions can be easily manipulated using Feshbach resonances [15; 16], by varying the magnetic\nfield. The two-body scattering length, which is obtained from the scattering phase shift δ(k) as a =\n− limk→0 tan δ(k)/k, diverges on resonance to infinity, and is typically described by the dispersive\nformula\nSpecial issue devoted to Efimov physics\nEindhoven University of Technology, P.O. Box 513, 5600 MB Eindhoven, The Netherlands\nE-mail: jim@cims.nyu.edu, s.kokkelmans@tue.nl\nPresent address of Jacobus Portegies: Courant Institute of Mathematical Sciences, 251 Mercer Street, New\nYork, NY 10012-1185, United States\n\n\f2\n\nK\n\n1\u0090a\n\n√\nFig. 1 A schematic description of the Efimov effect: shown is the wavenumber K ∼ E, indicating dimer and\nEfimov trimer states as a function of the inverse scattering length 1/a. The horizontal line K = 0 indicates\nthe threshold to the three-body scattering continuum (gray). Simultaneously, the blue region marks the atomdimer continuum for a > 0, and the green zone indicates the trimer region. The dimer binding energy scales\nas −1/a. Only a few Efimov states are shown. The figure is not to scale: for clarity reasons we plotted instead\nof K the quantity H 1/4 sin ξ, and instead of 1/a the quantity H 1/4 cos ξ (cf. Eq. (3)).\n\n\u0012\na = abg 1 −\n\n∆B\nB − B0\n\n\u0013\n,\n\n(1)\n\nwith abg the background value of the scattering length, B the magnetic field, B0 the resonance position,\nand ∆B the width of the resonance. This possibility to change the scattering length allowed for the\nobservation of distinct Efimov features in the three-body recombination rate, connected to two different\nEfimov states in a row [6; 8], confirming the scaling law [1; 17] given by\nETn+1 /ETn = e−2π/s0 ≈ 1/515,\n\n(2)\n\nwith s0 = 1.00624 a constant. Moreover, recent developments extended the universal few-body physics\nto the domain of four-body states which was theoretically predicted [18] and experimentally verified [8;\n19].\nIn most of the experiments, Efimov physics has been observed only indirectly via three-body recombination [17]. Due to the short lifetime of these states, it is difficult to probe the Efimov states\ndirectly. These weakly-bound trimers are not only unstable in collisions with other particles, but they\nare also intrinsically unstable by itself, as trimers may decay to a deeper lying dimer state and an\nunbound atom. However, the group of Jochim in Heidelberg recently succeeded in associating Efimov\ntrimers directly via a new and promising approach using radio-frequency fields [20].\nOptical lattices might provide more experimental control, and potentially give rise to an enhanced\nlifetime of Efimov trimers. Efimov physics can be studied in this way by loading three atoms in each\nlattice site. When the lattice is deep enough, single sites act as harmonic oscillator potentials where\nindividual trimers can be trapped. A possible advantage is then that the interparticle separation of\nthe trimers can be increased to the scale of the harmonic oscillator length, while their properties are\nstill determined by Efimov physics. In this way the overlap of these states with deeply bound dimers is\nreduced, thereby suppressing the process of three-body recombination. The influence of other limiting\nprocesses, where four or more particles involved, will be reduced as well.\nJonsell, Heiselberg and Pethick were the first to introduce an harmonic oscillator term in a threebody system [21], by adapting the approach of Ref. [22]. For diverging scattering length, they found\nexact expressions for the bound states of three identical bosons, while they obtained numerical results\nfor finite scattering length. Later, Werner and Castin [23] obtained additional analytical results for\ndiverging scattering length, and complimentary first-order corrections for large scattering length. Stoll\n\n\f3\n\nand Köhler [24] performed numerical simulations with a tunable separable potential to find the bound\nstates of three particles in a trap. Thøgersen et al. found numerical solutions of three particles in a\nharmonic trap [25], mainly to study the non-universal corrections to the Efimov effect that come from\nthe effective range. More recently, Liu, Hu and Drummond derived an analytical description of three\nattractively interacting fermions in a harmonic trap [26].\nA convenient description of the Efimov effect in free space is presented in Ref. [17], in which polar\ncoordinates H and ξ are introduced, which are related to the wave number or energy parameter K\nand the scattering length a via\nK = H sin ξ,\n1\n= H cos ξ.\na\n\n(3a)\n(3b)\n\nUsing Efimov's radial law, it is derived that\nH = κ∗ e∆(ξ)/2s0 e−nπ/s0 ,\n\n(4)\n\nfor a function ∆ : [−π, −π/4] → R. Here κ∗ is the three-body parameter that defines the trimer\nenergies exactly on resonance as ETn = −e−2nπ/s0 ~2 κ2∗ /m, with m the mass of a single atom, and is\na result of the short-range behavior of three particles being close together. The combinations of K\nand ξ that yield bound states describe a family of curves that can be mapped on top of each other by\nmultiplying the distance of the curves to the origin by a factor eπ/s0 , see Fig. 1.\nIn this paper, we extend the description of Ref. [17] and show how by introducing the harmonic\noscillator length as a new parameter, and by using spherical coordinates in parameter space, the scaling\nbehavior in free space very naturally generalizes to a situation with three particles in a harmonic trap.\nIn particular, the curves that are shown in Fig. 1 will be replaced by surfaces that are mapped on top\nof each other. In the derivation, we use an approach slightly different from earlier work, that calculates\nthe equivalent of the function ∆ by solving an ordinary differential equation. Additionally, we also\ninclude the coupling terms, we investigate the stability of the trimers in the lattice, and we study the\nnon-universal corrections coming from the effective range parameter.\n2 Framework\nWe consider a system of three bosons with pair interactions trapped in a harmonic potential. The\ncorresponding Hamiltonian is\nH=−\n\n1 X 2 X\n1X\nri +\nVi ,\n∆i +\n2\n2 a4ho\ni\n\ni\n\n(5)\n\ni\n\np\nwhere aho = ~/mω is the harmonic oscillator length, ω the trap frequency, and Vi is the interaction\nbetween the particles j, k, with (i, j, k) a cyclic permutation of (1, 2, 3). For convenience, the Hamiltonian is scaled by a factor m/~2 . Throughout this paper, we will denote the eigenvalues of H by E, and\nthe corresponding trimer energies by ET = ~2 E/m. To find the bound state energies, we closely follow\nthe method described in Ref. [22] and Ref. [17]. We denote the permutation operator corresponding to\none cyclic permutation of (1, 2, 3) by P and transform to the Faddeev operator\nF =−\n\n1X\n1 X 2\n∆i +\nri + V (I + P + P † ).\n2\n2 a4ho\ni\n\n(6)\n\ni\n\nIf Ψ is an eigenfunction of F , (I + P + P † )Ψ is an eigenfunction of H, provided it is nonzero. In case\n(I + P + P † )Ψ = 0, Ψ is called a spurious solution. We separate the center of mass motion, and consider\nthe relative system in hyperspherical coordinates. For that, we introduce Jacobi-coordinates according\nto\nq\nri,jk = 23 (ri − 12 (rj + rk )),\n(7)\nq\nrjk = 12 (rj − rk ).\n(8)\n\n\f4\n\nThe hyperradius R and the hyperangle α are defined by\n1 2\n2\n2\n2\n2\n(r + rjk\n+ rki\n) = ri,jk\n+ rjk\n,\n3 ij\n= R cos αi ,\n\n(10)\n\n= R sin αi .\n\n(11)\n\nR2 =\n2\nri,jk\n2\nrjk\n\n(9)\n\nThe remaining hyperspherical coordinates are given by the unit vectors r̂i,jk and r̂jk .\nWe restrict ourselves to states with zero total angular momentum. The advantage of considering\nthe Faddeev rather than the Schrödinger operator is that subsystem angular momentum comes in\nonly at second order in the short-range potential [27]. This motivates us to neglect the subsystem\nangular momentum, by averaging over the Jacobi coordinates r̂i,jk and r̂jk . In this approximation, the\nSchrödinger wavefunction Ψ (r1 , r2 , r3 ) is given in terms of reduced Faddeev wavefunctions ψ(R, α):\nΨ (r1 , r2 , r3 ) = ψ(R, α1 ) + ψ(R, α2 ) + ψ(R, α3 ).\n\n(12)\n\nIn the differential Faddeev equation [17] we then make an adiabatic hyperspherical expansion\nψ(R, α) =\n\nX\n1\nfn (R)φn (R, α).\n2πR5/2 sin(2α) n\n\n(13)\n\nFor every value R, which is treated as a parameter, the functions φn (R, α) of hyperangle α form a\ncomplete set, and are solutions to the eigenvalue equation on L2 ((0, π/2))\n\"\n#\n\u0015\n\u0014\nZ 12 π−| 16 π−α|\n√\n4\n∂2\nφn (R, α0 )dα0 , (14)\n− 2 − λn (R) φn (R, α) = −2R2 V ( 2R sin α) φn (R, α) + √\n∂α\n3 | 13 π−α|\nwith Dirichlet boundary conditions φ(R, 0) = φ(R, π/2) = 0. The eigenvalues λn (R) depend parametrically on R. The set of hyperangular functions φn (R, α) are generally not orthogonal functions in α.\nTherefore, we define\nZ 21 π\nGnm (R) =\nφ∗n (R, α)φm (R, α)dα,\n(15)\n0\n\nwhich allows us to derive the following coupled set of differential equations for the functions fn\n\n\u0013\n\u0015\n\u0014 \u0012\n∂2\n15\n1 1 2 λn (R) − 4\n1\n− 2+\n+\nR\n+\nfn (R)+\n2\n∂R\n4R2\n2 a4ho\n2R2\n\u0015\nX\u0014\n∂\n+\n2Pnm (R)\n+ Qnm (R) fm (R) = Efn (R). (16)\n∂R\nm\nThe coupling terms in these equations are defined by\nZ 21 π\n1 X −1\n∂\nPnm (R) = −\nGnk (R)\nφ∗k (R, α)\nφm (R, α)dα,\n2\n∂R\n0\nk\nZ 21 π\n1 X −1\n∂2\nQnm (R) = −\nGnk (R)\nφ∗k (R, α) 2 φm (R, α)dα.\n2\n∂R\n0\n\n(17a)\n\n(17b)\n\nk\n\nThis framework is very similar to the work of Refs. [22; 17], and the harmonic oscillator term\nis taken into account as in Ref. [21]. For now, we neglect the coupling terms conform the adiabatic\nhyperspherical approximation. However, later on we wil study the coupling between different channels\nmore carefully, as the harmonic oscillator gives rise to degeneracies between the Efimov-like solutions\nin the zeroth channel and the continuum-like solutions of the first and higher channels.\n\n\f5\n\nHyperangular problem\nThe effect of the interaction potential V is now encoded in the eigenfunctions λn (R). Parametric\nsolutions for λn can be found by fixing the parameter R, while solving for the angular problem. The\nfunctions λn (R) will then serve as input for the radial equation (16), and when the coupling terms are\nignored, solutions are obtained by solving an ordinary differential equation (ODE).\nTo find an approximation of λn , one can study solutions ψ(R, α) of Eq. (14) for small values of α\nand values of α close enough to π/2. Matching of the solutions at intermediate values of α then yields\nan approximation of λn . This procedure has been described in Ref. [22]. The equation found in this\nmanner is\n\u0011\n\u0011\n\u0011\n\u0010\n\u0010\n\u0010\n√ −1/2\n8 −1/2\n1/2 π\n1/2 π\nπ\n√\n−\nλ\n=\n−\n2λ\n(18)\nsin\nλ\nsin\nλ\ncos λ1/2\nn\nn 6\nn\nn 2 R kR cot(δ(kR )),\nn 2\n3\np\nwhere kR = λn /2R2 . Note that λn ≡ 16 always solves this equation, but it gives rise to a spurious\nsolution. The right hand side of equation (18) can be conveniently expanded using the effective range\napproximation for the s-wave scattering phase shift of the two-body problem\n1 1\n2\n4\nkR cot δ(kR ) = − + rs kR\n+ O(kR\n),\na 2\n\n(19)\n\nwith rs the effective range parameter. When this parameter is neglected, we find the approximating\nequation for λn = λn (R/a) that is at the basis of the derivation in Ref. [22]:\n\u0010\n\u0010\n\u0011\n\u0011 √\n\u0011\n\u0010\n8 −1/2\nπ\nπ R\nπ\nsin λ1/2\n(R) sin λ1/2\n.\n(20)\n= 2λ−1/2\ncos λ1/2\nn 6\nn\nn 2\nn 2 − √ λn\na\n3\nBy taking into account the effective range as well, one obtains an approximation that is more accurate\nwith respect to the two-body physics near narrow Feshbach resonances. This has been proposed in\nRef. [28] as a regularization procedure and has been readdressed in Ref. [29]. We will come back to\nthis issue in Section 4.\nHyperradial problem\nWith the approximation of the channel eigenvalues at hand, we may turn to the hyperradial problem. In the adiabatic hyperspherical approximation, we ignore the coupling between the different\nhyperradial channels and only take the scattering length into account in the approximation of λn . In\nthis setting, the Efimov effect was derived in Ref. [22], and repeating it in this context allows for a\ncomparison in the limit of aho → ∞. The uncoupled system of equations is given by\n\nh\n\n−\n\nλn (R) −\n∂2\n+\n2\n∂R\nR2\n\n1\n4\n\n+\n\nR2 i\nfn (R) = 2Efn (R),\na4ho\n\n(21)\n\non (R0 , ∞), with a boundary condition\nfn (R) → 0,\n\nR → ∞,\n\n(22)\n\nand an appropriate boundary condition on the edge of the inner region R0 where the short-range\npotentials become important, which is given in terms of the three-body parameter κ∗ . The exact\nboundary condition will be specified later.\nWe first concentrate on the zeroth channel, i.e. n = 0, which is the only channel that has an\nattractive potential, and therefore the only channel in which the Efimov effect is found. We introduce\nspherical coordinates (T, θ, ξ) according to\nK = T sin θ sin ξ,\n1\n= T sin θ cos ξ,\na\n1\n= T cos θ.\naho\n\n(23a)\n(23b)\n(23c)\n\n\f6\n\nand write down the differential equation for f (σ) = f0 (σ/T ) as\n\nh\n\n−\n\nλ0 (σ sin θ cos ξ) −\n∂2\n+\n2\n∂σ\nσ2\n\n1\n4\n\ni\n+ cos4 θ σ 2 f (σ) = 2 sgn (ξ) sin2 θ sin2 ξf (σ),\n\n(24)\n\nwith long-range boundary condition\nf (σ) → 0,\n\nσ → ∞.\n\n(25)\n\nFor small values of σ, the model does not provide us with a natural\n√ boundary condition. Solutions of\nEq. (24) have a log-periodic\nbehavior\nas\nσ\n→\n0,\ngiven\nby\nf\n(σ)\n∼\nσ sin(s0 log(κσ/T ) + α0 ) for some\np\nvalue of κ. Here s0 = −λ0 (0), and\n1\n1\nΓ(1 + is0 )\nα0 = − s0 log 2 − Arg\n.\n2\n2\nΓ(1 − is0 )\n\n(26)\n\nFortunately, the real short-range potentials Vi provide us with a natural boundary condition at R0\nencoded by κ = κ∗ , where κ∗ is the three-body parameter that accounts for the short-range physics,\nwhich was mentioned already in the introduction. This gives rise to a short-range boundary condition\nat R0 :\n1\ns0\nf 0 (σ0 )\n=\n+\ncot(s0 log(κ∗ R0 ) + α0 ).\nf (σ0 )\n2σ0\nσ0\n\n(27)\n\nK\n\naho -1\n\na-1\n\nFig. 2 Surfaces that represent trimer bound states in the lowest channel, as a function of a−1 , K and a−1\nho\n(blue). Only three surfaces are shown, but in fact there is an infinite number of them, which all can be mapped\non top of each other by multiplying the distance to the origin by powers of eπ/s0 . These surfaces are sliced by\na plane (red transparant), for a given aho that corresponds to the height of the plane. The intersection lines\n(red) represent bound state solutions for combinations of the scattering length a and the wave vector K, for\nthis value of aho . The picture is not too scale: we used similar scaling relations as used in Fig. 1 in order to\nshow the surfaces more clearly.\n\nWe may determine for which parameter combinations a solution exists by a shooting method from\nlarge values of σ. A particular convenient method makes use of a certain phase variable φ. One can set\nup an equation for φ that is much alike the variable phase equation, but is adapted to fit the boundary\ncondition at short distances very well. Henceforth, it will play a role similar to the function ∆ as we\nmentioned in the introduction. We introduce the transformation\n\n\u0001\nf 0 (σ) = g(σ) + h(σ) cot(φ(σ) + ψ(σ)) f (σ).\n\n(28)\n\n\f7\n\n10\n\nÑΩ\n\nET\n\n5\n\n0\n\n-5\n-6\n\n-4\n\n-2\n\n0\naho\n\n2\n\n4\n\n6\n\na\nFig. 3 The trimer bound state energies of cesium in the zeroth and first hyperspherical channels. The result is\nobtained for a trap frequency ω = 1000 s−1 . A deeper bound state, with much lower energy, can not be shown\nin this graph. Also indicated is the dimer binding energy (solid blue line)\n\nThe functions g, h > 0 and ψ may be chosen to our convenience. Continuity properties in the parameters\nare easier to derive considering φ than when one considers f directly. A particular choice\n1\n,\n2σ\ns0\nh= ,\nσ\nψ = s0 log σ + α0 ,\ng=\n\n(29)\n(30)\n(31)\n\nis highly compatible with the boundary condition (27). The equation for φ becomes\ns0 φ0 +\n\n\u0010 λ (σ sin θ cos ξ) + s2\n\u0011\n0\n0\n− 2σ sgn(ξ) sin2 θ sin2 ξ + cos4 θσ 3 sin2 (s0 log σ + α0 + φ(σ)) = 0, (32)\nσ\n\nwhich is a nonlinear first order differential equation. Given values for ξ and θ, we denote by φ(σ; ξ, θ)\nthe solution to (32) that satisfies φ(σ) + s0 log σ + α0 ↑ 0. With this definition, the problem (2) has a\nsolution if and only if\nφ(T R0 ; ξ, θ) = s0 log(κ∗ /T ) mod π.\n(33)\nConsequently, eigensolutions only exist if there exists an n ∈ Z such that\nT = κ∗ e−φ(T R0 ;ξ,θ)/s0 e−nπ/s0 .\n\n(34)\n\nWe would like to emphasize here the similarity with the description of the Efimov effect in free space\ngiven by equation (4). Using the asymptotic behavior of λ0 for small arguments, one can easily show\nthat φ(σ) converges to a finite value for σ ↓ 0. The function φ(0; ξ, θ) can be shown to be continuous\nover the region. For θ = 0 and ξ ∈ [−π, −π/4], the Efimov effect in free space is retained. Hence,\nφ(0; ξ, 0) is an approximation of −∆(ξ)/2.\nTrimer solutions in a harmonic potential\nThe trimer solutions are most easily represented by surfaces in three-dimensional (a−1 , K, a−1\nho )\nspace, as defined in Eq. (23). In Fig. 2 such surfaces are shown for the lowest channel, which can be\n\n\f8\n\n7\n\n6\n\nÑΩ\n\nET\n\n5\n\n4\n\n3\n\n2\n0.0\n\n0.5\n\n1.0\naho\n\n1.5\n\n2.0\n\na\nFig. 4 Crossings in Fig. 3 are replaced by avoided crossings when the coupling between the zeroth and first\nhyperspherical channels is taken into account.\n\nmapped on top of each other by multiplication of the distance to the origin by powers of eπ/s0 . Fig. 2\ncan be regarded as a generalization of the two-dimensional Fig. 1. When these surfaces are sliced with\na plane corresponding to a fixed harmonic oscillator length aho , we obtain curves that express wave\nvectors K in terms of the scattering length a, and an example can be seen in Fig. 3. When taking\nthe limit of aho → ∞, the Efimov effect in free space is obtained as depicted in Fig. 1. In the region\nξ ∈ [−π, −π/4], the intersections of the surfaces will tend to the curves that describe the Efimov states.\nIn the region ξ ∈ (−π/4, π), the energy levels come closer and closer together, expressing the fact that\nin the limit, this region is filled with continuum states. The intersection of the surfaces with the a−1 = 0\nplane precisely corresponds to the exact results obtained by Jonsell et al. and Werner [21; 30].\nAs an example, we show in Fig. 3 the trimer binding energies of cesium as a function of scattering\nlength with a fixed oscillator length, for the lowest and next to lowest hyperspherical channels. The\nparameters are κ∗ = 1.93 × 10−4 a−1\n[2], with a0 the Bohr radius, R0 = 100a0 , and aho = 13000a0 ,\n0\nwhich corresponds to a trap frequency of approximately 1000 s−1 .\nIt is interesting to note the change of energy scales in this figure. Below the thresholds of the\ntrimer and atom-dimer continuum (cf. Fig. 1), which would exist for the free-space Efimov effect, the\nbound states show the characteristic scaling law of Eq. 2. Above these thresholds, the bound states\nshow a spacing typical for the harmonic oscillator potential which is approximately 2~ω. This change\nof exponential scaling to linear scaling of the trimer energies makes that the accumulation of bound\nstates in the point of zero energy and infinite scattering length disappears. Effectively, the Efimov\ntrimers are \"pushed\" out of the trimer region through the thresholds and aquire a strong harmonic\noscillator state character.\nThere is also a clear difference between the zeroth and first hyperspherical channels. In this respect,\nit is interesting to note the different limiting behavior of the solutions for small positive and negative\nscattering length. For small and negative scattering length, there is no weakly-bound dimer state\nin the interatomic potential, and the solutions have the character of three weakly-interacting atoms\nin a harmonic oscillator potential. For small and positive scattering length, there is a weakly-bound\ndimer state, and for the zeroth hyperspherical channel the solutions have the character of a weaklyinteracting dimer and an atom in a harmonic oscillator potential. These regimes are connected through\nsolutions which have a strong Efimov character. However, for the first hyperspherical channel the\nsituation is different. Here the solutions behave more as those of two particles undergoing a Feshbach\nresonance [31; 32], which as a result interpolate between two different harmonic oscillator levels.\n\n\f9\n\n10\n\nGT \u0090Ñ Ω\n\n1\n0.1\n0.01\n0.001\n10-4\n10-5\n-40\n\n-30\n\n-20\n\n-10\n\naho \u0090a\n0\n\n10\n\n20\n\n30\n\nFig. 5 The width ΓT of cesium Efimov states in a trap, with ω = 1000 s−1 and η∗ = 0.06, for the first (red),\nsecond (black), third (green) and fourth (blue) trimer states depicted in Fig. 3. Also, the width of a free Efimov\ntrimer corresponding to the first state is shown (black dashed).\n\nIt should be possible to investigate this change of character experimentally, by using similar techniques as have been done by Stöferle et al. [32]. Here the creation of dimers was investigated in an\noptical lattice while sweeping the magnetic field through a Feshbach resonance. For the trimers, such\nadiabatic sweeps through trimer solutions should allow for a creation of states with a character changing\nbetween harmonic oscillator-, Efimov- and dimer+atom- type solutions.\nSo far, we have applied the adiabatic hyperspherical approximation, in which we completely ignored\nthe coupling between the various hyperspherical channels. While this is generally a good approximation,\nwe see from Fig. 3 that there are degeneracies between the zeroth and first channel solutions, which\nshould be lifted when the coupling is taking into account. In order to demonstrate this, we introduce\nan approximation of the coupling. We calculate the coupling terms Pmn and Qmn of Eq. (17) using\nfirst order approximations of the functions φn , and find in this way combined solutions which involve\nboth channels. In free-space, the coupling between these two hyperspherical channels is directly related\nto the process of three-body recombination, where three colliding particles relax into a weakly-bound\ndimer and a third particle, with a surplus of kinetic energy [17]. Interestingly, for our lattice solutions\nwe observe that this coupling transforms the crossings in Fig. 3 into avoided crossings, as shown in\nFig. 4. This could be experimentally interesting, since using magnetic field sweeps would allow for\nadiabatic transitions from one hyperspherical channel to an other.\n\n3 Stability of trimers in a harmonic potential\nThe change of character of the trimer solutions, which was discussed above, will have a profound\nimpact on the stability of these states. So far, we implicitly assumed that the trimers in the harmonic\noscillator potential are stable. However, when the three particles are close together the trimer can\ndissociate into a deeply-bound dimer and a third atom, with large kinetic energy. Here, we investigate\nthe stability of the trimers by applying the method of Braaten and Hammer [17], that regards the\ntrimers as scattering resonances in a dimer-atom scattering process. In this respect, the trimer energy\nET acquires a width ΓT , where the latter can be used to calculate the lifetime ~/ΓT of the trimers. In\nthis method, an inelasticity parameter η∗ is introduced to account for the decay into various deeply\nbound states. which can be regarded as the imaginary part of a complex phase factor that describes\nthe reflection of hyperradial waves in the inner region. Effectively, this comes down to changing the\nboundary condition at R0 to\nf 0 (R0 )\n1\ns0\n=\n+\ncot (s0 log(κ∗ R0 ) + α0 + iη∗ ) .\nf (R0 )\n2R0\nR0\n\n(35)\n\n\f10\n\nFor given values for the scattering length and the harmonic oscillator length, we are then able to find\nthe associated complex eigenvalues\n\u0012\n\u0013\nΓT\nm\nE = 2 ET − i\n,\n(36)\n~\n2\nwhere the trimer energy ET < 0 and the width ΓT > 0.\nAs an example, we calculated the linewidths or cesium, with a trapping frequency ω = 1000 s−1 ,\nκ∗ = 1.93 × 10−4 a0 , and η∗ = 0.06 [2]. The short-range boundary condition was implemented at a\nvalue R0 = 100a0 . For some of the Efimov trimers shown in Fig. 3, the linewidths are shown in Fig. 5.\nThe change of character of the trimers can be clearly seen from this graph: for values a/aho . −2 the\nstates have a harmonic oscillator character, and the widths are relatively small. However, the Efimov\neffect shows up via a strong increase of the widths towards a/aho & −2, which is the parameter region\nwhere in free-space a new Efimov state would enter the tree-body system. It is also the region where\na local peak in the three-body recombination rate would occur (trimer resonance). Here, we see that\nat this point the width of the lowest trimer keeps increasing, while for the higher trimer states the\nwidth saturates and displays an oscilating behavior. This is not surprising, since the latter trimers are\nmore similar to three-particle continuum states. For comparison, the linewidth of the free-space Efimov\ntrimer compared to the lowest lattice trimer state is shown in the region where it exists. These lines\noverlap mostly, and can be more than two orders of magnitude above the widths for the higher trimer\nstates. At the point where the trimer energies approach the atom-dimer threshold, around a/aho = 34,\nthe widths go down again to the level of the higher trimer states. The width of the lattice trimer is\nthere somewhat larger than the free-space trimer, probably due to the additional confinement of the\nweakly-bound dimer state caused by the lattice.\nWhile the Efimov effect shows up in the excited states by a clear deviation from the harmonic\noscillator levels, these states benefit from a much smaller linewidth than the deeply bound Efimov\ntrimers, and they should therefore be easier to study experimentally. Also the lowest trimer energy,\nwhich most closely follows a free-space Efimov state, could be easier to study in experiment. The trimer\ncould first be prepared in the lowest harmonic oscillator level for a/aho \u001c −1, and then the scattering\nlenght can be changed via a magnetic field sweep to the region a/aho ≈ −2, where the decay is still\nmanageable.\n\n4 Effective range corrections\nIn order to improve the approximation of the channel eigenvalues λn arising in (14), one might want\nto include the influence of the effective range rs . This can be done by making the so-called effective\nrange expansion, i.e. using the expansion in Eq. (19) up to second order. In literature there have been\nvarious instances in which the effective range is taken into consideration in the determination of the\nthree-particle spectrum [33; 34].\nHaving an additional interaction parameter at hand, raises the question whether in this regime\nEfimov physics in ultracold gases can still be universal. On the experimental side, there are presently\nalso some conflicting observations. In order to understand these issues, we first need to define what we\nmean by the universal Efimov regime. In the above, we have already seen that besides the scattering\nlength, we need at least one additional parameter that fixes at least one of the Efimov trimer energies.\nThe other ones can then be derived from this position. This information is provided via the threebody parameter κ∗ , which can be regarded as a boundary condition for the interaction potentials in\nthe regime where the three particles are very close together. It is related to the energy of the lowest\nEfimov trimer via ET = −~2 κ2∗ /m in the infinite scattering length limit, and with this only additional\nparameter the Efimov physics is universal.\nHowever, some experiments on three-body recombination do not imply universality. While the\nexperiments at Rice University did show the universal connection between Efimov states in 7 Li at one\nside of the resonance [8], the universality did not extend to the other side of the resonance. The Rice\ngroup was not alone in this observation: also in Florence [6] on 39 K, in Innsbruck [5] on 133 Cs, and in\nTokyo [13] on 6 Li this non-universality was observed. On the other hand, in three other experiments\nuniversality across the resonance was observed: in Bar-Ilan it was found that universality does extend\nacross a Feshbach resonance in 7 Li, and even that the short range physics encapsulated in κ∗ is\n\n\f11\n\n100\n\nΛHR\u0090R0 L\n\n50\n\n0\n\n-50\n\n0\n\n5\n\n10\nR\u0090R0\n\n15\n\n20\n\nFig. 6 Eigenvalues λ of F R depending on R/R0 , as calculated in three different ways. The blue lines represent\nthe approximations of the eigenvalues by a truncated Fourier expansion. The black lines and red lines are the\napproximations obtained by (20) and (37) respectively. We take for the square well parameters V0 R02 = −3.2.\nIt can be clearly seen that the effective range gives a much better asymptotic behavior.\n\nindependent of the nuclear spin configuration [35; 36]. Furthermore universality was also observed in\na three-component fermionic 6 Li gas in Heidelberg [9] and in State College [11].\nNow the question arises whether the effective range paramer rs can explain, in addition to the\nthree-body parameter κ∗ , the non-universal behavior of some of the above-mentioned experiments.\nHowever, it might also be that in a certain regime, the effective range will take over the role of the\nthree-body parameter due to its regularising effect of the radial wavefunctions [33; 34]. And recently, it\nhas been shown that small experimental deviations from universality [35] can be explained by effective\nrange corrections using an effective field theory [37].\nAs it has been shown by Fedorov and Jensen [28] and more recently by Platter et al. [29], the\nintroduction of the effective range in the approximate equation (18) for the eigenvalues λn yields the\nrelation\n\u0010\n\u0011\n\u0010\n\u0011\n\u0010\n\u0011 \u0012 R 1 λ \u0013\n√ −1/2\n8 −1/2\nn\n1/2 π\n1/2 π\n1/2 π\ncos λn 2 − √ λn\nsin λn 6 = − 2λn\nsin λn 2\n− + rs\n.\n(37)\na\n2 2R\n3\nTo get an idea on the validity of the approximation (37), we have compared the results with the\neigenvalues obtained by a truncated Fourier expansion for a square well potential with height V0 and\nwidth R0 , such that V0 R02 = −3.2. This expansion is very convenient when one considers the operator\nF R , which depends on the hyperradius R and is defined via the eigenvalue equation (14) as follows\n\"\n#\nZ 21 π−| 16 π−α|\n√\n∂2\n4\n2\n0\n0\nR\nF φn (R, α) = − 2 φn (R, α) + 2R V ( 2R sin α) φn (R, α) + √\nφn (R, α )dα . (38)\n∂α\n3 | 13 π−α|\nThe reason for this convenience is that in the basis of Fourier expansion functions\n2\nξn (α) = √ sin(2nα),\nπ\n\n(39)\n\nboth the differential operator and the integral operator are diagonal. The matrix elements are then\ngiven by\n\u0012\n\u0013\n4 1\nR\n2\n2\nπ\nsin(2n 3 ) Vmn (R),\n(F )mn = 4n δmn + 2R 1 + √\n(40)\n3n\nwhere\nZ\n4 π/2 √\nVmn (R) =\nV ( 2R sin α) sin(2nα) sin(2mα)dα.\n(41)\nπ 0\n\n\f12\n\nΛ0\n-R\u0090rs\n10\n\n20\n\n30\n\n40\n\n-2\n\n-4\n\n-6\n\n-8\n\nR=-rs\n\nR=a\n\nFig. 7 The figure shows λ0 (purple, solid) as a function of −R/rs , for a fixed value of a = −20rs , with rs < 0.\nFor R \u001d −rs , the solution is very close to that obtained from (20) (red, dotted). For R . −rs , there is a\nboundary layer, in which the solution resembles the solution μ of (42) (blue, dashed).\n\nIn Fig. 6, we compare the numerically calculated eigenvalues λn (R) of F R with results obtained from\nEq. (20), which depends on the scattering length only, and with the results from solving Eq. (37),\nwhich depends both on scattering length and effective range. Here the values for a and rs are taken\nfrom the effective range expansion of the square well potential. It can be seen that asymptotically,\nthat is for large hyperradius, the inclusion of the effective range in the model yields results that are\nconsiderably better than if one only takes the scattering length into account. For relatively small values\nof the hyperradius, the predictions obtained by the Fourier expansion and this simple model start to\ndeviate. Hence, we expect that for short hyperradii, additional details of the interaction potential\nbecome important, i.e. higher order expansion coefficients beyond the effective range approximation\nhave to be taken into account.\nFor rs < 0 and a fixed value for a, the lowest solution λ0 to Eq. (37) can be defined as a smooth\nfunction of R for R ∈ (0, ∞). Moreover, λ0 (R) = O(R) as R → 0. Therefore, if we use this approximation in the hyperradial equation, we can find regular solutions instead of rapidly oscillating ones. This\ncould, at least in principle, remove the need for a renormalization boundary condition in terms of κ∗ for\nR → 0. In the absence of a harmonic oscillator, and in the limits of small energy and r ≡ −rs /a → 0,\nwe will see that the solutions to the hyperradial equation are identical to those when the effective\nrange is not taken into account, except that the value of κ∗ is determined by rs by boundary layer\nbehavior for small values of the hyperradius. Such a relation between κ∗ and rs has been established\nbefore [33; 34].\nLet us, therefore, study the equation (37) more closely. We have plotted the solution λ0 for the\nsituation a = −20rs in Fig. 7, to give a characteristic example. In the region −rs \u001c R . a, the value\nof λ0 satisfying (37) is close to that obtained by solving (20). Similarly, when R \u001c −rs , the solution\nλ0 to (37) will be close to μ(−R/rs ), where μ(−R/rs ) is the solution to\n\n\u0011\n\u0010\n\u0011\n\u0010\n\u0011 1 μ\n\u0010\n√ −1/2\n8\n1/2 π\nπ\n=\n−\n2λ\nsin\nμ\nrs\n.\ncos μ1/2 π2 − √ μ−1/2 sin λ1/2\nn 6\nn\n2\n2 2R\n3\n\n(42)\n\nAround R ∼ −rs , there is a transition from a boundary layer behavior similar to μ to behavior obtained\nby ignoring the effective range (20).\nTo find the low-energy behavior of the system, which is needed to find a proper relationship between\nrs and κ∗ [33; 34], we have to turn back to the hyperradial equation (21). Following from the above\nconsiderations, the solution f0 that decays exponentially for large hyperradius is to leading order in\n−rs /a, and for R \u001d −rs , equal to f out , the exponentially decaying solution to the hyperradial equation\nobtained when the effective range is ignored. This outer solution f out will have log-periodic behavior\nas R → 0\n√\nf out (R) ∼ R sin(s0 log(κR) + α0 ),\n(43)\nfor some κ. The solution f0 will be similar for −rs \u001c R \u001c a, and will therefore for low enough energies\nalso show log-periodic behavior. However, there is a boundary layer for R \u001c −rs , which\nmakes that we\n√\ncan demand the solution f0 (R) to be regular for R → 0, that is, such that f0 (R) ∼ R for R → 0. This\n\n\f13\n\neffectively determines the value of κ. To analyze the boundary layer, we introduce the new variable\nρ = −R/rs and the function f ̃0 , f ̃0 (ρ) = f0 (−ρrs ). The hyperradial equation for f ̃0 reads\n\u0014\n\u0015\nd2\nλ0 (ρ) − 1/4\nrs4 2\n2  ̃\n− 2+\n+ 4 ρ − 2Ers f0 (ρ) = 0,\n(44)\ndρ\nρ2\naho\n√\nand we demand that f ̃0 (ρ) behaves like ρ for ρ → 0. We consider now the case of a negligible harmonic\noscillator potential, i.e. aho = ∞, and take the low-energy limit Ers2 → 0 and a diverging scattering\nlength. The solution will then be equal to f0in , which satisfies\n\u0015\n\u0014\nμ(ρ) − 1/4 in\nd2\nf0 (ρ) = 0.\n(45)\n− 2+\ndρ\nρ2\nFor ρ → ∞,\nlim f0in (ρ) ∼\n\nρ→∞\n\n√\n\nρ sin(s0 log(ρ) + φ0 ).\n\nWe determine the phase φ0 numerically, by choosing a boundary condition\n\u00130\n\u0012\nμ(ρ) f (ρ)\nf (ρ)\n=\n√\n√ ,\nρ\nρ\nρ\n\n(46)\n\n(47)\n\nfor small enough values of ρ, and by integrating the equation. The boundary condition ensures that\nwe pick up the right solution. The result is φ0 = s0 log(1.0918) + α0 . In order to find what value of κ∗\n(= κ in this limit) is induced by rs , we have to match the inner and the outer solutions in the regime\nwhere −rs \u001c R \u001c a. This yields that −κ∗ rs = 1.0918.\nRemarkably, this numerical value for −κ∗ rs differs from the values obtained in Ref. [33] and [34],\nwhich are −κ∗ rs ≈ 5 and −κ∗ rs ≈ 5.3062 respectively. It is unclear where the difference comes from,\nhowever, both papers use models different from the hyperspherical formalism that we used here, where\nwe base our treatment of the effective range parameter on the descriptions in Refs. [28] and [29]. More\nresearch is needed to resolve this discrepancy.\nNow we are in a good position to compare our model with earlier work on the Efimov effect in a\nharmonic potential. In the work of Thøgersen, Fedorov, and Jensen, the influence of the effective range\nis studied on the universal Efimov effect [25]. They considered a system with a Gaussian interaction\npotential, given by\nV (r) = V0 exp(−r2 /R02 ),\n(48)\nwhere V0 and R0 are constants. The range R0 has been chosen to equal R0 = aho /3965.\nAlthough the main purpose of Ref. [25] is to show the influence of the effective range, their model\ncontains a harmonic trap as well. In order to make a proper comparison with our model, we take\nκ∗ aho = 3.7. The results are shown in Figs. 8 and Fig. 9, and can be directly compared with Fig. 1\nin Ref. [25]. We observe that the numerical results are reproduced quite closely and we can assign the\nnumerically found bound states to the different hyperspherical channels. We also observed that if we\ninclude the above corrections that come from the effective range, the comparison is better than results\nobtained without these corrections.\n5 Conclusion\nWe studied the Efimov effect in a harmonic potential by using the hyperspherical formulation. In the\nfirst part of this paper, we studied the universal regime by only taking a large scattering length into\naccount, and by making the adiabatic hyperspherical approximation in that we ignored the coupling\nbetween different hyperspherical channels. The model thus obtained is simple in the sense that the\nbinding energies of the trimers result from an ordinary differential equation, with an appropriate\nboundary condition for the lowest channel encoded by the three-body parameter κ∗ . Considering the\nlowest channel, we formulate an equation for a phase variable, the exponent of which is the radius\nin a spherical plot describing a surface of values in (a−1 , K, a−1\nho )-space (inverse scattering length,\nwavenumber and inverse oscillator length) for which bound states exists. Other such surfaces are\nobtained by multiplying the distance to the origin by a factor eπ/s0 , and there is an accumulation\n\n\f14\n\n7\n6\n\nET \u0090Ñ Ω\n\n5\n4\n3\n2\n1\n0\n-2\n\n-1\n\nsgnHaLÈaho \u0090a\n0\n\n1\n\n2\n\n1\u00904\n\nFig. 8 Trimer solutions in a harmonic oscillator, for potential parameters corresponding to the paper of\nThøgersen et al. [25]. Shown are the solutions above the three-particle threshold. The zeroth (first) channel\nsolutions are given by black-solid (red-dashed) lines. The graph can be directly compared to Fig. 1 in this\npaper.\n\n0\n\n-È ET \u0090HÑ ΩL È 1\u00908\n\n-2\n\n-4\n\n-6\n\n-8\n\n-6\n\n-4\n\n-2\n\nsgnHaLÈaho \u0090a\n0\n\n2\n\n4\n\n6\n\n1\u00904\n\nFig. 9 Trimer solutions in a harmonic oscillator, for potential parameters corresponding to the paper of\nThøgersen et al. [25]. Shown are the solutions below the three-particle threshold. The red line indicates a\nsolution when the effective range is taken into account. Also indicated is the dimer-atom threshold, which\nincludes effective range corrections. The graph can be directly compared to Fig. 1 in this paper.\n\npoint of surfaces near the origin, analogous to the Efimov effect in free space. In the limit aho → ∞,\nthe Efimov effect in free space is recovered.\nInteresting differences with the situation of three particles in free space can be observed when we\nfocus at a fixed value of aho . For parameter combinations where in free-space bound states would exist,\nthe situation is very similar, except that the accumulation of energies only happens up to a typical\nenergy of ~ω. The rest of the Efimov states are \"pushed out\" into the trimer continuum (which is of\ncourse only a continuum in free space). Higher hyperspherical channels give rise to additional bound\nstates, and by taking those into account as well we obtain results very close to numerical simulations\nof three-particle systems [25]. Better qualitative results are obtained by approximating the coupling\nbetween the hyperspherical channels, which lifts the degeneracies and creates avoided crossings. The\nlifetime of the trimers is highest for states with a continuum character, i.e. in the region which we\nwould denote as trimer continuum in free space. The reason for this is the small overlap of these states\nwith deeply bound states. Experimental study of Efimov-like states, however, could be feasible close to\nthe transition from this continuum region to the trimer region, where the linewidth is still quite small.\n\n\f15\n\nFor a more general Efimov model that allows for deviations from the universal regime, a natural step\nis to improve on the approximation of the hyperangular problem by taking into account the effective\nrange. By doing this, we were able to find a relation between κ∗ and the effective range rs < 0 if\na \u001d −rs \u001d R0 , where R0 is a typical range of the potential. We obtain the same qualitative behavior\nas Ref. [33] and [34] where different descriptions were used, however, the actual value of κrs is also\nvery different. It appears that the actual value for this relationship depends strongly on the choice\nof the model and the corresponding approximations to describe the three-particle physics, and more\nresearch is needed to understand this discrepancy. In a different parameter regime for a, rs and R0 ,\nsuch a relationship between κ∗ and rs is not necessary. Then we have in addition to rs , the three-body\nparameter κ∗ in the boundary condition for the hyperradial problem to our disposal. By comparing to\nnumerical calculations we find that this description indeed improves the predicted trimer energies.\nReferences\n1. V. Efimov, Phys. Lett. B 33, 563 (1970); V. Efimov, Sov. J. Nucl. Phys. 12, 589 (1971); V. Efimov, ibid.\n29, 546 (1979).\n2. T. Kraemer, M. Mark, P. Waldburger, J.G. Danzl, C. Chin, B. Engeser, A.D. Lange, K. Pilch, A. Jaakkola,\nH.-C. Nägerl, and R. Grimm, Nature 440, 315 (2006).\n3. F. Ferlaino and R. Grimm, Physics 3, 9 (2010).\n4. C.H. Greene, Physics Today 63, 40 (2010).\n5. S. Knoop, F. Ferlaino, M. Berninger, M. Mark, H.-C. Nägerl, and R. Grimm , Nature Phys. 5, 227 (2009).\n6. M. Zaccanti, B. Deissler, C. D'Errico, M. Fattori, M. Jona-Lasinio, S. Müller, G. Roati, M. Inguscio, and\nG. Modugno, Nature Phys. 5, 586 (2009).\n7. N. Gross, Z. Shotan, S.J.J.M.F. Kokkelmans, and L. Khaykovich, Phys. Rev. Lett. 103, 163202 (2009).\n8. S.E. Pollack, D. Dries, and R.G. Hulet, Science 326, 1683 (2009).\n9. A.N. Wenz, T. Lompe, T.B. Ottenstein, F. Serwane, G. Zürn, and S. Jochim, Phys. Rev. A 80, 040702(R)\n(2009).\n10. T. Lompe, T. B. Ottenstein, F. Serwane, K. Viering, A. N. Wenz, G. Zürn, and S. Jochim, Phys. Rev.\nLett. 105, 103201 (2010).\n11. J.H. Huckans, J.R. Williams, E.L. Hazlett, R.W. Stites, and K.M. O'Hara, Phys. Rev. Lett. 102, 165302\n(2009).\n12. J.R. Williams, E.L. Hazlett, J.H. Huckans, R.W. Stites, Y. Zhang, and K.M. O'Hara, ibid. 103, 130404\n(2009).\n13. S. Nakajima, M. Horikoshi, T. Mukaiyama, P. Naidon, and M. Ueda, Phys. Rev. Lett. 105, 023201 (2010).\n14. G. Barontini, C. Weber, F. Rabatti, J. Catani, G. Thalhammer, M. Inguscio, and F. Minardi, Phys. Rev.\nLett. 103, 043201 (2009).\n15. H. Feshbach, Ann. of Phys. (N.Y.) 5, 357 (1958); 19, 287 (1962).\n16. E. Tiesinga, A. J. Moerdijk, B. J. Verhaar, and H. T. C. Stoof, Phys. Rev. A 46, R1167 (1992); E. Tiesinga,\nB. J. Verhaar, and H. T. C. Stoof, Phys. Rev. A 47, 4114 (1993).\n17. E. Braaten and H.-W. Hammer, Phys. Rep. 428, 259 (2006).\n18. J. von Stecher, J.P. D'Incao, and C.H. Greene, Nature Phys. 5 417 (2009).\n19. F. Ferlaino, S. Knoop, M. Berninger, W. Harm, J.P. D'Incao, H.-C. Nägerl, and R. Grimm, Phys. Rev. Lett.\n102 140401 (2009).\n20. T. Lompe, T.B. Ottenstein, F. Serwane, A.N. Wenz, G. Zürn, and S. Jochim, Science 330, 940 (2010).\n21. S. Jonsell, H. Heiselberg, and C.J. Pethick, Phys. Rev. Lett. 89, 250401 (2002).\n22. D.V. Fedorov and A.S. Jensen, Phys. Rev. Lett. 71, 4103 (1993).\n23. F. Werner and Y. Castin, Phys. Rev. Lett. 97, 150401 (2006).\n24. M. Stoll and T. Köhler, Phys. Rev. A 72, 022714 (2005).\n25. M. Thøgersen, D.V. Fedorov, and A.S. Jensen, Phys. Rev. A 78 020501 (2008).\n26. X. J. Liu, H. Hu, and P. D. Drummond,Phys. Rev. A 82, 023619 (2010).\n27. E. Nielsen and D.V. Fedorov, Phys. Rep. 347 373 (2001).\n28. D.V. Fedorov and A.S. Jensen, J. Phys. A, 34 6003 (2001).\n29. L. Platter, C. Ji, and D.R. Phillips, Phys. Rev. A 79 022702 (2009).\n30. F. Werner, Ph.D thesis Trapped cold atoms with resonant interactions: unitary gas and three-body problem,\nENS, 2008.\n31. T. Busch, B.-G. Englert, K. Rzazewski, and M. Wilkens, Found. Phys. 28, 549 (1998).\n32. T. Stöferle, H. Moritz, K. Günter, M. Köhl, and T. Esslinger, Phys. Rev. Lett. 96, 030401 (2006).\n33. D.S. Petrov, Phys. Rev. Lett. 93, 143201 (2004).\n34. A.O. Gogolin, C. Mora, and R. Egger, Phys. Rev. Lett. 100 140404 (2008).\n35. N. Gross, Z. Shotan, S. Kokkelmans, and L. Khaykovich, Phys. Rev. Lett. 105, 103203 (2010).\n36. N. Gross, Z. Shotan, O. Machtey, S. Kokkelmans, and L. Khaykovich, preprint arXiv:1009.0926, Accepted\nfor Comptes rendus Physique.\n37. C. Ji, L. Platter, and D. R. Phillips, EPL 92 13003 (2010).\n38. B. Marcelis, B. Verhaar, and S. Kokkelmans, Phys. Rev. Lett 100, 153201 (2008).\n\n\f"}