{"id": "http://arxiv.org/abs/1009.1023v3", "guidislink": true, "updated": "2012-05-22T07:22:14Z", "updated_parsed": [2012, 5, 22, 7, 22, 14, 1, 143, 0], "published": "2010-09-06T11:04:56Z", "published_parsed": [2010, 9, 6, 11, 4, 56, 0, 249, 0], "title": "TransverseDiff gravity is to scalar-tensor as unimodular gravity is to\n  General Relativity", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1009.5832%2C1009.5185%2C1009.2264%2C1009.3105%2C1009.5441%2C1009.3071%2C1009.4733%2C1009.3731%2C1009.2168%2C1009.2703%2C1009.6145%2C1009.1132%2C1009.5148%2C1009.2388%2C1009.1019%2C1009.5822%2C1009.4553%2C1009.0264%2C1009.2642%2C1009.3925%2C1009.2602%2C1009.0528%2C1009.4462%2C1009.4685%2C1009.3336%2C1009.5997%2C1009.4021%2C1009.5253%2C1009.6163%2C1009.2059%2C1009.3112%2C1009.1477%2C1009.5573%2C1009.5764%2C1009.0624%2C1009.6208%2C1009.3555%2C1009.2757%2C1009.1997%2C1009.6219%2C1009.0378%2C1009.3549%2C1009.3719%2C1009.4612%2C1009.1454%2C1009.5979%2C1009.0434%2C1009.2013%2C1009.2531%2C1009.1810%2C1009.1754%2C1009.3024%2C1009.1675%2C1009.4917%2C1009.0595%2C1009.1714%2C1009.0593%2C1009.1654%2C1009.5743%2C1009.6032%2C1009.1246%2C1009.2896%2C1009.1667%2C1009.2452%2C1009.2967%2C1009.2518%2C1009.4255%2C1009.4657%2C1009.3425%2C1009.2490%2C1009.1023%2C1009.3675%2C1009.0093%2C1009.2719%2C1009.0107%2C1009.5874%2C1009.1244%2C1009.4219%2C1009.0045%2C1009.1049%2C1009.0540%2C1009.2191%2C1009.2327%2C1009.3699%2C1009.1891%2C1009.1778%2C1009.4215%2C1009.0558%2C1009.3811%2C1009.3754%2C1009.2352%2C1009.2857%2C1009.0441%2C1009.5564%2C1009.3963%2C1009.4721%2C1009.5858%2C1009.0203%2C1009.5765%2C1009.3068%2C1009.0415&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "TransverseDiff gravity is to scalar-tensor as unimodular gravity is to\n  General Relativity"}, "summary": "Transverse Diffeomorphism (TDiff) theories are well-motivated theories of\ngravity from the quantum perspective, which are based upon a gauge symmetry\nprinciple. The main contribution of this work is to firmly establish a\ncorrespondence between TransverseDiff and the better-known scalar-tensor\ngravity --- in its more general form ---, a relation which is completely\nanalogous to that between unimodular gravity and General Relativity. We then\ncomment on observational aspects of TDiff. In connection with this proof, we\nderive a very general rule that determines under what conditions the procedure\nof fixing a gauge symmetry can be equivalently applied before the variational\nprinciple leading to the equations of motion, as opposed to the standard\nprocedure, which takes place afterwards; this rule applies to gauge-fixing\nterms without derivatives.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1009.5832%2C1009.5185%2C1009.2264%2C1009.3105%2C1009.5441%2C1009.3071%2C1009.4733%2C1009.3731%2C1009.2168%2C1009.2703%2C1009.6145%2C1009.1132%2C1009.5148%2C1009.2388%2C1009.1019%2C1009.5822%2C1009.4553%2C1009.0264%2C1009.2642%2C1009.3925%2C1009.2602%2C1009.0528%2C1009.4462%2C1009.4685%2C1009.3336%2C1009.5997%2C1009.4021%2C1009.5253%2C1009.6163%2C1009.2059%2C1009.3112%2C1009.1477%2C1009.5573%2C1009.5764%2C1009.0624%2C1009.6208%2C1009.3555%2C1009.2757%2C1009.1997%2C1009.6219%2C1009.0378%2C1009.3549%2C1009.3719%2C1009.4612%2C1009.1454%2C1009.5979%2C1009.0434%2C1009.2013%2C1009.2531%2C1009.1810%2C1009.1754%2C1009.3024%2C1009.1675%2C1009.4917%2C1009.0595%2C1009.1714%2C1009.0593%2C1009.1654%2C1009.5743%2C1009.6032%2C1009.1246%2C1009.2896%2C1009.1667%2C1009.2452%2C1009.2967%2C1009.2518%2C1009.4255%2C1009.4657%2C1009.3425%2C1009.2490%2C1009.1023%2C1009.3675%2C1009.0093%2C1009.2719%2C1009.0107%2C1009.5874%2C1009.1244%2C1009.4219%2C1009.0045%2C1009.1049%2C1009.0540%2C1009.2191%2C1009.2327%2C1009.3699%2C1009.1891%2C1009.1778%2C1009.4215%2C1009.0558%2C1009.3811%2C1009.3754%2C1009.2352%2C1009.2857%2C1009.0441%2C1009.5564%2C1009.3963%2C1009.4721%2C1009.5858%2C1009.0203%2C1009.5765%2C1009.3068%2C1009.0415&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Transverse Diffeomorphism (TDiff) theories are well-motivated theories of\ngravity from the quantum perspective, which are based upon a gauge symmetry\nprinciple. The main contribution of this work is to firmly establish a\ncorrespondence between TransverseDiff and the better-known scalar-tensor\ngravity --- in its more general form ---, a relation which is completely\nanalogous to that between unimodular gravity and General Relativity. We then\ncomment on observational aspects of TDiff. In connection with this proof, we\nderive a very general rule that determines under what conditions the procedure\nof fixing a gauge symmetry can be equivalently applied before the variational\nprinciple leading to the equations of motion, as opposed to the standard\nprocedure, which takes place afterwards; this rule applies to gauge-fixing\nterms without derivatives."}, "authors": ["J. J. Lopez-Villarejo"], "author_detail": {"name": "J. J. Lopez-Villarejo"}, "author": "J. J. Lopez-Villarejo", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1088/1475-7516/2011/11/002", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1009.1023v3", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1009.1023v3", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "10 pages; amsart style; v3: version as appeared in JCAP, redaction\n  improved", "arxiv_primary_category": {"term": "hep-th", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "hep-th", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "gr-qc", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "math-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "math.MP", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1009.1023v3", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1009.1023v3", "journal_reference": "JCAP11(2011)002", "doi": "10.1088/1475-7516/2011/11/002", "fulltext": "TRANSVERSEDIFF GRAVITY IS TO SCALAR-TENSOR AS UNIMODULAR GRAVITY IS\nTO GENERAL RELATIVITY.\n\narXiv:1009.1023v3 [hep-th] 22 May 2012\n\nJ.J. LOPEZ-VILLAREJO\nAbstract. Transverse Diffeomorphism (TDiff) theories are well-motivated theories of gravity from the quantum\nperspective, which are based upon a gauge symmetry principle. The main contribution of this work is to firmly\nestablish a correspondence between TransverseDiff and the better-known scalar-tensor gravity - in its more general\nform -, a relation which is completely analogous to that between unimodular gravity and General Relativity. We\nthen comment on observational aspects of TDiff. In connection with this proof, we derive a very general rule that\ndetermines under what conditions the procedure of fixing a gauge symmetry can be equivalently applied before the\nvariational principle leading to the equations of motion, as opposed to the standard procedure, which takes place\nafterwards; this rule applies to gauge-fixing terms without derivatives.\nKeywords: Transverse Diffeomorphism gravity; Gauge-fixing; Unimodular gravity; Scalar-tensor gravity; Variations\nwith restrictions.\n\n1. Introduction\nSymmetry principles have a great relevance in modern Physics theories. Specifically, there is a widespread point\nof view on General Relativity (GR), stemming from its possible quantum interpretation, that considers it as the\ntheory of spacetime diffeomorphism (Diff) invariance for spin-two massless particles: one starts from a linearized\ngravity action for a symmetric rank-two tensor in Minkowski space and, under the guidance of the Diff symmetry\nprinciple, one is \"naturally\" led to the full Einstein theory in the non-linear regime [5, 9] (although this has been\nchallenged in [17]). Under this view, the external symmetry group of (active) diffeomorphisms acts as a gauge group\nwhich proves essential for eliminating the unphysical ill-defined polarization modes (ghosts) of the massless graviton.\nThis perspective on gravity deviates from Einstein's geometrical intuition, which is recovered as a by-product. For\nour purposes in particular, the metric (field) gμν may be better understood as simply a rank-two tensor (field), and\nthe covariant derivatives that will appear are convenient book-keeping forms for expressions involving the Christoffel\nsymbols of gμν .\nOn the other hand, it was already pointed out that the necessary and sufficient symmetry group for a consistent\ndescription of the massless graviton is not the full group of diffeomorphisms (Diff(M)) but rather a maximal\nsubgroup of it [23]. Transformations belonging to this subgroup have been dubbed transverse (TDiff(M)) [1, 2],\nsince the parameter describing the gauge transformation at this linear level is transverse, ∂μ ξ μ = 0, such as in the\n(infinitesimal) transformation law for the linearized metric:\n(1.1)\n\nhμν (x) → hμν (x) + ∂μ ξν (x) + ∂ν ξμ (x), with ∂μ ξ μ (x) = 0.\n\nAt the non-linear level (the analogous to GR), one can maintain consistently the same restriction ∂μ ξ μ = 0 on the\nsymmetry group1 so that, for example, the (infinitesimal) transformation of the metric reads:\n(1.2)\n\ngμν (x) → gμν (x) + ∇μ ξν (x) + ∇ν ξμ (x),\n\nwith ∂μ ξ μ (x) = 0.\n\nFor a finite transformation, this corresponds to the subgroup of (finite) general coordinate transformations with\nJacobian determinant equal to unity.\nFollowing under this \"quantum view\", consider that the true symmetry of nature was TDiff, instead of Diff. Then,\none is impelled to construct the most general action compatible with TDiff symmetry. The result is that, since\ng ≡ −det(gμν ) behaves as a scalar under this subgroup, one can add arbitrary functions of g to the usual terms of\nDate: 4th January, 2011.\n1To go from the linear to the non-linear theory, one could try to repeat the procedure in [5]. This has been attempted elsewhere\nunsuccessfully and, moreover, there are serious concerns about the uniqueness of the procedure already for the case of GR [17]. Instead,\nwe look for a consistent and \"logical\" generalization of the linear constraint on the gauge parameter in (1.1), which has the latter as its\nlinear limit: this non-linear constraint turns out to be exactly the same. The other \"most sensible\" generalization, where ξ μ is restricted\nwith ∇μ ξ μ = 0 (and g does not transform at all, not even as a scalar does) is doomed since one cannot accommodate a kinetic term for\ng: 12 fk (g)g μν ∂μ g∂ν g does not transform as a scalar.\n1\n\n\fTRANSVERSEDIFF GRAVITY IS TO SCALAR-TENSOR AS UNIMODULAR GRAVITY IS TO GENERAL RELATIVITY.\n\n2\n\nthe GR Lagrangian [2] (it may be useful for the reader to consult Appendix A for what follows). Therefore, the\nmost general Lagrangian invariant under transverse diffeomorphisms and of second order in derivatives reads:\n\u0014\n\u0015\nZ\n√\n√\n1\n√\n√\n1\n√\n4 √\nμν\n(1.3)\nSTDiff = − 2 d x g f ( g − 1) R + 2fλ ( g − 1) Λ + fk ( g − 1) g ∂μ g∂ν g + SM\n2κ\n2\n\nand the matter action may be taken to be of the form\nZ\n√\n√\n(1.4)\nSM = d4 x gLSM [ψm , gμν ; g − 1]\n\nwhere we allow for an arbitrary extra-dependence on g in the conventional Standard Model Lagrangian2; also, we\n√\nhave expressed this dependence on g − 1 instead of g for later convenience. As it stands, the action given by (1.3),\n(1.4) is clearly non-covariant, but is formulated in a specific set of coordinates - up to TDiff transformations of\ncoordinates. The quantum ultraviolet behavior of such a theory was discussed in [3]; its observational signatures\nwere addressed in [4] - we will have some comments to add under the light shed by our findings.\nThis way of proceeding from the TDiff symmetry principle is not, however, the standard route that followed\nfrom the work of van der Bij, van Dam & Ng [23]. Indeed, these same authors started to develop what is known as\nunimodular gravity (recent proposals include [8, 21]). We compare & contrast these two approaches in section 2.\nOn another note, there is a significant lesson in the work by Kretschmann [13], when objecting to Einstein's views:\nevery spacetime theory admits a generally covariant representation (see also [15, 16]). For TDiff, a representation\nof this kind can be found, e.g., in [18]. It introduces an absolute prior-geometric object [22], namely a background\ndensity g̃, so that all occurrences of g in the scalar Lagrangian3 appear in the covariant form g/g̃ (then again,\nwhen the coordinates employed are such that g̃ equals the unit scalar density we recover straightforwardly our\naction (1.3)). In this work, we go one step further to search for a covariant version of TDiff theory. We find\nthat, under certain simple boundary conditions, TDiff theory is equivalent to a general scalar-tensor theory with a\nspecific gauge-fixing. Moreover, we claim that - boundary conditions provided - these two (set of) theories are\n\"physically equivalent\", to the same extent that General Relativity constrained to the harmonic gauge - or any\nother gauge - corresponds in its physical consequences to General Relativity in its covariant standard form (we\nare just \"fixing the gauge\"):\n\u0014 \u0012Z\n\u0013\n\u0013\n\u0015\n\u0012Z\n√\n√\nδ\n⇐⇒\nd4 x gR = 0\nδ\nd4 x gR = 0\n\"physically equivalent\"\n\n√\n∂μ ( ggμν )=0\n\nBy general scalar-tensor theory we mean that the gravitational scalar is arbitrarily present in all terms of the\nLagrangian. This contrasts with the standard presentation of scalar-tensor theory [12, 10, 6], which employs the\nprinciple of universal coupling in the matter Lagrangian, or the equivalent concept of a metric theory of gravity\n(see for example [22, 24]), and where the occurrence of the gravitational scalar in the matter Lagrangian is limited\nto a certain type of terms. In passing, these prescriptions were developed to comply with the (Weak) Equivalence\nPrinciple in this theory; see however [7] regarding their convenience.\nThe idea of a correspondence between TDiff and general scalar-tensor gravity has already been touched upon in\nprevious studies [3, 4], and has even made use of, but now the aim is to definitively establish it; we address it in\nsection 3.\nIn sections 4 and 5, we deal with particular aspects of this correspondence: the energy-momentum tensors and\nflat limits in both theories. Finally, we conclude in section 6.\n2. TDiff Gravity vs. Unimodular theories\nThe TransverseDiff symmetry at the linear level can be implemented in two different fashions in the Lagrangian,\nwhich give rise to two very different theories at the non-linear level.\nThe first route was explored in the aforementioned seminal paper [23]. One should note that the transversality\ncondition in (1.1) is directly affecting the transformation rule of the trace of hμν : hμμ → hμμ + ∂μ ξ μ , such that this\nquantity is an invariant. Therefore, one can decide to restrict the value of the trace in the theory to have a fixed\nvalue, typically hμμ = 0. In the full non-linear regime, this naturally translates into the condition g ≡ −det(gμν ) = 1,\nwhich explains the name unimodular gravity, but one could also fix the determinant of the metric to any arbitrary\nfunction.\n√\n2For example, the Electromagnetic Lagrangian is generalized to − 1 f\n( g − 1)Fμν F μν\n4 EM\n3Note that we have implicitly defined the Lagrangian without the usual factor √g.\n\n\fTRANSVERSEDIFF GRAVITY IS TO SCALAR-TENSOR AS UNIMODULAR GRAVITY IS TO GENERAL RELATIVITY.\n\n3\n\nTherefore, unimodular gravity is based upon a reduction of the functional space on which the Einstein-Hilbert\naction is defined:\ngμν → ĝμν , with det(ĝμν ) = ǫ0\n(2.1)\n\n1\nSEH [gμν ] ≡ − 2\n2κ\n\nZ\n\n1\n√\nd x gR[gμν ] → SUG [ĝμν ] ≡ − 2\n2κ\n4\n\nZ\n\nd4 xǫ0 R[ĝμν ]\n\nwhere ǫ0 is some fixed scalar density, usually taken unity. The symmetries of this action are the \"volume preserving\n√\ndiffeomorphisms (VPD)\", which respect g(x) = g ′ (x) (and at the infinitesimal level δξ g = ∇μ ξ μ = ∂μ ( gξ μ ) = 0).\nNote that these are not the same as (1.2) unless ǫ0 (x) = const. We have 9 e.o.m.'s δS/δĝμν = 0 (of which only\n6 are independent, in virtue of the 3 functional-parameter VPD symmetry) for 9 functions ĝμν : the result is a 3\nfunctional-parameter space of solutions. This theory, as it turns out, resembles General Relativity with a gaugefixing constraint on the metric. In fact, the only difference at the classical level is an arbitrary integration constant\nthat appears, and which plays the role of a cosmological constant (see Appendix B).\nOn the other hand, the approach that we are interested in, named \"TDiff gravity\" after the symmetry, is based\nupon application of a symmetry principle on the full space of metrics gμν (see (1.3) and (1.2)). There are 10 e.o.m.'s:\nδS/δgμν = 0 (only 7 independent in virtue of TDiff-based Bianchi identities), for 10 functions gμν . This theory is\nconnected to scalar-tensor theory with a gauge-fixing constraint, as we will see.\n3. Correspondence between TDiff gravity and a general scalar-tensor theory.\nTheorem. Of correspondence between scalar-tensor and TDiff gravity.\nLet us have a TDiff theory of the general form (1.3)(1.4), abbreviated as\nZ\np\np\nSTDiff = d4 x g(x)L(gμν (x), g(x) − 1; ψ(x)),\n\nformulated in an open patch of coordinates B, with boundary ∂B, and where the ψ(x) stands for a generic matter\nfield. Consider now the corresponding scalar-tensor theory with action\nZ\np\nSST = d4 x g(x)L(gμν (x), φ(x); ψ(x)),\n\n√\nwhere the explicit dependency on the determinant of the metric g − 1 has been replaced by the new scalar field\nφ. Then, the set of (classical) solutions in both theories that fulfill that L → 0 at the boundary ∂B is the same,\nprovided\n√ that we consider \"physically equivalent\" all solutions in a gauge orbit; specifically, we take the partial gauge\nfixing g − 1 = φ on the scalar-tensor solutions:\n{(gμν , ψ)| δSTDiff [gμν ; ψ] = 0, L(gμν ,\n\n√\n\ng − 1; ψ)|∂B = 0}\n\n≡\n\n{(gμν , φ, ψ)| δSST [gμν , φ; ψ] = 0, L(gμν , φ; ψ)|∂B = 0}|φ=√g−1\n\nProof. We start with a lemma\nLemma. By using the Lagrange multipliers procedure, one can establish the following exact correspondence:\n(3.1)\n\nδSTDiff ≡ δ|φ=√g−1 SST = 0 ⇐⇒ δST ≡ δ(SST + Sλ ) = 0\np\nR\nR\nwhere Sλ ≡ d4 xλ(x)f [gμν (x), φ(x)] = d4 xλ(x)( g(x) − 1 − φ(x)) and λ(x) is taken as another dynamical field.\nThat is to say, the set of classical solutions of both theories, STDiff and a \"restricted SST \" coincide, let this be\n√\nachieved directly -by definition- imposing the restriction φ = g − 1 in the configuration space, or by means of\na Lagrange multiplier with the extended action ST .\n√\n√\nProof. The e.o.m.'s of the STDiff theory, making use of the functional relation STDiff [gμν , g−1; ψ] = SST [gμν , φ( g−\n√\n√\n1); ψ], with φ( g − 1) = g − 1, are:\n\u0015\n\u0014\n√\nδSST\nδSST δ g\nδSTDiff\n(3.2)\n≡\n+\n0 =\nδgμν\nδφ δgμν\nδgμν φ=√g−1\n\u0015\n\u0014\nδSST\nδSTDiff\n(3.3)\n≡\n0 =\nδψ\nδψ φ=√g−1\n\n\fTRANSVERSEDIFF GRAVITY IS TO SCALAR-TENSOR AS UNIMODULAR GRAVITY IS TO GENERAL RELATIVITY.\n\n4\n\nto compare with the e.o.m.'s of the ST theory:\nδST\n√\n≡ g−1−φ\nδλ\nδST\nδSST\n0 =\n(3.4)\n≡\n−λ\nδφ\nδφ\n√\nδ g\nδSST\nδST\n≡λ\n+\n0 =\nδgμν\nδgμν\nδgμν\nδSST\nδST\n≡\n0 =\nδψ\nδψ\nBy employing the first of these four equations in the others, and eliminating λ among the second and third equations,\nwe reach the above conclusion.\n\u0003\n0 =\n\nFollowing the main concept of this lemma, that STDiff theory is a restricted version of a SST theory (previous\nto any variational principle), the set of (classical) solutions of the STDiff theory would be greater in general than\nthe normal, unrestricted SST theory after gauge-fixing: this is a well-known mathematical property of restricted\nvariations, since the space of solutions of a restricted theory is always bigger -or equal- to the unrestricted\ntheory's one after imposing the same condition (the two procedures, restricted variations and restriction on the\nspace of solutions of the unrestricted variations, do not commute in general):\n{(gμν , ψ)| δSTDiff [gμν ; ψ] ≡ δ|φ=√g−1 SST [φ, gμν ; ψ] = 0} ⊇ [{(φ, gμν , ψ)| δSST [φ, gμν ; ψ] = 0}]φ=√g−1\nHowever, when the restriction corresponds to fixing a trivial direction in the configuration space, the two procedures\ncommute and we have exactly the same set of solutions.\nThe intuition comes from the case when instead of a functional SST [φ, gμν , ψ], we have a function of the variables\nV (~x), say a potential, whose extrema we want to find. Let us suppose that we have a certain symmetry on the\npotential\n~ =0\nδξ V ≡ δξ ~x * ∇V\n\n(3.5)\n\n~ 6= 0). If we do impose the restriction before the\nwhich we fix with a restriction f (~x) = 0 (so that δξ f ≡ δξ ~x * ∇f\ncalculus of the extrema we will get, resorting to the Lagrange multipliers method:\n~ + λ∇f\n~\n∇V\n\n(3.6)\n\nf\n\n=\n\n0\n\n=\n\n0\n\nTaking the scalar product of the first equation in the direction of the symmetry δξ ~x we arrive to the equation\n~ =0\nδξ (λf ) ≡ λδξ ~x * ∇f\n\n(3.7)\n\nwhich indicates that λ is 0 on-shell and, therefore, one could have imposed the restriction after the extremalization\nprocedure, just the same.\nIn the following, let us generalize this \"toy-model\" to the situation with a functional of the fields and, at the\nsame time, particularize to our specific case. In the first place, we require the action to possess a symmetry under\nunbounded variations, δ̃ (variations that do not vanish at the boundary):\n\u0015\n\u0014\nI\nZ\n∂L\nδ̃qi (x)\n(3.8)\nδ̃S[qi (x)] ≡ dx[Euler − Lagrange]i δ̃qi (x) + dΣμ\n∂(∂μ qi )\n∂B\n\nas opposed to the bounded variations δ\n(3.9)\n\nδS[qi (x)] ≡\n\nZ\n\ndx[Euler − Lagrange]i δqi (x)\n\nwhere there is an implicit sum on the index i of the various fields qi (x). This symmetry is a null variation in a\ncertain coordinate-dependent \"direction\" labeled ξ\n(3.10)\n\nδ̃ξ S[qi (x)] = 0\n\nIn passing, although the e.o.m.'s are obtained with the usual bounded variations δ, it is necessary to consider such\na wider class of variations δ̃ in order to obtain the analogous of (3.7), as we will see later. Now, since we have\nrestricted ourselves to the case when the Lagrangian goes to zero at the boundary, LST → 0, we do have such\n∂B\n\n\fTRANSVERSEDIFF GRAVITY IS TO SCALAR-TENSOR AS UNIMODULAR GRAVITY IS TO GENERAL RELATIVITY.\n\n5\n\na symmetry in our scalar-tensor action. For a general infinitesimal (active) gauge transformation with spacetime\nparameter ξ μ (x) we obtain\nI\nZ\n√\n√\n=\ndΣμ [ gξ μ L]∂B\n=0\nSST =\nd4 x∂μ ( gξ μ LST )\n(3.11)\nδ̃ξ\nLST → 0\n\nLST → 0\n\n∂B\n\nLST → 0\n\n∂B\n\n∂B\n\n√\nCorrespondingly, in this situation we have a globally-defined gauge transformation that takes as from φ to g − 1\nor, what is the same, from SST to STDiff (the precise transformation is detailed in Appendix C).\nIn the second place, let us examine what the gauge unbounded variation of Sλ with the on-shell condition\n√\nφ = g − 1 entails in our case:\n#\nZ \"\ni\nh\nδ̃Sλ\nδ̃Sλ\n+ δ̃ξ φ\n(3.12)\nδ̃ξ gμν\n=\nδ̃ξ Sλ\n=\n√\nφ= g−1\nδ̃gμν\nδ̃φ φ=√g−1\n(3.13)\n\n=\n\nso that\n\nZ\n\n√\n[(∇μ ξν ) ( gg μν λ) + (ξ μ ∂μ φ) (−λ)]φ=√g−1 =\ni\nh\nδ̃ξ Sλ\n\n(3.14)\n\n√\nφ= g−1\n\nZ\n\n√\nλ g∂μ ξ μ , ∀ξ μ\n\n= 0, ∀ξ μ ⇐⇒ λ = 0\n\nin complete analogy with the situation in (3.7). Let us remark that this condition is not true when we just consider\nthe subset of bounded variations, so that one can perform an integration by parts with a null boundary term in\n(3.13).\nFinally, we need the unbounded version δ̃ST = 0 of the usual on-shell condition δST = 0 to act as (3.6). Here,\nthe restriction LST →0 proves again essential. Take δST = 0, so that the Euler-Lagrange equations are satisfied,\n∂B\n\nand consider the differences between (3.8) and (3.9). The additional boundary term in the former is zero in virtue\nof the restriction LST →0 and the fact that our gauge-fixing does not depend on the derivatives of the fields. Then,\n∂B\n\nthe Euler-Lagrange equations being fulfilled in the bulk, one is left only with the contribution at the boundary in\n(3.8), a set of zero measure. Unless subtleties involved, this should not contribute and we obtain:\n(3.15)\n\n0 = δ|LST → 0 ST = δ̃\n∂B\n\nLST → 0\n\nST = δ̃\n\nLST → 0\n\nSST + δ̃Sλ .\n\n∂B\n\n∂B\n\nCombining the equations (3.11) and (3.15), with variations in a particular direction ξ, we arrive to\ni\nh\n= 0, ∀ξ μ\n(3.16)\nδ̃ξ Sλ\n√\nφ= g−1\n\nNote that (3.15) implies, in particular, the on-shell condition φ =\non-shell and therefore\n(3.17)\n\nδ|LST → 0 STDiff ≡ δ|LST → 0; φ=\n∂B\n\n∂B\n\n√\n\ng−1\n\n√\ng − 1. Then, following (3.14) we have λ = 0\n\u0014\n\nSST = δ|LST → 0 ST = 0 ⇐⇒ δ|LST → 0 SST = 0\n∂B\n\n∂B\n\n\u0015\n\n√\nφ= g−1\n\nThere is yet a further step that consists on proving4\n\u0014\n\u0015\n(3.18)\nδ|LST → 0 SST = 0\n⇐⇒ [δSST = 0]LST → 0; φ=√g−1\n√\nφ= g−1\n\n∂B\n\n∂B\n\nor, in more generality,\n(3.19)\n\nδ|L → 0 S = 0 ⇐⇒ [δS = 0]L → 0\n∂B\n\n∂B\n\ni.e., that the restriction L → 0 can be implemented equivalently before and after taking the variations. The\n∂B\n\nfollowing lemma completes the proof.\n\n4We would not need to show explicitly the corresponding statement δ|\nLST → 0 ST = 0 ⇐⇒ [δST = 0]LST → 0 since the set of\n∂B\n\ni\nh\nsolutions of δST ≡ δ|φ=√g−1 SST = 0\nof [δSST = 0]LST → 0;\n∂B\n\nφ=\n\n√\n\nLST → 0\n∂B\n\n∂B\n\nis clearly contained in δ|LST → 0 ST = 0 and, at the same time, contains the solutions\n∂B\n\ng−1 . Hence, it suffices to prove the equality of these two last sets.\n\n\fTRANSVERSEDIFF GRAVITY IS TO SCALAR-TENSOR AS UNIMODULAR GRAVITY IS TO GENERAL RELATIVITY.\n\n6\n\nLemma. δ|L → 0 S = 0 ⇐⇒ [δS = 0]L → 0\n∂B\n\n∂B\n\nProof. Having a look at expression (3.9), one can check that the condition L → 0 imposes no restriction to the values\n∂B\n\nof the δqi (x) so that the usual Euler-Lagrange equations are derived inside the region, apart from the aforementioned\ncondition. This amounts to equivalence between both ways of calculating variations stated in the lemma.\nYet, let us impose the restriction L → 0 at the level of the action with the aid of a Lagrange multiplier. That\n\ncould be done in the following form:\n(3.20)\n\nSL.m. =\n\n∂B\n\nI\n\n∂B\n\ndxb λ(xb )L(xb ) =\n\nZ\n\nd4 xλ(x)L(x)δ(x − xb )\n\n5\n\nIf we now attempt to compute the e.o.m.'s corresponding to the extended action Sext ≡ S + SL.m., we would arrive\nat the expression (see 3.8):\nZ\n(3.21)\n0 = δSext =\nd4 x [[Euler − Lagrange]i (x) + [Euler − Lagrange]i (x)λ(x)δ(x − xb )] δqi (x)\nZ\n+ d4 xL(x)δ(x − xb )δ̃λ(x)\n\nNote that, in principle, the variation of λ does not have to be zero at the boundary. Also, one can see that the\nrestriction does not lead to any modification of the equations in the bulk (x 6= xb ). Indeed, one finally arrives to\n\n(3.22)\n\n[Euler − Lagrange]i (x) =\nL(xb ) =\n\n0, ∀i, x 6= xb\n0\n\nwhich is just the same set of e.o.m.'s that the expression [δS = 0]L → 0 would render.\n\n\u0003\n\n∂B\n\n\u0003\nLet us make some comments following the theorem. First, a totally analogous theorem exists which connects GR\nand unimodular gravity (2.1). Indeed, the action for unimodular gravity can be written with the help of a Lagrange\nmultiplier as in Appendix B (ǫ0 (x) = 1)\nZ\ni\nhp\np\ng(x)R(x) + λ(x)( g(x) − 1)\n(3.23)\nSUG = d4 x\nand, following a similar reasoning, one can establish the equivalence of the solutions of both theories when the\nLagrangian goes to zero at the boundary. This result is already well-known, since the integration constant playing\nthe role of a cosmological constant that appears in unimodular gravity - with respect to GR - is non-zero at the\nboundary.\nActually, a far more general conclusion can be drawn from our line of reasoning: for any Lagrangian theory with\na globally-defined gauge symmetry, it is equivalent to impose a gauge-fixing without derivatives before or after the\ncalculation of variations, provided that we only consider (classical) solutions that make the Lagrangian vanish at the\nboundary of spacetime. This adds up to the result in [19, 20] (Hamiltonian and Lagrangian treatment, respectively),\nthat \"the effect of plugging the gauge fixing constraint into the Lagrangian can be compensated by adding to the\nequations of motion for the reduced [restricted] theory some constraints that have disappeared as such along the\nprocess\" 6.\nSecond, this theorem somehow contradicts common beliefs of other authors. On the other hand, the results in\nreference [18] are compatible with the theorem; this latter work is a previous study on the relation between TDiff\n(called \"unimodular metagravity\") and scalar-tensor from another perspective7.\n5One simple picture to capture the situation is to imagine 3-dimensional space and a boundary S of radius unity. By using polar\n2\ncoordinates\nthe points xb would be spanned by the angular coordinates Ω (at fixed radius r = 1). Then one would use the identity\nR\ndr r 2 δ(r − 1) = 1 to obtain a three-dimensional integral.\n6The paradigmatic example is the temporal gauge A = 0 of electromagnetism which, if plugged directly in the action before the\n0\ncalculus of variation, leads to the disappearance of the Gauss constraint, ∂α F α0 = 0, although it is kept compatible with the dynamical\n(Hamiltonian-picture) evolution. Our boundary condition on the Lagrangian restores it. On the other hand, the Lorenz gauge ∂μ Aμ = 0,\nincluding a derivative, escapes our conclusion.\n7\nIn [18], the author finds solutions for the TDiff theory (referred to as \"unimodular metagravity\") that are not present in the\ncorresponding scalar-tensor theory (corresponding in the sense stipulated by our theorem). These solutions are parametrized by a\nnon-zero value of the parameter λh in equation (9). According to our theorem, they should all imply a non-zero value of the Lagrangian\n\n\fTRANSVERSEDIFF GRAVITY IS TO SCALAR-TENSOR AS UNIMODULAR GRAVITY IS TO GENERAL RELATIVITY.\n\n7\n\n√\nThird, we have expressed the explicit dependence on g of the TDiff theory by g − 1 throughout the paper, so\nthat it vanishes in Minkowski space with (canonical) cartesian coordinates. Whether the requirement L → 0 is\n∂B\n\n\"natural\" or too restrictive is left to the reader.\nFourth and last, we have used a Lagrangian formalism throughout the proof. It would be desirable to complement\nthis point of view by resorting to the Hamiltonian formalism of constrained systems, as in [11] for the case of\nunimodular gravity.\n4. Energy-Momentum Tensors\nIn this section, we want to compare the energy-momentum tensors naturally defined in both theories: scalartensor and TDiff. Are these the same quantity? how do they relate to each other? For the comparison, we will\nuse a \"gauge-fixed\" scalar-tensor, although we know that this is physically-equivalent to the covariant one, as was\nstated in the introduction.\nThe Rosenfeld prescription for the energy-momentum tensor\n(4.1)\n\n1 δSM\nT μν ≡ √\ng δgμν\n\n(where SM stands for the matter action) guarantees that this tensor is conserved on-shell, ∇μ T μν = 0, in\nany Lagrangian-based generally covariant metric theory without absolute non-dynamical variables, through the\ngravitational-field equations [14] (and also directly, by the definition of the matter Lagrangian in a metric theory itself); this is the case of a metric scalar-tensor theory. Let's compare what the Rosenfeld prescription entails\nfor both theories, \"gauge-fixed scalar-tensor\" and TDiff:\n\n(4.2)\n\n(4.3)\n\nμν\nTST\n|φ=√g−1\n\n\u0015\n\u0014\n1 δSM,ST\n≡√\ng\nδgμν φ=√g−1\n\n1 δSM,TDiff\n1 δ|φ=√g−1 SM,ST\nμν\nTTDiff\n≡ √\n= √\ng δgμν\ng\nδgμν\n\nA rough summary of the theorem in the previous section would be that, under certain boundary conditions, the\n√\nrestriction φ = g − 1 can be taken before or after the variations in the action:\n(4.4)\n\n[δSM,ST ]φ=√g−1 ∼ δ|φ=√g−1 SM,ST\n\nHowever, note that this equality does not extend to the energy-momentum tensors as previously defined:\n\u0014\n\u0015\n1 [δSM,ST ]φ=√g−1\n1 δ|φ=√g−1 SM,ST\n1 δSM,ST\n6= √\n(4.5)\n= √\n√\ng δgμν φ=√g−1\ng\nδgμν\ng\nδgμν\nIndeed, a direct computation with the generic matter action SM,ST [φ, gμν ; ψ] gives us\n\u0014\n\u0015\n\u0015\n\u0014\n1 √ μν\n1 δSM,ST\n1 δSM,ST\nμν\n+√\ngg ,\n(4.6)\nTTDiff = √\n√\ng\nδgμν φ=√g−1\ng\nδφ\nφ= g−1 2\nto be compared with (4.2), and note that the second term does not have to vanish in general. We thus have two\ndifferent definitions of the energy-momentum tensor.\nIn conclusion, the strict use of the Rosenfeld prescription in both theories does lead to different energy-momentum\ntensors, even if the theories themselves are equivalent: the Rosenfeld energy-momentum tensor depends on the\nrepresentation of the theory. Once one accepts the correspondence between scalar-tensor and TDiff theory, there is\nμν\nμν\nnot really a compelling reason to use TTDiff\n, which does not share with TST\nthe property of being conserved.\nat the boundary of spacetime. We are not going to find all the solutions, but we note that the trivial configuration (gμν → ημν , χ → 0,\nΛ = 0) at the boundary, which makes the Lagrangian vanish, is a solution only for λh = 0.\nRegarding the λh = 0 case, the author has confirmed the equivalence between both theories [private communication].\n\n\fTRANSVERSEDIFF GRAVITY IS TO SCALAR-TENSOR AS UNIMODULAR GRAVITY IS TO GENERAL RELATIVITY.\n\n8\n\n5. Flat Limit\nIn this section, we want to compare the (two different kinds of) flat limits in both theories: scalar-tensor and\nTDiff. We should and, indeed, we do obtain the same behaviour, in agreement with their established equivalence.\nThe (false) impression that a flat limit of TDiff should just amount to the substitution of the determinant of the\n√\nmetric g by unity, is deceiving.\n5.1. Global flat limit (weak field). The (global) flat limit is defined by g → ξ with R[ξ] = 0, i.e., the Riemann\ncurvature tensor of the metric tensor vanishes. In coordinates: gμν (x) → ξμν (x), with Rμνλγ [ξ](x) = 0. The\ng.f.l.\n\nMinkowski form of the metric (ημν (x) = diag(−1, 1, 1, 1)) is just one member of the set of flat coordinate metrics:\nημν (x) ∈ {ξμν (x)}.\n• Scalar-tensor:\nR\nR\n√\n√\nSM = dV gf (φ)( 12 g μν ∂μ Ψ∂μ Ψ − V (Ψ)) → SM = dV ξf (φ)( 12 ξ μν ∂μ Ψ∂μ Ψ − V (Ψ)) =\ng.f.l.\nR\nR\n√\n=\ndV ηf (φ)( 12 η μν ∂μ Ψ∂μ Ψ − V (Ψ)) = dV f (φ)( 12 η μν ∂μ Ψ∂μ Ψ − V (Ψ))\nDif f invariance\n\n• TDiff:\nWe formulate\nthe action in a certain set of coordinates (characterized\nthe condition that the J = 1).\nR\nR\n√ by√\n√\n√\nSM = dV gf ( g − 1)( 12 g μν ∂μ Ψ∂μ Ψ − V (Ψ)) → SM = dV ξf ( ξ − 1)( 12 ξ μν ∂μ Ψ∂μ Ψ − V (Ψ)) =\ng.f.l.\nR\nR\n√\n√\n√\n=\ndV ηf (J −1 η − 1)( 21 η μν ∂μ Ψ∂μ Ψ − V (Ψ)) = dV f (J −1 η)( 21 η μν ∂μ Ψ∂μ Ψ − V (Ψ))\ncoord. change\n\nA Jacobian of the coordinate transformation with respect to the original set of coordinates, J, has appeared\n√\nin a general set of coordinates. The quantity J −1 η − 1 behaves as a (Diff) scalar. If we set its value to a\nconstant in a certain set of coordinates, it will be the same constant also in every other set of coordinates /\nreference frame. Therefore, much as in scalar-tensor theory, we can not really get rid of it, unless we want\nto make the whole theory trivial.\n\n5.2. Local flat limit (\"free fall\"). It is always possible to find a coordinate system where the first derivatives of\nthe metric - or equivalently, the Christoffels - vanish along a worldline, which we can take timelike P(τ ), such\nthat in the new coordinate system gμν → gμ̂ν̂ one has the \"free fall\" approximation\n\ngμ̂ν̂ (x) = ημ̂ν̂ (P(τ )) + o((x − P(τ ))2 ∂ 2 gμ̂ν̂ )\nR\n√\n√\nIf we start from a TDiff action SM = dV gf ( g − 1)( 12 g μν ∂μ Ψ∂μ Ψ − V (Ψ)) and change to the \"caret\"\ncoordinates, we will introduce Jacobians:\nZ\nZ\np\np\n1\n√\n√\n1 μν\nSM = dV gf ( g − 1)( g ∂μ Ψ∂μ Ψ − V (Ψ))\n=\ndV ĝf (J −1 ĝ − 1)( ĝ μν ∂μ Ψ∂μ Ψ − V (Ψ))\ncoord. change\n2\n2\n\nSo, when we finally do a Taylor-like expansion around P(τ ) (we take the fields to \"live\" in a local neighborhood of\nthe timelike worldline)\nZ\nZ\np\np\np\n1\n1\nSm ≃ dV η̂f (J −1 η̂ − 1)( η̂ μν ∂μ Ψ∂μ Ψ − V (Ψ)) = dV f (J −1 η̂ − 1)( η̂ μν ∂μ Ψ∂μ Ψ − V (Ψ))\n2\n2\n√\n−1\nη̂ − 1 is present, much like the corresponding φ in scalar-tensor theory.\nthe scalar J\n6. Conclusions\n\nLet us summarize our results. We started by imposing a TDiff gauge symmetry group to the gravitational\nLagrangian based on a symmetric rank-two tensor gμν , as opposed to the standard Diff symmetry that leads us\nto General Relativity. Since the symmetry group is smaller, we thus get to a more general Lagrangian (1.3)(1.4).\nThen, the theorem stated in section 3 tells us that, modulo some boundary conditions, one can view this theory\n√\njust as a general scalar-tensor theory that has been presented in a particular gauge, namely φ = g − 1, but whose\ninherent symmetry group is again Diff (it is \"physically-equivalent\", in the sense of the introduction). At the end of\nthe day, we have \"gained\" a scalar degree of freedom that was not postulated, but appears automatically due to the\nlack of symmetry. In a way, the TDiff group can be thus considered to give rise to general-scalar tensor theory. This\npresent knowledge builds up from previous works [3, 4]. In addition, some collateral consequences of the theorem\nwith a wider scope of application are presented at the end of section 3: these confront the question of \"whether it\nmakes a difference to impose the gauge-fixing before or after the calculus of variations\"\n\n\fTRANSVERSEDIFF GRAVITY IS TO SCALAR-TENSOR AS UNIMODULAR GRAVITY IS TO GENERAL RELATIVITY.\n\n9\n\nRegarding the observational signatures of TDiff theories at the classical level, one can therefore rely on this\nequivalence to take advantage from the abundant literature that studies the bounds on the scalar-tensor theory.\nThe same metric / universal coupling requirement that is usually imposed for scalar-tensor theory - which was\nmentioned in the introduction - can be applied directly in the TDiff Lagrangian (1.3)(1.4) by considering only\nmatter Lagrangians without explicit dependence on g.\nAcknowledgement. I am grateful to Enrique Alvarez and Anton F. Faedo for our previous work on the subject,\nthat opened this interesting perspective. I have largely benefited from discussion with Josep M. Pons, and from\nhis comments. I also want to thank Daniel Zenhäusern for his interest and help with the project during my stay\nat EPFL, Lausanne. On the other hand, I missed some more support from the mathematics community that I\nconsulted. This work has been partially supported by the European Commission (HPRN-CT-200-00148) as well as\nby FPA2009-09017 (DGI del MCyT, Spain) and S2009ESP-1473 (CA Madrid). The author is personally supported\nby a MEC grant, AP2007-00385.\nReferences\n[1]\n[2]\n[3]\n[4]\n[5]\n[6]\n[7]\n[8]\n[9]\n[10]\n[11]\n[12]\n[13]\n[14]\n[15]\n[16]\n[17]\n[18]\n[19]\n[20]\n[21]\n[22]\n[23]\n[24]\n\nE. Alvarez, D. Blas, J. Garriga, and E. Verdaguer. Transverse Fierz-Pauli symmetry. Nucl. Phys., B756:148–170, 2006.\nEnrique Alvarez and Anton F. Faedo. Unimodular cosmology and the weight of energy. Phys. Rev., D76:064013, 2007.\nEnrique Alvarez, Anton F. Faedo, and J. J. Lopez-Villarejo. Ultraviolet behavior of transverse gravity. JHEP, 10:023, 2008.\nEnrique Alvarez, Anton F. Faedo, and J. J. Lopez-Villarejo. Observational constraints on transverse gravity. JCAP, 0907:002, 2009.\nDavid G. Boulware and Stanley Deser. Classical General Relativity Derived from Quantum Gravity. Ann. Phys., 89:193, 1975.\nC. Brans and R. H. Dicke. Mach's principle and a relativistic theory of gravitation. Phys. Rev., 124:925–935, 1961.\nThibault Damour. Questioning the equivalence principle. 2001.\nJ. Earman. The cosmological constant, the fate of the universe, unimodular gravity, and all that. Stud. Hist. Philos. Mod. Phys.,\n34:559–577, 2003.\nR.P. Feynman. Lectures on Gravitation. Caltech, 1962.\nM. Fierz. On the physical interpretation of P.Jordan's extended theory of gravitation. Helv. Phys. Acta, 29:128–134, 1956.\nM. Henneaux and C. Teitelboim. The cosmological constant and general covariance. Phys.Lett, B222:195-199, 1989.\nP. Jordan. Schwerkaft und Weltall. (Vieweg, Braunschweig, 1955).\nE. Kretschmann. Uber den physikalischen Sinn der Relativitatspostulat, A Einsteins neue und seine ursprunglische Relativitatstheorie. Annalen der Physik, 53:575–614, 1993.\nD. L. Lee, A. P. Lightman, and W. T. Ni. Conservation laws and variational principles in metric theories of gravity. Phys. Rev.,\nD10:1685–1700, 1974.\nJ. D. Norton. General covariance, gauge theories, and the Kretschmann objection. In *Brading, K. (ed.) et al.: Symmetries in\nphysics* 110- 123.\nJ. D. Norton. General Covariance and the Foundations of General Relativity: Eight Decades of Dispute. Reports on Progress in\nPhysics, 56:791–858, 1993.\nT. Padmanabhan. From gravitons to gravity: Myths and reality. Int. J. Mod. Phys., D17:367–398, 2008.\nYu. F. Pirogov. Unimodular metagravity vs. General Relativity with a scalar field. Phys. Atom. Nucl., 73:134–137, 2010.\nJ. M. Pons. Plugging the gauge fixing into the Lagrangian. Int. J. Mod. Phys., A11:975–988, 1996.\nJosep M. Pons. Substituting fields within the action: consistency issues and some applications. 2009.\nLee Smolin. The quantization of unimodular gravity and the cosmological constant problem. 2009.\nKip S. Thorne, David L. Lee, and Alan P. Lightman. Foundations for a theory of gravitation theories. Phys. Rev. D, 7(12):3563–3578,\nJun 1973.\nJ. J. van der Bij, H. van Dam, and Yee Jack Ng. The exchange of massless spin two particles. Physica, 116A:307–320, 1982.\nClifford M. Will. The confrontation between general relativity and experiment. Living Reviews in Relativity, 9(3), 2006.\n\nAppendix A. Active symmetry group vs. passive covariance group.\nWe want to distinguish two different ways in which the diffeomorphism group (Diff or TDiff) enters our considerations, although this separation is not standard: there is the concept of the (passive) covariance group of the\nrepresentation, an invariance of form of the theory's Lagrangian when the spacetime coordinates are transformed;\nthen, there is also the associated \"active covariance group\", which one can consider a gauge symmetry group and is\njust the active version of the former transformation on the dynamical fields (not the background quantities) that\nleaves the action invariant. Both groups do not necessarily have to coincide, and the difference lies precisely in our\ntreatment of the background quantities.\nFor example, the quantity\nZ\n√\n(A.1)\nd4 x gg\n\nis both (just) TDiff covariant with respect to coordinate transformations and has (just) a TDiff gauge symmetry\ngroup. However, the quantity\n\n\fTRANSVERSEDIFF GRAVITY IS TO SCALAR-TENSOR AS UNIMODULAR GRAVITY IS TO GENERAL RELATIVITY.\n\n10\n\n√ g\nd4 x g ,\ng̃\nwhich includes a background density field g̃, is fully generally covariant with respect to coordinate transformations,\nwhile its gauge symmetry group remains (just) TDiff, due to the presence of a fixed absolute prior-geometric object.\nAs can be inferred from the example, the gauge symmetry implies the covariance under the associated coordinate\ntransformation, but not vice versa.\nZ\n\n(A.2)\n\nAppendix B. Unimodular gravity vs General Relativity\nIt is widely known that unimodular theories are classically equivalent to General Relativity when the latter is\n\"gauge-fixed\" with the condition8 g = 1, safe for an arbitrary cosmological constant term that emerges in the form\nof an integration constant. One can immediately see this by using the Lagrange multiplier procedure to implement\nthe constraint on the determinant of the metric:\n(B.1)\n(B.2)\n\nSUG ≡ −\n\n1\n2k 2\n\nZ\n\n=⇒ SUG,ext ≡ SGR + SUG,λ = −\n\n√\n√\nd4 x [ gR + gLSM [ψm , gμν ]]√g=1\n\n1\n2k 2\n\nZ\n\n√\n√\nd4 x [ gR + gLSM [ψm , gμν ]] +\n\nZ\n\n√\nd4 xλ( g − 1)\nδS\n\nG,λ\nAs compared to the GR template, the only difference is the appearance in the e.o.m for gμν , δgUμν\n= 0, of an extra\np\nμν\nterm of the type ∼ g(x)λ(x)g (x) ; furthermore, the (on-shell) Bianchi identity stemming from the Diff-invariant\n√\nδS\nterms of the action forces λ(x) = λ = const. Then, the equation for λ, UδλG,λ = 0, fixes the \"gauge\" g = 1.\n√\nAppendix C. Gauge transformation between φ and g − 1\n\nUnder an (active) coordinate gauge transformation, we have the transformation rules:\nhp\ni\np\np\np\np\np\ng ′ (x) − 1 = J −1 g(x) − 1 +\ng ′ (x) − g ′ (x′ ) , with\ng ′ (x′ ) = J −1 g(x),\n(C.1)\n\n(C.2)\n\nφ′ (x) = φ(x) + [φ′ (x) − φ′ (x′ )] , with φ′ (x′ ) = φ(x),\n\nwhich correspond to the Lie derivative at the infinitesimal level,\n(C.3)\np\np\np\np\np\np\np\np\ng ′ (x) − 1 = g(x) − 1 + g(x)∂a ξ a (x) + ξ a (x)∂a g(x) = g(x) + ∂a ( g(x)ξ a (x)) = g(x) + g(x)∇a ξ a (x)\n\nφ′ (x) = φ(x) + ξ a (x)∂a φ(x)\np\n√\nWe see that taking the jacobian J(x) = g(x)/ (φ(x) + 1) we will obtain equality among φ′ and g ′ − 1 at each\npoint of spacetime (the \"transport terms\" in squared brackets will be equal).\n(C.4)\n\nEuropean Organization for Nuclear Research, CERN CH-1211, Geneve 23, Switzerland and\nDepartamento de Física Teórica and Instituto de Física Teórica UAM/CSIC, E-28049-Madrid, Spain\nE-mail address: jj.lopezvillarejo@cern.ch; jjlopezvillarejo@gmail.com\n\n8It does not matter whether we take √g or g to 1 [23]\n\n\f"}