{"id": "http://arxiv.org/abs/1008.3755v3", "guidislink": true, "updated": "2011-02-15T12:03:06Z", "updated_parsed": [2011, 2, 15, 12, 3, 6, 1, 46, 0], "published": "2010-08-23T05:55:04Z", "published_parsed": [2010, 8, 23, 5, 55, 4, 0, 235, 0], "title": "Quark-model Baryon-Baryon Interaction Applied to the Neutron-Deuteron\n  Scattering. I Noyes-Kowalski Approach to the AGS Equations", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1008.2922%2C1008.2770%2C1008.0706%2C1008.2056%2C1008.2382%2C1008.0868%2C1008.2448%2C1008.2903%2C1008.4847%2C1008.4735%2C1008.1059%2C1008.0371%2C1008.4514%2C1008.3284%2C1008.0563%2C1008.4006%2C1008.3279%2C1008.3485%2C1008.5315%2C1008.3395%2C1008.1409%2C1008.5244%2C1008.4985%2C1008.4442%2C1008.2049%2C1008.3354%2C1008.4740%2C1008.0498%2C1008.0749%2C1008.5163%2C1008.2095%2C1008.2223%2C1008.1361%2C1008.3588%2C1008.0132%2C1008.4484%2C1008.4804%2C1008.5103%2C1008.2043%2C1008.3324%2C1008.0253%2C1008.4490%2C1008.0565%2C1008.3554%2C1008.2745%2C1008.2564%2C1008.0516%2C1008.0678%2C1008.3898%2C1008.1002%2C1008.1610%2C1008.0670%2C1008.2383%2C1008.2181%2C1008.4241%2C1008.1105%2C1008.1850%2C1008.2972%2C1008.4217%2C1008.1116%2C1008.4912%2C1008.3140%2C1008.2251%2C1008.3145%2C1008.2381%2C1008.3034%2C1008.1028%2C1008.4506%2C1008.3901%2C1008.2608%2C1008.2238%2C1008.5164%2C1008.1563%2C1008.2065%2C1008.1740%2C1008.4813%2C1008.2730%2C1008.0937%2C1008.0161%2C1008.4571%2C1008.1477%2C1008.2286%2C1008.0469%2C1008.3755%2C1008.0928%2C1008.3799%2C1008.0273%2C1008.3245%2C1008.1755%2C1008.0501%2C1008.3705%2C1008.4154%2C1008.2164%2C1008.2270%2C1008.2793%2C1008.2977%2C1008.0358%2C1008.4760%2C1008.1593%2C1008.4561%2C1008.3136&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Quark-model Baryon-Baryon Interaction Applied to the Neutron-Deuteron\n  Scattering. I Noyes-Kowalski Approach to the AGS Equations"}, "summary": "We solve the neutron-deuteron (nd) scattering in the Faddeev formalism,\nemploying the NN sector of the quark-model baryon-baryon interaction fss2. The\nenergy-dependence of the NN interaction, inherent to the resonating-group\nformulation of the quark-model baryon-baryon interaction, is eliminated by the\nstandard off-shell transformation utilizing the normalization kernel of\ntwo-cluster systems. An extra nonlocality originating from this procedure is\nvery important to reproduce all the nd scattering observables below E_n < 65\nMeV. A new algorithm to solve the Alt-Glassberger-Sandhas (AGS) equations is\npresented in the Noyes-Kowalski method. The treatment of the moving singularity\nfrom the three-body Green function is shown in detail, which is based on the\nspline function method originally developed by the Bochum-Krakow group. The\npredicted elastic differnetial cross sections reproduce the observed deep cross\nsection minima at E_n=35-65 MeV and $\\theta_{c.m}=130^{\\circ}-135^{\\circ}$,\nwhich is consitent with the nearly correct triton binding energy predicted by\nfss2 without the three-body force.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1008.2922%2C1008.2770%2C1008.0706%2C1008.2056%2C1008.2382%2C1008.0868%2C1008.2448%2C1008.2903%2C1008.4847%2C1008.4735%2C1008.1059%2C1008.0371%2C1008.4514%2C1008.3284%2C1008.0563%2C1008.4006%2C1008.3279%2C1008.3485%2C1008.5315%2C1008.3395%2C1008.1409%2C1008.5244%2C1008.4985%2C1008.4442%2C1008.2049%2C1008.3354%2C1008.4740%2C1008.0498%2C1008.0749%2C1008.5163%2C1008.2095%2C1008.2223%2C1008.1361%2C1008.3588%2C1008.0132%2C1008.4484%2C1008.4804%2C1008.5103%2C1008.2043%2C1008.3324%2C1008.0253%2C1008.4490%2C1008.0565%2C1008.3554%2C1008.2745%2C1008.2564%2C1008.0516%2C1008.0678%2C1008.3898%2C1008.1002%2C1008.1610%2C1008.0670%2C1008.2383%2C1008.2181%2C1008.4241%2C1008.1105%2C1008.1850%2C1008.2972%2C1008.4217%2C1008.1116%2C1008.4912%2C1008.3140%2C1008.2251%2C1008.3145%2C1008.2381%2C1008.3034%2C1008.1028%2C1008.4506%2C1008.3901%2C1008.2608%2C1008.2238%2C1008.5164%2C1008.1563%2C1008.2065%2C1008.1740%2C1008.4813%2C1008.2730%2C1008.0937%2C1008.0161%2C1008.4571%2C1008.1477%2C1008.2286%2C1008.0469%2C1008.3755%2C1008.0928%2C1008.3799%2C1008.0273%2C1008.3245%2C1008.1755%2C1008.0501%2C1008.3705%2C1008.4154%2C1008.2164%2C1008.2270%2C1008.2793%2C1008.2977%2C1008.0358%2C1008.4760%2C1008.1593%2C1008.4561%2C1008.3136&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We solve the neutron-deuteron (nd) scattering in the Faddeev formalism,\nemploying the NN sector of the quark-model baryon-baryon interaction fss2. The\nenergy-dependence of the NN interaction, inherent to the resonating-group\nformulation of the quark-model baryon-baryon interaction, is eliminated by the\nstandard off-shell transformation utilizing the normalization kernel of\ntwo-cluster systems. An extra nonlocality originating from this procedure is\nvery important to reproduce all the nd scattering observables below E_n < 65\nMeV. A new algorithm to solve the Alt-Glassberger-Sandhas (AGS) equations is\npresented in the Noyes-Kowalski method. The treatment of the moving singularity\nfrom the three-body Green function is shown in detail, which is based on the\nspline function method originally developed by the Bochum-Krakow group. The\npredicted elastic differnetial cross sections reproduce the observed deep cross\nsection minima at E_n=35-65 MeV and $\\theta_{c.m}=130^{\\circ}-135^{\\circ}$,\nwhich is consitent with the nearly correct triton binding energy predicted by\nfss2 without the three-body force."}, "authors": ["Yoshikazu Fujiwara", "Kenji Fukukawa"], "author_detail": {"name": "Kenji Fukukawa"}, "author": "Kenji Fukukawa", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1143/PTP.124.433", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1008.3755v3", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1008.3755v3", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "37 pages, 4 figures, 1 table", "arxiv_primary_category": {"term": "nucl-th", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "nucl-th", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1008.3755v3", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1008.3755v3", "journal_reference": "Prog.Theor.Phys.124:433-469,2010", "doi": "10.1143/PTP.124.433", "fulltext": "1\n\nQuark-Model Baryon-Baryon Interaction Applied to\nNeutron-Deuteron Scattering. I\nNoyes-Kowalski Approach to the AGS Equations\nYoshikazu Fujiwara and Kenji Fukukawa\nDepartment of Physics, Kyoto University, Kyoto 606-8502, Japan\n\narXiv:1008.3755v3 [nucl-th] 15 Feb 2011\n\n(Received July 13, 2010; Revised August 11, 2010)\nWe solve the neutron-deuteron (nd) scattering in the Faddeev formalism, employing\nthe N N sector of the quark-model baryon-baryon interaction fss2. The energy dependence\nof the N N interaction, inherent to the resonating-group formulation of the quark-model\nbaryon-baryon interaction, is eliminated by the standard off-shell transformation utilizing\nthe normalization kernel of two-cluster systems. An extra nonlocality originating from this\nprocedure is very important to reproduce all the nd scattering observables below En ≤ 65\nMeV. A new algorithm to solve the Alt-Grassberger-Sandhas (AGS) equations is presented\nin the Noyes-Kowalski method. The treatment of the moving singularity from the three-body\nGreen function is shown in detail, which is based on the spline function method originally\ndeveloped by the Bochum-Krakow group. The predicted elastic differential cross sections\nreproduce the observed deep cross section minima at En = 35–65 MeV and θcm = 130◦ –135◦ ,\nwhich is consistent with the nearly correct triton binding energy predicted by fss2 without\nthe three-body force.\nSubject Index: 205\n\n§1.\n\nIntroduction\n\nThe QCD-inspired spin-flavor SU6 quark model (QM) for the baryon-baryon\ninteraction, developed by the Kyoto-Niigata group, is a unified model describing\ninteractions between full octet-baryons.1) It is given by the Born kernel formulated in\nthe resonating-group method (RGM) for interacting three-quark clusters. The shortrange part is described by an effective one-gluon exchange, while the medium- and\nlong-range parts are dominated by meson-exchange potentials between quarks. The\nmodel parameters are constrained to reproduce all the two-nucleon data and available\nlow-energy hyperon-nucleon scattering data. These QM baryon-baryon interactions\nare characterized by the nonlocality and energy dependence inherent to the RGM\nframework. For example, the Pauli-forbidden state appears on the quark level in\ncertain channels of the strangeness sector, as a result of the exact antisymmetrization\nof six quarks. The short-range repulsion described by the nonlocality of the quarkexchange kernel gives quite different off-shell properties from the standard mesonexchange potentials. The energy dependence of the interaction is eliminated by\nthe standard off-shell transformation, utilizing a square root of the normalization\nkernel N .2)–5) This procedure yields an extra nonlocality, whose effect was examined\nin detail for the three-nucleon (3N ) bound state and for the hypertriton.6) The\nadvantage of the larger triton binding energy caused by the QM nucleon-nucleon\n(N N ) interaction, namely, the deficiency of 350 keV, predicted using the most recent\n\n\f2\n\nY. Fujiwara and K. Fukukawa\n\nmodel fss2, is still much smaller than the standard values of 0.5 – 1 MeV,7) given by\nthe modern meson-exchange N N potentials. It is therefore interesting to examine\npredictions based on the QM N N interaction for the 3N scattering, especially in\nthis renormalized framework without the explicit energy dependence of the RGM\nkernel.\nAn attempt to investigate the effect of nonlocality of the underlying two-body\ninteraction on three-cluster systems composed of composite particles is actually not\nnew. Even if we restrict our interest to the 3N system, there are many investigations to improve the triton binding energy and the neutron-deuteron (nd) scattering\nobservables, from various types of nonlocal N N interaction.8)–11) There is, however,\nno extensive investigation of the 3N system, employing a consistent N N nonlocal\ninteraction that reproduces all the two-nucleon data with satisfactory accuracy.\nIn this series of papers, we apply our QM N N interaction fss2 to the nd scattering in the Faddeev formalism for systems of composite particles.12)–14) The\nAlt-Grassberger-Sandhas (AGS) equations15) are solved in the momentum representation, using the off-shell RGM t-matrix obtained from the energy-independent\nrenormalized RGM kernel. The Gaussian nonlocal potential constructed from the\nfss2 is used in the isospin basis.16) The singularity of the N N t-matrix from the\ndeuteron pole is handled by the Noyes-Kowalski method.17), 18) To the best of our\nknowledge, this simple method to solve a singular Lippmann-Schwinger equation has\nnever been seriously applied to the AGS equation, despite the fact that this method\nwas originally developed for application to three-body problems. We will show a\nnew practical algorithm to solve the AGS equations in this Noyes-Kowalski method.\nAnother notorious moving singularity of the three-body Green function for the free\nmotion is treated by the standard spline interpolation technique developed by the\nBochum-Krakow group.19)–22) Here again, we will give a detailed procedure and\nformulations since they do not seem to be available in the literature. We mainly\nuse the channel-spin formalism, which is convenient to discuss the nd scattering.\nThe accuracy of the numerical calculations can be checked by examining the optical\ntheorem for the nd scattering. The N N interaction up to Imax = 4 with a sufficient number of partial waves of the three-body system is included, resulting in the\nmaximum neutron incident energy of about En = 65 MeV in the laboratory system.\nHere, Imax is the maximum value of the two-nucleon angular momentum included\nin the calculation. In this paper, we only show the results of total and differential\ncross sections of the nd elastic scattering. Polarizations and deuteron breakup cross\nsections are discussed in subsequent papers.∗) The details of the Gaussian nonlocal\npotentials and an application to the S-wave nd scattering length will be given in\nseparate papers.26)\nThe organization of this paper is as follows. In §2.1, we first recapitulate our\nQM baryon-baryon interaction and then outline the whole procedure to solve AGS\nequations for the nd scattering. An emphasis is put on how to calculate an extra\nnonlocal kernel originating from the elimination of the energy dependence in the\nRGM kernel. The essential part of this analytic formulation is given in Appendix A.\n∗)\n\nA preliminary report on the present subject is found in Refs. 23)–25).\n\n\fQuark-Model Baryon-Baryon Interaction Applied to nd Scattering\n\n3\n\nIn §2.2, we exhibit a new formulation of AGS equations, incorporating the deuteron\nsingularity of the N N t-matrix in the Noyes-Kowalski method. The basic equation\nis convenient to derive the optical theorem by a simple manipulation in the operator\nformalism. The contribution of the breakup cross sections to the optical theorem\nis thoroughly discussed in §2.3. Practical calculations are made by the procedure\ngiven in §2.4, where the moving singularity of the three-body Green function for\nthe free motion is processed by the subtraction method and the spline interpolation\ntechnique. The detailed procedure to calculate the basic integral Qkμν is given in\nAppendix B. The total cross sections derived from the optical theorem and nd elastic\ndifferential cross sections are shown in §3.1 and §3.2, respectively. It is found that\nthe predicted elastic differential cross sections reproduce the observed deep cross\nsection minima on the high-energy side, which is consistent with the nearly correct\ntriton binding energy predicted using fss2 without the three-body force. The last\nsection is devoted to a summary.\n§2.\n\nFormulation\n\n2.1. Quark-model baryon-baryon interaction\nThe QM baryon-baryon interaction is a low-energy effective model that introduces some of the essential features of QCD (quantum chromodynamics) characteristics. The color degree of freedom of quarks is explicitly incorporated into the nonrelativistic spin-flavor SU6 quark model, and the full antisymmetrization of quarks\nis carried out in the RGM formalism. The gluon exchange effect is represented in\nthe form of the quark-quark interaction. The confinement potential is a phenomenological r 2 -type potential, which has a favorable feature in that it does not contribute\nto the baryon-baryon interactions. We use a color analogue of the Fermi-Breit (FB)\ninteraction, motivated from the dominant one-gluon exchange process in the highmomentum region. We postulate that the short-range part of the baryon-baryon\ninteraction is well described by the quark degree of freedom. This includes the\nshort-range repulsion and spin-orbit force, both of which are successfully described\nby the FB interaction. On the other hand, the medium-range attraction and longrange tensor force, especially afforded by the pions, are extremely nonperturbative.\nThese are therefore most relevantly described by the effective meson exchange potentials (EMEPs). The most recent model fss2 includes the vector-meson exchange\nEMEP, in addition to the scalar- and pseudoscalar-meson exchange potentials.27), 28)\nThe quark-model Hamiltonian h consists of the phenomenological confinement\npotential UijCf , the colored version of the full FB interaction UijFB with explicit quarkmass dependence, and the EMEP UijΩ generated from the scalar (Ω=S), pseudoscalar\n(PS), and vector (V) meson exchange potentials acting between quarks:\n\nh=\n\n6 \u0012\nX\ni=1\n\np2\nmi c + i − TG\n2mi\n2\n\n\u0013\n\n6 \u0010\n\u0011\nX\nUijCf + UijFB + UijS + UijPS + UijV . (2.1)\n+\ni<j\n\n\f4\n\nY. Fujiwara and K. Fukukawa\n\nThe RGM equation for the relative-motion wave function χ(r) reads\nhφ(3q)φ(3q)|E − h|A {φ(3q)φ(3q)χ(r)}i = 0 ,\n\n(2.2)\n\nwhere φ(3q) is a simple harmonic-oscillator (h.o.) shell-model wave function for the\nthree-quark clusters. We solve this RGM equation in the momentum representation.29) If we rewrite the RGM equation in the form of the Schrödinger-type equation as [ε − h0 − VRGM (ε)]χ(r) = 0, the potential term, VRGM (ε) = VD + G + εK,\nbecomes nonlocal and energy-dependent. Here, VD represents the direct potential of\nEMEPs, G includes all the exchange kernels for the interaction and kinetic-energy\nterms, K = 1 − N is the exchange normalization kernel, and ε is the total energy in\nthe center-of-mass (cm) system, measured from the two-cluster threshold. We calculate the plane-wave matrix elements of VRGM (ε), and set up with the LippmannSchwinger equation for the RGM t-matrix. This approach is convenient to proceed\nto the G-matrix calculations30), 31) and to the Faddeev calculations with some special\nconsiderations of the Pauli-forbidden states.12)–14)\nThe energy-independent renormalized RGM kernel V RGM for a two-cluster system is given by5)\nV RGM = VD + G + W .\n\n(2.3)\n\nThe nonlocal kernel W appears through the elimination of the energy dependence,\nand is given by\n1\n1\nW = Λ√ h√ Λ − h .\nN\nN\n\n(2.4)\n\nHere, N = 1 − K is the normalization kernel, h = h0 + VD + G with h0 being\nthe kinetic energy for the two-cluster relative motion, and Λ = 1 − |uihu| is the\ntwo-cluster Pauli projection operator, where |ui is a Pauli-forbidden state satisfying\nK|ui = |ui. The Born kernel W (p, p′ ) of Eq. (2.4), or its partial wave component,\n√\nis calculated accurately using an analytical procedure to obtain K = Λ(1/ N − 1)Λ\nin the momentum representation. This is discussed in Appendix A. In the N N\nsector, no Pauli-forbidden state appears on the quark level, so that we can simply\nset Λ = 1 in the following formulations. An advantage of using V RGM is that the twocluster RGM equation takes the form of the usual Schrödinger equation in the Pauliallowed model space, and the relative wave function is properly normalized. This\nSchrödinger-type equation for the relative wave function gives the same asymptotic\nbehavior as the original RGM equation, thus preserving the phase shifts and physical\nobservables for the two-cluster systems. The difference between the previous energydependent RGM kernel, VRGM (ε) = VD +G+εK, and V RGM in Eq. (2.3) is essentially\na replacement of Λ(εK)Λ with W . The value of ε is, however, not properly defined in\nthe three-cluster system, in particular, for the scattering systems. In the following,\nwe will consistently use the energy-independent renormalized RGM kernel V RGM in\nEq. (2.3), both for the bound-state solution and the scattering problems.\nThe three-cluster equation for the 3N bound state is written as\n\u0002\n\u0003\nE − H0 − VαRGM − VβRGM − VγRGM Ψ = 0 ,\n(2.5)\n\n\fQuark-Model Baryon-Baryon Interaction Applied to nd Scattering\n\n5\n\nwhere α, β, and γ denote three independent pairs of two-cluster subsystems, H0 is\nthe free three-body kinetic-energy operator, and VαRGM stands for the RGM kernel\nin Eq. (2.3) for the α-pair, etc. In Ref. 6), we have solved Eq. (2.5) in the Faddeev\nformalism\n(2.6)\n\nψ = G0 tP ψ ,\n\nwhere G0 = G0 (z) = 1/(z − H0 ) is the three-body Green function for the free\nmotion, P = P(12) P(13) + P(13) P(12) is a permutation operator for the rearrangement,\nand t = t(z − h̄0 ) is the N N t-matrix derived by solving the Lippmann-Schwinger\nequation t = v + vG0 t with v = V RGM in Eq. (2.3). Here, z = E is the total energy,\nwhich is below the deuteron energy εd (< 0) for the 3N bound state. The energy\nargument of t is z − h̄0 , where h̄0 is the kinetic-energy operator for the relative\nmomentum q = (2k3 − k1 − k2 )/3. Another momentum for the two-nucleon relative\nmotion is denoted by p = (k1 −k2 )/2 with h0 being the corresponding kinetic-energy\noperator. The three-body kinetic-energy operator is therefore H0 = h0 + h̄0 . In Eq.\n(2.6), ψ is the Faddeev component that yields the total wave function Ψ in Eq. (2.5)\nthrough Ψ = (1+P )ψ. The basic equation for the nd scattering is the AGS equation,\nwhich can be expressed as21)\n(2.7)\n\nU |φi = G0 −1 P |φi + P t G0 U |φi ,\n\nwhere |φi = |q 0 , ψd i is the plane-wave channel wave function with |ψd i being the\ndeuteron wave function. In this case, z = E + i0 is the total energy approached from\nthe upper side of the real axis in the complex energy plane, and E = Ecm + εd with\nEcm = (3~2 /4M )q0 2 being the neutron incident energy in the cm system. We use an\naverage nucleon mass M = (Mp + Mn )/2 in the isospin formalism. The scattering\namplitude for the elastic scattering is obtained from hφ|U |φi. It is important that\nEq. (2.7) also provides information on the full breakup process of the deuteron. The\ntransition amplitude for the breakup process is given by\n(2.8)\n\nU0 |φi = (1 + P )tG0 U |φi = (1 + P )T |φi ,\n\nwhere T = tG0 U corresponds to the three-body t-matrix. The breakup cross sections\nare obtained from the amplitude hpq|U0 |φi with the corresponding energy E =\n(~2 /M )(p2 + (3/4)q 2 ).\n2.2. Noyes-Kowalski method for the singularity of the N N t-matrix\nFor the description of the nd elastic scattering, it is convenient to use the channelspin representation, in which the angular-spin functions are defined through\nX\nb; 123i\n|p, q; 123i =\n|p, q, γi hγ|b\np, q\nγ\n\nh\n\u0002\u0002\n\u0003\n\u0003 i\nb; 123|γi = Yl (b\nhb\np, q\nq ) Yλ (b\np)χst (1, 2) I χ 1 1 (3) Sc\n2 2\n\nJJz ; 21 Tz\n\n,\n\n(2.9)\n\nwith γ = l[(λs)I 12 ]Sc ; JJz ; (t 21 ) 12 Tz . Here, χst (1, 2) etc. are the spin-isospin wave\nfunctions. In particular, the deuteron channels are specified by\nγd = l[(λ1)1 12 ]Sc ; JJz ; (0 12 ) 12 Tz ,\n\n(2.10)\n\n\f6\n\nY. Fujiwara and K. Fukukawa\n\nwith λ = 0 and\nP 2, corresponding to the S-wave and D-wave components, respectively.\nWe use t = γ |γitγ hγ|, and separate the γ-sum into γ ∈\n/ (γd ) and γ ∈ (γd ). The\nt-matrix of the deuteron channel has the deuteron pole, which we explicitly separate\nas\nb\ntγd\n.\n(2.11)\nz − h̄0γd − εd\nR∞\nIf we use the completeness relationship, 0 q 2 d q |qihq| = 1, and the spectral decomposition of the two-nucleon Green function, we can easily show\nZ ∞\nb\nb\n\u0001\ntγd\ntγ [q]\n4M\nq 2 d q |qi 2 d 2 hq| − ic |q0 ib\ntγd [q0 ]hq0 | ,\n(2.12)\n= 2P\n3~\nq0 − q\nz − h̄0γd − εd\n0\ntγd =\n\nwhere we have used a notation\nc = 2π\n\nq0 M\n,\n3~2 \u0012\n\nb\ntγd [q] = b\ntγd\n\n3~2 2\n(q0 − q 2 ) + εd\n4M\n\n\u0013\n\n,\n\nb\ntγd [q0 ] = b\ntγd (εd ) = g0 (εd )−1 |ψd ihψd |g0 (εd )−1 ,\n\n(2.13)\n\nwith g0 (εd )−1 |ψd i = (εd − h0 )|ψd i = v|ψd i being the deuteron solution. For the\nseparable deuteron residue, we in fact need to make a distinction between the Swave and D-wave channels by writing b\ntγd (εd ) as\nb\ntγd ,eγd (εd ) = g0 (εd )−1 |ψγd ihψγed |g0 (εd )−1 ,\nX\nX\nhψd |ψd i =\nhψγd |ψγd i = 1 ,\n|γd i|ψγd i = |ψd i .\nγd\n\n(2.14)\n\nγd\n\nIn Eq. (2.12), we should note\n\nsince\n\n|q0 ib\ntγd (εd )hq0 | = g0 (εd )−1 |q0 , ψd ihq0 , ψd |g0 (εd )−1 = G0 −1 |φihφ|G0 −1 , (2.15)\ng0 (εd )−1 |q0 , ψγd i = (εd − h0 )|q0 , ψd i =\n\n\u0012\n\n\u0013\n3~2 2\nq0 + εd − h0 − h̄0 |q0 , ψd i\n4M\n\n= G0 −1 |q0 , ψd i = G0 −1 |φi ,\n\n(2.16)\n\nwith |φi = |q0 , ψd i. In fact, a more rigorous expression is\nX\nX\nγd | =\n|γd i|q0 ib\ntγd ,eγd (εd )hq0 |he\n|γd iG0 −1 |q0 , ψγd ihq0 , ψγed |G0 −1 he\nγd |\nγd ,e\nγd\n\n= G0\n\n−1\n\nX\nγd\n\n= G0\n\n−1\n\n|q0 , γd i|ψγd i\n\nX\n\n|q0 , ψd ihq0 , ψd |G0\n\ned\nγ\n−1\n\nγd ,e\nγd\n\ned |G0 −1\nhψγed |hq0 , γ\n\n= G0 −1 |φihφ|G0 −1 .\n\n(2.17)\n\n\fQuark-Model Baryon-Baryon Interaction Applied to nd Scattering\n\n7\n\ne Since this tensor\nHere, γ\ned is defined from γd in Eq. (2.10) by just replacing λ with λ.\ncoupling is cumbersome in the complicated expressions, we shall use in the following\ntγd . After all, we have obtained\na simple notation to represent b\ntγd ,eγd by b\nZ ∞\nX\nb\nb\ntγd\ntγ [q]\n4M X\nhγd | = 2\n|γd i\nq 2 d q |q, γd i 2 d 2 hq, γd |\nP\n3~ γ\nq0 − q\nz − h̄0γd − εd\n0\nγ\nd\n\nd\n\n−icG0 −1 |φihφ|G0 −1 .\n\n(2.18)\n\nWe write the first term of the right-hand side (r.h.s.) as e\ntγd and generalize the\nexpression to all the channels:\n(\nt̃γ\nγ∈\n/ (γd )\nfor\ntγ =\n.\n(2.19)\ne\nγ ∈ (γd )\ntγd − icG0 −1 |φihφ|G0 −1\nThis yields a separation of the two-nucleon singularity from the full t-matrix:\nt=e\nt − icG0 −1 |φihφ|G0 −1 ,\nP\nP\nP\ne\nwhere e\nt = γ |γie\ntγ hγ| (= γ ∈(γ\n/ d ) |γitγ hγ| +\nγd |γd itγd hγd |) with\n4M\ne\ntγd = 2 P\n3~\n\nZ\n\n0\n\n∞\n\nq 2 d q |q, γd i\n\nb\ntγd [q]\nhq, γd | .\nq0 2 − q 2\n\n(2.20)\n\n(2.21)\n\nThe difference between t and e\nt appears only when q = q0 in the deuteron channel,\nand e\nt also satisfies the same basic t-matrix equation e\nt = v + vG0 e\nt. If we use Eq.\n(2.20) in Eq. (2.7), it becomes\nU |φi = G0 −1 P |φi [1 − ichφ|U |φi] + P e\ntG0 U |φi ,\n\n(2.22)\n\nU |φi = U ′ |φi [1 − ichφ|U |φi] ,\n\n(2.23)\n\nsince P G0 −1 = G0 −1 P . If we define U ′ |φi by\nit satisfies the following equation:\n\nU ′ |φi = G0 −1 P |φi + P e\ntG0 U ′ |φi .\n\n(2.24)\n\nP |φi Z −1 hφ|U ′ |φi = P |φi + P |φi Z −1 hφ|P e\ntG0 U ′ |φi .\n\n(2.25)\n\nG0 U ′ |φi = P |φi Z −1 hφ|U ′ |φi + W e\ntG0 U ′ |φi ,\n\n(2.26)\n\nW = G0 P − P |φi Z −1 hφ|P .\n\n(2.27)\n\nWe set Z = hφ|G0 −1 P |φi and multiply Eq. (2.24) by P |φi Z −1 hφ| from the left-hand\nside (l.h.s.), and obtain\n\nWe further multiply Eq. (2.24) by G0 from the l.h.s. and subtract Eq. (2.25) from\nthe result. Then, the first terms of the r.h.s. cancel, and we obtain\n\nwhere we have defined W by\n\n\f8\n\nY. Fujiwara and K. Fukukawa\n\nThus, if we set\nG0 U ′ |φi = Q|φi Z −1 hφ|U ′ |φi ,\n\n(2.28)\n\nQ|φi = P |φi + W e\ntQ|φi .\n\n(2.29)\n\nhφ|G0 −1 Q|φi = hφ|G0 −1 P |φi = Z ,\n\n(2.30)\n\nQ|φi satisfies\n\nWe should note that W in Eq. (2.27) satisfies hφ|G0 −1 W = 0 and W G0 −1 |φi = 0.\nThus, if we multiply Eq. (2.29) by hφ|G0 −1 from the l.h.s., we obtain\nwhich is consistent with the definition of Q|φi in Eq. (2.28). Furthermore, e\ntγ in Eq.\n(2.29) can be restored to tγ for the deuteron channel γ = γd owing to W G0 −1 |φi = 0,\nthus allowing us to write e\nt as t.\nWe should note that the channel wave function |φi is actually |φ; (lSc )JJz i\nin the channel-spin representation with at most three possible configurations, i.e.,\n1\n(lSc )J = (J + 23 , 32 )J, (J − 12 , 12 )J, and (J − 21 , 32 )J for the parity π = (−1)J− 2 ,\n1\nand (J − 32 , 23 )J, (J + 12 , 12 )J, and (J + 12 , 32 )J for π = (−1)J+ 2 . Namely, we should\nunderstand\nXZ ∞\np2 d p |p, q0 , γd i ψγd (p) , (2.31)\n|φ; (lSc )JJz i = |q0 , ψd ; (lSc )JJz i =\nλ\n\n0\n\nusing γd defined in Eq. (2.10). The basic relationship in Eq. (2.30) implies that Q|φi\nis a modification of P |φi by the effect of the nonsingular interaction e\nt, and the real\n.\nsymmetric matrix Z in Eq. (2 30) plays an essential role in the following discussion.\nIn particular, Z −1 is a nonsingular matrix as seen in Eq. (2.48).∗) Thus, if we define\ne\nQ|φi\n= Q|φi Z −1 ,\n\nPe|φi = P |φi Z −1 ,\n\n(2.32)\n\nand multiply Eq. (2.29) by Z −1 from the r.h.s., we obtain our final equation\ne\ne\nQ|φi\n= Pe|φi + W e\ntQ|φi\n.\n\n(2.33)\n\nhφ|U ′ |φi = Z + hφ|P e\ntQ|φi Z −1 hφ|U ′ |φi .\n\n(2.34)\n\ne\nhφ|X|φi = Z −1 hφ|P e\ntQ|φi Z −1 = hφ|Pee\ntQ|φi\n,\n\n(2.35)\n\nIn order to derive the scattering amplitude, we multiply Eq. (2.24) by hφ| from\nthe l.h.s. and use Eq. (2.28). Then, we find\n\nThen, if we set\n\nwe find\n\n\u0002\n\u0003 \u0002\n\u0003−1\n.\nhφ|U ′ |φi = Z 1 + hφ|X|φihφ|U ′ |φi = Z −1 − hφ|X|φi\n\n(2.36)\n\nThis can be proved if gγd ,γd′ (q0 , q0 ; x) in Eq. (2.41) is a positive- or negative-definite function,\nwhich is true at least for the dominant S-wave deuteron component.\n∗)\n\n\fQuark-Model Baryon-Baryon Interaction Applied to nd Scattering\n\n9\n\nThis expression, together with Eq. (2.23), yields\n\u0002\n\u0003−1\n\u0002\n\u0003−1\nhφ|U ′ |φi = Z −1 − hφ|X|φi + ic * 1\n. (2.37)\nhφ|U |φi = 1 + ichφ|U ′ |φi\n\nA prescription of the principal-value integral still remains in Eq. (2.35) for the γ = γd\nterm. The residue at q = q0 is\nX\nq0 2 hφ|P |q0 , γd ib\ntγd [q0 ]hq0 , γd |Q|φi\nγd\n\n=\n\nX\n\nγd ,γd′\n\nq0 2 hφ|P |q0 , γd ig0 (εd )−1 |ψγd ihψγd′ |g0 (εd )−1 hq0 , γd′ |Q|φi\n\n= q0 2 hφ|P G0 −1 |φihφ|G0 −1 Q|φi = q0 2 Z 2 ,\n\n(2.38)\n\nwhereREq. (2.30) is used in the last part. Thus, we only need to subtract Eq. (2.38)\n∞\nsince 0 d q 1/(q0 2 − q 2 ) = 0:\nhφ|X|φi =\n\n4M\n+ 2\n3~\n\nZ\n\n0\n\n∞\n\nX\n\ne\nhφ|Pe|γi tγ hγ|Q|φi\n\nγ ∈(γ\n/ d)\n\n\"\n#\nX\n1\ne\ndq 2\nq2\nhφ|Pe |q, γd i b\ntγd [q] hq, γd |Q|φi\n− q0 2 .\nq0 − q 2\nγ\n\n(2.39)\n\nd\n\nWe should note that the final equation (2.33) still contains a delta function from\nthe rearrangement factor\nZ\nδ(p′ − p2 )\nδ(p − p1 )\n1 1\n′\n′ ′ ′\n′ (q, q , x)\ng\n.\n(2.40)\ndx\nhp, q, γ|P |p , q , γ i =\nγ,γ\n2 −1\npλ+2\np′λ′ +2\n√\nHere, p1 = p(q ′ , q/2; x) and p2 = p(q, q ′ /2; x) with p(a, b; x) = a2 + b2 + 2abx. We\nuse the spline interpolation for the variable p and introduce the weight factors for\nthe Gauss-Legendre quadrature. For these, we use the notations\nq\npμνκ = p(qμ , qν /2, xκ ) = qμ 2 + qν 2 /4 + qμ qν xκ ,\nSiμνκ = Si (pμνκ ) ,\n\nBγμ,γ ′ ν,κ\n\n(coefficients for spline interpolation)\n\u0012\n\u0012\n\u0013λ\n\u0013λ′\n√\n1\n1\n1\n√\n′\n= qμ ωμ qν ων\ngγ,γ (qμ , qν ; xκ )\nωκ ,\npνμκ\n2\npμνκ\n\n(2.41)\n\nwhere qμ , xκ , etc. are Gauss-Legendre discretization points and ωμ , ωκ , etc. are\nthe corresponding weights. The two-nucleon relative angular momenta, λ and λ′ , in\nBγμ,γ ′ ν,κ are related to γ and γ ′ , respectively. For the on-shell momentum qμ → q0 ,\n√\nwe assume q0 ω0 = 1. Similarly, for κ = 0, appearing in the pole prescription for the\nx-integral later, we assume ω0 = 1. The weight factors are introduced, for example,\nas\n√\n√\nWiμγ,jνγ ′ = qμ ωμ pi 2 ωi hpi , qμ , γ|W |pj , qν , γ ′ i pj 2 ωj qν ων .\n\n(2.42)\n\n\f10\n\nY. Fujiwara and K. Fukukawa\n\nThe key relationship to avoid the appearance of the delta function for p is the\nreplacement\n(2.43)\n\nωj δ (pj − pμνκ ) = Sjμνκ ,\nwhich can be proved from the integration formula\nZ ∞\nX\nδ(p′ − pμνκ )\n′\nf\n(p\n)\n=\nf\n(p\n)\n=\nSjμνκ f (pj ) ,\np′2 dp′\nμνκ\np′2\n0\n\n(2.44)\n\nj\n\nfor arbitrary smooth functions f (p). For the spatial part of the deuteron wave\nfunctions, Feλ (p) = ψγd (p), we also use the notation Fejλ = Feλ (p) = Fλ (pj )/pj , but\napply the spline interpolation not to Feλ (p) directly, but to hp|g0 −1 (εd )ψd i. This is to\navoid the numerical inaccuracy of the spline interpolation and guarantee the exact\nrelationship W G0 −1 |φi = P |φi − P |φi = 0. Namely, we define\n\u0012\n\u0013\n~2 2 e\n−1\ngjλ = hpj |g0 (εd )ψd i = εd −\np Fjλ ,\n(2.45)\nM j\nand calculate Feλμ0κ through\ninstead of Feλμ0κ =\n\nFeλμ0κ =\n\nP\n\nj\n\n\u0012\n\n~2 2\np\nεd −\nM μ0κ\n\n\u0013−1 X\n\nSjμ0κ gjλ ,\n\nSjμ0κ Fejλ . Similarly, we calculate Feλ0νκ through\n\nFeλ0νκ =\n\n\u0012\n\n~2 2\nεd −\np\nM 0νκ\n\n(2.46)\n\nj\n\n\u0013−1 X\n\nSj0νκ gjλ .\n\n(2.47)\n\nj\n\n√\nThen, by using the definition, Piμγ = pi 2 ωi qμ ωμ hpi , qμ , γ|P |φi, we calculate Piμγ\nand Z through\nXX\nPiμγ =\nSi0μκ Bγμ,γd′ 0,κ Feλ′ μ0κ ,\nκ\n\nZ=\n\nX\niλ\n\nλ′\n\ngiλ Pi0γd =\n\nX\u0012\nκ\n\n\u0013X\n~2 2\nεd −\np\nFeλ00κ Bγd 0,γd′ 0,κ Feλ′ 00κ .\nM 00κ\n′\n\n(2.48)\n\nλ,λ\n\nFor Peiμγ = Piμγ Z −1 , we trivially obtain\nX\nUP =\ngiλ Pei0γd = Z Z −1 = 1 .\n\n(2.49)\n\niλ\n\nFor the two-body t-matrix, we define\n\u0013\n\u0012 2\n3~\nγ\nIt\n2\n2\n=\nhp\n|t\ntγe\n(q\n−\nq\n)\n+\nε\ni (λs),(λs)\n0\nμ\nd |pj i\ne\nijμ\n4M\n\u0013\n\u0012\n3~2 2\n4π It\n2\n(q0 − qμ ) + εd ,\nt\npi , pj ;\n=\ne\n(2π)3 (λs),(λs)\n4M\n\n(2.50)\n\n\fQuark-Model Baryon-Baryon Interaction Applied to nd Scattering\n\n11\n\nwhich is simply denoted by tγijμ .\nThe discretization points for qμ are divided into at least two\np or three regions,\ndepending on the incident energy. For q0 < κd with κd =\n(4M/3~2 )|εd | (the\nneutron incident energy Ecm = (3~2 /4M )q0 2 < |εd |), we only have the nd elastic\nscattering, and the behavior of the two-body t-matrix is\nqμ :\n\n[0, q0 ]\n\nq0\n\n[q0 , ∞)\n\nt:\n\nreal ր\n\n∞\n\nց\n\n.\n\n(2.51)\n\nFor q0 > κd (Ecm > |εd |), the three-body breakup is possible and the three-body\nGreen function G0 has a pole. The behavior of the two-body t-matrix in this case is\np\np\nqμ : [0, q0 2 − κd 2 ] [ q0 2 − κd 2 , q0 ] q0 [q0 , ∞)\n,\n(2.52)\nt:\ncomplex\nreal ր\n∞\nց\np\nso that qM = q0 2 − κd 2 is the threshold momentum for the deuteron breakup.\nThe three-body Green function pole is treated in accordance with the subtraction\nmethod discussed in Glöckle et al.'s review paper.21)\nWith these preparations, we can now write down the expressions for the numerical calculations. The most important matrix elements are\n√\nM\n√\nAiμγ,jνγ ′ = −qμ ωμ pi 2 ωi hpi , qμ , γ|P G0 |pj , qν , γ ′ i pj 2 ωj qν ων = 2\n~ qμ qν\n P\n1\nSiνμκ Bγμ,γ ′ ν,κ Sjμνκ\nfor |x0μν | > 1 ,\n\n\n Pκ xκ −x0μν \u0002\n\u0003\n\n1\nκ xκ −x0μν Siνμκ Bγμ,γ ′ ν,κ Sjμνκ − Siνμ0 Bγμ,γ ′ ν,0 Sjμν0 ωκ\n×\nh\ni\n\n\n1−x0μν\n\n +Siνμ0 Bγμ,γ ′ ν,0 Sjμν0 log 1+x\n+\niπθ(1\n−\n|x\n|)\nfor |x0μν | < 1 ,\n0μν\n0μν\n\n(2.53)\n\n\u0001\nwith x0μν = (3/4)qM 2 − qμ 2 − qν 2 /(qμ qν ). The matrix elements of W in Eq. (2.42)\nare calculated from\nWe can prove that\nX\n\nWiμγ,jνγ ′ = Aiμγ,jνγ ′ + Peiμγ Pjνγ ′ .\ngiλ Wi0γd ,jνγ ′ = 0 ,\n\niλ\n\nX\n\nWiμγ,j0γd′ gjλ′ = 0 .\n\n(2.54)\n\n(2.55)\n\njλ′\n\nWe also define the main kernel for the linear equation by\nX\n′\ntγkjν .\nWiμγ,kνγ ′ e\nMiμγ,jνγ ′ =\n\n(2.56)\n\nk\n\nFor the numerical check, we extend the definition of Miμγ,jνγ ′ in Eq. (2.56) to include\nX\nd\nMiμγ,j0γd =\n=0,\n(2.57)\ntγkj0\nWiμγ,k0γd b\nk\n\n\f12\n\nY. Fujiwara and K. Fukukawa\n\nd\nin\nfor the on-shell γ ′ = γd and ν = 0, where the residue of the off-shell t-matrix b\ntγkj0\nthe deuteron channel is given by (a separable kernel)\n\nγd γ\ned\nd\nb\n= gkλ gj λe .\n=b\ntkj0\ntγkj0\n\nThe basic AGS equation Eq. (2.33) is then expressed as\nX\u0002\n\u0003\ne jνγ ′ = Peiμγ .\nδi,j δμ,ν δγ,γ ′ + Miμγ,jνγ ′ Q\n\n(2.58)\n\n(2.59)\n\njνγ ′\n\ne i0γ calculated from\nFor Q\nd\n\ne i0γ = Pei0γ −\nQ\nd\nd\n\nwe can show that\n\nUQ =\n\nX\niλ\n\nX\n\njνγ ′\n\nejνγ ′ ,\nMi0γd ,jνγ ′ Q\n\ne i0γ = 1 ,\ngiλ Q\nd\n\n(2.60)\n\n(2.61)\n\nsimilarly to Eq. (2.49). The explicit expression of Eq. (2.39) is\nX X\ne jμγ\nXlSc ,l′ Sc′ = hφlSc |X|φl′ Sc ′ i =\nPeiμγ tγijμ Q\nγ ∈(γ\n/ d ) μ,i,j\n\n\n\nX\nX\n1\n4M\nd\nejμγ − q0 2 ωμ  ,\n\ntγijμ\nQ\nPeiμγd b\n+ 2\nd\n2\n3~ μ q0 − qμ 2\n\n(2.62)\n\nγd ,i,j\n\nJ\nJ\nand the S-matrix, S(l\n′ S ′ ),(lS ) = δl,l′ δSc ,Sc′ − i2c U(l′ S ′ ),(lS ) , is simply obtained by\nc\nc\nc\nc\nsolving an equation\ni\nXh\n\u0001\nJ\n(2.63)\nZ −1 lSc ,l′ S ′ − XlSc ,l′ Sc′ + ic δl,l′ δSc ,Sc′ U(l\n′ S ′ ),(l′′ S ′′ ) = δl,l′′ δSc ,Sc′′ .\nc\nc\nl′ ,Sc′\n\nc\n\n2.3. Optical theorem\nThe original AGS equation contains the full information of the unitarity for the\nthree-body scattering. Here, we derive the optical theorem, starting from the AGS\nequation Eq. (2.7) or\nU = G0 −1 P + P tG0 U ,\n\n(2.64)\n\nfor the systems composed of three identical particles. We first assume that there is\nno deuteron pole in the two-body t-matrix t. We take the hermitian conjugate of\nEq. (2.64) and replace G0 −1 P with U − P tG0 U :\nU † = G0 −1 P + U † G0 † t† P = G0 −1 P + U † G0 † t† G0 * G0 −1 P\n= G0 −1 P + U † G0 † t† G0 U − U † G0 † t† G0 P tG0 U .\n\n(2.65)\n\n\fQuark-Model Baryon-Baryon Interaction Applied to nd Scattering\n\n13\n\nWe again take the hermitian conjugate and use the fact that P and G0 are exchangeable,\nU = G0 −1 P + U † G0 † tG0 U − U † G0 † t† G0 † P tG0 U .\n\n(2.66)\n\nThe subtraction of Eq. (2.66) from Eq. (2.65) yields\nU † − U = U † G0 † (t† − t)G0 U − U † G0 † t† (G0 − G0 † )P tG0 U .\n\n(2.67)\n\nHere, we use a basic relationship for the two-body t-matrix,\nt† − t = t† (G0 † − G0 )t\n\n(2.68)\n\nG0 † − G0 = 2πiδ(E − H0 ) .\n\n(2.69)\n\nU † − U = 2πi U † G0 † t† δ(E − H0 )(1 + P )tG0 U .\n\n(2.70)\n\nand\n\nThen, we find\n\nIf we have a deuteron pole (or some equivalent divergence of the two-body tmatrix), we have to separate this divergence term using Eq. (2.20). Since e\nt does not\n′\n.\ninvolve the divergence, we can apply the above discussion to U in Eq. (2 24) and e\nt,\nand obtain\nU ′† − U ′ = 2πi U ′† G0 †e\nt† δ(E − H0 )(1 + P )e\ntG0 U ′ .\n\n(2.71)\n\nIf we multiply Eq. (2.71) by [1+ichφ|U |φi∗ ]hφ| from the l.h.s. and by |φi[1−ichφ|U |φi]\nfrom the r.h.s., the relationship in Eq. (2.23) yields\nhφ|U |φi∗ − hφ|U |φi = 2ichφ|U |φi∗ hφ|U |φi\n+2πi hφ|U † G0 † e\nt† δ(E − H0 )(1 + P )e\ntG0 U |φi .\n\nWe can derive another expression similar to Eq. (2.72), starting from\n\u0002 −1\n\u0003\nZ − hφ|X|φi + ic hφ|U |φi = 1 ,\n\nin Eq. (2.37). We multiply Eq. (2.73) by hφ|U |φi∗ from the l.h.s.:\n\u0002\n\u0003\nhφ|U |φi∗ = hφ|U |φi∗ Z −1 − hφ|X|φi + ic hφ|U |φi .\n\n(2.72)\n\n(2.73)\n\n(2.74)\n\nWe further take the hermitian conjugate of Eq. (2.74) and subtract it from Eq. (2.74).\nThen, we find\nhφ|U |φi∗ − hφ|U |φi = 2ic hφ|U |φi∗ hφ|U |φi\n+hφ|U |φi∗ [hφ|X|φi∗ − hφ|X|φi] hφ|U |φi .\n\n(2.75)\n\nThus, the second term of Eq. (2.75) corresponds to the second term of Eq. (2.72).\nThis implies that the imaginary part of hφ|X|φi is related to the breakup cross\n\n\f14\n\nY. Fujiwara and K. Fukukawa\n\nsections. We can also derive this from the basic equation in Eq. (2.33). We make\nhφ|Pe from Eq. (2.33) and use this in Eq. (2.35). Then, we find\ne\ne\ne† e\ne† e\ntQ|φi\n.\nt† W † e\ntQ|φi\n− hφ|Q\nhφ|X|φi = hφ|Q\n\n(2.76)\n\nWe further take the hermitian conjugate of Eq. (2.76) and subtract Eq. (2.76) from\nthe result:\ne\ne† (e\ne\ne† e\nt† (W − W † )e\ntQ|φi\n. (2.77)\nhφ|X|φi∗ − hφ|X|φi = hφ|Q\nt† − e\nt)Q|φi\n− hφ|Q\n\nThen, by using Eq. (2.68) for e\nt and W † − W = (G0 † − G0 )P derived from Eq. (2.27),\nwe eventually obtain\ne† e\ne\nt† (G0 † − G0 )(1 + P )e\nhφ|X|φi∗ − hφ|X|φi = hφ|Q\ntQ|φi\ne† e\ne\n= 2πi hφ|Q\nt† δ(E − H0 )(1 + P )e\ntQ|φi\n.\n\n(2.78)\n\nNote that the first term of Eq. (2.77) gives the direct term of the breakup process,\nwhile the second term gives the exchange term. The last expression of Eq. (2.78)\ncorresponds to the second term of Eq. (2.72) through Eq. (2.75), since we have\ne\nb\nG0 U |φi = Q|φiZ −1 hφ|U |φi = Q|φihφ|U\n|φi ≡ Q|φi\n.\n\nAfter all, we have obtained the relationship\nZ\n(−2i) Imhφ|U |φi = 2ic\ndb\nq 0 |hq 0 , ψd |U |φi|2\n\nb\nb† e\nt† δ(E − H0 )(1 + P )e\ntQ|φi\n,\n+2πi hφ|Q\n\n(2.79)\n\n(2.80)\n\nb0 in the intermediate states is explicitly written.\nwhere the angular integral over q\ne\nWe should note that t in Eq. (2.80) can be safely replaced with t, owing to the\nexistence of the energy-conserving delta function of δ(E − H0 ). In fact, if we use\nEqs. (2.20) and (2.30), we find\ntQ|φi = e\ntQ|φi − ic G0 −1 |φiZ .\n\n(2.81)\n\nHere, the second term does not contribute to the last term of Eq. (2.80), since\nb\nb\nδ(E − H0 )G0 −1 |ψi = 0. Thus, e\ntQ|φi\nin Eq. (2.80) can be replaced by tQ|φi\n=\ntG0 U |φi = T |φi, where T = tG0 U is the three-body t-matrix. If we further use\n(1 + P )2 = 3(1 + P ) and the three-body breakup amplitude, U0 |φi = (1 + P )T |φi,\nEq. (2.80) can be equivalently expressed as\nZ\n(−2i) Imhφ|U |φi = 2ic\ndb\nq 0 |hq 0 , ψd |U |φi|2\n\u0012\n\u0013\nZ\nZ\n1\n~2 2 3~2 2\n+2πi\np −\nq\ndp dq δ E −\n|hp, q|U0 |φi|2 .\n(2.82)\n3\nM\n4M\nIn the channel-spin representation, we take the spin sum for the initial spin states\n|Sc Scz i and obtain\nX\nImhφ; Sc Scz |U |φ; Sc Scz i\n(−2i)\nSc ,Scz\n\n\fQuark-Model Baryon-Baryon Interaction Applied to nd Scattering\n= 2ic\n\nZ\n\n1\n+2πi\n3\n\nX\n\ndb\nq0\nZ\n\nX\n\n′\nSc ,Scz Sc′ ,Scz\n\ndp\n\nZ\n\n15\n\n′\n|hq 0 , ψd ; Sc′ , Scz\n|U |φ; Sc Scz i|2\n\n\u0012\n\n~2 2 3~2 2\np −\nq\ndq δ E −\nM\n4M\n\n\u0013 X X\n\n′\nSc ,Scz Sc′ ,Scz\n\n′\n|hp, q; Sc′ , Scz\n|U0 |φ; Sc Scz i|2 .\n\nWe can carry out the partial-wave decomposition using\nX\n′\nJ\nhφq f ; Sc′ Scz\n|U |φq i ; Sc Scz i =\nU(l\n′ S ′ ),(lS )\nc\nc\n\n(2.83)\n\nl′ lJJz\n\nX\nX\n∗\n′\n×\nqf )\nhlmSc Scz |JJz iYlm\n(b\nqi) ,\nhl′ m′ Sc′ Scz\n|JJz iYl′ m′ (b\n\n(2.84)\n\nm\n\nm′\n\nwith |q f | = |q i | = q0 . Since the operator U is Jz -independent, we can prove\nX\n\nSc ,Scz\n\nhφ; Sc Scz |U |φ; Sc Scz i =\n\n1 X\nJ\n(2J + 1)U(lS\n.\nc ),(lSc )\n4π\n\n(2.85)\n\n(lSc )J\n\nb0 integral allows us to take the sum\nIn the first term of the r.h.s. in Eq. (2.83), the q\nover Scz and Jz in a similar way. In the second term of the r.h.s. in Eq. (2.83), we\n′ sum to the γ sum:\nb and q\nb, and change the Sc′ , Scz\nfirst integrate over p\n\u0012\n\u0013\nZ ∞\nZ\n1 ∞ 2\n~2 2 3~2 2\n2\n2πi\nq dq δ E −\np −\nq\np dp\n3 0\nM\n4M\n0\nX X\nhφq i ; Sc Scz |U0 † |p, q, γihp, q, γ|U0 |φq i ; Sc Scz i .\n(2.86)\n×\nSc ,Scz γ\n\nHere, the p-integral can be carried out from the δ function. We use\n3~2\n~2 2\n~2 2 3~2 2\n~2 2\np −\nq =\n(qM 2 − q 2 ) −\np =\n(p − p2 ) ,\n(2.87)\nM\n4M\n4M\nM\nM 0\np\np\nwith p0 = p0 (q) = (3/4)(qM 2 − q 2 ), which implies that q ≤ qM = q0 2 − κd 2 .\n(This corresponds to the change from e\nt to t before.) Thus, we find\n\u0012\n\u0013\nZ ∞\nZ ∞\n~2 2 3~2 2\n2\n2\nq dq δ E −\np −\nq\np dp\nM\n4M\n0\n0\n\u0012 2\n\u0013\nZ ∞\nZ qM\n2~\n2\n2\np dp δ\nq dq\n=\np0 (p0 − p)\nM\n0\n0\nZ qM\nM\ndq q 2 p0 .\n(2.88)\n= 2\n2~ 0\nE−\n\nThus, Eq. (2.86) becomes\nZ qM\nX X\n1 M\n2\n2πi\nhφq i ; Sc Scz |U0 † |p0 , q, γi\ndq\nq\np\n0\n3 2~2 0\nγ\nSc ,Scz\n\n×hp0 , q, γ|U0 |φq i ; Sc Scz i .\n\n(2.89)\n\n\f16\n\nY. Fujiwara and K. Fukukawa\n\nThe rest is the same as in deriving Eq. (2.85). After all, the partial-wave decomposition of Eq. (2.83) is given by\nX\nq0 M\n(−2i) X\nJ\nJ\n2\n(2J + 1) ImU(lS\n=\ni\n(2J + 1) |U(l\n′ S ′ ),(lS ) |\nc ),(lSc )\nc\nc\n4π\n3~2\n(lSc )J\n(lSc )(l′ Sc′ )J\nZ qM\nX\nX\n1 M\n1\n2πi\n(2J + 1)\n|hp0 , q, γ|U0 |q0 , ψd ; (lSc )JJz i|2 .\ndq q 2 p0\n+\n4π\n3 2~2 0\nγ\n(lSc )J\n\n(2.90)\n\nWe multiply Eq. (2.90) by the overall factor (1/i)(3~2 /q0 M ),\nX\n1 3~2 X\nJ\nJ\n2\n(−2)\n(2J + 1) ImU(lS\n=\n(2J + 1) |U(l\n′ S ′ ),(lS ) |\nc ),(lSc )\nc\nc\n4π q0 M\n(lSc )J\n(lSc )(l′ Sc′ )J\nZ qM\nX\nX\n1 π\n+\n(2J + 1)\n|hp0 , q, γ|U0 |q0 , ψd ; (lSc )JJz i|2 , (2.91)\ndq q 2 p0\n4π q0 0\nγ\n(lSc )J\n\nand use the elastic and breakup scattering amplitudes with a common factor\n1 4M (2π)3 J\nπ 4M J\nU ′ ′\n=−\nU ′ ′\n,\n(4π) 3~2 (4π) (l Sc ),(lSc )\n2 3~2 (l Sc ),(lSc )\nπ 4M\n(br)J\nhp0 , q, γ|U0 |q0 , ψd ; (lSc )JJz i .\n(2.92)\nfγ(lSc ) (q) = −\n2 3~2\nMultiplying Eq. (2.91) by the overall factor 4π{−(π/2)(4M/3~2 )}2 , we find\nX\n4π X\nJ\nJ\n2\n(2J + 1) Imf(lS\n=\n4π\n(2J + 1) |f(l\n′ S ′ ),(lS ) |\n),(lS\n)\nc\nc\nc\nc\nq0\n(lSc )J\n(lSc )(l′ Sc′ )J\nZ qM\nX\nX (br)J\nπ\n+\n(2.93)\n(2J + 1)\n|fγ(lSc ) (q)|2 .\ndq q 2 p0\nq0 0\nγ\nJ\nf(l\n′ S ′ ),(lS ) = −\nc\nc\n\n(lSc )J\n\nWe find that the following relationship holds for each (lSc )J component:\nZ qM\nX (br)J\nX\n1\n1\nJ\nJ\n2\nImf(lSc ),(lSc ) =\n|fγ(lSc ) (q)|2 .\n|f(l′ Sc′ ),(lSc ) | +\ndq q 2 p0\nq0\n4q\n0 0\n′ ′\nγ\n(l Sc )\n\n(2.94)\n\nThe relationship of the total cross sections is obtained by taking a spin average over\nthe initial spin multiplicities\n((2I + 1)(2s + 1) = 6 with I = 1 and s = 12 ), namely, by\nP\ntaking the sum (4π/6) (lSc )J (2J + 1) over Eq. (2.94). For the practical calculation\nof the total breakup cross sections in Eq. (2.94), it is most convenient to use the\nimaginary part of hφ|X|φi through Eq. (2.78). It is rather straightforward to derive\nX\n1\nJ\nJ\n2\nImf(lS\n=\n|f(l\n′ S ′ ),(lS ) |\nc ),(lSc )\nc\nc\nq0\n(l′ Sc′ )\n\u0012\n\u0013 2\nX\n2 ~ 3\n∗\nJ\nJ\n+ −\nImX(l\n(2.95)\nf J′ ′\n′ S ′ ),(l′′ S ′′ ) f(l′′ S ′′ ),(lS ) ,\nc\nc\nc\nc\nπ M 4q0 ′ ′ ′′ ′′ (l Sc ),(lSc )\n(l Sc ),(l Sc )\n\n\fQuark-Model Baryon-Baryon Interaction Applied to nd Scattering\n\n17\n\nJ\n.\nwhere X(l\n′ S ′ ),(l′′ S ′′ ) is given in Eq. (2 62).\nc\n\nc\n\n2.4. Moving singularity of the three-body Green function\nThe direct solution of Eq. (2.59) in terms of Eq. (2.53) causes a serious numerical\nproblem, when it is applied to the energies above the three-body breakup threshold,\nnamely, Ecm = (3~2 /4M )q0 2 > |εd |. If we use a restricted number of discretization\npoints, say, 5 points for each interval of Eq. (2.52), it gives reasonable results. However, if we increase the number of discretization points, the phase shift results of 4 S 3\n2\nstates, for example, deviate by more than several degrees. The origin of this pathological situation is the discretization points close to the logarithmic singularity in\nthe kernel Eq. (2.53). This is a notorious problem of moving singularities, appearing\nin any type of three-body model, that takes account of breakup processes. We avoid\nthis by using the prescription given by the Bochum-Krakow group,19)–22) namely,\napplying the spline interpolation even to the q degree of freedom. The main idea is\nthat by applying the spline interpolation to the logarithmic and step function terms\nin Eq. (2.53), we can avoid the situation wherein the discretization points directly\nhit the boundary of the crescent-shape region of the q-q ′ plane.\nA general prescription is given in §4 of Liu et al.'s paper.22) We first separate the\n′\n′\nq-q plane into two regions, one is the rectangular region with q < qp\nM and q < qM ,\n′\nand the other is the region with q > qM or q > qM . Here, qM = q0 2 − κd 2 (see\nEq. (2.52)). In the latter region, we can prove that x0 defined by x0 = x0 (q, q ′ ) =\n((3/4)qM 2 −q 2 −q ′ 2 )/(qq ′ ) is always less than −1, so that the unsubtracted expression\nin Eq. (2.53) is safely used. In the rectangular region, the subtraction is made in the\nfollowing scheme. First, let us consider the angular integral\nZ 1\nF (q, q ′ ; x)\n,\n(2.96)\nI(q, q ′ ) =\ndx\nx − x0 − i0\n−1\nfor q, q ′ ≤ qM . The kernel function F (q, q ′ ; x) is composed of the q, q ′ dependence from the spline interpolation for p and p′ , G(q, q ′ ; x), and the rearrangement\ncoefficients B(q, q ′ ; x):\n(2.97)\n\nF (q, q ′ ; x) = G(q, q ′ ; x) B(q, q ′ ; x) .\n\nMore explicitly, we move (1/pνμκ )λ and (1/pμνκ )λ factors in Eq. (2.41) to G(q, q ′ ; x),\nand assign\n′\n\nGi,j (qμ , qν ; xκ ) = Siνμκ\n\n1\nλ\n\nSjμνκ\n\n1\n\n(pνμκ )\n(pμνκ )λ\n1\nBγ,γ ′ (qμ , qν ; xκ ) = qμ qν gγ,γ ′ (qμ , qν ; xκ ) .\n2\n\n′\n\n,\n(2.98)\n\nThe function B(q, q ′ ; x) is expressed as a finite angular-momentum sum\nB(q, q ′ ; x) =\n\nkM\nX\n(2k + 1)B (k) (q, q ′ ) Pk (x) ,\nk=0\n\n(2.99)\n\n\f18\n\nY. Fujiwara and K. Fukukawa\n\nwith B (k) (q, q ′ ) being a polynomial of q and q ′ . We modify Eq. (2.96) to\nZ 1\nG(q, q ′ ; x) − G(q, q ′ ; x0 )\n′\nB(q, q ′ ; x)\ndx\nI(q, q ) =\nx − x0\n−1\nZ 1\nB(q, q ′ ; x)\n′\ndx\n+G(q, q ; x0 )\n.\nx − x0 − i0\n−1\n\n(2.100)\n\nThen, the second integral\nis expressed using the Legendre function of the second\nR1\nkind, Qk (z) ≡ (1/2) −1 dx Pk (x)/(z − x). Thus, we find\n′\n\nI(q, q ) =\n\nZ\n\n1\n\ndx\n\n−1\n\nG(q, q ′ ; x) − G(q, q ′ ; x0 )\nB(q, q ′ ; x)\nx − x0\n\nkM\nX\n+(−2) G(q, q ; x0 )\n(2k + 1)B (k) (q, q ′ ) Qk (x0 + i0) ,\n′\n\n(2.101)\n\nk=0\n\nwhere\nQk (x0 + i0) =\n\n\u0012\n\n1\n−\n2\n\n\u0015\n\u001b\n\u0013\u001a\n\u0014\n1 − x0\n+ iπθ(1 − |x0 |) + 2Wk−1 (x0 ) .\nPk (x0 ) log\n1 + x0\n(2.102)\n\nWe are interested in the integral\nZ qM\nZ\nI=\ndq\n0\n\nqM\n\ndq ′ f (q) I(q, q ′ ) g(q ′ ) ,\n\n(2.103)\n\n0\n\nwith the spline interpolation\nX\nf (q) =\nSμ (q)f (qμ )\nμ\n\nfor q ≤ qM\n\netc. ,\n\n(2.104)\n\nP\n\n√\ni.e., I = μ,ν fμ Iμ,ν gν with fμ = ωμ f (qμ ) etc. For the integrals to calculate Iμ,ν ,\nwe can replace the integral variables q and q ′ with qμ and qν safely if the variation\nof the functions is sufficiently smooth in the mesh-point intervals. Thus, we find\nZ qM\nZ qM\n1\ndq ′ Sμ (q) I(q, q ′ ) Sν (q ′ )\ndq\nIμ,ν = √ √\nωμ ων 0\n0\nZ 1\n√\nG(q\n√\nμ , qν ; x) − G(qμ , qν ; x0μν )\ndx\n= ωμ ων\nB(qμ , qν ; x)\nx − x0μν\n−1\nkM\n\nX\n√ √\ne kμν ,\n(2k + 1)B (k) (qμ , qν ) Q\n+ ωμ ων G(qμ , qν ; x0μν )\n\n(2.105)\n\nk=0\n\nwhere\n\ne kμν = (−2) 1\nQ\nωμ ων\n\nZ\n\n0\n\nqM\n\ndq\n\nZ\n\n0\n\nqM\n\ndq ′ Sμ (q)Qk (x0 + i0)Sν (q ′ ) .\n\n(2.106)\n\n\fQuark-Model Baryon-Baryon Interaction Applied to nd Scattering\n\n19\n\nUsing these results, we replace the subtracted expression of Aiμγ,νγ ′ in Eq. (2.53)\nwith\n\"\n\u0013 \u0012\n\u0013 ′#\n\u0012\nX\npνμκ λ pμνκ λ\n1\nAiμγ,jνγ ′ =\nBγμ,γ ′ ν,κ\nSiνμκ Sjμνκ − Siνμ0 Sjμν0\nxκ − x0μν\npνμ0\npμν0\nκ\neγμ,γ ′ ν ,\n+Siνμ0 Sjμν0 B\n\n(2.107)\n\neγμ,γ ′ ν is generated from Bγμ,γ ′ ν,0 by just modifying Pk (x0μν ) in gγ,γ ′ (qμ , qν ;\nwhere B\ne kμν in Eq. (2.106). Unfortunately, a complete analytical evaluation of Eq.\nx0μν ) to Q\n(2.106) is not possible. Here, we use the one-side spline interpolation formula and\ngive in Appendix B a detailed procedure to calculate\nZ qM\n1\nQkμν = (−2)\ndq ′ Qk (x0μ + i0)Sν (q ′ ) ,\n(2.108)\nων 0\nwith x0μ = ((3/4)qM 2 −qμ 2 −q ′2 )/(qμ q ′ ). Actually, this procedure breaks the symmee kμν with respect to the exchange of μ and ν. This generic inaccuracy of the\ntry of Q\nspline interpolation technique is, however, very small and we recover the symmetry\nof the S-matrix at the stage of calculating XlSc ,l′ Sc′ in Eq. (2.62), i.e., by modifying\nXlSc ,l′ Sc′ to (1/2)[XlSc ,l′ Sc′ + Xl′ Sc′ ,lSc ].∗)\n§3.\n\nResults and discussion\n\n3.1. Total cross sections\nFor the energies above the deuteron breakup threshold, we further separate the\nmomentum intervals over q in Eq. (2.52) into the following 6 intervals:\ni h√\ni\n√\n\u0002 1 \u0003 h1\n3\n3\n[qM , q0 ] [q0 , 2q0 ] [2q0 , ∞) ,\nq\n,\nq\nq\n,\nq\nqμ :\n0, 2 qM\n2 M 2 M\n2 M M\n(3.1)\n\np\nwhere qM = q0 2 − κd 2 . This is chosen from the criterion that the qμ points do not\nhit the positions of the logarithmic singularities and that sufficient points cover the\nrapidly changing region of the kernel in Eq. (2.107).∗∗) The first three intervals are\ndiscretized with the n1 -point Gauss-Legendre quadrature, and the next two intervals\nwith the n2 -point Gauss-Legendre quadrature. For the outermost interval [2q0 , ∞),\nwe apply a mapping qμ = 2q0 + tan {(π/4)(1 + xi )} with xi ∈ [−1, 1] (i = 1 - n3 )\nbeing the n3 -point Gauss-Legendre quadrature. We have altogether 3n1 + 2n2 + n3\nmesh points for the whole q. For the energies below the deuteron breakup threshold,\nwe actually use\n\u0003\n\u0002 1 \u0003 \u00021\n[q0 , 2q0 ] [2q0 , 3] [3, 6] [6, ∞) ,\n(3.2)\nqμ :\n0, 2 q0\n2 q0 , q0\n∗)\n\nVarious methods to symmetrize Qkμν cause a serious numerical problem at the point q =\n( 3/2)qM for the solution of Eq. (2.59).\n∗∗)\nIf we choose the interval [0, qM ] with the odd number of Gauss-Legendre quadrature mesh\npoints, the middle point hits the logarithmic singularity point (qM /2, qM /2). See Eq. (B.7).\n√\n\n\f20\n\nY. Fujiwara and K. Fukukawa\n\nwhere the unit is in fm−1 and q0 is the incident momentum of the neutron with\nE = (3~2 /4M )q0 2 + εd . Each interval is discretized with the n1 -n2 -n3 point GaussLegendre quadrature in a similar way. Since the maximum value of q0 is 0.267 fm−1 ,\n2q0 does not reach 3 fm−1 . For the bound-state problem of negative energies, we use\nqμ :\n\n[0, 0.2]\n\n[0.2, 0.5]\n\n[0.5, 1]\n\n[1, 3]\n\n[3, 6]\n\n[6, ∞) ,\n\n(3.3)\n\nalthough such structure in the small momentum region may not be necessary. For the\np mesh points, the previous four-interval separation for the bound state problem6)\npi :\n\n[0, 1]\n\n[1, 3]\n\n[3, 6]\n\n[6, ∞) ,\n\n(3.4)\n\nis used with the n2 -point (for the first three intervals) and n3 -point (for the outermost interval) Gauss-Legendre quadratures. Actual Faddeev calculations, however,\nare carried out using the discretization points only up to 6 fm−1 , to avoid the inaccuracy caused by the spline interpolation. The high-momentum p is, however, necessary\nfor the accurate evaluation of the off-shell t-matrix, so that another set of discretization points with 10+15 points is employed to calculate the t-matrix\nfor the positive\np\nenergies. The middle point is the on-shell momentum p0 = (3/4)(qM 2 − q0 2 ) in\nEq. (2.50), to which the Noyes-Kowalski formalism is again conveniently applied.\nFor the negative energies, the discretization points in Eq. (3.4) are directly used.\nWe also need to consider the discretization points for the angular-momentum\nprojection of the rearrangement coefficients in Eqs. (2.53) and (2.107). For energies\nbelow the breakup threshold, the previous 20-point Gauss-Legendre quadrature formula6) is safely used for the Legendre polynomials, since there is no singularity point\nfor the x integral. For the energies above the breakup threshold, the [−1, 1] interval\nfor x is separated into two parts, [−1, x0μν ] and [x0μν , 1]. For the larger interval, the\n15-point Gauss-Legendre formula is used, and for the smaller interval, the 5-point\nformula is used.\nThe three-body model space is mainly specified by the maximum value of the\ntwo-nucleon angular momentum Imax in Eq. (2.9). The maximum orbital angular\nmomentum for the two-nucleon subsystem is therefore λmax = Imax + 1. We need\nb,\nto take a sufficient number of the relative angular momentum l corresponding to q\nto reproduce the backward rise of the differential cross sections. Here, we assume\nlmax = Min{2λmax , 10}, which leads to the total angular momentum up to Jmax =\nlmax + (Sc )max ≤ 3λmax − 21 since (Sc )max = Imax + 12 = λmax − 21 . For the deuteron\nchannels, however, the maximum J value is much smaller and Jmax = lmax + 32 ≤\n2λmax + 23 = 2Imax + 72 . We also examine the model space composed of 3 S1 + 3 D1 plus\n1 S N N interactions only, which corresponds to the so-called five-channel calculation\n0\nof the J π = 12 + bound state. We call this the S + D model space. For example, the\nthree-body angular-momentum states in the deuteron channels are restricted up to\n4 G , 4 I , 4 K , and 4 M , for I\n15\n19\n23\n11\nmax = S + D, 2, 3, and 4, respectively, in the usual\n2\n2\n2\n2\nspectroscopic notation.\nThe elastic and breakup total cross sections up to En = 40 MeV, predicted\nusing fss2, are plotted in Fig. 1, together with the experimental data. Here, the\nincident neutron energy, En = (3/2)Ecm , is measured in the laboratory system. In\n\n\fQuark-Model Baryon-Baryon Interaction Applied to nd Scattering\n\n21\n\nthis calculation, we have used n ≡ n1 -n2 -n3 = 5-6-5 and Imax = 4. Although some\ndiscrepancy might exist around En = 10 MeV,21) the elastic and breakup total cross\nsections are reasonably reproduced with the constraint of the optical theorem.\n3.2. Differential cross sections\nThe differential cross sections for the nd elastic scattering are calculated from\nJ\n.\nthe scattering amplitudes f(l\n′ S ′ ),(lS ) in Eq. (2 92) by summing up over the final spin\nc\nc\nstates and by averaging over the initial spin states:\n1 XX\ndσ\nBL (Sc′ , Sc )PL (cos θ) ,\n=\ndΩ\n6 ′\nSc ,Sc L\nX\n′\n′\nBL (Sc , Sc ) = (−1)Sc −Sc\nZ(l′1 J1 l′2 J2 ; Sc′ L)Z(l1 J1 l2 J2 ; Sc L)\nJ1 J2 l1 l2 l′1 l′2\n∗ J2\nJ1\n×f(l\n′ S ′ ),(l S ) f(l′ S ′ ),(l S )\n2 c\n1 c\n2 c\n1 c\n\n(3.5)\n\n,\n\nwhere the rearrangement factor is given by the Wigner-Racah coefficients as37)\nZ(l1 J1 l2 J2 ; Sc L) = lb1 lb2 Jb1 Jb2 hl1 0l2 0|L0i W (l1 J1 l2 J2 ; Sc L) .\n\n(3.6)\n\nThe elastic total cross sections arePobtained from L = 0 components in Eq. (3.5) by\nJ\n2\nusing a special case B0 (Sc′ , Sc ) = Jll′ (2J + 1)|f(l\n′ S ′ ),(lS ) | . We find\nc\nc\n\nσel\n\nX\n4π X\n4π X\nJ\n2\n=\n(2J + 1)\n|f(l\nB0 (Sc′ , Sc ) =\n′ S ′ ),(lS ) | ,\nc\nc\n6 ′\n6\n′ ′\nSc ,Sc\n\n(lSc )J\n\n(3.7)\n\n(l Sc )\n\nFig. 1. fss2 predictions to the nd total cross sections up to En = 40 MeV, compared with the\nexperiment. The experimental data were taken from Ref. 32) for the filled circles with error\nbars and Refs. 33)–36) for the others.\n\n\f22\n\nY. Fujiwara and K. Fukukawa\n\nwhich is of course consistent with Eq. (2.94).\nWe show in Figs. 2 – 4 the nd elastic differential cross sections predicted using\nfss2 for the neutron incident energies from En = 1 to 65 MeV. Here, we have used\nImax = 4 and n = 5-6-5 to obtain the well-converged values except for En ≤ 2 MeV.\n(The difference between Imax = 2 and Imax = 4 is shown in the panel of En = 3\nMeV as an example.) These are compared with the nd data plotted with bars. The\nexperimental pd differential cross sections are also plotted with filled or open circles,\nunless otherwise specified. For the energies En = 1 and 2 MeV, we find that the nd\ndata and pd data are fairly different from each other, while this difference gradually\ndiminishes for the energies En ≥ 3 MeV except for the forward angles θcm ≤ 30◦ .\nWe can therefore compare our results with the pd experimental data except for\nthis angular region. We find a satisfactory agreement with the experimental data.\nIn particular, the agreement around En = 17 – 22.7 MeV is excellent, which is a\ncommon feature with the predictions using the meson-exchange potentials.21) For\nhigher energies En ≥ 35 MeV, we find that the forward differential cross sections are\nslightly overestimated in our model. It should be noted that in this energy region,\nmany partial waves contribute to Eq. (3.5), and yet the shape of the differential cross\nsections is rather simple owing to the strong cancellation. The cross section minima\n(diffraction minima) around θcm = 120 – 130◦ therefore afford a very crucial test\nof the two-nucleon interaction. We find that the minimum values of the differential\ncross sections have an opposite energy dependence to the one given by the standard\nmeson-exchange potentials. This energy dependence is very important to discuss the\neffect of the three-nucleon force for the meson-exchange potentials, which is generally\nknown as the Sagara discrepancy38) for the disagreement in the diffraction minima\nbetween experiment and theory.\nIn order to investigate the energy dependence of the diffraction minima in more\ndetail, we have to incorporate the Coulomb force in our calculation since the precise\ndata are only available for the pd scattering. Here, we estimate the Coulomb effect by\nusing the published results for the nd and pd cross sections in Ref. 48) for the AV18\npotential. Namely, we use the difference in the nd and pd cross section minima\nin Table II and add it to our calculated results for the nd scattering. The force\ndependence on the difference is considered to be rather small, since the Coulomb\nforce is a long-range force. Table I shows such a comparison with the experimental\npd data. We find that on the low-energy side with En ≤ 5 MeV, our estimated\nvalues reproduce the experimental data with an accuracy of less than 1 mb, while on\nthe high-energy side with En ≥ 35 MeV, our results are slightly overestimated. As\nfor the low-energy side, we will show in a separate paper that the doublet scattering\nlength 2 a of the low-energy nd scattering is also consistently reproduced by fss2.24), 26)\nThese results are in accordance with the bound-state calculation of the triton,6) in\nwhich fss2 predicts a nearly correct binding energy close to the experiment without\nintroducing the three-body force. In the high-energy region with En ≥ 35 MeV,\nit is reported that the Coulomb effect on the diffraction minima is rather small\nand the inclusion of the ∆ isobar gradually becomes more important to increase\nthem.49), 50) These observations imply a possibility that the rather large effect of the\nthree-body force, required for all the standard meson-exchange potentials, is related\n\n\fQuark-Model Baryon-Baryon Interaction Applied to nd Scattering\n\n23\n\nTable I. Comparison of the minimum values of the elastic differential cross sections with the experimental pd data after the Coulomb correction. The minimum value (dσ/dΩ)min (nd) at the\nminimum point θcm is calculated for the nd scattering at the neutron incident energy En . The\nCoulomb correction, [(pd) − (nd)]AV18 , for the difference between the nd and pd scattering is\nestimated from the results in Table II of Ref. 48) for the AV18 potential, and \"sum\" stands for\nour approximate prediction for the pd scattering after the Coulomb correction. The experimental data are taken from Refs. 38) and 48) for En ≤ 28 MeV, Ref. 46) for En = 35 and 46.3 MeV,\nand Ref. 47) for En = 65 MeV (exp: En = 64.8 MeV.)\nEn\n\nθcm\n\n(dσ/dΩ)min (nd)\n\n(MeV)\n\n(deg)\n\n(mb)\n\nsum\n\n(dσ/dΩ)exp\nmin (pd)\n\n(mb)\n\n(mb)\n\n(mb)\n170.2 ± 1.3\n\n[(pd) − (nd)]AV18\n\n1\n\n66\n\n142.8\n\n28.6\n\n171.4\n\n3\n\n103\n\n89.4\n\n3.3\n\n92.7\n\n5\n\n112\n\n50.3\n\n3.1\n\n53.4\n\n7\n\n116\n\n31.3\n\n2.4\n\n33.7\n\n9\n\n120\n\n20.3\n\n1.8\n\n22.1\n\n10\n\n121\n\n16.5\n\n1.6\n\n18.1\n\n12\n\n123\n\n11.3\n\n1.0\n\n12.3\n\n16\n\n125\n\n5.84\n\n0.5\n\n6.4\n\n18\n\n127\n\n4.47\n\n0.4\n\n4.9\n\n22.7\n\n128\n\n2.81\n\n0.1\n\n2.9\n\n0\n\n2.1\n\n28\n\n129\n\n2.06\n\n35\n\n131\n\n1.72\n\n46.3\n\n132\n\n1.43\n\n65\n\n133\n\n1.05\n\n91.1 ± 0.7\n\n52.7 ± 0.4\n\n32.9 ± 0.2\n\n21.8 ± 0.2\n\n18.0 ± 0.2\n\n12.2 ± 0.1\n6.2 ± 0.1\n\n4.7 ± 0.1\n\n2.89 ± 0.03\n\n2.19 ± 0.02\n\n1.52 ± 0.04\n\n1.28 ± 0.02\n\n0.873 ± 0.045\n\nto the local form of the strong repulsive core, introduced phenomenologically in the\nshort-range region. To confirm this, we need to investigate other 3N observables,\nincluding the spin polarization and the deuteron breakup processes. We have already\nobtained some good results, especially for the vector-analyzing power of the scattered\nneutron,23), 25) which we plan to report in a forthcoming paper.\n§4.\n\nSummary\n\nWe have applied our quark-model N N interaction fss2 to the neutron-deuteron\n(nd) scattering in the Faddeev formalism for systems of composite particles. The\nenergy dependence of the quark-model RGM\nkernel is eliminated by the standard\n√\noff-shell transformation utilizing the 1/ N factor, where N is the normalization\nkernel for the two three-quark clusters. This procedure yields an extra nonlocality, whose effect is very important to reproduce all the scattering observables below\nEn ≤ 65 MeV. In this paper, we have developed our basic formulation to solve the\nAlt-Grassberger-Sandhas (AGS) equations15) in the momentum representation, using the off-shell RGM t-matrix generated from the energy-independent renormalized\nRGM kernel. The Gaussian nonlocal potential constructed from the fss2 is used in\nthe isospin basis.16) The singularity of the N N t-matrix from the deuteron pole is\n\n\f24\n\nY. Fujiwara and K. Fukukawa\n\nhandled by the Noyes-Kowalski method.17), 18) Another notorious moving singularity\nof the free three-body Green function is treated by the standard spline interpolation technique developed by the Bochum-Krakow group.19)–22) Together with the\nresults in separate papers23)–26) discussing the low-energy effective range parameters and the elastic scattering observables, we have found many new features that\nseem to be related to the characteristic off-shell properties possessed by the quarkmodel baryon-baryon interaction. These include: 1) a large triton binding energy,\n2) reproduction of the doublet scattering length 2 a, 3) energy dependence of the\ndiffraction minima of the differential cross sections, and 4) maximum height of the\nnucleon-analyzing power Ay (θ) in the low-energy region En ≤ 25 MeV. Further investigations on the polarization observables and deuteron breakup processes will be\ndiscussed in forthcoming papers.\nAcknowledgements\nThe authors would like to thank Professor K. Miyagawa for giving them the main\nidea on how to apply the spline interpolation method to the moving singularities.\nThey are indebted to Professors H. Witala, H. Kamada, and S. Ishikawa for many\nuseful comments. They also thank Professor K. Sagara for providing them with\nthe pd experimental data obtained by the Kyushu university group. This work\nwas supported by a Grant-in-Aid for Scientific Research on Priority Areas (Grant\nNo. 20028003) and by a Grant-in-Aid for the Global COE Program \"The Next\nGeneration of Physics, Spun from Universality and Emergence\" from the Ministry\nof Education, Culture, Sports, Science and Technology (MEXT) of Japan. It was also\nsupported by the core-stage backup subsidies of Kyoto University. The numerical\ncalculations were carried out on Altix3700 BX2 at YITP in Kyoto University.\nAppendix A\nMethod to Calculate K(p, p′ )\nTo calculate W in Eq. (2.4), it is convenient to use the relationship\n\u0012\n\u0013\n1\n1\nW = Λ √ h √ − h Λ = Kh + hK + KhK ,\nN\nN\nwith\nK=Λ\n\n\u0012\n\n\u0013\n1\n√ −1 Λ ,\nN\n\n(A.1)\n\n(A.2)\n\nand calculate K(p, p′ ) in the momentum representation. Since the Born kernel of\nh = h0 + VD + G is already calculated, we can easily obtain W (p, p′ ) by just a simple\nnumerical integration. In principle, the kernel K is calculated from the power series\nexpansion in ΛKΛ as\nK=\n\n∞\nX\n(2r − 1)!!\nr=1\n\n(2r)!!\n\n(ΛKΛ)r ,\n\n(A.3)\n\n\fQuark-Model Baryon-Baryon Interaction Applied to nd Scattering\n\n25\n\nwhere the expansion formula\n√\n\n∞\n\nX (2r − 1)!!\n1\nxr\n−1=\n(2r)!!\n1−x\nr=1\n\nfor\n\n|x| < 1 ,\n\n(A.4)\n\nis used. In the following, we will show that the infinite sum in Eq. (A.3) is taken\nanalytically, by using the power-series property for the eigenvalues of the exchange\nnormalization kernel K.\nWe first consider, for simplicity, a single-channel system with only one quark\n(or nucleon) exchange and at most one Pauli-forbidden state. The Pauli projection\noperator is Λ = 1 − |u00 ihu00 | with u00 being the h.o. Pauli-forbidden state defined\nin Eq. (A.12) below. The normalization kernel in the Bargmann space is expressed\nas\n∗\n′\n∗\n′\nN = e z * z + XN e τ z * z ,\n\n(A.5)\n\nwhere XN is the spin-flavor (or spin-isospin) factor and τ is given by τ = 1−1/μ with\nμ being the reduced mass number. For the nα system, XN = −1 and τ = −1/4.\nFor the (3q)–(3q) system in the QM baryon-baryon interaction, XN is calculated\nnumerically and τ = 1/3. We also have to consider the core exchange term in this\ncase like in the αα system, which will be discussed later. In the h.o. basis, K is\nexpanded as\nX\n∗ ′\nK = −XN eτ z *z = (−XN )\n|N iτ N hN | ,\n(A.6)\nN\n\nwhere |N i is the h.o. states with the h.o. quanta N = (Nx , Ny , Nz ) and N = |N | =\nNx +Ny +Nz = 2n+l is the principal quantum number. The eigenvalue of K is given\nby γN = (−XN )τ N (= (−1/4)N for nα). The rth power of K is easily calculated as\nX\nr ∗ ′\n|N i(τ r )N hN |\nK r = (−XN )r eτ z *z = (−XN )r\nr\n\n= (−XN )\n\nX\n\nN lm\n\nN\n\nr N\n\n|N lmi(τ ) hN lm| .\n\n(A.7)\n\nThe kernel for (ΛKΛ)r can be obtained by restricting the sum in Eq. (A.7) over\nN ≥ 1.\nSuppose the spatial part of the GCM kernel for K is IN (z ; z ′ ) = eτ z∗ *z ′ . The\ncorresponding Born kernel is given by\n\u0012\n\u001a\n\u00133/2\n\u0012\n\u0013\u001b\n2π 1\n1 1−τ 2 1+τ 1 2\nMN (q f , q i ) =\nexp\n−\nq\n+\nk\nγ 1 − τ2\n2γ 1 + τ\n1−τ 4\n∞\nX\nbi )\n=\n(2l + 1)Ml (qf , qi )Pl (b\nqf * q\nl=0\n\n= 4π\n\nX\nlm\n\n∗\nMl (qf , qi )Ylm (b\nq f )Ylm\n(b\nqi) ,\n\n(A.8)\n\n\f26\n\nY. Fujiwara and K. Fukukawa\n\nwhere k = q f − q i , q = (q f + qi )/2, and γ = μν with ν being the h.o. width\nparameter of clusters.P (See Appendix A of Ref. 29).) Thus, for the partial wave\nN\ncomponent Klspace = ∞\nn=0 |N lmiτ hN lm| with N = 2n + l, we find\n\u0012\n\u001a\n\u00133/2\n\u001b \u0012\n\u0013\n\u0001\n2π 1\n1 + τ2 1\n1 τ\n′\n′\n2\n′2\nMl (q, q ; τ ) =\nexp −\nqq\nq +q\nil\nγ 1 − τ2\n1 − τ 2 4γ\nγ 1 − τ2\n\u0012\n\u0012\n\u00133/2\n\u0013\n\u0012 \u00133/2\n2\n1\n1\n1 τ\n1\n2π\n(q 2 +q ′2 )\n− τ 2 2γ\n(q 2 +q ′2 )\n− 4γ\n′\n1−τ\nil\ne\ne\nqq\n,\n(A.9)\n=\nγ\n1 − τ2\nγ 1 − τ2\nwhere il (x) is the imaginary spherical Bessel function. We use the notation\nil (x) = il jl (−ix) =\nFl (x) =\n\n∞\nX\n\nn=0\n\n=1+\n\nxl\nFl (x2 ) ,\n(2l + 1)!!\n\n(2l + 1)!!\nxn\n(2n)!!(2n + 2l + 1)!!\n1\n1\nx+\nx2 + * * * .\n2 * (2l + 3)\n2 * 4 * (2l + 3)(2l + 5)\n\nBy using this notation, Eq. (A.9) can be expressed as\n\u0012\n\u0013l+3/2\n2\n1\n1\n(q 2 +q ′2 )\n− τ 2 2γ\n1−τ\ne\nMl (q, q ′ ; τ ) = τ l u0l (q)u0l (q ′ )\n1 − τ2\n\u0012\n\u0013 !\nτ qq ′ 2\n×Fl\n,\n1 − τ2 γ\n\n(A.10)\n\n(A.11)\n\nwhere\nu0l (q) = u0l (q; γ) =\n\n\u0012\n\n2π\nγ\n\n\u00133/4\n\np\n\n1\n(2l + 1)!!\n\n\u0012\n\nq\n√\nγ\n\n\u0013l\n\n2\n\nq\n− 4γ\n\ne\n\n(A.12)\n\nis the h.o. wave function with l and the lowest h.o. quanta n = 0, normalized as\nZ ∞\n4π\nq 2 dq (u0l (q))2 = 1 .\n(A.13)\n(2π)3 0\nThus, we find\nKlr = (−XN )r\n\n∞\nX\n\n(τ r )2n+l unl (q)unl (q ′ ) = (−XN )r Ml (q, q ′ ; τ r ) .\n\n(A.14)\n\nn=0\n\nHere, we treat only the n = 0 term separately. Namely, by defining a new function\n\u0012\n\u0013l+3/2\n\u0013 !\n\u0012\n′ 2\nτ2\n1\n2\n′2\n1\nqq\nτ\n−\n(q +q )\nfl (q, q ′ ; τ ) =\nM\ne 1−τ 2 2γ\n− 1 , (A.15)\nFl\n1 − τ2\n1 − τ2 γ\n\nwe find\n\nh\ni\nfl (q, q ′ ; τ r ) .\nKlr = (−XN τ l )r u0l (q)u0l (q ′ ) 1 + M\n\n(A.16)\n\n\fQuark-Model Baryon-Baryon Interaction Applied to nd Scattering\n\n27\n\nThus, if there exists no Pauli-forbidden state, Λ = 1 and\n∞\n\nX (2r − 1)!!\n1\nKl = √ − 1 =\nKlr\n(2r)!!\nNl\nr=1\n=\n\n∞\nX\n(2r − 1)!!\nr=1\n\n(2r)!!\n\nh\ni\nfl (q, q ′ ; τ r ) .\n(−XN τ l )r u0l (q)u0l (q ′ ) 1 + M\n\n(A.17)\n\nFor the first term, we take the r sum with Eq. (A.4). Then, we eventually obtain\nKl (q, q ′ ) = u0l (q)u0l (q ′ )\n\"\n#\n∞\nX\n1\n(2r − 1)!!\nfl (q, q ′ ; τ r ) .\n× p\n−1+\n(−XN τ l )r M\n(2r)!!\n1 + XN τ l\nr=1\n\n(A.18)\n\nIf a Pauli-forbidden state exists only for (0s) with l = 0 (namely, 1 + XN = 0), we\nhave XN τ l = −1 and the first term of Eq. (A.17) should be omitted. Namely,\n′\n\nK0 (q, q ) =\n\n∞\nX\n(2r − 1)!!\nr=1\n\n(2r)!!\n\n′\n\n= u00 (q)u00 (q )\n\n(ΛKΛ)rl=0\n\n∞\nX\n(2r − 1)!!\n\n(2r)!!\n\nr=1\n\nf0 (q, q ′ ; τ r ) .\nM\n\n(A.19)\n\nfl (q, q ′ ; τ ) seems to be redundant since the\nFor l 6= 0, the subtraction of one in M\n(−1) term cancels with the first term in Eq. (A.16). However, the convergence of\np\n\n1\n\n1 + XN τ l\n\n−1=\n\n∞\nX\n(2r − 1)!! \u0010\nr=1\n\n(2r)!!\n\n−XN τ l\n\n\u0011r\n\n,\n\n(A.20)\n\nis very slow if (−XN τ l ) is close to 1. This happens in the P -wave case of the QM\nN N interaction. Namely, for the N N interaction, we find (see Table II of Ref. 51))\nstate\n3S\n\n1,\n\n1S\n\n0\n\nXN\n\nγN\n\n1\n9\n\n1 2n\n3\n\u0001\n7 1 2n+1\n3 3\n\u0001\n31 1 2n+1\n27 3\n\n1P\n1\n\n− 73\n\n3P\n1\n\n31\n− 27\n\n− 19\n\n\u0001\n\n−XN τ l\n− 19\n7\n9\n\n.\n\n(A.21)\n\n31\n81\n\nfl (q, q ′ ; τ ) is a function of τ 2 with M\nfl (q, q ′ ; 0) = 0. The leading\nOn the other hand, M\n2\nterm in the power series expansion of τ is\n\"\n\u0012 ′ \u00132 #\n\u0001\n3\n1\nqq\n1\nfl (q, q ′ ; τ ) = τ 2 l + −\nM\nq 2 + q ′2 +\n+ * * * . (A.22)\n2 2γ\n2(2l + 3) γ\n\nfl (q, q ′ ; τ ) = O(τ 2 ) and M\nfl (q, q ′ ; τ r ) = O(τ 2r ). Since τ 2 = 1/9 in\nThus, we have M\nthe above example, increasing r gives very fast convergence on the order of 1/10 for\n\n\f28\n\nY. Fujiwara and K. Fukukawa\n\nr = 1, 1/100 for r = 2, * * * . We take the r values up to rMax = 15 in the actual\ncalculation.\nIn the application to the (3q)–(3q) RGM kernel, we need a proper treatment of\nthe core exchange term and the coupled-channel problem. In the operator formalism\nof the spin-flavor factors, the basic (3q)–(3q) GCM normalization kernel is expressed\nas\n1 ∗\n∗\n′\n′\nB\nIN\n(z; z ′ ) = ez *z + XN e 3 z *z ,\n\n(A.23)\n\nby which the full normalization kernel is given by\n\u0003\n1\u0002 B\nB\nIN (z; z ′ ) − Pσ PF IN\n(z; −z ′ ) .\n2\n\nN (z; z ′ ) =\n\n(A.24)\n\nHere, PF is the flavor exchange operator. Thus, the exchange normalization kernel\nK is expressed as\n\u0011\n1 ∗\n1 ∗ ′\n1\u0010\n′\n(A.25)\nK(z; z ′ ) = − XN e 3 z *z − Pσ PF XN e− 3 z *z .\n2\n\nThe spin-flavor-color factor XN contains an explicit PF dependence, if the bra and\nket sides are composed of nonidentical baryons:\nXN = X d + X e Pσ PF .\n\n(A.26)\n\nThe exchange operator Pσ PF takes the value −(−1)l , where (−1)l is the parity of\nthe two-baryon system. Thus, XN has an explicit parity dependence\nl\nXN\n= X d − (−1)l X e ,\n\n(A.27)\n\nwhich is important in actual calculations. The partial-wave component Kl is then\ngiven by\n\u0012 \u0013N\nX\n1\nl\n|N li\nKl = −XN\nhN l| .\n(A.28)\n3\nN\n\nl , by assuming a fixed l. The eigenvalue\nFrom now on, we omit the superscript l in XN\nproblem of the multichannel Kl is reduced to the eigenvalue problem of the matrix\n(XN )αβ . We solve\nX\n(XN )αβ Cβλ = λCαλ ,\n(A.29)\nβ\n\nwith\nX\n\n′\n\nCαλ Cαλ = δλ,λ′ ,\n\nα\n\nX\n\nCαλ Cβλ = δα,β .\n\n(A.30)\n\n\u0012 \u0013N\n1\nhN l| .\n3\n\n(A.31)\n\nλ\n\nThen, the exchange norm kernel is given by\n(Kl )αβ = −\n\nX\nλ,N\n\nλCαλ Cβλ |N li\n\n\fQuark-Model Baryon-Baryon Interaction Applied to nd Scattering\n\n29\n\nThe full eigenvalue is γλN = −λ(1/3)N . Only the (0s) state is possible for the\nPauli-forbidden state in the isospin basis; i.e., the SU3 (11)s state:\n(ΛKl Λ)αβ =\n\n(−λ) Cαλ Cβλ |N li\n\nX\n\n(−λ)r Cαλ Cβλ |N li\n\nN\n\nλ( 13 ) 6=−1\n\n((ΛKl Λ)r )αβ =\n\nN\n\nλ( 31 ) 6=−1\n\n=\n\nX\n\nr\n\nCαλ Cβλ |N li\n\n(−λ)\n\nλN\n\n=\n\nX\nλN\n\n\u0012 \u0013N\n1\nhN l| ,\n3\n\nX\n\n\u0012 \u0013rN\n1\nhN l|\n3\n\n!\n\u0012 \u0013rN\n\u0001\n1\nhN l| − δl,0 Cα1 Cβ1 |00ih00|\n3\n\n(Klr )αβ − δl,0 Cα1 Cβ1 |00ih00| .\n\n(A.32)\n\nThe rest is almost the same as in the single-channel case. The final result is\n\n\n\nX\n\nq 1\n λ λ\n(Kl )αβ = u0l (q)u0l (q ′ ) \n\u0001l − 1 Cα Cβ\n1\nl\n1+λ 3\nλ( 31 ) 6=−1\n\u0012\n\u0012 \u0013r \u0013#\n\u0012 \u0013l !r\n∞\nX\n(2r − 1)!! X\n1\n1\nλ λ f\n′\n+\nCα Cβ Ml q, q ;\n.\n(A.33)\n−λ\n(2r)!!\n3\n3\nr=1\nλ\n\nAppendix B\nMethod to Calculate Qkμν in Eq. (2.108)\n\nWe first separate the integral region of Eq. (2.108) as\nQkμν\n\nκM Z q κ\n1 X\n= (−2)\ndq ′ Qk (x0μ + i0)Sν (q ′ ) ,\nων κ=1 qκ−1\n\n(B.1)\n\nwith q0 = 0 and qκM = qM , and apply the third-order spline function\nSν(κ) (q)\n\n=\n\n3\nX\n\nm=0\n\nακ(m)\n(q − qκ )m\nν\n\nfor q ∈ [qκ−1 , qκ ] .\n\n(B.2)\n\nThen, we find\nQkμν = (−2)\n\nκM X\n3\n1 X\nακ(m)\nQ(k)\nν\nmμ (qκ−1 , qκ ) ,\nων\n\n(B.3)\n\nκ=1 m=0\n\nwith\nQ(k)\nmμ (qκ−1 , qκ )\n\n=\n\nZ\n\nqκ\nqκ−1\n\ndq ′ Qk (x0μ + i0)(q ′ − qκ )m .\n\n(B.4)\n\n\f30\n\nY. Fujiwara and K. Fukukawa\n\nFor k = 0, a completely analytical calculation is possible by using the integral formula\nfor logarithmic functions\nZ\ndx log(x + q) = (x + q) [log(x + q) − 1] ,\n\u0014\n\u0015\nZ\n1\n1\nm+1\nm\nx\nlogx −\n,\n(B.5)\ndx x logx =\nm+1\nm+1\nand\n\u001a\nq′ − q\n1\nb−q\n′\nm\nm\ndq log ′\nIm (a, b; q) ≡\n(q − b) = (−1)\n(b − q)m+1 log\nq +q\nm+1\nb+q\na\n\u0012\n\u0013\n\u0002\n\u0003\n\u0002\n\u0003\nq+a\nq−a\nm+1\nm+1\nm+1\nm+1\n+ (b + q)\n− (b − q)\nlog\n+ (b − a)\n− (b − q)\nlog\nq+a\nq+b\n)\nm−1\nX 1 \u0002\n\u0003\n(B.6)\n(b + q)m−r − (b − q)m−r (b − a)r+1 ,\n+\nr+1\nZ\n\nb\n\n′\n\nr=0\n\nwith m = 0, 1, 2, * * * and 0 ≤ a ≤ b. We can prove that q ≥ 0 does not need to\nbe 0 ≤ a ≤ q ≤ b, but can also be at any position in the above form. The formula\nin Eq. (B.6) is free from the logarithmic singularities since limε→0 ε logε = 0. We\ndefine qμ -dependent variables, q1μ and q2μ , for the crescent-shape region:\n\nq\n√\n q1μ = 3 (qM 2 − qμ 2 ) − 1 qμ\n3\n4\n2\nq\nfor qμ <\nqM ,\n q = 3 (q 2 − q 2 ) + 1 q\n2\n2μ\n\n4\n\nM\n\nμ\n\n2 μ\n\n\nq\n q1μ = 1 qμ − 3 (qM 2 − qμ 2 )\n2\nq4\n q = 1 q + 3 (q 2 − q 2 )\n2μ\nμ\n2 μ\n4 M\n\nfor\n\n√\n3\nqM < qμ < qM .\n2\n\n(B.7)\n\nThen, we obtain\n\nQ(0)\nmμ (qκ−1 , qκ )\n\n=\n\n\u0012\n\n1\n−\n2\n\n\u0013\n\n[±Im (qκ−1 , qκ ; q1μ ) − Im (qκ−1 , qκ ; q2μ )\n(\n√\n3\nq\n<\nμ\nπ\n2 qM\n√\n,\n+iπIm\n(qκ−1 , qκ ; q1μ , q2μ )]\nfor\n3\n2 qM < qμ < qM\n\n(B.8)\n\nwhere the theta function part is given by\nπ\nIm\n(a, b; q1 , q2 ) =\n\nfor\n\ni\n1 h\n(Min{b, q2 } − b)m+1 − (Max{a, q1 } − b)m+1\nm+1\n\nMin {b, q2 } > Max {a, q1 } ,\n\notherwise 0 .\n(k)\n\n(B.9)\n\nWhen k ≥ 1, various methods are used to calculate Qmμ (qκ−1 , qκ ) in Eq. (B.4)\naccurately. First, the most accurate calculation outside the crescent area and its\n\n\fQuark-Model Baryon-Baryon Interaction Applied to nd Scattering\n\n31\n\nneighborhood is maybe the numerical integration using the power series expansion\nof Qk (x) in 1/x2 :\n\u0012 \u0013\n∞\n2k X (n + k)!(2n + k)! 1 n\nfor x > 1 .\n(B.10)\nQk (x) = k+1\n2\nx\nn!(2n\n+\n2k\n+\n1)!\nx\nn=0\nThe convergence is so rapid that we can use Eq. (B.10) for the numerical integration\n(k)\nof Qmμ (qκ−1 , qκ ) with x0μ (q ′ = qκ ) > 1.05 or x0μ (q ′ = qκ−1 ) < −1.05. We use the 20point Gauss-Legendre quadrature for the numerical integration. (Note that there is\nno imaginary part appearing in this case.) In the crescent area and its neighborhood,\nwe will expand Pk (x0μ ) and Wk−1 (x0μ ) in Eq. (2.102) around q ′ = qκ :\nPk (x0μ ) =\n\nm\nM\nX\n\nκ(m′ )\n\nβkμ\n\nm′ =0\nmM\nX\n\nWk−1 (x0μ ) =\n\nm′ =0\n\nW κ(m′ )\n\nβkμ\n\n′\n\n(q ′ − qκ )m ,\n′\n\n(B.11)\n\n(q ′ − qκ )m ,\n\nfor q ′ ∈ [qκ−1 , qκ ]. Then, we can use the formulas in Eqs. (B.6) and (B.9) to obtain\nQ(k)\nmμ (qκ−1 , qκ )\n\n=\n\n\u0012\n\n1\n−\n2\n\n\u0013 X\nmM n\nκ(m′ )\n[±Im+m′ (qκ−1 , qκ ; q1μ ) − Im+m′ (qκ−1 , qκ ; q2μ )\nβkμ\nm′ =0\n\no\n\u0003\nW κ(m′ ) π\nπ\n(q\n,\nq\n;\nq\n,\nq\n)\n,\nI\n+iπIm+m\n′\n′ (qκ−1 , qκ ; q1μ , q2μ ) + 2β\nκ−1\nκ\nκ−1\nκ\nm+m\nkμ\n\n(B.12)\n\n√\n√\nfor qμ < ( 3/2)qM and ( 3/2)qM < qμ < qM , respectively. The expansion coeffiκ(m′ )\netc. are expressed using Bell's polynomials:52)\ncients βkμ\nY0\nY1\nY2\nY3\nY4\n\n= f0\n= f1\n= f1\n= f1\n= f1\n\n,\ng1 ,\ng2 + f2 g1 2 ,\ng3 + f2 (3g2 g1 ) + f3 g1 3 ,\ng4 + f2 (4g3 g1 + 3g2 2 ) + f3 (6g2 g1 2 ) + f4 g1 4 , * * * ,\n\n(B.13)\n\nwhere the subscripts imply the higher derivatives. If we write Eq. (B.13) as Ym (f, g),\nκ(m)\nβkμ etc. are expressed as\nκ(m)\n\nβkμ\n\n=\n\nW κ(m)\n\nβkμ\n\n1\nYm (Pk (x0μκ ), gμκ ) ,\nm!\n1\n=\nYm (Wk−1 (x0μκ ), gμκ ) .\nm!\n\nThe higher derivatives of g = gμκ are given by\n\u0013\n\u0012\n1\nxμ\n2\n+\n, g2 = xμ 3 , * * * ,\ng1 = −\n2\nqκ\nqμ\nqκ\n\ngr = xμ (−1)r\n\n(B.14)\n\nr!\nqκ r+1\n\n, (B.15)\n\n\f32\n\nY. Fujiwara and K. Fukukawa\n\nwith xμ = ((3/4)qM 2 −qμ2 )/qμ . For the practical calculation, we first expand Pk (x0μ )\netc. around the middle point (qκ−1 + qκ )/2 and then rearrange it to the form of Eq.\n(B.11), by using mM = 3. Actually, Eq. (B.12) cannot be used if qκ is small. This is\nbecause the higher derivative of g in Eq. (B.15) becomes very large for the small qκ .\nThis method is not valid either when qμ is small and x0μκ rapidly changes from −1\nto 1. We therefore restrict the use of this method to the region with qμ > 0.6 fm−1\nand qκ > 0.6 fm−1 .\nThe third method to cover the above missing area is to use the separation of\nQk (x + i0) to the singular and nonsingular parts:\n\u0012 \u0013\nx\ne\nQk (x + i0) = Qk (x + i0) + Pk\nQ0 (x + i0) .\n(B.16)\n|x|\n\ne0 (x + i0) = 0 and the nonsingular function Q\ne k (x + i0) satisfies the same\nNote that Q\ne\ne k (x + i0)∗ for real x.\nsymmetry relation as Qk (x + i0), i.e., Qk (−x + i0) = (−1)k+1 Q\nWe calculate\nZ qκ\n(k)\ne k (x0μ + i0)(q ′ − qκ )m\ndq ′ Q\nQmμ (qκ−1 , qκ ) =\nqκ−1\n\u0012\n\u0013\nZ qκ\nx0μ\n′\ndq Pk\n+\nQ0 (x0μ + i0)(q ′ − qκ )m\n(B.17)\n|x\n|\n0μ\nqκ−1\nseparately. The numerical integration is used for the first integral since the integrand\nis nonsingular. However, if the interval [qκ−1 , qκ ] contains q1μ or q2μ , we separate\nthe integral region into two parts, [qκ−1 , q1μ ] and [q1μ , qκ ], etc. The second integral\nin Eq. (B.17) is reduced to the previous formula, resulting in\n\u0013\n\u0012\nZ qκ\nx0μ\n′\nQ0 (x0μ + i0)(q ′ − qκ )m\ndq Pk\n|x0μ |\nqκ−1\n\n(0)\n\nQmμ (qκ−1 , qκ )\nfor x0μκ > 0\n\n\n\n(0)\n,\n=\n(−1)k Qmμ (qκ−1 , qκ )\nfor x0μκ−1 < 0\n\n\n\n(0)\n (0)\nQmμ (qκ−1 , qκ ) + [(−1)k − 1] Qmμ (q0μ , qκ ) for x0μκ < 0 < x0μκ−1\n(B.18)\n√\n(0)\nfor qμ < ( 3/2)qM , where Qmμ (a, b) is obtained from Eq. (B.8) by replacing qκ−1\n.\nwith\np a and qκ with b. In the last√ term in Eq. (B 18), we have defined q0μ =\n2\n2\n(3/4)qM − qμ . In the case of ( 3/2)qM < qμ < qM , only the second case of\nEq. (B.18) is realized.\nReferences\n1)\n2)\n3)\n4)\n5)\n\nY. Fujiwara, Y. Suzuki and C. Nakamoto, Prog. Part. Nucl. Phys. 58 (2007), 439.\nS. Saito, S. Okai, R. Tamagaki and M. Yasuno, Prog. Theor. Phys. 50 (1973), 1561.\nS. Saito, Prog. Theor. Phys. Suppl. No. 62 (1977), 11.\nT. Fliessbach and H. Walliser, Nucl. Phys. A 377 (1982), 84.\nY. Suzuki, H. Matsumura, M. Orabi, Y. Fujiwara, P. Descouvemont, M. Theeten and D.\nBaye, Phys. Lett. B 659 (2008), 160.\n\n\fQuark-Model Baryon-Baryon Interaction Applied to nd Scattering\n\n33\n\n6) Y. Fujiwara, Y. Suzuki, M. Kohno and K. Miyagawa, Phys. Rev. C 66 (2002), 021001(R);\nibid. 70 (2004), 024001; 77 (2008), 027001.\n7) A. Nogga, H. Kamada and W. Glöckle, Phys. Rev. Lett. 85 (2000), 944.\n8) P. Doleschall, I. Borbély, Z. Papp and W. Plessas, Phys. Rev. C 67 (2003), 064005.\n9) M. Viviani, L. E. Marcucci, S. Rosati, A. Kievsky and L. Girlanda, Few-Body Systems 39\n(2006), 159.\n10) S. Takeuchi, T. Cheon and E. F. Redish, Phys. Lett. B 280 (1992), 175.\n11) P. Doleschall, Phys. Rev. C 77 (2008), 034002.\n12) Y. Fujiwara, H. Nemura, Y. Suzuki, K. Miyagawa and M. Kohno, Prog. Theor. Phys. 107\n(2002), 745.\n13) Y. Fujiwara, Y. Suzuki, K. Miyagawa, M. Kohno and H. Nemura, Prog. Theor. Phys. 107\n(2002), 993.\n14) Y. Fujiwara, M. Kohno and Y. Suzuki, Few-Body Systems 34 (2004), 237.\n15) E. O. Alt, P. Grassberger and W. Sandhas, Nucl. Phys. B 2 (1967), 167.\n16) K. Fukukawa, Y. Fujiwara and Y. Suzuki, Mod. Phys. Lett. A 24 (2009), 1035.\n17) H. P. Noyes, Phys. Rev. Lett. 15 (1965), 538.\n18) K. L. Kowalski, Phys. Rev. Lett. 15 (1965), 798; [Errata; 15 (1965), 908].\n19) W. Glöckle, G. Hasberg and A. R. Neghabian, Z. Phys. A 305 (1982), 217.\n20) H. Witala, Th. Cornelius and W. Glöckle, Few-Body Systems 3 (1988), 123.\n21) W. Glöckle, H. Witala, D. Hüber, H. Kamada and J. Golak, Phys. Rep. 274 (1996), 107.\n22) H. Liu, Ch. Elster and W. Glöckle, Phys. Rev. C 72 (2005), 054003.\n23) Y. Fujiwara and K. Fukukawa, EPJ Web of Conferences 3 (2010), 03029.\n24) K. Fukukawa and Y. Fujiwara, AIP Proc. 1235 (2010), 282; Mod. Phys. Lett. A 25 (2010),\n2006.\n25) Y. Fujiwara and K. Fukukawa, AIP Proc. 1235 (2010), 277: Mod. Phys. Lett. A 25 (2010),\n1759.\n26) K. Fukukawa and Y. Fujiwara, under preparation.\n27) Y. Fujiwara, T. Fujita, M. Kohno, C. Nakamoto and Y. Suzuki, Phys. Rev. C 65 (2002),\n014002.\n28) Y. Fujiwara, M. Kohno, C. Nakamoto and Y. Suzuki, Phys. Rev. C 64 (2001), 054001.\n29) Y. Fujiwara, M. Kohno, T. Fujita, C. Nakamoto and Y. Suzuki, Prog. Theor. Phys. 103\n(2000), 755.\n30) M. Kohno, Y. Fujiwara, T. Fujita, C. Nakamoto and Y. Suzuki, Nucl. Phys. A 674 (2000),\n229.\n31) Y. Fujiwara, M. Kohno, C. Nakamoto and Y. Suzuki, Prog. Theor. Phys. 104 (2000), 1025.\n32) P. Schwarz, H. O. Klages, P. Doll, B. Haesner, J. Wilczynski, B. Zeitnitz and J. Kecskemeti,\nNucl. Phys. A 398 (1983), 1.\n33) H. C. Catron, M. D. Goldberg, R. W. Hill, J. M. LeBlanc, J. P. Stoering, C. J. Taylor and\nM. A. Williamson, Phys. Rev. 123 (1961), 218.\n34) M. Holmberg, Nucl. Phys. A 129 (1969), 327.\n35) G. Pauletta and F. D. Brooks, Nucl. Phys. A 255 (1975), 267.\n36) J. D. Seagrave, J. C. Hopkins, D. R. Dixon, P. W. Keaton Jr., E. C. Kerr, A. Niiler, R.\nH. Sherman and R. K. Walter, Ann. of Phys. 74 (1972), 250.\n37) A. M. Lane and R. G. Thomas, Rev. Mod. Phys. 30 (1958), 257.\n38) K. Sagara, H. Oguri, S. Shimizu, K. Maeda, H. Nakamura, T. Nakashima and S. Morinobu,\nPhys. Rev. C 50 (1994), 576.\n39) A. J. Elwyn, R. O. Lane and A. Langsdorf Jr., Phys. Rev. 128 (1962), 779.\n40) D. C. Kocher and T. B. Clegg, Nucl. Phys. A 132 (1969), 455.\n41) W. Grüebler, V. König, P. A. Schmelzbach, F. Sperisen, B. Jenny, R. E. White, F. Seiler\nand H. W. Roser, Nucl. Phys. A 398 (1983), 445.\n42) S. Shirato and N. Koori, Nucl. Phys. A 120 (1968), 387.\n43) S. Kikuchi, J. Sanada, S. Suwa, I. Hayashi, K. Nisimura and K. Fukunaga,\nJ. Phys. Soc. Jpn. 15 (1960), 9.\n44) T. A. Cahill, J. Greenwood, H. Willmes and D. J. Shadoan, Phys. Rev. C 4 (1971), 1499.\n45) K. Hatanaka, N. Matsuoka, H. Sakai, T. Saito, K. Hosono, Y. Koike, M. Kondo, K. Imai,\nH. Shimizu, T. Ichihara, K. Nisimura and A. Okihana, Nucl. Phys. A 426 (1984), 77.\n46) S. N. Bunker, J. M. Cameron, R. F. Carlson, J. R. Richardson, P. Tomas, W. T. H. van\nOers and J. W. Verba, Nucl. Phys. A 113 (1968), 461.\n\n\f34\n\nY. Fujiwara and K. Fukukawa\n47) H. Shimizu, K. Imai, N. Tamura, K. Nisimura, K. Hatanaka, T. Saito, Y. Koike and Y.\nTaniguchi, Nucl. Phys. A 382 (1982), 242.\n48) A. Kievsky, M. Viviani and S. Rosati, Phys. Rev. C 64 (2001), 024002.\n49) A. Deltuva, R. Machleidt and P. U. Sauer, Phys. Rev. C 68 (2003), 024005.\n50) A. Deltuva, A. C. Fonseca and P. U. Sauer, Phys. Rev. C 71 (2005), 054005.\n51) C. Nakamoto, Y. Suzuki and Y. Fujiwara, Prog. Theor. Phys. 94 (1995), 65.\n52) E. T. Bell, Ann. Math. 35 (1934), 258.\n\n\fQuark-Model Baryon-Baryon Interaction Applied to nd Scattering\n\n35\n\nFig. 2. nd differential cross sections from En = 1 to 9 MeV, compared with the experiment. The\nexperimental data were taken from Refs. 39) for El62 (nd), 40) for Ko69 (pd), 38) for Sa94 (pd),\n32) for Sc83 (nd), and 36) for Se72 (nd).\n\n\f36\n\nY. Fujiwara and K. Fukukawa\n\nFig. 3. nd differential cross sections from En = 10 to 18 MeV, compared with the experiment. The\nexperimental data were taken from Refs. 41) for Gr83 (pd), 42) for Sh68 (nd), 43) for Ki60 (pd),\nand 44) for Ca71 (pd). The others are the same as in Fig. 2.\n\n\fQuark-Model Baryon-Baryon Interaction Applied to nd Scattering\n\n37\n\nFig. 4. nd differential cross sections from En = 20.5 to 65 MeV, compared with the experiment.\nThe experimental data were taken from Refs. 45) for Ha84 (pd), 46) for Bu68 (pd), and 47) for\nSh82 (pd). The others are the same as in Figs. 2 and 3.\n\n\f"}