{"id": "http://arxiv.org/abs/1111.6488v1", "guidislink": true, "updated": "2011-11-22T14:57:16Z", "updated_parsed": [2011, 11, 22, 14, 57, 16, 1, 326, 0], "published": "2011-11-22T14:57:16Z", "published_parsed": [2011, 11, 22, 14, 57, 16, 1, 326, 0], "title": "Neuroeconomics of suicide", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1111.2650%2C1111.0882%2C1111.5949%2C1111.6205%2C1111.5687%2C1111.0777%2C1111.5818%2C1111.5142%2C1111.2239%2C1111.1632%2C1111.0343%2C1111.4563%2C1111.6472%2C1111.2654%2C1111.1563%2C1111.5580%2C1111.1783%2C1111.2930%2C1111.3543%2C1111.4911%2C1111.0150%2C1111.5860%2C1111.2374%2C1111.0757%2C1111.4495%2C1111.4553%2C1111.2872%2C1111.0677%2C1111.5512%2C1111.5131%2C1111.3052%2C1111.0415%2C1111.4655%2C1111.0211%2C1111.4395%2C1111.2396%2C1111.0695%2C1111.4420%2C1111.0248%2C1111.4059%2C1111.2132%2C1111.0374%2C1111.3330%2C1111.4508%2C1111.1573%2C1111.0633%2C1111.4467%2C1111.4817%2C1111.3532%2C1111.4795%2C1111.1993%2C1111.5881%2C1111.5784%2C1111.2030%2C1111.4648%2C1111.6226%2C1111.5186%2C1111.0654%2C1111.6656%2C1111.1293%2C1111.6288%2C1111.5528%2C1111.4601%2C1111.1625%2C1111.5127%2C1111.2475%2C1111.2864%2C1111.4897%2C1111.5379%2C1111.0414%2C1111.5016%2C1111.5271%2C1111.3002%2C1111.1132%2C1111.7081%2C1111.2963%2C1111.4167%2C1111.4381%2C1111.2107%2C1111.4355%2C1111.0071%2C1111.3381%2C1111.0600%2C1111.4336%2C1111.4448%2C1111.4444%2C1111.0625%2C1111.1501%2C1111.4742%2C1111.3901%2C1111.7174%2C1111.4892%2C1111.6488%2C1111.4130%2C1111.3288%2C1111.1101%2C1111.6619%2C1111.1728%2C1111.3210%2C1111.2941%2C1111.5282&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Neuroeconomics of suicide"}, "summary": "Suicidal behavior is a leading cause of injury and death worldwide. Suicide\nhas been associated with psychiatric illnesses such as depression and\nschizophrenia, as well as economic uncertainty, and social/cultural factors.\nThis study proposes a neuroeconomic framework of suicide. Neuroeconomic\nparameters (e.g., risk-attitude, probability weighting, time discounting in\nintertemporal choice, and loss aversion) are predicted to be related to\nsuicidal behavior. Neurobiological and neuroendocrinological substrates such as\nserotonin, dopamine, cortisol (HPA axis), nitric oxide, serum cholesterol,\nepinephrine, norepinephrine, gonadal hormones (e.g., estradiol and\nprogesterone), dehydroepiandrosterone (DHEA) in brain regions such as the\norbitofrontal/dorsolateral prefrontal cortex and limbic regions (e.g., the\namygdala) may supposedly be related to the neuroeconomic parameters modulating\nthe risk of suicide. The present framework puts foundations for \"molecular\nneuroeconomics\" of decision-making processes underlying suicidal behavior.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1111.2650%2C1111.0882%2C1111.5949%2C1111.6205%2C1111.5687%2C1111.0777%2C1111.5818%2C1111.5142%2C1111.2239%2C1111.1632%2C1111.0343%2C1111.4563%2C1111.6472%2C1111.2654%2C1111.1563%2C1111.5580%2C1111.1783%2C1111.2930%2C1111.3543%2C1111.4911%2C1111.0150%2C1111.5860%2C1111.2374%2C1111.0757%2C1111.4495%2C1111.4553%2C1111.2872%2C1111.0677%2C1111.5512%2C1111.5131%2C1111.3052%2C1111.0415%2C1111.4655%2C1111.0211%2C1111.4395%2C1111.2396%2C1111.0695%2C1111.4420%2C1111.0248%2C1111.4059%2C1111.2132%2C1111.0374%2C1111.3330%2C1111.4508%2C1111.1573%2C1111.0633%2C1111.4467%2C1111.4817%2C1111.3532%2C1111.4795%2C1111.1993%2C1111.5881%2C1111.5784%2C1111.2030%2C1111.4648%2C1111.6226%2C1111.5186%2C1111.0654%2C1111.6656%2C1111.1293%2C1111.6288%2C1111.5528%2C1111.4601%2C1111.1625%2C1111.5127%2C1111.2475%2C1111.2864%2C1111.4897%2C1111.5379%2C1111.0414%2C1111.5016%2C1111.5271%2C1111.3002%2C1111.1132%2C1111.7081%2C1111.2963%2C1111.4167%2C1111.4381%2C1111.2107%2C1111.4355%2C1111.0071%2C1111.3381%2C1111.0600%2C1111.4336%2C1111.4448%2C1111.4444%2C1111.0625%2C1111.1501%2C1111.4742%2C1111.3901%2C1111.7174%2C1111.4892%2C1111.6488%2C1111.4130%2C1111.3288%2C1111.1101%2C1111.6619%2C1111.1728%2C1111.3210%2C1111.2941%2C1111.5282&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Suicidal behavior is a leading cause of injury and death worldwide. Suicide\nhas been associated with psychiatric illnesses such as depression and\nschizophrenia, as well as economic uncertainty, and social/cultural factors.\nThis study proposes a neuroeconomic framework of suicide. Neuroeconomic\nparameters (e.g., risk-attitude, probability weighting, time discounting in\nintertemporal choice, and loss aversion) are predicted to be related to\nsuicidal behavior. Neurobiological and neuroendocrinological substrates such as\nserotonin, dopamine, cortisol (HPA axis), nitric oxide, serum cholesterol,\nepinephrine, norepinephrine, gonadal hormones (e.g., estradiol and\nprogesterone), dehydroepiandrosterone (DHEA) in brain regions such as the\norbitofrontal/dorsolateral prefrontal cortex and limbic regions (e.g., the\namygdala) may supposedly be related to the neuroeconomic parameters modulating\nthe risk of suicide. The present framework puts foundations for \"molecular\nneuroeconomics\" of decision-making processes underlying suicidal behavior."}, "authors": ["Taiki Takahashi"], "author_detail": {"name": "Taiki Takahashi"}, "author": "Taiki Takahashi", "arxiv_comment": "14 pages nofigure", "links": [{"href": "http://arxiv.org/abs/1111.6488v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1111.6488v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "q-bio.NC", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "q-bio.NC", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "q-bio.OT", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1111.6488v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1111.6488v1", "journal_reference": "Neuro Endocrinol Lett. 2011;32(4):400-404", "doi": null, "fulltext": "[NeuroEndocrinology Letters 2011\nhttp://node.nel.edu/?node_id=11772 ]\n\nNeuroeconomics of suicide.\nTaiki Takahashi1\n\n1\n\nDepartment of Behavioral Science, Hokkaido University\n\nCorresponding Author: Taiki Takahashi\nEmail: taikitakahashi@gmail.com\nDepartment of Behavioral Science, Hokkaido University\nN.10, W.7, Kita-ku, Sapporo, 060-0810, Japan\nTEL: +81-11-706-3057\n\nFAX: +81-11-706-3066\n\nAcknowledgements: The research reported in this paper was supported by a grant\nfrom the Grant- in-Aid for Scientific Research (―global center of excellence‖ grant)\nfrom the Ministry of Education, Culture, Sports, Science and Technology of Japan.\n\n\fSummary:\n\nSuicidal behavior is a leading cause of injury and death worldwide. Suicide has been\nassociated with psychiatric illnesses such as depression and schizophrenia, as well as\neconomic uncertainty, and social/cultural factors. This study proposes a neuroeconomic\nframework of suicide. Neuroeconomic parameters (e.g., risk-attitude, probability\nweighting, time discounting in intertemporal choice, and loss aversion) are predicted to\nbe related to suicidal behavior. Neurobiological and neuroendocrinological substrates\nsuch as serotonin, dopamine, cortisol (HPA axis), nitric oxide, serum cholesterol,\nepinephrine, norepinephrine, gonadal hormones (e.g., estradiol and progesterone),\ndehydroepiandrosterone (DHEA) in brain regions such as the orbitofrontal/dorsolateral\nprefrontal cortex and limbic regions (e.g., the amygdala) may supposedly be related to\nthe neuroeconomic parameters modulating the risk of suicide. The present framework\nputs foundations for ―molecular neuroeconomics‖ of decision-making processes\nunderlying suicidal behavior.\nKeywords: Suicide, Neuroeconomics, risk, intertemporal choice, discounting\n\n\f1. Introduction:\nAs the global annual rate of suicide approximates 15 per 100,000 individuals, it is\nestimated that one million people worldwide commit suicide each year. Annual rates of\nnon-fatal suicidal behaviour are 10–20 times higher than those of completed suicide\n(Kerkhof, 2000). Suicidal behavior thus constitutes a major public health problem. This\nindicates the necessity of effective theoretical frameworks for suicide prevention.\nDuring the past 30 years, economists have contributed insights about the economic\nmotivations underlying suicidal behavior. Hamermesh and Soss (1974) formalized a\nmodel of the utility maximization decision faced by those contemplating suicide. Their\npaper, and subsequent work by economists, developed the notion that suicide occurs\nwhen the temporally-discounted stream of expected utility (subjective well-being) over\na person's lifetime is sufficiently low, perhaps negative, by assuming the subject's\ndecision-making is rational. However, recent studies in behavioral economics and\nneuroeconomics revealed that people are irrational in terms of economic theory.\nTherefore, introducing neuroeconomic frameworks is important for a better\nunderstanding of suicidal behavior. Also, recent neurobiological studies on suicidal\nbehavior demonstrated that several neurobiological substrates such as serotonin,\ndopamine, and neuroactive steroid hormones in the brain regions such as the prefrontal\ncortex and the limbic structures are important determinants of suicidal behavior.\nTherefore, combining neuroeconomic theory with these neurobiological finding is\nnecessary to establish molecular neurobiological theory of suicidal behavior\n(―molecular neuroeconomics‖ of suicide).\nThis paper is organized in the following manner. In Section 2, I briefly\nintroduce neuroeconomic theory of decision under risk and over time, and economic\ntheory of suicidal behavior. In Section 3, findings in neurobiology regarding the\nmolecular mechanisms of suicidal behavior are briefly reviewed. In Section 4, I\nproposed several predictions from molecular neuroeconomic theory of suicidal behavior.\nSome conclusions from this study and future study directions by utilizing the present\nmolecular neuroeconomic theory, and how to test the present theory experimentally in\nfuture neuroeconomic studies are also discussed.\n2. Neuroeconomic theory of risky and impulsive decision making\n2.1 Decision under risk\nIn behavioral economics, decision under risk is formulated with Kahneman-Tversky's\nprospect theory (Kahneman and Tversky, 1979). In prospect theory, a subjective value\nof an uncertain outcome x which is received at the probability of p is v(x) w( p) , where\n\n\fv(x) is a value function and w( p) is a probability weighting function. The prospect\n\ntheory's value function is assumed to be concave for gains, convex for losses, and\nsteeper for losses than for gains. The most popular parametrization of the value function\nis a power function (Tversky and Kahneman, 1992):\n\n\n x ( x  0)\nv( x)  \n\n\n  ( x) ( x  0)\n\n(1)\n\nwhere α, β > 0 measure the curvature of the value function for gains and losses, and λ is\nthe coefficient of loss aversion. A recent neuroeconomic study demonstrated that\namygdale damage reduced loss aversion (De Martino et al., 2010). The probability\nweighting function has been parametrized as (Prelec, 1998; Takahashi, 2011):\n(2)\nw( p)  exp[ ( ln p) s ]\nwhere s indicates a distortion in subjective probability (note that s=1 corresponds to\nlinear probability weighting), which has been shown to associate with the anterior\ncingulate activity (Paulus and Frank, 2006)\nIn economic theory of suicidal behavior, income uncertainty and the costs of\nmaintaining oneself alive have been associated with suicide (Hamermesh and Soss,\n1974; Marcotte, 2003; Suzuki, 2008), implying that subjects with strong loss aversion\nand risk aversion are more likely to commit suicide (Yamawaki et al., 2005). Hence, it\ncan be supposed that smaller α <1 (i.e., strong risk aversion in gain), larger λ (i.e.,\nstrong loss aversion) and s may be associated with suicidal behavior. The contribution\nof parameter β which determines risk-attitude in loss should also be examined, because\nJollant et al., (2010) reported that suicidal behavior is associated with disadvantageous\ndecision-making in a gambling task involving loss and a decreased activation in the\norbitofrontal cortex (Jollant et al., 2010).\n2.2 Decision over time (intertemporal choice)\nIn order to describe impulsivity and irrationality in temporal discounting, the\nq-exponential time-discount model for delayed rewards has been introduced and\nexperimentally examined (Cajueiro, 2006; Takahashi, 2007; Takahashi et al., 2007a;\nTakahashi et al., 2008ab; Takahashi, 2009):\nVq+(D)= Vq+ (0)/ expq+(kq+D)= Vq+ (0)/[1+(1-q+)kq+D]1/(1-q+)\n\n(3)\n\nwhere Vq+(D) is the subjective value of a reward obtained at delay D, q+ is a parameter\nindicating irrationality in temporal discounting for gain (smaller q+<1 values\ncorrespond to more irrational discounting for delayed gains), and kq+ is a parameter of\n\n\fimpulsivity regarding the reward at delay D=0 (q-exponential discount rate at delay\nD=0). Note that when q+=0, equation 3 is the same as a hyperbolic discount function,\nwhile q+→1, is the same as an exponential discount function (Cajueiro, 2006;\nTakahashi, 2009). Kable and Glimcher (2007) reported that Vq+(D) is\nneurally-represented in brain regions such as the striatum.\nFurthermore, it is known that delayed gains and losses are distinctly processed\nin the brain and loss is less steeply temporally-discounted than gains, which is referred\nto as the ―sign effect‖ (Xu et al., 2009). Therefore, we should prepare the q-exponential\ndiscount function for delayed loss:\nVq-(D)= Vq- (0)/ expq-(kq-D)= Vq- (0)/[1+(1-q-)kq-D]1/(1-q-)\n\n(4)\n\nwhere Vq-(D) >0 is the (absolute, unsigned) subjective value (subjective magnitude) of a\nloss at delay D (note that Vq-(D=0) = λVq+(D=0), from equation 1), q- is a parameter\nindicating irrationality in temporal discounting for loss (smaller q-<1 values correspond\nto more irrational discounting for delayed losses), and kq- is a parameter of impulsivity\nregarding the loss (i.e., degree of procrastination) at delay D=0. Our previous study\n(Takahashi et al., 2008b) demonstrated that depressive patients are more irrational in\nintertemporal choices for gain and loss than healthy controls. Also, a recent study\nreported that impulsive suicide attempters discount delayed rewards steeply\n(Dombrovski et al., 2011). These findings indicate that irrational suicidal behavior may\nbe associated with large k values and smaller q values across gain and loss. However, a\ndeliberate, forward-looking suicide attempt may be associated with less steeper\ntemporal discounting, because the weight of future loss is significant for a subject with\nsmaller kq-. Dombrovski and colleagues (2011) reported non-impulsive (planned) suicide\nattempts were associated with smaller time-discount rate (―lethal foresight‖), supporting\nthis speculation. Tellingly, anhedonia was found to be related to slow temporal\ndiscounting behavior (Lempert and Pizzagalli, 2010), also consistent with this\nprediction.\n3 Neurobiological substrates of suicidal behavior\n3.1 Brain regions related to suicidal behavior\nSuicide has been associated with psychiatric illnesses such as depression and\nschizophrenia. Regarding neuroanatomy, abnormalities in white matter and limbic gray\nmatter appear to be associated with the occurrence of suicide attempts (van Heeringen et\nal., 2011). The orbitofrontal cortex, the cingulate cortex and the inferior parietal lobule\n\n\fmay be involved in response inhibition, disadvantageous decision-making in a gambling\ntask, and suicide attempts (Jollant et al., 2010; van Heeringen et al., 2011). Serotonergic\nfunctioning in the dorsolateral prefrontal cortex correlates significantly with levels of\nhopelessness, a strong clinical predictor of suicidal behaviour (van Heeringen et al.,\n2003). The right amygdala hypertrophy may be a risk factor for suicide attempts\n(Spoletini et al., 2011). The left anterior limb of the internal capsule was further\nassociated with suicidal behavior (Jia et al., 2010).\n3.2 Serotonin and dopamine\nThe serotonergic system has been the most widely investigated neuromodulatory system\nin studies of suicide attempters and completers (Yanagi et al., 2005). CSF-5HIAA was\ncorrelated with depression and suicidal behavior (Asberg et al., 1976), although\ntryptophan hydroxylase isoform 2 gene is not related to suicide in Japanese population\n(Mouri et al., 2009). Our previous study (Takahashi et al., 2008b) reported that\ndepression is associated with steep temporal discounting in the near future, in line with\nthe finding. Also, taking SSRI (selective serotonin reuptake inhibitor) has been\nassociated with suicidal behavior (Dudley et al., 2010). Furthermore, mesolimbic\ndopaminergic transmission has been hypothesized to be reduced in depression and\nsuicide (Bowden et al., 1997). Suda et al. (2009) reported dopamine D2 receptor is\nassociated with suicide. Zhong et al., (2009) reported that serotonin and dopamine\ndetermine the shape of the value function in Kahneman-Tversky's prospect theory\n(equation 1); i.e., risk aversion and loss aversion. Furthermore, both serotonin and\ndopamine regulate temporal discounting (Takahashi, 2009). Therefore, involvement of\nserotonergic and dopaminergic systems in suicide should more extensively been studied\nby employing neuroeconomic frameworks in future studies. Also, nitric oxide is\ninvolved in synaptic neurotransmission and associated with suicide (Cui et al., 2010).\nIga et al., (2007) demonstrated that BDNF (brain-derived neurotrophic factor) is\nassociated with suicidal behavior. Therefore, the relation between synaptic\nneurotransmission and suicide should be examined.\n3.3 Epinephrine and norepinephrine\nAdrenaline (epinephrine) is synthesized from tyrosine and phenylalanine in both the\nadrenal gland and the brain, and is considered both a hormone and a neurotransmitter.\nAdrenaline is an activator molecule well known to induce several physiological effects\n(e.g., increased heart rate) and general cognitive enhancement (e.g., increased awareness\nand attention). Meana et al., (1992) reported an increase in alpha 2-adrenoceptors in the\nhypothalamus and frontal cortex in suicide victims. Consistent with the report, our\nprevious study (Takahashi et al., 2007b; Takahashi et al., 2010) demonstrated that high\n\n\flevel of noradrenergic activity is related to slow temporal discounting, which may result\nin an increase in the rate of deliberate suicide attempts (i.e., ―lethal foresight‖,\nDombrovski et al., 2010).\n3.4 Neuroactive steroid hormones\nThe hypothalamic–pituitary–adrenal (HPA) axis is the major biological infrastructure of\nthe human stress system with interconnections between the structures by the hormones\nCRH, ACTH, and cortisol (a type of glucocorticoids). The abnormalities in HPA may be\nrelated to suicide (Kunugi et al., 2004). The expression regulation of the hippocampal\nglucocorticoid receptor, a key component of the HPA axis, is decreased primarily among\nsuicides (McGowan et al., 2009). Supriyanto et al., (2011) reported a genotype of\nFK506 binding protein 5 is associated with suicidal behavior. Butterfield et al. (2005)\nreported that patients who had attempted suicide demonstrated significantly higher\nDHEA levels than those who had not attempted suicide, indicating the involvement of\nDHEA in suicidal behavior. Regarding gonadal steroids, low estradiol and progesterone\nlevels were observed to associate with suicidal behavior in women (Baca-Garcia et al.,\n2010). Our previous studies demonstrated that stress hormones modulate temporal\ndiscounting behavior (Takahashi, 2004; Takahashi et al., 2010). In males, testosterone is\nalso associated with temporal discounting (Takahashi et al., 2006). Therefore future\nstudies should investigate how these steroid hormones modulate neuroeconomic\nparameters, resulting in an exaggerated suicide rate. Furthermore, low serum cholesterol\nis associated with suicidal behavior (Kunugi et al., 1997).\n4. Implications for neuroeconomics and neurobiolgy of suicidal behavior\nThis study is the first to present a possible unified framework for molecular\nneuroeconomic theory of suicide. Our theoretical considerations lead us to the following\npredictions: (a) neurobiological substrates/alterations which increase loss aversion (λ in\nequation 1) may increase suicide rates, (b) neurobiological substrates/alterations which\nincrease risk aversion (i.e., decrease α<1 in equation 1) may increase suicide rates, (c)\nneurobiological substrates/alterations which increase time-discount rate (k parameters in\nequation 3 and 4) and time-inconsistency (i.e., decrease q parameters < 1 in equation 3\nand 4) in intertemporal choice may increase impulsive suicide attempts, (d)\nneurobiological substrates/alterations which decrease time-discount rate (k parameters\nin equation 3 and 4) may increase deliberate, non-impulsive suicide attempt (―lethal\nforesight‖). Moreover, because suicide attempts are associated with disadvantageous\ndecision-making in the gambling task involving loss (Jollant et al., 2010), it can be\npredicted that (e) neurobiological substrates/alterations which decrease risk aversion in\n\n\floss may increase the risk of suicidal behavior. Future neuroeconomic studies should\ninvestigate whether these predictions (a)-(e) are correct or not, at the molecular and\nneuronal level, in addition to the neuroanatomical level. Neuropsychopharmacological\ntreatments may especially be useful for the future investigations. Furthermore, some\neconomic theories incorporated social psychological and cultural factors such as self\nidentity and habit (Becker and Murphy, 2003; Akerlof and Kranton, 2000). These\nfactors, which may be important for a better understanding of suicidal behavior\n(Sakamoto et al., 2006), should be incorporated into neuroeconomic theory of suicide.\n\n\fReferences\nAkerlof GA, Kranton RE (2000) Economics and identity Quarterly Journal of\nEconomics 115, 715-775\nAsberg, M. Thoren, P. Traskman, L. Bertilsson L. and Ringberger, V. (1976) Serotonin\ndepression‖-a biochemical subgroup within the affective disorders?, Science 191,\n478–480.\nBaca-Garcia E, Diaz-Sastre C, Ceverino A, Perez-Rodriguez MM, Navarro-Jimenez R,\nLopez-Castroman J, Saiz-Ruiz J, de Leon J, Oquendo MA. (2010) Suicide attempts\namong women during low estradiol/low progesterone states. J Psychiatr Res. 44,\n209-214.\nBecker G. S. and Murphy K. A. Social Economics: Market Behavior in a Social\nEnvironment. Belknap Press of Harvard University Press (February 28, 2003)\nBowden, C. Theodorou, A. E. Cheetham, S. C. Lowther, S. Katona, C. L. Crompton M.\nR. and Horton, R.W. (1997) Dopamine D1 and D2 receptor binding sites in brain\nsamples from depressed suicides and controls, Brain Res. 752, 227–233.\nButterfield M. I., Stechuchak K. M., Connor K. M., Davidson J. R., Wang C., MacKuen\nC. L., Pearlstein A. M., Marx C. E. Neuroactive steroids and suicidality in posttraumatic\nstress disorder. Am J Psychiatry. 2005 162, 380-382.\nCajueiro D.O. A note on the relevance of the q-exponential function in the context of\nintertemporal choices. Physica A 364 (2006) 385–388.\nCui H, Supriyanto I, Asano M, Ueno Y, Nagasaki Y, Nishiguchi N, Shirakawa O,\nHishimoto A. (2010) A common polymorphism in the 3'-UTR of the NOS1 gene was\nassociated with completed suicides in Japanese male population. Prog\nNeuropsychopharmacol Biol Psychiatry. 34, 992-996.\nDe Martino B, Camerer CF, Adolphs R. Amygdala damage eliminates monetary loss\naversion. Proc Natl Acad Sci U S A. 107, 3788-3792.\n\n\fDombrovski AY, Szanto K, Siegle GJ, Wallace ML, Forman SD, Sahakian B, Reynolds\nCF 3rd, Clark L. (2011) Lethal Forethought: Delayed Reward Discounting\nDifferentiates High- and Low-Lethality Suicide Attempts in Old Age. Biological\nPsychiatry (in press)\nDudley M, Goldney R, Hadzi-Pavlovic D. (2010) Are adolescents dying by suicide\ntaking SSRI antidepressants? A review of observational studies. Australas Psychiatry.\n18, 242-245.\nHamermesh, D.S., and Soss. N.M. (1974) ―An Economic Theory of Suicide,‖ Journal\nof Political Economy, pp. 83-98.\nIga J, Ueno S, Yamauchi K, Numata S, Tayoshi-Shibuya S, Kinouchi S, Nakataki M,\nSong H, Hokoishi K, Tanabe H, Sano A, Ohmori T. (2007) The Val66Met\npolymorphism of the brain-derived neurotrophic factor gene is associated with\npsychotic feature and suicidal behavior in Japanese major depressive patients. Am J\nMed Genet B Neuropsychiatr Genet. 144, 1003-1006.\nJia Z, Huang X, Wu Q, Zhang T, Lui S, Zhang J, Amatya N, Kuang W, Chan RC, Kemp\nGJ, Mechelli A, Gong Q. (2010) High-field magnetic resonance imaging of suicidality\nin patients with major depressive disorder. Am J Psychiatry. 167, 1381-13890.\nJollant F, Lawrence NS, Olie E, O'Daly O, Malafosse A, Courtet P, Phillips ML. (2010)\nDecreased activation of lateral orbitofrontal cortex during risky choices under\nuncertainty is associated with disadvantageous decision-making and suicidal behavior.\nNeuroimage. 51, 1275-12781.\nKable JW, Glimcher PW. (2007) The neural correlates of subjective value during\nintertemporal choice. Nature Neuroscience. 10, 1625-1633.\nKahneman, D, and Tversky A. (1979) \"Prospect Theory: An Analysis of Decision under\nRisk\", Econometrica, XLVII, 263-291.\nKerkhof, A.J.F.M. Attempted suicide: patterns and trends. In: K. Hawton and K. van\nHeeringen, Editors, The International Handbook of Suicide and Attempted Suicide,\n\n\fJohn Wiley & Sons Ltd., Chichester (2000), pp. 49–64.\nKunugi, H. Takei, N. Aoki H. and Nanko S., (1997) Low serum cholesterol in suicide\nattempters, Biol. Psychiatry 41, pp. 196–200.\nKunugi H, Urushibara T, Nanko S. (2004) Combined DEX/CRH test among Japanese\npatients with major depression. J Psychiatr Res. 38, 123-128.\nLempert KM, Pizzagalli DA. (2010) Delay discounting and future-directed thinking in\nanhedonic individuals. J Behav Ther Exp Psychiatry. 41, 258-264.\nMarcotte, DE (2003) The economics of suicide, revisited. Southern Economic Journal,\n69, 628-643.\nMeana, J.J. Barturen F. and Garcia-Sevilla, J.A. (1992)Alpha 2-adrenoceptors in the\nbrain of suicide victims: increased receptor density associated with major depression,\nBiol. Psychiatry 31, pp. 471–490.\nMcGowan, P.O. Sasaki, A. D'Alessio, A.C. Dymov, S. Labonte, B. Szyf, M. Turecki G.\nand Meaney, M.J. (2009) Epigenetic regulation of the glucocorticoid receptor in human\nbrain associates with childhood abuse, Nat. Neurosci. 12, pp. 342–348.\nMouri K, Hishimoto A, Fukutake M, Shiroiwa K, Asano M, Nagasaki Y, Ueno Y,\nShirakawa O, Nishiguchi N, Maeda K. (2009) TPH2 is not a susceptibility gene for\nsuicide in Japanese population. Prog Neuropsychopharmacol Biol Psychiatry. 33,\n1546-1550.\nPaulus MP, Frank LR (2006) Anterior cingulate activity modulates nonlinear decision\nweight function of uncertain prospects. Neuroimage. 30, 668-677.\nSakamoto S, Tanaka E, Neichi K, Sato K, Ono Y. (2006) Sociopsychological factors\nrelating to suicide prevention in a Japanese rural community: coping behaviors and\nattitudes toward depression and suicidal ideation. Psychiatry Clin Neurosci. 60,\n676-686.\nSpoletini I, Piras F, Fagioli S, Rubino IA, Martinotti G, Siracusano A, Caltagirone C,\n\n\fSpalletta G. (2011) Suicidal attempts and increased right amygdala volume in\nschizophrenia. Schizophr Res. 125, 30-40.\nSuda A, Kawanishi C, Kishida I, Sato R, Yamada T, Nakagawa M, Hasegawa H, Kato D,\nFuruno T, Hirayasu Y. (2009) Dopamine D2 receptor gene polymorphisms are\nassociated with suicide attempt in the Japanese population. Neuropsychobiology. 59,\n130-134.\nSupriyanto I, Sasada T, Fukutake M, Asano M, Ueno Y, Nagasaki Y, Shirakawa O,\nHishimoto A. (2010) Association of FKBP5 gene haplotypes with completed suicide in\nthe Japanese population. Prog Neuropsychopharmacol Biol Psychiatry. 35, 252-256.\nSuzuki T (2008) Economic modelling of suicide under income uncertainty: For better\nunderstanding of middle-aged suicide. Australian Economic Papers, 47, 296-310.\nTakahashi T, (2004) Cortisol levels and time-discounting of monetary gain in humans.\nNeuroreport. 15, 2145-2147.\nTakahashi T, Sakaguchi K, Oki M, Homma S, Hasegawa T. (2006) Testosterone levels\nand discounting delayed monetary gains and losses in male humans. NeuroEndocrinol\nLett. 27, 439-444.\nTakahashi, T. (2007) A comparison of intertemporal choices for oneself versus someone\nelse based on Tsallis' statistics, Physica A 385, 637-644\nTakahashi, T (2009) Theoretical frameworks for neuroeconomics of intertemporal\nchoice. Journal of Neuroscience, Psychology, and Economics. 2(2), 75-90.\nTakahashi, T (2011) Psychophysics of the probability weighting function. Physica A:\nStatistical Mechanics and its Applications 390, 902-905.\nTakahashi T, Ono H, Radford MHB (2007a) Empirical estimation of consistency\nparameter in intertemporal choice based on Tsallis' statistics Physica A 381, 338-342\nTakahashi T, Ikeda K, Fukushima H, Hasegawa T. (2007b) Salivary alpha-amylase\nlevels and hyperbolic discounting in male humans. NeuroEndocrinol Lett. 28, 17-20.\n\n\fTakahashi, T., Oono, H., Radford, M.H.B. (2008a) Psychophysics of time perception\nand intertemporal choice models. Physica A: Statistical Mechanics and its Applications\n387, 2066-2074\nTakahashi T, Oono H, Inoue T, et al. (2008b) Depressive patients are more impulsive\nand inconsistent in intertemporal choice behavior for monetary gain and loss than\nhealthy subjects - An analysis based on Tsallis' statistics, NeuroEndocrinology Letters,\n29, 351-358\nTakahashi T, Shinada M, Inukai K, Tanida S, Takahashi C, Mifune N, Takagishi H,\nHorita Y, Hashimoto H, Yokota K, Kameda T, Yamagishi T. (2010) Stress hormones\npredict hyperbolic time-discount rates six months later in adults. NeuroEndocrinology\nLetters, 31, 616-621.\nTversky, A and Kahneman D (1992). \"Advances in prospect theory: Cumulative\nrepresentation of uncertainty\". Journal of Risk and Uncertainty 5: 297–323.\nPrelec D. (1998). The probability weighting function. Econometrica 60. 497-528.\nvan Heeringen, C, Audenaert, K. Van Laere, K. Dumont, F. Slegers, G. Mertens J. and\nDierckx, R.A. (2003) Prefrontal 5-HT2a receptor binding index, hopelessness and\npersonality characteristics in attempted suicide, J. Affect. Disord. 74, 149–158.\nvan Heeringen C, Bijttebier S, Godfrin K. (2011) Suicidal brains: a review of functional\nand structural brain studies in association with suicidal behaviour. Neurosci Biobehav\nRev. 35, 688-698.\nXu L, Liang ZY, Wang K, Li S, Jiang T. Neural mechanism of intertemporal choice:\nfrom discounting future gains to future losses. Brain Res. 2009 1261:65-74.\nYamasaki A, Sakai R, Shirakawa T. (2005) Low income, unemployment, and suicide\nmortality rates for middle-age persons in Japan. Psychol Rep. 96, 337-348.\nYanagi M, Shirakawa O, Kitamura N, Okamura K, Sakurai K, Nishiguchi N, Hashimoto\nT, Nushida H, Ueno Y, Kanbe D, Kawamura M, Araki K, Nawa H, Maeda K. (2005)\n\n\fAssociation of 14-3-3 epsilon gene haplotype with completed suicide in Japanese. J\nHum Genet. 50, 210-216.\n\nZhong S, Israel S, Xue H, Sham PC, Ebstein RP, Chew SH. (2009) A neurochemical\napproach to valuation sensitivity over gains and losses. Proc Biol Sci. 276, 4181-4188.\n\n\f"}