{"id": "http://arxiv.org/abs/0810.0371v1", "guidislink": true, "updated": "2008-10-02T12:39:52Z", "updated_parsed": [2008, 10, 2, 12, 39, 52, 3, 276, 0], "published": "2008-10-02T12:39:52Z", "published_parsed": [2008, 10, 2, 12, 39, 52, 3, 276, 0], "title": "The luminosity of GRB afterglows as distance estimator", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0810.1599%2C0810.2443%2C0810.5649%2C0810.3768%2C0810.4669%2C0810.1642%2C0810.3039%2C0810.5568%2C0810.0383%2C0810.2579%2C0810.5672%2C0810.1167%2C0810.5382%2C0810.3981%2C0810.0427%2C0810.2661%2C0810.1471%2C0810.4075%2C0810.3112%2C0810.4255%2C0810.1221%2C0810.5298%2C0810.5570%2C0810.0673%2C0810.3795%2C0810.1672%2C0810.0159%2C0810.3920%2C0810.1146%2C0810.2526%2C0810.1553%2C0810.2422%2C0810.1794%2C0810.3316%2C0810.0371%2C0810.0548%2C0810.3221%2C0810.5211%2C0810.4888%2C0810.4829%2C0810.3911%2C0810.1447%2C0810.4978%2C0810.2348%2C0810.5256%2C0810.3424%2C0810.4225%2C0810.1896%2C0810.4099%2C0810.5622%2C0810.2392%2C0810.5309%2C0810.4149%2C0810.0616%2C0810.1440%2C0810.4640%2C0810.5304%2C0810.0563%2C0810.5275%2C0810.1930%2C0810.4314%2C0810.5350%2C0810.5074%2C0810.3392%2C0810.3915%2C0810.2883%2C0810.2317%2C0810.3126%2C0810.0500%2C0810.3035%2C0810.1956%2C0810.2378%2C0810.2234%2C0810.2517%2C0810.1027%2C0810.3311%2C0810.2247%2C0810.3562%2C0810.2707%2C0810.0115%2C0810.1836%2C0810.3897%2C0810.3421%2C0810.5284%2C0810.0567%2C0810.2468%2C0810.5647%2C0810.1871%2C0810.2006%2C0810.1019%2C0810.2676%2C0810.0031%2C0810.0326%2C0810.2796%2C0810.0140%2C0810.1426%2C0810.2339%2C0810.2890%2C0810.3225%2C0810.0429%2C0810.5688&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The luminosity of GRB afterglows as distance estimator"}, "summary": "We investigate the clustering of afterglow light curves observed at X-ray and\noptical wavelengths. We have constructed a sample of 61 bursts with known\ndistance and X-ray afterglow. GRB sources can be divided in three classes,\nnamely optical and X-ray bright afterglows, optical and X-ray dim one s, and\noptically bright -X-ray dim ones. We argue that this clustering is related to\nthe fireball total energy, the external medium density, the fraction of\nfireball energy going in relativistic electrons and magnetic fields. We propose\na method for the estimation of the GRB source redshift based on the observe d\nX-ray flux one day after the burst and optical properties. We tested this\nmethod on three recently detected SWIFT GRBs with known redshift, and found it\ni n good agreement with the reported distance from optical spectroscopy.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0810.1599%2C0810.2443%2C0810.5649%2C0810.3768%2C0810.4669%2C0810.1642%2C0810.3039%2C0810.5568%2C0810.0383%2C0810.2579%2C0810.5672%2C0810.1167%2C0810.5382%2C0810.3981%2C0810.0427%2C0810.2661%2C0810.1471%2C0810.4075%2C0810.3112%2C0810.4255%2C0810.1221%2C0810.5298%2C0810.5570%2C0810.0673%2C0810.3795%2C0810.1672%2C0810.0159%2C0810.3920%2C0810.1146%2C0810.2526%2C0810.1553%2C0810.2422%2C0810.1794%2C0810.3316%2C0810.0371%2C0810.0548%2C0810.3221%2C0810.5211%2C0810.4888%2C0810.4829%2C0810.3911%2C0810.1447%2C0810.4978%2C0810.2348%2C0810.5256%2C0810.3424%2C0810.4225%2C0810.1896%2C0810.4099%2C0810.5622%2C0810.2392%2C0810.5309%2C0810.4149%2C0810.0616%2C0810.1440%2C0810.4640%2C0810.5304%2C0810.0563%2C0810.5275%2C0810.1930%2C0810.4314%2C0810.5350%2C0810.5074%2C0810.3392%2C0810.3915%2C0810.2883%2C0810.2317%2C0810.3126%2C0810.0500%2C0810.3035%2C0810.1956%2C0810.2378%2C0810.2234%2C0810.2517%2C0810.1027%2C0810.3311%2C0810.2247%2C0810.3562%2C0810.2707%2C0810.0115%2C0810.1836%2C0810.3897%2C0810.3421%2C0810.5284%2C0810.0567%2C0810.2468%2C0810.5647%2C0810.1871%2C0810.2006%2C0810.1019%2C0810.2676%2C0810.0031%2C0810.0326%2C0810.2796%2C0810.0140%2C0810.1426%2C0810.2339%2C0810.2890%2C0810.3225%2C0810.0429%2C0810.5688&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We investigate the clustering of afterglow light curves observed at X-ray and\noptical wavelengths. We have constructed a sample of 61 bursts with known\ndistance and X-ray afterglow. GRB sources can be divided in three classes,\nnamely optical and X-ray bright afterglows, optical and X-ray dim one s, and\noptically bright -X-ray dim ones. We argue that this clustering is related to\nthe fireball total energy, the external medium density, the fraction of\nfireball energy going in relativistic electrons and magnetic fields. We propose\na method for the estimation of the GRB source redshift based on the observe d\nX-ray flux one day after the burst and optical properties. We tested this\nmethod on three recently detected SWIFT GRBs with known redshift, and found it\ni n good agreement with the reported distance from optical spectroscopy."}, "authors": ["B. Gendre", "A. Galli", "M. Boer"], "author_detail": {"name": "M. Boer"}, "author": "M. Boer", "arxiv_comment": "6 pages, proceeding of the PCHE session at the Journees de la SF2A", "links": [{"href": "http://arxiv.org/abs/0810.0371v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0810.0371v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0810.0371v1", "affiliation": "Observatoire de Haute-Provence/CNRS", "arxiv_url": "http://arxiv.org/abs/0810.0371v1", "journal_reference": null, "doi": null, "fulltext": "SF2A 2008\n\narXiv:0810.0371v1 [astro-ph] 2 Oct 2008\n\nC. Charbonnel, F. Combes and R. Samadi (eds)\n\nTHE LUMINOSITY OF GRB AFTERGLOWS AS DISTANCE ESTIMATOR\nGendre, B. 1 , Galli, A. 2 and Boër, M. 3\nAbstract. We investigate the clustering of afterglow light curves observed at X-ray and optical wavelengths.\nWe have constructed a sample of 61 bursts with known distance and X-ray afterglow. GRB sources can\nbe divided in three classes, namely optical and X-ray bright afterglows, optical and X-ray dim ones, and\noptically bright -X-ray dim ones. We argue that this clustering is related to the fireball total energy, the\nexternal medium density, the fraction of fireball energy going in relativistic electrons and magnetic fields.\nWe propose a method for the estimation of the GRB source redshift based on the observed X-ray flux one\nday after the burst and optical properties. We tested this method on three recently detected SWIFT GRBs\nwith known redshift, and found it in good agreement with the reported distance from optical spectroscopy.\n\n1\n\nIntroduction\n\nLong Gamma-Ray Bursts (GRBs) (for a review, see Meszaros 2006) are linked to the final stages of the stellar\nevolution. As these objects are extremely luminous and can be detected up to large distance, they are interesting\nfor studies of cosmology in the redshift range 1-15. However, the use of GRB for cosmological studies needs to\nbuild a robust indicator of their distance, whenever possible based on their intrinsic properties.\nHints of standardization of the X-ray afterglow luminosities were first discovered by Boër & Gendre (2000),\nwho found evidences for clustering in the X-ray luminosity of BeppoSAX afterglows, and confirmed later by\nGendre & Boër (2005). In the following we will refer to these articles respectively as paper I and II. This study\nwas completed by Nardini et al. (2006) and Liang & Zhang (2006) who found independently that optical\nafterglows were also clustered in luminosity, and by Gendre et al. (2008b) who extended this study towards\ninfrared wavelengths. We have tried to derive a method for estimating the burst distance based on that\nproperty. In Section 2 we present the luminosity clusterings. In section 3 we present our method of GRB\ndistance estimation from the X-ray afterglow light curve. We test this method on several GRBs detected\nrecently by SWIFT, and we propose an estimation of the redshift for two previously detected GRBs of unknown\ndistance.\n2\n\nLuminosity clustering\n\n2.1 X-ray clustering\nOur sample of GRBs with known redshift and X-ray afterglow observations includes all afterglows observed by\nBeppoSAX, XMM-Newton, Chandra, and SWIFT prior to the 1st of August 2006 with a t90 larger than 2.0\nseconds (in order to exclude short bursts). Data analysis is explained in detail in Gendre et al. (2008a). The\nresults are displayed in Fig. 1. The groups reported in papers I and II are apparent. We note however some\ndispersion during the first part of the light curves. We interpret this as a consequence on the error on the Ta\nmeasurement. We refer to the bright group as xI and the dimmer one as xII, as in paper II. Height bursts do\nnot follow this relation. We consider that these low luminosity events form a specific group, referred as xIII in\nthe following.\n1\n\nLaboratoire d'Astrophysique de Marseille/CNRS/Universit de Provence\n\n2\n\nIASF-Roma\nObservatoire de Haute-Provence/CNRS\n\n3\n\nc\n\n\f238\n\nSF2A 2008\n\n2\n\nFlux (10−12 ergs.cm−2.s−1, 2−10 keV)\n\n10\n\n0\n\n10\n\n−2\n\n10\n\n−4\n\n10\n\n−6\n\n10\n\n−2\n\n10\n\n0\n\n2\n\n10\n10\nTime since burst (days)\n\nFig. 1. Left: the light curves of our sample, corrected for distance effects (see text). The groups reported in papers I\nand II are clearly seen. Right: Comparison of the estimated redshift versus the measured one for the bursts defining our\nsample. The solid line corresponds to equality.\n\n2.2 The optical afterglows\nNardini et al. (2006) and Liang & Zhang (2006) have shown that optical afterglow light curves also display\na clustering effect. They found two groups, and we will refer to them as oI and oII for the bright and dim\ngroup respectively. While an oI burst can belong to xI or xII, oII bursts are dim both at optical and X-ray\nwavelengths.\n2.2.1 The nature of the clustering\nThe optical and X-ray data define 3 groups : xI-oI events, xII-oI events, xII-oII events, plus the outliers xIII\nevents. We propose that the presence of different groups is ascribed to different families of ǫe and ǫB values:\n• a family of 'magnetized fireball' that produces the group xII-oI. In such a case the fireball transfers only\na low fraction of its energy into relativistic electrons.\n• a family of 'less magnetized fireball' that produces the groups xI-oI and xII-oII. The fraction of total\nenergy going into magnetic fields is roughly one order of magnitude lower than group xII-oI. These two\ngroups can be related to an high and low fraction of energy going in relativistic electrons, respectively.\n3\n\nEstimation of GRB source distance\n\nTo date, most of the redshift measurements made on GRB afterglows were done by optical spectroscopic or\nphotometric observations. However, not all GRBs can be followed in optical. On the other hand, after the\nlaunch of the SWIFT satellite, nearly all GRBs have an homogeneous X-ray follow-up. Hence, a distance\nmeasurement method based solely on X-ray observations could be very interesting if one wants to use a large\nsample of GRB sources for cosmological studies. We used the observed luminosity clustering in X-ray to derive\na distance estimator. Table 1, which provides the redshift needed to comply with the relation for both groups\nfor a given observed flux, is directly usable to estimate that estimator. Note that the belonging group can be\nfixed only through broad-band modeling. In practical, this leads to two redshift estimates. If the bursts has an\noptical afterglow there is a possible way to decide which of the estimate is valid: if a GRB afterglow is observed\nby UVOT (or in the B band for ground based telescopes) then it cannot belong to group I, and the ambiguity\non the redshift determination is cleared.\n\n\fGRB afterglows distance estimator\n\n239\n\nTable 1. Flux to redshift conversion. This table should be used as an estimate of the redshift for bursts observed by\nany X-ray observatory. The flux is given in the 2-10 keV band at 1 day after the burst (observer frame). The redshift\nhas been calculated for an energy index of 1.2, the uncertainty is 30%.\n\nFlux\n(erg s−1 cm−2 )\n1 × 10−14\n2 × 10−14\n3 × 10−14\n4 × 10−14\n5 × 10−14\n6 × 10−14\n7 × 10−14\n8 × 10−14\n9 × 10−14\n1 × 10−13\n2 × 10−13\n3 × 10−13\n4 × 10−13\n5 × 10−13\n6 × 10−13\n7 × 10−13\n8 × 10−13\n9 × 10−13\n1 × 10−12\n2 × 10−12\n3 × 10−12\n4 × 10−12\n5 × 10−12\n6 × 10−12\n7 × 10−12\n8 × 10−12\n9 × 10−12\n1 × 10−11\n2 × 10−11\n3 × 10−11\n\nGroup I redshift\n\ngroup II redshift\n\n-\n-\n-\n-\n-\n7.80\n7.09\n6.38\n6.05\n5.78\n4.10\n3.48\n3.05\n2.82\n2.59\n2.42\n2.29\n2.10\n1.99\n1.50\n1.29\n1.16\n1.06\n0.99\n0.94\n0.89\n0.83\n0.79\n0.56\n0.50\n\n4.43\n3.28\n2.72\n2.35\n2.12\n1.96\n1.83\n1.75\n1.68\n1.62\n1.26\n1.09\n0.96\n0.89\n0.82\n0.77\n0.73\n0.69\n0.66\n0.50\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n\nWe calibrated this method by deriving the estimated redshift for the bursts of our sample (for which the\ngroup is known), and comparing this value with the measured redshift. The results are displayed in Fig. 1.\nThe estimated redshift agrees with the measured one for most of the bursts. The only discrepancies arises at\nlow redshift: as a conservative approach we prefer to restrict the validity of our method to source located at\nredshifts larger than 0.5.\nThe distance estimation of several events with no known redshift, good temporal sampling and spectral\ninformations is presented in table 2. GRB 980519 was observed in U band Jaunsen et al. (2001). As the\nLymann α cut-off cross the U band at z ∼ 2.8, this burst should not have been observed in the high distance\nhypothesis. U observations can indeed solve the problem of group classification, and we propose a redshift\nmeasurement for GRB 980519 of 1.4 ± 0.2. For the same reason, GRB 040827 has z = 1.9 ± 0.3, since an optical\nafterglow has been observed (Malesani et al 2004).\nSeveral GRB were recently detected by SWIFT and their distance derived using optical spectroscopy. We\nthus have a sample of bursts which allows to test this correlation independently. To simulate actual conditions\nfor an unknown event we used the SWIFT count rate light curve available from their web site, and we apply a\nmean spectral index of 1.2 for the count-to-flux conversion. The results are indicated in Table 3, indicating an\nagreement in accordance with the error estimated previously.\n\n\f240\n\nSF2A 2008\n\nTable 2. Redshift estimates derived from the relation using either the group I and II hypotheses for pre-SWIFT bursts\nwithout known distance.\n\nGRB name\nGRB 980329\nGRB 980519\nGRB 990704\nGRB 990806\nGRB 001109\nGRB 001025A\nGRB 020322\nGRB 040106\nGRB 040223\nGRB 040827\n\nRedshift\ngroup I\n4.2 ± 1.2\n3.8 ± 0.7\n3.5 ± 0.9\n4.7+1.6\n−0.7\n2.3 ± 0.7\n5.8 ± 1.8\n5.0 ± 1.5\n3.4 ± 0.5\n5.5+2.0\n1.2\n8.0 ± 2.0\n\nestimate\ngroup II\n1.2 ± 0.2\n1.4 ± 0.2\n1.3 ± 0.3\n1.6 ± 0.3\n0.8 ± 0.2\n2.2 ± 0.4\n1.5 ± 0.3\n1.0 ± 0.2\n1.7 ± 0.2\n1.9 ± 0.3\n\nTable 3. Redshift estimates derived from the relation using either the group I and II hypotheses for SWIFT bursts with\nknown distance.\n\nGRB name\nGRB 070529\nGRB 070611\nGRB 070721B\n4\n\nGroup I\nestimate\n7.8\n6.05\n-\n\nGroup II\nestimate\n1.96\n1.68\n3.28\n\nMeasured\nredshift\n2.44\n2.04\n3.62\n\nConclusions\n\nWe have investigated the clustering of afterglow light curves observed previously in X-ray and in optical. Adding\nSWIFT bursts to the previous sample reported in paper II, we still confirm our previous findings. On a sample\nof 61 events the X-ray light curves cluster in two groups, with a significance larger than 6 σ. We compared\nthe classification within each group in X-ray and in optical, and found three classes: bright optical and X-ray\nafterglows, dim ones, and optically bright-X-ray dim ones.\nUsing the observed X-ray afterglow properties of GRBs, we propose a new, simple, method for the determination of the source distance based on X-ray data; optical photometry in U and V bands may help to clear the\ndegeneracy between the two estimates found. We apply this method to a sample of GRB source of unknown\nredshift. We propose an estimation of the redshift for GRB 980519 (1.4 ± 0.2) and for GRB 040827 (1.9 ± 0.3).\nBG acknowledge support from COFIN grant 2005025417, and from the Centre Nationnal d'Etudes Spatiales. We are pleased to\nthank Alessandra Corsi, Giulia Stratta. This work made use of data supplied by the UK Swift Science Data Centre at the University\nof Leicester.\n\nReferences\nBoër, M. & Gendre, B. 2000, A&A, 361, L21\nGendre, B., Boër, M., 2005, A&A , 430, 465\nGendre, B., Galli, A., & Boër, M., 2008a, ApJ, 683, 620\nGendre, B., Pelisson, S., Boër, M. Basa, S., Mazure, A., 2008b, A&A, submitted\nJaunsen, A.O., Hjorth, J., Björnsson, G., et al., 2001, ApJ, 546, 127\nLiang, E. & Zhang, B., 2006, ApJ, 638, L67\nMalesani, D., D'Avanzo, P., Melandri, A., et al., 2004, GCN # 2685\nMeszaros, P, 2006, Rep. Prog. Phys., 69, 2259\nNardini, M., Ghisellini, G., Ghirlanda, G., et al., 2006, A&A, 451, 821\n\n\f"}