{"id": "http://arxiv.org/abs/1006.1662v3", "guidislink": true, "updated": "2011-11-26T17:46:51Z", "updated_parsed": [2011, 11, 26, 17, 46, 51, 5, 330, 0], "published": "2010-06-08T20:56:33Z", "published_parsed": [2010, 6, 8, 20, 56, 33, 1, 159, 0], "title": "Non-linear MSSM", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1006.2930%2C1006.4399%2C1006.5109%2C1006.3614%2C1006.1774%2C1006.3270%2C1006.5505%2C1006.3363%2C1006.2515%2C1006.5260%2C1006.5916%2C1006.4369%2C1006.2283%2C1006.1736%2C1006.3527%2C1006.2395%2C1006.4525%2C1006.0415%2C1006.5550%2C1006.4766%2C1006.5623%2C1006.3696%2C1006.5128%2C1006.0832%2C1006.4960%2C1006.0737%2C1006.5710%2C1006.4230%2C1006.0009%2C1006.4975%2C1006.2852%2C1006.4759%2C1006.3486%2C1006.4663%2C1006.3553%2C1006.1567%2C1006.2969%2C1006.1340%2C1006.5886%2C1006.2740%2C1006.0619%2C1006.1718%2C1006.1845%2C1006.4974%2C1006.3867%2C1006.4905%2C1006.1817%2C1006.1595%2C1006.1898%2C1006.3236%2C1006.2665%2C1006.0554%2C1006.5203%2C1006.2741%2C1006.4378%2C1006.1655%2C1006.0229%2C1006.2062%2C1006.1876%2C1006.1327%2C1006.2000%2C1006.4246%2C1006.2799%2C1006.5566%2C1006.3510%2C1006.2090%2C1006.3095%2C1006.0416%2C1006.1036%2C1006.1344%2C1006.4019%2C1006.1910%2C1006.2307%2C1006.3385%2C1006.4972%2C1006.3316%2C1006.2493%2C1006.4912%2C1006.4999%2C1006.1668%2C1006.2996%2C1006.2162%2C1006.5635%2C1006.1234%2C1006.3647%2C1006.3505%2C1006.1654%2C1006.0129%2C1006.5352%2C1006.2358%2C1006.1662%2C1006.1927%2C1006.5655%2C1006.1482%2C1006.5904%2C1006.5873%2C1006.1423%2C1006.5199%2C1006.2882%2C1006.4527%2C1006.2176&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Non-linear MSSM"}, "summary": "Using the formalism of constrained superfields, we derive the most general\neffective action of a light goldstino coupled to the minimal supersymmetric\nstandard model (MSSM) and study its phenomenological consequences. The\ngoldstino-induced couplings become important when the (hidden sector) scale of\nspontaneous supersymmetry breaking, $\\sqrt f$, is relatively low, of the order\nof few TeV. In particular, we compute the Higgs potential and show that the\n(tree level) mass of the lightest Higgs scalar can be increased to the LEP\nbound for $\\sqrt f\\sim 2$ TeV to 7 TeV. Moreover, the effective quartic Higgs\ncoupling is increased due to additional tree-level contributions proportional\nto the ratio of visible to hidden sector supersymmetry breaking scales. This\nincrease can alleviate the amount of fine tuning of the electroweak scale that\nexists in the MSSM. Among the new goldstino couplings, beyond those in MSSM,\nthe most important ones generate an invisible decay of the Higgs boson into a\ngoldstino and neutralino (if m_h>m_{\\chi_1^0}), with a partial decay rate that\ncan be comparable to the SM channel h^0-> \\gamma\\gamma. A similar decay of Z\nboson is possible if m_Z>m_{\\chi_1^0} and brings a lower bound on $\\sqrt f$\nthat must be of about 700 GeV. Additional decay modes of the Higgs or Z bosons\ninto a pair of light goldstinos, while possible, are suppressed by an extra 1/f\nfactor and have no significant impact on the model.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1006.2930%2C1006.4399%2C1006.5109%2C1006.3614%2C1006.1774%2C1006.3270%2C1006.5505%2C1006.3363%2C1006.2515%2C1006.5260%2C1006.5916%2C1006.4369%2C1006.2283%2C1006.1736%2C1006.3527%2C1006.2395%2C1006.4525%2C1006.0415%2C1006.5550%2C1006.4766%2C1006.5623%2C1006.3696%2C1006.5128%2C1006.0832%2C1006.4960%2C1006.0737%2C1006.5710%2C1006.4230%2C1006.0009%2C1006.4975%2C1006.2852%2C1006.4759%2C1006.3486%2C1006.4663%2C1006.3553%2C1006.1567%2C1006.2969%2C1006.1340%2C1006.5886%2C1006.2740%2C1006.0619%2C1006.1718%2C1006.1845%2C1006.4974%2C1006.3867%2C1006.4905%2C1006.1817%2C1006.1595%2C1006.1898%2C1006.3236%2C1006.2665%2C1006.0554%2C1006.5203%2C1006.2741%2C1006.4378%2C1006.1655%2C1006.0229%2C1006.2062%2C1006.1876%2C1006.1327%2C1006.2000%2C1006.4246%2C1006.2799%2C1006.5566%2C1006.3510%2C1006.2090%2C1006.3095%2C1006.0416%2C1006.1036%2C1006.1344%2C1006.4019%2C1006.1910%2C1006.2307%2C1006.3385%2C1006.4972%2C1006.3316%2C1006.2493%2C1006.4912%2C1006.4999%2C1006.1668%2C1006.2996%2C1006.2162%2C1006.5635%2C1006.1234%2C1006.3647%2C1006.3505%2C1006.1654%2C1006.0129%2C1006.5352%2C1006.2358%2C1006.1662%2C1006.1927%2C1006.5655%2C1006.1482%2C1006.5904%2C1006.5873%2C1006.1423%2C1006.5199%2C1006.2882%2C1006.4527%2C1006.2176&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Using the formalism of constrained superfields, we derive the most general\neffective action of a light goldstino coupled to the minimal supersymmetric\nstandard model (MSSM) and study its phenomenological consequences. The\ngoldstino-induced couplings become important when the (hidden sector) scale of\nspontaneous supersymmetry breaking, $\\sqrt f$, is relatively low, of the order\nof few TeV. In particular, we compute the Higgs potential and show that the\n(tree level) mass of the lightest Higgs scalar can be increased to the LEP\nbound for $\\sqrt f\\sim 2$ TeV to 7 TeV. Moreover, the effective quartic Higgs\ncoupling is increased due to additional tree-level contributions proportional\nto the ratio of visible to hidden sector supersymmetry breaking scales. This\nincrease can alleviate the amount of fine tuning of the electroweak scale that\nexists in the MSSM. Among the new goldstino couplings, beyond those in MSSM,\nthe most important ones generate an invisible decay of the Higgs boson into a\ngoldstino and neutralino (if m_h>m_{\\chi_1^0}), with a partial decay rate that\ncan be comparable to the SM channel h^0-> \\gamma\\gamma. A similar decay of Z\nboson is possible if m_Z>m_{\\chi_1^0} and brings a lower bound on $\\sqrt f$\nthat must be of about 700 GeV. Additional decay modes of the Higgs or Z bosons\ninto a pair of light goldstinos, while possible, are suppressed by an extra 1/f\nfactor and have no significant impact on the model."}, "authors": ["I. Antoniadis", "E. Dudas", "D. M. Ghilencea", "P. Tziveloglou"], "author_detail": {"name": "P. Tziveloglou"}, "author": "P. Tziveloglou", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1016/j.nuclphysb.2010.08.002", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1006.1662v3", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1006.1662v3", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "25 pages, LaTeX, 8 figures; v3: added references", "arxiv_primary_category": {"term": "hep-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "hep-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "hep-th", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1006.1662v3", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1006.1662v3", "journal_reference": "Nucl.Phys.B841:157-177,2010", "doi": "10.1016/j.nuclphysb.2010.08.002", "fulltext": "CERN-PH-TH/2010-118\nCPHT-RR037.0510\nLPT-ORSAY 10-32\nNSF-KITP-10-057\n\narXiv:1006.1662v3 [hep-ph] 26 Nov 2011\n\nNon-linear MSSM\n\nI. Antoniadis a,b , E. Dudas b,c , D. M. Ghilencea a, d , P. Tziveloglou a, e, 1\na\nb\n\nTheory Division, CERN, 1211 Geneva 23, Switzerland.\n\nCentre de Physique Théorique, Ecole Polytechnique, CNRS, 91128 Palaiseau, France.\n\nc\n\nLPT, UMR du CNRS 8627, Bât 210, Université de Paris-Sud, 91405 Orsay Cedex, France.\n\nd\n\nTheoretical Physics Department, IFIN-HH Bucharest, PO Box MG-6 Bucharest, Romania.\ne\n\nDepartment of Physics, Cornell University, Ithaca, NY 14853 USA.\n\nAbstract\nUsing the formalism of constrained superfields, we derive the most general effective action\nof a light goldstino coupled to the minimal supersymmetric standard model (MSSM)\nand study its phenomenological consequences. The goldstino-induced couplings become\n√\nimportant when the (hidden sector) scale of spontaneous supersymmetry breaking, f ,\nis relatively low, of the order of few TeV. In particular, we compute the Higgs potential\nand show that the (tree level) mass of the lightest Higgs scalar can be increased to the\n√\nLEP bound for f ∼ 2 TeV to 7 TeV. Moreover, the effective quartic Higgs coupling is\nincreased due to additional tree-level contributions proportional to the ratio of visible to\nhidden sector supersymmetry breaking scales. This increase can alleviate the amount of\nfine tuning of the electroweak scale that exists in the MSSM. Among the new goldstino\ncouplings, beyond those in MSSM, the most important ones generate an invisible decay\nof the Higgs boson into a goldstino and neutralino (if mh > mχ01 ), with a partial decay\nrate that can be comparable to the SM channel h0 → γγ. A similar decay of Z boson is\n√\npossible if mZ > mχ01 and brings a lower bound on f that must be of about 700 GeV.\nAdditional decay modes of the Higgs or Z bosons into a pair of light goldstinos, while\npossible, are suppressed by an extra 1/f factor and have no significant impact on the\nmodel.\n1\n\nE-mail addresses: Ignatios.Antoniadis@cern.ch, Emilian.Dudas@cpht.polytechnique.fr,\n\nDumitru.Ghilencea@cern.ch, pt88@cornell.edu\n\n\f1\n\nIntroduction\n\nSpontaneous supersymmetry breaking at low energies predicts a nearly massless goldstino.\nMore precisely, it plays the role of the longitudinal component of the gravitino, which acquires\na Planck suppressed mass f /MP lanck , in the milli-eV range if the supersymmetry breaking\n√\nscale f is in the multi-TeV region. By the equivalence theorem [1], it interacts with a strength\n√\n1/ f which is much stronger than the Planck suppressed couplings of the transverse gravitino,\nand is therefore very well described by the gravity-decoupled limit of a massless Goldstone\nfermion. An example of such a situation is provided by gauge mediation where, however, the\ntypical scale of supersymmetry breaking is expected to be a few orders of magnitude higher\nthan the soft breaking terms of the Standard Model (SM) superparticles, due to their double\nsuppression by the loop factor and by the messengers mass.\nIn this work, we perform a model independent analysis of the low energy consequences\n√\nof a light goldstino by treating f as a free parameter, that can be as low as a few times\nthe scale of soft breaking terms which we denote generically msof t . Furthermore, we will\nassume that all extra states (that may exist beyond those of the MSSM) are heavier than\n√\nf . In such a framework, there are two generic energy regimes that can be studied: (i): at\nTeV energies, comparable (or higher) than msof t , one has the usual MSSM together with a\ngoldstino; (ii): at low energies, lower than all sparticle masses, one is left just with a goldstino\ncoupled to the SM fields. In both cases, the goldstino effective interactions can be determined\nby non-linear supersymmetry. In the first case, it couples to ordinary supermultiplets of linear\nsupersymmetry, while in the second case the superparticles have been integrated out.\nThe self-interactions of the goldstino are given by the famous Volkov-Akulov action [2].\nTheir geometric method gives also a universal coupling to matter through its energy momentum tensor, of the form (1/f 2 )Tμν tμν , where Tμν , tμν are the stress tensors of matter and of\n(free) goldstino, respectively [3, 4]. It was realized however that this coupling is not the most\ngeneral invariant under non-linear supersymmetry [4, 5, 6]. General invariant couplings can be\nderived using two different superfield formulations. One of them promotes any ordinary field\nto a superfield by introducing a modified superspace that takes into account the non-linear\nsupersymmetry transformations of the goldstino [7, 8, 9]. The other uses the formalism of constrained superfields: these are usual superfields, but are subject to constraints that eliminate\nthe superpartners in terms of the light degrees of freedom and the goldstino [10, 11, 12, 13].\nIn this work, we use the method of constrained superfields in order to determine the general\ncouplings of the goldstino to MSSM superfields, focusing in the first energy region mentioned\n√\nabove E ∼ msof t < f . The only constrained superfield is then that of the goldstino Xnl ,\n\n2 = 0, which couples to MSSM superfields via the corresponding\nsatisfying the constraint Xnl\n\n1\n\n\fsoft terms: the recipe is to replace the spurion S ≡ msof t θ 2 by (msof t /f )Xnl and solve for\nits F-auxiliary component, as usual, in order to determine all effective interactions that can\n\nbe expanded in inverse power series of f . In the second energy region, lower than msof t , the\nsuperpartners can be integrated out (this can be done by additional constraints on the MSSM\nsuperfields [13]), and one has the goldstino coupled to SM fields only. In this case, it was found\nthat the dominant effective operators are of dimension-six [9] and can induce an important\ninvisible decay width of the Higgs boson, if the goldstino carries lepton number [14]. For a\nrelated effective approach to these problems, goldstino couplings and applications see [15, 16].\nObviously, the goldstino couplings to MSSM become important if the supersymmetry\n(SUSY) breaking scale is low. On the other hand, validity of the effective Lagrangian requires\nthat f be higher than the soft breaking terms, so that m2sof t /f is a good expansion parameter.\nIt turns out that the most important effects of these couplings are in the Higgs sector. In\nparticular, the quartic Higgs coupling is increased by a term proportional to the ratio of visible\nto hidden sector SUSY breaking, with two important consequences: (i) it can increase the\ntree-level value of the lightest Higgs mass that can then reach and cross the LEP bound2 of\n114.4 GeV [22]; (ii) it can alleviate the fine tuning of the electroweak scale in MSSM due to the\nrelatively high experimental bounds on msof t and large quantum corrections usually required\nin MSSM to satisfy the LEP bound. Additional effects that we investigate relate to the\ngoldstino-induced couplings in the MSSM Lagrangian, upon integration of the sgoldstino. All\ncouplings goldstino - MSSM fields are computed and these can be used for phenomenological\nstudies. As an example we show that for a light neutralino, the SM-like Higgs can decay into\na goldstino (which is the lightest supersymmetric particle (LSP)) and the lightest neutralino\n(next to LSP (NLSP) in this case), with a decay rate that can be comparable to the SM\npartial decay h0 → γγ. A similar decay of Z is possible, which provides a lower bound on\n√\nf ≈ 700 GeV. Other decays of the Higgs and Z bosons into pairs of goldstinos are possible,\nbut they have additional (1/f ) suppression, with little impact on the allowed parameter space.\nThe paper is organized as follows. Section 2 discusses general issues in non-linear realizations of supersymmetry and goldstino couplings. Section 3 presents the \"non-linear\" MSSM\nmodel obtained by the general coupling of the MSSM to goldstino, using the method described above. Section 4 presents the new couplings of the model, not present in MSSM, some\nof which are dimension-four in fields, suppressed by up to the second power of 1/f . Section 5\nanalyzes the implications for the Higgs masses. Section 6 presents other phenomenological consequences, such as the implications for the fine-tuning of the electroweak scale, some\ninteresting limits, and the invisible decays of the Higgs and Z bosons together with their\nconstraints. Finally, Section 7 contains our concluding remarks.\n2\n\nFor other possibilities to increase the Higgs mass in effective models see [15, 17, 18, 19, 21].\n\n2\n\n\f2\n\nNon-linear realizations and constrained goldstino superfield\n\nAn important role in constructing a non-linear supersymmetric version of the MSSM is played\nby the goldstino chiral superfield (SM gauge singlet) Xnl . One can use the component fields\nformalism to describe the corresponding Volkov-Akulov action. However, one can use the\nmore convenient superfield formalism, endowed with constraints; for the goldstino superfield\n2 = 0 [10, 11, 12, 13]. One can start with the Lagrangian\nthis constraint is Xnl\n\u001b\n\u001aZ\nZ\nhi\ni\n2\n4\n†\nd θ f X + h.c. = |∂μ φX |2 +FX† FX + ψ X σ μ ∂μ ψX + f FX +h.c. (1)\nLX = d θ X X +\n2\n\nwith the aforementioned constraint. This constraint is solved by\nXnl = φX +\n\n√\n\n2 θψX + θθ FX ,\n\nwith\n\nφX =\n\nψX ψX\n2 FX\n\n(2)\n\nwhich, when used in eq.(1) recovers [13] the Volkov-Akulov Lagrangian. After using the\nequations of motion FX = −f + .... where f (that can be chosen real) is the hidden sector\n\nSUSY breaking scale. Therefore, in the infrared description of the SUSY breaking (which is\nmodel independent), the scalar component (sgoldstino) becomes a function of the goldstino.\nTo find the goldstino couplings to matter fields (discussed for the MSSM in the next\nsection), consider first a supersymmetric theory with chiral multiplets Φi ≡ (φi , ψi , Fi ) and\n\nvector multiplets V ≡ (Aaμ , λa , D a ) coupled in a general way to Xnl :\n\nh\ni \u001aZ\nh\n†\n†\nd2 θ f Xnl + W (Φi )\nd4 θ Xnl\nXnl + Φ†i (eV Φ)i − (m2i /f 2 ) Xnl\nXnl Φ†i (eV Φ)i +\n\u001b\ni\n\u0011\nAijk\nBij\n2 mλ\n1\u0010\nα\n+\n1+\n(3)\nXnl Φi Φj +\nXnl Φi Φj Φk +\nXnl Tr W Wα + h.c. ,\n2f\n6f\n4\nf\n\nL =\n\nZ\n\nwhere m2i , Bij , Aijk are soft terms for the scalars and mλ is the gaugino mass. From this, one\ncan find the Goldstino (ψX ) couplings to ordinary matter/gauge superfields. These couplings\ncan be checked to be equivalent to those obtained by the equivalence theorem [1], from a\ntheory with the corresponding explicit soft breaking, in which the goldstino couples as:\n(1/f ) ∂ μ ψX Jμ = −(1/f ) ψX ∂ μ Jμ + (total space-time derivative),\n\n(4)\n\nHere Jμ is the supercurrent of the theory corresponding to that in (3) in which the goldstino\nis essentially replaced by the spurion, with the corresponding explicit soft breaking terms:\nL\n\n′\n\nZ\n\nZ\nh\n= d θ 1−\nΦ)i + d2 θ W (Φi )− (1/2) Bij θ 2 Φi Φj −(1/6) Aijk θ 2 Φi Φj Φk\ni\n1\n(5)\n(1 − 2mλ θ 2 ) Tr W α Wα + h.c. ,\n+\n4\n4\n\nh\n\n2\nm2i θ 2 θ\n\ni\n\nΦ†i (eV\n\n3\n\n\fWith this, eq.(4) shows that, on-shell, all goldstino couplings are proportional to soft terms.\nIndeed, the supercurrent of (5) is given by (with Dμ,ij = δij ∂μ + i g Aaμ Tija )\n1\ni\na\na\na\nJαμ = −[σ ν σ μ ψi ]α [Dν, ij φj ]† + i [σ μ ψ i ]α Fi − √ [σ ν σ ρ σ μ λ ]α Fνρ\n+ √ D a [σ μ λ ]α\n2 2\n2\n\n(6)\n\ni\nmλ h\na\n+ D a λaα .\n∂μ Jαμ = ψi,α (m2i φ† j + Bij φj + (1/2)Aijk φj φk ) + √ (σ μν )αβ λaβ Fμν\n2\n\n(7)\n\nso\n\nFrom (4), (7) one then recovers the couplings with one goldstino. However, the superfield\nformalism in (3) has the advantage that is easier to use when evaluating couplings with more\nthan one goldstino, by simply writing all effective operators (involving Xnl ) to a fixed order in\n1/f [13]. It is more difficult to find these from (5) and in Section 3 we use the former method.\nFinally, in addition to usual SUSY and goldstino couplings eq.(3) also brings new goldstinoindependent couplings induced by eliminating FX . Indeed, from (3)\n\u0010\n\n1−\n\n\u0011\n\u0010\n\u0011\nAijk\nBij\nm2i\nmλ\n†\n2\nF\n=\n−\nf\n+\n|φ\n|\nφ\nφ\n+\nφ\nφ\nφ\n+\nλλ\n+\n*\n*\n*\n,\ni\ni j\ni j k\nX\nf2\n2f\n6f\n2f\n\n(8)\n\nSo |FX |2 generates new couplings in onshell L, such as quartic scalar terms. When applied to\nMSSM, this brings in particular new corrections to the Higgs scalar potential (see later).\n\n3\n\nThe \"non-linear\" MSSM.\n\nWe apply the above method to couple the constrained superfield Xnl to the SUSY part of\nthe MSSM, to find the \"non-linear\" supersymmetry version of MSSM [13]. We stress that\nat energy scales below msof t , similar constraints can be applied to the MSSM superfields\nthemselves, corresponding to integrating out the corresponding superpartners. Here, the only\ndifference from the ordinary MSSM is in the supersymmetry breaking sector. Supersymmetry\nis broken spontaneously via a vacuum expectation value (VEV) of FX , fixed by its equation\nof motion (see later). The Lagrangian of the \"non-linear MSSM\" model is [13],\nL = L0 + LX + LH + Lm + LAB + Lg\n\n(9)\n\nLet us detail these terms. L0 is the usual MSSM SUSY Lagrangian, in standard notation:\n\u001b\n\u001aZ\ni\nh\nX Z\n2\nc\nc\nc\n4\n† Vi\nd θ μ H1 H2 + H2 Q U + Q D H1 + L E H1 + h.c.\nd θ Φ e Φ+\nL0 =\nΦ,H1,2\nZ\nX\n1\n+\nd2 θ Tr [ W α Wα ] + h.c.,\nΦ : Q, D c , U c , E c , L , (10)\n16 g2 κ\nSM groups\n\nκ is a constant canceling the trace factor and the gauge coupling g is shown explicitly.\n4\n\n\fThe SUSY breaking couplings originate from the MSSM fields couplings to the goldstino\nsuperfield; this is done by the replacement S → (1/f ) msof t Xnl [13], where S is the spurion, with S = θθ msof t and msof t is a generic notation for the soft terms (denoted below\n\nm1,2 , B, m0 ). One has for the Higgs sector\nZ\n\n†\nd4 θ Xnl\nXnl Hi† eVi Hi\ni=1,2 n\nh\n\u0010i\n\u0011i\nX\nDi\n1\nhi +\n=\nci |φX |2 |Dμ hi |2 + Fh†i Fhi + h†i\nψ hi σ μ Dμ ψhi − √ h†i λi ψhi + h.c.\n2\n2\n2\ni=1,2\n←\n−\n1 †\n1\n←\n−\n←\n−\n+ hi (Dμ + D μ ) hi ∂ μ |φX |2 + ψ X ψ hi ψX ψhi − [φ†X (∂ μ − ∂ μ ) φX ] [h†i (Dμ − D μ ) hi ]\n2\nh2 i\n←\n−\n1 †\n†\nμ\n+ − φX ψX σ ψ hi (Dμ − D μ )hi − √ φX ψX h†i λi hi − φ†X ψX Fh†i ψhi + φ†X FX Fh†i hi\n2\n2\n←\n−\ni\ni\ni\n†\n†\n+ (ψ X σ μ ψX ) (hi Dμ hi ) + (φX ∂μ φX ) (ψ hi σ μ ψhi ) + ψ X σ μ (∂μ − ∂ μ ) φX (h†i ψhi )\n2\n2\n2\no\ni h\n\u0010i\n\u0011i\n† μ\n†\n− ψ X FX ψ hi hi + h.c. + ∂μ φX ∂ φX + FX FX +\nψ X σ μ ∂μ ψX + h.c. | hi |2 , (11)\n2\n\nLH =\n\nX\n\nci\n\n−\n←\n− ←\nHere D, ∂, ( D , ∂ ) act only on the first field to their right (left) respectively and hi , ψhi , Fhi\n\ndenote SU(2) doublets. Also\n\nc1 = −m21 /f 2 ,\n\nc2 = −m22 /f 2 .\n\n(12)\n\nSimilar terms exist for all matter fields Q, U c , D c , L, E c :\nLm =\n\nX\nΦ\n\ncΦ\n\nZ\n\n†\nd4 θ Xnl\nXnl Φ† eV Φ,\n\ncΦ = −\n\nm2Φ\n,\nf2\n\nΦ : Q, U c , D c , L, E c ,\n\n(13)\n\nOne can eventually set mΦ = m0 (all Φ). The bi- and trilinear SUSY breaking couplings are\nZ\nB\nLAB =\nd2 θ Xnl H1 H2\nf Z\nZ\nZ\nAu\nAd\nAe\n2\nc\n2\nc\n+\nd θ Xnl H2 Q U +\nd θ Xnl Q D H1 +\nd2 θ Xnl L E c H1 + h.c.\nf\nf\nf\no\ni\nh\nBn\n=\nφX h1 .Fh2 + Fh1 .h2 − ψh1 .ψh2 − h1 .(ψX ψh2 ) − (ψX ψh1 ).h2 + FX h1 .h2\nf\nnA h\nu\nφX h2 .(φQ FU −ψQ ψU +FQ φU ) − φX (ψh2 .φQ ψU + ψh2 .ψQ φU − Fh2 .φQ φU )\n+\nf\ni\ni h\n− ψX (h2 .φQ ψU + h2 .ψQ φU + ψh2 .φQ φU ) + FX h2 .φQ φU − U → D, H2 → H1\nh\nio\n− U → E, H2 → H1 , Q → L + h.c.\n(14)\nwhere B ≡ B0 m0 μ. For simplicity, Yukawa matrices are not displayed; to recover them just\n\nreplace above and in formulae below any pair of fields φQ φU → φQ γu φU , φQ φD → φQ γd φD ,\nφL φE → φL γe φE ; similar for the fermions and auxiliary fields, with γu,d,e 3 × 3 matrices.\n5\n\n\fFinally, the supersymmetry breaking couplings in the gauge sector are\n3\nX\n\nZ\n1 2 mλi\nd2 θ Xnl Tr [ W α Wα ]i + h.c.\n2κ f\n16\ng\ni\ni=1\n3\nh\ni\nX\ni\nmλi n\n1\na\na\na\na\nφX 2 i λa σ μ ∆μ λ − F a μν Fμν\n+ D a D a − ǫμνρσ Fμν\nFρσ\n=\n2f\n2\n4 o\ni=1\n√\n√\nμν a a\na a\na a\n− 2ψX σ λ Fμν − 2 ψX λ D + FX λ λ\n+ h.c.\n\nLg =\n\ni\n\n(15)\n\nwith mλ1,2,3 the masses of the three gauginos and gauge group index i for U (1), SU (2), SU (3)\na\n\na\n\nc\n\nrespectively. Above we introduced the notation ∆μ λ = ∂μ λ − g tabc Vμb λ . Equations (1) to\n\n(15) define the model, with spontaneous supersymmetry breaking ensured by non-zero hFX i.\n\nSince φX ∼ 1/f , the Lagrangian contains terms of order higher than 1/f 2 . In the calcu-\n\nlation of the onshell Lagrangian we shall restrict the calculations to up to and including 1/f 2\n\nterms. This requires solving for Fφ of matter fields up to and including 1/f 2 terms and for\nFX up to and including 1/f 3 terms (due to its leading contribution which is -f ). Doing so, in\nthe final Lagrangian no kinetic mixing is present at this order. Using the expressions of the\nauxiliary fields, one then computes the F -part of the scalar potential of the Higgs sector, to\nfind:\ni\nh\n|f + (B/f ) h1 .h2 |2\nVF = |μ|2 |h1 |2 + |h2 |2 +\n+ O(1/f 3 )\n1 + c1 |h1 |2 + c2 |h2 |2\n\n(16)\n\n†\n+\n−∗ −\n2\n0∗ 0\nwith h1 .h2 ≡ h01 h02 − h−\n1 h2 and |h1 | ≡ h1 h1 = h1 h1 + h1 h1 , etc. One can work with this\n\npotential, however, for convenience, if |c1,2 ||h1,2 |2 ≪ 1, we can approximate VF by expanding\nthe denominator in a series of powers of these coefficients. Our analysis below is then valid\n\nfor |c1,2 ||h1,2 |2 ≪ 1. After adding the gauge contribution, we find the following result for the\nscalar potential of the Higgs sector:\nV\n\n\u0001\n\u0001\n\u0001\n= f 2 + |μ|2 + m21 |h1 |2 + |μ|2 + m22 |h2 |2 + B h1 .h2 + h.c.\n(17)\ni2 g 2\n2\n1\ng2 + g22 h\n+ 2 m21 |h1 |2 + m22 |h2 |2 + B h1 .h2 + 1\n|h1 |2 − |h2 |2 + 2 |h†1 h2 |2 + O(1/f 3 )\nf\n8\n2\n\nThis is the full Higgs potential. The first term in the last line is a new term, absent in MSSM\n(generated by eliminating FX of Xnl ). Its effects for phenomenology will be analyzed later.\nThe ignored higher order terms in 1/f involve non-renormalizable h61,2 interactions in V .\n\n6\n\n\f4\n\nNew couplings in the Lagrangian.\n\nIn this section we compute the new interactions induced by Lagrangian (9), which are not\npresent in the MSSM. Many of the new couplings are actually dimension-four in fields, with\na (dimensionless) f -dependent coupling. The couplings are important in the case of a low\nSUSY breaking scale in the hidden-sector and a light gravitino scenario. Some of the new\ncouplings also involve the goldstino field and are relevant for phenomenology.\nAs mentioned earlier in Section 3, from the SUSY breaking part of the Lagrangian only\nterms up to and including 1/f 2 were kept in the total Lagrangian given by equations (1) to\n(15). After eliminating all terms proportional to F -auxiliary fields of X, Hi , Q, D c , U c , E c , L,\none obtains new couplings Lnew beyond those of the usual onshell, supersymmetric part of\n\nMSSM, which are unchanged and not shown. One finds the onshell Lagrangian\naux\nextra\nLnew ≡ Laux\n+ Lextra\nF + LD + Lm\ng\n\n(18)\n\nLet us detail these terms. Firstly,\naux\nLaux\n= Laux\nF\nF (1) + LF (2)\n\n(19)\n\nwith\nh\n\u0001i\n2\n2\n2\n2\n2\n2\n2\nLaux\nF (1) = − f + m1 |h1 | + m2 |h2 | + mΦ |φΦ |\nh\ni\n1\n− B h1 .h2 + Au h2 .φQ φU + Ad φQ φD .h1 + Ae φL φE .h1 + mλi λi λi + h.c. (20)\n2\nrecovering the usual MSSM soft terms and the additional contributions:\nnψ ψ h\n\u0001\n\u0001\n\u0001\nX X\nμ m21 +m22 h1 .h2 − m21 +m2Q +m2D h1 .φQ φD − m21 +m2L +m2E h1 .φL φE\n2\n2f\n\u0001\n\u0001†\n\u0001\n− m22 + m2Q + m2U φQ φU .h2 + B h2 − Ad φQ φD − Ae φL φE μh2 − φQ φD − φL φE\n\u0001†\n\u0001\n\u0001†\n\u0001\n+ B h1 − Au φQ φU μ h1 − φQ φU + Ad φD h1 − Au h2 φU φD h1 − h2 φU\ni\no\n\u0001\n1\n+ Ad |φQ .h1 |2 + |φE h1 |2 + Au |h2 .φQ |2 + Ae |φL .h1 |2 + h.c. − 2 B h1 .h2\nf\n\u00012\nmλi\n2\n2\n2\nλi λi + m1 |h1 | +m2 |h2 |2 +m2Φ |φΦ |2\n+ Au h2 .φQ φU +Ad φQ φD .h1 +Ae φL φE .h1 +\n2\ni\n1 h 2\nm1 ψ X ψ h1 h1 + m22 ψ X ψ h2 h2 + m2Φ ψ X ψ Φ φΦ + h.c. + O(1/f 3 )\n(21)\n−\nf\n\nLaux\nF (2) =\n\nA summation is understood over the SM group indices: i = 1, 2, 3 in the gaugino term and\nover Φ = Q, U c , D c , L, E c in the mass terms; appropriate contractions among SU (2)L doublets\n7\n\n\fare understood for holomorphic products, when the order displayed is relevant. The leading\ninteractions O(1/f ) are those in the last line and are dimension-four in fields. Similar couplings\nexist at O(1/f 2 ) and involve scalar and gaugino fields. Yukawa matrices are restored in (21)\n\nby replacing φQ φD → φQ γd φD , φQ φU → φQ γu φU , φL φE → φL γe φE , as already explained.\n\nThere are also new couplings from terms involving the auxiliary components of the vector\n\nsuperfields of the SM. Integrating them out one finds:\n\u0001\n\u0001 i2\n−1 h\n1\n1\n√\nD̃1 +\nm\nψ\nψ\n+\nh.c.\nD̃\n+\nm\nψ\nλ\n+\nh.c.\nX\nX\n1\nX\n1\nλ\nλ\n1\n1\n2\n4 f2\n2f\nh\n\u0001 a\n\u0001 i2\n1\n1\n−1\na\n√\nD̃2a +\nD̃\n+\nm\nψ\nψ\n+\nh.c.\nm\nψ\nλ\n+\nh.c.\n+\nλ2 X X\nλ2 X 2\n2\n2\n4 f2\n2f\n\u0001 a\n\u0001 i2\n1\n1\n−1 h a\na\n√\nD̃3 +\nm\nψ\nψ\n+\nh.c.\nD̃\n+\nm\nψ\nλ\n+\nh.c.\n+ O(1/f 3 ) (22)\n+\nX\nX\nX\nλ\nλ\n3\n3\n3\n3\n2\n4 f2\n2f\n\nLaux\nD =\n\nwith the notation:\n\u0001\n1\nD̃1 = − g1 − h†1 h1 + h†2 h2 + 1/3 φ†Q φQ − 4/3 φ†U φU + 2/3 φ†D φD − φ†L φL + 2 φ†E φE\n2\n\u0001\n1\na\nD̃2 = − g2 h†1 σ a h1 + h†2 σ a h2 + φ†Q σ a φQ + φ†L σ a φL\n2\n\u0001\n1\na\n(23)\nD̃3 = − g3 φ†Q ta φQ − φ†U ta φU − φ†D ta φD\n2\nfor the MSSM corresponding expressions; here (ta /2) are the SU(3) generators. From (22) one\ncan easily read the new, f −dependent couplings in the gauge sector, absent in the MSSM.\n\nThe total Lagrangian also contains extra terms, not proportional to the auxiliary fields,\n\nand not present in the MSSM. In the matter sector these are:\nLextra\n=\nm\n−\n−\n+\n+\n−\n\n\u0011\n\u0010i\n1\nμ\n2\nψ\nσ\n∂\nψ\n+\nh.c.\n|∂\n(ψ\nψ\n)|\n+\nμ\nX\nμ\nX\nX\nX\n4f 2\n2\n2\nhi\nio\nn\n2\nX\nmi\ni\n†\nμ\nμ\n2\nψ\nψ\nψ\nψ\n+\nσ\nψ\n)\n(h\nD\nh\n)\n+\nψ\nσ\n∂\nψ\n+\nh.c.\n(ψ\n|h\n|\nX\nX\nμ\ni\nμ\nX\ni\nh\nX hi\nX\ni\ni\nf2\n2 X\n2\ni=1\n\u001a\nh\ni\ni\nB h 1\nm2i → m2Φ , Hi → Φ +\nψX ψX ψh1 .ψh2 − h1 .(ψX ψh2 ) − (ψX ψh1 ).h2\nf 2f\n\u0001\nAu h 1\nψX ψX h2 .ψQ ψU + ψh2 .φQ ψU + ψh2 .ψQ φU − ψX (h2 .φQ ψU + h2 .ψQ φU\nf 2f\ni hA \u0010 1\nd\nψh2 .φQ φU ) +\nψX ψX (ψQ ψD .h1 + φQ ψD .ψh1 + ψQ φD .ψh1 )\nf 2f\n\u001b\n\u0011\ni\nψX (φQ ψD .h1 + ψQ φD .h1 +φQ φD .ψh1 ) +(D → E, L → Q) +h.c. +O(1/f 3 ). (24)\n\nNote the presence of interactions that are dimension-four in fields (B/f h1 ψX ψh2 , etc) that\ncan be relevant for phenomenology at low f . There are also new couplings in the gauge sector\n\n8\n\n\fLextra\ng\n\n3\n\u0011\nX\ni\nmλi h ψX ψX \u0010\n1 a a μν\na\na\na\n2 i λa σ μ ∆μ λ − Fμν\nF\n− ǫμνρσ Fμν\nFρσ\n=\n2f\n−2 f\n2\n4\ni=1\ni\n√\na\n+ h.c. + O(1/f 3 ),\n−\n2 ψX σ μν λa Fμν\n\n(25)\n\ni\n\nwith i = 1, 2, 3 the gauge group index and σ μν = i/4 (σ μ σ ν −σ ν σ μ ). The new couplings of Lnew\n\ntogether with the onshell part of the purely supersymmetric part of the MSSM Lagrangian\n(onshell L0 of (10)) gives the final onshell effective Lagrangian of the model. From this, the\n\nfull scalar potential is identified.\n\n5\n\nImplications for the Higgs masses.\n\nLet us consider the Higgs scalar potential found in (17) and analyze the implications for the\nHiggs masses. From the neutral Higgs part of potential one finds the masses of the CP even\nand CP odd Higgs fields. Exact values (in 1/f ) can be found (see the Appendix), but since\neq. (17) is valid up to 1/f 4 terms, it is sufficient to present the expressions of the Higgs masses\nthat are valid up to this order. Firstly, at the minimum of the scalar potential one has:\nm21\nm21\n\n−\n\nm22\n\n+\n\nm22\n\n\u0015\n√\nf 2 (−1 + w0 )(−B + m2Z sin 2β)\n= cot 2β B + 2\nv 2μ2 + m2Z cos2 2β + B sin 2β\n\u0014\n\n=\n\n1\nsin 2β\n\n\u0014\n\n\u0015\n√\nf 2 (−1 + w0 )(B + 2 μ2 sin 2β)\n−B+ 2\nv 2μ2 + m2Z cos2 2β + B sin 2β\n\n(26)\n\nwhere\nw0 ≡ 1 −\n\n\u0001\nv2\n4 μ2 + 2 m2Z cos2 2β + 2 B sin 2β\n2\nf\n\nThere is a second solution for m21,2 at the minimum (with minus in front of\n\n(27)\n√\n\nw 0 ) which\n\nhowever is not a perturbation of the MSSM one and not considered below (since it brings a\nshift proportional to f of the soft masses, which invalidates the expansion in m21,2 /f ). One\nfinds the following results (upper sign for m2h and lower sign for m2H ):\nm2h,H\n\nh\ni\n√ i\n1 h 2\n−2 B\nv2 n\n2\n2\n2\n=\nm +\n∓ w1 +\n4 B 2B + (4μ + 2mZ cos 2β)/ sin 2β\n2 h Z sin 2β\n32f 2\ni\n+ 4 2 B 2 + 8 μ4 + 2 m2Z (4μ2 + m2Z ) cos2 2β + 8 B μ2 sin 2β\n\u0001\ncsc2 2β h\n− 2 (B 2 + 4μ4 )m2Z + 4μ2 m4Z + m6Z + 8 2μ4 m2Z − B 2 (4μ2 + m2Z ) cos 4β\n∓ √\nw1\n\n− m2Z (6 B 2 + 8μ4 + 4μ2 m2Z + m4Z ) cos 8β − 8 B (B 2 − 8μ4 ) sin 2β\nio\n+ B(−8B 2 + 16μ2 m2Z + m4Z ) sin 6β + Bm4Z sin 10β + O(1/f 3 )\n9\n\n(28)\n\n\fwith\nw1 =\n\n\u0010 −2 B \u0011\n\u0010\n−2 B \u00112\ncos2 2β\n− 4 m2Z\nm2Z +\nsin 2β\nsin 2β\n\n(29)\n\nFurther, the mass mA of the pseudoscalar Higgs has a simple form (no expansion):\nm2A\n\n=\n\n−2 B\nsin 2β\n\n\u001a\n\n3 1 √\nv2\n+\nB sin 2β\nw0 −\n4 4\n4 f2\n\n\u001b\n\n(30)\n\nand, as usual, the Goldstone mode has mass mG = 0.\nIt is instructive to consider the limit of large u ≡ tan β, with B < 0 fixed, when\ni\ni\nv2 h\n4\n2\n2\n2\n2\n2 2\nm2Z + O(1/u) +\nB\n(2\nμ\n+\nm\n)\n+\nO(1/u\n)\n+ O(1/f 3 ) (31)\n(2\nμ\n+\nm\n)\n+\nZ\nZ\n2 f2\nu\nh −2B\ni v2 B h\ni\n1\n2\n2\n2\n2\n2\nm2H =\n+O(1/u) +\n(2\nμ\n−11m\n)+O(1/u\n)\n+O(1/f 3 )\n(2\nμ\n+\nm\n)\nu+4\nB\n+\nZ\nZ\nsin 2β\n4 f2\nu\nm2h =\n\nh\n\nwhich shows that a large μ can increase mh (decrease mH ). However, for phenomenology it is\ncustomary to use mA as an input instead of B, in which case the masses mh,H take the form\nm2h,H\n\n√ i\nv2 1 h\n1h 2\n√ 16m2A μ4 + 4 m2A μ2 m2Z + (m2A − 8 μ2 ) m4Z\nmA + m2Z ∓ w ±\n2\n16f 2 w\n√\n− 2 m6Z ± 2 (−2 m2A μ2 + 8μ4 + 4μ2 m2Z + m4Z ) w + m2A m4Z cos 8β\n\u0002\n+ m4A (m2A −8μ2 −3m2Z ) sin2 2β +cos 4β − 2m2Z (8μ4 +4μ2 m2Z +m4Z −m2A (6μ2 +m2Z ))\n\u0003i\n√\n+ O(1/f 3 )\n(32)\n± 2 (2 m2A μ2 + 4μ2 m2Z + m4Z ) w − m2A (m2A + 5 m2Z ) sin2 2β\n\n=\n\nwhere the first term (bracket) is just the MSSM contribution. The upper (lower) signs correspond to mh (mH ) and w = (m2A + m2Z )2 − 4 m2A m2Z cos2 2β. At large tan β with mA fixed\none finds3 (with u ≡ tan β)\n\ni\ni\nv2 h\n2\n2 2\n2\nm2Z + O(1/u2 ) +\n(2\nμ\n+\nm\n)\n+\nO(1/u\n)\n+ O(1/f 3 )\nZ\n2 f2\nh\ni\n1\n= m2A + O(1/u2 ) + 2 O(1/u2 ) + O(1/f 3 )\nf\n\nm2h =\nm2H\n\nh\n\n(33)\n\nIn this limit the increase of mh is driven by a large μ and apparently is of SUSY origin, but\nthe quartic Higgs couplings giving this effect involved combinations of soft masses (see (17)).\nThese soft masses combined to give, at the EW minimum, the μ-dependent increase in (33)4 .\n3\n4\n\nIn (33) mA > mZ is assumed, otherwise just exchange m2h with m2H .\nSee also λ of (34) evaluated at EW minimum, δ = 0, tan β → ∞: λ → (1/2v 2 )[m2Z + v 2 (m2Z + 2μ2 )2 /(2f 2 )].\n\n10\n\n\f150\n\n150\n\n140\n\n140\n\n130\n\n130\n\n120\n\n120\n\n110\n\n110\n\n100\n\n100\n\n90\n\n90\n\n80\n1500\n\n2000\n\n2500\n\n3000\n\n3500\n\n4000\n\n4500\n\n80\n1500\n\n5000\n\n√\n(a) mh in function of f , mA parameter\n\n150\n\n140\n\n140\n\n130\n\n130\n\n120\n\n120\n\n110\n\n110\n\n100\n\n100\n\n90\n\n90\n\n2000\n\n4000\n\n6000\n\n8000\n\n2500\n\n3000\n\n3500\n\n(b) mH in function of\n\n150\n\n80\n\n2000\n\n80\n\n10 000\n\n√\n(c) mh in function of f , μ parameter\n\n2000\n\n4000\n\n√\n\n4000\n\n4500\n\n5000\n\nf , mA parameter\n\n6000\n\n8000\n\n10 000\n\n√\n(d) mh in function of f , μ parameter\n0.06\n\n0.12\n0.05\n\n0.10\n\n0.04\n\n0.08\n0.06\n\n0.03\n\n0.04\n\n0.02\n\n0.02\n\n0.01\n\n0.00\n1000\n\n2000\n\n3000\n\n4000\n\n5000\n\n0.00\n1000\n\n6000\n\n2000\n\n3000\n\n4000\n\n5000\n\n6000\n\n√\n(f) c2 v in function of f\n\n√\n(e) c1 v 2 in function of f\n\n2\n\n√\nf (in\nGeV). In (a), (b) μ = 900 GeV, tan β = 50, mA increases upwards from 90 to 150 GeV in steps of\n√\n10 GeV. The increase of mh is significant even at larger f , if one increases μ, as seen in (c), (d).\nIn figs. (c), (d), mA = 150 GeV and mh increases as μ varies from 400 to 3000 GeV in steps of 100\nGeV. In (c) tan β = 50 while in (d) tan β = 5, showing a milder dependence on tan β than in MSSM.\nFor tan β ≥ 10 there is little difference from (c). In (e), (f) the expansion coefficients are shown, for\nmA = [90, 650] GeV with steps of 10 GeV, μ = 900 GeV, tan β = 50; they are always less than unity,\n√\neven at larger values of f or μ shown in (c), (d), as required for a convergent expansion.\n\nFigure 1: The tree-level Higgs masses (in GeV) and expansion coefficients as functions of\n\n11\n\n\fSome simple numerical examples are relevant for the size of the corrections to the Higgs\nmasses, relative to their MSSM values. The largest correction to mh for large tan β is dom√\ninated by μ and f (eq. (33)). For example, if (μ/ f )2 = (1/2.25)2 ≈ 1/5, v = 246 GeV,\n√\nwith μ = 900 GeV then f = 2 TeV, giving mh = 114.4 GeV. Other examples are: (μ = 1.2\n√\n√\nTeV, f = 2.7 TeV) and (μ = 2.6 TeV, f = 6 TeV), leading to mh = 114.4 GeV (with\n√\n(μ/ f )2 ≈ 1/5). Smaller μ ≈ 600 GeV can still allow mh just above the LEP bound if\n√\n√\nf = 1.35 TeV, for similar value for (μ/ f )2 = 1/5 and for the rest of the parameters. This\nshows that one can have a classical value of mh near or marginally above the LEP bound and\nlarger than the classical MSSM value (= mZ ). The plots in Figure 1 illustrate better the value\n√\n√\nof mh and mH for various values of f . For f in the region of 1.5 TeV to 7 TeV the LEP\n√\n√\nbound is satisfied for mh , while at larger f the MSSM case is recovered. By varying f\nour results can interpolate between low and high scale (in the hidden sector) SUSY breaking.\nQuantum corrections increase mh further, just as in the MSSM.\nRegarding the usual MSSM tree-level flat direction |h01 | = |h02 | one can show that the\n\npotential in this direction can have a minimum for the case (not considered in MSSM) of\n\nm21 + m22 + 2|μ|2 < 2|B|, equal to Vm = f 2 − (1/4)f 2 (m21 + m22 + 2|μ|2 + 2B)2 /(m21 + m22 + B)2 .\n\nCompared to the usual MSSM minimum, the former can be situated above it only for values\n\nof f which do not comply with the original assumptions of m21,2 , |B| < f . On the other hand,\n\nthe case with Vm situated below the MSSM minimum does not allow one to recover the MSSM\n\nground state in the decoupling limit of large f , and in conclusion the \"flat\" direction is not\nof physical interest here.\n\n6\n\nOther phenomenological implications.\n\n6.1\n\nFine-tuning of the electroweak scale\n\nThe increase of mh , at the classical level, beyond the MSSM tree-level bound (mZ ) and the\npresence of the new quartic couplings of the Higgs fields also have implications for the fine\ntuning. In the MSSM the smallness of the effective quartic coupling λ (fixed by the gauge\nsector) is at the origin of an increased amount of fine tuning of the electroweak scale for large\nsoft masses. For soft masses significantly larger than the electroweak (EW) scale, (also needed\nto increase the MSSM value for mh above LEP bound via quantum corrections), fine tuning\nincreases rapidly5 and may become a potential problem (sometimes referred to as the \"little\nhierarchy\" problem). Let us see why in the present model this problem is alleviated. One can\n5\n\nTwo-loop MSSM fine tuning [23] is minimized at mh ∼ 115 GeV (consistent with EW and dark matter\nconstraints); however, beyond this value, fine tuning increases exponentially with mh .\n\n12\n\n\fwrite v 2 = −m2 /λ where\ni\n1\ng12 + g22 h\ncos2 2β + δ sin4 β + 2 m21 cos2 β + m22 sin2 β + (1/2) B sin 2β\n8\nf\n2\n2\n2\n2\n2\n≡ (|μ| + m1 ) cos β + (|μ| + m2 ) sin2 β + B sin 2β\n\nλ ≡\nm2\n\n2\n\n(34)\n\nThe first term in λ is due to MSSM only, while the second one, which is positive, is due to\nthe new quartic Higgs terms in (17). Here δ accounts for the top/stop quantum effects to\n|h2 |4 term in the potential, which becomes (1 + δ) (g12 + g22 )/8 |h2 |4 ; usually δ ∼ O(1) (ignoring\n\ncouplings other than top Yukawa). This quantum effect is only included for a comparison to\nthe new quartic Higgs term. The important point to note is that a larger λ gives a suppression\nin the fine tuning measure ∆:\n∆=\n\n∂ ln v 2\n∂ ln(−m2 /λ)\n=\n,\n∂ ln p\n∂ ln p\n\np = A, B, m20 , μ2 , m2λi .\n\n(35)\n\nHere p is an MSSM parameter with respect to which fine tuning is evaluated. In the large\ntan β limit, the fine tuning of the electroweak scale becomes (see the Appendix in [19]):\n∆=−\n\n(|μ|2 + m22 )′\n+ O(1/ tan β),\nv 2 m42 /f 2 + (1 + δ) m2Z /2\n\n(|μ|2 + m2 )′ ≡\n\n∂(|μ|2 + m22 )\n∂ ln p\n\n(36)\n\nFor small tan β a similar result is obtained in which one replaces m2 by m1 . The first term in\ndenominator comes from the new correction to the effective quartic coupling λ. Larger soft\nmasses m1,2 increase λ and this can actually reduce fine tuning, see the denominator in ∆.\nTherefore, in this case heavier superpartners do not necessarily bring an increased fine tuning\namount (as it usually happens in the MSSM). The only limitation here is the size of the ratio\nm21,2 /f ≤ 1 for convergence of the nonlinear formalism. In the limit this coefficient approaches\n\nits upper limit (say ∼ 1/3), the two contributions in the denominator have comparable size\n\n(for δ ∼ 1 and v = 246 GeV) and fine tuning is reduced by a factor ≈ 2 from that in the\n\nabsence of the new term in the denominator (i.e. the MSSM case).\n\n6.2\n\nLimiting cases and loop corrections.\n\nSome interesting limits of our \"non-linear\" MSSM model are worth considering. Firstly, in\nthe limit of large f (i.e. large SUSY breaking scale in the hidden sector) and with m1,2 , B\nfixed, the new quartic term in (17) vanishes, while the usual explicit soft SUSY breaking\nterms specific to the Higgs sector remain. This is just the MSSM case. All other couplings\nsuppressed by inverse powers of f are negligible in this limit. Another limiting case is that\nof very small f . For our analysis to be valid, one needs to satisfy the condition B, m21,2 ≤ f.\n\nWhen f reaches this minimal bound, the new quartic couplings in (17), not present in the\n13\n\n\fMSSM, increase and eventually become closer to unity. The analysis is then less reliable and\nadditional effective contributions in the Lagrangian, suppressed by higher powers like 1/f 4\nand beyond, may become relevant for SUSY breaking effects.\nFinally, one remark regarding the calculation of radiative corrections using (17) and the\nelectroweak symmetry breaking (EWSB). In our case EWSB was assumed to take place by\nappropriate values of m21,2 , B. However, the same EWSB mechanism as in the MSSM is at\nwork here, via quantum corrections to these masses, which near the EW scale turn m22 + μ2\nnegative and trigger radiative EWSB. Indeed, if the loops of the MSSM states are cut off\n√\nas usual at the high GUT scale (well above f ) and with the new Higgs quartic couplings\nregarded as an effective, classical operator, radiative EWSB can take place as in the MSSM.\nA similar example is the case of a MSSM Higgs sector extended with additional effective\nR\noperators of dimension d = 5 such as (1/M ) d2 θ(H1 H2 )2 giving a dimension-four (in fields)\n\ncontribution to the scalar potential V ⊃ (μ/M )h1 h2 (|h1 |2 + |h2 |2 ); this is regarded as an\n\neffective operator and radiative EWSB is implemented as in the MSSM, see for example\n\n[18, 19]. The advantage in our case is that no \"new physics\" (scale M ) is introduced in\n√\nthe visible sector. In both cases, the new scale M and our scale f have comparable values,\nbecause in both cases the increase of mh above the LEP bound is done via couplings depending\n√\non the ratio (μ/M ) [17, 18, 19, 20, 21] or (μ/ f ), respectively.\nIt is interesting to remark that that the loop corrections induced by the (effective) quartic\ncouplings proportional to 1/f 2 in eq.(17), can be under control at large f . Indeed, the\nloop integrals this coupling induces can be quadratically divergent and are then cut-off at\nmomentum p2 ≤ f ; but the loop effects come with a coupling factor that behaves like 1/f 2 ,\nso overall they will be suppressed like 1/f and can then be under control even at large f (for\na discussion of loop corrections involving the goldstino, see [24]).\n\n6.3\n\nInvisible decays of Higgs and Z bosons.\n\nLet us analyze some implications of the interactions involving the goldstino field, described by\nthe Lagrangian found above. An interesting possibility, for a light enough neutralino, is the\ndecay of the neutral higgses into a goldstino and the lightest neutralino χ01 (this is the NLSP,\nwhile goldstino is the LSP). The coupling Higgs-goldstino-neutralino is only suppressed by\n1/f . It arises from the following terms in Lnew and from the terms in the onshell, SUSY part\n\nof usual MSSM Lagrangian (10), hereafter denoted Lonshell\n:\n0\n\ni B h\ni\n1 h 2\nm1 ψX ψh01 h01 ∗ + m22 ψX ψh02 h02 ∗ −\nψX ψh02 h01 + ψX ψh01 h02\nf\nf\nih\ni\nh\nX\nmλi a\n1\n1\n√ D̃i ψX λai − √ g2 λ32 − g1 λ1 h01 ∗ ψh0 − h02 ∗ ψh0 + h.c. (37)\n1\n2\nf\n2\n2\ni=1,2\n\nLnew + Lonshell\n⊃−\n0\n−\n\n14\n\n\fThe last term (present in the MSSM) also brings a goldstino interaction. This is possible\nthrough the goldstino components of the higgsinos ψh01,2 and EW gauginos λ1,2 . The goldstino\ncomponents are found via the equations of motion, after EWSB, to give (see also [13]):\nμ ψh01 =\nμ ψh02 =\nλ1 =\n\n1 \u0010\n√\n− m22 v2 − B v1 −\nf 2\n1 \u0010\n√\n− m21 v1 − B v2 +\nf 2\n−1\n√ hD1 i ψX + * * * ,\nf 2\n\n\u0011\n1\nv2 hg2 D23 − g1 D1 i ψX + * * *\n2\n\u0011\n1\nv1 hg2 D23 − g1 D1 i ψX + * * *\n2\n−1\nλ32 = √ hD23 i ψX + * * *\nf 2\n\n(38)\n\nwhich can be further simplified by using the MSSM minimum conditions in the terms multiplied by 1/f (allowed in this approximation). As a consistency check we also showed that\nthe determinant of the neutralino mass matrix (now a 5 × 5 matrix, to include the Goldstino)\n\nvanishes up to corrections of order O(f −4 ). This is consistent with our approximation for\n\nthe Lagrangian, and verifies the existence of a massless Goldstino (ultimately \"eaten\" by the\ngravitino). Using (37) and (38), one finds after some calculations (for previous calculations of\nthis decay see [25, 28, 29]):\n\nL\n\nnew\n\n+ Lonshell\n0\n\n4\ni\n1 X h\n∗\n∗\n√\n+ h.c.\n+ ψX χ0j h0 δk′ Zjk\nψX χ0j H 0 δk Zjk\n⊃−\nf 2 j,k=1\n\n(39)\n\nwhere\n\u0002\n\u0003\nmZ sin θw mλ1 cos(α + β) + μ sin(α − β) ,\n\u0002\n\u0003\n= −mZ cos θw mλ2 cos(α + β) + μ sin(α − β) ,\n\nδ1 =\nδ2\n\nδ3 = −m2A sin β sin(α − β) − μ2 cos α\nδ4 =\n\nm2A cos β sin(α − β) − μ2 sin α,\n\nδi′ = δi\n\nα→α+π/2\n\n(40)\n\nZ is the matrix that diagonalizes the MSSM neutralino mass matrix6 : Md2 = Z M M † Z † ,\nand can be easily evaluated numerically (see [27] for its analytical expression). Further H 0 , h0\n√\nare Higgs mass eigenstates (of mass mh,H computed earlier) and h0i = 1/ 2 (vi + h0i ′ + iσi )\n′\n\nwith hh0i ′ i = 0, hσi i = 0; the relation of H 0 , h0 to h01,2 is a rotation, which in this case can be\n6\n\nThe exact form of M is: M11 = mλ1 , M12 = 0, M13 = −mZ cos β sin θw , M14 = mZ sin β sin θw , M21 = 0,\nM22 = mλ2 , M23 = mZ cos β cos θw , M24 = −mZ sin β cos θw , M33 = 0, M34 = μ, M44 = 0, also Mij = Mji .\nNote the sign of μ related to our definition of the holomorphic product of SU(2) doublets. With this notation,\nin the text χ0j = Zjk ξk , with ξkT ≡ (λ1 , λ32 , ψh01 , ψh02 ).\n\n15\n\n\fjust that of the MSSM (due to extra 1/f suppression in the coupling7 ). The angle α is\ntan 2α = tan 2β\n\nm2A + m2Z\n,\nm2A − m2Z\n\n−π/2 ≤ α ≤ 0\n\n(41)\n\nIf the lightest neutralino is light enough, mχ01 < mh , then h0 , H 0 can decay into it and a\ngoldstino which has a mass of order f /MP lanck ∼ 10−3 eV; if this is not the case, the decay of\n\nneutralino into h0 and goldstino takes place, examined in [29]. In the former case, the partial\ndecay rate is\n\nΓh0 →χ01 ψX\n\n4\nX\nmh\nδk′ Z1k\n=\n16 π f 2\nk=1\n\n2\n\n\u0012\n\n1−\n\nm2χ0 \u00132\n1\n\nm2h0\n\n(42)\n\nThe partial decay rate has corrections coming from both higgsino (Z13 , Z14 ) and gaugino\nfields (Z11 , Z12 ), since they both acquire a goldstino component, see eqs. (38). The gaugino\n\ncorrection arises after gaugino-goldstino mixing, SUSY and EW symmetry breaking, (as shown\nby mλi , mZ dependence in δk′ ) and was not included in previous similar studies [25, 28, 29].\nThe partial decay rate is presented in Figure 2 for various values of μ, mA and mλ1,2 which\n\nare parameters of the model. A larger decay rate requires a light μ ∼ O(100) GeV, when the\nneutralino χ01 has a larger higgsino component. At the same time an increase of mh above\n√\nthe LEP bound requires a larger value for μ, close to μ ≈ 700 GeV if f ≈ 1.5 TeV, and\n√\nμ ≈ 850 GeV if f ≈ 2 TeV, see Figure 1 (c). The results in Figure 2 show that the partial\ndecay rate can be significant (∼ 3 × 10−6 GeV), if we recall that the total SM Higgs decay rate\n\n(for mh ≈ 114 GeV) is about 3 × 10−3 GeV, with a branching ratio of h0 → γγ of 2 × 10−3 ,\n(Figure 2 in [26]). Thus the branching ratio of the process can be close to that of SM h0 → γγ.\n\nThe decay is not very sensitive to tan β (Figure 2 (b)), due to the extra contribution (beyond\nMSSM) from the quartic Higgs coupling. It would be interesting to analyze the above decay\nrate at the one-loop level, for a more careful comparison to SM Higgs decays rates.\nAn interesting coupling that is also present in the 1/f order is that of goldstino to Zμ\nboson and to a neutralino. Depending on the relative mass relations, it can bring about a\ndecay of Zμ (χ0j ) into χ0j (Zμ ) and a goldstino, respectively. The relevant terms are\no\n1\n1\nψ h01 σ μ ψh01 (g2 V23 − g1 V1 )μ + ψ h02 σ μ ψh02 (g2 V23 − g1 V1 )μ\n4\n4\n2\nX\nm\na\n√ λi ψX σ μν λai Fμν,\n−\n(43)\ni + h.c.\n2\nf\ni=1\n\n⊃ −\nLnew + Lonshell\n0\n\n7\n\n′\n\n′\n\nThe relation is h01 = H 0 cos α − h0 sin α, and h02 = H 0 sin α + h0 cos α.\n\n16\n\n\f10-5\n\n10-5\n\n10-6\n\n10-6\n\n10-7\n\n10-7\n\n10-8\n\n10-8\n\n10-9\n\n10-9\n\n10-10\n\n2000\n\n4000\n\n(a) Γh0 →χψx\n\n6000\n\n8000\n\n10-10\n\n10 000\n\n√\nin function of f .\n\n2000\n\n4000\n\n6000\n\n8000\n\n(b) Γh0 →χψx in function of\n\n√\n\n10 000\n\nf.\n\nFigure 2: The partial decay rate of h0 → ψX χ01 for (a): tan β = 50, mλ1 = 70 GeV, mλ2 = 150 GeV,\n\nμ increases from 50 GeV (top curve) by a step 50 GeV, mA = 150 GeV. Compare against Figure 1\n(c) corresponding to a similar range for the parameters. At larger μ, mh increases, but the partial\ndecay rate decreases. Similar picture is obtained at low tan β ∼ 5. (b): As for (a) but with tan β = 5.\nCompare against Figure 1 (d). Note that the total SM decay rate, for mh ∼ 114 GeV, is of order 10−3 ,\nthus the branching ratio in the above cases becomes comparable to that of SM Higgs going into γγ\n(see Figure 2 in [26]).\n\nwhere the last term was generated in (25) (i labels the gauge group). Since the higgsinos\nacquired a goldstino component (∝ ψX /f ) via mass mixing, the first line above induces\nadditional O(1/f ) couplings of the higgsino to goldstino and to Zμ = (1/g) (g2 V23 − g1 V1 )μ\n\nwith g2 = g12 + g22 . After some calculations one finds the coupling Zμ χ0j ψX :\nL\n\nnew\n\n=\n+Lonshell\n0\n\n\u0015\n4 \u0014\n\u0001\n1 X\nμ 0\nμ ν\nν μ 0\n2\n√\nψ X σ χj Zμ μ mZ wj −mZ vj −ψ X (σ ∂ −σ ∂ )χj Zμν vj +hc(44)\nf 2 j=1\n\nwhere\n∗\n∗\nwj = cos β Zj4\n− sin β Zj3\n,\n\n∗\n∗\nvj = − sin θw Zj1\n+ cos θw Zj2\n,\n\nZμν = ∂μ Zν − ∂ν Zμ\n\n(45)\n\nIf mχ01 is lighter than Zμ then a decay of the latter into χ01 + ψX is possible. The decay rate\nof this process is (with j = 1):\nΓZ→ψX χ0\nj\n\n=\n\ni\u0010\nm2χj \u00112\nm5Z h\n2\n2\n∗\n∗\nζ\n|w\n|\n+\nζ\n|v\n|\n+\nζ\n(w\nv\n+\nw\nv\n)\n1\n−\n1 j\n2 j\n3\nj j\nj j\n32πf 2\nm2Z\n\n(46)\n\nwith ζ1 = 2(2 + r 2 ) μ2 /m2Z , ζ2 = 2(8 + r 2 )(1 + 2r 2 ), ζ3 = −2(4 + 5r 2 )μ/mZ where r = mχj /mZ\n\n(in (44) and subsequent one can actually replace μ by mχj and wj → wj∗ , with Zj4 ↔ Zj3 ).\n\nThe decay rate should be within the LEP error for ΓZ , which is 2.3 MeV [30] (ignoring\n√\ntheoretical uncertainties which are small). From this, one finds a lower bound for f , which\n17\n\n\fcan be as high as\n\n√\n\nf ≈ 700 GeV for the parameter space considered previously in Figure 1,\n√\nwhile generic values are f ∼ O(400) GeV. Therefore the results for the increase of mh ,\n√\nthat needed a value for f in the TeV region, escape this constraint. This constraint does\nnot apply if the lightest neutralino has a mass larger than mZ , when the opposite decay\n(χj → Z ψX ) takes place (this can be arranged for example by a larger mλ1 ).\n\nThere also exists the interesting possibility of an invisible decay of Zμ gauge boson into a\n\npair of goldstino fields, that we review here [6, 13, 15]. This is induced by the following terms\nin the Lagrangian, after the Higgs field acquires a VEV:\nL\n\nnew\n\n+\n\nLonshell\n0\n\nn 1\n⊃\nψ σ μ ψX (g2 V23 − g1 V1 )μ (m21 v12 /2 − m22 v22 /2)\n4 f2 X\no\n1\n1\nμ\n3\nμ\n3\nψ 0 σ ψh01 (g2 V2 − g1 V1 )μ + ψ h02 σ ψh02 (g2 V2 − g1 V1 )μ + h.c.(47)\n−\n4 h1\n4\n\nWith (38) and (47) one finds the coupling of Z boson to a pair of goldstinos:\nLnew + Lonshell\n⊃\n0\n\nm2Z\nψ σ μ ψX Zμ hDZ i + h.c.\n4 f2 X\n\n(48)\n\nwhere hDZ i ≡ cos θW hD23 i − sin θW hD1 i = −(m2Z /g) cos 2β + O(1/f ). The decay rate is then\nΓZ→ψX ψX\n\n=\n\n\u0014 4 \u00152\nmZ\nmZ\ncos2 2β\n2\n24 π g 2 f 2\n\n(49)\n\nin agreement with previous results obtained for B = 0 [6, 13, 15]. The decay rate is independent of mA and should be within the LEP error for ΓZ (2.3 MeV [30]). One can then\neasily see that the increase of the Higgs mass above the LEP bound (114.4 GeV) seen earlier\nin Figure 1 is consistent with the current bounds for this decay rate, which thus places only\nmild constraints on f , below the TeV scale (≈ 200 GeV) [6, 15].\nSimilarly, Lnew can also induce Higgs decays into goldstino pairs. The terms in Lnew that\n\naux\nextra together with the MSSM higgsino-Higgscontribute to Higgs decays are Laux\nF (2) , LD , Lm\n\ngaugino coupling (last term in (37)). After using (38), expanding the Higgs fields about their\nVEV, one finds:\n⊃\nLnew + Lonshell\n0\n\nh\ni\nμv 2\n0′\n0′\nm\ncos\n2β\nh\nsin\nβ\n−\nh\ncos\nβ\n+ h.c. + O(1/f 3 )\nψ\nψ\nX X\n1\n2\n4 f2 A\n\n(50)\n\nwhich, similarly to Z couplings, is independent of gaugino masses. Here v = 246 GeV and\n√\nh0i = 1/ 2 (vi + h0i ′ + iσi ), hh0i ′ i = 0, hσi i = 0. In the mass eigenstates basis one simply\n\u0002\n\u0003\nreplaces the square bracket in (50) by H 0 sin(β − α) − h0 cos(β − α) . One can also replace\n18\n\n\fmA by m2A = m2h + m2H − m2Z + O(1/f 2 ), where the Higgs masses can be taken to be the\n\nMSSM values (up to higher order corrections in 1/f ). The decay rate of h0 into a pair of\ngoldstinos is then\nΓh0 →ψX ψX =\n\nmh 2\ng 0\n8π f 4 h ψX ψX\n\n(51)\n\nwhere gh0 ψX ψX is the coupling of h0 ψX ψX of the above Lagrangian. For relevant values of f\nabove ∼1 TeV it turns out that this decay rate is very small relative to other partial decay\n\nrates of the Higgs in the MSSM/SM. For example, for a total decay rate near 10−3 GeV (valid\n\nnear a Higgs mass of order O(100) GeV), the branching ratio of this decay mode is well below\n\nthe usual ones and below that of SM Higgs going into γγ, by a factor ≈ 10−3 − 10−2 .\n\n7\n\nConclusions\n\nIn this work we performed a model independent analysis of the consequences of a light goldstino (of mass ∼ f /MP lanck ) and investigated its couplings to the MSSM superfields. This\n√\nwas done by treating f as a free parameter that can be as low as few times the soft SUSY\nbreaking scale msof t ∼ TeV. The formalism parametrized but did not predict the soft masses,\n\nassumed to be fixed (near the TeV scale) by an otherwise arbitrary SUSY breaking sector.\n\nThe goldstino couplings can be determined by non-linear supersymmetry. Above the msof t\nscale, one has the usual MSSM superfields and the goldstino couples to them, while below this\nscale the SM superpartners are integrated out and one is left with the goldstino coupled to\nSM fields. Both these cases can actually be treated using constrained superfields, where the\nconstraints effectively integrate out the corresponding superpartners in terms of light degrees\n√\nof freedom. For energy regimes E ∼ msof t ≤ f the only constrained superfield is that\nof goldstino, which couples to the MSSM superfields via the soft terms. Below this energy\n\nregime additional constraints should be imposed on the MSSM superfields themselves. If\n√\nsupersymmetry breaking scale is low f ∼ few TeV, the goldstino couplings to the MSSM\nbecome important. In this paper the leading couplings of all MSSM fields to the goldstino\n\nwere computed to 1/f 2 order, and these can be used for phenomenological studies. In the\nlimit the hidden sector SUSY scale is large with fixed soft masses, the MSSM with explicit\nsoft breaking terms is recovered.\nA significant impact of the aforementioned couplings turned out to be in the Higgs sector\nof the MSSM. It was noticed that the usual MSSM scalar potential acquires additional terms\ninvolving Higgs quartic couplings, with coefficients depending on the ratio of the soft masses\n√\nto the 'hidden' sector SUSY breaking scale ( f ). The presence of these couplings, effectively\ngenerated by integrating out the sgoldstino via its superfield constraint, can have a significant\n19\n\n\fimpact for the Higgs mass and electroweak scale fine-tuning of the MSSM and these were\ninvestigated in detail.\nThe masses of the CP even and CP odd higgses were computed to order 1/f 2 . It was shown\nthat for a low scale of SUSY breaking, the SM-like Higgs mass mh is increased, to reach and\n√\ncross the LEP bound, already at the tree level. For values of f between 1.5 TeV to 7 TeV one\nobtains a value of mh above the LEP bound. The correction increases with μ and can remain\nsignificant even above this energy range. As in the MSSM, quantum corrections increase mh\nfurther. The quartic Higgs coupling was also increased by an additional (effective) contribution\nrelated to the Higgs soft terms. The benefit of this is that the amount of fine tuning of the\nelectroweak scale is then reduced relative to that in the MSSM alone, by a factor comparable\nto (or even larger) than that due to the MSSM quantum corrections to the quartic Higgs\ncoupling. This can be easily understood if we recall that the main source of fine tuning in the\nMSSM is related to the smallness of the MSSM Higgs quartic coupling.\nThe mechanism by which the mass of the SM-like Higgs is increased and the fine-tuning\nreduced has similarities with the method of additional effective operators usually considered\nin the MSSM Higgs sector, to solve these problems. Indeed, using effective operators of\ndimension d = 5 suppressed by \"new physics\" at a scale M , one can increase the Higgs mass\nabove the LEP bound. The advantage in our case is that no new scale is introduced in the\n√\nvisible sector. In both cases the new scales introduced (M or f ) have comparable values,\nbecause in both cases the required increase for mh to be above the LEP bound is done via\n√\ncouplings that depend on the ratio μ/M and μ/ f , respectively.\nThe possibility of an invisible decay of the MSSM lightest Higgs or of Z boson into a\ngoldstino and the (lightest) neutralino was investigated. The decay rate of the Higgs can\nbecome comparable to the h0 → γγ partial decay mode while that of the Z boson was shown\n√\nto bring a lower bound on f ∼ 700 GeV, which is stronger than previous similar bounds\n√\non f . This bound is consistent with that required for a classical increase of mh above the\nLEP bound, and does not apply in the case mχ01 > mZ (if for example mλ1 is large enough).\nHigher order (in 1/f ) processes such as Z or Higgs decay into pairs of goldstinos were also\n√\nanalyzed; these were found to be too small to bring constraints on f (for Z case) or subleading to the decay into goldstino-neutralino (for the Higgs case), and in agreement with\nprevious calculations.\nLet us mention that although we treated all MSSM superfields in the linear SUSY real√\nization (i.e. squarks and sleptons lighter than f ), our results on Higgs mass and invisible\ndecays of the Higgs and Z bosons are largely independent of this assumption. Even if the\nquarks and leptons superfields are treated in the nonlinear SUSY realization (i.e. squarks and\nslepton masses are large enough to be integrated out), these results are not changed.\n20\n\n\fAcknowledgments\nThis work was supported in part by the European Commission under contracts PITN-GA2009-237920, MRTN-CT-2006-035863 and ERC Advanced Grant 226371 (\"MassTeV\"), by\nINTAS grant 03-51-6346, by ANR (CNRS-USAR) contract 05-BLAN-007901, by CNRS PICS\nno. 3747 and 4172. During the last stages of this work, it was also partially supported by\nthe U.S. National Science Foundation under Grant No. PHY05-51164. I.A. and E.D. would\nlike to thank the KITP of UC Santa Barbara for hospitality during the last part of this work.\nP.T. would like to thank the 'Propondis' Foundation for its support. D.G. thanks the CERN\nTheory Division for the financial support. D.G. also thanks S. P. Martin, Z. Komargodski and\nN. Seiberg for clarifications on goldstino couplings in the constrained superfield formalism and\ntheir implications for phenomenology.\n\nAppendix\nFrom the Higgs part of the scalar potential, eq. (17), one finds the exact (in 1/f ) form of the\nmasses of the CP even Higgs fields:\nm2h,H\n\n= −2μ2 ∓\n+ (1 −\n\n√\n\n√ i 4μ4 − B 2 + 2μ2 m2Z + B m2Z sin 2β\n1√\n−2B h\nσ+\n3 + w0 +\n4\n8 sin 2β\n4 μ2 + 2 m2Z cos2 2β + 2 B sin 2β\n\nw0 )\n\n2 f 2 B 2 + 4μ4 + m2Z (4μ2 + m2Z ) cos2 2β + 4 B μ2 sin 2β\n\u00012\nv2\n4μ2 + 2 m2 cos2 2β + 2 B sin 2β\n\n(52)\n\nZ\n\nwith the upper sign for the lightest mh . The following notation was used\nw0 ≡ 1 −\n\n\u0001\nv2\n4 μ2 + 2 m2Z cos2 2β + 2 B sin 2β\n2\nf\n\n(53)\n\nand\nh\n\u0001i v 4 h\nσ = 2 2 x21 + 8B 2 + 5 m4Z + m2Z 8 x1 cos 2β +3 m2Z cos 4β − 8 B sin 2β + 4 2 x42 + 5B 4\n2f\n2 2\n4\n2\n2\n2\n2\n2\n2\n+ 20 x2 x1 + 5 x1 + 12 x1 x2 (2x1 + 2B + x2 ) cos 2β + 3(x1 − B )(x1 + B 2 + 2x22 ) cos 4β\ni\n\u0001\n+ 10B 2 (x21 + 2 x22 ) + 12B 2(x21 + B 2 ) x2 + x32 + x1 (x21 + B 2 + 2x22 ) cos 2β sin 2β\n2 v2 h\n+\n− 4B 2 (m2Z − 3x2 ) + m2Z x22 + x21 (5m2Z + 6x2 ) + 3m2Z (x21 + x22 ) cos 4β\nf2\n\u0001\n+ 2x1 2x21 + 5B 2 + x2 (6m2Z + x2 ) cos 2β + 2B x21 + 4B 2 − 3m2Z x2 + 2x22\ni\n\u0001\n+ 3x1 m2Z cos 2β sin 2β ,\nwith\nx1 ≡ m21 − m22 , x2 ≡ m21 + m22 .\n(54)\nAt the minimum of the scalar potential x1,2 take the values given in the text, Section 5. A\nseries expansion (in 1/f ) of m2h,H was presented in the text.\n21\n\n\fReferences\n[1] P. Fayet, \"Mixing Between Gravitational And Weak Interactions Through The Massive\nGravitino,\" Phys. Lett. B 70 (1977) 461. \"Weak Interactions Of A Light Gravitino: A\nLower Limit On The Gravitino Mass From The Decay Psi → Gravitino Anti-Photino,\"\n\nPhys. Lett. B 84 (1979) 421. \"Scattering Cross-Sections Of The Photino And The Goldstino (Gravitino) On Matter,\" Phys. Lett. B 86 (1979) 272. R. Casalbuoni, S. De Curtis,\nD. Dominici, F. Feruglio and R. Gatto, \"A Gravitino - Goldstino High-Energy Equivalence Theorem,\" Phys. Lett. B 215 (1988) 313 \"High-Energy Equivalence Theorem In\nSpontaneously Broken Supergravity,\" Phys. Rev. D 39 (1989) 2281.\n[2] D. V. Volkov and V. P. Akulov, \"Is the Neutrino a Goldstone Particle?,\" Phys. Lett. B\n46 (1973) 109.\n[3] T. E. Clark and S. T. Love, \"Goldstino couplings to matter,\" Phys. Rev. D 54 (1996)\n5723 [arXiv:hep-ph/9608243].\n[4] T. E. Clark, T. Lee, S. T. Love and G. Wu, \"On the interactions of light gravitinos,\"\nPhys. Rev. D 57 (1998) 5912 [arXiv:hep-ph/9712353].\n[5] A. Brignole, F. Feruglio and F. Zwirner, \"On the effective interactions of a light gravitino\nwith matter fermions,\" JHEP 9711 (1997) 001 [arXiv:hep-th/9709111];\n[6] M. A. Luty and E. Ponton, \"Effective Lagrangians and light gravitino phenomenology,\"\nPhys. Rev. D 57 (1998) 4167 hep-ph/9706268,v3 [revised version of Phys. Rev. D 57\n(1998) 4167].\n[7] E. A. Ivanov, A. A. Kapustnikov, \"Relation Between Linear And Nonlinear Realizations\nOf Supersymmetry,\" \"General Relationship Between Linear And Nonlinear Realizations\nOf Supersymmetry,\" J. Phys. A 11 (1978) 2375. \"The Nonlinear Realization Structure\nOf Models With Spontaneously Broken Supersymmetry,\" J. Phys. G 8 (1982) 167.\n[8] S. Samuel and J. Wess, \"A Superfield Formulation Of The Nonlinear Realization Of\nSupersymmetry And Its Coupling To Supergravity,\" Nucl. Phys. B 221 (1983) 153.\n[9] I. Antoniadis and M. Tuckmantel, \"Non-linear supersymmetry and intersecting Dbranes,\" Nucl. Phys. B 697 (2004) 3 [arXiv:hep-th/0406010].\n[10] M. Rocek, \"Linearizing The Volkov-Akulov Model,\" Phys. Rev. Lett. 41 (1978) 451.\n[11] U. Lindstrom, M. Rocek, \"Constrained Local Superfields,\" Phys. Rev. D 19 (1979) 2300.\n22\n\n\f[12] R. Casalbuoni, S. De Curtis, D. Dominici, F. Feruglio and R. Gatto, \"Nonlinear realization of supersymmetry algebra from supersymmetric constraint\" Phys. Lett. B 220\n(1989) 569.\n[13] Z. Komargodski and N. Seiberg, \"From Linear SUSY to Constrained Superfields,\" JHEP\n0909 (2009) 066 [arXiv:0907.2441 [hep-th]].\n[14] I. Antoniadis, M. Tuckmantel and F. Zwirner, \"Phenomenology of a leptonic goldstino\nand invisible Higgs boson decays,\" Nucl. Phys. B 707 (2005) 215 [arXiv:hep-ph/0410165].\n[15] A. Brignole, J. A. Casas, J. R. Espinosa and I. Navarro, \"Low-scale supersymmetry\nbreaking: Effective description, electroweak breaking and phenomenology,\" Nucl. Phys.\nB 666 (2003) 105 [arXiv:hep-ph/0301121].\n[16] L. Alvarez-Gaume, C. Gomez and R. Jimenez, \"Minimal Inflation,\" Phys. Lett. B 690\n(2010) 68 [arXiv:1001.0010 [hep-th]].\n[17] I. Antoniadis, E. Dudas, D. M. Ghilencea, P. Tziveloglou, \"MSSM Higgs with dimensionsix operators,\" Nucl. Phys. B 831 (2010) 133 [arXiv:0910.1100 [hep-ph]]. \"Beyond the\nMSSM Higgs with d=6 effective operators,\" Nucl. Phys. B 848 (2011) 1 [arXiv:1012.5310\n[hep-ph]]. \"MSSM with Dimension-five Operators (MSSM5 ),\" Nucl. Phys. B 808 (2009)\n155 [arXiv:0806.3778 [hep-ph]]. I. Antoniadis, E. Dudas, D. M. Ghilencea, \"Supersymmetric Models with Higher Dimensional Operators,\" JHEP 0803 (2008) 045 [arXiv:0708.0383\n[hep-th]].\n[18] M. Dine, N. Seiberg and S. Thomas, \"Higgs Physics as a Window Beyond the MSSM\n(BMSSM),\" Phys. Rev. D 76 (2007) 095004 [arXiv:0707.0005 [hep-ph]].\n[19] S. Cassel, D. M. Ghilencea and G. G. Ross, \"Fine tuning as an indication of physics\nbeyond the MSSM,\" Nucl. Phys. B 825 (2010) 203 [arXiv:0903.1115 [hep-ph]].\n[20] K. Blum, C. Delaunay and Y. Hochberg, \"Vacuum (Meta)Stability Beyond the MSSM,\"\narXiv:0905.1701 [hep-ph].\n[21] M. Carena, K. Kong, E. Ponton and J. Zurita, \"Supersymmetric Higgs Bosons and Beyond,\" Phys. Rev. D 81 (2010) 015001 [arXiv:0909.5434]. M. Carena, E. Ponton and\nJ. Zurita, \"BMSSM Higgs Bosons at the Tevatron and the LHC,\" arXiv:1005.4887 [Unknown].\n[22] R. Barate et al. [LEP Working Group for Higgs boson searches and ALEPH, DELPHI,\nL3 and OPAL Collaborations, \"Search for the standard model Higgs boson at LEP,\"\n23\n\n\fPhys. Lett. B 565 (2003) 61 [arXiv:hep-ex/0306033]. S. Schael et al. ALEPH, DELPHI, L3 and OPAL Collaborations and LEP Working Group for Higgs Boson Searches,\n\"Search for neutral MSSM Higgs bosons at LEP,\" Eur. Phys. J. C 47 (2006) 547\n[arXiv:hep-ex/0602042].\n[23] S. Cassel, D. M. Ghilencea and G. G. Ross, \"Testing SUSY at the LHC: Electroweak\nand Dark matter fine tuning at two-loop order,\" arXiv:1001.3884 [hep-ph]; \"Testing\nSUSY,\" arXiv:0911.1134 [hep-ph]. S. Cassel, D. M. Ghilencea, S. Kraml, A. Lessa and\nG. G. Ross, \"Fine-tuning implications for complementary dark matter and LHC SUSY\nsearches,\" JHEP 1105 (2011) 120 [arXiv:1101.4664 [hep-ph]].\n[24] J. A. Bagger and A. F. Falk, \"Decoupling and Destabilizing in Spontaneously Broken\nSupersymmetry\", Phys. Rev. D 76 (2007) 105026, arXiv:0708.3364 [hep-ph].\n[25] A. Djouadi and M. Drees, \"Higgs boson decays into light gravitinos,\" Phys. Lett. B 407\n(1997) 243 [hep-ph/9703452].\n[26] A. Djouadi, J. Kalinowski and M. Spira, \"HDECAY: A program for Higgs boson decays\nin the standard model and its supersymmetric extension,\" Comput. Phys. Commun. 108\n(1998) 56 [arXiv:hep-ph/9704448].\n[27] M. M. El Kheishen, A. A. Aboshousha and A. A. Shafik, \"Analytic Formulas For The\nNeutralino Masses And The Neutralino Mixing Matrix,\" Phys. Rev. D 45 (1992) 4345.\n[28] S. Ambrosanio, G. L. Kane, G. D. Kribs, S. P. Martin and S. Mrenna, \"Search for supersymmetry with a light gravitino at the Fermilab Tevatron and CERN LEP colliders,\"\nPhys. Rev. D 54 (1996) 5395 [hep-ph/9605398];\n[29] S. Dimopoulos, S. Thomas and J. D. Wells, \"Sparticle spectroscopy and electroweak\nsymmetry breaking with gauge-mediated supersymmetry breaking,\" Nucl. Phys. B 488\n(1997) 39 [hep-ph/9609434].\n[30] C. Amsler et al., Particle Data Group, Physics Letters B667, 1 (2008) and 2009 partial\nupdate for the 2010 edition.\n\n24\n\n\f"}