{"id": "http://arxiv.org/abs/0802.4047v1", "guidislink": true, "updated": "2008-02-27T17:04:27Z", "updated_parsed": [2008, 2, 27, 17, 4, 27, 2, 58, 0], "published": "2008-02-27T17:04:27Z", "published_parsed": [2008, 2, 27, 17, 4, 27, 2, 58, 0], "title": "Introductory lectures on the Effective One Body formalism", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0802.2604%2C0802.0264%2C0802.2631%2C0802.0259%2C0802.2179%2C0802.0764%2C0802.0471%2C0802.0038%2C0802.2508%2C0802.2026%2C0802.2942%2C0802.0671%2C0802.0707%2C0802.4152%2C0802.2181%2C0802.2533%2C0802.2957%2C0802.2520%2C0802.0052%2C0802.3773%2C0802.1329%2C0802.0672%2C0802.0230%2C0802.2424%2C0802.1553%2C0802.3823%2C0802.3036%2C0802.3638%2C0802.2001%2C0802.2288%2C0802.1138%2C0802.4043%2C0802.3311%2C0802.3157%2C0802.1272%2C0802.0298%2C0802.3869%2C0802.0387%2C0802.2829%2C0802.3082%2C0802.3602%2C0802.4353%2C0802.2747%2C0802.1823%2C0802.0239%2C0802.1168%2C0802.2662%2C0802.0617%2C0802.3168%2C0802.1845%2C0802.3006%2C0802.2581%2C0802.3134%2C0802.4276%2C0802.0535%2C0802.0673%2C0802.0758%2C0802.3041%2C0802.4054%2C0802.0881%2C0802.1891%2C0802.4232%2C0802.1133%2C0802.4346%2C0802.3271%2C0802.4049%2C0802.2980%2C0802.3245%2C0802.1372%2C0802.3167%2C0802.1938%2C0802.1580%2C0802.0382%2C0802.2368%2C0802.2219%2C0802.1010%2C0802.1295%2C0802.4047%2C0802.3613%2C0802.4153%2C0802.0178%2C0802.0564%2C0802.3928%2C0802.3814%2C0802.1520%2C0802.0756%2C0802.2732%2C0802.0808%2C0802.3656%2C0802.2742%2C0802.1063%2C0802.0488%2C0802.3830%2C0802.2721%2C0802.2272%2C0802.4376%2C0802.0056%2C0802.1114%2C0802.1091%2C0802.1379%2C0802.3537&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Introductory lectures on the Effective One Body formalism"}, "summary": "The Effective One Body (EOB) formalism is an analytical approach which aims\nat providing an accurate description of the motion and radiation of coalescing\nbinary black holes. We present a brief review of the basic elements of this\napproach.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0802.2604%2C0802.0264%2C0802.2631%2C0802.0259%2C0802.2179%2C0802.0764%2C0802.0471%2C0802.0038%2C0802.2508%2C0802.2026%2C0802.2942%2C0802.0671%2C0802.0707%2C0802.4152%2C0802.2181%2C0802.2533%2C0802.2957%2C0802.2520%2C0802.0052%2C0802.3773%2C0802.1329%2C0802.0672%2C0802.0230%2C0802.2424%2C0802.1553%2C0802.3823%2C0802.3036%2C0802.3638%2C0802.2001%2C0802.2288%2C0802.1138%2C0802.4043%2C0802.3311%2C0802.3157%2C0802.1272%2C0802.0298%2C0802.3869%2C0802.0387%2C0802.2829%2C0802.3082%2C0802.3602%2C0802.4353%2C0802.2747%2C0802.1823%2C0802.0239%2C0802.1168%2C0802.2662%2C0802.0617%2C0802.3168%2C0802.1845%2C0802.3006%2C0802.2581%2C0802.3134%2C0802.4276%2C0802.0535%2C0802.0673%2C0802.0758%2C0802.3041%2C0802.4054%2C0802.0881%2C0802.1891%2C0802.4232%2C0802.1133%2C0802.4346%2C0802.3271%2C0802.4049%2C0802.2980%2C0802.3245%2C0802.1372%2C0802.3167%2C0802.1938%2C0802.1580%2C0802.0382%2C0802.2368%2C0802.2219%2C0802.1010%2C0802.1295%2C0802.4047%2C0802.3613%2C0802.4153%2C0802.0178%2C0802.0564%2C0802.3928%2C0802.3814%2C0802.1520%2C0802.0756%2C0802.2732%2C0802.0808%2C0802.3656%2C0802.2742%2C0802.1063%2C0802.0488%2C0802.3830%2C0802.2721%2C0802.2272%2C0802.4376%2C0802.0056%2C0802.1114%2C0802.1091%2C0802.1379%2C0802.3537&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The Effective One Body (EOB) formalism is an analytical approach which aims\nat providing an accurate description of the motion and radiation of coalescing\nbinary black holes. We present a brief review of the basic elements of this\napproach."}, "authors": ["Thibault Damour"], "author_detail": {"name": "Thibault Damour"}, "author": "Thibault Damour", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1142/S0217751X08039992", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0802.4047v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0802.4047v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "22 pages, 3 figures, lectures given at the Second ICRANet\n  Stueckelberg Workshop on Relativistic Field Theories (Pescara, Italy,\n  September 3-8, 2007); to be published in the International Journal of Modern\n  Physics A", "arxiv_primary_category": {"term": "gr-qc", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "gr-qc", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0802.4047v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0802.4047v1", "journal_reference": "Int.J.Mod.Phys.A23:1130-1148,2008", "doi": "10.1142/S0217751X08039992", "fulltext": "arXiv:0802.4047v1 [gr-qc] 27 Feb 2008\n\nIntroductory lectures on the Effective One Body\nformalism\nThibault Damour\nInstitut des Hautes Etudes Scientifiques, 35 route de Chartres,\nF-91440 Bures-sur-Yvette, France\n\nAbstract\nThe Effective One Body (EOB) formalism is an analytical approach\nwhich aims at providing an accurate description of the motion and radiation of coalescing binary black holes. We present a brief review of the\nbasic elements of this approach.\n\n1\n\nIntroduction\n\nA network of ground-based interferometric gravitational wave (GW) detectors\n(LIGO/VIRGO/GEO/. . .) is currently taking data near its planned sensitivity.\nCoalescing black hole binaries are among the most promising, and most exciting,\nGW sources for these detectors. In order to successfully detect GWs from\ncoalescing black hole binaries, and to be able to reliably measure the physical\nparameters of the source (masses, spins, . . .), it is necessary to know in advance\nthe shape of the GW signals emitted by inspiralling and merging black holes.\nIndeed, the detection and subsequent data analysis of GW signals is made by\nusing a large bank of templates that accurately represent the GW waveforms\nemitted by the source.\nHere, we shall introduce the reader to one promising strategy toward having\nan accurate analytical1 description of the motion and radiation of binary black\nholes, which covers all its stages (inspiral, plunge, merger and ring-down): the\nEffective One Body approach [1, 2, 3, 4]. As early as 2000 [2] this method\nmade several quantitative and qualitative predictions concerning the dynamics\nof the coalescence, and the corresponding GW radiation, notably: (i) a blurred\n1 Here we use the adjective 'analytical' for methods that solve explicit (analytically given)\nordinary differential equations (ODE), even if one uses standard (Runge-Kutta-type) numerical tools to solve them. The important point is that, contrary to 3d numerical relativity simulations, numerically solving ODE's is extremely fast, and can therefore be done (possibly even in\nreal time) for a dense sampling of theoretical parameters, such as orbital (ν = m1 m2 /M, . . .)\nor spin (â1 = S1 /Gm21 , θ1 , φ1 , . . .) parameters.\n\n1\n\n\ftransition from inspiral to a 'plunge' that is just a smooth continuation of the\ninspiral, (ii) a sharp transition, around the merger of the black holes, between\na continued inspiral and a ring-down signal, and (iii) estimates of the radiated\nenergy and of the spin of the final black hole. In addition, the effects of the\nindividual spins of the black holes were investigated within the EOB [4, 5] and\nwere shown to lead to a larger energy release for spins parallel to the orbital\nangular momentum, and to a dimensionless rotation parameter J/E 2 always\nsmaller than unity at the end of the inspiral (so that a Kerr black hole can\nform right after the inspiral phase). All those predictions have been broadly\nconfirmed by the results of the recent numerical simulations performed by several\nindependent groups [6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17] (for a review of\nnumerical relativity results see [18]). Note that, in spite of the high computer\npower used in these simulations, the calculation of one sufficiently long waveform\n(corresponding to specific values of the many continuous parameters describing\nthe two arbitrary masses, the initial spin vectors, and other initial data) takes on\nthe order of two weeks. This is a very strong argument for developing analytical\nmodels of waveforms.\nThose recent breakthroughs in numerical relativity (NR) open the possibility\nof comparing in detail the EOB description to NR results. This EOB/NR comparison has been recently initiated in several works [19, 20, 21, 22, 23, 24, 25].\nThe level of analytical/numerical agreement is unprecedented, compared to\nwhat has been previously achieved when comparing other types of analytical\nwaveforms to numerical ones. For instance, [24] found that the maximal dephasing between a recent, very accurate NR simulation of 30 GW cycles during\nlate inspiral [17] and EOB could be reduced below 10−3 GW cycles. The same\ncomparison exhibited also an excellent agreement between the amplitudes of\nthe NR and EOB waveforms. If the reader wishes to put the EOB results in\ncontrast with other (Post-Newtonian or hybrid) approaches he can consult, e.g.,\n[26, 27, 17, 28, 29, 30].\nBefore reviewing some of the technical aspects of the EOB method, let us\nindicate some of the historical roots of this method. First, we note that the\nEOB approach comprises three, rather separate, ingredients:\n(1) a description of the conservative (Hamiltonian) part of the dynamics of\ntwo black holes;\n(2) an expression for the radiation-reaction part of the dynamics;\n(3) a description of the GW waveform emitted by a coalescing binary system.\nFor each one of these ingredients, the essential inputs that are used in EOB\ndevelopments are high-order post-Newtonian (PN) expanded results which have\nbeen obtained by many years of work, by many researchers (see references below). However, one of the key ideas in the EOB philosophy is to avoid using\nPN results in their original 'Taylor-expanded' form (i.e. c0 + c1 v + c2 v 2 +\nc3 v 3 + * * * + cn v n ), but to use them instead in some resummed form (i.e. some\n2\n\n\fnon-polynomial function of v, defined so as to incorporate some of the expected\nnon-perturbative features of the exact result). The basic ideas and techniques\nfor resumming each ingredient of the EOB are different and have different historical roots. Concerning the ingredient (1), i.e. the EOB Hamiltonian, it was\ninspired by an approach to electromagnetically interacting quantum two-body\nsystems introduced by Brézin, Itzykson and Zinn-Justin [31]. The resummation\nof the ingredient (2), i.e. the EOB radiation-reaction force F , was inspired by\nthe Padé resummation of the flux function introduced by Damour, Iyer and\nSathyaprakash [32]. As for the ingredient (3), i.e. the EOB description of the\nwaveform emitted by a coalescing black hole binary, it was mainly inspired by\nthe work of Davis, Ruffini and Tiomno [33] which discovered the transition between the plunge signal and a ringing tail when a particle falls into a black hole.\nAdditional motivation for the EOB treatment of the transition from plunge to\nring-down came from work on the, so-called, 'close limit approximation' [34].\nLet us finally note that the EOB approach has been recently improved by\nfollowing a methodology consisting of studying, element by element, the physics\nbehind each feature of the waveform, and on systematically comparing various EOB-based waveforms with 'exact' waveforms obtained by NR approaches.\nAmong these 'exact' NR waveforms, it has been useful to consider the smallmass-ratio limit ν ≡ m1 m2 /(m1 + m2 )2 ≪ 1, in which one can use the well controllable 'laboratory' of numerical simulations of test particles (with an added\nradiation-reaction force) moving in black hole backgrounds [23].\n\n2\n\nMotion and radiation of binary black holes:\npost-Newtonian expanded results\n\nBefore discussing the various resummation techniques used in the EOB approach, let us briefly recall the 'Taylor-expanded' results that have been obtained by pushing to high accuracies the post-Newtonian (PN) methods.\nConcerning the orbital dynamics of compact binaries, we recall that the\n2.5PN-accurate2 equations of motion have been derived in the 1980's [35, 36,\n37, 38]. Pushing the accuracy of the equations of motion to the 3PN (∼ (v/c)6 )\nlevel proved to be a non-trivial task. At first, the representation of black holes\nby delta-function sources and the use of the (non diffeomorphism invariant)\nHadamard regularization method led to ambiguities in the computation of the\nbadly divergent integrals that enter the 3PN equations of motion [39, 40]. This\nproblem was solved by using the (diffeomorphism invariant) dimensional regularization method (i.e. analytic continuation in the dimension of space d) which\nallowed one to complete the determination of the 3PN-level equations of motion [41, 42]. They have also been derived by an Einstein-Infeld-Hoffmann-type\nsurface-integral approach [43]. The 3.5PN terms in the equations of motion are\nalso known [44, 45, 46].\n2 As usual 'n-PN accuracy' means that a result has been derived up to (and including)\nterms which are ∼ (v/c)2n ∼ (GM/c2 r)n fractionally smaller than the leading contribution.\n\n3\n\n\fConcerning the emission of gravitational radiation, two different gravitationalwave generation formalisms have been developed up to a high PN accuracy:\n(i) the Blanchet-Damour-Iyer formalism [47, 48, 49, 50, 51, 52, 53] combines\na multipolar post-Minkowskian (MPM) expansion in the exterior zone with a\npost-Newtonian expansion in the near zone; while (ii) the Will-Wiseman-Pati\nformalism [54, 55, 56, 44] uses a direct integration of the relaxed Einstein equations. These formalisms were used to compute increasingly accurate estimates of\nthe gravitational waveforms emitted by inspiralling binaries. These estimates include both normal, near-zone generated post-Newtonian effects (at the 1PN [48],\n2PN [57, 58, 54], and 3PN [59, 60] levels), and more subtle, wave-zone generated\n(linear and non-linear) 'tail effects' [51, 61, 62, 53]. However, technical problems arose at the 3PN level. The representation of black holes by 'delta-function'\nsources causes the appearance of dangerously divergent integrals in the 3PN multipole moments. The use of Hadamard (partie finie) regularization did not allow\none to unambiguously compute the needed 3PN-accurate quadrupole moment.\nOnly the use of the (formally) diffeomorphism-invariant dimensional regularization method allowed one to complete the 3PN-level gravitational-radiation\nformalism [63].\nThe works mentioned in this Section (see [64] for a detailed account and more\nreferences) finally lead to PN-expanded results for the motion and radiation of\nbinary black holes. For instance, the equations of motion are given in the form\n(a = 1, 2; i = 1, 2, 3)\nd2 zai\n= Aiacons + AiRR\n,\n(1)\na\ndt2\nwhere\nAcons = A0 + c−2 A2 + c−4 A4 + c−6 A6 ,\n(2)\ndenotes the 'conservative' 3PN-accurate terms, while\nARR = c−5 A5 + c−7 A7 ,\n\n(3)\n\ndenotes the time-asymmetric contibutions, linked to 'radiation reaction'.\nOn the other hand, if we consider for simplicity the inspiralling motion of\na quasi-circular binary system, the essential quantity describing the emitted\ngravitational waveform is the phase φ of the quadrupolar gravitational wave\namplitude h(t) ≃ a(t) cos(φ(t) + δ). PN theory allows one to derive several\ndifferent functional expressions for the gravitational wave phase φ, as a function\neither of time or of the instantaneous frequency. For instance, as a function\nof time, φ admits the following explicit expansion in powers of θ ≡ νc3 (tc −\nt)/5GM (where tc denotes a formal 'time of coalescence', M ≡ m1 + m2 and\nν ≡ m1 m2 /M 2 )\n!\n7\nX\n(4)\n(an + a′n ln θ) θ−n/8 ,\nφ(t) = φc − ν −1 θ5/8 1 +\nn=2\n\nwith some numerical coefficients an , a′n which depend only on the dimensionless\n(symmetric) mass ratio ν ≡ m1 m2 /M 2 . The derivation of the 3.5PN-accurate\n4\n\n\fexpansion (4) uses both the 3PN-accurate conservative acceleration (2) and a\n3.5PN extension of the (fractionally) 1PN-accurate radiation reaction acceleration (3) obtained by assuming a balance between the energy of the binary\nsystem and the gravitational-wave energy flux at infinity (see, e.g., [64]).\n\n3\n\nConservative dynamics of binary black holes:\nthe Effective One Body approach\n\nThe PN-expanded results briefly reviewed in the previous Section are expected\nto yield accurate descriptions of the motion and radiation of binary black holes\nonly during their early inspiralling stage, i.e. as long as the PN expansion parameter γe = GM/c2 R (where R is the distance between the two black holes)\nstays significantly smaller than the value ∼ 16 where the orbital motion is expected to become dynamically unstable ('last stable circular orbit' and beginning of a 'plunge' leading to the merger of the two black holes). One needs a\nbetter description of the motion and radiation to describe the late inspiral (say\n1\nγe & 12\n), as well as the subsequent plunge and merger. One possible strategy for having a complete description of the motion and radiation of binary\nblack holes, covering all the stages (inspiral, plunge, merger, ring-down), would\nthen be to try to 'stitch together' PN-expanded analytical results describing the\nearly inspiral phase with 3d numerical results describing the end of the inspiral, the plunge, the merger and the ring-down of the final black hole, see, e.g.,\nRefs. [65, 20].\nHowever, we wish to argue that the EOB approach makes a better use of all\nthe analytical information contained in the PN-expanded results (1)-(3). The\nbasic claim (first made in [1, 2]) is that the use of suitable resummation methods\nshould allow one to describe, by analytical tools, a sufficiently accurate approximation of the entire waveform, from inspiral to ring-down, including the nonperturbative plunge and merger phases. To reach such a goal, one needs to make\nuse of several tools: (i) resummation methods, (ii) exploitation of the flexibility\nof analytical approaches, (iii) extraction of the non-perturbative information\ncontained in various numerical simulations, (iv) qualitative understanding of\nthe basic physical features which determine the waveform.\nLet us start by discussing the first tool used in the EOB approach: the\nsystematic use of resummation methods. Two such methods have been employed\n(and combined), and some evidence has been given that they do significantly\nimprove the convergence properties of PN expansions. The first method is the\nuse of Padé approximants. It has been shown in Ref. [32] that near-diagonal\nPadé approximants of the radiation reaction force3 F seemed to provide a good\n3 We henceforth denote by F the Hamiltonian version of the radiation reaction term ARR ,\nEq. (3), in the (PN-expanded) equations of motion. It can be heuristically computed up to\n(absolute) 5.5PN [59, 66, 63] and even 6PN [67] order by assuming that the energy radiated\nin gravitational waves at infinity is balanced by a loss of the dynamical energy of the binary\nsystem.\n\n5\n\n\frepresentation of F down to the last stable orbit (which is expected to occur\nwhen R ∼ 6GM/c2 , i.e. when γe ≃ 16 ). The second method is a novel approach\nto the dynamics of compact binaries, which constitutes the core of the Effective\nOne Body (EOB) method.\nFor simplicity of exposition, let us first explain the EOB method at the\n2PN level. The starting point of the method is the 2PN-accurate Hamiltonian describing (in Arnowitt-Deser-Misner-type coordinates) the conservative,\nor time symmetric, part of the equations of motion (1) (i.e. the truncation\nAcons = A0 + c−2 A2 + c−4 A4 of Eq. (2)) say H2PN (q1 − q2 , p1 , p2 ). By going\nto the center of mass of the system (p1 + p2 = 0), one obtains a PN-expanded\nHamiltonian describing the relative motion, q = q1 − q2 , p = p1 = −p2 :\nrelative\nH2PN\n(q, p) = H0 (q, p) +\n\n1\n1\nH2 (q, p) + 4 H4 (q, p) ,\nc2\nc\n\n(5)\n\n1\np2 + GMμ\n(with M ≡ m1 + m2 and μ = m1 m2 /M )\nwhere H0 (q, p) = 2μ\n|q|\ncorresponds to the Newtonian approximation to the relative motion, while H2\ndescribes 1PN corrections and H4 2PN ones. It is well known that, at the Newtonian approximation, H0 (q, p) can be thought of as describing a 'test particle'\nof mass μ orbiting around an 'external mass' GM . The EOB approach is a general relativistic generalization of this fact. It consists in looking for an 'external\next λ\nspacetime geometry' gμν\n(x ; GM ) such that the geodesic dynamics of a 'test\next λ\nparticle' of mass μ within gμν\n(x , GM ) is equivalent (when expanded in powers\n2\nof 1/c ) to the original, relative PN-expanded dynamics (5).\nLet us explain the idea, proposed in [1], for establishing a 'dictionary' between the real relative-motion dynamics, (5), and the dynamics of an 'effective'\next λ\nparticle of mass μ moving in gμν\n(x , GM ). The idea consists in 'thinking quan4\ntum mechanically' . Instead of thinking in terms of a classical Hamiltonian,\nrelative\nH(q, p) (such as H2PN\n, Eq. (5)), and of its classical bound orbits, we can\nthink in terms of the quantized energy levels E(n, l) of the quantum bound\nstates of the Hamiltonian operator H(q̂, p̂). These energy levels will depend on\ntwo (integer valued) quantum numbers n and l. Here (for a spherically symmetric interaction, as appropriate to H relative ), l parametrizes the total orbital\nangular momentum (L2 = l(l + 1) ~2 ), while n represents the 'principal quantum number' n = l + nr + 1, where nr (the 'radial quantum number') denotes\nthe number of nodes in the radial wave function. The third 'magnetic quantum\nnumber' m (with −l ≤ m ≤ l) does not enter the energy levels because of the\nspherical symmetry of the two-body interaction (in the center of of mass frame).\nFor instance, a non-relativistic Coulomb (or Newton!) interaction\n\nH0 =\n\n1 2 GM μ\np +\n2μ\n|q|\n\n(6)\n\n4 This is related to an idea emphasized many times by John Archibald Wheeler: quantum\nmechanics can often help us in going to the essence of classical mechanics.\n\n6\n\n\fgives rise to the well-known result\n1\nE0 (n, l) = − μ\n2\n\n\u0012\n\nGM μ\nn~\n\n\u00132\n\n,\n\n(7)\n\nwhich depends only on n (this is the famous Coulomb degeneracy). When\nconsidering the PN corrections to H0 , as in Eq. (5), one gets a more complicated\nexpression of the form\n\u0014\nα2 \u0010 c11\nc20 \u0011\n1 α2\nrelative\n+ 2\nE2PN\n(n, l) = − μ 2 1 + 2\n2 n\nc\nnl\nn\n\u0015\n4 \u0010\nα\nc13\nc22\nc31\nc40 \u0011\n,\n(8)\n+ 4\n+\n+\n+\nc\nnl3\nn2 l 2\nn3 l\nn4\nwhere we have set α ≡ GM μ/~ = G m1 m2 /~, and where we consider, for\nsimplicity, the (quasi-classical) limit where n and l are large numbers. The\n2PN-accurate result (8) had been derived by Damour and Schäfer [68] as early\nas 1988. The dimensionless coefficients cpq are functions of the symmetric mass\nratio ν ≡ μ/M , for instance c40 = 18 (145 − 15ν + ν 2 ). In classical mechanics (i.e.\nfor large n and l), it is called the 'Delaunay Hamiltonian',\nH i.e. the Hamiltonian\n1\npφ dφ, and N = n~ =\nexpressed in terms ofHthe action variables5 J = l~ = 2π\n1\nIr + J, with Ir = 2π\npr dr.\nThe energy levels (8) encode, in a gauge-invariant way, the 2PN-accurate\nrelative dynamics of a 'real' binary. Let us now consider an auxiliary problem:\nthe 'effective' dynamics of one body, of mass μ, following a geodesic in some\n'external' (spherically symmetric) metric6\next\ndxμ dxν = −A(R) c2 dT 2 + B(R) dR2 + R2 (dθ2 + sin2 θ dφ2 ) .\ngμν\n\n(9)\n\nHere, the a priori unknown metric functions A(R) and B(R) will be constructed\nin the form of an expansion in GM/c2 R:\n\u0012\n\u0012\n\u00132\n\u00133\nGM\nGM\nGM\n+\na\n+ *** ;\nA(R) = 1 + a1 2 + a2\n3\nc R\nc2 R\nc2 R\n\u0012\n\u00132\nGM\nGM\nB(R) = 1 + b1 2 + b2\n+ *** ,\n(10)\nc R\nc2 R\nwhere the dimensionless coefficients an , bn depend on ν. From the Newtonian\nlimit, it is clear that we should set a1 = −2. By solving (by separation of\nvariables) the 'effective' Hamilton-Jacobi equation\nμν\ngeff\n\n∂Seff ∂Seff\n+ μ2 c 2 = 0 ,\n∂xμ ∂xν\n\nconsider, for simplicity, 'equatorial' motions with m = l, i.e., classically, θ = π2 .\nis convenient to write the 'external metric' in Schwarzschild-like coordinates. Note that\nthe external radial coordinate R differs from the two-body ADM-coordinate relative distance\nRADM = |q|. The transformation between the two coordinate systems has been determined\nin Refs. [1, 3].\n5 We\n6 It\n\n7\n\n\fSeff = −Eeff t + Jeff φ + Seff (R) ,\n\n(11)\n\none can straightforwardly compute (in the quasi-classical, large quantum numbers limit) the Delaunay Hamiltonian Eeff (Neff ,HJeff ), with Neff = neff ~, Jeff =\n1\neff\neff\neff\nleff ~ (where Neff = Jeff + IR\n, with IR\n= 2π\npeff\nR dR, PR = ∂Seff (R)/dR).\nThis yields a result of the form\n\u0012 eff\n\u0014\n\u0013\nc11\n1\nα2\nceff\nα2\n20\n2\nEeff (neff , leff ) = μc − μ 2\n1+ 2\n(12)\n+ 2\n2 neff\nc\nneff leff\nneff\n\u0013\n\u0015\n\u0012\nceff\nceff\nceff\nceff\nα4\n13\n40\n22\n31\n,\n+ 4\n+ 2 2 + 3\n+ 4\nc\nneff l3eff\nneff leff\nneff leff\nneff\nwhere the dimensionless coefficients ceff\npq are now functions of the unknown coefficients an , bn entering the looked for 'external' metric coefficients (10).\nAt this stage, one needs (as in the famous AdS/CFT correspondence) to\ndefine a 'dictionary' between the real (relative) two-body dynamics, summarized\nin Eq. (8), and the effective one-body one, summarized in Eq. (12). As, on both\nsides, quantum mechanics tells us that the action variables are quantized in\nintegers (Nreal = n~, Neff = neff ~, etc.) it is most natural to identify n = neff\nand l = leff . One then still needs a rule for relating the two different energies\nrelative\nEreal\nand Eeff . Ref. [1] proposed to look for a general map between the\nreal energy levels and the effective ones (which, as seen when comparing (8)\nand (12), cannot be directly identified because they do not include the same\nrest-mass contribution7 ), namely\n!\n\u0012 relative \u00132\n\u0012 relative \u0013\nrelative\nrelative\nEeff\nEreal\nEreal\nEreal\nEreal\n=\n1 + α1\n+ *** .\n−1 = f\n+ α2\nμc2\nμc2\nμc2\nμc2\nμc2\n(13)\nThe 'correspondence' between the real and effective energy levels is illustrated\nin Fig. 1.\nrelative\nFinally, identifying Eeff (n, l)/μc2 to f (Ereal\n/μc2 ) yields six equations, reeff\nlating the six coefficients cpq (a2 , a3 ; b1 , b2 ) to the six cpq (ν) and to the two\nenergy coefficients α1 and α2 . It is natural to set b1 = +2 (so that the linearized effective metric coincides with the linearized Schwarzschild metric with\nmass M = m1 + m2 ). One then finds that there exists a unique solution for the\nremaining five unknown coefficients a2 , a3 , b2 , α1 and α2 . This solution is very\nsimple:\nν\n(14)\na2 = 0 , a3 = 2ν , b2 = 4 − 6ν , α1 = , α2 = 0 .\n2\nNote, in particular, that the map between the two energies is simply\n\u0012\n\u0013\nrelative\nrelative\nEeff\nν Ereal\ns − m21 c4 − m22 c4\nEreal\n1\n+\n=\n=\n1\n+\n(15)\n2\n2\n2\nμc\nμc\n2 μc\n2 m1 m2 c4\n7 Indeed E total = M c2 + E relative = M c2 + Newtonian terms + 1PN/c2 + * * * , while\nreal\nreal\nEeffective = μc2 + N + 1PN/c2 + * * * .\n\n8\n\n\fFigure 1: Sketch of the correspondence between the quantized energy levels of\nthe real and effective conservative dynamics. n denotes the 'principal quantum\nnumber' (n = nr + l + 1, with nr = 0, 1, . . . denoting the number of nodes in the\nradial function), while l denotes the (relative) orbital angular momentum (L2 =\nl(l+1) ~2). Though the EOB method is purely classical, it is conceptually useful\nto think in terms of the underlying (Bohr-Sommerfeld) quantization conditions\nof the action variables IR and J to motivate the identification between n and l\nin the two dynamics.\ntot 2\nrelative 2\nwhere s = (Ereal\n) ≡ (M c2 + Ereal\n) is Mandelstam's invariant. Note also\next\n' metric coefficient A(R) (which fully\nthat, at 2PN accuracy, the crucial 'g00\nencodes the energetics of circular orbits) is given by the remarkably simple PN\nexpansion\nA2PN (R) = 1 − 2u + 2 ν u3 ,\n(16)\n\nwhere u ≡ GM/c2 R and ν ≡ μ/M ≡ m1 m2 /(m1 + m2 )2 .\n\nThe dimensionless parameter ν ≡ μ/M varies between 0 (in the test mass\nlimit m1 ≪ m2 ) and 14 (in the equal-mass case m1 = m2 ). When ν → 0,\nEq. (16) yields back, as expected, the well-known Schwarzschild time-time metSchw\nric coefficient −g00\n= 1 − 2u = 1 − 2GM/c2 R. One therefore sees in Eq. (16)\nthe rôle of ν as a deformation parameter connecting a well-known test-mass\nresult to a non trivial and new 2PN result. It is also to be noted that the\n1PN EOB result A1PN (R) = 1 − 2u happens to be ν-independent, and therefore\nidentical to ASchw = 1 − 2u. This is remarkable in view of the many non-trivial\nν-dependent terms in the 1PN relative dynamics. The physically real 1PN ν-\n\n9\n\n\fdependence happens to be fully encoded in the function f (E) mapping the two\nenergy spectra given in Eq. (15) above.\nLet us emphasize the remarkable simplicity of the 2PN result (16). The\n2PN Hamiltonian (5) contains eleven rather complicated ν-dependent terms.\nAfter transformation to the EOB format, the dynamical information contained\nin these eleven coefficients gets compactified into the very simple additional\ncontribution + 2 ν u3 in A(R), together with an equally simple contribution in\nthe radial metric coefficient: (A(R) B(R))2PN = 1 − 6 ν u2 . This compactification process is even more drastic when one goes to the next (conservative)\npost-Newtonian order: the 3PN level, i.e. additional terms of order O(1/c6 ) in\nthe Hamiltonian (5). As mentioned above, the complete obtention of the 3PN\ndynamics has represented quite a theoretical challenge and the final, resulting\nHamiltonian is quite complicated. Even after going to the center of mass frame,\nthe 3PN additional contribution c16 H6 (q, p) to Eq. (5) introduces eleven new\ncomplicated ν-dependent coefficients. After transformation to the EOB format\n[3], these eleven new coefficients get 'compactified' into only three additional\nterms: (i) an additional contribution to A(R), (ii) an additional contribution\nto B(R), and (iii) a O(p4 ) modification of the 'external' geodesic Hamiltonian.\next\nFor instance, the crucial 3PN g00\nmetric coefficient becomes\nA3PN (R) = 1 − 2u + 2 ν u3 + a4 ν u4 ,\n\n(17)\n\nwhere\n\n94 41 2\n−\nπ ≃ 18.6879027 .\n(18)\n3\n32\nRemarkably, it is found that the very simple 2PN energy map Eq. (15) does not\nneed to be modified at the 3PN level.\nThe fact that the 3PN coefficient a4 in the crucial 'effective radial potential'\nA3PN (R), Eq. (17), is rather large and positive indicates that the ν-dependent\nnonlinear gravitational effects lead, for comparable masses (ν ∼ 41 ), to a last\nstable (circular) orbit (LSO) which has a higher frequency and a larger binding\nenergy than what a naive scaling from the test-particle limit (ν → 0) would\nsuggest. Actually, the PN-expanded form (17) of A3PN (R) does not seem to\nbe a good representation of the (unknown) exact function AEOB (R) when the\n(Schwarzschild-like) relative coordinate R becomes smaller than about 6GM/c2\n(which is the radius of the LSO in the test-mass limit). It was therefore suggested [3] to further resum8 A3PN (R) by replacing it by a suitable Padé (P )\napproximant. For instance, the replacement of A3PN (R) by\na4 =\n\nA13 (R) ≡ P31 [A3PN (R)] =\nensures that the ν =\n\n1\n4\n\n1 + n1 u\n1 + d1 u + d2 u2 + d3 u3\n\n(19)\n\ncase is smoothly connected with the ν = 0 limit.\n\n8 The PN-expanded EOB building blocks A(R), B(R), . . . already represent a resummation\nof the PN dynamics in the sense that they have compactified the many terms of the original\nPN-expanded Hamiltonian within a very concise format. But one should not refrain to further\nresum the EOB building blocks themselves, if this is physically motivated.\n\n10\n\n\fThe use of (19) was suggested before one had any (reliable) non-perturbative\ninformation on the binding of close black hole binaries. Later, a comparison\nwith some 'waveless' numerical simulations of circular black hole binaries [69]\nhas given some evidence that (19) is physically adequate. In Refs. [4, 69] it was\nalso emphasized that, in principle, the comparison between numerical data and\nEOB-based predictions should allow one to determine the effect of the unknown\nhigher PN contributions to Eq. (17). For instance, one can add a 4PN-like\nterm + a5 ν u5 in Eq. (17), and then Padé the resulting radial function, say\nA14 = P41 [A3PN + a5 ν u5 ]. Comparing the predictions of A14 [a5 ] to numerical\ndata might then determine what is the physically preferred 'effective' value of\nthe unknown coefficient a5 . This is an example of the useful flexibility [70]\nof analytical approaches: the fact that one can tap numerically-based, nonperturbative information to improve the EOB approach.\n\n4\n\nDescription of radiation-reaction effects in the\nEffective One Body approach\n\nIn the previous Section we have described how the EOB method encodes the\nconservative part of the relative orbital dynamics into the dynamics of an 'effective' particle. Let us now briefly discuss how to complete the EOB dynamics\nby defining a resummed expression describing radiation reaction effects. One\nis interested in circularized binaries, which have lost their initial eccentricity\nunder the influence of radiation reaction. For such systems, it is enough to\ninclude a radiation reaction force in the pφ equation of motion. More precisely,\nwe are using phase space variables r, pr , φ, pφ associated to polar coordinates\n(in the equatorial plane θ = π2 ). Actually it is convenient to replace the radial\nmomentum\npr by the momentum conjugate to the 'tortoise' radial coordinate\nR\nR∗ = dR(B/A)1/2 , i.e. PR∗ = (A/B)1/2 PR . The\n√ real EOB Hamiltonian is\ntotal\nobtained by first solving Eq. (15) to get Ereal\n= s in terms of Eeff , and then\nby solving the effective Hamiltonian-Jacobi equation9 to get Eeff in terms of the\neffective phase space coordinates qeff and peff . The result is given by two nested\nsquare roots (we henceforth set c = 1):\nĤEOB (r, pr∗ , φ) =\nwhere\nĤeff =\n\nreal\nHEOB\n=\nM\n\nq\n1 + 2ν (Ĥeff − 1) ,\n\ns\n\n\u0012\n\u0013\np2φ\np4\np2r∗ + A(r) 1 + 2 + z3 r2∗ ,\nr\nr\n\n(20)\n\n(21)\n\nwith z3 = 2ν (4 − 3ν). Here, we are using suitably rescaled dimensionless (effective) variables: r = R/GM , pr∗ = PR∗ /μ, pφ = Pφ /μ GM , as well as a rescaled\n\n9 Completed\n\nby the O(p4 ) terms that must be introduced at 3PN.\n\n11\n\n\ftime t = T /GM . This leads to equations of motion of the form\n\u0012\n\nA\nB\n\n\u00131/2\n\ndpr∗\n=−\ndt\n\n\u0012\n\nA\nB\n\ndr\n=\ndt\n\nΩ≡\n\n∂ ĤEOB\n,\n∂ pr∗\n\n\u00131/2\n\n∂ ĤEOB\n,\n∂r\n\ndφ\n∂ ĤEOB\n,\n=\ndt\n∂ pφ\n\ndpφ\n= F̂φ .\n(22)\ndt\nAs explained above the EOB metric function A(r) is defined by Padé resumming\nthe Taylor-expanded result (10) obtained from the matching between the real\nand effective energy levels (one uses a similar Padé resumming for B(r), or\nrather for D(r) ≡ A(r) B(r)). One similarly needs to resum the φ component\nof the radiation reaction which has been introduced on the r.h.s. of the last\nequation (22). During the quasi-circular inspiral F̂φ is known (from the PN\nwork mentioned in Section 2 above) in the form of a Taylor expansion of the\nform\n32\nF̂φTaylor = − ν Ω5 rω4 F̂ Taylor (vφ ) ,\n(23)\n5\nwhere vφ ≡ Ω rω , rω ≡ r ψ 1/3 (with ψ defined as in Eq. (22) of [71]), and\nF̂ Taylor (v)\n\n= 1 + A2 (ν) v 2 + A3 (ν) v 3 + A4 (ν) v 4 + A5 (ν) v 5\n+ A6 (ν, log v) v 6 + A7 (ν) v 7 + A8 (ν = 0, log v) v 8 ,\n\n(24)\n\nwhere we have added to the known 3.5PN-accurate comparable-mass result the\nsmall-mass-ratio 4PN contribution [72].\nFollowing [32], one resums F̂ Taylor by using the following Padé resummation\napproach. First, one chooses a certain number vpole which is intended to represent the value of vφ at which the exact angular momentum flux would become\ninfinite if one were to formally analytically continue F̂φ along unstable circular\norbits below the Last Stable Orbit (LSO): then, given vpole , one defines the\nresummed F̂ (vφ ) as\nF̂ resummed(vφ ) =\n\n\u0012\n\u0013−1\n\u0013\n\u0015\n\u0014\u0012\nvφ\nvφ\n1−\nF̂ Taylor (vφ ) ,\nP44 1 −\nvpole\nvpole\n\n(25)\n\nwhere P44 denotes a (4, 4) Padé approximant. It has recently been shown [24]\nthat the flexibility in the choice of vpole could be advantageously used to get\na close agreement with NR data. The quality of the agreement with NR data\nobtained by such a 'flexed' Padé resummation is illustrated (in the small massratio limit) in Fig. 2.\n\n12\n\n\fExact\n6\n−1/2\nv ,v =3\npole\n\n1.1\n\n6\n\nv ,v\n\n= 0.53\n\nF 3(v)/F (v)\n\npole\n\nN\n\n1.05\n\nP\n\n3\n\n1\n\n0.95\n0.1\n\n0.15\n\n0.2\n\n0.25\n\n0.3\n\n0.35\n\n0.4\n\nv\nFigure 2: This figure illustrates how the Padé resummation of the (Newtonnormalized) 3PN-expanded angular momentum flux F̂ Taylor (v) = F (v)/FN (v)\nnicely agrees with the exact, numerical flux when using a suitably 'flexed' value\nof vpole . The solid curve is the exact, numerical flux [76]. The empty circles\ndenote the (3, 3) Padé resummation using vpole = 0.53. The dashed curve, below\n√\nthe other two, denote the (3,3) Padé resummation using the value vpole = 1/ 3,\nas originally suggested [32].\nLet us note that the EOB method is not restricted to planar motions. In\nparticular, the entire method has been extended to the case of circularized\nmotions of spinning black holes [4, 5, 75]. In this case, one must work with\nmore phase space variables, q, p, S1 and S2 , and include spin effects in the\nradiation reaction.\n\n5\n\nEffective One Body waveforms\n\nTo end this brief review, let us sketch the definition of accurate waveforms\nwithin the EOB approach. The construction of EOB waveforms is based on\nseveral separate inputs:\n• high-accuracy, PN-expanded inspiralling waveforms as basic inputs (see\nreferences above);\n• a specific resummation of the inspiral-plus-plunge waveform hinsplunge (t)\n(which includes the resummation of an infinite number of 'leading log13\n\n\farithms' entering the Multipolar-post-Minkowskian expansion of tail effects, the resummation of the 5PN-accurate10 'non-tail' l = 2, m = 2\nwaveform11, and the parametrization of some non-quasi-circular effects)\n[23, 24]:\nr\n\u0012 2\u0013\nRc\nπ\nNQC −2iΦ\nhinsplunge\n(t)\n=\n−8\nν(rω Ω)2 F22 f22\ne\n;\n(26)\n22\nGM\n5\n• a simplified representation of the transition between plunge and ring-down\nby smoothly matching, on a (2p + 1)-toothed \"comb\" (tm − pδ, . . . , tm −\nδ, tm , tm +δ, . . . , tm +pδ) centered around a matching time tm , the inspiralplus-plunge waveform to a ring-down waveform, made of the superposition\nof several12 quasi-normal-mode complex frequencies,\n\u0012 2\u0013\nX\n+\nRc\n+ −σN\n(t−tm )\nhringdown\n(t) =\nCN\ne\n,\n(27)\n22\nGM\nN\n\n+\nwith σN\n= αN + i ωN , and where the label N refers to indices (l, l′ , m, n),\nwith (l, m) = (2, 2) being the Schwarzschild-background multipolarity of\nthe considered (metric) waveform hlm , with n = 0, 1, 2 . . . being the 'overtone number' of the considered Kerr-background Quasi-Normal-Mode, and\nl′ the degree of its associated spheroidal harmonics Sl′ m (aσ, θ). As discussed in [2] and [23] the physics of the transition between plunge and ringdown (which was first understood in the classic work of Davis, Ruffini and\nTiomno [33]) suggests to choose as matching time tm , in the comparablemass case, the EOB time when the EOB orbital frequency Ω(t) reaches\nits maximum value.\n\nHere, we have been describing the 3+2 -PN-accurate resummed EOB waveform introduced in [23, 24]. A less accurate, restricted (0-PN) EOB waveform\n(together with a simplified matching procedure; δ → 0) has been used by Buonanno and collaborators [21].\nFinally, one defines a complete, quasi-analytical EOB waveform (covering\nthe full process from inspiral to ring-down) as:\ninsplunge\nhEOB\n(t) + θ(t − tm ) hringdown\n(t) ,\n22 (t) = θ(tm − t) h22\n22\n\n(28)\n\nwhere θ(t) denotes Heaviside's step function.\nAn example of this complete EOB waveform is represented in Fig. 3.\n10 The 3PN-accurate part of the 'non-tail' waveform is known in the comparable-mass case\nν 6= 0. The 4PN and 5PN pieces are only known in the test-mass limit ν → 0 [72, 73].\n11 See [74] for an independent derivation of the non-resummed 3PN-accurate l = 2, m = 2\nwaveform.\n12 Refs. [23, 25] use p = 2, i.e. a 5-teethed comb, and, correspondingly, 5 positive-frequency\nKerr Quasi-Normal Modes.\n\n14\n\n\f2\n1.5\n\n0.5\n\n22\n\nRe(rh )/ν\n\n1\n\n0\n\n−0.5\n−1\n−1.5\n−2\n0\n\n500\n\n1000\n\n1500\n\n2000\n\n2500\n\n3000\n\n3500\n\nt\nFigure 3: This figure illustrates a complete resummed EOB quadrupolar (l = 2,\nm = 2) waveform (28) (using a5 = 20, āRR = 30 and a suitably flexed vpole ),\nwith, about, 29 GW cycles of inspiral, ∼ 1 GW cycle during plunge, and ∼ 4\nGW cycles of ring-down. Ref. [24] has shown that the inspiral part of the EOB\nwaveform agreed with the Caltech-Cornell NR data [17] within ±0.001 GW\ncycles, while Ref. [25] has shown that the late-inspiral-plunge-ringdown part\nof the EOB waveform agrees with an Albert Einstein Institute NR waveform\nwithin ±0.005 GW cycles.\nRecent comparisons between EOB waveforms and full, 3-dimensional NR\nwaveforms have exhibited an excellent level of agreement. After a preliminary comparison done in [19], Buonanno et al. [21] compared restricted EOB\nwaveforms to NR waveforms computed by the NASA-Goddard group. In the\nequal-mass case (ν = 1/4), they found that the dephasing between (restricted)\nEOB and NR waveforms (covering late inspiral, merger and ring-down) stayed\nwithin ±0.030 GW cycles over 14 GW cycles. In the case of a mass ratio 4 : 1\n(ν = 0.16), the dephasing stayed within ±0.035 GW cycles over 9 GW cycles.\nThe resummed EOB waveform has been compared to two different (equal-mass)\nNR waveforms: (i) in the comparison with the very accurate inspiralling simulation of the Caltech-Cornell group [17] the dephasing stayed smaller than ±0.001\nGW cycles over 30 GW cycles (and the amplitudes agreed at the ∼ 10−3 level)\n[24]; (ii) in the comparison with a late-inspiral-merger-ringdown NR waveform\ncomputed by the Albert Einstein Institute group, the dephasing stayed smaller\nthan ±0.005 GW cycles over 12 GW cycles. See Ref. [77] for another EOB/NR\ncomparison. All these comparisons have used the natural flexibility of the EOB\n15\n\n\fformalism [4, 70], i.e. the possibility to tune EOB parameters representing yet\nuncalculated effects (such as a5 in A(r) or vpole ).\nWe hope to have shown here the usefulness of the EOB formalism in accurately describing the general relativistic motion and radiation of coalescing\nblack hole binaries.\n\nAcknowledgments. I thank Alessandro Nagar for many fruitful interactions,\nand the conveners of the Second Stueckelberg meeting for organizing a stimulating workshop. I am also grateful to Alessandro Nagar and Marie-Claude Vergne\nfor help with the figures, and Eric Poisson for providing the data of Fig. 2.\n\n16\n\n\fReferences\n[1] A. Buonanno and T. Damour: Effective one-body approach to general relativistic two-body dynamics, Phys. Rev. D 59, 084006 (1999)\n[arXiv:gr-qc/9811091].\n[2] A. Buonanno and T. Damour: Transition from inspiral to plunge\nin binary black hole coalescences, Phys. Rev. D 62, 064015 (2000)\n[arXiv:gr-qc/0001013].\n[3] T. Damour, P. Jaranowski and G. Schäfer: On the determination of\nthe last stable orbit for circular general relativistic binaries at the\nthird post-Newtonian approximation, Phys. Rev. D 62, 084011 (2000)\n[arXiv:gr-qc/0005034].\n[4] T. Damour: Coalescence of two spinning black holes: An effective onebody approach, Phys. Rev. D 64, 124013 (2001) [arXiv:gr-qc/0103018].\n[5] A. Buonanno, Y. Chen and T. Damour: Transition from inspiral to plunge\nin precessing binaries of spinning black holes, Phys. Rev. D 74, 104005\n(2006) [arXiv:gr-qc/0508067].\n[6] F. Pretorius: Evolution of binary black hole spacetimes, Phys. Rev. Lett.\n95 (2005) 121101, arXiv:gr-qc/0507014.\n[7] M. Campanelli, C. O. Lousto, P. Marronetti and Y. Zlochower: Accurate\nevolutions of orbiting black-hole binaries without excision, Phys. Rev. Lett.\n96, 111101 (2006) [arXiv:gr-qc/0511048].\n[8] M. Campanelli, C. O. Lousto and Y. Zlochower: Gravitational radiation\nfrom spinning-black-hole binaries: The orbital hang up, Phys. Rev. D 74,\n041501 (2006) [arXiv:gr-qc/0604012].\n[9] J. G. Baker, J. Centrella, D. I. Choi, M. Koppitz and J. van Meter: Binary\nblack hole merger dynamics and waveforms, Phys. Rev. D 73, 104002\n(2006) [arXiv:gr-qc/0602026].\n[10] J. G. Baker, J. Centrella, D. I. Choi, M. Koppitz, J. R. van Meter and\nM. C. Miller: Getting a kick out of numerical relativity, Astrophys. J.\n653, L93 (2006) [arXiv:astro-ph/0603204].\n[11] J. G. Baker, M. Campanelli, F. Pretorius and Y. Zlochower: Comparisons\nof binary black hole merger waveforms, Class. Quant. Grav. 24, S25 (2007)\n[arXiv:gr-qc/0701016].\n[12] J. A. Gonzalez, U. Sperhake, B. Bruegmann, M. Hannam and S. Husa: Total recoil: the maximum kick from nonspinning black-hole binary inspiral,\nPhys. Rev. Lett. 98, 091101 (2007) [arXiv:gr-qc/0610154].\n\n17\n\n\f[13] S. Husa, J. A. Gonzalez, M. Hannam, B. Bruegmann and U. Sperhake:\nReducing phase error in long numerical binary black hole evolutions with\nsixth order finite differencing, arXiv:0706.0740v1 [gr-qc].\n[14] M. Koppitz, D. Pollney, C. Reisswig, L. Rezzolla, J. Thornburg, P. Diener and E. Schnetter: Getting a kick from equal-mass binary black hole\nmergers, Phys. Rev. Lett. 99, 041102 (2007) [arXiv:gr-qc/0701163].\n[15] L. Rezzolla, E. N. Dorband, C. Reisswig, P. Diener, D. Pollney, E. Schnetter and B. Szilagyi: Spin Diagrams for Equal-Mass Black-Hole Binaries\nwith Aligned Spins, arXiv:0708.3999 [gr-qc].\n[16] L. Rezzolla, P. Diener, E. N. Dorband, D. Pollney, C. Reisswig, E. Schnetter and J. Seiler: The final spin from the coalescence of aligned-spin blackhole binaries, The Astrophysical Journal, Volume 674, Issue 1, pp. L29-L32\n(2008), arXiv:0710.3345 [gr-qc].\n[17] M. Boyle et al.: High-accuracy comparison of numerical relativity simulations with post-Newtonian expansions, Phys. Rev. D 76, 124038 (2007)\n[arXiv:0710.0158 [gr-qc]].\n[18] F. Pretorius: Binary Black Hole Coalescence, The 'final version' of this\nLecture Note will appear in the book: 'Relativistic Objects in Compact Binaries: From Birth to Coalescence' Editor: Colpi et al. Pulisher: Springer\nVerlag, Canopus Publishing Limited, arXiv:0710.1338 [gr-qc].\n[19] A. Buonanno, G. B. Cook and F. Pretorius: Inspiral, merger and ringdown of equal-mass black-hole binaries, Phys. Rev. D 75, 124018 (2007),\narXiv:gr-qc/0610122.\n[20] Y. Pan et al.: A data-analysis driven comparison of analytic and numerical\ncoalescing binary waveforms: nonspinning case, Phys. Rev. D 77, 024014\n(2008), arXiv:0704.1964[gr-qc].\n[21] A. Buonanno, Y. Pan, J. G. Baker, J. Centrella, B. J. Kelly,\nS. T. McWilliams and J. R. van Meter: Toward faithful templates for nonspinning binary black holes using the effective-one-body approach, Phys.\nRev. D 76, 104049 (2007), [arXiv:0706.3732 [gr-qc]].\n[22] T. Damour and A. Nagar: Final spin of a coalescing black-hole binary: an Effective-One-Body approach, Phys. Rev. D 76, 044003 (2007),\narXiv:0704.3550v2 [gr-qc].\n[23] T. Damour and A. Nagar: Faithful Effective-One-Body waveforms of\nsmall-mass-ratio coalescing black-hole binaries, Phys. Rev. D 76, 064028\n(2007), [arXiv:0705.2519 [gr-qc]].\n[24] T. Damour and A. Nagar: Comparing Effective-One-Body gravitational\nwaveforms to accurate numerical data, Phys. Rev. D 77, 024043 (2008),\narXiv:0711.2628 [gr-qc].\n18\n\n\f[25] T. Damour, A. Nagar, E. N. Dorband, D. Pollney and L. Rezzolla: Faithful Effective-One-Body waveforms of equal-mass coalescing black-hole binaries, Submitted to Phys. Rev. D, arXiv:0712.3003v1 [gr-qc].\n[26] P. Ajith et al.: Phenomenological template family for black-hole coalescence waveforms, Class. Quant. Grav. 24, S689 (2007), [arXiv:0704.3764\n[gr-qc]].\n[27] M. Hannam, S. Husa, U. Sperhake, B. Brugmann and J. A. Gonzalez:\nWhere post-Newtonian and numerical-relativity waveforms meet, to be\npublished in Physical Review D15, arXiv:0706.1305 [gr-qc].\n[28] P. Ajith et al.: A template bank for gravitational waveforms from coalescing binary black holes: I. non-spinning binaries, arXiv:0710.2335 [gr-qc].\n[29] A. Gopakumar, M. Hannam, S. Husa and B. Brugmann: Comparison between numerical relativity and a new class of post-Newtonian gravitationalwave phase evolutions: the non-spinning equal-mass case, arXiv:0712.3737\n[gr-qc].\n[30] M. Hannam, S. Husa, B. Brügmann and A. Gopakumar: Comparison between numerical-relativity and post-Newtonian waveforms from spinning\nbinaries: the orbital hang-up case, arXiv:0712.3787v2 [gr-qc].\n[31] E. Brezin, C. Itzykson and J. Zinn-Justin: Relativistic balmer formula\nincluding recoil effects, Phys. Rev. D 1, 2349 (1970).\n[32] T. Damour, B. R. Iyer and B. S. Sathyaprakash: Improved filters for gravitational waves from inspiralling compact binaries, Phys. Rev. D 57, 885\n(1998) [arXiv:gr-qc/9708034].\n[33] M. Davis, R. Ruffini and J. Tiomno: Pulses of gravitational radiation of\na particle falling radially into a schwarzschild black hole, Phys. Rev. D 5,\n2932 (1972).\n[34] R. H. Price and J. Pullin: Colliding black holes: The Close limit, Phys.\nRev. Lett. 72, 3297 (1994) [arXiv:gr-qc/9402039].\n[35] T. Damour and N. Deruelle: Radiation Reaction And Angular Momentum\nLoss In Small Angle Gravitational Scattering, Phys. Lett. A 87, 81 (1981).\n[36] T. Damour: Gravitational Radiation And The Motion Of Compact Bodies, 1983. in Gravitational Radiation, edited by N. Deruelle and T. Piran,\nNorth-Holland, Amsterdam, pp 59-144.\n[37] G. Schäfer, The gravitational quadrupole radiation reaction force and the\ncanonical formalism of ADM, Annals Phys. 161, 81 (1985).\n[38] S. M. Kopejkin: Astron. Zh. 62, 889-904 (1985).\n\n19\n\n\f[39] P. Jaranowski and G. Schäfer: 3rd post-Newtonian higher order Hamilton\ndynamics for two-body point-mass systems, Phys. Rev. D 57 (1998) 72747291; Erratum-ibid. D 63 (2001) 029902, arXiv:gr-qc/9712075.\n[40] L. Blanchet and G. Faye: General relativistic dynamics of compact binaries at the third post-Newtonian order, Phys. Rev. D 63 (2001) 062005,\narXiv:gr-qc/0007051.\n[41] T. Damour, P. Jaranowski and G. Schäfer: Dimensional regularization\nof the gravitational interaction of point masses, Phys. Lett. B 513, 147\n(2001), arXiv:gr-qc/0105038.\n[42] L. Blanchet, T. Damour and G. Esposito-Farèse: Dimensional regularization of the third post-Newtonian dynamics of point particles in harmonic\ncoordinates, Phys. Rev. D 69, 124007 (2004), arXiv:gr-qc/0311052.\n[43] Y. Itoh and T. Futamase: New derivation of a third post-Newtonian equation of motion for relativistic compact binaries without ambiguity, Phys.\nRev. D 68, 121501(R), (2003).\n[44] M. E. Pati and C. M. Will: Post-Newtonian gravitational radiation and\nequations of motion via direct integration of the relaxed Einstein equations.\nII: Two-body equations of motion to second post-Newtonian order, and\nradiation-reaction to 3.5 post-Newton, Phys. Rev. D 65, 104008 (2002),\narXiv:gr-qc/0201001.\n[45] C. Königsdörffer, G. Faye and G. Schäfer: Binary black-hole dynamics at\nthe third-and-a-half post-Newtonian order in the ADM formalism, Phys.\nRev. D 68, 044004-1-19 (2003).\n[46] S. Nissanke and L. Blanchet: Gravitational radiation reaction in the equations of motion of compact binaries to 3.5 post-Newtonian order, Class.\nQuant. Grav. 22, 1007 (2005), arXiv:gr-qc/0412018.\n[47] L. Blanchet and T. Damour: Radiative gravitational fields in general relativity I. General structure of the field outside the source, Phil. Trans. R.\nSoc. Lond. A320 (1986), pp 379-430.\n[48] L. Blanchet and T. Damour: Post-Newtonian generation of gravitational\nwaves, Ann. IHP 50 (1989), pp. 377-408.\n[49] T. Damour and B. R. Iyer: Multipole analysis for electromagnetism and\nlinearized gravity with irreducible Cartesian tensors, Physical Review D\n43 (1991), pp. 3259-3272.\n[50] T. Damour and B. R. Iyer: Post-Newtonian generation of gravitational\nwaves II. The spin moments., Ann. IHP 54 (1991), pp. 115-164.\n[51] L. Blanchet and T. Damour: Hereditary effects in gravitational radiation,\nPhys. Rev. D 46 (1992), pp. 4304-4319.\n20\n\n\f[52] L. Blanchet: Second post-Newtonian generation of gravitational radiation,\nPhys. Rev. D 51, 2559 (1995), arXiv:gr-qc/9501030.\n[53] L. Blanchet: Gravitational-wave tails of tails, Class. Quant. Grav. 15, 113\n(1998) [Erratum-ibid. 22, 3381 (2005)], arXiv:gr-qc/9710038.\n[54] C. M. Will and A. G. Wiseman: Gravitational radiation from compact\nbinary systems: gravitational waveforms and energy loss to second postNewtonian order, Phys.Rev. D 54, 4813 (1996), arXiv:gr-qc/9608012.\n[55] C. M. Will: Generation of post-Newtonian gravitational radiation via\ndirect integration of the relaxed Einstein equations, Prog. Theor. Phys.\nSuppl. 136 (1999) 158-167, arXiv:gr-qc/9910057.\n[56] M. E. Pati and C. M. Will: Post-Newtonian gravitational radiation and\nequations of motion via direct integration of the relaxed Einstein equations.\nI. Foundations, Phys. Rev. D 62 (2000) 124015, arXiv:gr-qc/0007087.\n[57] L. Blanchet, T. Damour, B. R. Iyer, C. M. Will and A. G. Wiseman: Gravitational radiation damping of compact binary systems to second postNewtonian order, Phys. Rev. Lett. 74, 3515 (1995), arXiv:gr-qc/9501027.\n[58] L. Blanchet, T. Damour and B. R. Iyer: Gravitational waves from inspiralling compact binaries: Energy loss and wave form to second postNewtonian order, Phys. Rev. D 51, 5360 (1995) [Erratum-ibid. D 54, 1860\n(1996)], arXiv:gr-qc/9501029.\n[59] L. Blanchet, B. R. Iyer and B. Joguet: Gravitational waves from inspiralling compact binaries: Energy flux to third post-Newtonian order, Phys. Rev. D 65 (2002) 064005; Erratum-ibid. D71 (2005) 129903,\narXiv:gr-qc/0105098.\n[60] L. Blanchet and B. R. Iyer: Hadamard regularization of the third postNewtonian gravitational wave generation of two point masses, Phys. Rev.\nD 71 (2005) 024004, arXiv:gr-qc/0409094.\n[61] A. G. Wiseman: Coalescing binary systems of compact objects to\n(post)5/2 -Newtonian order. IV. The gravitational wave tail , Phys. Rev.\nD 48, 4757-4770 (1993).\n[62] L. Blanchet and G. Schäfer: Gravitational wave tails, Class. Q. Grav. 10\n2699-2721 (1993).\n[63] L. Blanchet, T. Damour, G. Esposito-Farèse and B. R. Iyer: Dimensional regularization of the third post-Newtonian gravitational wave\ngeneration from two point masses, Phys. Rev. D 71 (2005) 124004,\narXiv:gr-qc/0503044.\n[64] L. Blanchet: Gravitational radiation from post-Newtonian sources and\ninspiralling compact binaries, Living Rev. Rel. 5, 3 (2002); Updated article:\nhttp://www.livingreviews.org/lrr-2006-4.\n21\n\n\f[65] J. G. Baker, S. T. McWilliams, J. R. van Meter, J. Centrella, D.-I. Choi,\nB. J. Kelly and M. Koppitz: Binary black hole late inspiral: Simulations for gravitational wave observations, Phys. Rev. D 75 (2007) 124024,\n[gr-qc/0612117].\n[66] L. Blanchet, T. Damour, G. Esposito-Farèse and B. R. Iyer: Gravitational\nradiation from inspiralling compact binaries completed at the third postNewtonian order, Phys. Rev. Lett. 93 (2004) 091101, arXiv:gr-qc/0406012.\n[67] L. Blanchet, G. Faye, B. R. Iyer and B. Joguet: Gravitational-wave inspiral\nof compact binary systems to 7/2 post-Newtonian order, Phys. Rev. D 65,\n061501 (2002) [Erratum-ibid. D 71, 129902 (2005)], arXiv:gr-qc/0105099.\n[68] T. Damour and G. Schäfer: Higher order relativistic periastron advances\nand binary pulsars: Nuovo Cim. B 101, 127 (1988).\n[69] T. Damour, E. Gourgoulhon and P. Grandclement: Circular orbits of corotating binary black holes: Comparison between analytical and numerical\nresults, Phys. Rev. D 66, 024007 (2002), arXiv:gr-qc/0204011.\n[70] T. Damour, B. R. Iyer, P. Jaranowski and B. S. Sathyaprakash: Gravitational waves from black hole binary inspiral and merger: The span\nof third post-Newtonian effective-one-body templates, Phys. Rev. D 67,\n064028 (2003) [arXiv:gr-qc/0211041].\n[71] T. Damour and A. Gopakumar: Gravitational recoil during binary black\nhole coalescence using the effective one body approach, Phys. Rev. D 73,\n124006 (2006) [arXiv:gr-qc/0602117].\n[72] H. Tagoshi and M. Sasaki: PostNewtonian expansion of gravitational\nwaves from a particle in circular orbit around a Schwarzschild black hole,\nProg. Theor. Phys. 92, 745 (1994) [arXiv:gr-qc/9405062].\n[73] T. Tanaka, H. Tagoshi and M. Sasaki: Gravitational Waves by a\nParticle in Circular Orbits around a Schwarzschild black hole – 5.5\nPost-Newtonian Formula –, Prog. Theor. Phys. 96 (1996) 1087-1101,\n[arXiv:gr-qc/9701050v1].\n[74] L. E. Kidder: Using Full Information When Computing Modes of PostNewtonian Waveforms From Inspiralling Compact Binaries in Circular Orbit, to be published in Physical Review D15, arXiv:0710.0614v1 [gr-qc].\n[75] T. Damour, P. Jaranowski and G. Schäfer: 2008, to be submitted.\n[76] E. Poisson: Gravitational radiation from a particle in circular orbit\naround a black hole. 6. Accuracy of the postNewtonian expansion,\nPhys. Rev. D 52, 5719 (1995) [Addendum-ibid. D 55, 7980 (1997)]\n[arXiv:gr-qc/9505030].\n[77] T. Damour, A. Nagar et al.: in preparation.\n\n22\n\n\f"}