{"id": "http://arxiv.org/abs/0807.4260v2", "guidislink": true, "updated": "2008-10-31T15:09:43Z", "updated_parsed": [2008, 10, 31, 15, 9, 43, 4, 305, 0], "published": "2008-07-26T22:09:24Z", "published_parsed": [2008, 7, 26, 22, 9, 24, 5, 208, 0], "title": "Poincare dodecahedral space parameter estimates", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0807.0411%2C0807.4175%2C0807.2489%2C0807.2216%2C0807.0256%2C0807.1098%2C0807.4541%2C0807.2853%2C0807.5070%2C0807.1425%2C0807.2635%2C0807.0609%2C0807.3280%2C0807.1058%2C0807.3201%2C0807.4260%2C0807.5137%2C0807.0359%2C0807.3656%2C0807.1048%2C0807.4585%2C0807.1733%2C0807.2239%2C0807.3808%2C0807.4380%2C0807.2483%2C0807.2927%2C0807.0217%2C0807.1972%2C0807.4484%2C0807.3963%2C0807.0185%2C0807.4276%2C0807.4706%2C0807.4872%2C0807.4553%2C0807.0764%2C0807.2836%2C0807.0759%2C0807.3522%2C0807.1233%2C0807.3016%2C0807.4932%2C0807.4272%2C0807.2358%2C0807.4666%2C0807.1072%2C0807.3826%2C0807.4864%2C0807.2284%2C0807.3320%2C0807.1618%2C0807.1020%2C0807.3755%2C0807.2601%2C0807.2046%2C0807.4213%2C0807.4628%2C0807.1001%2C0807.0869%2C0807.2906%2C0807.3474%2C0807.0757%2C0807.3158%2C0807.1238%2C0807.1279%2C0807.1277%2C0807.0635%2C0807.1773%2C0807.2040%2C0807.3943%2C0807.1251%2C0807.2400%2C0807.1996%2C0807.2296%2C0807.1761%2C0807.1107%2C0807.0681%2C0807.2592%2C0807.1101%2C0807.4910%2C0807.1497%2C0807.4151%2C0807.3869%2C0807.0586%2C0807.3868%2C0807.2524%2C0807.2302%2C0807.2776%2C0807.4754%2C0807.1408%2C0807.3336%2C0807.1113%2C0807.3442%2C0807.4231%2C0807.0427%2C0807.4852%2C0807.1121%2C0807.4946%2C0807.1860%2C0807.0360&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Poincare dodecahedral space parameter estimates"}, "summary": "We aim to improve the surface of last scattering (SLS) optimal\ncross-correlation method in order to refine estimates of the Poincar\\'e\ndodecahedral space (PDS) cosmological parameters. We analytically derive the\nformulae required to exclude points on the sky that cannot be members of close\nSLS-SLS cross-pairs. These enable more efficient pair selection without\nsacrificing uniformity of the underlying selection process. In certain cases\nthis decreases the calculation time and increases the number of pairs per\nseparation bin. (i) We recalculate Monte Carlo Markov Chains (MCMC) on the\nfive-year WMAP data; and (ii) we seek PDS solutions in a small number of\nGaussian random fluctuation (GRF) simulations. For 5 < alpha/deg < 60, a\ncalculation speed-up of 3-10 is obtained. (i) The best estimates of the PDS\nparameters for the five-year WMAP data are similar to those for the three-year\ndata. (ii) Comparison of the optimal solutions found by the MCMC chains in the\nobservational map to those found in the simulated maps yields a slightly\nstronger rejection of the simply connected model using $\\alpha$ than using the\ntwist angle $\\phi$. The best estimate of $\\alpha$ implies that_given a large\nscale auto-correlation as weak as that observed,_ the PDS-like\ncross-correlation signal in the WMAP data is expected with a probability of\nless than about 10%. The expected distribution of $\\phi$ from the GRF\nsimulations is approximately Gaussian around zero, it is not uniform on\n$[-\\pi,\\pi]$. We infer that for an infinite, flat, cosmic concordance model\nwith Gaussian random fluctuations, the chance of finding_both_ (a) a large\nscale auto-correlation as weak as that observed,_and_ (b) a PDS-like signal\nsimilar to that observed is less than about 0.015% to 1.25%.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0807.0411%2C0807.4175%2C0807.2489%2C0807.2216%2C0807.0256%2C0807.1098%2C0807.4541%2C0807.2853%2C0807.5070%2C0807.1425%2C0807.2635%2C0807.0609%2C0807.3280%2C0807.1058%2C0807.3201%2C0807.4260%2C0807.5137%2C0807.0359%2C0807.3656%2C0807.1048%2C0807.4585%2C0807.1733%2C0807.2239%2C0807.3808%2C0807.4380%2C0807.2483%2C0807.2927%2C0807.0217%2C0807.1972%2C0807.4484%2C0807.3963%2C0807.0185%2C0807.4276%2C0807.4706%2C0807.4872%2C0807.4553%2C0807.0764%2C0807.2836%2C0807.0759%2C0807.3522%2C0807.1233%2C0807.3016%2C0807.4932%2C0807.4272%2C0807.2358%2C0807.4666%2C0807.1072%2C0807.3826%2C0807.4864%2C0807.2284%2C0807.3320%2C0807.1618%2C0807.1020%2C0807.3755%2C0807.2601%2C0807.2046%2C0807.4213%2C0807.4628%2C0807.1001%2C0807.0869%2C0807.2906%2C0807.3474%2C0807.0757%2C0807.3158%2C0807.1238%2C0807.1279%2C0807.1277%2C0807.0635%2C0807.1773%2C0807.2040%2C0807.3943%2C0807.1251%2C0807.2400%2C0807.1996%2C0807.2296%2C0807.1761%2C0807.1107%2C0807.0681%2C0807.2592%2C0807.1101%2C0807.4910%2C0807.1497%2C0807.4151%2C0807.3869%2C0807.0586%2C0807.3868%2C0807.2524%2C0807.2302%2C0807.2776%2C0807.4754%2C0807.1408%2C0807.3336%2C0807.1113%2C0807.3442%2C0807.4231%2C0807.0427%2C0807.4852%2C0807.1121%2C0807.4946%2C0807.1860%2C0807.0360&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We aim to improve the surface of last scattering (SLS) optimal\ncross-correlation method in order to refine estimates of the Poincar\\'e\ndodecahedral space (PDS) cosmological parameters. We analytically derive the\nformulae required to exclude points on the sky that cannot be members of close\nSLS-SLS cross-pairs. These enable more efficient pair selection without\nsacrificing uniformity of the underlying selection process. In certain cases\nthis decreases the calculation time and increases the number of pairs per\nseparation bin. (i) We recalculate Monte Carlo Markov Chains (MCMC) on the\nfive-year WMAP data; and (ii) we seek PDS solutions in a small number of\nGaussian random fluctuation (GRF) simulations. For 5 < alpha/deg < 60, a\ncalculation speed-up of 3-10 is obtained. (i) The best estimates of the PDS\nparameters for the five-year WMAP data are similar to those for the three-year\ndata. (ii) Comparison of the optimal solutions found by the MCMC chains in the\nobservational map to those found in the simulated maps yields a slightly\nstronger rejection of the simply connected model using $\\alpha$ than using the\ntwist angle $\\phi$. The best estimate of $\\alpha$ implies that_given a large\nscale auto-correlation as weak as that observed,_ the PDS-like\ncross-correlation signal in the WMAP data is expected with a probability of\nless than about 10%. The expected distribution of $\\phi$ from the GRF\nsimulations is approximately Gaussian around zero, it is not uniform on\n$[-\\pi,\\pi]$. We infer that for an infinite, flat, cosmic concordance model\nwith Gaussian random fluctuations, the chance of finding_both_ (a) a large\nscale auto-correlation as weak as that observed,_and_ (b) a PDS-like signal\nsimilar to that observed is less than about 0.015% to 1.25%."}, "authors": ["Boudewijn F. Roukema", "Zbigniew Bulinski", "Nicolas E. Gaudin"], "author_detail": {"name": "Nicolas E. Gaudin"}, "author": "Nicolas E. Gaudin", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1051/0004-6361:200810685", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0807.4260v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0807.4260v2", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "18 pages, 19 figures, accepted in Astronomy & Astrophysics, software\n  available at http://cosmo.torun.pl/GPLdownload/dodec/ and MCMCs at\n  http://cosmo.torun.pl/GPLdownload/MCMC/ ; v2: histograms added, several minor\n  changes, matches accepted version", "arxiv_primary_category": {"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0807.4260v2", "affiliation": "ENSP, Universite Louis Pasteur", "arxiv_url": "http://arxiv.org/abs/0807.4260v2", "journal_reference": "Astronomy & Astrophysics 492 (2008) 673", "doi": "10.1051/0004-6361:200810685", "fulltext": "c ESO 2018\n\nAstronomy & Astrophysics manuscript no. annuli-aa\nSeptember 26, 2018\n\nPoincaré dodecahedral space parameter estimates\nBoudewijn F. Roukema1 , Zbigniew Buliński1 , and Nicolas E. Gaudin2\n1\n\narXiv:0807.4260v2 [astro-ph] 31 Oct 2008\n\n2\n\nToruń Centre for Astronomy, Nicolaus Copernicus University, ul. Gagarina 11, 87-100 Toruń, Poland\nÉcole nationale supérieure de physique de Strasbourg, Université Louis Pasteur, Bd. Sébastien Brant, BP 10413,\n67412 Illkirch Cedex, France\n\nLe 26 septembre 2018\nABSTRACT\nContext. Several studies have proposed that the preferred model of the comoving spatial 3-hypersurface of the Universe\nmay be a Poincaré dodecahedral space (PDS) rather than a simply connected, infinite, flat space.\nAims. Here, we aim to improve the surface of last scattering (SLS) optimal cross-correlation method and apply this to\nobservational data and simulations.\nMethods. For a given \"generalised\" PDS orientation, we analytically derive the formulae required to exclude points\non the sky that cannot be members of close SLS-SLS cross-pairs. These enable more efficient pair selection without\nsacrificing the uniformity of the underlying selection process. For a sufficiently small matched circle size α and a fixed\nnumber of randomly placed points selected for a cross-correlation estimate, the calculation time is decreased and the\nnumber of pairs per separation bin is increased. Using this faster method, and including the smallest separation bin\nwhen testing correlations, (i) we recalculate Monte Carlo Markov Chains (MCMC) on the five-year Wilkinson Microwave\nAnisotropy Probe (WMAP) data; and (ii) we seek PDS solutions in a small number of Gaussian random fluctuation\n(GRF) simulations in order to further explore the statistical significance of the PDS hypothesis.\nResults. For 5◦ < α < 60◦ , a calculation speed-up of 3–10 is obtained. (i) The best estimates of the PDS parameters\nfor the five-year WMAP data are similar to those for the three-year data. (ii) Comparison of the optimal solutions\nfound by the MCMC chains in the observational map to those found in the simulated maps yields a slightly stronger\nrejection of the simply connected model using α rather than the twist angle φ. The best estimate of α implies that,\ngiven a large-scale auto-correlation as weak as that observed, the PDS-like cross-correlation signal in the WMAP data\nis expected with a probability of less than about 10%. The expected distribution of φ from the GRF simulations is not\nuniform on [−π, π].\nConclusions. Using this faster algorithm, we find that the previous PDS parameter estimates are stable to the update\nto five-year WMAP data. Moreover, for an infinite, flat, cosmic concordance model with Gaussian random fluctuations,\nthe chance of finding both (a) a large-scale auto-correlation as weak as observed and (b) a PDS-like signal similar to\nwhat is observed is less than about 0.015% to 1.25%.\nKey words. cosmology: observations – cosmic microwave background – cosmological parameters\n\n1. Introduction\nDuring the past half-decade, attention has focussed on the\nPoincaré Dodecahedral Space (PDS) as a potentially better model of comoving space than the infinite flat model\n(Luminet et al. 2003; Roukema et al. 2004; Aurich et al.\n2005a, 2005b; Gundermann 2005; Key et al. 2007; Niarchou\n& Jaffe 2007; Caillerie et al. 2007; Lew & Roukema 2008;\nRoukema et al. 2008). If the hypothesis that the comoving\nspatial section of the Universe is a PDS is correct, then it\nshould be possible to estimate the astronomical coordinates\nof the fundamental domain, as has been tried by Roukema\net al. (2008) (hereafter, RBSG08). Moreover, successive improvements in data and analysis methods should yield successively more precise and more accurate estimates of these\nastronomical coordinates.\nHere, we aim to improve on the method of optimising\nthe cross-correlation ξC [Eq. (1), RBSG08] of cosmic microwave background (CMB) temperature fluctuations between copies of the surface of last scattering (SLS) presented in Roukema et al. (2008) and also applied by Aurich\n(2008). We investigate whether or not this can lead to im-\n\nproved parameter estimates. We also test a small number\nof simulations to see whether the infinite flat model can\nreproduce the observational signal.\nIn RBSG08, the method was introduced by pointing\nout that algebraically, it is an extension of using the identified circles principle first published by Cornish et al.\n(1996, 1998). Here, we make use of the fact that the crosscorrelation method is not only an algebraic extension of\nthe identified circles principle, but its relation to the identified circles principle can also be interpreted in terms of\nidentified annuli. This leads to algebraic/trigonometric relations that enable a faster calculation of cross-correlations,\nwithout sacrificing the uniformity of the underlying random selection of points on the sky. Moreover, use of these\nrelations also increases the numbers of pairs per separation bin, leading to less relative Poisson noise in individual\ncross-correlation estimates. The annulus interpretation and\nthe associated relations are presented in Sect. 3.1.\nIn Sect. 3.2, use of this faster method to recalculate\nMonte Carlo Markov Chains (MCMC) for the five-year release of the WMAP data is described. Since the new method\nincreases the numbers of pairs per separation bin, the small-\n\n\f2\n\nRoukema, Buliński & Gaudin: Poincaré dodecahedral space parameters\n\nest separation bin available when estimating correlations\nshould not be as noisy as without this new method, so we\ninclude this smallest separation bin.\nUse of this faster method also makes it practical to perform a consistent analysis of both the WMAP map and\na small number of Gaussian random fluctuation (GRF)\nWMAP simulated maps, in order to estimate the expectation of a PDS-like signal under the assumption of a simply connected model. In order to model this, we need to\nconsider the following.\nOne of the key motivations from WMAP data for studying multiply connected models has been the lack of structure on angular scales larger than about 60◦ , as has been\nnoted by several authors (e.g. Spergel et al. 2003; Luminet\net al. 2003; Aurich et al. 2005b). As was noted in RBSG08,\nin particular in Eq. (10), if the PDS model is incorrect,\nthen cross-correlations of temperature fluctuations at pairs\nof points that are implied (by the PDS hypothesis) to be\nspatially close should, on average, be much smaller than\nthe auto-correlations at the same small spatial separation\nscale. This is because if the PDS model is wrong, then these\npairs are in reality widely separated rather than closely separated, so their correlations should, on average, be small.\nHowever, this is only a statistical statement: even for\nthe case that the PDS model is physically wrong, it is possible that some orientations of a PDS model, by chance,\nhappen to give cross-correlations that violate Eq. (10) of\nRBSG08. How probable is it for chance large-scale correlations in particular directions to mimic a PDS-like signal?\nThis clearly depends on the amplitude of the large lengthscale auto-correlation. If this amplitude is low or high, then\nthe chance of finding PDS-like signals using the optimal\ncross-correlation method should be low or high respectively.\nSince the range of matched circle sizes α studied in RBSG08\nincluded circles with α ≤ 60◦ , most of the cross-correlations\nare from pairs of points separated observationally by angles\n◦\n>\n∼ 60 ∼ 1 rad.\nThe latter is the minimum scale above which Spergel\net al. (2003) quantified the lack of temperature-temperature\nauto-correlations at large scales in the WMAP data, with\ntheir parameter S, defined\nZ 1/2\nS=\n[C(θ)]2 d cos θ,\n(1)\n−1\n\nwhere C(θ) is the two-point auto-correlation function at\nan angular separation of θ on the SLS [Sect. 7, Eq. (9),\nSpergel et al. 2003]. Hereafter, we call this Sξ , in order to\ndistinguish it from the S parameter used for matched circle\nanalyses. The two parameters have very different meanings.\nThe chance of observing Sξ to be as small as that observed was estimated by Spergel et al. (2003) as 0.15% for\nan infinite, flat, cosmic concordance model with a fixed\nspectral index of density perturbations. Efstathiou (2004),\nusing what should be a more accurate method if we assume a simply connected model, estimated the chances to\nbe much higher, from 3% to 12.5% depending on which sky\nmap is analysed and which (if any) galactic cut mask is\nused (Table 5, Efstathiou 2004).\nWe can quantify the relation between large length-scale\nauto-correlations and the chance of a PDS signal in the\ncase that the PDS is wrong by writing that the lower the\nobserved value of Sξ , the less likely it is that a non-PDS\nmodel will give a PDS-like signal. Hence, since we expect\n\nthat the two properties, a low Sξ value and a low chance\nof a PDS-like cross-correlation signal occurring in a flat,\ninfinite, cosmic concordance model, are related, it would\nnot be useful to estimate their probabilities independently.\nInstead, what is of interest to investigate is the chance that\na PDS-like cross-correlation signal occurs, given that Sξ is\nas low as that which is observed. Conservatively, we can\ncalculate an upper limit to this conditional probability if\nwe use simulated sky maps with Sξ values a little higher\nthan the observed estimate of Sξ . Moreover, here we use\nthe kp2 galactic cut mask, for which Efstathiou (2004) finds\nthe highest probability for the observed Sξ value to occur\nin an infinite, flat, cosmic concordance model, so we should\nobtain a conservative upper limit to the probability of both\n(a) an Sξ value as low as that observed and (b) a PDS-like\ncross-correlation signal similar to that observed occurring.\nThis is described in more detail in Sect. 3.3.\nResults are presented in Sect. 4, discussed in Sect. 5\nand conclusions are given in Sect. 6. For general background on spherical, multiply connected spaces, see Weeks\n(2001), Gausmann et al. (2001), Lehoucq et al. (2002) and\nRiazuelo et al. (2004). See the references cited above for\nbackground on cosmic topology. Comoving coordinates are\nused when discussing distances (i.e. \"proper distances\" at\nthe present epoch, Weinberg 1972, equivalent to \"conformal time\" if c = 1) and the Hubble constant is written\nH0 ≡ 100h km s−1 /Mpc.\n\n2. Observations and simulations\n2.1. Observations\nThe analysis described in Sect. 3.2 uses the Internal Linear\nCombination (ILC)1 all-sky map of the five-year WMAP\ndata (Hinshaw et al. 2008) and the foreground cleaned,\nWiener filtered version of the same five-year data published\nby the Tegmark et al. (2003) group (TOH)2 The \"kp2\"\nmask to eliminate the Galactic Plane and other likely contaminating regions, covering about 15% of the sky, is used\nthroughout this paper unless otherwise noted.3 We do not\nsmooth these maps.\n2.2. Simulations and associated observational map\nThe analysis described in Sect. 3.3 uses a version of the\nWMAP map and sky simulations prepared consistently\nfrom three-year observational and simulated maps in the\nQ, V and W frequency bands, weighted by inverse noise as\ngiven in Hinshaw et al. (2003), and smoothed by a Gaussian\nof FWHM 1◦ , as described in Sect. 2 of Lew & Roukema\n(2008).4 This version of the observational map is referred\nto hereafter as \"INC3\".5\n1\nhttp://lambda.gsfc.nasa.gov/data/map/dr3/dfp/\nwmap_ilc_5yr_v3.fits\n2\nhttp://space.mit.edu/home/tegmark/wmap/\nwiener5yr_map.fits\n3\nData file: http://lambda.gsfc.nasa.gov/data/map/dr2/\nancillary/wmap_kp2_r9_mask_3yr_v2.fits;\nmap projection: http://lambda.gsfc.nasa.gov/product/map/\ncurrent/map_images/f02_int_mask_b.png.\n4\nThe\nmaps\ncan\nbe\ndownloaded\nfrom\nhttp://cosmo.torun.pl/GPLdownload/MCMC/\nsims-from-LR08-project/.\n5\nInverse Noise Coadded 3-year\n\n\fRoukema, Buliński & Gaudin: Poincaré dodecahedral space parameters\n\nAs mentioned above, the expected value of Sξ from the\ninfinite, flat, cosmic concordance model is higher than that\nobserved. However, there is a (small) chance in the model\nthat such a low Sξ value occurs in any single realisation of\nthe model, such as the one in which we live. Since we wish\nto test the chance that a PDS-like cross-correlation signal\noccurs given that Sξ is as low as that which is observed,\nwe generate simulations using the observational estimates\nof the spherical harmonic amplitudes Cl of the temperature fluctuations as estimated in Hinshaw et al. (2007),\nrather than using the mean values implied by an infinite\nflat model. The phases of the spherical harmonics are randomised. Gaussian noise is simulated according to the properties and scanning strategy of each differencing assembly\nand added to each simulated map.\nSince a lot of the large-scale power in what are considered as the best estimates of the cosmological signal in the\nWMAP data lie close to the Galactic Plane (e.g. Tegmark\net al. 2003), simulations based on spherical harmonics with\nthe same Cl 's as this signal but different phases will most of\nthe time have high large-scale power which does not happen\nto lie inside the kp2 cut. Hence, simulations made with the\nHinshaw et al. (2007) Cl estimates and masked with the\nkp2 mask will, in general, have Sξ estimates larger than\nthat which is actually observed for the part of the signal\noutside of the kp2 cut rather than approximately equal to\nit.\nThis is not due to an error in the Hinshaw et al. (2007)\nestimates (assuming a simply connected model6 ). Even\nthough these estimates for l ≤ 30 are made using nearly\nthe same kp2 cut that we use here (Hinshaw et al. 2007\nuse a kp2 cut degraded in resolution), the spherical harmonics are nevertheless functions of the full sky. Hinshaw\net al. (2007) use a maximum likelihood method which uses\nthe information from the cut sky to infer the best estimate\nof the Cl values for these functions covering the full sky.\nUnsurprisingly, it implicitly extrapolates from the cut sky\nto the full sky, and recovers some of the information masked\nin the Galactic Plane.\nSince we wish to test the chance that a PDS-like crosscorrelation signal occurs given that Sξ is as low as that\nwhich is observed, we have two obvious approaches to\nchoose from in order to have simulations which are statistically comparable with the observations. One approach\nwould be to analyse the full sky for both observations and\nsimulations. In this case, the Sξ estimates should be approximately equal. However, a large part of the signal would be\nthat from inside the Galactic Plane. The risk of implicitly\ntesting the properties of foreground contaminants rather\nthan of the cosmological signal would be high.\nThe other approach is to analyse the cut sky (with the\nkp2 mask) for both observations and simulations. This decreases the risk that our analysis will be affected by contamination from the Galactic Plane. However, for the cut\nsky, many of the simulations will have Sξ higher than Sξ of\nthe observations. In this case, it will be necessary to select\nthose simulations with the lowest values of Sξ not greater\nthan Sξ of the observational map.\n6\nFor a multiply connected model, the distributions of the various alm 's are to some degree dependent on one other, so a\nmethod which assumes they are independent can at best give\nan approximate result.\n\n3\n\nr2\nrSLS\n\nrSLS\nx\n\nα+\nπ\n5\n\nSLS\n\nRC\n\nSLS\n\nFig. 1. Relation of a spatial geodesic of length r2 joining a\n\"close\" pair of points in space to two copies of the SLS, and\nthe angle α+ separating the member of the pair on the righthand SLS from the dodecahedral face centre, i.e. from the spatial\ngeodesic joining the two SLS copies. This figure shows a spatial\ngeodesic \"external\" to the matched circles (intersection between\nthe two copies of the SLS). The centres of the two copies of the\nSLS (2-spheres) are separated by (π/5)RC . See Sect. 3.1.\n\nThis will not give an exact statistical match between\nsimulations and observations. However, since greater Sξ\nshould increase the chance of cross-correlations occurring,\nthis should give an upper limit for estimating the probability of cross-correlations occurring in a simply connected\nmodel, i.e. a conservative estimate. This is the approach we\nadopt here.\nWe estimate Sξ for each of the observational and simulational using\nZ 2rSLS\nr\n,\n(2)\n[ξA (r)]2 d\nSξ ≡\nr\nSLS\nrSLS\nwhere rSLS is the radius of the SLS, ξA (r) is the (comoving) spatial auto-correlation function as given in Eq. (4)\nof RBSG08, and r is the comoving spatial separation of a\npair of points on the SLS. This integral differs from that\nin Eq. (9) of Spergel et al. (2003), since here we focus on\nspatial separation, while Spergel et al. (2003) use an orthogonal projection of the angle between a pair of sky positions. The minimum angular separation used by the latter\nis 60◦ ≈ 1 rad, so here we use rSLS for the minimum separation. Provided that we estimate Sξ in the same way for both\nobservational data and simulations, the difference between\nspatial and projected angular definitions of Sξ should not\naffect the questions of interest here.\n\n3. Method\nThe method of using Markov Chain Monte Carlo simulations to optimise the cross-correlation ξC of temperature\nfluctuations between copies of the surface of last scattering\n(SLS) in the covering space S 3 , modelled as S 3 ⊂ R4 , is\ndescribed in Sect. 3 of RBSG08.\nSince it is important that the choice of pairs of points\nis as uniform as the nature of the observations allows, the\n\n\f4\n\nRoukema, Buliński & Gaudin: Poincaré dodecahedral space parameters\n\nnumber of points Np , as well as finding a larger number of\nclose pairs for the same value of Np , since points that are\ncertainly not members of any close pair are rejected before\nthe iteration over pairs of points is started. The latter improvement to the algorithm should enable practical use of\nthe method for shorter pair separations.\n\nr SLS\nx\n\nr2\nα−\n\nrSLS\nπ\n5\n\nSLS\n\nRC\n\nSLS\n\nFig. 2. As for Fig. 1, showing a spatial geodesic, of length r2 ,\n\"internal\" to the matched circles, and angle α− separating the\nmember of the pair on the right-hand SLS from the dodecahedral\nface centre.\n\nselection of points on a copy of the SLS in RBSG08 was chosen uniformly on the SLS, i.e. on the 2-sphere. The binning\ninto bins of pair separations was calculated only after the\npair separations have been calculated by applying a holonomy transformation to one of the members of the pair.\nFrom a computational point of view, applying the holonomy is the most intensive step in the calculation, requiring\nthe multiplication of a 4 × 4 matrix by a 4-vector, as a rotation in R4 . This matrix calculation is carried out 12 times\nfor a given pair of points, since all of the 12 holonomy transformations mapping a point to one of its neigbouring copies\nof the SLS must be examined.\nThe set of 20 holonomy transformations that maps the\nfundamental domain to the next layer in the direction of\nthe hyperspherical equator could, in principle, be used too.\nHowever, for these to give matched circles as small as 5◦ ,\nthis would require the total matter-energy density to be\n> 1.03, which is uncomfortably high given present obΩtot ∼\nservational estimates of Ωtot . To see this, replace π/10 in\nEq. (15) of RBSG08 by π/6, which is half the geodesic\nlength of any member of this set of holonomy transformations (Clifford translations), and use RC = (c/H0 )(Ωtot −\n1)−1/2 , where RC is the radius of curvature, i.e. the radius\nof S 3 modelled as a subset of R4 . Moreover, it is not clear\nhow a \"generalised\" twist parameter could be used if both\nsets (or yet further sets) of holonomy transformations were\nto be used in a single estimate of the cross-correlation function. The twist for this set of holonomy transformations is\n±π/3, not ±π/5. For these reasons, we consider just the 12\nimmediately neighbouring copies of the fundamental domain, as in RBSG08.\nIn this paper, we argue that after uniformly selecting\npoints on the 2-sphere, a filtering of these points is possible\nin a way that excludes only those points that are certainly\nnot members of any close SLS-SLS pairs, for a given maximum pair separation r2 . This should enable shortening the\ntime to find a given number of close pairs for a constant\n\n3.1. Preselection of potential members of close pairs: α1 , α2\nFigures 1 and 2 show how a close pair used in a crosscorrelation estimate relates to the two copies of the SLS\nand the angle α± that separates it, on a copy of the SLS,\nfrom a dodecahedral face centre. Using the spherical cosine formula, the lower triangle in the two figures has the\nrelation\nrSLS\nπ\nπ\nrSLS\nx\n= cos\ncos + sin\nsin cos α±\n(3)\ncos\nRC\nRC\n5\nRC\n5\nwhere α+ and α− are for Figs 1 and 2 respectively.\nClearly, α+ is maximised when x is maximised. For fixed\nr2 and rSLS , x is maximised when x = rSLS + r2 , i.e. when\nthe upper triangle degenerates into a single line segment.\nHence, the angle α+ is maximised when x = rSLS + r2 .\nSimilarly, α− is minimised when x is minimised, provided that r2 ≤ rSLS , which is the situation most interesting for the SLS-SLS cross-correlation method, since close\npairs are the most useful. For fixed r2 and rSLS , x is minimised when x = rSLS − r2 , i.e. when the upper triangle\ndegenerates into a single line segment. Hence, the angle α−\nis minimised when x = rSLS − r2 .\nHence, by symmetry, for a given separation r2 ≤ rSLS ,\nthe minimum and maximum boundaries for defining an annulus\nα− ≤ α ≤ α+\n\n(4)\n\non the SLS around a dodecahedron face centre, in order\nto include all points that can potentially be members of\na close pair separated by a spatial geodesic distance of at\nmost r2 for the corresponding pair of matched faces of the\nfundamental domain, are\n#\n\"\nrSLS\nrSLS ±r2\nπ\n−\ncos\ncos\ncos\nR\nR\n5\nC\nC\n.\n(5)\nα± = cos−1\nsin rRSLS\nsin π5\nC\nWhen r2 is larger than the separation of dodecahedral face\ncentres (Eq. (32) in RBSG08), i.e. when\n\u0013\n\u0012\nπ\nrSLS\n,\n(6)\n−\nr2 > 2RC\nRC\n10\nthe derivation leading to the expression for α− in Eq. 5 is\nno longer valid. Instead, the lower limit α− should be set\nto zero.\nAs mentioned above, the preselection enabled by Eq. (5)\ncan be applied in two ways:\n(i) a point that fails to be a member of a \"close\" pair for a\ngiven maximum separation r2 in all of the 12 directions\nof holonomy transformations to adjacent copies of the\npoint in the covering space can be removed from the list\nof uniformly selected points; and\n(ii) when iterating through pairs of points and holonomy\ntransformations gi (i = 1, . . . , 12), a pair of points for\nwhich at least one of the two points does not satisfy the\ncondition α ≤ α+ can be rejected without calculating\nthe spatial separation of the pair.\n\n\fRoukema, Buliński & Gaudin: Poincaré dodecahedral space parameters\n\nWhen r2 is large, α+ will also be large, and the six pairs of\nannuli may be sufficiently wide that together they cover the\nwhole sky. In this case, effect (i) will not occur. For a small\nenough separation r2 , the effect should occur. In that case,\nmore points can be uniformly selected from S 2 according to\na uniform distribution, and again tested, until the required\nnumber of points is obtained. In that case, a higher fraction\n(though not 100%) of pairs defined by this set of points will\nbe useful for the cross-correlation function calculation. This\nshould increase the number of pairs per bin, especially for\nthe smallest bins, which have the fewest numbers of pairs.\nThis would be useful for high resolution calculations. Both\neffects (i) and (ii) should increase the calculation speed for\na given number of points Np , since they avoid having to\ncarry out unnecessary matrix multiplications.\n\nTable 1. Example of benchmarking on a 3GHz processor.a\n\nα\n◦\n\n5\n5\n5\n5\n5\n5\n5\n5\n5\n5\n5\n5\n60\n60\n60\n60\n60\n60\n60\n60\n60\n60\n60\n60\n\n3.2. Use of preselection on the five-year WMAP data\nThe MCMC analysis is performed as in RBSG08, using the\nILC and TOH five-year WMAP data (Sect. 2.1), but including the smallest separation bin, i.e. using the full range\nof separations\nd/rSLS < 40/90,\n\n(7)\n\ni.e.\n< 4.4h−1 Gpc\nd∼\n\n(8)\n\nfor Ωtot = 1.01, matter density Ωm = 0.28 and SLS redshift zSLS = 1100, corresponding approximately to angles\n< θ < 25◦ . All other parameters are kept as in\non the SLS 0 ∼\nd∼\nSect. 3.6 of RBSG08. In particular, this includes the five parameters for orientation of the fundamental dodecahedron\n(galactic longitude and latitude of one face centre (l, b) and\na rotation parameter θ around the axis defined by (l, b)),\nthe matched circle size α and the \"generalised\" twist phase\nφ when matching opposite faces. The GPL (GNU General\nPublic Licence) program circles7 is used.\n3.3. Analysis of simulations\nAlthough the method presented in Sect. 3.1 should speed\nup the calculation, analysing a large number of simulations\nis still time-consuming. Here, we estimate Sξ for 50 simulations and the WMAP observational map described in\nSect. 2.2 and select those 20 simulations whose Sξ estimates\nare smallest, provided that Sξ is not less than Sξ of the observational map. In each estimate, 10,000 points selected\nrandomly from a uniform distribution on the sky outside\nof the kp2 mask were used. Using each of these 20 simulations and the observational map, four MCMC chains with\nrandom starting points in the parameter space described in\nEq. (28) of RBSG08 are carried out.\n7\n\nVersion circles-0.3.2.1 was used for calculating the\nMCMC chains for the five-year WMAP maps, and version circles-0.3.8 was used for calculating the chains\nfor the INC3 observational and simulational maps.\nVarious versions of circles are downloadable from\nhttp://adjani.astro.umk.pl/GPLdownload/dodec/.\nThese\nand earlier versions of the software require medium to advanced\nGNU/Linux, Fortran77 and C experience for a scientific\nuser.\n\n5\n\nr2\n−1\n\n≈h\n\nGpc\n0.4\n0.4\n0.4\n4.4\n4.4\n4.4\n0.4\n0.4\n0.4\n4.4\n4.4\n4.4\n0.4\n0.4\n0.4\n4.4\n4.4\n4.4\n0.4\n0.4\n0.4\n4.4\n4.4\n4.4\n\nαb+\n\nNp\n\n◦\n\n...\n...\n...\n...\n...\n...\n13.6\n13.6\n13.6\n45.0\n45.0\n45.0\n...\n...\n...\n...\n...\n...\n62.9\n62.9\n62.9\n90.9\n90.9\n90.9\n\n1000\n2000\n8000\n1000\n2000\n8000\n1000\n2000\n8000\n1000\n2000\n8000\n1000\n2000\n8000\n1000\n2000\n8000\n1000\n2000\n8000\n1000\n2000\n8000\n\ntc\nNAd\nNCd\ns\n5\n1317\n52\n22\n5268\n206\n375 83476\n3900\n5\n1317\n52\n23\n5268\n206\n377 83476\n3900\n0\n6994\n1911\n2 28085\n7860\n41 449308 126395\n0\n1317\n52\n3\n5268\n204\n53 83476\n3880\n5\n1408\n192\n23\n5650\n736\n354 90242 12070\n5\n1408\n192\n24\n5650\n736\n369 90242 12070\n0\n3532\n1518\n3 14290\n5986\n48 228426 94887\n2\n1408\n183\n8\n5650\n706\n130 90242 11536\n\na\n\nThe pseudo-random number generator has the same initial\nseed for each calculation.\nb\nAn estimate of α+ from Eq. (5) is shown in the cases where\npair preselection as described in Sect. 3.1 is used.\nc\nCalculation time.\nd\nNumbers of pairs in the smallest bin NA , NC for ξA , ξC\nrespectively.\n\n4. Results\n4.1. Benchmarking\nAn example set of calculation times and number of pairs\nin the smallest separation bin are shown in Table 1, for\none calculation of the auto-correlation and cross-correlation\nfunctions at an arbitrary PDS orientation and twist, for\nα = 5◦ and α = 60◦ , which determine the ratio rSLS /RC .\nThe speed-up factors range from about 3–10, depending on\nboth α and r2 .\nFor d < r2 = 4.4h−1 Gpc, the \"annulus outer radii\"\nare α+ = 45.0◦ , 90.9◦ for α = 5◦ , 60◦ respectively. This\nis clearly too large to allow any removal of points from the\nlist of potentially useful pairs, i.e. effect (i) in Sect. 3.1 does\nnot occur: NA and NC are negligibly affected by the pair\npreselection mechanism. However, the labelling of points to\nrecord which annuli they can potentially be pairs of does\nyield a speed-up through effect (ii), i.e. by factors of about\n7 and 3 for α = 5◦ and 60◦ respectively.\nFor a much smaller maximum pair separation, i.e. d <\nr2 = 0.4h−1 Gpc, even though the annulus outer radii are\nstill quite large, i.e. α+ = 13.6◦ , 62.9◦ for α = 5◦ , 60◦ respectively, both effects (i) and (ii) occur. That is, not only\nis there a speed-up by a factor of about 7-10, but there is\nalso an increase in the number of pairs in the smallest bin\n\n\f6\n\nRoukema, Buliński & Gaudin: Poincaré dodecahedral space parameters\n\nTable 2. Sky positions of the best estimate of the six dodecahedral face centres for the five-year ILC map with the kp2 mask.\n\nPmin ia\n0.4\n0.4\n0.4\n0.4\n0.4\n0.4\n0.5b\n0.5\n0.5\n0.5\n0.5\n0.5\n0.6\n0.6\n0.6\n0.6\n0.6\n0.6\n\n7\n12\n3\n5\n8\n10\n7\n12\n3\n5\n8\n10\n7\n12\n3\n5\n8\n10\n\nn\n5141\n5239\n7097\n5812\n5056\n4707\n2736\n2838\n3712\n3005\n2732\n2570\n1429\n1487\n1919\n1544\n1387\n1419\n\nl\n\nb σh(l,b)i\n\n◦\n\n◦\n\n◦\n\n182.8\n305.5\n45.0\n115.9\n174.6\n239.8\n181.1\n305.7\n45.4\n114.6\n178.1\n239.9\n179.3\n306.0\n45.5\n113.6\n175.6\n237.7\n\n62.3\n44.4\n49.5\n19.5\n−3.0\n13.9\n62.2\n44.5\n49.3\n18.7\n−0.5\n13.8\n62.6\n44.3\n48.8\n18.4\n−1.6\n14.5\n\n1.1\n1.2\n0.7\n1.2\n2.9\n2.1\n1.4\n1.3\n0.7\n1.6\n1.6\n1.6\n1.1\n1.2\n0.8\n2.0\n3.0\n1.6\n\na\n\nFig. 3. Full sky map [Lambert azimuthal equal area projection\n(Lambert 1772), centred on the North Galactic Pole (NGP),\nwith the 0◦ meridian as the positive vertical axis and galactic\nlongitude increasing clockwise] showing the optimal orientation\nof dodecahedral face centres based on 160,000 steps in 16 MCMC\nchains, using the five-year ILC map (upper panel) and the fiveyear TOH map (lower panel), and the kp2 mask, showing face\ncentres for which P > 0.5.\n\nThe face centres are ordered according to the ordering in\nTable 1 of RBSG08. The other 6 faces are directly opposite\nwith identical errors.\nb\nThe estimate for Pmin = 0.5 corresponds to the points shown\nin the upper panel of Fig. 3, based on 160,000 steps of MCMC\nchains.\n\nTable 3. Estimates of matched circle radius α and twist phase\nφ from the Integrated Linear Combination (ILC) and Tegmark\net al. (2003) (TOH) versions of the five-year WMAP data.\n\nmap Pmin\nILC\nILC\nILC\nTOH\nTOH\nTOH\n\nfor calculating the cross-correlation function, by factors of\nabout 30 and 7 for α = 5◦ and 60◦ respectively.\nIn practice, use of a small maximum pair separation bin\nto get cosmologically significant results will be complicated\nby the relatively larger contributions from the Doppler and\nISW effects, from residual foreground contamination, from\nthe differences between various versions of the all-sky CMB\nmap at these resolutions (Aurich et al. 2006), and from the\nabsence of the large scale signal. Nevertheless, the concern\nexpressed in Sect. 5.5 of RSBG08 that improvements to the\nalgorithm would be geometrically quite complex, at the risk\nof introducing biases to the method, appears to have been\novercome, reducing one obstacle to small scale work using\nthis type of method.\nIn a full MCMC chain, the matched circle size α will\nvary between the limits illustrated in Table 1. The actual\nspeed-up factor (and increase in numbers of pairs per bin\nif this occurs) will depend on the particular path of the\nMCMC chain through parameter space. In the calculations\nleading to the results described below, the range 5◦ < α <\n60◦ was retained.\n\na\n\n0.4\n0.5\n0.6\n0.4\n0.5\n0.6\n\nna\n5508.67\n2932.17\n1530.83\n4802.08\n2955.58\n1655.92\n\nα σhαi\n\nφ σhφi\n\n◦\n\n◦\n\n◦\n\n◦\n\n20.3\n20.5\n20.1\n21.2\n20.4\n20.3\n\n0.7\n1\n0.7\n1.4\n0.8\n0.7\n\n38.7\n37.8\n39.8\n30.6\n32.1\n27.5\n\n1.6\n1.2\n1.1\n4.8\n2.6\n5.5\n\nThe number of steps n can be a non-integer since for a given\nMCMC step, it is possible that some of the face centres\nfall within the convergence radius of the final iteration as\ndescribed in Sect. 4.2, but other face centres do not.\n\n4.2. Parameter estimates from the five-year WMAP data\nFor both maps of the five-year data as described in Sect. 2.1\n(ILC and TOH), Nchain = 16 MCMC chains were run, each\nstarting with different random seeds, using the kp2 mask.\nEach run had 12,000 steps and the first 2000 steps of each\nwere discarded.8 Fig. 3 shows the sky positions (l, b)i=1,12\n8\nThe\nMCMC\nchains\nused\nin\nthis\npaper\ncan\nbe\ndownloaded\nfor\nindependent\nanalysis\nfrom\nthe\nfile\nhttp://adjani.astro.umk.pl\n/GPLdownload/MCMC/mcmc_RBG08.tbz.\n\n\fRoukema, Buliński & Gaudin: Poincaré dodecahedral space parameters\n\n7\n\n800\n\n100\n\n600\n\nφ\n\nN 400\n\n0\n200\n\n−100\n0\n\n−100\n\n0\nφ\n\n100\n\n−100\n\n0\nφ\n\n100\n\n800\n\n0\n\n10\n\n20\n\n30\nα\n\n40\n\n50\n\n60\n600\n\nN 400\n\n100\n\nφ\n\n200\n\n0\n0\n\n√\n\n−100\n\nFig. 5. Histogram of the twist angle φ shown in Fig. 4, with N\nerror bars, for the ILC (upper panel) and TOH (lower panel),\nexcluding states with α ≤ 15◦ .\n\n0\n\n10\n\n20\n\n30\nα\n\n40\n\n50\n\n60\n\nFig. 4. Distribution of α and φ states where P > 0.5 in the\nMCMC chains of the dodecahedral solution used in Table 2, for\nthe ILC (upper panel) and TOH (lower panel) maps. In this and\nsimilar figures, lines indicating ±36◦ are shown. These are not\nfit to the data.\n\nimplied by the (l, b, θ) triples in the MCMC chains for which\nP > 0.5 [Eq. (25), RBSG08], for the ILC and TOH versions\nof the five-year WMAP observational data. The \"probability\" function P used for optimisation by the MCMC procedure is that defined in Eq. (25) in RBSG08. This is not\na true probability function.\nSimilarly to what was done in RBSG08, the 16 chains\nare grouped together into four groups, each of four chains.\nFor a given group, steps 2001 to 12,000 from each of the\nfour chains are concatenated.\nWe make the convergence requirements a little more\nstringent than was described in Sect. 4.1 of RBSG08. That\nis, we start from an initial angular radius of β1 = 30◦ (covering most of the sphere), decrease by 1◦ for the next 20\niterations, and then remain constant at βj≥21 = 10◦ until\nthe iteration for that face number converges or until a total\nof 40 iterations has been reached. The analyses of the four\nconcatenated groups of chains give what are considered to\n\nbe four independent estimates in order to get an estimate\nof the uncertainties due to our MCMC estimation method.\nThe resulting numerical estimates are listed in Table 2.\nThe columns show minimum \"probability\" Pmin , face number i, number n of MCMC steps contributing to the estimate obtained from the final iteration, galactic longitude\nl and latitude b, and the standard error in the mean between the four estimates of different sets of MCMC chains,\nin great circle degrees, σh(l,b)i . These values do not differ\nsignificantly from those in Table 1 and Table 4 (for the kp2\nmask) of RBSG08.\nThe MCMC states for α and φ in the final radii of convergence, and their means and standard errors in the mean,\nare shown in Fig. 4 and Table 3. Histograms of the distribution of φ are shown in Fig. 5. Again, these values do not\ndiffer significantly from those in Table 2 of RBSG08. The\nTOH map shows a small offset between the best estimate of\nφ found (for P > 0.5) using our convergence algorithm and\nthat at which the histogram of φ states peaks. The former\nis φ = 30.4◦ , i.e. a little below 36◦ , while the latter (lower\npanel of Fig. 5) is a few degrees above 36◦ . The difference\ncan reasonably be attributed to the fact that the former\nuses a convergence algorithm in multi-dimensional parameter space, whereas the latter is the peak of a projected\ndistribution using a single parameter.\nAs was discussed in Sect. 4.2 of RBSG08, when α\nis not too large, small changes in the comoving separation between pairs lead to relatively large changes in α.\n\n\f8\n\nRoukema, Buliński & Gaudin: Poincaré dodecahedral space parameters\n\nTable 4. Sξ estimates with and without the kp2 mask for the\nILC and TOH five-year maps.\n\nmap\n\nILC\nTOH\n\nkp2 no mask\n(μK)4\n(μK)4\n1012\n1136\n\n4851\n2749\n\nDoes the use of the smallest bin in the present analysis,\nand/or the use of the slightly improved quality between\nthe three-year and five-year WMAP data help overcome\nthe large uncertainty in α? Visual inspection of Fig. 4 suggests that the MCMC chains on the ILC five-year map\n< α < 35◦ , while those on the TOH map favour\nfavour 22◦ ∼\n∼\n< α < 35◦ . The problem of approximate degeneracy in\n15◦ ∼\n∼\nα, which is presumably sensitive to moderate levels of systematic error, remains.\n\nFig. 6. Full sky map showing the optimal orientation of dodecahedral face centres based on 40,000 steps in 4 MCMC chains,\nusing the three-year INC map and the kp2 mask, showing face\ncentres for which P > 0.5.\n\nTable 5. Estimates of matched circle radius α and twist phase\nφ for the INC3 observational map.\n\n4.3. Simulations\na\nPmin\n\n4.3.1. Estimates of Sξ\nThe value of Sξ [Eq. (2)] in the INC3 observational map\n(using the kp2 mask) is\nSξINC3 = 963(μK)4 .\n\n(9)\n\n0.3 294.3\n0.4 197.2\n0.5 108.8\na\nb\n\nThe 50 simulations have Sξ in the range 1170(μK)4 < Sξ <\n8645(μK)4, i.e. up to about an order of magnitude higher\nSξ than in the observations. As mentioned in Sect. 2.2, this\nis because the WMAP cosmological signal has a lot of power\nclose to the Galactic Plane and we use the kp2 cut sky. In\norder to use the simulations best able to test the hypothesis\nthat a simply connected universe with an observationally\nvalid large scale auto-correlation can give a PDS-like signal,\nwe select the 20 of these with the lowest Sξ values, i.e. in\nthe range\n1170(μK)4 < Sξ < 3782(μK)4,\n\n(10)\n\ni.e. with up to about 3.9 times larger Sξ than in the observations. Since at large scales (outside of the kp2 cut), these\nsimulations are more correlated than the observations, we\nshould obtain an upper limit to the the frequency of detecting PDS-like signals, assuming that the PDS hypothesis is\nwrong.\nAs a check on the amount of large scale power present\nin the Galactic Plane in different versions of the map of cosmological signal, we estimate Sξ for the ILC and TOH fiveyear maps with and without the kp2 mask. Table 4 shows\nthese estimates. Both maps have much more power without the cut than with the cut, as expected. Moreover, while\nthe difference in estimates of Sξ for the two maps differs by\nnearly a factor of two for the full sky, it differs by only 10%\nfor the cut sky. This confirms the advantage in analysing\nthe cut sky rather than the full sky: there is approximate\nconsensus between these two different methods of generating the map. The INC3 estimate of Sξ = 963(μK)4 is also\nclose to these two estimates.\n\nnb\n\nα\n\nφ\n\n◦\n\n◦\n\n32.7 27.6\n30.8 31.2\n30.8 32.5\n\nMinimum probability.\nNumber of MCMC steps contributing to the estimate.\n\n4.3.2. MCMC chains\nWhile the speed improvement introduced in this paper\nmakes it possible to analyse a set of simulations rather\nthan just an observational map, carrying out large numbers\nof MCMC chains still remains computationally prohibitive.\nFor this reason, we carry out only a small number of MCMC\nchains (four) on each data set (INC3 observational data set\nor simulation), and do not attempt to estimate uncertainties on the individual optimal parameters for a given data\nset.\nWe first concatenate together steps 2001 to 12,000 of\neach chain in a group, i.e. we ignore 2000 burn-in steps. This\nconcatenated chain is considered to be a single chain for\nthe iterative procedure of estimating parameter values. We\nmodify the method of choosing an initial rough estimate of\nthe optimal dodecahedral face centre positions that is used\nto start the iterations towards a more precise estimate by\nrandomly selecting a set of dodecahedral face centres [(l, b)\nchosen from a uniform distribution on S 2 , θ chosen from\na uniform distribution on (0, 2π/5).] This risks causing the\nconvergence to be less accurate, but since this is applied in\nthe same way for both simulations and observations, this\nshould not introduce any statistical bias for comparison of\nobservations to simulations.\nWe also make our iteration a little more stringent than\nthat described in Sect. 4.2. In the first iteration of parameter estimation, we estimate the dodecahedral face centres\nstarting from a random initial set as just described, and in\nthe following iterations, we converge on both dodecahedral\n\n\fRoukema, Buliński & Gaudin: Poincaré dodecahedral space parameters\n\n9\n\nφ\n\n100\n\n0\n\n−100\n\n0\n\n10\n\n20\n\n30\nα\n\n40\n\n50\n\n60\n\nFig. 8. Distribution of α and φ states where P > 0.5 in the\nMCMC chains for the INC3 observational map.\nTable 6. Properties of the distribution of best estimates of φ\nfrom the 20 simulations.\nPmin φar.m.s.\n\nb\nPKS\n\n◦\n\n0.3\n0.4\n0.5\n\nFig. 7. Full sky map showing the optimal orientation of dodecahedral face centres based on 40,000 steps in 4 MCMC chains,\nusing the two simulated three-year INC maps with lowest Sξ\nestimates (simulations 92 and 90, in the upper and lower panels\nrespectively), and the kp2 mask, showing face centres for which\nP > 0.5.\n\n32.9 5.9%\n38.5 13.1%\n38.4 32.8%\n\na\n\nRoot mean square width of the distribution.\nTwo-sided Kolmogorov-Smirnov probability that the simulational values are consistent with a Gaussian distribution\ncentred on zero, of width σφ = φr.m.s. .\nb\n\nfaces centres and α, φ simultaneously. The values of βj (see\nSect. 4.2) are unchanged. The set of points within the convergence radius βj≥21 = 10◦ is used for the final estimates\nof α and φ.\n\ncase, there is clearly a problem in converging on a single set\nof dodecahedral face centres, while in the other, there does\nappear to be more or less convergence to a single solution.\n\n4.3.3. Optimal dodecahedron orientation: (l, b, θ) space\n\n4.3.4. Circle size α and twist phase φ\n\nFigure 6 shows the optimal set of face centres resulting\nfrom the four MCMC chains for the INC3 observational\nmap. While the sharpness of the optimal signal does not\nappear as strongly as in the results using larger numbers\nof chains in RBSG08 and in Fig. 3 for the five-year data\nhere, it is clearly consistent in position. Since we use many\nfewer chains here, it is unsurprising that the signal appears\nweaker. This should not be a problem form the present\npurpose, since the uncertainties from using a small number\nof chains should be statistically equivalent for both INC3\nobservational data and simulations.\nOn the other hand, the relative weakness of the signal\nand the smaller numbers of chains require using slightly\nlower minimum probability thresholds for estimating the\nbest solution. Below, we cite results for Pmin = 0.3, 0.4, 0.5\nrather than the earlier thresholds of Pmin = 0.4, 0.5, 0.6.\nExamples of optimal dodecahedral orientations, for the\ntwo simulations whose Sξ estimates are lowest (i.e. are closest to that of the observations), are shown in Fig. 7. In one\n\nFigure 8 shows that convergence in α and φ occurs for the\nINC3 observational map in a similar way to that of the\nfive-year observational maps. In contrast, Fig. 9 shows that\nthe two simulations whose Sξ estimates best match that of\nthe data, i.e. those whose best dodecahedral face centres\nare shown in Fig. 7, both \"escape\" towards the lower limit\nα = 5◦ . The median circle size is α = 5◦ in both cases.\nThis effect can be expected due to the increased relative\nPoisson error when comparing fewer numbers of pairs of\npixels. Aurich (2008) found a similar effect, describing it\nas \"drifting\" towards \"large L\", which corresponds here to\nsmall α. Several previous authors have found that independently of whether or not a cosmic topology signal is present,\nrelatively higher cross-correlations for zero separation pairs,\ni.e. for pairs on exactly matched circles, have been found to\noccur as the circle size α approaches zero. For example, see\nFig. 2 in Cornish et al. (2004), Figs 4–6 in Roukema et al.\n(2004), or Fig. 3 in Lew & Roukema (2008), where various\ndefinitions of a normalised correlation statistic S are shown\n\n\f10\n\nRoukema, Buliński & Gaudin: Poincaré dodecahedral space parameters\n\n100\n\nφ (deg)\n\nφ\n\n100\n\n0\n\n−100\n\n−100\n\n0\n\n10\n\n20\n\n30\nα\n\n40\n\n50\n\n60\n\n5\n\n10\n\n15\n\n20\n25\nα (deg)\n\n30\n\n35\n\n40\n\nFig. 10. Median circle sizes α (see Sect. 4.3.4) and twist angles\nφ (mean) for each of 20 simulations (empty circles) and the\nWMAP observational map (solid circle, values given in Table 5),\nanalysed using the steps with P > 0.5 [see Eqs (25), (26) of\nRBSG08]. In each case, the 10,000 steps following 2000 burn-in\nsteps of each of 4 MCMC chains started at random points in\nparameter space are concatenated for this analysis.\n\n100\n\nφ\n\n0\n\n0\n\n40\n35\n\n−100\n\n0\n\n10\n\n20\n\n30\nα\n\n40\n\n50\n\n60\n\nFig. 9. Distribution of α and φ states where P > 0.5 in the\nMCMC chains for the two simulated three-year INC maps with\nlowest Sξ estimates (simulations 92 and 90, in the upper and\nlower panels respectively).\nto increase as α decreases towards zero. Hence, it can be expected that MCMC chains will be drawn towards the lower\nα limit.\nIn cases where this occurs, chains spend a large amount\nof time at this limit, but cannot go below it. For this reason, the median of the α estimates (above a minimum\n\"probability\" used in the MCMC chains, e.g. P > Pmin =\n0.5), should more accurately represent the optimal region\nfavoured by the MCMC chains than the mean. Thus, here\nwe use the median of α.\nFigure 10 shows that nearly all the simulations escape\nto the lower α limit. Most of the simulations have best\nestimate α values less than 10◦ , and two have α estimates\njust a few degrees higher. Only two of the simulations have\nan optimum α estimate anywhere near the circle size α\nof the INC3 observational best estimate given in Table 5:\nαINC3 = 30.8◦ (for Pmin = 0.5).\nDo the latter two simulations, which are similar to the\nobservational map in the sense that an optimal solution\naway from low α limit is found, have sufficiently similar\n\nα (deg)\n\n30\n25\n20\n15\n10\n5\n\n0\n\n1000\n\n2000\nSξ [(μK)4]\n\n3000\n\n4000\n\nFig. 11. Median circle sizes α as a function of Sξ for each of\nthe 20 simulations (empty circles) and the WMAP observational\nmap (solid circle), analysed using the steps with P > 0.5.\ncharacteristics to the observational map such that the observational map can be considered a chance realisation statistically similar to these two simulations? Figure 11 does\nnot support this. The two simulations are among the simulations that have the highest Sξ estimates, well above\nthree times that present in the observational map. This is\nconsistent with what is expected: the stronger the autocorrelation on large scales, the higher the chance is of\ngetting high cross-correlations between apparently distant\nparts of the sky over a large number of pixel pairs, rather\nthan escaping to the low α limit where there are relatively\nfew pixel pairs. This can be quantified as follows.\n\n\fRoukema, Buliński & Gaudin: Poincaré dodecahedral space parameters\n\n11\n\nφ\n\n100\n\n0\n\n−100\n\n0\n\n10\n\n20\n\n30\nα\n\n40\n\n50\n\n60\n\n0\n\n10\n\n20\n\n30\nα\n\n40\n\n50\n\n60\n\nφ\n\n100\n\n0\n\nFig. 12.\n\nFull sky map showing the optimal orientation of\ndodecahedral face centres based on 40,000 steps in 4 MCMC\nchains, using the two simulated three-year INC maps with the\nhighest α estimates (simulations 58 and 80, in the upper and\nlower panels respectively), and the kp2 mask, showing face centres for which P > 0.5.\n\nSince the α distributions are constrained from below,\nthey are unlikely to be Gaussian. So, estimating the significance of the correlation between α and Sξ among the\nsimulations is best done using a non-parametric statistic.\nSpearman's rank correlation ρ and Kendall's rank correlation τ one-sided tests with a positive correlation as the\nalternative hypothesis give probabilities that α and Sξ are\nunrelated of 2.5% and 2.4% respectively. Even if we arbitrarily remove the two simulations with high α from the\ndata set, the same two two rank correlation tests give probabilities that α and Sξ are unrelated of 12.6% and 12.5%\nrespectively.\nThis supports the visual impression from Fig. 11. For\nlow Sξ , an optimal cross-correlation in GRF simulations\nshould escape to the low α limit. The point representing the\nobservational simulation appears to be quite exceptional.\nDo the two simulations with high α estimates (numbered 58 and 80, with α estimates of 24.5◦ and 31.9◦ respectively) have convergent estimates of dodecahedral face\ncentres and φ? Figure 12 indicates a poor convergence of\ndodecahedral face centres for simulation 58 and what looks\nlike the superimposition of a strong primary and a weak secondary convergence in the case of simulation 80. Moreover,\nFig. 13 shows that both of these two simulations have quite\nstrongly bimodal distributions in φ rather than favouring\nany individual optimal value of the twist φ. This is quite\n\n−100\n\nFig. 13. Distribution of α and φ states where P > 0.5 in the\nMCMC chains for the two simulated three-year INC maps with\nhighest α estimates (simulations 58 and 80, in the upper and\nlower panels respectively).\n8\n\n6\n\nN 4\n\n2\n\n0\n\n−100\n\n0\nφ\n\n100\n\nFig. 14. Histogram\nof the optimal twist angle φ (shown in\n√\nFig. 10), with N error bars, together with a Gaussian distribution of width 38.4◦ , centred at zero (see Table 6).\n\n\f12\n\nRoukema, Buliński & Gaudin: Poincaré dodecahedral space parameters\n\ndifferent behaviour to that in Fig. 8 for the observational\nmap.\nHowever, in order to be conservative, let us suppose that\nsimulations 58 and 80 converge well enough in comparison\nto the observational map that we can consider them to have\nconvergent MCMC solutions with α ≫ αlimit = 5◦ . This\ngives us an estimate\n< 10%,\nP (α ≫ αlimit | Sξ ≤ 3.9SξINC3 ) ∼\n\n(11)\n\nwhere α ≫ αlimit represents the event of getting a nonPoisson-noise signal at least 10◦ (the MCMC step size)\naway from the lower limit of αlimit .\n4.3.5. Distribution of the optimal twist phase φ\nIt is clear in Fig. 10 that the simulations give a distribution of best estimate twist angles φ different from the\nuniform distribution on [−π, π] described in Eqs (12) and\n(13) of RBSG08 and discussed in Sect. 5.4 of that paper.\nFigure 14 shows the distribution as a histogram. A twosided Kolomogorov-Smirnov test between the distribution\nof the best estimates of φ from the 20 simulations and a uniform distribution on [−π, π] rejects equality with P = 0.01.\nThe values of φ for the simulations, shown in Figs 10 and\n14, all lie in the range (−100◦, +100◦ ), and mostly seem to\ncluster even closer to φ = 0.\nA likely explanation is that this is a consequence of\nthe anti-correlation in the auto-correlation function measured in WMAP sky maps at nearly antipodal scales by\ndifferent authors using different methods (Fig. 16, Spergel\net al. 2003; Fig. 1, RBSG08). The Hinshaw et al. (2007)\nCl values should implicitly include the information that\nthere is an antipodal anti-correlation. Estimates of the\nauto-correlations of the simulations confirm that an anticorrelation of about −100(μK)2 at φ = ±π is present, so\nthat the simulations correctly reproduce this characteristic of the observational data. This anti-correlation implies\nthat MCMC chains should disfavour φ = ±π when correlating pairs on a matched circle pair, and, hence, generally\ndisfavour φ = ±π for pairs on \"matched annuli\". This is\ndiscussed further in Sect. 5.3.2.\nSince a uniform distribution on [−π, π] is clearly wrong,\na reasonable hypothesis must be made regarding the intrinsic, expected distribution of best estimates of φ. Given\nthe numerical results from the simulational analyses and\nthe presence of the φ = ±π anticorrelation, which should\nfavour φ away from ±π and towards zero, we assume a\nGaussian distribution, f (φ), centred on φ = 0 with width\nσφ estimated by the r.m.s. of φ in the simulations.\nThe parameters of this distribution for different Pmin\nvalues, and the Kolmogorov-Smirnov probabilities that the\nsimulational values are consistent with a Gaussian distribution, are given in Table 6. For the lower thresholds,\nPmin = 0.3 and Pmin = 0.4, the Gaussian distribution\nhypothesis is mildly rejected by the Kolmogorov-Smirnov\ntest. If we set the mean and standard deviation of the\nGaussian distribution to be the mean and standard deviation of the simulational φ estimates, then the three\nKolmogorov-Smirnov probabilities for Pmin = 0.3, 0.4, 0.5\nare PKS = 54%, 84%, 97% respectively. Thus, it is clear\nthat the distributions are consistent with Gaussianity if we\nuse the estimated means rather than force symmetry about\nφ = 0.\n\nCould there be a reasonable justification for using a nonzero mean φ? The only possible source of systematic asymmetry is that the noise simulations follow noise patterns\nin the observational data, which are not perfectly symmetrical. It is not obvious that this asymmetry is sufficient to\njustify assuming an asymmetry in the expected distribution\nof φ. Moreover, the means and standard errors in the mean\nfor the three Pmin thresholds are 12.8 ± 7.1◦ , 14.4 ± 8.4◦ ,\n12.1 ± 8.6◦ respectively, showing no statistically significant\ndifference from zero.\nGiven a Gaussian distribution in φ centred on zero with\nwidth σφ = φr.m.s. as listed in Table 6, the probability that\nφ is as close to ±π/5 as the observational value (Table 5)\nis close to +π/5 is 22%, 12.8%, 9.4% for Pmin = 0.3, 0.4, 0.5\nrespectively, i.e.\n\u0010\n\u0011\nP min(|φ ± π/5|) < |φINC3 − π/5| Sξ ≤ 3.9SξINC3\n<\n\n∼ 22%.\n\n(12)\n\nSince the values φr.m.s. are themselves not too far from π/5,\nit is clearly not so improbable that φ ≈ ±π/5, compared\nto what would be expected from a uniform distribution on\n[−π, π]. In other words, this suggests that using the present\nmethod, an estimate of φ is not as good a discriminator between a chance PDS-like signal and an intrinsic, physical\nsignal as it would be if the expected distribution were uniform on [−π, π], i.e. there is another topological degeneracy\n(cf Aurich et al. 2005a) in CMB all-sky maps.\nOn the other hand, is it just a coincidence that φr.m.s. ∼\nπ/5? In Sect. 5.3.2 below we discuss this question. It is possible that the empirical Cl spherical harmonic spectrum,\neven with randomised phases, may encode more cosmic\ntopology information than might naively be expected.\n4.3.6. Probability of rejecting the simply connected, infinite,\nflat model\nThe analyses of these simulations indicate that the requirement for the MCMC chains to avoid \"escaping\" to the lower\nlimit in circle size α gives a stronger constraint against the\nsimply connected, infinite, flat model than the requirement\nthat could potentially exclude the PDS model, i.e. the requirement that φ ≈ ±π/5.\nLet us write the PDS-like characteristics of the WMAP\nobservational data which we have tried to reproduce by\nsimulations as follows. The data\n(i) have a large scale cutoff in structure statistics\n(ii) yield a solution with α ≫ αlimit and φ ≈ +π/5\nwhen using the MCMC method for optimising the crosscorrelation ξC for the \"generalised\" PDS.\nRewrite these as\n< S INC3\n(i) Sξ ∼\nξ\n(ii) ξC yields α ≫ αlimit and min(|φ ± π/5|) < |φINC3 −\nπ/5| ≤ 8.4◦ ,\n\nwhere we use the \"worst\" estimate of φ from Table 5, i.e.\nφ = 27.6◦, for Pmin = 0.3. For convenience, we write these\neven more compactly as\n< S INC3\n(i) Sξ ∼\nξ\nWMAP\n(ii) ξC\n.\n\n\fRoukema, Buliński & Gaudin: Poincaré dodecahedral space parameters\nWMAP\nSince both Sξ ≈ SξINC3 and ξC\nare present in the\nWMAP data, the probability of these two characteristics\nboth occurring in the simply connected, infinite, flat model\nWMAP\ncan be written P [(Sξ ≈ SξINC3 ) ∩ ξC\n]. From the results\nabove, in particular from Eqs (11) and (12), we can write\nh\nWMAP\n< S INC3 ) = P α ≫ αlimit and\nP (ξC\n|Sξ ∼\nξ\n\nmin(|φ ± π/5|) < |φINC3 − π/5|\ni\n< S INC3\nSξ ∼\nξ\n\n< S INC3 ),\n≤ P (α ≫ αlimit Sξ ∼\nξ\n\n< 3.9S INC3 ),\n≤ P (α ≫ αlimit Sξ ∼\nξ\n<\n\n∼ 10%.\n\n(13)\n\nAre the probabilities that α ≫ αlimit and φ ≈ ±π/5 independent of one another, so that instead of the Eq. (13), we\ncan write\nh\nP α ≫ αlimit and\ni\n< S INC3\nmin(|φ ± π/5|) < |φINC3 − π/5| Sξ ∼\nξ\n< S INC3 ) ×\n= P (α ≫ αlimit Sξ ∼\nξ\ni\nh\n< S INC3\nP min(|φ ± π/5|) < |φINC3 − π/5| Sξ ∼\nξ\n\n≈ 2.2%,\n\n(14)\n\nagain using Eqs (11) and (12)? Spearman's rank correlation\nρ and Kendall's rank correlation τ one-sided tests where\nmin(|φ ± π/5|) decreases as α increases as the alternative\nhypothesis both give probabilities that these two parameters are unrelated of 7.9%. A two-sided test gives 16%\nin both cases. While neither of these rejections of the hypothesis that the two parameters are unrelated is highly\nsignificant, they are strong enough rejections that it would\npremature to assume that the two parameters are independent. Hence, the probability estimate in Eq. (14) cannot\n(yet) be assumed to be valid.\nAs mentioned above, Spergel et al. (2003) estimated\n< S WMAP ) ∼ 0.15% for an infinite, flat,\nthat P (Sξ ∼\nξ\ncosmic concordance model, with a fixed spectral index of density perturbations. Efstathiou (2004) estimated\n< S WMAP ) ∼ 3–12.5%. The latter calculation reconP (Sξ ∼\nξ\nstructs unobserved structure hidden behind the galactic\nmask by assuming a simply connected model. For the purposes of testing the simply connected model hypothesis,\nthis is internally consistent.\nUsing these two estimates to write two respective esti< S INC3 ) ≈ P (S < S WMAP ), we have\nmates of P (Sξ ∼\nξ∼ ξ\nξ\n< S INC3 ) ∩ ξ WMAP ] =\nP [(Sξ ∼\nξ\nC\n< S INC3 ) P (ξ WMAP |S < S INC3 )\nP (Sξ ∼\nξ∼ ξ\nξ\nC\n\n(15)\n\nby the definition of conditional probability. Hence, from\nEq. (13), we have\n< S INC3 ) ∩ ξ WMAP ] < 0.015%,\nP [(Sξ ∼\nξ\nC\n< S INC3 ) ∩ ξ WMAP ] < 1.25%\nP [(Sξ ∼\nξ\nC\n\n(16)\n\n< S INC3 ) respecfor the lower and high estimates of P (Sξ ∼\nξ\ntively.\n\n13\n\nIn other words, the simultaneous existence of both of\nthese two properties of the WMAP data, one a generic\ncharacteristic of small universe models and the other highly\nspecific to the PDS, is unlikely with a probability of about\n99.99% or 99% depending on whether the Spergel et al.\n< S WMAP )\n(2003) or Efstathiou (2004) estimates of P (Sξ ∼\nξ\nare used. This result only requires a frequentist approach\nto probabilities. Bayesian modelling of prior beliefs is not\ninvoked.\n\n5. Discussion\n5.1. Matched annuli and calculational speedup\nThe preselection method described in Sect. 3.1 leads to\nfaster calculation times by a factor of about 3–10 (Sect. 4.1).\nThis is by eliminating most calculations of pair separations\nfor pairs which are not useful for the cross-correlation calculation. Is it possible to improve this algorithm even further?\nGiven that we have Eq. (5), the number of calculations required for a given total number of pairs could, in principle,\nbe reduced by another small factor as follows.\nRandomly select a point pi from a uniform distribution\non S 2 , considered to be the left-hand copy of the SLS in\neither Fig. 1 or Fig. 2. For each of the 12 holonomy transformations gj to adjacent copies of the fundamental domain,\ncheck if the angle αij on the SLS from pi to the dodecahedral face centre for gj satisfies α− ≤ αij ≤ α+ . If this\nconstraint is satisfied, then choose a second point p′i randomly from a uniform distribution on the circle defined by\nthe intersection of the right-hand copy of the SLS in Fig. 1\nor Fig. 2 and the 2-sphere centred at pi , having radius r2 .\nBy construction, all of the pairs (pi , p′i ) selected in this\nway are at separation r2 , and should be statistically equivalent to generating a full set of pairs of which both members are uniformly selected on S 2 and then selecting those\nwhose separations are close to r2 . A loop over values of\nr2 will give cross-correlations over the desired range of\nseparations. This construction would bring the calculation\nmethod closer to the identified circles method itself, with\nthe difference that instead of correlating points lying precisely along the circles, points \"near\" the circles are correlated.\nThis raises the question of differences between using\nthe present method and using the identified circles method\nwith \"thickened\" circles. The most likely differences between these two methods would depend on how \"thickening\" is defined and how overlapping thickened circles are\ndealt with.\n\"Thickening\" would require a somewhat arbitrary\nchoice of an averaging procedure. For example, a circle\ncould be divided into equal angular intervals and thickened so that individual bands of the annulus are internally\naveraged to obtain the temperature fluctuation at that angular position around the circle/annulus. Alternatively, a\nGaussian smoothing could be used. However, neither of\nthese methods would take into account the fact that the\nchanges in the spatial geodesic pair separation of points\ninside and outside the zero thickness circle are not linear\nwith change in their angular distance from the centre of a\ncircle. In contrast, the present method calculates and uses\nthe spatial separations directly.\nThe problem of overlapping thickened circles follows\nfrom the fact that twelve pairs of annuli on the 2-sphere\n\n\f14\n\nRoukema, Buliński & Gaudin: Poincaré dodecahedral space parameters\n\nintersect each other many times. The greater the thickness of the annulus, the greater the number of points in\nthese intersections. If a correlation statistic is calculated\nover each circle separately and then averaged, then points\nwhich are members of these intersections contribute several times (typically two or three) more to the final statistic than points which are members of only one annulus.\nIf chance fluctuations at some pairs of these intersections\nhappen to have high correlations or anti-correlations, then\nthe final statistic might be biased by these pairs, since it\nwould implicitly assume that the pairs are independent of\none another, even though this is false in some cases.\nThe use of numerical simulations should make this more\nof a problem of excessive noise rather than systematic bias.\nIt is difficult to see any simple way in which a method directly based on the identified circles principle could avoid\nthis problem, whether or not its final effect is statistical\nbias or rather an extra source of noise. For the SLS optimal cross-correlation method, this problem does not exist,\nsince both points are selected uniformly on S 2 and selected\nafterwards based on their spatial separations (the method\nas presented in RBSG08), or else preselected in a way that\nis equivalent to this (the present paper).\nHence, results from comparing a series of thickened circle pairs for a range of thicknesses to use of the SLS optimal\ncross-correlation method should be expected to be different,\nfor both geometrical and statistical reasons.\n5.2. Five-year WMAP data\nThe five-year WMAP data (Sect. 4.2) give best estimates\nof the PDS model similar to those for the three-year data.\nSince most of the improvement in the WMAP data is at\nsmall angular scales, this is unsurprising.\n5.3. Simulations\nGiven the infinite, flat model with GRF as a null hypothesis, the probability that the observed WMAP data could\nbe a random realisation of this model, i.e. that both a\nlarge-scale cutoff in power and a specifically PDS-like signal appear in the WMAP data, is estimated in Eq. (16) as\n0.015% or 1.25% depending respectively on whether we use\nthe Spergel et al. (2003) or Efstathiou (2004) estimates of\nthe former. This appears to be a significant rejection of the\ninfinite flat model. Is there any way to avoid this interpretation? Other properties of the cosmological component of\nthe WMAP data, unlikely in the infinite flat model, have\nbeen noted by many authors. It is unlikely that these different properties are statistically fully independent of one\nanother.\nOn the other hand, in this case we have a physically\nmotivated model, motivated from the most fundamental\nlevel: the spatial section of the Universe is a 3-manifold,\ni.e. it must have a \"shape\". As Schwarzschild (1900, 1998)\nstated a little over a century ago, that shape may well be\nmultiply connected rather than simply connected.\nMore recently, the generic predictions of a cutoff in\npower at large scales were made when only the COBE data\nwere available (Starobinsky 1993; Stevens et al. 1993). The\nidentified circles principle (Cornish et al. 1996, 1998), of\nwhich the present method is an extension, and the matching\nof the Poincaré Dodecahedral Space hypothesis to the large\n\nA\n\nB\n\nC\n\nφφ\n\nFig. 15. Schematic diagram showing two circles on the SLS on\nwhich cross-correlation is to be optimised, for twist φ = 0. The\nfluctuations are zero everywhere on the two circles except at the\npoints A and B on the first circle and C on the second circle. At\nall three points the fluctuation amplitude is +1.\n\nscale lack of power and the estimates of Ωtot ∼ 1.01–1.02\n(Luminet et al. 2003), were published without the knowledge that the present version of the method, allowing for\na \"generalised\" PDS of arbitrary twist angle, would be applied to the WMAP data. It seems physically unreasonable,\ntherefore, not to combine the probabilities of the different\nsigns of cosmic topology.\nIn this case, to argue that the probability in Eq. 16\nhas underestimated, either the Spergel et al. (2003) or\nEfstathiou (2004) probability estimates of a low Sξ have to\nbe increased, or the estimate of the probability of a PDSlike signal, given a low Sξ , (Eq. 13) has to be increased.\nWe have conservatively taken the maximum probability estimate in Table 5 of Efstathiou (2004) for the former.\nFor the latter, we have conservatively assumed that\nthe two simulations with α ≫ αlimit have a signal given\nby the MCMC method similar enough to the signal in\nthe observational map that we can set this probability at\nWMAP\n< S INC3 ) ≤ 10%. To increase this probabilP (ξC\n|Sξ ∼\nξ\nity significantly, it would be necessary to argue that many\nor most of the simulations have convergence characteristics, best estimates of α ≫ αlimit and best estimates of\nφ ≈ ±π/5 similar to those for the observational map. Given\nthe results presented in Sect. 4.3, a systematic error of this\nsort able to satisfy this seems unlikely.\nOn the contrary, Fig. 11 and the rank correlation statistics (Sect. 4.3.4) favouring a positive correlation between α\nWMAP\n< S INC3 ) is smaller than\nand Sξ suggest that P (ξC\n|Sξ ∼\nξ\nwhat we have been able to estimate with a small number\nof simulations. This is consistent with what was argued in\nRBSG08, i.e. that the lower the amplitude of the large-scale\nauto-correlations, the less chance there should be of crosscorrelations occurring in the absence of a PDS-like signal\nor for a wrong orientation of the PDS model.\nThis suggests two possible alternative approaches to\nthat used here. Either we could generate simulations so\nthat most of the set of simulations have Sξ about as low as\nthat observed - with the kp2 cut - or we could generate\nsimulations for the full uncut sky. However, both of these\napproaches have problems. The problems in both cases arise\nfrom the fact that a large amount of the large scale power\nis estimated to lie close to the Galactic Plane, but the estimates of how much this power is and of how precisely we\ncan measure the detailed fluctuations close to the Galactic\nPlane are highly uncertain. For example, Table 4 shows that\nthe estimates for Sξ for the five-year ILC and TOH maps\ndiffer by only 10% when the kp2 cut is used, but differ by\nnearly a factor of 2 for the full sky.\n\n\fRoukema, Buliński & Gaudin: Poincaré dodecahedral space parameters\n800\n\n600\n\nN 400\n\n200\n\n0\n\n−100\n\n0\nφ\n\n100\n\nFig. 16. Distribution of the twist angle φ in 16 MCMC chains\nrun on the INC3 observational map, for states where P > 0.5\n(the four chains\n√ shown in Fig. 8 plus 12 additional MCMC\nchains), with N error bars, excluding states with α ≤ 15◦ .\nSuppose that we generate simulations so that most of\nthe set of simulations have Sξ about as low as that observed, using the kp2 cut. In this case, we implicitly assume that both the extrapolations from outside of the kp2\ncut to inside it, as well as the direct estimates for the full\nsky, vastly overestimate the power inside the kp2 cut. For\ntesting a multiply connected model hypothesis, this could\nhave some validity given that the spherical harmonics are\nnot statistically independent from one another. However,\nthis is not the null hypothesis that is to be tested with\nthe simulations. The aim is to test the null hypothesis of\na simply connected, infinite, flat model with Gaussian random fluctuations. This model implies a relation between\nstructures inside and outside of the kp2 cut, which needs\nto be included in the simulations if we wish to correctly test\nthe hypothesis. In other words, the statistics of fluctuations\ngenerated by simulations which are designed to mostly have\nsmall Sξ outside of the kp2 cut are unlikely to be statistically equivalent to those of fluctuations generated in the\nway performed here. In the present work, the full set of\nsimulations was generated by the Hinshaw et al. (2007) estimates of the Cl values, and a subset of these was selected\nwith the criterion that Sξ outside of the kp2 cut must be as\nclose as possible to Sξ of the observations outside of the kp2\ncut. These two different methods of generating simulations\nare distinct.\nThe second alternative to the present method would be\nto generate simulations for the full uncut sky, and to run\nMCMC chains on both these and the observational map.\nHowever, because of the intrinsic difficulty in correcting\nfor emission in the Galactic Plane and as is indicated in\nTable 4 for two different versions of the all-sky map of the\ncosmological signal, there would then be a much greater\nsystematic uncertainty in the results. Hence, both of these\ntwo alternative approaches have disadvantages relative to\nthe method used here.\nIn addition to our main results of probability estimates, it has become clear that the properties of the expected distribution of φ (for the null hypothesis of an\ninfinite, flat model) are not simple. This can be understood generically by realising that the mathematical procedure we are using is pattern matching. A cross-correlation\n\n15\n\nfor the correct mapping between two genuinely correlated\ncopies of a single pattern will necessarily yield a high value.\nHowever, for a pattern which is sufficiently complex, both\ncross-correlations for incorrect mappings between two genuinely correlated copies of a single pattern, and also crosscorrelations for arbitrary mappings between two uncorrelated patterns may in some cases yield high values due to\nthe complexities of the patterns and chance correlations.\nFrom first principles, modelling this is unlikely to be simple.\nFor this reason, simulations provide an algorithmic shortcut to estimating the likely distribution of φ, given a certain family of patterns. Gaussian random fluctuations from\na given Cl spectrum are one such family of patterns. For\na different Cl spectrum or different statistical properties\nof the fluctuations, different characteristics of the expected\ndistribution of φ may occur. Here we discuss some characteristics of interest.\n5.3.1. Tendency of an MCMC chain to favour regions of φ\napproximately symmetric around zero\nFigure 8 in RBSG08 and Figs 4 and 8 each indicate that\nin addition to the main cross-correlation signal, there is\nalso an additional, weak, secondary signal with an approximately equal but opposite value of φ. This is clear in Table 3\nof RSBG08 and Fig. 5 for the five-year ILC and TOH maps.\nSince only four MCMC chains were carried out for each of\nthe INC3 real and simulational maps for the main INC3\nanalysis, we carried out 12 additional MCMC chains on\nthe real INC3 map in order to create a histogram equivalent to those in Fig. 5. The resulting histogram of the φ\ndistribution from the 16 chains is shown in Fig. 16. This is\nclearly consistent with those in Fig. 5, in the sense that the\n+π/5 peak strongly dominates over the −π/5 peak.\nIs it physically reasonable that a PDS model would give\nboth −π/5 and +π/5 as valid twist angles, even where one\ntwist gives a much weaker signal than the other? At most\none of these can indicate the correct 3-manifold of comoving\nspace. A possible explanation for both twist angles to be\nfavoured in the MCMC chains might be that the density\nperturbations went through some sort of resonance process\nduring an early epoch. In that case, it is conceivable that\na harmonic created at that early epoch would still remain\npresent.\nThe optimal cross-correlations in the simulations, in\nparticular those shown in Figs 9 and 13, also have bimodal\ndistributions of preferred values of φ. Moreover, they appear to give nearly equal weight to solutions with positive\nand negative values of φ of about the same absolute value.\nThis suggests that some type of pattern in the fluctuations\ncan tend to cause an MCMC chain to favour regions of φ\napproximately symmetric around zero.\nThe following schematic diagram shows that at least\none specific pattern of fluctuations on the sky can lead to\nsome degree of symmetry of optimal φ values, to the extent to which the real (or simulated) pattern mimics the\nidealised pattern. Figure 15 shows two circles on opposite\nsides of the sky, seen by someone external to the SLS, looking approximately but not nearly along the axis joining the\ntwo circles. If we approximate this region of the covering\nspace S 3 as an approximately flat region for intuitive simplicity, then the mapping corresponding to a \"generalised\"\nholonomy transformation from one circle to the other is a\ntranslation followed by a twist. If the twist is either +φ\n\n\f16\n\nRoukema, Buliński & Gaudin: Poincaré dodecahedral space parameters\n\nC'\n\nB'\n\nA\n\n100\n\nB\n\nA'\n\nφ (deg)\n\nπ\nC\n\n0\n\nFig. 17. Schematic diagram of two circles on the SLS for twist\nφ = 0, illustrating that the observed anti-correlation at antipodal points on the SLS corresponds to an anti-correlation at twist\nφ = π on the circles. Solid circles at points A, B, and C indicate\npositive fluctuations, and hollow circles at the antipodal points\nA', B', and C' indicate negative fluctuations.\n\n−100\n\n5\n\nor −φ, then the summed cross-correlation is 1. If the twist\nis anything other than ±φ, including zero, then these two\nidealised circles will have a zero cross-correlation.\nThe original identified circles principle, i.e. the present\nmethod in the limit of zero pair separations, would imply\nthat both of these patterns are equally optimal. By extension, our present method will find the same result for this\nidealised pattern.\nThis schematic situation is clearly highly simplified.\nApart from the fact that the fluctuation patterns are unlikely to be as simple as in Fig. 15, here we have assumed\nthat the MCMC chain is fixed at a particular orientation\non the sky and matched circle size. In reality, the chains are\nfree to change both of these. Changing orientation and/or\ncircle size would weaken the symmetry provided by the pattern in Fig. 15. Hence, to calculate the relevance of this\nschematic pattern realistically from first principles would\nbe quite complex. However, given that we have realistic\nnumerical simulations (for the infinite, flat model), we do\nhave an illustration here of at least one basic pattern which\ncould lead to best solutions which are approximately symmetric in φ around two values ±φ, even though only one of\nthese two values is the \"true\" value (physical or simulated)\nof the map.\n5.3.2. Properties of the distribution of optimal φ values\nStatistical properties of the distribution of optimal φ values found in the analyses of the simulations (Fig. 14) are\ndifferent from what was intuitively expected. Not only is\nthe distribution of φ not uniform on [−π, π], but it is moderatelypwell fit by a Gaussian centred on φ = 0◦ of width\nσφ ≡ hφ2 i ≈ π/5 (Table 6). Why is the distribution of\noptimal φ values not uniform on [−π, π]? Why should σφ\nbe approximately π/5?\nConsider the twist angle φ = π. On matched circles, this\nrepresents pairs of antipodal points, independently of the\nmatched circle size α. Figure 17 illustrates this schematically. In general, a pair of points on a pair of would-be\nmatching circles are separated by a twist φ ≪ γ, where γ\nis the angle on the SLS separating the pair of points. The\nexception is that φ = π when γ = π. This separation corresponds to a spatial geodesic separation between the pair\nof points in the covering space S 3 of 2rSLS .\nFor antipodal points, ξA is slightly negative (Fig. 16,\nSpergel et al. 2003; Fig. 1, RBSG08). In the simulations\n\n10\n\n15\n\n20\n25\n(deg)\nα\n\n30\n\n35\n\n40\n\nFig. 18. Median circle sizes α and twist angles φ (mean) for\neach of the 20 simulations, analysed using the steps with P >\n0.5, modified as described in Sect. 5.3.2 by inverting the anticorrelation in 50 randomly selected pairs of 10◦ radius antipodal\npatches on the sky.\n8\n\n6\n\nN 4\n\n2\n\n0\n\n−100\n\n0\nφ\n\n100\n\nFig. 19. Histogram of φ values shown in Fig. 18. The Gaussian\ndistribution shown in Fig. 14 is reproduced here.\n\nanalysed here, this anti-correlation at φ = π is approximately −100(μK)2 in most simulations.\nThe MCMC chains are optimised to find positive crosscorrelations, not anti-correlations. Hence, it should, in fact,\nbe expected9 that optimal cross-correlations should cluster\ntowards φ = 0 and away from φ = π.\nWe test this with a toy model as follows. The angular\nscale above which the auto-correlation becomes negative in\nFig. 16 of Spergel et al. (2003) is acos(−0.9) = 154◦. To\nfirst order, we can approximately think of this as antipodal\npairs of 25◦ discs on the sky being anti-correlated. So, we\nstart with one of the simulated maps and randomly select\n50 antipodal pairs from a uniform distribution on the sky.\nFor each antipodal pair, we calculate the mean temperature\nfluctuation within 10◦ of each pole. We choose this radius\nto be smaller than 25◦ so that there is a fair chance that\n9\n\nThis fact was missed in RBSG08.\n\n\fRoukema, Buliński & Gaudin: Poincaré dodecahedral space parameters\n\nthe disc we use will mostly cover a single \"anti-correlated\"\ndisc, of full size 25◦ . If we had chosen the full disc size,\nthen frequently there would be too little overlap for an\nanti-correlation to be measured. If the product of the mean\ntemperature fluctuations in the two discs of the pair is negative, then we multiply the fluctuations in one member of\nthe pair by -1. This is done for all 50 antipodal disc pairs. If\nthere were no overlap between these discs, then this would\ncover about 80% of the full sky.\nWhile this procedure is not likely to give a valid statistical set of fluctuation patterns for testing the infinite,\nflat universe hypothesis, it should be sufficient for qualitatively testing the hypothesis that the anti-correlation\nis responsible for the concentration of the expected distribution of φ away from π and towards zero. Moreover,\nsince the anti-correlation at the antipodes provides some\ncontribution to Sξ , this procedure decreases the minimum, mean, and median values of Sξ for the 20 simulations from 1170, 2928, 3071(μK)4 to 467, 1494, 1169(μK)4\nrespectively, i.e. by about a factor of two. The maximum\nvalue of Sξ increases slightly, from 3782 to 4012(μK)4.\nFigure 18 shows the result of searching for optimal PDS\nsolutions using four MCMC chains per modified simulation,\nand analysing the chains as before. The distribution of best\nφ estimates is shown in Fig. 19. Several effects of the antipodal anti-correlation reversal are visible in the two figures.\nFirstly, several optimal correlations occur close to the antipodes, i.e. at φ ∼ π. Secondly, the chains which escape\nto αlimit have optimal φ values spread over a wider range\nthan without the modification. These two effects are qualitatively consistent with the hypothesis that the antipodal\nanti-correlation plays an important role in concentrating\nthe expected φ distribution for an infinite, flat model towards zero.\nA third effect can also be seen in Fig. 18; a fairly large\nnumber of chains no longer escape to αlimit . Since we reverse\nthe fluctuation sign in one element of each of 50 antipodal\npairs, it is clear that this does not only affect antipodal correlations, it can also create correlations at several different\nscales, which did not exist in the original simulation. This\ncan create highly artifical attractors for the MCMC chains.\nThe combination of these effects does not yield a distribution of φ which looks uniform by inspection of Figs 18 and\n19. A Kolmogorov-Smirnov two-sided test comparing the φ\ndistribution to a uniform distribution on [−π, π] yields a\nprobability of 16%, i.e. the distribution is only marginally\nconsistent with a uniform distribution. Clearly, although\nthe non-uniform distribution of φ is clearly influenced by\nthe antipodal anti-correlation, the latter alone is insufficient\nto explain it.\nGiven that the observational map does include an antipodal anti-correlation, and possibly other features contributing to the non-uniform expected distribution of φ, to\nwhat degree should the optimal cross-correlations favour φ\nclose to zero, and what shape should the distribution of φ\ntake? For example, if σφ as defined above is estimated on\nthe interval (without periodicity) [−π, π), then how small\nshould it be?\nThe simulations are generated from spherical harmonics using the spherical harmonic mean coefficients Cl of\nHinshaw et al. (2007), obtained from the WMAP data, but\nwith random phases (and simulated noise). We choose those\nof the simulations with the lowest Sξ estimates. These simulations contain much of the same information that is in\n\n17\n\nthe observational data set. After all, this is the point of\nsimulations.\nWe know that the MCMC chains in the data with\nthe correct phases favour φ = +π/5, and have an anticorrelation at 2rSLS . Randomising the phases of the spherical harmonics while retaining the Cl values should yield\nmany statistical properties that are similar to that of the\nmap with the correct phases. So, the simulated maps must\nstatistically allow φ to be at least as high as π/5, but do not\nnecessarily have to allow it to be much higher. Since the random phases have no way of favouring right-handed twists\nover left-handed twists, a distribution centred at φ = 0 and\nincluding values roughly up to ±π/5 is consistent with the\ninformation that the simulations should statistically contain. However, the reason why the distribution does not\nextend to optimal twists with |φ| ≫ π/5 remains an open\nquestion for future work.\n\n6. Conclusion\nBy use of some spherical trigonometry, it is possible to\nspeed up the Markov Chain Monte Carlo cross-correlation\nmethod of testing a cosmic topology hypothesis described\nin RBSG08 by a factor of about 3–10. This is shown in\nFig. 1 and Eq. (5). This could, in principle, make it practical to make calculations at higher resolution than before. However, the physical interpretation of the calculations would be ambiguous because of several systematic\neffects listed above.\nMoreover, for low matched circle sizes and low maximum pair separations, use of Eq. (5) can increase the numbers of pairs per separation bin, thereby decreasing the\nnoise. A further improvement in the method and the relation between this method as a test of \"matched annuli\"\nand tests of matched circles are discussed above in Sect. 5.1.\nApplying the faster method to the ILC and TOH versions of the WMAP five-year data, we find little significant\nchange in the best estimate parameters for a Poincaré dodecahedral space model of the Universe, compared to those\ngiven in RBSG08. Depending on the minimum pseudoprobability level used in the MCMC chains that is used\nfor estimating the twist φ, the optimal value of φ is a few\ndegrees greater and a few degrees less than +36.0◦ in the\nILC and TOH maps respectively (Table 3).\nWe also applied the faster method to a small number of simulated skies. The WMAP observations confirmed\nthe generic cosmic topology prediction (Starobinsky 1993;\nStevens et al. 1993) of a cutoff in structure statistics such as\nthe temperature-temperature fluctuation auto-correlation\non large angular or spatial scales. Here, we estimated the\nweakness of the large scale auto-correlations using a statistic Sξ [Eq. (2)] similar to that of Spergel et al. (2003). The\nlow observed value of Sξ implies that cross-correlations on\nthese scales should usually be weak, so that MCMC chains\nas used here should have difficulty finding a region of parameter space with high optimal cross-correlations. Hence,\nto conservatively test the infinite, flat, concordance model\nhypothesis, on the assumption that the real observations\nhave a low value of Sξ due to being a single realisation\nof a random process, we analysed simulated skies which\nuse the Hinshaw et al. (2007) Cl estimates and randomised\nphases of the spherical harmonics. The observational map\nwas calculated from the three least contaminated frequency\n\n\f18\n\nRoukema, Buliński & Gaudin: Poincaré dodecahedral space parameters\n\nWMAP bands, Q, V and W, and the Gaussian random fluctuation simulations were created using an equivalent analysis pipeline (Lew & Roukema 2008).\nFor simulated and observed skies with the kp2 Galactic\ncut, these simulations using the Hinshaw et al. (2007) Cl\nestimates generally yield overestimates of Sξ for the cut sky.\nSince we prefer to analyse the cut sky in order to minimise\ngalactic contamination effects, it was necessary to select\nthose simulations with the lowest values of Sξ , so that the\nsimulations were statistically as similar as possible to the\nobservations outside of the kp2 cut.\nThe results of running MCMC chains on the 20 simulations with the lowest Sξ estimates from among 50 simulations were that only two simulations gave optimal crosscorrelation solutions which did not escape to the lower\nlimit in circle size α, where small number statistics favour\nfortuitous cross-correlations. This indicates a conditional\nprobability of finding a non-noise solution of about 10%\n[Eq. (11)].\nThe distribution of optimal twists φ from the simulations showed that despite the low value of Sξ , the expected distribution of φ in the simulations was not uniform. Instead, it is consistent with a Gaussian distribution\ncentred near φ = 0, of width ∼ 33–38◦. Possible reasons\nfor the nature of this distribution are discussed above, in\nSections 5.3.1 and 5.3.2.\nAssuming this numerical, Gaussian fit to the expected\n(for an infinite, flat model) distribution of φ, and using\nthe estimate of φ obtained from the observational map\n(Table 5) that is most discrepant from π/5, we found that\nφ could be expected to be as close to ±π/5 as the observational value is close to +π/5 with a probability of about\n22% [Eq. (12)].\nBoth of these probabilities are conditional on Sξ being\nlow, which itself is unusual for an infinite, flat model (e.g.,\nSpergel et al. 2003; Efstathiou 2004). Hence, for an infinite,\nflat, cosmic concordance model with Gaussian random fluctuations, we find that comparing an observational map with\nsimulational maps gives an estimate of the chance of finding both (a) a large scale autocorrelation as weak as that\nobserved, and (b) a PDS-like, optimal cross-correlation signal similar to that observed to be about 0.015% or 1.25%\nfor the Spergel et al. (2003) or Efstathiou (2004) estimates\nof the probability of low Sξ respectively [Eq. (16)].\nAcknowledgements. Thank you to Bartosz Lew for numerous\nhelpful and insightful comments, and to the anonymous referee who\nprovided constructive and thoughtful recommendations. Usage of\nthe Nicolaus Copernicus Astronomical Center (Toruń) computer\ncluster is gratefully acknowledged. Use was made of the WMAP data\n(http://lambda.gsfc.nasa.gov/product/ ), of the Centre de Données\nastronomiques de Strasbourg (http://cdsads.u-strasbg.fr), of\nGNU Octave command-line, high-level numerical computation\nsoftware\n(http://www.gnu.org/software/octave ),\nthe\nGNU\nproject R environment for statistical computing and graphics\n(http://www.r-project.org/ ) and the GNU plotutils plotting\npackage.\n\nReferences\nAurich, R. 2008, ArXiv e-prints, 803, [arXiv:0803.2130]\nAurich, R., Lustig, S., & Steiner, F. 2005a, ClassQuantGra, 22, 3443,\n[arXiv:astro-ph/0504656]\nAurich, R., Lustig, S., & Steiner, F. 2005b, ClassQuantGra, 22, 2061,\n[arXiv:astro-ph/0412569]\nAurich, R., Lustig, S., & Steiner, F. 2006, MNRAS, 369, 240,\n[arXiv:astro-ph/0510847]\n\nCaillerie, S., Lachièze-Rey, M., Luminet, J. ., et al. 2007, A&A, 476,\n691, [arXiv:0705.0217v2]\nCornish, N. J., Spergel, D. N., & Starkman, G. D. 1996, ArXiv\nGen.Rel. & Quant.Cosm. e-prints, [arXiv:gr-qc/9602039]\nCornish, N. J., Spergel, D. N., & Starkman, G. D. 1998,\nClassQuantGra, 15, 2657\nCornish, N. J., Spergel, D. N., Starkman, G. D., & Komatsu, E. 2004,\nPhys. Rev. Lett., 92, 201302, [arXiv:astro-ph/0310233]\nEfstathiou, G. 2004, MNRAS, 348, 885, [arXiv:astro-ph/0310207]\nGausmann, E., Lehoucq, R., Luminet, J.-P., Uzan, J.-P., & Weeks, J.\n2001, ClassQuantGra, 18, 5155, [arXiv:gr-qc/0106033]\nGundermann, J. 2005, arXiv preprints, [arXiv:astro-ph/0503014]\nHinshaw, G., Nolta, M. R., Bennett, C. L., et al. 2007, ApJS, 170,\n288, [arXiv:astro-ph/0603451]\nHinshaw, G., Spergel, D. N., Verde, L., et al. 2003, ApJS, 148, 135,\n[arXiv:astro-ph/0302217]\nHinshaw, G., Weiland, J. L., Hill, R. S., et al. 2008, ArXiv e-prints,\n803, [arXiv:0803.0732]\nKey, J. S., Cornish, N. J., Spergel, D. N., & Starkman, G. D. 2007,\nPhys. Rev. D, 75, 084034, [arXiv:astro-ph/0604616]\nLambert, J. 1772, Anmerkungen und Zusätze zur Entwerfung der\nLand und Himmelscharten. In Beiträge zum Gebrauche der\nMathematik und deren Anwendung, pt. 3, sec. 6. (English translation: Notes and Comments on the Composition of Terrestrial\nand Celestial Maps, Ann Arbor, University of Michigan 1972)\nLehoucq, R., Weeks, J., Uzan, J.-P., Gausmann, E., & Luminet, J.-P.\n2002, ClassQuantGra, 19, 4683, [arXiv:gr-qc/0205009]\nLew, B., & Roukema, B. F. 2008, A&A, 482, 747, [arXiv:0801.1358]\nLuminet, J., Weeks, J. R., Riazuelo, A., Lehoucq, R., & Uzan, J. 2003,\nNature, 425, 593, [arXiv:astro-ph/0310253]\nNiarchou, A., & Jaffe, A. 2007, Physical Review Letters, 99, 081302,\n[arXiv:astro-ph/0702436]\nRiazuelo, A., Weeks, J., Uzan, J., Lehoucq, R., & Luminet, J. 2004,\nPhys. Rev. D, 69, 103518, [arXiv:astro-ph/0311314]\nRoukema, B. F., Buliński, Z., Szaniewska, A., & Gaudin, N. E. 2008,\nA&A, 486, 55, [arXiv:0801.0006]\nRoukema, B. F., Lew, B., Cechowska, M., Marecki, A., & Bajtlik, S.\n2004, A&A, 423, 821, [arXiv:astro-ph/0402608]\nSchwarzschild, K. 1900, Vier.d.Astr.Gess, 35, 337\nSchwarzschild, K. 1998, ClassQuantGra, 15, 2539\nSpergel, D. N., Verde, L., Peiris, H. V., et al. 2003, ApJS, 148, 175,\n[arXiv:astro-ph/0302209]\nStarobinsky, A. A. 1993, Journal of Experimental and Theoretical\nPhysics Letters, 57, 622\nStevens, D., Scott, D., & Silk, J. 1993, Physical Review Letters, 71,\n20\nTegmark, M., de Oliveira-Costa, A., & Hamilton, A. 2003,\nPhys. Rev. D, 68, 123523, [arXiv:astro-ph/0302496]\nWeeks, J. 2001, The Shape of Space (2nd edition) (Manhattan: Marcel\nDekker)\nWeinberg, S. 1972, Gravitation and cosmology: Principles and applications of the general theory of relativity (New York: Wiley)\n\n\f"}