{"id": "http://arxiv.org/abs/0903.0729v1", "guidislink": true, "updated": "2009-03-04T11:05:25Z", "updated_parsed": [2009, 3, 4, 11, 5, 25, 2, 63, 0], "published": "2009-03-04T11:05:25Z", "published_parsed": [2009, 3, 4, 11, 5, 25, 2, 63, 0], "title": "Modeling the High-z Universe: Probing Galaxy Formation", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0903.2430%2C0903.3504%2C0903.3143%2C0903.0120%2C0903.2596%2C0903.2978%2C0903.4740%2C0903.1676%2C0903.4507%2C0903.4079%2C0903.4987%2C0903.0828%2C0903.0985%2C0903.4867%2C0903.4273%2C0903.2719%2C0903.1118%2C0903.5129%2C0903.1068%2C0903.2482%2C0903.2985%2C0903.4680%2C0903.3191%2C0903.2287%2C0903.1571%2C0903.3639%2C0903.2578%2C0903.0967%2C0903.0473%2C0903.3489%2C0903.4184%2C0903.2892%2C0903.1399%2C0903.5411%2C0903.1508%2C0903.1698%2C0903.1576%2C0903.1381%2C0903.1162%2C0903.1146%2C0903.2465%2C0903.5174%2C0903.0528%2C0903.4902%2C0903.3247%2C0903.0314%2C0903.2954%2C0903.1615%2C0903.0551%2C0903.4834%2C0903.1693%2C0903.4647%2C0903.3023%2C0903.3318%2C0903.0857%2C0903.2673%2C0903.0729%2C0903.0522%2C0903.4688%2C0903.0230%2C0903.1076%2C0903.2839%2C0903.3168%2C0903.0158%2C0903.4597%2C0903.5148%2C0903.4187%2C0903.3231%2C0903.3094%2C0903.2329%2C0903.5220%2C0903.0188%2C0903.2648%2C0903.0361%2C0903.3123%2C0903.0580%2C0903.1230%2C0903.2413%2C0903.4967%2C0903.4088%2C0903.2406%2C0903.0325%2C0903.1723%2C0903.4026%2C0903.0085%2C0903.1844%2C0903.3822%2C0903.0002%2C0903.0270%2C0903.4881%2C0903.3577%2C0903.0763%2C0903.4915%2C0903.2508%2C0903.5074%2C0903.0214%2C0903.2077%2C0903.4411%2C0903.1916%2C0903.3984%2C0903.1577&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Modeling the High-z Universe: Probing Galaxy Formation"}, "summary": "We discuss how the conditions at high redshift differ from those at low\nredshift, and what the impact is on the galaxy population. We focus in\nparticular on the role of gaseous dissipation and its impact on sustaining high\nstar formation rates as well as on driving star-bursts in mergers. Gas\naccretion onto galaxies at high redshifts occurs on a halo dynamical time\nallowing for very efficiently sustained star formation. In addition cold\naccretion flows are able to drive turbulence in high redshift disks at the\nlevel observed if at least 20% of the accretion energy is converted into random\nmotion in the gaseous disk. In general we find that the fraction of gas\ninvolved in galaxy mergers is a strong function of time and increases with\nredshift. A model combining the role of dissipation during mergers and\ncontinued infall of satellite galaxies allows to reproduce the observed\nsize-evolution of early-type galaxies with redshift. Furthermore we investigate\nhow the evolution of the faint-end of the luminosity function can be explained\nin terms of the evolution of the underlying dark matter evolution.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0903.2430%2C0903.3504%2C0903.3143%2C0903.0120%2C0903.2596%2C0903.2978%2C0903.4740%2C0903.1676%2C0903.4507%2C0903.4079%2C0903.4987%2C0903.0828%2C0903.0985%2C0903.4867%2C0903.4273%2C0903.2719%2C0903.1118%2C0903.5129%2C0903.1068%2C0903.2482%2C0903.2985%2C0903.4680%2C0903.3191%2C0903.2287%2C0903.1571%2C0903.3639%2C0903.2578%2C0903.0967%2C0903.0473%2C0903.3489%2C0903.4184%2C0903.2892%2C0903.1399%2C0903.5411%2C0903.1508%2C0903.1698%2C0903.1576%2C0903.1381%2C0903.1162%2C0903.1146%2C0903.2465%2C0903.5174%2C0903.0528%2C0903.4902%2C0903.3247%2C0903.0314%2C0903.2954%2C0903.1615%2C0903.0551%2C0903.4834%2C0903.1693%2C0903.4647%2C0903.3023%2C0903.3318%2C0903.0857%2C0903.2673%2C0903.0729%2C0903.0522%2C0903.4688%2C0903.0230%2C0903.1076%2C0903.2839%2C0903.3168%2C0903.0158%2C0903.4597%2C0903.5148%2C0903.4187%2C0903.3231%2C0903.3094%2C0903.2329%2C0903.5220%2C0903.0188%2C0903.2648%2C0903.0361%2C0903.3123%2C0903.0580%2C0903.1230%2C0903.2413%2C0903.4967%2C0903.4088%2C0903.2406%2C0903.0325%2C0903.1723%2C0903.4026%2C0903.0085%2C0903.1844%2C0903.3822%2C0903.0002%2C0903.0270%2C0903.4881%2C0903.3577%2C0903.0763%2C0903.4915%2C0903.2508%2C0903.5074%2C0903.0214%2C0903.2077%2C0903.4411%2C0903.1916%2C0903.3984%2C0903.1577&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We discuss how the conditions at high redshift differ from those at low\nredshift, and what the impact is on the galaxy population. We focus in\nparticular on the role of gaseous dissipation and its impact on sustaining high\nstar formation rates as well as on driving star-bursts in mergers. Gas\naccretion onto galaxies at high redshifts occurs on a halo dynamical time\nallowing for very efficiently sustained star formation. In addition cold\naccretion flows are able to drive turbulence in high redshift disks at the\nlevel observed if at least 20% of the accretion energy is converted into random\nmotion in the gaseous disk. In general we find that the fraction of gas\ninvolved in galaxy mergers is a strong function of time and increases with\nredshift. A model combining the role of dissipation during mergers and\ncontinued infall of satellite galaxies allows to reproduce the observed\nsize-evolution of early-type galaxies with redshift. Furthermore we investigate\nhow the evolution of the faint-end of the luminosity function can be explained\nin terms of the evolution of the underlying dark matter evolution."}, "authors": ["S. Khochfar"], "author_detail": {"name": "S. Khochfar"}, "author": "S. Khochfar", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1002/9783527629190.ch4", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0903.0729v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0903.0729v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "To appear in \"Reviews in Modern Astronomy\", volume 21, Proceedings of\n  JENAM 2008, Vienna", "arxiv_primary_category": {"term": "astro-ph.CO", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph.CO", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0903.0729v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0903.0729v1", "journal_reference": null, "doi": "10.1002/9783527629190.ch4", "fulltext": "Modeling the High-z Universe:\nProbing Galaxy Formation\n\narXiv:0903.0729v1 [astro-ph.CO] 4 Mar 2009\n\nSadegh Kho hfar\nMax-Plan k-Institute for Extraterrestrial Physi s\nGiessenba hstrasse, D-85748 Gar hing, Germany\nsadeghk\bmpe.mpg.de, http://www.mpe.mpg.de/∼sadeghk/\n\nAbstra t\n\nWe dis uss how the onditions at high redshift di\u001ber from those at low\nredshift, and what the impa t is on the galaxy population. We fo us in\nparti ular on the role of gaseous dissipation and its impa t on sustaining\nhigh star formation rates as well as on driving star-bursts in mergers.\nGas a retion onto galaxies at high redshifts o urs on a halo dynami al\ntime allowing for very e\u001e iently sustained star formation. In addition\nold a retion \u001dows are able to drive turbulen e in high redshift disks\nat the level observed if at least 20% of the a retion energy is onverted\ninto random motion in the gaseous disk. In general we \u001cnd that the\nfra tion of gas involved in galaxy mergers is a strong fun tion of time\nand in reases with redshift. A model ombining the role of dissipation\nduring mergers and ontinued infall of satellite galaxies allows to reprodu e the observed size-evolution of early-type galaxies with redshift.\nFurthermore we investigate how the evolution of the faint-end of the\nluminosity fun tion an be explained in terms of the evolution of the\nunderlying dark matter evolution.\n1\n\nIntrodu tion\n\nThere is ample eviden e that the onditions under whi h galaxies formed at\nhigh redshift where quite di\u001berent to those at later times during the evolution\nof the universe. Impressive eviden e supporting su h a view has been lately\nolle ted from detailed integral \u001celd spe tros opy of z ∼ 2 galaxies (Förster\nS hreiber et al. 2006, Genzel et al. 2006). These observations reveal massive,\nhigh star forming galaxies that show rotational stru ture that resemble those\nof disk galaxies. In ontrast to low redshift disk galaxies however, the ratio of\ngas rotational velo ity to velo ity dispersion is only of the order few ompared\nto V /σ ∼ 10 at low z. Furthermore it has been well established by now, that\nthe star formation rate in the universe is a de lining fun tion of time (Hopkins\n2004) and that this is driven by a down-sizing in the average star formation\nrate of galaxies of a given mass as a fun tion of time (Juneau et al 2005,\nNoeske et al. 2007). Besides star formation, merger rates (e.g. Le Fèvre\net al 2000) and AGN a tivity (Hasinger et al. 2007) show an upward trend\nwith redshift, peaking around z ∼ 3 − 4 indi ating the importan e of the\n1\n\n\fhigh-z universe for the assembly and formation of galaxies. That indeed a\nlarge fra tion of the stellar mass of massive galaxies is already in pla e at\nz ≥ 2 \u001cnds it support from studies of their stellar population (Thomas et al.\n2005) and the evolution of the mass density in units of the z = 0 mass density\n(Pérez-González et al. 2008).\nThe hierar hi al ΛCDM paradigm has been su essful in predi ting and reprodu ing several of the above mentioned trends. In parti ular the in reasing\nmerger fra tion as a fun tion of redshift is a natural out ome (kb2001, ks2008,\nfarouhki ma) of this model and driven by the merging history of the underlying dark matter halos. With respe t to the evolution of baryoni physi s\nwithin su h evolving haloes early work by (Binney 1977, Silk 1977, Rees &\nOstriker 1977) laid out the ground work. Radiative ooling and the ollapse\ninto a rotationally supported disk of initial hot gas at the halos virial temperature, followed by star formation in this disk where the main me hanism\nto build up galaxies. Besides its simplifying assumption, e.g. about spheri al\nsymmetry of the halo, its pro\u001cle and other properties of the dark matter and\nasso iated gas infall, these models proved to be very su essful in predi ting\ngalaxy properties and in parti ular a transition mass s ale at whi h galaxy\nformation be omes very ine\u001e ient due to long radiative ooling times of the\ngas (Dekel & Birnboim 2006), thus ausing star formation to slow down or\neven halt. In omparison to detailed high resolution numeri al simulations\nthese models have shown to predi t ooling rates too low by a fa tor of a\nfew, espe ially in low mass halos and at early times (Keres et al 2005). This\ndis repan y an be attributed partly to the geometry of the a retion pro ess\nin osmologi al simulations whi h is not ne essarily spheri al symmetri as\nassumed in simpli\u001ced models, but follows the osmi \u001claments. However, the\nessen e of the a retion pro ess of old gas at high redshift an be summarized\nby fast and e\u001e ient, on the host halos dynami al time. In e\u001be t old gas is\na reted with a rate omparable to the dark matter a retion rate times the\nosmologi al baryon fra tion fb ṀDM . This situation will not hold in massive\nhalos however, where stable sho ks heat the infalling gas to the halos virial\ntemperature and ooling times are longer than the dynami al time, and neither at late times when already a substantial fra tion of baryons have made it\ninto stars. In the following se tion we will investigate the impa t this e\u001e ient\nprovision of old gas has on the evolution and formation of galaxies.\n2\n\nThe Model\n\nWe use the semi-analyti model Simurgh to model the formation and evolution of galaxies. The dark matter history is al ulated using the merger tree\nproposed by Somerville et al. 1999 with a mass resolution of 2 × 109 M⊙ .\nThe baryoni physi s within these dark matter haloes is al ulated following\nre ipes presented in Springel et al. (2001) and referen es therein, in luding a\nmodel for the reionizing ba kground by Somerville 2002. In our simulation, we\nassume that ellipti al galaxies form whenever a major merger (M1 /M2 ≤ 3.5\n2\n\n\fwith M1 ≥ M2 ) takes pla e. We assume that during this pro ess, all the old\ngas in the progenitor disks will be onsumed in a entral starburst, adding to\nthe spheroid mass, and that all stars in the progenitor disks will ontribute to\nthe spheroid as well. Furthermore, we also add the stars of satellite galaxies\ninvolved in minor mergers to the spheroid. The merger time s ale for galaxies\nis al ulated using the dynami al fri tion pres ription in Springel et al. (2001)\nand we \u001cnd that the predi ted merger rate is in good agreement with observations Kho hfar & Burkert 2001. For more modeling details, we refer the\nreader to Kho hfar & Burkert 2005 and Kho hfar & Silk (2006a). Please note\nthat our simulation does not in lude AGN-feedba k (S hawinski et al. 2006)\nor environmental e\u001be ts (Kho hfar & Ostriker 2007) that have in\u001duen e on\nthe most massive galaxies. Throughout this paper, we use the following set\nof osmologi al parameters derived from a ombination of the 5-year WMAP\ndata with Type Ia supernovae and measurements of baryon a ousti os illations (Komatsu et al. 2008): Ω0 = 0.28, ΩΛ = 0.72, Ωb /Ω0 = 0.16, σ8 = 0.8\nand h = 0.7.\n2.1\n\nEvolution of the faint-end luminosity fun tion\n\nThe faint-end of the galaxy luminosity fun tion o\u001bers a strong onstraint on\nthe e\u001e ien y of galaxy formation within small mass dark matter halos. Cosmologi al N-body simulations predi t a power-law slope of α ∼ −2 at all\nredshift. Observations of the faint-end luminosity fun tion however, show a\nslope that is less steep and varies depending on the observed band and environment between α ∼ −0.9 to α ∼ −1.5 (Ryan et al. 2007). The widely\na epted explanation is that feedba k from supernovae is hindering star formation in low mass haloes. The rational behind this argument is that the\nspe i\u001c energy of hot gas is lower in low mass halos and therefor the amount\nof old gas reheated per supernovae is larger than in massive halos (Dekel &\nSilk 1986). The way that supernovae operate per solar mass stars formed is\nindependent of redshift onsidering the same stellar initial mass fun tion, thus\nit omes as a surprise that observations with the Hubble Spa e Teles ope a\nsteepening of the slope with redshift (Ryan et al. 2007).\nIn Fig. 1, we show the predi ted evolution of α(z) for our best-\u001ct lo al\nmodel, i.e. a model that is hosen to best \u001ct the lo al luminosity fun tion\n(Kho hfar et al. 2007). For onsisten y with the majority of observations, we\nal ulate the faint-end slope for the rest-frame FUV at z ≥ 4 and at lower\nredshifts for the rest-frame B -band. We indeed \u001cnd an evolution in α with\nredshift that is in fair agreement with the observed evolution.\nThe immediate question that arises is, what in\u001duen es and is the main\ndriver for the evolution in α? Generally, supernova feedba k is onsidered the\ndominant me hanism in shaping the faint-end of the luminosity fun tion Dekel\n& Silk 1986. The shaded region in Fig. 1 shows the range of linear \u001cts to\nα(z) that we \u001cnd by varying the star formation e\u001e ien y and the supernovae\nfeedba k e\u001e ien y. We infer only a very modest hange in α(z) for reasonable\nhoi es of feedba k e\u001e ien ies, and therefore on lude that another pro ess\n3\n\n\fFigure 1: Left \u001cgure: The slope α at di\u001berent redshifts as predi ted by the\nbest \u001ct lo al model. Filled symbols show results from the simulation and\nthe solid line is the best \u001ct to the simulation data. Errorbars indi ate 1 − σ\nerrors. The dashed lines show the \u001ct to the ompiled data in Ryan et al.\n(2007). The shaded region shows the range of linear \u001cts to α(z) that we \u001cnd\nwhen varying the star-formation and supernovae feedba k e\u001e ien y. Stars are\nthe ompilation from Ryan et al. (2007). Right \u001cgure top panel: Relation\nbetween UV luminosity and host dark matter halo mass for entral galaxies\nat z = 0 and z = 6. Bottom panel: Dark halo mass fun tion at the same\nredshifts.\nmust be responsible for the observed evolution in α(z).\nThe mass fun tion of dark matter halos is known to show a strong evolution with redshift. The galaxies ontributing to the luminosity fun tion\naround L∗ are mostly entral galaxies in their dark matter halos, i.e. the\nmost luminous galaxy within the halo (e.g. Kho hfar & Ostriker 2008). It\nis therefore not unreasonable to assume a onne tion between the evolution\nof α(z) and that of the dark matter mass fun tion. When onsidering the\nluminosity of entral galaxies residing in dark matter halos of the same mass\nat di\u001berent redshifts, we \u001cnd that at early times, entral galaxies are up to\nthree magnitudes brighter than their ounterparts in low redshift halos (see\nFig. 1 right upper panel). This is even the ase for halos hosting sub-L∗\ngalaxies. Similar results have been reported by (Kobayashi et al. 2007), who\nshowed that dwarf galaxies at early times are not a\u001be ted by supernova feedba k in their simulations be ause ooling times are very short in these halos\nand the energy inje ted by the supernovae is rapidly dissipated away. The\nslope in the region of dark matter halos that host sub-L∗ galaxies is steeper\nat high redshift, and onsequently so is α (Fig. 1 right lower panel). The\nsame is true for other hoi es supernovae feedba k and star formation e\u001eien y, thereby explaining why we do not \u001cnd any strong dependen e of α(z)\non these parameters.\n4\n\n\fFigure 2: Left \u001cgure: Observed and modeled size-evolution of early-type\ngalaxies of various masses. Right \u001cgure: Size-evolution as a fun tion of stellar\nmass. We \u001cnd that massive ellipti al galaxies show the strongest size-evolution\nwith up to a fa tor of ∼ 4 from z = 2 to z = 0.\n3\n\nSize-evolution of early-type galaxies\n\nVarious observational surveys have revealed that ellipti al galaxies are more\nompa t at high-z (Trujillo et al. 2006). A natural way to explain su h a\nbehavior is the ombination of dissipation during merger, whi h drives gas\nto the entre of the remnant and makes it more ompa t than in the ase of\nno dissipation (Cox et al. 2006, Kho hfar & Silk 2006b) and the ontinued\na retion of satellites that pu\u001b up the host galaxy (Naab et al. 2007, Kho hfar\n& Silk 2006b). We \u001cnd that in general the average gas fra tions in mergers\nin rease from 10% in massive mergers at z = 0 to up to 30% at z = 4. In\naddition to that we \u001cnd that massive galaxies have an order of magnitude more\nminor than major mergers. To estimate the size evolution we adopt a model\nin whi h the relative size of to remnants of the same mass is proportional the\nrelative amount of dissipation they en ountered during their merging history.\nIn this way a remnant of a gas-ri h merger is more ompa t than that of a\ngas poor merger and equally a remnant of many gas-poor satellite mergers is\nless ompa t than that of a major merger involving gas.\nIn Fig 2 we al ulate the size evolution for the same redshifts presented\nin Trujillo et al. (2006). The authors took the mean e\u001be tive radii of the\nln(Re ) distribution for galaxies above two mass thresholds of 3 × 1010 h−2\n70\nM⊙ and 6.6 × 1010 h−2\n70 M⊙ from the SDDS sample of early-type galaxies and\ndivided the e\u001be tive radii of early-type galaxies at higher redshifts by this\nvalue. After arranging their galaxies in various redshift bins they al ulated\nthe means of these ratios and presented these values. We here use the same\nmethod to ompare our results to theirs. For both ases of limiting masses,\nthe agreement is ex ellent. It appears that the di\u001beren e in sizes is more\nsigni\u001c ant for massive early type galaxies. In the right part of Fig 2 we predi t\n5\n\n\fthe size-evolution in four di\u001berent mass ranges based on the relative amount\nof their merger omponent. While lo al early-type galaxies between 1010 M⊙\nand 1011 M⊙ are around 1.25 times larger than their ounterparts at z = 2,\nlo al early types with masses larger than 5 × 1011 M⊙ will be approximately\n4 times larger than their ounterparts at z = 2. This dramati hange in\nsizes in our model results from massive galaxies at high redshifts forming in\ngas-ri h mergers while galaxies of the same mass at low redshifts form from\ndry major mergers (Kho hfar & Burkert 2003, Naab et al. 2006) and minor\nmergers with small total amounts of old gas. It is interesting to note that\nmodels with a hara teristi shut-o\u001b mass s ale for ooling of gas predi t dry\nmergers as the main me hanism to grow massive galaxies (Kho hfar & Silk\n2008a) and hen e imply a large size evolution.\n4\n\nCold a\n\nretion and turbulen e\n\nAs mentioned in the introdu tion, observations reveal a large population of\nmassive, high star forming disk galaxies with gas velo ity dispersion of the\norder 40 km/s (Genzel et al. 2006). One open question is how these velo ity\ndispersion an be driven. Possible explanations that have been put forward\nrange from gas-ri h galaxies mergers (Robertson & Bullo k 2008), tapping\ninto gravitational energy of the disk and supernovae feedba k (Bournaud &\nElmegreen 2009, Dekel et al. 2009) to the release of a retion energy by old\nstreams (Kho hfar & Silk 2008b). We here investigate latter assumption.\nNumeri al simulations by O virk et al. (2008) showed that the fra tion of\nold a reted gas that makes it way down to 0.2 Rvir as a fun tion of dark\nhalo mass is roughly onstant down to z = 2 and a strong de lining fun tion\nof halo mass. We model this behavior by enfor ing the simulation results onto\nthe gas ooling rates in our model. This way we make sure to be onsistent\nwith the simulation results. Furthermore, we assume that only old a reted\ngas is able to deposit a fra tion η of its kineti energy on e it hits the gala ti\ndisk, while hot gas that radiatively ools down does not ontribute. Assuming\nequilibrium between the ontributions from a retion and dissipation in the\ndisk leads to a simpli\u001ced expression for the gas velo ity dispersion as\nσg =\n\ns\n\n√ Ṁacc\ntdyn Vvir\nη 2\nMgas\n\n(1)\n\nwith Ṁacc the old a retion rate. We here assumed that the energy dissipation time s ale in the gala ti disk is proportional to the lo al dynami al\ntime, and that the ontribution to turbulen e in the inter-stellar-medium from\nsupernovae is negligible ompared to the ontribution from a retion, whi h\nis the ase for high a retion rates that are found at z ≥ 2. In the left of Fig 3.\nwe show the predi ted orrelation between the ratio of disk rotational velo ity and gas velo ity V /σ and disk rotation V from Kho hfar & Silk (2008b).\nOverlaid are various observations at high redshift showing good agreement\n6\n\n\fbetween a model in whi h eta = 0.2. This result indi ates, that only a small\nfra tion is a tually ne essary to drive su\u001e iently high turbulen e. The strong\nin line of V /σ as a fun tion of V is a dire t onsequen e of the smaller old\na retion fra tion in massive halos, thus this model suggest that the fun tional\nform of the old a retion fra tion at high z dire tly relates to a orrelation\nof V /σ and V .\n\nFigure 3: The relation between V /σ and V for modeled galaxies (small \u001clled\nir les). The observations are from Genzel et al. (2006) (large \u001clled ir le),\nGenzel et al. (2008) (\u001clled stars), Stark et al. (2008) (\u001clled triangle) and\nCres i (2008, ApJ submitted) (\u001clled squares). We here assume that 18%\nof the a retion energy from old \u001dows is used to drive turbulen e in the\ndisk. Note that mergers are ex luded as well as satellite galaxies that by\nonstru tion do not a rete old gas anymore.\n\n5\n\nDis ussion\n\nIn this paper we presented results on the formation of galaxies and their\nproperties at high redshift. We investigated the origin of the evolution of the\nfaint-end luminosity fun tion, \u001cnding that in our model it is mainly driven\nby the evolution of the underlying the dark matter mass fun tion. Low mass\ngalaxies at high z o upy a range in dark matter halos that lies on a mu h\nsteeper part of the dark matter mass fun tion than their ounterparts at low\nredshifts. This is the main reason for an evolution in the model faint-end slope.\n7\n\n\fSupernovae feedba k on the other hand does not introdu e an evolving faintend slope, though it will hange the slope to be ome shallower at the roughly\nsame rate at all redshifts. An interesting possibility in this respe t is the\nhoi e of IMF. In the ase of a top-heavy IMF one would expe t more feedba k\nontribution. It has been argued, that the dis repan y between observed star\nformation rates and integrated stellar mass density in the universe an be\nredu ed by applying a top-heavy IMF at z ≥ 2. Our simulations however,\nshow that an in rease or de rease by a fa tor of few will not hange the general\ntrend of the faint-end slope with redshift, thus not drawing support to the\nnotion of an IMF hange at high z.\nWe ontinued by fo using on the role that the available fuel for star formation plays. We showed that the formation of galaxies is more e\u001e ient at\nhigh redshifts, whi h is a dire t result of the fast a retion of old gas at high\nz. The a retion of old gas at high z parallels that of the dark matter, and\nhen e is mu h faster than at low redshift, resulting in high star formation\nrates that an be sustained to build up su\u001e ient massive galaxies.\nFurther onsequen es of high gas fra tions in galaxies at early times are\ngalaxy mergers with large fra tion of dissipation. Su h mergers have shown to\nbe result in very ompa t remnants. We applied a simpli\u001ced model that s ales\nthe sizes of remnants with the amount of available fuel during their merger\nhistory. Su h a model proves to be able to reprodu e observed size-evolutions\nof early-type galaxies very well. We \u001cnd the strongest size-evolution for the\nmost massive galaxies > 5 × 1011 M⊙ , making a fa tor of 4 evolution in\ntheir sizes from z = 2 to z = 0. The main ause for this strong trend is\nthe o urren e of very gas ri h mergers at high z while the lo al ounterparts\nformed rather re ent from dry mergers and a large fra tion of satellite galaxies\nthat help to further pu\u001b up the host galaxy.\nThe main mode of a retion at high redshifts is by old \u001dows of material\noming into the halo along with the dark matter halos. In the ase of M∗ halos\nat high z these old a retion \u001dows rea h the host halo along osmi \u001claments\nand go straight down to the entre of the halo, where they an feed the main\ngalaxy on a dynami al time. By the time the old a retion \u001dows rea h the\nmain galaxy they will have a quired a substantial amount of kineti energy\nthat will have to be dispersed. Some if it will be radiated away and some\nof it will go into rotational energy of the newly arrived material. Another\npossible option is that some fra tion of this energy is used to drive turbulen e\nin the gaseous disk. Observations show that indeed high-z disks tend to have\nhigher gas velo ity dispersions than lo al disks. Using results from numerial simulations on the fra tion of old a reted material as fun tion of halo\nmass one \u001cnds that only 20% of the a retion energy of old \u001dows is a tually\nneeded to drive turbulen e at the level that it is observed over a wide range\nof galaxy masses and rotational velo ities of disks at high-z. Interestingly one\nan re over the steep orrelation between V /σ and V by just invoking energy\nequilibrium between a retion energy and energy dissipation in the disk, and\nthe fun tional dependen e of the fra tion of old a retion as a fun tion of\nhalo mass. It will be interesting now to see how the fra tion of old a retion\n8\n\n\fwill re\u001de t on V /σ for massive galaxies at low z.\nWe here presented a number of model results on galaxy properties at high\nredshift, that relied on the faster assembly of stru ture, in parti ular the\na retion of old gas onto galaxies. Coming observations will reveal further\ndetails of the galaxy population at high redshift, that will ertainly require\nmore detailed modeling and will allow to test urrent models.\nReferen es\n\nBinney, J. 1977, ApJ, 215, 483\nBournaud, F. & Elmegreen, B. G. 2009, arXiv0902.2806B\nNaab, T., Johansson, P. H., Ostriker, J. P., & Efstathiou, G. 2007, ApJ, 658, 710\nDekel, A., & Silk, J. 1986, ApJ, 303, 39\nDekel, A., & Birnboim, Y. 2006, MNRAS, 368, 2\nDekel, A. et al. 2009, arXiv0901.2458D\nFörster S hreiber, N. M., et al. 2006, ApJ, 645, 1062\nGenzel, R., et al. 2006, Nature, 442, 786\nGenzel, R., et al. 2008, ApJ, 687, 59\nHasinger, G., Miya ji, T., & S hmidt, M. 2005, A&A, 441, 417\nHopkins, A. M. 2004, ApJ, 615, 209\nJuneau, S., et al. 2005, ApJ, 619, L135\nKeres, D., Katz, N., Weinberg, D. H., & Davé, R. 2005, MNRAS, 363, 2\nKho hfar, S., & Burkert, A. 2001, ApJ, 561, 517\nKho hfar, S. & Burkert, A. 2003, ApJL, 597, L117\nKho hfar, S., & Burkert, A. 2005, MNRAS, 359, 1379\nKho hfar, S., & Silk, J. 2006a, MNRAS, 370, 902\nKho hfar, S., & Silk, J. 2006b, ApJL, 648, L21\nKho hfar, S., Silk, J., Windhorst, R. A., & Ryan, R. E., Jr. 2007, ApJL, 668, L115\nKho hfar, S., & Ostriker, J. P. 2008, ApJ, 680, 54\nKho hfar, S., & Silk, J. 2008a, arXiv0809.1734K (MNRAS submitted)\nKho hfar, S., & Silk, J. 2008b, arXiv0812.1183K (ApJL submitted)\nKobayashi, C., Springel, V., & White, S. D. M. 2007, MNRAS, 376, 1465\nKomatsu, E., et al. 2008, arXiv:0803.0547\nLe Fèvre O., et al. 2000, MNRAS, 311, 565\nNaab, T., Kho hfar, S., & Burkert, A. 2006, ApJ, 636, L81\nNoeske, K. G., et al. 2007, ApJ, 660, L43\nO virk, P., Pi hon, C., & Teyssier, R. 2008, MNRAS, 390, 1326\nPérez-González, P. G. et al. 2008, ApJ, 675, 234\n\n9\n\n\fRobertson, B. E. & Bullo k, J. S. 2008, ApJ, 685, 27\nRees, M. J., & Ostriker, J. P. 1977, MNRAS, 179, 541\nRyan, R. E., Jr. et al. 2007, ApJ, 668, 839\nS hawinski et al. 2006, Nature, 442, 888\nStark, D. P., Swinbank, A. M., Ellis, R. S., Dye, S., Smail, I. R., & Ri hard, J. 2008,\nNature, 455, 775\nSomerville, R. S., & Kolatt, T. S. 1999, MNRAS, 305, 1\nSomerville, R. S. 2002, ApJL, 572, L23\nSpringel, V., White, S. D. M., Tormen, G., & Kau\u001bmann, G. 2001, MNRAS, 328,\n726\nThomas, D., Maraston, C., Bender, R., & Mendes de Oliveira, C. 2005, ApJ, 621,\n673\nTrujillo, I. et al. 2006, ApJ 650, 18\nSilk, J. 1977, ApJ, 211, 638\nSmith, H. D., Miller, P. 1999, A&A 355, 123\nyour next referen e\n\n10\n\n\f"}