{"id": "http://arxiv.org/abs/1204.0100v1", "guidislink": true, "updated": "2012-03-31T13:38:35Z", "updated_parsed": [2012, 3, 31, 13, 38, 35, 5, 91, 0], "published": "2012-03-31T13:38:35Z", "published_parsed": [2012, 3, 31, 13, 38, 35, 5, 91, 0], "title": "Roles of Ties in Spreading", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1204.2409%2C1204.4934%2C1204.3805%2C1204.6684%2C1204.1884%2C1204.1008%2C1204.2559%2C1204.0072%2C1204.3383%2C1204.2605%2C1204.6494%2C1204.4415%2C1204.4921%2C1204.0293%2C1204.0810%2C1204.5976%2C1204.4842%2C1204.6197%2C1204.3171%2C1204.2374%2C1204.1371%2C1204.6187%2C1204.5437%2C1204.3790%2C1204.0891%2C1204.6386%2C1204.1319%2C1204.6144%2C1204.1027%2C1204.5625%2C1204.0021%2C1204.3559%2C1204.6658%2C1204.1084%2C1204.0100%2C1204.3665%2C1204.4270%2C1204.5102%2C1204.2106%2C1204.0687%2C1204.5613%2C1204.2213%2C1204.4752%2C1204.6434%2C1204.3333%2C1204.4446%2C1204.3384%2C1204.4715%2C1204.3473%2C1204.2346%2C1204.3101%2C1204.1711%2C1204.0280%2C1204.4470%2C1204.5647%2C1204.2742%2C1204.3141%2C1204.5028%2C1204.6108%2C1204.0511%2C1204.6650%2C1204.5095%2C1204.3139%2C1204.4228%2C1204.0930%2C1204.1546%2C1204.3215%2C1204.3250%2C1204.6039%2C1204.3294%2C1204.0162%2C1204.0217%2C1204.4144%2C1204.5020%2C1204.6521%2C1204.0997%2C1204.0753%2C1204.1294%2C1204.3541%2C1204.1891%2C1204.3930%2C1204.1396%2C1204.0453%2C1204.2171%2C1204.2906%2C1204.2137%2C1204.5446%2C1204.0298%2C1204.1645%2C1204.3519%2C1204.0026%2C1204.3163%2C1204.1822%2C1204.2686%2C1204.1325%2C1204.6499%2C1204.5668%2C1204.5147%2C1204.1455%2C1204.5203%2C1204.6025&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Roles of Ties in Spreading"}, "summary": "Background: Controlling global epidemics in the real world and accelerating\ninformation propagation in the artificial world are of great significance,\nwhich have activated an upsurge in the studies on networked spreading dynamics.\nLots of efforts have been made to understand the impacts of macroscopic\nstatistics (e.g., degree distribution and average distance) and mesoscopic\nstructures (e.g., communities and rich clubs) on spreading processes while the\nmicroscopic elements are less concerned. In particular, roles of ties are not\nyet clear to the academic community.\n  Methodology/Principle Findings: Every edges is stamped by its strength that\nis defined solely based on the local topology. According to a weighted\nsusceptible-infected-susceptible model, the steady-state infected density and\nspreading speed are respectively optimized by adjusting the relationship\nbetween edge's strength and spreading ability. Experiments on six real networks\nshow that the infected density is increased when strong ties are favored in the\nspreading, while the speed is enhanced when weak ties are favored. Significance\nof these findings is further demonstrated by comparing with a null model.\n  Conclusions/Significance: Experimental results indicate that strong and weak\nties play distinguishable roles in spreading dynamics: the former enlarge the\ninfected density while the latter fasten the process. The proposed method\nprovides a quantitative way to reveal the qualitatively different roles of\nties, which could find applications in analyzing many networked dynamical\nprocesses with multiple performance indices, such as synchronizability and\nconverging time in synchronization and throughput and delivering time in\ntransportation.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1204.2409%2C1204.4934%2C1204.3805%2C1204.6684%2C1204.1884%2C1204.1008%2C1204.2559%2C1204.0072%2C1204.3383%2C1204.2605%2C1204.6494%2C1204.4415%2C1204.4921%2C1204.0293%2C1204.0810%2C1204.5976%2C1204.4842%2C1204.6197%2C1204.3171%2C1204.2374%2C1204.1371%2C1204.6187%2C1204.5437%2C1204.3790%2C1204.0891%2C1204.6386%2C1204.1319%2C1204.6144%2C1204.1027%2C1204.5625%2C1204.0021%2C1204.3559%2C1204.6658%2C1204.1084%2C1204.0100%2C1204.3665%2C1204.4270%2C1204.5102%2C1204.2106%2C1204.0687%2C1204.5613%2C1204.2213%2C1204.4752%2C1204.6434%2C1204.3333%2C1204.4446%2C1204.3384%2C1204.4715%2C1204.3473%2C1204.2346%2C1204.3101%2C1204.1711%2C1204.0280%2C1204.4470%2C1204.5647%2C1204.2742%2C1204.3141%2C1204.5028%2C1204.6108%2C1204.0511%2C1204.6650%2C1204.5095%2C1204.3139%2C1204.4228%2C1204.0930%2C1204.1546%2C1204.3215%2C1204.3250%2C1204.6039%2C1204.3294%2C1204.0162%2C1204.0217%2C1204.4144%2C1204.5020%2C1204.6521%2C1204.0997%2C1204.0753%2C1204.1294%2C1204.3541%2C1204.1891%2C1204.3930%2C1204.1396%2C1204.0453%2C1204.2171%2C1204.2906%2C1204.2137%2C1204.5446%2C1204.0298%2C1204.1645%2C1204.3519%2C1204.0026%2C1204.3163%2C1204.1822%2C1204.2686%2C1204.1325%2C1204.6499%2C1204.5668%2C1204.5147%2C1204.1455%2C1204.5203%2C1204.6025&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Background: Controlling global epidemics in the real world and accelerating\ninformation propagation in the artificial world are of great significance,\nwhich have activated an upsurge in the studies on networked spreading dynamics.\nLots of efforts have been made to understand the impacts of macroscopic\nstatistics (e.g., degree distribution and average distance) and mesoscopic\nstructures (e.g., communities and rich clubs) on spreading processes while the\nmicroscopic elements are less concerned. In particular, roles of ties are not\nyet clear to the academic community.\n  Methodology/Principle Findings: Every edges is stamped by its strength that\nis defined solely based on the local topology. According to a weighted\nsusceptible-infected-susceptible model, the steady-state infected density and\nspreading speed are respectively optimized by adjusting the relationship\nbetween edge's strength and spreading ability. Experiments on six real networks\nshow that the infected density is increased when strong ties are favored in the\nspreading, while the speed is enhanced when weak ties are favored. Significance\nof these findings is further demonstrated by comparing with a null model.\n  Conclusions/Significance: Experimental results indicate that strong and weak\nties play distinguishable roles in spreading dynamics: the former enlarge the\ninfected density while the latter fasten the process. The proposed method\nprovides a quantitative way to reveal the qualitatively different roles of\nties, which could find applications in analyzing many networked dynamical\nprocesses with multiple performance indices, such as synchronizability and\nconverging time in synchronization and throughput and delivering time in\ntransportation."}, "authors": ["Ai-Xiang Cui", "Zimo Yang", "Tao Zhou"], "author_detail": {"name": "Tao Zhou"}, "author": "Tao Zhou", "arxiv_comment": "8 pages, 4 figures, 1 table", "links": [{"href": "http://arxiv.org/abs/1204.0100v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1204.0100v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "physics.soc-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "physics.soc-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "cs.SI", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1204.0100v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1204.0100v1", "journal_reference": null, "doi": null, "fulltext": "1\n\narXiv:1204.0100v1 [physics.soc-ph] 31 Mar 2012\n\nRoles of Ties in Spreading\nAi-Xiang Cui, Zimo Yang, Tao Zhou∗\nWeb Sciences Center, University of Electronic Science and Technology of China, Chengdu 610054,\nPeople's Republic of China\n∗ E-mail: zhutou@ustc.edu\n\nAbstract\nBackground : Controlling global epidemics in the real world and accelerating information propagation in\nthe artificial world are of great significance, which have activated an upsurge in the studies on networked\nspreading dynamics. Lots of efforts have been made to understand the impacts of macroscopic statistics\n(e.g., degree distribution and average distance) and mesoscopic structures (e.g., communities and rich\nclubs) on spreading processes while the microscopic elements are less concerned. In particular, roles of\nties are not yet clear to the academic community.\nMethodology/Principle Findings: Every edges is stamped by its strength that is defined solely based\non the local topology. According to a weighted susceptible-infected-susceptible model, the steady-state\ninfected density and spreading speed are respectively optimized by adjusting the relationship between\nedge's strength and spreading ability. Experiments on six real networks show that the infected density is\nincreased when strong ties are favored in the spreading, while the speed is enhanced when weak ties are\nfavored. Significance of these findings is further demonstrated by comparing with a null model.\nConclusions/Significance: Experimental results indicate that strong and weak ties play distinguishable\nroles in spreading dynamics: the former enlarge the infected density while the latter fasten the process.\nThe proposed method provides a quantitative way to reveal the qualitatively different roles of ties, which\ncould find applications in analyzing many networked dynamical processes with multiple performance\nindices, such as synchronizability and converging time in synchronization and throughput and delivering\ntime in transportation.\n\nIntroduction\nEarly before the classification of social ties proposed, in 1954, the Russian mathematical psychologist\nAnatol Rapoport [1] has been aware of \"well-known fact that the likely contacts of two individuals who\nare closely acquainted tend to be more overlapping than those of two arbitrarily selected individuals.\"\nThis argument became one of the cornerstones of social network theory. In 1973, ties in social networks,\ngenerally, come in two varieties: strong and weak, which has been first proposed by the American\nsociologist Mark Granovetter in Ref. [2], one of the most influential sociology papers ever published.\nDifferent relationships can be measured in the currency of tie strength. According to the closeness,\nconnections to close friends have been said to be \"strong\" ties, while those to acquaintances have been\ncalled \"weak\" ties [2–6]. Tie strength usually plays an vital role in many real networks and is crucial\nto understand dynamical processes on the networks [6–8]. Strong ties are the people you really trust,\npeople whose social circles tightly overlap with your own. Often, they are also the people most like you.\nWeak ties, conversely, are merely acquaintances and often provide access to novel information [6]. Weak\nties display an important bridging function [7], while strong ties are more likely to activated for the flow\nof referral information and more influential than weak ties [8]. In addition, weak ties could play a more\nsignificant role than strong ties to keep the stability [9], maintain the connectivity [10] and uncover the\nmissing information [11].\nIn despite of the qualitative distinction between strong and weak ties, the tie strength could be\nquantitatively described by edge weight-the edges with high weights are considered to be strong. In a\nnumber of social networks, edges are often associated with weights that differentiate them in terms of their\n\n\f2\nstrength, intensity, capacity or the frequency of recent contacts [2, 12]. For non-social networks, weights\noften refer to the functions performed by edges, e.g., the amount of traffic flowing along connections in\nworld-wide airport networks [12], the number of joint papers of two coauthors in scientist collaboration\nnetworks [12], the number of synapses and gap junctions in neural networks [13], the carbon flow between\nspecies in food webs [14]. Yan et al. [15] investigated the epidemic spreading in weighted scale-free\nnetworks and the simulation results indicated that the more homogeneous weight distribution of the\nnetwork, the more quickly epidemic spreads on it. This finding was further demonstrated by an edgebased mean-field solution [16]. Chu et al. [17] showed that the weight distribution has strong impacts\non both epidemic threshold and prevalence. Baronchelli and Pastor-Satorras [18] considered the diffusive\ndynamics on weighted networks and shed light on the validity of mean-field theory on weighted networks.\nThese studies revealed quantitative impacts of edges with different weights, but ignored the qualitatively\ndifferent roles respectively played by strong and weak ties.\nIn this paper, we propose a quantitative method to uncover the qualitatively different roles of strong\nand weak ties via a weighted susceptible-infected-susceptible (SIS) model. Experimental results on six\nreal networks emphasize the different roles of strong and weak ties: the former improve the steady-state\nfraction of infected nodes while the latter fasten the spreading speed.\n\nResults\nModel\nThe SIS model [19] is suitable to describe the cases when the individuals cannot acquire immunity after\nrecovering from the disease, such as influenza, pulmonary tuberculosis and gonorrhea. With disease of this\nkind individuals that are cured usually catch again. In the networked SIS model, nodes are in two discrete\nstates, \"susceptible\" or \"infected\". Each infected node will contact all its neighbors once at each time\nstep, and therefore the infectivity of each node is proportional to its degree. In the real world, individuals\nmay be only able to contact limited population within one time step [20]. For example, salesman in\nnetwork marketing processes will not make referrals to all his acquaintances due to the limited money\nand time [21]. In sexual contact networks, although a few individuals have hundreds of sexual partners,\ntheir sexual activities are not far beyond a normal level due to the physiological limitations [22, 23].\nTherefore, in the present model we assume every individual has the same infectivity [20,24]. Without the\nlose of generality, at each time step, each infected node will select one of its neighbors to contact. If the\nselected neighbor has been infected already, nothing happens, while if it is susceptible, with probability\nα, it will be infected. Meanwhile, each infected node will become susceptible in the next time step with\nprobability β. The probability an infected node i will select its neighbor j is\npij = P\n\nsbij\nl∈Γi\n\nsbil\n\n,\n\n(1)\n\nwhere Γi is the neighbor set of node i, sij denotes the tie strength between i and j, and b is a tunable\nparameter. If b = 0, the infected node randomly selects a neighbor to contact. If b > 0, strong ties are\nfavored to constitute the paths of spreading, while if b < 0, weak ties are favored.\nIn different contexts, the strength of a tie may have different definitions and measures [25, 26], which\nmay depend on external information to network topology. For general networks, one may be not aware\nof external information and thus it is meaningful to give a natural definition solely based on network\ntopology. According to Rapoport's theory [1] and other supportive observations [27–29] and models\n[30, 31], we define the tie strength sij in spite of i and j's common neighbors, as follows:\nnij + δ\n,\nsij = p\nki kj\n\n(2)\n\n\f3\nwhere nij is the number of common neighbors of i and j, ki is the degree of i, and δ is a constant that\ngives chance to the tie connecting two nodes without common neighbors. For simplicity, we set δ = 1.\nThe dynamical process starts with randomly selecting a certain number of infected nodes.\n\nData\nTo see the impacts of tie strength on the spreading dynamics, experiments are carried out on six real\nnetworks: (1) Facebook-like Social Network (FSN) [32]: it originates from an online community for\nstudents at University of California. The dataset includes the users that have sent or received at least\none message, and an undirected edge is set between i and j if i has sent (received) an online message to\n(from) j. (2) Enron Email Network (EEN) [33, 34]: it covers about half million emails. Nodes of this\nnetwork are email addresses and if an address i sent at least one email to address j, an undirected edge is\nestablished between i and j. (3) Slashdot Social Network (SSN) [35]: nodes in this network are the users\nin Slashdot, which is a technology-related news website, and edges represent friendships between users.\n(4) Epinions Social Network (ESN) [36]: this is a who-trust-whom online social network. Nodes are the\nmembers of the general consumer review site Epinions.com, and edges represent the trust relationships\nbetween two members. (5) Gnutella Peer-to-peer Network (GPN) [37]: Nodes represent hosts and edges\nstand for connections between the hosts. (6) Oregon Autonomous Systems (OAS) [38]: this is an AS-level\nInternet topology graph obtained by the Route Views Project. In order to guarantee the connectivity,\nwe use the largest connected components of these networks. Table 1 presents the basic statistics of the\nlargest connected components of the six networks.\n\nResults and Analysis\nAll simulations start with 20 randomly selected nodes as infected sources, with infectivity rate α = 0.4 and\nrecovery rate β = 0.1. Figure 1 gives us intuition of the spreading processes following the proposed model,\nin which one can obverse the number of infected nodes, I(t), changing with time, t, and considerable\neffects made by b. We next investigate b's impacts on two macroscopic features of the spreading process-\nthe prevalence and speed. The first one is characterized by the fraction of infected nodes in the steady\nstate, ρ = I(∞)/N . For the second one, if we define ∆I(t) := I(∞) − I(t), it converges to zero following\nan exponential form (it is easy to be checked numerically and thus not shown here), ∆I(t) ∝ e−λt , and\nthe parameter λ is an informative index for the converging speed. The larger ρ the wider the spreading,\nand the larger λ the faster the spreading.\nFigure 2 displays how the steady-state infection density ρ and the speed index λ change with b based\non the six real networks. For each case, there are well-defined peaks for both ρ(b) and λ(b). More\ninterestingly, in every case, all the \"optimal\" values of b subject to high prevalence are larger than zero,\nwhile all the \"optimal\" values of b subject to high speed are smaller than zero. These phenomena indicate\nthe different roles of strong and weak ties: the former operate locally and keep a high prevalence in local\nsurrounding while the latter bridge different densely connected groups and enhance the chance to infect\nhealthy groups. As an imprecise metaphor to global epidemic spreading, the strong ties are similar to\nthe urban buses and gathering places while the weak ties are similar to the intercity trains and airlines.\nTo emphasize the significance of our findings, we further consider the null model, where strengths are\ncompletely redistributed. This randomization operation destroys the correlation between structure and\nstrength. Figure 3 reports ρ(b) for real networks and the corresponding randomized networks. Different\nfrom the positive peaks for real networks, all peaks for randomized networks are at b = 0. Figure 4 shows\nλ(b) for real networks and the corresponding randomized networks, again, peaks for randomized networks\nare all at b = 0. The results are in accordance with the known conclusion [16] that in the absence of\ncorrelation between structure and weight, the most homogeneous weight distribution leads to the widest\nand fastest epidemic spreading. Comparison between results from real and randomized cases suggests\nthat the non-zero \"optimal\" values of the parameter b do reveal some significant features of reality.\n\n\f4\n\nDiscussion\nWe studied a weighted SIS model where an edge's weight is functionally dependent on its strength.\nMotivated by the transitivity in social network analysis [39] and the Rapoport's theory [1], we apply a\ncommon-neighborhood-based similarity index to quantify edge strength. By comparing the experimental\nresults on six real networks and their counterpart randomized networks, we show that strong and weak\nties play distinguishable roles in spreading dynamics: the former enlarge the infected density while the\nlatter fasten the process.\nNote that, the optimal values of b subject to the infected density and spreading speed are far different,\nindicating that the \"optimization\" of an spreading process could have multiple performance indices and\nthese indices may conflict to each other. Analogous examples are numerous: bypassing main intersections\nand arterial roads could enhance the network throughput while increase the delivering time especially\nin uncongested states [40], and removing directed loops could enhance the synchronizability while slow\ndown the synchronizing process [41]. Our method provides a quantitative way to reveal the qualitatively\ndifferent roles of ties (also can be extended to deal with nodes) in such dynamical processes.\nWe hope this work could contribute to the long journey towards fully understanding the relations\nbetween structural features and functional performances. Along this way, more experiments on disparate\nnetworks will benefit us, and we will look into benchmark network models to see whether some structural\nproperties, such as the presence of degree-degree correlation and community structure, are responsible\nfor the observations reported here.\n\nAcknowledgments\nWe acknowledge Pak-Ming Hui for valuable discussions. This work is partially supported by the National\nNatural Science Foundation of China under grant number 90924011, and the Fundamental Research\nFunds for the Central Universities.\n\nReferences\n1. Rapoport A (1954) Spread of information through a population with socio-structural bias: Iii.\nsuggested experimental procedures. Bull Math Biol 16: 75–81.\n2. Granovetter MS (1973) The strength of weak ties. Am J Sociology : 1360–1380.\n3. Granovetter MS (1995) Getting a job: A study of contacts and careers. The University of Chicago\nPress.\n4. Erickson BH, Nosanchuk TA, Mostacci L, Dalrymple CF (1978) The flow of crisis information as\na probe of work relations. Canadian Journal of Sociology 3: 71–87.\n5. Lin N, Dumin M (1986) Access to occupations through social ties. Social Networks 8: 365–385.\n6. Shi X, Adamic LA, Strauss MJ (2007) Networks of strong ties. Physica A 378: 33–47.\n7. Zhao JC, Wu JJ, Xu K (2010) Weak ties: Subtle role of information diffusion in online social\nnetworks. Phys Rev E 82: 016105.\n8. Brown JJ, Reingen PH (1987) Social ties and word-of-mouth referral behavior. J Consumer Res\n14: 350–362.\n9. Csermely P (2006) Weak links: Stabilizers of complex systems from proteins to social networks.\nSpringer-Verlag.\n\n\f5\n10. Onnela JP, Saramäki J, Hyvönen J, Szabó G, Lazer D, et al. (2007) Structure and tie strengths in\nmobile communication networks. Proc Nat Acad Sci USA 104: 7332-7336.\n11. Lü L, Zhou T (2010) Link prediction in weighted networks: The role of weak ties. EPL 89: 18001.\n12. Barrat A, Barthelemy M, Pastor-Satorras R, Vespignani A (2004) The architecture of complex\nweighted networks. Proc Natl Acad Sci USA 101: 3747–3752.\n13. Rojas R (1996) Neural networks: a systematic introduction. Springer-Verlag.\n14. Nordlund C (2007) Identifying regular blocks in valued networks: A heuristic applied to the st.\nmarks carbon flow data, and international trade in cereal products. Social Networks 29: 59–69.\n15. Yan G, Zhou T, Wang J, Fu ZQ, Wang BH (2005) Epidemic spread in weighted scale-free networks.\nChin Phys Lett 22: 510–513.\n16. Yang Z, Zhou T (2011) Epidemic Spreading in Weighted Networks: An Edge-Based Mean-Field\nSolution. arXiv:1112.5683.\n17. Chu XW, Zhang ZZ, Guan JH, Zhou SG (2011) Epidemic spreading with nonlinear infectivity in\nweighted scale-free networks. Physica A: Statistical Mechanics and its Applications 390: 471–481.\n18. Baronchelli A, Pastor-Satorras R (2010) Mean-field diffusive dynamics on weighted networks. Phys\nRev E 82: 011111.\n19. Baily NTJ (1975) The mathematical theory of infectious diseases. Griffin .\n20. Zhou T, Liu JG, Bai WJ, Chen GR, Wang BH (2006) Behaviors of susceptible-infected epidemics\non scale-free networks with identical infectivity. Phys Rev E 74: 056109.\n21. Kim BJ, Jun T, Kim JY, Choi MY (2006) Network marketing on a small-world network. Physica\nA 360: 493–504.\n22. Liljeros F, Edling CR, Amaral LAN (2003) Sexual networks: implications for the transmission of\nsexually transmitted infections. Microbes and Infection 5: 189–196.\n23. Schneeberger A, Mercer CH, Gregson SAJ, Ferguson NM, Nyamukapa CA, et al. (2004) Scale-free\nnetworks and sexually transmitted diseases: a description of observed patterns of sexual contacts\nin britain and zimbabwe. Sexually Transmitted Diseases 31: 380–387.\n24. Yang R, Wang BH, Ren J, Bai WJ, Shi ZW, et al. (2007) Epidemic spreading on heterogeneous\nnetworks with identical infectivity. Phys Lett A 364: 189–193.\n25. Marsden PV, Campbell KE (1984) Measuring tie strength. Social Forces 63: 482–501.\n26. Lü L, Zhou T (2011) Link prediction in complex networks: A survey. Physica A 390: 1150–1170.\n27. Kossinets G, Watts DJ (2006) Empirical analysis of an evolving social network. Science 311: 88–90.\n28. Liben-Nowell D, Kleinberg J (2007) The link-prediction problem for social networks. J Am Soc Inf\nSci Technol 58: 1019–1031.\n29. Zhou T, Lü L, Zhang YC (2009) Predicting missing links via local information. Eur Phys J B 71:\n623–630.\n30. Holme P, Kim BJ (2002) Growing scale-free networks with tunable clustering. Phys Rev E 65:\n026107.\n\n\f6\n31. Cui AX, Fu Y, Shang MS, Chen DB, Zhou T (2011) Emergence of local structures in complex\nnetwork: common neighborhood drives the network evolution. Acta Physica Sinica 60: 038901.\n32. Opsahl T, Panzarasa P (2009) Clustering in weighted networks. Social Networks 31: 155–163.\n33. Leskovec J, Lang KJ, Dasgupta A, Mahoney MW (2009) Community structure in large networks:\nNatural cluster sizes and the absence of large well-defined clusters. Internet Math 6: 29–123.\n34. Klimt B, Yang Y (2004) Introducing the enron corpus. In: Proc. First Conference on Email and\nAnti-Spam.\n35. Leskovec J, Huttenlocher D, Kleinberg J (2010) Signed networks in social media. In: Proc. 28th\nInt. Conf. Human Factors Comput. Syst. ACM, pp. 1361–1370.\n36. Richardson M, Agrawal R, Domingos P (2003) Trust management for the semantic web. The\nSemantic Web-ISWC 2003 : 351–368.\n37. Ripeanu M, Foster I, Iamnitchi A (2002) Mapping the gnutella network: Properties of large-scale\npeer-to-peer systems and implications for system design. IEEE Internet Comput J 6: 50–57.\n38. Leskovec J, Kleinberg J, Faloutsos C (2005) Graphs over time: densification laws, shrinking diameters and possible explanations. In: Proc. 11th ACM SIGKDD Int. Conf. Knowl. Dis. Data Mining.\nACM, pp. 177–187.\n39. Wassermann S, Faust K (1994) Social network analysis: Methods and applications. Cambridge\nUniversity Press.\n40. Yan G, Zhou T, Hu B, Fu ZQ, Wang BH (2006) Efficient routing on complex networks. Phys Rev\nE 73: 046108.\n41. Zhou T, Zhao M, Zhou CS (2010) Synchronization on effective networks. New J Phys 12: 043030.\n\nFigure Legends\nFig.1 Spreading processes for different values of the parameter b.\nFig.2 Steady-state infected density ρ and speed index λ for different b.\nFig.3 Comparing ρ(b) between real and randomized networks.\nFig.4 Comparing λ(b) between real and randomized networks.\n\nTables\nTable 1. Basic characteristics of the largest connected components, where N and E\nrepresent the number of nodes and edges, respectively.\nDataset\nN\nE\n\nFSN\n1,893\n13,835\n\nEEN\n33,696\n180,811\n\nSSN\n74,444\n382,456\n\nESN\n75,868\n405,729\n\nGPN\n8,842\n31,837\n\nOAS\n10,670\n22,002\n\n\f7\n800\n\n(a)\n\nI(t)\n\n600\n200\n0\n\n(b)\n\nI(t)\n\n400\n\n10000\n8000\n6000\n4000\n2000\n0\n\n0\n\n50\n\n100\n\nb=-2\n\nb=-1\n\nb=0\n\nb=1\n\n150\n\n200\n\nb=2\n\n250\n\n300\n\n0\n\n100\n\n200\n\nt\n\n20000\n\n(c)\n\nI(t)\n\n10000\n5000\n\n0\n\n50\n\n100\n\n150\n\n200\n\n250\n\n0\n\n300\n\n0\n\n100\n\n200\n\n300\n\n400\n\n100\n\n200\n\n300\n\n400\n\nt\n\nI(t)\n\nt\n\n2000\n\n(e)\n\nI(t)\n\n5000\n4000\n3000\n2000\n1000\n0\n\n400\n\n(d)\n\n15000\n\nI(t)\n\n30000\n25000\n20000\n15000\n10000\n5000\n0\n\n300\n\nt\n\n(f)\n\n1500\n1000\n500\n\n0\n\n50\n\n100\n\n150\n\n0\n\n200\n\n0\n\nt\n\nt\n\nFigure 1. Spreading processes for different values of the parameter b. These six plots show\nhow the number of infected individuals, I(t), changes with time on the six real networks: (a)\nFacebook-like social network, (b) Enron email network, (c) Slashdot social network, (d) Epinions social\nnetwork, (e) Gnutells peer-to-peer network, (f) Oregon autonomous systems. Results are obtained by\naveraging over 1000 independent realizations.\n0.4\n\n(t)\n\n(a)\n\n0.3\n\n0.06\n\n0.04\n0.03\n\n0.2\n\n0.3\n\n(b) 0.020\n\n0.05\n0.2\n\n0.015\n\n0.1\n\n0.010\n\n0.02\n0.1\n-6\n\n-4\n\n-2\n\n0\n\nb\n\n2\n\n4\n\n6\n\n0.01\n\n0.005\n-6\n\n-4\n\n-2\n\n0\n\nb\n\n2\n\n4\n\n6\n\n0.06\n\n0.4\n\n(c) 0.05\n\n0.25\n\n0.04\n\n0.20\n\n0.03\n\n0.15\n\n0.3\n0.2\n\n0.02\n0.1\n0.0\n\n0.0\n\n0.01\n0.00\n-6\n\n-4\n\n-2\n\n0\n\nb\n\n2\n\n4\n\n(d)\n\n0.03\n0.02\n0.01\n\n0.05\n-6\n\n-4\n\n-2\n\n0.20\n\n0.6\n\n(e) 0.06\n\n0.5\n0.04\n\n0.4\n0.3\n0.2\n-6\n\n-4\n\n-2\n\n0\n\nb\n\n2\n\n4\n\n6\n\n0\n\nb\n\n2\n\n4\n\n6\n\n(f) 0.016\n\n0.15\n\n0.012\n\n0.10\n\n0.02\n\n0.05\n\n0.00\n\n0.00\n\n0.05\n0.04\n\n0.10\n\n6\n\n0.06\n\n0.008\n0.004\n-6\n\n-4\n\n-2\n\n0\n\nb\n\n2\n\n4\n\n6\n\nFigure 2. Steady-state infected density ρ and speed index λ for different b. The serial\nnumbers (a)-(f) have the same meaning to those for figure 1. The black and blue curves represent the\nsteady-state infected density and the speed index, respectively. The black and blue dash lines indicate\nthe peaks of the corresponding curves. Results are obtained by averaging over 1000 independent\nrealizations.\n\n\f8\n\n0.4\n\noriginal\n\n(a)\n\n0.3\n\n(b)\n\nnull model\n\n0.3\n\n0.2\n\n0.2\n\n0.1\n\n0.1\n\n0.0\n-6\n\n-4\n\n-2\n\n0\n\nb\n\n2\n\n4\n\n0.4\n\n6\n\n(c)\n\n-6\n\n-2\n\n0\n\nb\n\n2\n\n4\n\n0.25\n\n0.3\n\n0.20\n\n0.2\n\n0.15\n\n6\n\n(d)\n\n0.10\n\n0.1\n0.0\n\n-4\n\n0.05\n-6\n\n-4\n\n-2\n\n0\n\nb\n\n2\n\n4\n\n6\n\n-6\n\n-4\n\n-2\n\n0\n\nb\n\n2\n\n4\n\n6\n\n0.20\n\n0.6\n\n(f)\n\n(e)\n\n0.5\n\n0.15\n\n0.4\n\n0.10\n\n0.3\n\n0.05\n\n0.2\n\n0.00\n-6\n\n-4\n\n-2\n\n0\n\nb\n\n2\n\n4\n\n6\n\n-6\n\n-4\n\n-2\n\n0\n\nb\n\n2\n\n4\n\n6\n\nFigure 3. Comparing ρ(b) between real and randomized networks. The serial numbers (a)-(f)\nhave the same meaning to those for figure 1. The black and red curves/lines represent the cases for real\nand randomized networks, respectively. Results are obtained by averaging over 1000 independent\nrealizations.\n\n0.06\n\noriginal\n\n(a)\n\nnull model\n\n0.05\n\n0.020\n\n(b)\n\n0.015\n\n0.04\n0.010\n\n0.03\n\n0.005\n\n0.02\n-6\n\n-4\n\n-2\n\n0\n\nb\n\n2\n\n4\n\n6\n\n0.06\n\n(c)\n\n0.05\n0.04\n\n-6\n\n-4\n\n-2\n\n0\n\nb\n\n2\n\n4\n\n0.06\n\n6\n\n(d)\n\n0.05\n0.04\n\n0.03\n\n0.03\n\n0.02\n\n0.02\n\n0.01\n\n0.01\n\n0.00\n-6\n\n-4\n\n-2\n\n0\n\nb\n\n2\n\n4\n\n6\n\n0.07\n\n(e)\n\n0.06\n0.05\n\n0.00\n\n-6\n\n-4\n\n-2\n\n0\n\nb\n\n2\n\n4\n\n0.016\n\n6\n\n(f)\n\n0.012\n\n0.04\n0.03\n\n0.008\n\n0.02\n0.01\n\n0.004\n\n0.00\n-6\n\n-4\n\n-2\n\n0\n\nb\n\n2\n\n4\n\n6\n\n-6\n\n-4\n\n-2\n\n0\n\nb\n\n2\n\n4\n\n6\n\nFigure 4. Effects of correlations between tie strength and network structure on the speed\nto reach the steady state. The serial numbers (a)-(f) have the same meaning to those for figure 1.\nThe black and red curves/lines represent the cases for real and randomized networks, respectively.\nResults are obtained by averaging over 1000 independent realizations.\n\n\f"}