{"id": "http://arxiv.org/abs/0901.0731v1", "guidislink": true, "updated": "2009-01-06T22:16:32Z", "updated_parsed": [2009, 1, 6, 22, 16, 32, 1, 6, 0], "published": "2009-01-06T22:16:32Z", "published_parsed": [2009, 1, 6, 22, 16, 32, 1, 6, 0], "title": "The early phase of a H1743-322 outburst observed by INTEGRAL, RXTE,\n  Swift, and XMM/Newton", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0901.1133%2C0901.3106%2C0901.2240%2C0901.0694%2C0901.3126%2C0901.3795%2C0901.2108%2C0901.3201%2C0901.1221%2C0901.0983%2C0901.2084%2C0901.2594%2C0901.1675%2C0901.3681%2C0901.0980%2C0901.2856%2C0901.1255%2C0901.2347%2C0901.1415%2C0901.1334%2C0901.3380%2C0901.0804%2C0901.1990%2C0901.3638%2C0901.3842%2C0901.4005%2C0901.0782%2C0901.2227%2C0901.3691%2C0901.1632%2C0901.2400%2C0901.4772%2C0901.0226%2C0901.0552%2C0901.4212%2C0901.4797%2C0901.2645%2C0901.1453%2C0901.1510%2C0901.3449%2C0901.3208%2C0901.4003%2C0901.0112%2C0901.3037%2C0901.3959%2C0901.3445%2C0901.3863%2C0901.2986%2C0901.4421%2C0901.0031%2C0901.1462%2C0901.4594%2C0901.4620%2C0901.0567%2C0901.1648%2C0901.2632%2C0901.2154%2C0901.3885%2C0901.4605%2C0901.4269%2C0901.0134%2C0901.2551%2C0901.1708%2C0901.4109%2C0901.4156%2C0901.2455%2C0901.4133%2C0901.4867%2C0901.0711%2C0901.2021%2C0901.0114%2C0901.0754%2C0901.0103%2C0901.2152%2C0901.1732%2C0901.0731%2C0901.1836%2C0901.2807%2C0901.3292%2C0901.0653%2C0901.2067%2C0901.0290%2C0901.0350%2C0901.3610%2C0901.3583%2C0901.4390%2C0901.3630%2C0901.1224%2C0901.3811%2C0901.2669%2C0901.1542%2C0901.0817%2C0901.1569%2C0901.4538%2C0901.0672%2C0901.4159%2C0901.3490%2C0901.0220%2C0901.0147%2C0901.4613%2C0901.4209&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The early phase of a H1743-322 outburst observed by INTEGRAL, RXTE,\n  Swift, and XMM/Newton"}, "summary": "We investigate the early phase of the first state change during the 2008\nSeptember-November outburst of H1743-322, first detected by the INTEGRAL\nsatellite. We analyse INTEGRAL, RXTE, Swift, and XMM/Newton observations, which\nprovide coverage of the quiescence to outburst evolution in the 3-200 keV range\nevery few days. The energy spectra are well fitted by a phenomenological model\nconsisting of an exponentially cut-off power law plus a disc component. A more\nphysical model of thermal Comptonisation (and a disc) represents the spectra\nequally well. In a first phase (up to MJD 54760), the photon index and\ntemperature of the disc do not vary significantly, and have values reminiscent\nof the Hard State (HS). The timing analysis is also consistent with that of a\nHS, and shows in particular a rather high degree of variability (~30%), and a\nstrong ~0.5-1 Hz QPO with its first harmonic. The timing and spectral\ncharacteristics of H1743-322 are similar to those of the first HS during its\n2003 outburst. After MJD 54760, a change to softer spectra and a ~5-6 Hz QPO\nindicate that the source underwent a state transition into a Hard-Intermediate\nState (HIMS). We observe in both states a correlation between the QPO frequency\nand the photon index, which indicates a strong link between the accretion disc,\ngenerally understood to determine the QPO frequency, and the corona, which\ndetermines the QPO power. The gradual disappearance of the QPO harmonic, and\nthe slowly decreasing hard X-ray flux, imply that the accretion disc gradually\nmoved inwards during the HS.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0901.1133%2C0901.3106%2C0901.2240%2C0901.0694%2C0901.3126%2C0901.3795%2C0901.2108%2C0901.3201%2C0901.1221%2C0901.0983%2C0901.2084%2C0901.2594%2C0901.1675%2C0901.3681%2C0901.0980%2C0901.2856%2C0901.1255%2C0901.2347%2C0901.1415%2C0901.1334%2C0901.3380%2C0901.0804%2C0901.1990%2C0901.3638%2C0901.3842%2C0901.4005%2C0901.0782%2C0901.2227%2C0901.3691%2C0901.1632%2C0901.2400%2C0901.4772%2C0901.0226%2C0901.0552%2C0901.4212%2C0901.4797%2C0901.2645%2C0901.1453%2C0901.1510%2C0901.3449%2C0901.3208%2C0901.4003%2C0901.0112%2C0901.3037%2C0901.3959%2C0901.3445%2C0901.3863%2C0901.2986%2C0901.4421%2C0901.0031%2C0901.1462%2C0901.4594%2C0901.4620%2C0901.0567%2C0901.1648%2C0901.2632%2C0901.2154%2C0901.3885%2C0901.4605%2C0901.4269%2C0901.0134%2C0901.2551%2C0901.1708%2C0901.4109%2C0901.4156%2C0901.2455%2C0901.4133%2C0901.4867%2C0901.0711%2C0901.2021%2C0901.0114%2C0901.0754%2C0901.0103%2C0901.2152%2C0901.1732%2C0901.0731%2C0901.1836%2C0901.2807%2C0901.3292%2C0901.0653%2C0901.2067%2C0901.0290%2C0901.0350%2C0901.3610%2C0901.3583%2C0901.4390%2C0901.3630%2C0901.1224%2C0901.3811%2C0901.2669%2C0901.1542%2C0901.0817%2C0901.1569%2C0901.4538%2C0901.0672%2C0901.4159%2C0901.3490%2C0901.0220%2C0901.0147%2C0901.4613%2C0901.4209&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We investigate the early phase of the first state change during the 2008\nSeptember-November outburst of H1743-322, first detected by the INTEGRAL\nsatellite. We analyse INTEGRAL, RXTE, Swift, and XMM/Newton observations, which\nprovide coverage of the quiescence to outburst evolution in the 3-200 keV range\nevery few days. The energy spectra are well fitted by a phenomenological model\nconsisting of an exponentially cut-off power law plus a disc component. A more\nphysical model of thermal Comptonisation (and a disc) represents the spectra\nequally well. In a first phase (up to MJD 54760), the photon index and\ntemperature of the disc do not vary significantly, and have values reminiscent\nof the Hard State (HS). The timing analysis is also consistent with that of a\nHS, and shows in particular a rather high degree of variability (~30%), and a\nstrong ~0.5-1 Hz QPO with its first harmonic. The timing and spectral\ncharacteristics of H1743-322 are similar to those of the first HS during its\n2003 outburst. After MJD 54760, a change to softer spectra and a ~5-6 Hz QPO\nindicate that the source underwent a state transition into a Hard-Intermediate\nState (HIMS). We observe in both states a correlation between the QPO frequency\nand the photon index, which indicates a strong link between the accretion disc,\ngenerally understood to determine the QPO frequency, and the corona, which\ndetermines the QPO power. The gradual disappearance of the QPO harmonic, and\nthe slowly decreasing hard X-ray flux, imply that the accretion disc gradually\nmoved inwards during the HS."}, "authors": ["L. Prat", "J. Rodriguez", "M. Cadolle Bel", "E. Kuulkers", "M. Hanke", "J. Tomsick", "S. Corbel", "M. Coriat", "J. Wilms", "A. Goldwurm"], "author_detail": {"name": "A. Goldwurm"}, "author": "A. Goldwurm", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1051/0004-6361:200811393", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0901.0731v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0901.0731v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "4 pages, 4 figures, Letter to the Editor accepted for publication in\n  A&A", "arxiv_primary_category": {"term": "astro-ph.HE", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph.HE", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0901.0731v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0901.0731v1", "journal_reference": null, "doi": "10.1051/0004-6361:200811393", "fulltext": "c ESO 2018\n\nAstronomy & Astrophysics manuscript no. 1393tex\nOctober 22, 2018\n\nLetter to the Editor\n\narXiv:0901.0731v1 [astro-ph.HE] 6 Jan 2009\n\nThe early phase of a H1743−322 outburst observed by INTEGRAL,\nRXTE, Swift, and XMM/Newton\nL. Prat1,2 , J. Rodriguez1,2 , M. Cadolle Bel3 , E. Kuulkers3⋆ , M. Hanke4,5 ,\nJ. Tomsick6 , S. Corbel1,2 , M. Coriat1,2 , J. Wilms4,5 , and A. Goldwurm1,7\n1\n2\n3\n4\n5\n6\n7\n\nDSM/IRFU/Service d'Astrophysique/CEA-Saclay, France\ne-mail: lionel.prat@cea.fr\nAIM-UMR 7158, Paris, France\nESAC, ISOC, Villañueva de la Cañada, Madrid, Spain\nDr. Karl Remeis-Observatory, Bamberg, Germany\nErlangen Centre for Astroparticle Physics, Germany\nSpace Sciences Laboratory, University of California, Berkeley, USA\nAPC-UMR 7164, Paris, France\n\nReceived ; accepted\nABSTRACT\n\nAims. We investigate the early phase of the first state change during the 2008 September-November outburst of H1743-322, first\ndetected by the INTEGRAL satellite. We focus on the preliminary hard X-ray state with the aim of investigating the possible influence\nof this phase on the subsequent evolution during the outburst.\nMethods. The outburst started on MJD 54732, and remains ongoing at the time of writing this paper (MJD 54770). We analyse\nINTEGRAL, RXTE, Swift, and XMM/Newton observations, which provide coverage of the quiescence to outburst evolution in the\n3–200 keV range every few days. We present both the spectral and timing analysis. We compare these parameters with the behaviour\nof the source during a previous outburst in 2003, which was observed by INTEGRAL and RXTE.\nResults. The energy spectra are well fitted by a phenomenological model consisting of an exponentially cut-off power law plus a disc\ncomponent. A more physical model of thermal Comptonisation (and a disc) represents the spectra equally well. In a first phase (up to\nMJD 54760), the photon index and temperature of the disc do not vary significantly, and have values reminiscent of the Hard State\n(HS). The timing analysis is also consistent with that of a HS, and shows in particular a rather high degree of variability (∼30%), and\na strong ∼0.5–1 Hz QPO with its first harmonic. After MJD 54760, a change to softer spectra and a ∼5–6 Hz QPO indicate that the\nsource underwent a state transition into a Hard-Intermediate State (HIMS).\nConclusions. The timing and spectral characteristics of H1743−322 are similar to those of the first HS during its 2003 outburst. We\nobserve a correlation between the QPO frequency and the photon index, which indicates a strong link between the accretion disc,\ngenerally understood to determine the QPO frequency, and the corona, which determines the QPO power. The gradual disappearance\nof the QPO harmonic, and the slowly decreasing hard X-ray flux, imply that the accretion disc slowly moved inwards during the HS.\nKey words. X-rays: individuals: H1743−322, IGR J17464−3213 – X-rays: binaries – gamma-rays: observations\n\n1. Introduction\nThe X-ray nova H1743−322 was discovered during a bright\noutburst that occurred in 1977 with the Ariel V and HEAO I\nsatellites by Kaluzienski & Holt (1977). In 2003, another bright\noutburst was first detected with INTEGRAL, and the source\nwas then dubbed IGR J17464−3213, before it was realised\nthat it was H1743−322 (Markwardt & Swank 2003). This outburst has been studied considerably at all wavelengths (see e.g.\nParmar et al. 2003; Lutovinov et al. 2005; Kalemci et al. 2006).\nIt was shown in particular that H1743−322 had a behaviour consistent with most black-hole X-ray transients, and was, thus,\nclassified as a Black-Hole Candidate. This 2003 outburst was\nfollowed by weaker episodes in 2004, 2005, and in the first\nmonths of 2008 (see Kalemci et al. 2008).\nA new outburst was detected on 2008 September 23\n(Kuulkers et al. 2008), during INTEGRAL observations of the\nGalactic Bulge (GB). The source brightened above the detec⋆\n\non behalf of the INTEGRAL Galactic bulge monitoring team\n\ntion limit in the middle of the INTEGRAL observation, and\nthus provided us with the rare privilege of observing an X-ray\nnova during the very first stages of an outburst, from the quiescent state to the rising phase. Due to this early notice, several\nhigh energy satellites were able to follow rapidly H1743−322:\nINTEGRAL and RXTE observations occurred almost every second day, while at softer X-rays, Swift (XRT) and XMM/Newton\nprovided 3 and 1 observations, respectively.\nHerein, we present the results of the X and γ–ray coverage of\nthe source in its Hard State (HS) until its transition to the Hard\nIntermediate State (HIMS, see e.g. Homan & Belloni 2005),\nwhich is characterized by a photon index between ∼1.5-2.5,\nand the presence of strong type C Quasi Periodic Oscillations\n(QPOs). Our study is focused on the very first stages of its evolution from quiescence to outburst. We analyse the spectral and\ntiming characteristics of H1743−322, and compare its behaviour\nwith that of the well-studied 2003 outbust. The outburst remains\nongoing while this letter is being written, and the study of the\ncomplete outburst is deferred to a future investigation.\n\n\fL. Prat et al.: An early-phase hard state outburst of H1743−322\n\n6\n\n1\n0.1\n0.01\n\n4\n\n10\nchannel energy (keV)\n\n2\n0\n54700\n\n54720\n\n54740\n54760\nTime (MJD)\n\n54780\n\n54800\n\nFig. 1. Swift /BAT and RXTE /ASM lightcurves of H1743−322\nduring its 2008 outburst, in the 15-150 keV and 1.5-12 keV energy ranges, respectively. The periods of the observations used\nin this paper are indicated for each instrument.\n\n2. Observations and data reduction\nThe INTEGRAL observations analysed here originate in two\ndifferent programmes. The Galactic Bulge (GB) programme\n(Kuulkers et al. 2007) is performed once every INTEGRAL revolution whenever the region is visible, and consists of 12.6 ks\nexposure observations. The Galactic Centre (GC) programme\nprovides longer exposures, of duration typically between ∼40\nand ∼200 ks, every ∼2 revolutions, as part of the \"Key Projects\"\nstrategy of INTEGRAL. The black-hole candidates within the\nfield of view are monitored by our team (PI Prat, see Prat et al.\n2008a), by taking advantage of the long exposure time to achieve\nearly detections of new outbursts and monitor their evolution. The XMM/Newton observation originate in a private programme (PI Wilms, Hanke et al. 2008), while the data from\nRXTE and Swift are public. The times of all observations are\nindicated on Fig. 1.\nThe INTEGRAL data were reduced using the standard Off-line Scientific Analysis (OSA) v7.0 software\npackage (Goldwurm et al. 2003). We used standard response\nfiles to obtain spectra of the source in the 18-200 keV range, with\n11 spectral bins (see Fig. 2 for a sample spectrum). A systematic\nerror of 2% was applied to all bins. The activation of H1743−322\nwas monitored for ∼170 ks without interruption by INTEGRAL,\nand we therefore took special care in analysing the very first data\navailable. Since H1743−322 was too faint to be detected in single science window pointings, we used a \"sliding\" technique: we\naccumulated images of ∼30 ks exposure time, every ∼6 ks. This\nenables a more detailed study of its evolution, especially when\nconsidering the 20–200 keV flux (Fig. 3, panel a). In the 3–20\nkeV range, JEM-X data were included in our analysis only after\nMJD 54749, when the source was sufficiently bright for spectral\nextraction to be possible in the data.\nThe RXTE and Swift /XRT data were reduced with the\nHEASOFT v6.5 software package following the standard steps explained in the RXTE cookbook1 and XRT users manual2. High\ntime resolution light curves were extracted from the PCA (all\n1\n2\n\n0\n−2\n\nASM (count s-1)\n\nχ\n\n2\n\nnormalized counts/sec/keV\n\n10\n\n2\n\navailable at http://heasarc.gsfc.nasa.gov/docs/xte/data analysis.html\nhttp://heasarc.gsfc.nasa.gov/docs/swift/analysis/\n\n100\n\nFig. 2. Joint RXTE /INTEGRAL spectrum, taken around MJD\n54748 (INTEGRAL revolution 731), with the PCA (black),\nHEXTE (red), IBIS/ISGRI (blue) and Swift /XRT (green) data,\nalong with the best-fit model: an absorbed powerlaw with a highenergy cutoff, a disc blackbody and a faint Fe fluorescent line.\nThe residuals, in σ units, are also shown below.\nlayers, all active PCUs) EVENT data with ∼500 μs resolution,\nafter removing the artificial time marker with sefilter. We restricted the energy range to ∼3–40 keV (Channels 5–91). We\nproduced power-density spectra (PDS) with powspec v1.0 in\nthe frequency range 0.0156–1024 Hz. The PCA spectra were\nextracted in the ∼3–25 keV range from the top layer of PCU\n2, from STANDARD 2 data, while background spectra were\nestimated from the PCA background model for bright sources.\nSystematic errors at a level of 0.8% were added to all channels.\nThe HEXTE spectra were extracted from Cluster B only.\nFor XRT data, we produced level 2 data with the\nxrtpipeline v0.12.0, which removed calibration source, bad\npixels and grade selection. We analyse only observations completed in photon-counting mode. We extracted images, light\ncurves, and spectra from these cleaned event files with xselect\nv2.4. However, even during the first observation the source was\nbright and its light was lightly to cause saturation; we therefore\nextracted source and background spectra from annuli centred on\nthe most accurately determined position of H1743−322. We generated exposure maps with xrtexpomap v0.2.5, and ancillary response files with the tool xrtmkarf v0.5.6. The resultant spectra were rebinned so as to have at least 20 counts per channel,\nallowing the chi-squared statistics to be evaluated using xspec\nv11.3.2ag. The spectra were fitted between 0.5 keV and ∼10 keV.\nThe XMM/Newton data were reduced with the Science\nAnalysis Software, xmmsas, v. 7.1, following standard procedures. We used successively the tasks epchain, rgsproc,\nevselect, rmfgen, and arfgen to produce spectra and response matrices. We restricted the data from the EPIC-pn (timing mode) to the 1–10 keV range. The first and second order\nspectra from RGS 1 and 2 were rebinned to contain ≥ 50 counts\nper bin.\n\n3. Results\n3.1. Spectral analysis and results\n\nApart from the first stages of the outburst, when the flux increased quickly, the source did not evolve significantly during\nany single day. Therefore, we combined the data from the various satellites when the observations were separated by less than\n\n\fL. Prat et al.: An early-phase hard state outburst of H1743−322\n\n3\n\nFe K emission line. As a cut-off power law is usually interpreted as a signature of thermal Comptonization, we replaced\nthis simpler model with a more physical Comptonization model\n(COMPTT, Titarchuk 1994), and obtained equally good fits. The\nplasma temperatures that we obtained are similar to those corresponding to the cutoff energies measured using the phenomenological model, with slightly smaller error bars. Hereafter, the\nphoton indices were thus deduced from the phenomenological\nmodel, while the other spectral parameters were calculated using\nthe more physical constant*wabs*(comptt+diskbb+gaussian)\nmodel (in XSPEC terminology). The absorption is not well constrained by the RXTE /PCA observations and, when leaving this\nparameter free, we were unable to determine the temperature\nof the disc. Therefore, we assumed the value calculated using\nthe Swift and XMM/Newton observations, NH = 1.8 ± 0.2 ×\n1022 cm−2 , and fixed the NH parameter to this value in every observation.\nThe spectral evolution of H1743−322 is reported in Fig. 3\n(panels a to e). The sizes of the error bars depend on the availability of the various satellites.\nDuring the first days of the outburst, around MJD 57433,\nthe source exhibited a rapid rise in hard X-ray flux: the flux increased by a factor ∼2.3 in less than 1.5 days (Fig. 3, panel a).\nAt the same time, the photon index remained remarkably stable,\naround 1.65 (panel c). Then, between MJD 54741.5 and MJD\n54760, the 20–200 keV flux reached a maximum and slowly\ndecayed, while the photon index stayed at low values, in the\nrange 1.2–1.6. The times when RXTE or Swift satellites are\navailable correspond to indices lower by ∼0.3 compared with\nthe INTEGRAL data alone. This is due to the fact that the two\nformer satellites provide coverage in softer energy bands: since\nthe coverage of ISGRI starts around 18 keV, it cannot accurately\nconstrain the high-energy cutoff around ∼20 keV. Instead, the\npresence of this cutoff appears to cause the photon index to be\nsofter, because the fitting process tends to mix the beginning of\nthe high energy rollover with the end of the pure power-law part.\nThe Comptonized component can be characterised by\nthe Kompaneets parameter (Rybicki & Lightman 1986), y =\n4kT e\nmax(τ, τ2 ), where kT e is the plasma temperature, and τ its\nme c 2\noptical depth (panel d). This parameter did not evolve significantly before MJD 54759, and then decreased significantly\nwithin two days. At the same time, the 20–200 keV flux decreased by ∼45%, and a softening of the spectra occurred.\n3.2. Timing\n\nFig. 3. Spectral and timing characteristics of H1743−322. From\ntop to bottom, lightcurves in the 20–200 keV (a) and 2–20 keV\n(b) bands, (c) photon index of the power law component, (d)\nKompaneets parameter, (e) disc blackbody maximum temperature, (f) total RMS power, (g) frequencies of the two detected\nQPOs and (h) RMS power of these QPOs. The filled zone marks\nthe spectral transition from the Hard State (HS) to the Hard\nIntermediate State (HIMS). Error bars are at the 90% confidence\nlevel.\none day, to be able to extend the energy range and constrain the\nspectral parameters more accurately.\nThe high-energy ends of the spectra are well fitted using a\nsimple power-law, with a high-energy cutoff located typically in\nthe ∼15–25 keV range, with relative error bars of ∼20%. The 1–\n20 keV range shows a disc blackbody component and a Gaussian\n\nThe RXTE PDS exhibit a shape reminiscent of many other BHs\nduring the first phases of their outbursts. They show a flat top\ncomponent until a break frequency, above which the decrease\nin power versus frequency is almost power law like. This is also\nsimilar to the PDS of GRS 1915+105 during the so-called χ class\nof variability (Rodriguez et al. 2008). We therefore modelled the\nPDS of H1743−322 using the same kind of model: one or two\nzero-centred Lorentzians, plus narrower ones to account for the\npresence of QPOs. Due to limited quality of our data, above ∼20\nHz the PDS are consistent with white noise. We therefore restricted the fits to the range 0.0156–20 Hz. In all PDS extracted\nbefore MJD 54760, a strong type C QPO with its harmonic is\nvisible, as reported by Yamaoka et al. (2008). The evolution in\nthe QPO parameters (in terms of frequency and RMS amplitude)\nis reported in Fig. 3 (panels g and h).\nThe RMS of the continuum remained about ∼30% during the\nHS (Fig. 3, panel f). The RMS fraction of the lower frequency\n\n\f4\n\nL. Prat et al.: An early-phase hard state outburst of H1743−322\n\nQPO remained stable of around 15%. The RMS fraction of the\nfirst harmonic QPO decreased during the first 3 RXTE observations, and was insufficiently strong to be measurable afterwards.\n\nFig. 4. Photon index of the power law component as a function\nof the frequency of the main QPO. The left part of the diagram\ncorresponds to the HS, while the right part corresponds to the\nHIMS.\n\n4. Discussion\nThe spectral and temporal parameters of H1743-322 from MJD\n54732 to 54759 indicated that the source was in a HS typical\nof a Black-Hole Binary (Prat et al. 2008a). This was further supported by the observation of radio emission with a flat or slightly\ninverted spectrum (Corbel et al. 2008). We note that the source\nwas observed to be in this state from the very beginning of the\noutburst. After MJD 54761, the sharp decline in the RMS variability and the sudden increase in the QPO frequency within the\ntiming domain, observed to occur simultaneously with a sudden\nincrease in photon index and decrease in hard X-ray flux, indicate that the source had changed its state. We identify the new\nstate as a HIMS (Belloni et al. 2008; Prat et al. 2008b).\nWhen comparing this behaviour with that of the beginning\nof the 2003 outburst, we can see that H1743−322 emulated in\nan approximate way its past behaviour. H1743−322 remained\nwithin a HS for ∼12 days only, compared with ∼28 days for\nthe current outburst. The total fluxes were comparable: it was\nthen in the range 2.5–3 × 10−9 erg cm−2 s−1 in the 20–100 keV\nband (McClintock et al. 2007), compared with 0.5–3.3 × 10−9\nerg cm−2 s−1 . The total RMS powers were in the same range, i.e.\n∼25% in 2003, compared with ∼30%. The RMS power and photon index are also similar to those exhibited during the 2003 outburst decay, when the source re-entered the HS (Kalemci et al.\n2006). We detect two QPOs, of frequencies ∼0.3 and ∼1 Hz,\nand RMS amplitudes of ∼5 and ∼10% respectively. During the\nbeginning of the 2003 outburst, a QPO was detected around ∼0.1\nHz, along with its first harmonic, of ∼3–14% RMS amplitude.\nThe main differences reside in the photon indices, which\nwere lower during the 2008 outburst, and the duration of the\nHS, which was shorter during the 2003 outburst, although it is\nunclear whether these differences are related.\nThe evolution in the different parameters follows two distinct\npaths. The overall evolution is characterised by a slowly decreasing hard X-ray flux and a slowly increasing QPO frequency. At\nthe same time, more rapid changes occur: we detect a rapid increase in the flux at the onset of the outburst, and a rapid softening of the spectra precisely as a drastic increase in the QPO\nfrequency takes place at the state transition. These two distinct\n\nbehaviours are reminiscent of the interpretation of Smith et al.\n(2002), which involved two different media: one medium that\nevolves with a long viscous timescale (the accretion disc), and\none that evolves more rapidly (a corona and/or a jet). We can\nindeed interpret the slowly decreasing hard X-ray flux as being\na consequence of the disc evolution: the disc slowly moves in\nand, as it does, gradually cools the corona. The properties of the\nQPOs are also comparable to that seen for other BHs in outburst. In particular, the frequency increases with the photon index (Fig. 4, Vignarca et al. 2003). The fact that the energy spectra are dominated by the Comptonized component indicates that,\nalthough the disc properties probably determine the frequency,\nthe observed QPO power is probably generated in the corona.\nThe slow increase in the QPO frequency is of particular interest. If we consider a model of an instability propagating inside the disc, the increase in frequency can be interpreted as a\nmovement of the inner part of the disc. In such a model, the frequency is somehow related to the Keplerian rotation frequency,\nsuch if the inner part of the disc moves in, the rotation frequency\nincreases, and thus so does the QPO frequency. After the transition to the HIMS, when the QPO frequency increases dramatically, this would indicate that the disk had moved further inwards. Unfortunately, H1743−322 was not bright enough to enable the inner radius of the accretion disc to be determined precisely using the multicolor disc blackbody model.\nWe had the rare privilege to observe a poorly studied early\nphase of a BH outburst. Our analysis shows that the outburst\nstarted in a hard state, initiated by a rapid increase in the flux\nwith a roughly constant spectral shape. The parameters of these\nearly phases could provide important constraint on the subsequent evolution of the outburst. For example, the quite hard\nspectra seen here could be linked to the length of the HS interval. In the future, more sensitive hard X-ray instruments, such\nas SIMBOL-X, should allow us to study even fainter and thus\nearlier phases.\nAcknowledgements. The authors warmly thank the INTEGRAL planners for\nhaving scheduled numerous and regular observations quickly after the beginning of the outburst. We thank P. Varnière for useful discussions on the evolution\nof the QPOs. MH and JW acknowledge funding from the Bundesministerium\nfür Wirtschaft und Technologie through Deutsches Zentrum für Luft- und\nRaumfahrt grant 50OR0701. This research has made use of data obtained\nthrough the High Energy Astrophysics Science Archive Research Center and\nquick-look results provided by the RXTE /ASM and Swift /BAT teams. Based\non observations with INTEGRAL, an ESA project with instruments and science\ndata centre funded by ESA member states (especially the PI countries: Denmark,\nFrance, Germany, Italy, Switzerland, Spain), Czech Republic and Poland, and\nwith the participation of Russia and the USA. JAT acknowledges partial support\nfrom NASA INTEGRAL Guest Observer grant NNX08AX92G.\n\nReferences\nBelloni, T., Homan, J., Yamaoka, K., & Swank, J. 2008, ATel, 1804\nCorbel, S., Tzioumis, T., Coriat, M., Brocksopp, C., & Fender, R. 2008, ATel,\n1766\nGoldwurm, A., David, P., Foschini, L., et al. 2003, A&A, 411, L223\nHanke, M., Wilms, J., Fürst, F., Nowak, M. A., & Pottschmidt, K. 2008, Atel,\n1829\nHoman, J. & Belloni, T. 2005, Ap&SS, 300, 107\nKalemci, E., Tomsick, J. A., Rothschild, R. E., et al. 2006, ApJ, 639, 340\nKalemci, E., Tomsick, J. A., Yamaoka, K., & Ueda, Y. 2008, ATel, 1348\nKaluzienski, L. J. & Holt, S. S. 1977, IAU Circ., 3099, 3\nKuulkers, E., Brandt, S., Budtz-Jorgensen, C., et al. 2008, ATel, 1739\nKuulkers, E., Shaw, S. E., Paizis, A., et al. 2007, A&A, 466, 595\nLutovinov, A., Revnivtsev, M., Molkov, S., & Sunyaev, R. 2005, A&A, 430, 997\nMarkwardt, C. B. & Swank, J. H. 2003, ATel, 133\nMcClintock, J. E., Remillard, R. A., Rupen, M. P., et al. 2007, astro-ph,\n[0705.1034]\nParmar, A. N., Kuulkers, E., Oosterbroek, T., et al. 2003, A&A, 411, L421\n\n\fL. Prat et al.: An early-phase hard state outburst of H1743−322\nPrat, L., Rodriguez, J., & Cadolle Bel, M. 2008a, ATel, 1745\nPrat, L., Rodriguez, J., Cadolle Bel, M., et al. 2008b, ATel, 1808\nRodriguez, J., Shaw, S. E., Hannikainen, D. C., et al. 2008, ApJ, 675, 1449\nRybicki, G. B. & Lightman, A. P. 1986, in Radiative Transfer in Astrophysics,\nWiley-VCH\nSmith, D. M., Heindl, W. A., & Swank, J. H. 2002, ApJ, 569, 362\nTitarchuk, L. 1994, ApJ, 434, 570\nVignarca, F., Migliari, S., Belloni, T., Psaltis, D., & van der Klis, M. 2003, A&A,\n397, 729\nYamaoka, K., Swank, J. H., Belloni, T., & Takahashi, H. 2008, ATel, 1780\n\n5\n\n\f"}