{"id": "http://arxiv.org/abs/0910.0488v1", "guidislink": true, "updated": "2009-10-02T21:14:36Z", "updated_parsed": [2009, 10, 2, 21, 14, 36, 4, 275, 0], "published": "2009-10-02T21:14:36Z", "published_parsed": [2009, 10, 2, 21, 14, 36, 4, 275, 0], "title": "Soft gamma-ray optics: new Laue lens design and performance estimates", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0910.5514%2C0910.2204%2C0910.2577%2C0910.3801%2C0910.0982%2C0910.0065%2C0910.0171%2C0910.3198%2C0910.4442%2C0910.0216%2C0910.3552%2C0910.3066%2C0910.1043%2C0910.1596%2C0910.1201%2C0910.5528%2C0910.2571%2C0910.0787%2C0910.5717%2C0910.0219%2C0910.0487%2C0910.0574%2C0910.5144%2C0910.2588%2C0910.2362%2C0910.4585%2C0910.3823%2C0910.5558%2C0910.1643%2C0910.5526%2C0910.0238%2C0910.1077%2C0910.3979%2C0910.3511%2C0910.2923%2C0910.3544%2C0910.1841%2C0910.4344%2C0910.3461%2C0910.0558%2C0910.5871%2C0910.5075%2C0910.3041%2C0910.4769%2C0910.2772%2C0910.4200%2C0910.5934%2C0910.2764%2C0910.3992%2C0910.5273%2C0910.5207%2C0910.3681%2C0910.0488%2C0910.3405%2C0910.1348%2C0910.4091%2C0910.5329%2C0910.0860%2C0910.4646%2C0910.5366%2C0910.1213%2C0910.5131%2C0910.1850%2C0910.1512%2C0910.5065%2C0910.1187%2C0910.3185%2C0910.3342%2C0910.4365%2C0910.4433%2C0910.4593%2C0910.0027%2C0910.0614%2C0910.3029%2C0910.0648%2C0910.5904%2C0910.1526%2C0910.2303%2C0910.3998%2C0910.5900%2C0910.3147%2C0910.5088%2C0910.2695%2C0910.5149%2C0910.0429%2C0910.3351%2C0910.5738%2C0910.2349%2C0910.2098%2C0910.3945%2C0910.0365%2C0910.5198%2C0910.2727%2C0910.5781%2C0910.3643%2C0910.4432%2C0910.5769%2C0910.0208%2C0910.2298%2C0910.3777%2C0910.2640&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Soft gamma-ray optics: new Laue lens design and performance estimates"}, "summary": "Laue lenses are an emerging technology based on diffraction in crystals that\nallows the concentration of soft gamma rays. This kind of optics that works in\nthe 100 keV - 1.5 MeV band can be used to realize an high-sensitivity and\nhigh-angular resolution telescope (in a narrow field of view). This paper\nreviews the recent progresses that have been done in the development of\nefficient crystals, in the design study and in the modelisation of the answer\nof Laue lenses. Through the example of a new concept of 20 m focal length lens\nfocusing in the 100 keV - 600 keV band, the performance of a telescope based on\na Laue lens is presented. This lens uses the most efficient mosaic crystals in\neach sub-energy range in order to yield the maximum reflectivity. Imaging\ncapabilities are investigated and shows promising results.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0910.5514%2C0910.2204%2C0910.2577%2C0910.3801%2C0910.0982%2C0910.0065%2C0910.0171%2C0910.3198%2C0910.4442%2C0910.0216%2C0910.3552%2C0910.3066%2C0910.1043%2C0910.1596%2C0910.1201%2C0910.5528%2C0910.2571%2C0910.0787%2C0910.5717%2C0910.0219%2C0910.0487%2C0910.0574%2C0910.5144%2C0910.2588%2C0910.2362%2C0910.4585%2C0910.3823%2C0910.5558%2C0910.1643%2C0910.5526%2C0910.0238%2C0910.1077%2C0910.3979%2C0910.3511%2C0910.2923%2C0910.3544%2C0910.1841%2C0910.4344%2C0910.3461%2C0910.0558%2C0910.5871%2C0910.5075%2C0910.3041%2C0910.4769%2C0910.2772%2C0910.4200%2C0910.5934%2C0910.2764%2C0910.3992%2C0910.5273%2C0910.5207%2C0910.3681%2C0910.0488%2C0910.3405%2C0910.1348%2C0910.4091%2C0910.5329%2C0910.0860%2C0910.4646%2C0910.5366%2C0910.1213%2C0910.5131%2C0910.1850%2C0910.1512%2C0910.5065%2C0910.1187%2C0910.3185%2C0910.3342%2C0910.4365%2C0910.4433%2C0910.4593%2C0910.0027%2C0910.0614%2C0910.3029%2C0910.0648%2C0910.5904%2C0910.1526%2C0910.2303%2C0910.3998%2C0910.5900%2C0910.3147%2C0910.5088%2C0910.2695%2C0910.5149%2C0910.0429%2C0910.3351%2C0910.5738%2C0910.2349%2C0910.2098%2C0910.3945%2C0910.0365%2C0910.5198%2C0910.2727%2C0910.5781%2C0910.3643%2C0910.4432%2C0910.5769%2C0910.0208%2C0910.2298%2C0910.3777%2C0910.2640&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Laue lenses are an emerging technology based on diffraction in crystals that\nallows the concentration of soft gamma rays. This kind of optics that works in\nthe 100 keV - 1.5 MeV band can be used to realize an high-sensitivity and\nhigh-angular resolution telescope (in a narrow field of view). This paper\nreviews the recent progresses that have been done in the development of\nefficient crystals, in the design study and in the modelisation of the answer\nof Laue lenses. Through the example of a new concept of 20 m focal length lens\nfocusing in the 100 keV - 600 keV band, the performance of a telescope based on\na Laue lens is presented. This lens uses the most efficient mosaic crystals in\neach sub-energy range in order to yield the maximum reflectivity. Imaging\ncapabilities are investigated and shows promising results."}, "authors": ["N. Barriere", "L. Natalucci", "N. Abrosimov", "P. von Ballmoos", "P. Bastie", "P. Courtois", "M. Jentschel", "J. Knodlseder", "J. Rousselle", "P. Ubertini"], "author_detail": {"name": "P. Ubertini"}, "author": "P. Ubertini", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1117/12.826138", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0910.0488v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0910.0488v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "Published in Proc. of SPIE 2009, volume 7437", "arxiv_primary_category": {"term": "astro-ph.IM", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph.IM", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0910.0488v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0910.0488v1", "journal_reference": null, "doi": "10.1117/12.826138", "fulltext": "Soft gamma-ray optics: new Laue lens design and\nperformance estimates\nNicolas M. Barrièrea , Lorenzo Nataluccia , Nikolay Abrosimovc , Peter von Ballmoosb , Pierre\nBastied , Pierre Courtoise , Michael Jentschele , Jürgen Knödlsederb , Julien Rousselleb and\nPietro Ubertinia\na INAF\n\n- IASF Roma, via Fosso del Cavaliere 100, 00133 Roma, Italy\n- UMR 5187, 9 av du Colonel Roche, 31028 Toulouse, France\nc IKZ, Max Born-Str. 2, D-12489 Berlin, Germany\nd LSP - UMR 5588, 140 Av. de la physique, 38402 Saint Martin d'Hères, France\ne ILL, 6 rue Jules Horowitz, 38042 Grenoble, France\n\narXiv:0910.0488v1 [astro-ph.IM] 2 Oct 2009\n\nb CESR\n\nABSTRACT\nLaue lenses are an emerging technology based on diffraction in crystals that allows the concentration of soft\ngamma rays. This kind of optics that works in the 100 keV - 1.5 MeV band can be used to realize an highsensitivity and high-angular resolution telescope (in a narrow field of view). This paper reviews the recent\nprogresses that have been done in the development of efficient crystals, in the design study and in the modelisation\nof the answer of Laue lenses. Through the example of a new concept of 20 m focal length lens focusing in the 100\nkeV - 600 keV band, the performance of a telescope based on a Laue lens is presented. This lens uses the most\nefficient mosaic crystals in each sub-energy range in order to yield the maximum reflectivity. Imaging capabilities\nare investigated and shows promising results.\nKeywords: Soft gamma-ray telescope; focusing gamma rays; Mosaic crystals; Bragg's diffraction; Imaging\n\n1. INTRODUCTION\nA Laue lens concentrates gamma-rays using Bragg diffraction in the volume of a large number of crystals arranged\nin concentric rings and accurately orientated in order to diffract radiation coming from infinity towards a unique\nfocal point (e.g. Ref. 1, 2). This principle is applicable from ∼ 100 keV up to 1.5 MeV, but with a unique lens\nit is difficult to cover efficiently a continuous energy band of more than about half an order of magnitude wide.\nThanks to the decoupling between collecting area and sensitive area, a Laue lens produces a dramatic increase\nof the signal to background ratio. This is the key to achieve the so awaited sensitivity leap of one - two orders of\nmagnitude with respect to past and current instruments (IBIS and SPI onboard INTEGRAL, CompTel onboard\nCGRO, BAT onboard SWIFT). Despite a Laue lens is a concentrator (i.e. not a direct imaging system) it allows\nthe reconstruction of images, as it will be shown in this paper. Finally, combined with a focal plane capable of\ntracking the various interaction of an event, the telescope becomes sensitive to the polarization: the lens being\nfully transparent to polarization3, 4 it lets the possibility to analyze it in the focal plane.\nHence a telescope featuring a Laue lens would be perfectly adapted to further our understanding of highenergy processes occurring in a variety of violent events. High sensitivity investigations of point sources such\nas compact objects, pulsars and active galactic nuclei should bring important insights into the still poorly\nunderstood emission mechanisms. Also the link between jet ejection and accretion in black hole and neutron\nstar systems could be clarified by observation of the spectral properties and polarization of the transition state\nemission. Although the search for the origin of galactic positrons is not the main driver for Laue lens design,\nthe sensitivity it provides added to its -poor- imaging capabilities could be of great help to solve this mystery.\nBy scanning potential positron emitters such as galactic black hole binary systems a telescope featuring a Laue\nFurther author information: (Send correspondence to N.B. or L.N.)\nN.B.: E-mail: nicolas.barriere{at}iasf-roma.inaf.it\nL.N.: E-mail: lorenzo.natalucci{at}iasf-roma.inaf.it\n\n\fFigure 1. Left: RC of a 23 mm thick SiGe gradient crystal at 150 keV using the 111 reflection. Diffraction efficiency\nreach 0.92, which gives a reflectivity of 0.44 once the absorption is included. The FWHM of the RC is 41 arcsec, but\nas it is visible it is convolved by the divergence of the beam which is responsible of the pyramide-like shape, instead of\nthe expected rectangular shape. Right: RC of a 9.7 mm thick Cu mosaic crystal at 500 keV using the 200 reflection.\nDiffraction efficiency reach 0.40, which gives a reflectivity of 0.20. Mosaicity determined by the fit of Darwin's model (red\nline) is 19 arcsec.\n\nlens could bring at least much stronger constraints on the population contributing to the galactic positrons and\nto their diffusion in the interstellar medium.\nThis paper reports on the current study and development status of Laue lenses. Sec. 2 proposes a review\nof the latter experimental results we obtained with high-diffraction efficiency crystals, which are the elementary\nconstituent of these lenses. Sec. 3 presents a general study of the influence of the main design parameters on\nthe resulting telescope sensitivity. Then, in Sec. 4 a 20 m focal length lens focusing between 100 and 600 keV is\npresented. Performance of the telescope are investigated, especially its sensitivity and imaging capabilities.\n\n2. OPTICS DEVELOPMENT: CRYSTALS\nSince the Gamma-Ray Imager (GRI) mission was proposed to the European Space Agency (ESA) in 20075 the\nendeavor to get efficient and reproducible crystals met some success. First of all the crystals foreseen for the\nGRI Laue lens, mosaic copper crystals and Si1−x Gex composition gradient crystals (hereafter referred to as\nSiGe crystals) were extensively studied first in the framework of a colaboration between the CESR, the ILL\nand the IKZ,6 and then in framework of a dedicated study financed by the ESA. Results are very positive and\ndemonstrate the availability and reproducibility of these two kind of crystals with bandpass of 30 arcsec (private\ncommunication). As an example Figure 1 shows two very nice rocking curves∗ (RC) recorded during experiment\nMA-717 on beamline ID15A of the European Synchrotron Radiation Facility (ESRF) on both mosaic Cu and\nSiGe gradient crystals produced recently respectively at ILL and IKZ.\nBut the scope of the search for crystals did not limit to SiGe and Cu crystals. Actually the conception of an\nefficient broad-band lens requires several different crystals in order to utilize each one only at the energy where\nit is yielding the maximum reflectivity, as shown in Ref. 7. For instance above ∼600 keV Cu crystals are not\nany more the most adapted. Instead gold or silver have a much higher potential (see Ref. 8 in this session).\nMoreover, having the choice between several proven crystals to diffract at an energy is an advantage: with various\ncrystals a given energy band can be covered from various radii of the lens, which allows some flexibility in the\ndesign process. In our search and development for 'new' crystals we identified three main drivers:\n∗\n\nA rocking curve is obtained by puting a crystal in a monochromatic beam which diffracted intensity is recorded while\nthe crystal is rocked around its Bragg angle. The same measurement is also performed using the transmitted beam in\norder to get the transmitted intensity outside of the diffraction peak (which gives us the reference value to calculate the\ndiffraction efficiency and the reflectivity).\n\n\fCrystals that cleave i.e. crystals that split along their crystalline planes. The orientation of crystals on the\nlens frame would be much facilitated with such crystals since their external faces are representative of their\ncrystalline planes (which is not the case of Cu, SiGe, Ag...). As shown in Sec. 3 the orientation accuracy\nof crystals is a major issue for the sensitivity and imaging capabilities of the telescope. Unfortunately this\nfeature seems to be associated mainly with two-components crystals† (like CaF2 , or NaCl for instance)\nwhich can be very efficient at low energy but not any more interesting above ∼400 keV.\nHigh-energy crystals. So far it seems that the best crystals to diffract above 600 keV are Pb, Ir, Pt, Au, W\nand Ta.7 The difficulty comes from the fact that these metals, except from Au and Pb have melting points\nvery elevated, which makes them difficult (and expensive) to grow with the required quality. Pb is the\nmost efficient of this group and it is cheap. But with a hardness of 1.5 Mohs, it is probably too soft to be\norientated and glued accurately. The group Pd, Rh and Ag is also interesting but yields a substantially\nlower reflectivity around 1 MeV than the previously quoted high-Z pure elements.\nCrystals having curved diffracting planes. Up to very recently, SiGe gradient crystals were the only example of crystals having curved diffracting planes (CDP crystals) that we were able to procure up. These\ncrystals are very good at low energy (i.e. between ∼100 keV and ∼300 keV) but their reflectivity falls down\nquickly as energy increases due to their low electron density. During our latter ESRF run, we measured a\nnew kind of sample that could open the way toward a new approach to get CDP crystals: the grooving of\none face of a wafer creates a convex cylindrical elastic and permanent curvature along the direction of the\ngrooves.9 This method, developed at the University of Ferrara - INFN (Ferrara, Italy) has been successfully\napplied to a 0.9 mm thick Si wafer: this very first sample yielded a reflectivity of 65% at 150 keV in a\nbandpass of 14 arcsec (Fig. 2). This reflectivity is very close to the one theoretically expected, which\nshows that the curvature of the diffracting planes is close to the ideal one. The method is very appealing\nbecause it allows a very good reproducibility of the curvature and it could be applicable on crystals having\nan higher electron density (germanium is a good candidate). However some development remains to be\ndone, especially to check that it still works on thicker samples.\nTable 2 summarizes all the investigations on crystals for a Laue lens that we made over the past 4 years.\nAll these investigations have been conducted at the ESRF (beamline ID-15A) or at ILL (instrument GAMS 4)\nusing beams energies ranging from 150 keV up to 816 keV. Figure 2 illustrates these results with three RCs: an\nhigh-energy crystal (Rh), a low-energy crystal which mass production and quality seems well controlled (GaAs10 )\nand our first prototype of grooved Si wafer.\n\n3. GENERAL DESIGN CONSIDERATIONS\nIndependently of the choice of the crystals, the performance of a Laue lens focusing in a given energy band is\ndefined by three main parameters:\n• the focal distance,\n• the size of the crystals (considering they have a square-shaped cross section),\n• the mosaicity of the crystals.\nOnce these parameters have been fixed, then the performance depends on the crystals (material and reflection)\nand on their orientation accuracy. In this section we focus on the relation between the three above mentioned\nparameters and the orientation accuracy of the crystals. In order to realize a systematic study, one shall have a\nparameter to optimize. In our case, it is the sensitivity of the resulting telescope. Disregarding the focal plane\ninstrument (i.e. considering it as ideal: pixels infinitely small and a detection efficiency equal to 1), the aim is\n†\ncrystals having more than two components have generally a large crystal cell volume which decreases dramatically\ntheir reflectivity, hence only pure elements and two-components crystals are potentially interesting for a Laue lens.\n\n\fMaterial\nCu\n\nCrystal\ntype\nmosaic\n\nOrigin\nsamples\nILL\n\nof\n\nSample\n\nQualitative results\n\nSeveral tens of pieces of\nvarious size\n\nSome inhomogeneities in ingots, but mosaicity range is alright (between 15 arcsec\nand 2 arcmin) and quality is good.\nHomogeneity in ingots is not perfect but\nmosaicity range is alright.\n\nGe1−x Six\n\nmosaic\n\nIKZ\n\nAg\n\nmosaic\n\nMaTecKa\n\n556 pieces were mounted\non the CLAIRE lens prototype11\n6 pieces + 1 ingot\n\nAu\nPt\n\nmosaic\nmosaic\n\nMaTecK\nMaTecK\n\n3 pieces\n1 piece\n\nRh\n\nmosaic\n\nMaTecK\n\nPb\n\nmosaic\n\nMaTecK\n\nInP\nGaAs\n\nmosaic\nmosaic\n\nLPCMLb\nIMEMc\n\n4 pieces + 1 ingot: 50\nmm long, 12 mm diam.\n1 ingot: 50 mm long, 12\nmm diam.\n1 wafer, 1 mm thick\n5 pieces\n\nCZT\n\nmosaic\n\nIMEM\n\n1 piece\n\nCaF2\n\nmosaic\n\nLPCML\n\n1 piece\n\nSiGe gradient\n\nCDP\n\nIKZ\n\nSeveral tens of pieces\n\nSi grooved\n\nCDP\n\nUniv.\nFerrara - INFNd\n\n1 piece\n\nMeasured mosaicity ranges between 15 and\n60 arcsec. Good quality crystals.\nVery positive results, see Ref. 8\nMosaicity of the order of 1 degree, this\nsample was not good.\nCrystals were not homogeneous but some\npart had a mosaicity as low as 30 arcsec.\nCrystal twisted, very broad mosaicity (¿ 1\ndegree).\nVery nice homogeneity and low mosaicity.\nGood homogeneity, mosaicity as low as 15\narcsec\nBad homogeneity, multigrain, mosaicity of\n∼ 3 arcmin.\nMosaicity ranged between 0.6 and 6 arcmin\ndepending on the reflection considered.\nBandpass is controlled during the growth,\nquality is excellent.\nVery high reflectivity measured for the\nvery first try, very encouraging.\n\na\n\nMaTecK GmbH, Im Langenbroich 20, D-52428 Juelich, Germany\nLPCML - Univ Claude Bernard Lyon I, 22 av. G. Berger, 69622 Villeurbanne, France\nc\nIMEM-CNR, Parco Area delle Scienze 37/A, 43010 Parma, Italy\nd\nUniversity of Ferrara - INFN, Via Saragat 1/C, 44100 Ferrara, Italy\nb\n\nTable 1. Qualitative overview of experimental results obtained with crystals potentially interesting for a Laue lens.\n\nto put the maximum signal in the smallest area. Doing the assumption that the instrumental background is\nuniform over the detector plane, the detection significance of a given source is proportional to:\nAef f ǫf s\nnσ ∝ √\nAin\n\n(1)\n\nwith Aef f the effective area of the lens, ǫf s the fraction of the signal that should be taken into account and Ain\nthe area of the focal plane delimiting\n√ the fraction ǫf s of the signal. ǫf s and Ain are linked and are calculated in\norder to maximize the ratio ǫf s / Ain .\nSince the lens has a rotational symmetry (with the line of sight as axis), the point spread function (PSF)\nhave the same symmetry and consequently Ain is a disc. So instead of considering the square root of the area\non the focal plane, we can consider the radius of the disc rin .\nThus for any lens configuration that we explore, the PSF is computed and the so-called factor of merit (FM)\nis extracted:\nFM =\n\nAef f ǫf s\n.\nrin\n\n(2)\n\nOn this purpose a semi-analytic code (non Monte-Carlo) has been developed in order to be able to explore a lot\nof configurations in an acceptable computing time (typically a few seconds per configuration).\n\n\fFigure 2. Left: RC of a 10 mm thick Rh crystal at 700 keV using the 220 reflection. Diffraction efficiency reach 0.33, which\ngives a reflectivity of 0.14 once the absorption is included. This low reflectivity is explained by an over-thickness and by\nthe fact the 220 reflection is not the most efficient. The important here is the low mosaicity of 30 arcsec and the very nice\nagreement with Darwin's model (red line). Centre: RC of a 25 mm thick GaAs crystal at 200 keV using the 220 reflection.\nDiffraction efficiency reaches its theoretical maximum of 50% and the curve is flat-toped because of the too large thickness\n(with respect to its mosaicity of 29 arcsec and the energy of measurement). Including the absorption, the reflectivity is\n6.5 %. Again, there is a very good agreement with Darwin's model (red line). Right: RC of the first prototype of grooved\nSi wafer. Diffraction takes place on the (curved) (111) planes across the 10 mm width of the sample. Measurements are\ndone at 150 keV, the diffraction efficiency is 0.9 which gives a reflectivity of 0.65. The curved is rectangular shaped as\nexpected in the case of CDP crystals, with a width of 14 arcsec.\n\nTo study in a systematic manner the evolution of FM, we have considered always the same objective: to focus\nin the 300 keV - 400 keV energy band with Cu mosaic crystals using the 111 reflection (with the mean size of the\ncrystallites equal to 50 μm). Depending on the focal distance and on the crystals size, the code determines the\nnumber of rings to be filled with the Cu crystals and their radii. Once the lens is fixed, the PSF is computed.\nIn the first case, the size of the crystals have been fixed to 15 x 15 mm2 , and we investigate the evolution\nof FM with the focal distance for four mosaicity values. Figure 3 presents the results in two cases: in the left\npanel, crystals are ideally orientated while in the right panel their orientation is distributed around the ideal\nvalue according to a Gaussian of 30 arcsec of standard deviation (σ). Two points are clearly striking: i) in any\ncase the longer focal distance produces the most sensitive telescope. However it has to be balanced with the\nfact that a longer focal distance requires more crystals and consequently is more expensive and more heavy. ii)\nIn the ideal case, the smaller mosaicity is the best, but in a more realistic case where crystals are not perfectly\noriented, this is no longer true. Crystals having a larger mosaicity diffracts more signal (the effective area of\nthe lens grows with the mosaicity of crystals). But in the case of a non-ideal lens, the mosaicity of crystals does\nnot influence any more the sensitivity, at least in a range of mosaicity going up to to 3-4 σ (in this case, it is\nprobably not a general rule). Thus better consider the highest mosaicity which does not decrease the sensitivity,\nsince it allows more signal on the focal plane. Moreover crystals having a larger mosaicity are generally easier to\nproduce (not true in the case of CDP crystals though). Consequently it is very important to anticipate properly\nthe orientation precision achievable, in order to determine accordingly the best compromise for the mosaicity.\nAs a second step, the focal length has been fixed to 20 m (see Sec. 4) and the influence of crystals mosaicity\nand size is investigated. Again the both case of ideally orientated crystals and crystals slightly disoriented\n(Gaussian distribution around the nominal angle, with a standard deviation of 30 arcsec) are considered. Figure\n4 presents the results. In the left panel (ideal case) one sees that the highest FM is yielded by the smallest\ncrystals with the smallest mosaicity. On the other hand in the right panel (degraded case) the maximum factor\nof merit is much more broad and shifted towards larger mosaicity and size. It is important to notice that both\nplots (Figure 4 left and right) don't have the same scale: The maximum FM in the ideal case is more than\n50% higher than in the degraded case. This study shows the importance of crystals orientation accuracy for the\nresulting telescope sensitivity. Two European teams are currently addressing this issue, one in France (see Ref.\n8) and the other in Italy (see Ref. 12). Their goal is to reach a precision of the order of 10 arcsec.\n\n\fFigure 3. Factor of merit versus the lens focal length for four crystals mosaicity values (30, 60, 90 and 120 arcsec). The\nleft panel shows the case of ideally oriented crystals while the right panel shows degraded case where crystals' orientations\nare distributed around their nominal angles according to a Gaussian statistics of 30 arcsec of standard deviation.\n\nFigure 4. Maps of factor of merit as a function of crystals mosaicity and size. The focal length is fixed to 20 m. Like\nin Figure 3 the left panel presents the case of crystals ideally orientated while the right panel shows the case of crystals\norientation is distributed around their nominal angle according to a gaussian statistics of 30 arcsec of standard deviation.\n\n4. A 20 M FOCAL LENGTH TELESCOPE\n4.1 Presentation\nWould it be possible to build an efficient focusing telescope to study non-thermal emission processes in compact\nobjects, nuclear decay lines in novae and electron - positron (e+ - e− ) annihilation without requiring two satellite\nflying in formation? It is in the idea of answering this question that the lens presented in this section has been\ndesigned. As a results, we obtained a lens focusing between 100 keV and 600 keV with a focal length of 20 m,\nmaking use of a large variety of crystals in order to yield the best reflectivity in each energy sub-range. The\nlens is composed of about 20 000 crystal tiles of 15 x 15 mm2 each and of thickness calculated to maximize the\nreflectivity (depending on the crystalline material, the reflection and the energy it diffracts). Crystals selected\nfor this lens are Ge, Cu, Ag, CaF2 , V, and Mo. They are all mosaic crystals with a mosaicity of 2 arcmin. Figure\n5 shows the distribution of the crystals over the rings and the effective area it produces. The contribution to\n\n\fFigure 5. Left. Effective area of the lens. Colors show the contribution of each material. Right. Distribution of the various\ncrystals and reflections over the concentric rings that compose the lens.\n\nthe total effective area of each material and reflection is plotted with dedicated colors. The effective area equals\n270 cm2 at 100 keV and decreases down to ∼ 130 cm2 at 500 keV to finally fall under 45 cm2 beyond 600 keV\n(which is not negligible, considered the area of the focal spot, see next section).\nTable 4.1 gives numerical parameters of the lens design. The crystals cover a disc of about 4.5 m2 area. Based\non the former studies of mission featuring a Laue lens (MAX13 and GRI5 ), the weight of the lens structure can\nbe evaluated to ∼ 70 kg/m2 . It results that our lens, crystals and carrying structure included would weigh ∼ 470\nkg. The focal distance could be achieved by an extensible boom, which allows the telescope to fit in the envelop\nof a medium size mission.\nFocal distance (m)\nMosaicity of crystals (arcmin)\nTotal number of crystals\nTotal crystal mass (kg)\nInner radius (m)\nOuter radius (m)\nCollecting area (m2 )\n\n20\n2\n20 000\n150\n0.125\n1.285\n4.5\n\nTable 2. Parameters of the 20 m focal length Laue lens.\n\nCrystals used in this design were studied theoretically7 , but not all of them have yet proved experimentally\nto be obtainable with the proper quality: V and Mo have not been measured and we measured only one sample\nof CaF2 so far. But the interest of this design is that its performance is robust: 120 arcsec of bandpass is not\na tight constraint for mosaic crystal. But more importantly with 15 x 15 mm2 crystals and a mosaicity of 120\narcsec, the lens performance won't degrade if an orientation accuracy of σ ≤ 30 arcsec (Gaussian distribution)\ncan be achieved, which does not seem out of reach (See Ref. 12 in this session).\n\n4.2 Performance estimates\nThe sensitivity estimate is calculated considering a 10 x 10 cm2 focal plane made of 3 stacked pixellated CdTe\nor CdZnTe layers. Pixels size are 1.6 x 1.6 mm2 , and each layer measures 20 mm thick and is segmented in four\npseudo-layers. This focal plane instrument is directly inspired from the one that was proposed for the GRI, at\nthe difference that in the present case it is smaller (see Ref. 14). Background level has been scaled down by a\n\n\fFigure 6. Left. 3σ continuum sensitivity (∆E = E/2) of the telescope for 100 ks observation time. See text for details.\nRight. PSF of the lens for a point source on-axis. rin is equal to 10.6 mm and encircles ǫf s = 59% of the total signal (see\nSec. 3 for the definitions of rin and ǫf s ).\n\nfactor of three from INTEGRAL/ISGRI measured instrumental background to take into account a low Earth\norbit and a smaller satellite (L. Natalucci, private communication).\nFigure 6 shows the resulting 3σ sensitivity for a continuum (∆E = E/2) in 100 ks exposure time. It starts\nfrom 2 x 10−7 ph/s/cm2 /keV at 100 keV and reach 6 x 10−8 ph/s/cm2 /keV at 500 keV.\nLooking at the PSF (Fig. 6, right panel) and the size of the focal plane instrument, one can expect a field\nof view of 13 arcmin (FWHM) and an angular resolution of ∼ 3.5 arcmin. This quite coarse angular resolution\nwith respect to the one foreseen for the GRI mission is due to the fact that in the present case the ratio crystal\nsize to focal distance is five times higher. However, in this energy range this performance would constitute a\nsizable step forward with respect to currently operating missions. We shall precise that the performance of Laue\nlens telescopes could even be enhanced if a Compton telescope is put at the focus.15 It this case it has been\nshown that the background rejection is improved leading to a sensitivity increased by a factor of two. On the\nother hand, if the first layers of the focal plane Compton camera are made of Silicon, it allows polarization\nmeasurement down to ∼ 100 keV.\nA simulation code is currently being developed to deepen our understanding of the imaging capabilities of\nLaue lenses. A quite simple version based on maximum likelihood analysis of the focal plane is giving its first\nresults. So far it permits to find easily a point source in the field of view (blind search, no information on the\nsource position or flux is provided), and to reconstruct the image of an extended emission if several pointings are\ncombined. Future work includes the development of an Iterative Removal of Source (IROS) algorithm to handle\nseveral point sources in a single pointing and a proper background removal method.\n\nFigure 7 presents the case of the observation during 100 ks in the 100 keV - 150 keV range of a single point\nsource that emits a flux of 1 mCrab. Instrumental background on the focal plane is kept as defined previously\nin this section. The left panel of Figure 7 shows the case where the source is lying on the line of sight of the\ntelescope. In this case it is very well detected with of confidence level of 18 σ (contours shows step of 2 σ), and\nquite well located within ∼ 1 arcmin. The central panel shows the case where the source is placed 3 arcmin\noff-axis. Here a rotational degeneracy appears in its positionning, but the source is still detected with a level\nof confidence of 11 σ. The last case (right panel of Fig. 7) illustrates that the degeneracy can be limited by\na dedicated observation strategy. In this case, the exposure time has been shared in two pointings directed 3\narcmin and 5 arcmin far from the source. Detection significance falls to 7.5 σ but the positioning of the source\nis improved.\n\n\fFigure 7. Detection significance of a point source having a flux of 1 mCrab (placed aarbitrarily at the Galactic center).\nEach map extends over 20 x 20 arcmin and each bin measures 20 x 20 arcsec. Contours show step of 2 σ. See text for\ndetails\n\nFinally, the observation of an extended region emitting in the e+ - e− line at 511 keV is simulated. We\nconsidered a dummy source having a bi-dimensional Gaussian shape (standard deviation of 2 arcmin x 7 arcmin)\ninclined of 45◦ from the plane of the instrument, with a total integrated flux of 1 x 10−4 ph/s/cm2 in a 2 keV\nwide line. A spectral resolution of 2% and a background level of 1.3 x 10−4 cts/s/cm3 /keV are assumed for the\nfocal plane detector at 511 keV. It results a background count rate of 1.3 x 10−3 cts/s/cm3 in the line, uniformly\ndistributed (Poisson statistics) over the pixels of the focal plane.\nTo resolve the structure of the emission, it is necessary to divide the observation time in many pointings to\nbreak the degeneracy due to the small asymmetry of the lens response for off-axis sources. Figure 8 shows the\nreconstructed image of the sky, the dithering pattern that has been used for the observation (for a total exposure\ntime of 500 ks) and the contours of the original dummy extended source. Despite the strong background the\nshape of the source is quite well reconstructed. The center of the source is detected with a significance of 9.5\nσ. This study demonstrates the imaging capabilities of Laue lenses, which can cover objects of a few arcmin of\nspatial extent with an angular resolution of the order of 3 arcmin in the case of the lens presented in this paper.\n\n5. CONCLUSION\nThanks to the Italian and French endeavor, Laue lenses are becoming a reality. The activities for the development\nof efficient crystals has already proven that Cu and SiGe crystals could be produced with the proper quality and\nbandpass range (mosaicity). Our latter experiments at ESRF and ILL showed that other materials like Ag, Au,\nRh and GaAs are very good candidates to enlarge our portfolio of qualified crystals. Recently, the technique of\ngrooved crystals opened a new path to realize CDP crystals with very promising results.\nIn the meantime the study of Laue lenses design make also progresses. We have used these knowledge to\ndesign a robust lens focusing in the 100 keV - 600 keV range. Despite the fact it is based on crystals not all\nproved yet, the size of crystals, their mosaicity, and the focal length of 20 m make this lens does not seem out\nof reach considering the currently available technology. One important point is that the performance presented\nin this paper - a sensitivity better than 2 x 10−7 ph/s/cm2 /keV for 100 ks exposure - is not sensitive to the\norientation precision of crystals, provided it stays within a gaussian distribution of σ = 30 arcsec. This constraint\nis much relaxed with respect to the goals of the two current teams building Laue lens prototypes (Ref. 8 and 12,\nthis session).\nThe recent investigations on imaging capabilities confirm that it is possible to perform high angular resolution\nimaging with Laue lenses, despite they are not direct imaging optics.\n\nACKNOWLEDGMENTS\nNB and LN are grateful to ASI for the support of Laue lens studies through grant I/088/06/0.\n\n\fFigure 8. Detection significance of a (dummy) extended source having a total flux of 1 x 10−4 ph/s/cm2 in a narrow line\ncentered on 511 keV. The contours show the original source shape, and the crosses shows the pointings composing the\nobservation pattern. The sky map extends over 20 x 20 arcmin , and each bin measures 20 x 20 arcsec.\n\nREFERENCES\n[1] Lund, N., \"A study of focusing telescopes for soft gamma rays,\" Experimental Astronomy 2, 259–273 (1992).\n[2] Halloin, H. and Bastie, P., \"Laue diffraction lenses for astrophysics: Theoretical concepts,\" Experimental\nAstronomy 20, 151–170 (2005).\n[3] Barrière, N., Natalucci, L., and Ubertini, P., \"Soft gamma-ray polarimetry using a laue lens telescope: The\ngamma-ray imager,\" Proc. of Sciences PoS(CRAB2008)019 (2008).\n[4] Curado da Silva, R. M., Caroli, E., Stephen, J. B., Pisa, A., Auricchio, N., Del Sordo, S., Frontera, F.,\nHonkimäki, V., Schiavone, F., Donati, A., Trindade, A. M. F., and Ventura, G., \"Polarimetric performance\nof a Laue lens gamma-ray CdZnTe focal plane prototype,\" Journal of Applied Physics 104(8), 084903–+\n(2008).\n[5] Knödlseder, J., von Ballmoos, P., Frontera, F., Bazzano, A., Christensen, F., Hernanz, M., and Wunderer,\nC., \"GRI: focusing on the evolving violent universe,\" Experimental Astronomy 23(1), 121–138 (2009).\n[6] Barrière, N., von Ballmoos, P., Bastie, P., Courtois, P., Abrosimov, N. V., Andersen, K., Buslaps, T.,\nCamus, T., Halloin, H., Jentschel, M., Knödlseder, J., Roudil, G., Serre, D., and Skinner, G. K., \"R&D\nprogress on second-generation crystals for Laue lens applications,\" Proc. SPIE 6688, 66880O (2007).\n[7] Barrière, N., Rousselle, J., von Ballmoos, P., Abrosimov, N. V., Courtois, P., Bastie, P., Camus, T.,\nJentschel, M., Kurlov, V. N., Natalucci, L., Roudil, G., Brejnholt, N. F., and Serre, D., \"Experimental\nand theoretical study of diffraction properties of various crystals for the realization of a soft gamma-ray laue\nlens,\" Journal of Applied Crystallography (2009).\n[8] Rousselle, J., von Ballmoos, P., Barrière, N., Abrosimov, N. V., Bastie, P., Bonnetto, G., Camus, T.,\nCourtois, P., Jentschel, M., Lecomte, E., and Roudil, G., \"High-z crystals for gamma-ray optics,\" Proc.\nSPIE 7437 (2009).\n[9] Bellucci, S., Bini, S., Biryukov, V. M., Chesnokov, Y. A., Dabagov, S., Giannini, G., Guidi, V., Ivanov,\nY. M., Kotov, V. I., Maisheev, V. A., Malagù, C., Martinelli, G., Petrunin, A. A., Skorobogatov, V. V.,\nStefancich, M., and Vincenzi, D., \"Experimental Study for the Feasibility of a Crystalline Undulator,\"\nPhysical Review Letters 90(3), 034801–+ (2003).\n[10] Ferrari, C., Zanotti, L., Zappettini, A., and Arumainathan, S., \"Mosaic GaAs crystals for hard x-ray\nastronomy,\" Proc. SPIE 7077, 70770O (Aug. 2008).\n\n\f[11] von Ballmoos, P., Halloin, H., Evrad, J., Skinner, G., Abrosimov, N., Alvarez, J., Bastie, P., Hamelin,\nB., hernanz, M., Jean, P., Knödlseder, J., and Smither, R. K., \"Claire: First light for a gamma-ray lens,\"\nExperimental Astronomy 20, 253–267 (2005).\n[12] Guidorzi, C., Frontera, F., Loffredo, G., Virgilli, E., Ferrari, F., Nobili, F., Carassiti, V., Evangelisti, F.,\nLandi, L., Squerzanti, S., Caroli, E., Stephen, J. B., Andersen, K. H., Courtois, P., Auricchio, N., Schiavone,\nF., and basili, A., \"New results on focusing of gamma-rays with laue lenses,\" Proc. SPIE 7437 (2009).\n[13] Duchon, P., \"MAX: Formation flying for nuclear astrophysics,\" Experimental Astronomy 20, 483–495 (2005).\n[14] Natalucci, L., Alvarez, J. M., Barrière, N., Caroli, E., Curado da Silva, R. M., del Sordo, S., di Cosimo, S.,\nFrutti, M., Hernanz, M., Lozano, M., Quadrini, E., Pellegrini, G., Stephen, J. B., Ubertini, P., Uslenghi,\nM., and Zoglauer, A., \"CdZnTe detector for hard X-ray and low energy gamma-rays focusing telescope,\"\nProc. SPIE 7011, 70111S (2008).\n[15] Weidenspointner, G., Wunderer, C. B., Barrière, N., Zoglauer, A., and Ballmoos, P. V., \"Monte Carlo study\nof detector concepts for the MAX Laue lens gamma-ray telescope,\" Experimental Astronomy 20, 375–386\n(2005).\n\n\f"}