{"id": "http://arxiv.org/abs/1110.4948v1", "guidislink": true, "updated": "2011-10-22T05:21:44Z", "updated_parsed": [2011, 10, 22, 5, 21, 44, 5, 295, 0], "published": "2011-10-22T05:21:44Z", "published_parsed": [2011, 10, 22, 5, 21, 44, 5, 295, 0], "title": "Evolution of Supernova Remnants Expanding out of the Dense Circumstellar\n  Matter into the Rarefied Interstellar Medium", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1110.5160%2C1110.4734%2C1110.0737%2C1110.3509%2C1110.3921%2C1110.4731%2C1110.1162%2C1110.1550%2C1110.0240%2C1110.3580%2C1110.4164%2C1110.6158%2C1110.0625%2C1110.6615%2C1110.4911%2C1110.5864%2C1110.1125%2C1110.4537%2C1110.0421%2C1110.0579%2C1110.4005%2C1110.1562%2C1110.2642%2C1110.4093%2C1110.6294%2C1110.0527%2C1110.3962%2C1110.2006%2C1110.5903%2C1110.2665%2C1110.0765%2C1110.1065%2C1110.0541%2C1110.6643%2C1110.5108%2C1110.1409%2C1110.1995%2C1110.3885%2C1110.6485%2C1110.3540%2C1110.1949%2C1110.3584%2C1110.4360%2C1110.1487%2C1110.1686%2C1110.3763%2C1110.0512%2C1110.5942%2C1110.3165%2C1110.6221%2C1110.1682%2C1110.4775%2C1110.1464%2C1110.3609%2C1110.0522%2C1110.6251%2C1110.6404%2C1110.6022%2C1110.4293%2C1110.1641%2C1110.4883%2C1110.5243%2C1110.0091%2C1110.6088%2C1110.0448%2C1110.4948%2C1110.0396%2C1110.4755%2C1110.1772%2C1110.3670%2C1110.1947%2C1110.6351%2C1110.4797%2C1110.6583%2C1110.2546%2C1110.1565%2C1110.3527%2C1110.5377%2C1110.5739%2C1110.0467%2C1110.3930%2C1110.2084%2C1110.3639%2C1110.1053%2C1110.3588%2C1110.3330%2C1110.4954%2C1110.3413%2C1110.3236%2C1110.4439%2C1110.6007%2C1110.0488%2C1110.6603%2C1110.2979%2C1110.2288%2C1110.4832%2C1110.1697%2C1110.4362%2C1110.0327%2C1110.3473%2C1110.3601&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Evolution of Supernova Remnants Expanding out of the Dense Circumstellar\n  Matter into the Rarefied Interstellar Medium"}, "summary": "We carry out 3D-hydrodynamical calculations for the interaction of expanding\nsupernova ejecta with the dense circumstellar matter (CSM) and the rarefied\ninterstellar medium (ISM) outside. The CSM is composed of the stellar wind\nmatter from the progenitor in its pre-supernova phase, and assumed to be\naxially symmetric: more matter around the equator than in the polar direction\ndriven by rotation of the progenitor. Because of high density of the CSM, the\nionization state of the shock-heated ejecta quickly becomes equilibrium with\nthe electron temperature. When the blast wave breaks out of the CSM into the\nrarefied ISM, the shocked ejecta cools rapidly due to adiabatic expansion, and\nhence an over-ionized/recombining plasma would be left. The ejecta is reheated\nby the second reverse shock due to the interaction with the ISM. We calculate\nthe emission measure of the supernova remnant (SNR) along the line of sight,\nand find that the over-ionized plasma appears to be bar-like with wings in the\nedge-on (equatorial view), while shell-like in the face-on (polar view)\ngeometry with respect to the rotation axis. The hot gas heated by the blast\nwave exists in the outermost region of the SNR with a nearly complete shell,\nbut the X-rays therefrom are too faint to be observable. Thus, depending on the\nviewing angle, the SNR of the over-ionized plasma would exhibit center-filled\nmorphology in X-rays, like W49B, a mixed-morphology SNR. The bar-like structure\nis swept out by the second reverse shock and disappears eventually, and then\nthe SNR becomes shell-like in both the equatorial and polar views in the later\nphase of the evolution.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1110.5160%2C1110.4734%2C1110.0737%2C1110.3509%2C1110.3921%2C1110.4731%2C1110.1162%2C1110.1550%2C1110.0240%2C1110.3580%2C1110.4164%2C1110.6158%2C1110.0625%2C1110.6615%2C1110.4911%2C1110.5864%2C1110.1125%2C1110.4537%2C1110.0421%2C1110.0579%2C1110.4005%2C1110.1562%2C1110.2642%2C1110.4093%2C1110.6294%2C1110.0527%2C1110.3962%2C1110.2006%2C1110.5903%2C1110.2665%2C1110.0765%2C1110.1065%2C1110.0541%2C1110.6643%2C1110.5108%2C1110.1409%2C1110.1995%2C1110.3885%2C1110.6485%2C1110.3540%2C1110.1949%2C1110.3584%2C1110.4360%2C1110.1487%2C1110.1686%2C1110.3763%2C1110.0512%2C1110.5942%2C1110.3165%2C1110.6221%2C1110.1682%2C1110.4775%2C1110.1464%2C1110.3609%2C1110.0522%2C1110.6251%2C1110.6404%2C1110.6022%2C1110.4293%2C1110.1641%2C1110.4883%2C1110.5243%2C1110.0091%2C1110.6088%2C1110.0448%2C1110.4948%2C1110.0396%2C1110.4755%2C1110.1772%2C1110.3670%2C1110.1947%2C1110.6351%2C1110.4797%2C1110.6583%2C1110.2546%2C1110.1565%2C1110.3527%2C1110.5377%2C1110.5739%2C1110.0467%2C1110.3930%2C1110.2084%2C1110.3639%2C1110.1053%2C1110.3588%2C1110.3330%2C1110.4954%2C1110.3413%2C1110.3236%2C1110.4439%2C1110.6007%2C1110.0488%2C1110.6603%2C1110.2979%2C1110.2288%2C1110.4832%2C1110.1697%2C1110.4362%2C1110.0327%2C1110.3473%2C1110.3601&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We carry out 3D-hydrodynamical calculations for the interaction of expanding\nsupernova ejecta with the dense circumstellar matter (CSM) and the rarefied\ninterstellar medium (ISM) outside. The CSM is composed of the stellar wind\nmatter from the progenitor in its pre-supernova phase, and assumed to be\naxially symmetric: more matter around the equator than in the polar direction\ndriven by rotation of the progenitor. Because of high density of the CSM, the\nionization state of the shock-heated ejecta quickly becomes equilibrium with\nthe electron temperature. When the blast wave breaks out of the CSM into the\nrarefied ISM, the shocked ejecta cools rapidly due to adiabatic expansion, and\nhence an over-ionized/recombining plasma would be left. The ejecta is reheated\nby the second reverse shock due to the interaction with the ISM. We calculate\nthe emission measure of the supernova remnant (SNR) along the line of sight,\nand find that the over-ionized plasma appears to be bar-like with wings in the\nedge-on (equatorial view), while shell-like in the face-on (polar view)\ngeometry with respect to the rotation axis. The hot gas heated by the blast\nwave exists in the outermost region of the SNR with a nearly complete shell,\nbut the X-rays therefrom are too faint to be observable. Thus, depending on the\nviewing angle, the SNR of the over-ionized plasma would exhibit center-filled\nmorphology in X-rays, like W49B, a mixed-morphology SNR. The bar-like structure\nis swept out by the second reverse shock and disappears eventually, and then\nthe SNR becomes shell-like in both the equatorial and polar views in the later\nphase of the evolution."}, "authors": ["Takafumi Shimizu", "Kuniaki Masai", "Katsuji Koyama"], "author_detail": {"name": "Katsuji Koyama"}, "author": "Katsuji Koyama", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1093/pasj/64.2.24", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1110.4948v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1110.4948v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "8 pages, 9 figures, accepted for publication in PASJ", "arxiv_primary_category": {"term": "astro-ph.HE", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph.HE", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1110.4948v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1110.4948v1", "journal_reference": null, "doi": "10.1093/pasj/64.2.24", "fulltext": "PASJ: Publ. Astron. Soc. Japan , 1–??,\nc 2018. Astronomical Society of Japan.\n\nEvolution of Supernova Remnants Expanding out of the Dense\nCircumstellar Matter into the Rarefied Interstellar Medium\nTakafumi Shimizu1 , Kuniaki Masai1 , and Katsuji Koyama2\n\narXiv:1110.4948v1 [astro-ph.HE] 22 Oct 2011\n\n1\n\nDepartment of Physics, Tokyo Metropolitan University, 1-1 Minami-Ohsawa, Hachioji, Tokyo 192-0397\nt-shimizu@phys.se.tmu.ac.jp\n2\nDepartment of Physics, Kyoto University, Kitashirakawa-Oiwake-cho, Sakyo-ku, Kyoto 606-8502\n(Received 2011 July 19; accepted 2011 October 5)\n\nAbstract\nWe carry out 3D-hydrodynamical calculations for the interaction of expanding supernova ejecta with\nthe dense circumstellar matter (CSM) and the rarefied interstellar medium (ISM) outside. The CSM\nis composed of the stellar wind matter from the progenitor in its pre-supernova phase, and assumed to\nbe axially symmetric: more matter around the equator than in the polar direction driven by rotation\nof the progenitor. Because of high density of the CSM, the ionization state of the shock-heated ejecta\nquickly becomes equilibrium with the electron temperature. When the blast wave breaks out of the CSM\ninto the rarefied ISM, the shocked ejecta cools rapidly due to adiabatic expansion, and hence an overionized/recombining plasma would be left. The ejecta is reheated by the second reverse shock due to the\ninteraction with the ISM. We calculate the emission measure of the supernova remnant (SNR) along the line\nof sight, and find that the over-ionized plasma appears to be bar-like with wings in the edge-on (equatorial\nview), while shell-like in the face-on (polar view) geometry with respect to the rotation axis. The hot\ngas heated by the blast wave exists in the outermost region of the SNR with a nearly complete shell, but\nthe X-rays therefrom are too faint to be observable. Thus, depending on the viewing angle, the SNR of\nthe over-ionized plasma would exhibit center-filled morphology in X-rays, like W49B, a mixed-morphology\nSNR. The bar-like structure is swept out by the second reverse shock and disappears eventually, and then\nthe SNR becomes shell-like in both the equatorial and polar views in the later phase of the evolution.\nKey words: hydrodynamics - stars: circumstellar matter - ISM: supernova remnants - methods: numerical\n1.\n\nIntroduction\n\nEvolution of a supernova remnant (SNR) with no neutron star in its center is described essentially by the shock\nwaves propagating outward (blast wave) into the ambient matter and inward (reverse-shock wave) into the supernova ejecta. In young SNRs, the shocked matter is\nheated up to temperatures higher than 107 K and forms\nan optically-thin hot plasma. This plasma emits X-rays\nwith many emission lines of highly-ionized heavy elements.\nSince the time-scale of ionization by electron impact is\nlonger than that of shock-heating of electrons, X-ray spectra of young SNRs exhibit ionization states lower than\nthose expected from the electron temperatures, which is\ncalled under-ionized or ionizing. The ionization state is\nrepresented by ionization temperature Tz , the plasma temperature in collisional ionization equilibrium having the\nrelevant ionization state. Thus, many of young SNRs show\nTz < Te (under-ionized/ionizing) for the electron temperature Te .\nOn the contrary to the above standard scenario,\nKawasaki et al. (2002) found an over-ionized plasma (Tz >\nTe ) in the ASCA observation from a mixed-morphology\nSNR, IC443. They proposed that thermal conduction\nfrom the hot interior of the remnant to the cold exterior can explain the over-ionized plasma. Kawasaki et al.\n\n(2005) further investigated other five mixed-morphology\nSNRs, W49B, W28, W44, 3C 391 and Kes 27, and found\nthat W49B shows Tz > Te as well.\nSuzaku detected clear spectral structures of radiativerecombination continua, direct evidence for recombining\nplasmas, in the X-ray spectra of IC443 (Yamaguchi et al.\n2009) and W49B (Ozawa et al. 2009). Radiative recombination continua, and hence an over-ionized plasma is\nalso found in another mixed-morphology SNR, G359.1–0.5\n(Ohnishi et al. 2011). Although the samples are still limited, the over-ionized plasmas are all found in the mixedmorphology SNRs associated in or near the star-forming\ncomplex with H II regions and molecular clouds. Hence\nthese SNRs are likely due to core-collapse supernovae; the\nover-ionized plasma is possibly related to the massive progenitor and/or its environments.\nOne possibility is that the ionization by photons of a few\ntens keV at the initial phase of explosion of massive stars,\ne.g., possible X-ray flash or afterglow of γ-ray bursts, is\nresponsible for the over-ionized state. Another possibility\nis rarefaction in the adiabatic evolution phase of the SNR;\nwhen the shock wave breaks out of the dense circumstellar matter (CSM), like the progenitor's stellar wind, into\nthe rarefied interstellar medium (ISM), the shock-heated\nelectrons would rapidly cool due to adiabatic expansion,\nleaving highly ionized states (Itoh & Masai 1989).\n\n\f2\n\nT. Shimizu, K. Masai, & K. Koyama\n\nIn the present paper, we investigate the latter possibility. Itoh & Masai (1989) calculated SNR evolution and\nradiation for a spherically symmetric structure. We extend this work to non-symmetric structures as are found\nin mixed-morphology SNRs. Unlike Itoh & Masai (1989),\nwe do not take ionization or radiation processes into account; we assume the relevant SNR evolution is fully adiabatic. We describe the model in the following section,\ncalculation and results in Section 3, and discuss the results in Section 4. We give a summary in section 5 and\nnotes about electron temperature in Appendix.\n\n[Vol. ,\n\nB1 Same as A2, but with a lower density ISM.\nB2 Same as B1, but with a higher wind velocity.\nThe numerical values for each model are shown in Table\n1, where values of Rin , Rout , ρin and ρout are those on\nthe equatorial plane. The mass-loss rate is assumed to be\n5 × 10−5 M⊙ yr−1 , the same as Itoh & Masai (1989), for\nall the models.\n\nISM\nModel\n\n2.1.\n\nPolar axis\n\n2.\n\nCircumstellar matter\n\nIn a core-collapse supernova, the massive progenitor\n(red or blue supergiant or Wolf-Rayet star) is expected\nto blow a strong stellar wind in its pre-supernova phase\nand forms dense CSM around the progenitor. If the stellar wind is spherically symmetric with a mass-loss rate Ṁ\nand wind velocity vw , the CSM density ρ at a distance r\nfrom the progenitor is given by\nṀ\n.\n(1)\n4πvw r2\nFor a while before supernova explosion, the stellar wind\nceases. Then the stellar wind forms a thick shell. The\ninner and outer radii of the shell are given by Rin = vw te\nand Rout = vw (tw + te ), respectively (see Figure 1), where\ntime tw and te are the duration of the wind activity and\nthe elapsed time after the cease of the wind, respectively.\nIn realistic stellar winds, more matter around the equatorial plane than the polar direction may be accumulated,\nbecause of the rotation of the progenitor; disk-like winds\nof Be stars for an extreme example. We thus modify Eq.\n(1) as,\n\n2 2 1/2\n\nRin ≤ (x + y + a z )\n\nFig. 1. Schematic picture of initial configurations for the interaction of the supernova ejecta with CSM. The broken and\nsolid lines of the ejecta represent the radii of the core and\nenvelope, respectively, and the outer two solid lines represent\nthe inner and outer boundaries of the CSM to the ISM.\n\n2.2.\n\nSupernova ejecta\n\nWe focus on the effect of the CSM, particularly for\nanisotropic CSM, on the early phase evolution of SNRs.\nFor the supernova ejecta, we simply assume spherical distribution with a core of radius Rc and extended envelope\nof radius Rej , as (Truelove & McKee 1999)\nρ=\n\n≤ Rout\n\n\u001a\n\n(2)\n\nwith an anisotropy parameter a, which is the ratio of the\nmajor to minor axis of an equi-density surface of the wind\nmatter. Hereafter, Rin and Rout are referred to the radii\non the equatorial plane. This distribution gives a2 times\nhigher density on the equatorial plane than in the polar direction at the same distance. For the progenitor of\nSN 1987A, Blondin & Lundqvist (1993) suggested that\nthe ratio of equatorial to polar mass-loss rate was at least\n20 during its red supergiant stage. This value corresponds\nto a ≃ 4.5. In our calculations we adopt the values from\n1 to 3.\nWe calculate the evolution for the following five models:\nA1 Isotropic CSM same as Itoh & Masai (1989) for a\nreference.\nA2 Anisotropic CSM concentrated around the equatorial plane.\nA3 Same as A2, but more mass around the equatorial\nplane.\n\nRin Rout\n\nEquatorial plane\n\nṀ\na\nρ=\n,\n4πvw x2 + y 2 + a2 z 2\n2\n\nCSM\nRc Rej\n\nρ=\n\n2\n\nISM\n\nEjecta\n\n1 − n/3\n3Mej\n×\n3 t3\n4πvej\n1 − (n/3)wc3−n\n\nwc−n\n(r/(vej t))−n\n\nfor r < Rc\n,\nfor Rc ≤ r ≤ Rej\n\n(3)\n\nwhere\n\u0012\n\n2Eej\nvej =\nMej\n\n\u00131/2 \u0012\n\n5−n\n3−n\n\n\u00131/2\n\nwc\n\n−(3−n)\n\n− n/3\n\n−(5−n)\nwc\n\n− n/5\n\n!1/2\n\n1\n(4)\nwc\n\nis the expansion velocity at Rej . Mej and Eej are the\nejecta mass and the explosion energy (kinetic energy), respectively. These are assumed to be Eej = 2 × 1051 erg and\nMej = 10M⊙. The other parameters n and wc = Rc /Rej are\ntaken to be 6 and 0.49, respectively. All these values are\nthe same as Itoh & Masai (1989), and hence vej ≃ 8.5 × 108\ncm s−1 .\n3.\n\nCalculation and Results\n\nWe numerically solve the Euler equations utilizing the\nathena3d code (Stone et al. 2008):\n\n\fNo. ]\n\nSNRs expanding out of the CSM into the ISM\n\n3\n\nTable 1. Parameters of circumstellar matter and interstellar medium\n\nModel\nA1\nA2\nA3\nB1\nB2\n\na\n1\n2\n3\n2\n2\n\nRin (1016 cm)\n2.0\n2.0\n2.0\n2.0\n20\n\nRout (1016 cm)\n92.6\n92.6\n92.6\n92.6\n926\n\nCSM\nρin (amu cm−3 )\n3.4×105\n6.9×105\n1.0×106\n6.9×105\n6.9×102\n\nρout (amu cm−3 )\n1.6×102\n3.2×102\n4.8×102\n3.2×102\n3.2×10−1\n\nvw (cm s−1 )\n106\n106\n106\n106\n107\n\nISM\nρISM (amu cm−3 )\n1.6×10−1\n1.6×10−1\n1.6×10−1\n1.6×10−2\n1.6×10−2\n\nMass loss rate Ṁ is 5 × 10−5 M⊙ yr−1 in the all models, and ρin = ρ(r = Rin ), ρout = ρ(r = Rout ).\n\n(5)\n\nwhere ρ, p, v and u are the mass density, the pressure,\nthe fluid velocity and the internal energy per unit mass,\nrespectively. The equation of state is written as p = (γ −\n1)ρu with γ = 5/3, and the mean molecular weight is taken\nto be 0.5.\nIn the hydrodynamical evolution, we obtained mean\ntemperature T of ions (protons) and electrons weighted by\ntheir number density. If no plasma mode works directly on\nelectrons at the shock front, the ion temperature Ti rises\nfaster and then the energy of ions is transferred to electrons. We calculate Ti and Te from T , assuming the transport by Coulomb collisions (Masai 1994; see Appendix).\n3.1.\n\nModel A1\n\nAlthough we include neither ionization nor radiation\nand simply assume the adiabatic evolution, the evolution\nof model A1 is in fairly good agreement with Itoh & Masai\n(1989). The blast shock and reverse shock heat the CSM\n8\n> 107 K, respectively.\nto T >\n∼ 10 K, and the ejecta to T0.88\n∼\nThe blast wave expands as rb ∝ t , while rb ∝ t0.87 in\nItoh & Masai (1989), where rb is the blast-wave radius.\nThe blast wave breaks out at 41 yr, 2 years earlier\nthan in Itoh & Masai (1989) who take radiation loss into\ncalculation. After the break-out, the blast wave rapidly\nexpands adiabatically, and hence the temperature and\ndensity of the shocked matter decrease approximately as\nT ∝ t−2 and ρ ∝ t−3 for γ = 5/3.\nWhen the pressure of the shocked CSM becomes below\nthat of the shocked ISM, the second reverse shock occurs\nto propagate inward and reheats the CSM and ejecta. The\nsecond reverse shock reaches the ejecta at 830 yr, 120 years\nearlier than in Itoh & Masai (1989).\n3.2.\n\nModels A2 and A3\n\nThe evolution is basically the same as model A1, but\nis dependent on direction: more matter on the equatorial plane than in the polar direction. With increasing\nthe value of a, the break-out occurs earlier in the polar and later in the equatorial direction than in model\nA1. The former is due to a shorter distance to the CSM,\n\nand the latter is higher density of the CSM than those in\nmodel A1. In addition, the second reverse shock reaches\nthe ejecta earlier in the polar direction and later in the\nequatorial direction than in model A1. In model A2, the\nbreak-out occurs at 17 yr in the polar direction, and at\n46 yr in the equatorial direction as shown in Figure 2. The\nmean temperature T of the shocked ejecta turns to rise at\n340 yr and 1100 yr, in the polar and equatorial directions,\nrespectively.\n\n10\n7\n6\n5\n4\n3\n2\n\nRadius (pc)\n\n∂ρ\n+ ∇ * (ρv) = 0,\n∂t\n1\n∂v\n+ (v * ∇)v = − ∇p,\n∂t\nρ\n\u0013\u001b\n\u001a \u0012\n∂\n1 2\np\n1 2\n= 0,\n{ρ( v + u)} + ∇ * ρv\nv +u+\n∂t\n2\n2\nρ\n\n1\n7\n6\n5\n4\n3\n2\n\n0.1\n2\n\n3\n\n4\n\n5 6 7 8\n\n100\n\n2\n\n3\n\n4\n\n5 6 7 8\n\n1000\n\n2\n\nTime (yr)\nFig. 2. Shocks in the equatorial direction of model A2 before\nand after the blast-wave break-out, as functions of the elapsed\ntime after explosion. The upper, middle and lower solid lines\nrepresent the radii of the blast wave, second reverse shock and\nreverse shock, respectively. The upper and lower broken lines\nrepresent the outer radii of the CSM and ejecta, respectively.\n\n3.3.\n\nModel B1\n\nThe break-out occurs at the same time as model A2\nsince the CSM distribution is the same as model A2. The\ndifference of model B1 from model A2 is the lower density\nof the ISM by an order of magnitude. The velocity of the\nblast wave after the break-out is slightly higher than that\nin model A2 by a factor of ∼ 1.4 in the equatorial direction.\nAs a result, the pressure of the shocked ISM is about onefifth of that in model A2, and the second reverse shock\noccurs later. The temperature T of the shocked ejecta\n\n\f4\n\nT. Shimizu, K. Masai, & K. Koyama\n\ndrops at 23 yr and 68 yr by the break-out, but turns to\nrise at 810 yr and 1800 yr in the polar and equatorial\ndirections, respectively.\n\nRadius (pc)\n\nModel B2\n\n10\n10\n\n-1\n-2\n9\n\n3.0x10\n2.5\n2.0\n1.5\n1.0\n0.5\n1\n\n10\n\n100\n\n1000\n\nTime (yr)\n\nDiscussion\n\nIn Table 2 we summarize the temperatures and blastwave radii at characteristic epochs, tb and td (see below),\nfor each model.\n4.1.\n\n0\n\n10\n\n-1\n\nThe difference from model B1 is the lower density of\nthe CSM by three orders of magnitude due to higher wind\nvelocity by an order of magnitude. Even at such low densities, the break-out occurs at 170 yr and 450 yr in the\npolar and equatorial directions, respectively. Similarly to\nthe other models, the temperature T of the shocked ejecta\ndrops at 280 yr and 770 yr, but turns to rise by the second reverse shock at 920 yr and 2400 yr in the polar and\nequatorial directions, respectively.\n4.\n\n1\n\n10\n\nVelocity (cm s )\n\n3.4.\n\n[Vol. ,\n\nFig. 3. Radius and velocity of the blast wave in the polar\ndirection for models A1 (solid lines), A2 (dashed lines) and\nA3 (dotted lines), as functions of elapsed time after explosion.\n\nDynamical evolution\n\nBefore the break-out, the evolution of SNR can be described by a self-similar solution, and the blast wave expands as rb ∝ tα . Almost independently of anisotropy of\nthe CSM (models A1–3), the values of α are close to each\nother both in the polar and equatorial directions, as seen\nin the upper panel of Figure 3. After the break-out, α\nvalues are slightly larger in larger a models, but approach\nthe value of model A1 (a = 1) with time. This implies\nthat the blast wave approaches spherical symmetry with\ntime, and the ratio of the blast-wave radius of the polar to\nequatorial direction becomes less than ∼ 1.2 in 1000 years\nin any model of ours here.\nIf the density difference across the interface between\nthe CSM and ISM is large enough (models A1–3 and B1),\nthe blast wave gets faster just after the break-out by a\nfactor of ∼ 2, almost independent of the density difference.\nOn the other hand, if the density difference is as small\nas model B2, the velocity increases by a factor of ∼ 1.4.\nThe expansion velocity of a spherical fluid initially at rest\nasymptotically approaches its maximum value of 2cs /(γ −\n1), where cs is a sound speed of the fluid (Zel'dovich &\nRaizer 1966). Similarly, denoting the shock velocity by\nVS , we may have the maximum expansion velocity after\nthe break-out, as\n2\n[c2 + VS2 (tb )]1/2 ≃ 2.0 VS (tb ),\nγ−1 s\n\n(6)\n\nwhere VS (tb ) is the shock velocity of the blast wave immediately before the break-out at t = tb . Here we take\nthe Rankine-Hugoniot relation of strong shocks into account. This estimate is consistent with the result of our\nhydrodynamical calculation. The high shock velocity and\nrarefaction caused by the break-out may be in favor of\nparticle acceleration, because the former boosts the maximum energy of particles, and the latter works for particles\nto become non-thermal.\n\n4.2.\n\nTemperature and Ionization state\n\nAs demonstrated by Itoh & Masai (1989), rarefaction by the blast-wave break-out rapidly cools the shockheated matter to be an over-ionized/recombining plasma\nof Te < Tz . This recombining plasma state lasts until the\nsecond reverse shock reheats the matter to >\n∼ Tz . Although\nionization is not calculated simultaneously with hydrodynamics, we can analyze the ionization state, i.e., ionizing, equilibrium or recombining, of the shocked matter\nfrom the electron temperature and density. The ionization state thus evaluated is consistent with Itoh & Masai\n(1989), considering the variation of epochs and duration\nthat depend on the CSM/ISM models, as discussed in the\nprevious sections.\nThe upper panels of Figures 4a (model B1) and 4b\n(model B2) show the evolution of the ion and electron temperatures averaged over the shocked matter of the ejecta.\nBefore the break-out, Te becomes nearly equal to Ti due\nto high densities of the CSM. Also after the break-out and\nuntil arrival of the second reverse shock, Te is nearly equal\nto Ti , because cooling is due to adiabatic expansion. By\nthe second reverse shock, Ti rises faster than Te , and then\nTe rises through the energy transport from ions, as shown\nin the upper panels of Figure 4.\nIn the lower panels, we show the average density of the\nshocked ejecta by the solid line. Ionization by electronimpact becomes equilibrium with time-scale τ given by\nρτ ∼ 1012 amu cm−3 s, almost independent of the temperature or ion species (Masai 1994). We also plot this\nrelation as ρcrit = 1012 t−1 amu cm−3 with the dashed line\nin the lower panels. Well before the break-out, since the\ndensity is high enough (ρ > ρcrit ) due to the presence of\nCSM, ionization quickly reaches its equilibrium at Te , i.e.\nTz ∼ Te .\nAs the SNR expands, the average density of the shocked\nmatter decreases approximately as ρ ∝ t−2 . When rarefaction occurs by the break-out, ρ decreases faster as ∝ t−3\n\n\fNo. ]\n\nSNRs expanding out of the CSM into the ISM\n\n5\n\nTable 2. Characteristic Epochs\n\nBreak-out\nTz − Te Decoupling\nModel tb (yr) T (107 K) Rb (pc) td (yr) T (107 K)\nRb (pc)\nA1\n41\n1.3\n0.30\n180\n0.20\n1.7\nA2-e\n46\n1.2\n0.30\n210\n0.18\n1.8\nA2-p\n17\n1.6\n0.15\n80\n0.16\n0.99\nA3-e\n47\n1.4\n0.30\n220\n0.21\n1.8\nA3-p\n11\n0.8\n0.10\n60\n0.11\n0.81\nB1-e\n46\n1.2\n0.30\n190\n0.23\n2.0\nB1-p\n17\n1.7\n0.15\n80\n0.10\n1.1\nB2-e\n450\n1.2\n3.0\n70\n1.7\n0.64\nB2-p\n170\n1.1\n1.5\n36\n1.2\n0.38\nThe characters \"e\" and \"p\" attached to Model A2–B2 mean the equatorial and polar directions, respectively.\n\n8\n\n8\n\n10\nTe, Ti (K)\n\nTe, Ti (K)\n\n10\n\n7\n\n10\n\n6\n\n10\n\n6\n\n10\n-3\n\nDensity (amu cm )\n\n-3\n\nDensity (amu cm )\n\n5\n\n10\n6\n10\n4\n\n10\n\n2\n\n10\n\n0\n\n10\n\n-2\n\n10\n\n7\n\n10\n\n10\n\n100\n\n1000\n\n10\nTime (yr)\n\n100\n\n4\n\n10\n\n2\n\n10\n\n0\n\n10\n\n-2\n\n10\n\n1000\n(a)\n\n100\n\n1000\n\n100\nTime (yr)\n\n1000\n(b)\n\nFig. 4. Model (a) B1 and (b) B2: Averaged temperature and density of the shocked ejecta in the equator (left) and polar (right)\ndirections, as functions of the elapsed time after explosion. Upper: The solid and broken lines represent the electron and ion\ntemperatures, respectively. Lower: The solid and dashed lines represent the density and ρcrit = 1012 t−1 amu cm−3 , respectively,\nand the thin-dotted vertical lines represent the decoupling epoch td (see text).\n\n(see Section 3.1). Therefore, ρ becomes below ρcrit ∝ t−1 ,\nas seen in the lower panels of Figure 4, and Tz is decoupled\nfrom Te . In other words, recombination no longer follows\nthe rapid decrease of the electron temperature, and the\nionization state freezes roughly at Tz ∼ Te (td ), where td is\nthe epoch at which ρ = ρcrit .\nThe decoupling epoch td is also shown in the lower panels of Figure 4 with the thin-dotted vertical line. In model\nB1, td ∼ 190 yr in the equatorial direction. Note that\ntd > tb and Te (td ) < Te (tb ) in model B1, where Te (tb ) is\nthe electron temperature immediately before the breakout. Models A1–3 show the similar behavior to model B1\ndescribed here.\nIn model B2, unlike other models or Itoh & Masai\n(1989), the CSM is located away from the progenitor, and\nhence the density is low. Therefore, the break-out occurs\nlater but ρ becomes below ρcrit earlier than in model B1.\nAs seen in Figure 4b, td < tb in model B2, and td ∼ 70 yr\nin the equatorial direction. In fact, as is seen in the upper panel, Te before the break-out is nearly constant at\n∼ Te (tb ) in model B2. As a result, the ionization tem-\n\nperature of the recombining plasma is higher in model B2\nthan that in model B1.\nWhen the second reverse shock reaches the ejecta, the\ntemperature turns to rise, as seen in the upper panels of\nFigure 4. If the electron temperature exceeds or becomes\ncomparable to Tz ∼ Te (td ), the ionization state turns to be\nionizing or nearly equilibrium. This is the case for models\nA1–3 with a higher ISM density. In model B1, though the\nISM density is low, Te exceeds Tz in 3000 years owing to\nthe dense CSM and lower Tz . On the other hand, in model\nB2, the density is too low for the second reverse shock to\nraise Te > Tz in such short time, and the over-ionization\nstate remains much longer. If Ti becomes higher than 2Tz\nat the shock front, Te >\n∼ Tz may be attained by the energy\ntransfer from ions. Since Ti ∝ VS2 (reverse shock) decreases\nwith the age, however, the recombining state would last\nyet for thousands years.\nAfter decoupled from the electron temperature, the\nionization temperature decreases by recombination with\ntime-scale τ . We note here that the recombination timescale ∼ 104 yr (Masai 1994) is longer than the age of over-\n\n\f6\n\nT. Shimizu, K. Masai, & K. Koyama\n\nionized SNRs: ∼ 4000 yr for IC443 (Troja et al. 2008) and\n1000 − 4000 yr for W49B (Pye et al. 1984, Smith et al.\n1985, Hwang et al. 2000).\n4.3.\n\n8\n980 yr\n4\n\nX-ray emission measure distribution\n\nAll the SNRs with over-ionized/recombining plasma so\nfar observed are mixed-morphology SNRs, which exhibit\ncenter-filled X-ray emission and shell-like radio emission.\nHence, we investigate distribution of the X-ray emission\nmeasure for SNRs with anisotropic stellar wind. We\nR integrate the density square along the line of sight, as ρ2 dl,\nand show the map (black lines) for model B2 in Figure 5.\nHere the shocked matter of T > 106 K, which is responsible\nfor X-ray emission, is taken into calculations.\nAt ages 980 yr and 1800 yr, we can see a bar-like structure (horizontal) with diffuse wings in the equatorial view,\nwhile a thin shell in the polar view. The emission measure\nis dominated by the shock-heated ejecta, which is a recombining plasma as seen from Figure 4b. The temperature\ndependence of the line emissivity is weaker in recombining than in equilibrium, and the emission-measure map\nreflects roughly the X-ray surface brightness.\nThe bar structure is clearer at younger ages after the\nbreak-out, and diffuses out gradually with time. At\n1800 yr, the second reverse-shock front appears to surround the bar/wing structure, and thereby the bar-end\nstructure is being distorted. The second reverse-shock\npropagates inward and eventually sweeps the bar/wing\nstructure out. Hence, the late-phase SNR approaches\nshell-like both in the equatorial and polar views, as seen\nat 10000 yr in Figure 5, where a little elongated shape\nwith a narrow middle part is still seen in the equatorial\nview.\nW49B shows a bar-like structure as well as a recombining plasma state (Ozawa et al. 2009). The bar and\nits east-end observed with Chandra (Keohane et al. 2007)\nlook similar to our calculation shown in Figure 5. Thus we\nsuggest that W49B is the case of nearly equatorial view\nfor the supernova remnant of a massive progenitor which\nexploded in its past stellar wind. It should be noted that,\nin our calculation, the structure of the bar-end is formed\nby the reverse shock, not by the collision with a molecular\ncloud near the bar-end.\nThe grey lines in Figure 5 represent the low-level emission measure, much smaller than that represented by the\nblack lines. One can see the blast-wave front in the grey\nlines. The shocked matter in the grey lines is hardly observed in X-rays, but the shock possibly accelerates electrons to be of order of GeV, which can be responsible\nfor GHz synchrotron radio; the condition after the breakout is favorable for particle acceleration, as mentioned in\nSection 4.1.\n5.\n\n[Vol. ,\n\nConclusion\n\nWe investigate the evolution of SNRs that explode in\nthe progenitors' stellar wind matter, considering possible environments of mixed-morphology SNRs with overionized plasmas. We summarize the results;\n\n0\n-4\n-8\n-8\n\n-4\n\n0\n\n4\n\n8\n1800 yr\n\n10\n5\n0\n-5\n-10\n-10\n\n-5\n\n0\n\n5\n\n10\n\n40\n\n10000 yr\n20\n0\n-20\n-40\n-40\n\n-20\n\n0\n\n20\n\n40\n\nFig. 5. Contours of the X-ray emission measure in\nthe equator (left) and polar (right) directions of\nmodel B2 are drawn by black lines linearly from\nzero, every 1 × 1019 amu2 cm−5 to the maximum\n∼ 1.3×1020 amu2 cm−5 at 980 yr, every 5×1017 amu2 cm−5\nto the maximum ∼ 3.8 × 1018 amu2 cm−5 at 1800 yr,\nand every 2 × 1016 amu2 cm−5 to the maximum\n∼ 1.9 × 1017 amu2 cm−5 at 10000 yr, after explosion.\nThe grey contours represent the low-level emission measure\ndrawn linearly from zero, every 1 × 1016 amu2 cm−5 up to\n1.0 × 1017 amu2 cm−5 at 980 yr, every 1 × 1016 amu2 cm−5\nup to 1.0 × 1017 amu2 cm−5 at 1800 yr. The horizontal and\nvertical axes show the scale in units of pc.\n\n\fSNRs expanding out of the CSM into the ISM\n\n• When the blast wave breaks out of the wind matter\ninto the ambient interstellar medium, the shocked\nmatter cools rapidly due to adiabatic expansion.\nJust after the break-out, the expanding velocity becomes faster by a factor up to two, and then gradually decreases to that of the extrapolated from the\nvelocity trend before the break-out.\n• Before the break-out, the shocked matter reaches\nionization equilibrium and equipartition Te ∼ Ti , but\ndeviates from equilibrium by rarefaction after the\nbreak-out. Consequently, the shock-heated ejecta\nturns to be a recombining plasma, since cooling due\nto adiabatic expansion is much faster than recombination.\n• The recombining state of the shocked ejecta lasts\nuntil the second reverse shock, which occurs by the\ninteraction with the interstellar medium, propagates\ninward and reheats the ejecta. If the density of the\nejecta is too low to establish ionization equilibrium,\nhowever, the recombining state lasts longer.\n• After the break-out in the adiabatic phase, since\nthe emission measure of the shocked ejecta is much\nlarger than that of the shocked ambient matter, the\nSNR in X-ray wavelengths appears much brighter\nin the reverse-shocked inner region than the blastshocked outer shell.\n• When the stellar wind matter is not isotropic but\ndenser in the equatorial direction due to the progenitor's rotation, the SNR in the recombining state\nlooks bar-like with wings in the equatorial view and\nthin shell-like in the polar view. So that, the SNR\nwould show center-filled various shapes in X-rays,\ndepending on the viewing angle. On the other hand,\nthe blast-shocked matter, which is very faint in Xrays but could be observed in radio, forms a fairly\ncomplete shell outside.\n• As the SNR age increases, however, the second reverse shock sweeps the bar/wing structure out and\nmerges into the whole ejecta eventually. Hence, the\nbar/wing structure disappears and the late-phase\nSNR would look shell-like almost independently of\nthe viewing angle.\nThe authors are grateful to Hiroya Yamaguchi and\nMidori Ozawa for meaningful discussion about Suzaku observations of recombination radiation from SNRs. KM\nand KK were respectively supported by the Grant-in-Aid\nfor Scientific Research 22540253 and 2054019, from Japan\nSociety for the Promotion of Science (JSPS).\nAppendix 1.\n\nElectron temperatures of SNRs\n\nIn the present work, we assume that shocks heat substantially ions at the shock front, and then the electron temperature rises through the energy transport by\nCoulomb collisions and diffusion in the post shock region.\nIn Figure 6 we compare the electron temperature thus obtained (Masai 1994) by the solid lines and temperature in\n\n7\n\nthe equipartition with ions at the shock front by the broken lines, with the observed electron temperatures (the\ncircles). One can see the transfer by Coulomb collisions\nfrom ions to electrons is a reasonable assumption to account for the observed data.\n5\n\n4\nTemperature (keV)\n\nNo. ]\n\n3\n\n2\n\n1\n\n0\n0\n\n10\n\n20\n\n30\n\n40\n\nRadius (pc)\nFig. 6. Electron temperature vs. radius of SNRs which have\nno active central sources. Open and filled circles represent\nshell-like and mixed-morphology SNRs, respectively; line-connected two circles mean the data by two-temperature analysis.\nThe thin and thick solid/broken lines represent the calculations for the density ρ = 0.1 amu cm−3 and ρ = 1 amu cm−3 ,\nrespectively, of the ambient matter.\nReferences.-Kepler; Kinugasa & Tunemi 1999, G15.9+0.2;\nReynolds et al. 2006, G27.4+0.0; Gotthelf & Vasisht 1997,\nCygnus Loop; Miyata et al. 2007, G109.1+1.0; Sasaki et al.\n2004, Cassiopeia A; Kawasaki et al. 2005, Tycho; Hwang &\nGotthelf 1997, G156.2+5.7; Katsuda et al. 2009, Puppis A;\nTamura 1995, G272.2-3.2; Harrus et al. 2001, G299.2-2.9;\nPark et al. 2007, RCW 86; Rho et al. 2002, SN 1006;\nYamaguchi et al. 2008, Lupus Loop; Park et al. 2009,\nCTB37A; Aharonian et al. 2008, CTB37B; Nakamura et al.\n2009, G349.7+0.2; Lazendic et al. 2005, W28; Kawasaki et\nal. 2005, W44; Kawasaki et al. 2005, 3C400.2; Saken et al.\n1995, Kes 27; Enoguchi et al. 2992, MSH 11-61A; Rho & Petre\n1998, 3C391; Kawasaki et al. 2005, CTB 1; Rho & Petre 1998,\nW51C; Koo et al. 1995, CTA 1; Rho & Petre 1998, W63; Rho\n& Petre 1998, HB21; Rho & Petre 1998, IC443; Yamaguchi\net al. 2009, Kes 79; Rho & Petre 1998, HB3; Rho & Petre\n1998, G327.1-1.1; Sun et al. 1999, W49B; Ozawa et al. 2009,\n3C397; Rho & Petre 1998, MSH 11-54; Rho & Petre 1998\n\nReferences\nAharonian, F. et al. 2008, A&A, 490, 685\nBlondin, J. M., & Lundqvist, P. 1993, ApJ, 405, 337\nEnoguchi, H., Tsunemi, H., Miyata, E., Yoshida, K. 2002,\nPASJ, 54, 229\nGotthelf, E. V., Vasisht, V. 1997, ApJ, 486, L133\nHarrus, I., Slane, P. O., Smith, R. K., Hughes, J. P. 2001, ApJ,\n552, 614\nHwang, U., Gotthelf, E. V. 1997, ApJ, 475, 665\nHwang, U., Petre, R., & Hughes, J. P. 2000, ApJ, 532, 970\nItoh, H., & Masai, K. 1989, MNRAS, 236, 899\n\n\f8\n\nT. Shimizu, K. Masai, & K. Koyama\n\nKatsuda, S., Petre, R., Hwang, U., Yamaguchi, H., Mori, K.,\nTsunemi, H. 2009, PASJ, 61, S155\nKawasaki, M., Ozaki, M., Nagase, F., Inoue, H., & Petre, R.\n2005, ApJ, 631, 935\nKawasaki, M. T., Ozaki, M., Nagase, F., Masai, K., Ishida, M.,\n& Petre, R. 2002, ApJ, 572, 897\nKeohane, J. W., Reach, W. T., Rho, J., & Jarrett, T. H. 2007,\nApJ, 654, 938\nKinugasa, K., Tunemi, H. 1999, PASJ, 51, 239\nKoo, B.-C., Kim, K.-T., Seward, F. D. 1995, ApJ, 447, 211\nLazendic, J. S., Slane, P. O., Hughes, J. P., Chen, Y.,\nDame, T. M. 2005, ApJ, 618, 733\nMasai, K. 1994, ApJ, 437, 770\nMiyata, E., Katsuda, S., Tsunemi, H., Hughes, J. P.,\nKokubun, M., Porter,F. S. 2007 PASJ, 59, S163\nNakamura, R., Bamba, A., Ishida, M., Nakajima, H.,\nYamazaki, R., Terada, Y., Pühlhofer, G., Wagner, S. J.\n2009, PASJ, 61, S197\nOhnishi, T., Koyama, K.,Tsuru, T. G., Masai, K.,\nYamaguchi, H., & Ozawa, M. 2011, PASJ, 63, 527\nOzawa, M., Koyama, K., Yamaguchi, H., Masai, K., &\nTamagawa, T. 2009, ApJ, 706, L71\nPark, S., Kargaltsev, O., Pavlov, G. G., Mori, K. Slane, P. O.,\nHughes, J. P., Burrows, D. N., Garmire, G. P. 2009, ApJ,\n695, 431\nPark, S., Slane, P. O., Hughes, J. P., Mori, K., Burrows, D. N.,\nGarmire, G. P. 2007, ApJ, 665, 1173\nPye, J. P., Thomas, N., Becker, R. H., & Seward, F. D., 1984,\nMNRAS, 207, 649\nReynolds, S. P., Borkowski, K. J., Hwang, U., Harrus, I.,\nPetre, R., Dubner, G. 2006, ApJ, 652\nRho, J., Dyer, K., Borkowski, K. J., Reynolds, S. P. 2002, ApJ,\n581, 1116\nRho, J., Petre, R. 1998, ApJ, 503, L167\nSaken, J. M., Long, K. S., Blair, W. P., Winkler, P. F. 1995,\nApJ, 443, 231\nSasaki, M., Plucinsky, P. P., Gaetz, T. J., Smith, R. K.,\nEdger, R. J., Slane, P. O. 2004, ApJ, 617, 322\nSmith, A., Peacock, A., Jones, L. R., & Pye, J. P. 1985, ApJ,\n296,469\nStone, J. M., Gardiner, T. A., Teuben, P., Hawley, J. F., &\nSimon, J. 2008, ApJS, 178, 137\nSun, M., Wang, Z.-R., Chen, Y. 1999, ApJ, 511, 274\nTamura, K. 1995, Ph.D. thesis, Osaka Univ.\nTroja, E., Bocchino, F., Miceli, M., & Reale, F. 2008, A&A,\n485, 777\nTruelove, J. K., & McKee, C. K. 1999, ApJS, 120, 299\nYamaguchi, H., Koyama, K., Katsuda, S., Nakajima, H.,\nHughes, J. P., Bamba, A., Hiraga, J. S., Mori, K., Ozaki, M.\nTsuru, T. G. 2008, PASJ, 60, S141\nYamaguchi, H., Ozawa, M., Koyama, K., Masai, K.,\nHiraga, J. S., Ozaki, M., & Yonetoku, D. 2009, ApJ, 705,\nL6\nZel'dovich, Y. B., & Raizer, Y. P. 1966, Physics of Shock\nWaves and High-Temperature Hydrodynamic Phenomena,\ned. W. D. Hayes & R. F. Probstein, Volume I (Academic\nPress New York and London), 103\n\n[Vol. ,\n\n\f"}