{"id": "http://arxiv.org/abs/1105.2066v1", "guidislink": true, "updated": "2011-05-10T22:31:14Z", "updated_parsed": [2011, 5, 10, 22, 31, 14, 1, 130, 0], "published": "2011-05-10T22:31:14Z", "published_parsed": [2011, 5, 10, 22, 31, 14, 1, 130, 0], "title": "Interference pattern in the collision of structures in the BEC dark\n  matter model: comparison with fluids", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1105.2066%2C1105.0640%2C1105.5402%2C1105.0526%2C1105.2251%2C1105.3281%2C1105.4111%2C1105.2919%2C1105.4248%2C1105.3587%2C1105.3911%2C1105.2024%2C1105.1117%2C1105.4090%2C1105.0222%2C1105.0164%2C1105.2085%2C1105.3106%2C1105.2592%2C1105.2798%2C1105.2641%2C1105.3662%2C1105.1389%2C1105.6360%2C1105.1473%2C1105.2129%2C1105.4771%2C1105.1708%2C1105.1413%2C1105.3507%2C1105.3162%2C1105.0086%2C1105.3134%2C1105.1658%2C1105.0227%2C1105.1785%2C1105.0738%2C1105.1830%2C1105.2118%2C1105.1500%2C1105.2403%2C1105.3208%2C1105.4686%2C1105.6200%2C1105.1766%2C1105.0380%2C1105.6073%2C1105.5244%2C1105.0445%2C1105.3937%2C1105.6149%2C1105.2377%2C1105.4477%2C1105.2748%2C1105.4585%2C1105.0020%2C1105.3446%2C1105.5573%2C1105.2045%2C1105.5204%2C1105.3854%2C1105.3906%2C1105.6241%2C1105.5612%2C1105.2988%2C1105.4878%2C1105.6156%2C1105.4160%2C1105.2874%2C1105.3315%2C1105.6286%2C1105.2749%2C1105.4303%2C1105.2709%2C1105.4670%2C1105.1075%2C1105.3439%2C1105.4373%2C1105.4150%2C1105.0690%2C1105.0594%2C1105.4595%2C1105.2724%2C1105.5525%2C1105.1938%2C1105.2554%2C1105.2398%2C1105.3734%2C1105.3516%2C1105.4063%2C1105.1303%2C1105.2506%2C1105.5980%2C1105.0743%2C1105.2962%2C1105.1068%2C1105.5978%2C1105.4530%2C1105.4978%2C1105.4759%2C1105.1177&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Interference pattern in the collision of structures in the BEC dark\n  matter model: comparison with fluids"}, "summary": "In order to explore nonlinear effects on the distribution of matter during\ncollisions within the Bose-Einstein condensate (BEC) dark matter model driven\nby the Schr\\\"odinger-Poisson system of equations, we study the head-on\ncollision of structures and focus on the interference pattern formation in the\ndensity of matter during the collision process. We explore the possibility that\nthe collision of two structures of fluid matter modeled with an ideal gas\nequation of state also forms interference patterns and found a negative result.\nGiven that a fluid is the most common flavor of dark matter models, we conclude\nthat one fingerprint of the BEC dark matter model is the pattern formation in\nthe density during a collision of structures.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1105.2066%2C1105.0640%2C1105.5402%2C1105.0526%2C1105.2251%2C1105.3281%2C1105.4111%2C1105.2919%2C1105.4248%2C1105.3587%2C1105.3911%2C1105.2024%2C1105.1117%2C1105.4090%2C1105.0222%2C1105.0164%2C1105.2085%2C1105.3106%2C1105.2592%2C1105.2798%2C1105.2641%2C1105.3662%2C1105.1389%2C1105.6360%2C1105.1473%2C1105.2129%2C1105.4771%2C1105.1708%2C1105.1413%2C1105.3507%2C1105.3162%2C1105.0086%2C1105.3134%2C1105.1658%2C1105.0227%2C1105.1785%2C1105.0738%2C1105.1830%2C1105.2118%2C1105.1500%2C1105.2403%2C1105.3208%2C1105.4686%2C1105.6200%2C1105.1766%2C1105.0380%2C1105.6073%2C1105.5244%2C1105.0445%2C1105.3937%2C1105.6149%2C1105.2377%2C1105.4477%2C1105.2748%2C1105.4585%2C1105.0020%2C1105.3446%2C1105.5573%2C1105.2045%2C1105.5204%2C1105.3854%2C1105.3906%2C1105.6241%2C1105.5612%2C1105.2988%2C1105.4878%2C1105.6156%2C1105.4160%2C1105.2874%2C1105.3315%2C1105.6286%2C1105.2749%2C1105.4303%2C1105.2709%2C1105.4670%2C1105.1075%2C1105.3439%2C1105.4373%2C1105.4150%2C1105.0690%2C1105.0594%2C1105.4595%2C1105.2724%2C1105.5525%2C1105.1938%2C1105.2554%2C1105.2398%2C1105.3734%2C1105.3516%2C1105.4063%2C1105.1303%2C1105.2506%2C1105.5980%2C1105.0743%2C1105.2962%2C1105.1068%2C1105.5978%2C1105.4530%2C1105.4978%2C1105.4759%2C1105.1177&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "In order to explore nonlinear effects on the distribution of matter during\ncollisions within the Bose-Einstein condensate (BEC) dark matter model driven\nby the Schr\\\"odinger-Poisson system of equations, we study the head-on\ncollision of structures and focus on the interference pattern formation in the\ndensity of matter during the collision process. We explore the possibility that\nthe collision of two structures of fluid matter modeled with an ideal gas\nequation of state also forms interference patterns and found a negative result.\nGiven that a fluid is the most common flavor of dark matter models, we conclude\nthat one fingerprint of the BEC dark matter model is the pattern formation in\nthe density during a collision of structures."}, "authors": ["J. A. Gonzalez", "F. S. Guzman"], "author_detail": {"name": "F. S. Guzman"}, "author": "F. S. Guzman", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevD.83.103513", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1105.2066v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1105.2066v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "7 pages, 22 eps figures", "arxiv_primary_category": {"term": "astro-ph.CO", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph.CO", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "hep-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1105.2066v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1105.2066v1", "journal_reference": "Phys.Rev.D83:103513,2011", "doi": "10.1103/PhysRevD.83.103513", "fulltext": "Interference pattern in the collision of structures in the BEC dark matter model:\ncomparison with fluids\nJ. A González1 and F. S. Guzmán1\n\narXiv:1105.2066v1 [astro-ph.CO] 10 May 2011\n\n1\n\nInstituto de Fı́sica y Matemáticas, Universidad Michoacana de San Nicolás de Hidalgo. Edificio C-3,\nCd. Universitaria, C. P. 58040 Morelia, Michoacán, México.\n(Dated: August 14, 2018)\nIn order to explore nonlinear effects on the distribution of matter during collisions within the\nBose-Einstein condensate (BEC) dark matter model driven by the Schrödinger-Poisson system of\nequations, we study the head-on collision of structures and focus on the interference pattern formation in the density of matter during the collision process. We explore the possibility that the\ncollision of two structures of fluid matter modeled with an ideal gas equation of state also forms\ninterference patterns and found a negative result. Given that a fluid is the most common flavor of\ndark matter models, we conclude that one fingerprint of the BEC dark matter model is the pattern\nformation in the density during a collision of structures.\nPACS numbers: 95.35.+d, 05.30.Jp, 03.75.Lm, 05.45.Yv\n\nI.\n\nINTRODUCTION\n\nThe discovery of the nature of dark matter is one of the\nmost important problems nowadays, and a considerable\namount of theoretical models have been proposed. One\nof the candidates that has received certain attention is\na scalar field dark matter ultralight particle that is consistent with cosmological observations [1, 2]. At cosmological scales, this and other related models have been\nwidely studied, and one of the important issues to be\nunderstood about this candidate is its behavior at local\nscales related to nonlinear processes of collapse, structure\nformation and collision of structures. Some theoretical\nstudies have pushed forward this model at local scales,\nespecially those related to galactic rotation curves under\nvarious conditions [3–5]. In the case of ultralight scalar\nfields, it has been shown that the density profiles of scalar\nfield structures is not cuspy as opposed to Navarro Frenk\nWhite density profiles [6], and also predicts an adequate\ncutoff in the mass power spectrum of structures consistent with the abundance of small structures [2]. Finally,\nmore recently the evolution of cosmological perturbations\nin Bose-Einstein condensate dark matter is already under\nstudy [7].\nIn the nonlinear regime, some advances have been\nmade related to the evolution of gravitating scalar field\nstructures, both relativistic under general relativistic\nconditions [8] and Newtonian in the low energy and weak\ngravitational field regime [9–12].\nThe Newtonian case has been found to be more appropriate to study the nonlinear collapse and interaction\nbetween structures, and is driven by the time-dependent\nSchrödinger-Poisson (SP) system of equations. The interpretation of this system of equations is that Schrödinger\nequation represents a Bose-Einstein condensate (BEC)\nof the scalar field particles at zero temperature in the\nmean field approximation, through the Gross-Pitaevskii\nequation [13]. This is the reason why in the low energy\nand weak gravitational field limits, the scalar field dark\n\nmatter model is called BEC dark matter.\nThe solution of the time-dependent SP system requires\nthe application of numerical methods to visualize the evolution of BEC structures and estimate any potential observable implication. A helpful feature of the SP system\nis that it has equilibrium configurations, that is, there are\nspherically symmetric stationary solutions based on the\nassumption that the wave function depends harmonically\nin time, which in turn implies that both the gravitational\npotential and the energy density are time-independent\n[9, 10]. Such equilibrium configurations have been studied dynamically and found to be stable under spherical\nperturbations and are also attractor solutions in time for\ninitial perturbations with arbitrary profile [10]; they are\nalso stable against nonspherical perturbations [11], and\nthey serve as stable structures to study how BEC dark\nmatter structures behave in nonlinear situations.\nIn this paper, we explore the BEC dark matter model\nduring the head-on collision of structures as depicted first\nin [12], where it was found that when the binary system is\ninitially bounded, the resulting system is a single object,\nwhereas for unbounded systems a sort of solitonic behavior was shown to happen. In both cases, it was found that\nan interference pattern was formed during the collision\nwhich potentially would provide predictions on the behavior of baryonic matter whose stream would be driven\nin part by the dark matter gravitational potential during\nthe collision of two structures.\nOn the other hand, the most studied models of dark\nmatter assume it can be a dust fluid, which is an approximate model of dark matter candidates like WIMPs.\nThus, in this work we present a comparison of the headon collision of two structures assuming on the one hand\nthat the structures correspond to two equilibrium configurations of the Schrödinger-Poisson system and on the\nother hand the structures correspond to two relaxed balls\nof ideal gas.\nThe goal is to determine whether or not the collision\nof two balls of gas representing two structures of WIMPs\ncan also present an interference pattern during the head-\n\n\f2\non collision, and thus conclude that the BEC dark matter\nhas peculiar fingerprint interference patterns during the\ncollision of structures that should predict observations\nthat determine its viability, or determine the BEC dark\nmatter should be ruled out.\nThis paper is organized as follows: In Sec. II we introduce the systems of equations we solve, and the numerical\nmethods we use in order to carry out the head-on collision of two structures, both of BEC dark matter and of\nan ideal gas; in Sec. III we present the results of our\nsimulations and compare the behavior in the two cases;\nand finally in Sec. IV we draw some conclusions.\n\nII.\n\nA.\n\nSYSTEMS OF EQUATIONS AND\nNUMERICAL METHODS\nThe Schrödinger-Poisson system\n\nThe system of equations. The SP system of equations\nconsists of the Schrödinger equation for a wave function\nψ, with a potential that is solution of Poisson equation\nsourced by the density of probability |ψ|2 . Since we deal\nwith a head-on collision, we write down the SP system\nin cylindrical coordinates as follows:\n\u0012\n\u0013\n1 ∂ψ\n1 ∂2ψ\n∂ 2ψ\n∂ψ\n+ U ψ + Λ|ψ|2 ψ(1)\n+\n= −\n+\ni\n∂t\n2 ∂x2\nx ∂x\n∂z 2\n∂2U\n1 ∂U\n∂2U\n+\n= ψ ∗ ψ,\n(2)\n+\n∂x2\nx ∂x\n∂z 2\nwhere ψ = ψ(x, z, t) and U = U (x, z, t) are the wave\nfunction and the gravitational potential respectively; x, z\nare the radial and axial cylindrical coordinates respectively. The third order term in Eq. (1) is related to a\nself-interacting term, in which Λ corresponds to the swave scattering length in the Gross-Pitaevskii approximation for Bose condensates [13], which we set to zero\nin this work, because it is irrelevant in the interference\npattern formation studied here. This term instead was\nshown to play the role of determining the compactness\nof an equilibrium configuration [10]. Eqs. (1- 2) use the\nunits and scaling ~ = c = 1 with √\nx → mx, z → mz,\nt → mt and the wave function ψ → 4πGψ, where m is\nthe mass of the ultralight boson. A consequence of this\nchange of units is that the mass of a system will be in\n2\nunits of [M ] = Mpl\n/m, and thus m determines the scale\nof the configurations we start with. In fact these units\ndefine the Kaup mass, which in the relativistic counterpart of the Schrödinger-Poisson system (the boson star\ncase ruled by the Einstein-Klein-Gordon system of equations) indicates the threshold between stable and unstable bounded configurations [14]. It is worth mentioning\nthat in the case of the Schrödinger-Poisson system, that\nis, the low energy and weak field limits of boson stars, the\nequilibrium configurations are all stable, unless a negative self-interaction factor Λ is introduced [10].\n\nThe evolution of the system. We consider the system\n(1-2) to be a constrained evolution system, that is the\nSchrödinger equation is an evolution equation that satisfies the Poisson equation which is a constraint. Explicitly,\nwe integrate the Schrödinger equation using a finite differences approximation along the spatial directions and\na method of lines for the integration in time that uses a\nthird order Runge-Kutta algorithm. We solve the constraint (Poisson equation) at the intermediate steps of\nthe time integrator, which provides a full coupling of the\nevolution constrained system, as shown in our convergence tests. The flow of the solution is as follows: at\nevery intermediate iteration of the Runge-Kutta integrator: i) evolve the system using the Schrödinger equation to evolve ψ, ii) use such updated value of the wave\nfunction to source and solve the Poisson equation, iii)\nthen obtain a new potential U and repeat. Usually the\nSchrödinger equation is integrated in time using unitary\noperators [15], which is related to fully implicit methods, however, even though we use explicit methods we\nverified the evolution is unitary as shown in [10–12]. In\norder to avoid the singularity at x = 0 in Eqs. (1-2) with\nour finite differences approximation, we stagger the axis\nsuch that we avoid the origin, and in order to achieve the\nsecond order convergence at the axis we use the identity\ndf\n1 ∂f\nx ∂x = 2 dx2 , and code the later expression, which is a\nderivative with respect to x2 .\nPoisson equation. Eq. (2) is an elliptic equation for\nU which we solve using the 2D five-point stencil for the\nderivatives and a successive over-relaxation iterative algorithm with optimal acceleration parameter [16]. In\norder to impose boundary conditions we made sure the\nboundaries are far enough for the number of particles\nrepresented\nby the integral of the density of probability\nR\nN = |ψ|2 d3 x to be the same along the boundary of the\ndomain and used a monopolar term of the gravitational\nfield; that is, we used√ the value U = −N/r along the\nboundaries with r = x2 + z 2 . At the axis we demand\nthe gravitational potential to be symmetric with respect\nto the axis.\nBoundary conditions during the evolution. We use\na sponge in the outermost region of the domain. The\nsponge is a concept used with success in the past when\ndealing with the Schrödinger equation [17, 18]. This\ntechnique consists in adding up to the potential in the\nSchrödinger equation an imaginary part. The result is\nthat in the region where this is applied there is a sink\nof particles, and therefore the density of probability in\nthis region will be damped out, with which we get the\neffects of an outgoing flux boundary condition [18]. The\nexpression we use for the sponge profile is\ni\nV = − V0 {2 + tanh [(rjk − rc )/δ] − tanh (rc /δ)} , (3)\n2\nwhich is a smooth version of a step function\nqwith ampli2 is\ntude V0 , centered at rc and width δ; rjk = x2jk + zjk\nthe radius of a given point of the discretized domain; the\n\n\f3\nminus sign guarantees the decay of the number of particles at the outer parts of our integration domain, that is,\nthe imaginary potential behaves as a sink of particles.\nInitial data. In order to reduce our parameter space\nto specific but illustrative cases, we only consider the\nequal mass head-on collision case. Thus we construct the\nsolution of a spherically symmetric equilibrium ground\nstate configuration in spherical coordinates as done in\n[9, 10, 18]. In the units used the mass of each configuration is N = 2.06 with a radius containing the 95%\nof the total mass is x95 = 3.93 [18]. We obtain a wave\nfunction ψsph and gravitational potential Usph . We then\ninterpolate such wave function at two different places of\nthe two-dimensional grid (0, ±z0 ) centered along the zaxis and define a global wave function ψ = ψ1 + ψ2 ,\nwhere ψ1 and ψ2 are the wave functions obtained from\nthe spherical solution located at two different places of\nthe 2D grid. We choose z0 such that the two configurations are far enough one from the other so that the\ninterference term < ψ1 , ψ2 > lies near to round off error values, in order to consider the two blobs have the\nadequate phase; the magnitude of this term decreases\nexponentially with the initial separation of the blobs. In\nthis way, we solve the Poisson equation sourced by the\nenergy density ρ = |ψ|2 . Then we have initial data for\ntwo superposed ground state equilibrium configurations\nin our axially symmetric domain.\nAnalysis. In order to analyze the kinetic development\nof the collision it is important to track global quantities\nduring the evolution, such as kinetic, gravitational and\ntotal energy. We do this by calculating the expectation\nvalues\nK = −\nW =\n\n1\n2\n\n1\n2\nZ\n\nZ\n\nψ ∗ ∇2 ψd3 x,\n\nψ ∗ U ψd3 x,\n\n(4)\n(5)\n\nwhich are respectively the expectation values of the kinetic and gravitational energies. These quantities are\nimportant at determining the state of the system at any\ntime during the evolution of the system. For instance, the\nvalue of the total energy E = K + W indicates whether\nwe account with a bounded system or not, and the very\nimportant virial theorem relation 2K + W = 0, which is\nnearly satisfied when the system gets virialized and relaxed through whatever channels available, for instance,\nthe emission of scalar field bursts, the so-called gravitational cooling process [19].\n\nin [20]. This scheme allows us to evolve the position, velocity, density, pressure and internal energy of the fluid\nelements. We explore two different scenarios of ideal. In\nthe first one we set the internal energy and pressure equal\nto zero, and in the second one we use the more general\nideal gas equation of state p = (Γ − 1)ρu, where p is the\npressure of the gas, ρ is its density, Γ is a constant and\nu is the internal energy of the gas.\nInitial data. The initial values required for our simulations are the positions, velocities, density, pressure and\ninternal energy of the particles in the fluid.\nWe start choosing the density profile given by the\nPlummer model:\n3M\nρ(r) =\n4πR3\n\nThe SPH algorithm for the fluid\n\nWe want to study the head-on collision of two structures of ideal gas. In order to do that, we need to solve\nEuler's equations coupled to Newtonian gravity. With\nthis in mind, we implemented a smoothed particle hydrodynamic (SPH) code based on the formulation described\n\n(6)\n\nfor the fluid without pressure and the density profile:\n\nρ(r) =\n\nM 1\n,\n2πR2 r\n\n(7)\n\nfor the fluid with pressure.\nWe construct one of the structures using an\nacceptance-rejection method to generate the position of\nthe particles in such a way that they satisfy the corresponding density profile. We set the initial velocities\nof the particles equal to zero and set the parameters\nM = 2.0622 and R = 3.93. Finally, we set the value\nof the internal energy equal to a constant (u = 0 for the\npressureless fluid and u = 0.05M/R in the other case)\nand recover the pressure from the equation of state. Such\nconfigurations are not in equilibrium, therefore we evolve\nthem numerically and let them settle down into an equilibrium state.\nIn order to generate the initial data corresponding to\nthe head-on collision of two bumps of fluid, we take the\nresulting equilibrium configuration described in the previous paragraph, make two copies of it and place them\nat a given separation along the z-axis. Then a boost on\neach of the configurations is applied along the head-on\naxis. The initial positions are z = ±10.0 and the initial\nvelocity is vz0 = ±2.6875/2.0622. This value was chosen\nsuch that the total energy of the system is equal to zero,\nalthough other values of the boost were explored and the\nresults are qualitatively the same.\n\nIII.\nB.\n\n\u0012\n\u0013−5/2\nr2\n1+ 2\n,\nR\n\nRESULTS\n\nWe perform a series of head-on collisions of two initial\nballs in both cases, the one driven by the SP system of\nequations and the fluid driven by hydrodynamics. We set\nup configuration for the SP system and for the fluid that\nare dynamically comparable in time, size and separation.\nThe reason is that there is no way to identify exactly\nan initial configuration corresponding to the quantum\n\n\f4\nmechanical system driven by the Schrödinger equation\n(which is dispersive) with the configurations constructed\nfor an ideal gas.\nWe define the total energy of the system as E = K+W ,\nwhere K and W are the expectation values of the kinetic\ngravitational energies defined in (4-5), calculated with\nthe time-dependent wave function that is being calculated on the fly of the Schrödinger-Poisson system, and\nE = K + U + W is the total energy, that is the sum of the\nkinetic, internal and gravitational energies in the case of\nthe fluid. The total energy depends strongly on the value\nof the initial head-on momentum the initial balls have,\nso that we choose this parameter to be the one we tune\nin order to obtain our initial binary configurations.\nThe parameter space we explore corresponds to initial\nconfigurations with different values of the total energy E,\nwhich allows to explore situations in which the system is\nboth bounded (E < 0) and unbounded (E > 0).\nWe consider there is a pattern formation if there is a\nsequence of strips of the density of matter of the size of\nthe order of the initial radii of the initial configurations\nas shown to happen during the collision of two blobs of\nBEC [12].\nA.\n\nBose condensate initial configurations\n\nWe choose two ground state spherically symmetric\nequilibrium configurations that are originally virialized,\nthat is, they satisfy separately the condition 2K + W = 0\nand superpose them into the 2d grid (for details in the\nconstruction of equilibrium configurations see [18]). We\napply momentum along the head-on direction in the following way: assume ψ = ψ1 + ψ2 is the wave function\nresulting from the superposition of the two equilibrium\nconfigurations, where ψ1 and ψ2 represent the wave function of each of the two equilibrium configurations centered along the head-on axis z at ±z0 , being ψ1 and ψ2\ncentered at −z0 and z0 respectively. Thus we add up\nmomentum to each of the configurations defining a new\nwave function ψ = eipz ψ1 + e−ipz ψ2 . After this process\nwe solve Poisson equation and start the evolution.\nAccording to the Gross-Pitaevskii theory, BECs behave like classical waves, and as such interference phenomena are expected. Experiments showing interference patterns are well known [21]. In these experiments\ntwo separate Bose condensate configurations are released\nfrom their respective traps and allow them to evolve\nfreely; eventually the two densities of probability interfere and produce a total density of the form\n\u0013\nmd\n+Φ ,\n|ψ1 + ψ2 | = |ψ1 | + |ψ2 | + 2 < ψ1 , ψ2 > cos\n~t\n(8)\nwhere m is the mass parameter in Schrödinger's equation,\nand d is the initial distance between the two condensates,\nand Φ is the initial phase difference between the two condensated given by ψ = ψ1 +eiΦ ψ2 , which is nonzero when\n2\n\n2\n\n2\n\n\u0012\n\nthere is a nonzero head-on initial momentum. The density of probability (8) predicts a spacing between two\nconsecutive fringes of constructive interference given by\nλ=\n\nht\n,\nmd\n\n(9)\n\nwhich in our units corresponds to λ = 2πt/d = 2πt/(2z0 ).\nThis type of pattern formation has also been verified\nwith simulations of laboratory systems (see e.g. [22]).\nWe have to remind the reader that an important difference between the conditions in these experiments and our\nsystem is that we actually never release the condensates\nfrom their respective traps which are the gravitational\npotentials the density of probability generates, instead,\nwe allow the traps to interact with each other. Nevertheless we use the formula to measure the distance between\nfringes and find that for big values of the initial head-on\nmomentum pz , that is, a big value of Φ in the experiments, the law is nearly valid, whereas for small phases\nit does not hold. We interpret this result as a consequence of the fact that for the cases where the head-on\nmomentum is small, a merger is actually expected to occur and the interaction between the traps becomes important, whereas in the high momentum a nearly solitonic\ntrespassing effect happens.\nThe parameter space we consider is shown in Table\nI and snapshots of pattern formation are shown in Fig.\n1. Notice that the width of the energy density in the\npatterns is even thicker than the initial size of the equilibrium configurations at initial time.\npz sgn(E) time for collision λ given by (9) λ (measured)\n0.0\n∼ 43\n13.5\n2.9\n0.3\n∼ 21\n6.59\n2.8\n0.5\n∼ 16\n5.03\n2.7\n0.7\n0\n∼ 13\n3.99\n2.3\n1.5\n+\n∼ 6.5\n2.01\n1.8\n2.5\n+\n∼ 4.3\n1.27\n1.2\nTABLE I: Parameters of the initial configurations for the\nBEC case. We also show the value of the distance between\nfringes of interference both, as predicted by formula (9) for\nlaboratory experiments and the one we measure.\n\nWe perform our calculations using the domain x ∈\n[0, 20], z ∈ [−20, 20] and a uniformly discretized grid,\nwith constant time resolution ∆t and the same resolution along both spatial directions ∆x = ∆z = ∆xz\nand a sponge radius with rc = 17 and δ = 1. In order to validate our numerical results we show in Fig. 2\na criterion that shows our results converge. As mentioned above, we use a method of lines with second\norder stencils along the spatial directions and a third\norder accurate integrator in time, so that we expect\nthe code to converge to second order at least. Since\nwe have no exact solution to our problem to compare\nwith, or a constraint of the PDE system of equations\n\n\f5\n3.5\n3\n\n3.5\n\npz = 2.5\n\n3\n\nt=0\n\n4\n\npz = 1.5\n\nt=0\n\nt=4.27\n\nt=6.4\n\n2\n\npz = 1.5\n\n3.5\n\n∆x1\n∆x2\n∆x3\n\n|ψ|\n\n|ψ|\n\n2\n\n2.5\n\n2\n\n2\n\n2.5\n\n1.5\n1\n0.5\n\n2\n\n1\n0.5\n\n3\n\nmax(|ψ| )\n\n1.5\n\n0\n-20\n\n-15\n\n-10\n\n-5\n\n0\n\n5\n\n10\n\n15\n\n0\n-20\n\n20\n\n-15\n\n-10\n\n-5\n\nz\n4\n\n4\n\n3.5\n\n3.5\n\n3\n\npz = 0.7\n\nt=0\n\n10\n\n15\n\n20\n\n2\n\nt=0\nt=15.6\n\n2\n\n2\n\n2.5\n\n1.5\n\npz = 0.5\n\n2.5\n\nt=12.7\n\n2.5\n\n|ψ|\n\n2\n\n|ψ|\n\n5\n\nz\n\n4.5\n\n3\n\n0\n\n1\n\n2\n1.5\n\n1.5\n1\n\n1\n\n0\n-20\n\n0.5\n0\n\n0.5\n\n0.5\n\n-15\n\n-10\n\n-5\n\n0\n\n5\n\n10\n\n15\n\n0\n-20\n\n20\n\n2\n\n4\n\n6\n\n8\n\n10\n\n12\n\n14\n\nt\n-15\n\n-10\n\n-5\n\nz\n\n0\n\n5\n\n10\n\n15\n\n20\n\n2.4\n\nz\n\n3.5\n1.2\n3\n\npz = 0.3\n\npz = 0.0\n\nt=0\n\nt=0\n\nt=42.7\n\npz = 1.5\n\n2.35\n\n1\n\nt=21\n2.5\n\n0.8\n\n2\n\n|ψ|\n\n|ψ|\n\n2\n\n2\n1.5\n\nQ\n\n1.5\n\n0.2\n\n0.5\n0\n-20\n\n2.3\n\n0.6\n\n0.4\n\n1\n\n-15\n\n-10\n\n-5\n\n0\n\n5\n\n10\n\n15\n\n20\n\n0\n-20\n\n-15\n\n-10\n\n-5\n\nz\n\n0\n\n5\n\n10\n\n15\n\n2.25\n\n20\n\nz\n\n2.2\n\nFIG. 1: We show the best snapshot of the density |ψ|2 along\nthe z axis showing the interference pattern. We also show the\ninitial value of the density, in order to compare the size of the\ninterference pattern.\n\nwe should expect to be satisfied, we can only practice a\nself-convergence test, that is, we use three different resolutions ∆xz1 = 0.2, ∆xz2 = 0.13333 = ∆xz1 /1.5 and\n∆xz3 = 0.08888 = ∆xz2 /1.5 and track the maximum of\nthe energy density ρbec = |ψ|2 , which corresponds to the\ninfinity norm of ρbec because it is always non-negative.\nGiven the ratio between our resolutions is 1.5, we expect\nthe maximum of the density to satisfy\nmax(ρbec [using ∆x1 ]) − max(ρbec [using ∆x2 ])\n= 1.5Q ,\nmax(ρbec [using ∆x2 ]) − max(ρbec [using ∆x3 ])\n(10)\nwhere Q is the order of convergence expected to hold,\nwhich is at least two in our case because such is the order of accuracy of our stencils along the spatial directions\nand at most three, which is the accuracy of our time integrator. In Fig. 2 we also show the value of Q. In all our\ncalculations we kept the factor ∆t/∆xz 2 = 0.1 constant\nfor all the resolutions, which maintains the evolution stable, accurate and convergent.\n\nB.\n\nFluid configurations\n\nWe evolve the initial configurations of fluid integrating\nEuler's equations using a predictor-corrector scheme. We\ncompute the total, kinetic, potential and internal energy\nof the system in order to monitor the behavior of our\nnumerical evolution.\nThe first case we analyzed is the pressureless fluid. In\n\n2.15\n\n2.1\n0\n\n2\n\n4\n\n6\n\n8\n\n10\n\n12\n\n14\n\nt\n\nFIG. 2: (Top) In order to show the convergence of our algorithms we track the maximum of the energy density during\nthe evolution for the particular case pz = 1.5, which would\nbe equivalent to estimate the infinity norm of the energy density. In our calculations we used three different resolutions\n∆x1 = 0.2, ∆x2 = ∆x1 /1.5 and ∆x3 = ∆x2 /1.5. (Bottom)\nWe show the convergence factor, that is 1.5Q , which in theory should be 1.52 = 2.25 for a second order convergent implementation. We show how much our calculations approach\nsecond order convergence; the convergence factor oscillates\nusually near or around the theoretical value due to phases in\nthe scalar (the maximum of the density in our case) for the\nvarious resolutions. A big peak also appears approximately\nby the time the density approaches its maximum, and we see\nhow convergence is lost after around t ∼ 11 and decreases\nclearly afterwards by the time the blobs reach the sponge region, where the calculations are not expected to converge since\nthere Schrödinger's equation has been modified with an artificial sink of particles, and also the unitarity of the evolution\nin the numerical domain is lost.\n\nFig. 3 we show snapshots at different times of the density\nas function of the z-position of the particles. The time\nof collision is around t ∼ 7.2 and it is clear that no interference pattern is generated during such a collision. In\nFig. 4 we show the kinetic, potential, internal and total\nenergy of the system, in which it can be noticed that no\ninternal energy is being involved in the model.\nThe second case is the ideal gas case with pressure. As\nbefore, in Fig. 5 we present the density as function of\nthe position for different times and in Fig. 6 the energies\nof the system. In this scenario, again, we were unable to\n\n\f6\n5\n\n8\n\n4.5\n\n7\n\n4\n\nt=0\n\nt=6.2\n\n6\n\n3.5\n5\n\nρ\n\n3\n\nρ\n\ntrack any interference patterns. These figures illustrate\nthe role played by the pressure, which produces the density profiles to be less steep compared to the pressureless\ncase.\n\n2.5\n2\n\n4\n\n3\n\n1.5\n2\n10\n\n500\n\n1\n\n9\n\n450\n\n0.5\n\n8\n\n400\n\nt=0\n\n7\n\n350\n\n6\n\n300\n\n1\n\n0\n-15\n\nt=7.0\n\n-10\n\n-5\n\n0\n\n5\n\n10\n\n0\n-10\n\n15\n\n150\n\n2\n\n100\n\n1\n\n50\n\nρ\n\n3\n\n0\n-15\n\n7\n\nt=6.7\n\n6\n\n6\n\n5\n\n5\n\nρ\n\nρ\n\nρ\n\n7\n\n200\n\n-5\n\n0\n\n5\n\n10\n\n15\n\n-4\n\n-2\n\n0\n\n2\n\n4\n\nt=7.2\n\n4\n\n3\n\n3\n\n2\n\n2\n\n4\n\nz\n\n500\n\n500\n\n450\n\n450\n\n400\n\n1\n\n400\n\nt=7.1\n\n350\n\n1\n\n0\n-10\n\nt=7.2\n\n-5\n\n0\n\n5\n\n0\n-10\n\n10\n\n0\n\n5\n\n10\n\nz\n8\n\n300\n\n250\n\n7\n\n150\n\n150\n\n100\n\n100\n\n50\n\n50\n\n0\n\n0\n\nρ\n\n200\n\n-4\n\n-2\n\n0\n\n2\n\n4\n\n-4\n\n-2\n\nz\n\n0\n\n2\n\n500\n\n450\n\n450\n\n400\n\n350\n\n300\n\n300\n\nρ\n\n350\n\n250\n\n200\n\n150\n\n150\n\n100\n\n100\n\n50\n\n-2\n\n0\n\n2\n\n4\n\n-4\n\nz\n\n-2\n\n0\n\n2\n\n4\n\n3\n\n3\n\n2\n\n2\n\n1\n\n-5\n\n0\n\n5\n\n10\n\n0\n-10\n\n-5\n\n0\n\n5\n\n10\n\nz\n\nFIG. 5: In this plot we show snapshots at different times of\nthe density as function of the z coordinate of the structures\nof fluid. As in the pressureless case, the evolution shows the\nfluids crossing each other without showing any pattern of interference.\n\n0\n-4\n\n5\n\n4\n\nt=8.2\n\nz\n\n50\n\n0\n\n5\n\n0\n-10\n\nt=7.4\n\n250\n\n200\n\n6\n\n1\n\n400\n\nt=7.3\n\n6\n\n4\n\nz\n\n500\n\n7\n\nt=7.7\n\n250\n\n200\n\nρ\n\nρ\n\n300\n\n-5\n\nz\n\n350\n8\n\nρ\n\n10\n\n0\n-10\n\nz\n\nρ\n\n5\n\n8\n\n250\n\n4\n\n0\n\nz\n\n8\n\n5\n\n-5\n\nz\n\n4\n\nz\n\nFIG. 3: In this plot we show snapshots at different times of\nthe density as function of the z coordinate of the structures\nof an ideal gas with zero pressure. The collision takes place\nafter t ∼ 7.2. The evolution shows that the fluids cross each\nother without showing any pattern of interference.\n\n5\n\nEnergy\n\n20\n\nKinetic\nPotential\nInternal\nTotal\n\n0\n\nKinetic\nPotential\nInternal\nTotal\n\n10\n\nEnergy\n\n-5\n0\n\n0\n\n10\nt\n\n15\n\n20\n\nFIG. 6: In this plot we show the total, kinetic, potential and\nthermal energy for the head-on collision of fluid with pressure.\n\n-10\n\n-20\n\n5\n\n0\n\n5\n\n10\nt\n\n15\n\n20\n\nFIG. 4: In this plot we show the total, kinetic, potential and\nthermal energy for the head-on collision of the pressureless\nfluid configurations. The peak appears approximately by the\ntime the density of the fluid reaches its maximum.\n\nWe have also performed simulations with various values of the initial linear momentum in the head-on direction and thus various values of the total energy of the\nsystem. We have also carried out our simulations with\nvarious numbers of particles and in all the cases the re-\n\nsults are qualitatively the same.\n\nIV.\n\nCONCLUSIONS\n\nWe have solved the SP system as the equations describing the evolution of gravitating Bose condensates, which\nrepresents the BEC dark matter model and its properties\nat local scales. We have focused on the head-on collision\nof two equilibrium ground state configurations, and studied the interference pattern formation of the density of\nthe configuration during the collision.\n\n\f7\nIn order to investigate whether or not other type of fluids may show a similar interference pattern, we also studied the collision of two spherical configurations made of\nan ideal gas fluid, both with and without pressure using\nSPH techniques for different values of the total energy.\nWe found that the pattern formation during the collision of structures does not happen for the fluid. This\nleads to the conclusion that a fingerprint of the BEC dark\nmatter model is the presence of interference patterns during the collision of structures. That is, if evidence of such\ninterference patterns is not found, the BEC dark matter\n\nmodel should be ruled out.\n\n[1] V. Sahni, L. Wang, Phys. Rev. D 62, 103517 (2000).\n[2] T. Matos, L. A. Urena-Lopez, Phys. Rev. D 63, 063506\n(2001).\n[3] Jae-weon Lee, In-guy Koh, Phys.Rev. D53 (1996) 22362239.\n[4] F.\nSiddhartha\nGuzman,\nTonatiuh\nMatos,\nClass.Quant.Grav.17:L9-L16,2000. T. Matos, F. S.\nGuzman,\nD. Nunez,\nPhys.Rev.D62:061301,2000.\nK. K. Nandi, I. Valitov, N. G. Migranov,\nPhys.Rev.D80:047301,2009.\n[5] A. Arbey, J. Lesgourgues and P. Salati, Phys. Rev. D 64,\n123528 (2001). A. Arbey, J. Lesgourgues and P. Salati,\nPhys. Rev. D 65, 083514 (2002).\n[6] A. Bernal, T. Matos, D. Nunez, Rev. Mex. A&A 44, 149\n(2008).\n[7] T. Harko, arXiv:1101.3655v2 [gr-qc].\n[8] M. Alcubierre, F. S. Guzman, T. Matos, D. Nunez, L. A.\nUrena-Lopez and P. Wiederhold, Class. Quantum Grav.\n19, 5017 (2002).\n[9] F. S. Guzman, L. A. Urena-Lopez, Phys. Rev. D 68,\n024023 (2003).\n[10] F. S. Guzman, L. A. Urena-Lopez, ApJ. 645, 814 (2006).\n[11] A. Bernal, F. S. Guzman, Phys. Rev. D 74, 063504\n(2006).\n\n[12] A. Bernal, F. S. Guzman, Phys. Rev. D 74,\n103002 (2006). Jae-Weon Lee, Sooil Lim, Dale Choi,\narXiv:0805.3827v1 [hep-ph].\n[13] L. P. Pitaevskii, Zh. Eksp. Teor. Fiz. 40, 646 (1961) [Sov.\nPhys. JETP 13, 451 (1961)]. E. P. Gross, J. Math. Phys.\n4, 195 (1963).\n[14] D. J. Kaup, Phys. Rev. 172, 1331 (1968)\n[15] D. I. Choi, 1998, Ph D Thesis, The University of Texas\nat Austin. D. I. Choi, Phys. Rev A 66, 063609 (2002).\n[16] Smith G. D., 1965. Numerical Solution of Partial Differential Equations, Oxford University Press.\n[17] M. Israeli and S. A. Orszag, J. Comp. Phys. 41, 115\n(1981).\n[18] F. S. Guzman, L. A. Urena-Lopez, Phys. Rev. D 69,\n124033 (2004).\n[19] Edward Seidel, Wai-Mo Suen, Phys.Rev.Lett.72:25162519,1994.\n[20] Stephan Rosswog New Astronomy Reviews:53, 78 (2009)\n[21] M. R. Andrews, C. G. Towsend et al., Science 275 (1997)\n637.\n[22] A. Röhrl, M. Narashevski, A. Schenzle and H. Wallis,\nPhys. Rev. Lett. 78 (1997) 4143.\n\nAcknowledgments\n\nThis work is supported by Grant Nos. CIC-UMSNH4.9 and 4.23, PROMEP UMICH-CA-22, UMICH-PTC210, CONACyT 79601 and 106466. Our simulations were\ncarried out in the IFM Cluster.\n\n\f"}