{"id": "http://arxiv.org/abs/1204.3518v3", "guidislink": true, "updated": "2012-05-29T15:58:18Z", "updated_parsed": [2012, 5, 29, 15, 58, 18, 1, 150, 0], "published": "2012-04-16T15:18:14Z", "published_parsed": [2012, 4, 16, 15, 18, 14, 0, 107, 0], "title": "Physical descriptions of the bacterial nucleoid at large scales, and\n  their biological implications", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1204.5242%2C1204.2174%2C1204.5292%2C1204.1383%2C1204.6477%2C1204.5524%2C1204.5786%2C1204.0738%2C1204.1019%2C1204.5191%2C1204.2468%2C1204.1045%2C1204.3387%2C1204.1684%2C1204.5855%2C1204.0218%2C1204.1009%2C1204.3518%2C1204.0070%2C1204.2947%2C1204.2525%2C1204.1369%2C1204.2441%2C1204.4721%2C1204.1592%2C1204.4347%2C1204.4830%2C1204.1433%2C1204.5985%2C1204.5144%2C1204.3447%2C1204.3290%2C1204.3375%2C1204.1657%2C1204.4914%2C1204.4130%2C1204.2716%2C1204.1668%2C1204.6547%2C1204.1723%2C1204.0043%2C1204.2454%2C1204.4047%2C1204.5135%2C1204.4038%2C1204.2739%2C1204.2993%2C1204.4533%2C1204.2373%2C1204.4718%2C1204.0362%2C1204.0289%2C1204.6126%2C1204.4484%2C1204.5246%2C1204.0022%2C1204.5430%2C1204.3252%2C1204.1122%2C1204.2211%2C1204.1874%2C1204.3972%2C1204.5543%2C1204.5705%2C1204.0721%2C1204.5825%2C1204.2119%2C1204.4161%2C1204.1161%2C1204.2481%2C1204.2263%2C1204.6134%2C1204.2273%2C1204.0399%2C1204.1566%2C1204.0366%2C1204.1810%2C1204.3271%2C1204.1568%2C1204.3186%2C1204.3793%2C1204.2367%2C1204.2292%2C1204.1238%2C1204.5553%2C1204.6425%2C1204.4575%2C1204.0302%2C1204.3998%2C1204.1361%2C1204.4231%2C1204.2644%2C1204.5340%2C1204.6226%2C1204.0833%2C1204.0912%2C1204.1352%2C1204.5197%2C1204.4732%2C1204.6454%2C1204.1607&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Physical descriptions of the bacterial nucleoid at large scales, and\n  their biological implications"}, "summary": "Recent experimental and theoretical approaches have attempted to quantify the\nphysical organization (compaction and geometry) of the bacterial chromosome\nwith its complement of proteins (the nucleoid). The genomic DNA exists in a\ncomplex and dynamic protein-rich state, which is highly organised at various\nlength scales. This has implications on modulating (when not enabling) the core\nbiological processes of replication, transcription, segregation. We overview\nthe progress in this area, driven in the last few years by new scientific ideas\nand new interdisciplinary experimental techniques, ranging from high space- and\ntime-resolution microscopy to high-throughput genomics employing sequencing to\nmap different aspects of the nucleoid-related interactome. The aim of this\nreview is to present the wide spectrum of experimental and theoretical findings\ncoherently, from a physics viewpoint. We also discuss some attempts of\ninterpretation that unify different results, highlighting the role that\nstatistical and soft condensed matter physics, and in particular classic and\nmore modern tools from the theory of polymers, plays in describing this system\nof fundamental biological importance, and pointing to possible directions for\nfuture investigation.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1204.5242%2C1204.2174%2C1204.5292%2C1204.1383%2C1204.6477%2C1204.5524%2C1204.5786%2C1204.0738%2C1204.1019%2C1204.5191%2C1204.2468%2C1204.1045%2C1204.3387%2C1204.1684%2C1204.5855%2C1204.0218%2C1204.1009%2C1204.3518%2C1204.0070%2C1204.2947%2C1204.2525%2C1204.1369%2C1204.2441%2C1204.4721%2C1204.1592%2C1204.4347%2C1204.4830%2C1204.1433%2C1204.5985%2C1204.5144%2C1204.3447%2C1204.3290%2C1204.3375%2C1204.1657%2C1204.4914%2C1204.4130%2C1204.2716%2C1204.1668%2C1204.6547%2C1204.1723%2C1204.0043%2C1204.2454%2C1204.4047%2C1204.5135%2C1204.4038%2C1204.2739%2C1204.2993%2C1204.4533%2C1204.2373%2C1204.4718%2C1204.0362%2C1204.0289%2C1204.6126%2C1204.4484%2C1204.5246%2C1204.0022%2C1204.5430%2C1204.3252%2C1204.1122%2C1204.2211%2C1204.1874%2C1204.3972%2C1204.5543%2C1204.5705%2C1204.0721%2C1204.5825%2C1204.2119%2C1204.4161%2C1204.1161%2C1204.2481%2C1204.2263%2C1204.6134%2C1204.2273%2C1204.0399%2C1204.1566%2C1204.0366%2C1204.1810%2C1204.3271%2C1204.1568%2C1204.3186%2C1204.3793%2C1204.2367%2C1204.2292%2C1204.1238%2C1204.5553%2C1204.6425%2C1204.4575%2C1204.0302%2C1204.3998%2C1204.1361%2C1204.4231%2C1204.2644%2C1204.5340%2C1204.6226%2C1204.0833%2C1204.0912%2C1204.1352%2C1204.5197%2C1204.4732%2C1204.6454%2C1204.1607&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Recent experimental and theoretical approaches have attempted to quantify the\nphysical organization (compaction and geometry) of the bacterial chromosome\nwith its complement of proteins (the nucleoid). The genomic DNA exists in a\ncomplex and dynamic protein-rich state, which is highly organised at various\nlength scales. This has implications on modulating (when not enabling) the core\nbiological processes of replication, transcription, segregation. We overview\nthe progress in this area, driven in the last few years by new scientific ideas\nand new interdisciplinary experimental techniques, ranging from high space- and\ntime-resolution microscopy to high-throughput genomics employing sequencing to\nmap different aspects of the nucleoid-related interactome. The aim of this\nreview is to present the wide spectrum of experimental and theoretical findings\ncoherently, from a physics viewpoint. We also discuss some attempts of\ninterpretation that unify different results, highlighting the role that\nstatistical and soft condensed matter physics, and in particular classic and\nmore modern tools from the theory of polymers, plays in describing this system\nof fundamental biological importance, and pointing to possible directions for\nfuture investigation."}, "authors": ["Vincenzo G. Benza", "Bruno Bassetti", "Kevin D. Dorfman", "Vittore F. Scolari", "Krystyna Bromek", "Pietro Cicuta", "Marco Cosentino Lagomarsino"], "author_detail": {"name": "Marco Cosentino Lagomarsino"}, "author": "Marco Cosentino Lagomarsino", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1088/0034-4885/75/7/076602", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1204.3518v3", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1204.3518v3", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "30 pages, accepted for publication in Reports on Progress in Physics", "arxiv_primary_category": {"term": "physics.bio-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "physics.bio-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "cond-mat.soft", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "q-bio.GN", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1204.3518v3", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1204.3518v3", "journal_reference": null, "doi": "10.1088/0034-4885/75/7/076602", "fulltext": "Physical descriptions of the bacterial nucleoid at large scales,\nand their biological implications.\nVincenzo G. Benza,1 Bruno Bassetti,2, 3 Kevin D. Dorfman,4 Vittore F. Scolari,5, 6 Krystyna\nBromek,7 Pietro Cicuta,7 and Marco Cosentino Lagomarsino5, 6\n1 Dipartimento\n\ndi Fisica e Matematica, Università dell'Insubria, Como, Italy\ndegli Studi di Milano, Dip. Fisica, Via Celoria 16, 20133 Milano, Italy\n3 I.N.F.N. Milano, Via Celoria 16, 20133 Milano, Italy\n4 Department of Chemical Engineering and Materials Science, University of Minnesota - Twin Cities,\n421 Washington Ave. SE, Minneapolis, Minnesota 55455, United States\n5 Genomic Physics Group, UMR 7238 CNRS \"Microorganism Genomics\"\n6 University Pierre et Marie Curie, 15 rue de l'École de Médecine Paris, France\n7 Cavendish Laboratory and Nanoscience Centre, University of Cambridge, Cambridge CB3 0HE,\nU. K.\n\narXiv:1204.3518v3 [physics.bio-ph] 29 May 2012\n\n2 Università\n\nRecent experimental and theoretical approaches have attempted to quantify the\nphysical organization (compaction and geometry) of the bacterial chromosome with\nits complement of proteins (the nucleoid). The genomic DNA exists in a complex\nand dynamic protein-rich state, which is highly organised at various length scales.\nThis has implications for modulating (when not directly enabling) the core biological processes of replication, transcription, segregation. We overview the progress\nin this area, driven in the last few years by new scientific ideas and new interdisciplinary experimental techniques, ranging from high space- and time-resolution\nmicroscopy to high-throughput genomics employing sequencing to map different aspects of the nucleoid-related interactome. The aim of this review is to present the\nwide spectrum of experimental and theoretical findings coherently, from a physics\nviewpoint. In particular, we highlight the role that statistical and soft condensed\nmatter physics play in describing this system of fundamental biological importance,\nspecifically reviewing classic and more modern tools from the theory of polymers.\nWe also discuss some attempts towards unifying interpretations of the current results, pointing to possible directions for future investigation.\n\nI. INTRODUCTION\n\nThe demarcation line between a \"physical\" and a \"biological\" system is rapidly becoming\nanachronistic, to the point that it possibly hinders research in both disciplines. This is particularly true in the context of gene expression, which is a fundamental process in biology at\nthe molecular level, common to all life on earth: the genetic code is read out (\"transcribed\")\nfrom DNA and written into RNA, which, in the case of messenger RNA, is then translated into\nproteins. In order for the right number of proteins to be produced in response to changes in\nenvironment, internal states, and stimuli, all cells are capable of tightly regulating this sequence\nof events (Alberts et al., 2008). The physico-chemical implementation of this gene regulation\n\n\f2\nprocess takes place primarily through specific DNA-binding interactions of transcription factors,\nwhich repress or promote transcription.\nIt is becoming very clear that the genome's conformational properties as a polymer come\ninto play in the processes involved in the regulatory fine-tuning of gene expression, in particular\nits topological, chemical, geometric and mechanical properties. These properties can influence\nthe activity of the transcription factors and can play a role in the coordination of a large scale\ncellular response. Evidence for this level of regulation has been found in the different kingdoms\nof life. We focus here on the efforts to describe the genome's physical state in the case of\nbacteria, where it is (perhaps surprisingly) less explored than for higher life forms.\nUnderstanding this problem requires stringent, quantitative experiments with the standards\nof physics, together with up-to-date physical models and arguments. Since considerable knowledge has been developed in polymer science over the last 50 years, it is very tempting to try\nto apply this knowledge to understand the energy and time scales involved in maintaining\nthe DNA at the same time compact and accessible inside a cell, and the role of its geometry,\nstructure and compaction in gene regulation.\nThis review discusses challenges that arise in the biological arena, in which mature experimental and theoretical tools from the physical sciences might now allow significant progress.\nThe review is primarily aimed at our colleagues in the physical sciences: it should communicate a feel for the main questions and the main challenges, and our understanding that a\ncomprehensive physical approach is possible and necessary at this point. We will not explain\nthe physical models in great technical detail, and we hope this work will also be of interest\nto biologists who could take the references given here as a starting point and a \"compass\" in\norder to evaluate different modelling approaches. Ultimately, we believe that optimal progress\nin this area will take place in collaboration, and this review might contribute to establishing a\ncommon ground and language.\n\nBOX 1: Main factors affecting nucleoid organization.\n\nSupercoiling by topoisomerases. These enzymes affect the winding of DNA, and play a\nrole in the creation of the observed branched structure of plectonemic loops along the genome.\nNucleoid associated proteins (NAPs). These proteins bind to DNA with different specific modes, each responsible for a different aspect of organization, ranging from double-strand\nbridging to nucleoprotein filament formation. Confinement. Millimeters of genomic DNA are\nconfined within the small cell volume of a bacterium. Molecular crowding. There is a high\nconcentration of macromolecules present in the cytoplasm, This factor could affect nucleoid\norganization at different levels, for example creating a general effective self-attraction favoring\ncollapse, and strong depletion attraction between large objects, such as ribosomes. Replication and transcription. These are the non-equilibrium processes of DNA and mRNA\nproduction that continuously take place in dividing cells. The first affects the sheer amount\nof genome present and supercoiling and makes both highly nonsteady, the second can create uneven ribosome concentrations. Both contribute to non-thermal force and displacement\nfluctuations of the chromosome.\n\n\f3\nII. BACKGROUND\n\nBacteria are single cell organisms of fundamental importance in nature and to mankind.\nThey are \"prokaryotes\", in the etymological sense that they lack a nucleus as a compartment\nenclosed by a membrane (in contrast to the \"eukaryotic\" cells that make up animals and plants).\nIndeed, all the DNA, RNA, and proteins in the bacterial cell are always present together in\nthe same single compartment. While the classical picture of bacteria (still implicitly adopted\nby many theoretical and experimental investigators) views them as little more than a bag (or\n\"well-stirred reactor\") of proteins and DNA, it is now clear that this tenet is flawed on many\ndifferent levels. Despite their lack of membrane-bound organelles, bacteria have a high degree\nof intracellular spatial organization, related to most cellular processes. Perhaps the highest\norganized structure of the bacterial cell is the genome itself.\nIn most bacteria, the chromosome is a single circular DNA molecule confined by the cell\nmembrane. In E. coli (the best studied bacterial system), the chromosome consists of about\n4.7 million base pairs (bp) and has a total length of 1.5 mm (Stavans & Oppenheim, 2006;\nTrun & Marko, 1998). Bacterial DNA is organized into a specific structure called the nucleoid,\nwhich is composed of DNA, RNA and proteins, and occupies a well-defined region of the\ncell (Sherratt, 2003). The nucleoid is organized by a set of nucleoid associated proteins, or\n\"NAPs\" (such as Dps and transcription factors Fis, H-NS, IHF, HU), which can modify the\nshape of the DNA both at local and global levels (Luijsterburg et al., 2006; Ohniwa et al.,\n2011). Since the linear size of the genomic DNA is orders of magnitude larger than the length\nof the cell, it must be packaged and organized in such a way that the resulting structure is\ncompact, while still allowing the primary information processing, genome replication and gene\nexpression (Thanbichler et al., 2005). In fact, recent evidence strongly suggests that changes\nin chromosome architecture can directly affect the accessibility and activity of the regulatory\nproteins at the local level as well as at larger scales. In addition, the genome can efficiently\ncontrol gene expression by changing the way DNA-binding regulatory proteins can access their\ntarget sites via the chromosome architecture (Dillon & Dorman, 2010). Historically, the nucleoid\nhas been visualized by transmission electron microscopy (TEM), phase-contrast microscopy\nand confocal scanning light microscopy; an overview of early microscopic visualization of the\nnucleoid can be found in (Robinow & Kellenberger, 1994). These studies showed that the\nnucleoid mostly occupies a separate subcellular region, without being bound by a membrane,\nand that thin DNA threads extrude from this region.\nThe double-stranded genomic DNA is generally torsionally constrained in bacteria, typically\nin such a way that its linking number (the number of times each single strand of DNA winds\naround the other) is lower than in the relaxed configuration. In biological words this is referred\nto as \"negatively supercoiled\", and the specific difference in linking number is called superhelical density. The name is due to the fact that supercoiled DNA develops nonzero writhe, or\n\"supercoils\", i.e. it is wrapped around itself in the manner of a twisted telephone cord. This\ntorsional constraint has important consequences for gene expression, as the mechanical stress\ncarried by a negatively supercoiled configuration can locally weaken the interaction between\nthe two strands. The resultant breaking of base-pair bonds between the two helices is required\nfor the initial steps of transcription, as well as DNA replication and recombination. Since most\nDNA-binding proteins bind to DNA sensitively to the arrangement of the two strands, and in\nparticular to their average distance, negative supercoiling usually also facilitates protein binding (Dillon & Dorman, 2010). The level of supercoiling is tightly regulated by the cell, and it\ncan be changed by the action of specific enzymes such as topoisomerases and gyrases.\nThe average supercoiling is generally negative in bacterial cells (except for thermophilic\nbacteria (Confalonieri et al., 1993)). In the case of E. coli, the supercoiling superhelical density\nis maintained around the value σ = −0.025, where the supercoil density σ is defined as the\nrelative change in linking number due to the winding (or unwinding) of the double helix, where\nnegative values of σ correspond to an unwound helix (Stavans & Oppenheim, 2006). This\n\n\f4\nvalue is set by the constraining action of DNA-binding proteins and the combined activity of\ntopoisomerases. Deviations larger than 20% to either side of σ are detrimental to cell growth.\nFor example, overwinding causes the formation of DNA structures that impede transcription\nand replication, while excessive underwinding leads to poor chromosome segregation (Stavans\n& Oppenheim, 2006).\nThe most important features linking nucleoid organization and cell physiology are summarized here, and discussed further in the review. See also BOX 1 on page 2 for a brief description\nof the main factors affecting nucleoid organization.\n(i) At large scales, it is seen from in vitro experiments that the nucleoid is composed of\ntopologically unlinked dynamic domain structures; these are due to supercoiling forming\nplectonemes and toroids (Marko & Cocco, 2003), and stabilized by nucleoid-associated\nproteins, for example Fis. This combination of effects gives the chromosome the shape\nof a branched tree-like polymer visible from TEM (Kavenoff & Bowen, 1976; Postow\net al., 2004; Skoko et al., 2006). Topological domains are thought to be packaged during\nreplication, otherwise it appears that their boundaries are \"fluid\" and randomly distributed (Postow et al., 2004; Thanbichler & Shapiro, 2006).\n(ii) Strong compaction is experimentally observed in vivo, and possibly arises from confinement within the cell boundaries, but also from various factors such as molecular crowding (de Vries, 2010) and supercoiling (Stuger et al., 2002). The degree of compaction\nchanges with the cell's growth conditions and in response to specific kinds of stress. The\nE. coli chromosome, with a linear size of 1.5mm, occupies a volume of 0.1-0.2 μm3 (the\nbare DNA volume is about a factor 20-30 smaller), which brings the need to study the\nfolding geometry of the nucleoid (Stavans & Oppenheim, 2006);\n(iii) Supercoiling and nucleoid organization play an important role in gene expression (Dillon\n& Dorman, 2010). For example, during rapid growth, while several chromosome equivalents are present in the cell due to multiple ongoing replication cycles, an increased\nproduction of some nucleoid-associated proteins is observed, compacting the chromosome\nand probably giving rise to specific transcription patterns in a way that is not yet fully\ncharacterized.\n(iv) RNA polymerase, the nucleoid-bound enzyme responsible for gene transcription, is concentrated into transcription foci or \"factories,\" which can affect the nucleoid structure by\nbringing together distant loci (Grainger et al., 2005; Jin & Cabrera, 2006).\n(v) For cells that are not replicating the genome, the position of genetic loci along the chromosome is linearly correlated with their position in the cell (Breier & Cozzarelli, 2004;\nViollier et al., 2004; Wiggins et al., 2010). The exact subcellular positioning of different\nloci varies in different bacteria (Toro & Shapiro, 2010).\n(vi) During replication, daughter chromosomes demix and segregate before cell division. In\nE. coli, the two arms of the chromosome are segregated in an organized <left-rightleft-right> asymmetric fashion from the center of the cell (Nielsen et al., 2007; Toro\n& Shapiro, 2010; Wang et al., 2006). Replicated chromosomal loci are thought to be\nimmediately recondensed, as they appear to preserve the linear arrangement while they\nare moved in opposite directions to assume their final position in the incipient daughter\ncell (Thanbichler et al., 2005; Thanbichler & Shapiro, 2006).\nIn short, the nucleoid's physical organization plays a major role in the most important\ncellular processes, such as cell division, DNA replication, and gene expression. Explaining\nthese links is a long-standing open problem in microbiology. Today, it can be revisited with\nnew quantitative experiments, including both the \"-omics\" approaches and more sophisticated\n\n\f5\nand controlled experimental techniques allowing the analysis of nucleoids both in vitro and in\nvivo. This is paralleled by a renewed interest in the quantitative characterization of bacterial\nphysiology (Scott & Hwa, 2011; Scott et al., 2010; Zaslaver et al., 2009), of which the nucleoid\nconstitutes a fundamental part. Also note that the relative chromosomal positioning and the\norientation of genes are subject to natural selection on evolutionary time-scales as shown by\nthe comparison of the genetic maps of different bacteria (Ochman & Groisman, 1994; Rocha,\n2008).\nConsequently, the field is blossoming with a new wave of studies, hypotheses and findings.\nWhile many new pieces of evidence are available, the challenge of building coherent pictures\nfor physical nucleoid organization and its role in the different cell processes remains open. Our\nscope here is to present the main hypotheses and the experimental and modeling tools that\nhave been put forward in order to understand the physical aspects of nucleoid organization,\nand give the interested reader an ordered account of the known facts.\nIII. MEASUREMENTS\n\nWe start by reviewing some of the salient experimental findings at the scale of wholenucleoids, with a particular emphasis on the more recent results. The evidence that we will\ndiscuss emerges from a combination of experimental biology, biophysics, high throughput biology and bioinformatic approaches (see BOX 2 on page 6). Most of the studies reviewed here\nare based on E. coli or Caulobacter.\n\n\f6\n\nBOX 2: Several available experimental techniques can probe the nucleoid at large\nscales.\nExperiments probing the nucleoid at large scales\ncell\n\nPurified nucleoids\n\nFluorescently tagged loci and NAPs\nIn Vivo\nmean-square\ndisplacement\n\nHigh-resolution dynamic tracking\n\nlysis\n\nShort-time\nsubdiffusive behavior\nLong-time trajectories\ntime\n\nLoci Tracking\n\ngenome\n\nSubdiffusion\n\nOriC\n\nSpatial arrangement in single cells\nLinear chromosome organization\nSegregation choreography\n\nFCS / AFM\nStructural units\n\nL\n\nR\n\nOri\n\nL\n\nOri\n\nL Ori\n\nR\n\nR\n\nMacrodomain arrangement\n\nAFM\nFiber formation\n\nNAP clusters\n\nHigh-throughput molecular biology techniques\nTranscriptomics\n\nResponse to nucleoid perturbations\n\nOriC\n\nDetection of macrodomain\norganization\n\nBinding of NAPs\nChIP-chip, ChIP-seq binding profiles\n\nx\n\nRandom recombination\nlibraries\nL\n\nrecombination\nbarriers\nR\nTer\n\n3C cross\nlinking\n\nChromosome Conformation Capture (3C)\nDetection of spatially co-localized loci\n\nAdvanced microscopy together with cell-biological techniques yield information about structure and dynamics of the nucleoid (Right). High-resolution tracking of tagged loci allows\nmeasurement of the local viscoelastic properties of the nucleoid. Static configurations of\nchromosomal loci in fixed cells allow determination of their spatial arrangement within nondividing cells and following cell division. Dynamic tracking at long time scales gives information\non the chromosome's \"choreography\" followed over a cell cycle and on the macrodomain\nsubcellular arrangement. Fusions of NAPs with fluorescent proteins also enable evaluation of\ntheir localization within the nucleoid.\nNucleoids can be purified and manipulated outside of a cell in order to access more directly\ntheir biophysical properties (Left). This procedure implies release of confinement and crowding,\nand dilution of binding proteins. As a result, purified nucleoids are several times larger in radius\nthan the size of a cell. Traditionally, purified nucleoids were imaged by electron microscopy,\nshowing a ramified plectonemic structures. More recently, investigators have concentrated on\ncharacterizing their organization as polymers tracking of labelled loci, fluorescence correlation spectroscopy(FCS) and probing them mechanically (AFM).\nIn addition, information on nucleoid organization can be obtained from high-throughput\nexperimental datasets (Bottom). Transcriptomics (using sequencing or microarrays) can\nbe used to probe transcriptional response to nucleoid perturbations, such as NAP deletions,\nchanges in the average level of supercoiling, or local release of a plectonemic loop. Another\nimportant source of data is protein occupancy, for example by NAPs, and its correlation\nwith gene expression. This information is obtained both by microarray (CHiP-chip) and by\nnext-generation sequencing techniques (ChIP-seq). Recombination has been used to define\nmacrodomains, as compartments within which recombination between chromosomal segments\nwas more likely than recombination with segments laying outside of the compartment. Finally,\nChromosome Conformation Capture (3C) techniques probe the spatial vicinity of pairs\nof chromosomal loci in the (average) cell. They can be combined with sequencing in order to\nproduce high-throughput data sets (Hi-C).\n\n\f7\nStrikingly, the intracellular localization of a given chromosomal locus in a cell is remarkably deterministic, as revealed by\nfluorescent tagging of chromosomal loci on E. coli and Caulobacter crescentus (Liu et al., 2010;\nNielsen et al., 2006; Niki et al., 2000; Viollier et al., 2004; Wang et al., 2006; Wiggins et al.,\n2010). The series of chromosome segments is localized along the long axis of the cell in the\nsame order as their positions along the chromosome map, with the interlocus distance typically\nlinearly proportional to (arclength) genomic distance. The precise location of individual loci\nvaries in the known bacteria, and might depend on DNA-membrane tethering interactions (Toro\n& Shapiro, 2010). A recent microscopy study on E. coli (Meile et al., 2011) considered the positioning of the chromosome in the short-axis section of the cell. They found that the Ter region\noccupies the periphery of the nucleoid, at a larger distance from the longitudinal axis with respect to the rest of the chromosome. In newborn or non-replicating cells, the two chromosome\narms are spatially arranged such that loci on the left arm of the chromosome lie in one half of\nthe cell and loci on the right arm lie in the opposite half, with the replication origin between\nthem. It is tempting to interpret the resulting sausage-shaped structure as a chromosomal\n\"fiber.\" In a recent study (Wiggins et al., 2010), the cell-to-cell variability of loci positioning in\nnon-replicating cells was used to estimate an internal elasticity, which, perhaps not surprisingly,\nappears to be much higher than expected from a naive estimate for a linear polymer.\nEven more recently (Umbarger et al., 2011), high-throughput Chromosome Conformation\nCapture (3C) techniques have been used in combination with live-cell fluorescent tagging of loci,\nin order to determine the global folding architecture of the Caulobacter crescentus swarmer cell\ngenome. These data indicate that a chromosomal fiber exists also in this case, spanning the\nwhole chromosomal ring. Additionally to the linear spatial arrangement of loci according to\ntheir chromosomal coordinate, loci of the left chromosomal arm tend to be very proximal to\nsymmetric loci on the right arm. The resulting structure is a compressed ring-like fiber, which,\nthe authors argue, typically takes an eight shape, free to roll around the long cell axis. They\nalso find that the symmetry in the cross-chromosomal arm interactions is determined by the\nprotein-dense attachment point to the cell membrane at the old pole of the cell, triggered by the\nbinding of the ParB protein to its target parS binding sites. Moving the parS pole-anchoring\nsite by 400 Kb along the chromosome (but not the replication origin) determines a sliding of the\nwhole interaction structure, as in a tank crawler. This sliding is slightly asymmetric, suggesting\nthe presence of supplementary attachment points between chromosomal arms or between the\nchromosome and the cell body.\nAnother important recent discovery, consistent with the mentioned correlation between chromosome arms and cell halfs, is the existence of \"macrodomains\" (Espéli & Boccard, 2006;\nMoulin et al., 2005; Valens et al., 2004) often described as chromosomal isolated compartments. The first evidence in this direction (Valens et al., 2004) came from measurements of\nthe recombination frequency between loci, see figure 1A. All else being equal, this should be\nproportional to the probability that the two chromosomal segments come into contact within\nthe cell. For a well mixed polymer, the recombination frequency should be uniform. However, experiments show a highly non uniform pattern, compatible with a compartmentalized\nstructure with clear boundaries. Four macrodomains of a few hundred Kb in size have been\nidentified, corresponding to regions surrounding the replication origin and terminus, and to\ntwo symmetric regions at the edges of the Ter macrodomain, see box and figure 1C,D,E. The\nremaining \"non-structured regions\" appear to have different physical properties. Subsequent\nstudies have confirmed the presence of macrodomains and measured their dynamics using fluorescently labelled loci (Espéli & Boccard, 2006; Espéli et al., 2008; Lesterlin et al., 2005), see\nfigure 1B,D. While the molecular mechanisms responsible for this level of organization are not\nyet clear, the same authors also found that the Ter macrodomain appears to be condensed by a\nsingle DNA-binding protein (MatP, figure 2) with a small set of specific binding sites (Mercier\net al., 2008). Other proteins with macrodomain-specific DNA-binding properties have recently\nbeen identified (Cho et al., 2011; Dame et al., 2011; Sánchez-Romero et al., 2010; Tonthat et al.,\na. Chromosome spatial arrangement and compartmentalization.\n\n\f8\nB\n\n29'\n\n75\n\n0,0005\n\n81'\n\nE. coli\n\n0,0004\n\nM\nbp\n\nTer\n\n0\n\nD\n\n0\n\n1\n\nbp\n\n2M\n\n62'\n\n0,0001\n\n25\n\nRight\n26'\n\n0,0003\n0,0002\n\n50\n\n13'\n\n3\n\nD = MSD/4τ\n\n0\n\noriC\n\nbp\n1M\n\n25\n\n1'\n\nOri\n0\n\n0,0006\n\n50\n% recombinants\n\nC\n\nLeft\n10\n\nτ (sec)\n\n100\n\nTer\n\n47'\n\n1000\n\nE\n\nLeft\n\nNS\n\nOri\nTer\n\nNS\nRight\n\nLeft\n\np\n\n17'\n\nMb\n\n75\n\n4\n\nA\n\nFIG. 1 Chromosome compartmentalization and spatial arrangement of genes. (A) An example of the\ndata that was used for the genetic definition of Right and Ter macrodomains, reprinted by permission\nfrom Macmillan Publishers Ltd. from Valens et al. (2004), c 2004. The plot shows the frequency of\nrecombination events between the genetic position indicated by the arrow and other positions probed\nalong the genome (The x-axis indicates the base pair coordinates of the chromosome). This should be\nuniform for a well-mixed polymer. On the contrary, experiments show a highly non-uniform pattern,\ncompatible with a compartmentalized structure with clear boundaries. Dashed vertical lines indicate\nthe delimitation of macrodomains. Colored bars show the extent of the defined macrodomains. (B)\nEffective diffusion constants obtained from loci tracking experiments, reprinted by permission from\nJohn Wiley and Sons Ltd. Espéli et al. (2008), c 2008 . The plot shows clear differences between the\nbehaviour of loci placed within macrodomains and in non structured regions (NSR1-4,NSL-2). (C)\nAfter Valens et al. (2004) (reprinted by permission from Macmillan Publishers Ltd. c 2004), graphical\nrepresentation of the macrodomains and their boundaries within the E coli genome. Structured\nmacrodomains are indicated as colored arcs, black dashed arcs indicate non-structured regions. (D)\nFrom Espéli et al. (2008) (reprinted by permission from John Wiley and Sons Ltd. c 2008), the\ngenetic insulation of the macrodomains correlates with spatial insulation in subcellular territories.\nThe positions of 10 foci were superimposed according to the barycenter of their trajectory during\n30 intervals of 10 s at the home position. Foci from tags at OriC, NSR-3, Right-2 and Ter-6 were\nplotted. (E) Schematic of macrodomains' localization within the cell. Ter is localized at the periphery\nof the nucleoid, towards the cell membrane Meile et al. (2011) (reprinted by permission from Biomed\nCentral, c 2011).\n\n2011), and appear to be conserved in related bacteria. In view of the results from this thread of\nwork, macrodomains might be seen as a process of microphase separation triggered by specific\nprotein binding. Interestingly, as mentioned above macrodomain-like regions also emerge from\nindependent large-scale genomic data (Berger et al., 2010; Mathelier & Carbone, 2010; Scolari\net al., 2011).\nDuring replication, the chromosomes segregate following a well-defined \"choreography,\"\nwhich has been the subject of multiple studies (Berlatzky et al., 2008; Jun & Wright, 2010; Toro\n& Shapiro, 2010). While segregation is not the main focus here, it is useful to discuss it briefly,\nas the existing approaches to this problem (both experimental and theoretical) are intimately\nlinked with chromosome organization and will be mentioned in the following. Specifically, spatial reorganization of the segregating chromosome arms appears to preserve qualitatively the\nrelationship between loci distance along the chromosome and in the cell. Moreover, reorganization ensures that the two replication forks remain in opposite halves of the cell during\nreplication and that the relative orientation of the two reorganized nucleoids in pre-division\n\n\f9\nC\n\nA\n\nB\n\nD\n\nFIG. 2 The protein MatP organizes the Ter macrodomain by specific binding. The circular chromosome of E. coli divided into 4 macrodomains and 2 non structured zones (see figure 1). (A) From\n(Mercier et al., 2008), ChIP-chip assays for MatP binding show a specific affinity of this protein with\nTer macrodomains, indicating that the macrodomain is condensed by MatP, and suggesting that other\nmacrodomains might be condensed by dedicated proteins with a small set of specific binding sites.\n(B) From (Mercier et al., 2008), the localization bias of MatP binding sites is conserved among enterobacteria, (S. typhimurium LT2 with genome size 4683 Kb, E. carotovora SCRI1043 - 5064 Kb),\nVibrio (V. cholerae Cl 2 - 961 kbp ), and Pasteurella (Y. pestis KIM 4 - 600 kbp) species. (C) MatP\ncontrols DNA compaction in the Ter macrodomain. The histogram represents the proportion of cells\nwith given interfocal distances between foci of two Ter MD markers in WT and matP deletion mutant\ncells. (D) Fluorescence microscopy images from the two experiments (scale bars 2μm). These results\nindicate that the effect of MatP on foci colocalization is associated with compaction. (A-D) reprinted\nfrom Mercier et al. (2008), c 2008, with permission from Elsevier.\n\ncells is not random. Quite interestingly, the spatial separation of sister chromosomes is not\na continuous process, but has been observed to proceed through \"snaps\" (Espéli et al., 2008;\nJoshi et al., 2011), suggesting the existence of energetic or entropic barriers for separation,\npossibly overcome by active processes.\nThere is debate on what is the main driver for chromosome segregation: Entropic repulsion\nforces due to strong confinement into a box of linear polymers have been proposed to explain\nthis behavior at least in part (Jun & Wright, 2010); in experiments on replicating B. subtilis the\nchromosome compaction and spatial organization have been hypothesized to result from nonequilibrium dynamics (Berlatzky et al., 2008), rather than from an entropic repulsion process;\nin Caulobacter crescentus, a contribution from bidirectional extrusion of the newly synthesized\nDNA from the transcription complex has been postulated to contribute to chromosome segregation (Jensen et al., 2001; Toro & Shapiro, 2010). Experiments using inhibition of protein\nsynthesis by chloramphenicol show that this produces nucleoids with a more rounded shape\nand induces fusion of separate nucleoid bodies (van Helvoort et al., 1996). Upon release from\nprotein synthesis inhibition, the two nucleoids reoccupy the DNA-free cell independently of cell\nelongation (Helvoort et al., 1998). The control of the segregation mechanism by protein synthesis processes could be indirect: ongoing protein synthesis can affect nucleoid compactness and\nsegregation at multiple levels, including the decrease in the amount of enzymes modifying the\ntopology of the DNA or carrying out transcription and DNA replication. The idea that membrane protein synthesis activates nucleoid segregation directly has also been proposed (Norris,\n1995) (in bacteria the presence of cotranscriptional translation creates a direct physical link\nbetween the genome and the membrane (Woldringh & Nanninga, 2006)) Also note that current\narguments based on segregation by entropy and confinement might turn out to be inconsistent\nwith interpreting macrodomains as the result of a microphase separation, since a variety of\n\n\f10\ninteractions, and specifically protein-DNA binding processes could play an important role in\ndefining the free energy of the nucleoid.\nAt smaller scales, the circular chromosome\nof E. coli is organized in plectonemic loops, or \"supercoil domains.\" Those regions are separated\nby topological barriers formed by nucleoid associated proteins (NAPs) such as Fis and H-NS,\nsee figure 3. These proteins bridge two strands of DNA by binding to both, and prevent the\npropagation of torsional energy. As a result, they also prevent the spreading of uncontrolled\neffects on gene expression in case of accidental DNA breaks or mechanical strain, caused for\nexample by advancing replication forks (Postow et al., 2004; Skoko et al., 2006; Stavans &\nOppenheim, 2006).\nMultiple NAPs have been identified, each with its specific binding properties (reviewed\nin (Luijsterburg et al., 2006)). Besides bridging double strands, they can change the local\nshape of DNA inducing bends or hinges and form nucleoprotein filaments. Additionally, NAPs\noften have multiple DNA binding modes which might be dependent on physiological factors. A\ngood example of this behavior is H-NS. Its binding results in DNA-H-NS-DNA bridges, but\nalso forms a rigid nucleoprotein filament which could act as zipper in vitro (Amit et al., 2003;\nDame et al., 2006; Wiggins et al., 2009). It seems that the nucleoprotein filament formation\nmay be important, as it has been found to be a structure shared by other NAPs including\nHU (van Noort et al., 2004) and StpA (Lim et al., 2011). Biologically, this could hypotetically\nprovide a mechanism for environmental sensing by NAPs. It is thus possible that our current\nunderstanding of NAP binding, being based on the limited number of conditions tested, is\nincomplete and generalization of a DNA binding property to other solution conditions may be\ndangerous.\nb. Supercoil domains and nucleoid associated proteins.\n\nFIG. 3 Branched plectonemic conformation of the genomic DNA molecule in E. coli and connection\nwith nucleoid associated proteins. (A) From Postow et al. (2004) (Reprinted by permission from CSHL\nPress, c 2004), electron micrograph of a purified E. coli chromosome. The branched plectonemic\nstructure is visible. From image analysis, Postow and coworkers measured a roughly exponential\ndistribution for the length of supercoiling loops, with the average around 10-15Kb. Note that the\nextraction and purification process might interfere with many of the properties of the conditions in\nwhich the nucleoid structure is naturally found. (B) Electron micrograph of Fis binding to plasmid\nDNA (from (Schneider et al., 2001)). This dimeric NAP stabilizes plectonemic branches of supercoiled\nDNA (schematized in the right panel). In particular, Schneider and coworkers measured a Fis to DNA\nratio of 1 dimer per 325 bp DNA. (C) From (Schneider et al., 2001), electron micrograph of HNS binding to plasmid DNA, elongated complexes (polymers) are formed (schematized in the right\npanel), presumably containing two DNA duplexes. Schneider and coworkers measured a ratio of H-NS\nto DNA of 1 molecule per 10 bp. (B-C) reprinted from Schneider et al. (2001) by permission of Oxford\nUniversity Press.\n\n\f11\nThe structure of supercoil domains was studied in E. coli by Postow and coworkers, through\nanalysis of the supercoiling-sensitive transcription of more than 300 genes following relaxation\nby restriction enzymes in vivo, and by electron microscopy (Postow et al., 2004). They concluded that domain barriers may vary dynamically and/or across a population, but they follow\nan exponential length distribution. The average domain size is ' 10 − 15 Kb, implying the\nexistence of about 200 − 400 domains (Postow et al., 2004; Stavans & Oppenheim, 2006).\nBranches of the same typical length are visible directly from electron micrographs of purified\nnucleoids (Kavenoff & Bowen, 1976; Postow et al., 2004). Thus, the genome topology may\nbe visualized as a branched structure with supercoiled domains that are subject to modulation by nucleoid-associated proteins, and active processes such as DNA transcription and DNA\nreplication.\nThe factors responsible for establishing the boundaries of supercoiled domains and the determinants of domain size and number are still largely unknown. While H-NS and Fis, along with\nMukB, the analogue of the eukaryotic SMC (Structural Maintenance of Chromosomes) protein,\ncould be involved in stabilizing plectonemic conformations, their precise roles and importance\nin this context have not yet been established in a definitive fashion, either in vitro or in vivo\n(Dillon & Dorman, 2010; Grainger et al., 2006; Maurer et al., 2009; Skoko et al., 2006).\nA\n\nC\nBinding\nregions\n\nOccupancy\n\nRNA\n\nRead counts\n\n4Kb\n\nAnnotations\n\n3830000\n\n3835000\n\n3840000\n\n3845000\n\n15 kb\n\nB\n\nFIG. 4 Examples of high-throughput data an bioinformatic analyses concerning nucleoid organization\n(A) Left panel: ChIP-seq binding profile of H-NS, plotted using data from Kahramanoglou et al.\n(2011); right panel: sketch representing the extended protein occupancy domains detected by Vora\net al. (2009). These are polymer-like nucleoprotein complexes, presumably related to nucleoid organization. (B) Chromosomal sectors emerge from the local correlation (plotted here) between expression\nlevels for wild type in log-phase growth and a codon bias index, related to translation pressure (from\nMathelier & Carbone (2010), reprinted by permission from Macmillan Publishers Ltd: Molecular\nSystems Biology, c 2010). These sectors correlate well with macrodomain organization. (C) Top\npanel: effective transcriptional regulatory network (red links) and areas of influence of Fis and H-NS\n(colored circles) obtained from transcriptomics experiments combining NAP mutants and perturbations in supercoiling background (from Marr et al. (2008), Reprinted by permission from BioMed\nCentral, c 2008). Bottom panel: clusters of transcriptional response to nucleoid perturbations (left,\ndata from Marr et al. (2008) and similar esperiments) and NAP binding (right) correlate with the\norganization of macrodomains (outer arcs) and chromosomal segments (inner arcs) of the genome\n(from Scolari et al. (2011), reproduced by permission of The Royal Society of Chemistry).\n\nBy contrast, a consistent amount of information on the binding of NAPs in different conditions and its effects on the cell state is available from high-thoughput experimental techniques\n(figure 4.) Nucleoid associated proteins can modulate the nucleoid conformation structure\nin response to changes in environmental conditions (Luijsterburg et al., 2006). This can re-\n\n\f12\nsult in large-scale changes in gene expression (Dillon & Dorman, 2010). The local mechanical action of NAPs on DNA is often well-characterized by single molecule experiments (Luijsterburg et al., 2006), which also lead to the observation of chromatin-like nucleoprotein\n\"fibers\" (Kim et al., 2004). Large-scale NAP binding data in specific growth conditions was\nobtained from high-throughput experiments involving microarrays (CHiP-chip) or sequencing\n(CHiP- seq) (Grainger et al., 2006, 2007, 2008; Kahramanoglou et al., 2011; Oshima et al., 2006;\nWade et al., 2007). Furthermore, transcriptomics studies profiled the changes in gene expression\nupon different nucleoid perturbations, such as NAP deletion and/or altered supercoiling (Berger\net al., 2010; Blot et al., 2006; Bradley et al., 2007; Marr et al., 2008). Many of these data sets\nshow linear regions of dense binding that often correspond to macrodomain boundaries, and\nassociate with global or NAP-dependent transcriptional response and its correlation with codon\nbias (Mathelier & Carbone, 2010; Scolari et al., 2011).\nThe physical origin of this preference in binding and the gene expression changes at the\nboundaries of macrodomains is not precisely clear. One possibility is that macrodomain boundaries might be co-localized by NAP structures. A recent interesting experimental study (Vora\net al., 2009) looked at protein occupancy along the genome regardless of protein identity. This\nwork uncovered extended polymer-like domains rich in bound proteins (including NAPs) with an\naverage length of 1.6Kb, associated with transcriptionally silent or transcriptionally enhanced\nregions (and also with high intrinsic DNA curvature.)\nWhen cells enter the stationary phase a radical, global condensation of the nucleoid occurs. It is believed that this is a mechanism via which the cell can protect its DNA in harsh\nconditions (Kim et al., 2004). AFM studies have shown that the structure of the DNA differs at the supercoiling level (Kim et al., 2004) and that action of Dps and CbpA, the NAPs\nthat replace Fis in this growth phase, is quite different. The Dps and CbpA proteins produce compact aggregates (which can protect DNA from degradation by nucleases) rather than\nbinding to distributed sites as Fis does (Cosgriff et al., 2010). Interestingly, the action of Fis\ncounters Dps-induced compaction through a transcriptional response affecting the expression\nof topoisomerase and gyrase (Ohniwa et al., 2006).\nA\ndifferent question concerns identifying the main factors contributing to nucleoid compaction and\norganization. The main candidates are macromolecular crowding, electrostatic self-attraction,\nsupercoiling and nucleoid proteins.\nMacromolecular crowding, or the high concentration of macromolecules present in the cytoplasm, is generally believed to be an important determinant on the basis of theoretical arguments (de Vries, 2010; Odijk, 1998), which predict a possible phase separation mechanism\nbetween nucleoid and cytoplasm. Note that the generic term \"macromolecular crowding\" might\ninclude depletion interactions (see below), together with a number of additional effects of entropic and energetic nature.\nDNA condensation by crowders can be observed in vitro under very controlled and wellunderstood conditions, for example by experiments using dextran or PEG, demonstrating that\nnaked DNA can be directly condensed by these crowders (Estevez-Torres & Baigl, 2011; Huang\net al., 2007; Xu & Muller, 2012; Zhang et al., 2009) Similar (but less controlled) behavior, is\nshown by purified nucleoids (Zimmerman, 2004). At the same time, experimental studies on\nisolated nucleoids obtained from mutants lacking various NAPs (Zimmerman, 2006a) suggest\nthat the effects of crowding on compaction are substantial and independent of the NAP composite background. It has also been suggested that the action of NAPs could be aimed at\nantagonizing compaction rather than compacting the nucleoid (Zimmerman, 2006b). However,\nthis must be a complicated, combined effect involving forces of different nature. In the absence\nof crowding and confinement, it is obvious that the radius of gyration of the genome would\nbe smaller if it were organized, e.g. in a branched structure of plectonemic loops stabilized by\nc. Compaction by molecular crowding, specific proteins, transcription factories, and confinement.\n\n\f13\nDNA-bridging NAPs (Postow et al., 2004; Trun & Marko, 1998).\nAs a particular case of crowding effect, it has been proposed that the (attractive) depletion\ninteractions, well known in colloid science, might play an important role in chromosome organization (Marenduzzo et al., 2006a) This force is due to reduction in total solvent excluded\nvolume upon formation of a molecular complex. Depletion interactions are consequential when\nlarge molecular assemblies are formed in presence of smaller particles. In fast-growth conditions, genome-bound RNA polymerase is localized into a few transcriptionally active foci or\n\"transcription factories,\" (Cabrera et al., 2009; Jin & Cabrera, 2006), analogous to the eukaryotic case (Marenduzzo et al., 2006a,b). Depletion interactions were suggested to explain the\nformation of these macromolecular assemblies (Marenduzzo et al., 2006b). Interestingly, the\nformation of these foci has been associated with the presence of the NAP protein HU (Berger\net al., 2010). We add that a similar argument might hold for the local compaction of the surroundings of OriC, rich in ribosomal RNA producing regions, in a macrodomain-microphase. In\nother words, ribosome-rich ribosomal RNA transcripts, attached to the genome through RNA\npolymerase, could help compact the Ori region. If this should be the case, the compaction\nproperties of this region would change with the number of ribosomes being synthesized, i.e.\nwith growth rate and translation efficiency (Scott & Hwa, 2011) (One can also speculate that,\nfor the same reason, newly-replicated DNA could be sequentially aggregated during replication.) On one hand, experiments show that transcription of ribosomal RNA operons (which\nare generally located in the Ori macrodomain) is related to the compaction of nucleoids observed upon inhibition of translation (Cabrera et al., 2009). On the other hand, these processes\nmust be intersected with the (non entropic) binding of NAPs, given the evidence connecting\nspecific NAPs to the compaction of the Ter macrodomain (MatP) and indirectly to the effect\nof the HU protein on organization of the Ori macrodomain.\nA very recent study (Wang et al., 2011a) systematically addressed the chromosomal localization and role in spatial organization of the nucleoid of five major NAPs (HU, Fis, IHF, Stpa,\nH-NS) using fluorescent protein fusions and super-resolution fluorescence microscopy. In the\ngrowth conditions tested all the proteins showed scattered distributions in the nucleoid, except\nfor H-NS, which seemed to form (on average) two distinct foci per chromosome copy, bringing\ntogether different (even distant) H-NS targets, see figure 5. Thus, H-NS should be added to the\nlist of NAPs with a compacting action on the nucleoid associated with the formation of specific\nfoci. The long-range interactions between H-NS binding targets were validated by 3C, and\nshow no apparent coherence with the macrodomain structure; loci pairs that are near to H-NS\ntargets but are not targets show no 3C signal and wider distributions of subcellular distances\n(evaluated with microscopy). In general, DNA associated with many NAPs has a much larger\nsurface, which should enhance the depletion interactions. For instance, DNA coated with an\nH-NS nucleoprotein filament will have a diameter of about 20 nm instead of the 2 nm of naked\nDNA. H-NS nucleoprotein filament formation could strongly enhance the depletion attractions\nwith respect to other NAPs not forming filaments, and filaments formed at remote locations\non the contour of the chromosomal DNA could find each other in a crowded environment. This\nmay explain the results from super-resolution imaging mentioned above (Wang et al., 2011a).\nWe note again that this is one of the counter-intuitive aspects of molecular crowding, since\none might think that it would be easier to encounter another filament if there were no \"obstacles\". The confusion can come from thinking about diffusion, which is hindered in a crowded\nenvironment due to the higher effective viscosity, versus thermodynamics, where the depletion\ninteractions increase the probability of observing two nucleofilaments in contact at equilibrium.\nAdopting a simple Kramers-type model for the kinetics, it is not obvious whether the rate of\nassociation would go down due to the prefactor or go up due to the lower free energy minimum.\nImplicit in the entire discussion implicating crowding in aggregation in this cellular context is\nthe idea that the distribution of nucleoprotein filaments is at near-equilibrium even though the\ncell is dividing rapidly.\nFinally, depending on the degree of autonomous compaction, the confinement exerted by\n\n\f14\n\nA\n\nB\n\nC\n\nFIG. 5 Effect of H-NS on chromosome compaction. From Wang et al. (2011a), Reprinted with\npermission from AAAS. H-NS was shown by Wang and coworkers to form a small set of foci in the cell,\nwhich bring together distant H-NS targets. Together with MatP (figure 2), this evidence proves a role\nof drives of energetic origin in chromosome compaction. (A) Super-resolution fluorescence imaging\nof fluorescent protein fusion of H-NS showing compact H-NS clusters in the nucleoid. The E. coli\ncells are shown in the bright-field image (left). The z coordinate of each localization is color-coded\n(top bar). In comparison, a conventional fluorescence image of the same cells is shown (right). (B)\nScattered distribution of HU in the nucleoid. (Left) Bright-field image; (right) super-resolution image.\nSimilar diffuse distributions were observed for Fis, IHF, and StpA. (C) Effect of deleting H-NS on\nthe subcellular distribution of H-NS target genes (hdeA, hchA) versus non-targets (lacZ). The 2D\nhistograms of the relative hdeA, hchA, and lacZ locus positions normalized to the cell dimensions\nare shown, the genes were fluorescently labelled. The first quartile of the cell plots the (color-coded)\nprobabilities of finding the fluorescent locus in the particular position, the rest of the cell is filled with\nmirror images to aid the eye (grid size 100 to 200 nm). In each case, 2000 to 5000 gene locus positions\nwere analyzed. H-NS deletion has little effect on lacZ distribution, despite this locus is only a few Kb\napart from the closest H-NS binding site.\n\nthe cell wall might play a relevant role in nucleoid organization and segregation (Jun & Wright,\n2010). This is expected to be particularly significant in fast-growth conditions, where the\ngenome needs to be highly accessible for transcription (and thus will not be condensed) and\nthe amount of genome per cell is higher due to overlapping replication rounds (Nielsen et al.,\n2007).\nTo summarize, the degree of condensation and the geometry of the nucleoid are strongly\ndependent on the growth phase and growth rate of the bacteria. Such changes may be modeled\nby means of equilibrium states, slowly evolving in accordance to \"external\" control parameters\n(e.g. the concentration of the various NAPs). However, it seems likely that nonequilibrium\nprocesses are also important, and relevant aspects of the problem might be lost in attempting\nto describe the nucleoid condensation process purely in terms of an approach to thermodynamic\nequilibrium. For example, on the other side of the spectrum in terms of biological complexity,\nthe recently found scale-invariant structure of the human genome (Lieberman-Aiden et al.,\n2009; Mirny, 2011) was suggested not to be the result of an equilibrium state, but similar in\nnature to the so-called \"crumpled globule,\" or \"fractal globule,\" (Grosberg et al., 1993) since\nloci that are near along the genome arclength coordinate are also physically proximal in threedimensional space. This proximity contrasts with what happens in an (equilibrium) collapsed\n\n\f15\npolymer, where the linear structure is completely mixed in the globule.\nLet us quote a few experimental findings, some of which are very recent, supporting the role\nof nonequilibrium processes, specifically for bacteria. The initial conditions, i.e. the choreography of DNA replication, appear to play a central role in defining the final structure of the\nnucleoid (Daube et al., 2010). In artificial E. coli strains with two distant origins instead of\njust one (Wang et al., 2011b), the two origins initiate replication synchronously at the expected\nseparate positions of the genetic loci associated with them. Replication forks move independently, indicating that replication does not occur in a single replication factory and that the\nreplication machinery is recruited to origins rather than vice versa. Most importantly, in these\nexperiments progression of replication plays a major role in determining the space-time pattern\nof locus segregation. The large scale structure of the B. subtilis nucleoid (Berlatzky et al.,\n2008) has been observed at various stages of the replication process. The newborn portions of\nthe chain are compacted and sequentially conveyed towards the poles, resulting in an ordered,\nspiraling structure. A strong correlation between space coordinate and genomic coordinate is\npreserved, similar to the linear behavior observed in E. coli (Wiggins et al., 2010). A choreography of this sort is found also in Caulobacter (Jensen et al., 2001). Finally, the large scale\nspiral structure of the nucleoid of Bdellovibrio bacteriovorous (Butan et al., 2011) also suggests a metastable steady state, sustained by cooperative motion and/or energy exchanges.\nIt seems difficult to disregard the deterministic replication-segregation dynamics in describing\nsuch phenomenology (Breier & Cozzarelli, 2004; Toro & Shapiro, 2010).\nTracking studies of fluorescently labeled chromosomal\nloci have evaluated in vivo dynamic properties of the nucleoid with fairly high time resolution, measuring for example the mean-square displacement (MSD) of the loci or the time\nautocorrelation function (Espéli et al., 2008; Meile et al., 2011; Weber et al., 2010a). In\ngeneral, these measurements give information on the local relaxation time scales of the nucleoid and its viscoelastic behavior, see figure 6. On one hand, for large time-scales (Espéli\net al., 2008), loci mobility correlates well with macrodomain structure. In particular, the MSD\nsaturates at the spatial scale of the macrodomain size. On the other hand, especially for\nsmaller time scales, the mean square displacement of a locus is seen to follow a power law:\nM SD ≡< (~x(s, t + ∆t) − ~x(s, t))2 >≈ c * (∆t)α (where s is its arclength genomic coordinate)\nand the exponent α seems to be universally close to 0.4, independent of s (Weber et al., 2010a).\nPerhaps surprisingly, an extra-chromosomal RK-2 plasmid showed the same behavior, while\nsmaller RNA particles had a higher subdiffusive exponent. It must be mentioned that the\nlocalization of RK-2 plasmids appears to be highly regulated (Derman et al., 2008; Kolatka\net al., 2008). The underlying viscoelasticity of the bacterial cytoplasm surrounding the nucleoid is still poorly understood. Some characterisation has been approached in vivo via FRAP\nmeasurements of diffusing GFP (Konopka et al., 2006).\nThe observed anomalous diffusion has been modeled using phenomenological approaches.\nThere are a variety of dynamical models exhibiting anomalous diffusion, such as Langevin\nequations with time dependent viscosity (also equivalent to fractional Langevin equations),\ncontinuous time random walks, and random walks over a fractal object (Burov & Barkai, 2008;\nCondamin et al., 2008; He et al., 2008). Weber et al. (Weber et al., 2010a,b) compared their\ndata with the results obtained on the basis of the first two approaches, and the fractional\nLangevin equation gave a more satisfactory agreement.\nThe anomalous diffusion exponent per se does not give quantitative information on the geometry of the nucleoid. Physical measurements, possible on purified nucleoids (Cunha et al.,\n2001, 2005; Romantsov et al., 2007), can enrich the scenario. In particular, Romantsov and\ncoworkers (Romantsov et al., 2007) have obtained, using fluorescence correlation spectroscopy,\nthe time-dependent coarse-grained density distribution of purified nucleoids. They conclude\nthat the polymer appears to be composed of a set of \"structural units\" defined by a measurd. Viscoelasticity and structural units.\n\n\f16\n\nFIG. 6 Optical techniques in nucleoid dynamic visualization. (A) From Meile et al. (2011) (reprinted\nby permission from Biomed Central, c 2011), using phase contrast for cell visualization, membrane\nstaining (FM 4-64), DNA staining (DAPI), and YFP-ParB for foci dynamic measurement, it is possible to produce \"informed maps\" of the bacteria by overlaying different micrographs. (B) Movies\ncan be used to to follow foci dynamics. The plot, from Espéli et al. (2008) ( reprinted by permission from John Wiley and Sons Ltd. c 2008), shows a typical trajectory of a fluorescent focus,\nfrom which dynamical properties of the nucleoid can be inferred. (C) From Espéli et al. (2008),\nreprinted by permission from John Wiley and Sons Ltd. c 2008. The trajectories of fluorescent dots\ndefine territories in which genetic loci are placed within the cell. (D) From Weber et al. (2010a)\n(http://prl.aps.org/abstract/PRL/v104/i23/e238102), reprinted, c 2010 by the American Physical\nSociety. A measurement of the ensemble-averaged MSD for live and fixed cells using fluorescent loci.\nThe authors showed that the dynamical exponent of the foci is universal (and close to 0.4). The observed anomalous diffusion has been explained phenomenologically as a consequence of the viscoelastic\nbehaviour of the nucleoid. We hypothesize that this could be a consequence of a fractal organization of\nthe nucleoid similar to a \"fractal globule\", see Discussion. (E, F) Measurements on purified nucleoids,\nfrom Romantsov et al. (2007), reprinted with permission from Elsevier, c 2007. Using Fluorescence\nCorrelation Spectroscopy, nucleoid volume and amplitude of FCS correlation functions have been\nmeasured at varying supercoiling (induced by different concentrations of chloroquine drug). The plots\nshow that the nucleoid reach a maximum volume and minimum FCS correlation at full supercoiling relaxation. The FCS correlation signal can be used to deduce the size of structural units of the\npolymer.\n\nable correlation length. The measurements were performed at varying degrees of supercoiling,\ninduced by different concentrations of the chloroquine drug. The size of the structural units\nwas found to vary from 50-100Kb in high (positive or negative) supercoiling to 3Kb at zero\nsupercoiling. The diameter of the purified nucleoid varied from 2.5μm in high supercoiling to\n3.5μm in low supercoiling. The authors also estimated the typical diameter of the structural\nunits from the diffusion constant (obtained from the decay of the fluorescence autocorrelation\nfunction) and Stokes-Einstein's relation. Perhaps surprisingly, the resulting size of structural\nunits was near 70-80 nm regardless of supercoiling. Thus the emerging picture for the unconfined genome is that of a string of ∼ 100 highly dense \"beads\", each containing ∼ 100 Kuhn\nlengths (effective independently jointed elementary polymer segments) of DNA each. These\nvalues apply in the presence of supercoiling but in the absence of crowding and confinement\neffects, as for purified nucleoids most of the cytoplasmic (and probably a considerable part of\nthe DNA-binding) proteins are probably diluted away.\n\n\f17\nIV. MODELS\n\nWe will now review a few modeling approaches put forward in recent years, and point to\nsome more classic work in polymer physics that we believe could be relevant in this context. As\nthe reader will have observed, the wealth of existing experimental results is appealing on one\nhand, but, on the other hand, does not offer any clear grasp on a small set of relevant ingredients necessary for building coherent physical descriptions of the nucleoid. Consequently, the\napproaches adopted in the literature are highly diverse and heterogenous in terms of premises,\nmethods, ingredients, and points of view.\nThe notable efforts to understand entropic aspects of chromosome segregation (reviewed\nin (Jun & Wright, 2010)) have revived the studies on entropic forces of single and multiple\nconfined polymers dating back to Edwards and DeGennes (DeGennes, 1979; Edwards & Freed,\n1969; Jun & Mulder, 2006; Jung & Ha, 2010). As we have pointed out above, the role of bound\nproteins on nucleoid entropy is typically disregarded in these arguments.\nA comprehensive review of the literature on confined DNA in different contexts is provided\nin Marenduzzo et al. (2010). Considering this approach, there remains the open issue that\nthe observed segregation and compaction times might be too short to be compatible with\nan entropic process. For linear polymers this time has been evaluated by Molecular Dynamics\nsimulations to scale like the square of the number of monomers, N 2 , which, for sufficiently large\nN , will be smaller than the O(N 3 ) chain diffusion time (Arnold & Jun, 2007). However, it is\nnot straightforward to use these scaling relations for empirically relevant estimates. Moreover,\nthese estimates will depend on the model used to represent the structure of the nucleoid and\nits correlation with the replication process, linking this problem to other unanswered questions.\nOverall, it seems likely that entropy is only part of the story, and active / nonequilibrium\nprocesses of different kinds might play a role in chromosome segregation.\nWe will now turn our attention to work concerning nucleoid organization and cellular arrangement. Buenemann and Lenz have attempted to understand the linear arrangement of\nchromosomal loci in terms of a purely geometrical model (Buenemann & Lenz, 2010), where\na linear polymer in the form of a string of blobs, is confined within a cylinder and locked at\none or at a few loci. This constrained geometry obviously provides an ordering mechanism, as\nlong as the blobs are large enough with respect to the cylinder's diameter. This model makes\npredictions on the spatial arrangement of the chromosome in mutants of C. crescentus (Viollier\net al., 2004) and on the cell-cycle dependent ordering in E. coli. A very recent simulation\nstudy (Fritsche et al., 2011) explains the linear ordering observed in E. coli as a product of\nconfinement and entropic repulsion of a string of linearly arranged chromosomal loops. In order\nto show this, they represent the chromosome as a confined circular self-avoiding chain under\nthe constraint that consecutive loops, identical in size, are distributed along the arclength coordinate, while the Ter region does not contain such loops. Their simulations show both linear\nordering along the cell axis and Ter region occupying the outer periphery of the nucleoid (Meile\net al., 2011), as properties of the equilibrium states. Intriguingly, the same study suggests that\nthis linear-loop ordering could be a consequence of the transcription network organization. To\nsupport this point, they simulate a polymer where transcription factor-target pairs are coupled\nby attractive harmonic interactions, and show that the linear ordering is recovered. It is wellknown that transcription factor-target distances have a statistical tendency to be short along\nthe chromosome (Warren & ten Wolde, 2004).\nVettorel and coworkers (Vettorel et al., 2009) performed an abstract study motivated by the\npossible nature of the compartmentalization and the structural units of a generic (eukaryotic\nor prokaryotic) chromosome forming a crumpled or fractal globule mentioned in section III\n(figure 7). Specifically, they explore metastable collapsed states of polymers, where the total\nsize scales as N 1/3 as in an equilibrium compacted globule, but a much higher degree of compartmentalization is present. At odds with the intrinsic disorder of the equilibrium globule,\nin a fractal globule, for any pair of loci separated by a chain length s, the distance R(s) has\n\n\f18\nthe scaling behavior R(s) ≈ s1/3 (Mirny, 2011). In other words, both the equilibrium globule\n(i.e. the equilibrium collapsed structure emerging from polymer self-attraction or unfavorable\nentropy of mixing) and the fractal globule have mass fractal dimension Df = 3, but a generic\nvolume (and in particular a blob in the DeGennes sense) inside the equilibrium globule can\ninclude non-sequential segments, while in the fractal globule it contains a single sequential segment (Grosberg et al., 1993). This structure can be understood as resulting from a process\nwhere condensation sequentially involves larger and larger scales in s, so that the genomic\nproximity is preserved in a scale invariant fashion. As a consequence, distant portions of the\nchromosome will occupy different compartments within the globule.\nIn order to obtain a fractal globule in a simulation, a constraint preventing entanglement\nmust exist (Vettorel et al., 2009). To obtain this condition, Vettorel and coworkers considered\na semi-dilute or concentrated solution of mutually disentangled (unconcatenated) rings. Also\nnote that because of the constraint preventing entanglement during collapse, a fractal globule\nis generally larger in size than an equilibrium globule of equal chain length (while for both the\ntotal size scales as R ≈ N 1/3 ). The fractal globule configuration has proven to be relevant for the\ndescription of genomic DNA organization in non-dividing eukaryotic (human) cells (LiebermanAiden et al., 2009; Mirny, 2011). In particular, it has been found that the human chromosomes\ndisplay this structure from ∆s ≈ 500Kb to ∆s ≈ 7Mb. This range of sizes might be relevant to\nbacteria that have genomes spanning a few Mb (also because the lower cutoff might be related\nto the fiber organization of chromatin, which in bacteria is different). Thus, as the authors\nspeculate, the fractal globule description might be useful for the nucleoid as well. We will\nfurther discuss this point in the light of the available data in section V.\nWe have already mentioned above the theoretical work on the role of macromolecular crowding on compaction (de Vries, 2010; Odijk, 1998), and of depletion interactions on loop formation\n(and possibly on macrodomain organization (Marenduzzo et al., 2006b)). A recent simulation\nstudy (Junier et al., 2010) has concentrated on the chromosome-shaping role of transcription\nfactories. Considering a self-avoiding worm-like chain with a fixed hard-core repulsion radius,\nand short-ranged bridging protein complexes, they show that this system can take \"microstructured\" collapsed globule configurations, where bridging complexes cluster and regions of\nhigh and low densities of interacting sites coexist in a microphase separated thermodynamic\nstate. More abstract analytical studies could provide a useful context for understanding the\nrole of NAP binding (Diamant & Andelman, 2000; Kantor & Kardar, 1996).\nFinally, some attention has been devoted recently to the role played by the branched plectonemic structure of the nucleoid (Odijk & Ubbink, 1998; Ubbink & Odijk, 1999), which is\nbelieved to have relevant implications for transcription (Dillon & Dorman, 2010; Postow et al.,\n2004). Provided the correct questions are formulated, this topic has the advantage of being\nplaced in a strong framework developed in the past 30 years, building on the classical calculations of Zimm and Stockmayer (Zimm & Stockmayer, 1949) for considering arbitrarily ramified\nghost chains as gaussian networks, and obtaining their equilibrium properties (Farago & Kantor, 2000; Graessley, 1980; Sommer & Blumen, 1995). For example, some recent work has\nfocused on the induction of loops involving multiple polymer segments (Sumedha & Weigt,\n2008). In this framework, reliable estimates for the self-avoiding case can be obtained with\nFlory-like arguments, taking into account the fact that branched polymers have higher internal\ntopological complexity, which makes the repulsive interactions stronger than between linear or\ncircular chains. The same approach is also possibly relevant for studying dynamic aspects of\nloci mobility (Dolgushev & Blumen, 2009; Jasch et al., 2003), which can be compared with\nsimulations and more phenomenological models (Weber et al., 2010b). Finally, a number of\nvery refined results based on renormalization group / field theoretical methods have been obtained in a more abstract context using the \"randomly branched polymers\" model (or \"lattice\nanimals\"), typically defined as the ensemble of all the clusters of connected sites (monomers) on\na regular lattice. While this ensemble is probably too general, it is possible that these results\nhave implications for questions related to the structure of the nucleoid. For example, recent\n\n\f19\n\nA\n\nB\n\nFIG. 7 Main universal features of the \"fractal globule\" model. (A) From Mirny (2011) (with kind\npermission from Springer Science+Business Media), root-mean squared end-to-end distance R(s) and\nprobability of a contact P (s) as a function of the genomic distance s between the ends of a subchain\nof N = 32000 monomers, from simulations of a fractal globule and a collapsed (equilibrium) globule.\nNotice the different scalings in the two situations. All random collapsed configurations of a polymer\nin two dimensions behave as a fractal globule, as topological entanglement is forbidden. This does not\nhold in three dimensions, as a large number of knots can be generated. In a kinetically constrained\nsituation where knots are not present, this property is restored, and the resulting metastable configuration has the property that segments that are close in arclength distance, are also close in space.\nIt has been argued that this configuration might be relevant for eukaryotic chromatin within a range\nof length and time scales. (B) From Lieberman-Aiden et al. (2009) (reprinted with permission from\nAAAS), contact probability as a function of genomic distance averaged across the genome (blue) of an\neukaryotic cell obtained by the Hi-C technique. It shows a power law scaling between 500 kb and 7 Mb\n(shaded region) with a slope of 1.08 (fit shown in cyan). This analysis indicates that the eukaryotic\nDNA might be organized similarly to a fractal globule.\n\nwork based on Langevin dynamics (Janssen & Stenull, 2011) analyzes their collapsed regime,\nobtaining a fractal dimension Df = 2.52, intermediate between the swollen chain (Df = 2) and\nthe fully compacted globular state (Df = 3).\n\n\f20\nV. DISCUSSION. HYPOTHESES AND PARADOXES CONCERNING NUCLEOID\nGEOMETRY AND DYNAMICS.\n\nWe would like to discuss here some speculations on the possible links between the experimental and theoretical results discussed above.\nLet us start with an analogy to the geometrical organization of eukaryotic chromatin, where\ndifferent geometrical features are observed at different scales, ranging from the known fiber\norganization up to the arrangement in preferred \"chromosome territories\" within the nucleus.\nIn this case, experimental techniques such as Chromosome Conformation Capture (3C) and\nits high-throughput variants (Lieberman-Aiden et al., 2009), or FISH (fluorescence in situ\nhybridisation, where fluorescent tags are attached to pairs of DNA loci) allow, for instance, to\nmeasure the mean absolute distance, R, and the contact probability, Pc , of two genomic loci at\narclength distance s. For bacteria, these techniques entail a number of specific difficulties, but\nthe data are starting to be available, as already mentioned (Umbarger et al., 2011). However,\nthe study by Umbarger and coworkers focuses on the large-scale nucleoid 3D architecture,\nrather than on more detailed properties of the interaction map. Apart from saturation at large\ngenomic distances, R(s) is typically found to increase with s (Mateos-Langerak et al., 2009) with\nan approximate power-law behavior, R(s) ∼ sν . Here, ν is a scaling exponent, interpretable\nas 1/Df , which empirically varies with scale of observation and cell type in eukaryotes. If a\nstretch of length s of a polymer spans a region of size R, in D dimensions, it can occupy a\nvolume V ∼ RD ∼ sνD . Thus, heuristically, one expects that the probability of one end of\nthe stretch meeting the other scales as Pc ∼ 1/V ∼ s−Dν . Experimentally, for loci on the\nsame chromosome, Pc (s) decreases as a power-law Pc (s) ∼ s−1 , for a set of length scales in the\napproximate interval 0.5-7Mb for s (Lieberman-Aiden et al., 2009), which provides evidence\nfor a fractal globule-like organization, ν = 1/3. This is confirmed by FISH data for R(s) on a\nsmaller range of genomic lengths (Mateos-Langerak et al., 2009).\nHowever, experimental data on R(s) for chromatin are complex, as the ν exponent is celltype specific and varies with genomic length, reflecting different degrees and modes of chromatin\ncompaction. At short genomic distances ν is found in the range 0.2−0.6 at short distances, and\nR(s) reaches a plateau (i.e., ν ∼ 0) at order 10 Mb genomic distances, because of chromosome\nterritories (Barbieri et al., 2011; Mateos-Langerak et al., 2009; Shopland et al., 2006). For the\nE. coli nucleoid, the only available quantitative data (Wiggins et al., 2010) indicate that R(s)\nmight scale like s for non-replicating chromosomes at scales of 0.3-2 Mb.\nIn principle, a link between nucleoid geometry and the measured nucleoid local dynamics is\nexpected. The anomalous diffusion of chromosomal loci in E .coli has been modeled in terms\nof fractional Langevin equations (Weber et al., 2010b); such an approach correctly reproduces\nthe temporal behavior of the loci, but disregards the geometry of the structure containing\nthem. Very likely, for any polymer, this structure has a fractal character, and one would like\nto understand how this influences the motion of the loci. A minimal model would consider a\nrelaxation equation over the fractal. For a purely self-avoiding polymer one has Df ≈ 1.7. In\nthe case of a self-attracting polymer where attraction is screened by self-avoidance, i.e. at the θ\npoint (DeGennes, 1979; Grosberg & Khokhlov, 1994), it is reasonable to assume a mass fractal\ndimension Df = 2, as for a ghost chain. When the tendency towards compaction increases, one\nexpects that Df will increase accordingly.\nIn order to illustrate this point with an example, we can consider protein structures. Data\nfrom the Protein Data Bank (Berman et al., 2000) for 200 proteins with a number of amino\nacids ranging from N ≈ 100 to N ≈ 10000 give values of Df from 2.3 up to 2.6 (Enright &\nLeitner, 2005). On a larger scale, high resolution X-ray spectroscopy has resolved the ribosome\nstructure at the atomic level. Such data indicate (Lee, 2006) that the heavier 50S unit is\nfully compacted, with Df = 3, while the lighter 30S unit has Df = 2.8; it has been argued\nthat the sparser structure of 30S is compatible with a dynamic geometry, as required in the\ntranslation process. Folded proteins are generally described as an harmonic network, by the\n\n\f21\nso-called Gaussian Network Model (Reuveni et al., 2010), and we can try to apply a similar\nreasoning to the nucleoid. Close to the fully collapsed regime of a very long polymer such as a\nbacterial chromosome, where one expects Df ≈ 3, the harmonic approximation strictly does not\napply, because hard-core repulsion acts against chain compression. The total energy can then\nbe written as an harmonic \"Rouse\" term, describing waves propagating along the chain, plus\na self-attraction term and a self-avoidance term. The relaxation dynamics in such conditions\n(neglecting hydrodynamic interactions) has been studied within a continuum model approach\nby Pitard and Orland (Pitard & Orland, 1998). They find that the relaxation time τ of the\nglobule scales with the polymer length N as τ ≈ N 5/3 . Taking into account that the globule\nsize R scales as R ≈ N 1/3 (i.e. it fills space), this implies that R2 ≈ (τ 3/5 )2/3 ≈ (τ )2/5 (since\nN ≈ τ 3/5 ). This scaling appears to coincide with the experimental value for the anomalous\ndiffusion exponent α = 0.4 measured by Weber and coworkers (Weber et al., 2010a), previously\nquoted in the text. In other words, the Rouse subdiffusive dynamics of a collapsing (and thus\noff-equilibrium) globule follows the same scaling law as the observed local dynamics of nucleoid\nloci within a range of time scales. While this might be simply a coincidence, it leads us to\nspeculate that the measured dynamic exponent for the mean-square displacement might be the\nconsequence of a fractal-globule-like nature of the nucleoid, at least within a range of length\nscales.\nThis argument can be recast in more generic terms. Rouse polymer relaxation dynamics\nwas originally explored by De Gennes (DeGennes, 1976), who obtained the scaling relation\nz = 2+Df , where z ≡ 2/α is the so-called dynamical exponent. At the θ point (DeGennes, 1979;\nGrosberg & Khokhlov, 1994) where one has Df = 2, the DeGennes's relation gives α = 1/2,\nthe Rouse result for non-interacting chains. As the polymer dimension Df increases, a smaller\nvalue of α is to be expected; in the compacted configuration, where Df = 3, the relation gives\nz = 5, which is the result reported above. DeGennes's work is based on scaling arguments, but\nis confirmed by field-theoretical methods (Wiese, 1998) for two-body interactions.\nTo our knowledge, in the collapsed regime the relation has been proved only at the level of\nmean field (Pitard & Orland, 1998) by modeling, in the spirit of a virial expansion, the effective\ninteraction with an attractive two-body term and a repulsive three-body term.\nIn conclusion, if the nucleoid behaves like a fractal globule (i.e. an off-equilibrium polymer\ncollapsing because of self attraction, but where entanglement is prevented by topological constraints), or more in general if it has fractal dimension Df = 3, from mean field theory one\nexpects the subdiffusion exponent α = 0.4. Conversely, if the DeGennes relation is valid, the\nexperimental result α ≈ 0.4, observed in E. coli and in large plasmids (Weber et al., 2010a),\nimplies that the nucleoid fractal dimension could be Df ≈ 3.\nTo our knowledge the available experimental result that comes closer to a direct measurement of Df deals with the mean square displacement of fluorescently tagged replisomes (ReyesLamothe et al., 2008). In the approximation of constant replication fork velocity along the\nmother DNA, replication time in this experiment and genomic arclength distance have equal\nscaling. Hence, neglecting the global movements due to chromosomal segregation, the replisome's anomalous diffusion exponent αR measures the effective fractal dimension Df,R of the\nreplicating DNA. Specifically, the scaling M SD(t) ∼ tαR implies αR ∼ 2/Df,R . Obviously, this\nmeasured Df,R in principle contains errors due to fluctuations of a stationary background as\nwell as large scale effects associated with coherent restructuring of the nucleoid. The latter processes are relevant for segregation, but in the initial phases of replication one can assume that\nthey can be disregarded, as we are in the presence of a \"weak perturbation\" of the stationary\n(non-replicating) structure. In such a case, the time fluctuations of the fork velocity and the\nsteady state anomalous diffusion of genetic loci would be the main corrections to be taken into\naccount in order to estimate Df from the measured Df,R . Quite interestingly the experimental estimates of the exponent αR from (Reyes-Lamothe et al., 2008) are αR ∼ 0.66 and 0.58\nfor experiments with 30s and 5min time lapses respectively. If these numbers were confirmed\nby further measurements and accurate data analysis, they would support the hypothesis that\n\n\f22\nDf ∼ 3 for a range of chromosomal scales, independently on the reasoning presented above,\nbased on the DeGennes scaling relation z = 2 + Df .\nClearly, for the nucleoid one expects a structure with a range of fractal dimensions in different scale regimes, as suggested by the case of chromatin and the ribosome. The existence of\na range of fractal dimensions is also supported by the microscopy results for fluorescent pairs\nof loci reporting a linear correlation between loci distance in the cell and along the chromosome (Wiggins et al., 2010). The linear correlation could result from any sequentially ordered\nsegregation process generating a uniform mass density. For example, one might consider a periodic winding of the chromosome (Képès & Valliant, 2003; Mathelier & Carbone, 2010), that\ncould be produced by a segregation choreography of the type observed in B. subtilis as well as\nin E. coli. However, this needs to be reconciled with the observed subdiffusion. As for the case\nof chromatin, a hierarchical structure is very logical, since some chromosomal functions, such\nas transcription, replication and DNA repair, require a certain degree of plasticity, and are not\ncompatible with full compaction at all scales and at all times. Thus, the linear correlation of\nloci subcellular position and genomic distance can be consistent with Df ≈ 3, but further work\nis needed to determine the range of spatial scales where these properties apply.\nThe main objection against the fractal-globule as a long-lasting transient state supported by\ntopological constraints is the ubiquitous presence of topoisomerases, DNA enzymes able to cut\nand paste strands and thus easily resolve these constraints. An interesting theoretical study has\nfocused on the entanglement of tethered rings (Marko, 2009); it is argued that entanglements\nwould \"condense\", i.e. aggregate in space, in physically relevant situations, which, in presence\nof enzymes, would facilitate further the resolution of topological constraints. This kind of\nobjection holds for both the eukaryotic and the prokaryotic case. It cannot be excluded that\nthe non-equilibrium constraints leading to the fractal structure observed in Hi-C experiments\nare caused by something else, or more in general, and more plausibly, that a different physical\nprocess than simple topological constraints leads to the observed phenomenology. However, the\ngeneric reasoning presented above for connecting Df and α might be robust with respect to\nthese considerations.\nOther approaches to chromatin organization aim at reproducing the interlocus distance\nR(s) and the distribution of interacting loci Pc (s) with alternative polymer models, such as\na collapsing self-avoiding walk in a solution of organizing proteins which can bind and act\nas discrete self-attraction points, representing organizing proteins (Nicodemi & Prisco, 2009).\nThe spirit of this kind of study is to go beyond a dominant role of entropy, and take more\nseriously the \"energetic part\" of the free energy, and in particular the organizing proteins. The\nconsequences of this hypothesis are explored by analyzing the resulting equilibrium structures\nfor the polymer. Nicodemi and coworkers have recently found that such a model polymer could\nbe close the θ point for empirically relevant protein concentrations, and small variation of the\nconcentration of binding proteins around this state could recapitulate a considerable part of\nthe observed phenomenology of nuclear eukaryotic DNA (Barbieri et al., 2011).\nFinally, as mentioned above, it is also worthwhile to consider whether equilibrium statistical\nmechanics is even the proper starting point to understand the structure of the bacteria nucleoid.\nCells expend a considerable amount of energy maintaining steady-state, non-equilibrium environments. A classic example is the membrane potential, whose existence requires an elaborate\nmechanism for pumping protons through the membrane. Given that the genomic information\nis arguably the most important part of the cell, containing both the instructions for the current\ncell and the inheritable information for the next generation, it seems unlikely that bacteria have\nevolved such that the structure of the nucleoid is resigned to equilibrium.\nVI. CONCLUSIONS.\n\nTo conclude, we briefly review some of the main features of the partial and emerging picture\nof the nucleoid, from the physics viewpoint. All these problems still need to be understood in\n\n\f23\na quantitative framework for bacterial physiology (Scott & Hwa, 2011), and in particular for\nvarying growth rates (and subcellular compositions) and during adaptation to different growth\nconditions (Muskhelishvili et al., 2010).\nA first problem that can be isolated is the explanation of its compaction/condensation properties. Likely mechanisms that can influence (positively or negatively) nucleoid condensation\n(and more than one can be at play) include (i) supercoiling, bending and looping, in interplay\nwith binding of NAPs, which can cause punctual or polymer-like links building aggregation\nfoci (H-NS, MatP) and stabilize a ramified plectonemic loop structure (Fis), (ii) consequences\nof molecular crowding, in the form of both phase separation and depletion interactions, and\n(iii) (nonequilibrium) segregation after replication, which could be induced by different physical\nprocesses.\nA second, related problem is the geometry of the nucleoid, which requires understanding\nhow the subunits are arranged in the cell at different scales and times. It is likely that the\norganization principles in a given cell state (determined e.g. by growth rate and growth phase)\nare different at different scales. At the micron scale, the experiments seem to converge towards\na linearly-arranged sausage-shaped structure, sometimes wrapped by the Ter region, and the\nmain outstanding questions seem to relate to the physical mechanisms behind segregation and\nits choreography. Below this scale, the existence of macrodomains and transcription foci still\nelude a physical explanation, which could be microphase separation stabilized by short-ranged\nattractions of chemical (organizing proteins such as MatP) or of entropic (ribosome-induced\ndepletion interactions) origin. At an even smaller scale, an organization in blobs or fibers seems\nto be equally elusive, despite the existence of numerous pieces of evidence for different aspects\nof NAP binding and plectonemic loop formation and stabilization.\nFinally, it is important to point out that within the layered information given here there\nlies more than one unresolved question. For example, if macrodomains are microphases structured by protein binding, then certainly these proteins must play an important role in the\nconfigurational entropy of the nucleoid, which is not considered in the arguments concerning\nentropy-driven chromosome segregation. Also, if the genome is compacted (at least in a range\nof scales) in a fractal or conventional globule configuration by attractive interactions of entropic or energetic origin, this will greatly affect its entropy, and thus its mechanical properties,\nloci dynamics and the interactions between segregating chromosomes. Equally important, the\nsupercoiling-independent size of structural units measured for purified nucleoids (whose size\nvaries with supercoiling) appears challenging for theoretical explanations. While we are certainly far from a coherent and consistent physical description of the nucleoid, there is a clear\nabundance of existing data and many ongoing experiments merging quantitative biophysics and\nhigh-throughput molecular biology. These emerging results, together with the fragmented but\npartially successful modeling approaches, make us believe that we might be on the verge of\nresolving at least some of the existing issues regarding the physics of the bacterial nucleoid.\nAcknowledgments\n\nWe are very grateful to Bianca Sclavi for discussions, feedback, and help with the revision\nof this manuscript, and to Mario Nicodemi, Andrea Parmeggiani, Eric Siggia, Georgi Muskhelishvili, Ivan Junier, Zhicheng Long, Avelino Javer, Matteo Osella, Matthew Grant, and Eileen\nNugent for useful discussions. We also thank Christine Hardy for kindly allowing us to reprint\nFig. 3A. This work was supported by the International Human Frontier Science Program Organization, grant RGY0069/2009-C.\n\n\f24\nReferences\nAlberts, B., Bray, D., Lewis, J., Raff, M., Roberts, K., & Watson, J.D. 2008. Molecular Biology of the\nCell. 5th edn. Garland.\nAmit, Roee, Oppenheim, Amos B., & Stavans, Joel. 2003. Increased bending rigidity of single DNA\nmolecules by H-NS, a temperature and osmolarity sensor. Biophys J, 84(4), 2467–2473.\nArnold, Axel, & Jun, Suckjoon. 2007. Time scale of entropic segregation of flexible polymers in\nconfinement: implications for chromosome segregation in filamentous bacteria. Phys Rev E Stat\nNonlin Soft Matter Phys, 76(3 Pt 1), 031901.\nBarbieri, M, Chotalia, M, Lavitas, L-M, Fraser, J, Dostie, J., Pombo, A, & Nicodemi, M. 2011.\nComplexity of Chromatin Folding: the Strings and Binders Switch Model. submitted.\nBerger, Michael, Farcas, Anca, Geertz, Marcel, Zhelyazkova, Petya, Brix, Klaudia, Travers, Andrew,\n& Muskhelishvili, Georgi. 2010. Coordination of genomic structure and transcription by the main\nbacterial nucleoid-associated protein HU. EMBO Rep, 11(1), 59–64.\nBerlatzky, Idit Anna, Rouvinski, Alex, & Ben-Yehuda, Sigal. 2008. Spatial organization of a replicating\nbacterial chromosome. Proc Natl Acad Sci U S A, 105(37), 14136–14140.\nBerman, H. M., Westbrook, J., Feng, Z., Gilliland, G., Bhat, T. N., Weissig, H., Shindyalov, I. N., &\nBourne, P. E. 2000. The Protein Data Bank. Nucleic Acids Res, 28(1), 235–242.\nBlot, N., Mavathur, R., Geertz, M., Travers, A., & Muskhelishvili, G. 2006. Homeostatic regulation of\nsupercoiling sensitivity coordinates transcription of the bacterial genome. Embo Rep., 7(7), 710–715.\nBradley, M. D., Beach, M. B., de Koning, A. P. J., Pratt, T. S., & Osuna, R. 2007. Effects of Fis on\nEscherichia coli gene expression during different growth stages. Microbiology, 153, 2922–2940.\nBreier, Adam M, & Cozzarelli, Nicholas R. 2004. Linear ordering and dynamic segregation of the\nbacterial chromosome. Proc Natl Acad Sci U S A, 101(25), 9175–9176.\nBuenemann, Mathias, & Lenz, Peter. 2010. A geometrical model for DNA organization in bacteria.\nPLoS One, 5(11), e13806.\nBurov, S., & Barkai, E. 2008. Fractional Langevin equation: overdamped, underdamped, and critical\nbehaviors. Phys Rev E Stat Nonlin Soft Matter Phys, 78(3 Pt 1), 031112.\nButan, Carmen, Hartnell, Lisa M, Fenton, Andrew K, Bliss, Donald, Sockett, R. Elizabeth, Subramaniam, Sriram, & Milne, Jacqueline L S. 2011. Spiral architecture of the nucleoid in Bdellovibrio\nbacteriovorus. J Bacteriol, 193(6), 1341–1350.\nCabrera, Julio E, Cagliero, Cedric, Quan, Selwyn, Squires, Catherine L, & Jin, Ding Jun. 2009. Active\ntranscription of rRNA operons condenses the nucleoid in Escherichia coli: examining the effect of\ntranscription on nucleoid structure in the absence of transertion. J Bacteriol, 191(13), 4180–4185.\nCho, Hongbaek, McManus, Heather R, Dove, Simon L, & Bernhardt, Thomas G. 2011. Nucleoid\nocclusion factor SlmA is a DNA-activated FtsZ polymerization antagonist. Proc Natl Acad Sci U S\nA, 108(9), 3773–3778.\nCondamin, S., Tejedor, V., Voituriez, R., Bnichou, O., & Klafter, J. 2008. Probing microscopic origins\nof confined subdiffusion by first-passage observables. Proc Natl Acad Sci U S A, 105(15), 5675–5680.\nConfalonieri, F., Elie, C., Nadal, M., de La Tour, C., Forterre, P., & Duguet, M. 1993. Reverse gyrase:\na helicase-like domain and a type I topoisomerase in the same polypeptide. Proc Natl Acad Sci U\nS A, 90(10), 4753–4757.\nCosgriff, Sarah, Chintakayala, Kiran, Chim, Ya Tsz A, Chen, Xinyong, Allen, Stephanie, Lovering,\nAndrew L, & Grainger, David C. 2010. Dimerization and DNA-dependent aggregation of the Escherichia coli nucleoid protein and chaperone CbpA. Mol Microbiol, 77(5), 1289–1300.\nCunha, S., Odijk, T., Suleymanoglu, E., & Woldringh, C. L. 2001. Isolation of the Escherichia coli\nnucleoid. Biochimie, 83(2), 149–54.\nCunha, S., Woldringh, C. L., & Odijk, T. 2005. Restricted diffusion of DNA segments within the\nisolated Escherichia coli nucleoid. J Struct Biol, 150(2), 226–32.\nDame, Remus T., Noom, Maarten C., & Wuite, Gijs J L. 2006. Bacterial chromatin organization by\n\n\f25\nH-NS protein unravelled using dual DNA manipulation. Nature, 444(7117), 387–390.\nDame, Remus T, Kalmykowa, Olga J, & Grainger, David C. 2011. Chromosomal macrodomains and\nassociated proteins: implications for DNA organization and replication in gram negative bacteria.\nPLoS Genet, 7(6), e1002123.\nDaube, Shirley S, Bracha, Dan, Buxboim, Amnon, & Bar-Ziv, Roy H. 2010. Compartmentalization\nby directional gene expression. Proc Natl Acad Sci U S A, 107(7), 2836–2841.\nde Vries, Renko. 2010. DNA condensation in bacteria: Interplay between macromolecular crowding\nand nucleoid proteins. Biochimie, 92(12), 1715–1721.\nDeGennes, P. G. 1979. Scaling concepts in Polymer Physics. Cornell University Press.\nDeGennes, P.G. 1976. Dynamics of entangled polymer solutions I. The Rouse model. Macromolecules,\n9, 587.\nDerman, Alan I, Lim-Fong, Grace, & Pogliano, Joe. 2008. Intracellular mobility of plasmid DNA is\nlimited by the ParA family of partitioning systems. Mol Microbiol, 67(5), 935–946.\nDiamant, H., & Andelman, D. 2000. Binding of molecules to DNA and other semiflexible polymers.\nPhys Rev E, 61(6 Pt B), 6740–9.\nDillon, Shane C, & Dorman, Charles J. 2010. Bacterial nucleoid-associated proteins, nucleoid structure\nand gene expression. Nat Rev Microbiol, 8(3), 185–195.\nDolgushev, Maxim, & Blumen, Alexander. 2009. Dynamics of semiflexible treelike polymeric networks.\nJ Chem Phys, 131(4), 044905.\nEdwards, S F, & Freed, K F. 1969. The entropy of a confined polymer. I. Journal of Physics A:\nGeneral Physics, 2(2), 145.\nEnright, Matthew B, & Leitner, David M. 2005. Mass fractal dimension and the compactness of\nproteins. Phys Rev E Stat Nonlin Soft Matter Phys, 71(1 Pt 1), 011912.\nEspéli, O, & Boccard, F. 2006. Organization of the Escherichia coli chromosome into macrodomains\nand its possible functional implications. J Struct Biol, 156(2), 304–10.\nEspéli, O, Mercier, R, & Boccard, F. 2008. DNA dynamics vary according to macrodomain topography\nin the E. coli chromosome. Mol Microbiol, 68(6), 1418–27.\nEstevez-Torres, Andre, & Baigl, Damien. 2011. DNA compaction: fundamentals and applications.\nSoft Matter, 7, 6746–6756.\nFarago, Oded, & Kantor, Yacov. 2000. Elasticity of Gaussian and nearly Gaussian phantom networks.\nPhys. Rev. E, 62(5), 6094–.\nFritsche, Miriam, Li, Songling, Heermann, Dieter W, & Wiggins, Paul A. 2011. A model for Escherichia\ncoli chromosome packaging supports transcription factor-induced DNA domain formation. Nucleic\nAcids Res, Oct.\nGraessley, William W. 1980. Linear Viscoelasticity in Gaussian Networks. Macromolecules, 13(2),\n372–376.\nGrainger, D. C., Hurd, D., Harrison, M., Holdstock, J., & Busby, S. J. 2005. Studies of the distribution\nof Escherichia coli cAMP-receptor protein and RNA polymerase along the E. coli chromosome. Proc\nNatl Acad Sci U S A, 102(49), 17693–8.\nGrainger, D. C., Hurd, D., Goldberg, M. D., & Busby, S. J. W. 2006. Association of nucleoid proteins\nwith coding and non-coding segments of the Escherichia coli genome. Nucleic Acids Research,\n34(16), 4642–4652.\nGrainger, D. C., Aiba, H., Hurd, D., Browning, D. F., & Busby, S. J. 2007. Transcription factor\ndistribution in Escherichia coli: studies with FNR protein. Nucleic Acids Res, 35(1), 269–78.\nGrainger, D. C., Goldberg, M. D., Lee, D. J., & Busby, S. J. 2008. Selective repression by Fis and\nH-NS at the Escherichia coli dps promoter. Mol Microbiol, 68(6), 1366–77.\nGrosberg, Rabin, Havlin, & Neer. 1993. Crumpled Globule Model of the Three-Dimensional Structure\nof DNA. Europhys. Lett., 23 (5), 373–378.\nGrosberg, A., & Khokhlov, A. 1994. Statistical Physics of Macromolecules. AIP, NY.\nHe, Y., Burov, S., Metzler, R., & Barkai, E. 2008. Random time-scale invariant diffusion and transport\n\n\f26\ncoefficients. Phys Rev Lett, 101(5), 058101.\nHelvoort, J. M. Van, Huls, P. G., Vischer, N. O., & Woldringh, C. L. 1998. Fused nucleoids resegregate\nfaster than cell elongation in Escherichia coli pbpB(Ts) filaments after release from chloramphenicol\ninhibition. Microbiology, 144 ( Pt 5)(May), 1309–1317.\nHuang, Wei-Hua, Zinchenko, Anatoly A., Pawlak, Cyril, Chen, Yong, & Baigl, Damien. 2007. Dynamic\nconformational behavior and molecular interaction discrimination of DNA/binder complexes by\nsingle-chain stretching in a microdevice. Chembiochem, 8(15), 1771–1774.\nJanssen, Hans-Karl, & Stenull, Olaf. 2011. Collapse transition of randomly branched polymers: Renormalized field theory. Phys Rev E Stat Nonlin Soft Matter Phys, 83(5 Pt 1), 051126.\nJasch, F., von Ferber, Ch, & Blumen, A. 2003. Dynamics of randomly branched polymers: configuration averages and solvable models. Phys Rev E Stat Nonlin Soft Matter Phys, 68(5 Pt 1),\n051106.\nJensen, R. B., Wang, S. C., & Shapiro, L. 2001. A moving DNA replication factory in Caulobacter\ncrescentus. EMBO J, 20(17), 4952–4963.\nJin, D. J., & Cabrera, J. E. 2006. Coupling the distribution of RNA polymerase to global gene\nregulation and the dynamic structure of the bacterial nucleoid in Escherichia coli. J Struct Biol,\n156(2), 284–91.\nJoshi, Mohan C, Bourniquel, Aude, Fisher, Jay, Ho, Brian T, Magnan, David, Kleckner, Nancy,\n& Bates, David. 2011. Escherichia coli sister chromosome separation includes an abrupt global\ntransition with concomitant release of late-splitting intersister snaps. Proc Natl Acad Sci U S A,\nJan.\nJun, S, & Mulder, B. 2006. Entropy-driven spatial organization of highly confined polymers: lessons\nfor the bacterial chromosome. Proc Natl Acad Sci U S A, 103(33), 12388–93.\nJun, Suckjoon, & Wright, Andrew. 2010. Entropy as the driver of chromosome segregation. Nat Rev\nMicro, 8(8), 600–607.\nJung, Y., & Ha, B-Y. 2010. Overlapping two self-avoiding polymers in a closed cylindrical pore:\nImplications for chromosome segregation in a bacterial cell. Phys Rev E, 82 (5),, 51926–51931.\nJunier, Ivan, Martin, Olivier, & Képès, François. 2010. Spatial and Topological Organization of DNA\nChains Induced by Gene Co-localization. PLoS Comput Biol, 6(2), e1000678.\nKahramanoglou, Christina, Seshasayee, Aswin S N., Prieto, Ana I., Ibberson, David, Schmidt, Sabine,\nZimmermann, Jurgen, Benes, Vladimir, Fraser, Gillian M., & Luscombe, Nicholas M. 2011. Direct\nand indirect effects of H-NS and Fis on global gene expression control in Escherichia coli. Nucleic\nAcids Res, 39(6), 2073–2091.\nKantor, & Kardar. 1996. Conformations of randomly linked polymers. Phys Rev E Stat Phys Plasmas\nFluids Relat Interdiscip Topics, 54(5), 5263–5267.\nKavenoff, R., & Bowen, B. C. 1976. Electron microscopy of membrane-free folded chromosomes from\nEscherichia coli. Chromosoma, 59(2), 89–101.\nKépès, F., & Valliant, C. 2003. Transcription-based solenoidal model of chromosome. ComPlexUs, 1,\n171–180.\nKim, J., Yoshimura, S. H., Hizume, K., Ohniwa, R. L., Ishihama, A., & Takeyasu, K. 2004. Fundamental structural units of the Escherichia coli nucleoid revealed by atomic force microscopy. Nucleic\nAcids Res, 32(6), 1982–92.\nKolatka, Katarzyna, Witosinska, Monika, Pierechod, Marcin, & Konieczny, Igor. 2008. Bacterial\npartitioning proteins affect the subcellular location of broad-host-range plasmid RK2. Microbiology,\n154(Pt 9), 2847–2856.\nKonopka, Michael C, Shkel, Irina A, Cayley, Scott, Record, M. Thomas, & Weisshaar, James C. 2006.\nCrowding and confinement effects on protein diffusion in vivo. J Bacteriol, 188(17), 6115–6123.\nLee, Chang-Yong. 2006. Mass fractal dimension of the ribosome and implication of its dynamic\ncharacteristics. Phys Rev E Stat Nonlin Soft Matter Phys, 73(4 Pt 1), 042901.\nLesterlin, C, Mercier, R, Boccard, F, Barre, FX, & Cornet, F. 2005. Roles for replichores and\n\n\f27\nmacrodomains in segregation of the Escherichia coli chromosome. EMBO Rep, 6(6), 557–62.\nLieberman-Aiden, Erez, van Berkum, Nynke L, Williams, Louise, Imakaev, Maxim, Ragoczy, Tobias, Telling, Agnes, Amit, Ido, Lajoie, Bryan R, Sabo, Peter J, Dorschner, Michael O, Sandstrom,\nRichard, Bernstein, Bradley, Bender, M. A., Groudine, Mark, Gnirke, Andreas, Stamatoyannopoulos, John, Mirny, Leonid A, Lander, Eric S, & Dekker, Job. 2009. Comprehensive mapping of\nlong-range interactions reveals folding principles of the human genome. Science, 326(5950), 289–\n293.\nLim, Ci Ji, Whang, Yixun R., Kenney, Linda J., & Yan, Jie. 2011. Gene silencing H-NS paralogue\nStpA forms a rigid protein filament along DNA that blocks DNA accessibility. Nucleic Acids Res,\nDec.\nLiu, Xun, Wang, Xindan, Reyes-Lamothe, Rodrigo, & Sherratt, David. 2010. Replication-directed\nsister chromosome alignment in Escherichia coli. Mol Microbiol, 75(5), 1090–1097.\nLuijsterburg, M. S., Noom, M. C., Wuite, G. J., & Dame, R. T. 2006. The architectural role of\nnucleoid-associated proteins in the organization of bacterial chromatin: a molecular perspective. J\nStruct Biol, 156(2), 262–72.\nMarenduzzo, D., Micheletti, C., & Orlandini, E. 2010. Biopolymer organization upon confinement. J\nPhys Condens Matter, 22(28), 283102.\nMarenduzzo, Davide, Finan, Kieran, & Cook, Peter R. 2006a. The depletion attraction: an underappreciated force driving cellular organization. J Cell Biol, 175(5), 681–686.\nMarenduzzo, Davide, Micheletti, Cristian, & Cook, Peter R. 2006b. Entropy-driven genome organization. Biophys J, 90(10), 3712–3721.\nMarko, J. F., & Cocco, S. 2003. The micromechanics of DNA. Phys. world, March, 37–41.\nMarko, John F. 2009. Linking topology of tethered polymer rings with applications to chromosome\nsegregation and estimation of the knotting length. Phys Rev E Stat Nonlin Soft Matter Phys, 79(5\nPt 1), 051905.\nMarr, C, Geertz, M, Hütt, MT, & Muskhelishvili, G. 2008. Dissecting the logical types of network\ncontrol in gene expression profiles. BMC Syst Biol, 2, 18.\nMateos-Langerak, Julio, Bohn, Manfred, de Leeuw, Wim, Giromus, Osdilly, Manders, Erik M M,\nVerschure, Pernette J, Indemans, Mireille H G, Gierman, Hinco J, Heermann, Dieter W, van Driel,\nRoel, & Goetze, Sandra. 2009. Spatially confined folding of chromatin in the interphase nucleus.\nProc Natl Acad Sci U S A, 106(10), 3812–3817.\nMathelier, Anthony, & Carbone, Alessandra. 2010. Chromosomal periodicity and positional networks\nof genes in Escherichia coli. Mol Syst Biol, 6(May), 366.\nMaurer, Sebastian, Fritz, Jørgen, & Muskhelishvili, Georgi. 2009. A Systematic In Vitro Study of\nNucleoprotein Complexes Formed by Bacterial Nucleoid-Associated Proteins Revealing Novel Types\nof DNA Organization. Journal of Molecular Biology, 387(5), 1261–1276.\nMeile, Jean-Christophe, Mercier, Romain, Stouf, Mathieu, Pages, Carine, Bouet, Jean-Yves, & Cornet,\nFranois. 2011. The terminal region of the E. coli chromosome localises at the periphery of the\nnucleoid. BMC Microbiol, 11(1), 28.\nMercier, Romain, Petit, Marie-Agnes, Schbath, Sophie, Robin, Stephane, Karoui, Meriem El, Boccard,\nFrederic, & Espéli, Olivier. 2008. The MatP/matS site-specific system organizes the terminus region\nof the E. coli chromosome into a macrodomain. Cell, 135(3), 475–485.\nMirny, Leonid A. 2011. The fractal globule as a model of chromatin architecture in the cell. Chromosome Res, 19(1), 37–51.\nMoulin, L, Rahmouni, AR, & Boccard, F. 2005. Topological insulators inhibit diffusion of\ntranscription-induced positive supercoils in the chromosome of Escherichia coli. Mol Microbiol,\n55(2), 601–10.\nMuskhelishvili, Georgi, Sobetzko, Patrick, Geertz, Marcel, & Berger, Michael. 2010. General organisational principles of the transcriptional regulation system: a tree or a circle? Mol Biosyst, 6(4),\n662–676.\n\n\f28\nNicodemi, Mario, & Prisco, Antonella. 2009. Thermodynamic pathways to genome spatial organization\nin the cell nucleus. Biophys J, 96(6), 2168–2177.\nNielsen, H. J., Ottesen, J. R., Youngren, B., Austin, S. J., & Hansen, F. G. 2006. The Escherichia\ncoli chromosome is organized with the left and right chromosome arms in separate cell halves. Mol\nMicrobiol, 62(2), 331–8.\nNielsen, H. J., Youngren, B., Hansen, F. G., & Austin, S. 2007. Dynamics of Escherichia coli chromosome segregation during multifork replication. J Bacteriol, 189(23), 8660–6.\nNiki, H., Yamaichi, Y., & Hiraga, S. 2000. Dynamic organization of chromosomal DNA in Escherichia\ncoli. Genes Dev, 14(2), 212–23.\nNorris, V. 1995. Hypothesis: chromosome separation in Escherichia coli involves autocatalytic gene\nexpression, transertion and membrane-domain formation. Mol Microbiol, 16(6), 1051–1057.\nOchman, H., & Groisman, E. A. 1994. The origin and evolution of species differences in Escherichia\ncoli and Salmonella typhimurium. EXS, 69, 479–493.\nOdijk, T. 1998. Osmotic compaction of supercoiled DNA into a bacterial nucleoid. Biophys Chem,\n73(1-2), 23–9.\nOdijk, Theo, & Ubbink, Job. 1998. Dimensions of a plectonemic DNA supercoil under fairly general\nperturbations. Physica A: Statistical and Theoretical Physics, 252(1-2), 61–66.\nOhniwa, R. L., Morikawa, K., Kim, J., Ohta, T., Ishihama, A., Wada, C., & Takeyasu, K. 2006.\nDynamic state of DNA topology is essential for genome condensation in bacteria. EMBO J, 25(23),\n5591–602.\nOhniwa, Ryosuke L, Ushijima, Yuri, Saito, Shinji, & Morikawa, Kazuya. 2011. Proteomic analyses\nof nucleoid-associated proteins in Escherichia coli, Pseudomonas aeruginosa, Bacillus subtilis, and\nStaphylococcus aureus. PLoS One, 6(4), e19172.\nOshima, Taku, Ishikawa, Shu, Kurokawa, Ken, Aiba, Hirofumi, & Ogasawara, Naotake. 2006. Escherichia coli histone-like protein H-NS preferentially binds to horizontally acquired DNA in association with RNA polymerase. DNA Res, 13(4), 141–153.\nPitard, E., & Orland, H. 1998. Dynamics of the swelling or collapse of a homopolymer. Europhys.\nLett., 41(4), 467–472.\nPostow, L, Hardy, CD, Arsuaga, J, & Cozzarelli, NR. 2004. Topological domain structure of the\nEscherichia coli chromosome. Genes Dev, 18(14), 1766–79.\nReuveni, Shlomi, Granek, Rony, & Klafter, Joseph. 2010. Anomalies in the vibrational dynamics of\nproteins are a consequence of fractal-like structure. Proc Natl Acad Sci U S A, 107(31), 13696–13700.\nReyes-Lamothe, R, Possoz, C, Danilova, O, & Sherratt, DJ. 2008. Independent positioning and action\nof Escherichia coli replisomes in live cells. Cell, 133(1), 90–102.\nRobinow, C., & Kellenberger, E. 1994. The bacterial nucleoid revisited. Microbiol Rev, 58(2), 211–232.\nRocha, Eduardo P C. 2008. The organization of the bacterial genome. Annu Rev Genet, 42, 211–233.\nRomantsov, T., Fishov, I., & Krichevsky, O. 2007. Internal structure and dynamics of isolated Escherichia coli nucleoids assessed by fluorescence correlation spectroscopy. Biophys J, 92(8), 2875–84.\nSánchez-Romero, Mara Antonia, Busby, Stephen J W, Dyer, Nigel P, Ott, Sascha, Millard, Andrew D,\n& Grainger, David C. 2010. Dynamic distribution of SeqA protein across the chromosome of Escherichia coli K-12. MBio, 1(1).\nSchneider, R., Lurz, R., Lder, G., Tolksdorf, C., Travers, A., & Muskhelishvili, G. 2001. An architectural role of the Escherichia coli chromatin protein FIS in organising DNA. Nucleic Acids Res,\n29(24), 5107–5114.\nScolari, Vittore F, Bassetti, Bruno, Sclavi, Bianca, & Lagomarsino, Marco Cosentino. 2011. Gene\nclusters reflecting macrodomain structure respond to nucleoid perturbations. Mol Biosyst, 7(3),\n878–888.\nScott, Matthew, & Hwa, Terence. 2011. Bacterial growth laws and their applications. Curr Opin\nBiotechnol, 22(4), 559–565.\nScott, Matthew, Gunderson, Carl W, Mateescu, Eduard M, Zhang, Zhongge, & Hwa, Terence. 2010.\n\n\f29\nInterdependence of cell growth and gene expression: origins and consequences. Science, 330(6007),\n1099–1102.\nSherratt, David J. 2003. Bacterial Chromosome Dynamics. Science, 301(5634), 780–785.\nShopland, Lindsay S, Lynch, Christopher R, Peterson, Kevin A, Thornton, Kathleen, Kepper, Nick,\nvon Hase, Johann, Stein, Stefan, Vincent, Sarah, Molloy, Kelly R, Kreth, Gregor, Cremer, Christoph,\nBult, Carol J, & O'Brien, Timothy P. 2006. Folding and organization of a contiguous chromosome\nregion according to the gene distribution pattern in primary genomic sequence. J Cell Biol, 174(1),\n27–38.\nSkoko, Dunja, Yoo, Daniel, Bai, Hua, Schnurr, Bernhard, Yan, Jie, McLeod, Sarah M., Marko, John F.,\n& Johnson, Reid C. 2006. Mechanism of Chromosome Compaction and Looping by the Escherichia\ncoli Nucleoid Protein Fis. Journal of Molecular Biology, 364(4), 777–798.\nSommer, J U, & Blumen, A. 1995. On the statistics of generalized Gaussian structures: collapse and\nrandom external fields. Journal of Physics A: Mathematical and General, 28(23), 6669.\nStavans, Joel, & Oppenheim, Amos. 2006. DNA-protein interactions and bacterial chromosome architecture. Physical Biology, 3(4), R1–.\nStuger, Rogier, Woldringh, Conrad L., van der Weijden, Coen C., Vischer, Norbert O. E., Bakker, Barbara M., van Spanning, Rob J.M., Snoep, Jacky L., & Weterhoff, Hans V. 2002. DNA Supercoiling\nby Gyrase is Linked to Nucleoid Compaction. Molecular Biology Reports, 29(1), 79–82.\nSumedha, & Weigt, Martin. 2008. A thermodynamic model for the agglomeration of DNA-looping\nproteins. Journal of Statistical Mechanics: Theory and Experiment, 2008(11), P11005.\nThanbichler, M., Wang, S. C., & Shapiro, L. 2005. The bacterial nucleoid: a highly organized and\ndynamic structure. J Cell Biochem, 96(3), 506–521.\nThanbichler, Martin, & Shapiro, Lucy. 2006. Chromosome organization and segregation in bacteria.\nJ Struct Biol, 156(2), 292–303.\nTonthat, Nam Ky, Arold, Stefan T, Pickering, Brian F, Dyke, Michael W Van, Liang, Shoudan, Lu,\nYue, Beuria, Tushar K, Margolin, William, & Schumacher, Maria A. 2011. Molecular mechanism\nby which the nucleoid occlusion factor, SlmA, keeps cytokinesis in check. EMBO J, 30(1), 154–164.\nToro, Esteban, & Shapiro, Lucy. 2010. Bacterial chromosome organization and segregation. Cold\nSpring Harb Perspect Biol, 2(2), a000349.\nTrun, N. J., & Marko, J. F. 1998. Architecture of a bacterial chromosome (review). American Society\nfor Microbiology News, 64, 276.\nUbbink, J., & Odijk, T. 1999. Electrostatic-undulatory theory of plectonemically supercoiled DNA.\nBiophysical journal, 76(5), 2502–2519.\nUmbarger, Mark A., Toro, Esteban, Wright, Matthew A., Porreca, Gregory J., Ba, Davide, Hong,\nSun-Hae, Fero, Michael J., Zhu, Lihua J., Marti-Renom, Marc A., McAdams, Harley H., Shapiro,\nLucy, Dekker, Job, & Church, George M. 2011. The three-dimensional architecture of a bacterial\ngenome and its alteration by genetic perturbation. Mol Cell, 44(2), 252–264.\nValens, M, Penaud, S, Rossignol, M, Cornet, F, & Boccard, F. 2004. Macrodomain organization of\nthe Escherichia coli chromosome. EMBO J, 23(21), 4330–41.\nvan Helvoort, J. M., Kool, J., & Woldringh, C. L. 1996. Chloramphenicol causes fusion of separated\nnucleoids in Escherichia coli K-12 cells and filaments. J Bacteriol, 178(14), 4289–4293.\nvan Noort, J., Verbrugge, S., Goosen, N., Dekker, C., & Dame, R. T. 2004. Dual architectural roles of\nHU: formation of flexible hinges and rigid filaments. Proc Natl Acad Sci U S A, 101(18), 6969–74.\nVettorel, Thomas, Grosberg, Alexander Y, & Kremer, Kurt. 2009. Statistics of polymer rings in the\nmelt: a numerical simulation study. Phys Biol, 6(2), 025013.\nViollier, Patrick H, Thanbichler, Martin, McGrath, Patrick T, West, Lisandra, Meewan, Maliwan,\nMcAdams, Harley H, & Shapiro, Lucy. 2004. Rapid and sequential movement of individual chromosomal loci to specific subcellular locations during bacterial DNA replication. Proc Natl Acad Sci\nU S A, 101(25), 9257–9262.\nVora, T., Hottes, A. K., & Tavazoie, S. 2009. Protein occupancy landscape of a bacterial genome.\n\n\f30\nMolecular Cell, 35, 247–253.\nWade, J. T., Struhl, K., Busby, S. J., & Grainger, D. C. 2007. Genomic analysis of protein-DNA\ninteractions in bacteria: insights into transcription and chromosome organization. Mol Microbiol,\n65(1), 21–6.\nWang, Wenqin, Li, Gene-Wei, Chen, Chongyi, Xie, X. Sunney, & Zhuang, Xiaowei. 2011a. Chromosome organization by a nucleoid-associated protein in live bacteria. Science, 333(6048), 1445–1449.\nWang, X., Liu, X., Possoz, C., & Sherratt, D. J. 2006. The two Escherichia coli chromosome arms\nlocate to separate cell halves. Genes Dev, 20(13), 1727–31.\nWang, Xindan, Lesterlin, Christian, Reyes-Lamothe, Rodrigo, Ball, Graeme, & Sherratt, David J.\n2011b. Replication and segregation of an Escherichia coli chromosome with two replication origins.\nProc Natl Acad Sci U S A, 108(26), E243–E250.\nWarren, P. B., & ten Wolde, P. R. 2004. Statistical analysis of the spatial distribution of operons in\nthe transcriptional regulation network of Escherichia coli. J Mol Biol, 342(5), 1379–1390.\nWeber, Stephanie C., Spakowitz, Andrew J., & Theriot, Julie A. 2010a. Bacterial Chromosomal Loci\nMove Subdiffusively through a Viscoelastic Cytoplasm. Phys. Rev. Lett., 104(23), 238102.\nWeber, Stephanie C, Theriot, Julie A, & Spakowitz, Andrew J. 2010b. Subdiffusive motion of a\npolymer composed of subdiffusive monomers. Phys Rev E Stat Nonlin Soft Matter Phys, 82(1 Pt\n1), 011913.\nWiese, K.J. 1998. Dynamics of Selfavoiding tethered Membranes I Model A Dynamics (Rouse Model).\nEur. Phys. J., B1, 269–272.\nWiggins, Paul A., Dame, Remus Th, Noom, Maarten C., & Wuite, Gijs J L. 2009. Protein-mediated\nmolecular bridging: a key mechanism in biopolymer organization. Biophys J, 97(7), 1997–2003.\nWiggins, Paul A., Cheveralls, Keith C., Martin, Joshua S., Lintner, Robert, & Kondev, Jané. 2010.\nStrong intranucleoid interactions organize the Escherichia coli chromosome into a nucleoid filament.\nProceedings of the National Academy of Sciences, 107(11), 4991–4995.\nWoldringh, C. L., & Nanninga, N. 2006. Structural and physical aspects of bacterial chromosome\nsegregation. J Struct Biol, 156(2), 273–83.\nXu, Weilin, & Muller, Susan J. 2012. Polymer-monovalent salt-induced DNA compaction studied via\nsingle-molecule microfluidic trapping. Lab Chip, 12(3), 647–651.\nZaslaver, Alon, Kaplan, Shai, Bren, Anat, Jinich, Adrian, Mayo, Avi, Dekel, Erez, Alon, Uri, &\nItzkovitz, Shalev. 2009. Invariant distribution of promoter activities in Escherichia coli. PLoS\nComput Biol, 5(10), e1000545.\nZhang, Ce, Shao, Pei Ge, van Kan, Jeroen A., & van der Maarel, Johan R C. 2009. Macromolecular\ncrowding induced elongation and compaction of single DNA molecules confined in a nanochannel.\nProc Natl Acad Sci U S A, 106(39), 16651–16656.\nZimm, Bruno H., & Stockmayer, Walter H. 1949. The Dimensions of Chain Molecules Containing\nBranches and Rings. The Journal of Chemical Physics, 17(12), 1301+.\nZimmerman, S. B. 2004. Studies on the compaction of isolated nucleoids from Escherichia coli. J\nStruct Biol, 147(2), 146–58.\nZimmerman, S. B. 2006a. Cooperative transitions of isolated Escherichia coli nucleoids: implications\nfor the nucleoid as a cellular phase. J Struct Biol, 153(2), 160–75.\nZimmerman, S. B. 2006b. Shape and compaction of Escherichia coli nucleoids. J Struct Biol, 156(2),\n255–61.\n\n\f"}