{"id": "http://arxiv.org/abs/0709.1144v2", "guidislink": true, "updated": "2008-01-30T21:51:09Z", "updated_parsed": [2008, 1, 30, 21, 51, 9, 2, 30, 0], "published": "2007-09-07T20:00:15Z", "published_parsed": [2007, 9, 7, 20, 0, 15, 4, 250, 0], "title": "Cosmic Microwave Background Statistics for a Direction-Dependent\n  Primordial Power Spectrum", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0709.0586%2C0709.4488%2C0709.4546%2C0709.1763%2C0709.0880%2C0709.3776%2C0709.2552%2C0709.1821%2C0709.3578%2C0709.2117%2C0709.3074%2C0709.1483%2C0709.3100%2C0709.2010%2C0709.1144%2C0709.0571%2C0709.0859%2C0709.0004%2C0709.2327%2C0709.0104%2C0709.4415%2C0709.2179%2C0709.3507%2C0709.0348%2C0709.4554%2C0709.2815%2C0709.3604%2C0709.0863%2C0709.1606%2C0709.3096%2C0709.0570%2C0709.1940%2C0709.3454%2C0709.1625%2C0709.3057%2C0709.3354%2C0709.3871%2C0709.1378%2C0709.1191%2C0709.3825%2C0709.4258%2C0709.0359%2C0709.1540%2C0709.3455%2C0709.1198%2C0709.2529%2C0709.2272%2C0709.3392%2C0709.4087%2C0709.4418%2C0709.1415%2C0709.1338%2C0709.0506%2C0709.3023%2C0709.0341%2C0709.4035%2C0709.0484%2C0709.1791%2C0709.1466%2C0709.1124%2C0709.1300%2C0709.3419%2C0709.2300%2C0709.4598%2C0709.4676%2C0709.3757%2C0709.1767%2C0709.2386%2C0709.1033%2C0709.0790%2C0709.4113%2C0709.1735%2C0709.0203%2C0709.0655%2C0709.2738%2C0709.4307%2C0709.1248%2C0709.2681%2C0709.4627%2C0709.3050%2C0709.3914%2C0709.3975%2C0709.3554%2C0709.2185%2C0709.3071%2C0709.2848%2C0709.0500%2C0709.1742%2C0709.2033%2C0709.4029%2C0709.1721%2C0709.2349%2C0709.3618%2C0709.1481%2C0709.1035%2C0709.1317%2C0709.2743%2C0709.2929%2C0709.1463%2C0709.3036%2C0709.0334&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Cosmic Microwave Background Statistics for a Direction-Dependent\n  Primordial Power Spectrum"}, "summary": "Statistical isotropy of primordial perturbations is a common assumption in\ncosmology, but it is an assumption that should be tested. To this end, we\ndevelop cosmic microwave background statistics for a primordial power spectrum\nthat depends on the direction, as well as the magnitude, of the Fourier\nwavevector. We first consider a simple estimator that searches in a\nmodel-independent way for anisotropy in the square of the temperature (and/or\npolarization) fluctuation. We then construct the minimum-variance estimators\nfor the coefficients of a spherical-harmonic expansion of the\ndirection-dependence of the primordial power spectrum. To illustrate, we apply\nthese statistics to an inflation model with a quadrupole dependence of the\nprimordial power spectrum on direction and find that a power quadrupole as\nsmall as 2.0% can be detected with the Planck satellite.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0709.0586%2C0709.4488%2C0709.4546%2C0709.1763%2C0709.0880%2C0709.3776%2C0709.2552%2C0709.1821%2C0709.3578%2C0709.2117%2C0709.3074%2C0709.1483%2C0709.3100%2C0709.2010%2C0709.1144%2C0709.0571%2C0709.0859%2C0709.0004%2C0709.2327%2C0709.0104%2C0709.4415%2C0709.2179%2C0709.3507%2C0709.0348%2C0709.4554%2C0709.2815%2C0709.3604%2C0709.0863%2C0709.1606%2C0709.3096%2C0709.0570%2C0709.1940%2C0709.3454%2C0709.1625%2C0709.3057%2C0709.3354%2C0709.3871%2C0709.1378%2C0709.1191%2C0709.3825%2C0709.4258%2C0709.0359%2C0709.1540%2C0709.3455%2C0709.1198%2C0709.2529%2C0709.2272%2C0709.3392%2C0709.4087%2C0709.4418%2C0709.1415%2C0709.1338%2C0709.0506%2C0709.3023%2C0709.0341%2C0709.4035%2C0709.0484%2C0709.1791%2C0709.1466%2C0709.1124%2C0709.1300%2C0709.3419%2C0709.2300%2C0709.4598%2C0709.4676%2C0709.3757%2C0709.1767%2C0709.2386%2C0709.1033%2C0709.0790%2C0709.4113%2C0709.1735%2C0709.0203%2C0709.0655%2C0709.2738%2C0709.4307%2C0709.1248%2C0709.2681%2C0709.4627%2C0709.3050%2C0709.3914%2C0709.3975%2C0709.3554%2C0709.2185%2C0709.3071%2C0709.2848%2C0709.0500%2C0709.1742%2C0709.2033%2C0709.4029%2C0709.1721%2C0709.2349%2C0709.3618%2C0709.1481%2C0709.1035%2C0709.1317%2C0709.2743%2C0709.2929%2C0709.1463%2C0709.3036%2C0709.0334&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Statistical isotropy of primordial perturbations is a common assumption in\ncosmology, but it is an assumption that should be tested. To this end, we\ndevelop cosmic microwave background statistics for a primordial power spectrum\nthat depends on the direction, as well as the magnitude, of the Fourier\nwavevector. We first consider a simple estimator that searches in a\nmodel-independent way for anisotropy in the square of the temperature (and/or\npolarization) fluctuation. We then construct the minimum-variance estimators\nfor the coefficients of a spherical-harmonic expansion of the\ndirection-dependence of the primordial power spectrum. To illustrate, we apply\nthese statistics to an inflation model with a quadrupole dependence of the\nprimordial power spectrum on direction and find that a power quadrupole as\nsmall as 2.0% can be detected with the Planck satellite."}, "authors": ["Anthony R. Pullen", "Marc Kamionkowski"], "author_detail": {"name": "Marc Kamionkowski"}, "author": "Marc Kamionkowski", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevD.76.103529", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0709.1144v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0709.1144v2", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "Published in Phys. Rev. D; 8 pages; 1 table; Table 1 corrected;\n  references added", "arxiv_primary_category": {"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0709.1144v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0709.1144v2", "journal_reference": "Phys.Rev.D76:103529,2007", "doi": "10.1103/PhysRevD.76.103529", "fulltext": "Cosmic Microwave Background Statistics for a Direction-Dependent Primordial\nPower Spectrum\nAnthony R. Pullen and Marc Kamionkowski\n\narXiv:0709.1144v2 [astro-ph] 30 Jan 2008\n\nCalifornia Institute of Technology, Mail Code 130-33, Pasadena, CA 91125\n(Dated: October 23, 2018)\nStatistical isotropy of primordial perturbations is a common assumption in cosmology, but it is an\nassumption that should be tested. To this end, we develop cosmic microwave background statistics\nfor a primordial power spectrum that depends on the direction, as well as the magnitude, of the\nFourier wavevector. We first consider a simple estimator that searches in a model-independent\nway for anisotropy in the square of the temperature (and/or polarization) fluctuation. We then\nconstruct the minimum-variance estimators for the coefficients of a spherical-harmonic expansion of\nthe direction-dependence of the primordial power spectrum. To illustrate, we apply these statistics\nto an inflation model with a quadrupole dependence of the primordial power spectrum on direction\nand find that a power quadrupole as small as 2.0% can be detected with the Planck satellite.\nPACS numbers: 98.80.-k\n\nI.\n\nINTRODUCTION\n\nIt is well known that the homogeneity and isotropy\nof the Universe are only approximate. There are departures from homogeneity and isotropy that are now\nwell-quantified by measurements of the cosmic microwave\nbackground (CMB) and galaxy surveys. In current\ncosmological theory, the notions of homogeneity and\nisotropy have been superseded by the notions of statistical homogeneity and isotropy. The density of matter\nmay differ from one point in the Universe to another,\nbut the distribution of matter is described as a realization of a random field with a variance that is everywhere\nthe same and the same in every direction. This is generally the prediction of structure-formation models, and in\nparticular, of inflationary models.\nStill, statistical isotropy and homogeneity are assumptions that can be tested quantitatively, and the precision\nwith which they can be tested is improving rapidly with\nthe still-accumulating wealth of cosmological data. Preliminary (and controversial) indications for a preferred\ndirection in the CMB [1, 2, 3, 4] have recently motivated\nthe study of departures from statistical isotropy. Subsequent theoretical work has shown that although statistical isotropy is a generic prediction of inflation, inflation\nmodels can in fact be constructed to violate statistical\nisotropy [5, 6, 7, 8, 9, 10, 11, 12, 13, 14]. Dark-energy\nmodels might also accommodate departures from statistical isotropy [15, 16]. These models provide useful straw\nmen against which the success of the standard inflationary predictions of statistical isotropy can be quantified.\nThe growing interest in such models motivates us to\nstudy generalized tests for statistical isotropy. In a statistically isotropic Universe, the primordial distribution of\nmatter is a realization of a random field in which Fourier\nmodes of the density field have variances, a power spectrum P (k), that depend only on the magnitude k of the\nwavevector k. If we drop the assumption of statistical\nisotropy, the power spectrum will depend on the direction k̂ as well. If δ(k) is the Fourier amplitude of the\n\nfractional density perturbation, then the power spectrum\nis defined by\nhδ(k)δ ∗ (k′ )i = δD (k − k′ )P (k),\n\n(1)\n\nwhere the angle brackets denote an average over all realizations of the random field, and δD is a Dirac delta\nfunction; note that we are still preserving the assumption that different Fourier modes are uncorrelated. The\nmost general power spectrum can then be written,\n\"\n#\nX\nP (k) = A(k) 1 +\ngLM (k)YLM (k̂) ,\n(2)\nLM\n\nwhere YLM (k̂) (with L ≥ 2) are spherical harmonics, and\ngLM (k) quantify the departure from statistical isotropy\nas a function of wavenumber k. Since the density field is\nreal, Fourier modes for k are related to those of −k, in\nsuch a way that the multipole moment L must be even. In\nthe limit gLM (k) → 0, we recover the usual statistically\nisotropic theory with power spectrum A(k). The implementation, Eq. (2), of power anisotropy is motivated in\npart by the inflationary model of Ref. [10], which predicts\ng2M (k) 6= 0.\nHere we consider several CMB tests for statistical\nisotropy. The first, which we refer to as \"power multipole moments,\" is a simple and intuitive estimator that\ninvolves measurement of the multipole moments of the\nsquare of the temperature/polarization fields.1 As an\nexample, we apply this statistic to an inflationary model\n[10] that predicts a quadrupole in the matter power spectrum.\n\n1\n\nThere has already been some evidence for a dipole in the CMB\npower [2, 4] that is analogous to the higher multipole moments that we are considering here, but which cannot be due\nto anisotropy in the primordial power spectrum because it has\nL = 1. There have also been searches [3] for anisotropy along the\nlines considered here, and Ref. [17, 18] discusses similar statistics.\n\n\f2\nAlthough power multipole moments provide a nice\nmodel-independent test for departures from statistical\nisotropy, more sensitive probes can be developed if the\nparticular form of the departure is specified. To illustrate, we thus construct the minimum-variance estimators for the anisotropy coefficients gLM (k) under the\nassumption that they are constants. The naive power\nmultipole moments, although intuitively simple, co-add\na number of modes with equal weight. The minimumvariance estimator co-adds modes with weights that depend on their signal to noise, so that (as the name suggests) the variance of the estimator is minimized. We\nshow that this statistic provides a far stronger probe for\nthe gLM s.\nThe plan of our paper is as follows: Section II reviews\nsome CMB basics. Section III calculates the correlations\nof CMB spherical-harmonic coefficients if there are departures from statistical isotropy. As we discuss there,\nthe power spectrum Cl , which describes the two-point\nCMB statistics if there is statistical isotropy, is generalized to a set of moments DllLM\nif statistical isotropy is\n′\nbroken. In Section IV, we introduce and calculate the\npower multipole moments and calculate the standard errors with which these moments can be recovered. We\napply this statistic to a quadrupole in the matter power\nspectrum, calculating the sensitivities of several CMB\nexperiments to such a quadrupole. Section V discusses\nminimum-variance estimators for the quantities DllLM\n′\nthat parametrize the departures gLM (k) from statistical\nisotropy. We then construct from these the minimumvariance estimators for the quadrupole moments of the\nprimordial power spectrum, calculate their variance, and\nevaluate their sensitivity to departures from statistical\nisotropy. We make some concluding remarks in Section VI. Throughout the main body of the paper, we\ndiscuss statistics for only a temperature map, in order\nto make the presentation clear. An Appendix generalizes to include the full temperature-polarization information. Our numerical results are for a full temperaturepolarization map, as well as for temperature or polarization alone.\n\nII.\n\ndent for different l and m: halm a∗l′ m′ i = Cl δll′ δmm′ .2 The\nset of Cl s is the CMB temperature power spectrum. We\nwill see that when statistical isotropy is violated, there\nare correlations induced between alm s for different l and\nm [10]. If there is statistical isotropy, the two-point autocorrelation function is\nC(n̂, n̂′ ) = hT (n̂)T (n̂′ )i\nX 2l + 1\nCl Pl (n̂ * n̂′ );\n= T02\n4π\n\ni.e., the correlation function depends only on the separation between the two points. If statistical isotropy is\nviolated, this is not necessarily true.\n\nIII.\n\nOFF-DIAGONAL CORRELATIONS FOR\nANISOTROPIC POWER\n\nConsider a primordial matter power spectrum P (k)\ngiven by Eq. (2). We expand T (n̂) in k space in the\nform,\nZ\nX\nT\n(n̂) = d3 k\n(−i)l (2l + 1)Pl (k̂ * n̂)δ(k)Θl (k), (5)\nT0\nl\n\nwhere Θl (k) is the contribution to the lth temperature\nmoment from wavevector k. With these conventions,\nΘl (k) is real. With our expression, Eq. (2), we can write\nthe covariance matrix as\nX\nLM\nLM\nhalm a∗l′ m′ i = δll′ δmm′ Cl +\nξlml\n(6)\n′ m′ Dll′ .\nLM\n\nHere, the set of Cl s, given by\nZ ∞\n2\nCl = (4π)\ndk k 2 A(k)[Θl (k)]2 ,\n\n(7)\n\n0\n\nis the usual CMB power spectrum for the case of statistical isotropy. Departures from statistical isotropy introduce the second term, where\nZ ∞\nLM\n2\nl−l′\nDll′ = (4π) (−i)\ndk k 2 A(k)gLM (k)Θl (k)Θl′ (k),\n0\n\nPRELIMINARIES\n\n(4)\n\nl\n\n(8)\n\nand\nA CMB experiment provides the temperature T (n̂) as\na function of position n̂ on the sky. The map T (n̂) can\nbe expanded in terms of spherical harmonics Ylm (n̂),\n\nalm =\n\n1\nT0\n\nZ\n\nLM\nξlml\n′ m′ =\n\nZ\n\n∗\ndk̂ Ylm\n(k̂)Yl′ m′ (k̂)YLM (k̂)\n′\n\n= (−1)m GL\nll′\n∗\ndn̂ Ylm\n(n̂)T (n̂).\n\n(3)\n\nThe alm s are Gaussian random variables, and if there\nis statistical isotropy, then they are statistically indepen-\n\n2\n\n\u00011/2\n\nLM\nClml\n′ ,−m′ ,\n\n(9)\n\nStrictly speaking, it is not the alm s that are statistically independent, but rather their real and imaginary parts.\n\n\f3\nLM\nwhere Clml\n′ m′ are Clebsch-Gordan coefficients, and\n\nGL\nll′ ≡\n\n\u00012\n(2l + 1)(2l′ + 1)\nL0\n.\nCl0l\n′0\n4π(2L + 1)\n\nB.\n\n(10)\n\nThroughout, we use upper-case indices LM for power\nanisotropies, and lower-case indices lm for temperature/polarization anisotropies. For L even, ξlml′ m′ are\nnonvanishing only for l−l′ even, and so the DllLM\nare real.\n′\nEqs. (8) and (9) agree with similar results in Ref. [18],\nand they recover the results of Ref. [10] for L = 2.\nIf primordial perturbations are statistically isotropic\nand Gaussian, then the statistics of the CMB temperature map are specified fully by the power spectrum, the\nset of Cl s. If primordial perturbations have a departure\nfrom statistical isotropy that can be written in terms of\nspherical harmonics YLM (k̂), then the two-point statistics are described additionally by the set of multipole\nmoments DllLM\n′ . These quantities are thus the generalization of the Cl s if there is statistical anisotropy.\nIV.\n\nPOWER MULTIPOLE MOMENTS\nA.\n\nTheoretical predictions\n\nIt is natural to expect that a spherical-harmonic pattern of anisotropy in the matter power spectrum manifests itself in a similar pattern in the CMB power. It is\nthus natural to consider a set of \"power multipole moments,\"\nZ\n1\n∗\nbLM = 2 dn̂ YLM\n(11)\n(n̂) T 2 (n̂),\nT0\nwhere T 2 (n̂) = C(n̂, n̂) is the expectation value of the\nsquare of the temperature at position n̂ in the sky; it\nis the autocorrelation function at zero lag. With this\nstatistic, we simply look for anisotropies in the power.\nThese statistics have several advantages. In addition\nto having a form familiar from similar statistics [e.g.,\nEq. (3)] for temperature fluctuations, they have simple\nanalytic expressions in terms of P (k). There are also\n(as we show below), relatively simple expressions for the\ncosmic-variance– and instrumental-noise–induced errors\nin the measurement of these statistics.\nThe variance T 2 (n̂) as a function of position n̂ is\ngiven by\nX\nT 2 (n̂)\n=\nhalm a∗l′ m′ i Ylm (n̂)Yl∗′ m′ (n̂).\n2\nT0\n′\n′\n\n(12)\n\nlml m\n\nWe put this into Eq. (11) and use\nX\nLM\nL′ M ′\nClml,−m\n′ Clml′ ,−m′ = δLL′ δMM ′ ,\n\n(13)\n\nmm′\n\nto obtain (for L ≥ 2)\nbLM =\n\nX\nll′\n\nLM\nGL\nll′ Dll′ .\n\n(14)\n\nStatistical noise\n\nWe now calculate the standard error, due to cosmic\nvariance and instrumental noise, with which the power\nmultipole moments can be measured. To do so, we consider a full-sky map T map (n̂) of the temperature in Npix\nequal-area pixels. The temperature in each pixel receives contributions from signal and from noise. Thus,\nin pixel i, T map = T (n̂i ) + Tin , where T (n̂i ) is the temperature measured in pixel i, which will be the signal\ntemperature smoothed by a Gaussian beam of full-width\nhalf maximum (fwhm) θfwhm , plus a noise Tin. We assume that the noise is isotropic and that the noises in\ndifferent pixels are uncorrelated with variance σT2 : i.e.,\nTin Tjn = σT2 δij . The power spectrum for the map is\nthus Clmap = |Wl |2 Cl + Cln , where Cln = (4π/Npix )σT2 is\nthe noise power spectrum, and Wl is a window function\nthat takes into account the effects of beam smearing; for\na Gaussian beam √\nof fwhm θfwhm , it is Wl = exp(−l2 σb2 /2)\nwith σb = θfwhm / 8 ln 2 = 0.00742(θfwhm/1◦ ).\nSince the instrumental noise is isotropic by assumption, we get an unbiased estimator for bLM (for L ≥ 2)\nfrom\nZ\n∗\nbbmap = 1\ndn̂ YLM\n(n̂) [T map(n̂)]2 .\n(15)\nLM\nT02\nCosmic variance and instrumental noise induce a variance\nin the bLM s, which we define as\nE\nD\n(16)\nΞLM ≡ bbLM bbLM ,\n\nwhere we have assumed the null hypothesis, gLM = 0.\nFor this null hypothesis of a statistically isotropic Gaussian random map,\nZ\n2\nLM\nΞ\n= 4 dn̂ dn̂′ C map (n̂, n̂′ )C map (n̂, n̂′ )\nT0\n∗\n×YLM (n̂)YLM\n(n̂′ )\nX\nmap map\n= 2\nGL\nCl′\nll′ Cl\nll′\n\n(17)\n\nwhere C map (n̂1 , n̂2 ) is the two-point correlation function\nfor the map, obtained from the expression, Eq. (4), for\nthe correlation\nby replacing Cl by Clmap , and we\nP function\nLM\nhave used mm′ (Clml′ m′ )2 = 1. Note that the absence of\nany M dependence of ΞLM\nAA′ is as we expected. Moreover,\nit follows from Eq. (13) that Dthe estimators\nE for the different blm s are uncorrelated: bbLM bbL′ M ′ ∝ δLL′ δMM ′ .\nGiven a power spectrum of the form Eq. (2), specified\nby the functions gLM (k), predictions for the bmap\nLM can be\nevaluated with Eq. (14) replacing DllLM\nin that equation\n′\nLM\nby DllLM,map\n= DllLM\nwith\n′ Wl Wl′ and evaluating the Dll′\n′\nmap\nEq. (8). The bLM can then be measured using Eq. (15)\nwith variances given by Eq. (17).\n\n\f4\nC.\n\nA worked example\n\nAs a simple example, suppose the gLM (k) are constants, independent of k. We can then take gLM outside\nthe integral in Eq. (8). An estimator for gLM is then\nmap\nLM\ngbLM = bbmap\nlm /(blm /gLM ). Defining Fll′ ≡ Dll′ /gLM\nfor this case, the variance with which each gLM can be\nmeasured is then\nP\nmap map\nL\nCl′\n2\n′ G ′C\n(18)\nσg2LM = \u0002P ll ll l\n\u00032 .\nL\nll′ Gll′ Fll′ Wl Wl′\n\nMoreover, the measured gLM are statistically independent as a consequence of the statistical independence of\nthe bbLM .\nTo illustrate, we apply this result to an inflationary\nmodel [10] that has a power spectrum with a quadrupole\ndependence on the angle.3 We use the Θl (k) calculated\nby CMBFAST [19] to obtain Fll′ . We assume only scalar\nperturbations and the current best-fit cosmological parameters.\nThe numerical results are given in Table 1, but before\nreviewing them, we provide some very rough estimates\nto get some feel for the numbers. To do so, ignore instrumental noise and suppose that Wl = 1 for all l ≤ lmax .\nFor L = 2, Fll′ 6= 0 only for l′ = l or l′ = l ± 2. Moreover,\nfor these combinations of ll′ and for l ≫ 2, we approximate the numerical results (which we use for the numerical results in the Table) for Fll′ as Fl,l+2 ≃ −0.5 Cl .\n20 2\n20\nAlso, (Cl0l0\n) ∼ (5/8)l−1 for l ≫ 1, and (Cl0(l±2)0\n)2 is\n1.5 times as large.\nP can then be approximated\nP Eq. (18)\nσg22M ∼ 256π[ l l(Cl )2 ]/[ l lCl ]2 . If the power spectrum has the form Cl ∝ l−2 (a very rough approximation\nto the temperature power spectrum for l . 1000), then\n−2\n[ln(lmax /lmin)]−2 . For example, using\nσg22M ∼ 128πlmin\nlmin = 2 and lmax = 1000 yields σg2M ∼ 1.23.\nOf course, there is nothing about the derivation of\nEq. (18) that is specific to a temperature map, and this\nresult can be applied equally well, e.g., to the E-mode\npolarization. If we approximate the polarization power\n−2\n,\nspectrum by Cl ∼ const, then we find σg22M ≃ 512πlmax\n−2\nor σg2M ∼ 5 × 10 for lmax ≃ 1000.\nWe now return to the numerical results for σg2M listed\nin Table 1 for the Wilkinson Anisotropy Probe (WMAP)\n[20], which has now collected three years of data, the\nPlanck satellite [21], to be launched in 2008, and EPIC\n[22], a satellite mission currently under study. The parameters assumed for each model are listed, as well as results obtained using Eq. (14) assuming only TT is used or\nEE only. The Appendix generalizes Eq. (14) to the case\nwhere the full temperature-polarization is used (including the TE correlation), and we present numerical results\n\n3\n\np\nNote that our g20 is (2/3) 4π/5g∗ , where g∗ is the coefficient\nin Ref. [10] of (k̂ * ẑ)2 if the preferred direction is taken to be ẑ.\n\nfor this case in the Table as well. We also list results, labeled \"CVO\" (cosmic variance only), for a hypothetical\nexperiment that has perfect angular resolution and no\ninstrumental noise. These numbers are for hypothetical\nfull-sky experiments, but a realistic experiment will likely\nonly be able to use ∼ 65% of the sky for cosmology. If so,\nthen each estimate for σg2M must be increased by a factor (0.65)−1/2 , about 25%. We also note that the theory\ncannot specify the direction ê of the quadrupole, and so\na search for a quadrupole would require evaluation of all\nfive g2M s. A \"3σ\" detection would thus require that the\nsum of the squares of the g2M s need to exceed (3σg2M )2 ,\nwhich is independent of M .\nThe order of magnitude that we would expect for σg2M\n−1/2\n2\nis the number of resoluis ∼ Npix , where Npix ∼ lmax\ntion elements on the sky, comparable to the precision\nwith which one can measure the variance (the monopole)\nof the temperature-fluctuation amplitude. The numerical results listed in Table 1 for the error to g2M obtained\nfrom the power quadrupole moment bb2M are not quite as\n−1/2\ngood as this Npix expectation. The origin of this discrepancy can be traced to two sources. First of all, the\ntwo-dimensional CMB signal is degraded from the threedimensional power spectrum; a Fourier mode in the ẑ\ndirection gives rise to some temperature fluctuation near\nthe north pole, and not just at the equator. This is manifest in the large coefficients (e.g., the factor of 512π) in\nour analytic estimates.\nHowever, another reason that the estimator bb2M does\nnot provide a sensitive probe of a quadrupole departure\nfrom statistical isotropy is that it is not an optimal estimator for g2M . This estimator sums the \"signals\" DllLM\n′ ,\nbut it does not weight these signals properly. This can\nbe seen by noting that for a Cl ∝ l−2 power spectrum,\nfor example, the error obtained from Eq. (18) can be reduced by applying a low-pass filter: i.e., by increasing the\nminimum values of ll′ in the sums. (A simple calculation\nshows that with the properly chosen lower-l limit, σg2M\ncan be reduced by a factor of 30.) If the precision of the\nresult is improved by removing data, then something is\nsub-optimal.\n\nV.\n\nTHE MINIMUM-VARIANCE ESTIMATOR\nA.\n\nThe estimator and its variance\n\nThe bbLM estimator is a simple and intuitive quantity\nthat can be measured to test for statistical isotropy in\na model-independent way. However, if one has a specific theory, defined by the functions gLM (k) or some\nquantities that parametrize the gLM (k), then there will\nbe estimators that can be constructed to measure optimally those parameters. For example, if the gLM s are\nall constants, then one can measure them better than\nthe numerical results for the power multipole moments\nbLM would suggest. Below, we will derive the minimum-\n\n\f5\nExperiment\nσT (μK) σP (μK) θfwhm σgpmm\n(TT) σgpmm\n(EE) σgpmm\n(total) σgmv\n(TT) σgmv\n(EE) σgmv\n(total)\n2M\n2M\n2M\n2M\n2M\n2M\n′\nWMAP\n30.0\n42.6\n21\n1.3\n11\n1.2\n0.024\n2.4\n0.024\nPlanck\n13.1\n26.8\n5′\n1.6\n0.16\n0.16\n0.0052\n0.033\n0.0050\nEPIC\n0.021\n0.068\n52′\n1.2\n0.55\n0.42\n0.016\n0.019\n0.011\nCosmic variance\n0\n0\n0\n1.8\n0.014\n0.014\nTABLE I: The standard error σg2M to the amplitude of a quadrupole anisotropy in the matter power spectrum for different\nexperiments. The instrumental temperature and polarization noises and beam width are listed for each experiment. We show\nresults for the power multipole moments (pmm)for TT only, EE only, and the full result. We also show in the last three columns\nσgmv\nfrom the minimum-variance estimator for each experiment, for TT only, EE only, and the full result.\n2M\n\nvariance estimator for gLM .\nBefore moving on, it is instructive and will be useful\nbelow to re-derive the variance to bbmap\nLM . We return to\nEq. (14) and note that bmap\nLM can be written as a sum\nover DllLM,map\n≡ DllLM\n′ Wl Wl′ . We then return to Eq. (6)\n′\nto derive the minimum-variance estimator for DllLM,map\n.\n′\n′\nGiven a map amap\n,\neach\nmm\npair\nprovides\nan\nestimator\nlm\nfor DllLM,map\n, through\n′\nmap,∗\namap\nlm al′ m′ − Cl δll′ δmm′\nb LM,map\nD\n=\n,\n′\n′\nll ,mm\nLM\nξlml\n′ m′\n\nwith variance\n\u001c\u0010\n\u00112 \u001d (1 + δ ′ δ ′ )C map C map\nll mm\nl\nl′\nb LM,map\n.\n=\nD\n\u00012\nll′ ,mm′\nLM\nξlml′ m′\n\n(19)\n\n(20)\n\nThe estimators for different mm′ pairs are uncorrelated\n(if we use the real and imaginary parts of the alm s), so the\nestimators can be summed over all mm′ pairs, inversely\nweighted by the variance, to obtain a minimum-variance\nestimator. If l = l′ , we sum only over m′ ≥ m to avoid\ndouble-counting pairs. However, the factor (1 + δll′ δmm′ )\nthen weights the m = m′ modes twice as much, if l = l′ ,\nand thus allows us to re-write the sum over all m and\nm′ . The result for the estimator can thus be written, for\nboth l = l′ and l 6= l′ , as\nP\nmap map,∗ LM\nmm′ alm al′ m′ ξlml′ m′\nb LM,map\nD\n=\n.\n(21)\nll′\nGL\nll′\n\nWe recognize these to be the bipolar-spherical-harmonic\ncoefficients of Refs. [17], with a slightly different weight.\nThe variance of this estimator is then\n\u001c\u0010\n\u00112 \u001d (1 + δ ′ )C map C map\nll\nLM,map\nl\nl′\nb\n=\nDll′\n.\n(22)\nGL\nll′\nThe variance, Eq. (18), with which each blm can be measured simply follows by summing the variances of each\nterm in Eq. (14).\nNow, to construct the minimum-variance estimator,\nwe simply note that the statistically-independent quantities predicted by the theory are the DllLM\n′ 's, the generalizations of the Cl 's for a theory without statistical isotropy. We have constructed above estimators for\n\nthese quantities, and we have their variances. For a\ntheory with constant gLM 's, each DllLM\nprovides an es′\nLM\nb\ntimator through gbLM,ll′ ≡ Dll′ /Fll′ . We then sum\nthese, inversely weighted by their variance to obtain the\nminimum-variance estimator,\n\ngbLM =\n\n\u001c\u0010\n\u00112 \u001d−1\nLM,map\nLM,map\nb\nb\nDll′\nl′ ≥l Fll′ Wl Wl′ Dll′\n,\n\u001c\u0010\n\u00112 \u001d−1\nP\n2\nLM,map\nb\nDll′\nl′ ≥l (Fll′ Wl Wl′ )\n\nP\n\n(23)\nobtained from the entire map. The variance σg2LM of\nthis estimator is then obtained by summing the inverse\nvariances of all the estimators. Again, the sums are over\nl′ ≥ l, but the factor (1 + δll′ ) in Eq. (22) allows us to\nwrite the sum over all ll′ ,\n1\nσg2LM\nB.\n\n=\n\nX\n\nGL\nll′\n\nll′\n\n(Fll′ Wl Wl′ )2\n.\n2Clmap Clmap\n′\n\n(24)\n\nIllustration: The Power Quadrupole\n\nTo illustrate, we now evaluate this expression for L =\n2. Again, in this case, the only ll′ combinations that\ncontribute are l′ = l and l′ = l ± 2. We assume l, l′ ≫ 1,\napproximate Fl,l+2 ≃ −0.5 Cl , as above, and evaluate\nLM\nCl0l\n′ 0 as in Section IV C. We can then write,\n1\nσg22M\n\n≃ 0.035\n\nX lC 2 (Wl )4\nl\n\nl\n\n(Clmap )2\n\n,\n\n(25)\n\n2\nwhich we can further approximate as 0.017 lmax\n, where\nlmax is the multipole moment at which Cln ≃ Cl (Wl )2 .\nThe end result is then σg2M ≃ 7.6/lmax, quite close to\nwhat we would have expected by simply counting the\n2\nnumber Npix ≃ lmax\nof usable pixels. For the WMAP and\nPlanck temperature maps, lmax is roughly 650 and 2000,\nrespectively, implying σg2M ∼ 1.2 × 10−2 and 3.8 × 10−3 ,\nrespectively, implying very significant improvements in\nthe sensitivity over the power multipole moments.\nTable 1 lists the exact numerical results, obtained\nby evaluating Eq. (24) exactly, for both TT only and\nEE only. Again, the Appendix generalizes Eq. (24) for\nthe full temperature-polarization map, including the TE\n\n\f6\ncross-correlation, and numerical results for this case are\nalso included. The Table shows that by weighting the\nmodes correctly, we get an improvement of a factor of ∼ 2\nfor WMAP and Planck EE and more than an order-ofmagnitude improvement for WMAP and Planck TT; this\nis in accord with our arguments that the signal-to-noise in\nthe TT power multipole moments was particularly poorly\nchosen. Although EPIC will have vastly improved instrumental sensitivity, with its modest angular resolution, it\nis not particularly well suited to search for departures\nfrom statistical isotropy. Again, the minimum-variance\nnumbers in the Table must be increased by about 25%\nto account for partial-sky coverage. And again, since the\npreferred direction is not known a priori, the sum of the\nsquares of the g2M s must exceed (3σg2M )2 to claim a \"3σ\"\ndetection of a departure of statistical isotropy.\n\nVI.\n\nCONCLUDING REMARKS\n\nWe have considered CMB tests for the statistical\nisotropy of the primordial power spectrum. The power\nspectrum of Eq. (2) is the most general power spectrum\nif the assumption of statistical isotropy is dropped. In\nthe more general case, the CMB power spectrum Cl is\ngeneralized to a set of moments DllLM\n′ , which are closely\nanalogous to the bipolar-spherical-harmonic coefficients\nof Refs. [17]. The power multipole moments bLM provide simple and intuitive statistics that can be used to\nsearch in a model-independent way for departures from\nstatistical isotropy. If, however, a particular model is\nintroduced by specifying a particular parametrization of\nthe functions gLM (k), then minimum-variance statistics\ncan be introduced to improve the precision with which\nthese parameters can be constrained. For example, we\nconstructed explicitly the minimum-variance estimators\nfor the coefficients gLM for the case in which they are\nk-independent. We applied these results to a model in\nwhich there is a quadrupole in the primordial power\nspectrum, and the results are shown in Table 1. We\nsee that the best probe of a primordial quadrupole moment will come from Planck TT, for which we anticipate σg2M = 0.0052. Multiplying this by 1.25 to account\nfor a 65% sky coverage, and then by the factor of 3 required for a \"3σ\" detection, we find that the smallest\nquadrupole amplitude that will be detectable by Planck\nwill be around 2.0%.\nTo reduce clutter in the equations and to keep the main\nline of reasoning clear, we have derived equations in the\nmain body of the paper for the case where either the\ntemperature or the polarization is used, but not both.\nThe Appendix generalizes the analysis to allow the use of\nthe full temperature-polarization information, including\nthe TE cross-correlation.\nWhat about other probes? Consider, for example, the\nSloan Digital Sky Survey [23]. The volume and galaxy\ndensity of the main galaxy survey allows measurement,\nroughly speaking, of the amplitudes of Nmodes ∼ 105 in-\n\ndependent Fourier modes of the density field, in the linear regime, and these measurements are cosmic-variance\nlimited. Measurement of the quadrupole of the power\nspectrum can then simply be done by comparing the amplitudes of Fourier modes in different directions. The\nstandard error\nmoments will thus\npto the power multipole\n2/Nmodes ∼ 10−2 , comparable in order\nbe σgLM ∼\nof magnitude to what can be achieved with the CMB.\nOf course, a realistic search will be hampered by the irregular volume of the survey, redshift-space distortions,\nand anisotropies (line-of-sight–versus–angular) inherent\nto the measurement technique. But then again, there\nwill be degradations (foregrounds, sky cuts, etc.) to the\nidealized CMB measurements we have considered. Of\ncourse, if gLM (k) varies with k, then the constraints provided by the CMB and galaxy surveys will be complementary, to the extent that the wavenumbers k probed\nby the CMB and galaxy surveys differ. Looking forward,\nthere is ultimately the possibility of accessing with 21-cm\nfluctuations approximately 1015 modes of the primordial\ndensity field [24], allowing values as small as gLM ∼ 10−7\nto be probed, but this is in the very far future.\n\nAcknowledgments\n\nWe thank D. Babich, K. Gorski, M. Wise, and\nC. Pahud for useful comments on an earlier draft.\nMK acknowledges the hospitality of the Aspen Center\nfor Physics, where part of this work was completed.\nAP acknowledges the support of the NSF. This work\nwas supported by DOE DE-FG03-92-ER40701, NASA\nNNG05GF69G, the Gordon and Betty Moore Foundation, and a NASA Einstein Probe mission study grant,\n\"The Experimental Probe of Inflationary Cosmology.\"\n\nAPPENDIX A: GENERALIZATION TO A\nTEMPERATURE-POLARIZATION MAP\n\nFor most experiments, the sensitivity to departures\nfrom statistical isotropy will come primarily from either\nthe temperature or the polarization. Considering both\nin tandem will provide some improvement in the result,\nbut given the temperature-polarization cross-correlation,\nthis improvement will be weaker than what would be obtained by simply adding the two results in quadrature.\nStill, to be complete, we include expressions for theory\nand estimators for a combined temperature-polarization\nmap. Assuming only primordial density perturbations\ncontribute to the temperature-polarization map, a map of\nthe sky will now provide the E-mode polarization E(n̂),\nconstructed in the usual fashion [25, 26] from the measured Stokes parameters Q(n̂) and U (n̂), in addition to\nthe temperature T (n̂). The map can be written in terms\nof spherical-harmonic coefficients aX\nlm , for X = {T, E},\n\n\f7\nand Eq. (6) is generalized to\nD\nE\nX\n′\nX′ ,∗\nLM,XX′\nLM\naX\na\n= δll′ δmm′ ClXX +\nξlml\n.\n′ m′ D ′\n′\n′\nlm l m\nll\nLM\n\n(A1)\n′\n′\nThe ClXX s and DllLM,XX\ns are obtained as in Eqs. (7)\n′\nand (8) by replacing the Θl (k)Θl′ (k) factors in the inteX′\ngrands of those equations by ΘX\nl (k)Θl (k), where these\nare obtained from Eq. (5) by replacing T (n̂) by X(n̂).\n′\n′\nNote that for TE and l 6= l′ , DllLM,XX\n6= DlLM,XX\n. This\n′\n′l\nwill affect the equations below for the minimum-variance\nestimator.\nWe now′ have a set of three power multipole mo2\nments bXX\nLM , obtained from Eq. (11) by replacing T\n′\nby hXX\ni, which\nE is itself obtained from Eq. (12) by usD\ning\n\n′\n\nX ,∗\naX\nlm al′ m′\n\nfor the expectation value therein. The\n′\n\nexpression for the bXX\nLM is the same as Eq. (14) using\n′\nDllLM,XX\nthere.\n′\n′\n,map\nThe power-multipole-moment estimators bbXX\nLM\nmap\n2\nare as in Eq. (15) with [T\n(n̂)] replaced by\n′\n[X map (n̂)X map (n̂)]. Things get a bit trickier, though,\nwhen we calculate the variances, as the estimators for\ndifferent XX′ will now be correlated, although still uncorrelated for different LM . The variance in Eq. (16) is\n′\nnow promoted to a 3 × 3 matrix ΞLM\nAA′ , for {A, A } =\n{TT, EE, TE}.\nFor {A A′ } = XX′ = {TT, EE},\nmap map\nΞLM\nreplaced by\nAA′ is given by Eq. (17) with Cl1 Cl2\n′\n\nClA2 ,map . For the diagonal TE-TE term,\nClA,map\n1\nΞLM\nTE,TE =\n\nX\n\nTT,map EE,map\nGL\nCl′\n+ ClTE,map ClTE,map\n],\n′\nll′ [Cl\n\nll′\n\n(A3)\n\nll′\n\nEq. (18) for the standard error with which a constant\ngLM can be recovered with the power multipole moments\nis then replaced by [25, 26, 27]\n\nσg2LM\n\nance matrix. and for l′ > l, they are promoted to a 4 × 4\ncovariance matrix. In both cases, the covariance matrix\ncan be written as\n′\n\nll\nCAA\n′ ≡\n\nD\nE\n′\nGL\n,map\nll′\nb LM,A,map\nb LM,A\n.\nD\nD\n′\n′\nll\nll\n(1 + δll′ )\n\n′\n∗\nX ∂bA\n∂bA\nLM −1\nLM\nLM\n[(Ξ ) ]AA′\n.\n=\n∂gLM\n∂gLM\n′\n\n(A4)\n\nAA\n\n(A5)\n\nFor any ll′ pair, the diagonal entries, for A = {TT, EE},\nll′\nare CAA\n= ClA,map ClA,map\n, and the TT-EE off-diagonal\n′\nTE,map TE,map\nll′\nentry is CTT,EE = Cl\nCl′\n. For l = l′ , the diagonal TE-TE entry is\n\u0014\n\u0010\n\u00112 \u0015\nll′\nCTE,TE\n= ClTT,map ClEE,map + ClTE,map\n/2. (A6)\n′\n\n(A2)\n\nand for the off-diagonal XX-XX′ terms,\nX\nXX,map XX′ ,map\nΞLM\nGL\nCl′\n.\nXX,XX′ = 2\nll′ Cl\n\n1\n\nA. The main subtlety is that since DllLM,TE\n6= DlLM,TE\n,\n′\n′l\nwe must be careful to keep track of all TE modes for\nl 6= l′ . This will require that we split the sum in the\ngeneralization of Eq. (24) into two sums: the first over\nl = l′ , and the second over l′ > l. (Actually, the sum\ncan in fact be written over all ll′ , but at the cost of much\nuglier algebraic expressions.)\nFor l′ = l, there are now three (TT, EE, and TE)\nestimators to replace that in Eq. (19), and for l′ > l,\nthere are now four (TT, EE, TE, and ET) estimators\nto replace that in Eq. (19). For all ll′ , the estimators\nmap\nare as in Eq. (19), replacing each amap\nby the\nlm and Cl\n′\nXX ,map\nappropriate aX,map\nand\nC\n,\nrespectively.\nThe\nestilm\nl\nmator for each ll′ , obtained after summing over all mm′ ,\nis the same as in\nEq. (21). For l = l′ , the variances\n\u001c\n\u0010\n\u00112 \u001d\nb LM,A,map\nare now promoted to a 3 × 3 covariD\nll′\n\n′\n\nll\nll\nFor l′ > l, we have CTE,TE\n= ClTT ClEE\n′ , CET,ET =\n′\nll\nClTT\nClEE , and CTE,ET\n= ClTE ClTE\n. For any ll′ , we have\n′\n′\nll′\nTT TE\nll′\nTE\nCTT,TE = Cl Cl′ and CEE,TE = ClEE\n. For l′ > l,\n′ Cl\n′\n′\nll\nll\nwe also have CTT,ET\n= ClTT\nClTE and CEE,ET\n= ClEE ClTE\n.\n′\n′\nThe generalization of Eq. (24) is then\n\n1\nσg2LM\n\nh\n\u0001−1 i\n1 X L X A A′\nGll\nCl Cl (Wl )4 C ll\n2\nAA′\nl\nAA′\n\u0014\n\u0010 ′ \u0011−1 \u0015\nX\nX\nA A′\n2\n′\n+\nC ll\nGL\nF\nF\n)\n(W\nW\n′\n′\n′\nl l\nll\nll ll\n\n=\n\nl′ >l\n\nAA′\n\n,\nAA′\n\n(A7)\n\nThis is the equation used to obtain the \"total\" results\nlisted in Table 1 for the power multipole moment.\nThe minimum-variance estimator for gLM and its\nvariance are similarly generalized.\nThe estimators\nb LM,A,map\nD\nare\nstill\nuncorrelated\nfor\ndifferent\nll′ pairs and\n′\nll\ndifferent LM , but they are now correlated for different\n\nwhere the matrix inversion is in the 3 × 3 AA′ space in\nthe first sum and in the 4 × 4 AA′ space in the second\nsum. We use Eq. (A7) to evaluate the standard errors for\nthe \"total\" minimum-variance estimators listed in Table\n1.\n\n[1] A. de Oliveira-Costa, M. Tegmark, M. Zaldarriaga\nand A. Hamilton, Phys. Rev. D 69, 063516 (2004)\n\n[arXiv:astro-ph/0307282]; C. J. Copi, D. Huterer and\nG. D. Starkman, Phys. Rev. D 70, 043515 (2004)\n\n\f8\n\n[2]\n\n[3]\n[4]\n\n[5]\n[6]\n\n[arXiv:astro-ph/0310511]; D. J. Schwarz, G. D. Starkman, D. Huterer and C. J. Copi, Phys. Rev. Lett.\n93, 221301 (2004) [arXiv:astro-ph/0403353]; S. Prunet,\nJ. P. Uzan, F. Bernardeau and T. Brunier, Phys. Rev. D\n71, 083508 (2005) [arXiv:astro-ph/0406364]; H. K. Eriksen, A. J. Banday, K. M. Gorski and P. B. Lilje, Astrophys. J. 622, 58 (2005) [arXiv:astro-ph/0407271];\nK. Land and J. Magueijo, Phys. Rev. Lett. 95,\n071301 (2005) [arXiv:astro-ph/0502237]; T. R. Jaffe,\nA. J. Banday, H. K. Eriksen, K. M. Gorski\nand F. K. Hansen, Astrophys. J. 629, L1 (2005)\n[arXiv:astro-ph/0503213]; C. J. Copi, D. Huterer,\nD. J. Schwarz and G. D. Starkman, Mon. Not. Roy.\nAstron. Soc. 367, 79 (2006) [arXiv:astro-ph/0508047];\nK. Land and J. Magueijo, Mon. Not. Roy. Astron. Soc. 367, 1714 (2006) [arXiv:astro-ph/0509752];\nA. Bernui, T. Villela, C. A. Wuensche, R. Leonardi\nand I. Ferreira, Astron. Astrophys. 454, 409 (2006)\n[arXiv:astro-ph/0601593]; L. R. Abramo, A. Bernui,\nI. S. Ferreira, T. Villela and C. A. Wuensche, Phys.\nRev. D 74, 063506 (2006) [arXiv:astro-ph/0604346];\nJ. Magueijo and R. D. Sorkin, Mon. Not. Roy. Astron.\nSoc. Lett. 377, L39 (2007) [arXiv:astro-ph/0604410];\nC. G. Park, C. Park and J. R. I. Gott, Astrophys. J. 660,\n959 (2007) [arXiv:astro-ph/0608129]; D. Huterer, New\nAstron. Rev. 50, 868 (2006) [arXiv:astro-ph/0608318];\nP. Vielva, Y. Wiaux, E. Martinez-Gonzalez and\nP. Vandergheynst, New Astron. Rev. 50, 880 (2006)\n[arXiv:astro-ph/0609147]; K. Land and J. Magueijo,\nMon. Not. Roy. Astron. Soc. 378, 153 (2007)\n[arXiv:astro-ph/0611518]; C. Gordon, W. Hu, D. Huterer\nand T. Crawford, Phys. Rev. D 72, 103002 (2005)\n[arXiv:astro-ph/0509301]; J. G. Cresswell, A. R. Liddle, P. Mukherjee and A. Riazuelo, Phys. Rev. D 73,\n041302 (2006) [arXiv:astro-ph/0512017]. S. H. S. Alexander, arXiv:hep-th/0601034.\nH. K. Eriksen, F. K. Hansen, A. J. Banday, K. M. Gorski\nand P. B. Lilje, Astrophys. J. 605, 14 (2004) [Erratumibid. 609, 1198 (2004)] [arXiv:astro-ph/0307507].\nF. K. Hansen, A. J. Banday and K. M. Gorski,\narXiv:astro-ph/0404206.\nH. K. Eriksen, A. J. Banday, K. M. Gorski, F. K. Hansen\nand P. B. Lilje, Astrophys. J. 660, L81 (2007)\n[arXiv:astro-ph/0701089].\nG. V. Chibisov and Y. V. Shtanov, Sov. Phys. JETP 69,\n17 (1989).\nG. V. Chibisov and Y. V. Shtanov, Int. J. Mod. Phys.\nA5, 2625 (1990).\n\n[7] A. Berera, R. V. Buniy and T. W. Kephart, JCAP 0410,\n016 (2004) [arXiv:hep-ph/0311233].\n[8] E. P. Donoghue and J. F. Donoghue, Phys. Rev. D 71,\n043002 (2005) [arXiv:astro-ph/0411237].\n[9] R. V. Buniy, A. Berera and T. W. Kephart, Phys. Rev.\nD 73, 063529 (2006) [arXiv:hep-th/0511115].\n[10] L. Ackerman, S. M. Carroll and M. B. Wise, Phys. Rev.\nD 75, 083502 (2007) [arXiv:astro-ph/0701357].\n[11] A. E. Gumrukcuoglu, C. R. Contaldi and M. Peloso,\narXiv:0707.4179 [astro-ph].\n[12] C. Armendariz-Picon, arXiv:0705.1167 [astro-ph].\n[13] J. F. Donoghue,\nK. Dutta and A. Ross,\narXiv:astro-ph/0703455.\n[14] T. S. Pereira, C. Pitrou and J.-P. Uzan, J. Cosmol. Astropart. Phys. 09, 006 (2007).\n[15] R. A. Battye and A. Moss, Phys. Rev. D 74, 041301\n(2006) [arXiv:astro-ph/0602377].\n[16] T. Koivisto and D. F. Mota, arXiv:0707.0279 [astro-ph].\n[17] A. Hajian and T. Souradeep, Astrophys. J. 597, L5\n(2003) [arXiv:astro-ph/0308001]. S. Basak, A. Hajian\nand T. Souradeep, Phys. Rev. D 74, 021301 (2006)\n[arXiv:astro-ph/0603406]. A. Hajian and T. Souradeep,\narXiv:astro-ph/0501001.\n[18] C. Armendariz-Picon, JCAP 0603, 002 (2006)\n[arXiv:astro-ph/0509893].\n[19] U.\nSeljak\nand\nM.\nZaldarriaga,\nAstrophys.\nJ.\n469,\n437\n(1996)\n[arXiv:astro-ph/9603033];\ncfa-www.harvard.edu/ mzaldarr/CMBFAST/cmbfast.html\n[20] map.gsfc.nasa.gov\n[21] [Planck Collaboration], arXiv:astro-ph/0604069.\n[22] J. Bock et al., in preparation.\n[23] www.sdss.org.\n[24] A. Loeb and M. Zaldarriaga, Phys. Rev. Lett. 92, 211301\n(2004) [arXiv:astro-ph/0312134].\n[25] M. Kamionkowski, A. Kosowsky and A. Stebbins,\nPhys. Rev. D 55, 7368 (1997) [arXiv:astro-ph/9611125];\nM. Kamionkowski, A. Kosowsky and A. Stebbins, Phys.\nRev. Lett. 78, 2058 (1997) [arXiv:astro-ph/9609132].\n[26] M. Zaldarriaga and U. Seljak, Phys. Rev. D 55,\n1830 (1997) [arXiv:astro-ph/9609170]; U. Seljak and\nM. Zaldarriaga, Phys. Rev. Lett. 78, 2054 (1997)\n[arXiv:astro-ph/9609169].\n[27] G. Jungman, M. Kamionkowski, A. Kosowsky\nand D. N. Spergel, Phys. Rev. D 54, 1332\n(1996)\n[arXiv:astro-ph/9512139];\nG.\nJungman,\nM. Kamionkowski, A. Kosowsky and D. N. Spergel, Phys.\nRev. Lett. 76, 1007 (1996) [arXiv:astro-ph/9507080].\n\n\f"}