{"id": "http://arxiv.org/abs/1105.2916v1", "guidislink": true, "updated": "2011-05-15T00:41:54Z", "updated_parsed": [2011, 5, 15, 0, 41, 54, 6, 135, 0], "published": "2011-05-15T00:41:54Z", "published_parsed": [2011, 5, 15, 0, 41, 54, 6, 135, 0], "title": "Quantum Gravity and Dark Matter", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1105.2614%2C1105.3293%2C1105.0274%2C1105.2834%2C1105.2678%2C1105.1172%2C1105.5054%2C1105.5742%2C1105.4100%2C1105.5351%2C1105.0734%2C1105.5997%2C1105.0988%2C1105.4174%2C1105.4735%2C1105.2435%2C1105.3867%2C1105.3514%2C1105.4266%2C1105.4741%2C1105.0573%2C1105.1050%2C1105.4214%2C1105.1747%2C1105.5969%2C1105.1499%2C1105.2053%2C1105.1694%2C1105.3673%2C1105.1428%2C1105.4803%2C1105.2783%2C1105.3234%2C1105.0552%2C1105.0509%2C1105.0942%2C1105.4586%2C1105.4354%2C1105.6207%2C1105.2509%2C1105.2701%2C1105.3742%2C1105.2796%2C1105.2361%2C1105.0564%2C1105.2452%2C1105.3603%2C1105.3649%2C1105.5894%2C1105.1567%2C1105.3804%2C1105.1248%2C1105.5911%2C1105.1787%2C1105.1265%2C1105.0411%2C1105.0038%2C1105.0311%2C1105.1390%2C1105.1359%2C1105.5396%2C1105.2430%2C1105.1422%2C1105.1878%2C1105.5835%2C1105.5701%2C1105.5056%2C1105.1575%2C1105.5134%2C1105.2643%2C1105.4102%2C1105.6020%2C1105.2505%2C1105.1556%2C1105.4376%2C1105.3630%2C1105.5433%2C1105.0392%2C1105.5330%2C1105.4263%2C1105.0605%2C1105.3542%2C1105.2677%2C1105.6123%2C1105.3191%2C1105.5306%2C1105.4029%2C1105.1623%2C1105.2916%2C1105.2810%2C1105.3915%2C1105.5011%2C1105.3254%2C1105.2854%2C1105.3130%2C1105.5453%2C1105.2757%2C1105.5882%2C1105.3880%2C1105.0099%2C1105.4232&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Quantum Gravity and Dark Matter"}, "summary": "We propose a connection between global physics and local galactic dynamics\nvia quantum gravity. The salient features of cold dark matter (CDM) and\nmodified Newtonian dynamics (MOND) are combined into a unified scheme by\nintroducing the concept of MONDian dark matter which behaves like CDM at\ncluster and cosmological scales but emulates MOND at the galactic scale.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1105.2614%2C1105.3293%2C1105.0274%2C1105.2834%2C1105.2678%2C1105.1172%2C1105.5054%2C1105.5742%2C1105.4100%2C1105.5351%2C1105.0734%2C1105.5997%2C1105.0988%2C1105.4174%2C1105.4735%2C1105.2435%2C1105.3867%2C1105.3514%2C1105.4266%2C1105.4741%2C1105.0573%2C1105.1050%2C1105.4214%2C1105.1747%2C1105.5969%2C1105.1499%2C1105.2053%2C1105.1694%2C1105.3673%2C1105.1428%2C1105.4803%2C1105.2783%2C1105.3234%2C1105.0552%2C1105.0509%2C1105.0942%2C1105.4586%2C1105.4354%2C1105.6207%2C1105.2509%2C1105.2701%2C1105.3742%2C1105.2796%2C1105.2361%2C1105.0564%2C1105.2452%2C1105.3603%2C1105.3649%2C1105.5894%2C1105.1567%2C1105.3804%2C1105.1248%2C1105.5911%2C1105.1787%2C1105.1265%2C1105.0411%2C1105.0038%2C1105.0311%2C1105.1390%2C1105.1359%2C1105.5396%2C1105.2430%2C1105.1422%2C1105.1878%2C1105.5835%2C1105.5701%2C1105.5056%2C1105.1575%2C1105.5134%2C1105.2643%2C1105.4102%2C1105.6020%2C1105.2505%2C1105.1556%2C1105.4376%2C1105.3630%2C1105.5433%2C1105.0392%2C1105.5330%2C1105.4263%2C1105.0605%2C1105.3542%2C1105.2677%2C1105.6123%2C1105.3191%2C1105.5306%2C1105.4029%2C1105.1623%2C1105.2916%2C1105.2810%2C1105.3915%2C1105.5011%2C1105.3254%2C1105.2854%2C1105.3130%2C1105.5453%2C1105.2757%2C1105.5882%2C1105.3880%2C1105.0099%2C1105.4232&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We propose a connection between global physics and local galactic dynamics\nvia quantum gravity. The salient features of cold dark matter (CDM) and\nmodified Newtonian dynamics (MOND) are combined into a unified scheme by\nintroducing the concept of MONDian dark matter which behaves like CDM at\ncluster and cosmological scales but emulates MOND at the galactic scale."}, "authors": ["Chiu Man Ho", "Djordje Minic", "Y. Jack Ng"], "author_detail": {"name": "Y. Jack Ng"}, "author": "Y. Jack Ng", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1142/S021827181102072X", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1105.2916v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1105.2916v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "This paper has been awarded the Fifth Prize in the 2011 Essay\n  Competition of the Gravity Research Foundation", "arxiv_primary_category": {"term": "gr-qc", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "gr-qc", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "astro-ph.CO", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "hep-th", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1105.2916v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1105.2916v1", "journal_reference": "Gen. Rel. Grav. 43 (2011) 2567-2573", "doi": "10.1142/S021827181102072X", "fulltext": "Quantum Gravity and Dark Matter\n\narXiv:1105.2916v1 [gr-qc] 15 May 2011\n\nChiu Man Ho1∗ , Djordje Minic2† , and Y. Jack Ng3‡\n1\n\n2\n\nDepartment of Physics and Astronomy, Vanderbilt University,\nNashville, TN 37235, U.S.A.\n\nDepartment of Physics, Virginia Tech, Blacksburg, VA 24061, U.S.A.\n3\n\nInstitute of Field Physics, Department of Physics and Astronomy,\nUniversity of North Carolina, Chapel Hill, NC 27599, U.S.A.\n\n\"This paper has been awarded the Fifth Prize in the 2011 Essay Competition of the\nGravity Research Foundation\"\n\nAbstract\nWe propose a connection between global physics and local galactic dynamics via\nquantum gravity. The salient features of cold dark matter (CDM) and modified Newtonian dynamics (MOND) are combined into a unified scheme by introducing the concept\nof MONDian dark matter which behaves like CDM at cluster and cosmological scales\nbut emulates MOND at the galactic scale.\n\n∗\n\nchiuman.ho@vanderbilt.edu\ndminic@vt.edu\n‡\nyjng@physics.unc.edu\n†\n\n1\n\n\f1\n\nIntroduction\n\nThe vexing problem of \"missing mass\" has been with us ever since Zwicky found that the\nindividual galaxies in the Coma cluster were zipping around too fast for gravity to hold them\ntogether in a cluster. This problem started to get the attention of the scientific community\nafter Rubin and her collaborators discovered that the clouds of hydrogen gas in several\ndistant galaxies were orbiting the center of their galaxies at a speed far exceeding what\ncould be accounted for by the gravitational pull due to the mass of visible baryonic matter.\nThis mass mismatch has since been astoundingly confirmed from dwarf galaxies to galaxy\ngroups. A simple but bold solution would be to postulate the existence of dark (invisible)\nmatter that makes up the mass difference [1].\nThis apparent need for dark matter at the galactic scale is even more urgent at larger\nscales. Dark matter is needed to account for the correct cosmic microwave background\nspectrum shapes (including the alternating peaks). It is also needed to yield the correct largescale structures and elemental abundances from big bang nucleosynthesis. (Supercomputer\nsimulations suggest that the cosmos would look very different if dark matter did not exist.)\nDark matter also provides the correct gravitational lensing. One of the most prominent\nexamples pointing to the existence of dark matter is the Bullet Cluster, a pair of merging\ngalaxy clusters. In this system, the gravitational lensing of background galaxies indicates\nthat the mass is offset from the X-ray plasma, suggesting that dark matter has shifted the\ncenter of gravity elsewhere. The consensus in the cosmology community appears to be that\ndark matter exists! By now all this has been canonized in the concordant ΛCDM model\nof cosmology according to which cold dark matter accounts for about 23% of the energy\nand mass of the universe, 5% resides in ordinary matter, and dark energy in the form of\ncosmological constant has the lion's share, accounting for the remaining 72% (numerically\nthe cosmological constant is related to the current Hubble parameter as Λ ∼ 3H 2 .)\nBut there is a fly in the ointment. At the galactic scale, dark matter can explain the\nobserved asymptotic independence of orbital velocities on the size of the orbit only by fitting\ndata (usually with two parameters) for individual galaxies. It can do no better in explaining\nthe observed baryonic Tully-Fisher relation [2, 3], i.e., the asymptotic-velocity-mass (v 4 ∝ M)\nrelation. Another problem with dark matter is that it seems to possess too much power on\nsmall scales (∼ 1 − 1000 kpc) [4]. While cold dark matter works spectacularly well at the\ncluster and cosmic scales, it had been found to be somewhat wanting at the galactic scale.\n\nThis is in stark contrast to another paradigm that goes by the name of modified Newtonian dyanmics (MOND) [5, 6], due to Milgrom, which stipulates that the acceleration of\n√\na test mass m due to the source M is given by a = aN for a ≫ ac , but a = aN ac for\na ≪ ac , where aN = GM/r 2 is the magnitude of the usual Newtonian acceleration and the\ncritical acceleration ac is numerically related to the speed of light c and the Hubble scale H\nas ac ≈ cH/(2π) ∼ 10−8 cm/s2 . With only a single parameter MOND can explain easily and\nrather successfully the observed flat galactic rotation curves and the observed Tully-Fisher\n2\n\n\frelation [7]. But there are problems with MOND at the cluster and cosmological scales. The\nreason may be due to the lack of a fundamental relativistic theory of MOND.\nObviously it is desirable to combine the salient successful features of both CDM and\nMOND into a unified scheme. This essay describes our effort in that endeavor. Succinctly,\nby making use of a novel quantum gravitational interpretation of (dark) matter's inertia\nour scheme [8] indicates that dark matter emulates MOND at the galactic scale. This work\nembraces a recurring theme at the current gravity research frontiers: the relationship between\ngravity and thermodynamics.\n\n2\n\nEntropic Gravity and Critical Galactic Acceleration\n\nWe start with the recent work of E. Verlinde [9, 10, 11, 12] in which the canonical Newton's\nlaws are derived from the point of view of holography. Using the first law of thermodynamics, Verlinde proposes the concept of entropic force Fentropic = T ∆S\n, where ∆x denotes\n∆x\nan infinitesimal spatial displacement of a particle with mass m from the heat bath with\ntemperature T . He then invokes Bekenstein's original arguments concerning the entropy S\n∆x. Using the famous formula for the Unof black holes [13] by imposing ∆S = 2πkB mc\n~\n~a\nruh temperature, kB T = 2πc , associated with a uniformly accelerating (Rindler) observer\n[14, 15], he obtains Fentropic = T ∇x S = ma, Newton's second law (with the vectorial form\nF~ = m~a, being dictated by the gradient of the entropy).\nNext, Verlinde considers an imaginary quasi-local (spherical) holographic screen of area\nA = 4πr 2 with temperature T . Then, he assumes the equipartition of energy E = 12 NkB T\nwith N being the total number of degrees of freedom (bits) on the screen given by N =\nAc3 /(G~). Using the Unruh temperature formula and the fact that E = Mc2 , he obtains\n2πkB T = GM/r 2 and recovers exactly the non-relativistic Newton's law of gravity, namely\na = GM/r 2 . But this is precisely the fundamental relation that Milgrom is proposing to\nmodify so as to fit the galactic rotation curves. Therefore it is now natural to ask whether\nthere is an entropic [13] or holographic [16, 17, 18, 19] interpretation behind Milgrom's\nmodification of Newton's second law.\nWe first have to recognize that we live in an accelerating universe (in accordance with the\nΛCDM model). This suggests that we will need a generalization [8] of Verlinde's proposal\n[9] to de Sitter space with a positive cosmological constant (which, we recall, is related to\nthe Hubble parameter H by Λ ∼ 3H 2 ). The Unruh-Hawking temperature p\nas measured by a\nnon-inertial observerp\nwith acceleration a in the de Sitter space is given by a2 + a20 /(2πkB )\n[20, 21], where a0 = Λ/3 [16]. Consequently, we can define the net temperature measured\nby the non-inertial observer (relative to the inertial observer) to be T̃ = [(a2 + a20 )1/2 −\na0 ]/(2πkB ).\n\n3\n\n\fWe can now follow Verlinde's approach.4 Then the entropic force, acting on the test mass\nm with acceleration a in de Sitter space, is given by Fentropic = T̃ ∇x S = m[(a2 + a20 )1/2 − a0 ].\nFor a ≫ a0 , the entropic force is given by Fentropic ≈ ma, which gives a = aN for a test\nmass m due to the source M. But for a ≪ a0 , we have Fentropic ≈ ma2 /(2a0 ) which,\n√\nupon equated with maN , yields a ≈ 2aN a0 . Thus we have derived Milgrom's scaling or\nMOND with p\nthe correct order of magnitude for the (observed) critical galactic acceleration\nac = 2a0 ∼ Λ/3 ∼ H ∼ 10−8 cm/s2 ! 5 From our perspective, MOND is a (successful)\nphenomenological consequence of quantum gravity.\nHaving derived MOND we can now write the entropic force, in the regime a ≪ a0 , as\n1\n1\n√\n2\nFentropic ≈ m 2aa0 = FM ilgrom ≈ m aN ac implying that a = ( 4 aN a20 ac ) 4 = ( 2 aN a30 /π ) 4 .\nNumerically, it turns out that 2πac ≈ a0 , and so we set ac = a0 /(2π) for simplicity. The flat\ngalactic rotation curves as well as the Tully-Fisher relation can be easily recovered by using\n2\n2\nFcentripetal = m 2aa0 = mrv to solve for the terminal velocity v.\n\n3\n\nMONDian Dark Matter\n\nTo see how dark matter can behave like MOND at the galactic scale, let us continue to\nfollow Verlinde's holographic approach. Invoking the imaginary holographic screen of radius\nr, we can write6 2πkB T̃ = GrM̃\n2 , where M̃ represents the total mass enclosed within the\n3\nvolume V = 4πr /3. But, as we will show below, consistency with the discussion in the\nprevious section (and with observational data) demands that M̃ = M + M ′ where M ′ is\nsome unknown mass - that is, dark matter. Thus, we need the concept of dark matter for\nconsistency.\nFirst note that it is natural to write the entropic force Fentropic = m[(a2 + a20 )1/2 −\na0 ] as Fentropic = m aN [1 + (a0 /a)2 /π] since the latter expression is arguably the simplest\ninterpolating formula for Fentropic that satisfies the two requirements: a ≈ (2aN a30 /π)1/4 in\nthe small acceleration a ≪ a0 regime, and a = aN in the a ≫ a0 regime. But we can also\nwrite F in another, yet equivalent, form: Fentropic = mG(M + M ′ )/r 2 . These two forms of\nF illustrate the idea of CDM-MOND duality [8]. The first form can be interpreted to mean\nthat there is no dark matter, but that the law of gravity is modified, while the second form\nmeans that there is dark matter (which, by construction, is consistent with MOND) but that\nthe law of gravity is not modified. The second form gives us a very intriguing dark matter\n\u00012\nprofile: M ′ = π1 aa0\nM. Dark matter of this kind can behave as if there is no dark matter\nbut MOND. Therefore, we call it \"MONDian dark matter\" [8]. One can solve for M ′ as a\n4\n\nWe only need to replace the T in Verlinde's argument by T̃ for the Unruh temperature.\nActually Milgrom did observe [22] that the generalized Unruh temperature T̃ can give the correct behaviors of the interpolating function between the usual Newtonian acceleration and his suggested MONDian\ndeformation for very small accelerations. He was right; but, unlike us, he could offer no justification.\n6\nWe need to replace the T and M in Verlinde's argument by T̃ and M̃ respectively.\n5\n\n4\n\n\ffunction of r in the two acceleration regimes: M ′ ≈ 0 for a ≫ a0 , and (with a0 ∼\n√\nM ′ ∼ ( Λ/G)1/2 M 1/2 r\n\n√\n\nΛ)\n\nfor a ≪ a0 . Intriguingly the dark matter profile we have obtained relates, at the galactic\nscale,7 dark matter (M ′ ), dark energy (Λ) and ordinary matter (M) to one another. As a\nside remark, this dark matter profile can be used to recover the observed flat rotation curves\nand the Tully-Fisher relation.\n\n4\n\nInertia in Quantum Gravity\n\nAs the example of MOND illustrates, the inertia – the response of a body to force – is\nnot an inherent property of bodies. It depends on the background medium. Let us discuss\nthis phenomenon in a more general and wider context. Adopting the thermo-field-dynamics\nlanguage of Israel [23] and others [24, 25], we start from the familiar expansion of the\nMinkowski vacuum ψ in terms of an ensemble sum over the entangled left and right Rindler\nP\nvacuum φ: ψM = i e−βEi φLi × φR\ni , where β is the inverse of the Unruh temperature T ∼\nL,R\n~a/c. Better yet, instead of φ\nwe can use, in the above formula, the exact quantum\ngravity states, such as fuzzball states introduced by Mathur [26], the presumed exact nohorizon states of string theory (viewed as a quantum theory of gravity).\nReplacing the Minkowski vacuum with the global de Sitter vacuum and the entangled\nleft and right Rindler patches with the entangled left and right static patches of de Sitter\n(or better still, with their fuzzball counterparts) we can expand the de Sitter vacuum with\ncosmological constant Λ as\nX\nΨΛdS =\ne−βdS Ei ΦLi × ΦR\ni .\ni\n\nThis formula is in the spirit of the discussion of holography in de Sitter space as presented\n2\n2 1/2\nin [27]. Here the Unruh\np temperature in the de Sitter space is given by T̃ = [(a + a0 ) −\na0 ]/(2πkB ) with a0 = Λ/3 introduced above. The weighting factors in the ensemble sum\ndepend on the energies Ei ∼ mi c2 with mi being the invariant masses associated with the\nexact quantum gravity spectrum (which we do not know how to calculate at present). Thus,\nfor the Minkowski case, we have ratios like mi a−1 in the ensemble weights (in the units of\nc = 1, ~ = 1 and kB = 1). But, for the de Sitter case, we obtain these ratios only in the limit\nof a ≫ a0 , whereas in the limit of a ≪ a0 the ratios are mi (a2 /a0 )−1 , where a0 is the critical\nacceleration a la Milgrom. The latter result for the de Sitter case can be reinterpreted to\nmean that the inertial properties of massive particles with mass mi have become accelerationand Λ-dependent! (This is analogous to what happens to the inertial properties of particles\n7\n\nOne may wonder why MOND works at the galactic scale, but not at the cluster or cosmic scale. One\nof reasons is that, for the larger scales, one has to use Einstein's equations with non-negligible contributions\nfrom the pressure and explicitly the cosmological constant, which have not been taken into account in the\nMOND scheme [8].\n\n5\n\n\fin special relativity, where the dependence is on the velocity of the particle and c, the speed\nof light.)\nTherefore, the weights of the exact formula which represents the expansion of the exact de\nSitter quantum gravity state in terms of entangled exact stationary quantum gravity states,\nsuch as fuzzballs, associated with the left and right static patches, are scale-dependent, and\nthe weights determine what we mean by the mass at different scales. This general argument\nsuggests that Milgrom's scaling is just a new physical phenomenon in which the inertial\nproperties are acceleration- and Λ-dependent.\n\n5\n\nDiscussion\n\nTo recapitulate, we have given an entropic and holographic dual description of the Milgrom\nscaling associated with galactic rotation curves and the Tully-Fisher relation by showing how\ndark matter can emulate the modified Newtonian dynamics at the galactic scale. In addition\nwe have argued that the inertia of matter is quantum gravitational and is deeply connected\nto dark energy.\nThe last point reminds us of the relation between nuclear physics and the theory of\nquantum chromodynamics (QCD). We can make the following analogy: the phenomenological lagrangians of nuclear physics would correspond to the phenomenological treatments of\nmatter in particle physics. But the true picture should be found in quantum gravity, the\nanalog of QCD in this comparison. Furthermore, the Milgrom scaling can perhaps be viewed\nas an analog of the Bjorken scaling and quantum gravity corrections to the Unruh formula\nas the analog of the logarithmic corrections to the Bjorken scaling as provided by asymptotic\nfreedom in QCD.\nWe conclude with some open questions to be investigated. Our arguments have been\nmainly thermodynamical, hence the precise nature of MONDian dark matter is still unclear;\nwe should construct a microscopic theory which would also address the question of crossover\nbetween the Newtonian and MOND regimes. The dark matter profile we have obtained (at\nthe galactic scale) hints at a fixed energy density ratio between the three different cosmological components of the Universe; how does this relation help to alleviate the coincidence\nproblem? That same relation seems to suggest that the microscopic MONDian dark matter\ndegrees of freedom may have knowledge of the non-local cosmological constant; what are\nsome of the phenomenological implications (for example, in dark matter searches)? Because\nwe have the exact formula for the Unruh acceleration, we can now look at the higher order\nterms (in powers or inverse powers of a2 /Λ) in the expansion of the relevant expressions\nto examine possible phenomenological consequences. For example, are there corrections to\nthe Milgrom scaling? Would the corrections improve MOND's agreement with the rotation\ncurves? What are the effects on the Tully-Fisher relation? Are the correction terms relevant\nto sub-galactic scales? Finally we have given a general argument showing that inertia of a\n6\n\n\fbody depends on the physical vacuum. Can we derive the entropic force directly in this general framework? And what novel properties of dark matter and distinctive phenomenologies\ncan be uncovered?\nAcknowledgments: CMH, DM, and YJN are supported in part by the US Department of\nEnergy under contract DE-FG05-85ER40226, DE-FG05-92ER40677 and DE-FG02-06ER41418\nrespectively.\n\nReferences\n[1] For a recent review, see G. Bertone, D. Hooper and J. Silk, Phys. Rept. 405, 279 (2005),\nand references therein.\n[2] R.B. Tully and J.R. Fisher, Astronomy and Astrophysics 54, 661 (1977).\n[3] S.S. McGaugh et al., Astrophysical Journal 533, L99 (2000).\n[4] R. Cen, astro-ph/0005206.\n[5] M. Milgrom, Astrophys. J. 270, 365, 371, 384 (1983).\n[6] J. D. Bekenstein, Phys. Rev. D70, 083509 (2004).\n[7] M. Milgrom, Astrophys. J. 698, 1630 (2009).\n[8] C.M. Ho, D. Minic and Y.J. Ng, Phys. Lett. B693, 567 (2010) [arXiv:1005.3537].\n[9] E. Verlinde, arXiv: 1001.0785 [hep-th].\n[10] T. Jacobson, Phys. Rev. Lett. 75, 1260 (1995).\n[11] T. Padmanabhan, arXiv:0912.3165[gr-qc].\n[12] L. Smolin, arXiv:1001.3668.\n[13] J. D. Bekenstein, Phys. Rev. D7, 2333 (1973).\n[14] W. G. Unruh, Phys. Rev. D14, 870 (1976).\n[15] P.C.W. Davies, J. Phys. A8, 609 (1975).\n[16] S.W. Hawking, Comm. Math. Phys. 43, 199 (1975).\n[17] G. 't Hooft, arXiv: gr-qc/9310026.\n[18] L. Susskind, J. Math. Phys, 36, 6377 (1995).\n7\n\n\f[19] O. Aharony, S.S. Gubser, J. Maldacena, H. Ooguri, Y. Oz, Phys. Rept. 323, 183 (2000),\nand references therein.\n[20] S. Deser and O. Levin, Class. Quant. Grav. 14, L163 (1997).\n[21] T. Jacobson, Class. Quant. Grav. 15, 251 (1998).\n[22] M. Milgrom, Phys. Lett. A253, 273 (1999).\n[23] W. Israel, Phys. Lett. A57, 107 (1976).\n[24] J. Maldacena, arXiv:hep-th/0106112.\n[25] M. Van Raamsdonk, arXiv:0907.2939.\n[26] S.D. Mathur and C.J. Plumberg, arXiv:1101.4899.\n[27] V. Balasubramanian, J. de Boer and D. Minic, Class. Quant. Grav. 19, 5655 (2002)\n[Annals Phys. 303, 59 (2003)].\n\n8\n\n\f"}