{"id": "http://arxiv.org/abs/1011.1164v1", "guidislink": true, "updated": "2010-11-04T14:07:15Z", "updated_parsed": [2010, 11, 4, 14, 7, 15, 3, 308, 0], "published": "2010-11-04T14:07:15Z", "published_parsed": [2010, 11, 4, 14, 7, 15, 3, 308, 0], "title": "Probing the magnetic ground state of the molecular Dysprosium triangle", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1011.5623%2C1011.6368%2C1011.2145%2C1011.5185%2C1011.0790%2C1011.2495%2C1011.2580%2C1011.4081%2C1011.5295%2C1011.6202%2C1011.5008%2C1011.6282%2C1011.3573%2C1011.2922%2C1011.1474%2C1011.6597%2C1011.6608%2C1011.6028%2C1011.3217%2C1011.2936%2C1011.0830%2C1011.3462%2C1011.0265%2C1011.2901%2C1011.0264%2C1011.3268%2C1011.2963%2C1011.3786%2C1011.3017%2C1011.3899%2C1011.1126%2C1011.0993%2C1011.3047%2C1011.3118%2C1011.1672%2C1011.4767%2C1011.1074%2C1011.5628%2C1011.2573%2C1011.5893%2C1011.5461%2C1011.3328%2C1011.5729%2C1011.6503%2C1011.1895%2C1011.3937%2C1011.1164%2C1011.1206%2C1011.5831%2C1011.1113%2C1011.2544%2C1011.3264%2C1011.0912%2C1011.5612%2C1011.0846%2C1011.6674%2C1011.2158%2C1011.4988%2C1011.5301%2C1011.2529%2C1011.5913%2C1011.5202%2C1011.3588%2C1011.4964%2C1011.2950%2C1011.1931%2C1011.4145%2C1011.1859%2C1011.1745%2C1011.4115%2C1011.5241%2C1011.3344%2C1011.6611%2C1011.0379%2C1011.5448%2C1011.5317%2C1011.1506%2C1011.2250%2C1011.6015%2C1011.0429%2C1011.1562%2C1011.0794%2C1011.5679%2C1011.0899%2C1011.6544%2C1011.5357%2C1011.1291%2C1011.5842%2C1011.6116%2C1011.1157%2C1011.5000%2C1011.1395%2C1011.4667%2C1011.6125%2C1011.5770%2C1011.3605%2C1011.0580%2C1011.2839%2C1011.0716%2C1011.5992%2C1011.6050&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Probing the magnetic ground state of the molecular Dysprosium triangle"}, "summary": "We present zero field muon spin lattice relaxation measurements of a\nDysprosium triangle molecular magnet. The local magnetic fields sensed by the\nimplanted muons indicate the coexistence of static and dynamic internal\nmagnetic fields below $T^* ~35$ K. Bulk magnetization and heat capacity\nmeasurements show no indication of magnetic ordering below this temperature. We\nattribute the static fields to the slow relaxation of the magnetization in the\nground state of Dy3. The fluctuation time of the dynamic part of the field is\nestimated to be ~0.55 $\\mu$s at low temperatures", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1011.5623%2C1011.6368%2C1011.2145%2C1011.5185%2C1011.0790%2C1011.2495%2C1011.2580%2C1011.4081%2C1011.5295%2C1011.6202%2C1011.5008%2C1011.6282%2C1011.3573%2C1011.2922%2C1011.1474%2C1011.6597%2C1011.6608%2C1011.6028%2C1011.3217%2C1011.2936%2C1011.0830%2C1011.3462%2C1011.0265%2C1011.2901%2C1011.0264%2C1011.3268%2C1011.2963%2C1011.3786%2C1011.3017%2C1011.3899%2C1011.1126%2C1011.0993%2C1011.3047%2C1011.3118%2C1011.1672%2C1011.4767%2C1011.1074%2C1011.5628%2C1011.2573%2C1011.5893%2C1011.5461%2C1011.3328%2C1011.5729%2C1011.6503%2C1011.1895%2C1011.3937%2C1011.1164%2C1011.1206%2C1011.5831%2C1011.1113%2C1011.2544%2C1011.3264%2C1011.0912%2C1011.5612%2C1011.0846%2C1011.6674%2C1011.2158%2C1011.4988%2C1011.5301%2C1011.2529%2C1011.5913%2C1011.5202%2C1011.3588%2C1011.4964%2C1011.2950%2C1011.1931%2C1011.4145%2C1011.1859%2C1011.1745%2C1011.4115%2C1011.5241%2C1011.3344%2C1011.6611%2C1011.0379%2C1011.5448%2C1011.5317%2C1011.1506%2C1011.2250%2C1011.6015%2C1011.0429%2C1011.1562%2C1011.0794%2C1011.5679%2C1011.0899%2C1011.6544%2C1011.5357%2C1011.1291%2C1011.5842%2C1011.6116%2C1011.1157%2C1011.5000%2C1011.1395%2C1011.4667%2C1011.6125%2C1011.5770%2C1011.3605%2C1011.0580%2C1011.2839%2C1011.0716%2C1011.5992%2C1011.6050&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We present zero field muon spin lattice relaxation measurements of a\nDysprosium triangle molecular magnet. The local magnetic fields sensed by the\nimplanted muons indicate the coexistence of static and dynamic internal\nmagnetic fields below $T^* ~35$ K. Bulk magnetization and heat capacity\nmeasurements show no indication of magnetic ordering below this temperature. We\nattribute the static fields to the slow relaxation of the magnetization in the\nground state of Dy3. The fluctuation time of the dynamic part of the field is\nestimated to be ~0.55 $\\mu$s at low temperatures"}, "authors": ["Z. Salman", "S. R. Giblin", "Y. Lan", "A. K. Powell", "R. Scheuermann", "R. Tingle", "R. Sessoli"], "author_detail": {"name": "R. Sessoli"}, "author": "R. Sessoli", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevB.82.174427", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1011.1164v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1011.1164v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "5 pages, 5 figures, accepted for publication in Phys. Rev. B", "arxiv_primary_category": {"term": "cond-mat.str-el", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.str-el", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "cond-mat.mes-hall", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "cond-mat.mtrl-sci", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1011.1164v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1011.1164v1", "journal_reference": null, "doi": "10.1103/PhysRevB.82.174427", "fulltext": "Probing the magnetic ground state of the molecular Dysprosium triangle\nZ. Salman,1, 2, ∗ S. R. Giblin,3 Y. Lan,4 A. K. Powell,4 R. Scheuermann,2 R. Tingle,3 and R. Sessoli5\n1\n\narXiv:1011.1164v1 [cond-mat.str-el] 4 Nov 2010\n\nClarendon Laboratory, Department of Physics, Oxford University, Parks Road, Oxford OX1 3PU, UK\n2\nLaboratory for Muon Spin Spectroscopy, Paul Scherrer Institut, CH-5232 Villigen PSI, Switzerland\n3\nISIS Facility, Rutherford Appleton Laboratory, Chilton, Oxfordshire, OX11 0QX, UK\n4\nInstitut für Anorganische Chemie, Universität Karlsruhe (TH), Engesserstr. 15, 76131 Karlsruhe, Germany\n5\nDipartimento di Chimica, Universitá di Firenze & INSTM,\nvia della Lastruccia 3, 50019 Sesto Fiorentino, Italy\nWe present zero field muon spin lattice relaxation measurements of a Dysprosium triangle molecular magnet. The local magnetic fields sensed by the implanted muons indicate the coexistence of\nstatic and dynamic internal magnetic fields below T ∗ ∼ 35 K. Bulk magnetization and heat capacity\nmeasurements show no indication of magnetic ordering below this temperature. We attribute the\nstatic fields to the slow relaxation of the magnetization in the ground state of Dy3 . The fluctuation\ntime of the dynamic part of the field is estimated to be ∼ 0.55 μs at low temperatures.\n\nINTRODUCTION\n\nRecent development in the field of molecular magnetism has produced idealized model systems that allow the investigation of quantum phenomena in nanomagnets [1]. Examples include slow relaxation in high\nspin molecules [2], quantum tunneling of the magnetization [3, 4], topological quantum phase interference [5, 6],\nand quantum coherence [7–9]. Within these systems, antiferromagnetic clusters, rings or triangles [9, 10], have\nbeen considered for possible use in quantum computation, due to longer decoherence time as a result of weaker\nintercluster dipolar interactions [8]. Here we investigate a recently synthesized trinuclear cluster [Dy3 (μ3 OH)2 L3 Cl(H2 O)5 ]Cl3 (where L is the anion of orthovanillin) [11], hereafter abbreviated as Dy3 (see Fig. 1).\nThis compound exhibits two important properties; a sys-\n\nanisotropy axis in the plane rotated by 120o relative to\nits neighbors (see Fig. 1). A small antiferromagnetic interaction (∼ 0.2 K) between neighboring Dy3+ results in\na nonmagnetic, S = 0, ground state characterized by a\nvortex spin-chirality.\nIn this paper we present a zero field (ZF) muon spin relaxation (μSR) study of Dy3 . In this technique polarized\nmuons are used as local spin probes of the microscopic\nmagnetic structure of the individual Dy3 molecules. We\nfind that below T ∗ ∼ 35 K the local magnetic field experienced by the muons has two components, dynamic\nand static. The static component is direct evidence of\nthe slow relaxation of the magnetization in the ground\nstate of Dy3 , while the dynamic component is used to\nmeasure the fluctuations time of the Dy3 ground spin\nstate directly. This is possible due to the unique local\nperspective of the muon.\n\nEXPERIMENTAL\n\nFIG. 1: (color online) The magnetic core of the Dy3 molecules.\nThe yellow, red, green and gray balls represent the Dy, O, Cl,\nand C atoms, respectively.\n\ntem with a nonmagnetic ground state as well as slow relaxation of the magnetization which is typical of some\nhigh spin clusters [12]. Magnetization measurements\nhave been explained using a model of three Dy3+ moments arranged on a triangle, each with a large Ising\n\nThe μSR experiments were performed on the DOLLY\nspectrometer at the Paul Scherrer Institute, Switzerland.\nIn these experiments 100% polarized (along the beam\ndirection, z) positive muons are implanted in the sample.\nEach implanted muon decays (lifetime τμ = 2.2 μsec)\nemitting a positron preferentially in the direction of its\npolarization at the time of decay. Using appropriately\npositioned detectors, one measures the asymmetry of the\nmuon beta decay along z as a function of time A(t), which\nis proportional to the time evolution of the muon spin\npolarization. A(t) depends on the distribution of internal\nmagnetic fields and their temporal fluctuations. Further\ndetails on the μSR technique may be found in Ref. [13].\nThe composition and structure of Dy3 sample was confirmed using X-ray diffraction and magnetization measurements. The powder sample was placed in a 4 He gas\nflow cryostat to measure the muon spin relaxation in the\ntemperature range between 1.6 and 300 K. Heat capacity measurements at ZF and in the temperature range\n\n\f2\n\n0.20\n\n0.100\n\n0.00\n\n0.050\n0.0\n\n30 K\n0\n\n2\n\nTime [μs]\n\n0.1\n\n4\n\n6\n\nmuons experience a distribution of static magnetic fields\nρ (B − Bs , ∆), where Bs is the average static field and\n∆ is the root mean square of the field distribution, then\nthe asymmetry follows a static Kubo-Toyabe function\nZ\nAKT (t) = A0 ρ (B − Bs , ∆) Gz (t)d3 B\nGz (t) = cos2 θ + sin2 θ cos(γBt).\n\n(2)\n\n10\n0\n80\n\nFIG. 2: (color online) The asymmetry as a function of time at\nthree different temperatures. The inset shows the asymmetry\nat very short times, where the dip is clear evidence for a static\nlocal field experienced by the muons. The solid lines are fits\nto Eq. (2).\n\n.\n\n(a)\n\n20\n\n0.2\n\n-1\n\n1.8 K\n\n0.05\n\n30\n\nλ [μs ]\n\n0.10\n\n√\nλt\n\nwhere λ is the relaxation rate, containing information regarding the dynamics of the local field. In particular, at\nlow temperatures where ∆ > λ, A(t) is almost identical to the well known dynamic LKT function and hence\nλ = 2/3τ [14, 15], where τ is the fluctuation time of the\nlocal magnetic field [18]. The square root exponential relaxation reflects the averaging of the relaxation behavior\nof muons stopping in multiple inequivalent sites [15, 19–\n22].\nThe parameters λ and ∆ obtained from the fits are\nshown in Fig. 3(a) and (b), respectively. Note that at\n\nT =1.8 K\n\n0.075\n\n100 K\n\nA(t) = ALKT (t)e−\n\n∆ [MHz]\n\nAsymmetry\n\n0.15\n\nponent a small fluctuating field Bd (t) is present, then the\n1/3 tail continues to relax to zero [14–16]. In this case the\nrelaxation can be described by a phenomenological function: a LKT or GKT multiplied by a suitable dynamic\nrelaxation function [17].\nIn our case, the asymmetry measured in Dy3 at all\ntemperatures was found to fit best to LKT multiplied by\na square root exponential relaxation,\n\n(b)\n\n60\n40\n20\n0\n\nT ~35 K\n*\n\n10\n\nT [K]\n\n0.6\n0.4\n0.3\n\n∆ [T]\n\nbetween 2 and 100 K were performed on the same sample using a Quantum Design Physical Properties Measurement System. Additionally, magnetization measurements in the same temperature range were performed\nusing a Quantum Design Magnetic Properties Measurement System.\nExample muon spin relaxation curves measured in ZF\nare presented in Fig. 2. Note that at low temperatures,\nthe asymmetry exhibits a dip at early times (inset of\nFig. 2), followed by a recovery and then relaxation at\nlonger times. In contrast, at high temperature the asymmetry relaxes almost exponentially from its initial value\nto zero. The low temperature relaxation curves are evidence that the internal magnetic field experienced by the\nimplanted muons in Dy3 contains two contributions; a\nstatic (time independent) component and a fluctuating\ncomponent. As we discuss below, the static component\nis direct evidence of the slow relaxation of the individual Dy3 (or Dy3+ ) magnetic moments. Generally, when\n\n0.1\n0.0\n100\n\nFIG. 3: (color online) The values of (a) λ and (b) ∆ obtained\nfrom fits of the relaxation curves as a function of temperature.\n\n(1)\n\nHere γ = 135.5 MHz/T is the muon gyromagnetic ratio,\nθ is the angle between the initial muon spin and the local\nstatic magnetic field B which is averaged over a powder\nsample. For example, if Bs = 0 then the asymmetry is at\nits maximum value at t = 0, it exhibits a dip at t ∼ 1/∆\nand recovers to ∼ 1/3 its initial value at long times. Depending on the form of ρ, e.g. Gaussian or Lorentzian,\nthe relaxation follows a Gaussian Kubo-Toyabe (GKT),\nAGKT , or a Lorentzian Kubo-Toyabe (LKT), ALKT , respectively. However, if in addition to the static field com-\n\nhigh temperatures λ is small and ∆ ≈ 0. As the temperature is decreased λ increases sharply while ∆ remains\nzero. At T ∗ ∼ 35 K, λ peaks and ∆ becomes non-zero.\nFinally, at lower temperatures λ decreases again while ∆\nsaturates at ∼ 70 MHz, corresponding to a width in field\nof ∼ 0.45 T (right side axis of Fig. 3(b)). These temperature dependencies are commonly seen in materials\nundergoing magnetic ordering at Tc = T ∗ [23], In such\ncases the increase of λ above Tc is attributed to a critical\nslowing down of the fluctuations and ∆ is proportional to\n\n\f3\nthe order parameter (local magnetization) [23, 24]. This\nbehavior is quite unusual, and exhibits a sharp transition from a paramagnetic to an ordered/static regime,\nor the sudden appearance of static magnetic fields in the\nsystem. Such static fields are rarely observed in SMMs\nstudied by μSR [22].\nTriggered by these findings we measured the magnetization and heat capacity to confirm that there is no evidence of long range magnetic ordering in the Dy3 system.\nAs can be seen in Fig. 4, bulk magnetization measurements in 50 mT show no indication of ordering at ∼ 35\nK [11, 12]. Similarly, heat capacity measurements in ZF\nshow no anomalies around this temperature. Therefore,\nthe observed static fields can be associated with either\n(I) an ordering only on the local scale, e.g. the freezing\n(or slowing down) of the fluctuations of the individual\nDy3+ magnetic moments, or (II) a magnetic ground state\nwhere the Dy3+ moments order is such a way that they\ndo not cancel each other, resulting in a ground state with\na non-vanishing magnetic moment. The latter possibility\nis ruled out by bulk magnetization measurements which\nconfirm a nonmagnetic ground state in Dy3 molecules\n[11, 12].\n\nHeat Capacity [μJ/mg K]\n\n15\n\n2.25x10\n\n-6\n\n10\n\n1.50x10\n\n5\n\n7.50x10\n\n0\n\nχ [emu/mg G]\n\n-6\n\n-7\n\n0\n\n20\n\n40\n\nT [K]\n\n60\n\n80\n\n0.00\n100\n\nFIG. 4: (color online) The heat capacity measured in ZF (circles, left axes) and susceptibility measured in 50 mT (squares,\nright axes) of Dy3 as a function of temperature. There is no\nevidence for any anomaly at 35 K. The solid lines are a guide\nfor the eye.\n\nDISCUSSION\n\nWe start by discussing the local static field contribution and its origin. Assuming that the muons occupy\nsites which are relatively far from the Dy3 magnetic core\n(i.e. at a distance much larger than the distance between\ndifferent Dy ions in the molecule), one expects that at low\ntemperatures the static dipolar field experienced by the\nmuons will decrease and vanish as the magnetic moment\nof Dy3 decreases at low temperature. However, since\nmuons senses a strong non-vanishing static field at low\ntemperatures (up to ∆0 ∼ 0.45 T), we conclude that the\n\nmuons occupy sites which are close to the magnetic core,\nand therefore are sensitive to the microscopic magnetic\nstructure of the molecules. One such possibility is a site\nnear the Cl ion shown in Fig. 1. This site is negatively\ncharged and therefore may attract the positively charged\nimplanted muons. On this site, the dipolar fields from the\n3 individual Dy ions do not cancel each other even if the\nDy3+ moments are arranged in a nonmagnetic ground\nstate configuration. Instead, the Dy3+ closest to the Cl\ncontributes mostly to the magnetic field experienced by\nthe muon (roughly 20 times larger). For example, assuming ∆0 is due to a dipolar field of a single Dy3+ moment\nwe expect that the distance between this moment and\nits neighboring muon is roughly ∼ 5 Å. This distance is\nsimilar to that between the Cl mentioned above and its\nneighboring Dy3+ (∼ 2.7 Å). Therefore, we conclude that\nthis static field is direct evidence of the slow relaxation of\nindividual Dy3 moments, which can be associated with\nsingle Dy3+ ion anisotropy [12].\nThese measurements exhibits the power of a local\nprobe measurement and its advantages over conventional\nbulk magnetization measurements in resolving the magnetic properties of individual magnetic molecules, and\nthe microscopic magnetic structure in general. Moreover,\nthe observed local static magnetic fields, despite the nonmagnetic ground state, reflect the peculiar nature of the\nspin vortex arrangement and the Ising/classical type interactions between the spins which give a nonmagnetic\ndoublet, i.e. two distinct magnetic states. Although\nmuons cannot detect the sense of chirality of the ground\nstate, they provide evidence of its static magnetic nature.\nNext, we investigate the dynamic properties of the local field experienced by the implanted muons. As we\nmentioned earlier, the low temperature relaxation λ can\nbe used to extract the fluctuation time τ of the local\nfield. In Fig. 5 we plot τ as a function of temperatures\n(below ∼ 25 K where ∆ > λ). We find that τ ∼ 0.1\nμs at ∼ 20 K, increases gradually as the temperature is\ndecreased and saturates at ∼ 0.55 μs below ∼ 4 K. These\nfluctuations are due to fluctuations of the Dy3+ magnetic\nmoments near the stopping site of the muon. In a very\nsimplified picture, muons are sensitive to τ only when it\nis shorter than the muon's lifetime (τμ = 2.2 μs). When\nτ >\n∼ τμ we expect the muon to experience a static field\ncomponent. This is consistent with the extracted values\nof τ ; in the range of a fraction of a μs. In contrast to\nthis scale of dynamics, ac susceptibility measurements of\nthe relaxation time of the magnetization at zero applied\nfield have shown that it follows an Arrhenius law [12]\n0\nτm = τm\nexp(Um /T ),\n\n(3)\n\n0\nwhere τm\n= 2.5(5) × 10−7 s and Um = 36(2) K. The similarity between the temperature dependence of our results\nand those extracted from ac susceptibility is striking.\nHowever, the low temperature saturation value of the\nfluctuation time is an order of magnitude longer in the\n\n\f4\n5\n\nT [K]\n\nCONCLUSIONS\n\nτ [μs]\n\n2515 10\n1\n\n0.1\n0.1\n\n0.2\n\n0.3\n\n1/T [K]\n\n0.4\n\n0.5\n\n0.6\n\nFIG. 5: (color online) The fluctuation time of the local field\nexperienced by muons as a function of temperature. The\ndashed lines indicate the range of parameters for fits to Arrhenius law.\n\nac susceptibility measurements. For comparison, fits of τ\nin the range 10-25 K to Eq. (3) yield an activation barrier\nU = 27 − 39 K and attempt time τ 0 = (1.4 − 2.5) × 10−8\ns (dashed lines in Fig. 5). This discrepancy indicates\nthat although both μSR and ac susceptibility measurements confirm the slow relaxation of the magnetization,\nthe scale of dynamics measured in both techniques is different. However, given that these techniques are very\ndifferent and have different temporal sensitivity, there\nare two possible explanations of the discrepancy. One\npossibility is that while the dynamics measured with ac\nsusceptibility are those of collective bulk magnetization,\nμSR measures fluctuations of of individual molecules or\nDy3+ moments within it. For example, studies in Ni10\nmagnetic molecules have shown that while ac susceptibility exhibits slow relaxation of bulk magnetization, nuclear magnetic resonance (NMR) measurements confirm\nthe presence of fast single molecule dynamics [25, 26].\nThis was interpreted as slowing down of the bulk magnetization due to a resonant phonon trapping mechanism\nwhich prevents thermalization of the bulk magnetization\nbut allows fast spin flipping of the individual molecular\nmoments [26]. Another possibility is that each techniques\nis sensitive to a different dynamic process, which may not\nbe even related. The dynamics of the bulk magnetization\nwas associated to fluctuations of the Dy3 magnetization\nin the plane of the Dy3+ triangle. However, fluctuations\nout of the plane cannot be ruled out. This type of fluctuations may be faster, and therefore more effective in\ncausing muon spin lattice relaxation. We believe that\nNMR measurements in Dy3 should be sensitive to both\nscales of dynamics, and therefore would provide valuable\ninformation that could clarify the discrepancy between\nbulk magnetization measurements and μSR.\n\nIn conclusion, we find that muons implanted in Dy3\nobserve a fluctuating field at high temperatures. Below\n∼ 35 K the local field has two components, static and\ndynamic. Bulk magnetization and heat capacity measurements rule out the existence of long range ordering\nassociated with the observed temperature dependence of\nthe local field. Instead, the observed static local magnetic field is direct evidence of the slow relaxation of\nthe magnetization. Our measurements exhibit that in\nspite of the peculiar nature of the Dy3+ spins vortex arrangement which produces a nonmagnetic doublet, a local probe such as muons can detect their static magnetic\nnature. Therefore, although no net magnetic moment\nis present, they can be used, in principle, to store magnetic information (sense of chirality) with the advantage\nof long coherence time due to the small intermolecular\ndipolar couplings. Finally, we find that the time scale\nof low temperature dynamics detected with μSR is an\norder of magnitude shorter than that extracted from ac\nsusceptibility measurements. The different time scale of\ndynamics could be due to the sensitivity of the different\ntechniques to different relaxation processes or a difference\nbetween fluctuations of collective individual moments.\nWe would like to thank Andreas Suter for reading the\nmanuscript and helpful discussions. This work was performed at the Swiss Muon Source (SμS), at the Paul\nScherrer Institute in Villigen, Switzerland.\n\n∗\nElectronic address: zaher.salman@psi.ch\n[1] D. Gatteschi, R. Sessoli, and J. Villain, Molecular Nanomagnets (Oxford University Press, 2006).\n[2] R. Sessoli, D. Gatteschi, A. Caneschi, and M. Novak,\nNature 365, 141 (1993).\n[3] J. R. Friedman, M. P. Sarachik, J. Tejada, and R. Ziolo,\nPhys. Rev. Lett. 76, 3830 (1996).\n[4] L. Thomas, F. Lionti, R. Ballou, D. Gatteschi, R. Sessoli,\nand B. Barbara, Nature (London) 383, 145 (1996).\n[5] W. Wernsdorfer and R. Sessoli, Science 284, 133 (1999).\n[6] W. Wernsdorfer, R. Sessoli, A. Caneschi, D. Gatteschi,\nand A. Cornia, Europhys. Lett. 50, 552 (2000).\n[7] E. del Barco, A. D. Kent, E. C. Yang, and D. N. Hendrickson, Phys. Rev. Lett. 93, 157202 (2004).\n[8] A. Morello, P. C. E. Stamp, and I. S. Tupitsyn, Phys.\nRev. Lett. 97, 207206 (2006).\n[9] S. Bertaina, S. Gambarelli, T. Mitra, B. Tsukerblat,\nA. Müller, and B. Barbara, Nature 453, 203 (2008).\n[10] A. Ardavan, O. Rival, J. J. L. Morton, S. J. Blundell,\nA. M. Tyryshkin, G. A. Timco, and R. E. P. Winpenny,\nPhys. Rev. Lett. 98, 057201 (2007).\n[11] J. Tang, I. Hewitt, N. T. Madhu, G. Chastanet,\nW. Wernsdorfer, C. E. Anson, C. Benelli, R. Sessoli, and\nA. K. Powell, Angew. Chem. Int. Ed. 45, 1729 (2006).\n[12] J. Luzon, K. Bernot, I. J. Hewitt, C. E. Anson, A. K.\nPowell, and R. Sessoli, Phys. Rev. Lett. 100, 247205\n\n\f5\n(2008).\n[13] S. L. Lee, S. H. Kilcoyne, and R. Cywinski, Muon Science\n(SUSSP and Institute of Physics Publishing, 1998).\n[14] R. S. Hayano, Y. J. Uemura, J. Imazato, N. Nishida,\nT. Yamazaki, and R. Kubo, Phys. Rev. B 20, 850 (1979).\n[15] Y. J. Uemura, T. Yamazaki, D. R. Harshman, M. Senba,\nand E. J. Ansaldo, Phys. Rev. B 31, 546 (1985).\n[16] Y. J. Uemura, in Muon Science: Muons in Physics,\nChemistry and Materials, edited by S. Lee, S. Kilcoyne,\nand R. Cywinski (SUSSP and Institute of Physics Publishing, 1998), chap. 4.\n[17] Y. Fudamoto, I. M. Gat, M. I. Larkin, J. Merrin,\nB. Nachumi, A. T. Savici, Y. J. Uemura, G. M. Luke,\nK. M. Kojima, M. Hase, et al., Phys. Rev. B 65, 174428\n(2002).\n[18] Simulations show that the dynamic LKT and the phenomenological function ALKT (t)e−λt are identical when\n∆ > λ.\n[19] A. Lascialfari, Z. H. Jang, F. Borsa, P. Carretta, and\nD. Gatteschi, Phys. Rev. Lett. 81, 3773 (1998).\n[20] Z. Salman, A. Keren, P. Mendels, V. Marvaud,\nA. Scuiller, M. Verdaguer, J. S. Lord, and C. Baines,\n\nPhys. Rev. B 65, 132403 (2002).\n[21] S. J. Blundell, F. L. Pratt, T. Lancaster, I. M. Marshall,\nC. A. Steer, S. L. Heath, J. F. Letard, T. Sugano, D. Mihailovic, and A. Omerzu, Polyhedron 22, 1973 (2003).\n[22] F. Branzoli, M. Filibian, P. Carretta, S. Klyatskaya, and\nM. Ruben, Phys. Rev. B 79, 220404 (2009).\n[23] G. M. Kalvius, D. R. Noakes, and O. Hartmann, in Handbook on the Physics and Chemistry of Rare Earths, edited\nby G. Lander, K. Gschneider, and L. Eyring (Elsevier,\n2001), vol. 32, p. 55.\n[24] Z. Salman, T. J. Parolin, K. H. Chow, T. A. Keeler, R. I.\nMiller, D. Wang, , and W. A. MacFarlane, Phys. Rev. B\n73, 174427 (2006).\n[25] S. Carretta, P. Santini, G. Amoretti, M. Affronte,\nA. Candini, A. Ghirri, I. S. Tidmarsh, R. H. Laye,\nR. Shaw, and E. J. L. McInnes, Phys. Rev. Lett. 97,\n207201 (2006).\n[26] M. Belesi, E. Micotti, M. Mariani, F. Borsa, A. Lascialfari, S. Carretta, P. Santini, G. Amoretti, E. J. L.\nMcInnes, I. S. Tidmarsh, et al., Phys. Rev. Lett. 102,\n177201 (2009).\n\n\f"}