{"id": "http://arxiv.org/abs/1012.5783v1", "guidislink": true, "updated": "2010-12-28T16:04:27Z", "updated_parsed": [2010, 12, 28, 16, 4, 27, 1, 362, 0], "published": "2010-12-28T16:04:27Z", "published_parsed": [2010, 12, 28, 16, 4, 27, 1, 362, 0], "title": "Uniqueness of models in persistent homology: the case of curves", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1012.1138%2C1012.6042%2C1012.4549%2C1012.3509%2C1012.4244%2C1012.0438%2C1012.3295%2C1012.0609%2C1012.5342%2C1012.4080%2C1012.3197%2C1012.5235%2C1012.3662%2C1012.4517%2C1012.5116%2C1012.5306%2C1012.4325%2C1012.0806%2C1012.2063%2C1012.3433%2C1012.5040%2C1012.0523%2C1012.0054%2C1012.1082%2C1012.4627%2C1012.2692%2C1012.5753%2C1012.1913%2C1012.3036%2C1012.2421%2C1012.1290%2C1012.5783%2C1012.3550%2C1012.3284%2C1012.1796%2C1012.1460%2C1012.2250%2C1012.1229%2C1012.5278%2C1012.6045%2C1012.1742%2C1012.0716%2C1012.5512%2C1012.0736%2C1012.2528%2C1012.0657%2C1012.4016%2C1012.1829%2C1012.1800%2C1012.0117%2C1012.5622%2C1012.1991%2C1012.0144%2C1012.4020%2C1012.1328%2C1012.0915%2C1012.5089%2C1012.3668%2C1012.6018%2C1012.4844%2C1012.1193%2C1012.5423%2C1012.4926%2C1012.3586%2C1012.3923%2C1012.5021%2C1012.1601%2C1012.0103%2C1012.4870%2C1012.0490%2C1012.3238%2C1012.1634%2C1012.0883%2C1012.4441%2C1012.1338%2C1012.0124%2C1012.2873%2C1012.1422%2C1012.0871%2C1012.2973%2C1012.5688%2C1012.4132%2C1012.5638%2C1012.1099%2C1012.1580%2C1012.0098%2C1012.5415%2C1012.5384%2C1012.1024%2C1012.1147%2C1012.3220%2C1012.4415%2C1012.5698%2C1012.4856%2C1012.4538%2C1012.5912%2C1012.1025%2C1012.4910%2C1012.3364%2C1012.3459%2C1012.5605&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Uniqueness of models in persistent homology: the case of curves"}, "summary": "We consider generic curves in R^2, i.e. generic C^1 functions f from S^1 to\nR^2. We analyze these curves through the persistent homology groups of a\nfiltration induced on S^1 by f. In particular, we consider the question whether\nthese persistent homology groups uniquely characterize f, at least up to\nre-parameterizations of S^1. We give a partially positive answer to this\nquestion. More precisely, we prove that f=goh, where h:S^1-> S^1 is a\nC^1-diffeomorphism, if and only if the persistent homology groups of sof and\nsog coincide, for every s belonging to the group Sigma_2 generated by\nreflections in the coordinate axes. Moreover, for a smaller set of generic\nfunctions, we show that f and g are close to each other in the max-norm (up to\nre-parameterizations) if and only if, for every s belonging to Sigma_2, the\npersistent Betti numbers functions of sof and sog are close to each other, with\nrespect to a suitable distance.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1012.1138%2C1012.6042%2C1012.4549%2C1012.3509%2C1012.4244%2C1012.0438%2C1012.3295%2C1012.0609%2C1012.5342%2C1012.4080%2C1012.3197%2C1012.5235%2C1012.3662%2C1012.4517%2C1012.5116%2C1012.5306%2C1012.4325%2C1012.0806%2C1012.2063%2C1012.3433%2C1012.5040%2C1012.0523%2C1012.0054%2C1012.1082%2C1012.4627%2C1012.2692%2C1012.5753%2C1012.1913%2C1012.3036%2C1012.2421%2C1012.1290%2C1012.5783%2C1012.3550%2C1012.3284%2C1012.1796%2C1012.1460%2C1012.2250%2C1012.1229%2C1012.5278%2C1012.6045%2C1012.1742%2C1012.0716%2C1012.5512%2C1012.0736%2C1012.2528%2C1012.0657%2C1012.4016%2C1012.1829%2C1012.1800%2C1012.0117%2C1012.5622%2C1012.1991%2C1012.0144%2C1012.4020%2C1012.1328%2C1012.0915%2C1012.5089%2C1012.3668%2C1012.6018%2C1012.4844%2C1012.1193%2C1012.5423%2C1012.4926%2C1012.3586%2C1012.3923%2C1012.5021%2C1012.1601%2C1012.0103%2C1012.4870%2C1012.0490%2C1012.3238%2C1012.1634%2C1012.0883%2C1012.4441%2C1012.1338%2C1012.0124%2C1012.2873%2C1012.1422%2C1012.0871%2C1012.2973%2C1012.5688%2C1012.4132%2C1012.5638%2C1012.1099%2C1012.1580%2C1012.0098%2C1012.5415%2C1012.5384%2C1012.1024%2C1012.1147%2C1012.3220%2C1012.4415%2C1012.5698%2C1012.4856%2C1012.4538%2C1012.5912%2C1012.1025%2C1012.4910%2C1012.3364%2C1012.3459%2C1012.5605&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We consider generic curves in R^2, i.e. generic C^1 functions f from S^1 to\nR^2. We analyze these curves through the persistent homology groups of a\nfiltration induced on S^1 by f. In particular, we consider the question whether\nthese persistent homology groups uniquely characterize f, at least up to\nre-parameterizations of S^1. We give a partially positive answer to this\nquestion. More precisely, we prove that f=goh, where h:S^1-> S^1 is a\nC^1-diffeomorphism, if and only if the persistent homology groups of sof and\nsog coincide, for every s belonging to the group Sigma_2 generated by\nreflections in the coordinate axes. Moreover, for a smaller set of generic\nfunctions, we show that f and g are close to each other in the max-norm (up to\nre-parameterizations) if and only if, for every s belonging to Sigma_2, the\npersistent Betti numbers functions of sof and sog are close to each other, with\nrespect to a suitable distance."}, "authors": ["Patrizio Frosini", "Claudia Landi"], "author_detail": {"name": "Claudia Landi"}, "author": "Claudia Landi", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1088/0266-5611/27/12/124005", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1012.5783v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1012.5783v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "15 pages, 7 figures", "arxiv_primary_category": {"term": "math.AT", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "math.AT", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "cs.CG", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "55N35, 53A04, 68U05", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1012.5783v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1012.5783v1", "journal_reference": null, "doi": "10.1088/0266-5611/27/12/124005", "fulltext": "arXiv:1012.5783v1 [math.AT] 28 Dec 2010\n\nUniqueness of models in persistent homology: the\ncase of curves\nP Frosini1,3 , C Landi2,3\n1\n\nDipartimento di Matematica, Università di Bologna, Italy\nDipartimento di Scienze e Metodi dell'Ingegneria, Università di Modena e Reggio\nEmilia, Italy\n3\nARCES, Università di Bologna, Italy\n\n2\n\nE-mail: frosini@dm.unibo.it, clandi@unimore.it\nAbstract. We consider generic curves in R2 , i.e. generic C 1 functions f : S 1 → R2 .\nWe analyze these curves through the persistent homology groups of a filtration induced\non S 1 by f . In particular, we consider the question whether these persistent homology\ngroups uniquely characterize f , at least up to re-parameterizations of S 1 . We give a\npartially positive answer to this question. More precisely, we prove that f = g ◦ h,\nwhere h : S 1 → S 1 is a C 1 -diffeomorphism, if and only if the persistent homology\ngroups of s ◦ f and s ◦ g coincide, for every s belonging to the group Σ2 generated by\nreflections in the coordinate axes. Moreover, for a smaller set of generic functions, we\nshow that f and g are close to each other in the max-norm (up to re-parameterizations)\nif and only if, for every s ∈ Σ2 , the persistent Betti numbers functions of s ◦ f and s ◦ g\nare close to each other, with respect to a suitable distance.\n\nAMS classification scheme numbers: 55N35, 53A04, 68U05\n\nKeywords: Persistent Betti numbers, reflections, matching distance\n\nSubmitted to: Inverse Problems\n\n1. Introduction\nPersistent homology is a widely studied tool in Topological Data Analysis. It is based\non investigating topological spaces by growing a space (i.e., the data to be studied)\nincrementally, and by analyzing the topological changes that occur during this growth.\nThe occurrence and placement of topological events (e.g., creation, merging, cancellation\nof the connected components of the lower level sets) within the history of this growth\ndescribe the essential geometrical properties of the data. Persistent homology aims to\ndefine a scale of the relevance of these topological events, where the longer the lifetime\nof a feature produced by a topological event, the more significant the event.\n\n\fUniqueness of models in persistence homology\n\n2\n\nAn area of application of the persistent homology theory in TDA is shape\ndescription [16, 6]. In this setting the studied topological space X represents the\nobject whose shape is under study, and its shape is analyzed my means of a vectorvalued function f defined on it. This function corresponds to measurements on the data\ndepending on the shape properties of interest (e.g., elongation, bumpiness, curvature,\nand so on). This function is then used to filter the space by lower level sets. The\npersistent homology of this filtration gives insights on the shape of X as seen through\nf . In particular, persistence diagrams, i.e. multisets of points of the plane encoding the\nrank of persistence homology groups, constitute a shape descriptor, or a signature, of\n(X, f ) (cf. [5]).\nWe recall that while an object representation (either pixel- or vector-based) contains\nenough information to reconstruct (an approximation to) the object, a description only\ncontains enough information to identify an object as a member of some class, usually by\nmeans of a dissimilarity measure. The representation of an object is thus more detailed\nand accurate than a description, whereas the description is more concise and conveys\nan elaborate and composite view of the object class.\nIn the illustrated framework, two objects X and Y belong to the same class if they\nbehave in a similar way with respect to the chosen shape property represented by the\ncontinuous functions f : X → Rk and g : Y → Rk . More formally, (X, f ) and (Y, g)\nbelong to the same object class if and only if there is a homeomorphism h : X → Y\nsuch that f = g ◦ h. This condition immediately implies that (X, f ) and (Y, g) have\nthe same persistent homology groups, while it is easy to give examples showing that in\ngeneral this implication cannot be reversed.\nUntil now, research has been mainly focused on direct problems, such as, given X\nand f , computing persistence diagrams, establishing stability properties of persistence\ndiagrams, choosing functions in order to impose desired invariance properties.\nAs far as inverse problems are concerned in this setting, there have been some\nattempts to study the problem of existence of models in persistence homology. For\nexample, confining our attention to the 0th homology degree and k = 1, it is known\nunder which conditions a multiset of points of the plane is the persistent diagram of\nsome space X endowed with some function f : X → R. Furthermore, it is possible to\nexplicitly construct a space X and a function f having a prescribed persistence diagram,\ni.e. a model for a given persistence diagram. For more details about this line of research\nwe refer the reader to [7]. Moreover, a realization result for finite persistence models is\nstated in [4].\nIn this paper we will tackle the inverse problem related to the uniqueness of the\nmodel. What does uniqueness mean in this setting? It means that there is exactly one\nmodel with given persistent homology groups up to the equivalence relation for which\n\"(X, f ) and (Y, g) are equivalent if and only if there is a homeomorphism h : X → Y\nsuch that f = g ◦ h\".\nWe underline that different formulations of uniqueness would give rise to either\nimpossible or trivial problems. Indeed, in general, it is false that if (X, f ) and (X, g)\n\n\fUniqueness of models in persistence homology\n\n3\n\nhave the same persistent homology groups then necessarily f = g. On the other hand,\nit is easy to see that, for any space X ⊆ R2 , taking the function f : X → R4 defined by\nf (x, y) = (x, −x, y, −y), the persistent homology groups of (X, f ) uniquely determine\nX. However, this would not be a satisfactory solution of the uniqueness problem, in\nfirst place because it would work with only one prescribed function f ; in second place\nbecause in pattern recognition the focus is generally on parametrization-independent\nshape comparison methods (cf, e.g., [15]).\nOur uniqueness problem is clearly strictly related to the decision problem in shape\nmatching, that is, given two patterns, deciding whether there exists a transformation\ntaking one pattern to the other pattern. Rephrased differently, we wish to study to\nwhich an extent persistent homology can give rise to complete shape invariants.\nWe also observe that the problem of deciding whether two functions are obtained\none from the other by a re-parameterization is also strictly related to the concept of\nnatural pseudo-distance between the pairs (X, f ) and (Y, g) (we refer the interested\nreader to [12, 9, 10, 11]).\nAs the reader can guess, this subject is not simple. We know well that homology is\nnot sufficient to reconstruct a manifold up to diffeomorphisms, and clearly also persistent\nhomology has analogous limitations. Indeed, several examples in this paper prove that\nsome kind of indeterminacy and non-uniqueness is unavoidable, also in the case of\ncurves, i.e. when X = S 1 . However, in this paper we can show that the situation is\nnot so negative as it could appear at a first glance. In particular, we shall prove that,\nat least in the case of generic curves, in the differentiable category, persistent homology\nprovides sufficient information to identify the studied function up to diffeomorphisms\nof S 1 (Theorem 4.1). Moreover, we show that, under mild assumptions, the proximity\nbetween persistent Betti numbers functions of two curves implies proximity between the\ncurves themselves (Theorem 4.5).\n2. Notations and basic definitions\nIn this paper we confine ourselves to study the uniqueness of models when X is a onedimensional manifold without boundary, in the C 1 -differentiable case. Since any such\ncurve X is diffeomorphic to the standard circle S 1 , choosing a fixed diffeomorphism from\nX to S 1 , we can confine our study to the case X = S 1 . Therefore, our problem can be\nrestated as follows: is it true that, given two functions f and g on S 1 , the associated\npersistent homology groups coincide if and only if g is a re-parameterization of f ?\nIn order to deal with our uniqueness problem we will use only the rank of 0th\npersistent homology groups but in a bi-dimensional setting, that is to say bi-dimensional\nsize functions [1]. We recall here their basic definitions, as a particular case of the more\ngeneral theory of multidimensional persistence (cf. [4]).\nFor any point u = (u1 , u2 ) ∈ R2 , we denote by D u the set {w = (w1 , w2) ∈ R2 :\nw1 ≤ u1 ∧ w2 ≤ u2 }. For any continuous function f = (f1 , f2 ) : S 1 → R2 and u ∈ R2 ,\nwe can consider the bi-filtration of S 1 given by {f −1 (D u )}u∈R2 . The symbol ∆+ will\n\n\fUniqueness of models in persistence homology\n\n4\n\ndenote the open set {(u, v) ∈ R2 × R2 : u1 < v1 ∧ u2 < v2 }.\nDefinition 2.1. For any (u, v) ∈ ∆+ , the 0th bi-dimensional persistent homology group\nof f at (u, v) is the group\nH0u,v (f ) = im H0 (f −1 (D u ) ֒→ f −1 (D v )),\nwhere f −1 (D u ) ֒→ f −1 (D v ) is the inclusion map.\nHere the considered homology theory is the Čech one, with real coefficients. In\nplain words, the rank of H0u,v (f ) is equal to the number of connected components of\nf −1 (D v ) that contain at least one point in f −1 (D u ). We remark that, since S 1 is a\ncompact manifold, for any continuous function f : S 1 → R2 , its persistent homology\ngroups are finitely generated [3]. Hence, their rank, also known as a persistent Betti\nnumber, is finite.\nIn order to make our treatment more readable, we shall use the same symbol θ to\ndenote both each point of S 1 , and the local parameterization of S 1 that we shall use\nin derivatives. This requires a little abuse of notation since, rigorously speaking, we\nshould denote the points in S 1 by equivalence classes of angles θ ∈ R (equivalent up to\nmultiples of 2π). We also assume that θ is counterclockwise increasing.\n3. Generic assumptions on functions\nWe begin by presenting some negative examples. In these examples we add more and\nmore assumptions showing that without those assumptions the model uniqueness fails.\nWe will end with two conditions (C1), (C2) on the functions f, g defined on S 1 that,\nas we will show in the next section, are sufficient to guarantee uniqueness. We end\nthis section showing that the set of functions satisfying conditions (C1), (C2) is dense\nin C 1 (S 1 , R2 ). In other words, we will prove the model uniqueness for a generic set of\nfunctions defined on simple curves. Let us remark that, although we are assuming that\nX is a simple curve (indeed diffeomorphic to S 1 ), the considered functions f defined on\nX can give rise to multiple points.\nThe first example, illustrated in Figure 1, shows two simple closed curves X (left)\nand Y (right) endowed with continuous functions f : X → R and g : Y → R, such\nthat the persistent homology groups of f and g coincide at every (u, v) ∈ ∆+ (center).\nHowever there does not exist any C 1 -diffeomorphism h : X → Y such f = g ◦ h. Indeed,\na C 1 -diffeomorphism h : X → Y such that f = g ◦ h should take critical points of f into\ncritical points of g preserving their values and adjacencies. This is clearly impossible.\nIt is interesting to note that also changing the functions f and g into their opposite,\nthe closed curves X, Y cannot be distinguished. Indeed, also the persistent homology\ngroups of −f and −g coincide at every (u, v) ∈ ∆+ . Obviously, there does not exist any\nC 1 -diffeomorphism h : X → Y such that −f = −g ◦ h (see Figure 2).\nThese two examples suggest us to consider vector-valued rather than scalar\nfunctions. A similar (but slightly more complicated) example is exhibited in [2].\n\n\fUniqueness of models in persistence homology\nv\nf\n\ne\nd\nc\nSfrag replacements b\na\n\n2\n\ng\n\nY\n\nu\n\nc d e\n\na b\n\ne\nd\nc\nb\na\n\n3\n\n0 1\n\nX\n\n5\n\nFigure 1. The curves X (left) and Y (right), endowed with the continuous functions\nf : X → R and g : Y → R respectively, cannot be distinguished by the persistent\nhomology groups of f and g, as their ranks coincide everywhere in ∆+ (center).\n\nv\n−f\n\n−g\n\nu\n\n−b\n−c\n−d\n−e\nm\n\n2\n0 1\n\n3\n\nX\n\n−b\n−c\n−d\n−e\nm\n\nY\n\n−b\n−c\n−d\n−e\nm\n\nFigure 2. The curves X, Y endowed with the continuous functions −f : X → R and\n−g : Y → R cannot be distinguished by the persistent homology groups of −f and −g.\n\nThe second example, illustrated in Figure 3, shows the image of two functions\nf, g : S 1 → R2 such that the persistent homology groups of f and g coincide at every\n(u, v) ∈ ∆+ , as can be checked by a direct computation. However, there does not exist\nany C 1 -diffeomorphism h : S 1 → S 1 such that f = g ◦ h because f (S 1 ) 6= g(S 1 ).\nf2\n\ng2\n\nPSfrag replacements\n\nf1\n\ng1\n\nFigure 3. The curves f = (f1 , f2 ) : S 1 → R2 and g = (g1 , g2 ) : S 1 → R2 cannot be\ndistinguished by their persistent homology groups.\n\n\fUniqueness of models in persistence homology\n\n6\n\nThis example suggests us that it is not enough to require that H0u,v (f ) = H0u,v (g)\nfor every (u, v) ∈ ∆+ , but we should take stronger assumptions such as that also\nH0u,v (s ◦ f ) = H0u,v (s ◦ g) for every (u, v) ∈ ∆+ , and every s : R2 → R2 obtained\nvia composition of reflections with respect to the coordinate axes.\nThe last example shows that, even under these stronger assumptions, the model\nuniqueness fails, and suggests us to add the assumption that there are no two distinct\npoints θ1 , θ2 in S 1 such that f (θ1 ) = f (θ2 ) and im dθ1 f = im dθ2 f . Indeed, the\ncurves f = (f1 , f2 ) : S 1 → R2 and g = (g1 , g2 ) : S 1 → R2 illustrated in Figure 4\ncannot be distinguished by their persistent homology groups, as can be seen by direct\ncomputations. However, no C 1 -diffeomorphism h : S 1 → S 1 exists such that f = g ◦ h.\nIndeed, if it were the case, h should take the two points θ1 , θ2 where f2 takes its minimum\ninto the two points θ̃1 , θ̃2 were g2 takes its minimum, and an arc between θ1 and θ2 into\nan arc between θ̃1 and θ̃2 . It is easy to see that, for any possible choice of these arcs,\nthe image through g would not coincide with that through f .\n\nSfrag replacements\n\ng2\nPSfrag\nreplacements\n\nf2\nf1\n\nSfrag replacements\n\ng1\n\nPSfrag\nreplacements\n−g\n2\n\n−f2\n\nf1\n\ng1\n\ng2\n\nf2\n\n−g1\n\n−f1\n\n−g2\n\n−f2\n\n−f1\n\nFigure 4. The curves f = (f1 , f2 ) : S 1 → R2 and g = (g1 , g2 ) : S 1 → R2 cannot be\ndistinguished by their persistent homology groups. Analogously for the pairs of curves\ns1 ◦ f = (−f1 , f2 ) and s1 ◦ g = (−g1 , g2 ), s2 ◦ f = (f1 , −f2 ) and s2 ◦ g = (g1 , −g2 ),\ns2 ◦ s1 ◦ f = (−f1 , −f2 ) and s2 ◦ s1 ◦ g = (−g1 , −g2 ).\n\nThese examples lead us to study the uniqueness problem taking functions as in the\nfollowing definition, and assuming to have information also on the persistent homology\ngroups of the functions obtainable by composition with reflections. The choice of\nconfining ourselves to the following set of functions is not very restrictive since it is\na dense set.\nDefinition 3.1. A function f : S 1 → R2 will be called generic if it is C 1 and the\nfollowing properties hold:\n(C1) f is an immersion, i.e. dθ f has rank equal to one for every θ ∈ S 1 ;\n\n−g1\n\n\fUniqueness of models in persistence homology\n\n7\n\n(C2) f (S 1 ) has at most a finite number of multiple points, all of them are double points\nand they are clean, i.e. f (θ1 ) = f (θ2 ) and im dθ1 f = im dθ2 f imply θ1 = θ2 , for\nevery θ1 , θ2 ∈ S 1 .\nProposition 3.2. The set of generic functions is dense and open in C 1 (S 1 , R2 ).\nProof. Let us see that generic functions are dense in C 1 (S 1 , R2 ). First of all C 2 (S 1 , R2 ) is\ndense in C 1 (S 1 , R2 ) (cf. [13]). The set of C 2 -immersions of a manifold of dimension 1 into\na manifold of dimension 2 is residual as an application of the Jet Transversality Theorem,\nand, by the Multijet Transversality Theorem, also the set of functions satisfying (C2)\nis residual (cf. [8, 13]). Thus, the sets of C 2 -functions separately satisfying conditions\n(C1) and (C2) are residual in C 2 (S 1 , R2 ). Moreover, any intersection of residual sets is\nstill residual, and hence dense. As a consequence, arbitrarily close to any C 1 -function\nwe can find a C 2 -immersion (in particular of class C 1 ) satisfying (C2). So the set of\ngeneric functions is dense in C 1 (S 1 , R2 ).\nFinally, since the set of C 1 -immersions is open in C 1 (S 1 , R2 ) and the set of\nimmersions with clean double points is open in the space of C 1 -immersions (cf. [13]),\nthe set of generic functions is open in C 1 (S 1 , R2 ).\n4. Main results\nIn this section we present the main results of this paper. Theorem 4.1 answers\naffirmatively to the uniqueness problem for generic functions and assuming information\nis available also on the persistent homology groups of the functions obtainable by\ncomposition with reflections. Theorem 4.5 extends the previous result to the case when\ndata are perturbed. Roughly speaking, it states that if two functions f and g, together\nwith their composition with reflections, give rise to close persistent Betti numbers, then\nf and g are close to each other (in both cases closeness is meant with respect to a\nsuitable distance).\nLet si : R2 → R2 , with i = 1, 2, be the reflections with respect to the coordinate\naxes: s1 (x1 , x2 ) = (−x1 , x2 ), s2 (x1 , x2 ) = (x1 , −x2 ). Let Σ2 be the set of functions\nobtainable through finite composition of the reflections s1 , s2 (obviously, id ∈ Σ2 ).\nTheorem 4.1. Let f, g : S 1 → R2 be generic functions. If H0u,v (s ◦ f ) = H0u,v (s ◦ g) for\nevery (u, v) ∈ ∆+ and every s ∈ Σ2 , then there exists a C 1 -diffeomorphism h : S 1 → S 1\nsuch that g ◦ h = f .\nProof. Since f is generic, in particular it is an immersion. So, for each point θ ∈ S 1 , we\ncan consider an open neighborhood U of θ in S 1 , such that f|U is a C 1 -diffeomorphism\nonto its image. The line lθ orthogonal to the line tangent to f (U) ⊂ R2 at f (θ) is\nindependent of the neighborhood U, and depends only on the point θ. Let Nf be the\nset of all points θ of S 1 such that lθ is not parallel to the coordinate axes of R2 . The set\nNg is defined analogously.\n\n\fUniqueness of models in persistence homology\n\n8\n\nFirst of all, we shall prove that f (N̄f ) ⊆ g(S 1 ), where N̄f is the closure of Nf in\nS 1 . We observe that since f is C 1 , Nf is non-empty and open in S 1 .\nBy contradiction, let us assume that there exists a point u ∈ f (N̄f ) \\ g(S 1 ). For\nevery ǫ > 0, a point u′ ∈ f (Nf ) \\ g(S 1) exists such that ku − u′ k2 < ǫ, and u′ is not\na double point of f (S 1 ). Indeed, g(S 1) is a closed set and f is generic (in particular,\nf (S 1 ) has at most a finite number of multiple points).\nWe set θ′ = f −1 (u′ ). Clearly θ′ ∈ Nf , implying that there is an s′ ∈ Σ2 such that\ns′ (lθ′ ) has a unit direction vector w ′ = (w1′ , w2′ ) with w1′ > 0 and w2′ > 0 (see Fig. 5).\n\nFigure 5. The construction in the proof of Theorem 4.1.\n\nPSfrag replacements\n\nfˆ(γ) b\n\na\n\nv\n\ns′ (u′)\ns′ (u)\nc\n\nd\nR\n\nFigure 6. The position of the points a, b, c, d used in the proof of Theorem 4.1, with\nfˆ top-right transversal to R.\n\nWe set fˆ = s′ ◦ f and ĝ = s′ ◦ g. Because of this choice of s′ , and since\ns′ (u′ ) ∈ fˆ(S 1 ) \\ ĝ(S 1 ), an open rectangle R in R2 exists, with sides parallel to the\ncoordinate axes, such that (see Fig. 6)\ny\n\n(i) The set {θ ∈ S 1 : fˆ(θ) ∈ R} is an open connected arc γ =θ1 θ2 (clockwise oriented)\nsuch that either fˆ1 is increasing and fˆ2 is decreasing on γ, or fˆ1 is decreasing and\nfˆ2 is increasing on γ (as a consequence, the endpoints of fˆ(γ) belong to ∂R);\n\n\fUniqueness of models in persistence homology\n\n9\n\n(ii) R does not meet ĝ(S 1 ).\nIndeed, since w1′ > 0 and w2′ > 0, any non-vanishing tangent vector to fˆ(γ) must have\nat least one strictly positive component. In the following, when property (i) holds with\nrespect to a rectangle R we shall say that fˆ is top-right transversal to R.\nLet v = (v1 , v2 ) be the top-right vertex of R. By property (i), in R\\ fˆ(γ) we can take\nfour points a = (a1 , a2 ), b = (b1 , b2 ), c = (c1 , c2 ), d = (d1 , d2) with a1 = c1 < b1 = d1 < v1\nand c2 = d2 < a2 = b2 < v2 , such that a, c, d do not belong to the connected component\nof b in R \\ fˆ(γ) and the segment db contains the point s′ (u′ ).\nWe claim that\nrk H0b,v (fˆ) − rk H0d,v (fˆ) − rk H0a,v (fˆ) + rk H0c,v (fˆ) = 1.\n\n(1)\n\nIndeed, with respect to the C 1 function fˆ, the number of connected components\nthat are \"born\" between c and a and still not merged at v is one less than the number\nof those \"born\" between d and b and \"still alive\" at v. This is due to the presence of\nthe connected component containing the point s′ (u′ ).\nOn the other hand, since R ∩ ĝ(S 1 ) = ∅ we have that\nrk H0b,v (ĝ) − rk H0d,v (ĝ) − rk H0a,v (ĝ) + rk H0c,v (ĝ) = 0.\n\n(2)\n\nIndeed, with respect to the C 1 function ĝ, the number of connected components\nthat are \"born\" between c and a and still not merged at v is equal to the number of those\n\"born\" between d and b and \"still alive\" at v. This fact contradicts the assumption that\nH0u,v (s ◦ f ) = H0u,v (s ◦ g) for every (u, v) ∈ ∆+ and every s ∈ Σ2 .\nA formal proof of the equalities (1) and (2) will be given in the Appendix.\nTherefore, we have proved that f (N̄f ) ⊆ g(S 1 ). In the same way, we can prove that\ng(N̄g ) ⊆ f (S 1 ), where N̄g is the closure of Ng in S 1 .\nNow, let us prove that f (S 1 )\\f (N̄f ) ⊆ g(S 1). Let us assume that f (S 1 )\\f (N̄f ) 6= ∅,\notherwise the claim is trivial. Hence, let us take a point u ∈ f (S 1 ) \\ f (N̄f ), and θ ∈ S 1\nsuch that f (θ) = u. Let us consider the maximal open connected arc α in S 1 \\ N̄f\ncontaining θ. We shall prove that f (α) ⊂ g(S 1 ), which implies that u ∈ g(S 1 ).\nBecause of the definition of Nf and the regularity of f , f (α) is either a horizontal or\na vertical segment. Let us assume that f (α) is a horizontal segment (the other case can\nbe treated quite analogously). The arc α necessarily has two distinct endpoints θin , θout\n(listed counterclockwise). Possibly by changing f into f ̃ = s1 ◦ f , and g into g̃ = s1 ◦ g,\nwe can also assume that the horizontal segment α proceeds from left to right while the\nparameter θ increases. We observe that Nf = Nf ̃ and Ng = Ng̃ .\nThe points f (θin ), f (θout ) are the endpoints of the horizontal segment f (α). Since\nf is C 1 we have that im dθin f is a horizontal line. Because of the maximality of α, we\ncan find a sequence (θi ) of points of Nf converging counterclockwise to θin . We already\nknow that for each θi a point θi′ exists such that g(θi′ ) = f (θi ). Possibly by extracting\na subsequence, we can assume that (θi′ ) converges to a point θ′ . Since f and g are\ncontinuous, we get f (θin ) = g(θ′ ). Furthermore, the equalities g(θi′ ) = f (θi ) imply that\nthere is a sequence of coinciding incremental ratios for f and g. Since f and g are C 1 , we\n\n\fUniqueness of models in persistence homology\n\n10\n\nthus get that im dθin f = im dθ′ g, and hence both of these lines are horizontal. Possibly\nby substituting θ with −θ as a parameter for g, we can also assume that the parallel\ndf\n(θin ) and dg\n(θ′ ) have the same sense. We observe that the\nand non-vanishing vectors dθ\ndθ\npassage from g(θ) to g(−θ) does change neither g(S 1 ) nor Ng .\nNow we consider the last point θ∗ in the closure of α (orienting α from θin to θout )\nverifying the following property:\n• For every point θ̄ in the (possibly degenerate) closed arc from θin to θ∗ , a point θ̄′\ndf\n(θ̄) and dg\n(θ̄′ ) are\nexists for which f (θ̄) = g(θ̄′ ), and the non-vanishing vectors dθ\ndθ\nparallel and have the same sense.\nWe have seen that at least θin satisfies this property. We can prove that θ∗ = θout . In\norder to do this, let us assume that θ∗ 6= θout and show that this implies a contradiction.\ndf\nLet θ′∗ be a point in S 1 such that f (θ∗ ) = g(θ′∗ ) and dθ\n(θ∗ ) and dg\n(θ′∗ ) are parallel and\ndθ\nhave the same sense.\nIn case there is no sequence of points of Ng converging clockwise to θ′∗ , any\nsufficiently small open arc β whose closure β̄ contains θ′∗ as a start point (with β̄\ncounterclockwise oriented) is such that β̄ ⊂ S 1 \\ N̄g . By recalling that im dθ′∗ g is a\nhorizontal line, we get that g(β̄) is a horizontal segment. Since θ∗ 6= θout and f (α)\nis a horizontal segment, the point g(θ′∗ ) = f (θ∗ ) does not equal f (θout ). Therefore,\ng(β̄) ⊂ f (α) for any sufficiently small β, contradicting the definition of θ∗ .\nLet us now consider the case when a sequence (θi′ ) of points of Ng converges\nclockwise to θ′∗ . Because of the definition of the set Ng , possibly perturbing each point\nin the sequence, we can assume that no point g(θi′ ) belongs to f (ᾱ) (where ᾱ denotes\nthe closure of the arc α). We already know that, for each θi′ , a point θ̂i exists such that\nf (θ̂i ) = g(θi′ ). Possibly by extracting a subsequence, we can assume that (θ̂i ) converges\nto a point θ̂. Since f and g are continuous, we get that g(θ′∗ ) = f (θ̂). Now, either\nθ̂ = θ∗ or θ̂ 6= θ∗ .\nLet θ̂ = θ∗ . Since θ∗ 6= θout , (θ̂i ) converges to θ̂ counterclockwise. We recall that\ndf\n(θ∗ ) and dg\n(θ′∗ ) are both non-vanishing horizontal vectors pointing to the right. This\ndθ\ndθ\ncontradicts the fact that\ng(θ ′∗ )−g(θ ′ )\nlimi→∞ θ′∗ −θ′ i\ni\n\n=\n\ndf\n(θ∗ )\ndθ\n\ndg ′∗\n(θ )\ndθ\n∗\n\nand\n\n= limi→∞\nθ ′∗ −θi′\nθ̂−θ̂i\n\nf (θ̂)−f (θ̂i )\nθ̂−θ̂i\n\n= limi→∞\n\ng(θ ′∗ )−g(θi′ )\nθ ′∗ −θi′\n\n*\n\nθ ′∗ −θi′\n,\nθ̂−θ̂i\n\nbecause\n\n< 0 for every i sufficiently large.\n\nNow, let θ̂ 6= θ . The equalities f (θ̂i ) = g(θi′ ) imply that there is a sequence of\ncoinciding incremental ratios for f and g. Since f and g are C 1 , we thus get that\nim dθ′∗ g = im dθ̂ f . Now, the equalities f (θ∗ ) = g(θ′∗ ) and im dθ∗ f = im dθ′∗ g imply that\nf (θ∗ ) = f (θ̂) and im dθ∗ f = im dθ̂ f , with θ̂ 6= θ∗ . This contradicts the assumption that\nthe double points of f are clean (property (C2)).\nTherefore, in any case the assumption θ∗ 6= θout implies a contradiction, so that it\nmust be θ∗ = θout . Hence the inclusion f (α) ⊂ g(S 1) is proven.\nTherefore, we have proved that f (S 1 ) \\ f (N̄f ) ⊆ g(S 1 ). In the same way, we can\nprove that g(S 1 ) \\ g(N̄g ) ⊆ f (S 1 ).\nIn conclusion, we have proved that f (S 1 ) = g(S 1 ).\n\n\fUniqueness of models in persistence homology\n\n11\n\nLet us now construct the C 1 -diffeomorphism h : S 1 → S 1 such that g ◦ h = f .\nSince f is generic, there is a finite set Θf = {θ1f , . . . , θrf } ⊂ S 1 such that f|S 1 \\Θf is a C 1 diffeomorphism between S 1 \\Θf and f (S 1 \\Θf ) (see properties (C1) and (C2) in Def. 3.1).\nAnalogously, the genericity of g implies that a finite set Θg = {θ1g , . . . , θsg } ⊂ S 1 exists,\nsuch that g|S 1 \\Θg is a C 1 -diffeomorphism between S 1 \\ Θg and f (S 1 \\ Θg ).\nSince f (S 1 ) = g(S 1), for any θ ∈ S 1 the set g −1 (f (θ)) is not empty. Moreover,\nsince in particular f (Θf ) = g(Θg ), if θ ∈ S 1 \\ Θf , the set g −1 (f (θ)) contains only one\npoint θ′ and we can define h(θ) = θ′ . If θ ∈ Θf , we have that g −1 (f (θ)) = {θ1′ , θ2′ }. In\nthis case, there is just one point θi′ ∈ g −1 (f (θ)) such that im dgθi′ = im dfθ , because, by\nproperty (C2) in Def. 3.1, double points of g are clean. Thus, we can define h(θ) = θi′ .\nBecause of its definition, the function h verifies the equality g ◦ h = f . We claim\nthat h is a C 1 -diffeomorphism. Indeed, recalling that f (S 1 ) = g(S 1 ), the definition of\nh implies that h is injective and surjective. Furthermore, for each point θ ∈ S 1 , there\nexist an open neighborhood U(θ) of θ in S 1 such that f|U (θ) is a C 1 -diffeomorphism, a\npoint θ′ ∈ S 1 for which g(θ′ ) = f (θ), and an open neighborhood V (θ′ ) of θ′ in S 1 such\nthat g|V (θ′ ) is a C 1 -diffeomorphism and g(V (θ′ )) = f (U(θ)). Hence, h|U (θ) equals the\n−1\nC 1 -diffeomorphism g|V\n(θ ′ ) ◦ f|U (θ) . This concludes our proof.\nIncidentally, we observe that the proof of Theorem 4.1 could be simpler if we asked\ngeneric functions to satisfy a further condition beside (C1 − 2), that is\n(C3) the set {θ ∈ S 1 :\n\ndf1\n(θ)\ndθ\n\n6= 0 ∧\n\ndf2\n(θ)\ndθ\n\n6= 0} is dense in S 1 .\n\nRoughly speaking, (C3) says that, for almost every point, the tangent line to the curve\nis neither horizontal nor vertical. This is still a generic property. Clearly, in this way,\nthe proof that f (S 1 ) \\ f (N̄f ) ⊆ g(S 1) would be trivial. However, the price to pay would\nbe some other complications in the next Theorem 4.5.\nFrom previous Theorem 4.1 the next corollary follows:\nCorollary 4.2. Let f, g : S 1 → R2 be two continuous functions. If there exist two\ngeneric functions f ′ : S 1 → R2 , g ′ : S 1 → R2 such that H0u,v (s ◦ f ′ ) = H0u,v (s ◦ g ′ ) for\nevery (u, v) ∈ ∆+ and every s ∈ Σ2 , then there exists a C 1 -diffeomorphism h : S 1 → S 1\nsuch that kg ◦ h − f k∞ ≤ kg − g ′ k∞ + kf ′ − f k∞ .\nProof. Theorem 4.1 ensures that a C 1 -diffeomorphism h : S 1 → S 1 exists such that\ng ′ ◦h = f ′ . As a consequence, kg◦h−f k∞ ≤ kg◦h−g ′ ◦hk∞ +kg ′ ◦h−f ′ k∞ +kf ′ −f k∞ =\nkg − g ′k∞ + kf ′ − f k∞ .\nTheorem 4.1 shows that persistent homology is sufficient to classify curves of R2\nup to C 1 -diffeomorphisms that preserve the considered functions, but this result seems\nnot to be completely satisfactory. Indeed, in order to be applied, it requires complete\ncoincidence of persistent homology groups, which may not occur in concrete applications.\nIn some sense the next result Theorem 4.5 improves Theorem 4.1, since it translates\nour approach into a setting where it is requested only some kind of closeness between\n\n\fUniqueness of models in persistence homology\n\n12\n\nthe persistent homology groups of the considered functions f , g, expressed by a suitable\ndistance. In order to state Theorem 4.5, we need to consider a restricted space of\nfunctions.\nDefinition 4.3. For every positive real number k, we define Fk to be the subset of\nC 1 (S 1 , R2 ) such that\n(i) f is generic;\n(ii) f (S 1 ) is contained in the disk of R2 centered at (0, 0) with radius k;\n(iii) f is a curve of length lf with lf ≤ k;\n(iv) The curvature of the curve f is everywhere not greater than k;\n(v) Every C 1 function f ′ : S 1 → R2 such that f ′ has a distance less than\nwith respect to the C 1 -norm, is generic.\n\n1\nk\n\nfrom f ,\n\nLet us recall that the set of generic functions is open in C 1 (S 1 , R2 ) (see\nProposition 3.2). Hence, for k sufficiently large, the set Fk is non-empty. Moreover,\nlet us remark that, for any generic f , there is a sufficiently large value k(f ) ∈ R such\nthat f ∈ Fk(f ) .\nLemma 4.4. The closure of Fk in the C 1 -topology is contained in the space of generic\nfunctions.\nProof. Let (fi ) be a sequence in Fk , and assume limi→∞ fi exists and is equal to f ̄.\nThus, the ball centered at f ̄ with radius 1/2k contains some function fi . Since fi ∈ Fk ,\nby property (v) in Definition 4.3, we see that f ̄ is generic.\nIn order to measure the distance between the persistent Betti numbers functions\nrk H0*,* (f ), rk H0*,*(g) : ∆+ → N, we use the matching distance Dmatch defined and studied\nin [1]. The main property of this distance (and the unique we use in this paper) is that\nit is stable with respect to perturbation of the functions. Indeed, the Multidimensional\nStability Theorem in degree 0 (see [1, Thm. 4]) states that if kf − gk∞ ≤ ǫ then\nDmatch (rk H0*,* (f ), rk H0*,*(g)) ≤ ǫ. For the definition and the main results concerning\nthis distance between the ranks of the persistent homology groups in degree 0, i.e. size\nfunctions, we refer the interested reader to [1].\nWe can now extend Theorem 4.1 to the following result.\nTheorem 4.5. Let k > 0. For every ǫ > 0, a δ > 0 exists such that if f, g ∈ Fk and\nthe matching distance between the functions rk H0*,*(s ◦ f ) and rk H0*,* (s ◦ g) is not greater\nthan δ for every s ∈ Σ2 , then there exists a C 1 -diffeomorphism h : S 1 → S 1 such that\nkf − g ◦ hk∞ ≤ ǫ.\nProof. Let us assume that our statement is false.\nThen a value ǭ > 0\nexists such that, for every δ > 0, two functions fδ , gδ ∈ Fk exist, for which\nDmatch (rk H0*,* (s ◦ f ), rk H0*,* (s ◦ g)) ≤ δ, for every s ∈ Σ2 , but kfδ − gδ ◦ hk∞ > ǭ,\nfor every C 1 -diffeomorphism h : S 1 → S 1 . Since each persistent homology group is\n\n\fUniqueness of models in persistence homology\n\n13\n\ninvariant by composition of the considered function with a homeomorphism, it is not\nrestrictive to assume that, for every δ > 0, the parameter θ is proportional to the\narc-length parameter of the curves fδ and gδ (up to a shift).\nIt is easy to check that, because of our choice of the parameterization of S 1 and\nof the bounds assumed on the length and the curvature of the curves fδ and gδ (see\nproperties (iii) and (iv) in the definition of Fk ), the first and second derivative of fδ and\ngδ are bounded by a constant independent\n\u0010 \u0011 \u0010 of\u0011δ.\nLet us consider the sequences f 1 , g 1 (i ∈ N+ ). Because of the definition of Fk ,\ni\ni\nusing the Ascoli-Arzelà Theorem (in its generalized version for higher derivatives,\n\u0010 \u0011 \u0010 cf.,\n\u0011\n1\n1\ne.g., [14]), and possibly extracting two subsequences, we can assume that f , g\ni\ni\nconverge to the C 1 functions f ̄, ḡ, , respectively, in the C 1 -norm. Because of Lemma 4.4,\nwe know that f ̄ and ḡ are generic. By applying the Multidimensional Stability Theorem\nin degree 0 (cf. [1, Thm. 4]), we see that the matching distance between the functions\nrk H0*,*(s ◦ f ̄) and rk H0*,* (s ◦ ḡ) vanishes for every s ∈ Σ2 . Since Dmatch is a distance,\nrk H0*,* (s ◦ f ̄) ≡ rk H0*,* (s ◦ ḡ), and thus H0u,v (s ◦ f ̄) = H0u,v (s ◦ ḡ), for every (u, v) ∈ ∆+\nand s ∈ Σ2 .\nTherefore, we can apply Theorem 4.1 and deduce that there exists a C 1 diffeomorphism h : S 1 → S 1 such that ḡ ◦ h = f ̄. As a consequence, 0 = kḡ ◦ h − f ̄k∞ =\nlimi→∞ kg 1 ◦ h − f 1 k∞ ≥ ǭ > 0. This is a contradiction, and hence our statement is\ni\ni\nproven.\nWe conclude this paper by observing that the presented approach can be\nstraightforwardly adapted to the case of curves in Rn , and to the curves with more\nthan one connected component. We leave the easy details to the reader. However, we\nnote that generic curves in Rn with n ≥ 3 have no multiple points.\nThe generalization of our results to surfaces seems to present some technical\ndifficulties, and deserves a separate treatment.\nAppendix\nLemma Appendix A.6. Let R be an open rectangle in R2 with sides parallel to the\ncoordinate axes and let v = (v1 , v2 ) be its top-right vertex. Let a = (a1 , a2 ), b = (b1 , b2 ),\nc = (c1 , c2 ), d = (d1 , d2) be four points in R with a1 = c1 < b1 = d1 < v1 and\nc2 = d2 < a2 = b2 < v2 (see Fig. 6). If R ∩ fˆ(S 1 ) = ∅ then\nrk H0b,v (fˆ) − rk H0d,v (fˆ) − rk H0a,v (fˆ) + rk H0c,v (fˆ) = 0.\nIf fˆ is top-right transversal to R, then\nrk H0b,v (fˆ) − rk H0d,v (fˆ) − rk H0a,v (fˆ) + rk H0c,v (fˆ) = 1.\nProof. First of all we observe that rk H0u,v (fˆ) is the number of connected components\nof D v that contain at least one point of D u , by definition. So, letting nu be the number\n\n\fUniqueness of models in persistence homology\n\n14\n\nof connected components C of fˆ−1 (D v ) such that fˆ(C) does not meet D u , and n the\nnumber of connected components of fˆ−1 (D v ), rk H0u,v (fˆ) = n − nu . As a consequence\nrk H0b,v (fˆ) − rk H0d,v (fˆ) − rk H0a,v (fˆ) + rk H0c,v (fˆ) = −nb + nd + na − nc .\nLet us consider the strips Sutop = {(x1 , x2 ) ∈ D v : x2 > u2 ∧ (x1 , x2 ) 6∈ R} and\nSuright = {(x1 , x2 ) ∈ D v : x1 > u1 ∧ (x1 , x2 ) 6∈ R}, for u = a, b, c, d (see Fig. A1). We\nˆ−1 (D v ) such that fˆ(C) is\ndenote by ntop\nu the number of connected components C of f\nentirely contained in the strip Sutop . Analogously, we denote by nright\nthe number of\nu\n−1\nv\nconnected components C of fˆ (D ) such that fˆ(C) is entirely contained in the strip\n\nSuright .\nright\nSfrag replacementsIf R ∩ fˆ(S 1 ) = ∅, then nu = ntop\n, for u = a, b, c, d (see Fig. A1, top row).\nu + nu\nb,v ˆ\nd,v ˆ\na,v ˆ\nThe equality rk H0 (f ) − rk H0 (f ) − rk H0 (f ) + rk H0c,v (fˆ) = 0 follows by observing\ntop\nright\ntop\ntop\nthat ntop\n= nright\n, nright\n= nright\n.\na\nc\nb = na , nd = nc , nb\nd\ntop\nright\nˆ\nIf f is top-right transversal to R, then nb = nb + nright\n, nd = ntop\n+ 1,\nb\nd + nd\ntop\nright\ntop\nright\nna = na + na\n+ 1, nc = nc + nc\n+ 1 (see Fig. A1, bottom row). Once again,\nb,v ˆ\nd,v ˆ\nthe equality rk H0 (f ) − rk H0 (f ) − rk H0a,v (fˆ) + rk H0c,v (fˆ) = 1 follows by observing\ntop\nright\ntop\ntop\nthat ntop\n= nright\n, nright\n= nright\n.\na\nc\nb = na , nd = nc , nb\nd\nv\nSbtop\n\na\n\nR\n\nc\n\nb\n\nv\nSdtop\n\na\nc\n\nd\nSbright\n\nSfrag replacements\n\nDbv \\ R\na\n\nR\n\nc\n\nR\n\nb\nd\n\nDdv \\ R\n\nb\n\na\n\nd\n\nc\n\nfˆ(γ) 6⊆ Dbv\n\nR\n\na\n\nb\n\nR\n\nc\n\nSctop\n\nd\n\nSaright\n\nSdright\nv\n\nv\n\nv\nSatop\n\nv\n\nb\n\na\n\nd\n\nc\n\nfˆ(γ) ⊆ Ddv\n\nR\n\na\nc\n\nR\n\nb\nd\n\nScright\n\nDav \\ R\nv\nb\nd\nfˆ(γ) ⊆ Dav\n\nDcv \\ R\nv\nb\na\nR\nc\nd\nfˆ(γ) ⊆ Dcv\n\nFigure A1. The colored sets in the top row correspond to the sets Dav \\ R, Dbv \\ R,\nDcv \\ R, and Ddv \\ R. Observe that each one of these sets contains two disjoint strips,\nand each strip is contained in exactly two of those sets. The colored sets in the bottom\nrow correspond to the sets Dav , Dbv , Dcv , and Ddv . Top row: if R ∩ fˆ(S 1 ) = ∅, then\n−nb + nd + na − nc = 0. Bottom row: if R ∩ fˆ(S 1 ) = fˆ(γ), then −nb + nd + na − nc = 1.\n\nReferences\n[1] S. Biasotti, A. Cerri, P. Frosini, D. Giorgi and C. Landi, Multidimensional size functions for shape\ncomparison, Journal of Mathematical Imaging and Vision, vol. 32, n. 2, 161–179 (2008).\n\n\fUniqueness of models in persistence homology\n\n15\n\n[2] F. Cagliari, M. Ferri and P. Pozzi, Size functions from a categorical viewpoint, Acta Applicandae\nMathematicae, vol. 67, n. 3, 225–235 (2001).\n[3] F. Cagliari, C. Landi, Finiteness of rank invariants of multidimensional persistent homology groups,\nApplied Mathematics Letters, in press (available online), DOI: 10.1016/j.aml.2010.11.004.\n[4] G. Carlsson, A. Zomorodian, The Theory of Multidimensional Persistence, Discrete and\nComputational Geometry, vol. 42, n. 1, 71–93 (2009).\n[5] D. Cohen-Steiner, H. Edelsbrunner, J. Harer, Stability of Persistence Diagrams, Discrete and\nComputational Geometry, vol. 37, n. 1, 103–120 (2007).\n[6] A. Collins, A. Zomorodian, G. Carlsson, and L.J. Guibas, A barcode shape descriptor for curve\npoint cloud data, Comput. Graph., vol. 28, n. 6, 881–894 (2004).\n[7] M. d'Amico, P. Frosini, C. Landi, Natural pseudo-distance and optimal matching between reduced\nsize functions, Acta Applicandae Mathematicae, vol. 109, n. 2, 527–554 (2010).\n[8] M. Demazure, Bifurcations and Catastrophes. Geometry of Solutions to Nonlinear Problems,\nBerlin, Germany, Springer-Verlag, 2000.\n[9] P. Donatini, P. Frosini, Natural pseudodistances between closed manifolds, Forum Mathematicum,\nvol. 16, n. 5, 695–715 (2004).\n[10] P. Donatini, P. Frosini, Natural pseudodistances between closed surfaces, Journal of the European\nMathematical Society, vol. 9, n. 2, 231–253 (2007).\n[11] P. Donatini, P. Frosini, Natural pseudodistances between closed curves, Forum Mathematicum, vol.\n21, n. 6, 981–999 (2009).\n[12] P. Frosini, M. Mulazzani, Size homotopy groups for computation of natural size distances, Bulletin\nof the Belgian Mathematical Society, vol. 6, n. 3, 455–464 (1999).\n[13] M. W. Hirsch, Differential topology, Springer-Verlag, 1976.\n[14] J. Jost, Postmodern analysis, Springer-Verlag, Berlin, 2005.\n[15] P. W. Michor, D. Mumford, Riemannian geometries on spaces of plane curves, J. Eur. Math. Soc.,\nvol. 8, 1-48, (2006).\n[16] A. Verri, C. Uras, P. Frosini, and M. Ferri, On the use of size functions for shape analysis, Biol.\nCybern., vol. 70, 99–107 (1993).\n\n\f"}