{"id": "http://arxiv.org/abs/0901.4470v2", "guidislink": true, "updated": "2009-06-17T12:57:52Z", "updated_parsed": [2009, 6, 17, 12, 57, 52, 2, 168, 0], "published": "2009-01-28T14:30:16Z", "published_parsed": [2009, 1, 28, 14, 30, 16, 2, 28, 0], "title": "Probing a composite spin-boson environment", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0901.0867%2C0901.0757%2C0901.2035%2C0901.1706%2C0901.4059%2C0901.4125%2C0901.4855%2C0901.2938%2C0901.3586%2C0901.0420%2C0901.4038%2C0901.0235%2C0901.1670%2C0901.0146%2C0901.0777%2C0901.1959%2C0901.0057%2C0901.4616%2C0901.4965%2C0901.3766%2C0901.0623%2C0901.4474%2C0901.1435%2C0901.0390%2C0901.3522%2C0901.3632%2C0901.3976%2C0901.1157%2C0901.4832%2C0901.0636%2C0901.3480%2C0901.0954%2C0901.4124%2C0901.2305%2C0901.4470%2C0901.4636%2C0901.3374%2C0901.0951%2C0901.3933%2C0901.1377%2C0901.3130%2C0901.0781%2C0901.1308%2C0901.1578%2C0901.0655%2C0901.3599%2C0901.4472%2C0901.3771%2C0901.3607%2C0901.4420%2C0901.1134%2C0901.2304%2C0901.2824%2C0901.0534%2C0901.2620%2C0901.0494%2C0901.1822%2C0901.3893%2C0901.3310%2C0901.0796%2C0901.3702%2C0901.2538%2C0901.2364%2C0901.3867%2C0901.2378%2C0901.0764%2C0901.2313%2C0901.1213%2C0901.4621%2C0901.0451%2C0901.0043%2C0901.1783%2C0901.1316%2C0901.3943%2C0901.1181%2C0901.2946%2C0901.0821%2C0901.3024%2C0901.2208%2C0901.1341%2C0901.4951%2C0901.0778%2C0901.4370%2C0901.0678%2C0901.2932%2C0901.3369%2C0901.3067%2C0901.1799%2C0901.1791%2C0901.3973%2C0901.4478%2C0901.1023%2C0901.3858%2C0901.3443%2C0901.2249%2C0901.1332%2C0901.4477%2C0901.2519%2C0901.0327%2C0901.0425%2C0901.4771&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Probing a composite spin-boson environment"}, "summary": "We consider non-interacting multi-qubit systems as controllable probes of an\nenvironment of defects/impurities modelled as a composite spin-boson\nenvironment. The spin-boson environment consists of a small number of\nquantum-coherent two-level fluctuators (TLFs) damped by independent bosonic\nbaths. A master equation of the Lindblad form is derived for the probe-plus-TLF\nsystem. We discuss how correlation measurements in the probe system encode\ninformation about the environment structure and could be exploited to\nefficiently discriminate between different experimental preparation techniques,\nwith particular focus on the quantum correlations (entanglement) that build up\nin the probe as a result of the TLF-mediated interaction. We also investigate\nthe harmful effects of the composite spin-boson environment on initially\nprepared entangled bipartite qubit states of the probe and on entangling gate\noperations. Our results offer insights in the area of quantum computation using\nsuperconducting devices, where defects/impurities are believed to be a major\nsource of decoherence.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0901.0867%2C0901.0757%2C0901.2035%2C0901.1706%2C0901.4059%2C0901.4125%2C0901.4855%2C0901.2938%2C0901.3586%2C0901.0420%2C0901.4038%2C0901.0235%2C0901.1670%2C0901.0146%2C0901.0777%2C0901.1959%2C0901.0057%2C0901.4616%2C0901.4965%2C0901.3766%2C0901.0623%2C0901.4474%2C0901.1435%2C0901.0390%2C0901.3522%2C0901.3632%2C0901.3976%2C0901.1157%2C0901.4832%2C0901.0636%2C0901.3480%2C0901.0954%2C0901.4124%2C0901.2305%2C0901.4470%2C0901.4636%2C0901.3374%2C0901.0951%2C0901.3933%2C0901.1377%2C0901.3130%2C0901.0781%2C0901.1308%2C0901.1578%2C0901.0655%2C0901.3599%2C0901.4472%2C0901.3771%2C0901.3607%2C0901.4420%2C0901.1134%2C0901.2304%2C0901.2824%2C0901.0534%2C0901.2620%2C0901.0494%2C0901.1822%2C0901.3893%2C0901.3310%2C0901.0796%2C0901.3702%2C0901.2538%2C0901.2364%2C0901.3867%2C0901.2378%2C0901.0764%2C0901.2313%2C0901.1213%2C0901.4621%2C0901.0451%2C0901.0043%2C0901.1783%2C0901.1316%2C0901.3943%2C0901.1181%2C0901.2946%2C0901.0821%2C0901.3024%2C0901.2208%2C0901.1341%2C0901.4951%2C0901.0778%2C0901.4370%2C0901.0678%2C0901.2932%2C0901.3369%2C0901.3067%2C0901.1799%2C0901.1791%2C0901.3973%2C0901.4478%2C0901.1023%2C0901.3858%2C0901.3443%2C0901.2249%2C0901.1332%2C0901.4477%2C0901.2519%2C0901.0327%2C0901.0425%2C0901.4771&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We consider non-interacting multi-qubit systems as controllable probes of an\nenvironment of defects/impurities modelled as a composite spin-boson\nenvironment. The spin-boson environment consists of a small number of\nquantum-coherent two-level fluctuators (TLFs) damped by independent bosonic\nbaths. A master equation of the Lindblad form is derived for the probe-plus-TLF\nsystem. We discuss how correlation measurements in the probe system encode\ninformation about the environment structure and could be exploited to\nefficiently discriminate between different experimental preparation techniques,\nwith particular focus on the quantum correlations (entanglement) that build up\nin the probe as a result of the TLF-mediated interaction. We also investigate\nthe harmful effects of the composite spin-boson environment on initially\nprepared entangled bipartite qubit states of the probe and on entangling gate\noperations. Our results offer insights in the area of quantum computation using\nsuperconducting devices, where defects/impurities are believed to be a major\nsource of decoherence."}, "authors": ["Neil P. Oxtoby", "Ángel Rivas", "Susana F. Huelga", "Rosario Fazio"], "author_detail": {"name": "Rosario Fazio"}, "author": "Rosario Fazio", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1088/1367-2630/11/6/063028", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0901.4470v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0901.4470v2", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "20 pages, 9 colour figures, I.O.P. style, published version; See\n  Video Abstract at http://www.quantiki.org/video_abstracts/09014470", "arxiv_primary_category": {"term": "quant-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "quant-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "cond-mat.mes-hall", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0901.4470v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0901.4470v2", "journal_reference": "New J. Phys. 11, 063028 (2009)", "doi": "10.1088/1367-2630/11/6/063028", "fulltext": "Probing a composite spin-boson environment\n\narXiv:0901.4470v2 [quant-ph] 17 Jun 2009\n\nNeil P Oxtoby1 , Ángel Rivas1 , Susana F Huelga1 , Rosario\nFazio2\n1\n\nQuantum Physics Group, STRI, School of Physics, Astronomy and\nMathematics, University of Hertfordshire, Hatfield, Herts AL10 9AB, United\nKingdom\n2 NEST CNR-INFM & Scuola Normale Superiore, Piazza dei Cavalieri 7,\nI-56126 Pisa, Italy\nE-mail: s.f.huelga@herts.ac.uk\nPACS numbers: 03.65.Yz, 03.67.-a, 85.25.Cp\n\nSubmitted to: New J. Phys.\nAbstract. We consider non-interacting multi-qubit systems as controllable\nprobes of an environment of defects/impurities modelled as a composite spinboson environment. The spin-boson environment consists of a small number of\nquantum-coherent two-level fluctuators (TLFs) damped by independent bosonic\nbaths. A master equation of the Lindblad form is derived for the probeplus-TLF system. We discuss how correlation measurements in the probe\nsystem encode information about the environment structure and could be\nexploited to efficiently discriminate between different experimental preparation\ntechniques, with particular focus on the quantum correlations (entanglement)\nthat build up in the probe as a result of the TLF-mediated interaction. We\nalso investigate the harmful effects of the composite spin-boson environment on\ninitially prepared entangled bipartite qubit states of the probe and on entangling\ngate operations. Our results offer insights in the area of quantum computation\nusing superconducting devices, where defects/impurities are believed to be a\nmajor source of decoherence.\n\n\fProbing a composite spin-boson environment\n\n2\n\n1. Introduction\nSuperconducting qubits [1] consist of electronic nanocircuits embedding Josephson\njunctions whose dynamics can, in certain parameter regimes, be restricted to a twodimensional manifold. These qubits can be used as test-beds for studying quantum\nmechanics at its most fundamental level [2], and are also potential candidates for the\npractical implementation of quantum information processors [3].\nAn interesting and challenging aspect of these endeavours is the process of\ndecoherence, whereby qubits lose their quantum-mechanical nature and are rendered\ndynamically equivalent to their classical two-level counterparts. In the case of a\nsuperconducting charge qubit, such as the Cooper-pair box (CPB), dephasing (phase\ndecoherence) is dominated by low-frequency noise thought to be caused by interactions\nwith two-level fluctuators [4, 5, 6, 7] (TLFs) in the local environment. These TLFs\nmay be charge traps caused by defects/impurities in the Josephson junction or in the\nsubstrate. There has been a substantial amount of research on TLFs causing single\nqubit decoherence in Josephson junction systems. Theoretical works have concerned\nlarger ensembles of TLFs, both incoherent [8, 9, 10, 11, 12, 13, 14] and coherent [5], that\nrandomly switch between two configurations, producing low-frequency fluctuations in\nthe relevant qubit parameters. As discussed in detail in all these works, whenever\na large number of TLFs are very weakly coupled to the qubit, their effect can be\ndescribed by a conventional boson bath with a suitable chosen spectral density. This\nis however not always the case - there may be situations when only one or a few\nimpurities are important. Indeed, Neeley, et al [6] have demonstrated the existence of\ncoherent TLFs. Lupaşcu, et al [7] provide evidence that these TLFs are in fact genuine\ntwo-level systems. In Neeley's experiment [6] a single TLF that was coupled to the\nqubit led to an avoided crossing in the qubit energy spectrum. The TLF was used as\na proof-of-principle memory qubit, but such TLFs will in general be detrimental to\nthe operation of superconducting qubits. It is therefore desirable to understand the\nbehaviour of TLFs in the vicinity of superconducting qubits in order to better-equip\nquantum information scientists to manage the challenge of decoherence.\nIn view of its importance for understanding decoherence in superconducting\nnanocircuits we study in this paper the effect that a few underdamped, coherent\nTLFs have on the quantum dynamics of a charge qubit. A single qubit coupled\nto a single coherent TLF, that was in turn (under-)damped by a bosonic bath was\nalready considered in [15]. We find this type of non-equilibrium environment [16]\nto be an appealing model of the environment of a Josephson junction qubit because\nTLFs may be damped by phonons in the substrate, for example. We refer to this\nas a composite spin-boson environment. The case of a few TLFs, which will be\nconsidered here, is rather complex and therefore we resort to extensive numerical\ncalculations. Our approach represents quite a general strategy for probing a composite\nspin-boson environment, whereby we derive a Markovian master equation for the\naverage dynamics of the probe+TLFs after tracing out the external baths. To allow\nfor the random nature of TLF formation, we select the TLF Hamiltonian parameters\naccording to probability distributions designated in [5]. Of the many environmental\nproperties that could be studied in this scenario, we focus on inferring the presence\nor absence of coherent coupling between the TLFs. This connectivity of the TLFs has\nbeen identified as important in the decoherence of a bipartite qubit system [17], with\nfurther-reaching importance for quantum computing.\nPerforming a more thorough treatment of this situation is increasingly important\n\n\fProbing a composite spin-boson environment\n\n3\n\nin light of recent experiments [6, 7] involving superconducting qubits coupling\npredominantly to only a small number of TLFs. In these experiments, measurements\non the qubit were used to infer properties of the TLF (although that wasn't the focus\nin [6]). That is, the qubit was used as a probe of the environment [18, 19]. Probing\nproperties of a small collection of TLFs, such as whether or not they interact with\neach other, necessitates consideration of the full dynamics of the probe plus TLFs\nunder the influence of external baths.\nFrom the theory point of view, identifying structural properties in the\nenvironment could be done using some form of noise correlation measurements. Here\nwe focus on inferring environmental features via the analysis of the entanglement\nthat will build up in a probe consisting of two non-(directly) interacting qubits whose\nremote coupling is mediated by the TLFs present in the surroundings. When the\nprobing is \"local\", so that each probe qubit couples to just one single TLF, the\nabsence of quantum correlation generation would immediately signal a non-connected\nenvironment, given that the probe qubits can only become entangled if the fluctators\nwould couple to each other. Entanglement swapping in those circumstances has\nbeen discussed in the literature [20, 21, 22]. When probe qubits are subject to\nthe action of a few TLFs, as it happens in qubit realizations in the solid state,\nwe will show that the remote entanglement in the probe bears signatures that\ncan be linked to the connectivity in the environment and can in some cases be\nrelated to monogamy constraints [23]. Given that bipartite entanglement has been\nshown [24] to be lower-bounded by combinations of pseudo-spin observables, we also\nanalyze what information can be extracted from magnetization measurements along\na given direction (in the case considered here the magnetization along the z-direction\ncorresponds to the average charge) and study the power spectra of magnetization\nobservables using both single and bipartite probes. We find that a double-qubit probe\ngenerally outperforms a single-qubit probe, a result that could perhaps be expected\ngiven the extra degrees of freedom available in the composite system. We supplement\nour analysis of correlation measurements by investigating the decoherence of composite\nprobes initially prepared in a certain maximally entangled state when subject to a\ncomposite spin-boson environment, as well as the performance of entangling gate\noperations when performed in the presence of this type of noise.\nThe paper is organized as follows. Section 2 sets the scene by describing our model\nfor the double-qubit probe and spin-boson environment. A detailed derivation of the\nproposed master equation as well as a discussion of its validity domain are presented\nin the appendix. Numerical results for probing the connectivity of the spin-boson\nenvironment are presented in section 3, using both probe entanglement and estimated\npower-spectrum analyses. We summarize and discuss these results in section 3.3,\nas well as compare the double-qubit probe to a single-qubit probe. In section 4 we\ninvestigate the decoherence of maximally-entangled Bell states induced by a composite\nspin-boson environment. The performance of bipartite entangling gates in the presence\nof this form of noise is analyzed and discussed in section 5. Section 6 concludes.\n2. System\nThe system we consider is illustrated in figure 1. It consists of two charge qubits\n(blue spheres) acting as probes of an environment containing TLFs (grey spheres).\nEach qubit is coupled to a few TLFs (black lines in the figure) but probe qubits are\nassumed to not directly couple to each other. In the numerical calculations we will\n\n\fProbing a composite spin-boson environment\n\n4\n\nconsider the case in which there are four TLFs. Four TLFs is a balance between\ngenerating the desired spectral features (requiring an ensemble of TLFs [5, 12]) and\nmaintaining reasonable computation time (smaller Hilbert space). Also, it may be the\ncase that only a few TLFs will couple strongly to a Josephson junction qubit, as in\nrecent experiments [6, 7]. We should stress that the conclusions of our work do not\ndepend on this choice.\nIn the charge basis, each qubit/TLF has a local free Hamiltonian consisting of\nboth longitudinal (σ̂z ) and transverse (σ̂x ) components: 2Ĥσ = εσ̂z + ∆σ̂x . In the\neigenbasis the corresponding pseudo-spin Hamiltonians are 2Ĥs = Ωs ŝz , where the\nspin frequency is Ω2s = ε2 + ∆2 . (Throughout this article we denote Pauli operators in\nthe charge basis by σ̂, and in the pseudo-spin basis by ŝ.) For simplicity, we \"engineer\"\nthe probe qubit Hamiltonians to have only longitudinal components (∆P = 0).\nProbe: We label the identical probe qubits A and B. Choosing uncoupled probe\nqubits for reasons that will become clear later, the total Hamiltonian for the probe is\nB\nthe sum 2ĤP = ΩP (ŝA\nz + ŝz ).\nImpurities: We label the four TLF impurities with j = 1, 2, 3, 4. The total\nP4\n(j)\nHamiltonian for the TLFs is then 2ĤTLF = j=1 Ωj ŝz + V̂TLF , where V̂TLF describes\ncoherent couplings between the TLFs, if they exist (defined below). Note that the\n(j)\npseudo-spin basis for the impurities is different to the probe (the ŝz axis is rotated\nrelative to ŝz ) because the probe and TLF energies will differ, in general. Recent\ntheoretical work [5] suggested specific distributions of these TLF energies in order to\naccount for both low- and high-frequency noise observed in superconducting quantum\nsystems. In our numerical study, we have adopted these distributions to determine\nthe TLF bias energies εj (linear distribution) and tunnel amplitudes ∆j (log-uniform\ndistribution). Throughout the paper we will refer to ∆j as the local field. Again, note\nthat our results are independent of the specific choice of frequency distribution and\nthe same qualitative results can be derived when using a different functional form, e.g.,\na linear or a uniform distribution in a selected interval around the qubit frequency.\n\nFigure 1. Double-qubit probe schematic. Blue spheres are the probe qubits,\nAlice and Bob. Grey spheres are the TLFs. Probe–TLF couplings (νj ) are\ndepicted as black lines. TLF-TLF couplings (μj,k ) are specified by red lines.\nEach fluctuator is also subject to the action of a bosonic bath at a temperature\nT . Interactions between A and B are mediated by the TLFs, which lead to remote\n(TLF mediated) entanglement generation in the probe.\n\n\fProbing a composite spin-boson environment\n\n5\n\nInteractions: It is sensible to expect that the dominant interaction in a system\nof coherent two-level charges is an electrostatic one [10, 25]. That is, chargecharge interactions. We therefore assume bipartite ZZ interactions (σ̂z ⊗ σ̂z ) between\nsubsystems. Within the TLFs we assume nearest-neighbour ZZ interactions of\nstrength μj,k , where k = (j mod 4) + 1. We assume no direct interaction between\nP4\n(j) (k)\nthe probe qubits A and B. So, V̂T LF = j=1 μj,k σ̂z σ̂z . For coupling strength νj\nP4\n(j)\nbetween the jth impurity and the probe qubits, we have V̂P = j=1 νj (σ̂zA + σ̂zB )σ̂z .\nWe define V̂ ≡ V̂P + V̂TLF . In the numerical simulations, noting that we expect distant\nTLFs to have very little impact, we have assumed all couplings μj,k = μ and all νj = ν\nto avoid unnecessarily cumbersome results. Our conclusions are valid even when small\nvariations in the parameters, of the order of 5 − 10%, are considered.\n2.1. Master equation\nThe impurities are coupled to independent reservoirs of bosons (e.g., phonons in the\nsubstrate), leading to dissipation (damping) as in the spin-boson model [26]. Under\nappropriate weak-coupling assumptions (see Appendix A for our derivation), the\ndissipative dynamics of the composite system (qubits plus damped TLFs) can be\nexpressed in the following Born-Markov master equation for the joint state ρ(t) of the\nprobe plus impurities:\nX\n(j)\n(j)\n(1)\nρ̇(t) = −i[Ĥ, ρ(t)] +\n(Dz(j) + D+ + D− )ρ(t),\nj\n\nwhere the total Hamiltonian is\nĤ = ĤP + ĤTLF + V̂ .\n\n(2)\n\nThe D superoperators [27] represent decoherence in the TLFs due to coupling with\nthe bosonic baths, which are at temperature T . The decoherence consists of dephasing\n(j)\n(j) (j) (j)\n(j) (j)\n(j) (j) (j)\n(j)\nDz ρ = Γz [ŝz ρŝz − ρ], emission into the baths D− ρ = Γ− [ŝ− ρŝ+ − (ŝ+ ŝ− ρ +\n(j) (j)\n(j) (j) (j)\n(j)\n(j) (j)\nρŝ+ ŝ− )/2], and absorption from the baths D+ ρ = Γ+ [ŝ+ ρŝ− − (ŝ− ŝ+ ρ +\n(j) (j)\n(j)\nρŝ− ŝ+ )/2]. The TLF decoherence rates Γz,± are proportional to the respective\ndephasing, emission and absorption rates γz,± (see Appendix A), which are functions\nof the temperature and spectral properties of the jth bosonic bath (with absorption\ndramatically reduced at low temperatures). Further, the TLF decoherence rates are\nalso functions of the ratio of local field to bias, tan θj ≡ ∆j /εj [28]. To get a feel\nfor the influence of this ratio, if we assume dissipation-limited dephasing (γz = γ− /2)\nand sufficiently low temperature (γ+ /γ− → 0), then tan θj dictates the dominance\n(j)\n(j)\nof pure dephasing or relaxation in each TLF. Specifically, Γz /Γ− = 1/ tan2 θj\nso that pure dephasing dominates the TLF decoherence for weak local fields, and\nrelaxation dominates for strong local fields. Following [5], we distribute the random\n(j)\nTLF parameters εj , ∆j , and γz,± as per the distributions P (εj ) ∝ εj , P (∆j ) ∝ 1/∆j ,\n(j)\n\n(j)\n\nP (γz,± ) ∝ 1/γz,± . We choose these parameters to take values within the following\n ̄ j ±0.5 min(ΩP , ∆\n ̄ j ); γ (j) ∈ [Ωmin /6, Ωmin /2],\nmoderate ranges: εj ∈ (1±0.5)ε̄j ; ∆j ∈ ∆\nz,±\nwhere Ωmin is the minimum spin frequency amongst the TLFs. We are free to select\n ̄ j , which we will reference to the\nsensible values for the overbar quantities ε̄j and ∆\ntunable probe frequency ΩP . Importantly, the TLFs are underdamped (therefore\nrequiring a quantum-mechanical description), so γ (j) < Ωj . We take the probeTLF coupling to be uniform (νj = ν) and weak compared with all of the TLF\n\n\fProbing a composite spin-boson environment\n\n6\n\nfrequencies: ν = Ωmin /3. Our assumption of weak probe-TLF coupling simplifies\nthe master equation derivation significantly (see equation A.1; a detailed discussion\nof an analogous situation can be found in [29]), and is in addition to the standard\nBorn-Markov approximation of weak TLF-bath coupling. Weak probe-TLF coupling\nis in accord with the recent experiments of [6, 7], as well as the experiment of [4] (see\n[9]) where νj ∼ MHz and Ωj ∼ ΩP ∼ GHz. The TLF-TLF coupling is also assumed\nto be uniform μj,k = μ. Note that the authors of [5] point out that ν must also be\nrandomly distributed in order to realize 1/f noise in the probe. Generating the correct\nstatistics is not within the scope of this paper as we are interested in describing effects\nwhen the environment is dominated by only a few fluctuators.\n2.2. Observable quantities\nWe restrict our knowledge to the probe subsystem (as would be the case in an\nexperiment). A notable observable quantity on the probe is the magnetization,\nB\nwhich is related to a simple sum of Pauli operators: M̂x (t) = ŝA\nThe\nx + ŝx .\nappeal of considering the probe magnetization is that it requires only tractable,\nlocal measurements on each probe qubit. That is, our results may be easily tested\nin an experiment. It is worth noting that a result of Audenaert and Plenio [24]\nshows that measuring correlations Cxx/zz = hσ̂x/z ⊗ σ̂x/z i along the XX and ZZ\n'directions' suffice to give a lower bound on the probe entanglement. This can remove\nthe requirement for full tomographic (entanglement) measurements when verifying or\nquantifying entanglement in the probe.\nThe time series resulting from measuring the probe's X-magnetization is M (t) =\nhM̂x (t)i. The mean-square power spectrum of M̂ (t) is given by\nZ ∞\nS(ω) =\nR(τ )e−iωτ dτ,\n(3)\n−∞\n\nwhere the reduced auto-correlation function is R(τ ) ≡ hM̂ (t + τ )M̂ (t)i − hM̂ (t +\nτ )ihM̂ (t)i. The angle brackets here denote the expectation value of an operator\nhx̂i = Tr[x̂ρ(t)]. In reality, M (t) is a discrete quantity (the data is a time series),\nand so the power spectrum obtained is an estimate (the Fourier transform of the\nreduced autocorrelation of the time series M (t)). This estimate of average power\nas a function of frequency can theoretically be improved (by increasing the duration\nof the experiment, for example), but this may not be practical in reality. Strictly\nspeaking, M (t) must be a wide-sense stationary process (time-independent first and\nsecond moments) for the power spectrum to exist.\n3. Results: Detecting the presence of coupling between the TLFs\nCan probe observables reveal the degree of connectivity of a composite spin-boson\nenvironment? In this section we present numerical results showing that this is\nindeed the case. Observable quantities we consider are the probe magnetization, its\nestimated power spectrum, and the remote entanglement between the probe qubits.\nEntanglement generated between probe qubits that are initially in a separable state\nis primarily due to the structure of the spin-boson environment (e.g., the presence or\nabsence of TLF-TLF interactions in the surroundings of the probe).\nInitially we set the probe to be in a state orthogonal to the ŝz eigen-axis: |ψP (0)i =\n|+iA |+iB . The TLFs are assumed to be initially in a zero-temperature thermal state,\n\n\fProbing a composite spin-boson environment\n\n7\n\ni.e., the ground state of ĤTLF , which we denote as |gi. So, |φTLF (0)i = |gi. We\nplot observable quantities as a function of the ratio of TLF-TLF coupling strength to\nprobe-TLF coupling strength, μ/ν, which is often believed to be small (see [19], for\nexample).\nSection 3.1 considers the estimated power spectrum of hM̂x (t)i. Section 3.2\nconsiders the build up of entanglement in the probe.\n3.1. Power spectrum of hM̂x i\n3.1.1. TLFs with weak local fields. Consider the case of \"weak\" local fields in the\n ̄ j /ε̄j = 1/3, where TLF\nspin-boson environment where tan θj ∼ 1/3 (specifically ∆\ndephasing dominates relaxation: Γz /Γ− ∼ 10). In our probing of TLF connectivity,\nwe tune the ratio of probe–TLF splitting εP /ε̄j to 10, 3 and 1, corresponding to\nfigures 2(a), 2(b) and 2(c), respectively. We observe two effects: 1. For weaker TLF\ninterconnectivity μ/ν . 0.6, a decrease is observed in the height of the single dominant\npeak in the spectrum; 2. For stronger TLF interconnectivity μ/ν ≈ 1, the spectrum\nsplits into multiple peaks, the most dominant of which is shifted in frequency relative\nto μ/ν = 0. This is visible in figure 2 where the gold traces (μ/ν = 1) are the most\nqualitatively different from the blue traces (μ = 0). The power in the signal hM̂x (t)i\nredistributes from one dominant frequency for unconnected TLFs (μ = 0), to multiple\nfrequencies as μ/ν approaches unity (highly connected TLFs). Remarkably, the most\ndominant peak for highly connected TLFs μ/ν = 1 is qualitatively similar to the case\nof an isolated probe (figure 2(d)) - a single peak at ω = ΩP - although the peak\nvisibility (height) is noticeably less than the isolated probe.\n3.1.2. Effect of TLF local field. Above we have established that we can distinguish\nbetween highly connected TLFs (μ = ν) and unconnected TLFs (μ = 0) for weak\nlocal field strength ∆j < εj . It is interesting to ask how stronger local fields affect\nour ability to distinguish these two values of μ. To explore this, we increase the ratio\n ̄ j /ε̄j , which was less than 1 in figure 2.\nof TLF field strength to splitting: tan θ̄j = ∆\nThis varies the range for ∆j , which (we remind the reader) we have taken to be\n ̄ j ± 0.5 min(∆\n ̄ j , ΩP ). This range ensures a sensible variation in the TLF local field\n∆\nstrengths of no greater than one-half of the probe frequency. (We assume that the\nTLF energies are distributed over a relatively small range as might be expected for\nsystematically formed impurities/defects.)\nAs the local field increases tan θ̄j > 1, two different effects occur: 1. Larger local\nfields cause relaxation to dominate over dephasing in the TLF decoherence; 2. The\nTLF eigenstates increasingly align towards the σ̂x axis, and seem to have a decreasing\neffect on the probe, perhaps because the interaction is of the σ̂z ⊗ σ̂z type. Evidence\nto support this is shown in figure 3, which shows a peak visibility (height) reduction\nof about one order of magnitude as tan θ̄j is increased by one order of magnitude from\n1/3 to 3 [3(a) to 3(b)]. So, although extra features appear in the power spectrum, they\nbecome increasingly difficult to observe. Despite this, there is at least one plot in each\ncolumn for which μ = 0 and μ = ν are distinguishable. Thus it is apparent that tuning\nthe probe frequency (selecting a row in figure 3) allows these TLF connectivities to be\ndistinguished for a wide range of values of the TLF local field strength (we obtained\nsimilar results for tan θ̄j = 1).\n\n\fProbing a composite spin-boson environment\n0.1\n\n0.08\n\n0.06\n\nSx (ω)\n\n=\n=\n=\n=\n=\n=\n\nμ/ν\nμ/ν\nμ/ν\nμ/ν\nμ/ν\nμ/ν\n\n8\n0.4\n\n0\n0.2\n0.4\n0.6\n0.8\n1\n\n0.05\n\n0.35\n\n0.04\n\n0.3\n\n0.03\n0.02\n\n0.25\n\n0.01\n\nSx (ω)\n\n0\n0.4\n\n0.2\n\n0.04\n\n0.5\n\n0.6\n\n0.7\n\n0.8\n\n0.9\n\n0.15\n0.1\n\n0.02\n0.05\n0\n0\n\n0.5\n\n1\n\n0\n0\n\n1.5\n\n0.5\n\nω/ΩP\n\n1\n\n1.5\n\nω/ΩP\n\n(a) εP = 10ε̄j .\n\n(b) εP = 3ε̄j .\n\n0.14\n\n1\n!3\n\n0.12\n\n8\n\nx 10\n\n7\n\n0.8\n\n6\n\n0.1\n\n5\n4\n\n0.08\n\nSx (ω)\n\n0.6\n\n3\n\nSx (ω)\n\n2\n1\n\n0.06\n\n0\n\n0\n\n0.5\n\n1\n\n1.5\n\n0.4\n\n2\n\n0.04\n0.2\n0.02\n0\n0\n\n0.5\n\n1\n\n0\n0\n\n1.5\n\nω/ΩP\n\n0.5\n\n1\n\n1.5\n\nω/ΩP\n\n(c) εP = ε̄j .\n\n(d) Control spectrum: ν = 0.\n\nFigure 2. Estimated power spectrum of hM̂x (t)i for weak local fields tan θ̄j =\n1/3 with the initial probe state |ψ(0)i = |++i. Sampling parameters (units of\nΩP = εP ): δf = 1/200, ts = 0.05, fN = 10. Figure 2(d) is the power spectrum\nfor an isolated probe. The insets show the smaller peaks magnified. The relative\nheights and positions of the peaks can be used to distinguish unconnected TLFs\n(μ = 0, thick solid blue line) from highly connected TLFs (μ → ν, thick dashed\ngold line).\n\n3.2. Probe entanglement\nInteractions between probe qubits are mediated by the TLFs and entanglement\nbetween the probe qubits can be generated in this indirect way. We now consider using\nthe probe entanglement to distinguish between connected and unconnected TLFs. We\nuse the logarithmic negativity as a measure of bipartite entanglement between the\nprobe qubits, defined as [31]\nEP ≡ log2 ||ρTPA ||1 ,\nwhere || * ||1 denotes the trace norm, and ρ\n\n(4)\nTA\n\nis the partial transpose of ρ.\n\n3.2.1. TLFs with weak local fields. Figure 4 shows the logarithmic negativity of\nρP (t) for the same data sets as in figure 2 (weak local fields tan θ̄j = 1/3). We make\ntwo observations. Firstly, tuning the probe frequency provides only one benefit for\n\n\fProbing a composite spin-boson environment\n\n9\nεP /ε̄j = 10\n\nεP /ε̄j = 10\n0.07\n\nμ/ν = 0\nμ/ν = 1\n\n0.01\n0.06\n\n!3\n\n4\n\nx 10\n\n3\n\n0.05\n\n2\n\n0.04\n\nSx (ω)\n\n1\n\nSX (ω)\n\n0\n\n0.03\n\n0\n\n0.5\n\n1\n\n0.005\n\n1.5\n\n0.02\n\nμ/ν = 0\nμ/ν = 1\n\n0.01\n0\n0\n\n0.5\n\n1\n\n1.5\n\n2\n\n2.5\n\n3\n\n0\n\n0\n\n0.5\n\n1\n\n1.5\n\n2\n\nω/ΩP\n\nω/ΩP\n\nεP /ε̄j = 3\n\nεP /ε̄j = 3\n\n2.5\n\n3\n\n0.35\n0.016\n\n0.3\n\n!3\n\nx 10\n\n0.25\n\n1\n\n0.012\n\n0.8\n\nSx (ω)\n\n0.2\n\nSx (ω)\n\n0.6\n0.4\n\n0.008\n\n0.15\n\n0.2\n0\n\n0\n\n0.5\n\n1\n\n1.5\n\n0.1\n0.004\n0.05\n0\n0\n\n0.5\n\n1\n\n1.5\n\n2\n\n2.5\n\n3\n\n0\n\n0\n\n0.5\n\n1\n\nω/ΩP\nεP /ε̄j = 1\n\n2.5\n\n3\n\n2\n\n2.5\n\n3\n\n0.04\n!3\n\n2\n\n0.035\n\nx 10\n\n1.5\n\n0.08\n\n2\n\nεP /ε̄j = 1\n\n0.12\n0.1\n\n1.5\n\nω/ΩP\n\n0.03\n\n1\n\n0.025\n0.5\n\nSx (ω)\n\n0\n\n0\n\n0.5\n\n1\n\nSx (ω)\n\n1.5\n\n0.015\n\n0.04\n\n0.01\n0.02\n0\n\n0\n\n0.005\n0.5\n\n1\n\n1.5\n\n2\n\nω/ΩP\n\n(a) tan θ̄j = 1/3.\n\n2.5\n\n3\n\n0\n\n0\n\n0.5\n\n1\n\n1.5\n\nω/ΩP\n\n(b) tan θ̄j = 3.\n\nFigure 3. Estimated power spectrum of hM̂x (t)i for εP /ε̄j = 10 (top row),\n3 (second row) and 1 (third row). As the local field strength tan θj = ∆j /εj\nincreases from 3(a)–3(b), TLF relaxation dominates TLF dephasing. See text for\ndiscussion.\n\ndistinguishing μ = 0 from μ 6= 0. This is evidenced by the remarkable qualitative\nsimilarity between figures 4(a), 4(b), and 4(c). The benefit is the number of probe\nqubit cycles required to distinguish the two cases (time is shown in units of probe\nqubit cycles). Secondly, it is clear that strongly coupled TLFs (the gold line) cause\nless entanglement to generate within the probe. This can be explained by invoking\nthe concept of entanglement monogamy [23, 30]. As the TLF-TLF connectivity\nincreases, the indirect link between the two probe qubits is weakened, and so remote\nentanglement generation slows. It is important to emphasize which partitions one\nshould consider when invoking monogamy arguments. The relevant quantity is\nthe entanglement shared between each probe qubit and a given TLF; this is the\n\n\fProbing a composite spin-boson environment\n\n10\n\nquantity that is sensitive to entanglement sharing in two ways: (1) It decreases as\nthe entanglement in the probe builds up, independently of the connectivity in the\nTLF environment; (2) It \"feels\" the TLF-TLF coupling in the sense that, within a\nselected time interval, the stronger the fluctuators couple, the smaller the entanglement\nbetween probe qubit and TLF becomes. As a result, remote entanglement builds\nup more slowly when fluctuators couple so that it quickly degrades in a decohering\nenvironment, as illustrated by results in figure 5.\n0.15\n\nμ/ν\nμ/ν\nμ/ν\nμ/ν\nμ/ν\nμ/ν\n\n0.1\n\n=\n=\n=\n=\n=\n=\n\n0.25\n\n0\n0.2\n0.4\n0.6\n0.8\n1\n\n0.35\n0.3\n\n0.2\n0.25\n0.15\n\nEP\n\nEP\n\nEP\n\n0.2\n\n0.15\n\n0.1\n0.05\n\n0.1\n0.05\n0.05\n\n0\n0\n\n50\n\n100\n\nΩP t\n\n150\n\n200\n\n(a) εP = 10ε̄j .\n\n0\n0\n\n50\n\n100\n\nΩP t\n\n150\n\n(b) εP = 3ε̄j .\n\n200\n\n0\n0\n\n50\n\n100\n\nΩP t\n\n150\n\n200\n\n(c) εP = ε̄j .\n\nFigure 4. Entanglement (logarithmic negativity) in the probe as a function of\nprobe cycles, for small TLF local field strength tan θ̄j = 1/3. Note the distinct\ndifference between strongly interacting TLFs (μ ≈ ν) and non-interacting TLFs\n(μ = 0).\n\n3.2.2. Effect of the TLF local field. Unlike the power spectrum (figure 3), the probe\nentanglement EP (t) remains useful for distinguishing μ = 0 from μ 6= 0 for strong\nlocal fields in the TLFs where tan θ̄j > 1. Figure 5 shows the probe entanglement as\na function of time for the same data sets as in figure 3. It is clear that entanglement\nis generated within the probe for some time, before the TLF decoherence causes it to\ndissipate. As argued before, this loss of generated probe entanglement occurs faster\nfor highly connected TLFs with μ/ν = 1, as one might expect, even without no\nexplicit mention of monogamy constraints, since these TLF-TLF connections provide\nmore links between the probe qubits and the TLF decoherence channels. This\nfaster dissipation of generated entanglement for highly-connected TLFs allows us to\ndistinguish between μ/ν = 0 and μ/ν = 1 after 10 to 50 probe qubit cycles, depending\non the TLF parameters. Similar conclusions can be drawn for tan θ̄j = 1.\n3.3. Discussion of the results\nSince we are performing local measurements on each probe qubit, one might ask if\nthere are any advantages of using a double-qubit probe. An obvious advantage is that\nentanglement within the probe becomes an accessible quantity that is not possible in\na single-qubit probe. This is important for detecting the TLF-TLF connectivity, as we\nhave seen that this task was achievable over a wider range of TLF parameters using\nthe probe entanglement than the power spectra of the probe magnetization (which\nyielded qualitatively similar results for both types of probes).\nIn section 3 we were able to distinguish between composite spin-boson\nenvironments with high connectivity from those with low connectivity. The parameter\nranges for which our findings were robust are: εP /ε̄j = 1, 3, 10 (tunable), 1/3 ≤\n\n\fProbing a composite spin-boson environment\n\n11\nεP /ε̄j = 10\n\nεP /ε̄j = 10\n0.012\n\n0.2\n\nμ/ν = 0\nμ/ν = 1\n\n0.01\n\n0.15\n0.008\n\nEP\n\nEP 0.1\n\n0.004\n\n0.05\n0.002\n\n0\n\n0\n\n50\n\n100\n\nΩP t\n\n150\n\n0\n0\n\n200\n\n20\n\n40\n\nΩP t\n\n60\n\n80\n\n100\n\nεP /ε̄j = 3\n\nεP /ε̄j = 3\n0.16\n\n0.4\n\n0.14\n\n0.35\n\n0.12\n\n0.3\n\n0.1\n\n0.25\n\nEP\n\nEP\n0.08\n\n0.2\n\n0.06\n\n0.15\n\n0.04\n\n0.1\n\n0.02\n\n0.05\n\n0\n0\n\n50\n\n100\n\nΩP t\n\n150\n\n200\n\n0\n0\n\n50\n\nεP /ε̄j = 1\n\n100\n\nΩP t\n\n150\n\n200\n\n150\n\n200\n\nεP /ε̄j = 1\n0.9\n\n0.35\n\n0.8\n\n0.3\n\n0.7\n\n0.25\n\n0.6\n\n0.2\n\nEP 0.5\n\n0.15\n\n0.4\n\nEP\n\n0.3\n\n0.1\n\n0.2\n\n0.05\n0\n0\n\n0.1\n\n50\n\n100\n\nΩP t\n\n150\n\n(a) tan θ̄j = 1/3.\n\n200\n\n0\n0\n\n50\n\n100\n\nΩP t\n\n(b) tan θ̄j = 3.\n\nFigure 5. Entanglement (logarithmic negativity) between the probe qubits for\nεP /ε̄j = 10 (top row), 3 (second row) and 1 (third row). The cases μ = 0 (solid\nblue line) and μ = ν (dashed gold line) are qualitatively distinguishable unless\nboth ε̄j /εP = 1 and tan θ̄j > 1. Note that the upper limits of the axes change\nbetween plots. Same data sets as in figure 3.\n\ntan θ̄j ≤ 3. Other parameters (Γ, etc) are restricted to lie within the ranges that\nensure validity of the master equation - see Appendix A.\nFor all numerical calculations in this paper we have assumed effectively zerotemperature bosonic baths where n̄j = [exp(~Ωj /kB T ) − 1]−1 \u001c 1. The relevant\nfrequencies for experiments with Josephson qubits are in the vicinity of 10 GHz\n[4, 32, 6, 7], with cryostat temperatures of the order of 30 mK [4]. These values\ngive n̄ ∼ 0.1, so the low-temperature approximation is good.\nIn general, determining the probe entanglement would require full quantum-state\n\n\fProbing a composite spin-boson environment\n0.35\n\n12\n0.12\n\n0.3\n\n0.1\n\n0.25\n\n0.08\n\n0.2\n0.06\n\n0.15\n0.04\n\n0.1\n\nEP\nC1\nC2\nC2!\n\n0.05\n0\n0\n\n50\n\n100\n\nΩP t\n\n150\n\n0.02\n\n200\n\n(a) μ = 0.\n\n0\n0\n\n50\n\n100\n\nΩP t\n\n150\n\n200\n\n(b) μ = ν.\n\nFigure 6. Lower bounds on the probe entanglement as described in [24]. Only\nthe optimal bound C20 (dotted red line) provides a good approximation to the\nprobe entanglement. Parameters are tan θ̄j = 1/3, εP /ε̄j = 1, and |ψ(0)i = |++i.\n\ntomography. Here we consider estimating the probe entanglement from measurements\nless costly than full quantum state tomography, as described in [24] (and references\nwithin). The result is lower bounds on the entanglement - we refer the reader to [24]\nfor details.\nFor all parameter regimes considered in this paper we found that one of the lower\nbounds given in [24] - the optimal one given in (5) - provided a remarkably good\napproximation to the probe entanglement for all times. The other lower bounds C1,2\nin [24] didn't approximate the probe entanglement well for any time. An example is\nshown in figure 6. The solid line is the entanglement within the probe (logarithmic\nnegativity), and the dotted line shows the lower bound given by\nC20 (ρP ) = max[0, log2 (1 + |λ1 | + |λ2 | + |λ3 |) − 1],\nwhere λ1,2,3 are the eigenvalues of\n xx xy\nc\nc\nΛ =  cyx cyy\nczx czy\n\nthe matrix\n\ncxz\ncyz  .\nczz\n\n(5)\n\n(6)\n\nB\nThe matrix Λ is formed from probe observables cij = Tr[ŝA\ni ⊗ ŝj ρP ] (i, j = x, y, z).\nNote that cij = cji due to the symmetry of the problem.\n\n4. Decoherence of entangled states\nEntanglement has been identified as a key resource for quantum information\nprocessing. It is therefore important to study the loss of entanglement induced by\ncoupling with an environment, as this coupling is generally unavoidable. In this section\nwe reconsider our double-qubit probe as a double-qubit register (DQR) interacting\nwith the same spin-boson environment (four damped TLFs) as above. Starting the\nDQR in an entangled pure-state, and the TLFs in their ground state (as before)\nwith weak local fields tan θ̄j < 1, we numerically investigate the behaviour of the\nlogarithmic negativity as a function of time. Specifically, we consider the lifetime of\ndistillable entanglement (for which the logarithmic negativity is an upper bound). We\n\n\fProbing a composite spin-boson environment\n\n13\n\ncompare our results to previous studies of entanglement decay [33, 34], all of which\nused rather less sophisticated models for the environment. Nevertheless, we find some\nqualitative similarities between our results and previous work.\nReference [33] consider multiqubit states whereby each qubit is damped by\nindependent baths. We refer to this as 'direct' damping, by an equilibrium\nenvironment (a reservoir). In our non-equilibrium spin-boson environment, the\ndamping is mediated by the TLFs and we refer to this as 'indirect' damping of\nthe DQR. Reference [33] parameterizes time via the probability for a qubit to\nexchange a quantum of energy with its bath (in the absence of pure dephasing),\np(t) = 1 − exp[−γ(2n̄ + 1)t/2]. Here γ is the zero-temperature damping rate, and n̄\nis the mean number of excitations in the bath (n̄ = 0 is zero temperature). When\nthe DQR logarithmic negativity falls below an arbitrarily small fraction of its initial\nvalue, \u000f \u001c 1, the distillable entanglement can be considered zero. The time at which\nthis occurs is t\u000f . For generalized GHZ states (requiring > 3 qubits), and for three\ndifferent types of direct damping, [33] found that p(tε ) ∝ − log \u000f (although they were\nlooking at it from a slightly different perspective, as we comment later). Remarkably,\nwe find numerical evidence of the same qualitative behaviour for the decay of the |φ± i\nBell states in a DQR (see figure 7).\nFor low temperature T ∼mK (as we have considered throughout this paper unless\notherwise noted), weak TLF local field tan θ̄j = 1/3, and TLFs with relatively small\ncharge: εP = 3ε̄j , we consider√the DQR to be initially in\n√ each of the four Bell states\nin turn: |φ± i = (|00i ± |11i)/ 2, |ψ ± i = (|01i ± |10i)/ 2. Figure 7 shows the DQR\nlogarithmic negativity as a function of time, as well as p(t\u000f ) = 1 − exp(−t\u000f /2) for a\nDQR initially in the states |φ± i. It is evident that p(t\u000f ) ∝ − log \u000f for |φ± i. Further, we\ncan see that interacting TLFs (the gold traces) tend to reduce the DQR entanglement\nfaster. This is expected since interacting TLFs provide more connections between the\nDQR and the baths. For the chosen set of parameters (particularly ∆ = 0 for the\nDQR), the states |ψ ± i commute with ĤP + V̂P and so don't evolve, nor couple to\nthe TLFs. We found the same qualitative behaviour for εP /ε̄j = 1 and 10 when the\nTLF local fields were not strong: tan θ̄j . 1. For strong local fields tan θ̄j & 3, the\nlinear relationship p(t\u000f ) ∝ − log \u000f did not hold in general. This was because the probe\nentanglement tended to exhibit quite erratic behaviour, such as multiple collapses and\nrevivals.\nA comment on the previous work in [33, 34] is appropriate here. In those works,\nthe decay of N -particle entanglement was considered as a function of N . In [33]\nit was found that p(t) ∝ −(1/N ) log \u000f. Here we have fixed N = 2 and found that\np(t) ∝ − log \u000f. Our focus is slightly different, but it is interesting that the loss of\ndistillable entanglement (logarithmic negativity) is qualitatively the same for direct\nand indirect damping of bipartite qubit states (within the parameter regimes discussed\nin the previous paragraph). It is important to remark that the coincidence with\nthe predictions for the decoherence of multipartite states subject to independent\nreservoirs should not be considered as a general result given that we analyzed a\nvery special case, which is the one of two entangled qubits in selected parameter\nregimes. What is relevant for our purposes is the fact that the agreement with the\nanalytical prediction in [33] for direct decoherence points out a sharp asymmetry in\nthe processes of entanglement \"destruction\" and (remote) entanglement generation\nin a composite environment, so that there are circumstances where the TLF systems\nmay be essentially invisible when analyzing the decoherence of initially entangled\nprobe states, while the presence of the TLFs would be revealed when monitoring\n\n\fProbing a composite spin-boson environment\n\n14\n\n|ψ(0)! = |φ+ !\n\n1\n\nμ/ν = 0\nμ/ν = 1\n\nμ/ν = 0\nμ/ν = 1\n\n0.35\n\n1 − exp(−t! /2)\n\n0.8\n\n|ψ(0)! = |φ+ !\n\n0.4\n\n0.6\n\nEP\n0.4\n\n0.3\n\n0.25\n\n0.2\n\n0.2\n\n0\n0\n\n50\n\n100\n\n150\n\nΩP t\n\n200\n\n2\n\n|ψ(0)! = |φ !\n\n3\n\n1\n\n0.4\n\n0.6\n\nEP\n0.4\n\n6\n\n5\n\n6\n\n0.3\n\n0.25\n\n0.2\n\n0\n0\n\n5\n−\n\n0.35\n\n1 − exp(−t! /2)\n\n0.8\n\n4\n\n− log #\n\n|ψ(0)! = |φ !\n\n−\n\n0.2\n\n50\n\n100\n\n150\n\nΩP t\n\n200\n\n250\n\n300\n\n2\n\n3\n\n4\n\n− log #\n\nFigure 7. Decay of entanglement (logarithmic negativity) in a double-qubit\nregister initially in the Bell states |φ+ i (top row) and |φ− i (second row) for\nuncoupled TLFs (μ = 0, solid blue line) and coupled TLFs (μ = ν, dashed gold\nline). Other parameters are tan θ̄j = 1/3 and εP /ε̄j = 3. See text for discussion.\n\nentanglement creation in the probe.\n5. Effect of spin-boson environment on entangling gate operations\nIn this section we investigate the effects of the composite spin-boson environment\non the performance of entangling gates. Starting the DQR in the separable state\nB\n|ψP (0)i = |++i, we consider two entangling gates: a ZZ gate (ŝA\nz ⊗ ŝz ); and an\nA\nB\nA\nB\nXX+YY gate [ŝx ⊗ ŝx + ŝy ⊗ ŝy ]. In the ideal case there are no TLFs and bipartite\nentanglement (quantified again by the logarithmic negativity) is generated between\nthe isolated register qubits in an oscillatory fashion as shown by the solid red curves\nin figure 8. In the presence of four TLFs, the entangling gate performance is clearly\nreduced, and further modified depending on the strength of the local fields in the TLFs.\nThis may be understood as follows. We have argued that the presence of a coherent\ncoupling between the TLFs leads to a decrease in the effective interaction strength\nbetween the qubits in the probe, i.e., the \"effectiveness\" of the indirect link between\nprobe qubits is diminished, a result that can be interpreted in terms of monogamy\nconstraints leading to a slow down in the process of remote entanglement creation.\nIn the case of the entangling gates, one could perhaps argue similarly, considering\nnow a bipartition separating the probe qubits. The higher the connectivity in the\nenvironment, the slower the entangling gate can operate, as illustrated in figure 9.\n\n\fProbing a composite spin-boson environment\n\n15\n\nPerformance of XX+YY gate\n\nPerformance of XX+YY gate\n\n1\n\n1\n\n0.8\n\n0.8\n\n0.6\n\n0.6\n\nEP\n\nEP\n\n0.4\n\n0.2\n\n0\n0\n\n0.4\n\nμ/ν = 0\nμ/ν = 1\nν=0\n2\n\n0.2\n\n4\n\nΩP t\n\n6\n\n8\n\n0\n0\n\n10\n\n2\n\n4\n\nΩP t\n\n6\n\n8\n\n10\n\n8\n\n10\n\nPerformance of ZZ gate\n\nPerformance of ZZ gate\n1\n\n1\n\n0.8\n\n0.8\n\n0.6\n\n0.6\n\nEP\n\nEP\n0.4\n\n0.4\n\n0.2\n\n0.2\n\n0\n0\n\n2\n\n4\n\nΩP t\n\n6\n\n(a) tan θ̄j = 1/3.\n\n8\n\n10\n\n0\n0\n\n2\n\n4\n\nΩP t\n\n6\n\n(b) tan θ̄j = 3.\n\nFigure 8. Entanglement (logarithmic negativity) between the register qubits for\n|ψ(0)i = |++i, εP /ε̄j = 1 generated by XX+YY (top row), and ZZ (bottom row)\ngates. The presence of TLFs (blue dashed and green dotted lines) diminishes the\nperformance of the entangling gates, as would be expected.\n\nAt longer times (the order of 100 register-qubit cycles and greater), the DQR\nappears to approach an entangled steady state for weak local fields tan θ̄j = 1/3. This\nis shown in figure 9 for the ZZ gate (the same qualitative behaviour occurred for the\nXX+YY gate). We were unable to obtain analytical results to verify the presence\nof steady-state entanglement in the DQR generated by either gate (ZZ or XX+YY),\nwhen coupled to four TLFs. Our numerical study found that entanglement generated\nin the DQR was dissipated more rapidly (in less probe qubit cycles) for strong local\nfields in the TLFs.\n6. Conclusion\nWe have considered superconducting qubits which are subject to decoherence\ndominated by low-frequency noise thought to be produced by interactions with a\nsmall number of defects/impurities. We model these impurities as coherent two-level\nfluctuators (TLFs) that are under-damped by baths of bosonic modes (e.g. phonons).\nWe probed such a composite spin-boson environment by making measurements on\na pair of noninteracting qubits that each interact directly with the TLFs. Our\nextensive numerical study revealed that the presence or absence of coherent coupling\n(connectivity) between the TLFs can be discriminated in two ways: from the\n\n\fProbing a composite spin-boson environment\n\n16\n\n1\n\n0.8\n\n0.6\n\nEP\n0.4\n\nμ/ν = 0\nμ/ν = 1\nν=0\n\n0.2\n\n0\n0\n\n20\n\n40\n\nΩP t\n\n60\n\n80\n\n100\n\nFigure 9. Long-time entanglement (logarithmic negativity) between the register\nqubits generated by a ZZ gate, for |ψ(0)i = |++i, εP /ε̄j = 1 and tan θ ̄j = 1/3.\n\nestimated power spectrum of the probe magnetization (requiring relatively long-time\nmeasurements) and from entanglement generated within the probe, mediated by the\nspin-boson environment. We argue that entanglement monogamy considerations [23]\nallow interpretation of our results in terms of an effective decrease in the remote\ninteraction strength when the environment is connected, which yields to a creation of\nquantum correlations on a much larger time scale as compared with the uncoupled\nfluctuator case.\nWe also showed that this remotely generated entanglement can be well-estimated\nby a lower bound [24] that requires less experimental effort than the full quantum\nstate tomography required to evaluate the entanglement. The upshot is that this\nconnectivity of the TLFs should be discernible using tractable measurements in a real\nexperiment. This result is important for studies of quantum-mechanical phenomena\nin Josephson devices (including quantum computing) where it is desirable to minimize\nthe effects of decoherence, for which the TLF-TLF connectivity may play a significant\nrole [17].\nWhen considering the effects of the spin-boson environment on a double-qubit\nregister initially prepared in a maximally-entangled (Bell) state, we showed that the\npresence of TLFs may be unnoticeable in certain parameter regimes, in the sense that\nentanglement degradation there is well approximated by the same decrease law as for\ndirect decoherence. This fact emphasizes the possible usefulness of monitoring the\nreverse process of entanglement generation for environmental probing.\nThe presence of TLF-TLF coupling also showed a reduction in the performance\nof entangling gate operations performed on the register. Our extensive numerical\nstudy can be supplemented by an analytical treatment of a simpler situation valid for\nshort times, where TLF decoherence can be ignored. These results will be presented\nelsewhere [35].\n\n\fProbing a composite spin-boson environment\n\n17\n\nAcknowledgments\nWe are very grateful to Simone Montangero for discussions on several aspects of\nthe simulations and to Shash Virmani for discussions on monogamy constraints.\nThis work was supported by the EU through the STREP project CORNER, the\nIntegrated project on Qubit Applications QAP, and the Integrated project EuroSQIP.\nAR acknowledges support from a University of Hertfordshire Fellowship.\nAppendix A. Derivation of the master equation\nConsider a single charge qubit \"system\" coupled to a finite number of independent\ncharged impurities that fluctuate coherently between two configurations. These\ncoherent two-level fluctuators (TLFs) are coupled to independent bosonic baths\n(phonons in the substrate, for example) that produce damping. The total Hamiltonian\nis the sum of free Hamiltonians for the single qubit, the TLFs, and the baths, and the\ninteraction Hamiltonians:\nĤ = Ĥsq + ĤTLF + ĤB + V̂sq−TLF + V̂TLF−B .\nP\n(j)\n(j)\nThe free Hamiltonians are Ĥsq = (εσ̂z + ∆σ̂x )/2, ĤTLF =\nj (εj σ̂z + ∆j σ̂x )/2,\nP\n†\nĤB =\nj,` ω` â`,j â`,j (the baths can be assumed to be identical so ω`,j = ω` ).\nP\n(j)\nThe coupling Hamiltonians are V̂sq−TLF =\nj νj σ̂z σ̂z (Coulomb interactions),\nP\n(j)\nV̂TLF−B = j,` λ` σ̂z (â`,j + â†`,j ) (similarly to ω` , the couplings are assumed to be\nindependent of the baths: λ`,j = λ` ). We denote the charge-basis Pauli operators by\nσ̂x,y,z . At this stage the TLFs are not interacting.\nThe TLF-related energies εj , ∆j and νj are randomly distributed following\nindependent distributions discussed in [5]. The details of these distributions are critical\nfor realizing the experimentally observed 1/f noise spectrum of the qubit voltage/bias.\nWe refer to the eigenbases of Ĥsq and ĤTLF as the pseudo-spin bases, and denote\nthe corresponding Pauli operators as ŝx,y,z . The Hamiltonians in the pseudo-spin basis\nare\n1\nĤsq\n= Ωŝz\n2\n1X\nĤTLF =\nΩj ŝ(j)\nz\n2 j\nX\n(j)\nV̂sq−TLF =\nνj (cos θj ŝ(j)\nz − sin θj ŝx )(cos θŝz − sin θŝx )\nj\n\nV̂TLF−B =\n\nX\n\n\u0010\n\u0011\n†\n(j)\nλ` (cos θj ŝ(j)\nz − sin θj ŝx ) a`,j + a`,j\n\n`,j\n\nwhere tan θj ≡ ∆j /εj . In order to obtain the Master equation we move to an\ninteraction picture with respect to the Hamiltonian\nĤ0 = Ĥsq + ĤTLF + ĤB + V̂sq−TLF .\nIn this picture the evolution equation for the total system is:\ndρ̃tot (t)\n= −i[ṼTLF−B (t), ρ̃tot (t)]\ndt\n\n\fProbing a composite spin-boson environment\n\n18\n\nwhere\nρ̃tot (t)\n\n= exp(iĤ0 t)ρtot exp(−iĤ0 t),\n\nṼTLF−B (t) = exp(iĤ0 t)V̂TLF−B exp(−iĤ0 t).\nBy iterating once the above equation as usual [36, 29] we obtain\nZ t\ndρ̃(t)\n= − Trenv\ndt0 [ṼTLF−B (t), [ṼTLF−B (t0 ), ρ̃tot (t0 )]]\ndt\n0\nwhere Trenv denote the trace over\nNall of the baths. By assuming a factorized initial\nstate of the form ρtot (0) = ρ(0) j ρb,j , with ρ(0) the initial state of the \"qubit +\nTLFs\" and ρb,j a thermal state of the jth bath, we may make a Born approximation\nin the coupling constants λ` . The evolution equation becomes\nZ t\nO\ndρ̃(t)\n' − Trenv\ndt0 [ṼTLF−B (t), [ṼTLF−B (t0 ), ρ̃(t0 )\nρb,j ]].\ndt\n0\nj\nSince the baths are independent and they are all in a thermal state (diagonal in the\nnumber basis), by inserting the expression for ṼTLF−B (t) it is easy to check that\n\"\nXZ t\ndρ̃(t)\n†\n0\n(j)\n= − Trenv\ndt λ` (cos θj s̃(j)\nz (t) − sin θj s̃x (t))(ã`,j + ã`,j ),\ndt\n0\n`,j\n\u0014\n\u0015#\nO\n†\n0\n(j) 0\n0\nλ` (cos θj s̃(j)\nρb,j .\nz (t ) − sin θj s̃x (t ))(ã`,j + ã`,j ) , ρ̃(t )\nj\n\nThis is basically a sum of the expressions obtained in the standard derivation [36, 29]\nfor the one qubit case. Now we make the next crucial assumption in the derivation.\nAssuming weak qubit-fluctuator coupling whereby νj \u001c Ωj (as in the experiments of\n[4, 6, 7] - see below), we may approximate the Heisenberg operators of the TLFs in\nthe interaction picture as:\ns̃(t) ' exp(iĤ00 t)ŝ exp(−iĤ00 t),\n\n(A.1)\n\nwhere Ĥ00 = Ĥsq + ĤTLF is the sum of the free Hamiltonians. For example, we find\n(j)\n(j)\nthat s̃± (t) = ŝ± e±iΩj t .\nOne may question the validity of our assumption of weak qubit-fluctuator\ncoupling. For guidance we consider the experiments of [4] (charge qubit), [6] (phase\nqubit) and [7] (flux qubit), where νj . 0.1GHz and Ωj ∼ Ω ∼ GHz, which falls within\nthis weak-coupling regime (the qubit-fluctuator coupling strength in the experiment\nof [4] is estimated in [9]). In this regime we can insert the result of the one qubit case\nfor every fluctuator j:\nn\no\nX\ndρ̃(t)\n(j)\n(j)\n=\nΓ(j)\ns̃\n(t)ρ̃(t)s̃\n(t)\n−\nρ̃(t)\nz\nz\nz\ndt\nj\no\nn\n(j)\n(j)\n(j)\n(j)\n(j)\n(j)\n(j)\n+ Γ− s̃− (t)ρ̃(t)s̃+ (t) − [s̃+ (t)s̃− (t)ρ̃(t) + ρ̃(t)s̃+ (t)s̃− (t)]/2\no\nn\n(j)\n(j)\n(j)\n(j)\n(j)\n(j)\n(j)\n+ Γ+ s̃+ (t)ρ̃(t)s̃− (t) − [s̃− (t)s̃+ (t)ρ̃(t) + ρ̃(t)s̃− (t)s̃+ (t)]/2 ,\nwhere the TLF ladder operators are s̃± ≡ (s̃x ± is̃y )/2, and the decoherence rates\n(j)\n(j)\n(j)\nare Γz = γz cos2 θj /2, Γ− = (γ− + γ+ ) sin2 θj /4 and Γ+ = γ+ sin2 θj /4. Here\nγz , γ− and γ+ are the dephasing rate, the spontaneous emission rate and stimulated\n\n\fProbing a composite spin-boson environment\n\n19\n\nemission rate respectively, which can be calculated by knowing the spectral properties\nand temperature of the bath.\nNow we return to the Schrödinger picture. For consistency the Heisenberg\noperators need to be sent back into the Schrödinger picture with the same Ĥ00 used\nabove, so that in fact we just need to remove the t argument everywhere above because\nall the oscillating phase factors accrued actually cancel. Therefore the final result is:\nh\ni\nX\ndρ(t)\n(j)\n= − i[Ĥsq + ĤTLF + V̂sq−TLF , ρ(t)] +\nΓz(j) ŝ(j)\nz ρ(t)ŝz − ρ(t)\ndt\nj\nh\ni\n(j)\n(j)\n(j)\n(j) (j)\n(j) (j)\n+ Γ− ŝ− ρ(t)ŝ+ − (ŝ+ ŝ− ρ(t) + ρ(t)ŝ+ ŝ− )/2\nh\ni\n(j)\n(j)\n(j)\n(j) (j)\n(j) (j)\n+ Γ+ ŝ+ ρ(t)ŝ− − (ŝ− ŝ+ ρ(t) − ρ(t)ŝ− ŝ+ )/2 .\nThis master equation is valid when Ωj \u001d νj and Ωj \u001d max{λ` }, ∀j. The first\ninequality is needed in the interaction picture (A.1) and the second inequality is the\nstandard requirement for the Born-Markov approximation.\nWithin the same framework we can analyze other situations, such as interacting\nTLFs, and additional qubits coupled to the TLFs. The master equation for interacting\nTLFs is the same as above, but with the additional Hamiltonian V̂TLF−TLF =\nP\n(j) (k)\nand the requirement that min{Ωj , Ωk } \u001d μj,k . Additional qubits\nj,k μj,k σ̂z σ̂z\ncan be included under similar conditions.\n\nReferences\n\n[1] Devoret M H, Wallraff A and Martinis J M 2004 Superconducting qubits: A short review Preprint\ncond-mat/0411174.\n[2] Leggett A J 2002 J. Phys.: Condens. Matter 14 R415–R451.\n[3] Makhlin Y, Schön G and Shnirman A 2001 Rev. Mod. Phys. 73 357–400.\n[4] Nakamura Y, Pashkin Yu A and Tsai J S 1999 Nature (London) 398 786–788.\n[5] Shnirman A, Schön G, Martin I and Makhlin Y 2005 Phys. Rev. Lett. 94 127002.\n[6] Neeley M, Ansmann M, Bialczak R C, Hofheinz M, Katz N, Lucero E, O'Connell A, Wang H,\nCleland A N and Martinis J M 2008 Nat. Phys. 4 523–526.\n[7] Lupaşcu A, Bertet P, Driessen E F C, Harmans C J P M, and Mooij J E 2008 One- and twophoton spectroscopy of a flux qubit coupled to a microscopic defect Preprint arXiv:0810.0590.\n[8] Paladino E, Faoro L, Falci G, and Fazio R 2002 Phys. Rev. Lett. 88 228304.\n[9] Galperin Y M, Altshuler B L, Bergli J, and Shantsev D V 2006 Phys. Rev. Lett. 96 097009, and\nPreprint cond-mat/0312490.\n[10] Faoro L, Bergli J, Altshuler B L and Galperin Y M 2005 Phys. Rev. Lett. 95 046805.\n[11] Grishin A, Yurkevich I V and Lerner I V 2005 Phys. Rev. B 72 060509.\n[12] Schriefl J, Makhlin Y, Shnirman A and Schön G 2006 New J. Phys. 8 1.\n[13] Abel B and Marquardt F 2008 Phys. Rev. B 78 201302.\n[14] Faoro L and Ioffe L B 2008 Phys. Rev. Lett. 100 227005.\n[15] Paladino E, Sassetti M, Falci G and Weiss U 2008 Phys. Rev. B 77 041303.\n[16] Emary C 2008 Phys. Rev. A 78 032105.\n[17] Yuan S, Katsnelson M I and De Raedt H 2008 Phys. Rev. B 77 184301.\n[18] Schoelkopf R J, Clerk A A, Girvin S M, Lehnert K W, and Devoret M H 2003 Noise and\nmeasurement backaction in superconducting circuits: Qubits as spectrometers of quantum\nnoise Noise and Information in Nanoelectronics, Sensors and Standards (Proc. SPIE vol\n5115) ed L B Kish et al (Bellingham, WA, USA) pp 356–376.\n[19] Ashhab S, Johansson J R and Nori F 2006 New J. Phys. 8 103.\n[20] Reznik R 2003 Found. Phys. 33 167-176.\n[21] Heaney L, Anders J, Kaszlikowski K and Vedral V 2007 Phys. Rev. A 76 053605.\n\n\fProbing a composite spin-boson environment\n[22]\n[23]\n[24]\n[25]\n[26]\n[27]\n[28]\n[29]\n[30]\n[31]\n[32]\n[33]\n[34]\n[35]\n[36]\n\n20\n\nDe Chiara G, Brukner C, Fazio R, Palma G M and Vedral V 2006 New J. Phys. 8 95.\nCoffman V, Kundu J and Wootters W K 2000 Phys. Rev. A 61 052306.\nAudenaert K M R and Plenio M B 2006 New J. Phys. 8 266.\nAstafiev O, Pashkin Yu A, Nakamura Y, Yamamoto T and Tsai J S 2004 Phys. Rev. Lett. 93\n267007.\nLeggett A J, Chakravarty S, Dorsey A T, Fisher M P A, Garg A and Zwerger W 1987 Rev.\nMod. Phys. 59 1–85.\nWiseman H M and Milburn G J 1993 Phys. Rev. A 47 1652.\nTsomokos D I, Hartmann M J, Huelga S F and Plenio M B 2007 New J. Phys. 9 79.\nCarmichael H J 1999 Statistical Methods in Quantum Optics I: Master Equations and FokkerPlanck Equations (Springer, Berlin).\nDawson C M, Hines A P, McKenzie R H and Milburn G J 2005 Phys. Rev. A 71 052321.\nVidal G and Werner R F 2002 Phys. Rev. A, 65 032314.\nSimmonds R W, Lang K M, Hite D A, Nam S, Pappas D P and Martinis J M 2004 Phys. Rev.\nLett. 93 077003.\nAolita L, Chaves R, Cavalcanti D, Acin A, and Davidovich L 2008 Phys. Rev. Lett. 100 080501.\nHein M, Dür W and Briegel H J 2005 Phys. Rev. A, 71 032350.\nRivas A, Oxtoby N P, Huelga S F, Plenio M B and Fazio R (in preparation).\nBreuer H P and Petruccione F 2002 The Theory of Open Quantum Systems (Oxford University\nPress, New York).\n\n\f"}