{"id": "http://arxiv.org/abs/0806.2334v2", "guidislink": true, "updated": "2008-12-11T14:41:29Z", "updated_parsed": [2008, 12, 11, 14, 41, 29, 3, 346, 0], "published": "2008-06-16T16:46:09Z", "published_parsed": [2008, 6, 16, 16, 46, 9, 0, 168, 0], "title": "Multi-Point Propagators in Cosmological Gravitational Instability", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0806.0828%2C0806.3103%2C0806.1753%2C0806.2296%2C0806.0621%2C0806.4154%2C0806.2594%2C0806.2135%2C0806.0848%2C0806.0861%2C0806.3036%2C0806.3011%2C0806.3783%2C0806.4972%2C0806.0482%2C0806.2187%2C0806.1047%2C0806.3629%2C0806.3775%2C0806.3861%2C0806.4416%2C0806.2170%2C0806.3196%2C0806.3808%2C0806.1386%2C0806.4980%2C0806.1660%2C0806.3888%2C0806.3212%2C0806.3754%2C0806.4038%2C0806.4804%2C0806.1711%2C0806.2951%2C0806.1224%2C0806.4928%2C0806.1395%2C0806.1839%2C0806.0920%2C0806.1895%2C0806.2809%2C0806.3626%2C0806.2412%2C0806.1398%2C0806.0782%2C0806.2735%2C0806.1085%2C0806.4967%2C0806.2384%2C0806.2102%2C0806.3165%2C0806.3508%2C0806.1489%2C0806.0318%2C0806.1142%2C0806.0183%2C0806.0805%2C0806.0382%2C0806.2604%2C0806.1810%2C0806.4496%2C0806.2289%2C0806.2435%2C0806.2334%2C0806.2072%2C0806.0970%2C0806.3631%2C0806.2884%2C0806.3854%2C0806.2342%2C0806.4719%2C0806.4772%2C0806.1474%2C0806.3685%2C0806.2785%2C0806.2886%2C0806.4384%2C0806.4611%2C0806.1943%2C0806.4931%2C0806.4742%2C0806.2643%2C0806.4531%2C0806.3321%2C0806.1140%2C0806.3884%2C0806.1563%2C0806.1807%2C0806.4403%2C0806.3121%2C0806.2656%2C0806.4509%2C0806.1158%2C0806.1229%2C0806.3975%2C0806.2692%2C0806.3078%2C0806.1448%2C0806.2007%2C0806.4223%2C0806.4538&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Multi-Point Propagators in Cosmological Gravitational Instability"}, "summary": "We introduce the concept of multi-point propagators between linear cosmic\nfields and their nonlinear counterparts in the context of cosmological\nperturbation theory. Such functions express how a non-linearly evolved Fourier\nmode depends on the full ensemble of modes in the initial density field. We\nidentify and resum the dominant diagrams in the large-$k$ limit, showing\nexplicitly that multi-point propagators decay into the nonlinear regime at the\nsame rate as the two-point propagator. These analytic results generalize the\nlarge-$k$ limit behavior of the two-point propagator to arbitrary order. We\nmeasure the three-point propagator as a function of triangle shape in numerical\nsimulations and confirm the results of our high-$k$ resummation. We show that\nany $n-$point spectrum can be reconstructed from multi-point propagators, which\nleads to a physical connection between nonlinear corrections to the power\nspectrum at small scales and higher-order correlations at large scales. As a\nfirst application of these results, we calculate the reduced bispectrum at\none-loop in renormalized perturbation theory and show that we can predict the\ndecrease in its dependence on triangle shape at redshift zero, when standard\nperturbation theory is least successful.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0806.0828%2C0806.3103%2C0806.1753%2C0806.2296%2C0806.0621%2C0806.4154%2C0806.2594%2C0806.2135%2C0806.0848%2C0806.0861%2C0806.3036%2C0806.3011%2C0806.3783%2C0806.4972%2C0806.0482%2C0806.2187%2C0806.1047%2C0806.3629%2C0806.3775%2C0806.3861%2C0806.4416%2C0806.2170%2C0806.3196%2C0806.3808%2C0806.1386%2C0806.4980%2C0806.1660%2C0806.3888%2C0806.3212%2C0806.3754%2C0806.4038%2C0806.4804%2C0806.1711%2C0806.2951%2C0806.1224%2C0806.4928%2C0806.1395%2C0806.1839%2C0806.0920%2C0806.1895%2C0806.2809%2C0806.3626%2C0806.2412%2C0806.1398%2C0806.0782%2C0806.2735%2C0806.1085%2C0806.4967%2C0806.2384%2C0806.2102%2C0806.3165%2C0806.3508%2C0806.1489%2C0806.0318%2C0806.1142%2C0806.0183%2C0806.0805%2C0806.0382%2C0806.2604%2C0806.1810%2C0806.4496%2C0806.2289%2C0806.2435%2C0806.2334%2C0806.2072%2C0806.0970%2C0806.3631%2C0806.2884%2C0806.3854%2C0806.2342%2C0806.4719%2C0806.4772%2C0806.1474%2C0806.3685%2C0806.2785%2C0806.2886%2C0806.4384%2C0806.4611%2C0806.1943%2C0806.4931%2C0806.4742%2C0806.2643%2C0806.4531%2C0806.3321%2C0806.1140%2C0806.3884%2C0806.1563%2C0806.1807%2C0806.4403%2C0806.3121%2C0806.2656%2C0806.4509%2C0806.1158%2C0806.1229%2C0806.3975%2C0806.2692%2C0806.3078%2C0806.1448%2C0806.2007%2C0806.4223%2C0806.4538&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We introduce the concept of multi-point propagators between linear cosmic\nfields and their nonlinear counterparts in the context of cosmological\nperturbation theory. Such functions express how a non-linearly evolved Fourier\nmode depends on the full ensemble of modes in the initial density field. We\nidentify and resum the dominant diagrams in the large-$k$ limit, showing\nexplicitly that multi-point propagators decay into the nonlinear regime at the\nsame rate as the two-point propagator. These analytic results generalize the\nlarge-$k$ limit behavior of the two-point propagator to arbitrary order. We\nmeasure the three-point propagator as a function of triangle shape in numerical\nsimulations and confirm the results of our high-$k$ resummation. We show that\nany $n-$point spectrum can be reconstructed from multi-point propagators, which\nleads to a physical connection between nonlinear corrections to the power\nspectrum at small scales and higher-order correlations at large scales. As a\nfirst application of these results, we calculate the reduced bispectrum at\none-loop in renormalized perturbation theory and show that we can predict the\ndecrease in its dependence on triangle shape at redshift zero, when standard\nperturbation theory is least successful."}, "authors": ["Francis Bernardeau", "Martin Crocce", "Roman Scoccimarro"], "author_detail": {"name": "Roman Scoccimarro"}, "author": "Roman Scoccimarro", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevD.78.103521", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0806.2334v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0806.2334v2", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "21 pages, 14 figures. Minor changes to match published version (Fig\n  11 changed, added reference)", "arxiv_primary_category": {"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0806.2334v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0806.2334v2", "journal_reference": "Phys.Rev.D78:103521,2008", "doi": "10.1103/PhysRevD.78.103521", "fulltext": "Multi-Point Propagators in Cosmological Gravitational Instability\nFrancis Bernardeau\nInstitut de Physique Théorique, CEA, IPhT, CNRS, URA 2306,\nF-91191 Gif-sur-Yvette, France and Canadian Institute for Theoretical Astrophysics,\nUniversity of Toronto, 60 St. George street, Toronto, Ontario M5S 3H8, Canada\n\nMartı́n Crocce\nInstitut de Ciències de l'Espai, IEEC-CSIC, Campus UAB,\nFacultat de Ciències, Torre C5 par-2, Barcelona 08193, Spain\n\narXiv:0806.2334v2 [astro-ph] 11 Dec 2008\n\nRomán Scoccimarro\nCenter for Cosmology and Particle Physics, Department of Physics, New York University, New York, NY 10003\n(Dated: October 23, 2018)\nWe introduce the concept of multi-point propagators between linear cosmic fields and their nonlinear counterparts in the context of cosmological perturbation theory. Such functions express how a\nnon-linearly evolved Fourier mode depends on the full ensemble of modes in the initial density field.\nWe identify and resum the dominant diagrams in the large-k limit, showing explicitly that multipoint propagators decay into the nonlinear regime at the same rate as the two-point propagator.\nThese analytic results generalize the large-k limit behavior of the two-point propagator to arbitrary\norder. We measure the three-point propagator as a function of triangle shape in numerical simulations and confirm the results of our high-k resummation. We show that any n−point spectrum\ncan be reconstructed from multi-point propagators, which leads to a physical connection between\nnonlinear corrections to the power spectrum at small scales and higher-order correlations at large\nscales. As a first application of these results, we calculate the reduced bispectrum at one-loop in\nrenormalized perturbation theory and show that we can predict the decrease in its dependence on\ntriangle shape at redshift zero, when standard perturbation theory is least successful.\nPACS numbers:\n\nI.\n\nINTRODUCTION\n\nDetailed understanding of the development of gravitational instability is one of the central issues for the\nstudy of structure formation in observational cosmology.\nAlthough the details of the formation of objects are affected at small scales by the presence of baryonic matter,\nin the context of a dark matter dominated universe it\nis thought that the global properties of the large-scale\nmatter distribution is determined to a large extent by\nthe collisionless dynamics of dark matter. Therefore, the\nVlasov equation, i.e. the collisionless limit of the Boltzmann equation, describes the dynamics we are interested\nin (see e.g. [1, 17] for details). This is for instance what\npure N-body cosmological simulations attempt to solve.\nAt large scales, where orbit crossing is insignificant, the\nVlasov equation reduces to the dynamics a pressureless\nperfect fluid.\nAlthough the problem is well posed, its resolution beyond the linear regime is still largely an open question.\nSome ideas have been developed in the literature (see\ne.g. [1] and references therein) but to make predictions\nbeyond the linear regime for the density power spectrum,\nthe standard approach in the literature has been to resort\nto semi-analytic prescriptions obtained by fitting to numerical simulations. These fitting formulae, e.g. [16, 23],\noriginate either from the near universal transform advocated in [8] or are based on an even more empirical\nconstruction, the halo model [2].\n\nThese prescriptions however offer predictions for the\npower spectrum with relatively low accuracy, at the level\nof 5-10%, and are insecure in cases of non standard cosmological models. With the advent of precision observations of the large-scale structure, in particular in the\ncontext of the search for dark energy signatures in the\ngrowth of structure, this is clearly insufficient [10]. It\nthen becomes crucial to build reliable, and well controlled, prescriptions for describing the nonlinear evolution of the power spectrum and higher order correlation\nfunctions such as the bispectrum. For the latter there is\nnot much published work on the expected behavior beyond tree order, although fitting formulae analogous to\nthe power spectrum case have been proposed [9, 15, 22].\nRecently, a promising new approach to fitting measurements of statistics in N-body simulations and interpolating to other cosmologies has been developed in [7].\nWith the Renormalized Perturbation Theory (hereafter RPT) formalism introduced in [5], a new approach\nemerged for the construction of perturbation schemes\napplicable to such observables. It has been successfully applied to the two-point propagator [4], and to\nthe density power spectrum in the weakly non-linear\nregime [6]. These results show in particular how the\nacoustic peaks are affected by the mode-coupling effects\nin the growth of structure. This reformulation of the\ngravitational perturbation theory also finds alternative\napproaches [11, 13, 14, 25, 26], which give further insights into resummation schemes introduced by RPT.\n\n\f2\nThe aim of this article is to show that some of the core\nresults that have been originally discovered for the twopoint propagator in [4] can also be obtained in the case\nof multi-point propagators, thus extending exact known\nresults regarding the evolution of cosmic gravitational\ninstability.\nThe plan of the paper is the following. We first succinctly recall the general formalism and the results that\nhave already been obtained at the two-point level [4],\ninvolving the cross-correlation between fields at the initial and final conditions. As shown in previous studies,\nthe behavior of this correlator at large-k is of crucial importance and provides us with solid ground for the expansion of the correlation functions of interest [6]. We\nthen show that the three-point propagator, namely the\ncross-correlation between the final density field and two\nof the initial modes, can also be computed explicitly in\nthe high-k limit. This quantity reflects how the final\ndensity is sensitive to the two mode-mode couplings. We\nthen extend this result to propagators of arbitrary number of points. This is the central result of this paper.\nTo contrast our results with numerical simulations, we\nextend the method developed in [4] to measure multipoint propagators. This allows us to compute the threepoint propagator in numerical simulations against our\npredictions in the large-k regime. We finally comment\non the relevance of these results for the construction of\npower spectrum and bispectrum resummation schemes,\nand provide a first application to the case of the bispectrum.\n\nII.\n\n∂s Ψa (k, s) + Ωab Ψb (k, s) =\nγabc (k, k1 , k2 ) Ψb (k1 , s) Ψc (k2 , s), (3)\nwhere\nΩab ≡\n\n\"\n\n#\n0\n−1\n,\n−3/2 1/2\n\n(4)\n\nand the symmetrized vertex matrix γabc describes the non\nlinear interactions between different Fourier modes and\nis given by\n|k1 + k2 |2 (k1 * k2 )\n,\n2k12 k22\n(k1 + k2 ) * k1\nγ121 (k, k1 , k2 ) = δD (k − k1 − k2 )\n, (5)\n2k12\n\nγ222 (k, k1 , k2 ) = δD (k − k1 − k2 )\n\nγ112 (k, k1 , k2 ) = γ121 (k, k2 , k1 ), and γ = 0 otherwise;\nwith δD denoting the Dirac delta distribution. The formal integral solution to Eq. (3) is given by (see [5, 19, 20]\nfor a detailed derivation),\nZ s\nΨa (k, s) = gab (s) φb (k) +\nds′ gab (s − s′ )\n0\n(s)\n×γbcd (k, k1 , k2 )Ψc (k1 , s′ )Ψd (k2 , s′ ),\n\nDYNAMICS\n\nCosmological gravitational instability in a pressureless\nfluid in the single stream limit (when orbit crossing can\nbe neglected) is governed by a set of three coupled equations relating the density contrast δ = ρ/ρ̄ − 1, the peculiar velocity field v and the gravitational potential. Consistently with this limit one can assume the fluid to be\nirrotational and thus fully described by δ and the velocity divergence, θ ≡ ∇ * v. Following [19], the equations\nof motion in Fourier space can be written in a compact\nform with the use of the two component quantity\n\u0010\n\u0011\nΨa (k, s) ≡ δ(k, s), −θ(k, s)/H ,\n(1)\n\nwhere the index a = 1, 2 selects the density or velocity\ncomponents, H ≡ d ln a/dτ is the conformal expansion\nrate, a(τ ) the cosmological scale factor and τ conformal\ntime. The time variable s is defined from the scale factor\nby\ns ≡ ln a(τ ),\n\nthe scales we are interested in to a very good approximation by replacing a(τ ) by the linear growth factor of the\ncosmology under consideration [1].\nThe equations of motion then read (we henceforth use\nthe convention that repeated Fourier arguments are integrated over),\n\n(2)\n\nand corresponds to the number of e-folds of expansion.\nWe will first consider a cosmology with Ωm = 1 and\nΩΛ = 0. The extension to a general case is obtained at\n\n(6)\n\nwhere φa (k) ≡ Ψa (k, s = 0) denotes the initial conditions, set when the linear growth factor a(τ ) = 1 and\ns = 0. The linear propagator gab (s) is given by\n\"\n#\n\"\n#\ne−3s/2 −2 2\nes 3 2\n−\n,\n(7)\ngab (s) =\n3 −3\n5 3 2\n5\nfor s ≥ 0, whereas gab (s) = 0 for s < 0 due to causality,\nand gab (s) → δab as s → 0+ . We will work with growing\nmode initial conditions, as usually assumed in numerical\nsimulations, for which\nφa (k) = ua δ0 (k),\n\n(8)\n\nand ua = (1, 1).\nA perturbative solution to Eq. (6) can be obtained expanding the fields in terms of the initial ones,\nΨa (k, s) =\n\n∞\nX\n\nΨ(n)\na (k, s),\n\n(9)\n\nn=1\n\nwith\nΨ(n)\na (k, s) =\n(n)\n\nZ\n\nd3 k1 . . . d3 kn δD (k − k1...n )\n\n× Fab1 b2 ...bn (k1 , . . . , kn ; s)φb1 (k1 ) . . . φbn (kn ),\n\n(10)\n\n\f3\n\n(1)(k) =\n\nΨa\n\nφb(k)\ns\n\ngab(s)\nφe(k1)\ngce(s')\n\nΨa(2)(k) =\n\ngab(s-s')\ns\n\nΥbcd\ns'\n\ngdf(s')\n\nφf(k2)\n\n...\n\nΨa(4)(k) =\n\n+\n\nFIG. 1: Diagrammatic representation of the series expansion\nof Ψa (k) up to fourth order in the initial conditions φ. Time\nincreases along each segment according to the arrow and each\nsegment bears a factor gcd (sf − si ) if si is the initial time\nand sf is the final time. At each initial point and each vertex\npoint there is a sum over the component indices; a sum over\nthe incoming wave modes is also implicit and, finally, the time\ncoordinate of the vertex points is integrated from s = 0 to the\nfinal time s according to the time ordering of each diagram.\nFor instance, at fourth order there are two different possible\ntopologies.\n\nwhere F (n) are fully symmetric functions of the wavevectors that can be obtained recursively in terms of gab\nand γabc [1]. Note that these functions have a non-trivial\ntime dependence because they also include sub-leading\nterms in es . Their fastest growing contribution is of\ncourse given by the well known {Fn , Gn } kernels in PT\n(assuming growing mode initial conditions),\nFa(n) = exp(ns) {Fn (k1 , .., kn ), Gn (k1 , .., kn )}\n\n(11)\n\nfor a = 1, 2 (density or velocity divergence fields respectively).\nThe relation in Eq. (6) can be used to construct a diagrammatic representation of the fields Ψ(n) . As an illustration, we show in Fig. 1 diagrams corresponding to the\nlocal field expansion up to fourth order.\nA detailed description of the procedure to draw the\ndiagrams and compute their values can be found in [5],\nwe can briefly summarize these rules here as follows. In\nFig. 1 the open circles represent the initial conditions\nφb (k), where b = 1 (b = 2) corresponds to the density\n(velocity divergence) field, and the line emerging from it\ncarries a wavenumber k. Lines are time-oriented (with\ntime direction represented by an arrow) and have different indices at both ends, say a and b. Each line represents\nlinear evolution described by the propagator gab (sf − si )\nfrom time si to time sf . Each nonlinear interaction between modes is represented by a vertex, which due to\n\nquadratic nonlinearities in the equations of motion is the\nconvergence point of necessarily two incoming lines, with\nwavenumber say q1 and q2 , and one outgoing line with\nwavenumber q = q1 + q2 . Each vertex in a diagram\nthen represents the matrix γabc (q, q1 , q2 ). It is further\nunderstood in Fig. 1 that internal indices are summed\nover and interaction times are integrated out in the full\ninterval [0, s].\nNote that at the level of the field Ψ, all diagrams are\ntree diagrams with no loops. This is unlike in standard\nfield theories, and is due to the lack of \"antiparticles\"\n(both in the strict sense of the word, like in quantum field\ntheory, and at the quasiparticle level, as e.g. holes in condensed matter systems). However, loop diagrams appear\nonce we calculate statistical averages such as correlators\nbetween fields. Other unusual properties compared to\nstandard field theories are the non-trivial k-dependence\nof vertices (see also [18]) and last, but not least, a strong\nbreaking of time-translation invariance. In fact, the theory is unstable with perturbations growing as a function\nof time from their initial conditions (represented by density and velocity fields after decoupling).\nHaving written the final conditions of interest Ψ in\nterms of initial conditions φ, to build diagrammatic representations for statistical quantities such as the nonlinear propagator or the power spectrum, one needs to\nspecify the statistical properties of the initial conditions.\nHere we will assume Gaussian initial conditions, in which\ncase the statistical properties are encoded in the initial\nspectrum of fluctuations,\nφa (q)φb (q′ ) = δD (q + q′ )Pab (q).\n\n(12)\n\nwith Pab = ua ub P0 for growing-mode initial conditions,\ni.e. if Eq. (8) is satisfied. Ensemble averages are therefore obtained by gluing together the open circles in the\ndiagrams by pairs (according to the calculation rules for\nGaussian fields) to form a symbol ⊗, which will appear in\nall diagrams in the figures below. This symbol represents\nthe initial power spectrum Pab (q), when the outgoing\nlines away from the initial conditions have respectively\nindices a and b and carry wavenumbers q and q′ . Finally,\nin all diagrams it is understood that internal wavenumbers (corresponding to loops) when such symbols appear\nare integrated over.\n\nIII.\n\nMULTI-POINT PROPAGATORS\nA.\n\nThe Two-Point Propagator\n\nThe idea at the heart of RPT is to realize that the diagrammatic series described above for correlation functions can be partially resummed. This amounts to generalizing the operator gab , encoding the linear evolution,\nto a fully nonlinear one, denoted by Gab , that effectively\ndescribes time evolution when coupling between modes is\npresent. This generalized operator, called the nonlinear\n\n\f4\npropagator, is formally defined as,\nδΨa (k, s)\n= δD (k − k′ ) Gab (k, s).\nδφb (k′ )\n\n(13)\n\nThis quantity basically measures how linear is the transition from initial to final fields. Note that, although\ncertainly Ψa (k) depends on φb (k′ ) for k′ 6= k, translation invariance demands that the expectation value of the\nderivative in Eq. (13) is only non-zero if k = k′ [27].\nDue to nonlinear evolution, one expects Gab to decay\nto zero at small scales where non-linear effects become\nimportant and make Ψ(k) very different from a linear\ntransformation of φb (k). In fact, for Gaussian initial conditions it is possible to give an alternative expression for\nGab , as a cross-correlation between final Ψa and initial\nφb fields [4],\nΨa (k, s) φb (k′ ) = Gac (k, s) φc (k) φb (k′ ) .\n\n(14)\n\nThis equivalence gives rise to the alternative name of\ntwo-point propagator and reinforces the idea that decorrelation of fields Ψa with respect to φb mandates that Gab\nmust vanish at small scales. Indeed, it was shown in [4]\nthat Gab can be computed in the large-k limit and it follows a Gaussian decay with k. This was also checked in\nnumerical simulations (see Fig. 4 and discussion in sec. IV\nbelow). At low-k, on the other hand, linear theory is recovered and Gab (k → 0) = gab , as expected.\nIntroducing the concept of a two-point propagator\nhelps to understand nonlinear corrections to the power\nspectrum. The power spectrum can be written as [5]\nP (k, τ ) = G2 (k, τ ) P0 (k) + PMC (k, τ ),\n\n(15)\n\nwhere we have explicitly included the time dependence,\nP0 is the initial density power spectrum, and PMC is\nthe mode-coupling power spectrum. Note that what\nwe call G in this equation is the density propagator\nG ≡ G11 + G12 = G1b ub , since we assume growing-mode\ninitial conditions; a completely equivalent equation holds\nfor velocities. The first term describes all the contributions to P (k) that are proportional to the initial power\nspectrum at the same scale k, while the second, denotes\nthe contribution to P (k) from modes other than k in\nthe initial spectrum (hence called \"mode-coupling\"), i.e.\nPMC (k) is nonzero even if P0 vanishes at wavenumber k\n(as long as P0 is not zero everywhere).\nThe first term in Eq. (15) has the most direct information of the initial power spectrum, since it is proportional\nto P0 at the same scale, thus varying k one can probe\nP0 (k) as long as the first term is dominant, i.e. at large\nscales where G has not yet decayed significantly. The\ntwo-point propagator G can be given an alternative interpretation by noting that Eq. (14) says that (G/D+ )2 ,\nwhere D+ is the linear growth factor, is the fraction of\nthe power that grows by linear theory at a given k. As G\ndecays, a given mode looses memory about its primordial\n\n(linear) value, and an important fraction of the power is\ncontributed by nonlinear effects alone, i.e. PMC . However, that does not mean that information on the initial\npower spectrum is completely lost at such scales. In fact,\nRPT gives a precise expression for PMC in terms of convolutions over the initial spectrum (see Fig. 5 in [6] for how\nwell this works when compared to simulations). However the information on P0 contained in PMC is rather\ncrude, since PMC (k) depends on nonlinear combinations\nof P0 (q)'s from a wide range of scales q weighted by complicated convolution kernels.\nAs we will show in the rest of the paper, these kernels\nare the (square of) multi-point propagators and, in fact,\nthey also determine the tree-level higher-order spectra\n(bispectrum, trispectrum, etc). Therefore, multi-point\npropagators will lead us to a different way of writing the\nmode-coupling contributions to P (k) (and higher-order\nspectra), and a direct physical connection between nonlinear corrections to the power spectrum at small scales\nand higher-order correlations at large scales.\nB.\n\nDefinition of Multi-Point Propagators\n\nHaving discussed the importance of the two-point\npropagator let us introduce the concept of multi-point\npropagators, denoted Γ(p) , as a natural extension of the\ndefinition in Eq. (13),\n1\nδ 2 Ψa (k, s)\n(2)\n= δD (k − k12 ) Γabc (k1 , k2 , s) (16)\n2 δφb (k1 )δφc (k2 )\nfor the three-point case and,\nδ p Ψa (k, s)\n1\np! δφb1 (k1 ) . . . δφbp (kp )\n\n=\n(p)\n\nδD (k − k1...p ) Γab1 ...bp (k1 , . . . , kp , s) ,(17)\nwhere k1...p = k1 + . . . + kp , for an arbitrary number of\npoints. Note that Γ(p) denotes the (p + 1)-point propagator, by translation invariance it depends only on p\nwavenumbers in Fourier space.\nThe question we want to address in this section is the\ncalculation of Γ(p) . We will shortly show that exact results can indeed be obtained for Γ(p) in the large k limit.\nThis is a nontrivial generalization of the two-point case\nand constitutes a core result in this paper. In addition, as\nanticipated above, we will show in section VII that correlation functions can be reconstructed solely in terms of Γ\nfunctions and initial power spectra P0 , e.g. for the power\nspectrum we will show that,\nP (k) =\n\nX\nr≥1\n\nr!\n\nZ\n\nh\ni2\nδD (k − q1...r ) Γ(r) (q1 , . . . , qr )\n\n× P0 (q1 ) . . . P0 (qr ) d3 q1 . . . d3 qr ,\n\n(18)\n\nwhere Γ(1) is the two-point propagator G used in Eq. (15)\nand the mode-coupling spectrum PMC is described here\n\n\f5\nby the terms with r ≥ 2. Equation (18) is something\nalready found in [5] within the Zel'dovich approximation,\nbut extended here to the exact dynamics.\nFormally, the Γ functions can be computed order by order in a field expansion and thus they can be represented\ndiagrammatically. Examples of such diagrams are shown\nin Fig. 2. To lowest order it can be easily shown from\nEqs. (9,10,17) that Γ(p) coincides with the F (p) kernels in\nEq. (10). Diagramatically this lowest order corresponds\nto a tree level diagram. Let us explicitly compute Γ(2)\nstarting from the second diagram in Fig. 1 and the rules\ndescribed in Sec. II to get an expression for Ψ(2) , that\nafter the functional derivatives in Eq. (17) gives,\nZ s\n(2)\nΓabc,tree (k1 , k2 , s) =\nds′ gad (s − s′ )γdef (k1 , k2 , k)\n\nΓ\n\n(n)\n\n(k,p1,...,pn)=\np1\n\nk\n\np1\nk\n\n=\npn\n\np1\n+\n\nk\n\n+...\n\npn\n\npn\n×\n\nFIG. 2: Representation of the first two terms of the multipoint propagator Γ(n) in a perturbative expansion. Γ(n) represents the average value of the emerging nonlinear mode k\ngiven n initial modes in the linear regime. Here we show the\nfirst two contributions: tree-level and one-loop. Note that\neach object represents a collection of (topologically) different\ndiagrams.\n\n0\n\n×geb (s′ ) gf c (s′ ).\n\n(19)\n\nFor the density field (a = 1) and growing mode initial\nconditions this leads to,\n\u0012\n\u0013\n5 k1 x k2 x 2x2\n(2)\n2s\nΓ1bc,tree (k1 , k2 , s)ub uc = e\n+\n+\n+\n7 2k2\n2k1\n7\n\u0012\n\u0013\n3 k1 x k2 x 2x2\ns\n+ e − −\n−\n−\n5 2k2\n2k1\n5\n\u0013\n\u0012\n2\n4x\n4\n,\n(20)\n+ e−3s/2 − +\n35\n35\nwith x = k1 * k2 /k1 k2 . The fastest growing term in\nEq. (20) is precisely the F2 kernel in standard PT.\nWe now show that the equivalence in Eq. (14) between\ntwo-point propagators and cross-correlations for Gaussian initial conditions, can be extended to multi-point\npropagators. Let us start with the three-point propagator Γ(2) .\n(2)\nOn the one hand, an expression for Γabc (k1 , k2 ) can\nbe formally written in terms of the functions F (n) using\nEqs. (10,16). It reads,\n\u0013\nZ\n∞ \u0012\nX\n2p + 2\n(2)\n(2p − 1)!! d3 q1 . . . d3 qp\nΓabc (k1 , k2 ) =\n2p\np=0\n(2p+2)\n\n× F̄abc\n\n(k1 , k2 , q1 , −q1 , . . . , −qp ; s) P0 (q1 ) . . . P0 (qp )\n(21)\n\n(2p+2)\n\nGab(1-loop)(k, s2, s1) =\n\nΨa (k)φb (−k1 )φc (−k2 )\n(2)\n\n= 2 δD (k − k1 − k2 )\n\n× Γade Pdb (k1 )Pec (k2 )\n\n(22)\n\ns1\n\nFIG. 3: The one-loop contribution to Gab (k, s2 , s1 ). The ⊗\nrepresents a primordial power spectrum P0 (q) with the corresponding\n\"loop\" momentum q integrated over with weight\nR\n(2π)−3 d3 q . See [4] for an explicit calculation of this diagram.\n\nwith Pab (k) defined in Eq. (12). This relation is very useful since it provides a simple way to compute the threepoint propagator in numerical simulations out of crosscorrelations between final and initial conditions (see Section VI).\nAs expected, the relations in Eqs. (21-22) can be\nstraightforwardly extended to any order. We thus have\nfor the generic case,\nΨa (k)φc1 (−k1 ) . . . φcp (−kp )\n×\n\n(p)\nΓab1 ...bp\n\nc\n\n= p! δD (k − k1...p )\n\nPb1 c1 (k1 ) . . . Pbp cp (kp ) (23)\n\nwhere . . . c stands for the connected part of the ensemble average.\n\n(2p+2)\n\nwhere F̄abc\n≡ Fabcd1 ...dp ud1 . . . udp , and we assumed\nGaussian initial\u0001 conditions together with Eqs. (8,12).\nThe factor 2p+2\nis the number of possibilities for choos2p\ning 2p points out of 2p + 2 and (2p − 1)!! is the number\nof ways 2p points can be connected together by pairs.\nOn the other hand, with the relation (10) one can\nalso get a formal expression for the cross-correlation\nΨa (k)φb (−k1 )φc (−k2 ) . Given the fact that Ψ(n) ≡\n0, such an expression involves the same type of contractions of the φai (ki ) factors leading to,\n\ns2\n\nIV. THE LARGE-k BEHAVIOR OF\nMULTI-POINT PROPAGATORS\nA.\n\nThe Large-k Limit of the Two-Point Propagator\n\nAs discussed in the previous section, the two-point\npropagator Gab generalizes gab beyond linear theory and\nthus reflects a key property of the evolved fields. The\ngeneral properties of Gab have been explored in detail\nin [4], but we briefly recall them here to motivate their\ngeneralization to multi-point propagators.\nFollowing Eqs. (9,10), and the definition in Eq. (13),\none can expand the function Gab with respect to the am-\n\n\f6\n\nGab(k) =\n\nk\n\nk\n\nk1\n\nΓ(3)abcd(k1, k2, k3) =\n\nk\n\nk2\n\nk3\n\nFIG. 4: The large-k limit of the two-point density propagator\nΓ(1) . Symbols correspond to measurements in numerical simulations at redshifts z = 1, 0.5 and z = 0 (top to bottom), see\ntext for details. The solid lines correspond to the large-k limit\nexpression given in Eq. (25). The linear relation obtained by\nplotting log G vs. k2 makes evident that the suppression of G\nis indeed Gaussian in the high-k limit. Moreover, the slope is\nvery well predicted by Eqs. (25,26).\n\nplitude of initial fluctuations,\nGab (k, sf , si ) = gab (sf − si ) + G1loop\n(k, sf , si ) + . . . (24)\nab\nwhere G1loop\n(k, sf , si ) is the first nonlinear correction\nab\nterm, describing the transition into the nonlinear regime.\nGraphically, this term corresponds to a \"one-loop\" diagram (i.e. an integral over P0 ), which is shown in Fig. 3.\nAs nonlinear effects become important Gab is expected\nto decay to zero since they erase the one-to-one correspondence of modes valid in the linear regime. This introduces a characteristic scale that describes the decay\nlength of the two-point propagator. It was shown in [4]\nthat this decay can be computed exactly in the high-k\nlimit, where a subset of diagrams is expected to provide\nthe dominant contribution. Following a line of calculation that we will use again shortly, it was shown that in\nthe large-k limit,\n\u0012 2\n\u0013\nk\nGab (k, sf , si ) = exp − σv2 (esf − esi )2 gab (sf − si ),\n2\n(25)\nwhere the characteristic decay length is determined by\nthe rms velocity fluctuations\nσv2\n\n1\n=\n3\n\nZ\n\n0\n\n∞\n\nd3 k\nP0 (k).\nk2\n\n(26)\n\nFIG. 5: Example of diagrams contributing to Gab (k) (top)\n(3)\nand Γabcd (k, k1 , k2 , k3 ) (bottom). The dominant contribution after resumming all possible configurations is expected\nto come from those diagrams where all loops are directly connected to the principal line (top) or principal tree (bottom).\nThe principal line and tree are drawn with a thick solid line.\nThe dominant loops are those drawn by dashed lines, while\nthe sub-dominant loops are those in dotted lines.\n\nIn [4], it is shown how to match this result valid for\nkσv ≫ 1 to the low-k behavior described by Eq. (24), to\nobtain a prescription for its full time and k dependence.\nThis prescription was found to be in good agreement with\nnumerical simulations at all scales and different redshifts\nfor density and velocity divergence propagators.\nHere, we concentrate on the large-k behavior of the\ndensity propagator from growing-mode initial conditions,\n(1)\nΓ(1) ≡ Γ1b ub = G11 + G12 (we will henceforth use both\n(1)\nG and Γ to refer to the two-point propagator). We use\nthe algorithm presented in [4] to measure Γ(1) based on\nthe cross-correlation property in Eq. (14). We defer a description of the simulations used here until section VI below. Figure 4 shows Γ(1) normalized by the linear growth\n(1)\nfactor Γtree = g11 + g12 , with gab the linear propagator\ndefined in Eq. (7); the unusual notation for the growth\nfactor is used here to emphasize that it is given by the\ntree-contributions to the two-point propagator, this will\nhave a natural generalization for multi-point propagators. The figure shows log Γ(1) vs. log k 2 to emphasize\nthe Gaussian decay very well predicted by Eq. (25) at all\nredshifts with characteristic scale given by Eq. (26).\nIn the following sections we investigate similar properties, regimes and measurements to those carried out with\nGab , to the case of the three-point propagator Γ(2) and,\nwhen possible, extend this to Γ(n) .\n\nB.\n\nDominant diagrams and principal trees\n\nTo study the high-k regime of the propagators, the first\nstep is to identify the set of diagrams that is expected\nto dominate the large-k behavior. This identification is\nclosely linked to the concept of principal line and its gen-\n\n\f7\n\nk1\n(1)\n(3)\nk3\n(2)\nk2\n\nFIG. 6: Dominant loop contributions for the three-point prop(2)\nagator Γabc (k1 , k2 , k3 ). The final expression is obtained by\nthe sum of an infinite number of such loops and over all possible interaction times. In the large-k limit these terms can\nbe computed exactly.\n\neralization, the principal tree, that all the diagrams for\npropagators contain. These concepts are illustrated in\nthe diagrams appearing in Fig. 5. For instance, in the\ntop diagram there is a unique way to go from initial time\n(symbolized by the vertical dotted line) to the final time\nwithout crossing a ⊗, thus moving always in the direction\nof increasing time. It's easy to check that this is true for\nany diagram contributing to Gab . This is what we call\nits principal line.\nSimilarly there exists a unique tree, the principal tree,\nthat joins the initial time to the final time in the bottom\ndiagram of Fig. 5. The number of branches of this tree\nis equal to the number of points minus one for the propagator under consideration (i.e. the number of function\nderivatives in the definition in Eq. (17)). Again, it's easy\nto check that the existence of a principal tree is general\nand does not depend on the number of loops that are attached to it, although at a given order different diagrams\nmay have different principal trees (see bottom diagrams\nof Fig. 1). Principal trees appear then as simple generalization of the concept of principal line initially introduced\nin [4].\nWe now note that in the expansion series, all diagrams\ncan be seen as a principal tree with loops attached to its\nbranches. Following arguments developed in [4], we claim\nthat the general behavior of the multi-point propagators\nare dominated in the large-k limit by those diagrams in\nwhich every loop is directly connected to the principal\ntree.\nThis idea follows from the fact that multi-point propagators are a measure of the correlation between final\nand initial configurations, see Eqs. (14,22,23). And diagrams that contain only such loops are more effective in\nthe process of correlating the final field with the initial\nconditions (that is, the modes running along the principal\ntree always interact with growing modes coming from the\ninitial conditions). In particular, this argument remains\nvalid at large-k where these diagrams can be computed\nexactly, as we will show in subsequent sections.\nAs explicit examples, we show in the bottom diagram\nof Fig. 5 in dashed lines the kind of loops that con-\n\ntribute dominantly to the large-k limit of Γ(3) (while the\nprincipal tree is represented by solid lines and the subdominant loops in dotted lines) . In Fig. 6 we show some\nof the dominant loop contributions to Γ(2) , as they are\nthe subject of next section.\nThese examples can be used to build a simple picture\nof the different loop contributions. Let us take the case\nof the two-point propagator. Its one-loop contribution\nis shown in Fig. 3. As shown in [4], this contribution is\ndominated by loop momenta of order q ≃ σv−1 , thus is\nin the high-k limit (kσv ≫ 1), most of the momentum\nis flowing along the principal line of the diagram. Now\nconsider the two and higher loop contributions: the dominant loops, when resummed, give Eq. (25), again saying\nthat all dominant loops have momenta of order q ≃ σv−1\nflowing in them; this is a consequence of the form of the\nvertices and the shape of the CDM spectrum.\nAs far as the subdominant loops are concerned, there\nare two cases at the two-loop level: with one leg in the\nprincipal line (e.g. as the dotted loop in the top half\nof the Gab diagram in Fig. 5), and with no legs in the\nprincipal line (e.g. as the dotted loop in the bottom\nhalf of the Gab diagram in Fig. 5). In fact, there are\ntwo types of diagrams of the latter type, depending on\nwhether the two legs of the loop land are on the same side\nof ⊗ (as in Fig. 5), or not. The first case corresponds to\nrenormalizing the internal propagator, the second to a\nrenormalization of the initial power spectrum. However,\nsince both renormalizations must be evaluated at large−1\nscales, i.e. q <\n∼ σv , their effect on the final result must be\nsubdominant. The subdominant loops with one leg in the\nprincipal line corresponds to renormalizing the vertex,\nand the level of agreement seen in Fig. 4 suggests that\nsuch vertex renormalizations are small. This corresponds\nto studying the three-point propagator in the limit where\n−1\none incoming momentum is \"soft\" (of order q <\n∼ σv )\nwhile the other is large. While we are not able to resum\nthis case, we shall see that when the whole principal tree\nis in the high-k limit, the behavior of the three-point\npropagator can be established.\n\nC.\n\nThe Large-k Limit of the Three-Point\nPropagator\n\nThe aim of this section is to obtain the large-k limit of\nthe three-point propagator Γ(2) defined in Eq. (16). To\nthis end we need to sum over the whole set of dominant\nloop diagrams,\n(2)\n\nΓabc =\n\nX\n\n(2)\n\nΓabc,\n\nn−loops ,\n\n(27)\n\nn≥0\n\nthat is, only consider those diagrams with loops directly\nattached to the principal tree, see Fig. 6. Note that to do\nthe summation in Eq. (27) one needs to take into account\nthe symmetry factors of each contribution [28]. Let us\nstart by considering the one-loop case in detail first, since\n\n\f8\nFig. 6 - each carrying respectively the wave vectors k1 ,\nk2 and k3 . In the calculation of those diagrams one has\nto sum over all indices, describing density and velocity\ndivergence perturbations (we implicitly assume that such\nindices when repeated are summed over). As an example,\nwe write down the corresponding integral when the loop\nis connected to branches 3 and 1,\n\nit will allow an easy extrapolation when accounting for\narbitrary number of loops in the large-k limit.\nDiagrams are computed according to the rules given in\nsection II, but let us be a bit more precise in the notation.\nIn Fig. 6, each of the contributing loops carries a wave\nvector q such that q ≃ σv−1 ≪ k1 and similarly q ≪ k2 .\nIt is connected to two segments (not necessarily distinct)\ntaken in the set of three - denoted (1), (2) and (3) in\n\n(2)\nΓabc,{13} (k3 , k1 , k2 ; s)\n\n=\n\nZ\n\n3\n\nP0 (q) d q\n\nZ\n\ns\n\nds1\n\ns′\n\nZ\n\n0\n\ns\n\nds\n\n′\n\nZ\n\ns′\n\n0\n\nds2 gad (s − s1 ) γdef (k3 , q, k3 − q) es1 ue gf h (s1 − s′ )\n\n×γhij (k3 − q, k1 − q, k2 ) gik (s′ − s2 ) γklm (k1 − q, −q, k1 ) es2 ul gmb (s2 ) gjc (s′ )\n\nwhere s1 , s2 are the interaction times where the loop legs\nattach to the principal tree, and s′ is the interaction time\nbelonging to the principal tree. Furthermore, we assumed\ngrowing mode initial conditions, so the initial spectrum\nPab reduces to ua ub P0 , see Eq. (12), and gab (s)ub = es ua .\nIt is crucial to note that, as for the calculation of Gab ,\nin the high-k limit the vertex matrix takes the form [4],\n\nγabc (ki , q, ki − q)ub ≈\n\nki .q\nδac ,\n2 q2\n\n(29)\n\nwhen contracted with an incident growing mode (such\nas those coming from the initial conditions). The interaction then leaves the modes along the principal tree\nlines unchanged and carrying the wave vector ki (since\n\n(28)\n\nki + q ≈ ki ) all along. As we now show, applying this\nlarge-k limit to Eq. (28) simplifies calculations greatly.\nLet us be general now and consider a loop that joins\nthe segment (i) and (j). Again, we denote the interaction times for such a loop as s1 and s2 . The loop\ncontribution will eventually be given by the integration\nof these times over the time range of the corresponding\nsegments. The integral over the segment (i) can be defined through the respective characteristic functions Ii ,\nwith I1 (t) = I2 (t) = Θ(t)Θ(s′ − t) for interactions after\nthe initial conditions but before the vertex of the principal tree (at time s′ ) and I3 (t) = Θ(t − s′ )Θ(s − t)\nfor interactions after s′ and before the time of interest s\n(s ≥ s′ ≥ 0).\n\nThe one-loop contribution is then given by\nZ s\nZ\nZ\n(2)\nΓabc,{ij} = −sij\nds′ gad (s − s′ )γdef (k1 , k2 , k3 )geb (s′ )gf c (s′ ) ds1 Ii (s1 ) ds2 Ij (s2 )\nZ 0\nki .q kj .q s1 +s2\n,\ne\n× d2 Ωq q 2 dq P0 (q)\n2 q2 2 q2\n\n(30)\n\nwhere sij is the symmetry factor associated to this contribution. It is 4 if i 6= j (e.g. 2 for each incoming line), and\nit is only 2 for i = j because the time ordering of s1 and s2 is ignored in Eq. (30) [29]. The integral over the angles\nΩq is straightforward and leads to,\n(2)\nΓabc,{ij}\n\nsij\n= −\n4\n\nZ\n\n0\n\ns\n′\n\n′\n\n′\n\n′\n\nds gad (s − s )γdef (k1 , k2 , k3 )geb (s )gf c (s )\n\nZ\n\nds1 Ii (s1 )\n\nZ\n\nds2 Ij (s2 ) ki .kj σv2 es1 +s2 , (31)\n\nwhere σv2 is defined in Eq. (26). Note that, if we could ignore the last two time integrals, the answer would be\nproportional to the tree-level amplitude (given by the first integral). The time integration over s1 and s2 can be\ndone easily for each loop diagram characterized by {ij} = {11}, {22}, {33}, {12}, {13}, {23}. When we collect all the\n\n\f9\none-loop contributions we get,\n(2)\n\nΓabc,\n\n1loop\n\n=\n\nX\n\n(2)\n\nΓabc,{ij}\n\nij\n\nZ\n1 s ′\nds gad (s − s′ )γdef (k1 , k2 , k3 )geb (s′ )gf c (s′ ) σv2\n2 0\n\u0015\n\u0014\u0010\n\u0011\n\u0011\u0010 ′\n\u0011\n\u0010\n\u0010\n\u00112\n\u0001\n′ 2\n′\n′\nk32 , (32)\nes − 1 (k1 .k3 + k2 .k3 ) + es − es\n× es − 1\nk12 + 2k1 .k2 + k22 + 2 es − es\n\n= −\n\nwhich when using that k3 = k1 + k2 makes the square\nbracket independent of s′ and leads to the remarkable\nresult:\n(2)\n\nΓabc,\n\n1loop\n\n=−\n\nk32 σv2 (2)\nΓabc,\n2\n\n2\n\ntree\n\n(es − 1) .\n\n(33)\n\nWe are now ready to consider diagrams with an arbitrary\nnumber of loops. As we shall see it amounts to exponentiate the one-loop result above. There are at least two ways\nto obtain such a result. The most direct method, which\nwe follow here, consists in computing simultaneously an\narbitrary number of loops. The cumbersome part in this\ncase is to find out the combinatorial weights for each diagram. Here we follow the one-loop strategy discussed\nabove and ignore time ordering at first and correct for\nthe overcounting afterwards. In Appendix A we provide\nan alternative derivation of this method that takes into\naccount time ordering explicitly. A second method based\non a different resummation scheme is presented in Appendix B.\n\n(2)\nΓabc,{pij }\n\nThe lesson we must recall from the one-loop calculation\nis the following. Every loop must be directly connected to\ntwo \"principal\" segments (i) and (j) of the principal tree\n(i and j go from 1 to 3, see Fig. 6). Time integration\n′\n′\nthen leads to (es − 1) if i = 1 or 2, and (es − es ) if\ni = 3, and similarly for j. Momentum integration leads to\n−σv2 ki *kj /4, and in addition there is an overall symmetry\nfactor sij (with sij = 4 if j 6= i and 2 otherwise).\nThe loop resummation in Eq. (27) relies on a proper\ncounting of each of the diagrams that contribute in the\nlarge-k limit. In turn, each of these diagrams can be\ndefined by a set of parameters, pij , where each counts\nthe number of lines connecting the segments (i) and (j)\n(i ≤ j). For instance, the diagram in Fig. 6 corresponds\nto p11 = 1, p22 = 0, p12 = 1, p13 = 1, p23 = 0 and\np33 = 1. Each loop line connects to the principal tree\nat time si . Dropping the time ordering in si (within\neach of the principal lines), the contribution from such\nan ensemble of loops is given by,\n\n\u0012\n\u0013Pi≤j pij Y\nZ s\nY\ns{pij }\nσv2\npij\n2pii\n(ki .kj )\nds′ gad (s − s′ )γdef (k1 , k2 , k3 )geb (s′ )gf c (s′ )\nki\n−\n=\nM{pij }\n4\n0\ni<j\ni\n\u0011\n\u0010 ′\n\u00112p11 +2p22 +2p12 +p13 +p23 \u0010\n′ 2p33 +p13 +p23\n.\n(34)\nes − es\n× es − 1\n\nIn this expression the coefficient s{pij } is the symmetry\nfactor associated with each set of pij . For a given ordered\ntopology, each loop introduces a factor 4, so that\ns{pij } = 22\n\nP\n\ni≤j\n\npij\n\n.\n\n(35)\n\nThe coefficient M{pij } on the other hand represents the\nnumber of times each given diagram has been computed\nbecause the time ordering has been dropped. Changing\nthe time order (within each principal line) allows to automatically scan the different topologies (diagrams sharing\nthe same set of pij ) but computing them several times.\nThe symmetry factor pij in M{pij } is precisely here to\n\ncorrect for this multiplicity factor. It is relatively easy to\nsee that its dependence on each pij factorizes, so that\nM{pij } =\n\nY\ni≤j\n\nM(pij )\n\n(36)\n\nwhere M(pii ) = 2pii pii !, and M(pij ) = pij ! if i 6= j (there\nis an extra factor of 2 when i = j to compensate for the\nabsence of time ordering. See Fig. 7 for illustration of\nthese symmetry factor countings). The summation over\npij is then straightforward and leads to exponentiations,\n\n\f(2)\n\n)\n(1\n\n(1\n\np12= 3\n\n)\n\n10\n\n(2)\n\np11= 3\n\n(1)\n\n(1)\n\nFIG. 7: This figure illustrates the effect of the time ordering exchanges (thick double arrow lines).\nThrough such exchanges, the complete set of diagrams that correspond to a given {pij } can be explored. Successive time\nexchanges can however lead to identical diagrams (e.g. left and right diagrams in each panel). The unordered time integration\nthen leads to a multiplicity factor for each diagram. For the top panel (corresponding to p12 = 3), the same diagram is obtained\neach time two loop lines are exchanged. There are p12 ! of such possible exchanges. For the bottom panel (corresponding to\np11 = 3), the same diagram can be obtained either by the exchange of loop lines, or by the exchange of the end and final time\nof each loop of them (double arrow dashed line). There are thus p11 ! 2p11 of such possible exchanges.\n\n(2)\nΓabc\n\n=\n\nX\n\n{pij }\n\n(2)\nΓabc,{pij }\n\n=\n\nZ\n\n0\n\ns\n\nds′ gad (s − s′ )γdbc (k1 , k2 , k3 )gdb (s′ )gdc (s′ )\n\n\u001a\n\u0015\u001b\n\u0014\n\u0011\n\u0011\u0010 ′\n\u0011\n\u0010\n\u0010\n\u00112\n\u0001\n′ 2\n′\nσ 2 \u0010 s′\n× exp − v\nk32\nes − 1 (k1 .k3 + k2 .k3 ) + es − es\ne −1\nk12 + 2k1 .k2 + k22 + 2 es − ss\n2\n\u0013\n\u0012\nσ2 k2\n(2)\n2\nΓabc,tree ,\n(37)\n= exp − v 3 (es − 1)\n2\n\n(2)\n\nwith Γabc,tree defined in Eq. (19). This is a truly remarkable result. It shows that the whole effect of loop\nsummation is encoded in the value of k3 in exactly the\nsame way as for the two-point propagator Gab .\nWe now compare this result to measurements in numerical simulations, which will be described in detail\nin section VI. As done for the two-point propagator\n(see Fig. 4), we test for the Gaussian decay in the\nhigh-k limit by plotting in Fig. 8 equilateral configura(2)\ntions log Γ1 (k, k, k) vs k 2 , for which Eq. (37) predicts a\nstraight line with known slope. We do so for three different redshifts z = 0, 0.5, 1, finding very good agreement in\nall cases with the predictions of Eq. (37), shown in solid\nlines. This validates our resummation scheme.\nEquation (37) and its generalization to other multipoint propagators have important implications for the\npower spectrum and higher-order statistics, that we discuss in section VII. We note also that a second, faster,\nmethod to perform the loop resummation is discussed\nin appendix B. We now consider the extension of these\nresults to arbitrary multi-point propagators.\n\nD.\n\nThe Large-k Limit for Higher-Order\nMulti-Point Propagators\n\nThe structure we found for the three-point propagator\nΓ(2) is appealing enough to consider its full generalization\nto propagators of arbitrary number of points. The crucial\nproperty is the extension of the one-loop relation given\nin Eq. (33). For higher than three-point propagators, the\ntree-order is given by the sum of several diagrams. When\nloop corrections are taken into account, the principal tree\nof each of these diagrams is naturally the corresponding\ntree-order diagram. For instance, there are two of such\ndiagrams for Γ(4) shown in Fig. 1.\n(p)\n\nLet us define Γ(q),tree , the tree-order contribution to\nΓ(p) from diagram of type (q). The value of such a diagram is obtained after the integration over the s1 . . . sp−1\ntime variables corresponding to the interaction points is\ndone. Generically it can be written as,\n(p)\nΓ(q),tree\n\n=\n\nZ\n\n0\n\ns\n\nds1 . . .\n\nZ\n\n0\n\ns\n\ndsp−1 T (q) (k1 , . . . , kp−1 ,\n, s1 , . . . , sp−1 ) (38)\n\n\f11\nwhere T (q) (k1 , . . . , kp−1 , s1 , . . . , sp−1 ) denotes the value\nof the diagram (q) before the time integrations are performed. T depends on the vertices and the linear propagators, the arguments of which impose time-ordering\nthrough gab (η) = 0 for η < 0.\n\nFIG. 8: The large-k limit of the three-point density propa(2)\n(2)\ngator Γ1 ≡ Γ1bc ub uc , the only density contraction that can\nbe measured for growing mode initial conditions, ub = (1, 1).\nThe symbols in the figure correspond to equilateral configurations at redshifts z = 1, 0.5, 0 (from top to bottom). We\n(2)\nhave normalized these measurements to its low-k limit Γ1,tree\ngiven by Eq. (20). The figure clearly shows that the measured\npropagator closely follows the large-k limit given by Eq. (37)\n(2)\nrepresented by solid lines, once Γ1 decays by ≈ e−1 from its\ntree-level value.\n\n(p)\n\nThe one-loop diagrams built out of the\n(q)−tree diagram involve the same core function\nT (q) (k1 , . . . , kp−1 , s1 , . . . , sp−1 ). A one-loop diagram\njoining the segments (i) and (j) is then given by\n\nZ s\nZ\n−σv2 s\ndsp−1 T (q) (k1 , . . . , kp−1 , s1 , . . . , sp−1 ) C{ij} (k1 , . . . , kp−1 , s1 , . . . , sp−1 )\nds1 . . .\n2\n0\n0\nsij\n≡\n(ki * kj ) (esi,2 − esi,1 ) (esj,2 − esj,1 )\n2\n\nΓ(q),{ij} =\n\n(39)\n\nC{ij}\n\n(40)\n\nwhere si,1 and si,2 are respectively the starting and ending time of segment (i) of the principal tree which carries\nmomentum ki . Thus the times sk,l belong to the set\n{s1 , . . . , sp−1 }. This is already the result of integrating\nover the additional two time variables that correspond to\nthe two extra interactions due to the loop (see the step\nin going from Eq. (31) to Eq. (32), for example).\nFrom these results it can then be shown that the sum\nover (i, j) of C{ij} is |k1 + * * * + kp−1 |2 (es − 1)2 . The\nproof can be obtained recursively as a simple successive\napplication of the result found for Γ(2) . This mechanism\nis illustrated in Fig. 9. It leads to (kp = k1 + * * * + kp−1 ),\nkp2 σv2 s\n(p)\n(41)\n(e − 1)2 Γ(q),tree .\n2\nAs shown in appendix B, the scheme for resummation\n(p)\n\nΓ(q),1loop = −\n\nover all loop terms can be applied once again, leading to\nthe generalization of Eq. (37),\n!\nkp2 σv2 s\n(p)\n(p)\n2\nΓtree .\n(42)\nΓ = exp −\n(e − 1)\n2\nV.\n\nONE-LOOP RESULTS FOR THE\nTHREE-POINT PROPAGATOR\n\nHaving derived expressions for large scales, the treelevel expression in Eq. (19), and small scales (high-k\nlimit), we now discuss what happens in between. This\ncan be achieved by computing the next to leading order\ncorrection in an series expansion in terms of initial fields,\ni.e. p = 1 in Eq. (21). Diagrammatically it corresponds\n\n\f12\n\nk\ni +k\nj\n\nk\n\n∑ab C(ab) =\n\ni\n\nkj\n\n+\n\n+\n\n+\n\nki +kj\n\n=\n\n+\n\n+\n\n+\n\n+\n\n+\n\n+ ...\n\nki +kj\n\n+\n\n+ ...\n\n= ... = |k1+...+ kp-1|2 (e\n\ns-1)2\n\nFIG. 9: Sum of the one-loop contributions described by C(ij) , defined in Eq. (40). The contributions involving the wave\nvectors ki , kj and their sum is singled out. The first three diagrams correspond to the one-loop contribution involving an extra wave vector, k′ (dashed line). By the high-k summation rules described before Eq. (34), they sum to\nk′ * [(ki + kj )(es2 − es1 ) + ki (es1 − 1) + kj (es1 − 1)] (es2 − 1) = k′ * (ki + kj )(es2 − 1)2 . The next three and last three diagrams correspond to \"internal\" loops (i.e. loops attached to the principal lines with momenta ki , kj and their sum). As\nshown for the computation of Γ(2) , these six diagrams sum to |ki + kj |2 (es2 − 1)2 . By the summation rules, these two results\ncan be expressed by two contributions to C(ij) with one less branch, as shown by the two diagrams in the last line. The same\nprocedure can be applied recursively until the expression of C(ij) reduces to that coming from a single branch, leading to the\nfinal expression.\n\nto calculating the one-loop diagrams from Fig. 6, according to the rules given in section II. There are six types\nof such diagrams, depending on where each of the loop\nlines is attached to in the principal tree. Depending on\nthis, they can be labelled as {33}, {11}, {22}, {12}, {13},\nand {23}. Each of these cases is depicted in Fig. 6.\nIn Eq. (28) we wrote down explicitly the one-loop inte(2)\ngral expression for Γabc,{13} . A similar procedure can be\nfollowed to obtain expressions for the rest of the one-loop\ncontributions. The difficulty in their actual computation\nresides in the integration over loop momenta. The angular integrations are independent of P0 (k) and can be\ndone analytically. Such integrations involve two sets of\nfunctions, one built out of\n\u0012\n\u0013\nZ\n1\nπ log (k1 + q)2\n2\nd Ωq\n(43)\n=\n|k1 + q|2\nk1 q (k1 − q)2\nand the other built out of,\nZ\n1\n=\nd2 Ωq\n2\n|k1 + q| |k2 − q|2\nπ log (W+ /W− )\np\n2\n2\nk3 q k1 k2 + q 4 + q 2 (k32 − k12 − k22 )\n\n(44)\n\nwith,\n\nW± ≡ ±2(k12 − q 2 )(k22 − q 2 ) ± 4k32 q 2 + 4k3 q\nq\n× k12 k22 + q 4 + q 2 (k32 − k12 − k22 )\n\n(45)\n\nand k3 = |k1 +k2 |. The explicit expression of the final result for arbitrary dependence on configuration (k1 , k2 , k3 )\nis too long to reproduce here. However, we have checked\n(2)\nthat Γabc,1loop (k1 , k2 , q) follows the expected large-k\nlimit. In the low-k limit, it is interesting to note that\nafter the angular integration Γabc,1loop (k1 , k2 , q) behaves\nas 1/q 2 .\n\n\f13\nThe most growing contribution (i.e. largest power in growth factor) in this limit is,\n\u0014\n4901(k12 + k22 ) 32879k14 + 231478k12k22 + 32879k24\n(2)\n(k1 * k2 )\n+\nΓ1,1loop (k1 , k2 , s) ∼ −\n18865\n226380k12k22\n\u0015\n9552(k12 + k22 )\n12409\n2\n3\n+\nσv2 a4 (τ ),\n(k\n*\nk\n)\n+\n(k\n*\nk\n)\n1\n2\n1\n2\n18865 k12k22\n56595 k12k22\n\n(46)\n\nwith σv2 given in Eq. (26) and a(τ ) the linear growth factor. Note that its angular dependence can be different from\nthat of the tree order expression, depending on configuration.\nFor the complete result (but still most growing) valid at all scales we restrict to particular triangle configurations.\nFor equilateral configurations (k1 = k2 = k3 = k),\nZ\n\u0011\n\u0010\nn h\n\u00013\n\u0001\n1\n(2) equi.\nequi\nequi\np\nk 3 − kq 2\n/W−\n4k 6 32k 2 + 45q 2 log W+\nΓ1,1loop =\nP0 (q) d3 q\n2483712k 5q 5 k 4 − q 2 k 2 + q 4\np\n\u0001i\n+q k 4 − q 2 k 2 + q 4 5754k 8 − 33521q 2k 6 + 41247q 4k 4 − 27039q 6k 2 + 5175q 8\n\u0012\n\u0013\u001b\n\u00013\n\u0001p\n(k + q)2\n−3 k 2 − q 2\n2174k 4 + 4413q 2 k 2 − 1725q 4\nk 4 − q 2 k 2 + q 4 log\n,\n(47)\n(k − q)2\nequi\nwhere W±\ncorrespond to the value of W± for an equilateral configuration. For colinear configurations (k3 = 2k1 =\n2k2 = k),\n\u001a\nZ\n57171840k 8 − 69330880q 2k 6 + 49644768q 4k 4 − 13102080q 6k 2 + 2349765q 8\n(2) colin.\n3\n+\nΓ1,1loop =\nP0 (q) d q\n3179151360k 4q 4\n\u00012\n\u0001\n\u00014\n(2)\n(2)\n(1)\n(1)\nlog(W+ /W− ) q 2 − 4k 2\n2k 4 + 7q 2 k 2 − 9q 4\n3 log(W+ /W− ) q 2 − 4k 2\np\np\n+\n−\n275968kq 5 16k 4 − 7q 2 k 2 + q 4\n29568kq 5 4k 4 − q 2 k 2 + q 4\n\u0010\n\u0011\n\u0001\n2\n1146k 10 + 3259q 2k 8 − 7539q 4k 6 + 4191q 6k 4 − 1363q 8 k 2 + 306q 10 log (k+q)\n(k−q)2\n−\n1892352k 5q 5\n\u0010\n\u0011\n\n\u00012\n\u0001\n(2k+q)2\n\nq 2 − 4k 2\n976064k 6 − 253104q 2k 4 − 178124q 4k 2 + 19563q 6 log (q−2k)\n2\n(48)\n5\n5\n\n1695547392k q\n(1)\n\n(2)\n\nwhere W± = W± (2k, 2k, k) and W± = W± (2k, k, 2k).\n\nEquations (47) and (48), fully specify the most growing contributions to the density propagator, their time\ndependence being an overall scaling by a4 (τ ).\nAs examples we show in Fig. 10 the dependence\n(2)\nof Γ1,1loop (k1 , k2 , q) on q for particular triangular con(2)\n\nfigurations, with Γ1,1loop (k1 , k2 , q) defined such that\nR (2)\n(2)\nΓ1,1−loop (k1 , k2 ) = Γ1,1loop (k1 , k2 , q)P0 (q)q 2 dq. For\nsmall values of q, corresponding to the large-k limit, we\nrecover the tree-order result. For large values of q, the\nintegrand behaves similarly, but with a different amplitude.\nVI.\n\nTHE THREE-POINT PROPAGATOR IN\nNUMERICAL SIMULATIONS\n\nWe now show in more detail comparison of our results against measurements in numerical simulations for\nthe three-point propagator. As mentioned before, the\n\ncross-correlation property, Eq. (22), allows us to easily\nmeasure the three-point propagator in numerical simulations. In fact, this can be straightforwardly extended to\nother multi-point propagators using Eq. (23).\nIn practice initial conditions in simulations are generally set in the linear growing mode in which case Eq. (22)\nbecomes,\n\nΨa (k)δ0 (−k1 )δ0 (−k2 )\n×\n\n= 2 δD (k − k1 − k2 )\n\nΓ(2)\na (k1 , k2 )P0 (k1 )P0 (k2 ),\n\n(2)\n\n(49)\n\n(2)\n\nwhere we used the shorthand notation Γa = Γabc ub uc\nwith ua = (1, 1) and φa (k) = ua δ0 (k), and the initial\npower spectrum obeys P0 (k)δD (k+ k′ ) = δ0 (k)δ0 (k′ ) ).\n(2)\n\nTherefore, Γa can be measured by implementing the\n\n\f14\n\nFIG. 10: Momentum dependence of the three-point density\n(2)\npropagator integrand Γ1,1loop (k1 , k2 , q) for different configurations. The solid line denotes equilateral triangles (with\nk1 = k2 = k3 = 1); the short dashed line colinear triangles\n(with k1 = k2 = 0.5, k3 = 1); and the long dashed line triangles with k1 = 0.816, k2 = 0.3, k3 = 1 (in all cases units are in\nh/Mpc). The y-axis has been normalized to the large-k limit\nexpression given in Eq. (33). Notice how this limit is reached\nfor small values of q, as expected.\n\nfollowing algorithm based on Eq. (49),\nΓ(2)\na (k1 , k2 , k3 ) =\n\n1\n1 XX\nΨa (kl , s)\n2P0 (k1 )P0 (k2 ) N\nki kj kl\n\n×δ0 (−ki )δ0 (−ki ),\n\n(50)\n\nwhere the sum runs over Fourier modes ki in the |k1 |\nbin, kj in the |k2 | bin and kl in a bin |k3 | such that\n|k1 − k2 | ≤ |k3 | ≤ k1 + k2 , and N is the number of terms\nin the triple sum.\nIn writing Eq. (50) we have assumed that the three(2)\npoint correlator Γa does not depend upon the orientation of the triangle but only on the magnitude of its\nsides, as expected from statistical isotropy. Additionally\none must be aware that the estimator in Eq. (50) is only\nstrictly valid when the initial field δ0 is Gaussian (otherwise, one must go back to the definition Eq. (16) and\nimplement the functional derivative, see [4] for such details in the case of the two-point propagator).\nIn this paper we focus on the statistics of the density\n(2)\nfield, and thus we only present measurements of Γ1 . Ob(2)\ntaining Γ2 requires the measurement of the local veloc(2)\nity divergence, while measuring other components of Γabc\nrequires numerical simulations with a mixture of growing\nand decaying modes in the initial conditions.\nTo test our theoretical results from sections IV and\n\nV, we use Eq. (50 to measure the three-point propagator in N-body simulations using a set of 50 realizations, with each realization containing Npar = 6403 particles within a cubic volume of side Lbox = 1280h−1Mpc.\nThe total comoving volume of our simulations, approximately 105 (h−1 Gpc)3 , is large enough to minimize cosmic variance. Cosmological parameters were chosen as\nΩm = 0.27, ΩΛ = 0.73, Ωb = 0.046 and h = 0.72. The\ncorresponding initial power spectrum had scalar spectral\nindex ns = 1 and was normalized to yield σ8 = 0.9\nwhen linearly evolved to z = 0. The simulations were\nrun using Gadget2 [24] with initial conditions set at\nzi = 49 using 2nd order Lagrangian Perturbation Theory\n(2LPT) [3, 19]. The output times were at z = 1, 0.5, 0.\nAt each output time we measured the two and three-point\npropagators by cross-correlating the density field at the\ndesired time with the initial density field at zi = 49 (as\ndescribed above and in [4]).\nFigure 11 shows the density three-point propagator\n(2)\nΓ1 for equilateral configurations (top left panel for z = 0\nand bottom panels for z = 0.5, 1, as labeled) and colinear\nconfigurations (top right panel, z = 0). In each panel the\nsymbols with error bars correspond to the measurements\nin the N-body simulations, the long dashed line represents the one-loop result from Eqs. (47,48) and the solid\nline the large-k limit from Eq. (37). In all cases the errors\ndisplayed are for the mean of the ensemble obtained from\nthe scatter among the 50 realizations. For simplicity we\nonly show the more familiar configurations, corresponding to colinear and equilateral triangles, although we have\nmeasured all configurations.\nThe comparison in Fig. 11 shows overall that both\nlarge-k and low-k regimes are well modeled by the analytic results for different triangle configurations and redshifts. This establishes a good basis from which a matching ansatz can be constructed to describe also intermediate scales, as done in [4] for the two-point propagator.\nLet us now point out some limitations in the measurements that help understand better the significance of the\nlevel of agreement seen in Fig. 11. The asymptotic limit\nto the tree level value at large scales is difficult to measure\nsince few configurations of a given shape are available at\nlow k, which gives rise to relatively large cosmic variance.\nTo partially mitigate this one is tempted to increase the\nbin size in Fourier space. However, a larger bin size introduces a mixing of triangles of slightly different shape,\n(2)\nwhich have different Γ1 . For equilateral triangles, increasing the bin size introduces slightly off equilateral\ntriangles which bias the result to higher values as we show\nbelow, while the opposite is true for colinear configurations. Therefore a trade-off takes place between reducing\nthe bin size to obtain unbiased results but at the expense\nof increasing the cosmic variance. We choose a bin size\nδk = 0.005 h Mpc−1 = kF (the fundamental mode of the\nsimulation volume) for k . 0.15 h Mpc−1 , 2kF that up\nto k . 0.4 h Mpc−1 and 4kF for smaller scales where the\nimpact from offset configurations is negligible. This is\nthe reason why the error bars diminish by a factor of\n\n\f15\na few at e.g. k ∼ 0.15h−1 Mpc for equilateral triangles.\nFor colinear triangles, the change in binning happens at\nslightly different scales, evident from looking at the top\nright panel in Fig. 11.\nThe bias of the Γ(2) estimator can be understood and\nquantified using the tree level results as follows. Since\nk3 = k1 + k2 , equilateral triangles have an angle of 120◦\nbetween k1 and k2 . Configurations slightly off this will\ngive a tree level result, from Eq. (20), equal to\n√\n1\n2 5 3\n(2)\n◦\nΓ\n(k,\nk,\ncos(120\n+\nδ))\n≈\n−\nδ,\n(51)\n1,tree\n2\nD+\n7\n14\nwhere 2/7 is the \"exactly\" equilateral value. The offequilateral configurations with larger k3 have more statistical weight (more Fourier modes), and they are represented by negative δ. Therefore a bias towards higher\n(2)\nvalues of Γ1 is introduced by increasing the bin size.\nConversely, the slightly off-colinear configurations would\nbias the measurement below the exactly colinear case because\n11\n1\n(2)\nΓ1,tree (k, k, cos(0◦ + δ)) ≈ 2 − δ 2 ,\n2\nD+\n14\n\n(52)\n\nresulting in a negative estimator bias.\nThe empty circles in Fig. 11 correspond to the measurements \"corrected\" for the estimator bias assuming that\n(2)\nthe configuration dependence of Γ1 , slightly away from\nthe exactly colinear or equilateral configurations, is given\nby the tree-level expressions above (with δ ∼ kF /k). For\nequilateral configurations the agreement with the oneloop prediction at intermediate scales is improved, particularly at z = 0.5 and 1. For colinear configurations\nthe correction is negligible.\nThese estimates assume tree-level perturbation theory,\nwhen loop corrections are included the situation is expected to changed somewhat. As it is well known in the\nbispectrum case [21], at low redshift the dependence on\nconfiguration is suppressed, so the estimator bias is expected to be larger at higher redshift where mixing different triangles leads to more bias. This helps explain\nwhy at higher redshift (bottom right panel in Fig. 11),\nthe intermediate scale measurements done with bin size\n2kF are more above the predictions than at low redshift.\n\nFinally, it is easy to show that the size of error bars\n(2)\n−1\non Γa scales as D+\n, as for the bispectrum [21]. This is\nnicely recovered in Fig. 11 when one compares z = 1, 0.5\nand 0.\n\nVII. APPLICATIONS TO THE POWER\nSPECTRUM AND BISPECTRUM\nA.\n\nReconstructing the Power Spectrum from\nMulti-Point Propagators\n\nWe now discuss the relationship between multi-point\npropagators and nonlinear corrections to the power spectrum, showing that the power spectrum Pab can be reconstructed by gluing together Γ(p) contributions, as briefly\nmentioned in Eq. (18) above.\nA formal expression for Pab (k) can be written using\nthe expansion in Eq. (9) as,\nδD (k1 + k2 )Pab (k1 , s) ≡\n\nΨa (k1 , s)Ψb (k2 , s)\nX\n(n )\n=\nΨa(n1 ) (k1 , s)Ψb 2 (k2 , s)\nn1 ,n2\n\n(53)\n\nThen, for a given choice of indices n1 and n2 one has to\ncompute the ensemble average of n1 + n2 factors φ(qi ),\nfollowing the field expansion in Eq. (10).\nSince we assume Gaussian initial conditions, this joint\nensemble average is then a sum of various terms, each\nof them the product of two-point correlators (Wick's\ntheorem). Each of these terms can be labelled with\nindices r, s, t, where r is the number of connected pairs\nwithin the first n1 fields φci (qi ), s is the number of\nconnected pairs within the last n2 fields φdi (q′i ), and\nt is the number of \"mixed\" pairs connecting fields\nfrom the first n1 and the last n2 . Obviously one\nhas n1 = 2r + t and n2 = 2s + t. Let us define\nφc1 (q1 ) . . . φc2r+t (q2r+t ); φd1 (q′1 ) . . . φd2s+t (q′2s+t ) r,s,t\nas the subset of the terms appearing in\nφc1 (q1 ) . . . φc2r+t (q2r+t )φd1 (q′1 ) . . . φd2s+t (q′2s+t ) c\nthat correspond to a given r, s, t triplet.\n\nThen the discrete sum in (53) can be written as a sum over r, s and t as,\n\nΨa (k1 )Ψb (k2 ) =\n\nXZ\n\nr,s,t\n\nd3 q1 . . . d3 q2r+t d3 q′1 . . . d3 q′2s+t δD (k1 − q1...2r+t ) δD (k2 − q′1...2s+t )\n\n(2s+t)\n(2r+t)\n(q1 , . . . , q2r+t ; η)Fbd1 ...d2s+t (q′1 , . . . , q′2s+t ; η)\n×Fac\n1 ...c2r+t\n\nφc1 (q1 ) . . . φc2r+t (q2r+t ); φd1 (q′1 ) . . . φd2s+t (q′2s+t )\n\nr,s,t\n\n(54)\n\n\f16\n\n(2)\n\nFIG. 11: Measurements of the three-point density propagator Γ1 against analytical predictions for different triangle configurations and redshifts. Top Left Panel: equilateral configurations at z = 0. Top Right Panel: colinear configurations at z = 0.\nBottom Panels: equilateral configurations at z = 0.5 (Left) and z = 1 (Right). In each panel the long dashed line corresponds\nto the one-loop prediction given in Eqs. (47,48) while the solid line is the high-k limit derived in Eq. (37). At large scales the\nmeasurements reach the tree-level result well known from standard perturbation theory (horizontal short dashed line), given\nby Eq. (20). The empty circles in the panels of equilateral configurations are the measurements after the correction due to the\nestimator bias as described in the text. In addition, the sudden change in the size of error bars as a function of scale is due to\nthe change in binning, see text for details.\n\nwhere we have omitted the time variable η for clarity. This expression can be further written as,\n\u0012\n\u0013\u0012\n\u0013Z\n2r + t 2s + t\nΨa (k1 )Ψb (k2 ) =\nt!(2r − 1)!!(2s − 1)!!\nd3 q1 . . . d3 qr d3 q′1 . . . d3 q′s d3 q′′1 . . . d3 q′′t\nt\nt\nr,s,t\nX\n\n(2s+t)\n\n×F̄a(2r+t) (q′′1 , . . . , q′′t , q1 , −q1 . . . , qr , −qr ; η) F̄b\n(−q′′1 , . . . , −q′′t , q′1 , −q′1 . . . , q′s , −q′s ; η)\n×P0 (q1 ) . . . P0 (qr ) P0 (q1′ ) . . . P0 (qs′ ) P0 (q1′′ ) . . . P0 (qt′′ )\n(n)\n\nwhere F̄a\n\n(n)\n\n(55)\n\n≡ Fac1 ...cn uc1 . . . ucn and P0 is the initial power spectrum from Eqs. (8,12). Remarkably, one can recognize\n\n\f17\np1\n\nP(k) = Σn\n\nk\npn\n\n×\n-p1\n×\n×\n×\n×\n\n-k\n\n-pn\n\nFIG. 12: Reconstruction of the power spectrum from multipoint propagators, where a large shaded circle represents all\npossible loops that enter into the fully nonlinear multi-point\npropagator (see Fig. 2 for its perturbative expansion). The\ncrossed circles represent initial power spectra. The sum runs\nover the number of internal connecting lines, i.e. the number\nof such circles. It is important to note that each term in this\nsum is positive.\n\nin this expression a sum of products of Γ(t) functions, see Eq. (21), leading to the formal expression,\nX Z\n(t)\nPab (k, η) =\nt! d3 q1 . . . d3 qt δD (k − q1...t ) Γ(t)\na (q1 , . . . , qt ; η) Γb (q1 , . . . , qt ; η) P0 (q1 ) . . . P0 (qt ),\n\n(56)\n\nt\n\nwhere we have introduced the shorthand notation,\n(t)\nΓ(t)\na (q1 , . . . , qt ) = Γac1 ...ct (q1 , . . . , qt ) uc1 . . . uct , (57)\n\nand used the following property,\n(n)\n\n(n)\n\nΓab1 ...bn (k1 , . . . , kn ) = Γab1 ...bn (−k1 , . . . , −kn )\nThus, we have shown that the power spectrum can be\nwritten as a summation over contracted n−point propagators. This sum is diagrammatically represented in\nFig. 12, and corresponds to a contraction of Γ(n) diagrams when the incoming lines are glued together to\nform initial power spectra. The combinatorial factor t!\nin front of Eq. (56) is the number of ways of contracting\ntwo (t + 1)-point propagators.\nIt is interesting to note that for a = b, the result is\na sum of positive terms. For example, for the density\nspectrum (a = b = 1) up to one-loop corrections we have,\nP (k) = [Γ(1) (k)]2 P0 (k)\nZ\n+ 2 d3 q [Γ(2) (k − q, q)]2 P0 (|k − q|)P0 (q).\n\n(58)\n\nThis resummation scheme is then very attractive in\npractice, because, unlike standard PT, the subsequent\ncontributions add constructively and correspond to a sum\nover \"bumps\" peaked at increasingly higher k's. We encounter here a similar situation as the one presented in\nthe original formulation of RPT [4, 5], although the resummation scheme differs in detail. For example, here\nit is important to note that we are led to consider an\n\ninfinite number of objects, the n−point propagators, a\nproperty at variance with what a renormalization group\napproach suggests [30]. This is unlike in [4, 5] where\none deals with a few objects, e.g. the two-point propagator and the vertex (in this regard, note that Eq. (56)\nautomatically incorporates vertex renormalization). We\nhave seen though that the multi-point propagators share\ncommon, and useful, properties. In particular, their expression for the high-k limit (kσv ≫ 1) provide a useful\napproximation to compute multi-loop corrections to the\npower spectrum, i.e. the mode-coupling power spectrum\nin Eq. (15).\nWe finalize this section by noting that the relation in\nEq. (56) can be also obtained by considering an expansion\nof the field Ψa in terms of generalized Wiener-Hermite\nfunctionals of the initial fields φa , see [12]. The multipoint propagators defined in Eq. (17) would then correspond to the kernel coefficients of this expansion. In\n[12] it is also introduced the formal expansion to address\nthe more general case of non Gaussian initial conditions.\nNote however that this approach does not provide a prescription to compute these kernels (e.g. a resummation\nscheme such as the one derived in Sec.IV or in [5] for\nΓ(2) ).\n\nB.\n\nReconstructing the Bispectrum from\nMulti-Point Propagators\n\nWe now extend these results to the bispectrum. Generalizing Eq. (56) it is easy to show that the bispectrum\ncan be formally written as,\n\n\f18\n×\n×\n\nk1\n\nk2\n\n×\n×\n×\n\nB(k1,k2,k3) = Σr,s,t\n\n×\n\n×\n\n×\n\n×\n\nk3\n\nFIG. 13: Reconstruction of the bispectrum from multi-point\npropagators. The crossed circles represent initial power spectra. The sum in Eq. (59) runs over the number of connecting\nlines between each of the emerging modes, e.g. that cross\neach of the dashed half lines.\n\nΨa (k1 )Ψb (k2 )Ψc (k2 )\n\n=\n\nZ\nX \u0012r + s\u0013\u0012s + t\u0013\u0012t + r\u0013\nr!s!t! d3 q1 . . . d3 qr d3 q′1 . . . d3 q′s d3 q′′1 . . . d3 q′′t\nr\ns\nt\nr,s,t\n×δD (k1 − q1...r − q′1...s ) δD (k2 + q′1...s − q′′1...t ) δD (k3 + q′′1...t + q1...r )\n(s+t)\n\n×Γ(r+s)\n(q1 , . . . , qr , q′1 , . . . , q′s ) Γb\na\n\n(−q′1 , . . . , −q′s , q′′1 , . . . , q′′t )\n\n× Γ(t+r)\n(−q′′1 , . . . , −q′′t , −q1 , . . . , −qr ) P0 (q1 ) . . . P0 (qr ) P0 (q1′ ) . . . P0 (qs′ ) P0 (q1′′ ) . . . P0 (qt′′ ).\nc\n(59)\nThis sum is diagrammatically represented in Fig. 13. We see that it runs over the number of lines that connect each\nside of the diagram (with the constraint that at most one of the indices r, s or t is zero, otherwise we would have\na disconnected diagram). The leading order (tree) contribution is then obtained for r = s = 1, t = 0 (plus cyclic\npermutations), up to one-loop corrections (in square brackets) we have\nB(k1 , k2 , k3 ) = 2 Γ(2) (k1 , k2 ) Γ(1) (k1 ) Γ(1) (k2 ) P0 (k1 )P0 (k2 ) + cyc.\nh Z\n+ 8 d3 q Γ(2) (k1 − q, q)Γ(2) (k2 + q, −q)Γ(2) (q − k1 , −k2 − q)P0 (|k1 − q|)P0 (|k2 + q|)P0 (q)\nZ\ni\n+ 6 d3 q Γ(3) (−k3 , −k2 + q, −q)Γ(2) (k2 − q, q)Γ(1) (k3 )P0 (|k2 − q|)P0 (q)P0 (k3 ) + cyc. .\n(60)\nNote that having resummed the multi-point propagators\nmeans that many of the one-loop corrections in standard\nPT are already encoded in Γ(p) and thus the number of\none-loop diagrams is reduced. For the power spectrum\nwe have one instead of two diagrams, for the bispectrum\nwe have two instead of the four in standard PT [21].\nIt is useful to compare the structure of Eqs. (58)\nand (60). We see that the one-loop corrections to the\npower spectrum depend on the initial power spectrum P0\nthrough a convolution with the three-point propagator\nΓ(2) , which determines the large-scale (tree-level) bispectrum. The two-loop correction to the power spectrum involves a similar convolution with Γ(3) , which determines\nthe large-scale trispectrum, and contributes to the oneloop bispectrum. This pattern continues to higher orders, demonstrating that in order to extract the most\n\ninformation about the initial power spectrum P0 , it is\nadvantageous to simultaneously measure the power spectrum and higher-order spectra at large scales and include\nthese relationships when doing cosmological parameter\nestimation.\nAs a preliminary application of these results, we compute the reduced bispectrum Q defined by\nQ=\n\nB(k1 , k2 , k3 )\n,\nP (k1 )P (k2 ) + P (k2 )P (k3 ) + P (k3 )P (k1 )\n\n(61)\n\nwhere we use one-loop results for both the power spectrum and bispectrum from Eq. (58) and Eq. (60), respectively. Since we don't yet have a full prescription for the\nmulti-point propagators valid at all scales, we use their\nhigh-k limit expressions, Eq. (42) modified as follows,\n\n\f19\n\nΓ(p) =\n\nΓ(1) (kp )\n(1)\n\nΓtree (kp )\n\n(p)\n\nΓtree ,\n\n(62)\n\nwhich reduces to Eq. (42) in the high-k limit, and approximately incorporates (through the full scale-dependence\nof the two-point propagator Γ(1) found in [4]) the fact\nthat at low-k propagators decay slower than their highk limit indicates, as shown in Fig. 11 by comparing the\none-loop to the high-k expressions at low-k.\nFigure 14 shows the result of this calculation (solid\nlines) compared to measurements of the bispectrum in\nour numerical simulations (symbols with error bars). Because we only compute up to one-loop corrections, the\nrange of scales available to test our predictions is limited. At low-k, the deviations from tree-level PT are\nsmall, and error bars increase. At high-k two-loop corrections become important (see e.g. Fig. 3 in [6] for the\ncase of the power spectrum). We concentrate on z = 0\nwhere the deviations from tree-level are largest and the\napplication of standard PT is least successful. The scales\nshown in Fig. 14 are those where the deviations from\ntree-level are largest while we seem to be still within the\nvalidity of the one-loop approximation. We see that the\nlevel of agreement with simulations is very encouraging\ndespite the approximate nature of Eq. (62), correctly describing the loss of dependence of Q on triangle shape.\nMore work is needed to explore the robustness of these\npredictions, but it is clear that the results found in this\npaper on multi-point propagators will be useful for a variety of statistics. A detailed discussion of the bispectrum\nwill be presented elsewhere.\n\nVIII.\n\nCONCLUSIONS\n\nWe generalized the notion of two-point propagator to\narbitrary multi-point propagators. We derived the oneloop corrections to the three-point propagator, and were\nable to resum the dominant class of diagrams contributing to multi-point propagators in the large-k limit, extending what was derived before for the two-point propagator in [4]. Our results show that multi-point propagators decay with the same rate as the two-point propagator in the large-k limit and are proportional to their\ntree-level values. We have extended the algorithm presented in [4] to measure the three-point propagator in\nnumerical simulations, and showed that our high-k limit\nresummation agrees well with both two and three-point\npropagators at nonlinear scales.\nFurthermore, we showed that the multi-point propagators can be considered building blocks out of which\none can construct arbitrary n−point spectra. In addition, nonlinear corrections to the power spectrum depend\non the initial spectrum through convolutions with multipoint propagators, which in turn determine the largescale (tree-level) polyspectra. This gives a direct physical\n\nFIG. 14: The reduced bispectrum Q at z = 0 in tree-level\nPT (dashed line), one-loop RPT (solid line) and measured in\nnumerical simulations (symbols with error bars) as a function\nof the angle between k1 and k2 .\n\nconnection between nonlinear corrections to the power\nspectrum at small scales and higher-order correlations at\nlarge scales.\nWe used our results on the resummation of multi-point\npropagators to reconstruct the power spectrum and bispectrum up to one-loop level, and showed that the predictions for the reduced bispectrum agree well with measurements in numerical simulations. This is encouraging\nnews for the calculation of higher-order correlation functions in renormalized perturbation theories.\nAcknowledgments\n\nThis work was supported in part by the French Programme National de Cosmology and by the French\nAgence National de la Recherche under grant BLAN071-212615. MC acknowledges from support from Spanish Ministerio de Ciencia y Tecnologia (MEC), project\nAYA2006-06341 and the Juan de la Cierva MEC program. RS is partially supported by NSF AST-0607747\nand NASA NNG06GH21G.\n\n\f20\nAPPENDIX A: TIME-ORDERING AND\nEQUATION (37)\n\nHere we provide another derivation of the resummation\nof the three-point propagator that explicitly takes into\naccount time-ordering. An n-loop diagram is specified by\nthe number of vertices ni (i = 1, 2, 3) along the principal\nlines with momenta ki , i.e. 2n = n1 + n2 + n3 , n1 =\n2p11 + p12 + p13 , n2 = 2p22 + p12 + p23 , n3 = 2p33 +\np13 + p23 , where\npij are defined as in section IV C (note\nP\np\nthat n =\ni≤j ij ). Here we start from scratch, i.e.\nto construct such an n-loop diagram we start from the\nprincipal tree, to which we attach ni branches to principal\nlines of momentum ki each with its initial condition (as\nin Fig. 1) and we proceed to take expectation values.\nConsider one of the principal lines at a time, say (3)\ncarrying momentum k3 . There are n3 time-ordered vertices along this line, and its symmetry factor is 2n3 because branching is asymmetric (which leads to Eq. (35)\nwhen all three principal lines are included). Out of these\nn3 branches one must select 2p33 for averaging among\nthemselves (thus making p33 loops), out of the remaining p13 + p23 one must select p13 for averaging with p13\nbranches attached to the principal line (1), thus creating p13 loops, and the remaining p23 average with p23\nbranches attached to (2). The number of ways of doing\nthis is,\n\u0012\n\u0013\u0012\n\u0013\nn3\np13 + p23\nn3 !\n=\n(A1)\n2p33\np13\n(2p33 )! p13 ! p23 !\nand the analogous combinatorial factors also apply to the\nother 2 principal lines. The process of taking expectation\nvalues introduces the following factors: (2pii − 1)!! is the\n\n(2)\nΓabc,{pij }\n\nnumber of ways of averaging pairs (Gaussian fields) out\nof 2pii initial conditions, while there are pij ! ways of connecting pij branches (i 6= j) coming out of principal lines\n(i) and (j). This leads to the combinatorial factor,\n\n(2p11 − 1)!! (2p22 − 1)!! (2p33 − 1)!! p12 ! p13 ! p23 !\n\nPutting together this with Eq. (A1) and its two permutations for the two other principal lines (and the symmetry\nfactors for each line) we have a total overall factor of\n2n1 +n2 +n3 n1 ! n2 ! n3 !\nQ\n2p11 +p22 +p33 i≤j pij !\n\nAPPENDIX B: RESUMMATION IN FOURIER\nSPACE SHELLS\n\nThe results presented in the main part of this paper\nrely on a direct resummation of multiloop contributions.\nIn this appendix we present another method that makes\nuse of the mathematical structure of the loop correction\nterms in the large-k limit. The idea is to partition Fourier\n\n(A3)\n\nFinally the time-ordered integrals give, e.g. for principal\nline (3),\ns\n\ns1\n\nsn3 −1\n\n′\n\n(es − es )n3\n,\nn3 !\ns′\ns′\ns′\n(A4)\nwhere s is the final time and the principal tree splits\nat time s′ . For principal lines (1) and (2) one obtains\nanalogous factors ′but with the corresponding time dependences, i.e. (es − 1). Therefore, we see that the ni !\nfactors in Eq. (A3) get cancelled by time-ordering (as expected from the discussion in section IV C, see in particular Fig. 7). Then, after momentum integration, which\ngives −σv2 ki kj /4 for loops attached to principal lines (i)\nand (j), we can write this equation taking into account\ntime ordering as follows,\nZ\n\nds1 es1\n\nZ\n\nds2 es2 . . .\n\nZ\n\ndsn3 esn3 =\n\n\u0001\nY (−k 2 σ 2 /2)pii Y −ki .kj σv2 pij Z s\ni v\n=\nds′ gad (s − s′ )γdef (k1 , k2 , k3 )geb (s′ )gf c (s′ )\np\n!\np\n!\nii\nij\n0\ni\ni<j\n\u0010 ′\n\u00112p11 +2p22 +2p12 +p13 +p23 \u0010\n\u0011\n′ 2p33 +p13 +p23\n× es − 1\n,\nes − es\n\nwhich when summed over the pij , and using that k3 =\nk1 +k2 , gives the tree-level value times a Gaussian factor,\ni.e. Eq. (37).\n\n(A2)\n\n(A5)\n\nspace into finite volume elements. Although there is no\nneed to actually specify the partition we will be using, one\nsimple way of constructing an explicit one is to decompose the volume into concentric shells that we will denote\ni, j, . . . , with the i-th shell corresponding to q ∈ [Λi−1 , Λi ]\nand being of width δΛ\nR i . That means that\nPthe integration\nover Fourier modes, dq3 , becomes 4π i Λ2i δΛi assuming that the integrand depends on the norm of q only. Let\nus now explore the loop contributions for the two-point\npropagator Gab in this framework.\nAccording to the results presented in section IV, see\ne.g. Eq. (30), the contribution to the one-loop correction\ncoming from shell i to Gab (k), δ i Gab (k), reads in the\n\n\f21\nlarge-k limit\nδ i Gab (k) = gab (k) L(k, Λi )δΛi ,\n\n(B1)\n\nwhere we used the following definitions,\n\nI⊂1,...,i\n\n2\n\n2πk s1 s2\nL(s2 , s1 , k, Λ) = −\n(B2)\ne e P0 (Λ)\nZ s3 Z s\nL(k, Λ) =\nds1\nds2 L(s2 , s1 , k, Λ)\n0\n\n= −\n\n0\n\n2πk 2 s\n(e − 1)2 P0 (Λ).\n3\n\n(B3)\n\nMultiloop corrective terms exhibit then a truly remarkable property. Let us start with a two-loop contribution.\nIn all of these calculations the linear propagator factors\nalong the principal line can be factorized in the large-k\nlimit, due to the property that gab (s− s′ )gbc (s′ ) = gac (s).\nThus, we simply have for the two-loop contribution to\nGab , δ i,j Gab ,\nδ i,j Gab (k) = gab L(k, Λi )δΛi L(k, Λj )δΛj .\n\n{0, . . . , i − 1} and the subsets of {0, . . . , i} that contains\ni. As a result this sum can be rewritten,\nX\nX\nδ I Gab (k) =\nδ I Gab (k)\n\n(B4)\n\nThis factorization property can be generalized to any order. As a result, for a collection of loops whose indices\nare in set I, the multi-loop correction term, δ I Gab , reads\nY\nδ I Gab (k) = gab\n[L(k, Λi )δΛi ] .\n(B5)\ni∈I\n\nWe can then resum all these contributions, e.g. resum\nδ I Gab for relevant sets I of shell indices. Let us denote\nGab,Λi (k) the resummed value of the propagator when\nall contributions of shells up to i have been taken into\naccount, that is, assuming there is a cutoff for wavemode\nq at q = Λi .\nThe result is formally given by a sum of terms of the\nform δ I Gab (k) where the sum runs over all possible subsets I of {1, . . . , i}, e.g.,\nX\nδ I Gab (k),\n(B6)\nGab,Λi =\nI⊂{1,...,i}\n\nand when the width of each shell is made infinitely small.\nThe subsets of {0, . . . , i} can be split into the subsets of\n\n[1] F. Bernardeau, S. Colombi, E. Gaztañaga, and R. Scoccimarro. Large-scale structure of the Universe and cosmological perturbation theory. Phys. Rep. , 367:1–3,\nSeptember 2002.\n[2] A. Cooray and R. Sheth. Halo models of large scale structure. Phys. Rep. , 372:1–129, December 2002.\n[3] M. Crocce, S. Pueblas, and R. Scoccimarro. Transients\nfrom initial conditions in cosmological simulations. Mon.\nNot. R. Astr. Soc. , 373:369–381, November 2006.\n[4] M. Crocce and R. Scoccimarro. Memory of initial\nconditions in gravitational clustering. Phys. Rev. D ,\n\nI⊂1,...,i−1\n\nX\n\n+\n\nδ I∪{i} Gab (k). (B7)\n\nI⊂1,...,i−1\n\nBecause of the factorization property, (B5), this decomposition then reads\nGab,Λi = Gab,Λi−1 + Gab,Λi−1 L(k, Λi )δΛi .\n\n(B8)\n\nIn the continuous limit it leads to the equation,\nδGab (k, Λ) = Gab (k, Λ) L(k, Λ)δΛ.\n(B9)\nThe solution of this ODE is Eq. (25) for the initial condition Gab (k, 0) = gab (k).\nThis procedure can be simply extended to multi-point\n(2)\n(2)\npropagators. Let us denote Γabc,Λi the expression of Γabc\nwhen modes above Λi are cut out. In a construction\nsimilar to that of the two-point propagator, the structure\nof the loop correction is such that,\n(2)\n\n(2)\n\nδ I Γabc (k1 , k2 , k3 ) = Γabc,tree (k1 , k2 , k3 )\nY\n×\n[L(k3 , Λi )δΛi ] .\n(B10)\ni∈I\n\nIt them implies that\n(2)\n\n(2)\n\nΓabc,Λi (k1 , k2 , k3 ) − Γabc,Λi−1 (k1 , k2 , k3 ) =\n(2)\n\nΓabc,Λi (k1 , k2 , k3 )L(k3 , Λi )δΛi .\n\n(B11)\n\nIn the continuous limit it leads to a simple ODE that can\nstraightforwardly integrated into (37) taking into account\nthe initial condition,\n(2)\n\n(2)\n\nΓabc,Λ=0 = Γabc,tree .\n\n(B12)\n\nThis construction extends to any multi-point propagator, or more precisely the procedure extends to the computation of the loop corrections that apply to any distinct\ntree structure of tree order multi-point propagators.\n\n73(6):063520–+, March 2006.\n[5] M. Crocce and R. Scoccimarro. Renormalized cosmological perturbation theory. Phys. Rev. D , 73(6):063519–+,\nMarch 2006.\n[6] M. Crocce and R. Scoccimarro.\nNonlinear evolution of baryon acoustic oscillations. Phys. Rev. D ,\n77(2):023533–+, January 2008.\n[7] S. Habib, K. Heitmann, D. Higdon, C. Nakhleh, and\nB. Williams. Cosmic Calibration: Constraints from\nthe Matter Power Spectrum and the Cosmic Microwave\nBackground. ArXiv Astrophysics e-prints, February\n\n\f22\n2007.\n[8] A. J. S. Hamilton, P. Kumar, E. Lu, and A. Matthews.\nReconstructing the primordial spectrum of fluctuations\nof the universe from the observed nonlinear clustering of\ngalaxies. Astrophys. J. Letter, 374:L1–L4, June 1991.\n[9] Y. H. Hou, Y. P. Jing, D. H. Zhao, and G. Börner. The\nNonlinear Evolution of the Bispectrum in Scale-free NBody Simulations. Astrophys. J. , 619:667–677, 2005.\n[10] D. Huterer and M. Takada. Calibrating the nonlinear\nmatter power spectrum: Requirements for future weak\nlensing surveys. Astroparticle Physics, 23:369–376, 2005.\n[11] S. Matarrese and M. Pietroni. Resumming cosmic perturbations. Journal of Cosmology and Astro-Particle\nPhysics, 6:26–+, June 2007.\n[12] T. Matsubara. Diagrammatic Methods in Statistics and\nBiasing in the Large-Scale Structure of the Universe. Astrophys. J. Suppl. Ser. , 101:1–+, November 1995.\n[13] T. Matsubara. Resumming Cosmological Perturbations\nvia the Lagrangian Picture: One-loop Results in Real\nSpace and in Redshift Space. ArXiv e-prints, 711,\nNovember 2007.\n[14] P. McDonald. Dark matter clustering: A simple renormalization group approach. Phys. Rev. D , 75(4):043514–\n+, February 2007.\n[15] J. Pan, P. Coles, and I. Szapudi. Scale Transformations,\nTree-level Perturbation Theory, and the Cosmological\nMatter Bispectrum. ArXiv e-prints, 707, July 2007.\n[16] J. A. Peacock and S. J. Dodds. Non-linear evolution of\ncosmological power spectra. Mon. Not. R. Astr. Soc. ,\n280:L19–L26, June 1996.\n[17] P. J. E. Peebles. The large-scale structure of the universe. Research supported by the National Science\nFoundation. Princeton, N.J., Princeton University Press,\n1980. 435 p., 1980.\n[18] O. J. Rosten. A comment on the path integral approach\nto cosmological perturbation theory. Journal of Cosmology and Astro-Particle Physics, 1:29–+, January 2008.\n[19] R. Scoccimarro. Transients from initial conditions: a perturbative analysis. Mon. Not. R. Astr. Soc. , 299:1097–\n1118, October 1998.\n[20] R. Scoccimarro. A New Angle on Gravitational Clustering. In J. N. Fry, J. R. Buchler, and H. Kandrup, editors,\nThe Onset of Nonlinearity in Cosmology, volume 927 of\nNew York Academy Sciences Annals, pages 13–+, 2001.\n[21] R. Scoccimarro, S. Colombi, J.N. Fry, J.A. Frieman,\nE. Hivon, and A. Melott. Nonlinear Evolution of the\nBispectrum of Cosmological Perturbations. Astrophys.\nJ. , 496:586–604, 1998.\n[22] R. Scoccimarro and H. M. P. Couchman. A fitting formula for the non-linear evolution of the bispectrum. Mon.\nNot. R. Astr. Soc. , 325:1312–1316, August 2001.\n\n[23] R. E. Smith, J. A. Peacock, A. Jenkins, S. D. M. White,\nC. S. Frenk, F. R. Pearce, P. A. Thomas, G. Efstathiou,\nand H. M. P. Couchman. Stable clustering, the halo\nmodel and non-linear cosmological power spectra. Mon.\nNot. R. Astr. Soc. , 341:1311–1332, June 2003.\n[24] V. Springel.\nThe cosmological simulation code\nGADGET-2. Mon. Not. R. Astr. Soc. , 364:1105–1134,\nDecember 2005.\n[25] A. Taruya and T. Hiramatsu. A Closure Theory for Nonlinear Evolution of Cosmological Power Spectra. Astrophys. J. , 674:617–635, February 2008.\n[26] P. Valageas. Large-N expansions applied to gravitational\nclustering. Astr. & Astrophys. , 465:725–747, April 2007.\n[27] Formally, a translation x → x + t changes Fourier coeffi′\ncients by a phase eik*t , which induces a factor ei(k−k )*t in\nEq. (13) and hence invariance demands k = k′ . A more\npedestrian demonstration is to recall that an arbitrary\nnonlinear contribution to Ψ(k) of, say, (n + 1)-th order\nin φ with momenta\nqi is restricted by translation invariP\nance to obey n+1\ni=1 qi = k. Upon taking\nP the derivative\n′\nin Eq. (13) this constraint reads e.g. n\ni=1 qi + k = k,\nthus taking\nexpectation\nvalues\nfor\nthe\nn\nremaining\nφ's\nP\nimposes n\nq\n=\n0,\nagain\nby\ntranslation\ninvariance.\ni\ni=1\n[28] An alternative approach has been advocated in [11] based\non a Renormalization Group Theory like approach. Such\na method aims at transforming discrete sums we have to\ndeal with into a simple first order differential equation,\nthe solution of which can be easily obtained. The two\napproaches are based on the same basic properties of the\nloop terms. We comment more on this in the appendices.\n[29] We are able to compute time integrations ignoring timeordering and correcting for this afterwards because the\nintegrand (es1 +s2 ) is symmetric under exchange of s1 , s2 .\nThat\nis,\nR s for such integrands\nRs\nR s we can take advantage of\nRs\nds2 s′2 ds1 = 21 s′ ds2 s′ ds1 . This symmetry arises\ns′\nas a consequence of the simplification of the vertex function in the high-k limit, plus the linear propagator obeying gab (s − s′ )gbc (s′ ) = gac (s). We will use this useful\nproperty in the summation over loops shortly, as it is\nmore convenient to deal with an arbitrary number of integrals with the same limits.\n[30] In particular, it seems unlikely that one could obtain a\nlocal vertex renormalization, e.g. a renormalization flow\nin which g → G and γ → γ̃ where the time dependence\nof Γ would be only that of the time of interaction. The\nreason is that the results obtained here cannot simply be\nrecap in such a form in the large-k limit. If one wants to\nstick to such a renormalisation procedure, it would mean\nthat the class of diagrams we have been able to resum\nwill not be included.\n\n\f"}