{"id": "http://arxiv.org/abs/1011.1823v3", "guidislink": true, "updated": "2012-05-03T23:40:15Z", "updated_parsed": [2012, 5, 3, 23, 40, 15, 3, 124, 0], "published": "2010-11-08T15:17:27Z", "published_parsed": [2010, 11, 8, 15, 17, 27, 0, 312, 0], "title": "Random Overlap Structures: Properties and Applications to Spin Glasses", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1011.0664%2C1011.1790%2C1011.0410%2C1011.5462%2C1011.2211%2C1011.4932%2C1011.1810%2C1011.0806%2C1011.5797%2C1011.1419%2C1011.0549%2C1011.3244%2C1011.0610%2C1011.0338%2C1011.3132%2C1011.3183%2C1011.3748%2C1011.0234%2C1011.6224%2C1011.5321%2C1011.3885%2C1011.0054%2C1011.3447%2C1011.6534%2C1011.3578%2C1011.4937%2C1011.3291%2C1011.4112%2C1011.0183%2C1011.3657%2C1011.1763%2C1011.5257%2C1011.3048%2C1011.4187%2C1011.0676%2C1011.6173%2C1011.6508%2C1011.5489%2C1011.5674%2C1011.1902%2C1011.2556%2C1011.1823%2C1011.4261%2C1011.2081%2C1011.1185%2C1011.5795%2C1011.0555%2C1011.5369%2C1011.0590%2C1011.5707%2C1011.5455%2C1011.5689%2C1011.3654%2C1011.0466%2C1011.3803%2C1011.1065%2C1011.4642%2C1011.2191%2C1011.1917%2C1011.1471%2C1011.3151%2C1011.6553%2C1011.5931%2C1011.3214%2C1011.1181%2C1011.3767%2C1011.4869%2C1011.3527%2C1011.0744%2C1011.4072%2C1011.4179%2C1011.5697%2C1011.3932%2C1011.2063%2C1011.5059%2C1011.5630%2C1011.1103%2C1011.5546%2C1011.5460%2C1011.3185%2C1011.0764%2C1011.3844%2C1011.6667%2C1011.5305%2C1011.5980%2C1011.5229%2C1011.1198%2C1011.1309%2C1011.4146%2C1011.5570%2C1011.5154%2C1011.5105%2C1011.1445%2C1011.0703%2C1011.4961%2C1011.4003%2C1011.1002%2C1011.0402%2C1011.1786%2C1011.5205%2C1011.2028&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Random Overlap Structures: Properties and Applications to Spin Glasses"}, "summary": "Random Overlap Structures (ROSt's) are random elements on the space of\nprobability measures on the unit ball of a Hilbert space, where two measures\nare identified if they differ by an isometry. In spin glasses, they arise as\nnatural limits of Gibbs measures under the appropriate algebra of functions. We\nprove that the so called `cavity mapping' on the space of ROSt's is continuous,\nleading to a proof of the stochastic stability conjecture for the limiting\nGibbs measures of a large class of spin glass models. Similar arguments yield\nthe proofs of a number of other properties of ROSt's that may be useful in\nfuture attempts at proving the ultrametricity conjecture. Lastly, assuming that\nthe ultrametricity conjecture holds, the setup yields a constructive proof of\nthe Parisi formula for the free energy of the Sherrington-Kirkpatrick model by\nmaking rigorous a heuristic of Aizenman, Sims and Starr.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1011.0664%2C1011.1790%2C1011.0410%2C1011.5462%2C1011.2211%2C1011.4932%2C1011.1810%2C1011.0806%2C1011.5797%2C1011.1419%2C1011.0549%2C1011.3244%2C1011.0610%2C1011.0338%2C1011.3132%2C1011.3183%2C1011.3748%2C1011.0234%2C1011.6224%2C1011.5321%2C1011.3885%2C1011.0054%2C1011.3447%2C1011.6534%2C1011.3578%2C1011.4937%2C1011.3291%2C1011.4112%2C1011.0183%2C1011.3657%2C1011.1763%2C1011.5257%2C1011.3048%2C1011.4187%2C1011.0676%2C1011.6173%2C1011.6508%2C1011.5489%2C1011.5674%2C1011.1902%2C1011.2556%2C1011.1823%2C1011.4261%2C1011.2081%2C1011.1185%2C1011.5795%2C1011.0555%2C1011.5369%2C1011.0590%2C1011.5707%2C1011.5455%2C1011.5689%2C1011.3654%2C1011.0466%2C1011.3803%2C1011.1065%2C1011.4642%2C1011.2191%2C1011.1917%2C1011.1471%2C1011.3151%2C1011.6553%2C1011.5931%2C1011.3214%2C1011.1181%2C1011.3767%2C1011.4869%2C1011.3527%2C1011.0744%2C1011.4072%2C1011.4179%2C1011.5697%2C1011.3932%2C1011.2063%2C1011.5059%2C1011.5630%2C1011.1103%2C1011.5546%2C1011.5460%2C1011.3185%2C1011.0764%2C1011.3844%2C1011.6667%2C1011.5305%2C1011.5980%2C1011.5229%2C1011.1198%2C1011.1309%2C1011.4146%2C1011.5570%2C1011.5154%2C1011.5105%2C1011.1445%2C1011.0703%2C1011.4961%2C1011.4003%2C1011.1002%2C1011.0402%2C1011.1786%2C1011.5205%2C1011.2028&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Random Overlap Structures (ROSt's) are random elements on the space of\nprobability measures on the unit ball of a Hilbert space, where two measures\nare identified if they differ by an isometry. In spin glasses, they arise as\nnatural limits of Gibbs measures under the appropriate algebra of functions. We\nprove that the so called `cavity mapping' on the space of ROSt's is continuous,\nleading to a proof of the stochastic stability conjecture for the limiting\nGibbs measures of a large class of spin glass models. Similar arguments yield\nthe proofs of a number of other properties of ROSt's that may be useful in\nfuture attempts at proving the ultrametricity conjecture. Lastly, assuming that\nthe ultrametricity conjecture holds, the setup yields a constructive proof of\nthe Parisi formula for the free energy of the Sherrington-Kirkpatrick model by\nmaking rigorous a heuristic of Aizenman, Sims and Starr."}, "authors": ["Louis-Pierre Arguin", "Sourav Chatterjee"], "author_detail": {"name": "Sourav Chatterjee"}, "author": "Sourav Chatterjee", "arxiv_comment": "35 pages, final version accepted for publication", "links": [{"href": "http://arxiv.org/abs/1011.1823v3", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1011.1823v3", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "math.PR", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "math.PR", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "cond-mat.dis-nn", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "60K35, 82B44, 60B20, 60G57", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1011.1823v3", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1011.1823v3", "journal_reference": null, "doi": null, "fulltext": "Random Overlap Structures:\nProperties and Applications to Spin Glasses\narXiv:1011.1823v3 [math.PR] 3 May 2012\n\nLouis-Pierre Arguin ∗\nDépartement de Mathématiques et Statistique, Université de Montréal\nMontréal, Québec, H3T 1J4, Canada\n\nSourav Chatterjee †\nCourant Institute of Mathematical Sciences\nNew York University, New York, 10012, USA.\n\nApril 16, 2012\n\nAbstract\nRandom Overlap Structures (ROSt's) are random elements on the space of probability measures on the unit ball of a Hilbert space, where two measures are identified\nif they differ by an isometry. In spin glasses, they arise as natural limits of Gibbs measures under the appropriate algebra of functions. We prove that the so called 'cavity\nmapping' on the space of ROSt's is continuous, leading to a proof of the stochastic stability conjecture for the limiting Gibbs measures of a large class of spin glass models.\nSimilar arguments yield the proofs of a number of other properties of ROSt's that may\nbe useful in future attempts at proving the ultrametricity conjecture. Lastly, assuming that the ultrametricity conjecture holds, the setup yields a constructive proof of\nthe Parisi formula for the free energy of the Sherrington-Kirkpatrick model by making\nrigorous a heuristic of Aizenman, Sims and Starr.\n\n1\n\nIntroduction\n\nThis paper develops some connections between random probability measures on Hilbert\nspaces and the Gibbs measures of spin glasses with Gaussian disorder. Consider for N ∈ N\nrandom processes of the form\nHN := (HN (σ), σ ∈ {−1, +1}N ) ,\n∗\n\nL.-P. Arguin held a postdoctoral position at Courant Institute during this work. He was supported by\nthe NSF grant DMS-0604869 and partially by the Hausdorff Center for Mathematics, Bonn.\n†\nSourav Chatterjee's research was partially supported by NSF grants DMS-0707054 and DMS-1005312,\nand a Sloan Research Fellowship\n\n1\n\n\fwhere HN (σ) is a centered Gaussian variable. Denote the law of HN by P and the corresponding expectation by E. Suppose that the covariances between variables are of the\nform\nE HN (σ)HN (σ ′ ) = Nr(σ, σ ′ )\nfor some positive definite symmetric form r on {−1, +1}N with r(σ, σ) = 1 for all σ. We\nsay that HN is the Hamiltonian of a Gaussian spin glass. An important example is the\nSherrington-Kirkpatrick (SK) model for which\n′\n\nr(σ, σ ) =\n\nN\n1 X\nσi σi′\nN i=1\n\n!2\n\n.\n\nThe definition also includes the Edwards-Anderson (EA) model. This model can be defined\nfor example in a box of Zd with N vertices and edge set EN . The form for the EA model is\nthen\nX\n1\nσi σj σi′ σj′ .\nr(σ, σ ′ ) =\n|EN |\n{i,j}∈EN\n\nThe Gibbs measure corresponding to the Hamiltonian HN at inverse temperature β is defined\nby\nexp βHN (σ)\n(1.1)\nGβ,N (σ) =\nZN (β)\nP\nwhere ZN (β) = σ exp βHN (σ). A fundamental problem in the theory of spin glasses is to\ndescribe the limits of Gβ,N as N tends to infinity. This information is useful in particular\nto understand the extreme value statistics of the Gaussian process HN . In the past ten\nyears, the rigorous study of spin glasses has made important progresses in the understanding\nof the models in the limit N → ∞. One of the major achievements was the proof of\nthe Parisi formula by Guerra and Talagrand [15, 30] for the limiting free energy (that is,\nlimN →∞ N1 E log ZN (β)) of the SK model. The formula suggests that the limiting Gibbs\nmeasure Gβ of the SK model (in a suitable sense) has a support that is hierarchical or\nultrametric, that is with P -probability one\nn\no\nGβ⊗3 (σ, σ ′ , σ ′′ ) : r(σ, σ ′ ) ≥ min {r(σ, σ ′′ ), r(σ ′ , σ ′′ )} = 1 .\n\nIn fact, it is expected that the ultrametricity of the Gibbs measure is universal to a certain\nextent within spin glasses. This hypothesis is at the core of the description of spin glasses\ndeveloped by physicists, and often referred to as Parisi theory [19]. In spite of important\nadvances in the understanding of the structure of the Gibbs measure [23, 5], the problem of\nrigorously characterizing the limiting Gibbs measures of spin glasses remains open.\nThis paper takes the approach introduced by Aizenman, Sims and Starr [3] and extended\nin [7] to study the limiting Gibbs measures of spin glasses. The idea goes as follows. Given\nan infinite-dimensional separable Hilbert space H with inner product \"*\", there exists an\nembedding of the hypercube {−1, 1}N in H that preserves the form r, that is, if σ 7→ v(σ) ∈\nH then\nr(σ, σ ′ ) = v(σ) * v(σ ′ ) .\n2\n\n\fFor example, for the SK model with N sites, the Hilbert space H can be taken to be the L2\nspace of some abstract probability space (Ω, F , P), and the map v defined as\nv(σ) =\n\nN\n1 X\ngij σi σj ,\nN i,j=1\n\nwhere gij : Ω → R are independent standard Gaussian random variables under P.\nUnder such an embedding, the Gibbs measure is naturally sent to the random probability\nmeasure on H assigning weight Gβ,N (σ) to the corresponding vector v(σ). Of course, there\nis more than one such isometric embedding. Since the products v * v ′ determine the vectors\nup to a choice of basis for H, it is necessary to identify the probability measures on H that\ndiffer by an isometry for the image measure of Gβ,N to be well-defined. It turns out that the\nproper way to study such measures is through the notion of a Random Overlap Structure\nor ROSt. A ROSt is a N × N random covariance matrix whose law is invariant under\nsimultaneous finite permutations of rows and columns. In the spin glass setting, the ROSt is\nthe matrix Qβ,N = {r(σ k , σ l )}k,l∈N where (σ k , k ∈ N) are sampled independently from Gβ,N .\nThe space of ROSt's is compact in the appropriate topology and it is in correspondence, up\nto isometry, with the space of random probability measures on H (see Section 1.1). Thus\none way to study the limiting Gibbs measures of spin glasses is to describe the limit points\nof the sequence (Qβ,N ) in the space of ROSt's. (Another promising approach is through the\nGhirlanda-Guerra (GG) identities [16, 23, 31]. Although the GG identity approach is not\nthe focus of this article, it seems to be closely connected to the ROSt approach at some\nlevel.)\nThe main result of this paper is to establish that the limiting Gibbs measures (in the\nROSt sense) of any Gaussian spin glass as defined above is stochastically stable. What this\nmeans is that the ROSt's for Gaussian spin glasses are distributionally invariant under a\nbuilt-in stochastic mapping that we call the cavity mapping. (The mapping is well-known,\nbut the nomenclature is ours. Precise definition is given below.) The transformation derives\nits name and structure from the cavity method introduced in [20] (see also [11] for the\ndefinition of the mapping for Ruelle Probability Cascades). It has the features of a basic\nstochastic object akin to the mappings studied by Kahane in the context of multiplicative\nchaos [18]. Similar mappings have been considered earlier in the setting of competing particle\nsystems (see e.g. [28, 5]).\nIt was suggested by the work of several authors that the Gibbs measures of spin glasses\nmust be stochastically stable [2, 3, 28, 5]. Such a statement, however, can be made precise only in the infinite-dimensional setting. One missing ingredient to make the assertion\nrigorous at the level of ROSt's was a proof of the continuity of the cavity mapping. This\nis done in Theorem 1.4. Combining this with some further ingredients, it follows that the\nlimiting Gibbs measure of a Gaussian spin glass is stochastically stable at any β where the\nfree energy is differentiable (by convexity, this holds for almost all β).\nThe characterization of stochastically stable ROSt's is a challenging problem. In view of\nthe main result of this paper, it is also a rewarding one since it provides a way to establish\nuniversal properties of the Gibbs measures of spin glasses, in particular the alleged ultrametricity. We formulate below a precise conjecture, which may be called the Ultrametricity\nConjecture for ROSt's: a ROSt that is stochastically stable (in a strong sense to be defined)\n3\n\n\fmust have ultrametric support. Some partial results towards the resolution of this conjecture\nare given in Section 4. The most important one might be Theorem 1.7 which states that the\nsupport of a stochastically stable ROSt is either one vector or lies in an infinite-dimensional\nsubspace almost surely.\nThe framework of ROSt's has other interesting consequences for spin glasses. In particular, assuming that the ultrametricity conjecture for ROSt's is true, we give a constructive\nproof of the Parisi formula for the free energy of the Sherrington-Kirkpatrick model. This\nmakes rigorous the approach suggested by Aizenman, Sims and Starr [3] to prove the Parisi\nformula.\nWe remark that results similar to ours have been proved in parallel by Panchenko [26].\nThe work focuses on mean-field spin glass models where the law of the Hamiltonian is\ninvariant under permutation of spins, such as the SK model. In this case, a representation\ntheorem for exchangeable arrays (the Aldous-Hoover theorem) can be used. In the ROSt\nsetting, we appeal to the Dovbysh-Sudakov theorem (Theorem 1.2 below). A continuity\nresult is proved and a representation for the Parisi formula, similar to the one obtained here\nfor ROSt's, is found\nThe paper is organized as follows. The framework of ROSt's as well as the precise\nstatements of the main results are given in Section 1.1. The applications of the framework\nto spin glasses are presented in Section 1.2. The continuity of the cavity mapping is proved in\nSection 2. Section 3 derives the Parisi formula from the Ultrametricity Conjecture. Finally,\nsome interesting properties of stochastically stable ROSt's are proved in Section 4.\nAcknowledgments. We thank the referee for insightful remarks and observations that\nled to major improvements of the first version of this paper.\n\n1.1\n\nRandom Overlap Structures and Probability Measures on Hilbert\nSpaces\n\nThis section begins with the definition of random overlap structures using exchangeable\ncovariance matrices. The definition is then explained in terms of probability measures on\nHilbert spaces using the representation theorem of Dovbysh and Sudakov [14]. This setup\nwas previously described in [7]. The section ends with the definition of the cavity mapping\nand the statement of several related results.\nConsider the space of positive semi-definite symmetric N × N matrices, or covariance\nmatrices, with 1 on the diagonal. This is a compact separable metric space when considered\nas a closed subset of [−1, 1]N×N equipped with the product topology. The Borel probability\nmeasures on this space form also a compact, separable and metric space when equipped with\nthe weak-∗ topology generated by the continuous functions on the entries. An element P of\nthis space is the law of some random covariance matrix Q = {qij }. The continuous functionals\nin the topology considered can be approximated by linear combinations of monomials of the\nform\nY k\nP 7→ E\nqijij ,\n(1.2)\n1≤i<j≤s\n\nfor s ∈ N and a collection kij ∈ N. A random covariance matrix Q is said to be weakly\n\n4\n\n\fexchangeable if for any permutation matrix τ that fixes all but a finite number of elements\nlaw\nτ Q τ −1 = Q ,\nlaw\nwhere = denotes equality in law. Since this symmetry is preserved under convergence\ndefined by the functions (1.2), the space of distributions of weakly exchangeable random\ncovariance matrices with 1 on the diagonal is a compact convex set. Throughout the paper,\nwe refer to this subset of laws as the space of ROSt's.\nDefinition 1.1. A random overlap structure, or ROSt, is a weakly exchangeable N × N\nrandom covariance matrix with 1 on the diagonal. The law of a ROSt will be usually denoted\nby P and integration with respect to P by E.\nSince the law of a ROSt is determined by the countable set of functions of the form (1.2),\nit is convenient to see these as the coordinates of the ROSt.\nThe relation between ROSt's and probability measures on Hilbert spaces is provided by\nthe representation theorem of Dovbysh and Sudakov [14] (see [25] for a readable proof of this\nresult). Let B be the unit ball of an infinite-dimensional separable Hilbert space H (fixed\nthroughout this paper). The inner product on H will be denoted by * and a generic element\nof B by v. The set of Borel probability measures on B is denoted by M(B). Note that M(B)\nis the same whether B is equipped with the weak topology or the norm topology. From any\nelement of M(B), one can construct a ROSt by taking iid vectors sampled from this element\nand considering the Gram matrix of these vectors. The Dovbysh-Sudakov theorem states\nthat any weakly exchangeable random covariance matrix can be constructed this way if one\nconsiders random elements of M(B). In the case where the diagonal entries of the matrices\nare all 1, the Dovbysh-Sudakov theorem reads:\nTheorem 1.2. Let Q = {qij } be a ROSt. There exists a random element μ of M(B) such\nthat conditionally on μ,\nlaw\n(qij )i6=j = (v i * v j )i6=j ,\nwhere (v i , i ∈ N) are iid μ-distributed vectors in B.\n\nWe refer to the measure μ as the sampling measure of the ROSt Q in this article. It plays\na role analogous to the empirical measure in de Finetti's theorem. The law of Q does not\ndetermine the sampling measure uniquely. However, there is a one-to-one correspondence\nbetween ROSt's and random elements of M(B) if the elements of M(B) that differ by an\nisometry are identified. The reader is referred to [25] for a proof.\nProposition 1.3. Let Q and Q′ be two ROSt's with sampling measures μ and μ′ . Then\nlaw\nQ = Q′ if and only if there an isometry T of B (possibly dependent on the realization of μ)\nlaw\nsuch that μ(A) = μ′ (T −1 A) for any A ⊂ B Borel measurable.\nWe write v = (v 1 , ..., v s ) for an element of Bs and μ⊗s for the product measure of s\ncopies of μ. Here s is an arbitrary positive integer. Each sampled vector is called a replica.\nThroughout the paper, expectation of a function F : Bs → R with respect to μ⊗s will often\n5\n\n\fbe written μ⊗s (F ) for short. In this notation, the continuous functionals (1.2) for ROSt's\nare all of the form\n\u0002\n\u0003\nP 7→ E μ⊗s (F (v)) .\n(1.3)\n\nwhere F : Bs → R is a continuous function on s replicas, that is, a continuous function that\ndepends only on the inner product between s distinct vectors:\nF (v) = F (v k * v l ; 1 ≤ k < l ≤ s) .\n\nThe central topic of interest in this article is a class of ROSt's that possess an invariance\nproperty called stochastic stability. This is defined as follows.\nLet P be a ROSt. Let Pl be the law of a collection of independent standard Gaussian\nrandom variables (li , i ∈ N), defined on the same probability space as P and independent of\nit. Let El denote integration\nP with respect to Pl . For each v ∈ B, we consider the Gaussian\nrandom variable l(v) = i∈N li v * ei , where (ei , i ∈ N) is a fixed orthonormal basis of H.\nThe covariance of l(v) and l(v ′ ) is given by\nEl [l(v)l(v ′ )] = v * v ′ .\nThe Gaussian process l = (l(v), v ∈ B)Pindexed by B is called the cavity field in this article.\nNote that the function v 7→ l(v) = i∈N li v * ei on B is measurable Pl -almost surely being\nthe pointwise limit of weakly continuous functions. Moreover, because EEl [μ(l(v)2 )] ≤ 1 by\nFubini's theorem, for any law of ROSt P there exists a set of realizations of l of Pl -probability\none such that l(v) is well-defined for μ-almost all v and for P-almost all μ.\nWe now define the cavity mapping from the space of ROSt's to itself. The mapping is\ndefined on the sampling measure. Let λ > 0 be a parameter, P be the law of a ROSt with\nsampling measure μ, and l be a cavity field independent of P, we take:\nΦλ,l : μ 7→ Φλ,l μ :=\n\neλl(v)−\n\nλ2\n2\n\nkvk2\n2\n\nμ(dv)\n\nλl(v)− λ2 kvk2\n\nμ(e\n\n)\n\n.\n\n(1.4)\n\nThe image ROSt is constructed using Φλ,l μ as sampling measure. Its law is induced by\nλ2\n\n2\n\nP × Pl . We stress that the factor e 2 kvk is the expectation of eλl(v) , and its presence turns\nout to be crucial for the continuity of the mapping. The cavity mapping can also be defined\nin terms of the continuous functions (1.3) since they determine the law of the ROSt:\n#\n\"\nλ2\nλ2\n1 2\ns\ns 2\n1\nμ⊗s (F (v)eλl(v )− 2 kv k ...eλl(v )− 2 kv k )\n⊗s\n⊗s\nE[μ (F (v))] 7→ E[(Φλ,l μ) (F (v))] = EEl\n.\nλ2\nλ2\n1 2\ns\ns 2\n1\nμ⊗s (eλl(v )− 2 kv k ...eλl(v )− 2 kv k )\nIt will be a consequence of Theorem 1.4 that the cavity mapping is well-defined, that is,\nthe image ROSt is the same if we apply (1.4) to two random elements of M(B) that are\nsampling measures of the same ROSt.\nWe remark that this mapping can be generalized in at least two ways. First, for any\n√ funcψ(l(v)+z 1−kvk2 )\n1\n],\ntion ψ ∈ C (R) with bounded derivative, we can take the change of density Ez [e\nwhere z is a standard Gaussian with expectation Ez . Second, one could consider the cavity\nfield lc with El [lc (v)lc (v ′ )] = c(v * v ′ ) for some continuous function c satisfying\nc(1) = 1 (v, v ′ ) 7→ c(v * v ′ ) is positive definite .\n6\n\n(1.5)\n\n\fWe will often write lp corresponding to the choice c(v *v ′ ) = (v *v ′ )p for p ∈ N∪{0}. Equation\n(1.4) is the particular case ψ(x) = λx and c(x) = x. The generalized mapping takes the\nform\n√\n2\nEz [eψ(lc (v)+z 1−c(kvk )) ] μ(dv)\n√\n.\n(1.6)\nΦψ,lc : μ 7→ Φψ,lc μ :=\nψ(lc (v)+z 1−c(kvk2 ))\n])\nμ(Ez [e\nThe first result of this paper, from which all others essentially stem, is proved in Section\n2.\nTheorem 1.4. The mapping from the space of ROSt's to itself defined by (1.6) is continuous.\nWe are interested in ROSt's whose law is invariant under the cavity mapping (1.6). This\nis equivalent to say by Proposition 1.3 that the sampling measure μ has the same law as\nΦψ,lc μ, up to an isometry of B. One direct consequence of the continuity is that the set of\ninvariant laws under a family of cavity mappings is compact in the space of laws of ROSt's\n(see Corollary 4.1), a simple fact that will turn out to be useful, for example in the proof of\nthe Parisi formula (see Corollary 3.7). Our focus is on ROSt's whose law is invariant under\nthe cavity mapping for linear functions ψ.\nDefinition 1.5. A ROSt of law P is called stochastically stable if, for any λ > 0, its law is\ninvariant under the cavity mapping (1.4). In other words, for any s ∈ N and any continuous\nfunction F on s replicas\nE[μ⊗s (F (v))] = E[(Φλ,l μ)⊗s (F (v))] .\nIt is called stochastically stable for the cavity field lc if the above holds with l replaced by the\ncavity field lc with covariance El [lc (v)lc (v ′ )] = c(v * v ′ ).\nAs we shall explain in the next section, continuity provides the missing link between\nthe stochastic stability as defined here and stochastic stability of the Gibbs measure of\nspin glasses as studied in [2, 13, 31]. This link provides a statement of the ultrametricity\nconjecture on the characterization of stochastically stable ROSt's.\nConjecture 1 (Ultrametricity Conjecture). If a ROSt of law P is stochastically stable for\nthe cavity fields lp (defined below (1.6)) for p = 1 and infinitely many p, then the support of\nits sampling measure μ is ultrametric P-a.s., that is:\nv * v ′ ≥ min {v * v ′′ , v ′ * v ′′ } for μ⊗3 -almost all v, v ′ , v ′′ .\nMoreover, the law of the sampling measure is a convex combination of Ruelle Probability\nCascades.\nRuelle Probability Cascades (RPC's) form a compact subset of ROSt's parametrized by\nthe right-continuous, increasing functions on [0, 1] with values 0 at 0 and 1 at 1 (we refer\nto [7] for a proof of the compactness). They have ultrametric support and they are known\nto be stochastically stable for any cavity field lp , p ∈ N. We shall not need their precise\ndefinition here. The reader is referred to [27, 11, 5] for more details. It is very likely that\nthe hypotheses of the conjecture can be relaxed. However, it does not hold if stochastic\nstability for a single cavity field is assumed. A simple counterexample is given at the end\n7\n\n\fof Section 4. The conjecture was proved in the case where the support of μ⊗2 is finite in\n[5] (see also [21] for an extension of that proof). In this case, μ is supported on countable\nvectors and the conjecture can be formulated in the language of competing particle systems.\nA similar statement of the ultrametricity conjecture exists where the assumption of stability\nis replaced with the extended Ghirlanda-Guerra identities:\nDefinition 1.6. A ROSt with sampling measure μ is said to satisfy the Ghirlanda-Guerra\n(GG) Identities if for any s ∈ N and any continuous function F on s replicas we have\nE[μ⊗s+1 (v 1 * v s+1F (v))]\n\ns\n\n1\n1X\n= E[μ⊗2 (v 1 * v 2 )] E[μ⊗s (F (v))] +\nE[μ⊗s (v 1 * v l F (v))] .\ns\ns\nl=2\n\nIt is said to satisfy the extended Ghirlanda-Guerra identities if the above holds when the\nproducts v i * v j in the expectations is replaced by (v i * v j )p for any p ∈ N.\nA version of the ultrametricity conjecture assuming finiteness of the support of the overlap\ndistribution and the extended Ghirlanda-Guerra identities was proved by Panchenko in the\ncase where μ⊗2 has finite support [23]. (The assumptions are slightly different from the\nones used in the proof of the conjecture using stochastic stability in [5] where stability for\ninfinitely many p's in N, but not all p, is needed. However, it is possible that the two sets\nof hypotheses are equivalent in the special case where the support is finite.) We also stress\nthat ultrametricity has been proved for generalized versions of GREM spin glass models by\nBolthausen and Kistler [9, 10].\nThe continuity of the cavity mapping has interesting consequences that we discuss in\nSection 4. For one, it provides an ergodic decomposition of stochastically stable ROSt's.\nThe Ultrametricity Conjecture can then be restated by saying that the extremes of the\nconsidered set of stochastically stable ROSt's are exactly the RPC's. The decomposition is\nuseful to prove properties of the support of the sampling measure. We stress that invariance\nunder a single cavity mapping is sufficient here.\nTheorem 1.7. Let P be the law of a ROSt that is invariant under the cavity mapping Φλ,l\nfor a given λ > 0. Let μ be its sampling measure. Then μ is supported on a single vector or\non an infinite-dimensional subset of B.\nIf invariance under more fields is assumed, we can prove more.\nTheorem 1.8. Let P be the law of a ROSt that is invariant under the cavity mapping Φλ,lp\nfor a given λ > 0 and for infinitely many p ∈ N. Let μ be its sampling measure and suppose\n2\nthat μ⊗2 {(v, v ′) ∈ B2 : |v * v ′ | = rmax\n(μ)} > 0 on a set of positive P-probability, where\nrmax (μ) = sup{0 ≤ r ≤ 1 : μ{kvk ≥ r} > 0}. Then,\nμ{v ∈ B : kvk = rmax (μ)} = 1 P-a.s.\nIn other words, μ is almost surely supported on a sphere.\nThis last property does not hold in general if stability is assumed for a single cavity field.\nA counter-example is given in Section 4.\n8\n\n\fProperties of the sampling measure for ROSt's satisfying the extended Ghirlanda-Guerra\nidentities have been obtained in [23]. The apparent similarities of the properties of the ROSt's\nsatisfying the Ghirlanda-Guerra identities and stochastic stability motivate the following\nquestion: are the Ghirlanda-Guerra identities and stochastic stability two representations\nof the same property ? Since the set of stochastic stable ROSt's is closed under convex\ncombinations and not the set of ROSt's satisfying GG, we conjecture the following:\nConjecture 2. The laws of the ROSt's satisfying the Ghirlanda-Guerra identities correspond\nto the extremes of the convex set of laws of the stochastically stable ROSt's.\n\n1.2\n\nApplication to Spin Glasses\n\nConsider a Gaussian spin glass Hamiltonian HN and its Gibbs measures Gβ,N at β as defined\nin the introduction. It is straightforward to construct a ROSt Qβ,N from Gβ,N by taking\nQβ,N = { r(σ i , σ j ) }i,j∈N\nwhere (σ i )i∈N are elements of {−1, +1}N sampled iid from Gβ,N . Here the form \"r\" is the\none of the given spin glass model, but the same construction holds for any positive definite\nsymmetric form on {−1, +1}N . Note that the randomness of Qβ,N comes from the sampling\nand the randomness of Gβ,N itself.\nThe considerations of the previous sections ensure that the random matrix Qβ,N can be\nconstructed from a random sampling measure μβ,N on B. In particular, for any function F\non s replicas there is the identity\n⊗s\nk\nl\nE Gβ,N\n(F (r(σ k , σ l ); 1 ≤ k < l ≤ s)) = E μ⊗s\nβ,N (F (v * v ; 1 ≤ k < l ≤ s)) .\n\n(1.7)\n\nThe sequence (Qβ,N ) in the space of ROSt's has limit points, since the space is compact.\nThese limits should retain in some ways the Gibbsian nature of Gβ,N . Two properties of\nthe limit points seem to be of importance: the Ghirlanda-Guerra identities as presented\nearlier and the stochastic stability for the sequence of sampling measure (μβ,N ). Stochastic\nstability for the sequence defined below does not directly translate into stochastic stability\nas presented earlier of the limit ROSt. As we shall see, Theorem 1.4 fills this gap.\nStochastic stability was first introduced in [2] and originally defined as follows. Let (Gβ,N )\nbe a sequence of Gibbs measures at inverse temperature β. Consider similarly as before the\nGaussian field (l(σ) : σ ∈ {−1, +1}N ) independent of HN , whose law we again denote by\nEl , with covariance El [l(σ)l(σ ′ )] = r(σ, σ ′ ). For some λ > 0, we consider the mapping (1.4).\nSince here kσk = 1 for any vector in the support, it reduces to\nGβ,N (σ) 7→\n\nGβ,N (σ)eλl(σ)\n.\nGβ,N (eλl(σ) )\n\n(1.8)\n\nIt is readily checked by property ofpGaussians that the image in (1.8) has the same law as\nthe Gibbs measure at temperature β 2 + λ2 /N. The original idea of [2] is that a continuous\ndependence on β of the Gibbs measure is equivalent in the limit N → ∞ to stability of the\nmeasure under the mapping (1.8).\n9\n\n\fDefinition 1.9. A sequence of Gibbs measures (GN ) is said to be stochastically stable if for\nany λ > 0, s ∈ N and for any continuous function F on s replicas,\n\"\n#\n1\ns\n⊗s\nGN\n(F (σ)eλl(σ ) ...eλl(σ ) )\n⊗s\nlim EEl\n− EGN\n(F (σ)) = 0 ,\n⊗s λl(σ1 )\nN →∞\nGN\n(e\n...eλl(σs ) )\nwhere F (σ) stands for F (r(σ l , σ k ); 1 ≤ k < l ≤ s).\nIt was shown in [13] that stochastic stability in the sense of Definition 1.9 holds on\naverage over β. An improvement was made in [31] where it is proved that for any β and\nsequence of Gibbs measures (Gβ,N ) there exists a sequence βN → β such that the sequence\n(GβN ,N ) is stochastically stable. We show here that stochastic stability holds at any β where\nlimN →∞ N1 E log ZN (β) is differentiable. This is an analogue of an elegant result of Panchenko\n[24] which proves the validity of the Ghirlanda-Guerra identities under the same hypothesis.\nProposition 1.10. If limN →∞ N1 E log ZN (β) exists and is differentiable at β > 0, then the\nsequence of Gibbs measures (Gβ,N ) is stochastically stable in the sense of Definition 1.9.\nProof. Let F be a continuous function on s replicas. We must have |F | ≤ C for some C > 0.\nStraightforward differentiation yields\nh\u0010\ni\n\u0001\u0001\n⊗s\n⊗s\nHN (σ 1 ) − Gβ,N HN (σ) F (σ) .\n∂β EGβ,N\n(F (σ)) = s EGβ,N\nHence the absolute value of the derivative is bounded by\n\nsC EGβ,N HN (σ 1 ) − Gβ,N HN (σ)\nDefine β(λ) :=\n\n\u0001\n\n.\n\np\nβ 2 + λ2 /N. By integration, we have the bound\n\n\u0001\n\u0001\n⊗s\n⊗s\nEGβ(λ),N\nF (σ)\nF (σ) − EGβ,N\n\n≤ sC\n\nZ\n\nβ(λ)\n\nEGβ ′ ,N |HN (σ) − Gβ ′ ,N (HN (σ))| dβ ′ . (1.9)\n\nβ\n\nIt remains to show that the integral goes to zero under the assumption. We have by CauchySchwarz inequality\nZ β(λ)\nEGβ ′ ,N |HN (σ) − Gβ ′ ,N (HN (σ))| dβ ′\nβ\n\n≤ N 1/2 β(λ) − β\n2\n\n\u00011/2\n\nZ\n\nβ\n\nβ(λ)\n\n1\nEGβ ′ ,N |HN (σ) − Gβ ′ ,N (HN (σ))|2 dβ ′\nN\n\n!1/2\n\n.\n\nλ\nSince β(λ) − β = 2βN\n+ O( N12 ), stochastic stability in the sense of Definition 1.9 would follow\nby equation (1.9) if the term in the parentheses divided by N goes to zero as N → ∞. Define\nfN (β) := N1 E log ZN (β). fN is famously convex. It is easily checked by differentiation that\nthe integral to bound is exactly\nfN′ (β(λ)) − fN′ (β).\n\nSince β(λ) → β, the above goes to zero by a simple result of convexity (see Lemma 3.6) as\nwell as the assumptions on the existence of the limit and the derivative at β.\n10\n\n\fA direct consequence of Theorem 1.4 is that stochastic stability as a property of the\nsequence becomes a property of the limit points.\nCorollary 1.11. If limN →∞ N1 E log ZN (β) exists and is differentiable at β > 0, then the\nlimit points in the space of ROSt's of the sequence (Qβ,N ) are stochastically stable in the\nsense of Definition 1.5.\nAnother notable application of the continuity of the cavity mapping is a proof that\nthe Parisi functionals, entering in the Parisi formula of the SK model, are continuous as\nfunctionals on ROSt's. This is proved in Section 2.2 and can be seen as a generalization\nof a theorem of Guerra that proved the continuity within the subset of Ruelle Probability\nCascades [15, 4]. Assuming that the Ultrametricity Conjecture holds, this fact, together\nwith Guerra's bound and Corollary 1.11, provides a proof of the Parisi formula for the SK\nmodel (and more generally, for mixed p-spin models with even p's). This is done in Section\n3.\n\n2\n2.1\n\nThe Cavity Mapping\nContinuity\n\nIn this section, we prove the continuity of the mapping (1.4). Let ψ be a function in C 1 (R)\nwith bounded derivative, |ψ ′ | ≤ C for some C > 0. Assume without loss of generality that\nψ(0) = 0. Let z a standard Gaussian variable with law Pz and expectation Ez . Note that,\nunder these assumptions, |ψ(z)| ≤ C|z|, and in particular Ez [emψ(z) ] < ∞ for any m ∈ R.\nDefine\n√\n2\n(2.1)\nG(v, z, l) := eψ(l(v)+z 1−kvk ) .\nIn the cases ψ(x) = x and ψ(x) = log cosh x, we have the simplification\n1\n\n2)\n\nEz G(v, z, l) = eψ(l(v)) e 2 (1−kvk\n\n.\n\nWhen dealing with s replicas, that is v = (v 1 , ..., v s ) ∈ Bs and z = (z 1 , ..., z s ) where z has\nlaw Pz⊗s , write\ns\nY\nG(v, z, l) :=\nG(v i , z i , l) .\n(2.2)\ni=1\n\nConsider the generalized cavity mapping (1.6):\nμ 7→ Φψ,l μ :=\n\nμ(dv) Ez G(v, z, l)\n,\nμ(Ez G(v, z, l))\n\n(2.3)\n\nwhere l(v) is the cavity field with covariance v * v ′ . The proof of the continuity is the same\nwhen the covariance of the field is c(v *v ′ ), for a suitable function c, if kvk2 in the definition of\nG is replaced by c(kvk2 ). We restrict ourselves to the case where c is the identity to simplify\nnotation.\nConsider a function F = F (v, z, l) that depends measurably on s replicas, the Gaussian vector z and the cavity field. The main ingredient of the proof of continuity is an\napproximation in the spirit of the weak law of large numbers.\n11\n\n\fLemma 2.1. Let μ ∈ M(B). Let F (v, z, l) be a function such that v 7→ El Ez⊗s [F (v, z, l)2 ]\nis a continuous function on s replicas. Let (v r , z r ), r = 1, ..., n, be n independent copies of\n(v, z) sampled from (μ × Pz )⊗s . Then\n!\nn\n\u0010\n\u0011 2 C\nX\n1\nF (v r , z r , l) − (μ × Ez )⊗s F (v, z, l)\n≤\nEl (μ × Ez )⊗ns\nn r=1\nn\nwhere C is a positive constant that depends on F but not on μ.\nProof. Using the fact that under (μ × Ez )⊗ns , the variables F (vr , z r , l), r = 1, ..., n are i.i.d.,\nwe have\n!\nn\n\u0010\n\u0011 2\nX\n1\n(μ × Ez )⊗ns\nF (v r , z r , l) − (μ × Ez )⊗s F (v, z, l)\nn r=1\n\u0011 1\u0010\n\u0010\n\u0001\u00112\n1\n= (μ × Ez )⊗s F (v, z, l)2 −\n(μ × Ez )⊗s F (v, z)\nn\nn\n\u0011\n\u0010\n1\n≤ (μ × Ez )⊗s F (v, z, l)2 .\nn\nNow integrate over the l's on both sides and use Fubini's theorem on the right-hand-side.\nBy assumption, v 7→ El Ez⊗s [F (v, z, l)2 ] is a bounded function on Bs . The conclusion follows\nfrom this.\nIt will be useful to impose stronger\nconditions on F (v, z, l), namely that F (v, z, l) is a\np\ni\ni\nfunction of the variables l(v ) + z 1 − kv i k2 , i = 1, ..., s:\np\n(2.4)\nF (v, z, l) = F (l(v i ) + z i 1 − kv i k2 , i = 1, ..., s) ;\n\nand that for any m ∈ R,\n\nv 7→ El Ez⊗s [F (v, z, l)m ] is a continuous function on s replicas.\n\n(2.5)\n\nLemma 2.2. The function G(v, z, l) satisfies (2.4) and (2.5).\np\nProof. The dependence in G is uniquely on the Gaussian variables l(v i ) + z i 1 − kvk2 ,\ni = 1, ..., s. These variables have variance 1 and covariance v i * v j , i 6= j. Therefore the\nfunction v = (v 1 , ..., v s ) 7→ El Ez⊗s [G(v, z, l)m ] depends only on the inner products between\ndistinct replicas v 1 ,...,v s . By writing down the Gaussian integral El Ez⊗s explicitly, we see\nthat to prove it is continuous on Bs it suffices to show that, for any m ∈ R, the function\nv 7→ El Ez⊗s [G(v, z, l)m ] is bounded uniformly in v. By Hölder's inequality,\n#\n\" s\ns\nY\nY\n\b\n1/s\n= Ez [esmψ(z) ] < ∞,\nEl Ez⊗s\nG(v i , z i , l)m ≤\nEl Ez i [G(v i , z i , l)ms ]\ni=1\n\ni=1\n\nwhich shows the desired uniform bound.\nTheorem 1.4 is a straightforward consequence of the following result with F (v, z, l) =\nF (v). The idea of the proof is to linearize functions involving the measure μ × Ez using the\nempirical approximation of Lemma 2.1.\n12\n\n\fTheorem 2.3. Let F (v, z, l) be a function satisfying (2.4) and (2.5) and let G(v, z, l) be as\nin (2.2). Then the mapping\n\u0010\n\u0011\n\n(μ × Ez )⊗s F (v, z, l)G(v, z, l)\n\n\u0010\n\u0011\nP 7→ EEl \n(2.6)\n⊗s\n(μ × Ez )\nG(v, z, l)\n\nis a continuous functional on the space of ROSt's.\n\nProof. We rearrange the image of the mapping,\n\u0010\n\u0011\n\n(μ × Ez )⊗s F (v, z, l)G(v, z, l)\n=\n\u0010\n\u0011\nEEl \n⊗s\nG(v, z, l)\n(μ × Ez )\n\u0014 1 Pn\n\u0015\nr\nr\nr\nr\nr=1 F (v , z , l)G(v , z , l) + dμ (F G)\n⊗ns n\nPn\nEEl (μ × Ez )\n1\nr\nr\nr=1 G(v , z , l) + dμ (G)\nn\n\n(2.7)\n\nwhere\n\nn\n\u0010\n\u0011 1X\ndμ (F G) := (μ × Ez )\nF (v, z, l)G(v, z, l) −\nF (v r , z r , l)G(v r , z r , l)\nn r=1\nn\n\u0010\n\u0011 1X\nG(v r , z r , l) .\ndμ (G) := (μ × Ez )⊗s G(v, z, l) −\nn r=1\n⊗s\n\nWe introduce the empirical average of f as a function on the n copies (v r , z r )nr=1 and the\ncavity field\nPn\n1\nr\nr\nr\nr\nr=1 F (v , z , l)G(v , z , l)\nr\nr\nn\nP\n.\n(2.8)\nF̃ ((v , z )r ; l) :=\nn\n1\nr\nr\nr=1 G(v , z , l)\nn\nIn this notation, elementary manipulations of (2.7) give\n\u0010\n\u0011\n\n\u0010\n\u0011\n(μ × Ez )⊗s F (v, z, l)G(v, z, l)\n − EEl (μ × Ez )⊗ns F̃ ((v r , z r )r ; l)\n\u0010\n\u0011\nEEl \n(μ × Ez )⊗s G(v, z, l)\n\u0010\n\u0011\n\nr\nr\n⊗ns\ndμ (F G) − F̃ ((v , z )r ; l) dμ (G)\n(μ × Ez )\n .\n\u0010\n\u0011\n= EEl \n⊗s\nG(v, z, l)\n(μ × Ez )\n\n(2.9)\n\nWe now bound the absolute value of the difference appearing in the left-hand side of (2.9)\n√\n√\n2\nuniformly in the possible laws P. We write for simplicity γ = 2 and γ̄ = (1 − γ1 )−1 = √2−1\n.\nWe use Hölder's inequality followed by Jensen's inequality and Fubini's theorem to get the\nfollowing upper bound of the right-hand side:\nn\n\u0010\n\u0011o1/γ\nEμ⊗ns El Ez⊗ns |dμ (F G) − F̃ ((v r , z r )r ; l) dμ (G)|γ\nn\n\u0010\n\u0011o1/γ̄\n× Eμ⊗ns El Ez⊗ns [G(v, z, l)−γ̄ ]\n.\n13\n\n\fThe second term is bounded by a constant uniform in the laws P by Lemma 2.2. (Essentially,\nthe term with negative power −γ̄ is bounded because the Laplace functional of a Gaussian\nvariable is well-defined everywhere.) As for the first term, by the triangle inequality, it is\nsmaller than\n\u0011o1/γ\n\u0010\nn\nEμ⊗ns El Ez⊗ns |dμ (F G)|γ\n\u0011o1/γ\n\u0010\nn\n+ Eμ⊗ns El Ez⊗ns |F̃ ((v r , z r )r ; l) dμ (G)|γ\n.\n\nThe first term is bounded√by the same expression with γ replaced by 2. By Lemma 2.1,\nit is thus bounded by C/ n uniformly in P. The second term is bounded similarly after\nan application\nof Hölder's inequality\nwith γ. We note that, in this case, the resulting term\n\u0010\n\u0011\n⊗ns\n⊗ns\nr\nr\nγγ̄\nEμ\nEl Ez |F̃ ((v , z )r ; l)|\nis bounded uniformly in the P's since\nn\n\u0002\n\u0003 o1/3 \b\n\u0002\n\u0003\nEl Ez⊗ns [F̃ ((v r , z r )r ; l)γγ̄ ] ≤ El Ez⊗s F (v, z, l)3γγ̄\nEl Ez⊗s G(v, z, l)3γγ̄\nn\n\u0002\n\u0003 o1/3\n× El Ez⊗s G(v, z, l)−3γγ̄\n,\n\n1/3\n\n(2.10)\n\nwhere we have used Hölder's inequality and Jensen's inequality. The right-hand side is\nbounded because of (2.5) and Lemma 2.2. Putting all this together, we can write from (2.9)\nfor a possibly different C, not depending on P,\n\u0010\n\u0011\n\n\u0010\n\u0011\n(μ × Ez )⊗s F (v, z, l)G(v, z, l)\n − Eμ⊗ns El Ez⊗ns [F̃ ((v r , z r )r ; l)]\n\u0010\n\u0011\nEEl \n(μ × Ez )⊗s G(v, z, l)\nC\n≤√ .\nn\n\n(2.11)\n\nThe above approximation is useful because it is uniform in the laws P, and it linearizes the\ndependence on μ (allowing the use of Fubini's theorem to exchange the integration El and\nμ).\nIf E and E′ are two ROSt's with sampling measures μ and μ′ , we have by (2.11)\n\u0010\n\u0011\n\n(μ × Ez )⊗s F (v, z, l)G(v, z, l)\n\n\u0010\n\u0011\nEEl \n(μ × Ez )⊗s G(v, z, l)\n\u0010\n\u0011\n\n′\n⊗s\nF (v, z, l)G(v, z, l)\n(μ × Ez )\n\n\u0010\n\u0011\n−E′ El \n′\n⊗s\nG(v, z, l)\n(μ × Ez )\n\u0010\n\u0011\n\u0010\n\u0011\n≤ Eμ⊗ns El Ez⊗ns [F̃ ((v r , z r )r ; l)] − E′ μ′⊗ns El Ez⊗ns [F̃ ((v r , z r )r ; l)]\n2C\n+√ .\nn\n\nSince C is uniform in the choice of P, the continuity will follow if\n(v r )nr=1 7→ El Ez⊗ns [F̃ ((v r , z r )r ; l)]\n14\n\n\fis a continuous function on ns replicas. We have that\n\u0015\n\u0014 1 Pn\nr\nr\nr\nr\nr=1 F (v , z , l)G(v , z , l)\n⊗ns\nr\nr\n⊗ns n\nPn\n.\nEl Ez [F̃ ((v , z )r ; l)] = El Ez\n1\nr\nr\nr=1 G(v , z , l)\nn\np\nBut the integration is on the ns Gaussian variables of the form l(v) + z 1 − kvk2 that have\nvariance 1 and covariance v * v ′ . Therefore the expectation is a function on ns replicas,\nsince it depends only on the inner products between distinct replicas and not on their norm.\nIt is readily seen from writing the Gaussian integral that the continuity will follow if the\nexpectation is bounded as a function on Bns . But this is a consequence of (2.10) taking\nγγ̄ = 1.\nCompositions of cavity mappings take a simple form when ψ is linear. This will be needed\nin Section 4.\nLemma 2.4. Let λ, λ′ > 0, c be as in (1.5) and P be the law of a ROSt. If P′ is the image\nof P under Φλ,lc and P′′ is the image of P′ under Φλ′ ,lc′ , then P′′ is the image of P under\nΦ√λ2 +λ′2 ,lc . In particular, if P is invariant under Φλ,lc , then it is invariant under Φ√T λ,lc for\nany T ∈ N.\nProof. The second statement follows directly from the first. Let μ be the sampling measure\nof P. Then μ′ = Φλ,lc μ is the sampling measure of P′ . By the definition (1.6) of the mapping,\n′ ′\n\n′\n\nΦλ′ ,lc′ μ =\n\neλ lc (v)−\n\nλ′2\n2\n\n′ ′\n\nkvk2\n\nμ′ (eλ lc (v)−\n\nλ′2\n2\n\nμ′ (dv)\nkvk2\n\n)\n\n,\n\nand by the definition of μ′ ,\n′\n\nΦλ′ ,lc′ μ =\n\n′ ′\n\neλ lc (v)+λlc (v)−\n\nλ′2 +λ2\nkvk2\n2\n\nμ(dv)\n\n′2\n2\nλ′ lc′ (v)+λlc (v)− λ 2+λ kvk2\n\nμ(e\n\n.\n\n)\n\nlaw √\nThe claim follows from the fact that λ′ lc′ + λlc = λ′2 + λ2 lc .\n\n2.2\n\nThe Parisi Functionals\n\nTheorem 2.3 that proves the continuity of the cavity mapping also provides continuity for\nan important class of functionals on ROSt's, the so-called Parisi functionals. They enter in\nparticular in the Parisi formula for the free energy of the SK model.\nLet ψ ∈ C 1 (R) with bounded derivative and with ψ(0) = 0. Consider a cavity field lc\nwith covariance El [lc (v)lc (v ′ )] = c(v * v ′ ) for some function c as in (1.5). Define the Parisi\nfunctional for a ROSt P and parameters λ ≥ 0 as\nh\n\u0010\n\u0011i\n√\nψ(λlc (v)+λz 1−c(kvk2 ))\nP(λ, P) := E El log (μ × Ez ) e\n(2.12)\n\nwhere z is a standard Gaussian variable with expectation Ez . We drop the dependence on c\nand on ψ in the notation for simplicity. The cases where ψ(x) = log cosh x or ψ(x) = x, and\nX\n1 X 2 p\nλ2 =\nλ2p\nc(x) = 2\nλ x\nλ p≥0 p\np≥0\n15\n\n\fwill play an important role in Section 3. In these cases, the variable z can be integrated.\nThe functional (2.12) reduces to\nP(λ, P) :=\n\nh\n\u0010 P\n\u0011i\n1 P\nλ2\n2\n2p\n+ E El log μ eψ( p≥0 λp lp (v))− 2 p≥0 λp kvk\n,\n2\n\n(2.13)\n\nwhere λ = (λp )p≥0 and El is the expectation over independent cavity fields lp , p ∈ N ∪ {0}.\nThe dependence on each λp is emphasized here by writing P(λ, P) instead of P(λ, P).\nContinuity of the Parisi functional on the subset of Ruelle Probability Cascades has been\nestablished by Guerra [15]. In this case, the Parisi functionals equals f (0, 0), where f (q, y)\nis the solution of a p.d.e. with final condition f (1, y) = ψ(λy), see e.g. [3, 4] for details. It\nturns out that continuity properties of the Parisi functionals that are needed in the proof of\nthe Parisi formula can be established for the whole space of ROSt's.\nProposition 2.5. Let P(λ, P) be as in (2.12). Then, for any ψ ∈ C 1 (R) with bounded\nderivative and c as in (1.5),\n1. P 7→ P(λ, P) is a continuous functional on ROSt's for every λ ≥ 0.\n2. In the cases where ψ(x) = log cosh x and ψ(x) = x as in (2.13), it holds for any δ > 0\nand any given λ′ = (λ′p )p≥0 ∈ l2 that\nif kλ − λ′ k2 < δ, then max |P(λ, P) − P(λ′ , P)| ≤ Kkλ − λ′ k2\nP ROSt\n\nwhere K > 0 depends on λ′ and δ.\nProof. We prove the first claim. We show that P(λ, P) is differentiable in λ and that the\nderivative is a continuous function on ROSt's. The conclusion follows by integration.\nWe write for short\np\ng(v, z) := l(v) + z 1 − c(kvk2) ,\n\nomitting the dependence on l. Note that under El Ez , the g's are all centered Gaussian\nvariables of variance 1. Suppose first that the derivative can be taken inside the expectations\nE El and μ × Ez , then one would get\n\u0010\n\u0011\n\n(μ × Ez ) g(v, z)ψ ′(λg(v, z))eψ(λg(v,z))\n .\n\u0011\n\u0010\n∂λ P(λ, P) = EEl \n(2.14)\n(μ × Ez ) eψ(λg(v,z))\n\nBy Theorem 2.3, the derivative will be continuous as a functional on ROSt's if g(v, z)ψ ′ (λg(v, z))\nsatisfies (2.4) and (2.5). This is straightforward since ψ ′ is bounded.\nIt remains to show (2.14). The derivative can be taken inside the expectation EEl if we\nshow that for δ small enough\n\u0010\n\u0011 2\n\nψ(λg(v,z))\n(μ\n×\nE\n)\ne\nz\n1\nlog\n\u0011 < ∞ .\n\u0010\n(2.15)\nsup\nEE\nl\n′ 2\n′ g(v,z))\nψ(λ\n|λ−λ′ |<δ (λ − λ )\n(μ × E ) e\nz\n\n16\n\n\fThis effectively demonstrates the uniform integrability of the collection of random variables\nindexed by λ with |λ − λ′ | < δ and given by\n\u0011\n\u0011\n\u0010\n\u0010\n1\nψ(λ′ g(v,z))\nψ(λg(v,z))\n−\nlog(μ\n×\nE\n)\ne\n.\nlog(μ\n×\nE\n)\ne\nz\nz\nλ − λ′\n\nWrite R(λ, λ′ ) for the random variable inside the log in (2.15). We split the integration for\nthe events {R(λ, λ′ ) < 1} and {R(λ, λ′ ) > 1}. The expectation in (2.15) becomes\nh\ni\n′ 2\n′\nEEl (log R(λ, λ )) ; R(λ, λ ) > 1\nh\ni\n\u00012\n+ EEl log R(λ, λ′ )−1 ; R(λ, λ′ )−1 > 1 .\n\nSince log x ≤ x − 1 for x > 1, we can bound the above by\n\u0011 2\n\u0010\n\n′\n(μ × Ez ) eψ(λg(v,z)) − eψ(λ g(v,z))\n +\n\u0011\n\u0010\nEEl \n(μ × Ez ) eψ(λg(v,z))\n\u0011 2\n\u0010\n\n′\n(μ × Ez ) eψ(λg(v,z)) − eψ(λ g(v,z))\n . (2.16)\n\u0010\n\u0011\nEEl \n(μ × Ez ) eψ(λ′ g(v,z))\n\nUsing successively Cauchy-Schwarz inequality followed by Jensen's inequality on each term\nyields the upper bound\n\u0014\n\u001a\n\u00114 \u0015\u001b1/2\n\u0010\nψ(λg(v,z))\nψ(λ′ g(v,z))\nEEl (μ × Ez ) e\n−e\n\u001a\u0010\n\u0011i\u00111/2\nh\n\u0010\n−4ψ(λg(v,z))\nEEl (μ × Ez ) e\n×\n\nh\n\u0010\n\u0011i\u00111/2 \u001b\n−4ψ(λ′ g(v,z))\n+ EEl (μ × Ez ) e\n(2.17)\n\u0010\n\nThe terms in the second bracket can be integrated by Fubini's and since the fields g(v, z) all\nhave variance 1 under El Ez , the dependence on E drops leaving\nh\ni1/2\n\u0002\n\u00031/2\n′\nEz e−4ψ(λz)\n+ Ez e−4ψ(λ z)\n.\n\nThe fact that |ψ ′ | ≤ C and ψ(0) = 0 implies that |ψ(λz)| ≤ λC|z|. And since |λ − λ′ | < δ,\n|ψ(λz)| ≤ C(λ′ + δ)|z|. Hence after integration, the term in the parentheses is seen to be\nuniformly bounded by a term that depends only on λ′ and δ. It remains to bound the first\nterm. After a use of Fubini's theorem, since the fields g(v, z) have variance 1, it is simply\n\u001a \u0010\n\u00114 \u001b1/2\nψ(λz)\nψ(λ′ z)\nEz e\n−e\n.\n(2.18)\nTaylor's expansion around ψ(λ′ z) gives for a certain z̄ between λ′ z and λz,\n′\n\neψ(λz) − eψ(λ z) = (λ − λ′ )zψ ′ (z̄)eψ(z̄) .\n17\n\n(2.19)\n\n\fThe latter is bounded above by C|λ − λ′ | |z|eC|z̄| . The assumption on z̄ readily implies that\n|z̄| ≤ |z|(λ′ + δ). Plugging all this back into (2.18), we get a bound after integration of z\nwhich is (λ − λ′ )2 times a constant that depends only λ′ and δ . Since the term (λ − λ′ )2\ncancels with the one in (2.15), it follows that the differential operator can be passed through\nEEl .\nTo prove (2.14), it remains to show\n\u0011\n\u0010\n\u0010\n\u0011 (μ × Ez ) g(v, z)ψ ′(λg(v, z))eψ(λg(v,z))\n\u0011\n\u0010\n∂λ log(μ × Ez ) eψ(λg(v,z)) =\n.\n(2.20)\nψ(λg(v,z))\n(μ × Ez ) e\nThis is straightforward once it is established that\n\u0011\n\u0010\n\u0011\n\u0010\n∂λ (μ × Ez ) eψ(λg(v,z)) = (μ × Ez ) g(v, z)ψ ′ (λg(v, z))eψ(λg(v,z)) .\nTo do so, it suffices to justify taking the derivative inside μ × Ez by showing\n\u00112\n\u0010\n1\nψ(λg(v,z))\nψ(λ′ g(v,z))\nsup\n(μ\n×\nE\n)\ne\n−\ne\n<∞.\nz\n′ 2\n|λ−λ′ |<δ (λ − λ )\n\n(2.21)\n\nUsing the expansion (2.19) with g, the above is bounded by\n′\n\nC 2 (μ × Ez )(g 2 e2C(λ +δ)|g| ).\nThe expectation is finite Pl -almost surely as can be seen by integrating over l. (2.20) follows.\nTo prove the second claim of the proposition, it suffices to show\n\u0011\n\u0010 P\nP\nψ( p λp lp (v))− 12 p λ2p kvk2p\nμ e\n\u0011 < Kkλ − λ′ k2 ,\n(2.22)\nEEl log \u0010 P ′\n1 P\n′2\n2p\nμ eψ( p λp lp (v))− 2 p λp kvk\n2\n\nsince the functional λ 7→ λ2 in (2.13) obviously obeys a similar bound for kλ − λ′ k2 < δ.\nWe write K for a generic term that depends on λ′ and δ only. Bounding the logarithm as\nit was done after (2.15), one gets that (2.22) is smaller or equal than a term bounded on\n{λ : kλ − λ′ k2 < δ} times\n\u001a\n\u0010 P\n\u00112 \u001b1/2\nP\nP\nP\nψ( p λp lp (v)) − 12 p λ2p kvk2p\nψ( p λ′p lp (v)) − 21 p λ′2\nkvk2p\np\nEEl μ e\ne\n−e\ne\n.\nP\n\n1\n\n′\n\nP\n\n2\n\n2p\n\nBy adding and subtracting eψ( p λp lp (v)) e− 2 p λp kvk and using the triangle inequality, this\nis smaller than\nn\n\u0010 P 2 2p\nP\nP ′\n\u00012 \u0011o1/2\nEEl μ e− p λp kvk eψ( p λp lp (v)) − eψ( p λp lp (v))\n+\nn\n\u0010\n\u0011o1/2\nP ′\n1 P\n1 P\n2\n2p\n′2\n2p \u00012\nEEl μ e2ψ( p λp lp (v)) e− 2 p λp kvk − e− 2 p λp kvk\n.\nP\n\n2\n\n2p\n\nP\n\n′\n\nThe terms e− p λp kvk and El e2ψ( p λp lp (v)) are uniformly bounded on B and on {λ : kλ −\nλ′ k2 < δ}. Moreover, for ψ = log cosh x or ψ(x) = x, one has (eψ(x) − eψ(y) )2 ≤ (x −\n18\n\n\fy)2 e2|x|+2|y| . Therefore, applying Cauchy-Schwarz inequality, the claimed bound follows for\nthe first term from the fact that λp lp (v) has bounded exponential moments on B and on\n{λ : kλ − λ′ k2 < δ}, and that\nX\nX\n\u00014\nEl\n(λp − λ′p )lp (v) = 3\n(λp − λ′p )2 kvk2p\np\n\np\n\n!2\n\n≤ 3kλ − λ′ k42 .\n\nAs for the second term, the bound follows from\n1\n\n|e− 2\n\n3\n\nP\n\np\n\nλ2p kvk2p\n\n1\n\n− e− 2\n\nP\n\np\n\n2p\nλ′2\np kvk\n\n|≤\n\n1X 2\n′\nλ − λ′2\np ≤ Kkλ − λ k2 .\n2 p p\n\nThe Parisi Formula from the Ultrametricity Conjecture\n\nIn this section, we show that the Ultrametricity Conjecture 1 together with Corollary 1.11\nand Guerra's upper bound [15] yield an alternative proof of the Parisi formula for the SK\nmodel (and more generally, for mixed p-spin models with even p's). The main new result\nis Theorem 3.5, which gives a lower bound for the free energy in terms of a functional of a\nlimit point of the sequence of Gibbs measures in the space of ROSt's. The proof uses the\ntreatment of Talagrand for the high-temperature regime (Theorem 2.4.19 in [29]) and the\ncontinuity of the Parisi functionals on the space of ROSt's. The compactness of the set of\nROSt's that are invariant under a family of cavity mappings, which is a consequence of the\ncontinuity of such mappings, will also be crucial (see Corollary 3.7). The Parisi formula is\nthen a consequence of Guerra's bound and the Ultrametricity Conjecture.\nThe p-spin Hamiltonian HNp on {−1, +1}N ,\n(HNp (σ), σ ∈ {−1, +1}N ) ,\nis a centered Gaussian vector with covariances EHNp (σ)HNp (σ ′ ) = NR(σ, σ ′ )p , where R(σ, σ ′ ) =\nPN\n1\n′\ni=1 σi σi . Such a process can be represented as\nN\nHNp (σ)\n\n=\n\n1\n\nN (p−1)/2\n\nN\nX\n\ngi1 ,...,ip σi1 ...σip ,\n\n(3.1)\n\ni1 ,...,ip =1\n\nwhere gi1 ,...,ip are standard Gaussians that are independent for distinct indices (i1 , ..., ip ). In\nthis section, we will be concerned with the mixed Hamiltonian\nX\nHN (σ) =\nβp HNp (σ)\np\n\nwhere the summation is restricted throughout this section to p = 1 and even p's. Take\nβp ∈ R+ for simplicity since HN has the same law for positive and negative values of the\n19\n\n\fparameters. For the appropriate cavity field to be well-defined, the parameters β := (βp )\nwill need to decay so that\nX\n2p βp2 < ∞ .\n(3.2)\np\n\n(We stress that this decay is most likely P\nnot optimal.) The β's satisfying (3.2) form\nP pa Hilbert\n′\np\n′\n2\nspace under the inner product β * β = p 2 βp βp . The norm is then kβk = p 2 βp2 .\nThe Gibbs measure at the value β of the parameters is\nGβ,N (σ) =\n\nexp HN (σ)\n,\nZN (β)\n\nP\nwhere ZN (β) = σ exp HN (σ). As mentioned in Section 1.2, a ROSt can be constructed\nfrom the random probability measures (Gβ,N ). The corresponding sequence of laws will be\ndenoted by (Pβ,N ). The corresponding sampling measures defined through (1.7) will be\ndenoted by (μβ,N ). Since the space of ROSt's is compact, the sequence (Pβ,N ) has limit\npoints. We will denote a generic limit point by Pβ and its sampling measure by μβ .\nOur goal is to express the free energy of the Hamiltonian\n1\nE log ZN (β)\nN →∞ N\n\nf (β) := lim\n\nas a functional of a limit point Pβ . For the mixed Hamiltonian with p = 1 and even p's, the\nexistence of the limit was proved by Guerra and Toninelli [17]. We also know from the work\nof Guerra [15] and Talagrand [30] that f (β) is expressed by the celebrated Parisi formula.\nWe write it here in terms of Ruelle Probability Cascades (RPC's). The reader is referred to\n[4] for the correspondence between this formulation and the one in terms of PDE's.\nTheorem 3.1 (The Parisi Formula). For any β satisfying (3.2), we have\n(\n)\n\u0011\nX (p − 1)βp2 \u0010\n⊗2\n′ p\nf (β) = log 2 + min P(λβ , P) −\n1 − Eμ (v * v )\nP RPC\n2\np\n\n√\nwhere P is the Parisi functional (2.13) with ψ(x) = log cosh x, and (λβ )p−1 = p βp for p =\n1 and even p's and zero otherwise. The minimum is over the laws of the Ruelle Probability\nCascades, a compact subset of the laws of ROSt's. The sampling measure of P is denoted by\nμ.\nIt can be checked that for any ROSt that is stochastically stable for the cavity fields lp ,\nso in particular for the RPC's, the second functional in the Parisi formula,\nP 7→\n\nX (p − 1)βp2 \u0010\np\n\n2\n\n⊗2\n\n′ p\n\n1 − Eμ (v * v )\n\n\u0011\n\nP\n2\nis equal to the Parisi functional (2.13) for ψ(x) = x, λ2 =\np (p − 1)βp , and c(x) =\nP (p−1)βp2 p\nx.\np\nλ2\nThe proof in [30] of the Parisi Formula is not constructive. Our goal is to provide\na constructive demonstration in the spirit of Aizenman, Sims and Starr [3] and Theorem\n20\n\n\f2.4.19 of [29] by assuming that the Ultrametricity Conjecture holds. This way of proceeding\nis based on general properties of ROSt's. Moreover, we emphasize that we will not use the\nultrametric structure of the RPC explicitly, but simply that the stochastic stability properties\ncharacterize the RPC family from the conjecture.\nThe first ingredient of the proof is an upper bound proved by Guerra [15].\nTheorem 3.2 (Guerra's bound). For any RPC with law P and sampling measure μ,\n\u0011\nX (p − 1)βp2 \u0010\n⊗2\n′ p\nf (β) ≤ log 2 + P(λβ , P) −\n1 − Eμ (v * v ) .\n2\np\nGuerra's proof is based on an interpolation between a cascade with a finite number of\nlevels and the Gibbs measure Gβ,N . It uses explicitly the tree structure of the cascades. The\nproof of this bound can be also done using the approach of Aizenman, Sims and Starr [3].\nIn this case, the proof does not use the ultrametric structure of the cascade explicitly, but\nsimply the stability of the cascades under the cavity mapping with function ψ(x) = log cosh x\nand ψ(x) = x. The reader is referred to [3, 4] for more details.\nIt remains to establish the matching lower bound. We begin by a standard lemma, whose\nproof using Jensen's inequality will be helpful in this section.\nLemma 3.3. The function β 7→ f (β) is convex and continuous in the space of β satisfying\n(3.2).\nProof. We set fN (β) := N1 E log ZN (β). The fact that fN (β) is convex follows by Hölder's\ninequality, and the convexity of f (β) is proved since it is the pointwise limit of fN (β). We\nnow show that the family (fN (β))N is equicontinuous in β.\nFirst note that fN (β) is an increasing function of its parameters, since by Gaussian\nintegration by part,\n\u0011\n\u0010\n⊗2\n(3.3)\nDp fN (β) = βp 1 − EGβ,N\nR(σ, σ ′ )p ≥ 0 ,\nwhere Dp is the partial derivative in the p-th coordinate. Let β and β ′ satisfy (3.2). Let us\ndefine β − with βp− := min{βp , βp′ }. By construction, fN (β − ) ≤ fN (β) and fN (β − ) ≤ fN (β ′ ).\nWe show that\n1X\nfN (β) − fN (β − ) ≤\n(βp − βp− )2 ,\n(3.4)\n2 p\n\nand similarly for fN (β ′ ). We observe that\nfN (β) − fN (β − ) =\n\n1\nEE ′ log Gβ− ,N (exp HN′ (σ)),\nN\n\nwhere HN′ (σ) is defined as HN , but is independent of HN and has parameters\n\n\u0010q\n\nβp2 − (βp− )2\n\n\u0011\n\np\n\nWe write E ′ for the expectation on HN′ . By Jensen's inequality with log and using the independence between HN′ and Gβ− , this is smaller than\n\u0010\n\u0011i 1 X\n\u0001\n1 h\nβp2 − (βp− )2 ,\nE log Gβ− ,N E ′ exp HN′ (σ) =\nN\n2 p\n21\n\n.\n\n\fN\n\nsince E ′ exp HN′ (σ) = e 2\ndefinition of β − that\n\nβp2 −(βp− )2\n\n|fN (β) − fN (β ′ )| ≤\n\n\u0001\n\n. The proof is identical for β ′ . This implies from the\n\n\u0001 1X p 2\n\u0001\n1X 2\n2 βp − (βp′ )2 .\nβp − (βp′ )2 ≤\n2 p\n2 p\n\nSince the continuity is uniform in N, the equicontinuity\nP p 2 is proved. It follows that f (β) is\n2\ncontinuous in β in the sense of the norm kβk = p 2 βp .\n\nIt is well-known that a convex function on R is differentiable almost everywhere. It\nturns out that a similar statement is true for a continuous convex functional on an infinitedimensional space. Indeed, it is a theorem of Mazur that a continuous convex functional on\nany open convex subset of a separable Banach space has a dense set of points of differentiability (in the sense that the directional derivative exists in all directions), see e.g. Theorem\n1.20 in [22]. Applying this to the Hilbert space of β satisfying (3.2), we get\nLemma 3.4. The set of parameters β for which\nf (β + tβ ′ )\nexists for any β ′\nt→0\nt\n\nlim\n\n(3.5)\n\nis dense in the set of parameters satisfying (3.2).\nThe main ingredient entering in the lower bound is the following result.\nTheorem 3.5. Let β be a point of differentiability of f . There exists a subsequence of (Pβ,N )\nthat converges to Pβ , the law of a ROSt with sampling measure μβ , for which\nf (β) ≥ log 2 + P(λβ , Pβ ) −\n\nX (p − 1)βp2 \u0010\np\n\n2\n\n′ p\n1 − Eμ⊗2\nβ (v * v )\n\n\u0011\n\n(3.6)\n\nwhere P and λβ are as in Theorem 3.1.\nTo prove the assertion, we shall need a standard result of convexity. We omit the proof.\nLemma 3.6. Let fN : RM → R be a sequence of differentiable convex functions that converges pointwise to f . Suppose f is differentiable at x ∈ RM . Then for any sequence xN\nconverging to x,\nlim ∇fN (xN ) = lim ∇fN (x) = ∇f (x).\nN →∞\n\nN →∞\n\nProof of Theorem 3.5. We show that\n\u0014\n\u0015\nZN +1 (β)\nlim inf E log\nN →∞\nZN (β)\n\n(3.7)\n\nequals the right-hand side of (3.6) for Pβ , a limit point in the space of ROSt's of (Pβ,Nk )k\nwhere (Nk )k achieves the above lim inf. The result then follows from the existence of the\nlimiting free energy and the fact that\n\u0014\n\u0015\n\u0014\n\u0015\nN\nZn+1 (β)\nZN +1 (β)\n1 X\nE log\n≥ lim inf E log\n.\nlim fN (β) = lim\nN →∞\nN →∞\nN →∞ N\nZn (β)\nZN (β)\nn=1\n22\n\n\f\u0001(p−1)/2\nTaking β + := (βp+ ) where βp+ = βp NN+1\n, we can decompose the ratio in (3.7) as\n\u0014\n\u0015\n\u0014\n\u0015\nZN +1 (β + )\nZN +1 (β + )\nE log\n− E log\n.\n(3.8)\nZN (β)\nZN +1 (β)\nWe handle the first term. A straightforward calculation using the representation (3.1) yields\nfor HNp on N + 1 spins,\nβp+ HNp +1 (σ, σN +1 )\n\n=\n\nβp\nN (p−1)/2\n\np\nX\n\nk\nσN\n+1\n\nk=0\n\nX\n\ngIk σj1 ...σjp−k\n\nIk\n\nwhere the second sum is on p-tuplet Ik = (i1 , ..., ip ) with exactly k coordinates equal to\nN + 1 and the other coordinates, denoted by (j1 , ..., jp−k ), run from 1 to N. In particular,\nthe covariance becomes\np\np\n′\n2\n′\n2\n′\n′ p−1\nE[βp+ HNp +1 (σ, σN +1 )βp+ HNp +1 (σ ′ , σN\n+1 )] = βp E[HN (σ)HN (σ )] + pβp σN +1 σN +1 R(σ, σ )\np \u0012 \u0013\nX\nR(σ, σ ′ )p−k\np k\n′k\n2\nσN +1 σN\n+ βp\n.\n+1\nk−1\nk\nN\nk=2\n(3.9)\nP pβp2\n′ p−1\n′\nwhere\nWe denote by lc (σ) the cavity field with covariance c(R(σ, σ )) = p λ2 R(σ, σ )\nβ\nP\n2\nλ2β =\np pβp , and by ǫ(σ, σN +1 ) the field of covariance given by the sum over all p's of\nthe last term of (3.9). Note that these fields are independent of each other and of HN (σ).\nMoreover, the variance of ǫ is smaller than\np \u0012 \u0013\n1\nC\n1 X 2 p\n1 X 2X p\nβp\nβ\n2\n=\n≤\n(3.10)\np\nk−2\nk\nN p\nN\nN\nN\np\nk=2\n\nfor some finite constant C under the assumption (3.2) on the decay of βp .\nThe term ZN +1 (β + ) can be rewritten using (3.9) and we get\n\u0014\n\u0015\nZN +1 (β + )\nE log\nZN (β)\n\n\n\nX\n= E El Eǫ log Gβ,N \nexp{λβ σN +1 lc (σ) + ǫ(σ, σN +1 )} ,\nσN+1 =±1\n\nwhere E is understood to be the expectation on Gβ,N on the right-hand side, and El and Eǫ\nare the expectations on l and ǫ respectively. Using Jensen's inequality and the independence\nbetween l and ǫ we get from (3.10)\n\u0015\n\u0014\nC\nZN +1 (β + )\n− EEl [log Gβ,N (2 cosh λβ lc (σ))] ≤\n.\nE log\nZN (β)\nN\nTherefore the first term of (3.8) is, up to a term of order 1/N,\nlog 2 + P(λβ , Pβ,N ) ,\n23\n\n\fwhere Pβ,N is the law of the ROSt constructed from Gβ,N . Let Pβ be a limit point of (Pβ,Nk ),\nwhere (Nk ) achieves the lim inf of (3.7). The continuity of the Parisi functional proved\nin Proposition 2.5 gives the first two terms of (3.6). It remains to prove that along this\nsubsequence\n\u0014\n\u0015\n\u0011\nX (p − 1)βp2 \u0010\nZNk +1 (β + )\n⊗2\n′ p\nE log\n(3.11)\n→\n1 − Eμβ (v * v ) .\nZNk +1 (β)\n2\np\n\nThe idea is simply a Taylor expansion in β, but since we are dealing with infinitely many\n+\nvariables, we proceed with care. We define β +\nM with components βp for p ≤ M and βp for\np > M. Using Jensen's inequality and the summability of β, for any δ > 0 we can find M(δ)\nindependently of N such that for M > M(δ)\n\u0014\n\u0015\nZN +1 (β + )\nN X +2\n(βp − βp2 ) < δ .\n0 ≤ E log\n≤\n2\nZN +1 (β +\n)\nM\np>M\nFix such a δ and such a M. By the mean-value theorem on RM , there exists β M with\nβp ≤ β̄p ≤ βp+ for p ≤ M and β̄p = βp for p > M such that\n\u0014\n\u0015 X\nZN +1 (β +\nM)\nE log\n=\nN(βp+ − βp )Dp fN +1 (β M ) .\nZN +1 (β)\np≤M\n\nWe know that fN (β) is a convex function of β. Thus, by Lemma 3.6 and the assumption on\ndifferentiability of f (β),\nlim\n\nN →∞\n\nX\n\np≤M\n\nN(βp+ − βp )Dp fN +1 (β M ) =\n\nX (p − 1)βp\nlim Dp fN (β)\nN →∞\n2\np≤M\n\nX (p − 1)βp2\n\u0001\n′ p\n1 − Eμ⊗2\n,\n=\nβ (v * v )\n2\np≤M\n\nwhere we used (3.3) in the last equality as well as the continuity of the function P 7→\nEμ⊗2 (v * v ′ )p in the space of ROSt's. Since δ was arbitrary, the theorem is proved.\nThe connection between the lower bound of Theorem 3.5 and the actual Parisi formula\nwith RPC's will be provided by the Ultrametricity Conjecture. The idea is to use the lower\nbound of Theorem 3.5 for β where βp > 0 for all p's. The limit ROSt's Pβ for such a choice\npossesses strong invariance properties by Corollary 1.11 if β is a point of differentiability\nof f . However, it is not guaranteed that β is a point of differentiability. Even worse,\nMazur's theorem does not ensure that the points of differentiability are dense in the subset\n{β : βp > 0 ∀p} since it is not open. This apparent difficulty is however bypassed by the use\nof subsequences and by the continuity of the cavity mapping.\nCorollary 3.7. Let β with βp > 0 for p = 1 and even p's. There exists a ROSt of law Pβ\nand sampling measure μβ that is stochastically stable for the cavity fields lp , p = 1 and all p\neven, and for which\n\u0011\nX (p − 1)βp2 \u0010\n′ p\n.\n1 − Eμ⊗2\n(v\n*\nv\n)\nf (β) ≥ log 2 + P(λβ , Pβ ) −\nβ\n2\np\n24\n\n\fProof. By Lemma 3.4, there exists a sequence of points of differentiability β m , m ∈ N, that\nconverges to β. Hence the inequality (3.6) is satisfied for any β m for some ROSt's of law\nPβm . Recall that Pβm is the limit law of the ROSt's constructed from the Gibbs measures\nGβm ,N . It follows from Corollary 1.11 that Pβm is stochastically stable for the cavity fields lp\nfor all p ≤ p(m), where p(m) ≤ ∞ is the greatest p such that (β m )p > 0. Since the space of\nROSt's is compact, there exists a subsequence of m's for which Pβm converges to the law of\nsome ROSt denoted Pβ . Moreover, since the cavity mapping is continuous, any limit point of\na sequence of laws that are invariant under a cavity mapping is also invariant. This implies\nthat Pβ is stochastically stable for the cavity fields lp for all relevant p's (since p(m) goes to\ninfinity with m from the hypothesis that βp > 0 for all p).\nBy Lemma 3.3, f (β m ) → f (β). To prove the inequality (3.6) for β, it remains to show\nthat the right-hand side also converges for the considered subsequence of β m . This is clear\nfor the second term since β m → β and Pβm → Pβ . For the second term, one has\n|P(λβm , Pβm ) − P(λβ , Pβ )| ≤ |P(λβm , Pβm ) − P(λβ , Pβm )| + |P(λβ , Pβm ) − P(λβ , Pβ )|\n≤ max |P(λβm , P) − P(λβ , P)| + |P(λβ , Pβm ) − P(λβ , Pβ )| .\nP ROSt\n\nThe right-hand side goes to zero\nof β m by Proposition 2.5 because\nPalong the2 subsequence\n2\nPβm → Pβ and kλβm − λβ k2 = p p((β m )p − βp ) ≤ kβ m − βk.\n\nProof of Theorem 3.1 using Conjecture 1. By Conjecture 1, the only stochastically stable\nROSt's for infinitely many p's are convex combinations of RPC's. Therefore, by Corollary\n3.7 and Guerra's bound, the Parisi formula is established at any point β with βp > 0 for all\np. (Note that the functionals that are minimized in the Parisi formula are linear functions in\nthe law of the ROSt's. In particular, the minimum can be restricted to RPC's as opposed to\nconvex combinations of RPC's.) It remains to show that the Parisi formula holds at all β,\nincluding those β with βp = 0 for some p. Since f is continuous in the space of parameters\nsatisfying (3.2), it suffices to show that the functional\n)\n(\n\u0011\nX (p − 1)βp2 \u0010\n1 − Eμ⊗2 (v * v ′ )p\n(3.12)\nβ 7→ min P(λβ , P) −\nP RPC\n2\np\nP\nis continuous under the norm kβk2 = p 2p βp2 . We write for convenience Λ(β, P) for the\nfunctional in the argument of the minimum. By Proposition 2.5, Λ(β, *) is a continuous\nfunctional on ROSt's. We denote by Pβ the RPC where the minimum of Λ(β, *) is attained.\nSince we minimize Λ over ROSt's, we have trivially\nΛ(β, Pβ ) − Λ(β ′ , Pβ ) ≤ min Λ(β, P) − min Λ(β ′ , P) ≤ Λ(β, Pβ′ ) − Λ(β ′ , Pβ′ ) .\nP RPC\n\nP RPC\n\n(3.13)\n\nOn the other hand, if β is close enough to β ′ , we have for some K > 0,\nmax |Λ(β, P) − Λ(β′ , P)| ≤ Kkβ − β ′ k .\n\nP ROSt\n\nThis is because, by the second part of Proposition 2.5,\n(\n)1/2\n(\n)1/2\nX\nX\nmax |P(λβ , P) − P(λβ′ , P)| ≤ K\np(βp − βp′ )2\n≤K\n2p (βp − βp′ )2\n,\nP ROSt\n\np\n\np\n\n25\n\n\fand the same holds by inspection for the second functional entering in the definition of Λ.\nThe continuity of (3.12) in the space of β satisfying (3.2) follows from (3.13) and the above\nestimate.\n\n4\n\nProperties of Stochastically Stable ROSt's\n\nSome particular properties of stochastically stable ROSt's were essential in the proof of the\nultrametricity conjecture in [5] and [23], where strong assumptions on the ROSt were needed\n(e.g., finiteness of the support for the law of the entries). Here we show similar properties in\na general settting which may be useful for the proof of the conjecture in the general case.\nA direct consequence of the continuity of the cavity mapping is the compactness of the\nset of stochastically stable ROSt's.\nCorollary 4.1. The set of laws of ROSt's that are invariant under a (possibly infinite)\nfamily of cavity mappings of the form (1.6) is convex and compact. In particular, the set of\nlaws of the stochastically stable ROSt's is convex and compact.\nProof. Convexity is clear. The compactness of the set of laws of ROSt's that are invariant\nunder the mapping (1.6) for a given ψ and a given positive definite form c is a consequence\nof continuity of the mapping (Theorem 1.4). Compactness also holds for sets of ROSt's that\nare invariant under an infinite number of mappings (e.g., for all parameters λ > 0) since in\na compact space an arbitrary intersection of compact sets is compact.\nCorollary 4.1 yields a standard ergodic decomposition for the different sets of stochastically stable ROSt's by Choquet's theorem: the law of a ROSt in such a convex set can be\nwritten as the barycenter of some probability measure on the extreme points of the set. This\nis useful since many functions of interest on the sampling measure of a ROSt turn out to be\nconstant when the law is an extreme point. This is helpful when proving properties of the\nsampling measure of stochastically stable ROSt's.\nDefinition 4.2. We say a function h : M(B) → R is an invariant function of the cavity\nmapping Φψ,lc defined in (1.6) if: 1) it is Borel measurable; 2) for any isometry T of B,\nh(μ) = h(T −1 μ); 3) h(μ) = h(Φψ,lc μ) Pl -almost surely.\nLemma 4.3. Let h : M(B) → R be an invariant function of a (possibly infinite) family of\ncavity mapping (Φψ,lc ), where the collection is over different ψ's and c's. Let P be the law\nof a ROSt with sampling measure μ. If P is an extreme point of the set of laws that are\ninvariant under the family (Φψ,lc ), then the random variable h(μ) is constant P-a.s.\nProof. If h is not a constant, we have the non-trivial decomposition of P\nZ\nP=\nP( * | h(μ) = y) Ph−1 (dy) .\n\n(4.1)\n\nR\n\nOn the other hand, P( * |h(μ)) is invariant under the same family of mapping (Φψ,lc ) for\nP-almost all h(μ). Indeed, for any Borel measurable function g on M(B), invariant under\nisometry, any Borel measurable function F : R → R, and every Φψ,lc in the collection,\n\u0001\n\u0001\n\u0001\nE[g(μ)F h(μ) ] = EEl [g(Φψ,lc μ)F h(Φψ,lc μ) ] = EEl [g(Φψ,lc μ)F h(μ) ] ,\n26\n\n\fwhere the first equality follows from the invariance of P and the second, from the invariance\nof h. Thus (4.1) contradicts the assumption that P is an extreme point and the claim\nfollows.\nBy inspection of the form of the cavity mapping (1.6), we expect that the support of a\nmeasure μ is not affected by the cavity mapping, since the mapping modifies only the weight\nof the vectors and not their relative position. We make this idea precise in the following\nlemma.\nLemma 4.4. Let μ ∈ M(B) and Φψ,lc as in (1.6). Then Φψ,lc μ is equivalent to μ Pl -almost\nsurely, that is: for any non-negative measurable function f on B,\nZ\nZ\nf (v) μ(dv) = 0 if and only if\nf (v)Φψ,lc μ(dv) = 0 Pl -a.s.\nB\n\nB\n\nProof. Note first that\n√\n2\nf (v) Ez [eψ(lc (v)+z 1−c(kvk )) ]\n√\nf (v)Φψ,lc μ(dv) =\nμ(dv)\n2\nB μ(Ez [eψ(lc (v)+z 1−c(kvk )) ])\nB\n√\nR\nψ(lc (v)+z 1−c(kvk2 ))\n]μ(dv) = 0. Now\nhence\nthe\nleft-hand\nside\nis\nzero\nif\nand\nonly\nif\nf\n(v)E\n[e\nz\nB\nR\nif B f (v) μ(dv) = 0, then we must have that f (v) = 0 μ-a.e., which implies\nZ\n√\n2\nf (v)Ez [eψ(lc (v)+z 1−c(kvk )) ]μ(dv) = 0 .\nZ\n\nZ\n\nB\n\n√\nψ(lc (v)+z 1−c(kvk2 ))\n] > 0 Pl -a.s. and μ-a.e. This is\nOn the other hand,\nwe\nnote\nthat\nE\n[e\nz\np\n2\nbecause lc (v) + z 1 − c(kvk ) is finite Pl × Pz -a.s. and μ-a.e., since by Fubini,\nZ\np\nEl Ez |lc (v) + z 1 − c(kvk2 )|2 μ(dv) = 1 .\nB\n\nTherefore if\n\nf (v)Ez [eψ(lc (v)+z\nB\n\nR\n\n√\n\n1−c(kvk2 ))\n\n]μ(dv) = 0, then f (v) = 0 μ-a.e. also.\n\nFunctions on M(B) that only depend on the support of the measure typically turn out\nto be invariant functions of the mapping in the sense of Definition 4.2. This simple fact can\nbe used to investigate the support of the sampling measures of stochastically stable ROSt's.\nHere we look at two examples below: the dimension of the support of the measure and\nwhether or not the support lies on a sphere. We will need three invariant functions of the\ncavity mapping.\nThe first two are\nn\no\nrmin(μ) := inf 0 ≤ r ≤ 1 : μ{v ∈ B : kvk ≤ r} > 0 ;\nn\no\n(4.2)\nrmax (μ) := sup 0 ≤ r ≤ 1 : μ{v ∈ B : kvk ≥ r} > 0 .\n\n27\n\n\fEssentially, rmin represents the inner radius of the support of μ and rmax , the outer radius.\nThe requirements of Definition 4.2 are fulfilled by these two functions for any cavity mapping\nΦψ,lc . Indeed, both functions are measurable since\nn\no\n[\nμ ∈ M(B) : μ{kvk ≤ s′ } > 0\n{μ ∈ M(B) : rmin (μ) < s} =\ns′ ∈Q, 0≤s′ <s\n\n{μ ∈ M(B) : rmax (μ) > s} =\n\n[\n\ns′ ∈Q, s<s′ ≤1\n\nn\no\n′\nμ ∈ M(B) : μ{kvk ≥ s } > 0 ,\n\n(4.3)\n\nand the functions μ 7→ μ{kvk ≤ s′ }, μ 7→ μ{kvk ≥ s′ } are Borel measurable for the weak-*\ntopology on M(B). They are invariant under an isometry T of B since the norm of a vector\nis. The fact that rmin (μ) = rmin(Φψ,lc μ) and rmax (μ) = rmax (Φψ,lc μ) is direct from Lemma\n4.4, since the latter implies Pl -a.s.\nμ{v ∈ B : kvk ≤ s} > 0 ⇐⇒ Φψ,lc μ{v ∈ B : kvk ≤ s} > 0\nμ{v ∈ B : kvk ≥ s} > 0 ⇐⇒ Φψ,lc μ{v ∈ B : kvk ≥ s} > 0 .\nThe third invariant function we need is the dimension of the smallest subspace that\ncontains the support. One way to make this precise is as follows [1]. Let μ ∈ M(B). Define\n(weakly) the covariance operator Cˆμ on H as\nZ\n′ ′′\n′\n′′\nfor all v , v ∈ H, v * (Cˆμ v ) :=\nμ(dv) (v ′ * v)(v * v ′′ ) .\nB\n\nIt is easily checked that Cˆμ is a self-adjoint, trace-class linear operator on H. (It is traceR\nP\nclass, since for a standard basis {ei } of H, T r Cˆμ = i ei * (Cˆμ ei ) = B μ(dv)kvk2 ≤ 1.) In\nparticular, it is compact, thus admits a basis of orthonormal eigenvectors for H. We write\n{λi (μ)} for the non-zero eigenvalues. We write Hμ for the eigenspace corresponding to the\nnon-zero eigenvalues. We have H = Hμ ⊕ Hμ⊥ . It is easily verified that μ(Hμ⊥ ∩ B) = 0. We\ndefine\ndim μ := #{i ∈ N : λi (μ) > 0} = dim Hμ .\nWe claim that the function μ 7→ dim μ is an invariant of the cavity mapping Φψ,lc for any ψ\nand c. Standard arguments show that it is measurable with respect to the Borel σ-algebra of\nM(B). It is readily checked that eigenvectors of μ are mapped to eigenvectors of μT −1 for any\nisometry T of B, therefore dim μ = dim μT −1 . It remains to show that dim μ = dim Φψ,lc μ\nPl -a.s. We have v ∈ Hμ⊥ ∩ B if and only if\nZ\nv * (Cˆμ v) =\nμ(dv) (v, v)2 = 0 .\nB\n\nBy Lemma 4.4, this is true if and only if\nZ\nΦψ,lc μ(dv) (v, v)2 = v * (CˆΦψ,lc μ v) = 0,\nB\n\n⊥\n∩ B. The claim follows.\nwhich in turn is equivalent to v ∈ HΦ\nψ,lc μ\nThe following result on the dimension of stochastically stable ROSt is a generalization of\na result for competing particle systems which states that no system with a finite number of\nparticles can be quasi-stationary [28]. It is rather surprising that it holds for ROSt whose a\nlaw is invariant under a single cavity mapping.\n\n28\n\n\fTheorem 1.7. Let P be the law of a ROSt that is invariant under the cavity mapping Φλ,l\nfor a given λ > 0. Let μ be its sampling measure. Then\nP(dim μ = 1 or dim μ = ∞) = 1 .\nIn other words, μ is supported on a single vector or on an infinite-dimensional subset of B.\nProof. For simplicity, we set λ = 1. By relying on the Choquet decomposition, it suffices\nto show the assertion holds when P is an extreme point of the set of laws invariant under\nΦ1,l . Since μ 7→ dim μ is an invariant function of the mapping, Lemma 4.3 implies that it is\nconstant with P-probability one. Suppose 1 < dim μ < ∞. We first prove that this implies\nthat the sampling measure μ is supported on a sphere P-almost surely, that is, there exists\na deterministic r ≥ 0 such that μ{v ∈ B : kvk = r} = 1 for almost all μ. Indeed, since\nμ 7→ rmin(μ) defined in (4.3) is also an invariant function, it is constant P-a.s. This constant\nwill henceforth be written simply as rmin . For any r > rmin and ǫ > 0, consider the ratio\nμ{v ∈ B : kvk > r + ǫ}\n.\nμ{v ∈ B : kvk ≤ r}\n\n(4.4)\n\nWe claim that the ratio is zero for any r > rmin and ǫ > 0. If so, we are done, since it implies\nthat μ{v ∈ B : kvk > r} = 0 for any r > rmin , hence that μ is supported on the sphere\nof radius rmin . By Lemma 2.4, P is invariant under the mappings Φ√T ,l for any T ∈ N.\nTherefore the ratio (4.4) has the same law as\n√\n\nT\n\n2\n\ne T l(v)− 2 kvk μ(dv)\n{kvk>r+ǫ}\n√\n.\nR\nT l(v)− T2 kvk2\nμ(dv)\ne\n{kvk≤r}\n\nR\n\nSince 1 < dim μ < ∞, l can be seen as a Gaussian vector in a finite-dimensional space. We\nthen have the bound −klk ≤ l(v) ≤ klk, since kvk ≤ 1. A straightforward application of\nthat bound and simple estimates shows that the ratio is smaller or equal to\n√\n\ne2\n\nT klk− T2 (2ǫr+ǫ2 ) μ{v\n\n∈ B : kvk > r + ǫ}\n.\nμ{v ∈ B : kvk ≤ r}\n\nThis proves the claim, since the above goes to zero as T → ∞ for Pl -almost all l.\nIt remains to show that if μ has support in a finite-dimensional sphere, then it must be\nsupported on a single vector. The idea is that μ must be supported on the vector where the\ncavity field is maximal. In a finite-dimensional space, v 7→ l(v) is a continuous function for\nPl -almost all l. Since the sphere is compact, it achieves its maximum, say ml . Moreover,\nby independence of the l(v)'s in orthogonal directions, the maximizer, say vl∗ , is unique. Let\nCl (ǫ) be a cap neighborhood of the maximizer vl∗ on the sphere such that l(v) > ml − ǫ for\nv ∈ Cl (ǫ) and l(v) ≤ ml − ǫ for v ∈ Cl (ǫ)√c . If the measure μ is not supported on a single\nR\nvector, there exists an ǫ such that Cl (ǫ)c e T l(v) μ(dv) > 0. We then have\nR\n\n√\n\n√\ne T l(v) μ(dv)\nμ{Cl (ǫ/2)}\nCl (ǫ/2)\n√\n.\n≥ e T ǫ/2\nR\nT\nl(v)\nμ{Cl (ǫ)c }\nμ(dv)\ne\nCl (ǫ)c\n\n29\n\n\fThis shows that, for any ǫ, the limit of the left-hand side as T → ∞ exists and is infinite for\nP-almost all μ and Pl -almost all l. But by invariance, the ratio on the left-hand side has the\nsame law under P × Pl as for a single application of Φ1,l , i.e.,\nR\nel(v) μ(dv)\nCl (ǫ/2)\nR\n.\nel(v) μ(dv)\nCl (ǫ)c\nThis ratio is infinite for all ǫ if and only if\n\n(Φ1,l μ){vl∗ } = 1 P × Pl -a.s.\nWe deduce by the invariance of the ROSt that μ must be supported on a single vector.\nOne might expect that other properties of stochastically stable ROSt's might be obtained\nin a similar way leading to a better understanding of the hypotheses of the Ultrametricity\nConjecture. If stochastic stability is assumed for an infinite number of cavity fields, we can\nprove more.\nTheorem 1.8. Let P be the law of a ROSt that is invariant under the cavity mapping Φλ,lp\nfor a given λ > 0 and for infinitely many p ∈ N. Let μ be its sampling measure and suppose\n2\nthat μ⊗2 {(v, v ′) ∈ B2 : v * v ′ = rmax\n(μ)} > 0 on a set of positive P-probability. Then,\nμ{v ∈ B : kvk = rmax (μ)} = 1 P-a.s.\nIn other words, μ is almost surely supported on a sphere.\nProof. We set λ = 1 for simplicity. In the proof, all p's refer to the infinite collection of p's\nfor which invariance holds. By relying again on the Choquet decomposition, it suffices to\nshow the assertion holds when P is an extreme point of the set of laws invariant under Φ1,lp\nfor all p's. Consider rmin and rmax defined in (4.3). Since they are invariant functions of the\ncavity mappings Φ1,lp for all p, they are constant P-a.s. We suppose that rmin < rmax and\nshow this leads to a contradiction.\nPick δ such that rmin < δ < rmax . Let Bδ = {v ∈ B : kvk < δ}. Note that since\nrmin < rmax , we must have that 0 < μ(Bδ ) < 1 for P-almost all μ.\nBy the invariance properties of the ROSt and Lemma 2.4, the following identity holds\nfor all T ∈ N and all p's\nR\n\n√\nT lp (v)− T2 kvk2p\ne\nμ(dv)\nB\n\u0011  .\nEμ(Bδ ) = EEl  δ \u0010 √\n(4.5)\nT lp (v)− T2 kvk2p\nμ e\n\nNow pick a sequence (T (p))p such that T (p)δ 2p → 0. (The choice of the sequence will be\nrefined later.) Fatou's lemma then implies\n\nR\n√\nT (p) lp (v)− T (p)\nkvk2p\n2\ne\nμ(dv)\nB\n\u0011 \n(4.6)\nEμ(Bδ ) ≥ E lim inf El  δ \u0010 √\nT (p)\n2p\np→∞\nμ e T (p) lp (v)− 2 kvk\n30\n\n\fWe now show that for P-almost all μ,\nR\n\n\n\n√\nT (p)\nT (p) lp (v)− 2 kvk2p\nμ(dv)\ne\nμ(Bδ )\nB\n\u0011  = lim inf El  \u0010 √\n\u0011  . (4.7)\nlim inf El  δ \u0010 √\nT (p)\nT (p)\n2p\n2p\np→∞\np→∞\nμ e T (p) lp (v)− 2 kvk\nμ e T (p) lp (v)− 2 kvk\n\nTaking the difference of the two sides and applying Cauchy-Schwarz inequality, one gets\n \n1/2\n( \u0012Z\n\n\u00132 )1/2 \n\n\n√\n1\n\n\nT (p) lp (v)− 12 T (p)kvk2p\nEl\nμ(dv) − μ(Bδ )\nEl  \u0010 \u0010 √\ne\n.\n\u0011\u00112 \nT (p)\n2p\n\n\nBδ\n\n\nμ e T (p) lp (v)− 2 kvk\n\nThe term inside the first bracket can be evaluated by developing the square and integrating\nover El to get\nZ\n′ p\neT (p)(v*v ) μ(dv)μ(dv ′) − (μ(Bδ ))2 ,\nBδ ×Bδ\n\nwhich converges to 0 as p → ∞ by the choice of T (p). It remains to show that the term in\nthe second bracket is bounded uniformly in p. By introducing μ(Bδ ), it is equal to\n\n2 \nμ(Bδ )\n1\n\n√\nEl  R\n2\nT (p) lp (v)− T (p)\nkvk2p\n(μ(Bδ ))\n2\ne\nμ(dv)\nBδ\n\n(Note that we used the fact that μ(Bδ ) > 0 here.) The term in the expectation can be\nwritten in terms of the conditional measure μ( |Bδ ). Hence using Jensen's inequality, one\ngets the upper bound\n\u0011\n\u0010 √\n1\n−2 T (p) lp (v)+T (p)kvk2p\nB\n,\nE\nμ\ne\nδ\nl\n(μ(Bδ ))2\n2p\n\nwhich is seen to be bounded by e3T (p)δ by integrating with El .\nPutting (4.6) and (4.7) together yields\n\n\n\n1\n\u0011  .\nEμ(Bδ ) ≥ E μ(Bδ ) lim inf El  \u0010 √\nT (p)\n2p\np→∞\nμ e T (p) lp (v)− 2 kvk\n\nAnd since\n\n\n\n\n\n\u0010\n\u0010 √\n1\n\n\n\u0010\n\u0011\n√\nEl\n≥ El μ e T (p)\nT (p)\nT (p) lp (v)− 2 kvk2p\nμ e\n\nand μ(Bδ ) > 0 P-a.s., this implies that\n\n\nlim inf El  \u0010 √\np→∞\nμ e T (p)\n\n1\nkvk2p\nlp (v)− T (p)\n2\n\n31\n\nlp (v)− T (p)\nkvk2p\n2\n\n\n\n\u0011  = 1 P-a.s.\n\n\u0011\u0011−1\n\n= 1,\n\n(4.8)\n\n\fBy hypothesis, there must exist an α > 0 such that the set of μ's with μ⊗2 {(v, v ′) : v * v ′ =\n2\nrmax\n} > α has positive probability. We show that the\ncannot\n\u0011 hold on this\n\u0010 √equality (4.8)\nT (p)\nT (p) lp (v)− 2 kvk2p\n. In view of the\nset. Fix a μ in this set. Write for simplicity mp := μ e\n\nfact that the function y 7→ y −1 is strictly convex, a contradiction would be reached if we\ncan construct along a subsequence of (mp )p a random variable m that is fluctuating but for\nwhich El m = El m−1 = 1. It follows directly from the value of the expectations and Markov's\ninequality that for any ǫ > 0, there exists 0 < η < 1 such that\nPl {mp ∈ [η, η −1]} ≥ 1 − ǫ .\n\nThis implies that the sequence of random variables (mp ) is tight. Moreover, proceeding as\nabove,\n\u0010 √\n\u0011\n1\n−2 T (p) lp (v)+T (p)kvk2p\nEl m−2\n≤\nE\nμ\ne\nB\nl\nδ < ∞ , uniformly in p.\np\n(μ(Bδ ))2\n−1\nTherefore there exists a subsequence of p's such that mp → m in law and El m−1\n=\np → El m\n1 by (4.8) and by the uniform boundedness of the above moment. It remains to show that\nEl m = 1 and that the variance of m is non-zero so that m fluctuates. Integrating over El\none has the identity\n\u0011\n\u0010\n′ p\nEl m2p = μ⊗2 eT (p)(v*v ) .\n\nTo prove both claims, it suffices to show that the limit of El m2p along the subsequence is\nfinite (ensuring the limit of El mp is El m) and strictly greater than one (ensuring the variance\n2p\nis non-zero). This will be true if we choose the integers T (p) such that T (p)rmax\n→ log α2 .\n(Note that T (p)δ 2p → 0 for any δ < rmax for this choice.) In this case, the following hold\n\u0010\n\u0011\n2p\n′ p\nEl m2p =μ⊗2 eT (p)(v*v ) ≥ αeT (p)rmax → 2 > 1\n\u0011\n\u0010\n2p\n2\n′ p\nEl m2p =μ⊗2 eT (p)(v*v ) ≤ eT (p)rmax → < ∞ ,\nα\n\nleading to the contradiction.\n\nWe remark that stochastic stability alone is not sufficient to imply that the sampling\nmeasure of a ROSt be supported on a sphere. This is demonstrated by the following example.\nTake p = (pi )i∈N a Poisson-Dirichlet variable with parameter x1 , and p′ = (p′j )j∈N a PoissonDirichlet variable with parameter x2 6= x1 . Pick q1 6= q2 strictly positive such that q1 + q2 = 1\nand\n(1 − x1 )q1 = (1 − x2 )q2 .\n(4.9)\nP\nP ′\nIt suffices to consider the ROSt with sampling measure μ = i pi δui + j pj δvj where\n√\n√\n(ui ) are orthogonal vectors of norm q1 and (vj ) are orthogonal vectors with norm q2 also\northogonal to the u's. A Poisson-Dirichlet variable with parameter x has the property that,\nfor any positive random variable W such that EW x < ∞ and for a iid sequence (Wi ) with\nthe law of W (see e.g. [5]),\nlaw\n(pi Wi ) = (E[W x ]1/x pi ) .\n32\n\n\fTherefore taking Wi = el(ui ) and Wj = el(vj ) , we have for the variables defined above and for\nthe cavity field l:\nq1\nq2\nlaw −(1−x1 )q1\nlaw −(1−x2 )q2 ′\n(pi el(ui )− 2 ) = e 2\n(pi ) , and (p′j el(vj )− 2 ) = e 2\n(pj ) .\n\nThe relation (4.9) ensures that the constant is the same in both cases, hence vanishes after\nnormalization of the weights. This shows that the constructed μ is stochastically stable\nThe above setup also provides a counterexample to the Ultrametricity Conjecture 1 if\nstochastic stability for a single cavity field alone holds. This is demonstrated by the following\nexample coming from the limit of two uncoupled\nas studied in [8]. It suffices to\nP REM's\n′\nconsider the ROSt with sampling measure μ = i,j pi pj δ √1 (ui +vj ) . It is easily checked that\n2\nthis ROSt is stochastically stable from the invariance property of Poisson-Dirichlet variables\nand the fact that l( √12 (ui + vj )) = √12 l(ui ) + √12 l(vj ) (the restriction (4.9) is not needed here).\nOn the other hand, the support of its sampling measure is not ultrametric as it can be easily\nchecked from the following triplet of vectors in the support of μ: √12 (u1 + v1 ), √12 (u2 + v2 )\nand √12 (u1 + v2 ).\n\nReferences\n[1] Aizenman M. Private communications (2009).\n[2] Aizenman M., Contucci P. On the Stability of the Quenched state in Mean Field Spin\nGlass Models, J. Stat. Phys. 92 (1998) 765-783.\n[3] Aizenman M., Sims R., Starr S. Mean Field Spin Glass Models from the Cavity-ROSt\nPerspective. In Prospects in Mathematical Physics AMS Contemporary Mathematics, vol.\n437 (2007).\n[4] Arguin L-P. Spin Glass Computations and Probability Cascades, J. Stat. Phys. 126 (2007)\n951-976.\n[5] Arguin L.-P., Aizenman M. On the Structure of Quasi-Stationary Competing Particle\nSystems, Ann. Prob. 37 (2009) 1080-1113.\n[6] Arguin L.P. Competing Particle Systems and the Ghirlanda-Guerra Identities, Elect.\nJour. Prob. 13 (2008) 2101-2117.\n[7] Arguin L.-P. A Remark on the Infinite-Volume Gibs Measure of Spin Glasses, J. Math.\nPhys. 49 (2008) 125204.\n[8] Arguin L.-P., Kistler N. On Small Perturbations of a Spin Glass System, J. Stat. Phys.\n135 (2009) 1167-1180.\n[9] Bolthausen, E., Kistler N. On a nonhierarchical version of the generalized random energy\nmodel, Ann. Appl. Probab. 16 (2006) 114.\n[10] Bolthausen, E., Kistler N. On a nonhierarchical version of the generalized random energy\nmodel. II. Ultrametricity, Stoch. Proc. Appl. 119 (2009) 2357-2386.\n33\n\n\f[11] Bolthausen E., Sznitman A.-S. On Ruelle's Probability Cascades and an Abstract Cavity\nMethod, Comm. Math. Phys 197 (1998) 247-276 .\n[12] Bovier A., Kurkova I., Derrida's Generalized Random Energy models 2: models with\ncontinuous hierarchies, Ann. I. H. Poincare 40 (2004) 481-485.\n[13] Contucci P., Giardina C. Spin-Glass Stochastic Stability: a Rigorous Proof, Ann. I. H.\nPoincaré 5 (2005) 915-923.\n[14] Dovbysh L., Sudakov V. Gram-de Finettti matrices, J. Soviet. Math. 24 (1982) 30473054.\n[15] Guerra F. Broken Replica Symmetry Bounds in the Mean Field Spin Glass Model,\nComm. Math. Phys. 233 (2003) 1-12.\n[16] Ghirlanda S., Guerra F. General Properties of overlap probability distributions in disordered spin systems, J.Phys A 31 no.46 (1998) 9149-9155.\n[17] Guerra F., Toninelli F. The Thermodynamic Limit in Mean Field Spin Glass Models,\nComm. Math. Phys. 230 (2002) 71-79.\n[18] Kahane J.-P. Sur le Chaos Multiplicatif, Ann. Sci. Math. Québec 9 (1985) 105-150.\n[19] Mézard M., Parisi G., Virasoro M. Spin glass theory and beyond, World Scientific Lecture\nNotes in Physics vol. 9, World Scientific Publishing, NJ (1987).\n[20] Mézard M., Parisi G., Virasoro M. SK model: The replica solutions without replicas,\nEurophysics Lett. 1 (1986) 77-82.\n[21] Miller, J.P. Quasi-stationary Random Overlap Structures and the Continuous Cascades,\nPreprint arXiv:0806.1915 (2009).\n[22] Phelps R. Convex Functions, Monotone Operators and Differentiability, Lecture Notes\nin Mathematics No. 1364, Springer (1989) 114 p.\n[23] Panchenko D. A connection between Ghirlanda-Guerra identities and ultrametricity,\nAnn. Prob. 38 (2010) 327-347.\n[24] Panchenko D. The Ghirlanda-Guerra identities\nC.R.Acad.Sci.Paris, Ser. I 348 (2010) 189-192.\n\nfor\n\nmixed\n\np-spin\n\nmodel,\n\n[25] Panchenko D. On the Dovbysh-Sudakov representation result, Preprint arXiv:0905.1524\n(2009).\n[26] Panchenko D. Spin glass models from the point of view of spin distributions, Preprint\narXiv:1005.2720 (2010).\n[27] Ruelle D. A Mathematical Reformulation of Derrida's REM and GREM, Comm. Math.\nPhys. 108 (1987) 225-239.\n\n34\n\n\f[28] Ruzmaikina A., Aizenman M. Characterization of invariant measures at the leading\nedge for competing particle systems, Ann. Probab. 33 (2005) 82-113.\n[29] Talagrand M. Spin Glasses: A Challenge for Mathematicians. Cavity and Mean Field\nModels, Springer (2003) 586 p.\n[30] Talagrand M. The Parisi Formula, Ann. Math. 163 (2006) 221-263.\n[31] Talagrand M. Construction of pure states in mean field models for spin glasses, Prob.\nTh. Rel. Fields 148 601-643. (2009).\n\n35\n\n\f"}