{"id": "http://arxiv.org/abs/0804.0355v2", "guidislink": true, "updated": "2008-06-23T09:48:25Z", "updated_parsed": [2008, 6, 23, 9, 48, 25, 0, 175, 0], "published": "2008-04-02T13:58:29Z", "published_parsed": [2008, 4, 2, 13, 58, 29, 2, 93, 0], "title": "Pair-Breaking in Rotating Fermi Gases", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0804.0829%2C0804.2903%2C0804.2728%2C0804.3848%2C0804.4372%2C0804.3074%2C0804.3323%2C0804.1040%2C0804.0063%2C0804.3711%2C0804.2710%2C0804.2615%2C0804.0267%2C0804.4142%2C0804.2814%2C0804.2004%2C0804.4707%2C0804.0284%2C0804.1850%2C0804.3129%2C0804.0651%2C0804.2641%2C0804.4037%2C0804.1454%2C0804.1270%2C0804.0836%2C0804.1936%2C0804.2138%2C0804.0225%2C0804.2949%2C0804.2533%2C0804.3497%2C0804.0551%2C0804.2243%2C0804.2671%2C0804.3956%2C0804.1841%2C0804.0917%2C0804.1037%2C0804.2551%2C0804.1118%2C0804.3856%2C0804.0809%2C0804.0775%2C0804.1494%2C0804.3983%2C0804.2810%2C0804.2350%2C0804.0686%2C0804.2540%2C0804.2488%2C0804.2633%2C0804.3895%2C0804.3340%2C0804.4153%2C0804.2240%2C0804.0194%2C0804.0448%2C0804.4219%2C0804.2568%2C0804.4857%2C0804.3899%2C0804.3536%2C0804.1129%2C0804.0832%2C0804.3353%2C0804.3281%2C0804.4418%2C0804.0993%2C0804.4722%2C0804.2562%2C0804.4467%2C0804.1817%2C0804.0799%2C0804.3860%2C0804.0681%2C0804.3271%2C0804.0648%2C0804.2369%2C0804.2867%2C0804.4577%2C0804.1068%2C0804.1127%2C0804.1002%2C0804.4785%2C0804.1212%2C0804.3134%2C0804.4807%2C0804.0249%2C0804.3739%2C0804.3903%2C0804.2159%2C0804.0355%2C0804.2226%2C0804.3457%2C0804.2389%2C0804.1106%2C0804.1405%2C0804.3516%2C0804.4860%2C0804.0560&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Pair-Breaking in Rotating Fermi Gases"}, "summary": "We study the pair-breaking effect of rotation on a cold Fermi gas in the\nBCS-BEC crossover region. In the framework of BCS theory, which is supposed to\nbe qualitatively correct at zero temperature, we find that in a trap rotating\naround a symmetry axis, three regions have to be distinguished: (A) a region\nnear the rotational axis where the superfluid stays at rest and where no pairs\nare broken, (B) a region where the pairs are progressively broken with\nincreasing distance from the rotational axis, resulting in an increasing\nrotational current, and (C) a normal-fluid region where all pairs are broken\nand which rotates like a rigid body. Due to region B, density and current do\nnot exhibit any discontinuities.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0804.0829%2C0804.2903%2C0804.2728%2C0804.3848%2C0804.4372%2C0804.3074%2C0804.3323%2C0804.1040%2C0804.0063%2C0804.3711%2C0804.2710%2C0804.2615%2C0804.0267%2C0804.4142%2C0804.2814%2C0804.2004%2C0804.4707%2C0804.0284%2C0804.1850%2C0804.3129%2C0804.0651%2C0804.2641%2C0804.4037%2C0804.1454%2C0804.1270%2C0804.0836%2C0804.1936%2C0804.2138%2C0804.0225%2C0804.2949%2C0804.2533%2C0804.3497%2C0804.0551%2C0804.2243%2C0804.2671%2C0804.3956%2C0804.1841%2C0804.0917%2C0804.1037%2C0804.2551%2C0804.1118%2C0804.3856%2C0804.0809%2C0804.0775%2C0804.1494%2C0804.3983%2C0804.2810%2C0804.2350%2C0804.0686%2C0804.2540%2C0804.2488%2C0804.2633%2C0804.3895%2C0804.3340%2C0804.4153%2C0804.2240%2C0804.0194%2C0804.0448%2C0804.4219%2C0804.2568%2C0804.4857%2C0804.3899%2C0804.3536%2C0804.1129%2C0804.0832%2C0804.3353%2C0804.3281%2C0804.4418%2C0804.0993%2C0804.4722%2C0804.2562%2C0804.4467%2C0804.1817%2C0804.0799%2C0804.3860%2C0804.0681%2C0804.3271%2C0804.0648%2C0804.2369%2C0804.2867%2C0804.4577%2C0804.1068%2C0804.1127%2C0804.1002%2C0804.4785%2C0804.1212%2C0804.3134%2C0804.4807%2C0804.0249%2C0804.3739%2C0804.3903%2C0804.2159%2C0804.0355%2C0804.2226%2C0804.3457%2C0804.2389%2C0804.1106%2C0804.1405%2C0804.3516%2C0804.4860%2C0804.0560&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We study the pair-breaking effect of rotation on a cold Fermi gas in the\nBCS-BEC crossover region. In the framework of BCS theory, which is supposed to\nbe qualitatively correct at zero temperature, we find that in a trap rotating\naround a symmetry axis, three regions have to be distinguished: (A) a region\nnear the rotational axis where the superfluid stays at rest and where no pairs\nare broken, (B) a region where the pairs are progressively broken with\nincreasing distance from the rotational axis, resulting in an increasing\nrotational current, and (C) a normal-fluid region where all pairs are broken\nand which rotates like a rigid body. Due to region B, density and current do\nnot exhibit any discontinuities."}, "authors": ["Michael Urban", "Peter Schuck"], "author_detail": {"name": "Peter Schuck"}, "author": "Peter Schuck", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevA.78.011601", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0804.0355v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0804.0355v2", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "4 pages, 2 figures; v2: discussion clarified, typos corrected, one\n  reference added", "arxiv_primary_category": {"term": "cond-mat.other", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.other", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0804.0355v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0804.0355v2", "journal_reference": "Phys. Rev. A 78, 011601(R) (2008)", "doi": "10.1103/PhysRevA.78.011601", "fulltext": "Pair Breaking in Rotating Fermi Gases\nMichael Urban1 and Peter Schuck1, 2\n1\n\narXiv:0804.0355v2 [cond-mat.other] 23 Jun 2008\n\nInstitut de Physique Nucléaire, CNRS-IN2P3 and Université Paris-Sud, 91406 Orsay Cedex, France\n2\nLaboratoire de Physique et Modélisation des Milieux Condensés,\nCNRS and Université Joseph Fourier, Maison des Magistères, BP 166, 38042 Grenoble Cedex, France\nWe study the pair-breaking effect of rotation on a cold Fermi gas in the BCS-BEC crossover region.\nIn the framework of BCS theory, which is supposed to be qualitatively correct at zero temperature,\nwe find that in a trap rotating around a symmetry axis, three regions have to be distinguished: (A)\na region near the rotational axis where the superfluid stays at rest and where no pairs are broken,\n(B) a region where the pairs are progressively broken with increasing distance from the rotational\naxis, resulting in an increasing rotational current, and (C) a normal-fluid region where all pairs are\nbroken and which rotates like a rigid body. Due to region B, density and current do not exhibit any\ndiscontinuities.\nPACS numbers: 03.75.Kk,03.75.Ss,67.85.De,67.85.Lm\n\nThe surprising properties of superfluids become most\nevident if one looks at rotating systems. But the rotation\ndoes not only reveal the superfluidity, it can also destroy\nit. To give an example, in nuclear physics, the strong\nreduction of the nuclear moment of inertia compared to\nits rigid-body value is a direct consequence of superfluidity due to pairing correlations. But with increasing\nangular momentum, the pairing correlations are progressively destroyed and the moment of inertia increases to\nits rigid-body value. This pair-breaking effect of rotation\nwas studied many years ago [1].\nIn trapped atomic Fermi gases, the picture is somewhat\ndifferent, since, contrary to the situation in atomic nuclei,\nthe coherence length is much smaller than the system\nsize. It is therefore possible to create quantized vortices\nor even vortex lattices [2], which allow the system to stay\nsuperfluid while rotating.\nHowever, in a recent paper by Bausmerth, Recati, and\nStringari [3] it has been argued that it may be possible\nto put a trapped Fermi gas adiabatically into rotation\nwithout creating vortices. In that paper, the destruction\nof superfluidity by rotation is described in a way which\nis very different from the nuclear physics case: Instead\nof decreasing the value of the pairing gap with increasing angular velocity, the authors assume that the system\nseparates into a paired and an unpaired phase, while the\nproperties of the paired phase itself are not affected by\nthe rotation. The authors consider the unitary limit,\nwhere the energy densities of the paired and unpaired\nphases are known from Quantum-Monte-Carlo (QMC)\nsimulations [4]. The phase boundary between the paired\nand the unpaired phases is determined by energy minimization: Near the rotational axis, the system prefers to\nstay superfluid, i.e., to stay at rest, since the paired phase\nhas a lower energy density than the unpaired one. But\nbeyond a certain distance from the rotational axis, the\ncentrifugal energy which the system could win if it participated in the rotation becomes equal to the energy which\nis needed to break the pairs. Hence, the non-rotating\nsuperfluid core is surrounded by a rotating normal-fluid\nphase. At the interface separating the two phases, the\n\ndensity and the current are discontinuous.\nThis picture is very intuitive, but it is lacking the microscopic understanding of the pair-breaking mechanism.\nIn the present paper we will therefore describe the rotating Fermi gas in the framework of BCS theory. The\nrotation is most easily described in the rotating frame,\nwhere the hamiltonian Ĥ (minus the chemical potential\nμ times the particle number N̂ ) is given by\nĤ − μN̂ =\n\nZ\n\n\u0010 p2\nh\n\u0011\nd3 r ψ̂ † (r)\n+ V (r) − ΩLz − μ ψ̂(r)\n2m\ni\n+ g ψ̂↑† (r)ψ̂↓† (r)ψ̂↓ (r)ψ̂↑ (r) , (1)\n\nwhere ψ̂ is the Fermion field operator with components\nfor (pseudo-)spin up (↑) and down (↓), m is the atom\nmass, p = −i~∇ and L = r×p are momentum and angu2 2\nlar momentum, respectively, V (r) = m(ωz2 z 2 + ω⊥\nr⊥ )/2\nis the axially symmetric trap potential and g < 0 is the\ncoupling constant. The system is supposed to rotate with\nangular velocity Ω around the symmetry (z) axis of the\npotential.\nIf the system is large enough, such that the coherence length is small compared with the oscillator length\nassociated with the trap potential, we can make use\nof the Thomas-Fermi (TF) or local-density approximation (LDA), which amounts to treating the system at\neach point r as uniform with a local chemical potential\nμloc (r) = μ − V (r). Then p becomes a number instead\nof an operator, and the \"cranking\" term ΩLz can conveniently be written as ΩLz = v(r) * p, where v(r) = Ω × r\nis the velocity field corresponding to a rigid rotation. All\nquantities depend only parametrically on r via μloc (r)\nand v(r).\nThe gap, density, and current can all be derived from\nthe normal and anomalous Matsubara Green's functions\nG and F † [5]. They have to satisfy the Gorkov equations,\nwhich in the presence of the cranking term ΩLz become\n(i~ωn − ξ + v * p)G + ∆F † = ~ ,\n†\n\n∗\n\n(i~ωn + ξ + v * p)F + ∆ G = 0 .\n\n(2)\n(3)\n\n\f2\nwhere we introduced the abbreviation ξ = ξ(r, p) =\np2 /(2m) − μloc (r), ωn denotes a fermionic Matsubara frequency, and ∆(r) is the gap. Note that we are neglecting\nthe Hartree mean field, but anyway it would not qualitatively change our results in the BCS-BEC crossover\nregime [6]. Eqs. (2) and (3) can readily be solved for\nG and F . They are formally similar to those describing\npairing between particles with unbalanced populations\n(see, e.g., Ref. [7]), except that here the chemical potentials for the two spins are equal and the asymmetry is\nbetween states with opposite momenta (p and −p).\nIn the case of a system without superfluid flow (like in\nour axially symmetric trap, as long as there are no vortices), the gap can be assumed to be real (∆ = ∆∗ ). The\ngap equation is obtained in the usual way by summing\nF over ωn and integrating over p, with the result\nZ\n4π~2 a\nd3 p \u0010 ∆\nm∆ \u0011\n∆=−\n,\n[1−f\n(E\n)−f\n(E\n)]−\n+\n−\nm\n(2π~)3 2E\np2\n(4)\nwhere we defined\nthe\nquasiparticle\nenergies\nE\n=\nE\n±\n±\np\np * v, with E = ξ 2 + ∆2 , and f (E) = 1/(eE/(kB T ) + 1)\ndenotes the Fermi function, T being the temperature and\nkB the Boltzmann constant. In Eq. (4), the divergence of\nthe gap equation due to the contact interaction has been\nregularized in the usual way by expressing the coupling\nconstant g in terms of the s-wave scattering length a [8].\nWe are mainly interested in the BCS-BEC crossover\nregime, where it is known that the BCS description fails\nat higher temperatures, and in particular the BCS prediction for the critical temperature Tc is much too high.\nHowever, at zero temperature, BCS theory gives a reasonable description throughout the crossover. We will\ntherefore restrict ourselves to the zero-temperature case,\nin which the Fermi function reduces to a step function,\nf (E) = θ(−E). Hence, the factor [1 − f (E+ ) − f (E− )]\nis equal to 1 if both E+ and E− are positive and 0 otherwise (at most one of the two energies E+ and E− can\nbe negative). In other words, states with E± < 0 are\nexcluded from pairing. In order to better understand the\nrole of these states, let us look at the occupation numbers\nρ(r, p), which are obtained by summing G over ωn :\n1\u0010\nξ\u0011\n1\u0010\nξ\u0011\nρ(r, p) =\n1−\n[1 − f (E+)] + 1 +\nf (E− ) . (5)\n2\nE\n2\nE\nFor states with both E+ > 0 and E− > 0, this reduces to\nthe usual BCS expression. But if a state with momentum\np has E− < 0, its occupation number is equal to 1. The\ncorresponding time-reversed state with momentum −p\nhas then E+ < 0 and its occupation number is equal to\n0. As we will see below, this gives rise to a normal-fluid\n(rotational) current.\nIt is easy to see that the energies E± can only become\nnegative if the velocity v exceeds a critical value such\nthat\np′F v > ∆ .\n\n(6)\n\nHere\nwe have introduced the abbreviation p′F =\np\n2mμ′loc , where μ′loc = μloc + mv 2 /2 denotes the local\n\nchemical potential which includes the effect of the centrifugal force, and p′F is the corresponding local Fermi\nmomentum. For a given z coordinate, the condition (6)\nis fulfilled beyond a certain distance r⊥1 (z) from the rotational axis, since the velocity increases as v = Ωr⊥ . At\nsmaller distances, the energies E± are always positive,\ni.e., the system is in the usual superfluid phase and does\nnot participate in the rotation. Beyond r⊥1 , the gap is\nreduced by the rotation. We will call this region, where\na rotational current exists although the gap is non-zero,\nthe partially paired phase. Finally, at a certain distance\nr⊥2 , the gap vanishes and the system enters the normal\nphase where it rotates like a rigid body.\nIf the condition (6) is fulfilled, i.e., for r⊥ > r⊥1 , one\ncan easily see that the energies E± can become negative if\nthe momentum lies between two limits p− and p+ which\nare given by\nq\np2± = p′F2 + m2 v 2 ± 2m p′F2 v 2 − ∆2 ,\n(7)\nThe integrand of the gap equation (4) is only affected by\nthe rotation if p lies between p− and p+ . Integrating Eq.\n(4) over the angle between p and v and dividing both\nsides of the equation by ∆, we obtain\nZ\n\u0011 Z p+ \u0010 p2 p \u0011i\na h ∞ \u0010 p2\ndp\n−2m −\n−\ndp\n. (8)\n1=−\nπ~m 0\nE\nE v\np−\nThe first integral is the same as in the gap equation without rotation while the second one is the contribution of\nthe f (E± ) terms due to the rotation.\nIn the weak-coupling limit, when ∆ ≪ μloc , the pairbreaking effects appear already at extremely low angular\nvelocities Ω. In this case it is possible to evaluate the integrals in Eq. (8) analytically, and one can show that the\ncritical velocity for which the gap disappears is given by\nvc = (e/2)∆v=0 /pF , where e = 2.71 . . . denotes Euler's\nnumber. Hence, for a given z coordinate, the radial coordinates r⊥1,2 separating the fully paired from the partially paired and the partially paired from the unpaired\nphase, respectively, are the solutions of the equations\npF (r⊥1 , z)Ωr⊥1 = ∆Ω=0 (r⊥1 , z) ,\ne\npF (r⊥2 , z)Ωr⊥2 = ∆Ω=0 (r⊥2 , z) .\n2\n\n(9)\n(10)\n\nIn the crossover regime, the situation is more complicated, since the gap ∆ may be comparable with μloc .\nTherefore the integrals have to be evaluated numerically.\nIn addition, the rotation can now be much faster and the\ncentrifugal force can lead to a sizeable change of the density profile and it is necessary to readjust the global chemical potential μ as a function of Ω in order to keep the total number of particles fixed. The density per spin state,\nρ(r), is obtained by integrating the occupation numbers\nover p. Using Eq. (5), one obtains\nZ p+\nZ\n\u0010 p2 p \u0011i\n\u0010\nξ\u0011\n1 h ∞\ndp ξ\n−\n+\n.\ndp p2 1 −\nρ(r) = 2 3\n4π ~\nE\nE v\np−\n0\n(11)\n\n\f3\n80\n-3\n\n40\n\nρ (units of lho)\n\nΩ/ω = 0\nΩ/ω = 0.05\n1/(kFa) = -2\n\n20\n\nΩ/ω = 0\nΩ/ω = 0.45\n\n60\n40\n\n1/(kFa) = 0\n\n20\n\n0\n100\n80\n\n_\n\n∆ (units of h ω)\n\n0\n6\n4\n2\n\n60\n40\n20\n0\n60\n\n-2\n\n|j| (units of ω lho)\n\n0\n15\n\n-2\n\n|j| (units of ω lho)\n\n_\n\n∆ (units of h ω)\n\n-3\n\nρ (units of lho)\n\n60\n\n10\n5\n0\n0\n\n4\n\n8\nr⊥ (units of lho)\n\n12\n\nThe second term arises from the f (E± ) terms and exists only if the condition (6) is fulfilled, i.e., beyond\nr⊥1 . Between r⊥1 and r⊥2 , the density goes smoothly\nfrom its value with pairing to the value without pairing,\nlim∆→0 ρ(r) = p′F3 (r)/(6π 2 ~3 ). Once we have calculated\nthe density, we can obtain the total number of particles\nby integrating the density over space. This allows us to\ndetermine the value of the chemical potential.\nAn interesting quantity is the current density, which\ncan be obtained by multiplying the occupation numbers\nwith p/m and integrating over p. From Eq. (5) it is clear\nthat for r⊥ < r⊥ 1 , i.e., close to the rotational axis where\nthe condition (6) is not satisfied, the current vanishes as\nit should in the superfluid phase. Beyond r⊥1 , the result\ncan be given in closed form as\n(p′F2 − ∆2 /v 2 )3/2\nv.\n6π 2 ~3\n\n20\n0\n0\n\nFIG. 1: From top to bottom: density per spin state ρ, gap\n∆, and current |j| in a rotating Fermi gas (4 * 105 atoms in\nan isotropic trap with frequency ω) in the BCS phase as a\nfunction of the distance r⊥ from the z axis, for z = 0. The\nsolid lines correspond to a gas rotating with angular velocity\nΩ = 0.05ω. For comparison, the results for the non-rotating\ncase (ground state) are shown as the dashed lines.\n\nj=\n\n40\n\n(12)\n\nOne sees that in the partially paired phase the current\nincreases with decreasing gap and it correctly approaches\nits rigid-body limit if one approaches the unpaired phase:\nlim∆→0 j(r) = ρ(r)v(r).\nLet us now discuss some numerical results. We consider a system with N = 4 * 105 atoms (2 * 105 atoms per\nspin state) in two cases: (a) close to the BCS limit, with\n1/(kF a) = −2 [kF = pF (r = 0)/~], and (b) at unitarity,\ni.e., in the limit a → ∞. We do not consider the BEC side\nof the cross-over, since as soon as the chemical potential\n\n4\n\n8\nr⊥ (units of lho)\n\n12\n\n16\n\nFIG. 2: Same as Fig. 1, but for a unitary Fermi gas rotating\nwith angular velocity Ω = 0.45ω.\n\nbecomes negative, the energies E± are always positive,\ni.e., the molecules in the BEC phase are never broken\nby the rotation. For simplicity we choose a spherically\nsymmetric trap (ωz = ω⊥ ), but this will not qualitatively\nchange our results. In the figures, we will use the harmonic oscillator units p\nset by the trap potential, i.e., ~ω\nfor energies and lho = ~/(mω) for lengths.\nLet us first discuss the BCS case. In this case the pairing is so weak that it does not appreciably influence the\ndensity (upper panel of Fig. 1). It is also very fragile, i.e.,\nthe moment of inertia, which can be calculated within linear response theory [9], must be measured at extremely\nlow angular velocity. Already for an angular velocity as\nsmall as Ω = 0.05ω, the gap (second panel of Fig. 1) is\nzero in a large part of the system. Because of the small\nangular velocity, the centrifugal force has no effect on the\ndensity, either. Looking at the gap, one can clearly see\nthe point r⊥1 (z = 0) = 5.1 lho where the results for the\nnon-rotating (dashed line) and the rotating (solid line)\nsystem start to differ, and the point r⊥2 = 6.1 lho where\nthe gap goes to zero. The three regions are even more\nevident in the current (lower panel of Fig. 1): The current starts to be non-vanishing at r⊥1 and it has a kink\nat r⊥2 where it reaches the rigid-body value.\nMore interesting are the results in the cross-over\nregime, where the gap is strong enough to support a relatively fast rotation. In Fig. 2 we display the density, gap\nand current (from top to bottom) for a system at the unitary limit rotating with Ω = 0.45 Ω (solid lines; for comparison, the density and gap of the corresponding nonrotating system are shown as the dashed lines). In this\ncase, the centrifugal force leads to an oblate deformation\n\n\f4\nof the system: The chemical potential μ and the\np axial size\nof the system, which is determined by zmax = 2μ/m/ω,\ndecrease (in the present example, μ decreases from 81.7\nto 81.2 ~ω),\np while the radial size, which is determined by\nr⊥max = 2μ/[m(ω 2 − Ω2 )], increases. The increase of\nthe radial size is visible in the upper panel of Fig. 2, where\nthe density is shown as a function of r⊥ for z = 0. The\ndepletion of the density in the center is a consequence of\nthe reduced chemical potential. This is also the reason\nwhy the gap in the center decreases with the rotation.\nDue to the strong pairing, the gap has a direct effect on\nthe density. This is the reason for the kink in the density\nprofile at r⊥ = r⊥2 . However, we stress that the density\nstays continuous at r⊥2 .\nThe fact that, in contrast to the results of Bausmerth\net al. [3], the density, the gap, and the current remain\ncontinuous functions of r⊥ is the main statement of the\npresent paper. In fact, if we followed the arguments given\nin Ref. [3], we would find a similar discontinuity as they\ndo. The only difference with their result would be the\ndifferent numerical values of the parameters ξS and ξN\nwhich determine the relationship between the density and\nthe local chemical potential [μloc = ξS ~2 (6π 2 ρ)2/3 /(2m)\nor μ′loc = ξN ~2 (6π 2 ρ)2/3 /(2m) in the superfluid and normal phase, respectively]. In BCS theory without meanfield shift, one obtains ξS = 0.59 and ξN = 1, whereas the\nQMC results used in Ref. [3] are ξS = 0.44 and ξN = 056.\nIf one excluded the possibility of an intermediate \"partially paired\" phase, as in Ref. [3], the system would\nhave to split into a fully paired superfluid and a fully\nunpaired normal-fluid phase, and the density would have\na discontinuity across the phase boundary with a ratio\nρN /ρS = (ξS /ξN )3/5 , which gives 0.73 with the BCS\nresults and 0.85 with the QMC results for ξS and ξN .\nFrom this we see that, even if BCS theory is not capable to give the right numbers for ξS and ξN , the ratio is\nsemi-quantitatively correct. Anyway, even if our results\nfor the unitary limit might not be very precise, we believe that they are qualitatively correct and that between\nthe ordinary normal and superfluid phases there will be\na region in which some pairs are broken while others stay\n\nunbroken. In particular, we checked that in the region\nbetween r⊥1 and r⊥2 our energy density is lower than\nboth that of the non-rotating superfluid and the ridigly\nrotating unpaired gas.\nWe emphasize that the existence of the intermediate\nregion is not a finite-size effect, but it survives in arbitrarily large systems. For instance, if the trap was\na flat potential well instead of a harmonic oscillator,\nthe ratio of the two radii r⊥2 and r⊥1 would become\nr⊥2 /r⊥1 = e/2 = 1.36 according to Eqs. (9) and (10),\nindependently of the size of the system and of the angular velocity of the rotation. In the harmonic oscillator\nthe intermediate region is smaller since the gap decreases\nwith increasing r⊥ already in the non-rotating case.\nThis does not mean that finite-size effects do not play\nany role. For instance, the abrupt decrease of ∆ for\nr⊥ → r⊥2 is an artefact of the TF approximation, which\nrequires that all spatial variations be slow compared with\nthe length scale set by the coherence length. A necessary\ncondition for this is ∆ ≫ ~ω. In a true quantum calculation, the profiles of ∆, ρ and |j| would be rounded\nand no sharp interface between the different phases could\nbe defined. In addition, beyond a certain critical angular\nvelocity Ωc the gap should completely disappear, even on\nthe rotational axis [10].\nAn interesting extension of the present work is to study\na system which is deformed in the xy plane, i.e., in the\nplane perpendicular to the rotational axis. This question\nis very important since it is impossible to put the system into rotation without such a deformation (of course,\nonce the system rotates, the deformation can be switched\noff and the conservation of angular momentum ensures\nthat the system keeps rotating). In the deformed case,\nalso the superfluid part of the system has a non-vanishing\ncurrent, with an irrotational velocity field. Another important question concerns the collective excitations of\nthe rotating system, in particular the radial quadrupole\nmode whose precession is used in current experiments for\nmeasuring the angular momentum of the system [11]. In\norder to stay in contact with the experiments, temperature effects should be taken into account, too.\n\n[1] Yu. T. Grin' and A.I. Larkin, Sov. J. Nucl. Phys. 2,\n27 (1966) [J. Nucl. Phys. (U.S.S.R.) 2, 40 (1965)]; S.\nEthofer, Z. Physik 271, 169 (1974).\n[2] M.W. Zwierlein, J.R. Abo-Shaeer, A. Schirotzek, C.H.\nSchunck, and W. Ketterle, Nature 435, 1047 (2005).\n[3] I. Bausmerth, A. Recati, and S. Stringari, Phys. Rev.\nLett. 100, 070401 (2008).\n[4] J. Carlson, S.Y. Chang, V.R. Pandharipande, and K.E.\nSchmidt, Phys. Rev. Lett. 91, 050401 (2003); G.E. Astrakharchik, J. Boronat, J. Casulleras, and S. Giorgini,\nPhys. Rev. Lett. 93, 200404 (2004).\n[5] A.L. Fetter and J.D. Walecka, Quantum Theory of ManyParticle Systems (McGraw-Hill, New York, 1971).\n[6] A. Perali, P. Pieri, G.C. Strinati, and C. Castellani, Phys.\nRev. B 66, 024510 (2002).\n\n[7] U. Lombardo, P. Nozières, P. Schuck, H.-J. Schulze, and\nA. Sedrakian, Phys. Rev. C 64, 064314 (2001).\n[8] C.A.R. Sá de Melo, M. Randeria, and J.R. Engelbrecht,\nPhys. Rev. Lett. 71, 3202 (1993).\n[9] M. Farine, P. Schuck, and X. Viñas, Phys. Rev. A 62,\n013608 (2000); M. Urban and P. Schuck, Phys. Rev. A\n67, 033611 (2003); M. Urban, Phys. Rev. A 71, 033611\n(2005).\n[10] H. Zhai and T.-L. Ho, Phys. Rev. Lett. 97, 180414\n(2006).\n[11] S. Riedl et al., unpublished (talk given at \"Joint Meeting\nInnsbruck-Trento on Ultracold Bose and Fermi Gases\",\nInnsbruck, November 30, 2007).\n\n\f"}