{"id": "http://arxiv.org/abs/0802.0095v1", "guidislink": true, "updated": "2008-02-01T10:54:39Z", "updated_parsed": [2008, 2, 1, 10, 54, 39, 4, 32, 0], "published": "2008-02-01T10:54:39Z", "published_parsed": [2008, 2, 1, 10, 54, 39, 4, 32, 0], "title": "Prospects for strangeness measurement in ALICE", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0802.1708%2C0802.1632%2C0802.0504%2C0802.0241%2C0802.3963%2C0802.0473%2C0802.4420%2C0802.1003%2C0802.4001%2C0802.0246%2C0802.2417%2C0802.3794%2C0802.3348%2C0802.1720%2C0802.1860%2C0802.1529%2C0802.2194%2C0802.2380%2C0802.4214%2C0802.1452%2C0802.3724%2C0802.4415%2C0802.1548%2C0802.1125%2C0802.3941%2C0802.1988%2C0802.3989%2C0802.2638%2C0802.1901%2C0802.1323%2C0802.0698%2C0802.4229%2C0802.0046%2C0802.0593%2C0802.3821%2C0802.3207%2C0802.4124%2C0802.2277%2C0802.4071%2C0802.3712%2C0802.3295%2C0802.2618%2C0802.1592%2C0802.1407%2C0802.4146%2C0802.0167%2C0802.1049%2C0802.2059%2C0802.2460%2C0802.0236%2C0802.2697%2C0802.0931%2C0802.0911%2C0802.2022%2C0802.2591%2C0802.3639%2C0802.4183%2C0802.2821%2C0802.2217%2C0802.1587%2C0802.3075%2C0802.2876%2C0802.2932%2C0802.3359%2C0802.0985%2C0802.2172%2C0802.3692%2C0802.1825%2C0802.1968%2C0802.2787%2C0802.1045%2C0802.1973%2C0802.1000%2C0802.0861%2C0802.0677%2C0802.2619%2C0802.0718%2C0802.1575%2C0802.0568%2C0802.0095%2C0802.0792%2C0802.3981%2C0802.0629%2C0802.1288%2C0802.4390%2C0802.1090%2C0802.0096%2C0802.0920%2C0802.3933%2C0802.3680%2C0802.3030%2C0802.3741%2C0802.1416%2C0802.0553%2C0802.1342%2C0802.2320%2C0802.3898%2C0802.2235%2C0802.0470%2C0802.4257%2C0802.1861&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Prospects for strangeness measurement in ALICE"}, "summary": "The study of strangeness production at LHC will bring significant information\non the bulk chemical properties, its dynamics and the hadronisation mechanisms\ninvolved at these energies. The ALICE experiment will measure strange particles\nfrom topology (secondary vertices) and from resonance decays over a wide range\nin transverse momentum and shed light on this new QCD regime. These motivations\nwill be presented as well as the identification performance of ALICE for\nstrange hadrons.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0802.1708%2C0802.1632%2C0802.0504%2C0802.0241%2C0802.3963%2C0802.0473%2C0802.4420%2C0802.1003%2C0802.4001%2C0802.0246%2C0802.2417%2C0802.3794%2C0802.3348%2C0802.1720%2C0802.1860%2C0802.1529%2C0802.2194%2C0802.2380%2C0802.4214%2C0802.1452%2C0802.3724%2C0802.4415%2C0802.1548%2C0802.1125%2C0802.3941%2C0802.1988%2C0802.3989%2C0802.2638%2C0802.1901%2C0802.1323%2C0802.0698%2C0802.4229%2C0802.0046%2C0802.0593%2C0802.3821%2C0802.3207%2C0802.4124%2C0802.2277%2C0802.4071%2C0802.3712%2C0802.3295%2C0802.2618%2C0802.1592%2C0802.1407%2C0802.4146%2C0802.0167%2C0802.1049%2C0802.2059%2C0802.2460%2C0802.0236%2C0802.2697%2C0802.0931%2C0802.0911%2C0802.2022%2C0802.2591%2C0802.3639%2C0802.4183%2C0802.2821%2C0802.2217%2C0802.1587%2C0802.3075%2C0802.2876%2C0802.2932%2C0802.3359%2C0802.0985%2C0802.2172%2C0802.3692%2C0802.1825%2C0802.1968%2C0802.2787%2C0802.1045%2C0802.1973%2C0802.1000%2C0802.0861%2C0802.0677%2C0802.2619%2C0802.0718%2C0802.1575%2C0802.0568%2C0802.0095%2C0802.0792%2C0802.3981%2C0802.0629%2C0802.1288%2C0802.4390%2C0802.1090%2C0802.0096%2C0802.0920%2C0802.3933%2C0802.3680%2C0802.3030%2C0802.3741%2C0802.1416%2C0802.0553%2C0802.1342%2C0802.2320%2C0802.3898%2C0802.2235%2C0802.0470%2C0802.4257%2C0802.1861&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The study of strangeness production at LHC will bring significant information\non the bulk chemical properties, its dynamics and the hadronisation mechanisms\ninvolved at these energies. The ALICE experiment will measure strange particles\nfrom topology (secondary vertices) and from resonance decays over a wide range\nin transverse momentum and shed light on this new QCD regime. These motivations\nwill be presented as well as the identification performance of ALICE for\nstrange hadrons."}, "authors": ["R. Vernet"], "author_detail": {"name": "R. Vernet"}, "author": "R. Vernet", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1134/S1063778808090068", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0802.0095v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0802.0095v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "12 pages, 11 figures Proceedings of the Workshop on Relativistic\n  Nuclear Physics (WRNP) 2007, Kiev, Ukraine Conference Info:\n  http://wrnp2007.bitp.kiev.ua/ Submitted to \"Physics of Atomic Nuclei\"", "arxiv_primary_category": {"term": "nucl-ex", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "nucl-ex", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0802.0095v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0802.0095v1", "journal_reference": "Phys.Atom.Nucl.71:1523-1534,2008", "doi": "10.1134/S1063778808090068", "fulltext": "Prospects for strangeness measurement in ALICE\nR. Vernet1, ∗\n(ALICE)\n1 Consorzio\n\nCOMETA, Catania, Italy\n\narXiv:0802.0095v1 [nucl-ex] 1 Feb 2008\n\nThe study of strangeness production at LHC will bring significant information\non the bulk chemical properties, its dynamics and the hadronisation mechanisms\ninvolved at these energies. The ALICE experiment will measure strange particles\nfrom topology (secondary vertices) and from resonance decays over a wide range in\ntransverse momentum and shed light on this new QCD regime. These motivations\nwill be presented as well as the identification performance of ALICE for strange\nhadrons.\n\nI.\n\nINTRODUCTION\n\nFrom the beginning of the search for the Quark-Gluon Plasma (QGP), strangeness has\nbeen a powerful probe of the chemical and dynamical properties of the medium created\nin heavy-ion collisions. An enhanced production of strangeness was originally considered\nas a main signature of a hot and thermalised system having partonic degrees of freedom.\nIndeed, the creation of strange quark-antiquark pairs in a medium in which quarks and\ngluons are deconfined should be larger than in a pure hadronic system, which should result\nin an enhancement of strange particles: the more strangeness they contain, the greater the\nenhancement [1]. In addition, because the volume involved in heavy-ion collisions is much\nbigger than in small systems, a statistical relative enhancement of strange particles is also\nexpected [2].\nThe statistical hadron-resonance gas models at equilibrium, as well as Wroblewski factor predictions, describe successfully the strange particle ratios at SPS and RHIC [3, 4],\nwhich indicates a chemical equilibrium has been possibly reached, which a QGP may be\nthe vector of. Whereas statistically understood, hadron production itself and its mecha∗\n\nrenaud.vernet@cern.ch\n\n\f2\nnisms still remain an open question. Several so-called 'recombination' models argue that\ntwo competitive mechanisms govern hadron production: low- and intermediate-momentum\nhadrons are mainly created via coalescence of 'soft' quarks, while high momenta are ruled\nby fragmentation [5, 6, 7, 8]. This idea is confirmed experimentally by several results that\nreveal a strong discrepancy between meson and baryon production when considering observables such as momentum distributions or nuclear modification factors (RCP ) [9, 10, 11]. The\nunderstanding of hadron production at the Large Hadron Collider (LHC) will imply, therefore, the understanding of the relative contribution of these competing mechanisms and how\nthey interplay in the intermediate momentum region, where the baryon-meson discrepancy\nis more evident.\nIt is hence mandatory to measure hadrons at LHC in a region of momentum as wide\nas possible to understand the underlying QCD processes. Strange secondary vertices and\nresonances offer the opportunity to do so, since their identification methods (topology and\ninvariant mass, respectively) may be limited by statistics only. Besides, resonances provide\nan additional possibility to investigate the collision dynamics at its early times, in particular\nfor probing the duration between chemical and thermal freeze-outs.\nWhile Pb-Pb collisions will provide exceptional conditions to study the QGP due to large\nvolume and lifetime of the system, LHC's first data will be p-p collisions, which will allow\nto probe values of Bjorken-x never reached so far. In addition, p-p collisions will not only\nserve as benchmark for Pb-Pb physics, but will also be a way to test pQCD, which is of\nfundamental interest in this new energy regime. In that respect, the preparation of the tools\nto measure strange particles at LHC is of major importance, either in Pb-Pb or p-p colliding\nsystems. ALICE (A Large Ion Collider Experiment) is specifically designed for the study of\nthe QGP at LHC. Thanks to its large acceptance and its highly-precise tracking apparatus,\nALICE will satisfy the need of identifying strange particles in a range of pT covering the\nsoft, intermediate and hard regimes.\nIn the two following sections, we present ALICE capabilities to measure strange i) secondary vertices (with a particular emphasis on hyperons) and ii) resonances, considering\nthe particles K 0 (892) and φ(1020). We describe the methods developed for the detection\nof these particles and show their expected reconstruction efficiencies and yields, and give a\nprospect of what can be achievable within the first Pb-Pb and p-p runs.\n\n\f3\nπ,Κ\n\nπ\n\nπ\n\nπ,p\n\np\n\nDCA\n\nDCA\n\n0\nS\n\nΚ ,Λ\nb−\n\nΘ\n\n−p\n\np\n\nb\n\nV0\n\nb+\n\nΛ\n\nfiducial zone\n\nΞ,Ω Θ\n\ncas\n\nbach\n\nb\n\nV0\n\nfiducial zone\n\nFIG. 1: V0 (left) and cascade (right) topological selections and fiducial zone.\nII.\n\nIDENTIFICATION OF SECONDARY VERTICES\n\nStrange particles KS0 , Λ, Ξ and Ω decay, via weak interaction, few centimeters away from\nthe primary vertex. Therefore, their charged decay modes may be identified using topological\nmethods that consist in selecting daughter track candidates according to geometrical criteria,\nas shown in Figure 1. The identification of V0 s, namely KS0 → π + π − and Λ → pπ − , is done\n\napplying geometrical selections on the daughter impact parameters (b+ , b− ), the distance of\n\nclosest approach between the daughters (DCA) and the pointing angle. A condition on the\nV0 decay position is also imposed by means of a 'fiducial zone', defined by two extreme radii\nin the transverse plane.\nThe identification of cascades (Ξ− → Λπ − and Ω− → ΛK − ) consists in associating\n\na V0 candidate with a single-track candidate (the 'bachelor'), using selections on the V0\n\nmass and impact parameter, the DCA between the V0 and the bachelor, the bachelor\nimpact parameter, and the cascade pointing angle and transverse decay radius. The detailed\nprocedure can be found in reference [12].\nSingle particle identification (PID) is not required in these methods, which makes them\nespecially efficient at intermediate and high transverse momenta, where energy loss and\ntime of flight identification fail. As a matter of fact, the studies presented in this section\nwere obtained using the ALICE tracking devices TPC and ITS, without any requirement on\nsingle-track energy loss inside these detectors.\nThe two following subsections present respectively the secondary-vertex identification\nperformance of ALICE for Pb-Pb and p-p colliding systems.\n\n\f1000\n\n500\n\n0\n\n1.08\n\n1.1\n\n1.12\n\n1.14\n\n1.16\n2\n\nΛ Invariant Mass (GeV/c )\n\n20\n\nCounts / (3 MeV/c2)\n\n1500\n\nCounts / (2.5 MeV/c2)\n\nCounts\n\n4\n\n-\n\nSignal Ξ\n\n15\n\nBackground\n\n10\n5\n0\n\n1.29\n\n1.3\n\n1.31 1.32 1.33 1.34 1.35 1.36\nMΛ,π- (GeV/c2)\n\n40\n-\n\nSignal Ω\n\n30\n\nBackground\n\n20\n10\n0\n\n1.66\n\n1.68\n\n1.7\n\n1.72\n1.74\nMΛ,K - (GeV/c2)\n\nFIG. 2: Reconstructed invariant mass spectra of Λ (left), Ξ (middle) and Ω (right) obtained from\n√\ncentral HIJING Pb-Pb events at sN N = 5.5 T eV .\nA.\n\nHyperon reconstruction in Pb-Pb at\n\n√\nsN N = 5.5 T eV\n\nA precise measurement of particle production in the Pb-Pb system is very challenging\ngiven the very high track density that implies a large combinatorial contamination. For\nthis reason, the track topological selection must be fine-tuned in order to get as many\nsecondary vertex candidates as possible, keeping the background at a reasonable level, and\nallowing thus to distinguish within the very first minutes of data taking the signal from the\nbackground in their invariant mass spectrum.\nThe results shown in this section were obtained from events simulated with the HIJING\ngenerator [13] parameterised for a charged particle density (dNch /dy) at mid-rapidity of\n4000. The Λ, Ξ and Ω (and their antiparticles) multiplicities at mid-rapidity and the inverse\nslopes of their exponential pT spectra are detailed in reference [12].\nFigure 2 shows the invariant mass spectra of Λ and Ξ obtained after processing the full\nreconstruction chain on 300 of the aforementioned events. For the Ω, a dedicated study\nwas performed due to the low efficiency and requested 6000 events. One can observe that\nthe signal is clearly visible for all three hyperons, with signal over background ratios (S/B)\nclose to the unity and resolutions on invariant mass around 3 MeV /c2 . The average overall\nefficiency for Λ (Ξ, Ω) reconstruction corresponds to 11% (0.45%, 0.36%). In other words,\none should expect an mean number of 11 (0.07, 0.01) identified Λ (Ξ, Ω) per event.\nTo draw an estimate of the capability of ALICE to identify high-pT hyperons, we use\nthe overall reconstruction efficiency as function of the hyperon pT , which we multiply by\nthe pT spectrum expected in Pb-Pb collisions. Each pT spectrum is obtained assuming the\nstatistics of 107 central events estimated for the first Pb-Pb run and considering two extreme\nvalues of inverse slopes.\n\n\fStatistics = 107 Events\n|y|< 0.75, Λ: dN/dy|y=0 = 50\n\n108\n107\n106\n105\n\nStatistics = 107 Events\n|y|< 0.75, Ξ: dN/dy|y=0 = 8\n\n5\n\n10\n\n104\n\n3\n\n10\n\n0\n\n2\n\n4\n\n102\n\nTexp=850 MeV\n10\n\nTexp=500 MeV\n\n10\n\n6\n\n8\n\n10\n\n12\n\n1\n\ny=0\n\n3\n\nTexp=800 MeV\n\n102\n\nStatistics = 107 Events\n|y|< 0.75, Ω: dN/dy| = 1.5\n\n5\n\n10\n\n10\n\n2\n\n10\n\n106\n\n104\n\n103\n\n104\n\n1\n\n106\n\nRaw Yield\n\n109\n\nRaw Yield\n\nRaw Yield\n\n5\n\nTexp=900 MeV\n\nTexp=550 MeV\n0\n\npt (GeV/c)\n\n2\n\n4\n\n10\n6\n\n8\n\n10\n\n1\n\n12\n\nTexp=600 MeV\n0\n\n2\n\n4\n\npt (GeV/c)\n\n6\n\n8\n\n10\n\n12\n\npt (GeV/c)\n\nFIG. 3: Λ (left), Ξ (middle) and Ω (right) reconstructed yields expected for 107 Pb-Pb central\n√\nevents at sN N = 5.5 T eV . For each particle two inverse slopes of the exponential pT spectrum\nare considered. They are reported on each figure together with the assumed multiplicity per unit\nof rapidity.\n\nThe reconstructed yield spectra as function of pT are presented in Figure 3. They show\nthat a statistics of ∼ 100 Λ (Ξ, Ω) can be expected at pT as high as 10 (8, 6) GeV /c within\nthe first run. In order to take into account hard processes, one could consider an additional\npower-law contribution in the high-pT part of the generated distributions; that would push\nthese statistical limits to higher values.\n\nB.\n\nHyperon reconstruction in p-p at\n\n√\n\nspp = 14 T eV\n\nThe identification of secondary vertices in p-p collisions is rather different from that in\nPb-Pb. Since in the small system particle multiplicities are low, combinatorial background\nis even lower, which allows therefore topological selections to be loosened in order to gather\nmore signal. However, the p-p system is affected by a larger error on primary vertex position\nmeasurement in low-multiplicity events, which can substantially alter the reconstruction\nefficiency. A detailed study on these effects can be found in reference [14].\nFigure 4 shows the KS0 , Λ and Ξ reconstructed invariant mass spectra obtained from p-p\nevents generated with PYTHIA6.214 [15]. The S/B ratio is very high for the KS0 and close to\nunity for Λ and Ξ. The obtained precision on invariant mass measurement is about 5 MeV /c2\nfor KS0 and is comparable to that of Pb-Pb for what concerns Λ and Ξ. An estimate of the\nΛ and Ξ reconstructed yields has been performed as well. They are illustrated in Figure 5\nas a function of pT in the rapidity range |y| < 0.8, assuming a number of 109 events. The\nhighest hyperon pT reached (considering a statistics of ∼ 100 entries in the corresponding\nbin) within the first p-p run is also comparable to that obtained in Pb-Pb.\n\n\f1500\n1000\n500\n0\n\n0.46\n\n0.48\n\n0.5\n0\nKs\n\n0.52\n\n800\n600\n400\n200\n0\n\n0.54\n\n60\n\nCounts / (2.1 MeV/c2)\n\n2000\n\nCounts / (1 MeV/c2)\n\nCounts / (1 MeV/c2)\n\n6\n\n1.08\n\n1.1\n\n1.12\n\n1.14\n\n40\n\n20\n\n0\n\n1.16\n\n1.25\n\n1.3\n\n1.35\n\nΛ Invariant Mass (GeV/c )\n\n2\n\nInvariant Mass (GeV/c )\n\n1.4\n\n1.45\n\nΞ Invariant Mass (GeV/c2)\n\n2\n\n9\n\nStatistics = 10 Events\n|η|< 0.80, Λ: dN/dη| = 0.025\n\n6\n\n10\n\ny=0\n\n5\n\n10\n\n107\n10\n\n5\n\n10\n\n10\n\n3\n\n102\n10\n1\n\n2\n\n4\n\n6\n\n8\n\n10\n\n12\n\n14\n\np (GeV/c)\nt\n\n107\n\ny=0\n\n5\n\n10\n10\n\n10\n\n3\n\n10\n\n102\n\n102\n\n1\n\n9\n\nStatistics = 10 Events\n|η|< 0.80, Ω: dN/dη| = 0.000055\n\n6\n\n10\n\n4\n\n4\n3\n\n10\n\nPYTHIA 6.214\n0\n\ny=0\n\n10\n\n4\n\n10\n\n9\n\nStatistics = 10 Events\n|η|< 0.80, Ξ: dN/dη| = 0.0024\n\n6\n\nRaw Yield\n\n107\n\nRaw Yield\n\nRaw Yield\n\nFIG. 4: Reconstructed invariant mass spectra of KS0 (left), Λ (middle) and Ξ (right) obtained from\n√\np-p collisions at spp = 14 T eV .\n\n10\n\nPYTHIA 6.214\n0\n\n2\n\n4\n\n6\n\n8\n\n10\n\n12\n\n14\n\n1\n\nPYTHIA 6.214\n0\n\n2\n\n4\n\np (GeV/c)\nt\n\n6\n\n8\n\n10\n\n12\n\n14\n\np (GeV/c)\nt\n\nFIG. 5: Λ (left), Ξ (middle) and Ω (right) reconstructed yields expected for 109 p-p events at\n√\nspp = 14 T eV . The assumed multiplicities per unit of rapidity are reported on each figure.\nIII.\n\nSTRANGE RESONANCE IDENTIFICATION.\n\nThe results shown in this section concern the K 0 (892) and φ(1020) resonances. For\nthe sake of simplicity, they are indicated respectively by K ∗ and φ. The decay modes\ninvestigated in this section are K ∗ → K + π − (or K ∗ → K − π + ) and φ → K + K − . Since\nresonances decay very early, their decay daughters are not discernible from other primary\nparticles. Resonances are identified via invariant mass reconstruction methods that combine\nall possible pairs of primary daughter candidates. The resulting background being very high\nsince no selection other than PID or track quality is applied, we estimate it by means of 'likesign' or 'event mixing' procedures. Both aim to reconstruct only non-signal candidates and\nto reproduce the background shape. The kaon and pion identification used in these studies\nrely on a combined PID obtained from the energy loss (dE/dX) in the TPC, and from the\ntime measurement of the TOF. The analyses have been performed on a sample of 1.5M p-p\n√\nevents obtained with the particle generator PYTHIA6.214 at the energy spp = 14 TeV.\n\n\f7\nCounts / (15 MeV/c 2)\n\nCounts / (15 MeV/c 2)\n\n3\n\n×10\n180\n\nsignal\nlikesign\n\n160\n140\n120\n100\n80\n60\n\n20000\n\nsignal-likesign\nsimulated\n\n15000\n\n10000\n\n5000\n\n40\n20\n0\n0\n\n0.6\n\n0.7\n\n0.8\n\n0.9\n\n1\n\n1.1\n\n1.2\n\n1.3\n\n+\nMass(K π++K π-)\n\n1.4\n\n2\n\n0.6\n\n0.7\n\n0.8\n\n0.9\n\n1\n\n(GeV/c )\n\n1.1\n\n-\n\n1.2\n\n+\n\n1.3\n\n1.4\n\nMass(K π++K π-) (GeV/c 2)\n\nFIG. 6: Left: K ∗ invariant mass spectrum (unlike-sign pairs, squares) and estimated background\n(like-sign pairs, triangles). Right: K ∗ invariant mass spectrum after background subtraction (circles) and true signal (crosses). The curve is a Breit-Wigner fit. pT and y are integrated in both\nfigures.\nA.\n\nK 0 (892) identification in p-p at\n\n√\n\nspp = 14 T eV\n\nWe present here the results obtained for the identification of K ∗ . Figure 6 shows, on the\nleft part, the reconstructed invariant mass spectrum of the 'unlike-sign' pairs (K + π − ) and\n(K − π + ) together with the estimated 'like-sign' background. The like-sign background is in\na good agreement with the unlike-sign spectrum, apart of course in the region of the K ∗\nmass where the signal peak is clearly visible. The right part of the figure shows the resulting\nsubtraction between the unlike- and like-sign spectra, where the associated simulated K ∗\nspectrum is superimposed. A Breit-Wigner fit of the subtracted spectrum returns a mean\nmass of 895 MeV/c2 and a width of 56 MeV /c2 , to be compared to the expected values\n896 and 52 MeV /c2 [16]. The agreement is good for the mass calculation, whereas less\naccurate for the width, due to detector-resolution effects. The K ∗ yield is calculated here\nfrom the fit integral; the relative discrepancy with the true signal is 0.9%, which indicates\nthe background is estimated accurately.\nA similar signal-calculation procedure was applied for various bins in pT . Figures 7 and\n8 show the invariant mass plots for two selected pT intervals: [0 − 0.5] and [3.5 − 4] GeV /c.\nIn each bin of pT , the background estimation is in reasonable agreement with the unlike-sign\nspectrum. This agreement does not seem to be affected, within the fluctuation amplitude,\nby the fact that the spectrum shapes in the two bins strongly differ. Furthermore, despite\nthe relative low statistics resulting in each bin, the signal extraction in both cases is still\n\n\fCounts / (15 MeV/c 2)\n\nCounts / (15 MeV/c 2)\n\n8\n\nsignal\nlikesign\n\n60000\n50000\n40000\n30000\n\n7000\n6000\n\nsignal-likesign\nsimulated\n\n5000\n4000\n3000\n2000\n\n20000\n1000\n10000\n0\n\n0\n0.6\n\n0.7\n\n0.8\n\n0.9\n\n1\n\n1.1\n\n-\n\n1.2\n\n+\n\n1.3\n\n1.4\n\n0.6\n\nMass(K π++K π-) (GeV/c 2)\n\n0.7\n\n0.8\n\n0.9\n\n1\n\n1.1\n\n-\n\n1.2\n\n+\n\n1.3\n\n1.4\n\nMass(K π++K π-) (GeV/c 2)\n\nFIG. 7: Left: K ∗ invariant mass spectrum (unlike-sign pairs, squares) and estimated background\n(like-sign pairs, triangles) for pT < 0.5 GeV /c. Right: K ∗ invariant mass spectrum after back-\n\nCounts / (15 MeV/c 2)\n\nCounts / (15 MeV/c 2)\n\nground subtraction (circles) and true signal (crosses). The curve is a Breit-Wigner fit.\n450\n\nsignal\nlikesign\n\n400\n350\n300\n250\n200\n\n200\n\nsignal-likesign\nsimulated\n\n150\n100\n50\n0\n\n150\n-50\n\n100\n50\n0\n\n-100\n0.6\n\n0.7\n\n0.8\n\n0.9\n\n1\n\n1.1\n\n-\n\n1.2\n\n+\n\n1.3\n\n1.4\n\nMass(K π++K π-) (GeV/c 2)\n\n0.6\n\n0.7\n\n0.8\n\n0.9\n\n1\n\n1.1\n\n-\n\n1.2\n\n+\n\n1.3\n\n1.4\n\nMass(K π++K π-) (GeV/c 2)\n\nFIG. 8: Left: K ∗ invariant mass spectrum (unlike-sign pairs, squares) and estimated background\n(like-sign pairs, triangles) for 3.5 < pT < 4 GeV /c. Right: K ∗ invariant mass spectrum after\nbackground subtraction (circles) and true signal (crosses). The curve is a Breit-Wigner fit.\n\npossible. We hence chose to draw a first estimate of the overall reconstruction efficiency as\na function of pT and y. The corresponding results are presented in Figure 9, focusing on the\nintervals [pT × y] = [(0 → 4 GeV /c) × (−1.5 → 1.5)]. The average efficiency is about 4% in\nthe most central bins in rapidity, but drops substantially (∼ 2%) at larger |y|, due to the\nlower single-track reconstruction efficiency in that region.\n\n\f9\n\n0.04\n\n4\n3.5\n\n0.02\n3\n0\n1.5\n\ny\n\n2.5\n1\n\n2\n0.5\n\n/c)\n\nV\nGe\n\n(\npT\n\n1.5\n0\n\n1\n\n-0.5\n-1\n\n0.5\n-1.5 0\n\nFIG. 9: K ∗ reconstruction efficiency as a function of transverse momentum (pT ) and rapidity (y)\n√\nin p-p collisions at spp = 14 T eV .\n\nFIG. 10: Left: φ invariant mass spectrum and estimated background (like-sign pairs) for pT >\n2.2 GeV /c. Right: φ invariant mass spectrum after background subtraction. The curve is a BreitWigner fit.\nB.\n\nφ(1020) identification\n\nφ identification in ALICE was already investigated in Pb-Pb collisions [17]. This study,\nperformed considering a multiplicity of dNch /dy = 6000 using the HIJING generator, illustrates the fact that the identification of the φ resonance is possible in spite of the very large\ncombinatorial background. Indeed, Figure 10 shows accurate calculation of the like-sign\nbackground and signal extraction for pT (φ) > 2.2 GeV/c using a single-track combined PID\nfrom TPC and TOF. The obtained values for the reconstructed mass (1019.60 GeV/c2 ) and\n\n\f2500\n\nsignal\nmixing\n\n2000\n1500\n1000\n\nsignal-mixing\nsimulated\n\n2000\n1500\n1000\n500\n\n500\n0\n\nCounts / (2 MeV/c2)\n\nCounts / (2 MeV/c2)\n\n10\n\n0\n1\n\n1.01\n\n1.02\n\n1.03\n\n1.04 1.05 1.06\n+ Mass(K K ) (GeV/c2)\n\n1\n\n1.01\n\n1.02\n\n1.03\n\n1.04 1.05 1.06\n+ Mass(K K ) (GeV/c2)\n\nFIG. 11: Left: φ invariant mass spectrum (unlike-sign pairs, squares) and estimated background\n(mixed pairs, circles). Right: φ invariant mass spectrum after background subtraction (circles)\nand true signal (crosses). The curve is a Breit-Wigner fit.\n\nwidth (4.32 MeV/c2 ) are compatible with PDG values [16].\n√\nWe now wish to focus on φ identification in p-p at spp = 14 T eV . Single particle PID\ncomes from TPC and TOF. We keep the kaon-candidate tracks that satisfy the two following\nconditions: i) pK > 0.4 and ii) pK > pe , pμ , pπ , pp where pX represents the probability for\na track to be an electron, a muon, a pion, a kaon or a proton. The invariant mass spectra\nobtained from all primary K + K − associations satisfying the condition 0 < pT (φ) < 4 GeV/c\nand −1.5 < y(φ) < 1.5 , are displayed in Figure 11. The background was estimated via\nevent-mixing procedure and then normalised. One can observe that the mixed background is\nin good agreement with the real background except in zones where correlations are expected.\nThe measured mass and width obtained from a Breit-Wigner fit are respectively 1019 and\n5.53 MeV /c2 . The mass is compatible with the expected value 1019 MeV /c2 , but the width\nmeasurement is not as precise (to be compared with 4.26 MeV /c2 ) because of detector\nresolution. The yield calculation using the fit integral reveals a relative discrepancy of\n∼ 2.5% with respect to the number of true φ actually found, which means the calculation is\nrather accurate. The overall reconstruction rate, regardless of the pT and y of the φ, is about\n2.8%. Furthermore, we expect the φ to be identified at least up to pT ∼ 4 GeV /c given that\nthe studies on K ∗ (presented in the previous section) do not reveal any major difficulty to\ndetect kaons in the corresponding momentum range (in which TOF is still efficient). This\nassumption seems to be confirmed by preliminary studies.\n\n\f11\nIV.\n\nCONCLUSIONS\n\nIn these proceedings we have discussed the importance of measuring strange secondary\nvertices and resonances in a broad range of transverse momentum, and have shown how\nALICE will face this challenge thanks to its tracking apparatus and identification methods\ndeveloped for that purpose. From the studies shown here, we conclude that ALICE is\nperfectly suited for the measurement of the strange secondary vertices KS0 , Λ, Ξ and Ω\nin both Pb-Pb and p-p colliding systems. Topological selections have been tuned to get a\ngood compromise between signal and background with a precision on reconstructed invariant\nmasses of a few MeV /c2 and overall efficiencies of ∼ 11% for V0 s and ∼ 0.5% for cascades.\nWe have shown that PID is not mandatory for this measurement, and that these particles\ncan be detected within the very first minutes of LHC run. With statistics as high as the\nones expected for the first runs, they should be identified in a range of pT varying from\nalmost 0 to values of at least 10 GeV /c. We have also shown that strange resonances can be\nmeasured via invariant mass methods, and that the background can be calculated accurately\nwith both like-sign and event-mixing estimators. Concerning the K ∗ , reaching pT 's as high\nas 4 GeV /c is not problematic, and so it should be for the φ. However, the identification of\nhigher-pT resonances should be done without using PID.\nThe tools to identify strange secondary vertices and resonances are ready for the upcoming\ndata in 2008, and we infer they can provide 'first-physics' observables. Within a larger time\nscale, the statistics of strange particles reconstructed with ALICE will by far overstep that\nof previous experiments, and will allow several new studies that were barely achievable up\nto now because of statistics, such as strange high-pT hadron quenching or strange hard-soft\ncorrelations. We believe these fields of research will be among the most exciting ones in\nstrangeness physics.\n\n\f12\n\n[1] J. Rafelski and B. Muller, Phys. Rev. Lett. 48, 1066 (1982).\n[2] A. Tounsi and K. Redlich (2001), hep-ph/0111159.\n[3] A. Andronic, P. Braun-Munzinger, and J. Stachel (2005), nucl-th/0511071.\n[4] P. Braun-Munzinger, J. Cleymans, H. Oeschler, and K. Redlich, Nucl. Phys. A697, 902 (2002),\nhep-ph/0106066.\n[5] R. C. Hwa and C. B. Yang (2006), nucl-th/0602024.\n[6] R. J. Fries, B. Muller, C. Nonaka, and S. A. Bass, Phys. Rev. C68, 044902 (2003), nuclth/0306027.\n[7] R. J. Fries and B. Muller, Eur. Phys. J. C34, s279 (2004), nucl-th/0307043.\n[8] V. Greco, C. M. Ko, and P. Levai, Phys. Rev. Lett. 90, 202302 (2003), nucl-th/0301093.\n[9] J. Adams et al. (STAR) (2006), nucl-ex/0601042.\n[10] B. Hippolyte, Eur. Phys. J. C49, 121 (2007), nucl-ex/0608054.\n[11] J. Adams et al. (STAR), Nucl. Phys. A757, 102 (2005), nucl-ex/0501009.\n[12] R. Vernet et al., CERN-ALICE-INT-2006-011 (2006).\n[13] X.-N. Wang and M. Gyulassy, Phys. Rev. D44, 3501 (1991).\n[14] L. Gaudichet, CERN-ALICE-INT-2005-041 (2005).\n[15] T. Sjostrand, L. Lonnblad, and S. Mrenna (2001), hep-ph/0108264.\n[16] W. M. Yao et al. (Particle Data Group), J. Phys. G33, 1 (2006).\n[17] A. De Caro et al., CERN-ALICE-INT-2003-067 (2003).\n\n\f"}