{"id": "http://arxiv.org/abs/1001.3700v2", "guidislink": true, "updated": "2010-07-06T20:30:29Z", "updated_parsed": [2010, 7, 6, 20, 30, 29, 1, 187, 0], "published": "2010-01-20T23:48:54Z", "published_parsed": [2010, 1, 20, 23, 48, 54, 2, 20, 0], "title": "Landau Levels, Magnetic Fields and Holographic Fermi Liquids", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1001.2664%2C1001.0993%2C1001.1104%2C1001.0406%2C1001.5273%2C1001.4517%2C1001.1478%2C1001.0409%2C1001.4863%2C1001.4881%2C1001.4362%2C1001.4087%2C1001.1312%2C1001.3342%2C1001.0459%2C1001.5180%2C1001.0950%2C1001.4755%2C1001.2499%2C1001.0573%2C1001.3094%2C1001.0221%2C1001.3834%2C1001.0733%2C1001.1664%2C1001.1959%2C1001.3056%2C1001.5177%2C1001.0967%2C1001.4988%2C1001.1116%2C1001.0053%2C1001.4497%2C1001.4687%2C1001.4677%2C1001.3350%2C1001.1773%2C1001.4940%2C1001.1220%2C1001.4759%2C1001.4200%2C1001.3884%2C1001.0059%2C1001.1315%2C1001.1132%2C1001.0611%2C1001.1573%2C1001.2792%2C1001.1300%2C1001.0757%2C1001.4788%2C1001.1947%2C1001.0639%2C1001.0291%2C1001.4000%2C1001.2577%2C1001.3700%2C1001.2691%2C1001.2256%2C1001.2247%2C1001.3618%2C1001.4247%2C1001.4068%2C1001.0245%2C1001.2925%2C1001.2658%2C1001.0722%2C1001.3127%2C1001.2574%2C1001.2308%2C1001.4286%2C1001.0658%2C1001.3547%2C1001.1476%2C1001.2732%2C1001.2271%2C1001.5352%2C1001.4450%2C1001.4961%2C1001.0800%2C1001.1429%2C1001.0167%2C1001.4146%2C1001.0211%2C1001.2328%2C1001.0120%2C1001.2967%2C1001.1541%2C1001.3591%2C1001.0398%2C1001.4933%2C1001.2986%2C1001.2633%2C1001.1158%2C1001.3797%2C1001.0743%2C1001.0290%2C1001.0362%2C1001.2995%2C1001.2102%2C1001.2037&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Landau Levels, Magnetic Fields and Holographic Fermi Liquids"}, "summary": "We further consider a probe fermion in a dyonic black hole background in\nanti-de Sitter spacetime, at zero temperature, comparing and contrasting two\ndistinct classes of solution that have previously appeared in the literature.\nEach class has members labeled by an integer n, corresponding to the n-th\nLandau level for the fermion. Our interest is the study of the spectral\nfunction of the fermion, interpreting poles in it as indicative of\nquasiparticles associated with the edge of a Fermi surface in the\nholographically dual strongly coupled theory in a background magnetic field H\nat finite chemical potential. Using both analytical and numerical methods, we\nexplicitly show how one class of solutions naturally leads to an infinite\nfamily of quasiparticle peaks, signaling the presence of a Fermi surface for\neach level n. We present some of the properties of these peaks, which fall into\na well behaved pattern at large n, extracting the scaling of Fermi energy with\nn and H, as well as the dispersion of the quasiparticles.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1001.2664%2C1001.0993%2C1001.1104%2C1001.0406%2C1001.5273%2C1001.4517%2C1001.1478%2C1001.0409%2C1001.4863%2C1001.4881%2C1001.4362%2C1001.4087%2C1001.1312%2C1001.3342%2C1001.0459%2C1001.5180%2C1001.0950%2C1001.4755%2C1001.2499%2C1001.0573%2C1001.3094%2C1001.0221%2C1001.3834%2C1001.0733%2C1001.1664%2C1001.1959%2C1001.3056%2C1001.5177%2C1001.0967%2C1001.4988%2C1001.1116%2C1001.0053%2C1001.4497%2C1001.4687%2C1001.4677%2C1001.3350%2C1001.1773%2C1001.4940%2C1001.1220%2C1001.4759%2C1001.4200%2C1001.3884%2C1001.0059%2C1001.1315%2C1001.1132%2C1001.0611%2C1001.1573%2C1001.2792%2C1001.1300%2C1001.0757%2C1001.4788%2C1001.1947%2C1001.0639%2C1001.0291%2C1001.4000%2C1001.2577%2C1001.3700%2C1001.2691%2C1001.2256%2C1001.2247%2C1001.3618%2C1001.4247%2C1001.4068%2C1001.0245%2C1001.2925%2C1001.2658%2C1001.0722%2C1001.3127%2C1001.2574%2C1001.2308%2C1001.4286%2C1001.0658%2C1001.3547%2C1001.1476%2C1001.2732%2C1001.2271%2C1001.5352%2C1001.4450%2C1001.4961%2C1001.0800%2C1001.1429%2C1001.0167%2C1001.4146%2C1001.0211%2C1001.2328%2C1001.0120%2C1001.2967%2C1001.1541%2C1001.3591%2C1001.0398%2C1001.4933%2C1001.2986%2C1001.2633%2C1001.1158%2C1001.3797%2C1001.0743%2C1001.0290%2C1001.0362%2C1001.2995%2C1001.2102%2C1001.2037&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We further consider a probe fermion in a dyonic black hole background in\nanti-de Sitter spacetime, at zero temperature, comparing and contrasting two\ndistinct classes of solution that have previously appeared in the literature.\nEach class has members labeled by an integer n, corresponding to the n-th\nLandau level for the fermion. Our interest is the study of the spectral\nfunction of the fermion, interpreting poles in it as indicative of\nquasiparticles associated with the edge of a Fermi surface in the\nholographically dual strongly coupled theory in a background magnetic field H\nat finite chemical potential. Using both analytical and numerical methods, we\nexplicitly show how one class of solutions naturally leads to an infinite\nfamily of quasiparticle peaks, signaling the presence of a Fermi surface for\neach level n. We present some of the properties of these peaks, which fall into\na well behaved pattern at large n, extracting the scaling of Fermi energy with\nn and H, as well as the dispersion of the quasiparticles."}, "authors": ["Tameem Albash", "Clifford V. Johnson"], "author_detail": {"name": "Clifford V. Johnson"}, "author": "Clifford V. Johnson", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1088/1751-8113/43/34/345404", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1001.3700v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1001.3700v2", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "23 pages, 4 figures. Changed some of the terminology: non-separable\n  -> infinite-sum. Clarified the relationship between our ansatz and the\n  separable ansatz", "arxiv_primary_category": {"term": "hep-th", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "hep-th", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1001.3700v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1001.3700v2", "journal_reference": "J.Phys.A43:345404,2010", "doi": "10.1088/1751-8113/43/34/345404", "fulltext": "Landau Levels, Magnetic Fields\n\narXiv:1001.3700v2 [hep-th] 6 Jul 2010\n\nand\nHolographic Fermi Liquids\n\nTameem Albash, Clifford V. Johnson\n\nDepartment of Physics and Astronomy\nUniversity of Southern California\nLos Angeles, CA 90089-0484, U.S.A.\ntalbash, johnson1, [at] usc.edu\n\nAbstract\nWe further consider a probe fermion in a dyonic black hole background in anti–de\nSitter spacetime, at zero temperature, comparing and contrasting two distinct classes\nof solution that have previously appeared in the literature. Each class has members\nlabeled by an integer n, corresponding to the nth Landau level for the fermion. Our\ninterest is the study of the spectral function of the fermion, interpreting poles in it\nas indicative of quasiparticles associated with the edge of a Fermi surface in the holographically dual strongly coupled theory in a background magnetic field H at finite\nchemical potential. Using both analytical and numerical methods, we explicitly show\nhow one class of solutions naturally leads to an infinite family of quasiparticle peaks,\nsignaling the presence of a Fermi surface for each level n. We present some of the properties of these peaks, which fall into a well behaved pattern at large n, extracting the\nscaling of Fermi energy with n and H, as well as the dispersion of the quasiparticles.\n\n1\n\n\f1\n\nIntroduction\n\nRecent work has considerably enriched our detailed knowledge of the kinds of strongly coupled physics that can be studied using holographic studies of charged black holes. Such\nstudies are in fact quite old, since it was realized very shortly after the formulation of the\nAdS/CFT correspondence [1, 2, 3] that electrically charged black holes allow for the study\nof non–trivial strongly coupled physics at finite density or chemical potential[4, 5] at both\nnon–zero and zero temperature. A rich phase structure was uncovered in refs.[4, 5], for\n(finite volume) systems dual to asymptotically AdS spacetime backgrounds with Reissner–\nNordström black holes in diverse dimensions. (See also the related work in refs.[6, 7] on the\nphase structure of certain scalar charged black holes.)\nA decade after those studies a new wave of interest emerged, principally due to key observations about how charged black hole solutions to asymptotically AdS Einstein–Maxwell\nsystems (sometimes coupled to scalars and fermions) may pertain directly to holographic\nmodels of superconductivity [8, 9, 10] and to holographic access to Fermi surfaces[11, 12].\n(Note that the recent focus has been infinite volume system, therefore focusing on flat black\nholes.)\nIn the latter case (refs.[11, 12]) the system that displays Fermi surface behaviour\nis a zero temperature Reissner–Nordström black hole with a probe fermion. The spectral\nfunction GR (ω, k) of the probe fermion in this background was shown, at T = 0 and finite\nchemical potential μ, to exhibit a sharp peak at ω = 0 and finite k(= kF ). This peak has\nbeen interpreted as the quasiparticle pole at the edge of a Fermi surface. Here ω is identified\nwith Fermi energy above the chemical potential, ω = EF − μ. The dispersion associated\nwith this peak was observed to be distinctly non–Landau in a manner consistent with the\nquasiparticles being not effectively free (as in standard Landau theory), but in a strongly\ncoupled phase. This is encouraging, since this type of behaviour is reminiscent of that\nwhich one might hope to gain understanding of in order to gain insight into various novel\nphenomena known from experiment in condensed matter physics (see for example ref.[13]\nfor a review).\nSeveral concerns arise here. Not the least is that the while the results are suggestive,\na quasiparticle peak alone (especially for a minimally coupled non–backreacting fermion) is\nnot damning evidence for a Fermi surface. Some encouragement is to be found in ref. [14]\nwhere they showed that at T 6= 0 the peak broadened as a function of T in the expected\nmanner, but much more evidence is desirable. Another concern is that the parallel studies\nof holographic superconductivity in the literature all strongly indicate that a charged scalar\n2\n\n\fprofile (representing the condensate/order parameter) would have developed at a critical\ntemperature well above T = 0, and so an extremal Reissner–Nordström solution is presumably the wrong object to be studying for the T = 0 physics at μ 6= 0. (In fact, that an\nextremal black hole is probably excluded from this point of the phase diagram was already\nsuggested a decade ago[4], since there is an expected decay channel due to super–radiance\neffects[15], inherited from the fact that the charged black holes are really dimensional reductions of spinning D3–branes.) The approximate holographic superconductivity studied in\nrefs. [8, 9, 10] suggest that at T = 0 the system would be (at best) a scalar–profiled charged\nblack hole (i.e. not Reissner–Nordström) and so one might argue that this is the system to\nwhich the spectral analysis should be applied. However, further study in a fully backreacted\nM–theory context[16, 17, 18, 19] has shown that the black hole nature of the system entirely\nvanishes at T = 0. An AdS background re–emerges at T = 0 instead. This may all fit well\nwith the expectation that if the system has become superconducting below some T = Tc\nthe Fermi surface may well no longer be available, although it remains to be seen what the\nappropriate study might reveal.\nWith all these concerns up front, it is our view that the work of refs. [11, 12] remains\nof considerable value. It is a simple, remarkable system with many of the key features of\ninterest for some of the studies, since away from T = 0, at high enough temperature, a\ncharged black hole will still be relevant. The techniques developed and insights gained in\nthis study, even if the system is not exactly the right one, will be of value in the broader\ncontext.\nIn this spirit, we continue the study that we began of the Reissner–Nordström system\nand the putative Fermi surface in the presence of a background magnetic field H. In our\nfirst paper[20], we studied a dyonic black hole, the magnetic component now playing the role\nof an external magnetic field of the system. On general grounds, one expects the system\nto develop an infinite set of Landau levels, the quantized energy levels of the fermions in\nthe magnetic field. Our first paper studied the lowest Landau level, and already we saw\ninteresting physics, including multiple quasiparticle peaks and a magnetic field dependence\nin the dispersion characteristic of the peaks.\nThe non–zero magnetic field case has peaks appearing at ω = EF − μ 6= 0 since\nnow the energy of the fermions has been increased as compared to the H = 0 system, for\na given μ. So even for the lowest Landau level, the peak is at ω 6= 0, as we saw in ref.[20].\nThis lowest Landau level has a boundary condition for the probe fermion at the horizon that\nis constructed from the zeroth Hermite function. In this paper we will study more general\n\n3\n\n\fboundary conditions corresponding to the nth Hermite function, and we find a family of\nquasiparticle peaks signalling the presence of a Fermi surface at each such n. Each value\nof n, for fixed chemical potential μ, is a distinct Landau level for the probe fermion.\nThere are two distinct classes of solution that we present and study here. One class is\nseparable (section 3.1) and the other can be understood as an infinite sum of the separable\nsolutions (section 3.2). The first, adopted in the work of refs.[21, 22], does not have a smooth\nlimit to the H = 0 case (for general momentum kx ). As a result, we find it less compelling\nas a basis for the generalization of the results and methods of ref.[11] for the purposes of\nidentifying Fermi surfaces by searching for quasiparticle peaks, since the method requires that\nthe location (in (ω, k)) of the peaks in the spectral function GR (ω, k) (generically appearing\nat non–zero kx ) be read off from the system, and not fixed by hand. We stress that there\nis nothing wrong with studying the separable class of solutions, for the appropriate kind of\nphysics of interest. Rather, we are noting that it does not connect to the H = 0 physics in a\nway that allows an analysis of the Fermi surface physics in the spirit of the prototype case of\nref.[11]. Following from this, we note in section 3.1 that the choices made in ref.[21], when\ntaken to their logical conclusion (performing the required Fourier transform to construct the\nspectral function), lead to no quasiparticle peaks at all. By contrast, the infinite–sum class,\nwhich we began the study of in ref.[20], has a smooth limit to the H = 0 case, as we discuss\nin section 3.2, and we carry out the search for quasiparticle peaks and display our results in\nsection 4.\n\n2\n\nFree Fermions in a Magnetic Field\n\nTo set the stage and for later comparison with the more complicated case, we begin by\nstudying a free fermion with mass m charged under a global U (1). The Dirac action is:\nZ\n\u0001\n(1)\nSD = i d3 x Ψ̄γ μ Dμ Ψ − mΨ̄Ψ ,\nwhere Dμ = ∂μ − iqAμ is the covariant derivative. The classical equations of motion are\ngiven by:\n(γ μ Dμ − m) Ψ = 0 .\n\n(2)\n\nLet us first consider the case of zero magnetic field, taking only At = −μ to be non–zero. If\nwe choose:\nγ 0 = −iσ3 ,\n\nγ 1 = σ2 ,\n\n4\n\nγ 2 = −σ1 ,\n\n(3)\n\n\fand take an ansatz of the form:\n−iωt+ikx x\n\n\u0012\n\nΨ=e\n\nφ+ (ω, kx )\nφ− (ω, kx )\n\n\u0013\n,\n\n(4)\n\nthen the equations of motion reduce to (for m = 0):\n(ω − qμ) φ± − kx φ∓ = 0 .\n\n(5)\n\nkx = ω − qμ with φ+ = φ− ,\n\n(6)\n\n−kx = ω − qμ with φ+ = −φ− .\n\n(7)\n\nThe solutions are then given by:\n\nNote in particular that at kx = 0, the non–trivial solution is simply ω − qμ = 0 with no\nrestriction on φ± (ω, kx ).\nLet us now consider turning on a magnetic field. Taking Ax = −yH, and following\na similar procedure as above (with φ± now depending on y as well), we find as equations of\nmotion:\n∂y φ± + mφ∓ ± (kx + Hqy) φ∓ = (ω − qμ) φ∓ .\nLet us assume at present that Hq > 0 and m = 0 and define a new coordinate η as:\n\u0012\n\u0013\np\nkx\n,\nη = Hq y +\nHq\nin terms of which the equation of motion simplifies to:\np\nHq (∂η φ± ± ηφ∓ ) = ± (ω − qμ) φ∓ .\n\n(8)\n\n(9)\n\n(10)\n\nIf we consider solutions of the form:\nφ+ = c(ω, kx )In (η) ,\n\nφ− = c(ω, kx )In−1 (η) ,\n\n(11)\n\nwhere In are the standard Hermite functions defined in terms of the Hermite polynomials\nHn as :\n\n1\n−η 2 /2\nIn (η) ≡ Nn Hn = p\nHn (η) ,\n√ e\nn\n2 n! π\n\n(12)\n\nwe have the requirement that:\np\n2Hqn = ω − qμ .\n\n(13)\n\nAnother solution is given by:\nφ+ = c(ω, kx )In (η) ,\n\nφ− = −c(ω, kx )In−1 (η) ,\n5\n\n(14)\n\n\fThe solutions for the fields are the same as before, but now we have the requirement:\n−\n\np\n2Hqn = ω − qμ .\n\n(15)\n\nLet us now consider the case of Hq < 0. The analysis is mostly the same, except that we\nnow define η as:\n\u0012\n\u0013\np\nkx\nη = − −Hq y +\nHq\n\n(16)\n\nThis modifies the equation of motion to:\np\n−Hq (∂η φ± ∓ ηφ± ) = ∓ (ω − qμ) φ∓ .\nThe solutions to this equation are given by:\n\n φ+ (ω, kx , y) = c(ω, kx )In−1 (η) ,\n√\n\n\nand\n\nφ− (ω, kx , y) = c(ω, kx )In (η) ,\n(18)\n\n−2Hqn = ω − μq ,\n\n\n φ+ (ω, kx , y) = c(ω, kx )In−1 (η) ,\n\nφ− (ω, kx , y) = −c(ω, kx )In (η) ,\n\n√\n− −2Hqn = ω − μq .\n\n\n\n(17)\n\n(19)\n\nIn particular, we note that flipping the sign on the magnetic field interchanges the η dependence for φ± .\nFinally, let us study the zero magnetic field limit, which is a delicate issue. We first\npoint out that the coordinate change presented in equation (9) is singular in the limit of zero\nmagnetic field, so it is not a particularly good basis for studying this limit. However, one\nmight think that in order for the restriction on ω to match, we have to choose:\n\u0010 p\n\u0011\nlim ± 2|Hq|n = ±kx = fixed .\nH→0\n\n(20)\n\nHowever, in this limit, the functions In behave as:\n1\n\n1\n\n1\n\nn\n\nIn (η) ∼ π − 2 2n− 4 n− 4 e∓kx y− 2 ,\n\n(21)\n\nso both φ+ and φ− vanish in the limit of large n. This does not match the zero magnetic\nfield solution we found earlier. We can perhaps compensate for this vanishing by including\nan n–dependent overall normalization of our fields φ± , but we emphasize that this issue is\nnot present when kx = 0. There, no special limit needs to be taken on n and the Hermite\nfunctions go to a constant in the limit of H → 0. This sort of property will occur in our\n6\n\n\ffull probe fermion problem later, for one class of solutions (separable) that we will discuss.\nThere will be another class of solutions (infinite–sum) that will not suffer from this limitation,\nhaving a smooth H = 0 limit for arbitrary kx . This latter class is naturally amenable to\nbeing used to search for Fermi surfaces by looking for quasiparticle peaks in the spectral\nfunction, since these peaks will naturally occur at non–zero kx which we wish to read off as\noutput, and not fix a priori.\n\n3\n\nProbing the Black Hole\n\nOur probe is a Dirac fermion in an asymptotically AdS4 dyonic black hole background. It is\ncharged under the background's U (1), and the metric and fields are given by:\n\u0001 L2 dz 2\nL2 α 2\n2\n2\n2\n−f\n(z)\ndt\n+\ndx\n+\ndy\n,\n(22)\n+ 2\nz2\nz f (z)\nF = 2Hα2 dx ∧ dy + 2Qαdz ∧ dt ,\n\u0001\n\u0001\n\u0001 \u0001\nf (z) = 1 + H 2 + Q2 z 4 − 1 + H 2 + Q2 z 3 = (1 − z) z 2 + z + 1 − H 2 + Q2 z 3 .\nds2 =\n\nThe parameter α has dimensions of inverse length. The negative cosmological constant sets\nthe length scale L, Λ = −3/L2 , and the Einstein–Maxwell action is:\n\u001a\n\u001b\nZ\n√\n6\nL2 2\n1\n4\n,\nSbulk = 2 d x −G R + 2 − F\n2κ4\nL\n4\n\n(23)\n\nwhere we use signature (− + ++), and κ24 = 8πGN . The mass per unit volume and temperature of the background are given by:\nε=\n\nα3 L2\n[1 + Q2 + H 2 ] ,\n2\nκ4\n\nT =\n\nα\n[3 − (Q2 + H 2 )] .\n4π\n\n(24)\n\nThe coordinates we have chosen above in equation (22) are such that the boundary of AdS4\n(where the dual (2 + 1)–dimensional theory is defined in the ultraviolet) is at z = 0 while\nthe horizon of the black hole is at z = 1.\nWe choose a gauge such that:\nAt = 2Qα(z − 1) ,\n\nand Ax = −2Hα2 y ,\n\n(25)\n\nwhich sets a chemical potential μ = −Qα and a magnetic field H = −2Hα2 . We choose to\nwork at zero temperature, which restricts Q and H to satisfy:\nH 2 + Q2 = 3 .\n7\n\n(26)\n\n\fAs discussed in our first paper[20], it is important to realize that this equation does not place\na restriction on the magnetic field for a given value of Q. The important quantity to hold\nfixed while varying the magnetic field is the chemical potential μ, and as Q decreases for\nincreasing H, α increases to compensate, resulting in the physical magnetic field H being\nable to run its full natural range from zero to infinity.\nNow z is dimensionless in our equations above while all the other coordinates are\ndimensionful. For convenience, in what follows we will rescale our fields and coordinates to\ndimensionless quantities:\nt → t/α ,\n\nx → x/α ,\n\ny → y/α ,\n\nAt → αAt ,\n\nand Ax → α2 Ax .\n\nThe Dirac action for our probe fermion is:\nZ\n√\n\u0001\nSD = i d4 x −G Ψ̄ΓM DM Ψ − mΨ̄Ψ ,\n\n(27)\n\n(28)\n\nwith the covariant derivative DM given by:\n1\nDM = ∂M + ωabM Γab − iqAM ,\n4\n\n(29)\n\nwhere we have used vielbeins eM\na to exchange curved spacetime indices {M, N } for tangent\nspace indices {a, b}, and\n1\nΓab ≡ [Γa , Γb ] ,\n2\n\nO N\nωabM ≡ eN\na ∂M ebN − ea N eb ΓOM .\n\n(30)\n\nThe fermion couples to an operator of dimension ∆ = m + d/2 in the (2 + 1)–dimensional\ntheory. We will later choose the case m = 0 for much of the treatment we will do in this\npaper. We choose for our Gamma matrices:\n\u0012\n\u0013\n\u0012\n\u0013\n−iσ2\n0\n−σ3 0\nt\nx\nΓ =\n, Γ =\n,\n0\n−iσ2\n0 σ3\n\u0012\n\u0013\n\u0012\n\u0013\n0 −iσ3\n−σ1 0\ny\nz\nΓ =\n, Γ =\n,\niσ3\n0\n0 −σ1\n\n(31)\n\nwhere the σi are the standard Pauli matrices.\nWe write the Dirac spinor in terms of two 2–component spinors:\nΨT = z 3/2 f (z)−1/4 e−iωt+ikx x (φ1 , φ2 ) ,\nand the equation of motion reduces to:\nr\n\u0011\n\u0010\n\u0011\ngxx \u0010\nm\n1\n1\n1\n2\n1\n∂z φ2 + σ1 φ2 + iuσ3 φ2 ± σ2 ∂y φ1 + (kx + 2Hqy) φ2 = 0 ,\ngzz\nz\n8\n\n(32)\n\n(33)\n\n\fwith:\n\nr\n\nr\n\ngxx p\n= f ,\ngzz\n\nr\n\ngxx\n1\n=√ .\n−gtt\nf\nNear the AdS boundary, the solutions to this equation asymptote to:\n\u0012 \u0013\n\u0012\n\u0013\n1\n−1\n−m\nlim φ1 (y, z) = a12 (y)\nz + b12 (y)\nzm .\n1\n1\nz→0 2\nu=\n\ngxx\n(ω + 2qQ(z − 1)) ,\n−gtt\n\nWe can define 4–component spinors φ± that have eigenvalues ±1 under Γz :\n\u0012\n\u0013\n1 (1 ∓ σ1 ) φ1 (y, z)\n1\nz\n.\nφ± (y, z) = (1 ± Γ ) Ψ(y, z) =\n2\n2 (1 ∓ σ1 ) φ2 (y, z)\nIn the limit of z → 0, φ± asymptote to:\n\n−b1\n\nb1\nφ+ (y, z) = z m \n −b2\nb2\n\n\n\n\na1\n a1 \n\nφ− (y, z) = z −m \n a2  .\na2\n\n(34)\n\n(35)\n\n(36)\n\n\n\n\n ,\n\n\n(37)\n\nUsing the prescription of ref. [23] to calculate the retarded Green function (the spectral\nfunction of interest), we write:\n−b̃1\n\n b̃1 \n=S\n\n\n −b̃2 \nb̃2\n\n\n\n\n\n\n\n\n\n\n0\n\nã1\n b̃1\n\nã1 \n =  ã1\nã2  \n 0\nã2\n0\n\n− ãb̃11\n0\n0\n0\n\n0\n0\n0\nb̃2\nã2\n\n0\n0\n− ãb̃22\n0\n\n\n\n\n\n ã1\n  ã1 \n\n\n  ã2  ,\n\nã2\n\n(38)\n\nwhere ã and b̃ are the Fourier transform in the y–direction of a and b respectively and hence\nfind for the retarded Green function:\n\n\nb̃1\nã1\n\n0\n\n\n 0\nGR = −iSΓ = i \n 0\n\n0\n\nb̃1\nã1\n\nt\n\n0\n0\n\n0\n0\nb̃2\nã2\n\n0\n\n0\n0\n0\nb̃2\nã2\n\n\n\n\n .\n\n\n\n(39)\n\nThe dual (boundary) field theory should have half the components that the bulk theory has,\nand this is reflected in the Green function by having only two independent terms. Finally, if\nwe write:\n\n\u0012\nφ1 =\n\nA1\nB1\n\n\u0013\n\n\u0012\n,\n\nand φ2 =\n\nA2\nB2\n\n\u0013\n,\n\n(40)\n\nthen the functions (a12 , b12 ) can be written:\n\u0011\n\u000fm \u0010\nB12 (y, \u000f) + A12 (y, \u000f) ,\n\u000f→0 2\n\na12 (y) = lim\n\n\u0011\n\u000f−m \u0010\nB12 (y, \u000f) − A12 (y, \u000f) ,\n\u000f→0 2\n\nb12 (y) = lim\n9\n\n(41)\n\n\f(with analogous expressions for the Fourier transforms (ã, b̃), with (Ã, B̃) instead of (A, B))\nsuch that the relevant Green function quantities are simply:\n(1)\n\nGR (ω, kx , ky ) = lim i\u000f−2m\n\u000f→0\n\nB̃1 − Ã1\n,\nB̃1 + Ã1\n\nB̃2 − Ã2\n.\nB̃2 + Ã2\n\n(42)\n\nB12 = eiω/(6(1−z)) (1 − z)i(6qQ−4ω)/18 B± .\n\n(43)\n\n(2)\n\nGR (ω, kx , ky ) = lim i\u000f−2m\n\u000f→0\n\nTo solve for the fields A12 , B12 , we define:\nA12 = eiω/(6(1−z)) (1 − z)i(6qQ−4ω)/18 A± ,\nThe equations of motion\n\u0012\nr\niω\ngxx\n∂z +\ngzz\n6(1 − z)2\n\u0012\nr\niω\ngxx\n∂z +\ngzz\n6(1 − z)2\n\u0012\nr\ngxx\niω\n∂z +\ngzz\n6(1 − z)2\n\u0012\nr\niω\ngxx\n∂z +\ngzz\n6(1 − z)2\n\nfor the fields (A± , B± ) when m = 0 is given by:\n\u0013\n−6qQ + 4ω\nA+ = −iuA+ + i (∂y B− + (2Hqy + kx )B+ ) ,\n+i\n18(1 − z)\n\u0013\n−6qQ + 4ω\n+i\nA− = −iuA− − i (∂y B+ + (2Hqy + kx )B− ) ,\n18(1 − z)\n\u0013\n−6qQ + 4ω\n+i\nB+ = +iuB+ − i (∂y A− + (2Hqy + kx )A+ ) ,\n18(1 − z)\n\u0013\n−6qQ + 4ω\n+i\nB− = +iuB− + i (∂y A+ + (2Hqy + kx )A− ) .\n18(1 − z)\n(44)\n\nThese are the equations of motion we presented in ref. [20]. Expanding the equations of\nmotion at the event horizon, we find (for ω 6= 0) the following conditions:\nA± (y, 1) = 0 ,\n√\n\n(45)\n\n6\n(kx B± (y, 1) + ∂y B∓ (y, 1) + 2HqyB± (y, 1)) ,\n2ω\n√\n−i \u0010\n∓18 6 (kx ∂z A± (y, 1) + ∂z (∂y A∓ (y, 1) + 2HqyA± (y, 1)))\n∂z B± (y, 1) =\n108\n+ (48qQ − 23ω) B± (y, 1)) .\n∂z A± (y, 1) = ∓\n\n(46)\n\n(47)\n\n(There are analogous equations for ω = 0, but we do not list them here since we will not find\nquasiparticle peaks at ω = 0.) There is some freedom in choosing the boundary conditions\nfor the fields, leading to very different physics. We present two particular choices in the next\ntwo sections.\n\n3.1\n\nSeparable Solutions\n\nWe restrict ourselves at present to qH > 0. Changing coordinates to:\n\u0012\n\u0013\np\nkx\nη = 2Hq y +\n,\n2Hq\n10\n\n(48)\n\n\fwe can write the y–dependent parts of our equations above as:\np\n2Hq (∂η B± + ηB∓ ) ,\n∂y B± + (2Hqy + kx )B∓ =\np\n∂y A± + (2Hqy + kx )A∓ =\n2Hq (∂η A± + ηA∓ ) .\n\n(49)\n(50)\n\nThere are two possible ansätze that we can make:\nansatz 1 : A− = −A+ = −YA (y)ZA (z) ,\n\nB− = B+ = YB (y)ZB (z) ,\n\n(51)\n\nB− = −B+ = −YB (y)ZB (z) .\n\n(52)\n\nor\nansatz 2 : A− = A+ = YA (y)ZA (z) ,\n\nWe emphasize that the ansatz with A− = A+ and B− = B+ is not consistent with the first\norder equations. Let us start with the first ansatz. If we write:\n√\n2nYA ,\n∂η YB + ηYB =\n√\n∂η YA − ηYA = − 2nYB ,\n\n(53)\n(54)\n\nthen the solution takes the form:\nYA = In−1 (η) ,\n\nYB = In (η) ,\n\n(55)\n\nwhere In is the Hermite function defined in section 2. Note that I−1 = 0. With this ansatz1 ,\nthe equations of motion in the bulk become:\n\u0012\n\u0013\nr\np\ngxx\n−6qQ + 4ω\niω\n+\ni\n∂z +\nZ\n=\n−iuZ\n+\n2i\nHqnZB ,\nA\nA\ngzz\n6(1 − z)2\n18(1 − z)\n\u0012\n\u0013\nr\np\n−6qQ + 4ω\ngxx\niω\n+\ni\n∂z +\nZ\n=\n+iuZ\n−\n2i\nHqnZA .\nB\nB\ngzz\n6(1 − z)2\n18(1 − z)\n\n(56)\n\nIf we consider the second ansatz, we can write:\n√\n∂η YB − ηYB = − 2nYA ,\n√\n∂η YA + ηYA =\n2nYB ,\n\n(57)\n(58)\n\nwhich has solutions given by:\nYA (y) = In (η) ,\n\nYB (y) = In−1 (η) ,\n\n1\n\n(59)\n\nThese are the separable solutions discussed in refs. [21, 22], and they are somewhat analogous to the\nstandard separable free fermion case reviewed in section 2. We considered them in our work in ref.[20] for\nn = 0, but focused on the infinite–sum solutions for the rest of that paper. The lack of a smooth H = 0\nlimit for kx 6= 0, combined with the desire to seek quasiparticle peaks at non–zero kx , led us away from these\nseparable cases. We will discuss this more below.\n\n11\n\n\fand the equations of motion reduce to equations (56), the same set of equations of motion that\nresulted from the first ansatz. So in this case, the behavior in the z direction is independent\nof our choice. We will return to the issue of this freedom later.\nWe proceed with calculating the Green function given by equation (42), where all the\nfields have been Fourier transformed in both (x, y) coordinates. Note that in the analysis of\nref. [21], no Fourier transform was performed for the y coordinate. The Fourier transform of\nthe Hermite functions is given by:\nr\n\u0012\n\u0013\nZ ∞\n\u0010\n\u00112\nky\nkx\n2π\nky\n√\ni\n−iky y\nn − √2Hq /2\n2Hq\ndye\nIn (η) = e\nNn (−i) e\nHn √\n,\n2Hq\n2Hq\n−∞\n\n(60)\n\nwhere the normalization Nn was given in equation (12).\nLet us compare to the results and methods of ref. [11], where H = 0. There, the\nchoice ky = 0 is made, and we can examine the physics of the solution we have here at\nH 6= 0 for ky = 0 to see how it connects. If we restrict to ky = 0, we find that for n odd, the\nFourier transform of In (η) vanishes. Therefore, when n is even, only B̃± (kx , ky = 0) survive\nwhen using the first ansatz, whereas only Ã± (kx , ky = 0) survive when using the second\nansatz. When instead n is odd, only Ã± (kx , ky = 0) survive for the first ansatz and only\nB̃± (kx , ky = 0) survive when using the second ansatz. Therefore, if we wish our retarded\nGreen function to be positive, we must use the first ansatz to describe even modes and the\nsecond ansatz to describe odd modes. This gives:\nGR (ω, kx , ky = 0)(1),(2) = i .\n\n(61)\n\nLet us now consider the H → 0 limit of our solutions. As shown earlier for the free fermion\nin 2+1 dimensions, the Hermite functions in terms of η do not have nice behavior as H → 0.\nFurthermore, the Green function presented above in the H → 0 limit cannot match the\nresults presented in ref. [11], since their results at H = 0 are a constant only at kx = 0.\nTherefore, these results suggest that this choice of solutions (used, crucially, in ref.[21] to\ndiscuss Fermi surfaces) is not connected to the pole found in ref. [11] at H = 0, but they\nform a separate set of solutions present at non–zero magnetic field.\nWe complete our discussion of this set of solutions by considering the case of qH < 0.\nThe coordinate change is now given by:\n\u0012\n\u0013\np\nkx\nη = − −2Hq y +\n.\n2Hq\n\n12\n\n(62)\n\n\fUnder the change of variables, the y–dependent part becomes:\np\n∂y B± + (2Hqy + kx )B∓ = − −2Hq (∂η B± − ηB∓ ) ,\np\n∂y A± + (2Hqy + kx )A∓ = − −2Hq (∂η A± − ηA∓ ) .\n\n(63)\n\nIf we now consider our two ansätz from before, we find that ansatz 1 results in:\nB+ (y, z) = B− (y, z) = ZB (z)In−1 (η) ,\n\nA+ (y, z) = −A− (y, z) = ZA (z)In (η) ,\n\n(64)\n\nA+ (y, z) = A− (y, z) = ZA (z)In−1 (η) .\n\n(65)\n\nand ansatz 2 gives:\nB+ (y, z) = −B− (y, z) = ZB (z)In (η) ,\n\nBoth these ansätze give exactly the same equation of motion as before with the appropriate\nmodification under the square root:\n\u0012\n\u0013\nr\np\ngxx\niω\n−6qQ + 4ω\n+i\n∂z +\nZA = −iuZA + 2i −HqnZB ,\n2\ngzz\n6(1 − z)\n18(1 − z)\n\u0012\n\u0013\nr\np\ngxx\niω\n−6qQ + 4ω\n−HqnZA .\n∂z +\n+\ni\nZ\n=\n+iuZ\n−\n2i\nB\nB\ngzz\n6(1 − z)2\n18(1 − z)\n\n(66)\n\nIn turn this suggests that when Hq < 0, the even modes are associated with ansatz 2 and\nthe odd modes are associated with ansatz 1. This is the opposite of what occurred when\nHq > 0.\nLet us summarize our results so far:\n\n\nZA In−1\n\n\n\n\n\nZB In\n\n\nansatz 1(n even) \n\n\n\n−ZA In−1\n\n\n\n\nZB In\n\nqH > 0\n\n\n\nZA In\n\n\n\n\n ZB In−1\n\n\nansatz 2(n odd) \n\n\n ZA In\n\n\n\n−ZB In−1\n\n\n\n\n\n, qH < 0\n\n\n\n\n\n\n\nZA In\n\n\n\n\n\nZ\n\nB In−1\n\nansatz 1(n odd) \n\n\n\n−ZA In\n\n\n\n\nZB In−1\n\n\n\n\n\n\n\nZA In−1\n\n\n\n\n ZB In\n\n\nansatz 2(n even) \n\n\n ZA In−1\n\n\n\n−ZB In\n\n\n\n\n\n\n.\n\n\n\n(67)\n\nNote the close similarity between these results and the results found for the free fermion\nin 2 + 1 dimensions. We find here that for a given ansatz, the single Dirac spinor in the\n(3 + 1)–dimensional background contains both solutions that were found for the free fermion.\nUnder the flip of the magnetic field for a given ansatz, we find the same flipping of the η\ndependence between each 2–component spinors. In addition, the flipping of the magnetic\nfield interchanges the roles of the two ansätze for describing the modes, which suggests that\nthey may describe aligned vs. anti–aligned couplings. These results indicate that the even\nmodes and odd modes should be understood as describing two distinct ladders.\n13\n\n\f3.2\n\nInfinite–Sum Solutions\n\nThe separable solutions presented so far have two unfortunate features. Because of the\nsolutions' dependence on the coordinate η, the solutions have singular behavior in the zero\nmagnetic field limit. To connect these solutions to the zero magnetic field solution, one\nhas to take a limit similar to that of equation (20), where the Landau level label n goes to\ninfinity:\nlim\n\nH→0,n→∞\n\np\n4Hqn = kx\n\n(68)\n\nIndependent of this fact, considering the separable solutions alone leads to a trivial Green\nfunction, as presented in equation (61).\nWe wish to proceed by studying a class of solutions that avoids these two features. In\norder to avoid singularities associated with the coordinate η , we wish to consider solutions\nthat depend on the coordinate y as opposed to η. Let us take the case of Hq > 0. Motivated\nby the separable solutions discussed earlier, focusing on the behaviour at the horizon (z = 1),\nwe consider B± (y, 1) = B(y, 1) for even n and B+ = −B− = B(y, 1) for odd n. For n even\nwe take:\np\np\n∂y B(y, 1) + 2HqyB(y, 1) = 4HqnB0 (1)In−1 ( 2Hqy) ,\n(69)\n√\nsuch that we have B(y, 1) = B0 (1)In ( 2Hqy). We can write this ansatz in terms of our\nseparable solutions from the previous section,\nB+ (y, z) =\n\n∞\nX\n\n(n)\n\n(n)\n\nb+ ZB (z)In (η) ,\n\n(70)\n\nn=0\n(n)\n\nand similarly for the other fields. The coefficients b+ can be determined from the field\n√\n(n)\nbehavior at the event horizon. For example, for B(y, 1) = I0 ( 2Hqy), the coefficients b+\nare given by:\n(n)\n\nb+ =\n\n2\nkx\nkn\np x n e− 8Hq .\n2n (Hq) n!\n\n(71)\n\nIn the limit of H → 0, the infinite sum remains finite without requiring us to take a limit of\nthe form of equation (68). We do not need to take n → ∞ since the infinite sum effectively\ndoes this by defining a new Landau level labeling in terms of an infinite sum of the Landau\n√\nlabels of the separable solutions (i.e. the labeling of In ( 2Hqy) instead of In (η)). Because\nof the nature of the infinite sum, it is important to first perform the sum and then take the\nlimit of H → 0 to ensure the correct result. We emphasize that the infinite sum gives us\nthe freedom to vary the new Landau level label as well as kx independently while sending\n\n14\n\n\fH → 0, a freedom we did not have with the separable solutions presented earlier. This is an\nimportant difference from the separable solutions we considered in the previous section.\nBy substituting the series form of the fields from equation (70) into the equations of\nmotion, the partial differential equation becomes an infinite series of coupled ordinary dif(n)\n\nferential equations for ZA,B , where the coupled equations are identical to those of equations\n(56). We have traded the partial differential equation for an infinite number of coupled ordinary differential equations. We choose to proceed by solving the partial differential equation\nusing an ansatz that is not explicitly separable since this is more tractable numerically.\nWith this ansatz, we find that:\n√ \u0010\n\u0011\np\np\np\n6\nkx In ( 2Hqy) + 4HqnIn−1 ( 2Hqy) B0 (1) .\n(72)\n∂z A± (y, 1) = ∓\n2ω\n√\nWe notice that for kx = 0, we find that ∂z A± (y, 1) ∝ In−1 ( 2Hqy), which agrees with the\nseparable solution from the previous section. Finally, we have:\n\u0012\n\u0011\np\np\n−iB0 (1) 54 \u0010 2\n∂z B± =\nkx In + kx 4HqnIn−1 + kx 4Hq(n + 1)In+1 + 4HqnIn\n108\nω\n+ (48qQ − 23ω) In ) ,\n(73)\nwhere we have used that:\np\np\np\n∂y In ( 2qHy) − 2qHyIn ( 2qHy) = − 4qH(n + 1)In+1 .\n\n(74)\n\n√\nNote again that for kx = 0, we recover that ∂z B± (y, 1) ∝ In ( 2Hqy) which is the single\nseparable solution presented earlier. In addition, note that for n = 0 we recover the equations\nthat we had in ref. [20]. For n odd, we take:\np\np\n∂y B(y, 1) − 2HqyB(y, 1) = − 4HqnB0 (1)In ( 2Hqy) ,\n\n(75)\n\n√\nsuch that we have B(y, 1) = B0 (1)In−1 ( 2Hqy). With this ansatz, we find that:\n√ \u0010\n\u0011\np\np\np\n6\n∂z A± (y, 1) = −\nkx In−1 ( 2Hqy) + 4HqnIn ( 2Hqy) B0 (1) ,\n2ω\n\u0012\n\u0011\np\np\niB0 (1) 54 \u0010 2\n∂z B± = ∓\nkx In−1 + kx 4HqnIn + kx 4Hq(n − 1)In−2 + 4HqnIn−1\n108\nω\n+ (48qQ − 23ω) In−1 ) .\n(76)\nThe advantage of this choice over the finitely separable choice from the previous section\nis that in the H → 0 limit, the equations of motion and fields reduce to those of ref.[11]\n15\n\n\fwith no restrictions placed on n. In addition, since at kx = 0, the fields reduce to the simple\nseparable case discussed earlier, we can immediately write the Green function for this special\ncase:\nGR (ω, kx = 0, ky = 0)(1),(2) = i ,\n\n∀H ,\n\n(77)\n\nwhich connects nicely with the zero magnetic field ~k = 0 result of ref.[11]. Furthermore, for\nkx 6= 0, ky = 0, the Green function gives a non–trivial result, as opposed to the separable\ncase which gave a trivial result (see equation (61)).\nThis infinite–sum class of solutions, which we studied in ref.[20] at n = 0, is a more\nnatural generalization of the results of ref.[11] and better adapted to the method of searching\nfor new quasiparticle peaks, which generically appear at non–zero kx .\n\n3.3\n\nComments about Complex ω\n\nBefore proceeding with our numerical results, we would like to make a few comments about\nthe variable ω. In the usual AdS/CFT dictionary, it is important to recall that ω is generally\ncomplex:\nω = ω∗ − iΓ\n\n(78)\n\nThe quantity Γ is related to the inverse lifetime of the quasinormal mode and ω∗ is related\nto the energy of the mode. The imaginary part of ω must be negative in order for the mode\nto be stable. In addition, in order for the pole in the Green function to be associated with\na quasiparticle, the pole must have non–zero residue. In our analysis, we restrict ourselves\nto Γ = 0, and therefore our search for poles is such that the lifetime of the mode is always\ninfinite. Away from the poles, the numerical results should not be taken too seriously since\naway from the poles, one should consider a complex ω and not a purely real ω. This is relevant\nbecause in our numerics the poles occur immediately after a region where the imaginary part\nof the Green function is negative, which is not allowed if the theory is unitary. We believe\nthat the proper treatment of the complex ω in these regions would resolve this. In particular,\nthe analysis in ref. [22] shows that the pole for H = 0 bounces off the real axis, and in the\npurely real analysis the imaginary part of the Green function remains positive on both sides\nof the pole. Therefore, our result suggests that the bounce does not occur at the real axis\nbut somewhere in the positive imaginary ω regime. This suggests that for Re(ω) less than\nour pole, the mode is unstable. In addition, we have not calculated the residue of our\npoles as this is impossible without having the full complex ω description of the quasinormal\nmodes. Therefore, our poles have not been shown conclusively to be quasiparticles. However,\n\n16\n\n\fin ref. [20], the pole studied there was the direct perturbation of the quasiparticle pole in\nref. [11] under a magnetic field (meaning that zero magnetic field limit matched) and the\nperturbed pole occurred at non–zero ω. In that case, since the H = 0 pole was a quasiparticle,\nit followed that the H 6= 0 pole would also be a quasiparticle. Therefore, in the analysis that\nis presented next, the fact that the poles occur at non–zero ω is not entirely surprising, and\nthey have a chance of being real quasiparticle excitations.\n\n4\n\nNumerical Results for the Quasiparticle Spectrum\n\nWe employ the numerical methods that we presented in our earlier paper[20] to seek solutions\nand explicitly construct the spectral function GR (ω, k), using the more general boundary\nconditions we have discussed in section 3.2 for the infinite–sum class of solutions. We refer\nthe reader there for the details of our methods, and here present our observations.\nFirst, we notice that for the first four n, (n = 0, . . . , 3) we find two peaks (signalling\nthe presence of poles in the spectral function) for a given n. We observed the pair at n = 0 in\nour earlier paper[20], and this structure persists for a few levels before disappearing, leaving\nonly single poles for every n beyond n = 3. In each case where there is a pair, the poles\nfall into two classes. One class appears to be a deformation of the prototype pole found in\nref. [11]. This type is found at smaller ω. The other, found at larger ω and kx , appears\nto be in the same class as the lone poles present at large n, fitting into a smooth curve of\nprogression. We present the first class of poles in figure 1 and the second class of poles in\nfigure 2. In all figures, ω∗ is used to denote the value of ω at which the peak is located. (In\nboth figures we colour code even n poles with blue and odd n with red.) Notice that for the\nfirst class of poles the even n poles are at higher ω while for the second class of poles it is\nthe other way around. The behavior of the first poles (at n = 0) was studied extensively in\nΩ*\nn=2\n\n0.04\n\nn=0\n\n0.03\n0.02\n0.01\nn=3\n0.2\n\nn=1\n0.4\n\n0.6\n\n0.8\n\nkx\n\nFigure 1: The first (finite) class of peaks for a specific value of magnetic field set by H = −0.1.\n\n17\n\n\fref. [20] as a function of H, and we expect similar behaviour here for n = 1, 2, 3. Therefore\nwe focus on the second class of poles, which persists for all Landau levels n, in what follows.\nWe present some results for fixed H and varying n in figure 2. (Recall that the physical\nmagnetic field is H = −2α2 H.) We note that the behavior of the poles in ω∗ vs. n becomes\nmore predictable at higher n. In addition, we note that for Hq > 0, we find that the solutions\nwith ansatz 2 (associated with the odd ns) have a larger ω∗ than the solutions with ansatz 1\n(associated with the even ns).\n\n2.0\n\nΩ*\n2.5 n=3\nn=2\n2.0\n\n1.5\n\n1.5\n\nΩ*\n2.5\n\nn=3\nn=2\n\n1.0\n0.5\n\n1.0\n\nn=5\n1.0\n\n1.5\n\n2.0\n\n2.5\n\n3.0\n\nkx\n3.5\n\n0.5\n\nn=5\n5\n\n(a)\n\n10\n\n15\n\n20\n\n25\n\n30\n\nn\n\n(b)\n\nFigure 2: The second class of peaks for a specific value of magnetic field set by H = −0.1. (a) The\ndependence on Fermi momentum. (b) The dependence on Landau level number.\n\nIn figure 3 we plot the behavior of the poles at fixed n for varying H, for a few\nsample values of n, choosing of n such that it falls in the regime where ω∗ behaves regularly\nwith n. Using these (and much more) data, we can attempt to fit the behavior of ω∗ with\nthe magnetic field and n, for large n, giving:\nω∗ ∼ 0.71 H 0.65 n0.63 .\n\n(79)\n\nFor how well this function fits the data, see figure 3. In particular, we find that the fit\nimproves for larger H and larger n. The exact numbers associated with the scaling of H\nand n are not as important as the fact that they deviate from the free relativistic fermion\nbehavior which would have both scaling with exponent 1/2.\nAnother important characteristic of these poles is the rate at which the peak is approached as a function of kx . This is the dispersion of the quasiparticles associated with\nthat peak, and it can be read off from our numerical searches quite readily. In our earlier\npaper[20], we found that non–zero H modified the behaviour seen in ref.[11]. In particular,\na peak at higher kx had more linear (i.e. Landau–like) dispersion. We observe that the same\n18\n\n\fΩ*\n\nΩ*\n\n3.0\n\n2.5\n\n2.5\n\n2.0\n\n2.0\n1.5\n1.5\n0.4\n\n0.6\n\n0.8\n\nH\n0.2\n\n(a) n = 10\n\n0.3\n\n0.4\n\n0.5\n\n0.6\n\nH\n\n(b) n = 20\n\nΩ*\n4.0\n3.5\n3.0\n2.5\n2.0\n0.2\n\n0.3\n\n0.4\n\n0.5\n\n0.6\n\nH\n\n(c) n = 30\n\nFigure 3: Behavior with increasing H for the poles in the regular regime. The best fit line is given\nby equation (79).\n\nis true for all n. Note however that from figure 2 it can be seen that, for the second class of\npeaks (the one that persist for all n), at higher n, the peaks are at successively lower values\nof kx (in either the even or odd n sequence). We show some sample dispersion behavior of\nthe poles at fixed H but different n in figure 4.\n\n5\n\nConclusions\n\nWe have generalized the work of ref. [20] to include an infinite number of excitations labeled\nby n. Different n correspond to different Landau Levels for the probe fermion in the presence\nof magnetic field. We studied in detail two separate classes of solution, leading to distinct\nphysics. One class is separable (it is used in the work of refs.[21, 22]) and the other is an\ninfinite sum of the separable solutions (studied for n = 0 in our first paper[20]). Both classes\nare probably physical, but the first class does not allow a smooth H = 0 limit for arbitrary kx ,\nand so seems less suitable for discussion of quasiparticle peaks and Fermi surfaces in the spirit\nof ref.[11], which is our focus (and that of ref.[21]). In fact, we argued that the separable\nsolutions have a constant Green function at ky = 0 when the y–dependence is included in\n19\n\n\fΩ*\n\nΩ*\n\n122.0\n\n121.4\n121.2\n121.0\n120.8\n120.6\n120.4\n\n121.5\n\n121.0\nkx\n122.4 122.6 122.8 123.0 123.2 123.4 123.6\n\nkx\n121.8 122.0 122.2 122.4 122.6 122.8 123.0\n\n(a) n = 0\n\n(b) n = 1\n\nΩ*\nΩ*\n\n0.700\n\n0.795\n0.695\n0.790\n0.690\n0.785\n0.834\n\n0.836\n\n0.838\n\n0.840\n\nkx\n0.842\n0.902 0.904 0.906 0.908 0.910\n\n(c) n = 10\n\nkx\n\n(d) n = 11\n\nΩ*\n\nΩ*\n\n1.07\n\n1.13\n\n1.06\n\n1.12\n\n1.05\n\n1.11\n\n1.04\n\n1.10\n0.742 0.744 0.746 0.748 0.750 0.752\n\nkx\n\n0.772 0.774 0.776 0.778 0.780 0.782\n\n(e) n = 20\n\nkx\n\n(f) n = 21\nΩ*\n1.44\n\nΩ*\n1.48\n\n1.42\n\n1.46\n\n1.40\n0.705\n\n0.710\n\n1.44\nkx\n\n0.715\n\n1.42\n1.40\n\n1.36\n1.34\n\n0.722 0.724 0.726 0.728 0.730 0.732 0.734\n\n(g) n = 30\n\nkx\n\n(h) n = 31\n\nFigure 4: Dispersion behavior near the pole. The red dot marks the position of the pole.\n\nthe Green function definition, which differs from the argument presented in ref. [21].\nThe infinite–sum solutions have key properties that make them attractive. They limit\nto the H = 0 solution smoothly for arbitrary n, with non–trivial dependence on kx . This is\n20\n\n\fthe class of solutions we use to find quasiparticle peaks for all the Landau Levels n. Note\nthat since ω depends on kx , these Landau levels do not have the usual degeneracy found for\nthe free fermion Landau levels.\nWe also noted that levels given by even n and odd n form distinct towers, distinguished\nby a relative energy shift (that diminishes as n increases) that suggests a aligned/anti–aligned\ncoupling to the magnetic field. The difference between even and odd stems from two different\nchoices one can make at the event horizon.\nWe also noticed that the family of quasiparticle peaks, at sufficiently large n, has a\ndependence on H and n that is different that of the relativistic massless free fermion. In fact\nthe exponent lies between the free relativistic value of 1/2 and the non–relativistic value of\nunity. This is consistent with our quasiparticles possibly having an induced mass.\n\nAcknowledgements\nWe would like to thank Nikolay Bobev, José Barbon, Karl Landsteiner, Moshe Rozali, and\nJulian Sonner for useful conversations. We would also like to thank an anonymous referee\nof J. Phys. A. for helpful suggestions for improvement of this manuscript. This work was\nsupported by the US Department of Energy.\n\nReferences\n[1] J. M. Maldacena, \"The large N limit of superconformal field theories and\nsupergravity,\" Adv. Theor. Math. Phys. 2 (1998) 231–252, hep-th/9711200.\n[2] E. Witten, \"Anti-de Sitter space and holography,\" Adv. Theor. Math. Phys. 2 (1998)\n253–291, hep-th/9802150.\n[3] S. S. Gubser, I. R. Klebanov, and A. M. Polyakov, \"Gauge theory correlators from\nnon-critical string theory,\" Phys. Lett. B428 (1998) 105–114, hep-th/9802109.\n[4] A. Chamblin, R. Emparan, C. V. Johnson, and R. C. Myers, \"Charged AdS black\nholes and catastrophic holography,\" Phys. Rev. D60 (1999) 064018, hep-th/9902170.\n[5] A. Chamblin, R. Emparan, C. V. Johnson, and R. C. Myers, \"Holography,\nthermodynamics and fluctuations of charged AdS black holes,\" Phys. Rev. D60 (1999)\n104026, hep-th/9904197.\n\n21\n\n\f[6] M. Cvetic and S. S. Gubser, \"Phases of R-charged black holes, spinning branes and\nstrongly coupled gauge theories,\" JHEP 04 (1999) 024, hep-th/9902195.\n[7] M. Cvetic and S. S. Gubser, \"Thermodynamic stability and phases of general spinning\nbranes,\" JHEP 07 (1999) 010, hep-th/9903132.\n[8] S. S. Gubser, \"Breaking an Abelian gauge symmetry near a black hole horizon,\"\n0801.2977.\n[9] S. A. Hartnoll, C. P. Herzog, and G. T. Horowitz, \"Holographic Superconductors,\"\nJHEP 12 (2008) 015, 0810.1563.\n[10] S. A. Hartnoll, C. P. Herzog, and G. T. Horowitz, \"Building a Holographic\nSuperconductor,\" Phys. Rev. Lett. 101 (2008) 031601, 0803.3295.\n[11] H. Liu, J. McGreevy, and D. Vegh, \"Non-Fermi liquids from holography,\" 0903.2477.\n[12] T. Faulkner, H. Liu, J. McGreevy, and D. Vegh, \"Emergent quantum criticality, Fermi\nsurfaces, and AdS2,\" 0907.2694.\n[13] C. M. Varma, Z. Nussinov, and W. van Saarloos, \"Singular Fermi Liquids,\" Physics\nReports 361 (2002) 267.\n[14] M. Cubrovic, J. Zaanen, and K. Schalm, \"Fermions and the AdS/CFT correspondence:\nquantum phase transitions and the emergent Fermi-liquid,\" 0904.1993.\n[15] R. Penrose, \"Gravitational collapse: The role of general relativity,\" Riv. Nuovo Cim. 1\n(1969) 252–276.\n[16] J. P. Gauntlett, J. Sonner, and T. Wiseman, \"Holographic superconductivity in\nM-Theory,\" Phys. Rev. Lett. 103 (2009) 151601, 0907.3796.\n[17] S. S. Gubser, C. P. Herzog, S. S. Pufu, and T. Tesileanu, \"Superconductors from\nSuperstrings,\" Phys. Rev. Lett. 103 (2009) 141601, 0907.3510.\n[18] S. S. Gubser, S. S. Pufu, and F. D. Rocha, \"Quantum critical superconductors in\nstring theory and M- theory,\" Phys. Lett. B683 (2010) 201–204, 0908.0011.\n[19] J. Gauntlett, J. Sonner, and T. Wiseman, \"Quantum Criticality and Holographic\nSuperconductors in M- theory,\" 0912.0512.\n22\n\n\f[20] T. Albash and C. V. Johnson, \"Holographic Aspects of Fermi Liquids in a Background\nMagnetic Field,\" 0907.5406.\n[21] P. Basu, J. He, A. Mukherjee, and H.-H. Shieh, \"Holographic Non-Fermi Liquid in a\nBackground Magnetic Field,\" 0908.1436.\n[22] F. Denef, S. A. Hartnoll, and S. Sachdev, \"Quantum oscillations and black hole\nringing,\" 0908.1788.\n[23] N. Iqbal and H. Liu, \"Real-time response in AdS/CFT with application to spinors,\"\n0903.2596.\n\n23\n\n\f"}