{"id": "http://arxiv.org/abs/1004.2132v1", "guidislink": true, "updated": "2010-04-13T09:35:43Z", "updated_parsed": [2010, 4, 13, 9, 35, 43, 1, 103, 0], "published": "2010-04-13T09:35:43Z", "published_parsed": [2010, 4, 13, 9, 35, 43, 1, 103, 0], "title": "Improved information security using robust Steganography system", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1004.3955%2C1004.4755%2C1004.1055%2C1004.5415%2C1004.0803%2C1004.3315%2C1004.5115%2C1004.4116%2C1004.2597%2C1004.0574%2C1004.0567%2C1004.2150%2C1004.2068%2C1004.4417%2C1004.0475%2C1004.4954%2C1004.1640%2C1004.0002%2C1004.4328%2C1004.2663%2C1004.5090%2C1004.2240%2C1004.1261%2C1004.1806%2C1004.3455%2C1004.2712%2C1004.1436%2C1004.4618%2C1004.2407%2C1004.4724%2C1004.5087%2C1004.3074%2C1004.0319%2C1004.3714%2C1004.1456%2C1004.2161%2C1004.5491%2C1004.2393%2C1004.0020%2C1004.2103%2C1004.1210%2C1004.0820%2C1004.3608%2C1004.4048%2C1004.2467%2C1004.1700%2C1004.3663%2C1004.1761%2C1004.2482%2C1004.5099%2C1004.1432%2C1004.0703%2C1004.5569%2C1004.4221%2C1004.1983%2C1004.4997%2C1004.0088%2C1004.1297%2C1004.0750%2C1004.3511%2C1004.0452%2C1004.2324%2C1004.4752%2C1004.2132%2C1004.1268%2C1004.0645%2C1004.0082%2C1004.3693%2C1004.2665%2C1004.3820%2C1004.3253%2C1004.4529%2C1004.3678%2C1004.4011%2C1004.2065%2C1004.5526%2C1004.5009%2C1004.3252%2C1004.3150%2C1004.3366%2C1004.2299%2C1004.1216%2C1004.0265%2C1004.1778%2C1004.2464%2C1004.1348%2C1004.3240%2C1004.2422%2C1004.1282%2C1004.5391%2C1004.1389%2C1004.1304%2C1004.4638%2C1004.1111%2C1004.2652%2C1004.1834%2C1004.0551%2C1004.4003%2C1004.3011%2C1004.4918%2C1004.0232&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Improved information security using robust Steganography system"}, "summary": "Steganography is an emerging area which is used for secured data transmission\nover any public media.Steganography is a process that involves hiding a message\nin an appropriate carrier like image or audio. It is of Greek origin and means\n\"covered or hidden writing\". The carrier can be sent to a receiver without any\none except the authenticated receiver knowing the existence of this\ninformation. In this paper, a specific image based steganography technique for\ncommunicating information more securely between two locations is proposed. The\nauthor incorporated the idea of secret key and password security features for\nauthentication at both ends in order to achieve high level of security. As a\nfurther improvement of security level, the information has been permuted,\nencoded and then finally embedded on an image to form the stego image. In\naddition segmented objects extraction and reassembly of the stego image through\nnormalized cut method has been carried out at the sender side and receiver side\nrespectively in order to prevent distortion of the Stego image during\ntransmission.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1004.3955%2C1004.4755%2C1004.1055%2C1004.5415%2C1004.0803%2C1004.3315%2C1004.5115%2C1004.4116%2C1004.2597%2C1004.0574%2C1004.0567%2C1004.2150%2C1004.2068%2C1004.4417%2C1004.0475%2C1004.4954%2C1004.1640%2C1004.0002%2C1004.4328%2C1004.2663%2C1004.5090%2C1004.2240%2C1004.1261%2C1004.1806%2C1004.3455%2C1004.2712%2C1004.1436%2C1004.4618%2C1004.2407%2C1004.4724%2C1004.5087%2C1004.3074%2C1004.0319%2C1004.3714%2C1004.1456%2C1004.2161%2C1004.5491%2C1004.2393%2C1004.0020%2C1004.2103%2C1004.1210%2C1004.0820%2C1004.3608%2C1004.4048%2C1004.2467%2C1004.1700%2C1004.3663%2C1004.1761%2C1004.2482%2C1004.5099%2C1004.1432%2C1004.0703%2C1004.5569%2C1004.4221%2C1004.1983%2C1004.4997%2C1004.0088%2C1004.1297%2C1004.0750%2C1004.3511%2C1004.0452%2C1004.2324%2C1004.4752%2C1004.2132%2C1004.1268%2C1004.0645%2C1004.0082%2C1004.3693%2C1004.2665%2C1004.3820%2C1004.3253%2C1004.4529%2C1004.3678%2C1004.4011%2C1004.2065%2C1004.5526%2C1004.5009%2C1004.3252%2C1004.3150%2C1004.3366%2C1004.2299%2C1004.1216%2C1004.0265%2C1004.1778%2C1004.2464%2C1004.1348%2C1004.3240%2C1004.2422%2C1004.1282%2C1004.5391%2C1004.1389%2C1004.1304%2C1004.4638%2C1004.1111%2C1004.2652%2C1004.1834%2C1004.0551%2C1004.4003%2C1004.3011%2C1004.4918%2C1004.0232&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Steganography is an emerging area which is used for secured data transmission\nover any public media.Steganography is a process that involves hiding a message\nin an appropriate carrier like image or audio. It is of Greek origin and means\n\"covered or hidden writing\". The carrier can be sent to a receiver without any\none except the authenticated receiver knowing the existence of this\ninformation. In this paper, a specific image based steganography technique for\ncommunicating information more securely between two locations is proposed. The\nauthor incorporated the idea of secret key and password security features for\nauthentication at both ends in order to achieve high level of security. As a\nfurther improvement of security level, the information has been permuted,\nencoded and then finally embedded on an image to form the stego image. In\naddition segmented objects extraction and reassembly of the stego image through\nnormalized cut method has been carried out at the sender side and receiver side\nrespectively in order to prevent distortion of the Stego image during\ntransmission."}, "authors": ["Mamta Juneja", "Parvinder singh Sandhu"], "author_detail": {"name": "Parvinder singh Sandhu"}, "author": "Parvinder singh Sandhu", "links": [{"href": "http://arxiv.org/abs/1004.2132v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1004.2132v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "cs.CR", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cs.CR", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1004.2132v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1004.2132v1", "arxiv_comment": null, "journal_reference": null, "doi": null, "fulltext": "Improved information security using Steganography and Image\nSegmentation during transmission\nMamta juneja,Parvinder Singh Sandhu\nComputer Science and Engineering Department, Rayat and Bahra Institute of Engineering and Technology (RBIEBT)\nSahauran (Punjab), India\ner_mamta@yahoo.com\n\nAbstract- Steganography is an emerging area which is used for\nsecured data transmission over any public media.Steganography is a\nprocess that involves hiding a message in an appropriate carrier like\nimage or audio. It is of Greek origin and means \"covered or hidden\nwriting\". The carrier can be sent to a receiver without any one except\nthe authenticated receiver knowing the existence of this information.\nIn this paper, a specific image based steganography technique for\ncommunicating information more securely between two locations is\nproposed. The author incorporated the idea of secret key and\npassword security features for authentication at both ends in order to\nachieve high level of security. As a further improvement of security\nlevel, the information has been permuted, encoded and then finally\nembedded on an image to form the stego image. In addition\nsegmented objects extraction and reassembly of the stego image\nthrough normalized cut method has been carried out at the sender\nside and receiver side respectively in order to prevent distortion of\nthe Stego image during transmission.\n\nKeywords: Steganography, Cover Image, Stego Image, Normalized\nCut.\n\n1. INTRODUCTION\nThe term steganography is not new today. In fact several\nexamples from the times of ancient Greece are available in\nKahn [3]. In recent years, everything is trending toward\ndigitalization and with the rapid development of the Internet\ntechnologies, digital media can be transmitted conveniently\nover the network. Therefore, messages need to be transmitted\nsecretly through the digital media by using the steganography\ntechniques.Steganography differs from Cryptography in the\nsense that where cryptography focuses on keeping the contents\nof a message secret, steganography focuses on keeping the\nexistence of a message secret [6, 15]. Another form of\ninformation hiding is digital watermarking, which is the\nprocess that embeds data called a watermark, tag or label into\na multimedia object such that watermark can be detected or\nextracted later to make an assertion about the object. The\nobject may be an image, audio, video or text only [9].\nAlthough steganography is an ancient subject, the modern\nformulation of it comes from the prisoner's problem proposed\nby Simmons [1], where two prisoners named Alice and Bob\nwish to communicate in secret to hatch an escape plan. All of\ntheir communication passes through a warden named Eve who\nwill throw them solitary confinement if she suspects any type\nof secret communication. So they must find out someway of\nhiding their secret message which gives the birth of\nsteganography. The warden is free to examine all\ncommunication exchanged between Alice and Bob can either\nbe active or passive. An active warden will try to alter the\ncommunication with the suspected hidden information\ndeliberately in order to remove the information where as a\npassive warden takes the note of covered communication,\ninforms the others and allows the message to pass through .An\nassumption can be made based on this model is that if both the\nsender and receiver share some common secret information\nthen the corresponding steganography protocol is known as\n\nthen the secret key steganography where as pure\nsteganography means that there is none prior information\nshared by sender and receiver. If the public key of the receiver\nis known to the sender, the steganographic protocol is called\npublic key steganography [2, 5]. For a more thorough\nknowledge of steganography methodology the reader may see\n[7,\n15].\nAlthough\nall\ndigital\nfile\nformats\ncan be used for steganography, but the image and audio files\nare more suitable because of their high degree of redundancy\n[15]. Figure 1 below shows the different categories of file\nformats that can be used for steganography techniques.\n\nFigure 1: Categories of Steganography\nA block diagram of a generic image steganographic system is\ngiven in Figure 2. A message is embedded in a digital image\n(cover image) through an embedding algorithm, with the help\nof a secret key. The resulting stego image is transmitted over a\nchannel to the receiver where it is processed by the extraction\nalgorithm using the same key. During transmission the stego\nimage, it can be monitored by unauthenticated viewers who\nwill only notice the transmission of an image without\ndiscovering the existence of the hidden message. Kevin\nCurran et al [13] propose an image based steganography\nmethods where he describes a set of steganography methods\nalong with their respective merits and demerits. The most\ncommon and simplest image embedding method is the least\nsignificant bit (LSB) insertion. The LSB insertion embeds the\nmessage in the least significant bit of some selected pixels of\nthe cover image. R.Chadramouli et al. [12] gives an analysis\nof lsb based steganography techniques. The embedding\ncapacity of LSB method can be increased by using two or\nmore least significant bits. At the same time, not only the risk\nof making the embedded message statistically detectable\nincreases but also the image fidelity degrades. Hence a\nvariable-sized LSB embedding scheme is presented in [11], in\nwhich the number of LSBs used for message embedding\n/extracting depends on the local characteristics of the pixel.\nThe advantages of LSB-based method are easy to implement.\nUnfortunately, the hidden message is assailable due to a slight\nmodification from the active warden. Marvel et al. [8] present\nan image steganographic method, entitled spread spectrum\nimage steganography (SSIS) that hides and recovers the\nmessage within digital imagery. The SSIS incorporated the use\nof error-control codes to correct the large number of bit errors.\nIn recent years many image steganography models have been\nproposed where the main objective is to protect the transmitted\ndata against any odd. Although increasing the security level\nof the hidden message of the transmitted data is still an open\nissue. Silvia Torres Maya et al. [14] presents a steganography\n\n\falgorithm based on bit plane complexity segmentation, which\npermits to implement hiding information into images for its\nsure transmission through a non secure channel. In this paper a\nspecific secret-key image based steganographic model\nproposed which uses an image as the cover data and the secret\ninformation is embedded in the cover data to form the stego\ndata which is also an image. The stego image has been divided\ninto several segments using normalized cut method [4,10] and\neach segments containing the parts of the embedded message\ntransmit separately to the receiver. This work proposes a novel\nalgorithm with higher security features so that the embedded\nmessage can not be hacked by unauthorized user.\n\nFigure 2: Generic image steganographic system\nThis paper has been organized as following sections:Section II deals with proposed model and the solution\nmethodology, Section III contains the analysis of the results\nand Section IV draws the conclusion.\n\n2. THE PROPOSED MODEL\nThe input messages can be in any digital form, and are often\ntreated as a bit stream. The input message is then converted\ninto encrypted form after a bit permutation is done on the\nmessage. Two level of encryption has been done on the\nmessage to raise the steganographic security level. This\nencrypted message generates the secret key, which may be\ncalled a message enabled key. A pseudo random number\ngenerator is used to locate the embedding positions of the\nmessage bits randomly. Before embedding a password\nprotection is also necessary to raise another level of security.\nStego image has been segmented using normalized cut method\nat the sender side and each cut /segmented objects are\ntransmitted individually to the receiver, which are required for\nreassembly and feature matching at the receiver side. At the\nreceiver side, cuts/segmented objects of the stego image are\nreassembled and tested for a specific feature. If that feature\nmatches, the extraction process starts after checking the\npassword. The embedded message is extracted but in\nencrypted form. The extracted message then goes through the\nconsecutive decryption process and re permutation and finally\nthe receiver may be able to see the embedded message with\nthe help of same secret key generated at the sender side .\n3. ANALYSIS OF THE RESULTS\nIn the previous work made by different researchers it has been\nseen that emphasis is given on lsb encoding and decoding\ntechnique to make it robust over any image processing\noperation. In this work an attempt has been made to increase\nthe level of security of the steganography model by\nincorporating the idea of secret key, password along with the\nuse of permuted and encoded form of the original message.\n\nFurther the object extraction of the Stego image, reassembly\nand feature matching has also been used to increase the level\nof security. The Levels of security incorporated in the\nproposed model:1. Permutation of the secret message.\n2. Two level encryption method used in the permuted\nmessage.\n3. Embedding encrypted form of the message in image.\n4. Use of password and secret key.\n5. Segmentation, Reassembly of objects and feature matching\nof the Stego Image.\nAll the processes both in sender side and receiver side must be\nexecuted in proper sequence.\n4. CONCLUDING REMARKS\nThe work dealt with the techniques for steganography as\nrelated to image science. The results of the test in order to\ncheck the security level is quite satisfactory. The security level\nmay be increased combining the approach of text\nsteganography and image steganography. As far as extending\nthis research goes, segmented object extraction method may\nbe substituted with multi-level thresholding and feature based\nmerging to generate optimum objects. The wavelet based\nimage compression over the stego image would be the best\ncandidate to receive further attention.\n5. REFERENCES\n(1) Gustavus J. Simmons, \"The Prisoners' Problem and\nthe Subliminal Channel\", in Proceedings of CRYPTO\n'83, pp 51-67. Plenum Press (1984).\n(2) \"Stretching the Limits of Steganography\", RJ\nAnderson in Information Hiding, Springer Lecture\nNotes in Computer Science v 1174 (1996) pp 39-48\n(3) D. Kahn, The Codebreakers - the comprehensive\nhistory of secret communication from ancient times\nto the Internet, Scribner, New York (1996).\n(4) J. Shi and J. Malik, \"Normalized Cuts and Image\nSegmentation,\" Int. Conf. Computer Vision and\nPattern Recognition, San Juan, Puerto Rico, June\n1997.\n(5) Scott Craver, \"On Public-key Steganography in the\nPresence of an Active Warden,\" in Proceedings of 2 nd\nInternational Workshop on Information Hiding, April\n1998, Portland, Oregon, USA. pp. 355 - 368.\n(6) Ross J. Anderson and Fabien A.P. Petitcolas, \"On the\nlimits of steganography,\" IEEE Journal on Selected\nAreas in Communications (J-SAC), Special Issue on\nCopyright & Privacy Protection, vol. 16 no. 4, pp\n474-481, May 1998.\n(7) N. F. Johnson and S. Jajodia, \"Steganography: seeing\nthe unseen,\" IEEE Computer.,Feb., 26-34 (1998).\n(8) L. M. Marvel, C. G. Boncelet, Jr. and C. T. Retter,\n\"Spread spectrum image steganography,\" IEEE\nTrans. on Image Processing, 8(8), 1075-1083 (1999).\n(9) Digital Watermarking :A Tutorial Review\nS.P.Mohanty ,1999.\n(10) J. Shi and J. Malik, \"Normalized cuts and image\nsegmentation.,\"IEEE Trans. PAMI, vol. 22, no. 8, pp.\n888-905, 2000.\n(11) Y. K. Lee and L. H. Chen, \"High capacity image\nsteganographic model,\" IEE Proc.-Vision, Image and\nSignal Processing, 147(3), 288-294 (2000).\n(12) Analysis of LSB Based Image Steganography\nTechniques ,R. Chandramouli, Nasir Memon, Proc.\nIEEE ICIP, 2001.\n\n\f(13) An Evaluation of Image Based Steganography\nMethods,Kevin Curran, Kran Bailey, International\nJournal of Digital Evidence,Fall 2003.\n(14) Silvia Torres Maya,Mariko Nakano and Ruben\nVazquez Medina \"Robust Steganography using Bit\nPlane Complexity Segmentation\" 1st International\n\nConference on Electrical and Electronics Engineering\n,2004.\n(15) T Mrkel,JHP Eloff and MS Olivier .\"An Overview of\nImage Steganography,\"in proceedings of the fifth\nannual Information Security South Africa Conference\n,2005.\n\n\f"}