{"id": "http://arxiv.org/abs/0911.4692v2", "guidislink": true, "updated": "2010-07-20T12:47:22Z", "updated_parsed": [2010, 7, 20, 12, 47, 22, 1, 201, 0], "published": "2009-11-24T18:29:32Z", "published_parsed": [2009, 11, 24, 18, 29, 32, 1, 328, 0], "title": "Large N duality beyond the genus expansion", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0911.5520%2C0911.3224%2C0911.2693%2C0911.4248%2C0911.1118%2C0911.1481%2C0911.3394%2C0911.4455%2C0911.4302%2C0911.1258%2C0911.2153%2C0911.1113%2C0911.1865%2C0911.0258%2C0911.3833%2C0911.0272%2C0911.1636%2C0911.2882%2C0911.3578%2C0911.1358%2C0911.4583%2C0911.0474%2C0911.5519%2C0911.4490%2C0911.3531%2C0911.4174%2C0911.5694%2C0911.2628%2C0911.4692%2C0911.0751%2C0911.3193%2C0911.4242%2C0911.3056%2C0911.2400%2C0911.3737%2C0911.0870%2C0911.1404%2C0911.0833%2C0911.2245%2C0911.1479%2C0911.1652%2C0911.4958%2C0911.2476%2C0911.3980%2C0911.5370%2C1005.3901%2C1005.5138%2C1005.4690%2C1005.4864%2C1005.2622%2C1005.3333%2C1005.2287%2C1005.1438%2C1005.1409%2C1005.2341%2C1005.0705%2C1005.2257%2C1005.0113%2C1005.0487%2C1005.3022%2C1005.3973%2C1005.0383%2C1005.4915%2C1005.1855%2C1005.2428%2C1005.2548%2C1005.0459%2C1005.4068%2C1005.0728%2C1005.0168%2C1005.3802%2C1005.1018%2C1005.1283%2C1005.4154%2C1005.4196%2C1005.1272%2C1005.2701%2C1005.1938%2C1005.4482%2C1005.2246%2C1005.5061%2C1005.1308%2C1005.0988%2C1005.4526%2C1005.5382%2C1005.2247%2C1005.1373%2C1005.4030%2C1005.1335%2C1005.5124%2C1005.4725%2C1005.0781%2C1005.3491%2C1005.2203%2C1005.5406%2C1005.0481%2C1005.3785%2C1005.0238%2C1005.2114%2C1005.1171%2C1005.1296&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Large N duality beyond the genus expansion"}, "summary": "We study non-perturbative aspects of the large N duality between Chern-Simons\ntheory and topological strings, and we find a rich structure of large N phase\ntransitions in the complex plane of the 't Hooft parameter. These transitions\nare due to large N instanton effects, and they can be regarded as a deformation\nof the Stokes phenomenon. Moreover, we show that, for generic values of the 't\nHooft coupling, instanton effects are not exponentially suppressed at large N\nand they correct the genus expansion. This phenomenon was first discovered in\nthe context of matrix models, and we interpret it as a generalization of the\noscillatory asymptotics along anti-Stokes lines. In the string dual, the\ninstanton effects can be interpreted as corrections to the saddle string\ngeometry due to discretized neighboring geometries. As a mathematical\napplication, we obtain the 1/N asymptotics of the partition function of\nChern-Simons theory on L(2,1), and we test it numerically to high precision in\norder to exhibit the importance of instanton effects.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0911.5520%2C0911.3224%2C0911.2693%2C0911.4248%2C0911.1118%2C0911.1481%2C0911.3394%2C0911.4455%2C0911.4302%2C0911.1258%2C0911.2153%2C0911.1113%2C0911.1865%2C0911.0258%2C0911.3833%2C0911.0272%2C0911.1636%2C0911.2882%2C0911.3578%2C0911.1358%2C0911.4583%2C0911.0474%2C0911.5519%2C0911.4490%2C0911.3531%2C0911.4174%2C0911.5694%2C0911.2628%2C0911.4692%2C0911.0751%2C0911.3193%2C0911.4242%2C0911.3056%2C0911.2400%2C0911.3737%2C0911.0870%2C0911.1404%2C0911.0833%2C0911.2245%2C0911.1479%2C0911.1652%2C0911.4958%2C0911.2476%2C0911.3980%2C0911.5370%2C1005.3901%2C1005.5138%2C1005.4690%2C1005.4864%2C1005.2622%2C1005.3333%2C1005.2287%2C1005.1438%2C1005.1409%2C1005.2341%2C1005.0705%2C1005.2257%2C1005.0113%2C1005.0487%2C1005.3022%2C1005.3973%2C1005.0383%2C1005.4915%2C1005.1855%2C1005.2428%2C1005.2548%2C1005.0459%2C1005.4068%2C1005.0728%2C1005.0168%2C1005.3802%2C1005.1018%2C1005.1283%2C1005.4154%2C1005.4196%2C1005.1272%2C1005.2701%2C1005.1938%2C1005.4482%2C1005.2246%2C1005.5061%2C1005.1308%2C1005.0988%2C1005.4526%2C1005.5382%2C1005.2247%2C1005.1373%2C1005.4030%2C1005.1335%2C1005.5124%2C1005.4725%2C1005.0781%2C1005.3491%2C1005.2203%2C1005.5406%2C1005.0481%2C1005.3785%2C1005.0238%2C1005.2114%2C1005.1171%2C1005.1296&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We study non-perturbative aspects of the large N duality between Chern-Simons\ntheory and topological strings, and we find a rich structure of large N phase\ntransitions in the complex plane of the 't Hooft parameter. These transitions\nare due to large N instanton effects, and they can be regarded as a deformation\nof the Stokes phenomenon. Moreover, we show that, for generic values of the 't\nHooft coupling, instanton effects are not exponentially suppressed at large N\nand they correct the genus expansion. This phenomenon was first discovered in\nthe context of matrix models, and we interpret it as a generalization of the\noscillatory asymptotics along anti-Stokes lines. In the string dual, the\ninstanton effects can be interpreted as corrections to the saddle string\ngeometry due to discretized neighboring geometries. As a mathematical\napplication, we obtain the 1/N asymptotics of the partition function of\nChern-Simons theory on L(2,1), and we test it numerically to high precision in\norder to exhibit the importance of instanton effects."}, "authors": ["Marcos Marino", "Sara Pasquetti", "Pavel Putrov"], "author_detail": {"name": "Pavel Putrov"}, "author": "Pavel Putrov", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1007/JHEP07(2010)074", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0911.4692v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0911.4692v2", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "37 pages, 24 figures. v2: clarifications and references added,\n  misprints corrected, to appear in JHEP", "arxiv_primary_category": {"term": "hep-th", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "hep-th", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0911.4692v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0911.4692v2", "journal_reference": "JHEP 1007:074,2010", "doi": "10.1007/JHEP07(2010)074", "fulltext": "Preprint typeset in JHEP style - PAPER VERSION\n\nLarge N duality beyond the genus expansion\n\narXiv:0911.4692v2 [hep-th] 20 Jul 2010\n\nMarcos Mariñoa,b , Sara Pasquettic and Pavel Putrovb\na\n\nDépartement de Physique Théorique et b Section de Mathématiques,\nUniversité de Genève, Genève, CH-1211 Switzerland\nc\n\nDepartement of Physics, CERN,\nGenève, CH-1211 Switzerland\nmarcos.marino@unige.ch,\n\nsara.pasquetti@cern.ch,\n\npavel.putrov@unige.ch\n\nAbstract: We study non-perturbative aspects of the large N duality between Chern–Simons\ntheory and topological strings, and we find a rich structure of large N phase transitions in the\ncomplex plane of the 't Hooft parameter. These transitions are due to large N instanton effects,\nand they can be regarded as a deformation of the Stokes phenomenon. Moreover, we show that,\nfor generic values of the 't Hooft coupling, instanton effects are not exponentially suppressed\nat large N and they correct the genus expansion. This phenomenon was first discovered in the\ncontext of matrix models, and we interpret it as a generalization of the oscillatory asymptotics\nalong anti–Stokes lines. In the string dual, the instanton effects can be interpreted as corrections\nto the saddle string geometry due to discretized neighbouring geometries. As a mathematical\napplication, we obtain the 1/N asymptotics of the partition function of Chern–Simons theory\non the lens space L(2, 1), and we test it numerically to high precision in order to exhibit the\nimportance of instanton effects.\n\n\fContents\n1. Introduction\n\n1\n\n2. Instanton corrections in matrix models and topological strings\n\n4\n\n3. Large N duality for Chern–Simons theory\n3.1 Chern–Simons theory on lens spaces\n3.2 The dual topological string\n3.3 Two special slices\n\n8\n9\n11\n14\n\n4. Large N phase diagram\n4.1 Real gs : the boundary expansion\n4.2 Imaginary gs : the interior expansion\n4.3 The phase diagram for complex gs\n4.4 Stokes phenomenon and target geometries\n4.5 Background independence\n\n14\n15\n17\n22\n24\n25\n\n5. Stokes phenomenon and matrix models\n5.1 Review of the Stokes phenomenon for the Airy function\n5.2 The Stokes phenomenon and the cubic matrix model\n\n26\n26\n28\n\n6. Conclusions\n\n31\n\nA. Some aspects of topological string theory on the local P1 × P1 geometry\n\n32\n\n1. Introduction\nAccording to large N dualities, the 1/N expansion of different observables in U (N ) gauge theories\ncan be reinterpreted as a genus expansion in an appropriate string theory. For example, the gauge\ntheory free energy at finite volume has an expansion of the form\nF (gs , N ) ∼\n\n∞\nX\n\ngs2g−2 Fg (t),\n\n(1.1)\n\ng=0\n\nwhere gs is the gauge theory coupling constant and t = gs N is the 't Hooft parameter. In large\nN dualities, gs is identified with the string coupling constant, the 't Hooft parameter becomes a\ngeometric modulus of the string target space, and the amplitudes Fg (t) are identified with free\nenergies at genus g of a string theory.\nThe 1/N expansion in gauge theory is an asymptotic expansion, and it is expected to have\ncorrections of the form\nF (gs , N ) ∼\n\n∞\nX\ng=0\n\ngs2g−2 Fg (t) + O(e−A(t)/gs ).\n\n–1–\n\n(1.2)\n\n\fThese corrections are invisible in the traditional 1/N asymptotics1 , and they are associated to\nlarge N instantons. Although large N instantons are typically built upon classical gauge theory\ninstantons, they should not be confused with them. A classical instanton is a saddle point of\nthe classical action, while a large N instanton is a saddle point of the large N effective action;\nsee [1, 40] and [23] for explicit examples in the CPN model and in two-dimensional Yang–Mills\ntheory, respectively. In particular, the action A(t) of a large N instanton is a non-trivial function\nof the 't Hooft parameter which includes quantum corrections at all loops. In some cases, large\nN instantons can be interpreted in terms of D-branes of the string theory dual, as it happens for\nexample in matrix models of non-critical strings.\nOne could think that the instanton corrections in (1.2) are unimportant since they are\nexponentially suppressed at large N , but this is not always the case. As we move in parameter\nspace they might become of order one and start contributing to the large N asymptotics. This\nscenario was advocated long ago by Neuberger [41] in order to explain the occurrence of critical\npoints in Hermitian matrix models and the third-order large N phase transitions of unitary\nmatrix models [24, 47]. The same mechanism explains as well the Douglas–Kazakov transition in\ntwo-dimensional Yang–Mills on the sphere [16, 23]. In these instanton-driven phase transitions,\nas we change the 't Hooft parameter at fixed gs , the action of the instanton A(t) vanish at some\nfinite value t = tc . This leads in general to different 1/N expansions for the regions t > tc and\nt < tc .\nOn the other hand, if we regard gs as a complex variable, we should expect that the 1/N\nasymptotics changes discontinuously as we change the argument of gs (and keep |t| fixed). In\nclassical asymptotic analysis, this discontinuous change is the well-known Stokes phenomenon.\nThe reason for this phenomenon is in fact the same one that underlies instanton-induced phase\ntransitions: an exponentially small quantity, due to a sub-leading saddle point, becomes less\nand less suppressed as we change the argument of the expansion variable. Along the so-called\nanti-Stokes line, the contribution of this saddle is of order one and has to be included in the\nasymptotics.\nIn general, a large N gauge theory with instanton sectors, should display a complex pattern\nof large N phase transitions, combining the instanton-driven phase transitions at fixed gs with\nthe Stokes-like transitions as we vary the argument of gs . If the gauge theory that we are studying\nhas a string dual in at least one of the phases, it is certainly interesting to understand what are\nthe implications of these transitions in the string picture.\nIn this paper we will analyze these issues in a family of models which have well-understood\nlarge N duals, namely Chern–Simons theory on the lens space L(p, 1). This gauge theory is\ndescribed by topological string theory on a Calabi–Yau space given by an Ap fibration over a\ntwo-sphere [22, 3, 27, 26]. However, this large N string dual is intrinsically semiclassical, since\nit describes a generic but fixed saddle–point of the gauge theory. A full non-perturbative study\nof this duality, where we sum over all saddle-points, reveals a surprisingly rich phase structure\nas we move in the complex plane of the 't Hooft coupling. The main results of our analysis are\nthe following:\n1. For each complex value of t, the large N asymptotics of the non-perturbative free energy\nis dominated by a fixed string target geometry, i.e. by a point in the Calabi–Yau moduli\nspace. However, this \"saddle geometry\" might change as we vary t.\n1\n\nBy traditional or classical asymptotics, we mean asymptotic expansions in which non-analytic terms are not\ntaken into account. There are refinements of traditional asymptotics, which go sometimes under the name of\n\"hyperasymptotics,\" where these terms are included in a systematic way, see [7] for an overview.\n\n–2–\n\n\f2. For some values of t, the 1/N asymptotics is given by a conventional genus expansion.\nThere are non-perturbative effects due to the contributions of neighbouring geometries,\nbut they are exponentially suppressed. For other values of t, the asymptotics has an\noscillatory behavior due to large N instantons. This type of behavior was first observed\nin the context of matrix models in [10], and further studied in [17, 18]. In particular, the\nlarge N asymptotics is no longer given by a genus expansion around a fixed geometry, and\ncorrections due to neighboring geometries are crucial, already at the next-to-leading order.\n3. The change of saddle geometry as we change the complex 't Hooft parameter can be regarded as a generalized or \"deformed\" Stokes phenomenon. In the limit of vanishing 't\nHooft coupling, the asymptotics changes discontinuously as we change the argument of the\nstring coupling constant, and we recover the classical Stokes phenomenon. For finite t the\nphenomenon is smoothed out, and the asymptotics changes continuously.\nIn practice we have focused on the simplest, nontrivial model in the family, namely L(2, 1) =\nRP3 . The gauge theory saddle points are characterized by a symmetry breaking pattern U (N ) →\nU (N1 ) × U (N2 ). The dual Calabi–Yau manifold is the so-called local F0 geometry, where F0 =\nP1 × P1 is a Hirzebruch surface. It has two Kähler parameters, corresponding at large radius to\nthe sizes of the two P1 s in F0 . The partial 't Hooft couplings t1 , t2 , where ti = gs Ni , parametrize\nthe Kähler moduli space near the orbifold point described in [3], and their sum t1 + t2 is fixed\nto be the total 't Hooft parameter of the gauge theory. Each saddle geometry is characterized\nby an \"equilibrium value\" for t2 . The phase diagram in the region |t| > 0, 0 ≤ Arg(gs ) ≤ π/2 is\nshown in Fig. 7.\nOur analysis shows very clearly that the large N instantons analyzed in [10, 35, 36, 34, 17,\n18, 43] are crucial in order to understand large N dualities. To be precise, for generic values\nof the 't Hooft parameter, the correct large N asymptotics of the exact gauge theory partition\nfunction involves these instanton effects already at next-to-leading order. In order to dispel any\ndoubt about this, we study in detail the partition function of Chern–Simons theory on RP3 ,\nfor imaginary values of the coupling constant. These are precisely the the \"physical\" or \"onshell\" values of the coupling constant in Chern–Simons theory. Our analysis shows that these\nvalues correspond to an anti-Stokes line with oscillatory asymptotics, in which the traditional\ngenus expansion has to be supplemented with instanton corrections. We test numerically our\npredictions for the instanton corrected asymptotics against the exact non-perturbative Chern–\nSimons partition function, and we obtain an impressive agreement.\nOur analysis also clarifies the issue of background dependence in topological string theory.\nLet us focus again on the example of Chern–Simons theory on RP3 . Perturbative topological\nstring theory depends on a choice of background (t1 , t2 ). The gauge theory partition function\nis background independent, in the sense that it only depends on the total 't Hooft parameter\nt = t1 +t2 (which is, as needed for consistency, a modular invariant in the dual topological string).\nHowever, the large N asymptotics of the partition function is \"peaked\" around a particular\nvalue of (t1 , t2 ) which depends on t and corresponds to a particular saddle geometry. This fixed\nbackground emerges as an equilibrium value as a consequence of the large N limit, but it has no\nmeaning at finite N . In fact, in the full theory, the value of the background (specified by, say,\nthe value of t2 ) is not fixed, since t2 is rather an internal or fluctuating variable which we have\nto sum over. But as usual in statistical mechanics, in the thermodynamic limit N → ∞ this\nfluctuating variable is peaked around an equilibrium value.\nWe would like to point out that the role of instanton effects in the 1/N expansion and their\nstring theory interpretation has been addressed before in different contexts. For example, the\n\n–3–\n\n\finstanton-induced Douglas–Kazakov phase transition has been interpreted as a breakdown of\nthe large N string dual [16]. In AdS/CFT at finite temperature, an incarnation of the Gross–\nWitten–Wadia phase transition has been argued to correspond to a breakdown of the geometric\ndescription of the string target [4]2 . The importance of exponentially small effects, and their\neffects on the string target space, has been emphasized in [37], which studies as well the Stokes\nphenomenon in the open string moduli space. In [42], a large N phase transition in N = 4 super\nYang–Mills theory on K3 was found, separating a phase dominated by the zero-instanton sector\nfrom a phase dominated by an instanton sector with large instanton number. In the context\nof matrix models, general techniques to analyze large N phase transitions have been developed\nalong the years, culminating in the formulation in terms of Boutroux spectral curves in [9]. Of\ncourse, the fact that the genus expansion can not capture the large N asymptotics was discovered\nin the context of matrix models and explained in detail in [10].\nThis paper is organized as follows: In Section 2 we review the structure of instantons corrections in matrix models and topological strings. In Section 3 we present our model, the Chern–\nSimons theory on the lens space L(p, 1), and its matrix model realization. We then specialize\nto the p = 2 case and review the large N duality between the perturbative expansion of the\nmatrix model in a fixed filling fraction (N1 , N2 ) configuration and the topological string on the\nlocal P1 × P1 geometry, in a fixed background t1 , t2 . In Section 4 we study the large N phase\ndiagram. We start by considering two particular cases: real and imaginary gs , which correspond\nto two phases of the gauge theory with two distinct dominant saddle configurations, each dual\nto a fixed background geometry. By following the analysis of Section 2, we explain the structure\nof the large N asymptotic of the two phases and provide very precise numerical checks of our\npredictions. We then complete the study of the phase diagram for generic complex gs and interpret the large N phase transitions between the various phases as due to the Stokes phenomen.\nWe end this section by commenting on the issue of the background independence. In Section 5\nwe discuss the phase diagram of the cubic matrix model. Thanks to its close relation with the\nAiry function, the prototypical example of the Stokes phenomenon, this example clarifies the\nnature of the large N phase transitions between dominant saddles/backgrounds which we found\nin Chern–Simons theory. Section 6 contains conclusions and a list of open issues. Finally in the\nappendix we collect some details of the model for different submanifolds of moduli space.\n\n2. Instanton corrections in matrix models and topological strings\nIn this section we review instanton corrections in matrix models/topological strings, following\nmainly [10, 36, 18].\nMulti-cut matrix models and topological strings are characterized, at the perturbative level,\nby genus g amplitudes of the form\nFg (t) = Fg (t1 , * * * , ts ),\n\n(2.1)\n\nwhere, in the case of matrix models, ti are partial 't Hooft couplings\nti = gs Ni ,\n\ni = 1, * * * , s,\n\n2\n\n(2.2)\n\nThe Hawking–Page transition in AdS/CFT is a large N phase transition leading to a change of topology, but\nit involves effects of order exp(−N 2 ) and it is not driven by instantons.\n\n–4–\n\n\fNi is the number of eigenvalues in the i-th cut and s is the number of cuts. The perturbative\npartition function is given, as usual, by\n\u001aX\n\u001b\n∞\n2g−2\nZp (N1 , * * * , Ns ) = exp\nFg (t)gs\n.\n\n(2.3)\n\ng=0\n\nA choice of moduli or 't Hooft parameters t = (t1 , * * * , tn ) in this partition function is called a\nchoice of background. In matrix models and in gauge theory, the quantity\nt=\n\nn\nX\n\nti = gs N\n\n(2.4)\n\ni=1\n\nwhere N is the rank of the U (N ) gauge group, is fixed. Background-independent quantities\nshould only depend on gs and N , while the perturbative partition function Zp depends on a\nchoice of ti and is therefore a background dependent quantity.\nC was introduced in the context of matrix models\nThe non-perturbative partition function Znp\nwith a polynomial potential V (z) in [13, 10, 17], and it depends on a choice of contour C in the\ncomplex plane. This contour is the integration path for the eigenvalues of the matrix integral.\nWe then have\nZ Y\nN\nPN\n1\ndλi 2\nV (λi )\n−1\nC\n(2.5)\nZnp (N, gs ) =\n∆ (λ)e gs i=1\nN! C\n2π\ni=1\n\nwhere ∆(λ) is the Vandermonde determinant. Of course, the contour C is chosen in such a way\nthat this integral converges. By standard saddle–point techniques, we can always deform the\npath C into a sum of paths Ck which go through the critical points of V (z) and are paths of\nsteepest descent [20],\ns\nX\nC=\nζk C k ,\n(2.6)\nk=1\n\nwhere we have assumed that V (z) has s critical points. Therefore\nX\n\nC\nZnp\n(N, gs ) =\n\nN1 +***+Ns =N\n\nζ1N1 * * * ζsNs Zp (N1 , . . . , Ns ).\n\n(2.7)\n\nwhere\n1\nZp (N1 , . . . , Ns ) =\nN1 ! * * * Ns !\n\nZ\n(1)\nλk ∈C1\n1\n\n***\n\nZ\n(s)\nλks ∈Cs\n\nN\nY\ndλi\ni=1\n\n2π\n\n− g1\n\n∆2 (λ) e\n\ns\n\nPN\n\ni=1\n\nV (λi )\n\n.\n\n(2.8)\n\nTo write this equation, we have split the N eigenvalues into s sets of NI eigenvalues, I = 1, . . . , s,\nwhich are denoted by\n(I)\n{λkI }kI =1,...,NI ,\nI = 1, . . . , s.\n(2.9)\nEach of the integrals (2.8) has a small gs asymptotic expansion given by (2.3).\nC as a sum of backgroundEquation (2.7) expresses a background-independent quantity Znp\ndependent quantities Zp (t). This sum can be in turn regarded as a sum over matrix model\ninstantons, which have been identified long ago in terms of eigenvalue tunneling [13, 46]. Formally,\nwe can write the sum (2.7) as the perturbative partition function coming from a fixed background\n\n–5–\n\n\fNi = Ni∗ , plus an infinite sums of corrections for the remaining values of Ni . These corrections\nare non-perturbative in gs . We write (2.7), schematically, as\nC\nZnp\n(N, gs ) = Zp (N1∗ , * * * , Np∗ ) + O(e−1/gs )\n\n(2.10)\n\nIn order to be more concrete, we will restrict ourselves to models where s = 2, or equivalently,\nmodels with two moduli t1 , t2 . Up to an overall normalization, we can set ζ1 = 1, ζ2 = ζ.\nThe detailed form of (2.10) depends on the choice of background. If the background is on the\nboundary, we have (N1∗ , N2∗ ) = (N, 0) or (0, N ). Otherwise, we say that the background is an\ninterior point. The expression for (2.10) when the background is on the boundary was worked\nout in [36]. Assuming for concreteness that the boundary is at (N, 0), we have\n2\n\u0012\n\u0013\n\u0012\nX gs` /2\n2\n`A\nC\n` `2\nZnp (N, gs ) = Zp (N ) 1 +\nG2 (` + 1) ζ q̂ exp −\ngs\n(2π)`/2\n`≥1\nP\n(2.11)\n\u0013\nP\nX X X gs i (2gi +mi −2)\n1)\nk)\nFbg(m\n. . . Fbg(m\n(−`) i li .\n*\n1\nk\nk!m\n!\n.\n.\n.\nm\n!\n1\nk\nmi\nk mi >0 gi >1−\n\n2\n\nIn this equation we have introduced the following notations. Zp (N ) is the partition function for\nthe one-cut model where all eigenvalues sit in the first critical point. The functions Fbg (t1 , t2 ) are\ndefined by\nFg (t1 , t2 ) = FgG (t2 ) + Fbg (t1 , t2 ),\n(2.12)\nwhere FgG (t) are the genus g free energies of the gauged Gaussian matrix model with 't Hooft\n(m)\nparameter t. Fbg denotes the m-th derivative of Fg w.r.t. s, which is defined as\n1\ns = (t1 − t2 ).\n2\nAll derivatives are evaluated at t1 = t and t2 = 0. G2 (` + 1) is the Barnes function\nG2 (` + 1) =\n\n`−1\nY\n\nn!.\n\n(2.13)\n\n(2.14)\n\nn=0\n\nFinally,\nA(t) = ∂s F0\n\n\u0010\n\u0011\nq̂ = exp ∂s2 Fb0 .\n\nand\n\n(2.15)\n\nAt leading order in gs , we have\nP\n\nX X\n\nX\n\nk mi >0 gi >1− mi\n\n(2g +m −2)\n\nP\ngs i i i\n1)\nbg(mk ) (−`) i li\nFbg(m\n.\n.\n.\nF\n1\nk\nk!m1 ! . . . mk !\n\n2\n\n\u0010\n\n= 1 − gs ` ∂s Fb1 (t) +\n\n`3\n\n(2.16)\n\n\u0011\n∂s3 Fb0 (t) + O(gs2 ).\n\n6\nThe expansion around an interior point was studied in [10, 17, 18]. It is given by\nP\n\nC\nZnp\n(N, gs )\n\n=\n\nZp (N1∗ , N2∗ )\n\nX X\n\nX\n\nk mi >0 gi >1− mi\n\n(2g +m −2)\n\nP\ngs i i i\n( i li )\n(m1 )\n(mk )\nF\n. . . Fgk Θμ,ν (F00 /gs , τ )\nk!m1 ! . . . mk ! g1\n\n2\n\n\u001b\n\u001a\n\u0010\n1 000 000 \u0011\n2\n∗\n∗\n0\n0\n= Zp (N1 , N2 ) Θμ,ν + gs Θμ,ν F1 + Θμ,ν F0 + O(gs ) .\n6\n(2.17)\n\n–6–\n\n\fThe derivatives of the free energies Fg are again w.r.t. s defined in (2.13). The theta function\nΘμ,ν with characteristics (μ, ν) is defined by\nX\nΘμ,ν (u, τ ) =\ne(n+μ−N \u000f)u eπi(n+μ−N \u000f)τ (n+μ−N \u000f) e2iπ(n+μ)ν\n(2.18)\nn∈Z\n\nand it is evaluated at\n\nF00 (Ni∗ )\n,\ngs\nIn the above equation, we have denoted\nu=\n\n\u000f=\n\nτ=\n\nN2∗\n,\nN\n\n1 00\nF .\n2πi 0\n\nζ = e2iπν\n\n(2.19)\n\n(2.20)\n\nin order to make contact with the notations of [18]. In (2.17), the derivatives of the theta function\n(2.18) are w.r.t. u, therefore each derivative introduces a factor of n + μ − N \u000f in the sum (2.18).\nNotice that, as emphasized in [10], the expression (2.17) gives a large N asymptotics which goes\nbeyond the genus expansion. In particular, the leading terms in the free energy are of the form,\nF = gs−2 F0 (Ni∗ ) + F1 (Ni∗ ) + log Θμ,ν + * * * ,\n\n(2.21)\n\nand the theta function leads typically to an oscillatory large N asymptotics.\nThe above expressions, (2.11) and (2.17), are for the moment being merely formal. In\nparticular, it is not clear if they provide reasonable asymptotic expansions of the original, nonperturbative partition function. There are again two different cases, applying to (2.11) and\n(2.17):\n1. The expression (2.11) gives an admissible asymptotic expansion if\nRe\n\n\u0010 A(t) \u0011\ngs\n\n> 0.\n\n(2.22)\n\nIn this case, the classical, small gs asymptotic expansion is given by the genus expansion of\nZp (N ). The terms with ` > 1 give exponentially suppressed corrections to the asymptotics.\n2. The expansion around a generic point Ni∗ in (2.17) is admissible if the filling fractions, as\ndetermined from the spectral curve, are real, i.e.\n\u000fi =\nand if\nRe\n\nNi∗\n∈ R,\nN\n\n\u0010 F 0 (N ∗ ) \u0011\n0\n\ni\n\ngs\n\n= 0.\n\n(2.23)\n\n(2.24)\n\nThe conditions (2.23), (2.24) were first spelled out in detail in [13, 14]. As noticed in [14],\nthey can be written as\n\u001a I\n\u001b\ndx\n1\ny(x) = 0,\n(2.25)\nIm\nt γ 2πi\nwhere y(x) is the spectral curve of the matrix model, and γ is any cycle on it. In writing these\nequations, we have followed the conventions of [32], so that\ny 2 (x) = V 0 (x)2 + * * * .\n\n–7–\n\n(2.26)\n\n\fA curve with the property (2.25) is called a Boutroux curve. The condition (2.24) makes sure\nthat the term involving u in the theta function (2.18) is oscillatory. This in turn guarantees that\nthe sum over n will be peaked around\nn + μ − N\u000f ≈ 0\n\n(2.27)\n\nso that the derivatives of the theta function involved in (2.17) are of order one, see [19] for a\nrelated discussion. The condition that the curve is Boutroux gives a nice geometrization of the\nsearch for good asymptotic expansions in matrix model theory, and it has been recently developed\nin much detail in [9].\nThe above conditions imply that, in order to have a well-defined large N asymptotics, the\nbackgroud can not be arbitrary. As we change the parameters of the theory, this \"dominant\nbackground\" will change. In particular, it can change from a boundary point to an interior\npoint. We will see examples of this in the Chern–Simons model discussed in this paper.\nThe search for a dominant background is however subtle, since as it is well-known, the\nperturbative amplitudes Fg (ti ) have a finite radius of convergence. The full space of 't Hooft\nparameters has a nontrivial global structure. As we reach the boundary of the convegence region,\nwe have to perform a duality transformation to a different frame. In particular, the condition\n(2.24) is attached to a particular frame and region, in which F0 is well-defined. One could worry\nthat the search for dominant backgrounds is not a well-posed problem, globally. However, we\nwill now argue that this is not the case for two reasons. The first one is that the condition on the\ncurve being Boutroux is invariant under duality transformations. Second, as shown in [18], each\nterm in the 1/N expansion of (2.17) is invariant under duality transformations, up to a phase.\nThis means, in particular, that\n−2\n\negs\n\nF0 +F1\n\nΘμ,ν\n\n(2.28)\n\nis invariant and it is therefore a well-defined quantity in the global moduli space. Looking for\nthe maxima of this function on the subspace of Boutroux curves in moduli space is therefore\na well-posed global problem, i.e. independent of the duality frame. In each region of moduli\nspace in which F0 , F1 , Θμ,ν are not singular, the maxima at large N satisfy the condition (2.24).\nTherefore, the problem of solving (2.23), (2.24) can be lifted globally in a consistent way.\nThe structure of instanton corrections that we have reviewed here was originally derived in\nthe context of matrix models. However, it was proposed in [35, 34, 18] that, since it only depends formally on the data of the spectral curve, these corrections should be present in topological\nstrings on local geometries, including toric geometries. In this sense, a suitable example is provided by topological string theory on Ap fibrations on P1 . These models have a non-perturbative\ndefinition in terms of U (N ) Chern–Simons gauge theory on a lens space [3], and they can be\nexplicitly reformulated as a multi-cut matrix integral. They constitute a privileged arena for\nconstructing the large N asymptotics presented above and for studying the role of instanton\ncorrections. In the next section we present what is known about these models from the point of\nview of Chern–Simons theory, matrix models, and topological string theory.\n\n3. Large N duality for Chern–Simons theory\nIn this paper we will study Chern–Simons theory on the lens space L(p, 1). This model has an\nopen string description as an A–type topological string defined on a Calabi–Yau threefold given\nby the cotangent bundle over the lens space T ∗ L(p, 1). This is just a particular example of the\n\n–8–\n\n\fmore general realization, due to Witten [49], of Chern–Simons theory on a three-manifold M as\na type A topological string on T ∗ M .\nFor M = S3 , which corresponds to the lens space with p = 1, the Gopakumar and Vafa large\nN duality [22] provides a description of U (N ) Chern–Simons gauge theory in terms of closed\ntopological string theory on the resolved conifold O(−1) + O(−1) → P1 . This duality can be\ngeneralized [3] by performing a Zp quotient on both sides of the Gopakumar–Vafa duality. This\nleads to a duality between Chern–Simons theory on S3 /Zp ≡ L(p, 1) and the closed topological\nA–model string on an Ap fibration over P1 . This target space, unlike the resolved conifold, has a\nnon trivial Kähler moduli space and besides the large radius phase it has non–geometric phases.\nIn particular, the large N duality relates the perturbative regime of the Cherns–Simons gauge\ntheory-small 't Hooft couplings-to the orbifold regime of the string theory. This duality has\nbeen tested in [3] by comparing the perturbative expansion of Chern–Simons theory around a\nfixed flat connection, to the orbifold topological strings amplitudes computed by mirror symmetry. Further tests of the duality have been done in [27, 26]. In the following we will review\nsome of these results. We will however go beyond the perturbative side of the duality and we\nwill study the exact, non-perturbative gauge theory partition function. As we will see, in the full\ntheory, the choice of filling fractions is not arbitrary, but it is dictated by the only parameters of\nthe theory, the Chern–Simons level k and the rank of the gauge group N .\n3.1 Chern–Simons theory on lens spaces\nThe lens space L(p, 1) is a three–manifold that can be obtained by gluing two solid 2-tori along\ntheir boundaries after performing the SL(2, Z) transformation,\n\u0012 \u0013\n10\n.\n(3.1)\nUp =\np1\nThis description makes it possible to calculate the partition function of Chern–Simons theory\non these spaces [48]. SL(2, Z) transformations lift to operators acting on H(T2 ), the Hilbert\nspace obtained by canonical quantization of the Chern–Simons theory on the two-torus. This\nspace is the space of integrable representations of a Wess–Zumino–Witten (WZW) model with\ngauge group G at level k, where G and k are respectively the Chern–Simons gauge group and\nthe quantized coupling constant. In particular the partition function of the U (N ) Chern–Simons\ntheory on the lens space L(p, 1) is given by:\nZ(L(p, 1)) = h0|Up |0i,\n\n(3.2)\n\nwhere Up is the lift of (3.1) to an operator on H(T2 ) and |0i is the vacuum state, corresponding\nto the trivial representation. This partition function has the following explicit form (up to an\noverall constant) [44]:\nZ=\n\n(−1)|∆+ | e\n\n− 2πi ρ2\nk̂p\n\n(−ipk̂)N/2\n\nn iπ\no\n\u000f(w) exp\n(ρ2 − 2ρ * (k̂n + w(ρ)) + (k̂n + w(ρ))2 ) . (3.3)\nk̂p\nn∈ZN /pZN w∈W\nX\n\nX\n\nIn this expression, k̂ = k + y, where y denotes the dual Coxter number, |∆+ | is the number of\npositive roots of G, and ρ is the Weyl vector. Using Weyl's formula\nX\nY\nα\n\u000f(w)ew(ρ) =\n2 sinh\n(3.4)\n2\nα>0\n\nw∈W\n\n–9–\n\n\fwe can also write the partition function as:\nZ=\n\ni|∆+ |\n\nX\n\n(−ipk̂)N/2\n\nn∈ZN /pZN\n\ne\n\nπik̂n2\n− 2πi\nρ*n\np\np\n\n\u0011\n\u0010π\n(k̂(ni − nj ) + j − i) .\n2 sin\nk̂p\n1≤i<j≤N\nY\n\n(3.5)\n\nThis expression for the partition function can be understood as a sum over saddle-points. For\nU (N ) Chern–Simons theory on L(p, 1) = S3 /Zp , these are flat connections, which can be obtained\nby considering embeddings of the first fundamental group into U (N ), modulo gauge transformations. Since π1 (L(p, 1)) = Zp these embeddings are given by N -component vectors n, whose\nentries take values in Zp . However, since the residual Weyl symmetry SN of the U (N ) gauge\ngroup permutes the different components of n, the flat connections are rather labeled by partitions Nj , where Nj is the number of entries in n which is equal to j − 1. The Nj label the choice\nof vacuum\nU (N ) → U (N1 ) × * * * × U (Np ).\n(3.6)\nIt is then possible [3] to rewrite the partition function as a sum of contributions of flat connections:\nX\nZ=\nZ(Nj )\n(3.7)\n{Nj }\n\nwhere\n(−1)|∆+ |\n\nn iπ\no\n\u000f(w) exp\n(ρ2 − 2ρ * (k̂w0 (n) + w(ρ)) + (k̂w0 (n) + w(ρ))2 ) .\n(−ipk̂)N/2\nk̂p\nw,w0 ∈W\n(3.8)\nIn this expression, the vector n is any vector with Nj entries equal to j − 1. The sum over Weyl\npermutations w0 ∈ W guarantees that the resulting object is gauge-invariant. As shown in [31]\nit is possible to rewrite (3.8) as a matrix integral\n\nZ(Nj ) =\n\nZ(Nk ) =\n\nQ\n\ne\n\n1\nj Nj !\n\nX\n\n− 2iπ ρ2 −Sinst (Nj )/gs\nk̂p\n\nQ\n\nj\n\nNj !\n\nZ Y\nN\ndxi\ni=1\n\n2π\n\n− 2g1\n\ne\n\nP\n\ns\n\nk (xk −2πink /p)\n\n2\n\nY\u0010\n\n2 sinh\n\ni<j\n\nwhere\ngs =\n\n2πi\npk̂\n\nx i − x j \u00112\n,\n2\n\n(3.9)\n\n(3.10)\n\nand the pre-factor involves the gauge-theory action of each flat connection:\np\nSinst (Nj )\n2π 2 X\n= 2\n(j − 1)2 Nj .\ngs\np gs\n\n(3.11)\n\nj=1\n\nIt can be easily checked that, although the expression (3.9) involves a choice of vector n, any two\nchoices related by a Weyl permutation lead to the same matrix integral. The expression (3.9)\ncan be regarded as a p-cut matrix model, where Nk eigenvalues sit around the point 2πi(k − 1)/p,\ni.e. it is a matrix model with fixed filling fractions. It has in particular an asymptotic large N\nexpansion of the form\n∞\nX\nFNk = log ZNk =\nFg (ti )gs2g−2\n(3.12)\ng=0\n\n– 10 –\n\n\fwhere\nti = gs Ni\n\n(3.13)\n\nare the partial 't Hooft parameters. In the case p = 2, calculations around the Gaussian point\nof the matrix model give the genus zero free energy\nF0 (t1 , t2 ) = −\n\nπ2\nt2 + log(−4)t1 t2 + F0G (t1 ) + F0G (t2 ) + F0p (t1 , t2 ).\n2\n\n(3.14)\n\nIn this equation, the first term comes from the instanton action, the second term comes from\nthe overall measure of the matrix integral, and F0G (t) is the Gaussian matrix model genus zero\namplitude,\n1 \u0010\n3\u0011\nF0G (t) = t2 log t −\n.\n(3.15)\n2\n4\nFinally, F0p (t1 , t2 ) comes from fatgraphs of genus zero, and it is given by\n1 4\n(t + 6t31 t2 + 18t21 t22 + 6t1 t32 + t42 )\n288 1\n1\n−\n(4t6 + 45t51 t2 + 225t41 t22 + 1500t31 t32 + 225t21 t42 + 45t1 t52 + 4t62 ) + * * *\n345600 1\n\nF0p (t1 , t2 ) =\n\n(3.16)\n\nFor the genus one term one has:\nF1 (t1 , t2 ) = F1G (N1 ) + F1G (N2 ) + F1p (t1 , t2 )\nwhere\nF1G (N ) = ζ 0 (−1) +\n\n1\nlog(N )\n12\n\n(3.17)\n\n(3.18)\n\nis the Gaussian matrix model contribution, and\nF1p (t1 , t2 ) = −\n\n1 2\n(t − 6t1 t2 + t22 ) + * * *\n288 1\n\n(3.19)\n\ncomes from fatgraphs of genus one. Higher genus free energies can be computed analogously.\n3.2 The dual topological string\nWe will now restrict ourselves to p = 2. The large N dual model of Chern–Simons theory on\nL(2, 1) is the topological string on the anti-canonical bundle of the Hirzebruch surface F0 . This\ngeometry has two P1 's in H2 (Y ) and a compact four cycle in H4 (Y ). We denote their associated\nclasses by A1 , A2 and B respectively. The class C = A2 − A1 does not have a dual cycle in\nH4 (Y ) and thus it will correspond to a non-normalizable modulus of the theory; one can then\ntake A = A2 as the normalizable modulus.\nThe mirror geometry is encoded in a family of elliptic curves Σ, which can be written as\np\nz1 x2 + x + 1 − (1 + x + z1 x2 )2 − 4z2 x2\ny=\n.\n(3.20)\n2\nThe periods of the one form λ = log ydx/x are given by the solutions of the associated Picard–\nFuchs system:\nL1 = z2 (1 − 4z2 )ξ22 − 4z12 ξ12 − 8z1 z2 ξ1 ξ2 − 6z1 ξ1 + (1 − 6z2 )ξ2 ,\n\nL2 = z1 (1 − 4z1 )ξ12 − 4z22 ξ22 − 8z1 z2 ξ1 ξ2 − 6z2 ξ2 + (1 − 6z1 )ξ1 ,\n\n– 11 –\n\n(3.21)\n\n\fwhere\nξi =\n\n∂\n.\n∂zi\n\n(3.22)\n\nAt the large radius point z1 = z2 = 0, the Picard–Fuchs system has two single logarithmic\nsolutions, which give the mirror maps at large radius\nT1 = − log z1 − 2z1 − 2z2 − 3z12 − 12z1 z2 − 3z22 + * * * ,\n\nT2 = − log z2 − 2z1 − 2z2 − 3z12 − 12z1 z2 − 3z22 + * * * .\nAs expected, the quantity\nT1 − T2 = log\n\nz2\n,\nz1\n\n(3.23)\n\n(3.24)\n\ncorresponding to the class C, does not receive any instanton corrections. It only depends on the\n\"bare parameters\" of the model z1 , z2 and has to be regarded as a parameter. As we will see in\na moment, it has a very natural meaning in the dual Chern–Simons theory.\nIn the moduli space of this model there is another point, discovered in [3], which makes\ncontact with Chern–Simons perturbation theory. This point is called the orbifold point, and it is\ndefined as the point x1 = x2 = 0 in terms of the variables:\nx1 = 1 −\n\nz1\n,\nz2\n\nx2 = √\n\n1\n\u0010\n\nz2 1 −\n\nz1\nz2\n\n\u0011.\n\n(3.25)\n\nThe periods near the orbifold point can be obtained again as solutions to the Picard–Fuchs\nsystem. They have the structure,\nX\nσ1 = − log(1 − x1 ) =\ncm,0 xm\n1 ,\nm\n\nσ2 =\n\nX\n\nn\ncm,n xm\n1 x2 ,\n\n(3.26)\n\nm,n\n\nFσ2 = σ2 log(x1 ) +\n\nX\n\nn\ndm,n xm\n1 x2 ,\n\nm,n\n\nwhere the coefficients cm,n and dm,n are determined by the following recursions relations [3]\ncm,n =cm−1,n\ncm,n =\ndm,n =\ndm,n =\n\n(n + 2 − 2m)2\n,\n4(m − n)(m − 1)\n\n1\n(cm,n−2 (n − m − 1)(n − m − 2) − cm−1,n−2 (n − m − 1)2 ),\nn(n − 1)\n\ndm−1,n (n + 2 − 2m)2 + 4(n + 1 − 2m)cm,n + 4(2m − n − 2)cm−1,n\n,\n4(m − n)(m − 1)\n\n(3.27)\n\n1\n(dm,n−2 (n − m − 1)(n − m − 2) − dm−1,n−2 (n − m − 1)2\nn(n − 1)\n+ (2n − 2 − 2m)cm−1,n−2 + (2m + 3 − 2n)cm,n−2 ).\n\nThe orbifold point gives the large N solution of Chern–Simons theory on L(2, 1), around a fixed,\narbitray flat connection, in the sense that the perturbative topological string amplitudes in this\n\n– 12 –\n\n\fframe, Fg (σ1 , σ2 ), correspond to the amplitudes in the 1/N expansion (3.12). The dictionary\nrelating the variables is\n1\n1\n(3.28)\nt1 = (σ1 + σ2 ), t2 = (σ1 − σ2 ).\n4\n4\nNotice that the parameter of the theory\nz2\n= σ1 = 2(t1 + t2 ),\n(3.29)\nlog\nz1\nis proportional to the total 't Hooft parameter of Chern–Simons theory gs N . This is in fact\nrequired by the large N duality: although t1,2 , the partial 't Hooft parameters, change in a\nnatural way under the action of the symplectic group, the total 't Hooft parameter t must be\na symplectic invariant, since it is a parameter of the gauge theory. The derivative of the genus\nzero free energy of Chern–Simons theory w.r.t. the variable s defined in (2.13) is given by the\nfollowing combination of the periods:\n∂F0\nπ2 1\n=\n+ Fσ2 − log(−4)σ2 .\n∂s\n2\n2\n\n(3.30)\n\nBy integrating w.r.t. σ2 and expressing the result in terms of t1 , t2 one recovers the genus zero\nfree energy of the matrix model expansion.\nIn the following it will be useful to express some quantities in terms of modular forms. It\nturns out that [2, 25]\n1 ∂ 2 F0\nτ=\n(3.31)\n2πi ∂s2\nis indeed a modular parameter for the curve (3.20), and in particular Im τ > 0. The modulus\n\u0012\n\u0013\n1\n1 √\n1\n2 2\nu=− √\nx x +\n1 − x1 + √\n,\n(3.32)\n8 1 − x1 1 2 2\n1 − x1\nis closely related to the modulus of a Seiberg–Witten curve [45] with\nτSW = 2τ + 1,\n\n(3.33)\n\nand it can be expressed in terms of elliptic theta functions:\nu=\n\nθ44 − θ42\n(2τ ) = 1 − 32q + 256q 2 + * * *\nθ43\n\n(3.34)\n\nwhere q = e2πiτ . Notice that the orbifold point in the moduli space of local F0 corresponds to\nu = 1, i.e. to the monopole point of the Seiberg–Witten curve.\nFinally one can check that the genus one free energy is given, in terms of modular forms, by\nF1 = − log η(τSW ) + 2ζ 0 (−1) +\n\ngs\n1\nlog ,\n6\n4\n\n(3.35)\n\nIn particular, we find\nF1p (t1 , t2 )\n\n1\n= − log η(τSW ) +\nlog\n12\n\n\u0012\n\nt1 t2\n16\n\n\u0013\n.\n\n(3.36)\n\nThe partition function of Chern–Simons theory on L(2, 1) can be written in terms of a twocut matrix model [31, 3]. The cuts are centered around x = 0, x = πi, and they are precisely the\ncuts which appear in the mirror curve (3.20). If we write them as\n(−a, a),\n\n(πi − b, πi + b),\n\n– 13 –\n\n(3.37)\n\n\fin terms of the endpoints a, b, it is easy to see that they are determined by the equations (see\nalso [27])\nr\n1\nz2\ncosh a = √ +\n= 1 + 2t1 + t1 (t1 + t2 ) + * * * ,\n2 z1\nz1\n(3.38)\nr\n1\nz2\ncosh b = − √ +\n= 1 + 2t2 + t2 (t1 + t2 ) + * * * .\n2 z1\nz1\n3.3 Two special slices\nThe above results simplify considerably along particular submanifolds in moduli space, which\nwill be relevant in the analysis of the phase structure in the next section.\nThe slice t2 = 0 corresponds, from the point of view of the gauge theory, to an expansion\naround the trivial flat connection. Up to a trivial rescaling of the coupling constant gs , the theory\nreduces to Chern–Simons theory on the three-sphere S3 . From the point of view of topological\nstring theory, the theory is equivalent to the resolved conifold. The genus zero and genus one\nfree energies are given by,\nt3\nπ2t\n−\n− Li3 (e−t ) + ζ(3),\n12\n6\nt\n1\n1\n1\n3\nF1S (t) = − −\nlog(1 − e−t ) +\nlog t + ζ 0 (−1) −\nlog N.\n24 12\n12\n12\n3\n\nF0S (t) =\n\n(3.39)\n\nThe instanton action (2.15) on t1 = t, t2 = 0 can be evaluated in closed form (see the Appendix)\nand it is given by\nA(t) = 2 Li2 (e−t/2 ) − 2 Li2 (−e−t/2 ).\n(3.40)\nThe other relevant slice, for us, corresponds to the symmetric slice t1 = t2 . In terms of the\norbifold coordinates, this slice is parametrized by\nx2 = σ2 = 0,\n\nx1 = 1 − e−σ1 .\n\n(3.41)\n\nOn this slice we have the following exact expressions for the prepotential and for the modular\nparameter in terms of the flat coordinate σ1 :\n1\nπi\n7π 2\nζ(3)\nσ3\nF0 (σ1 ) = − Li3 (e−σ1 ) + 1 + σ12 −\nσ1 +\n,\n8\n96 16\n48\n8\nτ =i\n\nK 0 (k)\n− 1,\nK(k)\n\nk 2 = 1 − e−σ1 ,\n\n(3.42)\n(3.43)\n\nwhere K(k) is the standard elliptic integral. The proof of the above identities is given in the\nAppendix.\n\n4. Large N phase diagram\nSo far we have just recalled the perturbative large N duality between Chern–Simons theory on\nL(2, 1) expanded around a particular flat connection (corresponding to a choice of filling fractions\nN1 , N2 ), and topological string theory on local F0 with Kähler parameters t1 , t2 .\nHowever, as we explained in the introduction, when studying the large N expansion of\nthe non-perturbative partition function, the choice of filling fractions (dominant saddle) is not\n\n– 14 –\n\n\farbitrary but it is dictated by the value of the total 't Hooft coupling t. We will now study the\nlarge N phase diagram for the Chern–Simons theory on L(2, 1), i.e. we will determine the saddle\nwhich gives the dominant contribution to the non-perturbative partition function as we move on\nthe complex plane of t = gs N (equivalently, on the complex plane of gs ).\nWe first notice two exact symmetries of the non-perturbative partition function. If we\nconjugate gs , we find\nZ(N, gs∗ ) = (−1)c(N ) Z ∗ (N, gs ),\n(4.1)\nwhere c(N ) is a half-integer that only depends on N . This symmetry is valid for all p. The\nsecond symmetry is related to changing gs → −gs . If we write\nZ(N, gs ) =\n\nN\nX\n\nZ(N, N2 , gs )\n\n(4.2)\n\n(−1)(N −1)N2 Z(N, N − N2 , gs ),\n\n(4.3)\n\nN2 =0\n\nwe have that\n0\n\nZ(N, N2 , −gs ) = (−1)c (N ) e−\n\nπ2 N 2\n2t\n\nwhere c0 (N ) is again a half-integer that only depends on N .\nIn determining the phase structure, we are interested in knowing which is the N2 which\ncontributes the most to the non-perturbative partition function (in absolute value). As we will\nsee, for N large, the sum in (4.2) will be very peaked around a particular saddle value (N1∗ , N2∗ ).\nWe see, from (4.1), that conjugating gs does not change this saddle, while from (4.3) we see that\nthe phase diagram is invariant under the simultaneous change\ngs ↔ −gs ,\n\n(N1∗ , N2∗ ) ↔ (N2∗ , N1∗ ).\n\n(4.4)\n\nIn practice, this means that in order to determine the phase diagram, we can restrict ourselves\nto the first quadrant of the complex gs plane\n0 ≤ Arg(gs ) ≤\n\nπ\n.\n2\n\n(4.5)\n\nIn order to proceed, we first study the limiting cases of real, positive gs and purely imaginary gs .\n4.1 Real gs : the boundary expansion\nThe classical action of the flat connection (3.11) has the value\nSinst (N2 ) =\n\nπ2\nN2 .\n2\n\n(4.6)\n\nWhen gs is real and positive, it gives an exponential suppression for all the non–trivial flat\nconnections N2 > 0. Therefore, at least when the 't Hooft coupling is sufficiently small, the\ndominant saddle point is expected to be at the boundary (N1∗ , N2∗ ) = (N, 0). In fact, it is easy\nto see that for any real, positive t, this boundary point is the dominant saddle. To prove it, it\nsuffices to show that the condition (2.22) holds on this slice, where A(t) is the large N instanton\naction corresponding to the first non-trivial instanton sector with N2 = 1. This action is given\nin (3.40), and it resums quantum fluctuations around the classical instanton solution. At small\nt it should have the general structure [23]\n\u0012\n\u0013 \u0012 \u0013c3 N\nc2\nA(t)\nexp −\n∼\ne−c1 /gs\n(4.7)\ngs\ngs\n\n– 15 –\n\n\fwhere the prefactor is the one-loop fluctuation around the classical instanton with action c1 =\nπ 2 /2, c3 N is the number of zero modes at large N , and c2 is a numerical constant. Therefore,\nthe expansion of A(t) around t = 0 should be of the form\n\u0010c \u0011\n2\nA(t) = c1 − c3 t log\n+ O(t).\n(4.8)\nt\nIndeed, we find from the exact expression (3.40) that\n\u0012 \u0013\nπ2\n4\nA(t) =\n− t + O(t3 ).\n− t log\n2\nt\n\n(4.9)\n\nThis large N instanton action is real for t ∈ [0, ∞) and it decreases monotonically from\nA(0) =\n\nπ2\n2\n\nto\n\nlim A(t) = 0.\n\n(4.10)\n\nt→∞\n\nIn particular it does not vanish for any finite t. This can be seen in Fig. 2, where the continuous\nline represents A(t)/t as a function of t/π. As we explain in the Appendix, this is equivalent to\nthe absence of phase transition for q-deformed 2d Yang–Mills with p = 2 [12, 5, 28]. We conclude\nthat, for real gs , the large N asymptotics of the partition function of Chern–Simons theory on\nL(2, 1) is simply given by the 1/N expansion of Chern–Simons theory on S3 ,\nlog ZL(2,1) (N, gs ) =\n\n∞\nX\n\n3\n\ngs2g−2 FgS (t).\n\n(4.11)\n\ng=0\n\nIn other words, the relevant saddle geometry along this direction in moduli space is just the\nresolved conifold geometry.\nOf course, the result (4.11) has an infinite number of exponentially suppressed instanton\ncorrections of the form (2.11). From the point of view of classical asymptotic analysis, these\nsubleading saddles are not taken into account, but of course they are important thanks, among\nother things, to the Stokes phenomenon that we will now uncover.\n-100\n\nae\n\nae\n\nae\n\nae\n\nae\n\n300\n\nae\n-200\n\nae\n-300\n\nae\n\n200\n\nae\nae\n\nae\n100\n\nae\n-400\n\nae\nae\n\nae\n0\n\nae\n-500\n4\n\nae\n\nae\n\nae\n\n2\n\nae\n\nae\n\nae\n\n0\n\nae\n\n6\n\n8\n\n10\n\nae\n\nae\n\nae\n\n12\n\n0\n\n2\n\n4\n\n6\n\n8\n\n10\n\n12\n\nFigure 1: In this figure we plot log |Z(N, N2 , gs )| as a function of N2 = 0, * * * , N , for N = 12 and for\ngs = ±π/24 respectively on the left and on the right. The dominant configurations are (N1∗ , N2∗ ) = (N, 0)\nand (0, N ), respectively, in agreement with the symmetry (4.3).\n\nThe above analysis can be confirmed numerically for small values of N . In general, a simple\nway to estimate the leading saddle (N1∗ , N2∗ ) for finite N is to calculate the partition functions\n\n– 16 –\n\n\fFigure 2: In this figure, the crosses represent the right hand side of (4.12), for N = 24 and different\nvalues of t, while the continuous line represents the value of A(t)/t obtained from (3.40).\n\nZ(N, N2 , gs ) for fixed values of N2 , and see which one is the largest in absolute value, and\ntherefore gives the dominant contribution in (4.2). In Fig. 1 we plot log |Z(N, N2 , gs )|, for gs real\nand positive. As expected, the dominant configuration is (N1∗ , N2∗ ) = (N, 0) ((N1∗ , N2∗ ) = (0, N )\nfor gs real and negative).\nWe can also confirm numerically the value of the instanton action (3.40). From (2.11) we\nfind the large N asymptotics\n1\n− log\nN\n\n\u0012\n\nZ(N, N2 = 1, gs )\nZ(N, N2 = 0, gs )\n\n\u0013\n\nA(t)\n=\n+O\nt\n\n\u0012\n\n1\nN\n\n\u0013\n.\n\n(4.12)\n\nIn Fig. 2 we plot the values of the r.h.s. for N = 24 and different values of t = N gs , and\nwe compare them to the value of A(t)/t given by (3.40). As we can see, the agreement is\nexcellent, and it can be further improved by extracting the subdominant tails in (4.12) through\nthe technique of Richardson transforms.\n4.2 Imaginary gs : the interior expansion\nLet us analyze now the large N asymptotics along the direction Arg(gs ) = π/2. The boundary\npoint (N, 0) can not be a solution any longer, since (2.22) is no longer verified (at least for small\nt). This is easy to understand: for imaginary gs , (3.11) is purely imaginary and the non-trivial\ninstanton sectors are not suppressed anymore. We then have to look for saddles satisfying the\ncondition (2.24), which in this case reads:\nh 1 \u0010 ∂F\n∂F0 \u0011i\n0\nRe\n−\n= 0.\ngs ∂t1\n∂t2\n\n– 17 –\n\n(4.13)\n\n\fIt is easy to see that the real part of F0 (t1 , t2 ) is symmetric under the exchange of t1 and t2 ,\ntherefore the configuration\nt\nt1 = t2 = ,\n(4.14)\n2\nwhich is an interior point, is a saddle. We claim that this gives in fact the dominant saddle\nwhen gs is imaginary. Of course, there could be other saddles which actually dominate the\nasymptotics. A first indication that this is not the case, and that (4.14) is the relevant saddle,\ncomes from the numerical analysis of Z(N, N2 , gs ) for small N . As we see in Fig. 3, for N even\nthe largest contribution comes from N2 = N/2, while for N odd the dominant contributions have\nN2 = (N ± 1)/2.\n-40\n\nae\n\nae\n\nae\n\nae\nae\n\n-60\n\nae\n\nae\n\n-60\nae\n\nae\n\nae\n\nae\nae\n\nae\n\n-80\n-80\n\nae\n\nae\n\nae\n\nae\n\nae\n\nae\n\n-100\nae\n\n-100\n\nae\n\nae\n\n-120\n\nae\n\n-140\n\n-120\nae\n0\n\n2\n\n4\n\n6\n\n8\n\n10\n\nae\n\nae\n\n12\n\n0\n\nae\n2\n\n4\n\n6\n\n8\n\n10\n\n12\n\nFigure 3: In this figure we plot log |Z(N, N2 , gs )| as a function of N2 = 0, * * * , N , on the left for N = 12\nand gs = πi/48, on the right for N = 13 and gs = πi/52. The largest value is obtained when N2 = N/2\nfor N even and when N = (N ± 1)/2 for N odd.\n\nAccording to the general discussion in section 2, since the saddle (4.14) is an interior point,\nthe large N asymptotics of the partition function should be given by (2.17). In our case, we have\n1\n\u000f= ,\n2\n\nμ = ν = 0,\n\nu\nπ2\nπik̂\n.\n=\n=−\ngs\n2gs\n2\n\n(4.15)\n\nThe resulting theta function depends on the value of N modulo two. If N is even, N \u000f is an\ninteger which can be reabsorbed in a shift of n ∈ Z, which is summed over. Therefore, (2.18) is\ngiven by\n!\nX\nk̂π\n2\nθe =\nexp πiτ n + i n .\n(4.16)\n2\nn∈Z\n\nNotice that, since gs is imaginary, k is real, and the second term leads to an oscillatory behavior.\nIf N is odd, N \u000f is a half-integer. We can absorb its integer part by a shift of n and we obtain for\n(2.18)\n!\nX\nk̂π\nθo =\nexp πiτ n2 + i n .\n(4.17)\n2\n1\nn∈Z+ 2\n\nWe then claim that, when gs is imaginary, the asymptotic behavior of F (N, gs ) = log Z(N, gs ),\nthe free energy of Chern–Simons theory on L(2, 1), at large N and fixed 't Hooft coupling, is\ngiven by the logarithm of (2.17). At leading order we have\n\u0012\n\u0013\n\u0012\n\u0013\nt t\nt t\n2\nF (N, gs ) = gs F0\n,\n+ F1\n,\n+ log Θ0,0 (u, τ ) + * * *\n(4.18)\n2 2\n2 2\n\n– 18 –\n\n\fwhere t = N gs . Notice that\n1. The perturbative free energies Fg (t/2, t/2) are the genus g free energies of topological string\ntheory on F0 on the slice t1 = t2 = t/2. For genus zero, it is given by the explicit expression\n(3.42). The higher genus amplitudes are essentially quasi-modular forms of the modular\nparameter τ [2, 25] which is given in (3.43) by an explicit function of\nσ1 =\n\n2πiN\n,\nk+N\n\n(4.19)\n\nwhere we used the original Chern–Simons parameters. In particular, F1 is given in (3.35).\n2. The asymptotics depends on the parity of N through the theta function, which is given by\n(4.16), (4.17) for N even and odd, respectively.\nIn the quantum Chern–Simons gauge theory, k̂ = k + N is an integer, and gs is purely\nimaginary. Therefore, the above asymptotics is in principle the relevant one to understand the\nlarge N 't Hooft limit of the quantum Chern–Simons invariant of L(2, 1).\n\n-0.262\n\n-0.262\n\n-0.264\n\n-0.264\n\n-0.266\n\n-0.266\n\n-0.268\n\n-0.268\n\n-0.270\n\n-0.270\n\n2\n\n4\n\n6\n\n8\n\n10\n\n12\n\n14\n\n-0.430\n\n2\n\n4\n\n6\n\n8\n\n10\n\n12\n\n14\n\n2\n\n4\n\n6\n\n8\n\n10\n\n12\n\n14\n\n-0.432\n-0.434\n\n-0.435\n-0.436\n-0.438\n\n-0.440\n\n-0.440\n\n2\n\n4\n\n6\n\n8\n\n10\n\n12\n\n14\n\nFigure 4: On the left column we plot the sequence Re fe (`, z) as well as its Richardson transforms\n(k)\nRe fe (`, z) for k = 1, 2, 3, and for ` = 2 * * * 14. On the right column we plot the sequence Re fo (`, z) as\n(k)\nwell as its Richardson transforms Re fo (`, z) for k = 1, 2, 3 for ` = 2 * * * 14. The plots on the top are for\nz = 1/4, and the plots of the bottom are for z = 1/8. The dashed lines in the plots show the expected\nvalue −Re F0 (z)/(πz)2 .\n\nOur claim about the asymptotics follows from the identification of (4.14) as the relevant\nsaddle point, and from the general theory reviewed in section 2 concerning instanton corrections.\nWe now provide detailed numerical evidence for our claim. Instead of working with N and gs we\nwill use N and z, which is defined by\nN\nz= .\n(4.20)\nk̂\n\n– 19 –\n\n\fLet us now define the sequences of complex numbers obtained from the non-perturbative partition\nfunction with N = 2`, 2` + 1 respectively:\nfe (`, z) =\n\n1\nlog Z(2`, z),\n(2`)2\n\nfo (`, z) =\n\n1\nlog Z(2` + 1, z).\n(2` + 1)2\n\n(4.21)\n\nAccording to our claim, these sequences have the large ` asymptotics\nfe (`, z) = −\n\n1\nF0 (z)\n+\n(F1 (z) + log θe (z)) + O(`−4 ),\n2\n(πz)\n(2`)2\n\n(4.22)\n\nF0 (z)\n1\nfo (`, z) = −\n+\n(F1 (z) + log θo (z)) + O(`−4 )\n2\n(πz)\n(2` + 1)2\n\nwhere F0,1 (z) are the genus 0, 1 free energies evaluated on the slice (4.14). Notice that the theta\nfunctions have in general oscillatory behavior as a function of `, but this can be fixed by choosing\nspecial values of k̂. For example, if k̂ = 0 mod 4 we have:\nθo (z) = ±θ2 (τ ),\n\nθe (z) = θ3 (τ ),\n\n(4.23)\n\nwhere the sign depends on the value of k̂ mod 8. In this way, the resulting large ` asymptotics\nis simply a series in inverse powers of `, and we can use standard techniques of accelerated\nconvergence to compare the actual values of fe,o (`, z), computed from the exact partition function\nof Chern–Simons theory for low `, to the predicted asymptotics.\n0.105\n\n-0.050\n\n0.100\n\n-0.055\n\n0.095\n\n-0.060\n\n0.090\n\n-0.065\n\n0.085\n\n-0.070\n0.080\n\n2\n2\n\n4\n\n6\n\n8\n\n10\n\n12\n\n4\n\n6\n\n8\n\n10\n\n12\n\n14\n\n14\n\n(k)\n\nFigure 5: The sequence Re Θeo (z) for z = 1/4, 1/8, together with its Richardson transforms Re Θeo (z)\nfor k = 1, 2, 3. The dashed lines in both plots show the expected value Re(log θe (z) − log θo (z)).\n\nIn practice, the computation of (3.5) involves generating a large number of configurations for\nthe vectors n, and we obtained their numerical values for N = 1, * * * , 30 and for different values\nof z. This means that we obtained the values of the sequences fe,o (`, z) up to ` = 14. Once these\nsequences are computed, we obtain their Richardson transforms (see for example [6])\n(r)\nfe,o\n(`, z) =\n\nX fe,o (` + k, z)(` + k)r (−1)k+r\nk≥0\n\nk!(r − k)!\n\n(4.24)\n\nin order to accelerate the convergence. In Fig. 4 we plot the sequences Re fe,o (`, z) as well as\n(k)\ntheir Richardson transforms Re fe,o (`, z) for k = 1, 2, 3 for different values of z together with\ntheir expected value −Re F0 (z)/(πz)2 . As we can see, the agreement is excellent.\n\n– 20 –\n\n\f-0.1106\n-0.1976\n\n-0.1108\n-0.1977\n\n-0.1110\n-0.1978\n\n-0.1112\n-0.1979\n\n-0.1114\n\n-0.1980\n\n2\n\n4\n\n6\n\n8\n\n10\n\n12\n\n2\n\n14\n\n4\n\n6\n\n8\n\n10\n\n12\n\n14\n\n-0.2108\n\n-0.2776\n-0.2109\n\n-0.2778\n\n-0.2110\n-0.2111\n\n-0.2780\n-0.2112\n\n2\n\n4\n\n6\n\n8\n\n10\n\n12\n\n14\n\n2\n\n4\n\n6\n\n8\n\n10\n\n12\n\n14\n\nFigure 6: On the left column we plot the sequence Re fe,1 (`, z) as well as its Richardson transforms\n(k)\nRe fe,1 (`, z) for k = 1, 2, 3, and for ` = 2 * * * 14. On the right column we plot the sequence Re fo,1 (`, z) as\n(k)\n\nwell as its Richardson transforms Re fo,1 (`, z), again for k = 1, 2, 3 and for ` = 2 * * * 14. The plots on the\ntop are for z = 1/4, and the plots of the bottom are for z = 1/8. The dashed line shows the expected\nvalue Re (F1 (z) + log θe,o (z)).\n\nIn order to test the subleading behavior, we define the following sequences:\nΘeo (`, z) = (2`)2 (fe (`, z) − fo (`, z)),\n\u0012\n\u0013\nF0 (z)\n2\nfe,1 (`, z) = (2`) fe (`, z) +\n,\n(πz)2\n\u0012\n\u0013\nF0 (z)\nfo,1 (`, z) = (2` + 1)2 fo (`, z) +\n,\n(πz)2\n\n(4.25)\n\nwith the expected asymptotic behavior:\nlim Θeo (`, z) = log θe (z) − log θo (z)\n\n`→∞\n\nlim fe,1 (`, z) = F1 (z) + log θe (z),\n\n`→∞\n\n(4.26)\n\nlim fo,1 (`, z) = F1 (z) + log θo (z).\n\n`→∞\n\nAs we can see in Fig. 6, the agreement between the analytic prediction and the actual asymptotic\nbehavior is again extremely good. This confirms our identification of the saddle point (4.14),\nas well as the formalism of [10, 17, 18] to incorporate instanton corrections in the oscillatory\ncase. Although these corrections are subleading in the case of the free energy, they can appear\nat leading order when studying expectation values of operators like Wilson loops, as noticed in\n[10] in the context of matrix models.\n\n– 21 –\n\n\f4.3 The phase diagram for complex gs\n\nFigure 7: The phase diagram describing the large N limit of Chern–Simons theory on L(2, 1) for 0 ≤ θ ≤\nπ/2, where θ = Arg(gs ). There are two phases distinguished by the equilibrium value of t2 and separated\nby the critical curve (4.30). In the region t2 = 0, the 1/N asympotics is given by a genus expansion,\nand corrections due to neighbouring geometries are exponentially suppressed. In the region where t2 6= 0,\nneighboring geometries correct the genus expansion with oscillatory terms. Notice that, in this region, the\nequilibrium value of t2 changes as we change t. The line θ = π/2, where t2 = t/2, can be regarded as an\nanti–Stokes line.\n\nThe qualitative features of the phase diagram for 0 < Arg(gs ) < π/2 can be understood by\nlooking at the function (3.40). Let us denote\nθ = Arg(gs )\n\n(4.27)\n\nt = |t|eiθ .\n\n(4.28)\n\nso that\nIf Re(A(t)/gs ) > 0, when t, gs are now complex, the dominant saddle will be t1 = t, t2 = 0, as\nfor θ = 0. For π/2 > θ > 0, the function\n\u0010\n\u0010\n\u0011\u0011\nfθ (|t|) = Re e−iθ A eiθ |t|\n(4.29)\nvanishes for a certain critical value\n|t| = |t|c (θ),\n\n(4.30)\n\nwhich can be easily determined numerically. The curve (4.30) separates two different regions in\nthe complex t plane, as shown in Fig. 7. In the region under this curve, where\n0 ≤ |t| < |t|c (θ),\n\n(4.31)\n\nthe dominant saddle is t1 = t, t2 = 0. In the region above this curve, we expect the dominant\nsaddle to have t2 6= 0.\n\n– 22 –\n\n\fFigure 8: Plot of (4.32) (blue), calculated for N = 22, and the real part of the instanton action (4.29)\n(red), as a function of |t|/π, for θ = 9π/20, 7π/20 and π/4, from left to right. The function (4.29)\ndecreases monotonically until it becomes zero at |t|c (θ). At this point, the average (4.32) gets triggered\nand it increases with |t|.\n\nIn order to verify this, as well as the location of the phase boundary, we have computed\nnumerically the average filling fraction at finite N\n\u001c\n\nN2\nN\n\n\u001d\nθ\n\nN\nX\n1\nN2\n=\n|Z(N, N2 , gs )|\n|Z(N, gs )|\nN\n\n(4.32)\n\nN2 =0\n\nfor fixed θ, as a function of |t|. This gives a finite N approximation to the value of |t2 /t| at\nthe dominant saddle. In Fig. 8 we plot the value of (4.32) and the real part of the instanton\naction (4.29), for three different values of θ, and as a function of |t|/π. Within the limits of\nthe numerical approximation, we clearly see that N2 /N starts developing an expectation value\nprecisely when we reach (4.30). As shown in Fig. 9, the limiting value of |t2 /t| as |t| increases\nseems to be 1/2.\n\nFigure 9: Plot of (4.32) as a function of |t|/π, for N = 22 and θ = 7π/20.\n\n– 23 –\n\n\farg(gs ) = 0\n\nZ(N, gs ) =\n\nt\n\n+\n\n+\n\n+***\n\n+\n\n+\n\n+***\n\narg(gs ) = π/2\n\nZ(N, gs ) =\n\nT2\nT1\n\nFigure 10: The Stokes phenomenon for the large N duality of L(2, 1). When gs is real and positive,\nthe saddle geometry giving the dominating contribution to the non-perturbative perturbative function is\nsimply the resolved conifold. The corrections, which are exponentially suppressed, can be interpreted as\nbackground geometries in which t2 = `gs is quantized in units of gs . When gs is purely imaginary, the\nsaddle geometry is a local P1 × P1 with t1 = t2 . Corrections to the genus expansion contribute to the\nlarge N asymptotics. They can be regarded as a sum of infinite geometries where t2 = ngs is quantized,\nand their contribution adds up to a theta function. In terms of the large radius Kähler parameters, these\ngeometries have fixed T1 − T2 = t.\n\n4.4 Stokes phenomenon and target geometries\nWe can now summarize the most important qualitative results of the analysis of the phase\ndiagram.\nFirst of all, for each complex value of t, the large N asymptotics of the non-perturbative\nfree energy is dominated by a fixed filling fraction or background (t∗1 , t∗2 ). Such a background\ncorresponds to a fixed target geometry, i.e. to a point in the Calabi–Yau moduli space. However,\nthe dominant background changes as we vary t.\nThe second important point is that the structure of the large N asymptotics depend on the\nnature of the dominant saddle point. If the dominant saddle point is on the boundary, i.e. one\nof the filling fractions vanishes, the 1/N asymptotics is given by a conventional genus expansion.\nThere are non-perturbative effects due to the contributions of neighbouring geometries, as shown\nin (2.11), but they are exponentially suppressed. However, if the dominant saddle point is an\ninterior point, the asymptotics has an oscillatory behavior and it involves theta functions, as\ndetailed in (2.17). In particular, the large N asymptotics is no longer given by a genus expansion\naround a fixed geometry, and corrections due to neighboring geometries are crucial already at\nthe next-to-leading order. We hope that our detailed numerical analysis in the case θ = π/2\nhas convinced the reader that these effects are crucial in order to obtain the correct large N\nasymptotics of the gauge theory partition function.\nIt is interesting to notice that the non-perturbative corrections are due to fluctuating target\ngeometries whose size is quantized in units of gs , see Fig. 10. In the case of the boundary\n\n– 24 –\n\n\fexpansion, an `-instanton correction corresponds to a geometry with t2 = `gs , ` = 1, 2, * * * . In\nthe interior case, the theta function is a discrete sum over an infinite number of geometries with\nt2 = (n − N/2)gs , n ∈ Z. Notice that the saddle geometries for arg(gs ) = π/2 correspond to the\nregion in moduli space where z1 , z2 → ∞ with z1 /z2 fixed and finite, therefore they are not in\nthe large radius phase z1 , z2 → 0.\nFinally, we point out that the change of saddle geometry as we change the complex 't Hooft\nparameter can be regarded as a generalized Stokes phenomenon. In fact, in the limit of vanishing 't\nHooft coupling, the asymptotics changes discontinuously as we change the argument of the string\ncoupling constant: we have a sudden jump from a dominant saddle at t2 = 0 to a dominant saddle\nat t2 /t = 1/2. The jump in the asymptotics has the same origin as in the Stokes phenomenon:\nsaddles which were subleading due to Re(A/gs ) > 0 are no longer suppressed exponentially, and\nthey lead to an oscillatory asymptotics in the θ = π/2 direction. In fact, the line θ = π/2 plays\nthe role of an anti–Stokes line. These analogies can be made more precise by studying a model\nwhere the connection to the standard Stokes phenomenon is manifest and can be followed in\ndetail, namely the cubic matrix model. We will show in the next section that the phase diagram\nfor this model is very similar to the one we have just found, and we will able to confirm all the\nanalogies that we have stated.\nIt is important to notice that the connection to the standard Stokes phenomenon is only\nstrictly true when t → 0. For finite |t| the Stokes phenomenon is smoothed out, in the sense that\nfor fixed |t|, as we increase θ from θ = 0, the asymptotics changes smoothly from a phase with\nt2 = 0 to a phase with t2 6= 0. The phase boundary (4.30) corresponds then to a second-order\nphase transition with t2 as its order parameter.\n4.5 Background independence\nOur results on the phase structure of this model shed some light on the issue of background\nindependence in topological string theory. As it is well-known, the genus g free energies in\ntopological string theory, Fg (ti ), are quasi-modular forms under the action of the symplectic\ngroup [2]. This can be regarded as a consequence of the holomorphic anomaly of [8], and it\nmeans in particular that the Fg (ti ) are not well-defined functions on the moduli space.\nIn the models we are studying, thanks to the large N duality, there is a quantity which is welldefined non-perturbatively, namely the Chern–Simons theory partition function, which depends\non gs and the rank N of the gauge group. Notice that, as needed for consistency, the total 't Hooft\nparameter t is a symplectic invariant in the dual topological string. An important question is how\nthis non-perturbative quantity is related to the perturbative, background dependent topological\nstring free energies. In this paper we have provided a detailed answer to this question in the\nparticular example of L(2, 1) and its string dual.\nFirst of all, at finite N the non-perturbative partition function (2.7) is a sum over all possible\nbackgrounds N1 +N2 = N . In the gauge theory description, these backgrounds correspond to saddle points or flat connections. In the matrix model description, they correspond to different filling\nfractions. In the language of statistical mechanics, we can say that the background-independent,\nnon-perturbative partition function has to be calculated in a grand-canonical ensemble where\nN2 is a fluctuating variable. This is manifest in (2.7), where the parameters ζi play the role of\nfugacities. On the other hand, the background-dependent topological string partition function is\ncomputed in a canonical ensemble where N2 is fixed.\nIn the thermodynamic limit (i.e. at large N ), as it is well-known in statistical mechanics,\nthe sum over backgrounds is strongly peaked around a particular one, and both ensembles are\nequivalent. This particular background is the dominant saddle which we have determined in\n\n– 25 –\n\n\fvarious situations. It depends on the gauge theory parameters N and gs , and it changes as we\nmove on the complex t plane, displaying the rich phase structure that we have analyzed. At finite\nN , however, the results of the two ensembles are different, and they differ precisely in the terms\nwhich go beyond the genus expansion, i.e. in the contributions of large N multi-instantons.\nThe resulting non-perturbative picture is very different from the picture that one obtains\nin perturbative topological string theory: the background-dependent quantities are emergent\nquantities and they only make sense in the large N limit, since they are defined through an\nasymptotic expansion.\n\n5. Stokes phenomenon and matrix models\n\nFigure 11: The integration contour C for (5.2), which leads to a convergent integral.\n\nIn order to have a better understanding of the nature of the line Arg(gs ) = π/2 in the phase\ndiagram of Chern–Simons theory, we will make a detailed analysis of the Stokes phenomenon in a\nsimple matrix model. We will focus on the quintessential example of Stokes phenomenon, namely\nthe Airy function, and we will study its fate as we promote the Airy integral to a matrix integral.\nOf course, the study of matrix models in the double-scaling limit produces differential equations\nwhich display the so-called non-linear Stokes phenomenon [39, 21]. Here we are rather interested\nin recovering the standard, linear Stokes phenomenon in the context of matrix integrals.\n5.1 Review of the Stokes phenomenon for the Airy function\nLet us consider the potential\nV (x) = −eiκ x +\n\nx3\n3\n\nwhere κ ∈ [0, 2π]. The one-dimensional integral\nZ\ndx − g1 V (x)\nZ1 (gs ) =\ne s\nC 2π\n\n– 26 –\n\n(5.1)\n\n(5.2)\n\n\fes\nok\n\nSt\n\n2π\n3\n\nπ\n3\n\ntwo saddles\ncontribute\n\n−\n\nSt\n\nok\nes\n\n0\n\n2π\n3\n\n−\n\nπ\n3\n\nFigure 12: Saddle-point analysis of the asymptotics of the function (5.2), closely related to the Airy\nfunction Ai(ζ). Full lines (in red) are Stokes lines, while dashed lines (in blue) are anti-Stokes lines.\nOn the Stokes lines κ = ±2π/3, a second saddle appears in the integration contour. This saddle is\nsubdominant when 2π/3 ≤ |κ| < π and does not contribute to classical asymptotics. However, at κ = π,\nthe saddle is not subdominant anymore and leads to an oscillatory asymptotics.\n\nwhere C is the path shown in Fig. 11, and gs is real and positive, is essentially the Airy function\nAi(w), where\nw = gs−2/3 eiκ .\n(5.3)\nThe small gs asymptotics of this integral is given by the large w asymptotics of the Airy function.\nThe standard analysis of this asymptotics is as follows (see [38] for a very nice discussion). There\nare two saddle points\nxL,R = ∓ζ 1/2\n(5.4)\nwhere we have introduced the variable\n\nζ = eiκ .\nThese saddles have actions\n−\n\n1\n2 3/2\nV (xL,R ) = ∓\nζ .\ngs\n3gs\n\n(5.5)\n(5.6)\n\nFor\n\n2π\n2π\n<κ<\n(5.7)\n3\n3\nthe path C can be deformed into a path of steepest descent through the saddle point at xL .\nWhen κ = 2π/3, the steepest descent path coming from the saddle at xL runs right into the\nother saddle point. At this angle we have\n−\n\nIm(V (xL )) = Im(V (xR ))\n\n(5.8)\n\nand the corresponding direction is called a Stokes line. This is the place where the second saddle\nxR might start contributing to the integral. In fact, for\n2π\n< |κ| < π\n3\n\n– 27 –\n\n(5.9)\n\n\fthe contour C gets deformed into a steepest descent path passing through xL together with a\nsteepest descent path passing through xR . However, in this range the latter gives an exponentially\nsuppressed contribution, and the classical asymptotics is just given by the contribution from xL .\nThis leads to\n3/2\nZ1 ∼ e−2w /3\n(5.10)\nwhere w is the variable introduced in (5.3). When κ = π the asymptotics is different, since both\nsaddles have the same real part\nRe(V (xL )) = Re(V (xR )).\n\n(5.11)\n\nA line where this occurs is called an anti-Stokes line. Along this line both saddles contribute to\nthe asymptotics, and we have\n\u00102\nπ\u0011\nZ1 ∼ cos |w|3/2 −\n.\n(5.12)\n3\n4\nThe fact that different asymptotic formulae hold on different directions for the same analytic\nfunction is called the Stokes phenomenon. From the point of saddle-point analysis, what is\nhappening is that the saddle point which appeared on the Stokes lines, at κ = ±2π/3, is no\nlonger subdominant at κ = π, and it has to be included in the asymptotics. The saddle-point\nanalysis is summarized in Fig. 12. We should mention that it is important sometimes to take\ninto account the subleading exponentials, even in the region κ 6= π. This is very clearly shown\nin the analysis of Berry in [7], and it has led to the development of non-classical asymptotic\ntheories. The most sophisticated of these, resurgent analysis, is applied to the Airy function in\nfor example [15].\n5.2 The Stokes phenomenon and the cubic matrix model\nLet us now promote (5.2) to a full matrix integral,\nC\nZnp\n(N, gs , κ)\n\n=\n\nZ Y\nN\ndxi\nC i=1\n\n2π\n\n− g1\n\n∆2 (x) e\n\nPN\n\ns\n\ni=1\n\nV (xi )\n\n,\n\n(5.13)\n\nwhere all the eigenvalues are integrated along the contour C. We can now study its small gs\nasymptotics for t = gs N fixed. Of course, this is nothing but the 't Hooft expansion of this\nmatrix model. The general saddle point is a two-cut configuration, labelled by (N1 , N2 ), where\nN1 , N2 are the number of eigenvalues near the critical points xL,R , respectively. Before starting\nthe analysis, let us notice that for small t the saddle point structure should be the same as for\nthe Airy function. The reason is that, for small t, the Vandermonde repulsion among eigenvalues\nis suppressed w.r.t. the potential, and the model becomes just N copies of the one-dimensional\nintegral.\nTherefore, at least for small t, we expect the following phase structure. For |κ| < 2π/3, the\ndominant saddle is a one-cut configuration where all the eigenvalues sit near xL = −ζ 1/2 . This\nis the boundary saddle point (N, 0). It is a one-cut configuration which can be analyzed with\nstandard techniques. The endpoints of the cut (a, b) are determined by the equations\nx0 (x20 − ζ) = t,\n\nδ 2 = 2(ζ − x20 )\n\n(5.14)\n\nb = −x0 − δ\n\n(5.15)\n\nwhere\na = −x0 + δ,\n\n– 28 –\n\n\fand we choose the root x0 = ζ 1/2 + * * * . The spectral curve is\nq\ny(x) = (x − x0 ) x2 + 2xx0 + 3x20 − 2ζ\n\n(5.16)\n\nand the effective potential reads\nq\n1\n(x(x − x0 ) − 2ζ) x2 + 2xx0 + 3x20 − 2ζ\n3\n\u0012\n\u0013\nq\n\u0001\n2\n2\n2\n− 2x0 x0 − ζ log x0 + x + x + 2xx0 + 3x0 − 2ζ .\n\nVeff (x) =\n\n(5.17)\n\nFor 2π/3 ≤ |κ| < π, the second saddle should start contributing, but at least at small t it should\nbe exponentially suppressed. In other words, the saddle configuration for the matrix integral in\nthis region should still be the boundary saddle (N, 0), but there will be corrections of the form\n(2.11). The instanton action is given by\nA = Veff (x0 ) − Veff (b).\n\n(5.18)\n\nThe small t expansion of this action is\n4\n41 3\n7\nA = − ζ 3/2 − t + t log t − 3t log(2ζ 1/2 ) − 3/2 t2 +\nt + ***\n3\n3\n64ζ\n8ζ\nNotice that, as t → 0, we find\nwhich is the other saddle, and\n\n(5.19)\n\nx0 → xR ,\n\n(5.20)\n\n4\nA → − ζ 3/2\n3\n\n(5.21)\n\nwhich is the difference between the actions of the two saddles (5.6). This is in agreement with\nthe expectation that for small t the saddle-point structure of the matrix model is just the one\ncoming from the Airy function. The real part of the instanton action vanishes at a critical value\nof tc (κ), which depends on the value of κ. For example, for κ = 2π/3, we have\n2\ntc = √ .\n3 3\n\n(5.22)\n\nThis is precisely the critical point leading to pure 2d gravity. For t > tc (κ), a phase transition\noccurs to a new phase, in which we expect generically N2∗ 6= 0.\nWhen κ = π, i.e. on the anti–Stokes line, we expect that the standard Stokes phenomenon\ncontrols the behaviour of the matrix integral for small t. Indeed, this is the case. The real part\nof the action A(t) vanishes at t = 0, and it is actually negative for small t. We then have to look\nfor a new saddle point by analyzing the behavior of F00 . The genus zero free energy of the cubic\nmatrix model has been analyzed in many places [11, 30]. It has the structure\n\nwhere\n\nF0 (t1 , t2 ) = F0np (t1 , t2 ) + F0p (t1 , t2 ),\n\n(5.23)\n\n3 \u0011 1 2\u0010\n3\u0011 1 2\n1 \u0010\n+ t2 ln t2 −\n− (t1 + t22 ) log(2ζ 1/2 ),\nF0np (t1 , t2 ) = t21 ln t1 −\n2\n2\n2\n2\n2\n\n(5.24)\n\n– 29 –\n\n\fFigure 13: The phase diagram of the cubic matrix model (5.13) as a function of 2π/3 ≤ κ ≤ π and\nt = gs N (which is taken to be real), for small t. The Stokes and anti–Stokes lines of the N = 1 case, which\noccur for κ = 2π/3 and κ = π, respectively, determine to a large extent the phase diagram for small t. On\nthe anti–Stokes line, the saddle value of t2 is t/2, and the classical 1/N asymptotics requires corrections\nbeyond the genus expansion.\n\nand\n2\n1 \u0010 2\n2 \u0011\nF0p (t1 , t2 ) = − ζ 3/2 (t1 − t2 ) + 2t1 t2 log(2ζ 1/2 ) + 3/2 − t31 − 5t22 t1 + 5t2 t21 + t32\n3\n3\n3\n8ζ\n\u0010\n\u0011\n1\n8 4 91 3\n91\n8\n+\nt1 − t1 t2 + 59t21 t22 − t1 t32 + t42 + * * *\n3\n64ζ 3\n3\n3\n3\n\n(5.25)\n\nOn the anti–Stokes line arg(κ) = π, ζ 1/2 is purely imaginary, and it is easy to see from the\nstructure of the genus zero free energy that its real part is symmetric in t1 , t2 . Therefore,\nt1 = t2\n\n(5.26)\n\nsolves the saddle-point equation\n∂F0\n=0\n(5.27)\n∂s\nat least for small t (more precisely, (5.26) provides a solution in the domain of analiticity of the\nconvergent expansion (5.25)). Therefore, on the anti–Stokes line and for t small enough, the\npartition function of the cubic matrix model (5.13) is given by an expansion of the form (2.17).\nThis type of expansion is then the natural generalization to matrix models of the oscillatory\nbehavior along an anti–Stokes line.\nThe phase diagram of the cubic matrix model, again at small t, is represented in Fig. 13.\nWe see that it is very similar to the phase diagram of the large N Chern–Simons theory on a\nlens space that we analyzed in the previous section. This confirms that the line θ = π/2, where\nthe vacuum occurs at t1 = t2 = t/2, plays the role of an anti–Stokes line. Strictly speaking,\nhowever, the discontinuous jump in the asymptotics typical of the Stokes phenomenon occurs\nRe\n\n– 30 –\n\n\fonly at t = 0. For t 6= 0, as we change the angle we encounter the region where t2 goes from a zero\nvalue to a nonzero value in a smooth way. We conclude that turning on the 't Hooft parameter\nsmooths out the Stokes discontinuity, and we pass from a first-order phase transition at t = 0 to\na second-order phase transition for t > 0, where t2 plays the role of an order parameter.\nAs t increases along the different directions, further phase transitions can occur which we\nhave not explored. For example, along the κ = π direction, it follows from the results of [9] that\nthere is a transition at t > 0 in which the two cuts merge into a trivalent graph. Interestingly,\nsuch transitions along the anti–Stokes line are absent in the lens space partition function.\n\n6. Conclusions\nIn this paper we have analyzed non-perturbative aspects of the large N expansion in a theory\nwith a rich structure of instanton sectors and with a large N dual. There are various important\nconclusions that emerge from our analysis. First of all, we have seen that, for each choice of\ngauge theory parameters gs , N , the large N asymptotics is dominated by a single instanton\nsector. This sector corresponds to a fixed geometry in the moduli space of the dual Calabi–Yau\ngeometry, which can be characterized by the Boutroux condition (2.25). Second, there are large\nN phase transitions as we move in the complex t plane, and different instanton sectors dominate\nthe asymptotics for different values of t. These transitions can be regarded as deformations of\nthe standard Stokes phenomenon. Third, the correct large N asymptotics goes beyond the genus\nexpansion, and subleading saddles must be incorporated.\nWe conclude with a list of issues left open by our work:\n1. The genus g topological string free energies appear in the large N asymptotics of the\n\"canonical\" partition function Z(N, N2 , gs ) with N2 fixed. They are known to transform as\nquasi-modular forms when moving from one patch of the moduli space to another [2]. At\nthe level of the gauge theory, these transformations should correspond to phase transitions\nwithin the same instanton sector, which we have not studied in detail in this paper, since\nwe have focused on phase transitions among different instanton sectors. On the other hand,\nthe matrix integral (3.8) gives a non-perturbative definition of this \"canonical\" partition\nfunction which is valid for any Nk and any complex gs . It would be important to understand\nthe precise connection between the modular properties of the topological string amplitudes\nand the large N asympotics of the quantity (3.8), which is background independent and\nclearly well-defined in all the moduli space. The results obtained in this paper seem to indicate that modularity can be understood in terms of phase transitions or generalized Stokes\nphenomena, and that background dependence in these models is ultimately an artifact of\nthe asymptotic large N expansion.\n2. Non-perturbative effects of the form e−A/gs in gauge theories and matrix models have been\nidentified in terms of D-branes in their string duals. In particular, the source of these effects\nhas been shown to be Liouville branes in minimal strings, and more recently toric branes\nin topological strings [33, 35, 43]. It seems clear that the subleading saddles appearing\nin the oscillatory asymptotics (2.17) can be also interpreted in terms of D-branes, and\nin the example of local F0 these are also toric D-branes in this geometry. It would be\nvery interesting to make more precise the D-brane interpretation of the non-perturbative\ncorrections appearing in (2.17).\n3. Even though in this paper we focused on a simple toy model of gauge/string duality, we\nbelieve that some of the effects we studied in this work are likely to play a role in other\n\n– 31 –\n\n\flarge N dualities. The underlying reason for the phenomena explored in this paper is the\nexistence of nontrivial instanton sectors which compete among them at large N . In some\ncases we have a single sector dominating the large N asymptotics, but in other cases, along\ngeneralized anti–Stokes lines, the standard large N asymptotics needs to be corrected, as\nfirst pointed out in [10]. This scenario seems to be quite general and it is likely to appear\nin other models, in particular in AdS/CFT dualities. For example, the recent work [29]\nindicates that matrix integrals closely related to (3.9) are relevant in the study of large N\ndualities for ABJM theories.\n\nAcknowledgments\nWe would like to thank Bertrand Eynard, Andreas Malaspinas and Cumrun Vafa for discussions\nand suggestions. The work of M.M. and P.P. is supported in part by the Fonds National Suisse.\n\nA. Some aspects of topological string theory on the local P1 × P1 geometry\nIn this Appendix we give some further information on topological string theory on the local\nP1 × P1 geometry, and in particular we justify some of the statements made in the bulk of the\ntext.\nThe Yukawa couplings of this Calabi–Yau, when written in terms of the \"bare\" coordinates\nz1 , z2 appearing in (3.20), are [3, 25]\nC111 =\n\n(1 − 4z2 )2 − 16z1 (1 + z1 )\n,\n4z13 ∆\n\nC112 =\n\n16z12 − (1 − 4z2 )2\n,\n4z12 z2 ∆\n\nC122\n\n(A.1)\n\n16z22 − (1 − 4z1 )2\n,\n=\n4z1 z22 ∆\n\nC222 =\n\n(1 − 4z1 )2 − 16z2 (1 + z2 )\n,\n4z23 ∆\n\nwhere\n∆ = 1 − 8(z1 + z2 ) + 16(z1 − z2 )2 .\n\n(A.2)\n\nUsing the Yukawa couplings (A.1), it is possible to find a closed form for the prepotential\nwhen x2 = 0. The triple derivative w.r.t x1 is given by\nC x1 x1 x1\n\nx2 =0\n\n= C111 J13 + 3C112 J12 J2 + 3C122 J1 J22 + C222 J23\n\nwhere\nJ1 =\n\n\u0001\nx2 =0\n\n∂z1\n∂z2\nx1 − 2\n2\n= 3 2 , J2 =\n= − 3 2.\n∂x1\n∂x1\nx1 x2\nx1 x2\n\nSince\n∂x1 σ1 =\n\n1\n,\n1 − x1\n\n– 32 –\n\n=\n\n2 − x1\n,\n4x1 (x1 − 1)3\n\n(A.3)\n\n(A.4)\n\n(A.5)\n\n\fwe obtain a closed form for the triple derivative w.r.t. the flat coordinate σ1 :\nCσ1 σ1 σ1\n\nx2 =0\n\n=\n\n1 + e−σ1\n,\n4(1 − e−σ1 )\n\n(A.6)\n\nwhich can be integrated to give:\n1\nF0 (σ1 , 0) = − Li3 (e−σ1 ) + * * *\n2\n\n(A.7)\n\nThe dots indicate a degree three polynomial. This polynomial can be fixed by comparing to the\nperturbative results, and one finally obtains (3.42).\nIt is also possible to derive closed expressions for ∂σ2 Fσ2 on the slice x2 = 0. To do this, one\nfirst writes the Picard–Fuchs system (3.21) in terms of the coordinates x1,2 ,\n\u0001\n\u0001\n1\n1\n8 − 8x1 + x21 x2 ∂x2 +\n−4 + (−2 + x1 ) 2 x22 ∂x22\n4\n4\n\u0001\n2\n+ (−1 + x1 ) x1 ∂x1 − x1 2 − 3x1 + x21 x2 ∂x1 ∂x2 + (−1 + x1 ) 2 x21 ∂x21 ,\n\u0001\nL2 = (2 − x1 ) x2 ∂x2 + −1 + (1 − x1 ) x22 ∂x22 − x21 ∂x1\nL1 =\n\n(A.8)\n\n+ 2 (−1 + x1 ) x1 x2 ∂x1 ∂x2 + (1 − x1 ) x21 ∂x21 ,\n\nand looks for a solution L1,2 f = 0 in the form\nf (x1 , x2 ) = x2 G(x1 ) + O(x32 ).\n\n(A.9)\n\nThe PF system leads to the following equation for G(x):\n1\n(x − 4) G(x) + x G0 (x) − (1 − x)x2 G00 (x) = 0,\n4\n\n(A.10)\n\nwhose general solution is a linear combination of xK(x) and xK(1 − x). By comparing to the\nfirst terms in (3.26) and using (3.30), one immediately obtains\n\u0012\n\u0013\n∂σ2\n2\n∂\n∂F0\n= −x1 K(1 − x1 ),\n(A.11)\n= x1 K(x1 ),\n∂x2 x2 =0 π\n∂x2 ∂s x2 =0\ntherefore\n∂ 2 F0\n∂s2\n\n=4\nx2 =0\n\n∂σ2\n∂x2\n\n!−1\nx2 =0\n\n∂\n∂x2\n\n\u0012\n\n∂F0\n∂s\n\n\u0013\nx2 =0\n\n= −2π\n\nK(1 − x1 )\n,\nK(x1 )\n\n(A.12)\n\nand (3.43) follows. Equivalently, one can derive (A.11,A.12) by solving the recursion (3.27) for\ncm,1 and dm,1 ,\nΓ(m − 1/2)2\ncm,1 =\n, m ≥ 1,\nπΓ(m)2\n(A.13)\nand using the series expansions\nK(x) =\n\ndm,1 = −2(ψm − ψm−1/2 )cm,1 ,\n\n∞ \u0012 \u0013\nπ X 1 2 xk\n,\n2\n2 k (k!)2\nk=0\n\n∞\n\nX\n1\nK(1 − x) = − log(x)K(x) +\nπ\nk=0\n\n\u0012 \u00132 k\n1\nx\n(ψn+1 − ψn+1/2 ).\n2 k (k!)2\n\n– 33 –\n\n(A.14)\n\n\fFinally, we calculate the instanton action (3.40) in the slice t2 = 0. This can be in principle\nderived from the above geometry, but in fact we can use a computation already done in [5]. As in\n[35, 36], the one–instanton free energy is given by the ratio of the one instanton partition function\n(1)\n(0)\nZN ≡ Z(N, N2 = 1, gs ) and the zero instanton partition function ZN ≡ Z(N, N2 = 0, gs ),\n(1)\n\nF\n\n(1)\n\n=\n\nZN\n\n(0)\n\nZN\n\n∼ e−A(t)/gs ,\n\n(A.15)\n\n(1)\n\nWe can evaluate ZN by taking (N1 , N2 ) = (N − 1, 1) in the matrix integral (3.9), as in [35], and\nwe find\n*N\n+\nZ\nπ2\ns + πi − xj \u00112\nds − 2g1 s2 Y \u0010\n(1)\n− 2g\n−gs (ρ2N −ρ2N −1 ) (0)\nZN = e s\nZN −1\ne s\n,\n(A.16)\n2 sinh\n2π\n2\nj=2\n\nN −1\n\nwhere ρN is the Weyl vector in the U (N ) theory, and the vev is calculated in the matrix model\n(0)\ndefined by ZN . At small gs , the integral over s can be calculated at the saddle s = 0, and the\nv.e.v. can be calculated in the planar limit. Taking into account that\n(0)\n−gs (ρ2N −ρ2N −1 ) ZN −1\ne\n(0)\nZN\n\n\u0012\n\u0013\u001b\n1\nt3\nS3\n∼ exp − ∂t F0 (t) −\ngs\n12\n\u001a\n\n(A.17)\n\nwe find,\n\u0012\n\u0013\nZ\n\u0010\nt3\nu\u0011\nπ2\nS3\n+ ∂t F0 (t) −\n− t du ρ(u) log 4 cosh2\n,\nA(t) =\n2\n12\n2\nwhere\n\nq\net − cosh2\n1\n−1 \n\u0001\nρ(u) =\ntan\nπt\ncosh u2\n\nu\n2\n\n(A.18)\n\n\u0001\n\n\n(A.19)\n\nis the density of eigenvalues of the S3 Chern–Simons matrix model.\nFortunately we do not have to evaluate the integral in (A.18), since the result is already\navailable in the literature. A closely related integral has been studied in [5, 12, 28] in the context\nof the q–deformed two–dimensional Yang–Mills theory on the two–sphere, and it calculates the\nlarge N instanton action γ(A, p). Its explicit expression can be found in equation (4.22) of [5].\nIn particular, for p = 2 and A = −4t, (A.18) equals γ(A, p)/4, and using the result of [5] one\nfinds\nπ2\nA(t) =\n− 2Li2 (1 − e−t/2 ) + 2Li2 (e−t/2 ) + t log(1 − e−t/2 ) − Li2 (e−t )\n3\n(A.20)\n\u0010\n\u0011\n−t/2\n−t/2\n= 2 Li2 (e\n) − Li2 (−e\n) .\nFor p = 2, the q-deformed Yang–Mills theory does not undergo a large N phase transition, as\nshown in [5, 12, 28]. In our context this means that there are no large N phase transitions when\nt is real.\n\nReferences\n[1] I. Affleck, \"Testing The Instanton Method,\" Phys. Lett. B 92, 149 (1980).\n\n– 34 –\n\n\f[2] M. Aganagic, V. Bouchard and A. Klemm, \"Topological Strings and (Almost) Modular Forms,\"\nCommun. Math. Phys. 277 (2008) 771 [arXiv:hep-th/0607100].\n[3] M. Aganagic, A. Klemm, M. Mariño and C. Vafa, \"Matrix model as a mirror of Chern-Simons\ntheory,\" JHEP 0402, 010 (2004) [arXiv:hep-th/0211098].\n[4] L. Álvarez-Gaumé, C. Gómez, H. Liu and S. Wadia, \"Finite temperature effective action, AdS(5)\nblack holes, and 1/N expansion,\" Phys. Rev. D 71, 124023 (2005) [arXiv:hep-th/0502227].\n[5] X. Arsiwalla, R. Boels, M. Mariño and A. Sinkovics, \"Phase transitions in q-deformed 2d Yang-Mills\ntheory and topological strings,\" Phys. Rev. D 73, 026005 (2006) [arXiv:hep-th/0509002].\n[6] C.M. Bender and S. Orszag, Advanced Mathematical Methods for Scientists and Engineers,\nSpringer–Verlag, New York 1999.\n[7] M. V. Berry, \"Asymptotics, superasymptotics, hyperasymptotics, ...\", in H. Segur et al, eds.,\nAsymptotics beyond all orders. Plenum Press, New York, 1991.\n[8] M. Bershadsky, S. Cecotti, H. Ooguri and C. Vafa, \"Kodaira-Spencer theory of gravity and exact\nresults for quantum string amplitudes,\" Commun. Math. Phys. 165, 311 (1994)\n[arXiv:hep-th/9309140].\n[9] M. Bertola, \"Boutroux curves with external field: equilibrium measures without a minimization\nproblem,\" arXiv:0705.3062.\n[10] G. Bonnet, F. David and B. Eynard, \"Breakdown of universality in multi-cut matrix models,\" J.\nPhys. A 33, 6739 (2000) [arXiv:cond-mat/0003324].\n[11] F. Cachazo, K. A. Intriligator and C. Vafa, \"A large N duality via a geometric transition,\" Nucl.\nPhys. B 603, 3 (2001) [arXiv:hep-th/0103067].\n[12] N. Caporaso, M. Cirafici, L. Griguolo, S. Pasquetti, D. Seminara and R. J. Szabo, \"Topological\nstrings and large N phase transitions. I: Nonchiral expansion of q-deformed Yang-Mills theory,\"\nJHEP 0601, 035 (2006) [arXiv:hep-th/0509041].\n[13] F. David, \"Phases Of The Large N Matrix Model And non-perturbative Effects In 2-D Gravity,\"\nNucl. Phys. B 348, 507 (1991).\n[14] F. David, \"Non-perturbative effects in matrix models and vacua of two-dimensional gravity,\" Phys.\nLett. B 302, 403 (1993) [arXiv:hep-th/9212106].\n[15] E. Delabaere, \"Effective resummation methods for an implicit resurgent function,\"\nmath-ph/0602026.\n[16] M. R. Douglas and V. A. Kazakov, \"Large N phase transition in continuum QCD in\ntwo-dimensions,\" Phys. Lett. B 319, 219 (1993) [arXiv:hep-th/9305047].\n[17] B. Eynard, \"Large N expansion of convergent matrix integrals, holomorphic anomalies, and\nbackground independence,\" JHEP 0903, 003 (2009) [arXiv:0802.1788 [math-ph]].\n[18] B. Eynard and M. Mariño, \"A holomorphic and background independent partition function for\nmatrix models and topological strings,\" arXiv:0810.4273 [hep-th].\n[19] B. Eynard and N. Orantin, \"Algebraic methods in random matrices and enumerative geometry,\"\narXiv:0811.3531 [math-ph].\n[20] G. Felder and R. Riser, \"Holomorphic matrix integrals,\" Nucl. Phys. B 691, 251 (2004)\n[arXiv:hep-th/0401191].\n[21] A. S. Fokas, A. R. Its, A. A. Kapaev and V. Yu. Novokshenov, Painlevé Transcendents: A\nRiemman-Hilbert Approach, American Mathematical Society, 2006.\n[22] R. Gopakumar and C. Vafa, \"On the gauge theory/geometry correspondence,\" Adv. Theor. Math.\nPhys. 3, 1415 (1999) [arXiv:hep-th/9811131].\n\n– 35 –\n\n\f[23] D. J. Gross and A. Matytsin, \"Instanton induced large N phase transitions in two-dimensional and\nfour-dimensional QCD,\" Nucl. Phys. B 429, 50 (1994) [arXiv:hep-th/9404004].\n[24] D. J. Gross and E. Witten, \"Possible Third Order Phase Transition In The Large N Lattice Gauge\nTheory,\" Phys. Rev. D 21, 446 (1980).\n[25] B. Haghighat, A. Klemm and M. Rauch, \"Integrability of the holomorphic anomaly equations,\"\nJHEP 0810, 097 (2008) [arXiv:0809.1674 [hep-th]].\n[26] N. Halmagyi, T. Okuda and V. Yasnov, \"Large N duality, lens spaces and the Chern-Simons matrix\nmodel,\" JHEP 0404, 014 (2004) [arXiv:hep-th/0312145].\n[27] N. Halmagyi and V. Yasnov, \"The spectral curve of the lens space matrix model,\" JHEP 0911, 104\n(2009) [arXiv:hep-th/0311117].\n[28] D. Jafferis and J. Marsano, \"A DK phase transition in q-deformed Yang-Mills on S2 and topological\nstrings,\" arXiv:hep-th/0509004.\n[29] A. Kapustin, B. Willett and I. Yaakov, \"Exact Results for Wilson Loops in Superconformal\nChern-Simons Theories with Matter,\" JHEP 1003, 089 (2010) [arXiv:0909.4559 [hep-th]].\n[30] A. Klemm, M. Mariño and S. Theisen, \"Gravitational corrections in supersymmetric gauge theory\nand matrix models,\" JHEP 0303, 051 (2003) [arXiv:hep-th/0211216].\n[31] M. Mariño, \"Chern-Simons theory, matrix integrals, and perturbative three-manifold invariants,\"\nCommun. Math. Phys. 253, 25 (2004) [arXiv:hep-th/0207096].\n[32] M. Mariño, \"Les Houches lectures on matrix models and topological strings,\" arXiv:hep-th/0410165.\n[33] M. Mariño, \"Open string amplitudes and large order behavior in topological string theory,\" JHEP\n0803 (2008) 060 [arXiv:hep-th/0612127].\n[34] M. Mariño, \"Non-perturbative effects and non-perturbative definitions in matrix models and\ntopological strings,\" JHEP 0812, 114 (2008) [arXiv:0805.3033 [hep-th]].\n[35] M. Mariño, R. Schiappa and M. Weiss, \"Non-perturbative Effects and the Large-Order Behavior of\nMatrix Models and Topological Strings,\" arXiv:0711.1954 [hep-th].\n[36] M. Mariño, R. Schiappa and M. Weiss, \"Multi-Instantons and Multi-Cuts,\" J. Math. Phys. 50,\n052301 (2009) [arXiv:0809.2619 [hep-th]].\n[37] J. M. Maldacena, G. W. Moore, N. Seiberg and D. Shih, \"Exact vs. semiclassical target space of the\nminimal string,\" JHEP 0410, 020 (2004) [arXiv:hep-th/0408039].\n[38] P. Miller, Applied asymptotic analysis, American Mathematical Society, 2007.\n[39] G. W. Moore, \"Geometry Of The String Equations,\" Commun. Math. Phys. 133, 261 (1990).\n[40] G. Münster, \"The 1/N Expansion And Instantons In CPN −1 Models On A Sphere,\" Phys. Lett. B\n118, 380 (1982).\n[41] H. Neuberger, \"Non-perturbative Contributions In Models With A Nonanalytic Behavior At\nInfinite N,\" Nucl. Phys. B 179, 253 (1981).\n[42] K. Papadodimas, \"S-duality and a large N phase transition in N = 4 SYM on K3 at strong\ncoupling,\" arXiv:hep-th/0510216.\n[43] S. Pasquetti and R. Schiappa, \"Borel and Stokes non-perturbative Phenomena in Topological String\nTheory and c=1 Matrix Models,\" arXiv:0907.4082 [hep-th].\n[44] L. Rozansky, \"A contribution of the trivial connection to Jones polynomial and Witten's invariant\nof 3-D manifolds. 1, 2,\" hep-th/9401061, 9403021, Commun. Math. Phys. 175 (1996) 275, 297.\n\n– 36 –\n\n\f[45] N. Seiberg and E. Witten, \"Electric-Magnetic Duality, Monopole Condensation, And Confinement\nIn N = 2 Supersymmetric Yang-Mills Theory,\" Nucl. Phys. B 426, 19 (1994) [Erratum-ibid. B 430,\n485 (1994)] [arXiv:hep-th/9407087].\n[46] S.H. Shenker, \"The strength of non-perturbative effects in string theory,\" in O. Álvarez, E. Marinari\nand P. Windey (eds.), Random Surfaces and Quantum Gravity, Plenum, New York 1992.\n[47] S. R. Wadia, \"A Study Of U(N) Lattice Gauge Theory In Two-Dimensions,\"\nEFI-79/44-CHICAGO, Jul. 1979.\n[48] E. Witten, \"Quantum field theory and the Jones polynomial,\" Commun. Math. Phys. 121 (1989)\n351.\n[49] E. Witten, \"Chern-Simons Gauge Theory As A String Theory,\" Prog. Math. 133, 637 (1995)\n[arXiv:hep-th/9207094].\n\n– 37 –\n\n\f"}