{"id": "http://arxiv.org/abs/1101.4825v1", "guidislink": true, "updated": "2011-01-25T14:36:02Z", "updated_parsed": [2011, 1, 25, 14, 36, 2, 1, 25, 0], "published": "2011-01-25T14:36:02Z", "published_parsed": [2011, 1, 25, 14, 36, 2, 1, 25, 0], "title": "The Dynamics of Stellar Coronae Harboring Hot-jupiters I. A\n  Time-dependent MHD Simulation of the Interplanetary Environment in the HD\n  189733 Planetary System", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1101.3271%2C1101.5805%2C1101.4839%2C1101.3494%2C1101.3110%2C1101.4307%2C1101.6061%2C1101.0582%2C1101.1199%2C1101.1575%2C1101.0109%2C1101.1633%2C1101.3402%2C1101.3244%2C1101.2596%2C1101.2811%2C1101.0079%2C1101.6009%2C1101.2406%2C1101.3753%2C1101.0536%2C1101.1675%2C1101.4106%2C1101.5521%2C1101.4385%2C1101.4956%2C1101.4030%2C1101.5308%2C1101.3188%2C1101.5403%2C1101.2445%2C1101.3889%2C1101.3683%2C1101.0419%2C1101.5858%2C1101.2407%2C1101.4970%2C1101.5252%2C1101.0576%2C1101.2931%2C1101.4758%2C1101.0015%2C1101.4016%2C1101.0692%2C1101.1955%2C1101.4370%2C1101.3604%2C1101.4771%2C1101.4727%2C1101.5026%2C1101.5053%2C1101.4509%2C1101.0578%2C1101.5159%2C1101.4517%2C1101.2235%2C1101.2905%2C1101.3969%2C1101.5047%2C1101.4877%2C1101.3813%2C1101.0979%2C1101.2668%2C1101.3515%2C1101.5884%2C1101.4749%2C1101.2951%2C1101.3682%2C1101.2011%2C1101.4130%2C1101.0614%2C1101.5814%2C1101.3850%2C1101.1616%2C1101.3873%2C1101.1741%2C1101.4085%2C1101.2019%2C1101.5374%2C1101.0554%2C1101.4297%2C1101.3386%2C1101.1980%2C1101.2082%2C1101.3995%2C1101.5181%2C1101.0966%2C1101.5761%2C1101.1436%2C1101.1845%2C1101.4825%2C1101.4918%2C1101.5188%2C1101.2919%2C1101.2534%2C1101.3803%2C1101.6054%2C1101.4865%2C1101.1959%2C1101.2513%2C1101.0061&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The Dynamics of Stellar Coronae Harboring Hot-jupiters I. A\n  Time-dependent MHD Simulation of the Interplanetary Environment in the HD\n  189733 Planetary System"}, "summary": "We carry out the first time-dependent numerical MagnetoHydroDynamic modeling\nof an extrasolar planetary system to study the interaction of the stellar\nmagnetic field and wind with the planetary magnetosphere and outflow. We base\nour model on the parameters of the HD 189733 system, which harbors a close-in\ngiant planet. Our simulation reveals a highly structured stellar corona\ncharacterized by sectors with different plasma properties. The star-planet\ninteraction varies in magnitude and complexity, depending on the planetary\nphase, planetary magnetic field strength, and the relative orientation of the\nstellar and planetary fields. It also reveals a long, comet-like tail which is\na result of the wrapping of the planetary magnetospheric tail by its fast\norbital motion. A reconnection event occurs at a specific orbital phase,\ncausing mass loss from the planetary magnetosphere that can generate a hot spot\non the stellar surface. The simulation also shows that the system has\nsufficient energy to produce hot-spots observed in Ca II lines in giant planet\nhosting stars. However, the short duration of the reconnection event suggests\nthat such SPI cannot be observed persistently.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1101.3271%2C1101.5805%2C1101.4839%2C1101.3494%2C1101.3110%2C1101.4307%2C1101.6061%2C1101.0582%2C1101.1199%2C1101.1575%2C1101.0109%2C1101.1633%2C1101.3402%2C1101.3244%2C1101.2596%2C1101.2811%2C1101.0079%2C1101.6009%2C1101.2406%2C1101.3753%2C1101.0536%2C1101.1675%2C1101.4106%2C1101.5521%2C1101.4385%2C1101.4956%2C1101.4030%2C1101.5308%2C1101.3188%2C1101.5403%2C1101.2445%2C1101.3889%2C1101.3683%2C1101.0419%2C1101.5858%2C1101.2407%2C1101.4970%2C1101.5252%2C1101.0576%2C1101.2931%2C1101.4758%2C1101.0015%2C1101.4016%2C1101.0692%2C1101.1955%2C1101.4370%2C1101.3604%2C1101.4771%2C1101.4727%2C1101.5026%2C1101.5053%2C1101.4509%2C1101.0578%2C1101.5159%2C1101.4517%2C1101.2235%2C1101.2905%2C1101.3969%2C1101.5047%2C1101.4877%2C1101.3813%2C1101.0979%2C1101.2668%2C1101.3515%2C1101.5884%2C1101.4749%2C1101.2951%2C1101.3682%2C1101.2011%2C1101.4130%2C1101.0614%2C1101.5814%2C1101.3850%2C1101.1616%2C1101.3873%2C1101.1741%2C1101.4085%2C1101.2019%2C1101.5374%2C1101.0554%2C1101.4297%2C1101.3386%2C1101.1980%2C1101.2082%2C1101.3995%2C1101.5181%2C1101.0966%2C1101.5761%2C1101.1436%2C1101.1845%2C1101.4825%2C1101.4918%2C1101.5188%2C1101.2919%2C1101.2534%2C1101.3803%2C1101.6054%2C1101.4865%2C1101.1959%2C1101.2513%2C1101.0061&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We carry out the first time-dependent numerical MagnetoHydroDynamic modeling\nof an extrasolar planetary system to study the interaction of the stellar\nmagnetic field and wind with the planetary magnetosphere and outflow. We base\nour model on the parameters of the HD 189733 system, which harbors a close-in\ngiant planet. Our simulation reveals a highly structured stellar corona\ncharacterized by sectors with different plasma properties. The star-planet\ninteraction varies in magnitude and complexity, depending on the planetary\nphase, planetary magnetic field strength, and the relative orientation of the\nstellar and planetary fields. It also reveals a long, comet-like tail which is\na result of the wrapping of the planetary magnetospheric tail by its fast\norbital motion. A reconnection event occurs at a specific orbital phase,\ncausing mass loss from the planetary magnetosphere that can generate a hot spot\non the stellar surface. The simulation also shows that the system has\nsufficient energy to produce hot-spots observed in Ca II lines in giant planet\nhosting stars. However, the short duration of the reconnection event suggests\nthat such SPI cannot be observed persistently."}, "authors": ["O. Cohen", "V. L. Kashyap", "J. J. Drake", "I. V. Sokolov", "C. Garraffo", "T. I. Gombosi"], "author_detail": {"name": "T. I. Gombosi"}, "author": "T. I. Gombosi", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1088/0004-637X/733/1/67", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1101.4825v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1101.4825v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "Submitted to ApJ, 14 pages, 9 figures", "arxiv_primary_category": {"term": "astro-ph.SR", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph.SR", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1101.4825v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1101.4825v1", "journal_reference": null, "doi": "10.1088/0004-637X/733/1/67", "fulltext": "Draft version November 8, 2018\nPreprint typeset using LATEX style emulateapj v. 11/10/09\n\nTHE DYNAMICS OF STELLAR CORONAE HARBORING HOT-JUPITERS I. A TIME-DEPENDENT MHD\nSIMULATION OF THE INTERPLANETARY ENVIRONMENT IN THE HD 189733 PLANETARY SYSTEM\nO. Cohen1 , V.L. Kashyap1 , J.J. Drake1 , I.V. Sokolov2 , C. Garraffo1 , T.I. Gombosi2\n\narXiv:1101.4825v1 [astro-ph.SR] 25 Jan 2011\n\nDraft version November 8, 2018\n\nABSTRACT\nWe carry out the first time-dependent numerical MagnetoHydroDynamic modeling of an extrasolar\nplanetary system to study the interaction of the stellar magnetic field and wind with the planetary\nmagnetosphere and outflow. We base our model on the parameters of the HD 189733 system, which\nharbors a close-in giant planet. Our simulation reveals a highly structured stellar corona characterized\nby sectors with different plasma properties. The star-planet interaction varies in magnitude and\ncomplexity, depending on the planetary phase, planetary magnetic field strength, and the relative\norientation of the stellar and planetary fields. It also reveals a long, comet-like tail which is a result\nof the wrapping of the planetary magnetospheric tail by its fast orbital motion. A reconnection\nevent occurs at a specific orbital phase, causing mass loss from the planetary magnetosphere that can\ngenerate a hot spot on the stellar surface. The simulation also shows that the system has sufficient\nenergy to produce hot-spots observed in Ca II lines in giant planet hosting stars. However, the short\nduration of the reconnection event suggests that such SPI cannot be observed persistently.\nSubject headings: stars: magnetic field - stars: coronae - planet-star interactions\n1. INTRODUCTION\nThe newly discovered exoplanets are not only newly\ndiscovered worlds literally, but are also new worlds in\nterms of the physical system they introduce us to. Many\nexoplanets have now been observed since their first discovery (Mayor & Queloz 1995; Schneider 1995; Mayor\net al. 2003). In particular, many Jupiter-like giant planets have been observed at a distance of less than 0.1 AU\nfrom their parent star, and some even within 10R? ,\nwhere they are essentially located inside the extended\nstellar corona (Schneider 1995; Mayor et al. 2003). It\nis not unreasonable to suppose that these giant planets have a substantial internal magnetic field (SánchezLavega 2004; Durand-Manterola 2009) and a magnetosphere, which could encompass a significant fraction of\nthe extended coronal volume. Indeed, the Jovian magnetosphere is the largest entity in our solar system after\nthe solar one (Bagenal et al. 2004).\nPerhaps the most fundamental difference between the\nclose-in planet scenario and magnetospheres in our own\nsolar system is that close-in planets and their magnetospheres can be located within the stellar Alfvén radius.\nIn analogy to the hydrodynamic sonic point (where the\nflow speed equals the sound speed), the Alfvén radius (or\nthe Alfvénic point) is the distance at which the accelerat√\ning stellar wind equals the Alfvén speed, uA = B/ 4πρ.\nHere B is the magnetic field strength and ρ is the plasma\nmass density. Beyond the Alfvén point, the flow is superAlfvénic and magnetic information (or energy) cannot\npropagate back towards the star and affect the corona.\nClose-in planets could then have a substantial effect on\nthe structure of the stellar corona, and the electromagnetic interaction between the planetary magnetic field\nand the corona might generate some observational signa1 Harvard-Smithsonian Center for Astrophysics, 60 Garden St.\nCambridge, MA 02138\n2 Center for Space Environment Modeling, University of\nMichigan, 2455 Hayward St., Ann Arbor, MI 48109\n\ntures.\nIn recent years, some signatures of star-planet interaction (SPI) have been observed. In a series of papers,\nShkolnik et al. (2003, 2005a,b, 2008) have described the\nobserved modulations in the Ca II K emission line, which\nis an indicator of chromospheric activity. They found\na line intensity increase corresponding to chromospheric\n\"hot spots\" with a period that is correlated with the\nplanetary orbital motion on HD 189733, HD 179949, τ\nBoo, and ν And. In some cases the location of these\nhot spots was aligned with the star-planet radial vector,\nwhile in other cases, the location of the intensity peak\nwas shifted from this vector by 70-170 degrees. Some of\nthese observations also revealed an on/off nature (Shkolnik et al. 2008).\nAt higher energies, Kashyap et al. (2008) performed a\nstatistical survey of systems with close-in giant planets,\nwhich revealed that the X-ray flux of these systems is\nabout 30-400% higher than the typical fluxes from similar stars with planets located further out in the stellar\nsystem. Poppenhaeger et al. (2010) did not find a similar\neffect for a sample of nearby stars, though they did uncover weak evidence for a combined effect of planetary\nmass and orbital distance. Saar et al. (2008) observed\nthe HD 179949 system in X-rays and found that emission associated with a hot spot likely engendered by SPI\ncontributed ≈30% to the emission at a mean plasma temperature of ≈ 1 keV. A similar trend in the UV band has\nbeen recently presented by (Shkolnik 2010).\nStellar coronae are dominated by the stellar magnetic\nfield, which also dictates the structure of the stellar wind\n(Parker 1958). The presence of a close-in planet with\na significant internal magnetic field could perturb this\nstellar field and might affect the large-scale structure of\nthe stellar corona. The planet can affect the corona in\ndifferent ways. First, a purely hydrodynamic affect is\nthe planet acting as an obstacle, deflecting the flow of\nplasma (i.e., the stellar wind) around it. Second, an\n\n\f2\nelectrostatic effect is the large-scale potential field topology being modified by the superposition of the stellar\nand planetary magnetic fields. Third, a MagnetoHydroDynamic (MHD) effect is expected due to the orbital\nmotion of the 'external' field (the planetary field) inside\nthe background conducting plasma of the stellar corona\nand the stellar wind. In any case, the process involves a\nmodification of the coronal magnetized medium via energy transfer between the planetary magnetic field and\nthe corona.\nFew theoretical SPI models have been developed to\nexplain the observed hot spots, as well as the overall\nincrease in observed X-ray flux (Cuntz et al. 2000; Cranmer & Saar 2007). In particular, Lanza (2008, 2009)\nproposed a mechanism to explain the observed phase\nshift in the location of the spots. This work also demonstrated that energy transfer from the magnetic field to\nthe plasma via magnetic reconnection between the coronal and planetary field (as the planet is moving through\nthe corona) can provide the observed overall energy increase (about 1021 W ). This amount of energy requires\nrather strong stellar and planetary magnetic fields or alternatively, this energy can be provided assuming the\nplanet triggers magnetic reconnection in a stellar corona\nthat is already energized due to accumulation of magnetic helicity provided by photospheric motions.\nPerforming numerical simulations of SPI is challenging. First, one needs to provide a dynamic model for\nthe ambient stellar corona and stellar wind. Second, it is\nnecessary to introduce the planet, which is an additional\nboundary condition in the model. Third, for capturing\nthe dynamics due to the planetary motion, one needs to\nconsider the planet as a time-dependent boundary condition. Ip et al. (2004), Preusse et al. (2006), and Preusse\net al. (2006) have studied the structure of Alfvén wings\nin the close-in planet around HD 179949 and made the\nanalogy of the magnetic interaction between Io and the\nJovian magnetosphere. Lipatov et al. (2005) and Johansson et al. (2009) have studied the structure of the\nplanetary magnetosphere using a hybrid code driven by\nan approximation to the stellar wind as a boundary condition. In both cases, the simulations included only the\nplanetary magnetosphere.\nIn a recent paper, Cohen et al. (2009) (hereafter Paper I) have presented two simplified MHD simulations of\nSPI. In the first case (\"Case A\"), both the stellar and\nplanetary magnetic fields were represented by magnetic\ndipoles, and the planet was fixed in the inertial frame\nof reference. A relative motion due to stellar rotation of\nthe coronal plasma with respect to the planetary magnetic field was obtained. In the second case (\"Case B\"),\nthe planetary magnetic field was dipolar again, while the\nstellar magnetic field was obtained using high-resolution\nsolar magnetic field data. This provided a realistic stellar\nfield, in contrast to the idealized dipole field used in Case\nA. In Case B, the planet was fixed the whole time and\nthe simulation was calculated in the frame of reference\nthat is rotating with the star in a tidally-locked manner\n(like the τ Boo system, Butler et al. 1997). The synthetic X-ray light curves of Case A revealed that there is\na drop in the X-ray flux when the planet is behind the\nstar. In Case B, the intensity drop was shifted by ≈ 60◦\nfrom the star-planet plane. The simulation also showed\n\nan increase in the total X-ray flux compare to a reference\ncase without a planet.\nIn paper I, we concluded that the increase in X-ray flux\nin systems with close-in planets is due to the planet preventing the corona from expanding, so that field lines\nthat would be open remain closed. As a result, the\nplasma cannot escape and the overall coronal density is\nhigher than in the case without a planet, or with a planet\nlocated further from the star. Since the X-ray flux is essentially a line of sight integration of the square of the\n(electron) density, the observed X-ray flux is higher in\nsuch systems. In addition, in paper I we proposed that\nthe observed hot-spots are associated with the magnetic\nconnectivity between the star and the planet, and that\nthe shift in the location of the hot-spots from the starplanet vector is probably due to the complexity of the\nstellar magnetic field.\nIn a follow-up study to Paper I, Cohen et al. (2010c,\nhereafter Paper II) investigated the influence of changing the semi-major axis of the co-rotating planet on the\nstellar mass and angular momentum loss. The disruption of the corona and wind occurs when the separation\nis sufficiently small that the planetary and stellar Alfvén\nsurfaces start to interact. We found that the spin-down\nof stars harboring close-in planets is reduced compared\nto that of stars with distant planets or no planets at all.\nWhile the results of the simulations presented in Papers I and II are significant, both cases were stationary and did not capture all of the dynamical effects that\nare predicted in the theoretical descriptions of SPI (see\nabove). In particular, magnetic reconnection between\nthe stellar field and the coronal field was not well captured, even in Paper I Case A where some relative motion between the magnetic bodies was introduced. In this\npaper, we present a dynamical MHD simulation, where\nwe include time-dependent circular orbital motion of the\nplanet around the star. The model is based on the observed properties of the HD 189733 system. However, we\nemphasize that the main goal of this study is to investigate the interaction of a close-in giant planet with the\nstellar corona of its host star as a fundamental plasma\nphysics problem, rather than to model HD 189733 specifically.\nThe structure of the paper is as follows. We present\nthe numerical model in Section 2. The results are presented in Section 3, and our main findings are discussed\nin Section 4. The results are summarized in Section 5.\n2. NUMERICAL SIMULATION\n\nWe perform the numerical simulation using the BATSR-US global MHD model, originally developed for the\nsolar corona and the solar wind (Powell et al. 1999; Tóth\net al. 2005; Cohen et al. 2007, Solar Corona module of\nthe Space Weather Numerical Framework). This model\nis driven by synoptic maps of the photospheric radial\nmagnetic field (magnetograms), which are routinely observed on the Sun. Similar observations are available for\nsome stellar systems using the Zeeman-Doppler-Imaging\n(ZDI) technique (Donati & Collier Cameron 1997; Donati\net al. 1999, see §2.1). Constrained by this boundary condition for the magnetic field, as well as the stellar surface\nplasma density, ρ0 , surface temperature, T0 , mass, M? ,\nradius, R? , and rotation period, P? , the model solves the\nset of conservation laws for the mass, momentum, mag-\n\n\f3\nnetic induction, and energy (the MHD equations). The\nstellar parameters of HD 189733 used in this simulation\nare listed in Table 1. The end result of the simulation is\na self-consistent solution for the solar/stellar corona and\nsolar/stellar wind, where the volumetric heating needed\nfor the wind acceleration is specified according to the\nmagnetic field distribution and an empirical relation between the solar wind terminal speed and the magnetic\nflux tube expansion (Wang & Sheeley 1990; Arge & Pizzo\n2000). The implementation of the solar model for the\nstellar coronal case can be found in paper I, Cohen et al.\n(2010b), and Cohen et al. (2010a). We refer the reader\nto these references for a detailed description of the numerical approach taken in the simulation described here.\n2.1. THE STELLAR MAGNETIC FIELD\nIn paper I, we approximated the stellar magnetic field\nas a dipole. However, recent observations by Fares et al.\n(2010) provide us with a better description of the stellar\nfield in the form of stellar magnetograms of HD 189733.\nThese measurements were taken during June and August\n2006, June 2007, and July 2008. In this work, our main\ngoal is to study the dynamic interaction between the\nplanetary magnetosphere and a complex, realistic stellar\nmagnetic field as the former passes through different sectors of the corona exhibiting different magnetic field and\nstellar wind properties. Therefore, we have adopted magnetograms based on the data presented by Fares et al.\n(2010). These low-resolution maps do not contain any\nfine structure, so they are sufficient for our goal We base\nour simulations on the synoptic map for 2006, since this\nis the epoch when observations by Shkolnik et al. (2008)\nwere made. Figure 1 shows the the map used in our simulation; this is directly comparable to that illustrated\nin the top-left of Figure 5 of Fares et al. (2010). Due\nto the inclination of the star, the map is incomplete in\nits southern hemisphere. However, the missing data occupies minor parts of the total area, so we choose to\nsuperimpose the map with a weak background 5 G (polar) dipole field, similar to that of the Sun, oriented with\npositive at the North pole, to complete the map.\nFigure 2 shows the steady-state MHD solution for the\nadopted magnetogram without the planet. It shows the\nthree-dimensional structure of the stellar coronal field,\nas well as the equatorial plane colored with contours of\nnumber density, n, and the Bz component of the field.\nPhase angles of 0, 90, 180, and 270, which refer to the reference positions of the planetary orbit, are also displayed.\nIn the remainder of this paper, we use this orientation\nto describe a particular phase angle. Since the planetary\nmagnetic field is a perfect dipole directed towards the\nNorth stellar pole, the map of Bz shown in Figure 2 is\nused as the stellar reference when describing the inclination between the stellar and the planetary field.\nTo act as a source of reference in helping to understand\nthe role of the complex surface magnetic topology in the\nsimulations including the planet, we also computed a\nsimulation for a simplified dipolar stellar magnetic field\nconfiguration, with an equatorial field strength of 5 G.\n2.2. MODELING THE PLANET\nIn our simulation, the planet is represented by an additional set of boundary conditions for a second body (the\n\nfirst body being the star). In order to include the orbital\nmotion in the simulation, the coordinates of this second\nbody are updated according to the time-dependent planetary orbital motion. Here we assume a circular orbit in\nthe equatorial plane, but in principle any inclined orbit\ncan be specified. At each time step, the grid structure\nis updated to determine which grid cells are boundary\ncells and which cells are real (non-ghost) cells. The frequency of the updating of coordinates is constrained by\nthe numerical stability condition of the simulation (the\nrelation between the grid size, ∆x, the time step, ∆t,\nand the Alfvén speed). In addition, the grid resolution\naround the second body should be high enough so that\nthe body is well-resolved. For this reason, we choose a\nplanetary radius of Rp = 2RJ , with RJ being the radius\nof Jupiter, instead of the observed value of 1.1RJ . The\ngrid size around the second body is ∆x = 0.025R? with\n18 grid cells across the body. Using the flexible grid capabilities of the model, we also used this high-resolution\ngridding around the stellar surface (where ∆x = 0.04R? ),\nand along the planetary trajectory. Figure 3 shows the\ngrid structure on the equatorial plane with the two bodies marked in red.\nThe strength of the planetary field is unknown. On\nthe one hand, based on stellar evolution models the internal magnetic fields of hot Jupiters are expected to be\nlower than that of Jupiter due to tidal locking and a consequently longer rotation period (Sánchez-Lavega 2004).\nOn the other hand, a strong field may be required to\nshield these gas giants from erosion by the strong stellar\nwind. Here we study two set of parameters for the planet.\nA \"Strong\" case, where we use a dipole equatorial field\nof 2 G, and a \"Weak\" case, with a dipole equatorial field\nof 0.1 G. While we use a fixed boundary condition for\nthe planetary temperature, Tp = 104 K (Murray-Clay\net al. 2009), the boundary condition for the surface density enables us to control the planetary thermally driven\noutflow. This outflow is obtained in the simulation due\nto the fact that the second body serves as a permanent\nmass source in an environment with lower density. Here\nwe choose a boundary value of np = 109 cm−3 for the\n\"Strong\" case and a boundary value of np = 107 cm−3\nfor the \"Weak\" case. In Section 4 we discuss the importance of this free parameter in the solution.\n3. RESULTS\n\nA salient characteristic of the simulations carried out\nhere is the dependence of the results on orbital phase.\nWe emphasize two main aspects here. Firstly, we find\nthat when the planet is not co-rotating, as was assumed\nin Paper I, it can no longer provide a steady means of\npreventing the wind-driven plasma from expanding outward. While the planet still acts to inhibit angular moment loss, a consequence of the interaction is that this\nvaries through the orbital cycle. Secondly, magnetic reconnection occurs at certain phases in the combined stellar and planetary magnetic fields that allows planetary\ngas to escape the form its magnetospheric confinement.\nIn Paper I, we considered the case of a planet that\nwas tidally-locked-fixed in location relative the stellar\nsurface and co-rotating with the stellar magnetic field.\nThis led to the stellar wind being permanently obstructed\nin the direction of the planet and the plasma here being\nbottled up. When the planet moves relative to the stellar\n\n\f4\nfield, the wind in the direction of the planet does not\nremain bottled up, but can slip past once the planet has\nmoved on. Consequently, the amount of material that\nis confined by the presence of the planet is reduced, and\nthe structure of the ambient corona and stellar wind is\nquickly recovered.\nIn Paper II, we found that the stellar mass and angular momentum loss rates are reduced due to the planetary effect on the stellar corona. Once the planetary\nand stellar Alfvén surfaces start to interact, the coronal and wind structure is disrupted by the obstacle-the\nplanet-so that the mass flux carried by the stellar wind\ndecreases. This leads to a long-term feedback from the\nplanet on the star in the form of a reduction in the stellar angular momentum loss rate to the wind, so that the\nspin-down of stars harboring close-in planets is not as\nhigh as it would be without the planet, consistent with\nobservations (Pont 2009; Lanza 2010). This study again\nconsidered planets co-rotating with the stellar surface.\nIn the simulations here, that restraint has been removed.\n3.1. ORBITAL PHASE-DEPENDENT MASS LOSS\nThe gas number density from the simulation at four\ndifferent orbital phases is illustrated in Figure 4 for the\n\"Strong\" case. The salient feature of the density distribution is the presence of a comet-like tail of plasma\ntrailing the planet. This feature has been observed by\nVidal-Madjar et al. (1994) and has been predicted from\nhydrodynamic simulations by Schneiter et al. (2007). We\nwill discuss this feature in detail in § 3.3 below. In Figure 5 we show the total outward mass flux carried by the\nstellar wind as a function of planetary orbit phase angle\nthat underlies the behavior seen in Figure 4. We choose\nto calculate the mass flux through three spheres in order to illuminate the dependence of the mass loss as a\nfunction of the distance from the star. The first sphere is\nof radius r = 6R? , which crosses the region between the\nstar and the planet, the second is for r = 10R? , which\nencompasses the planet but crosses the planetary magnetosphere, and the third is for r = 23R? , which occupies\nmost of the simulation domain. At r = 6R? , most of\nthe mass flux is carried out by the stellar wind, with a\nminor contribution from the planet. The mass flux at\nr = 10R? is dominated by the planetary contribution (in\naddition to stellar wind mass source), and this is the reason for its relatively high values. However, most of this\nplasma is actually trapped inside the magnetosphere so\nthat it does not contribute to the total mass flux of the\nsystem-the apparent outward flow from the planet here\nis balanced by a similar flow inward. The total outward\nmass flux at r = 23R? is instead again dominated by the\nstellar wind, except for phase angles of 0 - 120◦ , where a\nmagnetic reconnection event (§ 3.2) allows plasma to escape from the planetary magnetosphere and to be added\nto the total radial mass flux. Most of this plasma falls\nonto the star, and this can be seen in Figure 4 as a bridge\nof higher density joining the star and planet. However,\nour mass flux calculations indicate that there is also a\nsignificant planetary contribution from this reconnection\nto the total mass flux of the stellar wind.\n3.2. MAGNETIC RECONNECTION AND\nPLANETARY PLASMA ESCAPE\n\nAs the planet moves into a region where the stellar\nfield has a different structure, reconnection can occur\nbetween planetary and stellar fields if they have opposite polarity. In the \"Strong\" case, this occurs around\nphase angles of 60 - 120◦ , when the planet gets into a region of negative Bz stellar field associated with a helmet\nstreamer. This is seen in Figure 2, that illustrates the solution for the stellar field alone and does not include the\nplanet. The planetary plasma is generally confined and\nprevented from expanding freely by the magnetic field\nof the planet. The reconnection event releases some of\nthis bottled-up plasma and it subsequently falls onto the\nstar. This is seen as a high density region between the\nplanet and the star in Figure 4. This high density region\nis absent at phase angles 150 - 300◦ , prior to the reconnection and after the released plasma has dissipated. In\nthe \"Weak\" case, shown in Figure 6, the planetary magnetosphere suffers from stronger variations than in the\n\"Strong\" case as seen by the change in the size of its\ntail. The highest mass escape from the magnetosphere\noccurs around 130◦ , not 60◦ (for the \"Strong\" case). This\ndemonstrates how sensitive the \"observable\" feature is\nto the planetary parameters. In this particular simulation, a weaker planetary field with the same stellar field\nresulted in a smaller deviation of the reconnection site\nfrom the star-planet axis. This is because a weaker planetary field \"feels\" the opposite stellar field later than the\n\"Strong\" case.\nThe planetary outflow and the resulting \"hot spot\"\nwhere it falls on the stellar surface for the \"Strong\" case\ncan be seen in Figure 7, where a snapshot is presented for\nthe time a magnetic reconnection event has been identified. A local region of infalling mass is seen clearly in\nthe mass flux plot at the stellar surface. For reference,\nwe show a similar snapshot from the \"idealized\" simulation computed for the dipole stellar magnetic field of\n5 G and a planetary boundary number density value of\nnp = 1010 cm−3 . In this case, there is a continual opening and closing of field lines as the planet revolves about\nthe star such that there is always an open field channel\njoining the star and planet. The planetary gas is free to\nexpand along this open field region and results in a continuous infall of matter onto a spot on the stellar surface\nthat lies at a constant phase offset from the planetary orbital phase. In the lower panels of Figure 7 this flow can\nbe seen impacting the star approximately 180◦ ahead of\nthe planet.\nThe reconnection event for the realistic stellar magnetogram simulation is shown in detail in Figure 8. The\nfour panels on the left show selected magnetic field lines\nand color contours of the number density over the equatorial plane. When the planet is far from the reconnection region (top-left panel, phase angle of 270◦ ), the\nfield topology is of the ambient stellar field, with some\nclosed field lines of the helmet streamer and some open\nfield lines dragged by the stellar wind. At a phase angle of 60◦ (top-right), the field lines that were originally\nopen are now connecting the star and the planet. In\naddition, some of the closed field lines of the stellar helmet streamer are now open as a result of the reconnection in front of the planet. At a phase angle of 100◦\n(bottom-left), reconnection occurs behind the planet,\nclosing down some field lines. Finally, at a phase angle\nof 180◦ (bottom-right), the field topology reverts back to\n\n\f5\nits original, ambient stellar field. The two right panels\nshow the reconnection point in front of the planet (phase\nangle of 60◦ ), releasing planetary material onto the star,\nand the reconnection point behind the planet (phase angle of 100◦ ), causing a disconnection of a plasmoid from\nthe planetary tail.\n3.3. PLANETARY MAGNETOSPHERE\nCONFIGURATION\nThe shape of planetary magnetospheres in our solar\nsystem is largely defined by solar wind conditions and,\nin particular, by the orientation of the Interplanetary\nMagnetic Field (IMF). In the case of close-in planets like\nthe system simulated here, the magnetospheric shape is\ndefined by the plasma conditions in the particular coronal sector interacting with the planet. The isolation of\nthe planet from the harsh coronal environment depends\non the magnetopause location, which is defined as the\nsurface of pressure balance between the stellar wind dynamic pressure and the planetary magnetic pressure. If\na planet is located far from the star, the magnetopause is\nassociated with a shock in front of it as the stellar wind\nis slowed down to subsonic speeds. In the case of a closein planet, the magnetopause can be located in regions\nwhere the stellar wind never reaches supersonic speed\nand is still accelerating, so the structure of the surface of\npressure balance can be highly complicated. For display\npurposes, we choose instead to show the surface where\nthe radial velocity in the frame of reference centered on\nthe planet vanishes in the direction of the star. Alternatively, this is the location where the stellar wind in the\ndirection of the planet vanishes. Figure 9 shows how this\nlocation changes in four selected frames of the simulation\n(before, during, and after the reconnection event). It can\nbe seen that this boundary moves away from the planet\nfollowing reconnection due to the plasma escaping from\nthe planetary magnetosphere. This line never reaches too\nclose to the planet, where the magnetic pressure dominates. Due to the dipole-like magnetic field lines close\nto the planetary surface, we conclude that the dynamic\npressure of the planetary outflow at this region is not significant. The boundary value for the planetary density\naffects mainly the filling time of the planetary magnetosphere after a reconnection event that allows magnetospheric plasma to escape.\nAnother important magnetospheric feature obtained\nfrom our simulation is the long magnetospheric comet\n-like tail that stretches round almost 90◦ behind the\nplanet. This tail is important since it increases the\ncoronal volume affected by the planet. In our static,\ntidily-locked simulations, as well as in the interaction\nof solar wind and magnetospheres in the solar system,\nthe magnetospheric tail is aligned with the direction\nof the stellar wind. Here, however, it is perpendicular\nto the wind direction. Therefore, as long as magnetic\nreconnection does not occur, it serves as an elongated\nobstacle standing in the way of the stellar wind, and can\nhave a larger impact on the wind structure and mass\nloss rate. The convection electric field, E = −usw × B\n(usw is the stellar wind velocity) in this case should be\nstronger than when the magnetospheric tail is aligned.\nThe magnetospheres of close-in planets should, then,\nintroduce different configurations and dynamics in terms\nof polar cup potentials, particle drifts, and magne-\n\ntospheric/stellar wind drag. The interaction of such\nmagntospheres with Coronal Mass Ejections (CMEs)\nshould also be quite different from the interaction of\nCMEs with magnetospheres in the solar system, since\nthe CME here will hit the magnetosphere from its side\nand not from its nose. These processes are potentially of\nconsiderable interest, but are beyond the scope of this\npaper.\n4. DISCUSSION\n\nOur simulation reveals a highly dynamic interaction\nbetween the stellar and planetary field as the planet is\norbiting the star. This is due to the complex stellar field,\nas well as the stellar wind topology. The simulation\ndemonstrates that, even when we use a low-resolution\nmap for the surface magnetic field, which does not include fine structure and small-scale active regions, the\nstellar corona contains sectors with quite different plasma\nproperties. The interaction between the planetary and\ncoronal field changes from one sector to the next, while\nsome of the notable features are due to the planetary\ntransition between the different sectors. This is in contrast to the behavior of the \"idealized\" stellar dipolar\nfield simulation, in which the interaction between fields\nis, not surprisingly, more continuous in nature, with an\nopen field channel always joining the two bodies.\nThe dynamical, short-lived nature of the different features of the interaction in the realistic field case suggests\nthat searching for observable SPI signatures could be\nproblematic, and that \"static\" theoretical models for the\norigin of these signatures might not be valid. Based on\nthe simulation, the interaction between the coronal field\nand the planetary magnetosphere will not in general be\npersistent, at least for systems with short planetary orbital periods. These are the cases where SPI is expected\nto be the strongest. In addition, the stellar magnetic\nfield topology determines the location where changes in\nthe interaction take place, but this magnetic topology is\nexpected to exhibit secular change within time-scales of\nmonths or even less.\nThe idealized scenario in which the stellar and planetary fields are described as perfect, opposite dipoles can\nexplain persistent particle acceleration as a result of magnetic reconnection between the two fields (Ip et al. 2004;\nCuntz et al. 2000; Cranmer & Saar 2007; Lanza 2008,\n2009). A tidally locked system can produce a plasma\ndensity enhancement in closed coronal loops that would\nbe open without the planet (paper I). However, based\non our simulation, none of these proposed scenarios can\nbe persistent for the case of a close-in planet that is\nnot tidally-locked with the stellar rotation. Moreover,\nrecent papers (Zarka 2007; Vidotto et al. 2010) have\nsuggested that reconnection events between stellar and\nplanetary fields can generate radio emissions that can\nbe observed and constrain the magnitude of the planetary field. These calculations assume that the accelerated\nelectrons, which are the source for the radio signal, appear during the period of time when the planetary and\nstellar fields are exactly opposite (in particular, during a\ngeomagnetic event, when these fields can be opposite for\nseveral days). Our simulation shows that for the general\ncase the situation of opposite fields is likely to be much\nshorter in the case of a realistic, more complex stellar\n\n\f6\nfield, and that reconnection events last for an hour or\ntwo at the most. If radio emissions from such events can\nbe detected at all, they will require long-term monitoring observations in order to distinguish such events from\nflares and other background radio signals.\nDespite its short duration, the reconnection event leads\nto a release of an amount of plasma from the planetary\nmagnetosphere (the exact amount, of course, depends\non the particular set of planetary boundary conditions).\nBased on the mass flux displayed in Figure 7, we define an\naverage value of F = 10−11 g s−1 cm−2 and a flux channel cross section of A = π(0.1R? )2 to determine the total\nplanetary mass flux, Ṁp = F * A = 1.5 * 10−14 MJ yr−1 .\nThe average mass flux for the \"Weak\" case is about two\ntimes lower than the \"Strong\" case. If we assume that\nsuch reconnection events occur every orbit (2.2 days), the\nplanetary magnetosphere loses 2.5 * 10−12 MJ in a single\nyear (∼ 2.5 * 10−15 M yr−1 )-not a significant amount\nintegrated over the lifetime of the planet. The reconnection depends on the structure of the stellar magnetic\nfield, which is not constant. Therefore, there are likely to\nbe periods during which more reconnection events occur,\nand periods with fewer events. We further stress that this\nmass flux is of \"cold\" plasma escaping from the planetary\nmagnetosphere and is not an attempt to model the actual\natmospheric escape from the planet. Nevertheless, these\nreconnection events should include particle acceleration\nand precipitation, as well as radiation enhancement that\nmight impact the atmospheric escape in general. In addition, stellar coronal mass ejections could drive similar\nreconnection events on top of the reconnection between\nthe ambient planetary and static stellar fields. Such effects, however, are out of the scope of this paper and we\ndefer further discussion to future work.\nIt is tempting to associate the infalling planetary\nplasma with the hot spot discovered in the Ca II K band\nby Shkolnik et al. (2003, 2005a,b, 2008), but we caution\nthat our simulations do not describe the precise mechanism by which energy is transferred from the planetary\norbital motion to the stellar corona. The volumetric integral of the sum of the magnetic and the kinetic energy\nin the simulation domain is\n\u0013\nZ \u0012 2\nB\nρu2\nEtot =\n+\ndV.\n(1)\n8π\n2\nThroughout the simulation, the value of this integral for\nthe \"Strong\" case ranges between (5.4 - 5.6)*1036 ergs,\nwith a change of the order of 1%. The change in the\nenergy for the \"Weak\" case is about the same. The\ntotal volumetric energy for the MHD solution without\nthe planet is 5.2 * 1036 ergs so that the contribution of\nthe planetary orbital motion and the planetary magnetic\nfield is about 2 * 1035 ergs. Since the MHD model is\nlimited in its description of magnetic reconnection, it\ncan only produce the change in magnetic field topology, which is the source for modulations in the total\nenergy. In reality however, magnetic reconnection between the stellar and planetary fields will involve dissipation of this energy, as well as non-thermal particle\nacceleration. Therefore, the 1% difference in the total\nenergy, Eavail = 5 * 1034 ergs, is the available energy for\nthese mechanisms. The timescale, τ , for the reconnection\nevent in our simulation is about a quarter of an orbit, or\n\n5 * 104 s, so the total available power is:\nP ≈ Eavail /τ = 1030 ergs s−1 .\n\n(2)\n\nAssuming an efficiency of 1% in converting this power,\nour simulation finds at least 1028 ergs s−1 is available\nto accelerate particles along field lines connecting the\nplanet and the star. These accelerated particles then\nhit the chromosphere and cause the observed hot-spots.\nThis amount of energy is comparable with the total Xray power of HD 189733 (Pillitteri et al. 2010), and it\nis reasonable to believe that it can produce the observed\nmodulations in the Ca II band, which are also estimated\nto involve energies of the order of 1028 − 1028 ergs s−1\n(Shkolnik et al. 2005a; Hall et al. 2007). Variations in the\ntotal mass flux at different radial distances in the simulation domain (see Figure 5) reveal that the planetary\nmagnetosphere contributes to the total mass flux during the reconnection event. The total mass flux through\nthe Alfvén surface based on the simulation without the\nplanet is 8.3 * 10−14 M yr−1 , which is comparable to,\nbut slightly smaller than, the values from the simulation\nthat includes the planet. This differs from the result obtained in Paper II for a synchronously revolving planet:\nin that case, the magnetosphere served only as an obstacle that reduces the amount of stellar wind that crosses\nthe Alfvén surface. Here however, the planetary magnetospheric shape can be changed by the dynamics of the\nsystem, it can contribute to the total mass flux, and it\ndisrupts the wind only for a short duration of time. It\nseems that for the particular set of parameters of the\nHD 189733 system, the effect of the planet on the stellar\nwind mass loss rate is not that important.\n5. SUMMARY AND CONCLUSIONS\n\nWe have performed a realistic MHD simulation of SPI\nusing the parameters of the HD 189733 planetary system. The simulation is based on the observed stellar\nsurface magnetic field and includes the stellar wind, timedependent planetary orbital motion and planetary outflow. We choose to study two cases. One with strong\nplanetary magnetic field and high base density and one\nwith weak planetary field and low base density. Based\non the simulation results, our main findings are:\n1. The use of a realistic stellar field results in a highly\nstructured stellar corona characterized by sectors\nwith different plasma properties.\n2. As the planet orbits the star, it interacts with\nthe different sectors. Each sector crossing, as well\nas the transitions between the sectors, leads to\nchanges in the SPI.\n3. The planet is followed by a long, comet-like tail\nof plasma that represents its magnetospheric tail\nwrapped around due to the rapid planetary orbital\nmotion. This tail is almost perpendicular to the\nstellar wind direction and can lead to magnetospheric dynamics which differ to those in the case\nin which the magnetospheric tail is aligned with the\nwind direction.\n4. A large reconnection event occurs when the planetary and stellar field are opposite in polarity,\n\n\f7\nwhere the reconnection site varies depends on the\nplanetary field strength. This reconnection event\ncauses a release of cold plasma from the planetary magnetosphere with a mass flux of Ṁp =\n2.5 * 10−12 MJ yr−1 . However, this escape of material can be defined as a magnetospheric escape\nrather than atmospheric escape. The latter cannot\nbe define by the simulation presented here since it\ndoes not include a self-consistent atmospheric escape mechanism and is only controlled by a boundary value for the planetary density;\n5. The short duration of the reconnection event suggests that such SPI cannot be observed persistently,\nand in particular when such signatures are being\nsearched for in radio bands.\n6. The simulation indicates that a sufficient amount\nof energy can be dissipated by the star-planet interaction to explain the hot-spots observed in the\nCa II lines of stars hosting close-in planets.\n7. The total mass flux carried by the stellar wind is\n\nmodulated by the planetary orbit and the particular value at any time depends on the magnetic\ntopology.\nIn this work, we used the parameters of HD 189733,\nwith planetary semi-major axis of a = 8.8R? . It is reasonable to believe that with a smaller value of a, some\nof the SPI effects in the simulation would be enhanced.\nFurther studies of SPI involving a physical atmospheric\nescape from the planet, as well as the impact of stellar\ncoronal mass ejections on the planetary magnetosphere,\nwould be highly motivated.\nWe would like to thank Scott Wolk and Steve Saar\nfor their useful comments. OC is supported by SHINE\nthrough NSF ATM-0823592 grant, and by NASALWSTRT Grant NNG05GM44G. JJD and VLK were\nfunded by NASA contract NAS8-39073 to the Chandra\nX-ray Center. Simulation results were obtained using the\nSpace Weather Modeling Framework, developed by the\nCenter for Space Environment Modeling, at the University of Michigan with funding support from NASA ESS,\nNASA ESTO-CT, NSF KDI, and DoD MURI.\n\nREFERENCES\nArge, C. N., & Pizzo, V. J. 2000, J. Geophys. Res., 105, 10,465\nBagenal, F., Dowling, T. E., & McKinnon, W. B. 2004, Jupiter :\nthe planet, satellites and magnetosphere, ed. Bagenal, F.,\nDowling, T. E., & McKinnon, W. B. (Cambridge University\nPress: Cambridge, UK)\nButler, R. P., Marcy, G. W., Williams, E., Hauser, H., & Shirts,\nP. 1997, ApJ, 474, L115+\nCohen, O., Drake, J. J., Kashyap, V. L., Hussain, G. A. J., &\nGombosi, T. I. 2010a, ApJ, 721, 80\nCohen, O., Drake, J. J., Kashyap, V. L., Korhonen, H., Elstner,\nD., & Gombosi, T. I. 2010b, ApJ, 719, 299\nCohen, O., Drake, J. J., Kashyap, V. L., Saar, S. H., Sokolov,\nI. V., Manchester, W. B., Hansen, K. C., & Gombosi, T. I.\n2009, ApJ, 704, L85\nCohen, O., Drake, J. J., Kashyap, V. L., Sokolov, I. V., &\nGombosi, T. I. 2010c, ApJ, 723, L64\nCohen, O., Sokolov, I. V., Roussev, I. I., Arge, C. N., Manchester,\nW. B., Gombosi, T. I., Frazin, R. A., Park, H., Butala, M. D.,\nKamalabadi, F., & Velli, M. 2007, Astrophys. J., 654, L163\nCranmer, S. R., & Saar, S. H. 2007, ArXiv Astrophysics e-prints\nCuntz, M., Saar, S. H., & Musielak, Z. E. 2000, Astrophys. J.,\n533, L151\nDonati, J., & Collier Cameron, A. 1997, MNRAS, 291, 1\nDonati, J., Collier Cameron, A., Hussain, G. A. J., & Semel, M.\n1999, MNRAS, 302, 437\nDurand-Manterola, H. J. 2009, Planet. Space Sci., 57, 1405\nFares, R., Donati, J., Moutou, C., Jardine, M. M., Griessmeier, J.,\nZarka, P., Shkolnik, E. L., Bohlender, D., Catala, C., &\nCameron, A. C. 2010, MNRAS, 406, 409\nHall, J. C., Lockwood, G. W., & Skiff, B. A. 2007, AJ, 133, 862\nIp, W., Kopp, A., & Hu, J. 2004, ApJ, 602, L53\nJohansson, E. P. G., Bagdonat, T., & Motschmann, U. 2009,\nA&A, 496, 869\nKashyap, V. L., Drake, J. J., & Saar, S. H. 2008, Astrophys. J.,\n687, 1339\nLanza, A. F. 2008, Astron. & Astrophys., 487, 1163\n-. 2009, A&A, 505, 339\n-. 2010, A&A, 512, A77+\nLipatov, A. S., Motschmann, U., Bagdonat, T., & Griessmeier, J.\n2005, Planet. Space Sci., 53, 423\nMayor, M., Naef, D., Pepe, F., Queloz, D., Santos, N., & Udry, S.\n2003, The Geneva extrasolar planet search programmes,\nhttp://exoplanets.eu\nMayor, M., & Queloz, D. 1995, Nature, 378, 355\n\nMurray-Clay, R. A., Chiang, E. I., & Murray, N. 2009,\nAstrophys. J., 693, 23\nParker, E. N. 1958, ApJ, 128, 664\nPillitteri, I., Wolk, S. J., Cohen, O., Kashyap, V., Knutson, H.,\nLisse, C. M., & Henry, G. W. 2010, ApJ, 722, 1216\nPont, F. 2009, MNRAS, 396, 1789\nPoppenhaeger, K., Robrade, J., & Schmitt, J. H. M. M. 2010,\nA&A, 515, A98+\nPowell, K. G., Roe, P. L., Linde, T. J., Gombosi, T. I., & de\nZeeuw, D. L. 1999, Journal of Computational Physics, 154, 284\nPreusse, S., Kopp, A., Büchner, J., & Motschmann, U. 2006,\nA&A, 460, 317\nSaar, S. H., Cuntz, M., Kashyap, V. L., & Hall, J. C. 2008, in\nIAU Symposium, Vol. 249, IAU Symposium, ed. Y.-S. Sun,\nS. Ferraz-Mello, & J.-L. Zhou, 79–81\nSánchez-Lavega, A. 2004, Astrophys. J., 609, L87\nSchneider, J. 1995, The Extrasolar Planets Encyclopaedia,\nhttp://exoplanet.eu\nSchneiter, E. M., Velázquez, P. F., Esquivel, A., Raga, A. C., &\nBlanco-Cano, X. 2007, ApJ, 671, L57\nShkolnik, E. 2010, in Bulletin of the American Astronomical\nSociety, Vol. 41, Bulletin of the American Astronomical\nSociety, 531\nShkolnik, E., Bohlender, D. A., Walker, G. A. H., & Collier\nCameron, A. 2008, Astrophys. J., 676, 628\nShkolnik, E., Walker, G. A. H., & Bohlender, D. A. 2003, ApJ,\n597, 1092\nShkolnik, E., Walker, G. A. H., Bohlender, D. A., Gu, P.-G., &\nKurster, M. 2005a, Astrophys. J., 622, 1075\nShkolnik, E., Walker, G. A. H., Rucinski, S. M., Bohlender, D. A.,\n& Davidge, T. J. 2005b, Astronom. J., 130, 799\nTóth, G., Sokolov, I. V., Gombosi, T. I., Chesney, D. R., Clauer,\nC. R., De Zeeuw, D. L., Hansen, K. C., Kane, K. J.,\nManchester, W. B., Oehmke, R. C., Powell, K. G., Ridley,\nA. J., Roussev, I. I., Stout, Q. F., Volberg, O., Wolf, R. A.,\nSazykin, S., Chan, A., Yu, B., & Kóta, J. 2005, Journal of\nGeophysical Research (Space Physics), 110, 12226\nVidal-Madjar, A., Lagrange-Henri, A., Feldman, P. D., Beust, H.,\nLissauer, J. J., Deleuil, M., Ferlet, R., Gry, C., Hobbs, L. M.,\nMcGrath, M. A., McPhate, J. B., & Moos, H. W. 1994, A&A,\n290, 245\nVidotto, A. A., Opher, M., Jatenco-Pereira, V., & Gombosi, T. I.\n2010, ApJ, 720, 1262\nWang, Y.-M., & Sheeley, N. R. 1990, ApJ, 355, 726\nZarka, P. 2007, Planet. Space Sci., 55, 598\n\n\f8\nTABLE 1\nStellar and Planetary Parameters of HD 189733\nStellar Parameter\nR?\nM?\nP?\nPlanetary Parameter\nRp\nPorb\nBeq\na\n\nValue\n0.76 R\n0.82 M\n11.95 d\nValue\n1.1 RJ a\n2.2 d\n2.0 G\n8.8 R?\n\naA\n\nvalue of 2 has been adopted in this simulation)\n\nFig. 1.- A map of the radial stellar magnetic field reproduced from Fares et al. (2010) in a polar projection (left), and in a longitudelatitude projection (right).\n\nFig. 2.- Left: steady-state MHD solution driven by the surface field map without the planet. The stellar surface is shown as a\nsphere colored with contours of the radial magnetic field. Blue lines represent closed field lines and yellow lines represent open field lines.\nnumber density (middle) and Bz (right) color contours are displayed on the equatorial plane along with magnetic filed lines shown as black\nstreamlines. Selected phase angles of the planetary orbit are shown as well.\n\n\f9\n\nFig. 3.- Left: the grid structure adopted for the simulation including the planet displayed on the equatorial plane in black, with the\nstar and the planet shown as red circles. Right: a zoom-in on the vicinity of the planet.\n\n\f10\n\nFig. 4.- Color contours of the number density shown on the equatorial plane for selected phase angles for the \"Strong\" case. Axes are\nexpressed in units of stellar radii.\n\nFig. 5.- Mass flux as a function of planetary phase angle integrated over spheres of r = 6R? (blue), r = 10R? (red), r = 23R? (black).\n\n\f11\n\nFig. 6.- Same display as Figure 4 but for the \"Weak\" case. Note that the minimum density value here is slightly lower than Figure 4.\n\n\f12\n\nFig. 7.- Color contours of number density (left) and mass flux (right) displayed on the equatorial plane and on a sphere of r = 2R? ,\nwith the planet shown as a blue sphere. White line separates positive and negative values of the mass flux. The plots are for the dynamic\nsimulation for the time when a magnetic reconnection event has been identified, at phase angle of 60 degrees (top), and for the idealized\nsimulation at a similar phase with an enhanced planetary surface density and dipolar stellar field (bottom).\n\n\f13\n\nFig. 8.- Left four panels: the equatorial plane colored with number density contours, together with red and blue spheres representing the\nstar and the planet, respectively. The panels are for phase angles of 270 (top-left), 60 (top-right), 100 (bottom-left), and 180 (bottom-right)\ndegrees. Selected magnetic field lines are shown in yellow and blue. Two right panels: the equatorial plane colored with number density\ncontours for phase angle of 60 degrees(top) and 100 degrees (bottom). The white arrows indicate the regions where reconnection is taking\nplace.\n\n\f14\n\nFig. 9.- Magnetospheric boundary at different phase angles defined by vanishing radial stellar wind. In each case the star lies to the\nright, out of the frame. The boundary is shown as a solid red line displayed on the star-planet meridional plain along with color contours\nof number density. Selected magnetic field lines are shown in white. Illustrated are phase angles of 270 (top-left panel), 180 (top-right\npanel), 60 (bottom-left panel), and 100 (bottom-right panel) degrees.\n\n\f"}