{"id": "http://arxiv.org/abs/0811.3778v1", "guidislink": true, "updated": "2008-11-23T22:49:47Z", "updated_parsed": [2008, 11, 23, 22, 49, 47, 6, 328, 0], "published": "2008-11-23T22:49:47Z", "published_parsed": [2008, 11, 23, 22, 49, 47, 6, 328, 0], "title": "Standard Model Higgs Searches at the LHC", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0811.0788%2C0811.3979%2C0811.3575%2C0811.3377%2C0811.0358%2C0811.4638%2C0811.0330%2C0811.2142%2C0811.1138%2C0811.4576%2C0811.3560%2C0811.4449%2C0811.4763%2C0811.0331%2C0811.3354%2C0811.4505%2C0811.2350%2C0811.1469%2C0811.0815%2C0811.4504%2C0811.3266%2C0811.0865%2C0811.3570%2C0811.4567%2C0811.4331%2C0811.2531%2C0811.3763%2C0811.1945%2C0811.0609%2C0811.3368%2C0811.0950%2C0811.3147%2C0811.4040%2C0811.2809%2C0811.4318%2C0811.0370%2C0811.1946%2C0811.1421%2C0811.0356%2C0811.3449%2C0811.3729%2C0811.3036%2C0811.3778%2C0811.4622%2C0811.3287%2C0811.0849%2C0811.4488%2C0811.2110%2C0811.4721%2C0811.2762%2C0811.3948%2C0811.0563%2C0811.0690%2C0811.2477%2C0811.2165%2C0811.4651%2C0811.1907%2C0811.1406%2C0811.0271%2C0811.1104%2C0811.1108%2C0811.0630%2C0811.2269%2C0811.2927%2C0811.3438%2C0811.4620%2C0811.4340%2C0811.0782%2C0811.2823%2C0811.1399%2C0811.3779%2C0811.0844%2C0811.1495%2C0811.0818%2C0811.2243%2C0811.0772%2C0811.2406%2C0811.0677%2C0811.1875%2C0811.4323%2C0811.2059%2C0811.1734%2C0811.4484%2C0811.2933%2C0811.3370%2C0811.2460%2C0811.2976%2C0811.1376%2C0811.3608%2C0811.1611%2C0811.1873%2C0811.4564%2C0811.3107%2C0811.2955%2C0811.4273%2C0811.1144%2C0811.4214%2C0811.4354%2C0811.1476%2C0811.2577%2C0811.2654&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Standard Model Higgs Searches at the LHC"}, "summary": "The study of the mechanism behind electroweak symmetry breaking is one of the\nmain goals of the Large Hadron Collider and of its general-purpose experiments,\nATLAS and CMS. This paper reviews some of the ongoing studies by these\ncollaborations and, when possible, highlights the differences between\nequivalent channels in both experiments.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0811.0788%2C0811.3979%2C0811.3575%2C0811.3377%2C0811.0358%2C0811.4638%2C0811.0330%2C0811.2142%2C0811.1138%2C0811.4576%2C0811.3560%2C0811.4449%2C0811.4763%2C0811.0331%2C0811.3354%2C0811.4505%2C0811.2350%2C0811.1469%2C0811.0815%2C0811.4504%2C0811.3266%2C0811.0865%2C0811.3570%2C0811.4567%2C0811.4331%2C0811.2531%2C0811.3763%2C0811.1945%2C0811.0609%2C0811.3368%2C0811.0950%2C0811.3147%2C0811.4040%2C0811.2809%2C0811.4318%2C0811.0370%2C0811.1946%2C0811.1421%2C0811.0356%2C0811.3449%2C0811.3729%2C0811.3036%2C0811.3778%2C0811.4622%2C0811.3287%2C0811.0849%2C0811.4488%2C0811.2110%2C0811.4721%2C0811.2762%2C0811.3948%2C0811.0563%2C0811.0690%2C0811.2477%2C0811.2165%2C0811.4651%2C0811.1907%2C0811.1406%2C0811.0271%2C0811.1104%2C0811.1108%2C0811.0630%2C0811.2269%2C0811.2927%2C0811.3438%2C0811.4620%2C0811.4340%2C0811.0782%2C0811.2823%2C0811.1399%2C0811.3779%2C0811.0844%2C0811.1495%2C0811.0818%2C0811.2243%2C0811.0772%2C0811.2406%2C0811.0677%2C0811.1875%2C0811.4323%2C0811.2059%2C0811.1734%2C0811.4484%2C0811.2933%2C0811.3370%2C0811.2460%2C0811.2976%2C0811.1376%2C0811.3608%2C0811.1611%2C0811.1873%2C0811.4564%2C0811.3107%2C0811.2955%2C0811.4273%2C0811.1144%2C0811.4214%2C0811.4354%2C0811.1476%2C0811.2577%2C0811.2654&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The study of the mechanism behind electroweak symmetry breaking is one of the\nmain goals of the Large Hadron Collider and of its general-purpose experiments,\nATLAS and CMS. This paper reviews some of the ongoing studies by these\ncollaborations and, when possible, highlights the differences between\nequivalent channels in both experiments."}, "authors": ["R. Goncalo"], "author_detail": {"name": "R. Goncalo"}, "author": "R. Goncalo", "arxiv_comment": "Parallel talk at ICHEP08, Philadelphia, USA, July 2008. 4 pages,\n  LaTeX, 8 eps figures", "links": [{"href": "http://arxiv.org/abs/0811.3778v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0811.3778v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "hep-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "hep-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0811.3778v1", "affiliation": "for the ATLAS and CMS Collaborations", "arxiv_url": "http://arxiv.org/abs/0811.3778v1", "journal_reference": null, "doi": null, "fulltext": "34th International Conference on High Energy Physics, Philadelphia, 2008\n\nStandard Model Higgs Searches at the LHC\nR. Gonçalo\nRoyal Holloway, University of London\n\nOn behalf of the ATLAS and CMS collaborations\n\narXiv:0811.3778v1 [hep-ph] 23 Nov 2008\n\nThe study of the mechanism behind electroweak symmetry breaking is one of the main goals of the Large Hadron\nCollider and of its general-purpose experiments, ATLAS and CMS. This paper reviews some of the ongoing studies by\nthese collaborations and, when possible, highlights the differences between equivalent channels in both experiments.\n\n1. Introduction\nThe Higgs mechanism [1] is central to the Standard Model of particle physics (SM). The existence of the Higgs\nfield maintains the theory weakly interacting up to high energy scales and prevents some processes from violating\nunitarity. In the process of spontaneous breaking of electroweak symmetry, the weak bosons W ± and Z 0 , as well\nas leptons and quarks, acquire mass through interactions with the Higgs field. In the SM, the simplest form of the\nHiggs mechanism is assumed, which predicts the existence of a single scalar particle, the Higgs boson and a single\nfree parameter, its mass (mH ). The discovery of this particle would provide experimental evidence for the Higgs\nmechanism. The discovery and study of the mechanism of electroweak symmetry breaking is one of the main goals\nof the ATLAS [2] and CMS [3] experiments, operating at the Large Hadron Collider (LHC). Many models of physics\nbeyond the SM predict a more complex Higgs sector, covered elsewhere [4].\nDirect searches for the Higgs boson produced in association with a Z 0 were performed in the Large Electron\nPositron collider (LEP). These resulted in the exclusion of the Higgs boson in the mass range up to 114.4 GeV at\n95% confidence level [5]. On the other hand, precision fits [6] of electroweak observables, including data from the LEP\nand Tevatron colliders, provide an indirect estimate of the Higgs boson mass, assuming the SM scenario. The latest\n2\nfit results give mH = 84+34\n−26 GeV/c , or the one-sided 95% confidence-level limit mH < 154 GeV. Including the LEP\ndirect search results, this limit increases to 185 GeV/c2 . Recent combined results from the Tevatron experiments\nhave, for the first time, excluded the hypothesis of a Higgs boson mass around 170 GeV [7] at 95% confidence level.\nAlthough the expected sensitivity of Tevatron experiments is not enough to make a 5σ discovery of the SM Higgs\nboson [8], it is enough to exclude it out up to mH ∼ 200 GeV/c2 at 95% confidence level, or to make a 3σ observation.\n\n2. Higgs boson searches in ATLAS and CMS\nThe Higgs boson production at the LHC is dominated by the gluon-gluon fusion process, described at leading order\nthrough a heavy-quark loop. The next-to-leading order cross section for this process is 37.6 pb, for mH = 120 GeV/c2 .\nThe Higgs boson can also be produced by Vector Boson Fusion (VBF) with a cross section of 4.25 pb, or by associated\nproduction with a W ± , a Z 0 , or a tt̄ quark pair, with 3.19 pb for the three processes and mH = 120 GeV/c2 (cross\nsections calculated at next-to-leading order using parton density function sets CTEQ6M and CTEQ6L1 [9]).\n2\nThe Higgs boson branching ratio is strongly dependent on its mass. At mH <\n∼ 135 GeV/c , the main decay mode\n+ −\nis to a bb̄ pair (BR = 81%), followed by the decay to a τ τ pair (BR ∼ 8%). For a small but important interval\nof mH , the Higgs boson decays to a pair of photons with a small branching ratio. At higher masses, the decay to a\npair of (possibly off-shell) W ± or Z 0 bosons becomes dominant.\nThe most abundant signal topologies, containing bb̄ pairs are unfortunately hard to separate from the large QCD\nbackground. The following gives a summary of the discovery channels being investigated at the LHC. In all cases,\nfull detector simulation was used, which included realistic descriptions of the material budget and detector geometry.\nThe trigger response was also realistically simulated, and systematic uncertainties were estimated. Next-to-leading\norder cross sections were used whenever available, and used to normalise simulated event samples.\n1\n\n\f34th International Conference on High Energy Physics, Philadelphia, 2008\n\nFigure 1: Left: ATLAS sensitivity in the H → 4l channel for 30 f b−1 [9] (background estimation systematic uncertainties\nare included); centre: four-lepton invariant mass distribution in the H → ZZ (∗) → 2e2μ channel in CMS [10]; right: CMS\nsensitivity in H → γγ channel for 30 f b−1 [10].\n\n2.1. Higgs boson decay to four leptons: H → ZZ (∗) → 4l (4e, 4μ or 2e2μ)\nThis channel provides excellent sensitivity for a wide range of mH above 130 GeV/c2 , except for the interval between\n2mW and 2mZ , where the Higgs boson branching ratio is dominated by H → W + W − . The main background is\npp → ZZ (∗) → 4l± . Other backgrounds, such as Zbb̄, ZW , tt̄, and Z + X are effectively suppressed by the analysis\nevent selection. Both CMS and ATLAS rely on selecting events which contain pairs of electrons or muons with\nopposite charge. At least one Z 0 is expected to be on mass shell, and the two-lepton invariant mass is used to\nreject fake and misidentified leptons. A clear four-lepton mass peak above a flat background is expected in this\nchannel (see figure 1, left), thus allowing a good background estimation from the peak sidebands. Two factors\nare especially significant for analyses of this channel: the lepton reconstruction efficiency and the invariant-mass\nresolution. Both experiments show similar experimental sensitivities in this channel, with the total signal significance\nfor each experiment expected to be in excess of 10 for an integrated luminosity of 30 f b−1 (see figure 1, centre).\n\n2.2. Higgs boson decay to two photons: H → γγ\nIn spite of the low Higgs boson branching ratio to two photons (around 0.2% for mH = 120 GeV/c2 ), this channel\nshows very good sensitivity in a range of mH between the LEP limit and mH ∼ 140 GeV/c2 . The main irreducible\nbackground is the direct γγ production. Signal appears as a sharp peak over a smoothly falling di-photon invariant\nmass distribution. Reducible instrumental backgrounds such as γ + jet and multijet production, where one or more\nparticles are misidentified as photons, are important due to the large QCD cross sections. Both experiments need to\ntake photon conversions into account, since ∼ 60% of Higgs events contain at least one converted photon.\nBoth collaborations classify the selected events into several categories, according to the event kinematics or topology. In this way, the event selection can be optimized, in order to maximize the background discrimination without\ndegrading the efficiency for selecting signal events. In ATLAS, a significance of about 3.5σ is expected for 10 f b−1 ,\nassuming mH = 120 GeV/c2 . With an optimized analysis employing a neural network, CMS expects up to 10σ after\ncollecting 30 f b−1 and a 5σ after accumulating 8 f b−1 (see figure 1, right). Analyses are also being developed to\ntarget the associated production channels ZH, W H and tt̄H.\n\n2.3. Higgs boson decay to a tau pair: H → τ + τ −\nThis channel currently provides one of the best sensitivities at low mH . Analyses rely on the topology of VBF\nevents to provide additional rejection against SM backgrounds. In this process, the Higgs boson is radiated by W ±\nor Z 0 bosons exchanged between the interacting partons. Due to the lack of colour flow between the two interacting\npartons, the characteristic event topology consists of two relatively forward jets with a rapidity gap in between,\ncontaining little hadronic activity. Both ATLAS and CMS investigate this channel for all final states, in which at\n2\n\n\f34th International Conference on High Energy Physics, Philadelphia, 2008\n\nFigure 2: Left: τ + τ − invariant mass distribution in the H → τ + τ − channel in ATLAS with one τ decaying hadronically and\nmH = 120 GeV/c2 [9]; centre: expected sensitivity for the H → τ + τ − channel in ATLAS (systematic uncertainties due to the\nbackground estimation are included) [10]; right: transverse mass in the H → W + W − → lνlν in the CMS analysis [10].\n\nleast one tau decays to an electron or muon plus neutrinos. The final state where both taus decay hadronically\nwas also investigated by ATLAS and proved to be feasible, but there is as yet no detailed sensitivity estimates. The\ndominant background in all cases is Z + jets with the Z boson decaying to τ + τ − . Both collaborations have developed\ndata-driven methods to estimate these backgrounds. Other backgrounds are W + N jets, tt̄, and di-jet events.\nThe τ + τ − invariant mass reconstruction requires an approximation, in which the τ ± is assumed to be collinear\nwith the visible lepton (in τ → e or τ → μ decays). The resulting Higgs mass resolution can be observed in figure 2\n(left). The expected sensitivity for this channel, currently reaches up to 5σ for 30 f b−1.\n\n2.4. Higgs boson decay to a W boson pair: H → W + W − → lνlν (l = e± or μ± )\nThe Higgs boson decay to a W + W − pair provides the most sensitive search channel in the mass range 2mW <\nmH < 2mZ , where this decay mode has a branching ratio above 95%. Analyses have concentrated on final states\ncontaining electrons or muons from the W ± decay. Contrary to the remaining channels, though, the presence of high\ntransverse momentum neutrinos makes it unfeasible to obtain a Higgs mass peak. The transverse mass [10] can still\nbe calculated and used in the event selection (see figure 2, right). Analyses in this channel then need to rely on a\nvery good knowledge of the background shape and normalisation.\nThe dominant backgrounds come from events containing a W-boson pair, most importantly W + W − and tt̄ production. The H → W + W − decay creates a correlation between the W spins in the Higgs reference frame which\ntranslates into an angular correlation between the leptons emitted in the W-bosons decay. This is exploited to\nsuppress the W + W − background. The tt̄ background can be effectively suppressed by a veto on central jets (jets\nwith a small pseudorapidity value). Separate analyses are performed for the cases where there are no high transverse\nmomentum jets present in the event and where there are two additional jets, directed at the gluon fusion and the\nVBF production modes, respectively. For a Higgs boson mass close 160 GeV/c2 a sensitivity in excess of 10σ is\nexpected for each experiment for 30 f b−1 of integrated luminosity. Additional channels being explored are the VBF\nH → W + W − → lν + 2jets and the associated production channels W ± H and tt̄H.\n\n3. Summary and Outlook\nThe expected sensitivity of ATLAS and CMS to a SM Higgs boson was evaluated by both collaborations. Analyses\nin both experiments show similar sensitivity in most channels. The sensitivity for SM Higgs discovery in the various\nchannels is illustrated by figure 3 for the CMS case. An integrated luminosity of less than 10 f b−1 should be enough to\nmake a 5σ discovery in the mass range above the LEP limit. Preliminary ATLAS studies indicate that an integrated\n3\n\n\f34th International Conference on High Energy Physics, Philadelphia, 2008\n\nFigure 3: SM Higgs discovery potential for CMS assuming an integrated luminosty of 30 f b−1 (left) and integrated luminosity\nneeded for a 5σ Higgs discovery, versus Higgs boson mass [10]).\n2\n<\nluminosity of 2 f b−1 would be enough to exclude the Higgs boson in the range 121GeV/c2 <\n∼ mH ∼ 460GeV/c at\n95% confidence level. Other analyses, not described here, may contribute to further enhancements of the sensitivity.\n\nAcknowledgments\nThe author would like to express his thanks to ATLAS and CMS colleagues. Special thanks to Chiara Mariotti,\nYves Sirois, Louis Fayard, Aleandro Nisati, Ketevi Assamagan, Eilam Gross, and Glen Cowan, and to many other\ncolleagues who have kindly contributed with work and material for this paper.\n\nReferences\n[1] P.W. Higgs, Phys.Lett., 12 132 (1964); P.W. Higgs, Phys.Rev.Lett., 13 508 (1964); P.W. Higgs, Phys.Rev., 145\n1156 (1966); F.Englert and R.Brout, Phys.Rev.Lett. 13 321 (1964); G.S.Guralnik, C.R.Hagen and T.W.B.Kibble,\nPhys.Rev.Lett. 13 585 (1964).\n[2] The ATLAS Collaboration, G. Aad et al., The ATLAS Experiment at the CERN Large Hadron Collider, JINST\n(2008) 3 S08003; M. Bosman, ATLAS Detector Status and Physics Startup Plans, these proceedings.\n[3] The CMS Collaboration, G.L.Bayatian et al., CMS Technical Design Report, vol.I - Detector Performance &\nSoftware, CERN/LHCC 2006-001, February 2006; The CMS Collaboration, S. Chatrchyan et al., The CMS\nexperiment at the CERN LHC, JINST (2008) 3 S08004.\n[4] S.Lowette, Beyond the Standard Model Higgs at LHC, these proceedings.\n[5] The LEP Higgs Working Group, Search for the Standard Model Higgs Boson at LEP, Phys.Lett. B565 61 (2003);\nCERN-EP/2003-11.\n[6] P. Renton, \"Standard Model Electroweak fits\", these proceedings; The LEP Electroweak Working Group website\nhttp://lepewwg.web.cern.ch/LEPEWWG/.\n[7] M. Herndon, \"Searches for the Higgs Boson\", these proceedings.\n[8] S.Söldner-Rembold, Standard Model Higgs Searches, [arXiv:hep-ex/0803.1451v2].\n[9] ATLAS Collaboration, Expected Performance of the ATLAS Experiment, Detector, Trigger and Physics, CERNOPEN-2008-020, Geneva, 2008, to appear.\n[10] The CMS Collaboration, G.L.Bayatian et al., CMS Technical Design Report, vol.II - Physics Performance,\nJ.Phys. G (2007) 995, CERN/LHCC 2006-021, June 2006.\n4\n\n\f"}