{"id": "http://arxiv.org/abs/0709.0861v2", "guidislink": true, "updated": "2007-09-07T09:11:10Z", "updated_parsed": [2007, 9, 7, 9, 11, 10, 4, 250, 0], "published": "2007-09-06T16:41:41Z", "published_parsed": [2007, 9, 6, 16, 41, 41, 3, 249, 0], "title": "The population of GRB hosts", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0709.1234%2C0709.2360%2C0709.0333%2C0709.0501%2C0709.0791%2C0709.2740%2C0709.1282%2C0709.3613%2C0709.3248%2C0709.2744%2C0709.1109%2C0709.2093%2C0709.1170%2C0709.2475%2C0709.3783%2C0709.4646%2C0709.3988%2C0709.3152%2C0709.0009%2C0709.4308%2C0709.3787%2C0709.4041%2C0709.3919%2C0709.4018%2C0709.0767%2C0709.0422%2C0709.2242%2C0709.0811%2C0709.2410%2C0709.1789%2C0709.4019%2C0709.1944%2C0709.3696%2C0709.4127%2C0709.1750%2C0709.3345%2C0709.2669%2C0709.4375%2C0709.1004%2C0709.1256%2C0709.4660%2C0709.2050%2C0709.0861%2C0709.3192%2C0709.3144%2C0709.2805%2C0709.4572%2C0709.4672%2C0709.2646%2C0709.2500%2C0709.0083%2C0709.0349%2C0709.4023%2C0709.3141%2C0709.1915%2C0709.1613%2C0709.0258%2C0709.1295%2C0709.2876%2C0709.4135%2C0709.0145%2C0709.3683%2C0709.0363%2C0709.4643%2C0709.2286%2C0709.2234%2C0709.0139%2C0709.0609%2C0709.3899%2C0709.1897%2C0709.1123%2C0709.4176%2C0709.4086%2C0709.1776%2C0709.3875%2C0709.3870%2C0709.0054%2C0709.4343%2C0709.0541%2C0709.4653%2C0709.2543%2C0709.1527%2C0709.1847%2C0709.2569%2C0709.0764%2C0709.0854%2C0709.4210%2C0709.2136%2C0709.0626%2C0709.4279%2C0709.3559%2C0709.2957%2C0709.3136%2C0709.0296%2C0709.0656%2C0709.0364%2C0709.3751%2C0709.3122%2C0709.2812%2C0709.1252%2C0709.1093&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The population of GRB hosts"}, "summary": "The properties of their hosts provide important clues to the progenitors of\ndifferent classes of gamma-ray bursts (GRBs). The hosts themselves also\nconstitute a sample of high-redshift star-forming galaxies which, unlike most\nother methods, is not selected on the luminosities of the galaxies themselves.\nWe discuss what we have learnt from and about GRB host galaxies to date.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0709.1234%2C0709.2360%2C0709.0333%2C0709.0501%2C0709.0791%2C0709.2740%2C0709.1282%2C0709.3613%2C0709.3248%2C0709.2744%2C0709.1109%2C0709.2093%2C0709.1170%2C0709.2475%2C0709.3783%2C0709.4646%2C0709.3988%2C0709.3152%2C0709.0009%2C0709.4308%2C0709.3787%2C0709.4041%2C0709.3919%2C0709.4018%2C0709.0767%2C0709.0422%2C0709.2242%2C0709.0811%2C0709.2410%2C0709.1789%2C0709.4019%2C0709.1944%2C0709.3696%2C0709.4127%2C0709.1750%2C0709.3345%2C0709.2669%2C0709.4375%2C0709.1004%2C0709.1256%2C0709.4660%2C0709.2050%2C0709.0861%2C0709.3192%2C0709.3144%2C0709.2805%2C0709.4572%2C0709.4672%2C0709.2646%2C0709.2500%2C0709.0083%2C0709.0349%2C0709.4023%2C0709.3141%2C0709.1915%2C0709.1613%2C0709.0258%2C0709.1295%2C0709.2876%2C0709.4135%2C0709.0145%2C0709.3683%2C0709.0363%2C0709.4643%2C0709.2286%2C0709.2234%2C0709.0139%2C0709.0609%2C0709.3899%2C0709.1897%2C0709.1123%2C0709.4176%2C0709.4086%2C0709.1776%2C0709.3875%2C0709.3870%2C0709.0054%2C0709.4343%2C0709.0541%2C0709.4653%2C0709.2543%2C0709.1527%2C0709.1847%2C0709.2569%2C0709.0764%2C0709.0854%2C0709.4210%2C0709.2136%2C0709.0626%2C0709.4279%2C0709.3559%2C0709.2957%2C0709.3136%2C0709.0296%2C0709.0656%2C0709.0364%2C0709.3751%2C0709.3122%2C0709.2812%2C0709.1252%2C0709.1093&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The properties of their hosts provide important clues to the progenitors of\ndifferent classes of gamma-ray bursts (GRBs). The hosts themselves also\nconstitute a sample of high-redshift star-forming galaxies which, unlike most\nother methods, is not selected on the luminosities of the galaxies themselves.\nWe discuss what we have learnt from and about GRB host galaxies to date."}, "authors": ["N. R. Tanvir", "A. J. Levan"], "author_detail": {"name": "A. J. Levan"}, "author": "A. J. Levan", "arxiv_comment": "10 pages, 4 figures, to appear in proceedings of 070228: The next\n  decade of GRB afterglows, Amsterdam March 2007", "links": [{"href": "http://arxiv.org/abs/0709.0861v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0709.0861v2", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0709.0861v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0709.0861v2", "journal_reference": null, "doi": null, "fulltext": "The population of GRB hosts\nN. R. Tanvir a\n\narXiv:0709.0861v2 [astro-ph] 7 Sep 2007\n\na Department\n\nof Physics and Astronomy, University of Leicester, Leicester, LE1\n7RH. United Kingdom\n\nA. J. Levan b\nb Department\n\nof Physics, University of Warwick, Coventry, CV4 7AL. United\nKingdom\n\nAbstract\nThe properties of their hosts provide important clues to the progenitors of different\nclasses of gamma-ray bursts (GRBs). The hosts themselves also constitute a sample of high-redshift star-forming galaxies which, unlike most other methods, is not\nselected on the luminosities of the galaxies themselves. We discuss what we have\nlearnt from and about GRB host galaxies to date.\nKey words:\n\n1\n\nIntroduction\n\nPinpointing the first long-duration GRB afterglows quickly resolved the debate\nover their distance scale (van Paradijs et al., 1997; Metzger et al., 1997), and\nthe realisation that their hosts were high-redshift star-forming galaxies was\none of the first pieces of evidence suggesting their progenitors were massive\nstars (Paczynski, 1998).\nSubsequently, the characteristics of their (likely) host galaxies have formed an\nequally important line of argument regarding the nature of the short-duration\nbursts (Gehrels et al., 2005; Hjorth et al., 2005; Bloom et al., 2006).\nIn addition to helping understand GRBs themselves, hosts are becoming increasingly important as a high-redshift population selected only by its star\nforming properties, and not dependent on the luminosity of individual galaxies, which is the case for most other samples.\nPreprint submitted to Elsevier\n\n5 November 2018\n\n\fIn this contribution we discuss the latest developments in our understanding\nof the population of GRB hosts, and consider likely future directions.\n\n2\n\nLong-duration bursts\n\nAs mentioned above, the fact that no long-duration bursts (LGRBs) have\nbeen found in early-type galaxies was a strong argument in favour of their\nassociation with massive star death. The question naturally arises exactly\nwhat properties a star must have in order to produce a GRB at the end of\nits life. This is related to the important question of whether the properties,\nrate and/or luminosity, of GRBs depends on the characteristics of the stellar\npopulations which produce them. In particular, if GRB properties depend on\nthe chemical makeup of their progenitor stars, or other aspects of its galactic\nenvironment, that will influence the statistical properties of the sample of host\ngalaxies they select.\n\n2.1 GRBs and metallicity\nIn the popular \"collapsar\" model for the production of GRBs, it has been\nargued that high (around solar and above) metallicity single Wolf-Rayet stars\nwill lose too much mass and angular momentum to produce the rapidly rotating massive cores that ultimately collapse to produce GRBs (Heger et al.,\n2003).\nA number of observational studies are consistent with the idea that GRBs\nare preferentially produced by stellar populations that are at least moderately poor (sub-solar) in heavy metals. Fynbo et al. (2003) first noted that\nthe high proportion of GRB host galaxies above redshift z ≈ 2 that show\nLyman-α in emission suggests they are low dust, low metal systems. Subsequently, studies of samples of GRB host galaxies in the mid- and far-IR\nand submm (Berger et al., 2003; Tanvir et al., 2004; Le Floc'h et al., 2006;\nCastro Cerón et al., 2006) have found fewer hosts are bright in these bands\nthan expected, given the large amount of obscured star formation expected\nto be taking place in such galaxies. Again, a preference for lower metallicities\nwould help explain this finding if the very high star-formation rate galaxies\ncorrespond to higher metallicity systems as is thought. Note there is potentially a selection effect here, since some GRB hosts will not be identified in\nthe first place if the optical light of the GRB is extincted by dust. However,\nseveral such \"dark bursts\" have sufficiently good positions to identify their\nhosts, and were included in the samples studied (eg. Barnard et al., 2003). A\nsimilar argument has been made for the five lowest redshift GRBs, which are\n2\n\n\fall in rather small, metal-poor galaxies when compared to the population of\nlow-z star-forming galaxies (Stanek et al., 2006).\nMost recently, Fruchter et al. (2006) compared the host galaxies of GRBs and\ncore-collapse supernovae in a similar redshift range, roughly z = 0.5–1 (the\naverage and spread of redshift was also similar between the two). The characteristics of the galaxies and also the positions of the exploding stars, differed\nsignificantly between the samples. In figures 1 and 2 we show somewhat updated mosaics of the GRB and SNe hosts respectively. The supernova hosts\nare clearly more likely to be brighter, frequently grand-design spirals, while\nthe GRB hosts are typically smaller and have irregular/merger morphologies (see also Conselice et al., 2005; Wainwright, Berger, & Penprase, 2007).\nThis could also be explained if the GRBs are preferentially formed from\nlower-metallicity core-collapse supernovae. A bias against finding GRBs enshrouded in dusty systems should be more than matched by the same bias\nagainst finding supernovae hidden by dust (recalling that GRBs can burn\nthrough significant columns of intervening dust and so may sometimes be\nfound optically even when enshrouded (eg. Waxman & Draine, 2000)). However, Wolf & Podsiadlowski (2007) argue that the same data, whilst compatible with a mild metallicity dependence of GRB rate/luminosity, would not be\nconsistent with a strong effect.\nThe chemical abundances of gas in the hosts of GRBs can also be estimated\ndirectly via absorption line spectroscopy of the GRB afterglow itself. Again,\nthere could be a bias against higher metallicity, dusty galaxies, since the afterglow must be optically bright to perform this analysis. However, when such\nabundances have been determined they show a wide range from about 1%\nsolar to nearly solar (eg. Vreeswijk et al., 2004; Prochaska et al., 2007).\n\n2.2 GRB host samples\n\nThe immense luminosity of GRBs means that they can be detected in principle\nto very high redshifts. Thus they can be used to select and characterise galaxies\nfrom very early times up to the present.\nIf the rate of GRB production were the same for all young stellar populations, then GRB host samples should allow us to discriminate the proportions of global star formation arising in different galaxy types, and more generally map the history of star formation in the universe (eg. Wijers et al.,\n1998; Trentham, Ramirez-Ruiz, & Blain, 2002). As we have discussed above,\nit seems unlikely that GRBs do trace star formation in a completely unbiased\nway. However, GRB selection will favour hosts with high star formation rates\n(and probably, lower metallicities), but otherwise is not biased against small\n3\n\n\f970228\n\n970508\n\n970828\n\n980613\n\n980703\n\n990705\n\n990712\n\n991208\n\n991216\n\n010921\n\n011121\n\n020405\n\n020903\n\n021211\n\n040924\n\n041006\n\nFig. 1. A mosaic of HST images, each 7.5 arcsec on a side, of the host galaxies of\nlong-duration GRBs with 0.3 < z < 1.0. Circles are 3σ positional uncertainties on\nthe GRB positions. Where the positions are very well determined (3σ error less than\n0.05 arcsec) the position is shown by a diamond.\n\nfaint galaxies, which are typically missed in other flux-limited catalogues. Redshifts, metallicities and gas dynamics can be determined in many cases from\nthe afterglow spectroscopy. A good example of this power was GRB 020124,\nwhose host was undetected to R ∼ 29.5 in HST imaging (Berger et al., 2002),\nbut was found to be a high column density DLA at z = 3.2 from the afterglow\n(Hjorth et al., 2003).\nA number of attempts have been made to compare GRB hosts as a whole to\nother high redshift populations. For example, Jakobsson et al. (2005) demonstrated that around z ∼ 3 the bright end of the host luminosity function is\nconsistent with that expected by weighting by star formation the Lyman-break\ngalaxy luminosity function.\n4\n\n\f2002fz\n\n2002hq\n\n2002hs\n\n2002kb\n\n2002ke\n\n2002kl\n\n2003ba\n\n2003bb\n\n2003bc\n\n2003dx\n\n2003dz\n\n2003ea\n\n2003er\n\n2003et\n\n2003ew\n\n2003N\n\nFig. 2. As with figure 1, but for the hosts of core-collapse supernovae found in the\nGOODS survey in the same redshift range as the GRBs. The difference between\nthe GRB and SN samples is clear to the eye, with large and grand-design galaxies\nbeing more less common amongst the GRB hosts (see Fruchter et al., 2006).\n\nMany authors have noted that whilst occasional bursts have been found in very\nred (ERO) star-forming galaxies (eg. Levan et al., 2006a; Berger et al., 2007a),\nthe bulk of GRB hosts are sub-L*, blue, low-dust, apparently young galaxies\nwith relatively strong line-emission and a high specific rate of star formation\n(eg. Fruchter et al., 1999; Le Floc'h et al., 2003; Christensen, Hjorth, & Gorosabel,\n2004). Qualitatively these are similar characteristics to the population of\ngalaxies found in emission-line surveys for Lyman-α. An interesting comparison is with the wide area survey of Gawiser et al. (2006), for Ly-α emitters\naround z ≈ 3.1. In broad terms this population is very like the GRB host\nsample in the same redshift range, albeit that the Ly-α equivalent width is,\nunsurprisingly, somewhat higher on the average. Figure 3 shows the cumulative\nhistograms of R-band continuum luminosity (rest frame UV) for this sample\ntogether with the published GRB hosts with 2.6 < z < 3.6, illustrating their\n5\n\n\fFig. 3. Cumulative luminosity histograms of broad band R magnitudes for GRB\nhosts and Lyman-α selected galaxies around z ∼ 3.\n\nsimilarity.\n\n3\n\nShort-duration bursts\n\nThe first few short-duration GRB afterglows seemed to paint a picture of being\nin galaxies at redshifts of a few tenths and some of which contained little or no\nyoung stellar population. This was widely interpretted as being consistent with\nthe neutron-star neutron-star (or neutron-star black-hole) binary coalescence\nmodel for GRB production.\nSince then the picture has become murkier. Several apparently short-duration\nGRBs have been found where the host is hard to identify, and most likely is\nat much higher redshift z > 1. In particular, GRB 060121 had a red afterglow\nand host galaxy indicating a likely redshift z > 4 and almost certainly z > 1.5\n(Levan et al., 2006b; de Ugarte Postigo et al., 2006). The host and energetics\nof this burst are much more typical of LGRBs, and the possibility remains\nthat it was actually a member of that class, despite the short duration.\nAlthough in many individual cases there can be ambiguity over whether a\ngiven burst should be in the short or long class (Levan et al., 2007b; Bloom et al.,\n2007), the weight of several likely high-z short bursts has led to speculation\nthat they form a separate sub-class (Berger et al., 2007b). It is worth commenting, though, that so-far all redshifts for short bursts have come from their\n6\n\n\fputative host rather than the afterglow, and one consequence of a NS-NS progenitor would be the possibility that the burst occurs well beyond the optical\nextent of it's host, making definite association unclear in some cases.\n\n3.1 Short-duration bursts from nearby galaxies\n\nIn a parallel development Tanvir et al. (2005) have shown that there is a weak\ncross-correlation signal between the distribution of BATSE short-duration\nbursts and galaxies in the nearby universe. In particular, they used the PSCz\ngalaxy redshift survey, which provides uniform selection over 85% of the sky,\nand found a positive signal with the sample cut at various recession velocities out to 8000 km s−1 (approximately 110 Mpc). Simulations suggested that\nthis level of signal could be produced if between 10 and 25% of BATSE short\nbursts were coming from nearby galaxies.\nThese on average must be considerably weaker bursts than those found at\ncosmological distances. The most likely progenitors are giant flares from soft\ngamma-ray repeaters. At least one such flare from an SGR in the Milky Way\n(SGR 1806-20) was bright enough that it could have been detected by BATSE\nto several tens of Mpc (Palmer et al., 2005; Hurley et al., 2005). In fact, only\na very low rate of roughly one per millenium per Milky-Way sized galaxy\nis sufficient to explain the BATSE observed rate (Levan et al., 2007a; Ofek,\n2007).\nIf of order 10% of BATSE bursts were really from low redshift galaxies it\nremains surprising that amongst those well-localised by Swift and HETE-II\nthere aren't any clear-cut examples. The best candidate is the weak burst GRB\n050906 whose BAT error circle contained the outer parts of an actively starforming galaxy IC328 at a distance of about 130 Mpc (Levan et al., 2007a),\nalthough the spectrum of the burst was significantly softer than previous giant\nflares. Possibly the softer sensitivity of Swift/BAT and HETE-II compared to\nBATSE makes it less likely that they will detect SGR giant flares, which, on\nthe basis of only three events, seem to be typically hard (and thermal).\nInterestingly, though, there are two candidates for low-redshift short-duration\nbursts localised by the Inter-Planetary Network (IPN). Specifically, GRB\n051103 was determined to have occurred in a thin error region which lay\nclose to the outskirts of the galaxy M81 and at that distance the burst would\nhave been quite consistent energetically with being an SGR giant flare comparable to that from SGR 1806-20 (Ofek et al., 2006; Frederiks et al., 2007). An\neven more compelling case may be GRB 070201, which was found to overlap\nthe outer part of the disk of M31 (Perley & Bloom, 2007; Hurley et al., 2007).\nThis was an extremely bright burst, and in that regard, again, quite consistent\n7\n\n\fwith a very energetic SGR flare at the distance of M31. The only concern we\nmight have is that two such rare events should occur in neighbouring large\nspiral galaxies (M31 and the Milky Way) within only two years of each other!\n\n4\n\nConclusions\n\nThe characteristics of their hosts has provided important clues to the nature\nof GRB progenitors. Several lines of evidence suggest that LGRBs show some\npreference for lower-metallicity hosts. Particularly at high redshifts GRBs may\nbe the root to identifying and studying low-metallicity star formation, and\nespecially the faint end of the galaxy luminosity function that is generally\nmissed in other surveys. To fully realise the power of GRBs to select high-z\npopulations, it is important that statistical samples of bursts and hosts with\nredshifts be as complete as possible. As it is, optical/nIR afterglows have been\nfound for nearly 80% of well-positioned Swift LGRBs, but redshifts for only\nabout 50% (Tanvir & Jakobsson, 2007).\nOur understanding of the class of short-duration bursts is at an earlier stage,\nbut has seen huge progress in the past two years. Hosts have proved crucial to\nthese breakthroughs, not least because redshifts have yet to be found directly\nfor any short-burst afterglow. By way of illustration of the current, rather\nconfusing, state of affairs, we show in figure 4 a panel of hosts (or candidate\nhosts) of various short duration GRBs, which range from the very nearby\ncandidates for SGR giant flare bursts, via the intermediate redshift likely NSNS progenitors, to the new \"population\" of apparently high redshift short\nbursts whose nature remains controversial.\n\nReferences\nBarnard V. E. et al., 2003, MNRAS, 338, 1\nBerger E. et al., 2002, ApJ, 581, 981\nBerger E. et al., 2003, ApJ, 588, 99\nBerger E., Fox D. B., Kulkarni S. R., Frail D. A., Djorgovski S. G., 2007, ApJ,\n660, 504\nBerger E. et al., 2007, ApJ, 664, 1000\nBloom J. S. et al., 2006, ApJ, 638, 354\nBloom J. S. et al., 2007, ApJ, 654, 878\nCastro Cerón J. M., Michalowski M. J., Hjorth J., Watson D., Fynbo J. P. U.,\nGorosabel J., 2006, ApJ, 653, L85\nChristensen L., Hjorth J., Gorosabel J., 2004, A&A, 425, 913\nConselice C. J. et al., 2005, ApJ, 633, 29\n8\n\n\fFig. 4. Panel showing various (candidate) host galaxies of short-duration bursts.\nThis illustrates the surprising diversity seen to-date, from the moderate-redshift,\nhigh stellar mass galaxies expected to dominate for NS-NS progenitors, exemplified\nby GRB 050509B, to possible low-redshift SGR giant flare events (GRB 050906 and\nGRB 051103), and the apparently very high redshift cases such as GRB 050813,\nGRB 060121 and GRB 060313. Note, the size of the images on the sky varies\nconsiderably in this panel.\n\nde Ugarte Postigo A. et al., 2006, ApJ, 648, L83\nFrederiks D. D., Palshin V. D., Aptekar R. L., Golenetskii S. V., Cline T. L.,\nMazets E. P., 2007, AstL, 33, 19\nFruchter A. S. et al., 1999, ApJ, 519, L13\nFruchter A. S. et al., 2006 Nature 441, 463\nFynbo J. P. U. et al., 2003, A&A, 406, L63\nGalama T. J. et al., 1998 Nature 395, 670\nGawiser E. et al., 2006, ApJ, 642, L13\nGehrels N. et al., 2005 Nature 437, 851\nHeger A., Fryer C. L., Woosley S. E., Langer N., Hartmann D. H., 2003, ApJ,\n591, 288\nHjorth J. et al., 2003, ApJ, 597, 699\nHjorth J. et al., 2005, ApJ, 630, L117\nHurley K. et al., 2005, Nature, 434, 1098\nHurley K. et al., 2007, GCN, 6103, 1\nJakobsson P., et al., 2005, MNRAS, 362, 245\nLe Floc'h E. et al., 2003, A&A, 400, 499\nLe Floc'h E., Charmandaris V., Forrest W. J., Mirabel I. F., Armus L., Devost\nD., 2006, ApJ, 642, 636\nLevan A. J. et al., 2006a, ApJ, 647, 471\n9\n\n\fLevan, A. J. et al., 2006b, ApJ, 648, L9\nLevan A. J. et al., 2007a, MNRAS in press, arXiv:0705.1705\nLevan A. J. et al., 2007b, MNRAS, 378, 1439\nMetzger M. R. et al., Nature 387, 878\nOfek E. O., et al., 2006, ApJ, 652, 507\nOfek E. O., 2007, ApJ, 659, 339\nPaczynski, B., 1998, ApJ, 494, L45\nPalmer D. M. et al., 2005, Nature, 434, 1107\nPerley D. A., Bloom J. S., 2007, GCN, 6091, 1\nProchaska J. X., Chen H.-W., Dessauges-Zavadsky M., Bloom J. S., 2007,\nApJ, 666, 267\nStanek K. Z. et al., 2006, AcA, 56, 333\nTanvir N. R. et al., 2004, MNRAS, 352, 1073\nTanvir N. R., Chapman R., Levan A. J., Priddey R. S., 2005, Nature, 438, 991\nTanvir N. R., Jakobsson P., 2007, Phil. Trans of the Royal Society A, 365,\n1377, arXiv:astro-ph/0701777\nTrentham N., Ramirez-Ruiz E., Blain A. W., 2002, MNRAS, 334, 983\nvan Paradijs J. V. et al., 1997, Nature, 386, 686\nVreeswijk P. M. et al., 2004, A&A, 419, 927\nWainwright C., Berger E., Penprase B. E., 2007, ApJ, 657, 367\nWaxman E., Draine B. T., 2000, ApJ, 537, 796\nWijers R. A. M. J., Bloom J. S., Bagla J. S., Natarajan P., 1998, MNRAS,\n294, L13\nWolf C., Podsiadlowski P., 2007, MNRAS, 375, 1049\n\n10\n\n\f"}