{"id": "http://arxiv.org/abs/1005.2342v1", "guidislink": true, "updated": "2010-05-13T15:14:08Z", "updated_parsed": [2010, 5, 13, 15, 14, 8, 3, 133, 0], "published": "2010-05-13T15:14:08Z", "published_parsed": [2010, 5, 13, 15, 14, 8, 3, 133, 0], "title": "On the Size of the Non-Thermal Component in the Radio Emission from Cyg\n  OB2 #5", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1005.5146%2C1005.4682%2C1005.0085%2C1005.5599%2C1005.2621%2C1005.2588%2C1005.4824%2C1005.2672%2C1005.3544%2C1005.3905%2C1005.2681%2C1005.5043%2C1005.3165%2C1005.4673%2C1005.4066%2C1005.0787%2C1005.1191%2C1005.3789%2C1005.0582%2C1005.0553%2C1005.1356%2C1005.3415%2C1005.1354%2C1005.3223%2C1005.1690%2C1005.4768%2C1005.0565%2C1005.3820%2C1005.0928%2C1005.4303%2C1005.3692%2C1005.5560%2C1005.4117%2C1005.3131%2C1005.1918%2C1005.2366%2C1005.1163%2C1005.0201%2C1005.2342%2C1005.5473%2C1005.5491%2C1005.4428%2C1005.2157%2C1005.0435%2C1005.0378%2C1005.3687%2C1005.0463%2C1005.1349%2C1005.2028%2C1005.0568%2C1005.1924%2C1005.1649%2C1005.0367%2C1005.2703%2C1005.4825%2C1005.2525%2C1005.4798%2C1005.0493%2C1005.2585%2C1005.3388%2C1005.4240%2C1005.3837%2C1005.0359%2C1005.2760%2C1005.0234%2C1005.4477%2C1005.5674%2C1005.1141%2C1005.4433%2C1005.0690%2C1005.2420%2C1005.4780%2C1005.1350%2C1005.0485%2C1005.4488%2C1005.0793%2C1005.3276%2C1005.3091%2C1005.4847%2C1005.4095%2C1005.0086%2C1005.0858%2C1005.1509%2C1005.0719%2C1005.5178%2C1005.1176%2C1005.4903%2C1005.3151%2C1005.5085%2C1005.4820%2C1005.5496%2C1005.4342%2C1005.5041%2C1005.2848%2C1005.1590%2C1005.2147%2C1005.3947%2C1005.2843%2C1005.2696%2C1005.1592%2C1005.3647&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "On the Size of the Non-Thermal Component in the Radio Emission from Cyg\n  OB2 #5"}, "summary": "Cyg OB2 #5 is a contact binary system with variable radio continuum emission.\nThis emission has a low-flux state where it is dominated by thermal emission\nfrom the ionized stellar wind and a high-flux state where an additional\nnon-thermal component appears. The variations are now known to have a period of\n6.7 +/- 0.2 yr. The non-thermal component has been attributed to different\nagents: an expanding envelope ejected periodically from the binary, emission\nfrom a wind-collision region, or a star with non-thermal emission in an\neccentric orbit around the binary. The determination of the angular size of the\nnon-thermal component is crucial to discriminate between these alternatives. We\npresent the analysis of VLA archive observations made at 8.46 GHz in 1994 (low\nstate) and 1996 (high state), that allow us to subtract the effect of the\npersistent thermal emission and to estimate an angular size of 0.02 arcseconds\nfor the non-thermal component. This compact size favors the explanation in\nterms of a star with non-thermal emission or of a wind-collision region.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1005.5146%2C1005.4682%2C1005.0085%2C1005.5599%2C1005.2621%2C1005.2588%2C1005.4824%2C1005.2672%2C1005.3544%2C1005.3905%2C1005.2681%2C1005.5043%2C1005.3165%2C1005.4673%2C1005.4066%2C1005.0787%2C1005.1191%2C1005.3789%2C1005.0582%2C1005.0553%2C1005.1356%2C1005.3415%2C1005.1354%2C1005.3223%2C1005.1690%2C1005.4768%2C1005.0565%2C1005.3820%2C1005.0928%2C1005.4303%2C1005.3692%2C1005.5560%2C1005.4117%2C1005.3131%2C1005.1918%2C1005.2366%2C1005.1163%2C1005.0201%2C1005.2342%2C1005.5473%2C1005.5491%2C1005.4428%2C1005.2157%2C1005.0435%2C1005.0378%2C1005.3687%2C1005.0463%2C1005.1349%2C1005.2028%2C1005.0568%2C1005.1924%2C1005.1649%2C1005.0367%2C1005.2703%2C1005.4825%2C1005.2525%2C1005.4798%2C1005.0493%2C1005.2585%2C1005.3388%2C1005.4240%2C1005.3837%2C1005.0359%2C1005.2760%2C1005.0234%2C1005.4477%2C1005.5674%2C1005.1141%2C1005.4433%2C1005.0690%2C1005.2420%2C1005.4780%2C1005.1350%2C1005.0485%2C1005.4488%2C1005.0793%2C1005.3276%2C1005.3091%2C1005.4847%2C1005.4095%2C1005.0086%2C1005.0858%2C1005.1509%2C1005.0719%2C1005.5178%2C1005.1176%2C1005.4903%2C1005.3151%2C1005.5085%2C1005.4820%2C1005.5496%2C1005.4342%2C1005.5041%2C1005.2848%2C1005.1590%2C1005.2147%2C1005.3947%2C1005.2843%2C1005.2696%2C1005.1592%2C1005.3647&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Cyg OB2 #5 is a contact binary system with variable radio continuum emission.\nThis emission has a low-flux state where it is dominated by thermal emission\nfrom the ionized stellar wind and a high-flux state where an additional\nnon-thermal component appears. The variations are now known to have a period of\n6.7 +/- 0.2 yr. The non-thermal component has been attributed to different\nagents: an expanding envelope ejected periodically from the binary, emission\nfrom a wind-collision region, or a star with non-thermal emission in an\neccentric orbit around the binary. The determination of the angular size of the\nnon-thermal component is crucial to discriminate between these alternatives. We\npresent the analysis of VLA archive observations made at 8.46 GHz in 1994 (low\nstate) and 1996 (high state), that allow us to subtract the effect of the\npersistent thermal emission and to estimate an angular size of 0.02 arcseconds\nfor the non-thermal component. This compact size favors the explanation in\nterms of a star with non-thermal emission or of a wind-collision region."}, "authors": ["Luis F. Rodriguez", "Yolanda Gomez", "Laurent Loinard", "Amy J. Mioduszewski"], "author_detail": {"name": "Amy J. Mioduszewski"}, "author": "Amy J. Mioduszewski", "arxiv_comment": "Accepted for publication in RevMexAA", "links": [{"href": "http://arxiv.org/abs/1005.2342v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1005.2342v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "astro-ph.GA", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph.GA", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1005.2342v1", "affiliation": "NRAO", "arxiv_url": "http://arxiv.org/abs/1005.2342v1", "journal_reference": null, "doi": null, "fulltext": "To appear in Revista Mexicana de Astronomı́a y Astrofı́sica\n\nON THE SIZE OF THE NON-THERMAL COMPONENT IN THE RADIO\nEMISSION FROM CYG OB2 #5\n\narXiv:1005.2342v1 [astro-ph.GA] 13 May 2010\n\nLuis F. Rodrı́guez,1 Yolanda Gómez,1 Laurent Loinard,1 and Amy J. Mioduszewski2\nRESUMEN\nCyg OB2 #5 es un sistema binario de contacto con emisión variable de radio.\nEsta emisión tiene un estado bajo de flujo dominado por el viento estelar ionizado y\nun estado alto de flujo, donde una componente no-térmica adicional aparece. Ahora\nse sabe que las variaciones tienen un periodo de 6.7±0.2 años. La componente notérmica ha sido atribuida a varios agentes: una envolvente en expansión eyectada\nperiodicamente por la binaria, emisión de una región de choque de vientos, o una\nestrella con emisión no-térmica en órbita excéntrica alrededor de la binaria. La\ndeterminación del tamaño angular de la componente no-térmica es crucial para\ndiscriminar entre estas posibilidades. Presentamos un análisis de datos de archivo\ndel VLA hechos a 8.46 GHz en 1994 (en estado bajo) y 1996 (en estado alto), que\nnos permiten sustraer el efecto de la componente térmica persistente y estimar un\ntamaño angular ≤ 0.′′ 02 para la componente no-térmica. Este tamaño compacto\nfavorece la explicación en términos de una estrella con emisión no-térmica o de una\nregión de choque de vientos.\nABSTRACT\nCyg OB2 #5 is a contact binary system with variable radio continuum emission. This emission has a low-flux state where it is dominated by thermal emission\nfrom the ionized stellar wind and a high-flux state where an additional non-thermal\ncomponent appears. The variations are now known to have a period of 6.7±0.2 yr.\nThe non-thermal component has been attributed to different agents: an expanding envelope ejected periodically from the binary, emission from a wind-collision\nregion, or a star with non-thermal emission in an eccentric orbit around the binary.\nThe determination of the angular size of the non-thermal component is crucial to\ndiscriminate between these alternatives. We present the analysis of VLA archive\nobservations made at 8.46 GHz in 1994 (low state) and 1996 (high state), that allow us to subtract the effect of the persistent thermal emission and to estimate an\nangular size of ≤ 0.′′ 02 for the non-thermal component. This compact size favors\nthe explanation in terms of a star with non-thermal emission or of a wind-collision\nregion.\nKey Words: STARS: INDIVIDUAL (CYG OB2 #5) - RADIO CONTINUUM:\nSTARS\n1. INTRODUCTION\nCyg OB2 #5 (V729 Cyg, BD +40 4220) is an eclipsing, contact binary system consisting of two O-type\nsupergiants with a 6.6-day period (Hall 1974; Leung & Schneider 1978; Rauw et al. 1999; Linder et al. 2009).\nAs several other luminous O-star systems in the Cyg OB2 association, this source was found to show evidence\nof variable radio emission (Persi et al. 1985, 1990; Bieging et al. 1989). The radio emission appears to have\ntwo states: a low-flux state of ∼2 mJy at 4.8 GHz where the spectral index is consistent with thermal emission\nfrom an ionized stellar wind, and a high-flux state of ∼8 mJy at 4.8 GHz where the spectral index is flatter\n1 Centro\n\nde Radioastronomı́a y Astrofı́sica, Universidad Nacional Autónoma de México, Campus Morelia\nRadio Astronomy Observatory\n\n2 National\n\n1\n\n\f2\n\nRODRı́GUEZ ET AL.\n\nthan in the low state. The variations were proposed to have a 7-year period (Miralles et al. 1994) and have\nbeen attributed to variable non-thermal emission from an expanding envelope arising periodically in the binary\n(Persi et al. 1990; Bieging et al. 1989; Miralles et al. 1994).\nIn addition, Abbott et al. (1981) and Miralles et al. (1994) reported on the existence of a radio \"companion\"\n0.8 arcsec to the NE of the main radio source (which is associated with the eclipsing binary). Observations by\nContreras et al. (1997) revealed that this radio source has an elongated shape and lies in-between the shortperiod binary and a third star, which was first reported by Herbig (1967). Contreras et al. (1997) suggested\nthat the proposed NE radio companion actually corresponds to the wind interaction zone between the binary\nsystem and the tertiary component. Recently, Kennedy et al. (2010) reanalysed all VLA observations of Cyg\nOB2 #5 and showed that the primary radio source, associated with the eclipsing binary, varies with a period of\n6.7±0.2 yr while the flux from the secondary NE source remains constant in time. These authors proposed that\nthe variations in the main radio component can be represented by a simple model in which a fourth star (with\nconstant non-thermal emission) moves around the eclipsing binary in an eccentric orbit and the varying radio\nemission results from the variable free-free opacity of the wind between the star and the observer (Kennedy\net al. 2010). These authors estimate a major axis of 14 AU for the star with non-thermal emission. In this\nscenario, we have a quadruple star system: the contact binary, the star with non-thermal emission in a 6.7 yr\norbit around the contact binary, and the NE component.\nTo advance our understanding of the nature of the time-variable non-thermal emission, a determination of\nthe angular size of the source producing it is needed. Using VLA data taken at 8.46 GHz in 1991 October 3\n(when Cyg OB2 #5 was in the high radio state), Miralles et al. (1994) estimated an angular size of 0.′′ 046±0.′′ 006\nfor the whole (non-thermal plus thermal components) emission. Using MERLIN data taken at 4.8 GHz in 1996\nNovember 14 (when Cyg OB2 #5 was again in the high radio state), Kennedy et al. (2010) estimated an\nangular size of ∼ 0.′′ 077 for the whole (non-thermal plus thermal components) emission associated with the\nprimary radio component. Since the thermal contribution comes from the ionized wind that is known to be\nextended, these size estimates can be considered as upper limits to the size of the non-thermal emission. In this\npaper we present the analysis of archive 8.46 GHz continuum observations made with the Very Large Array\n(VLA) of the NRAO3 in the A configuration toward Cyg OB2 #5 in two epochs. During 1994 April 9 (1994.27),\nthe source was in the low radio state and only the thermal emission from the ionized stellar wind was present.\nThese observations were used to estimate the characteristics of the persistent thermal component. During\n1996 December 28 (1996.99), the source was in the high radio state, with both the thermal and non-thermal\ncomponents present. Using the information obtained from the 1994 data, it is possible to subtract in the (u,v)\nplane the contribution from the thermal component and obtain a more stringent estimate of the angular size\nof the non-thermal emission.\n2. DATA REDUCTION\nThe archive data were edited and calibrated using the software package Astronomical Image Processing\nSystem (AIPS) of NRAO. The parameters of the observations are given in Table 1. The absolute amplitude\ncalbrator for both epochs was 1331+305, with an adopted flux density of 5.21 Jy. The (u,v) data were selfcalibrated in amplitude and phase. An image was made with the 1994.27 (u,v) data and the clean components\nof this image were subtracted from the 1996.99 (u,v) data using the AIPS task UVSUB. The resulting (u,v)\ndata, that we refer to as 1996.99-1994.27, was analyzed both in the image and in the (u,v) planes. In the\nimage plane a compact, basically unresolved source is observed. A Gaussian ellipsoid fit to this source in\nthe image plane using the AIPS task JMFIT indicates maximum possible deconvolved angular dimensions of\n0.′′ 035 × 0.′′029 (major axis × minor axis) for the source. However, White & Becker (1982) have shown that it is\nbetter to study the angular dimensions of marginally resolved sources directly in the (u,v) plane. We then fitted\ndirectly the (u,v) data in two dimensions using the AIPS task UVFIT and a Gaussian ellipsoid model. The fit\ngave 0.′′ 023 ± 0.′′ 013 × 0.′′ 023 ± 0.′′ 019 (major axis × minor axis) for the source. This result indicates that the\nsource is very compact and that, within the error, it shows no strong departures from a circular morphology.\nWe then adopt as an estimate of the Gaussian angular size (full width at half maximum) of the source the\ngeometric mean of the major and minor axes, that gives θG = 0.′′ 023 ± 0.′′ 012.\n3 The National Radio Astronomy Observatory is operated by Associated Universities Inc. under cooperative agreement with\nthe National Science Foundation.\n\n\fSIZE OF NON-THERMAL COMPONENT IN CYG OB2 #5\n\n3\n\nTABLE 1\nARCHIVE DATA USED\n\nEpoch\n1994 Apr 09 (1994.27)\n1996 Dec 28 (1996.99)\na\n\nProject\nAR277\nAR277\n\nFrequency\n(GHz)\n8.46\n8.46\n\nOn-source\nTime (min)\n37\n45\n\nPhase\nCalibrator\n2007+404\n2007+404\n\nBootstrapped\nFlux Density (Jy)\n2.84±0.01\n2.89±0.01\n\nMajor axis × minor axis; position angle, for a (u,v) weighting of ROBUST = 0 (Briggs 1995).\n\nThe angular size determined for the non-thermal emission depends on the model assumed to fit the (u,v)\ndata. A model of a circular disk with constant brightness gives an angular diameter of θD = 0.′′ 019 ± 0.′′ 010.\nGiven that the errors are comparable to the measurements, we will take this determination as an upper limit,\nθ(′′ ) ≤ 0.′′ 02, to the angular size of the non-thermal emission.\n\n3. INTERPRETATION\nThe small angular size found for the non-thermal component, θ(′′ ) ≤ 0.′′ 02, can be used to discuss the\nnature of the non-thermal component. An expanding envelope ejected periodically from the binary (Persi et\nal. 1990; Bieging et al. 1989; Miralles et al. 1994) would have to be bigger than the radio photosphere to be\noutside the optically thick region around the contact binary system. We can use the results for the 1994 data\ndiscussed in the Appendix to estimate that the radio photosphere at 8.46 GHz has an angular size of θ(′′ ) ≃ 72\nmilli-arcseconds. We then conclude that an envelope cannot explain the observations since the non-thermal\nemission would be significantly larger than observed. Recently, Pittard (2010) has proposed that the time\nvariable emission observed in O+O binaries can come from the thermal emission from the wind-collision region\nbetween the stars. In the case of Cyg OB2 #5 the wind-collision region between the members of the contact\nbinary is probably a strong emitter, but lies deep inside the radio photosphere of the system, although it is\nknown that the radio photospheres can be clumpy or asymmetric, allowing the detection of sources embedded\nin it (e.g. WR140; White & Becker 1991). The wind-collision region could also be located between the contact\nbinary and a third star. Kennedy et al. (2010) discussed the variations arising from non-thermal emission in\na wind-collision region between the contact binary and a third star. They demonstrate that thermal emission\nvariations that may arise in such a wind-collision region will not have sufficient amplitude to account for the\nvariations, and conclude that the thermal-emission Pittard models would predict smaller flux changes than\nobserved. The Kennedy et al. (2010) models also account well for the variable radio emission. We then favor\nthe possibility of a third star with non-thermal emission in orbit around the contact binary, as proposed by\nKennedy et al. (2010), or a wind-collision region.\nEven when the non-thermal emission from young, low-mass stars is typically associated with gyrosynchrotron\nemission from Lorentz γ factors of a few (e.g. Ray et al. 1997), while the emission from massive stars is believed\nto be synchrotron from relativistic electrons with very large γ factors (e.g. Pittard & Dougherty, 2006), we\ncannot rule out the possibility that the non-thermal emission from Cyg OB2 #5 is being produced by a young,\nlow-mass star (i.e. a Tauri star) that formed coevally with the rest of the system. The non-thermal emission\nfrom young, low-mass stars is usually very compact. For the T Tau Sb star, with a mass of 0.6 M⊙ , Loinard\net al. (2005; 2007) estimate an angular size of 0.5 mas, that at a distance of 147.6 pc corresponds to a radius\nof ∼8 R⊙ . For the more massive S1 star (6 M⊙ ) in Ophiuchus, Loinard et al. (2008) estimate an angular size\nof 0.95 mas, that at a distance of 116.9 pc corresponds to a radius of ∼12 R⊙ . At the larger distance of 925 pc\n(Linder et al. 2009), we expect a non-thermal star associated with Cyg OB2 #5 to have an angular size well\nbelow the milli-arcsecond.\nCyg OB2 #5 will be again in high state during 2010 and 2011 and a very long baseline interferometry study\nis needed to determine accurately the angular size and morphology of the compact non-thermal emission.\n\n\f4\n\nRODRı́GUEZ ET AL.\n\nFig. 1. (Left) Real (filled squares) and imaginary (empty squares) components of the emission at 8.46 GHz for 1994\nApril 9. The dashed line is the least squares fit to the real component. (Right) Same as in the left panel for 1996\nDecember 28. The imaginary component is consistent with zero, indicating that the source is symmetric about the\nphase center (the origin of the visibility plane) and has no significant structure on these spatial scales.\n\n4. CONCLUSIONS\nWe present the analysis of VLA archive data of the Cyg OB2 #5 system taken during the high (1996)\nand low (1994) radio states. This analysis allows the subtraction, in the (u,v) plane of the persistent thermal\ncomponent and a better estimate of the angular dimensions of the non-thermal component. We obtain an\nupper limit, θ(′′ ) ≤ 0.′′ 02 for the angular size of the non-thermal emission. Cyg OB2 #5 will be again in high\nstate during 2010 and 2011 and a very long baseline interferometry study is needed to determine the angular\nsize and morphology of the compact non-thermal emission.\nWe are thankful for the support of DGAPA, UNAM, and of CONACyT (México). This research has made\nuse of the SIMBAD database, operated at CDS, Strasbourg, France.\nAPPENDIX\nA. ONE-DIMENSIONAL ANALYSIS OF THE VISIBILITY FUNCTION\nIf the sources have approximate circular symmetry, the analysis of the (u,v) data can be made in a onedimension approximation. To test if this was possible with the data discussed here, the NE component was\nsubtracted in two dimensions in the (u,v) plane of both data sets using Gaussian ellipsoid models to leave only\nthe emission from the main component, the one directly associated with the contact binary. This subtraction\nwas performed using the AIPS task UVMOD. We then fitted the (u,v) data in two dimensions using the AIPS\ntask UVFIT and a Gaussian ellipsoid model. The fits gave 0.′′ 079 ± 0.′′007 × 0.′′066 ± 0.′′008 (major axis × minor\naxis) for the 1994.27 data and 0.′′ 045 ± 0.′′ 006 × 0.′′ 036 ± 0.′′ 005 (major axis × minor axis) for the 1996.99 data.\nThese results indicate that, within error, the emission at both epochs does not show strong departures from\na circular assumption. We also note that at a distance of 925 pc (Linder et al. 2009), the semimajor axis of\nthe non-thermal star (7 AU) will subtend an angle of only 0.008\", below the upper limit of 0.020\" found for\n\n\fSIZE OF NON-THERMAL COMPONENT IN CYG OB2 #5\n\n5\n\nthe angular size of the non-thermal component. It is quite possible that this non-thermal star, if present, will\nintroduce asymmetries but future VLBI observations will be needed to test this.\nIn Figure 1 we present the one-dimensional real and imaginary components of the amplitude as a function\nof baseline. These values were obtained using the AIPS task UVPLT that averages in circular rings around the\norigin of the (u,v) plane. Before applying this task, the source emission was centered in this origin.\nFor a marginally resolved wind source, the real part of the visibility, V (b), can be fitted in one-dimension\nwith a linear function (Escalante et al. 1989):\nV (b) = S0 − Ab,\n\n(1)\n\nwhere S0 is the flux density at zero spacing (the total flux density), given in mJy, A is the slope of the linear\nfit, and b is the baseline separation in wavelengths. For 1994 only the thermal (T) emission was present and\nwe obtain S0 (T ) = 3.79 ± 0.09 mJy and A(T ) = (1.64 ± 0.18) × 10−6 mJy wavelengths−1. For 1996 both the\nthermal and non-thermal (T+N) emissions were present and we obtain S0 (T + N ) = 9.46 ± 0.05 mJy and\nA(T + N ) = (2.07 ± 0.14) × 10−6 mJy wavelengths−1. The fact that both epochs give similar slopes suggests\nthat, as expected, most of the extended emission comes from the thermal component. Subtracting the 1994 fit\nto the 1996 fit we obtain the non-thermal (N) contribution alone, that is given by S0 (N ) = 5.67 ± 0.10 mJy\nand A(N ) = (0.43 ± 0.23) × 10−6 mJy wavelengths−1 . The characteristic angular size of the emitting region is\ngiven by (Escalante et al. 1989; Miralles et al. 1994):\nθ(′′ ) ≃ 1.44 × 105\n\nA\n,\nS0\n\n(2)\n\nwhich gives θ(′′ ) ≃ 0.′′ 011 ± 0.′′ 006 for the non-thermal component. It should be noted that our fitting of the\nnon-thermal component to a thermal wind model may not be consistent since the structure of the visibilities for\nan optically thin non-thermal source and a partially optically thick stellar wind are not necessarily the same.\nIn Table 2 we summarize the parameters obtained for the thermal and thermal plus non-thermal states as well\nas the subtraction, that traces the non-thermal emission alone.\nTABLE 2\nPARAMETERS FROM FITS\nEmissiona\nT\nN+T\nN\na\nb\n\nS0\n(mJy)\n3.79±0.09\n9.46±0.05\n5.67±0.10\n\nA\n(10−6 mJy λ−1 )\n1.64±0.18\n2.07±0.14\n0.43±0.23\n\nθ\n(masb )\n62±7\n32±2\n11±6\n\nT = Thermal, N = Non-thermal.\nmas = milli-arcseconds.\n\nREFERENCES\nAbbott, D. C., Bieging, J. H., & Churchwell, E. 1981, ApJ, 250, 645\nBieging, J. H., Abbott, D. C., & Churchwell, E. B. 1989, ApJ, 340, 518\nBriggs, D. 1995, Ph.D. thesis, New Mexico Inst. of Mining and Technology\nContreras, M. E., Rodriguez, L. F., Tapia, M., Cardini, D., Emanuele, A., Badiali, M., & Persi, P. 1997, ApJ, 488, L153\nEscalante, V., Rodrı́guez, L. F., Moran, J. M., & Cantó, J. 1989, Revista Mexicana de Astronomia y Astrofisica, 17, 11\nHall, D. S. 1974, Acta Astronomica, 24, 69\nHerbig, G. H. 1967, PASP, 79, 502\nKennedy, M., Dougherty, S. M., Fink, A., & Williams, P. M. 2010, ApJ, 709, 632\nLeung, K.-C., & Schneider, D. P. 1978, ApJ, 224, 565\nLinder, N., Rauw, G., Manfroid, J., Damerdji, Y., De Becker, M., Eenens, P., Royer, P., & Vreux, J.-M. 2009, A&A,\n495, 231\n\n\f6\n\nRODRı́GUEZ ET AL.\n\nLoinard, L., Mioduszewski, A. J., Rodrı́guez, L. F., González, R. A., Rodrı́guez, M. I., & Torres, R. M. 2005, ApJ, 619,\nL179\nLoinard, L., Torres, R. M., Mioduszewski, A. J., Rodrı́guez, L. F., González-Lópezlira, R. A., Lachaume, R., Vázquez,\nV., & González, E. 2007, ApJ, 671, 546\nLoinard, L., Torres, R. M., Mioduszewski, A. J., & Rodrı́guez, L. F. 2008, ApJ, 675, L29\nMiralles, M. P., Rodriguez, L. F., Tapia, M., Roth, M., Persi, P., Ferrari-Toniolo, M., & Curiel, S. 1994, A&A, 282, 547\nPersi, P., Ferrari-Toniolo, M., Tapia, M., Roth, M., & Rodriguez, L. F. 1985, A&A, 142, 263\nPersi, P., Tapia, M., Rodriguez, L. F., Ferrari-Toniolo, M., & Roth, M. 1990, A&A, 240, 93\nPittard, J. M., & Dougherty, S. M. 2006, MNRAS, 372, 801\nPittard, J. M. 2010, MNRAS, 391\nRauw, G., Vreux, J.-M., & Bohannan, B. 1999, ApJ, 517, 416\nRay, T. P., Muxlow, T. W. B., Axon, D. J., Brown, A., Corcoran, D., Dyson, J., & Mundt, R. 1997, Nature, 385, 415\nWhite, R. L., & Becker, R. H. 1982, ApJ, 262, 657\nWhite, R. L., & Becker, R. H. 1995, ApJ, 451, 352\n\nYolanda Gómez, Laurent Loinard, and Luis F. Rodrı́guez: Centro de Radiostronomı́a y Astrofı́sica, UNAM, A.\nP. 3-72, (Xangari), 58089 Morelia, Michoacán, México (y.gomez, l.loinard, l.rodriguez@astrosmo.unam.mx).\nAmy J. Mioduszewski: National Radio Astronomy Observatory, 1003 Lopezville Road, Socorro, NM 87801,\nUSA (amiodusz@nrao.edu).\n\n\f"}