{"id": "http://arxiv.org/abs/1106.0937v2", "guidislink": true, "updated": "2011-09-10T01:25:05Z", "updated_parsed": [2011, 9, 10, 1, 25, 5, 5, 253, 0], "published": "2011-06-05T23:45:41Z", "published_parsed": [2011, 6, 5, 23, 45, 41, 6, 156, 0], "title": "Retention of a Primordial Cold Classical Kuiper Belt in an\n  Instability-Driven Model of Solar System Formation", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1106.1485%2C1106.1987%2C1106.1634%2C1106.0668%2C1106.5091%2C1106.2942%2C1106.4660%2C1106.2715%2C1106.2980%2C1106.1722%2C1106.5873%2C1106.4532%2C1106.0011%2C1106.2517%2C1106.5395%2C1106.3873%2C1106.4359%2C1106.5656%2C1106.4056%2C1106.3544%2C1106.0850%2C1106.2493%2C1106.4383%2C1106.2125%2C1106.3581%2C1106.5274%2C1106.6149%2C1106.5139%2C1106.0514%2C1106.0472%2C1106.1413%2C1106.4266%2C1106.2696%2C1106.0937%2C1106.1004%2C1106.2918%2C1106.2228%2C1106.4041%2C1106.1685%2C1106.3319%2C1106.0148%2C1106.3691%2C1106.5593%2C1106.3317%2C1106.2510%2C1106.0897%2C1106.0817%2C1106.5167%2C1106.5564%2C1106.3515%2C1106.0887%2C1106.6049%2C1106.2683%2C1106.2260%2C1106.5858%2C1106.4626%2C1106.0787%2C1106.2006%2C1106.2158%2C1106.6152%2C1106.5996%2C1106.6320%2C1106.3343%2C1106.5901%2C1106.4340%2C1106.2972%2C1106.1579%2C1106.0489%2C1106.1020%2C1106.2651%2C1106.3732%2C1106.3367%2C1106.1561%2C1106.0956%2C1106.2910%2C1106.0353%2C1106.3240%2C1106.3847%2C1106.5562%2C1106.4671%2C1106.5558%2C1106.2367%2C1106.1111%2C1106.0352%2C1106.1538%2C1106.5143%2C1106.0340%2C1106.4907%2C1106.0765%2C1106.1657%2C1106.2441%2C1106.1560%2C1106.3928%2C1106.1591%2C1106.5697%2C1106.6220%2C1106.0763%2C1106.0967%2C1106.5690%2C1106.3017%2C1106.6298&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Retention of a Primordial Cold Classical Kuiper Belt in an\n  Instability-Driven Model of Solar System Formation"}, "summary": "The cold classical population of the Kuiper belt exhibits a wide variety of\nunique physical characteristics, which collectively suggest that its dynamical\ncoherence has been maintained through out the solar system's lifetime.\nSimultaneously, the retention of the cold population's relatively unexcited\norbital state has remained a mystery, especially in the context of a solar\nsystem formation model, that is driven by a transient period of instability,\nwhere Neptune is temporarily eccentric. Here, we show that the cold belt can\nsurvive the instability, and its dynamical structure can be reproduced. We\ndevelop a simple analytical model for secular excitation of cold KBOs and show\nthat comparatively fast apsidal precession and nodal recession of Neptune,\nduring the eccentric phase, are essential for preservation of an unexcited\nstate in the cold classical region. Subsequently, we confirm our results with\nself-consistent N-body simulations. We further show that contamination of the\nhot classical and scattered populations by objects of similar nature to that of\ncold classicals has been instrumental in shaping the vast physical diversity\ninherent to the Kuiper belt.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1106.1485%2C1106.1987%2C1106.1634%2C1106.0668%2C1106.5091%2C1106.2942%2C1106.4660%2C1106.2715%2C1106.2980%2C1106.1722%2C1106.5873%2C1106.4532%2C1106.0011%2C1106.2517%2C1106.5395%2C1106.3873%2C1106.4359%2C1106.5656%2C1106.4056%2C1106.3544%2C1106.0850%2C1106.2493%2C1106.4383%2C1106.2125%2C1106.3581%2C1106.5274%2C1106.6149%2C1106.5139%2C1106.0514%2C1106.0472%2C1106.1413%2C1106.4266%2C1106.2696%2C1106.0937%2C1106.1004%2C1106.2918%2C1106.2228%2C1106.4041%2C1106.1685%2C1106.3319%2C1106.0148%2C1106.3691%2C1106.5593%2C1106.3317%2C1106.2510%2C1106.0897%2C1106.0817%2C1106.5167%2C1106.5564%2C1106.3515%2C1106.0887%2C1106.6049%2C1106.2683%2C1106.2260%2C1106.5858%2C1106.4626%2C1106.0787%2C1106.2006%2C1106.2158%2C1106.6152%2C1106.5996%2C1106.6320%2C1106.3343%2C1106.5901%2C1106.4340%2C1106.2972%2C1106.1579%2C1106.0489%2C1106.1020%2C1106.2651%2C1106.3732%2C1106.3367%2C1106.1561%2C1106.0956%2C1106.2910%2C1106.0353%2C1106.3240%2C1106.3847%2C1106.5562%2C1106.4671%2C1106.5558%2C1106.2367%2C1106.1111%2C1106.0352%2C1106.1538%2C1106.5143%2C1106.0340%2C1106.4907%2C1106.0765%2C1106.1657%2C1106.2441%2C1106.1560%2C1106.3928%2C1106.1591%2C1106.5697%2C1106.6220%2C1106.0763%2C1106.0967%2C1106.5690%2C1106.3017%2C1106.6298&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The cold classical population of the Kuiper belt exhibits a wide variety of\nunique physical characteristics, which collectively suggest that its dynamical\ncoherence has been maintained through out the solar system's lifetime.\nSimultaneously, the retention of the cold population's relatively unexcited\norbital state has remained a mystery, especially in the context of a solar\nsystem formation model, that is driven by a transient period of instability,\nwhere Neptune is temporarily eccentric. Here, we show that the cold belt can\nsurvive the instability, and its dynamical structure can be reproduced. We\ndevelop a simple analytical model for secular excitation of cold KBOs and show\nthat comparatively fast apsidal precession and nodal recession of Neptune,\nduring the eccentric phase, are essential for preservation of an unexcited\nstate in the cold classical region. Subsequently, we confirm our results with\nself-consistent N-body simulations. We further show that contamination of the\nhot classical and scattered populations by objects of similar nature to that of\ncold classicals has been instrumental in shaping the vast physical diversity\ninherent to the Kuiper belt."}, "authors": ["Konstantin Batygin", "Michael E. Brown", "Wesley C. Fraser"], "author_detail": {"name": "Wesley C. Fraser"}, "author": "Wesley C. Fraser", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1088/0004-637X/738/1/13", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1106.0937v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1106.0937v2", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "9 pages, 11 figures, accepted for publication in ApJ", "arxiv_primary_category": {"term": "astro-ph.EP", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph.EP", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1106.0937v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1106.0937v2", "journal_reference": null, "doi": "10.1088/0004-637X/738/1/13", "fulltext": "Draft version March 30, 2018\nPreprint typeset using LATEX style emulateapj v. 11/10/09\n\nRETENTION OF A PRIMORDIAL COLD CLASSICAL KUIPER BELT IN AN INSTABILITY-DRIVEN MODEL\nOF SOLAR SYSTEM FORMATION\nKonstantin Batygin, Michael E. Brown & Wesley C. Fraser\n\narXiv:1106.0937v2 [astro-ph.EP] 10 Sep 2011\n\nDivision of Geological and Planetary Sciences, California Institute of Technology, Pasadena, CA 91125\nDraft version March 30, 2018\n\nABSTRACT\nThe cold classical population of the Kuiper belt exhibits a wide variety of unique physical characteristics, which collectively suggest that its dynamical coherence has been maintained through out\nthe solar system's lifetime. Simultaneously, the retention of the cold population's relatively unexcited\norbital state has remained a mystery, especially in the context of a solar system formation model, that\nis driven by a transient period of instability, where Neptune is temporarily eccentric. Here, we show\nthat the cold belt can survive the instability, and its dynamical structure can be reproduced. We\ndevelop a simple analytical model for secular excitation of cold KBOs and show that comparatively\nfast apsidal precession and nodal recession of Neptune, during the eccentric phase, are essential for\npreservation of an unexcited state in the cold classical region. Subsequently, we confirm our results\nwith self-consistent N-body simulations. We further show that contamination of the hot classical and\nscattered populations by objects of similar nature to that of cold classicals has been instrumental in\nshaping the vast physical diversity inherent to the Kuiper belt.\n1. INTRODUCTION\n\nThe quest to understand the origins of the solar system dates back centuries. The last two decades, however, have seen a renewed interested in the problem, as\nthe discovery of the Kuiper belt (Jewitt & Luu 1993)\nhas provided important new clues to the physical processes that took place during the early stages of our solar system's evolution. The continued acquisition of new\ninformation gave rise to a multitude of new formation\nmodels (see Morbidelli et al. (2008) for a comprehensive\nreview). Among the newly proposed scenarios, an instability model, termed the \"Nice\" model (Tsiganis et\nal. 2005; Gomes et al. 2005; Morbidelli et al. 2005), has\nbeen particularly successful in reproducing the observed\nproperties of planetary orbits and the Kuiper belt (Levison et al. 2008).\nWithin the context of the narrative told by the Nice\nmodel, planets start out in a multi-resonant configuration (Morbidelli et al. 2007; Batygin & Brown 2010),\nand, driven by planetesimal scattering, begin migrating divergently (Fernandez & Ip 1984). Eventually, the\nplanets encounter a low-order mean motion resonance,\nwhich results in a transient period of instability. During this period, the ice giants scatter outwards and settle\nroughly onto their current semi-major axes but with high\neccentricities (Tsiganis et al. 2005; Thommes et al. 2008).\nNeptune's excited eccentricity gives rise to a chaotic sea\nbetween its exterior 3:2 and 2:1 mean motion resonances\n(MMRs), allowing planetesimals to random-walk into the\n\"classical\" region (Levison et al. 2008). Subsequently, as\nthe planets circularize due to dynamical friction (Stewart & Wetherill 1988), the scattered and resonant populations of the Kuiper belt are sculpted.\nAn outstanding problem within the Nice model lies\nin the formation of the cold classical population of the\nKuiper belt, which is the central theme of this study. The\ncold population is distinctive from the rest of the Kuiper\nkbatygin@gps.caltech.edu\n\nbelt in a number of ways. First and foremost, as its name\nsuggests, the orbital distribution is dynamically unexcited. When Neptune scatters planetesimals, it tends to\npump up their inclinations to tens of degrees. Yet the\ncold population resides on nearly co-planar orbits, with\ninclinations not exceeding ∼ 5 deg (Brown 2001; Gladman et al. 2008). The eccentricities of the cold population, on average, also tend to be diminished in comparison with the hot population, but the division there is not\nas apparent. Figure 1 shows the eccentricities of the current aggregate of observed Kuiper Belt objects (KBOs)\nbetween 30 and 60AU. Cold classical objects, whose inclinations are below 5 deg are plotted as black dots, while\nall other objects with inclinations above 5 deg are plotted\nas blue dots. Note that cold population's eccentricity distribution is not monotonic in semi-major axes. Between\n42AU and 45AU, planar KBOs have roughly isentropic\neccentricities. However, low-eccentricity objects progressively disappear beyond 45AU. We refer to this feature\nof the Kuiper belt as the \"wedge\" (see Figure 1).\nA second distinction is the colors of cold classical\nKBOs. In general, the Kuiper belt exhibits a vast diversity of colors, from neutral gray to deep red. Within\nthis range, cold classical KBOs readily stand out as\nclump of exclusively red material (Trujillo & Brown 2002;\nLykawka & Mukai 2005). In a similar manner, the size\ndistribution of the cold population differs significantly\nfrom that of the hot classical population (Fraser et al.\n2010). Finally, the fraction of binaries present in the\ncold population is uniquely large (Stephens & Noll 2006).\nMoreover, it has been shown that the wide binaries of the\ncold population in particular, would have been disrupted\nby encounters with Neptune (Parker & Kavelaars 2010),\nand thus must have never been scattered. While it is\ndifficult to interpret each of these observational facts as\nconclusive evidence for a particular history, their coherence suggests that the cold classicals are a unique population whose dynamical similarity has been maintained\nthrough the dramatic evolution of the outer solar system\n\n\f2\n\nBatygin Brown Fraser\n2. SECULAR EXCITATION OF THE COLD KUIPER-BELT\n\nFig. 1.- Semi-major axis vs. eccentricity of he observed Kuiper\nbelt. The black points denote objects with inclinations below i <\n5 deg i.e. the cold classical population. The blue points represent\nall other objects with i > 5 deg. The filled curves represent the\nscattered disk region and the major mean-motion resonances are\nshown as solid lines. The triangle, adjacent to the 2:1 MMR depicts\nthe wedge structure, inherent to the cold classical population.\n\n(Morbidelli & Brown 2004).\nA number of formation mechanisms for the cold classical population have been suggested. Within the context\nof a smooth migration scenario (Malhotra 1995; MurrayClay & Chiang 2005; Hahn & Malhotra 2005), a primordially cold population can in principle escape dynamical\nexcitation. However, other drawbacks of the smooth migration scenario, such as the inability to reproduce secular architecture of the planets and difficulties in forming the hot classical belt, render it unlikely (Morbidelli\net al. 2009; Brasser et al. 2009). Levison et al. (2008)\nadvocated a similar emplacement history for the cold\nclassicals as the hot classicals (i.e. via MMR overlap).\nThe cold population that is produced in such simulations\nhowever, is not cold enough and not physically distinct\nfrom the hot population. Subsequently, Morbidelli et al.\n(2008) showed that if a local, cold population is implemented into the orbital solution of Levison et al. (2008),\nit will have the same orbital distribution as the implanted\npopulation after the instability, so the problem remains.\nThus, no coherent picture of the formation of the cold\npopulation exists.\nIn this work, we show that in-situ formation of the cold\npopulation is consistent with an instability model and all\nobserved dynamical properties of the population, including the low inclinations and the wedge (shown in Figure\n1) can be formed. The aim here is not to replicate the\nKuiper belt and the orbits of the planets in a complex\nN-body simulation, but rather to identify the dynamical processes responsible for the sculpting of the region.\nThe plan of our paper is as follows: in section 2, we construct an analytical model for secular excitation of a primordially unexcited belt, and thus derive the conditions\nfor retention of dynamically cold orbits. Moreover, we\nshow that the now-fossil wedge is a result of a temporary\nslow-down in orbital precession. In section 3, we perform\nself-consistent N-body simulations that confirm our analytical results. Numerical simulations show that while\nthe cold population can remain undisrupted, similar objects immediately interior to the 3:2 MMR get scattered\nall over the Kuiper belt. We conclude and discuss our\nresults in section 4.\n\nHere, we seek to develop a simplified analytical model\nthat describes the long-term interactions between Neptune and an initially dynamically cold population of\nKBOs, residing between its exterior 3:2 and 2:1 MMRs,\nduring a transient phase of high eccentricity. Prior to the\ninstability, the planets sit in a compact configuration on\nnear-circular orbits. As long as the orbital separation between the planets and KBOs remains large, their mutual\ninteractions are extremely weak, so the KBOs maintain\ntheir dynamically cold orbits. Consequently this period\nis unimportant to the problem at hand.\nWhen planet-planet resonance crossing (or some other\nmechanism) causes the instability, the gain in semi-major\naxes and acquisition of high eccentricities and inclination\nof the planets takes place on a time scale that is considerably shorter than Neptune's apsidal precession period\n(i.e. less than a million years or so). As a result, it can\nbe viewed as instantaneous within the context of a secular approximation. Thus, in an orbit-averaged sense, it\nis as if Neptune suddenly appears at 30 AU with a high\ne and i and begins interacting with the KBOs. Since we\nseek to show that after the transient phase of high eccentricity, the KBOs can end up on dynamically cold orbits,\nwe must restrict Neptune from penetrating the region\nbeyond 40 AU. This places the maximum eccentricity,\nattainable by Neptune, below emax < (4/3 − 1) = 1/3.\nThis is however a weak constraint, since an eccentric, inclined Neptune can still cause large modulations in the\neccentricities and inclinations of the KBOs on a secular time-scale (Murray & Dermott 1999). Let us now\ndevelop a mathematical model for these secular interactions.\nWe begin by modeling Neptune's evolution. In our\nmodel, we take the mass of the cold KBOs to be negligible, so they have no effect on Neptune's orbit (this is not\nnecessarily true, at all times, for other Kuiper belt populations). The lack of mass in the primordial cold belt\nis a requirement for our model that brings up concerns\nabout its formation. We shall discuss this in some detail in section 4. Since we seek to retain the majority of\nthe local population, and we know that the mass of the\ncurrent cold classical population is much less than that\nof the Earth, this is a reasonable assumption. The other\nplanets, as well as the massive component of the Kuiper\nbelt, will cause apsidal and nodal precessionDof Neptune's\nE\norbit, which we write as g = h$̇N i and f = Ω̇N respectively. Note that we are only accounting for the average\nprecessions. We express dynamical friction as exponential decay of e & i with constant time-scales τe and τi .\nThese time-scales are different, and their numerical values in N-body simulations tend to be of order ∼ 107\nyears (Levison et al. 2008). We neglect the modulation\nof Neptune's e & i by the other planets. In other words,\nwe only retain the free elements.\nIn terms of complex Poincarè variables (x =\ne exp(ı$), y = i exp(ıΩ)), we can formulate the firstorder Lagrange's equations for Neptune as follows:\ndxn\nxn\n= ıgxn −\ndt\nτe\n\ndyn\nyn\n= ıf yn − .\ndt\nτi\n\n(1)\n\nIt is trivial to show that these equations admit the solu-\n\n\fCold Classical KBOs are Primordial\n\n3\n\nvarying g leads to dramatically different results. In particular, if low-eccentricities are to be retained, g must\nsignificantly exceed g8 .\nAfter a sufficient amount of time, when Neptune's eccentricity has decayed away (i.e. t \u001d τe ), the second\nexponential in the numerator of equation (4) can be neglected. Such a solution represents a precessing KBO\nwith a constant eccentricity. Accordingly, the time dependence of the solution only governs its angular part.\nSince we are solely interested in the final orbits of the\nKBOs, we must extract only the radial part of the solution. Let us write the t \u001d τe solution as an exponential\nof an arbitrary number, ξ:\nexp(ξ) =\nFig. 2.- Secular excitation of a KBO at a = 45AU, as dictated by\nequation (4). In these solutions, we chose aN = 30AU, e0n = 0.25,\nand τe = 4Myr. The final eccentricities (given by equation 8)\nare plotted as dots. Note that a low final eccentricity requires a\ncomparatively fast precession.\n\ne0n τe An\nξ = ln( p\n)\n1 + τe2 (g − A)2\n\nyn = i0n exp[(ıf −1/τi )t], (2)\n\nwhere e0n and i0n are the initial (maximum) eccentricity\n√\nand inclination of Neptune respectively and ı = −1.\nHere, we take e0n = 0.25 and i0n = 10 deg, in accord with\nresults of numerical simulations (Tsiganis et al. 2005;\nLevison et al. 2008; Batygin & Brown 2010). In our\nsimple model, the secular evolution of the KBOs is dictated entirely by Neptune's evolution. In the spirit of\nLaplace-Lagrange secular theory, we only retain terms\nup to second order in eccentricity and inclination in the\ndisturbing function of the KBOs to ensure a decoupled,\nanalytical solution. The resulting first-order Lagrange's\nequations read (Wu & Goldreich 2002)\ndxkbo\ndykbo\n= ıAxkbo +ıAn xn\n= ıBykbo +ıBn yn , (3)\ndt\ndt\nwhere A, An , B, and Bn are constants that depend only\non the planetary masses and semi-major axes ratios of\nNeptune to KBOs (e.g. Ch.7 of Murray & Dermott\n(1999)). Note that in the free precession terms, (A,B),\nthe presence of other planets can also be accounted for\nwith ease.\nFrom here, let us focus only on the eccentricity evolution, since the derivation of the inclination evolution\nfollows an identical procedure. Setting the initial orbital\nstate vector the KBO to zero ([x, y] = ~0), the solution to\nthe above equation reads\nxkbo =\n\ne0n τe An (exp[ıAt] − exp[(ıg − 1/τe )t])\n.\nAτe − gτe − ı\n\n(4)\n\nThe controlling parameter in this solution is Neptune's\nprecession, g. Four solutions, for a KBO at a = 45AU,\nwith different g's are presented in Figure 2. A natural\nunit of g is the g8 eigenfrequency of the Laplace-Lagrange\nsecular solution for the solar system, which physically\ncorresponds to Neptune's average precession rate in the\ncurrent solar system (see Murray & Dermott (1999)).\nIncidentally, the same unit can be used for the nodal\nrecession rate in the inclination solution, since quantitatively g8 ≈ −f8 ≈ 0.65\"/yr. As can be seen in Figure 2,\n\n(5)\n\nSolving for ξ, and complex-expanding the logarithm, we\nhave\n\ntions\nxn = e0n exp[(ıg −1/τe )t]\n\ne0n τe An exp[ıAt]\n.\nAτ − gτ − ı\n\n+ ı arg(−\n\ne0n τe An exp[ıAt]\n).\nı − τe (A − g)\n\n(6)\n\nThe argument of the logarithm in the above equation\nis the radial part of the complex solution, which corresponds to the final eccentricity of the KBO, with an\nequivalent expression for the inclination:\ne0n τe An\ninal\nefkbo\n=p\n1 + τe2 (g − A)2\ninal\nifkbo\n=p\n\ni0n τi Bn\n1 + τi2 (f − B)2\n\n.\n\n(7)\n\nIn principle, we could have arrived at the same answer\nby complex-expanding the solution and taking the square\nroot of the sum of the squares of the real and imaginary\nparts, although the intermediate expressions would have\nbeen considerably more messy.\nThe above equations can be simplified even further by\nconsidering their limiting regimes. If the decay time-scale\nis much longer than the beat frequency (g −A, f −B), we\ncan Taylor expand the equations to first order in (1/τ )\naround zero. The answer then becomes independent of\nτ.\nBn\nAn\ninal\ninal\nifkbo\n' i0n\n(8)\nefkbo\n' e0n\ng−A\nf −B\nThis procedure is equivalent to assuming that τe2 (g −\nA)2 \u001d 1 or τi2 (f − B)2 \u001d 1 and throwing away the 1 under the square root in the denominator1 . It is clear from\nFigure 2, where the approximate solutions are plotted as\nbig dots, that quantitative agreement with the \"full\" solution (equation 4) is excellent, in the parameter regime\nof interest.\nFigures 3 and 4 show the secular excitation of initially\ncold KBOs eccentricities and inclinations between the 3:2\nand 2:1 MMRs with g = 0, g8 , 2g8 and 3g8 as solid lines.\n1\n\nAlternatively, if the decay time-scales are short, we are in the\ninal\nnon-adiabatic regime, where the solutions become efkbo\n' e0n τe An\nf inal\n0\nand ikbo ' in τi Bn\n\n\f4\n\nBatygin Brown Fraser\n\nFig. 3.- Post-excitation (final) eccentricities in the cold region of\nthe Kuiper belt. Solutions with g = 0, g8 , 2g8 and 3g8 are presented\nas solid lines. Note that in order to retain nearly-circular orbits\ng & 3g8 is required. The dashed line represents a solution where\nNeptune's precession rate is not kept constant. The shaded region\ncorresponds to the scattered disk.\n\nThese solutions suggest that if one is to retain an eccentricity below e < 0.1 and inclination below i < 5 deg,\nNeptune's average orbital precession and nodal recession\nrates must have exceeded ∼ 3g8 during the eccentric\nphase. The enhanced precession is primarily a consequence of Uranus. When Neptune scatters, it arrives\nsomewhat closer to the sun than its current orbit and\nmigrates to ∼ 30AU by scattering KBOs (here, we have\nimplicitly omitted this effect by stating that the coefficients A, An , B, and Bn are constant). Thus, at the\ntime of scattering, the semi-major axis ratio of Neptune\nto Uranus may be lower, leading to an enhanced precession. Additionally, the mass contained in the Kuiper\nbelt may also play a role in inducing secular precession\nof Neptune.\nThe solution described above gives eccentricities that\nmonotonically decrease with semi-major axes. However,\nas already discussed above, the observed cold population exhibits a somewhat different behavior, with loweccentricity objects progressively disappearing in the\nvicinity of the 2:1 MMR. This dynamically unique structure (i.e. the wedge - see Figure 1) is an essential feature\nto any proposed formation mechanism for the cold classicals.\nA wedge-like structure cannot be reproduced by a\nsweeping 2:1 MMR in an instability-driven formation\nmodel. Unlike the smooth migration scenario, where\nresonant capture is possible (Henrard & Lamaitre 1983;\nMalhotra 1995; Ketchum et al. 2011), when Neptune is\neccentric, the chaotic motion, that arises from resonant\nsplitting (Wisdom 1980), leads to an effective randomization of the eccentricities (Quillen 2006). In other words,\nthe KBOs that are temporarily captured do not form a\ncoherent structure such as the wedge. An alternative scenario for formation of the wedge is one where the local\npopulation ends at 45AU, and the wedge is a result of\nan extended scattered disk with q ∼ 40AU (Gladman et\nal. 2008). It is unlikely, however, that in the extended\nscattered disk scenario, the low inclinations of scattered\nobjects could be preserved.\nHere, we propose the formation of the wedge to be a\nconsequence of secular perturbations. Thus, we seek to\nmodify the above secular solution such that it yields ec-\n\nFig. 4.- Post-excitation (final) inclinations in the cold region of\nthe Kuiper belt. Solutions with f = 0, g8 , 2g8 and 3g8 are presented\nas solid lines. Note that in order to retain i . 5 deg in the 42 −\n45AU region f . −3g8 is required. The dashed line represents a\nsolution where Neptune's nodal recession rate is not kept constant.\nNote that the quantitative character of the solution here is subtly\ndifferent from the eccentricity solution (Figure 3). This is because\nB involves a Laplace coefficient of the first kind, while A involves\nthat of the second kind.\n\ncentricities that are not monotonically decreasing with\nsemi-major axes in the region of interest. As already described above, the controlling parameter in the secular\nsolution is g. So far, we have kept g constant. However, since Neptune scatters numerous KBOs during its\ncircularization, and the orbits of other planets (particularly Uranus) are changing as well, one would expect\nNeptune's precession to vary considerably, in a chaotic\nmanner.\nIt is difficult to predict the exact nature of this variation without a detailed calculation, so here we consider\nan extreme case as a proof of concept. Namely, we set\ng = 4g8 at all times, except τ < t < 1.1τ , where we set\ng = 0. Note that the precession of Neptune need not\nnecessarily stop. We are choosing g = 0, rather than a\ndiminished precession rate (such as, say g = g8 ) merely\nfor the sake of argument. An analytical solution is attainable in a similar fashion as above, by breaking up the\nintegration into 3 separate time intervals. If g is not held\nconstant through out Neptune's circularization, the final\neccentricity and inclination take on a different character.\nQualitatively, this can be understood as follows: when\nNeptune stops precessing, it starts to induce considerable oscillations in eccentricities of KBOs; however, once\nthe precession becomes rapid again, the modulation stops\nand the eccentricities become frozen-in. These solutions\nare plotted as dashed curves in Figures 3 and 4. The details of the non-monotonic solution depend on when and\nfor how long Neptune's precession is halted, and change\nfurther if the precession is merely slowed down, rather\nthan stopped. Furthermore, the dashed curves in Figures 3 and 4 shift to larger semi-major axes if the free\nprecessions of the KBOs (A, B) are enhanced. While it\nis understood that these calculations do not reproduce\nthe cold classical population in detail, they do show that\nprimordially unexcited objects can retain cold orbits in\nface of dynamical excitation, and coherent structure can\nbe formed in the context of a purely secular solution.\n3. NUMERICAL SIMULATIONS\n\n\fCold Classical KBOs are Primordial\n\nFig. 5.- Orbital evolution of planets. The system starts out\nin the (2:1 4:3 4:3) initial condition, and undergoes a brief period\nof instability when Neptune (gray) and Saturn (Red) encounter a\nmutual 3:2 MMR. At t ≈ 22Myr, Neptune's precession rate temporarily slows down and sculpts the wedge. The boxes on the right\nof the plot correspond to actual semi-major axes of the giant planets. An evolved remnant planetesimal disk of this simulation is\npresented in Figures 7 & 8.\n\nHaving motivated in-situ formation of the cold classical population with analytical arguments, we now turn\nto numerical N-body simulations for confirmation of the\nabove results and inclusion of omitted physics (such as\nclose-encounters, mean-motion resonances, and higherorder secular terms in the disturbing function). In this\nstudy, the integrations were performed using the mercury6 integration software package (Chambers 1999) utilizing the \"hybrid\" algorithm. The disk was composed of\ntwo components. The massive planetesimal swarm, containing 3000 particles, resided between the immediate\nstability boundary of the initial multi-resonant configuration and ∼ 35AU. This was followed by a disk of another 3000 mass-less particles that extended to 60 AU.\nThus we are assuming that a significant density gradient exists, in the vicinity of Neptune's final orbit, such\nthat the mass in the outer disk is insufficient to drive\nNeptune's migration. However, the numbers of particles\nwere chosen due to considerations of computational cost\nand are not intended to be representative of the relative fraction of bodies in the planetesimal disk in any\nway. The initial conditions were drawn from the eight\nmulti-resonant states that were identified by Batygin &\nBrown (2010) as being compatible with an instability\nformation model. The planetesimals were initialized on\nnear-coplanar, near-circular orbits (e ∼ sin i ∼ 10−3 ).\nThe self-gravity of the planetesimal swarm was neglected\nto reduce computational cost of the experiments, as 30\npermutations of each initial condition were integrated.\nBatygin & Brown (2010) used the presence of scattering events between an ice giant and a gas giant, followed by a transient phase of high eccentricity, as a proxy\nfor whether successful formation of the classical Kuiper\nbelt can occur. Further constraints on the initial conditions can be placed by considering the reproduction of\nthe outer solar systems' secular eigenmodes. Particular\ndifficulty has been found in ensuring that the amplitude\nof Jupiters g5 mode is larger than that of the g6 mode\n(Morbidelli et al. 2009). Having completed all of the integrations, we checked the relative amplitudes of the g5\nand the g6 modes in all solutions. Surprisingly, we found\n\n5\n\nFig. 6.- Orbital evolution of planets. The system starts out\nin the (5:3 4:3 3:2) initial condition, and undergoes a brief period\nof instability when Saturn (Red) and Jupiter (Black) encounter a\nmutual 2:1 MMR. The boxes on the right of the plot correspond to\nactual semi-major axes of the giant planets. An evolved remnant\nplanetesimal disk of this simulation is presented in Figures 9 & 10.\n\nthat despite a transient period of instability and gas giant/ice giant scattering, the (3:2 3:2 4:3)2 and the (5:3\n4:3 4:3) initial conditions did not reproduce the secular\narchitecture of the planets, in neither this set nor in the\nset of integrations of Batygin & Brown (2010). If Jupiter\nand Saturn were indeed initially locked in the 3:2 MMR,\nas hydrodynamic simulations suggest (Masset & Snellgrove 2001; Morbidelli & Crida 2007; Pierens & Nelson\n2008), only the (3:2 3:2 5:4) and (3:2 4:3 4:3) initial conditions are left as a viable options for the starting state\nof the solar system.\nAs already discussed in section 2, interactions between\nthe cold outer disk and the outer-most ice-giant are\nlargely independent of the starting condition, since scattering in a successful simulation always sets the planets\nonto orbits that are close to that of the current solar\nsystem, but with moderate eccentricities. Consequently,\nwe did not restrict our analysis to any particular initial\ncondition. Out of our set of 180 integrations, in 8 cases,\nprimordially cold objects were able to retain unexcited\norbits in addition to the gas-giant eigenmodes being reproduced correctly. Here, we focus on two representative\nintegrations: one starting from the (2:1 4:3 4:3) initial\ncondition (Figure 5) and another starting from the (5:3\n4:3 3:2) initial condition (Figure 6). In both cases, the\ncold classical population is produced, but the wedge is\nonly formed in the simulation that starts from the (2:1\n4:3 4:3) initial condition (although it is somewhat smaller\nthan its observed counterpart). Note, that the formation\nof the wedge has little to do with the initial condition rather, its production is a random process. Similarly, the\nexact degree of excitation of the cold population's inclinations is sensitively dependent on the details of Neptune's evolution, which is chaotic. Thus, the fact that\nthe wedge is reproduced in one simulation and the degree\nof excitation of the inclinations is reproduced in another\nare unrelated results.\n2 In our notation, each pair of numbers represents an MMR in\nthe multi-resonant initial condition. For example, (3:2 3:2 4:3)\ncorresponds to a starting state where Jupiter & Saturn, as well as\nSaturn & Uranus are in 3:2 MMRs, while Uranus & Neptune are\nin a 4:3 MMR.\n\n\f6\n\nBatygin Brown Fraser\n\nFig. 7.- Eccentricity distibution of the remnant planetesimal\ndisk of the simulation that starts from the (2:1 4:3 4:3) multiresonant state (see Figure 5). The pale blue dots show objects\nthat originated interior to ∼ 35AU, 30Myr after the beginning of\nthe simulation. The dark blue dots represent objects that originated interior to 35AU, but are stable over 500Myr. Green dots\nrepresent the test-particles that originate between 40 & 60 AU.\nYellow triangles represent test particles that originated between 35\nand 40 AU. A wedge that is somewhat similar to the observed one\n(see Figure 1) forms in this simulation, as a result of a temporary\nslow-down in Neptune's precession rate (see Figure 11). Note that\nin this simulation, the classical Kuiper belt region lies between ∼ 37\nand ∼ 45AU, as Neptune's final semi-major axis is a ∼ 28.3AU.\nHowever, the aim here is to elucidate the physical mechanisms,\nrather than reproduce the actual Kuiper belt. The shaded region\ncorresponds to the scattered disk.\n\nA vast majority (> 90%) of the objects in the cold\nclassical region (i.e. a & 42AU) are retained in our simulations on stable orbits. On the contrary, only about a\nfew thousandth of the particles in the inner disk are emplaced onto stable orbits in the Kuiper belt region. This\nimplies that in order to self-consistently study the formation of the Kuiper belt, N \u001d 3000 is needed. Unfortunately, the required resolution is not computationally\nfeasible. However, the problem can still be addressed by\nthe use of \"tracer\" simulations, an approach already utilized in the context of Kuiper belt formation by Levison\net al. (2008).\nIn a tracer simulation the planets and planetesimals\nare not self-consistently evolved in time. Rather, the\nevolution of the planets is pre-loaded from a master simulation and the planetesimals, which are treated as test\nparticles, are evolved subject only to gravitational interactions with the planets. At the beginning of a tracer\nsimulation, the tracer disk is initialized to have the same\ndistribution as the massive component of the planetesimal disk. Consequently, at all times during the integration, the tracer particles also have an identical orbital\ndistribution to that of the massive planetesimals. Each\nsimulation was seeded with 100 test particles and integrated on Caltech's PANGU super-computer. We employed the Bulirsch-Stoer algorithm (Press et al. 1992)\nin our tracer integrations.\nWe performed 200 tracer simulations for each of the\nevolutions presented in Figures 5 & 6. This amounts to\nevolving a primordial disk of ∼ 26000 particles, including\nthe outer belt. After the ∼ 30 Myr simulations were completed, approximately ∼ 7% of the particles that originated interior to 35AU had semi-major axes in the range\n35AU < a < 60AU, shown as pale blue dots in Figures 7 -\n\nFig. 8.- Inclination distribution of the remnant planetesimal\ndisk of the simulation that starts from the (2:1 4:3 4:3) multiresonant state (see Figure 5). The pale blue dots show objects\nthat originated interior to ∼ 35AU, 30Myr after the beginning of\nthe simulation. The dark blue dots represent objects that originated interior to 35AU, but are stable over 500Myr. Green dots\nrepresent the test-particles that originate between 40 & 60 AU.\nYellow triangles represent test particles that originated between 35\nand 40 AU.\n\n10. We further cloned the populations3 of tracer particles\nin the Kuiper belt region to effectively increase the number of implanted hot classical, scattered, and resonant\nparticles by another factor of 6. The resulting Kuiper\nBelt, including the test-particles that originate beyond\n35AU, was then evolved for an additional 500 Myr to ensure that all unstable particles have time eject. At the\nend of the 500Myr, only ∼ 5% of the implanted objects,\nthat were present at the end of the 30Myr simulations,\nended up on stable orbits. Consequently, the cumulative\nfraction of objects that are implanted into the Kuiper\nbelt from the inner disk is ∼ 0.3%. The stable objects\nare shown as dark blue dots in Figures 7 - 10.\nNote that in our simulations, the resonant populations\nare considerably diminished in number. This is largely a\ncost of performing self-consistent simulations with planetesimals that are unrealistically massive. Every time\nNeptune scatters a KBO, its resonances jump unrealistically far, disturbing the resonant KBOs, leading to their\neventual ejection (Murray-Clay & Chiang 2006). In a\nsuite of customized simulations where the instability still\noccurs, but planets are analytically guided to their final\norbits, and gravity is softened (Levison et al. 2008), Neptune's MMR's end up overpopulated. This leads one to\nbelieve that the true parameter regime of Neptune's migration resided somewhere between what is presented in\nthis work and that of Levison et al. (2008) (Morbidelli,\npersonal communication).\nAlthough both of the integrations presented here produce a cold classical belt, it is immediately apparent that\nthe wedge is only produced in the integration that starts\nfrom the (2:1 4:3 4:3) initial condition, although again\nthe process has little do with the choice of initial condition. Furthermore, from Figure 7, it can be readily\ninferred that the production of the wedge must be a secular effect since the structure in this simulation extends\nbeyond the 2:1 MMR, i.e. the unswept region. Note\n3 At the end of the simulations, there was only statistically significant structure in the a, e.i distributions. The orbital angles took\non random values during scattering.\n\n\fCold Classical KBOs are Primordial\n\nFig. 9.- Eccentricity distribution of the planetesimal disk of the\nsimulation that starts from the (5:3 4:3 3:2) multi-resonant state\n(see Figure 5). The pale blue dots show objects that originated interior to ∼ 35AU, 30Myr after the beginning of the simulation. The\ndark blue dots represent objects that originated interior to 35AU,\nbut are stable over 500Myr. Green dots represent the test-particles\nthat originate between 40 & 60 AU. Yellow triangles represent test\nparticles that originated between 35 and 40 AU. Note that the\nwedge does not form in this simulation, because Neptune's precession never slows down, while it is eccentric. Note that in this\nsimulation, the classical Kuiper belt region lies between ∼ 38 and\n∼ 46AU, as Neptune's final semi-major axis is a ∼ 29AU. However,\nthe aim here is to elucidate the physical mechanisms, rather than\nreproduce the actual Kuiper belt. The shaded region corresponds\nto the scattered disk.\n\nthat owing to the enhanced free precession of the KBOs\n(due to presence of a massive Kuiper belt), the wedge\nstructure is shifted to the right, compared with analytical estimates presented in the previous section.\nIn the context of these integrations, we are further able\nto confirm that the formation of the wedge is due to a\nconsiderable slowdown in Neptune's precession. During\ncircularization in the integration that starts from a (5:3\n4:3 3:2) initial condition, Neptune precession is always\nroughly g ≈ 4.7g8 , while it is eccentric. On the contrary,\nin the integration that starts from the (2:1 4:3 4:3) initial\ncondition, Neptune's precession rate varies considerably\n(1.6g8 . g . 3.7g8 ) between 23Myr and 25Myr (Figure 11). The presence of a mechanism for the successful\nformation of the wedge, from a local population is an\nimportant argument for confirmation of the in-situ formation of the cold classical population in the context of\nan instability model.\nIt is noteworthy that in the results of the simulation,\nthe wedge appears much less coherent, at semi-major\naxes interior to the 2:1 MMR. This is a consequence of eccentric resonant sweeping. Because of Neptune's considerable eccentricity, the KBO multiplet and the Neptune\nmultiplet of the resonance overlap even for small KBO\neccentricities. This allows the KBO to randomly explore\nthe phase-space occupied by both sections of the resonance. However, as Neptune's eccentricity is monotonically decreasing, so is the phase space volume occupied\nby Neptune's multiplet of the 2:1 MMR, making capture\nimpossible (Quillen 2006). Moreover, because of different precession rates, the nominal location of Neptune's\nmultiplet of the resonance lags (i.e smaller semi-major\naxis) that of the KBO. Thus, if a KBO exits the resonance shortly after it enters, it tends to get transported\ncloser to the sun, since it enters at the KBO multiplet\nand exits at the Neptune multiplet. The change in semi-\n\n7\n\nFig. 10.- Inclination distribution of the planetesimal disk of the\nsimulation that starts from the (5:3 4:3 3:2) multi-resonant state\n(see Figure 5). The pale blue dots show objects that originated interior to ∼ 35AU, 30Myr after the beginning of the simulation. The\ndark blue dots represent objects that originated interior to 35AU,\nbut are stable over 500Myr. Green dots represent the test-particles\nthat originate between 40 & 60 AU. Yellow triangles represent test\nparticles that originated between 35 and 40 AU.\n\nmajor axes, however is only the resonant splitting width,\nso it is rather small ( δa < 0.1AU). This randomization\nof the orbital elements causes the inner part of the wedge\nto appear less coherent in Figure 7.\nIt is finally worth noting that although KBOs that become the cold classical population are able to roughly retain their primordial orbital distribution, the objects between 35AU and 40AU inevitably get scattered by Neptune during the instability. Indeed, in both simulations\npresented here, the scattered cold classicals (shown as\nyellow triangles in Figures 7-10) join the scattered disk\nas well as the hot classical population, while some particles get trapped in resonances temporarily, during their\nevolution.\nThe fact that these lifted objects mostly get emplaced\nonto stable orbits is suggestive that the results of intrusion of inclined populations by cold-classical like objects,\nthat took place during the instability, should still be observable today. In other words, the in-situ formation\nscenario for cold-classicals presented here predicts that\nthat a class of objects, occupying the same unique color\nregion as the cold classicals, should be present in the\nexcited populations.\n4. DISCUSSION\n\nIn this paper, we present a self-consistent dynamical model for the evolution of a primordial cold classical population of the Kuiper belt, in the context of an\ninstability-driven formation scenario for the solar system.\nWe show, from simple analytical considerations, that the\ncold belt can survive the transient period of dynamical\ninstability, inherent to the planets. In order for a primordially cold population of KBOs to maintain an unexcited state, the average apsidal precession and nodal\nrecession rates of Neptune during the transient phase of\ninstability must have been considerably faster than what\nis observed in today's solar system. Simultaneously, successful formation of the wedge (see Figure 1) requires\nthat the apsidal precession rate drops by a factor of a\nfew for a short period of time. Numerical integrations\npresented in this work confirm the results of the analyti-\n\n\f8\n\nBatygin Brown Fraser\n\nFig. 11.- Precession of Neptune's longitude of perihelion in the\nsimulation that originates from the (2:1 4:3 4:3) multi-resonant initial condition (see Figure 5). Most of the time, Neptune's precession rate exceeds its current value by a factor of a few. However,\nthe precession rate slows down considerably at t ≈ 22Myr. The\nwedge forms as a result of the highlighted slowdown in Neptune's\napsidal precession.\n\ncal calculations and reveal a particular result, where the\nformed cold population and the wedge closely resemble\ntheir observed counter-parts. The dynamical evolution of\ncold classicals we propose here is in close agreement with\nthe uniqueness of cold classical's physical characteristics.\nIn situ formation of cold classicals brings to light the issue of truncation of the classical belt near the 2:1 MMR.\nIn the chaotic capture mechanism proposed by Levison\net al. (2008), the outer edge comes about naturally, as\nthe 2:1 MMR sculpts the belt. In our solution, however,\na cold belt that extends further out is surely possible.\nThus, we are forced to attribute the proximity of the\nedge and the 2:1 MMR to a mere coincidence. Another\nquestion of interest is the fate of primordially cold binaries in the 35 − 40AU region. It is likely that many\nof these binaries will get disrupted by close-encounters\nwith Neptune, although the exact fraction will depend\non the details of Neptune's evolution. Consequently, an\nin-depth analysis of the evolution of the scattered cold\nKBOs may open up an avenue towards further constraining the orbital history of Neptune.\nAlthough in-situ formation of cold classicals resolves\na pressing dynamical problem within the Nice model, it\ngives rise to a new issue that requires attention. Namely,\nthe outstanding question of importance is planetesimal\nformation beyond ∼ 35AU, given the steep size distribution of the cold classicals. In other words, how is the\nformation of planetesimals, up to ∼ 200 km in size accomplished in such a low-density environment?\nAlthough the answer to this question is by no means\ntrivial, one possible solution to this problem lies within\nthe context of streaming instabilities (Youdin & Goodman 2005). Streaming instabilities have already been\nsuggested as the dominant formation process in the cold\nclassical population, as gravitational collapse has been\nshown to yield wide binaries (Nesvorný et al. 2010). Importantly, in the proposed picture, planetesimal formation is a threshold process, that \"turns on,\" only when\n\ngas drag accumulates a critical amount of dust in a given\nlocation within the solar nebula. Thus, one can in principle envision a system where most of the dust gets carried\ninward of ∼ 35AU by gas drag, but infrequently, the dust\nsurface density reaches a critical value in the outer nebula, causing a few, but sizable planetesimals to be born.\nSuch a scenario would likely result in a very sharply decreasing surface density profile in the outer nebula, at\nthe epoch of disappearance of the gas. As a result, this\npicture would imply the existence of a steep density gradient in the primordial planetesimal disk, such as the\none we require in our model, consistent with preventing\nNeptune's extended migration.\nAnother possibility for the formation process is hierarchical coagulation, where planetesimal growth is accomplished by collisions among smaller objects in a quiescent\nenvironment (Kenyon 2002). Particularly, it has been\nsuggested that if aided by turbulent concentration, hierarchical coagulation could yield the desired mass of the\ncold classical population (Cuzzi et al. 2010). In fact, even\nif the original mass of the cold belt exceeded its current\nvalue, erosion by collisional grinding could in principle be\ninvoked to reduce the overall mass. However this process\nmay prove problematic in reproducing the observed wide\nbinary fraction of the cold belt (Nesvorny et al. 2011).\nWhatever the formation process for the cold classicals\nis, the results presented here have considerable implications. First and foremost, the successful retention of the\ncold-classical population in the context of an instabilitydriven model, fixes the most significant drawback of the\nNice model. Second, our scenario suggests that the cold\nclassical Kuiper belt is the only population of objects\nin the outer solar system that has not been transported\naway from its formation site. Furthermore, assuming\nthat collisional grinding has played a negligible role in\nthe cold population's evolution (as suggested by the observed binary fraction (Nesvorny et al. 2011)), the cold\nclassical population essentially yields the surface density\nof the solar nebula at a ∼ 45AU, since the majority of\nthe KBOs are retained in place. This potentially makes\nthe cold classicals a unique laboratory for the study of\nsurface processes as well as the chemistry of the primordial solar nebula. Third, based upon the results of the\nnumerical simulations, we expect that objects that are\nphysically similar to the cold classicals should be scattered throughout the Kuiper belt and as a result may\nexplain the spectral similarity between cold classicals and\nsome objects at higher inclinations.\nIn conclusion, it appears that quantitative evaluation\nof planetesimal formation beyond ∼ 35AU is required to\ndraw a complete picture of the of the in-situ formation\nand evolution scenario for the cold classicals. However,\nthe considerable improvement of the model for early\ndynamical evolution of the Kuiper belt presented here\nsupports the overall validity of the hypothesis.\nAcknowledgments We thank Alessandro Morbidelli,\nHal Levison, Darin Ragozzine and Peter Goldreich for\nuseful conversations.\n\nREFERENCES\nBatygin, K., & Brown, M. E. 2010, ApJ, 716, 1323\n\nBrasser, R., Morbidelli, A., Gomes, R., Tsiganis, K., & Levison,\nH. F. 2009, A&A, 507, 1053\n\n\fCold Classical KBOs are Primordial\nBrown, M. E. 2001, Icarus, 151, 190\nChambers, J. E. 1999, MNRAS, 304, 793\nCuzzi, J. N., Hogan, R. C., & Bottke, W. F. 2010, icarus, 208, 518\nFernandez, J. A., & Ip, W.-H. 1984, Icarus, 58, 109\nFraser, W. C., Brown, M. E., & Schwamb, M. E. 2010, Icarus,\n210, 944\nHahn, J. M., & Malhotra, R. 2005, AJ, 130, 2392\nHenrard, J., & Lamaitre, A. 1983, Celestial Mechanics, 30, 197\nLevison, H. F., Morbidelli, A., Vanlaerhoven, C., Gomes, R., &\nTsiganis, K. 2008, Icarus, 196, 258\nJewitt, D., & Luu, J. 1993, Nature, 362, 730\nMorbidelli, A., Levison, H. F., & Gomes, R. 2008, The Solar\nSystem Beyond Neptune, 275\nMorbidelli, A., & Crida, A. 2007, Icarus, 191, 158\nMorbidelli, A., Tsiganis, K., Crida, A., Levison, H. F., & Gomes,\nR. 2007, AJ, 134, 1790\nMurray-Clay, R. A., & Chiang, E. I. 2006, ApJ, 651, 1194\nGomes, R., Levison, H. F., Tsiganis, K., & Morbidelli, A. 2005,\nNature, 435, 466\nGladman, B., Marsden, B. G., & Vanlaerhoven, C. 2008, The\nSolar System Beyond Neptune, 43\nKenyon, S. J. 2002, PASP, 114, 265\nKetchum, J. A., Adams, F. C., & Bloch, A. M. 2011, ApJ, 726, 53\nLykawka, P. S., & Mukai, T. 2005, Earth Moon and Planets, 97,\n107\nMorbidelli, A., Levison, H. F., Tsiganis, K., & Gomes, R. 2005,\nNature, 435, 462\nMorbidelli, A., & Brown, M. E. 2004, Comets II, 175\n\n9\n\nMorbidelli, A., Brasser, R., Tsiganis, K., Gomes, R., & Levison,\nH. F. 2009, A&A, 507, 1041\nMurray-Clay, R. A., & Chiang, E. I. 2005, ApJ, 619, 623\nMasset, F., & Snellgrove, M. 2001, MNRAS, 320, L55\nMurray, C. D., & Dermott, S. F. 1999, Solar system dynamics by\nMurray, C. D., 1999\nNesvorný, D., Youdin, A. N., & Richardson, D. C. 2010, AJ, 140,\n785\nNesvorny, D., Vokrouhlicky, D., Bottke, W. F., Noll, K., &\nLevison, H. F. 2011, arXiv:1102.5706\nPierens, A., & Nelson, R. P. 2008, A&A, 482, 333\nParker, A. H., & Kavelaars, J. J. 2010, ApJ, 722, L204\nThommes, E. W., Bryden, G., Wu, Y., & Rasio, F. A. 2008, ApJ,\n675, 1538\nTsiganis, K., Gomes, R., Morbidelli, A., & Levison, H. F. 2005,\nNature, 435, 459\nTrujillo, C. A., & Brown, M. E. 2002, ApJ, 566, L125\nMalhotra, R. 1995, AJ, 110, 420\nPress, W. H., Teukolsky, S. A., Vetterling, W. T., & Flannery,\nB. P. 1992, Cambridge: University Press, c1992, 2nd ed.,\nStephens, D. C., & Noll, K. S. 2006, AJ, 131, 1142\nStewart, G. R., & Wetherill, G. W. 1988, Icarus, 74, 542\nQuillen, A. C. 2006, MNRAS, 372, L14\nWisdom, J. 1980, AJ, 85, 1122\nWu, Y., & Goldreich, P. 2002, ApJ, 564, 1024\nYoudin, A. N., & Goodman, J. 2005, ApJ, 620, 459\n\n\f"}