{"id": "http://arxiv.org/abs/0812.3184v2", "guidislink": true, "updated": "2009-04-01T19:41:03Z", "updated_parsed": [2009, 4, 1, 19, 41, 3, 2, 91, 0], "published": "2008-12-17T00:15:22Z", "published_parsed": [2008, 12, 17, 0, 15, 22, 2, 352, 0], "title": "Origin of intrinsic Gilbert damping", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0812.0909%2C0812.2732%2C0812.4558%2C0812.1946%2C0812.3181%2C0812.0889%2C0812.2991%2C0812.1459%2C0812.4583%2C0812.3724%2C0812.3184%2C0812.4524%2C0812.2677%2C0812.1258%2C0812.2955%2C0812.0573%2C0812.4330%2C0812.0471%2C0812.2141%2C0812.3552%2C0812.0904%2C0812.5114%2C0812.1305%2C0812.2934%2C0812.2807%2C0812.1864%2C0812.1863%2C0812.3785%2C0812.2836%2C0812.4168%2C0812.1055%2C0812.3633%2C0812.3559%2C0812.0895%2C0812.4035%2C0812.1810%2C0812.3682%2C0812.3768%2C0812.2938%2C0812.2518%2C0812.0043%2C0812.2987%2C0812.1686%2C0812.0655%2C0812.1556%2C0812.1993%2C0812.1576%2C0812.1794%2C0812.1052%2C0812.1492%2C0812.1072%2C0812.2331%2C0812.1645%2C0812.1360%2C0812.1788%2C0812.3598%2C0812.0472%2C0812.1732%2C0812.4854%2C0812.0021%2C0812.4414%2C0812.4184%2C0812.3130%2C0812.2229%2C0812.3303%2C0812.4894%2C0812.1707%2C0812.4571%2C0812.1870%2C0812.0459%2C0812.0746%2C0812.4078%2C0812.0679%2C0812.1892%2C0812.2994%2C0812.1841%2C0812.2823%2C0812.1605%2C0812.1581%2C0812.4944%2C0812.1823%2C0812.2261%2C0812.0577%2C0812.2606%2C0812.2793%2C0812.1891%2C0812.2115%2C0812.4727%2C0812.0683%2C0812.0149%2C0812.1093%2C0812.0638%2C0812.0126%2C0812.3760%2C0812.3228%2C0812.4109%2C0812.1184%2C0812.4952%2C0812.2016%2C0812.0740%2C0812.2178&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Origin of intrinsic Gilbert damping"}, "summary": "The damping of magnetization, represented by the rate at which it relaxes to\nequilibrium, is successfully modeled as a phenomenological extension in the\nLandau-Lifschitz-Gilbert equation. This is the damping torque term known as\nGilbert damping and its direction is given by the vector product of the\nmagnetization and its time derivative. Here we derive the Gilbert term from\nfirst principles by a non-relativistic expansion of the Dirac equation. We find\nthat the Gilbert term arises when one calculates the time evolution of the spin\nobservable in the presence of the full spin-orbital coupling terms, while\nrecognizing the relationship between the curl of the electric field and the\ntime varying magnetic induction.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0812.0909%2C0812.2732%2C0812.4558%2C0812.1946%2C0812.3181%2C0812.0889%2C0812.2991%2C0812.1459%2C0812.4583%2C0812.3724%2C0812.3184%2C0812.4524%2C0812.2677%2C0812.1258%2C0812.2955%2C0812.0573%2C0812.4330%2C0812.0471%2C0812.2141%2C0812.3552%2C0812.0904%2C0812.5114%2C0812.1305%2C0812.2934%2C0812.2807%2C0812.1864%2C0812.1863%2C0812.3785%2C0812.2836%2C0812.4168%2C0812.1055%2C0812.3633%2C0812.3559%2C0812.0895%2C0812.4035%2C0812.1810%2C0812.3682%2C0812.3768%2C0812.2938%2C0812.2518%2C0812.0043%2C0812.2987%2C0812.1686%2C0812.0655%2C0812.1556%2C0812.1993%2C0812.1576%2C0812.1794%2C0812.1052%2C0812.1492%2C0812.1072%2C0812.2331%2C0812.1645%2C0812.1360%2C0812.1788%2C0812.3598%2C0812.0472%2C0812.1732%2C0812.4854%2C0812.0021%2C0812.4414%2C0812.4184%2C0812.3130%2C0812.2229%2C0812.3303%2C0812.4894%2C0812.1707%2C0812.4571%2C0812.1870%2C0812.0459%2C0812.0746%2C0812.4078%2C0812.0679%2C0812.1892%2C0812.2994%2C0812.1841%2C0812.2823%2C0812.1605%2C0812.1581%2C0812.4944%2C0812.1823%2C0812.2261%2C0812.0577%2C0812.2606%2C0812.2793%2C0812.1891%2C0812.2115%2C0812.4727%2C0812.0683%2C0812.0149%2C0812.1093%2C0812.0638%2C0812.0126%2C0812.3760%2C0812.3228%2C0812.4109%2C0812.1184%2C0812.4952%2C0812.2016%2C0812.0740%2C0812.2178&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The damping of magnetization, represented by the rate at which it relaxes to\nequilibrium, is successfully modeled as a phenomenological extension in the\nLandau-Lifschitz-Gilbert equation. This is the damping torque term known as\nGilbert damping and its direction is given by the vector product of the\nmagnetization and its time derivative. Here we derive the Gilbert term from\nfirst principles by a non-relativistic expansion of the Dirac equation. We find\nthat the Gilbert term arises when one calculates the time evolution of the spin\nobservable in the presence of the full spin-orbital coupling terms, while\nrecognizing the relationship between the curl of the electric field and the\ntime varying magnetic induction."}, "authors": ["M. C. Hickey", "J. S. Moodera"], "author_detail": {"name": "J. S. Moodera"}, "author": "J. S. Moodera", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevLett.102.137601", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0812.3184v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0812.3184v2", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "5 pages, 1 figures", "arxiv_primary_category": {"term": "cond-mat.other", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.other", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "cond-mat.stat-mech", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0812.3184v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0812.3184v2", "journal_reference": "Phys. Rev. Lett. 102, 137601 (2009)", "doi": "10.1103/PhysRevLett.102.137601", "fulltext": "Origin of Intrinsic Gilbert Damping\nM. C. Hickey∗ and J. S. Moodera\n\narXiv:0812.3184v2 [cond-mat.other] 1 Apr 2009\n\nFrancis Bitter Magnet Laboratory, Massachusetts Institute of Technology,\n150 Albany Street, Cambridge, Massachusetts 02139 USA.\nThe damping of magnetization, represented by the rate at which it relaxes to equilibrium, is\nsuccessfully modeled as a phenomenological extension in the Landau-Lifschitz-Gilbert equation.\nThis is the damping torque term known as Gilbert damping and its direction is given by the vector\nproduct of the magnetization and its time derivative. Here we derive the Gilbert term from first\nprinciples by a non-relativistic expansion of the Dirac equation. We find that this term arises when\none calculates the time evolution of the spin observable in the presence of the full spin-orbital\ncoupling terms, while recognizing the relationship between the curl of the electric field and the time\nvarying magnetic induction.\nPACS numbers: 76.20.-m, 75.30.-m and 75.45.+j\n\nThe Gilbert damping torque in magnetic systems describes the relaxation of magnetization and it was introduced into the Laudau-Lifschitz equation [1, 2] for describing spin dynamics. Gilbert damping is understood\nto be a non-linear spin relaxation phenomenon and it controls the rate at which magnetization spins reach equilibrium. The introduction of this term is phenomenological\nin nature [3] and the question of whether it has an intrinsic physical origin has not been fully addressed, in\nthe face of rather successful modeling of the relaxation\ndynamics of measured systems. Correlating ferromagnetic resonance spectral line-widths [4, 5] in magnetic\nthin films with the change in damping has been successful for confirming the form of the damping term in the\nunderlying dynamical equations. The intrinsic origin of\nthe damping itself is still an open question. The damping\nconstant, α is often reformulated in terms of a relaxation\ntime, and the dominant relaxation processes are invoked\nto calculate this, but this approach presupposes precessional damping torque.\nIt has been long thought that intrinsic Gilbert damping had its origin in spin-orbital coupling because this\nmechanism does not conserve spin, but it has never been\nderived from a coherent framework. Non-local spin relaxation processes [6] and disorder broadening couple to\nthe spin dynamics and can enhance the Gilbert damping extrinsically in thin films and heterostructures. This\ntype of spin relaxation, which is equivalent to ensemble\ndephasing [7], is modeled as the (S-S0 )/T∗2 decay term\nin the dynamical Bloch equation, where T∗2 is the decay\ntime of the ensemble of spins. Crudely speaking, during\nspin relaxation, some spins lag behind the mean magnetization vector and the exchange and magnetostatic\nfields then exert a time dependent torque. Calculations\non relaxation driven damping of this kind presuppose the\nGilbert damping term itself which begs the question.\nThe inhomogeneous damping term can be written as\nM × d∇2 M/dt which gives rise to non-local effects such\n\n∗ Electronic\n\nmail : hickey@mit.edu\n\nas spin wave dissipation [6, 8]. These non-local theories are successful in quantifying the enhancement of the\nGilbert damping, but do not derive the intrinsic Gilbert\nterm itself. There are models [9, 10] which deal with\nthe scattering of electron spins from thermal equilibrium\nin the presence of phonon and spin-orbital interactions\nwhich is a dynamic interaction and this allows us to determine the strength of the Gilbert damping for itinerant ferromagnetic metals, generalizing the Gilbert damping response to a tensorial description. Both the s-d\nexchange relaxation models [11, 12] and the Fermi surface breathing models of Kambersky [9, 13] either presuppose a Gilbert damping term in the dynamical equation or specify a phenomenological Hamiltonian H = 1/(γMs )α̂.dM/dt. While this method is ab initio from\nthe point of view of electronic structure, it already assumes the Gilbert term ansatz. Hankiewicz et al. [14]\nconstruct the inhomogeneous Gilbert damping by connecting the spin density-spin current conservation law\nwith the imaginary part of magnetic susceptibility tensor and show that both electron-electron and impurity\nscattering can enhance the damping through the transverse spin conductivity for finite wavelength excitations\n(q 6= 0). In previous work [15], there are derivations\nof the Gilbert constant by comparing the macroscopic\ndamping term with the torque-torque correlations in homogeneously magnetized electron gases possessing spin\norbital coupling. For the case of intrinsic, homogeneous\nGilbert damping, it is thought that in the absence of\nspin-orbital scattering, the damping vanishes. We aim to\nfocus on intrinsic, homogeneous damping and its physical\norigin in a first-principles framework and the question as\nto whether spin in a homogeneous time-varying magnetization can undergo Gilbert damping is addressed.\nIn this work, we show that Gilbert damping does indeed\narise from spin-orbital coupling, in the sense that it is\ndue to relativistic corrections to the Hamiltonian which\ncouple the spin to the electric field and we arrive at the\nGilbert damping term by first writing down the Dirac\nequation for electrons in magnetic and electric potentials.\nWe transform the Hamiltonian in such a way as to write\nit in a basis in which the canonical momentum terms are\n\n\f2\neven powers. This is a standard approach in relativistic\nquantum mechanics and we do this in order to calculate\nthe terms which couple the linear momentum to the spin\nin a basis which is diagonal in spin space. This is often\nreferred to as a non-relativistic expansion of the Dirac\nequation. This allows us to formulate the contributions\nas a perturbation to an otherwise non-relativistic particle. We then wish to calculate the rate equation for the\nspin observable with all of the spin-orbital corrections in\nmind.\nNow, we start with a purely relativistic particle, a Dirac\nparticle and we write the Dirac-Pauli Hamiltonian, as\nfollows :\nA\n) + βm0 c2 + eφ\nc\n= O + βm0 c2 + ε\n\nH = cα.(p − e\n\n(1)\n(2)\n\nwhere A and φ are the magnetic vector potential and the\nelectrostatic potential, respectively and\n\u0012\n\u0013\n0 σi\nα=\nσi 0\nwhile\n\u0012\nβ=\n\n1 0\n0 −1\n\n\u0013\n.\n\nWe observe immediately that βO = −Oβ. O is the Dirac\ncanonical momentum , c and e are the speed of light in\na vacuum and the electronic charge, respectively.\nWe now need to rewrite the Hamiltonian in a basis where\nthe odd operators (whose generators are off diagonal in\nthe Pauli-Dirac basis : αi , γ i ,γ5 ..) and even operators\n(whose generators are diagonal in the Pauli-Dirac basis :\n(1, β, Σ,.. ) are decoupled from one another.\n0\nIf we are to find S so that H does not contain odd powers\nof spin operators, we must chose the operator S, in such\na way as to satisfy the following constraint :\n[S, β] =\n\n−O\nim0 c2\n\n(3)\n\nIn order to satisfy cancelation of the odd terms of O\n−iOβ\nto first order, we require S = 2m\n2 and this is known\n0c\nas the Foldy-Wouthuysen transformation in relativistic\nquantum mechanics and it is treated in some detail in,\nfor example, reference [16]. We now would like to collect\nall of the terms into the transformed Hamiltonian, and\nthis is written as\n\u0012\n\u0013\n0\nO2\nO4\nH = β m0 c2 +\n−\n2m0 c2\n8m30 c6\n1\nβ\nO3\n+ε −\n[O, [O, ε]] +\n[O, ε] −\n2\n4\n2\n8m0 c\n2m0 c\n3m20 c4\nThe expression above contains odd powers of the canonical momentum O, so we redefine the canonical momentum to encapsulate all of these odd power terms. So we\n\nnow apply the procedure of eliminating odd powers once\nagain :\n\u0012\n\u0013\n0\n0\n−iβ\nβ\nO3\niβ\nO =\n[O, ε] −\nS =−\n2m0 c2\n2m0 c2 2m0 c2\n3m20 c4\n(4)\n00\n\n0\n\n0\n\n0\n\n0\n\n00\n\nH = eiS H e−iS = βm0 c2 + ε + O ,\n\n(5)\n\n00\n\nwhere O is now O( m21c4 ), which can be further elimi0\n\n00\n\nnated by applying a third transformation (S =\nwe arrive at the following Hamiltonian :\n\u0011\n00\n00 \u0010\n000\n00\n0\nH = eiS H e−iS = βm0 c2 + ε\n\u0012\n\u0013\nO2\nO4\n2\n= β m0 c +\n+\n−\n2m0 c2\n8m30 c6\n1\nε−\n[O, [O, ε]]\n8m20 c4\n\n00\n\n−iβO\n2m0 c4\n\n),\n\nThus we have the fully Foldy-Wouthuysen transformed\nHamiltonian :\n\u0013\n\u0012\n000\n(p − eA/c)2\np4\n2\n+ eΦ\nH = β m0 c +\n−\n2m0\n8m30 c6\ne~\nie~2\n−\nβΣ.B\n−\nΣ.(∇ × E)\n2m0 c2\n8m20 c2\ne~\ne~2\n−\nΣ.E × p −\n(∇.E)\n2\n2\n4m0 c\n8m20 c2\nThe terms which are present in the above Hamiltonian,\nshow us that we have a p4 kinetic part which is the relativistic expansion of the mass of the particle. The terms\nwhich couple to the spin Σ are of importance and we see\nthat these terms correspond to the Zeeman, spin-orbital\n(comprising momentum and electric field curl terms) and\nthe Darwin term, respectively. Strictly speaking, the\npresence of the scalar potential φ breaks the gauge invariance in the Pauli-Dirac Hamiltonian and a fully gauge invariant theory would require that this contain the gaugefree electromagnetic field energy. We omit the term\ne2 ~\n4m2 c3 Σ.(A × E) (which establishes gauge invariance in\nthe momentum terms) in this rotated Hamiltonian, as it\nis O(1/m2 c3 ) and we are only interested in calculating\nsemiclassical rate equations for fields, which are manifestly gauge-invariant, and not wavefunctions or energy\neigenvalues. We can now define the spin dependent corrections to a non-relativistic Hamiltonian :\n\nHΣ = −\n\ne~\ne~\nie~2\nβΣ.B−\nΣ.E×p−\nΣ.(∇×E).\n2m0 c2\n4m20 c2\n8m20 c2\n(6)\n\nwhere\n\u0012\nΣ=\n\nσi 0\n0 σi\n\n\u0013\n≡ Ŝi .\n\n\f3\nand σi are the Pauli matrices. Note that the last\ntwo terms in Equation 6 encapsulate the entire spin\norbital coupling in the sense that these terms couple\nthe particle's linear momentum to the spin Ŝi . The\nfirst spin-orbital term in the Hamiltonian is well known\nand give rise to momentum dependent magnetic fields.\nWhen the ensuing dynamics are calculated for this\ncase, it gives rise to spin relaxation terms which are\nlinear in spin [17]. Note that, while neither spin-orbital\nterm is Hermitian, the two terms taken together are\nHermitian and so the particles angular momentum\nis a conserved quantity and the total energy lost in\ngoing from collective spin excitations (spin waves) to\nsingle particles states via spin-orbital coupling is gained\nby the electromagnetic field. Recognizing the curl of\nthe electric field in the last term, we now rewrite this\nthe time varying magnetic field as given by Maxwells\nequations as ∇ × E = − ∂B\n∂t . We now have an explicitly\ntime-dependent perturbation on the non-relativistic\nHamiltonian. We can write the time-varying magnetic\nfield seen by the spin (in, for example a magnetic\n∂B\n∂M\n−1 ∂M\nmaterial) as ∂B\n∂t = ∂M * ∂t = μ0 (1 + χm ) ∂t . We now\nhave the spin dependent Hamiltonian :\n\nHS = −\n\ne~\ne~\nβS.B −\nS.E × p\n2\n2m0 c\n4m20 c2\n\u0001 dM\ne~2 μ0\n=\n+i 2 2 S. 1 + χ−1\nm .\n8m0 c\ndt\nH S = H0S + H S (t).\n\nWe focus our attention on the explicitly time-dependent\npart of the Hamiltonian HS (t) ;\nH S (t) = i\n\n\u0001 dM\ne~2 μ0\nS. 1 + χ−1\n.\nm .\n2\n2\n8m0 c\ndt\n\n(7)\n\nIn this perturbation scheme, we allow the Hermitian\ncomponents of the Hamiltonian to define the ground sate\nof the system and we treat the explicitly time-dependent\nHamiltonian (containing the spin orbital terms) as a time\ndependent perturbation. In this way, the rate equation is\nestablished from a time dependent perturbation expansion in the quantum Liouville description.\nnow define\nX We\ngμB\nthe magnetization observable as M̂ =\nT rρŜα (t)\nV\nα\nwhere the summation is taken over the site of the magnetization spin α. We now examine the time dependence of\nthis observable by calculating the rate equation according\nto the quantum-Liouville rate equation ;\ndρ(t)\n1\n+ [ρ̂, H] = 0\ndt\ni~\n\n(8)\n\nThis rate equation governs the time-evolution of the\nmagnetization observable as defined above, in the nonequilibrium regime. We can write the time derivative of\n\nthe magnetization [18], as follows ;\ndM X gμb\n1\n∂ρ α\n∂Sα\n=\nhΨn (t)| [ρSα , H] +\nS +ρ\n|Ψn (t)i,\ndt\nV\ni~\n∂t\n∂t\nn,α\n\nand we can use the quantum Liouville rate equation as\ndefined by Equation 8 to simplify this expression and we\narrive at the following rate equation :\ndM X gμb 1\n=\nT r{ρ[Sα , H S (t)]}\ndt\nV\ni~\nα\n\n(9)\n\nIn the case of the time dependent Hamiltonian derived\nin equation 7, we can assume a first order dynamical\nequation of motion given by dM\ndt = γM×H and calculate\nthe time evolution for the magnetization observable :\n←\n→\n2\ndM X gμB 1\ni ie~ μ0 j\n−1 ∂ M\n=\nT rρ[Sα ,\nS ].(1 + χm )\ndt\nV i~\n8m2 c2 β\ndt\nα,β\n\n←\n→\nX gμB ie~2 μ0 1\n∂ Ml\nk\n−1\nT rρi~\u000fijk Sα δαβ (1 + χm )δjl\n=\n2 c2 i~\nV\n8m\ndt\nα\n←\n→\ne~μ0\n∂M\n= −i 2 2 (1 + χ−1\n)M\n×\n,\nm\n8m c\ndt\nwhere, in the last two steps, we have used the following commutation relations for magnetization spins :\n[Sαi , Sβj ] = i~\u000fijk Sαk δαβ which implies that the theory presented here is that which relates to local dynamics and\nthat the origin of the damping is intrinsic. We now recognize the last equation as the which describes Gilbert\ndamping, as follows :\n←\n→\n∂M\ndM\nα\n=−\n.M ×\ndt\nMs\n∂t\n\n(10)\n\nwhereby the constant α is defined as follows :\n\nα=\n\n\u0001\nie~μ0 Ms\n1 + χ−1\nm\n2\n2\n8m0 c\n\n(11)\n\nThe α defined above corresponds with the Gilbert\ndamping found in the phenomenological term in the\nLandau-Lifschitz-Gilbert equation and χm is the magnetic susceptibility. In general, the inverse of the susceptibility can be written in the form [19],\n−1\nχ−1\nij (q, ω) = χ̃⊥ (q, ω) −\n\nωex\nδij ,\nγμ0 M0\n\n(12)\n\nwhere the equilibrium magnetization points along the zaxis and ωex is the excitation frequency associated with\nthe internal exchange field. The δij term in the inverse susceptibility does not contribute to damping mechanisms as it corresponds to the equilibrium response.\n\n\f4\nIn the basis (Mx ± iMy ,Mz ), we have the dimensionless\ntransverse magnetic susceptibility, as follows :\nχ̃m⊥ (q, ω) = γμ0\n\nM0 − iγσ⊥ q 2\nω0 − ω − iγσ⊥ q 2 ω0 /M0\n\nThe first term in the dimensionless Gilbert coefficient\n(Equation 11) is small (∼ 10−11 ) and the higher damping rate is controlled by the the inverse of the susceptibility tensor. For uniformly saturated magnetization,\nthe damping is critical and so the system is already at\nequilibrium as far as the Gilbert mechanism is concerned\n(dM/dt = 0 in this scenario). The expression for the\ndimensionless damping constant α in the dc limit (ω =0\n) is :\n\n\niσ⊥ q2 ω0\nω0\ne~μ0 Ms\nγμ0 M0 − μ0 M02\n,\nIm \n(13)\nα=\n8m20 c2\n1 − iγσ⊥ q2 /M0\nand we have the transverse spin conductivity from the\nfollowing relation (in units whereby ~=1) :\n\u0012\n\u0013\nn\n1\n1\nσ⊥ =\n+\n,\nee\ndis\n4m∗ ω02 τ⊥\nτ⊥\ndis\nee\nwhere τ⊥\nand τ⊥\nare the impurity disorder and electron\nelectron-electron scattering times as defined and parameterized in Reference [14]. We calculate the extrinsically\nenhanced Gilbert damping using the following set of parameters as defined in the same reference ; number density of the electron gas, n=1.4×1027 m−3 , polarization p,\nequilibrium magnetization M0 = γpn/2, equilibrium excitation frequency ω0 = EF [(1 + p)2/3 − (1 − p)2/3 ] and\nwave-number defined as q = 0.1 kF , where EF and kF\nare the Fermi energy and Fermi wave number, respectively. m∗ is taken to be the electronic mass. Using these\nquantities, we evaluate α values and these are plotted as\na function of both polarization and disorder scattering\nrate in Figure 1.\nIn general, the inverse susceptibility χ−1\nm will determine the strength of the damping in real inhomogeneous\nmagnetic systems where spin relaxation takes place, subbands are populated by spin orbit scattering and spin\nwaves and spin currents are emitted. The susceptibility term gives the Gilbert damping a tensorial quality,\nagreeing with the analysis in Reference [10]. Further, the\nconnection between the magnetization dynamics and the\nelectric field curl provides the mechanism for the energy\nloss to the electromagnetic field. The generation of radiation is caused by the rotational spin motion analog of\nelectric charge acceleration and the radiation spin interaction term has the form :\n\nH S (t) = i\n\nIn conclusion, we have shown that the Gilbert term,\nheretofore phenomenologically used to describe damping\n\n\u0001\ne~2 μ0 X\ndM\n1 + χ−1\n.\nm Sα .\n2\n2\n8m0 c α\ndt\n\n(14)\n\nFIG. 1: (Color Online) Plot of the dimensionless Gilbert\ndamping constant α in the dc limit (ω=0), as a function of\nelectron spin polarization and disorder scattering rate.\n\nin magnetization dynamics, is derivable from first principles and its origin lies in spin-orbital coupling. By a\nnon-relativistic expansion of the Dirac equation, we show\nthat there is a term which contains the curl of the electric field. By connecting this term with Maxwells equation to give the total time-varying magnetic induction,\nwe have found that this damping term can be deduced\nfrom the rate equation for the spin observable, giving the\ncorrect vector product form and sign of Gilberts' original phenomenological model. Crucially, the connection\nof the time-varying magnetic induction and the curl of\nthe electric field via the Maxwell relation shows that\nthe damping of magnetization dynamics is commensurate with the emission of electromagnetic radiation and\nthe radiation-spin interaction is specified from first principles arguments.\n\nAcknowledgments\n\nM. C. Hickey is grateful to the Trinity and the uniformity of nature. We thank the U.S.-U.K. Fulbright\nCommission for financial support. The work was supported by the ONR (grant no. N00014-09-1-0177), the\nNSF (grant no. DMR 0504158) and the KIST-MIT program. The authors thank David Cory, Marius Costache\nand Carlos Egues for helpful discussions.\n\n\f5\n\n[1] L. Landau and E. Lifshitz, Phys. Z. Sowiet. Un. 8, 153\n(1935).\n[2] E. M. Lifschitz and L. P. Pitaevskii, Statistical Physics\nPart 2 (Pergamon Press, Oxford, United Kingdom,\n1980).\n[3] T. Gilbert, Magnetics, IEEE Transactions on 40, 3443\n(2004).\n[4] C. E. Patton, C. H. Wilts, and F. B. Humphrey, J. Appl.\nPhys. 38, 1358 (1967).\n[5] M. Oogane, T. Wakitani, S. Yakata, R. Yilgin, Y. Ando,\nA. Sakuma, and T. Miyazaki, Japanese Journal of Applied Physics 45, 3889 (2006).\n[6] Y. Tserkovnyak, A. Brataas, G. E. W. Bauer, and B. I.\nHalperin, Rev. Mod. Phys. 77, 1375 (2005).\n[7] Y. Tserkovnyak, G. A. Fiete, and B. I. Halperin, Appl.\nPhys. Lett. 84, 5234 (2004).\n[8] G. Eilers, M. Lüttich, and M. Münzenberg, Phys. Rev.\nB 74, 054411 (2006).\n[9] V. Kamberskỳ, Canadian Journal of Physics 48, 2906\n(1970).\n\n[10] D. Steiauf and M. Fähnle, Phys. Rev. B 72 064450\n(2005).\n[11] S. Zhang and Z. Li, Phys. Rev. Lett. 93, 127204 (2004).\n[12] M. Fähnle, R. Singer, D. Steiauf, and V. P. Antropov,\nPhys. Rev. B 73, 172408 (2006).\n[13] J. Kuneš and V. Kamberský, Phys. Rev. B 65, 212411\n(2002).\n[14] E. M. Hankiewicz, G. Vignale, and Y. Tserkovnyak,\nPhys. Rev. B 78, 020404 (2008).\n[15] E. M. Hankiewicz, G. Vignale, and Y. Tserkovnyak,\nPhys. Rev. B 75, 174434 (2007).\n[16] W. Greiner, Relativistic Quantum Mechanics (SpringerVerlag, Berlin, Germany, 1987).\n[17] H.-A. Engel, E. I. Rashba, and B. I. Halperin, Phys. Rev.\nLett. 98, 036602 (2007).\n[18] J. Ho, F. C. Khanna, and B. C. Choi, Phys. Rev. Lett.\n92, 097601 (2004).\n[19] Z. Qian and G. Vignale, Phys. Rev. Lett. 88, 056404\n(2002).\n\n\f"}