{"id": "http://arxiv.org/abs/1004.2788v1", "guidislink": true, "updated": "2010-04-16T08:49:56Z", "updated_parsed": [2010, 4, 16, 8, 49, 56, 4, 106, 0], "published": "2010-04-16T08:49:56Z", "published_parsed": [2010, 4, 16, 8, 49, 56, 4, 106, 0], "title": "GRB Afterglows with Energy Injection from a spinning down NS", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1004.4996%2C1004.1672%2C1004.0578%2C1004.4065%2C1004.0963%2C1004.1365%2C1004.2772%2C1004.4859%2C1004.3396%2C1004.2940%2C1004.4506%2C1004.3145%2C1004.3800%2C1004.1492%2C1004.0798%2C1004.2693%2C1004.4857%2C1004.3091%2C1004.1150%2C1004.5597%2C1004.0695%2C1004.3480%2C1004.0375%2C1004.2451%2C1004.5152%2C1004.1988%2C1004.1980%2C1004.4564%2C1004.0177%2C1004.5252%2C1004.1764%2C1004.2788%2C1004.0068%2C1004.1960%2C1004.3385%2C1004.0247%2C1004.1418%2C1004.0243%2C1004.1793%2C1004.2748%2C1004.2996%2C1004.4685%2C1004.1378%2C1004.4716%2C1004.1722%2C1004.3354%2C1004.4852%2C1004.4390%2C1004.0428%2C1004.1246%2C1004.2787%2C1004.3061%2C1004.2157%2C1004.4627%2C1004.4991%2C1004.4041%2C1004.0281%2C1004.0752%2C1004.5076%2C1004.0557%2C1004.1532%2C1004.0794%2C1004.1865%2C1004.5599%2C1004.4781%2C1004.2900%2C1004.4646%2C1004.1008%2C1004.3412%2C1004.5499%2C1004.3702%2C1004.2958%2C1004.1352%2C1004.4526%2C1004.1905%2C1004.4209%2C1004.2168%2C1004.3428%2C1004.4882%2C1004.3265%2C1004.0209%2C1004.1559%2C1004.0293%2C1004.1702%2C1004.0229%2C1004.3673%2C1004.4894%2C1004.4256%2C1004.1846%2C1004.2923%2C1004.4223%2C1004.2140%2C1004.0388%2C1004.3745%2C1004.3365%2C1004.3952%2C1004.0437%2C1004.4933%2C1004.3332%2C1004.3715%2C1004.3892&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "GRB Afterglows with Energy Injection from a spinning down NS"}, "summary": "We investigate a model for the shallow decay phases of Gamma-ray Burst (GRB)\nafterglows discovered by Swift/XRT in the first hours following a GRB event. In\nthe context of the fireball scenario, we consider the possibility that\nlong-lived energy injection from a millisecond spinning, ultramagnetic neutron\nstar (magnetar) powers afterglow emission during this phase. We consider the\nenergy evolution in a relativistic shock subject to both radiative losses and\nenergy injection from a spinning down magnetar in spherical symmetry. We model\nthe energy injection term through magnetic dipole losses and discuss an\napproximate treatment for the dynamical evolution of the blastwave. We obtain\nan analytic solution for the energy evolution in the shock and associated\nlightcurves. To fully illustrate the potential of our solution we calculate\nlightcurves for a few selected X-ray afterglows observed by Swift and fit them\nusing our theoretical lightcurves. Our solution naturally describes in a single\npicture the properties of the shallow decay phase and the transition to the\nso-called normal decay phase. In particular, we obtain remarkably good fits to\nX-ray afterglows for plausible parameters of the magnetar. Even though\napproximate, our treatment provides a step forward with respect to previously\nadopted approximations and provides additional support to the idea that a\nmillisecond spinning (1-3 ms), ultramagnetic (B$\\sim 10^{14}-10^{15}$ G)\nneutron star loosing spin energy through magnetic dipole radiation can explain\nthe luminosity, durations and shapes of X-ray GRB afterglows.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1004.4996%2C1004.1672%2C1004.0578%2C1004.4065%2C1004.0963%2C1004.1365%2C1004.2772%2C1004.4859%2C1004.3396%2C1004.2940%2C1004.4506%2C1004.3145%2C1004.3800%2C1004.1492%2C1004.0798%2C1004.2693%2C1004.4857%2C1004.3091%2C1004.1150%2C1004.5597%2C1004.0695%2C1004.3480%2C1004.0375%2C1004.2451%2C1004.5152%2C1004.1988%2C1004.1980%2C1004.4564%2C1004.0177%2C1004.5252%2C1004.1764%2C1004.2788%2C1004.0068%2C1004.1960%2C1004.3385%2C1004.0247%2C1004.1418%2C1004.0243%2C1004.1793%2C1004.2748%2C1004.2996%2C1004.4685%2C1004.1378%2C1004.4716%2C1004.1722%2C1004.3354%2C1004.4852%2C1004.4390%2C1004.0428%2C1004.1246%2C1004.2787%2C1004.3061%2C1004.2157%2C1004.4627%2C1004.4991%2C1004.4041%2C1004.0281%2C1004.0752%2C1004.5076%2C1004.0557%2C1004.1532%2C1004.0794%2C1004.1865%2C1004.5599%2C1004.4781%2C1004.2900%2C1004.4646%2C1004.1008%2C1004.3412%2C1004.5499%2C1004.3702%2C1004.2958%2C1004.1352%2C1004.4526%2C1004.1905%2C1004.4209%2C1004.2168%2C1004.3428%2C1004.4882%2C1004.3265%2C1004.0209%2C1004.1559%2C1004.0293%2C1004.1702%2C1004.0229%2C1004.3673%2C1004.4894%2C1004.4256%2C1004.1846%2C1004.2923%2C1004.4223%2C1004.2140%2C1004.0388%2C1004.3745%2C1004.3365%2C1004.3952%2C1004.0437%2C1004.4933%2C1004.3332%2C1004.3715%2C1004.3892&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We investigate a model for the shallow decay phases of Gamma-ray Burst (GRB)\nafterglows discovered by Swift/XRT in the first hours following a GRB event. In\nthe context of the fireball scenario, we consider the possibility that\nlong-lived energy injection from a millisecond spinning, ultramagnetic neutron\nstar (magnetar) powers afterglow emission during this phase. We consider the\nenergy evolution in a relativistic shock subject to both radiative losses and\nenergy injection from a spinning down magnetar in spherical symmetry. We model\nthe energy injection term through magnetic dipole losses and discuss an\napproximate treatment for the dynamical evolution of the blastwave. We obtain\nan analytic solution for the energy evolution in the shock and associated\nlightcurves. To fully illustrate the potential of our solution we calculate\nlightcurves for a few selected X-ray afterglows observed by Swift and fit them\nusing our theoretical lightcurves. Our solution naturally describes in a single\npicture the properties of the shallow decay phase and the transition to the\nso-called normal decay phase. In particular, we obtain remarkably good fits to\nX-ray afterglows for plausible parameters of the magnetar. Even though\napproximate, our treatment provides a step forward with respect to previously\nadopted approximations and provides additional support to the idea that a\nmillisecond spinning (1-3 ms), ultramagnetic (B$\\sim 10^{14}-10^{15}$ G)\nneutron star loosing spin energy through magnetic dipole radiation can explain\nthe luminosity, durations and shapes of X-ray GRB afterglows."}, "authors": ["Simone Dall'Osso", "Giulia Stratta", "Dafne Guetta", "Stefano Covino", "Giovanni De Cesare", "Luigi Stella"], "author_detail": {"name": "Luigi Stella"}, "author": "Luigi Stella", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1051/0004-6361/201014168", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1004.2788v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1004.2788v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "7 pages, 2 figures, submitted to Astronomy & Astrophysics - referee's\n  comments included", "arxiv_primary_category": {"term": "astro-ph.HE", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph.HE", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1004.2788v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1004.2788v1", "journal_reference": null, "doi": "10.1051/0004-6361/201014168", "fulltext": "Astronomy & Astrophysics manuscript no. Dallosso ̇GRB ̇Magnetar2010\nOctober 31, 2018\n\nc ESO 2018\n\nGRB Afterglows with Energy Injection from a spinning down NS\nS. Dall'Osso1,2 , G. Stratta3 , D. Guetta1 , S. Covino4 , G. De Cesare5,6,7 , and L. Stella1\n\narXiv:1004.2788v1 [astro-ph.HE] 16 Apr 2010\n\n1\n2\n3\n4\n5\n6\n7\n\nINAF - Osservatorio Astronomico di Roma, via Frascati 33, Monte Porzio Catone, Roma, Italy\nVirgo-Ego Scientific Forum fellow\nASDC, via Galileo Galilei, 00040, Frascati (Roma), Italy⋆\nINAF - Osservatorio Astronomico di Brera, Via E. Bianchi 46, 23807, Merate (LC), Italy\nINAF - Istituto di Astrofisica Spaziale e Fisica Cosmica di Roma, via Fosso del Cavaliere 100, I-00133 Roma, Italy\nDipartimento di Astronomia, Universita' degli Studi di Bologna, Via Ranzani 1, I40127 Bologna, Italy\nCentre d'Etude Spatiale des Rayonnements, CNRS/UPS, B.P. 4346, 31028 Toulouse Cedex 4, France\n\nPreprint online version: October 31, 2018\nABSTRACT\n\nAims. We investigate a model for the shallow decay phases of Gamma-ray Burst (GRB) afterglows discovered by Swift/XRT in the\nfirst hours following a GRB event. In the context of the fireball scenario, we consider the possibility that long-lived energy injection\nfrom a millisecond spinning, ultramagnetic neutron star (magnetar) powers afterglow emission during this phase.\nMethods. We consider the energy evolution in a relativistic shock subject to both radiative losses and energy injection from a spinning\ndown magnetar in spherical symmetry. We model the energy injection term through magnetic dipole losses and discuss an approximate\ntreatment for the dynamical evolution of the blastwave. We obtain an analytic solution for the energy evolution in the shock and\nassociated lightcurves. To fully illustrate the potential of our solution we calculate lightcurves for a few selected X-ray afterglows\nobserved by Swift and fit them using our theoretical lightcurves.\nResults. Our solution naturally describes in a single picture the properties of the shallow decay phase and the transition to the socalled normal decay phase. In particular, we obtain remarkably good fits to X-ray afterglows for plausible parameters of the magnetar.\nEven though approximate, our treatment provides a step forward with respect to previously adopted approximations and provides\nadditional support to the idea that a millisecond spinning (1-3 ms), ultramagnetic (B∼ 1014 − 1015 G) neutron star loosing spin energy\nthrough magnetic dipole radiation can explain the luminosity, durations and shapes of X-ray GRB afterglows.\nKey words. (Stars:) Gamma-ray burst: general - X-rays: bursts - Shock Waves - Stars: magnetars - Relativistic processes\n\n1. Introduction\nBefore the launch of Swift in November 2004, X-ray afterglows\nof long Gamma-Ray Bursts could be pointed with X-ray telescopes not earlier than several hours after the trigger. These observations showed in most cases a smooth power-law like decay\nF(t) ∝ t−α , with typical index of α ≥ 1. With the advent of\nSwift, X-ray fluxes could be monitored from a few minutes after the burst trigger. These observations have revealed a complex\nbehavior in the first few hours after the GRB, which nonetheless\ndisplays remarkably standard properties across different events.\nThis behavior can be described with a double broken power law,\nwith an initial very steep decay (up to few hundreds of seconds\nafter the trigger) with α > 2 followed by a shallow phase, lasting\n∼ 103 − 104 s, with α < 0.8 and, later on, a steeper 'normal'\ndecay with α ∼ 1.2 − 1.4 (Nousek et al. 2006, Gehrels et al.\n2009).\nThe X-ray spectral slope does not change between the shallow and normal decay, in marked contrast to what would be expected in case this temporal break was caused by the passage\nof a characteristic synchrotron frequency in the X-ray band (e.g.\nSari et al. 1998). A possible interpretation requiring no spectral\nvariations in the observed energy band invokes prolonged energy injection into the external shock that is believed to give rise\nto the GRB afterglow. Energy injection could come either from\nrelativistic shells impacting the fireball at late times (e.g. Rees\n⋆\n\nINAF personnel resident at ASDC\n\nand Meszaros 1998, Sari and Meszaros 2000) or from a longlived central engine (e.g. Zhang et al. 2006, Nousek et al. 2006,\nPanaitescu et al. 2006a).\nAmong different hypotheses on the nature of GRB central\nengines, two major classes can be identified. The first considers\nthe formation of a black hole- debris torus system, the prompt\nemission being related to accretion of matter from the torus during the first ∼ 10 − 100s (Narayan, Paczynski & Piran 1992,\nWoosley 1993, Meszaros, Rees & Wijers 1999). In this scenario,\nkeeping the energy production active in order to power the afterglow for at least ∼ 104 s is a difficult and far from settled\nmatter, (Mc Fadyen et al. 2001, Ramirez-Ruiz 2004, Cannizzo\n& Gehrels 2009, Barkov & Komissarov 2009).\nAn alternative class of models invokes the formation of\na strongly magnetic (B> 1014 − 1015 G) , millisecond spinning neutron star (NS, Usov 1992, Duncan & Thompson 1992,\nBlackman & Yi 1998, Kluzniak & Ruderman 1998, Wheeler\n2000). Recently, time-dependent MHD simulations have shown\nthat long GRBs can originate from the interaction between a relativistic and strongly magnetized wind produced by a newlyborn NS and the surrounding stellar envelope. NS spin periods\nof ∼ 1 ms and ultrastrong magnetic fields, i.e. B≥ 1015 G, would\nbe required in this case (e.g. Thompson et al. 2004, Bucciantini\net al. 2006, 2008, 2009; see also Tchekhovskoy, McKinney &\nNarayan 2009).\nThe newly formed NS is expected to loose its initial spin\nenergy (> 1052 erg) at a very high rate for the first few hours\nthrough magnetic dipole spin down, something that provides a\n\n\f2\n\nS. Dall'Osso et al.: GRB Afterglows with Energy Injection from a spinning down NS\n\nlong-lived central engine in a very natural way. Dai & Lu (1998)\nconsidered this idea in relation to possible observable effects on\nthe afterglow emission. Zhang & Meszaros (2001) argued that,\nin this scenario, achromatic bumps in afterglow lightcurves are\nexpected for NS spin periods shorter than a few ms and magnetic\nfields stronger than several times 1014 G. Interestingly, studies of\nthe origin of NS magnetism envisage that millisecond spin period at birth is the key property that allows a proto-NS to amplify\na seed magnetic field to a strength far exceeding 1014 G, through\nefficient conversion of its initial differential rotation energy (e.g\nDuncan & Thompson 1992, Thompson & Duncan 1993). Such\nhighly magnetized, fast spinning NSs are expected to loose angular momentum at a high rate in the first decades of their life\nand later become slowly rotating magnetars whose major free\nenergy reservoir is in their magnetic field (Thompson & Duncan\n1995, 1996, 2001, cfr. Woods & Thompson 2006, Mereghetti\n2008). We term these NSs as magnetars since their birth even\nthough, when they spin at millisecond period, their rotational\nenergy is still the main free energy reservoir.\nAfter the Swift discovery of early afterglow shallow phases,\nthe magnetar scenario has been invoked to interpret the X-ray\nlight curve of both some short and long GRBs (e.g. 051221A by\nFan and Xu 2006; 060313 by Yu and Huang 2007; GRB 050801\nby De Pasquale et al. 2007; 070110 by Troja et al. 2007). For\nGRB 060729 this scenario was shown to provide a good agreement with the shallow and normal decay phases in the optical\nand X-ray bands (Grupe et al. 2007, Xu et al. 2009).\nFinally we note that, besides the interest in understanding GRB\nphysics, the very fast spin and huge magnetic field envisaged in\nthe magnetar formation scenario makes these objects very interesting also for gravitational wave (GW) astronomy. Different\npossibilities for this to occur have been investigated in the literature (Palomba 2001, Cutler 2002, Stella et al. 2005, Dall'Osso &\nStella 2007, Dall'Osso, Shore & Stella 2009, Corsi & Meszaros\n2009) showing that, in astrophysically plausible conditions, GW\nemission might efficiently extract spin energy from the NS, in\ncompetition with magnetic dipole losses. The study presented in\nthis paper builds on the ansatz that millisecond spinning magnetars are formed in the events that give rise to long GRBs.\nWe investigate the evolution of energy in a relativistic blastwave subject to radiation losses due to shock deceleration in\nthe ISM and energy injection from a magnetically braking NS.\nWe extend previous treatments by describing the injection term\nby the standard magnetic dipole formula and deriving a prediction for the evolution of energy and luminosity that can interpret the X-ray afterglows through their shallow and normal decay phases altogether. We derive an approximate solution for the\nblastwave luminosity which we compare with X-ray GRB afterglow lightcurves observed by Swift. We obtain a remarkably\ngood match to these lightcurves for the range of initial spin periods and magnetic field strengths expected for magnetars at birth.\nThese results illustrate the potential of this scenario in explaining\nthe early afterglow observations in a simple, unified picture.\n\n2. Relativistic Blast Wave with Energy Injection:\nspherically symmetric case\nWe assume that a GRB event is associated to the formation of a\nmillisecond spinning, ultramagnetized NS. In the context of the\nfireball scenario, the energy released in the collapse of the progenitor star produces first a fireball expanding freely at relativistic speed through the ambient medium. The prompt emission is\nproduced at this early stage and is commonly ascribed to internal\nshocks in the fireball (Rees & Meszaros 1994, Paczynski & Xu\n\n1994, Sari & Piran 1997). A relativistic forward shock is produced at larger distances from the explosion site (∼ 1016 cm),\nwhich initially propagates freely through the ambient medium.\nAt a later time, call it td , the mass swept up by the forward shock\nwill be enough to begin affecting the expansion dynamics of the\nshock itself. This defines the decelaration radius rd ≈ ctd , at\nwhich the kinetic energy of the shock starts being efficiently converted to internal energy and then radiation. This corresponds to\nthe onset of the afterglow emission. We focus here only on the\ndeceleration phase, describing the evolution of the total energy\nwithin the fireball as matter from the ISM is swept up. Our aim\nis to interpret the shallow decay phase and subsequent achromatic transition to the \"normal\" decay phase as observed in Xrays, within a single physical model containing a minimal set\nof parameters. We do not address here a detailed study of the\nmultiwavelength behaviour of afterglow lightcurves. In § 3.2 we\ndiscuss possible developments of our work in this direction, as to\nclosely compare model predictions with multiwavelength observations. The first few minutes after the GRB event are characterized by a very steep power-law decay of the flux while a marked\nspectral change usually accompanies the transition to the shallow decay phase (this is in contrast with the lack of spectral evolution across the shallow-to-normal transition). This initial steep\ndecay is believed to arise from a different spectral component\nthan the X-ray afterglow, likely the tail of the prompt emission\n(cfr. Zhang 2007 for a detailed discussion); we do not consider\nit in this work.\nIn addition to deceleration in the ISM, we study the way in\nwhich the afterglow emission is affected by the energy injection\ncaused by the spindown of the newly formed magnetar. We first\nintroduce time t as that measured by a clock at rest in the NS\n(central engine) frame. In this frame the NS loses rotational energy, likely in the form of a strongly magnetized particle wind,\nwith a luminosity L sd (t) according to the usual magnetic dipole\nspindown formula\nL sd (t) =\n\nI Kω4i\n(1 +\n\n2Kω2i t)2\n\n=\n\nE s,i\nLi\n=\n,\n2\n(1 + at)\nt2 (1 + t/t2 )2\n\n(1)\n\nwhere I is the NS moment of inertia, K = B2 R6 /(6Ic3 ) with B\nthe (dipole) magnetic field at the NS pole, R the NS radius and\nc the speed of light. In the second equality, the quantity Li =\nL sd (ti ) represents the spindown luminosity at the initial time (ti )\nwhen spindown through magnetic dipole radiation sets in, and\na = 2 Kω2i = 1/t2 , where t2 represents the spindown timescale\nat time ti and ωi is the initial spin frequency. E s,i is the NS spin\nenergy at time ti , so that Li = E s,i /t2 . The energy carried by the\nwind travels essentially at the speed of light, so that the energy\nemitted at later times by the NS can be transferred to the shock.\nTo calculate the expected behavior of the lightcurve we start\nfrom the energy balance of the relativistic blastwave subject to\nthe energy injection in eq. (1) along with radiative losses. The\nlatter are described by following the prescription of Cohen, Sari\n& Piran (1998). For the time being we assume spherical symmetry of all processes involved, which allows us to write the\ncomplete energy equation of the blast wave as\ndE\nE\nr(t)\nE\n= Lin j (t) − k = (1 − β)L sd [t −\n]−k .\ndt\nt\nc\nt\n\n(2)\n\nHere k = 4ǫe , with ǫe the fraction of the total energy that is\ntransferred to the electrons, r(t) is the radius of the blast wave at\ntime t and all quantities are expressed in the frame of the central engine. Note that Lin j represents the rate at which energy\nis injected in the shock at time t. This quantity is related to the\n\n\fWhen integrated, this gives T = t − r(t)/c. Now we can transform eq. (2) to the equivalent form with respect to time T , using\nrelation (3). After some manipulation one obtains\nE \u0012 dlnt \u0013\ndE\n.\n(4)\n= L sd (T ) − k\ndT\nT dlnT\nIn order to obtain t(T ), Γ(t) is required (see eq. 3); this in turn\nrequires a study of the hydrodynamical evolution of the blast\nwave. The solution to this problem with energy injection is far\nfrom trivial and beyond the scope of the present paper. Here we\nintroduce an approximation in order to derive a solution to the\nproblem which captures all the essential physics. Customarily\nthe evolution of Γ in the deceleration phase is treated using selfsimilar solutions for relativistic blastwaves (Blandford & McKee\n1976, Piran 1999). In this case all quantities scale as power-laws\n(with time t). Upon writing Γ2 ∝ t−m one can solve eq. (3) and\nobtain T = t/[2(m + 1)Γ2 ], from which dlnt/dlnT = 1/(1 + m)\ncan be substituted in eq. (4) to obtain E(T ). On the other hand, in\nthe problem we are considering the shock evolution is not selfsimilar since the energy injection term introduces in the problem\nthe timescale t2 = a−1 . One can evaluate the change introduced\nby this complication using an integral expression for the total\n(internal plus kinetic) energy of the shock (Zhang & Meszaros\n2001)\n4π\n4π\nE=\nn(m p c2 )Γ2 r3 ≈\nn(m p c5 )Γ2 t3 ,\n3\n3\n\n(5)\n\nwhere r ≈ ct has been assumed. By neglecting, for the sake\nof simplicity, radial variations in the density of the ambient\nmedium, we can thus write Γ as a function of the shock energy\nand time t, namely Γ2 ∝ E/t3 . For self-similar solutions one obtains E∝ t3−m ; adiabatic shocks thus correspond to m = 3. The\nrelation between Γ and E expressed by eq. (5) identifies two extremes for the evolution of Γ. First, neglecting radiative losses\ncorreponds to the fastest possible growth rate for E which, in\nturn, corresponds to the slowest decay rate for Γ2 . On the other\nhand, neglecting energy injection corresponds to the fastest possible decay rate for E and, in turn, of Γ2 . Any realistic behaviour\nof Γ is thus expected to lie between these two extremes.\nIn the former case, which is appropriate for the early stages\nof energy injection, we can write to a very good approximation\ndE const\n≈ 2 .\ndt\nΓ\n\n(6)\n\nThe solution to this gives E∝ t2 and, thus, Γ2 ∝ t−1 or dlnt/dlnT\n= 1/2. In the opposite extreme, where only radiation losses are\npresent, one obtains E∝ t−k which implies Γ2 ∝ t−(3+k) (with, in\ngeneral, k < 1) or dlnt/dlnT = 1/(4 + k). Note that these extremes reproduce, as expected, the self-similar solution obtained\nby Zhang & Meszaros 2001.\n1\n\nthe second equality holds since β ≃ 1\n\n100\n\nEimp,50= 10 B14=10 Pi,ms=1\nEimp,50= 10 B14= 3 Pi,ms=1\n\n10\n\nEimp,50= 10 B14= 3 Pi,ms=3\n\n0.1\n\n1\n\nEimp,50= 1 B,14=3 Pi,ms=3\n\n0.01\n\nLuminosity (1048 erg s−1)\n\n(3)\n\nEimp,50=100 B14=10 Pi,ms=1\n\n10−3\n\ndt\n.\n2Γ2 (t)\n\n3\n\n10−4\n\ndT = (1 − β)dt ≃\n\n10−5\n\nrate at which the central NS emitted energy - L sd - at a previous\ntime, t − r(t)/c. In the central engine rest frame, an infinitesimal\ntime interval dt is related to the infinitesimal displacement of the\nblast wave dr = cβ(t)dt. However, due to propagation effects,\nphotons emitted at two successive radii will be received by the\nobserver over a much shorter time interval dT , which defines\nwhat is called \"the observer's time\" (T ). The relation between dt\nand dT is1\n\n1000\n\nS. Dall'Osso et al.: GRB Afterglows with Energy Injection from a spinning down NS\n\n100\n\n1000\n\n104\nObserver's Time (s)\n\n105\n\n106\n\n107\n\nFig. 1. Five different theoretical (bolometric) lightcurves from the\nmodel presented here, drawn varying the initial energy of the afterglow\n(Eimp ), the dipole magnetic field (B) and the initial spin period (Pi,ms )\nof the NS. All lightcurves are obtained for the same value of k′ = 0.4.\nThe time at which each lightcurve begins is the deceleration time T d ,\nestimated for illustration purposes simply by equating the initial energy\nEimp to the rest-mass energy of swept up matter in a constant density\nISM (n ≃ 1 cm−3 ).\n\nHence, although the coefficient multiplying E/T in eq. (4) does\ndepend on time, its value will be bracketed between the two\nextremes found above2, as long as E ∝ Γ2 t3 holds. As these\nextremes differ by a factor 2 + k/2 at most, we can consider\ndlnt/dlnT ≈ const as a reasonable first-order approximation, neglecting the slow and moderate change of dlnt/dlnT . This allows\nus to write the energy equation as\ndE\nE\n= L sd (T ) − k′ ,\ndT\nT\n\n(7)\n\nwhere k′ = k(dlnt/dlnT )≈ const. Note that its value will also\ndepend on the unknown density profile of the ambient medium,\nabout which we do not make any assumptions. Our ignorance\nabout it is completely contained in the free parameter k′ , as is\nour ignorance about the microphysics. In general, fixing all other\nparameters, we expect larger values of k′ for a wind-like medium\nthan for a constant density ISM, based on the discussion above.\nAs far as our present work is concerned, the solution to eq. (7)\ncan be cast in the form\nZ T\n′\n\u0012 T \u0013k ′\nLi\nTk\n0\nE(T ) = k′\n,\n(8)\ndT\n+\nE\n0\n2\nT\nT\nT 0 (1 + aT )\nwhere T0 ≥ Td is any time chosen as the initial condition. The\nintegral in the above expression can be expressed in terms of the\n(real valued) hypergeometric function 2 F1 (a, b; c; z)\nZ\n′\n′\n′\n′\nTk\n2 F 1 (1 − k , −k ; 2 − k ; z)\n,\n(9)\ndT = 1+k′ ′\n2\n(1 + aT )\na (k − 1)(1 + aT )1−k′\nwhere z = (1 + aT )−1 . Inserting this expression in the above\neq. (8), we obtain the complete functional form of E(T ) and\ncan accordingly re-express the energy loss term of eq. (4) as\n2\n\nNote that, for a wind-like medium whose density declines as r−2 ,\nsimilar conclusions would hold: adiabatic shocks correspond to m = 1,\nwhile dlnt/dlnT = 1 and 1/(1 + k) for the two extremes, respectively.\n\n\f050319\n\n50\n\n10\n\n48\n\n10\n\n46\n\n10\n\n44\n\nLuminosity (erg/s)\n\nS. Dall'Osso et al.: GRB Afterglows with Energy Injection from a spinning down NS\n\nLuminosity (erg/s)\n\n4\n\n10\n\n48\n\n10\n\n46\n\n10\n\n44\n\n10\n4\n\n10\nTime (s)\n\n6\n\n061121\n\n50\n\n10\n\n48\n\n10\n\n46\n\n10\n\n44\n\n10\n\n2\n\n10\n\n4\n\n10\nTime (s)\n\n2\n\n10\n\n6\n\n10\n\n10\n\n4\n\n10\nTime (s)\n\n50\n\nLuminosity (erg/s)\n\n2\n\n10\n\nLuminosity (erg/s)\n\n060729\n\n50\n\n10\n\n6\n\n10\n\n080430\n\n10\n\n48\n\n10\n\n46\n\n10\n\n44\n\n10\n\n2\n\n10\n\n4\n\n10\nTime (s)\n\n6\n\n10\n\nFig. 2. Least square fit to the X-ray lightcurves of four selected GRB afterglows observed by Swift/XRT obtained through our eqs. (8) and (9). The\nblue points and red lines represent the measured (isotropic) luminosity (in the 0.3-100 keV energy range) and best fits, respectively. The starting\ntime T0 was determined for each afterglow based on the end of the spectral transition from the previous steep-decay phase, as discussed in the text.\nBest-fit parameter values for each individual lightcurve are reported in Tab. (1).\n′\n\nL(T ) = k E(T )/T , which represents the total (bolometric) luminosity of the blastwave. The resulting function thus provides\nthe total bolometric luminosity as a function of (observer's) time\nT . In what follows we use it as an approximation to the X-ray\nlightcurve in order to compare it with the X-ray data. This assumes that the observed X-ray luminosity matches the bolometric luminosity, a reasonable approximation as long as the X-ray\nflux is the dominant emission component, which is largely verified in the early stages of the afterglow.\n\n3. Discussion\nIn order to illustrate the salient properties of our solution, we\nplot in Fig. 1 five lightcurves calculated through eqs. (8) and (9).\nThese correspond to a choice of typical values for the shock initial energy, spin period and (dipole) magnetic field of the newly\nformed magnetar. For all curves a value k′ = 0.4 for the radiative\nefficiency was assumed.\nThe curves in Fig. (1) highlight some general features of the\nsolution, which are not related to the nature of our approximation. In general, the model predictions depend mainly on three\nkey parameters: the NS initial spin energy, its (dipole) external\nmagnetic field and the initial energy in the blast wave. The observed X-ray lightcurves of GRB afterglows display a range of\nshapes, normalizations and durations which our model can account for in a very natural way. On average, the shallow phase is\nnot flat but characterized by a negative slope, smoothly steepening over time as energy injection decreases and radiative losses\n\nbecome more important. In fact, the NS spindown luminosity itself, i.e. the energy injection term, has an effective power-law\nslope αsd (to distinguish it from α of the observed afterglow\nlightcurve), which is expressed as αsd (t) = −2(t/t2 )/(1 + t/t2 ).\nThis equals zero at t = 0 and gradually steepens with time,\nreaching the value αsd = 1 at t = t2 and, eventually, αsd → 2\nfor t → ∞. This allows a simple understanding of the lightcurve\nshapes and their dependence on the parameters.\nGiven the form of the radiative loss term, ∼ E/T , the condition dE/dT > 0 is necessary and sufficient for the shallow decay\nphase to occur, namely a part of the lightcurve where the temporal index of the power-law decay is smaller than 1. Therefore, the\nonset of the shallow decay phase can be defined by the requirement Linj (T ) > kE(T )/T . This leads to a bound on the time at\nwhich the shallow phase starts, which can be expressed in terms\nof the ratio x = T/T 2 as\nx\nE(T )\n>k\n.\n(10)\n2\n(1 + x)\nE s,i\nIn general, at the initial stage of afterglow emission, the large\nvalue of E and small value of T make it likely that radiative\nlosses dominate over the injection term. Starting from the initial\n(kinetic) energy of the explosion, E0 , the afterglow luminosity\nwill then decay as a power-law with index (1 + k). In this situation, one has E(T ) = E0 (T 0 /T )k that, inserted in eq. (10) above,\ngives\n!k\nx1+k\nE0 T 0\n>k\n.\n(11)\n(1 + x)2\nE s,i T 2\n\n\fS. Dall'Osso et al.: GRB Afterglows with Energy Injection from a spinning down NS\n\nPutting T = T 0 (≪ T 2 ) in this equation, and then defining x0 =\nT 0 /T 2 , one sees that the shallow phase can start right at time T 0\nif x0 /(1 + x0 )2 > kE0 /E s,i . However, since the left hand side\nin this inequality is ≪ 1 by definition, the condition could be\nverified only for a very small ratio E0 /E s,i . Although this might\nhappen in some cases, one does not expect this to be a general\noccurrence, so that an initial power-law decay of the lightcurve,\nwith index α = 1 + k > 1 is to be expected in general. After\nsome time, however, condition (11) will be met so that energy\ninjection will overcome radiative losses, the total energy within\nthe shell will start increasing over time and the lightcurve will\nflatten accordingly.\nThis shallow decay phase will clearly last as long as energy\ninjection is sufficiently strong to balance radiative losses, a condition that is bound to fail somewhere after time T 2 . Indeed, we\nknow that during the shallow phase E(T ) increases over time\n∝ T β , with β < 1 and, as long as T < T 2 , x on the left-hand\nside of eq. (10) grows ∼ T . Hence, if that inequality was satisfied at some early time, it will continue to hold at least up to\n∼ T 2 . After time T 2 , on the other hand, both the left-hand side\nand right-hand side of eq. (10) start decreasing with a steepening dependence on time. However, while the latter term has an\nasymptotic decay ∝ T −k dictated by the form of radiative losses,\nthe former term has a steeper asymptotic decay, ∝ T −1 , dictated\nby the form of the injection term. Therefore, the inequality expressed in eq. (10) is bound to reverse sign at some time T > T 2 ,\nwhich implies dE/dT < 0 at that time and the afterglow luminosity will eventually decay again ∝ T −(1+k) .\nA natural anticorrelation between the duration of the shallow phase and its luminosity, i.e. the afterglow luminosity, is\nalso apparent from our model lightcurves, again matching one\nof the salient properties of observed X-ray afterglows (Sato et al.\n2007, Dainotti et al. 2008). In the light of the above discussion\nit is straightforward to see that this anticorrelation reflects an intrinsic property of the energy injection model assumed, i.e. of\nmagnetic dipole spindown. In fact, NSs with a larger spindown\nluminosity will, on average, have a shorter spindown timescale.\nThis can be checked from the last step in eq. (1), in the limit\nt < t2 appropriate for the shallow decay phase, showing that the\nNS initial spindown luminosity is Li ∝ B2 ω4i , while t2−1 ∝ B2 ω2i .\nThis point also leads to the expectation that the most luminous among all GRBs/afterglows might even lack a shallow\nphase altogether. This expectation can also be seen directly from\neq. (11). The left-hand side of that equation has indeed a maximum at x = (1 + k)/(1 − k) so, if the right-hand side was always\ngreater than that maximum, the condition dE/dT > 0 could\nnever be met. As an example, choosing k = 0.5 gives a maximum ≃ 0.325 at x = 3. Therefore, no shallow decay phase\nwould occur if E0 /E s,i > 0.65(T 2/T 0 )1/2 . From this example we\nsee that, for a given initial spin energy, shorter values of T 2 (implying stronger magnetic fields) can more easily lead to a lack\nof the shallow decay phase. On the other hand, for a given T 2 ,\nsmaller values of the initial spin energy (again implying stronger\nvalues of the magnetic field) favour the lack of a shallow phase.\nFinally we note that, even starting with largely different initial luminosities, theoretical lightcurves converge to a narrow\ndistribution in luminosity at late times, nicely reproducing a\nproperty of observed lightcurves (cfr. Nousek et al. 2006, their\nFig. 2). Again, this can be easily understood in terms of the\nabove discussion. All lightcurves evolve as T −(1+k) at late times,\ni.e. for t >> t2 when energy injection has long ceased, so that\nthey are all parallel for a fixed value of k′ . Second, the general\nanticorrelation between luminosity and duration of energy injection implies that lower luminosity plateau's will, in general,\n\n5\n\nlast longer than higher luminosity ones. Therefore the power-law\ndecay starts earlier in more luminous afterglows, while less luminous ones are still (nearly) flat, which naturally causes all late\npower-law segments to look as if they had very similar normalizations. Basically, this will reflect the overall energy budget of\nthe blastwave, including both the initial kinetic energy and the\nenergy injected in the later phase. Note that if the same total energy is injected over a longer time - hence, at a lower luminosity\n- it can produce a late power-law decay with a slightly higher\nnormalization, as clear from the second and third curves in Fig.\n1.\n3.1. Comparison with Observations and Results\n\nIn order to further assess the goodness of our treatment, we show\nin Fig. (2) fits to four selected X-ray afterglows observed by\nSwift, based on our solution (see eq. 8). The afterglows were\nchosen for illustration purposes among GRBs with known redshifts, good statistics in the XRT lightcurves, clear evidence for\na shallow phase, sufficiently long monitoring (> 105 s after the\ntrigger) and absence of bright flares or re-brightenings superposed on their lightcurves.\nTo approximate bolometric luminosity, we obtained rest\nframe 0.3-100 keV light curves (Fig. 2) from the observed 0.3-10\nkeV counts rate (taken from Swift XRT lightcurve repository, see\nEvans et al. 2006, 2009), assuming an absorbed power law spectral model over the shallow phase, including also the subsequent\nnormal decay if necessary. The resulting (isotropic) luminosities\nwere calculated by multiplying the fluxes by 4πD2L , with DL the\nluminosity distance calculated by assuming a standard ΛCDM\ncosmology with Ωm = 0.27, ΩΛ = 0.73 and H0 = 0.73 km s−1\nMpc−1 . Finally, observer's times were corrected for the redshift\nof the source. In accordance with the idea that the initial steep\ndecay phase results from the prompt event, we only fitted data\npoints from the onset of the shallow decay phase, as determined\nby the time at which the spectral transition of the X-ray emission\ntakes place (our T0 ).\nWe note that, even though only data points for T > T 0 ∼ 100\ns were fitted, the initial spin energy of our model refers to the\ntime at which magnetic dipole braking sets in, which, in general,\nis earlier than T0 . Moreover, the magnetic field is assumed to remain constant. We stress that our derived values of the radiative\nefficiency k′ should be taken with some caution. As discussed\nin the previous section, the degeneracy between the different parameters that determine k′ can only be solved through detailed\nhydrodynamical models and joint multiwavelength fits to observations. Here we note that best-fit values of k′ correspond to values of ǫe in a relatively wide, and fully acceptable, range between 0.1 and 0.8, depending on the exact relation between t\nand T . The results of our fits show that our model is in agreement with the data in our sample. NS parameters resulting from\nour least-squares fits are reported in Tab. (1). We stress that the\ninitial spin periods, ∼ 1 − 3 ms, and the magnetic fields, several\ntimes 1014 G up to slightly larger than 1015 G, perfectly match\nthe parameter range expected for newly born, millisecond spinning magnetars, if their seed magnetic fields were amplified to\nultrastrong values by a strong α − Ω dynamo in the first seconds\nafter formation (Duncan & Thompson 1992). In addition, we\nnote that the derived magnetic field values also perfectly match\nthe values of the dipole fields measured in galactic X-ray sources\nthought to host magnetars, namely the Anomalous X-ray Pulsars\nand Soft-Gamma Ray Repeaters (see Woods & Thompson 2006,\nMereghetti 2008). Finally, the required initial spin periods imply\nspin energies in the range (3 × 1051 − 3 × 1052 ) erg, for a NS\n\n\f6\n\nS. Dall'Osso et al.: GRB Afterglows with Energy Injection from a spinning down NS\n\nTable 1. Best-Fit Parameters for the four selected GRBs. The time T0 is the time\nstarting from which we fit observed lightcurves (see text for more details) and the\nenergy E0 respresents the total energy, in units of 1050 erg, within the blastwave\nat time T0 . The dipole magnetic field of the NS is expressed in units of 1014 .\nReported errors are at 1σ.\nGRB\n050319\n060729\n061121\n080430\n\nPi [ms]\n\nB14 [G]\n\nk\n\nE0,50 [erg]\n\nT 0 [s]\n\n1.05 ± 0.03\n2.12 ± 0.08\n1.18 ± 0.06\n3.7 ± 0.6\n\n5.5 ± 0.4\n3.2 ± 0.2\n12.2 ± 0.7\n11.7 ± 1.1\n\n0.80 ± 0.25\n0.58 ± 0.11\n0.66 ± 0.21\n0.33 ± 0.09\n\n10.0 ± 2.1\n1.3 ± 0.2\n10.4 ± 3.0\n1.2 ± 0.3\n\n100\n300\n100\n200\n\nmoment of inertia I ≃ 1.4 × 1045 g cm2 (cfr. Lattimer & Prakash\n2001). Note that this is a very conservative estimate of the total\nspin energy of the NS at formation, since we are only measuring the spin energy of the NS as magnetic dipole losses set in\nas the dominant spindown mechanism. Additional mechanisms\nhave been proposed, which might be initially more efficient in\nextracting the NS spin energy and angular momentum, as long as\nit spins at ≃ 1 ms (cfr. Bucciantini et al. 2006, 2008, Dall'Osso,\nStella & Shore 2009, Metzger 2010). We finally note that in at\nleast one case (GRB060729), the X-ray luminosity at late times\nis somewhat lower than the model prediction. This can be caused\nby effects that have not been considered in our simple model, of\nwhich we breifly mention two. First, as we discussed in § 2,\nforcing the model to fit the whole lightcurve with a fixed value\nof dlnt/dlnT can lead to an overestimate (by a factor of 2 at most)\nof the late time emission for a given shallow phase luminosity.\nThis is just of the correct magnitude to explain the mismatch in\nthe case of GRB060729.\nSecondly, fitting the X-ray lightcurves with the bolometric luminosity can lead to an overestimate, particularly at late times.\nIn fact the X-ray lightcurves probably are not representative of\nthe bolometric luminosity at late times, when the contribution\nof other, lower frequency bands to the total emission becomes\nnon-negligible.\n3.2. Further developments\n\nWe briefly mention here some of the points that deserve futher\ncomment and that we identify as the most important steps to\nimprove the model beyond the present treatment.\nAs found by several authors (Panaitescu et al. 2006b, Liang\net al. 2007), the optical lightcurves of several GRB afterglows show a chromatic behaviour when compared to X-ray\nlightcurves, namely they do not show any break at the shallowto-normal break observed in X-rays. According to Liang et al.\n(2007), about a half of GRB afterglows with simultaneous X-ray\nand optical observations show this chromatic behaviour. This is\ncustomarily viewed as a major problem for most models invoked\nto explain the shallow decay phase, at least for half of the afterglows. As far as the model introduced here is concerned a selfconsistent solution of Γ(t) is required for a detailed calculation of\nthe expected synchrotron emission at different frequencies (cfr.\nZhang & Meszaros 2004, Sari 2006). This will permit to derive\nmultiband lightcurves up to late times which can be compared\nwith multiwavelenght observations of GRB afterglows. However\nwe stress here that a different behavior of the optical and X-ray\nlightcurves is to be expected, in general, in the synchrotron emission from the external shock, if a spectral break frequency were\nlocated between the X-ray and optical bands (as already noted\nby Panaitescu et al. 2006b). This is a natural property of a flow\n\nin the slow cooling regime, if the cooling frequency lies above\nthe optical band but below the X-ray band during (most of) the\nenergy injection phase. In this case, while electrons contributing to the X-ray emission are re-radiating instantaneously all the\nenergy that is transferred to them, electrons emitting in the optical are radiating only a tiny fraction of it. Therefore, the optical emission can evolve indipendently of the injection term for\na while, until the emitting electrons nearly exhaust the energy\nthat they accumulated. We will present a quantitative treatment\nof this issue in a future paper.\nThe assumed geometry of the expanding ejecta also deserves\nsome discussion. Although the subject is still open to debate,\nthere exists by now considerable evidence that GRB fireballs are\nbeamed, likely with opening angles of several degrees (Frail et\nal. 2001, Ghirlanda et al. 2004, Nava et al. 2007, Liang et al.\n2008, Racusin et al. 2009, Cenko et a. 2009). It is important to\nrealize that the energetic requirements of the central engine as\nderived from our fits are not sensitive to the degree of beaming\nof the ejecta. This is true as long as the NS emits its spindown\nluminosity in a nearly isotropic way, as envisaged in models of\nNS magnetospheres loosing spin energy and angular momentum through the open field lines (Contopoulos, Kazanas & Fendt\n1999, Gruzinov 2005, Spitkovsky 2006). In this case, only a fraction ∼ θ2j of the rotational energy losses will be transferred to the\nejecta and contribute to Linj in eq. (2), where θ j is the opening\nangle of the beam. On the other hand, the measured luminosity\nof the afterglow would have to be decreased by the same factor, thus leaving the inferred (isotropic) spindown luminosity of\nthe NS unaffected. The characteristic timescale t2 of energy injection is also unaffected by beaming, implying that our derived\nvalues of the dipole magnetic field are also independent of beaming in this case.\nOn the contrary, if the millisecond spinning NS were to emit\nits spindown luminosity in a beam of comparable size to the\nbeam of the fireball, then all its power would be transferred to\nthe ejecta. The required spin energy of the NS (∝ ω2i ) would\nhave to be reduced accordingly by a factor ∼ θ2j . In this case,\nsince the timescale t2 ∝ B2 ω2i is always independent of beaming, our derived values of the magnetic field would have to be\nincreased by a factor ∼ θ−1\nj .\n\n4. Conclusions\nIn the framework of prolonged energy injection models for GRB\nafterglows observed by Swift, we have considered the possibility\nthat newly born magnetars - strongly magnetized and millisecond spinning NSs - are formed in the events producing (long)\nGRBs. In the first hours after formation of the NSs, the high\nspindown luminosity caused by magnetic dipole radiation losses\nrepresents a natural mechanism for prolonged energy injection\nin the external shock. To assess the viability of this scenario we\nconsidered the energy balance of a blastwave subject to injection\nof energy by a NS spinning down through magnetic dipole radiation, along with radiative losses (∝ E/t). We found an approximate expression for the (isotropic) bolometric luminosity of the\nblastwave as a function of time that is in substantial agreement\nwith general properties of the shallow-decay and normal-decay\nphases of X-ray GRB afterglows observed by Swift.\nMoreover, we have shown that individual lightcurves can be\nvery well fitted by using our derived expression for the bolometric luminosity of the continuously-powered blastwave. In particular, our best fits provide values for the initial spin period of\nthe NS in the range 1-3 ms, which match well the values ex-\n\n\fS. Dall'Osso et al.: GRB Afterglows with Energy Injection from a spinning down NS\n\npected in magnetar formation scenarios. Best-fit values for the\nmagnetic dipole field, 1014 − 1015 G, are also in the range expected for such objects at formation and in agreement with the\ndipole fields estimated for Anomalous X-ray Pulsars and Soft\nGamma-ray Repeaters, the candidate magnetars in our Galaxy.\nAcknowledgements. This work made use of data supplied by the UK Swift\nScience Data Centre at the University of Leicester.\nSD acknowledges support from a VESF Fellowship. SD thanks Prof. S. N. Shore\nfor insightful discussions and helpful comments.\n\nReferences\nBarkov, M. V., & Komissarov, S. S. 2009, MNRAS, 1713\nBianco, C. L., & Ruffini, R. 2004, ApJ, 605, L1\nBlackman, E. G., & Yi, I. 1998, ApJ, 498, L31\nBlandford, R. D., & McKee, C. F. 1976, Physics of Fluids, 19, 1130\nBucciantini, N., Thompson, T. A., Arons, J., Quataert, E., & Del Zanna, L. 2006,\nMNRAS, 368, 1717\nBucciantini, N., Quataert, E., Arons, J., Metzger, B. D., & Thompson, T. A. 2008,\nMNRAS, 383, L25\nBucciantini, N., Quataert, E., Metzger, B. D., Thompson, T. A., Arons, J., & Del\nZanna, L. 2009, MNRAS, 396, 2038\nCannizzo, J. K., & Gehrels, N. 2009, ApJ, 700, 1047\nS. B. Cenko, D. A. Frail, F. A. Harrison, S. R. Kulkarni, E. Nakar, P. Chandra,\nN. R. Butler, D. B. Fox, A. Gal-Yam, M. M. Kasliwal, J. Kelemen, D.-S.\nMoon, P. A. Price, A. Rau, A. M. Soderberg, H. I. Teplitz, M. W. Werner,\nD. C.-J. Bock, J. S. Bloom, D. A. Starr, A. V. Filippenko, R. A. Chevalier,\nN. Gehrels, J. N. Nousek, T. Piran . 2009, arXiv:0905.0690\nCohen, E., Piran, T., & Sari, R. 1998, ApJ, 509, 717\nContopoulos, I., Kazanas, D., & Fendt, C. 1999, ApJ, 511, 351\nCorsi, A., & Mészáros, P. 2009, ApJ, 702, 1171\nCutler, C. 2002, Phys. Rev. D, 66, 084025\nDai, Z. G., & Lu, T. 1998, A&A, 333, L87\nDainotti, M. G., Cardone, V. F., & Capozziello, S. 2008, MNRAS, 391, L79\nDall'Osso, S., & Stella, L. 2007, Ap&SS, 308, 119\nDall'Osso, S., Shore, S. N., & Stella, L. 2009, MNRAS, 398, 1869\nde Pasquale, M., et al. 2007, MNRAS, 377, 1638\nDuncan, R. C., & Thompson, C. 1992, ApJ, 392, L9\nEvans, P. A., et al. 2007, A&A, 469, 379\nEvans, P. A., et al. 2009, MNRAS, 397, 1177\nFan, Y.-Z., & Xu, D. 2006, MNRAS, 372, L19\nFrail, D. A., et al. 2001, ApJ, 562, L55\nGehrels, N., Ramirez-Ruiz, E., & Fox, D. B. 2009, ARA&A, 47, 567\nGhirlanda, G., Ghisellini, G., Lazzati, D., & Firmani, C. 2004, ApJ, 613, L13\nGrupe, D., et al. 2007, ApJ, 662, 443\nGruzinov, A. 2005, Physical Review Letters, 94, 021101\nKluźniak, W., & Ruderman, M. 1998, ApJ, 505, L113\nLiang, E.-W., Zhang, B.-B., & Zhang, B. 2007, ApJ, 670, 565\nLiang, E.-W., Racusin, J. L., Zhang, B., Zhang, B.-B., & Burrows, D. N. 2008,\nApJ, 675, 528\nLyons, N., O'Brien, P. T., Zhang, B., Willingale, R., Troja, E., & Starling,\nR. L. C. 2009, arXiv:0908.3798\nMacFadyen, A. I., Woosley, S. E., & Heger, A. 2001, ApJ, 550, 410\nMereghetti, S. 2008, A&A Rev., 15, 225\nMeszaros, P., Rees, M. J., & Wijers, R. A. M. J. 1999, New Astronomy, 4, 303\nMetzger, B. D. 2010, arXiv:1001.5046\nNarayan, R., Paczynski, B., & Piran, T. 1992, ApJ, 395, L83\nNava, L., Ghisellini, G., Ghirlanda, G., Cabrera, J. I., Firmani, C., & Avila-Reese,\nV. 2007, MNRAS, 377, 1464\nPalomba, C. 2001, A&A, 367, 525\nPaczynski, B., & Xu, G. 1994, ApJ, 427, 708\nPanaitescu, A., Mészáros, P., Gehrels, N., Burrows, D., & Nousek, J. 2006a,\nMNRAS, 366, 1357\nPanaitescu, A., Mészáros, P., Burrows, D., Nousek, J., Gehrels, N., O'Brien, P.,\n& Willingale, R. 2006b, MNRAS, 369, 2059\nPiran, T. 1999, Phys. Rep., 314, 575\nRacusin, J. L., et al. 2009, ApJ, 698, 43\nRamirez-Ruiz, E. 2004, MNRAS, 349, L38\nRees, M. J., & Meszaros, P. 1994, ApJ, 430, L93\nRees, M. J., & Meszaros, P. 1998, ApJ, 496, L1\nSari, R., & Piran, T. 1997, MNRAS, 287, 110\nSari, R., Piran, T., & Narayan, R. 1998, ApJ, 497, L17\nSari, R., & Mészáros, P. 2000, ApJ, 535, L33\nSari, R. 2006, Relativistic Jets: The Common Physics of AGN, Microquasars,\nand Gamma-Ray Bursts, 856, 33\n\n7\n\nSato, R., Ioka, K., Toma, K., Nakamura, T., Kataoka, J., Kawai, N., & Takahashi,\nT. 2007, arXiv:0711.0903\nSpitkovsky, A. 2006, ApJ, 648, L51\nStella, L., Dall'Osso, S., Israel, G. L., & Vecchio, A. 2005, ApJ, 634, L165\nTaub, A. H. 1948, Physical Review , 74, 328\nTchekhovskoy, A., McKinney, J. C., & Narayan, R. 2009, ApJ, 699, 1789\nThompson, C., & Duncan, R. C. 1993, ApJ, 408, 194\nThompson, C., & Duncan, R. C. 1995, MNRAS, 275, 255\nThompson, C., & Duncan, R. C. 1996, ApJ, 473, 322\nThompson, C., & Duncan, R. C. 2001, ApJ, 561, 980\nThompson, T. A., Chang, P., & Quataert, E. 2004, ApJ, 611, 380\nTroja, E., et al. 2007, ApJ, 665, 599\nUsov, V. V. 1992, Nature, 357, 472\nWheeler, J. C., Yi, I., Höflich, P., & Wang, L. 2000, ApJ, 537, 810\nWoods, P. M., & Thompson, C. 2006, \"Soft gamma repeaters and anomalous Xray pulsars: magnetar candidates\", Compact stellar X-ray sources, 547, eds.\nLewin, W. H. G. & van der Klis, M.\nWoosley, S. E. 1993, ApJ, 405, 273\nMing Xu, Yong-Feng Huang, Tan Lu . 2009, arXiv:0909.5318\nYu, Y., & Huang, Y.-F. 2007, Chinese Journal of Astronomy and Astrophysics,\n7, 669\nZhang, B., & Mészáros, P. 2001, ApJ, 552, L35\nZhang, B., & Mészáros, P. 2004, International Journal of Modern Physics A, 19,\n2385\nZhang, B., Fan, Y. Z., Dyks, J., Kobayashi, S., Mészáros, P., Burrows, D. N.,\nNousek, J. A., & Gehrels, N. 2006, ApJ, 642, 354\nZhang, B. 2007, Chinese Journal of Astronomy and Astrophysics, 7, 1\n\n\f"}