{"id": "http://arxiv.org/abs/0908.0598v1", "guidislink": true, "updated": "2009-08-05T06:54:47Z", "updated_parsed": [2009, 8, 5, 6, 54, 47, 2, 217, 0], "published": "2009-08-05T06:54:47Z", "published_parsed": [2009, 8, 5, 6, 54, 47, 2, 217, 0], "title": "Experimental Test of a Two-dimensional Approximation for Dielectric\n  Microcavities", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0908.3496%2C0908.1900%2C0908.2550%2C0908.0831%2C0908.2220%2C0908.3380%2C0908.3416%2C0908.0618%2C0908.3519%2C0908.2820%2C0908.0247%2C0908.1645%2C0908.2711%2C0908.4284%2C0908.0707%2C0908.3678%2C0908.0931%2C0908.1642%2C0908.2380%2C0908.4010%2C0908.1877%2C0908.3215%2C0908.3866%2C0908.4457%2C0908.3221%2C0908.2076%2C0908.2326%2C0908.2717%2C0908.3359%2C0908.2016%2C0908.2267%2C0908.1782%2C0908.2209%2C0908.3391%2C0908.3220%2C0908.0880%2C0908.2227%2C0908.4070%2C0908.4058%2C0908.1188%2C0908.4134%2C0908.2405%2C0908.0594%2C0908.3693%2C0908.4363%2C0908.1439%2C0908.3055%2C0908.1694%2C0908.0710%2C0908.2321%2C0908.2121%2C0908.0792%2C0908.0908%2C0908.3774%2C0908.2694%2C0908.3573%2C0908.0354%2C0908.1565%2C0908.2949%2C0908.1651%2C0908.3393%2C0908.2867%2C0908.2393%2C0908.1206%2C0908.3166%2C0908.0598%2C0908.4257%2C0908.3628%2C0908.0364%2C0908.0344%2C0908.3723%2C0908.2714%2C0908.2636%2C0908.3030%2C0908.3500%2C0908.0793%2C0908.4235%2C0908.4256%2C0908.0024%2C0908.3205%2C0908.2246%2C0908.3167%2C0908.2074%2C0908.3175%2C0908.3017%2C0908.0788%2C0908.2678%2C0908.0337%2C0908.3000%2C0908.4286%2C0908.0334%2C0908.2012%2C0908.0321%2C0908.3935%2C0908.3606%2C0908.3072%2C0908.0478%2C0908.1983%2C0908.0093%2C0908.0663%2C0908.1803&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Experimental Test of a Two-dimensional Approximation for Dielectric\n  Microcavities"}, "summary": "Open dielectric resonators of different shapes are widely used for the\nmanufacture of microlasers. A precise determination of their resonance\nfrequencies and widths is crucial for their design. Most microlasers have a\nflat cylindrical geometry, and a two-dimensional approximation, the so-called\nmethod of the effective index of refraction, is commonly employed for numerical\ncalculations. Our aim has been an experimental test of the precision and\napplicability of a model based on this approximation. We performed very\nthorough and accurate measurements of the resonance frequencies and widths of\ntwo passive circular dielectric microwave resonators and found significant\ndeviations from the model predictions. From this we conclude that the model\ngenerally fails in the quantitative description of three-dimensional dielectric\nresonators.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0908.3496%2C0908.1900%2C0908.2550%2C0908.0831%2C0908.2220%2C0908.3380%2C0908.3416%2C0908.0618%2C0908.3519%2C0908.2820%2C0908.0247%2C0908.1645%2C0908.2711%2C0908.4284%2C0908.0707%2C0908.3678%2C0908.0931%2C0908.1642%2C0908.2380%2C0908.4010%2C0908.1877%2C0908.3215%2C0908.3866%2C0908.4457%2C0908.3221%2C0908.2076%2C0908.2326%2C0908.2717%2C0908.3359%2C0908.2016%2C0908.2267%2C0908.1782%2C0908.2209%2C0908.3391%2C0908.3220%2C0908.0880%2C0908.2227%2C0908.4070%2C0908.4058%2C0908.1188%2C0908.4134%2C0908.2405%2C0908.0594%2C0908.3693%2C0908.4363%2C0908.1439%2C0908.3055%2C0908.1694%2C0908.0710%2C0908.2321%2C0908.2121%2C0908.0792%2C0908.0908%2C0908.3774%2C0908.2694%2C0908.3573%2C0908.0354%2C0908.1565%2C0908.2949%2C0908.1651%2C0908.3393%2C0908.2867%2C0908.2393%2C0908.1206%2C0908.3166%2C0908.0598%2C0908.4257%2C0908.3628%2C0908.0364%2C0908.0344%2C0908.3723%2C0908.2714%2C0908.2636%2C0908.3030%2C0908.3500%2C0908.0793%2C0908.4235%2C0908.4256%2C0908.0024%2C0908.3205%2C0908.2246%2C0908.3167%2C0908.2074%2C0908.3175%2C0908.3017%2C0908.0788%2C0908.2678%2C0908.0337%2C0908.3000%2C0908.4286%2C0908.0334%2C0908.2012%2C0908.0321%2C0908.3935%2C0908.3606%2C0908.3072%2C0908.0478%2C0908.1983%2C0908.0093%2C0908.0663%2C0908.1803&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Open dielectric resonators of different shapes are widely used for the\nmanufacture of microlasers. A precise determination of their resonance\nfrequencies and widths is crucial for their design. Most microlasers have a\nflat cylindrical geometry, and a two-dimensional approximation, the so-called\nmethod of the effective index of refraction, is commonly employed for numerical\ncalculations. Our aim has been an experimental test of the precision and\napplicability of a model based on this approximation. We performed very\nthorough and accurate measurements of the resonance frequencies and widths of\ntwo passive circular dielectric microwave resonators and found significant\ndeviations from the model predictions. From this we conclude that the model\ngenerally fails in the quantitative description of three-dimensional dielectric\nresonators."}, "authors": ["S. Bittner", "B. Dietz", "M. Miski-Oglu", "P. Oria Iriarte", "A. Richter", "F. Schäfer"], "author_detail": {"name": "F. Schäfer"}, "author": "F. Schäfer", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevA.80.023825", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0908.0598v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0908.0598v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "10 pages, 13 figures", "arxiv_primary_category": {"term": "physics.optics", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "physics.optics", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0908.0598v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0908.0598v1", "journal_reference": "Phys. Rev. A 80, 023825 (2009)", "doi": "10.1103/PhysRevA.80.023825", "fulltext": "Experimental Test of a Two-dimensional Approximation for Dielectric Microcavities\nS. Bittner,1 B. Dietz,1 M. Miski-Oglu,1 P. Oria Iriarte,1 A. Richter,1, 2, ∗ and F. Schäfer1\n\narXiv:0908.0598v1 [physics.optics] 5 Aug 2009\n\n1\n\nInstitut für Kernphysik, Technische Universität Darmstadt, D-64289 Darmstadt, Germany\n2\nECT*, Villa Tambosi, I-38050 Villazano (Trento), Italy\n(Dated: October 31, 2018)\n\nOpen dielectric resonators of different shapes are widely used for the manufacture of microlasers.\nA precise determination of their resonance frequencies and widths is crucial for their design. Most\nmicrolasers have a flat cylindrical geometry, and a two-dimensional approximation, the so-called\nmethod of the effective index of refraction, is commonly employed for numerical calculations. Our\naim has been an experimental test of the precision and applicability of a model based on this approximation. We performed very thorough and accurate measurements of the resonance frequencies\nand widths of two passive circular dielectric microwave resonators and found significant deviations\nfrom the model predictions. From this we conclude that the model generally fails in the quantitative\ndescription of three-dimensional dielectric resonators.\nPACS numbers: 42.55.Sa, 05.45.Mt, 42.60.Da\n\nI.\n\nINTRODUCTION\n\nOpen dielectric resonators are used in a large variety of applications, ranging from radio frequency and\nmillimeter-wave applications [1, 2] to microlasers [3, 4, 5].\nTherefore, accurate model predictions for their spectra\nand field distributions are of great interest. Especially\nmicrolasers have received much attention lately in optical telecommunication, as sensors or as billiard models\n[2, 5, 6, 7]. These devices typically consist of a flat cylindrical dielectric resonator with a cross section of arbitrary\nshape which contains the active medium. The resonators\nare usually made of semiconductor [4, 8, 9] or organic materials [10, 11, 12] and are sandwiched between two media\nof lower index of refraction like air or a substrate. The\nexact shape of the resonator is important in view of the\napplications, because it determines the emission properties like the directionality of radiation and the quality\nfactors of the resonances [13, 14, 15].\nIn general, even simple geometries like a flat dielectric\ndisk with a height much smaller than the planar extension cannot be solved analytically. Since the numerical solution of the three-dimensional (3D) vectorial\nMaxwell equations describing such resonators is complicated and computationally demanding, suitable approximations are favorable. One widely used approximation\nis the reduction of the full 3D Maxwell equations to a\ntwo-dimensional (2D), scalar Helmholtz equation by introducing a so-called effective index of refraction neff (see\ne.g. [16, 17, 18, 19]). This 2D-approximation seems natural due to the flat shape with large extension in the plane\nof the microlasers, but to our knowledge its validity and\nprecision has never been rigorously tested. The aim of\nthe work presented here is thus the comparison of the experimentally measured resonance frequencies and widths\nwith those calculated using this 2D-approximation, called\n\n∗ Electronic\n\naddress: richter@ikp.tu-darmstadt.de\n\nthe neff -model in the following.\nAlthough motivated by microlasers working in the infrared to the optical spectrum, our experimental setup\nconsists of a flat cylindrical microwave resonator made of\nTeflon (from the company Grünberg Kunststoffe GmbH).\nMicrowave experiments have distinct experimental advantages, and therefore are commonly used for the investigation of 2D quantum billiards [20, 21] and also 2D dielectric resonators [22]. The results from the microwave\nresonators can, however, be directly applied to microcavities by scaling. The plan of the present article is the\nfollowing. In section II, the concept of an effective index\nof refraction is introduced and section III explains how\ndielectric resonators are modeled with it. The experimental setup is detailed in section IV, and the experimental\ndata are compared to the model calculations for two disks\nof different thickness in sections V and VI. Finally, the\nresults are discussed in section VII.\n\nII.\n\nEFFECTIVE INDEX OF REFRACTION\n\nThe basic idea for the 2D-approximation is to treat the\nbulk of the resonator as a dielectric slab waveguide [23].\n\nFIG. 1: Geometry and notations for the infinite dielectric\nslab waveguide. The dielectric slab with index of refraction\nn and thickness b is extended indefinitely in the x-y-plane\nand surrounded by media with index of refraction n1 and n2 ,\nrespectively.\n\n\f2\nIt should be noted that qz is real for all solutions which\ncorrespond to modes confined inside the dielectric slab\nby total internal reflection with evanescent fields outside.\nz\nThe continuity condition for n2 (r)Ez and ∂E\n∂z at the inz\nterfaces at z = ±b/2 for TM-modes and Bz and ∂B\n∂z for\nTE-modes yields the condition [16]\n\u001a 2\nn qz : for TM\nkz tan (kz b/2) =\n.\n(5)\nqz : for TE\nExpressing the horizontal component γ of the wavevector\nin terms of the effective index of refraction neff , defined\nas\nneff = γ/k,\nFIG. 2: Effective index of refraction neff with respect to kb\nfor n = 1.434. The solid lines are the TE-modes, the dashed\nlines the TM-modes of various z-excitations. The dotted lines\nare the indices of refraction of Teflon and air, respectively.\n\nIn this section we will consider an infinite dielectric slab\nwaveguide, that is an infinite dielectric plate of thickness\nb with index of refraction n surrounded by media with\nlower indices of refraction n1,2 (see Fig. 1), and treat the\ncylindrical sidewalls of the resonator in the next section.\nThe surrounding media are assumed to be air (n1,2 =\n1) in the following. The waveguide is described by the\nvectorial Helmholtz equation\n\u001a\n\u001b\n\u0001 E\n∆ + n2 (r)k 2\n=0\n(1)\nB\n\nin Eq. (4) and Eq. (5) leads to the dispersion relation\n\u0013\n\u001b\n\u001a\n\u0012 r\nn2eff −1\n1\nkb/2 = √ 2 2\n+ ζπ/2\narctan ν n2 −n2\nn −neff\neff\n\u001a 2\n(7)\nn : for TMζ\nwith ν =\n1 : for TEζ\nfor neff with ζ = 0, 1, 2, . . . denoting the order of excitation in z-direction. Since in the following only TM0\nand TE0 modes are considered, we skip the index. Obviously, neff depends only on the index of refraction n and\non kb ∝ b/λ, that means on the ratio of the slab's thickness b to the wavelength λ. A plot of neff with respect to\nkb is shown in Fig. 2. The effective index of refraction is\nalways 1 ≤ neff ≤ n. Modes\nwith z-excitation ζ emerge\n√\nat the cutoff kb = ζπ/ n2 − 1.\nIII.\n\nwhere k = ω/c is the vacuum-wavenumber, ω the angular frequency and c the speed of light. The Helmholtz\nequation (1) can be simplified by separation of the variable parallel to the cylinder axis, z, from the x and y\nvariables. Different modes in the slab waveguide can be\ndistinguished by their polarization and their excitation\nperpendicular to the plane of the slab. Due to the slab\ngeometry all field modes are either related to Ez (TMpolarization) or to Bz (TE-polarization) [24]. The general ansatz for Ez respectively Bz is\n\u001a\na1 eikz z + a2 e−ikz z : |z| ≤ b/2\nΨ(x, y)e−iωt\n, (2)\na3 exp (−qz |z|)\n: |z| ≥ b/2\nand the constants ai are determined from the boundary\nconditions. The wave function Ψ satisfies the scalar, twodimensional Helmholtz equation\n(∆ + γ 2 )Ψ = 0,\n\n(3)\n\nwith γ being the horizontal component of the wavevector.\nThe vacuum-wavenumbers k and its vertical components\nkz inside the dielectric medium and qz outside are related\nby the dispersion relation\nγ 2 + kz2\nω2\n= k2 =\n= γ 2 − qz2 .\n2\nc\nn2\n\n(4)\n\n(6)\n\nAPPLICATION TO DIELECTRIC\nRESONATORS\n\nThe solution of neff is now inserted into Eq. (3), leading to the two-dimensional scalar Helmholtz equation\n(∆ + n2eff k 2 )Ψ = 0\n\n(8)\n\nwith Ψ corresponding to Ez (Bz ) for TM- (TE-) modes.\nThis equation correctly describes the propagation of electromagnetic waves inside an infinite dielectric slab. The\nnext step is to incorporate the cylindrical sidewalls of\nthe dielectric resonator in a plane perpendicular to the\ncylinder axis. In the 2D approximation this is achieved\nby considering the vertical walls as a part of an infinite\ndielectric cylinder with n = neff and imposing the corresponding boundary conditions [24], i.e. that fields inside\nand outside the resonator obey the Helmholtz equation\n\u001a\n−n2eff k 2 Ψin : r ∈ S\n∆Ψin,out =\n(9)\n−k 2 Ψout\n: r∈\n/ S.\nHere S is the domain of the resonator in a plane perpendicular to the cylinder axis, and the conditions along the\nboundary ∂S of S\nΨin |∂S = Ψout |∂S\n\nand μ\n\n∂Ψin\n∂n\n\n=\n∂S\n\n∂Ψout\n∂n\n\n(10)\n∂S\n\n\f3\nare imposed, with μ equal to 1 (1/n2eff ) for TM- (TE-)\nmodes and n being the unit vector normal to the surface. The set of equations (9) and (10) constitutes the\nquintessence of the neff -model. It correctly describes a\ntwo-dimensional dielectric resonator, i.e. the electromagnetic field is homogeneous in the z-direction, with index of refraction equal to neff , however, not a flat but\nthree-dimensional resonator. Indeed the full 3D Maxwell\nequations lead to additional boundary conditions if the\nelectromagnetic fields depend on z [19, 25], which couple\nthe TM- and TE-polarizations. Analytical calculations\nincorporating these have to our knowledge not yet been\nperformed. As has already been stated above, the aim\nof the present work is to test experimentally the applicability of the neff -model and to understand the order of\nmagnitude of deviations from the experiment.\nThe solutions of Eqs. (9) and (10) for a circular resonator\nwith radius R are given in cylindrical coordinates r and\nφ as\n(0)\n\nΨin (r, φ) = Ψin Jm (neff kr)e±imφ\n\n(11)\n\ninside the disk and as\n(0)\n\n±imφ\nΨout (r, φ) = Ψout H(1)\nm (kr)e\n\n(12)\n\noutside. Here, Jm (x) is a Bessel-function of the first kind,\n(1)\nHm (x) a Hankel-function of the first kind and m the\nazimuthal quantum number. All modes with m > 0 are\ndoubly degenerate. Applying the boundary conditions\n(Eq. (10)) leads to the quantization condition [26]\n(1)\n\nJ0 m (neff kR)\nH0 m (kR)\nμ neff\n,\n= (1)\nJm (neff kR)\nHm (kR)\n\n(13)\n\n(1)\n\nwhere J0 m (x) and H0 m (x) are the derivatives with respect to x. For each azimuthal quantum number m,\nthere is an infinite series of complex solutions km,nr ;\nnr = 1, 2, . . . is the radial quantum number. Since a dielectric resonator described by equations (9) and (10) is\nan open system, its modes have losses due to radiation.\nThese are determined by the imaginary part of km,nr ,\nand the quality factor Q of a mode is defined as\nQ=−\n\nRe(km,nr )\n.\n2 Im(km,nr )\n\nFIG. 3: Schematic side view of the experimental setup. The\nTeflon disk is hanging on three metal suspensions. Two dipole\nantennas protruding from an RF cable are placed close to the\nrim of the disk on opposite sides.\n\n(14)\n\nBecause of these losses, the solutions of Eq. (9) are called\nquasi-bound modes. They are identified as the poles of\nthe scattering matrix S describing the measurement process [3] - microwave power is coupled into the resonator\nvia an antenna, thereby exciting modes, and coupled out\nvia the same or another antenna - in the form of resonances in the frequency spectrum.\nThe quantization condition Eq. (13) is solved numerically, taking into account the dependence of neff on (the\nreal part of) k.\n\nFIG. 4: Sketches of the two antenna types. A dipole antenna is shown on the left, a curved antenna on the right.\nThe cylindrical sidewall of the Teflon disk is shown in gray in\nthe background. Both types of antennas are placed directly\nalongside the sidewall of the disk to obtain good coupling to\nthe resonator.\n\nIV.\n\nEXPERIMENTAL TECHNIQUE\n\nThe experimental setup is sketched in Fig. 3: The\nTeflon disk is hanging on three metal suspensions attached to the disk at the corners of an equilateral triangle, but otherwise surrounded only by air. Two antennas\nare put on opposite sides of the disk. The whole setup\nis placed in a thermostat to keep it at a fixed temperature. It should be noted that the perturbation of the\nresonator due to the attached suspensions leads to negligible changes of the resonance frequencies by less than\n2 % of the mean resonance spacing. The perturbations\ndue to the bending of the resonator under its own weight\nand the antennas are of the same order of magnitude.\nTwo different types of antennas (see Fig. 4) were used:\nvertical dipole antennas, which excite mainly TM-modes,\nand so-called curved antennas, which excite mainly TEmodes. The antennas may slightly lift the degeneracy of\nthe modes. A vectorial network analyzer (PNA N5230A\nby Agilent Technologies) is used to measure the scattering matrix element S21 (f ), where the modulus squared\nof S21 (f ) is the ratio\n|S21 (f )|2 =\n\nPout\nPin\n\n(15)\n\nbetween the power Pin coupled in by antenna 1 and the\npower Pout coupled out by antenna 2 for a given frequency f = ω/2π.\n\n\f4\n\nFIG. 5: Frequency spectrum of disk A measured with dipole antennas. The transmission amplitude, i.e. the modulus |S12 |, is\nshown with respect to the frequency. In the magnified part of the spectrum, the resonances are labeled with TM/TE (m, nr )\nto indicate their polarization as well as their azimuthal and radial quantum numbers m and nr , respectively. Two series of\nresonances can be seen here: The broader and larger resonances correspond to modes with TM-polarization and radial quantum\nnumber nr = 1, the sharper and smaller resonances to modes with TE-polarization and nr = 1. Resonances with nr > 1 can\nalso be seen at higher frequencies.\n\n7.94 GHz: TM (50, 1)\n\n13.80 GHz: TM (92, 2)\n\n14.33 GHz: TM (91, 3)\n\nFIG. 6: (Color online) Measured intensity distributions of three TM-modes with quantum numbers (m, nr ). A mode with\nazimuthal quantum number m and radial quantum number nr has 2m maxima in azimuthal direction and nr rings. Shown are\nmodes of whispering gallery type, as are all other identifiable modes. Therefore, intensities were measured only in the outer\nring of the resonator.\n\nTwo circular disks of different thickness b made of Teflon\nwere used in the experiments to investigate the dependence of the resonance frequencies on the thickness.\nDisk A has a radius of R = 274.8 mm and a thickness\nof b = 16.7 mm, and disk B of R = 274.9 mm and of\nb = 5.0 mm. A frequency of 10 GHz corresponds to\nkR ≈ 57.6, and kb ≈ 3.5 (disk A) and kb ≈ 1.0 (disk B),\nrespectively. The index of refraction was measured using\na split-cylinder resonator [27, 28] and is n = 1.434 ± 0.01\nfor disk A and n = 1.439 ± 0.01 for disk B. An example\n\nof a measured frequency spectrum of disk A (with dipole\nantennas) is shown in Fig. 5. It displays a superposition\nof several series of almost equidistant resonances, each\ncorresponding to modes with a fixed polarization and radial quantum number nr and ascending azimuthal quantum number m. The resonance spacing for each of these\nsubspectra is typically 120–130 MHz. This is illustrated\nin the lower part of Fig. 5. Within each subspectrum,\nthe width of the resonances decreases with increasing azimuthal quantum number. This can be explained within\n\n\f5\nthe ray picture [26]: A higher azimuthal quantum number corresponds to a higher angular momentum, and this\nto rays with a larger angle of incidence at the boundary,\nimplying lower radiation losses. As a consequence, different subspectra are distinguishable only above a certain\nfrequency and contribute below only to the background.\nThe dependence of the amplitude of a resonance on the\ntype of antenna used gives a hint at the polarization of\nthe mode. It was determined in addition with a perturbation technique: A metal plate was introduced parallel\nto the Teflon disk (with varying distance) leading to a\nshift of the resonance frequencies. Due to the different\nboundary conditions for TE- (Dirichlet for Bz ) and TM(Neumann for Ez ) modes at the metal plate the former\nare shifted to lower, the latter to higher frequencies with\ndecreasing distance between the metal plate and the disk.\nThe quantum numbers were determined from the intensity distributions, which were measured with the perturbation body method [29]. A cylinder made of magnetic\nrubber [30] was used as perturbation body and moved\nalong the surface of the disk, its height of 8 mm and\ndiameter of 4 mm being small compared to a vacuumwavelength of 30 mm at 10 GHz. Then the positioning\nof the perturbation body on the disk leads to a shift of\nthe resonance frequency which is proportional to the electric field intensity at its position. Three examples are\nshown in Fig. 6. All the measured modes are of whispering gallery mode type. As a result the resonances are\nonly slightly perturbed by the suspensions, since they are\nlocated well inside the caustic of the whispering gallery\nmodes. Accordingly, the intensities were measured only\nin the outer part of the disk. With the knowledge of the\npolarization and the quantum numbers, the measured\nresonance frequencies can be compared with those computed based on the neff -model (solutions of Eq. (13)).\n\nV.\n\nCOMPARISON OF MODEL AND\nEXPERIMENT FOR DISK A\n\nFigure 7 shows the difference between the measured resonance frequencies fexpt of disk A (b = 16.7 mm thick)\nand those calculated with Eq. (13), fcalc . In Fig. 7(a)\n(TE-modes), there are two series of data points for each\nradial quantum number nr because the degeneracy of\nthe modes is lifted by the curved antennas used in the\nmeasurement. The scattering of the data points of about\n±5 MHz in both graphs stems from problems with the determination of the resonance frequencies, either because\nthe resonances are badly shaped (at lower frequencies)\nor because of overlapping resonances (at higher frequencies). Some resonances are not detectable due to the\noverlap with others. The deviation between the measured\nand computed resonance frequencies is generally less than\n1 %. Still, these deviations of the model calculations from\nthe experimental data must be considered significant: A\ndeviation of 60 MHz is about half the resonance spacing between resonances with the same nr , and thus it is\n\n(a) TE-modes\n\n(b) TM-modes\n\nFIG. 7: Difference between measured (fexpt ) and calculated\n(fcalc ) resonance frequencies with respect to fexpt for disk\nA. The different symbols correspond to the different radial\nquantum numbers (×: nr = 1, ◦: nr = 2, +: nr = 3).\n(a) TE-modes: The range of azimuthal quantum numbers for\nnr = 1 is m = 37–148. For each nr , there are two series of\ndata points due to the break-up of the degenerate modes by\nthe curved antenna used in the measurement. The frequencies\nof the unperturbed system are approximately in between. (b)\nTM-modes: The range of azimuthal quantum numbers for\nnr = 1 is m = 39–150. The measurement was done with\ndipole antennas, and no break-up of degenerate modes was\nobserved.\n\nimpossible to correctly identify the different resonances\njust by a comparison with the model calculations. The\ndifference between the calculated and the measured resonance frequencies decreases with increasing frequency\nfor both polarizations and seems to reach a finite value\nin both cases. Interestingly, this value is different for\nTE- and TM-modes. Furthermore, the magnitude of the\ndeviations slightly depends on the radial quantum number, especially for the TE-modes. All this hints at a\nsystematic failure of the model, even in the semiclassical,\ni.e. high frequency limit, although the decrease of the\ndeviations with increasing frequency indicates that the\n\n\f6\n\n(a) TE-modes\n\nFIG. 8: Difference between measured (fexpt ) and calculated\n(fcalc ) resonance frequencies with respect to fexpt for the TEmodes of disk A. Results from three different calculations with\nthree different indices of refraction n = 1.432 (◦), 1.434 (×)\nand 1.436 (+) are shown only for resonances with nr = 1\nfor the sake of clarity. The difference fexpt − fcalc depends\nstrongly on n in the semiclassic limit, i.e. for high frequencies,\nbut only very slightly for low frequencies.\n\nneff -model is more accurate in the semiclassical regime.\nIt should be noted that the magnitude of deviations between model and experiment is extremely sensitive to the\nexact value of the index of refraction, which has been determined with an uncertainty ∆n = ±0.01. In order to\nillustrate that this accuracy is insufficient for an exact\ndetermination of the deviations, fexpt − fcalc is plotted in\nFig. 8 for calculations with three values of n, which differ by even less than ∆n. Only data points with nr = 1\nare shown, the data points for resonances with nr > 1\ngo along with them. The three calculations have a very\ndifferent behavior in the semiclassical limit, but roughly\nagree for low frequencies.\nIn a next step we considered the index of refraction n as a\nfit parameter - let's call it ñ - in Eq. (13), where ñ enters implicitly via neff , and varied it such that Eq. (13)\nyields the measured resonance frequencies. If the neff model provides a good description, the resulting values\nof ñ should scatter around the actual value of n. The\nresults are shown in Fig. 9. Almost all data points (except the ones at low frequencies) lie inside the error band\nn − ∆n, but they form three distinct curves for the three\nvalues of the radial quantum number nr . This provides\nfurther evidence for the failure of the neff -model: If the\nmodel were correct, the values of ñ would form a single\nline along the actual index of refraction n of the disk for\nboth polarizations and all three values of nr . It is known\nfrom literature (and was confirmed experimentally) that\nTeflon has negligible dispersion in this frequency range.\nIn conclusion the observed deviations between the model\nand the experiment cannot be attributed to a badly determined index of refraction, as it is impossible to achieve\nagreement between fexpt and fcalc in the whole frequency\nrange by choosing a fixed value of n. This is also true\n\n(b) TM-modes\n\nFIG. 9: Values of the index of refraction ñ for which Eq. (13)\nyields the measured resonance frequencies fexpt with respect\nto the measured resonance frequency for disk A. The upper\ngraph (a) shows the result for the TE-modes, the lower one\n(b) that for the TM-modes. The different symbols denote the\ndifferent radial quantum numbers (×: nr = 1, ◦: nr = 2, +:\nnr = 3). The solid line is the real index of refraction n of\nthe disk, the dashed line n − ∆n. The systematic deviation\nof the data points from the measured n shows the failure of\nthe neff -model.\n\nfor the other two parameters, the radius R and the thickness b, or combinations thereof. Thus we can exclude the\npossibility of badly determined parameters and inaccuracies in the measurement of the resonance frequencies and\nstate our main result: the neff -model does not correctly\ndescribe the measured resonance frequencies.\nFinally, the measured and calculated resonance widths\n(FWHM) are compared. The experimental resonance\nwidths Γexpt are obtained by fitting Lorentzians to the\nmeasured spectrum. They consist of three terms,\nΓexpt = Γrad + Γabs + Γant ,\n\n(16)\n\nwhere Γrad describes the losses due to radiation, Γabs\nthe losses due to absorption in the Teflon and Γant the\nloss of power due to the coupling to the antennas. The\n\n\f7\n\n(a) TE-modes\n\nFIG. 10: Measured (Γexpt ) and calculated (Γcalc ) resonance\nwidths for TM-modes of disk A. Both Γexpt and Γcalc are plotted as function of the measured resonance frequency fexpt .\nThe different symbols denote the measured widths for different radial quantum numbers (+: nr = 1, ×: nr = 2). The\ncalculated widths are plotted as curves (solid line for nr = 1,\ndashed for nr = 2) instead of data points to guide the eye.\n\ncalculated resonance widths\nΓcalc = −2c Im(k)/(2π)\n\n(17)\n\ninclude only the losses due to radiation (Γrad ). The measured and calculated widths of the TM-modes for disk A\nare shown in Fig. 10. For low frequencies (up to 8 GHz\nfor nr = 1 and up to 10.5 GHz for nr = 2), the calculated\nwidths are up to twice as large as the measured widths.\nSince Γcalc does not account for absorption and antenna\nlosses, the actual difference is even larger. For higher frequencies, the measured widths are larger than the calculated ones and saturate at a value of about 4 MHz. This\nsaturation is due to absorption in the Teflon material and\ncoupling to the antennas, and is approximately independent of the frequency. A precise comparison with the\ncalculated widths is generally not possible because the\nradiation losses Γrad cannot be extracted from the measured widths Γexpt . Nonetheless it can be stated that the\nwidths Γcalc predicted by the neff -model are too large at\nleast in some frequency ranges within the range of accuracy of the index of refraction n. It should also be noted\nthat Γcalc does not depend as sensitively on n as the\nresonance frequencies. For TE-modes, the same general\ntrend for Γexpt and Γcalc is found, although the difference\nbetween Γexpt and Γcalc is not as pronounced as for the\nTM-modes.\nVI.\n\nCOMPARISON OF MODEL AND\nEXPERIMENT FOR DISK B\n\nNext, we will compare the data of the second, thinner disk B (b = 5.0 mm) with the calculations based on\nthe neff -model. The discrepancy between experiment and\n\n(b) TM-modes\n\nFIG. 11: Difference between measured (fexpt ) and calculated\n(fcalc ) resonance frequencies with respect to fexpt for disk\nB. The different symbols correspond to the different radial\nquantum numbers (×: nr = 1, ◦: nr = 2, +: nr = 3).\nThe TE-modes measured with curved antennas are plotted in\ngraph (a) and have a range of azimuthal quantum numbers\nm = 64–188 for resonances with nr = 1. The TM-modes\nshown in graph (b) were measured with dipole antennas and\nhave azimuthal quantum numbers m = 97–204 for nr = 1.\nThe frequency range of identifiable TE- and TM-modes differs\ndue to the different quality factors and types of antennas used.\n\nmodel becomes apparent when comparing measured and\ncalculated resonance frequencies in Fig. 11 (like in Fig. 7\nfor disk A). The differences fexpt − fcalc seem to be larger\nfor disk B, but are of the same order of magnitude. However, in contrast to those for disk A, they increase with\nincreasing excitation frequency. In fact, this behavior depends sensitively on n; changing the value of n within the\nrange of accuracy leads to differences increasing, decreasing or reaching a finite value with increasing fexpt (see\nalso Fig. 8). In any case the deviations are larger than\nfor disk A at least for frequencies up to 20 GHz.\nLike in Fig. 9, the index of refraction ñ needed to reproduce the measured resonance frequencies with Eq. (13)\n\n\f8\n\n(a) TE-modes\n\nFIG. 13: Measured (Γexpt ) and calculated (Γcalc ) resonance\nwidths for the TE-modes of disk B. Both Γexpt and Γcalc\nare plotted with respect to the measured resonance frequency\nfexpt . The different symbols denote the measured widths for\ndifferent radial quantum numbers (×: nr = 1, ◦: nr = 2, +:\nnr = 3). The calculated widths are plotted as curves (solid\nline for nr = 1, dashed for nr = 2 and dot-dashed for nr = 3)\ninstead of data points to guide the eye.\n\n(b) TM-modes\n\nFIG. 12: Index of refraction ñ required to reproduce the measured resonance frequencies with Eq. (13) as a function of\nthe resonance frequency fexpt for disk B. Each symbol corresponds to a radial quantum number (×: nr = 1, ◦: nr = 2,\n+: nr = 3), the solid line denotes the index of refraction\nn = 1.439 of the disk and the dashed line n − ∆n the range of\naccuracy of its determination. Part (a) shows the data points\nfor the TE-modes and part (b) those for the TM-modes. The\ntrend of the curves is comparable to Fig. 9, but the deviations\nfrom n are even larger.\n\nis shown for nr = 1, 2, 3 in Fig. 12 with respect to the\nresonance frequency fexpt . Qualitatively, the curves are\nsimilar to those in Fig. 9: ñ grows with increasing frequency and seems to converge to some value depending\non the polarization, and ñ has a weak dependence on the\nradial quantum number nr of the modes. Compared to\nthe results for disk A shown in Fig. 9 the deviation of ñ\nfrom n seems to be even larger for the thinner disk B, and\nthose between the curves for different nr are more pronounced. Again, the systematic failure of the neff -model\nis clearly visible, and the discrepancies seem to be even\nlarger.\nThe comparison of calculated and measured resonance\nwidths for disk B is plotted in Fig. 13. Like in Fig. 10,\n\nthe measured widths Γexpt are significantly smaller than\nthe calculated widths Γcalc for the resonances with lower\nazimuthal quantum numbers, although the difference is\nnot quite as large as for the case of disk A. With increasing frequency, the measured widths saturate at a value\nof about 7 MHz, and a comparison with the calculated\nwidths is not possible because of the additional losses due\nto absorption and the antennas. The difference between\nΓexpt and Γcalc is smaller in the case of TM-modes, and\ngets smaller for both cases if a larger index of refraction\nn is assumed in the calculations. Still, it is definite that\nthe calculated widths are too large at least for some resonances.\n\nVII.\n\nCONCLUSIONS\n\nWe have measured the resonance frequencies and\nwidths of two different flat cylindrical dielectric microwave resonators. The quantum numbers and the polarization of the corresponding modes were identified.\nThese data were used to test the neff -model, a twodimensional approximation for flat dielectric resonators\nwith large planar extension normally used for the modeling of e.g. microlasers. A microwave resonator was chosen\nas testbed for several reasons: It is easy to handle due to\nits macroscopic dimensions which are known with high\nprecision, the measurement of intensity distributions enables a detailed understanding of the spectrum and the\nidentification of individual resonances, and it is a passive\nsystem which means that additional shifts of resonance\nfrequencies and widths due to the lasing process in an\nactive medium [31, 32] can be excluded.\n\n\f9\nIt was shown that the neff -model fails to correctly predict the resonance frequencies in a systematic way, and\nit has been checked carefully that the deviations between\nexperiment and calculations are not due experimental inaccuracies caused by e.g. the antennas or the suspensions.\nAlso, the resonance widths are clearly overestimated at\nleast in the lower frequency range. This is important because the widths (of the passive cavity) determine the lasing threshold in microlasers and play a crucial role with\nregard to mode-competition [31, 32]. Although the calculations based on the neff -model yield at least the correct\norder of magnitude for both resonance frequencies and\nwidths, a detailed understanding of the spectrum with\nhelp of these calculations is impossible. Furthermore, the\naccuracy of the model is not under control: The magnitude of the deviations between model and experiment\ncannot be precisely determined due to the uncertainty in\nthe index of refraction, and depends on the dimensions\nof the cavity and the frequency in a non-trivial way. It\nseems that deviations are larger for smaller values of kb,\ni.e. thinner resonators. We believe that the main reason\nfor the failure of the neff -model is the incorrect formulation of the boundary conditions (as in Eq. (10)). In\nthe rigorous treatment of the 3D Maxwell equations the\nz-components of the electric and magnetic fields are connected by the boundary conditions and cannot be considered separately as done in the neff -model [19, 25].\nThe large deviations between model and experiment observed for the circular disk are not due to the localization\nof the (whispering gallery) modes close to the boundary,\nand not expected to be smaller if modes supported by\nthe whole area of the disk were considered. In fact the\nmodes with lower nr are localized closer to the boundary (see Fig. 6), but the deviations are smaller than for\nmodes with higher nr . Even though the circular resonator is a special case and the test of the neff -model with\n\na non-circular geometry remains an open problem, it is\nstill worthwhile to consider it: the quasi-bound states of\nmany other non-circular resonators are also of whispering\ngallery mode type. Moreover, the circular resonator has\nmany important applications by itself [1, 2]. One of these\nis the precise measurement of the index of refraction over\na wide range of frequencies which, however, relies on a\nrigorous model for the resonance frequencies.\nIn summary, the comparison of the measured and computed resonance frequencies and widths clearly attests\nthe need of an improved neff -model, which takes into account the boundary conditions at the cylindrical sidewalls. We hope that this work will stimulate further research in this direction to obtain a reliable 2D model for\nthe computation of the resonance frequencies and widths\nof flat dielectric resonators. Although the numerical solution of the full three-dimensional Maxwell's equations\nis feasible for the circular resonator [33, 34, 35], it is computationally demanding, and even more so for other (viz.\nchaotic) geometries. Still, 3D numerical calculations for\nthe circular resonator would be helpful to validate our\ndata and investigate the accuracy of the neff -model in a\nbroader range of aspect ratios b/R and indices of refraction n.\n\n[1] G. Annino, M. Cassettari, I. Longo, and M. Martinelli,\nIEEE Transactions on Microwave Theory and Techniques\n45, 2025 (1997).\n[2] G. Annino, D. Bertollini, M. Cassettari, M. Fittipaldi,\nI. Longo, and M. Martinelli, J. Chem. Phys. 122, 2308\n(2000).\n[3] J. U. Nöckel and R. K. Chang, 2-d microcavities: Theory and experiments, Contribution for Cavity-Enhanced\nSpectroscopies, edited by Roger D. van Zee and John P.\nLooney (a volume of Experimental Methods in the Physical Sciences), Academic Press, San Diego (2002).\n[4] S. L. McCall, A. F. J. Levi, R. E. Slusher, S. J. Pearton,\nand R. A. Logan, Appl. Phys. Lett. 60, 289 (1992).\n[5] K. Vahala, ed., Optical Microcavities (World Scientific,\n2004).\n[6] E. Krioukov, D. J. W. Klunder, A. Driessen, J. Greve,\nand C. Otto, Opt. Lett. 27, 512 (2002).\n[7] A. M. Armani and K. J. Vahala, Opt. Lett. 31, 1896\n(2006).\n[8] D. Y. Chu, M. K. Chin, N. J. Sauer, Z. Xu, T. Y. Chang,\n\nand S. T. Ho, IEEE Photonics Technology Letters 5, 1353\n(1993).\nN. C. Frateschi and A. F. J. Levi, J. Appl. Phys. 80, 644\n(1996).\nM. Kuwata-Gonokami, R. H. Jordan, A. Dodabalapur,\nH. E. Katz, M. L. Schilling, and R. E. Slusher, Opt. Lett.\n20, 2093 (1995).\nR. C. Polson and Z. V. Vardeny, Appl. Phys. Lett. 85,\n1892 (2004).\nM. Lebental, J. S. Lauret, R. Hierle, and J. Zyss, Appl.\nPhys. Lett. 88, 031108 (2006).\nJ. U. Nöckel, A. D. Stone, and R. K. Chang, Opt. Lett.\n19, 1693 (1994).\nJ. U. Nöckel and A. D. Stone, Nature 385, 45 (1997).\nC. Gmachl, F. Capasso, E. E. Narimanov, J. U. Nöckel,\nA. D. Stone, J. Faist, D. L. Sivco, and A. Y. Cho, Science\n280, 1556 (1998).\nM. K. Chin, D. Y. Chu, and S.-T. Ho, J. Appl. Phys. 75,\n3302 (1994).\nH. C. Casey and M. B. Panish, Heterostructure Lasers\n\nAcknowledgments\n\nThe authors are grateful to E. Bogomolny for his original suggestion to investigate the validity of the neff -model\nexperimentally and to him and M. Hentschel for many\nintense discussions. F. S. acknowledges support from\nDeutsche Telekom Foundation. This work was supported\nby the DFG within the Sonderforschungsbereich 634.\n\n[9]\n[10]\n\n[11]\n[12]\n[13]\n[14]\n[15]\n\n[16]\n[17]\n\n\f10\n(Academic Press, 1978).\n[18] M. Lebental, N. Djellali, C. Arnaud, J.-S. Lauret, J. Zyss,\nR. Dubertrand, C. Schmit, and E. Bogomolny, Phys. Rev.\nA 76, 023830 (2007).\n[19] R. Dubertrand, E. Bogomolny, N. Djellali, M. Lebental,\nand C. Schmit, Phys. Rev. A 77, 013804 (2008).\n[20] A. Richter, in Emerging Applications of Number Theory,\nedited by D. A. Hejhal, J. Friedmann, M. C. Gutzwiller,\nand A. M. Odlyzko (Springer, New York, 1999), vol. 109\nof The IMA Volumes in Mathematics and its Applications, pp. 479–523.\n[21] H.-J. Stöckmann, Quantum Chaos: An Introduction\n(Cambridge University Press, Cambridge, England,\n2000).\n[22] R. Schäfer, U. Kuhl, and H.-J. Stöckmann, New Journal\nof Physics 8, 46 (2006).\n[23] C. Vassallo, Optical Waveguide Concepts (Elsevier, Amsterdam, 1991).\n[24] J. D. Jackson, Classical Electrodynamics (John Wiley &\nSons, Inc., New York, 1999).\n[25] H. G. L. Schwefel, A. D. Stone, and H. E. Tureci, J. Opt.\nSoc. Am. B 22, 2295 (2005).\n[26] M. Hentschel and K. Richter, Phys. Rev. E 66, 056207\n\n(2002).\n[27] M. Janezic, E. Kuester, and J. Jarvis, in Microwave Symposium Digest, 2004 IEEE MTT-S International (IEEE,\n2004), vol. 3, p. 1817.\n[28] G. Kent, IEEE Transactions on Microwave Theory and\nTechniques 36, 1451 (1988).\n[29] L. C. Maier and J. C. Slater, J. Appl. Phys. 23, 68 (1952).\n[30] E. Bogomolny, B. Dietz, T. Friedrich, M. Miski-Oglu,\nA. Richter, F. Schäfer, and C. Schmit, Phys. Rev. Lett.\n97, 254102 (2006).\n[31] T. Harayama, S. Sunada, and K. S. Ikeda, Phys. Rev. A\n72, 013803 (2005).\n[32] T. Harayama, P. Davis, and K. S. Ikeda, Phys. Rev. Lett.\n90, 063901 (2003).\n[33] J. Vuckovic, O. Painter, Y. Xu, and A. Yariv, A. Scherer,\nIEEE Journal of Quantum Electronics 35, 1168 (1999).\n[34] M. Ghulinyan, D. Navarro-Urrios, A. Pitanti, A. Lui,\nG. Pucker, and L. Pavesi, Opt. Express 16, 013218\n(2008).\n[35] Q. Song, H. Cao, S. T. Ho, and G. S. Solomon, Appl.\nPhys. Lett. 94, 061109 (2009).\n\n\f"}