{"id": "http://arxiv.org/abs/1204.2751v2", "guidislink": true, "updated": "2013-04-15T13:10:00Z", "updated_parsed": [2013, 4, 15, 13, 10, 0, 0, 105, 0], "published": "2012-04-12T15:14:23Z", "published_parsed": [2012, 4, 12, 15, 14, 23, 3, 103, 0], "title": "Do Hardy-type proposals test nonlocality of single-particle?", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1204.4359%2C1204.1881%2C1204.6100%2C1204.4628%2C1204.0396%2C1204.2252%2C1204.4831%2C1204.3645%2C1204.6739%2C1204.4851%2C1204.4609%2C1204.5030%2C1204.1031%2C1204.0831%2C1204.5005%2C1204.0695%2C1204.0092%2C1204.3464%2C1204.4345%2C1204.0758%2C1204.4846%2C1204.4624%2C1204.2976%2C1204.3983%2C1204.1582%2C1204.6256%2C1204.3538%2C1204.4866%2C1204.5686%2C1204.6310%2C1204.1323%2C1204.3653%2C1204.1760%2C1204.6591%2C1204.1499%2C1204.6687%2C1204.1854%2C1204.2250%2C1204.6094%2C1204.0401%2C1204.6441%2C1204.1920%2C1204.4176%2C1204.0054%2C1204.4227%2C1204.5621%2C1204.5848%2C1204.1911%2C1204.2928%2C1204.2758%2C1204.5771%2C1204.4429%2C1204.0704%2C1204.5651%2C1204.3417%2C1204.6363%2C1204.5193%2C1204.2666%2C1204.1486%2C1204.2463%2C1204.1795%2C1204.0911%2C1204.6666%2C1204.6075%2C1204.3475%2C1204.6643%2C1204.1254%2C1204.1145%2C1204.3835%2C1204.0700%2C1204.2102%2C1204.6600%2C1204.3225%2C1204.5626%2C1204.5288%2C1204.1985%2C1204.4296%2C1204.5205%2C1204.1818%2C1204.0780%2C1204.4672%2C1204.6174%2C1204.1725%2C1204.2234%2C1204.1203%2C1204.3815%2C1204.2751%2C1204.3586%2C1204.4061%2C1204.2724%2C1204.5228%2C1204.2272%2C1204.2096%2C1204.5342%2C1204.3501%2C1204.6274%2C1204.4598%2C1204.6101%2C1204.5266%2C1204.0459%2C1204.1933&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Do Hardy-type proposals test nonlocality of single-particle?"}, "summary": "It is argued that Hardy-type proposals assume either nonlocality at\ndetection, and then beg the question, or \"local empty waves\" (local hidden\nvariables), and then have to accept \"many worlds\" and cannot prove nonlocality.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1204.4359%2C1204.1881%2C1204.6100%2C1204.4628%2C1204.0396%2C1204.2252%2C1204.4831%2C1204.3645%2C1204.6739%2C1204.4851%2C1204.4609%2C1204.5030%2C1204.1031%2C1204.0831%2C1204.5005%2C1204.0695%2C1204.0092%2C1204.3464%2C1204.4345%2C1204.0758%2C1204.4846%2C1204.4624%2C1204.2976%2C1204.3983%2C1204.1582%2C1204.6256%2C1204.3538%2C1204.4866%2C1204.5686%2C1204.6310%2C1204.1323%2C1204.3653%2C1204.1760%2C1204.6591%2C1204.1499%2C1204.6687%2C1204.1854%2C1204.2250%2C1204.6094%2C1204.0401%2C1204.6441%2C1204.1920%2C1204.4176%2C1204.0054%2C1204.4227%2C1204.5621%2C1204.5848%2C1204.1911%2C1204.2928%2C1204.2758%2C1204.5771%2C1204.4429%2C1204.0704%2C1204.5651%2C1204.3417%2C1204.6363%2C1204.5193%2C1204.2666%2C1204.1486%2C1204.2463%2C1204.1795%2C1204.0911%2C1204.6666%2C1204.6075%2C1204.3475%2C1204.6643%2C1204.1254%2C1204.1145%2C1204.3835%2C1204.0700%2C1204.2102%2C1204.6600%2C1204.3225%2C1204.5626%2C1204.5288%2C1204.1985%2C1204.4296%2C1204.5205%2C1204.1818%2C1204.0780%2C1204.4672%2C1204.6174%2C1204.1725%2C1204.2234%2C1204.1203%2C1204.3815%2C1204.2751%2C1204.3586%2C1204.4061%2C1204.2724%2C1204.5228%2C1204.2272%2C1204.2096%2C1204.5342%2C1204.3501%2C1204.6274%2C1204.4598%2C1204.6101%2C1204.5266%2C1204.0459%2C1204.1933&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "It is argued that Hardy-type proposals assume either nonlocality at\ndetection, and then beg the question, or \"local empty waves\" (local hidden\nvariables), and then have to accept \"many worlds\" and cannot prove nonlocality."}, "authors": ["Antoine Suarez"], "author_detail": {"name": "Antoine Suarez"}, "author": "Antoine Suarez", "arxiv_comment": "4 pages, 1 figure. arXiv admin note: text overlap with\n  arXiv:0705.0322 by other authors", "links": [{"href": "http://arxiv.org/abs/1204.2751v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1204.2751v2", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "quant-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "quant-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1204.2751v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1204.2751v2", "journal_reference": null, "doi": null, "fulltext": "Do Hardy-type proposals test nonlocality of single-particle?\nAntoine Suarez\nCenter for Quantum Philosophy,\nCH-Berninastrasse 85, 8057 Zurich, Switzerland\nsuarez@leman.ch, www.quantumphil.org\n(Dated: April 15, 2013)\n\narXiv:1204.2751v2 [quant-ph] 15 Apr 2013\n\nIt is argued that Hardy-type proposals assume either nonlocality at detection, and then beg\nthe question, or \"local empty waves\", and then have to accept \"many worlds\" and cannot prove\nnonlocality.\n\nIntroduction.-In the 5th Solvay conference in 1927\nEinstein presented a simple single-particle gedankenexperiment showing that the idea of the quantum mechanical collapse of the wave function implies nonlocal\nactio at a distance and therefore conflicts with relativity.\nHowever after the Solvay conference Einstein withdrew\nfrom this argument to the more complicated EPR one he\npublished in 1935.[1]\nThe original 1927 Einstein's experiment has been recently done for the first time. The results demonstrate\nsingle-photon nonlocality at detection and in addition\nhighlight something Einstein did not explicitly mention:\nNonlocality at detection is necessary to have conservation\nof energy in each single quantum event [2, 3]. In other\nwords, on the basis of his 1927 argument Einstein could\nnot object to quantum mechanics without rejecting the\nconservation of energy. By contrast the EPR argument\n(1935) allowed him to argue against quantum mechanics\nwithout giving up the conservation of energy.\nIn this Letter I compare our experiment [2, 3] with the\nprobe of single-particle nonlocality proposed by Lucien\nHardy in 1994 [4], and improved thereafter by other\nauthors [5, 6]. I show that Hardy's proposal takes clearly\nfor granted the result of the experiment presented in\n[2, 3]. Therefore Hardy-type proposals either tacitly\nassume as an axiom the nonlocality they aim to prove, or\nthey assume the de Broglie's \"particle and empty wave\"\nas local hidden variables. This means that Hardy-type\nproposals rule out such local hidden variables (although\ncontrarily to Bell-type experiments without invoking\ninequalities), but do not prove nonlocality.\nHardy's proposal.-The argument is conceived as a\nladder of four gedanken-experiments using the scheme\nsketched in Figure 1 [4, 5]. Alice and Bob each have\ntwo choices, which lead to the four possible Experiments\n1-4 described below. The input state incident on s,\nand the corresponding coherent states incident on a and\nb are chosen in a way that quantum mechanics yields\nthe outcome predictions correspondingly listed to the\nfollowing Experiments 1-4 :\nExperiment 1 : Alice and Bob both decide to set a\ndetector on their paths u1 respectively u2 (dashed detec-\n\nFIG. 1: Hardy's scheme: Alice/Bob can either directly set\na detector on her/his path (dashed detectors), or she/he can\nmake a homodyne detection by combining her/his path with a\nlocal oscillator at a 50:50 beam splitter BS1 respectively BS2\n(solid detectors). The source (not represented) is supposed\nto be single-photon. The vacuum is incident on the mode t;\nthe input state is incident on mode s with no more than one\nphoton at any time; the coherent states incident on modes a\nand b act as local oscillators.\n\ntors).\nQuantum mechanical prediction: If Alice detects a particle on u1 , then she can infer that Bob detects nothing\non u2 , and viceversa, if Bob detects a particle on u2 , he\ncan infer that Alice detects nothing on u1 . (Notice that\nif Alice (Bob) detects nothing on u1 (u2 ), she (he) cannot\ninfer that Bob (Alice) detects a particle on u2 (u1 )).\nRegarding this Experiment 1 Hardy's argument states:\n\"In this case, it is clear that they cannot both detect\na photon since no more than one photon is emitted\nfrom the source at any time. This means that detecting\na particle on u1 and detecting a particle on u2 never\nhappens.\" [4, 5]\nExperiment 2 : Alice makes a homodyne detection at\nc1 and d1 , by combining the state on path u1 with a local\noscillator (coherent state) a, at her 50:50 beam splitter\nBS1. Bob, meanwhile, makes the same measurement as\nin Experiment 1.\nQuantum mechanical prediction: If Alice detects a\n\n\f2\nparticle at d1 and nothing at c1 , then Bob must detect\none particle.\nExperiment 3 : The roles of Alice and Bob are reversed:\nAlice sets her detector on path u1 and Bob makes a homodyne detection at c2 and d2 .\nQuantum mechanical prediction: if Bob detects one\nparticle at d2 and nothing at c2 , then he can infer that\nAlice must have detected a particle in path u1 .\nExperiment 4 : Both Alice and Bob choose to make\nhomodyne detections.\nQuantum mechanical prediction: According to quantum mechanics the experiment can have different\noutcomes. One of the possible ones is that Alice records\none particle at d1 and nothing at c1 , while Bob records\none particle at d2 and nothing at c2 .\nSuppose now the following reasoning: The result of\nExperiment 4 contradicts Experiment 1 : Indeed, according to Experiment 2 Alice infers from her measurement\nthat a single particle must have traveled along path u2\ntowards Bob. At least, this is true in the sense that, had\nBob put his detector in path u2 , he would have been\nguaranteed to detect a particle. However, according\nto Experiment 3, at the same time Bob infers from his\nmeasurement that a single particle must have traveled\nalong path u1 towards Alice. According to Experiment\n1 Alice and Bob cannot both be right.\nHardy pointed out that this reasoning does tacitly\nassume locality, and without this assumption the contradiction disappears: Alice might deduce from her\nresult that, had Bob measured the number of particles\nin path u2 , he would definitely have detected exactly\none. However, if Bob had measured u2 instead of the\nhomodyne measurement he did make, there might have\nbeen a nonlocal influence from Bob's end to Alice's\nend and then she might have obtained a different\nmeasurement outcome.[4, 5]\nHardy takes for granted the result of [2].-The\nfirst step of Hardy's ladder,i.e., Experiment 1, has clearly\nthe character of an axiom stating the principle of \"one\nphoton one count\", i.e., conservation of energy in each\nindividual quantum event, in the very same experiment\npresented in [2]. If one assumes that in this experiment\nthe outcome becomes determined at the detection [3],\nthen Hardy's axiom Experiment 1 would tacitly assume\nthe nonlocality at detection demonstrated in [2], and\nHardy's argument would assume just the nonlocality it\nsearches to prove.\nHardy-type experiments refute the de Broglie's\nlocal \"empty wave\" model.-Consequently to avoid\nbegging the question Hardy-type experiments have to as-\n\nsume that the outcome of the experiment in [2] is decided at the beam-splitter, and this means to accept de\nBroglie's \"local empty wave\" in order to be able of explaining the quantum mechanical predictions in interference experiments [3]. Consider the statement at the core\nof Hardy's argument:\n\"if Bob had measured u2 instead of the homodyne measurement he did make, there might have been a nonlocal\ninfluence from Bob's end to Alice's end and then she\nmight have obtained a different measurement outcome\".\nThis amounts to explain things as follows in terms of\ndecisions at the beam-splitters and local \"empty waves\":\nSuppose the empty wave travels along path u1 and\nthe particle along u2 . If these paths are not monitored,\nnonlocal coordination between the decisions at the beamsplitters BS1 and BS2 is possible and the result expected\nin Experiment 4 may appear. By contrast if Alice had\nput her detector on u1 , the \"empty wave\" traveling this\npath would not have reached BS1 and therefore the nonlocal coordination between the decisions at BS1 and BS2\nwould disappear. Consequently Bob would obtain a different result, that is one that does not allow him to conclude there is a particle on u1 .\nIn other words, what Hardy-type proposals test\nare models assuming outcome's decision at the beamsplitters with the particle leaving by one output port and\nthe corresponding \"empty wave\" by the alternative output port.[8] This means that a Hardy-type experiment\nwould refute such \"local hidden variables\" (particle and\nempty wave) not through an statistical result (like the\nconventional Bell-type experiments do), but through a\nsingle measurement like the GHZ argument does [7].\nHowever, as we will see in the following section, de\nBroglie's local \"empty wave\" model can be straightforwardly completed with additional particles and \"empty\nwaves\" to a deterministic and local version of the \"many\nworlds\" interpretation of quantum mechanics called\n\"parallel lives\", which is not refuted by either Hardy's\nargument or violation of Bell's inequalities.[10]\nFrom the local \"empty wave\" to local \"parallel\nlives\".-\"Empty waves\" are entities that exist and propagate within space-time but neither carry energy nor momentum, and are not directly accessible to general observation. \"Empty waves\" interact with the environment\nonly in a very selective and specific way - actually an\n\"empty wave\" does not interact with any particle (and\nfor this reason cannot be detected), but only with\"its\nparticle\".\nIf one accepts that at beam-splitter BS a particle P\nsplits into a transmitted particle P' (leaving by outputport T) and a reflected \"empty wave\" W' (leaving by\noutput-port R), one can as well assume that the split produces additionally the alternative outcome, that is, a second transmitted empty wave W* (leaving by output-port\nT) and a reflected particle P* (leaving by output-port R)\n\n\f3\nunder the following conditions: The particle&wave pair\n(P'&W') lives with a copy of Alice within a space-time\n\"bubble\" denoted Alice', and the pair (P*&W*) lives\nwith another copy of Alice within a parallel \"bubble\"\ndenoted Alice*; the \"bubbles\" Alice' and Alice* cannot\ninteract with each other; however in 2-particles entanglement experiments the bubble Alice' - containing the\noutcome (P'&W')A - may interact with (depending on\nthe experiment) either the bubble Bob' -containing the\noutcome (P'&W')B - or the bubble Bob* - containing\nthe outcome (P*&W*)B , and this way account for the\ncharacteristic quantum (EPR) correlations.\nThis is basically the explanation provided by the \"parallel lives\" interpretation, a version of \"many worlds\" recently proposed by Gilles Brassard and Paul RaymondRobichaud [10]. Both \"empty waves\" and \"parallel lives\"\nare based on the assumption that within space-time one\ncan have entities or regions that interact with the environment only in a selective and predetermined way.\nThe analysis by Brassard and Raymond-Robichaud\nshows the importance of the following Principle:\nAll that is in space-time is accessible to observation\n(except in the case of space-like separation).\nIf you are going to be consistent, you are only capable\nof opposing the \"many worlds\" and \"parallel lives\"\ninterpretations if you accept this Principle.\nRefutation of the local \"empty wave\" doesn't\nmean refutation of locality.-\"Parallel lives\" accounts for a unitary evolution of the quantum state and\nfor the quantum correlations invoking exclusively local\ncausality, i.e. causal links within the light cone.[10]\nTherefore \"parallel lives\" shows that the locality lost\nthrough refutation of local models based on outcomes\nconsisting of one couple \"particle & empty wave\" leaving\nthe beam-splitter, can easily be restored by simply improving the models with outcomes consisting of two couples \"particle & empty wave\". In other words, neither\nHardy's argument nor violation of Bell's inequalities rule\nout the local and deterministic model of \"parallel lives\".\n\"Many worlds\" was originally formulated by Hugh Everett in 1957 as an attempt to overcome quantum mechanical paradoxes like the \"Schrödinger cat\" derived\nfrom the \"measurement problem\". Nevertheless John\nBell suggested that the picture may have to do with nonlocality as well:\n\"The 'many world interpretation' seems to me an extravagant, and above all an extravagantly vague, hypothesis. I could also dismiss it as silly. And yet... It may\nhave something distinctive to say in connection with the\n'Einstein Podolsky Rosen puzzle', and it would be worthwhile, I think, to formulate some precise version of it to\nsee if this is really so.\" ([8] p. 194).\nWork by Lev Vaidman [9], and the more recent \"parallel lives\" interpretation by Gilles Brassard and Paul\nRaymond-Robichaud [10], show that \"many worlds\" has\n\nreally something distinctive to say in connection with\nthe \"EPR puzzle\": If one accepts de Broglie's \"empty\nwave\" it is impossible to oppose the \"many worlds\", and\ntherefore, refutation of de Broglie's local hidden variables\nmodel (be it by Hardy's argument or the violation of\nBell's inequalities) doesn't mean refutation of locality.\nThere is however a crucial difference between Hardy's\nargument and Bell's one. If one assumes that the outcome of a Hardy-type experiment (Figure 1) becomes\ndecided at detection (and therefore one disposes of the\nlocal \"empty wave\"), Hardy's argument cannot prove\nnonlocality without assuming the result of [2] as an axiom (\"Experiment 1\"), and therefore begs the question.\nBy contrast the experimental violation of Bell's inequalities refutes locality independently of the result of [2].\nNonetheless for the time being Bell-type experiments exhibit the detection loophole, and hence strictly speaking\nthe only to date loophole-free demonstration of nonlocality is the presented in [2]. In this context it is noteworthy\nas well that the only QKD available on the market to\ndate is based on the BB84 protocol, and this means on\nthe nonlocality proved in [2].\nWhether Hardy-type experiments can be considered\n\"single-particle\" ones is matter of debate [5, 11] (likely\nbecause the concept of \"single-particle experiment\" has\nnot been well defined). As a matter of fact Hardy-type\nexperiments use 4 detectors, like the Bell-type experiments (instead of only 2, like the experiment presented\nin [2, 3]). But in any case this issue is not of interest for\nthe sake of our discussion.\n\nConclusion.-In conclusion, Hardy-type experiments\neither assume the nonlocality they aim to prove, or assume the \"local empty wave\" and don't prove nonlocality. By contrast \"[the] nonlocality of a single particle\nexpressed by Einstein at the 1927 Solvay Conference\"\n[4, 5] is demonstrated by the experiment presented in [2].\nThe nonlocality this experiment proves [3] is more basic\nthan Bell's nonlocality and rules the whole quantum mechanics: It appears already at the level of single particle\nexperiments (requiring only 2 detectors), and not first in\nentanglement experiments involving 2 or more particles\n(requiring at least 4 detectors). This may open the road\nto deriving the \"abstract quantum algebra\" from principles with a clear physical content like free will, conservation of energy, and locality emergent from nonlocality\n[13].\nAcknowledgments: I am thankful to Antonio Acin,\nGilles Brassard, Thiago Gerreiro, Nicolas Gisin, Stefano\nPironio, Bruno Sanguinetti, and Hugo Zbinden for stimulating discussions.\n\n\f4\n\n[1] Guido Bacciagaluppi, Antony Valentini, Quantum Theory at the Crossroads: Reconsidering the 1927 Solvay\nConference. Part III: The proceedings of the 1927\nSolvay conference. Cambridge University Press, 2009.\narXiv:quant-ph/0609184v2 (2009)\n[2] T. Guerreiro, B. Sanguinetti, H. Zbinden, N.\nGisin and A. Suarez, Single-photon space-like antibunching. Phys Let A 376 (2012) 2174-2177.\nhttp://dx.doi.org/10.1016/j.physleta.2012.05.019.\narXiv:1204.1712v1 (2012).\n[3] A. Suarez, 'Empty waves\", \"many worlds\", \"parallel lives\", and nonlocal decision at detection,\narXiv:1204.1732 (2012); see also A. Suarez and P. Adams\n(Eds.) Is Science compatible with free will? Exploring\nfree will and consciousness in light of quantum physics\nand neuroscience. Springer, New York, 2012, Chapter 5.\n[4] L. Hardy, Nonlocality of a single photon revisited, Phys.\nRev. Let. 73,(1994) 2280\n[5] J. Dunningham and V. Vedral, Nonlocality of a single\nparticle, Phys. Rev. Let. 99, (2007) 180404-2\n[6] L. Heaney, A. Cabello, M. França Santos, and V. Vedral,\nExtreme nonlocality with one photon, arXiv:0911.0770v3\n(2011).\n\n[7] D. Greenberger, M. Horne, A. Zeilinger and M. Zukowski,\nA Bell Theorem Without Inequalities for Two Particles,\nUsing Inefficient Detectors, arXiv:quant-ph/0510207v2\n(2008).\n[8] J.S. Bell, Speakable and unspeakable in quantum mechanics, Cambridge: University Press, 1987.\n[9] Lev Vaidman, The Many-Worlds Interpretation of Quantum Mechanics. The Stanford Encyclopedia of Philosophy\n(Summer 2002 Edition), E. N. Zalta (ed.)\n[10] G. Brassard and P. Raymond-Robichaud, Can Free Will\nEmerge from Determinism in Quantum Theory? In: A.\nSuarez and P. Adams (Eds.) Is Science compatible with\nfree will? Exploring free will and consciousness in light of\nquantum physics and neuroscience. Springer, New York,\n2013, Chapter 4. arXiv:1204.2128v1.\n[11] D. Greenberger, M. Horne, A. Zeilinger, Nonlocality of a\nsingle photon? Phys. Rev. Let. 75, (1995) 2064\n[12] C.H. Bennett and G. Brassard, Quantum Cryptography:\nPublic Key Distribution and Coin Tossing, in: Proceedings of IEEE International Conference on Computers\nSystems and Signal Processing, Bangalore India (1984)\n175-179.\n[13] A. Suarez, Deriving Bells nonlocality from nonlocality at\ndetection. arXiv:1009.0698 (2010).\n\n\f"}