{"id": "http://arxiv.org/abs/1110.5426v1", "guidislink": true, "updated": "2011-10-25T07:46:04Z", "updated_parsed": [2011, 10, 25, 7, 46, 4, 1, 298, 0], "published": "2011-10-25T07:46:04Z", "published_parsed": [2011, 10, 25, 7, 46, 4, 1, 298, 0], "title": "A variational perspective on classical Higgs fields in gauge-natural\n  theories", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1110.2531%2C1110.6584%2C1110.1577%2C1110.1828%2C1110.3528%2C1110.1114%2C1110.3992%2C1110.2560%2C1110.2381%2C1110.5711%2C1110.3149%2C1110.0639%2C1110.5471%2C1110.3438%2C1110.5201%2C1110.5267%2C1110.1153%2C1110.4614%2C1110.1432%2C1110.0428%2C1110.0907%2C1110.3116%2C1110.3807%2C1110.2240%2C1110.2045%2C1110.0124%2C1110.3558%2C1110.6193%2C1110.6428%2C1110.4094%2C1110.6203%2C1110.2031%2C1110.5155%2C1110.6062%2C1110.1370%2C1110.1757%2C1110.0957%2C1110.4049%2C1110.3170%2C1110.4008%2C1110.6538%2C1110.4072%2C1110.5426%2C1110.6353%2C1110.0031%2C1110.0701%2C1110.3301%2C1110.6802%2C1110.2550%2C1110.5940%2C1110.5026%2C1110.2486%2C1110.2752%2C1110.2733%2C1110.5889%2C1110.3620%2C1110.3400%2C1110.3955%2C1110.3535%2C1110.5106%2C1110.0459%2C1110.0324%2C1110.1230%2C1110.6844%2C1110.4001%2C1110.5626%2C1110.0300%2C1110.0500%2C1110.1282%2C1110.3751%2C1110.6649%2C1110.0643%2C1110.4143%2C1110.0842%2C1110.1121%2C1110.6243%2C1110.5369%2C1110.4993%2C1110.4795%2C1110.4365%2C1110.6429%2C1110.3339%2C1110.3733%2C1110.2597%2C1110.1684%2C1110.4413%2C1110.3694%2C1110.4503%2C1110.0794%2C1110.2261%2C1110.1243%2C1110.5179%2C1110.3758%2C1110.5484%2C1110.6210%2C1110.2139%2C1110.4464%2C1110.0833%2C1110.0653%2C1110.0405%2C1110.3709&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "A variational perspective on classical Higgs fields in gauge-natural\n  theories"}, "summary": "Higgs fields on gauge-natural prolongations of principal bundles are defined\nby invariant variational problems and related canonical conservation laws along\nthe kernel of a gauge-natural Jacobi morphism.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1110.2531%2C1110.6584%2C1110.1577%2C1110.1828%2C1110.3528%2C1110.1114%2C1110.3992%2C1110.2560%2C1110.2381%2C1110.5711%2C1110.3149%2C1110.0639%2C1110.5471%2C1110.3438%2C1110.5201%2C1110.5267%2C1110.1153%2C1110.4614%2C1110.1432%2C1110.0428%2C1110.0907%2C1110.3116%2C1110.3807%2C1110.2240%2C1110.2045%2C1110.0124%2C1110.3558%2C1110.6193%2C1110.6428%2C1110.4094%2C1110.6203%2C1110.2031%2C1110.5155%2C1110.6062%2C1110.1370%2C1110.1757%2C1110.0957%2C1110.4049%2C1110.3170%2C1110.4008%2C1110.6538%2C1110.4072%2C1110.5426%2C1110.6353%2C1110.0031%2C1110.0701%2C1110.3301%2C1110.6802%2C1110.2550%2C1110.5940%2C1110.5026%2C1110.2486%2C1110.2752%2C1110.2733%2C1110.5889%2C1110.3620%2C1110.3400%2C1110.3955%2C1110.3535%2C1110.5106%2C1110.0459%2C1110.0324%2C1110.1230%2C1110.6844%2C1110.4001%2C1110.5626%2C1110.0300%2C1110.0500%2C1110.1282%2C1110.3751%2C1110.6649%2C1110.0643%2C1110.4143%2C1110.0842%2C1110.1121%2C1110.6243%2C1110.5369%2C1110.4993%2C1110.4795%2C1110.4365%2C1110.6429%2C1110.3339%2C1110.3733%2C1110.2597%2C1110.1684%2C1110.4413%2C1110.3694%2C1110.4503%2C1110.0794%2C1110.2261%2C1110.1243%2C1110.5179%2C1110.3758%2C1110.5484%2C1110.6210%2C1110.2139%2C1110.4464%2C1110.0833%2C1110.0653%2C1110.0405%2C1110.3709&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Higgs fields on gauge-natural prolongations of principal bundles are defined\nby invariant variational problems and related canonical conservation laws along\nthe kernel of a gauge-natural Jacobi morphism."}, "authors": ["M. Palese", "E. Winterroth"], "author_detail": {"name": "E. Winterroth"}, "author": "E. Winterroth", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1007/s11232-011-0082-2", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1110.5426v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1110.5426v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "10 pages", "arxiv_primary_category": {"term": "math-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "math-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "hep-th", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "math.MP", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1110.5426v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1110.5426v1", "journal_reference": "Theor. Math. Phys. 168(1) (2011) 1002-1008", "doi": "10.1007/s11232-011-0082-2", "fulltext": "arXiv:1110.5426v1 [math-ph] 25 Oct 2011\n\nA variational perspective on classical\nHiggs fields in gauge-natural theories ∗\nM. Palese and E. Winterroth\nDepartment of Mathematics, University of Torino\nVia C. Alberto 10, 10123 Torino, Italy\ne–mails: [marcella.palese, ekkehart.winterroth]@unito.it\n\nAbstract\nHiggs fields on gauge-natural prolongations of principal bundles are\ndefined by invariant variational problems and related canonical conservation laws along the kernel of a gauge-natural Jacobi morphism.\n2000 MSC: 58A20,58A32,58E30,58E40.\nkeywords: jet, gauge-natural bundle, conserved quantities, Cartan connection, Higgs field.\n\n1\n\nIntroduction\n\nIn 1981 D.J. Eck framed natural and gauge (classical) Lagrangian field theories within a geometric functorial construction, called a gauge-natural bundle,\nwhereby physical fields are assumed to be sections of bundles functorially associated with gauge-natural prolongations (also called Ehresmann prolongations\n[3]) of principal bundles, by means of left actions of Lie groups on manifolds,\nusually tensor spaces [2]. In fact, the study of jet prolongations of principal\nbundles with structure group a Lie group G has revealed of fundamental importance in Physics. Such a prolongation however, as well known, is not a\nprincipal bundle, while the structure of a principal bundle is given to the socalled gauge-natural prolongation of a principal bundle [3, 8]. More precisely,\nwe consider Lagrangian field theories which are assumed to be invariant with\n(r,k)\nrespect to the action of a gauge-natural group Wn G defined as the semidirect product of a k-th order differential group of the base manifold with the\ngroup of r-th order n-th velocities in G, with n = dim X is the dimension of\nthe basis manifold. Since the group Diff(X) is not canonically embedded into\nthe group Aut(P) of all automorphisms of the underling principal bundle P,\nthere is a priori no natural way of relating infinitesimal gauge transfomations\n∗ Research supported by the University of Torino, MiUR and partially (M.P.) by the University of Brno (CZ).\n\n1\n\n\fM. Palese and E. Winterroth\n\n2\n\nwith infinitesimal base transformations, so that Lie derivatives of a gauge field\nwith respect to infinitesimal base transformations could be defined neither in a\nnatural nor, at least a priori, in a canonical way.\nThe question of the existence of covariant canonically defined conserved currents is involved with such features of the Lie derivative [12]. It is a well known\nfact that the covariance of the Lagrangian and thus of the Euler-Lagrange equations does not guarantee the corresponding covariance of Noether conserved\nquantities. Generally speaking, the fixing of a linear connection on the base\nmanifold and of a principal connection on the principal bundle is needed in order to get covariant conserved quantities in gauge-natural field theories (a global\nPoincaré–Cartan form can be defined only by fixing such a couple of connections; see e.g. [6]). However, we found that a canonical determination of Noether\nconserved quantities, without fixing any connection a priori, is always possible\n(r,k)\non a reduced bundle of W (r,k) P determined by the original Wn G-invariant\nvariational problem. Connections can be characterized by means of such canonical reduction [4, 5, 26]. This is due to the fact that bundles of fields associated\nwith the class of principal bundles obtained as gauge-natural prolongations of\nprincipal bundles have a richer structure than the ones associated with principal\nbundles tout court.\nA variational problem on jets of fibered manifolds is invariant with respect to\nthe finite order contact structure induced by jets: we shall consider finite order\nLagrangian variational problems in terms of exterior differentials of forms modulo contact forms as framed in the context of finite order variational sequences\n[10]; moreover, in the category of variational sequences on gauge-natural bundles, the Lie derivative of sections of bundles is (up to a sign) the vertical part\nw.r.t. the contact structure (not the vertical component w.r.t. the projection\non the basis manifold) of gauge-natural lifts of infinitesimal principal automorphisms [13]. In a previous paper [14], we characterized in the framework of\nfinite order variational sequences the second variation of a gauge-natural invariant Lagrangian of arbitrary order and used this characterization to specialize the\nNoether theorems and corresponding conserved currents, as well as generalized\ncanonically defined Bergmann–Bianchi identities for the existence of superpotentials [1]. We tackled the problem of canonical covariance of conserved quantities by using variational derivatives taken with respect to generalized vector\nfields which are chosen to be Lie derivatives of sections of gauge-natural bundles,\ntaken w.r.t. gauge-natural lifts of infinitesimal principal automorphisms.\nThe problem of investigating conservation laws associated with a group of\ntranformations obtained by substituting the parameters with arbitrary functions\n(unendlichen kontinuierlichen Gruppe) was tackled in 1918 by Emmy Noether\n[18], who established, in this case, the existence of certain identity relations\nbetween Euler-Lagrange expressions and their derivatives as a consequence of\nthe invariance of a Lagrangian with respect to such a wider group of transformations (Noether identities). In 1956 Ryoyu Utiyama [23] considered some\nsystems of fields invariant under a certain group of transformations depending\non n parameters and, postulating the invariance of such systems under the wider\n\n\fM. Palese and E. Winterroth\n\n3\n\ngroup obtained substituting the parameters with a set of arbitrary functions,\nhe introduced a new field with a definite type of interaction with the original\nfields defined by a covariant derivative.\nIn this perspective, we shall consider the class of parametrized contact transformations defined by the gauge-natural functor: resorting to invariance properties, we define covariant derivatives of fields and new conservation laws, through\nthe construction of a principal connection, satisfying a certain additional condition. In particular, we characterize canonical covariant Lagrangian conserved\nquantities in classical field theory in terms of Higgs fields on such gauge principal bundles having the richer structure of a gauge-natural prolongation. Under\nthis perspective, topological conditions for the existence of a Cartan connection\non the principal bundle W (r,k) P turn out to be necessary conditions for the\nexistence of global solutions of Jacobi equations associated with the existence of\ncanonically defined global conserved quantities. As an outcome, the Lie derivative of fields is constrained and it is parametrized by a Higgs field h defined by\nthe space of Jacobi fields.\n\n2\n\nJacobi fields generating canonical conservation laws\n\nWe recall some useful concepts of prolongations; for details see e.g. [8, 21].\nLet Js Y of s–jet prolongations of (local) sections of a fibered manifold π :\ns\nY → X, with dim X = n and dim Y = n + m. The natural fiberings πs−1\nare\n∗\naffine fiberings inducing a natural splitting Js Y×Js−1 Y T Js−1 Y = Js Y×Js−1 Y\n(T ∗ X ⊕ V ∗ Js−1 Y) (see e.g. [10, 24]) which yields rising order decompositions:\ngiven a vector field Ξ : Js+1 Y → T Js+1 Y, T πss+1 ◦ Ξ = ΞH + ΞV , where\nΞH and ΞV are the horizontal and the vertical part of Ξ, respectively; for the\nexterior differential on Y, (πrr+1 )∗ ◦ d = dH + dV , where dH and dV are called\np\nthe horizontal and vertical differential, respectively; the sheaf splitting H(s+1,s)\nLp\np−t\np\nt\n∧Hs+1\n, where the sheaves H(s,q)\nand Hsp of horizontal forms\n= t=0 C(s+1,s)\np\np\ns\ns\nwith respect to the projections πq and π0 , respectively, while C(s,q)\n⊂ H(s,q)\nand\np\np\n∗\nC s ⊂ C(s+1,s) are contact forms, i.e. horizontal forms valued into Cs [Y]. We\n.\nput Hp,hs+1 = h(Λps ) for 0 < p ≤ n, where the projection on the summand of\nlesser contact degree h is the horizontalization.\nBy an buse of notation, denote by d ker h the sheaf generated by the presheaf\n.\nd ker h in the standard way. We set Θ∗s = ker h + d ker h. We have the variational\n∗\n∗\nsequence 0 → IRY → Vs , where Vs = Λ∗s /Θ∗s , which is an exact resolution of\n.\nthe constant sheaf IRY [10]. A section Edλ = En (λ) ∈ Vsn+1 is the generalized\nhigher order Euler–Lagrange type morphism associated with λ.\nLet P → X be a principal bundle with structure group G. For r ≤ k integers\n.\nconsider the gauge-natural prolongation of P given by W(r,k) P = Jr P×X Lk (X),\n(r,k)\nwhere Lk (X) is the bundle of k–frames in X [2, 8]; W\nP is a principal bundle\n(r,k)\nover X with structure group Wn G which is the semidirect product with\nrespect to the action of GLk (n) on Grn given by jet composition and GLk (n)\n\n\fM. Palese and E. Winterroth\n\n4\n\nis the group of k–frames in IRn . Here we denote by Grn the space of (r, n)(r,k)\nvelocities on G. Let F be a manifold and ζ : Wn G × F → F be a left action\n(r,k)\n(r,k)\nof Wn G on F. There is a naturally defined right action of Wn G on\n(r,k)\nW\nP × F so that we have in the standard way the associated gauge-natural\n.\nbundle of order (r, k): Yζ = W(r,k) P ×ζ F. All our considerations shall refer to\nY as a gauge-natural bundle as just defined.\nDenote now by A(r,k) the sheaf of right invariant vector fields on W(r,k) P.\nThe gauge-natural lift is defined as the functorial map G : Yζ ×X A(r,k) →\nd\n[(Φζ t )(y)]t=0 ,\nT Yζ : (y, Ξ̄) 7→ Ξ̂(y), where, for any y ∈ Yζ , one sets: Ξ̂(y) = dt\nand Φζ t denotes the (local) flow corresponding to the gauge-natural lift of Φt .\nSuch a functor defines a class of parametrized contact transformations. This\nmapping fulfils the following properties (see [8]): G is linear over idYζ ; we have\nT πζ ◦G = idT X ◦π̄ (r,k) , where π̄ (r,k) is the natural projection Yζ ×X A(r,k) → T X;\nfor any pair (Λ̄, Ξ̄) ∈ A(r,k) , G is a homomorphism of Lie algebras.\nThe Lie derivative is a fundamental geometric object providing information\non how solutions of Euler-Lagrange equations behave under the action of infinitesimal transformations (automorphisms) of the gauge-natural bundle. Let\nγ be a (local) section of Yζ , Ξ̄ ∈ A(r,k) and Ξ̂ its gauge-natural lift. Following\n[8] we define the generalized Lie derivative of γ along the vector field Ξ̂ to be\nthe (local) section £Ξ̄ γ : X → V Yζ , given by £Ξ̄ γ = T γ ◦ ξ − Ξ̂ ◦ γ. Due to\nthe functorial nature of Ξ̂, the Lie derivative of sections inherits some useful\nlinearity properties and, in particular, it is an homomorphism of Lie algebras.\nIn the view of Noether theorems, the interest of the Lie derivative of sections\nis due to the fact that, for any gauge-natural lift, we have Ξ̂V = −£Ξ̄ . In the\nfollowing we shall consider variational sequences on gauge-natural bundle Y.\n1\nLet η ∈ Cs1 ∧ C(s,0)\n∧ Hn,hs+1 and Ξ a vertical vector field; the morphism\n2s+1 ∗\nEjs Ξ⌋η = (πs+1\n) js Ξ⌋η + Fjs Ξ⌋η (with Fjs Ξ⌋η a local divergence) is a uniquely\n1\ndefined global section of C(2s,0)\n∧ Hn,h2s+1 (see [24]). Let λ be a Lagrangian, Ξ̂V\n.\na generalized variation vector field and η = hdLj2s Ξ̄V λ. Let us set χ(λ, Ξ̂V ) =\nEjs Ξ̂⌋η . By resorting to functorial linearity properties of Ξ̂ we define a linear\nmorphism, the gauge-natural generalized Jacobi morphism associated with the\n.\nLagrangian λ and the variation vector field Ξ̂V , J (λ, Ξ̂V ) = E*⌋χ(λ,Ξ̂V ) [13]. It\nturns out that J (λ, Ξ̂V ), the second variational derivative Ljs Ξ̄V Ljs Ξ̄V λ and the\n.\nHessian morphism H(λ, Ξ̂V ) = Ξ̂V ⌋En (Ξ̂V ⌋En (λ)) are all representatives of the\nsame equivalence class in a suitable variational sequence [14], thus characterizing\nJ (λ, Ξ̂V ) as a symmetric self-adjoint morphism. The relevance of this property\n.\nis concerned with important geometric aspects of the space K = ker J (λ, Ξ̂V ).\nwhich defines generalized gauge-natural Jacobi equations, the solutions of which\nwe call generalized Jacobi vector fields and characterize canonical covariant conserved quantities [12].\nIt is well known that the First Noether Theorem can be recasted by resorting\nto the variational Lie derivative of classes of forms represented the variational\n.\nsequence: Ljs Ξ λ = θ(λ, £Ξ̄ )+dH ǫ(λ, £Ξ̄ ), where we put θ(λ, £Ξ̄ ) = −£Ξ̄ ⌋En (λ)\n\n\fM. Palese and E. Winterroth\n\n5\n\nand ǫ(λ, £Ξ̄ ) is a Noether current. As usual, λ is defined a gauge-natural invariant Lagrangian if the gauge-natural lift (Ξ̂, ξ) of any vector field Ξ̄ ∈ A(r,k) is a\nsymmetry for λ, i.e. if Ljs Ξ̄ λ = 0. It is remarkable that, in general, Ljs Ξ̄V λ 6=\n0.\nAs already mentioned the existence of a canonical global superpotential for\nǫ(λ, £Ξ̄ ) relies on covariant Bergmann-Bianchi identities, which can be proved\nto exist canonically only along ker J (λ, Ξ̂V ) [13]. Owing to the fact that they\nare Noether identities associated with the invariance properties of the Euler–\nLagrange morphism En (θ), the kernel K, being the kernel of a Hamiltonian operator, can be characterized as a vector subbundle [14, 15]. It is relevant for the\ntheory of Lie derivative of gauge-natural fields that the intrinsic indeterminacy\nof conserved charges associated with gauge-natural symmetries of Lagrangian\nfield theories is in this way solved.\n\n3\n\nHiggs fields on gauge-natural bundle\n\nBy an abuse of notation, we denote by k the Lie algebra of generalized Jacobi\nvector fields. Let h be the Lie algebra of right-invariant vertical vector fields on\nW (r+4s,k+4s) P. Now, let us assume that global solutions of generalized gaugenatural Jacobi equations exist; the Lie algebra k is then characterized as Lie\nsubalgebra of h; the Jacobi morphism self-adjoint and k is of constant rank;\nthe split structure h = k ⊕ Im J is well defined and it is also reductive, being\n[k, Im J ] = Im J [16]. In particular, for each p ∈ W (r,k) P by denoting W ≡\nhp , K ≡ kp and V ≡ Im Jp we have the reductive Lie algebra decomposition\nW = K ⊕ V, with [K, V] = V. Notice that W is the Lie algebra of the Lie group\n(r,k)\nWn G.\nAs a consequence of the fact that K is a reductive Lie algebra of W, there\nexists an isomorphism between V ≡ ImJp and T X so that V turns out to be\nthe image of an horizontal subspace. Thus we caracterize a principal bundle\nQ → X, with dimQ = dimW, such that X = Q/K. The principal subbundle\nQ ⊂ W(r,k) P is such that K = Tq Q/K, where K is the (reduced) Lie group of\nthe Lie algebra K is a reduced principal bundle.\nIn the following we shall omit the orders of a gauge-natural prolongation to\nsimplyfy the notation. The Lie group K of the Lie algebra K is in particular a\nclosed subgroup of W G (k is a vector subbundle). We have the composite fiber\nbundle\nW P → W P/K → X ,\nwhere W P → W P/K is a pricipal bundle with structure group K and W P/K\n→ X is a fiber bundle associated with W P with typical fiber W G/K, on which\nthe structure group W G acts on the left. Thus W P/K = W P ×W G W G/K →\nX is a gauge-natural bundle functorially associated with W P × W G/K → X\nby the right action of W G. The left action of W G on W G/K is in accordance\nwith the reductive Lie algebra decomposition W = K ⊕ V, with [K, V] ⊂ V. In\nfact the vector space V = Im Jp = W/K carries the left action of W given by\n\n\f6\n\nM. Palese and E. Winterroth\n\nthe adjoint representation (since [K, V] ⊂ V we have also [W, V] = [K ⊕ V, V] =\n[K, V] ⊕ [V, V] ⊂ V).\nWe call a global section h : X → W P/K a gauge-natural Higgs field. Notice\nthat it is a vector field lying in the image of the Jacobi morphism (recall that\nW/K = V = Im Jp ), which in turn is an image of an horizontal subspace T X.\n.\nThe pull-back bundle Q = W P × h(X) ⊂ W P/K = W P × (h(X) ⊂\nW P/K\n\nW P/K\n\nW P ×W G W G/K) → X is a reduced principal subbundle of P. Notice that a\ngauge-natural Higgs field is a global section of Ĥp , with p ∈ Q.\nLet ω be a principal connection on W(r,k) P and ω̄ a principal connection\non the principal bundle Q i.e. a K-invariant horizontal distribution defining the\nvertical parallelism ω̄ : V Q → K in the usual and standard way. It defines\nthe splitting Tp Q ≃ω̄ K ⊕ Ĥp , p ∈ Q. Since K is a subalgebra of the Lie\nalgebra W and dimQ = dimW, it is defined a principal Cartan connection of\ntype W/K, that is a W-valued absolute parallelism ω̂ : T Q → W which is an\nhomomorphism of Lie algebras, when restricted to K; preserving Lie brackets\nif one of the arguments is in K, and such that it is an extension of the natural\nvertical parallelism, i.e. ω̂|V Q = ω̄. In [5] we defined ω̂ as the restriction to\nT Q of the natural vertical parallelism defined by a principal connection ω on\nW (r,k) P by means of the fundamental vector field mapping ω : V W (r,k) P → W.\nIt satisfies Hp ∩ Tp Q = ∅, with p ∈ Q and it is a connection on W(r,k) P =\n(r,k)\nQ ×K Wn G → X, thus a Cartan connection on Q → X with values in W.\nWe notice that it splits into the K-component which is a principal connection\nform on the K-manifold Q, and the V-component which is a displacement form.\n(r,k)\nIn fact, being K a reductive Lie subgroup of Wn G the principal Cartan\nconnection could be seen as a K-structure equipped with a principal connection\nform η = prK ◦ ω̂ on Q [17].\nA gauge-natural Higgs field, being a global section of Ĥp , with p ∈ Q, is\nrelated with the displacement form defined by the V-component of the Cartan\nconnection ω̂ above. The principal bundle W P (with Lie algebra of the structure\ngroup W) admits the principal subbundle Q (with Lie algebra of the structure\ngroup K); furthermore, the direct sum W = K ⊕ V is given, where V is a\nsubspace such that ad(g)(V) ⊂ V, g ∈ K. Then the pull-back by h of the K\nvalued component of a W valued pricipal connection ω on W P onto the reduced\nsubbundle Q is the connection form of a principal connection on Q [11].\nGiven the composite fiber bundle\nW P → W P/K → X ,\nwe have the exact sequence\n0 → VW P/K W P → V W P → W P ×W P/K V W P/K → 0 ,\nwhere VW P/K W P denote the vertical tangent bundle of W P → W P/K. Every\nconnection on the latter bundle determines a splitting\nV W P = VW P/K W P ⊕W P/K ω̃(W P ×W P/K V W P/K) .\n\n\f7\n\nM. Palese and E. Winterroth\n\nby means of which we can define the vertical covariant differential D : J 1 W P →\nT ∗ X⊗ W P VW P/K W P which is related with the covariant differential on W Ph\nrelative to the pull-back connection h∗ (ω̃).\n\n3.1\n\nHiggs fields and the Lie derivative of classical fields\n\nLet us now consider briefly, as a work example, the case of Lie derivative of spinor\nfields (this example as been exploited under this new perspective in [26, 15], then\nalso in [4] concerning canonical connections).\nOn a 4-dimensional manifold admitting Lorentzian structures (SO(1, 3)e reductions) X consider a SP IN (1, 3)e -principal bundle π : Σ → X and a bundle\nmap inducing a spin-frame on Σ given by Λ̃ : Σ → L(X) defining a metric g via\nthe reduced subbundle SO(X, g) = Λ̃(Σ) of L(X). A left action ρ of the group\nW (0,1) SP IN (1, 3)e on the manifold GL(4, IR) is given so that the associated\n.\nbundle Σρ = W (0,1) Σ ×ρ GL(4, IR) is is a gauge-natural bundle of order (0, 1),\nthe bundle of spin-tetrads θ [25]. The induced metric is gμν = θμa θνb ηab , where\nθμa are local components of a spin tetrad θ and ηab the Minkowski metric. Let\nso(1, 3) ≃ spin(1, 3) be the Lie algebra of SO(1, 3). One can consider the left\naction of W (1,1) SP IN (1, 3)e on the vector space (IR4 )∗⊗so(1, 3). The associated\n.\nbundle Σl = W (1,1) Σ ×l ((IR4 )∗ ⊗ so(1, 3)) is a gauge-natural bundle of order\n(1, 1), the bundle of spin-connections ω. If γ̂ is the linear representation of\nSP IN (1, 3)e on the vector space C4 induced by the choice of matrices γ we get\n.\na (0, 0)-gauge-natural bundle Σγ̂ = Σ ×γ̂ C4 , the bundle of spinors. A spinor\nconnection ω̃ is defined in a standard way in terms of the spin connection.\nIn the following the Einstein–Cartan Lagrangian will be the base preserving\nmorphism λEC : Σρ × J1 Σl → Λ4 T ∗ X, while the Dirac Lagrangian is the base\nX\n\npreserving morphism λD : Σρ × Σl × J1 Σγ̂ → Λ4 T ∗ X (local expressions can be\nX\n\nX\n\nfound e.g. in [6]). We assume that the total Lagrangian of a gravitational field\ninteracting with spinor matter is λ = λEC + λD .\nLet now Ξ̄ be a SP IN (1, 3)e -invariant vector field on Σ. The lagrangian λ is\ninvariant with respect to any lift Ξ̂ of Ξ̄ to the total space of the theory. By the\nFirst Noether Theorem a conserved Noether current ǫ(λ, Ξ̄) can be found such\n.\n1 ab\nΞ̄v ǫab , where Ξ̄av b =\nthat the corresponding superpotential is ν(λ, Ξ̄) = − 2k\na\na μ\nΞ̄b − ωbμ ξ is the vertical part of Ξ̄ with respect to the spin-connection ω.\nWe mentioned that, without the fixing of a connection a priori, the existence\nof canonical global conserved quantities in field theory is related with Noether\n ̃ [a b]\nidentities: in [26] we found that this implies Ξ̄ab\nv = −∇ ξ (the so-called Kos ̃\nmann lift [9]), where ∇ is the covariant derivative with respect to the standard\ntransposed connection on Σρ . The Kosmann lift can be characterized from a\nvariational point of view: it is the only gauge-natural lift which ensures the naturality condition Ljs+1 Ξ̂H [Ljs+1 Ξ̂V λ] ≡ 0 (Noether identities) holds true. Along\nsuch a lift not only the initial Lagrangian λ is by assumption invariant, but also\nits first variational derivative θ(λ, K) is it. On the other hand, the Lie derivative\nof spinor fields can be written in terms of a canonical spinor-connection ω̃ as\n\n\fM. Palese and E. Winterroth\n\n8\n\nfollows:\n1\n1\n£Ξ̄ ψ = ξ μ ∂μ ψ + Ξ̂h ab γ a γ b ψ − ∇[a ξb] γ a γ b ψ ,\n4\n4\nwhere Ξ̂h is the horizontal part of Ξ̂ with respect to the spinor-connection [4].\nIt is clear that we are here considering the reduction of the total principal\nbundle which is the underlying structure bundle of the theory. Each global\nsection h of W P/K → X (recall: K comes from gauge-natural Jacobi equations) enables one to define a vertical covariant differential, which is related\nwith the vertical differential defined by the principal connection on the total\ngauge-natural prolongation W P, thus also with spin and spinor connections induced functorially on the associated bundle, as just shown. We get out as an\noutcome that the Lie derivative of fields is constrained and it is parametrized\nby a Higgs field h defined by K. In particular, the Kosmann lift to the total\nbundle of tetrads and spinors is associated with a variational Higgs field on a\ngauge-natural bundle.\n\nReferences\n[1] P.G. Bergmann: Non-Linear Field Theories, Phys. Rev. 75 (4)(1949) 680–\n685.\n[2] D.J. Eck: Gauge-natural bundles and generalized gauge theories, Mem.\nAmer. Math. Soc. 247 (1981) 1–48.\n[3] C. Ehresmann: Les prolongements d'un espace fibré différentiable, C. R.\nAcad. Sci. Paris 240 (1955) 1755–1757.\n[4] M. Ferraris, M. Francaviglia, M. Palese, E. Winterroth: Canonical connections in gauge-natural field theories, Int. J. Geom. Methods Mod. Phys. 5\n(6) (2008) 973–988.\n[5] M. Ferraris, M. Francaviglia, M. Palese, E. Winterroth: Gauge-natural\nNoether currents and connection fields, Int. J. Geom. Methods Mod. Phys.,\nto appear.\n[6] L. Fatibene, M. Francaviglia: Natural and gauge natural formalism for\nclassical field theories. A geometric perspective including spinors and gauge\ntheories; Kluwer Academic Publishers, Dordrecht, 2003.\n[7] M. Godina, P. Matteucci: Reductive G-structures and Lie derivatives, J.\nGeom. Phys. 47 (1) (2003) 66–86.\n[8] I. Kolář, P.W. Michor, J. Slovák: Natural Operations in Differential Geometry, (Springer–Verlag, N.Y., 1993).\n[9] Y. Kosmann: Dérivée de Lie de spineurs, C. R. Acad. Sci. Paris Sér. A-B\n262 (1966) A289–A292; – Dérivée de Lie de spineurs. Applications, C. R.\nAcad. Sci. Paris Sér. A-B 262 (1966) A394–A397.\n\n\fM. Palese and E. Winterroth\n\n9\n\n[10] D. Krupka: Variational Sequences on Finite Order Jet Spaces, Proc. Diff.\nGeom. and its Appl. (Brno, 1989); J. Janyška, D. Krupka eds.; World\nScientific (Singapore, 1990) 236–254.\n[11] L. Mangiarotti, G. Sardanashvily: Connections in Classical and Quantum\nField Theory, (World Scientific, Singapore, 2000).\n[12] M. Palese, E. Winterroth: Covariant gauge-natural conservation laws, Rep.\nMath. Phys. 54 (3) (2004) 349–364.\n[13] M. Palese, E. Winterroth: Global Generalized Bianchi Identities for Invariant Variational Problems on Gauge-natural Bundles, Arch. Math. (Brno)\n41 (3) (2005) 289–310.\n[14] M. Palese, E. Winterroth: The relation between the Jacobi morphism and\nthe Hessian in gauge-natural field theories, Theoret. Math. Phys. 152(2)\n(2007), 1191–1200.\n[15] M. Palese, E. Winterroth: Noether identities in Einstein–Dirac theory and\nthe Lie derivative of spinor fields, Proc. Diff Geom. Appl., Olomouc (2007),\nWorld Scientific Publ., Hackensack, NJ, (2008) 643–653.\n[16] M. Palese, E. Winterroth: Lagrangian reductive structures on gaugenatural bundles, Rep. Math. Phys. 62 (2) (2008) 229–239.\n[17] M. Palese, E. Winterroth: Invariant variational problems and Cartan connections on gauge-natural bundles, AIP Conf. Proc. 1191 (2009) 160–165.\n[18] E. Noether: Invariante Variationsprobleme, Nachr. Ges. Wiss. Gött., Math.\nPhys. Kl. II (1918) 235–257.\n[19] G. Sardanashvily: On the geometry of spontaneous symmetry breaking. J.\nMath. Phys. 33 (1992), no. 4, 15461549.\n[20] G. Sardanashvily: Geometry of classical Higgs fields. Int. J. Geom. Methods\nMod. Phys. 3 (2006), no. 1, 139148.\n[21] D.J. Saunders: The Geometry of Jet Bundles, Cambridge Univ. Press\n(Cambridge, 1989).\n[22] A. Trautman: Noether equations and conservation laws, Comm. Math.\nPhys. 6 (1967) 248–261.\n[23] R. Utiyama: Invariant Theoretical Interpretazion of Interaction, Phys. Rev.\n101 (5) (1956) 1597–1607.\n[24] R. Vitolo: Finite Order Lagrangian Bicomplexes, Math. Proc. Camb. Phil.\nSoc. 125 (1) (1999) 321–333.\n[25] S. Weinberg: Gravitation and cosmology: principles and applications of the\ngeneral theory of relativity, Wiley, New York, 1972.\n\n\fM. Palese and E. Winterroth\n\n10\n\n[26] E.H.K. Winterroth: Variational derivatives of gauge-natural invariant Lagrangians and conservation laws, PhD thesis University of Torino, 2007.\n\n\f"}