{"id": "http://arxiv.org/abs/1106.0599v2", "guidislink": true, "updated": "2011-06-17T13:53:04Z", "updated_parsed": [2011, 6, 17, 13, 53, 4, 4, 168, 0], "published": "2011-06-03T09:54:33Z", "published_parsed": [2011, 6, 3, 9, 54, 33, 4, 154, 0], "title": "Research on the visitor flow pattern of Expo 2010", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1106.1649%2C1106.4796%2C1106.3543%2C1106.5187%2C1106.3729%2C1106.5623%2C1106.4795%2C1106.2175%2C1106.3196%2C1106.3505%2C1106.0599%2C1106.0901%2C1106.0628%2C1106.3056%2C1106.3880%2C1106.4515%2C1106.4887%2C1106.5039%2C1106.6117%2C1106.6004%2C1106.2404%2C1106.3010%2C1106.2963%2C1106.0838%2C1106.0737%2C1106.0809%2C1106.4555%2C1106.1307%2C1106.2292%2C1106.2064%2C1106.4624%2C1106.6078%2C1106.5719%2C1106.3810%2C1106.5209%2C1106.5211%2C1106.5827%2C1106.1554%2C1106.6345%2C1106.3045%2C1106.5497%2C1106.4481%2C1106.0640%2C1106.1431%2C1106.0399%2C1106.3209%2C1106.3974%2C1106.3332%2C1106.4658%2C1106.1436%2C1106.3459%2C1106.3414%2C1106.2020%2C1106.3486%2C1106.5713%2C1106.3620%2C1106.2781%2C1106.0182%2C1106.5805%2C1106.4321%2C1106.1902%2C1106.3174%2C1106.4249%2C1106.3385%2C1106.0149%2C1106.3029%2C1106.2009%2C1106.1128%2C1106.2555%2C1106.4752%2C1106.0711%2C1106.4571%2C1106.4813%2C1106.3229%2C1106.4542%2C1106.3765%2C1106.1935%2C1106.0638%2C1106.2809%2C1106.3350%2C1106.5316%2C1106.2265%2C1106.2979%2C1106.3430%2C1106.5680%2C1106.0243%2C1106.1531%2C1106.6222%2C1106.3429%2C1106.2055%2C1106.5142%2C1106.2590%2C1106.4899%2C1106.3228%2C1106.6271%2C1106.0868%2C1106.5208%2C1106.1944%2C1106.2821%2C1106.3763%2C1106.1601&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Research on the visitor flow pattern of Expo 2010"}, "summary": "Expo 2010 Shanghai China was a successful, splendid and unforgettable event,\nremaining us with valuable experiences. The visitor flow pattern of Expo is\ninvestigated in this paper. The Hurst exponent, mean value and standard\ndeviation of visitor volume prove that the visitor flow is fractal with\nlong-term stability and correlation as well as obvious fluctuation in short\nperiod. Then the time series of visitor volume is converted to complex network\nby visibility algorithm. It can be inferred from the topological properties of\nthe visibility graph that the network is scale-free, small-world and\nhierarchically constructed, conforming that the time series are fractal and\nclose relationship exit between the visitor volume on different days.\nFurthermore, it is inevitable to show some extreme visitor volume in the\noriginal visitor flow, and these extreme points may appear in group to a great\nextent.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1106.1649%2C1106.4796%2C1106.3543%2C1106.5187%2C1106.3729%2C1106.5623%2C1106.4795%2C1106.2175%2C1106.3196%2C1106.3505%2C1106.0599%2C1106.0901%2C1106.0628%2C1106.3056%2C1106.3880%2C1106.4515%2C1106.4887%2C1106.5039%2C1106.6117%2C1106.6004%2C1106.2404%2C1106.3010%2C1106.2963%2C1106.0838%2C1106.0737%2C1106.0809%2C1106.4555%2C1106.1307%2C1106.2292%2C1106.2064%2C1106.4624%2C1106.6078%2C1106.5719%2C1106.3810%2C1106.5209%2C1106.5211%2C1106.5827%2C1106.1554%2C1106.6345%2C1106.3045%2C1106.5497%2C1106.4481%2C1106.0640%2C1106.1431%2C1106.0399%2C1106.3209%2C1106.3974%2C1106.3332%2C1106.4658%2C1106.1436%2C1106.3459%2C1106.3414%2C1106.2020%2C1106.3486%2C1106.5713%2C1106.3620%2C1106.2781%2C1106.0182%2C1106.5805%2C1106.4321%2C1106.1902%2C1106.3174%2C1106.4249%2C1106.3385%2C1106.0149%2C1106.3029%2C1106.2009%2C1106.1128%2C1106.2555%2C1106.4752%2C1106.0711%2C1106.4571%2C1106.4813%2C1106.3229%2C1106.4542%2C1106.3765%2C1106.1935%2C1106.0638%2C1106.2809%2C1106.3350%2C1106.5316%2C1106.2265%2C1106.2979%2C1106.3430%2C1106.5680%2C1106.0243%2C1106.1531%2C1106.6222%2C1106.3429%2C1106.2055%2C1106.5142%2C1106.2590%2C1106.4899%2C1106.3228%2C1106.6271%2C1106.0868%2C1106.5208%2C1106.1944%2C1106.2821%2C1106.3763%2C1106.1601&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Expo 2010 Shanghai China was a successful, splendid and unforgettable event,\nremaining us with valuable experiences. The visitor flow pattern of Expo is\ninvestigated in this paper. The Hurst exponent, mean value and standard\ndeviation of visitor volume prove that the visitor flow is fractal with\nlong-term stability and correlation as well as obvious fluctuation in short\nperiod. Then the time series of visitor volume is converted to complex network\nby visibility algorithm. It can be inferred from the topological properties of\nthe visibility graph that the network is scale-free, small-world and\nhierarchically constructed, conforming that the time series are fractal and\nclose relationship exit between the visitor volume on different days.\nFurthermore, it is inevitable to show some extreme visitor volume in the\noriginal visitor flow, and these extreme points may appear in group to a great\nextent."}, "authors": ["Chao Fan", "Jin-Li Guo"], "author_detail": {"name": "Jin-Li Guo"}, "author": "Jin-Li Guo", "arxiv_comment": "12 pages", "links": [{"href": "http://arxiv.org/abs/1106.0599v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1106.0599v2", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "physics.soc-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "physics.soc-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "cs.SI", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "stat.AP", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1106.0599v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1106.0599v2", "journal_reference": "Chin. Phys. B 2012 21(7) 070209", "doi": null, "fulltext": "arXiv1106.0599v2 [physics.soc-ph] Jun 2011\n\nResearch on the visitor flow pattern of Expo 2010\nChao Fan1, Jin Li Guo2,3,*\n1. College of Arts and Sciences, Shanxi Agricultural University, Shanxi, Taigu, 030801, PRC\n2. Business School, University of Shanghai for Science and Technology, Shanghai, 200093, PRC\n3. Quantitative Economic Research Center of Shaanxi Province, Xi'an, 710127, PRC\n\nAbstract:\nExpo 2010 Shanghai China was a successful, splendid and unforgettable event,\nremaining us with valuable experiences. The visitor flow pattern of Expo is\ninvestigated in this paper. The Hurst exponent, mean value and standard deviation of\nvisitor volume prove that the visitor flow is fractal with long-term stability and\ncorrelation as well as obvious fluctuation in short period. Then the time series of\nvisitor volume is converted to complex network by visibility algorithm. It can be\ninferred from the topological properties of the visibility graph that the network is\nscale-free, small-world and hierarchically constructed, conforming that the time series\nare fractal and close relationship exit between the visitor volume on different days.\nFurthermore, it is inevitable to show some extreme visitor volume in the original\nvisitor flow, and these extreme points may appear in group to a great extent.\n\nKey words:\nVisitor flow, visibility graph, complex network, time series, Expo\n\n*\n\nCorresponding author: phd5816@163.com.\n1\n\n\farXiv1106.0599v2 [physics.soc-ph] Jun 2011\n1. Introduction\nFrom May 1st to October 31st, Expo 2010 was successfully held in Shanghai\nChina. Given its theme \"Better City, Better Life\", Expo 2010 was expected to be a\n\"successful, splendid and unforgettable\" event and a platform for every exhibitor to\nexplore sustainable models of urban development and better city life. During the 6\nmonths of exhibition, 246 nations or organizations participated in this event which\nbrought over 73 millions of visitors. Both the exhibition scale and total visitor volume\nhit the world record. How to manage so many visitors in such a small area and long\nperiod is a problem worth consideration.\nBesides Expo, various kinds of fairs, expositions, sports meetings and large\nconferences are held all over the world every year. The successful experiences of\nExpo 2010 may provide references for the visitor management of such large-scale\nactivities. Unfortunately, we hardly find any work about this worth concern. To\nsummarize the valuable experience of Expo 2010, we investigated the visitor flow\npattern through statistic analysis and complex network analysis.\nComplex network theory [1-3] is a new branch in statistical physics to describe\ncomplex systems with networks, in which the nodes and edges represent the entities\nand the relationships between them respectively. It can be used to describe many\nnetworks in the real world such as social network, transportation network, protein\ninteraction network, and so on. Recently, several efforts have been made to bridge\ntime series and complex networks [4-6]. Among all the methods, the so-called\nvisibility graph algorithm [6] proposed by Lacasa et al., attracted much attention for\nits simplicity and high efficiency, and a set of achievements have been obtained\nthrough it [7-10]. In our research, the Expo visitor flow pattern is studied mainly by\nnetwork analysis and the network is obtained through the visibility algorithm.\nThis paper is organized as follows: Firstly, data source and overview are given in\nsection 2. In section 3, the general statistical properties of Expo daily visitor volume\nare studied to find the stability and fluctuation feature of the visitor flow. After that,\nthe time series of visitor volume are converted to complex network by visibility graph\nalgorithm in section 4, and then some topological parameters are calculated to\n2\n\n\farXiv1106.0599v2 [physics.soc-ph] Jun 2011\ninvestigate the correlation between each data point of visitor volume. Finally, some\nconclusions and discussions are given in section 5.\n\n2. Data specification\nThe data used in this paper are collected from the official Website of Expo 2010\nShanghai China (http://www.expo2010.cn). We take the amount of daily visitors as\nthe observation of time series to study the visitor flow pattern of Expo 2010. During\nthe exhibition period of 184 days, there are approximately 73,091,000 visitors in total\nand 397,234 visitors on average. Figure 1 below exhibits the general fluctuation\npattern within which the horizontal axis represents the time (day) and the left and\nright vertical axes represent daily and accumulative visitor volume of Expo 2010\nrespectively.\n\nFig.1: (Color on line) Daily and accumulative visitor volume ( ×105 ) of Expo 2010\n\n3. The general feature of Expo visitor flow\nThe Hurst exponent, namely, long-range correlation exponent is used as a\nmeasure of the long term memory of time series, i.e. the autocorrelation of the time\nseries, and it has been extensively used in many fields such as the stock market. The\ncloser H gets to 0.5, the more noise and fluctuation there will be in the time series.\nMeanwhile, when H deviates more from 0.5 and tends towards 1, the time series\nwill be more regular and persistent. Conversely, the time series are deemed to be\nanti-persistent when H clines to 0.\n3\n\n\farXiv1106.0599v2 [physics.soc-ph] Jun 2011\nIn this section, we use the method of Rescaled Range Analysis [11, 12] to obtain\nthe Hurst exponent of time series. The result is that the Hurst exponent of whole\nperiod daily visitor flow is 0.856 with R 2 = 0.985 . It can be concluded that the visitor\nflow of Expo don't obey random walk but exhibit long-term stability and correlation\ndue to that the Hurst exponent surpasses 0.5. The deviations of the visitor flow in the\nfuture tend to keep the same sign like the past.\nTable 1 Mean value and standard deviation ( ×103 ) of visitor volume of Expo 2010\nPeriod\n\nMay.\n\nJun.\n\nJul.\n\nAug.\n\nSept.\n\nOct.\n\nTotal\n\nMean value\n\n259.2\n\n436.9\n\n444.8\n\n401.9\n\n333.6\n\n506.3\n\n397.2\n\nStandard deviation\n\n96.0\n\n55.1\n\n40.3\n\n73.4\n\n89.2\n\n194.7\n\n132.0\n\nAs shown in Table 1, we also calculate the mean value and standard deviation\n(with thousand visitors) of the monthly and whole visitor volume. From the results we\ncan see the general fluctuation pattern of monthly visitor flow. Firstly, much fewer\npeople come to Expo in May owing to that people think they have enough time to\nvisit, thus there is no need to hurry. Besides, the operation of Expo is not in the best\ncondition which makes people hesitate to visit. Secondly, the visitor flow in July is the\nmost stationary and the second greatest which are the results of steady flow of tour\ngroups and students who are in their summer vocation. Thirdly, during the six months\nof exhibition, October has the greatest visitor volume and standard deviation. The\noutbreak of visitor volume at the end of exhibition is not surprising. Meanwhile, the\nobvious fluctuation in visitor flow is the result of interweaving of small visitor\nvolume on the 14 designated days and extremely great visitor volume on several\nstandard days such as 1,032,700 on 16th, 859,900 on 22nd and 837,400 on 23rd.\nIn a word, the general law of Expo visitor flow exhibits dual features of both\nfluctuation and stability. The daily volumes are correlated from the long-term\nperspective, nevertheless show obvious fluctuation in short period.\n\n4. Statistical properties of visibility graph of Expo visitor volume\nAccording to the algorithm [6], a visibility graph is obtained from the mapping\n4\n\n\farXiv1106.0599v2 [physics.soc-ph] Jun 2011\nof a time series into a network according to the following visibility criterion: two\narbitrary data (ta , ya ) and (tb , yb ) in the time series have visibility and\nconsequently become two connected nodes in the associated graph, if any other data\n(tc , yc ) such that ta < tc < tb fulfills:\n\nyc < ya + ( yb − ya )\n\ntc − t a\ntc − t a\n\n(4)\n\nFigure 2 shows a typical example of this algorithm. In the upper panel, the data\nare displayed as vertical bars with heights indicating the values and the visibilities\nbetween data points are expressed as dashed lines. The converted network is shown in\nthe lower panel, where the nodes correspond to series data in the same order and an\nedge connects two nodes if there is visibility between them. The visibility graphs\ninherit several properties of time series in its structure. More specifically, periodic\nseries convert into regular graphs, random series do so into exponential random\ngraphs, and fractal series convert into scale-free networks.\n\nFig.2: (Color on line) A typical example of visibility graph algorithm.\n\n5\n\n\farXiv1106.0599v2 [physics.soc-ph] Jun 2011\n\nFig.3: (Color on line) The network mapped from time series of daily visitor volume of\nExpo 2010.\nAs shown in Fig.3, the time series of daily visitor volume of Expo have been\nconverted to visibility graphs using the algorithm introduced above. In order to\ninvestigate the feature of original time series of visitor flow, some characteristics of\nthe visibility graph with 184 nodes and 676 edges were calculated as follows [2]:\n1) Average degree of network k : the mean value of degrees of all the nodes in\nN\n\nnetwork,\n\nk = ∑ ki N = 7.348 .\ni =1\n\n2) Average clustering coefficient C : the mean value of clustering coefficients of all\nN\n\nthe nodes in network, C = ∑ Ci N = 0.789 .\ni =1\n\n3) Diameter of network D : the maximal distance between any pair of nodes,\nD = max dij = 8 , where dij refers to the number of edges on the shortest path\ni, j\n\nconnecting node i and j .\n4) Average path length L : the mean value of the distance of any pair of nodes,\nL=\n\n2\n∑ dij = 3.447 .\nN ( N + 1) i ≥ j\n\n5) Degree distribution P (k ) : the probability of a certain node to have degree k . It is\n6\n\n\farXiv1106.0599v2 [physics.soc-ph] Jun 2011\ncalled scale-free network when degree distribution obeys a right-skewed\npower-law P (k ) ~ k −γ . For the sake of decreasing the noise, we study the\naccumulative degree distribution which behaves power-law as P (k ) = 44.25k −2.37\nwith R 2 = 0.991 . Therefore, the visibility graph is scale-free.\n6) The small-world effect: calculating the average path length step by step while\nincreasing the total number of nodes N\n\nin network. If\n\nL\n\nincreases\n\nlogarithmically along with N , namely, L( N ) ~ ln N , or more slower, while the\nnetwork keeping a high clustering coefficient, then the network is regarded with\nthe feature of small world. As shown in Fig.4, it can be observed that L\nincreases along with N slower than logarithmical pattern. Consequently, the\nvisibility graph is a small-world network.\n7) Hierarchical structure: weighted average values of clustering coefficients of\nn\n\nnodes with degree k were calculated as C (k ) = C | k = ∑ Ci n , where n\ni =1\n\nrefers to the number of different clustering coefficients a node with degree k has.\nThe network is considered to be hierarchically constructed if C (k ) ~ k −α . In our\n\ncase, C (k ) = 5.597k −0.97 .\n8) Pearson correlation coefficient r [13]: there are many hub-nodes in scale-free\nnetwork who own much greater degree than other nodes. Whether the interaction\namong the hubs of the network is attraction or repulsion can be determined from\nthe correlation between the degrees of different nodes. The degree correlation can\nbe quantified by Pearson correlation coefficient defined as:\n2\n\n⎡\n1\n⎤\nN ∑ k1k2 − ⎢ N −1 ∑ ( k1 + k2 ) ⎥\ni\ni 2\n⎣\n⎦\n,\nr=\n2\n1\n1\n⎡\n⎤\nN −1 ∑ ( k12 + k2 2 ) − ⎢ N −1 ∑ ( k1 + k2 ) ⎥\ni 2\ni 2\n⎣\n⎦\n−1\n\nwhere k1 and k2 are the degrees of the nodes at the two ends of edge i . It can\nbe deduced from the result r = 0.115 that the network is positively correlated\n7\n\n\farXiv1106.0599v2 [physics.soc-ph] Jun 2011\nwith hub-nodes being attracted to each other.\n9) Nearest neighbors average connectivity [14]: the relation of degree between one\nnode\n\nand\n\nits\n\nnearest\n\nneighbors\n\ncan\n\nbe\n\nmeasured\n\nby\n\nthe\n\nquantity K nn = ∑ k ′P ( k ′ | k ) , where the conditional probability P ( k ′ | k )\nk′\n\ndenotes that a node with degree k is connected to a node with degree k ′ .\nTherefore,\n\nK nn\n\nis used to investigate the relation between the degree of a\n\ncertain node and the average degree of its nearest neighbors. From Fig.4 we can\nsee clearly that\n\nK nn\n\nand k are positively correlated.\n\nFig.4 (Color online) The topological feature of the visitor flow network\n(a. The accumulative degree distribution behaves power-law with exponent -2.37. b.\nThe average path length grows with the total number of nodes in network slower than\nlogarithmical pattern. c. The weighted average value of clustering coefficients\ndecreases with degree as power-law with exponent near to 1. d. The plot of\n\nK nn ~ k\n\nshows the relation of degree between a node and its neighbors is positively\ncorrelated.)\n\n8\n\n\farXiv1106.0599v2 [physics.soc-ph] Jun 2011\nFrom the topological parameters calculated above, some conclusions may be\nobtained as follows:\nFirstly, the visibility graph being scale-free networks verifies that the time series\nof Expo visitor flow to be with fractal characteristics, enhancing the fact that\npower-law degree distributions are related to fractality, something highly discussed\nrecently [6-10, 15-18]. More accurately, the total degree of the top 29 of 184 nodes\nwith degree no less than 10 accounts for up to 36.1% of the sum degree of the whole\nnetwork, and the average degree of the remaining 155 nodes is only 5.574.\nSecondly, the facts that the network owns high clustering coefficient and low\naverage path length which grow slowly with the total number of nodes verified the\nsmall-world phenomenon which means there are tight connections between nodes\neven they are located far away from each other for there are visibility lines between\nthe corresponding data points in time series. Consequently, it can be deduced that\nsome certain relations exist between the amounts of visitor flow in different time of\nwhole exhibition. In another words, it is not random or unconnected between the past\nand the future in time series of human behaviours.\nThirdly, it can be inferred from the result C (k ) = 5.597k −0.97 that the visibility\ngraph is hierarchically constructed which means if a node in network has greater\ndegree, its neighbors are not tended to be connected with each other. The nodes with\ngreater degrees are the ones own relatively much greater observations in time series\nthan their directly connected and even unconnected neighbors. These extreme points\ncorrespond to the hub-nodes in scale-free networks. For example, node 15 has\ncomparatively high degree k = 18 and low clustering coefficient C = 0.261 , and\nthere are 335,300 visitors on May 15th, much greater than its neighbors (There are\n163,000, 180,400, 180,100, 215,500, 240,300 visitors on the 5 days before the 15th\nrespectively and 241,500, 236,400, 261,900, 290,600, 296,400 visitors after the 15th.\nObviously, it is much lower and more uniform before and after the 15th.).\nCorrespondingly, node 15 has many neighbors in the network who are separated into\ntwo parts and connected with each other with small probability. Thus, it can be\n9\n\n\farXiv1106.0599v2 [physics.soc-ph] Jun 2011\nconcluded that it is inevitable to show some extreme visitor volume in homogeneous\nflow on such pattern,\nFinally, the result r = 0.115 means the network is assortative mixing, within\nwhich the nodes with high degrees tend to link to the nodes also have high degrees.\nMoreover, the fact\n\nK nn\n\nand r are positively correlated implies that the greater\n\ndegree of a certain node, the greater average degree of its neighbors. To make the\nproblem more clearly, we studied the relation between the node degree in network and\nthe average visitor volume in time series. As shown in Fig.5, generally, the nodes with\ngreater degree correspond to the data point with higher visitor volume. To sum up, the\nclustering phenomenon of hub-nodes in network means extreme points in time series\nappear in the form of group, in another word, large visitor flow always accompany\nwith other large visitor flows. Consequently, there are some consecutive periods of\nextreme visitor volumes in the whole exhibition, for instance, from Oct.14th to\nOct.24th with 726,255 visitors on average and from Jul.10th to Jul.28th with 466,942\ndaily visitors.\n\nFig.5 (Color online) The relation between node degree and visitor volume ( ×105 )\nIn conclusion, the visibility graphs converted from time series are scale-free,\nsmall-world and hierarchically constructed. Thus the original time series are deemed\nto be with fractal feature and there are close relationships between the data points,\nespecially those extreme points. Furthermore, the existence of extreme visitor volume\nis unavoidable and consecutive.\n10\n\n\farXiv1106.0599v2 [physics.soc-ph] Jun 2011\n\n5. Summary and discussion\n\nExpo 2010 Shanghai China is a wonderful event which has grand scale, long\nexhibition period and huge visitor amount, remaining us with the best memories and\nvaluable experiences. In our research, the visitor flow is investigated from two\ndifferent viewpoints:\nOn one hand, we discuss the general feature of the daily visitor volume from the\nperspective of statistics and time series analysis. The results of Hurst exponent, mean\nvalue and standard deviation verify that the Expo visitor flow shows mixing\nproperties of stability in long-term and fluctuation in short-term period.\nOn the other hand, the complex network converted from time series with\nvisibility algorithm exhibits scale-free property, small-world effect and hierarchical\nstructure, which confirm that the original time series are fractal within which data\npoints are intensively connected with each other. Furthermore, the relations between\ndegree of one node and its neighbors, degree and clustering coefficient as well as\ndegree and visitor volume prove that the existence of extreme visitor volume is\ninevitable and appear in group.\nThe method and conclusion of our work may be helpful to manage and forecast\nthe visitor flow of such large-scale exhibitions and spots meeting or other human\nrepetitious behaviours on collective level, as well as enrich the researches of the\ncorrelation between time series and complex networks.\n\nAcknowledgement\n\nThis paper is supported by the National Natural Science Foundation of China (Grant\nNo.70871082) and the Foundation of Shanghai Leading Academic Discipline Project\n(Grant No.S30504).\n\n11\n\n\farXiv1106.0599v2 [physics.soc-ph] Jun 2011\nREFERENCES\nWATTS D. J. and STROGATZ S. H., Nature 393 (1998) 440.\nALBERT R. and BARABASI A. L., Rev. Mod. Phys., 74(1) (2002) 47.\nNEWMAN M. E. J., SIAM Rev., 45(2) (2003) 167.\nZHANG J. and SMALL M., Phys. Rev. Lett., 96 (2006) 238701.\nYANG Y. and YANG H. J., Physica A, 387 (2008) 1381.\nLACASA L., LUQUE B., BALLESTEROS F., LUQUE J., and NUNO J. C., Proc.\nNatl. Acad. Sci. U.S.A., 105 (2008) 4972.\n[7] LACASA L., LUQUE B., LUQUE J., and NUNO J. C., Europhys. Lett., 86 (2009)\n30001.\n[8] LUQUE B., LACASA L., BALLESTEROS F., and LUQUE J., Phys. Rev. E, 80 (2009)\n046103.\n[9] ELSNER J. B., JAGGER T. H., and FOGARTY E. A., Geophysical Research Letters,\n36 (2009) L16702.\n[10] LIU C., ZHOU W. X., and YUAN W. K., Physica A, 389 (2010) 2675.\n[11] HURST H. E., Transaction of American Society Civil Engineers, 116 (1951) 770.\n[12] YOON S. M. and KANG S. H., The Journal of the Korean Economy, 9(3) (2008) 403.\n[13] NEWMAN M. E. J., Phys. Rev. Lett., 89 (2002) 208701.\n[14] PASTOR-SATORRAS R., VAZQUEZ A., and VESPIGNANI A., Phys. Rev. Lett., 87\n(2001) 258701.\n[15] SONG C.M., HAVLIN S., and MAKSE H. A., Nature, 433 (2005) 392.\n[16] GOH K.-I., SALVI G., KAHNG B., and KIM D., Phys. Rev. Lett., 96 (2006) 018701.\n[17] KIM J. S., GOH K.-I., KAHNG B., and KIM D., New J. Physics, 9 (2007) 177.\n[18] GALLOS L. K., SONG C. M., and MAKSE H. A., Physica A, 386 (2007) 686.\n\n[1]\n[2]\n[3]\n[4]\n[5]\n[6]\n\n12\n\n\f"}