{"id": "http://arxiv.org/abs/0710.1578v2", "guidislink": true, "updated": "2007-11-16T13:45:02Z", "updated_parsed": [2007, 11, 16, 13, 45, 2, 4, 320, 0], "published": "2007-10-08T15:54:45Z", "published_parsed": [2007, 10, 8, 15, 54, 45, 0, 281, 0], "title": "Dynamical dimer method for the determination of transition states with\n  ab initio molecular dynamics", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0710.4224%2C0710.3851%2C0710.5279%2C0710.4206%2C0710.1198%2C0710.4375%2C0710.0373%2C0710.2152%2C0710.4345%2C0710.0216%2C0710.5628%2C0710.1539%2C0710.3668%2C0710.4248%2C0710.5195%2C0710.2395%2C0710.3397%2C0710.1417%2C0710.3852%2C0710.5140%2C0710.3599%2C0710.2779%2C0710.2752%2C0710.5815%2C0710.1671%2C0710.4033%2C0710.4314%2C0710.0327%2C0710.3349%2C0710.5518%2C0710.0130%2C0710.4690%2C0710.1873%2C0710.0111%2C0710.1122%2C0710.2173%2C0710.3409%2C0710.0454%2C0710.3626%2C0710.4031%2C0710.3150%2C0710.1578%2C0710.4152%2C0710.2806%2C0710.4669%2C0710.5778%2C0710.4952%2C0710.2226%2C0710.0227%2C0710.5544%2C0710.4294%2C0710.0680%2C0710.1453%2C0710.1358%2C0710.2298%2C0710.0165%2C0710.3039%2C0710.2624%2C0710.2799%2C0710.0632%2C0710.3728%2C0710.1982%2C0710.3200%2C0710.0806%2C0710.2382%2C0710.4578%2C0710.0455%2C0710.0002%2C0710.1532%2C0710.0250%2C0710.4297%2C0710.4924%2C0710.2862%2C0710.4397%2C0710.0406%2C0710.4685%2C0710.3657%2C0710.3242%2C0710.3976%2C0710.0175%2C0710.5359%2C0710.5385%2C0710.2796%2C0710.1652%2C0710.2389%2C0710.2566%2C0710.1163%2C0710.3435%2C0710.3821%2C0710.3906%2C0710.0188%2C0710.5311%2C0710.2971%2C0710.5943%2C0710.2204%2C0710.4407%2C0710.5504%2C0710.5256%2C0710.0517%2C0710.1120%2C0710.5464&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Dynamical dimer method for the determination of transition states with\n  ab initio molecular dynamics"}, "summary": "A dynamical formulation of the dimer method for the determination of\ntransition states is presented. The method is suited for ab-initio molecular\ndynamics using the fictitious Lagrangian formulation. The method has been\napplied to the con-rotatory ring opening of chloro-cyclo-butadiene, an example,\nwhere the application of the drag method is problematic.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0710.4224%2C0710.3851%2C0710.5279%2C0710.4206%2C0710.1198%2C0710.4375%2C0710.0373%2C0710.2152%2C0710.4345%2C0710.0216%2C0710.5628%2C0710.1539%2C0710.3668%2C0710.4248%2C0710.5195%2C0710.2395%2C0710.3397%2C0710.1417%2C0710.3852%2C0710.5140%2C0710.3599%2C0710.2779%2C0710.2752%2C0710.5815%2C0710.1671%2C0710.4033%2C0710.4314%2C0710.0327%2C0710.3349%2C0710.5518%2C0710.0130%2C0710.4690%2C0710.1873%2C0710.0111%2C0710.1122%2C0710.2173%2C0710.3409%2C0710.0454%2C0710.3626%2C0710.4031%2C0710.3150%2C0710.1578%2C0710.4152%2C0710.2806%2C0710.4669%2C0710.5778%2C0710.4952%2C0710.2226%2C0710.0227%2C0710.5544%2C0710.4294%2C0710.0680%2C0710.1453%2C0710.1358%2C0710.2298%2C0710.0165%2C0710.3039%2C0710.2624%2C0710.2799%2C0710.0632%2C0710.3728%2C0710.1982%2C0710.3200%2C0710.0806%2C0710.2382%2C0710.4578%2C0710.0455%2C0710.0002%2C0710.1532%2C0710.0250%2C0710.4297%2C0710.4924%2C0710.2862%2C0710.4397%2C0710.0406%2C0710.4685%2C0710.3657%2C0710.3242%2C0710.3976%2C0710.0175%2C0710.5359%2C0710.5385%2C0710.2796%2C0710.1652%2C0710.2389%2C0710.2566%2C0710.1163%2C0710.3435%2C0710.3821%2C0710.3906%2C0710.0188%2C0710.5311%2C0710.2971%2C0710.5943%2C0710.2204%2C0710.4407%2C0710.5504%2C0710.5256%2C0710.0517%2C0710.1120%2C0710.5464&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "A dynamical formulation of the dimer method for the determination of\ntransition states is presented. The method is suited for ab-initio molecular\ndynamics using the fictitious Lagrangian formulation. The method has been\napplied to the con-rotatory ring opening of chloro-cyclo-butadiene, an example,\nwhere the application of the drag method is problematic."}, "authors": ["Alexander Poddey", "Peter E. Blöchl"], "author_detail": {"name": "Peter E. Blöchl"}, "author": "Peter E. Blöchl", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1063/1.2826338", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0710.1578v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0710.1578v2", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "The final modified version will be published in JCP. After it is\n  published, it will be found at http://jcp.aip.org/", "arxiv_primary_category": {"term": "physics.comp-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "physics.comp-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "cond-mat.mtrl-sci", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0710.1578v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0710.1578v2", "journal_reference": null, "doi": "10.1063/1.2826338", "fulltext": "Dynamical dimer method for the determination of transition states with ab initio\nmolecular dynamics\nAlexander Poddey∗ and Peter E. Blöchl†\n\narXiv:0710.1578v2 [physics.comp-ph] 16 Nov 2007\n\nClausthal University of Technology, Institute of Theoretical Physics\nLeibnizstrasse 10, D-38678 Clausthal-Zellerfeld, Germany\n(Dated: October 25, 2018)\nA dynamical formulation of the dimer method for the determination of transition states is presented. The method is suited for ab-initio molecular dynamics using the fictitious Lagrangian formulation. The method has been applied to the con-rotatory ring opening of chloro-cyclo-butadiene,\nan example, where the application of the drag method is problematic.\n\nI.\n\nINTRODUCTION\n\nThe concept of the transition state has a fundamental role for the prediction of rate constants of materials processes. The transition state is the lowest point\non the energy barrier separating two metastable states\nrepresenting the initial and final state of a process. The\nenergy difference between the initial state and the transition state is the activation energy. The curvatures of the\npotential energy surface at the initial state and the transition state provides an estimate of entropic effects[1, 2].\nA molecular dynamics simulation starting from the transition state allows one to construct the dynamical trajectory of a reaction in the low-temperature limit. The\nextension of this latter approach to finite temperatures\nis straightforward [3].\nThe determination of transition states is however substantially more difficult than the determination of minima of the total energy surface. A large number of methods have been invented and refined over the last decades\n(see e.g. the Refs. 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15\nand the review articles [16, 17]).\nMany of these methods require the determination of\nthe second derivatives of the total energy surface. While\nforces, that is first derivatives of the potential energy surface, are readily accessible from density functional calculations, second derivatives are not, at least not without\nsubstantial effort.\nAn overview of methods which allow to determine transition states solely from force information can be found\nin [16]. The most simple approach is the drag method,\nwhere a one-dimensional constraint forces the system\nacross a reaction barrier. Widely used are also \"chain\nof states\" algorithms such as the nudged elastic band\n(NEB) [10, 11, 12] or the string method [14, 15].\nIntermediate between these extremes is the dimer\nmethod. [18]. It couples two instances of the system,\nwhich we will call monomers. The monomers have a\nspecified distance in configuration space. If the system\nfollows the forces, after inverting of the force parallel to\n\n∗ Electronic\n† Electronic\n\naddress: alexander.poddey@tu-clausthal.de\naddress: peter.bloechl@tu-clausthal.de\n\nthe dimer, it evolves to a saddle point of first order, that\nis the transition state.\nThe original dimer method [18] applied a two step\nalgorithm. In a first step, the potential energy of the\ndimer-construct is minimized, excluding parallel motion,\nfollowing a conjugate gradient approach. Then a large\nstep is taken in the direction parallel to the dimer axis.\nRecently, an improvement has been suggested which minimizes the number of gradient evaluations [19].\nIn the context of fictitious-Lagrangian approach to\nfirst-principles molecular dynamics (FPMD) [20], such a\ntwo-step procedure is not feasible, because the electronic\nwave functions must be able to follow the atomic motion adiabatically. The fictitious Lagrangian approach\nrequires a larger number of time steps. However the\ncomputational cost per time step are minimal. While\na first-principles string approach has been published recently [21], the dimer method has not been examined in\nthe framework of ab initio molecular dynamics.\nIn the present study, we introduce a dynamical formulation of the dimer method. Starting from an extended\nLagrangian for the dimer in the configuration space with\ndoubled dimensionality, we derive equations of motion,\nthat, in the presence of dissipation, converge at transition states of first order. An analysis of the trajectories\nof the dimer close to the stable points provides information on the stability and gives guidance for improving the\nperformance of the method. The method has been implemented in the CP-PAW code and has been applied to\nthe con-rotatory ring-opening of chloro-cyclo-butene, an\nexample where the conventional drag method fails unless\nspecial precautions are taken.\nThe paper is organized as follows: In section II we define the extended Lagrangian for the dimer motion and\nderive the equations of motion. In section III we analyze stability and the dynamics in the proximity of the\nstable points. Section IV is devoted to the discretization\nthe equations of motion and the aspects of the actual\nimplementation. In the final section V, the method is\napplied to the con-rotatory ring opening of cyclo-butene\nas practical example and compared to the drag method.\n\n\f2\nII.\n\nLAGRANGIAN AND EQUATIONS OF\nMOTION\n\nIn this section we define the Lagrangian underlying\nthe present work and derive the equations of motion. We\nbegin by defining our notation and we introduce a convenient set of coordinates:\nThe dimer consists of two points in configurational\nspace separated by a fixed distance. We use massweighted coordinates xi defined as\n1\n\nxi := m 2 Ri ,\n\n(1)\n\nwhere the vectors Ri with i = 1, 2 are the positions of\nthe two monomers forming the dimer in configurational\nspace. For a system with N atoms each vector has 3N\ndimensions. In addition, each monomer has its own set of\nelectronic wave functions. The mass matrix m is diagonal\nand the masses of the respective atoms are located on the\nmain diagonal.\nIt is convenient to introduce a variable transformation\ninto center-of-gravity coordinates Y1 and relative coordinates Y2 .\nx1 + x2\n(2)\nY1 =\n2\nY2 = x1 − x2\n(3)\nLoosely speaking Y1 describes the mean structure of the\nmolecule, while Y2 describes the orientation of the dimer.\nA dimer has three basic types of motion: motion parallel to the dimer axis (vk ), motion perpendicular to the\naxis (v⊥ ) and rotation about the center of gravity (v◦ ).\nIn the following, we divide the velocities into the contributions from these basic types of motion. The corresponding velocities are\nv◦ = Ẏ2 = ẋ1 − ẋ2\nY2 ⊗ Y2\nẎ1\nvk =\nd2\n(x1 − x2 ) (ẋ1 + ẋ2 )\n= (x1 − x2 )\n2\n\u0012\n\u0013 2d\nY2 ⊗ Y2\nẋ1 + ẋ2\nv⊥ = 1 −\nẎ1 =\n− vk\nd2\n2\n\n(4)\n\nThe potential energy is described by the potential energy surface V (R). The velocities v◦ , v⊥ and vk are\nto be treated as functions of Y1 and Y2 and their time\nderivatives Ẏ1 and Ẏ2 as defined in Eqs. 4,5,6.\nWe introduced three scale factors M◦ , Mk and M⊥ ,\nthat allow us to scale the masses for the three types of\nmotions independently, that will later be used to accelerate convergence. More importantly, by choosing a negative value of Mk , the motion along the dimer direction\nis inverted, so that the dimer climbs up the barrier.\nIf the scale factors are equal to one, the conventional\nkinetic energy is recovered, that is\n1 2\n1\n1\n2\n= Ṙ1 mṘ1 + Ṙ2 mṘ2\nv + vk2 + v⊥\n4 ◦\n2\n2\n\n(8)\n\nUsing the method of Lagrange multipliers, a term\nhas been introduced to describe the dimer-distance constraint\nY22 = d2\n\n(9)\n\nwhich ensures that the dimer distance in mass-weighted\ncoordinates is equal to d. The corresponding Lagrange\nmultiplier is denoted by λ̄.\nIn addition to the Lagrangian we also define a\nRayleigh's dissipation function D\n1\n2\n.\nD = γ◦ M◦ v◦2 + γk Mk vk2 + γ⊥ M⊥ v⊥\n4\n\n(10)\n\nwhich allows us to introduce dissipation in a consistent\nmanner.\nThe Euler-Lagrange equation for the Lagrangian of\nEq. 7 and the Rayleigh's Dissipation function from Eq. 10\nare obtained from\nd ∂L\n∂L\n∂D\n−\n+\n= 0,\ndt ∂ Ẏi,n\n∂Yi,n\n∂ Ẏi,n\n\n(11)\n\n(5)\n(6)\n\nThe dot denotes the time derivative,\nq and d is the so called\np\n2\n2\n'dimer distance' d = Y2 = (x1 − x2 ) . The symbol ⊗ refers to the outer product defined by (a ⊗ b) c =\n2\na (b * c). Note, that Y2d⊗Y\nis an operator that projects\n2\na vector onto the dimer axis.\nNow we define our theory by setting up a Lagrangian\nfunction in the relative and center-of-gravity coordinates\n1\n2\nL(Y1 , Y2 , Ẏ1 , Ẏ2 ) = M◦ v◦2 + M⊥ v⊥\n+ Mk vk2\n4\u0012\n\u0015\u0013\n\u0014\n1\n1\n−V m− 2 Y1 + Y2\n2\n\u0012\n\u0014\n\u0015\u0013\n1\n1\n−V m− 2 Y1 − Y2\n2\n\u0003\n\u0002 2\n2\n(7)\n−λ̄ Y2 − d\n\nwhere the index i ∈ {1, 2} labels the two monomers, and\nn ∈ {1, 3N } labels the coordinate in configuration space.\nThe resulting equations of motion have the form\n\u0013\n\u0012\n\u0011\n\u0010\nY2 ⊗ Y2\nŸ\n+\nγ\nẎ\nM\n1−\n1\n⊥\n1\n⊥\nd2\n\u0012\n\u0013\n\u0011\n\u0010\nY2 ⊗ Y2\n+\nM\nŸ\n+\nγ\nẎ\n1\n1\nk\nk\nd2\n1\n1\n− m− 2 (F1 + F2 )\n2\n\u0014 \u0012\n\u0013\u0015\n\u0001 d Y2 ⊗ Y2\n+ Mk − M⊥\nẎ1 = 0 (12)\ndt\nd2\nand\n1\n\nM◦ Ÿ2 − m− 2 (F1 − F2 ) + 4λY2\n\u0001 Y2 Ẏ1\n+4 M⊥ − Mk\nẎ1 + γ◦ M◦ Ẏ2 = 0\nd2\n\n(13)\n\n\f3\nHere we have used the forces acting on the monomers\ndefined as\nFi := − ∇|Ri V\n\n(14)\n\nIn equation (13) we absorbed all terms which lead to a\nforce parallel to the dimer axis into the constraint force\nby redefining the Lagrange multiplier. Thus the variable\nλ used in Eq. 13 differs from the Lagrange multiplier λ̄\nin Eq. 7.\nFurthermore, because the dimer system moves on the\nhyperplane with constant dimer distance, we simplified\nthe final equations by using\nY22 = d2\n\n(15)\n\nFrom Eq. 17 and Eq. 1, we obtain the forces\n1\n\nF(x) = F(0) − m 2 D(x − x(0) )\nA.\n\n(19)\n\nStationary points\n\nIf we insert the condition for a stationary point Ẏi =\nŸi = 0 in the equation of motion Eq. 12, we find that\nthe forces for the two monomers at the stationary point\nare antiparallel and of the same magnitude. Using the\nTaylor expansion Eq. 19 in the equation of motion Eq. 12,\nwe find that the center-of-gravity of the dimer Y1 lies\nat a stationary point of the potential, if the dimer is\nstationary, that is\n\nand\nF(Y1 ) = 0\n\n∂ 2\nY = 0.\n∂t 2\n\n(16)\n\nEquation (12) describes the motion of the center of gravity of the dimer, which is related to the structure of the\nmolecule. Equation (13) describes the orientational motion of the dimer.\nIII.\n\nLOCAL STABILITY ANALYSIS\n\nFor M◦ = Mk = M⊥ = 1, the Lagrange function (7)\ndescribes a physical system of two masspoints moving in\na potential V under the influence of the constraint force\nthat keeps the dimer distance invariant. With positive\nfriction factors γ◦ , γk and γ⊥ the dimer will come to rest\nwith the center-of-gravity coordinate next to a local minimum. The dimer axis will be aligned nearly parallel to\nthe lowest vibrational eigenmode. The above statements\nare exactly fulfilled in the limit of vanishing dimer distance.\nIf we choose a negative value of Mk , the motion will become unstable near local minima. Instead, the dimer will\nbe attracted by transition states of first order. A transition state of first order is characterized by the presence\nof exactly one eigenmode with an imaginary frequency.\nThese properties of the dynamics have been derived\nfrom the following local stability analysis. First we determine the stationary points for the dimer dynamics.\nThen we investigate the dynamics in the neighborhood\nof those stationary points.\nFor this analysis we can replace the potential energy\nsurface by its truncated Taylor expansion at a given point\n1\nR(0) = m− 2 x(0) , namely\nV (R) = V (0) − F(0) R\n1\n1\n1\n+ (R − R(0) )m 2 Dm 2 (R − R(0) ) (17)\n2\n1\n∂2V\nmi,i ∂Ri ∂Rj\n\nR(0)\n\n1\n√\nmj,j\n\nSimilarly we obtain from Eq. 13 and Eq. 19\nDY2 = −4λY2\n\n(21)\n\nThus the dimer axis points along an eigenvector of the\ndynamical matrix.\nIn conclusion we find that the dimer dynamics is stationary, when its center of gravity lies at an extremum or\na saddle point of the potential energy surface and when,\nin addition, the dimer axis points along one of the vibrational eigenmodes.\nB.\n\nLinearized equation of motion\n\nWithout loss of generality, we choose in the following\na coordinate system for which the stationary point of the\npotential energy surface lies at the origin. Secondly, we\ndenote the eigenvectors of the dynamical matrix as ei ,\nwith ei ej = δi,j , and the corresponding eigenvalues with\nωi2 . The eigenvector, which is parallel to the dimer axis is\ndenoted by ē and the corresponding eigenvalue is denoted\nby ω̄ 2 . Thus, with Eq. 21, we can identify the Lagrange\nmultiplier as λ = − 41 ω̄ 2 .\nLinearization of the equations of motion Eqs. 12 and\n13 about Y1 = 0 and Y2 = ēd with F(0) = 0 yields the\nfollowing equations for the deviation δY1 (t) and δY2 (t)\nfrom the stationary point\n\u0011\n\u0010\n(1 − ē ⊗ ē) M⊥ δ Ÿ1 + γ⊥ δ Ẏ1\n\u0011\n\u0010\n+ (ē ⊗ ē) Mk δ Ÿ1 + γk δ Ẏ1 + DδY1 = 0 (22)\nM◦ δ Ÿ2 + DδY2 + ω̄ 2 δY2 + M◦ γ◦ δ Ẏ2 = 0 (23)\n\nWe project the second equation ,Eq. 23, onto the eigenvectors ei and obtain:\nM◦ (ei δ Ÿ2 ) + (ωi2 − ω̄ 2 )(ei δY2 ) + M◦ γ◦ (ei δ Ẏ2 ) = 0(24)\n\nwith the dynamical matrix D defined as\nDi,j = √\n\n(20)\n\n(18)\n\nNote, that the motion along ē is simple due to the distance constraint. The frequency of the variable ei Y2 is\n\n\f4\ntherefore\nω◦ = ±\n\ns\n\nωi2 − ω̄ 2\nM◦\n\n(25)\n\nWe see that, for a positive mass M◦ , the dynamics is\nstable only, if ω̄ 2 is the lowest eigenvalue of the dynamical\nmatrix. Thus the dimer axis will always orient along the\neigenvector with the lowest eigenvalue.\nNow, we project Eq. 22 onto the eigenvector ē of the\ndynamical matrix\nMk (ēδ Ÿ1 ) + ω̄ 2 (ēδY1 ) + Mk γk (ēδ Ẏ1 ) = 0\n\n(26)\n\nwhich yields the translational motion of the dimer along\nthe dimer axis. This equation will be responsible for\nthe ascent to a saddle point. The eigenfrequency of the\nvariable ēY1 is\nω̄\nωk = ± p\nMk\n\n(28)\n\n(29)\n\nFrom Eqs. 25, 27 and 29 we find that the dimer with\npositive M◦ and M⊥ and negative Mk will only come to\nrest at transition states of first order, that is, if ω̄ 2 < 0\nand if all other eigenvalues are positive. In that case the\ndimer axis points along the eigenvector corresponding to\nthe imaginary frequency, that is, across the saddle point.\n\nC.\n\nMasses and Frictions\n\nWe will later solve the equations of motion 12, 13 with\nthe Verlet algorithm. The Verlet algorithm for a harmonic oscillator with a frequency ω becomes unstable, if\nthe time step ∆ used for the discretization of the equation of motion is smaller than 2/ω. The frequency of the\ndiscretized motion is accurate to within 1 % if ω∆ < π5 .\nThus, it is important to understand the vibrational spectrum, shown schematically in Fig. 1, of the motion in the\npotential.\n\nω2\n\nFIG. 1: Sketch of the eigenvalue spectrum of the dynamical\nmatrix at the saddle point of first order with the definition of\nωmin and ωmax .\n\nThus, the stability limit requires us to choose the\nmasses as\nω̄ 2 ∆2\n8\n2\nωmax\n∆2\n>\n8\n2\n2\n(ωmax\n− ωmin\n)∆2\n>\n4\n\nMk <\n\n(30)\n\nM⊥\n\n(31)\n\nM◦\n\nwhich represents the translational motion perpendicular\nto the dimer axis. The translational motion is related to\nan optimization of the atomic structure. The frequency\nof the variable ei Y1 with ei ⊥ ē is\nωi\nω⊥ = √\nM⊥\n\n0\n\n(27)\n\nFor a negative mass Mk , which is the choice for a transition state search, Eq. 26 is stable only if the dimer is\noriented along an unstable vibrational mode of the potential energy surface, that is with the dimer oriented\nalong an eigenvector ē with an imaginary frequency.\nNow, we project Eq. 22 onto the eigenvectors ei with\nei ⊥ ē and we obtain\nM⊥ (ei δ Ÿ1 ) + ωi2 (ei δY1 ) + M⊥ γ⊥ (ei δ Ẏ1 ) = 0\n\nω2\n\n111111111111111111111111111\n000000000000000000000000000\n000000000000000000000000000\n111111111111111111111111111\n000000000000000000000000000\n111111111111111111111111111\n000000000000000000000000000\n111111111111111111111111111\n000000000000000000000000000\n111111111111111111111111111\nω2min\nω2max\n\n(32)\n\nIn order to minimize the number of time steps, it is desirable to choose the masses close to these limits.\nLet us now obtain an a priori estimate of these limits: (1) For practical purposes, we can make the assumption that ωmin << ωmax and thus we set ωmin to zero.\n(2) The highest vibrational mode is that of H2 , with a\nfrequency of 4400 cm−1 . Frequencies for bond-stretch\nvibrations are of the order 1000 cm−1 . These numbers\nare reasonable upper estimates for ωmax . (3) The absolute value of the imaginary frequency at the saddle point\nis typically in the range of the high-lying real-frequency\n2\nmodes, that is comparable to ωmax . Hence ω̄ 2 ≈ −ωmax\n.\nWith these assumptions we obtain the following, recommended values for the masses\nMk = −κ∆2\n2\n\nM⊥ = κ∆\nM◦ = 2κ∆2\n\n(33)\n(34)\n(35)\n\n\u00012\nwhere κ = 6 * 10−3 a.u. is a recommended constant\nbased on the H2 vibration.\nLet us now turn our attention to the friction values.\nThe goal is to reach an optimum convergence at the stationary point of the dimer. For a damped harmonic oscillator\nmẍ = −mω02 x − mγx\n\n(36)\n\nthe fastest decay rate as function of the friction is obtained for critical damping, that is in between the oscillatory and the over-damped regime. Critical damping is\n\n\f5\nobtained for a friction of γ = 2ω0 . Thus we choose\ns\nω̄ 2\n(37)\nγk = 2\nMk\ns\ns\n2\n2\nωmin\nωmax\n2\n< γ⊥ < 2\n(38)\nM⊥\nM⊥\ns\ns\n2\n2\n− ω̄ 2\nωmin\nωmax\n− ω̄ 2\n2\n< γ◦ < 2\n(39)\nM◦\nM◦\nNote, that a too high friction freezes out those modes in\nthe over-damped regime. Thus it is usually better to use\na friction near the lower bound of the sensible regime.\nIV.\n\nNUMERICAL INTEGRATION OF THE\nEQUATIONS OF MOTION\n\nA.\n\nDiscretization of the equations of motion\n\nThe equations of motion Eqs. 12,13 are nonlinear in\nthe velocities. This leads to a nonlinear equation for the\ndiscretized equation of motion. We tackle the problem\nby iterating on the nonlinear terms in the velocities.\n\nWe set up the discretized equations of motion, while\ntreating the terms nonlinear in the velocities as an abstract force.\n\u0013\u0015\n\u0014 \u0012\n\u0001 d Y2 ⊗ Y2\nẎ1 (40)\nG1 := − Mk − M⊥\ndt\nd2\n\u0001 Y2 Ẏ1\nG2 := 4 Mk − M⊥\nẎ1\n(41)\nd2\n\nThe equations of motion are discretized according to\nthe Verlet algorithm:\ny(+) − y(−)\n2∆\ny(+) − 2y(0) + y(−)\nÿ →\n∆2\n\nẏ →\n\nγ ∆\n\nY1 (+) =\n\ny(+) = y(t + ∆)\ndy(0) = y(t)\ny(−) = y(t − ∆)\n\n(44)\n(45)\n(46)\n\nWe obtain from Eq. 12\n\n(47)\n\nThe result is\n\n\u0013\n\u0012\n\u0012\n\u0013\no\n1 − a⊥\n1 −1\nY2 ⊗ Y2 n 2\n∆2\n2 (F + F ) + G\nY\n(0)\n−\nY\n(−)\n+\nm\n1−\n1\n1\n1\n2\n1\nd2\n1 + a⊥\n1 + a⊥\n2\nM⊥ (1 + a⊥ )\n\u0012\n\u0013\n\u0012\n\u0013\no\n1 − ak\nY2 ⊗ Y2 n 2\n1 −1\n∆2\n2 (F + F ) + G\n+\nY\n(0)\n−\nY\n(−)\n+\nm\n1\n1\n1\n2\n1\nd2\n1 + ak\n1 + ak\n2\nMk (1 + ak )\n\nSimilarly we discretize the equation of motion for the\n\n(43)\n\nwhere ∆ is the discretization time step, and where we\nused the short-hand notation\n\n\u0012\n\u0013\no\nY2 ⊗ Y2 M⊥ n\n1−\n(1\n+\na\n)\nY\n(+)\n−\n2Y\n(0)\n+\n(1\n−\na\n)\nY\n(−)\n⊥\n1\n1\n⊥\n1\nd2\n∆2\n\u0013\n\u0012\no\n\u0001\n\u0001\nY2 ⊗ Y2 Mk n\n1 + ak Y1 (+) − 2Y1 (0) + 1 − ak Y1 (−)\n+\n2\n2\nd\n∆\n1\n1\n− m− 2 (F1 + F2 ) − G1 = 0\n2\nwhere a⊥ = γ⊥2∆ and ak = k2 . In the projectors we\nhave dropped the argument of Y2 (0).\nEq. 47 can be resolved for Y1 (+) by multiplication\nwith\n\u0012\n\u0013\nY2 ⊗ Y2\n∆2\n1−\n2\nd\nM⊥ (1 + a⊥ )\n\u0012\n\u0013\nY2 ⊗ Y2\n∆2\n+\n(48)\n2\nd\nMk (1 + ak )\n\n(42)\n\n(49)\n\ndimer distance, Eq. 13. Following Ryckaert et al [22], we\n\n\f6\nH4b\n\nfirst propagate without the force of constraint to obtain\nȲ2 =\n\nC\n\n1 − a◦\n2\nY2 (0) −\nY2 (−)\n1 + a◦\n1 + a◦\n\u0010\n\u0011\n1\n∆2\n+ m− 2 (F1 − F2 ) + G2\n(50)\nM◦ (1 + a◦ )\n\nH1\n\nThe new vector Y2 (+) is related to Ȳ2\nwith a◦ =\nby the constraint force and the Lagrange parameter λ\naccording to\n∆2\nM◦ (1 + a◦ )\n\n(51)\n\nThe Lagrange parameter is then adjusted so that the\nconstraint Y22 (+) = d2 , namely a given dimer length, is\nsatisfied.\nIn the first iteration we estimate this forces G1 and\nG2 from the previous iterations or we set them to zero.\nThen we propagate the positions, which provides us with\na better estimate for the nonlinear terms. This loop is\nthen iterated to convergence.\nB.\n\nRestricting the orientation of the dimer\n\nIt will be important to limit the degrees of freedom,\nin which the two monomers may differ. This implies restricting the orientation of the dimer to a space with\nlower dimensionality. The reason is to avoid that the\ndimer converges at irrelevant saddle-points, which are not\nof interest. This is a common problem for complex systems, that exhibit many minima and saddle points. This\nrestriction is accomplished easily, by setting the corresponding components of Y2 in Eq. 50 to zero.\nV.\nAPPLICATION: CONROTATORY RING\nOPENING OF 1-CHLORO-2-CYCLOBUTENE\n\nIn order to demonstrate the performance of the dimer\nmethod described above, we have chosen a prototypical\nsystem for tests of transition state searches, namely the\nring opening of cyclobutene. The isomerization of cyclobutene to cis-butadiene is the prototypical example of\nconcerted stereospecific reactions. The underlying processes have been studied and discussed extensively by\nseveral groups [23, 24, 25, 26] (and references therein).\nThe potential energy surfaces of the con- as well as of\nthe disrotatory isomerization mechanisms exhibit principal structures, which render the determination of the\ncorresponding transition states complicated [24].\nIn order to avoid special effects due to the high symmetry of cyclobutene, that would be untypical for other\nmolecules, we explored 1-chloro-2-cyclobutene. This\nmolecule and the two relevant reaction products are\nshown in Figure 2.\nComputational details of our calculations are given in\nappendix A. The coordinates of the structures are supplied with the supplementary material.\n\nC2\n\nA\n\nγ◦ ∆\n2 .\n\nY2 (+) = Ȳ2 − 4λY2 (0)\n\nH2\n\nH2\n\nH1\nCl\n\nC1\n\nC4\n\nH4a\n\nC3\nH3\n\nH3\n\nC2\n\nC3\n\nC1\n\nC4\n\nCl\nH4a\n\nH2\n\nH4b\n\nC2\nH1\n\nC1\n\nC3\nC4\n\nH4a\n\nH4b\n\nCl\n\nB\n\nH3\n\nFIG. 2: Initial state, 1-chloro-2-cyclobutene (A), and final\nstate, 1-chloro-buta-1,3-diene (B), for the conrotatory ring\nopening of chlorocyclobutene. Also shown is the product\nof the disrotatory ring opening, trans-1-chloro-buta-1,3-diene\n(C).\n\nA.\n\nDrag Calculations\n\nIn this section we investigate the reaction using the\ndrag method. Because of its simplicity, the drag method\nis widely used for transition state search. However, the\ndrag method fails for a number of systems. In such cases\nthe energy exhibits a hysteresis effect, that is, different\nenergy profiles are obtained when dragging the reaction\ncoordinate in the opposite directions. The ring opening\nof cyclobutene is one example where the drag method\nexhibits a hysteresis effect.\nIn the drag method one specifies a one-dimensional\nreaction coordinate. Then one maps the energy profile\nalong the reaction coordinate and determines the highest\npoint as the transition state. Each point along the energy profile corresponds to the local energy minimum on\na hyperplane perpendicular to the reaction coordinate.\nIn our case we selected the reaction coordinate by the\ndifference between initial and final state. A hyperplane\nwith a specified value c of the reaction coordinate is given\nby\n(RB − RA ) (R − RA )\n2\n\n(RB − RA )\n\n=c\n\n(52)\n\nHence the value of the reaction coordinate is zero for the\ninitial state (A) and one for the final state (B).\nIn addition to the reaction coordinate we imposed six\nadditional constraints to avoid translations and rotations\n\n\f7\nof the molecule. We have chosen\n\nC\n(53)\n0.75\n\n(54)\n\nWhere the coordinates correspond to the atoms given in\nparenthesis. The notation follows Figure 2.\nWhen the energy profile is determined by varying the\nreaction coordinate in small steps, once from zero to one\nand then from one to zero, we obtain the hysteresis shown\nin Fig. 3. The highest point of the energy profile is not\nthe transition state. Instead, the highest point of each\nbranch is an upper bound for the activation energy, while\nthe crossing of the two branches is a lower bound.\n\nB\n0.50\nc\n\n1\n(R(C2 ) + R(C3 )) = 0\n2\n1\nz(C1 ) = z(C4 ) = (x(C1 ) + x(C4 )) = 0\n2\n\n1.00\n\nTS\n0.25\n\nA\n0\n\nB\n\n−0.25\n\n4\n\nA\n0\n\nEnergy (eV)\n\n3\n\n0.2\n\n0.4\n\n0.6\n\n0.8\n\n1.0\n\nc\n\nFIG. 4: Sketch of the potential energy surface of the conrotatory isomerization of 1-chloro-2-cyclo-butene to 1-chlorobuta-1,3-diene. The dashed lines trace the paths obtained\nfrom drag calculations for the transitions A → B and B → A,\nrespectively. The crosses denote the structures A† and B † .\nTS corresponds to the transition state.\n\n2\n\n1\n\n0\n0.0\n\n0.2\n\n0.4\n\nc\n\n0.6\n\n0.8\n\n1.0\n\nFIG. 3: Potential energy relative to the energy of final state\n(B) over reaction coordinate from a forward and backward\ncalculation using the drag method. The true transition state\n(determined using the dynamical dimer method) is denoted\nby a circle.\n\nIn order to show the underlying reason for the hysteresis, we show in Fig. 4 the total energy surface in a\ntwo-dimensional hypersurface. The two axes are the reaction coordinate and the coordinate defined by the two\nisoenergetic structures at the crossing of the two branches\nof the energy profile in Fig. 3. For each point in the twodimensional plot the energy is at a local minimum of the\n(3N − 2)-dimensional hypersurface.\nWe see that the drag method in the forward direction\nleads into a side valley that leads further onto a ridge.\nThe point where this path becomes unstable, and from\nwhere it leads down into the valley of the product state,\nlies past the transition state. In the backward direction\na similar instability occurs, even though closer to the\nreaction coordinate of the transition state.\nNote that the two configuration A† and B † , that mark\nthe crossing of the two branches in the energy profile\nshown in Fig. 3, lie far from the transition state. For\nfurther information see Table I.\n\nB.\n\nDynamical dimer calculations\n\nIn this section we describe technical issues for dynamical dimer calculations and demonstrate their performance.\nWe use the fictitious Lagrangian formulation of abinitio molecular dynamics. This implies that wave function coefficients and nuclei obey Newton's equation of\nmotion, to which we added a friction, which allows to\nquench the system.\nSpecial attention should be given to the wave function\ndynamics. The wave-function cloud tied to the atoms results in an increased effective mass of the nuclei. Furthermore, a friction applied to the wave function dynamics\nacts like an effective friction on the nuclear motion. For\na normal ground-state search, this is not problematic.\nIn our case however, the mass for the motion parallel to\nthe dimer direction is inverted. Thus the dimer accelerates opposite to the direction of the force. Thus a friction\nacting on the dimer via the electrons leads to an velocitydependent acceleration of the dimer, that may cause an\ninstability of the dimer motion.\nThe detrimental effect of the wave function motion can\nbe avoided by choosing a sufficiently small mass for the\nwave function dynamics or by artificially increasing the\natomic masses. In our study, we used a mass of 50 u for\nall atoms. The wave functions have been kept close to\n\n\f8\n\nMk = −1.00\nM⊥ = +1.00\nM◦ = +0.25 .\n\n(55)\n(56)\n(57)\n\nThe small value for M◦ has been chosen to speed up the\nreorientation of the dimer.\nIn order to avoid instabilities, we found it useful to\nintroduce an upper limit to the kinetic energy individually for the rotational, perpendicular and parallel motion.\nThese limits were enforced by adjusting the frictions accordingly. The limit for the kinetic energy Ekin,max is\ntranslated into an upper \"temperature\" Tmax according\nto\n1\ngkB Tmax = Ekin,max\n(58)\n2\nwhere g is the number of degrees of freedom in the corresponding motion type, kB is Boltzmann's constant.\nWithin the limits of the enforced maximum kinetic energies, we adapted the friction dynamically in each step\nto come close to the limit of critical damping. The latter\nresults in the best possible convergence behavior.\nFurthermore, the friction is increased to a higher value\nspecified by the user, if the dimer moves away from the\nstable point. The decision to increase the friction has\nbeen made on the basis of the actual forces and velocities.\nIn our simulation we have chosen this friction so that the\nenergy dissipated per time step corresponds to 20 % of\nthe kinetic energy of the corresponding type of motion.\nWhen starting the dimer simulation, it is important\nto optimize the dimer orientation, i.e. Y1 , first, before\nthe mean dimer configuration Y2 changes appreciably.\nThis is because the mean dimer configuration only approaches the transition state, if the dimer orientation is\nsufficiently aligned along the unstable vibrational mode\nof the transition state.\nThe dimer orientation can be optimized in different\nways. (1) Starting from initial dimer coordinates, the\nmean dimer configuration, Y1 , is constrained to the initial value, while the orientation, Y2 , is fully optimized.\nOnly after this optimization also the mean configuration\nis allowed to move. (2) Starting from one monomer configuration, the second monomer is constructed from the\nfirst by letting it follow the forces until the desired dimer\nlength is obtained. We will refer to this technique as\nthe \"growing-dimer technique\" (3) Starting from a dimer\nwith the monomers being identical to the two metastable\nminima, the dimer length is successively shortened, while\nthe dimer position is optimized. Results for all three optimization strategies can be found in Table I.\nWe found that the third strategy suffers from the fact\nthat additional effort is required to contract the dimer\nlength to the desired value. It also suffers from an instability caused by strong anharmonic effects.\n\nThe growing-dimer technique has the advantage that\nthe second monomer is constructed dynamically from the\nfirst, without the need of an independent optimization of\nthe wave functions. In the growing dimer technique the\ndimer orientation is optimized automatically as soon as\nthe targeted dimer length is reached. In the first strategy\nthe orientation is obtained during the first iterations with\na constrained mean dimer configuration.\nWe will discuss here the first strategy. The initial\nstructure of the dimer is given by a mean dimer configuration midway between the two metastable states (A)\nand (B). The dimer length is chosen such that the distance of the two monomers in coordinate space is 0.33 Å.\nDuring the first 700 time steps, the dimer orientation\nhas been optimized. Here the mean dimer configuration\nhas not been constrained, but the maximum temperature\nfor the perpendicular motion has been kept at a small\nvalue of 10 K. For the parallel and rotational motion,\nthe maximum temperature has been set to 500 K. After\nthe first 700 time steps the maximum temperature for\nthe perpendicular motion has been increased to 500 K.\nIn Figs. 5,6 we show the convergence of the forces for\nthe parallel, rotational and perpendicular motion. Good\nconvergence is reached after 2000 time steps. The estimates for the transition state energy and the deviation of\nthe mean dimer configuration from the transition state\nis given in Table I.\n\n0.05\n0.00\nForce (a.u.)\n\nthe ground state by applying a friction that dissipates\n2 % of the kinetic energy in each time step.\nThe dimension-less masses for the dimer motion have\nbeen chosen to\n\n-0.05\n\n1e-02\n1e-03\n\n-0.10\n\n1e-04\n1e-05\n\n-0.15\n\n1e-06\n-0.20\n0\n\n1000\n\n2000\n2000\nSimulation Step\n\n3000\n3000\n\nFIG. 5: Forces over time-step for a calculation following optimzation strategy (1) described in the text. The dashed and\ndash-dotted line show the forces parallel to the dimer axis for\nimage one and two, respectively. The full line corresponds\nto the resulting force acting on the center of gravity of the\ndimer. The logarithmic scale of the inset provides detailed\ninformation for the latter.\n\nVI.\n\nSUMMARY\n\nA formulation of the dimer method for searching transition states is presented which can be used in ab-initio\n\n\f9\nAPPENDIX A: COMPUTATIONAL DETAILS\n\nForce (a.u.)\n\n1e-01\n1e-02\n1e-03\n1e-04\n1e-05\n0\n\n1000\n\n2000\nSimulation Step\n\n3000\n\nFIG. 6: Rotational (full line) and perpendicular (dashed line)\npart of the forces acting on the dimer over time-steps for a\ncalculation following optimzation strategy (1) described in the\ntext.\n\nTABLE I: Predicted transition-state energy (relative to final\nstate (B)) and deviation from the exact transition state for\nthe con-rotatory isomerization of 1-chloro-2-cyclo-butene to\n1-chloro-buta-1,3-diene. The results include three different\ndynamical dimer optimization strategies ((1), (2) and (3))\ndescribed in the text and the forward as well as the backward\ndrag calculation shown in Fig. 3.\n ̨\n ̨\nPredicted Energy (eV)  ̨RT S − R ̨ (Å)\nTransition Statea\n2.110\n(1)\n1000 steps\n2.110\n1.00\n1500 steps\n2.111\n0.85\n2000 steps\n2.111\n0.71\n(2)\n1000 steps\n2.258\n0.62\n1500 steps\n2.116\n0.37\n2000 steps\n2.110\n0.36\n(3)\n1000 steps\n2.133\n1.58\n1500 steps\n2.112\n0.85\n2000 steps\n2.110\n0.85\nTS A → B\n3.461\n2.57\nTS B → A\n2.120\n0.56\na Determined by the use of a well converged dynamical dimer calculation with final dimer distance of 0.125 Å.\n\nmolecular dynamics simulations using a fictitious Lagrangian. The dimer method is successful in cases where\nthe widely used drag method fails. We investigate the\ndynamics close to the stable points of the dimer analytically. In addition we demonstrate the performance of our\nimplementation using a practical example typically used\nas test case for transition state search algorithms, namely\nthe con-rotatory ring opening of (chloro-) cyclo-butene.\n\nWe performed density-functional calculations [27,\n28] based on the projector augmented wave (PAW)\nmethod[29, 30]. The gradient-corrected PBE[31] functional was used for exchange and correlation. The PAW\nmethod is a frozen-core all-electron method. Like other\nplane-wave based methods, the PAW method leads to\nthe occurrence of artificial periodic images of the structures. This effect was avoided by explicit subtraction\nof the electrostatic interaction between them.[32] Wave\nfunction overlap was avoided by choosing the unit cell\nlarge enough to keep a distance of more than 6 Å between atoms belonging to different periodic images. We\nused a plane wave cutoff of 30 Ry for the auxiliary wave\nfunctions of the PAW method. The following sets of projector functions were employed, Cl 2s2p1d, C 2s2p1d, H\n2s1p, which provides the number of projector functions\nper angular momentum magnetic quantum number m in\neach main angular momentum channel l.\nAtomic structures were optimized by damped CarParrinello[33] molecular dynamics. We used a time-step\nof 10 a.u. (2.5 fs) for all except the dynamical dimer calculations. See section V B for further details. The convergence was tested by monitoring if the total energy\nchange remains below 10−5 Hartree during a simulation\nof 500 time steps. During the simulation for the convergence test, no friction was applied to the atomic motion\nand the friction on the wave function dynamics was chosen sufficiently low to avoid a noticeable effect on the\natomic motion.\n\n\f10\n\n[1]\n[2]\n[3]\n[4]\n[5]\n[6]\n[7]\n[8]\n[9]\n[10]\n\n[11]\n[12]\n[13]\n[14]\n[15]\n[16]\n[17]\n\nH. Eyring, J. Chem. Phys. 3, 107 (1934).\nG. Vineyard, J. Phys. Chem. Solids 3, 121 (1957).\nJ. Keck, Discuss. Faraday Soc. 33, 1962 (1962).\nD. Poppinger, Chem. Phys. Lett. 35, 550 (1975).\nC. J. Cerjan and W. H. Miller, J. Chem. Phys. 75, 2800\n(1981).\nJ. Baker, J. Comp. Chem. 7, 385 (1986).\nJ. Simons, P. Jorgensen, H. Taylor, and J. Ozment, J.\nPhys. Chem. 87, 2745 (1983).\nA. Banerjee, N. Adams, J. Simons, and R. Shepard, J.\nPhys. Chem. 89, 52 (1985).\nL. J. Munro and D. J. Wales, Phys. Rev. B 59, 3969\n(1999).\nH. Jonsson, G. Mills, and K. W. Jacobsen, Classical and\nQuantum Dynamics in Condensed Phase Simulations,\nEd. B.J. Berne, G.Ciccotti and D.F.Coker, World Scientific p. 385 (1998).\nG. Mills and H. Jonsson, Phys. Rev. Lett. 72, 1124\n(1994).\nG. Mills, H.Jonsson, and G. Schenter, Surf. Sci. 324, 305\n(1995).\nR. Malek and N. Mousseau, Phys. Rev. E 62, 7723\n(2000).\nW. E, W. Ren, and E. Vanden-Eijnden, Phys. Rev. B 66,\n52301 (2002).\nB. Peters, A. Heyden, A. T. Bell, and A. Chakraborty,\nJ. Chem. Phys. 120, 7877 (2004).\nG. Henkelman, G. Johannesson, and H. Jonsson, Progress\non Theoretical Chemistry and Physics, Ed. S. D.\nSchwartz, Kluwer Academic Publishers p. 269 (2000).\nH. B. Schlegel, J. Comput. Chem. 24, 1514 (2003).\n\n[18] G. Henkelman and H. Jonsson, J. Chem. Phys. 111, 7010\n(1999).\n[19] R. A. Olsen, G. H. Kroes, G. Henkelman, A. Arnoldsson,\nand H.Jonsson, J. Chem. Phys. 121, 9776 (2004).\n[20] R. Car and M. Parrinello, Phys. Rev. Lett. 55, 2471\n(1985).\n[21] Y. Kanai, A. Tilocca, A. Selloni, and R. Car, J. Chem.\nPhys. 121, 3359 (2004).\n[22] J.-P. Ryckaert, G. Ciccotti, and H. J. C. Berendsen, J.\nComp. Phys. 23, 327 (1977).\n[23] R. B. Woodward and R. Hoffmann, J. Am. Chem. Soc.\n87, 395 (1965).\n[24] M. J. S. Dewar and S. Kirschner, J. Am. Chem. Soc.\n93, 4292 (1971).\n[25] J. Breulet and H. F. Schaefer, J. Am. Chem. Soc.\n(1981).\n[26] J. M. Olivia, J. Gerratt, P. B. Karadakov, and D. L.\nCooper, J. Chem. Phys. 107, 8917 (1997).\n[27] P. Hohenberg and W. Kohn, Phys. Rev. 136, B864\n(1964).\n[28] W. Kohn and L. Sham, Phys. Rev. 140, A1133 (1965).\n[29] P. E. Blöchl, Phys. Rev. B 50, 17953 (1994).\n[30] P. E. Blöchl, C. Först, and J. Schimpl, Bull. Mater. Sci.\n26, 33 (2003).\n[31] J. Perdew, K. Burke, and M. Ernzerhof, Phys. Rev. Lett.\n77, 3865 (1996).\n[32] P. E. Blöchl, J. Chem. Phys. 103, 7422 (1986).\n[33] R. Car and M. Parrinello, Phys. Rev. Lett. 55, 2471\n(1985).\n\n\f"}