{"id": "http://arxiv.org/abs/0710.2787v1", "guidislink": true, "updated": "2007-10-15T17:29:34Z", "updated_parsed": [2007, 10, 15, 17, 29, 34, 0, 288, 0], "published": "2007-10-15T17:29:34Z", "published_parsed": [2007, 10, 15, 17, 29, 34, 0, 288, 0], "title": "The shuffle Hopf algebra and quasiplanar Wick products", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0710.1872%2C0710.5051%2C0710.1140%2C0710.5508%2C0710.3612%2C0710.1669%2C0710.3106%2C0710.3695%2C0710.5110%2C0710.4714%2C0710.2959%2C0710.5101%2C0710.0372%2C0710.1570%2C0710.0270%2C0710.4347%2C0710.5141%2C0710.1379%2C0710.4765%2C0710.0897%2C0710.3571%2C0710.0124%2C0710.2771%2C0710.5251%2C0710.0131%2C0710.1482%2C0710.2498%2C0710.0847%2C0710.0957%2C0710.2653%2C0710.1115%2C0710.5200%2C0710.5176%2C0710.0986%2C0710.3775%2C0710.4858%2C0710.2688%2C0710.0575%2C0710.0420%2C0710.0465%2C0710.2602%2C0710.0591%2C0710.3105%2C0710.4326%2C0710.0859%2C0710.3726%2C0710.4299%2C0710.4890%2C0710.1272%2C0710.3303%2C0710.0094%2C0710.0168%2C0710.3547%2C0710.0456%2C0710.3404%2C0710.3330%2C0710.4193%2C0710.4100%2C0710.5082%2C0710.1880%2C0710.4941%2C0710.1603%2C0710.1584%2C0710.0799%2C0710.5336%2C0710.2593%2C0710.0702%2C0710.2024%2C0710.0113%2C0710.5894%2C0710.0647%2C0710.3079%2C0710.2918%2C0710.5310%2C0710.1576%2C0710.3611%2C0710.5037%2C0710.1182%2C0710.4902%2C0710.2787%2C0710.4144%2C0710.1496%2C0710.0477%2C0710.5057%2C0710.1580%2C0710.2838%2C0710.4357%2C0710.2025%2C0710.4173%2C0710.1520%2C0710.4649%2C0710.5780%2C0710.4429%2C0710.2841%2C0710.3724%2C0710.0748%2C0710.4337%2C0710.4415%2C0710.2261%2C0710.4532%2C0710.5701&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The shuffle Hopf algebra and quasiplanar Wick products"}, "summary": "The operator valued distributions which arise in quantum field theory on the\nnoncommutative Minkowski space can be symbolized by a generalization of chord\ndiagrams, the dotted chord diagrams. In this framework, the combinatorial\naspects of quasiplanar Wick products are understood in terms of the shuffle\nHopf algebra of dotted chord diagrams, leading to an algebraic characterization\nof quasiplanar Wick products as a convolution. Moreover, it is shown that the\ndistributions do not provide a weight system for universal knot invariants.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0710.1872%2C0710.5051%2C0710.1140%2C0710.5508%2C0710.3612%2C0710.1669%2C0710.3106%2C0710.3695%2C0710.5110%2C0710.4714%2C0710.2959%2C0710.5101%2C0710.0372%2C0710.1570%2C0710.0270%2C0710.4347%2C0710.5141%2C0710.1379%2C0710.4765%2C0710.0897%2C0710.3571%2C0710.0124%2C0710.2771%2C0710.5251%2C0710.0131%2C0710.1482%2C0710.2498%2C0710.0847%2C0710.0957%2C0710.2653%2C0710.1115%2C0710.5200%2C0710.5176%2C0710.0986%2C0710.3775%2C0710.4858%2C0710.2688%2C0710.0575%2C0710.0420%2C0710.0465%2C0710.2602%2C0710.0591%2C0710.3105%2C0710.4326%2C0710.0859%2C0710.3726%2C0710.4299%2C0710.4890%2C0710.1272%2C0710.3303%2C0710.0094%2C0710.0168%2C0710.3547%2C0710.0456%2C0710.3404%2C0710.3330%2C0710.4193%2C0710.4100%2C0710.5082%2C0710.1880%2C0710.4941%2C0710.1603%2C0710.1584%2C0710.0799%2C0710.5336%2C0710.2593%2C0710.0702%2C0710.2024%2C0710.0113%2C0710.5894%2C0710.0647%2C0710.3079%2C0710.2918%2C0710.5310%2C0710.1576%2C0710.3611%2C0710.5037%2C0710.1182%2C0710.4902%2C0710.2787%2C0710.4144%2C0710.1496%2C0710.0477%2C0710.5057%2C0710.1580%2C0710.2838%2C0710.4357%2C0710.2025%2C0710.4173%2C0710.1520%2C0710.4649%2C0710.5780%2C0710.4429%2C0710.2841%2C0710.3724%2C0710.0748%2C0710.4337%2C0710.4415%2C0710.2261%2C0710.4532%2C0710.5701&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The operator valued distributions which arise in quantum field theory on the\nnoncommutative Minkowski space can be symbolized by a generalization of chord\ndiagrams, the dotted chord diagrams. In this framework, the combinatorial\naspects of quasiplanar Wick products are understood in terms of the shuffle\nHopf algebra of dotted chord diagrams, leading to an algebraic characterization\nof quasiplanar Wick products as a convolution. Moreover, it is shown that the\ndistributions do not provide a weight system for universal knot invariants."}, "authors": ["Dorothea Bahns"], "author_detail": {"name": "Dorothea Bahns"}, "author": "Dorothea Bahns", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1088/1742-6596/103/1/012014", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0710.2787v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0710.2787v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "16 pages, prepared for the conference proceedings \"Non commutative\n  Geometry and Physics\", Laboratoire de physique th\\'eorique d'Orsay, April\n  23-27, 2007", "arxiv_primary_category": {"term": "math.QA", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "math.QA", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "hep-th", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "81R60", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0710.2787v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0710.2787v1", "journal_reference": "J. Phys.: Conf. Ser. 103 012014 (13pp) 2008", "doi": "10.1088/1742-6596/103/1/012014", "fulltext": "arXiv:0710.2787v1 [math.QA] 15 Oct 2007\n\nThe shuffle Hopf algebra and quasiplanar Wick\nproducts\nDorothea Bahns\n\n∗\n\nOctober 15, 2007\n\nAbstract\nThe operator valued distributions which arise in quantum field theory\non the noncommutative Minkowski space can be symbolized by a generalization of chord diagrams, the dotted chord diagrams. In this framework,\nthe combinatorial aspects of quasiplanar Wick products are understood\nin terms of the shuffle Hopf algebra of dotted chord diagrams, leading to\nan algebraic characterization of quasiplanar Wick products as a convolution. Moreover, it is shown that the distributions do not provide a weight\nsystem for universal knot invariants.\n\n1\n\nIntroduction\n\nTensor products of the operator valued distributions that appear in quantum\nfield theory are in general ill-defined when pulled back to the diagonal, and\nthe process of renormalization is necessary to define products which are welldefined distributions. For products of free field operators, the renormalization\nprocedure leads to what is called the Wick product of quantum fields.\nIn [1], the quasiplanar Wick products were defined as a generalization of\nWick products which is suitable for products of quantum fields on the noncommutative Minkowski space. The definition is based on a certain notion of locality\nand it is the first step towards a full renormalization theory in the Minkowskian\nnoncommutative framework. This paper elaborates on the quasiplanar Wick\nproducts' combinatorial and algebraic aspects, leaving the functional analytic\naspects aside. Its first aim is to clarify that the graphs we used in [1, 2] to\nhandle the combinatorics of quasiplanar Wick products, are a generalization of\nthe classic chord diagrams studied e.g. in knot theory [3, 4].\nChord diagrams carry a cocommutative Hopf structure, and it is natural to\ntry to reformulate the combinatorial aspects of quasiplanar Wick products in\nthis algebraic language, much in the spirit of [5]. So, the paper's second aim is to\n∗ Department Mathematik, Universität Hamburg, Bundesstr. 55, D - 20146 Hamburg,\nGermany - bahns@math.uni-hamburg.de\n\n1\n\n\freformulate the combinatorial aspects of quasiplanar Wick products as proved\nin [1, 2] in this algebraic setting and to show that the Hopf structure with the\nshuffle product and deconcatenation coproduct is the natural one in our context.\nA completely algebraic characterization of quasiplanar Wick products in terms\nof a convolution in the shuffle Hopf algebra is given in section 4. Section 5\nis devoted to explicitely relating these algebraic objects and relations to the\noperator valued distributions which arise in quantum field theory on the noncommutative Minkowski space. In the last section, it is shown that, although\nthese distributions bear some similarity with weight systems [4], they do not\nfulfill the 4T relation.\n\n2\n\nDotted chord diagrams\n\nLet us first recall the notion of a chord diagram. Let L denote a directed simple\npolygonal arc in [0, 1] × R, let ∂L denote its boundary, that is, the set of its\ntwo endpoints. A chord diagram on L is a finite set of ordered pairs of distinct\npoints on L\\∂L. The pairs of points are usually symbolized by connecting lines,\nthe chords of the chord diagram, whose shape is irrelevant, e.g. q q q ✲\nq for\nthe set {(x1 , x3 ), (x2 , x4 )}, where x1 , x2 , x3 , x4 appear on the arc from left to\nright in that order.\nDefinition 1 Let L be an arc. A dotted chord diagram on L is a finite set of\nordered pairs of points on L \\ ∂L.\nObserve that in this definition, we admit pairs (x, x) of nondistinct points.\nWe refer to such pairs as dots. We continue to symbolize a pair of distinct points\nby its connecting line and symbolize a pair (x, x) on the arc simply by the point\nx itself, e.g. q q q q ✲\nq for a set {(x1 , x3 ), (x2 , x5 ), (x4 , x4 )} with xi 6= xj for\ni 6= j and where x1 , x2 , x3 , x4 , x5 appear on the arc from left to right in that\norder. Observe that a dotted chord diagram that only contains pairs of distinct\npoints is indeed a chord diagram in the usual sense. These diagrams thus appear\nas special cases of dotted chord diagrams and will be called diagrams without\ndots. Likewise, we will call the dotted chord diagrams containing only pairs of\nnon-distinct points diagrams without chords or chordless diagrams.\nWe say that a dotted chord diagram has dot-degree m, and write ddeg(D) =\nm, if its pairs are built from m distinct points on the arc. For example, the two\ndotted diagrams above have dot-degree 4 and 5, respectively. Note that usually,\nthe degree of a chord diagram is the number of its chords, hence, the dot-degree\nof a chord diagram without dots is twice the ordinary degree.\nLet Vm denote the finite dimensional vector space that\nL is spanned over C by\nall dotted chord diagrams of dot-degree m, and let V = m≥0 Vm with V0 = C.\nIt is well known that the vector space of chord diagrams forms a Hopf algebra,\nsee for instance [4]. We will generalize this structure to the vector space of dotted\nchord diagrams. The unique way to glue together two directed arcs L1 and L2\n(in that order from left to right), such that the resulting arc is again directed,\n2\n\n\fextends by linearity to an associative product μ : V ⊗ V → V . Usually, we write\na * b or ab for μ(a ⊗ b). The unit for this product is the empty diagram ✲\nwhich we also denote by ∅ or 1. Now consider the coproduct ∆ : V → V ⊗ V ,\ndefined on diagrams as\nX\nD′ ⊗ (D \\ D′ )\n∆(D) =\n∅⊂D′ ⊂D\n\nwhere the sum runs over all subdiagrams (including the empty diagram as well\nas D itself). Its counit is the map ǫ that is equal to 1 on the empty diagram and\n0 elsewhere, and the primitive elements in V are ✲\nq and q q✲ It is standard\nto check that (V, μ, ∆) is a bialgebra, and since V is graded and connected,\nit follows that V is a Hopf algebra. Its antipode is given inductively on the\ndot-degree of a diagram by S(∅) = ∅, and for D 6= ∅,\nX\nS(D′ ) * (D \\ D′ )\nS(D) = −D −\n∅(D′ (D\n\nWe have, for example,\nS( q q q ✲)\nq = q q q q✲ + q q q ✲\nq − q q q ✲\nq\nS is an algebra-antihomomorphism, that is, S(ab) = S(b)S(a), and since ∆ is\ncocommutative, we have S 2 = idV , see [3].\n\n3\n\nThe Quasiplanar Wick map\n\nLet us recall and extend some definitions from [6] and [1], respectively. The\nlabelled intersection graph of a chord diagram without dots is a graph whose\nvertices are the chords of D, numbered from 1 to ddeg(D)/2 in the order in\nwhich their starting points appear along the arc, and where two vertices are\nconnected by an edge iff the corresponding two chords in D intersect.\nTo extend this definition to dotted chord diagrams, we first establish how to\nlabel dotted chord diagrams. Let D be a dotted chord diagram, then we label\nits chords and dots on the same footing in the order as they appear along the\narc, e.g.\n1\n\n2\n\n4\n\nq q q q q q q ✲\nq\n3\n\n5\n\nDefinition 2 The labelled intersection graph of a dotted chord diagram D is a\ngraph with coloured vertices. It is composed of the labelled intersection graph\n(with, say, white vertices) of the diagram D with all dots removed but keeping\nthe original labels of the diagram D, and an additional set of, say, black vertices,\none for each dot in D, also with the labels from D. An edge connects a black\nvertex with a white vertex provided that on the arc, the dot corresponding to\nthe black vertex is between the two endpoints of the chord corresponding to\n3\n\n\fthe white vertex. The adjacency matrix of the labelled intersection matrix of a\ndotted chord diagram was called the extended incidence matrix in [1]. A dotted\nchord diagram is called connected if its labelled intersection graph is connected.\nExample The labelled intersection graph\n❜ ❜ r\nq q q q q q q ✲\nq\nis the graph 1 2 3\na symmetric 5 × 5-matrix J with J12 = 1, J23\n\nof the dotted chord diagram\n❜ r\nIts adjacency matrix is\n4 5\n= 1.\n\nBefore reformulating the definition of quasiplanar Wick products from [1]\nin the present context, we need some more definitions. We first extend the\ndefinition of regular chord diagrams [7].\nDefinition 3 A dotted chord diagram is called regular, if for any two pairs of\ndistinct points (x, y) and (w, z) in the diagram whose chords do not intersect,\nboth x and y appear either on the right hand side or on the left hand side of\nboth z and w on the arc.\nFor example, the diagram q q q ✲\nq is regular (and connected), while the\ndiagram q q q ✲\nq is not regular.\nDefinition 4 A dotted chord diagram is called quasiplanar, if for any two pairs\nof points (x, y) and (z, z) in the diagram, both x and y appear either on the\nright hand side or on the left hand side of z on the arc.\nObserve that a diagram is quasiplanar if and only if its labelled intersection\ngraph does not contain any edges between back and white vertices. For example, the diagram q q q q q q q q✲ is quasiplanar (regular, not connected),\nwhile the diagram q q q q q q q q✲ is not quasiplanar (but still regular).\nObserve that any diagram without dots and any diagram without chords is\nquasiplanar. In particular, the diagram q q q q✲ is quasiplanar (but not\nregular).\nWe will now consider regular quasiplanar diagrams, and denote by Vnrq the\nsubspace of Vn that is spanned by regular quasiplanar\nL rq dotted chord diagrams\nof dot-degree n. We also use the notation V rq =\nVn .\n\nRemark 5 It is not difficult to see that a product of connected quasiplanar\ndiagrams is regular quasiplanar and that any regular quasiplanar diagram can\nbe written in a unique way as a product of nontrivial connected quasiplanar\ndiagrams. More generally, any regular diagram can be written in a unique way\nas a product of nontrivial connected diagrams.\n\nFor this reason, connected quasiplanar diagrams will turn out to be important. Observe in particular, that a connected quasiplanar dotted chord diagram\nD is either the diagram q✲ or it does not contain any dots. Unless it is of\ndot-degree 1, a connected quasiplanar dotted diagram therefore has even dotdegree. We will denote by Dncq the set of all connected quasiplanar dotted chord\ndiagrams of dot-degree n, and by Dcq the set of all connected quasiplanar dotted\nchord diagrams.\n4\n\n\fIn what follows, let us denote an (unlabelled) diagram without chords of\ndot-degree n by [n],\n[n] =\nq q . . . q q✲\nwith the convention [0] = ∅.\nDefinition 6 We define a linear map W : V → V , called the quasiplanar Wick\nmap, by setting W(D) = 0 if D contains a chord, and for chordless diagrams,\nwe define W inductively by W(∅) = ∅, and for n ≥ 1,\nX\nX\nW([n]) =\nD\n(−1)m+1 f ([m]) W([n − m])\nwith\nf ([m]) =\ncq\nD∈Dm\n\n06=m≤n\n\nwhere the sum in the definition of f runs over all connected quasiplanar diagrams\nof dot-degree m. We call the image W([n]) the n-fold quasiplanar Wick product.\nProposition 7 For any n ≥ 1, we have\nn X\nX\n\nW([n]) =\n\nK=1 Di\n\n(−1)n+K D1 * * * DK\n\n(1)\n\nwhere the sum runs overPall nontrivial diagrams Di ∈ Dcq whose dot-degrees\nare a partition of n, i.e. K\ni=1 ddegDi = n.\nProof: The claim is almost obvious from the definition, although the formal\nproof turns out to appear complicated. Clearly, the claim is true for n = 1, since\nW([1]) = [1] which is the only connected quasiplanar diagram of dot-degree 1.\nNow, assume the claim to be true for [n]. Then by the induction hypothesis and\ninserting the definition for f ([2l]), we have\n\nW([n + 1]) = f ([1])W([n]) −\n= [1]\n\nn\nX\n\nf ([2l]) W([n + 1 − 2l])\n\nK\nP\n\n(−1)n+K D1 * * * DK\n\nDi ∈ Dcq\n\ni=1\n\ncq\nD0 ∈D2l\n\nn+1−2l\nX\nK=1\n\nX\n\n(−1)n+1+K−2l D0 D1 * * * DK (3)\n\nDi ∈ Dcq\nK\nP\nddegDi = n + 1 − 2l\ni=1\n\nNow, line (3) in the above can be rewritten as\n−\n\nn−1\nX\n\n(2)\n\nddegDi = n\n\nn+1\n[X\n2 ]\nX\n\nl=1\n\nl=1\n\nX\n\nK=1\n\n−\n\nn+1\n[X\n2 ]\n\nX\n(−1)n+1+K D0 D1 * * * DK\n\nK=0 Di\n\n5\n\n\fwherePthe second sum runs over all nontrivial diagrams D0 , D1 , . . . , DK ∈ Dcq\nK\nwith i=0 ddegDi = n + 1 and ddegD0 ≥ 2. Observe that for n even, the sum\nactually starts with K = 1, since for K = 0, the second sum is empty (we would\nhave ddegD0 = n + 1, in contradiction with the fact that the dot-degree of D0\nhas to be even). Shifting the summation index by one, we then find that line (3)\nis equal to\nn X\nX\n−\n(−1)n+M D1 * * * DM\nM=1 Di\n\nwhereP\nthe second sum now runs over all nontrivial diagrams D1 , . . . , DM ∈ Dcq\nM\nwith i=1 ddegDi = n + 1 and ddegD1 ≥ 2. Observe that this sum can be\nextended to include the case M = n+1, since the sum over the diagrams is empty\nin that case (since the conditions ddegD1 ≥ 2 and ddegD1 + * * * + ddegDn+1 =\nn + 1 cannot be fulfilled simultanously). Using that the diagram [1] is in fact\nthe sum over all diagrams D0 ∈ Dcq with ddegD0 = 1, and again shifting the\nsummation index, we now rewrite line (2) in the above as follows\nn+1\nX\n\nX\n\nM=2 Di\n\n(−1)n+M+1 D1 * * * DM\n\ncq\nwhere\nPM the second sum runs over all nontrivial diagrams D1 , . . . , DM ∈ D with\ni=1 ddegDi = n + 1 and ddegD1 = 1. This sum can in fact be extended to\ninclude M = 1, since for n ≥ 1, the sum over the diagrams is empty in this case\nanyway. Putting both sums together proves the proposition.\n\nExample With the notation from above, we have\nW([4]) =\n=\n\n[1] W([3]) −\nq q q q✲ −\n| {z } |\nK=4\n+\n|\n\nW([2]) −\nq ✲\nq\nq q q q✲ −\n\nq q q ✲\nq\n\nq q q ✲\nq\n−\n{z\nK=3\n\nq q q ✲\nq\n}\n\nq\nq q q ✲\nq − q q q ✲\n{z\n}|\n{z\n}\nK =2\nK =1\n\nCorollary 8 The image of the quasiplanar Wick map W is contained in the\nspace of regular quasiplanar diagrams\nV rq\u0001. It is a projection, W\n\u0001\n\u0001 ◦ W = W.\nMoreover, we have ∆ W([n]) ∆ W([m]) = ∆ W([n]) W([m]) .\n\nProof: All claims are a consequence of the equality given by Proposition 7.\nThe first claim follows immediately, since all terms on the right hand side of the\nequation are regular and quasiplanar. All but the last term in the sum on the\nright hand side (where K = ddeg([n]) = n) contain at least one chord, so the\nsecond claim follows from the definition of W. The third claim is a consequence\nof the fact that (V, μ, ∆) is a bialgebra.\n\n6\n\n\fProposition 9 For the product of two quasiplanar Wick products W([n]) and\nW([m]), we find the relation\nW([n])W([m]) = W([n + m]) +\n\nn+m\nXX\nK=1 Di\n\n(−1)n+m+K+1 D1 * * * DK\n\n(4)\n\ncq\nwhere the sum runs over all nontrivial diagrams D1 , . . . , DK ∈ DP\nsuch that\nP\nK\nS\nddegD\n=\nn+m\nbut\nwhere\nno\n1\n≤\nS\n≤\nn+m\nexists,\nsuch\nthat\ni\ni=1 P\ni=1 ddegDi =\nK\nn and i=S+1 ddegDi = m.\n\nProof: We write down the expressions for W([n]), W([m]), and W([n + m]) according to Proposition 7. It is then not difficult to establish that all terms which\nappear in the product W([n])W([m]) also appear in W([n+m]). The converse is\nnot true; the diagrams that appear in W([n + m]) but not in W([n])W([m]) are\nthe regular diagrams which contain chords connecting some of the first n points\nwith some of the last m−n+1\nPK points. These diagrams are of the form D1 * * * DK\nwith Di ∈ Dcq such that i=1 ddegDi = n + m but where no 1 ≤ S ≤ n + m exPK\nPS\nists, such that i=1 ddegDi = n and i=S+1 ddegDi = m. They each appear\nwith prefactor (−1)n+m+K . Subtracting all such diagrams (with their prefactors) from W([n + m]) therefore yields the product W([n])W([m]). This proves\nthe proposition.\nThe signs which appear in equation (4) above can also be given in terms of\nthe number of connected diagrams with dot-degree strictly larger than 1. More\ngenerally, we have:\ncq\nRemark\nP 10 For any product D1 * * * DK with nontrivial diagrams Di ∈ D ,\nand\nddegDi = n, we have\n\n(−1)n+K D1 * * * DK = (−1)d2 D1 * * * DK\n\nwhere d2 is the number of connected quasiplanar diagrams in D1 * * * DK with\ndot-degree strictly greater than 1. To see that this is true, observe that (−1)n+K =\n(−1)n−K , and that K = d1 + d2 , where d1 counts the number of connected diagrams of dot-degree 1. Now, any quasiplanar connected diagram of dot-degree\n> 1 has even dot-degree, hence n − d1 is even, and the claim follows.\nExample We have\nW([2]) W([2]) =\n\nW([4]) +\n|\n\n7\n\nq q q q✲ + q q q q✲\n{z\n} |\n{z\n}\nK =1\nK =3\n\n\fand\nW([2]) W([3]) =\n\nW([5]) +\n|\n−\n|\n\nq q q q ✲\nq + q q q q q✲\n{z\n}\nK=2\n\nq q q q q✲ +\n{z\n} |\nK =3\n\nq q q q q✲\n{z\n}\nK=4\n\nFor reasons inherent to quantum field theory, it is desirable to rewrite all terms\non the right hand side of equation (4) in terms of the quasiplanar Wick map\nW. This is achieved by first extending W to diagrams with chords. The image\nof this extension is contained in the vector space of quasiplanar diagrams, but\nin general no longer in the vector space of regular quasiplanar diagrams. The\nconstruction is not yet fully understood in algebraic terms and is not necessary\nto understand the results presented in the remaining sections of this paper.\nBy Proposition 7, a dotted diagram without chords [n] can obviously be\nrewritten as follows\n[n] = W([n]) −\n\nn−1\nX\n\nX\n\nK=1 Di\n\n(−1)n+K D1 * * * DK\n\nP\nwhere the sum runs over all nontrivial diagrams Di ∈ Dcq with K\ni=1 ddegDi =\nn. We would like to iterate this process of replacing dots by Wick products\nalso in diagrams containing chords (such as the terms of the sum over K in the\nabove).\nThe map W itself cannot be used to that end, since it maps any diagram\ncontaining a chord to 0. We now define an extension W ′ of W which is equal to\nW on diagrams without chords and on quasiplanar diagrams with chords acts\nas W on the diagram's dots while leaving the rest of the diagram unchanged.\nObserve that W ′ takes values in the vector space of quasiplanar, but not necessarily regular diagrams, i.e. the image of W ′ is not in general contained in V rq .\nWe again call a term of the form W ′ (D), where D is a diagram, a quasiplanar\nWick product.\nExample We have\nW ′(\n\nq q q q q q✲ )\n\n=\n\nq q q q q ✲\nq\n−\n\n+\n\n−\n\nq q q q q q✲ −\nq q q q q q✲ −\n\nq q q q q q✲\nq q q q q ✲\nq\nq q q q q ✲\nq\n\nCompare this with the quasiplanar Wick product W([4]) given on page 6.\nIterating the procedure of replacing products of dots by quasiplanar Wick\nproducts using W ′ , we can rewrite any quasiplanar dotted chord diagram D in\nterms of elements of the image of W ′ and of diagrams without dots. This means\n8\n\n\fthat the image of W ′ together with diagrams without dots provides a basis for\nquasiplanar dotted chord diagrams. The algebraic meaning of this, however,\nremains to be understood.\nExample The diagram\n=\n\nW ′ ( q q q q q q✲ ) −\n+\n\n=\n\nq q q q q q✲ is equal to the sum\n\nq q q q q q✲\n\n+\n\nq q q q q ✲\nq\n+\nq q q q q ✲\nq\n\nW ′ ( q q q q q q✲ ) −\n\n+\n\nq q q q q ✲\nq\n+\n\n+ W ′ ( q q q q q q✲ ) −\n\nq q q q q ✲\nq\n\n+ W ′( q q q q q ✲\nq ) −\n\nq q q q q ✲\nq\n\n+ W ′( q q q q q ✲\nq ) −\n\nq q q q q ✲\nq\n\nq q q q q ✲\nq\nq q q q q q✲\nq q q q q ✲\nq\n\nIn particular, we can use the map W ′ to rewrite all terms on the right hand\nside of equation (4) from Proposition 9 in terms of quasiplanar Wick products.\nThe resulting equation is what is called the quasiplanar Wick theorem in [1, 2].\n\n4\n\nThe shuffle Hopf algebra\n\nBy Corollary 8, the image of the quasiplanar Wick map W is contained in\nthe space of quasiplanar regular diagrams V rq . We will now consider a Hopf\nstructure on V rq such that the quasiplanar Wick map can be understood as\na convolution in this Hopf algebra. Incidentally, the ordinary Hopf algebra of\nchord diagrams does not seem to be natural in this context, but instead we have\nto consider the Hopf structure.\nBy remark 5, any regular quasiplanar diagram can be uniquely written as a\nproduct of connected quasiplanar diagrams. We use this to endow V rq with a\ncommutative product, the so-called shuffle product μ# : V rq ⊗ V rq → V rq ,\nX\nDσ(1) * * * Dσ(n+m)\nμ# (D ⊗ D′ ) =\nσ∈Shn,m\n\n′\n\nwhere D = D1 * * * Dn and D = Dn+1 * * * Dn+m with Di nontrivial, quasiplanar,\nand connected, and where Shn,m = Sn+m /Sn × Sm is the set of shuffle permutations, that is all elements σ of Sn+m which leave the order of the first n\nelements and that of the last m elements unchanged, i.e. σ(1) < σ(2) < . . . σ(n)\nand σ(n + 1) < σ(n + 2) < * * * < σ(n + m). We will usually write a#b for\nμ# (a ⊗ b). It is known that the shuffle product allows for a Hopf structure with\nthe deconcatenation product as coproduct ∆dc : V rq → V rq ⊗ V rq ,\n∆dc (D) = 1 ⊗ D + D ⊗ 1 +\n\nn−1\nX\nk=1\n\n9\n\nD1 * * * Dk ⊗ Dk+1 * * * Dn\n\n\ffor D = D1 * * * Dn with Di nontrivial, quasiplanar and connected. Here, 1 denotes the empty diagram ∅ = [0] which is the unit for the shuffle product. The\ncounit is the map ǫ that is equal to 1 on the empty diagram and 0 elsewhere. The\nantipode of this Hopf algebra is S(D1 * * * Dn ) = (−1)n Dn * * * D1 where the diagrams Di are nontrivial, quasiplanar, and connected. Observe that (V, μ# , ∆dc )\nis a commutative non-cocommutative graded connected Hopf algebra.\nExample We have\nq q q q✲\n\n#\n\nq q q ✲\nq\n=\n\n=\n\nq q q q q q q ✲\nq\n+\nq q q q q q q ✲\nq\n+\nq q q q q q q ✲\nq\n+ q q q q q q q ✲\nq\n\nand\n∆dc ( q q q q q q q ✲\nq )\n\n=\n\nq\n⊗1\n= 1 ⊗ q q q q q q q q✲ + q q q q q q q ✲\nq\n+\nq q q q q✲ ⊗ q q ✲\nq\n+ q q q q✲ ⊗ q q q ✲\n+\n\nq q q q q q q✲ ⊗\n\n✲\nq\n\nBy definition, the primitive elements of this Hopf algebra are the connected\nquasiplanar diagrams.\nProposition 11 Let h : V → V be the map defined by h([0]) = 1, h(D) = 0 for\nany diagram D containing chords and for any diagram of the form D = [2k + 1],\nand let\nn\nX\nX\nh([n]) =\n(−1)K\nD1 * * * DK\nK=1\n\nDi\n\nfor even n, where the second sum runs over\nPall connected quasiplanar diagrams\nof dot-degree strictly greater than 1 with\nddegDi = n. Then the quasiplanar\nWick product on diagrams without chords is the convolution of the identity map\nwith h with respect to the shuffle Hopf algebra,\nW([n]) = id ⋆ h ([n]) = μ# ◦ (id ⊗ h) ◦ ∆dc ([n])\nProof: By the definition of ∆dc , and observing that h([0]) = 1, we find\nμ# ◦ (id ⊗ h) ◦ ∆dc ([n]) =\n=\n\nμ#\n\nn\n\u0010X\nr=0\n\n[r] ⊗ h([n − r])\n\n\u0011\n\nn−1\n\u0010\n\u0011\nX\n[r] ⊗ h([n − r])\nμ# 1 ⊗ h([n]) + [n] ⊗ 1 +\nr=1\n\n10\n\n\fNow, inserting the definition of h, we find for the third term\nn−1\nX\nr=1\n\n[r] ⊗ h([n − r])\n\n=\n\nn−1\nXX\n\nL=1 Di\n\n(−1)d2 D1 . . . Dr ⊗ Dr+1 * * * DL\n\nHere,P\nthe sum runs over all nontrivial quasiplanar connected diagrams D1 , . . . , DL\nwith\nddegDi = n where at least one and at most n − 1 diagrams are of dotdegree 1, d2 denotes the number of diagrams with dot-degree ≥ 2, and moreover,\nall diagrams Di of dot-degree 1 are in the tensor product's first entry. Observe\nthat this last condition fixes the value of r in the above.\nApplication of the shuffle product μ# then yields h([n]) + [n] for the first\ntwo terms and for the sum above it distributes the diagrams of dot-degree 1, i.e.\nthe dots [1] from the tensor product's first entry, in all possible orders between\nthe connected components of higher dot-degree. This yields all the terms that\nappear on the right hand side of equation (1) in Proposition 7, and by remark 10,\nalso the signs (−1)d2 match those appearing in equation (1). This proves the\nproposition.\nExample For the diagram [4], we have indeed\nμ# (id ⊗ h)∆dc ([4]) =\n\nμ# (id ⊗ h)(1 ⊗\n+\n\n+\n=\n\nμ# (− 1 ⊗\n−\n\n=\n\n+\nq q q ✲\nq\nq q✲ ⊗\n\nq q ✲\nq\n+\n\nq ✲\nq\n+\n\nq q q✲ ⊗\n\nq q q ✲\nq\n+1⊗\n\nq ✲\nq\n⊗\n\n✲\nq\n⊗\n\n✲\nq\n+\n\nq q q q✲ ⊗ 1)\n\nq q q q✲ + 0\n\nq ✲\nq\n+ +0 +\n\nq q q q✲ ⊗ 1)\n\nW([4])\n\nThere is reason to hope that the extension W ′ of W can be understood in algebraic terms in a similar manner, and that an algebraic version of the quasiplanar\nWick theorem can be given.\n\n5\n\nRelation to quantum fields on the noncommutative Minkowski space\n\nLet me now recall from [1, 2] how the graphical language of the previous sections\nencodes certain operator valued distributions of quantum field theory on the\nnoncommutative Minkowski space. The noncommutative Minkowski space\nMθ := Chq0 , q1 , q2 , q3 i/Rθ\n\n11\n\n\fis a quotient of the free algebra of 4 generators Chq0 , q1 , q2 , q3 i, where Rθ is the\nideal defined by qμ qν − qν qμ − iθμν I for μ, ν ∈ {0, 1, 2, 3} with a nondegenerate\nantisymmetric matrix (θμν ) ∈ M (4 × 4, R). In order to define quantum fields\non Mθ , it is convenient to work with the corresponding Weyl algebra generated\nby the Weyl operators\neikq ,\n\nwhere kq =\n\n3\nP\n\nk μ qμ with k ∈ R4 , k μ =\n\nμ=0\n\n3\nP\n\nkν η νμ , η = diag(+, −, −, −)\n\nν=0\n\nsuch that for p, k ∈ R4 ,\ni\n\neikq eipq = e− 2 kθp ei(p+k)q\n\nwith kθp =\n\n3\nP\n\nk μ θμν pν\n\nμ,ν=0\n\nThe signs in the symmetric form η above (the Minkowski metric) are at this\npoint merely a convention with no important consequences. The signature of\nη will, however, play a decisive role when the partial differential operators that\nare relevant in field theory are considered. In fact, questions of renormalization\nsubstantially depend on the signature of η, as I will show elsewhere [9].\nConsider the operator valued distribution φ given by the free massive scalar\nreal Klein Gordon field. Let ω be a state (i.e. a positive linear functional) on the\nWeyl algebra, and let ψω denote its associated Wigner function whose Fourier\ntransform is ψ̂ω (k) = ω(eikq ). Then the free massive scalar real Klein Gordon\nfield φ on quantum spacetime E is defined as an affine functional on a dense set\nof the state space of the Weyl algebra, with values in the endomorphisms of a\ndense subset of Fock space, see [8], by the equation\nφ(ω) = φ(ψω ) .\n\n(5)\n\ncn (k1 , . . . , kn ) := ω(Qn eikj q ),\nLet n > 0, let f be a Schwartz function on R4n , let ψ\nω\nj=1\nand let × denote the convolution. Then the regularized power of φ is defined by\nφnf (ω) = φ⊗n (ψωn × f ) .\n\n(6)\n\nwhere φ⊗n is the operator valued distribution\nQn in n variables, formally defined\nby its integral kernel φ⊗n (x1 , . . . , xn ) = i=1 φ(xi ) as usual. In our graphical\nlanguage, the regularized power φnf is symbolized by a dotted diagram of dotdegree n without chords,\nφnf\n\n↔\n\n[n] =\n\nq q\n\n...\n\nq q✲\n\nWe have defined a renormalization procedure [1, 2] for such powers of fields,\nbased on a certain notion of locality, which has lead to the definition of quasiplanar Wick products. In [8] we will complete the proof that this procedure leads\nto operator valued distributions that are still well-defined when the Schwartz\nfunction f is replaced by a δ-distribution. The functional analytic details however, are not our concern here.\n12\n\n\fInstead, I will take the definition of quasiplanar Wick products for granted\nand merely recall how the distributions which appear in that definition can be\nsymbolized in terms of dotted chord diagrams.\nLet D be a dotted chord diagram whose labelled intersection graph G has\nadjacency matrix J. Let N denote the set of labels in G, let U ⊂ N and A ⊂ N\ndenote the subsets which label the black vertices (dots) and the white vertices\n(chords) in G, respectively. Let f be a Schwartz function f ∈ S(R4n ) which is\nsymmetric in its arguments, f (x1 , . . . , xn ) = f (xπ(1) , . . . , xπ(n) ) for any π ∈ Sn .\nThen the labelled intersection graph G of D determines a Schwartz function\nfG ∈ S(R4u ) where u = |U | by setting its Fourier transform to\nZ Y\nX\n\u0001\nfc\ndμ(ka ) exp − i\nJst ks θkt fˆ(kA , −kA , kU )\nG (kU ) =\na∈A\n\ns<t ∈N\n\nwith the Lorentz invariant measure on the positive mass shell dμ(k), and where\nfor an index set I, the symbol kI abbreviates the tuple (ki )i∈I and\nR where each\nki is an element of R4 . The explicit form of these integrals is dμ(k)f (k) =\np\nR 3 p\n−1\nf ( p2 + m2 , p) for f ∈ S(R4 ), p ∈ R3 . We extend the\nd p p 2 + m2\ncorrespondence D ↔ fG by linearity.\nThe operator valued distribution corresponding to G, evaluated in a testfunction f , is then given as follows\nwhich by (6) is equal to φ⊗u (ψωu × fG ) .\n\u0001\nP\nObserve that the socalled twisting exp − i s<t ∈N Jst ks θkt contains products ku θka or ka θku where u ∈ U and a ∈ A, if and only if the dotted diagram\nis not quasiplanar.\nTranslating all graphs from Definition 6 according to the above indeed yields\nthe definition of quasiplanar Wick products from [1, 2]. The quasiplanarity of\nall terms on the right hand side of the equation in Proposition 7 means that the\ncorresponding distributions fulfill the locality condition requested in [1, 2].\nNote that in the investigation of quantum fields on the noncommutative\nMinkowski space, we also considered non-regular diagrams. It is known that\nonce we admit for non-regular diagrams, a chord diagram is no longer uniquely\ndetermined by its labelled intersection graph. For example, the labelled interq To distinguish\nsection graph of q q q q✲ is the same as that of q q q ✲\nsuch diagrams, we used a slightly more complicated definition of fG than the one\ngiven above. It is based on the use of arbitrary Schwartz functions f (which are\nin general not symmetric under reordering their arguments), where for a ∈ A,\nthe positions of the arguments ±ka in fˆ encode the starting and end point of\nthe chords. For instance, for the two examples above we would have\nZ\nZ\nˆ\ndμ(k1 )dμ(k2 ) f (k1 , k2 , −k2 , −k1 ) and\ndμ(k1 )dμ(k2 ) fˆ(k1 , −k1 , k2 , k2 ) ,\nφufG (ω)\n\nrespectively. In this manner, the diagram itself, not only its labelled intersection\ngraph is encoded,\nD ↔ fD\n13\n\n\fand in particular, non-regular graphs can be distinguished. This more general definition coincides with the one given above when we consider Schwartz\nfunctions that are symmetric under rearranging their arguments.\n\n6\n\nKnots\n\nBy a theorem of Kontsevich, universal properties of knot invariants of finite\ndegree are captured in terms of the vector space of chord diagrams modulo\ncertain ideals given by the so-called framing independence and the 4T relation.\nAn important tool in this framework are weight systems.\nA weight system of degree m is a linear functional on the quotient of chord\ndiagrams of degree m modulo the framing independence and the 4T relation. It\nis natural to ask whether in the special special case of diagrams without dots,\nthe correspondence D ↔ fD , extended by linearity, defines a weight system.\nUnfortunately, this does not seem to be the case, as the correspondence\nis not well-defined on the quotient, as the 4T relation apparently cannot be\nsatisfied, even for modifications of the correspondence above. Let us recall that\nthe framing independence relation is that an arbitrary chord diagram containing\nan isolated chord (i.e. one that does not intersect any other chord) is 0, and\nthat the 4T relation in terms of diagrams reads\n\nqq\n\nq\n\nq✲ −\n\nqq\n\nq\n\nq✲\n\n=\n\nq\n\nqq\n\nq✲ −\n\nq\n\nqq\n\nq✲\n\n=\n\nq\n\nq\n\nqq✲ −\n\nq\n\nq\n\nqq✲\n\nwhere arbitrary chords may be added in all 6 diagrams in the same positions in\nsuch a way that the two points which are underlined remain neighbours.\nWe now consider the framing independence relation. Let D be a diagram\n(without dots) of degree n (i.e. of dot-degree 2n), let J denote the adjacency\nmatrix of the corresponding labelled intersection graph G. Let f ∈ S(R3n ) be\nsymmetric under reordering its arguments, and consider the map\nG\n\n→\n\nZ Y\nn\n\ni=1\n\ndμ(pi ) exp − i\n\nX\ns<t\n\nJst ps θpt\n\n\u0001\n\nf (p1 , . . . , pn )\n\n(7)\n\np\nwhere p = ( p2 + m2 , p). The right hand side is very similar to the definition\nˆ\nof fG , the sole\n√ difference being that we use a function f (k) in place of f (k, −k)\n2\n2\nwhere k = ( k + m , k). Now, let j be the label of an isolated chord in D. By\ndefinition, we have Jjk = 0 and Jkj = 0 for all k. Hence, the integral above is\nzero on diagrams with isolated chords as desired provided we choose a Schwartz\nfunction f with total integral 0.\nWe now try to implement the 4T relation as well. To that end, we use\nLemma XX.3.1. from [3]: Let D be a diagram (without dots) containing at\nleast 2 chords, let x be the point on the arc that is furthest to the left, let (x, y)\n14\n\n\fbe the corresponding chord. Consider a point x′ to the right hand side of D on\nthe arc. Then the diagram D′ = (D \\ (x, y)) ∪ (y, x′ ) and D coincide modulo\nthe 4T relation.\nIn order to define a weight system, the correspondence (7) must therefore\nyield the same result for any two diagrams\n\nq\n\nq\n\nx\n\ny\n\nq\n\n✲\n\n✲\nq\nx′\n\ny\n\nwith an arbitrary number of additional chords placed in the same positions in\nthe two diagrams, as indicated by the dotted chords.\nNow label the first of these diagrams starting with the label 0. Then the\nmap (7) gives the integral\nZ\n\ndμ(p0 )\n\nn−1\nY\ni=1\n\ndμ(pi ) exp − i\n\n* exp − i\n\nX\n\nX\n\nJ0t p0 θpt\n\n0<t≤n−1\n\nJst ps θpt\n\n0<s<t≤n−1\n\n\u0001\n\n\u0001\n\n*\n\nf (p0 , . . . , pn−1 )\n\nLabelling the second diagram with labels 1, . . . , n, on the other hand yields the\nintegral\nZ Y\nn\n\ni=1\n\ndμ(pi ) exp −i\n\nX\n\n\u0001\nJst ps θpt exp −i\n\n0<s<t≤n−1\n\nX\n\nJtn pt θpn\n\n0<t≤n−1\n\n\u0001\n\nf (p1 , . . . , pn )\n\nAs the matrix θ is antisymmetric, one might think of changing the variables\npn = −p0 , but this\np sign in the exponentials which involve\np would leave a wrong\nthe component p2n + m2 of pn = ( p2n + m2 , pn ). We conclude that the\nmap (7) cannot well defined on the quotient given by the 4T relation.\nOne might therefore try to slightly change the map (7) by considering integrals over R2n or R4n , instead of integrals over the mass shell1 ,\nG\n\n→\n\nZ Y\nn\n\ni=1\n\nd4 pi exp − i\n\nX\ns<t\n\nJst ps θpt\n\n\u0001\n\nf (p1 , . . . , pn )\n\n(8)\n\nwhere f ∈ S(R4n ). In order to accomodate Rthe framing independence relation,\nwe would again ask that the total integrals dpi f (p1 , . . . , pn ) vanish.\nThe attempt to also implement the 4T relation however, leaves no other\npossibility than to choose f = 0, thus producing the trivial weight system. To\nsee this, observe that according to the discussion of the map (7) this would\nrequire that\nf (p1 , . . . , pn−1 , −p0 ) = f (p0 , p1 , . . . , pn−1 )\n1 Observe that an antisymmetric matrix has even rank, so even if θ has maximal rank, a\ntwisting exp(−ikθp) would be independent of one component of k ∈ R2k+1 .\n\n15\n\n\fin contradiction with the framing independence relation.\nA last loophole might be to consider the map that is 0 on diagrams containing\nisolated chords and is otherwise given by (8). However, even in this case, the\n4T relation does not hold. To see this, suffice to calculate the twisting for\n\nqq\n\nq\n\nq✲ −\n\nqq\n\nq\n\nq✲\n\nq\n\nqq\n\nq✲ −\n\nq\n\nqq\n\nq✲\n\nand\n\nNotwithstanding, it remains worthwhile to investigate whether some weight system can be associated with distributions from noncommutative field theories.\n\nReferences\n[1] Bahns D, Doplicher S, Fredenhagen K and Piacitelli G 2005 Phys. Rev. D\n71 025022 (Preprint hep-th/0408204)\n[2] Bahns D 2004 PhD Thesis DESY-THESIS-2004-004\n[3] Kassel C 1995 Quantum Groups (New York: Springer)\n[4] Bar-Natan D 1995 Topology 34 423\n[5] Connes A and Kreimer D 1999 Eur. Phys. J. C 7 697 (Preprint\nhep-th/9808042)\n[6] Bar-Natan D and Garoufalidis S 1996 Inv. Math. 125 103\n[7] Stoimenow A 1998 PhD Thesis FU Berlin\n[8] Bahns D, Doplicher S, Fredenhagen K and Piacitelli G, in preparation\n[9] Bahns D, in preparation\n\n16\n\n\f"}