{"id": "http://arxiv.org/abs/1003.0372v2", "guidislink": true, "updated": "2010-06-30T10:44:27Z", "updated_parsed": [2010, 6, 30, 10, 44, 27, 2, 181, 0], "published": "2010-03-01T15:12:01Z", "published_parsed": [2010, 3, 1, 15, 12, 1, 0, 60, 0], "title": "Distance statistics in large toroidal maps", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1003.5372%2C1003.0264%2C1003.5960%2C1003.4398%2C1003.3968%2C1003.4628%2C1003.1048%2C1003.0743%2C1003.0031%2C1003.5867%2C1003.4151%2C1003.1890%2C1003.0178%2C1003.2185%2C1003.4723%2C1003.5594%2C1003.4654%2C1003.3295%2C1003.0351%2C1003.2786%2C1003.4276%2C1003.3124%2C1003.1106%2C1003.4117%2C1003.5809%2C1003.0599%2C1003.0019%2C1003.1824%2C1003.1240%2C1003.0313%2C1003.0230%2C1003.4560%2C1003.2930%2C1003.2516%2C1003.3609%2C1003.2837%2C1003.2100%2C1003.4374%2C1003.5954%2C1003.2308%2C1003.4214%2C1003.5768%2C1003.0240%2C1003.0880%2C1003.4660%2C1003.5728%2C1003.4462%2C1003.5783%2C1003.6003%2C1003.3989%2C1003.3784%2C1003.2032%2C1003.0372%2C1003.3541%2C1003.3432%2C1003.1390%2C1003.1550%2C1003.2625%2C1003.1200%2C1003.0968%2C1003.2031%2C1003.1072%2C1003.3063%2C1003.1517%2C1003.2605%2C1003.5382%2C1003.3371%2C1003.1135%2C1003.1434%2C1003.5886%2C1003.3144%2C1003.1491%2C1003.2784%2C1003.3182%2C1003.5568%2C1003.2231%2C1003.0929%2C1003.2559%2C1003.2899%2C1003.1942%2C1003.2080%2C1003.2922%2C1003.5393%2C1003.4540%2C1003.0871%2C1003.3988%2C1003.1284%2C1003.1850%2C1003.5961%2C1003.0747%2C1003.0249%2C1003.3227%2C1003.1323%2C1003.2106%2C1003.2477%2C1003.0219%2C1003.5677%2C1003.2396%2C1003.2265%2C1003.2178%2C1003.4659&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Distance statistics in large toroidal maps"}, "summary": "We compute a number of distance-dependent universal scaling functions\ncharacterizing the distance statistics of large maps of genus one. In\nparticular, we obtain explicitly the probability distribution for the length of\nthe shortest non-contractible loop passing via a random point in the map, and\nthat for the distance between two random points. Our results are derived in the\ncontext of bipartite toroidal quadrangulations, using their coding by\nwell-labeled 1-trees, which are maps of genus one with a single face and\nappropriate integer vertex labels. Within this framework, the distributions\nabove are simply obtained as scaling limits of appropriate generating functions\nfor well-labeled 1-trees, all expressible in terms of a small number of basic\nscaling functions for well-labeled plane trees.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1003.5372%2C1003.0264%2C1003.5960%2C1003.4398%2C1003.3968%2C1003.4628%2C1003.1048%2C1003.0743%2C1003.0031%2C1003.5867%2C1003.4151%2C1003.1890%2C1003.0178%2C1003.2185%2C1003.4723%2C1003.5594%2C1003.4654%2C1003.3295%2C1003.0351%2C1003.2786%2C1003.4276%2C1003.3124%2C1003.1106%2C1003.4117%2C1003.5809%2C1003.0599%2C1003.0019%2C1003.1824%2C1003.1240%2C1003.0313%2C1003.0230%2C1003.4560%2C1003.2930%2C1003.2516%2C1003.3609%2C1003.2837%2C1003.2100%2C1003.4374%2C1003.5954%2C1003.2308%2C1003.4214%2C1003.5768%2C1003.0240%2C1003.0880%2C1003.4660%2C1003.5728%2C1003.4462%2C1003.5783%2C1003.6003%2C1003.3989%2C1003.3784%2C1003.2032%2C1003.0372%2C1003.3541%2C1003.3432%2C1003.1390%2C1003.1550%2C1003.2625%2C1003.1200%2C1003.0968%2C1003.2031%2C1003.1072%2C1003.3063%2C1003.1517%2C1003.2605%2C1003.5382%2C1003.3371%2C1003.1135%2C1003.1434%2C1003.5886%2C1003.3144%2C1003.1491%2C1003.2784%2C1003.3182%2C1003.5568%2C1003.2231%2C1003.0929%2C1003.2559%2C1003.2899%2C1003.1942%2C1003.2080%2C1003.2922%2C1003.5393%2C1003.4540%2C1003.0871%2C1003.3988%2C1003.1284%2C1003.1850%2C1003.5961%2C1003.0747%2C1003.0249%2C1003.3227%2C1003.1323%2C1003.2106%2C1003.2477%2C1003.0219%2C1003.5677%2C1003.2396%2C1003.2265%2C1003.2178%2C1003.4659&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We compute a number of distance-dependent universal scaling functions\ncharacterizing the distance statistics of large maps of genus one. In\nparticular, we obtain explicitly the probability distribution for the length of\nthe shortest non-contractible loop passing via a random point in the map, and\nthat for the distance between two random points. Our results are derived in the\ncontext of bipartite toroidal quadrangulations, using their coding by\nwell-labeled 1-trees, which are maps of genus one with a single face and\nappropriate integer vertex labels. Within this framework, the distributions\nabove are simply obtained as scaling limits of appropriate generating functions\nfor well-labeled 1-trees, all expressible in terms of a small number of basic\nscaling functions for well-labeled plane trees."}, "authors": ["E. Guitter"], "author_detail": {"name": "E. Guitter"}, "author": "E. Guitter", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1088/1742-5468/2010/04/P04018", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1003.0372v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1003.0372v2", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "24 pages, 9 figures, minor corrections, new added references", "arxiv_primary_category": {"term": "math-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "math-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "math.CO", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "math.MP", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "math.PR", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1003.0372v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1003.0372v2", "journal_reference": "J. Stat. Mech. 2010 P04018 (2010)", "doi": "10.1088/1742-5468/2010/04/P04018", "fulltext": "Distance statistics in large toroidal maps\n\narXiv:1003.0372v2 [math-ph] 30 Jun 2010\n\nE. Guitter\nInstitut de Physique Théorique\nCEA, IPhT, F-91191 Gif-sur-Yvette, France\nCNRS, URA 2306\nemmanuel.guitter@cea.fr\n\nAbstract\nWe compute a number of distance-dependent universal scaling functions characterizing the distance statistics of large maps of genus one. In particular,\nwe obtain explicitly the probability distribution for the length of the shortest\nnon-contractible loop passing via a random point in the map, and that for the\ndistance between two random points. Our results are derived in the context of\nbipartite toroidal quadrangulations, using their coding by well-labeled 1-trees,\nwhich are maps of genus one with a single face and appropriate integer vertex\nlabels. Within this framework, the distributions above are simply obtained as\nscaling limits of appropriate generating functions for well-labeled 1-trees, all\nexpressible in terms of a small number of basic scaling functions for well-labeled\nplane trees.\n\n1. Introduction\nThe understanding of random maps is a fundamental issue in combinatorics and\nmany map enumeration results were obtained over the years, using for instance recursive\ndecomposition [1], matrix integrals [2, 3] or bijective methods [4-6]. Recall that a map\nof genus h is a proper embedding of a graph in Sh , the compact oriented surface of genus\nh without boundary. By random maps, we mean generically some statistical ensemble\nof maps distributed according to some particular given law. Of particular interest in the\nscaling limit of large random maps, which converge toward nice universal probabilistic\nobjects whose metric properties are only partially understood. This limit is especially\nrelevant to physics, where maps are used as discrete models for fluctuating surfaces, e.g.\nin the field of biological membranes or that of string theory. In physics, maps are often\nequipped with statistical models, such as spins or particles, presenting a large variety of\ncritical phenomena. This gives rise to many possible sensible scaling limits of continuous\nsurfaces, each defining a particular universality class of maps. Their classification and\ncharacterization are the aim of the so-called two-dimensional quantum gravity [7,8],\nwhich also has deep connections with SLE processes [9,10].\nThe simplest universality class is that of the so-called pure gravity, which describes\nthe scaling limit of large maps with prescribed face degrees, such as triangulations\n1\n\n\f(maps with faces of degree 3 only) or quadrangulations (maps with faces of degree 4\nonly), possibly equipped with non-critical statistical models. In this universality class,\na particular attention was payed to the limit of large planar maps, i.e. maps with\nthe topology of the two-dimensional sphere, converging to the so-called Brownian map\n[11,12].\nEven if its topology remains that of a sphere [13,14], the Brownian map presents\nnevertheless intriguing metric properties such as a remarkable phenomenon of confluence\nof its geodesics [15], which reveals an underlying tree-like structure. More quantitatively,\nthe geometry of the Brownian map was characterized by a number of distributions\nmeasuring its distance statistics, such as its two-point function [16-19], which is the law\nfor the distance between two random points in the map and its three-point function [20],\nwhich is the joint law for the three mutual distances between three points. Other refined\ndistributions, measuring e.g. the length of \"separating loops\" or that of the common\npart of confluent geodesics, were also obtained [21]. Beside the spherical topology, the\ncase of maps with a single boundary was also considered [22], with an explicit derivation\nof the law for the distance of a random point to the boundary.\nThe most advanced results on the distance statistics in maps were obtained in the\ncontext of planar quadrangulations, using a bijection by Schaeffer [5] which gives a coding for these maps by so-called well-labeled trees, i.e. plane trees whose vertices carry\ninteger labels with particular constraints. This approach turned out to be the most\nadapted to address distance-related question since the labels precisely encode some of\nthe distances in the original map. An extension of the Schaeffer bijection was also\nfound by Marcus and Schaeffer [23-24], which establishes a bijection between bipartite\nquadrangulations of arbitrary genus h and so-called well-labeled h-trees, which are maps\nof genus h with one face only, and whose vertices carry integer labels with the same\nconstraints as in the planar case. In view of this result, a very natural question is therefore that of the distance statistics in maps of arbitrary genus. The Marcus-Schaeffer\nbijection was used very recently [25] to discuss the scaling limit of large bipartite quadrangulations of fixed genus, showing in particular the convergence to a limiting object\nwith Hausdorff dimension 4, yet to be characterized.\nThe purpose of this paper is precisely to give a quantitative characterization of\nthe distance statistics in large toroidal maps, i.e. maps of genus 1. Here it is worth\nmentioning that toroidal cells or vesicles do exist experimentally [26] and some of our\nresults might be relevant to their description. We will in particular derive an explicit\nexpression for the two-point function of large toroidal maps, which differs from that of\nthe planar case. In the case of genus 1, we may also define a non-trivial \"one-point\nfunction\" by measuring the length of the shortest non-contractible loop passing via a\ngiven point. We give here the corresponding limiting probability distribution for large\nmaps. These results are obtained again in the simplest context of genus 1 bipartite\nquadrangulations, using the Marcus-Schaeffer bijection above with well-labeled 1-trees.\nThe paper is organized as follows: in Section 2, we present our basic tools which\nare a number generating functions for well-labeled (plane) trees with marked vertices,\nwith a particular emphasis on their scaling limit. We then recall in Section 3 the\n2\n\n\fMarcus-Schaeffer bijection between pointed (i.e. with a marked vertex called the origin)\nbipartite quadrangulations of genus h and well-labeled h-trees. As an exercise, we\nshow how to recover the number of genus 1 bipartite quadrangulations from our basic\ngenerating functions of Section 2. We then compute in Section 4 two different one-point\nfunctions for large pointed toroidal maps: the probability distribution for the length of\nthe shortest non-contractible loop passing via the origin of the map and that for the\nlength of the \"second-shortest\" loop, which is the shortest among non-contractible loops\nnot homotopic to the shortest non-contractible one (or its powers). We finally derive\nin Section 5 the expression for the two-point function of large toroidal maps, which is\nthe law for the distance from the origin of a random point in the map. We gather a few\nconcluding remarks in Section 6.\n2. Basic tools: generating functions for well-labeled trees\nIn this section, we recall a number of known expressions for generating functions\nof well-labeled trees and derive a few new ones. As will be apparent later, the explicit\nformulas displayed here will serve as basic tools to obtain, in the next sections, various\ndistance related generating functions in ensembles of large toroidal maps.\nBy well-labeled tree, we mean a plane tree whose vertices carry integer labels such\nthat:\n(i) the labels on two vertices adjacent in the tree differ by at most 1;\n(ii) the minimum label is 1.\nIt is useful to also introduce almost well-labeled trees where (ii) is replaced by the\nweaker condition:\n(ii)' all labels are larger than or equal to 1.\nThe first generating function of interest is that, Rl ≡ Rl (g), of planted almost welllabeled trees, with a weight g per edge, and with root label l (l ≥ 1). In other words,\nthe coefficient of g n in the expansion of Rl as a power series in g gives the number of\nplanted almost well-labeled trees with n edges and root label l. This generating function\nwas computed in [19], with the result:\n(1 − xl )(1 − xl+3 )\n(1 − xl+1 )(1 − xl+2 )\n√\n1\n1\n1 − 1 − 12g\nand x + + 1 =\n.\nwith R =\n6g\nx\ngR2\n\nRl = R\n\n(2.1)\n\nThis particular form is obtained by solving of the recursion relation\nRl =\n\n1\n,\n1 − g(Rl+1 + Rl + Rl−1 )\n\n(2.2)\n\nwith initial condition R0 = 0, expressing that an almost well-labeled tree with root label\nl is coded by the sequence of its descending subtrees, themselves almost well-labeled\ntrees with root label l or l ± 1.\n3\n\n\fThe contribution to Rl of large trees is encoded in the behavior of this generating\nfunction in the vicinity of the critical point g = 1/12. Setting\ng=\n\n1\n(1 − ǫ2 )\n12\n\n(2.3)\n\nwith ǫ → 0, a non-trivial scaling limit is reached for Rl by letting l become large as\nL\nl= √\nǫ\n\n(2.4)\n\nwith L finite. In this limit, we have the expansion\n\u0010\n\u0011\nRl = 2 1 − ǫ F (L) + O(ǫ3/2 )\n\nwith F (L) = 1 +\n\nsinh2\n\n3\n\u0010q\n\n3\nL\n2\n\n\u0011 .\n\n(2.5)\n\nThe scaling function F satisfies the non-linear differential equation\nF ′′ = 3(F 2 − 1)\n\n(2.6)\n\nwhich is the continuous counterpart of eq. (2.2), obtained by expanding this discrete\nequation at order ǫ2 .\nAnother basic generating function is that, Xl (l ≥ 1), of almost well-labeled trees\nwith two distinct (and distinguished) marked vertices carrying the same label l and such\nthat the labels on the (unique) shortest path in the tree joining these two vertices are\nall larger than or equal to l. Adding for convenience a trivial contribution 1 to Xl , we\nhave the recursion relation\n2\nXl = 1 + gRl2 Xl (1 + gRl+1\nXl+1 )\n\n(2.7)\n\nobtained by inspecting the first occurrence of a label l on the shortest path joining the\ntwo marked vertices. The solution of (2.7) reads\n(1 − x3 )(1 − xl+1 )2 (1 − x2l+3 )\nXl =\n(1 − x)(1 − xl+3 )2 (1 − x2l+1 )\n\n(2.8)\n\nwith x as above. In the scaling limit, we have the expansion\n√\n\n\u0001\nǫ C(L) + O(ǫ)\n√\n√ 2 + cosh( 6L)\n√\nwith C(L) = 6\nsinh( 6L)\nXl = 3 1 −\n\n4\n\n(2.9)\n\n\fwhile eq. (2.7), expanded at leading order in ǫ, translates into\nC ′ = C 2 − 6F .\n\n(2.10)\n\nFrom the explicit forms of F and C above, we observe that me may write the identity\nC=−\n\n\u0001\nF ′′\n′ ′\n=\n−\nlog(−F\n)\nF′\n\n(2.11)\n\nsince |F ′ (L)| = −F ′ (L) for real L. In this form, the relation (2.10) is a direct consequence of the relation (2.6).\nA third useful generating function is that, X̃l1 ,l2 (l1 > l2 ≥ 1), of almost welllabeled trees with two distinct (and distinguished) marked vertices carrying respective\nlabels l1 and l2 , and such that labels on the (unique) shortest path in the tree joining\nthem are all strictly larger than l2 (except of course at the endpoint of the path with\nlabel l2 ). By cutting this shortest path at the first occurrence of a label l1 −1, l1 −2, * * *,\nwe may write\nX̃l1 ,l2 =\n\nlY\n1 −1\n\ngRl Rl+1 Xl+1\n\nl=l2\n\n(2.12)\n\n(1− xl2 )(1− xl2 +1 )(1− xl2 +2 )(1− xl2 +3 )(1− x2l1 +3 )\n.\n= xl1 −l2\n(1− xl1 )(1− xl1 +1 )(1− xl1 +2 )(1− xl1 +3 )(1− x2l2 +3 )\nThis last expression is extended to the case l1 = l√\nconvention that\n2 by adopting the√\nX̃l2 ,l2 = 1. In the scaling limit, setting l1 = L1 / ǫ and l2 = L2 / ǫ, we have the\nexpansion\n√\n ̃ 1 , L2 ) + O( ǫ)\nX̃l1 ,l2 = C(L\n\u0011\n\u0010q\n\u0011\n\u0010q\n3\n3\n3\nL\nsinh\nL\ncosh\n(2.13)\n2 1\n2 2\n ̃ 1 , L2 ) =\nwith C(L\n\u0010q\n\u0011\n\u0011 .\n\u0010q\n3\n3\n3\ncosh\n2 L2 sinh\n2 L1\n\nNote that this expression can be obtained alternatively by looking at the continuous\ncounterpart √\nof the product formula in (2.12). Indeed, using gRl Rl+1 Xl+1 ∼ (1/12) ×\n22 × 3 (1 − ǫ C(L)), we may write directly\n ̃ 1 , L2 ) = exp −\nC(L\n\nZ\n\nL1\nL2\n\nC(L) dL\n\n!\n\n\u0010 \u0002\n\u0003L1 \u0011 F ′ (L1 )\n= exp − − log(−F ′ ) L = ′\n2\nF (L2 )\n\n(2.14)\n\nwhich matches (2.13).\nThe final important quantity is what we shall call the \"propagator\", which is the\ngenerating function Kl1 ,l2 (l1 , l2 ≥ 1) of almost well-labeled trees with two distinct (and\ndistinguished) marked vertices with respective labels l1 and l2 , and with no additional\n5\n\n\fcondition on the labels in-between (apart of course from the general conditions (i) and\n(ii)' of almost well-labeled trees). This generating function reads\nmin(l1 ,l2 )\n\nX\n\nKl1 ,l2 = −δl1 ,l2 +\n\nX̃l1 ,l X̃l2 ,l Xl\n\n(2.15)\n\nl=1\n\nas obtained by summing over the minimum label l on the path joining the two marked\nvertices. Note that we insist here on the two marked vertices being distinct, with a path\nof non-zero length in-between and that, if l1 = l2 , we have to subtract an undesired\ncontribution 1 in the sum. The generating function Kl1 ,l2 is solution of the equation\n\u0010\n\nKl1 ,l2 = gRl1 Rl1 +1 (δl1 +1,l2 + Kl1 +1,l2 ) + Rl1 (δl1 ,l2 + Kl1 ,l2 )\n+ Rl1 −1 (δl1 −1,l2 + Kl1 −1,l2 )\n\n\u0011\n\n(2.16)\n\nwith K0,l2 = 0, obtained by looking at the label l1 , l1 ± 1 of the vertex adjacent to the\nfirst marked vertex on the path joining the two marked vertices. We have no compact\nformula for Kl1 ,l2 at the discrete level but, in the scaling limit, eq. (2.15) translates\ninto the expansion\nρ(L1 , L2 )\n√\n+ O(1)\nǫ\nZ min(L1 ,L2 )\n3 C̃(L1 , L)C̃(L2 , L) dL\nwith ρ(L1 , L2 ) =\nKl1 ,l2 =\n\n(2.17)\n\n0\n\nwith a simple factor 3 for the limit of Xl . Using (2.14), we may now compute the\nintegral and write a compact expression for ρ(L1 , L2 ):\n\u0001\nρ(L1 , L2 ) = F ′ (L1 )F ′ (L2 ) × H min(L1 , L2 )\nr !!!\n\u0010\n\u0011\n\u0010\n\u0011\n√\n√\n√\n1\n3\n6L −32 tanh\nwhere H(L) = 6 3 180L+ 6 sinh 2 6L −16 sinh\nL\n.\n2 3\n2\n(2.18)\nNote that the somewhat involved function H(L) is simply characterized by\nH′ (L) =\n\n3\n2\n(F ′ (L))\n\n(2.19)\n\nwith H(0) = 0. It is a straightforward exercise to check that the continuous propagator\nρ(L1 , L2 ) above is solution of the equation\n∂2\nρ(L1 , L2 ) = 6F (L1 )ρ(L1 , L2 ) − 3 δ(L1 − L2 )\n∂L21\n6\n\n(2.20)\n\n\fwhich is the continuous counterpart of (2.16). Up to a (somewhat arbitrary) global\nnormalization of the coordinate L, this is precisely the equation satisfied by the twopoint function of a polymer chain embedded in one\np dimension (with coordinate L)\nsubject to a potential V (L) ∝ F (L) − 1 ∝ 1/ sinh2 ( 3/2L). Heuristically, this polymer\ncorresponds to the (unique) path between the two marked points in the tree and its\nconfiguration in one-dimensional space simply reproduces the sequence of labels along\nthis path. From condition (ii)', the presence of the other attached subtrees exerts on the\npolymer an effective repulsion from the position L = 0 encoded in the potential V (L).\nWhen l1 → ∞, Kl1 ,l2 → 0 unless we also send l2 → ∞, keeping p ≡ l2 − l1 finite.\nDefining\nkp ≡ lim Kl1 ,l1 +p ,\n(2.21)\nl1 →∞\n\nfor an arbitrary integer p, this quantity satisfies the equation\nkp = g R2 (kp−1 + kp + kp+1 + δp,1 + δp,0 + δp,−1 )\nand we find explicitly\nkp =\n\n1 − x3\nx|p| − δp,0\n(1 − x)(1 − x2 )\n\n(2.22)\n\n(2.23)\n\nwith x as in (2.1). In the scaling limit, and for large values of L1 and L2 , we have the\ncorresponding limiting behavior\nρ(L1 , L2 ) ∼\n\n√\n\n√\n6\nexp(− 6 |L1 − L2 |)\n4\n\n(2.24)\n\nwhere we recognize the usual (translation invariant) two-point function for a polymer\nin one dimension without potential.\nThe above quantities Xl , X̃l1 ,l2 and Kl1 ,l2 may alternatively be viewed as generating functions for chains of almost well-labeled trees, with endpoints carrying prescribed\nlabels. In the following, we will consider various generating functions for more involved well-labeled structures coding for toroidal maps. At the discrete level, those are\nnaturally formed of a number of chains as above, attached by their endpoints. The\n ̃ 1 , L2 ) and ρ(L1 , L2 ) for the chain generating\nknowledge of the scaling forms C(L), C(L\nfunctions will be sufficient to derive explicit expressions for the scaling form of these\nmore involved toroidal generating functions. This eventually will translate into explicit\nuniversal scaling functions characterizing the distance statistics of large toroidal maps.\n\n3. The Marcus-Schaeffer bijection for bipartite quadrangulations of genus 1\nOur approach on the distance statistics of large toroidal maps relies on the bijection\nby Marcus and Schaeffer between, one the one hand, pointed bipartite quadrangulations\nof fixed genus h and on the other hand, well-labeled h-trees. By pointed bipartite quadrangulation, we mean a map whose faces all have degree 4 (quadrangulation), whose\n7\n\n\fvertices can be colored in black and white in such a way that adjacent vertices have a\ndifferent color (bipartite) and with a marked vertex called the origin (pointed). It was\nshown by Marcus and Schaeffer [23] that any such map of genus h is bijectively coded\nby a well-labeled h-tree, i.e. a map of genus h with exactly one face (h-tree) and whose\nvertices carry integer labels subject to the two conditions (i) and (ii) of section 2 (welllabeled). As before, it is convenient to also introduce the notion of almost well-labeled\nh-tree where condition (ii) is replaced by the weaker condition (ii)'.\nNote that a quadrangulation with n faces and genus h has 2n edges and n + 2 − 2h\nvertices. The n faces of the quadrangulation are in one-to-one correspondence with the\nedges of the well-labeled h-tree, which therefore has n edges and n+1−2h vertices. These\nn+1−2h vertices are in one-to-one correspondence with the (n+2−2h)−1 vertices of the\nquadrangulation other than its origin, and the label of a vertex in the h-tree is nothing\nbut the distance from the associated vertex to the origin in the quadrangulation. Finally,\nthe 2n corners of the h-tree (i.e. the angular sectors between consecutive edges around\na vertex) are in one-to-one correspondence with the 2n edges of the quadrangulation.\nMore precisely, the corners with label l (i.e. around a vertex with label l) in the h-tree are\nin one-to-one correspondence with the edges of type (l − 1) → l in the quadrangulation,\ni.e. the edges connecting a vertex at distance (l − 1) from the origin to a vertex at\ndistance l.\nIt is useful to recall how to recover the quadrangulation from its well-labeled h-tree\ncoding. For the vertices of the quadrangulation, we take all the vertices of the h-tree\nplus an extra vertex added inside its unique face. This vertex will be the origin of the\n(pointed) quadrangulation. The edges of the quadrangulation are obtained by linking\neach corner with label l in the h-tree to its successor, which is the added vertex for l = 1\nand, for l > 1, the first corner with label l −1 encountered, say counterclockwise around\nthe unique face of the h-tree. These links can be drawn without mutual crossings inside\nthe face of the h-tree and, by construction, they do not intersect the original edges of\nthis h-tree. Note that the sequence of links between the successive successors of a given\ncorner with label l provides a particular geodesic (i.e. shortest) path of length l in the\nquadrangulation, leading from the vertex underlying this corner to the origin vertex.\nAfter drawing the quadrangulation edges, we may erase all the original edges of the\nh-tree as well as all the labels. Note that the obtained quadrangulation is automatically\nbipartite.\nIn the spherical case h = 0, the well-labeled 0-trees are nothing but the well-labeled\ntrees of Section 2, so that our generating functions above translate into generating functions for pointed quadrangulations (note that we need not specify that the quadrangulation is bipartite since this is automatic for h = 0). For instance, choosing a corner\nwith label l in a well-labeled tree amounts to picking an edge at distance l from the\norigin (i.e. an edge of type (l − 1) → l) in the associated quadrangulation. The generating function for pointed planar quadrangulations with a marked edge at distance l is\ntherefore that of planted well-labeled trees with root label l. It is given by Rl − Rl−1\nsince we have to subtract from Rl those configurations with minimum label larger than\nor equal to 2. These undesired configurations correspond exactly to almost well-labeled\n8\n\n\fl1\n\nl2\n\n(a)\n\nl\n\n(b)\n\nFig. 1: The two possible backbones for 1-trees: (a) a generic backbone\nwith two vertices of degree 3 carrying positive labels l1 and l2 linked by\nthree edges and (b) a degenerate backbone with one vertex of degree 4\nwith positive label l, linked to itself by two edges.\nconfigurations having all their labels shifted by 1, hence they are counted by Rl−1 . We\nwill use the same shift argument in the following to transform generating functions for\nalmost well-labeled objects into generating functions for their well-labeled analogs. For\ninstance, the generating function for pointed planar quadrangulations with two marked\ndistinct (and distinguished) vertices at distance l1 and l2 from the origin is given by\nKl1 ,l2 − Kl1 −1,l2 −1 in terms of the propagator.\nIn this paper, we focus on the case h = 1 of toroidal topology. Well-labeled and\nalmost well-labeled 1-trees may be classified according to their backbone obtained as\nfollows: we first delete recursively each vertex with degree 1 and its incident edge until\nno degree 1 vertex is left in the 1-tree. The resulting object is an almost well-labeled\n1-tree whose vertices all have degree larger than or equal to 2 by construction. We call\nthis 1-tree the skeleton of the original 1-tree. We may then erase each vertex of degree 2\nin the skeleton and concatenate the two incident edges, leading to a labeled 1-tree with\nvertices of degree larger than or equal to 3 and with arbitrary positive vertex labels. We\ncall this 1-tree the backbone of the original 1-tree. From the Euler relation for maps, it\nis easily seen that only two types of backbones are possible:\n(a) generic backbones, made of two 3-valent vertices with labels l1 ≥ l2 ≥ 1, linked by\nthree edges (see figure 1-(a));\n(b) degenerate backbones, made of a unique 4-valent vertex with label l ≥ 1 linked to\nitself by two edges (see figure 1-(b)).\nTo obtain all the almost well-labeled 1-trees leading to a generic backbone, we simply\nhave to replace each of the three edges of this backbone by an arbitrary non-empty\nchain of almost well-labeled trees with endpoints labeled by l1 and l2 , as counted by\nthe propagator Kl1 ,l2 . The corresponding generating function reads therefore\n1 3\nK\nif l1 > l2\n3 l1 ,l2\n(3.1)\n1 3\nK\nif l1 = l2 .\n6 l1 ,l1\nHere a factor 1/3 is necessary to avoid over-counting as, in the sum, we recover 3\ntimes the same configuration upon permuting cyclically the three edges of the skeleton.\n9\n\n\fSimilarly, an extra 1/2 factor is necessary to balance the possibility of recovering the\nsame configuration by exchanging the two vertices of degree 3 if they have the same\nlabel. This simple over-counting argument does not hold for configurations presenting\na symmetry and these configurations are therefore enumerated in (3.1) with an inverse\nsymmetry factor, which is a customary statistics. Note that the symmetric configurations are expected to become negligible for maps of large size n so that the symmetry\nfactors have no effect on the scaling limit that we will discuss.\nIf we wish to keep only the well-labeled 1-trees, we have to remove those configurations for which the minimum label is larger than or equal to 2 and, using the same\nshift argument as above, we now get a generating function\n\u0001\n1\nKl31 ,l2 − Kl31 −1,l2 −1\nif l1 > l2\n3\n(3.2)\n\u0001\n1\n3\n3\nKl1 ,l1 − Kl1 −1,l1 −1\nif l1 = l2\n6\nwith the convention Kl1 ,0 = K0,0 = 0.\nSumming first over the smallest label l2 , then over the largest one l1 , we get the\ntotal contribution W1 of all 1-trees having a generic backbone\n)\n(\nlX\n∞\n1 −1\nX\n\u0001\n\u0001\n1\n1\nKl31 ,l1 − Kl31 −1,l1 −1 +\nKl31 ,l2 − Kl31 −1,l2 −1\nW1 =\n6\n3\nl2 =1\nl1 =1\n(\n!\n!)\nl\n−1\nlX\n∞\n1\n1 −2\nX\n1 3\n1 X\n1\n1\n=\nKl31 ,l2 −\nKl31 −1,l2\nK\n+\nK3\n+\n6 l1 ,l1 3\n6 l1 −1,l1 −1 3\nl1 =1\nl2 =1\nl2 =1\n(3.3)\n)\n(\nX\n1\n1 3\nKl31 ,l2\nKl1 ,l1 +\n= lim\nl1 →∞\n6\n3\nl2 <l1\n\n=\n\n1 3 1 X 3 x3 (1 + 2x + 2x2 − 2x3 )\nk =\nk +\n.\n6 0 3 p<0 p\n2(1 − x)4 (1 + x)2\n\nSimilarly, the total contribution W2 of all well-labeled 1-trees having a degenerate backbone is\n∞\nX\n\u0001\n1\nW2 =\nKl21 ,l1 − Kl21 −1,l1 −1\n4\nl1 =1\n\n1 2\n(3.4)\nKl1 ,l1\nl1 →∞ 4\nx2 (1 + 2x)2\n1\n.\n= k02 =\n4\n4(1 − x)2 (1 + x)2\nSumming (3.3) and (3.4), we get the generating function for well-labeled 1-trees which,\n(1)\nfrom the Marcus-Schaeffer bijection is also that, Q• (g) of pointed bipartite quadrangulations of genus 1\n= lim\n\n(1)\nQ•\n\nx2 (1 + 4x + x2 )\n.\n= W1 + W2 =\n4(1 − x)4 (1 + x)2\n10\n\n(3.5)\n\n\fNote that the symmetry factor of a well-labeled 1-tree is also that of the associated\npointed quadrangulation so that symmetric pointed quadrangulations are counted in\n(1)\nQ• with their usual inverse symmetry factor. It is more customary to consider rooted\nmaps, i.e. maps with a marked oriented edge, as they do not involve symmetry factors.\nThe generating function for rooted bipartite quadrangulations of genus 1 is simply\n(1)\n\nQ(1)\n→ = 4Q•\n\n(3.6)\n\nsince there are exactly twice as many edges as vertices in a genus 1 quadrangulation,\neach coming with two orientations. All the enumeration formulas above are consistent\nwith those found in ref. [24].\nIf we are interested only in large maps, we can use the continuous analogs of (3.3)\nand (3.4) giving the leading singularity of W1 and W2 , namely\nZ\n1\n1 L1\ndL2 ρ3 (L1 , L2 )\nW1 ∼ 2 lim\nǫ L1 →∞ 3 0\n√ !3\nZ 0\n√\n6\n1\n1\n= 2\ndP\nexp(−3 6 |P |) =\n3ǫ −∞\n4\n96ǫ2\n√ !2\n6\n3\n1\n1 2\n1\n=\nlim ρ (L1 , L1 ) =\nW2 ∼\nǫ L1 →∞ 4\n4ǫ\n4\n32ǫ\n\n(3.7)\n\n√\nwhich can also be directly read off (3.3) and (3.4) with x ∼ exp(− 6 ǫ). Note that the\ndegenerate case is less singular than the generic case so that the dominant singularity\n(1)\nof Q• or Q(1)\n→ comes from W1 only.\nAlternatively, we deduce from (3.7) the large n behavior of the number of welllabeled 1-trees with n edges having a generic or degenerate backbone\nW1 |g n ∼\n\n12n\n,\n96\n\nW2 |g n ∼\n\n3 12n\n√\n.\n32 πn\n\n(3.8)\n\n(1)\n\nAt large n, the dominant contribution to Q• or Q(1)\n→ comes from configurations with\na generic backbone only and we recover the known asymptotics [24]\n(1)\n\nn\nQ(1)\n→ |g n = 4Q• |g ∼\n\n12n\n24\n\n(3.9)\n\nfor the number of rooted bipartite quadrangulations of genus 1 with n faces.\n4. One-point functions for large toroidal maps\nFor maps with a toroidal topology, we may define several interesting distancedependent one-point functions. Starting with a pointed map, we may consider as a\"selfdistance\" of the origin vertex the length of any shortest non-contractible loop in the map\n11\n\n\fFig. 2: A non-contractible loop (thick red) drawn on a toroidal quadrangulation must intersect the skeleton of the associated 1-tree at one of its\nvertices.\n\ncontaining this origin. In the case of bipartite quadrangulations, we denote this length\nby 2l as it is necessarily even. We may now use the coding of previous section and note\nthat any non-contractible loop in the quadrangulation must intersect the skeleton of the\nassociated 1-tree. Now the edges of the quadrangulation lie strictly inside the unique\nface of the 1-tree and do not cross its edges so that the intersection with the skeleton\nnecessarily takes place at one of the skeleton vertices, say with label l′ (see fig. 2 for\nan illustration). Since l′ is the distance in the quadrangulation from this vertex to\nthe origin, the length of the loop is necessarily larger than or equal to 2l′ so that the\nhalf-length l of a shortest non-contractible loop is larger than or equal to the minimum\nlabel on the skeleton of the 1-tree. Picking now a vertex with minimal label lmin on\nthis skeleton, this vertex has a degree larger than or equal to 2 by construction and we\nmay consider two distinct corners around it. The two sequences of links between the\nsuccessive successors of these corners define two paths of lengths lmin leading to the\norigin, which do not intersect the skeleton and whose concatenation therefore creates a\nnon-contractible loop of length 2lmin . We deduce that\n\nl = lmin (Sk.)\n\n(4.1)\n\nwhere lmin (Sk.) is the minimum label on the skeleton of the 1-tree coding for the pointed\nquadrangulation at hand.\nIn the scaling limit, as already noticed, it is sufficient to consider the contribution\n√\nof configurations\nleading to a generic backbone and we denote by l1 = L1 / ǫ and\n√\n√\nǫ the labels of its two\nvertices\nof\ndegree\n3,\nwith\nl\n≥\nl\n,\nand\nby\nm\n=\nM\n/\nǫ,\nl 2 = L2 / √\n1\n2\n1\n1\n√\nm2 = M2 / ǫ and m3 = M3 / ǫ the respective minimal labels on the three chains linking\nthese vertices in the skeleton, with m1 ≥ m2 ≥ m3 so that lmin (Sk.) = m3 . With these\nnotations, the generating function for almost well-labeled 1-tree whose skeleton has a\n12\n\n\f√\nminimal label lmin (Sk.) = l = L ǫ behaves when ǫ → 0 as\nZ\nZ ∞\nZ ∞\nZ ∞\n2 ∞\n ̃ 2 , M1 ) × 3 C̃(L1 , M2 )C(L\n ̃ 2 , M2 )\ndM2\ndM1\ndL2\ndL1 3 C̃(L1 , M1 )C(L\nǫ2 M3\nM2\nM1\nL2\n3\n2\n= 2 ′\nǫ F (L)2\n=\n\nI(L)\nǫ2\n\nZ\n\n∞\n\nL\n\nwith\n\n3\ndM2 ′\nF (M2 )2\nI(L) =\n\nZ\n\n∞\n\ndM1\n\nM2\n\n1\ntanh4\n96\n\n3\nF ′ (M\n\nr\n\n3\nL\n2\n\n1)\n\n!\n\n2\n\n ̃ 2 , M3 )\n× 3 C̃(L1 , M3 )C(L\nM3 =L\nZ ∞\nZ ∞\ndL1 F ′ (L1 )3\ndL2 F ′ (L2 )3\nL2\n\nM1\n\n.\n\n(4.2)\nNote, as in (2.17), the factors 3 for the limit of each of the discrete terms Xm1 , Xm2\nand Xm3 . Note also the factor 2 accounting for the two possible order of appearance of\nthe minima m1 , m2 and m3 when turning around say the vertex with larger label l1 .\nTo return to well-labeled configurations, we note that, as an alternative to the shift\nargument used in Section 3, we may equivalently use the property that almost welllabeled 1-trees whose skeleton has a minimal label l are in one-to-one correspondence\nwith well-labeled 1-trees whose skeleton has a minimal label smaller than or equal to\nl. This correspondence is obtained by now shifting all labels in the almost well-labeled\n1-tree by a non-negative integer so that its global minimum label (in the whole 1-tree)\nbecomes 1. From the Marcus-Schaeffer bijection, we deduce that (4.2) may alternatively\nbe viewed as the ǫ → 0 leading behavior of the generating function for pointed bipartite\nquadrangulations with a shortest non-contractible loop passing via the origin of (rescaled)\nlength smaller than 2L.\n\nσ (r )\n\nσ'(r )\n\n1\n\n1\n\n0.8\n\n0.8\n\n0.6\n\n0.6\n\n0.4\n\n~r\n\n0.2\n\n1\n\n2\n\n0.4\n\n6\n\n0.2\n\n3\n\n4\n\nr\n\n1\n\n2\n\n3\n\n4\n\nr\n\nFig. 3: Plots of the cumulative probability distribution σ(r) and the associated probability density σ ′ (r) for the rescaled half-length r of the shortest non-contractible loop passing via the origin of a large pointed toroidal\nquadrangulation.\nFrom our one-point toroidal scaling function I(L), we may extract a (cumulative)\n13\n\n\fprobability distribution in the ensemble of bipartite quadrangulations of genus 1 with\nfixed size n (= number of faces), in the limit of large n. At the discrete level, fixing\nthe size amounts to picking the coefficient g n in the generating function at hand, which\ncan be done by a contour integral in g. In the limit of large n, this contour integral\ntranslates into an integral over a real variable ξ upon setting (see [19] for details)\n1\ng=\n12\n\n\u0012\n\u0013\nξ2\n1+\n.\nn\n\n(4.3)\n\nA sensible scaling limit is now obtained by rescaling l as\nl = r n1/4\n\n(4.4)\n\n√\nso that we can use in practice our continuous expressions above with ǫ = −iξ/ n and\n√\n(1)\nL = −iξ r. Normalizing by Q• |g n , we get the probability\nZ\n\u0011\n\u0010 p\np\n1\n96 ∞\n2\ndξ\nexp(−ξ ) I( −iξr) − I( iξr)\nσ(r) =\nπ 0\n−iξ\n√\n√\nZ\n3 √\n3 √\n8 ∞ dξ\n2 sin( 3ξr) sinh ( 3ξr) − sinh( 3ξr) sin ( 3ξr)\n√\n√\n=\nexp(−ξ )\nπ 0 ξ\n(cosh( 3ξr) − cos( 3ξr))4\n\n(4.5)\n\nthat the shortest non-contractible loop passing via the origin has a length smaller than\n2rn1/4 in the ensemble of pointed bipartite quadrangulations of genus 1 with fixed size\nn, in the limit n → ∞. The cumulative probability distribution σ(r) and the associated\nprobability density σ ′ (r) are plotted in fig. 3. For small r, we have the expansion\n1431r 10\n9r 6\n√ + O(r 14 ) .\nσ(r) = √ −\n4 π\n280 π\n\n(4.6)\n\nIt is worth mentioning that, in the continuous limit, the shortest non-contractible loop\nis expected to be unique, i.e. two shortest loops at the discrete level remain at a distance\nnegligible with respect to n1/4 at large n. Moreover, as for geodesic paths in spherical\nmaps, we expect a confluence phenomenon with the shortest loop made of an open part\nof (rescaled) length 2r − 2δ and a common part of length δ traveled back and forth in\nthe vicinity of the origin. The joint law for δ and r could be obtained in principle by a\nslight refinement of the above analysis.\nIn the same spirit, for a pointed map of genus 1, we may first consider a shortest\nnon-contractible loop as above and now study the length of any shortest loop among\nthose non-contractible loops not homotopic to the shortest loop or to any of its powers.\nA similar quantity was introduced in [27] an analyzed using heuristic scaling arguments.\nAt the discrete level, this notion depends on the particular choice of the first shortest\nloop but we expect that this dependence is wiped out in the continuous limit in which\nthe first shortest loop is essentially unique. We may as before assume that the welllabeled 1-tree coding for the quadrangulation has a generic backbone, i.e. has a skeleton\n14\n\n\fFig. 4: Given a first non-contractible loop (thick red) intersecting only\none of the three chains forming the skeleton, any other non-contractible\nloop non-homotopic to this first loop or to its powers (thick blue) must\nintersect (at least) one of the two other chains in the skeleton (possibly at\nan endpoint of the chain).\nwith two 3-valent vertices linked by three chains. We may moreover assume that the\nminimum label on this skeleton is reached for a bivalent vertex, i.e. strictly inside one of\nthe three chains. Indeed, all the other situations (degenerate backbone or minimal label\nat one of the two 3-valent vertices of the skeleton) correspond to degenerate cases which\ngive sub-dominant contributions in the continuous limit. We now take for the first loop\nthe concatenation of the two sequences of links between the successive successors of the\ntwo corners at the above bivalent vertex with minimal label. A non-contractible loop\nnot homotopic to this loop or to its powers must necessarily intersect the skeleton at\none of the two other chains so that its length is larger than twice the label of any vertex\nof the skeleton minus the first chain (see fig. 4 for an illustration). Taking a vertex with\nminimal label lmin in this set, the two sequences of successors of two corners at this\nvertex, once concatenated, create a suitable loop of length 2lmin .\nTo summarize, denoting as before by L1 and L2 the (rescaled) labels of the 3-valent\nvertices of the skeleton, with L1 ≥ L2 , and by M1 , M2 and M3 the respective minimal\nlabels on the three chains linking them, with M1 ≥ M2 ≥ M3 , the length we are now\ninterested in is nothing but the second minimum M2 so that, integrating over the other\nvariables, we are now led to compute\n2\nǫ2\n\nZ\n\n0\n\nM2\n\ndM3\n\nZ\n\n∞\n\ndM1\n\nM2\n\nZ\n\n∞\n\nM1\n\ndL2\n\nZ\n\n∞\n\nL2\n\n ̃ 1 , M1 )C(L\n ̃ 2 , M1 ) × 3 C(L\n ̃ 1 , M2 )C(L\n ̃ 2 , M2 )\ndL1 3 C(L\n\nZ L\nZ ∞\n2\n3\n3\n3\n= 2 ′\ndM\ndM\n3\n1\nǫ F (L)2 0\nF ′ (M3 )2 L\nF ′ (M1 )2\n1\nJ (L)\nwith J (L) = − H(L) F ′ (2L)\n=\n2\nǫ\n2\nwith H as in (2.18).\n15\n\n ̃ 1 , M3 )C̃(L2 , M3 )\n× 3 C(L\nM2 =L\nZ ∞\nZ ∞\ndL1 F ′ (L1 )3\ndL2 F ′ (L2 )3\nM1\n\nL2\n\n(4.7)\n\n\fσ2(r )\n\nσ2'(r )\n\n1\n\n1\n\n0.8\n\n0.8\n\n0.6\n\n0.6\n\n0.4\n\n~r\n\n0.2\n\n0.5\n\n1\n\n1.5\n\n0.4\n\n10\n\n2\n\n0.2\n\n2.5\n\n3\n\n3.5\n\n0.5\n\nr\n\n1\n\n1.5\n\n2\n\n2.5\n\n3\n\nr\n\nFig. 5: Plots of the cumulative probability distribution σ2 (r) and the\nassociated probability density σ2′ (r) for the rescaled half-length r of the\n\"second shortest\" non-contractible loop passing via the origin of a large\npointed toroidal quadrangulation.\nRepeating the above arguments, we get the probability\n96\nσ2 (r) =\nπ\n\nZ\n\n∞\n\ndξ\n0\n\n\u0011\n\u0010 p\np\n1\nexp(−ξ 2 ) J ( −iξr) − J ( iξr)\n−iξ\n\n(4.8)\n\nthat, in the set of all non-contractible loops passing via the origin, the \"second shortest\"\nloop, i.e. the shortest among loops not homotopic to any power of the true shortest one,\nhas a length smaller than 2rn1/4 in the ensemble of pointed bipartite quadrangulations of\ngenus 1 with fixed size n, in the limit n → ∞. The cumulative probability distribution\nσ2 (r) and the associated probability density σ2′ (r) are plotted in fig. 5. For small r, we\nhave the expansion\n11043 r 10\n√ + O(r 14 ) .\nσ2 (r) =\n(4.9)\n5096 π\nIt is interesting to comment on the small r behavior of both σ(r) and σ2 (r) which\ninforms us on the regime of large but finite values of l, namely: 1 ≪ l ≪ n1/4 . For such\na finite value of l, the average number of vertices in a random quadrangulation giving\nrise to a shortest non-contractible loop of length smaller than 2l scales as\n6\n\nnσ(r) ∼ n × r = n\n\n\u0012\n\nl\nn1/4\n\n\u00136\n\nl6\n=√\nn\n\n(4.10)\n\nwhere we dropped the multiplicative prefactor. In particular, this quantity tends to 0\nas n−1/2 for large n. This is to be contrasted with, for instance, the average number\n(∝ n(l/n1/4 )4 = l4 ) of vertices at a finite distance less than l from the origin of a\npointed planar quadrangulation [19] which remains finite at large n. The explanation\nfor this phenomenon is that a prerequisite for the shortest non-contractible loop passing\n16\n\n\f−1/2\n\nn\n\n−3/2\n\nn\n(a)\n\nn−1/2\n\n(b)\n\nFig. 6: A schematic picture of a toroidal quadrangulation with (a) a small\nnon-contractible loop or (b) two non-homotopic small non-contractible\nloops. The first case occurs with a probability decaying as n−1/2 and\nthe second with a probability decaying as n−3/2 .\nvia the origin to be finite is that the smallest non-contractible loop in the map be\nitself finite, while (4.10) essentially counts the vertices lying at a finite distance from\nthis non-contractible smallest loop. The n dependence in (4.10) is compatible with a\nprobability of having a finite smallest non-contractible loop decaying as n−1/2 in the\nset of bipartite quadrangulations of genus 1 and fixed large size n (see fig. 6-(a) for an\nillustration). Similarly, from the small r behavior of σ2 (r), the number of vertices giving\nrise to a second-shortest loop of finite length smaller than 2l behaves as\n\u001310\n\u0012\nl10\nl\n10\n.\n(4.11)\n=\nnσ2 (r) ∼ n × r = n\nn1/4\nn3/2\nWe now interpret the n dependence in (4.11) as measuring, in the set of bipartite\nquadrangulations with genus 1 and fixed size n, the probability that a quadrangulation\nhas its two non-homotopic smallest non-contractible loops finite: this probability tends\nto 0 as n−3/2 (see fig. 6-(b) for an illustration).\nThese scaling behaviors are not surprising since, in case (a) of fig. 6, the quadrangulation may essentially be viewed as a planar quadrangulation with two marked points\nwhich are glued together to create a handle, while in case (b), the quadrangulation is\nessentially a planar quadrangulation with one marked point. Recall that the number of\nplanar quadrangulations of size n with a marked vertex is [1]\n\u0001\n2n\n12n\n3n n\n∼ √ 5/2\n(4.12)\n2n n + 1\nπn\nwhile that with two marked vertices is (asymptotically) n times bigger. Dividing by the\nn\nnumber of total number Q(1)\n→ |g n /(4n) ∼ 12 /(96n) of quadrangulations of genus 1 gives\na ratio scaling precisely as n−1/2 for two marked points and n−3/2 for one.\n17\n\n\fTo summarize, we deduce a contrario that a generic bipartite quadrangulation of\ngenus 1 has both its smallest cycles of order n1/4 so that its topology remains that of a\ngenus 1 surface in the scaling limit.\n5. Two-point function for large toroidal maps\n\nl\nl3\nl1\n\nl2\n\nFig. 7: The \"diagram\" enumerating generic configurations contributing to\nthe dominant singularity of Zl . Each edge of the diagram must be replaced\nby a propagator K with the indices of its endpoints. We must then sum\nover l1 , l2 and l3 , keeping l fixed.\nThe most natural measure of the distance statistics is via the two-point function\nwhich measures the density of points at a fixed distance from a given origin in the map.\nMore precisely, we may decide to enumerate pointed bipartite quadrangulations of genus\n1 with now a marked vertex at distance l (l ≥ 1) from the origin. From the MarcusSchaeffer bijection, this amounts to enumerating well-labeled 1-trees with a marked\nvertex with label l. As before, it is simpler to consider the generating function Zl for\nalmost well-labeled 1-trees with a marked vertex with label l. From the Marcus-Schaeffer\nbijection, Zl is now the generating function for pointed bipartite quadrangulations of\ngenus 1 with a marked vertex at distance less than or equal to l.\nThe dominant singularity of Zl comes from quadrangulations leading to well-labeled\n1-trees with a generic backbone and, moreover, with a marked vertex with label l lying\noutside their skeleton. The shortest path in the 1-tree from the marked vertex to\nthe skeleton defines a chain whose endpoint on the skeleton has label, say l3 , and is\ngenerically different from the two vertices of degree 3 in the skeleton, with labels l1 and\nl2 . The dominant singularity of Zl is therefore that of the \"diagram\" of fig. 7, whose\nvalue is obtained by replacing each edge by the corresponding propagator K and by\nsumming over l1 , l2 and l3 , keeping l fixed, namely\nX X X\n2\nKl,l3 Kl1 ,l3 Kl2 ,l3 (Kl1 ,l2 ) .\n(5.1)\nl1 ≥1 l2 ≥1 l3 ≥1\n\n18\n\n\f√\nSetting l = L/ ǫ and turning to rescaled variables in the sums, we get a dominant\nsingularity\n1\nZl ∼ 4\nǫ\n\nZ\n\n∞\n\ndL1\n\n0\n\nF (1) (L)\n=\nǫ4\n\nZ\n\n∞\n\ndL2\n0\n\nZ\n\n∞\n\ndL3 ρ(L, L3 )ρ(L1 , L3 )ρ(L2 , L3 ) (ρ(L1 , L2 ))\n\n0\n\n2\n\n(5.2)\n\nwith a new scaling function F (1) (L) which fully characterizes the two-point distance\nstatistics in large toroidal maps. The above integrals can be performed explicitly and\ninvolve 12 sectors for the determination of the minimum in the formula (2.18) for ρ (2\nrelative positions for L and L3 × 6 relative positions for L1 , L2 and L3 ), reducible by\nsymmetry L1 ↔ L2 to 6 sectors. After some cumbersome but straightforward calculations, we find the relatively simple expression\nF (1) (L) = A0 (L) + L A1 (L) + L2 A2 (L)\n√\n√\n1 238 + 151 cosh( 6L) + cosh(2 6L)\nwith A0 (L) =\n\u0010q \u0011\n768\n3\nL\nsinh4\n2\n\n√\n√\n100 sinh( 6L) + 31 sinh(2 6L)\n5\n√\nA1 (L) = −\n\u0010q \u0011\n3\n2048 6\nsinh6\n2L\n√\n75 3 + 2 cosh( 6L)\nA2 (L) = −\n\u0010q \u0011 .\n1024 sinh6\n3\nL\n\n(5.3)\n\n2\n\nThis explicit formula constitutes the main result of this paper, with F (1) playing for the\ntoroidal topology the same role as F for the spherical case. It is worth noting that, from\ntheir explicit expressions, the three functions A0 , A1 and A2 , satisfy the remarkable\nrelation\nA′′0 − 4A′1 + 20A2 = 0\n\n(5.4)\n\nso that we may write in all generality the parametrization\nA0 = 4α0 ,\n\nA1 = α′0 + 5α1 ,\n\nA2 = α′1 .\n\n(5.5)\n\nIn other words, the scaling function F (1) may be written as\nF (1) (L) = 4M(L) + LM′ (L)\nwith M(L) = α0 (L) + Lα1 (L)\n19\n\n(5.6)\n\n\fin terms of a simpler function M. We have no explanation for this particular form nor\nfor the meaning of M(L) itself. From (5.3), we have explicitly\n√\n√\n1 238 + 151 cosh( 6L) + cosh(2 6L)\nα0 (L) =\n\u0010q \u0011\n4\n3072\n3\nL\nsinh\n2\n\u0010q \u0011\n(5.7)\nr\n3\ncosh\nL\n2\n25 3\nα1 (L) =\n\u0010q \u0011 .\n512 2 sinh5\n3\nL\n2\n\nAt small L, although A0 , A1 and A2 diverge respectively as 1/L4 , 1/L5 and 1/L6 , a\nnumber of cancellations ensure that F (1) (L) vanishes as\nF (1) (L) ∼\n\nL4\n.\n896\n\n(5.8)\n\nWe deduce from this formula that for a large, but finite l, i.e. in the so-called local limit,\nwe have\nl4\n12n 4\nL4\nn\n=\nand\ntherefore\nZ\n|\n∼\nl\n(5.9)\nZl ∼\nl g\n896ǫ4\n896ǫ2\n896\n(1)\n\nat large n. Normalizing by the number Q• |g n ∼ 12n /96 of pointed quadrangulations,\n(1)\nwe find that the average number hVl i• of vertices at a distance less than or equal to\nl of the origin in pointed bipartite quadrangulations of genus 1 behaves, for large but\nfinite l, as\n3 4\n(1)\nhVl i• ∼\nl .\n(5.10)\n28\nThis is exactly the result found for planar quadrangulations, i.e. in the spherical case\nh = 0. As might be expected, the local limit is totally insensitive to the genus. The\npresence of handles may generically be felt only by traveling along distances of order\nn1/4 in the map.\nAlternatively, we may consider the scaling limit of pointed bipartite quadrangulations of genus 1 with fixed, large size n, but now with l ∝ n1/4 . The probability Φ(1) (r)\nthat a vertex picked uniformly at random in the quadrangulation be at a distance less\nthan l = rn1/4 from the origin is given by\nZ\np\n1\n96 ∞\n(1)\ndξ 3 exp(−ξ 2 )F (1) ( −iξ r)\nΦ (r) =\nπ −∞\niξ\n√\n\u0013\n\u0012\nZ ∞\n4\np\n1\n96\n3r\n( −iξ r)4\n2\n(1)\n(5.11)\ndξ 3 exp(−ξ ) F ( −iξ r) −\n+\n=\n28\nπ −∞\niξ\n896\nZ\n\u0011\n\u0010\np\np\n3 r4\n1\n96 ∞\n=\ndξ 3 exp(−ξ 2 ) F (1) ( −iξ r) − F (1) ( iξ r)\n+\n28\nπ 0\niξ\nwhere we singled out the contribution from the first term in the small r expansion of\nF (1) (r), corresponding precisely to the local limit, as it is proportional to the improper\n20\n\n\fΦ (r )\n\nΦ '(r )\n(1)\n\n(1)\n\n1\n\n0.7\n0.6\n\n0.8\n\n0.5\n0.6\n0.4\n0.4\n\n~r\n\n0.2\n\n1\n\n2\n\n3\n\n0.3\n\n4\n\n0.2\n0.1\n4\n\n5\n\n6\n\n1\n\nr\n\n2\n\n4\n\n3\n\n5\n\n6\n\nr\n\nFig. 8: Plots of the cumulative probability distribution Φ(1) (r) and the\nassociated probability density Φ(1)′ (r) for the rescaled distance r from a\nuniformly chosen random vertex to the origin of a large pointed toroidal\nquadrangulation.\n\n(0)\n−\nΦ '(r ) Φ '(r )\n(1)\n\n0.7\n\nΦ '(r )\n(0)\nΦ '(r )\n(1)\n\n0.6\n0.5\n0.4\n0.3\n\n0.08\n0.06\n0.04\n0.02\n1\n\n0.2\n\n-0.02\n\n0.1\n\n-0.04\n\n1\n\n2\n\n3\n\n4\n\n5\n\n2\n\n3\n\n4\n\n5\n\n6\n\nr\n\n6\n\nr\n\nFig. 9: Comparison of the probability densities Φ(1)′ (r) and Φ(0)′ (r) for\nthe rescaled distance r from a uniformly chosen random vertex to the\norigin in large pointed toroidal and planar quadrangulations respectively.\nWe plotted on the right the difference Φ(1)′ − Φ(0)′ .\nR∞\nintegral −∞ (dξ/ξ) exp(−ξ 2 ). Its value −iπ of this integral is dictated by the change\nof variable from g to ξ. The integrals in the second and third lines of (5.11) are now\nconvergent integrals. Expanding further at small r gives\nΦ(1) (r) =\n\n\u0001\n3r 4\n15r 10\n1242135r 14\n√ +\n√ + O r 18\n−\n28\n1456 π 506970464 π\n\n(5.12)\n\nwith, as discussed above, the same leading term ∝ r 4 as for planar quadrangulations, but\nnow a first negative correction of order r 10 instead of r 8 for the planar two-point function.\n21\n\n\fThe two-point function therefore increases faster at small r for toroidal maps than\nfor spherical ones. The probability distribution Φ(1) (r) and the associated probability\ndensity Φ(1)′ (r) are plotted in fig. 8. A comparison with the corresponding genus 0\nprobability density Φ(0)′ (r), as computed in ref. [19], is displayed in fig. 9.\n\n6. Conclusion\nIn this paper, we have derived explicit expressions for a number of probability\ndistributions characterizing the distance statistics of large toroidal maps. These distributions, obtained here in the context of bipartite quadrangulations, are expected to be\nuniversal (up to a non-universal global rescaling of r) and describe the distance statistics in more general ensembles of large toroidal maps in the universality class of pure\ngravity, such has maps with prescribed face degrees, possibly equipped with non-critical\nstatistical models.\nOur main result is the explicit form (5.3) for the two-point scaling function F (1) ,\nwhich is the genus 1 counterpart of spherical two-point scaling function F of eq. (2.5).\nIn the same way as F satisfies the non-linear differential equation (2.6), we may wonder\nif F (1) itself obeys some simple differential equation, possibly involving F as a source.\nOur method, which consisted in a direct computation of F (1) , did not allow us to find\nsuch an equation.\nAmong possible extensions of our work, let us mention the computation of the\ntoroidal three-point function or more simply, that of a more involved two-point function\nnow measuring the \"second-shortest length between two points\", i.e. the length of any\nshortest path among those paths not homotopic to the true geodesic. There seems to\nbe no fundamental obstacle to the derivation of these laws but the calculations may\nrapidly become heavy.\nAnother natural extension if of course that of maps with genus h > 1. Here a\nmore fundamental obstacle occurs since, when h becomes large, we have to deal with a\nlarge number of diagrams, each involving a large number of propagators, which makes\nin practice our method unadapted. Alternatively, one may hope for the existence of a\nhierarchy of equations satisfied by the higher genus two-point functions, whose discovery\nwould be a promising step in the quest for these universal scaling functions.\n\n22\n\n\fReferences\n[1] W. Tutte, A Census of planar triangulations Canad. J. of Math. 14 (1962) 21-38; A\nCensus of Hamiltonian polygons Canad. J. of Math. 14 (1962) 402-417; A Census of\nslicings, Canad. J. of Math. 14 (1962) 708-722; A Census of Planar Maps, Canad.\nJ. of Math. 15 (1963) 249-271.\n[2] E. Brézin, C. Itzykson, G. Parisi and J.-B. Zuber, Planar Diagrams, Comm. Math.\nPhys. 59 (1978) 35-51.\n[3] P. Di Francesco, 2D Quantum Gravity, Matrix Models and Graph Combinatorics,\nLecture notes given at the summer school \"Applications of random matrices to\nphysics\", Les Houches, June 2004, arXiv:math-ph/0406013.\n[4] R. Cori and B. Vauquelin, Planar maps are well labeled trees, Canad. J. Math.\n33(5) (1981) 1023-1042.\n[5] G. Schaeffer, Conjugaison d'arbres et cartes combinatoires aléatoires, PhD Thesis,\nUniversité Bordeaux I (1998).\n[6] J. Bouttier, P. Di Francesco and E. Guitter. Planar maps as labeled mobiles, Elec.\nJour. of Combinatorics 11 (2004) R69, arXiv:math.CO/0405099.\n[7] V. Kazakov, Bilocal regularization of models of random surfaces, Phys. Lett. B150\n(1985) 282-284; F. David, Planar diagrams, two-dimensional lattice gravity and\nsurface models, Nucl. Phys. B257 (1985) 45-58; J. Ambjørn, B. Durhuus and J.\nFröhlich, Diseases of triangulated random surface models and possible cures, Nucl.\nPhys. B257 (1985) 433-449; V. Kazakov, I. Kostov and A. Migdal Critical properties\nof randomly triangulated planar random surfaces, Phys. Lett. B157 (1985) 295-300.\n[8] for a review, see: P. Di Francesco, P. Ginsparg and J. Zinn–Justin, 2D Gravity and\nRandom Matrices, Physics Reports 254 (1995) 1-131.\n[9] see for instance B. Duplantier, Higher Conformal Multifractality, J. Stat. Phys. 110\n691-738 (2003), arXiv:cond-mat/0207743.\n[10] see also M. Bauer and D. Bernard, Conformal Field Theories of Stochastic Loewner\nEvolutions, Commun. Math. Phys. 239 (2003) 493-521, arXiv:hep-th/0210015.\n[11] J. F. Marckert and A. Mokkadem, Limit of normalized quadrangulations: the Brownian map, Annals of Probability 34(6) (2006) 2144-2202, arXiv:math.PR/0403398.\n[12] J. F. Le Gall, The topological structure of scaling limits of large planar maps, invent.\nmath. 169 (2007) 621-670, arXiv:math.PR/0607567.\n[13] J. F. Le Gall and F. Paulin, Scaling limits of bipartite planar maps are homeomorphic to the 2-sphere, Geomet. Funct. Anal. 18, 893-918 (2008), arXiv:math.PR/0612315.\n[14] G. Miermont, On the sphericity of scaling limits of random planar quadrangulations,\nElect. Comm. Probab. 13 (2008) 248-257, arXiv:0712.3687 [math.PR].\n23\n\n\f[15] J.-F. Le Gall, Geodesics in large planar maps and in the Brownian map, Acta\nMath., to appear, arXiv:0804.3012 [math.PR].\n[16] J. Ambjørn and Y. Watabiki, Scaling in quantum gravity, Nucl.Phys. B445 (1995)\n129-144, arXiv:hep-th/9501049.\n[17] J. Ambjørn, J. Jurkiewicz and Y. Watabiki, On the fractal structure of twodimensional quantum gravity, Nucl.Phys. B454 (1995) 313-342, arXiv:hep-lat/9507014.\n[18] see also J. Ambjørn, B. Durhuus and T. Jonsson, Quantum Geometry: A statistical\nfield theory approach, Cambridge University Press, 1997.\n[19] J. Bouttier, P. Di Francesco and E. Guitter, Geodesic distance in planar graphs,\nNucl. Phys. B663[FS] (2003) 535-567, arXiv:cond-mat/0303272.\n[20] J. Bouttier and E. Guitter, The three-point function of planar quadrangulations, J.\nStat. Mech. (2008) P07020, arXiv:0805.2355 [math-ph].\n[21] J. Bouttier and E. Guitter, Confluence of geodesic paths and separating loops\nin large planar quadrangulations, J. Stat. Mech. (2009) P03001, arXiv:0811.0509\n[math-ph].\n[22] J. Bouttier and E. Guitter Distance statistics in quadrangulations with a boundary, or with a self-avoiding loop, J. Phys. A: Math. Theor. 42 (2009) 465208,\narXiv:0906.4892 [math-ph].\n[23] M. Marcus and G. Schaeffer, Une bijection simple pour les cartes orientables (2001),\navailable at http://www.lix.polytechnique.fr/Labo/Gilles.Schaeffer/Biblio/.\n[24] see also G. Chapuy, M. Marcus and G. Schaeffer, A bijection for rooted maps on orientable surfaces, SIAM J. Discrete Math. 23(3) (2009) 1587-1611, arXiv:0712.3649\n[math.CO].\n[25] J. Bettinelli, Scaling Limits for Random Quadrangulations of Positive Genus,\npreprint arXiv:1002.3682 [math.PR].\n[26] see for instance M. Mutz and D. Bensimon, Observation of toroidal vesicles, Phys.\nRev. A 43, (1990) 4525-4527; X. Michalet and D. Bensimon, Vesicles of Toroidal\nTopology: Observed Morphology and Shape Transformations, J. Physique II 5 (1995)\n263-287.\n[27] T. Jonsson, Width of handles in two-dimensional quantum gravity, Phys. Lett. B\n425 (1998) 265-268, arXiv:hep-th/9801150.\n\n24\n\n\f"}