{"id": "http://arxiv.org/abs/0804.4399v3", "guidislink": true, "updated": "2008-09-15T08:05:37Z", "updated_parsed": [2008, 9, 15, 8, 5, 37, 0, 259, 0], "published": "2008-04-28T13:14:05Z", "published_parsed": [2008, 4, 28, 13, 14, 5, 0, 119, 0], "title": "Mixed Hodge Structures and Renormalization in Physics", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0804.0600%2C0804.4748%2C0804.0603%2C0804.2917%2C0804.4755%2C0804.3546%2C0804.1427%2C0804.1609%2C0804.1753%2C0804.3566%2C0804.4332%2C0804.3047%2C0804.3098%2C0804.2836%2C0804.3489%2C0804.3330%2C0804.2132%2C0804.1121%2C0804.1204%2C0804.1853%2C0804.4074%2C0804.3216%2C0804.3346%2C0804.1597%2C0804.3360%2C0804.0305%2C0804.1087%2C0804.1336%2C0804.3232%2C0804.1780%2C0804.0218%2C0804.1737%2C0804.4778%2C0804.3652%2C0804.1345%2C0804.4243%2C0804.3166%2C0804.0120%2C0804.3792%2C0804.4561%2C0804.1067%2C0804.0628%2C0804.0196%2C0804.3004%2C0804.2889%2C0804.4314%2C0804.0545%2C0804.4587%2C0804.3527%2C0804.2827%2C0804.4383%2C0804.4399%2C0804.2460%2C0804.3332%2C0804.3184%2C0804.3585%2C0804.3815%2C0804.4637%2C0804.2500%2C0804.0912%2C0804.2290%2C0804.1275%2C0804.4802%2C0804.4773%2C0804.1929%2C0804.1498%2C0804.3280%2C0804.1071%2C0804.3443%2C0804.0409%2C0804.0090%2C0804.4389%2C0804.1421%2C0804.3258%2C0804.3055%2C0804.3977%2C0804.1049%2C0804.4741%2C0804.4169%2C0804.0050%2C0804.2069%2C0804.0102%2C0804.0936%2C0804.3717%2C0804.3914%2C0804.1854%2C0804.3688%2C0804.2859%2C0804.2213%2C0804.2682%2C0804.0989%2C0804.0098%2C0804.4531%2C0804.1667%2C0804.2635%2C0804.0950%2C0804.4269%2C0804.4305%2C0804.2539%2C0804.2483%2C0804.3062&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Mixed Hodge Structures and Renormalization in Physics"}, "summary": "We relate renormalization in perturbative quantum field theory to the theory\nof limiting mixed Hodge structures using parametric representations of Feynman\ngraphs.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0804.0600%2C0804.4748%2C0804.0603%2C0804.2917%2C0804.4755%2C0804.3546%2C0804.1427%2C0804.1609%2C0804.1753%2C0804.3566%2C0804.4332%2C0804.3047%2C0804.3098%2C0804.2836%2C0804.3489%2C0804.3330%2C0804.2132%2C0804.1121%2C0804.1204%2C0804.1853%2C0804.4074%2C0804.3216%2C0804.3346%2C0804.1597%2C0804.3360%2C0804.0305%2C0804.1087%2C0804.1336%2C0804.3232%2C0804.1780%2C0804.0218%2C0804.1737%2C0804.4778%2C0804.3652%2C0804.1345%2C0804.4243%2C0804.3166%2C0804.0120%2C0804.3792%2C0804.4561%2C0804.1067%2C0804.0628%2C0804.0196%2C0804.3004%2C0804.2889%2C0804.4314%2C0804.0545%2C0804.4587%2C0804.3527%2C0804.2827%2C0804.4383%2C0804.4399%2C0804.2460%2C0804.3332%2C0804.3184%2C0804.3585%2C0804.3815%2C0804.4637%2C0804.2500%2C0804.0912%2C0804.2290%2C0804.1275%2C0804.4802%2C0804.4773%2C0804.1929%2C0804.1498%2C0804.3280%2C0804.1071%2C0804.3443%2C0804.0409%2C0804.0090%2C0804.4389%2C0804.1421%2C0804.3258%2C0804.3055%2C0804.3977%2C0804.1049%2C0804.4741%2C0804.4169%2C0804.0050%2C0804.2069%2C0804.0102%2C0804.0936%2C0804.3717%2C0804.3914%2C0804.1854%2C0804.3688%2C0804.2859%2C0804.2213%2C0804.2682%2C0804.0989%2C0804.0098%2C0804.4531%2C0804.1667%2C0804.2635%2C0804.0950%2C0804.4269%2C0804.4305%2C0804.2539%2C0804.2483%2C0804.3062&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We relate renormalization in perturbative quantum field theory to the theory\nof limiting mixed Hodge structures using parametric representations of Feynman\ngraphs."}, "authors": ["Spencer Bloch", "Dirk Kreimer"], "author_detail": {"name": "Dirk Kreimer"}, "author": "Dirk Kreimer", "arxiv_comment": "48 pages, more expository details added, typos corrected", "links": [{"href": "http://arxiv.org/abs/0804.4399v3", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0804.4399v3", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "hep-th", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "hep-th", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "math.AG", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0804.4399v3", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0804.4399v3", "journal_reference": "Commun.Num.Theor.Phys.2.4:637-718,2008", "doi": null, "fulltext": "MIXED HODGE STRUCTURES AND RENORMALIZATION IN PHYSICS\nSPENCER BLOCH AND DIRK KREIMER\n\narXiv:0804.4399v3 [hep-th] 15 Sep 2008\n\n1. Introduction\n1.1. This paper is a collaboration between a mathematician and a physicist. It is based on the observation\nthat renormalization of Feynman amplitudes in physics is closely related to the theory of limiting mixed\nHodge structures in mathematics. Whereas classical physical renormalization methods involve manipulations\nwith the integrand of a divergent integral, limiting Hodge theory involves moving the chain of integration so\nthe integral becomes convergent and studying the monodromy as the chain varies.\nEven methods like minimal subtraction in the contextRof dimensional or analytic regularization implicitly\nmodify the integrand through the definition of a measure dD k via analytic continuation. Still, as a regulator\ndimensional regularization is close to our approach in so far as it leaves the rational integrand assigned to a\ngraph unchanged. Minimal subtraction as a renormalization scheme differs though from the renormalization\nschemes which we consider -momentum subtractions essentially- by a finite renormalization. Many of the\nnice algebro-geometric structures developed below are not transparent in that scheme.\nThe advantages of the limiting Hodge method are firstly that it is linked to a very central and powerful\nprogram in mathematics: the study of Hodge structures and their variations. As a consequence, one gains\na number of tools, like weight, Hodge, and monodromy filtrations to study and classify the Feynman amplitudes. Secondly, the method depends on the integration chain, and hence on the graph, but it is in some\nsense independent of the integrand. For this reason it should adapt naturally e.g. to gauge theories where\nthe numerator of the integrand is complicated.\nAn important point is to analyse the nature of the poles. Limiting mixed Hodge structures demand that\nthe divergent subintegrals have at worst log poles. This does not imply that we can not apply our approach to\nperturbative amplitudes which have worse than logarithmic degree of divergence. It only means that we have\nto correctly isolate the polynomials in masses and external momenta which accompany those divergences such\nthat the corresponding integrands have singularities provided by log-poles. This is essentially automatic from\nthe notion of a residue available by our very methods. As a very pleasant byproduct, we learn that physical\nrenormalization schemes -on-shell subtractions, momentum subtractions, Weinberg's scheme,- belong to a\nclass of schemes for which this is indeed automatic.\nMoreover, for technical reasons, it is convenient to work with projective rather than affine integrals. One\nof the central physics results in this paper is that the renormalization problem can be reduced to the study\nof logarithmically divergent, projective integrals. This is again familiar from analytic regulators. The fact\nthat it can be achieved here by leaving the integrand completely intact will hopefully some fine day allow to\nunderstand the nature of the periods assigned to renormalized values in quantum field theory.\nA remark for Mathematicians: our focus in this paper has been renormalization, which is a problem\narising in physics. We suspect, however, that similar methods will apply more generally for example to\nperiod integrals whenever the domain of integration is contained in R+n and the integrand is a rational\nfunction with polar locus defined by a polynomial with non-negative real coefficients. The toric methods\nand the monodromy computations should go through in that generality.\nAcknowledgments. Both authors thank Francis Brown, Hélène Esnault and Karen Yeats for helpful discussions. This work was partially supported by NSF grants DMS-0603781 and DMS-0653004. S.B. thanks\nthe IHES for hospitality January-March 2006 and January-March 2008. D.K. thanks Chicago University for\nhospitality in February 2007.\n1.2. Physics Introduction. This paper studies the renormalization problem in the context of parametric\nrepresentations, with an emphasis on algebro-geometric properties. We will not study the nature of the\n1\n\n\fperiods one obtains from renormalizable quantum field theories in an even dimension of space-time. Instead,\nwe provide the combinatorics of renormalization such that a future motivic analysis of renormalized amplitudes is feasible along the lines of [2]. Our result will in particular put renormalization in the framework\nof a limiting mixed Hodge structure, which hopefully provides a good starting point for an analysis of the\nperiods in renormalized amplitudes. That these amplitudes are provided by numbers which are periods (in\nthe sense of [11]) is an immediate consequence of the properties of parametric representations, and will also\nemerge naturally below (see Thm.(7.3)).\nThe main result of this paper is a careful study of the singularities of the first Kirchhoff–Symanzik\npolynomial, which carries all the short-distance singularities of the theory. The study of this polynomial can\nproceed via an analysis with the help of projective integrals. Along the way, we will also give useful formulas\nfor parametric representations involving affine integrals, and clarify the role of the second Kirchhoff–Symanzik\npolynomial for affine and projective integrals.\nOur methods are general, but in concrete examples we restrict ourselves to φ44 theory. Parametric representations are used which result from free-field propagators for propagation in flat space-time. In such\ncircumstances, the advantages of analytic regularizations are also available in our study of parametric representations as we will see. In particular, our use of projective integrals below combines such advantages\nwith the possibility to discuss renormalization on the level of the pairing between integration chains and de\nRham classes.\nIn examples, special emphasis is given to the study of particular renormalization schemes, the momentum\nscheme (MOM-scheme, Weinberg's scheme, on-shell subtractions).\nAlso, we often consider Green functions as functions of a single kinematical scale q 2 > 0. Green functions\nare defined throughout as the scalar coefficient functions (structure functions) for the radiative corrections\nto tree-level amplitudes r. They are to be regarded as scalar quantities of the form 1 + O(~). Renormalized\namplitudes are then, in finite order in perturbation theory, polynomial corrections in L = ln q 2 /μ2 (μ2 >\n0) without constant term, providing the quantum corrections to the tree-level amplitudes appearing as\nmonomials in a renormalizable Lagrangian [15]:\naug(Γ)\n\n(1.1)\n\nφR (Γ) =\n\nX\n\npj (Γ)Lj .\n\nj=1\n\nCorrespondingly, Green functions become triangular series in two variables\n∞\n∞\nX\nX\ncrj (L)αj .\nγjr (α)Lj = 1 +\n(1.2)\nGr (α, L) = 1 +\nj=1\n\nj=1\n\nγjr (α)\n\nThe series\nare related by the renormalization group which leaves only the γ1r (α) undetermined, while\nthe polynomials crj (L) are bounded in degree by j. The series γ1r fulfill ordinary differential equations driven\nby the primitive graphs of the theory [16].\nThe limiting Hodge structure A(Γ) which we consider for each Feynman graph Γ provides contribution of\na graph Γ to the coefficients of γ1r in the limit. This limit is a period matrix (a column vector here) which\nhas, from top to bottom, the periods provided by a renormalized graph Γ as entries. The first entry is the\ncontribution to γ1r of a graph with res(Γ) = r and the k-th is a rational multiple of the contribution to γkr . In\nsection 9.1 we determine the rational weights which connect these periods to the coefficients pj (Γ) attributed\nto the renormalization of a graph Γ.\nWe include a discussion of the structure of renormalization which comes from an analysis of the second\nKirchhoff–Symanzik polynomial. While this polynomial does not provide short-distance singularities in its\nown right, it leads to integrals of the form\nZ\n(1.3)\nω ln(f )\n\nfor a renormalized Feynman amplitude, with ω a de Rham class determined by the first Kirchhoff–Symanzik\npolynomial, and f -congruent to one along any remaining exceptional divisor- determined by the second.\nWe do not actually do the monodromy calculation for integrals (1.3) involving a logarithm, but it will be\nsimilar to the calculation for (1.5) which we do. A full discussion of the Hodge structure of a Green function\nseems feasible but will be postponed to future work.\n2\n\n\fX\nL\n\nFigure 1. Picture of X and L\n1.3. Math Introduction. Let Pn−1 be the projective space of lines in Cn which we view as an algebraic\nvariety with homogeneous coordinates A1 , . . . , An . Let ψ(A1 , . . . , An ) be a homogeneous polynomial of some\ndegree d, and let X ⊂ Pn−1 be the hypersurface defined by ψ = 0. We assume the coefficients of ψ are all\nreal and ≥ 0. Let σ = {[a1 , . . . , an ] | ai ≥ 0, ∀i} be the topological (n − 1)-chain (simplex) in Pn−1 , where\n[. . .] refers to homogeneous coordinates. We will also use the notation σ = Pn−1 (R≥0 ). Our assumption\nabout coefficients implies\n[\n(1.4)\nσ∩X =\nL(R≥0 ),\nL⊂X\n\nwhere L runs through all coordinate coordinate linear spaces L : Ai1 = * * * = Aip = 0 contained in X (see\n(see Fig.1)). The genesis of the renormalization problem in physics is the need to assign values to integrals\nZ\n(1.5)\nω\nσ\n\nn−1\n\nwhere ω is an algebraic (n−1)-form on P\nwith poles along X. The problem is an important one for physical\napplications, and there is an extensive literature (see, for example, [10, 22, 21]) focusing on practical formulae\nto reinterpret (1.5) in some consistent way as a polynomial in log t.R (Here t parametrizes a deformation of\n∞\nthe integration chain. As a first approximation, one can think of t ω when ω has a logarithmic pole at\nt = 0.)\nA similar problem arises in pure mathematics in the study of degenerating varieties, e.g. a family of elliptic\ncurves degenerating to a rational curve with a node. In the classical setup, one is given a family f : X → D,\nwhere D is a disk with parameter t. The map f is proper (so the fibres Xt are compact). X is assumed to\nbe non-singular, as are the fibres Xt , t 6= 0. X0 may be singular, though one commonly invokes resolution of\nsingularities to assume X0 ⊂ X is a normal crossing divisor. Choose a basis σ1,t , . . . , σr,t for the homology\nof the fibre Hp (Xt , Q) in some fixed degree p. By standard results in differential topology, the fibre space is\nlocally topologically trivial over D∗ = D − {0}, and we may choose the classes σi,t to be locally constant.\nIf we fix a smooth fibre t0 6= 0, the monodromy transformation m : Hp (Xt0 ) → Hp (Xt0 ) is obtained by\nwinding around t = 0. An important theorem ([7], III,2) says this transformation is quasi-unipotent, i.e.\nafter possibly introducing a root t′ = t1/n (which has the effect of replacing m by mn ), m − id is nilpotent.\nThe matrix\nh\ni\n(1.6)\nN := log m = − (id − m) + (id − m)2 /2 + . . .\n3\n\n\fis thus also nilpotent. This is the mathematical equivalent of locality in physics. It insures that our\nrenormalization of (1.5) will be a polynomial in log t rather than an infinite series. We take a cohomology class\n[ωt ] ∈ H p (Xt , C) which varies algebraically. For example, in a family of elliptic curves y 2 = x(x − 1)(x − t),\nthe holomorphic 1-form ωt = dx/y is such a class. Note ωt is single-valued over all of D∗ . It is not locally\nconstant. The expression\n\nR\nω\n\u0010\n\u0011 σ1,t t\n\n\n(1.7)\nexp − (N log t)/2πi  ...  .\nR\nω\nσr,t t\n\nis then single-valued and analytic on D∗ . Suppose ωt chosen such that the entries of the column vector in\n(1.7) grow at worst like powers of | log |t|| as |t| → 0. A standard result in complex analysis then implies\nthat (1.7) is analytic at t = 0. We can write this\n\n \nR\nω\nσ1,t t\n\u0010\n\u0011 a1\n.\n .. \n(1.8)\n .  ∼ exp (N log t)/2πi  ..  .\nR\nar\nσr,t ωt\n\nHere the aj are constants which are periods of a limiting Hodge structure. The exponential on the right\nexpands as a matrix whose entries are polynomials in log t, and the equivalence relation ∼ means that the\ndifference between the two sides is a column vector of (multi-valued) analytic\nfunctions vanishing at t = 0.\nQn\nWe would like to apply this program to the integral (1.5). Let ∆ : 1 Aj = 0 be the coordinate divisor\nin Pn−1 . Note that the chain σ has boundary in ∆, so as a first attempt to interpret (1.5) as a period, we\nmight consider the pairing\n(1.9)\n\nH n−1 (Pn−1 − X, ∆ − X ∩ ∆) × Hn−1 (Pn−1 − X, ∆ − X ∩ ∆) → C\n\nThe form ω is an algebraic (n − 1)-form and it vanishes on ∆ for degree reasons, so it does give a class in\nthe relative cohomology group appearing in (1.9) (see the discussion (9.8)-(9.10)). On the other hand, the\nchain σ meetsQX (1.4), so we do not get a class in homology. Instead we consider a family of coordinate\nn\ndivisors ∆t : 1 Aj,t = 0 with ∆0 = ∆. (For details, see section 6.) For t = ε > 0 there is Ra natural chain\nσε which is what the physicists would call a cutoff. We have ∂σε ⊂ ∆ε and σε ∩ X = ∅, so σε ω is defined.\nOne knows on abstract grounds that the monodromy of\nHn−1 (Pn−1 − X, ∆t − X ∩ ∆t )\nis quasi-unipotent as above ([7], III,§2). The main mathematical work in this paper will be to compute the\nmonodromy of σε in the specific case of Feynman amplitudes in physics. More precisely, X will be a graph\nhypersurface XΓ associated to a graph Γ (section 5). We will write down chains τγε , one for each flag of core\n(one particle irreducible in physics) subgraphs γ = {Γ1 ( * * * Γp(γ) ( Γ}, representing linearly independent\nhomology classes in Hn−1 (Pn−1 − X, ∆ε − X ∩ ∆ε ). (The combinatorics here is similar to that found in [1],\n[18].) We will show the monodromy in our case is given by\nX\n(1.10)\nm(σε ) = σε +\n(−1)p(γ) τγε .\nγ\n\nWe will then exhibit a nilpotent matrix N such that\n\n \n\nσε\nm(σε )\n .. \n .. \n.\n . \n\n \n\n(1.11)\nm(τγε ) = exp(N ) τγε  .\n\n \n\n..\n..\n.\n.\n\nWith this in hand, renormalization is automatic for any physical theory for which Γ and its subgraphs are\nat worst logarithmically divergent after taking out suitable polynomials in masses and momenta. Namely,\n4\n\n\fsuch a physical theory gives a differential form ωΓ as in (1.5) and we may repeat the above argument:\nR\n\nω\nσt\n . \n .. \n\n\n(1.12)\nexp(−(N log t)/2πi) R ω \n τγt \n\n\n..\n.\n\nis single-valued on the punctured disk. The hypothesis of log divergence at worst for subgraphs of Γ will\nimply that the integrals will grow at worst like a power of log as |t| → 0,(lemma 9.2). Precisely as in (1.8),\none gets the renormalization\nZ\nr\nX\nωΓ =\nbk (log t)k + O(t),\n(1.13)\nσt\n\nk=0\n\nwhere O(t) denotes a (multi-valued) analytic function vanishing at t = 0. The renormalization schemes\nconsidered here can be characterized by the condition b0 = 0.\nOf course, the requirement that a physical theory have at worst log divergences is a very strong constraint.\nThe difficult computations in section 7 show how general divergences encountered in physics can be reduced\nto log divergences.\nRemarks 1.1. The renormalization scheme outlined above, and worked out in detail in the following sections, has a number of properties, some of which may seem strange to the physicist.\n(i) It does not work in renormalization schemes which demand counter-terms which are not defined by subtractions at fixed values of masses and momenta of the theory. So conditions on the regulator for example, as\nin minimal subtraction where one defines the counterterm by projection onto a pole part, are not considered.\nIn such schemes, and for graphs which are worse than log divergent, a topological procedure of the sort given\nhere can not work. It is necessary instead to modify the integrand ωΓ in a non-canonical way.\n(ii) On the other hand, our approach is very canonical. It depends on the choice of a parameter t, as any\nrenormalization scheme must. Somewhat more subtle is the dependence on the monodromy associated to the\nchoice of a family ∆t of coordinate divisors deforming the given ∆ = ∆0 . We have taken the most evident\nsuch monodromy, moving all the vertices of the simplex. Note that this choice is stable in the sense that a\nsmall deformation leaves the monodromy unchanged.\n(iii) It would seem that our answer is much more complicated than need be, because Γ will in general\ncontain far more core subgraphs than divergent subgraphs. For example, in φ4 -theory, the \"dunce's cap\"\n(see Fig.2) has only one divergent subgraph, given in the picture by edges 1, 2. It has 3 core subgraphs\n(3, 4, 1), (3, 4, 2), (1, 2). RFrom the point of view of renormalization, this problem disappears. The τγε are\ntubes, and the integral τ ε ωΓ is basically a residue which will vanish unless γ ⊂ Γ is a divergent subgraph.\nγ\n\nIn (1.12), the column vector of integrals will consist mostly of 0's and the final regularization (1.13) will\ninvolve only divergent subgraphs.\n(iv) An important property of the theory is the presence of a limiting mixed Hodge structure. The constants\non the right hand side of (1.8) are periods of a mixed Hodge structure called the limiting MHS for the\ndegeneration. One may hope that the tendency for Feynman amplitudes to be multi-zeta numbers [4] will\nsome day be understood in terms of this Hodge structure. From the point of view of this paper, the vector\nspace W ⊂ Hn−1 (Pn−1 − XΓ , ∆t − XΓ ∩ ∆t ) spanned by σt and the τγt is invariant under the monodromy.\nOne may ask whether the image of W in the limiting MHS spans a sub-Hodge structure. If so, we would\nexpect that this HS would be linked to the multi-zeta numbers. Note that W is highly non-trivial even when\nΓ has no subdivergences. This W is an essentially new invariant which comes out of the monodromy. See\nsection (9.2) for a final discussion of our viewpoint.\n(v) There are a number of renormalization schemes in physics, some of which are not compatible with our\napproach. One general test is that our scheme depends only on the graph polynomials of Γ. For example,\nsuppose Γ = Γ1 ∪ Γ2 where the Γi meet at a single vertex. Then the renormalization polynomial in log t our\ntheory yields for Γ will be the product of the renormalizations for the Γi .\n\nMost of the mathematical work involved concerns the calculation of monodromy for a particular topological\nR∞\nchain. It is perhaps worth taking a minute to discuss a toy model. Suppose one wants to calculate 0 ω,\n5\n\n\f3\n\n1\n\n2\n\n4\n\nFigure 2. Dunce's cap. Here and in following figures, external half-edges are often not\ndrawn and are determined by the requirement that all vertices are four-valent.\nR∞\ndz\n. The integral diverges, so instead we consider t ω as a function of t = εeiθ for 0 ≤ θ ≤ 2π.\nwhere ω = (z−i)z\nIf we take the path [t, ∞] to be a great circle, then as t winds around 0, the path will get tangled in the\nsingularity of ω at z = i. Assuming we do not understand the singularities of our integral far from 0, this\ncould be a problem. Instead we chose our path to follow the small circle from εeiθ to ε and then the positive\nreal axis from ε to ∞. The variation of monodromy is the difference in the paths for θ = 0 and θ = 2π.\nIn this case, it is the circle {|t| = ε}. If we assume something (at worst superficial log divergence for the\ngiven graph and all subgraphs in the given physical theory) about the behavior of ω near the pole at 0, then\nthe behavior of our integral for |t| << 1 is determined by this monodromy, which is a topological invariant.\nThis is quite different from the usual approach in physics involving complicated algebraic manipulations\nwith ω. A glance at fig.(10) suggests that our toy model is too simple. We have to work with two scales,\nε << η << 1. This is because in the more complicated situation, we have to deal with cylinders of small\nradius η, but then we have further to slightly deform the boundaries of the cylinder (cf. fig.(12)).\n1.4. Leitfaden. Section 2 is devoted to Hopf algebras of graphs and of trees. These have played a central\nrole in the combinatorics of renormalization. In particular, the insight afforded by passing from graphs\nto trees is important. Since the combinatorics of core subgraphs is even more complicated than that of\ndivergent subgraphs, it seemed worth going carefully through the construction. Section 3 studies the toric\nvariety we obtain from a graph Γ by blowing up certain coordinate linear spaces in the projective space with\nhomogeneous coordinates labeled by the edges of Γ. The orbits of the torus action are related to flags of core\nsubgraphs of the given graph. In section 4, we use the R-structure on our toric variety to construct certain\ntopological chains which will be used to explicit the monodromy. Section 5 recalls the basic properties of\nthe graph polynomial ψΓ ≡ ψ(Γ) and the graph hypersurface XΓ : ψΓ = 0. The crucial point is corollary 5.3\nwhich says that the strict transform of XΓ on our toric blowup avoids points with coordinates ≥ 0. Any chain\nwe construct which stays close to the locus of such points necessarily is away from XΓ and hence also away\nfrom the polar locus of our integrand. Section 6 computes the monodromy of our chain. Section 7 considers\nhow to reduce Feynman amplitude calculations as they arise in physics, including masses and momenta as\nwell as divergences which are worse than logarithmic, to the basic situation where limiting methods can\napply. In section 8 we calculate the nilpotent matrix N which is the log of the monodromy transformation,\nand in section 9 we prove the main renormalization theorem in the log divergent case, to which we have\nreduced the theory.\n6\n\n\f2. Hopf algebras of trees and graphs\n2.1. Graphs. In this section we bring together material on graphs and the graph Hopf algebra which will\nbe used in the sequel. We also discuss Hopf algebras related to rooted trees and prove a result (proposition\n2.5) relating the Hopf algebra of core graphs to a suitable Hopf algebra of labeled trees. Strictly speaking\nthis is not used in the paper, but it provides the best way we know to understand flags of core subgraphs,\nand these play a central role in the monodromy computations. Trees labeled by divergent subgraphs have a\nlong history in renormalization theory [12], [13].\nA graph Γ is determined by giving a finite set HE(Γ) of half-edges, together with two further sets E(Γ)\n(edges) and V (Γ) (vertices) and surjective maps\n(2.1)\n\npV : HE(Γ) → V ;\n\npE : HE(Γ) → E.\n\n(Note we do not allow isolated vertices.) In combinatorics, one typically assumes all fibres p−1\nE (e) consist of\nexactly two half-edges (e an internal edge), while in physics the calculus of path integrals and correlation\nfunctions dictates that one admit external edges e ∈ E with #p−1\nE (e) = 1. If all internal edges of Γ are\nshrunk to 0, the resulting graph (with no internal edges) is called the residue res(Γ). In certain theories, the\nvertices are decomposed into different types V = ∐Vi , and the valence of the vertices in Vi , #p−1\nV (v), is fixed\nindependent of v ∈ Vi .\nWe will typically work with labeled graphs which are triples (Γ, A, φ : A ∼\n= E(Γ)). We refer to A as the\nset of edges.\nA graph is a topological space with Betti numbers |Γ| = h1 (Γ) = dim H1 (Γ, Q) and h0 (Γ). We say Γ is\nconnected if h0 = 1. Sometimes h1 is referred to as the loop number.\nA subgraph γ ⊂ Γ is determined (for us) by a subset E(γ) ⊂ E(Γ). We write Γ//γ for the quotient\ngraph obtained by contracting all edges of γ to points. If γ is not connected, Γ//γ is different from the naive\nquotient Γ/γ. If γ = Γ, we take Γ//Γ = ∅ to be the empty set. It will be convenient when we discuss Hopf\nalgebras below to have the empty set as a graph.\nAlso, for γ = e a single edge, we have the contraction Γ//e = Γ/e. In this case we also consider the cut\ngraph Γ − e obtained by removing e and also any remaining isolated vertex.\nA graph Γ is said to be core (1P I in physics terminology) if for any edge e we have |Γ − e| < |Γ|.\nA cycle γ ⊂ Γ is a core subgraph such that |γ| = 1. If Γ is core, it can be written as a union of cycles (see\ne.g. the proof of lemma 7.4 in [2]).\n2.1.1. Self-energy graphs. Special care has to be taken when the residue res(γ) of a connected component\nγ of some subgraph consists of two half-edges connected to a vertex, |res(γ)| = 2. Such graphs are called\nself-energy graphs in physics. In such a situation, if the internal edges of γ contract to a point, we are left\nwith two edges in Γ//γ, which are connected at this point u . It might happen that the theory provides more\nthan one two-point vertex. In fact, for a massive theory, there are two two-point vertices provided by the\ntheory corresponding to the two monomials in the Lagrangian quadratic in the fields, we call them of mass\nand kinetic type. Γ//γ represents then a sum over two graphs by summing over the two types of vertices for\nthat point u. (see Fig.(3) for an example).\nThe edges and vertices of various types have weights. We set the weight of an edge to be two, the weight\nof a vertex with valence greater than two is zero, the weight of a vertex of mass type is zero, the weight of\nthe kinetic type is +2.\nThen, the superficial degree of divergence sdd(Γ) for a connected core graph Γ is\n(2.2)\n\nsdd(Γ) = 4|Γ| − 2|Γ[1] | + 2|Γ[0],kin|,\n\nwhere Γ[0],kin is the set of vertices of kinetic type, and Γ[1] the set of internal edges. Γ[0] , the set of interaction\nvertices (for which we assume we have only one type) does not show up as they have weight zero, nor does\nΓ[0],mass . By | * * * | we denote the cardinality of these sets.\nNote that a graph Γ//γ which has one two-point vertex labeled m2 (of mass type) which appears after\ncontracting a self-energy subgraph γ has an improved power-counting as its edge number is 2h1 (Γ//γ) + 1. If\nthe two-point vertex is labeled by \u0003 (kinetic type), it has not changed though: sdd(Γ//γ) = sdd(Γ), as the\nweight of the two-point vertex compensates for the weight of the extra propagator. Quite often, in massless\ntheories, one then omits the use of these two-point vertices altogether.\n7\n\n\f6\n3\n\n5\n\n2\n\n4\n\n1\n6\n5\n\n2\n\nu\n\n3\n\nX\n\n4\n1\n\nFigure 3. This vertex graph has a propagator correction given by edges 4, 5, 6. The nontrivial part of the coproduct then delivers on the left the subgraph with internal edges 4, 5, 6\namongst other terms. The coproduct on the right has a co-graph on edges 1, 2, 3. There is\na two-point vertex u between edges 2, 3. Choosing two labels u = m2 or u = \u0003 allows to\ndistinguish between mass and wave-function renormalization. We remind the reader that\nthe corresponding monomials in the Lagrangian are m2 φ2 /2 and φ\u0003φ/2.\n2.2. Hopf algebras of graphs. Let P be a class of graphs. We assume ∅ ∈ P and that Γ ∈ P and Γ′ ∼\n=Γ\nimplies Γ′ ∈ P. We say P is closed under extension if given γ ⊂ Γ we have\n(2.3)\n\nγ, Γ ∈ P ⇔ γ, Γ//γ ∈ P.\n\nEasy examples of such classes of graphs are P = core graphs, and P = log divergent graphs, where Γ is\nlog divergent (in φ44 theory) if it is core and if further #E(Γi ) = 2|Γi | for every connected component Γi ⊂ Γ.\n(Both examples are closed under extension by virtue of the identity |γ| + |Γ//γ| = |Γ|.) Examples which arise\nin physical theories are more subtle. Verification of (2.3) requires an analysis of which graphs can arise from\na given Lagrangian. To verify P = {Γ | sdd(Γ) ≥ 0} satisfies (2.3) one must consider self-energy graphs and\nthe role of vertices of kinetic type as discussed above.\nIn particular, in massless φ44 theory divergent graphs are closed under extension, and so is the class of\ngraphs for which 4|Γ|−2|Γ[1]|+2|Γ[0],kin|+2|Γ[0],mass | ≥ 0. Note that this may contain superficially convergent\ngraphs if there are sufficiently many two-point vertices of mass type. It pays to include them in the class of\ngraphs to be considered, which enables one to discuss the effect of mass in the renormalization group flow.\nAssociated to a class P which is closed under extension as above, we define a (commutative, but not\ncocommutative) Hopf algebra H = HP as follows. As a vector space, H is freely spanned by isomorphism\nclasses of graphs in P. (A number of variants are possible. One may work with oriented graphs, for\nexample. In this case, the theory of graph homology yields a (graded commutative) differential graded Hopf\nalgebra. One may also rigidify by working with disjoint unions of subgraphs of a given labeled graph.) H\nbecomes a commutative algebra with 1 = [∅] and product given by disjoint union. Define a comultiplication\n∆ : H → H ⊗ H:\nX\n(2.4)\n∆(Γ) =\nγ ⊗ Γ//γ.\nγ⊂Γ\nγ∈P\n\nOne checks that (2.3) implies that (2.4) is coassociative. Since H is graded by loop numbers and each Hn\nis finite dimensional, the theory of Hopf algebras guarantees the existence of an antipode, so H is a Hopf\nalgebra.\n8\n\n\f3\n\n4\n6\n\n1\n\n5\n2\n\nFigure 4. In Eq.(2.6), we give the coproduct for this wheel with three spokes in the core\nHopf algebra.\n\nIf P ′ ⊂ P with Hopf algebras H ′ , H ( e.g. take P to be core graphs, and P ′ ⊂ P divergent core graphs) then\nthe map H ։ H ′ obtained by sending Γ 7→ 0 if Γ 6∈ P ′ is a homomorphism of Hopf algebras. For example, the\ndivergent Hopf algebra carries the information needed for renormalization [13], while the core Hopf algebra\nHC determines the monodromy. In terms of groupschemes, one has Spec (Hlog. div. ) ֒→ Spec (HC ) is a closed\nsubgroupscheme, and renormalization can be viewed as a morphism from the affine line with coordinate L\nto Spec (Hlog. div. ). Already here we use that for divergent graphs with sdd(Γ) > 0, we can evaluate them\nas polynomials in masses and external momenta with coefficients determined from log divergent graphs, see\nbelow.\nLet Γi , i = 1, 2 be core graphs (a similar discussion will be valid for other classes of graphs) and let vi ∈ Γi\nbe vertices. Let Γ = Γ1 ∪ Γ2 where the two graphs are joined by identifying v1 ∼ v2 . Then Γ is core (cf.\nproposition 3.2). Further, core subgraphs Γ′ ⊂ Γ all arise as the image of Γ′1 ∐ Γ′2 → Γ for Γ′i ⊂ Γi core.\nThus\n\u0010X\n\u0011\u0010 X\n\u0011\nX\n(2.5) ∆(Γ) =\nΓ′ ⊗ Γ//Γ′ =\nΓ′1 ⊗ Γ1 //Γ′1\nΓ′2 ⊗ Γ2 //Γ′2 +\n\u0011\n\u0010\nX\nX\nΓ′ ⊗ Γ//Γ′ − Γ1 //Γ′1 * Γ2 //Γ′2 .\n(Γ′ − Γ′1 * Γ′2 ) ⊗ (Γ1 //Γ′1 * Γ2 //Γ′2 ) +\nIt follows that the vector space I ⊂ HC spanned by elements Γ − Γ1 * Γ2 as above satisfies ∆(I) ⊂ I ⊗ HC +\nHC ⊗ I. Since I is an ideal, we see that H C := HC /I is a commutative Hopf algebra. Roughly speaking, H C\nis obtained from HC by identifying one vertex reducible graphs with products of the component pieces.\nGeneralization to theories with more vertex and edge types are straightforward.\nFig.(4) gives the wheel with three spokes. This graph, which in φ4 theory (external edges to be added such\nthat each vertex is four-valent) has a residue 6ζ(3) for conceptual reasons [2], has a coproduct (we omit edge\nlabels and identify terms which are identical under this omission, which gives the indicated multiplicities)\n\n\n(2.6)\n\n\n∆\n\n\n=\n\n⊗\n\nI\n\n+I ⊗\n\n+4\n\n⊗\n\n+3\n\n⊗\n\n6\n\n⊗\n9\n\n.\n\n\fFor example, the three possible labelings for the four-edge cycle in the third line are 4523, 5631 and 6412.\nWhile the graph has a non-trivial coproduct in the core Hopf algebra, it is a primitive element in the\nrenormalization Hopf algebra. It is tempting to hope that the core coproduct relates to the Hodge structure\nunderlying the period which appears in the residue of this graph.\n2.3. Rooted tree Hopf algebras [12], [3]. We introduce the Hopf algebra of decorated non-planar rooted\ntrees HT using non-empty finite sets as decorations (decorations will be sets of edge labels of Feynman graphs\nbelow) to label the vertices of the rooted tree Hopf algebra HT (∅). Products in HT are disjoint unions of\ntrees (forests). We write the coproduct as\nX\n(2.7)\n∆(T ) = T ⊗ I + I ⊗ T +\nP C (T ) ⊗ RC (T ).\nadmissible cuts C\n\nEdges are oriented away from the root and a vertex which has no outgoing edge we call a foot. An admissible\ncut is a subset of edges of a tree such that no path from the root to any vertex of T traverses more than one\nelement of that subset. Such a cut C separates T into at least 2 components. The component containing\nthe root is denoted RC (T ), and the product of the other components is P C (T ).\nA ladder is a tree without side branching. Decorated ladders generate a sub-Hopf algebra LT ⊂ HT . A\ngeneral element in LT is a sum of bamboo forests, that is disjoint unions of ladders. Decorated ladders have\nan associative shuffle product\nX\nL(k)\n(2.8)\nL1 ⋆ L2 :=\nk∈shuffle(l1 ,l2 )\n\nwhere li denotes the ordered set of decorations for Li and shuffle(l1 , l2 ) is the set of all ordered sets obtained\nby shuffling together l1 and l2 .\nLemma 2.1. Let K ⊂ LT be the ideal generated by elements of the form L1 * L2 − L1 ⋆ L2 . Then ∆(K) ⊂\nK ⊗ LT + LT ⊗ K.\nPdi\nProof. Write ∆(Li ) = j=0\nLij ⊗ Ldi i −j where di is the length of Li and Lij (resp. Lji ) is the bottom (resp.\ntop) subladder of length j. Then\nX\n(2.9)\nL1j L2μ ⊗ L1d1 −j L2d2 −μ\n∆(L1 )∆(L2 ) =\nX\n\n∆(L1 ⋆ L2 ) =\n\nj,μ\n\n∆(L(k)) =\n\nk\n\nX\n\nL(k)ν ⊗ L(k)d1 +d2 −ν .\n\nk,ν\n\nConsider pairs (j, μ) of indices in (2.9) and write j + μ = ν. Among the pairs k, ν we consider the subset\nK(j, μ) for which the first ν = j + μ elements of the ordered set consist of a shuffle of the decorations on the\nladders L1j , L2μ . It is clear that the remaining d1 + d2 − ν elements of k will then run through shuffles of\nthe decorations of L1d1 −j , L2d2 −μ , so\n\u0011\nX\nX\u0010\nL(k)j+μ ) ⊗ L1d1 −j L2d2 −μ +\n(L1j L2μ −\n(2.10) ∆(L1 )∆(L2 ) − ∆(L1 ⋆ L2 ) =\nX\u0010\nj,μ\n\nX\n\nj,μ\n\nk∈K(j,μ)\n\nk∈K(j,μ)\n\n\u0011\nL(k)j+μ ⊗ (L1d1 −j L2d2 −μ − L(k)d1 +d2 −j−μ ) ∈ K ⊗ LT + LT ⊗ K.\n\n\u0003\nRemark 2.2. Any bamboo forest is equivalent mod K to a sum of stalks. Indeed, one has e.g.\n(2.11)\n\nL1 * L2 * L3 ≡ (L1 ⋆ L2 ) * L3 ≡ (L1 ⋆ L2 ) ⋆ L3 ≡ L1 ⋆ L2 ⋆ L3 .\n\nFor any decoration l, one has an operator [3]\n(2.12)\n\nl\nB+\n: HT → HT\n\nwhich carries any forest to the tree obtained by connecting a single root vertex with decoration l to all the\nroots of the forest. This operator is a Hochschild 1-cocycle, i.e.\n(2.13)\n\nl\nl\nl\n∆B+\n= B+\n⊗ I + (id ⊗ B+\n)∆.\n10\n\n\fLet J ⊂ HT be the smallest ideal containing the ideal K as in lemma 2.1 and stable under all the operators\nl\nB+\n. Generators of J as an abelian group are obtained by starting with elements of K and successively\nl\napplying B+\nfor various l and multiplying by elements of HT . It follows from (2.13) that ∆J ⊂ J ⊗ HT +\nHT ⊗ J . Define\n(2.14)\n\nH T := HT /J .\n\nA flag in a core graph Γ is a chain\n(2.15)\n\nf := ∅ ( Γ1 ( * * * ( Γn = Γ\n\nof core subgraphs. Write F (Γ) for the collection of all maximal flags of Γ. One checks easily that for a\nmaximal flag, n = |Γ|. Let us consider an example.\n\n(2.16)\n\n(\n\n(\n\n(2.17)\n\n(\n\n(2.18)\n\n(\n\n(\n\n,\n\n(2.19)\n\n(\n\n(\n\n,\n\n(2.20)\n\n(\n\n(\n\n,\n\n(2.21)\n\n(\n\n(\n\n,\n\n(2.22)\n\n(\n\n(\n\n,\n\n(2.23)\n\n(\n\n(\n\n,\n\n(2.24)\n\n(\n\n(\n\n,\n\n(2.25)\n\n(\n\n(\n\n,\n\n(2.26)\n\n(\n\n(\n\n,\n\n(2.27)\n\n(\n\n(\n\n,\n\n,\n\n(\n\n,\n\nare the twelve flags for the graph given in Fig.(5). We omitted the edge labels in the above flags. Note that\nonly the first two , (2.16,2.17) are relevant for the renormalization Hopf algebra to be introduced below.\n11\n\n\f3\n\n2\n6\n\n5\n1\n\n4\n\nFigure 5. A graph with overlapping subdivergences. The renormalization Hopf algebra\ngives ∆′ 123456 = 56 ⊗ 1234 + 1256 ⊗ 34 + 3456 ⊗ 12. Note that each edge belongs to some\nsubgraph with sdd ≥ 0.\nTo the flag f we associate the ladder L(f ) with n vertices decorated by Γi − Γi−1 . (More precisely, the\nfoot is decorated by Γ1 and the root by Γ − Γn−1 .). Define\nX\nL(f )\n(2.28)\nρL : HC → LT ; ρL (Γ) :=\nf ∈F (Γ)\n\nHere the set of labels D will be the set of subsets of graph labels.\nLemma 2.3. The map ρL is a homomorphism of Hopf algebras.\n\nProof. For a flag f let f (p) be the bottom p vertices with the given labeling, and let f(p) be the top n − p\nvertices with the quotient labeling gotten by contracting the core graph associated to the bottom p vertices.\nFor γ ⊂ Γ a core subgraph, define F (Γ, γ) := {f ∈ F (Γ) | γ ∈ f }. There is a natural identification\nF (Γ, γ) = F (γ) × F (Γ//γ).\n\n(2.29)\nWe have\n(2.30)\n\n(ρL ⊗ ρL ) ◦ ∆C (Γ) =\n\nX\n\nρL (γ) ⊗ ρL (Γ//γ) =\n\nγ\n\nOn the other hand\n(2.31)\n\n∆L ◦ ρL (Γ) =\n\nX\nγ\n\nn\nX X\n\nX\n\nL(f |γ|) ⊗ L(f|γ| ).\n\nf ∈F (Γ,γ)\n\nL(f (i) ) ⊗ L(f(i) ).\n\nf ∈F (Γ) i=1\n\nThe assertion of the lemma is that there is a 1 − 1 correspondence\n(2.32)\n\n{γ, max. flag of Γ containing γ} ↔ {max. flag of Γ , i ≤ n}.\n\nThis is clear.\n\n\u0003\n\nIn fact, the tree structure associated to a maximal flag f of Γ is rather more intricate than just a ladder.\nThough we do not use this tree structure in the sequel, we present the construction in some detail to help\nin understanding the difference between the core and renormalization Hopf algebra.\nWe\nS want to associate a forest T (f ) to the flag f , and we proceed by induction on n = |Γ|. We can\nP write\nΓ = Γ(j) in such a way that all the Γ(j) are core and one vertex irreducible,\nand\nsuch\nthat\n|Γ|\n=\n|Γ(j) |.\nQ\n(j)\n(j)\nThis decomposition is unique. If it is nontrivial, we define T (f ) = T (f ) where f is the induced flag\nfrom f on Γ(j) . We now may assume Γ is one vertex irreducible. If the Γi in our flag are all one vertex\nirreducible, we take T (f ) = L(f ) to be a ladder as above. Otherwise, let m < n be maximal such that\nΓm ( Γ is one vertex reducible. By induction, we have a forest T (f |Γm ). To define T (f ), we glue the foot\nof the ladder with decorations Γm+1 − Γm , . . . , Γ − Γn−1 to all the roots of T (f |Γm ). (For an example, see\nfigs.(6) and (7).)\nS\nP\nLemma 2.4. Let Γ = Γ(j) where Γ and the Γ(j) are core. Assume |Γ| = j |Γ(j) |. Then, viewing flags\nf ∈ F (Γ) as sets of core subgraphs, ordered by inclusion, there is a 1 − 1 correspondence between F (Γ) and\nshuffles of the F (Γ(j) ).\nProof. One checks easily that the Γ(j) can have no edges in common. Further, there is a 1 − 1 correspondence\nbetween core subgraphs Γ′ ⊂ Γ andScollections of core subgraphs Γ(j)′ ⊂ Γ(j) . Here, the dictionary is given\nby Γ′ 7→ {Γ′ ∩ Γ(j) } and {Γ(j)′ } 7→ Γ(j)′ . The assertion of the lemma follows.\n\u0003\n12\n\n\f6\n\n4\n\n12\n\n2\n3\n\n4\n\n5\n\n6\n\n+...+\n56\n\n34\n\n1\n\n1235\n\nFigure 6. The core Hopf algebra on rooted trees. We indicate subgraphs by edge labels\non the vertices of rooted trees. The dots indicate seven more such trees, corresponding to\nflags Γi ( Γj ( Γk with Γi a cycle on four edges. The last tree represents a sum of two\nflags, 34 ( 3456 ( 123456 + 56 ( 3456 ( 123456, again indicating graphs by edge labels.\nHence that tree corresponds to a sum of two ladders, as it should.\n2\n3\n\n4\n\n2\n\n5\n\n6\n\n3\n\n4\n\n1\n5\n\n6\n\n1\nd or c\n\n12\n\n12\n\nc or d +\n\n56 +\n\n34\n\n1a2b\n\n34\n\nd or c\n\n12\n\nc or d +\n\n34 +\n\n56\n\n12ab\n\n56\n\n34\n\n12\n\n56\n\nFigure 7. The two graphs differ in how the subdivergences are inserted. a, c ∈ 3, 4, and\nb, d ∈ 5, 6, c 6= a, b 6= d. So there are eight such legal trees, plus the two which are\nidentical between the two graphs. Note the permutation of labels at the feet of the trees\nin ρ(Γ): 1a2b ↔ 12ab. Keeping that order, we can uniquely reconstruct each graph from\nthe knowledge of the labels at the feet: 1a2b, 34, 56 and 12ab, 34, 56, which are the cycles in\neach graph. Note that in the difference of the two graphs, only the difference of those eight\ntrees remains, corresponding to a primitive element in the renormalization Hopf algebra.\nThe core Hopf algebra hence stores much more information than the renormalization Hopf\nalgebra, which we hope to use in the future to understand the periods assigned to Feynman\ngraphs by the Feynman rules.\nAs a consequence of lemma 2.4 we may partition the flags F (Γ) associated to a core Γ as follows. Given\nf ∈ F (Γ), Let Γm ⊂ Γ be maximal in the flag f such that Γm is 1-vertex reducible. The flag f induces a\nS (j)\n(j)\n(j)\nflag fm on Γm , and we know that it is a shuffle of flags fm on Γm where Γm = Γm as in the lemma. We\nsay two flags are equivalent, f ∼ f ′ , if f and f ′ agree at Γm and above, and if they simply correspond to\n(j)\ntwo different shuffles of the flags fm . We now have\nX\n(2.33)\nT (f ) ≡\nL(f ′ ) mod J .\nf ′ ∼f\n\nl\nIndeed, T (f ) is obtained by successive B+\noperations applied to the forest T (f |Γm ). The latter, by remark\n2.2, coincides with the righthand side of (2.33). We conclude\n\nProposition 2.5. With notation as above, there exist homomorphisms of Hopf algebras\nρL\n\n(2.34)\n\nHC −−−−→\n\n\ny\nρT\n\nLT\n\n\ny\n\nH C −−−−→ H T\n13\n\n\fHere ρT (Γ) is the sum T (f ) over equivalence classes of flags f as above. We will barely use HT in the\nfollowing, and introduced it for completeness and the benefit of the reader used to it.\n2.4. Renormalization Hopf algebras. In a similar manner, one may define homomorphisms\nρ R : HR → H T\n\n(2.35)\n\nfor any one of the renormalization Hopf algebras obtained by imposing restrictions on external leg structure.\nFor a graph Γ, let, as before, the residue of Γ, res(Γ), be the graph with no loops obtained by shrinking all\nits internal edges to a point. What remains are the external half edges connected to that point (cf. section\n2.1). Note that \"doubling\" an edge by putting a two-point vertex in it does not change the residue.\nIn φ44 theory for example, graphs have 2m external legs, with m ≥ 0. For a renormalizable theory, there\nis a finite set of external leg structures R such that we obtain a renormalization Hopf algebra for that set.\nFor example, for massive φ44 theory, there are three such structures: the four-point vertex, and two\ntwo-point vertices, of kinetic type and mass type.\nLet us now consider flags associated to core graphs. Such chains * * * Γi ( Γi+1 ( * * * ( Γ correspond to\ndecorated ladders, and the coproduct on the level of such ladders is a sum over all possibilities to cut an\nedge in such a ladder, splitting the chain\n[* * * ( Γi ] ⊗ [Γi+1 //Γi ( * * * ( Γ//Γi ].\n\n(2.36)\n\nSo let us call such an admissible cut renormalization-admissible, if all core graphs Γi , Γ//Γi obtained by\nthe cut have residues in R.\nThe set of renormalization-admissible cuts is a subset of the admissible cuts of a core graph, and the\ncoproduct respects this. Hence the renormalization Hopf algebra HR is a quotient Hopf algebra of the core\nHopf algebra.\nIf we enlarge the set R to include other local field operators appearing for example in an operator product\nexpansion we get quotient Hopf algebras between the core and the renormalization Hopf algebra.\n2.5. External leg structures. External edges are usually labeled by data which characterize the amplitude\nunder consideration. Let σ be such data. For graphs Γ with a given residue res(Γ), there is a finite set\nτ ∈ {σ}res(Γ) of possible data τ . A choice of such data determines a labeling of the corresponding vertex to\nwhich a subgraph shrinks. Let Γ//γτ be that co-graph with the corresponding vertex labeling.\nOne gets a Hopf algebra\nstructure on pairs (Γ, σ) by using the renormalization coproduct ∆(Γ) = Γ′ ⊗ Γ′′\nP\nby setting ∆(Γ, σ) = τ ∈{σ}res(Γ′ ) (Γ′ , τ ) ⊗ (Γ′′τ , σ). We regard the decomposition into external leg structures\nas a partition of unity and write\nX\n(Γ, τ ) = (Γ, I).\n(2.37)\nτ ∈{σ}res(Γ)\n\nIn our applications we only need this for (sub)graphs γ with |res(γ)| = 2, and the use of these notions will\nbecome clear in the applications below.\n3. Combinatorics of blow-ups\nn−1\n\nWe consider P\nwith fixed homogeneous coordinates A := {A1 , . . . , An }. Suppose given a subset\nS ⊂ 2A . Assume A 6∈ S and that S has the property that whenever μ1 , μ2 ∈ S with μ1 ∪ μ2 6= A, then\nμ1 ∪ μ2 ∈ S. For μ ∈ S we write Lμ ⊂ Pn−1 for the coordinate linear space defined by Ai = 0, i ∈ μ. Write\nL(S) := {Lμ | μ ∈ S}. We see that\n(3.1)\n\nLμi ∈ L(S); Lμ1 ∩ Lμ2 6= ∅ ⇒ Lμ1 ∩ Lμ2 ∈ L(S).\n\nWe can stratify the set L(S) taking L(S)1 to be the set of all minimal elements (under inclusion) of L(S).\n`i−1\nMore generally, L(S)i will be the set of minimal elements in L(S) − j=1 L(S)j .\n\nProposition 3.1. (i) Elements in L(S)1 are all disjoint, so we may define P (S)1 to be the variety defined by\nblowing up elements in L(S)1 on Pn−1 . We do not need to specify an order in which to perform the blowups.\n(ii) More generally, the strict transforms of elements in L(S)i+1 to the space P (S)i obtained by successively\nblowing the strict transform of L(S)j , j = 1, . . . , i are disjoint, so we may inductively define P (S) to be the\nsuccessive blowup of the L(S)i .\n14\n\n\f(iii) Let Ei ⊂ P (S) correspond to the blowup of Lμi , i = 1, . . . , r. (Ei is the unique exceptional divisor\nwith image Lμi in P (S).)Then E1 ∩ * * * ∩ Er 6= ∅ if and only if after possibly reordering, we have inclusions\nLμ1 ⊂ * * * ⊂ Lμr .\n(iv) The total exceptional divisor E ⊂ P (S) is a normal crossings divisor.\n(v) Let M ⊂ Pn−1 be a coordinate linear space. Assume M 6⊂ L for any L ∈ L(S). Then M ∩ L(S) :=\n{M ∩ L | L ∈ L(S)} satisfies (3.1). The strict transform of M in P (S) is obtained by blowing up elements\nof M ∩ L(S) on M as in (i) and (ii) above.\nProof. If L1 6= L2 ∈ L(S)i and L1 ∩ L2 6= ∅, then L1 ∩ L2 ∈ L(S)j for some j < i. This means that when we\nget to the i-th step,\nT L1 ∩L2 has already been blown up, so the strict transforms of the Li are disjoint, proving\n(ii). For (iii), Ei 6= ∅ ⇐ Lμ1 ⊂ * * * ⊂ Lμr follows from the above argument. Conversely, if we have strict\ninclusions among the Lμi , we may write (abusively) Lμi /Lμi−1 for the projective space with homogeneous\ncoordinates the homogeneous coordinates on Lμi vanishing on Lμi−1 . The exceptional divisor on the blowup\ncalculation identifies nonempty\nof Lμi−1 ⊂ Lμi is identified with Lμi−1 × (Lμi /Lμi−1 ). A straightforward\nT\nopen sets (open toric orbits in the sense to be discussed below) in Ei and\n(3.2)\n\nLμ1 × (Lμ2 /Lμ1 ) × * * * × (Lμr /Lμr−1 )\n\nThe remaining parts of the proposition follow from the algorithm in [8].\n\n\u0003\n\nFor us, sets S as above will arise in the context of graphs. Recall in 2.1 we defined the notion of core\ngraph.\nProposition 3.2. Let Γ be a graph, and let Γ1 , Γ2 ⊂ Γ be core subgraphs. Then the union Γ1 ∪ Γ2 is a core\nsubgraph.\nProof. Removing an edge increases the Euler-Poincaré characteristic by 1. If h1 doesn't drop, then either\nh0 increases (the graph disconnects when e is removed) or e has a unary vertex so removing e drops the\nnumber of vertices. Suppose e is an edge of Γ1 (assumed core). Then e cannot have a unary vertex. If, on\nthe other hand, removing e disconnects Γ1 ∪ Γ2 , then since the Γi are core what must happen is that each\nΓi has precisely one vertex of e. But this would imply that Γ1 is not core, a contradiction.\n\u0003\nTo a graph Γ we may associate the projective space P(Γ) with homogeneous coordinates Ae , e ∈ E(Γ)\nlabeled by the edges of Γ. Let Γ be a core graph. A coordinate linear space L ⊂ P(Γ) is a non-empty linear\nspace defined by some subset of the homogeneous coordinate functions, L : Ae1 = * * * = Aep = 0. Define\nL(Γ) to be the set of coordinate linear spaces in P(Γ) such that the corresponding set of edges ei1 , . . . , eip is\nthe edge set of a core subgraph Γ′ ⊂ Γ. It follows from proposition 3.2 that L(Γ) satisfies condition (3.1), so\nthe iterated blowup\nπ : P (Γ) → P(Γ)\n\n(3.3)\n\nas in proposition 3.1 is defined. Define\n[\nL ⊂ P(Γ);\n(3.4)\nL=\n\nE=\n\nL∈L(Γ)\n\n[\n\nEL = π −1 L.\n\nn−1\n\nLemma 3.3. Suppose P(Γ) = P\nwith coordinates A1 , . . . , An . Let L ⊂ P(Γ) be defined by A1 = * * * =\nAp = 0. Let πL : PL → P(Γ) be the blowup of L. Then the exceptional divisor E ⊂ PL is identified\nwith Pp−1 × L. Further A1 , . . . , Ap induce coordinates on the vertical fibres Pp−1 and Ap+1 , . . . , An give\nhomogeneous coordinates on L.\nProof. This is standard. One way to see it is to use the map Pn−1 − L → Pp−1 , [a1 , . . . , an ] 7→ [a1 , . . . , ap ].\n(Here, and in the sequel, [* * * ] denotes a point in homogeneous coordinates.) This extends to a map f on\nPL :\n֒→\n\n(3.5)\n\nE −−−−→\n\nπ |\ny LE\n֒→\n\nf\n\nPL −−−−→ Pp−1\n\nπ\ny L\n\nL −−−−→ Pn−1 .\nThe resulting map πL |E × f : E ∼\n= L × Pp−1 .\n15\n\n\u0003\n\n\fIt will be helpful to better understand the geometry of P (Γ). Let Gm = Spec Q[t, t−1 ] be the standard one\ndimensional algebraic torus. Define T = Gnm /Gm where the quotient is taken with respect to the diagonal\nembedding. For all practical purposes, it suffices to consider complex points\n(3.6)\n\nT (C) = C×n /C× ∼\n= C×n−1 .\n\nA toric variety P is an equivariant (partial) compactification of T . In other words, T ⊂ P is an open set,\nand we have an extension of the natural group map m\n⊂\n\n(3.7)\n\nT × T −−−−→ T × P\n\n\n\n\nmy\nm̄y\nT\n\n⊂\n\n−−−−→\n\nP.\n\n\u000e\nQ\nFor example, P(Γ) is a toric variety for a torus T (Γ). Canonically, we may write T (Γ) = ( e∈Edge(Γ) Gm ) Gm .\nMore important for us:\nProposition 3.4. (i) P (Γ) is a toric variety for T = T (Γ).\n(ii) The orbits of T on P (Γ) are in 1 − 1 correspondence with pairs (F, Γp ( * * * ( Γ1 ( Γ). Here F ⊂ Γ is\na (possibly empty) subforest (subgraph with h1 (F ) = 0) and the Γi are core subgraphs of Γ. We require that\nthe image of Fi := F ∩ Γi in Γi //Γi+1 be a subforest for each i. (cf. (3.2)). The orbit associated to such\na pair is canonically identified with the open orbit in the toric variety P(Γp //Fp ) × P((Γp−1 //Γp )//Fp−1 ) ×\n* * * × P((Γ//Γ1 )//F ).\nProof. A general reference for toric varieties is [9]. The fact (i) that P (Γ) is a toric variety follows inductively\nfrom the fact that the blowup of an invariant ideal I in a toric variety is toric. Indeed, the torus acts on I\nand hence on the blowup Proj(I).\nWe recall some toric constructions. Let N = ZEdge(Γ) /Z, and let M = hom(N, Z). We have canonically\nT = Spec Q[M ] where Q[M ] is the group ring of the lattice M . A fan (op. cit., 1.4, p. 20) F is a finite set\nof convex cones in NR = N ⊗ R satisfying certain simple axioms. To a cone C ⊂ NR one associates the dual\ncone (op. cit. p. 4)\n(3.8)\n\nC ∨ = {m ∈ MR | hm, ci ≥ 0, ∀c ∈ C}\n\n(resp. the semigroup CZ∨ = C ∨ ∩ M ). The toric variety V (F ) associated to the fan F is then a union of\nthe affine sets U (C) := Spec Q[CZ∨ ]. For example,\nour N has rank n − 1. There are n evident elements e\nP\ndetermined by the n edges of Γ. Let Ce = { e′ 6=e re′ e′ | re′ ≥ 0} be the cone spanned by all edges except\ne. The spanning edges for Ce form a basis for N which implies that U (Ce ) ∼\n= An−1 . Since all the coordinate\nrings lie in Q[M ] (i.e. T (Γ) ⊂ U (Ce )), one is able to glue together the U (Ce ). The resulting toric variety\nassociated to the fan {Ce | e ∈ Edge(E)} is canonically identified with P(Γ).\nRemark 3.5. Our toric varieties will all be smooth (closures of orbits in smooth toric varieties are smooth),\nwhich is equivalent ([9], §2) to the condition that cones in the fan are all generated by subsets of bases for\nthe lattice N . Faces of these cones are in 1 − 1 correspondence with subsets of the generating set.\nIn general, the orbits of the torus action are in 1 − 1 correspondence with the cones C in the fan (op. cit.\n3.1, p.51). The subgroup of N generated by C ∩ N corresponds to the subgroup of T which acts trivially\non the orbit. For example, in the case of projective space Pn−1 , there are n cones Ce of dimension n − 1\ncorresponding to the n fixed points (0, . . . , 1, . . . , 0) ∈ Pn−1 . For any S ( Edge(Γ), the cone C(S) spanned by\nthe edges of S corresponds to the orbit {(. . . , xe , . . .) | xe = 0 ⇔ e ∈ S} ⊂ Pn−1 . Let L : Ae = 0, e ∈ Γ′ ⊂ Γ\nbe a coordinate linear space in P(Γ) associated to a subgraph Γ′ ⊂ Γ. It follows from lemma 3.3 that the\nexceptional divisor EL ⊂ PL in the blowup of L can be identified with\n(3.9)\n\nEL = P(Γ′ ) × P(Γ//Γ′ ).\n\nP\n′\n≥0\nLet e(Γ′ ) =\n* e(Γ′ ). The subgroup Z * e(Γ′ ) ⊂ N determines a\ne∈Γ′ e ⊂ NR , and write τ (Γ ) = R\n′\n1-parameter subgroup G(Γ ) ⊂ T = Spec Q[M ]. It follows from (3.9) that G(Γ′ ) acts trivially on EL . One\nhas τ (Γ′ ) ⊂ C ′ ⊂ Ce for all e 6∈ Γ′ , where C ′ is the cone generated by the edges of Γ′ . For all e′ ∈ Γ′ we\n16\n\n\fdefine a subcone Ce,e′ ⊂ Ce to be spanned by τ (Γ′ ) together with all edges of Γ except e, e′ . The fan for PL\nis then\n(3.10)\n\n{Ce , e ∈ Γ′ } ∪ { Ce,e′ , e 6∈ Γ′ , e′ ∈ Γ′ }.\n\nNote that Ce , e 6∈ Γ′ is not a cone in the fan for PL . More generally, let F be the fan for P (Γ). Certainly,\nF will contain as cones the half-lines τ (Γ′ ) for all core subgraphs Γ′ ⊂ Γ as well as the R≥0 e, e ∈ Γ. but\nwe must make precise which subsets of this set of half-lines span higher dimensional cones in F . By general\ntheory, the cones correspond to the nonempty orbits. In other words,\n(3.11)\n\nR≥0 e1 , . . . , R≥0 ep , R≥0 e(Γ1 ), . . . , R≥0 e(Γq )\n\nspan a cone in F if and only if the intersection\n(3.12)\n\nE1 ∩ * * * ∩ Eq ∩ D1 ∩ * * * ∩ Dp 6= ∅,\n\nwhere Ei ⊂ P (Γ) is the exceptional divisor corresponding to L(Γi ) and Dj ⊂ P (Γ) is the strict transform of\nthe coordinate divisor Aei = 0 in P(Γ). To understand (3.12), consider the simple case E1 ∩ D1 . We have a\ncore subgraph Γ1 ⊂ Γ, and an edge e1 of Γ. We know by lemma 3.3 that E1 ∼\n= P(Γ1 ) × P(Γ//Γ1 ). If e1 is an\nedge of Γ1 , then D1 ∩ E1 = P(Γ1 //e1 ) × P(Γ//Γ1 ). Otherwise\nD1 ∩ E1 = P(Γ1 ) × P((Γ//Γ1 )//e1 ).\nOne (degenerate) possibility is that e1 is an edge of Γ1 which forms a loop (tadpole). In this case, e1 is itself\na core subgraph of Γ, and the divisor D1 should be treated as one of the exceptional divisors Ei . Thus, we\nomit this possibility. Another possibility is that e1 6∈ Γ1 , but that the image of e1 in Γ//Γ1 forms a loop.\nIn this case, Γ2 := Γ1 ∪ e1 is a core subgraph, so the linear space L2 : Ae = 0, e ∈ Γ2 gets blown up in\nthe process of constructing P (Γ). But blowing L2 separates E1 and D1 , so the intersection of the strict\ntransforms of D1 and E1 in P (Γ) is empty. The general argument to show that (3.12) is empty if and only\nif the conditions of (ii) in the proposition are fulfilled is similar and is left for the reader. Note that the case\nwhere there are no divisors Di follows from proposition 3.1(iii).\n\u0003\nWe are particularly interested in orbits corresponding to filtrations by core subgraphs Γp ( * * * ( Γ1 ( Γ.\nLet V ⊂ P (Γ) be the closure of this orbit. We want to exhibit a toric neighborhood of P\nV which retracts onto\nV as a vector bundle of rank p. As in the proof of proposition 3.4 we have e(Γi ) := e∈Γi e. The cone C\nspanned by the e(Γi ) lies in the fan F . For cones C ′ ∈ F we write C ′ > C if C is a subcone of C ′ . By the\ngeneral theory, this will happen if and only if C ⊂ C ′ is a subcone which appears on the boundary of C ′ .\nThe orbit corresponding to C ′ will then appear in the closure of the orbit for C.\nProposition 3.6. With notation as above, Let FC ⊂ F be the subset of cones C ′ such that we have\nC ′ ≤ C ′′ ≥ C for some C ′′ ∈ F . Write P 0 ⊂ P (Γ) for the open toric subvariety corresponding to the subfan\nFC ⊂ F . We have V ֒→ P 0 ⊂ P (Γ). Further there is a retraction π : P 0 → V realizing P 0 as a rank p\nvector bundle over V which is equivariant for the action of the torus T .\nProof. One has the following functoriality for toric varieties [9], §1.4. Suppose φ : N ′ → N ′′ is a homomorphism of lattices (finitely generated free abelian groups). Let F ′ , F ′′ be fans in NR′ , NR′′ . Suppose for each\ncone σ ′ ∈ F ′ there exists a cone σ ′′ ∈ F ′′ such that φ(σ ′ ) ⊂ σ ′′ . Then there is an induced map on toric\nvarieties V (F ′ ) → V (F ′′ ). Let N ′ = N = Zn /Z as above, and N ′′ = N ′ /(Ze(Γ1 ) + * * * + Ze(Γp )). One has\nthe evident surjection φ : N ′ ։ N ′′ . We take as fan F ′ = FC ⊂ F . The closure V of the orbit corresponds\nto the fan F ′′ in NR′′ given by the images of all cones C ′′ ≥ C (op. cit. §3.1). Such a C ′′ is generated by\ne(Γ1 ), . . . , e(Γp ), f1 , . . . , fq , and there are no linear relations among these elements (remark 3.5). A subcone\nC ′ ≤ C ′′ is generated by a subset e(Γi1 ), . . . , e(Γia ), f1 , . . . , fb . The image is simply the cone in NR′′ generated\nby the images of the f 's. If we have another cone C1′ ≤ C1′′ ≥ C in F ′ with the same image in F ′′ , it will\nhave generators say g1 , . . . , gb together with some of the e(Γi )'s. Reordering the g's, we find that there are\nrelations\nX\nX\n(3.13)\nfi +\naij e(Γj ) = gi +\nbij e(Γj )\n\nwith aij , bij ≥ 0. It follows that the cones in F spanned by fi , e(Γ1 ), . . . , e(Γp ) and gi , e(Γ1 ), . . . , e(Γp ) meet\nin a subset strictly larger that the cone spanned by the e(Γj ). By the fan axioms, the intersection of two\ncones in a fan is a common face of both, so these two cones coincide, which implies fi = gi . In particular,\n17\n\n\ffor each cone in F ′′ , there is a unique minimal cone in F ′ lying over it. This is the hypothesis for [19], p. 58,\nproposition 1.33. One concludes that the map π : P 0 → V induced by the map F ′ → F ′′ is an equivariant\nfibration, with fibre the toric bundle associated to the fan generated by the e(Γi ), 1 ≤ i ≤ p. This toric\nvariety is just affine p-space, so we get an equivariant Ap -fibration over V . Any such fibration is necessarily\na vector bundle with structure group Gpm . Indeed, this amounts to saying that any automorphism of the\npolynomial ring k[x1 , . . . , xp ] which intertwines the diagonal action of Gpm is necessarily of the form xi 7→ ci xi\nwith ci ∈ k × .\n\u0003\nRemark 3.7. We will need to understand how these constructions are compatible. Let V be a closed orbit\ncorresponding to a cone C as above, and let V1 ⊂ V be a smaller closed orbit corresponding to a larger cone\nC1 > C. (The correspondence between cones and orbits is inclusion-reversing.) As above we have a toric\nvariety V1 ⊂ P10 ⊂ P (Γ) and a retraction π1 : P10 → V1 . The fan F1′ for P10 is given by the set of cones C1′ in\nF such that\nC1′ ≤ C ′′ ≥ C1 (> C).\n\n(3.14)\n\nIt follows that F1′ ⊂ F ′ = FC , so P10 ⊂ P 0 is an open subvariety. Let V 0 ⊂ V be the image of the composition\nπ\nP10 ⊂ P 0 −\n→ V . Then V 0 is the open toric subvariety of V corresponding as above to the closed orbit V1 ⊂ V ,\nπV\nV1 . One gets commutative diagrams\nand we have a retraction V 0 −−→\n\n(3.15)\n\nP10\n\n\nπ1 y\n\n⊂\n\nπ\n\nP10 −−−−→ P 0\n\n\n\n\nπy\nπy\n⊂\n\nV\n−− V 0 −−−−→ V\nV1 ←−−\n\nand\n\n⊂\n\nP 0 |V1 −−−−→ P10\n\n\n\n\nπ1 y\nπy\n\n(3.16)\n\nV1 .\n\nV1\n\nRemark 3.8. Using the toric structure, one can realize these vector bundles as direct sums of line bundles\ncorresponding to characters of the tori acting on the fibres.The inclusion on the top line of (3.16) corresponds\nto characters which act trivially on all of V .\nRemark 3.9. (compare proposition 3.4). Given a flag of core subgraphs\n(3.17)\n\nΓp ( Γp−1 ( * * * ( Γ1 ( Γ,\n\nlet Li ⊂ P(Γ) be defined by the edge variables for edges in Γi , so we have L1 ( * * * ( Lp ( P(Γ). For\nL ⊂ P(Γ) a coordinate linear space, let T (L) ⊂ L be the subtorus where none of the coordinates vanish.\nThen the orbit associated to (3.17) is\n(3.18)\n\nT (L1 ) × T (L2 /L1 ) × * * * × T (Lp /Lp−1 ) × T (Pn−1 /Lp )\n\n(Here the notation Li+1 /Li is as in (3.2).)\n4. Topological Chains on Toric Varieties\nOne can define the notion of non-negative real points V (R≥0 ) and positive real points V (R>0 ). For a\ntorus T = Spec Q[N ∨ ] for some N ∼\n= Zg we take\nT (R>0 ) = {φ : Q[N ∨ ] → R | φ(n) > 0, ∀n ∈ N ∨ }.\n`\nA toric variety V can be stratified as a disjoint union of tori V = Tα . Define\na\n(4.1)\nV (R≥0 ) =\nTα (R>0 );\nV (R>0 ) = T (R>0 ),\n\nwhere T ⊂ V is the open orbit. Let V ⊂ P (Γ) be the closure of the orbit associated to a flag (3.17), and let\nT (V ) ⊂ T = Spec Q[N ∨ ] be the subtorus acting trivially on V . Let πV : PV → V be the vector bundle as in\n18\n\n\fE\nΕ\n\nΣΗ,Ε\nPHGL\n\nPHGL\n\nΕ\nΕ\n\nΗ\n\nPHGL\n\nΣ\nL\n\nFigure 8. P (Γ) and the real chain σPη,ε(Γ) .\n\nproposition 3.6. We write PV = L1 ⊕ * * * ⊕ Lp as a direct sum of line bundles, where each Li is equivariant\nfor T (V ). Let K(V ) ∼\n= (S 1 )p ⊂ T (V )(C) be the maximal compact subgroup. Note that one has a canonical\nidentification T (V ) = Gpm associated to the 1-parameter subgroups of T (V ) generated by e(Γi ) ∈ N . In\nparticular, the identification K(V ) = (S 1 )p is canonical as well. For all closed orbits V we may fix metrics\non the Li which are compatible under inclusions (3.16) and are (necessarily) invariant under the action of\nK(V ). We fix also a constant η > 0. We can then define SVη ⊂ PV to be the product of the circle bundles\nof radius η embedded in the Li . SVη becomes a principal bundle over V with structure group K(V ). Note\nthat SVη ∩ PV (R≥0 ) contains a unique point in every fibre of SVη over a point of V (R). Let 0 < ε << η be\nanother constant. We need to define a chain σVη,ε ⊂ V (R>0 ). We consider closures V1 ⊂ V of codimension\n1 orbits in V . For each such V1 we have an open P (V )1 ⊂ V and a retraction P (V )1 → V1 which is a line\nbundle with a metric. The fibres of P (V )1 (R>0 ) have a canonical coordinate r > 0. If V1 corresponds to an\nintersection of V = E1 ∩ * * * ∩ Ep with another exceptional divisor Ep+1 , then we remove from each fibre of\nP (V )1 (R>0 ) over V1 (R>0 ) the locus where r < η. If, on the other hand V1 corresponds to an intersection\nof V with one of the Di (i.e. with a strict transform of one of the coordinate divisors), then we remove the\nlocus r < ε. Repeating this process for each V1 (i.e. for each irreducible toric divisor in V ), we obtain a\ncompact σVη,ε ⊂ V (R>0 ) which stays away from the boundary components. (Here \"boundary components\"\nare exceptional divisors together with strict transforms of coordinate divisors.)\nExample 4.1. Consider the case V = P (Γ). Let π : P (Γ) → P(Γ), and let\nσ = {(A1 , . . . , An ) | Ai ≥ 0} ⊂ P(Γ)(R)\nbe the original integration chain. We have σPη,ε(Γ) ⊂ π −1 (σ) defined by excising away points within a distance\nof η from an Ei or ε from the strict transform Dj of a coordinate divisor Aj = 0. (cf. fig.(8)). It is a manifold\nwith corners.\nDefine τVη,ε to be the inverse image of σVη,ε in SVη . The fibres of τVη,ε over σVη,ε are products (S 1 )p with a\ncanonical origin at the point where this fibre meets PV (R≥0 ). For an angle 0 ≤ θ ≤ 2π, we can thus define\nτVη,ε,θ ⊂ τVη,ε to be swept out by the origin in each fibre under the action of [0, θ]p ⊂ K(V ). The chains τVη,ε,θ\nhave R-dimension n − 1 which is equal to the complex dimension of P(Γ) and P (Γ).\n19\n\n\fe2\n\ne1 + e2\n\nC2\n\ne1\n\nfig.\n\nFigure 9. Fan for Example 4.2.\nExample 4.2. Here is an example which is too simple to correspond to any graph, but is sufficient to clarify\nthe toric picture. Take\n(4.2)\n\nL1 : A1 = A2 = 0;\n\nL2 : A2 = 0\n\nπ\n\nin P2 with coordinates A1 , A2 , A3 . Take P −\n→ P2 to be the blowup of L1 = (0, 0, 1). Let E1 ⊂ P be the\nexceptional divisor, and let E2 ⊂ P be the strict transform of L2 . Note that E2 is already a divisor so it is\nnot necessary to blow up again. Take V = E1 ∼\n= P1 . The fan F for P is fig.(9). The cone C = R≥0 * (e1 + e2 ),\n′\nso the fan F = FC ⊂ F is the subset of cones lying in the first quadrant. The toric variety PV is A2\nwith (0, 0) blown up. It projects down onto V as a line bundle. SVη ⊂ PV (C) is then a circle bundle over\nV (C). V has two suborbits V2 = E1 ∩ E2 and V1 = E1 ∩ D1 , where D1 is the strict transform of the divisor\nA1 = 0 in P2 . We may interpret z := A1 /A2 as a coordinate on V , so V1 : z = 0 and V2 : z = ∞. We have\nP (V )1 = V − {z = ∞} and P (V )2 = V − {z = 0}. The real chain σVη,ε = {η ≤ z ≤ 1/ε}, and τVη,ε is the\nS 1 -bundle of radius η over σVη,ε . On the other hand, V2 corresponds to the cone labeled C2 in fig.(9), and\nthe fan FC2 is just C2 itself. The toric variety PV2 ∼\n= A2 is a rank 2 vector bundle over the point V2 . We\n∼\nhave PV2 ⊂ PV . In this case σVη,ε\nis\nsimply\nthe\npoint\nV2 , and τVη,ε\n= S 1 × S 1 ⊂ PV1 (C). In local coordinates\n2\n2\naround V1 given by eigenfunctions for the torus action we have\n(4.3)\n\nτVη,ε,θ = {(ηeiμ , z) | η ≤ z ≤ 1/ε, 0 ≤ μ ≤ θ}\nτVη,ε,θ\n= {(ηeiμ , ηeiν ) | 0 ≤ μ, ν ≤ θ}\n1\n= {(ηeiμ , η) | 0 ≤ μ ≤ θ}.\nτVη,ε,θ ∩ τVη,ε,θ\n1\n\nWe want now to establish a basic formula for the boundary of the chains τVη,ε,θ . Here V runs through the\nclosures of orbits in P (Γ) associated to flags of core subgraphs (3.17). We include the big orbit V = P (Γ).\nWe write |V | := codim(V /P (Γ)). We may express the boundary chains ∂τVη,ε,θ locally (in fact Zariski-locally)\nin coordinates which are eigenfunctions for the torus action. It is clear (cf. (4.3)) that boundary terms are\nobtained by setting a suitable one of these coordinates to be constant: either ηeiθ or η or ε. (The presence\nof 1/ε in the first line of (4.3) simply means that the appropriate coordinate near that point is 1/z.)\nProposition 4.3. For a suitable orientation, the boundary\nX\n(4.4)\n∂\n(−1)|V | τVη,ε,θ\nV\n\n20\n\n\fΞ\n\nΤΗ,Ε,Θ\nV\n\nΗ,Ε,Θ\n\nΗ\nΗ,Ε,Θ\nΤ\nPHGL\nV\n\nΕ\n\nFigure 10. The monodromy chain, with angular variable θ.\nwill contain no chains with one coordinate constant = η.\nProof. (Cf. fig.(10) ). For a given boundary term, we can choose local eigenfunction coordinates x1 , . . . , xn−1\nsuch that be boundary term is given by x1 = η. We take the chains to be oriented in some consistant way\nby this ordering of coordinates. (Note that these coordinates are defined on a Zariski open set. The\nobstruction to choosing consistent orientations for various open sets is a class in the first Zariski cohomology\nof P (Γ) with constant Z/2Z-coefficients. Since this cohomology group vanishes, we can choose such consistent\norientations.) If ∂τVη,ε,θ contains a term with x1 = η, there are two possibilities. Either x1 is a real coordinate\non τVη,ε,θ or it is a circular coordinate. If x1 is a real coordinate, then the fact that x1 = η appears in the\nboundary means that locally x1 = 0 defines a codimension 1 orbit closure V1 ֒→ V . In ∂τVη,ε,θ\n, x1 will\n1\nappear as a circular coordinate. Since |V | = |V1 | + 1, the same chain x1 = η will appear in ∂τVη,ε,θ and in\nand will cancel in (4.4). If, on the other hand, x1 = ηeiθ is a circular coordinate, then for suitable\n∂τVη,ε,θ\n1\nordering of coordinates, the chain will be an (S 1 )p -bundle over a chain σ contained in the locus where certain\ncoordinates ≥ 0. But then (4.4) will contain another chain which is an (S 1 )p−1 -bundle over {x1 ≥ η} × σ,\nand the boundary components involving x1 = η will occur with opposite signs and will cancel.\n\u0003\nThe boundary chain (4.4) is an (n − 2)-chain involving two scales 0 < ε < η. We want to construct an\n(n − 1)-chain\nξ η,ε,θ which amounts to a scaling η → ε. To do this, we construct a vector field v on P (Γ). Let\nP\nE=\nEi be the exceptional divisor. v will be 0 outside a neighborhood N of E. Locally, at a point on N\nwhich is close to divisors E1 , . . . , Ep we have coordinates x1 , . . . , xp which are eigenfunctions for the torus\naction such that locally Ei : xi = 0. Locally we will take v to be radial and inward-pointing in each xi . We\nglue these local v's using a partition of unity. \"Flowing\" the (n − 2)-chain (4.4) along this vector field yields\nan (n − 1)-chain ξ η,ε,θ . If this is done with care, we can arrange\nX\nX\n(4.5)\n∂ξ η,ε,θ ≡ ∂\n(−1)|V | τVη,ε,θ − ∂\n(−1)|V | τVε,ε,θ .\nV\n\nV\n\nHere ≡ means that the two sides differ by a chain lying in an ε-neighborhood of the strict transform D of\nthe coordinate divisor ∆ in P (Γ). Another important property of the chain ξ η,ε,θ is\nLemma 4.4. ξ η,ε,2π ≡ ξ η,ε,0 .\nProof. The point is that ∂τVη,ε,2π ≡ 0 except for the case V = P (Γ), and τPη,ε,θ\n(Γ) is independent of θ. (See\nfig.(10)).\n\u0003\nP\nDefine the chain cη,ε,θ = V (−1)|V | τVη,ε,θ − ξ η,ε,θ . We have\nX\n(4.6)\n∂cη,ε,θ = ∂\n(−1)|V | τVε,ε,θ .\nV\n\nNote that cη,ε,0 = σPη,ε(Γ) , i.e. all chains involving at least one circular variable die at θ = 0. We define the\nvariation,\nX\n(−1)|V | τVε,ε .\n(4.7)\nvar(cη,ε,θ ) = cη,ε,2π − cη,ε,0 ≡\nV (P (Γ)\n\n21\n\n\fIt is a sum of \"(S 1 )p -tubes\" over all E1 ∩ * * * ∩ Ep ( P (Γ).\n5. The Graph Hypersurface\nAssociated to a graph Γ with n edges, one has the graph polynomial\nXY\n(5.1)\nψΓ (A1 , . . . , An ) =\nAe\nT\n\ne6∈T\n\nwhere T runs through spanning trees of Γ. This polynomial has degree h1 (Γ). For more detail, see [2] and\nthe references cited there. Let X = XΓ : ψΓ = 0 beSthe graph hypersurface in Pn−1 . For μ ⊂ Edge(Γ), let\nLμ ⊂ P(Γ) be defined by Ae = 0, e ∈ μ. Let Γμ = e∈μ e ⊂ Γ be the subgraph with edges in μ. Note the\ndictionary Γμ ↔ Lμ is inclusion reversing.\n\nLemma 5.1. (i) Lμ ⊂ XΓ ⊂ P(Γ) if and only if h1 (Γμ ) > 0.\n(ii) If h1 (Γμ ) > 0, there exists a unique ν ⊆ μ such that h1 (Γν ) = h1 (Γμ ) and such that moreover Γν is a\ncore graph.\nS\n(iii) We have in (ii) that ν = ξ where ξ runs through all minimal subsets of μ such that Lξ ⊂ X.\n(iv) Lμ = Lν ∩ M , where M is a coordinate linear space not contained in XΓ .\nProof. These assertions are straightforward from the results in [2], section 3. Note that (iv) justifies our\nstrategy of only blowing up core subgraphs.\n\u0003\nWe have seen (remark 3.4) that our blowup P (Γ) is stratified as a union of tori indexed by pairs\n(5.2)\n\n(F, {Γp ( * * * ( Γ1 ( Γ//γ})\n\nwhere F ⊂ Γ is a suitable subforest and the Γi are core.\nProposition 5.2. (i) As in proposition 3.4, the torus corresponding to (5.2) is\nT (Γp //Fp ) × T ((Γp−1 //Γp )//Fp−1 ) × * * * × T ((Γ//Γ1 )//F ).\nQ\nHere T (Γ) := P(Γ) − ∆, where ∆ : e∈Edge(Γ) Ae = 0.\n(ii) The strict transform Y of XΓ in P (Γ) meets the stratum (5.3) in a union of pullbacks\n(5.3)\n\n(5.4)\n\n0\n).\npr1−1 (XΓ0p ) ∪ pr2−1 (XΓ0p−1 //Γp ) ∪ * * * ∪ prp−1 (X(Γ//γ)//Γ\n1\n\nHere the pri are the projections to the various subtori in (5.3), and X 0 denotes the restriction of the corresponding graph hypersurface to the open torus in the projective space.\nProof. Let Γ′ ⊂ Γ be a subgraph and let L : Ae = 0, e ∈ Edge(Γ′ ). Assume h1 (Γ′ ) > 0, so L ⊂ XΓ . Let\nPL → P(Γ) be the blowup of L. Let EL ⊂ PL be the exceptional divisor, and let YL ⊂ PL be the strict\ntransform of XΓ . The basic geometric result (op. cit. prop. 3.5) is that EL = P(Γ′ ) × P(Γ//Γ′ ) and\n\u0011\n\u0011 \u0010\n\u0010\n(5.5)\nYL ∩ EL = XΓ′ × P(Γ//Γ′ ) ∪ P(Γ′ ) × XΓ//Γ′ .\nThe assertions of the proposition follow by an induction argument.\n\nCorollary 5.3. The strict transform Y of XΓ in P (Γ) does not meet the non-negative points P (Γ)(R\n(4.1).\n\n\u0003\n\n≥0\n\n)\n\nProof. It suffices by (4.1) to show that Y doesn't meet the positive points in any stratum. By proposition\n5.2, it suffices to show that for any graph Γ, the graph hypersurface XΓ has no R-points with coordinates\nall > 0. This is immediate because ψΓ is a sum of monomials with non-negative coefficients.\n\u0003\nRemark 5.4. The Feynman amplitude is obtained by calculating an integral over σ = P(Γ)(R≥0 ) with\nan integrand which has a pole along XΓ . Again using that ψΓ is a sum of monomials with non-negative\ncoefficients, one sees from lemma 5.1 that\n[\n(5.6)\nσ ∩ XΓ =\nLμ (R≥0 )\nμ\n\nwhere Lμ ↔ Γμ with Γμ ⊂ Γ a core subgraph. The iterated blowup P (Γ) → P(Γ) is exactly what is necessary\nto separate the non-negative real points from the strict transform of XΓ .\n22\n\n\fp1\np1 + tq1\n\nX\n\nDt\np2\n\np3\n\np2 + tq2\np3 + tq3\n\nFigure 11. Moving ∆t .\nRemark 5.5. The points where ψΓ 6= 0 have some remarkable properties. It is shown in [20] that for any\nangular sector S with angle < π, ψΓ (a1 , . . . , an ) 6= 0 at any complex projective point a such that the ai 6= 0\nand all the arg(ai ) lie in S.\n6. Monodromy\nLet pi = (0, . . . , 1, 0, . . . , 0) ∈ Cn be the i-th coordinate vector. Define\nn\nX\nX\nτi pi | τi ≥ 0,\nτi = 1} ⊂ Cn − {(0, . . . , 0)} → Pn−1 .\nσ af f = {\ni=1\n\nFix a positive constant ε << 1 and choose qk = (qk1 , . . . , qkn ) ∈ Rn , 1 ≤ k ≤ n with 1 − ε < qkj ≤ 1 and\n|qjk − ql,m | ≤ ε2 . We assume the qk are algebraically generic. Write rk (t) = pk + tqk ∈ Cn . Define (cf.\nfig.(11))\nn\nX\nX\nτk rk (t) | τk ≥ 0,\nτk = 1}\n(6.1)\nσtaf f = {\ni=1\n\nWe write σ and\net for the images of these chains in Pn−1 . Of course, σ = σPn−1 as above, and we know\nSσ\nthat σ ∩ XΓ = L⊂L σL . Here L is as in (3.4).\n\nLemma 6.1. Let L ⊂ NL be a neighborhood of L in Pn−1 and let σ ⊂ Nσ be a neighborhood of σ. Then\nthere exists ε0 > 0 such that ε ≤ ε0 implies that for all 0 ≤ θ ≤ 2π, we have σ\neεeiθ ⊂ Nσ and σ\neεeiθ ∩XΓ ⊂ NL .\nProof. We have σ ∩ XΓ ⊂ L. By compacity, σ\neεeiθ ⊂ Nσ for ε << 1. Again by compacity, if we shrink Nσ we\nwill have Nσ ∩ XΓ ⊂ NL .\n\u0003\nRemark 6.2. Write Hk,t for the projective span of the points\nSn\n\nr1 (t), . . . , r[\nk (t), . . . , rn (t),\n\nand let ∆t = k=1 Hk,t . Thus, ∆ = ∆0 and we may consider the monodromy for ∆εeiθ , 0 ≤ θ ≤ 2π. More\nprecisely, renormalization in physics involves an integral over the chain σ. The integrand has poles along\nXΓ . Since σ ∩ XΓ 6= ∅, the integral is possibly divergent. On the other hand, by corollary 5.3, the chain σε\ndoes not meet XΓ and so represents a singular homology class\n(6.2)\n\n[σε ] ∈ Hn−1 (Pn−1 − XΓ , ∆ε − ∆ε ∩ XΓ , Z).\n23\n\n\fE\nDk\nΕ\nΗ\n\nEIR30 M\n\nΤ,Η,Ε\nE\n\nΕ\nDj\n\nFigure 12. The chain τEη,ε .\n(Since all qkj > 0, it follows that σε ⊂ σ, and points in σε have all coordinates > 0.) We consider the\ntopological pairs (Pn−1 − XΓ , ∆εeiθ − ∆εeiθ ∩ XΓ ) as a family over the circle and we continuously deform our\nchain σε to a family of chains σεeiθ on Pn−1 − XΓ with boundary on ∆εeiθ − ∆εeiθ ∩ XΓ . (We will not be able\nto take σεeiθ = σ\neεeiθ because this chain can meet XΓ .) The monodromy map m is an automorphism of (6.2)\nobtained by winding around the circle: m(σε ) = σεe2πi . We will calculate m(σε ) and see that it determines\nin a natural way the renormalization expansion we want.\n−1\nRecall\nS we have π : P (Γ) → P(Γ), and π (XΓ ) = YΓ ∪ E, where Y = YΓ is the strict transform of XΓ and\nE = Ei is the exceptional divisor. (The Ei are closures of orbits associated to core subgraphs of Γ.) We\nmay transfer our monodromy problem to P (Γ). ∆εeiθ is in general position with respect to the blowups, so\nwe obtain a family of divisors ∆′εeiθ = π ∗ ∆εeiθ on P (Γ). Since π : P (Γ) − E − YΓ ∼\n= P(Γ) − XΓ , we have an\nisomorphism of topological pairs\n\u0011\n\u0010\n\u0011 \u0010\n(6.3)\nP (Γ) − E − YΓ , ∆′εeiθ − ∆′εeiθ ∩ (E ∪ YΓ ) ∼\n= P(Γ) − XΓ , ∆εeiθ − ∆εeiθ ∩ XΓ .\n\nIn section 4 we have defined chains τVη,ε,θ , ξ η,ε,θ , cη,ε,θ on P (Γ). These chains sit on (or, in the case of ξ,\nwithin) various (S 1 )p -bundles over P (Γ)(R≥0 ) where the S 1 have radius η with respect to a chosen metric.\nFrom corollary 5.3 it follows that for 0 < η << 1, none of these chains meets YΓ . By construction, these\nchains do not meet E, so they may be identified with chains on P(Γ)−XΓ . We claim that a small modification\nof the chains cη,ε,θ will represent the monodromy chains σεeiθ . The monodromy chains σεeiθ should have\nboundary on ∆εeiθ . On the other hand, the chains cη,ε,θ were cut off so they had boundaries on tubes a\ndistance ε from the toric divisors Dj given by the strict transforms of the Aj = 0 (see fig.(12)). We must\n\"massage\" these brutal cutoffs to get them into ∆εeiθ . Our chains τ sit on tubes or products of tubes or\nproducts of tubes of radius η which we can think of as lying on Pn−1 − L. Since ε << η, when we deform\n∆ → ∆εeiθ the homotopy type of the circles, or product of circles where these divisors intersect the tubes\ndoesn't change. This may seem strange because L ⊂ ∆ while ∆εeiθ is in general position with respect to\nL, but the intersections with a hollow tubular neighborhood of L are canonically homotopic. Indeed, we\nmay take ∆εeiθ to correspond to a point in a small contractible disk in the moduli space for coordinate\nsimplices around the point corresponding to ∆. The canonical path up to homotopy between the two points\nin moduli will induce the desired homotopy on the intersections. (See fig.(13). The two sets of four dots on\nthe circles are canonically homotopic.). In more detail, by corollary 5.3, the chains τ η,ε,θ are bounded away\nfrom XΓ by a bound which is independent of ε as ε → 0. Outside of some tubular neighborhood N of XΓ\nwe may find a space M disjoint from XΓ such that M contains open neighborhoods of both ∆ − N ∩ ∆ and\n∆εeiθ −N ∩∆εeiθ and such that we have deformation retractions M → ∆−N ∩∆ and M → ∆εeiθ −N ∩∆εeiθ .\n24\n\n\fL\n\nL\n\nfig.8\nDΕeiΘ\n\nD\n\nFigure 13. Homotopy invariance of ∆t ∩ tube over L.\nShrinking ε, we may assume our ε-cutoffs lie in M . We may then use the deformation retract to extend\nthe chain slightly to a chain τ̃Vη,ε,θ which bounds on ∆εeiθ . It remains to consider the chains ξ η,ε,θ . Recall\nP\nthese were obtained by flowing the chain ∂ V (−1)|V | τVη,ε,θ inward toward the exceptional divisor E, so\nη → ε (cf. fig.(10)). We are in a small neighborhood of E(R≥0 ) hence by corollary 5.3 we are away from\nP\nXΓ . The point to be checked is that the term ∂ V (−1)|V | τVε,ε,θ is very close to ∆εeiθ so by the same\ndeformation retraction argument as above we can extend the chain to bound on ∆εeiθ . The subtlety is that\nwe are ε-close to E as well, so we need the distance from ∆εeiθ to be o(ε). Recall (6.1) we have the vertices\nrk (εeiθ ) = [qk1 εeiθ , . . . , 1 + qkk εeiθ , . . . , qkn εeiθ ] ∈ Pn−1 . The coordinate divisor ∆εeiθ is determined by these\niθ\nprojective points. The projective point does not change if we scale\nPthe coordinates by e , so the image in\nn−1\nP\nof the affine simplex below, parametrized by τ1 , . . . , τn ≥ 0,\nτj = 1, will have boundary in ∆εeiθ :\n(6.4) eiθ τ1 (1 + εeiθ q11 , . . . , εeiθ q1n ) + * * *\n\n+ eiθ τp (εeiθ qp1 , . . . , 1 + εeiθ qpp , . . . , εeiθ qpn )\n+ τp+1 (εeiθ qp+1,1 , . . . , 1 + εeiθ qp+1,p+1 , . . . , εeiθ qp+1,n ) + * * *\n+ τn (εeiθ qn1 , . . . , εeiθ qnn + 1).\nConsider for example ∂τVε,ε,θ where V is the orbit closure corresponding to the blowup of A1 = * * * = Ap = 0.\nTake in (6.4) τ1 , . . . , τp ≤ ε so terms in τj ε may be neglected for j ≤ p. Take uj := τj /τk where k > p is\nchosen so that (say) τk ≥ 1/n. As a consequence, u1 , . . . , up ≤ nε. The corresponding projective point can\nthen be written\nh\n(6.5) eiθ (u1 + ε) + O(ε2 ), . . . , eiθ (up + ε) + O(ε2 ),\ni\nup+1 + eiθ ε + O(ε2 ), . . . , un + eiθ ε + O(ε2 ) .\n\nThe boundary is given by setting one or more of the uj = 0. Points in ∂τVε,ε,θ can be approximated by points\n(6.5) which then deform into ∆εeiθ . To see this, note that since V is a codimension 1 orbit closure, there\nwill locally be one coordinate on P (Γ) near V which takes the constant value εeiθ on ∂τVε,ε,θ (cf. fig.(10)).\nOn the other hand, (6.5) is in homogeneous coordinates on P(Γ). To transform to P (Γ) near a general point\nof V , one fixes l ≤ p and looks at ratios\n(6.6)\n\neiθ (uj + ε) + O(ε2 )\neiθ (ul + ε) + O(ε2 )\n\nfor 1 ≤ j 6= l ≤ p. Clearly, at the boundary ul = 0 we will get p − 1 coordinates uj /ε + O(ε) which are close\nto R≥0 , and one coordinate (corresponding to the local defining equation for V ) of the form εeiθ + O(ε2 ).\nThe remaining coordinates on V are ratios of the uj + εeiθ + O(ε2 ), j ≥ p + 1. Since uk = 1, these ratios\nare again close to R≥0 . The calculation for orbit closures V of codimension ≥ 2 in P (Γ) is similar and is left\nfor the reader. We have proven\n25\n\n\fProposition 6.3. With notation as above, the monodromy of the chain σε ∈ Hn−1 (Pn−1 −XΓ , ∆ε −XΓ ∩∆ε )\nis represented by the chains c̃η,ε,θ given by modifying the chains cη,ε,θ to have boundary in ∆εeiθ . In particular,\nthe monodromy m(σε ) = c̃η,ε,2π is given by\nX\n(6.7)\nm(σε ) =\n(−1)|V | τ̃Vε,ε\nV\n\nwhere τ̃Vε,ε is the chain τVε,ε defined in section 4 with boundary extended to ∆ε as above.\nIt will be convenient to simplify the notation and write\nτVε := τ̃Vε,ε .\n\n(6.8)\n\n7. Parametric representations\nIn this section we list well-known representations of the Feynman rules and then prepare for a subsequent\nanalysis of short-distance singularities in terms of mixed Hodge structures.\n7.1. Kirchhoff–Symanzik polynomials. Let\nXY\nψ(Γ) =\n(7.1)\nAe ,\nT\n\n(7.2)\n\nφ(Γ)\n\n=\n\ne6∈T\n\nX\n\nQ(T1 ) * Q(T2 )\n\nT1 ∪T2 =T\n\nY\n\nAe ,\n\ne6∈T1 ∪T2\n\nbe the two homogenous Kirchhoff–Symanzik polynomials [10, 22]. Here, T is a spanning tree of the 1PI\ngraph Γ and T1 , T2 are disjoint trees which together cover all vertices of Γ. Also, Q(Ti ) is the sum of all\nexternal momenta attached to vertices covered by Ti . Note that φ(Γ) can be written as\nX\nRqi *qj .\n(7.3)\nkinetic invariants (qi * qj )\n\nHere, qi are external momenta attached to T1 and qj to T2 , and Rqi *qj are rational functions of the edge\nvariables only, and the sum is over independent such kinematical invariants where momentum conservation\nhas been taken into account. We extend the definition to the empty graph I by ψ(I) = 1, φ(I) = 0.\nLet | * |γ denote the degree of a polynomial with regard to variables of the graph γ.\nLemma 7.1. i) deg φ = deg ψ + 1.\nii)\n(7.4)\n\nψ(Γ) = ψ(Γ//γ)ψ(γ) + ψΓ,γ\n\nwith |ψΓ,γ |γ > |ψ(γ)|γ for all core graphs Γ and subgraphs γ.\niii)\n(7.5)\n\nφ(Γ) = φ(Γ//γ)ψ(γ) + φΓ,γ\n\nwith |φΓ,γ |γ > |ψ(γ)|γ for all core graphs Γ and subgraphs γ.\nProof: i) by definition, ii) has been proved in [2], iii) follows similarly by noting that the two-trees of φ are\nobtained from the spanning trees of ψ by removing an edge. If that edge belongs to Γ//γ, we get φ(Γ//γ)ψ(γ).\nIf it belongs to γ, we get a monomial m with |m|γ > |ψ(γ)|γ .\n\u0003\nNote that it might happen that φ(Γ//γ) = 0, if the external momenta flows through subgraphs γ only. In\nsuch a case (which can lead to infrared divergences) one easily shows φΓ,γ = ψ(Γ//γ)φ(γ).\n26\n\n\f7.2. Feynman rules. ¿From these polynomials one constructs the Feynman rules of a given theory. For\nexample we have in φ4 theory for a vertex graph Γ, sdd(Γ) = 0,\nP\nφ(Γ)\n2\nZ\ne− edges e Ae me − ψ(Γ)\n(7.6)\nΦ(Γ) =\ndA1 * * * dA|Γ[1] | .\nψ 2 (Γ)\nRk\n>ǫ\nR\nWe will write >ǫ dAΓ to abbreviate the affine chain of integration.\nThe integral is over the k-dimensional hypercube of positive real coordinates in R>ǫ with a small strip of\nwidth 1 ≫ ǫ > 0 removed at each axis. We regard the integrand\nC ∋ ι(Γ) :=\n\n(7.7)\n\ne−\n\nP\n\ne\n\nφ(Γ)\nAe m2e − ψ(Γ)\n\n,\n\nψ 2 (Γ)\n\n\u0001\nι(Γ) = ι Γ)({m2 }, {qi * qj }, {A} as a function of the set of internal masses {m2 }, the set of external momenta\n{qi * qj } (which can be considered as labels on external half-edges) and the set of graph coordinates {A},\nand ι takes values in C. We often omit the A dependence and abbreviate P = {m}, {qi * qj } for all these\nexternal parameters of the integrand: ι = ι(P ). The renormalization schemes we consider are determined\nby the condition that the Green function shall vanish at a particular renormalization point R, so that\nrenormalization becomes an iterated sequence of subtractions\nι− (P, R) := ι(P ) − ι(R).\n\n(7.8)\n\nWe let sdd(Γ) be the superficial degree of divergence of a graph Γ given as (see also Eq.(2.2) for a refined\nversion)\nX\nX\n(7.9)\nsdd(Γ) := D|Γ| −\nwe −\nwv ,\nedges e\n\nvertices v\n\nwhere |Γ| is the rank of the first Betti homology, D the dimension of spacetime which we keep as an integer,\nwe the weights of the propagator for edge e as prescribed by free field theory and wv the weight\nof theR vertex\nR\nas prescribed by the interaction Lagrangian. Note that we can set the width ǫ to zero, >ǫ dAΓ → >0 dAΓ\nif the integrand ι− (Γ) is evaluated on a graph Γ which has no divergent subgraphs.\nThroughout, we assume that all all masses and external momenta are in general position so that there are\nno zeroes in the φ-polynomial off the origin for positive values of the A variables. In particular, we assume\nthat the point P is chosen appropriately away from all mass-shell and kinematical singularities. We remind\nthe reader of the notation (Γ, σ) (section (2.5)) where σ stores all the necessary detail on how to evaluate\nthe graph Γ.\nA special role is played by the evaluations (Γ, σP =0 ). They set all internal masses and momenta to zero.\nNote that this leads immediately to infrared divergences: the Feynman integrands ι(*)(P = 0) are missing\nthe exponential in the numerator, which provides a regulator at large values of the A variables, and hence an\ninfrared regulator. The ultraviolet singularities at small values of the A variables are taken into account by\nthe renormalization procedure itself, and hence by our limiting mixed Hodge structure. We will eliminate the\ncase P = 0 below using that ι− evaluates to zero if there is no dependence on masses or external momenta.\n7.3. General remarks on renormalization and QFT. We now consider the renormalization Hopf algebra HR of 1PI Feynman graphs in section (2.4). We use the notation\nX\n(7.10)\n∆(Γ) =\nγ ⊗ Γ//γ,\nγ\n\nfor its coproduct. Also, ∆(I) = I ⊗ I. Projection P into the augmentation ideal on the rhs is written as\nX\nγ ⊗ Γ//γ,\n(7.11)\n(id ⊗ P )∆(Γ) =\n∅6=Γ//γ\n\nso that for example the antipode S is\n(7.12)\n\nS(Γ) = −\n\nX\n\nS(γ)Γ//γ =: −Γ̄.\n\n∅6=Γ//γ\n27\n\n\fFurthermore, we introduce a forest notation for the antipode:\n(7.13)\n\nS(Γ) =\n\nX\n\n|[for]|\n\n(−1)|[for]| Γ//[for]\n\nY\n\nγ[for],j ,\n\nj=1\n\n[for]\n\nwhere the sum is over all forests [for] and the product is over all subgraphs which make up the forest. Here,\na forest [for] is a possibly empty collection of proper superficially divergent 1PI subgraphs γ[for],j of Γ which\nare mutually disjoint or nested. We call a forest [for] maximal if Γ//[for] is a primitive element of the Hopf\nalgebra. As edge sets\nΓ = (Γ//[for]) ∪ (∪j γj ) .\n\n(7.14)\n\nThis is in one-to-one correspondence with the representation of the antipode as a sum over all cuts on rooted\ntrees ρT (Γ) as detailed in section (2.3) above. The integer |[for]| is the number of edges removed in this\nrepresentation.\nLet us first assume that the graph Γ and all its core subgraphs have a non-positive superficial degree of\ndivergence, so they are convergent or provide log-pole: sdd ≤ 0 for all elements in (the complement of) the\nforests.\nAs the integrand ι(Γ)(P ) depends on P = {m}, {qi * qj } only through the argument of the exponential,\nwe redefine the second Kirchhoff–Symanzik polynomial as follows:\nX\n(7.15)\nφ(Γ)({qi * qj }) → φ(Γ)(P ) := φ(Γ)({qi * qj }) + ψ(Γ)\nAe m2e .\ne\n\nThen, the unrenormalized integrand is\n\nφ(Γ)(P )\n\n(7.16)\n\nexp− ψ(Γ)\nι(Γ)(P ) =\n.\nψ 2 (Γ)\n\nWith this notation, the renormalized integrand is (in all sums and products over j here and in the following,\nj runs from 1 to |[for]|)\n\u0010\nP φ(γj )(R) \u0011\n)\n+\nexp − φ(Γ//[for])(P\nX\nj ψ(γj )\nψ(Γ//[for])\nQ\n(−1)[for]\nιR (Γ)(P, R) =\nψ 2 (γ//[for]) j ψ 2 (γj )\n[for]\n\u0010\nP φ(γj )(R) \u0011\nexp − φ(Γ//[for])(R)\n+ j ψ(γ\nX\nψ(Γ//[for])\nj)\nQ 2\n(−1)[for]\n−\n(7.17)\n2\nψ (γ//[for]) j ψ (γj )\n[for]\n\n=: ῑ(Γ)(P, R) + S ι (Γ)(R),\n\nwhere +S ι (Γ)(R) = −ῑ(Γ)(R, R) is the integrand for the counterterm, and ῑ(Γ)(P, R), the integrand in\nthe first line, delivers upon integrating Bogoliubov's R̄ operation. Note that this formula (7.17) is just the\nevaluation\n(7.18)\n\nι\nm(SR\n⊗ ι)∆(Γ),\n\nwhich guarantees that the corresponding Feynman integral exists in the limit ǫ → 0 [13],[15].\nThis Feynman integral is obtained by integrating from ǫ to ∞ each edge variable. For the renormalized\nFeynman integral ΦR (Γ)(P ) we can take the limit ǫ → 0, while for the R̄-operation\nZ\n(7.19)\nΦ̄(Γ)(P, R; ǫ) = ῑ(Γ)(P, R),\nǫ\n\nand the counterterm\n(7.20)\n\nΦ\nSR;ǫ\n(Γ) = −Φ̄(Γ)(R, R; ǫ),\n\nthe lower boundary remains as a dimension-full parameter in the integral. Note that the result (7.17) above\ncan also be written in the P − R form, typical for renormalization schemes which subtract by constraints on\n28\n\n\fphysical parameters:\n(7.21)\n\nιR (Γ)(P, R) =\n\nX\n\nι\n[ι(Γ//γ)(P ) − ι(Γ//γ)(R)] SR;ǫ\n(γ),\n\n∅6=Γ//γ\n\nand as\n(7.22)\n\nῑ(Γ)(P, R) =\n\nX\n\nι\nSR;ǫ\n(γ)ι(Γ//γ)(P ) ⇒ ιR (Γ)(P, R) =\n\nX\n\nι\nSR;ǫ\n(γ)ι(Γ//γ)(P ),\n\nγ\n\n∅6=Γ//γ\n\nusing the notation (7.11,7.10). Similarly, for Feynman integrals,\nX\nX\nΦ\nΦ\nSR;ǫ\n(γ)Φ(Γ//γ)(P ), ΦR (Γ)(P ) = lim\nSR;ǫ\n(γ)Φ(Γ//γ)(P ).\n(7.23)\nΦ̄(Γ)(P, R; ǫ) =\nǫ→0\n\n∅6=Γ//γ\n\nγ\n\nWhen it comes to actually calculating the integral (7.6) (or, in its renormalized form (7.17)), something\nrather remarkable happens. By lemma 7.1(i), the term in the exponential in these integrals is homogeneous\nof degree 1 in the edge variables Ai . The assumption sdd(Γ) = 0 means dA/ψ 2 is homogeneous of degree 0.\nMaking the change of variable Ai = tai , we find\nX\ndj ∧ * * * )/ψ(a)2 = dt/t ∧ Ω/ψ 2 .\n(7.24)\ndA/ψ(A)2 = dt/t ∧ ( (−1)j−1 aj da1 ∧ * * * ∧ da\n\nNote that Ω/ψ 2 is naturally a meromorphic form on the projective space P(Γ) with homogeneous coordinates\nthe ai . Writing σ = {ai ≥ 0} ⊂ P(Γ)(R), we see that the renormalized integral can be rewritten up to a\nterm which is O(ε) as a sum of terms of the form\nZ\nZ\nZ ∞\u0010\n\u0011\n\u0010\n\u0011\nΩ/ψj2 E1 (εfj (a)) − E1 (εgj (a)) ,\ne(−tfj (a)) − e(−tgj (a)) dt/t =\n(7.25)\nΩ/ψj2\nσ\n\nσ\n\nε\n\nwhere\n(7.26)\n\nE1 (z) :=\n\nZ\n\n∞\n\ne−tz\n\n1\n\ndt\n= −γE − ln z + O(z);\nt\n\nz→0\n\nP\nis the exponential integral. (Here fj (a), gj (a) are defined by taking the locus ai ≥ 0, ai = 1.) As long as\nfj (a), gj (a) > 0, we may allow ε → 0 for fixed a. The Euler constant and log ε terms cancel. When the dust\nsettles, we are left with the projective representation for the renormalized Feynman integral\n\u0010 φ(Γ//[for])(P ) Q ψ(γ )+P φ(γ )(R)ψ(Γ//[for]) Q ψ(γ ) \u0011\nj\nj\nh\nZ\nQh6=j\nPj\nQj\nln\nX\nφ(Γ//[for])(R) j ψ(γj )+ j φ(γj )(R)ψ(Γ//[for]) h6=j ψ(γh )\n[for]\nQ\n(−1)\nΩΓ\n(7.27)\nΦR (Γ)(P ) =\n.\nψ 2 (Γ//[for]) j ψ 2 (γj )\nσ\n[for]\n\nNote that the use of σ is justified as long as the integrand has all subdivergences subtracted, so is in the ῑ\nform, so that lower boundaries in the ai variables can be set to zero indeed.\nBy (7.21), this can be equivalently written as\nZ\nX\nΦ\n(7.28)\nΦR (Γ)(P ) = lim\ndAΓ//γ ι− (Γ//γ)(P, R),\nSR;ǫ\n(γ)\nǫ→0\n\n>ǫ\n\nγ\n\nin any renormalization scheme which is described by kinematical subtractions P → R.\nR\nR\nRemark 7.2. It will be our goal to replace the affine dA by the projective dΩ in the above. The presence\nof lower boundaries, which can not be ignored as the integrand has divergent subgraphs, allows this only upon\nintroducing suitable chains τγǫ as discussed in previous sections.\nNext, we relax the case of log-divergence.\n29\n\n\f7.4. Reduction of graphs with ssd(Γ) > 0. We start with an example. To keep things simple but not too\nsimple, we consider the one-loop self-energy graph in φ36 theory, a scalar field theory with a cubic interaction\nin six dimensions of space-time. We have\n(7.29)\n\nZ\n\nZ\n\nφ(Γ)\n\ne− ψ(Γ)\ndAΓ\ndAΓ ι(Γ)(P ) =\nΦ(Γ)(P ) =\n≡\nψ(Γ)3\n>ǫ\n>ǫ\n\nZ\n\n∞\n\ndA1 dA2\n\ne\n\n−\n\nm2 (A1 +A2 )2 +q2 A1 A2\n(A1 +A2 )\n\n(A1 + A2 )3\n\nǫ\n\n.\n\nWe will renormalize by suitable subtractions at chosen values of masses and momenta in the φ-polynomial.\nWe hence (with subdivergences taken care of by suitable bar-operations ι → ῑ in the general case) replace\nι(Γ)(P ) by ι(Γ)(P ) − ι(Γ)(0), as this leaves ι− (Γ)(P, R) invariant.\nThen the above can be written, with this subtraction, and by the familiar change of variables Ai = tai ,\nand by one partial integration in t,\nZ\n\nZ\n\n−t\n\n∞\n\ndt [m2 (a1 + a2 )2 + q 2 a1 a2 ]e\ndΩ\nt\n(a1 + a2 )4\nσ\nǫ\nZ\n2\n2\n2\n[m (a1 + a2 ) + q a1 a2 ]\n− dΩ\n,\n(a1 + a2 )4\nσ\n\nΦ(Γ)(P ) =\n(7.30)\n\nm2 (a1 +a2 )2 +q2 a1 a2\n(a1 +a2 )\n\nwhere we expanded the boundary term up to terms constant in ǫ, Rwhich gave the term\nR ∞ in 2the\nR ∞second line. We\ndA\n3\ndiscarded already the pure pole term ∼ 1/ǫ from Φ(Γ)(P = 0) = >ǫ (A1 +A\n=\ndt/t\n3\nǫ\n0 db2 1/(1 + b2 ) .\n2)\nNote that graphs Γ with sdd > 0 have res(Γ) = 2. They hence depend on a single kinematical invariant\nq 2 say, φ(Γ) = φ(Γ)(q 2 ), for which we write φ(Γ)q2 .\nThe result in (7.30) leads us to define two top-degree forms. (Here Ω = a1 da2 − a2 da1 and we still write\nφ, ψ for the Kirchhoff–Symanzik polynomials regarded as dependent on either ai or Ai variables below).\n(7.31)\n\nω\u0003 = ω\u0003 (Γ) = Ω\n\na1 a2\nφ1 (Γ)\n=Ω\n,\nψ(Γ)4\n(a1 + a2 )4\n\nand\n(7.32)\n\nωm2 = ωm2 (Γ) = Ω\n\nso that\n(7.33)\n\nΦ(Γ)(P )\n\n(a1 + a2 )2\n1\n=Ω\n,\n4\nψ(Γ)\n(a1 + a2 )2\n\nZ\n[ω\u0003 + ωm2 ] − (q 2 − m2 ) ω\u0003\nσ\nZσ\nZ ∞\nφ(Γ)(P )\ndt\ne−t ψ(Γ)\n+m2 [ω\u0003 + ωm2 ]\nt\nσ\nǫ\nZ ∞\nZ\n)\ndt −t φ(Γ)(P\n2\n2\nψ(Γ) .\n+(q − m ) ω\u0003\ne\nt\nσ\nǫ\n−m2\n\n=\n\nZ\n\nThere are corresponding affine integrands\n(7.34)\n\nι\u0003 (Γ)\n\n=\n\n(7.35)\n\nιm2 (Γ)\n\n=\n\n)\nφ1 (Γ) − φ(Γ)(P\ne ψ(Γ) ,\n4\nψ(Γ)\n)\n(a1 + a2 )2 − φ(Γ)(P\ne ψ(Γ) .\n4\nψ(Γ)\n\nThe graph Γ is renormalized by a choice of a renormalization condition R\u0003 for the coefficient of q 2 − m2\n(wave function renormalization), and by the choice of a condition Rm2 for the mass renormalization. R is\noften still used to denote the pair of those.\n(7.36)\n\nΦ(Γ)(P ) + m2 δm2 + q 2 z\u0003 = ΦR\u0003 ,Rm2 (Γ)(P ).\n\nThe mass counterterm is then\n(7.37)\n\nm2 δm2 = −m2\n\nZ\n\nσ\n\n\u0012\nZ\n[ω\u0003 + ωm2 ] 1 −\n\nǫ\n\n30\n\n∞\n\n)\nm2\ndt −t φ(Γ)(R\nψ(Γ)\ne\nt\n\n\u0013\n\n,\n\n\fand the wave-function renormalization q 2 z\u0003 is\n\u0012\nZ\nZ\n2\n2\n(7.38)\nq z\u0003 = −q\nω\u0003 1 −\n\nǫ\n\nσ\n\n∞\n\n\u0003)\ndt −t φ(Γ)(R\nψ(Γ)\ne\nt\n\n\u0013\n\n.\n\nNote the term 1 in the () brackets does not involve exponentials.\nThe corresponding renormalized contribution is\nZ\nZ\nφ(P )\nφ(Γ)(P )\n+ m2 [ω\u0003 + ωm2 ] ln\n.\n(7.39)\nΦR (Γ)(P ) = (q 2 − m2 ) ω\u0003 ln\nφ(R\u0003 )\nφ(Γ)(Rm2 )\nσ\nσ\n\nThe transition from the unrenormalized contribution to the renormalized one is particularly simple upon\ndefining Feynman rules in accordance with external leg structures:\nφ(Γ)(P )\nZ\nφ1 (Γ)e− ψ(Γ)\n2\n2\ndA\nΦ((Γ, σ\u0003 )) = (q − m )\n(7.40)\n,\nψ(Γ)D/2+1\n>ǫ\nφ(Γ)(P )\nP\nZ\n[φ1 (Γ) + ψ(Γ) e Ae ]e− ψ(Γ)\nΦ((Γ, σm2 )) = m2\ndA\n(7.41)\n,\nψ(Γ)D/2+1\n>ǫ\n(7.42)\nso that renormalization proceeds as before on log-divergent integrands.\nThis example extends straightforwardly to the case of Γ having divergent subgraphs. Let us return to φ44\ntheory and define for a core graph Γ with sdd(Γ) = 2, (so that it is a self-energy graph and hence has only\ntwo external legs, and thus a single\ninvariant q 2 ), and graph-polynomials ψ(Γ), φ(Γ) = φq2 (Γ),\nP kinematical\n2\nφ(Γ) = φ(Γ)(P ) = φq2 (Γ) + ψ(Γ) e Ae me , the forms\n\n(7.43)\n\nω\u0003 (Γ) = ΩΓ\n\n(7.44)\n\nωm2 (Γ) = ΩΓ\n\nφ1 (Γ)\n,\nψ 3 (Γ)\n\nφ1 (Γ) + ψ(Γ)\nψ 3 (Γ)\n\nP\n\ne\n\nAe\n\n.\n\nThe corresponding complete affine integrands ι\u0003 , ιm2 are immediate replacing ai by Ai variables, and multiplying by exponentials exp −φ(Γ)(P )/ψ(Γ), with P → R for counterterms.\nOne finds by a straightforward computation\nZ\nX\nφ(Γ//γ)(P )\nΦ\n(7.45)\nΦR\u0003 ((Γ, σ\u0003 ))(P ) =\nSR;ǫ (γ) ω\u0003 (Γ//γ) ln\nφ(Γ//γ)(R\n\u0003)\nǫ\nγ\nZ\nX\nφ(Γ//[for])(P )\n(−1)[for] ω\u0003 (Γ//[for]) ln\n=\nΩΓ\n(7.46)\n,\nφ(Γ//[for])(R\u0003 )\n[for]\n\nand\n(7.47)\n\nΦRm2 ((Γ, σm2 ))(P )\n\n=\n\nX\n\nΦ\nSR;ǫ\n(γ)\n\nγ\n\n(7.48)\n\n=\n\nZ\n\nΩΓ\n\nX\n\nZ\n\nǫ\n\nωm2 (Γ//γ) ln\n\nφ(Γ//γ)(P )\nφ(Γ//γ)(Rm2 )\n\n(−1)[for] ωm2 (Γ//[for]) ln\n\n[for]\n\nφ(Γ//[for])(P )\n.\nφ(Γ//[for])(Rm2 )\n\nWe set\n(7.49)\n\nΦR (Γ)(P ) ≡ ΦR ((Γ, I))(P ) = φR\u0003 ((Γ, σ\u0003 ))(P ) + ΦRm2 ((Γ, σm2 ))(P ),\n\nin the external leg structure notation of section (2.5). We can combine the results for graphs Γ for all degrees\nof divergence sdd(Γ) ≥ 0 by defining ω(Γ) = Ω/ψ 2 (Γ) for a log divergent graph with the results above. And\nthat's that. Well, we have to hasten and say a word about the Feynman rules when the subgraphs γ have\nΦ\nsdd(γ) > 0, and hence also about SR;ǫ\n(γ) in that case.\nWe use, with P the projection into the augmentation ideal, the notation\n(7.50)\n\nΓ̄ = Γ + m(S ◦ P ⊗ P )∆ =: Γ + (Γ′ )−1 Γ′′ .\n31\n\n\fLet us consider the quotient Hopf algebra given by quadratically divergent graphs: ∆2 (Γ) =\nΓ//γ. We write\n\nP\n\nγ,sdd(γ)=2\n\nγ⊗\n\n∆2 (Γ) =: Γ ⊗ I + I ⊗ Γ + Γ′2 ⊗ Γ′′ .\n\n(7.51)\nWe add 0 = +Γ′2\n\n−1 ′′\n\nΓ − Γ′2\n\n−1 ′′\n\n(7.52)\n\nΓ , so\n\nΓ̄\n\n(7.53)\n\n−1\n\n−1\n\n−1\n\nΓ + Γ′2 Γ′′ − Γ′2 Γ′′ + Γ′ Γ′′\n\u0011\n\u0011 \u0010\n\u0010\n−1\n−1\n−1\nΓ′′ .\nΓ + Γ′2 Γ′′ + Γ′ − Γ′2\n\n=\n=\n\nHere the sum is over all terms of the coproduct with the Γ′2 terms being present whenever Γ′ is quadratically\ndivergent.\nEvaluating the terms Γ′2 by 1/ψ 2 (γ2′ ) = ι(γ2′ )(P = 0) decomposes the bar-operation on the level of\nintegrands as follows.\n\n(7.54)\n−1\n\nI\n\n}|\n\u0011{\n−1\n′ −1\n′′\nῑ(Γ)(P ) = ι(Γ)(P ) + ι(Γ2 )(P = 0)ι(Γ )(P ) +ι(Γ′ )(R)ι(Γ′′ )(P ),\nz\n\u0010\n\nι\nwhere ι(Γ′ )(R) ≡ SR;ǫ\n(Γ′ ) appears because a subtraction of a P = 0 term, from a quadratically divergent\nterm, precisely delivers those counterterms by our previous analysis. Note that they contain terms which do\nnot have an exponential, as in the example (7.38,7.37). Often, as a two-point vertex of mass type improves\nthe powercounting of the co-graph, we might keep self-energy subgraphs massless, in which case only terms\ninvolving R\u0003 contribute.\nWe are left to decompose the terms denoted I. We find by direct computation\nII\n\n(7.55)\n(7.56)\n\nI\n\n=\n\nzh\n}|\ni φ(Γ)(P {)\n′ −1\n′′\nω(Γ) + ω(Γ2 )ω(Γ ) e− ψ(Γ)\n\"\n−1\n− ω(Γ′2 )ω(Γ′′ )\n\ne\n\n)\n− φ(Γ)(P\nψ(Γ)\n\n−e\n\n−\n\nφ(Γ//Γ′2 )(P )\nψ(Γ//Γ′2 )\n\n{z\n\n|\n\nIII\n\n#\n\n.\n\n}\n\nThe terms denoted II gives us the final integrand ι(Γ)(P ) with a corresponding form ωII (Γ). ωII (Γ) = ω(Γ)\nif there are no subgraphs with sdd = 2. Note that II has the full Γ as an argument in the common\nexponential,\n(7.57)\n\nII = ωII (Γ) exp(−φ(Γ)/ψ(Γ)),\n\nwhich defines ωII . The rational coefficient ωII has log-poles only for all subgraphs including the ones with\nsdd = 2.\nThe terms III is considered in t, ai variables. We can integrate t as before. As the rational part of the\n[1]\nintegrand factorizes in Γ′2 and Γ′′ variables, we similarly decompose the former into s, bi , i ∈ Γ′2 , variables.\nWe note s only appears in the log (after the t integration) as a coefficient of φΓ,Γ′2 , using Lemma (7.1).\nPartial integration in s eliminates the log and delivers a top-degree form for the bi integration. These terms\nprecisely compensate against the constant terms mentioned above, as φΓ,Γ′2 = φ1 (Γ′2 )φ1 (Γ − Γ′2 ), using that\nres(Γ′2 ) = 2.\nWe hence summarize\nTheorem 7.3.\n(7.58)\n\nΦR (Γ)(P ) = lim\n\nǫ→0\n\nX\nγ\n\nΦ\nSR;ǫ\n(γ)\n\nZ\n\nǫ\n\nωII (Γ//γ) ln\n\nφ(Γ//γ)(P )\n.\nφ(Γ//γ)(R)\n\nIt is understood that each counterterm is computed with a subtraction R as befits its argument γ, and forms\nΓ are chosen in accordance with the previous derivations. Here, ωII is constructed to have log-poles only.\n32\n\n\fAs a projective integral this reads\nZ\nX\n(−1)[for] ×\nΦR (Γ)(P ) =\nΩΓ\n[for]\n\nQ\n\nj ψ(γj )\n\n+\n\nP\n\nj φ(γj )(R)ψ(Γ//[for])\n\nQ\n\nh6=j ψ(γh )\n\nQ\nP\nQ\nφ(Γ//[for])(R) j ψ(γj ) + j φ(γj )(R)ψ(Γ//[for]) h6=j ψ(γh )\nY\n×ω(Γ//[for])\nω(γj ).\n\n× ln\n(7.59)\n\nφ(Γ//[for])(P)\n\n!\n\nj\n\nRemark 7.4. Similar formulas can be obtained for the bar-operations and counterterms, with the same\nrational functions in the integrands, and exponentials exp(−φ(Γ//γ)(X)/ψ(Γ//γ)), with X = P or X = R\nas needed.\nRemark 7.5. We have worked with choices of renormalizations for mass and wave functions, R → R\u0003 , Rm2 .\nOne can actually also define P → P\u0003 , Pm2 , and for example set masses to zero in all exponentials (φ(*)(P ) →\nφq2 (*)), that's essentially the Weinberg scheme if one then subtracts at q 2 = μ2 .\nRemark 7.6. This all is Rnicely reflected in properties of analytic regulators. For example in dimensional\nregularization the identity dD k[k 2 ]ρ = 0, ∀ρ, leads to Φ(Γ)(P = 0) = 0 immediately, where Φ now indicates\nunrenormalized Feynman rules using that regulator.\nRemark 7.7. We are working so far with constant lower boundaries. The chains introduced in previous\nsections have moving lower boundaries which respect the hierarchy in each flag. We will study that difference\nin section (9.1).\n7.5. Specifics of the MOM-scheme. We define the MOM-scheme by setting all masses to zero in radiative\ncorrections and keeping a single kinematical invariant q 2 in the φ-polynomial, P = {0}, {qi * qj ∼ q 2 },\n(7.60)\n\nφ(Γ) = q 2 Rq2 (Γ).\n\nSuch a situation arises if we set masses to zero (possibly after factorization of a polynomial part from the\namplitude as in the Weinberg scheme), and for vertices if we consider the case of zero momentum transfers,\nor evaluate at a symmetric point qi2 = q 2 , where i denotes the external half-edges of Γ. If we want to\nemphasize the q 2 dependence we write φq2 . Trivially, φq2 = q 2 φ1 . In the MOM-scheme, subtractions are\ndone at q 2 = μ2 , which defines R for all graphs. Counter-terms in the MOM-scheme become very simple\nwhen expressed in parametric integrals thanks to the homogeneity of the φ-polynomial. Note that we hence\nhave φ(Γ) = φ(Γ) as we have set all masses to zero.\nIn a MOM-scheme, renormalized diagrams are polynomials in ln q 2 /μ2 :\nTheorem 7.8. For all Γ,\naug(Γ)\n\n(7.61)\n\nΦMOM (Γ)(q 2 /μ2 ) =\n\nX\n\ncj (Γ) lnj q 2 /μ2 .\n\nj=1\n\nHere, aug(Γ) = max[for] |[for]|.\nProof: Consider a sequence γ1 ( γ2 * * * γaug(Γ) ( Γ. This is in one-to-one correspondence with some decorated\nrooted tree appearing in ρR (Γ) (2.35). Choose one edge ej ∈ γj /γj−1 in each decoration and de-homogenize\nwith respect to that edge. We get a sequence of lower boundaries ǫ, ǫ/A2 , ǫ/A2 /A3 , * * * . Use the affine representation and integrate to obtain the result.\n\u0003\n7.5.1. MOM scheme results from residues. In such a scheme, it is particularly useful to take a derivative\nwith respect to ln q 2 . We consider\n(7.62)\n\np1 (Γ) := q 2 ∂q2 ΦMOM (Γ)(q 2 /μ2 )|q2 =μ2 ,\n\nwhere we evaluate at q 2 = μ2 after taking the derivative. This number, which for a primitive element of\nthe renormalization Hopf algebra is the residue of that graph in the sense of [2], is our main concern for a\ngeneral graph. It will be obtained in the limit of the limiting mixed Hodge structure we construct.\n33\n\n\fRemark 7.9. It is not that this limit would not exist for general schemes. But the limit would be a complicated function of ratios of masses and kinematical invariants, which has a constant term given by the number\np1 (Γ) and beyond that a dependence on these ratios which demands a much finer Hodge theoretic study than\nwe can offer here.\nBut first we need to remind ourselves how coefficients of higher powers of logarithms of complicated graphs\nrelated to coefficients of lower powers of sub- and co-graphs thanks to the renormalization group.\nPaug(Γ)\nΦ\nΦ\n7.5.2. The counterterm SMOM\n. For SMOM\n(Γ) =:\nsj (Γ) lnj μ2 , we simply use the renormalization\nj=1\ngroup or the scattering type formula. In particular, we have\naug(Γ)\nΦ\nSMOM\n(Γ) =\n\n(7.63)\n\nX 1\n(−1)j [p1 ⊗ * * * ⊗ p1 ] ∆j−1 (Γ).\n{z\n}\n|\nj!\nj=1\njfactors\n\nThis is easily derived [6, 17] upon noting that p1 (Γ) = Φ(S ⋆ Y (Γ)).\nNote that this determines counter-terms by iteration: for a k-loop graph, knowledge of all the lower order\ncounterterms suffices to determine all contributions to the k-loop counterterm but the lowest order coefficient\nof ln μ2 . But then, that coefficient is given by the formula\ns1 (Γ) = p1 (Γ) ln μ2 ,\n\n(7.64)\n\nwhich itself only involves counter-terms of less than k loops, by the structure of the bar operation.\n7.5.3. p1 (Γ) from co-graphs. We can now summarize the consequences of the renormalization group and our\nprojective representations for parametric representations of Feynman integrals. The interesting question is\nabout the logs which we had in numerators. Thm.(7.3) becomes\nTheorem 7.10.\n(7.65)\n\np1 (Γ) = lim\n\nǫ→0\n\nThis limit is\np1 (Γ) =\n\n(7.66)\n\nZ\n\nΩΓ\n\nX\n[for]\n\nX\n\nΦ\n(γ)q 2 ∂q2\nSMOM;ǫ\n\nγ\n\nZ\n\nωII (Γ//γ) ln φq2 /μ2 (Γ//γ).\n\nǫ\n\n(−1)[for] ×\n\n\n×q 2 ∂q2 ln φq2 /μ2 (Γ//[for])\n\n×ω(Γ//[for])\n\nY\n\nY\nj\n\nω(γj ).\n\nψ(γj ) +\n\nX\nj\n\nφ1 (γj )ψ(Γ//[for])\n\nY\n\nh6=j\n\n\n\nψ(γh )\n\nj\n\nThe derivative with respect to ln q 2 can be taken inside the integral in (7.65) if and only if all edges carrying\nexternal momentum are in the complement C(Γ) of all edges belonging to divergent subgraphs. In that case,\nq 2 ∂q2 ln φq2 (Γ//γ) = 1 and no logs in the numerator appear.\nRemark 7.11. Note that overlapping divergent graphs can force all edges to belong to divergent subgraphs,\ncf. Fig.(5).\nProof: If all edges carrying external momentum are in the complement to divergent subgraphs, we bring the\ncounter-terms under the integrand using the bar-operation. We can take the limit ǫ → 0 in the integrand for\nall edge variables belonging to subgraphs, and this limit commutes with the derivative with respect to ln q 2\nby assumption: each φ2q (Γ//γ) is a linear combination of terms Ae ψe (Γ//γ), where e is in that complement\nC(Γ) of subgraph edges, and ψe (Γ//γ) = ψ(Γ//γ/e). Applying then the Chen-Wu theorem [21] with respect\nto the elements of C(Γ) disentangles the q 2 dependence from the limit in ǫ.\n\u0003\n34\n\n\f2\n3\n4\n1\n\n4\n123\n\n3\n+\n124\n\n12\n+\n4 or 3\n\n34\n\n34 or 12\n\n123 or 124\n\nFigure 14. The Dunce's cap, again. We label the edges 1, 2, 3, 4. Resolved in trees, we\nfind three trees in the core Hopf algebra. We label the vertices by edge labels of the\ngraph. The sets 123 and 124 correspond to a triangle graph as indicated, the sets 12 and\n34 are one-loop vertex graphs, and tadpoles appear in the coproduct on the rhs for edges\n3 or 4. The coproduct in the core Hopf algebra is, expressed in edge labels, ∆′ (1234) =\n123 ⊗ 4 + 124 ⊗ 3 + 34 ⊗ 12. Only the last term appears in the renormalization Hopf algebra.\n\nRemark 7.12. Note that the discussion below with respect to the limiting Hodge structure assumes that we\nhave this situation of disentanglement of divergent subgraphs and edges carrying external momentum. We\nhence have no logarithms in the numerator. But note that the general case does no harm to the ensuing\ndiscussion: by Lemma (7.1), any logarithms in the numerator are congruent to one along any exceptional\ndivisor of XΓ//[for] . Furthermore, when external momentum interferes with subgraphs, all logs can be turned\nto rational functions by a partial integration. The fact that the second Kirchhoff–Symanzik polynomial is\na linear combination of ψ-polynomials, applied to graphs with an extra shrunken edge, in the MOM-case\nestablishes these rational functions\nR to have poles coming from our analysis of this ψ(Γ) polynomial. A full\nmathematical discussion of this \" ω ln f \" situation should be subject to future work.\n7.5.4. Examples. ¿From now on we measure q 2 in units of μ2 so that subtractions are done at 1. This\nsimplifies notation. Let us first consider the Dunce's cap in detail, (14). We have the following data\n(pathq (Γ) refers to the momentum path through the graph):\n\n(7.67)\n\nψ(Γ)\n\n=\n\n(A1 + A2 )(A3 + A4 ) + A3 A4 ,\n\n(7.68)\n(7.69)\n\nψ(γ) =\npathq (Γ) =\n\nA3 + A4 , ψ(Γ//γ) = A1 + A2 ,\ne1 ,\n\n(7.70)\n(7.71)\n\nφ1 (Γ) =\nφ1 (γ) =\n\n(7.72)\n\n(7.73)\n\n{[for]}\n\n=\n\nA1 (A2 A3 + A3 A4 + A4 A2 ) = A1 ψ(Γ//e1 ) = A1 ψ 1 (Γ),\nA3 A4 , φ1 (Γ//γ) = A1 A2 ,\n{∅, (34)}.\n\nΦ(Γ)ǫ (q 2 ) =\n\nZ\n\nǫ\n\n4\n∞Y\n\ni=1\n35\n\ndAi\n\n1 (Γ)\nexp −q 2 φψ(Γ)\n\nψ 2 (Γ)\n\n.\n\n\fHence we choose a function τ (ǫ) which goes to zero rapidly enough so that limǫ→0 τ (ǫ)/ǫ = 0 and compute\n\nZ ∞\nZ ∞\n exp −q 2 φ1 (Γ)\nψ(Γ)\n2\n2\ndA1 dA2\ndA3 dA4\nΦ̄ǫ (Γ)(q , μ ) =\n2\n\nψ (Γ)\nǫ\nτ (ǫ)\ni\ni\nh\nh\n1 (γ)\n1 (Γ//γ)\n\nexp − φψ(γ)\nexp −q 2 φψ(Γ//γ)\n(7.74)\n−\n\nψ 2 (Γ//γ)\nψ 2 (γ)\n\n\nZ ∞\nZ ∞\n exp − φ1 (Γ) \nψ(Γ)\n=\ndA1 dA2\ndA3 dA4\n ψ 2 (Γ) \nq2 ǫ\nτ (ǫ)q2\nh\nh\ni\ni\n\n1 (Γ//γ)\n1 (γ)\nZ ∞\nZ ∞\n\nexp − φψ(Γ//γ)\nexp − φψ(γ)\n−\ndA1 dA2\ndA3 dA4\n(7.75)\n.\n2\n2\n q2 ǫ\n\nψ (Γ//γ)\nψ (γ)\nτ (ǫ)\n\nLet us now re-scale to variables Ai → A1 Bi for all variables i ∈ 2, 3, 4. We get\n\n\nZ ∞\nZ ∞\nZ ∞\n exp −A1 (B2 B3 +B3 B4 +B4 B2 ) \ndA\n(1+B\n)(B\n+B\n)+B\nB\n1\n2\n3\n4\n3 4\nΦ̄ǫ (Γ)(q 2 , μ2 ) =\ndB2\ndB3 dB4\n [(1 + B2 )(B3 + B4 ) + B3 B4 ]2 \nq2 ǫ A1\nq2 ǫ\nq2 τ (ǫ)/A1\n(Z\n)\nZ\nZ ∞\nB4\nB2\n∞\nexp −A1 BB33+B\nexp −A1 1+B\ndA1 ∞\n2\n4\n−\n(7.76)\n.\ndB2\ndB3 dB4\n(1 + B2 )2\n(B3 + B4 )2\nq2 ǫ A1\nq2 ǫ\nτ (ǫ)/A1\n\nWe re-scale once more B4 = B3 C4 . Also, we set the lower boundaries in the B2 and C4 integrations to zero.\nThis is justified as A1 and B3 remain positive.\n\n\nZ ∞\nZ ∞\nZ ∞\nZ ∞\n exp −A1 (B2 +B3 C4 +C4 B2 ) \ndA\ndB\n(1+B\n)(1+C\n)+B\nC\n1\n3\n2\n4\n3 4\nΦ̄ǫ (Γ)(q 2 , μ2 ) =\ndB2\ndC4\n [(1 + B2 )(1 + C4 ) + B3 C4 ]2 \nq2 ǫ A1\n0\n0\nq2 τ (ǫ)/A1 B3\n)\n(\nZ\nZ\nZ ∞\nZ ∞\nB2\nC4\nexp −A1 1+B\nexp −A1 B3 1+C\ndB3 ∞\ndA1 ∞\n2\n4\n(7.77)\n.\ndB2\ndC4\n−\n(1 + B2 )2\n(1 + C4 )2\n0\n0\nτ (ǫ)/A1 B3\nq2 ǫ A1\nTaking a derivative wrt ln q 2 and using that limǫ→0 τ (ǫ)/ǫ = 0, delivers three remaining terms\n\u001b\n\u001a\nZ ∞\nZ ∞\nZ\ndB3 ∞\n1\n∂ln q2 Φ̄ǫ (Γ)q2 =1 =\ndB2\ndC4\n[(1 + B2 )(1 + C4 ) + B3 C4 ]2\n0\nτ (ǫ)/ǫ B3\n0\n(\n2 B3 C4 )\nZ ∞\nZ ∞\nZ\ne−ǫq 1+C4\ndB3 ∞\n1\n−\ndB2\ndC4\n(1 + B2 )2 (1 + C4 )2\n0\nτ (ǫ)/(q2 ǫ) B3\n0\n)\n(\nB2\nZ ∞\nZ\nZ ∞\n−A\ndA1 ∞\ne 1 (1+B2 )\n(7.78)\n+\n.\ndB2\ndC4\n[(1 + B2 )(1 + C4 )]2\nq2 ǫ A1\n0\n0\nIntegrating B3 in the second line and A1 in the third, we find\nZ ∞\nZ ∞\nZ\ndB3 ∞\n1\n∂ln q2 Φ̄ǫ (Γ)q2 =1 =\ndB2\ndC4\n[(1 + B2 )(1 + C4 ) + B3 C4 ]2\n0\nτ (ǫ)/ǫ B3\n0\nZ\nZ\nΩΓ//γ\nΩγ\n+ ln τ (ǫ)/ǫ\n(7.79)\n.\n2\n2\nψ (γ)\nψ (Γ//γ)\nUsing the exponential integral, those B3 and A1 integrations also deliver finite contributions\n(\n) Z\n)\n(\nZ ∞\nZ ∞\nZ ∞\nC4\nB2\n∞\nln 1+C\nln 1+B\n1\n4\n2\n+\ndB2\n= 0.\ndC4\n(7.80)\n−\ndB2\ndC4\n(1 + B2 )2 (1 + C4 )2\n[(1 + B2 )(1 + C4 )]2\n0\n0\n0\n0\n36\n\n\fThis cancellation of logs is no accident: while in this simple example it looks as if it originates from the fact\nthat the co-graph and subgraph are identical, actually the cross-ratio\nφ(Γ//γ)ψ(γ)\n(7.81)\nln\nψ(Γ//γ)φ(γ)\nvanishes identically when integrated against the de-homogenized product measure\nZ\n1\n.\ndAΓ//γ dAγ 2\n(7.82)\nψ (Γ//γ)ψ 2 (γ)\n0\n\nThis is precisely because C(Γ) = e1 has an empty intersection with γ [1] = e3 , e4 .\nBut then, this cancelation of logs will break down if φ(Γ) is not as nicely disentangled from φ(γ) for\nall log-poles as it is here, and will be replaced by logs congruent to 1 along subdivergences in general, in\naccordance with Thm.(7.10).\nLet us study this in some detail. Consider the graph on the upper left in Fig.(7), and consider the finite\nln φ/ψ-type contributions of the exponential integral to in the vicinity of the exceptional divisor for the\nsubspace A3 = A4 = 0.\nRouting an external momentum through edges 1,6, we have the following graph polynomials:\n(7.83)\n\nφ1 (Γ) =\n\n(7.84)\n(7.85)\n\nφ1 (Γ/34) =\nφ1 (34) =\n\n(7.86)\n(7.87)\n\nψ(Γ/34) =\nψ(34) =\n\nA1 [A3 A4 (A5 + A6 ) + A5 A6 (A3 + A4 ) + A2 (A3 + A4 )(A5 + A6 )]\n+A6 A5 [(A1 + A2 )(A3 + A4 ) + A3 A4 ]\nA1 [A5 A6 + A2 (A5 + A6 )] + A5 A6 [(A1 + A2 )]\nA3 A4\n(A1 + A2 )(A5 + A6 ) + A5 A6\nA3 + A4 .\n\nWe have C(Γ) = e1 , e6 , and ∪γ(Γ,res(γ)≥0 γ [1] = e3 , e4 , e5 , e6 . The intersection is e6 . We hence find, with\nsuitable de-homogenization,\nY\n\nX\n\nln\n\n}|\n{ z\n}|\n{\nz\nB5 B6 (1 + B2 ) + B5 B6 + B2 (B5 + B6 )\n(1+B2 )(B5 +B6 )+B5 B6\n\nC4\n− ln 1+C\n4\n\ndB2 dC4 dB5 dB6 .\n[(1 + B2 )(B5 + B6 ) + B5 B6 ]2 [1 + C4 ]2\nHere, the term X denotes a term which would be absent if the momenta would only go through edge 1 and\nhence the above intersection would be empty, while Y indicates the terms from the momentum flow through\nedge 1.\nThis is of the form ln(fΓ//γ /fγ )[ωΓ//γ ∧ ωγ ]. If the term X would be absent, a partial integration\nZ ∞\nZ ∞\nxu+v\nln xu+w\n1\n∼\n(7.89)\n2\n(xu + w)\n(xu + w)2\nǫ\nǫ\nwould show the vanishing of this expression as above. The presence of X leaves us with a contribution which\ncan be written, replacing ln C4 /(1 + C4 ) by ln Y /ψ(Γ/34),\n(7.88)\n\nX\n\nY\n\nz\n}|\n{ z\n}|\n{\nB5 B6 (1 + B2 ) + B5 B6 + B2 (B5 + B6 )\nln\nB5 B6 + B2 (B5 + B6 )\n{z\n}\n|\n\nY\n.\n[(1 + B2 )(B5 + B6 ) + B5 B6 ]2 [1 + C4 ]2\nAs promised, it is congruent to one along the remaining log-pole at A5 = A6 = 0. It has to be: the forest\nwhere the subgraph 56 shrinks to a point looses the momentum flow through edge 6 and could not contribute\nany counterterm for a pole remaining in the terms discussed above.\nNote that in general higher powers of logarithms can appear in the numerator as subgraphs can have\nsubstructure. Lacking a handle to notate all the log-poles which do not cancel due to partial integration\nidentities known beyond mankind we consider it understood that all terms from the asymptotic expansion\nof the exponential integral up to constant terms (higher order terms in ǫ are not needed as all poles are\nlogarithmic only) are kept without being shown explicitly in further notation. We emphasize though that\n\n(7.90)\n\n37\n\n\fall those logarithm terms in the numerator are congruent to one along log-poles -and deserve study in their\nown right elsewhere-, and hence thanks to Lemma (7.1) which guarantees indeed all necessary cancelations,\nwe have in all cases:\n(7.91)\n\np1 (Γ) = lim ∂ln q2 Φ̄ǫ (Γ)q2 =1 .\nǫ→0\n\nRemark 7.13. There is freedom in the choice of τ , a natural choice comes from the rooted tree representation\nρ(Γ) of the forest. Each forest is part of a legal tree t and any subgraph γ corresponds to a vertex v in that\ntree. If dv is the distance of v to the root of t, τ (ǫ) = ǫdv +1 is a natural choice.\n8. N\n8.1. for physicists: The antipode as monodromy. Let us now come back to the core Hopf algebra and\nprepare for an analysis in terms of limiting mixed Hodge structures. This will be achieved in two steps: an\nanalysis of the structure of the antipode of the renormalization Hopf algebra, which will then allow to define\na matrix N for the monodromy in question such that S(Γ) can be expressed in a particularly nice way. In\nfact, because of orientations, the N which arises in the monodromy calculation is the negative of the N\ncomputed in this section. We omit the minus sign to simplify the notation.\nLet us consider the antipode first. Thanks to the above lemma we can write for the antipode S(Γ)\nS(Γ) = −\n\n(8.1)\n\n|Γ|\nX\n\nX X\n\n(−1)j\n\nj=0\n\n|C|=j\n\nP C (t)RC (t).\n\nt\n\nHere, we abuse notation in an obvious manner identifying Γ and ρT (Γ), the latter being the indicated sum\nover trees, in accordance with Eq.(2.34).\nWe also define R(Γ) = −S(Γ). Let us now label the edges of each t(Γ) once and for all by 1, 2, * * * , |Γ| − 1.\nThen, we have |Γ| − 1 cuts C with |C| = 1, and\n\u0012\n\u0013\n|Γ| − 1\n(8.2)\nj\ncuts of cardinality |C| = j. We hence can define a vector v(Γ) with 2|Γ|−1 entries in H, ordered according\nto a never decreasing cardinality of cuts:\nX\nX\n,*** ,\n, * * * )T .\nP C (t)RC (t)\n(8.3)\nv(Γ) = (Γ,\nP C (t)RC (t)\n\"\n\nt\n\"\n\n|\n\n|Γ|−1\n1\n\n{z\n\n}\n\n\"\n\nentries of cardinality 1\n\nt\n\"\n\n|\n\n|Γ|−1\nj\n\n{z\n\n}\n\nentries of cardinality j\n\nExample: Dunce's cap with edges 1, 2, 3, 4 and divergent subgraph 3, 4, comare Fig.(14). The core coproduct\nis\n∆′c = 123 ⊗ 4 + 124 ⊗ 3 + 34 ⊗ 12.\n\n(8.4)\nThe vector v is then\n(8.5)\n\nv=\n\n\u0012\n\n1234\n(123)(4) + (124)(3) + (12)(34)\n\nLet N (2) be the to-by-two matrix\n(8.6)\n\nN (2) =\n\n\u0012\n\n0\n0\n\n1\n0\n\n\u0013\n\n\u0013\n\n.\n\n.\n\nNote that\n\u0015\u0012\n\u0014\u0012\n\u0013 \u0012\n\u0013\n\u0013\n1234\n1 0\nR(1234)\n(8.7)\n=\n− N (2)\n,\n(123)(4) + (124)(3) + (12)(34)\n0 1\n(123)(4) + (124)(3) + (12)(34)\nwith\n(8.8)\n\nR(1234) = 1234 − (123)(4) − (124)(3) − (34)(12).\n38\n\n\fIn fact, it is our first task to find a nilpotent matrix N , N |Γ| = 0, such that\n\n|Γ|−1\n\n(8.9)\n\nX\n\nX\n\n(−1)j N j /j! = (R(Γ),\n\nj=0\n\n\"\n\nFor P C (t) =\n\nQ\n\ni ti\n\n|\n\nX\n\nR(P C (t))R(RC (t)) , * * * ,\n\nt\n\n|Γ|−1\n1\n\n\"\n\n{z\n\n}\n\nentries of cardinality 1\n\nwe here have abbreviated R(P C (t)) for\n\nQ\n\ni\n\n\"\n\n|\n\nR(P C (t))R(RC (t)) , * * * ), )T .\n\nt\n\n|Γ|−1\nj\n\n\"\n\n{z\n\n}\n\nentries of cardinality j\n\nR(ti ).\n\n8.2. The matrix N . Let M (0, 1) be the space of matrices with entries in the two point set {0, 1}.\nLet now m + 1 be the number of loops m = |Γ| − 1 in the graph and let us construct a nilpotent 2m × 2m\nsquare matrix N ≡ N (m) , N m+1 = 0, in M (0, 1) as follows.\nConsider first the m + 1-th row of the Pascal triangle, for example for m = 3 it reads 1, 3, 3, 1. For this\nexample, we will then construct blocks of sizes 1 × 1, 1 × 3, 3 × 3, 3 × 1 and 1 × 1, all with entries either 0\nor 1.\n(m)\n(m)\n(m)\nSo this gives us in general m+2 blocks Mj , 0 ≤ j ≤ m+1, of matrices of size M0 : 1×1, M1 : 1×m,\n(m)\n\n(m)\n\n(m)\n\nM2 : m × m(m − 1)/2!, * * * , Mm : m × 1, Mm+1 : 1 × 1.\n(m)\nIn the block Mj , 0 ≤ j < (m + 2)/2, fill the columns, from left to right, by never increasing sequences\nof binary numbers (read from top to bottom) where each such number contains j entries 1 for the block\n(m)\n(m)\n(m)\n(m)\nMj . Put M0 = (0) in the left upper corner and M1 to the left of it. For j ≥ 2, put the block Mj\n(m)\n\nbelow and to the right of the block Mj−1 , in N . All entries in N outside these blocks are zero. Determine\n(m)\nMj ,\n\nm + 1 ≥ j ≥ (m + 2)/2, by the requirement that N ⊥ = N , where N ⊥ is\nthe entries of the blocks\nobtained from N by reflection along the diagonal which goes from the lower left to the upper right. We write\n(m) ⊥\n\n(m)\n\n(m)\n\n⊥\n\n(m)\n\n(3)\n\n= Mm+1−i . For odd integer m, we have M(m+1)/2 = M(m+1)/2+1 , by construction. Here are Mj\nMi\nand N, N 2 , N 3 for m = 3:\n\n(8.10)\n\n(3)\nM0\n\n=\n\n(3)\n(0), M1\n\n=\n\n(3)\n(1, 1, 1), M2\n\n\n\n1 1\n= 1 0\n0 1\n39\n\n\n\n\n0\n1\n(3)\n(3)\n1  , M3 =  1  , M4 = (0).\n1\n1\n\n\f\nN (3)\n\n(8.11)\n\n=\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nN (3)\n\n(8.12)\n\n2\n\n=\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nN (3)\n\n(8.13)\n\n3\n\nWe can now write, for 1 ≤ j ≤ m,\n\n=\n\n\n\n\n\n\n\n\n\n\n\n\n\n(8.15)\n\n1| 0\n0 |1\n0 |1\n0 |0\n0 0\n0 0\n0 0\n0 0\n\n1\n0\n0\n0\n0\n0\n0\n0\n\n0\n0\n0\n0\n0\n0\n0\n0\n\n0\n0\n0\n0\n0\n0\n0\n0\n\n0\n0\n0\n0\n0\n0\n0\n0\n\n0\n0\n0\n0\n0\n0\n0\n0\n\n2\n0\n0\n0\n0\n0\n0\n0\n\n2\n0\n0\n0\n0\n0\n0\n0\n\n0\n0\n0\n0\n0\n0\n0\n0\n\n0\n0\n0\n0\n0\n0\n0\n0\n\n0\n0\n0\n0\n0\n0\n0\n0\n\n0\n0\n0\n0\n0\n0\n0\n0\n\n0\n0\n0\n0\n0\n0\n0\n0\n\n0\n0\n0\n0\n0\n0\n0\n0\n\n(m)\n\nN j = j!nj\n\n(8.14)\nwhere the matrix\n\n0 |1\n0 0\n0 0\n0 0\n0 0\n0 0\n0 0\n0 0\n\n(m)\nnj\n\n\n0 0 0\n1 0| 0 \n\n0 1| 0 \n\n1 1| 0 \n,\n0 0 |1 \n\n0 0 |1 \n\n0 0 |1 \n0 0 0\n\n2 0\n0 2 \n\n0 2 \n\n0 2 \n,\n0 0 \n\n0 0 \n\n0 0 \n0 0\n\n0 6\n0 0 \n\n0 0 \n\n0 0 \n.\n0 0 \n\n0 0 \n\n0 0 \n0 0\n\n,\n\n∈ M (0, 1), by construction. Hence\nm\nm\no X\nn\n(−L)j (m) j X\n(m)\n(−L)j nj .\n=\nN\nexp −LN (m) =\nj!\nj=0\nj=0\n\n(m)\n\nThis is obvious from the set-up above. Furthermore, directly from construction, nj\nstructure into blocks of size\n(8.16)\n\n(1 × m), * * * ,\n\n***\n|{z}\n\n, j ≥ 1, has a block\n\n, * * * , (m × 1),\n\nj − 1 middle blocks missing\n\nlocated in the uppermost right corner of size 2m−j+1 × 2m−j+1 as in the above example.\n8.3. Math:The Matrix N . In this section we compute the matrix N which gives the log of the monodromy.\nBecause of orientations, the answer we get is the negative of the physical N computed in the previous section.\nOur basic result gives the monodromy\nX\nX\n(8.17)\nm(σ1 ) =\n(−1)p τI = σ1 +\n(−1)p τI .\nI\n\nI, p≥1\n\nHere we have changed notation. I = {i1 , . . . , ip } refers to a flag Γi1 ( * * * ( Γip ( Γ of core subgraphs. More\ngenerally\nX\n(8.18)\nm(τI ) =\n(−1)q−p τJ .\nJ⊃I\n\nHere J = {j1 , . . . , jq } ⊃ I. to verify (8.18), consider e.g. the case corresponding to Γ1 ( Γ. We have\nseen (lemma 3.3) that the blowup of P(Γ) along the linear space defined by the edge variables associated to\nedges of Γ1 yields as exceptional divisor E1 ∼\n= P(Γ1 ) × P(Γ//Γ1 ). In fact, the strict transform of E1 in the\nfull blowup P (Γ) can be identified with P (Γ1 ) × P (Γ//Γ1 ). To see this, note that by proposition 3.4, the\n40\n\n\fintersection in P (Γ) of distinct exceptional divisors E1 ∩ * * * ∩ Ep is non-empty if and only if after reordering,\nthe corresponding core subgraphs of Γ form a flag. This means, for example, that E1 ∩ EI 6= ∅ if and only if\nthe flag corresponding to I has a subflag of core subgraphs contained in Γ1 , and the remaining core subgraphs\nform a flag containing Γ1 . In this way, we blow up appropriate linear spaces in P(Γ1 ) and in P(Γ/Γ1 ). the\nresult is P (Γ1 ) × P (Γ//Γ1 ) ⊂ P (Γ). The chain τ1 is an S 1 -bundle over the chain σP(Γ1 ) × σP(Γ//Γ1 ) (slightly\nmodified along the boundaries as above), and the monodromy map is the product of the monodromies on\neach factor. (The monodromy takes place on P (Γ1 ) × P (Γ//Γ1 ). In the end, one takes the S 1 -bundle over\nm(σP(Γ1 ) ×σP(Γ//Γ1 ) ).) But this yields exactly (8.18). The result for a general m(τI ) is precisely analogous. To\ncompute N , suppose Γ has exactly k core subgraphs Γ′ ( Γ. (This means that P (Γ) will have k exceptional\ndivisors Ei .) Consider the commutative ring\n(8.19)\n\nR := Q[x1 , . . . , xk ]/(x21 , . . . , x2k , M1 , . . . , Mr ),\n\nwhere we think of the xi as corresponding to exceptional divisors Ei on P (Γ), and the Mj are monomials\ncorresponding to empty intersections of the Ei . The notation means that we factor the polynomial ring\nin the xi by the ideal generated by the indicated elements. We may if we like drop the Mj from the\nideal. This will simply mean the column vector on which N acts will have many entries equal to 0. As\na vector\nQ space, we can identify R with the free vector space on σ1 and the τI by mapping σ1 7→ 1 and\nτI 7→ i∈I xi . With this identification, the monodromy map m is given (compare (8.18)) by multiplication\nby (1 − x1 )(1 − x2 ) * * * (1 − xk ). But the map R → Endvec. sp. (R) given by multiplication is a homomorphism\nof rings, so log(m) is given by (note x2i = 0)\n\u0010\n\u0011\nX\nxi .\n(8.20)\nlog (1 − x1 ) * * * (1 − xk ) = −\nP\nThus N is the matrix for the map given by multiplication by − xi . If we ignore the relations Mj and\njust write the matrix for the action on Q[x1 , . . . , xk ]/(x21 , . . . , x2k ), it has size 2k × 2k and is strictly upper\ntriangular. For k = 3, the matrix is −N (3) (8.11).\n9. Renormalization: the removal of log-poles\nRecall we have defined sdd(Γ), the degree of superficial divergence of a graph with respect to a given\nphysical theory, (2.2). The choice of the theory determines a differential form ωΓ associated to Γ. We will\nbe interested in the logarithmic divergent case, when sdd(Γ) ≥ 0, but ωΓ has been chosen such that it only\nhas log-poles, see in particular section 7.4. The affine integral in this case will be overall logarithmically\ndivergent, but this overall divergence can be eliminated by passing to the associated projective integral. If,\nfor all core subgraphs Γ′ ⊂ Γ, we have sdd(Γ′ ) < 0, then the projective integral actually converges and we\nare done. If Γ′ > 0 for some subgraph, then one is obliged to manipulate the differential form as described in\nsection 7 above. To simplify notation, from now on we assume that all graphs and subgraphs have sdd ≤ 0,\nwhile all following lemmas hold similarly for higher degrees of divergence with the appropriate choice of ωII .\nBelow, we spell all results out for the case ωII = Ω2n−1 /ψΓ2 , and we set ψΓ ≡ ψ(Γ).\nLemma 9.1. Let Γ′ ( Γ be core graphs and assume sdd(Γ) = 0. Let L ⊂ XΓ ⊂ P(Γ) be the coordinate\nlinear space defined by the edges occurring in Γ′ . Let π : PL → P(Γ) be the blowup of L. Then π ∗ ωΓ has a\nlogarithmic pole on E if and only if sdd(Γ′ ) = 0. Similarly, the pullback of ωΓ to the full core blowup P (Γ)\n(cf. formula (3.3)) has a log pole of order along the exceptional divisor EΓ′ associated to Γ′ if and only if\nsdd(Γ′ ) = 0.\nProof. We give the proof for φ4 -theory. Let the loop number |Γ| = m so the graph has 2m edges (2.2). Let\nX\ndi ∧ * * * ∧ dA2m = A2m d(A1 /A2m ) ∧ * * * ∧ d(A2m−1 /A2m ).\n(9.1)\nΩ2m−1 =\n(−1)i Ai dA1 ∧ * * * ∧ dA\n2m\n\nThen\n(9.2)\n\nωΓ =\n\nΩ2m−1\n.\nψΓ2\n\nSuppose L : A1 = * * * = Ap = 0. We can write the graph polynomial ([2], prop. 3.5)\n(9.3)\n\nψΓ = ψΓ′ (A1 , . . . , Ap )ψΓ//Γ′ (Ap+1 , . . . , A2m ) + R\n41\n\n\fwhere the degree of R in A1 , . . . , Ap is strictly greater than deg ψΓ′ = |Γ′ |. Let ai = Ai /A2m , and let\nbi = ai /ap , i < p. Locally on P we can take b1 , . . . , bp−1 , ap , ap+1 , . . . , A2m as local coordinates and write\n(9.4)\n\n′\n\n|\nωΓ = ±ap−2|Γ\np\n\ndap db1 ∧ * * * ∧ da2m−1\n∧\n.\nap\nF2\n\nHere F is some polynomial in the ai 's and the bj 's which is not divisible by ap . The assertion for the blowup\nof L follows immediately. The assertion for P (Γ) is also clear because we can find a non-empty open set on\nP(Γ) meeting L such that the inverse images in P (Γ) and in PL are isomorphic.\n\u0003\nWe want to state the basic renormalization result coming out of our monodromy method. For this, we\nrestrict to the case\nsdd(Γ′ ) ≤ 2, ∀Γ′ ⊆ Γ,\n\n(9.5)\n\nwith an understanding that appropriate forms ωII (Γ′ ) have been chosen so that the differential forms has\nlog-poles only. The following lemma applies then to φ4 -theory. A physicist wishing to apply our results to\nanother theory needs only check the lemma holds with ωΓ replaced by the integrand given by Feynman rules.\nLemma 9.2. Let τVε be the chains on P(Γ) constructed above (section 4) (including the case τPε (Γ) = σε ).\nThen, assuming (9.5), we will have\nZ\n(9.6)\nωΓ = O(| log |ε||k ), |ε| → 0\nτVε\n\nfor some k ≥ 0.\nProof. We first consider the integral for the chain σε = τPε (Γ) . Locally on the blowup P (Γ) the integrand will\nlook like (9.4) but there may be more than one log form; i.e. ω\ne dap1 /ap1 ∧* * *∧dapk /apk . An easy estimate for\nsuch an integral over a compact chain satisfying aj ≥ ε gives C(| log ε|)k . The integrals over τVε , V ( P (Γ)\ninvolve first integrating over one or more circles. Locally the chain is an (S 1 )p -bundle over an intersection\nx1 = * * * = xp = 0 in local coordinates. We may compute the integral by first taking residues. V will be the\nclosure of a torus orbit in P (Γ) associated to a flag Γp ( * * * ( Γ1 ( Γ (proposition 3.4). We may assume\nxi is a local equation for the exceptional divisor in P (Γ) associated to Γi ⊂ Γ. By lemma 9.1, our integrand\nwill have a pole on xi = 0 if and only if sdd(Γi ) = 0. (Note that the integrand has no singularities on τVε ,\nso we may integrate in any order.) The situation is confusing because sdd(Γi ) < 0 ⇒ sdd(Γ//Γi ) > 0 so\none might expect non-log growth in this case. The problem does not arise, because the residue will vanish.\nAssuming sdd(Γi ) = 0, ∀i, the residue integral is\nZ\nωΓp ∧ * * * ∧ ωΓ//Γ1 .\n(9.7)\nQ\nj\n\nε\nτP\n(Γ\n\nj //Γj+1 )\n\nSince sdd(Γi //Γi+1 ) = 0, we may simply write (9.7) as a product of integrals and argue as above.\n\n\u0003\n\nWe want now to apply the argument sketched in the introductionR to our situation. There is one mathematical point which must be dealt with first. We want to consider σt ωΓ as a function of t. Here we must\nbe a bit careful. For t = εeiθ and |θ| << 1 we are ok, but as θ grows, our chain may meet XΓ . Topologically,\nwe have (proposition 6.3) the chains c̃η,ε,θ which miss XΓ and which represent the correct homology class in\nH∗ (P(Γ) − XΓ , ∆t − XΓ ∩ ∆t ), but one must show our integral depends only on the class in homology relative\nto ∆t , i.e. ωΓ integrates to zero over any chain on ∆t − XΓ ∩ ∆t . Intuitively, this is because ωΓ |∆t = 0, but,\nbecause ∆t has singularities it is best to be more precise. Quite generally, assume U is a smooth variety of\ndimension r, and D ⊂ U is a normal crossings divisor (i.e. for any point u ∈ U there exist local coordinates\nx1 , . . . , xr near u, and p ≤ r such that D : x1 x2 * * * xp = 0 near u). One has sheaves\n(9.8)\n\nΩqU (log D)(−D) ⊂ ΩqU ⊂ ΩqU (log D)\n\nwhere ΩqU is the sheaf of algebraic (or complex analytic; in fact, either will work here) q-forms on X,\nand ΩqU (log D) is obtained by adjoining locally wedges of differential forms dxi /xi , 1 ≤ i ≤ p. Locally,\nΩqU (log D)(−D) := x1 x2 * * * xp ΩqU (log D). All three sheaves are easily seen to be stable under exterior\n42\n\n\fdifferential (for varying q). The resulting complexes calculate the de Rham cohomology for (U, D), U, (U −D)\nrespectively, [7]. Note that in the top degree r = dim U we have\ndx1 ∧ * * * ∧ dxp\n(9.9)\nΩrU (log D)(−D) = OU * x1 x2 * * * xp\ndxp+1 ∧ * * * ∧ dxr = ΩrU .\nx1 x2 * * * xp\nIt follows that we get a maps\nΩrU [−r] → Ω∗U (log D)(−D);\n\nr\nΓ(U, ΩrU ) → HDR\n(U, D).\nR\nIn particular, taking U = P(Γ) − XΓ , we see that integrals ch.rel.∆t ωΓ are well-defined.\n\n(9.10)\n\nTheorem 9.3. We suppose given a graph Γ such that all core subgraphs Γ′ ⊆ Γ have superficial divergence\nsdd(Γ′ ) ≤ 0 for a given physical theory. Let ωΓ be the form associated to the given theory. Let N be the\nupper-triangular matrix of size K × K described in the previous section, where K is the number of chains of\ncore subgraphs\nΓp ( * * * ( Γ.\nThen the lefthand side of the expression below is single-valued and analytic for t in a disk about 0 so the\nlimit\n\nR\nωΓ\nt\nτP\n \n\n (Γ)\na1\n..\n\n\nlog t \n\n\n.\n.\n) R\n(9.11)\nlim exp(−N\n =  .. \n2πi  τ t ωΓ \n|t|→0\n\n V\nak\n..\n.\nexists.\n\nProof. The proof proceeds as outlined in section 1.3. N is chosen to be nilpotent and such that the lefthand\nside has no monodromy. The lemma 9.2 assures that terms have at worst log growth. Since they are\nsingle-valued on D∗ , they extend to the origin.\n\u0003\nRemark 9.4. It is time to compare what we are calculating here with what a physicist computes according\nto Thm.(7.3). The transition is understood upon noticing that in our constructions of chains, we pick up the\nresidue from each exceptional divisor by computing the monodromy. In physics we iterate those residues as\niterated integrals. Below the top entry a1 this gives different rational weights to them in according with the\nscattering type formula of [6]. We discuss this below in section (9.1).\nR\nDefinition 9.5. With notation as above, the renormalized value σ ωΓ is the top entry in the column vector\n!\na1\nt\nexp(+N log\n)\n.. .\n2πi\n.\nR\nRemark 9.6. Note that the terms τ t ωΓ on the lefthand side of (9.11) may be calculated recursively. As\nV\nin lemma 9.2 above, V corresponds to a flag of core subgraphs of Γ. As in formula (9.7), the integral dies\nunless all the Γi //Γi+1 are log divergent. In this case, one gets\nYZ\nωΓi //Γi+1 .\n(9.12)\n(2πi)p−1\nt\nτP\n(Γ\n\ni //Γi+1 )\n\nIf, in addition, the subquotients Γi //Γi+1 are primitive, i.e. they are log divergent but have no divergent\nsubgraphs, then the integrals in (9.12) will converge as |t| → 0. Upto a term which is O(t) and can be\nignored in the limit, they may be replaced by their limits as t → 0. These entries in (9.11) may then be\ntaken to be constant.\n\nExample 9.7. Consider the dunce's cap fig.(2). It has 3 core subgraphs, but only the 2-edged graph γ with\nedges 1, 2 is log divergent. Thus, the column vector\n\u0012 in (9.11)\n\u0013 has 4 entries, but only 2 are non-zero. Dropping\n0 −1\nunnecessary rows and columns, the matrix N =\n. The constant entry in the column vector is\n0 0\nZ\nZ\n\u0010Z ∞\nΩ1\nΩ1\nda \u00112\n(9.13)\n2πi\n=\n2πi\n= 2πi.\n2\n2\n(a + 1)2\nσγ ψγ σΓ//γ ψΓ//γ\n0\n43\n\n\fIt remains to connect\n\nR\n\nσ\n\nωΓ to the physicists computation.\n\n9.1. lMHS vs ΦR . Let us understand how the period matrix pT = (a1 , a2 , * * * , ar ) which we have constructed connects to the coefficients cj\n(9.14)\n\nΦMOM (Γ)(q 2 /μ2 ) =\n\nr\nX\n\ncj (Γ) lnj q 2 /μ2 .\n\nj=1\n\nGoing to variables\ntΓ , a1 , . . . , a|Γ[1] | ,\nt1 , b1 , . . . , b|Γ1 [1] | ,\n\nX\n\nX\n\n...,\ntp , z1 , . . . , b|Γp [1] | ,\n\nai = 1,\n\nX\n\nbi = 1,\nzi = 1,\n\nfor a chain of core graphs Γp ( * * * ( Γ1 ( Γ gives, for each such flag and constant lower boundaries ǫ, an\niterated integral over\nZ ∞ Z ∞\nZ ∞\ndtp .\n(9.15)\ndt\ndt1 * * *\nǫ\n\nǫ/t/t1 ***/tp−1\n\nǫ/t\n\nAs the integral has a logarithmic pole along any ti integration, the difference between integrating against the\nchains, which only collect the coefficients of ln ǫ for each such integral, and the iteration above is a factorial\nfor each flag. A summation over all flags established the desired relation using tree factorials [14]:\nAs the entries in the vector (a1 , * * * )T are in one-to-one correspondence with forests of Γ, identifying a1 with\nthe empty forest, we can write the top-entry defined in Defn.(9.5) as\nX \u0012 ln t \u0013|[for]|\n(9.16)\na[for] ,\n2πi\n[for]\n\nwhere\n(9.17)\n\na[for] = p1 (Γ//[for])\n\nY\n\np1 (γj ),\n\nj\n\nusing the notation of Eqs.(7.14,7.62). Then,\n(9.18)\n\n∂ln t ΦMOM (Γ)(t) =\n\nX\n\naug(Γ)\n\n[for]\n\n\u0012\n\nln t\n∗\n[for] !\n\n\u0013|[for]|\n\na[for] .\n\nHere, [for]∗ ! is a forest factorial defined as follows. Any forest [for] defines a tree T and a collection of edges\n[1]\nC such that P C (T ) and RC (T ) denote the\nQcore sub- and co-graphs in question. The complement set T /C\n∗\ndefines a forest ∪i ti say. We set [for] ! = i ti !, for standard tree factorials ti ! [14]. For example, comparing\nthe two graphs\n(9.19)\nwe have the two vectors\n\n(9.20)\n\nΓ1 =\n\u0012\np\n 1\n\n\u0012\n\n p1\n\n\n\u0012\n\n p1\n\n\n\u0012\n\np1\n\n\n, Γ2 =\n\n\u0013\n\u0013\n\n,\n\n\u0013\np1\n\np1\n\n\u0012\n\n\u0013\n\n\u0012\n\np1\n\n44\n\n\u0013\n\n\u0012\n\n\u0013\n\n\u0013\n\np1\n\n\u0012\n\n\n\n\n\n\n\n\n\n\n\n\n\u0013 \n\n\n\fand\n\n\u0012\np\n 1\n\n\u0012\n\n p1\n\n\n\u0012\n\n p1\n\n\n\u0012\n\np1\n\n\n(9.21)\n\n\u0013\n\u0013\n\u0013\n\n\u0013\n\np1\np1\np1\n\n\u0012\n\u0012\n\u0012\n\n\u0013\n\u0013\n\n\u0013\n\np1\n\n\u0012\n\n\n\n\n\n\n\n\n.\n\n\n\n\u0013 \n\n\nHence, we find the same ln2 t term upon computing Eq.(9.16) for the monodromy.\nOn the other hand, the tree factorials deliver 1/2 for that term in the case of Γ1 , and 1 for Γ2 , while we\nget 2 in both cases for the term ∼ ln t. Indeed, the flag\n(\n\n(9.22)\n\n(\n\ncorresponds to a tree with two edges. The term ∼ ln2 t comes from the cut C which corresponds to both of\nthese edges. The complement is the empty cut, whose tree factorial is 3! simply. As we took a derivative\nwith respect to ln t, we get a factor of aug(Γ) = 3, which leaves us with a factor 3/3! = 1/2.\nFor\n\n, we note that the tree factorial is 3 instead of 3! (we have two flags instead of one), which\n\nleaves us with a factor 1.\n9.2. Limiting Mixed Hodge Structures. In this final paragraph at the suggestion of the referee we\noutline the structure of a limiting mixed Hodge structure associated to a variation of mixed Hodge structure\nand how it might apply to the Feynman graph amplitudes.\nLet Γ be a log divergent graph with n loops and 2n edges. The graph hypersurface XΓ : ψΓ = 0 is a\nhypersurface in P2n−1 , and the Feynman integrand represents a cohomology class\nhΩi\n∈ H 2n−1 (P2n−1 − XΓ , C) = H 2n−1 (P2n−1 − XΓ , Q) ⊗ C = HC = HQ ⊗ C.\n(9.23)\nψΓ2\nThe cohomology group has a mixed Hodge structure, which means there are defined two filtrations:\n(i) The weight filtration W∗ HQ which is defined over Q and increasing. It looks like\n(9.24)\n\n0 ⊂ W2n HQ ⊂ W2n+1 HQ ⊂ * * * ⊂ W4n−2 HQ = HQ .\n\nBlowing up on XΓ so it becomes a normal crossings divisor D∗ , there is a spectral sequence relating the\ngraded pieces W2n−1+i /W2n−1+i−1 to the Tate twist by −i of the cohomology in degree 2n − 1 −\nSi of the\nW\ncodimension i − 1 strata of D. (So, for example, gr2n\nis related to ⊕j H 2n−2 (Dj )(−1) where D = Dj .)\n(ii) The Hodge filtration F ∗ HC which is defined over C and decreasing:\n(9.25)\n\n(0) ⊂ F 2n−1 ⊂ F 2n−2 ⊂ * * * ⊂ F 1 = HC .\n\nThe filtrations are subject to the compatibility condition that the filtration\n.\n(9.26)\nF p (grqW ⊗ C) := F p HC ∩ Wq ⊗ C F p HC ∩ Wq−1 ⊗ C\n\nis the Hodge filtration of a pure Hodge structure of weight q. (This is simply the condition that F ∗ grqW ⊗ C\nq−p+1\n\nbe q-opposite to its complex conjugate, i.e. that grqW ⊗ C = F p ⊕ F\nfor any p.)\np\np+1\nLet us say that a class ω ∈ HC has Hodge level p if ω ∈ F HC − F\nHC . An important problem is\nto determine the Hodge level of the Feynman form (9.23). One may speculate that the Hodge level of the\nFeynman form equals the transcendental weight of the period. (The transcendental weight of a multizeta\nnumber ζ(n1 , . . . , np ) is the sum of the ni .) For example, in [4] one finds many examples of Feynman\namplitudes of the form ∗ζ(N ) where * is rational. In all known cases N = 2n − 3. To estimate the Hodge\nlevel, one may use theS\npole order filtration [7], 3.12. One blows up on XΓ ⊂ P2n−1 to replace X by a normal\nr\ncrossings divisor D = i=1 Di . Let ω on P2n−1 − XΓ be a (2n − 1)-form and let I ⊂ {1, . . . , r} be the indices\ni such that ω has a pole along Di . Write pi + 1 for the order of this pole, with pi ≥ 0. Then the Hodge level\n45\n\n\fP\nof ω is ≥ 2n − 1 − pi . (For a more precise statement, see op. cit.) For example, if XΓ is smooth (this\nhappens only when n = 1) one would get p1 = 1 so the Hodge level would be ≥ 2n − 2.\nProposition 9.8. For the Feynman form, at least 2 of the pi ≥ 1. The pole order calculation thus suggests\nthe Hodge level of the Feynman form above is ≤ 2n − 3.\nProof. The situation for n = 1 is trivial, so we assume n ≥ 2. The space of symmetric n × n-matrices has\ndimension d := n(n+1)\n. Let Pd−1 be viewed as the projectivized space of such matrices, so a point corresponds\n2\nto a matrix upto scale. The determinant of the universal matrix defines a hypersurface X ⊂ Pd−1 . More\ngenerally, we define Xp ⊂ Pd−1 to be the locus where the rank of the corresponding symmetric matrix is\nin Pd−1 . Points in Xp will\n≤ n − p. We have X = X1 , and it is easy to see that Xp has codimension p(p+1)\n2\nhave multiplicity ≥ p on X .\nThere is an inclusion ρ : P2n−1 ֒→ Pd−1 such that XΓ = X ∩ P2n−1 . Points of X2 ∩ P2n−1 will have\nmultiplicity ≥ 2 in XΓ and codimension ≤ 3 in P2n−1 . This means that in the local ring on P2n−1 at a\ngeneral point of X2 ∩ P2n−1 , there will be functions x1 , x2 , x3 which form part of a system of coordinates\non P2n−1 such that a local defining equation ψ for XΓ lies in (x1 , x2 , x3 )2 . We may construct our normal\ncrossings divisor D as above by first blowing up X2 ∩ P2n−1 in P2n−1 . Subsequent blowups will not affect\nthe pole order, which may be computed at the generic point of the exceptional divisor E. We have\n(9.27)\n\ndx1 dx2 dx3 * * *\nx2 dx1 d(x2 /x1 )d(x3 /x1 ) * * *\n= 14\n.\n2\nψ\nx1 φ(x1 , x2 /x1 , x3 /x1 , . . .)\n\nIt follows that the Feynman form has a double pole on E as well as a double pole on the strict transform of\nXΓ in the blowup.\n\u0003\nRemark 9.9. (i) To give a complete proof that the Hodge level is ≤ 2n − 3 one would have to show the\ndouble order pole was not killed by an exact form.\n(ii) It would be exciting to be able to say something about the weight filtration on H 2n−1 (P2n−1 − XΓ ).\n(iii) The data in [4] suggests that double zetas which occur will have transcendental weight 2n − 4. For\nexample, the bipartite graph Γ consisting of the 12 edges joining sets of 3 and 4 vertices has Feynman\namplitude a rational multiple of ζ(3, 5). In general, a calculation as above shows X3 ∩ P2n−1 has multiplicity\n≥ 3 and codimension ≤ 6. If one could show that for the bipartite Γ that this codimension drops to 5, then\nthe same argument as above would yield 3 poles with pi ≥ 1, suggesting a Hodge level 2n − 4.\nNext we should consider the mixed Hodge structure necessary for the relative period calculation. Recall\n(3.3) we work in a toric blowup P = P (Γ) → P2n−1 . Let B ⊂ P be the complement of the big toric orbit in\nP . It is the union of the strict transform of the coordinate divisor ∆ ⊂ P2n−1 and the exceptional divisors.\nLet Y ⊂ P be the strict transform of XΓ . The relevant cohomology group is the middle group in the sequence\n(9.28)\n\nH 2n−2 (B − Y ∩ B; Q) → H 2n−1 (P − Y, B − Y ∩ B; Q) → H 2n−1 (P − Y, Q).\n\nIf all the subgraphs Γ′ ( Γ have sdd(Γ′ ) < 0, then renormalization is unnecessary. The Feynman amplitude\nas we have defined it is simply a period of the mixed Hodge structure (9.28). The weight filtration for the\ngroup on the left involves the cohomology of the strata of the normal crossings divisor B. For example, we\nhave an exact sequence\n(9.29)\n\nH 0 (B(1) − Y ∩ B(1) , Q) → H 0 (B(0) − Y ∩ B(0) , Q) → W0 H 2n−2 (B − Y ∩ B(0) , Q).\n\nHere we write B(i) for the disjoint union of the components of the strata of dimension i. We know from\ncorollary 5.3 that Y ∩ B(0) = ∅, and a bit of thought about the combinatorics of B(i) , i = 0, 1 reveals that\nW0 H 2n−2 (B − Y ∩ B, Q) = Q(0). This gives a map of the trivial Hodge structure Q(0) to our period motive:\n(9.30)\n\nQ(0) → H 2n−1 (P − Y, B − Y ∩ B; Q).\n\nWhen the period is a rational multiple of ζ(2n − 3) we expect that there is a map of Hodge structures\nQ(3 − 2n) → H 2n−1 (P2n−1 − XΓ , Q) and that the extension of Q(3 − 2n) by Q(0) associated to ζ(2n − 3) is\na subquotient of (9.28).\nFinally the main focus of this paper has been the renormalization case when one or more proper subgraphs\nof Γ has sdd = 0. In this case, the Feynman form will have a pole along one or more divisor in B, so (9.28)\nis no longer the relevant Hodge structure. In this case, we work with the limiting mixed Hodge structure\n46\n\n\f2n−1\nHlim associated to Ht := H 2n−1 (P\n− XΓ , ∆t − ∆t ∩ XΓ ). Let D be a small disk around t = 0, and\nS\n∗\nlet D = D − {0}. Then HD∗ = t6=0 Ht becomes a local system on D∗ . Let HD∗ = HD∗ ⊗ OD∗ be the\ncorresponding analytic bundle. If we untwist by the monodromy, we get a trivial local system (h = dim Ht )\n∼ exp(−N log t)HD∗ ⊂ HD∗ .\n(9.31)\nCh ∗ =\nD\n\nSince this local system is trivial, it extends (trivially) across t = 0. It also has a canonical Q-structure\ndefined from the Q-structure at any point t0 6= 0. The analytic bundle HD∗ has a Hodge filtration F ∗ HD∗\ncoming from the Hodge filtrations on the Ht . (Note the Hodge filtration is not horizontal, so there is no\nHodge filtration on the local system HD∗ .) From (9.31) we get a canonical trivialization of the analytic\nh\nbundle HD∗ ∼\n= OD\n∗ and hence a canonical extension across t = 0. One can show [5], 2.1(i) that the Hodge\nfiltration extends across t = 0 as well.\nThus, on the fibre H0 we have a Hodge filtration and a Q-structure. If you think in terms of periods,\n∨\ni.e. using the pairing H0,Q\n× H0 → C, the above description of the Hodge filtration as a limit across t = 0\ncoincides with the computation (9.11). What we have not given is the weight filtration. This monodromy\nweight or limiting weight filtration is more subtle, essentially being determined by the endomorphism N\ntogether with the given weight filtrations on the fibres Ht . We hope that the computation of N in this\npaper will help to understand this structure, but at the moment the weight structures on the Ht are not\nwell enough understood to say more. For the general theory, the interested reader is referred to [5] and the\nreferences cited there.\n\n47\n\n\fReferences\n[1] Bestvina, M., and Feighn, M., The topology at infinity of Out(Fn ), Inv. Math. 140, no. 3, (2000), pp. 651-692.\n[2] Bloch, S, Esnault, H., and Kreimer, D., On Motives Associated to Graph Polynomials, Comm. Math. Phys. 267 (2006),\n181-225.\n[3] Bergbauer, C., and Kreimer, D., Hopf algebras in renormalization theory: locality and Dyson-Schwinger equations from\nHochschild cohomology, IRMA Lect.Math.Theor.Phys. 10 (2006) 133-164; hep-th/0506190.\n[4] Broadhurst, D.J., and Kreimer, D., Association of multiple zeta values with positive knots via Feynman diagrams up to 9\nloops, Phys. Lett.B 393 (1997) 403.\n[5] Cattani, E., and Kaplan, A., Degenerating variations of Hodge structure, in Théorie de Hodge, Asterisque 179-180 (1989),\npp. 67-96.\n[6] Connes, A., and Kreimer, D., Renormalization in quantum field theory and the Riemann-Hilbert problem II: the β-function,\ndiffeomorphisms and the renormalization group, Commun. Math. Phys. 216 (2001) 215-241.\n[7] Deligne, P., Equations Différentielles à Points singuliers Réguliers, SLN 163, Springer (1970).\n[8] Esnault, H., Schechtman, V., Viehweg, E.: Cohomology of local systems on the complement of hyperplanes. Invent. math.\n109 (1992), 557–561. Erratum: Invent.math. 112 (1993), 447.\n[9] Fulton, W.: Introduction to Toric Varieties, Annals of Math. Studies 131, Princeton University Press (1993).\n[10] Itzykson, J.-C., Zuber, J.-B., Quantum Field Theory. Mc-Graw-Hill, 1980.\n[11] Kontsevich, M., Zagier, D., Periods, in Mathematics Unlimited- 2001 and Beyond, edited by W. Schmid and Björn Engquist,\nSpringer (2001).\n[12] Kreimer, D., On overlapping Divergences, Commun.Math.Phys. 204 (1999) 669, arXiv:hep-th/9810022.\n[13] Kreimer, D., On the Hopf algebra structure of perturbative quantum field theories, Adv.Theor.Math.Phys.2 (1998) 303–334,\narXiv:q-alg/9707029.\n[14] Kreimer, D., Chen's iterated integral represents the OPE, Adv.Theor.Math.Phys.3 (1999) 627-670, arXiv:hep-th/9901099.\n[15] Kreimer, D., Dyson Schwinger equations: From Hopf algebras to number theory, Fields Inst.Commun.50 (2007) 225–248,\narXiv:hep-th/0609004.\n[16] Kreimer, D., and Yeats, K., Recursion and growth estimates in renormalizable quantum field theory, Commun.Math.Phys.279 (2008) 401–427, arXiv:hep-th/0612179.\n[17] Kreimer, D., and Yeats, K., An Etude in non-linear Dyson-Schwinger Equations, Nucl.Phys.Proc.Suppl.160 (2006) 116–\n121, arXiv:hep-th/0605096.\n[18] Looijenga, E., Cellular decompositions of compactified moduli spaces of pointed curves. The moduli space of curves (Texel\nIsland, 1994), 369–400, Progr. Math., 129, Birkhuser Boston, Boston, MA, (1995).\n[19] Oda, T.: Convex Bodies and Algebraic Geometry, Springer Verlag (1985).\n[20] Sokal, A., The multivariate Tutte polynomial for graphs and matroids, in \"Surveys in Combinatorics, 2005\", edited by\nBridget S. Webb (Cambridge University Press, 2005), pp. 173-226, arXiv.math.CO/0503607.\n[21] Smirnov, V., Evaluating Feynman Integrals, Springer Tracts in Modern Physics 211. Berlin, Springer. ix, 247p. (2004).\n[22] Todorov, I., Analytic Properties of Feynman Diagrams in Quantum Field Theory, Monographs in Natural Philosophy 38,\nPergamon Press (1971).\nDept. of Mathematics, University of Chicago, Chicago, IL 60637, USA, E-mail address: bloch@math.uchicago.edu\nCNRS-IHES, 91440 Bures sur Yvette, France and Center for Math. Phys. Boston U., Boston, MA 02215, E-mail\naddress: kreimer@ihes.fr\n\n48\n\n\f"}