{"id": "http://arxiv.org/abs/0706.4198v1", "guidislink": true, "updated": "2007-06-28T11:04:31Z", "updated_parsed": [2007, 6, 28, 11, 4, 31, 3, 179, 0], "published": "2007-06-28T11:04:31Z", "published_parsed": [2007, 6, 28, 11, 4, 31, 3, 179, 0], "title": "Cosmological constraints on neutrino plus axion hot dark matter", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0706.3447%2C0706.0885%2C0706.1942%2C0706.1812%2C0706.2089%2C0706.0978%2C0706.0877%2C0706.1825%2C0706.4011%2C0706.2543%2C0706.1720%2C0706.1571%2C0706.2153%2C0706.4461%2C0706.0968%2C0706.0044%2C0706.0387%2C0706.4104%2C0706.0996%2C0706.4058%2C0706.0746%2C0706.3524%2C0706.4174%2C0706.0282%2C0706.4101%2C0706.2297%2C0706.2321%2C0706.1997%2C0706.1516%2C0706.2152%2C0706.2963%2C0706.3763%2C0706.1839%2C0706.0822%2C0706.0146%2C0706.3498%2C0706.0831%2C0706.4295%2C0706.0547%2C0706.1125%2C0706.3145%2C0706.0742%2C0706.2439%2C0706.1063%2C0706.4176%2C0706.1722%2C0706.3178%2C0706.0334%2C0706.1854%2C0706.3618%2C0706.1420%2C0706.3502%2C0706.2337%2C0706.0640%2C0706.0354%2C0706.1660%2C0706.4129%2C0706.1089%2C0706.3081%2C0706.1834%2C0706.0739%2C0706.0925%2C0706.4245%2C0706.0406%2C0706.2642%2C0706.4072%2C0706.3157%2C0706.2778%2C0706.1730%2C0706.2154%2C0706.4198%2C0706.3477%2C0706.2020%2C0706.1019%2C0706.1389%2C0706.0622%2C0706.2150%2C0706.4255%2C0706.0849%2C0706.4334%2C0706.3161%2C0706.1876%2C0706.1284%2C0706.0756%2C0706.2506%2C0706.2820%2C0706.2103%2C0706.2370%2C0706.1345%2C0706.3545%2C0706.1219%2C0706.0226%2C0706.0861%2C0706.3116%2C0706.1446%2C0706.1652%2C0706.3780%2C0706.0255%2C0706.2477%2C0706.0032%2C0706.1015&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Cosmological constraints on neutrino plus axion hot dark matter"}, "summary": "We use observations of the cosmological large-scale structure to derive\nlimits on two-component hot dark matter consisting of mass-degenerate neutrinos\nand hadronic axions, both components having velocity dispersions corresponding\nto their respective decoupling temperatures. We restrict the data samples to\nthe safely linear regime, in particular excluding the Lyman-alpha forest. Using\nstandard Bayesian inference techniques we derive credible regions in the\ntwo-parameter space of m_a and sum(m_nu). Marginalising over sum(m_nu) provides\nm_a < 1.2 eV (95% C.L.). In the absence of axions the same data and methods\ngive sum(m_nu) < 0.65 eV (95% C.L.). We also derive limits on m_a for a range\nof axion-pion couplings up to one order of magnitude larger or smaller than the\nhadronic value.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0706.3447%2C0706.0885%2C0706.1942%2C0706.1812%2C0706.2089%2C0706.0978%2C0706.0877%2C0706.1825%2C0706.4011%2C0706.2543%2C0706.1720%2C0706.1571%2C0706.2153%2C0706.4461%2C0706.0968%2C0706.0044%2C0706.0387%2C0706.4104%2C0706.0996%2C0706.4058%2C0706.0746%2C0706.3524%2C0706.4174%2C0706.0282%2C0706.4101%2C0706.2297%2C0706.2321%2C0706.1997%2C0706.1516%2C0706.2152%2C0706.2963%2C0706.3763%2C0706.1839%2C0706.0822%2C0706.0146%2C0706.3498%2C0706.0831%2C0706.4295%2C0706.0547%2C0706.1125%2C0706.3145%2C0706.0742%2C0706.2439%2C0706.1063%2C0706.4176%2C0706.1722%2C0706.3178%2C0706.0334%2C0706.1854%2C0706.3618%2C0706.1420%2C0706.3502%2C0706.2337%2C0706.0640%2C0706.0354%2C0706.1660%2C0706.4129%2C0706.1089%2C0706.3081%2C0706.1834%2C0706.0739%2C0706.0925%2C0706.4245%2C0706.0406%2C0706.2642%2C0706.4072%2C0706.3157%2C0706.2778%2C0706.1730%2C0706.2154%2C0706.4198%2C0706.3477%2C0706.2020%2C0706.1019%2C0706.1389%2C0706.0622%2C0706.2150%2C0706.4255%2C0706.0849%2C0706.4334%2C0706.3161%2C0706.1876%2C0706.1284%2C0706.0756%2C0706.2506%2C0706.2820%2C0706.2103%2C0706.2370%2C0706.1345%2C0706.3545%2C0706.1219%2C0706.0226%2C0706.0861%2C0706.3116%2C0706.1446%2C0706.1652%2C0706.3780%2C0706.0255%2C0706.2477%2C0706.0032%2C0706.1015&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We use observations of the cosmological large-scale structure to derive\nlimits on two-component hot dark matter consisting of mass-degenerate neutrinos\nand hadronic axions, both components having velocity dispersions corresponding\nto their respective decoupling temperatures. We restrict the data samples to\nthe safely linear regime, in particular excluding the Lyman-alpha forest. Using\nstandard Bayesian inference techniques we derive credible regions in the\ntwo-parameter space of m_a and sum(m_nu). Marginalising over sum(m_nu) provides\nm_a < 1.2 eV (95% C.L.). In the absence of axions the same data and methods\ngive sum(m_nu) < 0.65 eV (95% C.L.). We also derive limits on m_a for a range\nof axion-pion couplings up to one order of magnitude larger or smaller than the\nhadronic value."}, "authors": ["Steen Hannestad", "Alessandro Mirizzi", "Georg G. Raffelt", "Yvonne Y. Y. Wong"], "author_detail": {"name": "Yvonne Y. Y. Wong"}, "author": "Yvonne Y. Y. Wong", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1088/1475-7516/2007/08/015", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0706.4198v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0706.4198v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "13 pages, 2 figures, uses iopart.cls", "arxiv_primary_category": {"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "hep-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0706.4198v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0706.4198v1", "journal_reference": "JCAP 0708:015,2007", "doi": "10.1088/1475-7516/2007/08/015", "fulltext": "MPP-2007-81\n\narXiv:0706.4198v1 [astro-ph] 28 Jun 2007\n\nCosmological constraints on neutrino plus axion hot\ndark matter\nS. Hannestad1 , A. Mirizzi2 , G. G. Raffelt2 and Y. Y. Y. Wong2\n1\n\nDepartment of Physics and Astronomy\nUniversity of Aarhus, DK-8000 Aarhus C, Denmark\n2\nMax-Planck-Institut für Physik (Werner-Heisenberg-Institut)\nFöhringer Ring 6, D-80805 München, Germany\nE-mail: sth@phys.au.dk, amirizzi@mppmu.mpg.de, raffelt@mppmu.mpg.de and\nywong@mppmu.mpg.de\nAbstract. We use observations of the cosmological large-scale structure to derive\nlimits on two-component hot dark matter consisting of mass-degenerate neutrinos and\nhadronic axions, both components having velocity dispersions corresponding to their\nrespective decoupling temperatures. We restrict the data samples to the safely linear\nregime, in particular excluding the Lyman-α forest. Using standard Bayesian inference\nP\ntechniques we derive credible regions in the two-parameter space of ma and\nmν .\nP\nMarginalising over\nmν provides ma < 1.2 eV (95% C.L.). In the absence of axions\nP\nthe same data and methods give mν < 0.65 eV (95% C.L.). We also derive limits on\nma for a range of axion–pion couplings up to one order of magnitude larger or smaller\nthan the hadronic value.\n\n\fCosmological constraints on neutrino plus axion hot dark matter\n\n2\n\n1. Introduction\nThe masses of the lightest known particles (neutrinos) are best constrained by the largest\nknown scales (the entire universe). The well-established method of using cosmological\nprecision data to constrain the cosmic hot dark matter fraction [1, 2] has been extended\nto hypothetical low-mass particles, notably to axions, in several papers [3–5].\nWe return to this topic to extend previous studies by some of us [3, 4] in several\nways. First, we update the cosmological data sets to include the Wilkinson Microwave\nAnisotropy Probe 3-year data as well as the baryon acoustic oscillations measurements\nfrom the Sloan Digital Sky Survey that have since become available. Second, we\nuse standard Bayesian inference techniques to construct credible regions in parameter\nspace, in contrast to the likelihood maximisation method used before [3, 4]. Most\nimportantly, we consider a two-component hot dark matter fraction consisting of axions\nand neutrinos. Since neutrinos are known to have nonvanishing masses, their hotdark matter contribution is an unavoidable cosmological fit parameter. Axions and\nneutrinos decouple at different epochs and thus have different velocity dispersions that\nwe implement self-consistently. In this regard our work parallels a recent study by\nanother group [5].\nWe begin in section 2 with a brief summary of the relevant axion parameters and\ntheir decoupling conditions. In section 3 we describe the cosmological model and the\nparameter space we use. In section 4 we summarise the included data sets and briefly\ndiscuss our reasons for limiting the analysis to data in the safely linear regime of structure\nformation. We derive our new constraints in section 5 before concluding in section 6.\n2. Hot dark matter axions\nThe Peccei–Quinn solution of the CP problem of strong interactions predicts the\nexistence of axions, low-mass pseudoscalars that are very similar to neutral pions, except\nthat their mass and interaction strengths are suppressed by a factor of order fπ /fa , where\nfπ ≈ 93 MeV is the pion decay constant, and fa a large energy scale, the axion decay\nconstant or Peccei–Quinn scale [6]. In more detail, the axion mass is\n6.0 eV\nz 1/2 fπ mπ\n= Ca\n,\nma = Ca\n1 + z fa\nfa /106 GeV\n\n(2.1)\n\nwhere z = mu /md is the mass ratio of the up and down quarks. We will follow the\nprevious axion literature and assume a value z = 0.56 [7, 8], but we note that it could\nvary in the range 0.3–0.6 [9]. Because of this uncertainty and to cover more general\ncases we will sometimes include a fudge factor Ca with the standard value 1. We will\nconsider cases with −1 < log10 (Ca ) < +1.\nA large range of fa values (or, equivalently, ma values) can be excluded by\nexperiments and by astrophysical and cosmological arguments [10]. Axions with\na mass of order 10 μeV could well be the cold dark matter of the universe [11]\nand if so will be found eventually by the ongoing ADMX experiment provided that\n\n\fCosmological constraints on neutrino plus axion hot dark matter\n\n3\n\n1 μeV < ma < 100 μeV [12]. In addition, a hot axion population is produced by thermal\nprocesses [13–15]. Axions attain thermal equilibrium at the QCD phase transition or\n< 108 GeV, erasing the cold axion population produced earlier and providing\nlater if fa ∼\na hot dark matter component instead.\n< 109 GeV is excluded by the supernova SN 1987A neutrino burst\nIn principle, fa ∼\nduration [10]. However, the sparse data sample, our poor understanding of the nuclear\nmedium in the supernova interior, and simple prudence suggest that one should not\nbase far-reaching conclusions about the existence of axions in this parameter range on\na single argument or experiment alone. Therefore, it remains important to tap other\nsources of information, especially if they are easily available.\nFor those axion models with nonvanishing couplings to charged fermions, there exist\nstellar energy loss limits based on the axion–electron coupling that are competitive with\nthe SN 1987A constraints so that here one does not rely on a single argument to exclude\n< 109 GeV range. Therefore, we focus on hadronic models where axions\naxions in the fa ∼\ndo not directly couple to ordinary quarks and leptons. In this class of models all axion\nproperties depend on fa alone and not on model-dependent Peccei–Quinn charges of the\nordinary quarks and leptons.\nIf axions do not couple to charged leptons, the main thermalisation process in the\npost-QCD epoch is [13]\na+π ↔ π+π.\n\n(2.2)\n\nThe axion–pion interaction is given by a Lagrangian of the form [13]\nLaπ =\n\n\u0011\nCaπ \u0010 0 +\nπ π ∂μ π − + π 0 π − ∂μ π + − 2π + π − ∂μ π 0 ∂μ a .\nfπ fa\n\nIn hadronic axion models, the coupling constant is [13]\n1−z\nCaπ =\n.\n3 (1 + z)\n\n(2.3)\n\n(2.4)\n\nWe note that in general the chiral symmetry-breaking Lagrangian gives rise to an\nadditional piece for Laπ proportional to (m2π /fπ fa ) (π 0 π 0 + 2π − π + ) π 0 a. However, for\nhadronic axion models this term vanishes identically, in contrast, for example, to the\nDFSZ model (Roberto Peccei, private communication).\nBased on the axion–pion interaction, the axion decoupling temperature in the early\nuniverse was calculated by some of us in Ref. [4], where all relevant details are reported.\nIn our standard case we use the axion mass ma as our primary parameter from which\nwe derive the corresponding axion–pion interaction strength by virtue of equations (2.1)\nand (2.2). Noting that even in hadronic axion models there is some uncertainty in this\nrelationship due to the uncertain quark-mass ratio z, we consider also more general cases\nin which we include a fudge factor Ca as defined in equation (2.1), thus allowing for a\nmore general relationship between ma and Caπ .\n\n\fCosmological constraints on neutrino plus axion hot dark matter\n\n4\n\nTable 1. Priors and standard values for the cosmological fit parameters considered in\nthis work. All priors are uniform in the given intervals (i.e., top hat).\nParameter\n\nStandard\n\nPrior\n\nωdm\nωb\nh\nτ\nln(1010 As )\nns\nP\nmν [eV]\nma [eV]\nlog10 (Ca )\n\n-\n-\n-\n-\n-\n-\n0\n0\n0\n\n0.01–0.99\n0.005–0.1\n0.4–1.0\n0.01–0.8\n2.7–4.0\n0.5–1.5\n0–20\n0–20\n−1–1\n\n3. Cosmological model\nWe consider a cosmological model with vanishing spatial curvature and adiabatic initial\nconditions, described by nine free parameters,\nθ = {ωdm , ωb , H0 , τ, ln(1010 As ), ns ,\n\nX\n\nmν , ma , log10 (Ca )}.\n\n(3.1)\n\nHere, ωdm = Ωdm h2 is the physical dark matter density, ωb = Ωb h2 the baryon density,\nH0 = h 100 km s−1 Mpc−1 the Hubble parameter, τ the optical depth to reionisation,\nAs the amplitude of the primordial scalar power spectrum, and ns its spectral index.\nThese six parameters represent the simplest parameter set necessary for a consistent\ninterpretation of the currently available data.\nP\nIn addition, we allow for a nonzero sum of neutrino masses mν , a nonvanishing\naxion mass ma , and a fudge factor Ca relating ma to fa as defined in equation (2.1).\nThese extra parameters will be varied one at a time, as well as in combination. Their\n\"standard\" values are given in table 1, along with the priors for all cosmological fit\nparameters considered here.\n4. Data\n4.1. Cosmic microwave background (CMB)\nWe use CMB data from the Wilkinson Microwave Anisotropy Probe (WMAP) experiment after three years of observation [16–18]. The data analysis is performed using\nversion 2 of the likelihood calculation package provided by the WMAP team on the\nLAMBDA homepage [19].\n4.2. Large scale structure (LSS)\nWe use the large-scale galaxy power spectra Pg (k) inferred from the luminous red galaxy\n(LRG) sample of the Sloan Digital Sky Survey (SDSS) [20, 21] and from the Twodegree Field Galaxy Redshift Survey (2dF) [22]. These power spectra are related to the\n\n\fCosmological constraints on neutrino plus axion hot dark matter\n\n5\n\nunderlying matter power spectrum Pm (k) via Pg (k) = b2 (k)Pm (k), where the galaxy bias\nb(k) is conventionally assumed to be constant with respect to k over the scales probed\nby galaxy clustering surveys.\nHowever, recent studies suggest that this assumption may break down beyond\nk ∼ 0.1 h Mpc−1 , and may source the apparent tension between the SDSS and the\n2dF-inferred galaxy power spectra [20, 23]. To model the effects of scale-dependent\nbiasing when extracting cosmological parameters from galaxy clustering data, both the\nSDSS-LRG and the 2dF teams advocate the use of the Qnl fitting formula developed in\nRef. [22] for ΛCDM cosmologies. See Ref. [24] for a detailed discussion.\nIn the present work, however, we take the view that fitting formulae developed\nfor standard cosmologies may not be applicable in nonstandard scenarios, particularly\nthose involving new length scales arising from, e.g., axion and neutrino free-streaming.\nDeveloping an alternative formula to properly handle these nonstandard effects on\nthe galaxy bias is also beyond our present scope. We therefore adopt a conservative\napproach, and use only power spectrum data well below k ∼ 0.1 h Mpc−1 , where a\nscale-independent bias is likely to hold true:\n• 2dF, kmax ∼ 0.09 h Mpc−1 (17 bands),\n• SDSS-LRG, kmax ∼ 0.07 h Mpc−1 (11 bands).\nThe combined set of these data is denoted LSS. We assume a scale-independent bias for\neach data set, and marginalise analytically over each bias parameter b2 with a flat prior.\n4.3. Baryon acoustic oscillations (BAO)\nThe baryon acoustic oscillations peak has been measured in the SDSS luminous red\ngalaxy sample [25]. We use all 20 points in the two-point correlation data set\nsupplied in Ref. [25] and the analysis procedure described therein, including power\nspectrum dewiggling, nonlinear corrections with the Halofit package [26], corrections\nfor redshift-space distortion, and analytic marginalisation over the normalisation of the\ncorrelation function.\n4.4. Type Ia supernovae (SNIa)\nWe use the luminosity distance measurements of distant type Ia supernovae provided\nby Davis et al. [27]. This sample is a compilation of supernovae measured by the\nSupernova Legacy Survey (SNLS) [28], the ESSENCE project [29], and the Hubble\nSpace Telescope [30], as well as a set of 45 nearby supernovae. In total the sample\ncontains 192 supernovae.\n4.5. Lyman-α forest (Lyα)\nMeasurements of the flux power spectrum of the Lyman-α forest has been used to\nreconstruct the matter power spectrum on small scales at large redshifts. By far the\n\n\fCosmological constraints on neutrino plus axion hot dark matter\nTable 2. 1D marginal 95% upper bounds on\nof data sets and models.\nData set\nWMAP+LSS+SNIa\nWMAP+LSS+SNIa+BAO\nP\nFixed\nmν = 0\nWMAP+LSS+SNIa+BAO\n\nP\n\nmν and ma for several different choices\n\nCa prior\nlog10 (Ca ) = 0\n\nFixed ma = 0\nWMAP+LSS+SNIa+BAO\nWMAP+LSS+SNIa\nWMAP+LSS+SNIa+BAO\n\n6\n\n−1 < log10 (Ca ) < 1\n\nP\n\nmν [eV]\n\nma [eV]\n\n0.63\n0.59\n\n2.0\n1.2\n\n-\n\n1.4\n\n0.65\n\n-\n\n0.61\n0.60\n\n2.2\n1.1\n\nlargest sample of spectra comes from the SDSS survey. This data set was carefully\nanalysed in McDonald et al. [31] and used to constrain the linear matter power\nspectrum. The derived linear fluctuation amplitude at k = 0.009 km s−1 and z = 3 is\n+0.06\n∆2 = 0.452+0.07\n−0.06 , and the effective spectral index neff = −2.321−0.05 . These results were\nderived using a very elaborate model of the local intergalactic medium in conjunction\nwith hydrodynamic simulations.\nWhile the Lyα data provide in principle a very powerful probe of the fluctuation\namplitude on small scales, the question remains as to the level of systematic uncertainty\nin the result. The same data have been reanalysed by Seljak et al. [32] and Viel et al. [33–\n35], with somewhat different results. Specifically, the normalisation found in Refs. [33–\n35] is lower than that reported in Ref. [31].\nThis question of normalisation is particularly important for bounds on the hot\ndark matter content of the universe. Since the free-streaming scale of light neutrinos\nor axions is larger than the length scale probed by Lyα, their effect on the Lyα data\namounts to an overall change in the normalisation that is completely degenerate with\nany possible shift due to systematics. The Lyα analysis in Ref. [31] already points\nto a higher fluctuation amplitude ∆2 than that derived from the WMAP 3-year data;\nthe addition of a hot dark matter component will render the two data sets even less\ncompatible. This incompatibility in turn leads to a much stronger formal bound on the\nmass of the hot dark matter particle than would be expected considering the sensitivity\nof the present data (this is true for both neutrinos and other types of hot dark matter,\nsuch as axions).\nThese considerations suggest that the Lyα data are at present dominated by\nsystematic effects. We therefore refrain from using them in the present analysis.\n5. Results\nWe use standard Bayesian inference techniques, and explore the model parameter space\nwith Monte Carlo Markov Chains (MCMC) generated using the publicly available\n\n\fCosmological constraints on neutrino plus axion hot dark matter\n\n7\n\nP\nFigure 1. 2D marginal 68% and 95% contours in the\nmν -ma plane derived from\nthe full data set WMAP+LSS+BAO+SNIa. The blue/solid lines correspond to the\nfudge factor being fixed at log10 (Ca ) = 0, while the red/dashed lines indicate a top-hat\nprior on Ca in the interval −1 < log10 (Ca ) < 1.\n\nCosmoMC package [36, 37]. Our results are summarised in tables 2 and 3, and figures 1\nand 2.\nP\nFor the case of a standard hadronic axion our bounds on mν and ma are tabulated\nin table 2. When BAO data are included our bounds are almost identical to those\nrecently derived in Ref. [5] based on their conservative data set. The main difference is\nthat we do not use the HST prior on h, but instead include the SDSS-BAO data. Since\nthe BAO data break the Ωm -h degeneracy, their inclusion has much the same effect as\nadding the HST prior. The importance of BAO data for the bound can be seen by the\nfact that the 95% upper bound is reduced from 2.0 eV to 1.2 eV. Our complete SNIa\ndata set is also somewhat larger than the SNLS data set used in Ref. [5], containing in\naddition data from the GOODS and ESSENCE surveys. However, this has only a very\nmodest impact on our results.\nP\nOur neutrino mass bound mν < 0.65 eV (95% C.L.) in the absence of axions\nis identical to that derived by some of us in Ref. [4], whereas the axion mass limit\nma < 1.4 eV in the absence of neutrino masses found here is significantly weaker\nthan the 1.05 eV limit found earlier [4]. The agreement of the neutrino mass limits is\ncoincidental because here we use different data, notably excluding the Lyman-α forest,\nand a different statistical methodology (marginalisation instead of maximisation). The\nrelative difference between the limits can be interpreted such that the axion bound\n\n\fCosmological constraints on neutrino plus axion hot dark matter\n\n8\n\nFigure 2. 2D marginal 68% and 95% contours in the ma -log10 (Ca ) plane, assuming\na top-hat prior on the fudge factor in the interval −1 < log10 (Ca ) < 1.\n\nbenefits more from the inclusion of small-scale data than the neutrino mass bound,\npresumably because axions freeze out earlier and thus have a smaller velocity dispersion.\nIncluding the Lyα data here would strongly improve both limits as can be gleaned from\nthe results of Ref. [5]. Adding Lyα to their conservative data set, the analysis of Ref. [5]\nfinds that the marginalised axion mass limit improves by a factor 0.30, whereas the\nmarginalised neutrino mass limit improves only by a factor 0.36, i.e., the relative gain\nfor axions is 20% stronger. The changes in our new limits relative to those of Ref. [4]\nare in agreement with this picture.\nReturning to our new limits, an important observation is that the upper bound on\nthe sum of neutrino masses is largely independent of whether or not massive axions are\nP\npresent. The 95% upper limit on mν is in either case approximately 0.6 eV, a bound\nvery close to that found in previous studies using roughly the same data combination\n[38–41].\nIn figure 2 we show how the bound on the axion mass changes as Ca is allowed\nto vary up or down by up to a factor of 10, assuming a uniform prior on log10 (Ca )\nbetween −1 and +1. Note that the figure shows the 2D marginal contours, i.e., Ca and\nma are fitted simultaneously. For log10 (Ca ) ≤ 0, the bound on ma does not depend on\nCa because the number of degrees of freedom at decoupling, g∗ (TD ), is approximately\nconstant for a large range of fa values (see table 2 of Ref. [4]). For log10 (Ca ) > 0, the\nvalue of g∗ (TD ) increases significantly with increasing Ca for a given ma . This increase\n\n\fCosmological constraints on neutrino plus axion hot dark matter\n\n9\n\nP\nTable 3. 1D marginal 68%/95% upper bounds on mν and ma for fixed fudge factors\nCa . The data set used is WMAP+LSS+SNIa+BAO.\nP\nlog10 (Ca )\nmν [eV]\nma [eV]\n−1.0\n0.0\n1.0\n\n0.39/0.64\n0.37/0.59\n0.40/0.63\n\n0.51/0.98\n0.60/1.2\n0.69/1.4\n\nin g∗ (TD ) leads to a corresponding drop in the present axion number density,\nna =\n\ng∗ (today) nγ\n× .\ng∗ (TD )\n2\n\n(5.1)\n\nFor a fixed ma this amounts to a decrease in the ratio Ωa /Ωm with increasing Ca . The\nbound on ma therefore becomes correspondingly weaker.\nAs can be seen in figure 2, the 2D marginal 95% upper limit on ma stays roughly\n< 1.1 eV when log10 (Ca ) ≤ 0, and increases roughly linearly with\nconstant at ma ∼\nlog10 (Ca ) to about 1.4 eV at log10 (Ca ) = 1. We stress again that the ma bounds in\nthis figure are 2D bounds, and are formally-and often also in practice-not equivalent\nto 1D bounds on ma derived under the assumption of a fixed Ca . For instance, the 2D\nbound on ma at Ca = 1 in figure 2 is not exactly identical to the 1D bound quoted\nin table 2 for a fixed Ca = 1. However, despite this formality, the ma -log10 (Ca ) trend\nobserved in figure 2 is also evident in table 3, which shows the 1D marginal 68% and\n95% bounds on ma for fixed values of Ca .\nFinally, we note that if Ca is increased much beyond 10, the bound will deteriorate\nrapidly because axion decoupling will have occurred beyond the QCD phase transition.\n6. Conclusions\nWe have updated previous limits from cosmological structure formation on the mass of\nhot dark matter axions. This limit applies to axions which were thermalised, mainly by\naxion–pion interactions, in the early universe, and which subsequently decoupled from\nthe thermal plasma while still relativistic.\nIn the present study we investigate both the case where the neutrinos can be\nregarded as massless, as well as the case in which massive neutrinos are also allowed to\ncontribute significantly to the hot dark matter fraction. In both cases we find an upper\n95% limit on the mass of hadronic axions of 1.1–1.2 eV when all available cosmological\ndata, except the Lyman-α forest, are used. Reassuringly, we find that the bound on\nthe sum of neutrino masses is almost completely unaffected by the presence of hot dark\nmatter axions.\nBecause of the uncertainty in the relation between the axion mass ma and the energy\nscale fa , we have also studied the case in which the relation ma = 6.0 eV/(fa /106 GeV)\nis modified by a fudge factor Ca . We have studied Ca in the range 0.1–10, which is fairly\nrepresentative of the model uncertainties. We find that the axion mass bound is largely\n\n\fCosmological constraints on neutrino plus axion hot dark matter\n\n10\n\nstable with respect to varying Ca in this range. For fixed values of Ca , the 1D marginal\nbound on ma goes from 0.98 eV at Ca = 0.1 to 1.4 eV at Ca = 10. Essentially, this\nmeans that for hadronic axion models the uncertainty of the light quark mass ratios\nhave a negligible impact on the axion mass limit.\nExperimental and astrophysical limits on ma or fa are always derived from limits\non the axion coupling to different particles. The cosmological hot dark matter limit,\nin contrast, primarily constrains the axion mass, with a very weak dependence on the\n< 1 eV is very similar to the limit\naxion–pion coupling. The hot dark matter limit of ma ∼\nderived from globular cluster stars based on the axion–photon coupling. However, this\ncoupling is quite uncertain even in hadronic models because even there it depends on the\nunknown electric charge of the heavy quark in KSVZ-type models. The hot dark matter\n< 1 eV. One consequence is\nlimit implies that it is very difficult to escape the limit ma ∼\nthat in typical models, axions in the remaining allowed mass range necessarily escape\nfreely from a supernova core. By courtesy of the SN 1987A neutrino burst duration,\nit follows that one can advance by another rung in the ladder of different limits and\n< 10−2 eV [10]. While this SN 1987A energy-loss limit does not have\nconclude that ma ∼\nan obvious loophole, we repeat that it is based on a very small sample of detected\nneutrinos and is subject to various nuclear-physics and axion-model uncertainties.\nOur results largely agree with those of Ref. [5] for their conservative data set. In\ncontrast to Ref. [5] and to a previous study by some of us [4], we have not included the\nLyman-α forest data which could formally improve both the neutrino and axion mass\nlimits roughly by a factor of 3. We have explained in section 4.5 that using the Lyman-α\nforest exposes one to the risk that large systematic uncertainties in the normalisation\nof the power spectrum at small scales may dominate the final result.\nThe CAST experiment at CERN searches for axion-like particles emitted by the\nSun by virtue of their coupling to photons [42, 43]. By including a helium filling of\nthe magnet bores with variable pressure one can \"adjust the photon mass,\" thereby\nallowing one to probe realistic combinations of ma and axion–photon coupling. The\ncompleted runs with 4 He filling have already extended the experimental sensitivity to\nma ∼ 0.4 eV. Further extensions to up to ma ∼ 1.16 eV with the forthcoming 3 He runs\nover three years are on the agenda [44]. This search range is not excluded by our limits,\nparticularly as we believe that more restrictive limits derived from the Lyman-α forest\nmay be dominated by systematic effects that are not reliably controlled.\nOne further caveat is that limits inferred from cosmological observations are by and\nlarge model-dependent. Additional free parameters not considered in this work, such as\na nonstandard dark energy equation of state parameter, running in the primordial scalar\nspectral index, or a nonzero component of isocurvature modes in the initial conditions,\ncould conceivably loosen the axion mass bound, as they have done many times before\nfor the neutrino mass limit [38, 41, 45]. A significant and reliable improvement of\ncosmological hot dark matter limits is not immediately forthcoming. However, once\ndata from the Planck CMB experiment [46] combined with other probes such as weak\nlensing surveys of galaxies [47–49] or of 21-cm emissions [50], or high-redshift galaxy\n\n\fCosmological constraints on neutrino plus axion hot dark matter\n\n11\n\nsurveys [51, 52] become available, the sensitivity will be pushed down by as mush as an\norder of magnitude even in the face of more complicated cosmological model frameworks.\nIn that event, a detection of axions by CAST in the vicinity of ma ∼ 1 eV will have\nimportant ramifications for observational cosmology.\nAcknowledgements\nWe acknowledge use of computing resources from the Danish Center for Scientific\nComputing (DCSC) and partial support by the European Union under the ILIAS\nproject (contract No. RII3-CT-2004-506222), by the Deutsche Forschungsgemeinschaft\nunder the grant TR-27 \"Neutrinos and Beyond\" and by The Cluster of Excellence\nfor Fundamental Physics \"Origin and Structure of the Universe\" (Garching and\nMunich). A.M. is supported by a grant of the Alexander von Humboldt Foundation.\nS.H. acknowledges support from the Alexander von Humboldt Foundation through a\nFriedrich Wilhelm Bessel Award.\nReferences\n[1] J. Lesgourgues and S. Pastor, \"Massive neutrinos and cosmology,\" Phys. Rept. 429 (2006) 307\n[arXiv:astro-ph/0603494].\n[2] S. Hannestad, \"Primordial neutrinos,\" Ann. Rev. Nucl. Part. Sci. 56 (2006) 137 [arXiv:hepph/0602058].\n[3] S. Hannestad and G. Raffelt, \"Cosmological mass limits on neutrinos, axions, and other light\nparticles,\" JCAP 0404 (2004) 008 [arXiv:hep-ph/0312154].\n[4] S. Hannestad, A. Mirizzi and G. Raffelt, \"New cosmological mass limit on thermal relic axions,\"\nJCAP 0507 (2005) 002 [arXiv:hep-ph/0504059].\n[5] A. Melchiorri, O. Mena and A. Slosar, \"An improved cosmological bound on the thermal axion\nmass,\" arXiv:0705.2695 [arXiv:astro-ph].\n[6] R. D. Peccei, \"The strong CP problem and axions,\" submitted to Lecture Notes in Physics\n[arXiv:hep-ph/0607268].\n[7] J. Gasser and H. Leutwyler, \"Quark masses,\" Phys. Rept. 87 (1982) 77.\n[8] H. Leutwyler, \"The ratios of the light quark masses,\" Phys. Lett. B 378 (1996) 313 [arXiv:hepph/9602366].\n[9] W. M. Yao et al. [Particle Data Group], \"Review of particle physics,\" J. Phys. G 33 (2006) 1.\n[10] G. G. Raffelt, \"Axions: Motivation, limits and searches,\" J. Phys. A: Math. Theor. 40 (2007) 6607\n[arXiv:hep-ph/0611118].\n[11] P. Sikivie, \"Axion cosmology,\" submitted to Lecture Notes in Physics [arXiv:astro-ph/0610440].\n[12] S. J. Asztalos, L. J. Rosenberg, K. van Bibber, P. Sikivie and K. Zioutas, \"Searches for astrophysical\nand cosmological axions,\" Ann. Rev. Nucl. Part. Sci. 56 (2006) 293.\n[13] S. Chang and K. Choi, \"Hadronic axion window and the big bang nucleosynthesis,\" Phys. Lett. B\n316 (1993) 51 [arXiv:hep-ph/9306216].\n[14] M. S. Turner, \"Thermal production of not so invisible axions in the early universe,\" Phys. Rev.\nLett. 59 (1987) 2489 [Erratum-ibid. 60 (1988) 1101].\n[15] E. Massó, F. Rota and G. Zsembinszki, \"On axion thermalization in the early universe,\" Phys.\nRev. D 66 (2002) 023004 [arXiv:hep-ph/0203221].\n[16] D. N. Spergel et al., \"Wilkinson Microwave Anisotropy Probe (WMAP) three year results:\nImplications for cosmology,\" Astrophys. J. Suppl. 170 (2007) 377 [arXiv:astro-ph/0603449].\n\n\fCosmological constraints on neutrino plus axion hot dark matter\n\n12\n\n[17] G. Hinshaw et al., \"Three-year Wilkinson Microwave Anisotropy Probe (WMAP) observations:\nTemperature analysis,\" Astrophys. J. Suppl. 170 (2007) 288 [arXiv:astro-ph/0603451].\n[18] L. Page et al., \"Three year Wilkinson Microwave Anisotropy Probe (WMAP) observations:\nPolarization analysis,\" Astrophys. J. Suppl. 170 (2007) 335 [arXiv:astro-ph/0603450].\n[19] Legacy Archive for Microwave Background Data Analysis (LAMBDA),\nhttp://lambda.gsfc.nasa.gov\n[20] W. J. Percival et al., \"The shape of the SDSS DR5 galaxy power spectrum,\" Astrophys. J. 657\n(2007) 645 [arXiv:astro-ph/0608636].\n[21] M. Tegmark et al., \"Cosmological constraints from the SDSS luminous red galaxies,\" Phys. Rev.\nD 74 (2006) 123507 [arXiv:astro-ph/0608632].\n[22] S. Cole et al. [2dFGRS Collaboration], \"The 2dF Galaxy Redshift Survey: Power-spectrum analysis\nof the final dataset and cosmological implications,\" Mon. Not. Roy. Astron. Soc. 362 (2005) 505\n[arXiv:astro-ph/0501174].\n[23] S. Cole, A. G. Sanchez and S. Wilkins, \"The galaxy power spectrum: 2dFGRS-SDSS tension?,\"\narXiv:astro-ph/0611178.\n[24] J. Hamann, S. Hannestad, G. G. Raffelt and Y. Y. Y. Wong, \"Observational bounds on the cosmic\nradiation density,\" arXiv:0705.0440 [arXiv:astro-ph].\n[25] D. J. Eisenstein et al. [SDSS Collaboration], \"Detection of the baryon acoustic peak in the\nlarge-scale correlation function of SDSS luminous red galaxies,\" Astrophys. J. 633 (2005) 560\n[arXiv:astro-ph/0501171]; see also http://cmb.as.arizona.edu/∼eisenste/acousticpeak\n[26] R. E. Smith et al. [Virgo Consortium Collaboration], \"Stable clustering, the halo model\nand nonlinear cosmological power spectra,\" Mon. Not. Roy. Astron. Soc. 341 (2003) 1311\n[arXiv:astro-ph/0207664].\n[27] T. M. Davis et al., \"Scrutinizing exotic cosmological models using ESSENCE supernova data\ncombined with other cosmological probes,\" arXiv:astro-ph/0701510.\n[28] P. Astier et al., \"The Supernova Legacy Survey: Measurement of ΩM , ΩΛ and w from the first\nyear data set,\" Astron. Astrophys. 447 (2006) 31 [arXiv:astro-ph/0510447].\n[29] W. M. Wood-Vasey et al., \"Observational constraints on the nature of the dark energy: First\ncosmological results from the ESSENCE supernova survey,\" arXiv:astro-ph/0701041.\n[30] A. G. Riess et al., \"New Hubble Space Telescope discoveries of type Ia supernovae at z > 1:\nNarrowing constraints on the early behavior of dark energy,\" Astrophys. J. 659 (2007) 98\n[arXiv:astro-ph/0611572].\n[31] P. McDonald et al., \"The linear theory power spectrum from the Lyman-alpha forest in the Sloan\nDigital Sky Survey,\" Astrophys. J. 635 (2005) 761 [arXiv:astro-ph/0407377].\n[32] U. Seljak, A. Slosar and P. McDonald, \"Cosmological parameters from combining the Lyman-alpha\nforest with CMB, galaxy clustering and SN constraints,\" JCAP 0610 (2006) 014 [arXiv:astroph/0604335].\n[33] M. Viel, M. G. Haehnelt and V. Springel, \"Testing the accuracy of the Hydro-PM approximation\nin numerical simulations of the Lyman-alpha forest,\" Mon. Not. Roy. Astron. Soc. 367 (2006)\n1655 [arXiv:astro-ph/0504641].\n[34] M. Viel and M. G. Haehnelt, \"Cosmological and astrophysical parameters from the SDSS flux\npower spectrum and hydrodynamical simulations of the Lyman-alpha forest,\" Mon. Not. Roy.\nAstron. Soc. 365 (2006) 231 [arXiv:astro-ph/0508177].\n[35] M. Viel, M. G. Haehnelt and A. Lewis, \"The Lyman-alpha forest and WMAP year three,\" Mon.\nNot. Roy. Astron. Soc. 370 (2006) L51 [arXiv:astro-ph/0604310].\n[36] A. Lewis and S. Bridle, \"Cosmological parameters from CMB and other data: A Monte-Carlo\napproach,\" Phys. Rev. D 66 (2002) 103511 [arXiv:astro-ph/0205436]\n[37] A. Lewis, Homepage, http://cosmologist.info\n[38] C. Zunckel and P. G. Ferreira, \"Conservative estimates of the mass of the neutrino from cosmology,\"\narXiv:astro-ph/0610597.\n[39] G. L. Fogli et al., \"Observables sensitive to absolute neutrino masses: A reappraisal after WMAP-\n\n\fCosmological constraints on neutrino plus axion hot dark matter\n[40]\n[41]\n[42]\n[43]\n[44]\n\n[45]\n[46]\n[47]\n[48]\n[49]\n[50]\n[51]\n[52]\n\n13\n\n3y and first MINOS results,\" Phys. Rev. D 75 (2007) 053001 [arXiv:hep-ph/0608060].\nM. Cirelli and A. Strumia, \"Cosmology of neutrinos and extra light particles after WMAP3,\"\nJCAP 0612 (2006) 013 [arXiv:astro-ph/0607086].\nA. Goobar, S. Hannestad, E. Mörtsell and H. Tu, \"A new bound on the neutrino mass from the\nSDSS baryon acoustic peak,\" JCAP 0606 (2006) 019 [arXiv:astro-ph/0602155].\nK. Zioutas et al. [CAST Collaboration], \"First results from the CERN axion solar telescope\n(CAST),\" Phys. Rev. Lett. 94 (2005) 121301 [arXiv:hep-ex/0411033].\nS. Andriamonje et al. [CAST Collaboration], \"An improved limit on the axion-photon coupling\nfrom the CAST experiment,\" JCAP 0704 (2007) 010 [arXiv:hep-ex/0702006].\nK. Zioutas et al. [CAST Collaboration], \"Status Report of the CAST experiment and request to\nrun beyond 2007,\" CERN-SPSC-2007-013 (5 April 2007), see\nhttp://doc.cern.ch//archive/electronic/cern/preprints/spsc/public/spsc-2007-013.pdf\nS. Hannestad, \"Neutrino masses and the dark energy equation of state: Relaxing the cosmological\nneutrino mass bound,\" Phys. Rev. Lett. 95 (2005) 221301 [arXiv:astro-ph/0505551].\nPlanck Bluebook, http://www.rssd.esa.int/index.php?project=Planck\nA. R. Cooray, \"Weighing neutrinos: Weak lensing approach,\" Astron. Astrophys. 348 (1999) 31\n[arXiv:astro-ph/9904246].\nY. S. Song and L. Knox, \"Dark energy tomography,\" Phys. Rev. D 70 (2004) 063510 [arXiv:astroph/0312175].\nS. Hannestad, H. Tu and Y. Y. Y. Wong, \"Measuring neutrino masses and dark energy with weak\nlensing tomography,\" JCAP 0606 (2006) 025 [arXiv:astro-ph/0603019].\nR. B. Metcalf and S. D. M. White, \"High-resolution imaging of the cosmic mass distribution from\ngravitational lensing of pregalactic HI,\" arXiv:astro-ph/0611862.\nM. Takada, E. Komatsu and T. Futamase, \"Cosmology with high-redshift galaxy survey: Neutrino\nmass and inflation,\" Phys. Rev. D 73 (2006) 083520 [arXiv:astro-ph/0512374].\nS. Hannestad and Y. Y. Y. Wong, \"Neutrino mass from future high redshift galaxy surveys:\nSensitivity and detection threshold,\" arXiv:astro-ph/0703031.\n\n\f"}