{"id": "http://arxiv.org/abs/0806.1881v1", "guidislink": true, "updated": "2008-06-11T14:23:27Z", "updated_parsed": [2008, 6, 11, 14, 23, 27, 2, 163, 0], "published": "2008-06-11T14:23:27Z", "published_parsed": [2008, 6, 11, 14, 23, 27, 2, 163, 0], "title": "Robust plasmon waveguides in strongly-interacting nanowire arrays", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0806.4813%2C0806.0833%2C0806.0481%2C0806.2357%2C0806.0797%2C0806.3285%2C0806.3327%2C0806.3482%2C0806.2661%2C0806.1851%2C0806.4442%2C0806.2288%2C0806.4054%2C0806.4553%2C0806.2595%2C0806.2312%2C0806.0390%2C0806.0281%2C0806.1031%2C0806.4287%2C0806.1881%2C0806.2416%2C0806.0098%2C0806.0546%2C0806.2829%2C0806.3413%2C0806.4035%2C0806.0918%2C0806.4365%2C0806.1365%2C0806.1824%2C0806.0147%2C0806.3169%2C0806.2552%2C0806.1688%2C0806.4317%2C0806.0048%2C0806.4119%2C0806.4141%2C0806.2655%2C0806.0941%2C0806.2963%2C0806.3674%2C0806.1317%2C0806.2162%2C0806.3802%2C0806.4188%2C0806.3322%2C0806.3251%2C0806.4264%2C0806.1806%2C0806.2543%2C0806.1284%2C0806.0108%2C0806.3843%2C0806.3419%2C0806.3801%2C0806.1036%2C0806.4248%2C0806.2695%2C0806.3885%2C0806.1202%2C0806.1441%2C0806.1060%2C0806.0338%2C0806.4884%2C0806.0008%2C0806.3231%2C0806.2932%2C0806.1022%2C0806.3332%2C0806.1529%2C0806.4933%2C0806.2179%2C0806.0858%2C0806.3073%2C0806.2706%2C0806.2906%2C0806.3023%2C0806.0516%2C0806.0052%2C0806.4850%2C0806.4249%2C0806.1452%2C0806.3300%2C0806.3178%2C0806.1013%2C0806.3079%2C0806.3502%2C0806.0501%2C0806.0328%2C0806.1650%2C0806.4684%2C0806.3113%2C0806.4782%2C0806.0990%2C0806.1617%2C0806.0896%2C0806.0118%2C0806.2029%2C0806.3074&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Robust plasmon waveguides in strongly-interacting nanowire arrays"}, "summary": "Arrays of parallel metallic nanowires are shown to provide a tunable, robust,\nand versatile platform for plasmon interconnects, including high-curvature\nturns with minimum signal loss. The proposed guiding mechanism relies on gap\nplasmons existing in the region between adjacent nanowires of dimers and\nmulti-wire arrays. We focus on square and circular silver nanowires in silica,\nfor which excellent agreement between both boundary element method and multiple\nmultipolar expansion calculations is obtained. Our work provides the tools for\ndesigning plasmon-based interconnects and achieving high degree of integration\nwith minimum cross talk between adjacent plasmon guides.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0806.4813%2C0806.0833%2C0806.0481%2C0806.2357%2C0806.0797%2C0806.3285%2C0806.3327%2C0806.3482%2C0806.2661%2C0806.1851%2C0806.4442%2C0806.2288%2C0806.4054%2C0806.4553%2C0806.2595%2C0806.2312%2C0806.0390%2C0806.0281%2C0806.1031%2C0806.4287%2C0806.1881%2C0806.2416%2C0806.0098%2C0806.0546%2C0806.2829%2C0806.3413%2C0806.4035%2C0806.0918%2C0806.4365%2C0806.1365%2C0806.1824%2C0806.0147%2C0806.3169%2C0806.2552%2C0806.1688%2C0806.4317%2C0806.0048%2C0806.4119%2C0806.4141%2C0806.2655%2C0806.0941%2C0806.2963%2C0806.3674%2C0806.1317%2C0806.2162%2C0806.3802%2C0806.4188%2C0806.3322%2C0806.3251%2C0806.4264%2C0806.1806%2C0806.2543%2C0806.1284%2C0806.0108%2C0806.3843%2C0806.3419%2C0806.3801%2C0806.1036%2C0806.4248%2C0806.2695%2C0806.3885%2C0806.1202%2C0806.1441%2C0806.1060%2C0806.0338%2C0806.4884%2C0806.0008%2C0806.3231%2C0806.2932%2C0806.1022%2C0806.3332%2C0806.1529%2C0806.4933%2C0806.2179%2C0806.0858%2C0806.3073%2C0806.2706%2C0806.2906%2C0806.3023%2C0806.0516%2C0806.0052%2C0806.4850%2C0806.4249%2C0806.1452%2C0806.3300%2C0806.3178%2C0806.1013%2C0806.3079%2C0806.3502%2C0806.0501%2C0806.0328%2C0806.1650%2C0806.4684%2C0806.3113%2C0806.4782%2C0806.0990%2C0806.1617%2C0806.0896%2C0806.0118%2C0806.2029%2C0806.3074&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Arrays of parallel metallic nanowires are shown to provide a tunable, robust,\nand versatile platform for plasmon interconnects, including high-curvature\nturns with minimum signal loss. The proposed guiding mechanism relies on gap\nplasmons existing in the region between adjacent nanowires of dimers and\nmulti-wire arrays. We focus on square and circular silver nanowires in silica,\nfor which excellent agreement between both boundary element method and multiple\nmultipolar expansion calculations is obtained. Our work provides the tools for\ndesigning plasmon-based interconnects and achieving high degree of integration\nwith minimum cross talk between adjacent plasmon guides."}, "authors": ["A. Manjavacas", "F. J. García de Abajo"], "author_detail": {"name": "F. J. García de Abajo"}, "author": "F. J. García de Abajo", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1021/nl802044t", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0806.1881v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0806.1881v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "4 pages, 5 figures", "arxiv_primary_category": {"term": "cond-mat.other", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.other", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0806.1881v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0806.1881v1", "journal_reference": null, "doi": "10.1021/nl802044t", "fulltext": "Robust plasmon waveguides in strongly-interacting nanowire arrays\nA. Manjavacas and F. J. Garcı́a de Abajo∗\n\narXiv:0806.1881v1 [cond-mat.other] 11 Jun 2008\n\nInstituto de Óptica - CSIC, Serrano 121, 28006 Madrid, Spain\n(Dated: August 1, 2018)\nArrays of parallel metallic nanowires are shown to provide a tunable, robust, and versatile platform\nfor plasmon interconnects, including high-curvature turns with minimum signal loss. The proposed\nguiding mechanism relies on gap plasmons existing in the region between adjacent nanowires of\ndimers and multi-wire arrays. We focus on square and circular silver nanowires in silica, for which\nexcellent agreement between both boundary element method and multiple multipolar expansion\ncalculations is obtained. Our work provides the tools for designing plasmon-based interconnects\nand achieving high degree of integration with minimum cross talk between adjacent plasmon guides.\nPACS numbers: 73.20.Mf,84.40.Az,78.67.-n,42.82.Gw\n\nElectromagnetic modes in metal surfaces known as\nplasmons can propagate along millimeters in metallic\nstructures at near-infrared frequencies [1], thus providing\na plausible substitute for the electrical impulses used in\ncurrent electronic circuits operating at microwave clock\nfrequencies [2, 3]. Several designs of plasmon interconnects have been prototyped in recent years, including\nmetallic waveguides of finite cross section in symmetric [4, 5] and asymmetric [6] environments, channels cut\ninto flat surfaces [7], plasmon-band-gap structures based\nupon periodic corrugations [8], and plasmon hopping in\narrays of nanoparticles [9, 10]. Plasmon modes can be\ntuned in frequency, and their spatial distribution molded,\nby tailoring the geometry of metallic structures on the\nnanometer scale. In particular, extreme plasmon confinement has been achieved in narrow insulator films buried\ninside metal [11]. Actually, buried structures provide a\nnatural but technologically challenging approach to compact integration. In contrast to that, open plasmonic\ngeometries involve electromagnetic fields extending significantly away from the metal [5, 6, 7, 8, 9, 10], and\nconsequently producing a substantial degree of cross-talk\nbetween neighboring waveguides [12].\nIn this Letter, arrays of parallel metallic nanowires\nare shown to provide a versatile and tunable platform\nfor highly-integrated plasmon interconnects. The propagation distance and degree of confinement of the plasmon guided modes depend strongly on the separation\nbetween wires. Individual wire modes are recovered at\nlarge separations, while mode hybridization is observed\nwhen the spacing is reduced. Gap modes are observed at\nsmall separations, highly localized in the regions between\ntwo adjacent wires. We use both the boundary element\nmethod (BEM) [13] and a two-dimensional multipleelastic-scattering multipolar expansion of the fields for\nstraight cylinders (2D-MESME) [14], with the two approaches resulting in complete agreement on the scale\nof the plots. These methods provide rigorous solutions\nof Maxwell's equations in frequency space for materials\ndescribed by local dielectric functions and separated by\nabrupt interfaces. We focus on silver nanowires of cir-\n\ncular and square cross sections embedded in silica. The\ndielectric functions of silver [15] and silica [16] have been\ntaken from optical data. The proposed guiding mechanism is demonstrated to be tolerant to asymmetry in\nwire dimers and sharp turns of subwavelength radius.\nThe localized plasmons sustained by our structures can\nbe conveniently characterized using the photonic local\ndensity of states (LDOS), defined by analogy to its electronic counterpart as the combined local intensity of all\neigenmodes of the system under investigation. We in particular consider the LDOS relative to its value in vacuum,\nω 2 /3π 2 c3 . The LDOS is proportional to the radiative decay rate of excited atoms [17], which we in turn obtain\nusing BEM from the imaginary part of the self-induced\nelectric field acting back on a dipole [18]. We have double checked our results by comparing with the excess of\nspace-integrated total density of states (DOS) with respect to vacuum, which is directly accessible through 2DMESME [17].\nWe start by considering a dimer formed by two 200nm circular silver wires embedded in silica, as shown in\nFig. 1(a). The contour plots of Fig. 1(b)-(e) show the\nDOS resolved in contributions of different momentum kk\nparallel to the wires for various separations between wire\nsurfaces (d). A strongly bound mode is observed at small\nwire separations [Fig. 1(b)], with kk well above kh , the\nmomentum of light in the host silica. The spatial extension of this gap mode is limited to the inter-wire region (see inset), and thus, it is expected to interact very\nweakly with other structures sitting in the vicinity of\nthe wires but far from the gap. This mode evolves continuously for increasing inter-wire distance to become a\nhybridized monopole-monopole mode of induced-charge\npattern (+) * * * (−) aligned with the dimer axis [Fig.\n1(c)-(d)]. This is in contrast to the (+−) * * * (+−)\ndipole-dipole plasmon in particle dimers [19], which is\nthe lowest-energy mode according to plasmon chemistry\narguments [20]. In this sense, wires are distinctly different from particles because charge neutrality is guaranteed\nby oscillations along the rods for finite kk , thus making\ntwo-dimensional monopoles possible. At sufficiently large\n\n\f2\n\nFIG. 1: Gap plasmon modes of two parallel silver nanowires\nin silica. (a) Schematic view of the geometry. (b)-(e) Photonic density of states (DOS) as a function of energy and momentum parallel to the wires for various dimer separations d.\nThe insets show the spatial distribution of the local density of\nstates (LDOS) for the lowest-energy gap mode at a free-space\nlight wavelength of 1550 nm. Brighter regions correspond to\nhigher DOS and LDOS. The maximum LDOS in the inset of\n(c) is ∼ 15000 times the vacuum value.\n\ndistance, single-wire plasmons of m = 0 azimuthal symmetry are recovered [cf. Fig. 1(e) and Fig. 2(b); see Ref.\n[21] for analytical expressions of single-wire plasmons].\nFig. 2 proves that the gap mode is really local. The\nlowest-frequency plasmon branch of the trimers in Figs.\n2(c) and 2(d) follows approximately the dispersion relation of the gap mode in the dimer with the same gap\ndistance d = 10 nm [Fig. 1(c)], although closer examination reveals the splitting of this mode into two very\nclose modes [see lower inset in Fig. 2(d)]. In the infinite\nwire array of Fig. 2(e) a plasmon branch of gap modes\nis found for each value of the transverse momentum kt ,\nparallel to the array plane and perpendicular to the wires\n(kt = 0 in the figure). Incidentally, propagation across\nwires mimics plasmon hopping in particle chains [22].\nNearly-touching trimers can be regarded as dimers\nformed by two coupled gaps, and similarly, N -wire arrays\nbehave as structures formed by N − 1 gaps. The large\ndegree of plasmon localization observed for small d suggests using a tight-binding model [23], in which an unperturbed Hamiltonian H0 describes uncoupled gap modes\n|ji at sites j, such that hj|H0 |j ′ i = ωkk δjj ′ , where ωkk\n\nFIG. 2: Evolution of gap plasmon modes with the number of\nnanowires in an array (N ). (a) Schematic view of the geometry. (b)-(e) DOS as a function of energy and momentum kk\nparallel to the wires for arrays of N = 1, 3, and ∞ nanowires.\nThe insets show LDOS maps for the lowest-frequency gap\nmode at a wavelength of 1550 nm. The lower inset in (e)\nshows the transverse momentum dependence of the DOS for\nkk = 16 μm−1 compared to a tight-binding model of the gap\nmode (solid curve) over the first Brillouin zone of the 1D lattice.\n\nis the mode energy for fixed kk . Neighboring gaps can\ninteract in this model via a potential V , with non-zero\nmatrix elements hj|V |j ± 1i = ∆kk /2, where ∆kk is the\nhopping energy. Then, the two linear-trimer modes have\nenergies ωkk ± ∆kk /2 [i.e., the dimer band lies halfway\nbetween the two trimer bands, which we have verified\nby comparison of Figs. 1(c) and 2(d)]. Also, the plasmon modes of an infinite,\nperiodic wire array must have\nP\nthe form |ψkt i = j exp(ikt aj) |ji in virtue of Bloch's\ntheorem [23], where a is the period. These states diagonalize the full Hamiltonian H0 + V and have energies\nωkk kt = ωkk + ∆kk cos(kt a). We have tested this formula\nin the array of Fig. 2(e), where the lower inset shows\nωkk kt as a function of kt for kk = 16 μm−1 (solid curve)\ncompared with the actual 2D-MESME calculation of the\nDOS. The unperturbed gap energy ωkk = 1.18 eV and the\nhopping parameter ∆kk = 0.01 eV have been taken from\nthe dimer [Figs. 1(c)] and trimer [Figs. 2(d)] with the\nsame value of d, respectively. Similar agreement between\nmodel and full calculation is observed over the range of\nkk under consideration.\n\n\f3\nby relatively large mode confinement. The tradeoff between confinement and propagation distance is clearly\nillustrated in the long-d behavior of the infinite array for\nkt = 0 and kt = π/a, with the former showing longer\npropagation and smaller phase velocity (see Fig. 3).\n\nFIG. 3: (a) Phase velocity of gap plasmon modes in silver\nwire dimers and infinite-arrays (for kt = 0 and kt = π/a) as\na function of separation d for fixed wavelength λ = 1550 nm.\n(b) Propagation length L under the same conditions as in (a),\nobtained from L = 1/2Im{kk }, where Im{kk } corresponds to\nthe HWHM of the kk -dependent DOS.\n\nFIG. 4: Gap mode in co-planar and co-axial bi-tori compared\nwith a straight-wire dimer for a gap distance d = 10 nm. Partial contributions to the LDOS are shown as a function of\nwavelength for a point in the center of the gap, both at fixed\nazimuthal number in tori (m = 8 for radius b = 750 nm and\nm = 4 for b = 375 nm) and at fixed parallel momentum in the\nstraight dimer (kk ≈ 10.7 μm−1 , such that kk = m/b). The\ncurves are normalized to their maximum value.\n\nInterestingly, these analytical expressions apply to the\nlarge d limit as well, in which the tight-binding model is\nconstructed based upon localized plasmons of the wires,\nshowing similar agreement with rigorous DOS calculations. Tight-binding is thus the natural description of\nboth the small and large d limits in the noted continuous evolution from the localized gap mode (small d) to\nthe lowest-energy hybridized (monopole-monopole) wire\nmodes (large d) [19].\n\nWe find it convenient to define a figure of merit F for\nthe waveguides expressed as the ratio between the propagation distance and the geometric mean of the mode\ndiameter in the transverse directions. The quantities\nF 2 and F 3 should be roughly proportional to the number of logical elements that can be integrated using a\ngiven waveguiding scheme with two and three dimensional packing, respectively. We obtain F ≈ 540 for the\nwire dimer of Fig. 3 at a separation of 10 nm. This has to\nbe compared with values of F <\n∼ 50 for channel plasmon\npolaritons [7] and particle arrays [10]. We conclude that\nwire arrays yield high values of F , also improved with respect to those obtained for single wires (e.g., F ≈ 100 at\n100 nm radius and 1550 nm wavelength). The decrease in\npropagation length is the price to pay for plasmon confinement, but wire arrays seem to perform optimally with\nrespect to the figure of merit F .\nReliable plasmon waveguides must be robust against\nfabrication imperfections and sharp turns. Next, we show\nthat gap waveguides satisfy these requirements. In particular, curved waveguide paths produce radiative losses\noriginating in coupling to propagating light waves when\ntranslational invariance is broken. We analyze this effect\nin Fig. 4 both for non-identical co-planar tori and for\nidentical co-axial tori, using the prescription kk = m/b\nto compare with straight waveguide modes, where b is the\ntoroidal radius (see insets) and m is the azimuthal momentum number. The calculations are performed using\nBEM, specialized for axially-symmetric geometries [13].\n\nThe degree of plasmon localization increases with decreasing gap distance d. This is reflected in a reduction\nof the phase velocity vp = ch kh /kk relative to the speed\nof light in silica, ch , as shown in Fig. 3(a). The group\nvelocity (no shown) is also reduced, so that gap modes become considerably slower than light in silica. The propagation distance is strongly-dependent on inter-wire distance [Fig. 3(b)]: the large confinement observed at small\nseparations increases the relative weight of the electric\nfield intensity inside the metal, where ohmic losses are\nproduced in proportion to that intensity within linear\nresponse. Nevertheless, the gap mode involves electric\nfield polarization mainly perpendicular to the wire surfaces near the gap, where light energy is concentrated,\nand this is beneficial to obtain longer propagation distances because the normal electric field inside the metal\nis reduced by its large dielectric function to fulfill the continuity of the normal electric displacement. This gives\nrise to propagation distances of the order of tens of microns for separations of tens of nanometers, accompanied\n\n\f4\nRadiative losses are still small compared to absorption for\nb = 750 nm (cf. curves for straight wires and large-radius\ntori in Fig. 4, showing only ∼ 5% increase in peak width\nof curved versus straight wires due to radiative losses in\nthe former), but they become sizable for shaper turns\n(the width increases by 40% and 95% for b = 375 nm in\nco-axial and co-planar torii, respectively).\n\nhave been the subject of recent experimental investigation [11]. This increase in confinement is accompanied\nby peak broadening originating in larger overlap of the\ngap mode with the metal (ohmic losses). The observed\nextreme sensitivity to shape and separation of the wires\nimposes severe limits to the precision required in the fabrication of the arrays in order to maintain a homogenous\nmode wavelength along the waveguide.\nIn conclusion, we have shown that gap plasmon\nmodes existing in the region defined by two neighboring nanowires are excellent candidates to guide signals\nover tens of microns. These modes are quite robust\nagainst both unintended variations of wire cross section\nand curvature in short turns, and thus, gap plasmons can\nbe guided with minimum losses over complicated winding paths of micrometer dimensions. Furthermore, gap\nmodes are highly confined to the gap region, so that intermixing between neighboring wire-dimers can be minimized, thus preventing waveguide cross-talk and allowing\nhighly-integrated plasmonic circuits in three dimensional\nspaces.\n\n∗\n\nFIG. 5: Gap mode against variations of wire radius (a) and\nshape (from circular to square cross section) (b). The LDOS\nis represented as a function of kk for a point at the center of\neach dimer and a wavelength λ = 1550 nm. One of the wires\nin the dimers of (a) has a fixed radius of 100 nm, while various\nvalues of the radius are considered for the neighboring wire:\n100 nm, 90 nm, and 80 nm, from top to bottom. The distance\nbetween wires is d = 10 nm in all cases. The horizontal diameter of the wires in (b) is 200 nm for all cross sections.\n\nGuided gap plasmons are also robust against dimer\nasymmetries, as shown in Fig. 5(a) for fixed wavelength\nλ = 1550 nm and gap distance d = 10 nm. Variations\nof up to 20% in the relative radius of neighboring wires\nproduce just a small, tolerable shift in kk . However, wire\nshape is a critical parameter, which we study in Fig. 5(b)\nthrough the transition from circular to square cross section. This produces a shift of the gap plasmon towards\nlarger kk , consistent with the higher degree of confinement that occurs when evolving from the line-like contact of the circular wires to the planar waveguide defined by the square wires, the guided modes of which\n\n[1]\n[2]\n[3]\n[4]\n[5]\n[6]\n[7]\n[8]\n[9]\n[10]\n[11]\n[12]\n[13]\n[14]\n[15]\n[16]\n[17]\n[18]\n[19]\n[20]\n[21]\n[22]\n[23]\n\nCorresponding author: jga@cfmac.csic.es\nD. Sarid, Phys. Rev. Lett. 47, 1927 (1981).\nE. Ozbay, Science 311, 189 (2006).\nR. Zia et al., Mater. Today 9, 20 (2006).\nJ. Takahara et al., Opt. Lett. 22, 475 (1997).\nP. Berini, Phys. Rev. B 61, 10484 (2000).\nP. Berini, Phys. Rev. B 63, 125417 (2001).\nS. I. Bozhevolnyi et al., Nature 440, 508 (2006).\nS. I. Bozhevolnyi et al., Phys. Rev. Lett. 86, 3008 (2001).\nJ. R. Krenn et al., Phys. Rev. Lett. 82, 2590 (1999).\nS. A. Maier et al., Nat. Mater. 2, 229 (2003).\nH. T. Miyazaki and Y. Kurokawa, Phys. Rev. Lett. 96,\n097401 (2006).\nJ. A. Conway, S. Sahni, and T. Szkopek, Opt. Express\n15, 4474 (2007).\nF. J. Garcı́a de Abajo and A. Howie, Phys. Rev. Lett.\n80, 5180 (1998); Phys. Rev. B 65, 115418 (2002).\nF. J. Garcı́a de Abajo et al., Phys. Rev. Lett. 91, 143902\n(2003); Phys. Rev. B 68, 205105 (2003).\nP. B. Johnson and R. W. Christy, Phys. Rev. B 6, 4370\n(1972).\nE. D. Palik, Handbook of Optical Constants of Solids\n(Academic Press, New York, 1985).\nD. P. Fussell, R. C. McPhedran, and C. Martijn de\nSterke, Phys. Rev. E 70, 066608 (2004).\nL. A. Blanco and F. J. Garcı́a de Abajo, Phys. Rev. B\n69, 205414 (2004).\nI. Romero et al., Opt. Express 14, 9988 (2006).\nP. Nordlander et al., Nano Lett. 4, 899 (2004).\nJ. C. Ashley and L. C. Emerson, Surf. Sci. 41, 615 (1974).\nK. J. Webb and J. Li, Phys. Rev. B 72, 201402(R) (2005).\nN. W. Ashcroft and N. D. Mermin, Solid State Physics\n(Harcourt College Publishers, New York, 1976).\n\n\f"}