{"id": "http://arxiv.org/abs/1004.3047v1", "guidislink": true, "updated": "2010-04-18T18:06:39Z", "updated_parsed": [2010, 4, 18, 18, 6, 39, 6, 108, 0], "published": "2010-04-18T18:06:39Z", "published_parsed": [2010, 4, 18, 18, 6, 39, 6, 108, 0], "title": "Emergence of non-Fermi-liquid behavior due to Fermi surface\n  reconstruction in the underdoped cuprate superconductors", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1004.5035%2C1004.4805%2C1004.0498%2C1004.4691%2C1004.0451%2C1004.0705%2C1004.2705%2C1004.3709%2C1004.3067%2C1004.2252%2C1004.5248%2C1004.1577%2C1004.0408%2C1004.3047%2C1004.5477%2C1004.2145%2C1004.4258%2C1004.2187%2C1004.0633%2C1004.1170%2C1004.3002%2C1004.3301%2C1004.4776%2C1004.3603%2C1004.2131%2C1004.1646%2C1004.4173%2C1004.2269%2C1004.0155%2C1004.0394%2C1004.4611%2C1004.4673%2C1004.3894%2C1004.0835%2C1004.2989%2C1004.3618%2C1004.3585%2C1004.5333%2C1004.3405%2C1004.2483%2C1004.1654%2C1004.3940%2C1004.0855%2C1004.1125%2C1004.1291%2C1004.3055%2C1004.3321%2C1004.3146%2C1004.2235%2C1004.3325%2C1004.2629%2C1004.3676%2C1004.5380%2C1004.1951%2C1004.1257%2C1004.2234%2C1004.0376%2C1004.2478%2C1004.4061%2C1004.5023%2C1004.1775%2C1004.3096%2C1004.4153%2C1004.3515%2C1004.2993%2C1004.1932%2C1004.3691%2C1004.4415%2C1004.0469%2C1004.0651%2C1004.3182%2C1004.2973%2C1004.2707%2C1004.0041%2C1004.1350%2C1004.2057%2C1004.1153%2C1004.1165%2C1004.2508%2C1004.5221%2C1004.2196%2C1004.0575%2C1004.3711%2C1004.2572%2C1004.3637%2C1004.0329%2C1004.5416%2C1004.5262%2C1004.1240%2C1004.4086%2C1004.4901%2C1004.2782%2C1004.0919%2C1004.2862%2C1004.2921%2C1004.4110%2C1004.5523%2C1004.0518%2C1004.1629%2C1004.0747%2C1004.4294&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Emergence of non-Fermi-liquid behavior due to Fermi surface\n  reconstruction in the underdoped cuprate superconductors"}, "summary": "We present an intermediate coupling scenario together with a model analytic\nsolution where the non-Fermi-liquid behavior in the underdoped cuprates emerges\nthrough the mechanism of Fermi surface (FS) reconstruction. Even though the\nfluctuation spectrum remains nearly isotropic, FS reconstruction driven by a\ndensity wave order breaks the lattice symmetry and induces a strong momentum\ndependence in the self-energy. As the doping is reduced to half-filling, we\nfind that quasiparticle (QP) dispersion becomes essentially unrenormalized, but\nin sharp contrast the QP spectral weight renormalizes to nearly zero. This\nopposite doping evolution of the renormalization factors for QP dispersion and\nspectral weight conspires in such a way that the specific heat remains Fermi\nliquid like at all dopings in accord with experiments.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1004.5035%2C1004.4805%2C1004.0498%2C1004.4691%2C1004.0451%2C1004.0705%2C1004.2705%2C1004.3709%2C1004.3067%2C1004.2252%2C1004.5248%2C1004.1577%2C1004.0408%2C1004.3047%2C1004.5477%2C1004.2145%2C1004.4258%2C1004.2187%2C1004.0633%2C1004.1170%2C1004.3002%2C1004.3301%2C1004.4776%2C1004.3603%2C1004.2131%2C1004.1646%2C1004.4173%2C1004.2269%2C1004.0155%2C1004.0394%2C1004.4611%2C1004.4673%2C1004.3894%2C1004.0835%2C1004.2989%2C1004.3618%2C1004.3585%2C1004.5333%2C1004.3405%2C1004.2483%2C1004.1654%2C1004.3940%2C1004.0855%2C1004.1125%2C1004.1291%2C1004.3055%2C1004.3321%2C1004.3146%2C1004.2235%2C1004.3325%2C1004.2629%2C1004.3676%2C1004.5380%2C1004.1951%2C1004.1257%2C1004.2234%2C1004.0376%2C1004.2478%2C1004.4061%2C1004.5023%2C1004.1775%2C1004.3096%2C1004.4153%2C1004.3515%2C1004.2993%2C1004.1932%2C1004.3691%2C1004.4415%2C1004.0469%2C1004.0651%2C1004.3182%2C1004.2973%2C1004.2707%2C1004.0041%2C1004.1350%2C1004.2057%2C1004.1153%2C1004.1165%2C1004.2508%2C1004.5221%2C1004.2196%2C1004.0575%2C1004.3711%2C1004.2572%2C1004.3637%2C1004.0329%2C1004.5416%2C1004.5262%2C1004.1240%2C1004.4086%2C1004.4901%2C1004.2782%2C1004.0919%2C1004.2862%2C1004.2921%2C1004.4110%2C1004.5523%2C1004.0518%2C1004.1629%2C1004.0747%2C1004.4294&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We present an intermediate coupling scenario together with a model analytic\nsolution where the non-Fermi-liquid behavior in the underdoped cuprates emerges\nthrough the mechanism of Fermi surface (FS) reconstruction. Even though the\nfluctuation spectrum remains nearly isotropic, FS reconstruction driven by a\ndensity wave order breaks the lattice symmetry and induces a strong momentum\ndependence in the self-energy. As the doping is reduced to half-filling, we\nfind that quasiparticle (QP) dispersion becomes essentially unrenormalized, but\nin sharp contrast the QP spectral weight renormalizes to nearly zero. This\nopposite doping evolution of the renormalization factors for QP dispersion and\nspectral weight conspires in such a way that the specific heat remains Fermi\nliquid like at all dopings in accord with experiments."}, "authors": ["Tanmoy Das", "R. S. Markiewicz", "A. Bansil"], "author_detail": {"name": "A. Bansil"}, "author": "A. Bansil", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevB.81.184515", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1004.3047v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1004.3047v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "Accepted for publication in Physical Review B (2010).", "arxiv_primary_category": {"term": "cond-mat.supr-con", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.supr-con", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1004.3047v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1004.3047v1", "journal_reference": "Phys. Rev. B 81, 184515 (2010)", "doi": "10.1103/PhysRevB.81.184515", "fulltext": "Emergence of non-Fermi-liquid behavior due to Fermi surface reconstruction in the\nunderdoped cuprate superconductors\nTanmoy Das, R. S. Markiewicz, and A. Bansil\n\narXiv:1004.3047v1 [cond-mat.supr-con] 18 Apr 2010\n\nPhysics Department, Northeastern University, Boston MA 02115, USA\n(Dated: October 30, 2018)\nWe present an intermediate coupling scenario together with a model analytic solution where the\nnon-Fermi-liquid behavior in the underdoped cuprates emerges through the mechanism of Fermi\nsurface (FS) reconstruction. Even though the fluctuation spectrum remains nearly isotropic, FS\nreconstruction driven by a density wave order breaks the lattice symmetry and induces a strong\nmomentum dependence in the self-energy. As the doping is reduced to half-filling, we find that\nquasiparticle (QP) dispersion becomes essentially unrenormalized, but in sharp contrast the QP\nspectral weight renormalizes to nearly zero. This opposite doping evolution of the renormalization\nfactors for QP dispersion and spectral weight conspires in such a way that the specific heat remains\nFermi liquid like at all dopings in accord with experiments.\nPACS numbers: 71.10.Hf,71.18.+y,74.40.-n,74.72.Kf\n\nI.\n\nINTRODUCTION\n\nUnderstanding how 'non-Fermi-liquid' behavior arises\nnear the half-filled insulating state is one of the key questions for unraveling the physics of not only the cuprates\nbut that of correlated electron systems more generally.\nHere we show how some aspects of the electronic spectrum which are difficult to understand in a conventional\nFermi liquid theory can be explained naturally in a model\nof an antiferromagnetic Fermi liquid. Specifically, it has\nbeen reported that the renormalization of the electronic\ndispersion decreases with underdoping as half-filling is\napproached,1 i.e. the quasiparticles (QPs) seem to 'undress' in the underdoped regime. In sharp contrast, the\nspectral weight of the QPs fades away on approaching the\ninsulator and renormalizes to zero at half-filling2,3 , indicating that these QPs are very fragile or 'gossamer'-like4.\nWithin Fermi liquid theory the QP dispersion and spectral weight should be renormalized by the same factor,\nunless the self-energy has a strong momentum dependence. However, fluctuations in the cuprates seem to be\nrelatively isotropic5,6 , which would imply then that the\nrenormalization factor Zd for dispersion is roughly equal\nto the renormalization factor Zω for the spectral weight.\nThis is clearly violated near the Mott insulating limit,\nwhere Zd → 1 while Zω → 0. Added to these puzzling\nfindings is the fact that the electronic specific heat continues to behave more or less in a Fermi-liquid manner\nover the entire doping range from the overdoped metal to\nthe insulator3,7–9 . These results clearly demonstrate that\na non-Fermi-liquid or 'strange metal' superconductor\nemerges from the Fermi-liquid background as doping is\nreduced. Notably, there is considerable controversy over\nwhat constitutes non-Fermi-liquid behavior and many\nproposals have been made to understand its possible origin, ranging from preformed d−wave pairs10 to fluctuating spin-density waves11 , from the Hubbard12,13 and\nt − J 14 models to the anti-de Sitter/conformal field theory (AdS-CFT) correspondence15 .\nInsight into the origin of non-Fermi-liquid behav-\n\nior comes from recent angle-resolved photoemission\nspectroscopy (ARPES)16 , Hall effect17 , and quantum\noscillation18–20 experiments, which reveal the presence of\nFS reconstruction as a robust feature of both electron and\nhole doped cuprates, suggesting that the ground state involves some superlattice order. In this article, we investigate a model of the underdoped cuprates with a density\nwave ordered ground state and find that when the Fermi\nsurface (FS) breaks into pockets, the self-energy develops a strong momentum dependence. Analytic forms for\nvarious renormalization factors are presented to delineate\nhow the non-Fermi-liquid physics arising from FS reconstructions can be understood at a quantitative level. Our\nstudy thus provides a tangible model for reconciling the\nseemingly contradictory doping evolutions of the QP dispersion, the QP spectral weight and the specific heat in\nthe cuprates.\nThe possibility of FS reconstruction in the cuprates\nhas been proposed many times since it was found that\nthe Hall density scales with doping21 – i.e., it is proportional to the small pocket area rather than the large\nFS. We model this FS reconstruction by assuming a spin\ndensity wave (SDW) order which results in a nearlyantiferromagnetic-Fermi-liquid (NAFL) phase22 . In addition to SDW order, we have analyzed other candidates for the competing order including charge, flux, or\nd−density waves23 and find that the pseudogap symmetry which is the essential ingredient for the origin of nonFermi-liquid physics is insensitive to the particular nature\nof the competing order state. We calculate the self-energy\ndue to spin and charge fluctuations within a QP-GW formalism described in Appendix A. The model is known to\nproperly describe the high-energy 'waterfall' features in\nARPES5,24,25 as well as the doping evolution of the optical spectra and the finite QP lifetime.26 Within the QPGW model the self-energy splits the spectrum into coherent in-gap states and an incoherent residue of the undoped upper and lower Hubbard bands (U/LHBs). With\nunderdoping, the in-gap states develop an SDW gap and\nsplit into upper and lower magnetic bands (U/LMBs)23 ,\n\n\f2\nand the resulting 'four-band' features are consistent with\nquantum Monte Carlo (QMC) calculations27 [Appendix\nA]. The involvement of a quantum critical point (QCP)\nin the optimal doping regime where the SDW order disappears is strongly suggestive of an intermediate strength\nfor correlations in the cuprates.26 Accordingly, there have\nbeen several recent attempts to develop an intermediate coupling model for the cuprates starting from either\nthe weak-coupling limit, as in the present calculation,\nor the strong-coupling limit28 . Therefore, we compare\nour results with experiments as well as with the variational cluster calculations of Paramekanti, Randeria and\nTrevedi (PRT)28 , which approach the problem from the\nRVB limit.\nThis article is organized as follows. In sections IIA and\nIIB, we investigate the doping evolution of the spectral\nweight and that of dispersion renormalization, respectively. The specific heat results are presented in Section\nIII. The discussion and conclusions are given in Sections\nIV and V respectively. A summary of the underlying QPGW model is provided in Appendix A. Various renormalization factors invoked are summarized in Appendix B for\nthe reader's convenience. Appendices C and D address\ndetails of analytic forms for the renormalization factors\nand those of our specific heat evaluation.\nII.\n\nNEARLY-ANTIFERROMAGNETIC-FERMILIQUID RENORMALIZTION\nFACTORS\nA.\n\nMomentum density and spectral weight\nrenormalization\n\nWe evaluate the exact values of the renormalization\nfactors from FS discontinuities of spectral function moments Ml (k) of various order l,\nZ ∞\ndωω l A(k, ω)f (ω)\n(1)\n−∞\n\nThese moments provide important information about the\nspectral weight distribution in energy and momentum\nspace as a function of doping.28 The spectral density\nA(k, ω) involves both the coherent QP and the incoherent\npart. Due to the Fermi function f (ω), the moments Ml\ndisplay singularities at the Fermi momentum kF which\nare characteristic of coherent gapless quasiparticle excitations. We consider first the zeroth order moment which\nis simply the momentum density n(k).29–31 The interacting FS is determined from the jump in n(k) at kF of the\nquasiparticles. The magnitude of this jump defines the\nspectral weight renormalization Zω . The incoherent part\nin the spectral weight substantially modifies the shape of\nn(k).\nFig. 1 shows maps of n(k) throughout the first Brillouin zone as a function of doping for Nd2−x Cex CuO4\n(NCCO) and hole doped La2−x Srx CuO4 (LSCO). In the\npresent NAFL case the combination of self-energy and\n\nFIG. 1: (Color online) Momentum density, n(k) as calculated\nusing Eq. 1 is shown for various dopings for NCCO in (a-c)\nand for LSCO in (d-f).\n\nSDW coherence factors leads to characteristic structures\nin n(k) at all dopings including half-filling. At halffilling n(k) shows a maximum at the Γ−point and away\nfrom that it decreases gradually and smoothly, from inside to outside the LDA-like FS [magenta solid line in\nFig. 1(a) and (d)]. As we dope the system with electrons, the spectral weight increases at the Γ−point and\nin addition, (π, 0) and its equivalent points largely gain\nspectral weight due to the development of electron pockets in NCCO [Fig. 1(b)]. With further increase of doping, the FS undergoes two topological transitions32,33 as\nalso reflected in the momentum density calculations here.\nThe first topological transition in n(k) occurs when the\nLMB approaches the Fermi level (EF ) and forms holelike pockets at (±π/2, ±π/2). For x = 0.15, the hole\npockets are fully formed and they as well as the electron\npockets increase in size with further doping. At x = 0.18\nthe electron and hole pockets merge at the hot-spot, the\nSDW gap collapses, and the full metal-like n(k) appears\n[second topological transition]. For hole doping, the FS\ntopological transition is complimentary to the electron\ndoped one and here the hole pocket appears first as shown\nin Fig. 1(e) and above the QCP, the electron-like full FS\nappears in Fig. 1(f).\nA more quantitative account of the effect of self-energy\ncorrections on the residual coherent QP spectral weight\nis provided in Fig. 2(a), which shows n(k) along highsymmetry lines for NCCO as well as LSCO. Some important effects of correlations on the insulating state\nshould be noted here. At x = 0, n[k = Γ] ≈ 0.9 and\nn[k = (π, π)] ≈ 0.1, implying that the self-energy redistributes the spectral weight from the filled states to the\nunfilled regions even in the insulating phase. PRT [with\na different parameter set t = 300 meV, t′ = −t/4 and\nU = 12t] find a similar result n[k = Γ] ≈ 0.8528 . At\nhalf-filling n(k) is a smoothly varying function throughout the BZ, due to the absence of gapless quasiparticle for both NCCO (green line) and LSCO (not shown).\n\n\f3\nAs we increase electron doping, the spectral weight at Γ\n[(π, π)] gradually increases [decreases] whereas the spectral weight increases rapidly at (π, 0), due to the development of electron pockets, while discontinuities in n(k)\narise at the Fermi surface. In the underdoped region,\nn(k) shows additional singularities along Γ → (π, 0)) and\n(π/2, π/2) → (π, π) due to the presence of shadow bands\nas marked by gold arrows. Since the shadow bands are\nusually weak in the cuprates34–38 , experimental data are\navailable predominantly along the arcs – that is, along\nthe antinodal direction for NCCO and nodal direction for\nLSCO. These are compared with our theory in Fig. 2(b),\neffects of the ARPES matrix element notwithstanding.39\nWe define a coherent spectral weight renormalization\nfactor from the discontinuities in n(k):\nZω = ∆n(kF ),\n\n(2)\n\nplotted as a function of doping for NCCO in Fig. 2(b)28 .\nFor the main band in NCCO along the antinodal direction, the UMB crosses the Fermi level at all finite dopings\n(electron pocket) and Zω decreases smoothly with underdoping but vanishes discontinuously at x = 0. Shown\nalso in Fig. 2(b) is the conventional paramagnetic Green's\nfunction renormalization factor\n\u0013−1\n\u0012\n∂Σ′ (ω)\n0\n.\n(3)\nZω = 1 −\n∂ω\nω=0\nIt can be seen that the doping dependence in Zω0 is very\nweak and strikingly opposite to Zω . Thus the strong\ndoping dependence of Zω is governed by the SDW gap\ncollapse. In Appendix C we derive an approximate analytical form for the SDW corrected renormalization factor\nZωSDW (at ω = 0) in terms of the SDW coherence factors\n[see Eq. C6]\n\n\n\u00132 !−1/2\n\u0012\n0\n2∆\nZ\n . (4)\nZωSDW = ω 1 ± 1 +\n2\nξkF − ξkF +Q\n\nNote however that kF is the true Fermi momentum in\nthe SDW state, not the LDA one. We see in Fig 2(b)\nthat this simple analytic form captures the essential doping dependence of the full Zω . As doping increases, the\nweight of the shadow bands (above the magnetic Brillouin zone) decreases [open symbols in Fig. 2(b)], with\nthe corresponding spectral weight shifting to the main\nbands. Along the nodal direction, Zω remains zero up to\noptimal doping, and then shows a jump to a slowly increasing value as the LMB crosses the Fermi level. These\nresults are in excellent agreement with experiment16 .\nA similar doping dependence of Zω is observed in\nLSCO along the nodal direction, including the jump at\nx = 0 and the spectral weight transfer from the shadow\nband to the main band34 in Fig. 2(b). This is in qualitative agreement with the calculation of PRT28 (triangles\nin Fig. 2(b)), and with ARPES measurements on LSCO3\n(open circles) above the optimal doping region. However,\n\nin the very underdoped region, the ARPES data seem to\nextrapolate smoothly to zero at half-filling (dashed line),\nwhich may be related to nanoscale phase separations believed to be significant in LSCO.\nNote that the analytic renormalization factor ZωSDW is\ndefined in the SDW phase, but is treated as a renormalization of the paramagnetic phase dispersion. This subtle\npoint is an attempt to treat the pseudogap physics, and\nis discussed in more detail in Section IV below.\n\nB.\n\nFERMI VELOCITY AND DISPERSION\nRENORMALIZATION\n\nWe turn next to the first order spectral moment M1 (k).\nOne can measure the dispersion renormalization from the\nsize of the slope discontinuity, which can be written as\n(Eq. C7)\n∆ (dM1 (k)/dk)kF = Zω vF ,\n\n(5)\n\nwhere vF is the Fermi velocity28 . Knowing Zω from\nFigs. 2(b) and (c), we can extract vF as a function\nof doping, as seen in Fig. 3(a). The results are obtained for both LSCO and NCCO and compared with\nARPES data on LSCO3 and with PRT's variational\ncluster calculations28 (hole doping) as well as with LDA\nand mean-field theory for LSCO. Mean-field results for\nNCCO have an equivalent doping dependence and thus\nare not shown here. Notably, in spite of the substantial decrease of Zω , the QP velocity vF does not diminish on entering into the pseudogap region. Although in\nthe SDW mean field case vF decreases smoothly with\nunderdoping as the gap grows, when a self-energy is introduced, the reduction of the coherent spectral weight\n(Zω ) with underdoping compensates for this, leading to a\nnet enhancement of vF . The results are consistent with\nPRT and ARPES. Similar results are also obtained in\na self-consistent Born approximation with antiferromagnetic pseudogap in the t − J model41 .\nWe define a dispersion renormalization factor in terms\nof the conventional band velocity with respect to its bare\n(LDA) counterpart (vF0 ) as\nZd = vF /vF0 ,\n\n(6)\n\nplotted in Figs. 3(a). In the paramagnetic case, dispersion renormalization is defined as\n\u0001\nZd0 = Zω0 Zk0F = Zω0 1 + ∂Σ′ /vF0 ∂k .\n(7)\n\nThis implies that in a conventional picture the deviation in behavior of Zd0 from spectral weight renormalization Zω0 comes solely from the k−dependence of the\nself-energy. Since this self energy is approximately kindependent, one finds Zd0 ≈ Zω0 . In sharp contrast, the\ncalculated Zd [Fig. 3(b)] shows a strikingly opposite doping dependence to Zω . This can be understood to be\n\n\f4\nNCCO\n\nx=0.0\n\n(a) 1.0\n\nLSCO\n\nx=0.05\n\n(b) NCCO\n\nx=0.15\n\n0.8\n\nSDW\nZ\nω\n\n0.6\n\n0.4\n\n0.0\n\nΓ\n\n(π,0)\n\nk\n\nΓ\n\n(π,π)\n\nω\n\nPRT\n\nExpt.\n\nZω\n\nn(k)\n\nZ0\n\n0.8\n\nZω\n\n0.5\n\n(c) LSCO\n\nZω\n\n0.0\n−0.2\n\n−0.1\n\n0.0\ndoping (x)\n\n0.1\n\n0.2\n\nFIG. 2: (color online) (a) n(k) for NCCO and LSCO at several representative dopings with dashed lines showing the discontinuous jump at kF (highlighted in inset). Gold arrows mark features from the shadow bands which cross EF . (b) Zω at EF are\nshown along the antinodal (red) and nodal (blue) direction for NCCO. Filled (open) symbols give the main (shadow) bands,\ncompared with their corresponding analytical approximation ZωSDW plotted by solid (dashed) line of same color. ARPES result\n(green) is extracted from Ref. 16. (c) Same as (b) but for LSCO along the nodal direction. These results are compared with\nPRT's calculations for hole doping28 and ARPES results3 for LSCO along the nodal direction. All the experimental data and\nPRT data in (b) and (c) are normalized to highlight their doping evolution. Brown dashed line shows that if there is nanoscale\nphase separation in LSCO then Zω would scale linearly with doping in the extreme underdoped region.\nQP−GW\n\nExpt.\n\nPRT\n\nLSCO\nNCCO\n\n(b) NCCO\n\n(c) LSCO\n\n(a)\n\n1\n\nZSDW\nd\n\nExperiment\n\n0.5\n\nMFT\n\n0\n0.0\n\nZd\n\nZd\n\n1.0\n\nvF\n\n(eV−Ao)\n\n2\n\n0.1\n\nx\n\n0.2\n\n0.3\n\n−0.2\n\n−0.1\n\n0.0\n\n0.1\n\n0.2\n\nx\n\nx\n\nFIG. 3: (color online) (a) Fermi velocity vF along the antinodal direction in NCCO and nodal direction in LSCO is compared\nwith ARPES data on LSCO3,40 and with PRT's calculation28 . The blue dashed (solid) line gives the corresponding LDA (MFT)\nresults for LSCO. (b) Dispersion renormalization Zd for NCCO along antinodal direction, compared with an approximate\nanalytical formula for the dispersion renormalization ZdSDW (solid line). (c) Same as (b) but for LSCO along the nodal\ndirection. The results are compared with experimental data1 .\n\nthe result of an SDW gap, which introduces a new kdependence in the dispersion renormalization as given\nby (Eq. C2):\n\u0012\n\u0013\n∆2\n0\nSDW\n0 SDW\n= Zω 1 +\nZd\n= Zω ZkF\n. (8)\nξkF ξkF +Q\nFigs. 3(b) and (c) compare Zd and ZdSDW for NCCO\nand LSCO respectively. Thus the doping dependence of\nZd implies that as we go towards the Mott insulator, the\ndispersion tends towards the LDA-bands, consistent with\nLSCO results (blue open circles)1 . The opposite doping\ndependences of Zd and Zω can be readily understood by\ncomparing the corresponding analytical formulas ZdSDW\n\n(Eq. 8) and ZωSDW (Eq. 4). ZdSDW (ZωSDW ) varies with\nSDW gap as ∆ (1/∆), increasing (decreasing) with underdoping. This in turn moves the in-gap states further\naway from the Fermi level (hence decreasing Zω ), and\nthus shifting the band towards the LDA values (increasing Zd )42 .\n\nIII.\n\nSPECIFIC HEAT\n\nA striking application of the renormalization effects\ncan be seen in the doping evolution of the specific heat.\nA general expression for the specific heat cV in the SDW\n\n\f5\n(a) NCCO\n4\n\nγ ( x ) [mJ/K2 mole]\n\n2\n\nLDA\nMFT\nQP−GW\nExpt.\n\n0\n0\n15\n\n0.1\n\n0.2\n\n(b) LSCO\n10\nγ\nns\n\n5\n\n0\n0\n\n}\n\nExpt.\nχ\nQP−GW\n0.1\n\nx\n\n0.2\n\n0.3\n\nFIG. 4: (color online) (a) Specific heat coefficient γ(x) for\ndifferent theoretical calculations (various lines), and the experimental results on NCCO (red squares)8 and PLCCO\n(red circles)9 . (b) Same as (a) but for LSCO (red squares3\nand triangles7 ). Results are compared with ns [filled green\nsquares3 and open green squares40 ] and χ (blue)43 ), all normalized at the VHS. The red dashed line shows that in underdoped LSCO γ scales linearly with doping. Theoretical\nγ has been scaled by a factor of 1.1, consistent with a weak\nelectron-phonon renormalization.\n\nstate including the self-energy correction is given in Appendix D. We find that the Sommerfeld coefficient γ can\nbe well described in terms of the density of state (DOS)\n(N (0)) in the SDW state as44 ,\nγ = cV (T )/T ≈\n\n2\n2π 2 kB\nN (0)/Zω0 ,\n3\n\n(9)\n\nwhere N0 (0) is the mean-field DOS with SDW gap but\nwithout self energy corrections.\nFig. 4 compares experimental values of γ as a function\nof doping in LSCO3,7 and electron doped NCCO8 and\nPr1−x LaCex CuO4 (PLCCO)9 with several calculations\nincluding bare LDA, MFT results with SDW gap, and\nwith self-energy correction for both NCCO and LSCO.\nThe striking differences between NCCO and LSCO away\nfrom half-filling are due to the presence of the van-Hove\nsingularity (VHS) near EF in the latter case. N (0)\nin LDA thus decreases (from a finite value at x = 0)\nwith increasing electron doping, whereas for LSCO N (0)\nhas a peak at the doping corresponding to the VHS\nxV HS ∼ 0.201 . SDW order opens a gap, reducing N (0),\nand introduces steps associated with the collapse of the\nSDW gap. Thus, for electron doping N (0) is nearly flat\n\nfor x < 0.11, reflecting the quasi-two dimensionality of\nthe electron pocket (constant DOS) in cuprates. The step\nat x ∼ 0.11 signals the appearance of the hole pocket.\nSimilarly in LSCO the appearance of the electron pocket\nnear (π, 0) at x ≈ 0.17 within our model greatly enhances\nthe VHS features. Finally, adding self-energy corrections\n(in the form of 1/Zω0 ) preserves the general shape of the\nSDW γ, while shifting its magnitude back towards the\nLDA values. It is interesting to relate the doping dependence of γ(0) and Zω in Fig. 2(b). Note that Zω\nis evaluated at a particular Fermi momentum whereas\nγ(0) is computed after summing over Zω at all kF . As\nZω exhibits complimentary doping dependencies for main\nand shadow bands, so the total remains fairly constant.\nThese results are in striking contrast to the strong coupling limit where γ should diverge with the effective mass\nas x → 0.45\nThe agreement with experiment is quite good in LSCO\nfor x ≥ 0.10, including the strong VHS feature. Interestingly, the superfluid density ns and the paramagnetic\nsusceptibility data, which are proportional to the total\nFS areas, show a similar doping dependence to γ. However, below x = 0.10 γ → 0 as x → 0, an effect not\ncaptured by our calculations. Such an effect could be\ndue to a Coulomb gap7 and/or nanoscale phase separation. The linear dashed line in Fig. 3(b) illustrates the\ncorrected form expected in the latter case. Note that\nnanoscale phase separation would produce the dashed\nline seen in Fig. 2(c) as well as explain the anomalous\ndoping dependence of the chemical potential.46 Hence\nthe enhanced gossamer features seen in LSCO may be\nrelated to nanoscale phase separation.\n\nIV.\n\nDISCUSSION\n\nThe present calculations are most appropriate for electron doping, where only the (π, π) commensurate SDW\norder is observed, and the model is in very good agreement with experiment. Remarkably, the same model\nwhen applied to hole-doped cuprates describes many aspects of the two-gap scenario23,47 , despite the fact that\nit does not capture the incommensurate magnetization.\nThe non-Fermi-liquid behavior presented here is not sensitive to the specifics of the competing order, but only\nto the resulting superlattice q-vector. We have analyzed other candidates for the competing order including charge, flux, or d−density waves23, and find that the\nresults are insensitive to the nature of the competing order state. Thus, Eqs. 4 and 8 continue to hold for any\nQ = (π, π) order, as long as the appropriate gap ∆ is\nused.\nIn the presence of long-range magnetic order, the\nGreen's function develops a second pole, and should\nproperly be treated as a tensor. However, the pseudogap\nphase is more likely to be associated with only short range\norder, in which case the second pole does not cross the\nreal axis, the Green's function can be treated as a scalar,\n\n\f6\n\nV.\n\n(a)\n\n2\n\nU (eV)\n\n0.7\nZ\n\nand the information about incipient gap formation is encoded in the self-energy.48 The analytic approximations of\nEqs. 4 and 8 mimic this effect by treating the renormalization factors as acting on the paramagnetic dispersion\nξk , with information on proximity to long-range magnetic\norder encoded into ZωSDW and ZdSDW .\nThis approach is similar to the phenomenological\nmodel introduced by Yang et al.49 to describe RVB\nphysics. Indeed, their phenomenological self energy is\nquite similar to the form expected for a NAFL, except for\nthe treatment of scattering at the magnetic zone boundary, which splits the pockets expected for AF order into\ntwo half-pockets. One puzzle is that the effect of strong\nscattering at a superlattice zone boundary is already\nwell understood in standard Lifshitz-Kosevich theory50 ,\nwhere it leads to a quantum switching between arcs of\nFermi surface. This produces harmonic mixing frequencies in a quantum oscillation (QO) spectrum, and it is\nhard to see how it could evolve into the short-circuiting\neffect of Yang, et al. At any rate, the QOs observed in\nNCCO are more consistent with the present model.19\n\n0.6\n0.0\n\n0.1\n\n0.2\n\nU\n(b)\nZU\nMFT\n\n1\n0.0\n\nx\n\n0.1\nx\n\n0.2\n\nFIG. 5: (color online) (a) Average renormalization factor Z\ndecreases linearly with doping, very much like Zω0 in Figs. 2(b)\nand (c). (b) Our computed doping dependence of selfconsistent values of U and ZU is compared with earlier mean field\nresults32,60 .\n\nCONCLUSION\n\nIn conclusion, we have shown that a number of salient\nfeatures of the non-Fermi-liquid state of the underdoped\ncuprates can be understood within the framework of a\ncompeting density wave order, which breaks the particlehole symmetry, and drives reconstruction of the FS. We\nprovide a transparent and analytic basis for describing\nhow the non-Fermi-liquid effects play out in renormalizing spectral weight via Zω and electronic dispersion\nvia Zd , and how they conspire to yield a specific heat\nin the cuprates which is essentially conventional in nature at all dopings. Our framework would provide a\nstraightforward basis for understanding how the brokensymmetry order leads to 'non-Fermi-liquid' effects, not\nonly in the cuprates, but also in heavy-fermions51, Febased superconductors52 and other strongly correlated\nmaterials.\n\nFIG. 6: (color online) (a) Spectral intensity as a function of\nω along the high-symmetry lines for several dopings (at temperature T = 0). Blue to red color map gives the minimum\nto maximum intensity. The yellow dashed line gives the underlying LDA dispersion where the gold lines represent the\nrenormalized magnetic bands (Σ0 -dressed). (b) The QP-GW\nDOS (blue lines) is compared with Σ0 -dressed DOS (red line)\ncalculated at T = 0. The green lines show the DOS without\nthe vertex correction.\n\nin a GW-like formalism using a simplified (one parameter) scheme where the input and final self-energies are\nself-consistent in the coherent part only (QP-GW model).\nIn the following, we use a 'tilde' over a quantity to\nsymbolize that it is a 2 × 2 matrix. The self-energy in\nthe underdoped region is written in canonical form using\nthe Nambu formalism as\nΣ̃t (k, σ, iωn ) = Σ̃(k, σ, iωn ) + φ(k, σ, iωn )τ ̃1 .\n\nAcknowledgments\n\nThis work is supported by the U.S.D.O.E grant DEFG02-07ER46352, and benefited from the allocation\nof supercomputer time at NERSC and Northeastern\nUniversity's Advanced Scientific Computation Center\n(ASCC).\nAppendix A: Details of quasiparticle-GW (QP-GW)\nModel\n\nIn the QP-GW formalism the bare dispersion is taken\nas the LDA dispersion (ξk = ǫk − EF ), modeled via a\ntight-binding (TB) fit53–57 . We calculate the self-energy\n\n(A1)\n\nThe dressed Green's function is then\nG̃−1 (k, σ, iωn ) = iωn 1̃ − H̃LDA − Σ̃t (k, σ, iωn ) (A2)\nwhere H̃LDA is the bare Hamiltonian defined in the\nmagnetic zone as diag[ξk , ξk+Q ], and the τ̃i are Pauli\nmatrices. At each step, we adjust the chemical potential\nEF to fix the doping. Real frequency Green's functions\nare extracted from the Matsubara results by analytic\ncontinuation iωn → ω + iδ. Here, Σ̃(k, σ, iωn ) is a\n2 × 2 matrix in the SDW state58 , whose diagonal part\nrenormalizes H̃LDA , while the off-diagonal term gives\na (small) anomalous frequency dependence to the gap\nfunction φ(k, σ, iωn ) = σ∆. ∆ = U S is the magnetic\ngap parameter and S is the magnetization at the\n\n\f7\ncommensurate vector Q = (π, π) for Hubbard U , which\nis calculated using a mean-field approximation23. The\ndoping dependence of the on-site Hubbard U is obtained\ndue to charge screening from U = hV (q)/(1 + V (q)χ(q)i,\nwhere V (q) is the long-range Coulomb interaction59 ,\nand χ(q) is the charge susceptibility in the φ−gapped\nstate defined below. The obtained values of screened U\nare given in Ref. 26 and plotted in Fig. 5(b).\nWe calculate the self energy due to the spin as\nwell as the charge response within a GW framework as\nΣ̃(k, σ, iωn ) =\n\n3 2\nU Z\n2\n\n′ Z\nX\n\nq,σ′\n\n∞\n−∞\n\ndωp\n2π\n′\n\nG̃(k + q, σ ′ , iωn + ωp )Γ(k, q, iωn , ωp )Im[χ̃σσ\nRPA (q, ωp )],\n(A3)\nwhere the prime over the momentum summation indicates that the summation is restricted within the magnetic Brillouin zone. The dressed susceptibility in the\nabove equation is given in terms of the 2 × 2 RPA susceptibility as,58\nσσ/σσ̄\n\nσσ/σσ̄\n\nχ̃RPA (q, iωn ) =\n\nχ̃0\n1̃ ±\n\n(q, iωn )\n.\nσσ/σσ̄\nU χ̃0\n(q, iωn )\n\n(A4)\n\nHere the superscript (σσ) refers to the combined charge\nplus longitudinal spin susceptibility tensor, whereas (σσ̄)\n(with σ̄ = −σ) gives the transverse susceptibility tensor,\nσσ/σσ̄\nand the χ̃0\n(q, iωn ) are bare susceptibilities.\nA self-consistent 'dressed' GW calculation would\ninclude Σ on the right-hand side of Eq. A3 in both\nG and χ0 . This generally leads to problems unless a\nvertex correction Γ is included. Improved results are\noften found by using a 'bare' G0 and χ0 – bare in the\nsense of not including Σ. This latter G0 W0 −scheme\nalso fails in the present calculation by producing too\nlarge a renormalization of the band dispersion. This is\nbecause the imaginary part of the bare susceptibility\nhas the form χ′′0 ∼ δ(ω − [ξk+q − ξk ]), so that near\nthe Fermi surface, χ′′0 should scale in frequency with\nthe dressed quasiparticle dispersion. Since G0 W0 uses\nthe bare dispersions, peaks in χ′′0 , which control the\nrenormalization, lie at too high an energy.\nWe therefore introduce a modified, or 'quasiparticle'\n(QP) GW approximation5 for the right-hand side (RHS)\nof Eq. A3, as follows. In Eq. A3, we dress both G0 and\nχ0 with an 'input' self-energy chosen as\nΣ̃(iωn ) = (1 − 1/Z)iωn 1̃.\n\n(A5)\n\nThus, the input Σ contains a single parameter Z, which\ngives an overall renormalization of the 'input' dispersions\n(RHS of Eq. A3). With this approximation, the bare\n\nsusceptibilities become\nσσ/σσ̄\nχ̃0\n(q, iωn )\n\n= −Z\n\n2\n\n′ X\nX\n\n′\n\nσσ/σσ̄\nS̃ν,ν ′\n\nk ν,ν ′\n\nν\n)\nf (ZEkν ) − f (ZEk+q\nν\niωn + ZEkν − ZEk+q\n′\n\n(A6)\n\nThe prime over the summation has the same meaning as\nin Eq. A3. In Eq. A6, the ν summation is over the two\nmagnetic bands UMB (ν = +) and LMB (ν = −):\nEk± = (ξk+ ± E0k )\n\n(A7)\n\nq\n(ξk− )2 + ∆2\nwith ξk± = (ξk ± ξk+Q )/2 and E0k =\n(Ref. 42), f (E) = 1/(1 + exp (E/kB T )) is the Fermi\nfunction at temperature T , and kB is the Boltzmann conσσ/σσ̄\ngive the amplitude\nstant. The coherence factors S̃ν,ν ′\nof the scattering of the quasiparticles with the charge\nand magnon modes of the system respectively with components\nσσ/σσ̄\n\n(11) = (αk αk+q ± νν ′ βk βk+q )2 ,\n\nσσ/σσ̄\n\n(12) = −ν(αk βk ± νν ′ αk+q βk+q ). (A8)\n\nS̃ν,ν ′\nS̃ν,ν ′\nHere\n\ns \u0012\n\u0013\nξ−\n1\nαk (βk ) =\n1± k\n2\nE0k\n\n.\n\n(A9)\n\nrespectively are the weights associated with the U/LMBs.\nThe other coherence factors in Eq. A8 can be derived\nusing the translational symmetry with respect to q.\nA limitation of the present scheme is also apparent\nfrom Eq. A3. This self-energy is a good approximation\nfor the coherent, dressed bands, but does not extend to\nthe incoherent part of the spectrum, thereby underestimating the incoherent spectral weight. We have empirically found that this can be partly remedied by incorporating a vertex function Γ. Consistent with the QP\napproximation, the vertex correction to the self-energy is\nobtained through Ward's identity as\nΓ(k, q, iωn , ωp ) = 1 − (∂Σ′ /∂ω)ω=ω0 = 1/Z.(A10)\nEven though we have chosen perhaps the simplest form of\nthe vertex correction, it has a large impact on the spectral\nweight transfer. Γ = 1/Z eventually reduces the renormalization of the bare susceptibility in Eq. A3 and hence\nthe spectral weight is spread out more towards higher\nenergies, enhancing the incoherent spectral weight. An\nillustration of the importance of this vertex correction is\ngiven in Fig. 6(b).\nNext we discuss our self-consistent scheme, and explain how the parameter Z is chosen. We choose Z to\nmatch the average renormalization in the low-energy (coherent) part of the spectrum. Specifically, if Σ′ is the\nreal part of the diagonal self energy, then we adjust Z\nself-consistently until it satisfies Z = (1 − ∂Σ′ /∂ω)−1\nω=ωo ,\n\n\f8\n(a)\n\n0.4\n\n0.00\n−0.25\n\nΣ0\nΣ1\n\nΣ2\nΣ3\n\nΣ′′ [eV]\n\nΣ′ [eV]\n\n0.25\n\n(b)\n\n0.2\n0.0\n−4\n\n−2\n\n0\nω [eV]\n\n2\n\n4\n\nFIG. 7: (color online) Real and imaginary part of the selfenergy as expanded in the tight-binding form of Eq. A11.\n\nwhere ωo is an average quasiparticle excitation energy,\nwhich is related to the poles in G. This gives a good selfconsistent result for the coherent spectral weight in the\nlow-energy region (see Fig. 6(a)), whereas the incoherent\nparts in the higher energy regions are not self-consistent.\nThus our scheme is in the spirit of Landau's quasiparticles, except that Landau assumed that all of the spectral\nweight goes into the QP band, while we have only a fraction Z.\nWhen this is done, we find that U is effectively further\nrenormalized by the doping dependent Z [Fig. 5(a)], so\nthat the product U χ0 is approximately independent of Z.\nThe resulting ZU closely resembles our earlier mean-field\ncalculations as shown in Fig. 5(b).\nLastly, we find that the momentum dependence of the\nfluctuation self-energy Σ is relatively weak5,6 . To emphasize this point, we expanded the momentum dependence\nof the self energy in a form similar to the tight-binding\nmodel:\nΣ(ω, k) = Σ0 (ω) + Σ1 (ω) (cx + cy )\n+Σ2 (ω)cx cy + Σ3 (ω) (c2x + c2y ) ,(A11)\nwhere cα(x/y) = cos (αk(x/y) a).\nWe calculate the\nself-energy at four high symmetry points k =\n(0, 0), (π, 0), (π, π) and (π/2, π/2) to obtain the above\ncoefficients as shown in Fig. 7.\nClearly, only the\nk−independent part (red line) has a strong contribution.\nTherefore, we have simplified the self-energy calculation\nby approximating it with a k-independent average value\ntaken as the value at k = (π/2, π/2). Since we are neglecting the k−dependence of the self energy, Σ11 = Σ22\nand Σ12 = Σ21 .\nFigure 8(a) shows that in the QP-GW scheme the spectral weight splits up into four band-like features. The two\nbands closer to the Fermi level are the UMB and LMB,\nassociated with the development of the spin-density wave\n(SDW). The residual incoherent spectral dispersions at\nhigher energies are the UHB and LHB. Similar four band\nfeatures are found in the variational cluster calculations\nshown in Fig. 8(b)27 . The corresponding density of states\n(DOS) shows four peaks associated with these four bands,\nFigs. 8(c)-(f). These four band features separated by\nSDW gap or 'waterfall' effects show semi-quantitative\nagreement with QMC results6,61 . With doping, the two\nmagnetic bands merge in a QCP near optimal doping,\n\nFIG. 8: (color online) (a) The spectral intensity of NCCO at\nx = 0, plotted (in logarithmic scale) along the high-symmetry\nlines, is compared with variational calculations27 in (b). (c)(f) The computed DOS at various dopings are compared\nwith the corresponding QMC results (blue lines) for x = 0.0\n[Ref. 61] and for x = 0.05 to x = 0.20 [Ref. 6].\n\nwhile the two Hubbard bands occur at the top and bottom of the LDA bands, and hence the associated Hubbard band splitting is comparable to the LDA bandwidth\nat all dopings.\nAppendix B: Summary of renormalization factors\n\nWe summarize the various renormalization factors that\narise in this study for convenience reference. Equation\nnumbers in square brackets indicate where a specific factor is discussed in the text.\nZω = ∆n(kF )\n[Eq. 2]\n= Total spectral weight renormalization.\n−1\n\nZω0 = (1 − ∂Σ′ /∂ω)ω=0\n[Eq. 3]\n= Self energy contribution to spectral weight\nrenormalization.\n\n\f9\nZωSDW\n\n\nZω0 \n1±\n=\n2\n\n1+\n\n\u0012\n\nξkF\n\n2∆\n− ξkF +Q\n\n\u00132 !−1/2\n\n\n\n\n[Eq. 4]\n= Analytical formula for SDW spectral weight\nrenormalization.\n\nwhere Ēk± = Zω0 Ek± ). Therefore, the coherent part is\ngoverned by the SDW coherence factors αk and βk for\nthe filled state with a renormalization by Zω0 . The zeroth\nand first order moment of the spectral weight (Eq. 1)\nthen can be approximated respectively as28 ,\nn(k) =\n\nZd = vF /vF0\n= Velocity renormalization.\n\n[Eq. 6]\n\n≈\nM1 (k) =\n\nZd0\n\nZω0 Zk0\n\nZω0\n\n′\n\n/vF0 ∂k\n\n\u0001\n\n1 + ∂Σ\n[Eq. 7]\n=\n=\n= Conventional dispersion renormalization.\n\n\u0001\n[Eq. 8]\nZdSDW = Zω0 1 + ∆2 /ξkF ξkF +Q\n= Analytical formula for SDW dispersion\nrenormalization.\nγ = cV /T\n= Specific heat coefficient.\n\n[Eq. 9]\n\nNear the Fermi level, the dressed Green's functions\nfrom Eq. A2 can be approximated as,\n\n=\n\nω − ξ ̄k+Q\n(ω − ξ ̄k )(ω − ξ ̄k+Q ) + (∆)2\n\nω−\n\nZω0\nSDW\nZd\n(k)ξk\n\nA11 (k, ω)dω\n−∞\n\u0002\nZω0 α2k θ(−Ēk+ ) +\nZ 0\n\n\u0003\nβk2 θ(−Ēk− )\n\n(C4)\n\nA11 (k, ω)ωdω\n\u0002\n\u0003\n− kF ) α2k vF+ θ(−Ēk+ ) + βk2 vF− θ(−Ēk− ) .\n(C5)\n\n−∞\nZω0 (k\n\nIn the second equation above, we have expanded the\nrenormalized band near the Fermi level as Ēk± ≈ vF± (k −\nkF ), where vF is the corresponding Fermi velocity. The\nsingularity in n(k) becomes\nZω = ∆n(kF ) = Zω0 α2kF ≡ Zω+\nZω0 βk2 F\n\n≡\n\nZω−\n\nfor UMB\nfor LMB. (C6)\n\nNote that in the present case, the weight for UMB (LMB)\nappears along the antinodal (nodal) direction when the\nband crosses the Fermi level. Inserting the form of α, β\nfrom Eq. A9, we get Eq. 4. Similarly, inserting this Zω\nin Eq. C5, we can measure the singular jump in M1 (k)\nas\n∆ (dM1 (k)/dk) = Zω± vF± .\n\n(C1)\n\nwhere ξ ̄k = Zω0 ξk , ∆ = Zω0 ∆, and ξk is the bare (LDA)\ndispersion calculated at the same doping. In Eq. C1,\nZω0 = (1 − ∂Σ′11 (ω)/∂ω)−1 (Eq. 3) is the part of the spectral weight renormalization due to the self-energy, where\nwe have neglected the contribution of Σ12 . Even though\nwe assume a k−independent self-energy and thus Zk0 = 1\nfrom Eq. C1, the SDW gap introduces a k−dependent\ndispersion renormalization (defined here at ω = 0) given\nby\n\u0012\n\u0013\n∆2\nSDW\n0\nZd\n(k) = Zω 1 +\n.\n(C2)\nξk ξk+Q\nNote that ξk , ξk+Q , and ∆ are all bare values in Eq. C2\nas the same renormalization factor Zω0 gets cancelled out\nin the last term. Furthermore, we can split the spectral\nfunction A(k, ω) = ImG(k, ω)/π into a coherent part (at\nFermi level) and an incoherent part where the former can\nbe represented by a delta function as\n\u0001\nA11 (k, ω) = Zω0 α2k δ(ω − Ēk+ ) + βk2 δ(ω − Ēk− ) ω=0\n+ Aincoh (k, ω > 0)\n\n0\n\n=\n\nAppendix C: Analytical form of various\nrenormalization factors\n\nG11 (k, ω) = Zω0\n\n≈\n\nZ\n\n(C3)\n\n(C7)\n\nThus Zω and vF acquire a k-dependence through the\nSDW coherence factor.\n\nAppendix D: Specific Heat Calculation\n\nFollowing the derivation by Abrikosov et. al.44 , we\ncalculate the entropy in the SDW state for a strongly\ncorrelated system at finite temperature (in the low temperature limit) as\n\u0013\n\u0012\n2 Z ∞\n2βkB\n∂f (ω)\nS(T ) = −\ndωω −\n2πi −∞\n∂ω\nh\ni\nX\n−1\n×\nTr ln G̃R (k, σ, ω) − ln G̃−1\n(k,\nσ,\nω)\n.\nA\nk,σ\n\n(D1)\n\nHere the 2 × 2 retarded and advanced (dressed) Green's\nfunctions GR /GA depend on the temperature through\nthe SDW order parameter only, which has a very weak dependence in the low temperature region. We can rewrite\nEq. D1 in terms of a dimensionless parameter y = βω following Ref. 62, and then taking the temperature deriva-\n\n\f10\ntive we get the expression for the specific heat as\nZ\nkB β 2 ∞\ncV (T ) = −\ndyy 2 sech2 (y/2)\n4π −∞\n\u0013\u0015\nX \u0014 \u0012\n∂ −1\n×\nTr Im G̃R (k, σ, ω)\nG̃R (k, σ, ω)\n.\n∂ω\nω=y/β\nk,σ\n\nwhere A11 is given in Eq. C3 and A22 = A11 (k → k+ Q),\ni.e., A22 is similar to A11 , only the weights (α2k , βk2 ) are\ninterchanged. We have used Eq. D3 in the calculation\nof Fig. 5. The constraint α2k + βk2 = 1 removes these\nSDW coherence factors from the equation. Neglecting\nthe off-diagonal term proportional to the small quantity\n∂Σ12 /∂ω, the specific heat expression becomes\n\n(D2)\n\ncV (T ) behaves linearly with T in the low temperature\nregion, while the slope (γ) undergoes an abrupt change\nwith a kink in the waterfall region. Since the high energy\nkink energies for cuprates are around 0.3 to 0.6 eV, the\nkink should appear in cV only at a very high temperature,\nTk ∼ 103 K. Thus, in our calculation of γ (Fig. 5), we\nhave used the full expression for cV above but evaluated\nit in the ω = 0 limit.\nIn the T = 0 (ω → 0) limit, Eq. D2 can be simplified\nas sech(y) = δ(y − βω). In this limit, the imaginary\npart of the self-energy is zero and thus the last quantity\nin Eq. D2 is calculated by noting that the ω−derivative\nof the real part of the self-energy is: diagonal term =\n1 − 1/Zω0 , and off-diagonal term =(∂Σ′12 /∂ω)ω=0 . This\nsimplifies Eq. D2 as\n\u0014\n2 2 2 X 1\n(A11 (k, 0) + A22 (k, 0))\ncV ≈ π kB T\n3\nZω0\nk\n\u0015\n∂Σ12\n+\n(A12 (k, 0) + A21 (k, 0)) ,\n(D3)\n∂ω\n\n1\n\n2\n\n3\n\n4\n\n5\n\n6\n\n7\n8\n\n9\n\n10\n\n11\n\nS. Sahrakorpi, R. S. Markiewicz, Hsin Lin, M. Lindroos,\nX. J. Zhou, T. Yoshida, W. L. Yang, T. Kakeshita, H.\nEisaki, S. Uchida, Seiki Komiya, Yoichi Ando, F. Zhou,\nZ. X. Zhao, T. Sasagawa, A. Fujimori, Z. Hussain, Z.-X.\nShen, and A. Bansil, Phys. Rev. B 78, 104513 (2008).\nT. Yoshida, X. J. Zhou, K. Tanaka, W. L. Yang, Z. Hussain, Z.-X. Shen, A. Fujimori, S. Sahrakorpi, M. Lindroos,\nR. S. Markiewicz, A. Bansil, Seiki Komiya, Yoichi Ando,\nH. Eisaki, T. Kakeshita, and S. Uchida, Phys. Rev. B 74,\n224510 (2006).\nT Yoshida, X J Zhou, D H Lu, Seiki Komiya, Yoichi Ando,\nH Eisak4, T Kakeshita, S Uchida, Z Hussain, Z-X Shen and\nA Fujimori J. Phys.: Cond. Mat. 19, 125209 (2007).\nR.B. Laughlin, cond-mat:0209269 (unpublished); F.C.\nZhang, Phys. Rev. Lett. 90, 207002 (2003).\nR.S. Markiewicz, S. Sahrakorpi, and A. Bansil, Phys. Rev.\nB 76, 174514 (2007).\nA. Macridin, M. Jarrell, Thomas Maier, and D. J.\nScalapino, Phys. Rev. Lett 99, 237001 (2007).\nS. Komiya and I. Tsukada, arXiv:0808.3671.\nT. Brugger, T. Schreiner, G. Roth, P. Adelmann, and G.\nCzjzek, Phys. Rev. Lett. 71 2481 (1993).\nShiliang Li, Songxue Chi, Jun Zhao, H.-H. Wen, M. B.\nStone, J. W. Lynn, and Pengcheng Dai, Phys. Rev. B 78,\n014520 (2008).\nT. Senthil and P.A. Lee, Phys. Rev. Lett. 103, 076402\n(2009).\nS. Sachdev, Max A. Metlitski, Yang Qi, and Cenke Xu\n\ncV ≈\n\n\u0003\n2 2 2 X\u0002\nπ kB T\nδ(−Zω0 Ek+ ) + δ(−Zω0 Ek− ) + ...\n3\nk\n\n\u0002\n\u0003\n2\n2\n≈ π 2 kB\nT N + (0) + N − (0) /Zω0 .\n3\n\n(D4)\n\nP\nHere, N ± (0) = k δ(−Ek± ) is the total density of states\nfor the (U/L)MBs at the Fermi level in the SDW state,\nbut without renormalization (mean-field theory). For\nboth NCCO and LSCO, Eq. D4 is an excellent approximation to the exact expression of Eq. D3. It is interesting\nto observe that in the final expression for cV (Eq. D4),\nthe self energy correction enters only through the renormalized DOS. Thus, in the QP-GW model, cV has the\nsame form as in conventional Fermi-liquid theory.\n\n12\n\n13\n\n14\n\n15\n\n16\n\n17\n\n18\n\n19\n\n20\n\n21\n\nPhys. Rev. B 80, 155129 (2009).\nN. S. Vidhyadhiraja, A. Macridin, C. Aźen, M. Jarrellaz,\nand Michael Ma, Phys. Rev. Lett. 102, 206407 (2009) .\nS. Sakai, Yukitoshi Motome, and Masatoshi Imada, Phys.\nRev. Lett. 102 056404 (2009).\nP. Wröbel, A. Maciag, and R. Eder et. al. J. Phys.: Cond.\nMat. 18 9749 (2006); P. Wröbel, W. Suleja, and R. Eder,\nPhys. Rev. B 78 064501 (2008).\nM. Ĉubrović, Jan Zaanen, and Koenraad Schalm, Science\n325 439 (2009); S.-S. Lee, Phys. Rev. D. 79, 086006 (2009).\nN.P. Armitage, F. Ronning, D. H. Lu, C. Kim, A. Damascelli, K. M. Shen, D. L. Feng, H. Eisaki, Z.-X. Shen, P. K.\nMang, N. Kaneko, M. Greven, Y. Onose, Y. Taguchi, and\nY. Tokura Phys. Rev. Lett. 88, 257001 (2002).\nN. P. Ong, Z. Z. Wang, and J. Clayhold, J. M. Tarascon, L.\nH. Greene, and W. R. McKinnon, Phys. Rev. B 35, 8807\n(1987).\nN. Doiron-Leyraud C. Proust, D. LeBoeuf, J. Levallois,\nJ.-B. Bonnemaison, D. A. Bonn, W. N. Hardy, and L.\nTailléfer, Nature (London) 447, 565 (2007).\nT. Helm, M. V. Kartsovnik, M. Bartkowiak, N. Bittner,\nM. Lambacher, A. Erb, J. Wosnitza, and R. Gross, Phys.\nRev. Lett. 103, 157002 (2009).\nB. Vignolle, A. Carrington, R. A. Cooper, M. M. J. French,\nA. P. Mackenzie, C. Jaudet, D. Vignolles, Cyril Proust and\nN. E. Hussey, Nature 455, 952 (2008). (1989).\nN.P. Ong, Z.Z. Wang, J. Clayhold, J.M. Tarascon, L.H.\n\n\f11\n\n22\n\n23\n\n24\n\n25\n\n26\n\n27\n\n28\n\n29\n\n30\n\n31\n\n32\n\n33\n\n34\n\n35\n\n36\n\n37\n\n38\n\n39\n\n40\n\n41\n42\n43\n\nGreene, and W.R. McKinnon, Phys. Rev. B35, 8807\n(1987).\nD. Pines, Physica C 235, 113 (1994); A.J. Millis, Hartmut\nMonien and David Pines, Phys. Rev. B 42, 167 (1990).\nTanmoy Das, R. S. Markiewicz, and A. Bansil, Phys. Rev.\nB 77, 134516 (2008) .\nSusmita Basak, Tanmoy Das, Hsin Lin, J. Nieminen, M.\nLindroos, R. S. Markiewicz, and A. Bansil, Phys. Rev. B\n80, 214520 (2009).\nThe waterfall effect has also been calculated by Y. Kakehashi and P. Fulde, Phys. Rev. Lett. 94, 156401 (2005);\nI.A. Nekrasov, K. Held, G. Keller, D.E. Kondakov, Th. Pruschke, M. Kollar, O.K. Andersen, V.I. Anisimov, and D.\nVollhardt, Phys. Rev. B73, 155112 (2006); and in Ref. 6.\nTanmoy Das, R. S. Markiewicz, and A. Bansil, Accepted\nin Phys. Rev. B (2010).\nC. Gröber, R. Eder, and W. Hanke, Phys. Rev. B 62, 4336\n(2000).\nA. Paramekanti, Mohit Randeria, and Nandini Trivedi,\nPhys. Rev. B 70, 054504 (2004).\nn(k) here is strictly the occupation density in the reduced\nzone and not the electronic momentum density, which can\nbe measured via Compton scattering (see, e.g Ref. 30) or\npositron-annihilation (see, e.g. Ref. 31) experiments.\nY. Tanaka, Y. Sakurai, A.T. Stewart, N. Shiotani, P.E.\nMijnarends, S. Kaprzyk, and A. Bansil, Phys. Rev. B 63,\n045120 (2001); S. Huotari, K. Hamalinen, S. Manninen,\nS. Kaprzyk, A. Bansil, W. Caliebe, T. Buslaps, V. Honkimaki, and P. Suortti, Phys. Rev. B 62, 7956 (2000).\nL. C. Smedskjaer, A. Bansil, U.Welp, Y. Fang, and K.G.\nBailey, J. Phys. Chem. Solids 52, 1541 (1991); P.E. Mijnarends, A.C. Kruseman, A. van Veen, H. Schut, and A.\nBansil, J. Phys.: Condens. Matter 10, 10383 (1998).\nTanmoy Das, R. S. Markiewicz, and A. Bansil, Phys. Rev.\nLett. 98, 197004 (2007).\nTanmoy Das, R.S. Markiewicz and A. Bansil, Journal of\nPhysics and Chemistry of Solids, 69 2963 (2008).\nShadow bands have recently been observed by ARPES\nin several cuprates. However, there are currently debates\nabout whether they are consistent with (π, π)35,36 or incommensurate order37,38 , and whether they are related to\npseudogap physics or parasitical structural superlattices.\nJ. Chang, Y. Sassa, S. Guerrero, M. Mansson, M. Shi, S.\nPailhés, A. Bendounan, M. Ido, M. Oda, N. Momono, C.\nMudry and J. Mesot, N. J. Phys. 10 103016 (2008).\nR.-H. He, X.J. Zhou, M. Hashimoto, T. Yoshida, K.\nTanaka, S.-K. Mo, T. Sasagawa, N. Mannella, W.\nMeevasana, H. Yao, E. Berg, M. Fujita, T. Adachi, S.\nKomiya, S. Uchida, Y. Ando, F. Zhou, Z.X. Zhao, A. Fujimori, Y. Koike, K. Yamada, S.A. Kivelson, Z. Hussain,\nand Z.-X. Shen, arXiv:0911.2245.\nH.-B. Yang, J.D. Rameau, P.D. Johnson, T. Valla, A. Tsvelik, and G.D. Gu, Nature 456, 77 (2008)\nJ. Meng, G. Liu, W. Zhang, L. Zhao, H. Liu, X. Jia, D.\nMu, S. Liu, X. Dong, W. Lu, G. Wang, Y. Zhou, Y. Zhu,\nX. Wang, Z. Xu, C. Chen, and X.J. Zhou, Nature 462, 335\n(2009)\nS. Sahrakorpi, M. Lindroos, R.S. Markiewicz, and A. Bansil, Phys. Rev. Lett. 95, 157601 (2005).\nK.-Y. Yang, C.T. Shih, C.P. Chou, S.M. Huang, T.K. Lee,\nT. Xiang, and F.C. Zhang, Phys. Rev. B 73, 224513 (2006).\nP. Prelovšek, A. Ramšak, Phys. Rev. B 65, 174529 (2002)..\nT. Das, R. S. Markiewicz, and A. Bansil, arXiv:0807.4257.\nA. Ino, T. Mizokawa, K. Kobayashi, A. Fujimori, T.\n\n44\n\n45\n46\n47\n48\n49\n\n50\n\n51\n\n52\n\n53\n\n54\n\n55\n\n56\n\n57\n\n58\n\n59\n\n60\n\n61\n\n62\n\n63\n64\n\n65\n\n66\n\n67\n\n68\n\n69\n\nSasagawa, T. Kimura, K. Kishio, K. Tamasaku, H. Eisaki,\nand S. Uchida, Phys. Rev. Lett. 81, 2124 (1998)\nA.A. Abrikosov, L.P. Gorkov, and I.E. Dzyaloshinski,\nMethods of Quantum Field Theory in Statistical Physics\n(Prentice-Hall, Englewood Cliffs, N.J., 1963) (Sec. 19.5).\nT. Koretsune and M. Ogata, Physica B 378, 323 (2006).\nA. Fujimori, et al., J. Elec. Spec. Rel. Phen. 92, 59 (1998).\nB.M. Andersen and P.J. Hirschfeld, arXiv:0811.3751.\nR.S. Markiewicz, Phys. Rev. B 70, 174518 (2004).\nK.-Y. Yang, T.M. Rice, and F.-C. Zhang, Phys. Rev. B73,\n174501 (2006).\nL.M. Falicov and P.M. Sievert, Phys. Rev. A138, A88\n(1965); A.B. Pippard, Proc. Roy. Soc. (London) A287, 165\n(1965); R.W. Stark and R. Reifenberger, J. Low-T. Phys.\n26, 763, 819 (1977); N.B. Sandesara and R.W. Stark, Phys.\nRev. Lett. 53, 1681 (1985).\nM.C. Aronson, R. Osborn, R. A. Robinson, J. W. Lynn, R.\nChau, C. L. Seaman, and M. B. Maple, Phys. Rev. Lett.\n75, 725 (1995); H. J. Im, arXiv:0904.1008.\nY.-M. Xu, P. Richard, K. Nakayama, T. Kawahara, Y.\nSekiba, T. Qian, M. Neupane, S. Souma, T. Sato, T. Takahashi, H. Luo, H.-H. Wen, G.-F. Chen, N.-L. Wang, Z.\nWang, Z. Fang, X. Dai, and H. Ding, arXiv:0905.4467.\nR.S. Markiewicz, S. Sahrakorpi, M. Lindroos, Hsin Lin,\nand A. Bansil, Phys. Rev. B 72, 054519 (2005).\nThe TB parmeters are taken to be doping independent in\nthe spirit of a rigid band picture. A more realistic treatment of the doping dependence of the electronic states (see,\ne.g., Refs. 55–57) was not undertaken. However, we expect\nthe rigid band model to be a good approximation for doping away from the Cu-O planes.\nA. Bansil, Zeitschrift Naturforschung A 48, 165 (1993); A.\nBansil, Phys. Rev. B20, 4035 (1979); L. Schwartz and A.\nBansil, Phys. Rev. B 10, 3261 (1974).\nS.N. Khanna, A.K. Ibrahim, S.W. McKnight, and A. Bansil, Solid State Commun. 55, 223 (1985).\nH. Lin, S. Sahrakorpi, R.S. Markiwicz, and A. Bansil,\nPhys. Rev. Lett. 96, 097001 (2006).\nJ.R. Schrieffer, X.G. Wen, and S.C. Zhang, Phys. Rev. B.\n39, 11663 (1989).\nR. S. Markiewicz and A. Bansil, Phys. Rev. B 75, 020508\n(2007).\nC. Kusko, et al., Phys. Rev. B 66, 140513(R) (2002); Tanmoy Das, R.S. Markiewicz, and A. Bansil, Phys. Rev. B\n74, 020506 (2006).\nT.A. Maier, M. Jarrell and D.J. Scalapino, Phys. Rev. B\n74, 094513 (2006).\nA. Toschi, M. Capone, C. Castellani, K. Held,\narXiv:0712.3723.\nS. Komiya and I. Tsukada, arXiv:0808.3671.\nZ.-H. Pan, P. Richard, Y.-M. Xu, M. Neupane, P. Bishay,\nA.V. Fedorov, H.-Q. Luo, L. Fang, H.-H. Wen, Z. Wang,\nand H. Ding, arXiv:0806.1177.\nW.F. Brinkman and T.M. Rice, Phys. Rev. B2, 4302\n(1970).\nR.S. Markiewicz, J. Lorenzana, and G. Seibold, Phys. Rev.\nB81, 014510 (2010).\nL.F. Tocchio, F. Becca, A. Parola, and S. Sorella, Phys.\nRev. B78, 041101(R) (2008).\nR.S. Markiewicz, J. Lorenzana, G. Seibold, and A. Bansil,\nPhys. Rev. B 81, 014509 (2010).\nN. D. Mermin and H. Wagner, Phys. Rev. Lett. 17, 1133\n(1966).\n\n\f"}