{"id": "http://arxiv.org/abs/0902.0734v1", "guidislink": true, "updated": "2009-02-04T15:40:27Z", "updated_parsed": [2009, 2, 4, 15, 40, 27, 2, 35, 0], "published": "2009-02-04T15:40:27Z", "published_parsed": [2009, 2, 4, 15, 40, 27, 2, 35, 0], "title": "The geodesic Vlasov equation and its integrable moment closures", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0902.2445%2C0902.2799%2C0902.2046%2C0902.1026%2C0902.0515%2C0902.2857%2C0902.1876%2C0902.1285%2C0902.0407%2C0902.3121%2C0902.2568%2C0902.1779%2C0902.2419%2C0902.3039%2C0902.4299%2C0902.3225%2C0902.1703%2C0902.3834%2C0902.0021%2C0902.0897%2C0902.2362%2C0902.3567%2C0902.1396%2C0902.4597%2C0902.0413%2C0902.1349%2C0902.0755%2C0902.0421%2C0902.0734%2C0902.1121%2C0902.0069%2C0902.0937%2C0902.4005%2C0902.0218%2C0902.0586%2C0902.4770%2C0902.2734%2C0902.3962%2C0902.0284%2C0902.3781%2C0902.1018%2C0902.2690%2C0902.2269%2C0902.3663%2C0902.4764%2C0902.1538%2C0902.0623%2C0902.4027%2C0902.0875%2C0902.2015%2C0902.2383%2C0902.2313%2C0902.3850%2C0902.1199%2C0902.3661%2C0902.0348%2C0902.4066%2C0902.2150%2C0902.2564%2C0902.1127%2C0902.2162%2C0902.2143%2C0902.1777%2C0902.1495%2C0902.2023%2C0902.4832%2C0902.1930%2C0902.3805%2C0902.3786%2C0902.2566%2C0902.4735%2C0902.1999%2C0902.3864%2C0902.1550%2C0902.0794%2C0902.1328%2C0902.1681%2C0902.2307%2C0902.1642%2C0902.0984%2C0902.0871%2C0902.3037%2C0902.1951%2C0902.1841%2C0902.2980%2C0902.1456%2C0902.0974%2C0902.3593%2C0902.4264%2C0902.3131%2C0902.3143%2C0902.0845%2C0902.2033%2C0902.1434%2C0902.0565%2C0902.4699%2C0902.1372%2C0902.4316%2C0902.4825%2C0902.0172%2C0902.4585&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The geodesic Vlasov equation and its integrable moment closures"}, "summary": "Various integrable geodesic flows on Lie groups are shown to arise by taking\nmoments of a geodesic Vlasov equation on the group of canonical\ntransformations. This was already known for both the one- and two-component\nCamassa-Holm systems. The present paper extends our earlier work to recover\nanother integrable system of ODE's that was recently introduced by Bloch and\nIserles. Solutions of the Bloch-Iserles system are found to arise from the\nKlimontovich solution of the geodesic Vlasov equation. These solutions are\nshown to form one of the legs of a dual pair of momentum maps. The Lie-Poisson\nstructures for the dynamics of truncated moment hierarchies are also presented\nin this context.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0902.2445%2C0902.2799%2C0902.2046%2C0902.1026%2C0902.0515%2C0902.2857%2C0902.1876%2C0902.1285%2C0902.0407%2C0902.3121%2C0902.2568%2C0902.1779%2C0902.2419%2C0902.3039%2C0902.4299%2C0902.3225%2C0902.1703%2C0902.3834%2C0902.0021%2C0902.0897%2C0902.2362%2C0902.3567%2C0902.1396%2C0902.4597%2C0902.0413%2C0902.1349%2C0902.0755%2C0902.0421%2C0902.0734%2C0902.1121%2C0902.0069%2C0902.0937%2C0902.4005%2C0902.0218%2C0902.0586%2C0902.4770%2C0902.2734%2C0902.3962%2C0902.0284%2C0902.3781%2C0902.1018%2C0902.2690%2C0902.2269%2C0902.3663%2C0902.4764%2C0902.1538%2C0902.0623%2C0902.4027%2C0902.0875%2C0902.2015%2C0902.2383%2C0902.2313%2C0902.3850%2C0902.1199%2C0902.3661%2C0902.0348%2C0902.4066%2C0902.2150%2C0902.2564%2C0902.1127%2C0902.2162%2C0902.2143%2C0902.1777%2C0902.1495%2C0902.2023%2C0902.4832%2C0902.1930%2C0902.3805%2C0902.3786%2C0902.2566%2C0902.4735%2C0902.1999%2C0902.3864%2C0902.1550%2C0902.0794%2C0902.1328%2C0902.1681%2C0902.2307%2C0902.1642%2C0902.0984%2C0902.0871%2C0902.3037%2C0902.1951%2C0902.1841%2C0902.2980%2C0902.1456%2C0902.0974%2C0902.3593%2C0902.4264%2C0902.3131%2C0902.3143%2C0902.0845%2C0902.2033%2C0902.1434%2C0902.0565%2C0902.4699%2C0902.1372%2C0902.4316%2C0902.4825%2C0902.0172%2C0902.4585&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Various integrable geodesic flows on Lie groups are shown to arise by taking\nmoments of a geodesic Vlasov equation on the group of canonical\ntransformations. This was already known for both the one- and two-component\nCamassa-Holm systems. The present paper extends our earlier work to recover\nanother integrable system of ODE's that was recently introduced by Bloch and\nIserles. Solutions of the Bloch-Iserles system are found to arise from the\nKlimontovich solution of the geodesic Vlasov equation. These solutions are\nshown to form one of the legs of a dual pair of momentum maps. The Lie-Poisson\nstructures for the dynamics of truncated moment hierarchies are also presented\nin this context."}, "authors": ["Darryl D. Holm", "Cesare Tronci"], "author_detail": {"name": "Cesare Tronci"}, "author": "Cesare Tronci", "links": [{"title": "doi", "href": "http://dx.doi.org/10.3934/jgm.2009.1.181", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0902.0734v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0902.0734v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "32 pages. Submitted to J. Geom. Mech", "arxiv_primary_category": {"term": "nlin.SI", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "nlin.SI", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0902.0734v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0902.0734v1", "journal_reference": null, "doi": "10.3934/jgm.2009.1.181", "fulltext": "arXiv:0902.0734v1 [nlin.SI] 4 Feb 2009\n\nThe geodesic Vlasov equation\nand its integrable moment closures\nDarryl D. Holm1, 2 , Cesare Tronci3\n1\n2\n3\n\nDepartment of Mathematics, Imperial College London, London SW7 2AZ, UK\n\nInstitute for Mathematical Sciences, Imperial College London, 53 Prince's Gate, London SW7 2PG, UK\nSection de Mathématiques, École Polytechnique Fédérale de Lausanne, CH-1015 Lausanne, Switzerland\n\nMay 28, 2018\n\nContents\n1 Introduction\n1.1 The Vlasov kinetic equation . . . . . . . . . . . . . . . . . . . . .\n\n2\n4\n\n2 Hamiltonian structure of Vlasov moments\n2.1 Kinetic moments and the Schouten concomitant . . . . . . . . .\n2.2 Statistical moments and their Lie-Poisson structure . . . . . . . .\n2.3 Truncation of moment hierarchies . . . . . . . . . . . . . . . . . .\n\n4\n5\n7\n10\n\n3 The\n3.1\n3.2\n3.3\n3.4\n\n11\n12\n14\n17\n17\n\ngeodesic Vlasov equation\nEuler-Poincaré equations on Hamiltonian vector fields\nThe ideal fluid dual pair for the Vlasov equation . . .\nKlimontovich solution and the Lagrange-to-Euler map\nGeometric kinetic theory . . . . . . . . . . . . . . . . .\n\n.\n.\n.\n.\n\n.\n.\n.\n.\n\n.\n.\n.\n.\n\n.\n.\n.\n.\n\n.\n.\n.\n.\n\n.\n.\n.\n.\n\n4 Moment closures of EPCan: integrable cases\n18\n4.1 Integrable closures of kinetic moments . . . . . . . . . . . . . . . 18\n4.2 Geodesic flow on statistical moments . . . . . . . . . . . . . . . . 21\n4.3 Klimontovich dynamics for statistical moments . . . . . . . . . . 21\n5 Bloch-Iserles system as a moment equation\n22\n5.1 Klimontovich solutions of the Bloch-Iserles system . . . . . . . . 25\n6 Conclusions and outlook\n\n27\n\n1\n\n\fAbstract\nVarious integrable geodesic flows on Lie groups are shown to arise by\ntaking moments of a geodesic Vlasov equation on the group of canonical transformations. This was already known for both the one- and\ntwo-component Camassa-Holm systems [GiHoTr2005, GiHoTr2007]. The\npresent paper extends our earlier work to recover another integrable system of ODE's that was recently introduced by Bloch and Iserles [BlIs2006].\nSolutions of the Bloch-Iserles system are found to arise from the Klimontovich solution of the geodesic Vlasov equation. These solutions are shown\nto form one of the legs of a dual pair of momentum maps. The Lie-Poisson\nstructures for the dynamics of truncated moment hierarchies are also presented in this context.\n\n1\n\nIntroduction\n\nKinetic equations govern the evolution of probability distributions in the phase\nspace of many-particle systems in non-equilibrium statistical mechanics. For example, the phase-space probability distribution of a many-particle system whose\ncorrelations are negligible is governed by the collisionless Boltzmann equation,\nalso known as Vlasov equation [Vl1961]. This equation encodes evolution of the\nVlasov single-particle probability distribution f (q, p, t) as conservation along\nphase space trajectories, written as\ndf\n=0\ndt\n\nalong\n\nq̇ =\n\n∂h\n,\n∂p\n\nṗ = −\n\n∂h\n,\n∂q\n\n(1)\n\nwhere h is the single-particle Hamiltonian, often expressed as the sum of kinetic\nand potential energies\n|p|2\nh=\n+ V (q)\n2\nin physical applications. Applying the canonical Poisson bracket {*, *} in the\nphase space variables (q, p) expresses the Vlasov equation in its familiar form\n∂f \b\n+ f, h = 0 .\n∂t\n\n(2)\n\nThe Hamiltonian structure of this system is well known [MaWe1981]. Namely,\nthe Vlasov equation possesses a Lie-Poisson bracket defined on the Lie algebra\nof canonical transformations, such that the Liouville theorem for preservation\nof the volume on phase space entirely characterizes Vlasov dynamics.\nThe moment method, widely used in probability theory, provides approximate descriptions of the Vlasov solutions. Moments are functionals of the distribution function f obtained by projections onto the space of phase space polynomials (symmetric tensors). Since the Vlasov distribution depends on both position q and momentum p, one may define two different types of moments. These\n2\n\n\fare the kinetic moments and the statistical moments. Kinetic moments are given\nby projection of the Vlasov distribution f (q, p) onto the n-th power of the singleparticle momentum, p. In contrast, statistical moments are integrals of f (q, p)\nagainst the n-th power of the full phase space vector, z = (q, p). The remarkable\nproperty of these two hierarchies of moment projections is that they each define\nequivariant momentum maps [HoLySc1990, ScWe1994, GiHoTr2008]. Consequently, the resulting moment dynamics is again Lie-Poisson. Moment equations possess interesting closures, which are given by the particular Lie algebra\nstructure determining their Lie-Poisson bracket. For example, kinetic moments\nof the Vlasov equation at zero-th and first order yield the familiar closure known\nas ideal fluid dynamics.\nRemarkably, these kinetic moment equations are associated to a family of\nintegrable dynamical systems, whose most famous example is probably the Benney system for shallow water dynamics [Be1973, Gi1981]. This convergence of\ndifferent areas of mathematical physics also occurs for several other integrable\nequations. For example, as shown in [GiHoTr2005], a specific form of the firstorder kinetic moment equation yields the Camassa-Holm equation [CaHo1993].\nExtending the system to include the zero-th order moment yields another integrable system; the two-component Camassa-Holm system [GiHoTr2007]. Interestingly enough, these Camassa-Holm systems are geodesic flows on different Lie\ngroups, arising as moment closures of the same kinetic equation, called here the\ngeodesic Vlasov equation or EPCan. The latter acronym refers to the EulerPoincaré (EP) equation on the group of canonical transformations Can acting\non phase space T ∗ Q.1 A special case of EPCan for canonical transformations\nwhose generating functions are linear in the canonical momentum has recently\nappeared in the theory of metamorphoses in imaging science [HoTrYo2007].\nThis paper reviews the theory of geodesic equations on the statistical moments and shows how such equations possess an additional interesting closure,\nwhich is related to the space of purely quadratic Hamiltonian functions. We find\nthat such a closure yields a particular case of yet another integrable system, recently discovered by Bloch and Iserles [BlIsMaRa2005, BlIs2006]. Moreover, extending to inhomogeneous quadratic Hamiltonians yields complete equivalence\nbetween moment equations and the Bloch-Iserles (BI) system.\nPlan The rest of this section adds a few more remarks about the Lie-Poisson\nbracket for the Vlasov equation. Section 2 is devoted to the Hamiltonian structure of the Vlasov moments and their truncations. Section 3 formulates the\ngeodesic Vlasov equation, presents its dual pair and illustrates the geometric\nfooting of kinetic theory. Section 4 shows how both of the Camassa-Holm systems are obtained as geodesic equations on kinetic moments. The last section\nderives the BI system from the statistical moment equations and presents the\ncorresponding Klimontovich solutions.\n1 The group of canonical transformations Can is also known as the Hamiltonian diffeomorphisms Dif fHam .\n\n3\n\n\f1.1\n\nThe Vlasov kinetic equation\n\nThe Vlasov equation is a Lie-Poisson Hamiltonian system on the group of canonical transformations of the phase space T ∗ Q for a configuration manifold Q\n[MaWe1981]. The dynamics of Lie-Poisson systems takes place on the dual g∗\nof the Lie algebra g of the symmetry group G. In this case G = Can(T ∗ Q) and\ng = Xcan (T ∗ Q). That is, the Lie algebra is the infinite-dimensional space of\nHamiltonian vector fields. Given the Lie algebra isomorphism between Hamiltonian vector fields and phase-space functions (Xcan ≃ F ), the dynamical\nvariable is a phase-space distribution f (q, p), i.e., a density on phase space\n(f ∈ F ∗ ≃ Den). Upon using the definition of canonical Poisson bracket {*, *},\nthe Vlasov Lie-Poisson structure is found to be\n\u001a\n\u001b\nZZ\nδF δH\n{F, H}[f ] =\nf (q, p)\ndK q dK p\n(3)\n,\nδf δf\nwhere K = dim(Q). The Vlasov equation (2) is recovered upon choosing F = f\nand h = δH/δf .\nIn many physical applications, the Vlasov Hamiltonian is the sum of kinetic\nand potential energy. For example, electrostatic or gravitational interactions\nare governed in the absence of collisions by the Poisson-Vlasov system whose\nHamiltonian is given by\n\u0013\n\u0012\nZ\nZZ\n1 2\n−1\n′\nK ′\n|p| + ∆\n(4)\nf (q, p ) d p dK q dK p ,\nH[f ] =\nf (q, p)\n2\nwhere ∆−1 denotes convolution with the Green's function of the Laplace operator.\n\n2\n\nHamiltonian structure of Vlasov moments\n\nThe moment method is a popular approach in kinetic systems theory. This\napproach is justified geometrically because taking moments of the Vlasov distribution is a momentum map [HoLySc1990, ScWe1994, GiHoTr2008]. This\nmomentum map arises via the dual of a Lie algebra homomorphism arising\nfrom the well-known isomorphism between symmetric tensors and polynomials.\nThe main point is that this momentum map endows the space of symmetric tensors with a Lie bracket, thereby generating a well defined Lie algebra. In what\nfollows, we shall analyze the cases of kinetic and statistical moments separately\nand then discuss their similarities.\n\n4\n\n\f2.1\n\nKinetic moments and the Schouten concomitant\n\nKinetic moments are constructed from the following fiber integral [QiTa2004]\nZ\nn\nAn (q, t) :=\n(p * dq) f (q, p, t) dK q ∧ dK p\nTq∗ Q\n\n=\n\nK\nX\n\ni1 ...in =1\n\nZ\n\np i1 . . . p in dq i1 ⊗ * * * ⊗ dq in f (q, p, t) dK q ∧ dK p\n\nTq∗ Q\n\n=\n\nK\nX\n\ni1 ...in =1\n\n\u0001\nAn (q, t) i1 ...in dq i1 ⊗ * * * ⊗ dq in ⊗ dK q , (5)\n\nwhere p * dq denotes the canonical one form (canonical momentum) and dK q is\nthe volume element on the configuration space Q. This construction projects the\nVlasov distribution onto the space of symmetric tensors. In particular, kinetic\nmoments are defined as symmetric covariant tensor fields carrying the volume\nelement. That is, they are symmetric covariant tensor densities.\nThe moments are functionals of the Vlasov density f . Hence, their variational derivative may be computed by applying the chain rule as\n∞\nX\nδF\nδF\n=\nδf\nδA\nn\nn=0\n\n∞\nX\nδAn\n:=\nδf\nn=0\n\n=\n=:\n\n∞\nX\n\nK\nX\n\ni1 ...in\nK\nX\n\nδ(An )i1 ...in\nδF\nδf\nδ(A\nn )i1 ...in\n=1\n\nn=0 i1 ...in =1\n∞\nX\nn=0\n\nδF\nδAn\n\np i1 . . . p in\n\nδF\nδ(An )i1 ...in\n\npn ,\n\nwhich explicitly defines the contraction operation\n. This chain rule formula\nexpresses the Lie algebra homomorphism (isomorphism) from symmetric tensors\nto polynomials, whose dual is the momentum map associated to the moments\n[GiHoTr2008]. Inserting the chain rule formula into the Vlasov bracket yields\nthe Lie-Poisson bracket for moments,\n\u0015\n\u0014\nZ\n∞\nX\nδF δG\nd3 q\n(6)\n,\n{F, G} [A] = −\nAm+n−1 (q)\nδA\nδA\nn\nm\nn,m=0\nin which the bracket2\n\"\n#\nδF\nδG\n= S n\n,\nδAn δAm\n\n!\nδG\nδF\n*∇ ⊗\n−m\nδAn\nδAm\n\n!\n!\nδF\nδG\n*∇ ⊗\nδAm\nδAn\n\n(7)\n\nis inherited from the canonical Poisson bracket. Here the notation A * B for\none-index contraction between covariant and contravariant tensors is written as\n2 The\n\noperator S here takes the symmetric part of its argument.\n\n5\n\n\fkhl...\nkm...i\n(A*B)hl...\nand analogously for B*A = (B*A)km...\nAijl... .\nij... = Aij...k B\njl... = B\nThis bracket is well known in differential geometry as an invariant differential\noperator of first order [Ni1955]. In fact, this operation is a Lie bracket, which is\nknown as the Schouten concomitant or symmetric Schouten bracket. See, e.g.,\n[GiHoTr2008] for more discussions and references.\n\nRemark 2.1 (History of Lie-Poisson structure for kinetic moments)\nIn one dimension, the moment Lie-Poisson structure (6) is the KupershmidtManin bracket [KuMa1978] which was found in the context of the integrable\nBenney system in shallow water theory. Lebedev was the first to establish its relation with the Lie algebra of Hamiltonian vector fields in [Le1979] and Gibbons\nrecognized later [Gi1981] its direct relation to the Vlasov flow. In higher dimensions, Kupershmidt introduced a multi-index notation [Ku1987], corresponding\nto the occupation number representation of the symmetric Schouten bracket.\nThis observation suggested the quantum-like framework for kinetic moments in\n[GiHoTr2008], where the moment space is described in terms of a bosonic Fock\nspace.\nThe moment algebra comprises symmetric contravariant tensor fields and\nthese may be characterized as the Fock space represented by a direct sum of\nsymmetric powers of vector fields given by\n!\n!\nn\nn\nn\n∞\nO\n_\n_\nM\nX =: gn .\n(8)\nX := S\nX(Q)\nwith\ng :=\nn=0\n\ni=0\n\ni=0\n\ni=0\n\nThis is reminiscent of the universal enveloping algebra of the diffeomorphism\ngroup Diff(Q), which is the enveloping algebra U(X) of vector fields X(Q) on the\nconfiguration space Q. It is a standard result that the graded structure of an\nenveloping algebra possesses a Poisson bracket structure [DaSWe1999].\nRemark 2.2 (Kinetic moments and Poisson-Lie groups)\nInterestingly enough, the Schouten concomitant identifies the kinetic moment\nalgebra with the Lie algebra of symbols of differential operators. This identification is quite suggestive, since differential symbols are known to be a subalgebra of the Lie algebra of pseudo-differential symbols [KhZa1995]. While the\ndifferential symbols (the moment algebra) are supposed to have no underlying\nLie group structure, the group ΨD of pseudo-differential operators is a well defined Poisson-Lie group [KhZa1995]. This suggests that the characterization of\ncoadjoint orbits for moment dynamics requires the complete Poisson-Lie group\nstructure of pseudo-differential operators. A similar direction involving vector\nfields was followed by Ovsienko and Roger [OvRo1999]. Also, the appearance\nof the Wick-ordered product from quantum theory in this Poisson-Lie group\ncontext [KhZa1995, OvRo1999] implies a further relation to moment dynamics, whose quantum-like creation and annihilation operators were presented in\n[GiHoTr2008].\n\n6\n\n\fThe moment algebra carries a graded structure (g = ⊕i gi ) with filtration\n\u0003\n\u0002\n(9)\ngn , gm ⊆ gn+m−1\n\nthereby recovering the space of vector fields g1 = X as a particular subalgebra.\nThe largest subalgebra is however g0 ⊕ g1 ≃ X s F , i.e. the semidirect product\nof vector fields with scalar functions. This space appears in the description\nof ideal compressible fluids, where the X-variable is the fluid velocity and the\nF -variable is associated to the fluid density. Geodesic motion on this space\nhas also recently appeared in the metamorphosis process in imaging science\n[HoTrYo2007].\nThe moment equations may be written in Lie-Poisson form as\n∞\nX\n∂Am\n= −\nad∗δH An+m−1\nδAn\n∂t\nm,n=0\n\n(10)\n\nwhere ad∗ is the Lie algebraic coadjoint operation defined using the pairing\n∞\nX\n\nad∗βn Ak , αk−n+1 :=\n\nk,n=0\n\n∞\nX\n\nAk , [βn , αk−n+1 ] .\n\nk,n=0\n\nThe explicit expression for ad∗ is given in [GiHoTr2008] in any number of dimensions. Here we present the one-dimensional case which will be needed in\nthe following sections. The Schouten concomitant in equation (7) assumes a\nparticularly simple form in 1D\n[αm , βn ] = m αn ∂q βn − n βn ∂q αm\n\n(11)\n\nwhere q is the spatial variable. Simple use of integration by parts yields the\nfollowing covariant tensor density of rank k − n + 1:\n\nad∗βn Ak = (k + 1) Ak ∂q βn + n βn ∂q Ak .\n\n(12)\n\nThis operation was introduced by Kirillov [Ki1982], who first envisioned the\npossibility of a Lie-Poisson bracket on the symmetric Schouten algebra. Familiar\nversions of this operator with n = 1 or k = n arise in the theory of ideal fluid\ndynamics, soliton dynamics and image matching, while very little is known\nfor other values on n, k. Some features of this intriguing open question are\ninvestigated further below, in dealing with truncations of moment hierarchies.\n\n2.2\n\nStatistical moments and their Lie-Poisson structure\n\nAs we have seen, the fiber integral defining the kinetic moment hierarchy in\n(5) requires a kinetic equation on a cotangent bundle. In contrast, the notion\nof statistical moments is given on a symplectic vector space. Upon denoting\nz = (q, p), the definition of the n-th statistical moment is given by\nZ\nn\nX (t) := zn f (z, t) dN z\n(13)\n7\n\n\fwhere the upper index n in the integrand denotes tensor power (zn = ⊗n z),\nwhile for the time-dependent tensors X n (t) it denotes the tensor rank. This\ndefinition places the statistical moments and kinetic moments into the same\nmathematical framework. The first observation is that statistical moments are\nsymmetric contravariant tensors on phase space, which is now a symplectic\nvector space V of even dimension N = 2K (eventually V = RN ) with elements\nz = z i ei ∈ V .\nThe moment Poisson bracket for statistical moments may be obtained by following exactly the same steps as in the previous discussion for kinetic moments.\nThat is, one inserts the chain rule formula\n\u0012\n\u0013i ...i\n\u0013\n∞ \u0012\nX\nδF\nδX n 1 n\n∂F\n=\nδf\n∂X n i1 ...in\nδf\nn=0\n:=\n\n∞\nX\n∂F\nn\n∂X\nn=0\n\n∞\nX\n∂F\nδX n\n=\nn\nδf\n∂X\nn=0\n\nzn\n\n(14)\n\n(and definition of\n) into the Vlasov structure, which may then be written as\n\u001a\n\u001b\n\u0014\n\u0013\u0015\n\u0012\nZZ\nZZ\nδF δG\n∂ δG\n∂ δF\n,\n⊗\n{F, G}[f ] =\nf (z)\ndN z =\nf (z) J\ndN z\nδf δf\n∂z δf\n∂z δf\nwhere J is a non-degenerate two form. That is, J is a N × N antisymmetric\nmatrix of maximal rank. Since equation (14) implies\nX\n∂F\n∂ δF\n=\nn\nn\n∂z δf\n∂X\nn\n\nzn−1 ,\n\n(15)\n\nit follows that the moment Poisson structure is\n\u0015\n\u0014\n∞\nX\n∂G\n∂F\nn+m−2\n,\n{F, G}(X) =\nX\n∂X n ∂X m\nn,m=0\n\u0014\n\u0015\u001d\n∞ \u001c\nX\n∂F\n∂G\nX n+m−2 ,\n=:\n,\n∂X n ∂X m\nn,m=0\nwhere\n\n\u0014\n\n\u0015\n∂G\n∂F\n,\n:= n m\n∂X n ∂X m\n\nS\n\n\u0012\n\n∂G\n∂F\n*J*\nn\n∂X\n∂X m\n\n\u0013\n\n(16)\n\n(17)\n\nis the moment Lie bracket, in which again S operates to take the symmetric part\nof its argument. Recall that J is considered as a contravariant antisymmetric\nmatrix, i.e. it possesses upper indexes Jij = −Jji .\nThus, again, the isomorphism between symmetric tensors and polynomials produces the momentum map associated with the moments [ScWe1994]. In\nturn, this means that the Lie-Poisson bracket for statistical moments is inherited\nfrom the Vlasov Lie-Poisson structure. In contrast to the Schouten concomitant (7) for kinetic moments, the Lie bracket for statistical moments in (17) still\n8\n\n\finvolves the symplectic matrix J (Poisson tensor). Thus, the dynamics of the\nstatistical moments depends explicitly on the original symplectic structure. This\nallows, for example, the direct construction of moment invariants (Casimirs) as\npresented in [HoLySc1990]. Also, the moment algebra (17) involves symmetric tensors that are covariant, rather than contravariant as happens for the\nSchouten concomitant.\nRemark 2.3 (Statistical moments and accelerator beam optics)\nStatistical moments are important, for example, in the study of beam dynamics\nin particle accelerators. In this framework, they are defined as [Ch1983]\nZZ\nn\nb\nMn (t) :=\npn qnb f (q, p, t) dp q dp q\n\u0010\n\u0011i1 ...inb\n= Mnnb (t)\nei1 ⊗ ... ⊗ einb ⊗ ej1 ⊗ ... ⊗ ejn\nj1 ...jn\n\nwhere ek is a basis element of the configuration vector space Q, while ek is its\ndual (so that V = Q × Q∗ ). In 1D, the beam emittance\n\u00011/2\n,\nǫ := M20 M02 − (M11 )2\n\nknown as the Courant-Snyder invariant [CoSn1958], was recognized as a moment invariant (Casimir). This observation led to the study of more general\nmoment invariants [Dr1990, HoLySc1990]. A geometric investigation of statistical moments was carried out in [ScWe1994], where the moment algebra was\nrelated to the Heisenberg algebra on phase space. For particle accelerator design,\nmoments are often used in computational efforts to account for space charge effects and other beam-related problems.\n\nAs for the kinematic moments, one characterizes the Lie algebra of statistical\nmoments by using the grading,\n!\n∞\nn\n∞\nM\n_\nM\n∗\ngi\n(18)\n=:\nV\ng :=\nn=0\n\nwith the filtration\n\n\u0002\n\ni=0\n\ni=0\n\n\u0003\ngn , gm ⊆ gn+m−2\n∗\n\n(19)\n∗\n\n∗\n\nwhich shows how symmetric matrices g2 = V ∨ V = Sym (N ) form a particular subalgebra (here we denote by Sym∗ (N ) covariant symmetric matrices).\nThe largest subalgebra is given by g0 ⊕ g1 ⊕ g2 = R ⊕ V ∗ ⊕ Sym∗ (N ) and it\nwill play a central role in the remainder of this paper.\nRemark 2.4 (Occupation number representation)\nAnalogously to the Lie algebra of kinetic moments, the statistical moments\nalso carry a bosonic Fock space structure, where appropriate occupation numbers may be defined through the introduction of the multi-index\nzσ :=\nR σ notation\n1 σ1\nN σN\nσ\nN\n(z ) . . . (z ) . Indeed, taking moments by X (t) = z f (z, t) d z yields\nthe occupation number representation for statistical Vlasov moments.\n9\n\n\fThe moment equations are written in terms of the Lie algebra coadjoint\noperator ad∗ as\n∞\nX\ndX m\n=−\nad∗∂Hn X n+m−2\n∂X\ndt\nn=0\n\u0013\n\u0012\u0012\n∞\nX\n∂H\n*J\n= −m\nnS\n∂X n\nn=0\n\nX\n\nm+n−2\n\n\u0013\n\n(20)\n\nso that\n\u0010\n\nẊ\n\nm\n\n\u0011i1 ...im\n\n= −m\n\n∞\nX\n\nn\n\nS\n\nn=0\n\n\u0012\n\n∂H\n∂X n\n\n\u0013\n\nJ\n\nk im\n\nj1 ...jn−1 k\n\n!\n\u0010\n\u0011i1 ...im−1 j1 ...jn−1\nm+n−2\nX\n\nin which repeated tensorial indexes are summed. Having established the notation for the various operations among moments, we turn next to their application\nin geodesic Vlasov flows.\n\n2.3\n\nTruncation of moment hierarchies\n\nThe truncation of Vlasov moment hierarchies is a typical problem in kinetic\ntheory and, for statistical moments, this question was addressed by Channell\n[Ch1995] by using Levi's decomposition theorem. Channell's result may be\nsummarized by saying that, for a moment Hamiltonian not depending on the\nfirst-order moment (∂H/∂X 1 = 0), the moment hierarchy can be truncated at\nany order, thereby yielding a truncated Lie-Poisson system. In order to see how\nthis works in practice, let us write the truncated equations at the order K for the\nhierarchy of statistical moments Ẋ n = ad∗hm X m+n−2 , where hm = ∂H/∂X m.\nWe have\n∗\n\n∗\n\n∗\n\n∗\n\n∗\n\n∗\n\nẊ 1 = adh2 X 1 + adh3 X 2 + * * * + adhK X K−1\nẊ 2 = adh2 X 2 + adh3 X 3 + * * * + adhK X K\n∗\n\n∗\n\nẊ 3 = adh2 X 3 + * * * + adhK−1 X K\n\n(21)\n\n..\n.\n∗\n\n∗\n\nẊ K−1 = adh2 X K−1 + adh3 X K\n∗\n\nẊ K = adh2 X K\nand we recognize that the equation for X 1 is decoupled, so we restrict to the\nequations for X 2 , . . . , X K . At this point, one verifies that the Lie Poisson\nbracket for the truncated moment system is given by\n{F, G}(X) =\n\nK\nX\n\nn=2\n\nK−n+2\nX \u001c\n\nX\n\nm=2\n\n10\n\nn+m−2\n\n\u0014\n\n∂F\n∂G\n,\n,\nn\n∂X ∂X m\n\n\u0015\u001d\n\n(22)\n\n\fwith the same notation as in (17). We recognize that the truncated structure is\ncompletely determined by the Lie algebra filtration (19) and does not depend\non the particular expression of the Lie bracket, which was not used in deriving\nthe truncated system above.\nFollowing similar arguments, one can write the truncated system for kinetic\nmoments as\n∗\n\n∗\n\n∗\n\n∗\n\n∗\n\n∗\n\n∂t A0 = −adh1 A0 − adh2 A1 − * * * − adhK AK−1\n∂t A1 = −adh1 A1 − adh2 A2 − * * * − adhK AK\n∗\n\n∗\n\n∂t A2 = −adh1 A2 − * * * − adhK−1 AK\n\n(23)\n\n..\n.\n∗\n\n∗\n\n∂t AK−1 = −adh1 AK−1 − adh2 AK\n∗\n\n∂t AK = −adh1 AK\nwhere hm = δH/δAm and we have assumed h0 ≡ 0. The zero-th moment\nequation decouples and one is left with the remaining equations for A1 , . . . , AK .\nThese equations possess the following bracket structure:\n{F, G}(A) = −\n\nK\nX\n\nn=1\n\nK−n+1\nX \u001c\n\nAn+m−1 ,\n\nm=1\n\n\u0014\n\nδF δG\n,\nδAn δAm\n\n\u0015\u001d\n\n(24)\n\nwith the same notation as in (7). One recognizes again that the truncated\nstructure is uniquely determined by the Lie algebra filtration (9). This fact\nsuggests that a similar approach would also apply to the BBGKY moments of\nthe Liouville equation (reduced probability distributions), whose corresponding\nLie algebra is known to possess a similar filtration [MaMoWe84]. However, we\nleave the investigation of the BBGKY moment hierarchy for another time.\n\n3\n\nThe geodesic Vlasov equation\n\nWe have seen that moment hierarchies are equivalent descriptions of the Vlasov\nequation, which allow for geometric closures of the kinetic system (e.g. the ideal\nfluid closure for kinetic moments). The Vlasov equation is a Lie-Poisson equation on the Lie algebra of the group Can(T ∗ Q) of canonical transformations, and\nthis property is reflected in the Lie-Poisson structure of moment dynamics. It is\nwell known that physical systems with interesting geometric behavior are often\ngeodesic flows on Lie groups with respect to a metric provided by the system's\nkinetic energy. The most familiar example is probably rigid body motion, which\nis governed by geodesic motion on SO(3). Likewise, Euler's equations for ideal\nfluids may be interpreted as geodesic motion on the volume-preserving diffeomorphisms Diffvol (R3 ) of the 3D flow domain R3 [Ar1966]. Another interesting\nexample of geodesic motion is provided by the EPDiff equation [HoMaRa1998],\nwhich governs geodesic motion on the full diffeomorphism group Diff(Rn ). In\n11\n\n\fmany cases, geodesic flows on Lie groups turn out to be completely integrable\nHamiltonian systems. For example, in a one-dimensional flow domain R, EPDiff\nrecovers the Camassa-Holm equation for shallow water waves [CaHo1993].\nThe problem of geodesic flow on the symplectic group (symplecto-hydrodynamics) was introduced by Arnold and Khesin in [ArKe1998]. The present\npaper pursues this idea by considering geodesic flow on the canonical transformations within the context of Vlasov dynamics. In particular, we develop\na geodesic Vlasov equation called EPCan (Euler-Poincaré equation on the\ncanonical transformations) as an extension of previous work in [GiHoTr2005].\nRemark 3.1 (Symplectomorphisms vs canonical transformations)\nThe name EPCan refers to the Euler-Poincaré equation for geodesic motion on\nthe subgroup of the symplectic transformations arising from Hamiltonian vector fields. The subgroup Can (which could equally well be called Diffcan ) may\nbe identified as the group of smooth invertible canonical transformations with\nsmooth inverses. These transformations coincide with symplectic transformations in simple domains such as R2K . In those simpler cases, the geodesic\nVlasov equation is also known as EPSymp [GiHoTr2005, GiHoTr2007]\nAs mentioned in the introduction, the idea to investigate EPCan was motivated by the observation that geodesic equations for kinetic moments were found\nto include the Camassa-Holm equation [GiHoTr2005]. In fact, geodesic moment\nequations arise from EPCan whenever the norm may be expanded as a Taylor\nseries. Later, it was recognized [GiHoTr2007] that the geodesic moment equations also recover the two-component Camassa-Holm equation [ChLiZh2005].\nThe latter is a geodesic flow on a semidirect-product Lie group [Kuzmin2007].\nIn order to explain these issues, we shall introduce the EPCan equation and\nshow how it specializes to each integrable case.\nGiven a symplectic manifold P of even dimension N = 2K, the EPCan\nVlasov Hamiltonian is defined by\nZZ\n1\n1\n2\nf (z) G(z, z ′ ) f (z ′ ) dNz dNz ′ =\nf G\nH[f ] =\n(25)\n2\n2\nwhere z ∈ P and the kernel G is chosen so that it defines an appropriate norm\non Den(P). When dealing with moments, we shall restrict to the special cases\nP = T ∗ Q, with Q a general configuration manifold, and P = V , with V a\nsymplectic vector space. The geodesic Vlasov equation (aka EPCan) is written\nsimply as\n\u001b\n\u001a\nn\no\n∂f\nδH\n= − f, G ∗ f\n(26)\n= − f,\n∂t\nδf\n\nwhich coincides with Euler's vorticity equation in 2D when G = (−∆)−1 .\n\n3.1\n\nEuler-Poincaré equations on Hamiltonian vector fields\n\nIn order to understand how the geodesic Vlasov equation arises from an EulerPoincaré approach, one starts with an invariant Lagrangian defined on the tangent space of the canonical transformations L : T Can → R, which is purely\n12\n\n\fquadratic. By the invariance property, we can write the associated variational\nprinciple on the Lie algebra of Hamiltonian vector fields as follows\nZ t1\nL[Xh ] dt = 0\n(27)\nδ\nt0\n\nwhere Xh = J∇h and\nL[Xh ] :=\n=\n\nE 1D\nE\n1D b\nb J ∇h , J∇h\nQXh , Xh =\nQ\n2\n2\n\u0001 E\n1D\nb J ∇h , h =: L[h] ,\ndiv J Q\n2\n\n(28)\n\nb is taken to be a positive-definite symmetric operator so that L[Xh ]\nin which Q\ndefines a nondegenerate norm. The Legendre transform\nf=\n\n\u0010\n\u0011−1\n\u0001\nδL\nb J ∇h ⇒ h = div J Q\nbJ∇\n= div J Q\nf\nδh\n\n(29)\n\nyields the EPCan Hamiltonian in the Vlasov form\nH[f ] =\nwith\n\n1\nb−1 f\nf, O\n2\n\nb := div J Q\nbJ∇.\nO\n\n(30)\n\n(31)\n\nThis formula specifies the relation between the geodesic Vlasov equation and\nthe geodesic motion on the Hamiltonian vector fields. An interesting case occurs\nb is the 'flat' operation Q\nb X = X ♭ which takes contravariant vectors to\nwhen Q\nh\nh\ncovariant vectors, so that\n♭\n\ndiv J (J ∇h) = − ∆h .\nb reduces to minus the Laplacian\nThen the operator O\nb = −∆\nO\n\n(32)\n\n(33)\n\nand in two dimensions one obtains the Euler Hamiltonian for vorticity dynamics,\nH[ω] = 1/2 ω, (−∆)−1 ω ,\nb is a purely differential operator,\nwith ω = f . In the more general case when Q\nb\nb\nb ∇. Also if Q\nb commutes\none finds that Q and J commute and thus O = − div Q\nb\nb\nb is a\nwith the divergence, then, one has O = − Q ∆. However in general, Q\nmatrix differential operator that does not commute with J.\n\n13\n\n\f3.2\n\nThe ideal fluid dual pair for the Vlasov equation\n\nBoth the Poisson-Vlasov system (4) in plasma physics and the geodesic Vlasov\nequation (25) possess the single-particle solution (Klimontovich solution) expressed as a delta function in phase space,\nf (z, t) =\n\nN\nX\n\nwa δ(z − ζ a (t)) ,\n\n(34)\n\na=1\n\nwhere the index a is summed over a = 1, . . . , N and the number wa is a constant\nweight associated to each particle. This apparently trivial solution is of fundamental importance in physics and leads to the Klimontovich theory of kinetic\nequations [Kl1982]. In the remainder of this paper, we shall see how such a\nsolution emerges within the analysis of integrable moment closures of EPCan.\nIn particular, an interesting situation occurs when one allows for more general solutions of the form\nf (z, t) =\n\nN Z\nX\n\nwa (s) δ(z − ζ a (s, t)) dk s\n\n(35)\n\na=1\n\nwhere s is a coordinate on the immersed submanifold Sa ⊂ R2K with k = dim(S)\n(e.g. k = 1 for a curve, or k = 2 for a surface). For simplicity of notation, we\nhave already suppressed the implied subscript a in the arclength s for each wa\nand ζ a . For further simplicity and without loss of generality, we take N = 1 and\nso suppress the index a in what follows. This is equivalent to treating an isolated\nsingular solution. As one might expect, this is only a notational simplification;\nnot a real restriction.\nThe ζ's in (35) belong to the space of embeddings Emb(S, R2K ). That is,\nζ : S ֒→ R2K . Remarkably, these solutions define a momentum map3\nJSing : Emb(S, R2K ) → X∗can (R2K )\n\n(36)\n\nwhere X∗can (R2K ) ≃ Den(R2K ). This momentum map is produced by the left\naction of canonical transformations on P by composition of functions; that is,\nη*ζ = η◦ζ.\nImportantly, the same kind of momentum map arises in the motion of ideal fluids\n(e.g., for point vortices in 2D). See [MaWe1983], where these momentum maps\nare shown to possess a dual pair structure [We1983]. Namely, if one considers\nS as a manifold with volume form\nωvol = w(s) dk s ,\n3 Here\n\nXcan denotes the Lie algebra of Hamiltonian vector fields, which should not be\nconfused with the larger Lie algebra corresponding to the tangent space at the identity of the\nsymplectomorphism group Symp.\n\n14\n\n\fthen the right action of Diffvol on Emb(S, R2K )\nζ *η = ζ ◦η,\nyields another momentum map\nJS : Emb(S, R2K ) → X∗vol (S) .\n\n(37)\n\nIn more generality, if (S, w) is a volume manifold and (P, ω) is a symplectic\nmanifold, then the right action momentum map is (cf. [MaWe1983])\nJS : ζ 7→ ζ ∗ ω : Emb(S, P) → X∗vol (S) .\n\n(38)\n\nTo summarize, we have the following dual pair structure\nEmb(S, P)\n❅\n❅ JS\n❅\n❘\n❅\nX∗vol (S)\n\nJSing\n✠\nX∗can (P)\n\nwhich is formally equivalent to the dual pair structure for ideal fluids [MaWe1983].\nMoreover, the left leg yields a solution of the Vlasov equation regardless the\nnumber of dimensions and this makes the above dual pair a natural object in\nkinetic theory.\nIn order to write explicit formulas, we specialize to the case P = R2K . Upon\ndenoting ζ(s) = (Q(s), P(s)), one defines the following Poisson structure on\nEmb(S, P)\n\b\n\nF, G\n\nEmb\n\n=\n\nK Z\nX\ni=1\n\n1\nw(s)\n\n\u0012\n\nδF δG\nδG δF\n−\ni\nδQ δPi\nδQi δPi\n\n\u0013\n\ndk s\n\n(39)\n\nwhere we\nR see that the\nR factor 1/w(s) is needed for functionals of the form\nG(ζ) = ωvol g(ζ) = w(s) g(ζ(s)) dk s, whose functional derivative δG/δζ =\nw(s) dg/dζ takes values in Den(S).\nRemark 3.2 (Comparison with point vortices)\nThe factor 1/w(s) is reminiscent of the vortex strength factors in the Poisson\nbracket for point vortices [MaWe1983]. Indeed, the bracket above appears as the\nhigher dimensional version of the vortex bracket, so that the one dimensional\nvortex strengths are replaced by appropriate densities (the weights w(s)) on the\nembedded space S.\nFinally one checks that, for any Hamiltonian function h ∈ F (T ∗ R2K ),\n\b\nF, hJSing , hi Emb = Xh [F ]\n15\n\n(40)\n\n\fwhere Xh [F ] is the infinitesimal generator of the action of canonical transformations Can(R2K ) on Emb(S, R2K ). Thus, JSing satisfies the classical definition\nof a momentum map.\nThe singular solution momentum map JSing produces the collective Vlasov\nHamiltonian H ◦ JSing . In particular, substituting the singular solution momentum map (35) into the EPCan Hamiltonian (25) yields the collective Hamiltonian\nHN =\n\nN ZZ\n\u0001\n1 X\nwa (s) wb (s′ ) G Qa (s), Pa (s), Qb (s′ ), Pb (s′ ) dk s dk s′\n2\n\n(41)\n\na,b=1\n\nthereby producing the following collective equations of motion\nN\n\nX\nδHN\n∂Qa (s, t)\n= wa (s)\n=\n∂t\nδPa\nb=1\n\nZ\n\nwb (s′ )\n\nN\n\nX\n∂Pa (s, t)\nδHN\n= − wa (s)\n=−\n∂t\nδQa\nb=1\n\nZ\n\n\u0001\n∂\nG Qa (s), Pa (s), Qb (s′ ), Pb (s′ ) dk s′\n∂Pa\n\nwb (s′ )\n\n\u0001\n∂\nG Qa (s), Pa (s), Qb (s′ ), Pb (s′ ) dk s′ .\n∂Qa\n\nRemark 3.3 (Possible divergent terms in collective motion)\nThe collective dynamics of singular solutions deserves some care, depending on\nthe form of the Vlasov Hamiltonian. The existence of such solutions does not\nguarantee the existence of a well defined collective Vlasov Hamiltonian H ◦JSing .\nThis is because the singular solution momentum map JSing may produce divergent terms in the collective Hamiltonian [We1983]. For example, this is the\ncase of the Vlasov Poisson P\nsystem (4), where the divergence is generated by\npotential terms such as 1/2 wa wb |Qa − Qb |−1 , when a = b. The same situation occurs for point vortex solutions of the planar Euler's vorticity equation;Pthese solutions correspond to the 2D phase space Hamiltonian HN =\n1/2\nwa wb log |(Qa − Qb , Pa − Pb )|. On the other hand, these problems are absent, for instance, in the Vlasov-Helmholtz system (see [GiHoTr2008]\nand referP\nences therein), since the potential terms there are given by 1/2 wa wb e|Qa −Qb | .\nAs for the right-action momentum map, the expression\n\nJS (ζ) = ζ ∗ ω = ζ ∗ (dq ∧ dp) = ζ ∗ dq ∧ ζ ∗ dp = d(ζ ∗ q) ∧ d(ζ ∗ p)\n\n(42)\n\nyields the following simple expression\nJS (Q, P) = dQ(s) ∧ dP(s) =\n\nk\nX\n∂Q ∂P\ndsn ∧ dsm\nn ∂sm\n∂s\nn,m=1\n\n(43)\n\nThe conservation law dJS /dt = 0 is recovered by Noether's theorem, due to the\nDiff(S)-invariance of the collective Vlasov Hamiltonian HN = H ◦ JSing in (41).\nWhen S is a Lagrangian submanifold (this requires dim(S) = 1/2 dim(P)),\nthe momentum map JS restricts to JS (ζ) = 0. Likewise, the case dim(S) = 0\n16\n\n\frecovers the usual Klimontovich solution (34) of particle motion used in kinetic\ntheory. This fact, together with the geometric results on moment hierarchies of\nkinetic equations, illustrates the geometric basis of kinetic theory, in analogy to\nArnold's formulation of the ideal fluid [Ar1966].\n\n3.3\n\nKlimontovich solution and the Lagrange-to-Euler map\n\nThis section discusses the two limiting cases of the singular solution momentum map JSing , that is dim(S) = 0 and S = P. As mentioned above, the first\ncase yields the Klimontovich solution (34), which is then a momentum map\nN\nJSing : ×a=1\nP → X∗can (P). In this case, the solution identifies the particle trajectories, subject to initial conditions ζ a (0) = z0a , so that the particles are trans\b\nported in the phase space P by canonical transformations as {ζ a (t)} = ψt ◦ z0a ,\nwhere ψt ∈ Can(×a P) is generated by the collective Hamiltonian H ◦ JSing . In\ntwo phase-space dimensions, the Klimontovich solution is the usual point vortex\nsolution of the Euler's vorticity equation.\nAnother suggestive case of the above treatment is given by S = P, so we\n(a)\nmay denote s = z0 . Then, one has ζ a (*, t) = ηt ∈ Can(P) and the momentum\n∗\nmap JSing : ×a Can(P) → Xcan (P) is written as\n\u0011\n\u0010\nXZ\n(a)\n(44)\nf (z, t) =\nwa (z0 ) δ z − ηt * z0 d2K z0 .\na\n\nThis expression coincides with the well known Lagrange-to-Euler map for fluids,\nwhose importance is well established in continuum dynamics. The Lagrange-toEuler map is equivalent to the characteristic form of the Vlasov equation (1).\nNotice that both the Klimontovich and the Lagrange-to-Euler maps are produced by the same Lie group Can(P) acting on ×a P and ×a Can(P) respectively, with the same left action by\b composition\n\b of functions, that is η * {ζ a } =\n{η ◦ ζ a } in the first case and η * η (a) = η ◦ η (a) in the second. On the\nother hand, for the Klimontovich case, the collective dynamics generated by\nthe Hamiltonian H ◦ JSing : ×a P → R produces the canonical transformations\nψ ∈ Can(×a P) 6= ×a Can(P). This point is of fundamental importance because the Lie group Can(×a P) is the symmetry group of the Liouville equation\n[MaMoWe84] and the difference between Can(×a P) and ×a Can(P) is related\nto the particle correlations, which are neglected in the second situation. (The\nlatter is the Vlasov mean field approximation.)\nThe fact that these two fundamental maps each arise from the left leg of a\ndual pair of momentum maps again illuminates the geometric footing of kinetic\ntheory. The above arguments also provide mathematical support for the wide\nsuccess of Klimontovich method in kinetic equations [Kl1982].\n\n3.4\n\nGeometric kinetic theory\n\nThe presence of dual pairs in kinetic theory illuminates the Liouville and Vlasov\nequations in the light of their Lie symmetry properties. (Something similar\n17\n\n\fhappens for Euler's vorticity equation.) Namely, the presence of momentum\nmaps is not accidental in kinetic approaches. Indeed, a reasonable summary of\nthe results in [MaMoWe84, HoLySc1990, GiHoTr2008] could be made by saying\nthat the process\nր\n\nideal fluid\n\nLiouville equation → Vlasov equation\n\n(45)\nց beam optics\n\nis given by a composition of momentum maps. In other words, taking the\nmoments (BBGKY, kinetic or statistical) of a Lie-Poisson kinetic equation is\nalways a momentum map [MaMoWe84, HoLySc1990, GiHoTr2008]. Moreover,\nthe closures adopted to obtain Vlasov from BBGKY, fluid theory from kinetic\nmoments and beam optics from statistical moments are also momentum maps\narising from particular subgroups of the symmetry group of the starting system. More explicitly, passing from Liouville to Vlasov requires the subgroup\nCan(P) ⊂ Can(×i P). Likewise, passing from Vlasov to fluid requires the fiber\npreserving subgroup Canπ (T ∗ Q) ⊂ Can(T ∗ Q). Finally, passing from Vlasov to\nbeam optics requires the subgroup Sp(2K, R) ⊂ Can(R2K ). We can summarize\nthe situation in the following statement\nAll these moment approximations in kinetic theory are momentum maps.\nThat the BBGKY distributions are momentum maps is a remarkable fact. One\nmay ask whether the Klimontovich averages in plasma theory also share this\nproperty. In this case, the autocorrelations considered in the latter approach\nwould again be naturally included in the geometry of the theory. We leave this\npromising question open, as a direction for future research.\n\n4\n\nMoment closures of EPCan: integrable cases\n\nAs explained in [GiHoTr2005, GiHoTr2007], the geodesic Vlasov equation may\nbe represented in terms of the moments. Indeed, upon supposing that the metric\nG in (25) and (26) is sufficiently smooth, may can expand G(z, z′ ) in a Taylor\nseries.\n\n4.1\n\nIntegrable closures of kinetic moments\n\nIn this section, we present the kinetic moment hierarchy for EPCan. Upon\ndenoting z = (q, p), one may expand G in a Taylor series, as follows,\nG(z, z′ ) =\n\n∞\nX\n\nn,m=0\n\n=\n\npn ⊗ p′ m\n\nX X\n\nX\n\nn,m i1 ...in j1 ...jm\n\nGnm (q, q′ )\npn\n\n\u0001\n\ni1 ,...,in\n\np′\n\n18\n\nm\u0001\nj1 ,...,jm\n\n\u0001i1 ,...,in,j1 ,...,jm\nGnm (q, q′ )\n\n\fwhere Gnm is now a contravariant tensor field of rank n + m. Inserting this\nTaylor expansion in the EPCan Hamiltonian yields (with the notation above)\n∞ Z\n1 X\nH=\nAn (q) ⊗ Am (q′ )\n2 n,m=0\n\nGnm (q, q′ ) dK q dK q′ =\n\n1\n{An }\n2\n\nG\n\n(46)\n\nThus, upon denoting\nGnm ∗ Am :=\n\nZ\n\nGnm (q, q′ )\n\nAm (q′ ) dK q′\n\n(47)\n\nthe geodesic moment equations become\n∞\nX\n∂An\n=−\n∂t\n\nad∗Gmk ∗Ak An+m−1\n\n(48)\n\nm,k=0\n\nwhere ad∗ is the coadjoint Lie-Schouten operator. The singular solutions of the\nVlasov moment hierarchy may be expressed in the following form:\nZ\nAn (q, t) = w(s) Pn (s, t) δ(q − Q(s, t)) dk s\n(49)\nwhich is a momentum map J : Emb(S, T ∗ Q) → g∗ , where g is the kinetic\nmoment algebra.\nAs we have seen in the preceding discussions, the moment algebra possesses\nthe important subalgebra g1 = X(Q) of vector fields on the configuration manifold. In terms of canonical transformations, this corresponds to Hamiltonian\ngenerating functions that are linear in the momentum coordinate, i.e. point\ntransformations. These are cotangent lifts T ∗ Diff(Q) of diffeomorphisms on\nthe configuration manifold Q [HoMa2004, GiHoTr2007]. Remarkably, when the\nmoment hierarchy of EPCan is closed such that G11 =: G1 is the only nonvanishing term of Gnm , we obtain the Hamiltonian on the one-form density\nA1 =: m(q) * dq ⊗ dK q ∈ X∗\nZZ\n1\nm(q) * G1 (q, q′ ) m(q′ ) dK q dK q′\n(50)\nH=\n2\nBy using the property of the Schouten bracket [β1 , αn ] = £β1 αn (where £\ndenotes Lie derivative), one finds the EPDiff equation,\n∂m\n+ £G1 ∗m m = 0 .\n∂t\n\n(51)\n\nEPDiff is the Euler-Poincaré equation on the diffeomorphisms [HoMa2004]. This\nequation has the important property of exhibiting emergent singular δ-like solutions from any confined smooth initial configuration. In 1D, the particular case\nG1 = (1 − α2 ∂ 2 )−1 yields the integrable Camassa-Holm equation, which is well\nknown in the community of integrable systems.\n19\n\n\fRemarkably, if we also allow for G00 =: G0 6= 0, we obtain the Hamiltonian\n1\nH[A0 , A1 ] =\n2\n\nZZ\n\nA1 (q) * G1 (q, q′ ) A1 (q′ ) dK q dK q′\nZZ\n1\nA0 (q) G0 (q, q′ ) A0 (q′ ) dK q dK q′\n+\n2\n\nwhich yields a geodesic flow on the semidirect-product Lie group Diffs F , introduced in [HoTrYo2007] in the context of image matching, discussed further in\n[HoTr2009] and shown in numerical simulations to exhibit emergent singularities\nin both of its variables [HoOnTr2009]. Interestingly enough, the EP(Diffs F )\n∗\nequations (with notation β0 ⋄ A0 = − adβ0 A0 )\nA0,t + £G1 ∗A1 A0 = 0 ,\nA1,t + £G1 ∗A1 A1 = A0 ⋄ (G0 ∗ A0 ) .\nare a geodesic flow on the extended point transformations, i.e. compositions of\ncotangent lifts and fiber translations [MaWeRaScSp1983].\nRemark 4.1 (Geodesic motion on fiber-preserving transformations)\nThe semidirect-product Lie group Diff s F is identified with the compositions\nof cotangent lifts with fiber translations on the phase space T ∗ Q with coordinates (q, p). This identification is of fundamental importance in plasma physics\n[MaWeRaScSp1983]. It also yields the interpretation of EP (Diff s F ) as a\ngeodesic motion on the Lie group Canπ (T ∗ Q) of fiber-preserving canonical\ntransformations on the cotangent bundle T ∗ Q. In fact, any transformation by\nCanπ (T ∗ Q) can be realized as the composition of a fiber translation and a cotangent lift (or viceversa) [BaWe1997]. On the other hand, such a transformation is\nalways a canonical transformation characterized by a generating function that\nis linear (and inhomogeneous) in the canonical momentum. Therefore, since\nDiff(Q) s F (Q) ≃ Canπ (T ∗ Q) then EP (Diffs F ) ≃ EP Canπ .\nIn 1D, the special case G0 = δ-function yields yet another integrable system,\nλt = − (uλ)q\nut − uqqt = −3uuq + 2uq uqq + uuqqq − λλq\nknown as two-component Camassa-Holm equation [ChLiZh2005] (here u = (1 −\n∂ 2 )−1 A1 and λ = A0 ). This system first appeared in [OlRo1996]. Its singular\nsolutions were studied in [CoIv2008] who pointed out their relation between\nthis system and shallow water equations. Upon slightly modifying the Hamiltonian by G0 = (1 − ∂ 2 )−1 , one has the spontaneous emergence of the Klimontovich solution (49) in (A0 , A1 ), as shown in [HoOnTr2009]. The two-component\nCamassa-Holm system and its Klimontovich solutions have also found applications in the metamorphosis approach to image matching, e.g., for magnetic\nresonance images [HoTrYo2007].\n20\n\n\f4.2\n\nGeodesic flow on statistical moments\n\nSection 5 shows that representing the geodesic Vlasov equation in terms of\nstatistical moments in a special case recovers the well-known Bloch-Iserles integrable system [BlIsMaRa2005, BlIs2006]. If G in (25) and (26) is assumed to be\nanalytic in both position and momentum, its Taylor expansion may be written\nas:\n∞\nX\nG(z, z′ ) =\nΓnm zn ⊗ z′ m\n(52)\nn,m=0\n\nwhere Γnm is a covariant tensor of rank n + m. Then,\nthe EPCan Hamiltonian\nR\n(25) is written in terms of the moments X n (t) = zn f (z, t) dN z as\nH=\n\n∞\n1 X\nΓnm\n2 n,m=0\n\nXn ⊗ Xm\n\nso that the moment equations for (n, m) ∈ Z+ turn out to be\n\u0013\n\u0012\u0010\n∞\nX\n\u0001 \u0011\nk\nm+n−2\nm\nX\nẊ = − m\nnS\nΓnk X * J\n\n(53)\n\n(54)\n\nn=0\n\ndenotes contraction between upper and lower\nwhere, as before, the symbol\nindices of the various tensors. In explicit index notation this reads as\n\u0011i1 ...im\n\u0010\n=\nẊ m\n\u0012\n∞\nX\n\u0001\n−m\nn S Γnk j1 ...jn l1 ...l\n\nk\n\nn=0\n\nXk\n\n\u0001l1 ...lk\n\n\u0011i1 ...im−1 j1 ...jn−1\u0013\n\u0010\n.\nJjn im X m+n−2\n\nAn example of this equation is discussed in Section 5 for the case m = n = 2.\n\n4.3\n\nKlimontovich dynamics for statistical moments\n\nAs in the case of kinetic moments, the single-particle Klimontovich solution\nX\nf (z, t) =\nwa δ(z − ζ a (t))\n(55)\na\n\nof the geodesic Vlasov equation offers an interesting opportunity for presenting\nsolutions of the moment hierarchy. These solutions may be represented as\nX\nX n (t) =\nwa ζ na (t)\n(56)\na\n\nζ na\n\nwhere\n:= ζ a ⊗ * * * ⊗ ζ a (n times) and ζ a satisfies Hamilton's canonical\nequations with Hamiltonian\n1 XX\nwa wb Γnm\nζ na ⊗ ζ m\n(57)\nHN =\nb .\n2\nn,m\na,b\n\n21\n\n\fThis means that ζ a satisfies\nζ̇ a = J ∇ζa HN = J\n\nX\nnm\n\nn wa\n\nX\n\nwb Γnm\n\nζ an−1 ⊗ ζ m\nb ,\n\n(58)\n\nb\n\nwhere the moment order m or n ranges from zero to infinity, and a, b range over\nthe number of particles a, b = 1, . . . , N . Each ζ a undergoes Hamiltonian dynamics because the Vlasov single-particle solution is an equivariant momentum\nmap. Equivariance of the corresponding momentum map for dynamics of point\nvortices in an Euler fluid was proven in [MaWe1983]. The same argument holds\nfor the singular solutions of kinetic moment equations, including the EPDiff\nequation [HoMa2004].\nRemark 4.2 (Truncation of geodesic moment hierarchies)\nIt is important to notice that higher-order moment truncations do not possess\nthe Klimontovich solution. The latter exists only for genuine moment closures,\nsuch as the fluid closure for the kinetic moments (consisting of A0 , A1 ), or the\n2nd -order closure for statistical moments used in linear beam optics (consisting\nof X 1 , X 2 ).\n\n5\n\nBloch-Iserles system as a moment equation\n\nThe case (n, m) = (2, 2) of the moment equation (54) yields an important moment subalgebra, given by homogeneous quadratic polynomials on phase\nspace, i.e. quadratic forms on V . In this case, formula (17) implies the following\nLie-Poisson moment bracket\n\u0013\u001d\n\u001c\n\u0012\n∂G\n∂F\n(59)\nJ\n{F, G}(X 2 ) = 4 X 2 , S\n∂X 2 ∂X 2\nwhere the moment X 2 is now a N × N symmetric matrix. Because of the\nantisymmetry of J, the bracket above may be rewritten as\n*\n\u0014\n\u0015 +\n∂F ∂G\n2\n2\n{F, G}(X ) = X ,\n(60)\n,\n∂X 2 ∂X 2 2J\nwhere\n\n\u0014\n\n∂F ∂G\n,\n∂X 2 ∂X 2\n\n\u0015\n\n:=\n2J\n\n∂F\n∂G\n∂G\n∂F\n2J\n−\n2J\n∂X 2\n∂X 2 ∂X 2\n∂X 2\n\n(61)\n\nwhich is the Lie bracket for the integrable Bloch-Iserles (BI) system of equations\nintroduced in [BlIsMaRa2005, BlIs2006]. In that case, an antisymmetric matrix\nN of any dimension defines the following Lie bracket on the space of symmetric\nmatrices of the same dimension. In formulas one has\n[X, Y ]N := XNY − Y NX\n\n22\n\n(62)\n\n\fwhere X and Y are symmetric matrices. The Bloch-Iserles system\n\u0002\n\u0003\nẊ = (X)2 , N\n\n(63)\n\n1\nt\n2 Tr( XX).\n\nis Lie-Poisson on this Lie algebra, with Hamiltonian HBI =\nHere\nthe notation (X)2 denotes standard matrix multiplication of X by itself, in\norder to distinguish from second-order moments X 2 . In addition, tX denotes\nthe transpose of the matrix X, so that tX = X when X is symmetric. One\nconcludes the following.\nTheorem 5.1 In the even-dimensional case, the integrable Bloch-Iserles system\nis the Vlasov moment equation (20) obtained from the quadratic Hamiltonian\n1 2 2\nhX , X i\n2\nassociated with the antisymmetric matrix N := 2J.\n\n(64)\n\nHBI =\n\nLet us now look at the moment bracket for functions of\n(X 0 , X 1 , X 2 ) ∈ g∗0 ⊕ g∗1 ⊕ g∗2 ≃ R ⊕ V ⊕ (V ∨ V )\n\n(65)\n0\n\nwhere ∨ is again the symmetric tensor product defined in (8) and X = const\nis naturally taken as the probability normalization. The moment bracket (17)\nbecomes\n{F, G}(X) = X 0\n\n∂G\n∂F\n1 *J\n1\n∂X\n\u0012∂X\n\u0013\n∂F\n∂G\n∂F\n∂G\n1\n+X *\n2J\n2J\n−\n∂X 2 ∂X 1\n∂X 2 ∂X 1\n*\n\u0015 +\n\u0014\n∂F ∂G\n2\n,\n+ X ,\n∂X 2 ∂X 2 2J\n\n(66)\n\nwhich is given by the direct sum of the canonical Poisson bracket on V in first\nterm, plus the semidirect-product Lie-Poisson bracket on g∗2 s g∗1 ≃ Sym s V\nin the second and third terms. Thus, the specialization of the moment bracket\n(17) to (66) in this case defines a Lie-Poisson bracket on (Sym s V ) ⊕ R.\nWe now turn our attention to the odd-dimensional BI system. In this system,\none has a degenerate antisymmetric matrix N of odd dimension n and rank 2K.\nUpon defining N̄ as the non-degenerate minor of maximal dimension (2K), the\ndegenerate matrix N\n\u0014\n\u0015\nN̄ 0\nN=\n0 0\nproduces the Lie bracket (62) associated to the BI equation (63).\nThe odd-dimensional BI system is known to be a geodesic flow on the space\n(Sym(2K) s M2K×d ) ⊕ Sym(d) endowed with the Lie bracket (cf. equation\n(2.14) in [BlIsMaRa2005])\n[(S, A, B), (S ′ , A′ , B ′ )] :=\n\n\u0001\nS N̄S ′ − S ′ N̄S , S N̄A′ − S ′ N̄A , tA N̄A′ − tA′ N̄A (67)\n23\n\n\fwhere one denotes d = n − 2K, for any S, S ′ ∈ Sym(2K), A, A′ ∈ M2K×d , and\nB, B ′ ∈ Sym(d).\nWe will show that the bracket (17) for the Vlasov moment system is LiePoisson on the dual to the Lie algebra (Sym(2K) s V ) ⊕ R. That is, we choose\nd = 1, which is the case of interest here. Proposition 2.5 in [BlIsMaRa2005]\nshows that the geodesic equations on Sym(2K +1) are equivalent to the geodesic\nequations on (Sym(2K) s V ) ⊕ R, where V is a 2K-dimensional symplectic\nspace carrying a non-degenerate symplectic structure N̄/2. This leads us to\nthe identification of the Bloch-Iserles system with geodesic moment dynamics.\nTheorem 5.2 When d = 1, the odd-dimensional BI system is a Vlasov moment\nequation of the form (20) on the statistical moments. This equation is generated\nby the quadratic Hamiltonian\nH(X) =\n\n1\n1\nX2 , X2 + X1 * X1\n2\n2\n\n(68)\n\nyielding a geodesic moment flow. The corresponding BI Hamiltonian HBI (X) =\n1/2 Tr(tXX) is written in terms of the symmetric (2K +1)-dimensional matrices\nof the form\n\u0014 2\n\u0015\nX\nX1\nX= t 1\nX\n4X 0\nThese matrices are endowed with the Bloch-Iserles Lie bracket (62), where the\n(degenerate) antisymmetric matrix N takes the form\n\u0014\n\u0015\n2J 0\nN=\n0 0\nand J is the canonical symplectic matrix.\nProof. Upon denoting\nN̄ = 2J ,\n\nS=\n\n∂F\n,\n∂X 2\n\nS′ =\n\n∂G\n,\n∂X 2\n\nA=\n\n∂F\n,\n∂X 1\n\nA′ =\n\n∂G\n, (69)\n∂X 1\n\none sees that the only difference between the Lie bracket in (67) and the bracket\nin (66) resides in a constant factor in the first term of (66)\n\u0014\u0012\n\u0013\n\u0013\n\u0013\n\u0015\n\u0012\n\u0012\n∂F\n∂G\n∂G\n∂F\n1\n∂F\n∂G\n*\nJ\n*\n2J\n*\n2J\n(70)\n=\n−\n4\n∂X 1\n∂X 1\n∂X 1\n∂X 1\n∂X 1\n∂X 1\nwhere the square bracket in the right hand side is identical to the last component\nof (67). This difference however can be easily overcome. Indeed, one can always\nre-define the Lie bracket on (Sym(2K) s V ) ⊕ R as\n[(S, A, B), (S ′ , A′ , B ′ )] :=\n\u0013\n\u0012\n\u0001\n1 t\nA N̄A′ − tA′ N̄A\nS N̄S ′ − S ′ N̄S , S N̄A′ − S ′ N̄A ,\n4\n24\n\n\fand verify that the map\nΨ : (Sym(2K) s V ) ⊕ R → Sym(2K + 1)\n\u0014\n\u0015\nS A\n(S, A, B) 7→ t\nA 4B\nis a Lie algebra isomorphism for Sym(2K + 1), which is endowed with the BI\nLie bracket [X, Y ]N = XNY − Y NX. The isomorphism property is a direct\nverification identical to Proposition 2.5 in [BlIsMaRa2005]. In particular, let\n(S, A, B), (S ′ , A′ , B ′ ) ∈ (Sym(2K) s V ) ⊕ R and compute directly that\n\u0001\nΨ [(S, A, B), (S ′ , A′ , B ′ )] =\n\u0001\n= Ψ S N̄S ′ − S ′ N̄S, S N̄A′ − S ′ N̄A, 1/4 ( tA N̄A′ − tA′ N̄A)\n\u0014\n\u0015\nS N̄A′ − S ′ N̄A\nS N̄S ′ − S ′ N̄S\n= t\n(S N̄A′ − S ′ N̄A) tA N̄A′ − tA′ N̄A\n\u0014\n\u0015\u0014\n\u0015\u0014\n\u0015 \u0014 ′\n\u0015\u0014\n\u0015\u0014\n\u0015\nS A\nN̄ 0 S ′ A′\nS\nA′\nN̄ 0 S A\n= t\n−\nt ′\nA 4B 0 0 tA′ 4B ′\nA 4B ′ 0 0 tA 4B\n\u0002\n\u0003\n= Ψ(S, A, B), Ψ(S ′ , A′ , B ′ ) N\n\nas required.\nThus, we conclude that the BI system and the geodesic moment equations\nare equivalent.\n\n5.1\n\nKlimontovich solutions of the Bloch-Iserles system\n\nThe Klimontovich map for the geodesic Vlasov equation provides simple solutions of the Bloch-Iserles system in any dimension. For example, in even\ndimensions, the dynamics of the BI solution\nX\nX(t) =\nwa ζ 2a (t)\n(71)\na\n\nis given by the system\nζ̇ a = wa\n\nX\n\nwb N ζ 2b ζ a\n\n(72)\n\nb\n\nwhere N = 2 J and ζ 2b ζ a is a covector such that (ζ 2b ζ a )i = (ζ 2b )ij (ζ a )j . In\nexplicit index notation, one has\nX\n\u0001i\n\u0001\nk\nζ̇ a = 2 wa\nwb Jij ζ 2b jk (ζ a ) .\nb\n\nThis system is a Hamiltonian system with the homogeneous quartic Hamiltonian\nHN =\n\nN\n1 X\nwa wb Tr\n2\na,b=1\n\n25\n\n(ζ 2a ) ζ 2b\n\nt\n\n\u0001\n\n(73)\n\n\fNotice that, by writing the equation for ζ a as\nX\nζ̇ a = wa\nwb N ζ 2b ζ a + wa2 kζ a k2 N ζ a\n\n(74)\n\nb6=a\n\nwe can specialize the above to the simple case when wa = 1 for a fixed a and\nwb = 0 ∀b 6= a, so that\nX(t) = ζ 2 (t)\n\nwith\n\n2\n\nζ̇ = kζk N ζ\n\n(75)\n\nThis case leads however to trivially linear dynamics, since the norm kζk is\nevidently conserved. This does not happen for different norms\nin the quadratic\n\u0001\nmoment Hamiltonian, such as H = 1/2 Γ22 X 2 ⊗ X 2 .\nThe above arguments also provide solutions to the Bloch-Iserles system in\n2K + 1 dimensions. Indeed, the particle solution of EPCan (55) becomes a\nsolution of the BI system in the following form\nX \u0014 ζ 2 (t) ζ (t) \u0015\na\n∈ Sym(2K + 1) .\n(76)\nX(t) =\nwa t a\nζ a (t)\n4\na\n\nHere ζ a undergoes Hamiltonian dynamics with\n\u0010\n1X\nHN =\nwa wb ζ a * ζ b + Tr\n2\n\n(ζ 2a ) ζ 2b\n\nt\n\na,b\n\n\u0001\u0011\n\nwhose collective EPCan equations are\nX\nX\n1\nwb N ζ b .\nζ̇ a = wa\nwb N ζ 2b ζ a + wa\n2\n\n,\n\n(77)\n\n(78)\n\nb\n\nb\n\nAs we shall see, these solutions are also momentum maps in both the even and\nodd-dimensional cases, since the Klimontovich solution (55) is a momentum\nmap. In particular, upon fixing N = 1, these are solution momentum maps\nV → Sym(n) (ζ 7→ X), where V is a symplectic space and X ∈ Sym(n) is the\nBloch-Iserles dynamical variable. This construction arises from a special case\nof the momentum map in (35), with dim(S)=0 (Klimontovich case), P = V\n(symplectic vector space) and where the Lie algebra Xcan (V ) is restricted to\nthe Lie subalgebra of linear Hamiltonian vector fields. In the more general case\nwhen dim(S) ≥ 1 one has also the conserved quantity in (43). That is, the\noperation of taking moments preserves the dual pair structure of the Vlasov\nequation.\nTheorem 5.3 Upon fixing N = 1, the solution (76) of the odd-dimensional\nBloch-Iserles system is a momentum map\nJ2K+1 : (V, wJ) → Sym(2K + 1)\nwhere wJ is the symplectic form on the vector space V . Moreover, the solution\n(71) in the even-dimensional case is also a momentum map\nJ2K : (V, wJ) → Sym(2K) .\n26\n\n\fProof. In what follows we shall use the isomorphisms\nSym(2K + 1) ≃ (Sym(2K) s V ) ⊕ R\nand\n\nSym(2K) ≃ sp∗ (2K, R) ,\n\nwhere sp(2K, R) denotes the Lie algebra of Hamiltonian matrices. We prove\nthe first statement, which comprises the second as a particular case. Let V be\nendowed with the Poisson structure\n\u0013\n\u0012\n1 t ∂F\n∂G\n{F, G} =\n*J\nw\n∂ζ\n∂ζ\nthen, the definition of momentum map can be verified by inserting G = hJ, βi,\nwith J = w(ζ 2 , ζ, 1) ∈ (Sym(2K) s V ) ⊕ R and β = (β2 , β 1 , β0 ) its dual. Then,\nwe have\n\u0011 ∂F\nt\u0010\n{F, hJ, βi} = J * β1 + 2Jβ2 ζ *\n∂ζ\n\nwhich identifies the infinitesimal action of linear (inhomogeneous) Hamiltonian\nvector fields on the phase space functions F ∈ F (V ).\nRestricting to even 2K dimensions requires setting β0 = 0 = β 1 , thereby\nproducing the action of (homogeneous) Hamiltonian vector fields, i.e. Hamiltonian matrices in sp(2K, R).\nThe integrability properties of these solutions will be discussed elsewhere.\n\n6\n\nConclusions and outlook\n\nAfter reviewing the geometric basis of Vlasov moment dynamics, this paper\nshowed how moment closures of the geodesic Vlasov equation (26) produce interesting known integrable systems, which include CH, CH2 and Bloch-Iserles\n(BI) equations in both odd and even dimensions. While the CH and CH2\ncases were already known to arise in 1D [GiHoTr2005, GiHoTr2007], the higher\ndimensional moment bracket showed that these moment closures also recover\nthe EPDiff equation and extend CH2 to higher dimensions. The paper also\nrecovered the BI system from (26) by a finite-dimensional moment closure, corresponding to inhomogeneous quadratic phase-space functions. Thus, a kinetic\ntheory approach led to special solutions of BI.\nThe moment closures preserve the two equivariant momentum maps in the\nVlasov dual pair. Preservation of this structure guaranteed that the resulting\nclosed moment systems discussed here were still Poisson. This preservation also\nenabled reduction to finite-dimensional systems by using the Klimontovich particle solutions from plasma theory. For example, the peakon solutions of the\nCH equation arose from a Klimontovich approach in [GiHoTr2005]. Singular\nsolutions also arose upon allowing extra smoothing in the CH2 moment Hamiltonian [GiHoTr2007, HoOnTr2009]. In addition, this paper showed in Section\n5.1 that the same approach also produced solutions of the finite-dimensional\n27\n\n\fBI system. However, Klimontovich solutions are not admitted by arbitrary approximations. They are prevented, for example, when moment hierarchies are\nsimply truncated at a certain weight. That is, moment closures preserve the\nVlasov dual pair, while moment truncations do not, even though they may be\nshown to still be Lie-Poisson. Open questions concern both the construction\nof a Lax pair for the Klimontovich dynamics of the BI system and potential\nintegrability properties of the truncated equations (e.g. the (A1 , A2 ) truncation\nfor kinetic moments).\nThe geometric setting showed how the left momentum map in the Vlasov\ndual pair recovers both the Klimontovich solution and the Lagrange-to-Euler\nmap. That this geometry applies also to the Liouville equation illuminates the\ngeometric footing of kinetic theory. Indeed, this paper explained how all the\nstandard moment approximations in kinetic theory are momentum maps preserving the same dual pair. This construction would certainly be destroyed by\nintroducing the collision integral, whose celebrated Boltzmann version implies\nirreversibility and produces a preferred direction of time via the H-theorem.\nThis irreversibility prevents the Klimontovich solutions, which are solutions of\na time-reversal invariant system.\nThe kinetic-theory interpretation of geodesic Vlasov moment dynamics also\nprovided insight into the physical description of the integrable cases. For example, the CH2 case was interpreted in this light as a charged fluid in the\ncontext of the one-component CH equation, thereby extending the CH model\nto include space-charge effects. On the other hand, CH2 has also been related to shallow water dynamics by applying a series of approximations to the\nGreen-Naghdi equations [CoIv2008]. Remarkably, a modified version of CH2\ndynamics has also been applied in image matching [HoTrYo2007]. (In image\nmatching, the Hamiltonian is the norm in which one applies optimal control.)\nEmergent peakon solutions were found to result from applying H 1 smoothing\nto the Hamiltonian in [HoOnTr2009].\nThe paper also identified several other potentially interesting open problems.\nOne of these is the problem of making physical applications of the Kirillov ad∗ action (12) for the Lie-Poisson bracket on the symmetric Schouten algebra for\narbitrary values of (n, k). Another is to determine whether the Klimontovich\naverage in plasma kinetic theory is a momentum map. One may also ask how\nthe family of symplectically conserved quantities corresponding to statisticalmoment versions of the Poincaré invariants found in [HoLySc1990] may fit into\nthe theory of kinetic moments.\nThe kinetic approach used here may also provide physical interpretations of\nuse in applying the BI system. For example, particle beams in linear accelerator lattices are described in terms of symplectic transfer matrices. (The same\nholds for linear ray optics.) In formulas, one has the relation z(t) = M(t) z(0),\nwhere M(t) is a one parameter subgroup of Sp(6, R) determining the beam\nevolution z(t) ⊂ R6 . In this sense, geodesics in Sp(6, R) would correspond to\noptimal transfer maps for particle or optical beams. It is interesting that similar\napproaches have recently emerged in quantum computation, where the Hamiltonian of the system is constrained to an optimal trajectory (i.e., a geodesic) by a\n28\n\n\fcost function from optimal control theory [BrElHo08, NiDoGuDo08]. These additional open problems bode well for the potential success in future applications\nof using the geometric approach to Vlasov dynamics discussed here. The application of ideas from optimal control to the Vlasov moments may be especially\nfruitful.\n\nAcknowledgments\nWe are indebted with François Gay-Balmaz, Simon Hochgerner, Boris Khesin,\nDavid Levermore, Cornelia Vizman, Tudor Ratiu and Harvey Segur for useful\nand stimulating discussions. The work of DDH was also partially supported by\nthe Royal Society of London Wolfson Research Merit Award.\n\nReferences\n[Ar1966] V.I. Arnold, Sur la géométrie différentielle des groupes de Lie de dimension infinie et ses applications à l'hydrodynamique des fluides parfaits.\nAnn. Inst. Fourier (Grenoble) 16 1966 fasc. 1, 319–361\n[ArKe1998] V. I. Arnold, B. A. Khesin, Topological methods in hydrodynamics.\nApplied Mathematical Sciences, 125, Springer-Verlag, New York, 1998.\n[BaWe1997] S. Bates, A. Weinstein, Lectures on the geometry of quantization.\nBerkeley Math. Lect. Notes 8 (1997).\n[Be1973] D. J. Benney, Properties of long nonlinear waves. Stud. App. Math.\n52 (1973) 45–50.\n[BlIs2006] A. M. Bloch, A. Iserles, On an isospectral Lie-Poisson system and\nits Lie algebra. Found. Comput. Math. 6 (2006), no. 1, 121–144.\n[BlIsMaRa2005] A. M. Bloch, A. Iserles, J. E. Marsden, T. S. Ratiu, A class\nof integrable geodesic flows on the symplectic group and the symmetric matrices. DAMTP Tech. Rep. NA2006/02, University of Cambrige UK, 2006\n(arXiv:math-ph/0512093)\n[BrElHo08] D. C. Brody, D. C. P. Ellis, D. D. Holm, Hamiltonian statistical\nmechanics J. Phys. A: Math. Theor. 41 (2008), 502002\n[CaHo1993] R. Camassa, D. D. Holm, An integrable shallow water equation with\npeaked solitons. Phys. Rev. Lett. 71 (1993), no. 11, 1661–1664.\n[DaSWe1999] A. Cannas da Silva, A. Weinstein, Geometric models for noncommutative algebras. Berkeley Math. Lect. Notes 10 (1999).\n[Ch1983] P. J. Channell, The moment approach to charged particle beam dynamics. IEEE Trans. Nucl. Sci. 30 (1983), no. 4, 2607–2609\n\n29\n\n\f[Ch1995] P. J. Channell, Canonical integration of the collisionless Boltzmann\nequation. Ann. N Y Acad. Sci. 751 (1995), 152–161\n[ChLiZh2005] M. Chen, S. Liu, Y. Zhang, A two-component generalization of\nthe Camassa-Holm equation and its solutions. Lett. Math. Phys. 75 (2006),\nno.1, 1–15\n[CoIv2008] A. Constantin, R. Ivanov, On an integrable two-component CamassaHolm shallow water system. Phys. Lett. A 372 (2008), no. 48, 7129–7132\n[CoSn1958] E. D. Courant, H. D. Snyder, Ann. Phys., NY 3 (1) (1958).\n[Dr1990] A. J. Dragt, F. Neri, G. Rangarajan, D. R. Douglas, L. M. Healy, R.\nD. Ryne, Lie algebraic treatment of linear and nonlinear beam dynamics.\nAnn. Rev. Nucl. Part. Sci. 38 (1990), no. 38, 455–496\n[Gi1981] J. Gibbons, Collisionless Boltzmann equations and integrable moment\nequations. Phys. D 3 (1981), no. 3, 503–511.\n[GiHoKu1983] J. Gibbons, D. D. Holm, B. A. Kupershmidt, The Hamiltonian\nstructure of classical chromohydrodynamics. Phys. D 6 (1982/83), no. 2,\n179–194.\n[GiHoTr2005] J. Gibbons, D. D. Holm, C. Tronci, Singular solutions for geodesic\nflows of Vlasov moments, Math. Sci. Res. Inst. Publ. 55 (2008), 199–220.\n[GiHoTr2007] J. Gibbons, D. D. Holm, C. Tronci, Vlasov moments, integrable\nsystems and singular solutions, Phys. Lett. A 372 (2008) 1024–1033\n[GiHoTr2008] J. Gibbons, D.D. Holm, C. Tronci, Geometry of Vlasov kinetic\nmoments, Phys. Lett. A 408 (2008) 4184-4196\n[HoLySc1990] D. D. Holm, W. P. Lysenko, J. C. Scovel, Moment invariants for\nthe Vlasov equation. J. Math. Phys. 31 (1990), no. 7, 1610–1615.\n[HoMa2004] D. D. Holm, J. E. Marsden, Momentum maps and measure valued\nsolutions (peakons, filaments, and sheets) of the Euler-Poincaré equations\nfor the diffeomorphism group. Progr. Math., 232 (2004) 203-235.\n[HoMaRa1998] D. D. Holm, J. E. Marsden, T. S. Ratiu, Euler-Poincaré equations and semidirect products with applications to continuum theories Adv.\nin Math., 137 (1998) 1-81.\n[HoOnTr2009] D. D. Holm, L. Ó Náraigh, C. Tronci, Singular solutions of a\nmodified two-component Camassa-Holm equation. Phys. Rev. E 79, (2009)\n016601.\n[HoTr2009] D. D. Holm, C. Tronci, Geodesic flows on semidirect-product Lie\ngroups: geometry of singular measure-valued solutions. Proc. Roy. Soc. A,\n465 (2009) 457-476.\n\n30\n\n\f[HoTrYo2007] D. D. Holm, A. Trouvé, L. Younes, The Euler-Poincaré theory\nof metamorphosis. To appear, Quart. Appl. Math.\n[Ki1982] A. A. Kirillov, Invariant operators on geometric quantities, J. Math.\nSci. 18 (1982), no. 1, pp. 121\n[KhZa1995] B. Khesin, I. Zakharevich, Poisson-Lie group of pseudodifferential\nsymbols. Comm. Math. Phys. 171 (1995), no. 3, 475–530\n[Kl1982] Y. L. Klimontovich, The Statistical Theory of Non-equilibrium Processes in a Plasma, M.I.T. Press, Cambridge, Massachusetts, 1967\n[Ku1987] B. A. Kupershmidt Hydrodynamical Poisson brackets and local Lie\nalgebras. Phys. Lett. A 121 (1987), no. 4, 167–174.\n[KuMa1978] B. A. Kupershmidt, Ju. I. Manin, Long wave equations with a free\nsurface. II. The Hamiltonian structure and the higher equations. Funktsional. Anal. i Prilozhen. 12 (1978), no. 1, 25–37\n[Kuzmin2007] P. A. Kuzmin, Two-component generalizations of the CamassaHolm equation. Math. Notes 81 (2007), 130–134.\n[Le1979] D. R. Lebedev, Benney's long waves equations: Hamiltonian formalism. Lett. Math. Phys. 3 (1979), no. 6, 481–488.\n[MaMoWe84] J. E. Marsden, P. J. Morrison, and A.Weinstein, The Hamiltonian\nstructure of the BBGKY hierarchy equations. Contemp. Math. 28 (1984),\n115–124.\n[MaWe1983] J. E. Marsden, A. Weinstein Coadjoint orbits, vortices, and Clebsch variables for incompressible fluids. Physica D 7 (1983), pp. 305-323.\n[MaWe1981] J. E. Marsden, A. Weinstein, The Hamiltonian structure of the\nMaxwell-Vlasov equations. Physica D 4 (1981/82), no. 3, 394–406.\n[MaWeRaScSp1983] J. E. Marsden, A. Weinstein, T. S. Ratiu, R. Schmid, R. G.\nSpencer, Hamiltonian systems with symmetry, coadjoint orbits and plasma\nphysics. Atti Accad. Sci. Torino, Cl. Sci. Fis. Mat. Natur. 117 (1983), 289–\n340.\n[NiDoGuDo08] M. A. Nielsen, M. R. Dowling, M. Gu, A. C. Doherty, Quantum\ncomputation as geometry Science 311 (2008), 1133–1135\n[Ni1955] A. Nijenhuis Jacobi-type identities for bilinear differential concomitants of certain tensor fields. I, II. Indag. Math. 17 (1955), 390–403\n[OlRo1996] P. Olver, P. Rosenau, Tri-Hamiltonian duality between solitons and\nsolitary-wave solutions having compact support. Phys. Rev. E 53 (1996)\n1900–1906.\n\n31\n\n\f[OvRo1999] V. Ovsienko, C. Roger Deforming the Lie algebra of vector fields on\nS 1 inside the Lie algebra of pseudodifferential symbols on S 1 . Am. Math.\nSoc. Transl., Ser. 2, 194 (1999), 211–226\n[QiTa2004] H. Qin, W. M. Tang, Pullback transformations in gyrokinetic theory.\nPhys. of Plasmas 11 (2004), no. 3, 1052-1063.\n[ScWe1994] C. Scovel, A. Weinstein, Finite-dimensional Lie-Poisson approximations to Vlasov-Poisson equations. Comm. Pure Appl. Math. 47 (1994),\nno. 5, 683–709.\n[Vl1961] A. A. Vlasov, On the kinetic theory of an assembly of particles with\ncollective interaction. J. Phys. (USSR) 9 (1945) 25-40; A. A. Vlasov, Manyparticle theory and its application to plasma. Gordon and Breach, New\nYork, 1961\n[We1983] Weinstein, A. [1983], The local structure of Poisson manifolds. J. Differ. Geom. 18 (1983), 523–557.\n\n32\n\n\f"}