{"id": "http://arxiv.org/abs/1002.4483v1", "guidislink": true, "updated": "2010-02-24T06:59:53Z", "updated_parsed": [2010, 2, 24, 6, 59, 53, 2, 55, 0], "published": "2010-02-24T06:59:53Z", "published_parsed": [2010, 2, 24, 6, 59, 53, 2, 55, 0], "title": "Quantum Manifestations of Graphene Edge Stress and Edge Instability: A\n  First-Principles Study", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1002.1680%2C1002.3294%2C1002.3388%2C1002.3819%2C1002.4439%2C1002.3992%2C1002.0117%2C1002.1055%2C1002.3882%2C1002.4665%2C1002.4553%2C1002.3659%2C1002.4755%2C1002.0404%2C1002.2452%2C1002.3558%2C1002.2549%2C1002.2896%2C1002.5028%2C1002.4774%2C1002.4981%2C1002.1751%2C1002.1756%2C1002.0869%2C1002.1984%2C1002.4591%2C1002.0989%2C1002.0538%2C1002.3063%2C1002.3714%2C1002.1019%2C1002.0403%2C1002.0304%2C1002.2297%2C1002.2636%2C1002.2128%2C1002.1475%2C1002.3189%2C1002.1540%2C1002.1010%2C1002.2613%2C1002.3057%2C1002.3890%2C1002.1223%2C1002.2907%2C1002.0322%2C1002.3878%2C1002.1397%2C1002.1589%2C1002.2702%2C1002.0223%2C1002.3301%2C1002.1283%2C1002.4204%2C1002.0450%2C1002.2725%2C1002.0701%2C1002.2806%2C1002.0373%2C1002.0944%2C1002.4666%2C1002.1003%2C1002.1067%2C1002.3215%2C1002.0943%2C1002.4912%2C1002.0082%2C1002.1684%2C1002.4533%2C1002.1412%2C1002.0860%2C1002.0853%2C1002.3433%2C1002.1289%2C1002.1424%2C1002.1314%2C1002.4032%2C1002.1128%2C1002.2820%2C1002.1826%2C1002.0400%2C1002.1735%2C1002.4077%2C1002.0629%2C1002.3373%2C1002.1363%2C1002.4481%2C1002.3375%2C1002.3345%2C1002.4606%2C1002.4649%2C1002.0874%2C1002.2581%2C1002.4483%2C1002.1567%2C1002.4037%2C1002.3680%2C1002.0675%2C1002.3458%2C1002.3877%2C1002.3191&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Quantum Manifestations of Graphene Edge Stress and Edge Instability: A\n  First-Principles Study"}, "summary": "We have performed first-principles calculations of graphene edge stresses,\nwhich display two interesting quantum manifestations absent from the classical\ninterpretation: the armchair edge stress oscillates with a nanoribbon width,\nand the zigzag edge stress is noticeably reduced by spin polarization. Such\nquantum stress effects in turn manifest in mechanical edge twisting and warping\ninstability, showing features not captured by empirical potentials or continuum\ntheory. Edge adsorption of H and Stone-Wales reconstruction are shown to\nprovide alternative mechanisms in relieving the edge compression and hence to\nstabilize the planar edge structure.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1002.1680%2C1002.3294%2C1002.3388%2C1002.3819%2C1002.4439%2C1002.3992%2C1002.0117%2C1002.1055%2C1002.3882%2C1002.4665%2C1002.4553%2C1002.3659%2C1002.4755%2C1002.0404%2C1002.2452%2C1002.3558%2C1002.2549%2C1002.2896%2C1002.5028%2C1002.4774%2C1002.4981%2C1002.1751%2C1002.1756%2C1002.0869%2C1002.1984%2C1002.4591%2C1002.0989%2C1002.0538%2C1002.3063%2C1002.3714%2C1002.1019%2C1002.0403%2C1002.0304%2C1002.2297%2C1002.2636%2C1002.2128%2C1002.1475%2C1002.3189%2C1002.1540%2C1002.1010%2C1002.2613%2C1002.3057%2C1002.3890%2C1002.1223%2C1002.2907%2C1002.0322%2C1002.3878%2C1002.1397%2C1002.1589%2C1002.2702%2C1002.0223%2C1002.3301%2C1002.1283%2C1002.4204%2C1002.0450%2C1002.2725%2C1002.0701%2C1002.2806%2C1002.0373%2C1002.0944%2C1002.4666%2C1002.1003%2C1002.1067%2C1002.3215%2C1002.0943%2C1002.4912%2C1002.0082%2C1002.1684%2C1002.4533%2C1002.1412%2C1002.0860%2C1002.0853%2C1002.3433%2C1002.1289%2C1002.1424%2C1002.1314%2C1002.4032%2C1002.1128%2C1002.2820%2C1002.1826%2C1002.0400%2C1002.1735%2C1002.4077%2C1002.0629%2C1002.3373%2C1002.1363%2C1002.4481%2C1002.3375%2C1002.3345%2C1002.4606%2C1002.4649%2C1002.0874%2C1002.2581%2C1002.4483%2C1002.1567%2C1002.4037%2C1002.3680%2C1002.0675%2C1002.3458%2C1002.3877%2C1002.3191&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We have performed first-principles calculations of graphene edge stresses,\nwhich display two interesting quantum manifestations absent from the classical\ninterpretation: the armchair edge stress oscillates with a nanoribbon width,\nand the zigzag edge stress is noticeably reduced by spin polarization. Such\nquantum stress effects in turn manifest in mechanical edge twisting and warping\ninstability, showing features not captured by empirical potentials or continuum\ntheory. Edge adsorption of H and Stone-Wales reconstruction are shown to\nprovide alternative mechanisms in relieving the edge compression and hence to\nstabilize the planar edge structure."}, "authors": ["Bing Huang", "Miao Liu", "Ninghai Su", "Jian Wu", "Wenhui Duan", "Bing-lin Gu", "Feng Liu"], "author_detail": {"name": "Feng Liu"}, "author": "Feng Liu", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevLett.102.166404", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1002.4483v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1002.4483v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "5figures", "arxiv_primary_category": {"term": "cond-mat.mes-hall", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.mes-hall", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1002.4483v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1002.4483v1", "journal_reference": "Phys. Rev. Lett. 102, 166404, 2009", "doi": "10.1103/PhysRevLett.102.166404", "fulltext": "Quantum Manifestations of Graphene Edge Stress and Edge\nInstability: A First-Principles Study\n\narXiv:1002.4483v1 [cond-mat.mes-hall] 24 Feb 2010\n\nBing Huang1 , Miao Liu2 , Ninghai Su2 , Jian Wu1 ,\nWenhui Duan1 , Bing-lin Gu1 , and Feng Liu2∗\n1\n\nDepartment of Physics, Tsinghua University, Beijing 100084, China and\n2\n\nDepartment of Materials Science and Engineering,\nUniversity of Utah, Salt Lake City, Utah 84112\n(Dated: November 5, 2018)\n\nAbstract\nWe have performed first-principles calculations of graphene edge stresses, which display two\ninteresting quantum manifestations absent from the classical interpretation: the armchair edge\nstress oscillates with nanoribbon width and the zigzag edge stress is noticeably reduced by spin\npolarization. Such quantum stress effects in turn manifest in mechanical edge twisting and warping\ninstability, showing features not to be captured by empirical potentials or continuum theory. Edge\nadsorption of H and Stone-Wales reconstruction are shown to provide alternative mechanisms in\nrelieving the edge compression and hence to stabilize the planar edge structure.\nPACS numbers: 71.15.Mb,62.25.-g,61.46.-w,81.05.Tp\n\n∗\n\nEmail: fliu@eng.utah.edu\n\n0\n\n\fGraphene, a two-dimensional (2D) single layer of carbon atoms, has attracted tremendous attention because of its unique electronic properties[1] and potential applications in\nelectronic devices[2]. Earlier studies have focused on characterizing the unusual electronic\nand transport properties of graphene, particularly as a massless Dirac fermion system[1, 2].\nMore recently, some attention has been shifted to the structural stability of graphene[2–5],\nwhich is critically important to realizing the potential applications of graphene. On the one\nhand, as a 2D membrane structure, graphene provides an ideal testing ground[3, 4] for the\nclassical Mermin-Wagner theorem on the existence of long-range crystalline order in 2D[6, 7].\nOn the other hand, the free edges of graphene are amenable to edge instabilities[5, 8–10].\nThe graphene edge stability is characterized by two fundamental thermodynamic quantities: edge energy and edge stress. The edge of a 2D structure can be understood in\nanalogy to the surface of a 3D structure[11, 12]: the edge (surface) energy accounting for\nthe energy cost to create an edge (surface) defines the edge (surface) chemical stability;\nthe edge (surface) stress accounting for the energy cost to deform an edge (surface) defines\nthe edge (surface) mechanical stability. First-principles calculations showed that chemically\nthe armchair edge is more stable with a lower energy, while the zigzag edge is metastable\nagainst reconstruction[8], and both edges are hydrogenated in an H-rich environment[9].\nEmpirical-potential calculations showed that both intrinsic edges are under compressive\nstress rendering a mechanical edge twisting and warping instability[10].\nUsually, stress and mechanical instability are understood as phenomena of classical mechanics, but they are expected to be affected by quantum effects which become prominent\nat nanoscale. So far, however, quantum effects have been mostly shown for electronic structure and energetic quantities of low-dimensional nanostructures. Here, we demonstrate an\ninteresting example of quantum manifestations of mechanical quantities in graphene edge\nstress. Using first-principles calculations, we predict that the armchair edge stress in a\nnanoribbon exhibits a large oscillation with ribbon width arising from quantum size effect,\nwhile the zigzag edge stress is reduced by spin polarization. Such quantum effects on edge\nstress in turn manifest in graphene edge mechanical instability, with \"quantum\" features\nthat apparently cannot be described by empirical force-field potentials or continuum theory.\nOur calculations were performed using the method based on density functional theory\n(DFT) in the generalized gradient approximation, with the Perdew-Burke-Ernzerhof functional for electron exchange and correlation potetnials, as implemented in the VASP code\n1\n\n\fFIG. 1: The armchair edge stresses and edge energies of graphene nanoribbons as a function of\nribbon width. Inset: schematics of the nanoribbon; the rectangle marks one unit cell (supercell)\nof the ribbon.\n\n[13]. The electron-ion interaction was described by the projector augmented wave method,\nand the energy cutoff was set to 500 eV. The structures were fully optimized using the conjugate gradient algorithm until the residual atomic forces to be smaller than 10 meV /Å. The\nsupercell method with periodic boundary conditions was adopted to model the graphene\nnanoribbons (GNR), with a vacuum layer larger than 15 Å to guarantee that there was no\ninteraction between the GNR images in the neighboring cells. The edge energy is calculated\nas Eedge = (Eribbon −Eatom )/2L, where Eribbon is the total energy of the graphene nanoribbon\nin the supercell, Eatom is the energy per atom in a perfect graphene without edge, and L\nis the length of edge. The edge stress is calculated as σedge = σxx /2L, where σxx is the\ndiagonal component of supercell stress tensor in the x-direction (defined along the edge),\nwhich is calculated using the Nielsen-Martin algorithm [14]. All other components of stress\ntensor vanish. We also note that DFT is suitable for calculating ground-state properties of\nlattice energies and stresses, to which the non-local many-body effects are not expected to\nbe important.\nFigure 1 shows the calculated edge energy and edge stress of GNR armchair edges as\na function of ribbon width ranging from ∼ 3.5 to ∼ 48 Å. One notices that both edge\nenergy and edge stress oscillate with the increasing width having a period of 3 but out\nof phase with each other. The oscillations are originated from the quantum confinement\neffect, as also manifested in the similar oscillations of electron band structures[15–18]. The\n\n2\n\n\fFIG. 2: The AFM and PM zigzag edge stresses and edge energies of graphene nanoribbons as a\nfunction of ribbon width. Inset: schematics of the nanoribbon; the rectangle marks one unit cell\n(supercell) of the ribbon.\n\noscillation magnitude of edge energy decays quickly with the increasing width and converges\nto ∼ 1.0 eV/Å, which agrees well with the previous first-principles values[8]. In contrast,\nthe oscillation magnitude of edge stress decays much slower with a mean value of ∼ -1.45\neV/Å(using negative sign as convention for compressive stress). The much larger oscillation\nin edge stress than in edge energy is possibly caused by the fact that edge stress equals to\nthe derivative of edge energy with respect to strain, so that stress is much more sensitive to\nthe width-dependent quantum confinement effect. There is also a slight revival effect in the\nstress oscillations at ∼ 40Å width, whose origin is not clear and needs further study.\nFigure 2 shows the calculated edge energy and edge stress of GNR zigzag edges as a\nfunction of ribbon width ranging from ∼ 5.0 to ∼ 85 Å. In this case, both edge energy and\nedge stress show very weak width dependence and converges quickly, again consistent with\ntheir corresponding electronic-structure behavior[15–18]. However, the zigzag edge is known\nto have an antiferromagnetic (AFM) ground state[17]. The AFM edge energy is calculated\nto be ∼ 1.2 eV/Å, about 0.2 eV/Å lower than the paramagnetic (PM) edge energy[8, 9, 19].\nThus, we have calculated the edge stress of both AFM and PM states for comparison. We\nfound that spin polarization have a sizable effect reducing the compressive stress from ∼\n-0.7 eV/Å in the PM edge to ∼ -0.5 eV/Å in the AFM edge.\nOur first-principles stress calculations confirm qualitatively the recent empirical-potential\nresults[10] that both edges are under compressive stress. However, there are also some\n\n3\n\n\fsignificant differences. Two quantum manifestations of edge stress stand out, which are\nabsent from the empirical prediction. One is the quantum oscillation of armchair edge stress\nwith the increasing nanoribbon width, and the other is the reduction of zigzag edge stress by\nspin polarization. The physical origin of edge energy and edge stress is associated with the\nformation of one dangling bond on each edge atom. The repulsive interaction between the\ndangling bonds is believed to be one origin for the 'compressive' edge stress. In addition, in\nthe armchair edge, it is well-known[20] that the edge dimers form triple -C≡C- bonds with\na much shorter distance (∼ 1.23 Å according to our calculation) adding extra compressive\nstress to the edge; while in the zigzag edge, spin polarization further reduces the compressive\nstress. Therefore, quantitatively, the armchair edge has a much larger compressive stress\n(∼ -1.45 eV/Å) than the zigzag edge (∼ -0.5 eV/Å). In contrast, the empirical potentials\npredicted a smaller compressive stress in the armchair edge (∼ -1.05 eV/Å) than in the\nzigzag edge (∼ -2.05 eV/Å)[10].\nThe quantum effects in edge stress will in turn modify the mechanical edge instability.\nThe compressive edge stress means the edge has a tendency to stretch. If we apply a\nuniaxial in-plane strain to a nanoribbon along the edge direction, the strain energy can be\ncalculated as [10]\nEstr = 2τe Lε + Ee Lε2 + 21 Es Aε2 (1)\nHere, A is the ribbon area, L is the edge length, τe is the edge stress, Ee is the 1D\nedge elastic modulus in a 2D nanoribbon, in analogy to the 2D surface elastic modulus in\na 3D nanofilm[21], and Es is the 2D sheet elastic modulus. Since τe is negative, for small\nenough tensional strain ε (positive), the negative first term (linear to ε) in Eq. (1) can\nalways overcome the positive second and third terms (quadratic to ε) to make Estr negative.\nConsequently, the ribbon is unstable against a small amount of stretching along the edge\ndirection. Fitting first-principles calculations, by manually deforming the sheet and ribbon\nalong the edge direction, to equation (1), we obtained Es ≈ 21.09 eV/Å2 , Ee (amchair)≈ 3\neV/Å and Ee (zigzag) ≈ 24 eV/Å with τe already calculated above directly (see Figs. 1 and\n2). Our Es value is in good agreement with the experiment[22] and empirical simulation\nresult[10]. But our Ee values are notably different from the empirical results[10].\nAnother effective way to stretch the edge of a 2D sheet is by out-of-plane edge twisting\nand warping motions, which are barrierless processes. For example, assuming a sinusoidal\n4\n\n\fFIG. 3: (a) Armchair edge ripple amplitude versus ribbon width for λ = 50Å. Inset: Schematics\nof ripple formation along the armchair and zigzag edge for λ = 50Å. (b) Armchair (red) and zigzag\n(blue) edge ripple amplitude as a function of λ. Light blue band shows the typical range of thermal\nfluctuation.\n\nedge warping with displacement μe = a sin(2πx/λ) of amplitude a and wavelength λ, which\ndecays exponentially into the sheet as e−y/l (See inset of Fig. 3), where l is the decay length,\nShenoy et al. have shown that minimization of strain energy leads to characteristic length\nscales of such warping instability as l ≈ 0.23λ and a ≈\n\nq\n\n(−λτe )/(1.37Eb + 14.8Ee /λ). Using\n\ntheir empirical-potential values of τe , Ee and Es , they estimated that the warping magnitude\nof armchair edge is smaller than that of zigzag edge and both are larger than typical thermal\nfluctuations[10].\nOur first-principle predictions, however, are different in several ways. First, absent from\nempirical prediction, the quantum oscillation of τe of armchair edge gives rise to an oscillating\narmchair edge warping amplitude for given wavelength as a function of nanoribbon width,\nas shown in Fig. 3a. Second, opposite to empirical prediction, the warping amplitude of\n5\n\n\fFIG. 4: (a) The armchair edge stresses (with linear fit) and edge energies of graphene nanoribbons\nas a function of edge SW defect concentration. (b) The optimaized ribbon structure at the 50%\nSW defect concentration.\n\narmchair edge is much larger than that of zigzag edge, as shown in Figs. 3b. Third, the\nmechanical undulation of zigzag edges induced by compressive edge stress is comparable to\nthermal fluctuations[3, 4], as shown in Fig. 3b, and hence the two are difficult to distinguish.\nWe also note that in addition to the continuum analysis we perform here, the accurate\nfirst-principles values of τe and Ee can be used as input parameters for the finite element\nsimulations of large graphene systems[10].\nBecause the compressive edge stress is partly originated from the dangling bond, naturally, we may saturate the dangling bonds to relieve the compressive stress. We have tested\nthis idea by saturating the edge with H that indeed confirmed our physical intuition. For\narmchair edge in a 1-nm wide ribbon, we found H saturation changes the edge stress from\n-1.42 eV/Å to -0.35 eV/Å; for zigzag edge in a 2.0-nm wide ribbon, it changes the edge\nstress from -0.42 eV/Å to +0.13 eV/Å. Therefore, the H edge saturation, or saturation by\nother molecules in general, is expected to relieve the edge compression. Especially, it can\nreverse the compressive stress in a zigzag edge to tensile.\nSurface reconstruction has long been known as an effective mechanism in relieving surface\n6\n\n\fstress[23]. Thus, in addition to H saturation, we have investigated possible edge reconstructions in relieving the edge compressive stress. We have considered the Stone-Wales (SW)\ndefect[24], which appealed to us become a SW defect in 2D is equivalent to a dislocation core\nin 3D that is known as a common stress relieve mechanism. Figure 4a shows the calculated\narmchair edge stress along with edge energy as a function of one type of SW defect (7-5-7 ring\nstructure) concentration. Figure 4b shows an example of the optimized edge structure at the\n50% defect concentration. One sees from Fig. 4a that the edge stress increases linearly from\ncompressive to tensile with the increasing SW defect concentration. The most stable edge\nstructure is at ∼ 25% defect concentration where the edge stress is very small and slightly\ncompressive. A small stress value indicates that this chemically stable edge structure (with\nthe lowest edge energy) is also most mechanically stable against deformation.\nFigure 5a shows the ground-state AF zigzag edge stress along with edge energy as a\nfunction of another type of SW defect (5-7 ring structure) concentration. Figure 5b shows\nan example of the optimized edge structure and spin charge density at the 50% defect\nconcentration. Again, the edge stress increases linearly from compressive to tensile with the\nincreasing defect concentration, the same as the case of armchair edge (Fig. 4a), but the\nedge energy decreases monotonically with the most stable edge having 100% of defects, in\nagreement with a recent first-principles calculation [8]. The initial compressive edge stress\n(∼ -0.5 eV/Å) is completely reversed to a large tensile value of ∼1.2 eV/Å in the most\nstable edge. Also, the 100% defected edge becomes non-spin-polarized. In general, the zigzag\nedge spin decreases continuously with the increasing SW defect concentration, similar to the\nbehavior found previously for other types of defects [25].\nWe note that there is a first-principles calculation of graphene edge stress was reported\nrecently[26], but that calculation appears inconsistent with all other existing first-principles\ncalculations . Their edge energies differ from all previous results[8, 9] and ours that are\nconsistent with each other. The well-known spin-polarization of the zigzag edge was not\nconsidered, the quantum oscillation of armchair edge energy and stress was not shown, and\ntheir edge stress were not calculated from direct quantum-mechanical formula [14].\nIn conclusion, quantum effects have been widely shown for electronic structure and energetic quantities of low-dimensional nanostructures. We demonstrate, in addition, quantum\nmanifestations of mechanical quantities in graphene edge stress. We show that quantum\nconfinement can lead to stress oscillations and spin polarization can reduce stress, which in\n7\n\n\fFIG. 5: (a) The zigzag edge stresses (with linear fit) and edge energies of graphene nanoribbons as\na function of SW defect concentration. (b) The optimized ribbon structure and spatial distribution\nof spin density (charge density difference between spin-up and spin-down states in units of μB Å−2 )\nof the AFM ground state at the 50% SW defect concentration.\n\nturn \"quantum mechanically\" modify the edge twisting and warping instability. We further\nshow that H edge saturation and SW edge reconstruction can not only improve the 'chemical' stability of graphene edges by lowering the edge energy as shown before[8, 9], but also\nenhance their 'mechanical' stability by converting compressive edge stress towards tensile\nand hence stabilizing the planar edge structure. Our first-principles findings, which cannot\nbe captured by classical methods, provide new insights to the understanding of mechanical\nstability of graphene. We suggest that experimental measurement of armchair edge ripple\nmagnitudes for different widths and comparison with zigzag edge ripples could confirm our\npredictions of quantum effects in graphene edge stresses differentiating from empirical results. We expect the quantum manifestation of mechanical properties such as stress to exist\ngenerally in many low-dimensional nanostructures.\nThe work at Tsinghua is supported by the Ministry of Science and Technology of China\n\n8\n\n\fand NSFC, the work at Utah is supported by DOE.\n\n[1] A. H. Castro Neto et al., Rev. Mod. Phys. 81, 109 (2008).\n[2] A. K. Geim and K. S. Novoselov, Nature Mater. 6, 183 (2007).\n[3] J. C. Meyer et al., Nature (London) 446, 60 (2007).\n[4] A. Fasolino, J. H. Los and M. I. Katsnelson, Nature Mater. 6, 858 (2007).\n[5] M. S. Gass et al., Nature Nanotech. 3, 676 (2008).\n[6] L. D. Landau, Phys. Z. Sowjetunion 11, 26 (1937).\n[7] N. D. Mermin, Phys. Rev. 176, 250 (1968).\n[8] P. Koskinen, S. Malola, and H. Hakkinen, Phys. Rev. Lett. 101, 115502 (2008).\n[9] T. Wassmann et al., Phys. Rev. Lett. 101, 096402 (2008).\n[10] V. B. Shenoy, C. D. Reddy, A. Ramasubramaniam, and Y.W. Zhang, Phys. Rev. Lett. 101,\n245501 (2008).\n[11] F. Liu, M. Hohage, and M. G. Lagally, Encyclopedia of Appl. Phys., eds. H. Immergut and\nG. Trigg, Supplement Volume, 321 (1999).\n[12] R. Pala and F. Liu, J. Chem. Phys. 120, 7720 (2004).\n[13] G. Kresse and J. Furthmüller, Comput. Mater. Sci. 6, 15 (1996).\n[14] O. H. Nielsen and R. M. Martin, Phys. Rev. B32, 3780 (1985).\n[15] K.Nakada et al., Phys. Rev. B54, 17954 (1996).\n[16] K. Wakabayashi et al., Phys. Rev. B59, 8271 (1999).\n[17] Y.-W. Son, M. L. Cohen, and S. G. Louie, Phys. Rev. Lett. 97, 216803 (2006).\n[18] Q. Yan et al., Nano Lett. 7, 1469 (2007).\n[19] H. Lee et al., Phys. Rev. B, 72, 174431 (2005).\n[20] T. Kawai, Y. Miyamoto, O. Sugino, and Y. Koga, Phys. Rev. B, 62, 16349 (2000).\n[21] J. Zang and F. Liu, Nanotechno. 18, 405501 (2007); Appl. Phys. Lett. 92, 021905 (2008).\n[22] C. Lee et al., Science 321, 385 (2008).\n[23] F. Liu and M.G. Lagally, Phys. Rev. Lett. 76, 3156 (1996).\n[24] A. J. Stone and D. J. Wales, Chem. Phys. Lett. 128, 501 (1986).\n[25] B. Huang et al., Phys. Rev. B, 77, 153411 (2008).\n[26] S. Jun, Phys. Rev. B, 78, 073405 (2008).\n\n9\n\n\f"}