{"id": "http://arxiv.org/abs/0912.2440v1", "guidislink": true, "updated": "2009-12-12T17:57:11Z", "updated_parsed": [2009, 12, 12, 17, 57, 11, 5, 346, 0], "published": "2009-12-12T17:57:11Z", "published_parsed": [2009, 12, 12, 17, 57, 11, 5, 346, 0], "title": "Random First Order Phase Transition Theory of the Structural Glass\n  Transition", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0912.5197%2C0912.3098%2C0912.1538%2C0912.5407%2C0912.0336%2C0912.3949%2C0912.0614%2C0912.4619%2C0912.4519%2C0912.2632%2C0912.2093%2C0912.0866%2C0912.1396%2C0912.3304%2C0912.0610%2C0912.5178%2C0912.3293%2C0912.4758%2C0912.2440%2C0912.5206%2C0912.0658%2C0912.0621%2C0912.0720%2C0912.3673%2C0912.2492%2C0912.3730%2C0912.0488%2C0912.1877%2C0912.2314%2C0912.1662%2C0912.1317%2C0912.1943%2C0912.2865%2C0912.2981%2C0912.2169%2C0912.4682%2C0912.3382%2C0912.1225%2C0912.3810%2C0912.3350%2C0912.4990%2C0912.0437%2C0912.5159%2C0912.0512%2C0912.1037%2C0912.2614%2C0912.1733%2C0912.0326%2C0912.1117%2C0912.4667%2C0912.1424%2C0912.4038%2C0912.2499%2C0912.2296%2C0912.3725%2C0912.2504%2C0912.2174%2C0912.1358%2C0912.3945%2C0912.4620%2C0912.4724%2C0912.1651%2C0912.3843%2C0912.4269%2C0912.0903%2C0912.3453%2C0912.3194%2C0912.1882%2C0912.3933%2C0912.0362%2C0912.0584%2C0912.2191%2C0912.2079%2C0912.5402%2C0912.3787%2C0912.5066%2C0912.5315%2C0912.2159%2C0912.2914%2C0912.3774%2C0912.0996%2C0912.0643%2C0912.2082%2C0912.2421%2C0912.5037%2C0912.2255%2C0912.3909%2C0912.4493%2C0912.3710%2C0912.4363%2C0912.2719%2C0912.3287%2C0912.1437%2C0912.1637%2C0912.2248%2C0912.2493%2C0912.0128%2C0912.4327%2C0912.4746%2C0912.2382%2C0912.0306&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Random First Order Phase Transition Theory of the Structural Glass\n  Transition"}, "summary": "We describe our perspective on the Structural Glass Transition (SGT) problem\nbuilt on the premise that a viable theory must provide a consistent picture of\nthe dynamics and statics, which are manifested by large increase in shear\nviscosity and thermodynamic anamolies respectively. For the static and dynamic\ndescription to be consistent we discovered, using a density functional\ndescription without explicit inclusion of quenched random interactions and a\nmean-field theory, that there be an exponentially large number of metastable\nstates at temperatures less than a critical transition temperature, $T_A$. At a\nlower temperature ($T_K < T_A$), which can be associated with the Kauzmann\ntemperature, the number of glassy states is non-extensive. Based on this theory\nwe formulated an entropic droplet picture to describe transport in finite\ndimensions in the temperature range $T_K < T < T_A$. From the finding that\nglasses are trapped in one of many metastable states below $T_A$ we argue that\nduring the SGT law of large numbers is violated. As a consequence in glasses\nthere are sub sample to sub sample fluctuations provided the system is observed\nfor times longer than the typical relaxation time in a liquid. These\nconsiderations, which find support in computer simulations and experiments,\nalso link the notion of dynamic heterogeneity to the violation of law of large\nnumbers. Thus, the finding that there is an extensive number of metastable\nstates in the range $T_K < T < T_A$ offers a coherent explanation of many of\nthe universal features of glass forming materials.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0912.5197%2C0912.3098%2C0912.1538%2C0912.5407%2C0912.0336%2C0912.3949%2C0912.0614%2C0912.4619%2C0912.4519%2C0912.2632%2C0912.2093%2C0912.0866%2C0912.1396%2C0912.3304%2C0912.0610%2C0912.5178%2C0912.3293%2C0912.4758%2C0912.2440%2C0912.5206%2C0912.0658%2C0912.0621%2C0912.0720%2C0912.3673%2C0912.2492%2C0912.3730%2C0912.0488%2C0912.1877%2C0912.2314%2C0912.1662%2C0912.1317%2C0912.1943%2C0912.2865%2C0912.2981%2C0912.2169%2C0912.4682%2C0912.3382%2C0912.1225%2C0912.3810%2C0912.3350%2C0912.4990%2C0912.0437%2C0912.5159%2C0912.0512%2C0912.1037%2C0912.2614%2C0912.1733%2C0912.0326%2C0912.1117%2C0912.4667%2C0912.1424%2C0912.4038%2C0912.2499%2C0912.2296%2C0912.3725%2C0912.2504%2C0912.2174%2C0912.1358%2C0912.3945%2C0912.4620%2C0912.4724%2C0912.1651%2C0912.3843%2C0912.4269%2C0912.0903%2C0912.3453%2C0912.3194%2C0912.1882%2C0912.3933%2C0912.0362%2C0912.0584%2C0912.2191%2C0912.2079%2C0912.5402%2C0912.3787%2C0912.5066%2C0912.5315%2C0912.2159%2C0912.2914%2C0912.3774%2C0912.0996%2C0912.0643%2C0912.2082%2C0912.2421%2C0912.5037%2C0912.2255%2C0912.3909%2C0912.4493%2C0912.3710%2C0912.4363%2C0912.2719%2C0912.3287%2C0912.1437%2C0912.1637%2C0912.2248%2C0912.2493%2C0912.0128%2C0912.4327%2C0912.4746%2C0912.2382%2C0912.0306&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We describe our perspective on the Structural Glass Transition (SGT) problem\nbuilt on the premise that a viable theory must provide a consistent picture of\nthe dynamics and statics, which are manifested by large increase in shear\nviscosity and thermodynamic anamolies respectively. For the static and dynamic\ndescription to be consistent we discovered, using a density functional\ndescription without explicit inclusion of quenched random interactions and a\nmean-field theory, that there be an exponentially large number of metastable\nstates at temperatures less than a critical transition temperature, $T_A$. At a\nlower temperature ($T_K < T_A$), which can be associated with the Kauzmann\ntemperature, the number of glassy states is non-extensive. Based on this theory\nwe formulated an entropic droplet picture to describe transport in finite\ndimensions in the temperature range $T_K < T < T_A$. From the finding that\nglasses are trapped in one of many metastable states below $T_A$ we argue that\nduring the SGT law of large numbers is violated. As a consequence in glasses\nthere are sub sample to sub sample fluctuations provided the system is observed\nfor times longer than the typical relaxation time in a liquid. These\nconsiderations, which find support in computer simulations and experiments,\nalso link the notion of dynamic heterogeneity to the violation of law of large\nnumbers. Thus, the finding that there is an extensive number of metastable\nstates in the range $T_K < T < T_A$ offers a coherent explanation of many of\nthe universal features of glass forming materials."}, "authors": ["T. R. Kirkpatrick", "D. Thirumalai"], "author_detail": {"name": "D. Thirumalai"}, "author": "D. Thirumalai", "arxiv_comment": "17 pages", "links": [{"href": "http://arxiv.org/abs/0912.2440v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0912.2440v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "cond-mat.soft", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.soft", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0912.2440v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0912.2440v1", "journal_reference": null, "doi": null, "fulltext": "Random First Order Phase Transition Theory of the Structural\n\narXiv:0912.2440v1 [cond-mat.soft] 12 Dec 2009\n\nGlass Transition\nT. R. Kirkpatrick1,2 and D. Thirumalai1,3\n1\n\nInstitute for Physical Science and Technology,\n\nUniversity of Maryland, College Park, MD 20742\n2\n\nDepartment of Physics, University of Maryland, College Park, MD 20742\n3\n\nDepartment of Chemistry and Biochemsitry,\n\nUniversity of Maryland, College Park, Maryland 20742, USA\n(Dated: October 25, 2018)\n\nAbstract\nWe describe our perspective on the Structural Glass Transition (SGT) problem built on the premise\nthat a viable theory must provide a consistent picture of the dynamics and statics, which are manifested by large increase in shear viscosity and thermodynamic anamolies respectively. For the static\nand dynamic description to be consistent we discovered, using a density functional description without\nexplicit inclusion of quenched random interactions and a mean-field theory, that there be an exponentially large number of metastable states at temperatures less than a critical transition temperature,\nTA . At a lower temperature (TK < TA ), which can be associated with the Kauzmann temperature,\nthe number of glassy states is non-extensive. Based on this theory we formulated an entropic droplet\npicture to describe transport in finite dimensions in the temperature range TK < T < TA . From the\nfinding that glasses are trapped in one of many metastable states below TA we argue that during the\nSGT law of large numbers is violated. As a consequence in glasses there are sub sample to sub sample\nfluctuations provided the system is observed for times longer than the typical relaxation time in a liquid. These considerations, which find support in computer simulations and experiments, also link the\nnotion of dynamic heterogeneity to the violation of law of large numbers. Thus, the finding that there\nis an extensive number of metastable states in the range TK < T < TA offers a coherent explanation\nof many of the universal features of glass forming materials.\n\n1\n\n\fI.\n\nI. INTRODUCTION\n\nThe Structural Glass Transition (SGT) in a variety of materials whose molecular constituents\nare chemically different exhibits several universal characteristics. This has prompted a quest for\ndescribing a universal mechanism of the nature of the glass transition. Over twenty years ago\nthere were a number of significant contributions to the understanding of the SGT. They included\nthe mode coupling theory of the glass transition [1, 2, 3], the random first order transition theory\nof the glass transition [4, 5], and its connection to dynamic theories, and to a lesser extent, the\nkinetically constrained kinetic models of the glass transition [6]. Much of this work was, in turn,\nmotivated by research done ten years earlier on the spin glass problem [7, 8, 9].\nIn this short perspective we discuss a theory for the SGT that is based on using frozen density\nfluctuations as an order parameter to characterize the SGT [4]. The particular type of transition\nthat arises from our considerations has been referred to as a random first order phase transition\n(RFOPT) [4, 5]. Originally this sort of phase transition was theoretically found in certain class\nof exactly soluble spin glass models [10, 11, 12], but it was subsequently realized that it can\nnaturally occur in systems without quenched disorder and in continuum field theory models [4].\nIn part we will focus on the connection between a static approach to describe the SGT and\na dynamical theory, notion that was first emphasized in [13]. Too often these approaches are\npresented as being distinct from each other while a careful study shows that they are, in fact,\nclosely related. Indeed, establish such a connection is crucial to understanding the nature of the\nSGT[14, 15, 16]. In linking the static and dynamic theories of the glass transition we discovered\nthat the universal features of glasses are characterized by the nature of an extensive number of\nmetastable states that emerge below a characteristic temperature [4].\nPhysically there are obvious similarities between spin and structural glasses [17]. A structural\nglass is a frozen liquid: A snap shot of a structural glass looks identical to a snapshot of a liquid,\ni.e., in both cases there is no long range spatial order. It is only when the system develops\nin time that a glass is obviously different than a liquid since in the former case the molecules\nare localized to a small region of space on experimental time scales while in the latter case,\nany molecule diffuses arbitrary far from where it started as t → ∞. Similarly, a spin glass is\na frozen paramagnet: A snapshot of a SG looks identical to a snapshot of a paramagnet, i.e.,\nthere is no long ranged magnetic order. When the systems evolves in time the local magnetic\n\n2\n\n\fmoment or spin points in a specific (time) averaged direction in the SG phase while in the\nparamagnetic phase the spin direction randomly fluctuates in time so that the time averaged\nmagnetic moment is zero. In both the liquid and spin problems it is clear that there is at least\nan effective phase transition into the glassy state, and that there is broken ergodicity at the\nglass transition since time averages no longer equal full ensemble averages. Moreover, there are\nviolations of the fluctuation-dissipation relations thus making the dynamics dependent on initial\nconditions [18, 19], and aging effects become relevant [20].\nFor some time it was thought that there were important conceptional differences between\nstructural and spin glasses. In particular, in SG problems an important input is that there is\nquenched disorder. In structural glasses, on the other hand, there is quenched disorder only in\nthe glassy phase, and it is self-generated. In other words, the Hamiltonians of glass forming\nmaterials are not random whereas the emergence of glassy behavior in SG is due to the presence\nof quenched random interactions between the spins. We now know that this difference is not\nso relevant. In fact, the important contribution of [4] was that it was the first paper to show\nthat the methods that were developed to describe RFOPT in SG models, which appeared to be\nresticted to models with quenched disorder could, in fact, be used in any system where there\nare many statistically distributed metastable states [4]. This crucial discovery that allowed\nus to produce a consistent static and dynamical theory of the SGT using a density functional\nHamiltonian has been subsequently elaborated and expanded by numerous authors (see [21] and\nreferences therein).\nThe plan of this perspective is as follows. In Section II we introduce specific static and dynamic density functional models for the SGT. In Section III the static approach to understanding\nthe SGT is described. In particular, we use a combination of mean-field like approximations\nand a replica approach to deal with the self-generated randomness in structural glasses to conclude there is a special temperature, conventionally denoted by TA , below which there are an\nexponentially large number of glassy solutions. In Section IV we show the purely dynamical\napproach yields results for the SGT that are identical to the static approach. In Section IV we\ndescribe a related scaling and droplet approach to RFOPT and to the STG transition in particular. We also discuss how to characterize the liquid system below TA . We see that a Kauzmann\ntemperature, TK , is naturally present in this approach, and that a true glass transition is possible if TK could be reached while maintaining the system in equilibrium. In this Section we\n3\n\n\falso review some speculation on transport at TK is approached. A consequence of the droplet\npicture is that the law of large numbers is violated in the glassy phase. The implication is that\nwhen observed over a period of time various properties in glasses vary from region to region,\nwhich naturally explains the emergence of dynamical heterogeneity, and broken ergodicity. We\nconclude in Section VI with a discussion.\n\nII.\n\nDENSITY FUNCTIONAL MODELS FOR THE GLASS TRANSITION\n\nA glass can be characterzied as an amorphous that is described in terms of statistically\ndistributed density field, or as a dynamically frozen density fluctuation. This motivates using\nthe number density, n(x, t),as the order parameter for the SGT where (x, t) are space-time\npoints. To be specific we will give a very explicit functional field theory for n, and dynamical\nequations for the density. Once this is done, we will discuss how to characterize the glass\ntransition by the behavior of n as a punitive glass transition is approached within these simple\nmodels. More general theories can, of course, be considered.\n\nA.\n\nDensity Functional Hamiltonian (DFH)\n\nThe static model for the glass transition reviewed here was motivated by results for spin\nglass models without reflection symmetry [10]. The resulting phase transition is known as a\nrandom first order phase transition (RFOPT). Originally it was thought that this sort of unusual\ntransition required the existence of quenched disorder as is the case in spin glass systems [9],\nbut not in systems undergoing a structural glass transition, where it is said that the disorder\nis self-generated. As mentioned in the Introduction this turned out not to the case, as we first\nshowed in 1989 [4] (referred to from now on as KT). The theoretical ideas in KT form the basis\nof many subsequent developments in the SGT. Indeed, the generality of the conclusions in KT\nhas subsequently been established by others as well [22].\nThe model DFH is,\nβH = −μ\n\nR\n\ndxδn(x +\n\n1\n2\n\nR\n\ndx1 dx2 δn(x1 )χ−1 (x1 −x2 )δn(x2 ) +\nR\nR\n+ g44 dx[δn(x)]4 − dxH(x)δn(x)\n4\n\ng3\n3\n\nR\n\ndx[δn(x)]3\n(1)\n\n\fwhere μ is the chemical potential, H(x), is a small (→ 0), random, symmetry breaking external field whose role will become clear, and g3 and g4 are nonlinear coupling constants whose\nmagnitudes are chosen such that a systematic self consistent expansion in density fluctuations\nis possible. The wavenumber(k)-dependent χ(k) is related to the static structure factor and\ncontains information on the short range order in the fluid.\n\nB.\n\nDynamical model\n\nSince we are characterizing the SGT in terms of frozen density fluctuations we need a dynamical equation for space and time dependent density fluctuation, δn(x,t). We chose conservative\nrelaxational dynamics, which reflects the fact that at a molecular length scale, density fluctuations are diffusive. The dynamical equation is,\n1\nδ(βH)\n∂t δn(x,t) = ∇2\n+ ξ(x,t)\nΓ0\nδ(δn(x,t))\n\n(2)\n\nwith ξ(x,t) the usual Gaussian noise term and Γ0 a bare kinetic coefficient that sets the microscopic time scale. More general dynamics including 'mode coupling' terms can also be considered.\n\nIII.\n\nSTATIC THEORY OF THE GLASS TRANSITION\n\nThe static theory of the glass transition starts with the DFH given by Eq. (1). We introduce\ntwo related key notions [4]. First, we imagine an order parameter description in terms of frozen\ndensity fluctuations. Since the glassy state is amorphous or aperiodic [23] it is most naturally\nspecified by a probability measure P[δn]. Secondly, we allow for a large number of macro states\nor pure states (at least on a given time scale). These states are characterized as follows. Denote\na particular macroscopic state by the label s, with the density field in that state given by\nns = no + δns . We denote the free energy of this state by Fs . Next compute Fs from Eq. (1) by\nstandard loop expansion techniques. We then allow for a possibly large number of statistically\nsimilar but different states by using a partition function defined by,\nZ\nX\nY\u0012\nZ=\nexp(−βFs ) = D[δn]∆(δn) exp(−βF )\ns\n\nδβF\nδ(δn(x))\n\n\u0013\n\n.\n\n(3)\n\n2\n\nHere ∆(δn) = |det δ F/δn2 | normalizes the delta function in the equation given above. Equation\n(3) defines a probability measure P[δn] for the field δn. In usual phase transition problems\n5\n\n\fP[δn] is a delta function at the unique (or, more generally, at all globally symmetry-related)\nequilibrium state(s) of the system. However, in general, Eq. (4) is capable of describing a large\nnumber of symmetry-unrelated states that are statistically distributed.\nWe have used these equations to solve for the SGT as follows. We define the correlation\nfunction,\nQ(x1 , x2 ) =< δn(x1 )δn(x2 ) >,\n\n(4)\n\nand an analogous density response function, R(x1 , x2 ). Here the angular brackets denote an\naverage with weight P[δn]. We solve for these two correlation functions using a standard loop\nexpansion. We assume that the field H is a small Gaussian random field which statistically\nbreaks the symmetry of the liquid phase to a glassy phase. The random field serves as an external\ncoupling term conjugate to the Edwards-Anderson order parameter, Q, which characterizes the\nglassy phase. The variance of H is set equal to zero at the end of the calculation. Carrying out\na self-consistent expansion, using the fact that g3 and g4 are small, yields closed equations for\nR and Q. In wavenumber space these equations are,\n\nand\n\nR(k) = n0 S(k) − Q(k)\n\n(5)\n\n\u0013\n\u0012\nZ\n2\nQ(k − k1 )Q(k1 ) .\nQ(k) = R(k) 2g3\n\n(6)\n\nk1\n\nAn identical nonlinear equation for the glassy order parameter is obtained in the next Section\nusing a dynamical approach. The solution of the resulting equation has been discussed elsewhere\n([4] and references therein). Here we note that nontrivial Q solutions become possible below a\ntemperature, TA , and at this tempearture Q jumps discontinuously to a nonzero value [4]. In\nR\ngiving Eqs.(5) and (6), we explicitly considered random solutions by requiring V −1 dxδn(x) →\n0, where V is the volume, even though the square (spatial) average of δn is nonzero. These two\n\nconditions hence lead to the the moniker, random first order phase transition.\nWe note that the manipulations leading to Eqs.(5) and (6) are similar to those used for mean\nfield spin glasses. Physically, the SGT theory is similar to mean field SG theories because; (1)\nThe term in the brackets in Eq.(6) represents self-generated randomness, and (2) Mean field\nlike approximations were used in deriving Eq.(6). Also, in deriving Eqs.(5) and (6) we used an\ninfinitesimal Gaussian random field to set up the perturbation theory, introduce replicas, and\nuse a replica symmetry breaking scheme that assumed only self-overlap of the metastable glassy\n6\n\n\fstates, as one does for SG systems with RFOPT. We stress that at the end of our calculation\nwe set H = 0, so that there is no 'quenched' randomness. We note parenthetically that this\nmethod of locating a particular pure state has been used in the STG problem studied by replica\nmethods [24]\nWe next discuss the physical significance of the transition temperature where the Eqs.(6)\nfirst has a nontrivial solution, TA . We define two, in general, distinct free energies,\nFc =\n\nX\n\nexp(−βFs )\n\n(7)\n\ns\n\nand\n\nP\ns Fs exp(−βFs )\n.\nF = P\ns exp(−βFs )\n\n(8)\n\nwhere Fc is the usual canonical free energy while F is the component weighted free energy.\nDirect calculation in the glassy state gives Fc =FL , with FL the liquid state free energy that\ndoes not depend on Q(k), and F > Fc . The inequality Fc 6= F can occur if and only if the states\nleading to Eqs.(5) and (6) are metastable and there are an infinite number of such states. Since\nF > Fc (see KT for additional discussions), it follows that at TA the liquid, within our mean-field\nlike approximations, freezes into a metastable glass that is stabilized by an exponentially large\nsolution degeneracy, i.e., there is a complexity, or state entropy associated with the states below\nTA . Mathematically this entropy, Ss , is defined by,\nT Ss = F − Fc .\n\n(9)\n\nNote that within our approximate calculations Fc is not a physically meaningful free energy\nbecause it contains an entropic term that is a measure of states not probed in the time scales\nin which our calculations are valid.\nIn Section V we argue that TA , is not the glass transition temperature. Rather, beacuse of\nthe appearance of many glassy states, it is the temperature below which activated dynamics play\nan important role and the dynamics become increasingly sluggish. There is a lower Kauzmann\ntemperature, TK , where the number of glassy states become nonextensive and where there is a\ntrue glass transition.\n\n7\n\n\fIV.\n\nDYNAMICAL THEORY OF THE GLASS TRANSITION\n\nThe dynamical theory of the SGT starts with Eqs. (1) and (2). We consider the density time\ncorrelation function,\nC(k,t)(2π)d δ(k + k′ ) =< δn(k,t)δn(k′ , 0) > .\n\n(10)\n\nThe glassy state is defined by frozen density fluctuations or by a non-zero Edwards-Anderson\norder parameter [7],\nq(k) = qEA (k) = lim C(k, t),\n\n(11)\n\nt→∞\n\nand we assume that the glassy state is statistically homogeneous and isotropic. The fact that\nthe glassy state has the same statistical properties as the liquid state is necessary to establish\nthe connection between the static and dynamic approaches to the SGT.\nTreating the nonlinear terms in Eq. (1) as small, the self-consistent one-loop approximation\nb\nfor C(k,ω),\nthe one sided Fourier transform of C(k,t),is,\nb ω) = C(k, t = 0)[−iω + ΓR (k, ω)]−1 ,\nC(k,\n\n(12)\n\nwith C(k,t = 0) = n0 S(k) the static structure factor and ΓR (k, ω) a renormalized kinetic\ncoefficient,\n\nZ Z ∞\n1\n2\n+ 2g3\ndt exp(−iωt)C(k − k1 ,t)C(k1 , t).\n(13)\n=\nΓ0 k 2\nk1 0\nEquations (12) and (13) are of a standard form of the equations derived in the so-called mode\nΓ−1\nR (k, ω)\n\ncoupling theory of the glass transition, although the conceptual origin of Eq.(13) is different\nthan in the original mode coupling theory. Equation (13) predicts a continuous slowing down of\ndensity fluctuations and a freezing at a temperature denoted by TA [2]. The equation of state\nfor the frozen density fluctuations is obtained by inserting Eq. (11) in Eqs. (12 and 13) and\nobtaining,\nq(k) = n0 S(k)\n\n2g32\n1+\n\nR\n\nq(k − k1 )q(k1 )\n\nk1\nR\n2\n2g3 k1\n\nq(k − k1 )q(k1 )\n\n.\n\n(14)\n\nIt is easy to show that Eq.(14) is identical to Eq. (6) if we identify q(k) with Q(k).\nTo summarize, this dynamical approach leads to a continuous freezing of density fluctuation\nand the frozen density fluctuations can be described by either a static theory, or by the dynamical\napproach. The static approach has the advantage that one can understand the freezing in terms\nof the number of states etc. The freezing temperature is denoted by TA because the selfconsistent dynamical approach clearly ignore activated dynamics, which dominate transport at\n8\n\n\flow temperatures. This is, in turn, consistent with the static approach where the freezing occurs\ninto metastable glassy states, which can only be precisely defined in some sort of mean-field limit\nwhere activated dynamical processes do not occur. In the next Section the temperature region\nT < TA is considered using non-perturbative scaling and droplet ideas.\n\nV.\n\nSCALING AND DROPLET CONSIDERATIONS\nA.\n\nActivated transitions, entropic droplets, and growing correlation length\n\nThe mean field theory based on precise calculations using a density functional Hamiltonian\nwithout quenched disorder shows that in the temperature range , TA < T < TK , the system is\nfrozen in one of the exponentially large number of metastable states. Flow from one of these\nstate (say α) to another (γ) cannot be described within the MFT because α and β are two\ndisjoint ergodic states. In order to account for the observed non-Arrhenius slowing down of\ntransport in glassy systems, which is often captured in terms of the Vogel-Fulcher equation,\nτ (T ) = τ0 exp[\n\nDT\n]\n(T − TK )\n\n(15)\n\nKirkpatrick, Thirumalai, and Wolynes [5] (KTW) introduced a new scaling theory based on\nentropic driving forces, which were argued to be relevant for transport [12]. In Eq. (15) τ0 is a\nmicroscopic relaxation time at TA and D is a positive constant. It follows from the KT theory\ndescribed in Sections III and IV it that the emergence of multiple metastable minima below TA\ncan be quantified in terms of the state entropy Ss , which is the difference between the canonical\nand component averaged free energies. In the droplet picture of activated transitions it is Ss ,\nwhich is distinct from the configurational entropy in the Adam-Gibbs theory [25] (for a detailed\ndiscussion see [5]), is the driving force for activated transition. Consider a region in a glassy\nstate of size Ld and let us estimate the probability of nucleating another glassy state inside Ld .\nThe driving force for being able nucleate a glassy state one inside the other has to be entropic\nbecause the various glassy states have roughly the same free energy. Because there are a vast\nnumber of accessible (on a long time scale) glassy states such an entropically driven nucleation\nis possible. Within the droplet picture the driving force for nucleation is ∼ T ss Ld where ss is\nthe state entropy per unit volume. The formation of domain within a domain is opposed by\n9\n\n\fsurface free energy cost, which can scale at most as σL(d−1) where σ is the surface tension (see\nbelow for a careful treatment of the scale-dependence of the surface tension between two distinct\nglassy domains). Balancing these two free energies gives the typical size of the glassy cluster\nL∗ ∼\n\nσT\nss\n\nand the barrier to activated transport is ∆F ∗ ∼ ( σT\n)(d−1) . We see that the entropic\nss\n\ndroplet theory naturally follows from considering the ramifications of the mean-field theory for\nfinite dimensional systems.\nThe natural generalization of the MFT to describe activated transitions is to assume that\nflow below TA is triggered by creation and destruction of mosaic states within a large glassy\ncluster whose size ξ ∼ t−ν (t =\n\n(T −TK )\n)\nTK\n\ndiverges at TK . The entropic droplet picture, that\n\nwas inspired by the MFT and fluctuation theory [5], has been used to show ν = d2 . The time\nscale associated with these processes increases as the temperature decreases below TA eventually\ndiverging at TK as described in Eq. (15). As long as the size of the glassy domain is large then\nthe entropic driving forces are opposed by surface free energy cost that scales as\nFopposing ≈ γLθ\nwhere θ ≤\n\nd\n2\n\n(16)\n\nif ν = d2 . In terms of ss or equivalently t (assuming ss varies linearly with T close\n\nto TK ) the entropic driving force for activated transitions is\nFdriving ∼ −At−(νd−1) .\n\n(17)\n\nSimiliarly, Fopposing ∼ γt−νθ . The instability of the droplets at large length scale requires that\nthe exponent characterizing the growth of the surface free energy be bounded by θ ≤\n\n(νd−1)\n.\nν\n\nThese considerations can be used to describe the temperature-dependent relaxation time near\n2\n\nTK . If the typical size of the glassy cluster grows as L ∼ ξ ∼ t−ν ∼ t− d then the typical free\nenergy barrier behaves as\n∆F ∗ ∼ t−(νd−1) ∼ t−1\n\n(18)\n\nwhich immediately results in the Vogel-Fulcher law (Eq. (15)). Notice in order to obtain the\nVogel-Fulcher equation the free energy cost opposing activated transport must scale as\nd\n\nFopposing ∼ γL 2\n\n(19)\n\nA more refined treatment that relies on a generalization of Villain's conjectures [26] for the\nRandom Field Ising Model indeed shows that a scale-dependent surface tension which vanishes\n10\n\n\fon length scales greater than ξ shows that Eq. (19) is indeed obeyed in the vicinity of TK\n[5]. Although the KTW scaling picture offers a consistent picture of activated transport that is\nwholly inspired by the precise theory described in [4], it still remains heuristic.\n\nB.\n\nViolation of Law of Large Numbers, Dynamical Heterogeneity, and loss of\n\nergodicity\nThe precise connection between the static and dynamical description of the glass transition\nmade using the DFT (see Sections III and IV), which requires the existence of an exponentially\nlarge number of metastable states below TA , has been demonstrated by taking long time limits of\nthe order parameter C(k, t). The long time (or more precisely on t ≥ τc where τc is a correlation\ntime) limit of C(k, t) is zero in a liquid but persists in glasses. In other words, only when the\nsystem develops in time is there an obvious difference between liquids and glasses. In a liquid\na given molecule diffuses arbitrarily far from where it started as t grows whereas it is localized\nin space to a small region. The DFT calculations show that the dynamical treatment and the\nstatic treatments give rise to identical physical picture that is manifested by the appearance\nof a non-zero glassy state Edwards-Anderson order parameter. Thus, within the framework of\nRFOPT it is only by examining the link between spatial and time correlations can the distinction\nbetween liquids and glasses be made.\nAs argued in the previous section it is fruitful to picture a glass as being partitioned into\nmosaic states whose characteristic temperature-dependent size is denoted by ξi (T ) where for the\nsake of generality we consider variations in the sizes of the glassy clusters. Within the ξi (T )\nstructural rearrangements can be rapid but global relaxation requires activated transitions,\nwhich involves nucleating new domains. Slow structural fluctuations in glassy occurs because of\nentropic driving forces that enable creation and formation of new glassy clusters by fluctuation\neffects. As the degree of supercooling increases not only does ξi (T ) grow but also the relaxation\ntime associated with particles that cross domain boundaries exceeds the observation time scale\n(τobs ), thus leading to broken ergodicity. These physical considerations that are embedded in\nthe droplet picture of the RFOPT also lead to violation of law of large numbers as the STG\noccurs, which we illustrate by using the following arguments. Just as in the scaling theory,\n) 3\nwe picture the glassy phase as being partitioned into regions with size ≈ ξi (T ) with ( ξi (T\n)\na\n\n11\n\n\fbeing sufficiently large that meaningful average over the number of particle within ξi (T ) can be\ncarried out. In the liquid phase (T > TA ) the statistical properties of the liquid (for example\nthe distribution of energies of the particles in a glass forming system P (ǫ; t|ξi (T )) in the sub\nsample is independent of i and will coincide with that of the entire sample provided ξi (T ) is large\nenough and t > τc < τobs . This is a consequence of the law of large numbers. In contrast, in the\nglassy phase each ξi (T ), which in the MFT corresponds roughly to one of the frozen metastable\nstates, is distinct, and consequently each P (ǫ; t|ξi (T )) can be distinct and will depend on i.\nThus, no single sub sample can characterize the distribution of energies of the entire sample. In\nother words, in the glassy phase the law of large numbers is violated, and there are sub sample\nto sub sample fluctuations. Only by examining the entire sample on τobs > τ (T ) is ergodicity\nrestored. We see that the so called dynamical heterogeneity, which has been a characteristic of\nglass forming systems [27, 28, 29] is seen to be a consequence of the emergence of glassy clusters\nwith the characteristic sizes ξ(T ). Because of the variations in both equilibrium and relaxation\nproperties from sub sample to sub sample a glassy phase is inherently heterogeneous.\nThe preceding arguments were illustrated using simulations of soft-sphere binary mixtures in\nwhich the sample was divided into a number of sub samples [30]. In the liquid phase P (ǫ; t|ξi (T ))\ncoincides with the entire sample for all i as long as t > τc . In contrast there are considerable\nvariations in P (ǫ; t|ξi (T )) and are fragments of the entire sample. Thus, the dynamical heterogeneity is really a consequence of the law of large numbers, and very much supports the droplet\nscenario for activated transition set within the RFOPT context. A corollary of the violation\nof the law of large numbers is that particles of a specific type (say a large particle in a binary\nLJ mixture) belonging to two distinct subsamples are not \"statistically equivalent\" even when\nτobs ≫ τc . This is in contrast to the liquid phase where on t ≈ τc all particles of a given type are\nstatistically equivalent. Such a loss in statistical symmetry in the SGT is a time averaged property and can only be inferred by examining the time evolution of the system. The arguments\nand simulations reported by us [30] clearly showed that dynamical heterogeneity and broken\nergodicity naturally follow from violation of the law of large numbers.\nAnother consequence of the statistical inequivalence of any two subsamples (whose sizes are\non the order of a typical ξ(T )) in the glassy phase is that ergodicity is broken in the SGT. To\nillustrate the concept of ergodicity breaking we introduce a measure referred to as the energy\n\n12\n\n\fmetric, d(t), which is defined as\nNd(t) =\n\nN\nX\n\n[ǫi (t|Rα (t)) − ǫi (t|Rβ (t)]2\n\n(20)\n\ni=1\n\nwhere ǫi (t|Rα (t)) =\n\n1\nt\n\nRt\n0\n\ndsEi (s|Rα (t)). Here, Ei (s|Rα (t)) is the energy of the ith particle at\n\ntime s and Rα (t) refers to a set of positions of the particles whose initial condition is labeled α.\nSimilarly, ǫi (t|Rβ (t)) is the corresponding quantity for the trajectory β. If the system is ergodic\non the time scale τobs then d(t) vanishes as t → τobs , and therefore ǫi (τobs |Rβ (τobs )) = ǫi (t|Rβ (t))\nindependent of alpha or β. This is the situation that pertains to the liquid phase. However, if\nergodicity is broken, as is expected at the STG, d(t) ∼ C (C is a constant) suggesting that the\ntwo initial states do not mix on the time scale τobs . As argued above it is the development in\ntime rather than any equal time correlation functions that distinguishes a glass from a liquid.\nIt can be shown, using scaling-type arguments, that\n\nd(0)\nd(t)\n\n≈ DE t where the \"diffusion\" constant\n\n, which is\nDE is not unrelated to relaxation time set by the shear viscosity [31]. Thus, N d(0)\nd(t)\nextensive in N and τobs in the liquid phase, remains only extensive in N in the glassy phase\nbecause τ( T ) ≫ τobs . We demonstrated these ideas using molecular dynamics simulations of\ntwo component softly repelling spheres as well Lennard-Jones mixtures with additive diameters\nchosen to avoid crystallization. At temperatures that are greater than TA we showed that\n\nd(0)\nd(t)\n\ngrows linearly as t increases whereas it saturates in the glassy phase due to the inability to\nexplore distinct regions of the configuration space. The illustrations summarized here, which\nhave been demonstrated by others using different language, follow directly from the physical\npicture that in the SGT the glass forming system is frozen into one of many disjoint ergodic\nstates that do not mix (or become statistically equivalent) on τobs .\n\nVI.\n\nDISCUSSION\n\nThe fundamental goal of any theory of glass forming materials should be to explain both the\ndramatic viscosity increase and thermodynamic anamolies starting from a theory appropriate\nfor liquids. At the laboratory glass transition temperature Tg the relaxation times far exceed the\nobservation times and the heat capacity has a discontinuity suggesting that providing a kinetic\ndescription alone is insufficient. In addition, the goal of any theory of glasses must ultimately\n13\n\n\fbe described using quantities that can be measured in experiments. This perspective presents a\ncoherent theory that was advanced by us over twenty years ago, and which was guided by the\ngoals outlined above. The theory and its implications for activated transitions, violation of law\nof large numbers and the related dynamical heterogeneity, and ergodicity breaking treats both\nthe dynamical and static properties of glasses on equal footing. The major conceptual basis,\nwhich was discovered using a density functional description of glasses without quenched disorder,\nis that at T ≤ TA the system is frozen into one of many metastable states. In practical terms\nTA (> Tg ) corresponds to a temperature at which η ∼ (1-10) poise. Such states are described\nby frozen density fluctuations from which emerges an Edwards-Anderson order parameter can\nbe obtained from a purely static or a dynamical theory [4].\nThere are immediate consequences of the RFOPT of glass transition when applied to finite\ndimensions. Unlike in the mean field picture the metastable states are not disjoint and transport\nbecomes possible on time scales comparable to τ (T ), which of course, becomes exceedingly long\nas T decreases. In the temperature range TK < T < TA it is fruitful to think of glasses as being\ncomposed of a large number of mosaic states on scales on the order of ξ(T ). From this picture\nwe draw several significant conclusions.\n1. Transport in the temperature range, TK < T < TA , is driven by activated processes\nthe driving force for which are entropic in nature. Because the entropy vanishes linearly\nnear TK it follows from our picture that the size of the domains must grow as ξ ∼ (T −\n2\n\nTK )− d . The droplet theory [5], constructed by balancing the entropic driving force and\nthe opposing cost of creating an interface between two glassy states readily leads to the\nVogel-Fulcher equation (Eq. 15. It is useful to comment on the typical values of ξ(Tg )\nfound in practice, Computer simulations of LJ mixtures [32] and colloidal glasses composed\nof mixtures of micron size charged particles [33] conclude that t ∼ 0.6 which was used to\nshow that ξ(Tg ) ≈ 3σ where σ is the particle diameter. From the extracted values of\n2\n\nt ∼ 0.1 in several experiments [34] we predict using the t− d scaling that ξ(Tg ) ≈ 10σ [35].\nOn these length scales there are in excess of fifty particles so that the activation barrier\nfor transport is large enough that considerations from the scaling theory are appropriate.\n2. The partitioning of a glassy state into mosaic states with growing domain size suggests\nthat law of large numbers must be violated, especially at temperatures less than TA [30].\n14\n\n\fThis implies that, when observed over a period of time that exceeds τc but is comparable\nto τobs , any two mosaic states are statistically inequivalent. As a consequence, glass is\ndynamically heterogeneous which implies that the statistical properties (averaged over a\nperiod of time greater than τC ) vary from one mosaic state to another. This is not the case\nin a liquid. These expectations are borne out in computer simulations. The conceptual\nbasis of the origin of dynamic heterogeneity is intimately linked to the violation of law of\nlarge numbers [30].\n3. Because of the statistical inequivalence of mosaic states on time scales comparable to\nτobs ergodicity is broken in the STG. This is manifested in the ergodic measure, which\nis extensive in τobs in the liquid phase but becomes essentially independent of τobs in the\nglassy phase [30].\n\nACKNOWLEDGMENTS: We are grateful to grants from the National Science Foundation (DMR09-01907 and CHE09-14033) for support of this work.\n\n15\n\n\f[1] E. Leutheusser. Dynamical model of the liquid to glass transition. Phys. Rev. A., 29:2765, 1984.\n[2] W. Gotze and L. Sjogren. Relaxation processes in supercooled liquids. Rep. Prog. Phys., 55:241,\n1992.\n[3] T. R. Kirkpatrick. Mode-coupling theory of the glass transition. Phys. Rev. A, 31, 1985.\n[4] T. R. Kirkpatrick and D. Thirumalai. Random solutions from a regular density functional hamiltonian: a static and dynamical theory for the structural glass transition. J. Phys. A., 22:L149–L155,\n1989.\n[5] T. R. Kirkpatrick, D. Thirumalai, and P. G. Wolynes. Scaling concepts for the dynamics of viscous\nliquids near an ideal glassy state. Phys. Rev. A., 40:1045–1054, 1989.\n[6] G. H. Fredrickson and H. C. Andersen. Kinetic Ising model of the glass transition. Phys. Rev.\nLett., 53:1244, 1984.\n[7] S. F. Edwards and P. W. Anderson. Theory of spin glasses. J. Phys. F., 5:965, 1975.\n[8] D. Sherrington and S. Kirkpatrick. Solvable model of a spin glass. Phys. Rev. Lett., 35:1792, 1975.\n[9] M. Mezard, G. Parisi, and M. A. Virasaro. Spin Glass Theory and Beyond. World Scientific, 1997.\n[10] T. R. Kirkpatrick and D. Thirumalai. Dynamics of the structural glass transition and the p-spininteraction spin-glass model. Phys. Rev. Lett., 58:2091–2094, 1987.\n[11] T. R. Kirkpatrick and D. Thirumalai. p-Spin-interaction spin-glass models-connections with the\nstructural glass problem. Phys. Rev. B., 36:5388–5397, 1987.\n[12] T. R. Kirkpatrick and P. G. Wolynes. Stable and metastable states of mean-field Potts and\nstructural glasses. Phys. Rev. B., 36:8552–8564, 1987.\n[13] T. R. Kirkpatrick and P. G. Wolynes. Connections between some kinetic and equilibrium theories\nof the glass transition. Phys. Rev. A, 35:3072–3080, 1987.\n[14] J. Jackle. Models of the glass transition. Rep. Prog. Phys., 49:471, 1986.\n[15] L. M. Martinez and C. A. Angell. A thermodynamic connection to the fragility of glass forming\nliquids. Nature, 410:663–667, 2001.\n[16] C. A. Angell. Formation of glasses from liquids and biopolymers. Science, 267:1924–1935, 1995.\n[17] T. R. Kirkpatrick and D. Thirumalai. Are disordered spin glass models relevant for the structural\nglass problem? Trans. Theor. Stat. Phys., 24:927–945, 1995.\n[18] D. Thirumalai and T. R. Kirkpatrick. Mean Field Potts glass model - Initial condition effects on\ndynamics and properties of metastable states. Phys. Rev. B, 38:4881–4892, 1988.\n[19] L. F. Cugliandolo and J. Kurchan. Analytical solution of the off-equilibrium dynamics of a longrange off-equilibrium spin-glass model. Phys. Rev. Lett., 71:173–176, 1993.\n[20] L. F. Cugliandolo. Glassy dynamics and coarsening. PhysicaA, 386:597–602, 2007.\n[21] M. Mezard and G. Parisi. Glasses and replicas. Cond-mat, page 0910.2838v1, 2009.\n[22] S. Franz and J. Hertz. Glassy transition and aging in models without disorder. Phys. Rev. Lett.,\n74:2114–2117, 1995.\n[23] Y. Singh, J. P. Stoessel, and P. G. Wolynes. Hard-sphere glass and the density-funtional theory\nof aperiodic crystals. Phys. Rev. Lett., 54:1059–1062, 1985.\n[24] R. Monasson. Structural glass transition and the entropy of the metastable states. Phys. Rev.\nLett., 75:2847–2850, 1995.\n[25] G. Adam and J. H. Gibbs. On the temperature dependence of cooperative relaxation properties\nin glass-forming liquids. J. Chem. Phys., 43:139, 1965.\n\n16\n\n\f[26] J. Villain. Equilibrium properties of random field systems: new conjecture. J. Physique, 46:1843–\n1852, 1985.\n[27] H. Sillescu. Heterogeneity at the glass transition: a review. J. Bon-Cryst. Solids, 243:81–108,\n1999.\n[28] S. C. Glotzer. Spatially heterogeneous dynamics in liquids: insights from simulation. J. Non-Cryst.\nSolids, 274:342–355, 2000.\n[29] C. Donati, S. C. Glotzer, and P. H. Poole. Growing spatial correlations of particle displacements\nin a simulated liquid on cooling toward the glass transition. Phys. Rev. Lett., 82:5064–5067, 1999.\n[30] D. Thirumalai, R. D. Mountain, and T. R. Kirkpatrick. Ergodic behavior in supercooled liquids\nand in glasses. Phys. Rev. A, 39:3563–3574, 1989.\n[31] D. Thirumalai and R. D. Mountain. Activated dynamics, loss of ergodicity, and transport in\nsupercooled liquids. Phys. Rev. E, 47:479–489, 1993.\n[32] R. D. Mountain and D. Thirumalai. Ergodicity and activated dynamics in supercooled liquids.\nPhys. Rev. A, 45:R3380–R3383, 1992.\n[33] R. O. Rosenberg, D. Thirumalai, and R. D. Mountain. Liquid, crystalline, and glassy states of\nbinary charge colloidal suspensions. J. Phys. Cond. Matt., 1:2109–2114, 1989.\n[34] U. Mohanty. On the temperature dependence of relaxation in glass forming liquids. J. Chem.\nPhys., 93:8399–8400, 1990.\n[35] L. Berthier, G. Biroli, J. P. Bouchaud, L. Cipellett, D. El Masri, D. L'Hote, F. Ladieu, and\nM. Pierno. Direct experimental evidence of a growing length scale accompanying the glass transition. Science, 310:1797–1800, 2005.\n\n17\n\n\f"}