{"id": "http://arxiv.org/abs/1104.5166v1", "guidislink": true, "updated": "2011-04-27T15:40:23Z", "updated_parsed": [2011, 4, 27, 15, 40, 23, 2, 117, 0], "published": "2011-04-27T15:40:23Z", "published_parsed": [2011, 4, 27, 15, 40, 23, 2, 117, 0], "title": "On the Formation Height of the SDO/HMI Fe 6173 Doppler Signal", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1104.3829%2C1104.0821%2C1104.1431%2C1104.5566%2C1104.0480%2C1104.0446%2C1104.3147%2C1104.4747%2C1104.3777%2C1104.1080%2C1104.5560%2C1104.1037%2C1104.0457%2C1104.3181%2C1104.0981%2C1104.4052%2C1104.1152%2C1104.0645%2C1104.3042%2C1104.0608%2C1104.0539%2C1104.4581%2C1104.4497%2C1104.0370%2C1104.3761%2C1104.4392%2C1104.5224%2C1104.4388%2C1104.0794%2C1104.3387%2C1104.4951%2C1104.4502%2C1104.4767%2C1104.0602%2C1104.3890%2C1104.3814%2C1104.2530%2C1104.4789%2C1104.2142%2C1104.4162%2C1104.2808%2C1104.3094%2C1104.2765%2C1104.2596%2C1104.3006%2C1104.0223%2C1104.4987%2C1104.2341%2C1104.2411%2C1104.3534%2C1104.1666%2C1104.2109%2C1104.0975%2C1104.1859%2C1104.4479%2C1104.5166%2C1104.3267%2C1104.4850%2C1104.4975%2C1104.2975%2C1104.3816%2C1104.5392%2C1104.0216%2C1104.3059%2C1104.5524%2C1104.5043%2C1104.4782%2C1104.2689%2C1104.0904%2C1104.5145%2C1104.5330%2C1104.2497%2C1104.3710%2C1104.2256%2C1104.0399%2C1104.5012%2C1104.4089%2C1104.1328%2C1104.2413%2C1104.3127%2C1104.4216%2C1104.3444%2C1104.2569%2C1104.2288%2C1104.0633%2C1104.0060%2C1104.2123%2C1104.4908%2C1104.1458%2C1104.3666%2C1104.5612%2C1104.4547%2C1104.3105%2C1104.3891%2C1104.3315%2C1104.4008%2C1104.2946%2C1104.5150%2C1104.2267%2C1104.4840%2C1104.3716&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "On the Formation Height of the SDO/HMI Fe 6173 Doppler Signal"}, "summary": "The Helioseismic and Magnetic Imager (HMI) onboard the Solar Dynamics\nObservatory (SDO) is designed to study oscillations and the mag- netic field in\nthe solar photosphere. It observes the full solar disk in the Fe I absorption\nline at 6173\\AA . We use the output of a high-resolution 3D, time- dependent,\nradiation-hydrodynamic simulation based on the CO5BOLD code to calculate\nprofiles F({\\lambda},x,y,t) for the Fe I 6173{\\AA} line. The emerging profiles\nF({\\lambda},x,y,t) are multiplied by a representative set of HMI filter\ntransmission profiles R_i({\\lambda},1 \\leq i \\leq 6) and filtergrams\nI_i(x,y,t;1 \\leq i \\leq 6) are constructed for six wavelengths. Doppler\nvelocities V_HMI(x,y,t) are determined from these filtergrams using a\nsimplified version of the HMI pipeline. The Doppler velocities are correlated\nwith the original velocities in the simulated atmosphere. The cross-\ncorrelation peaks near 100 km, suggesting that the HMI Doppler velocity signal\nis formed rather low in the solar atmosphere. The same analysis is performed\nfor the SOHO/MDI Ni I line at 6768\\AA . The MDI Doppler signal is formed\nslightly higher at around 125 km. Taking into account the limited spatial\nresolution of the instruments, the apparent formation height of both the HMI\nand MDI Doppler signal increases by 40 to 50 km. We also study how\nuncertainties in the HMI filter-transmission profiles affect the calculated\nvelocities.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1104.3829%2C1104.0821%2C1104.1431%2C1104.5566%2C1104.0480%2C1104.0446%2C1104.3147%2C1104.4747%2C1104.3777%2C1104.1080%2C1104.5560%2C1104.1037%2C1104.0457%2C1104.3181%2C1104.0981%2C1104.4052%2C1104.1152%2C1104.0645%2C1104.3042%2C1104.0608%2C1104.0539%2C1104.4581%2C1104.4497%2C1104.0370%2C1104.3761%2C1104.4392%2C1104.5224%2C1104.4388%2C1104.0794%2C1104.3387%2C1104.4951%2C1104.4502%2C1104.4767%2C1104.0602%2C1104.3890%2C1104.3814%2C1104.2530%2C1104.4789%2C1104.2142%2C1104.4162%2C1104.2808%2C1104.3094%2C1104.2765%2C1104.2596%2C1104.3006%2C1104.0223%2C1104.4987%2C1104.2341%2C1104.2411%2C1104.3534%2C1104.1666%2C1104.2109%2C1104.0975%2C1104.1859%2C1104.4479%2C1104.5166%2C1104.3267%2C1104.4850%2C1104.4975%2C1104.2975%2C1104.3816%2C1104.5392%2C1104.0216%2C1104.3059%2C1104.5524%2C1104.5043%2C1104.4782%2C1104.2689%2C1104.0904%2C1104.5145%2C1104.5330%2C1104.2497%2C1104.3710%2C1104.2256%2C1104.0399%2C1104.5012%2C1104.4089%2C1104.1328%2C1104.2413%2C1104.3127%2C1104.4216%2C1104.3444%2C1104.2569%2C1104.2288%2C1104.0633%2C1104.0060%2C1104.2123%2C1104.4908%2C1104.1458%2C1104.3666%2C1104.5612%2C1104.4547%2C1104.3105%2C1104.3891%2C1104.3315%2C1104.4008%2C1104.2946%2C1104.5150%2C1104.2267%2C1104.4840%2C1104.3716&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The Helioseismic and Magnetic Imager (HMI) onboard the Solar Dynamics\nObservatory (SDO) is designed to study oscillations and the mag- netic field in\nthe solar photosphere. It observes the full solar disk in the Fe I absorption\nline at 6173\\AA . We use the output of a high-resolution 3D, time- dependent,\nradiation-hydrodynamic simulation based on the CO5BOLD code to calculate\nprofiles F({\\lambda},x,y,t) for the Fe I 6173{\\AA} line. The emerging profiles\nF({\\lambda},x,y,t) are multiplied by a representative set of HMI filter\ntransmission profiles R_i({\\lambda},1 \\leq i \\leq 6) and filtergrams\nI_i(x,y,t;1 \\leq i \\leq 6) are constructed for six wavelengths. Doppler\nvelocities V_HMI(x,y,t) are determined from these filtergrams using a\nsimplified version of the HMI pipeline. The Doppler velocities are correlated\nwith the original velocities in the simulated atmosphere. The cross-\ncorrelation peaks near 100 km, suggesting that the HMI Doppler velocity signal\nis formed rather low in the solar atmosphere. The same analysis is performed\nfor the SOHO/MDI Ni I line at 6768\\AA . The MDI Doppler signal is formed\nslightly higher at around 125 km. Taking into account the limited spatial\nresolution of the instruments, the apparent formation height of both the HMI\nand MDI Doppler signal increases by 40 to 50 km. We also study how\nuncertainties in the HMI filter-transmission profiles affect the calculated\nvelocities."}, "authors": ["Bernhard Fleck", "Sebastien Couvidat", "Thomas Straus"], "author_detail": {"name": "Thomas Straus"}, "author": "Thomas Straus", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1007/s11207-011-9783-9", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1104.5166v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1104.5166v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "15 pages, 11 Figures", "arxiv_primary_category": {"term": "astro-ph.SR", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph.SR", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1104.5166v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1104.5166v1", "journal_reference": null, "doi": "10.1007/s11207-011-9783-9", "fulltext": "accepted for publication in Solar Physics\n27 April 2011\n\nOn the Formation Height of the SDO/HMI Fe 6173 Å\nDoppler Signal\nB. Fleck1 * S. Couvidat2 * T. Straus3\n\narXiv:1104.5166v1 [astro-ph.SR] 27 Apr 2011\n\nto appear in Solar Physics 2011\n\nAbstract The Helioseismic and Magnetic Imager (HMI) onboard the Solar\nDynamics Observatory (SDO) is designed to study oscillations and the magnetic field in the solar photosphere. It observes the full solar disk in the Fe i\nabsorption line at 6173 Å. We use the output of a high-resolution 3D, timedependent, radiation-hydrodynamic simulation based on the CO5 BOLD code to\ncalculate profiles F (λ, x, y, t) for the Fe i 6173 Å line. The emerging profiles\nF (λ, x, y, t) are multiplied by a representative set of HMI filter transmission\nprofiles Ri (λ, 1 ≤ i ≤ 6) and filtergrams Ii (x, y, t; 1 ≤ i ≤ 6) are constructed\nfor six wavelengths. Doppler velocities VHMI (x, y, t) are determined from these\nfiltergrams using a simplified version of the HMI pipeline. The Doppler velocities\nare correlated with the original velocities in the simulated atmosphere. The crosscorrelation peaks near 100 km, suggesting that the HMI Doppler velocity signal\nis formed rather low in the solar atmosphere. The same analysis is performed for\nthe SOHO/MDI Ni i line at 6768 Å. The MDI Doppler signal is formed slightly\nhigher at around 125 km. Taking into account the limited spatial resolution of the\ninstruments, the apparent formation height of both the HMI and MDI Doppler\nsignal increases by 40 to 50 km. We also study how uncertainties in the HMI\nfilter-transmission profiles affect the calculated velocities.\nKeywords: Sun, photosphere, oscillations, line formation\n\n1. Introduction\nThe Helioseismic and Magnetic Imager (HMI: Schou et al., 2011) onboard the\nSolar Dynamics Observatory observes the full solar disk in the Fe i absorption\nline at 6173 Å to measure oscillations and the magnetic field in the solar photosphere. The oscillation measurements are used for helioseismic studies of the\nsolar interior, the magnetic-field measurements for studies of solar activity.\n1 ESA Science Operations Department, c/o NASA/GSFC,\nGreenbelt, MD, USA email: bfleck@esa.nascom.nasa.gov\n2 W.W. Hansen Experimental Physics Laboratory, Stanford\nUniversity, Stanford, CA, USA email: couvidat@stanford.edu\n3 INAF Osservatorio Astronomico di Capodimonte, Via\nMoiariello 16, 80131 Napoli, Italy email: straus@oacn.inaf.it\n\naccepted for publication in Solar Physics: 27 April 2011; p. 1\n\n\fB. Fleck et al.\n\nHMI supersedes the Michelson Doppler Imager (MDI: Scherrer et al., 1995)\nonboard the Solar and Heliospheric Observatory (SOHO: Domingo et al., 1996),\nwhich had a similar design and observing strategy. HMI offers significantly improved spatial resolution (4k × 4k detectors vs. a 1k × 1k detector on MDI),\nincreased image cadence (45 vs. 60 seconds on MDI), full Stokes capabilities\n(MDI measured only the longitudinal component, or Stokes V), and all observables are transmitted to the ground without any further onboard processing,\nwhich allows for a much better correction of instrumental effects than would be\npossible with more limited on-board resources. Another significant change is the\nuse of a different spectral line. While MDI observed the Ni i 6768 Å line, which\nis also used by the GONG project, for HMI the Fe i line at 6173 Å was selected.\nThe reason for this switch is that the Fe i line is magnetically more sensitive and\noffers better performance for vector magnetic-field measurements than the Ni i\nline (Norton et al., 2006).\nThe Fe i 6173 line has been used extensively in solar magnetometry (e.g. Baur\net al., 1980; Muller et al., 2000; Bello González et al., 2008, 2009). Its formation\nprocess has been studied by e.g. Bruls et al. (1990), Norton et al. (2006), and\nBello González et al. (2009). Bruls et al. (1990) quote 276 km and 238 km for the\nformation height of the line core in the VAL-C atmosphere in LTE and NLTE,\nrespectively. Norton et al. (2006) found a slightly higher value of 302 km for\nthe NLTE formation height of the line core in their calculations, which were\nalso performed for the VAL-C atmosphere. Bello González et al. (2009) present\nvelocity response functions, which show a broad maximum between 200 and 300\nkm for the line core and a maximum around 120 km for the center of gravity of\nthe Fe 6173 line.\nThe HMI Doppler signal is not a measure of the Doppler core velocity. It is\ndetermined from a combination of six filtergrams taken around the Fe 6173 Å\nline. An atlas profile of the Fe 6173 line together with representative transmission\nprofiles of the six HMI filters is shown in Figure 1. The nominal HMI filter\nbandwith is 76 mÅ and the nominal tuning range 680 mÅ. This is accomplished\nwith a set of successively narrower bandpass filters, consisting of a front window, a broadband blocking filter, a five-element Lyot filter and two Michelson\ninterferometers.\nThe aim of this study is to determine the formation height of the HMI Doppler\nsignal, which is important for many science questions. Spectral lines are of course\nnot formed in a narrow, static layer, but over a broad, highly variable range as\nthe overshooting convection and p modes push the atmosphere around. The term\n\"formation height\" should therefore be understood as a broad average, not as a\nsharply defined geometrical height in a 1D, plane-parallel atmosphere.\n\n2. 3D Model Atmosphere and Line Synthesis\nWe study the formation of the HMI Doppler signal with the help of 3D timedependent radiation-hydrodynamic simulations which provide a realistic description of the region of the solar atmosphere where the Fe 6173 Å line (and the Ni\n6768 Å line observed by MDI) are formed. The numerical simulation of the Sun's\n\naccepted for publication in Solar Physics: 27 April 2011; p. 2\n\n\fOn the Formation Height of the SDO/HMI Doppler Signal\n\nFigure 1. Atlas profile of Fe 6173 Å and six representative HMI filter transmission profiles.\n\nsurface layers was computed with the radiation hydrodynamics code CO5 BOLD\n(Freytag et al., 2002; Wedemeyer et al., 2004). For a detailed documentation\nsee http://www.astro.uu.se/∼bf/co5bold main.html. CO5 BOLD solves the coupled\nnon-linear equations of compressible hydrodynamics in an external gravity field\ntogether with the non-local radiative energy transport for a small fraction of the\nsolar surface layers. A pre-tabulated equation of state, accounting for partial ionization and molecule formation, provides all necessary thermodynamic variables.\nThe radiative transport is treated using realistic opacities adapted from a recent\nversion of the MARCS stellar atmosphere package (Plez et al., 1992; Asplund et\nal., 1997; Gustafsson et al., 2003). The simulation used in this study differs from\nthe one used by Straus et al. (2008) in two aspects: increased spatial resolution\n(both horizontal and vertical) and improved treatment of radiative transport.\nCompared to the simulation of Straus et al. (2008), the present simulation has\nfour times better horizontal resolution, three times better vertical resolution,\nand non-grey radiative transport treated in 12 frequency bands. To limit the\namount of required core memory and time necessary to run the simulation, the\nhorizontal box size was cut in half and the depth was also reduced. The simulated\ndomain is defined by a fixed 3D Cartesian grid with 400 × 400 × 300 cells, each\nof size 14 km × 14 km × 7.5 km. The simulation thus covers a horizontal area\nof 5.6 × 5.6 Mm. Periodic lateral boundaries are used. The transmitting upper\nboundary is located at a height of approximately 900 km above the visible solar\nsurface, while the open lower boundary lies 1.4 Mm below the surface. The part\nof the simulation that we use has completely relaxed and covers approximately\n\naccepted for publication in Solar Physics: 27 April 2011; p. 3\n\n\fB. Fleck et al.\nTable 1. Atomic parameters used for the line synthesis.\nFe 6173\n\nNi 6768\n\nlog A\nW\n\n7.52\n55.837\n\n6.30\n58.69\n\nEL [eV]\nχI [eV]\ngL\ngU\n\n2.2227\n7.870\n3\n1\n\n1.826\n7.635\n1\n3\n\n6173.3352\n-3.067\n2.042 × 109\n3.226 × 10−8\n\n6767.770\n-2.391\n1.0304 × 108\n8.276 × 10−8\n\nelement parametersa\n\nenergy level parameters\n\ntransition parametersb\nλ0 [Å]\nlog gf c\nΓr [rad s−1 ]\nΓ5 [rad s−1 cm3 ]c,d\na\n\nPartition functions are interpolated following Allen (1976); b Stark broadening is\nignored; c adapted values; d defined by ΓvdW = Γ5 (T /5000)0.4 NHt , where NHt is\nthe total hydrogen number density.\n\ntwo hours of solar time with snapshots saved every ten seconds. The code was\nexecuted on a 32-core node of an IBM-SP6 supercomputer and approximately\nthree hours were necessary to advance ten seconds of solar time.\nA line-synthesis code, based on the assumption of local thermodynamic equilibrium (LTE) and written in IDL, was then fed with the physical parameters of\na simulation snapshot to produce synthetic, two-dimensional spectra of several\nphotospheric lines, including those of Fe i 6173 Å and Ni i 6768 Å. The atomic\nline parameters used are listed in Table 1. The oscillator strength and van der\nWaals coefficient were adapted in order to match the spatial mean spectrum\nto a solar atlas profile. Synthetic spectra were then calculated for all snapshots\nwith this adapted parameter set. Using the recently published value of the iron\nabundance by Caffau et al. (2011), we had to reduce the oscillator strength\nby approximately 35% with respect to the value given in the VALD database\n(Kupka et al., 1999). Our description of the van der Waals broadening uses\nthe modified exponent of 0.4 of the temperature dependence (Gomez et al.,\n1987). The value of Γ5 in Table 1 is approximately a factor two larger than\none would get by translating the parameter given in Barklem et al. (2000) to\nour reference temperature. While such modifications are not uncommon in linesynthesis calculations, it is interesting to note that they are still necessary in a\n3D simulation with such high spatial resolution. To understand the exact reason\nfor this is not the goal of this work and difficult to resolve with only a single\nprofile fit, but both direction and amount of the corrections seem compatible\nwith the limits of the treatment in LTE and the uncertainties of the parameters.\nThe main goal of this work is, instead, to determine the formation height of the\nHMI velocity signal in a realistic solar atmosphere, which is not a plane-parallel\natmosphere but a highly corrugated surface. The line contribution functions,\nwhich were stored as a by-product of the line-synthesis calculations, give a quan-\n\naccepted for publication in Solar Physics: 27 April 2011; p. 4\n\n\fOn the Formation Height of the SDO/HMI Doppler Signal\n\nContribution Function (normalized)\n\ntitative idea of the size of this effect. Figure 2 shows the spatio-temporal averages\nof the intensity contribution functions of the line cores (at the wavelength of\nminimum intensity) of Fe i 6173 Å and Ni i 6768 Å, and Figure 3 shows x–\nt diagrams of the height variations of the center-of-gravity of the contribution\nfunctions of these two lines. Figure 2 suggests that on average the cores of\nFe 6173 and Ni 6768 are formed around 250 km and 300 km, respectively, in\nagreement with Bruls et al. (1990) and Norton et al. (2006). However, as can\nbe seen in Figure 3, there are large spatio-temporal variations of more than\n±150 km (i.e. several pressure scale heights). The formation height of the core\nof Fe 6173 varies between approximately 100 and 400 km, and that of Ni 6717\nbetween approximately 150 and 450 km. It is important to keep this in mind\nwhen talking about a \"formation height\".\n\n1.0\nFe 6173\nNi 6768\n\n0.8\n0.6\n0.4\n0.2\n0.0\n-100\n\n0\n\n100\n\n200\n300\nz / km\n\n400\n\n500\n\n600\n\nFigure 2. Average intensity contribution functions of the line cores of Fe i 6173 Å and Ni i\n6768 Å.\n\n3. Formation Height of the HMI Doppler Signal\nIn the following analysis we use only a 1D (slit) cut through the 3D simulations. We multiplied the line profiles F (λ, x, t) of the Fe i 6173 Å line calculated\nin the model atmosphere with a representative set of HMI filter transmission\nprofiles Ri (λ, 1 ≤ i ≤ P\n6) and summed those products to construct filtergrams\nIi (x, t; 1 ≤ i ≤ 6) = λ F (λ, x, t)Ri (λ). In addition we determined\nthe first\nR\nmoment\n(center\nof\ngravity)\nof\nthe\nline\nprofiles\nV\n(x,\nt)\n=\nλ\nF\n(λ,\nx,\nt) dλ /\ncg\nλ\nR\nF\n(λ,\nx,\nt)\ndλ\nas\nwell\nas\nthe\nDoppler\nshift\nof\nthe\nline\ncore\n(V\n(x,\nt))\nby decore\nλ\ntermining the position of a fourth-order polynomial fitted to a range of ±32 mÅ\naround the minimum position. From the filtergrams Ii (x, t; 1 ≤ i ≤ 6) we\ndetermined Doppler velocities VHMI (x, t) using a simplified version of the HMI\n\naccepted for publication in Solar Physics: 27 April 2011; p. 5\n\n\fB. Fleck et al.\n400\n\n100\n\n350\n\n300\n\nTime / min\n\nTime / min\n\n80\n\n60\n\n250\n\n450\n\n100\n\n400\n\n80\n\n350\n\n60\n\n300\n\n40\n\n200\n\n40\n\n250\n\n20\n\n150\n\n20\n\n200\n\n100\n\n0\n\n0\n0\n\n1\n\n2\n\n3\nx / Mm\n\n4\n\n5\n\n150\n0\n\n1\n\n2\n\n3\nx / Mm\n\n4\n\n5\n\nFigure 3. x–t diagrams of the height variations (center-of-gravity) of the line core intensity\ncontribution functions of Fe i 6173 Å (left) and Ni i 6768 Å (right). The grayscale varies\nbetween 100 and 400 km for Fe 6173, and between 150 and 450 km for Ni 6768.\n\nobservables-calculation pipeline, which comprises two steps: First, the phase of\nthe first Fourier coefficient of the Fe i line calculated from the six HMI intensities\nis computed, which yields an estimate of the Doppler velocity (\"uncorrected\nvelocity\"): v = k × phase, where k is a constant. In a second step, \"corrected\"\nvelocities are determined using a look-up table, which is based on the HMI\nfilter-transmission profiles and an average Fe i 6173 Å line profile (for details see\nCouvidat et al., 2011).\nFigure 4 shows an x–t diagram of the HMI Doppler velocities (left) and for\ncomparison the actual vertical velocities in the simulation at a height of z =\n105 km (right). The corresponding x–t diagram of the center of gravity Doppler\nshifts Vcg (x, t) (not shown here) is practically indistinguishable from that of the\nHMI Doppler velocities. This good correspondence is also reflected by the very\nhigh correlation (Pearson linear correlation coefficient = 0.9991) between VHMI\nand Vcg . While the HMI Doppler shifts capture the spatio-temporal variations\nof the actual velocities very well, the contrast is significantly (24%) reduced:\nRMS(VHMI ) = 1195 m s−1 vs RMS(V105 km ) = 1565 m s−1 . The RMS of Vcg is\n1254 m s−1 , i.e. similarly reduced.\nGiven the high correlation between VHMI and Vcg , we believe that this reduction is mainly an atmospheric modulation transfer function effect, which\ncauses all perturbations that are not coherent over the height interval where\n\naccepted for publication in Solar Physics: 27 April 2011; p. 6\n\n\fOn the Formation Height of the SDO/HMI Doppler Signal\n3000\n\n100\n\n2000\n\nTime / min\n\n0\n60\n\nTime / min\n\n1000\n\n80\n\n3000\n\n100\n\n2000\n\n1000\n\n80\n\n0\n60\n\n-1000\n40\n\n-1000\n40\n\n-2000\n\n20\n\n-2000\n\n20\n-3000\n\n0\n\n-4000\n0\n\n1\n\n2\n\n3\nx / Mm\n\n4\n\n5\n\n-3000\n\n0\n\n-4000\n0\n\n1\n\n2\n\n3\nx / Mm\n\n4\n\n5\n\nFigure 4. x–t diagrams of VHMI (x, t) (left) and the actual velocities in the simulation at z =\n105 km (right). Both have the same scaling (−4000 m s−1 ≤ V ≤ 3000 m s−1 ).\n\nthe signal is formed (e.g. high-frequency acoustic waves) to be smeared out and\ntheir amplitude reduced in the recovered Doppler signal. Another (although we\nbelieve minor) cause could be intrinsic calibration errors introduced through\nthe correction with the look-up table. There are two issues: i) The RMS could\nbe reduced because the slope of the look-up table is not correct and therefore,\nfor a given phase of the first Fourier coefficient, the table returns too small a\nvelocity. The slope could be incorrect because the average Fe i profile used to\nbuild the table is systematically different (i.e. broader and shallower) than the\nactual line profiles at a given pixel. ii) The look-up table is built using an average\nline profile and under the assumption that the only impact of a perturbation in\nthe atmosphere is to shift the line in wavelength, without changing its shape.\nThis, of course, is not the case, as the thermodynamic perturbations in the\natmosphere do not just cause a Doppler shift, but also affect the width, depth,\nand asymmetry of the individual line profiles.\nTo determine the formation height of the HMI Doppler signal, we calculated\nnormalized cross-correlations CC(z) between VHMI and the actual velocities\nV (z). The results are shown in Figure 5, together with the corresponding crosscorrelation functions between Vcg and V (z), and Vcore and V (z). The crosscorrelation function between VHMI and V (z) is very similar to that between\nVcg and V (z), confirming the excellent correspondence between VHMI and Vcg .\nThis is perhaps not surprising, as the six HMI filters sample the whole line\n\naccepted for publication in Solar Physics: 27 April 2011; p. 7\n\n\fB. Fleck et al.\n\n1.0\n\nVHMI\nVcg\nVcore\n\nCross-correlation\n\n0.8\n\n0.6\n\n0.4\n\n0.2\n0.0\n-100\n\n0\n\n100\n\n200\n300\nz / km\n\n400\n\n500\n\n600\n\nFigure 5. Cross-correlations between VHMI , Vcg , Vcore and the actual velocities V (z) as a\nfunction of height in the model atmosphere.\n\nprofile, including the upper wings reaching into the continuum. VHMI peaks near\n100 km, Vcg slightly below, in good agreement with the velocity-response function\ncalculated for the center of gravity of Fe 6173 Å by Bello González et al. (2009).\nTherefore, one can conclude that the HMI Doppler signal is a very good measure\nfor the center of gravity of the Fe 6173 Å line, and is formed around 100 km, i.e.\nrather low in the solar atmosphere.\nThe cross-correlation function between Vcore and V (z) peaks near 230 km,\nslightly below the values given by Norton et al. (2006), but in good agreement\nwith the NLTE value given by Bruls et al. (1990). The height of the maximum\nof the cross-correlation function between Vcore and V (z) is sensitive to the wavelength range used for the polynomial fit. Extending that range from ±32 mÅ to\n±56 mÅ reduces the height of the maximum of the cross-correlation function to\nbelow 200 km. The reason for this is that by increasing the wavelength range the\npolynomials fitted extend into the line wings, which are formed deeper in the\natmosphere. The highest layers in the atmosphere are probed only by a rather\nnarrow wavelength range around the line core.\n\n4. Effects of Calibration Errors\nThe HMI filter transmission profiles are believed to be known with an accuracy of\nthe order of 1% (J. Schou, private communication). To obtain some insight into\nthe effects of possible calibration errors on the measured velocities, we multiplied\nthe blue (red) transmission profiles with a factor 1.01 (0.99), calculated new HMI\nintensities and from those determined new velocities using the same (unchanged)\nlook-up tables as for the original velocities. That way we simulate unknown\n\naccepted for publication in Solar Physics: 27 April 2011; p. 8\n\n\fOn the Formation Height of the SDO/HMI Doppler Signal\n\nchanges of the transmission profiles that the pipeline process cannot account\nfor. The same is repeated for assumed transmission profile errors of 0.3% and\n0.1%. The results are shown in Figure 6.\n\nFigure 6. Differences between HMI Doppler shifts determined using the original filter transmission profiles and profiles that were modified by 1% (upper left), 0.3% (upper right), and\n0.1% (lower row). Only every fifth point is shown for clarity.\n\nThe errors are not symmetric with respect to zero velocity and show a small\nvelocity dependence. This is mainly due to the asymmetric error introduced,\nalthough the intrinsic asymmetry of the lines and the fact that the filters are\nnot symmetric around zero wavelength might also play a role. For the case\nof a 1% (0.3%) [0.1%] change of the filter transmission profiles, the average\noffset introduced is about 170 m s−1 (60 m s−1 ) [17 m s−1 ], the RMS of the errors\nabout 48 m s−1 (17 m s−1 ) [5 m s−1 ]. We should emphasize, though, that these\nare worst case figures, since the actual HMI reduction pipeline comprises a third\ncorrection step, which makes use of the orbital velocity OBS VR of SDO, which\nis known to great accuracy. The difference, as a function of OBS VR, between\nthis orbital velocity and the Doppler velocity averaged over the solar disk is\nfitted daily by a third-order polynomial. This polynomial is then used to correct\nthe Dopplergrams and line-of-sight magnetograms.\nThere are many possible sources of errors in the filter-transmission profiles.\nWith above analysis only a single one is tested: a possible small error of the\ncentering of the non-tunable part of the transmission profile of HMI, caused,\ne.g., by a de-centering of the blocking-filter transmission profile or an error in\nthe phase of one of the Lyot elements. While a de-centering of the non-tunable\npart of the transmission profile is believed to be one of the largest possible error\n\naccepted for publication in Solar Physics: 27 April 2011; p. 9\n\n\fB. Fleck et al.\nTable 2. Random errors (in %) applied to the six HMI filter-response functions and\nresulting Doppler velocity offset and RMS errors (in m s−1 ).\n\nCase 1\nCase 2\nCase 3\n\n1\n\n2\n\n3\n\n4\n\n5\n\n6\n\n0.76\n-0.88\n-0.25\n\n-0.59\n-0.96\n0.44\n\n-0.37\n0.41\n-0.35\n\n-0.025\n-0.47\n0.22\n\n0.54\n0.17\n-0.45\n\n0.96\n0.34\n-0.46\n\nOffset\n[m s−1 ]\n-59\n-68\n35\n\nRMS\n[m s−1 ]\n30\n22\n10\n\nFigure 7. Differences between HMI Doppler shifts determined using the original filter transmission profiles and profiles that were modified by applying random errors of ±1% to the six\nHMI filters (cf. Table 4 for details).\n\nsources, there are others that appear more like random errors. To gain some\nfurther insight, we have therefore studied the effects of randomly distributed\nerrors by multiplying the six HMI filters with factors (1 + \u000fi ), with \u000fi (1 ≤ i ≤ 6)\nbeing random numbers between -0.01 and +0.01 (cf. Table 4). The results are\nshown Figure 7. The offset for the three (random) cases varies between -65\nand +35 m s−1 and the RMS error between 10 and 30 m s−1 . The slopes of the\nvelocity errors are very different for the three cases, and even change sign. This\ndemonstrates that the asymmetry of the errors introduced for the tests leading\nto Figure 6 is more important than the intrinsic asymmetry of the Fe line.\n\naccepted for publication in Solar Physics: 27 April 2011; p. 10\n\n\fOn the Formation Height of the SDO/HMI Doppler Signal\n\nFigure 8. Atlas profile of Ni 6768 Å and five representative MDI filter transmission profiles,\nfour of which are used for the velocity determination and one (in red) to measure the continuum\nintensity.\n\n5. Formation Height of the MDI Doppler Signal\nThe HMI instrument on SDO replaced the MDI instrument on SOHO, which\nhas recorded solar oscillations for over an entire solar cycle. The HMI instrument\nobserves in a different spectral line than MDI and uses more and narrower filter\nsettings. Therefore, it is reasonable to expect that the HMI and MDI Doppler\nsignals form at different heights in the solar atmosphere. Since the HMI and\nMDI series might be combined for solar-cycle related studies, it is of interest\nto know how large this difference is. Yurchyshyn and Wang (2001) adopted a\nformation height of 200 km for the MDI Doppler signal based on a study by Jones\n(1989), Straus et al. (2008) assumed 100 km, Wachter (2008) in his study on the\ninstrumental response function of filtergraph instruments obtained 180 km for\nthe MDI signal for the quiet-Sun reference model of Maltby et al. (1986), and\nothers simply use the Ni 6768 Å core formation height of 300 km. To clarify this\nissue and get a better idea of the formation height of the MDI Doppler signal,\nwe repeated the procedure as described in Section 3 for the Ni i 6768 Å line\nand the theoretical MDI filter-response functions, which are shown in Figure 8\n(R. Wachter, private communication).\nFigure 9 shows the cross-correlation between the Doppler shifts VMDI \"measured\" by MDI and the actual vertical velocities in the model atmosphere [V (z)],\ntogether with the corresponding cross-correlation functions between Vcg of Ni\n6768 Å and V (z), and Vcore of Ni 6768 Å and V (z). Comparing this diagram to\nFigure 5 one can note several differences: i) the cross-correlation of the MDI\n\naccepted for publication in Solar Physics: 27 April 2011; p. 11\n\n\fB. Fleck et al.\n\n1.0\n\nVMDI\nVcg\nVcore\n\nCross-correlation\n\n0.8\n\n0.6\n\n0.4\n\n0.2\n0.0\n-100\n\n0\n\n100\n\n200\n300\nz / km\n\n400\n\n500\n\n600\n\nFigure 9. Cross-correlations between VMDI , Vcg , Vcore of Ni 6768 Å and the actual velocities\nV (z) as a function of height in the model atmosphere.\n\nDoppler signal (VMDI ) is markedly different from that of the center of gravity of\nNi 6768 Å (Vcg ); this is due to the fact that MDI uses only four filter positions and\ntherefore does not sample the full profile of Ni 6768 Å; ii) the cross-correlation\nof VMDI has its maximum at about 125 km, i.e. about 25 km higher than that\nof VHMI ; this is slightly higher than the value used by Straus et al. (2008), but\n55 and 75 km lower than the values in Wachter (2008) and Yurchyshyn and\nWang (2001); and iii) the cross-correlation of Vcore peaks at around 300 km,\nsignificantly higher than the corresponding function of Fe 6173, and in excellent\nagreement with Norton et al. (2006), who quoted 288 km for the core formation\nheight of the Ni line.\n6. Effects of Spatial Resolution\nWith a horizontal grid size of 14 km, the 3D simulations that we used have\na much higher spatial resolution than the actual HMI (or MDI) observations.\nSmall-scale features that are invisible in HMI observations but prominent in\nthe simulations at certain heights might skew the results. To investigate the\neffects that limited spatial resolution may have on the formation height of the\nHMI and MDI Doppler signals, we repeated the analysis presented in Sections\n3 and 5 after convolving the Fe and Ni spectra in the spatial dimension with a\nGaussian of 1.500 full width at half maximum (FHWM). This figure is based on a\nsimple empirical model of the HMI point spread function (PSF) that was fitted\nto HMI calibration data (Wachter et al., 2011). The model includes a narrow\ncore (described by a Gaussian) and an extended tail (accounting for scattered\nlight). Wachter et al. (2011) give a 1/e width of the central Gaussian core of 1.8\npixel, equivalent to a FWHM of approximately 1.500 .\n\naccepted for publication in Solar Physics: 27 April 2011; p. 12\n\n\fOn the Formation Height of the SDO/HMI Doppler Signal\n\nFigure 10 shows the resulting x–t diagrams for the HMI (left) and MDI (right)\nDoppler signals, Figure 11 the corresponding cross-correlation functions with the\nspatially convolved vertical velocities in the atmosphere.\n2000\n\n100\n\n2000\n\n100\n\n1000\n80\n\n60\n\n0\n\nTime / min\n\nTime / min\n\n80\n\n1000\n\n40\n\n60\n\n0\n\n40\n-1000\n\n20\n\n-1000\n20\n\n0\n\n-2000\n0\n\n1\n\n2\n\n3\nx / Mm\n\n4\n\n5\n\n0\n\n-2000\n0\n\n1\n\n2\n\n3\nx / Mm\n\n4\n\n5\n\nFigure 10. x–t diagrams of VHMI (x, t) (left) and VMDI (x, t) (right) after convolving the\nFe and Ni spectra with a Gaussian of 1.500 FWHM. The scaling is different from that in\nFigure 4. To account for the significantly reduced RMS, the range has been reduced to\n(−2000 m s−1 ≤ V ≤ 2000 m s−1 ).\n\nThe two x–t diagrams of the HMI and MDI Doppler signals in Figure 10\nlook very similar, as expected given the small difference in formation height of\nthe two signals. Comparing them to the full-resolution x–t diagram in Figure 4,\none can notice striking differences. Most of the small-scale convective motions\nare lost in the signal when reduced to actual HMI resolution and the spatiotemporal pattern becomes dominated by the larger-scale five-minute p modes.\nAs a result of this different weighting of convective motions and p modes, the\napparent formation height increases by about 50 km to 150 km for the HMI signal\nand to 175 km for the MDI signal (see the positions of the maxima of the solid\nlines in Figure 11).\nWe should emphasize that the model PSF of Wachter et al. (2011) is based\non pre-launch data, not on measurements in space. Several factors typical for\nground measurements (air flows, temperature changes, etc.) may have impacted\nthe image quality. A PSF of 1.500 is therefore a worst case, and it is likely that the\nactual HMI PSF is better. To quantify the range of the effects of limited spatial\nresolution, we repeated the above procedure assuming the PSF of a diffractionlimited 14-cm telescope operating at 6173 Å, which can be approximated by a\n\naccepted for publication in Solar Physics: 27 April 2011; p. 13\n\n\f1.0\n\n1.0\n\n0.8\n\n0.8\nCross-correlation\n\nCross-correlation\n\nB. Fleck et al.\n\n0.6\n\n0.4\n\nVHMI\nVcg\nVcore\n\n0.2\n0.0\n-100\n\n0\n\n0.6\n\n0.4\n\nVMDI\nVcg\nVcore\n\n0.2\n\n100\n\n200\n300\nz / km\n\n400\n\n500\n\n600\n\n0.0\n-100\n\n0\n\n100\n\n200\n300\nz / km\n\n400\n\n500\n\n600\n\nFigure 11. Left: Cross-correlations between VHMI , Vcg , Vcore and the actual velocities V (z)\nas a function of height in the model atmosphere after convolving the Fe 6173 spectra and\nvertical velocities with a Gaussian of 1.500 FWHM. Right: Same for the MDI Ni 6768 Å line.\n\nGaussian of 0.900 FWHM. In that case the apparent formation height of both\nthe HMI and MDI Doppler signal is found to be about 40 km higher than in\nthe full-resolution case. With the actual HMI PSF falling somewhere in between\nthe 0.900 and 1.500 case, one can therefore assume a height effect due to spatial\nsmearing of 40 to 50 km.\n\n7. Conclusions\nWe have studied the formation height of the HMI and MDI Doppler signals using\n3D radiation-hydrodynamic simulations. From the synthesized Fe 6173 and Ni\n6768 Å lines HMI and MDI Doppler signals were calculated using representative\nfilter-response functions and (simplified) pipeline processes. The resulting HMI\nDoppler signal is nearly identical to the center-of-gravity shift of the Fe 6173 Å\nline (linear correlation coefficient = 0.9991). It is formed at a height of about\n100 km, about 25 km lower than the MDI Doppler signal and significantly lower\nthan some previous estimates. The formation height shows a small dependence\non the spatial resolution and increases by 40 – 50 km to about 140 – 150 for the\nHMI signal and to about 165 – 175 km for the MDI signal. An error of 0.3%\nin the HMI filter transmission profiles (probably more realistic than a 1% error,\nthanks to the a-posteriori polynomial correction applied to some observables)\nleads to an error of less than 20 m s−1 (RMS) in the measured HMI Doppler\nvelocities. The current analysis is applicable only to disk center (μ = 1) observations. The inclusion of center-to-limb effects would significantly complicate the\nforegoing analysis. A more interesting study would be to expand this analysis\nfrom HD (hydrodynamics) to MHD (magnetohydrodynamics) and investigate\nthe magnetic-field diagnostics potential of HMI.\nAcknowledgements The simulations were carried out at CINECA (Bologna/Italy) with\nCPU time assigned under INAF/CINECA agreement 2008/2010. SDO is part of NASA's Living\nWith a Star (LWS) program. HMI was designed and assembled at Stanford University and\nLockheed Martin Solar and Astrophysics Laboratory. We are grateful to the SDO/HMI team\nfor making this instrument a reality. S.C. was supported by NASA Grant NAS5-02139 (HMI).\nTh.S. acknowledges financial support by ASI. SOHO is a mission of international cooperation\n\naccepted for publication in Solar Physics: 27 April 2011; p. 14\n\n\fOn the Formation Height of the SDO/HMI Doppler Signal\nbetween ESA and NASA. We thank G. Severino for helpful discussions and an anonymous\nreferee for constructive comments, which helped to improve the paper.\n\nReferences\nAllen, C. W. 1976, Astrophysical Quantities, University of London, The Athlone Press, 3rd\nedition.\nAsplund, M., Gustafsson, B., Kiselman, D., Eriksson, K. 1997, Astron. Astrophys., 318, 521.\nBarklem, P.S., Piskunov, N., O'Mara, B.J.: 2000, Astron. Astrophys. Suppl. 142, 467.\nBaur, T.G., House, L.L., Hull, H.K.: 1980, Solar Phys. 65, 111.\nBello González, N., Okunev, O., Kneer, F.: 1996, Astron. Astrophys. 490, L23.\nBello González, N., Yelles Chaouche, L., Okunev, O., Kneer, F.: 2009, Astron. Astrophys.\n494, 1091.\nBruls, J.H.M.J., Lites, B.W., Murphy, G.A.: 1991, In: November, L.J., (ed.), Solar Polarimetry,\nNational Solar Observatory, Sunspot, NM, 444.\nCaffau, E., Ludwig, H.-G., Steffen, M., Freytag, B., Bonifacio, P.: 2011, Solar Phys. 268, 255.\nCouvidat, S., Schou, J., Shine, R.A., Bush, R.I., Miles, J.W., Scherrer, P.H., Rairden, R.L.:\n2011, Solar Phys., DOI: 10.1007/s11207-011-9723-8.\nDomingo, V., Fleck, B., Poland, A.I.: 1996, Solar Phys. 162, 1.\nFreytag, B., Steffen, M., Dorch, B. 2002, Astrono. Nach. 323, 213.\nGomez, M.T., Severino, G., Marmolino, C., Roberti, G.: 1987, Astron. Astrophys. 188, 169.\nGustafsson, B., Edvardsson, B., Eriksson, K., Mizuno-Wiedner, M., Jørgensen, U.G., Plez,\nB.: 2003, In:Hubeny, I., Mihalas, D., Werner, K. (eds)., Astronomical Stellar Atmosphere\nModeling, CS-288, Astron. Soc. of the Pacific, San Francisco, 331.\nJones, H.P.: 1989, Solar Phys. 120, 211.\nKupka, F., Piskunov, N., Ryabchikova, T.A., Stempels, H.C., Weiss, W.W.: 1999, Astron.\nAstrophys. Suppl. 138, 119.\nMaltby, P., Avrett, E.H., Carlsson, M., Kjeldseth-Moe, O., Kurucz, R.L., Loeser, R.: 1986\nAstrophys. J. 306, 284.\nMuller, R., Dollfus, A., Montagne, M., Moity, J., Vigneau, J.: 2000, Astron. Astrophys. 359,\n373.\nNorton, A.A., Pietarila Graham, J., Ulrich, R.K., Schou, J., Tomczyk, S., Liu, Y., Lites, B.W.,\nL'opez Ariste, A., Busch, R.I., Socas-Navarro, H., Scherrer, P.H.: 2006, Solar Phys. 239,\n69.\nPlez, B., Brett, J.M., Nordlund, A.: 1992, Astron. Astrophys., 256, 551.\nScherrer, P.H., Bogart, R.S., Busch, R.I., Hoeksema, J.T., Kosovichev, A.G., Schou, J., Rosenberg, W., Springer, L., Tarbell, T.D., Title, A., Wilfson, C.J., Zayer, I., and the MDI\nengineering team: 1995, Solar Phys. 162, 129.\nSchou, J., Scherrer, P.H., Bush, R.I., Wachter, R., Couvidat, S., Rabello-Soares, M.C., et al.:\n2011, Solar Phys., in preparation.\nStraus, T., Fleck, B., Jefferies, S.M., Cauzzi, G., McIntosh, S.W., Reardon, K., Severino, G.,\nSteffen, M.: 2008, Astrophys. J. 681, L125.\nWachter, R.: 2008, Solar Phys. 251, 491.\nWachter, R., Schou, J., Rabello-Soares, M.C., Miles, J.W., Duvall, T.L., Bush, R.I.: 2011, Solar\nPhys., DOI: 10.1007/s11207-011-9709-6.\nWedemeyer, S., Freytag, B., Steffen, M., Ludwig, H.-G., Holweger, H. 2004, Astron.\nAstrophys., 414, 112.\nYurchyshyn, V.B., Wang, H.: 2001, Solar Phys. 202, 309.\n\naccepted for publication in Solar Physics: 27 April 2011; p. 15\n\n\faccepted for publication in Solar Physics: 27 April 2011; p. 16\n\n\f"}