{"id": "http://arxiv.org/abs/1101.3466v1", "guidislink": true, "updated": "2011-01-18T14:52:45Z", "updated_parsed": [2011, 1, 18, 14, 52, 45, 1, 18, 0], "published": "2011-01-18T14:52:45Z", "published_parsed": [2011, 1, 18, 14, 52, 45, 1, 18, 0], "title": "Azimuthal angle and rapidity dependence of di-hadron correlations in QCD", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1101.1132%2C1101.2111%2C1101.5507%2C1101.0964%2C1101.1582%2C1101.4608%2C1101.5492%2C1101.1114%2C1101.3490%2C1101.1501%2C1101.5020%2C1101.4140%2C1101.5953%2C1101.4477%2C1101.2181%2C1101.0958%2C1101.3200%2C1101.4195%2C1101.2363%2C1101.4610%2C1101.4999%2C1101.2232%2C1101.5924%2C1101.1329%2C1101.0143%2C1101.2544%2C1101.0151%2C1101.0166%2C1101.5233%2C1101.1361%2C1101.3504%2C1101.3466%2C1101.4838%2C1101.5232%2C1101.0413%2C1101.1353%2C1101.2828%2C1101.0674%2C1101.1295%2C1101.0573%2C1101.0066%2C1101.3348%2C1101.1322%2C1101.4708%2C1101.4397%2C1101.3599%2C1101.2256%2C1101.4691%2C1101.0231%2C1101.1020%2C1101.5337%2C1101.5609%2C1101.5360%2C1101.2033%2C1101.3052%2C1101.1771%2C1101.4958%2C1101.3804%2C1101.0921%2C1101.3688%2C1101.5668%2C1101.5819%2C1101.1167%2C1101.3539%2C1101.5823%2C1101.2762%2C1101.5960%2C1101.4830%2C1101.3478%2C1101.5554%2C1101.3195%2C1101.0069%2C1101.3513%2C1101.0526%2C1101.4276%2C1101.5035%2C1101.4166%2C1101.2159%2C1101.5531%2C1101.5229%2C1101.2791%2C1101.1073%2C1101.3762%2C1101.0320%2C1101.5586%2C1101.5196%2C1101.3038%2C1101.4263%2C1101.2679%2C1101.4655%2C1101.0595%2C1101.4725%2C1101.4407%2C1101.3816%2C1101.0047%2C1101.3834%2C1101.1094%2C1101.0777%2C1101.1843%2C1101.4989%2C1101.1146&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Azimuthal angle and rapidity dependence of di-hadron correlations in QCD"}, "summary": "I discuss novel QCD phenomena recently observed in p+p, p+A and A+A\ncollisions, that result from the non-linear dynamics of small-x gluons. I focus\non di-hadron correlation measurements, as opposed to single-hadron observables\noften too inclusive to distinguish possible new effects from established\nmechanisms. Specifically, I discuss angular correlations of forward di-hadrons\nin d+Au collisions and long-range rapidity correlations in high-multiplicity\np+p and Au+Au collisions.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1101.1132%2C1101.2111%2C1101.5507%2C1101.0964%2C1101.1582%2C1101.4608%2C1101.5492%2C1101.1114%2C1101.3490%2C1101.1501%2C1101.5020%2C1101.4140%2C1101.5953%2C1101.4477%2C1101.2181%2C1101.0958%2C1101.3200%2C1101.4195%2C1101.2363%2C1101.4610%2C1101.4999%2C1101.2232%2C1101.5924%2C1101.1329%2C1101.0143%2C1101.2544%2C1101.0151%2C1101.0166%2C1101.5233%2C1101.1361%2C1101.3504%2C1101.3466%2C1101.4838%2C1101.5232%2C1101.0413%2C1101.1353%2C1101.2828%2C1101.0674%2C1101.1295%2C1101.0573%2C1101.0066%2C1101.3348%2C1101.1322%2C1101.4708%2C1101.4397%2C1101.3599%2C1101.2256%2C1101.4691%2C1101.0231%2C1101.1020%2C1101.5337%2C1101.5609%2C1101.5360%2C1101.2033%2C1101.3052%2C1101.1771%2C1101.4958%2C1101.3804%2C1101.0921%2C1101.3688%2C1101.5668%2C1101.5819%2C1101.1167%2C1101.3539%2C1101.5823%2C1101.2762%2C1101.5960%2C1101.4830%2C1101.3478%2C1101.5554%2C1101.3195%2C1101.0069%2C1101.3513%2C1101.0526%2C1101.4276%2C1101.5035%2C1101.4166%2C1101.2159%2C1101.5531%2C1101.5229%2C1101.2791%2C1101.1073%2C1101.3762%2C1101.0320%2C1101.5586%2C1101.5196%2C1101.3038%2C1101.4263%2C1101.2679%2C1101.4655%2C1101.0595%2C1101.4725%2C1101.4407%2C1101.3816%2C1101.0047%2C1101.3834%2C1101.1094%2C1101.0777%2C1101.1843%2C1101.4989%2C1101.1146&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "I discuss novel QCD phenomena recently observed in p+p, p+A and A+A\ncollisions, that result from the non-linear dynamics of small-x gluons. I focus\non di-hadron correlation measurements, as opposed to single-hadron observables\noften too inclusive to distinguish possible new effects from established\nmechanisms. Specifically, I discuss angular correlations of forward di-hadrons\nin d+Au collisions and long-range rapidity correlations in high-multiplicity\np+p and Au+Au collisions."}, "authors": ["Cyrille Marquet"], "author_detail": {"name": "Cyrille Marquet"}, "author": "Cyrille Marquet", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1016/j.nuclphysa.2011.02.033", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1101.3466v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1101.3466v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "8 pages, 6 figures, Proceedings of the 4th International Conference\n  on Hard and Electromagnetic Probes of High-Energy Nuclear Collisions\n  (HP2010), Eilat, Israel, October 10-15 2010", "arxiv_primary_category": {"term": "hep-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "hep-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "nucl-th", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1101.3466v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1101.3466v1", "journal_reference": null, "doi": "10.1016/j.nuclphysa.2011.02.033", "fulltext": "Nuclear Physics A 00 (2018) 1–8\n\nAzimuthal angle and rapidity dependence of di-hadron correlations in QCD\nCyrille Marquet\n\narXiv:1101.3466v1 [hep-ph] 18 Jan 2011\n\nPhysics Department, Theory Unit, CERN, 1211 Genève 23, Switzerland\n\nAbstract\nI discuss novel QCD phenomena recently observed in p+p, p+A and A+A collisions, that result from the nonlinear dynamics of small-x gluons. I focus on di-hadron correlation measurements, as opposed to single-hadron\nobservables often too inclusive to distinguish possible new effects from established mechanisms. Specifically, I discuss\nangular correlations of forward di-hadrons in d+Au collisions and long-range rapidity correlations in high-multiplicity\np+p and Au+Au collisions.\nKeywords: Parton saturation, Color Glass Condensate, Heavy-ion collisions, Two-particle correlations\n\n1. Introduction\nThe large amount of experimental data collected at RHIC during the last decade, and at the LHC during the last\nyear, allows to explore novel QCD effects. In particular, RHIC measurements present a number of features which can\nbe consistently interpreted as consequences of a large gluon density in the gold nucleus, and of the corresponding nonlinear QCD dynamics. Manifestations of this so-called saturation regime of QCD include the suppression of forward\nparticle production [1, 2] and the azimuthal de-correlation of forward hadron pairs [3, 4] in d+Au compared to p+p\ncollisions. The recent start of the LHC significantly enhances the possibilities to explore the saturation regime of QCD\nalready in p+p collisions, as shown by the recent observation of long-range rapidity correlations in high-multiplicity\nevents [5].\nWe argue below that these data are well described by the effective theory called the Color Glass Condensate (CGC),\nthe best approximation of QCD devised so far to quantify parton saturation (see e.g. [6]). It properly takes into account both the non-linear evolution of hadronic/nuclear wave functions, and multiple parton interactions in scattering\nprocesses. Such effects are relevant when the gluon densities involved are large enough, corresponding to partons\nwith a small-enough energy fraction x, and the CGC describes reliably only that small-x part of the hadronic/nuclear\nwave function. And although the CGC describes non-linear QCD dynamics, it is still a weakly-coupled theory.\nIn p+A collisions, the saturation regime is better studied with forward particle production, sensitive only to largex partons on the proton side, but mainly to small-x gluons on the nucleus side. Since the large-x part of a proton\nwave function is well understood in perturbative QCD, this allows to investigate the small-x part of the nucleus\nwave function. In A+A and high-multiplicity p+p collisions, the dynamics of small-x gluons can be studied using\nlong-range rapidity correlations, sensitive to the early times after the collision rather than the following complicated\nspace-time evolution of the system. While the existence of the QCD saturation regime is, at a theoretical level, clear,\nthe real challenge from a phenomenological point of view has been to assess to what extent it is relevant at present\nenergies. Such was a difficult task, since different aspect of the parton dynamics may concur in data, and also because\nthe limit of asymptotically high energy in which the CGC formalism is developed is not fully realized in current\nexperiments.\n\n\fC. Marquet / Nuclear Physics A 00 (2018) 1–8\n\n2\n\nNevertheless, this has been achieved with the successful simultaneous description of the suppression of particle\nproduction [7] and azimuthal correlations [8] at forward rapidities in d+Au compared to p+p collisions, using the\nmost up-to-date theoretical tools available in the CGC approach. This is explained in Section 2, in parallel with more\nstandard mechanisms that successfully describe particle production at mid-rapidity. In Section 3, we discuss longrange rapidity correlations in high-multiplicity p+p and Au+Au collisions, and argue that the angular structure seen\nin the data and called the ridge may be interpreted as a consequence of large parton densities [9, 10], albeit in these\ncases several other possible interpretations exist.\n2. Di-hadron correlations, p+p vs d+Au collisions\n\n2.1. High-pT di-jets and the leading-twist approximation\nFig. 1 shows the cross section for high-pT di-jets in p+p collisions at the Tevatron, as the function of the azimuthal angle between\nthe jets ∆φ [11]. The leading-twist approximation of QCD, in which\nthe cross section is computed to leading-power of the hard scale, describes the data very well, and in this regime the di-jet azimuthal\ncorrelation is extremely peaked around ∆φ = π. It is often assumed\nthat this collinear factorization approach also holds in p+A collisions,\nmeaning that highly-virtual partons in nuclei behave independently as\nthey do in protons. Whether or not this is the case could be tested at\nthe LHC, starting with inclusive-jet/hadron measurements [12].\n2.2. Low-pT di-hadrons and power corrections at large x\nWe shall first focus on di-hadron production at mid-rapidity, including both the central-central and central-forward situations, and\nstudy the ∆φ dependence of the double-inclusive hadron production\ncross section, where ∆φ is the difference between the azimuthal angles of the measured particles h1 and h2 . Nuclear effects on di-hadron\ncorrelations are typically evaluated in terms of the coincidence probability to, given a trigger particle in a certain momentum range, produce an associated particle in another momentum range.\nIn a p+p or p+A collision, the coincidence probability is given by\nCP(∆φ) = N pair (∆φ)/Ntrig , with\nZ\nZ\ndN pA→hX\ndN pA→h1 h2 X\n,\nN\n=\n. (2)\nN pair (∆φ) =\ntrig\n3\n3\nd p1 d p2\nd3 p\nyi ,|pi⊥ |\n\ny, p⊥\n\n1/σdijet dσdijet / d∆φ dijet\n\nIn the case of double-inclusive hadron production pA → h1 h2 X, the partons in the proton (nucleus) wave function\nthat can contribute to the cross section carry a fraction of longitudinal momentum bounded from below by x p (xA ),\nwith\n|p1⊥ | e−y1 + |p2⊥ | e−y2\n|p1⊥ | ey1 + |p2⊥ | ey2\n,\nxA =\n,\n(1)\nxp =\n√\n√\nsNN\nsNN\n√\nwhere p1⊥ , p2⊥ and y1 , y2 denote the transverse momenta and rapidities of the final-state particles, and sNN the\ncollision energy per nucleon. One can distinguish three interesting situations, where different QCD dynamics is at\nplay. First, the production of high-pT di-jets, initiated by large-x partons and kinematically bound to be produced at\nmid-rapidity. Second, the production of low-pT di-hadrons at mid-rapidity, sensitive to power corrections and values\nof x still moderately large. Note that moving one of the hadrons to forward rapidities (central-forward case) increases\n√\nsignificantly the value of x p compared to the central-central case (for which x p ' xA ' pT / sNN ), but decreases xA\nonly marginally; for this reason we shall refer to these two situations as mid-rapidity ones. Finally, the production\nof di-hadrons at forward rapidities (forward-forward case) is sensitive to power corrections in the small-x regime, i.e.\nto saturation. Only the forward-forward case is sensitive to values of xA as small as in the single-inclusive forward\nhadron production case: x p . 1 and xA \u001c 1.\n10\n\n5\n\n10\n\n4\n\n10\n\n3\n\n10\n\n2\n\nDØ\npTmax > 180 GeV (×8000)\n130 < pTmax < 180 GeV (×400)\n100 < pTmax < 130 GeV (×20)\n75 < pTmax < 100 GeV\n\n10\n1\n10\n10\n10\n\n-1\n\nNLO\nLO\n\n-2\n\n-3\n\nπ/2\n\nNLOJET++ (CTEQ6.1M)\nμr = μf = 0.5 pTmax\n\n3π/4\n\nπ\n∆φ dijet (rad)\n\nFigure 1: High-pT mid-rapidity di-jet cross-section\nmeasured by the D0 collaboration [11] as the function of ∆φ. Although decreasing the pT range\nleads to azimuthal decorrelation, the signal remains\nsharply peaked around ∆φ = π. This is in agreement\nwith leading-twist NLOQCD predictions, which contain up to four partons in the final state.\n\n\fC. Marquet / Nuclear Physics A 00 (2018) 1–8\n1.5\n\n1\np+p\nd+Au\n\nSTAR\ndata\n\np+p\nd+Au min.bias\nd+Au central\n\nC(∆φ)\n\n1\n\n0.5\n\ny1 = 0\n\ny1 = 0\n\ny2 = 0\n\ny2 = 0\n\n0.3\n\nAzimuthal Correlations\n\n0.275\n0.5\n\nW = 200 GeV\nη1 = 3.8, η2 = 0, central\np1 = 1.5 GeV, p2 = 0.2 - 1.5 GeV\n\n0.25\n0.225\n\n0\n1.5\n\n0\n1\npT1 = 4 GeV, pT2 = 2 GeV\n\n3\n\nProton - Proton\nDeuteron - Gold\n\n0.2\n\npT1 = 1.5 GeV, pT2 = 1 GeV\n\n0.175\nC(∆φ)\n\n1\n\ny1 = 2\ny2 = 0\n\ny1 = 4\ny2 = 0\n\n0.5\n\n0.15\n\n0.5\n\n0.125\n0\n\n0\nπ/2\n\nπ\n∆φ [rad]\n\n3π/2\n\nπ/2\n\nπ\n∆φ [rad]\n\n3π/2\n\n0.1\n\n0\n\n1\n\n2\n\n3\n\n4\n\nπ\n\n5\n\n6\n\nφ\n\nFigure 2: The coincidence probability at mid-rapidity as a function of ∆φ. RHIC data show that in the central-central case the away-side peak is\nsimilar in d+Au and p+p collisions. In the central-forward case, the Glauber-eikonal (left plot from [14]) and CGC (center plot from [15]) calculations predict that the away-side peak is suppressed in d+Au compared to p+p collisions. This is in agreement with central-forward preliminary\nIdAu data (right plot from [16]), which show that in central d+Au collisions, the integral of the coincidence probability is about half that in p+p\ncollisions, reflecting the depletion of the away-side peak. Collinear factorization cannot reproduce this behavior, while both Glauber-eikonal and\nCGC calculations predicted it.\n\nFirst measurements were performed at RHIC by the PHENIX and STAR collaborations [2, 13]. In the central-central\ncase, the coincidence probability features a near-side peak around ∆φ = 0, when both measured particles belong to\nthe same mini-jet, and an away-side peak around ∆φ = π, corresponding to hadrons produced back-to-back. In the\ncentral-forward case, there is naturally no near-side peak. Either in p+p or d+Au collisions, the sizable width of the\naway-side peak cannot be described within the leading-twist collinear factorization framework. This indicates that\npower corrections are important when |p⊥ | ∼ 2 GeV. At such low transverse momenta, collinear factorization does not\nprovide a global picture of particle production at RHIC, even at mid-rapidity.\nThere are two main formalisms to take into account power corrections to the leading-twist approximation, the\nGlauber-eikonal approach, and the CGC framework. The former relies on a resummation of incoherent multiple scatterings, and therefore is not applicable at small x, where multiple scatterings are coherent. Performing the complete\nresummation including energy-momentum conservation is a challenging task, and more often than not a detour to the\nstrict calculation is taken by introducing non-perturbative parameters such as the so-called intrinsic transverse momentum. By contrast, the CGC is valid only in the small-x limit. Coherent multiple scatterings are taken into account\nalong with the equally important non-linear parton evolution, since both parametrically contribute to the same level\nwhen a large gluon density is reached, and including one without the other is not consistent. In both frameworks,\nthe multiple scatterings induce a pT -broadening, characterized either by a non-perturbative scale at large x, or by the\nsaturation scale at small x, as explained in the next section.\nBoth the Glauber-eikonal [14] and CGC [15] approaches qualitatively describe the di-hadron azimuthal correlation\ndata at mid-rapidity, including the broad width of the away-side peak and its depletion in d+Au collisions when going\nfrom central-central to central-forward production. This is illustrated in Fig. 2, left and center plots. Such a depletion\ndoes not occur in p+p collisions, it is due to nuclear-enhanced power corrections, and the p+A to p+p ratio of the\nintegrated coincidence probabilities\nR\nd∆φ CP pA (∆φ)\n(3)\nI pA = R\nd∆φ CP pp (∆φ)\nis therefore below unity. In Fig. 2, right plot, recent PHENIX data on IdAu [16] are displayed as a function of centrality.\nAt the moment, it is not clear whether the physical origin of the pT -broadening and of the azimuthal de-correlation\nis parton saturation rather than incoherent multiple scatterings. This is probably due to the kinematic window probed\nin these measurements: for a hadron momentum of |p⊥ | ∼ 2 GeV, one is sensitive to xA ∼ 0.01 to 0.1 at RHIC\nenergies. In this regime different physical mechanisms may concur, and neither underlying assumption of the two\ndifferent descriptions is completely fulfilled. The approximations made in CGC calculations will apply best in the\nforward-forward case discussed next.\n\n\fCP(∆φ)\n\nC. Marquet / Nuclear Physics A 00 (2018) 1–8\n\n0.02\n\n4\n\nSTAR PRELIMINARY\np+p (−0.0045)\nd+Au central (−0.0145)\n\npT,L>2 GeV/c\n1 GeV/c < pT,S<pT,L\n\n0.015\n\n0.01\n\n0.005\n\n0\n0\n\n1\n\n2\n\n3\n\n4\n\n5\n\n6\n\n∆φ\n\nFigure 3: The coincidence probability as a function of ∆φ for p+p (left) and central d+Au (center) collisions. These preliminary data from [3]\nshow a striking nuclear modification of di-hadron azimuthal correlations. The away-side peak, corresponding to hadrons emitted back-to-back,\nis prominent in p+p collisions but is absent in the central d+Au case. Such production of mono-jets was anticipated in the CGC as a signal of\nparton saturation, the data are compared with CGC predictions on the right plot; the away-side peak in p+p is qualitatively described by the CGC\ncalculation while its disappearance in central d+Au is quantitatively consistent with the prediction.\n\n2.3. Forward di-hadrons and parton saturation at small x\nAt RHIC mid-rapidity observables are contaminated too much by large-xA physics to quantitatively explore saturation effects. As explained in the introduction, particle production in the forward-rapidity region offers a cleaner\nopportunity. This was realized in [17], where the importance of the forward di-hadron measurement was emphasized,\nand predictions of the azimuthal angle distribution were made. Although these results were only qualitative since for\ninstance parton fragmentation was not included, they have been confirmed by subsequent RHIC measurements. The\nrecent data collected by the STAR collaboration for the coincidence probability obtained with two neutral pions are\ndisplayed in Fig. 3, for both p+p (left plot) and central d+Au (center plot) collisions. The nuclear modification of the\ndi-pion azimuthal correlation is quite impressive, the prominent away-side peak in p+p collisions is absent in central\nd+Au collisions, in agreement with the behavior predicted in [17].\nLet us outline this calculation. As external probes propagate through a target hadron or nucleus, their multiple\nscatterings off the small-x gluons is coherent because the wavelength of these gluons increases with decreasing x,\neventually becoming bigger than the longitudinal extent of the target. The momentum scale below which such coherent multiple scattering are important is the saturation scale Q s (x), the same scale which characterizes the onset of\nnon-linear effects in the hadronic/nuclear wave function. Both are taken into account in the CGC approach, which\nresums all power corrections that are dominant in the small-x limit. Non-linear parton evolution generates an intrinsic\ntransverse momentum while some is also gained through multiple scatterings. The magnitude of both is controlled by\nQ s , which is an increasing function with decreasing x.\nIn the leading-log(1/x) approximation, the evolution of the saturation scale with x, and more generally of the CGC\nwave function, can obtained from a functional renormalization group equation. In the large-Nc limit, it reduces to the\nnon-linear Balitsky-Kovchegov (BK) equation [18, 19]. The recent determination of running coupling corrections\nto the original leading-logarithmic equation [20, 21] has proven an essential step in promoting the BK equation to a\nphenomenological tool. Indeed, the derivation of the rcBK equation, along with numerical simulations [22], made\nrobust quantitative calculations possible. For instance, after the two parameters of the theory were constrained by\nsingle-inclusive forward hadron production [7] (they are x0 , the value of xA below which one starts to trust, and\ntherefore use, the CGC framework, and the value of the saturation scale at the starting point of the evolution Q s (x0 )),\nparameter-free predictions for the coincidence probability CP(∆φ) could be made [8].\nIn Fig. 3, right plot, these predictions are compared with the STAR data. We see that the disappearance of the\naway-side peak in central d+Au collisions, compared to p+p collisions, is quantitatively consistent with the CGC\ncalculations. These are only robust in the d+Au case (for which Q2s (x0 = 0.02) = 0.6 GeV2 ), but the extrapolation to\nthe p+p case (for which Q2s (x0 = 0.01) = 0.2 GeV2 is uncomfortably close to Λ2QCD ) is displayed in order to show that\nit is qualitatively consistent with the presence an the away-side peak. Since uncorrelated background has not been\nextracted from the data, the overall normalization of the data points has been adjusted by subtracting a constant shift,\nas indicated on the figure.\n\n\fC. Marquet / Nuclear Physics A 00 (2018) 1–8\n\n5\n\nWe recall that di-hadron correlations at mid-rapidity, which are sensitive to larger values of xA , feature an awayside peak in both p+p and central d+Au collisions. The fact that the away-side peak disappears in the central d+Au\ncase, when going from central to forward rapidities, indicates that the effect is correlated with the growth of the nuclear\ngluon density with decreasing xA . Similarly, we predict that in the forward-forward case, the away-side peak reappears\nwhen going from central to peripheral collisions, or for higher transverse momenta of the measured particles. We are\nnot aware of any descriptions of this phenomena that do not invoke saturation effects. We note that another successful\ndescription based on the KLN saturation model was also proposed [23]. There, although different assumptions are\nused, the existence of the saturation scale is the crucial ingredient to successfully reproduce the data.\nWhile more differential measurements of the coincidence probability, as a function of transverse momentum,\nrapidity or centrality, will provide further quantitative tests of the CGC, this piece of evidence strongly indicates\nthat we have observed manifestations of the saturation regime of QCD at RHIC. However, there are still progresses\nto be made on the theoretical side. For instance, an approximation was used in [17, 8], in order to express the\ndouble-inclusive hadron production cross section (also derived in [24, 25, 26] and in [27] with in addition gluoninitiated di-jets) in terms of only the single-gluon distribution function, already well constrained. The validity of this\napproximation has been critically examined [28], as it does not allow to correctly implement the non-linear QCD\nevolution, even in the large Nc limit. Still, in practice, no better solution has been proposed so far. This will require\nto numerically solve the x evolution of multi-gluon distributions, which implies to introduce additional parameters\nto characterize the corresponding initial conditions. It was pointed out recently that in the limit of small di-hadron\nmomentum imbalance, only single-gluon distributions are needed [29], but in general this is not the case.\n3. Long-range rapidity correlations, p+p vs Au+Au collisions\nLet us now discuss high-multiplicity p+p and heavy-ion collisions. When considering low-pT particle production,\nonly the small-x part of the wave functions of the colliding objects is relevant, and therefore such collisions can be\ndescribed by the scattering of two CGCs. The system created immediately after such a collision is called the Glasma,\nit provides a weak-coupling description of the early stages after a high-multiplicity p+p or A+A collision, before\nevolving into a thermalized quark-gluon plasma it the system size is big enough, as is the case for not-too-peripheral\nheavy-ion collisions.\nIf we denote ρ1 and ρ2 the strong color charges of the incoming hadrons/nuclei, the color field describing the\ndynamics of the small-x gluons is solution of the Yang-Mills equations\n[Dμ , F μν ] = δ+ν ρ1 + δ−ν ρ2 .\n\n(4)\n\nThe Glasma field, after the collision, is non-trivial [30]: it has a strong component (Aμ ∼ 1/g s ), a component which\nis particle like (Aμ ∼ 1), and components of any strength in between. To understand how this pre-equilibrium system\nthermalizes, one needs to understand how the Glasma field decays into particles. Right after the collision, the strong\nfield component contains all modes. Then, as the field decays, modes with pT > 1/τ are not part of the strong\ncomponent anymore, and for those a particle description becomes more appropriate. After a time of order 1/Q s ,\nthis picture breaks down, and it has been a formidable challenge to determine weather a fast thermalization can be\nachieved within this framework.\nA problem which can be addressed more easily is particle production. As discussed below, a factorization framework has been established to perform such calculations [31]. Before we outline it, let us point out that two-particle\ncorrelations are especially interesting, because they can probe the dynamics of the early times after the collision, if the\nrapidity difference between the two final-state particles is large enough [32]. Indeed, causality imposes that particles\nseparated by a rapidity ∆η can be correlated only by events which happened at\nτ < τ f.o. e−∆η/2 ,\n\n(5)\n\nwhere the freeze-out time τ f.o. denotes the time of last interaction. This is explained in Fig. 4, left diagram, which\n√\nshows the space-time picture of the collision: in the forward light-cone, lines of constant proper time τ = x+ x−\nare hyperbolae and lines of constant rapidity η = 12 log(x+ /x− ) are straight lines from the origin. Therefore, while\nheavy-ion collisions are in general not great probes of parton saturation due to the complicated space-time evolution\nof the system, long-range di-hadron correlations are particularly well-suited observables for that purpose.\n\n\fC. Marquet / Nuclear Physics A 00 (2018) 1–8\n\n6\n\nt\nA\n\nB\n\ndetection\nfreeze out\nlatest correlation\n\nz\n\nFigure 4: Left: the space-time location of events that may correlate two particles is the intersection of their past light-cones. Correlations between\nparticles widely separated in rapidity are due to early-time dynamics. Right: typical leading-order diagram for particle production in the Glasma,\nmultiple partonic interactions are crucial when low values of x are being probed in the nuclear wave functions.\n\n3.1. Particle production in the Glasma\nTo compute particle production in the collision of two CGCs, the first task is to express the cross sections in terms\nof the Glasma field Aμ [ρ1 , ρ2 ], taking into account multiple partonic interactions, as pictured in Fig. 4, right diagram.\nThen, one needs to average the cross sections over all possible field configurations, distributed according to functional\nprobabilities that we denote W xA [ρ1 ] and W xB [ρ2 ]:\nZ\nhOi =\nDρ1 Dρ2 W xA [ρ1 ]W xB [ρ2 ] O[Aμ ] .\n(6)\nThis factorization has been recently proven [31] to leading order in α s , and to all orders in g s ρ1 and g s ρ2 . The small-x\nevolution is contained in the CGC \"wave functions\" W x , while the momenta of the final-state particles enter in the\nobservables O. For instance, in the case of single-inclusive gluon production, the cross section reads\nZ\nX\n1\ndN\n\u000fλμ (p)\u000fλν (p) Aμ (x)Aν (y) .\n(7)\nd4 xd4 y eip*(x−y) \u0003 x \u0003y\n[A\n]\n=\nμ\n2\n3\nd p⊥ dy\n16π\nλ\nAn aspect of hadronic collisions which happens to be much simpler when large parton densities are involved, compared to small ones, is multi-gluon production. Indeed, in a collision of dilute objects of small partonic densities, the\nproduced gluons predominantly all come from the same ladder, because this is what involves the parton distributions a\nminimum number of times (once for each colliding hadron). By contrast, in a collision of dense objects, the dominant\ncontribution comes about when the produced gluons all originate from different ladders, so as to involve both gluon\ndistributions a maximum number of times (a pair for each produced gluon). The multi-gluon production cross section\nthen reads:\ndN\ndN\ndN\n[Aμ ] = 3 [Aμ ] × . . . × 3 [Aμ ] .\n(8)\nd3 p1 . . . d3 pn\nd p1\nd pn\nThis power counting argument that qualitatively distinguishes multi-particle production in high-multiplicity p+p and\nA+A collisions compared to minimum-bias p+p collisions, also applies when ∆η is large.\nIn the leading-log(1/x) approximation, the evolution of W x [ρ] with decreasing x is given by a functional renormalization group equation. As both the CGC wave function W x and the Glasma field Aμ first have to be evaluated\nnumerically, performing the ρ integrations while fully implementing the non-linear QCD evolution has proven to be an\nextremely challenging task, and has not been achieved yet. In phenomenological studies of two-particle correlations,\nit is instead assumed that W x [ρ] is a Gaussian distribution, whose variance is evolving with x such that the evolution\nof the single-gluon distribution is correctly reproduced (but that of multi-gluon distributions is not). In this case, the\ndouble-inclusive hadron production cross section can be expressed in terms of only single-gluon distributions [9], allowing a practical phenomenological analysis. However, similarly to what was mentioned at the end of Section 2, this\napproximation does not correctly implement the non-linear QCD evolution, as it misses a large number of leading-Nc\ncontributions [33]. It was also argued recently that, as a consequence of using Gaussian distributions, two-particle\ncorrelations are underestimated [34].\n\n\fC. Marquet / Nuclear Physics A 00 (2018) 1–8\n\n7\n\nAu+Au central\n3<pttrig<4 GeV/c\nd2N/(d∆φ d∆η)\n\n-3\n\n10\n53\n52\n51\n50\n49\n48\n47\n46\n-3\n\n-2\n\n-1\n\n0\n\n∆φ\n\n1\n\n2\n\n3\n\n-1.5\n\n-1\n\n-0.5\n\n0\n\n0.5\n\n1\n\n1.5\n\n∆η\n\nFigure 5: Left: figure showing that particles emitted from the same flux tube are correlated in rapidity in a nearly boost-invariant way, and explaining\nhow radial flow turn this a priori ∆φ-independent correlation into a ridge structure. Center: STAR measurement of di-hadron correlations in central\nAu+Au collisions [37], featuring long-range rapidity correlations on both sides of the jet peak, in qualitative agreement with the CGC expectations.\nRight: comparison between PHOBOS data [36] and GCG calculations [9], of the magnitude of the ridge at ∆φ = 0 as a function of ∆η.\n\n3.2. The ridge in p+p vs Au+Au collisions\nTwo of the main features of the Glasma field are that, at leading-order it is η-independent, and that its correlation\nlength in the transverse plane 1/Q s is much smaller than hadronic/nuclear radii. Consequently, the color field Aμ\nis made of boost-invariant longitudinal flux tubes of transverse size 1/Q s . Because of this flux-tube structure, the\nGlasma is a natural candidate to explain the ridge-shaped two-particle correlations observed in Au+Au collisions at\nRHIC [35, 36, 37]. This is illustrated in Fig. 5, left drawing: the particles can come from different tubes in which case\nthey are uncorrelated, or come from the same tube which creates an η-independent correlation.\nDue to the strong radial flow induced at a later stage by the collective motion of the system, this correlation is\nturned into a ridge collimated around ∆φ = 0, such as the one displayed in Fig. 5, center plot, obtained from a dihadron correlation measurement in central Au+Au collisions. In agreement with our interpretation, this ridge-shaped\nstructure is only observed with particles of low-enough transverse momenta, that participate in the collection motion.\nIt disappears in peripheral collisions as well, since these do not create a quark-gluon plasma, and therefore any radial\nflow. In this case, only a strong-enough intrinsic ∆φ dependence of the two-particle correlations could reveal the\nlong-range rapidity correlations.\nThe right plot of Fig. 5 shows the magnitude of the ridge as a function of ∆η, for ∆φ = 0. The data are successfully\ncompared with a calculation that combines an estimate of the jet peak around ∆η = 0, with the nearly η-independent\ncorrelation computed from the double-inclusive particle production cross section in the CGC [9]. The figure also\nshows that the ridge is several units long in rapidity, confirming that these correlations originate at early times.\nUsing high-multiplicity events in p+p collisions at the LHC, the CMS collaboration [5] recently answered the\nquestion whether, in a system without much collective flow, one could detect the rather-small intrinsic ∆φ dependence\nof di-hadron correlations in QCD at high energies. It happens to be in qualitative agreement with CGC expectations\n[10]. For instance, the left diagram of Fig. 6, which involves two (A,B) pairs of gluon distributions as previously\nexplained, is responsible for a ∆φ dependence of two-particle correlations, when the transverse momentum of both\nfinal-state hadrons is of order Q s . This QCD correlation is irrelevant in heavy-ion collisions, where it is overwhelmed\nby radial flow, however it dominates when the system is too small to develop any collective motion. This seems to\nbe the case in high-multiplicity p+p collisions at the LHC, where no ridge is seen for low-pT particles (Fig. 6, center\nplot). On the contrary, the ridge is indeed present when pT ∼ Q s (Fig. 6, right plot).\n4. Conclusions\nTo conclude, let us emphasize that saturation-based approaches were the only ones to correctly predict the suppression of forward particle production [38, 39] and the azimuthal de-correlation of forward hadron pairs [17] in p+A\nvs p+p collisions at RHIC, as well as the ridge phenomenon in high-multiplicity p+p collisions at the LHC [40].\nWhile alternative, subsequent-to-data and distinctive explanations of these different phenomena have been and may\nstill be proposed, we are not aware of any formalism that can describe all of them in a global way, other than the CGC,\nwhich, let us not forget, is also known to describe well all small-x sensitive observables in e+p collisions at HERA.\n\n\fC. Marquet / Nuclear Physics A 00 (2018) 1–8\n\n8\n\nFigure 6: Left: a typical diagram that generates an angular collimation around ∆φ = 0 nearly independent of ∆η, the rapidity separation between\nthe two hadrons. However, it is non-zero only for hadron transverse momenta comparable to Q s , and it is dominant only at large ∆η away from the\njet peak. Center and right: CMS measurement of di-hadron correlations in high-multiplicity p+p collisions [5], as a function of ∆φ and ∆η. The\ndata is consistent with the CGC picture, as the so-called near-side ridge is only observed when 1 < pT < 3 GeV.\n\nReferences\n[1]\n[2]\n[3]\n[4]\n[5]\n[6]\n[7]\n[8]\n[9]\n[10]\n[11]\n[12]\n[13]\n[14]\n[15]\n[16]\n[17]\n[18]\n[19]\n[20]\n[21]\n[22]\n[23]\n[24]\n[25]\n[26]\n[27]\n[28]\n[29]\n[30]\n[31]\n[32]\n[33]\n[34]\n[35]\n[36]\n[37]\n[38]\n[39]\n[40]\n\nI. Arsene et al. [BRAHMS Collaboration], Phys. Rev. Lett. 93, 242303 (2004).\nJ. Adams et al. [STAR Collaboration], Phys. Rev. Lett. 97, 152302 (2006).\nE. Braidot for the STAR collaboration, arXiv:1005.2378.\nB. A. Meredith for the PHENIX Collaboration, PoS DIS2010, 081 (2010).\nV. Khachatryan et al. [CMS Collaboration], JHEP 1009, 091 (2010).\nF. Gelis, E. Iancu, J. Jalilian-Marian and R. Venugopalan, arXiv:1002.0333.\nJ. L. Albacete and C. Marquet, Phys. Lett. B 687, 174 (2010).\nJ. L. Albacete and C. Marquet, Phys. Rev. Lett. 105, 162301 (2010).\nK. Dusling, F. Gelis, T. Lappi and R. Venugopalan, Nucl. Phys. A 836, 159 (2010).\nA. Dumitru, K. Dusling, F. Gelis, J. Jalilian-Marian, T. Lappi and R. Venugopalan, arXiv:1009.5295 [hep-ph].\nV. M. Abazov et al. [D0 Collaboration], Phys. Rev. Lett. 94, 221801 (2005).\nP. Quiroga-Arias, J. G. Milhano and U. A. Wiedemann, Phys. Rev. C 82, 034903 (2010).\nS. S. Adler et al. [PHENIX Collaboration], Phys. Rev. Lett. 96, 222301 (2006).\nJ. w. Qiu and I. Vitev, Phys. Lett. B 632, 507 (2006).\nD. Kharzeev, E. Levin and L. McLerran, Nucl. Phys. A 748, 627 (2005).\nB. Meredith, Nucl. Phys. A 830, 595C (2009).\nC. Marquet, Nucl. Phys. A 796, 41 (2007).\nI. Balitsky, Nucl. Phys. B 463, 99 (1996).\nY. V. Kovchegov, Phys. Rev. D 60, 034008 (1999).\nI. Balitsky, Phys. Rev. D 75, 014001 (2007).\nY. V. Kovchegov and H. Weigert, Nucl. Phys. A 784, 188 (2007);\nJ. L. Albacete and Y. V. Kovchegov, Phys. Rev. D 75, 125021 (2007).\nK. Tuchin, Nucl. Phys. A 846, 83 (2010).\nJ. Jalilian-Marian and Y. V. Kovchegov, Phys. Rev. D 70, 114017 (2004) [Erratum-ibid. D 71, 079901 (2005)].\nN. N. Nikolaev, W. Schafer, B. G. Zakharov and V. R. Zoller, Phys. Rev. D 72, 034033 (2005).\nR. Baier, A. Kovner, M. Nardi and U. A. Wiedemann, Phys. Rev. D 72, 094013 (2005).\nF. Dominguez, C. Marquet, B. W. Xiao and F. Yuan, arXiv:1101.0715 [hep-ph].\nA. Dumitru and J. Jalilian-Marian, Phys. Rev. D 82, 074023 (2010).\nF. Dominguez, B. W. Xiao and F. Yuan, arXiv:1009.2141 [hep-ph].\nT. Lappi and L. McLerran, Nucl. Phys. A 772, 200 (2006).\nF. Gelis, T. Lappi and R. Venugopalan, Phys. Rev. D 78, 054019 (2008); ibid. 054020 (2008).\nA. Dumitru, F. Gelis, L. McLerran and R. Venugopalan, Nucl. Phys. A 810, 91 (2008).\nA. Dumitru and J. Jalilian-Marian, Phys. Rev. D 81, 094015 (2010).\nA. Kovner and M. Lublinsky, arXiv:1012.3398 [hep-ph].\nA. Adare et al. [PHENIX Collaboration], Phys. Rev. C 78, 014901 (2008).\nB. Alver et al. [PHOBOS Collaboration], Phys. Rev. Lett. 104, 062301 (2010).\nB. I. Abelev et al. [STAR Collaboration], Phys. Rev. C 80, 064912 (2009).\nD. Kharzeev, Y. V. Kovchegov and K. Tuchin, Phys. Rev. D 68, 094013 (2003).\nJ. L. Albacete, N. Armesto, A. Kovner, C. A. Salgado and U. A. Wiedemann, Phys. Rev. Lett. 92, 082001 (2004).\nA. Dumitru, in RIKEN-BNL Research Center workshop on \"Progress in high-pT physics at RHIC\", RBRC Vol. 95.\n\n\f"}