{"id": "http://arxiv.org/abs/0811.2883v1", "guidislink": true, "updated": "2008-11-18T10:49:25Z", "updated_parsed": [2008, 11, 18, 10, 49, 25, 1, 323, 0], "published": "2008-11-18T10:49:25Z", "published_parsed": [2008, 11, 18, 10, 49, 25, 1, 323, 0], "title": "Numerical simulation of the magnetization of high-temperature\n  superconductors: 3D finite element method using a single time-step iteration", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0811.2824%2C0811.0114%2C0811.3634%2C0811.3473%2C0811.3126%2C0811.0826%2C0811.3240%2C0811.3210%2C0811.2309%2C0811.4507%2C0811.1891%2C0811.2555%2C0811.0591%2C0811.4495%2C0811.1192%2C0811.3435%2C0811.2822%2C0811.2213%2C0811.2181%2C0811.0917%2C0811.0298%2C0811.1275%2C0811.4524%2C0811.4632%2C0811.3113%2C0811.4657%2C0811.2386%2C0811.1793%2C0811.1530%2C0811.0467%2C0811.3056%2C0811.4352%2C0811.2248%2C0811.2553%2C0811.3642%2C0811.2997%2C0811.2794%2C0811.1820%2C0811.0509%2C0811.4617%2C0811.2883%2C0811.2206%2C0811.1369%2C0811.3656%2C0811.3096%2C0811.3051%2C0811.3639%2C0811.3320%2C0811.1301%2C0811.0942%2C0811.0005%2C0811.3567%2C0811.4278%2C0811.4076%2C0811.3461%2C0811.1516%2C0811.3134%2C0811.2900%2C0811.0138%2C0811.1304%2C0811.0157%2C0811.3148%2C0811.2686%2C0811.4319%2C0811.1927%2C0811.1288%2C0811.0460%2C0811.3632%2C0811.2504%2C0811.4270%2C0811.0969%2C0811.4528%2C0811.1177%2C0811.0905%2C0811.1588%2C0811.0632%2C0811.3104%2C0811.3372%2C0811.0524%2C0811.3621%2C0811.1656%2C0811.4420%2C0811.3123%2C0811.2129%2C0811.3343%2C0811.4313%2C0811.3390%2C0811.3004%2C0811.3759%2C0811.3353%2C0811.1387%2C0811.4312%2C0811.2252%2C0811.0038%2C0811.4695%2C0811.1000%2C0811.3174%2C0811.3497%2C0811.2010%2C0811.0277%2C0811.0683&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Numerical simulation of the magnetization of high-temperature\n  superconductors: 3D finite element method using a single time-step iteration"}, "summary": "We make progress towards a 3D finite-element model for the magnetization of a\nhigh temperature superconductor (HTS): We suggest a method that takes into\naccount demagnetisation effects and flux creep, while it neglects the effects\nassociated with currents that are not perpendicular to the local magnetic\ninduction. We consider samples that are subjected to a uniform magnetic field\nvarying linearly with time. Their magnetization is calculated by means of a\nweak formulation in the magnetostatic approximation of the Maxwell equations\n(A-phi formulation). An implicit method is used for the temporal resolution\n(Backward Euler scheme) and is solved in the open source solver GetDP. Picard\niterations are used to deal with the power law conductivity of HTS. The finite\nelement formulation is validated for an HTS tube with large pinning strength\nthrough the comparison with results obtained with other well-established\nmethods. We show that carrying the calculations with a single time-step (as\nopposed to many small time-steps) produce results with excellent accuracy in a\ndrastically reduced simulation time. The numerical method is extended to the\nstudy of the trapped magnetization of cylinders that are drilled with different\narrays of columnar holes arranged parallel to the cylinder axis.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0811.2824%2C0811.0114%2C0811.3634%2C0811.3473%2C0811.3126%2C0811.0826%2C0811.3240%2C0811.3210%2C0811.2309%2C0811.4507%2C0811.1891%2C0811.2555%2C0811.0591%2C0811.4495%2C0811.1192%2C0811.3435%2C0811.2822%2C0811.2213%2C0811.2181%2C0811.0917%2C0811.0298%2C0811.1275%2C0811.4524%2C0811.4632%2C0811.3113%2C0811.4657%2C0811.2386%2C0811.1793%2C0811.1530%2C0811.0467%2C0811.3056%2C0811.4352%2C0811.2248%2C0811.2553%2C0811.3642%2C0811.2997%2C0811.2794%2C0811.1820%2C0811.0509%2C0811.4617%2C0811.2883%2C0811.2206%2C0811.1369%2C0811.3656%2C0811.3096%2C0811.3051%2C0811.3639%2C0811.3320%2C0811.1301%2C0811.0942%2C0811.0005%2C0811.3567%2C0811.4278%2C0811.4076%2C0811.3461%2C0811.1516%2C0811.3134%2C0811.2900%2C0811.0138%2C0811.1304%2C0811.0157%2C0811.3148%2C0811.2686%2C0811.4319%2C0811.1927%2C0811.1288%2C0811.0460%2C0811.3632%2C0811.2504%2C0811.4270%2C0811.0969%2C0811.4528%2C0811.1177%2C0811.0905%2C0811.1588%2C0811.0632%2C0811.3104%2C0811.3372%2C0811.0524%2C0811.3621%2C0811.1656%2C0811.4420%2C0811.3123%2C0811.2129%2C0811.3343%2C0811.4313%2C0811.3390%2C0811.3004%2C0811.3759%2C0811.3353%2C0811.1387%2C0811.4312%2C0811.2252%2C0811.0038%2C0811.4695%2C0811.1000%2C0811.3174%2C0811.3497%2C0811.2010%2C0811.0277%2C0811.0683&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We make progress towards a 3D finite-element model for the magnetization of a\nhigh temperature superconductor (HTS): We suggest a method that takes into\naccount demagnetisation effects and flux creep, while it neglects the effects\nassociated with currents that are not perpendicular to the local magnetic\ninduction. We consider samples that are subjected to a uniform magnetic field\nvarying linearly with time. Their magnetization is calculated by means of a\nweak formulation in the magnetostatic approximation of the Maxwell equations\n(A-phi formulation). An implicit method is used for the temporal resolution\n(Backward Euler scheme) and is solved in the open source solver GetDP. Picard\niterations are used to deal with the power law conductivity of HTS. The finite\nelement formulation is validated for an HTS tube with large pinning strength\nthrough the comparison with results obtained with other well-established\nmethods. We show that carrying the calculations with a single time-step (as\nopposed to many small time-steps) produce results with excellent accuracy in a\ndrastically reduced simulation time. The numerical method is extended to the\nstudy of the trapped magnetization of cylinders that are drilled with different\narrays of columnar holes arranged parallel to the cylinder axis."}, "authors": ["Gregory P. Lousberg", "Marcel Ausloos", "Christophe Geuzaine", "Patrick Dular", "Philippe Vanderbemden", "Benoit Vanderheyden"], "author_detail": {"name": "Benoit Vanderheyden"}, "author": "Benoit Vanderheyden", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1088/0953-2048/22/5/055005", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0811.2883v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0811.2883v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "cond-mat.supr-con", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.supr-con", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "cond-mat.mtrl-sci", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0811.2883v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0811.2883v1", "arxiv_comment": null, "journal_reference": null, "doi": "10.1088/0953-2048/22/5/055005", "fulltext": "arXiv:0811.2883v1 [cond-mat.supr-con] 18 Nov 2008\n\nNumerical simulation of the magnetization of\nhigh-temperature superconductors: 3D finite\nelement method using a single time-step iteration\nGregory P. Lousberg1,2 , Marcel Ausloos3 , Christophe\nGeuzaine4 , Patrick Dular4 , Philippe Vanderbemden1 , and\nBenoit Vanderheyden1\n1\n\nSUPRATECS, Department of Electrical Engineering and Computer Science (B28),\n\nUniversity of Liège, Belgium\n2\n\nFRS-FNRS fellowship\n\n3\n\nSUPRATECS (B5a), University of Liège, Belgium\n\n4\n\nACE, Department of Electrical Engineering and Computer Science (B28),\n\nUniversity of Liège, Belgium\nE-mail:\n\ngregory.lousberg@ulg.ac.be\n\nAbstract.\nWe make progress towards a 3D finite-element model for the magnetization of a\nhigh temperature superconductor (HTS): We suggest a method that takes into account\ndemagnetisation effects and flux creep, while it neglects the effects associated with\ncurrents that are not perpendicular to the local magnetic induction. We consider\nsamples that are subjected to a uniform magnetic field varying linearly with time.\nTheir magnetization is calculated by means of a weak formulation in the magnetostatic\napproximation of the Maxwell equations (A-φ formulation). An implicit method is used\nfor the temporal resolution (Backward Euler scheme) and is solved in the open source\nsolver GetDP. Picard iterations are used to deal with the power law conductivity of\nHTS. The finite element formulation is validated for an HTS tube with large pinning\nstrength through the comparison with results obtained with other well-established\nmethods. We show that carrying the calculations with a single time-step (as opposed\n\n\fNumerical simulation of the magnetization of high-temperature superconductors\n\n2\n\nto many small time-steps) produce results with excellent accuracy in a drastically\nreduced simulation time. The numerical method is extended to the study of the\ntrapped magnetization of cylinders that are drilled with different arrays of columnar\nholes arranged parallel to the cylinder axis.\n\nPACS numbers: 74.25.Ha,74.25.Sv\n\nSubmitted to: Supercond. Sci. Technol.\n\nKeywords: 3D finite-element, bulk HTS, artificial holes\n\n\fNumerical simulation of the magnetization of high-temperature superconductors\n\n3\n\n1. Introduction\n\nBulk high-temperature superconductors (HTS) become increasingly attractive for being\nused as efficient magnetic shields [1] or as powerful permanent magnets [2, 3]. Highly\nsensitive magnetic measurement systems, such as in a biomagnetic imaging device,\nneed efficient magnetic shields for reducing the effects of the external magnetic\ndisturbances [4, 5, 6]. Powerful magnets are required in magnetic bearing systems,\nwhere they produce large levitation forces [7, 8], or in rotating machines, where they\nproduce a large torque on the shaft [9, 10, 11].\nThe performances of HTS trapped field magnets are limited by three main factors:\n(i) the critical current density in the sample, Jc , that determines the maximum trapped\nmagnetic field; (ii) the strength of the mechanical stresses, that arise from strong Lorentz\nforces and may result in cracks in the sample; and (iii) the heat exchange rate with the\ncryogenic fluid, that when too low may lead to significant temperature rises if the sample\nis subjected to a variable magnetic flux, as it is the case in rotating machines [12].\nIn order to improve the performances of HTS magnets, attention has recently turned\nto bulk samples in which an array of parallel columnar holes is drilled along the caxis [13, 14, 15]. The hole array enables one to obtain a better oxygen annealing [16]\n- and therefore to raise Jc -, to perform a more efficient cooling [17], or to reinforce\nmechanically the sample by injecting a resin [3, 15]. On the other hand, the holes also\nblock the current stream lines - which have to flow around them - and, as a result,\ndegrade the magnetic properties of the sample. In a previous work [18], the Bean critical\n\n\fNumerical simulation of the magnetization of high-temperature superconductors\n\n4\n\nstate model was used for calculating the first magnetization of drilled cylinders of infinite\nextension, as a function of their hole pattern. It was shown that the penetration of the\nmagnetic flux in a given hole generated a discontinuity in the flux distribution ahead of\nthat hole. The trapped magnetic flux could then be increased by placing the holes on\nthe discontinuity lines (i.e. lines where the current flow abruptly changes its direction\ndue to the presence of a hole) of their direct neighbors, as this arrangement limited the\nperturbation by an individual hole of the overall flux distribution.\nThis study was applied to samples of infinite extension and thus neglected\ndemagnetisation effects. To pursue the study and compare with experimental results,\nwork is needed to model the three-dimensional distribution of the magnetic flux while\ntaking due account of the presence of the holes, the actual path followed by the current\nlines, and the resulting demagnetisation effects.\nCalculating a three-dimensional magnetic field distribution in HTS is notoriously\ndifficult [19, 20]. In the limit of infinite pinning strength, the magnetic flux distribution\ncan be described with the concept of the critical state, introduced by Bean [21]. The\ncritical state is characterized by a current density with a constant magnitude that flows\nperpendicular to the local flux density lines, since the magnetic force exerted on the\nvortices only depends on that component [20]. For a series of geometric configurations\nwith a high level of symmetry, e.g. a cylinder subjected to an applied field with an\naxial symmetry, the current density is known to be everywhere perpendicular to the\nmagnetic field, and the critical state can be simpled determined [21, 22]. However, for\n\n\fNumerical simulation of the magnetization of high-temperature superconductors\n\n5\n\nan arbitrary configuration where either the sample or the source of the field has no\nparticular symmetry, the critical state model must be modified in order to properly\ndescribe the time evolution of the component of the current density that is parallel\nto the local magnetic field [20]. Moreover, for realistic pinning strengths, flux creep\nmust also be taken into account, particularly at the temperature of liquid nitrogen\n(77 K) [23, 24, 25]. To our knowledge, no model includes yet a proper treatment of both\nthe longitudinal component of the current density and the creep effects.\nThe purpose of this work is to make progress toward a 3D model for the calculation\nof the trapped flux in drilled HTS magnets, by taking into account demagnetisation\neffects and flux creep, while neglecting the more delicate effects associated with\nlongitudinal currents. In practice, we expect such a description to faithfully reproduce\nthe actual flux distribution near the median plane of the sample, since the current lines\nare expected to lie in the plane and thus to be perpendicular to the local flux lines.\nMoreover, we believe that the neglect of those effects associated with the longitudinal\ncomponent of the current density leads nonetheless to a first-order approximation from\nwhich qualitative conclusions can be drawn regarding the influence of the hole lattice\non the magnetic properties of the drilled samples.\nIn the rest of this paper, HTS are modeled by a power law conductivity σ(E) [25]\nassuming the form\nJ = σ(E)E =\n\nJc\n1/n\n\nEc\n\n(|E|)\n\n1−n\nn\n\nE,\n\n(1)\n\nwhere Ec is the critical electric field and Jc is the critical current density. The critical\n\n\fNumerical simulation of the magnetization of high-temperature superconductors\n\n6\n\nexponent, n, is related to the pinning strength in the material and is assumed to be\nindependent of the magnetic field. When n = 1, we recover the constitutive law of\nan ohmic material. In the opposite limit of infinite pinning strength, n → ∞, the\npower law model is asymptotically equivalent to the Bean model [26, 27]. Several\nnumerical methods are available to solve for the magnetic field penetration in HTS\nwith a power law conductivity: finite-difference approximation in cylinders [28], Green's\nfunction approach in cylinders [19] or in tubes [1], and finite element method (FEM)\nwith so-called A-φ formulations [29, 30], T -Φ formulations [31, 32], or unconstrained\nH-formulations [33, 34]. In each of these methods, the choice of the time-step is crucial\nsince it governs the convergence rate and the total calculation time, which can become\nexcessively long on a 3D mesh when n is large [30, 33, 35].\nTo our knowledge, in the FEM suggested so far, the computation time-step was\nchosen much smaller than the timescale characterising the simulated external excitation.\nSuch a choice can however be largely improved in the (present) case of an excitation\nvarying linearly with time. Our argumentation is two-fold. First, from the point of view\nof the physics involved, one knows that the vortex motion and flux creep are strongly\nreduced as the pinning strength increases. Thus, for large n, the motion of vortices can\nonly be induced by applying an external flux variation, so that the time behaviour of the\nmagnetic response is expected to be mainly dictated by the excitation sweep rate, not by\ncreep effects. The second part of our argumentation stems from the numerics involved.\nWe solve a time-differential equation of the form ∂u/∂t = g(u) with the backward Euler\n\n\fNumerical simulation of the magnetization of high-temperature superconductors\n\n7\n\nscheme [36]. The temporal derivative at time t is approximated at first-order, yielding\nthe implicit equation\nut − ut−∆t\n= g(ut ).\n∆t\n\n(2)\n\nSuch a scheme has been shown to yield a truncature error proportional to the second time\nderivative, et ≈ ∂ 2 u/∂t2 ∆t + O(∆t2 ) [36]. Again, in the limit of large pinning strength\nand with an external field applied as a ramp, we expect the second time derivative of\nthe magnetic response to be small, as its timescale is dictated by that of the excitation,\nwhich varies here linearly with time. These arguments suggest that larger ∆t can be\nused, and in the extreme case, a single time-step might be used.\nThis paper addresses the questions of the accuracy and the convergence of a\nsingle time-step method that is suitable for a 3D model of HTS. For this purpose,\nwe use a finite-element formulation implemented in the open source numerical solver\nGetDP [37, 38]. The rest of this manuscript is organised as follows: in Section 2, we\ndescribe and motivate the choice of an A-φ formulation. In Section 3, we describe the\nimplementation of this formulation into GetDP, and validate it in Section 4, where\ncomparisons are made with the Bean model in the case of an HTS tube with an infinite\nheight (2D geometry), and with the Green's function method [19] in the cases of a tube\nof finite height (3D geometry). In particular, we analyse the validity of the single timestep method as a function of the value of the critical exponent n and the ramping rate.\nIn section 5, we apply the FEM for calculating the trapped magnetic flux density in\ndrilled HTS cylinders with a finite height, for four different periodical arrangements of\n\n\fNumerical simulation of the magnetization of high-temperature superconductors\n\n8\n\nthe columnar holes. We then conclude in Section 6.\n\n2. Finite element A − φ formulation\n\nThe description of the magnetic field penetration in HTS is based on magneto-quasistatic\napproximation of the Maxwell equations [39].\n\nThe HTS conductivity is given by\n\nEquation (1) and the lower critical field, Hc1 , is neglected against the applied field,\nso that the material follows the constitutive law, B = μ0 H. We introduce the vector\npotential A and the scalar potential φ, through\nB = Bself + Ba (t)ez = ∇ × A + ∇ × Aa ,\nE= −\n\n(3)\n\n∂A ∂Aa\n−\n− ∇φ,\n∂t\n∂t\n\n(4)\n\nwhere the magnetic flux density is split into two contributions: the uniform applied\nmagnetic flux density, Ba (t) ez , which points along the z-axis and varies linearly\nwith time as Ba (t) = Ḃa t, and the reaction magnetic flux density, Bself , which is\nproduced by the eddy currents induced in the HTS. In cylindrical coordinates, the\nvector potential corresponding to the uniform applied magnetic flux density is given\nby Aa = −r/2Ba (t) eθ and we have ∂Aa /∂t = −r/2Ḃa eθ . The introduction of the\npotentials A and φ into the magneto-quasistatic Maxwell equations leads to two coupled\nequations:\n\u0010\n\n\u0011\n\n∇ × ∇ × A = μ0 σ(A, φ) −Ȧ − Ȧa − ∇φ ,\nn\n\n\u0010\n\n∇ * σ(A, φ) −Ȧ − Ȧa − ∇φ\n\n\u0011o\n\n= 0,\n\n(5)\n(6)\n\n\fNumerical simulation of the magnetization of high-temperature superconductors\n\n9\n\nwhere the electrical conductivity σ is calculated from the power law (1), as σ =\nJc /Ec(1/n) |E|(1−n)/n .\n\nThese equations are sufficient to describe the electromagnetic\n\nbehavior of HTS in the A-φ formulation [29, 40].\n\nThe choice of this particular\n\nformulation is motivated by the fact that it produces a strong knowledge of the magnetic\nflux density, which is the quantity that is directly available in experiment. The Dirichlet\nboundary conditions on A and φ are imposed on the outer surface of a circular shell\n(in 2D geometry) or a spherical shell (in 3D geometry), whose external surface in both\ncases is sent to infinity by a Jacobian transformation [41]. At infinity, we set A = 0 and\nφ = 0.\nEquations (5-6) are solved by the Galerkin residual minimization method, which\nyields\n\u0010\n\n\u0011\n\n(∇ × A, ∇ × Ai )− < Bself × n, Ai > −μ0 σ(Ȧ + Ȧa + ∇φ), Ai = 0, (7)\n(σ Ȧ, ∇φj ) + (σ Ȧa , ∇φj ) + (σ∇φ, ∇φj )− < n.E, φj >= 0,\n\n(8)\n\nwhere Ai and φj are basis functions that are known a priori, the notation (u, v)\ncorresponds to the volume integral\nthe surface integral\n\nR\n\n∂Ω\n\nR\n\nΩ\n\nuv dV over the volume Ω, and < u, v > stands for\n\nuv dC. Surface terms are used for imposing Neumann boundary\n\nconditions when appropriate.\nThe vector potential is approximated as a series of basis functions, A =\n\nP\n\ni\n\nai Ai ,\n\nwhere the Ai 's are first-order edge functions that ensure the continuity of the normal\ncomponent of B from mesh to mesh. The vector potential is defined in a gauge for\nthe edge functions that avoids the computation of the curl of A for the post-processing\n\n\fNumerical simulation of the magnetization of high-temperature superconductors\n\n10\n\nof the magnetic flux density [42]. This gauge condition reads A.w = 0, where w is a\nset of edges that connects all the nodes of the mesh through an open path, in such a\nway that a given pair of nodes can only be connected by a unique continuous path (see\nFigure 1). Similarly to A, the scalar potential φ is expanded as φ =\n\nP\n\nj bj φj ,\n\nwhere φi\n\nare first-order nodal functions.\n\n3. Computation of the finite element model\n\nThe weak formulation (7-8) is implemented into the open-source solver for discrete\nproblems, GetDP [37, 38]. GetDP presents two major advantages over commercial\nfinite-element softwares: it is available free of charge and it offers a large choice of\nnumerical methods to be implemented with a full control of the inherent parameters.\nAs stated in the Introduction, we use a step-by-step temporal resolution with a\nbackward Euler scheme, which has a good stability and a high convergence rate even\nwith very large time steps [36]. The convergence and the stability of this method has\nalready been demonstrated in the context of HTS in the case of a E-formulation [43].\n\nFigure 1. Example of a set of meshing edges w used for the definition of the vector\npotential A.\n\n\fNumerical simulation of the magnetization of high-temperature superconductors\n\n11\n\nFigure 2. Operations to be executed for one time iteration.\n\nIn our formulation, the implicit resolution required at each step generates a system of\nequations which are non-linear, because of the conductivity law of Equation (1). This\nnon-linearity is treated with a Picard iterative loop [44], which consists in updating at\neach time step the value of the non-linear term with the solution found at the previous\niteration. The loop is run until the relative difference between two consecutive solutions,\nen , is smaller than a predefined criterion, taken empirically here as en < 2.10−3 . Using\na Picard iteration scheme with a power law conductivity prevents one from having to\ndeal with the infinite derivatives that appear in the more traditional Newton-Raphson\nscheme [45]. Figure 2 schematically represents the sequence of operations to be executed\nduring a given time step.\nIn the following, we will compare two different choices for the time integration of\n\n\fNumerical simulation of the magnetization of high-temperature superconductors\n\n12\n\nthe field from instant \"zero\" to a predetermined instant, t1 : in the first choice, the\nintegration is carried out in a succession of small time steps of duration ∆t ≪ t1 ; in the\nsecond choice, the equations are iterated in a single time-step, with ∆t = t1 . These two\nchoices will be compared in a number of situations.\n\n4. Simulation of the magnetization of a HTS tube\n\nWe first apply the FEM to the calculation of the magnetization of an HTS tube subjected\nto an axial field, in both limits of infinite and finite height. These are geometries for\nwhich the current density is everywhere perpendicular to the local magnetic field and\nsolutions are known from other methods. The goal of this section is to compare the\nFEM to these other methods to validate our approach.\nThe high level of symmetry in each geometry allows us in principle to reduce the\nmesh dimension. However, we deliberately choose not to exploit symmetry to construct\nthe mesh, so as to use the weak formulation (7)-(8) without simplification since that\nformulation will be used in geometries having no such symmetries. Thus, for the case\nof a tube of infinite extension, we use a 2D mesh of the cross section, while for the case\nof a tube with a finite height, we use a 3D mesh. The FEM results are compared to the\npredictions of the Bean model in the case of infinitely long tubes and to the results of\nthe Green's function of Brandt [19] in the case of tubes with a finite height.\n\n\fNumerical simulation of the magnetization of high-temperature superconductors\n\n13\n\n4.1. Tube of infinite extension (2D geometry)\nConsider first a superconducting tube of infinite height subjected to a uniform magnetic\nfield applied parallel to its axis, as a ramp. The tube has an external radius a = 10 mm\nand an internal radius b = 5 mm. The pinning forces in the superconductor are assumed\nto be infinite. Under this hypothesis, the Bean model [21] applies and predicts that the\nmagnetic flux density decreases linearly inside the wall and is constant inside the hole.\nAs explained in Section 1, the power law conductivity (1) is asymptotically\nequivalent to the Bean model when n → ∞. From a practical point of view, it has been\nshown in Ref. [46] that the use of the power law with a critical exponent of n = 100 and\nwith a sweep rate of Ḃa = 10 mT/s yields an accurate approximation of the Bean model.\nIn this section, we choose that parameter values in order to compare the results of the\nfinite-element model to analytical expressions of the Bean critical-state. The critical\ncurrent density Jc is assumed to be independent on the magnetic flux density† and has\na value of Jc = 2 107 A/m2 . The critical electric field Ec is taken to be Ec = 10−4 V/m.\nThe theoretical penetration field of the tube Hp , is given by Hp = Jc (b − a) = 105 A/m,\nwhich corresponds to a flux density, μ0 Hp = 125.6 mT.\nIn Figure 3-(a), the magnetic field profile is plotted along the diameter of the tube\nfor an external induction Ba = 10, 50, 100, 150, and 200 mT. FEM simulations are run\nwith different choices of time-steps: dashed lines show the results of simulations with\nmultiple small time-steps ∆t = 1 s, stopping at either t1 = 1, 5, 10, 15 and 20 s; solid\n† Note that a model with field-dependent Jc can easily be implemented in GetDP\n\n\fNumerical simulation of the magnetization of high-temperature superconductors\n\n14\n\n(a) Profile of the magnetic flux density along the tube diameter, as\n\nFigure 3.\n\ncalculated with the FEM with a single time-step (solid lines) and with multiple timesteps ∆t = 1 s (dashed lines). The critical exponent n is chosen large (here n = 100) so\nas to approach the critical state. The magnetic flux density is applied with a constant\nsweep rate of 10 mT/s. The profiles are shown for Ba = 10, 50, 100, 150, and 200 mT.\ng from the Bean model, as a function of Ba , for the single\n(b) Average deviation ∆B\n\ntime-step method (circles) and for the multiple time-step method (squares).\n\nlines show results from single time-step simulations, where ∆t = t1 is fixed to either 1,\n5, 10, 15, or 20 s. It can be observed that in each case the profile of the magnetic field\nin the superconductor is linear. It closely follows the result of the Bean model,\n\n\n\n\n\n\n\n\n\n\n\n\nBBean = Ba − μ0 Jc (a − r)\n\n(b ≤ r ≤ a),\n\nBBean = Ba − μ0 Jc (a − b)\n\n(0 < r < b).\n\n(9)\n\nTo further quantify the results, we define the average deviation from the Bean model as\ng\n∆B\n\n1\n=\n2a\n\nZ\n\na\n\n|BFEM − BBean |dr,\n\n(10)\n\n−a\n\nwhere BFEM stands for the FEM results. Figure 3-(b) shows the average deviation in\nthe FEM method using a single time-step (filled circles) and in that using multiple timesteps (open squares). Both methods produce almost the same deviation as long as the\n\n\fNumerical simulation of the magnetization of high-temperature superconductors\n\n15\n\nmagnetic field has not fully penetrated the wall of the tube, or for Ba < 120 mT. For\nBa > 120 mT, the error obtained with the multiple time-step approach first increases\nabruptly and then has a value around 3 mT. The single time-step method, on the other\nhand, leads to an error which peaks at about 2.5 mT at Ba = 130 mT and then decreases\nat larger fields to be less than 2 mT at Ba = 200 mT.\nOverall, the single time-step method gives an accurate solution with a relative\nerror that stay below 5% of the Bean prediction. Note that this result is obtained in\na relatively short calculation time with respect to a multiple time-step method. For\nexample, the 20 simulations of Figure 3-(b) take less than half a day on a dual-core\n2.8 GHz processor with 2 Gb of memory, whereas the multiple time-step approach with\n∆t = 1 s takes almost 3 days on the same computer.\n\n4.2. Tube of finite extension (3D geometry)\nWe now turn to the case of a superconducting tube of finite height subjected to a uniform\naxial field. The tube has an external radius of 10 mm, an internal radius of 5 mm (see\nFigure 4), and a height of 8 mm. The external field is applied with a constant rate\nḂa = 10 mT/s and raises up to Ba = 200 mT. Here again, a large pinning strength\nwith n = 100 is assumed. The critical current density, Jc and the critical electric field,\nEc have the same values as for the tube with an infinite height.\nThe FEM approach is carried on a 3D mesh with a single time-step method\n(∆t = 20 s). Only half of the tube is actually meshed, and vanishing conditions on\n\n\fNumerical simulation of the magnetization of high-temperature superconductors\n\n16\n\nFigure 4. Sketch of the HTS tube. The outer radius is 10 mm, the inner radius is\n5 mm, and the height is 8 mm. The arrows indicate different scan directions for plotting\nthe magnetic flux profile. The external field is applied with a constant sweep rate of\nḂa = 10 mT/s, and raises up to Ba = 200 mT. The flux penetration problem is either\nsolved with the FEM single time-step method (gray solid lines and ∆t = 20 s), or with\nBrandt's method with multiple time-steps (black dashed lines and ∆t = 5 10−4 s),\nboth assuming n = 100.\n\nthe tangential component of B are imposed in the median plane. The FEM results\nare compared with those of the Green's function method of Brandt [1, 19], which in\nthis geometry is based on a 2D-kernel. The time-step is fixed at 5 10−4 s to ensure\nconvergence.\nThe z-component of the magnetic flux density is probed along three different\ndirections [see Figure 4: (a), the tube axis, (b) a diameter at the top surface, and\n(c), a diameter on the median plane]. Solid lines show the FEM results and dashed lines\n\n\fNumerical simulation of the magnetization of high-temperature superconductors\n\n17\n\nshow those of Brandt's method. It can be observed that solid lines exhibit step-like\nfeatures, whereas dashed lines are smoother. This difference can be traced back to the\nlow meshing density adopted in the FEM method. Even though only half of the tube\nis meshed in 3D, the maximum number of available nodes with 6 Gb RAM (200 000)\nis still too small to obtain a smooth curve after linear interpolation, unlike the Brandt\nmethod which uses a specific interpolation on the 2D meshing.\nDespite this observed difference, one can see that the results of the two methods\nare in good agreement. In particular, on the linescan along direction (c) (Figure 4-(c)),\nwe observe a magnetic flux density on the outer wall of the tube that is slightly larger\nthan Ba = 200 mT. This is caused by the demagnetizing field, which was absent in the\nresults of the previous subsection. Inside the superconducting wall, the magnetic flux\ndensity decreases linearly; in the central part of the tube, it remains at a low level, but\nexhibits variations due again to the demagnetizing field.\nFigure 5 shows the z-component of the magnetic flux density calculated at the center\nof the cylinder, Bcenter , as a function of the external field Ba . The dashed lines show\nthe result of the Green's function approach. Circles show the FEM results in a single\ntime-step approach, with different choices of the time-step ranging between ∆t = 1 s\nand 20 s. Here again, the agreement between the methods is excellent, demonstrating\nthe relevance for adopting a single time-step iteration in a FEM approach.\n\n\fNumerical simulation of the magnetization of high-temperature superconductors\n\n18\n\nFigure 5. Magnetic flux density calculated at the center of a HTS tube with the\nFEM single time-step method (circles) and with the Green's function method (dashed\nlines and ∆t = 5 10−4 s). The external field is applied with a ramp of constant rate\nḂa = 10 mT/s and increases up to 200 mT. FEM single time-step method are shown\nfor different choices of the time-step: ∆t = 1, . . . , 20 s.\n\nFigure 6. Difference between the magnetic flux density at the center of the HTS tube,\nas calculated by the FEM single time-step method and the Green's function method\n(with multiple time steps ∆t = 5 10−4 s). The magnetic field is applied as a ramp with\na sweep rate of 1 mT/s (squares), 10 mT/s (circles) and 100 mT/s (triangles). The\napplied magnetic flux density is ramped up to Ba = 200 mT. The critical exponent n\nvaries from 5 to 100.\n\n\fNumerical simulation of the magnetization of high-temperature superconductors\n\n19\n\n4.3. Domain of validity of the single time-step method\nWe have seen in the two previous subsections that the FEM method with a single timestep produces accurate results in the strong pinning limit (n = 100). The purpose of\nthis subsection is to analyze the accuracy of the method at lower pinning strength and\nestablish its sensitivity to the sweep rate of the external field. Mastering these two\nfactors is essential to make comparisons with experiments.\nWe estimate the error of the FEM single time-step method on the basis of the\nmagnetic field produced at the center of the tube with a finite height (the tube considered\nin the previous subsection). The external field is ramped with a fixed rate Ḃa up to\nBa = 200 mT. The error is then evaluated as the absolute difference between the results\nof the FEM and the Green's function methods. Figure 6 shows the error (in %) as a\nfunction of the critical exponent n, varying from 5 to 100, and the sweep rate Ḃa , taken\nas 1 mT/s (circles), 10 mT/s (squares), or 100 mT/s (triangles).\nIn the very strong pinning limit (n = 100), the error remain small (below 2 %) and\nis fairly independent of the sweep rate. This limit corresponds to the critical state which\nis uniquely determined by the external conditions and is independent of the magnetic\nhistory of the sample. Provided convergence is guaranteed, the FEM approach should\nthus produce the critical state solution. The opposite limit of low pinning strength shows\na much larger sensistity to the sweep rate and a larger spread in the error. Here, these\nresults should be considered as qualitative only, as the Green's function method itself\nhas an error that grows in this limit, so that our estimate of the FEM error becomes\n\n\fNumerical simulation of the magnetization of high-temperature superconductors\n\n20\n\nquestionable in this regime. For intermediate values of n, the error remains low and\nweakly sensitive to the sweep rate: e.g., for the experimentally relevant value for melttextured YBCO at 77 K, n = 20 [47], the error is below 3 %. This demonstrates that the\nsingle time-step method is useful for simulating the magnetization of HTS with finite\npinning strengths.\n\n5. Magnetization of drilled cylinders\n\nAn extension of the single time-step method is presented in this last section where we\ncompare the magnetization of cylinders containing 4 different arrays of holes. In a\nprevious work [18], the Bean critical state has been used to compare the magnetization\nof cylinders of infinite height with four different patterns of holes: the squared and the\ncentered rectangular lattices having a translational symmetry, and the polar squared\nand polar triangular lattices with a rotational symmetry. It was found that the largest\ntrapped magnetic flux is obtained with the polar triangular lattice. We now consider\nFEM calculations in order to take into account demagnetisation and creep effects.\nTo this end, we consider cylinders (radius of 10 mm and height of 8 mm) that are\ndrilled by the four lattices considered in Ref. [18]. The lattice parameters are chosen\nin a such way that the total diameter of the holes is constant (50π mm), so as to fix\nthe total surface of heat exchange. The squared and the centered rectangular lattices\ncontain each 25 holes with a radius of 1 mm. The polar lattices contain two layers of 10\nholes with a radius of 1 mm and a central layer with 10 holes with a radius of 0.5 mm.\n\n\fNumerical simulation of the magnetization of high-temperature superconductors\n\n21\n\nThe four samples are represented in Figure 7-(a).\nIn order to calculate the trapped magnetic flux, HTS samples are first magnetized\nby an external field varying linearly with time. A magnetic flux is then trapped in the\nsample when the external magnetic field returns to 0 mT. This magnetization process is\ncalculated here in two time-steps: one for increasing the applied magnetic flux density\nto 600 mT with a constant sweep rate of 10 mT/s and a second one for decreasing it to\n0 mT with the same sweep rate.\nFigure 7-(b) shows the trapped magnetic flux density profile along the cylinder\ndiameter [see black arrow in Figure 7-(a)].\n\nThe dashed curve corresponds to the\n\ntrapped flux profile in a cylinder having the same geometry and material parameters,\nbut containing no holes. The flux profiles exhibit steps, resulting from the low number\n\nFigure 7. (a)- The four lattices in the cylinder (radius 10 mm, height 8 mm). (b),(c)\n- Trapped magnetic flux profile along the cylinder diameter, as calculated with the\nFEM two time-steps method, with a sweep rate of 10 mT/s and n = 25. The profile is\nrepresented in the top cross section of the cylinder. The dashed line corresponds to the\nflux profile in a cylinder without holes, also calculated with the FEM two time-step\nmethod.\n\n\fNumerical simulation of the magnetization of high-temperature superconductors\nBmax (mT)\n\n3D - top\n\n22\n\n3D - center Infinite height\n\nPolar triangular lattice\n\n70.05\n\n112.7\n\n137.9\n\nPolar squared lattice\n\n63.6\n\n97.7\n\n120.9\n\nSquared lattice\n\n56.7\n\n87.8\n\n110.8\n\nCentered rectangular lattice\n\n50.6\n\n76.4\n\n101\n\nTable 1. Maximum trapped magnetic flux density in cylinders of finite height, as\ncalculated in the top cross section (3D - top) and in the median plane (3D - center),\nand in cylinders of infinite height obtained in Ref. [18].\n\nof meshing elements used in 3D simulations as was already observed in Section 4.2.\nIt can be observed that the maximum trapped magnetic flux density is smaller in the\ndrilled samples than in the bulk one.\nTable 1 lists the values of the maximum trapped magnetic flux density in the\ntop cross section and in the median plane, as well as the results obtained for infinite\ncylinders [18]. In all cases, the maximum trapped magnetic flux density is obtained with\na polar triangular lattice, with a value higher by ≈ 40% with respect to that obtained\nin a centered rectangular lattice. This result is independent of the cross-section where it\nis calculated and agrees with the theoretical predictions based on the Bean model [18].\nThe demagnetisation effects only affect the values of the maximum trapped flux density\nthat are smaller in the finite height samples than in the cylinders of infinite height with\nthe same hole lattice.\n\n\fNumerical simulation of the magnetization of high-temperature superconductors\n\n23\n\n6. Conclusions\n\nUsing the open source solver GetDP, we have implemented a 3D finite element A-φ\nformulation for the calculation of the magnetization of bulk HTS subjected to a ramp\nof magnetic field. The numerical method is based on a single time-step iteration that\nreduces drastically the total calculation time. By comparing it to the Bean model [21]\nin infinite tubes and to the Green's function method [19] in tubes of finite height, we\nhave shown that the FEM approach accurately describes the magnetic properties of\nsuperconductors with strong pinning. Although it neglects the effects associated with\ncurrents that are parallel to the magnetic field, that study makes progress toward a 3D\nmodel of HTS magnets that takes into account demagnetisation effects and flux creep.\nAs an extension of the FEM single time-step method, we have calculated the\ntrapped magnetic flux in drilled cylinders of finite height. The numerical method uses\nonly two time-steps: the first one during the ramping up of the applied field to Hmax\nand the second one for the return of the external field to zero. Using this method, we\nhave been able to extend a previous analysis for tubes of infinite extension to a full 3D\ngeometry. These results confirm that the trapped magnetic flux is maximized by drilling\nthe holes according to a polar triangular lattice.\n\nReferences\n[1] S. Denis, L. Dusoulier, M. Dirickx, Ph. Vanderbemden, R. Cloots, M. Ausloos, and\nB. Vanderheyden. Magnetic shielding properties of high-temperature superconducting tubes\n\n\fNumerical simulation of the magnetization of high-temperature superconductors\n\n24\n\nsubjected to axial fields. Supercond. Sci. Technol., 20:192, 2007.\n[2] A. M. Campbell and D. A. Cardwell.\n\nBulk high temperature superconductors for magnet\n\napplications. Cryogenics, 37:567–575, 1997.\n[3] M. Tomita and M. Murakami. High-temperature superconductor bulk magnets that can trap\nmagnetic fields of over 17 T at 29 K. Nature, 421:517, 2003.\n[4] D. Koelle, R. Kleiner, F. Ludwig, E. Dantsker, and J. Clarke.\n\nHigh-transition-temperature\n\nsuperconducting quantum interference devices. Rev. Mod. Phys., 71:631, 1999.\n[5] J. Vrba and S.E. Robinson. SQUID sensor array configurations for magnetoencephalography\napplications. Supercond. Sci. Technol., 15:R51, 2002.\n[6] V. Pizzella, S. Della Penna, C. Del Gratta, and G. Luca Romani. SQUID systems for biomagnetic\nimaging. Supercond. Sci. Technol., 14:R79, 2001.\n[7] T. M. Mulcahy, J. R. Hull, K. L. Uherka, R. G. Abboud, and J. J. Juna. Test results of 2-kWh\nflywheel using passive PM and HTS bearings. IEEE Trans. Appl. Supercond., 11:1729–1732,\n2001.\n[8] G.T. Ma, Q.X. Lin, J. S. Wang, S. Y. Wang, Z. G. Deng, Y. Y. Lu, M. X. Liu, and J. Zheng.\nMethod to reduce levitation force decay of the bulk HTSC above the NdFeB guideway due to\nlateral movement.\n[9] B. Oswald, K. J. Best, M. Setzer, M. Soll, W. Gawalek, A. Gutt, L. Kovalev, G. Krabbes, L. Fisher,\nand H. C. Freyhardt. Reluctance motors with bulk HTS material. Supercond. Sci. Technol.,\n18:S24–S29, 2005.\n[10] X. Granados, J. Lopez, R. Bosch, E. Bartolome, J. Lloberas, R. Maynou, T. Puig, and X. Obradors.\nLow-power superconducting motors. Supercond. Sci. Technol., 21:034010, 2008.\n[11] M. D. McCulloch and D. Dew-Hughes.\n\nBrushless AC machines with high temperature\n\nsuperconducting rotors. Mater. Sci. Eng. B, 53:211–215, 1998.\n[12] P.J. Masson, P. Tixador, J.C. Ordonez, A.M. Morega, and C.A. Luongo. Electro-Thermal model\nfor HTS motor design. IEEE Trans. Appl. Supercond., 17:1529, 2007.\n\n\fNumerical simulation of the magnetization of high-temperature superconductors\n\n25\n\n[13] J.G. Noudem, S. Meslin, C. Harnois, D. Chateigner, and X. Chaud. Melt textured YBa2 Cu3 Oy\nbulks with artificially patterned holes: a new way of processing c-axis fault current limiter\nmeanders. Supercond. Sci. Technol., 17:931, 2004.\n[14] S. Haindl, F. Hengstberger, H. W. Weber, S. Meslin, J. Noudem, and X. Chaud. Hall probe\nmapping of melt processed superconductors with artificial holes. Supercond. Sci. Technol.,\n19:108, 2006.\n[15] S. Meslin, C. Harnois, C. Chubilleau, D. Horvath, D. Grossin, E. R. Suddhakar, and J. G. Noudem.\nShaping and reinforcement of melt textured YBa2 Cu3 O7−δ superconductors. Supercond. Sci.\nTechnol., 19:S585, 2006.\n[16] T. A. Prikhna, X. Chaud, W. Gawalek, A. Joulain, Y. M. Savchuk, N. V. Sergienko, V. E. Moshchil,\nT. Habisreuther, J. Rabier, S. N. Dub, V. S. Melnikov, D. Litzkendorf, P. A. Nagorny, J. Bierlich,\nV. B. Sverdun, I. Vajda, and Ksa J. Oxygenation of bulk and thin-walled MT-YBCO under\ncontrollable oxygen pressure. J. Phys. Conf. Series, 97:012023, 2007.\n[17] Ph. Laurent, J-P. Mathieu, B. Mattivi, J-F. Fagnard, S. Meslin, J.G. Noudem, M. Ausloos,\nR. Cloots, and Ph. Vanderbemden.\n\nStudy by Hall probe mapping of the trapped flux\n\nmodification produced by local heating in YBCO HTS bulks for different surface/volume ratios.\nSupercond. Sci. Technol., 18:1047, 2005.\n[18] G. P. Lousberg, M. Ausloos, Ph. Vanderbemden, and B. Vanderheyden.\n\nBulk high-Tc\n\nsuperconductors with drilled holes: how to arrange the holes to maximize the trapped magnetic\nflux? Supercond. Sci. Technol., 21:025010, 2008.\n[19] E. H. Brandt. Determination of currents in flat superconductors. Phys. Rev. B, 46:8628, 1992.\n[20] E. H. Brandt and G. P. Mikitik. Unusual critical states in type-II superconductors. Phys. Rev.\nB, 76:064526, 2007.\n[21] C. P. Bean. Magnetization of hard superconductors. Phys. Rev. Lett., 8:250, 1962.\n[22] E. H. Brandt. Susceptibility of superconductor disks and rings with and without flux creep. Phys.\nRev. B, 55:14513, 1997.\n\n\fNumerical simulation of the magnetization of high-temperature superconductors\n\n26\n\n[23] Yang Ren Sun, J. R. Thompson, D. K. Christen, J. G. Ossandon, Y. J. Chen, and A. Goyal.\nEffects of field sweep rate on the magnetization of melt-textured YBa2 Cu3 O7−δ . Phys. Rev. B,\n46:8480, 1992.\n[24] A. Gurevich and H. Kupfer. Effects of field sweep rate on the magnetization of melt-textured\nYBa2 Cu3 O7−δ . Phys. Rev. B, 46:8480, 1992.\n[25] J. Rhyner. Magnetic properties and ac-losses of superconductors with power law current-voltage\ncharacteristics. Physica C, 212:292, 1993.\n[26] J. W. Barret and L. Prigozhin. Bean's critical-state model as the p → ∞ limit of an evolutionary\np-Laplacian equation. Nonlinear Anal., 42A:977, 2000.\n[27] H.-M. Yin, B.Q. Li, and J. Zou. A degenerate evolution system modeling bean's critical-state\ntype-II superconductors. Discrete Contin. Dyn. Syst., 8:781, 2002.\n[28] K. Berger, J. Leveque, D. Netter, B. Douine, and A. Rezzoug. Ac transport losses calculation in\na Bi-2223 current lead using thermal coupling with an analytical formula. IEEE Trans. Appl.\nSupercond., 15:1508, 2005.\n[29] D. Ruiz-Alonso, T. Coombs, and A. M. Campbell. Computer modelling of high-temperature\nsuperconductors using an A-V formulation. Supercond. Sci. Technol., 17:S305, 2004.\n[30] F. Grilli, S. Stavrev, Y. Le Floch, M. Costa-Bouzo, E. Vinot, I. Klutsch, G. Meunier, P. Tixador,\nand B. Dutoit. Finite-element method modeling of superconductors: from 2-D to 3-D. IEEE\nTrans. Appl. Supercond., 15:17, 2005.\n[31] M. Amemiya, S. Murasawa, N. Banno, and K. Miyamoto. Numerical modelings of superconducting\nwires for AC loss calculation. Phys. Rev. C, 310:16, 1998.\n[32] P. Tixador, G. David, T. Chevalier, G. Meunier, and K. Berger. Thermal-electromagnetic modeling\nof superconductors. Cryogenics, 47:539, 2007.\n[33] Z. Hong, A. M. Campbell, and T. A. Coombs.\n\nNumerical solution of critical state in\n\nsuperconductivity by finite element software. Supercond. Sci. Technol., 19:1246, 2006.\n[34] R. Pecher, M. D. McCulloch, S.J. Chapman, L. Prigozhin, and C. M. Elliott. 3D-modelling of\n\n\fNumerical simulation of the magnetization of high-temperature superconductors\n\n27\n\nbulk type-II superconductors using unconstrained H-formulation. EUCAS 2003: 6th European\nConf. on Applied Superconductivity, 2003.\n[35] F. Sirois and F. Roy. Computation of 2-D current distribution in superconductors of arbitrary\nshapes using a new semi-analytical method. Phys. Rev. B, 17:3836, 2007.\n[36] K.W. Morton and D.F. Mayers. Numerical solution of partial differential equations. Cambridge\nUniversity Press, 2005.\n[37] P. Dular and C. Geuzaine. GetDP reference manual: the documentation for GetDP, a general\nenvironment for the treatment of discrete problems. 2006.\n[38] P. Dular, C. Geuzaine, A. Genon, and W. Legros. Magnetostatic field computations in terms of\ntwo-component vector potentials. IEEE Trans. Magn., 35:1682, 1999.\n[39] J. D. Jackson. Classical electrodynamics. John Wiley and Sons, 1998.\n[40] A. Bossavit. Numerical modelling of superconductors in three dimensions: a model and a finite\nelement method. IEEE Trans. Magn., 30:3363, 1994.\n[41] F. Henrotte, B. Meys, H. Hedia, P. Dular, and Legros W.\n\nFinite element modelling with\n\ntransformation techniques. IEEE Trans. Magn., 35:1434, 1999.\n[42] R. Albanese and G. Rubinacci. Magnetostatic field computations in terms of two-component\nvector potentials. Int. J. for Numerical Methods, 29:515, 1990.\n[43] M. Slodicka and A. Janikova.\n\nConvergence of the backward Euler method for type-II\n\nsuperconductors. J. Math. Anal. Appl., 342:1026, 2008.\n[44] D. A. Knoll, W. J. Rider, and G. L. Olson. An efficient nonlinear solution method for nonequilibrium radiation diffusion. J. Quant. Spectros. Radiat. Transfer, 63:15, 1999.\n[45] E. Janikova and M. Slodicka. Fully discrete linear approximation scheme for electric field diffusion\nin type-II superconductors(ACOMEN 2008, Liége, Belgium). 2008.\n[46] Y. S. Cha. Magnetic diffusion in high-Tc superconductors. Physica C, 330:1, 2000.\n[47] H. Yamasaki and Y. Mawatari. Current-voltage characteristics and flux creep in melt-textured\nYBa2 Cu3 O7−δ . Supercond. Sci. Technol., 13:202, 2000.\n\n\f"}