{"id": "http://arxiv.org/abs/0706.2841v1", "guidislink": true, "updated": "2007-06-19T17:20:02Z", "updated_parsed": [2007, 6, 19, 17, 20, 2, 1, 170, 0], "published": "2007-06-19T17:20:02Z", "published_parsed": [2007, 6, 19, 17, 20, 2, 1, 170, 0], "title": "Doppler controlled dynamics of a mirror attached to a spring", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0706.4484%2C0706.0476%2C0706.3433%2C0706.0965%2C0706.3082%2C0706.2933%2C0706.2324%2C0706.0366%2C0706.2646%2C0706.0458%2C0706.0063%2C0706.2418%2C0706.3546%2C0706.2484%2C0706.0519%2C0706.1109%2C0706.1200%2C0706.3331%2C0706.1279%2C0706.4134%2C0706.2961%2C0706.1534%2C0706.1332%2C0706.2841%2C0706.2266%2C0706.1613%2C0706.3675%2C0706.3747%2C0706.0826%2C0706.3450%2C0706.2048%2C0706.2886%2C0706.3459%2C0706.4405%2C0706.2517%2C0706.2329%2C0706.3862%2C0706.2979%2C0706.4233%2C0706.0858%2C0706.0703%2C0706.4195%2C0706.3146%2C0706.4099%2C0706.4296%2C0706.3808%2C0706.3350%2C0706.2490%2C0706.1242%2C0706.2579%2C0706.1936%2C0706.4304%2C0706.1457%2C0706.1204%2C0706.0769%2C0706.1245%2C0706.1548%2C0706.2070%2C0706.2909%2C0706.1291%2C0706.2121%2C0706.1313%2C0706.3786%2C0706.3052%2C0706.3589%2C0706.4284%2C0706.0171%2C0706.3061%2C0706.4186%2C0706.4094%2C0706.1409%2C0706.3235%2C0706.4406%2C0706.0974%2C0706.0664%2C0706.2045%2C0706.0496%2C0706.1865%2C0706.1828%2C0706.2888%2C0706.0070%2C0706.2231%2C0706.1963%2C0706.2919%2C0706.3259%2C0706.3468%2C0706.3958%2C0706.3710%2C0706.1307%2C0706.4052%2C0706.0068%2C0706.1985%2C0706.3405%2C0706.0814%2C0706.1803%2C0706.0845%2C0706.2276%2C0706.3087%2C0706.4214%2C0706.3144%2C0706.2983&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Doppler controlled dynamics of a mirror attached to a spring"}, "summary": "A laser beam directed at a mirror attached onto a flexible mount extracts\nthermal energy from its mechanical Brownian motion by Doppler effect. For a\nnormal mirror the efficiency of this Doppler cooling is very weak and masked by\nlaser shot-noise. We find that it can become very efficient using a Bragg\nmirror at the long wavelength edge of its band stop. The opposite effect of\ncooling opens new routes for optical pumping of mechanical systems: a laser\npointing at a Bragg mirror and tuned at its short wavelength edge induces\namplification of the vibrational excitation of the mirror leading eventually to\nits self-oscillation. This new effects rely on the strong dependency of the\nBragg mirror reflectivity on the wavelength.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0706.4484%2C0706.0476%2C0706.3433%2C0706.0965%2C0706.3082%2C0706.2933%2C0706.2324%2C0706.0366%2C0706.2646%2C0706.0458%2C0706.0063%2C0706.2418%2C0706.3546%2C0706.2484%2C0706.0519%2C0706.1109%2C0706.1200%2C0706.3331%2C0706.1279%2C0706.4134%2C0706.2961%2C0706.1534%2C0706.1332%2C0706.2841%2C0706.2266%2C0706.1613%2C0706.3675%2C0706.3747%2C0706.0826%2C0706.3450%2C0706.2048%2C0706.2886%2C0706.3459%2C0706.4405%2C0706.2517%2C0706.2329%2C0706.3862%2C0706.2979%2C0706.4233%2C0706.0858%2C0706.0703%2C0706.4195%2C0706.3146%2C0706.4099%2C0706.4296%2C0706.3808%2C0706.3350%2C0706.2490%2C0706.1242%2C0706.2579%2C0706.1936%2C0706.4304%2C0706.1457%2C0706.1204%2C0706.0769%2C0706.1245%2C0706.1548%2C0706.2070%2C0706.2909%2C0706.1291%2C0706.2121%2C0706.1313%2C0706.3786%2C0706.3052%2C0706.3589%2C0706.4284%2C0706.0171%2C0706.3061%2C0706.4186%2C0706.4094%2C0706.1409%2C0706.3235%2C0706.4406%2C0706.0974%2C0706.0664%2C0706.2045%2C0706.0496%2C0706.1865%2C0706.1828%2C0706.2888%2C0706.0070%2C0706.2231%2C0706.1963%2C0706.2919%2C0706.3259%2C0706.3468%2C0706.3958%2C0706.3710%2C0706.1307%2C0706.4052%2C0706.0068%2C0706.1985%2C0706.3405%2C0706.0814%2C0706.1803%2C0706.0845%2C0706.2276%2C0706.3087%2C0706.4214%2C0706.3144%2C0706.2983&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "A laser beam directed at a mirror attached onto a flexible mount extracts\nthermal energy from its mechanical Brownian motion by Doppler effect. For a\nnormal mirror the efficiency of this Doppler cooling is very weak and masked by\nlaser shot-noise. We find that it can become very efficient using a Bragg\nmirror at the long wavelength edge of its band stop. The opposite effect of\ncooling opens new routes for optical pumping of mechanical systems: a laser\npointing at a Bragg mirror and tuned at its short wavelength edge induces\namplification of the vibrational excitation of the mirror leading eventually to\nits self-oscillation. This new effects rely on the strong dependency of the\nBragg mirror reflectivity on the wavelength."}, "authors": ["Khaled Karrai", "Ivan Favero", "Constanze Metzger"], "author_detail": {"name": "Constanze Metzger"}, "author": "Constanze Metzger", "arxiv_comment": "4 pages, 1 figure", "links": [{"href": "http://arxiv.org/abs/0706.2841v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0706.2841v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "cond-mat.other", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.other", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0706.2841v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0706.2841v1", "journal_reference": null, "doi": null, "fulltext": "Doppler controlled dynamics of a mirror attached to a spring\nK.Karrai,1, ∗ I.Favero,1, † and C.Metzger1\n\narXiv:0706.2841v1 [cond-mat.other] 19 Jun 2007\n\n1\n\nCenter for Nanoscience and Fakultät für Physik, Ludwig-Maximilians-Universität,\nGeschwister-Scholl-Platz 1, 80539 München, Germany\n(Dated: 19 June 2007)\n\nA laser beam directed at a mirror attached onto a flexible mount extracts thermal energy from its\nmechanical Brownian motion by Doppler effect. For a normal mirror the efficiency of this Doppler\ncooling is very weak and masked by laser shot-noise. We find that it can become really efficient\nusing a Bragg mirror at the long wavelength edge of its band stop. The opposite effect opens new\nroutes for optical pumping of mechanical systems: a laser pointing at a Bragg mirror and tuned at\nits short wavelength edge induces amplification of the vibrational excitation of the mirror leading\neventually to its self-oscillation. This new effects rely on the strong dependency of the Bragg mirror\nreflectivity on the wavelength.\n\nRadiation pressure and even electromagnetic fluctuation of the vacuum are known to affect the dynamics of\nmirrors attached to a spring [1, 2] but less is known about\nrelativistic effects of light on such macroscopic mechanical oscillators. Recent results show that opto-mechanical\ncouplings can be exploited in a deformable Fabry-Perot\narrangement to cool down or enhance the mechanical\nfluctuations of spring loaded tiny mirrors [3]. This effect exploits the fact that inside a Fabry-Perot cavity\nthe photon-pressure reacts to any change in the mirror\nposition with a time delay given by the cavity photon\nstorage time [3, 4, 5, 6, 7]. These cavity effects, and notably the cavity laser cooling, have much analogy with\nDoppler cooling of atoms yet they do not require relativistic effects for their interpretation. In this work we\ndescribe a mechanism for true Doppler modified dynamics of a mirror thermally and mechanically anchored to\na spring. Without the use of any cavity, this mechanism\ncould allow to set optically the mirror into a regime of\nmechanical self-oscillation, simply by pointing a laser at\nit.\nA laser beam at wavelength and power P illuminates\nthe mirror of reflectivity R(λ) as schematized in fig. 1.\nThe radiation pressure acting on a moving mirror varies\nin proportion to the Doppler shift. We show here that\nbecause of this dynamics, the Brownian fluctuation of the\nsuspended mirror looses its energy to the electromagnetic\nfield. We found that the efficiency of Doppler cooling can\nbe much increased using a mirror with a large and negative gradient of R(λ). We also show that an amplification\nof the vibrational excitation can be reached for positive\nlarge enough gradient of R(λ). Large gradient of reflectivity are usually found at the edges of the band-stop of\na Bragg mirror.\nThe movable mirror of mass m is subject to a force Fph\ndue to radiation pressure. Its position x and velocity v\nof the center of mass of the mirror obey the Newton's\nequation of motion, namely m(dv/dt)+ mΓv +Kx = Fph\n+ Fth . The Langevin force Fth is introduced here in order to account for the Brownian fluctuation of the center\nmass of the mirror coupled to a thermal bath at temper-\n\nFIG. 1: (a) Schematics of a mirror of reflectivity R(λ) and\nmass m mechanically attached and thermally anchored to a\nspring of rigidity K. The friction mechanisms internal to the\nspring are responsible for losses of mechanical energy at a rate\nΓ. A laser of power P is directed at the mirror from the left.\n(b) Schematics of the reflectivity wavelength dependency of a\nBragg mirror. The gradients of R are maximized at the edges\nλB and λR of the mirror band stop.\n\nature T. The damping rate Γ of the mirror mechanical\nfluctuation is a factor characteristic of the spring holding\nthe mirror. The momentum transferred to the mirror per\nphoton is given by h̄(k0 -kR ). Here the incoming photons\nhave their wave vector k0 = 2π/λ and the reflected ones\nhave kR oriented in the opposite direction. In the reference frame of the laboratory, when the mirror moves\naway from the light source, the reflected photons have\ntheir momentum reduced by Doppler effect such kR =\n-k0 (1-2v/c). The radiation pressure is given by the rate\nof photon momentum transfer to the mirror and is also\nreduced by Doppler effect such that Fph = RdN/dt h̄(k0 kR ) where dN/dt is the number of impinging photon per\nunit time. The dependency of the radiation pressure on v\nis Fph = 2R(dN/dt)h̄k0 (1-v/c) and by making use of the\nlaser power P = h̄k0 c(dN/dt) it is also Fph = (2RP/c)(1v/c). In addition, when the mirror reflectivity is a function of λ as it is the case for a Bragg mirror operated near\nits band-stop edge, R also depends on the mirror velocity through the Doppler effect. In this case, we expand\nR[λ(v/c)] in the experimentally relevant limit of v/c ≪\n\n\f2\n1. To the first order in k, the reflectivity is R(v/c) ≃\nR0 +(v/c)λ(dR/dλ), so in the same way, to the first order in v/c the radiation pressure is Fph ≃ (2R0 P/c)[1v/c+(v/c)(λ/R0 )(dR/dλ)]. Using this expression in the\nequation of motion and grouping the velocity terms together we obtain an effective Newton equation of motion\nm(dv/dt) + mΓef f v + Kx = Fph,0 + Fth with a constant radiation pressure Fph,0 = 2R0 P/c and a Doppler\nmodified damping rate\nΓef f /Γ = 1 + (2R0 P/mc2 Γ)[1 − (λ/R0 )(dR/dλ)]\n\n(1)\n\nThe constant force Fph,0 only shifts the average position of the center of mass and will be ignored in solving\nthe effective equation of motion. For dR/dλ ≤ 0, the optical contribution to the effective dissipation term Γef f\ntakes energy away from the mechanical Brownian fluctuation and turns it irreversibly into electromagnetic energy\nthrough Doppler effect. This amounts to cooling of the\nBrownian fluctuations of the mirror. We now determine\nthe temperature of the vibrational motion of the mirror. For a harmonic oscillator the equipartition theorem\nlinks the temperature to the time averaged amplitude\nhxx∗ i of the Brownian fluctuation, namely (1/2)kB Tef f\n= (1/2)Khxx∗ i. In experimental conditions it is not the\ntemporal dependency x(t) but rather its spectral distribution xω which is typically measured. The spectrum xω\nis in fact a Fourier transform of x(t). A mathematically\nconvenient property of Fourier transformation is that the\ntime averaged value hx(t)x∗ (t)i term equals the frequency\naveraged value hxω x∗ω i. In Fourier space the Newton's\neffective equation is (-mω 2 +imΓef f ω+K)xω = Fth,ω ,\nfrom which we obtain the spectrum xω = (Fth,ω /m)/(ω 2 +iΓef f ω+K/m). Here for a non-absorbing mirror, the\nspectral decomposition Fth,ω of the thermal fluctuation\ndriving force does not depend on the light and is evaluated from the situation in dark. A reasonable guess\nabout the nature of the driving force Fth,ω is that there\nis no preferred frequency for the thermal fluctuations in\nthe range of the mirror mechanical vibrational frequencies. This is reasonable at vibrational mechanical frequency much lower compared to typical phonon frequencies with high density of phonon modes within the mirror\nmaterial (THz). Within this approximation we assume\nthe spectral power density Sth in thermal excitation of\nthe mirror to be frequency independent, such that for\nany given frequency window d the amplitude of the ther∗\nmal driving force obeys Fth,ω Fth,ω = Sth dω. Using the\nexpression of xω given above we obtain after some algebra (1/2)Khxω x∗ω i = πSth /(4mΓef f ). The left hand\nside this equation is (1/2)kB Tef f as prescribed by the\nequipartition theorem and we end up with (1/2)kB Tef f\n= πSth /(4mΓef f ). Since the spectral power density Sth\nis not light dependent, in dark we also have 1/2kB T\n= πSth /(4mΓ). Comparing both expressions we obtain\nT/Tef f =Γef f /Γ, showing that an increase in Γef f leads\n\nto cooling. This conclusion is premature because so\nfar we ignored the effect of photon shot noise. For a\ngiven laser intensity we need to include the fundamental shot-noise power fluctuation that induces a corresponding shot-noise in the radiation pressure and hence\ndriving an additional vibrational fluctuation or an added\nvibrational temperature. This added fluctuation could\ncounteract the Doppler cooling. This fluctuation force\nFshot is very much analogous to Fth but is proportional\n∗\nto square root of the laser power. Here Fshot,ω Fshot,ω\n= Sshot dω with a frequency independent power density\nSshot =(2R0 /c)2 (Phν)/2π where hν is the photon energy.\nAssuming no correlation between the Brownian and shot\nnoise, we obtain the new prescription (1/2)KTef f =\nπ(Sth + Sshot )/(4mΓef f ) leading to the expression for\nthe effective vibrational temperature:\nTef f = (T + pTphot )/(1 + p(1 − ∇R))\n\n(2)\n\nwhere we defined i) the unitless reduced laser power\np = 2R0 P/(mc2 Γ), ii) the reflectivity gradient ∇R =\n(λ/R0 )(dR/dλ) and iii) an effective photon temperature\nkB Tphot = R0 hν/2. The power dependent term in the\ndenominator originates from the Doppler effect while the\none in the numerator is due to the photon shot-noise. We\nsee that for a mirror with a constant reflectivity dR/dλ\n= 0, the Doppler effect tends to lower the effective temperature while the shot noise terms increases it. For such\na mirror, the condition Tef f < T, namely for cooling is\nonly possible when Tphot < T or R0 hν/2 < kB T. For\nvisible or near-infrared photons and for high reflectivity mirrors R0 ∼ 1, this condition cannot be satisfied at\nroom temperature. For a mirror with a large and negative reflectivity gradient however, such that ∇R < 0,\nDoppler cooling of the vibrational mode becomes possible when Tphot /(1-∇R) < T or R0 hν/[2(1-∇R)] < kB T.\nThis gives a stringent condition for the reflectivity gradient. At room temperature using 1 eV photons on a\nmirror with R0 ∼ 0.5, namely for Tphot = 2900 K, the\ncondition on the reflectivity gradient would be -∇R >\n8.7. Experimentally this can be obtained using a Bragg\nreflector and a photon wavelength tuned at the higher\nwavelength-edge of the band-stop of the reflectivity (fig.\n1b). Values as high and negative as (λ/R0 )(dR/dλ) =\n-105 are in fact within experimental reach in the visible\nand near infrared [9]. Doppler cooling saturates using\nlarge enough laser power at Tmin = Tphot /(1-∇R). With\nthe numerical example above this would be 29 mK.\nAnother interesting aspect of Bragg mirrors is that\nthey offer also the opportunity to set the gradient ∇R\npositive enough to reach Γef f ≤ 0 in equation (1). In this\nregime the mirror gains energy and starts to self-oscillate\nunder the illumination of a CW laser. It enters possibly\nin a regime of nonlinear dynamics similar to the one predicted by F. Marquardt and coworkers [7] for deformable\nFabry-Perot cavities. This effect would be interesting to\n\n\f3\ndemonstrate in this context of cavity-less system. The\ngain condition implies using a laser power large enough\nso that P/Γ > mc2 /[2R0 (∇R-1)]. The energy term P/Γ\nrepresents the laser power averaged over a mechanical\nrelaxation time constant 1/Γ. This energy is compared\nto mc2 , the relativistic energy of the mirror so we anticipate already the Doppler induced optomechanic might be\nvery weak for macroscopic mirrors. We recently prepared\na gold mirror (dR/dλ ∼ 0) mounted on silicon nano-lever\n[8] with a mass in the 10−15 Kg range. For such a mirror\nand for R0 ∼ 0.5, the condition for self-oscillation would\nbe reached when P/Γ > 90/(∇R-1). Using a damping\nrate Γ ∼ 10 sec−1 and ∇R ∼ 105 this would imply using laser power of 90 mW in order to enter a regime of\nself-oscillation. In order to increase the Doppler effect we\nsee from eq. (2) that one needs to decrease the mass m.\nFor a Bragg mirror, this can only be done within bounds\nbecause photons probe the material periodicity within\na finite penetration depth. The mass cannot arbitrarily\nreduced by thinning the material, at some point the reflectivity and its gradient will degrade. Also the lateral\ndimensions of the reflector cannot be reduced much less\nthan the diffraction limit [8]. In the visible range we anticipate that the smallest masses would be in the 10−15\nKg range.\n\nNow we compare the strength of Doppler-cooling with\ncavity cooling established in ref [3, 4, 5, 6]. A FabryPerot cavity of length L separating the mirrors and finesse F>1 stores electromagnetic energy with a typical\nring-down time-constant τ ∼ (F/π)τ0 where τ0 = L/c is\nthe photon time of flight across the cavity. τ is the typical time the cavity needs to build or loose energy upon\na sudden change in laser power or in mirror separation.\nThe photon pressure acting on the mirrors is proportional\nto the stored power so that the force acting on the mirror near a cavity resonance is not only enhanced by the\ncavity but also retarded with respect to the mirror separation fluctuation. Retarded terms amounts to velocity\ndependent force terms similarly to the Doppler effect discussed above. For a cavity with at least one of the two\nmirrors mounted on a spring, this retarded effect induces\nan optical modification of the mechanical damping rate\nand consequently a modification of the vibrational temperature the same way developed above. In order to cool\nthe vibrational fluctuations of the mirror, it is necessary\nto detune slightly the laser wavelength to the red with\nrespect to the cavity resonance [3, 4, 5, 6]. Optimum\ndetuning δ{L/λ} is obtained on the maximum slope of\nthe dependency of electromagnetic energy stored in the\ncavity with respect to wavelength or mirror\nseparation.\n√\nThis is the case when δ{L/λ} = -1/(g 3). The reverse\neffect, namely opto-mechanical excitation, is obtained for\nblue detuning. We establish the extremal effective temperatures\n\nTef f ≃ (T + pgTphot)/[1 ± p(L/λ)g 3 /(g 2 ω02 τ02 + 1)] (3)\nWhere g = 2F/π is proportional to the cavity finesse\nF. The sign depends on the side of the detuning with\nrespect to a cavity resonance. For a given vibrational\nfrequency ω0 = (K/m)1/2 it turns out that optimal cooling (or pumping) is obtained at the condition ω0 τ ∼ 1.\nIn expressing equation (3) we made the reduced power\np = 2R0 P/mc2 Γ appear explicitly in order to make a direct comparison with Doppler cooling. The term in the\ndenominator is usually much larger than unity and we see\nthat cooling efficiency using cavity effects can be made\nstronger by a factor as large as g3 (L/λ) than Doppler\ncooling. Already for a finesse as low as g = 10 and for a\nlength L = 20 000 λ, the cavity cooling can be made 107\nmore efficient than direct Doppler cooling and this considering equal mirror masses, laser powers and damping\nrates. The use of large finesses allows a significant amplification of laser cooling but at the same time imposes\nthat the moving mirror be part of a Fabry-Perot cavity\nand this is not always convenient. We stress however the\nfact that all models derived so far describing cavity cooling do not include relativistic effects. While mimicking\nit, cavity cooling cannot be interpreted as Doppler cooling. For completeness we introduced Doppler effect in\nour formalism of cavity cooling and found that it gives\nrise to corrections to the cooling efficiency that are small\nfor cavity finesses g ≫ 1 [10].\nWe finish this letter on an estimation of the cooling\npower involved with Doppler effect.\nIn dark, the mechanical fluctuation dissipates its thermal energy kB T/2 per mechanical degree of freedom and\nthis at a rate Γ. The dissipated power is there-fore\n(kB T/2)Γ and is in equilibrium with the power that feeds\nthe fluctuation. When the mirror reflects the laser light,\nthe effective vibrational mode end-temperature is Tef f .\nWhen the vibrational mode is cooled down to a temperature Tef f , the steady state heat-load in the mirror\nis (kB Tef f /2)Γ. Consequently in order to maintain a\ntemperature Tef f , the optical cooling extracts energy\nfrom the fluctuations of the mirror position at a rate\nPcooling = kB (T-Tef f )Γ/2 which is always smaller than\nkB TΓ/2. So the maximum cooling power is kB TΓ/2 both\nfor Doppler and cavity cooling. This is in the range of\n10−18 Watts at room temperature for Γ in the 103 sec−1\nrange. This might appear as a very weak cooling power\nbut it can be efficient enough to cool the lowest energy vibrational modes of an elastically suspended mirror since\nsuch modes are generally weakly coupled to the thermal\nbath.\nIn conclusion, we presented a simple formalism for laser\nDoppler cooling of the center mass fluctuation of a mirror attached to a spring. This effect is very weak but\ncan become sizeable when the mirror reflectivity is made\nto depend strongly on the photon wavelength. We also\n\n\f4\nshowed that effective temperature obtained through cavity cooling, in a formalism that does not include Doppler\neffect, mimics direct Doppler cooling but with a cavity\namplification factor which is proportional to the third\npower of the cavity finesse and can easily reach ten orders\nof magnitudes. The reciprocal effect of Doppler cooling,\nnamely Doppler optical pumping of the mirror motion,\nwas also predicted. Interestingly enough, we showed that\nthe use of an appropriate Bragg mirror should allow overcoming the shot noise limit and use directly the Doppler\neffect to set the mirror motion into self-oscillation. This\ncould provide a very simple and non-invasive method to\noptically pump the motion of tiny mechanical resonators.\nWe thank Joel Chevrier, Yann Tissot and Hans Limberger for stimulating discussions. The DFG grant\nNOMS KA 1216/2-1 supported the contribution of C.\nMetzger. The Alexander Von Humboldt foundation supported I. Favero.\n\n∗\n\nElectronic address: k.karrai@lmu.de\n\n†\n\nElectronic address: ivan.favero@physik.uni-muenchen.de\n[1] V. B. Braginsky, A. B. Manukin, Measurements of weak\nforces in Physics experiments, University of Chicago\nPress, (1977).\n[2] H. B. Chan, V. A. Aksyuk, R. N. Kleiman, D. J. Bishop,\nFederico Capasso, Science 291, 1941 (2001).\n[3] C. Metzger and K. Karrai, Nature 432, 1002 (2004).\n[4] O. Arcizet, P. F. Cohadon, T. Briant, M. Pinard, A.\nHeidmann, Nature 444, 71 (2006).\n[5] S. Gigan, H. R. Böhm, M. Paternostro, F. Blaser, G.\nLanger, J. B. Hertzberg, K. C. Schwab, D. Bäuerle, M.\nAspelmeyer, A. Zeilinger, Nature 444, 67 (2006).\n[6] A. Schliesser, P. Del'Haye, N. Nooshi, K. J. Vahala, T.\nJ. Kippenberg, Phys. Rev. Lett. 97, 243905 (2006).\n[7] F. Marquardt, J. G. E. Harris, S. M. Girvin, Phys. Rev.\nLett. 96, 103901 (2006).\n[8] I. Favero, C. Metzger, S. Camerer, D. König, H. Lorenz,\nJ. P. Kotthaus, K. Karrai, Appl. Phys. Lett. 90, 041101\n(2007).\n[9] Y. Tissot, H. Limberger, private communication.\n[10] C. Metzger, I. Favero, K. Karrai, unpublished.\n\n\f"}