{"id": "http://arxiv.org/abs/0810.1285v2", "guidislink": true, "updated": "2011-04-28T15:08:11Z", "updated_parsed": [2011, 4, 28, 15, 8, 11, 3, 118, 0], "published": "2008-10-08T19:45:01Z", "published_parsed": [2008, 10, 8, 19, 45, 1, 2, 282, 0], "title": "iCosmo: an Interactive Cosmology Package", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0810.0521%2C0810.4591%2C0810.4416%2C0810.0965%2C0810.5396%2C0810.3523%2C0810.3621%2C0810.1933%2C0810.4840%2C0810.2065%2C0810.1564%2C0810.1655%2C0810.0406%2C0810.4672%2C0810.3980%2C0810.0236%2C0810.5589%2C0810.2516%2C0810.3138%2C0810.3943%2C0810.1214%2C0810.1354%2C0810.1749%2C0810.1677%2C0810.0790%2C0810.4611%2C0810.1712%2C0810.1285%2C0810.0004%2C0810.1343%2C0810.2244%2C0810.5281%2C0810.3800%2C0810.5266%2C0810.3871%2C0810.2594%2C0810.1322%2C0810.0684%2C0810.4306%2C0810.0343%2C0810.0503%2C0810.1209%2C0810.3098%2C0810.1844%2C0810.3463%2C0810.5052%2C0810.2110%2C0810.5470%2C0810.2731%2C0810.3713%2C0810.2769%2C0810.4252%2C0810.4506%2C0810.0187%2C0810.4383%2C0810.3525%2C0810.4468%2C0810.3832%2C0810.1003%2C0810.1905%2C0810.1499%2C0810.2214%2C0810.0625%2C0810.1726%2C0810.3018%2C0810.0758%2C0810.3725%2C0810.5030%2C0810.1485%2C0810.0254%2C0810.1028%2C0810.3793%2C0810.2035%2C0810.3026%2C0810.2398%2C0810.2789%2C0810.1544%2C0810.5235%2C0810.3667%2C0810.1337%2C0810.1813%2C0810.1115%2C0810.5442%2C0810.2983%2C0810.0753%2C0810.0098%2C0810.4250%2C0810.5411%2C0810.5452%2C0810.5635%2C0810.2534%2C0810.0541%2C0810.3281%2C0810.3930%2C0810.2310%2C0810.1614%2C0810.4679%2C0810.1610%2C0810.5181%2C0810.2078%2C0810.1113&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "iCosmo: an Interactive Cosmology Package"}, "summary": "Aims: The interactive software package iCosmo, designed to perform\ncosmological calculations is described. Methods: iCosmo is a software package\nto perform interactive cosmological calculations for the low redshift universe.\nComputing distance measures, the matter power spectrum, and the growth factor\nis supported for any values of the cosmological parameters. It also computes\nderived observed quantities for several cosmological probes such as cosmic\nshear, baryon acoustic oscillations and type Ia supernovae. The associated\nerrors for these observables can be derived for customised surveys, or for\npre-set values corresponding to current or planned instruments. The code also\nallows for the calculation of cosmological forecasts with Fisher matrices which\ncan be manipulated to combine different surveys and cosmological probes. The\ncode is written in the IDL language and thus benefits from the convenient\ninteractive features and scientific library available in this language. iCosmo\ncan also be used as an engine to perform cosmological calculations in batch\nmode, and forms a convenient adaptive platform for the development of further\ncosmological modules. With its extensive documentation, it may also serve as a\nuseful resource for teaching and for newcomers in the field of cosmology.\nResults: The iCosmo package is described with various examples and command\nsequences. The code is freely available with documentation at\nhttp://www.icosmo.org, along with an interactive web interface and is part of\nthe Initiative for Cosmology, a common archive for cosmological resources.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0810.0521%2C0810.4591%2C0810.4416%2C0810.0965%2C0810.5396%2C0810.3523%2C0810.3621%2C0810.1933%2C0810.4840%2C0810.2065%2C0810.1564%2C0810.1655%2C0810.0406%2C0810.4672%2C0810.3980%2C0810.0236%2C0810.5589%2C0810.2516%2C0810.3138%2C0810.3943%2C0810.1214%2C0810.1354%2C0810.1749%2C0810.1677%2C0810.0790%2C0810.4611%2C0810.1712%2C0810.1285%2C0810.0004%2C0810.1343%2C0810.2244%2C0810.5281%2C0810.3800%2C0810.5266%2C0810.3871%2C0810.2594%2C0810.1322%2C0810.0684%2C0810.4306%2C0810.0343%2C0810.0503%2C0810.1209%2C0810.3098%2C0810.1844%2C0810.3463%2C0810.5052%2C0810.2110%2C0810.5470%2C0810.2731%2C0810.3713%2C0810.2769%2C0810.4252%2C0810.4506%2C0810.0187%2C0810.4383%2C0810.3525%2C0810.4468%2C0810.3832%2C0810.1003%2C0810.1905%2C0810.1499%2C0810.2214%2C0810.0625%2C0810.1726%2C0810.3018%2C0810.0758%2C0810.3725%2C0810.5030%2C0810.1485%2C0810.0254%2C0810.1028%2C0810.3793%2C0810.2035%2C0810.3026%2C0810.2398%2C0810.2789%2C0810.1544%2C0810.5235%2C0810.3667%2C0810.1337%2C0810.1813%2C0810.1115%2C0810.5442%2C0810.2983%2C0810.0753%2C0810.0098%2C0810.4250%2C0810.5411%2C0810.5452%2C0810.5635%2C0810.2534%2C0810.0541%2C0810.3281%2C0810.3930%2C0810.2310%2C0810.1614%2C0810.4679%2C0810.1610%2C0810.5181%2C0810.2078%2C0810.1113&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Aims: The interactive software package iCosmo, designed to perform\ncosmological calculations is described. Methods: iCosmo is a software package\nto perform interactive cosmological calculations for the low redshift universe.\nComputing distance measures, the matter power spectrum, and the growth factor\nis supported for any values of the cosmological parameters. It also computes\nderived observed quantities for several cosmological probes such as cosmic\nshear, baryon acoustic oscillations and type Ia supernovae. The associated\nerrors for these observables can be derived for customised surveys, or for\npre-set values corresponding to current or planned instruments. The code also\nallows for the calculation of cosmological forecasts with Fisher matrices which\ncan be manipulated to combine different surveys and cosmological probes. The\ncode is written in the IDL language and thus benefits from the convenient\ninteractive features and scientific library available in this language. iCosmo\ncan also be used as an engine to perform cosmological calculations in batch\nmode, and forms a convenient adaptive platform for the development of further\ncosmological modules. With its extensive documentation, it may also serve as a\nuseful resource for teaching and for newcomers in the field of cosmology.\nResults: The iCosmo package is described with various examples and command\nsequences. The code is freely available with documentation at\nhttp://www.icosmo.org, along with an interactive web interface and is part of\nthe Initiative for Cosmology, a common archive for cosmological resources."}, "authors": ["Alexandre Refregier", "Adam Amara", "Thomas Kitching", "Anais Rassat"], "author_detail": {"name": "Anais Rassat"}, "author": "Anais Rassat", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1051/0004-6361/200811112", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0810.1285v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0810.1285v2", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "6 pages including 2 tables and 4 figures. Accepted and published in\n  Astronomy and Astrophysics. Public code and further resources available at\n  http://www.icosmo.org", "arxiv_primary_category": {"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0810.1285v2", "affiliation": "CEA Saclay", "arxiv_url": "http://arxiv.org/abs/0810.1285v2", "journal_reference": "2011A&A...528A..33R", "doi": "10.1051/0004-6361/200811112", "fulltext": "c ESO 2018\n\nAstronomy & Astrophysics manuscript no. icosmo\nOctober 29, 2018\n\niCosmo: an interactive cosmology package\nA. Refregier1 , A. Amara2 , T. D. Kitching3,4 , A. Rassat1\n1\n2\n3\n4\n\nUMR 7158 (CNRS) / Service d'Astrophysique, AIM, CEA Saclay, 91191 Gif sur Yvette Cedex, France.\nInstitute for Atronomy, ETH Hoenggerberg Campus, Physics Department, CH-8093 Zurich, Switzerland.\nOxford Astrophysics, Department of Physics, Keble Road, Oxford, OX1 3RH, United Kingdom\nSUPA, University of Edinburgh, Royal Observatory Edinburgh, EH9 3HJ, United Kingdom\n\nDraft: October 29, 2018\n\narXiv:0810.1285v2 [astro-ph] 28 Apr 2011\n\nABSTRACT\n\nAims. The interactive software package iCosmo, designed to perform cosmological calculations is described.\nMethods. iCosmo is a software package to perfom interactive cosmological calculations for the low-redshift universe. Computing\ndistance measures, the matter power spectrum, and the growth factor is supported for any values of the cosmological parameters. It\nalso computes derived observed quantities for several cosmological probes such as cosmic shear, baryon acoustic oscillations, and\ntype Ia supernovae. The associated errors for these observable quantities can be derived for customised surveys, or for pre-set values\ncorresponding to current or planned instruments. The code also allows for calculation of cosmological forecasts with Fisher matrices,\nwhich can be manipulated to combine different surveys and cosmological probes. The code is written in the IDL language and thus\nbenefits from the convenient interactive features and scientific libraries available in this language. iCosmo can also be used as an\nengine to perform cosmological calculations in batch mode, and forms a convenient adaptive platform for the development of further\ncosmological modules. With its extensive documentation, it may also serve as a useful resource for teaching and for newcomers to\nthe field of cosmology.\nResults. The iCosmo package is described with a number of examples and command sequences. The code is freely available with\ndocumentation at http://www.icosmo.org, along with an interactive web interface and is part of the Initiative for Cosmology, a\ncommon archive for cosmological resources.\nKey words. cosmology – observables – numerical methods\n\n1. Introduction\nCosmology is a rapidly advancing field thanks to recent progress\nin instrumentation, numerical simulations, and theoretical methods. The last few decades have provided a previously innaccessible wealth of data with the advent of large surveys of the\ncosmic microwave background, galaxy clustering, cosmic shear,\nclusters, and supernovae (see Spergel et al. 2007; Dunkley et al.\n2009, for more recent results and references therein). One of\nthe challenges of cosmology is to link the derived observable\nquantities from these cosmological surveys with the parameters\nof an underlying cosmological model. Another necessary task\nis to predict the performance of future surveys and future observational probes in order to maximise the potential of future\nexperiments. Existing publicly available computational tools\n(Seljak & Zaldarriaga 1996; Lewis et al. 2000; Lewis & Bridle\n2002) are widely used within the cosmological community, yet\nthere is at present no a unified tool that considers the low-redshift\nuniverse and its associated probes.\nIn this paper, we present iCosmo, a software package that\nperforms interactive cosmological calculations. The code can\nalso be used as an engine to perform predictions for any cosmological model, and it also forms a convenient platform for developing further cosmological modules. With its extensive documentation, it may also serve as a useful resource for teaching\nand for newcomers in the field of cosmology.\nThe code calculates distance measures, the linear and nonlinear matter power spectrum, the growth factor, volume elements and other quantities for any CDM cosmological model.\nIt also computes derived observable quantities for several cos-\n\nmological probes such as cosmic shear, baryonic acoustic oscillations (BAO), and type Ia supernovae. The associated errors for\nthese observables can be described for arbitrary survey parameters, or alternatively, for a number of preset values corresponding to planned surveys and experiments. The code also provides\nforecasts for future cosmological surveys, by allowing the user\nto compute, manipulate, and combine Fisher matrices. The code\nis written in the IDL language, so it benefits from the simple\nsyntax, large scientific libraries and convenient interactive plotting environment of this language. In particular, all the above\ncalculations can be completed in only a few lines of code.\nThe code is freely available at http://www.icosmo.org\nwith full documentation and help files. It is part of the Initiative\nfor Cosmology web site, and it includes an interactive web interface (see description in Kitching et al. 2009).\nIn this paper, we describe the main features of iCosmo and\nprovide several examples illustrating its use. In section 2, we describe the main conventions and architecture of the code. In section 3 we describe how the code can quickly calculate the evolution of the main cosmological quantities, such as distance measures and growth factor, as a function of redshift. In section 4, we\ndescribe how iCosmo calculates the derived observable quantities for cosmic shear, BAO and type Ia supernovae. Section 5\nshows how the code can compute and manipulate Fisher matrices. Our conclusions and possible future developments are presented in section 6.\n\n\f2\n\nRefregier, Amara, Kitching, Rassat: iCosmo, an Interactive Cosmology Package\n\n2. General presentation\nThe iCosmo code is a package of routines written in the IDL\nlanguage. It is divided into several directories corresponding to\nthe different levels of the calculations:\n– general, plotting: General utility and plotting routines;\n– cosmo, expt: Routines to define fiducial cosmological and\nsurvey parameters and compute basic cosmological quantities;\n– lensing, bao, sne: Routines to compute cosmic shear, BAO\nand type Ia supernovae observables;\n– fisher: Routines to create, plot and manipulate Fisher matrices for cosmological forecasts.\nThe routines in each of the directories make use of the variable structures in IDL. Their functionality is indicated by the\nfirst few letters of their name with the following conventions:\n– set: set up basic structures with calculation variables,\n– mk: make or compute a new structure using the information\nin an input structure,\n– get: get a substructure or derived quantity from an existing\nstructure,\n– plt: plot,\n– rd, wt: read and write data from and into a file.\nA description of the main iCosmo routines and associated\ndirectories can be found in Table 1. Detailed explanations for\nany of the routines can be obtained by typing icosmo help,\n'routine name' at the IDL command line. A readme file is available in the distribution and gives installation instructions and a\nquick start tutorial.\nTable 2 shows an example of a typical call sequence for\niCosmo, with the different levels of the code separated by horizontal lines. The following sections describe the use of each\nlevel of the code with examples of call sequences and output\nfigures.\n\n– pk: Linear and non-linear matter power spectrum P(k, z) tabulated as a function of wavenumber k and redshift z.\nThe evolving scalar quantities can then be plotted easily using the plt cosmo routine (see Inst. 3 in Table 2). As an example, the following call sequence:\ni fid=set fiducial(cosmo={w0:-0.9},calc={fit tk:1})\ni cosmo=mk cosmo(fid)\ni plt cosmo,cosmo,'z','da'\nproduces figure 1 which shows the angular diameter distance\nDA (z) as a function of redshift z, defined in a flat universe by\nχ(z)\n,\nDA (z) =\n1+z\n\nχ(z) =\n\nZ\n\n0\n\nz\n\ncdz′\n,\nH(z′ )\n\n(1)\n\nwhere χ(z) represents the comoving radial distance, H(z) the\nHubble parameter, and c the speed of light. In all figures below, the fiducial cosmology is set to [h = 0.7, Ωb = 0.045, Ωm =\n0.3, ΩΛ = 0.7, w0 = −0.95, wa = 0.0, n = 1.0, τ = 0.09, σ8 =\n0.8], unless otherwise stipulated. For example, the call sequence\nabove changes w0 to −0.9, which is used in the rest of this paper.\nAs an example of the plotting functionality, the plotting routine plt pk can be used to plot the matter power spectrum P(k, z)\nas a function of wavenumber k at a redshift z, where P(k) is defined as\n\u0001\nδ(k)δ∗ (k′ ) = (2π)3 δ3 k − k′ P(k),\n\n(2)\n\nand δ(k) represents matter fluctuations in Fourier space. For example, figure 2 shows the linear and non-linear power spectrum\nat z = 0 and 1 and is produced by the additional sequence:\ni plt pk,cosmo,z=0,xran=[0.001,10.]\ni plt pk,cosmo,z=0,/over,/linear,linestyle=2\ni plt pk,cosmo,z=1,/over,color=2\ni plt pk,cosmo,z=1,/over,/linear,linestyle=2,color=2\nThe keyword over can be used to overlay several results on a\nsingle figure.\n\n3. Basic cosmological quantities\nThe first level in iCosmo defines the cosmological model\nand computes basic cosmological quantities; see, e.g., Peacock\n(1999) for their definitions and Refregier et al. (2004) for conventions. The first step is to define the fiducial parameter structure using the set fiducial function (see Inst. 1 in Table 2).\nThe resulting fid structure contains the following three substructures:\n– cosmo: input cosmological parameters,\n– expt: experiment parameters, such as survey area, number\nof galaxies or SNe as a function of redshift, or preset surveys,\n– calc: calculation parameters, such as redshift and k-range,\nfitting functions, etc.\nThese parameters have default values that can be easily modified\nusing the syntax of instruction 1 in Table 2.\nThe next step is to compute all the basic cosmological quantities using the mk cosmo function (see Inst. 2 in Table 2). The\nresulting cosmo structure is organised into several substructures:\n– const: all original fiducial quantities, as well as constant\nquantities derived from the fiducial parameters (e.g., the\nHubble radius),\n– evol: Evolving scalar quantities such as distance measures,\nthe growth factor, tabulated as a function of redshift,\n\nFig. 1. Example of an iCosmo output showing the angulardiameter distance DA (z) as a function of redshift. See text for\ncommand sequence.\n\n\fRefregier, Amara, Kitching, Rassat: iCosmo, an Interactive Cosmology Package\n\n3\n\nTable 1. Main iCosmoroutines and a brief description of their use.\nDirectory\ncosmo\nexpt\nlensing\nbao\nsne\nfisher\nplotting\n\nRoutine\nset fiducial\nmk cosmo\nget pk\nmk survey\nmk cl tomo\nmk cl cov tomo\nmk fisher lens\nmk bao\nmk bao cov\nmk fisher bao\nmk sne\nmk sne cov\nmk fisher sne\ncheck matrix\ncomb fisher\nmargin fisher\nplt cosmo\nplt pk\nplt sv\nplt cl\nplt bao\nplt sne\nplt fisher\nplt fisher 1p\nplt fisher 2p\n\nDescription\nCreate fiducial parameter structure\nCompute basic cosmological quantities\nExtracts 3D power spectrum\nCompute survey parameters\nCompute shear power spectrum\nCompute covariance errors\nCompute cosmic shear Fisher matrix and errors\nCompute BAO distance measures\nCompute BAO covariance errors\nCompute BAO Fisher matrix and errors\nCompute SNe magnitude-redshift relation\nCompute SNe covariance errors\nCompute SNe Fisher matrix\nCheck matrix is positive definite\nCombine two Fisher matrices\nMarginalise over unwanted parameters\nPlot cosmology parameters\nPlot 3D matter power spectrum\nPlot survey properties\nPlot cosmic shear correlation function\nPlot BAO distance measures\nPlot supernova magnitude-redshift relation\nPlot Fisher matrix errors (combined 1D and 2D errors)\nPlot 1D likelihood errors\nPlot 2D error ellipses\n\nTable 2. Example of a typical call sequence for iCosmo, with different levels of the code separated by horizontal lines.\n\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n\nInstruction\nfid=set fiducial(cosmo in={omega m:0.31})\ncosmo=mk cosmo(fid)\nplt cosmo,cosmo,'z','da'\nplt pk,cosmo,z=0\nsv=mk survey(fid,'sv1')\ncl=mk cl tomo(fid,cosmo,sv)\ncl cov=mk cl cov tomo(fid,cl,sv)\nplt cl,cl,[0,0],cl cov,/errors\nfish=mk fisher lens(fid,sv)\nmargin fisher,fish,fish2,[0,1,1,0,0,0,0,0]\nplt fisher 2p,fisher2\n\nDescription\nSet fiducial parameters, choosing a non-default value of the parameter Ωm\nCompute basic cosmological quantities (e.g., distance measures, power spectrum)\nPlot angular-diameter distance DA (z) as a function of redshift z\nPlot non-linear matter power spectrum P(k) at z = 0\nRead survey parameters for the preset DUNE experiment\nCompute cosmic shear power spectrum Cl\nCompute cosmic shear power spectrum errors\nPlot shear power spectrum and associated errors\nCompute Fisher matrix for the specified lensing survey\nMarginalise Fisher matrix over unwanted parameters\nPlot Fisher matrix error contraints for interesting parameters w0 and wa\n\n4. Derived cosmological observable quantities\nThe next level of iCosmo consists in the calculations of the derived observables related to different cosmological probes. At\npresent, cosmic shear, baryon acoustic oscillations, and type Ia\nsupernovae are supported. The underlying physics of each of\nthese probes is described below.\n4.1. Cosmic Shear\n\nAs light travels towards us from distant galaxies, its path is perturbed by intervening matter along the line of sight. This causes\ndistortions in the background images and is known as gravitational lensing. To first order this can be described by a distortion\nmatrix:\n!\n∂(δθi )\nκ + γ1 γ2\n≡\n,\n(3)\nΨi j ≡\nγ2 κ − γ1\n∂θ j\n\nwhere δθi (θ) is the deflection vector that results from the lensing. The distortion matrix captures two effects of gravitational\nlensing: the observed image can be dilated or contracted, which\nis described by the convergence κ, and the image can also be\nstretched and compressed along (and at 45◦ from) the x-axis,\nwhich is described by the shear component γ1 (γ2 ).\nCosmic shear - the statistical measure of shear (γ1 , γ2 ), uses\nthe two point function of the shear field as a cosmological observable, given by\nCi j (l) =\n\n9 \u0012 H0 \u0013 4 2\nΩm\n16 c\n\nZ\n\nχh\n\ndχ\n0\n\n\"\n\ngi (χ)\nar(χ)\n\n#\"\n\n#\n!\ng j (χ)\nl\nP ,χ ,\nar(χ)\nr\n\n(4)\n\nwhere the weighting function is given by\ngi (χ) =\n\nZ\n\nχ\n\nχh\n\ndχ′ ni (χ′ )\n\nr(χ)r(χ′ − χ)\n,\nr(χ′\n\n(5)\n\n\f4\n\nRefregier, Amara, Kitching, Rassat: iCosmo, an Interactive Cosmology Package\n\nPeacock et al. (2006) and Albrecht et al. (2006) concluded that\nthe measurement of the BAO scale was a fundamental tool for\nfuture precision cosmology.\nTo use the information contained in the BAO scale, it is necessary to have an estimate of the accuracy with which a given\nsurvey can measure the scale. In the current version of iCosmo,\nwe use the analytic expression derived in Blake et al. (2006)\nfor the accuracy of the measurement on the BAO scale (though\nthere are several approaches for using information from BAOs,\nas shown in Rassat et al. 2008). This analytic expression was derived from simulations and depends on the central redshift z of\nthe survey, the total volume V of the survey, and the average\nnumber density of galaxies. For the moment, photometric redshift errors are not included in the iCosmo BAO module, though\nit is given in the accuracy expression of Blake et al. (2006). The\nexpression for the accuracy measurement is given by equations\n6-9 in Blake et al. (2006).\n4.3. Type Ia Supernovae\n\nFig. 2. Matter power spectrum at z = 0 and 1, for top and bottom lines, respectively. Linear and non-linear power spectra are\nshown as dashed and solid lines. These plots were derived using\nthe plt pk routine.\n\nwhere r = DaA and DA is the angular-diameter distance. In\nEquation 4, the auto-correlation is given for i = j and the crosscorrelation for i , j, where i and j correspond to galaxy populations at different redshifts. The galaxy distribution function is\ngiven by ni (χ), i.e. the probability\nof finding a galaxy at a disR\ntance χ, and is normalised to dχni (χ) = 1.\nIn iCosmo, cosmic shear is implemented using shear\npower spectrum tomography as described in Refs. Hu\n(1999), Hu & Jain (2004), Refregier et al. (2004) and\nAmara & Réfrégier (2007). The uncertainties ∆Ci j (l) are\ncalculated under the assumption that the two-point function is\nGaussian.\n4.2. Baryon Acoustic Oscillations\n\nIn the early Universe, just before decoupling, baryons and photons were coupled through Thomson scattering and Coulomb interactions. The photon-baryon fluid was subject to two competing effects: collapse due to gravitational instability and repulsion\ndue to outward pressure. These two effects created oscillations\nin the fluctuation field, visible today in the Cosmic Microwave\nBackground (CMB, Peebles & Yu 1970; Sunyaev & Zeldovich\n1970), as well as in the galaxy distribution. In Fourier space, this\neffect corresponds to a series of acoustic peaks, dubbed Baryon\nAcoustic Oscillations (BAOs). They can be visualised by considering the ratio of a matter power spectrum with baryons, to one\nwithout: Pb (k)/Pnob (k), and in this case are also called 'wiggles'.\nBy measuring the BAOs in the matter power spectrum, it is\npossible to extract a characteristic BAO scale present in both\nthe radial (y) and tangential (y′ ) directions (see section 2.2 of\nBlake et al. 2006):\ny=\n\nr(z)\n,\ns\n\ny′ =\n\nc\n,\nH(z)s\n\n(6)\n\nwhere r(z) corresponds to the comoving radial distance, H(z)\nto the Hubble parameter, s to the comoving sound horizon\nat recombination and c to the speed of light. The reviews by\n\nType Ia supernovae are assumed in cosmology to behave as standard candles; i.e., the rate with which the brightness of a supernova declines is assumed proportional to its intrinsic luminosity.\nThus by measuring the light curves of distant supernovae, it is\npossible to measure their distance, and by obtaining spectra one\ncan compare their distance-redshift relation, which is highly dependent on cosmological parameters.\nThe derived observable for type Ia supernovae is therefore\nthe apparent magnitude m(z) at a given redshift z, related to the\nluminosity distance by\nm(z) = M + 5log10 DL (z),\n\n(7)\n\nwhere the H0 -independent luminosity distance DL (z) is given by\nDL (z) ≡ (H0 /c)(1 + z)χ(z).\n\n(8)\n\nThe normalisation parameter M is given by\nM = M − 5log10 (H0 /c) + cst,\n\n(9)\n\nwhere M is the absolute magnitude.\nThe uncertainty on the magnitude is given by Kim et al.\n(2004):\ns\n!2\n5σν\n∆m(z) = σ2m +\n+ Nz δ2m ,\n(10)\ncz ln 10\nwhere σν accounts for the scatter in peculiar velocities, σm the\nobserved variance, and Nz is the number of supernovae redshift\nbins\n4.4. Derived cosmological observables with iCosmo\n\nA typical call sequence is given in Instructions 5-8 in Table 2.\nThe sequence first defines the survey using mk survey and then\ncomputes the derived observable using mk cl tomo, mk bao,\nmk sne, for lensing tomography, BAO and SNe, respectively.\nThe statistical errors in these observables for the fiducial survey\ncan be derived using the correspondng mk cov routines listed in\nTable 1.\nAs an example, the following produces figure 3, a plot of\ncosmic shear power spectra for DUNE (Refregier et al. 2008)\nwith its associated 1σ error bars:\n\n\fRefregier, Amara, Kitching, Rassat: iCosmo, an Interactive Cosmology Package\n\ni\ni\ni\ni\ni\ni\ni\ni\n\nfid=set fiducial('DUNE', expt in={sv1 n zbin:2})\ncosmo=mk cosmo(fid)\nsv=mk survey(fid,'sv1')\ncl=mk cl tomo(fid,cosmo,sv)\ncl cov=mk cl cov tomo(fid,cl,sv)\nplt cl,cl,[1,1],cl cov,/errors,yran=[1e-7,1e-3]\nplt cl,cl,[0,1],cl cov,/errors,/over,linestyle=1\nplt cl,cl,[0,0],cl cov,/errors,/over,linestyle=2\n\nThe different power spectra correspond to two different tomographic redshift bins with median redshifts 0.68 and 1.36, as\nwell as their cross-power spectra. Similar call sequences can produce predictions and errors for the BAO distance measures and\nfor SNe Hubble diagrams.\n\n5\n\n– A cosmological model for how the observable depends on\ncosmological parameters, i.e. a model for calculating C(l) =\nC(l, θ);\n– An estimate of the uncertainty on the observable, i.e. in our\nexample an estimate of ∆C(l). This may depend on the experiment (instrument noise, shot noise, etc) as well as on the\ndata estimator (cosmic variance).\nWith the above inputs, it is possible to calculate the FIM,\nwhose components are denoted as Fi j :\n* 2 +\n∂ L\nFi j =\n,\n(11)\n∂θi ∂θ j\nwhere L = − ln L, and L = L(x, θ) is the likelihood function or\nthe probability distribution of the data x, which depends on some\ncosmological parameter set θ.\nIn practise, for a given observable C(l, θ), assumed to have\nGaussian errors, the Fisher matrix can be calculated using\nX\n∂C(l, θ) ∂C(l, θ)\n1\n.\n(12)\nFi j ≃\n2\n∂θi\n∂θ j\n[∆C(l)]\nl\nFor example, the coefficients of the Fisher matrix for the supernovae calculation is obtained by calculating (see Tegmark et al.\n1998; Huterer & Turner 2001)\n=\nFiSNIa\nj\n\nNz\nX\nz\n\nFig. 3. The cosmic shear power spectrum and associated 1σ error bars for the DUNE/Euclid cosmic shear survey for the 1st\n(upper line) and 2nd (middle line) tomographic bins (with median redshifts of 0.68 and 1.36 respectively) as well as the crosscorrelation between the bins (lower line).\n\n1\n∂m(z) ∂m(z)\n,\n[∆m(z)]2 ∂θi ∂θ j\n\n(13)\n\nwhere the sum is over redshift bin.\nWhen a vector of parameters are allowed to vary,\nmarg\nmarginalised parameter constraints ∆θi\ncan be obtained by\nq\n\u0001\nmarg\n∆θi\n≥\nF −1 ii .\n(14)\nThis equation provides a lower limit on the constraints one can\nexpect to attain for a given survey and fiducial cosmology. When\nall other cosmological parameters are fixed, the constraint on a\nparameter θifix can be estimated by\n1\n∆θifix ≥ √ .\nFii\n\n(15)\n\n5.2. Calculating Fisher Matrices with iCosmo\n\n5. Fisher Matrices\nThe final level of iCosmo is related to the computation and manipulation of Fisher matrices to assess the constraints on cosmological parameters that can be achieved with future surveys.\n5.1. The Fisher Information Matrix\n\nIt is possible to forecast the precision with which a given experiment can constrain cosmological parameters using the Fisher\nInformation Matrix (FIM, see Tegmark et al. 1997, for a detailed\nderivation). A method based on the FIM requires the following\ningredients as input:\n– A set of cosmological parameters θ = (θ1 , θ2 , ..., θi ) for which\none requires predicted constraints;\n– A choice of underlying fiducial cosmology;\n– A set of measurements x = (x1 , x2 , ..., xn), for e.g., this could\nbe the shear power spectrum C(l) over a range l = 1...n;\n\nFor this purpose, Fisher matrices can first be computed using the\nmk fisher routines for each probe (see Table 1). The computation is done by taking excursions from the fiducial cosmological model for each of the parameters of interest. Fisher matrices\ncan be combined using the combine fisher routine to derive\njoint cosmological constraints with several surveys and probes.\nThe routine margin fisher can be used to marginalise over unwanted parameters. The resulting contraints can be plotted using\nthe plt fisher routines.\nA typical call sequence to compute and plot Fisher matrices\ncan be found in instructions 9-11 in Table 2. As an example, the\nfollowing sequence computes the Fisher matrices for a DUNE\ncosmic shear survey, a full sky BAO spectroscopic survey\n(20,000 deg2 ), and their combination:\ni fid lens=set fiducial('DUNE')\ni fid bao=set fiducial('bao halfsky')\ni\n\n\f6\n\ni\ni\ni\ni\ni\ni\n\nRefregier, Amara, Kitching, Rassat: iCosmo, an Interactive Cosmology Package\n\nsv lens=mk survey(fid lens,'sv1')\nsv bao=mk survey(fid bao,'sv2')\nf lens=mk fisher lens(fid lens,sv lens)\nf bao=mk fisher bao(fid bao,sv bao)\nf comb=comb fisher(f lens,f bao)\n\nThe following call sequence produces figure 4 showing the\n68%CL constraints on the dark energy parameters ΩDE and w0\nexpected for each surveys separately (blue and red ellipse) and\njointly (solid green ellipse).\ni margin fisher,f lens,f lens2,[0,1,0,0,0,0,0,1]\ni margin fisher,f bao,f bao2,[0,1,0,0,0,1]\ni margin fisher,f comb,f comb2,[0,1,0,0,0,0,0,1]\ni plt fisher 2p,f bao2,/nofill,color=2\ni plt fisher 2p,f lens2,/nofill, $\nlinestyle=2,/over\ni plt fisher 2p,f comb2,/over,color=3\nThe margin fisher routine was used to retain only the parameters to be plotted, and marginalise over all the other parameters.\n\nFig. 4. Marginalised 68%CL constraints on the dark energy parameters ΩDE and w0 , expected for the DUNE cosmic shear\n(blue), a full sky BAO survey (red) and their combination (solid\ngreen). This figure was derived using the Fisher matrix routines\nof iCosmo.\n\n6. Conclusions\nThe iCosmo package provides a convenient and flexible interactive tool for cosmological calculations, and it can also\nbe used as a computation engine in batch mode. With all the\nbuilt-in IDL libraries, it is also a convenient platform for developing other cosmological routines and for teaching. The\ncode, along with an interactive web tool Kitching et al. (2009)\nand various cosmological resources are freely available at at\nhttp://www.icosmo.org.\n\nIn the future, we plan to add more features to the code, such\nas the halo model, higher order clustering statistics, and interfaces with CMB Boltzmann codes. Contributions from the community are encouraged.\nAcknowledgements. The authors thank the many people who have contributed to\niCosmo over the years, particularly, Richard Massey, David Bacon, Joel Berge,\nFlorian Pacaud, Romain Teyssier, Jean-Baptiste Juin, Dominique Ivon, Ivan\nDebono, Sarah Bridle, Andrew Hodgson, Benjamin Joachimi, Chaz Shapiro,\nAndy Taylor, Licia Verde, Martin Kunz, and Francisco Castander. TDK is supported by STFC Rolling Grant Number RA0888.\n\nReferences\nAlbrecht A., Bernstein G., Cahn R., et al., Sep. 2006, ArXiv Astrophysics eprints: astro-ph/0609591\nAmara A., Réfrégier A., Nov. 2007, MNRAS, 381, 1018\nBlake C., Parkinson D., Bassett B., et al., Jan. 2006, MNRAS, 365, 255\nDunkley J., Komatsu E., Nolta M.R., et al., Feb. 2009, ApJS, 180, 306\nHu W., Sep. 1999, ApJ, 522, L21\nHu W., Jain B., Aug. 2004, Phys. Rev. D, 70, 043009\nHuterer D., Turner M.S., Dec. 2001, Phys. Rev. D, 64, 123527\nKim A.G., Linder E.V., Miquel R., Mostek N., Jan. 2004, MNRAS, 347, 909\nKitching T., Amara A., Rassat A., Refregier A., Jan. 2009, ArXiv e-prints, astroph/0901.3143\nLewis A., Bridle S., 2002, Phys. Rev., D66, 103511\nLewis A., Challinor A., Lasenby A., 2000, Astrophys. J., 538, 473\nPeacock J.A., Jan. 1999, Cosmological Physics, Cosmological Physics, by\nJohn A. Peacock, pp. 704. ISBN 052141072X. Cambridge, UK: Cambridge\nUniversity Press, January 1999.\nPeacock J.A., Schneider P., Efstathiou G., et al., Oct. 2006, ESA-ESO Working\nGroup on \"Fundamental Cosmology\", Tech. rep.\nPeebles P.J.E., Yu J.T., Dec. 1970, ApJ, 162, 815\nRassat A., Amara A., Amendola L., et al., Oct. 2008, ArXiv e-prints: astroph/0810.0003\nRefregier A., Massey R., Rhodes J., et al., Jun. 2004, AJ, 127, 3102\nRefregier A., Douspis M., and the DUNE Collaboration, Aug. 2008, In: Society\nof Photo-Optical Instrumentation Engineers (SPIE) Conference Series, vol.\n7010 of Presented at the Society of Photo-Optical Instrumentation Engineers\n(SPIE) Conference\nSeljak U., Zaldarriaga M., Oct. 1996, ApJ, 469, 437\nSpergel D.N., Bean R., Doré O., Nolta M.R., et al., Jun. 2007, Apjs, 170, 377\nSunyaev R.A., Zeldovich Y.B., Apr. 1970, Ap&SS, 7, 3\nTegmark M., Taylor A.N., Heavens A.F., May 1997, ApJ, 480, 22\nTegmark M., Eisenstein D.J., Hu W., Apr. 1998, ArXiv Astrophysics e-prints:\nastro-ph/9804168\n\n\f"}