{"id": "http://arxiv.org/abs/1010.1669v2", "guidislink": true, "updated": "2011-07-18T21:23:14Z", "updated_parsed": [2011, 7, 18, 21, 23, 14, 0, 199, 0], "published": "2010-10-08T11:50:43Z", "published_parsed": [2010, 10, 8, 11, 50, 43, 4, 281, 0], "title": "Rate-Equivocation Optimal Spatially Coupled LDPC Codes for the BEC\n  Wiretap Channel", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1010.0530%2C1010.3747%2C1010.4415%2C1010.0065%2C1010.5782%2C1010.1420%2C1010.2202%2C1010.2597%2C1010.4270%2C1010.4249%2C1010.1558%2C1010.1224%2C1010.3814%2C1010.5269%2C1010.5566%2C1010.0263%2C1010.6020%2C1010.2839%2C1010.5813%2C1010.1347%2C1010.5647%2C1010.2158%2C1010.3178%2C1010.4560%2C1010.4052%2C1010.6211%2C1010.3823%2C1010.6244%2C1010.4213%2C1010.1163%2C1010.2690%2C1010.5432%2C1010.0603%2C1010.1669%2C1010.1612%2C1010.0781%2C1010.1933%2C1010.1996%2C1010.2128%2C1010.2824%2C1010.1336%2C1010.5365%2C1010.1087%2C1010.6084%2C1010.1811%2C1010.4612%2C1010.2755%2C1010.0209%2C1010.5381%2C1010.2503%2C1010.3578%2C1010.2584%2C1010.5046%2C1010.4448%2C1010.3999%2C1010.2112%2C1010.5278%2C1010.1575%2C1010.4283%2C1010.2563%2C1010.5409%2C1010.0938%2C1010.4533%2C1010.6249%2C1010.1535%2C1010.0019%2C1010.4865%2C1010.0963%2C1010.5519%2C1010.3540%2C1010.5461%2C1010.3557%2C1010.6258%2C1010.2464%2C1010.0882%2C1010.5516%2C1010.4339%2C1010.6174%2C1010.4368%2C1010.4370%2C1010.3753%2C1010.1268%2C1010.3181%2C1010.5383%2C1010.2419%2C1010.5698%2C1010.6255%2C1010.3732%2C1010.2350%2C1010.1427%2C1010.2306%2C1010.2533%2C1010.4360%2C1010.4608%2C1010.1988%2C1010.1196%2C1010.4427%2C1010.1586%2C1010.2071%2C1010.1133%2C1010.1147&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Rate-Equivocation Optimal Spatially Coupled LDPC Codes for the BEC\n  Wiretap Channel"}, "summary": "We consider transmission over a wiretap channel where both the main channel\nand the wiretapper's channel are Binary Erasure Channels (BEC). We use\nconvolutional LDPC ensembles based on the coset encoding scheme. More\nprecisely, we consider regular two edge type convolutional LDPC ensembles. We\nshow that such a construction achieves the whole rate-equivocation region of\nthe BEC wiretap channel.\n  Convolutional LDPC ensemble were introduced by Felstr\\\"om and Zigangirov and\nare known to have excellent thresholds. Recently, Kudekar, Richardson, and\nUrbanke proved that the phenomenon of \"Spatial Coupling\" converts MAP threshold\ninto BP threshold for transmission over the BEC.\n  The phenomenon of spatial coupling has been observed to hold for general\nbinary memoryless symmetric channels. Hence, we conjecture that our\nconstruction is a universal rate-equivocation achieving construction when the\nmain channel and wiretapper's channel are binary memoryless symmetric channels,\nand the wiretapper's channel is degraded with respect to the main channel.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1010.0530%2C1010.3747%2C1010.4415%2C1010.0065%2C1010.5782%2C1010.1420%2C1010.2202%2C1010.2597%2C1010.4270%2C1010.4249%2C1010.1558%2C1010.1224%2C1010.3814%2C1010.5269%2C1010.5566%2C1010.0263%2C1010.6020%2C1010.2839%2C1010.5813%2C1010.1347%2C1010.5647%2C1010.2158%2C1010.3178%2C1010.4560%2C1010.4052%2C1010.6211%2C1010.3823%2C1010.6244%2C1010.4213%2C1010.1163%2C1010.2690%2C1010.5432%2C1010.0603%2C1010.1669%2C1010.1612%2C1010.0781%2C1010.1933%2C1010.1996%2C1010.2128%2C1010.2824%2C1010.1336%2C1010.5365%2C1010.1087%2C1010.6084%2C1010.1811%2C1010.4612%2C1010.2755%2C1010.0209%2C1010.5381%2C1010.2503%2C1010.3578%2C1010.2584%2C1010.5046%2C1010.4448%2C1010.3999%2C1010.2112%2C1010.5278%2C1010.1575%2C1010.4283%2C1010.2563%2C1010.5409%2C1010.0938%2C1010.4533%2C1010.6249%2C1010.1535%2C1010.0019%2C1010.4865%2C1010.0963%2C1010.5519%2C1010.3540%2C1010.5461%2C1010.3557%2C1010.6258%2C1010.2464%2C1010.0882%2C1010.5516%2C1010.4339%2C1010.6174%2C1010.4368%2C1010.4370%2C1010.3753%2C1010.1268%2C1010.3181%2C1010.5383%2C1010.2419%2C1010.5698%2C1010.6255%2C1010.3732%2C1010.2350%2C1010.1427%2C1010.2306%2C1010.2533%2C1010.4360%2C1010.4608%2C1010.1988%2C1010.1196%2C1010.4427%2C1010.1586%2C1010.2071%2C1010.1133%2C1010.1147&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We consider transmission over a wiretap channel where both the main channel\nand the wiretapper's channel are Binary Erasure Channels (BEC). We use\nconvolutional LDPC ensembles based on the coset encoding scheme. More\nprecisely, we consider regular two edge type convolutional LDPC ensembles. We\nshow that such a construction achieves the whole rate-equivocation region of\nthe BEC wiretap channel.\n  Convolutional LDPC ensemble were introduced by Felstr\\\"om and Zigangirov and\nare known to have excellent thresholds. Recently, Kudekar, Richardson, and\nUrbanke proved that the phenomenon of \"Spatial Coupling\" converts MAP threshold\ninto BP threshold for transmission over the BEC.\n  The phenomenon of spatial coupling has been observed to hold for general\nbinary memoryless symmetric channels. Hence, we conjecture that our\nconstruction is a universal rate-equivocation achieving construction when the\nmain channel and wiretapper's channel are binary memoryless symmetric channels,\nand the wiretapper's channel is degraded with respect to the main channel."}, "authors": ["Vishwambhar Rathi", "Ruediger Urbanke", "Mattias Andersson", "Mikael Skoglund"], "author_detail": {"name": "Mikael Skoglund"}, "author": "Mikael Skoglund", "arxiv_comment": "Working paper", "links": [{"href": "http://arxiv.org/abs/1010.1669v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1010.1669v2", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "cs.IT", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cs.IT", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "math.IT", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1010.1669v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1010.1669v2", "journal_reference": null, "doi": null, "fulltext": "Rate-Equivocation Optimal Spatially Coupled LDPC Codes for the BEC Wiretap Channel\nVishwambhar Rathi∗ , Rüdiger Urbanke†, Mattias Andersson∗, and Mikael Skoglund∗\n\narXiv:1010.1669v2 [cs.IT] 18 Jul 2011\n\n∗ School\n\nof Electrical Engineering and the ACCESS Linnaeus Center,\nRoyal Institute of Technology (KTH),\nStockholm, Sweden\nEmail: {vish, amattias, skoglund@ee}.kth.se\n† School of Computer and Communication Sciences\nEPFL, Lausanne, Switzerland\nEmail: ruediger.urbanke@epfl.ch\nW\n\nX\n\nY\n\nreplacements\nAbstract-We consider transmission over aPSfrag\nwiretap\nchannel\nAlice\nBob\nBEC(ǫm )\nwhere both the main channel and the wiretapper's channel are\nBinary Erasure Channels (BEC). We use convolutional LDPC\nensembles based on the coset encoding scheme. More precisely, we\nconsider regular two edge type convolutional LDPC ensembles.\nWe show that such a construction achieves the whole rateBEC(ǫw )\nequivocation region of the BEC wiretap channel.\nConvolutional LDPC ensemble were introduced by Felström\nZ\nand Zigangirov and are known to have excellent thresholds.\nRecently, Kudekar, Richardson, and Urbanke proved that the\nphenomenon of \"Spatial Coupling\" converts MAP threshold into\nEve\nBP threshold for transmission over the BEC.\nThe phenomenon of spatial coupling has been observed to hold\nFig. 1. Wiretap channel.\nfor general binary memoryless symmetric channels. Hence, we\nconjecture that our construction is a universal rate-equivocation\nachieving construction when the main channel and wiretapper's\nchannel are binary memoryless symmetric channels, and the\nWe use the normalized equivocation Re as the performance\nwiretapper's channel is degraded with respect to the main\nmetric for secrecy,\nchannel.\n1\nI. I NTRODUCTION\nRe (Gn ) = H (W | Z) .\n(2)\nn\nThe wiretap channel was introduced by Wyner in [1]. The\nbasic diagram is depicted in Figure 1. We consider the setting The rate R of the coding scheme for the intended receiver Bob\nwhen both channels are Binary Erasure Channels (BEC). We is given by\nlog2 (|Wn |)\ndenote a BEC with erasure probability ǫ by BEC(ǫ). In a\n.\n(3)\nR(Gn ) =\nn\nwiretap channel, Alice is communicating a message W to Bob.\nThe message is uniformly chosen from the message set Wn We say that a rate-equivocation pair (R, Re ) is achievable\nand it is sent through the main channel, which is a BEC(ǫm ). using a sequence of codes Gn if\nAlice encodes W as an n bit vector X and transmits it. Bob\nlim R(Gn ) = R, lim Pe (Gn ) = 0, Re ≤ lim inf Re (Gn ).\nreceives a partially erased version of X, denote it by Y . n→∞\nn→∞\nn→∞\n(4)\nEve is observing X via the wiretapper's channel, which is\na BEC(ǫw ). Let Z denote the observation of Eve. We denote The achievable rate-equivocation pair (R, Re ) for the BECthis wiretap channel by BEC-WT(ǫm , ǫw ). In order to fulfill WT(ǫm , ǫw ) is given by [2],\nthe requirement of degradation of the wiretapper's channel\nRe ≤ R ≤ Cm , 0 ≤ Re ≤ Cm − Cw .\n(5)\nw.r.t. the main channel, we assume that ǫw ≥ ǫm . We denote\nPSfrag replacements\nthe capacity of the main channel and wiretapper's channel by\nAlice\nCm = 1 − ǫm and Cw = 1 − ǫw , respectively. The encoding\nRe\nBob\nof the message W by Alice should be such that Bob is able\nEve\nto decode W reliably and that Z provides as little information\nW\nto Eve as possible about W .\nC\nB\nCm − CX\nw\nAssume that transmission takes place using the code Gn\nY\nand let Ŵ be the message decoded by Bob. We define the\nZ\nperformance metric for reliability to be the average error\nBEC(ǫ\n)\nm\nprobability Pe (Gn ),\nBEC(ǫ\n)\n\u0010\n\u0011\nw\nX\n1\nA\nCm − Cw Cm R\nP Ŵ 6= w | W = w .\n(1)\nPe (Gn ) =\n|Wn |\nFig. 2. Achievable rate equivocation region for BEC-WT(ǫm , ǫw ).\nw∈Wn\n\n\fNote that we consider weak notion of secrecy as opposed\nIn [20] and [21] coset encoding scheme based sparse graph\nto the strong notion [3], [4].\ncodes were given. It was shown in [22] that a two edge type\nFrom Figure 2, we see that the boundary of the achievable LDPC code is a natural candidate for the coset encoding\nrate-equivocation region is composed of two branches, namely scheme and optimized degree distributions were presented. In\nAB and BC. The branch AB corresponds to achieving perfect the next section we describe our code design method using\nsecrecy, i.e., Re = R ≤ Cm − Cw . The point B corresponds spatially coupled codes.\nto the secrecy capacity, the highest rate at which perfect\nII. C ODE C ONSTRUCTION\nsecrecy is possible. The branch BC corresponds to achieving\nWe first describe the coset encoding scheme. Let H be\ninformation rates higher than secrecy capacity. However, in\nan\n(1 − r)n × n LDPC matrix and let H1 and H2 be the\nthis case some information \"leaks\" to Eve (the equivocation\nsubmatrices\nof H such that\nin this case is strictly smaller than the rate).\n\u0014 \u0015\nRecently, it has been shown that, using Arikan's polar\nH1\n,\n(6)\nH=\ncodes [5], it is possible to achieve the whole rate-equivocation\nH2\nregion [6]–[9]. In this paper, we show that convolutional\nwhere H1 is an (1 − r1 )n × n and H2 is an Rn × n matrix.\nLDPC codes achieve the whole rate-equivocation region for\n(1)\nLet Gn be the code with parity-check matrix H1 , and let\nthe BEC wiretap channel. Why might this be of interest?\n(1,2)\nbe the code whose parity-check matrix is H. Assume\nCompared to polar codes, convolutional LDPC ensembles Gn\nthat\nAlice\nwants to transmit an nR-bit message S. To do this\nhave two potential advantages. First, these codes are not only\nshe\ntransmits\nX, which is a randomly chosen solution of\nasymptotically very good but they are know to be competitive\n\u0014 \u0015\nH1\nwith the best known codes already for modest lengths. Second,\nX = [0 * * * 0S]T .\nconvolutional LDPC ensembles have the potential of being\nH2\nuniversal, i.e., one and the same code is optimal for a large As shown in [20], if H is capacity achieving over the wireclass of channels. Before discussing this point in more detail, tapper's channel then S is perfectly secure from Eve. Also, if\nPSfrag replacements\nlet us first quickly review the literature on convolutional\nLDPC\n(1)\nthe threshold of the code Gn is higher than the main channel\ncodes.\nAliceerasure probability ǫm then Bob can recover S reliably. We\nConvolutional LDPC codes were introduced by FelströmBob\ncall this wiretap code Gn .\nand Zigangirov and were shown to have excellent thresholdsEve\nThe code described by the LDPC matrix H given in (6) is\n[10]. There has been a significant amount of work done W\na two edge type LDPC code. The two types of edges are the\non convolutional-like LDPC ensembles [11]–[16], and see in X\nedges connected to check nodes in H1 and those connected\nparticular the literature review in [17]. The explanation for the Y\nto check nodes in H2 . An example of a two edge type LDPC\nexcellent performance of convolutional-like or \"spatially cou- Z\ncode is shown in Figure 3.\npled\" codes over the BEC was given by Kudekar, Richardson,\nBEC(ǫm )\nand Urbanke in [17]. (In the following, we also use theBEC(ǫ\nterm w )\nspatially coupled codes when we refer to convolutional like\ncodes.) More precisely, it was shown in [17] that the phe(l)\n(l)\n(l)\ny2\nx2\nx1\nnomenon of spatial coupling has the effect of converting MAP\n(l)\ny\n1\nthreshold of underlying ensemble to BP threshold for BEC and\nregular LDPC codes. This phenomenon has been observed to\nhold in general over Binary Memoryless Symmetric (BMS)\nType 1 checks\nType 2 checks\nchannels, see [18], [19].\nThus, when point-to-point transmission is considered over\nFig. 3. Two edge type LDPC code.\nBMS channels, regular convolutional-like LDPC ensembles\nare conjectured to be universally capacity achieving. This\nFor our purpose it is sufficient to focus on regular two edge\nis because the MAP threshold of regular LDPC ensembles type LDPC ensembles.\nconverges to the Shannon threshold for BMS channels as their\nDefinition II.1 ({l1 , l2 , r1 , r2 } Two Edge Type LDPC Enleft and right degrees are increased by keeping the rate fixed.\nsemble). A {l1 , l2 , r1 , r2 } two edge type LDPC ensemble\nTo date there is only empirical evidence for this conjecture.\nof blocklength n contains all the bipartite graphs (allowing\nBut should in the future a proof be found that spatially coupled\nmultiple edges between a variable node and a check node)\ncodes are indeed universal for point-to-point channels, then\nwhere all the n variable nodes are connected to li check\nthis would immediately imply that our construction for the\nnodes of type i and all the type i check nodes have degree\nwiretap channel is also universal.\nri , i ∈ {1, 2}.\nLet us summarize. Our two main motivations for considering code constructions for the wire-tap channel based\nA protograph of a regular two edge type LDPC code is\non spatially coupled codes is that these codes perform very shown in Figure 4.\nBased on the definition of an {l, r, L, w} ensemble from\nwell already for modest code lengths and that they have the\n[17], we define the regular spatially coupled two edge type\npotential to be universal.\n\n\fW\nX\nY\nZ\nBEC(ǫm )\nBEC(ǫw )\nType 1 checks\nType 2 checks\n(l)\nx1\n(l)\nx2\n(l)\ny1\n(l)\ny2\n\nw is a \"smoothing\" parameter. Similarly, as was remarked in\n[17], for each check node each edge is roughly independently\nchosen to be connected to one of its nearest w \"left\" neighbors.\nMore precisely, the corresponding probability deviates at most\nby a term of order 1/M from the uniform distribution.\nPSfrag replacements\nTo summarize, a {l1 , l2 , r1 , r2 , L, w} spatially coupled\nAlice\ntwo\nBobedge type LDPC ensemble is obtained by replacing the\nstandard\nregular LDPC ensemble in the (l, r, L, w) ensemble\nFig. 4. A protograph of a two edge type LDPC ensemble with l1 = l2 = 3\nEve\n(defined\nin\n[17]) by a {l1 , l2 , r1 , r2 } two edge type LDPC\nand r1 = r2 = 6.\nW\nensemble.\nThe\nspatial coupling is done such that only the\nX\nedges\nof\nthe\nsame\ntype are coupled together. An example of a\nY\nLDPC ensemble. Before giving this definition, we define T (l)\nZ\nto be the set of w-tuple of non-negative integers\nwhich sum to\nPw−1\nBEC(ǫm )\nl. More precisely, T (l) = {(t0 , * * * , tw−1 ) : j=0 tj = l}.BEC(ǫ )\nw\nRemark: Note that the w-tuple (t0 , * * * , tw−1 ) is called a type\nType 1 checks\nin [17]. We avoid this terminology as we refer to different\nType 2 checks\nedges in two edge type LDPC ensemble by their type.\n(l)\nx1\n(l)\nDefinition II.2 ({l1 , l2 , r1 , r2 , L, w} Spatially Coupled Two\nx2\n(l)\nEdge Type LDPC Ensemble). Assume that there are M\ny1\n(l)\nvariable nodes at positions [−L, L], L ∈ N. The blocklength\ny2\nof a code in the ensemble is n = M (2L + 1). Every variable\n-1\n0\n1\nnode has degree l1 with respect to type 1 edges and l2 with\nrespect to type 2 edges. At each position there are M variable Fig. 5. A coupled chain of protographs of a two edge type LDPC code with\nL = 1 for l1 = l2 = 3 and r1 = r2 = 6.\nnodes, lr11 M check nodes of type 1 which has degree r1 , and\nl2\nr2 M check nodes of type 2 which has degree r2 .\nAssume that for each variable node we order its edges in an\nprotograph of a two edge type LDPC code is shown in Figure 4\narbitrary but fixed order. A constellation c of type j is an lj and its spatially coupled version is shown in Figure 5.\ntuple, c = (c1 , * * * , clj ) with elements in {0, 1, * * * , w − 1},\nIn the next lemma we show that if the degrees of the two\nj ∈ {1, 2}. Its operational significance is that if a variable\ntypes\nof check nodes are the same, i.e. if r1 = r2 = r, then\nnode at position i has type j constellation as cj then its k-th\nthe\n{l\n1 , l2 , r, r, L, w} spatially coupled two edge type LDPC\nedge of type j is connected to a check node at position i + ck ,\nensemble\nhas the same asymptotic performance as that of the\nj ∈ {1, 2}. We denote the set of all the type j constellations\nspatially\ncoupled\nensemble (l1 + l2 , r, L, w).\nby Cj . Let τ (c) be the w-tuple which counts the occurence of\n0, 1, * * * , w − 1 in c. Clearly, if c is a type j constellation then\nτ (c) ∈ T (lj ). We impose uniform distribution over both the Lemma II.3. The {l1 , l2 , r, r, L, w} spatially coupled two\ntype of constellations. This imposes the following distribution edge type LDPC ensemble has the same BP threshold as the\nspatially coupled ensemble (l1 + l2 , r, L, w).\nover t ∈ T (lj )\np(j) (t) =\n\n|{c ∈ Cj : τ (c) = t}|\n,\nw lj\n\nj ∈ {1, 2}.\n\nNow we pick M so that M p(1) (t1 )p(2) (t2 ) is a natural number\nfor ∀t1 ∈ T (l1 ), ∀t2 ∈ T (l2 ). For each position i pick\nM p(1) (t1 )p(2) (t2 ) which have their type j edges assigned\naccording to tj , j ∈ {1, 2}. We use a random permutation\nfor each variable and type j edge over lj letters to map tj\nto a constellation, j ∈ {1, 2}. Ignoring boundry effects, for\neach check position i, the number of type j edges that come\nl\nfrom variables at position i − k, k ∈ {0, * * * , w − 1}, is M wj ,\n1\nj ∈ {1, 2}. This implies, it is exactly a fraction w of the total\nnumber M lj of sockets at position i. At the check nodes, we\ndistribute this edges by randomly choosing a permutation over\nl\nM lj letters, to the M rjj check nodes of type j, j ∈ {1, 2}.\nRemark: Each of the l1 (resp. l2 ) type 1 (resp. 2) connections of a variable node at position i is uniformly and\nindependently chosen from the range [i, . . . , i + w − 1], where\n\n(l,j)\n\nbe the average erasure probability which\nProof: Let xi\nis emitted by a variable node at position i in the lth iteration\nalong an edge of type j, j ∈ {1, 2}. For i ∈\n/ [−L, L], we set\n(l,j)\n= 0. For i ∈ [−L, L], j ∈ {1, 2}, and l = 0, we set\nxi\n(0,j)\n= ǫ.\nxi\nAs in [17], the density evolution recursion for the\n{l1 , l2 , r, r, L, w} two edge type spatially coupled LDPC\nensemble is given by\n\n(l,1)\n\nxi\n\n\n\n= ǫ 1 −\n\n\n1\nw\n\nw−1\nX\np=0\n\n1−\n\n1\nw\n\nw−1\nX\nk=0\n\n!r−1 l1 −1\n(l−1,1)\n\nx\ni+p−k\n\nw−1\nw−1\nX\n1 X (l−1,2)\n1 − 1\n1−\nxi+p−k\nw p=0\nw\nk=0\n\n!r−1 l2\n\n ,\n\n(7)\n\n\f(l,2)\nxi\n\n!r−1 l1\nw−1\nw−1\nX\nX (l−1,1)\n1\n1\n\n= ǫ 1 −\n1−\nxi+p−k\nw p=0\nw\nk=0\n\n!r−1 l2 −1\nw−1\nw−1\nX\nX (l−1,2)\n1\n1\n\n1 −\n1−\nxi+p−k\n. (8)\nw p=0\nw\n\n\nk=0\n\n(l,1)\n\n(l,2)\n\n(l−1,1)\n\n(l−1,2)\n\n. Indeed, for\n= xi\nif xi\n= xi\nHere xi\n(1,2)\n(1,1)\n= ǫ and for\n= xi\nl = 1 and i ∈ [−L, L] , xi\n(1,2)\n(1,1)\n= 0. Thus, by induction on\n= xi\ni ∈\n/ [−L, L], xi\n(l,2)\n(l,1)\n= xi . Hence we drop the\nnumber of iterations l, xi\nsuperscript corresponding to the type of edge and write the\ndensity evolution recursion as\n\n!r−1 l1 +l2 −1\nw−1\nw−1\nX\nX\n1\n1\n(l)\n(l−1)\n\nxi = ǫ 1 −\n1−\nxi+p−k\n.\nw p=0\nw\nk=0\n\n(9)\n\nThis recursion is same as that of {l1 + l2 , r, L, w} spatially\ncoupled ensemble given in [17]. This proves the lemma.\nBefore proving the main result, we show that regular two\nedge type LDPC ensembles {l1 , l2 , r, r} have the same\ngrowth rate of the average stopping set distribution as that\nof the standard regular {l1 + l2 , r} LDPC ensemble.\nLemma II.4. Consider the {l1 , l2 , r, r} regular two edge\ntype LDPC ensemble with blocklength n, l1 ≥ 3, and\npositive design rate. Let N (n, ωn) be the stopping set distribution of a randomly chosen code from this ensemble and\nlet E(N (n, ωn)) be its average. Then the growth rate of\nE(N (n, ωn)) is the same as that of the standard regular\n{l1 + l2 , r} ensemble. In particular, the minimum stopping\nset distance of the {l1 , l2 , r, r} regular two edge type LDPC\nensemble grows linearly in n.\nProof: Using standard counting arguments we obtain\nE(N (n, ωn)) =\n\u0010\n\u0011\n\u0010\n\u0011\n\u0012 \u0013 coef p(r) (x) l1rn , xωl1 n coef p(r) (x) l2rn , xωl2 n\nn\n\u0001 l2 n \u0001\n,\nl1 n\nnω\nωl1 n ωl2 n\n(10)\nwhere p(r) (x) = (1+x)r −rx. Using Stirling's approximation\nfor binomial terms and the Hayman expansion for the coef\nterm, see [23, Appendix D], we obtain\nlim\n\nn→∞\n\nln (E(N (n, nω)))\n= (1 − l1 − l2 )h(ω)\nn\n\u0010\n\u0011\nl1\n+\nln p(r) (t) − ωl1 ln(t)\nr\nl2 \u0010 (r) \u0011\nln p (t) − ωl2 ln(t),\n+\nr\n\n(11)\n\nwhere h(x) , −x ln(x)−(1−x) ln(1−x) is the binary entropy\nfunction, all the logarithms are natural logarithms, and t is a\n\npositive solution of\nx\n\n(1 + x)r−1 − 1\n= ω.\n(1 + x)r − rx\n\n(12)\n\nFrom (11), we see that the growth rate is the same as that of the\naverage stopping set distribution of the standard {l1 + l2 , r}\nregular LDPC ensemble [24, Thm. 2]. Now, the linearity of\nminimum stopping set distance immediately follows from [24,\nCor. 7].\nRemark: We could have come to this conclusion by specializing the general result contained in [25, Thm. 5]. But for\nthe convenience of the reader, and since the above proof is so\nshort, we decided to include a complete proof.\nLemma II.4 and [17, Lemma 1] imply that\n{l1 , l2 , r, r, L, w} spatially coupled two edge type LDPC\nensembles with variable node degree at least three have a\nlinear minimum stopping set distance. This gives us the\nfollowing lemma on the block error probability of the\n{l1 , l2 , r, r, L, w} ensemble under iterative decoding.\nLemma II.5. Consider transmission over the BEC(ǫ) using\nthe {l1 , l2 , r, r, L, w}, spatially coupled two edge type LDPC\nensembles with BP threshold ǫ∗ and blocklength n. Let l1 ≥ 3.\n(B)\nAssume that ǫ < ǫ∗ . Denote by Pe the block error probability under iterative decoding. Then\nlim nPe(B) = 0.\n\nn→∞\n\nProof: In fact, a much stronger result is true – the block\nerror probability converges to 0 exponentially fast. But for\nour purpose we only need that it converges to zero faster than\nlinearly.\nTo see why this is correct, fix ǫ < ǫ∗ . Then, for any δ > 0,\nthere exists an l so that after l iterations of DE, the bit error\nprobability is below δ/3. Further, for n = n(l), sufficiently\nlarge, the expected behavior over all instances of the code and\nthe channel deviates from the density evolution predictions\nby at most δ/3. Finally, by standard concentration results\n(see [23, Thm. 3.30]) it follows that the probability that a\nparticular instance deviates more than δ/3 from its average\ndecays exponentially fast in the blocklength.\nWe summarize, with a probability which converges exponentially fast (in the blocklength) to 1, an individual instance\nwill have reached a bit error probability of at most δ after a\nfixed number of iterations.\nIf δ is chosen sufficiently small, in particular smaller than\nthe relative minimum stopping set distance, then we know that\nthe decoder can correct the remaining erasures with probability\n1.\nIn the following lemma we calculate the design rate of the\nspatially coupled two edge type ensemble.\nLemma II.6 (Design Rate). The design rate of the spatially\ncoupled two edge type ensemble ({l1 , l2 , r1 , r2 , L, w}) with\n\n\fw ≤ 2L is given by\nR(l1 , l2 , r1 , r2 , L, w) =\nPw\n\u0012\n\u0013 \u0012\n\u0013\nl1\nl2\nl2 w + 1 − 2 i=0\nl1\n1−\n−\n−\n+\nr1\nr2\nr1\nr2\n2L + 1\n\n(13)\n\u0001\ni r\nw\n\n.\n\n(14)\n\nThe design rate of the coset encoding scheme for the wiretap\nchannel is given by\n\u0001r\nPw\nl2 w + 1 − 2 i=0 wi\nl2\n−\n.\n(15)\nRdes =\nr2\nr2\n2L + 1\n\nProof: Let C1 (C2 ) be the number of type one (two) check\nnodes connected to variable nodes and let V be the number\nof variable nodes. Then R(l1 , l2 , r1 , r2 , L, w) = 1 − C1 /V −\nC2 /V and Rdes = C2 /V . The calculations then follow from\nthe proof of [17, Lemma 3].\nThe number of possible messages s of the coset encoding\n(1,2)\n(1)\nscheme is given by the number of cosets of Gn in Gn . For\na standard LDPC ensemble the design rate is a lower bound on\nthe rates of the codes in the ensemble. This is not true for the\ncoset encoding scheme for the wiretap channel. For example,\n(1)\nsuppose the rate of Gn equals the design rate, but the rate of\n(1,2)\nis higher than its design rate. Then there will be fewer\nGn\ncosets than the maximum possible value. This corresponds to\nthe equation\n\u0014 \u0015\nH1\nX = [0 * * * 0S]T .\nH2\nnot having solutions for some S.\nNow, we are ready to state one of our main theorems. It\nshows that, by spatial coupling of two edge type LDPC codes,\nwe can achieve perfect secrecy (the branch AB in Figure 2),\nand in particular the secrecy capacity (the point B in Figure 2)\nof the binary erasure wiretap channel.\n\nTheorem\nII.7. Consider\ntransmission\nover\nthe\nBEC-WT(ǫm , ǫw )\nusing\nspatially\ncoupled\nregular\n{l1 , l2 , r, r, L, w} two edge type LDPC ensemble. Assume\nthat the desired rate of information transmission from Alice\nto Bob is R, R ≤ Cm − Cw . Let l1 = ⌈(1 − Cw − R)r⌉\nand l2 = ⌈(1 − Cw )r⌉ − ⌈(1 − Cw − R)r⌉. Let Re be\nthe average (over the channel and ensemble) equivocation\nachieved for the wiretapper. Then,\nlim lim lim\n\nlim E (Pe (Gn )) = 0,\n\nr→∞ w→∞ L→∞ M→∞\n\nlim lim lim\n\nlim Re = R.\n\nr→∞ w→∞ L→∞ M→∞\n\nLet R(Gn ) be the rate from Alice to Bob of a randomly chosen\ncode in the ensemble. Then\nlim lim lim\n\nlim Pr(R(Gn ) < R) = 0.\n\nr→∞ w→∞ L→∞ M→∞\n\nProof: We first show that the rate from Alice to Bob is R\n(1,2)\nalmost surely. Let Gn\nbe a two edge type spatially coupled\n(1)\ncode, and let Gn be the code induced by its type 1 edges\nonly. Then\n(1,2)\nR(Gn ) = R(G(1)\n).\nn ) − R(Gn\n\n(16)\n\nSince both the two edge type spatially coupled ensemble\nand the ensemble induced by its type 1 edges are capacity\nachieving we must have\nlim lim lim\n\nlim Pr(R(G(1)\nn ) > Cw + R) = 0,\n\n(17)\n\nlim Pr(R(G(1,2)\n) > Cw ) = 0.\nn\n\n(18)\n\nr→∞ w→∞ L→∞ M→∞\n\nlim lim lim\n\nr→∞ w→∞ L→∞ M→∞\n\nThis implies\nlim lim lim\n\nlim Pr(R(Gn ) < R) = 0.\n\nr→∞ w→∞ L→∞ M→∞\n\n(19)\n\nThe reliability part easily follows from the capacity achieving\nproperty of the spatially coupled ensemble. This is because the\nrate of the ensemble corresponding to type 1 edges approaches\nCw + R. As this ensemble is capacity achieving, its threshold\nis 1 − Cw − R. As R < Cm − Cw , we see that the threshold\nis greater than ǫm . This proves reliability.\nTo bound the equivocation of Eve, using the chain rule we\nexpand the mutual information I(X, S; Z) in two different\nways\nI(X, S; Z) = I(X; Z) + I(S; Z | X)\n= I(S; Z) + I(X; Z | S).\n\n(20)\n(21)\n\nAs S → X → Z is a Markov chain, I (S; Z | X) = 0. Using\nI(S; Z) = H(S) − H(S | Z), we obtain,\n1\n1\nH(S | Z) = (H(S) + I(X; Z | S) − I(X; Z)) (22)\nn\nn\n1\n= (H(S) + H(X | S) − H(X | Z, S))\nn\nI(X; Z)\n−\n(23)\nn\n1\n≥ (H(X) − H(X | Z, S)) − Cw ,\n(24)\nn\nwhere we have used that H(S) + H(X | S) = H(S, X) =\nH(X) and that I(X; Z)/n ≤ Cw .\nSince the ensemble induced by type 1 edges is capacity\nachieving its rate must equal its design rate asymptotically, so\nlim lim lim lim H(X)/n = R + Cw .\n\nr→∞ w→∞ L→∞ n→∞\n\n(25)\n\nDenote the block error probability of decoding X from Z\nand S by Pe (X | S, Z). From Fano's inequality we obtain,\nH(X | S, Z)\nh(Pe (X | S, Z))\n≤\n+ Pe (X | S, Z)(1 − ǫw ).\nn\nn\n(26)\nNote that, as the two edge type spatially coupled construction is capacity achieving over the wiretapper's channel,\nlimr→∞ limw→∞ limL→∞ limM→∞ Pe (X | S, Z) = 0.\nWe now obtain the desired bound on the equivocation\nby substituting (26) and (25) in (24), and taking the limit\nr, w, L, M → ∞.\nNote that in the previous theorem our requirement was to\nhave perfect secrecy. Hence we constructed spatially coupled\ntwo edge type matrix such that it was capacity achieving over\nthe wiretapper's channel. In the next theorem we prove that\nusing spatially coupled two edge LDPC codes, it is possible\n\n\fto achieve an information rate equal to Cm , the capacity of\nthe main channel, and equivocation equal to Cm − ǫw .\nTheorem\nII.8. Consider\ntransmission\nover\nthe\nBEC-WT(ǫm , ǫw )\nusing\nspatially\ncoupled\nregular\n{l1 , l2 , r, r, L, w} two edge type LDPC ensemble. Assume\nthat the desired rate of information transmission from Alice to\nBob is R, R > Cm −Cw and R ≤ Cm . Let l1 = ⌈(1 − Cm )r⌉\nand l2 = ⌈Rr⌉. Let Re be the average (over the channel and\nensemble) equivocation achieved for the wiretapper. Then,\nlim lim lim\n\nlim E (Pe (Gn )) = 0,\n\nlim lim lim\n\nlim Re = Cm − Cw .\n\nr→∞ w→∞ L→∞ M→∞\n\nr→∞ w→∞ L→∞ M→∞\n\nLet R(Gn ) be the rate from Alice to Bob of a randomly chosen\ncode in the ensemble. Then\nlim lim lim\n\nlim Pr(R(Gn ) < R) = 0.\n\nr→∞ w→∞ L→∞ M→∞\n\nProof: The proof that the rate is R asymptotically is the\nsame as in the proof of Theorem II.7.\nThe reliability part easily follows from the capacity achieving property of the spatially coupled ensemble corresponding\nto type 1 edges. This is because the rate of the ensemble corresponding to type 1 edges approaches Cm . As this ensemble is\ncapacity achieving, its threshold is ǫm . This proves reliability.\nThe proof for equivocation is very similar to that of Theorem II.7. From (24), we know\n1\n1\n(27)\nH(S | Z) ≥ (H(X) − H(X | Z, S)) − Cw .\nn\nn\nSince the code induced by type 1 edges is capacity achieving\nwe have\nlim lim lim lim H(X)/n = Cm .\n\nr→∞ w→∞ L→∞ n→∞\n\n(28)\n\nNote that as the two edge type code has rate Cm − R and is\ncapacity achieving, its threshold for the BEC is 1 − Cm + R.\nAs R > Cm − Cw , the threshold is higher than ǫw . As in\nTheorem II.7, given S the error probability of decoding X\nfrom Z, denoted by, Pe (X | S, Z) goes to zero. Thus (26)\nholds and we obtain\nH(X | S, Z)\nlim lim lim lim\n= 0.\n(29)\nr→∞ w→∞ L→∞ M→∞\nn\nWe obtain the desired bound on the equivocation by substituting (28) and (29) in (27), and taking the limit r, w, L, M →\n∞.\nIII. N UMERICAL R ESULTS\nWe have rigorously shown the optimality of the\n{l1 , l2 , r1 , r2 , L, w} ensemble. In this section, we briefly\ndiscuss the performance of the {l1 , l2 , r1 , r2 , L} ensemble,\nwhich is the two edge type extension of the {l, r, L} ensemble\ndiscussed in [17, Sec. II.A]. Based on the method in [22], we\nnumerically evaluate the equivocation of the {3, 3, 6, 12, L}\nensemble for the BEC-WT(0.5, 0.75). The results are given\nin Table I. We observe that as L increases, the equivocation\nRe converges to R, the rate from Alice to Bob. Thus, the\n\noptimality of secrecy performance of the {l1 , l2 , r1 , r2 , L}\nensemble seems to hold for the wiretap channel. The optimality of reliability performance has been conjectured to hold in\n[17].\nL\nR\nRe\n\n20\n0.2622\n0.2276\n\n30\n0.2582\n0.235\n\n40\n0.2562\n0.2387\n\n50\n0.255\n0.241\n\n60\n0.2541\n0.2425\n\n70\n0.2535\n0.2436\n\nTABLE I\nR ATE FROM A LICE TO B OB (R) AND EQUIVOCATION OF E VE (Re ) FOR\nDIFFERENT VALUES OF L, M = 1000 FOR {3, 3, 6, 12, L} ENSEMBLE .\n\nIV. C ONCLUSION\nWe showed how to achieve the whole rate-equivocation\nregion using spatially coupled regular two edge type LDPC\ncodes over the binary erasure wiretap channel. As the spatially\ncoupled two edge type LDPC codes are conjectured to achieve\ncapacity over general BMS channels, we conjecture that our\ncode construction is also universally optimal for the class\nof wiretap channel where the main channel and wiretapper's\nchannel are BMS channels and wiretapper's channel is physically degraded with respect to the main channel.\nR EFERENCES\n[1] A. D. Wyner, \"The wire-tap channel,\" Bell. Syst. Tech. J., vol. 54, no. 8,\npp. 1355–1387, Oct. 1975.\n[2] I. Csiszár and J. Körner, \"Broadcast channels with confidential messages,\" Information Theory, IEEE Transactions on, vol. 24, no. 3, pp.\n339 – 348, may 1978.\n[3] U. Maurer and S. Wolf, \"Information-theoretic key agreement: from\nweak to strong secrecy for free,\" in EUROCRYPT'00: Proceedings\nof the 19th international conference on Theory and application of\ncryptographic techniques. Berlin, Heidelberg: Springer-Verlag, 2000,\npp. 351–368.\n[4] Y. Liang, H. V. Poor, and S. Shamai (Shitz), \"Information theoretic\nsecurity,\" Foundations and Trends in Communications and Information\nTheory, vol. 5, no. 4-5, pp. 355–580, 2009.\n[5] E. Arikan, \"Channel polarization: A method for constructing capacityachieving codes for symmetric binary-input memoryless channels,\"\nInformation Theory, IEEE Transactions on, vol. 55, no. 7, pp. 3051\n–3073, july 2009.\n[6] M. Andersson, V. Rathi, R. Thobaben, J. Kliewer, and M. Skoglund,\n\"Nested polar codes for wiretap and relay channels,\" Communications\nLetters, IEEE, vol. 14, no. 8, pp. 752 –754, aug. 2010.\n[7] E. Hof and S. Shamai, \"Secrecy-Achieving Polar-Coding for BinaryInput Memoryless Symmetric Wire-Tap Channels,\" ArXiv e-prints, May\n2010.\n[8] H. Mahdavifar and A. Vardy, \"Achieving the Secrecy Capacity of\nWiretap Channels Using Polar Codes,\" in International Symposium on\nInformation Theory (ISIT), Austin, USA, jun 2010.\n[9] O. O. Koyluoglu and H. El Gamal, \"Polar Coding for Secure Transmission and Key Agreement,\" ArXiv e-prints, Mar. 2010.\n[10] A. J. Felstrom and K. S. Zigangirov, \"Time-varying periodic convolutional codes with low-density parity-check matrix,\" Information Theory,\nIEEE Transactions on, vol. 45, no. 6, pp. 2181 –2191, sep 1999.\n[11] K. Engdahl and K. S. Zigangirov, \"On the theory of low-density\nconvolutional codes I,\" Problemy Peredachi Informatsii, vol. 35, pp. 12–\n27, 1999.\n[12] M. Lentmaier, D. V. Truhachev, and K. S. Zigangirov, \"On the theory of\nlow-density convolutional codes II,\" Problm. Inf. Transm., vol. 35, pp.\n12–27, 1999.\n[13] R. M. Tanner, D. Sridhara, A. Sridharan, T. E. Fuja, and D. J. Costello,\nJr., \"LDPC block and convolutional codes based on circulant matrices,\"\nIEEE Trans. Inform. Theory, vol. 50, pp. 2966–2984, 2004.\n[14] A. Sridharan, M. Lentmaier, D. J. Costello, Jr., and K. S. Zigangirov,\n\"Convergence analysis of a class of LDPC convolutional codes for the\nerasure channel,\" in Proc. of the Allerton Conf. on Commun., Control,\nand Computing, Monticello, IL, USA, Oct. 2004.\n\n\f[15] M. Lentmaier, A. Sridharan, K. S. Zigangirov, and D. J. Costello,\nJr., \"Terminated LDPC Convolutional Codes with Thresholds Close to\nCapacity,\" ArXiv Computer Science e-prints, Aug. 2005.\n[16] M. Lentmaier, G. P. Fettweis, K. S. Zigangirov, and D. J. Costello,\nJr., \"Approaching capacity with asymptotically regular LDPC codes,\" in\nInformation Theory and Applications Workshop, 2009, 8-13 2009, pp.\n173 –177.\n[17] S. Kudekar, T. Richardson, and R. Urbanke, \"Threshold Saturation via\nSpatial Coupling: Why Convolutional LDPC Ensembles Perform so well\nover the BEC,\" ArXiv e-prints, Jan. 2010.\n[18] S. Kudekar, C. Measson, T. Richardson, and R. Urbanke, \"Threshold\nSaturation on BMS Channels via Spatial Coupling,\" ArXiv e-prints, Apr.\n2010.\n[19] M. Lentmaier, D. G. M. Mitchel, G. Fettweis, and D. J. Costello, Jr.,\n\"Asymptotically good LDPC convolutional codes with AWNG channel\nthresholds close to the Shannon limit,\" in 6th Intern. Symp. on Turbo\nCodes and iterative inform. Processing, 2010.\n[20] A. Thangaraj, S. Dihidar, A. Calderbank, S. McLaughlin, and J.M. Merolla, \"Applications of LDPC codes to the wiretap channel,\"\nInformation Theory, IEEE Transactions on, vol. 53, no. 8, pp. 2933–\n2945, Aug. 2007.\n[21] R. Liu, H. V. Poor, P. Spasojevic, and Y. Liang, \"Nested codes for secure\ntransmission,\" in Proc. Personal, Indoor and Mobile Radio Communications, 2008. PIMRC 2008. IEEE 19th International Symposium on,\nSept. 2008, pp. 1–5.\n[22] V. Rathi, M. Andersson, R. Thobaben, J. Kliewer, and M. Skoglund,\n\"Performance Analysis and Design of Two Edge Type LDPC Codes for\nthe BEC Wiretap Channel,\" ArXiv e-prints, Sept. 2010.\n[23] T. Richardson and R. Urbanke, Modern Coding Theory.\nCambridge\nUniversity\nPress,\n2008.\n[Online].\nAvailable:\nhttp://www.cambridge.org/catalogue/catalogue.asp?isbn=9780521852296\n[24] A. Orlitsky, K. Viswanathan, and J. Zhang, \"Stopping set distribution\nof LDPC code ensembles,\" IEEE Trans. Inform. Theory, vol. 51, pp.\n929–953, 2005.\n[25] K. Kasai, T. Awano, D. Declercq, C. Poulliat, and K. Sakaniwa, \"Weight\ndistributions of multi-edge type LDPC codes,\" in ISIT'09: Proceedings\nof the 2009 IEEE international conference on Symposium on Information\nTheory. Piscataway, NJ, USA: IEEE Press, 2009, pp. 60–64.\n\n\f"}