{"id": "http://arxiv.org/abs/0704.1191v2", "guidislink": true, "updated": "2007-08-09T05:56:23Z", "updated_parsed": [2007, 8, 9, 5, 56, 23, 3, 221, 0], "published": "2007-04-10T06:28:45Z", "published_parsed": [2007, 4, 10, 6, 28, 45, 1, 100, 0], "title": "Five Intermediate-Period Planets from the N2K Sample", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0704.0913%2C0704.0562%2C0704.3075%2C0704.1043%2C0704.3352%2C0704.1817%2C0704.2800%2C0704.1884%2C0704.3284%2C0704.3697%2C0704.1087%2C0704.2940%2C0704.2717%2C0704.2730%2C0704.3914%2C0704.1372%2C0704.3593%2C0704.2704%2C0704.3259%2C0704.1460%2C0704.3470%2C0704.3809%2C0704.3116%2C0704.0629%2C0704.2053%2C0704.1957%2C0704.1296%2C0704.0235%2C0704.0420%2C0704.3207%2C0704.2379%2C0704.3886%2C0704.3478%2C0704.2036%2C0704.1138%2C0704.2898%2C0704.0271%2C0704.2745%2C0704.3515%2C0704.1373%2C0704.3904%2C0704.0752%2C0704.2090%2C0704.0055%2C0704.0627%2C0704.0470%2C0704.0017%2C0704.1762%2C0704.2187%2C0704.2168%2C0704.2556%2C0704.1456%2C0704.3896%2C0704.2534%2C0704.2880%2C0704.2903%2C0704.0921%2C0704.2056%2C0704.0569%2C0704.3674%2C0704.3415%2C0704.0871%2C0704.2926%2C0704.1550%2C0704.2919%2C0704.2367%2C0704.2494%2C0704.1548%2C0704.0765%2C0704.0049%2C0704.2946%2C0704.3662%2C0704.1644%2C0704.2614%2C0704.3217%2C0704.1479%2C0704.1561%2C0704.0597%2C0704.1580%2C0704.3511%2C0704.3377%2C0704.3359%2C0704.2831%2C0704.1191%2C0704.0045%2C0704.3846%2C0704.2373%2C0704.3408%2C0704.3891%2C0704.0512%2C0704.1431%2C0704.1698%2C0704.1619%2C0704.1731%2C0704.2961%2C0704.1588%2C0704.2638%2C0704.0813%2C0704.0242%2C0704.1773%2C0704.2441&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Five Intermediate-Period Planets from the N2K Sample"}, "summary": "We report the detection of five Jovian mass planets orbiting high metallicity\nstars. Four of these stars were first observed as part of the N2K program and\nexhibited low RMS velocity scatter after three consecutive observations.\nHowever, follow-up observations over the last three years now reveal the\npresence of longer period planets with orbital periods ranging from 21 days to\na few years. HD 11506 is a G0V star with a planet of \\msini = 4.74 \\mjup in a\n3.85 year orbit. HD 17156 is a G0V star with a 3.12 \\mjup planet in a 21.2 day\norbit. The eccentricity of this orbit is 0.67, one of the highest known for a\nplanet with a relatively short period. The orbital period for this planet\nplaces it in a region of parameter space where relatively few planets have been\ndetected. HD 125612 is a G3V star with a planet of \\msini = 3.5 \\mjup in a 1.4\nyear orbit. HD 170469 is a G5IV star with a planet of \\msini = 0.67 \\mjup in a\n3.13 year orbit. HD 231701 is an F8V star with planet of 1.08 \\mjup in a 142\nday orbit. All of these stars have supersolar metallicity. Three of the five\nstars were observed photometrically but showed no evidence of brightness\nvariability. A transit search conducted for HD 17156 was negative but covered\nonly 25% of the search space and so is not conclusive.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0704.0913%2C0704.0562%2C0704.3075%2C0704.1043%2C0704.3352%2C0704.1817%2C0704.2800%2C0704.1884%2C0704.3284%2C0704.3697%2C0704.1087%2C0704.2940%2C0704.2717%2C0704.2730%2C0704.3914%2C0704.1372%2C0704.3593%2C0704.2704%2C0704.3259%2C0704.1460%2C0704.3470%2C0704.3809%2C0704.3116%2C0704.0629%2C0704.2053%2C0704.1957%2C0704.1296%2C0704.0235%2C0704.0420%2C0704.3207%2C0704.2379%2C0704.3886%2C0704.3478%2C0704.2036%2C0704.1138%2C0704.2898%2C0704.0271%2C0704.2745%2C0704.3515%2C0704.1373%2C0704.3904%2C0704.0752%2C0704.2090%2C0704.0055%2C0704.0627%2C0704.0470%2C0704.0017%2C0704.1762%2C0704.2187%2C0704.2168%2C0704.2556%2C0704.1456%2C0704.3896%2C0704.2534%2C0704.2880%2C0704.2903%2C0704.0921%2C0704.2056%2C0704.0569%2C0704.3674%2C0704.3415%2C0704.0871%2C0704.2926%2C0704.1550%2C0704.2919%2C0704.2367%2C0704.2494%2C0704.1548%2C0704.0765%2C0704.0049%2C0704.2946%2C0704.3662%2C0704.1644%2C0704.2614%2C0704.3217%2C0704.1479%2C0704.1561%2C0704.0597%2C0704.1580%2C0704.3511%2C0704.3377%2C0704.3359%2C0704.2831%2C0704.1191%2C0704.0045%2C0704.3846%2C0704.2373%2C0704.3408%2C0704.3891%2C0704.0512%2C0704.1431%2C0704.1698%2C0704.1619%2C0704.1731%2C0704.2961%2C0704.1588%2C0704.2638%2C0704.0813%2C0704.0242%2C0704.1773%2C0704.2441&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We report the detection of five Jovian mass planets orbiting high metallicity\nstars. Four of these stars were first observed as part of the N2K program and\nexhibited low RMS velocity scatter after three consecutive observations.\nHowever, follow-up observations over the last three years now reveal the\npresence of longer period planets with orbital periods ranging from 21 days to\na few years. HD 11506 is a G0V star with a planet of \\msini = 4.74 \\mjup in a\n3.85 year orbit. HD 17156 is a G0V star with a 3.12 \\mjup planet in a 21.2 day\norbit. The eccentricity of this orbit is 0.67, one of the highest known for a\nplanet with a relatively short period. The orbital period for this planet\nplaces it in a region of parameter space where relatively few planets have been\ndetected. HD 125612 is a G3V star with a planet of \\msini = 3.5 \\mjup in a 1.4\nyear orbit. HD 170469 is a G5IV star with a planet of \\msini = 0.67 \\mjup in a\n3.13 year orbit. HD 231701 is an F8V star with planet of 1.08 \\mjup in a 142\nday orbit. All of these stars have supersolar metallicity. Three of the five\nstars were observed photometrically but showed no evidence of brightness\nvariability. A transit search conducted for HD 17156 was negative but covered\nonly 25% of the search space and so is not conclusive."}, "authors": ["Debra A. Fischer", "Steven S. Vogt", "Geoffrey W. Marcy", "R. Paul Butler", "Bun'ei Sato", "Gregory W. Henry", "Sarah Robinson", "Gregory Laughlin", "Shigeru Ida", "Eri Toyota", "Masashi Omiya", "Peter Driscoll", "Genya Takeda", "Jason T. Wright", "John A. Johnson"], "author_detail": {"name": "John A. Johnson"}, "author": "John A. Johnson", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1086/521869", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0704.1191v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0704.1191v2", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "13 pages, 9 figures, accepted ApJ Resubmitted here with some\n  additional data, modified Keplerian orbits", "arxiv_primary_category": {"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0704.1191v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0704.1191v2", "journal_reference": null, "doi": "10.1086/521869", "fulltext": "to appear in ApJ\n\narXiv:0704.1191v2 [astro-ph] 9 Aug 2007\n\nFive Intermediate-Period Planets from the N2K Sample\n\n1,2\n\nDebra A. Fischer3 , Steven S. Vogt4 , Geoffrey W. Marcy5 , R. Paul Butler6 , Bun'ei Sato7 ,\nGregory W. Henry8 , Sarah Robinson4 , Gregory Laughlin4 , Shigeru Ida7 , Eri Toyota9\nMasashi Omiya10 Peter Driscoll11 , Genya Takeda12 , Jason T. Wright5 , John A. Johnson5\nfischer@stars.sfsu.edu\n\nABSTRACT\nWe report the detection of five Jovian mass planets orbiting high metallicity\nstars. Four of these stars were first observed as part of the N2K program and\nexhibited low RMS velocity scatter after three consecutive observations. However, follow-up observations over the last three years now reveal the presence of\n1\n\nBased on observations obtained at the W. M. Keck Observatory, which is operated by the University of\nCalifornia and the California Institute of Technology. Keck time has been granted by NOAO and NASA.\n2\n\nBased on observations obtained at the Subaru Telescope, which is operated by the National Astronomical\nObservatory of Japan\n3\n\nDepartment of Physics & Astronomy, San Francisco State University, San Francisco, CA 94132; fischer@stars.sfsu.edu\n4\n\nUCO/Lick Observatory, University of California at Santa Cruz, Santa Cruz, CA 95064\n\n5\n\nDepartment of Astronomy, University of California, Berkeley, CA USA 94720\n\n6\n\nDepartment of Terrestrial Magnetism, Carnegie Institute of Washington DC, 5241 Broad Branch Rd.\nNW, Washington DC, USA 20015-1305\n7\n\nTokyo Institute of Technology, 2-12-1 Okayama, Meguro-ku, Tokyo 152-8550, Japan\n\n8\n\nCenter of Excellence in Information Systems, Tennessee State University, 3500 John A. Merritt Blvd.,\nBox 9501, Nashville, TN 37209\n9\n\nDepartment of Earth and Planetary Sciences, Graduate School of Science, Kobe University, 1-1 Rokkodai,\nNada, Kobe 657-8501, Japan\n10\n\nDepartment of Physics, Tokai University, 1117 Kitakaname, Hiratsuka, Kanagawa 259-1292, Japan\n\n11\n\nDepartment of Earth and Planetary Sciences, Johns Hopkins University, Baltimore, MD 21218\n\n12\n\nDepartment of Physics and Astronomy, Northwestern University, 2145 Sheridan Road, Evanston, IL\n60208\n\n\f–2–\nlonger period planets with orbital periods ranging from 21 days to a few years.\nHD 11506 is a G0V star with a planet of M sin i = 4.74 MJUP in a 3.85 year\norbit. HD 17156 is a G0V star with a 3.12 MJUP planet in a 21.2 day orbit. The\neccentricity of this orbit is 0.67, one of the highest known for a planet with a\nrelatively short period. The orbital period for this planet places it in a region of\nparameter space where relatively few planets have been detected. HD 125612 is a\nG3V star with a planet of M sin i = 3.5 MJUP in a 1.4 year orbit. HD 170469 is a\nG5IV star with a planet of M sin i = 0.67 MJUP in a 3.13 year orbit. HD 231701\nis an F8V star with planet of 1.08 MJUP in a 142 day orbit. All of these stars\nhave supersolar metallicity. Three of the five stars were observed photometrically\nbut showed no evidence of brightness variability. A transit search conducted for\nHD 17156 was negative but covered only 25% of the search space and so is not\nconclusive.\nSubject headings: planetary systems – stars: individual (HD 11506, HD 17156,\nHD 125612, HD 170469, HD 231701)\n\n1.\n\nIntroduction\n\nOngoing Doppler surveys of stars closer than 150 pc have detected more than 200\nexoplanets (Butler et al. 2006, Wright et al. 2007). This ensemble of exoplanets exhibit a\ndiverse range of statistical characteristics (Marcy et al. 2005). Notably, the mass distribution\nof exoplanets falls exponentially for masses greater than one Jupiter-mass. In addition, there\nis a statistical pile-up of planets in orbits of just a few days, a paucity of planets with periods\nbetween 10 - 100 days, and a rising number of gas giant planets found at separations greater\nthan 1 AU. Orbital eccentricities span a surprising range from 0 - 0.93, although 92% of\nplanet eccentricities are less than 0.6 and even for planets with periods longer than five days\n(i.e., not tidally circularized) the median exoplanet eccentricity is 0.26.\nIt has also been shown that planet formation is tied to the chemical composition of the\nhost star. There is a few percent probability of finding a gas giant planet around a solar\nmetallicity star, while planet occurrence rises dramatically to ∼ 25% for stars with three\ntimes the heavy metal composition of the Sun (Santos et al. 2005, Fischer & Valenti 2005).\nIda & Lin (2004) have accounted for this metallicity correlation within the context of core\naccretion.\nThe statistical characteristics of exoplanets serve as tracers of planet formation and migration histories. The planet-metallicity correlation indicates initial high metallicity in the\n\n\f–3–\nprotoplanetary disk which in turn may be correlated with a higher surface density of solid\nparticles in the midplane of the disk that enhances core accretion. Orbital eccentricities and\nthe proximity of gas giant plants to their host stars are remnant signatures of gravitational\ninteractions that drive orbital migration. The architecture of multi-planet systems, sometimes locked in resonances, adds to our understanding of evolution of the protoplanetary\ndisk.\nThe N2K program (Fischer et al. 2005) is a survey of metal-rich stars, designed to\nidentify short period planets. These planets are geometrically endowed with a higher transit\nprobability; transit events provide a rare opportunity to derive information about the planet\ndensity, internal structure and the atmosphere (Burrows et al. 2007, Charbonneau 2006, Sato\net al. 2005). Because short-period planets can be flagged with just a few observations, the\nN2K program only requires three Doppler measurements to screen each star. However, an\nincreased occurrence of planets is correlated with high host star metallicity at all detected\nseparations. Therefore, additional observations were obtained for the highest metallicity stars\nto check for longer period planets. This extended program has detected six new intermediate\nperiod planets: HD 5319 and HD 75898 (Robinson et al. 2007), and four of the five planets\npresented here: HD 11506, HD 17156, HD 125612, HD 231701.\n\n2.\n2.1.\n\nHD 11506\n\nStellar Characteristics\n\nHD 11506 is classified as a G0 star with V=7.51. The Hipparcos catalog (ESA 1997)\nlists B-V = 0.607 with a parallax of 18.58 milliarcseconds, corresponding to a distance of 53.8\npc. The distance and apparent magnitude set the absolute visual magnitude as MV =3.85\nand the stellar bolometric luminosity as 2.29 L⊙ , including a bolometric correction of -0.033\n(VandenBerg & Clem 2003) based on effective temperature, surface gravity and metallicity\nof the star. High resolution spectroscopic analysis described in Valenti & Fischer (2005)\nyields Teff = 6058 ± 51K, log g = 4.32 ± 0.08, v sin i = 5.0 ± 0.5 km s−1 , and [Fe/H]= 0.31\n± 0.03 dex. HD 11506 is about 0.65 magnitudes above the main sequence. We expect the\nstar to be located about 0.3 magnitudes above the main sequence because of high stellar\nmetallicity, so this star appears to be slightly evolved by a few tenths of a magnitude, and\nis likely just beginning to transition onto the subgiant branch.\nThe stellar radius is calculated to be 1.3 R⊙ using L = 4πR2 σT 4 . We have also run\na fine grid of evolutionary tracks (described in Takeda et al. 2007), tuned to the uniform\nspectroscopic analysis of Valenti & Fischer (2005) and based on the Yale Stellar Evolution\n\n\f–4–\nCode. This analysis provides posterior probability distributions for stellar mass, radius,\ngravity and ages. Based on these evolutionary tracks, we derive a stellar mass of 1.19 M⊙ ,\na radius of 1.38 R⊙ , and an age of 5.4 Gyr. As a measure of the formal uncertainties, the\nlower and upper 95% credibility intervals from a Bayesian posterior probability distribution\nare provided in parentheses in Table 1 for these values.\nThe Ca II H & K lines (Figure 1) show that HD 11506 is chromospherically inactive.\nWe measure SHK , the core emission in the Ca II H & K lines relative to the continuum,\nfor all of our stars. Based on nineteen Keck observations, we measure an average SHK =\n0.156 for HD 11506. The ratio of flux from SHK to the bolometric stellar flux is designated\n′\n′\nas log RHK\nand gives the best diagnostic of chromospheric activity. The average log RHK\n=\n−4.99 for this star and we derive an activity-based rotational period (Noyes et al. 1984),\nPROT = 12.6d, and an activity-based age of 5.4 Gyr, in excellent agreement with the age\nfrom evolutionary tracks. The activity, spectral type and evolutionary stage of the star allow\nus to estimate an additional source of astrophysical noise, or stellar jitter for the velocities\nof each of the stars on our Doppler survey (Wright 2005).\nWe monitored the brightness of HD 11506 with the T10 0.8 m automatic photometric\ntelescope (APT) at Fairborn Observatory (Henry 1999, Eaton, Henry & Fekel 2003). The\nT10 APT measures the brightness of program stars relative to nearby constant comparison\nstars with a typical precision of 0.0015–0.0020 mag for a single measurement. For HD 11506,\nwe obtained 102 b and y measurements spanning 451 days between 2004 October and 2006\nJanuary. The standard deviation of a single observation from the mean was 0.0023 mag, our\nupper limit to possible photometric variability in HD 11506. A periodogram analysis found\nno significant periodicity between 1 and 225 days, so our photometry confirms the star's low\nchromospheric activity. The stellar parameters are summarized in Table 1.\n\n2.2.\n\nDoppler Observations and Keplerian Fit\n\nDoppler observations were made at the Keck telescope using HIRES (Vogt et al. 1994)\nwith an iodine cell to model the instrumental profile and to provide the wavelength scale\n(Butler et al. 1996). An exposure meter maintains a constant signal-to-noise ratio of about\n200 in our spectra, yielding a mean radial velocity precision of 2.75 m s−1 for HD 11506.\nWe obtained a total of 26 Doppler measurements. The observation dates, radial velocities\nand measurement uncertainties for the radial velocities are listed in Table 2 and plotted in\nFigure 2.\nIn addition to velocity errors arising from our measurement uncertainties (including\n\n\f–5–\nphoton shot noise), the star itself can have pulsations, cool spots or granular convective flows\nthat contribute non-dynamical velocity noise. These astrophysical sources of noise are termed\njitter and we empirically estimate stellar jitter based on the spectral type and chromospheric\nactivity of the star, following Wright (2005). For purposes of fitting a Keplerian model, the\nstellar jitter is added in quadrature to the formal instrumental errors, however the estimated\njitter is never included in the measurement uncertainties for the tabulated radial velocity\nsets.\nThe periodogram of the radial velocities shows a strong, broad peak in the power spectrum at about 1270 days with an associated false alarm probability (FAP) < 0.0001. The\nFAP associated with the periodogram tests whether scrambled velocities yield power that\nexceeds the observed, unscrambled velocities. A high FAP suggests that the signal is not\nsignificant or could have been caused by a window function in the data. Using a Monte Carlo\nsimulation, one thousand data sets of noise were generated by randomly drawing (with replacement) sets of actual stellar velocities. The fraction of trials with maximum periodogram\npower that exceeds the observed value from the initial unscrambled data set defines the FAP\n(Cumming 2004).\nFor each of the radial velocity data sets in this paper, a Levenberg-Marquardt fitting\nalgorithm was used to model the radial velocities with a theoretical Keplerian orbital curve.\nThere are six orbital parameters derived in the fit: orbital period (P), time of periastron\npassage (TP ), eccentricity (e), the orientation of the orbit (or line of apsides) (ω), the semivelocity amplitude (K) and the residual center of mass radial velocity (after subtracting a\nmedian radial velocity).\nUncertainties in the orbital parameters are determined with a bootstrap Monte Carlo\nanalysis. First, a best-fit Keplerian model is obtained. Then, for each of 100 trials, the\ntheoretical best fit is subtracted from the observed radial velocities. The residual velocities\nare then scrambled (with replacement) and added back to the theoretical best fit velocities\nand a new trial Keplerian fit is then obtained. The standard deviation of each orbital\nparameter for the 100 Monte Carlo trials was adopted as the parameter uncertainty.\nThe best fit Keplerian model gives an orbital period of 1405 ± 45 d, semi-velocity\namplitude of 80 ± 3 m s−1 and orbital eccentricity of 0.3 ± 0.1. The RMS to this fit is\n10.8 m s−1 . Based on the chromospheric activity of this star, we estimated a jitter of 2\nm s−1 (Wright\np 2005). When this jitter is added in quadrature with the error bars\np listed\n2\nin Table 2, χν = 3.2. While the large amplitude Doppler variation is clear, the χ2ν fit\nis worse than usual, suggesting that our velocity errors may be underestimated or that\nadditional low amplitude dynamical velocities are present. A periodogram of the residual\nvelocities to the single Keplerian fit show several peaks with similar power. For example, we\n\n\f–6–\ncan fit a second planet with a period ofp170 days with a significant reduction in the residual\nvelocity RMS and an improvement in χ2ν , however this is not yet a unique double planet\nfit; additional data are required to better evaluate the possible second signal.\nUsing the stellar mass of 1.19 M⊙ derived from evolutionary tracks, we find M sin i = 4.74\nMJUP and a semi-major axis of 2.48 AU. At the distance of this star, this physical separation\ncorresponds to an angular separation of α = 0.′′ 04. The Keplerian orbital solution is listed\nin Table 3 and the best-fit Keplerian model is plotted in Figure 2.\n\n3.\n3.1.\n\nHD 17156\n\nStellar Characteristics\n\nHD 17156 is a listed as a G5 star in the SIMBAD database and the Hipparcos catalog.\nHowever, this spectral type seems at odds with other data for the star. The visual magnitude\nis V = 8.17, B − V = 0.59, and the Hipparcos parallax (ESA 1997) is 12.78 milliarcseconds,\ncorresponding to a distance of 78.24 pc. The bolometric correction -0.039 (VandenBerg &\nClem 2003) and absolute visual magnitude, MV =3.70, imply a bolometric stellar luminosity\nof 2.6 L⊙ . Spectroscopic analysis yields Teff = 6079 ± 56K, log g = 4.29 ± 0.06, v sin i = 2.6\n± 0.5 km s−1 , and [Fe/H]= 0.24 ± 0.03. The B − V color and the effective temperature are\nindependent measurements that are consistent with each other. Together with the absolute\nmagnitude and position on the H-R diagram, the spectral type for this star is more likely to\nbe G0 and the star is just beginning to evolve off the main sequence.\nThe stellar mass, from evolutionary models described by Takeda et al. (2007), is 1.2\nM⊙ , and the age is 5.7 Gyr. The stellar radius from evolutionary models is 1.47 R⊙ , and\nagrees with the value we derive using the observed luminosity and the Stefan-Boltzmann\nrelation.\nThe absence of Ca II H & K emission (Figure 1) demonstrates low chromospheric ac′\ntivity. Taking the average of 25 observations, we measure SHK = 0.15 and log RHK\n= -5.04\nand derive a rotational period, PROT = 12.8 d, with an estimated stellar age of 6.4 ± 2Gyr,\nwhich compares favorably with the age derived above from stellar evolution tracks.\nWe obtained 241 photometric measurements with the T12 APT spanning 179 days between 2006 September and 2007 March. The standard deviation of the observations from\ntheir mean was 0.0024 mag, the upper limit to photometric variability in the star. Periodogram analysis revealed no significant periodicity between 1 and 100 days. In particular,\na least-squares sine fit of the observations on the 21.22-day radial velocity period resulted\n\n\f–7–\nin a photometric amplitude of only 0.00039 ± 0.00023 mag, providing further evidence that\nthe radial velocity variations in HD 17156 are not due to chromospheric activity. The stellar\ncharacteristics, including our assessment of photometric variability, are summarized in Table\n1.\n\n3.2.\n\nDoppler Observations and Keplerian Fit\n\nWe initially obtained eight Doppler observations of HD 17156 using the High Dispersion\nSpectrometer (Noguchi et al. 2002) at the Subaru Telescope in 2004 and 2005. For the\nfirst observing runs, the iodine absorption cell was located behind the entrance slit of the\nspectrometer (Kambe et al. 2002, Sato et al. 2002, Sato et al. 2005). The box holding the I2\ncell included a window with a lens to maintain constant focal length inside the spectrometer.\nThis eliminated the need to adjust the collimator position when moving the I2 cell in and\nout of the light path (i.e., when taking program and template observations). However, the\nlens introduced a different wavelength dispersion for program observations relative to the\ntemplate observation. Modeling of those early data is still ongoing, however, standard stars,\nknown to have constant radial velocities show RMS scatter greater than 15 m s−1 , with\nlarger run-to-run velocity offsets for Doppler observations obtained with that setup.\nThe Subaru N2K program was awarded ten nights of \"intensive\" time in summer 2006\nand in December 2006. Before the intensive time allocation, the iodine cell was moved\nin front of the slit, eliminating the change in wavelength dispersion between template and\nprogram observations. With this new setup, the RMS scatter decreased, ranging from 4 - 12\nm s−1 in a set of four RV standard stars.\nHD 17156 had exhibited large radial velocity variations in 2004 - 2005 at Subaru. Followup observations at Keck confirmed velocity variations, so the star was observed on nine\nconsecutive nights at Subaru from 8 December to 16 December, 2006. Setup StdI2b was\nused to cover the wavelength region of 3500–6100 Å with a mosaic of two CCDs. The slit\nwidth of 0′′ .6 was used to give a reciprocal resolution (λ/∆λ) of 60000. We obtained a\ntypical signal-to-noise ratio of S/N ∼ 150 pixel−1 at 5500 Å with exposure times of about\n120 seconds. Because of the larger systematic errors for observations taken before summer\n2006 (with the iodine cell behind the slit), only the nine radial velocities from December\n2006 are listed in Table 4. To account for the intrinsic RMS velocity scatter in standard\nstars, 5 m s−1 was added in quadrature to the nine Subaru observations in Table 4.\nAfter HD 17156 was flagged as an N2K candidate at Subaru, it was added to the\nN2K planet search program at Keck. We obtained 24 radial velocity measurements at the\n\n\f–8–\nKeck Observatory with an average internal velocity precision of 1.6 m s−1 . Observation\ndates, radial velocities and uncertainties for 33 observations are listed in Table 4. The last\ncolumn designates the source of the observations as \"K\" (Keck Observatory) or \"S\" (Subaru\nObservatory). The periodogram of the radial velocity data shows a strong narrow peak at\n21.1 days with a FAP less than 0.0001 (for 10000 Monte Carlo trials).\nWhen combining the Subaru and Keck velocities, we first determined a velocity difference of about 130 m s−1 between two observations taken at Subaru and Keck on the same\nnight (JD 2454083.9). With that initial guess, we included a velocity offset\nas a free pap\n−1\n2\nrameter and found that an offset of 116.0 m s produced a minimum χν . That offset\nwas added to the Subaru velocities listed in Table 4. The best fit Keplerian model for the\ncombined Subaru and Keck data sets yields an orbital period of 21.2 ± 0.3 d, semi-velocity\namplitude, K = 275± 15 m s−1 , and orbital eccentricity, e = 0.67± 0.08. The RMS to the\nfit is 3.97 m s−1 . Adding jitter of 3 m p\ns−1 (expected for this star) in quadrature with the\nactual single-measurement errors gives χ2ν = 1.04 for this Keplerian fit.\nAdopting a stellar mass of 1.2 M⊙ , we derive M sin i = 3.12 MJUP and a semi-major\naxis of 0.15 AU. The Keplerian orbital solution is summarized in Table 3. The phase-folded\nplot of the Doppler measurements for Keck and Subaru observations are shown in the left\nplot of Figure 3 and include 3 m s−1 jitter. Keck observations are represented by diamonds\nand the Subaru observations are shown as filled circles.\nBecause the high eccentricity is unusual, we examined the Keplerian fit for the Keck\ndata alone, shown in the right plot Figure 3. The Keck data have poor phase coverage\nnear periastron, and yield a Keplerian fit with lower amplitude and lower eccentricity. The\nSubaru observations map periastron passage and help to model the eccentricity of the orbit.\n\n3.3.\n\nTransit Search\n\nThe 21.22 day period of the companion to HD 17156 is by far the shortest planetary\norbital period in this paper. The orbital semi-major axis of 0.15 AU and the stellar radius of\n1.47 R⊙ lead to an a priori transit probability of 7% (Seagroves et al. 2003). Therefore, we\nused our 241 brightness measurements to conduct a preliminary transit search. The orbital\nparameters in Table 3 constrain the predicted times of transit to about ± 0.3 days, which\nis slightly greater than the 0.25-day duration of a central transit. We performed our transit\nsearch, using a technique similar to the one described by Laughlin (2000), over all orbital\nphases for periods between 20 and 23 days. The search was negative but was able to cover\neffectively only 25% of the period-phase search space corresponding to the uncertainties in\n\n\f–9–\nthe orbital parameters. Thus, our photometric data do not preclude the possibility of transits\nin HD 17156.\n\n4.\n4.1.\n\nHD 125612\n\nStellar Characteristics\n\nHD 125612 is a G3V main sequence star with V=8.31, B-V = 0.628, and Hipparcos\nparallax (ESA 1997) of 18.93 corresponding to a distance of 52.82 pc and absolute visual\nmagnitude, MV =4.69. Spectroscopic analysis yields Teff = 5897 ± 40K, log g = 4.45 ± 0.05,\nv sin i = 2.1 ± 0.5 km s−1 , and [Fe/H]= 0.24 ± 0.03 dex. The bolometric correction is\n-0.061, giving a stellar luminosity of 1.08 L⊙ . The luminosity and Teff imply a stellar radius\nof 1.0 R⊙ . Within uncertainties, this agrees well with the value of 1.05 R⊙ determined from\nstellar evolutionary tracks. We also derive a stellar mass of 1.1 M⊙ from stellar evolution\nmodels and an age of 2.1 Gyr.\nFigure 1 shows the Ca H line for HD 125612; the lack of emission indicates low chromospheric activity for this star. Taking the mean of 18 observations, we measure SHK = 0.178\n′\nand log RHK\n= -4.85, and derive PROT = 10.5 d, and a stellar age of 3.3 ± 2 Gyr (which\ncompares well with the age of 2.1 Gyr from stellar evolution tracks). Stellar parameters are\nsummarized in Table 1.\n\n4.2.\n\nDoppler Observations and Keplerian Fit\n\nWe obtained 19 Keck velocity measurements for HD 125612 with a typical uncertainty\nof 2.2 m s−1 . Observation dates, radial velocities and instrumental uncertainties in the radial\nvelocities are listed in Table 5. A periodogram of the velocities shows a strong broad peak\nat about 500 days.\nThe best fit Keplerian model is plotted in Figure 4 and yields a period of 510 ± 14 d,\nwith semi-velocity amplitude 90.7 ± 8 m s−1 , orbital eccentricity, 0.38 ± 0.05, and a linear\ntrend of 0.037 meters per day. Adopting a stellar mass of 1.1 M⊙ , we derive M sin i = 3.5\nMJUP and semi-major axis of 1.2 AU (angular separation, α = 0′′ .023). The Keplerian orbital\nsolution is listed in Table 3 and the RV data are plotted with the best-fit Keplerian model\n(solid line) in Figure 4.\nThe RMS to the Keplerian fit shown in Figure 4 is 10.7 m s−1 . The velocity jitter for\nthis star is expected to be about 2 m s−1 . Therefore, the residual RMS is several times\n\n\f– 10 –\np\nthe typical error bar, consistent with the poor χ2ν statistic of 3.56. A periodogram of the\nresiduals to a 510-day planet fit shows power near 3.5 d. However, there are several other\npeaks of nearly comparable height, showing that other orbital solutions may give similar\nimprovements. Thus, while we could fit the residuals with a second Keplerian, the FAP\nof the peak does not yet meet our standards of statistical significance, and more data are\nrequired for follow up.\n\n5.\n5.1.\n\nHD 170469\n\nStellar Characteristics\n\nHD 170469 is a G5 subgiant star with visual magnitude V=8.21, B-V = 0.677, and\nHipparcos parallax (ESA 1997) of 15.39 milliarcseconds, corresponding to a distance of 64.97\npc. The absolute visual magnitude of the star is MV =4.14. The bolometric correction is\n-0.072 providing a bolometric stellar luminosity of 1.6 L⊙ and (with Teff ) stellar radius of\n1.2 R⊙ calculated from the luminosity. Evolutionary tracks provide a stellar mass estimate\nof 1.14 M⊙ and stellar radius of 1.22 R⊙ and age of 6.7 Gyr. Our spectroscopic analysis\ngives Teff = 5810 ± 44K, log g = 4.32 ± 0.06, v sin i = 1.7 ± 0.5 km s−1 , and [Fe/H]= 0.30\n± 0.03 dex.\nThe Ca H & K lines (Figure 1) indicate low chromospheric activity. Taking the mean of\n′\nthirteen observations, we measure SHK = 0.145 and log RHK\n= -5.06 and derive a rotational\nperiod, PROT = 13.0 d and an activity-calibrated age (Noyes et al. 1984) of 7 ± 2 Gyr.\nWe obtained 215 brightness measurements with the T10 APT spanning 630 days between 2005 March and 2006 November. The standard deviation of the observations was\n0.0018 mag, the upper limit to photometric variability in HD 170469. A periodogram analysis found no significant periodicity between 1 and 315 days, confirming the star's low chromospheric activity. The stellar characteristics are summarized in Table 6.\n\n5.2.\n\nDoppler Observations and Keplerian Fit\n\nWe obtained 35 Keck velocities for HD 170469 with a mean velocity precision of 1.6\nm s . Observation dates, radial velocities and instrumental uncertainties in the radial\nvelocities are listed in Table 7. A periodogram of the velocities yields very strong power at\nabout 1100 days with a FAP less than 0.0001.\n−1\n\nThe best fit Keplerian model gives an orbital period of 1145 ± 18 d, semi-velocity\n\n\f– 11 –\namplitude of 12.0 ±\n1.9 m s−1 and orbital eccentricity, 0.11 ± 0.08. The RMS to the fit\np\nis 4.18 m s−1 with χ2ν = 1.59, including the estimated astrophysical jitter of 2.0 m s−1 .\nAdopting a stellar mass of 1.14 M⊙ , we derive M sin i = 0.67 MJUP and a semi-major axis of\n2 AU (α = 0.′′ 03). The Keplerian orbital parameters are listed in Table 8 and the RV data\nare plotted with the best-fit Keplerian model (solid line) in Figure 5.\n\n6.\n6.1.\n\nHD 231701\n\nStellar Characteristics\n\nHD 231701 is an F8V star with V = 8.97, B − V = 0.539, and Hipparcos parallax\n(ESA 1997) of 9.22 milliarcseconds, corresponding to a distance of 108.4 pc. The absolute\nvisual magnitude is MV =3.79, so this star is beginning to evolve onto the subgiant branch.\nSpectroscopic analysis yields Teff = 6208 ± 44K, log g = 4.33 ± 0.06, v sin i = 4.0 ± 0.5\nkm s−1 , and [Fe/H]= 0.07 ± 0.03 dex. The bolometric correction is -0.037 and bolometric\nluminosity is 2.4 L⊙ . The luminosity and effective temperature yield a stellar radius of 1.36\nR⊙ . Modeling the stellar evolutionary tracks, we derive a stellar mass of 1.14 M⊙ , radius\nof 1.35 R⊙ , and age of 4.9 Gyr.\nThe Ca H&K lines (Figure 1) show that the star has low chromospheric activity. We\n′\nmeasure SHK = 0.159 and log RHK\n= -5.0 and derive a rotational period, PROT = 12.2 d\nand a stellar age of 5.6 ± 2 Gyr. Stellar parameters are listed in Table 6.\n\n6.2.\n\nDoppler Observations and Keplerian Fit\n\nWe obtained 17 Keck observations of HD 231701 with mean internal errors of 3.2 m s−1 .\nObservation dates, radial velocities and measurement uncertainties in the radial velocities\nare listed in Table 9. The periodogram of this data set has a FAP of 0.006 for a period near\n140 days.\nThe best fit Keplerian model has an orbital period of 141.6 ± 2.8 d, with semi-velocity\namplitude 39 ± 3.5 m s−1 and orbital eccentricity, 0.1 ± 0.06. The RMS to this fit is 5.9\nm s−1 . The expected astrophysical jitter for this star isp2.2 m s−1 . Adding this jitter in\nquadrature with the error bars listed in Table 9 yields χ2ν = 1.46 for this Keplerian fit.\nAdopting the stellar mass of 1.14 M⊙ , we derive M sin i = 1.08 MJUP and semi-major axis\nof 0.53 AU. The Keplerian orbital solution is listed in Table 8 and the phased RV data is\nplotted with the best-fit Keplerian model (solid line) in Figure 6.\n\n\f– 12 –\n6.3.\n\nDiscussion\n\nHere, we present the detection of 5 new exoplanets detected with Doppler observations. For each of the Keplerian models, we also carried out a Markov Chain Monte Carlo\n(MCMC) analysis to better estimate the orbital parameters and their uncertainties following\nthe algorithm described by Ford (2003). Unlike the Levenberg-Marquardt algorithm that we\ngenerally use to determine a best fit Keplerian orbit, the MCMC analysis provides the full\nposterior probability density distribution for each parameter. This approach is p\nparticularly\nuseful for data sets where the Levenberg-Marquardt algorithm can minimize χ2ν with a\nmodel that fits a sparse data set. The MCMC\np algorithm explores a wider range of parameter space because it is not driven solely by χ2ν minimization. However, MCMC does not\nexplore an exhaustive range of parameter space. For example, solutions with very different\norbital periods might be missed. For each of the models presented here, we began with the\ninput parameters found with Levenberg Marquardt fitting and confirmed that the orbital\nelements were recovered with strongly peaked probability distributions using MCMC.\nHD 170469 is a star on the regular planet search at Keck that has a planet of M sin i =\n0.66 MJUP in a ∼3 yr orbit with eccentricity 0.23. The host star is metal-rich with [Fe/H]\n= 0.3. The remaining four exoplanets were initially part of the N2K program at Keck. The\nN2K program targets metal-rich stars for rapid identification of short-period planets. The\nfirst three radial velocity measurements for the stars presented here had RMS scatter less\nthan 5 m s−1 (except HD 17156, with initial RMS scatter of 34 m s−1 ), so these stars were\nnot candidates for short period planets. However, a follow-up program to obtain Doppler\nobservations on N2K-vetted high metallicity stars with low chromospheric activity and low\nRMS velocity scatter has detected the presence of these longer period planets.\nHD 11506 b is a fairly massive planet, with M sin i = 4.74 MJUP and a semi-major axis\nof 2.5 AU. This could well constitute the outer edge of a habitable zone location for putative\nrocky moons orbiting the planet, depending on atmospheric properties of any moons. The\nhost star has a luminosity that is 2.3 times that of the Sun. The eccentricity of this system\nis 0.3, so the temperature at the top of the planet atmosphere would change by about 50K\nbetween apastron and periastron.\nHD 17156 b has a mass of M sin i = 3.12 MJUP and an orbital period of 21.2 days,\nplacing it in the so-called period valley between 10 and 100 days (Udry et al. 2003), where\na relatively small fraction of exoplanets have been detected. We derive a substantial orbital\neccentricity of 0.67 for HD 17156 b. At this proximity to the subgiant host star, the planet\nmoves between 0.05 and 0.25 AU, experiencing temperature changes of a few hundred degrees\nbetween periastron and apastron. It is possible that these thermal changes could be observed\nwith sensitive IR flux measurements from space, even though the planet is not known to\n\n\f– 13 –\ntransit its host star.\nThe distribution of orbital eccentricities for known exoplanets is shown in Figure 7. An\nupper envelope in the distribution of eccentricities rises steeply from periods of a few days\nto reach the maximum observed eccentricities (for HD 80606 and HD 20782) at periods of\n100 - 1000 days. Although an orbital eccentricity of 0.67 seems remarkable for HD 17156 b,\ngiven its orbital period of just 21.2 days, the eccentricity still falls along the upper edge of\nthe observed eccentricity distribution.\nHD 125612 b has M sin i = 3.5 MJUP with a semi-major axis of 1.2 AU. This planet\nhas an eccentricity of 0.38. The planet is carried from 0.47 AU at periastron, where the\ntemperature at the top of the atmosphere is about 300 K, to about 2.1 AU where the\ntemperature falls below the freezing point of water to about 200 K. A single planet model\ndoes not appear to adequately describe the velocities of HD 125612 because the RMS to that\nfit is 10.7 m s−1 , yet the star is chromospherically quiet and slowly rotating, with v sin i = 2\nkm s−1 . This star may well have an additional planet orbiting in a relatively short period.\nVelocity variations in HD 231701 have been modeled as a planet with M sin i = 1.08\nMJUP with a semi-major axis of 0.53 AU and orbital eccentricity of about 0.1. The MCMC\nprobability distributions for HD 231701 are consistent with this Keplerian model, but allow for eccentricity solutions that extend to zero. This analysis alerts us that more RV\nmeasurements should be taken to better constrain the orbital eccentricity of this system.\nWe have now obtained three or more Doppler observations for 423 stars at Keck Observatory as part of the N2K program. Spectral synthesis modeling has been carried out for\nall of these stars, and we plot the percentage of stars with detected planets in each 0.1 dex\nmetallicity bin in Figure 8. Superimposed on this plot is the planet detectability curve from\nFischer & Valenti (2005). A planet probability can be assigned based on the stellar metallicity. Integrating planet probabilities we expect 27 ± 5 exoplanets with masses greater than\n1 MJUP and orbital periods shorter than 4 years. Fourteen, or about half of the expected\nplanets in the sample have now been detected.\nWe gratefully acknowledge the dedication and support of the Keck Observatory staff,\nin particular Grant Hill for support with HIRES. We thank Akito Tajitsu and Tae-Soo Pyo\nfor their expertise and support of the Subaru HDS observations. DAF acknowledges support from NASA grant NNG05G164G and from Research Corporation. SSV acknowledges\nsupport from NSF AST-0307493. BS is supported by Grants-in-Aid for Scientific Research\n(No. 17740106) from the Japan Society for the Promotion of Science (JSPS). We thank\nthe Michelson Science Center for travel support through the KPDA program. We thank\nthe NASA and UC Telescope assignment committees for generous allocations of telescope\n\n\f– 14 –\ntime. The authors extend thanks to those of Hawaiian ancestry on whose sacred mountain\nof Mauna Kea we are privileged to be guests. Without their kind hospitality, the Keck\nobservations presented here would not have been possible. This research has made use of\nthe SIMBAD database, operated at CDS, Strasbourg, France, and of NASA's Astrophysics\nData System Bibliographic Services and is made possible by the generous support of Sun\nMicrosystems, NASA, and the NSF.\n\n\f– 15 –\nREFERENCES\nButler, R. P., Wright, J. T., Marcy, G. W., Fischer, D. A., Vogt, S. S., Tinney, C. G., Jones,\nH. R. A., Carter, B. D., Johnson, J. A., McCarthy, C., Penny, A. J. 2006 ApJ 646,\n505\nButler, R. P., Marcy, G. W., Williams, E., McCarthy, C., Dosanjh, P., Vogt, S. S. 1996,\nPASP, 108, 500\nBurrows, A., Hubeny, I., Budaj, J., Hubbard, W. 2007, ApJ, in press\nCharbonneau, D., Brown, T. M., Burrows, A., Laughlin, G. 2006, in Protostars and Planets\nV, ed. B. Reipurth, D. Jewitt, and K. Keil (University of Arizona Press)\nCumming, A. 2004, MNRAS, 354, 1165\nEaton, J. A., Henry, G. W., Fekel, F. C. 2003, in The Future of Small Telescopes in the\nNew Millennium, Volume II–The Telescopes We Use, ed. T. D. Oswalt (Dordrecht:\nKluwer), 189\nESA 1997, The Hipparcos and Tycho Catalogs. ESA-SP 1200\nFischer, D. A. et al. 2005, ApJ, 629, 481\nFischer, D. A., Valenti, J. A. 2005, ApJ 622, 1102\nFord, E. 2003, ApJ, 129, 1706\nHenry, G. W. 1999, PASP, 111, 845\nLaughlin, G. 2000, ApJ, 545, 1064\nIda, S., Lin, D. N. C. 2004, ApJ 616, 567\nKambe, E. et al. 2002, PASJ, 54, 873\nMarcy, G. W., Butler, R. P., Fischer, D. A., Vogt, S. S., Wright, J. T., Tinney, C. G., Jones,\nH. R. A. 2005, PThPS, 158, 24\nNoguchi, K. et al. . 2002, PASJ, 54, 855\nNoyes, R. W., Hartmann, L., Baliunas, S. L., Duncan, D. K., Vaughan, A. H. 1984, ApJ,\n279, 763\nRobinson, S. E., Laughlin, G., Vogt, S. S., Fischer, D., Butler, R. P., Marcy, G. W., Takeda,\nG., Driscoll, P. 2007, ApJ in press\nSantos, N. C., Israelian, G., Mayor, M., Bento, J. P., Almeida, P. C., Sousa, S. G., Ecuvillon,\nA. 2005, A & A, 437, 1127\nSato, B., Kambe, E., Takeda, Y., Izumiura, H., Ando, H. 2002, PASJ, 54 873\nSato, B. et al. 2005, ApJ, 633, 465\nSeagroves, S., Harker, J., Laughlin, G., Lacy, J., & Castellano, T. 2003, PASP, 115, 1355\nTakeda, G., Ford, E. B., Sills, A., Rasio, F., Fischer, D. A., Valenti, J. A. 2007, ApJS, 168,\n297\n\n\f– 16 –\nUdry, S., Mayor, M., Clausen, J. V., Freyhammer, L. M., Helt, B. E., Lovis, C., Naef, D.,\nOlsen, E. H., Pepe, F., Queloz, D., Santos, N. C. 2003, A & A, 407, 679\nValenti, J. A., Fischer, D. A. 2005, ApJS, 159, 141\nVandenBerg, D. & Clem, J. 2003, AJ, 126, 778\nVogt, S. S. et al. 1994, SPIE, 2198, 362.\nWright, J. T. 2005, PASP, 117, 657\nWright, J. T., Marcy, G. W., Fischer, D. A., Butler, R. P., Vogt, S. S., Tinney, C. G., Jones,\nH. R. A., Carter, B. D., Johnson, J. A., McCarthy, C., Apps, K. 2007, ApJ, 657, 533\n\nThis preprint was prepared with the AAS LATEX macros v5.2.\n\n\f– 17 –\n\nFig. 1.- The Ca H line for HD 11506 and 17156 are plotted in the left panel, with the\nsame wavelength segment of the Sun shown for comparison. HD 125612, HD 170469 and\nHD 231701 are plotted in the right panel. All of these stars have low chromospheric activity\nbased on our measurement of line core emission relative to the continuum.\n\n\f– 18 –\n\nP = 3.85 yr −1\nK = 80.3 ms\ne = 0.30\n\nVelocity (m s−1)\n\n100\n50\n0\n−50\n−100\n\nRMS = 10.8 ms−1\n\n2004.0\n\n2005.0\n\nKeck Obs\n\n2006.0\nTime (Years)\n\n2007.0\n\n2008.0\n\nFig. 2.- Radial velocities for HD 11506. The velocity error bars have been augmented by\naddingp2 m s−1 in quadrature to the single measurement precision listed in Table 2. This\ngives χ2ν = 3.2 for the Keplerian fit. With a stellar mass of 1.19 M⊙ , we derive a planet\nmass of M sin i = 4.74 MJUP and semi-major axis, arel = 2.48 AU.\n\n\fVelocity (m s−1)\n\n400\n\nP = 21.22 day\nK = 275. m s−1\ne = 0.67\n\n200\n0\n−200\n−400\n\nRMS = 3.98 m s−1\n\n0.0\n\n0.5\nOrbital Phase\n\nVelocity (m s−1)\n\n– 19 –\n\nP = 21.22 day\nK = 147. m s−1\ne = 0.43\n\n100\n0\n−100\nRMS = 3.67 m s−1\n\n1.0\n\n0.0\n\n0.5\nOrbital Phase\n\n1.0\n\nFig. 3.- (left) Radial velocities for HD 17156 from Keck Observatory (diamonds) and\nSubaru Observatory (filled circles) have 3 m s−1 added in quadrature to the uncertainties\nlisted in Table 4 to account for expected photospheric jitter. Adopting a stellar mass of 1.2\nM⊙ we derive a planet mass, M sin i = 3.12 MJUP and semi-major axis for the orbit, arel =\n0.15 AU. (right) The plot on the right shows the Keck velocities only. Although the phase\ncoverage misses periastron the Keck velocites alone confirm high eccentricity in HD 17156 b.\n\n\f– 20 –\n\nP = 1.39 yr −1\nK = 90.7 ms\ne = 0.38\n\nVelocity (m s−1)\n\n150\n100\n50\n0\n−50\n−100\n−150\n\nRMS = 10.7 ms−1\n\nKeck Obs\n\n2004.5 2005.0 2005.5 2006.0 2006.5 2007.0 2007.5\nTime (Years)\n\nFig. 4.- Radial velocities for HD 125612. The velocity measurements have 2 m s−1 added\nto their error bars listed in Table 5 to account for the level of astrophysical noise (jitter) we\nexpect from the star. With the assumed stellar mass of 1.1 M⊙ , we derive a planet mass,\nM sin i = p\n3.5 MJUP and semi-major axis of 1.2 AU. This Keplerian model still has a high\nRMS and χ2ν of 3.56, suggesting the possible presence of an additional planet.\n\n\f– 21 –\n\nP = 3.13 yr −1\nK = 12.0 ms\ne = 0.11\n\nVelocity (m s−1)\n\n20\n10\n0\n−10\n−20\n\nRMS = 4.18 ms−1\n\n2002\n\n2004\n2006\nTime (Years)\n\nFig. 5.- Keck radial velocities for HD 170469 include 2.0 m s−1 added in quadrature\np with\nthe internal error bars listed in Table 7. With the added jitter, the Keplerian fit has χ2ν =\n1.59. The assumed stellar mass of 1.14 M⊙ yields a planet mass of M sin i = 0.67 MJUP and\nsemi-major axis of about 2 AU.\n\n2008\n\n\f– 22 –\n\nVelocity (m s−1)\n\n100\n\nP = 141.6 day\nK = 39.0 m s−1\ne = 0.10\n\n50\n0\n−50\n−100\n\nRMS = 5.90 m s−1\n\n0.0\n\n0.5\nOrbital Phase\n\n1.0\n\nFig. 6.- Phase-folded radial velocities p\nfor HD 231701 include stellar jitter of 2.2 m s−1 added\nto the errors listed in Table 9, giving χ2ν = 1.46. The stellar mass of 1.14 M⊙ implies a\nplanet mass of M sin i = 1.08 MJUP and orbital radius of 0.53 AU.\n\n\f– 23 –\n\nFig. 7.- Orbital eccentricity distribution for exoplanets. A rising envelope defines the\ndistribution for planets with periods between 2 and 100 days. The distribution peaks for\nperiods between 100 - 1000 days. The arrow points to the dot representing HD 17156 b.\nWith an orbital period of 21 days and eccentricity of 0.67, HD 17156 b still fits within the\nenvelope of this eccentricity distribution.\n\n\f– 24 –\n\nFig. 8.- Stars with at least 4 Doppler observations that were observed at Keck as part of\nthe N2K program were been binned according to metallicity. In each 0.1 dex metallicity bin,\nthe percentage of stars with detected planets is plotted and Poisson error bars are shown.\nSuperimposed on this histogram is the curve of planet occurrence as a function of metallicity\nfrom Fischer & Valenti (2005). Most stars on the N2K program have only 4-5 observations,\nhowever the metallicity correlation is still emerging and is supported in this sample.\n\n\f– 25 –\n\nTable 1. Stellar Parameters\nParameter\n\nHD11506\n\nHD17156\n\nHD125612\n\nV\nMV\nB-V\nSpectral Type\nDistance (pc)\nLbol /L⊙\n[Fe/H]\nTef f (K)\nv sin i (km s−1 )\nlog g\nMST AR (M⊙ )a\nRST AR (R⊙ )a\nAge (Gyr)a\nSHK\n′\nlog RHK\nPROT (d)\nσphot (mag)\n\n7.51\n3.85\n0.607\nG0V\n53.82\n2.29\n0.31 (0.03)\n6058 (51)\n5.0 (0.50)\n4.32 (0.08)\n(1.1) 1.19 (1.29)\n(1.25) 1.38 (1.53)\n(3.9) 5.4 (7.0)\n0.156\n-4.99\n12.6 d\n0.0023\n\n8.17\n3.70\n0.590\nG0V\n78.24\n2.6\n0.24 (0.03)\n6079 (56)\n2.6 (0.50)\n4.29 (0.06)\n(1.1) 1.2 (1.3)\n(1.3) 1.47 (1.6)\n(3.8) 5.7 (7.0)\n0.15\n-5.04\n12.8 d\n0.0024\n\n8.31\n4.69\n0.628\nG3V\n52.82\n1.08\n0.24 (0.03)\n5897 (40)\n2.1 (0.50)\n4.45 (0.05)\n(1.04) 1.1 (1.17)\n(0.99) 1.05 (1.13)\n(0.16) 2.1 (5.6)\n0.178\n-4.85\n10.5 d\n***\n\na\n\nStellar masses, radii and ages are derived from evolutionary tracks\n\n\f– 26 –\n\nTable 2. Radial Velocities for HD 11506\nJD\n-2440000.\n\n13014.73505\n13015.73893\n13016.74089\n13191.12201\n13207.10116\n13208.08401\n13368.83778\n13369.75897\n13370.73242\n13397.73009\n13750.73807\n13775.72853\n13776.70435\n13777.72528\n13778.71858\n13779.74737\n13926.12744\n13933.09065\n13959.13935\n13961.12421\n13981.98256\n14023.97438\n14083.84327\n14085.92115\n14129.74332\n14286.11838\n\nRV\n(m s−1 )\n\n-6.67\n-6.58\n-18.73\n-43.89\n-71.30\n-56.92\n-80.87\n-80.35\n-81.24\n-75.66\n59.16\n71.94\n74.90\n76.27\n78.70\n71.93\n73.68\n75.37\n80.47\n81.24\n74.91\n44.32\n26.82\n38.66\n56.29\n28.66\n\nUncertainties\n(m s−1 )\n\n2.94\n2.89\n2.98\n3.56\n3.17\n3.41\n2.26\n2.18\n2.17\n2.36\n2.67\n2.77\n2.57\n2.93\n2.73\n2.77\n2.66\n2.62\n2.46\n2.73\n3.12\n3.07\n2.44\n2.54\n2.48\n3.01\n\n\f– 27 –\n\n\f– 28 –\n\nTable 3. Orbital Parameters\nParameter\n\nHD 11506\n\nHD 17156\n\nHD 125612\n\nP (d)\nTp (JD)\nω (deg)\necc\nK1 (m s−1 )\ndv/dt (m s−1 per day)\narel (AU)\na1 sin i (AU)\nf1 (m) (M⊙ )\nM sin i (MJup )\nNobs\nRMS (m s−1 )\nJitter (m p\ns−1 )\nReduced χ2ν\nFAP (periodogram)\n\n1405 (45)\n13603 (102)\n262 (19)\n0.3 (0.1)\n80 (3)\n***\n2.48\n0.0099\n6.53e-08\n4.74\n26\n10.8\n2\n3.2\n< 0.0001\n\n21.2 (0.3)\n13738.529 (0.5)\n121 (11)\n0.67 (0.08)\n275 (15)\n***\n0.15\n0.00039\n1.83e-08\n3.12\n33\n3.97\n3\n1.17\n< 0.0001\n\n510 (14)\n13228.3 (12)\n21 (9)\n0.38 (0.05)\n90.7 (8)\n0.037\n1.2\n0.0039\n3.09e-08\n3.5\n19\n10.7\n2\n3.56\n0.0003\n\n\f– 29 –\n\nTable 4. Radial Velocities for HD 17156\nJD\n-2440000.\n\n13746.75596\n13748.79814\n13749.79476\n13750.80160\n13775.77821\n13776.80791\n13779.82897\n13959.13219\n13962.07028\n13963.10604\n13964.13118\n13982.03231\n13983.08575\n13983.99480\n13985.00847\n14023.95206\n14047.95773\n14078.01162\n14078.92501\n14079.91371\n14080.98093\n14081.89406\n14082.86071\n14083.88445\n14083.90314\n14084.82860\n14085.82560\n14085.86537\n14086.87960\n\nRV\n(m s−1 )\n\n88.49\n138.15\n151.35\n169.65\n235.17\n253.80\n239.14\n97.33\n152.64\n165.48\n194.69\n132.55\n146.35\n166.11\n187.22\n114.39\n166.01\n-116.60\n-261.56\n-164.10\n-89.57\n-44.08\n2.39\n37.62\n32.76\n63.22\n86.67\n84.28\n99.01\n\nUncertainties\n(m s−1 )\n\nObservatory\n\n1.70\n1.73\n1.67\n1.76\n1.83\n1.81\n1.64\n1.55\n1.51\n1.68\n1.70\n1.20\n1.70\n1.32\n1.57\n1.77\n1.74\n5.14\n5.18\n5.23\n5.13\n5.15\n5.14\n5.16\n1.33\n1.63\n5.20\n1.56\n5.20\n\nK\nK\nK\nK\nK\nK\nK\nK\nK\nK\nK\nK\nK\nK\nK\nK\nK\nS\nS\nS\nS\nS\nS\nS\nK\nK\nS\nK\nS\n\n\f– 30 –\n\nTable 4-Continued\nJD\n-2440000.\n\n14129.92513\n14130.73019\n14131.85485\n14138.76720\n\nRV\n(m s−1 )\n\n113.30\n133.66\n151.11\n261.56\n\nUncertainties\n(m s−1 )\n\nObservatory\n\n1.43\n1.32\n1.77\n1.37\n\nK\nK\nK\nK\n\n\f– 31 –\n\nTable 5. Radial Velocities for HD 125612\nJD\n-2440000.\n\n13190.83262\n13197.83363\n13198.85557\n13199.83792\n13604.75480\n13754.12824\n13776.15380\n13777.11940\n13838.01492\n13841.94894\n13927.79007\n13961.75080\n13962.74127\n13981.72862\n13983.74037\n13984.72815\n14130.13392\n14139.12383\n14251.82778\n\nRV\n(m s−1 )\n\n52.80\n61.40\n60.49\n44.35\n-60.07\n45.68\n17.80\n21.71\n-77.76\n-86.49\n-90.28\n-79.07\n-80.81\n-83.16\n-81.92\n-80.88\n-22.62\n1.31\n90.28\n\nUncertainties\n(m s−1 )\n\n2.85\n2.66\n2.59\n2.70\n2.04\n1.83\n2.03\n2.16\n2.35\n2.52\n2.01\n2.01\n1.83\n1.90\n2.11\n2.03\n2.18\n1.94\n2.39\n\n\f– 32 –\n\nTable 6. Stellar Parameters\nParameter\n\nHD 170469\n\nHD 231701\n\nV\nMV\nB-V\nSpectral Type\nDistance (pc)\nLbol /L⊙\n[Fe/H]\nTef f (K)\nv sin i (km s−1 )\nlog g\nMST AR (M⊙ )a\nRST AR (R⊙ )a\nAge (Gyr)a\nSHK\n′\nlog RHK\nPROT (d)\nσphot (mag)\n\n8.21\n4.14\n0.677\nG5IV\n64.97\n1.6\n0.30 (0.03)\n5810 (44)\n1.7 (0.5)\n4.32 (0.06)\n(1.05) 1.14 (1.16)\n(1.15) 1.22 (1.3)\n(5.0) 6.7 (7.8)\n0.145\n-5.06\n13.0 d\n0.0018\n\n8.97\n3.79\n0.539\nF8V\n108.4\n2.4\n0.07 (0.03)\n6208 (44)\n4 (0.50)\n4.33 (0.06)\n(1.08) 1.14 (1.22)\n(1.16) 1.35 (1.55)\n(3.5) 4.9 (6.2)\n0.159\n-5.00\n12.2 d\n***\n\na\n\nStellar masses, radii and ages are derived from evolutionary tracks\n\n\f– 33 –\n\nTable 7. Radial Velocities for HD 170469\nJD\n-2440000.\n\n11705.96808\n11793.81330\n12008.04881\n12099.03294\n12162.76894\n12364.13287\n12390.12499\n12391.12567\n12445.93867\n12515.82777\n12535.75539\n12536.74191\n12537.82520\n12538.74254\n12539.75501\n12572.69435\n12573.69333\n12574.70725\n12575.69822\n12778.04455\n12804.05044\n12848.92274\n13180.90825\n13181.89752\n13548.99248\n13603.80234\n13842.01212\n13932.96654\n13960.91798\n\nRV\n(m s−1 )\n\n6.04\n-0.05\n-10.21\n-14.05\n-15.48\n-7.07\n-2.46\n2.80\n-12.12\n14.53\n3.45\n0.06\n1.72\n0.83\n4.11\n6.59\n5.76\n10.11\n2.35\n15.48\n7.80\n5.06\n-14.03\n-12.91\n-2.83\n4.11\n9.79\n14.41\n10.12\n\nUncertainties\n(m s−1 )\n\n1.51\n1.39\n1.50\n1.59\n1.42\n1.67\n1.63\n1.76\n1.72\n1.96\n1.53\n1.50\n1.50\n1.30\n1.51\n1.60\n1.34\n1.45\n1.40\n1.96\n1.56\n2.35\n1.55\n1.57\n1.54\n1.50\n1.59\n1.49\n1.42\n\n\f– 34 –\n\nTable 7-Continued\nJD\n-2440000.\n\n13961.83115\n13981.82421\n13982.77494\n13983.76067\n13984.83377\n14250.01196\n\nRV\n(m s−1 )\n\n11.29\n7.85\n5.33\n5.96\n7.38\n-4.92\n\nUncertainties\n(m s−1 )\n\n1.54\n1.27\n1.26\n1.33\n1.22\n1.57\n\n\f– 35 –\n\nTable 8. Orbital Parameters\nParameter\n\nHD 170469\n\nHD 231701\n\nP (d)\nTp (JD)\nω (deg)\necc\nK1 (m s−1 )\ndv/dt (m s−1 per day)\narel (AU)\na1 sin i (AU)\nf1 (m) (M⊙ )\nM sin i (MJup )\nNobs\nRMS (m s−1 )\nJitter (m p\ns−1 )\nReduced χ2ν\nFAP (periodogram)\n\n1145 (18)\n11669.0 (21)\n34 (19)\n0.11 (0.08)\n12.0 (1.9)\n***\n2.1\n0.00126\n2.03e-10\n0.67\n35\n4.18\n2.0\n1.59\n< 0.0001\n\n141.6 (2.8)\n13180.0 (4.2)\n46 (24)\n0.10 (0.08)\n64 (8)\n***\n0.53\n0.0005\n8.6e-10\n1.08\n17\n5.90\n2.22\n1.46\n0.006\n\n\f– 36 –\n\nTable 9. Radial Velocities for HD 231701\nJD\n-2440000.\n\n13190.98047\n13198.03808\n13199.02309\n13199.95689\n13603.87134\n13928.04498\n13931.08095\n13932.02123\n13961.87814\n13981.76292\n13983.77988\n14023.71873\n14083.69519\n14085.70009\n14217.13510\n14250.07410\n14286.00169\n\nRV\n(m s−1 )\n\n1.98\n-2.44\n-11.19\n-16.16\n40.18\n-38.57\n-32.84\n-36.55\n-31.29\n5.66\n5.49\n25.79\n-39.18\n-37.48\n-40.18\n-15.89\n31.17\n\nUncertainties\n(m s−1 )\n\n3.41\n4.00\n3.74\n3.62\n3.32\n2.90\n2.93\n3.38\n3.34\n3.18\n3.11\n3.53\n2.43\n2.83\n2.99\n2.90\n2.86\n\n\f"}