{"id": "http://arxiv.org/abs/0809.3582v1", "guidislink": true, "updated": "2008-09-22T06:40:39Z", "updated_parsed": [2008, 9, 22, 6, 40, 39, 0, 266, 0], "published": "2008-09-22T06:40:39Z", "published_parsed": [2008, 9, 22, 6, 40, 39, 0, 266, 0], "title": "High-Tc Superconductivity in some Heavy Rare-earth Iron-arsenide\n  REFeAsO1-delta(RE = Ho, Y, Dy and Tb) Compounds", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0809.3424%2C0809.3126%2C0809.0149%2C0809.2964%2C0809.4760%2C0809.3964%2C0809.1847%2C0809.1909%2C0809.5175%2C0809.1310%2C0809.3562%2C0809.2690%2C0809.3657%2C0809.5281%2C0809.0446%2C0809.4854%2C0809.3582%2C0809.3279%2C0809.1229%2C0809.4264%2C0809.1541%2C0809.4887%2C0809.4928%2C0809.4162%2C0809.4140%2C0809.2344%2C0809.0313%2C0809.4324%2C0809.2100%2C0809.3769%2C0809.2655%2C0809.3435%2C0809.1842%2C0809.4004%2C0809.2999%2C0809.2566%2C0809.4611%2C0809.4068%2C0809.1285%2C0809.0940%2C0809.1097%2C0809.3648%2C0809.0629%2C0809.0553%2C0809.2245%2C0809.4767%2C0809.1279%2C0809.0679%2C0809.1040%2C0809.1237%2C0809.4810%2C0809.0485%2C0809.1304%2C0809.4484%2C0809.0972%2C0809.1259%2C0809.1727%2C0809.1714%2C0809.3189%2C0809.3795%2C0809.0499%2C0809.3879%2C0809.4145%2C0809.3652%2C0809.1353%2C0809.2487%2C0809.1728%2C0809.3066%2C0809.3757%2C0809.4350%2C0809.0336%2C0809.2866%2C0809.2519%2C0809.1701%2C0809.1014%2C0809.1383%2C0809.0074%2C0809.1824%2C0809.1658%2C0809.0562%2C0809.2175%2C0809.4345%2C0809.4209%2C0809.1626%2C0809.3342%2C0809.2619%2C0809.3409%2C0809.0116%2C0809.0597%2C0809.0309%2C0809.4136%2C0809.4587%2C0809.4722%2C0809.3472%2C0809.1400%2C0809.2331%2C0809.0150%2C0809.2660%2C0809.0585%2C0809.2324%2C0809.2008&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "High-Tc Superconductivity in some Heavy Rare-earth Iron-arsenide\n  REFeAsO1-delta(RE = Ho, Y, Dy and Tb) Compounds"}, "summary": "New iron-arsenide superconductors of REFeAsO1-delta (RE = Ho, Y, Dy and Tb)\nwere successfully synthesized by a high pressure synthesizing method with a\nspecial rapid quenching process, with the onset superconducting critical\ntemperatures at 50.3 K, 46.5 K, 52.2K and 48.5 K for RE = Ho, Y, Dy and Tb\nrespectively.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0809.3424%2C0809.3126%2C0809.0149%2C0809.2964%2C0809.4760%2C0809.3964%2C0809.1847%2C0809.1909%2C0809.5175%2C0809.1310%2C0809.3562%2C0809.2690%2C0809.3657%2C0809.5281%2C0809.0446%2C0809.4854%2C0809.3582%2C0809.3279%2C0809.1229%2C0809.4264%2C0809.1541%2C0809.4887%2C0809.4928%2C0809.4162%2C0809.4140%2C0809.2344%2C0809.0313%2C0809.4324%2C0809.2100%2C0809.3769%2C0809.2655%2C0809.3435%2C0809.1842%2C0809.4004%2C0809.2999%2C0809.2566%2C0809.4611%2C0809.4068%2C0809.1285%2C0809.0940%2C0809.1097%2C0809.3648%2C0809.0629%2C0809.0553%2C0809.2245%2C0809.4767%2C0809.1279%2C0809.0679%2C0809.1040%2C0809.1237%2C0809.4810%2C0809.0485%2C0809.1304%2C0809.4484%2C0809.0972%2C0809.1259%2C0809.1727%2C0809.1714%2C0809.3189%2C0809.3795%2C0809.0499%2C0809.3879%2C0809.4145%2C0809.3652%2C0809.1353%2C0809.2487%2C0809.1728%2C0809.3066%2C0809.3757%2C0809.4350%2C0809.0336%2C0809.2866%2C0809.2519%2C0809.1701%2C0809.1014%2C0809.1383%2C0809.0074%2C0809.1824%2C0809.1658%2C0809.0562%2C0809.2175%2C0809.4345%2C0809.4209%2C0809.1626%2C0809.3342%2C0809.2619%2C0809.3409%2C0809.0116%2C0809.0597%2C0809.0309%2C0809.4136%2C0809.4587%2C0809.4722%2C0809.3472%2C0809.1400%2C0809.2331%2C0809.0150%2C0809.2660%2C0809.0585%2C0809.2324%2C0809.2008&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "New iron-arsenide superconductors of REFeAsO1-delta (RE = Ho, Y, Dy and Tb)\nwere successfully synthesized by a high pressure synthesizing method with a\nspecial rapid quenching process, with the onset superconducting critical\ntemperatures at 50.3 K, 46.5 K, 52.2K and 48.5 K for RE = Ho, Y, Dy and Tb\nrespectively."}, "authors": ["Jie Yang", "Xiao-Li Shen", "Wei Lu", "Wei Yi", "Zheng-Cai Li", "Zhi-An Ren", "Guang-Can Che", "Xiao-Li Dong", "Li-Ling Sun", "Fang Zhou", "Zhong-Xian Zhao"], "author_detail": {"name": "Zhong-Xian Zhao"}, "author": "Zhong-Xian Zhao", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1088/1367-2630/11/2/025005", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0809.3582v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0809.3582v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "cond-mat.supr-con", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.supr-con", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0809.3582v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0809.3582v1", "arxiv_comment": null, "journal_reference": null, "doi": "10.1088/1367-2630/11/2/025005", "fulltext": "High-Tc Superconductivity in some Heavy Rare-earth Iron-arsenide\nREFeAsO1- (RE = Ho, Y, Dy and Tb) Compounds\nJie Yang, Xiao-Li Shen, Wei Lu, Wei Yi, Zheng-Cai Li,\nZhi-An Ren*, Guang-Can Che, Xiao-Li Dong, Li-Ling Sun, Fang Zhou, Zhong-Xian Zhao*\n\nNational Laboratory for Superconductivity, Institute of Physics and Beijing National\nLaboratory for Condensed Matter Physics, Chinese Academy of Sciences\nP. O. Box 603, Beijing 100190, P. R. China\nPACS numbers: 74.10.+v; 74.70.-b;\nKey Words: new superconductor; iron-arsenide; high-Tc; oxygen-deficient; heavy rare\nearth;\n\nAbstract:\nNew iron-arsenide superconductors of REFeAsO1- (RE = Ho, Y, Dy and Tb)\nwere successfully synthesized by a high pressure synthesizing method with a\nspecial rapid quenching process, with the onset superconducting critical\ntemperatures at 50.3 K, 46.5 K, 52.2K and 48.5 K for RE = Ho, Y, Dy and Tb\nrespectively.\n\n\fRecently new high temperature superconductivity was discovered in some\niron-arsenide compounds REFeAsO1-xFx (RE = rare earth elements) by\nfluorine doping, with the highest critical temperature (Tc) at 55 K [1-6]. With\nthe FeAs layer was found to be responsible for the unconventional\nsuperconductivity inside, F-free while oxygen-deficient REFeAsO1-\ncompounds were also discovered to be superconducting at similar\ntemperatures [7]. These quaternary superconductors have a layered tetragonal\nZrCuSiAs type structure with space group P4/nmm (denoted as 1111 phase),\nand can be described by the alternating stacking of [Fe 2As2]2+ layers and\n[RE2O2]2- layers. Besides, some oxygen-free iron-arsenide superconductors\nwere also discovered later, such as AFe2As2 (A = Ba, Sr, Ca and Eu, etc.) by\ncarrier doping or under pressure, LixFeAs, FeSe etc., which superconducts at\nlower temperatures [8-14]. Till now the electron pairing mechanism is still\nunclear in these superconducting materials, while all these iron-arsenide\nsuperconductors have made up the second high-Tc family after cuprates.\nAfter the discovery of F-free REFeAsO1- superconductors with RE = La, Ce,\nPr, Nd and Sm [7], we have also investigated these quaternary compounds of\nall other heavy rare earth elements by a high pressure synthesis method (HP),\nand clear superconducting signals have been observed in some multi-phase\nsamples with the Tc around 50 K when RE = Gd, Tb, Dy, Ho and Y. However,\nthe superconducting phase can not be distinguished by X-ray diffraction\n(XRD) analysis except for Gd [15]. Late Scanning Tunneling Microscopy\ninvestigation indicated the nanometer size of superconducting grains, which\nare not sensitive to XRD. A possible reason is that the 1111 phases with these\nheavy RE elements are meta-stable and easy to decompose. Independently,\nby synthesizing under a ultra-high pressure of about 12 GPa, F-doped 1111\nphase of TbFeAs(O,F) and DyFeAs(O,F) were reported to be\nsuperconducting around 46 K [16].\nHere we report the high-Tc superconductivity in some oxygen-deficient\nREFeAsO1- (RE = Ho, Y, Dy, Tb) compounds, which were successfully\nsynthesized by a revised HP method with a rapid quenching approach.\n\n\fThe starting chemicals of Ho, Y, Dy, Tb chips, and As, Fe, Fe2O3 powders\nare all with the purity better than 99.99%. At the first step, REAs powder was\nobtained by reacting RE pieces and As powders at 650 oC for 12 hours and\n1180 oC for 40 hours, and then thoroughly grounded into fine powder after\ncooled. For the HP synthesis, the appropriate amount of REAs, Fe and Fe2O3\npowders was mixed together according to a nominal chemical formula\nREFeAsO0.8, then grounded thoroughly and pressed into small pellets. The\npellet was sealed in boron nitride crucibles and then mounted in a six-anvil\nhigh pressure synthesis apparatus. After applied a high pressure of 5 GPa, the\ntemperature was increased to 1000 oC by electrical heating, and sintering for 1\nhour while keeping the pressure constant. Here a special rapid cooling process\nwas adopted. After switching off the power, the sample was quickly quenched\nto room temperature by water-cooling in about 1 minute and then the pressure\nwas released (HP method). The rapid quenching process was supposed to\nkeep the meta-stable phase that formed under high temperature and high\npressure. The synthesized samples are dense and hard with black color. For\ncomparison, we have also synthesized the above mentioned REFeAsO\nundoped compounds in sealed evacuated quartz-tube at 1180 oC for 60 hours\n(AP method).\nThe phase purity and structural identification were characterized by powder\nX-ray diffraction (XRD) analysis on an MXP18A-HF type diffractometer\nwith Cu-K radiation from 20o to 80o with a step of 0.01o. The XRD results\nindicate that for the 1111 phase of the AP samples, only TbFeAsO compound\nwas obtained, with the lattice parameters a = 3.898(1) Å, c= 8.404(2) Å, while\nother rare earth elements cannot form the parent 1111 phase by the AP\nmethod. The XRD pattern of the AP TbFeAsO sample was plotted in Fig. 1,\ntogether with a calculated pattern for identification of the 1111 phase. For the\nHP samples, besides the reported 1111 phases for RE = Dy and Tb, the same\nphases for RE = Ho and Y were discovered here. The XRD patterns for\nHoFeAsO1- and YFeAsO1- were also plotted in Fig. 1, and the main\ndiffraction peaks were pointed out by arrows. For all these samples with\nheavy rare earth metals, impurities always exist in the synthesized samples,\nand the main impurity phases were identified to be RE2O3, REAs and FeAs,\nwhich are all not superconducting in the measuring temperature. These\n\n\fREFeAsO1- phases were speculated to be meta-stable and decomposed at a\nlower temperature, and this explains why the quenching process worked to\npreserve the 1111 phase. The lattice parameters of all these synthesized 1111\nphases were summarized in Table. 1. Clearly, with the increase of ionic size of\nthe RE elements (Ho ≤Y < Dy < Tb), the lattice parameters monotonously\nincrease; and oxygen-vacancy causes the decrease of lattice parameters as we\nreported.\nTemperature dependence of the resistivity for all samples was measured by a\nstandard four-probe method from 5 K to 300 K. The AP samples were not\nsuperconducting while all HP samples exhibit superconducting zero\nresistance at low temperatures above 40 K (as shown in Fig. 2), with nearly\nlinear resistivity vs. temperature behavior above the superconducting\ntransition, similar with the previous discovered 1111 superconductors with\nlight rare earth elements. The onset superconducting transition temperatures\n(Tc(onset)) for these REFeAsO1- superconductors are 50.3 K, 46.5 K, 52.2K\nand 48.5 K for RE = Ho, Y, Dy and Tb respectively, as shown in Table. 1.\nThe DC magnetization was measured using a Quantum Design MPMS XL-1\nsystem. For an experiment cycle the sample was cooled to 1.8 K in zero field\ncooling (ZFC) and data were gathered when warming in an applied field, then\ncooled again under an applied field (FC) and measured when warming up.\nThe DC-magnetization data (measured under a magnetic field of 1 Oe) for all\nof the HP samples of HoFeAsO1-, YFeAsO1-, DyFeAsO1- and TbFeAsO1-\nare shown in Fig. 3 with both of ZFC and FC results, with the onset\ndiamagnetic transition temperature (determined from the ZFC curves) at 49.1\nK, 45.2 K, 51.0 K, and 46.8 K respectively. These are a little lower than the\nTc(onset) determined from the resistivity measurements, which can be\nattributed to the poorer quality of these superconductors than those with light\nrare earth elements [7], because of the difficulty in forming 1111 phases.\nNevertheless, the diamagnetic superconducting shielding fractions for all\nthese superconductors are from 30% to 75%, which indicate the bulk\nsuperconducting behavior of these compounds.\n\n\fIn conclusion, superconductivity has been achieved in some layered\nquaternary REFeAsO1- compounds (for RE = Ho, Y, Dy and Tb) by the\nintroducing of oxygen vacancy through HP synthesis, and the 1111 phase\nstructure was successfully stabilized by a rapid quenching process. Therefore,\ntogether with previous discovery, high-Tc superconductivity has been\ndiscovered in all of these REFeAsO1- compounds for RE = La, Ce, Pr, Nd,\nSm, Gd, Tb, Dy, Ho and Y.\n\nAcknowledgements:\nWe thank Mrs. Shun-Lian Jia for her kind helps in resistivity measurements.\nThis work is supported by Natural Science Foundation of China (NSFC, No.\n50571111 & 10734120) and 973 program of China (No. 2006CB601001 &\n2007CB925002). We also acknowledge the support from EC under the\nproject COMEPHS TTC.\n\n\n\nAuthors with equal contributions;\nCorresponding Authors:\nZhi-An Ren: renzhian@aphy.iphy.ac.cn\nZhong-Xian Zhao: zhxzhao@aphy.iphy.ac.cn\n*\n\nReferences:\n[1] Y. Kamihara, T. Watanabe, M. Hirano and H. Hosono 2008 J. Am. Chem. Soc. 130\n3296\n[2] Z. A. Ren, J. Yang, W. Lu, W. Yi, G. C. Che, X. L. Dong, L. L. Sun and Z. X. Zhao\n2008 Materials Research Innovations 12 105\n[3] Z. A. Ren, J. Yang, W. Lu, W. Yi, X L Shen, Z C Li, G. C. Che, X. L. Dong, L. L. Sun,\nF Zhou and Z. X. Zhao 2008 Europhys. Lett. 82 57002\n[4] X. H. Chen, T. Wu, G. Wu, R. H. Liu, H. Chen and D. F. Fang 2008 Nature 453 761\n[5] G. F. Chen, Z. Li, D. Wu, G. Li, W. Z. Hu, J. Dong, P. Zheng, J. L. Luo and N. L. Wang\n2008 phys. Rev. Lett. 100 247002\n\n\f[6] Z. A. Ren, W. Lu, J. Yang, W. Yi, X. L. Shen, Z. C. Li, G. C. Che, X. L. Dong, L. L.\nSun, F. Zhou and Z. X. Zhao 2008 Chin.Phys.Lett. 25 2215\n[7] Z. A. Ren, G. C. Che, X. L. Dong, J. Yang, W. Lu, W. Yi, X. L. Shen, Z. C. Li, L. L.\nSun, F. Zhou and Z. X. Zhao 2008 Europhys. Lett. 83 17002\n[8] Marianne Rotter, Marcus Tegel, Dirk Johrendt 2008 Phys. Rev. Lett. 101 107006\n[9] Kalyan Sasmal, Bing Lv, Bernd Lorenz, Arnold M. Guloy, Feng Chen, Yu-Yi Xue and\nChing-Wu Chu 2008 Phys. Rev. Lett. 101 107007\n[10] H.S. Jeevan, Z. Hossain, C. Geibel, P. Gegenwart, arXiv: 0807.2530\n[11] M.S. Torikachvili, S.L. Budko, N. Ni, P.C. Canfield, arXiv: 0807.0616\n[12] P.L. Alireza, J. Gillet, Y.T. Chris Ko, S.E. Sebastian, G.G. Lonzarich, arXiv:\n0807.1896\n[13] X.C.Wang, Q.Q. Liu, Y.X. Lv, W.B. Gao, L.X.Yang, R.C.Yu, F.Y.Li, C.Q. Jin, arXiv:\n0806.4688\n[14] Fong-Chi Hsu, Jiu-Yong Luo, Kuo-Wei Yeh, Ta-Kun Chen, Tzu-Wen Huang, Phillip\nM. Wu, Yong-Chi Lee, Yi-Lin Huang, Yan-Yi Chu, Der-Chung Yan, Maw-Kuen Wu,\narXiv: 0807.2369\n[15] Jie Yang, Zheng-Cai Li, Wei Lu, Wei Yi, Xiao-Li Shen, Zhi-An Ren, Guang-Can Che,\nXiao-Li Dong, Li-Ling Sun, Fang Zhou and Zhong-Xian Zhao 2008 Supercond. Sci.\nTechnol. 21 082001\n[16] Jan-Willem G. Bos, George B. S. Penny, Jennifer A. Rodgers, Dmitry A. Sokolov,\nAndrew D. Huxley and J. Paul Attfield 2008 Chem. Comm. 31 3634\n\nFigure Captions:\nFigure 1: Typical XRD patterns for synthesized undoped TbFeAsO (AP), superconducting\nYFeAsO1- and HoFeAsO1- (HP) compounds; the vertical bars indicate the calculated\ndiffraction peaks for the TbFeAsO.\nFigure 2: The temperature dependences of resistivity for the REFeAsO1- (RE = Ho, Y, Dy\nand Tb) superconductors synthesized by HP method.\nFigure 3: The temperature dependence of the DC-susceptibility (H = 1Oe) for the\nREFeAsO1- (RE = Ho, Y, Dy and Tb) superconductors synthesized by HP method.\n\n\fTable 1. The lattice parameters and superconducting critical temperature for\nsome REFeAsO1- compounds (RE = Ho, Y, Dy and Tb)\nREFeAsO1-\nHoFeAsO1-\nYFeAsO1-\nDyFeAsO1-\nTbFeAsO1-\nTbFeAsO\n\nFigure 1:\n\na/Å\n3.846(2)\n3.842(3)\n3.859(1)\n3.878(2)\n3.898(1)\n\nc/Å\n8.295(3)\n8.303(5)\n8.341(4)\n8.354(3)\n8.404(2)\n\nVol. / Å3\n122.7\n122.6\n124.2\n125.7\n127.7\n\nTc (onset-R) / K\n50.3\n46.5\n52.2\n48.5\n-\n\n\fFigure 2:\n\nFigure 3:\n\n\f"}