{"id": "http://arxiv.org/abs/1106.1585v1", "guidislink": true, "updated": "2011-06-08T15:44:14Z", "updated_parsed": [2011, 6, 8, 15, 44, 14, 2, 159, 0], "published": "2011-06-08T15:44:14Z", "published_parsed": [2011, 6, 8, 15, 44, 14, 2, 159, 0], "title": "New superspaces/algebras for superparticles/strings", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1106.4230%2C1106.0232%2C1106.2568%2C1106.2398%2C1106.3501%2C1106.1353%2C1106.0292%2C1106.6278%2C1106.1066%2C1106.4390%2C1106.2919%2C1106.4891%2C1106.1888%2C1106.1710%2C1106.1191%2C1106.3858%2C1106.4670%2C1106.2618%2C1106.2022%2C1106.1831%2C1106.3182%2C1106.5787%2C1106.0772%2C1106.5019%2C1106.3934%2C1106.2309%2C1106.3440%2C1106.0853%2C1106.1095%2C1106.4510%2C1106.5922%2C1106.0841%2C1106.3558%2C1106.3658%2C1106.3141%2C1106.2678%2C1106.0008%2C1106.0729%2C1106.2198%2C1106.4996%2C1106.1726%2C1106.2301%2C1106.6313%2C1106.6125%2C1106.3142%2C1106.3268%2C1106.3410%2C1106.4894%2C1106.2857%2C1106.3291%2C1106.5194%2C1106.0084%2C1106.2271%2C1106.4850%2C1106.0053%2C1106.3262%2C1106.6254%2C1106.4122%2C1106.5691%2C1106.3146%2C1106.3467%2C1106.5913%2C1106.2464%2C1106.1245%2C1106.0961%2C1106.3979%2C1106.0612%2C1106.3582%2C1106.4110%2C1106.0141%2C1106.3827%2C1106.0993%2C1106.1533%2C1106.4475%2C1106.0526%2C1106.2440%2C1106.6240%2C1106.4440%2C1106.1676%2C1106.4785%2C1106.1375%2C1106.4127%2C1106.5841%2C1106.5684%2C1106.5290%2C1106.3708%2C1106.2469%2C1106.0274%2C1106.2552%2C1106.0342%2C1106.4131%2C1106.5138%2C1106.4020%2C1106.1585%2C1106.1612%2C1106.3148%2C1106.4371%2C1106.6355%2C1106.3132%2C1106.2892%2C1106.2028&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "New superspaces/algebras for superparticles/strings"}, "summary": "We describe covariant derivatives with respect to the coordinates of the full\nsuperPoincar\\'e group and dual coordinates, for Yang-Mills and supergravity.\nThe derivatives have engineering dimension running from 0 to 2. Prepotentials\nappear as potentials for Lorentz derivatives (spin). Their role is clarified in\na lightcone analysis, where they also act as compensating gauge parameters and\nHertz potentials. Field strengths appear as potentials for dual-coordinate\nderivatives, until dimensional reduction. These generalizations extend the\nsuperstring's affine Lie algebra, and generalize gauge couplings for the\nsuperparticle.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1106.4230%2C1106.0232%2C1106.2568%2C1106.2398%2C1106.3501%2C1106.1353%2C1106.0292%2C1106.6278%2C1106.1066%2C1106.4390%2C1106.2919%2C1106.4891%2C1106.1888%2C1106.1710%2C1106.1191%2C1106.3858%2C1106.4670%2C1106.2618%2C1106.2022%2C1106.1831%2C1106.3182%2C1106.5787%2C1106.0772%2C1106.5019%2C1106.3934%2C1106.2309%2C1106.3440%2C1106.0853%2C1106.1095%2C1106.4510%2C1106.5922%2C1106.0841%2C1106.3558%2C1106.3658%2C1106.3141%2C1106.2678%2C1106.0008%2C1106.0729%2C1106.2198%2C1106.4996%2C1106.1726%2C1106.2301%2C1106.6313%2C1106.6125%2C1106.3142%2C1106.3268%2C1106.3410%2C1106.4894%2C1106.2857%2C1106.3291%2C1106.5194%2C1106.0084%2C1106.2271%2C1106.4850%2C1106.0053%2C1106.3262%2C1106.6254%2C1106.4122%2C1106.5691%2C1106.3146%2C1106.3467%2C1106.5913%2C1106.2464%2C1106.1245%2C1106.0961%2C1106.3979%2C1106.0612%2C1106.3582%2C1106.4110%2C1106.0141%2C1106.3827%2C1106.0993%2C1106.1533%2C1106.4475%2C1106.0526%2C1106.2440%2C1106.6240%2C1106.4440%2C1106.1676%2C1106.4785%2C1106.1375%2C1106.4127%2C1106.5841%2C1106.5684%2C1106.5290%2C1106.3708%2C1106.2469%2C1106.0274%2C1106.2552%2C1106.0342%2C1106.4131%2C1106.5138%2C1106.4020%2C1106.1585%2C1106.1612%2C1106.3148%2C1106.4371%2C1106.6355%2C1106.3132%2C1106.2892%2C1106.2028&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We describe covariant derivatives with respect to the coordinates of the full\nsuperPoincar\\'e group and dual coordinates, for Yang-Mills and supergravity.\nThe derivatives have engineering dimension running from 0 to 2. Prepotentials\nappear as potentials for Lorentz derivatives (spin). Their role is clarified in\na lightcone analysis, where they also act as compensating gauge parameters and\nHertz potentials. Field strengths appear as potentials for dual-coordinate\nderivatives, until dimensional reduction. These generalizations extend the\nsuperstring's affine Lie algebra, and generalize gauge couplings for the\nsuperparticle."}, "authors": ["Warren Siegel"], "author_detail": {"name": "Warren Siegel"}, "author": "Warren Siegel", "arxiv_comment": "37 pages", "links": [{"href": "http://arxiv.org/abs/1106.1585v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1106.1585v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "hep-th", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "hep-th", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1106.1585v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1106.1585v1", "journal_reference": null, "doi": null, "fulltext": "arXiv:1106.1585v1 [hep-th] 8 Jun 2011\n\nJune 8, 2011\n\nYITP-SB-11-18\n\nNew superspaces/algebras\nfor superparticles/strings\nW. Siegel*\nC. N. Yang Institute for Theoretical Physics\nState University of New York, Stony Brook, NY 11794-3840\n\nABSTRACT\nWe describe covariant derivatives with respect to the coordinates of the\nfull superPoincaré group and dual coordinates, for Yang-Mills and supergravity. The derivatives have engineering dimension running from 0 to 2.\nPrepotentials appear as potentials for Lorentz derivatives (spin). Their role\nis clarified in a lightcone analysis, where they also act as compensating gauge\nparameters and Hertz potentials. Field strengths appear as potentials for\ndual-coordinate derivatives, until dimensional reduction. These generalizations extend the superstring's affine Lie algebra, and generalize gauge couplings for the superparticle.\n\n* mailto:siegel@insti.physics.sunysb.edu\nhttp://insti.physics.sunysb.edu/ ̃siegel/plan.html\n\n\f2\n\n.............................\n.............................\n\nIntroduction\n\n.............................\n.............................\n\nMotivated by constructions of currents for first-quantization of superparticles and\nsuperstrings, we extend the covariant derivatives of (super) Yang-Mills and gravity\nto include not only those corresponding to translations, spin, and (for the supersymmetric cases) supersymmetry, but also those \"dual\" to spin and supersymmetry.\nThere are extra coordinates associated with the extra derivatives, but they can be\neliminated by both (1) isotropy (coset) constraints, for the gauge-covariant derivative for spin, and (2) dimensional reduction, by constraining symmetry generators\ndual to spin and supersymmetry. The dimensional reduction allows the usual field\nstrengths to be interpreted as gauge fields of the extra dimensions, and exhibits a\nduality between field strengths and (pre)potentials. The coset constraints define spin\nas a differential operator, so in gravity the vierbein and Lorentz connection can be\ntreated on equal footing. The extra coordinates allow prepotentials to appear as (undifferentiated) potentials in the covariant derivatives that otherwise would be of too\nlow (engineering) dimension to do so. R-symmetry can be treated in the same way\nas spin, and arises from spin upon (the usual kind of) dimensional reduction; \"±\"\ndirections in lightcone treatments can also be interpreted as directions in R-space.\nIn the next section we outline the general construction, introducing extra gauge\nfields by gauge covariantizing before eliminating extra coordinates. From a firstquantization point of view, the extra derivatives are natural for coupling external\nfields, and their currents automatically arise in the action.\nIn the following section we give some examples: In N=0 Yang-Mills, gauge covariantizing the spin introduces a nontrivial dimensionless potential in the lightcone\ngauge, where it acts as both Hertz potential and compensating gauge parameter that\nautomatically makes all Lorentz transformations gauge preserving. In selfdual (4D)\nYang-Mills (supersymmetric or not), the usual prepotential appears as this potential,\nautomatically in the covariant derivatives without solving differential constraints. In\nselfdual (gauged) supergravity, the dual derivatives come into play, allowing the usual\nprepotential, which now has negative dimension, to again appear as a potential (without derivatives acting on it) in the covariant spin derivative, as a \"connection\" for\nthe derivative dual to spin. Similar remarks apply to the non-selfdual case.\nWe devote the subsequent section to a lightcone analysis of 10D super Yang-Mills.\nThe usual lightcone treatment can be derived straightforwardly from the covariant\none, and suggests a covariant analysis for 4D N=4 when lightlike directions are treated\nas null, complex, spacelike directions in R-space. Directions for further research are\nsugested in the conclusions.\n\n\fFirst-quantization\n\n.........................\n.........................\n\n3\n\nFirst-quantization\n\n.........................\n.........................\n\nCosets\nSuperspace is generally defined as the coset space (G/H) of the symmetry (isometry) group superPoincaré (G) mod the gauge (isotropy) group Lorentz (H). As in the\nusual coset construction, the coordinates of the space parametrize a group element,\nwith the global symmetry derived from group multiplication from one side and covariant derivatives from group multiplication on the other, converted into differential\noperators on the group space:\nδg(z) = (iǫA TA )g + g(iζ A TA ) = (ǫA qA + ζ A dA )g,\ng −1 dg = i dz M RM A TA ,\ndA = RA M ∂M ,\n[dA , dB } = fAB C dC ,\n\n[TA , TB } = −ifAB C TC ,\n\n(dg)g −1 = i dz M LM A TA\nqA = LA M ∂M\n[qA , qB } = −fAB C qC\n\nwhere g is a group element in a matrix (or Hilbert space) representation where the generators are represented by TA , parametrized by coordinates z M , dA are the covariant\nderivatives, qA are the symmetry generators, and fAB C are the structure constants, the\nfree value of the torsion. For (compact) internal symmetries, the distinction between\nleft and right multiplication is arbitrary; but for spacetime symmetries (especially\nsupersymmetry) there are physical differences, as we'll explain in this subsection and\nthe following one.\nThe representation space |ψi of the coset is then expressed as wave functions\nψi (z) ≡ hz, i |ψi with basis element |z, i i defined by\n|z, i i ≡ g(z)|0, i i,\n\nT(H),I |0, i i = |0, j iHIj i\n\n⇔\n\nd(H),I ψi (z) = HIi j ψj (z)\n\nOnly the derivatives d(G/H) act nontrivially on the coset, the other (isotropy) derivatives d(H) having been used as constraints (set equal to a matrix representation HI\non the fields) to define it.\nIn (super) Yang-Mills these symmetry-covariant derivatives are then also covariantized with respect to the Yang-Mills gauge group:\ndA → ∇A = dA + iAA\n[∇A , ∇B } = fAB C ∇C + iFAB\n(The Yang-Mills gauge group is unrelated to the isotropy gauge group, except in a\nsomewhat misleading sense in gravity.) We can always set ∇(H) = d(H) in some gauge\n\n\f4\n\nsince [∇(H) , ∇(H) } = f ∇(H) (i.e., F(H)(H) = 0), but in this paper we'll consider the\nalternative.\nOur treatment of general curved spaces is a direct generalization of the coset construction for maximally symmetric spaces (flat or de Sitter). In this first-quantized\napproach to (super)gravity the derivatives are gauge covariantized with respect to the\nsuperPoincaré group itself: The Yang-Mills generators (in some matrix representation) are effectively replaced with derivatives with respect to all the coordinates:\ndA → ∇A = eA M ∂M = êA M dM\n[∇A , ∇B } = TAB C ∇C\nwhere e (or ê) is now arbitrary. Acting on a representation of the Lorentz derivatives\n∇(H) , the coefficients of ∇(H) in the covariant derivatives ∇(G/H) are called \"Lorentz\nconnections\"; coefficients of ∇(H) in the torsion term T ∇ (i.e., T(G/H)(G/H) (H) ) are\ncalled \"curvatures\". Local Lorentz transformations are now included with the rest of\nthe coordinate transformations:\n∇′ = eΛ ∇e−Λ ,\n\nΛ = ΛM dM = Λ̂A ∇A\n\nThe usual action of local Lorentz transformations on the coset part ∇(G/H) of the\ncovariant derivative is fixed by the commutator [∇(H) , ∇(G/H) }, whose torsions take\ntheir free values (as again does [∇(H) , ∇(H) }).\nIn this paper we reorganize this procedure: The isotropy constraints are applied\nas part of the last step of defining the theory, along with the field equations and\nother constraints. We thus have \"covariant\" derivatives dA for the full group (G),\nand they are actually invariant under the full symmetry group (since left and right\nmultiplication commute, by associativity). The usual covariant derivatives can be\nobtained by using the isotropy constraints (d(H) ) to fix a (unitary) gauge by eliminating the conjugate coordinates. However, if we do not fix the gauge for the Lorentz\nconstraint, but leave the Lorentz coordinates, the remaining derivatives (for translations and supersymmetry) retain their invariance under Lorentz transformations.\nThe covariant Lorentz derivatives (\"spin\") then vanish (for scalars), or equal a particular matrix representation, when acting on a particular superfield. This is the\nfirst-quantized method of defining spin as differential operators, by giving fields (and\ninvariant derivatives) simple, fixed dependence on spin coordinates. (Similar remarks\napply to scale weight in conformal theories derived from higher dimensions [1], which\nappears in the field as an extra coordinate to the power of the scale weight.)\n\n\fFirst-quantization\n\n5\n\nMore importantly, we gauge covariantize the Yang-Mills and supergravity covariant derivatives before applying the isotropy constraints. Some consequences are:\n(1) the introduction of new gauge fields for derivatives with respect to the coordinates of the isotropy group, which function as prepotentials and (in lightcone gauges)\nHertz potentials and compensating gauge parameters; (2) in supergravity, the treatment of the local Lorentz group on a par with general coordinate transformations, so\nLorentz generators act as first-quantized operators, and curvatures become additional\ntorsions; and (3) in first quantization, an extension of the affine Lie algebra of the\nsuperstring, which also appears for the (gauge-fixed) superparticle off shell, and in the\nsupergravity covariant derivatives as new central charges, making it a direct extension\nof the algebra of the super Yang-Mills covariant derivatives (see next subsection).\nAs a generalization, one can define the Lorentz representation by applying not all\nthe Lorentz derivatives as constraints, but some subalgebra that includes a Cartan\nsubalgebra. A similar analysis is applied in the corresponding approach to coordinates\nfor R-symmetry (which can be derived from higher-dimensional Lorentz symmetry)\nin projective [2] and harmonic [3,4] superspaces. (Similar Lorentz components for\nYang-Mills gauge fields have been considered previously [5,6], but with a different\nanalysis of the constraints. Such coordinates also appear in the pure spinor formalism [7] as the coset space SO(10)/U(5), but without corresponding gauge field\ncomponents.) Although the procedure may look noncovariant, since we pick only a\nLorentz subgroup, covariance is preserved simply because each constraint is invariant\nunder the full symmetry group. Fewer constraints means a larger superspace; noncovariance is avoided because not all Lorentz coordinates can now be gauged away\n(but dependence on them is fixed by field equations). The advantage is that some\nsupersymmetry derivatives can be added to the constraints, as long as the constraint\nalgebra still closes. (If all Lorentz derivatives were constrained, only full representations of the Lorentz derivatives could be used.) As a result, the increase in the\nnumber of bosonic coordinates of the coset space can be traded for a decrease in\nthe number of fermionic coordinates. Note that, unlike most previous approaches,\nhere the additional coordinates are not added to the usual coset superspace superPoincaré/Lorentz; instead we use the usual coset construction, with superPoincaré as\nthe symmetry group, but reduce the isotropy group.\nThe lightcone analysis of this paper can be interpreted in this fashion: Some of\nthe results may then be applied to a covariant analysis. However, the solution of\nthe field equations introduces factors of 1/p+ , which are nonlocal even when treated\ncovariantly, so such equations shouldn't be considered as kinematic constraints.\n\n\f6\n\nDimensional reduction and superstrings\nDimensional reduction is a generalization of the usual coset construction: It imposes (linear) constraints on the symmetry generators q, not the covariant derivatives d. As a result, it does not involve the gauge fields. If these constraints were\nnot originally central to the symmetry group, they become so, by definition: These\nconstraints reduce the symmetry to the subgroup that preserves them; however, all\ncovariant derivatives remain invariant. A familiar example is defining translations in\nextra dimensions as constraints. In that case, the covariant derivatives corresponding\nto translations happen to be just translations themsleves, so all that survives of the\ncorresponding Yang-Mills covariant derivatives is scalars (without derivatives). And\nthe Lorentz symmetry is reduced to Lorentz for the smaller surviving dimensions plus\n\"internal\" symmetry for those eliminated. For example, D=26 Yang-Mills dimensionally reduced to D=4 gives Yang-Mills plus 24 scalars, while the analogous coset would\nyield just 4D Yang-Mills without the scalars.\nA less familiar example is the construction for the superstring: It's known from\nthe constraint approach to the superstring that the affine Lie algebra for the covariant\nderivatives includes not only stringy generalizations (currents) D(σ) and P (σ) of the\nsuperparticle's d (for supersymmetry) and p (for translations), but a further operator\nΩ(σ) ∼ Θ ′ (σ) (where \" ′ \" is the derivative with respect to the worldsheet coordinate\nσ) needed for closure of the algebra [8,9]. This Ω is thus dual to D in the sense\nthat D is a kind of Θ derivative while Ω is a kind of Θ 1-form (over σ space), and\nconsequently also in the sense that they are spinors of opposite chirality.\nSpecifically, if we look at the fusion of the superparticle's {d, d} ∼ p and the\nbosonic string's [P, P ] ∼ δ ′ , then by applying the Jacobi identity for DDP we find\nthe requirement of an Ω such that [D, P ] ∼ Ω (times δ(σ), which we leave implicit)\nand {D, Ω} ∼ δ ′ (but making δ ′ (σ) explicit):\n{D, [D, P ]} ∼ [{D, D}, P ] ∼ [P, P ] ∼ δ ′\n(as well as the γ-matrix Fierz identity that fixes D=3,4,6,10 classically, for minimal\nsupersymmetry). Writing collectively\nDA = (Dα , Pa , Ω α )\nwe then have an affine Lie algebra (fixed-\"time\" current commutation relations) of\nthe form\n[DA (1), DB (2)} = −iδ ′ (1 − 2)ηAB + δ(1 − 2)fAB C DC\n\n\fFirst-quantization\n\n7\n\nwhere the arguments refer to different values of σ, and the torsions (structure constants) f are formed from factors of the Minkowski metric and γ (generalized Pauli)\nmatrices. (Underlined Roman indices are Lorentz vector, underlined Greek indices\nare Lorentz spinor.) These commutation relations can be solved in terms of the usual\ncoordinates X and Θ, derivatives δ/δX and δ/δΘ with respect to them, and their σ\nderivatives X ′ and Θ ′ . (The δ ′ includes a 1/α′ for dimensional analysis if the D's are\nnormalized as derivatives, or α′ if they're normalized as currents.)\nFurthermore, in the Lagrangian approach these currents already occur for the\n.\n.\n(gauge-fixed) superparticle off shell, with Θ ′ (σ) replaced with θ(τ ) (where \" \" is the\nderivative with respect to the worldline \"time\" τ ), as it appears in all of D, P, Ω →\n.\nd, p, ω [10]. Although θ might seem trivial, since it vanishes on shell (in an appropriate gauge), its propagator with the conjugate variable π generates a δ(τ ), which\nis responsible for 4-point interactions. In other words, the external field coupling\n.\n.\nθ → θ + W (for spinor field strength W ) makes its equation of motion nontrivial.\nThis is also clear from an operator product point of view, since the only differences\nin operator products for the free (after gauge fixing) operators of the superparticle\n.\n.\nand string are: (1) For the superparticle we use the operators x, θ, θ, and π, functions\nof only τ , at unequal times, while for the superstring we use the chiral ∂z X, Θ, ∂z Θ,\nand Π, functions of only z; and (2) the propagators are different in the two cases,\nas a result of which the η term will disappear in the particle case if we restrict the\noperator products to equal-time commutators, but at general times the algebra will\nbe the same (with different coordinate dependence in the coefficients).\nThe DP Ω affine Lie algebra of the superstring can also be derived as a generalization of an ordinary dpω Lie algebra for the superparticle defined by the above f\nby introducing coordinates Z M (σ) for the group [11]: We now write\ndA = (dα , da , d ̃α ) = (dα , pa , ω α )\n(and similarly for qA ) where d ̃α is \"dual\" to dα with respect to the above group metric\nηAB . But the coordinates for D̃ α are redundant, and can be eliminated by constraining the \"symmetry generators\" Q̃α (σ) to vanish [12] (i.e., dimensional reduction of\nthe fermionic coordinates). This forces the symmetry generators Qα (σ) to be reduced to just their zero-modes qα (since {Qα (1), Q̃β (2)} ∼ δα β δ ′ (1 − 2)), the usual\nsupersymmetry.\nA similar construction works for Type II superstrings, introducing separate left\nand right-handed DP Ω algebras and coordinates, with a reduction constraint [13]\nQ̃a ≡ QLa − QRa = 0\n\n\f8\n\nto identify the bosonic coordinates for both handednesses; the remaining qa symmetry\nis just the zero-modes of Qa ≡ QLa + QRa , i.e., the usual translations pa , since\n[Qa , Q̃b ] ∼ ηab δ ′ . (This can be done for all strings, but for the heterotic case one\nhandedness has only P in its algebra, and Type I can be described as one-handed.)\nThus for the string one generally starts with twice as many coordinates as symmetries,\nand half the symmetries (the \"dual\" ones) are constrained, to ban all but the zeromodes of the other half as symmetries. This construction can also be applied to the\nsuperparticle, and yields a description of supergravity with manifest T-duality [14].\nNote that left and right-handedness on the worldsheet are not the same as left and\nright multipication of the group elements: The symmetry currents are always associated with the on-shell modes, while the isotropy currents are associated with modes\nof the opposite worldsheet handedness. (This is related to unitarity [12], since for\nsupersymmetry {q, q †} = E but {d, d†} = −E. This \"wrong sign\" for the supersymmetry covariant derivatives dα is exactly why they are \"eliminated\" by second-class\nconstraints.) Equivalently, one treats the group element g for one worldsheet handedness in the same way as g −1 for the other, giving the usual opposite signs in the\nWess-Zumino term. For the rest of this paper we'll usually ignore dualization of\ntranslations.\nThis affine Lie algebra follows from an ordinary Lie algebra (defined by f ) that\nis similar in appearance to that for the super Yang-Mills covariant derivatives and\nspinor field strength\n∇α , ∇ a , W α\n(again in D=3,4,6,10) except that the latter algebra has also the bosonic field strength\nFab . This is related to the fact that, with these variables for first-quantization, external super Yang-Mills coupling to the superparticle (by Lorentz invariance and\ndimensional analysis) is described (see next subsection) by the vector connection coupling as usual to p, the spinor connection to ω, and the spinor field strength W to\nd, but the antisymmetric tensor field strength F can only couple to the (super)spin\ns, the usual relativistic Pauli term. (Such a term has proven necessary in covariant\nquantizations of the superparticle/superstring, although previously it appeared only\nthrough ghost coordinates [7,15].)\nThis asymmetry is resolved when coordinates for the Lorentz group are introduced\nto define the spin: We then have not only Lorentz \"covariant derivatives\" (the spin\noperators), analogous to the spinor derivatives d, but also a dual Lorentz \"current\" of\n.\nthe form g −1 g in terms of the Lorentz group element g (parametrized by the Lorentz\n\n\fFirst-quantization\n\n9\n\ncoordinates), analogous to ω. (All of d, p, and ω will also get dependence on the\nLorentz coordinates.) The affine Lie algebra is then extended to\nDA = (Sab , Dα , Pa , Ω α , Σ ab )\nThe requirement of Σ follows similarly to that of Ω: Instead of the supersymmetry\nalgebra for d, p, we now consider the superPoincaré algebra of s, d, p; then applying\nthe Jacobi identity for SP P , we find the requirement of a Σ such that [P, P ] ∼ Σ\n(+δ ′ ) and [S, Σ] ∼ δ ′ (+Σ):\n[S, [P, P ]] ∼ [[S, P ], P ] ∼ [P, P ] ∼ δ ′ (+Σ)\nSimilarly, the SDΩ Jacobi implies {D, Ω} ∼ Σ (+δ ′ ). The components of f then\nappear as in the table of commutators (fixed mostly by dimension and Lorentz symmetry):\nf\n\nS\n\nD\n\nP\n\nΩ\n\nΣ\n\nS\n\nS\n\nD\n\nP\n\nΩ\n\nΣ\n\nD\n\nD\n\nP\n\nΩ\n\nΣ\n\nP\n\nP\n\nΩ\n\nΣ\n\nΩ\n\nΩ\n\nΣ\n\nΣ\n\nΣ\n\n(Note that δ ′ and Σ now always accompany each other. This is also true when\ntranslations are dualized, so [P, P̃ ] gives both, but [P, P ] and [P̃ , P̃ ] neither, so all\n\"dual\" currents commute with each other.) As for the other dual symmetries, the\ndual spin coordinates are eliminated by dimensional reduction Q̃ab = 0.\nSuch an extension is natural for anti de Sitter compactifications, where \"translations\" require Lorentz for closure (but the structure constants are modified from the\nabove).\n\nCoupling and superparticles\nWe now consider coupling of external fields: Without loss of generality we specialize to the superparticle, which has these same currents in its Lagrangian; we begin\nwith super Yang-Mills. The Lorentz components of the gauge field will then couple\nto this dual Lorentz current. Thus, we not only have a spinor connection of opposite\nchirality to the spinor field strength, but also an antisymmetric tensor gauge field\n\"dual\" to the antisymmetric tensor field strength. Being of lowest dimension (1 lower\n\n\f10\n\nthan the vector), this gauge field should be interpreted as the \"prepotential\". Thus\nthe general coupling in the Lagrangian now takes the form\n1 ab\n2 F sab\n\n+ W α dα + Aa pa + Aα ω α + 12 Aab σ ab\n\nwhere in terms of the full symmetry group element g of translations + supersymmetry\n+ Lorentz the currents J are defined as usual by\n.\n−ig −1 g = pa Ta + ω α Tα + 21 σ ab Tab\nfor some matrix representation T of the various generators. (Before including Lorentz\n. a\n.\n.\ncoordinates, we had simply −iω α = θ α and −ipa = xa + i 12 θα γαβ θβ .)\nSo we have the currents, progressively increasing in dimension by 1/2, and the\nfields doing the same,\ndA = (sab , dα , pa , ω α , σ ab )\nAA = (Aab , Aα , Aa , W α , F ab )\n(We use graded antihermitian derivatives, so p ≈ ∂x without the −i, etc.) The\nlatter can be considered gauge fields for the former in the operator (or Hamiltonian)\napproach, so these extended covariant derivatives for super Yang-Mills take the form\ne α, ∇\ne ab )\n∇A = dA + iAA = (∇ab , ∇α , ∇a , ∇\n\nThis differs from earlier treatments in that it includes (1) the spin derivative sab , and\n(2) the dual spin current σ ab , which is necessary for an invertible metric ηAB (not the\nnon-invertible Cartan metric), but also treats the bosonic field strength F ab in the\nsame way as the fermionic one W α .\nNote that this antisymmetric tensor Yang-Mills gauge field covariantizes the antisymmetric tensor spin \"covariant derivatives\": We now have vector, spinor, and\nantisymmetric tensor covariant derivatives, all of which transform under the same\nYang-Mills gauge transformations. We have extended the (super)coordinate space,\nnot the gauge group.\nThe interaction in the operator approach comes from a generalized d'Alembertian,\nusing the (inverse) metric η AB that relates quantities of opposite dimension with\nrespect to the average. The higher-dimension currents vanish on shell in the operator\napproach for the superparticle, so their \"gauge fields\" are really field strengths. (These\ncurrents for the superstring have only σ derivative terms, so similar remarks apply\nfor their zero-modes.)\n\n\fFirst-quantization\n\n11\n\nAs usual, this analysis can be generalized directly to supergravity (or the closed\nsuperstring): In the Lagrangian approach, supergravity couplings are written as the\n\"square\" of super Yang-Mills couplings. (In the operator approach, vertex operators are also squares for the superstring, where higher-point contributions can be\nneglected.) In particular, the supergravity \"prepotential\" now carries the same index structure as the Riemann tensor, appearing as 81 σ ab σ cd hab,cd , where hab,cd has\ndimension 2 less than the metric.\nThe appearance of this prepotential in the covariant derivatives can be understood\nfrom the point of view of the first-quantized action as describing parallel transport\nR\nR\n.\nalong the worldline: A transport term dz M ∇M = dτ z M ∇M shows that not\nonly will the prepotential appear in the Lorentz covariant derivative, but as the\ncoefficient of the dual Lorentz current. Although for the superstring this current\nsurvives on shell, and therefore also in a second-quantized approach, its usefulness\nfor the superparticle requires a further generalization. (This generalization is trivial,\nalthough perhaps pedagogical, for super Yang-Mills.)\nFor supergravity we then have for this enlarged space (including dual coordinates)\n[∇A , ∇B } = TAB C ∇C ,\n∇′ = eΛ ∇e−Λ ,\n\n∇A = EA M dM\n\nΛ = ΛM dM = Λ̂A ∇A\n\nwhere dM are the flat-space derivatives, but we can also expand over partial derivatives. (This is opposite to some approaches in the literature, where all transformations, including Lorentz, supersymmetry, and even translations are treated as YangMills gauge transformations, so all field strengths are \"curvatures\" [16].) A more\nuseful concept is then to expand the torsion around its vacuum value, i.e.,\nTAB C → fAB C + TAB C\n\nFirst-class constraints\nFor most of the rest of this paper we concentrate on how these prepotentials\ncontribute to solving constraints in a lightcone (or lightcone-like covariant) formalism.\nWe first derive results for all free theories from group theoretic considerations of\nfirst-quantization. All free massless supersymmetric theories satisfy a simple set of\nequations of motion, the subset of the free superconformal equations of motion that\ndon't involve S-supersymmetry or conformal boosts [9,17]. (Equivalent equations\nappear in pure spinor formulations with regard to the b ghost [18].) These can be\nexpressed in first-quantized language in terms of p, d, and s (and the scale weight\n\n\f12\n\nw, which is determined by the superspin; we ignore central charges, which vanish on\nshell, and don't appear in a superconformal derivation).\nBecause the equations are highly reducible, the higher-(engineering-)dimension\nequations follow from the lower-dimension ones by hitting with spinor derivatives\n(the reverse of the procedure of deriving them by applying S-supersymmetry to the\nKlein-Gordon equation). It's more convenient to solve them from the top down in a\nlightcone analysis, where we pick out the irreducible pieces that have been projected\nby replacement of a free vector index by +, and multiplication of spinor equations by\nthe corresponding vector component of the Dirac matrices γ + . (These are really the\nPauli matrices, since we use Weyl spinors; we normalize {γ a , γ b } = −η ab . As usual\nthe lightcone basis is defined by denoting two null directions of a vector by \"+\" and\n\"−\", where we normalize η +− = −1.)\nWe divide the constraints into two subsets: (1) The first, which we call \"field\nequations\", always have a factor of momentum, and thus can be solved easily in a\nlightcone analysis by picking out the p+ term:\n\np2 = 0\n\n⇒\n\np/d = 0\n\n⇒\n\nsab pb + wpa = 0\n\n⇒\n\n(pi )2\n,\n2p+\n1\nγ − d = + γ i pi γ − (γ + d),\np\n1\nsi− = + sij pj , s+− = w,\np\np− =\n\ngauge x+ = 0\ngauge γ + θ = 0\ngauge s+i = 0\n\nThe scale weight w is determined in terms of the spin representation as that which\ngives a nontrivial solution. In supersymmetric theories the first solution is redundant\nto the second, since {γ − d, γ − d} = −γ − p− (from {d, d} = γ a pa ).\nThe first (Klein-Gordon) equation is the field equation that determines dependence on the lightcone \"time\" x+ . The second (\"κ-symmetry\") and third determine\nthe dependence on the \"non-lightcone\" fermionic coordinates γ + θ and the longitudinal spin components s±i , s+− . The gauge choices are unitary transformations in\nfield theory; for the time this is the usual time-development operator. (The equations\nshould be imposed on field strengths, but in the lightcone gauge these are the same\nas the gauge fields up to factors of p+ . The only effect is to shift w to 0 for the gauge\nfield.) There are also versions of the free equations directly in terms of symmetry\ngenerators (which is the form given by applying S-supersymmetry to Klein-Gordon),\nbut the covariant derivative form is that obtained from actions; in particular, the\nsymmetry-covariant derivatives (actually symmetry invariant before fixing Lorentz\n\n\fFirst-quantization\n\n13\n\ncoordinates) are gauge covariantized for interactions. The solutions to the field equations can be used to replace derivatives with respect to non-lightcone coordinates in\nthe symmetry generators, and the corresponding gauge choices to replace the coordinates themselves.\nFor example, the last equation applied to a vector gives\n1\n1\nsi− Aj = + pk sik Aj = + (pj Ai − δ ij pk Ak )\np\np\nwhere we have used\nsij Ak = A[i δ j]k ≡ Ai δ jk − Aj δ ik\n(2) The second subset, which we call \"representation constraints\", further restrict\nthe dependence on the surviving fermionic coordinates γ − θ:\ndγ abc d + 12 s[ab pc] = 0\n( 21 γ ab sab + w ′)d = 0\n(where w ′ is another constant, related to the scale weight.) For cases with nonvanishing spin, the former is redundant to the latter. They take the place of second-class\nconstraints. There can be additional terms for R-symmetry: In this paper we mostly\nrestrict to 10D minimal supersymmetry (super Yang-Mills) to avoid them, but they\ncan be obtained by dimensional reduction. (In superconformal field theory, such constraints are known as \"semi-shortening\" conditions; on the other hand, \"shortening\"\nconditions are the usual isotropy constraints.)\nFor example, reducing to D=4 and then truncating to N=1, for the case of a\nscalar with nonvanishing R-symmetry U(1) charge Y , the latter simplifies to\n(γ−1 Y + w ′ )d = 0\nin Dirac spinor notation, where \"γ−1 \" is the product of all the 4D γ matrices. This\nconstraint then states that the scalar is a chiral superfield, and its complex conjugate\nantichiral.\nFor the case of 10D super Yang-Mills, after applying the lightcone analysis to the\nfield equations, the latter reduces on a vector to\n( 12 γ ij sij + w ′ )(γ + d)Ak = 0\n\n⇒\n\n(γ + d)Ai − tr = 0\n\nwhere \"tr\" is the γ-matrix trace. We can also consider its action on a spinor,\n( 21 γ ij sij + w ′ )(γ + d)(γ − A) = 0\n\n⇒\n\n(γ + d)(γ − A) − tr = 0\n\n(again a γ-trace, i.e., subtracting the one-γ i term), which is related to the vector case\nby triality. Solution of these equations requires a second halving of the θ's: We'll do\nthis analysis for these cases below.\n\n\f14\n\n................................\n................................\n\nExamples\n\n................................\n................................\n\nBosonic Yang-Mills\nNontrivial gauge-covariant Lorentz derivatives already exist in Lorentz-noncovariant gauges for nonsupersymmetric theories, although they have generally gone unnoticed. In a lightcone approach, the nontriviality of the gauge fields for the \"Lorentz\nderivatives\" appears as part of the nonlinearity (in fields) of the Lorentz symmetry\ngenerators. (The remainder of the nonlinearity is due to solving the field equations, as\nin lightcone formulations of nongauge theories.) The \"spin\" terms in such operators\n(i.e., terms that differ from their action on color-singlet scalars) include \"compensating gauge transformations\" that restore the gauge condition after the Lorentz transformation. But the spin operators are just the covariant derivatives (the \"isotropy\"\nconstraints define the spin representation), so solving the constraints on the covariant\nderivatives is an equivalent approach to this problem.\nFor example, consider pure nonsupersymmetric Yang-Mills, with covariant derivatives ∇ for both translations and Lorentz transformations, and field strengths F\n∇ = d + iA,\n\n[∇a , ∇b ] = iF ab ,\n\n[∇a , ∇bc ] = η a[b ∇c]\n\ne ab = σ ab + iF ab .) We now use d for all free covari(We will forgo introducing ∇\nant derivatives (distinguished by indices), and ∂ for all partial derivatives. (Lorentz\nderivatives have the implied commutators with themselves, and their field strengths\nvanish.) In particular,\n[∇i− , ∇j ] = −δ ij ∇−\n\n⇒\n\ndi− Aj = −δ ij A− + ∇j Ai−\n\nThe first term is the usual covariant spin term, while the second can be recognized\nas a gauge transformation. The full symmetry generator J i− is then the sum of\nthis spin piece and the usual \"orbital\" piece x[i ∂ −] ≡ xi ∂ − − x− ∂ i . (A− and ∂ − are\nthen determined by the field equations, as usual.) Thus in the standard approach\nAi− appears surreptitiously as these compensating gauge parameters themselves. In\ncovariant langauge, there is no \"repair\" of the Lorentz transformation warranted by\nchange of gauge; the \"gauge-covariant\" spin operator automatically preserves the\ngauge.\nSince the other components of the covariant Lorentz derivatives and symmetry\ngenerators are linear, their action is the naive one, and we can avoid discussing them,\nand introducing coordinates for them. (Alternatively, we can eliminate them by\nconstraints, defining an appropriate coset space [5]. However, rather than just the\n\n\fExamples\n\n15\n\nLorentz space being a coset, we recognize the whole space as being a coset of Poincaré.)\nThe free covariant derivative di− can then be taken to be just a partial derivative\nwith respect to the remaining coordinates y +i in an appropriate representation. The\ncommutators\n[di− , d+ ] = −di ,\n\n[di− , dj ] = −δ ij d− ,\n\n[di− , d− ] = 0\n\nthen determine the y dependence: For ∂ i− y j+ = −δ ij ,\ndi− = ∂ i−\nd− = ∂ −\ndi = ∂ i + y i+ ∂ −\nd+ = ∂ + + y i+ ∂i + 12 (y i+ )2 ∂ −\n(Similar remarks apply to the spinor derivatives in the supersymmetric case.) Since\ndependence on y is completely determined, in the end we'll keep only the y i+ = 0\npart of the fields, replacing the free vector covariant derivatives with the usual partial\nderivatives. (This is equivalent to gauging y i+ away with the constraints that fix the\naction of di− on the fields.)\nSo far we haven't explicitly imposed a gauge. In covariant gauges the gauge fields\nfor the Lorentz derivatives vanish, so the above discussion is vacuous. However, in\nthe lightcone gauge\nA+ = 0\nwe can use Lorentz transformations to relate Ai− to Ai :\n[∇i− , ∇+ ] = −∇i\n\n⇒\n\nAi = d+ Ai−\n\n⇒\n\nAi− =\n\n1 i\nA\nd+\n\nwhich fixes the explicit form of the compensating gauge parameters. If we treat\ninstead Ai− as fundamental, we can write\ndi− Aj− =\n\n1\n(−δ ij A− + d(i Aj)− − i[Ai− , d+ Aj− ])\nd+\n\nThis result will find frequent use for supersymmetric generalizations in the following\nsections.\nThe free parts of these results agree with the first-quantized result above for\ns Aj , after making the identification\ni−\n\nA− =\n\n1 i i\nd A = di Ai−\n+\nd\n\n\f16\n\nwhich is the solution to its free field equation.\nAnother interpretation of these expressions for Ai and A− in terms of Ai− is\nbased on the fact that (in the free case) the lightcone gauge is a special case of the\nLandau gauge (because of A− 's free field equation). This is implemented here by the\nprepotential acting as the (Lorentz covariant) Hertz potential:\nda Aa = 0\n\n⇒\n\nAa = db Aba\n\nIn the lightcone gauge, where Ai− is the only survivng part of Aba , we then have\nA+ = db Ab+ = 0,\n\nAi = db Abi = d+ Ai− ,\n\nA− = db Ab− = di Ai−\n\nIn the interacting case, the form of the field equation for the \"auxilary\" field\nA and the \"physical\" fields Ai depends on the choice of interactions. However, the\nauxiliary one is generally simpler, and Lorentz invariance can be used to derive the\nrest from it. Consider a more general solution of the form\n1\nA− = + (di Ai + ∆)\nd\nwhere ∆ is (1/d+ )J + in terms of the \"current\" J + , quadratic in (Yang-Mills and\nother) fields (in the lightcone gauge, for minimal coupling). We then solve\n−\n\n[∇i− , ∇− ] = 0\nusing the above solution for di− Aj− (and the commutation relations of the d's) to find\n\u0014\n\u0015\n(dj )2 i−\n1 (i| j |j)−\n1 i−\n− i−\ni− 1\n2d A = + A + i + [A , d A ] + + d ∆ + i A , + ∆\nd\nd\nd\nd\n((ij) ≡ ij + ji; | | leaves alone indices between), where the first term is the usual\nfree one, and di− ∆ can be evaluated from the above (and similarly derived results for\nmatter).\nIn the nonsupersymmetric case Ai− then seems redundant to Ai . However, in\nthe maximally supersymmetric case we'll see that the usual lightcone superfield appears in Ai− ; the corresponding component of Ai would require an extra factor of\n1/d+ (which the lightcone formalism already has in abundance). This follows from\nR\ndimensional analysis, as the lightcone kinetic term (1/g 2) d4 θ φ φ implies φ is dimensionless. This is also true in the selfdual case, where 1/d+ is not required, and\nwould further break Lorentz symmetry. Another possible argument is that in a covariant background field gauge the four-point amplitude could be expected to take\nR\nthe form d16 θ A4 (times momentum integrals), which can give the usual component\nF 4 term only if this A is dimensionless.\n\n\fExamples\n\n17\n\nSelfdual super Yang-Mills\nA similar analysis can be made for selfdual (D=4) Yang-Mills, where a related\nlightcone gauge appears [19], and whose selfduality implies the field equations already\nin the nonsupersymmetric case. The main difference from the non-selfdual bosonic\ncase just considered is that, at least in a lightcone gauge, the prepotential is required\nin the course of solving the constraints. Thus it seems natural to introduce it from\nthe beginning, and give an explanation for its origin.\nThe supersymmetric case can be treated by a simple extension of indices [20]: In\nspinor notation, the vector derivative becomes the chiral superspace derivative ∇α A ,\n.\nwhere one Lorentz SL(2) spinor index becomes an index A = (a, α) for GL(N|2)\ngenerated by ∇A B (including also GL(N) R-symmetry, scale, and antichiral supersymmetry and S-supersymmetry), while the index α for the other Lorentz SL(2) ∇αβ\nis unchanged. Compared to the non-selfdual case, we roughly have the substitution\n∇ab\n\n→\n\n∇αβ , ∇A B\n\n∇ α , ∇a\n\n→\n\n∇α A\n\nW α , F ab\n\n→\n\nFAB\n\n.\nThe explicit relationship to 4D vector notation for the bosonic parts is a = αα,\n..\n..\n. .\n. .\n..\nαβ\n∇αα,β β = −i(C αβ ∇ + C̄ αβ ∇αβ )\nη αα,β β = C αβ C̄ αβ ,\nand the same for F ab (but for selfduality F αβ = 0), etc. (C is an antisymmetric\n..\nsymbol, also used to raise indices, with C +− ≡ C̄ +− = i.)\nThe constraints on the covariant derivatives are\n[∇α A , ∇β B } = C αβ FAB ,\n\n[∇α A , ∇B C } = δAB ∇α C ,\n\n[∇α A , ∇βγ ] = −i 12 C α(β ∇γ) A\n\nFrom now on we use ± mostly for values of the spinor indices α. Then we make the\nclassification\n∇++\n\n∇+− , ∇A B\n∇+ A\n\n∇−−\n∇− A\n\nFAB\n\n∇0\nO1\n\n\"Scale weight\", which we define to here include R-symmetry (as the GL(1) factor of\nthe GL(N|2)) increases downward, \"Lorentz weight\" s+− (∇+− for undotted spinor\nindices ±, using only 1 of the SL(2)'s) to the right. It's actually the sum of these two\n\n\f18\n\neigenvalues that defines the separation of variables: We divide these operators up according to whether this eigenvalue sum is 0 (or less; free) or 1 (linear in prepotential).\nWe then make a similar division for the commutation relations,\n[∇0 , ∇0 } = ∇0\n\n⇒\n\nlittle group: gauge A0 = 0\n\n[∇0 , O1 } = 0\n\n⇒\n\nrepresentation\n\n[∇0 , O1 } = O1\n\n⇒\n\ndefines O1 linear in prepotential\n\n[O1 , O1 } = 0\n\n⇒\n\nfield equations\n\nto solve order-by-order in the prepotential, in the order listed. We're really interested\nonly in the equations that involve only covariant derivatives; the field strengths are\nthen defined in the usual way.\nThe gauge fields A0 in the covariant derivatives ∇0 appear above and to the left\nof the basic fields O1 appearing in the diagonal along the lower right edge. All of\nA0 can be gauged to zero, since they generate no nonvanishing field strengths among\nthemselves.\nThe commutators of ∇0 with O1 are then divided up: First are those that vanish\n(except for ∇0 's with vanishing scale weight, which are boring now), which identify\nthe little-group representation of the prepotential, which in this case is A−− . Then\ncome those that define the other gauge fields and field strengths O1 linearly in terms\nof it: Since ∇+ A has vanishing gauge fields, it (actually just d+ A ) can be used to\nrelate entries in the table by moving in the direction indicated by its position relative\nto the \"origin\" (∇+− , ∇A B ). Thus it takes us from ∇−− (specifically A−− ) to the\nother entries in that diagonal one step at a time. Finally, the commutators of O1\nwith itself then give the field equations.\nBeforing considering Lorentz derivatives, the lightcone separation is then\n[∇+ A , ∇+ B } = 0\n\n⇒\n\nA+ A = 0 (little group)\n\n[∇(+ A , ∇−) B } = 0\n\n⇒\n\nA− A = d+ A A−−\n\n[∇[+ A , ∇−] B } = 2iFAB\n\n⇒\n\nFAB = d+ A d+ B A−−\n\n⇒\n\nd[− A d+] B A−− + i[d+ A A−− , d+ B A−− } = 0\n\n[∇− A , ∇− B } = 0\n\n(representation)\n(definition)\n\nThe representation constraint says the other potentials are \"curl-free\", so its solution\nis in terms of some prepotential A−− . The last constraint consists of the field equations\nthat determine the nonlinear dependence on the \"non-lightcone\" coordinates, whose\nderivatives are d− A (while d+ A remain arbitrary).\n\n\fExamples\n\n19\n\nNote that the selfdual lightcone gauge condition, instead of breaking both of the\nmanifest Lorentz SL(2,R)'s to GL(1), breaks only one, avoiding the explicit appear.\nance of the usual lightcone's ubiquitous 1/d++ . This and the natural use here of chiral\n(and not antichiral) superspace make A−− the unambiguous prepotential.\nHowever, the existence of this prepotential is already guaranteed without solving\ndifferential constraints, as the potential for one of the Lorentz derivatives ∇αβ [7].\n(Such potentials were also considered in [21], but with a different constraint analysis.)\nIn the above gauge we find, instead of solving the above differential representation\nconstraint, the algebraic definition\n[∇−− , ∇+ A ] = −∇− A\n\n⇒\n\nA− A = d+ A A−−\n\n(new definition)\n\nThus we have replaced one nontrivial derivative ∇− A with a Lorentz derivative ∇−−\nin the representation constraint.\nAgain, as seen from the free part, the free chiral superspace derivatives d in\n∇ = d + A are no longer just partial derivatives, but now have some dependence on\nthe Lorentz coordinate y ++ , with d−− = ∂ −− (∂ −− y ++ = −1),\nd− A = ∂ − A\nd+ A = ∂ + A + y ++ ∂ − A\nThe field equations can also be replaced, by again substituting ∇−− for one ∇− A :\n[∇−− , ∇− A ] = 0\n\nd+ A d−− A−− − 2d− A A−− + i[A−− , d+ A A−− ] = 0\n\n⇒\n\n(We have used the free part of the previous commutator to push the d−− to the right\nof the d+ A .) The solution of either version of the field equations requires breaking the\n.\nother SL(2): For the old constraint, we set B = + (upper; the rest is redundant), and\n.\nchoose A = a or − to solve for the non-lightcone-θ derivatives ∂ − a and for the time\n.\n.\ndevelopment ∂ −− . For the new constraint we now instead first set A = + (upper) to\nsolve for d−− , then plug this solution into the equation for the other values of A for\nthe same as before. The results are\nd−− A−− =\nd− a A−− =\nd\n\n.\n−−\n\nA−− =\n\n.\n.\n(2d−+ A−− + i[d++ A−− , A−− ])\n.\n++\n1\n\nd\n\n.\n.\n(d−+ d+ a A−− + i[d++ A−− , d+ a A−− })\n.\n++\n1\n\nd\n\n. .\n.\n.\n(d−+ d+− A−− + i[d++ A−− , d+− A−− })\n.\n++\n1\n\nd\n\n\f20\n\nThe first is identical to the nonsupersymmetric case, as a component of what we\nfound for di− Aj− , since it doesn't involve spinors. The last is a rearrangement of\nA−− = ... .\nThe generalization to the non-selfdual (4 ≤ D ≤ 10) case is similar (but more\ncomplicated: see the next section). In particular, the non-selfdual action in D=4\nis most conveniently written as the selfdual one plus extra terms, especially for an\nexpansion in order of helicity violation [22]. (Extension to D>4 then adds yet further\nterms.) This implies the appropriateness of the selfdual prepotential for the general\ncase.\n\nSelfdual supergravity\nA similar construction can be used for selfdual supergravity [20]. The one we\ndescribe here applies to the (fully) gauged version. (The vectors have Yang-Mills\ngauge group SO(N) for N supersymmetries.) Because of the gauging, the GL(N|2) of\nthe selfdual Yang-Mills case is replaced with its subgroup OSp(N|2). (The result is\nthe chiral contraction of OSp(N|4), namely I[OSp(N|2)⊗Sp(2)], with no cosmological\nconstant because of the selfduality.) We can now make use of the central charges\nsimilar to those of the non-selfdual case described above; unlike the Yang-Mills case\n(where we ignored them), they will play an important role here. The relation to the\nnon-selfdual flat derivatives is roughly\nsab\n\n→\n\nsαβ , sAB\n\nd α , pa\n\n→\n\ndα A\n\nω α , σ ab\n\n→\n\nσαβ , σAB\n\nwhere sAB are the graded-antisymmetric OSp(N|2) generators, related to the GL(N|2)\ngenerators sA B as\nsAB ≡ s[A C η B)C\nNote that this reduced symmetry was already suggested in the Yang-Mills case since\nsAB , which carries the same symmetry on its indices as σAB , now in turn carries the\nsame as the field strength FAB . Also, now the indices can be freely raised and lowered\nby the graded-symmetric OSp metric η AB and its inverse ηAB (and of course we can\nalso use the metric C for the other SL(2)).\n\n\fExamples\n\n21\n\nThe structure constants of the Lie algebra correspond to the table\nf\n\ns\n\nd\n\nσ\n\ns\n\ns\n\nd\n\nσ\n\nd\n\nd\n\nσ\n\nσ\n\nσ\n\n(I.e., s acts as OSp(N|2)⊗Sp(2) on everything according to their indices, including\nitself, but also [d, d} = σ.) We thus consider the derivatives\n∇++\n\n∇+− , ∇AB\n∇\n\ne ++\n\n∇\n\n+\n\n∇−−\n∇\n\nA\n\ne +−\n\n∇\n\n−\n\n∇0\nO1\n\nA\n\ne −−\n\ne AB\n,∇\n\n∇\n\nO2\n\nwhere now there is the introduction of O2 , not appearing in the selfdual super YangMills case.\nThe nontrivial (i.e., not involving s) commutators are now\ne αβ + C αβ FAB\n[∇α A , ∇β B } = ηAB ∇\ne AB + 1 RABCD ∇DC\niFAB ≡ ∇\n2\n\nthe nontrivial part being the R term. A sufficient set of constraints is\n[∇+ A , ∇+ B } = 0\n\n⇒\n\n∇+ A = d + A\n\n[∇−− , ∇+ A ] = −∇− A\n\n⇒\n\n∇− A = [d+ A , ∇−− ]\n\n[∇[+ A , ∇−] B } = 2iFAB\n\n⇒\n\nrepresentation and definition\n\n⇒\n\nfield equations\n\n[∇−− , ∇− A ] = 0\n\nThese are similar to the selfdual Yang-Mills case, except for the restriction on the\ne but then would pop up in\nform of FAB . (R could be absorbed by a redefinition of ∇,\nother commutators.) Any new ones involving O2 are redundant or definitions. Since\nwe won't consider non-selfdual supergravity in much detail, we'll concentrate on using\nthe solution of the first two equations to solve the third.\nThe solution is essentially the same as that given previously [19], with again the\ndifference that the prepotential already appears in the covariant derivatives, rather\nthan being discovered by solving a differential equation as in the original treatment\n\n\f22\n\nof the bosonic case [23]. The result is\n∇−− = s−− + 12 (d+A d+B h−4 )sBA + 2(d+A h−4 )d+ A + 3h−4 σ ++\n∇− A = d− A + 21 (d+ A d+B d+C h−4 )sCB + (d+ A d+B h−4 )d+ B + (d+ A h−4 )σ ++\niFAB = σAB + 12 (d+ A d+ B d+C d+D h−4 )sDC\n⇒\n\nRABCD = d+ A d+ B d+ C d+ D h−4\n\nwhere we have abbreviated h−4 for h−−−− . The relative coefficients of the h terms\nin ∇−− are fixed so that with each commutator with d+ A there is some cancellation\nbetween a term with it acting on h and a term with its commutator with a derivative:\nMultiple commutators with d+ A act as\n\u001a −−\ns\n→ d− A → σAB (σ +− )\n+\nd A:\nsAB → d+ A → σ ++\nNote that, whereas in the Yang-Mills case the prepotential appears only as its\nderivative if the Lorentz derivative isn't introduced, in the supergravity case it appears\nonly as its second derivative if both the Lorentz derivative and the dual Lorentz central\ncharge aren't introduced: h−4 appears without derivatives only as the σ ++ term of\n∇−− .\n\nN=2 and general\nThe prepotential appears in a similar way [24] in harmonic supergravity [4,25],\nnow also simplifed by the extra currents/coordinates: We now have the derivatives\n∇++\n\n∇+− , ∇α β\n∇+ α\n\n∇−−\n∇− α\n\n∇αβ\ne ++\n∇\n\ne +α\n∇\n\ne +− , ∇\ne αβ\n∇\n\ne −α\n∇\n\ne −−\n∇\n\nwhere now α is a 6-dimensional spinor index, ∇αβ is the (6-)vector derivative, and\n± is for R-symmetry SU(2), as might arise from Lorentz in still higher dimensions.\n(For convenience we look at 4D N=2 supersymmetry as 6D N=1, or at least use that\nnotation.) In the harmonic formalism ∇++ is not gauged to the free value, but still\nsatisfies the \"analyticity\" condition\n[d+ α , ∇++ ] = 0\n\n\fExamples\n\n23\n\nwhere ∇+ α has been gauged to its free value. In the Yang-Mills case, this simply\nstates the analyticity of the prepotential A++ . In the supergravity case, the solution\nis now\n∇++ = s++ + 4!1 ǫαβγδ {d+ α , [d+ β , {d+ γ , [d+ δ , Us−− ]}]}\n= s++ + [(d+ )4 U]s−− + [(d+ )3α U]d− α + 12 (d+ α d+ β U)dαβ + (d+ α U)ω +α + Uσ ++\nin terms of the prepotential U. In this case multiple commutators with d+ α act as\nd+ α :\n\ns−− → d− α → dαβ → ω +α → σ ++\n\nor more explicitly,\n[d+ α , s−− ] = d− α ,\n(d+ )4 ≡\n\n{d+ α , d− β } = dαβ ,\n\n1 αβγδ +\nǫ\nd α d+ β d+ γ d+ δ ,\n4!\n\n[d+ α , dβγ ] = ω +[β δαγ] ,\n\n(d+ )3α ≡\n\n1 βγδα +\nǫ\nd β d+ γ d+ δ ,\n3!\n\n{d+ α , ω +β } = δαβ σ ++\ndαβ ≡ 12 ǫγδαβ dγδ\n\nThe former arose from the SU(2)-covariant relations (with R-index a on da α )\n[da α , sbc ] = −i 12 C a(b dc)α ,\n[da α , dβγ ] = ω a[β δαγ] ,\n\n{da α , dbβ } = −iC ab dαβ\n{da α , ω bβ } = δαβ σ ab\n\nEven with the usual harmonic coordinates the prepotential would not appear explicitly with fewer than 2 derivatives without ω and σ.\nAs a matter of dimensional analysis, we note that even if the kinetic term of a\nsupersymmetric theory involves only Lorentz (or R) derivatives, which are dimensionless, and the θ integration is over only half the maximum (as for chiral, projective, or\nharmonic Lagrangians), the prepotentials in D=4 still must have a dimension (followR\ning from d4 x d2N θ V 2 ) of (at most) 2−N/2. For the dimensions of the maximally\nsupersymmetric cases, we then find:\n(a) 1 for the N=2 scalar multipet, the dimension of a physical scalar;\n(b) 0 for N=4 Yang-Mills, the dimension of the Lorentz (pre)potential; and\n(c) −2 for N=8 supergravity, the dimension of the dual-Lorentz (σ) connection appearing in the Lorentz (s) derivative.\nThese are also the dimensions and fields found above for N=2 and for general seldual\ntheories.\nOn the other hand, in background field gauges we can choose a gauge for the\nbackground where these lower-dimensional potentials are set to vanish (since their\nfield strengths vanish, and we don't need to solve constraints for the background),\nresuting in the usual nonrenormalization theorems [26].\n\n\f24\n\n......................\n......................\n\n10D super Yang-Mills\n\n......................\n......................\n\nSeparation of equations\nIn nonsupersymmetric theories, lightcone formulations of gauge theories (both\nYang-Mills [27] and gravity [28]) were originally derived by starting with the covariant\n(under both Lorentz and gauge transformations) formulation, fixing a null gauge, and\neliminating nonpropagating modes by their field equations. On the other hand, in the\nsupersymmetric case the result has been obtained by either (1) combining component\nresults into lightcone superfields [29] or (2) developing free lightcone superspace by\nsymmetry arguments, and preserving consistency upon introducing interactions [30].\nIn the case of supergravity the latter method has succeeded only to lowest orders\nin the coupling [31]. This suggests that the covariant (also under supersymmetry)\nmethod should be more straightforward.\nHere we apply this method to maximally supersymmetric Yang-Mills in ten dimensions. (Results in lower dimensions, including cases with less supersymmetry, can\nbe derived by the same method or dimensional reduction.) Extension to supergravity is straightforward (but more tedious, as seen from the nonsupersymmetric case).\nAlthough totally (manifestly) covariant formulations of maximally supersymmetric\ngauge theories are known only on shell [32,33], in a lightcone analysis it's easy to\nseparate the field equations from the representation constraints.\nOur gauge-covariant objects for super Yang-Mills include the spinor (W ) and\nantisymmetric tensor (F ) field strengths (which define the usual component field\nstrengths at θ = 0), the usual spinor and vector covariant derivatives (for θ and\nx), and the antisymmetric tensor covariant derivatives for Lorentz spin introduced\nabove. In a lightcone analysis we can classify them by both their scale weight and\ntheir eigenvalue under the component of the Lorentz spin operator s+− :\n∇+i\n\n∇+− , ∇ij\nγ +∇\n\n∇\n\n+\n\nγ −∇\n∇\n\ni\n\n+\n\n∇0\n∇\n\n−\n\n−\n\nγ W\nF +i\n\n∇i−\n\nγ W\nF +− , F ij\n\nO1\nO2\n\nF i−\n\nScale weight increases downward (Lorentz, spinor, and vector covariant derivatives;\nand spinor and antisymmetric tensor field strengths), s+− (∇+− ) weight to the right.\nAs in the (4D) selfdual case, we use the sum of these two eigenvalues to define the\nseparation of variables: It corresponds to the polynomial order in the prepotential. We\n\n\f10D super Yang-Mills\n\n25\n\nnow label these operators for eigenvalue sum 0 (or less; free), 1 (linear in prepotential),\nor 2 (or higher; nonlinear). We also classify the commutation relations as before:\n[∇0 , ∇0 } = ∇0\n\n⇒\n\nlittle group: gauge A0 = 0\n\n[∇0 , O1 } = 0\n\n⇒\n\nrepresentation\n\n[∇0 , O1 } = O1\n\n⇒\n\ndefines O1 linear in prepotential\n\n[O1 , O1 } = 0\n\n⇒\n\nfield equations\n\nThe derivatives ∇0 now appear above and to the left of the main diagonal in the\ntable, which is drawn from the lower left corner to the upper right. These derivatives\ncorrespond to the \"little group\" [34] of nonvanishing free derivatives d0 in the lightcone\nframe di = 0: There d− , γ − d, and di− also vanish by the (free) field equations, as we\nsaw in the first-quantized treatment.\nThe basic fields O1 appear along this diagonal. The prepotential in this case is\na Lorentz component of Ai− . Now γ + d and d+ can be used to relate entries in the\ntable (relative to the \"origin\" (∇+− , ∇ij )), taking us from Ai− to all the other entries\nin that diagonal, either one step at a time (by γ + d) or two (by d+ ).\nJust as for [∇0 , O1 }, the commutators of O1 with itself are also divided into those\nthat vanish, which give the field equations, and those that define the gauge field and\nfield strengths O2 to the right of and below the diagonal.\nFor the maximally supersymmetric case it's sufficient (but not necessarily preferable) to consider just the spinor-spinor anticommutators {∇, ∇} = −iγ *∇ (for D=10,\nor in D=10 notation [32]), as is usually done when Lorentz derivatives aren't considered:\n{γ + ∇, γ + ∇} = iγ + ∇+\n\n⇒\n\nγ + A = A+ = 0\n\n{γ + ∇, γ − ∇} = iγ + γ − γ i ∇i\n\n⇒\n\n(γ + d)(γ − A) = iγ + γ − γ i Ai\n\n{γ − ∇, γ − ∇} = iγ − ∇−\n\n⇒\n\nfield equations\n\nThe other commutators are redundant. The first anticommutator is the little-group\nconstraint for both γ + ∇ and (by Jacobi identity) ∇+ . The second anticommutator is\na representation constraint plus a definition, which says that (the lightcone part of)\nthe spinor derivative acts as a Dirac matrix (up to factors involving d+ ) on the two\n\"Weyl spinors\" γ − A and Ai (up to a triality, so that γ + d is the \"vector\"). Since it's\nlinear, the representation part agrees with the free first-quantized result. The last\nanticommutator gives field equations defining d− and the nonlinear supersymmetry\ntransformations γ − q.\n\n\f26\n\nIntroducing the covariant Lorentz derivative, we can replace γ − ∇ with ∇i− in the\nabove to get a different set of sufficient equations. (The previous then follow via the\nJacobi identities.) This is the same type of replacement of representation constraint\nmade above in the selfdual case (there replacing ∇− A with ∇−− ). We then look at\n[∇i− , γ + ∇] = γ i γ + (γ − ∇)\n\n⇒\n\n(γ + d)Ai− = γ i γ + (γ − A) (new representation)\n\nwhich is effectively the same representation constraint, using the anticommutation\nrelations of the \"Dirac matrices\" γ + d (again the same as the free first-quantized\nresult, and related to the constraint on the spinor by triality). We can therefore\nreplace the previous representation constraint with this new, lower-dimension one.\nThe equivalence is a little clearer if we note that, as in the nonsupersymmetric\ncase above,\n[∇i− , ∇+ ] = −∇i\n\n⇒\n\nAi = d+ Ai−\n\n(Similar equations hold for the other entries on the main diagonal of the table.)\nWe can also make a similar replacement of the field equation constraint, trading\none or both of γ − ∇ for ∇i− :\n[∇i− , γ − ∇] = 0 or\n\n[∇i− , ∇j− ] = 0 (new field equations)\n\nEuphoric representation\nThe (4D) selfdual theory can be defined on chiral superspace, since antichiral supersymmetry transformations are so trivial there. (They are included in the manifest\nGL(N|2) symmetry of the indices.) In the more general theory chirality arises from\nthe representation constraint.\nAs usual the representation constraint for 10D lightcone super Yang-Mills can\nbe solved by breaking the lightcone SO(8) symmetry to U(4) = SU(4)⊗U(1), corresponding to the standard method of expressing Dirac matrices in terms of creation\nand annihilation operators. The SU(4) = SO(6) symmetry is the same as in the 4D\nN=4 case, except we now keep the derivatives dab for the 6 extra dimensions. The\nU(1) = SO(2) is part of 4D Lorentz: We can take the 4 \"broken\" dimensions (10−6\n= 4) as those of D=4. Thus SO(9,1) is broken to SO(6)⊗SO(3,1), and the SO(3,1) is\nin turn broken to SO(2)⊗SO(1,1), where the SO(1,1) = GL(1) is the −s+− (in vector\nnotation) used above.\nThus it's convenient to use 4D spinor notation for the 10D theory, so as to indictae\nexplicitly both the SO(1,1) and SO(2) charges, as well as the SU(4). We therefore\n\n\f10D super Yang-Mills\n\n27\n\n.\nconvert the ± vector notation of the previous subsection to the ±, ± spinor notation\nof the previous section:\n.\n∇+ → ∇+ +\n.\n∇− → ∇− −\n.\n.\ncd\n∇i → ∇−+ , ∇+− , ∇ab = 21 ǫabcd ∇\n..\n.\n.\n−−\ncd−−\n∇i− → ∇−− , ∇ , ∇ab −− = 12 ǫabcd ∇\n.\n+a\n+\n+\nγ ∇ → ∇ a, ∇\n.\n−a\nγ − ∇ → ∇− a , ∇\nand the same for the potentials A. The ± indices thus still indicate SO(1,1) weight\n.\n(but now in half steps), while the SO(2) weights are + 21 for + and −, and − 12 for −\n.\nand + (all for upper indices). Some normalizations we use follow from those of the\nprevious section (and complex conjugation); we use\n.\n.\n..\n. .\n{dα a , d ̄βb } = −iδab dαβ ,\n{dα a , dβ b } = −iC αβ dab ,\n{d ̄αa , d ̄βb } = −iC̄ αβ 12 ǫabcd dcd\nThe latter follow from identifiying Aab with the selfdual scalars Fab after dimensional\nreduction. The implied convention for the metric is then, for general 8-vectors A and\nB,\n.\n.\n.\n.\nAab = − 21 ǫabcd (A*)cd\nAi Bj δij = A+− B−+ + A−+ B+− − 14 ǫabcd Aab Bcd ,\nThe representation constraints then become the usual oscillator relations (up to\n.\n.\n.\nfactors of d++ , since {d+ a , d ̄+b } = −iδab d++ )): The chirality and \"reality\" conditions\nare\n.\n. . ..\nd ̄+a A−− = 0,\nd+ a d+ b A−− = 12 ǫabcd d ̄+c d ̄+d Ā−−\nwhile the expansion in θ−a is given by\nA−−\nd+ a A−− = A− a\n.\n.\nd+ a d+ b A−− = d++ Aab −−\n= Aab\n.\n.\n= ǫabcd W +d\nid+ a d+ b d+ c A−− = ǫabcd d++ Ā−d\n.\n..\nd+ a d+ b d+ c d+ d A−− = ǫabcd (d++ )2 Ā−− = ǫabcd F ++\nA−− can again be used as the chiral-superspace prepotential, as for the selfdual sector,\n..\nbut now we also have the antichiral Ā−− . In the selfdual case, because of Wick\n\n\f28\n\nrotation, it's independent and vanishing, while A−− is real. (This is what extends\nthe R symmetry from SL(N) to GL(N) in the selfdual case; the extra GL(1) is the\ncontinuous duality transformation.) In Minkowski space for the general case it's the\n..\ncomplex conjugate of A−− (Ā−− = (A−− )*), while the reality is that of d+ a d+ b A−− .\nRemembering also the relations Ai = d+ Ai− , γ + W = d+ γ + γ − A, and F +i =\nd+2 Ai− , we then can write all the potentials/field strengths in O1 in terms of the\nprepotential as (with normalizations from previous sections)\n.\n1 + + −−\nAab −− =\n. d ad bA ,\nd ++\nA− a = d+ a A−− ,\n.\n.\nA−+ = d++ A−− ,\n\nAab\n\n..\nĀ−− =\n\n1\n. 2 (d+ )4 A−−\n+\n+\n(d )\n\n. ..\n.\n1\nĀ−a = d ̄+a Ā−− = −i . (d+ )3a A−−\n+\nd +\n.\n1\n= d+ a d+ b A−− ,\nA+− =\n. (d+ )4 A−−\n+\n+\nd\n\n.\n.\nW + a = d++ d+ a A−− ,\nW +a = −i(d+ )3a A−−\n..\n.\n.\n.\nF ++ ab = d++ d+ a d+ b A−− ,\nF ++ = (d+ )4 A−−\nF̄ ++ = (d++ )2 A−− ,\nwhere\n(d+ )4 ≡\n\n1 abcd + + + +\nǫ d ad bd cd d,\n24\n\n(d+ )3a ≡ 16 ǫabcd d+ b d+ c d+ d\n\n.\n.\nThus these quantities are related by the action of d+ a , d ̄+a , and d++ as indicated by the following table, where scale weight and Lorentz SO(1,1) weight increase\ndownward and Lorentz U(1) to the right:\n.\n..\nA−−\nAab −−\nĀ−−\n.\n\nA− a\nĀ−a\nւ  ց\n\n.\n.\n.\ny\nA−+\nAab\nA+−\nd ̄+a\nd+ a\n.\n.+\nd ++\nW a\nW +a\n.++.\n.\nF̄\nF ++ ab\nF ++\n\nField equations\nThe procedure for solving the field equations is a generalization of that used for\nthe selfdual theory. (We have already solved the little group and representation constraints. The linear parts of the following all agree with the first-quantized results\nabove.) The basic idea is to solve for the action of di− , γ − d, and d− on the prepotential, by looking at commutators of covariant derivatives. Since the action of di is un.\nconstrained, it's more convenient to use ∇−+ in place of ∇−− in field equations where\n.\n.\npossible, i.e., when it yields vanishing commutator. (Remember A−+ = d++ A−− .\n\n\f10D super Yang-Mills\n\n29\n\nAnother alternative would involve introducing O2 field strengths, which would be\neliminated using their field equations, as derived by higher-order commutators.)\nWe begin with equations of the form [∇i− , ∇j ], which were already solved in the\nnonsupersymmetric case to find di− Aj− :\n.\n.\n.\n1\n[∇−− , ∇−+ ] = 0 ⇒ d−− A−− =\n(2d−+ A−− − i[A−− , A−+ ])\n.\nd ++\n.\n.\n.\n.\n.\n.\n.\n1\n(d−+ Aab −− + dab A−− − i[Aab −− , A−+ ])\n[∇ab −− , ∇−+ ] = 0 ⇒ dab −− A−− =\n.\nd ++\n(We have left A's not explicitly expressed in terms of the prepotential, for conciseness;\nthe representation solution above should be applied.) We also have the complex\nconjugate solutions\n.. ..\n. ..\n..\n.\n1\nd ̄−− Ā−− =\n(2d+− Ā−− − i[Ā−− , A+− ])\n.\nd ++\n.\n.\n..\n.\n.\n. ..\n1\n(d+− Aab −− + dab Ā−− − i[Aab −− , A+− ])\ndab −− Ā−− =\n.\nd ++\nIn the selfdual case we also solved two equations which now have identical solutions: the former of the two above, and\n.\n.\n.\n1\n[∇− a , ∇−+ ] = 0 ⇒ d− a A−− =\n(d−+ A− a − i[A− a , A−+ ])\n.\nd ++\nThe complex conjugate is\n.\n.\n. .\n. ..\n1\n(d+− Ā−a − i[Ā−a , A+− ])\nd ̄−a Ā−− =\n.\nd ++\n.\n..\nThe easiest (and most useful) way to solve for d ̄−− A−− and d ̄−a A−− , rather than\n..\nsolving more constraints, is to write A−− in terms of Ā−− using the complex conjugate\nof the equation for the reverse\n. . . .\n.\n..\n.\n1\n1\nA−− =\nǫabcd d ̄+a d ̄+b d ̄+c d ̄+d\n(d ̄+ )4 Ā−− ,\n(d ̄+ )4 ≡ 24\n.\n(d++ )2\n..\n.\n..\nand pushing the d ̄−− or d ̄−a to the right till it hits the Ā−− . This requires the special\ncases of the above commutators,\n.\n.\n.\n.. .\n..\n.\n.\n{d ̄−a , d ̄+b } = − 12 ǫabcd dcd\n[d ̄−− , d ̄+a ] = −d ̄−a ,\n[d ̄−− , d++ ] = −d+− ,\n..\n.\n..\nUsing the above solutions for the d ̄−− 's or d ̄−a 's that reach the Ā−− , we find\n.\n..\n1 1 abcd\n−−\nǫ\nd\nA\nd ̄−− A−− =\n.\nab\ncd\nd ++ 4\n.\n..\n.\n.\n.\n.\n1\n1\n−i\n(d ̄+ )4 [Ā−− , A+− ] +\nd+ a (d ̄+ )4 [Ā−a , A+− ]\n.\n.\n(d++ )3\n(d++ )4\n.\n.\n.\n.\n1\n1\n(d ̄+ )4 [Ā−a , A+− ]\nd ̄−a A−− = − i . 12 ǫabcd dbc A− d − i\n.\nd ++\n(d++ )3\n\n\f30\n\n. ..\n.\nThese two are also simply related by d ̄+a d ̄−− A−− = d ̄−a A−− . (We have also used\n.\n. .\n[d+ a , (d ̄+ )4 ] = −id++ (d ̄+ )3 a to replace a d ̄3 with a d ̄4 .)\n.\nThe complex conjugates of these involve (d+ )4 rather than (d ̄+ )4 . We find the\nlatter more convenient, so we instead use\n..\n−−\n[∇ , ∇−− ] = 0 ⇒\n..\n. . −−\n.\n1 1 abcd\n−−\n−−\nd−− Ā−− =\n,A ]\nǫ\nd\nA\n+\ni[\nĀ\n.\nab\ncd\nd ++ 4\n..\n.\n.\n.\n.\n.\n1\n1\n(d ̄+ )4 [Ā−− , A+− ] +\nd+ a (d ̄+ )4 [Ā−a , A+− ]\n−i\n.\n.\n(d++ )3\n(d++ )4\n..\n..\nUsing d+ a d−− Ā−− = d− a Ā−− ,\n..\n.\n..\n1\nd− a Ā−− = − i . dab Ā+b + i[Ā−− , A− a ]\nd ++\n. . −d\n.\n.o\n1 n  ̄+. 3 −. −. +−.\n+b  ̄+c\n+−\n1\n ̄\n+\n−(d ) a [Ā , A ] + 2 ǫabcd d d [Ā , A ]\n.\n(d++ )2\n.\nThere are now several ways to solve for the field equation d−− A−− = iHA−− ,\nwhich is the lightcone analog of the nonrelativistic Schrödinger equation in terms of\nthe \"Hamiltonian\" H: One way, as outlined for the bosonic case, is to first solve for\n.\nA−− , from\n..\n.\n.\n.\n. ..\n.\n. ..\n. ..\n−−\n[∇ , ∇−+ ] = −∇−− ⇒ A−− = d−+ Ā−− + d+− A−− − d++ d ̄−− A−− + i[A−+ , Ā−− ]\n..\n(another case of di− Aj− from the bosonic section), use the above for d ̄−− A−− to give\n.\n.\n. ..\n.\n. ..\nA−− = (d−+ Ā−− + d+− A−− − 14 ǫabcd dab Acd −− ) + i[A−+ , Ā−− ]\n.\n..\n.\n.\n.\n.\n1\n1\n+i\n(d ̄+ )4 [Ā−− , A+− ] −\nd+ a (d ̄+ )4 [Ā−a , A+− ]\n.\n.\n(d++ )2\n(d++ )3\n.\nand then perform similar manipulations for d−− on A−− in\n.\n[∇−− , ∇−− ] = 0\n\n⇒\n\n.\n.\n.\nd−− A−− = d−− A−− + i[A−− , A−− ]\n\n..\nAn equivalent way is to expand [d−− , d ̄−− ]A−− = 0.\n.\n.\nAnother way is to evaluate {d− a , d ̄−b } = −iδab d−− on A−− . We'll do this in a\nsimpler way: The d− field equation follows directly from varying the action, so we'll\nevaluate the action directly as an anticommutator, as described below.\n\n\f10D super Yang-Mills\n\n31\n\nSymmetries\nAn alternative and commonly used way to derive the analog of the above expressions for symmetry generators is to use canonical transformations, i.e., secondquantized commutators (see [30] for supersymmetry). We'll review some of the features of this approach here, and show how covariant derivatives can be used to shortcut some of the initial steps. After solving the above equations, symmetry generators,\nbut not all covariant derivatives, can be expressed as such operators, since the prepotential is then defined only on the reduced (lightcone) chiral superspace. Since\nwe'll concentrate on deriving the action, we'll reduce vector derivatives to just partial\nderivatives.\nThere is a term ± 21 φ∂ + ∂ − φ in any lightcone action. (The sign depends on the\nintegration measure: It's + for a bosonic scalar, but − for our chiral superfield. This\nR\nR\nis clear from a component expansion in evaluating d4 θ A−− A−− , using d4 θ =\n(d+ )4 .) Thus ∓∂ + φ is the \"momentum\" for φ, so a general (super)field will satisfy\nthe canonical equal-time commutation relations\n[φ(1), φ(2)] = ±i\n\n1\nδ(1 − 2)\n∂+\n\nwhere the δ-function is in all lightcone chiral superspace coordinates except the lightcone time x+ . (We're really working in the Schrödinger picture, so there is no time.)\nSymmetry generators (including the Hamiltonian) are then functionals of the field\nG[φ] (quadratic in the free case), acting as\nδφ = [G, φ] = ∓i\n\n1 δG\n∂ + δφ\n\nConversely, G can be found from δφ by integrating δG/δφ = ±i∂ + δφ. For example, in the free case the second-quantized linear symmetry operators G follow from\nfirst-quantized linear ones G as\nZ\nG = ±i 21 φ∂ + Gφ ⇒ [G, φ] = Gφ\n[G1 , G2 } = G3\n\n⇒\n\n[G1 , G2 } = −G3\n\nR\nwhere \" \" integrates over all the coset coordinates except the lightcone time x+ .\n\nAt the classical level, we then have the Poisson bracket (with quantum mechanical\nnormalization)\nZ\nZ\nδG1 1 δG2\n[G1 , G2 } = ±i\n= ±i (δ1 φ)∂ + (δ2 φ)\nδφ ∂ + δφ\n\n\f32\n\n(again integrated over everything except x+ ). Bose symmetrization, together with\nthe antisymmetry of the 1/∂ + , then gives the (graded) commutator of δ1 and δ2 . In\nparticular, for supersymmetry we have {γ − q, γ − q} = −iγ − p− , so the Hamiltonian\n−ip− = ip+ can be derived as quadratic in the supersymmetry variations.\nWe modify this approach here by first using the solution to the equations for the\ncovariant spinor derivatives to find the supersymmetry generators. This step is trivial,\nsince the interaction terms in the covariant spinor derivatives d and supersymmetry\ntransformations are identical: Comparing the expressions for the covariant derivatives\nd and symmetry generators, we have for those with corrections from interactions (for\n\"δ\" in δA−− ):\nJ i− = (xi d− − x− ∂ i ) − θγ i γ − (i 12 γ i ∂ i θ + d) + di−\nγ − q = −iγ i ∂ i (γ − θ) + γ − d\np− = d −\nwhere we've used the fact that q and the spinor derivative d have the same ∂/∂θ term\nand opposite θp term, and applied the gauge condition γ + θ = 0. (There are generally\nalso unitary transformations to simplify the lightcone representation, involving θ and\n∂x but not ∂θ , which therefore leave the above relation between q and d unchanged.)\nThe interactions appear only upon solving the equations of motion for the partial\nderivatives with respect to the non-lightcone coordinates y i+ , γ + θ, and x+ . (We solve\nfor the derivatives, then set the corresponding coordinates to vanish.) In the way\nwe have expressed the generators above, all these partial derivatives are contained\nin covariant derivatives. Thus all interaction terms in the generators can be read\ndirectly from the covariant derivatives di− , γ − d, and d− .\nAt least for the case of supersymmetry, it'll be useful to go one step further and\nmake a similar replacement for γ − θ by comparing γ + q and γ + d: we then find\nγ −θ = i\n\n1 − +\nγ (γ q − γ + d)\n∂+\n\n1 i i − +\n(γ ∂ )γ (γ q − γ + d) + γ − d\n∂+\nThe explicit γ + q term is the usual free part of γ − q as found from solving p/q = 0;\nsimilarly, the d terms are the interacting γ − d minus the free part found from p/d = 0.\nIn particular, in euphoric notation we have\n.\n.\n.\n1\n[(q + a − d+ a )∂ −+ + i(q̄ +b − d ̄+b )∂ba ] + d− a ,\nq−a =\n.\n∂ ++\n.−a\n.\n.\n.\n.\n1\nq̄ =\n[(q̄ +a − d ̄+a )∂ +− + i(q + b − d+ b ) 21 ǫbacd ∂cd ] + d ̄−a\n.\n∂ ++\n⇒\n\nγ −q =\n\n\f10D super Yang-Mills\n\n33\n\nIn our case the role of the fundamental field φ is played by A−− . Thus in partic.\nular we can use the above results for d− a A−− and d ̄−a A−− to find the corresponding\ntransformations γ − q, and express the generator for p− by multiplying these supersymmetry variations. (The Lorentz generators are also straightforward. An interesting\ncase is J −− : The d−− terms serve only to cancel terms generated from the rest by\nBose symmetrization.) Substituting our solution for γ − d into γ − q, we have\n.\n.\n.\n{(∂ −+ q + a − i∂ab q̄ +b )A−− − i[q + a A−− , ∂ ++ A−− ]}\n.\n∂ ++\n(\n)\n.\n ̄+ )4 . . .\n.\n.\n.\n.\n.\n1\n(\nd\n=\n. (∂ +− q̄ +a − i 12 ǫabcd ∂bc q + d )A−− − i ++. 2 [q̄ +a Ā−− , ∂ ++ Ā−− ]\n∂ ++\n(∂ )\n\nq − a A−− =\n.\nq̄ −a A−−\n\n1\n\nThe θ terms in the commutators drop out automatically, allowing us to also replace\n..\nthose d's with q's. (We can also use the complex conjugate of d− a Ā−− to write\n.\n..\nq̄ −a A−− directly in terms of just A−− and not Ā−− , but with more terms.) We've\nwritten the transformations in this way to make explicit the fact that they preserve\n..\nthe (anti)chirality of A−− (Ā−− ). (We could use the chiral representation, where\n.\n.\nq + = ∂ + , or the antichiral one, where q̄ + = ∂ ̄+ .)\n. .\nR\nShowing the product (q − a A−− )∂ ++ (q̄ −b A−− ) is proportional to δab is still com-\n\nplicated, but the trace is easy to evaluate. The calculation then proceeds as follows:\nIn the quadratic (free) terms, only those with an even number of derivatives survive\n\nBose symmetrization, forcing the q's to contribute only as their anticommutators\n(q q̄ → 12 {q, q̄}), giving the usual result. In the cubic terms there is a similar Bose\nsymmetrization identity\ntr\n\nZ\n\n(∂A φ)[∂B φ, ∂C φ} = 0\n\nsince the antisymmetry of the structure constants (commutator) forces (graded) antisymmetry in the indices of the derivatives, but integration by parts gives two derivatives on a single field, which must be symmetric. This can be used in the case with\n.\n ̄ = iθ∂ ++ A, again forcing an anticommutator.\nboth q and q̄ since, e.g., q̄A = (q̄ − d)A\n.\nR\nR\nIn the interaction terms involving (d ̄+ )4 , we can use it to convert the d4 θ into d8 θ.\nR\nIn the corresponding cubic terms, we can then do the d4 θ on the A−− to leave an\n..\nR 4\nd θ̄ on three Ā−− 's.\n..\n.\nThe result is then, abbreviating φ = A−− , φ̄ = Ā−− , ∂ + = ∂ ++ , ∂a = ∂ + a , and\n.\n∂ ̄a = ∂ ̄+a (and again we can replace qa with ∂a or da inside the commutators):\n1\nS = 2 tr\ng\n\nZ\n\n4\n\ndx\n\n\u0014Z\n\n4\n\ndθ\n\n− 12 φ∂ + ∂ − φ\n\n\u0001\n\n+ H2 + H3 +\n\nZ\n\n4\n\nd θ̄ H3 +\n\nZ\n\n4\n\n4\n\nd θ d θ̄ H4\n\n\u0015\n\n\f34\n\n. .\nH2 = 21 φ(∂ +− ∂ −+ − 81 ǫabcd ∂ab ∂cd )φ\n.\n1\nH3 = −i 21 φ[∂ + φ, ∂ +− φ] − i 81 ǫabcd (∂ab ∂c φ) + [∂ + φ, ∂d φ]\n∂\n.\n1\nH3 = −i 12 φ̄[∂ + φ̄, ∂ −+ φ̄] − i 41 (∂ab ∂ ̄a φ̄) + [∂ + φ̄, ∂ ̄b φ̄]\n∂\n1\nH4 = −i 41 [∂ + φ, ∂a φ] + 3 [∂ + φ̄, ∂ ̄a φ̄]\n(∂ )\n\n\fConclusions\n\n..............................\n..............................\n\nConclusions\n\n35\n\n..............................\n..............................\n\nWe have introduced new coordinates for supersymmetric theories by a combination of covariant coset and dimensional reduction, which are formally \"left and\nright coset\" but are distinguished physically by their relation to symmetry vs. covariant derivatives (as determined by unitarity) and free vs. coupled. The extension is\nsuggested by regarding equally the spinor and antisymmetric tensor field strengths\nof super Yang-Mills (or their \"squares\" in supergravity), as gauge fields before dimensional reduction. This implies similar treatment for supersymmetry coordinates\n(which introduce spin) compared to Lorentz coordinates (which introduce superspin),\nwhich are dual to these field strengths. Related remarks apply to superstrings, where\nthe spinor field strength was already known to appear so.\nThe results here suggest several avenues of extension: (1) We have shown how the\ncovariant (in all ways) formulation is always the best starting point, even for lightcone\napplications. The field theory equations are equivalent to the first-class constraints\nof first-quantization. We applied the analysis only to the super Yang-Mills case in\ngenerality; (non-selfdual) supergravity would also be interesting: The selfdual case\nalready confirms that the chiral prepotential h−−−− corresponds to the square of the\nsuper Yang-Mills A−− .\n(2) Lorentz coordinates and the related R-symmetry coordinates have proven advantageous previously in projective and harmonic superspace approaches. Perhaps\nsimilar methods will solve the problem of extending covariant formulations of maximally supersymmetric theories off shell. The prepotentials we have found are of the\nappropriate (engineering) dimension for such theories. In particular, the new dual\nLorentz coordinates are necessary for this result in the supergravity case.\n(3) The new affine Lie algebra for superstrings implies modifications of firstclass constraints for superstrings, including generalizations of previous covariant approaches such as pure spinors. Such considerations are particularly natural for anti\nde Sitter strings, where the Lorentz algebra is already required for closing the algebra\nof \"translations\".\n\nAcknowledgment\nThis work is supported in part by National Science Foundation Grant No. PHY0969739.\n\n\f36\n\nREFERENCES\n1 P.A.M. Dirac, Annals Math. 37 (1936) 429;\n\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n13\n14\n15\n16\n17\n18\n19\n20\n21\n22\n23\n24\n25\n\nH.A. Kastrup, Phys. Rev. 150 (1966) 1183;\nG. Mack and A. Salam, Annals Phys. 53 (1969) 174;\nS.L. Adler, Phys. Rev. D6 (1972) 3445;\nR. Marnelius and B.E.W. Nilsson, Phys. Rev. D22 (1980) 830.\nA. Karlhede, U. Lindström, and M. Roček, Phys. Lett. 147B (1984) 297;\nU. Lindström and M. Roček, Commun. Math. Phys. 115 (1988) 21, 128 (1990) 191.\nA. Galperin, E. Ivanov, S. Kalitsyn, V. Ogievetsky and E. Sokatchev, Class. Quant.\nGrav. 1 (1984) 469.\nA. Galperin, E. Ivanov, V. Ogievetsky and E. Sokatchev, JETP Lett. 40 (1984) 912;\nB.M. Zupnik, Theor. Math. Phys. 69 (1986) 1101.\nE. Sokatchev, Phys. Lett. 169B (1986) 209.\nM. Hatsuda, Y.-t. Huang, and W. Siegel, JHEP 0904 (2009) 058 [arXiv:0812.4569]\n[hep-th].\nP.S. Howe, Phys. Lett. 258B (1991) 141, 259B (1991) 511, 273B (1991) 90;\nN. Berkovits, JHEP 0004 (2000) 018 [arXiv:hep-th/0001035].\nW. Siegel, Covariant approach to superstrings, in Symposium on anomalies, geometry\nand topology, eds. W.A. Bardeen and A.R. White (World Scientific, Singapore, 1985)\np. 348.\nW. Siegel, Nucl. Phys. B263 (1986) 93.\nK. Lee and W. Siegel, JHEP 0606 (2006) 046 [arXiv:hep-th/0603218].\nM.B. Green, Phys. Lett. 223B (1989) 157.\nW. Siegel, Phys. Rev. D50 (1994) 2799 [arXiv:hep-th/9403144].\nM. Sakaguchi, Phys. Rev. D59 (1999) 046007 [arXiv:hep-th/9809113].\nW. Siegel, Phys. Rev. D48 (1993) 2826 [arXiv:hep-th/9305073]; Manifest duality in\nlow-energy superstrings, in Strings '93, eds. M.B. Halpern, G. Rivlis, and A. Sevrin\n(World Scientific, Singapore, 1993) p. 353 [arXiv:hep-th/9308133].\nK. Lee and W. Siegel, JHEP 0508 (2005) 102 [arXiv:hep-th/0506198].\nS.W. MacDowell and F. Mansouri, Phys. Rev. Lett. 38 (1977) 739.\nW. Siegel, Free field equations for everything, in Superstrings, Cosmology, Composite\nStructures, eds. S.J. Gates, Jr. and R.N. Mohapatra (World Scientific, Singapore, 1987)\np. 13; Phys. Lett. 203B (1988) 79, Mod. Phys. Lett. A5 (1990) 2767.\nN. Berkovits, JHEP 0409 (2004) 047 [arXiv:hep-th/0406055];\nI. Oda and M. Tonin, Nucl. Phys. B727 (2005) 176 [arXiv:hep-th/0505277].\nA.N. Leznov, Theor. Math. Phys. 73 (1988) 1233;\nA.N. Leznov and M.A. Mukhtarov, J. Math. Phys. 28 (1987) 2574;\nA. Parkes, Phys. Lett. 286B (1992) 265 [arXiv:hep-th/9203074].\nW. Siegel, Phys. Rev. D47 (1993) 2504 [arXiv:hep-th/9207043].\nC. Devchand and V. Ogievetsky, Nucl. Phys. B414 (1994) 763 [arXiv:hep-th/9306163];\nE. Sokatchev, Phys. Rev. D53 (1996) 2062 [arXiv:hep-th/9509099];\nS. Karnas and S.V. Ketov, Nucl. Phys. B526 (1998) 597 [arXiv:hep-th/9712151].\nG. Chalmers and W. Siegel, Phys. Rev. D54 (1996) 7628 [arXiv:hep-th/9606061].\nJ.F. Plebański, J. Math. Phys. 16 (1975) 2395.\nW. Siegel, Phys. Rev. D53 (1996) 3324 [arXiv:hep-th/9510150].\nA.S. Galperin, N.A. Ky, and E. Sokatchev, Class. Quant. Grav. 4 (1987) 1235;\nA.S. Galperin, E.A. Ivanov, V.I. Ogievetsky, and E. Sokatchev, Class. Quant. Grav. 4\n(1987) 1255.\n\n\fConclusions\n\n37\n\n26 M.T. Grisaru and W. Siegel, Nucl. Phys. B201 (1982) 292.\n27 S. Weinberg, Phys. Rev. 150 (1966) 1313;\nJ.B. Kogut and D.E. Soper, Phys. Rev. D1 (1970) 2901.\n\n28 J. Scherk and J.H. Schwarz, Gen. Rel. Grav. 6 (1975) 537;\n29\n30\n\n31\n\n32\n\n33\n34\n\nM. Kaku, Nucl. Phys. B91 (1975) 99;\nM. Goroff and J.H. Schwarz, Phys. Lett. 127B (1983) 61.\nS. Mandelstam, Nucl. Phys. B213 (1983) 149;\nL. Brink, O. Lindgren, and B.E.W. Nilsson, Nucl. Phys. B212 (1983) 401.\nA.K.H. Bengtsson, I. Bengtsson, and L. Brink, Nucl. Phys. B227 (1983) 41;\nS. Ananth, L. Brink and P. Ramond, JHEP 0407 (2004) 082 [arXiv:hep-th/0405150];\nS. Ananth, L. Brink, S.S. Kim, and P. Ramond, Nucl. Phys. B722 (2005) 166\n[arXiv:hep-th/0505234].\nR.R. Metsaev, Phys. Rev. D71 (2005) 085017 [arXiv:hep-th/0410239];\nS. Ananth, L. Brink, and P. Ramond, JHEP 0505 (2005) 003 [arXiv:hep-th/0501079];\nL. Brink, S.S. Kim, and P. Ramond, JHEP 0806 (2008) 034 [AIP Conf. Proc. 1078\n(2009) 447] [arXiv:0801.2993] [hep-th].\nM.F. Sohnius, Nucl. Phys. B136 (1978) 461;\nE. Witten, Phys. Lett. 77B (1978) 394;\nL. Brink and P.S. Howe, Phys. Lett. 88B (1979) 268;\nE. Cremmer and S. Ferrara, Phys. Lett. 91B (1980) 61;\nL. Brink and P.S. Howe, Phys. Lett. 91B (1980) 384;\nW. Siegel, Nucl. Phys. B177 (1981) 325.\nW. Siegel, Phys. Lett. 80B (1979) 220.\nE. Witten, Nucl. Phys. B266 (1986) 245.\n\n\f"}