{"id": "http://arxiv.org/abs/0801.3032v2", "guidislink": true, "updated": "2008-01-22T10:51:59Z", "updated_parsed": [2008, 1, 22, 10, 51, 59, 1, 22, 0], "published": "2008-01-19T14:35:03Z", "published_parsed": [2008, 1, 19, 14, 35, 3, 5, 19, 0], "title": "Quantization of the Relativistic Fluid in Physical Phase Space on\n  Kähler Manifolds", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0801.3685%2C0801.3771%2C0801.2533%2C0801.2759%2C0801.0837%2C0801.2365%2C0801.3126%2C0801.2828%2C0801.4330%2C0801.2007%2C0801.0626%2C0801.4327%2C0801.4497%2C0801.3112%2C0801.3818%2C0801.0833%2C0801.3494%2C0801.2638%2C0801.4963%2C0801.1774%2C0801.4833%2C0801.4178%2C0801.1527%2C0801.4505%2C0801.1570%2C0801.2104%2C0801.4597%2C0801.3067%2C0801.1928%2C0801.3129%2C0801.1497%2C0801.2965%2C0801.4759%2C0801.4533%2C0801.3734%2C0801.0138%2C0801.3808%2C0801.3485%2C0801.3859%2C0801.2764%2C0801.1500%2C0801.2155%2C0801.1040%2C0801.0834%2C0801.4461%2C0801.1594%2C0801.2692%2C0801.4393%2C0801.4338%2C0801.4755%2C0801.4446%2C0801.3083%2C0801.2281%2C0801.2209%2C0801.2272%2C0801.3950%2C0801.1017%2C0801.4335%2C0801.4248%2C0801.4765%2C0801.1827%2C0801.0971%2C0801.3755%2C0801.4493%2C0801.3189%2C0801.4933%2C0801.4029%2C0801.2543%2C0801.3962%2C0801.4174%2C0801.3978%2C0801.4662%2C0801.0780%2C0801.2765%2C0801.3032%2C0801.4025%2C0801.2058%2C0801.1712%2C0801.4665%2C0801.4781%2C0801.0077%2C0801.3957%2C0801.3084%2C0801.2183%2C0801.4842%2C0801.4911%2C0801.4696%2C0801.1604%2C0801.4066%2C0801.1700%2C0801.0687%2C0801.4106%2C0801.1833%2C0801.3973%2C0801.1612%2C0801.4310%2C0801.2737%2C0801.3281%2C0801.2185%2C0801.4789%2C0801.0365&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Quantization of the Relativistic Fluid in Physical Phase Space on\n  Kähler Manifolds"}, "summary": "We discuss the quantization of a class of relativistic fluid models defined\nin terms of one real and two complex conjugate potentials with values on a\nK\\\"{a}hler manifold, and parametrized by the K\\\"{a}hler potential\n$K(z,\\bar{z})$ and a real number $\\lambda$. In the hamiltonian formulation, the\ncanonical conjugate momenta of the potentials are subjected to second class\nconstraints which allow us to apply the symplectic projector method in order to\nfind the physical degrees of freedom and the physical hamiltonian. We construct\nthe quantum theory for that class of models by employing the canonical\nquantization methods. We also show that a semiclassical theory in which the\nK\\\"{a}hler and the complex potential are not quantized has a highly degenerate\nvacuum. Also, we define and compute the quantum topological number (quantum\nlinking number) operator which has non-vanishing contributions from the\nK\\\"{a}hler and complex potentials only. Finally, we show that the vacuum and\nthe states formed by tensoring the number operators eigenstates have zero\nlinking number and show that linear combinations of the tensored number\noperators eigenstates which have the form of entangled states have non-zero\nlinking number.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0801.3685%2C0801.3771%2C0801.2533%2C0801.2759%2C0801.0837%2C0801.2365%2C0801.3126%2C0801.2828%2C0801.4330%2C0801.2007%2C0801.0626%2C0801.4327%2C0801.4497%2C0801.3112%2C0801.3818%2C0801.0833%2C0801.3494%2C0801.2638%2C0801.4963%2C0801.1774%2C0801.4833%2C0801.4178%2C0801.1527%2C0801.4505%2C0801.1570%2C0801.2104%2C0801.4597%2C0801.3067%2C0801.1928%2C0801.3129%2C0801.1497%2C0801.2965%2C0801.4759%2C0801.4533%2C0801.3734%2C0801.0138%2C0801.3808%2C0801.3485%2C0801.3859%2C0801.2764%2C0801.1500%2C0801.2155%2C0801.1040%2C0801.0834%2C0801.4461%2C0801.1594%2C0801.2692%2C0801.4393%2C0801.4338%2C0801.4755%2C0801.4446%2C0801.3083%2C0801.2281%2C0801.2209%2C0801.2272%2C0801.3950%2C0801.1017%2C0801.4335%2C0801.4248%2C0801.4765%2C0801.1827%2C0801.0971%2C0801.3755%2C0801.4493%2C0801.3189%2C0801.4933%2C0801.4029%2C0801.2543%2C0801.3962%2C0801.4174%2C0801.3978%2C0801.4662%2C0801.0780%2C0801.2765%2C0801.3032%2C0801.4025%2C0801.2058%2C0801.1712%2C0801.4665%2C0801.4781%2C0801.0077%2C0801.3957%2C0801.3084%2C0801.2183%2C0801.4842%2C0801.4911%2C0801.4696%2C0801.1604%2C0801.4066%2C0801.1700%2C0801.0687%2C0801.4106%2C0801.1833%2C0801.3973%2C0801.1612%2C0801.4310%2C0801.2737%2C0801.3281%2C0801.2185%2C0801.4789%2C0801.0365&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We discuss the quantization of a class of relativistic fluid models defined\nin terms of one real and two complex conjugate potentials with values on a\nK\\\"{a}hler manifold, and parametrized by the K\\\"{a}hler potential\n$K(z,\\bar{z})$ and a real number $\\lambda$. In the hamiltonian formulation, the\ncanonical conjugate momenta of the potentials are subjected to second class\nconstraints which allow us to apply the symplectic projector method in order to\nfind the physical degrees of freedom and the physical hamiltonian. We construct\nthe quantum theory for that class of models by employing the canonical\nquantization methods. We also show that a semiclassical theory in which the\nK\\\"{a}hler and the complex potential are not quantized has a highly degenerate\nvacuum. Also, we define and compute the quantum topological number (quantum\nlinking number) operator which has non-vanishing contributions from the\nK\\\"{a}hler and complex potentials only. Finally, we show that the vacuum and\nthe states formed by tensoring the number operators eigenstates have zero\nlinking number and show that linear combinations of the tensored number\noperators eigenstates which have the form of entangled states have non-zero\nlinking number."}, "authors": ["L. Holender", "M. A. Santos", "I. V. Vancea"], "author_detail": {"name": "I. V. Vancea"}, "author": "I. V. Vancea", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevD.77.045024", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0801.3032v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0801.3032v2", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "14 pages, LaTex file. Minor typos corrected", "arxiv_primary_category": {"term": "hep-th", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "hep-th", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "gr-qc", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "physics.flu-dyn", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0801.3032v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0801.3032v2", "journal_reference": "Phys.Rev.D77:045024,2008", "doi": "10.1103/PhysRevD.77.045024", "fulltext": "Quantization of the Relativistic Fluid in Physical\nPhase Space on Kähler Manifolds\n\narXiv:0801.3032v2 [hep-th] 22 Jan 2008\n\nL. Holendera∗ M. A. Santosb† and I. V. Vanceaa‡\nJanuary 21, 2008\n\na\n\nDepartamento de Fı́sica, Universidade Federal Rural do Rio de Janeiro (UFRRJ),\nCx. Postal 23851, 23890-000 Seropédica - RJ, Brasil\nb\nDepartamento de Fı́sica e Quı́mica, Universidade Federal do Espı́rito Santo (UFES),\nAvenida Fernando Ferarri S/N - Goiabeiras, 29060-900 Vitória - ES, Brasil\nAbstract\nWe discuss the quantization of a class of relativistic fluid models defined in terms\nof one real and two complex conjugate potentials with values on a Kähler manifold,\nand parametrized by the Kähler potential K(z, z) and a real number λ. In the hamiltonian formulation, the canonical conjugate momenta of the potentials are subjected\nto second class constraints which allow us to apply the symplectic projector method\nin order to find the physical degrees of freedom and the physical hamiltonian. We\nconstruct the quantum theory for that class of models by employing the canonical\nquantization methods. We also show that a semiclassical theory in which the Kähler\nand the complex potential are not quantized has a highly degenerate vacuum. Also,\nwe define and compute the quantum topological number (quantum linking number)\noperator which has non-vanishing contributions from the Kähler and complex potentials only. Finally, we show that the vacuum and the states formed by tensoring\nthe number operators eigenstates have zero linking number and show that linear\ncombinations of the tensored number operators eigenstates which have the form of\nentangled states have non-zero linking number.\n\n∗\n\nemail: holender@ufrrj.br\nemail: masantos@cce.ufes.br\n‡\nemail: ionvancea@ufrrj.br\n†\n\n1\n\n\f1\n\nIntroduction\n\nThe recent interest in the lagrangian and hamiltonian formulation of the relativistic\nfluid mechanics with non-zero vorticity has been motivated by a large range of applications such as: the neutron star dynamics [1], the representation of the massless\naxion field in cosmology [2], the Kalb-Ramond and global string induced superfluid\nvorticity [3, 4], and the relationship between the superstrings, supermembranes and\nthe superfluid dynamics [5, 6, 7, 8].\nThe analysis of the vorticity in the lagrangian formalism requires a particular\nparametrization of the fluid potentials. In the case of the non-relativistic fluid, this\nis achieved by the Clebsch parametrization of the velocity potential v = ∇θ + α∇β,\nwhere α, β (the Gauss potentials) and θ are scalar fields [9]. In the hamiltonian\nformulation, the Clebsch parametrization allows to express the kinematic helicity\nas a surface integral and to realize canonically the non-vanishing brackets between\nthe variables ρ (matter density field) and v [10]. In [6], it was proposed a different\nparametrization of the fluid potentials in which the vortex dynamics is expressed in\nterms of grassmannian coordinates and the vortex is associated to the spin. That\nparametrization has been used for the generalization of the Chaplygin gas model in\nd = 2 + 1 and d = 3 + 1 [11](see for an introduction and reviews [12, 13].)\nAnother very interesting proposal for a parametrization of the fluid potentials\nwas put forward in [14], where the potentials are complex coordinates on an arbitrary\nKähler manifold. That approach allows to construct interesting models of supersymmetric fluids which, on their turn, shade some light on the problem of the superfluid\nphases of certain supersymmetric systems [15, 16, 17]. The parametrization of the\npotentials in terms of complex coordinates preserves the property of the Clebsch\nparametrization, namely to elliminate the obstruction to building a consistent lagrangian which could exist due to a Chern-Simons term that is necessary in order to\nconsider the non-zero vorticity [12]. The complex parametrization can be introduced\ninstead of the Clebsch parametrization already at the non-supersymmetric level and\nthe full structure of the divergence free currents and the topological charges associated to non-zero vorticity can be obtained in this way [14]. An important feature of\nthe complex parametrization is that the hamiltonian dynamics is governed by a set\nof simple second-class constraints among the fluid degrees of freedom. In this paper,\nwe propose a quantized theory for a large set of non-supersymmetric relativistic fluid\nmodels on Kähler manifolds.\nThe fluid properties of the system under consideration are described by a set of\nfields that represent the fluid potentials and which, together with their canonically\nconjugate momenta, can be organized to form a canonical phase space. The potentials and their momenta are subjected to second class constraints which form a set\nof simple algebraic equations. As a first result, we will obtain the physical degrees of\nfreedom of the largest set of classical fluid models by applying the symplectic projector method developped in [18, 19, 20] and more recently employed in the study\nof the extended abelian Chern-Simons theory [21], the noncommutative open string\n[22], the Maxwell-Chern-Simons theory [23], the Lorentz-symmetry violation [24],\nquantum gravity potentials [25] and cosmological perturbations [26] (see for reviews\n[27, 28].) Althought equivalent to other methods used to solve the second class constraints, the symplectic projector method has the advantage of giving a geometrical\npicture to the relationship between the set of fields and their canonical conjugate\n\n\fmomenta on one hand and the set of physical degrees of freedom defined by local coordinates on the constraint surface on the other hand. Compared with the literature,\nour results reproduce exactly the general classical hamiltonian from [14]. Moreover,\nthere are some new results consisting in the explicit identification of the physical\ndegrees of freedom and of their relationship with the linearly dependent fields. The\nmain result of this paper is the quantization of a smaller class of models parametrized\nby the Kähler potential K(z, z) and a real parameter λ. That corresponds to choosing\nthe arbitrary potential function on the fluid density f (ρ) of the form f (ρ) = λρ2 /2\nby which a set of quantizable fluid models is selected. The larger class of classical\nmodels is parametrized by K(z, z) and the general potential functions f (ρ) and, in\ngeneral, it is not suitable for quantization due to the arbitrary form each of these\ntwo functions can take. Our approach to the quantum fluid is based on the canonical\nquantization performed in the physical phase space of the relativistic fluid. However,\nsince the Kähler and the complex potentials determine a d = 3 vector field A(z, z)\nassociated to the conserved currents, we quantize the field A rather than the complex fields z and z. Due to the large arbitrariness in choosing the Kähler potential\nK(z, z), there is no simple relationship between the quantized fields A and z and\nz. That suggest that one could also consider a semiclassical situation in which the\npotential A is kept classical and just the canonical pair θ and πθ is quantized. However, it turns out that in this case the Fock space is highly degenerate having all\none-particle states proportional to the vacuum. Therefore, the quantization of the\ncomplex potentials is imposed, and quantizing the field A represents the simplest\napproach to this problem. The last new result of this paper is the calculation of the\nquantum topological charge (or quantum linking number) operator ω\nb . This is constructed from the normal ordered expression of the classical topological charge. The\nnormal ordering is necessary because there are terms in ω\nb which have the general\n3\nn\nform δ (0) k , where k is any component of the momentum and n = 1, 2, 3. These\nterms are undetermined in the low momentum limit and vanish otherwise. We discuss\nthe structure of the Fock space with respect to ω\nb and show that the vacuum and the\nnumber operator eigenstates have zero linking number while the linear combination\nof tensored number operators eigenstates have non-zero topological charge 1 .\nThe paper is organized as follows. In Section 2 we briefly review the general\nrelativistic fluid on Khäler manifolds in the hamiltonian formulation from [14]. Also,\nwe determine the physical degrees of freedom which are the local coordinates on\nthe constraint manifold by the symplectic projector method and write down the\nexpression of the physical hamiltonian and the conserved charges in term of these.\nThe physical hamiltonian obtained by applying the symplectic method coincides with\nthe one given in the literature. In Section 3 we quantize the particular class of models\nparametrized by K(z, z) and λ. We give the structure of the Fock space and show\nthat if the vector potential A is considered as a classical field, the Fock space of\nthe semiclassical quantized fluid is highly degenerate. In Section 4 we discuss the\nquantum topological operator and determine the general form of the states from the\nFock space which have non-vanishing linking number. The last section is devoted to\nconclussions.\n1\n\nThe quantum fluid states with non-zero linking number are actually entangled number operators\neigenstates.\n\n\f2 Relativistic Fluid in the Hamiltonian Formulation\nIn this section we are going to review the non-supersymmetric perfect relativistic\nfluid studied in [14]. Also, we are going to derive the physical degrees of freedom\nin a new way by applying the symplectic projector method developped in [27, 28].\nThat is equivalent, of course, to solving the constraint equations in a purely algebraic\nway as was done in [14]. However, the symplectic projector method provides a simple\ngeometrical picture for the relationship among potentials, physical degrees of freedom\nand constraint surface.\nIn the class of models under consideration, the relativistic fluid is characterized\nby the equations of state for the local physical quantities p, ε, and ρ which are the\npressure, the energy density and the local fluid density, respectively. The dynamics\nconserves the energy-momentum tensor Tμν and the fluid density current j μ\n∂ μ Tμν = 0,\n\n∂μ j μ = 0,\n\n(1)\n\nwhere\nTμν = pημν + (ε + p)uμ uν ,\n\nj μ = ρuμ .\n\n(2)\n\nHere, ημν = (−, +, +, +) is the Minkowski metric, uμ = dxμ /dτ is the velocity fourvector with u2μ = −1 and τ is the proper time along the flow line of the current.\nFrom the current conservation given in the equations (1), one can see that there are\nthree independent current components to which one can assign three fluid potentials\n(θ, z, z̄) that play the role of the Lagrange multipliers in the lagrangian formulation\nof the theory. As was argued in [14], one can take θ real, z complex and z̄ the complex\nconjugate of z. One can choose the complex potentials to parametrize an arbitrary\nKähler manifold characterized by the Kähler potential K(z, z̄) which is a real function\non z and z̄. The above conservation equations can be obtained from the following\nlagrangian density [14]\n\u0001\n(3)\nL[j μ , θ, z̄, z] = −j μ ∂μ θ + i∂K∂μ z − i∂K∂μ z − f (ρ),\n\nwhere ∂K = ∂z K, ∂K = ∂z K and f (ρ) is some potential function\np on ρ. Also, one\ncan see from the definition of the fluid density current that ρ = −j 2 . The action is\ninvariant under the spacetime translations and the potential fields reparametrizations. The corresponding conservation laws are: the conservation of the energymomentum tensor and the conservation of the fluid density current as given in\nthe equations (1), and the conservation of an infinity of reparametrization currents\nJμ [G] = −2G(z̄, z)jμ , where G(z̄, z) are arbitrary analytic functions on z and z. Beside the reparametrization currents given above, there are conserved axial currents\ngenerated by conserved topolgical charges defined by the following relation [14]\nZ\ni\nh\n(4)\nω = −2i d3 x ∂i εijk θ∂∂K∂j z̄ ∂k z .\nThe charges ω can be interpreted as the linking number of vertices formed in the\nfluid.\n\n\fThe fluid flow and the non-zero vorticity can be described in the hamiltonian\nformalism, too. Following [14], we define the canonically conjugate momenta as follows\nπμ =\nπz =\n\n∂L\n∂uμ\n\nρ\n\n\u0001\n= ρ ∂μ θ + i∂K∂μ z − i∂K∂μ z̄ ,\n\n∂L\n= i∂Kj0 ,\n∂∂0 z\n\nπz =\n\nπθ =\n\n∂L\n= j0 ,\n∂∂0 θ\n\n∂L\n= −i∂Kj0 .\n∂∂0 z\n\n(5)\n(6)\n\nNote that the currents jμ do not appear dynamically in the theory and that the axial\ncurrent depends locally on πμ . Therefore, the relevant phase space for the physical\ndegrees of freedom is the reduced phase space (θ, z, z̄, πθ , πz , πz ). The equations (6)\nrepresent a set of two second class constraints in the reduced phase space\nΩ1 = πz − i∂Kπθ = 0,\n\nΩ2 = πz̄ + i∂Kπθ = 0.\n\n(7)\n\nThe physical degrees of freedom of the relativistic fluid can be obtained from\nthe reduced phase space potentials by applying the symplectic projector method by\nwhich the reduced phase space is projected on to the constraint surface defined by\nthe relations (7) [20, 27, 28]. Let us introduce the following notation for the potentials\nand their momenta\n{ξi } = {ξ1, ξ2, ξ3, ξ4, ξ5, ξ6 } = {θ, z, z̄, πθ , πz , πz } .\n\n(8)\n\nThe local coordinates on the constraint surface {ξi∗ } are obtained by applying the\nsymplectic projector Λ to the reduced phase space fields {ξi }\nξi∗ (x0 , x)\n\n=\n\nZ\n\n3\n\nd y\n\n6\nX\n\nΛji (x0 , x, y)ξj (x0 , y),\n\n(9)\n\nj=1\n\nwhere the general form of the symplectic projector is given by the following relation\nZ\nδΩβ (x0 , w)\nδΩα (x0 , z) −1 0\ni\n0\ni 3\nik\nD\n(x\n,\nz,\nw)\n. (10)\nΛj (x , x, y) = δj δ (x − y)−J\nd3 zd3 w\nδξk (x0 , x) αβ\nδξj (x0 , y)\n−1\nHere J ik = −J ki is the symplectic matrix of the reduced phase space and Dαβ\n,\nα, β = 1, 2, is the inverse of the Dirac matrix of the constraint brackets computed\nat equal times. It is a simple exercise to show that the symplectic projector has the\nfollowing expression\n\n\n∂K\n∂K\n1 0 0\n0\n2∂∂Kξ4\n2∂∂Kξ4 \n\ni\n\n 0 1 0 − ∂K\n0\n2\n\n2∂∂Kξ4\n2∂∂Kξ4 \n 3\n\n∂K\ni\n− 2∂∂Kξ\n0\n0 0 12 − 2∂∂Kξ\n δ (x − y).\n(11)\nΛ(x0 , x, y) = \n4\n4\n\n\n\n 0 0 0\n1\n0\n0\n\n\n1\n\n 0 0 0\n0\n0\n2\n1\n0 0 0\n0\n0\n2\n\nFrom the above relation, one concludes that the number of local coordinates {ξi∗ }\non the constraint surface is equal to the number of unprojected fields {ξi }. However,\nsince now the system is on the constraint surface, one can use the constraints {Ωα }\nto express the coordinates ξ5∗ and ξ6∗ as functions of ξ4∗ . This lefts us with the correct\n\n\fnumber of physical degrees of freedom, that is six real degrees of freedom ξ ∗ 's which\nhave been obtained from the ten real fields ξ's acted upon by two complex constraint\nequations Ωα . The physical hamiltonian density is given in terms of the linearly\nindependent fields from {ξi∗ }\n\u0012q\n\u0013\n\u0001\n2\n∗\n∗\n∗\n∗\n∗\n2\n(ξ4 ) − j .\n(12)\nH = j* ∇ξ1 + i∂K∇ξ2 − i∂K∇ξ3 + f\n\nBy using the field redefinition (8) one can easily see that the expression (12) is exactly\nthe hamiltonian obtained in [14] by a different method. Also note that the currents\nJ μ [G] generate now the reparametrization symmetry of the physical subspace.\n\n3\n\nQuantization of the Relativistic Fluid\n\nThe theory presented in the previous section describes a large class of relativistic\u0012 fluid models\n\u0013 parametrized by the Kähler potential K(z, z) and the function\nq\n2\n∗\nf\n(ξ4 ) − j2 , respectively. Both of these functions can have a quite general form\n\nwhich makes addressing the issue of quantization difficult, if not impossible, in the\ngeneral case. A less general but still interesting class of relativistic fluid models can\nbe obtained by choosing a simple form for f (ρ) while leaving the Kähler manifold\narbitrary. The equations of state of the reduced set of models have the following form\n[14]\nλ\nλ\n(13)\np = ε = ρ2 , f (ρ) = ρ2 .\n2\n2\nThese models are parametrized by the Kähler potential K(z, z) and the real number\nλ. From the equations of motion for jl , l = 1, 2, 3, one can determine the explicit\nform of these currents in terms of the reduced phase space fields as follows\n\u0013\n\u0012\n∂H∗\n1\ni\ni\n(14)\n= 0 =⇒ jl =\n∂l ξ1∗ + ∂K∂l ξ2∗ − ∂K∂l ξ3∗ .\n∂jl\nλ\n2\n2\nBy applying the symplectic projector formalism employed in the previous section and\nby using the equations (14), the following physical hamiltonian is obtained\n\u0012\n\u00132\ni\ni\nλ\n1\n∗\n∗\n∗\n∗\n(15)\n∇ξ1 + ∂K∇ξ2 − ∂K∇ξ3 + (ξ4∗ )2 .\nH =\n2λ\n2\n2\n2\nNote that H∗ is identical to the hamiltonian calculated in [14] for the models\nparametrized by {K(z, z), λ}.\nThe quantization of the relativistic fluid described by the hamiltonian (15) can\nbe performed in the canonical approach. Let us return to the original field notations\n{θ, πθ , z, z} where the fields are from the physical phase subspace. The canonical\nconjugate variables are θ and πθ , while z and z do not propagate. Let us introduce\nthe following real vector potential field\ni\ni\nA(K, z, z) ≡ A(x) = ∂K∇z − ∂K∇z.\n2\n2\n\n(16)\n\nFrom the Hamilton equations, we obtain the following equation of motion for the θ\npotential\n\u0001\n∂ 0 ∂0 + ∇2 θ(x0 , x) = −∇ * A(x0 , x).\n(17)\n\n\fThis equation shows that the physical phase subspace of the relativistic fluid is equivalent to that of a massless scalar field θ moving inside the potential created by K(z, z)\nand the fluid potentials z and z. Actually, by assuming that θ(x0 , x)A(x0 , x) → 0\nas x0 → ∞, one can write the hamiltonian (15) as\n\u0014\n\u0015\nZ\nλ 2\n1\n2\n∗\n0\nH = dx dx\nπ +\n(∇θ) + V (θ, A) ,\n(18)\n2 θ 2λ\nwhere\n\n\u0014\n\u0015\n1\n1\n2\nV (θ, A) = − θ∇ * A − (A) .\nλ\n2\n\n(19)\n\nFor ∇ * A 6= 0, the function V has a zero for each field configuration that satisfies\nθ0 =\n\n1 (A)2\n.\n2∇*A\n\n(20)\n\nAt the points from the physical phase subspace where the equations (20) is satisfied,\nthe relativistic fluid is described by the scalar potential θ only, and it is equivalent\nto a free massless scalar field. Actually, the vanishing of the gradient of the vector\npotential signals an extremum of V . The extrema of V in the θ direction and in the\nA directions, respectively, are given in terms of physical degrees of freedom by the\nfollowing equations\n\u0001\n\u0001\ni ∂K∂j z − ∂K∂j z = 2∂j θ.\n(21)\n∂j ∂K∂j z − ∂K∂j z = 0,\nThe potential V takes at these points the following values\nV1 =\n\n\u0001\n1\n1\n(A)2 , V2 = −\nθ∂j ∂ j θ − ∂j θ∂ j θ .\n2λ\n2λ\n\n(22)\n\nIf the extremum value is obtained in all directions of physical phase subspace simultaneously, then by equating V1 and V2 we obtain the following relationship among\nthe fluid potentials\n(∂K)2 ∇z * ∇z + ∂K\n\n\u00012\n\n∇z * ∇z − 2∂K∂K∇z * ∇z + 2θ (∇)2 θ − 2∇θ * ∇θ = 0. (23)\n\nThe above equation describes the fluid configurations for which the contribution to\nthe fluid energy from the Kähler and the complex fluid potentials and from their\ninteraction with the scalar fluid potential is extreme.\nFor the classical models described above, the reparametrization charges Q[G] have\na simple form in terms of physical phase space coordinates\nZ\n∗\nQ[G(ξ )] = d3 xG(z, z)πθ .\n(24)\nTherefore, it is easy to show that the charges Q[G] are conserved provided that the\nfollowing relation holds\nZ\nds * (∇θ + A) = 0,\n(25)\nΣ\n\nwhere ds is the area element of Σ which is a spacelike surface at the spatial infinity.\nSince the theory is formulated in the hamiltonian formalism, it is possible to\nstudy the quantum fluctuation of the relativistic fluid in the canonical quantization.\n\n\fTo this end, we interpret θ and A as field operators with the dynamics given by\nthe equation (17) and replace the Poisson brackets on the constraint surface by the\ncorresponding commutators. In what follows we are going to use the symbol b to\ndenote the operators. Then the equation of motion of the quantum field θb is\n\u0001\nb 0 , x) = −∇ * A(x\nb 0 , x).\n∂ 0 ∂0 + ∇2 θ(x\n(26)\n\nb can be decomposed in terms of plane waves in the usual\nThe operators θb and A\nfashion\nZ\n0\nb\nak (x0 ),\n(27)\nθ(x , x) = d3 kNkθ eik*x b\nZ\nb k (x0 ).\nb 0 , x) = d3 kN A eik*x b\n(28)\nA(x\nk\n\nb is the same\nSince the equation of motion of θb in the absence of the vector potential A\nb\nb is\nas for a free massless scalar field, we consider that θ is massless. Also, since A\nconstructed from non-propagating fields 2 , we consider the simplest situation where\nA is a massless field, too. Then it is possible to set the normalization constants Nkθ =\nNkA = Nk . By plugging the relations (27) and (28) into n\n(26), we obtain\nthe following\no\nb k (x0 ) = bbnk (x0 ) , n = 1, 2, 3,\nset of equations for the operators b\nak (x0 ) and b\n\u0001\nb k (x0 ),\n∂02 + k2 b\nak (x0 ) = ik * b\n\n(29)\n\nfor all k. The general solution of the equation (29) can be written as\n(1)\n\nb\nak (x0 ) = b\nak (x0 )e−\n\niωk 0\nx\nc\n\niω\n− ck x0\n\nb k (x0 ) = b\nb (1) (x0 )e\nb\nk\n\n(2)\n\n+b\nak (x0 )e\n(2)\n\niωk 0\nx\nc\n\nb (x0 )e\n+b\nk\n\n,\n\niωk 0\nx\nc\n\n.\n\n(30)\n(31)\n\nSince the classical fluid potential are real functions, i. e. θ = θ and A = A, it\nfollows that the corresponding quantum fields are hermitian. Therefore, the following\nrelations hold\n\u0010\n\u0011\n\u0010\n\u0011†\n(1) †\n(2)\nb (1) = b\nb (2) .\nb\nak\n=b\na−k , b\n(32)\nk\n−k\n\nBy using the hermiticity condition (32), one can write the final form of the plane\nwave expanssion for the physical field operators\nZ\nh\nωk 0 i\nωk 0\nb 0 , x) = d3 kNk b\n(33)\na†k e−i(k*x− c x ) ,\nθ(x\nak ei(k*x− c x ) + b\nZ\nh\nωk 0 i\nωk 0\ni\nπ\nbθ (x0 , x) = −\n(34)\na†k e−i(k*x− c x ) ,\nd3 kNk b\nak ei(k*x− c x ) − b\nλc\nZ\ni\nh\nω\nω\nbn (x0 , x) = d3 kNk bbnk ei(k*x− ck x0 ) + bb† e−i(k*x− ck x0 ) ,\n(35)\nA\nnk\n\n2\n\nb The normalization constant Nk can be\nbnk is the n-th component of A.\nwhere A\ndetermined by postulating the canonical equal-time commutators\nh\ni\nb 0 , x), π\nθ(x\nbθ (x0 , x′ ) = i~δ3 (x − x′ ),\n(36)\n\nThe field A(K, z, z) has rather a geometric character since it constains the information about the\nKähler space parametrized by the complex potentials z and z.\n\n\fand by defining the usual commutators among the creation and annihilation operators\nh\ni\nh\ni\nb\nak , b\na†k′ = δ3 (k − k′ ), bbnk , bb†mk′ = δnm δ3 (k − k′ )\n(37)\nh\nh\ni\ni\nb\nak , bbnk′ = [b\nak , b\nak′ ] = bbnk , bbmk′ = 0.\n(38)\n\nBy using the relations (36), (37) and (38), one can show that the normalization\nconstant has the following form\n\u0014\n\nλ~c\nNk =\n2ωk (2π)3\n\n\u00151\n2\n\n.\n\n(39)\n\nThe Fock space states can be constructed from the vacuum state that is annihilated to zero by all annihilation operators in the known way\nb\nak |0i = bbnk |0i = 0, n = 1, 2, 3,\n\n(40)\n\nc\npμ |0i = pμ |0i .\n\n(41)\n\n|kiθ = b\na†k |0i , |kn iA = bb†nk |0i , n = 1, 2, 3.\n\n(42)\n\nfor all k. Since the classical fluid is invariant under spacetime translations, it is natural\nto impose the invariance of the vacuum under translations\n\nThe physical states are obtained by acting with the creation operators on the vacuum\nstate. For example, the one-particle excitations of the quantum fluid potentials are\ndescribed by the following states\n\nIn this way, the canonical quantization can be carried out straightforwardly to\nthe relativistic fluid models described by the hamiltonian (15). However, there are\nsome differences from the general field quantization due to the quantum equation of\nmotion (26) that should be satisfied operatorially on all quantum states, and to some\nc Indeed, the\narbitrariety in defining the quantum structure of the vector potential A.\nequation (26) takes the following form in terms of creation and annihilation operators\n\u0013\u0010\n\u0012\n\u0011\n\u0010\n\u0011\nωk2\n2\nbk + b\nb † |ψi .\n(43)\nb\nak + b\na†−k |ψi = ik * b\n− 2 +k\nk\nc\n\u0010\n\u0011\nNote that for k = 0 either ω0 = 0 or b\na0 + b\na†0 |ψi = 0. If |ψi = |0i then (43) is\nequivalent to the following relation\n\u0012\n\n\u0013\n3\nX\nωk2\n2\n− 2 + k |kiθ = i\nkn |kn iA .\nc\n\n(44)\n\nn=1\n\nThat shows that for k 6= 0 a different normalization of b\nb†nk |0i can be considered\n!\n2 2\n2\n|k|\nc\n−ω\n†\nk\nbb |0i = −ikn\n|kiA ,\n(45)\nnk\n|k|2 c2\n\nP\nwhere |kiA = 3n=1 en |kn iA and {en }, n = 1, 2, 3 are orthogonal unit vectors on\nthe spacelike surface. The equations (44) with the normalization (45) is identically\nsatisfied by the dispersion relation of the massless scalar field ωk2 = |k|2 c2 .\n\n\fIn the above quantization, the unpropagating complex fluid potentials z and z\nand the Kähler potential field K(z, z) were not quantized directly, but rather under\nthe form of the vector potential A. Therefore, in principle one could also consider\nthe possibility of the semiclassical quantized fluid in which the field A is a classical\nvector potential and the dynamical canonical pair (θ, πθ ) is quantized. However, by\nrepeating the steps performed above in the canonical quantization formalism, but now\nb is the identity operator, we arrive at the following relation\nwith Â = A1̂, where 1\namong the one-particle excitations and the vacuum state\n\u0013\n\u0012\nω2\n2\n(46)\n|kiθ = i k − 2 k * bk |0iθ .\nc\nThat shows that if the Fourier coefficients bnk are classical functions on z and z, then\nthe Fock space is highly degenerate with all one-particle states proportional to the\nvacuum. Thus, we conclude that if the relativistic fluid model of the type discussed\nhere is to be treated as a quantum system, the vector potential A should be quantized\nas before in order to avoid the infinite vacuum degeneracy.\n\n4\n\nQuantum Topological Charge\n\nIn this section we are going to construct the quantum topological charge (quantum\nlinking number) operator which is the quantum counterpart of the classical linking\nnumber, and to discuss the properties of the Fock space states with respect to it.\nThe starting point is the classical topological linking number ω defined in the\nrelation (4). After some algebraic manipulations, it can be put in the following form\nZ\nω = d3 xεlmn (∂l θ∂m ∂n θ + 2∂l θ∂m An + 2Al ∂m ∂n θ + 4Al ∂m An ) .\n(47)\nNote that the first and the third terms from the above relation vanish due to presence\nof the totally antisymmetric tensor in the integrand, while the second term vanishes\nup to a total derivative. Let us define the quantum topological charge operator ω\nb by\ninterpreting the fields in (47) as quantum operators and taking the normal ordering\nof the creation and annihilation operators in the mode expansion of the quantum\nfields inside the integral. The ordering prescription is necessary due to the presence\nof potentially divergent terms, e.g. δ3 (0) kl km εlmn , which for arbitrary value of kn\nare zero and for |k| −→ 0 have an undetermined limit. They are a consequence of\nthe commutation relation (37) among the oscillator operators of θb field. By using the\nfield expansion relations (33), (34) and (35) inside the relation (47), the quantum\ntopological charge operator can be decomposed in the following sum\n\u0001\n:ω\nb (x0 ) : = 2 (2π)3 : ω\nb2 (x0 ) : + 2i : ω\nb4 (x0 ) : ,\n(48)\nThe operators : ω\nba (x0 ) : , a = 2, 4 from the r. h. s. of the above relation represent\nthe operatorial counterpart of the the second term, kept due to its total derivative\ncontribution, and the last term from the relation (47), respectively, in that order.\nAfter some calculations, one arrives at the following explicit form of the operators\n\n\f:ω\nba (x0 ) : written in terms of creation and annihilation operators\nZ\nh\ni\n2iωk 0\n0\nc† e 2iωc k x0 k k ,\nak + b\na†kbbnk + b\nakbbnk e− c x + ab† k b\n:ω\nb2 (x ) : = d3 kNk2 εlmn bb†nkb\nl m\nnk\n:ω\nb4 (x0 ) : =\n\nZ\n\nh\n\n2iω\n− ck\n\nblk − bblkbbnk e\nd3 kNk2 εlmn bb† lkbbnk − bb† nkb\n\nx0\n\n+ bb†lkbb†nk e\n\n2iωk 0\nx\nc\n\ni\n\n(49)\n\nkm .\n(50)\n\nSince the components of the momentum kn commute with any operator, one can see\nthat : ω\nb2 : vanishes due to the presence of the totally antisymmetric tensor. The\nsame symmetry arguments do not apply to : ω\nb4 : which is not zero. However, the\ntime dependent terms vanish in : ω\nb4 : . Indeed, by using the commutation relations\n(37) in the terms εlmnb\nblkb\nbnk km and εlmnbb†lkbb†nk km , one obtains vanishing operator\ncoefficients for each component kn . Therefore, the topological charge operator of the\nquantum relativistic fluid from the class of models discussed here has the form\nZ 3\n\u0011\nd k lmn \u0010 b† b\nε km b lk bnk − bb† nkbblk ,\n(51)\n:ω\nb : = 2iλ~c\nωk\nwhere the dependence on x0 has been dropped from : ω\nb : . Remark that the quantum\ntopological number operator is parametrized by the parameter λ linearly and that\nit is expressed in ~c units. Its dependence on the Kähler and complex potentials is\nhidden in the integrand and has a simple form due to the quantization of A field.\nThe fields θb and π\nbθ do not contribute to the topological charge operator that is time\nindependent.\nIn order to see how : ω\nb : \u0010acts on the\n\u0011 Fock space, we consider a general state of\n′\n′\n′\n′\nfixed momentum vector k = k1 , k2 , k3 of the form\n3\n\u0010 ′ \u0011E\n\u0010 ′ \u0011E O\n\u0010 ′\u0011\n\u0010 ′\u0011\n\u0010 ′ ′ ′ \u0011E\nnq kq .\n=\n= n1 k1 , n2 k2 , n3 k3\nΨ k1 , k2 , k3\n\n(52)\n\nq=1\n\n\u0010 ′\u0011\nHere, nq kq denotes the number nq of excitations of bq type which have the value\n′\n\nof momentum kq in the q = 1, 2, 3 direction. The last equality in (52) shows that the\nstate factorizes as a tensor product of number operator eigenstates in the corresponding directions 3 . Also, we consider that the number of excitations in each direction is\nfixed in the state (52) and that the number operator eigenstates are ortogonal and\nnormalized to unity\n\u0011\n\u0010\n\u0010 ′ \u0011E\nD\n′\n(53)\n= δl,s δnl ,ms δ kl − ks .\nnl (kl ) |ms ks\n\nIt is easy to see that the expectation value of : ω\nb : is zero in the states of the form\n(52) because of the fixed number of excitations in each direction one starts with. The\nvacuum state is of the form (52) and thus one concludes that the vacuum has zero\nlinking number as expected.\nThe dependence of the state given in the relation (52) on the excitations of the scalar potential θb does\nnot affect the calculation of the topological charge since θb does not contribute to the topological number\noperator.\n3\n\n\fSince the fixed number of excitations in the state (52) together with the ortogonality relation (53) make the topological charge number vanish, one could take instead\nthe more general linear combination of states that have the following form\n|Ψi =\n\nZ\n\nd3 k′\n(2π)3\n\n3\nX\n\nn1 ,n2 ,n3 =1\n\n\u0010 ′ \u0011E\n\u0010 ′\u0011\n\u0010 ′\u0011\n\u0010 ′ ′ ′\u0011\nCn1 ,n2 ,n3 k1 , k2 , k3 n1 k1 , n2 k2 , n3 k3 ,\n\n(54)\n\n\u0010 ′ ′ ′\u0011\nwhere the arbitrary complex coefficient functions Cn1 ,n2 ,n3 k1 , k2 , k3 can be normalized to make the integral covariant if necessary. The states from the above relations\nare entangled states of tensored number operators eigenstates. One can show that\nthe expectation value h : ω\nb : i in the states of the form (54) is given by the following\nrelation\nh: ω\nb : i = 4iλ~c\n\nZ\n\nd3 k\nωk\n\n3\nX\n\nCn1 ,n2 ,n3 (k1 , k2 , k3 )\n\nn1 ,n2 ,n3 =1\n\nn hp\ni\np\n× k1\nn2 (n3 + 1)C n1 ,n2−1 ,n3+1 (k1 , k2 , k3 ) − n3 (n2 + 1)C n1 ,n2+1 ,n3−1 (k1 , k2 , k3 )\nhp\ni\np\n+ k2\nn1 (n3 + 1)C n1 +1,n2 ,n3−1 (k1 , k2 , k3 ) − n1 (n3 + 1)C n1−1 ,n2 ,n3+1 (k1 , k2 , k3 )\nhp\nio\np\n+ k3\nn1 (n2 + 1)C n1 −1,n2+1 ,n3 (k1 , k2 , k3 ) − n2 (n1 + 1)C n1+1 ,n2−1 ,n3 (k1 , k2 , k3 ) ,\n(55)\n\nSome comments are in order now. Firstly, note that the quantum topological\nnumber given in the relation (55) is different from zero if the integral does not\nvanish. This\nshould be satisfied by a large set of arbitrary coefficients\n\u0010 ′ condition\n\u0011\n′\n′\nCn1 ,n2 ,n3 k1 , k2 , k3 which thus define the states with non-vanishing quantum topological linking number. Secondly, one can see from the classical state equations of the\nmodel (13) and the relation (55), that there is a large number of quantum states in\nwhich the quantum linking number is infinite due to the infinite value of the classical limit of the pressure density or the energy density, i. e. for p → ∞ or ε → ∞,\nrespectively. On the other hand, for p → 0 or ε → 0, the topological number is zero,\nunless the integral and sum in the r. h. s. of (55) diverge in the corresponding state.\nThirdly, note that in general either the quantum linking number is zero or it is time\nindependent as expected. This result expresses the conservation of the expectation\nvalues of the linking number operator.\n\n5\n\nConclussions\n\nIn this paper, we have investigated the quantization of the relativistic fluid on Kähler\nmanifolds. The class of models considered here are parametrized by an arbitrary\nKähler potential depending on two complex fluid potentials z and z and a real parameter λ. That type of models represents a subset of a larger set parametrized by\n{K(z, z), f (ρ)} that was firstly\nq proposed in [14]. Due to the arbitrary dependence\n\nof the lagrangian on ρ = πθ2 − j2 , the full set of relativistic fluid models is not\nsuitable for quantization. As was shown in [14], the degrees of freedom of the full set\n{K(z, z), f (ρ)} are constrained by second class constraints. As a first result, we have\n\n\fobtained the physical degrees of freedom of the fluid described by {K(z, z), f (ρ)} by\napplying the symplectic projector method. We have concluded that the classical theory on the physical surface displays the same topological charges as the original theory\n[14] since the symplectic projector does not include the conserved axial currents. Our\nresults for the full set of classical relativistic fluids agree with the ones presented in\nthe literature which revalidates the applicability of the symplectic projector method\nto second class constraints.\nThe main result of this paper is the quantization of the smaller set of models\n{K(z, z), λ}. We have obtained the quantum theory by applying the canonical quantization methods to the pair of fields (θ, πθ ) as well as to the vector field A(K, z, z)\nwhich encodes the information about the Kähler and the complex fluid potentials,\nrespectively, and we have constructed the Fock space of the relativistic fluid and\nthe one-particle excitations of the relativistic potentials. Also, we have discussed the\nsemiclassical quantization of the relativistic fluid in which the potential A(K, z, z) is\na classical field. By analysing the one-particle spectrum, it has been shown that the\nvacuum of the semiclassical theory is infinitely degenerate. From that, one concludes\nb should be treated as a quantum field.\nthat A\nThe second important result of the present paper is the construction of the quantum linking number operator ω\nb which was defined by taking the normal ordered field\nproducts in the r. h. s. of the relation (47). The operator ω\nb is time independent and\nit is determined only by the Kähler and the complex potentials, with no contribution\nfrom the real potential. We have shown that the vacuum of the quantum relativistic\nfluid has vanishing linking number, as well as the states formed by taking the tensor\nb field. However, there are entangled\nproduct of number operators eigenstates of A\nnumber operator eigenstates with non-vanishing linking number.\nAs a final comment, we note that the classical topological number can be expressed\nas a surface term as in the relation (4). It would be certainly interesting to compare\nthe approach presented in this paper with a different quantization method and to\nattempt a proper treatment of the boundaries in the quantum theory. That analysis\nand the application of the present method to the supersymmetric fluid [6] in the\nKähler parametrization will hopefully be discussed elsewhere.\nAcknowledgements We thank to H. Belich for useful discussions. I. V. V. would\nlike to acknowledge J. C. Fabris for hospitality at DEFIS - UFES. L. H. and I. V. V.\nwould like to thank to J. A. Helayël-Neto, S. A. Dias and A. M. O. de Almeida for\nhospitality at LAFEX-CBPF where parts of this work were accomplished. Finally,\nwe would like to acknowledge an anonymous referee for constructive discussions.\n\nReferences\n[1] Sauls, J.A. (1989) Superfluidity in the interior of neutron stars, in Timing Neutron Stars (NATO ASI C262, Izmir 1988) ed. Ogelman, H. and van den Heuvel,\nE.J.P., Kluwer, Dordrecht, pp. 457–502.\n[2] A. Vilenkin and T. Vachaspati, Phys. Rev. D 35, 1138 (1987).\n[3] B. Carter and\n[hep-th/9611082].\n\nD.\n\nLanglois,\n\nNuclear\n\nPhysics\n\nB454(1995)402–424.\n\n[4] R. L. Davis and E. P. S. Shellard, (1989) Phys. Rev. Lett. 63(1989)2021–2024.\n\n\f[5] R. Jackiw and A. P. Polychronakos, Commun. Math. Phys. 207, 107 (1999).\n[arXiv:hep-th/9902024].\n[6] R. Jackiw and A. P. Polychronakos, Phys. Rev. D 62, 085019 (2000).\n[arXiv:hep-th/0004083].\n[7] R. Jackiw, Nucl. Phys. Proc. Suppl. 88, 215 (2000). [arXiv:hep-th/9911235].\n[8] R. Jackiw, Theor. Math. Phys. 124 (2000) 1038 [Teor. Mat. Fiz. 124 (2000)\n215].\n[9] A. Clebsch, J. Reine. Angew. Math. 56(1859)1.\n[10] R. Jackiw and S. Y. Pi, Phys. Rev. D 61, 105015 (2000). [arXiv:hep-th/9911072].\n[11] S. Chaplygin, Sci. Mem. Moscow Univ. Math. Phys. 12(1904)1.\n[12] R. Jackiw, Lecture notes on fluid mechanics, [arxiv:physics/0010042].\n[13] B. Carter, \"Relativistic\n[arXiv:gr-qc/9907039].\n\ndynamics\n\nof\n\nvortex\n\ndefects\n\nin\n\nsuperfluids,\"\n\n[14] T. S. Nyawelo, J. W. van Holten and S. G. Nibbelink, Phys. Rev. D 68, 125006\n(2003). [arXiv:hep-th/0307283].\n[15] Y. Bergner and R. Jackiw, Phys. Lett. A 284, (2001). [arXiv:physics/0103092v2]\n[16] M. Hassaine, Phys. Lett. A 290, 157 (2001). [arXiv:hep-th/0106252].\n[17] T. S. Nyawelo, J. W. Van Holten and S. Groot Nibbelink, Phys. Rev. D 64,\n021701 (2001). [arXiv:hep-th/0104104].\n[18] C. M. Do Amaral, Nuovo Cim. B 25, 817 (1975).\n[19] P. Pitanga and C. M. do Amaral, Nuovo Cim. A 103 (1990) 1529.\n[20] M. A. Santos, J. C. de Mello and P. Pitanga, Z. Phys. C 55, 271 (1992).\n[21] L. R. U. Manssur, A. L. M. Nogueira and M. A. Santos, Int. J. Mod. Phys. A\n17, 1919 (2002). [arXiv:hep-th/0005214].\n[22] M. A. De Andrade, M. A. Santos and I. V. Vancea, JHEP 0106, 026 (2001).\n[arXiv:hep-th/0104154].\n[23] J. A. Helayel-Neto, M. A. Santos and I. V. Vancea, Braz. J. Phys. 36, 1305\n(2006). [arXiv:hep-th/0407146].\n[24] H. Belich, M. A. De Andrade and M. A. Santos, Mod. Phys. Lett. A 20, 2305\n(2005). [arXiv:hep-th/0503145].\n[25] R. Carroll, Fundam. Theor. Phys. 148, 1 (2006).\n[26] D. Baleanu, Central Eur. J. Phys. 4, 503 (2006). [arXiv:gr-qc/0612059].\n[27] M. A. De Andrade, M. A. Santos and I. V. Vancea, Mod. Phys. Lett. A 16, 1907\n(2001). [arXiv:hep-th/0108197].\n[28] M. A. De Andrade, M. A. Santos and I. V. Vancea, \"Symplectic Projector and The Physical Degrees of Freedom of The Classical Particle,\"\n[arXiv:hep-th/0308169].\n[29] P. A. M. Dirac, Lectures on Quantum Mechanics, Dover Publications Inc., 2001.\n\n\f"}