{"id": "http://arxiv.org/abs/0907.3558v2", "guidislink": true, "updated": "2017-11-09T11:59:02Z", "updated_parsed": [2017, 11, 9, 11, 59, 2, 3, 313, 0], "published": "2009-07-21T07:25:10Z", "published_parsed": [2009, 7, 21, 7, 25, 10, 1, 202, 0], "title": "Non-algebraic compact Kähler threefolds admitting endomorphisms", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0907.0124%2C0907.2406%2C0907.1205%2C0907.5220%2C0907.1309%2C0907.1544%2C0907.3952%2C0907.1718%2C0907.0243%2C0907.0323%2C0907.0663%2C0907.3163%2C0907.2960%2C0907.2016%2C0907.5222%2C0907.1640%2C0907.3821%2C0907.1650%2C0907.1707%2C0907.0922%2C0907.2857%2C0907.2575%2C0907.4016%2C0907.5393%2C0907.1757%2C0907.5189%2C0907.0255%2C0907.0347%2C0907.1149%2C0907.2374%2C0907.4879%2C0907.2407%2C0907.2872%2C0907.2389%2C0907.1402%2C0907.4760%2C0907.2236%2C0907.0116%2C0907.3992%2C0907.2468%2C0907.5565%2C0907.1209%2C0907.0588%2C0907.3282%2C0907.3938%2C0907.5126%2C0907.2504%2C0907.4046%2C0907.2063%2C0907.0985%2C0907.2304%2C0907.2730%2C0907.2216%2C0907.0466%2C0907.0047%2C0907.0690%2C0907.1534%2C0907.2780%2C0907.3105%2C0907.5310%2C0907.5297%2C0907.5484%2C0907.1903%2C0907.2881%2C0907.3220%2C0907.3165%2C0907.2332%2C0907.3411%2C0907.0089%2C0907.5274%2C0907.4413%2C0907.2992%2C0907.2015%2C0907.0060%2C0907.4047%2C0907.5399%2C0907.4747%2C0907.0694%2C0907.2682%2C0907.0683%2C0907.2509%2C0907.5438%2C0907.3418%2C0907.3558%2C0907.3752%2C0907.3272%2C0907.1486%2C0907.3930%2C0907.0541%2C0907.0269%2C0907.1218%2C0907.1704%2C0907.1854%2C0907.2677%2C0907.4401%2C0907.0111%2C0907.2712%2C0907.2700%2C0907.3028%2C0907.4513%2C0907.1559&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Non-algebraic compact Kähler threefolds admitting endomorphisms"}, "summary": "We classify non-algebraic compact K\\\"ahler threefolds admitting an\nendomorphism $f: X \\to X$ of degree at least two.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0907.0124%2C0907.2406%2C0907.1205%2C0907.5220%2C0907.1309%2C0907.1544%2C0907.3952%2C0907.1718%2C0907.0243%2C0907.0323%2C0907.0663%2C0907.3163%2C0907.2960%2C0907.2016%2C0907.5222%2C0907.1640%2C0907.3821%2C0907.1650%2C0907.1707%2C0907.0922%2C0907.2857%2C0907.2575%2C0907.4016%2C0907.5393%2C0907.1757%2C0907.5189%2C0907.0255%2C0907.0347%2C0907.1149%2C0907.2374%2C0907.4879%2C0907.2407%2C0907.2872%2C0907.2389%2C0907.1402%2C0907.4760%2C0907.2236%2C0907.0116%2C0907.3992%2C0907.2468%2C0907.5565%2C0907.1209%2C0907.0588%2C0907.3282%2C0907.3938%2C0907.5126%2C0907.2504%2C0907.4046%2C0907.2063%2C0907.0985%2C0907.2304%2C0907.2730%2C0907.2216%2C0907.0466%2C0907.0047%2C0907.0690%2C0907.1534%2C0907.2780%2C0907.3105%2C0907.5310%2C0907.5297%2C0907.5484%2C0907.1903%2C0907.2881%2C0907.3220%2C0907.3165%2C0907.2332%2C0907.3411%2C0907.0089%2C0907.5274%2C0907.4413%2C0907.2992%2C0907.2015%2C0907.0060%2C0907.4047%2C0907.5399%2C0907.4747%2C0907.0694%2C0907.2682%2C0907.0683%2C0907.2509%2C0907.5438%2C0907.3418%2C0907.3558%2C0907.3752%2C0907.3272%2C0907.1486%2C0907.3930%2C0907.0541%2C0907.0269%2C0907.1218%2C0907.1704%2C0907.1854%2C0907.2677%2C0907.4401%2C0907.0111%2C0907.2712%2C0907.2700%2C0907.3028%2C0907.4513%2C0907.1559&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We classify non-algebraic compact K\\\"ahler threefolds admitting an\nendomorphism $f: X \\to X$ of degree at least two."}, "authors": ["Andreas Höring", "Thomas Peternell"], "author_detail": {"name": "Thomas Peternell"}, "author": "Thomas Peternell", "arxiv_comment": "39 pages, changed metadata", "links": [{"href": "http://arxiv.org/abs/0907.3558v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0907.3558v2", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "math.AG", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "math.AG", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "math.CV", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "32J17, 32H02, 32J27, 14E20, 14E30", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0907.3558v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0907.3558v2", "journal_reference": null, "doi": null, "fulltext": "arXiv:0907.3558v2 [math.AG] 9 Nov 2017\n\nNON-ALGEBRAIC COMPACT KÄHLER THREEFOLDS\nADMITTING ENDOMORPHISMS\nANDREAS HÖRING AND THOMAS PETERNELL\n\nAbstract. We classify non-algebraic compact Kähler threefolds admitting an\nendomorphism f : X → X of degree at least two.\n\nContents\n1. Introduction\n\n1\n\n2. Notation and basic results\n\n3\n\n3. Compact Kähler threefolds\n\n12\n\n4. Torus fibrations\n\n17\n\n5. Non-uniruled manifolds\n\n21\n\n6. Uniruled manifolds\n\n27\n\nReferences\n\n38\n\n1. Introduction\nAn endomorphism of a compact complex manifold X is a surjective map f : X → X,\nusually assumed to be of degree d at least two, i.e. automorphisms are excluded.\nEndomorphisms of projective manifolds were intensively studied in the last years\n[Bea01, Fuj02, Nak02, HM03, Ame03, FN05, FN07, NZ07, Nak08, AKP08, NZ09].\nFor example if X is a smooth projective threefold and f is étale, X is completely\nclassified up to étale cover. Also the higher-dimensional case is intensively treated\nbut far from being completely understood.\nIn this paper we classify all non-algebraic three-dimensional compact Kähler manifolds X admitting an endomorphism f regardless whether f is ramified or not.\nBefore we state our classification results let us give an example how the nonalgebraicity assumption gives additional restrictions on the existence of endomorphisms.\n1.1. Theorem. Let X be a non-algebraic compact Kähler manifold of dimension\nn which admits a meromorphic endomorphism f : X 99K X of degree d > 1. Then\nκ(X) 6= n − 1.\nDate: July 21, 2009.\n2000 Mathematics Subject Classification. 32J17, 32H02, 32J27, 14E20, 14E30.\nKey words and phrases. endomorphism, compact Kähler manifold, non-algebraic manifold,\ntorus fibrations, MMP.\n1\n\n\fIn fact if κ(X) = n − 1, the Iitaka fibration coincides with the algebraic reduction,\nwhich is an elliptic fiber space over a projective manifold of dimension n − 1. The\nexistence of the endomorphism gives rise to a meromorphic multi-section of the\nfibration, and therefore any two points of X can be joined by a chain of compact\ncurves. Hence X is projective due to a result of Campana.\nIf the manifold is not uniruled our results can be summarised as follows.\n1.2. Theorem. Let X be a compact non-algebraic Kähler threefold which is not\nuniruled. Suppose that X admits an endomorphism f : X → X of degree d > 1.\nThen (up to étale cover) one of the following holds:\n1.) κ(X) = 0 : then either\na) X is a torus or\nb) X is a product Y ×E where Y is bimeromorphic to a torus or K3 surface\nand E an elliptic curve.\n2.) κ(X) = 1 : then either\na) X is a product C × A where C is a curve of general type and A is a\ntwo-dimensional torus of algebraic dimension at most one or\nb) X is a product E × S where E is an elliptic curve and S an elliptic\nsurface of algebraic dimension one.\nIf f is ramified, it is a basic fact that KX is not pseudoeffective. If X is algebraic,\nthen X is uniruled (cf. [BDPP04] which is based on a theorem of Miyaoka-Mori\nusing characteristic p methods). In the Kähler case the uniruledness is only known\nin dimension three due to a remarkable result of Brunella [Bru06].\n1.3. Theorem. Let X be a compact non-algebraic Kähler threefold of algebraic\ndimension a(X) which is uniruled. Suppose that X admits an endomorphism f :\nX → X of degree d > 1. If f is ramified, then (up to étale cover) one of the following\nholds.\n1.) a(X) = 0 : then X is a projectivised bundle P(E) over a torus A of algebraic\ndimension zero, f induces an endomorphism on A of degree at least two,\nand E is a direct sum of line bundles.\n2.) a(X) = 1 : then either\na) X is a product S × P1 , where S is a compact Kähler surface of algebraic\ndimension zero and f induces an automorphism on S or\nb) X is a projectivised bundle P(E) over a torus A of algebraic dimension\nat most one, f induces an endomorphism on A of degree at least two,\nand E is a direct sum of line bundles.\n3.) a(X) = 2 : then either\na) X is a product Y × P1 where Y is a surface of algebraic dimension one\nand f induces an automorphism on Y or\nb) X is a projectivised bundle P(E) over a torus A of algebraic dimension\none and f induces an endomorphism g of degree at least two on A.\nIf f is étale, then X is (up to étale cover) a projectivised bundle P(E) over a\nnon-algebraic torus A and c21 (E) = 4c2 (E).\nIn the projective case Mori theory is heavily used to pass to minimal models. In the\nKähler case only rudiments of Mori theory are known (see Section 3.B), but they\n2\n\n\fsuffice in the special cases we are interested in. Moreover the algebraic reduction\nprovides a powerful tool.\nGuide to the reader. In Section 2 we recall the basic definitions and gather various\nresults which will be used at some point in the paper. In Section 3 we prove\nnew statements in the Mori theory of compact Kähler threefolds which should\nbe interesting in their own right. Together with the results from [Pet98, Pet01]\nthey allow us to establish a MMP for compact Kähler threefolds admitting étale\nendomorphisms of degree at least two. A crucial point is that the contractions\nnever contract a divisor to a point, so that we always stay in the smooth category.\nSection 4 provides results that would be trivial in the projective case: based on a\ndiscussion of the fixed point set of torus endomorphisms, we establish the existence\nof multisections for torus fibrations commuting with an endomorphism. Using a\ntheorem of Nakayama and Zhang, the proof of Theorem 1.1 is then an easy exercise\n(cf. page 19). The Theorems 1.2 and 1.3 are proven in the Sections 5 and 6\nrespectively. These two sections are the core of this paper, we advise the reader to\nstart here and skip the preceding technical sections for the first reading.\nAcknowledgements. We would like to thank T.-C. Dinh, C. Favre, P. PopescuPampu and N. Sibony for very helpful discussions on this subject. We also thank\nthe Research Group \"Classification of Algebraic Surfaces and Compact Complex\nManifolds\" of the Deutsche Forschungsgemeinschaft DFG for financial support.\n2. Notation and basic results\nFor standard definitions in complex geometry we refer to [Har77] or [KK83]. Moreover we refer to [BHPVdV04] for basic results on surfaces and to [Fuj83] to the\nclassification theory of higher-dimensional non-algebraic varieties. Manifolds and\nvarieties are always supposed to be irreducible. We will always assume implicitly\nthat a compact Kähler manifold/surface/threefold is smooth. If a certain statement\nholds for a singular variety, we will mention what types of singularities are allowed.\nWe say that a certain property holds for a general (resp. very general) point x ∈ X\nif there exists a finite (resp. countable) union of proper subvarieties of X such that\nthe property holds for every point in the complement.\n2.A. Endomorphisms.\n2.1. Notation. Let X be a compact complex variety that is normal or Gorenstein.\nAn endomorphism is a holomorphic surjective map f : X → X. It is easy to see\nthat f is a finite map, so the ramification formula\nKX = f ∗ KX + R\nholds and we will call the support of R the ramification locus. The support of the\ncycle theoretic image B := f∗ R will be called the branch locus. We will say that f\nis étale (in codimension one) if R is empty.\nRemarks. 1. If X is smooth, an endomorphism that is étale in codimension one\nis étale in every point.\n2. Analogously one defines a meromorphic endomorphism of a compact complex\nvariety as a meromorphic dominant map f : X 99K X.\n3\n\n\fThe following well-known results will be used many times in this paper:\n2.2. Lemma. Let X be a compact Kähler manifold of dimension n, and let f :\nX → X be an endomorphism of degree d > 1. Then f is finite. The linear maps\nf ∗ : H ∗ (X, Q) → H ∗ (X, Q) and f∗ : H ∗ (X, Q) → H ∗ (X, Q)\n\nare isomorphisms. More precisely we have f∗ f ∗ = d Id.\nIf f is étale, we have\n• χ(X, OX ) = 0,\n• e(X) := χtop (X) = cn (X) = 0, and\nn\n• KX\n= 0.\n\n2.3. Lemma. Let X be a compact Kähler variety of dimension n, and let f : X →\nX be an endomorphism of degree d > 1. Let D be a Cartier divisor on X such that\nf ∗ D ≡num mD for some m ∈ N. Then we have Dn = 0 or d = mn .\nIn particular if D is an effective divisor that is not contained in the branch locus of\nf and such that f −1 (D) = D, we have Dn = 0.\nProof. Since f∗ f ∗ = d Id, we see that\nmn Dn = (f ∗ D)n = f ∗ (Dn ) = dDn ,\nso the first statement is immediate. For the second statement observe that the\nhypothesis implies that f ∗ D ≃ D.\n\u0003\nThe next statement shows that from the point of view of endomorphisms, it is quite\nnatural to treat separately uniruled and non-uniruled manifolds.\n2.4. Proposition. Let X be a smooth compact Kähler threefold and f : X → X\nbe a ramified endomorphism of degree d > 1. Then X is uniruled.\nProof. By [AKP08, Thm.4.1] the canonical divisor KX is not pseudo-effective, i.e.\nthe class of KX is not contained in the closure of the Kähler cone. Therefore by\n[Bru06, Cor.1.2], X is uniruled.\n\u0003\n2.B. Fibrations. A fibration is a proper surjective morphism φ : X → Y with\nconnected fibres from a complex manifold onto a normal complex variety Y . A\nfibre is always a fibre in the scheme-theoretic sense and will be denote by φ−1 (y)\nor Xy . A set-theoretic fibre is the reduction of the fibre. The φ-smooth locus\nis the largest Zariski open subset Y ∗ ⊂ Y such that for every y ∈ Y ∗ , the fibre\nφ−1 (y) is a smooth variety of dimension dim X − dim Y . The φ-singular locus is\nits complement.\nLet us recall the rigidity lemma that will be used many times in this paper.\n2.5. Lemma. Let f : X → Y and g : X → Z be fibrations. Suppose that for every\nz ∈ Z the fibre g −1 (z) is mapped by f onto a point. Then there exists a holomorphic\nmap h : Z → Y such that f = h ◦ g.\nIf moreover g is flat the same conclusion holds if at least one g-fibre is contracted\nby f .\n4\n\n\f2.6. Definition. A meromorphic map φ : X 99K Y from a compact Kähler manifold to a normal Kähler variety is almost holomorphic if there exist non-empty\nZariski open subsets X ∗ ⊂ X and Y ∗ ⊂ Y such that φ|X ∗ : X ∗ → Y ∗ is a fibration.\nIn particular for y ∈ Y a general point, the fibre φ−1 (y) exists in the usual sense\nand is compact.\nThe importance of almost holomorphic maps is due to the fact that every compact\nKähler manifold admits such a fibration that separates the rationally connected\npart and the non-uniruled part: the rationally connected quotient.\n2.7. Theorem. [Kol96, Thm.5.4],[Cam04, Thm. 1.1], [GHS03]1 Let X be a\ncompact Kähler manifold. Then there exists an almost holomorphic fibration\nφ : X 99K Y onto a normal compact Kähler variety Y such that the general fibre is rationally connected and the variety Y is not uniruled. This map is unique\nup to meromorphic equivalence of fibrations [Cam04] and will be called the rationally\nconnected quotient.\n2.C. Endomorphisms that preserve fibrations.\n2.8. Definition. Let X be a compact Kähler manifold, and let f : X → X be an\nendomorphism of degree d > 1. Suppose that X admits a fibration φ : X → Y onto\na normal Kähler variety Y . If there exists an endomorphism g : Y → Y such that\ng ◦ φ = φ ◦ f , we say that f preserves the fibration and g is the endomorphism\ninduced by f on Y .\nAll the natural fibrations attached to a variety are preserved by an endomorphism.\n2.9. Proposition. Let X be a compact Kähler manifold, and let f : X → X be an\nendomorphism of degree d > 1.\n1. Let α : X → Alb(X) be the Albanese map. Then there exists an endomorphism\ng : Alb(X) → Alb(X) such that g ◦ φ = φ ◦ f .\n\n2. Let φ : X 99K Y be the Iitaka fibration. Then there exists a automorphism\ng : Y → Y such that g ◦ φ = φ ◦ f .\n\n3. Let φ : X 99K Y be the rationally connected quotient of X. Then there exists a\nmeromorphic map g : Y 99K Y such that g ◦ φ = φ ◦ f .\nProof. The first statement follows immediately from the universal property of the\nAlbanese map, the second statement can be shown as in [Fuj02, Prop.2.5] where the\nprojectiveness assumption is actually not used. For the last statement, note that\nup to replacing Y by a Zariski open dense subset, we may suppose that the almost\nholomorphic map φ is holomorphic. By the rigidity lemma it is sufficient to show\nthat a general φ-fibre F is contracted by φ ◦ f . Since F is rationally connected and\nY is not uniruled, this is trivially true.\n\u0003\nBefore we can prove an analogue of Proposition 2.9 for the algebraic reduction, we\nneed one more definition.\n1The statement in [Kol96] is in the algebraic setting, but the same proof goes through in\nthe compact Kähler category: the main technical tool [Cam04, Thm. 1.1] holds in this larger\ngenerality.\n5\n\n\f2.10. Definition. Let X be a compact Kähler manifold. An integral effective\ndivisor D ⊂ X is polar if there exists a meromorphic function ψ on X such that\nD ⊂ div(ψ).\n2.11. Remark. If X is projective, every divisor is polar. If the algebraic dimension\nis zero, every divisor is non-polar.\n2.12. Proposition. Let X be a compact complex manifold that admits a meromorphic endomorphism f : X 99K X. Denote by φ : X 99K Y the algebraic\nreduction of X. Then there exists a meromorphic endomorphism g : Y → Y such\nthat φ ◦ f = g ◦ φ.\nRemark. If X has algebraic dimension one the variety Y is a smooth compact\ncurve, so the meromorphic endomorphism extends to a holomorphic map.\nProof. Up to replacing X by some bimeromorphic model we may suppose that the\nalgebraic reduction is holomorphic. The endomorphism f acts by pull-back on the\nmeromorphic function field\nC(X) = C(Y ),\nand we define g to be the meromorphic map corresponding to f ∗ : C(Y ) → C(Y ).\nSince every polar divisor on X is contained in a pull-back from Y and the pull-back\nof a polar divisor is polar, one sees easily that φ ◦ f = g ◦ φ.\n\u0003\n2.13. Definition. Let Y be a normal compact Kähler variety and let g : Y → Y\nbe an endomorphism of degree at least two. We say that g is totally ramified in a\npoint y ∈ Y , if the set-theoretical fibre (g −1 (y))red is a singleton.\n2.14. Proposition. Let X be a compact Kähler manifold, and let f : X → X be\nan endomorphism. Let φ : X → Y be a surjective morphism onto a normal Kähler\nvariety such that there exists an endomorphism g : Y → Y such that g ◦ φ = φ ◦ f .\n1. For m ∈ N, set\n\nTm := {y ∈ Y | dim φ−1 (y) > m − 1}.\n\nThen we have (set-theoretically) g −1 (Tm ) = Tm . If Tm is finite and g of degree at\nleast two, then g is totally ramified in every point of Tm .\n2. Set\nR := {y ∈ Y | φ−1 (y) is reducible}.\n\nThen we have (set-theoretically) g −1 (R) = R. If R is finite and g of degree at least\ntwo, then g is totally ramified in every point of R.\n3. Let\n∆ := {y ∈ Y | φ−1 (y) is singular}\n\nbe the φ-singular locus and denote by R the branch locus of g. Then g −1 (∆) is\ncontained set-theoretically in the union of ∆ and the branch locus R. If g is étale,\nthen (set-theoretically) g −1 (∆) = ∆.\nIn particular if g is an étale map of degree at least two, then Tm , R and ∆ are\neither of positive dimension or empty.\n6\n\n\fProof. 1. Since g −1 (Tm ) has at least as many irreducible components as Tm , it is\nsufficient to show that g −1 (Tm ) ⊂ Tm . Yet if t ∈ Tm and y ∈ g −1 (t), then φ−1 (y)\nsurjects via f on φ−1 (t), so dim φ−1 (y) ≥ dim φ−1 (t) > m − 1. If Tm is finite, then\n#g −1 (Tm ) ≥ #Tm and equality holds if and only if g is totally ramified in every\npoint of Tm .\n2. Analogous to 1.\n3. If t ∈ ∆ and y ∈ g −1 (t) such that y 6∈ R, then for every x ∈ φ−1 (y) we have\nrkTφ,x = rkTg◦φ,x = rkTφ◦f,x ≤ rkTφ,f (x).\n\nSince φ−1 (t) is singular, there exists a point f (x) ∈ φ−1 (t) such that the tangent\nmap does not have maximal rank. It follows that y ∈ ∆.\n\u0003\n2.15. Lemma. Let X be a compact Kähler variety, and let f : X → X be an\nendomorphism of degree d > 1. Suppose that there exists a fibration φ : X → C\nonto a smooth curve C and an automorphism g : C → C such that g ◦ φ = φ ◦ f . If\nBi is an irreducible component of the branch locus of f , then Bi surjects onto C.\nProof. By Proposition 2.14 the φ-singular locus ∆ satisfies g −1 (∆) = ∆. Since\n∆ is finite, we can suppose, up to replacing f by f k that g is the identity on ∆.\nWe argue by contradiction and suppose that φ(Bi ) = c, then it is an irreducible\ncomponent of the fibre Xc ≃ φ∗ c. Suppose first that Xc is not a smooth fibre, then\nc ∈ ∆ which implies g ∗ c = c. Therefore we have\nXc ≃ φ∗ g ∗ c ≃ f ∗ φ∗ c ≃ f ∗ Xc ,\n\nin particular mi Bi ≃ f ∗ Bi ≃ Bi . Since the ramification index mi is strictly larger\nthan one, this implies that Bi is homologous to zero, a contradiction. If Xc is a\nsmooth fibre, then Xc = Bi and g ∗ c = c′ with c′ 6∈ ∆. The same computation shows\nthat Xc′ ≃ f ∗ Bi = mi Bi . Since Xc′ is smooth, so reduced, we get a contradiction.\n\u0003\nThe following statement generalises [Ame03, Thm.1], its proof is a mere adaptation\nof Amerik's proof to our context.\n2.16. Proposition. Let X be a compact Kähler manifold, and let f : X → X be\nan endomorphism of degree d > 1. Suppose that there exists a fibration φ : X → Y\nonto a normal variety Y such that\n•\n•\n•\n•\n\nthere exists an automorphism g such that g ◦ φ = φ ◦ f ,\nthe general φ-fibre is isomorphic to Pr ,\nthe φ-singular locus ∆ has codimension at least two in every point, and\nany finite étale cover Y0′ → Y \\ ∆ extends (maybe after a further finite étale\ncover) to a finite map Y ′ → Y .\n\nThen there exists a finite map Y ′ → Y such that X ×Y Y ′ is bimeromorphic to\nY ′ × Pr . In particular we have a(X) = a(Y ) + r.\n2.17. Remark. If Y is smooth, the last condition in the proposition is automatically satisfied. In fact we have\nπ1 (Y \\ ∆) ≃ π1 (Y ),\n\nso we can even extend by an étale map.\n\n7\n\n\fProof. Since g is an automorphism, the restriction of f to a general fibre induces\nan endomorphism of degree d > 1 and up to replacing f by some f k , we can\nsuppose without loss of generality that d > r + 1. Then by [Ame03, Prop.1.1]\nthe space of endomorphism of Pr of degree d has an affine geometric quotient\nRm (Pr , Pr )/P GL(r + 1) ⊂ CN . Thus the fibration φ induces a holomorphic map\n(Y \\ ∆) → Rm (Pr , Pr )/P GL(r + 1) ⊂ CN . Since Y is normal, the map extends to\na holomorphical map Y → CN by Hartog's theorem. Since Y is compact, this map\nis constant. Arguing as in Amerik's proof of [Ame03, page 22, line7ff], we see that\nthere exists an étale cover Y0′ → Y \\ ∆ such that the fibre product X ×Y \\∆ Y0′ is\nisomorphic to Y0′ × Pr . By the last condition, we know that (up to replacing Y0′\nby some higher étale cover), the étale cover extends to a finite map Y ′ → Y . By\nconstruction we then have a holomorphic map\nY0′ × Pr ֒→ X ×Y Y ′ ,\n\nand since (Y ′ × Pr ) \\ (Y0′ × Pr ) has codimension at least two, we can apply [Gun90,\nCh.P.,Thm.10] to get a bimeromorphic map\nY ′ × Pr 99K X ×Y Y ′ .\n\n\u0003\n\n2.D. Auxiliary results on compact Kähler surfaces. Recall that by the classification of surfaces a compact complex surface of algebraic dimension zero that\nis in the Fujiki class is bimeromorphic to a torus or a K3 surface. The following\ntechnical lemma is well-known to experts, but for the convenience of the reader we\ninclude it and its (easy) proof.\n2.18. Lemma. Let S be a normal complex compact surface of algebraic dimension\nzero that is in the Fujiki class. Then there exists a bimeromorphic map S → Smin\nonto a normal surface Smin that does not contain any curves.\nIf S is bimeromorphic to a torus, then Smin is a torus. If S is bimeromorphic to a\nK3 surface, then Smin has at most rational double points.\nMoreover if D is an effective, non-trivial Cartier divisor on S then D2 < 0.\nRemark. If S is bimeromorphic to a K3 surface, we will call Smin a singular K3\nsurface. Although this has a completely different meaning in the theory of lattices\nof K3 surfaces, we hope that no confusion will arise.\nProof. Suppose first that S is smooth, and let S → S ′ be the minimal model of S.\nIf S ′ is a torus, it has no curves since the algebraic dimension is zero. Thus in this\ncase we can just set Smin = S ′ .\nIf S ′ is a K3 surface, we proceed as follows: let D be an effective divisor on S ′ .\nSince the algebraic dimension is zero, we have h0 (S ′ , D) = 1 and h2 (S ′ , D) = 0 by\nSerre duality, so the Riemann-Roch formula yields\n1\n−h1 (S ′ , D) = D2 + 1.\n2\nIn particular we have D2 ≤ 2. On the other hand by the adjunction formula\n2pa (D) − 2 = D2 , so the non-negativity of the arithmetic genus pa (D) implies\nthat D2 = −2. If we apply this to effective reduced divisors D with one, two and\nthree irreducible components, we see that every irreducible curve is smooth and\n8\n\n\fisomorphic to P1 , two curves are disjoint or meet transversally in exactly one point\nand three curves never meet in the same point. Thus by [BHPVdV04, Lemma 2.12]\nthe configuration of curves are of type A-D-E. Since there are only finitely many\ndivisors on S [FF79, Thm.], we can contract all the divisors by Grauert's criterion\nand obtain a normal surface Smin with at most rational double points.\nIf S is singular we apply the first step to some desingularisation: thus there exists\na meromorphic map μ : S 99K Smin . Let Γ ⊂ S × Smin be the graph of the map,\nthen the projection Γ → S is bimeromorphic and has connected fibres by Zariski's\nlemma. Yet any positive-dimensional fibre would be a curve in Smin , so Γ ≃ S and\nμ extends to an isomorphism.\nSince any effective divisor on S is contracted by μ to a point, the last statement is\nimmediate from the easy direction of Grauert's criterion.\n\u0003\n2.19. Corollary. In the situation of the Lemma 2.18, set S0 := Smin \\ {p1 , . . . , pr }\nand let μ0 : S0′ → S0 be an étale morphism. Then μ0 extends to a finite map\nμ : S ′ → Smin .\nProof. It is sufficient to show that we can extend μ0 locally. Yet by the lemma, the\nsurface Smin has at most rational double points and these are quotient singularities\nof the form D2 /G where G is a finite group. Thus if we take an étale cover of\nD2 \\ (0, 0)/G, we can lift it to the universal cover D2 \\ (0, 0) and extend by the\ninclusion D2 \\ (0, 0) → D2 .\n\u0003\nSince a smooth K3 surface is simply connected, it does not admit a (necessarily\nétale) endomorphism of degree at least two. This is no longer true for the singular\nK3 surface Smin .\n2.20. Example. Let A be a two-dimensional torus of algebraic dimension zero\nand let S be the corresponding Kummer surface. It is not hard to see that the\nKummer quotient A/Z2 is the surface Smin . The multiplication by n ∈ N gives an\nendomorphism of degree n4 of the torus A which descends to an endomorphism of\nA/Z2 of degree at least two.\nThe following proposition shows that the example is essentially everything that can\nhappen.\n2.21. Proposition. Let S be a singular K3 surface of algebraic dimension zero,\nand let f : S → S be an endomorphism of degree d > 1. Then there exists a Galois\ncovering ν : A → S by a torus that is étale in codimension one such that f lifts to\nan endomorphism fA : A → A of degree d.\nThe proof is essentially a reproduction of the arguments used in [Nak08] for the\nalgebraic case. For the reader's convenience, we give the basic ideas:\nProof. By Lemma 2.18, the surface S has only rational double points, so it is\nGorenstein and has only isolated quotient singularities. Since S contains no curves,\nthe endomorphism f is necessarily étale in codimension one. Thus by [Nak08,\nLemma 3.3.2] there exists a finite Galois covering ν : A → S that is étale in\ncodimension one such that A is smooth and e(A) = 0. Moreover κ(A) ≥ 0 and\nA has algebraic dimension zero, so it is a torus by the classification of compact\n9\n\n\fcomplex surfaces. Replacing the covering ν by a suitable one, we may suppose that\ndeg ν ≤ deg ν ′ for every Galois covering ν ′ : A′ → S by a torus A′ that is étale\nin codimension one. Arguing as in [NZ07, Lemma 2.6], one sees that such a ν is\nunique up to an isomorphism over S. Let W be the normalisation of an irreducible\ncomponent of the fibre product A×S S such that the natural morphisms f ′ : W → A\nand ν ′ : W → S are surjective. Then we have a commutative diagram\nW\n\nν′\n\n/S\n\nf′\n\n\u000f\nA\n\nf\nν\n\n\u000f\n/S\n\nand f ′ is étale in codimension one. The variety A being smooth the map f ′ is étale,\nso W is a torus. By construction, we have deg ν ′ ≤ deg ν so the minimality of ν\nimplies that there exists an isomorphism ψ : A → W such that ν ′ ◦ ψ = ν. The\nmorphism fA := f ′ ◦ ψ has the stated properties.\n\u0003\nWe would like to thank C. Favre for suggesting to us the proof of the next statement.\n2.22. Proposition. Let S be a compact Kähler surface that admits a relatively\nminimal elliptic fibration φ : S → C ≃ P1 . Suppose that S admits a meromorphic\nendomorphism f : S 99K S of degree d > 1 such that there exists an endomorphism\ng : C → C of degree at least two such that g ◦ φ = φ ◦ f . Then S is algebraic.\nProof. We argue by contradiction and suppose that S has algebraic dimension one.\nSince g has degree at least two, there are infinitely many φ-fibres that are isomorphic\nelliptic curves. Since the j-invariant yields a holomorphic map j : C → P1 , it must\nbe constant. Thus all the smooth fibres are isomorphic and a look at the local\nbehaviour of the j-invariant near the singular fibres [BHPVdV04, V.10,Table 6]\nshows that the singular fibres are multiple elliptic curves. Since S contains no\ncurve that maps onto C, this implies that S contains no rational curves. Thus the\nmeromorphic endomorphism extends to a holomorphic endomorphism f : S → S\nof degree d > 1. Since g is an endomorphism of P1 it is ramified, so f is ramified.\nThus S is uniruled by [AKP08, Thm.4.1], a contradiction.\n\u0003\nWe will need the following generalisation of [AKP08, Thm.4.1] for singular surfaces.\n2.23. Lemma. Let X be a compact Kähler threefold, and let f : X → X be an\nendomorphism of degree d > 1. Let D ⊂ X be an irreducible divisor such that\nf −1 (D) = D and such that fD : D → D has degree at least two. If fD is ramified,\nthe surface D is uniruled.\nProof. We claim that the canonical divisor KD is not pseudoeffective. Assuming\nthis for the time being, let us show how to conclude: let ν : D̃ → D be the\nnormalisation, then\nKD̃ = ν ∗ KD − N\nwhere N is an effective divisor. Let π : D′ → D̃ be the minimal resolution, then\nKD′ = π ∗ KD̃ − N ′\n\nwhere N ′ is an effective divisor. Thus\n\nKD ′ = π ∗ ν ∗ KD − N ′ − π ∗ N\n10\n\n\fis not pseudoeffective, since KD is not pseudoeffective. Since D′ is a compact\nKähler surface, this implies that D′ is uniruled.\nProof of the claim: We start by establishing a ramification formula on D. Since\nf −1 (D) = D, we have f ∗ D = mD where m ∈ N is the order of ramification along\nD. Thus the ramification divisor R of f is of the form\nR = (m − 1)D + R′\n′\nwhere R′ does not contain D. Since fD is ramified, the restriction RD\n:= R′ ∩ D is\nan effective, non-trivial Cartier divisor. By the ramification formula on X we have\nKX = f ∗ KX + R, so the adjunction formula KD = KX |D + DD implies\n′\n∗\n∗\nK D − DD = fD\n(KD − D) + RD = fD\nKD − mDD + (m − 1)DD + RD\n,\n\nso\n∗\n′\nKD = fD\nKD + RD\n.\n\nWe proceed now as in the proof of [AKP08, Thm.4.1]: let fm be the m-th iterate\nof f , then the ramification formula reads\n′\n′\n′\n∗\n∗\n+ RD\n.\n+ . . . + f ∗ RD\nKD = fm\nKD + fm−1\nRD\n\nLet ωD be the restriction of a Kähler form ω to D. There exists a c > 0 such\nthat for every pseudoeffective line bundle L on D, we have L * ω > c. If KD is\n∗\nKD * ω ≥ 0, so\npseudoeffective, then fm\nKD * ω ≥ mc\nfor arbitrary m which is impossible.\n\n\u0003\n\n2.24. Lemma. Let S be a complex Gorenstein surface, i.e. the canonical sheaf\nexists and is locally free. Let f : S → S be an endomorphism such that KS ≃ f ∗ KS .\nLet ν : S̃ → S be the normalisation, and denote by N the effective Weil divisor on\nS̃ such that KS̃ = ν ∗ KS − N . There exists an endomorphism f ̃ : S̃ → S̃ such that\nν ◦ f ̃ = f ◦ ν. Furthermore we have f ̃−1 (N ) = N and f ̃ is étale in codimension one\nin the complement of N .\nProof. The existence of f ̃ is immediate by the universal property of the normalisation.\nFor the second statement, note that we have an equality of Weil divisors\nf ̃∗ (KS̃ + N ) = f ̃∗ ν ∗ KS = ν ∗ fS∗ KS = KS̃ + N.\nSince by the ramification formula for normal surfaces we also have an equality of\nWeil divisors\nKs̃ = f ̃∗ K + R,\nS̃\n\nwhere R is the ramification divisor, we get an equality of Weil divisors\nR = f ∗ N − N,\nso N is a completely invariant divisor of fD̃ and fD̃ is étale outside N .\n11\n\n\u0003\n\n\f3. Compact Kähler threefolds\n3.A. Algebraic connectedness.\n3.1. Definition. Let X be a compact Kähler manifold. X is called algebraically\nconnected if there exists a family of curves (Ct )t∈T such that Ct is irreducible for\ngeneral t ∈ T and such that two very general points can be joined by a chain of\nCt 's.\nThe following theorem of Campana illustrates the importance of this notion.\n3.2. Theorem. [Cam81] An algebraically connected compact Kähler manifold is\nprojective.\nAn immediate consequence of this theorem is that if X is a compact Kähler threefold\nof algebraic dimension two, then the algebraic reduction of X is almost holomorphic.\nIf the algebraic dimension is one, this no longer holds in general, but only in special\ncases:\n3.3. Corollary. Let X be a compact Kähler non-algebraic threefold. Let φ : X 99K\nC be a meromorphic map onto a curve such that the general fibre is an algebraic\nsurface. Then φ is holomorphic.\nIndeed the fibres of φ are algebraically connected and cover X. Thus they can't\nmeet since otherwise X is algebraically connected. This shows that φ is almost\nholomorphic, but an almost holomorphic map onto a curve is holomorphic.\nThe existence of an endomorphism of degree at least two allows us to assure the\nholomorphicity of the algebraic reduction in another situation.\n3.4. Proposition. Let X be a compact non-algebraic Kähler threefold of algebraic\ndimension one, and let f : X → X be an endomorphism of degree d > 1. Suppose\nthat the general fibre of the algebraic reduction is a compact Kähler surface of\nalgebraic dimension zero. Then the algebraic reduction of X is holomorphic.\nProof. Let μ : X ′ → X be a bimeromorphic map such that φ : X ′ → C is a\nholomorphic model of the algebraic reduction. The endomorphism f induces a\nmeromorphic endomorphism f ′ : X ′ 99K X ′ . By Proposition 2.12 there exists an\nendomorphism g : C → C such that g ◦ φ = φ ◦ f ′ . Since the general φ-fibre F is\nirreducible, we have f ′−1 (F ) = F1 ∪. . . Fδ , where δ is the degree of g. For simplicity\ndenote by F also the image of a general fibre under the birational map μ. Since\nf −1 (F ) has δ irreducible components and F does not lie in the branch locus of f ,\nwe see that f ∗ [F ] ≡num δ[F ]. Thus Lemma 2.3 shows that F 3 = 0 or d = δ 3 .\n\n1st case. Suppose that F 3 = 0. We want to prove that if F ′ is another general\nmember of the family, then F ∩ F ′ = ∅. Indeed if this is not the case, there exists a\nnontrivial effective Cartier divisor F ′ ∩F on F such that (FF′ )2 = 0, a contradiction\nto Lemma 2.18. Since F and F ′ are irreducible and homologous, this implies that\n[F ]2 = 0. Thus a general F does not meet any member of the family. Hence the\nalgebraic reduction of X is almost holomorphic onto a curve, so it is holomorphic.\n√\n2nd case. Suppose that F 3 6= 0. In this case we have δ = 3 d. By [CP00,\nCor.7.6.(ii)], the general φ-fibres are isomorphic. Thus we can consider the induced map f |F1 : F1 → F as an endomorphism fF : F → F of degree δ 2 > 1. Since\n12\n\n\fF 3 6= 0, the intersection F ∩ F ′ with another general member is not trivial. The\nsurface F has only finitely many divisors [FF79, Thm.], so we may suppose that\nfF−1 (F ∩ F ′ ) = F ∩ F ′ . Yet F is not uniruled, so the endomorphism fF is not ramified by Lemma 2.23. Another application of Lemma 2.3 shows that [F ∩ F ′ ]2 = 0.\nNow [F ∩ F ′ ]2 = F * F ′ * F ′ = F 3 gives a contradiction.\n\u0003\n3.B. Mori program for compact Kähler threefolds. Let X be a compact\nKähler manifold. A contraction is defined to be a surjective map with connected\nfibres φ : X → X ′ onto a normal complex variety such that −KX is relatively ample\nand b2 (X) = b2 (X ′ ) + 1. In general X ′ might not be a Kähler variety, in particular\nφ is not necessarily a contraction of an extremal ray in the cone N E(X). The\nexistence and structure of threefold contractions is assured by following statement.\n3.5. Theorem. [Pet01, Thm.2], [Pet98, Main Thm.] Let X be a smooth compact\nKähler threefold with KX not nef. Then X carries a contraction φ : X → X ′ unless\n(possibly) X is simple with κ(X) = −∞. The contraction is of one of the following\ntypes.\n1.) φ is a P1 - bundle or a conic bundle over a smooth non-algebraic surface,\n2.) φ is bimeromorphic contracting an irreducible divisor E to a point, and E\ntogether with its normal bundle NE/X is one of the following\n(P2 , OP2 (−1)), (P2 , OP2 (−2)), (P1 × P1 , OP1 ×P1 (−1, −1)), (Q0 , OQ0 (−1)),\n\nwhere Q0 is the quadric cone,\n3.) X ′ is smooth and φ is the blow-up of X ′ along a smooth curve.\n\nThe variety X ′ is (a possibly singular) Kähler space in all cases except possibly\n3.). Moreover in all cases but possibly 3.), the morphism φ is the contraction of an\nextremal ray in the cone N E(X).\nIn case 3.), the variety X ′ is Kähler if and only if the ray of a fiber l of φ is extremal\nin the dual Kähler cone N A(X).\nThe main defect of the preceding statement (and the main open problem in the\nMori of compact Kähler threefolds) is that in general it is not clear whether X ′ is\nKähler. We give an affirmative answer in a number of situations. First we need\nsome preparation.\n3.6. Lemma. Let ψ : X → X ′ be the blow-up of a smooth curve B ⊂ X ′ in\nthe compact manifold X ′ . Assume X is Kähler. Then X ′ is Kähler provided the\nfollowing condition (*) is satisfied.\nIf T is a positive closed current of bidimension (1, 1) such that T = dS with some\ncurrent S, then T = 0.\nProof. Let b ∈ B and l = ψ −1 (b). By Theorem 3.5 we need to show that [l] is\nextremal in the dual Kähler cone N A(X). So suppose that\n[l] = a1 + a2\nwith ai ∈ N A(X) \\ 0. Now represent ai by a positive closed current Ti (see e.g.\n[OP04, Prop.1.8], which is a consequence of the work of Demailly-Paun [DP04]).\nSo\nl ∼ T1 + T2 ,\n13\n\n\fand therefore\nψ∗ (T1 ) + ψ(T2 ) ∼ 0.\n\nBy our assumption we obtain ψ∗ (T1 ) + ψ∗ (T2 ) = 0, so that ψ∗ (T1 ) = ψ∗ (T2 ) = 0.\nTherefore the ai are proportional to [l] and [l] is extremal.\n\u0003\nIn the following corollary, χB denotes the characteristic function of B and TB is\nthe current given by integration over B.\n3.7. Corollary. Let ψ : X → X ′ be the blow-up of a smooth curve B ⊂ X ′ in\nthe compact manifold X ′ , and denote by E the exceptional divisor. Assume X is\nKähler. Then X ′ is Kähler if one of the following assertions holds.\n1.) There is no positive closed current λTB + T ′ with λ > 0 and χE T ′ = 0\nwhich is a boundary dS.\n2.) A multiple of B moves in a positive-dimensional family.\n3.) The normal bundle NB/X ′ is not negative.\nProof. (1) By [Siu74], see also [Dem01] we have a decomposition\nT = λTB + T ′\nwith T ′ = χX\\B T and some λ ≥ 0. In particular T ′ is again closed. Since we assume\nthat (*) already holds for all T for which λ > 0, we may assume that λ = 0 and\nneed to verify (*) for those T. By the proof of 3.6 we need to check that only for\nthe current ψ∗ (T1 + T2 ). But for those currents λ = 0 can actually never happen: if\nχB ψ∗ (T1 + T2 ) = 0,\nthen\nχE (T1 + T2 ) = 0,\n−1\n\nwhere E = ψ (B). Thus Tl ∼ T with χE T = 0. Now l * E = −1; on the other hand\nχE T = 0 implies via Demailly's regularization theorem that E * [T ] ≥ 0 [Pet98,\nSublemma 7.a].\n(2) By (1) it suffices to show the following. If λTB + T ′ = dS with T ′ a positive\nclosed current such that χB T ′ = 0 and λ ≥ 0, then λ = 0. So assume TB + T ′ = dS.\nNow a multiple of B moves, so we obtain an irreducible curve B ′ 6= B and a > 0\nsuch that aTB ′ + T ′ = dS ′ . But χX ′ \\B (aTB ′ + T ′ ) = 0, so the arguments of (1)\nshow that a = 0 and T ′ = 0.\n(3) Suppose that the normal bundle NB/X ′ is not negative. If X ′ were not Kähler,\nthen by 3.7, we find a positive closed current T with χB T = 0 such that\nB + T = dS.\nWe find easily a positive closed current T̃ on X such that χE T̃ = 0 and such that\nψ∗ (T̃ ) ∼ T (sse the proof of Prop. 2.1 in [OP04]). Now choose a positive closed\ncurrent B0 on E representing the second ray of N E(E) (i.e. the one not represented\nby the ruling line l). Let R = i∗ (B0 ) where i : E → X is the inclusion. Then up to\nscaling ψ∗ (R) = B and therefore\nR + T̃ ∼ al\n14\n\n\ffor some a > 0. Intersecting with E and observing T̃ * E = 0 as in the proof of\n3.7 we obtain B0 * E < 0 so that the normal bundle NE/X is negative and so does\nNB/X ′ .\n\u0003\nWe can now prove that the study of compact Kähler threefolds with endomorphisms\ncan be reduced to minimal models, at least if X is not uniruled.\n3.8. Proposition. Let X be a compact Kähler threefold which is not uniruled, and\nlet f : X → X be a (necessarily étale) endomorphism of degree d > 1. Then there\nexists a finite sequence of smooth compact Kähler threefolds\nμ2\n\nμ=μ1\n\nμn\n\nX = X0 −→ X1 −→ . . . −→ Xn\nsuch that\n• the canonical bundle of Xn is nef;\n• for all i ∈ {1, . . . , n}, the manifold Xi−1 is the blow-up of Xi along a smooth\nelliptic curve Ci ⊂ Xi such that the normal bundle is an indecomposable\nrank two vector bundle of degree zero or a direct sum of numerically trivial\nline bundles;\n• up to replacing f =: f0 by f k for some k ∈ N, there exist endomorphisms\nfi : Xi → Xi of degree d such that fi ◦ μi = μi ◦ fi−1 for all i ∈ {1, . . . , n}.\nThe curve Ci is invariant under fi , i.e. we have fi−1 (Ci ) = Ci .\nProof. We will use Theorem 3.5: note first that the case where X is simple with\nκ(X) = −∞ can be easily excluded in our situations: since f is étale by Proposition\n2.4 we have χ(X, OX ) = 0 which implies that h0 (X, KX ) ≥ 1 or h0 (X, ΩX ) ≥ 1.\nIn the first case we are obviously done and in the second case we can look at the\nAlbanese map X → Alb(X) and conclude that κ(X) ≥ 0 by the Cn,m -conjecture\n(which is known for compact Kähler threefolds [Uen87, Thm.2.2, Thm.4.1]).\nThus there exists a m ∈ N such that |mKX | is not empty. Let D be the fixed\npart of this linear system, then f ∗ KX ≃ KX implies that f ∗ D ≃ D. Since all the\ncontractions are divisorial by Theorem 3.5, their exceptional loci are contained in\nD. Since D has only finitely many components, the description of the exceptional\nloci implies that there are only finitely many contractions. The endomorphism f\npermutes the irreducible components of D, so up to replacing f by f k we may\nsuppose that f −1 (E) = E for the support E of every birational contraction.\nChoose now a birational contraction μ : X → X1 with exceptional divisor E. By\nLemma 2.3 we have E 3 = 0, so the description of the normal bundles in Theorem\n3.5 shows that E is contracted onto a smooth curve C1 and X1 is a smooth complex\nmanifold. The restriction of f to E ≃ P(NC∗ 1 /X1 ) yields an étale endomorphism\nf : E → E of degree d, so [Nak08, Thm.1.1.] shows that C1 is elliptic and NC∗ 1 /X1\nhas the prescribed form, at least up to twist by a line bundle. Since\nc1 (NC∗ 1 /X1 ) = OP(NC∗\n\n1 /X1\n\n2\n) (−1)\n\n= E 3 = 0,\n\nwe see that such a line bundle is numerically trivial. This completes the description\nof the normal bundle of C1 . Corollary 3.7 now implies that X1 is a Kähler manifold.\nBy [AKP08, Rem.3.3,Cor.3.4] there exists a k1 ∈ N and an an endomorphism\nf1 : X1 → X1 of degree d such that f1 ◦ μ1 = μ1 ◦ f .\n15\n\n\fHence X1 satisfies all the assumption made on X and we can argue by induction on the Picard number to get the existence of the sequence satisfying the first\ntwo properties. Replacing the ki by a sufficiently divisible k, we obtain the third\nstatement.\n\u0003\nIf X is uniruled the situation gets more complicated. One reason is that the exceptional divisor of a birational contraction can lie in the branch locus of f . If this is\nnot the case, we can again use Lemma 2.3, Theorem 3.5 and Corollary 3.7 to show\nthe next statement.\n3.9. Corollary. Let X be a compact Kähler threefold, and let f : X → X be an\nendomorphism of degree d > 1. Let ψ : X → X ′ be a contraction of birational type\nsuch that the exceptional divisor E satisfies f −1 (E) = E. Suppose that E is √\nnot\ncontained in the branch locus of f or that the ramification order along E is not 3 d.\nThen E 3 = 0 and ψ contracts the divisor E onto a smooth curve C ′ . Moreover the\nvariety X ′ is a compact Kähler threefold.\nRemark. If the endomorphism f is étale one proves as above that the curve C ′ is\nelliptic. If f is ramified, C ′ can a-priori be arbitrary.\n3.10. Proposition. Let X be a compact non-algebraic Kähler threefold, and let\nf : X → X be an endomorphism of degree d > 1. Suppose that there exists a\nfibration φ : X → C onto a smooth curve C with algebraic general fiber and an\nautomorphism g : C → C such that g ◦ φ = φ ◦ f .\nSuppose that X admits a birational contraction ψ : X → X ′ . Then\n•\n•\n•\n•\n\nthe exceptional locus E is contained in a φ-fibre,\nthere exists a fibration φ′ : X ′ → C such that φ = φ′ ◦ ψ,\nψ is the blow-up of a smooth curve B in X ′ ,\nthere exists an endomorphism f ′ : X ′ → X ′ of degree d such that f ′ ◦ ψ =\nψ ◦ f , and\n• X ′ is a compact Kähler threefold unless possibly when the curve B has\nnegative normal bundle.\n\nIf φ is locally projective, there exists a possibly different contraction ψ ′ : X → X ∗\nwith locally projective factorization X ∗ → C.\nProof. By the classification in Theorem 3.5, the exceptional loci of birational contractions are uniruled surfaces and therefore algebraic. Therefore E is contained in\na φ-fibre, since otherwise X is algebraically connected, hence algebraic by Theorem 3.2. The existence of the fibration φ′ is now an immediate consequence of the\nrigidity lemma.\nSince E is contained in a fibre, it is not contained in the branch locus by Lemma\n2.15. Therefore Corollary 3.9 shows that E is contracted onto a smooth curve and\nX ′ is smooth. By what precedes we know that the exceptional loci of birational\ncontractions on X are irreducible components of φ-fibres. Since there are only\nfinitely many reducible fibres and these have finitely many components, we see that\nthere are only finitely many birational contractions. Thus up to replacing f by f k\nwe have f∗ [Γ] = λ[Γ], where Γ is a fibre of E → ψ(E). We conclude as in [AKP08,\nCor.3.4], the Kähler property follows from Corollary 3.7.\n16\n\n\fThus we are left with the last assertion. Let\n{x1 , . . . , xs } ⊂ C\nbe the singular locus of φ. Choose small disjoint open neighborhoods Ui of xi\nsuch that φ is projective over Ui . Let Xi = φ−1 (Ui ) and φi = φ|Xi . We already\nknow that there exists some i such that KX is not φi −nef. Hence by [Nak87] there\nexists a relative contraction μ : Xi → Xi′ such that the induced map Xi′ → Ui is\nprojective. Now μ might be birational or not. We always choose μ birational unless\nit is simply not possible, i.e. for all choice of i, the map μ is a fibration. In case μ is\nbirational we patch things and obtain X ∗ with a locally projective bimeromorphic\nmap φ′ : X ∗ → C. The map μ extends to ψ : X → X ∗ .\nIn case μ is a fibration, we obtain by deformation of the extremal rational curves\nand by our assumption a global relative contraction which is a P1 −bundle or a\nconic bundle X → X ∗ with factorization X ∗ → C.\n\u0003\nFinally let us recall that abundance holds for most minimal Kähler threefolds.\n3.11. Theorem. [Pet01, Thm.1] Let X be a normal compact Kähler threefold\n(Q−factorial with at most terminal singularities) such that KX is nef. Assume\nthat X is not both simple and non-Kummer. Then KX is semi-ample.\n4. Torus fibrations\n4.1. Definition. A torus fibration is a fibration φ : X → Y such that the general\nfibre is isomorphic to a complex torus. A torus bundle is a smooth torus fibration\nthat is locally trivial.\nIf the total space of a torus fibration is not projective, the fibration in general does\nnot admit a multisection, i.e. there is no subvariety Z ⊂ X such that φ|Z : Z → Y\nis surjective and generically finite. The main technical statement of this section\n(Lemma 4.2) shows that if X admits an endomorphism commuting with φ, then\nthere exists a natural meromorphic factorisation of φ which admits a multisection.\n4.2. Lemma. Let X be a compact normal variety in the Fujiki class that admits a\ntorus fibration φ : X → Y . Suppose furthermore that there exists an endomorphism\nf : X → X of degree d > 1 and an automorphism g : Y → Y of finite order such\nthat g ◦ φ = φ ◦ f . Then (up to replacing f by some power) there exists a compact\nnormal variety Z that is in the Fujiki class and admits a torus fibration ψ : Z → Y\nwith a multisection and which satisfies the following properties:\n• there exists an almost holomorphic fibration τ : X 99K Z such that φ = ψ◦τ .\n• there exists an endomorphism f : Z → Z of degree d that commutes with ψ\nand such that f ◦ τ = τ ◦ f .\nIf a very general fibre of φ is a simple torus, then φ admits a multisection.\nThe proof of this lemma is based on the following easy observation. The statement\ngeneralises [FN07, Lemma 2.22] whose strategy of proof we follow.\n17\n\n\f4.3. Proposition. Let A be a complex torus, and let f : A → A be an endomorphism of degree d > 1. Then there exists a (maybe trivial) subtorus T ( A and an\nendomorphism f : A/T → A/T of degree d such that the set of fixed points of f is\nnon-empty and finite.\nIn particular if A is simple, the set of fixed points of f is non-empty and finite.\nProof of Proposition 4.3. We will argue by induction on the dimension, the case of\ndimension one is included in [FN07, Lemma 2.22]. Choose a point 0 ∈ A so that\nthe torus A has a group structure. The map\nh : A → A, x 7→ f (x) − f (0) − x\n\nis a morphism of groups and not zero, since f has degree at least two. Let T0 be\nthe connected component of the kernel of h. We make a case distinction.\n1st case. T0 is trivial In this case h is surjective and has finite kernel. Since\n{x ∈ A | f (x) = x} = {x ∈ A | h(x) = f (0)}\n\nthe statement follows.\n\n2nd case. T0 has positive dimension. Since h(x) = 0 for all x ∈ T0 , we have\nf (x) = x + f (0) for all x ∈ T0 . It is thus clear that there exists an endomorphism\nf : A/T0 → A/T0 of degree d such that f ◦ q = q ◦ f , where q : A → A/T0 is the\nquotient map. Apply the induction hypothesis to A/T0 .\n\u0003\n4.4. Example. At first glance the proof of Proposition 4.3 may suggest that the\nrestriction of the endomorphism f to T is a translation. The endomorphism of\ndegree n\nf : E × E × E → E × E × E, (x1 , x2 , x3 ) 7→ (x1 + x2 + x3 , x2 + x3 , nx3 )\n\nshows that this is not true, since we will have T = E × E × {0}. The restriction of\nf to T is rather a \"tower\" of translations.\nProof of Lemma 4.2. The automorphism g : Y → Y is assumed to be of finite\norder, so up to replacing f by some multiple we can suppose that g = IdY . The\nstatement claims that there exists a commutative diagram\n/X\nX✵\nf′\n✵✵\n✍\nτ\n✵✵ τ\n✍✍\n✍\n✵✵\n✍\n~\n✵ Z f / Z ✍✍✍φ\nφ ✵\n✵✵\n✍\n✵✵ ψ\n✍✍\nψ✍\n✵\u0017 \u000f\n\u000f \u0007✍✍\nIdY\n/Y\nY\nsuch that f has degree d and Z → Y has a multisection.\n\nWe denote by fy : Xy → Xy the restriction of f to a general fibre Xy : this is an\nendomorphism of degree d. If the fix point set of fy is finite, the fix point set of f is\na multisection of φ, thus the statement is trivially true. Note that if Xy is simple,\nwe are always in this case, which proves the last part of the statement.\nSuppose now that the fix point set of fy is not finite. Then there exists by Proposition 4.3 a torus Ty ⊂ Xy and an endomorphism f y : Xy /Ty → Xy /Ty of degree\n18\n\n\fd that commutes with the projection Xy → Xy /Ty and has non-empty finite fix\npoint set. The countability of the number of irreducible components of the relative\ncycle space C(X/C) implies that if we choose y very general, the torus Ty deforms\nwith Xy . Let Z → Y be the normalisation of the component of C(X/Y ) whose\nvery general points corresponds to the translates of Ty for y ∈ Y very general. The\nalmost holomorphic map τ : X 99K Z such that φ = ψ ◦ τ is given fibrewise by\nXy → Xy /Ty .\nThe (necessarily étale) endomorphism f acts via the push-forward of cycles on\nC(X/Y ). Noting that the general fibre of Z → Y is the quotient torus Xy /Ty and\nthe restriction of f∗ to Xy /Ty identifies to f y , we see that f∗ maps the component\ncorresponding to Z onto itself. Thus we obtain a holomorphic endomorphism f :\nZ → Z of degree d that commutes with ψ. The restriction of f to a very general\nfibre Zy has non-empty finite fix point set, so the fix point set of f is a multisection\nof ψ. By construction of f , it is clear that f ◦ τ = τ ◦ f .\n\u0003\nTheorem 1.1 is now an immediate application:\nProof of Theorem 1.1. We argue by contradiction and suppose that X is not projective. Since a(X) ≥ κ(X) = n − 1, we see that the algebraic dimension is n − 1.\nBy Campana's theorem 3.2 this implies that the algebraic reduction φ : X 99K Y\nis almost holomorphic. Since κ(X) = n − 1 it is bimeromorphicly equivalent to the\nIitaka fibration. By [NZ07, Thm. A] the endomorphism f induces an automorphism g : Y → Y of finite order. Thus Lemma 4.2 implies that X → Y admits a\nmultisection. Since Y is projective and Xy a curve, X is algebraically connected.\nHence it is projective by Campana's theorem, a contradiction.\n\u0003\n4.5. Corollary. Let X be a compact Kähler manifold that is a torus bundle φ :\nX → Y with fibre A. Suppose furthermore that there exists an endomorphism\nf : X → X of degree d > 1 and an automorphism g : Y → Y of finite order\nsuch that g ◦ φ = φ ◦ f . Then (up to replacing f by some power) there exists a\ncompact Kähler manifold Z that is a torus bundle ψ : Z → Y with fibre A/T with\na multisection and satisfies the following properties:\n• X is a torus bundle τ : X → Z with fibre T such that φ = ψ ◦ τ .\n• There exists an endomorphism f : Z → Z of degree d that commutes with\nψ and such that f ◦ τ = τ ◦ f .\n• The multisection is given by F ix(f ) which is an étale cover of Y .\nIf A is simple, then φ admits an étale multisection.\nProof. The proof of the first two points is the same as for Lemma 4.2, with one\ndifference: since X → Y is a bundle, it is clear that for very general y the torus\nTy ⊂ A does not depend on y ∈ Y . Thus the variety Z can be directly defined as\nthe quotient bundle Z → Y with fibre A/T .\nThe étaleness of F ix(f ) → Y is shown by copying word by word the proof of [FN07,\nThm.2.24].\n\u0003\n19\n\n\fLet now X be a complex torus that contains a proper subtorus T ( X. Then X\nis naturally a torus bundle over X/T with fibre T and if X is projective Poincaré's\nirreducibility lemma shows that it is isogenous to X/T × T . In particular the study\nof endomorphisms of X is reduced to X/T × T . If X is not projective the situation\nis more complicated, but the geometric intuition still says that if X → X/T admits\nan \"interesting\" endomorphism, the torus X should be close to being a product.\nWe illustrate this philosophy in two special cases:\n4.6. Proposition. Let X be a torus that is a torus bundle φ : X → Y over a\ntorus Y with fibre A. Suppose that dim Y = 1 or dim Y = 2, a(Y ) = 1. Suppose\nthat X admits an endomorphism f : X → X of degree d > 1 such that there exists\nan automorphism g : Y → Y such that g ◦ φ = φ ◦ f . Then there exists a (maybe\ntrivial) subtorus T ( A such that X is isogenous to a torus bundle over E × A/T .\nIn particular if A simple, then X is isogenous to Y × A.\nProof. Choose a point 0 ∈ X so that the tori X, Y and A have a group structure.\nUp to composing f with the translation x → x−f (0), we can suppose that f (0) = 0.\nThus the automorphism g satisfies g(0) = 0, i.e. is a group automorphism of Y .\nSince Y is a curve or a surface of algebraic dimension one, this group is finite (cf.\n[Fuj88, Prop.3.10] for the surface case), so g is of finite order. By Corollary 4.5,\nthere exists a quotient X → X/T → Y such that f descends to an endomorphism f\non X/T . Moreover the covering F ix(f ) → Y is étale, so an irreducible component\nof F ix(f ) is a complement to A/T in X/T . The statement follows by [BL99,\nProp.6.1].\n\u0003\n4.7. Proposition. Let X be a torus that is a torus bundle φ : X → Y over a torus\nY with fibre A. Suppose that End(A) ≃ Z or dim A = 1. Suppose that X admits an\nendomorphism f : X → X of degree d > 1 such that there exists an automorphism\ng : Y → Y such that g ◦ φ = φ ◦ f . Then X is decomposable.\nProof. We prove the statement in the case where End(A) ≃ Z (the same strategy\nworks if A is an elliptic curve with complex multiplication, cf. the proof of [Fuj88,\nProp.3.10]). We argue by contradiction and suppose that X is indecomposable.\nSince End(A) ≃ Z, the restriction of f to A is the multiplication by an integer n\nsuch that ndim A = d. Thus f − n is an endomorphism of X whose restriction to\nA is constant, in particular f − n is not an isogeny. Thus by [BL99, Prop.7.3], the\nendomorphism f − n is nilpotent. Hence the induced endomorphism g − n on Y is\nnilpotent, so its kernel has positive dimension. Thus there exists a positive dimensional subtorus T ⊂ Y such that the restriction of g to T equals the multiplication\nby n. In particular g|T is not injective, so g is not an automorphism.\n\u0003\nCombining Proposition 4.3 with Proposition 4.7, we obtain:\n4.8. Corollary. Let A be a two-dimensional torus of algebraic dimension one, and\nlet f : A → A be an endomorphism of degree d > 1. Then f has a non-empty finite\nset of fixed points.\n20\n\n\f5. Non-uniruled manifolds\nIn this section we prove Theorem 1.2. Using the minimal model program for nonuniruled threefolds admitting endomorphisms established in Proposition 3.8 the\nproof naturally splits into two parts: the first and most difficult part is to classify\nthe minimal models admitting endomorphisms (Theorem 5.1 below). Based on the\nrather short list obtained in the first step, we then discuss the structure of the\nblow-ups in Subsection 5.B.\n5.A. Minimal models.\n5.1. Theorem. Let X be a smooth compact non-algebraic Kähler threefold which\nis not uniruled. Suppose that X admits a (necessarily étale) endomorphism f :\nX → X of degree d > 1. If KX is nef, then (up to étale cover) one of the following\nholds:\n1.) κ(X) = 0 : then either\na) X is a torus or\nb) X is a product S × E where S is a non-algebraic K3 surface and E an\nelliptic curve.\n2.) κ(X) = a(X) = 1 : then X is a product C × A where C is a curve of general\ntype and A a torus of algebraic dimension zero.\n3.) κ(X) = 1, a(X) = 2 : then either\na) X is a product Y × A where Y is of general type and A a torus of\nalgebraic dimension one or\nb) X is a product E × S where E is an elliptic curve and and S a nonalgebraic Kähler surface of Kodaira dimension one.\nProof. By Theorem 1.1 we have κ(X) ≤ 1, and by Theorem 3.11 the canonical\nbundle is semi-ample.\nIf κ(X) = 0 this implies mKX = OX for some m > 0. By the Beauville-Bogomolov\ndecomposition theorem X admits a finite étale cover by a torus, or a product of an\nelliptic curve and a K3 surface, or a Calabi-Yau manifold of dimension three. The\nlast case is excluded since a Calabi-Yau manifold is simply connected.\nThus we are reduced to study the cases κ(X) = 1. These are dealt with in the\nTheorems 5.3, and 5.4.\n\u0003\n5.2. Lemma. Let X be a non-algebraic compact Kähler manifold of dimension n,\nand let f : X → X be an endomorphism of degree d > 1. Suppose that X admits\na fibration φ : X → Y onto a projective variety Y such that φ ◦ f = φ and the\ngeneral fibre Xy has Kodaira dimension zero. Then the general fibre Xy is (up to\nétale cover) a two-dimensional torus.\n1.) If a(X) = n−2, the fibre Xy has algebraic dimension zero and is isomorphic\nto fixed torus A.\n2.) If a(X) = n − 1 and a(Xy ) = 1, the fibre Xy is isomorphic to fixed torus A.\n3.) If a(X) = n − 1 and a(Xy ) = 2, there exists a normal projective variety\nZ that admits an elliptic fibration ψ : Z → Y and satisfies the following\nproperties:\n21\n\n\f• there exists an almost holomorphic fibration τ : X 99K Z such that\nφ = ψ ◦ τ.\n• there exists an endomorphism f : Z → Z of degree d that commutes\nwith ψ and such that f ◦ τ = τ ◦ f .\nProof. The general fibre Xy has Kodaira dimension zero and the restricted endomorphism fy : Xy → Xy has degree d. Thus Xy is covered by a torus by [FN05].\nMoreover if a(Xy ) ≤ 1, the general fibres are isomorphic to a fixed torus A: apply\n[CP00, Cor.6.8] to X ×Y C → C where C is a general complete intersection curve\nin Y .\nSuppose now that a(Xy ) = 1. Let ry : Xy → Ey be the algebraic reduction,\nthen there exists an endomorphism f y : Ey → Ey such that f y ◦ ry = ry ◦ fy .\nThe endomorphism f y can't be an automorphism since otherwise a(Xy ) = 2 by\nProposition 4.6. Thus it has degree at least two and if ψ : Z 99K Y denotes the\nrelative algebraic reduction of X → Y , there exists a meromorphic endomorphism\nf : Z 99K Z that commutes with ψ. By Lemma 4.2 this implies that ψ has a\nmultisection, hence a(X) ≥ a(Z) = n − 1.\nSuppose now that a(Xy ) = 2. Then the fixed point set of fy is not finite, since\notherwise f has a multisection and X is projective by Campana's theorem 3.2.\nThus by Lemma 4.2 there exists a compact normal variety Z that is in the Fujiki\nclass and admits an elliptic fibration ψ : Z → Y with a multisection and satisfies\nthe stated properties. Since ψ has a multisection, we have a(X) ≥ a(Z) = n − 1\nand Z is algebraic.\n\u0003\n5.3. Theorem. Let X be a compact Kähler manifold of dimension n, and let\nf : X → X be an endomorphism of degree d > 1. Suppose that\nκ(X) = a(X) = n − 2.\nThen X is (up to étale cover) a product Y × A where Y is of general type and A a\ntwo-dimensional torus of algebraic dimension zero.\nProof. By [NZ09, Sect. 1.4] there exists a \"f -equivariant\" resolution of the indeterminacies μ : X ′ → X of the Iitaka fibration φ : X 99K Y such that f lifts to a\nholomorphic endomorphism f ′ : X ′ → X ′ . If we show that X ′ ≃ Y ′ × A, it is aposteriori clear that the Iitaka fibration of X is holomorphic and hence X ≃ Y × A.\nThus we can suppose without loss of generality that X admits a holomorphic fibration φ : X → Y onto a projective variety Y such that the general fibre has Kodaira\ndimension zero. By [NZ09, Thm. A] the endomorphism f induces an automorphism g : Y → Y of finite order, so up to replacing f by some multiple we can\nsuppose that g = IdY . By Lemma 5.2 the general fibre Xy is a torus of algebraic\ndimension one. Since by hypothesis Xy is not algebraic, it is isomorphic to a fixed\ntorus A (ibid).\nThus by [CP00, Cor. 6.6] there exists a finite Galois cover Y ′ → Y such that\nX ×Y Y ′ is bimeromorphic over Y ′ to a principal torus bundle φ′ : X ′ → Y ′ . The\nfollowing commutative diagram and the universal property of the fibre product\n22\n\n\fshow that f lifts to an endomorphism h : X ×Y Y ′ → X ×Y Y ′ of degree d that\ncommutes with the projection on Y ′ .\n∃\n\nuniv. prop. fibre prod.\n\nX ×Y Y■ ′\n■■\n■■\n■■\n■■\n$\n\nh\n\nX\n\nf\n\nφ\n\n\u000f\n:✉ Y\n✉✉\n✉✉\n✉\n✉\n\u000f ✉✉✉\n′\nY\n\n/X\n\n/ X ×Y Y ′\n✉\n✉✉\n✉✉\n✉\n✉\n✉\nz ✉\n\nφ\nIdY\n\nIdY ′\n\n\u000f\n/ Y d■\n■■\n■■\n■■\n■■\n■ \u000f\n/ Y′\n\nThus there exists a meromorphic endomorphism f ′ : X ′ 99K X ′ of degree d that\ncommutes with φ′ . The φ′ -fibre is a two-dimensional torus of algebraic dimension\nzero, so it contains no curves. This immediately implies that f ′ extends to a\nholomorphic endomorphism. Since Xy is simple, Corollary 4.5 shows that the fixed\npoint set of f gives an étale covering F ix(f ) → Y ′ . Since X ′ → Y ′ is a principal\nbundle, we see that after étale base change X ′ ≃ Y ′ × A Moreover since Y ′ is\nprojective any morphism from Y to A is constant, so f ′ = (IdY ′ , fA ) where fA is\nthe restriction of f to any y × A.\n\nSince A contains no curves, the composed map ψ := pA ◦ μ : X ×Y Y ′ 99K A extends\nto a holomorphic map. Moreover fA ◦ ψ = ψ ◦ h, so Proposition 2.14 implies that\nψ is smooth. The natural maps X ×Y Y ′ → Y ′ and ψ then define an isomorphism\nonto Y ′ × A.\n\u0003\n5.4. Theorem. Let X be a compact Kähler threefold, and let f : X → X be an\nendomorphism of degree d > 1. Suppose that KX is semiample and\nκ(X) = 1, a(X) = 2.\nThen (up to étale cover) one of the following holds:\n1.) X is a product C × A where C is a curve of general type and A a twodimensional torus of algebraic dimension one or\n2.) X is a product E × S where E is an elliptic curve and S a non-algebraic\nKähler surface of Kodaira dimension one.\n\nThe stategy of the proof should also work for compact Kähler manifolds with\nκ(X) = n − 2, a(X) = n − 1 if one is able to show the following statement (due to\nNakayama [Nak08, Thm.6.2.1] in the surface case).\n5.5. Conjecture. Let X be a normal projective variety of dimension n − 1, and let\nf : X → X be an endomorphism of degree d > 1. Suppose that X admits a (flat?)\nfibration τ : X → Y whose general fibre is an elliptic curve and commutes with f .\nThen (up to base change) we have X is a product Y × E where E an elliptic curve.\nProof. Some multiple bundle of the canonical bundle induces a fibration φ : X → C\nsuch that mKX ≃ φ∗ L. By [NZ09, Thm. A] the endomorphism f induces an\nautomorphism g : C → C of finite order, so up to replacing f by some multiple we\ncan suppose that g = IdC .\n23\n\n\f1st case. The general φ-fibre has algebraic dimension one.\nBy a statement due to Voisin (cf. [Cam06, Prop.3.10]), there exists a holomorphic\ntwo-form on X whose restriction to the general fibre Xc gives a non-zero holomorphic two form. Thus by [CP00, Prop.4.2, Prop.6.7] the fibration φ is almost smooth\nand there exists a base change C ′ → C such that the normalisation of X ×C C ′\ngives an étale covering of X and is a principal bundle over C ′ . Arguing as in the\nproof of Theorem 5.3 we see that the endomorphism f lifts, so we can suppose\nwithout loss of generality that φ : X → C is a principal bundle. By Corollary 4.8\nthe induced endomorphism f : Xc → Xc has a non-empty finite fixed point set.\nCopying word by word the proof of [FN07, Thm.2.24], one sees that F ix(f ) → C\nis finite and étale. Since X → C is a principal bundle, we see that after étale base\nchange X ≃ C × A.\n2nd case. The general φ-fibre is algebraic.\n\nBy Lemma 5.2 there exists a normal projective surface Z that admits an elliptic\nfibration ψ : Z → C and satisfies the following properties:\n• there exists an almost holomorphic fibration τ : X 99K Z such that φ = ψ◦τ .\n• there exists an endomorphism f : Z → Z of degree d that commutes with\nψ and such that f ◦ τ = τ ◦ f .\n\nBy [Nak08, Thm.6.2.1] there exists a finite base change C ′ → C such that the\nnormalisation of Z ×C C ′ is isomorphic to C ′ × E, where E is an elliptic curve. Note\nfurthermore that by [Nak08, Lemma 6.2.5] the base change is étale over the locus\nwhere the fibres of ψ are reduced, in fact the ramification order in c ∈ C equals the\nmultiplicity of the fibre Zc . Since φ = ψ ◦ τ this shows that the ramification order\nin c divides the multiplicity of the fibre Xc . Thus by a classical argument the map\nfrom the normalisation of X ×C C ′ onto X is étale. As in the proof of Theorem\n5.3 we can use the universal property of the fibre product and a commutative\ndiagram to see that (up to étale cover) we can suppose that Z ≃ C × E where E\nin elliptic curve. By [FN07, Lemma 2.25] we may suppose (up to making an étale\nbase change) that the endomorphism f is of the form idC × gE , where gE : E → E\nis an endomorphism of degree d.\nSince E is an elliptic curve, the meromorphic fibration pE ◦ τ : X 99K E extends to\na holomorphic map such that we have a commutative diagram\n\npE ◦τ\n\nX✤\n✤τ\n✤\n\u000f\nC ×E\n\nf\n\nf\n\npE\n\n\u000f\nE\n\n/X\n✤\n✤τ\n✤\n\u000f\n/ C ×E\n\n.\n\npE ◦τ\n\npE\ngE\n\n\u000f ~\n/E\n\nThus by Proposition 2.14 the fibration pE ◦ τ is smooth and by adjunction its fibres\nXe are surfaces with Kodaira dimension one that have a natural elliptic fibration\nφ|Xe : Xe → C. Since the general fibre of φ is algebraic, an easy application of\nCampana's theorem shows that a general fibre of Xe has algebraic dimension one.\nThus the relative algebraic reduction of X → E is holomorphic and identifies to\nτ . Thus τ is holomorphic and since f is étale of degree at least two, Proposition\n24\n\n\f2.14 implies that it is an equidimensional elliptic fibration whose singular locus is\na disjoint union of ci × E.\n\nLet now Xc be a very general φ-fibre. Then Xc is covered by an algebraic torus\nand is an elliptic bundle τc : Xc → c × E ≃ E. Thus by Poincaré's irreducibility\ntheorem there exists an étale cover of Xc by Ec′ × E. In particular we get a family\nof elliptic curves in Xc surjecting onto E. By countability of the components of\nthe cycle space, we may suppose that the family of curves deforms with Xc for\nc ∈ C very general. Let Y → C be the normalisation of the component of C(X/C)\nparametrising these curves, and denote by X̃ the normalisation of the universal\nfamily. Denoting by p : X̃ → X and q : X̃ → Y the natural maps, we we have\ncommutative diagram\np\n/ X pE ◦τ / E .\nX̃\nq\n\n\u000f\nY\n\nφ\n\n\u000f\n/C\n\nA general member of the family X̃y is an elliptic curve surjecting onto E. The étale\nbase change X̃y → E induces an étale covering of X ×E X̃y → X, so up to replacing\nX by an étale cover we can suppose without loss of generality that a general X̃y is\na pE ◦ τ -section and p is birational. We claim that p is an isomorphism. Assuming\nthis for the time being, let us show how to conclude: for simplicity of notation,\nidentify X and X̃. Let Xe be a general pE ◦ τ -fibre, then Xe → Y is surjective and\nétale in codimension one. Thus the induced morphism X ×T Xe → X is étale in\ncodimension one, so étale since X is smooth. Thus up to replacing X by an étale\ncover the pE ◦ τ -fibres Xe are q-sections, in particular all the fibres are isomorphic\nto Y . Thus q × (pE ◦ τ ) : X → Y × E is an isomorphism.\nProof of the claim. Since X is smooth and X̃ is normal, it is sufficient that for every\nx ∈ X there exist at most finitely many X̃y passing through x. We will show this\nproperty \"fibrewise\": let first c ∈ C be a point that is not in the φ-singular locus.\nThen the fibre Xc is an elliptic bundle over c × E and the X̃y are a one-dimensional\nfamily of disjoint sections parametrised by Yc . Thus Xc is a torus isomorphic to\nYc × E and the X̃y form a family of line bundles such that the intersection product\nin Xc equals zero.\nLet now c0 ∈ C be a point that is in the φ-singular locus. Then for every point\ny ∈ Yc0 there exists a small analytic neighbourhood D of c0 and a multisection\nS ⊂ Y over ∆ passing through y such that S∩Yc0 is a singleton. Let D := p(q −1 (S))\nbe the analytic subset of X covered by the curves parametrised by S. Then D is a\nsurface in the threefold X, so it is locally principal. In particular for every c ∈ ∆,\nthe intersection Xc ∩ D is a Cartier divisor. Since for c ∈ D general the selfintersection is zero and the Xc vary in a flat family, we see that the curve X̃y is a\nCartier divisor in Xc with self-intersection zero. Thus if we show that every curve\nX̃y is irreducible, this implies that there are at most finitely many X̃y through a\ngiven point and we are done.\nThe irreducibility of X̃y can be seen as follows: by Kodaira's list of singular fibres of\nan elliptic fibration, the reduction of the fibre Xc ≃ τ −1 (c × E) is either an abelian\nsurface (in this case the fibres over c × E are multiple elliptic curves) or the fibres of\nXc → E are cycles of (maybe singular) rational curves. We will deal with the second\n25\n\n\fcase, the first case can be reduced to the preceding case by a local base change.\nSince f commutes with φ, we have an étale endomorphism fc : Xc → Xc of degree\nd and up to replacing f by some power fc maps every irreducible component of Xc\nonto itself. Again by Kodaira's list the normalisation ν : T → Xc is a disjoint union\nof P1 -bundles Ti over the elliptic curve E and fc lifts to an étale endomorphism\nfci : Ti → Ti of degree d. Since fci is étale, one sees easily (cf. [Nak02, Ch.2]) that Ti\ndoes not contain any curves with negative self-intersection. The pull-back ν ∗ X̃y is\nan effective divisor with self-intersection 0 that surjects onto E. The claim follows\nby an easy intersection calculus on Ti .\n\u0003\n5.B. Proof of Theorem 1.2. By Proposition 3.8 there exists a finite sequence of\nsmooth compact Kähler threefolds\nμ2\n\nμ=μ1\n\nμn\n\nX = X0 −→ X1 −→ . . . −→ Xn\n\nsuch that Xn is described by Theorem 5.1 and Xi−1 is the blow-up of Xi along an\nelliptic curve Ci with numerically trivial normal bundle such that fi−1 (Ci ) = Ci .\nWe will now use the list in Theorem 5.1 to see what blow-ups are actually possible.\n1st case. κ(X) = 0. In this case Xn is a torus or a product Y × E where Y is a K3\nsurface and E is an elliptic curve.\na) Xn is a torus. We claim that if X 6= Xn , then Xn is isogenous to Y × E where\nY is a torus and E an elliptic curve: by hypothesis Xn contains the elliptic curve\nE := Cn , so we have a quotient map φ : Xn → Xn /E. Since fn−1 (Cn ) = Cn there\nexists an étale endomorphism g : Xn /E → Xn /E such that g ◦ φ = φ ◦ fn . Since\nfn−1 (Cn ) = Cn the fibre g −1 (φ(Cn )) is a singleton, so g is an automorphism. Thus\nXn is decomposable by Proposition 4.7, i.e. a product of an elliptic curve and a\ntwo-dimensional torus. In particular the algebraic dimension of Xn is at least one\nand if it equals one, the unique decomposition possible is Y × E. If the algebraic\ndimension of Xn equals two, the quotient Xn /E has algebraic dimension one and\nthe claim follows from Proposition 4.6.\nThus Xn ≃ Y × E and up to making an étale base change we can suppose that\nf is of the form (g, h) where g : Y → Y is an automorphism and h : E → E\nan endomorphism of degree d (cf. [FN07, Lemma 2.25] which does not use the\nprojectiveness assumption). Let 0 × Cn be the copy of E ⊂ Xn that is the center\nof the blow-up. Then the commutative diagram\nXn\n\nf\n\npE\n\npE\n\n\u000f\nE\n\n/ Xn\n\nh\n\n\u000f\n/E\n\nand deg h > 1 immediately implies that Cn is not contained in some Y × e for\ne ∈ E. Thus Cn surject onto E and up to replacing by an étale cover, it is of the\nform y × E for some yn ∈ Y . Thus the blow-up of Xn along Cn is isomorphic to\nBly Y × E. The restriction of fn−1 to Bly Y is an automorphism, so we obtain the\nstatement by induction.\nb) Xn ≃ Y × E with Y a K3. Since h1 (Y, OY ) = 0, the projection onto E is the\nAlbanese map of Xn . Since a K3 does not admit endomorphisms of degree at least\ntwo, the induced endomorphism h : E → E has degree d. Since the automorphism\n26\n\n\fgroup of a K3 surface is discrete we see that the restriction of fn to Y × e does not\ndepend on e, so fn = (g, h), where g : Y → Y is an automorphism. We can now\nargue as in Case a).\n2nd case. κ(X) = 1. According to Theorem 5.1 we distinguish two cases.\na) Xn ≃ C × A with C a curve of general type and A a torus of algebraic dimension\nat most one. We claim that in this case it is not possible to have X 6= Xn and argue\nby contradiction. The projection onto C is the Iitaka fibration, so up to replacing f\nby some power we may suppose that the induced endomorphism on C is the identity.\nMoreover since the algebraic dimension of A is at most one, any morphism from C\nto A is constant. This implies that fn = (IdC , g) with g an endomorphism of A of\ndegree d. The elliptic curve Cn does not map surjectively onto C, so it is contained\nin some torus c × A. In particular A has algebraic dimension one and Cn is a\nfibre of the algebraic reduction A → T . Since g −1 (Cn ) = Cn , the endomorphism\ninduced by g on T is an automorphism. Hence A is algebraic by Proposition 4.6, a\ncontradiction.\nb) Xn ≃ E × S where E is an elliptic curve and S a surface with a(S) = κ(S) = 1.\nLet ψ : S → C be the algebraic reduction of S. Then pE × ψ : X → E × C is the\nalgebraic reduction of X, so there exists an induced endomorphism g : E × C →\nE × C. In general the endomorphism g does not preserve the projection onto E,\nbut by [FN07, Lemma 2.25] there exists an étale base change E ′ → E such that this\nis the case. Since all the Xi are fibre spaces over E we can suppose without loss of\ngenerality that there exists an endomorphism gE : E → E such that gE ◦pE = pE ◦g.\nThus we also have gE ◦ pE = pE ◦ f and the restriction of f to some e × S gives an\nendomorphism fS of S. Since S has algebraic dimension one, Theorem 1.1 implies\nthat fS is an automorphism. Thus gE has degree d and we can conclude as in the\nfirst case. \u0003\n6. Uniruled manifolds\nThe aim of this section is to prove Theorem 1.3. We will start with the easy case\nwhere f is étale, for the case of ramified endomorphisms we make a case distinction\nin terms of the algebraic dimension. With increasing algebraic dimension the proofs\nget more and more involved, this confirms our philosophy that non-algebraicity is an\nobstruction to the existence of endomorphisms. For the convenience of the reader\nwe will repeat at the start of every subsection the part of Theorem 1.3 that we are\nabout to prove.\n6.A. Proof of Theorem 1.3: étale endomorphisms.\n6.1. Theorem. Let X be a non-algebraic compact Kähler threefold which is not\nuniruled, and let f : X → X be an étale endomorphism of degree d > 1. Then X\nis (up to étale cover) a projectivised bundle P(E) over a non-algebraic torus A and\nc21 (E) = 4c2 (E).\nProof of Theorem 6.1. Since the endomorphism f is étale, we have χ(X, OX ) = 0.\nSince X is non-algebraic and uniruled, we have h3 (X, OX ) = 0 and h2 (X, OX ) ≥ 1.\nTherefore h1 (X, OX ) ≥ 2, and we denote by α : X → Y the Stein factorisation of\nthe Albanese map X → Alb(X) whose general fibre has dimension at least one.\n27\n\n\f1st case. Y is a surface. The general fibre of α is a rational curve, so Y is not algebraic since otherwise X would be algebraic. By Proposition 2.9 the endomorphism\nf induces an endomorphism g on Y which has degree d since f is étale. Applying\nTheorem 1.1 we obtain κ(Y ) = 0, so Y → Alb(X) is surjective and étale. By the\nuniversal property of the Albanese torus, we obtain Y = Alb(X).\nWe will now show that α : X → Y = Alb(X) is a P1 -bundle. By Proposition 2.14\nthe α-singular locus ∆ is empty or has pure dimension one and satisfies g −1 (∆) = ∆.\nSince Y is a non-algebraic two-dimensional torus, the components of ∆ are elliptic\ncurves that are contracted by the algebraic reduction Alb(X) → E. The endomorphism g induces an endomorphism h on E by Proposition 2.12. The condition\ng −1 (∆) = ∆ implies that h is an isomorphism which contradicts a(Alb(X)) ≤ 1 by\nProposition 4.6.\nUp to making an étale base change, we can suppose that X is a projectivised bundle\nP(E). The canonical bundle of a is trivial, so KX ≃ OP(E) (−2) ⊗ φ∗ det E. Since f\n3\nis étale, we have KX\n= 0. An elementary computation shows that c21 (E) = 4c2 (E).\n2nd case. Y is a curve. We will prove that in this case X is necessarily algebraic.\nSince h1 (Y, OY ) = h1 (X, OX ) ≥ 2, the endomorphism induced on Y is an automorphism of finite order, so up to replacing f by some power we may suppose that\ng = IdY . Let S → C be the unique irreducible component of the relative cycle\nspace C(X/C) that parametrizes the rational curves in X. The push-forward of\ncycles f∗ acts on C(X/C) and since f induces a meromorphic endomorphism on the\nbase of the rationally connected quotient X 99K S (Prop. 2.9). Thus we obtain an\nendomorphism f∗ : S → S that commutes with S → C. Since f is étale and the\ngeneral fibre of X 99K S is a P1 , we see that f∗ has degree d. The general fibre of\nS → C is an elliptic curve since otherwise S is algebraic. By Lemma 4.2 we see\nthat S → C has a multisection, so S is algebraic. Therefore X is algebraic.\n\u0003\n6.B. Proof of Theorem 1.3: algebraic dimension zero.\n6.2. Theorem. Let X be a compact Kähler threefold of algebraic dimension zero\nwhich is uniruled, and let f : X → X be a ramified endomorphism of degree d > 1.\nThen X is (up to étale cover) a projectivised bundle P(E) over a torus A of algebraic\ndimension zero, f induces an endomorphism on A of degree at least two, and E is\na direct sum of line bundles.\nIf the algebraic dimension is zero, we have the following elementary, but useful\nlemma at our disposition.\n6.3. Lemma. Let X be a compact Kähler threefold of algebraic dimension zero\nand let f : X → X be an endomorphism of degree d > 1. Suppose that X admits a\nfibration φ : X → S onto a normal surface S. Then there exists an endomorphism\ng : S → S such that g ◦ φ = φ ◦ g.\nProof. By a theorem of Fischer and Forster [FF79, Thm.] there exist only finitely\nmany divisors on X. Since the images and preimages of divisors are divisors, we\nsee that f induces a bijective map on the set of divisors on X. Since this set is\nfinite, some iteration f k induces the identity.\nBy the rigidity lemma it is sufficient to prove that any φ-fibre is mapped by f into\na φ-fibre. By what precedes we may suppose that this is true for the divisorial\n28\n\n\ffibre components. Since S contains only finitely many curves, it also holds for the\ngeneral φ-fibres.\n\u0003\nProof of Theorem 6.2. The rationally connected quotient is an almost holomorphic\nmap φ : X 99K S onto a compact Kähler surface of algebraic dimension zero. By\nLemma 2.18 we can replace S by a singular K3 surface or a torus without curves, so\nwe may suppose that φ is holomorphic. By Lemma 6.3 there exists a holomorphic\nmap g : S → S such that φ ◦ f = g ◦ φ. Since S does not contain any curves, the\nφ-singular locus is a finite union of points.\n1st case. g is an automorphism. Since the φ-singular locus is a finite union of points,\nthe conditions of Proposition 2.16 are satisfied (if S is a singular K3 surface, we also\nuse Corollary 2.19). Thus after finite base change X is bimeromorphic to S × P1 .\nIn particular it has algebraic dimension at least one, a contradiction.\n2nd case. g is not an automorphism. We claim that S is a torus: otherwise S\nwould be a singular K3 surface and by Proposition 2.21 there exists a Galois cover\nby a torus ν : A → S that is étale in codimension one such that g lifts to an\nendomorphism gA : A → A of degree deg g. The following commutative diagram\nand the universal property of the fibre product show that f lifts to an endomorphism\nf ′ : X ×S A → X ×S A.\n∃\n\nuniv. prop. fibre prod.\n\nX ×S ❍A\n❍❍\n❍❍\n❍❍\n❍❍\n#\n\nf′\n\nX\n\nφ′\n\n\u000f\n:✈ S\n✈\nν ✈✈✈\n✈\n✈\n\u000f ✈✈✈\nA\n\nf\n\nφ\n\n/X\n\n/ X ×S A\n✈\n✈✈\n✈✈\n✈\n✈\n{✈\n✈\n\nφ\ng\n\ngA\n\nφ′\n\n\u000f\n/ S d❍\n❍❍\n❍❍ ν\n❍❍\n❍❍\n❍ \u000f\n/A\n\nSince the endomorphism gA is étale and A does not contain any curves, the morphism φ′ is smooth by Proposition 2.14. Thus the reduction of every φ-fibre is\nisomorphic to P1 . Suppose that there exists a non-reduced fibre φ−1 (s): then\n−KX * φ−1 (s) = 2 implies that the fibre is a double P1 and the reduced fibre l\nsatisfies −KX * l = 1. By a theorem of Ein-Kollár [Kol91, Thm.5.3] the rational\ncurve l deforms in a one-dimensional family that covers a surface D in X. Since φ\nis equidimensional, φ(D) is a curve in S, a contradiction. Thus we see that φ is a\nsmooth map and hence S is a smooth Kähler surface of algebraic dimension zero\nthat admits an endomorphism of degree at least two. This shows that S is a torus.\nUp to replacing X by an étale cover, we can suppose that X = P(E) where E is a\nrank two vector bundle which splits by Lemma 6.5 below.\n\u0003\nThe same proof shows the following statement.\n6.4. Proposition. Let X be a compact Kähler threefold, and let f : X → X be\nan ramified endomorphism of degree d > 1. Suppose that the rationally connected\nquotient is a fibration φ : X → S onto a normal Kähler surface without curves.\n29\n\n\fSuppose furthermore that the induced endomorphism g : S → S has degree at least\ntwo. Then S is a torus and X a P1 -bundle over S.\n6.5. Lemma. Let A be a two-dimensional torus of algebraic dimension zero, and let\nφ : X = P(E) → A be the projectivisation of a rank two vector bundle E. Suppose\nthat there exists a ramified endomorphism f : X → X and an étale endomorphism\ng : A → A of degree at least two such that g ◦ φ = φ ◦ f . If the algebraic dimension\nof X is zero, then E is (up to finite étale base change) a direct sum of line bundles.\nRemark. The statement of the lemma as well as the techniques in the proof are\nsimilar to [Ame03, Thm.2]. Nevertheless there is an important difference due to\nthe condition on A: our conclusion holds after étale base change.\nProof. Since X has algebraic dimension zero, there exist only finitely many divisors\non X. Thus up to replacing f by some multiple we can suppose that f −1 (D) = D\nfor every irreducible effective divisor on X. Since f is ramified, there exists an\neffective divisor D ⊂ R and we denote by fD : D → D the restriction of f to D.\nThe torus A does not contain any curve, so the holomorphic map φD : D → A is\nsurjective and not ramified. Since g ◦ φD = φD ◦ fD and g étale of degree at least\ntwo, Proposition 2.14 shows that φD does not have any higher-dimensional fibres.\nThus φD is étale and D is a torus of algebraic dimension zero. Making an étale\nbase change D → A, we can suppose that D is a φ-section. Moreover the following\ncommutative diagram and the universal property of the fibre product show that f\nlifts to an endomorphism f ′ : X ×A D → X ×A D.\n∃\n\nuniv. prop. fibre prod.\n\nX ×A D\n❍❍\n❍❍\n❍❍\n❍❍\n❍$\n\nf′\n\nX\n\nf\n\nφ\n\n\u000f\n:✉ A\n✉\nφD ✉✉\n✉✉\n✉\n\u000f ✉✉✉\nD\n\n/X\n\n/ X ×A D\n✈✈\n✈✈\n✈\n✈✈\nz✈\n✈\n\nφ\ng\n\nfD\n\n\u000f\n/ A d■\n■■\n■■φD\n■■\n■■\n■ \u000f\n/D\n\nThus up to finite étale base change the ramification divisor R has one irreducible\ncomponent D1 that is a φ-section. Since any endomorphism of P1 of degree at\nleast two ramifies in at least two points, this implies that R has at least another\nirreducible component D2 . Arguing as before we see that D2 is an étale cover of A.\nMoreover the intersection with D1 is empty since D1 does not contain any curves.\nUp to making a second étale base change D2 → A we can suppose that φ has two\ndisjoint sections. Thus E is a direct sum of line bundles.\n\u0003\n6.C. Proof of Theorem 1.3: algebraic dimension one.\n6.6. Theorem. Let X be a compact Kähler threefold of algebraic dimension one\nwhich is uniruled, and let f : X → X be a ramified endomorphism of degree d > 1.\nThen (up to étale cover) one of the following holds:\n30\n\n\f1.) X is a product S × P1 , where S is a compact Kähler surface of algebraic\ndimension zero and f induces an automorphism on S.\n2.) X is a projectivised bundle P(E) over a torus A of algebraic dimension at\nmost one such that the induced morphism on A has degree at least two and\nE is a direct sum of line bundles.\nProof of Theorem 6.6. The rationally connected quotient is an almost holomorphic\nmap φ : X 99K S onto a compact Kähler surface of algebraic dimension at most\none.\n1st case. S has algebraic dimension one\nUp to replacing S by a bimeromorphic model, we may suppose that S is a relatively\nminimal elliptic surface ψ : S → C. Since a(S) = 1 there does not exist any curve\nin S that surjects onto C. The general fibre of ψ ◦ φ : X 99K C is uniruled, hence\nalgebraic, so ψ ◦ φ extends to a holomorphic map by Corollary 3.3. Furthermore we\nknow by [CP00, Cor.7.3] that the general ψ◦φ-fibre is isomorphic to P(OE ⊕L) → E\nwhere E is an elliptic curve and L is a numerically trivial line bundle that is not\ntorsion.\nBy Proposition 2.9 there exists a meromorphic endomorphism g : S 99K S such that\ng ◦ φ = φ ◦ f . Thus by Proposition 2.12 there exists an endomorphism gC : C → C\nsuch that gC ◦ ψ = ψ ◦ g. Thus we get a commutative diagram\n\nψ◦φ\n\nf\n/X\nX✤\n✤\n✤φ\n✤φ\n✤\u000f\n✤\u000f\ng\n❴\n❴\n❴\n/\nS\nS\nψ\n\n\u000f\nC\n\nψ◦φ\n\nψ\ngC\n\n\u000f ~\n/C\n\nand make another case distinction.\na) gC is an automorphism. We will show that this case does not exist: the restriction of f to the general fibre Xc ≃ P(OE ⊕ L) gives an endomorphism fc : Xc → Xc\ndegree d > 1. Denote by π : Xc → E the canonical projection, then there exists an\nendomorphism gE : E → E such that gE ◦ π = π ◦ fc . Note that gE can't be an\nautomorphism: otherwise Amerik's theorem [Ame03, Thm.1] would imply that Xc\nis a product after étale cover, so L is a torsion line bundle. We will now use the\nMori program: since X is uniruled, it admits a contraction.\nSuppose first that X admits a fibre type contraction. Since X contains only one\ncovering family of rational curves and the rationally connected quotient is only\ndefined up to birational equivalence, we can suppose that the contraction is the\nrationally connected quotient φ : X → S. Since φ is flat, the rigidity lemma\nimplies that g extends to a holomorphic endomorphism g : S → S. Since the\nrestriction of g to a general ψ-fibre is gE , we see that g has degree at least two.\nThus S is a torus [FN05] and admits an endomorphism g of degree at least two\nsuch that gC ◦ ψ = ψ ◦ g. Since gC is an automorphism, Proposition 4.6 implies\nthat S is isogenous to a product of elliptic curves, a contradiction to a(S) = 1.\n31\n\n\fIf X admits a contraction of birational type μ : X → X ′ , we argue using Proposition\n3.10. First observe that the composed map ψ ◦ φ : X → C is locally projective\n(blow up to make φ a (locally projective) morphism, then a priori ψ ◦ φ might only\nlocally Moishezon, but [CP04, Thm.10.1] gives local projectivity). Then change\npossibly μ to get local projectivity of the induced map τ ′ : X → C. Then we get\ninductively a sequence of a compact manifolds bimeromorphically equivalent to a\nKähler manifold\nX = X0 → X1 → . . . → Xn\nsuch that Xn admits a fibre type contraction and gC is an automorphism. But we\nhave just seen that such a Xn does not exist (the Kähler property is not needed\nthere).\n\nb) gC is not an automorphism. In this case the curve C is elliptic or P1 . We\ncan't have C ≃ P1 , since otherwise S is algebraic by Proposition 2.22. Thus C is\nelliptic and the endomorphism gC is étale. It follows by Lemma 2.15 that ψ ◦ φ is\na submersion, thus all the fibres are uniruled and have b1 (Xc ) = b2 (Xc ) = 2. This\neasily implies that all the fibres are P1 -bundles over elliptic curves. Thus φ extends\nto a holomorphic map and X is a P1 -bundle over S which is an elliptic bundle\nover S. Since S is Kähler but not algebraic, it follows from [BHPVdV04, V.5.B)]\nthat S is a torus of algebraic dimension one. Thus the meromorphic endomorphism\ng : S 99K S also extends to a holomorphic map of degree at least deg gC . Up to\nmaking an étale base change, we can suppose X ≃ P(E), where E is a rank two\nvector bundle which splits by Lemma 6.7 below.\n2nd case. S has algebraic dimension zero\nIn this case X is bimeromorphic to P1 × S where S is a compact Kähler surface\nof algebraic dimension zero [CP00, Cor.7.6]. The general fibre of the algebraic\nreduction is bimeromorphic to S, so by Proposition 3.4 we have a holomorphic\nalgebraic reduction r : X → P1 . On the other hand, we know by Lemma 2.18\nthat, up to replacing S by some bimeromorphic normal model, we may suppose\nthat S does not contain any curves. Thus we may suppose that the rationally\nconnected quotient is a holomorphic map φ : X → S, so we get a holomorphic map\nr × φ : X → P1 × S of degree one. In particular we have\nr∗ OP1 (1) * f = 1,\n\nwhere f is a general φ-fibre. We know by Proposition 2.9 that there exists an\nendomorphism gS : S → S such that gS ◦ φ = φ ◦ f . Moreover by Proposition 2.12\nthere exists an endomorphism gP1 : P1 → P1 such that gP1 ◦ r = r ◦ f . Together\nthey induce an endomorphism gP1 × gS : P1 × S → P1 × S such that we have a\ncommutative diagram\nX\n\nf\n\n/X\nr×φ\n\nr×φ\n\n\u000f\n\u000f\ngP1 ×gS\n/ P1 × S\nP1 × S\nWe distinguish two cases:\na) gS is not an automorphism. By Proposition 6.4 we know that X → S is a P1 bundle and S is a torus. Since r∗ OP1 (1) * f = 1 the fibres of the algebraic reduction\n32\n\n\fare φ-sections. Thus r × φ is an isomorphism onto P1 × S and we are in the second\nCase of Theorem 6.6 (in this case E ≃ OS⊕2 ).\nb) gS is an automorphism. Since r × φ has degree one, this implies that gP1 has\ndegree d. Let T2 ⊂ P1 × S be the set such that the r × φ-fibre has dimension two.\nThen T2 is finite and by Proposition 2.14, the endomorphism gP1 × gS is totally\nramified in every point of T2 . Since gS is an automorphism, this shows that gP1 has\nramification order d in every point of pP1 (T2 ).\nWe will now use Mori theory to discuss the structure of X: since X is uniruled it\nadmits at least one contraction.\nb1) X admits a fibre type contraction ψ : X → S ′ . Then X is a P1 - or conic bundle\nover the smooth surface S ′ (Theorem 3.5). Since X contains only one covering\nfamily of rational curves, the general ψ-fibre is a general φ-fibre. The fibration\nψ is flat, so the rigidity lemma shows that we have a factorisation τ : S ′ → S\nwhich is actually a birational map. Since ρ(X/S ′ ) = 1 and r∗ OP1 (1) * f = 1, we\nsee that ψ is not a conic bundle. The endomorphism gS is an automorphism, so\nthe endomorphism gS ′ induced by f on S ′ is an automorphism. We satisfy the\nconditions of Proposition 2.16, so there exists an étale cover of S ′ such that X\nbecomes a product after base change. Thus we are in the first case of Theorem 6.6.\nNote furthermore that f = (gS , h) since the space of endomorphism of P1 is affine\n[Ame03, Lemma 1.2].\nb2) X admits a birational contraction ψ : X → X ′ . Denote by E the exceptional\nlocus. Since S does not contain any curve, E is contained in a higher-dimensional\nfibre of φ. Since there are only finitely many higher-dimensional fibres, we can\nsuppose (up to replacing f by f k ) that f −1 (E) = E. In particular we get an\nendomorphism f ′ : X ′ → X ′ of degree d such that f ′ ◦ ψ = ψ ◦ f . We claim that ψ\nis of type 3.) in Theorem 3.5, i.e. it contracts a divisor onto a smooth curve.\nProof of the claim: We argue by contradiction and suppose that ψ contracts a divisor E onto a point. Since all the curves contained in E are numerically equivalent\nand P1 × S does not contain any ruled surface (recall that S contains no curve),\nwe see that r × φ maps E onto a point c contained in T2 . By what precedes, the\nendomorphism gP1 has ramification order d in pP1 (c). Denote by Xc = r∗ c the\nr-fibre over c. Since gP1 ◦ r = r ◦ f and gP∗1 c = dc, we have\ndXc = f ∗ Xc .\n2\n6= 0 by\nThus the ramification order of f along E ⊂ Xc equals d and E 3 = NE/X\nTheorem 3.5. Since f −1 (E) = E, this contradicts Corollary 3.9. \u0003\n\nThus X ′ is smooth and since S does not contain any curves, there exists a holomorphic map φ′ : X ′ → S such that φ = φ′ ◦ ψ. Note that we also obtain a\nmorphism\nt : X ′ → P1 × S.\n\nInstead of applying Proposition 3.10, which is tedious, we argue as follows. We\napply directly [Nak87] to the projective morphism\nr × φ : X → P1 × S\n33\n\n\fand obtain a possibly new birational morphism ν : X → X ′ and a factorisation\nX ′ → P1 × S which is again projective. Since P1 × S is Kähler, so is X ′ . Arguing\nby induction, we get a sequence of birational contractions\nX = X0 → X1 → . . . → Xn\nsuch that Xn is compact Kähler, admits an endomorphism fn : Xn → Xn of degree\nd and a fibre type contraction. By Case a) there exists an étale cover of Xn by\nSn × P1 and fn = (gn , hn ) where gn is an automorphism of Sn and hn : P1 → P1\nan endomorphism of degree d. Since\nπ1 (X) ≃ π1 (X1 ) ≃ . . . ≃ π1 (Xn )\nwe can suppose that Xn = Sn × P1 . The manifold Xn−1 is obtained by blowing up\na curve Cn such that fn−1 (Cn ) = Cn . It is elementary to see that such a curve is\nnecessarily of the form sn × P1 where sn ∈ Sn is a point. Thus Xn−1 ≃ Blsn Sn × P1\nand we conclude inductively that we are in the first case of Theorem 6.6.\n\u0003\n6.7. Lemma. Let A be a two-dimensional torus of algebraic dimension one, and let\nφ : X = P(E) → A be the projectivisation of a rank two vector bundle E. Suppose\nthat there exists a ramified endomorphism f : X → X and an étale endomorphism\ng : A → A of degree at least two such that g ◦ φ = φ ◦ f . If the algebraic dimension\nof X is one, then E is (up to étale cover) a direct sum of line bundles.\nProof. Let ψ : A → E be the algebraic reduction of the torus A, and denote\nby gE : E → E the endomorphism induced by g on E. Since X has algebraic\ndimension one, ψ ◦ φ is the algebraic reduction of X. Since f is ramified and g étale\nany effective divisor D ⊂ R maps surjectively onto A, in particular it is not a polar\ndivisor. Since there are only finitely many non-polar divisors [FF79, Thm.], we can\nsuppose (up to replacing f by some power) that f −1 (D) = D for every irreducible\ncomponent of D ⊂ R effective divisor on X.\nDenote by fD : D → D the restriction of f to some D ⊂ R. Since g ◦ φD = φD ◦ fD\nand g is étale of degree at least two, Proposition 2.14 shows that φD does not\nhave any higher-dimensional fibres. If φD is ramified, the branch locus ∆ ⊂ A\nis a finite union of curves such that g −1 (∆) = ∆. Yet this implies that gE is\nan automorphism, so A would be algebraic by Proposition 4.6. Thus φD is étale\nand D a torus. Arguing as in the proof of Lemma 6.5 we see that up to étale base\nchange, the ramification R has at least two irreducible components: one component\nD1 that is a φ-section and a second D2 that is an étale cover of A. Moreover the\nintersection with is empty since D1 ∩ D2 would be a bunch of curves such that\n−1\nfD\n(D1 ∩ D2 ) = D1 ∩ D2 . Once more Proposition 4.6 would then imply that\n1\nD1 ≃ A is algebraic. Thus up to making a second étale base change D2 → A,\nwe can suppose that φ has two disjoint sections. Thus E is a direct sum of line\nbundles.\n\u0003\n6.D. Proof of Theorem 1.3: algebraic dimension two.\n6.8. Theorem. Let X be a compact Kähler threefold of algebraic dimension two\nwhich is uniruled, and let f : X → X be a ramified endomorphism of degree d > 1.\nThen (up to étale cover) one of the following holds:\n34\n\n\f1.) X is a prodcut Y × P1 where Y is a surface of algebraic dimension one and\nf induces an automorphism on Y or\n2.) X is a projectivised bundle P(E) over a torus A of algebraic dimension one\nand f induces an endomorphism g of degree at least two on A.\n6.9. Remarks. 1. It is obvious that the list is effective: in the second case take\nX := A × P1 with A a torus of algebraic dimension one. The following example\nshows that in the second case X is in general not a product after étale cover.\nLet E be an elliptic curve without complex multiplication, and let L be a numerically trivial line bundle on E that is not torsion. By [Nak02, Prop.5] there exists\na ramified endomorphism h : P(OE ⊕ L) → P(OE ⊕ L) preservering the fibration\nsuch that P(OE ⊕ L) → E and inducing an endomorphism gE : E → E of degree\nat least two. Since End(E) ≃ Z it is clear that gE is of the form x 7→ nx + e for\nsome e ∈ E. Let now ψ : A → E be a torus of algebraic dimension one, and let\ng : A → A be the endomorphism x 7→ nx + a where a ∈ ψ −1 (e). Then we obviously\nhave gE ◦ ψ = ψ ◦ g.\nThe fibre product X := P(OE ⊕ L) ×E A is a P1 -bundle over A that is not a\nproduct, even after étale cover. An easy diagram chase shows that X admits\na ramified endomorphism f preserving the P1 -bundle structure and inducing the\nendomorphism g on A.\n\n2. One might also ask for a more precise classification of the vector bundle E in\nthe second case of the theorem: if A → B is the algebraic reduction of A, it is not\nhard to see E|Ab ≃ Lb ⊕ Lb ⊗ Tb , where Tb is a torsion line bundle on Ab . Since Lb\nand Tb might deform with b ∈ B, a further discussion is quite tedious and we leave\nit as an exercise to the interested reader.\nProof of Theorem 6.8. The rationally connected quotient is an almost holomorphic\nmap φ : X 99K S onto a compact Kähler surface of algebraic dimension one [CP00,\nThm.9.1].\nUp to replacing S by a bimeromorphic model, we may suppose that S is a relatively\nminimal elliptic surface ψ : S → C. Since a(S) = 1 there does not exist any curve\nin S that surjects onto C. The general fibre of ψ ◦ φ : X 99K C is uniruled, hence\nalgebraic, so ψ ◦ φ extends to a holomorphic map by Corollary 3.3.\nBy Proposition 2.9 there exists a meromorphic endomorphism g : S 99K S such that\ng ◦ φ = φ ◦ f . Thus by Proposition 2.12 there exists an endomorphism gC : C → C\nsuch that gC ◦ ψ = ψ ◦ g. Thus we get a commutative diagram\n\nψ◦φ\n\nf\n/X\nX✤\n✤\n✤φ\n✤φ\n✤\u000f\n✤\u000f\ng\n❴\n❴\n❴\n/\nS\nS\nψ\n\n\u000f\nC\n\nψ◦φ\n\nψ\ngC\n\n\u000f ~\n/C\n\n1st case. gC is not an automorphism. In this case the curve C is elliptic or P1 . We\ncan't have C ≃ P1 , since otherwise S is algebraic by Proposition 2.22. Thus C is\nelliptic and the endomorphism gC is étale. It follows by Lemma 2.15 that ψ ◦ φ is a\n35\n\n\fsubmersion. The general fibre Xc is uniruled and the base of its rationally connected\nquotient is an elliptic curve Sc = ψ −1 (c), so b1 (Xc ) = 2. Since ψ ◦ φ is smooth,\nthis implies that the rationally connected connected quotient of all the fibres is\na holomorphic fibration over an elliptic curve. Thus φ extends to a holomorphic\nmap and S is an elliptic bundle over the elliptic curve C. Since S is Kähler but\nnot algebraic, it follows from [BHPVdV04, V.5.B)] that S is a torus of algebraic\ndimension one. Thus the meromorphic endomorphism g : S 99K S extends to a\nholomorphic étale map of degree at least deg gC > 1. Thus by Proposition 2.14\nthe φ-singular locus ∆ is empty or a finite union of curves such that g −1 (∆) = ∆.\nSince S has algebraic dimension one, the irreducible components of ∆ are ψ-fibres.\n−1\nThus g −1 (∆) = ∆ implies gC\n(ψ(∆)) = ψ(∆). Since gC is étale, we see that ψ(∆)\n1\nis empty. Thus X is a P -bundle over the torus S and (up to another étale base\nchange) we are in the second case of Theorem 6.8.\n2nd case. gC is an automorphism. We will use Mori theory to discuss the structure\nof X: since X is uniruled it admits at least one contraction.\na) X admits a fibre type contraction. Since X contains only one covering family of rational curves and the rationally connected quotient is only defined up to\nbimeromorphic equivalence, we can suppose that the contraction is the rationally\nconnected quotient φ : X → S. Then X is a P1 - or conic bundle over the smooth\nsurface S (Theorem 3.5) which is an elliptic surface over C. Since φ is flat, the\nrigidity lemma implies that g extends to a holomorphic endomorphism g : S → S.\na1) g is not an automorphism. In this case S is a torus and admits an endomorphism g of degree at least two such that gC ◦ψ = ψ◦g. Since gC is an automorphism,\nProposition 4.6 implies that S is isogenous to a product of elliptic curves, a contradiction to a(S) = 1.\na2) g is an automorphism. .We claim that in this case the variety X admits a\nholomorphic elliptic fibration r : X → Y such that a(Y ) = 2, i.e. the algebraic\nreduction of X can be taken holomorphic.\nProof of the claim. Let M ⊂ S be an irreducible curve. By Kodaira's classification\nof fibres of elliptic fibrations, the normalisation M̃ → M is an elliptic or rational\ncurve. Set\nXM := φ−1 (M ),\nthen the general fibre of φM : XM → M is a P1 or two P1 's meeting transversally\nin a point. Moreover (up to replacing f by some power) the restriction of f to XM\ngives an endomorphism\nf M : XM → XM\n\nsuch that g|M ◦ φM = φM ◦ fM . Denote by X̃M → XM the normalisation and by\nφ̃M : X̃M → M the induced map, then fM lifts to an endomorphism f ̃M : X̃M →\nX̃M such that g|M̃ ◦ φ̃M = φ̃M ◦ f ̃M . The general fibre of φ̃M is a P1 or a disjoint\nunion of two P1 's and we denote by the same letter φ̃M : X̃M → M̃ ′ its Stein\nfactorisation. It is well-known that this new fibration is a P1 -bundle and M̃ ′ → M̃\nramifies exactly in the points where the φ-fibre is a double line. Since such a point\ngives a singular point of the discriminant locus ∆ ⊂ S and ∆ is necessarily contained\nin ψ-fibres, Kodaira's classification shows that there are at most two ramification\npoints. Thus we see that M̃ ′ is elliptic or rational.\n36\n\n\fThe P1 -bundle X̃M → M̃ ′ admits an endomorphism of degree at least two such\nthat the induced endomorphism on M̃ ′ is an automorphism (here we use that g\nis an automorphism). Thus by Amerik's theorem 2.16 there exists an étale cover\nE → M̃ ′ such that the fibre product X̃M ×M̃ ′ E is a product E × P1 and there exists\na finite group G acting diagonally on E × P1 such that X̃M = (E × P1 )/G. Thus\nthe projection on the second factor E × P1 → P1 induces a fibration rM : X̃M →\nP1 /G ≃ P1 . This fibration descends to a fibration XM → P1 : this is clear in the\ncomplement of the non-normal locus and the non-normal locus gives a section of\nX̃M → M̃ ′ , so by construction it is contracted by rM .\nThe construction of the algebraic reduction r is now obvious: let Y be the normalisation of the unique irreducible component of C(X) parametrising a general fibre\nof the algebraic reduction (the algebraic reduction is almost holomorphic by Thm.\n3.2, so this is well-defined). Let Γ → Y be the universal family over Y and denote\nby p : Γ → X the natural map. Then p is an isomorphism: it is sufficient to check\nthat the fibre over every point x ∈ X is a singleton, but this is obvious since x is\ncontained in some XM → P1 which realises Γ → Y \"locally\". This proves the claim.\nSince the endomorphism f preserves the algebraic reduction, we clearly have a\nmeromorphic map gY : Y 99K Y . We have constructed the variety Y as the normalisation of some component of C(X), thus we can identify gY generically to the\npush-forward of cycles f∗ . Since f∗ is a holomorphic map on the Chow scheme, we\nsee that gY extends to a holomorphic map. Since g is an automorphism, the endomorphism gY has degree at least two. By [CP00], there exists a fibration τ : Y → C,\nand it is easy to check that gC ◦ τ = τ ◦ gY . Since gC is an automorphism and Y\nis uniruled, we deduce by [Nak08, Lemma 6.1.1,(2)] that Y is a P1 -bundle over C.\nMoreover another application of Amerik's theorem shows that Y (after étale base\nchange) a product C ×P1 Thus the fibre product Y ×C S is a product S ×P1 and the\nendomorphisms g and gY induce an endomorphism f ′ : S × P1 → S × P1 of degree\nat least two. Since the space of endomorphisms of P1 is affine, we have f ′ = (g, h)\nwhere h : P1 → P1 is an endomorphism of degree at least two. By the universal\nproperty of the fibre product there exists a holomorphic map μ : X → S × P1 . We\nclaim that μ has degree one. Since\nb2 (X) = b2 (S) + 1 = b2 (S × P1 )\nit is obviously finite and therefore X ≃ S × P1 .\nProof of the claim. By construction we have a commutative diagram\nX\n\nμ\n\n/ S × P1\nf′\n\nf\n\n\u000f\n\u000f\nμ\n/ S × P1\nX❄\n❄❄\n11\n❄❄\n11\n1\n❄\n1\nφ ❄❄\npS\n\u001f |111\nS\nand we denote by M the branch locus of μ. A straightforward adaptation of Proposition 2.14 to the case of finite maps shows that f ′−1 (M ) = M . Since f = (g, h)\nwith h of degree at least two, the divisor M is of the form p−1\nS (D) for some divisor\n37\n\n\fD on S. In particular if s ∈ S is general point, the restricted map\nμ|φ−1 (s) : φ−1 (s) → s × P1\n\nis not ramified. Since P1 is simply connected and φ−1 (s) irreducible, the restriction\nμ|φ−1 (s) has degree one. This proves the claim.\nb) X admits a birational contraction ψ : X → X ′ . Denote by E the exceptional\ndivisor. Since the fibers of X → C are algebraic, the divisor E must be contained\nin some fiber Xc . Hence - at least after passing to some f k - we have f −1 (E) = E\nand E is not contained in the branch locus by Lemma 2.15. Thus by Corollary 3.9\nthe contraction ψ is the blow-up of a smooth curve C ′ ⊂ X ′ and X ′ is a compact\nKähler manifold. Thus we can proceed inductively and get a sequence\nX = X0 → X1 → . . . → Xn\n\nsuch that Xn is compact Kähler, admits an endomorphism fn : Xn → Xn of degree\nd and a fibre type contraction. By Case a) we know that Xn ≃ Sn × P1 . We can\nnow argue in the proof of Theorem 6.6 to see that X ≃ S × P1 .\n\u0003\nReferences\n[AKP08]\n\nMarian Aprodu, Stefan Kebekus, and Thomas Peternell. Galois coverings and endomorphisms of projective varieties. Math. Z., 260(2):431–449, 2008.\n[Ame03]\nEkaterina Amerik. On endomorphisms of projective bundles. Manuscripta Math.,\n111(1):17–28, 2003.\n[BDPP04]\nSébastien Boucksom, Jean-Pierre Demailly, Mihai Paun, and Thomas Peternell. The\npseudo-effective cone of a compact kähler manifold and varieties of negative Kodaira\ndimension. arxiv preprint, 0405285, 2004.\n[Bea01]\nArnaud Beauville. Endomorphisms of hypersurfaces and other manifolds. Internat.\nMath. Res. Notices, (1):53–58, 2001.\n[BHPVdV04] Wolf P. Barth, Klaus Hulek, Chris A. M. Peters, and Antonius Van de Ven. Compact\ncomplex surfaces, volume 4 of Ergebnisse der Mathematik und ihrer Grenzgebiete.\nSpringer-Verlag, Berlin, second edition, 2004.\n[BL99]\nChristina Birkenhake and Herbert Lange. Complex tori, volume 177 of Progress in\nMathematics. Birkhäuser Boston Inc., Boston, MA, 1999.\n[Bru06]\nMarco Brunella. A positivity property for foliations on compact Kähler manifolds.\nInternat. J. Math., 17(1):35–43, 2006.\n[Cam81]\nF. Campana. Coréduction algébrique d'un espace analytique faiblement kählerien\ncompact. Invent. Math. 63, pages 187–223, 1981.\n[Cam04]\nFrédéric Campana. Orbifolds, special varieties and classification theory: an appendix. Ann. Inst. Fourier (Grenoble), 54(3):631–665, 2004.\n[Cam06]\nFrédéric Campana. Isotrivialité de certaines familles kählériennes de variétés non\nprojectives. Math. Z., 252(1):147–156, 2006.\n[CP00]\nFrédéric Campana and Thomas Peternell. Complex threefolds with non-trivial holomorphic 2-forms. J. Algebraic Geom., 9(2):223–264, 2000.\n[CP04]\nFrédéric Campana and Thomas Peternell. Geometric stability of the cotangent bundle and the universal cover of a projective manifold. preprint arXiv 0405093, 2004.\n[Dem01]\nJean-Pierre Demailly. Multiplier ideal sheaves and analytic methods in algebraic\ngeometry. In School on Vanishing Theorems and Effective Results in Algebraic\nGeometry (Trieste, 2000), volume 6 of ICTP Lect. Notes, pages 1–148. Abdus\nSalam Int. Cent. Theoret. Phys., Trieste, 2001.\n[DP04]\nJean-Pierre Demailly and Mihai Paun. Numerical characterization of the Kähler\ncone of a compact Kähler manifold. Ann. of Math. (2), 159(3):1247–1274, 2004.\n[FF79]\nGerd Fischer and Otto Forster. Ein Endlichkeitssatz für Hyperflächen auf kompakten komplexen Räumen. J. Reine Angew. Math., 306:88–93, 1979.\n[FN05]\nYoshio Fujimoto and Noboru Nakayama. Compact complex surfaces admitting nontrivial surjective endomorphisms. Tohoku Math. J. (2), 57(3):395–426, 2005.\n38\n\n\f[FN07]\n\n[Fuj83]\n\n[Fuj88]\n[Fuj02]\n[GHS03]\n[Gun90]\n[Har77]\n[HM03]\n\n[KK83]\n\n[Kol91]\n[Kol96]\n[Nak87]\n\n[Nak02]\n[Nak08]\n[NZ07]\n[NZ09]\n\n[OP04]\n[Pet98]\n[Pet01]\n[Siu74]\n[Uen87]\n\nYoshio Fujimoto and Noboru Nakayama. Endomorphisms of smooth projective 3folds with nonnegative Kodaira dimension. II. J. Math. Kyoto Univ., 47(1):79–114,\n2007.\nAkira Fujiki. On the structure of compact complex manifolds in C. In Algebraic\nvarieties and analytic varieties (Tokyo, 1981), volume 1 of Adv. Stud. Pure Math.,\npages 231–302. North-Holland, Amsterdam, 1983.\nAkira Fujiki. Finite automorphism groups of complex tori of dimension two. Publ.\nRes. Inst. Math. Sci., 24(1):1–97, 1988.\nYoshio Fujimoto. Endomorphisms of smooth projective 3-folds with non-negative\nKodaira dimension. Publ. Res. Inst. Math. Sci., 38(1):33–92, 2002.\nTom Graber, Joe Harris, and Jason Starr. Families of rationally connected varieties.\nJ. Amer. Math. Soc., 16(1):57–67 (electronic), 2003.\nRobert C. Gunning. Introduction to holomorphic functions of several variables. Vol.\nII, Local theory. Wadsworth & Brooks/Cole, Monterey, CA, 1990.\nRobin Hartshorne. Algebraic geometry. Springer-Verlag, New York, 1977. Graduate\nTexts in Mathematics, No. 52.\nJun-Muk Hwang and Ngaiming Mok. Finite morphisms onto Fano manifolds of\nPicard number 1 which have rational curves with trivial normal bundles. J. Algebraic\nGeom., 12(4):627–651, 2003.\nLudger Kaup and Burchard Kaup. Holomorphic functions of several variables, volume 3 of de Gruyter Studies in Mathematics. Walter de Gruyter & Co., Berlin,\n1983.\nJános Kollár. Extremal rays on smooth threefolds. Ann. Sci. École Norm. Sup. (4),\n24(3):339–361, 1991.\nJános Kollár. Rational curves on algebraic varieties, volume 32 of Ergebnisse der\nMathematik und ihrer Grenzgebiete. 3. Folge. Springer-Verlag, Berlin, 1996.\nNoboru Nakayama. The lower semicontinuity of the plurigenera of complex varieties.\nIn Algebraic geometry, Sendai, 1985, volume 10 of Adv. Stud. Pure Math., pages\n551–590. North-Holland, Amsterdam, 1987.\nNoboru Nakayama. Ruled surfaces with non-trivial surjective endomorphisms.\nKyushu J. Math., 56(2):433–446, 2002.\nNoboru Nakayama. On complex normal projective surfaces admitting nonisomorphic surjective endomorphisms. preprint, available on the web, 2008.\nNoboru Nakayama and De-Qi Zhang. Polarized endomorphisms of complex normal\nvarieties. RIMS preprint, 1613, 2007.\nNoboru Nakayama and De-Qi Zhang. Building blocks of étale endomorphisms of\ncomplex projective manifolds. arxiv preprint, to appear in Proceeding of the London\nMathematical Society, 2009.\nKeiji Oguiso and Thomas Peternell. The dual Kähler cone of compact Kähler threefolds. Comm. Anal. Geom., 12(5):1131–1154, 2004.\nThomas Peternell. Towards a Mori theory on compact Kähler threefolds. II. Math.\nAnn., 311(4):729–764, 1998.\nThomas Peternell. Towards a Mori theory on compact Kähler threefolds. III. Bull.\nSoc. Math. France, 129(3):339–356, 2001.\nYum Tong Siu. Analyticity of sets associated to Lelong numbers and the extension\nof closed positive currents. Invent. Math., 27:53–156, 1974.\nKenji Ueno. On compact analytic threefolds with nontrivial Albanese tori. Math.\nAnn., 278(1-4):41–70, 1987.\n\nAndreas Höring, Université Paris 6, Institut de Mathématiques de Jussieu, Equipe de\nTopologie et Géométrie Algébrique, 175, rue du Chevaleret, 75013 Paris, France\nE-mail address: hoering@math.jussieu.fr\nThomas Peternell, Mathematisches Institut, Universität Bayreuth, 95440 Bayreuth,\nGermany\nE-mail address: thomas.peternell@uni-bayreuth.de\n39\n\n\f"}