{"id": "http://arxiv.org/abs/0810.5346v3", "guidislink": true, "updated": "2009-04-13T07:42:40Z", "updated_parsed": [2009, 4, 13, 7, 42, 40, 0, 103, 0], "published": "2008-10-29T20:49:19Z", "published_parsed": [2008, 10, 29, 20, 49, 19, 2, 303, 0], "title": "Where in the String Landscape is Quintessence", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0810.0895%2C0810.5564%2C0810.5245%2C0810.0878%2C0810.2456%2C0810.2086%2C0810.0629%2C0810.0975%2C0810.3867%2C0810.1403%2C0810.2528%2C0810.3858%2C0810.5565%2C0810.4242%2C0810.2018%2C0810.3200%2C0810.5346%2C0810.2679%2C0810.1635%2C0810.4497%2C0810.3819%2C0810.5205%2C0810.3496%2C0810.0609%2C0810.1969%2C0810.2106%2C0810.3907%2C0810.3074%2C0810.2087%2C0810.3631%2C0810.5316%2C0810.5529%2C0810.2951%2C0810.2133%2C0810.5303%2C0810.2925%2C0810.0194%2C0810.3885%2C0810.1981%2C0810.0620%2C0810.1387%2C0810.1475%2C0810.5101%2C0810.2620%2C0810.4864%2C0810.3186%2C0810.5023%2C0810.2665%2C0810.0134%2C0810.0507%2C0810.4691%2C0810.3923%2C0810.3597%2C0810.2496%2C0810.3764%2C0810.2588%2C0810.1691%2C0810.2371%2C0810.0214%2C0810.1648%2C0810.0137%2C0810.3903%2C0810.5138%2C0810.2630%2C0810.5481%2C0810.2319%2C0810.4244%2C0810.0578%2C0810.2185%2C0810.5416%2C0810.3727%2C0810.2711%2C0810.5279%2C0810.1116%2C0810.0491%2C0810.3804%2C0810.5243%2C0810.4583%2C0810.3206%2C0810.0897%2C0810.4815%2C0810.2985%2C0810.4643%2C0810.0212%2C0810.3464%2C0810.0327%2C0810.2100%2C0810.0743%2C0810.1276%2C0810.5742%2C0810.2425%2C0810.0687%2C0810.0820%2C0810.4433%2C0810.4048%2C0810.1314%2C0810.4049%2C0810.5625%2C0810.5149%2C0810.0354%2C0810.3377&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Where in the String Landscape is Quintessence"}, "summary": "We argue that quintessence may reside in certain corners of the string\nlandscape. It arises as a linear combination of internal space components of\nhigher rank forms, which are axion-like at low energies, and may mix with\n4-forms after compactification of the Chern-Simons terms to 4D due to internal\nspace fluxes. The mixing induces an effective mass term, with an action which\n{\\it preserves} the axion shift symmetry, breaking it spontaneously after the\nbackground selection. With several axions, several 4-forms, and a low string\nscale, as in one of the setups already invoked for dynamically explaining a\ntiny residual vacuum energy in string theory, the 4D mass matrix generated by\nrandom fluxes may have ultralight eigenmodes over the landscape, which are\nquintessence. We illustrate how this works in simplest cases, and outline how\nto get the lightest mass to be comparable to the Hubble scale now, $H_0 \\sim\n10^{-33} {\\rm eV}$. The shift symmetry protects the smallest mass from\nperturbative corrections in field theory. Further, if the ultralight eigenmode\ndoes not couple directly to any sector strongly coupled at a high scale, the\nnon-perturbative field theory corrections to its potential will also be\nsuppressed. Finally, if the compactification length is larger than the string\nlength by more than an order of magnitude, the gravitational corrections may\nremain small too, even when the field value approaches $M_{Pl}$.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0810.0895%2C0810.5564%2C0810.5245%2C0810.0878%2C0810.2456%2C0810.2086%2C0810.0629%2C0810.0975%2C0810.3867%2C0810.1403%2C0810.2528%2C0810.3858%2C0810.5565%2C0810.4242%2C0810.2018%2C0810.3200%2C0810.5346%2C0810.2679%2C0810.1635%2C0810.4497%2C0810.3819%2C0810.5205%2C0810.3496%2C0810.0609%2C0810.1969%2C0810.2106%2C0810.3907%2C0810.3074%2C0810.2087%2C0810.3631%2C0810.5316%2C0810.5529%2C0810.2951%2C0810.2133%2C0810.5303%2C0810.2925%2C0810.0194%2C0810.3885%2C0810.1981%2C0810.0620%2C0810.1387%2C0810.1475%2C0810.5101%2C0810.2620%2C0810.4864%2C0810.3186%2C0810.5023%2C0810.2665%2C0810.0134%2C0810.0507%2C0810.4691%2C0810.3923%2C0810.3597%2C0810.2496%2C0810.3764%2C0810.2588%2C0810.1691%2C0810.2371%2C0810.0214%2C0810.1648%2C0810.0137%2C0810.3903%2C0810.5138%2C0810.2630%2C0810.5481%2C0810.2319%2C0810.4244%2C0810.0578%2C0810.2185%2C0810.5416%2C0810.3727%2C0810.2711%2C0810.5279%2C0810.1116%2C0810.0491%2C0810.3804%2C0810.5243%2C0810.4583%2C0810.3206%2C0810.0897%2C0810.4815%2C0810.2985%2C0810.4643%2C0810.0212%2C0810.3464%2C0810.0327%2C0810.2100%2C0810.0743%2C0810.1276%2C0810.5742%2C0810.2425%2C0810.0687%2C0810.0820%2C0810.4433%2C0810.4048%2C0810.1314%2C0810.4049%2C0810.5625%2C0810.5149%2C0810.0354%2C0810.3377&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We argue that quintessence may reside in certain corners of the string\nlandscape. It arises as a linear combination of internal space components of\nhigher rank forms, which are axion-like at low energies, and may mix with\n4-forms after compactification of the Chern-Simons terms to 4D due to internal\nspace fluxes. The mixing induces an effective mass term, with an action which\n{\\it preserves} the axion shift symmetry, breaking it spontaneously after the\nbackground selection. With several axions, several 4-forms, and a low string\nscale, as in one of the setups already invoked for dynamically explaining a\ntiny residual vacuum energy in string theory, the 4D mass matrix generated by\nrandom fluxes may have ultralight eigenmodes over the landscape, which are\nquintessence. We illustrate how this works in simplest cases, and outline how\nto get the lightest mass to be comparable to the Hubble scale now, $H_0 \\sim\n10^{-33} {\\rm eV}$. The shift symmetry protects the smallest mass from\nperturbative corrections in field theory. Further, if the ultralight eigenmode\ndoes not couple directly to any sector strongly coupled at a high scale, the\nnon-perturbative field theory corrections to its potential will also be\nsuppressed. Finally, if the compactification length is larger than the string\nlength by more than an order of magnitude, the gravitational corrections may\nremain small too, even when the field value approaches $M_{Pl}$."}, "authors": ["Nemanja Kaloper", "Lorenzo Sorbo"], "author_detail": {"name": "Lorenzo Sorbo"}, "author": "Lorenzo Sorbo", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevD.79.043528", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0810.5346v3", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0810.5346v3", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "8 pages RevTeX; added references, matches published version", "arxiv_primary_category": {"term": "hep-th", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "hep-th", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "gr-qc", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "hep-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0810.5346v3", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0810.5346v3", "journal_reference": "Phys.Rev.D79:043528,2009", "doi": "10.1103/PhysRevD.79.043528", "fulltext": "Where in the String Landscape is Quintessence\nNemanja Kaloper∗\nDepartment of Physics, University of California, Davis, CA 95616, USA\n\nLorenzo Sorbo†\n\narXiv:0810.5346v3 [hep-th] 13 Apr 2009\n\nDepartment of Physics, University of Massachusetts, Amherst, MA 01003, USA\n(Dated: October 23, 2018)\nWe argue that quintessence may reside in certain corners of the string landscape. It arises as a\nlinear combination of internal space components of higher rank forms, which are axion-like at low\nenergies, and may mix with 4-forms after compactification of the Chern-Simons terms to 4D due to\ninternal space fluxes. The mixing induces an effective mass term, with an action which preserves\nthe axion shift symmetry, breaking it spontaneously after the background selection. With several\naxions, several 4-forms, and a low string scale, as in one of the setups already invoked for dynamically\nexplaining a tiny residual vacuum energy in string theory, the 4D mass matrix generated by random\nfluxes may have ultralight eigenmodes over the landscape, which are quintessence. We illustrate\nhow this works in simplest cases, and outline how to get the lightest mass to be comparable to the\nHubble scale now, H0 ∼ 10−33 eV. The shift symmetry protects the smallest mass from perturbative\ncorrections in field theory. Further, if the ultralight eigenmode does not couple directly to any sector\nstrongly coupled at a high scale, the non-perturbative field theory corrections to its potential will\nalso be suppressed. Finally, if the compactification length is larger than the string length by more\nthan an order of magnitude, the gravitational corrections may remain small too, even when the field\nvalue approaches MP l .\nPACS numbers: 98.80.-k, 95.36.+x, 11.25.Mj\n\nThe experimental discovery that the universe is dominated by a dark energy, which comprises over 2/3 of\nits mass contents, has had profound impact both in cosmology and in the quest for the microscopic theory of\nnature. In recent years it has stimulated a remarkable\nconvergence of the inflationary paradigm and string theory. The emerging idea of the origins of our universe\nis based on the concept of a 'string landscape' [1, 2, 3],\nthe myriad of consistent string vacua distinguished by\nspecific values of moduli, which is populated by the selfreproduction mechanism of eternal inflation. Some of its\ncorners, this framework posits, may yield big hospitable\nuniverses as our own.\nA particularly important aspect of the landscape approach to describing our universe is how it addresses the\ncosmological constant problem. The idea is that the cosmological constant varies over the landscape, just like any\nother low energy Lagrangian parameter of the theory. It\ncan change by nucleation of membranes [5], charged under a locally constant 4-form field whose flux compensates bare vacuum energy [6, 7]. The membranes are\nnucleated during inflation, and in some regions of the\ndynamical landscape may yield a nested system of vacuum bubbles with the vacuum energy inside the bubbles\nchanging across the system of boundaries. Bousso and\nPolchinski have shown [6] how a mechanism, generalizing the earlier proposal by Linde [4] and by Brown and\nTeitelboim [5], can be embedded in string theory, in a\n\n∗ kaloper@physics.ucdavis.edu\n† sorbo@physics.umass.edu\n\nway which yields a set of states with different charges,\nbut only a tiny difference between their vacuum energy\ndensities, due to incommensurability of the membrane\ncharges sourcing the 4-forms. They have outlined specific requirements for the corner of the landscape with\nstates where this vacuum energy mismatch is comparable\nto the residual vacuum energy that would explain current cosmological observations, Λ ∼ 10−12 eV4 . Bousso\nand Polchinski then showed that the random dynamics\nof successive membrane emissions during inflation can\ntake the system somewhere in space to a state with so\nminiscule a vacuum energy, with a large last jump which\nleft enough room for a stage of a slow roll inflation to\nrefill the universe with matter. This then set the stage\nfor the anthropic resolution of the cosmological constant,\nchampioned by Weinberg [8], Linde [9] and Vilenkin [10].\nThis explanation fits the observations, and emerges\nfrom the idea of string landscape. Its immediate prediction which could in principle be falsified, is that the dark\nenergy equation of state is w = −1. In fact such was the\ndearth of reasonable explanations of vacuum energy that\ncould be embedded in string theory, that it has been suggested that the dark energy models with local dynamics,\nsuch as quintessence, are an unnecessary digression [11].\nGiven the obstacles for accommodating accelerating cosmologies in string theory, both conceptual [12, 13, 14] and\npractical [15], it might have indeed seemed that seeking\nfor a serious candidate for quintessence, which really [41]\ndwells in string theory is in vain.\nThe aim of this article is to argue this is not so. On\nthe contrary, a mild extension of the arguments employed\nin the Bousso-Polchinski proposal for relaxing the vacuum energy, by ingredients already present in the land-\n\n\f2\nscape framework, yields a candidate low energy theory of\nquintessence [42]. The key role is played by internal components of higher rank forms. These fields are axion-like\nat low energies, after compactification. In the presence\nof internal fluxes in orthogonal subspaces they will mix\nwith residual 4-forms after compactification due to the\ntrilinear Chern-Simons terms, where – as is usual – we\nassume that the dilatonic volume moduli are all stabilized. The mixing generates an axion mass term while\npreserving the axion shift symmetry of the action, which\nis broken spontaneously once the background solution is\nchosen [16]. When there are more axions, which couple\nto more 4-forms in 4D, the axion mass matrix generated\nby random fluxes may have ultralight eigenmodes over\nthe landscape, if the string scale is low, as invoked by\nBousso and Polchinski in one of the implementations of\ntheir mechanism. The reason for the smallness of the\nmass is, roughly, similar to why there may be a small\njump in the absolute value of the cosmological constant\nbetween subsequent local vacua, arising from a small mismatch between the charges of different form fields. We\nillustrate this with explicit examples with few axions and\n4-forms, that can come about if the internal manifold has\nmultiple higher rank forms, as in e.g. type IIB theories.\nEvaluating the mass eigenvalues, we show that the lightest mass can be comparable to the Hubble scale now,\nH0 ∼ 10−33 eV. In this case, the theory has low string\nscale, Ms ∼ few × 10 TeV, and two large dimensions,\nL ∼ 0.1 mm, just like in the simplest large dimensions\nscenario of [17, 18]. The quintessence mass is protected\nfrom perturbative corrections in field theory by the shift\nsymmetry of the axion effective action. If the ultralight\neigenmode does not couple directly to any sector strongly\ncoupled at a high scale, the non-perturbative field theory\ncorrections to its potential are also suppressed. Moreover, when the compactification length is larger than the\nstring length, the gravitational corrections may remain\nsmall too even when the field value approaches MP l , exceeding the effective axion width constant fa and yielding\na very curvy potential. When this happens, the nonperturbative potential is negligible, leaving the residual flat\npotential generated only by the form fields. While it is\nnot yet clear that the low energy Standard Model cohabitates with quintessence in this precise corner of the\nlandscape, it is at least possible to find it in various type\nIIB compactifications [18, 19, 20, 21]. Since the mechanism which we illustrate is quite generic, it may appear\nin places where the Standard Model lurks.\nLet us now review the dynamics of axions coupled to\nforms. Start with the simplest case of a single axion\nmixing with a single 4-form, via a term ∼ φǫμνλσ Fμνλσ .\nThe action, which includes minimal coupling to gravity,\nconsistent with the assumption that all volume moduli\nare stabilized, is composed of bulk and membrane terms.\nThe bulk term is\nSbulk =\n\nZ\n\n√\nd x g\n4\n\n\u0012\n\nMP2 l\n1\n1 2\nR − (∇φ)2 − Fμνλσ\n+\n2\n2\n48\n\n+\n\n\u0013\nμ ǫμνλσ\nφ √ Fμνλσ + . . . ,\n24\ng\n\n(1)\n\nwhere the ellipsis refer to the matter sector contributions,\nand ǫμνλσ is the Levi-Civita tensor density, as indicated\nby the explicit factor of metric determinant. The 4-form\nfield strength is the antisymmetric derivative of the 3form potential Fμνλσ = 4 ∂[μ Aνλσ] . The parameter μ has\ndimension of mass, as required to correctly normalize the\nbilinear φǫμνλσ Fμνλσ . In dimensional reduction μ is the\nflux through compact dimensions, as we will see later.\nThe membrane term includes the standard coupling to\nthe 3-form potential,\nZ\n√\ne\n(2)\nd3 ξ γeabc ∂a xμ ∂b xν ∂c xλ Aμνλ ,\nSbrane ∋\n6\nwhere the integration is over the membrane woldvolume\nξ a with induced metric γab . We have absorbed numerical factors in the membrane charge e, which is normalized to the membrane tension, and may be renormalized\nby internal volume factors if the membrane is actually\na higher-dimensional p-brane which wraps some of the\ncompact dimensions, with more details below. The membrane action also includes the membrane kinetic terms,\nor equivalently, the boundary terms for bulk fields which\nensure that the membrane is embedded along woldvolumes which respect canonical bulk boundary conditions.\nThese terms are the Gibbons-Hawking term for gravity,\nand its analogue\nfor the 4-form [22, 23]. When μ = 0\nR\n√\nthis term is d4 x g 61 ∇μ (F μνλσ Aνλσ ) with our normalizations. However, when μ 6= 0, an extra contribution,\nR\nμνλσ\n√\n− d4 x g 61 ∇μ (μφ ǫ √g Aνλσ ) must be added. When μ\nvanishes, in 4D the 4-form is non-propagating: because\nit is completely antisymmetric, its field equations are locally trivial in the bulk, and its value locally constant.\nIn the presence of membranes, however, the 4-form can\nchange between interior and exterior of the membrane,\njumping across its surface. Indeed, setting μ = 0 and\nvarying (1)-(2) with respect to Aμνλ yields\n∇μ F μνλσ = 0 , in the bulk ,\n(3)\n√\n∆Fμνλσ = e gǫμνλσ , across the membrane . (4)\nThus the 4-form is locally indistinguishable from a (positive) contribution to the cosmological constant, which\ncan be reduced by membrane emission in the interior of\nthe membrane.\nThere are important differences when μ 6= 0. As already noted in [16], although still without local propagating modes in this case the 4-form is not locally constant. Instead, it is proportional to the scalar field φ,\nwhich mixes with it, and so it may vary from place to\nplace. In turn, the scalar field is massive: the 4-form\nbackground provides an inertia to the scalar's propagation, which by local Lorentz invariance translates into\nthe scalar mass term. Once the background is selected,\nand the value of the 4-form locked to that of φ, the\n\n\f3\nshift symmetry is broken spontaneously, with the vacuum selection [16]. Still, at the level of the action it remains operative, as can be seen readily from (1): under\nφ → φ+φ0 , the action changes only by a total derivative,\nand so the local dynamics remains invariant. In fact, although this total derivative could affect the membrane\naction (2), it gets completely cancelled on any physical\nmembrane term by the variation of the boundary term\nR\nμνλσ\n√\n− d4 x g 61 ∇μ (μφ ǫ √g Aνλσ ), possibly leaving only a\nboundary term at infinity. So actually the theory retains\nfull shift symmetry in the action.\nThese statements can be simply verified by working\nexplicitly in the action. We can integrate out the 4form, because it remains an auxiliary field even when\nμ 6= 0, since it is fully determined by φ and an integration constant. This integration constant can be recovered\nby the Lagrange multiplier method [24]: first, we recast\n(1) in the first order formalism, enforcing the relation\nFμνλσ = 4∂[μ Aνλσ] with a Lagrange multiplier. Because\nof antisymmetry, it takes only one multiplier q, and the\nresult is to add the term\nZ\n\u0011\nq μνλσ \u0010\nǫ\nSq = d4 x\nFμνλσ − 4∂μ Aνλσ\n(5)\n24\n\nto the action (1). Then we can complete the squares\nin Fμνλσ introducing the new variable F̃μνλσ = Fμνλσ −\n√\ngǫμνλσ (q + μφ). The action only depends on F̃μνλσ\nthrough F̃ 2 , which therefore yields a Gaussian functional\nintegral and can be dropped as an overall normalization\nof the partition function. This effectively replaces the 4form with its Hodge dual, and enforces the 4-form equation of motion as a constraint. The end result is the\neffective action describing the φ − q sector coupled to\ngravity\n\u0012 2\nZ\nMP l\n1\n1\n√\nR − (∇φ)2 − (q + μφ)2 +\nSef f =\nd4 x g\n2\n2\n2\n\u0013\nμνλσ\n1ǫ\n(6)\n+\n√ Aνλσ ∂μ q ,\n6\ng\n\nwhere the last term was obtained from an integration by\nparts, and its total derivative completely cancels against\nμνλσ\nthe membrane terms 16 ∇μ [(F μνλσ − ǫ √g μφ)Aνλσ )] after\n\nthe shift to the new variable F̃μνλσ . The charge term (2)\nthen still remains, as it controls the global dynamics of\nthe field q. Locally, this field is a constant, as is clear\nfrom (1) upon variation with respect to the 3-form Aμνλ ,\nwhich yields ∂q = 0. In the presence of a membrane,\nhowever, the membrane term (2) acts as a source for ∂q,\nand shows that it jumps in the direction along the normal\nto the membrane,\n∆q|~n = e .\n\n(7)\n\nThis reproduces the boundary condition for the 4-form\n(4) in the dual formulation of (6).\nFrom (6) it is immediately clear that φ is massive, with\nμ being precisely its mass. The 4-form in the bulk yields\n\nan effective potential V = 21 (q + μφ)2 instead of the pure\ncosmological constant contribution 21 q 2 . In spite of the\nφ-dependent potential, the shift symmetry φ → φ + φ0 is\nnot explicitly broken in the action. Indeed, the variation\nof φ is compensated by the shift of the 'field' q according\nto q → q − μφ0 , such that both the bulk action (6) and\nthe membrane term remain unchanged! On the other\nhand, once the vacuum is picked by selecting the solution q = q0 , specified by the membrane sources in the\nspacetime, the shift symmetry is broken spontaneously,\nand the field φ is massive. In the φ-vacuum, φ = −q0 /μ,\nthe 4-form contribution to the vacuum energy is completely cancelled by the scalar field contribution. Hence\nif the mass μ is large, greater than the Hubble scale of\nthe universe, the field φ will rapidly roll to the minimum\nof the potential preventing the 4-form that it mixes with\nfrom participating in the neutralization of the vacuum\nenergy. This could be averted if the axion φ picks up\nadditional potential terms which stabilize it near φ = 0,\ncounteracting the mixing effects and possibly explicitly\nbreaking shift symmetry. Clearly, if this does not occur,\nonly the forms which do not mix with any heavy axions\ncan play a role in the cosmological adjustment of the vacuum energy. In what follows, therefore, we will assume\nthe existence of both forms which do, and which don't\nmix with axions.\nThe unbroken shift symmetry in the action (6) implies\nthat a massive field φ retains a protective mechanism\nin perturbation theory which prevents radiative corrections to its mass. Indeed, φ will couple to other matter\nonly derivatively, and so radiative corrections generated\nthrough those couplings will not shift the mass term away\nfrom the value induced by the mixing with the 4-form,\nas it is the only perturbative term of dimension 2. Further, since the 4-form remains auxiliary in 4D even when\nμ 6= 0, it does not involve local dynamics that can change\nthe scalar mass in the framework of 4D EFT. Thus as far\nas perturbation theory is concerned, once μ is set, it stays\nput on a fixed background.\nThat does not imply that the mass μ is an absolute\nconstant. As we have already noted, in the context\nof dimensional reduction, which one expects to lead to\nactions like (1), the parameter μ is an internal form\nflux. Let us illustrate this. Consider a simple dimensional reduction of the 4-form sector in 11D SUGRA,\non a background which factorizes as a 4D spacetime, a\nthree-torus and a four-torus, M4 × T 3 × T 4 , and take the\n3-form potential A with components Aμνλ (xσ ) in M4 ,\nAabc (xσ ) on T 3 , and Âijk (y l ). So, the potential on the\nthree-torus depends only on the spacetime coordinates,\nwhereas the potential on the four-torus is independent of\nthe spacetime location. For the components of F = dA,\nthe field equations are d∗ F = 21 F ∧ F , where the 3form potential A is dimensionless, with\n11D form\nR the\n9\n∗\naction normalized to S4 f orm ∼ M11\nF ∧ F + . . .,\nwith M11 the 11D Planck mass. Substituting our 3form Ansatz first yields ∇i F ijkl = 0, which implies that\nFijkl = μǫijkl on the four-torus. Then, after straight-\n\n\f4\nforward manipulation, defining φ = Aabc , and introP lφ\nducing canonically normalized 4D fields φ = VM3 M\n3 ,\n11\n\nand Fμνλσ = M√P2l 4∂[μ Aνλσ] , the remaining equations\n√\nreduce to ∇2 φ = μ g4 ǫμνλσ F μνλσ and ∇μ Fμνλσ =\n√\nμ g4 ǫμνλσ ∂ μ φ, where the mass parameter μ is exactly\nthe internal four-torus magnetic flux of Fijkl , up to possibly a combinatorial factor of O(1). These are precisely\nthe variational equations which follow from (1). Hence\nindeed (1) can be interpreted as a truncation of 11D\nSUGRA, if all other moduli are stabilized. In fact, there\nare string theory constructions where such low energy dynamics are known to arise [25, 26]. This also shows that\nthe 4D axion mass μ can change if the magnetic flux in\nthe internal dimensions changes, for example by membrane nucleation. Indeed, if a membrane charged under\nFijkl is nucleated, inside the bubble of space enveloped\nby it the flux, and consequently also the axion mass, will\nchange, to μ′ = μ − e. In other words, the parameter\nμ is completely analogous to the variable q which we introduced in the dual formulation of the 4-form action\n(6). Just like the vacuum energy, the low energy dynamics of the axion will also be controlled by very different\nscales in different regions of the Metauniverse, when it\nis permeated by the many bubbles formed by membrane\nnucleations [1, 6, 27, 28] (other aspects of eternal inflation were discussed in [29]). Inflation will ensure that at\nlow energies the universe will in fact be composed of a\ndiverse set of regions with vastly different values of the\naxion mass.\nClearly, the mass can change in discrete steps. However, an even stronger statement holds: the mass μ is in\nfact quantized in the effective 4D theory, just like any\n4-form flux. The elegant discussion of this issue is presented by Bousso and Polchinski [6]. The point is that the\nclassical integration constant which arises in the solution\nfor the 4-form field strength, Fijkl = μ̂ǫijkl can only take\ndiscrete values, quantized in the units of the membrane\ncharge. The argument which shows this is similar to the\nDirac string construction, and is most readily understood\nfrom the viewpoint of the higher-dimensional parent theory, where all the 4-form field strengths are sourced by\nmembranes or fivebranes. Thus, with our normalization,\nthe quantities q and μ̂ should be viewed as the integer\nmultiples qi of the appropriate membrane charges [43],\ne11\nqi = ni √ ,\nZi\n\n(8)\n\nwhere Zi are the internal volume factors which depend\n3\non the dilatonic moduli, and e11 = 2πM11\nis the fundamental membrane charge, normalized to the 11D Planck\nmass M11 . For the electric forms these factors are\n9\nZe = 2πM11\nV7 = MP2 l /2, while for magnetic forms they\nare Zm,i =\n\n3\n2πM11\nV7\n2\nV3,i\n\n=\n\n2\nMP\nl\n6 V2\n2M11\n3,i\n\n[6]. Although these quan-\n\ntization rules were nominally derived in the absence of\nmixing counterterms which arise from the reduction of\nthe Chern-Simons action, they remain valid in the limit\nof thin membranes, because for continuos field configu-\n\nrations the integrals of the products of A and F over the\nthin membrane vanish. For the specific application to the\ncase of interest to us, since μ is the charge of a magnetic\n4-form, these formulas give\n3\nμ = 2π n V3 M11\n\n\u0010M\n\n11\n\nMP l\n\n\u00112\n\nM11 .\n\n(9)\n\nThe change of μ when a membrane of unit charge is emit\u0010\n\u00112\nM11\n3\nted is ∆μ ∼ V3 M11\nM11 , and is clearly the smallMP l\nest when the internal three-torus volume is comparable to\n3\nthe 11D Planck scale, V3 M11\n∼ 1. The numerical lower\nbound can be easily estimated by recalling that M11 may\n> M\nbe as low as the electroweak scale, M11 ∼\nEW ∼ TeV,\n> 10−16 eV. Clearly, in this case\nwhich implies that ∆μ ∼\nthe four-torus volume V4 must be large in the units of\nM11 to give the hierarchically large MP l , but to get there\n−1\none needs linear dimensions to exceed M11\nby a factor\n7.5\nof ∼ 10 .\nBy itself, this is not sufficient to make φ a quintessence\nfield. In the regions of the smallest mass μmin ∼ ∆μ,\nthe field φ would fall out of slow roll in the very early\nuniverse, when the temperature is of the order of T ∼\np\n∆μ/H0 Kelvin ∼ 108 Kelvin, or around the time of nucleosynthesis. Curiously, this is close to the mass required for a pseudoscalar which could affect supernovae\ndimming, if it coupled to ordinary electromagnetism, as\nexplained in [30]. On the other hand, as Bousso and\nPolchinski noted, the scale which one gets from a single\nscalar is also too coarse to provide a plausible mechanism\nfor gradual relaxation of vacuum energy. To address this,\nthey pointed out that parametrically much smaller differences between vacuum energies of different states may be\nengineered in multi-form frameworks. There, form fields\nwith incommensurate charges give rise to vacua with very\ndifferent form charges, but tiny variation of the net vacuum energy. Note, however, that the problem with the\nsimple setup above is purely numerical: getting the mass\nto be as small as the current value of the Hubble scale.\nWithout it, one finds a perfectly reasonable agent for\ndriving cosmic acceleration at a higher scale: an inflaton. We hope to revisit this interesting avenue elsewhere\n[31].\nWe now argue that multi-field setups also yield small\nnet masses for at least one of the axions. So, imagine\nthat the low energy theory contains several copies of the\naxion-form sector in (1), or (6). Such cases may occur in,\nfor example, multi-throat compactifications, where at low\nenergies there is replication of degrees of freedom. Since\nthe throats connect to the bulk of the internal Calabi-Yau\nmanifold, the wavefunctions of fields residing in different\nthroats have an overlap. The kinetic terms for the axions\nand 4-forms can be separately rotated to the orthogonal,\ncanonical form, leaving us with mixed coupling terms.\nSimilar mixing terms will arise from direct compactifications of higher-dimensional theories with more higherrank forms, such as type IIB string theory. In general,\nthe low energy action found in such constructions will\n\n\f5\ngain the form\nScouplings =\n\nZ\n\nd4 x\n\nX\n\na\nμab ǫμνλσ Fμνλσ\nφb .\n\n(10)\n\na,b\n\nThe matrix μab is the mixing matrix between different\nforms and axions, and in general it needs not even be\nsquare. The low energy axion mass matrix is related to\nμab . It can be obtained quickly by employing the same\ntrick we used to get (6). So, rewrite the action with\nseveral axion-form sectors in the first order formalism\nintroducing a Lagrange multiplier for each 4-form. Then\nintegrate out the 4-forms. The action which remains is\nZ\n1X\nMP2 l\n√\nR−\n(∇φb )2 +\n(11)\nSef f =\nd4 x g\n2\n2\nb\n!\n1X a X\nǫμνλσ X a\nb 2\na\n−\n(q +\nμab φ ) + √\nA\n∂μ q ,\n2 a\n6 g a νλσ\n\nwhere gs = eφ is the string coupling, 2κ210 = (2π)7 α′4\nis given in terms of the string scale α′ , H3 = dB2 and\nF3 = dC2 the NS and KR 3-form field strengths and\n2-form potentials. Similarly, F5 = dC4 are the 5-form\nfield strength and 4D-form potential, which define the\nself-dual 5-form F̃5 = F5 − 21 C2 ∧ H3 + 21 F3 ∧ B2 where\n∗\nF̃5 = F̃5 . Assuming that the volume moduli are all stabilized by additional ingredients in the theory, and ignoring their dynamics hereafter, reduce (13) to 4D by using\nthe consistent truncation of the form sector by using\n√\n√\n1\nFμνλσ\n= MP l F̃μνλσ 5 / 2 , φ1 = MP l B47 / 6gs ,\n√\n√\n2\nFμνλσ\n= MP l F̃μνλσ 6 / 2 , φ2 = MP l B48 / 6gs , (14)\n√\n√\n3\nFμνλσ\n= MP l F̃μνλσ 7 / 2 , φ3 = MP l B49 / 6gs ,\nwhere all of these fields are taken to depend on the 4D\ncoordinates xμ , and the 3-forms with internal fluxes only,\nFijk = (2π)2 α′\n\nb\n\nand so the axion mass matrix is\nX\nMbc =\nμab μac .\n\n(12)\n\n(15)\n\nwhere (i, j, k) take values in the set\n\na\n\nIf we choose to normalize the matrix μab to a selected\nscale μ0 = μ/n of Eq. (9), on the assumption that this\nis the smallest such scale in the construction, the matrix\nμab /μ0 is a dimensionless matrix. The diagonal entries\nare given by the combinatorial factors times the internal\nflux in the units of μ0 , following our discussion leading to\n(9), whereas the off-diagonal entries measure the coupling\nof different sectors. For example, in throaty compactifications they are controlled by the ratio of the CalabiYau volume VCY to the throat volume Vthroat . Their\nprecise numerical value will depend on the details of the\nconstruction, and one expects them to be adjustable parameters depending on where the volume moduli are stabilized. In fact, some of the numerical tunings may be\nmitigated with more degrees of freedom. Specifically, if\nthe mixing matrix entries arise due to independent internal fluxes, they are multiples of combinatorial factors\nand possibly large integers. In the phase lattice of such\na space, there will be points where some of the eigenvalues are very small, even when the individual matrix\nelements are much larger than unity, similarly to what occurs in the cosmological constant adjustment of Bousso\nand Polchinski. To be able to say more about such examples, we need to consider a more detailed setup.\nA simple example is provided by the case with three\naxions and three 4-forms, but also eight 3-forms with internal space fluxes, in type IIB theory. The action for the\nbosonic sector of type IIB supergravity is, in the Einstein\nframe, and ignoring the dilaton kinetic terms on the assumption that the dilaton is stabilized,\n\u0012\nZ\n1\n1\n1\n10 √\nSIIB =\nd x g R − gs−1 H32 − gs F32 +\n2κ210\n12\n12\n\u0013\nZ\n1\n1 2\n+ 2\n−\nF̃\nF5 ∧ B2 ∧ F3 ,\n(13)\n240 5\n4κ10\n\nnijk\n,\nLi Lj Lk\n\n{(5, 6, 8), (5, 6, 9), (5, 7, 8), (5, 7, 9),\n(5, 8, 9), (6, 7, 8), (6, 7, 9), (6, 8, 9)} ,\n\n(16)\n\nnijk are the units of flux in Fijk in the directions parameterized by (i, j, k) and Li are the sizes of the dimensions\nsupporting the Fijk flux. One can check directly that\n(15) obey the form field equations following from (13),\nand so this truncation is consistent, if the volume moduli are stabilized. Clearly, there are other possibilities\nfrom truncations similar to the one displayed here, starting with a trivial exchanging of dimensions used here\nfor those which were ignored. We leave the general case\naside, to be addressed in future work, since this one example is sufficient for illustrative purpose. The dimensionally reduced 4D effective Lagrangian becomes\nSef f =\n\nZ\n\n3\n\n1X\n√ M2\nd4 x g ( P l R −\n(∇φb )2 +\n2\n2\n\n(17)\n\nb=1\n\n\n3\n3\n1 X a \u00012\n1 ǫμνλσ X\na\n−\nF\n+\nμab Fμνλσ\nφb  .\n√\n48 a=1 μνλσ\n24\ng\na,b=1\n\nLet us now choose four of the compact\ndimensions to be\n√\nstring scale, L4 = . . . = L7 = 2πα′ , and two√to be\nlarger than the string scale: L8 = L9 = L ≫ 2πα′ .\nFurther, let us pick the fluxes such that n589 = −n689 =\n−1, n579 = n568 = n − 1, n569 = n578 = n679 = −n and\nn678 = n + 1. Then, the mixing matrix μ becomes\n!\nε2\nnε\n(n + 1)ε\n\u0010 \u0011\n2\nμ0 ,\n(18)\nnε\nμab = ε (n − 1)ε\n0\nnε\n(n − 1)ε\nq\n√\ns\nwhere μ0 = 3πg\n2πα′ /L. The eigenvalues\n2α′ and ε =\nof the mass matrix M = μT μ are the roots λ = m2 /μ20\n\n\f6\nof the cubic P3 (λ) = λ3 − 6n2 ε2 λ2 + 8n2 ε4 λ − ε8 (where\nwe have kept only the leading terms in the limit ε ≪ 1,\nn ≫ 1). Since the matrix M is real-symmetric, the characteristic polynomial must have three real roots. To find\nthe smallest one, one could in principle use the Cardano\nformulas for the roots of a cubic [32]. However, a quicker\nmethod is to inspect the graph of P3 and realize that\ndue to the signs of the four terms, the smallest root is\ni) positive and ii) controlled by the cancellation between\nthe linear term and the constant. In the limit n ≫ 1\nand ε ≪ 1 which we are interested in, the smallest of the\nthree roots is\nm2min ≃\n\nε4 2\n3π 3 gs α′ 1\nμ\n≃\n.\n0\n8n2\n4L4 n2\n\n(19)\n\nSince it is positive, there are no tachyons in the spectrum. In fact, this should have been expected all along,\nsince we know that we can rewrite the action (18) in the\nform (12), where the potential is a sum of squares, implying that none of the mass eigenmodes are tachyonic. As a\nmatter of fact, the other two roots, by a similar reasoning\n> ε2 μ2 and m2 > n2 ε2 μ2 , beyielding (19), will obey m2 ∼\n0\n0\n∼\ning determined by a different interplay of the terms in the\ncubic. Thus, they may also end up being parametrically\nsmaller than μ0 . We can now use both small ε and small\n1/n to render mmin much lighter than μ0 . However, we\ncan't make n as large as we wish, since the internal fluxes\nafter dimensional reduction contribute to the effective 4D\ncosmological constant, as Λ4 ∋ gs F32 . In fact, if we take\nthe correct UV cutoff of the effective IIB SUGRA to be\nset by the string scale, above which we need full string\n1\n<\ndynamics, we should require that gs F32 ∼\n2πα′ . Evaluating the flux for our truncation and substituting in this\nformula, we find\nL2\n1\n<\n≃\n.\nn2 ∼\n2\n2\n24π ε gs\n48π 3 α′ gs\n\n(20)\n\nUsing the Gauss law relating 4D Planck mass, the string\nscale and the compactification volume, MP2 l = V6 /κ210 ,\nyields L2 = 16π 5 MP2 l α′2 , and therefore\nm2min ≃\n\n3gs\n1 >\n9gs2\n.\n∼\n4\n210 π 7 MP l α′3 n2\n210 π 9 MP6 l α′4\n\n(21)\n\nHence for consistency, mmin cannot be dialed down below\nthe lower bound in Eq. (21). On the other hand, this\nmode will be quintessence as long as mmin < H0 . For\nthis to be possible, we need to ensure that the string\ncoupling is smaller than the critical value\n\u0010 eV \u00112 \u0010 M \u00112\n32 9/2 3 ′2\nPl\nπ MP l α H0 ≃ 10−2\n,\n3\nMs\nMs\n(22)\nwhere Ms is the string scale. Now, to ensure that we get\nreasonable 4D phenomenology, with MP l ∼ 1018 GeV,\nand 4D gravity valid down to millimeter distances, we\n< 0.1 mm, which implies M > few ×\nneed to take L ∼\ns ∼\n10 TeV. This also guarantees that it is easy to stay in the\ngs\n\n∗\n\n=\n\n< 1\nregime where type IIB is perturbative, since then gs ∗ ∼\nand so we can take any gs < 1. In fact, we can take gs ∼\n10−3 which will guarantee that the higher-dimensional\nPlanck mass is somewhat greater than the string scale,\nM10 ∼ Ms /gs . For these parameters, somewhere in the\nlandscape of the theory spanned by the volume moduli\nand internal fluxes, n will fall in the right regime for the\n< H , so that it could remain\nlightest axion mass to be ∼\n0\nin slow roll until throughout the cosmic history to date.\nSo far, we have neglected the issue of nonperturbative corrections to the low energy action from gauge\nand gravitational sectors. In fact, although the shift\nsymmetry provides protection to the axion from perturbative corrections arising from matter that axion couples to, it is explicitly broken by nonperturbative effects. These\ninstanton-induced effective potentials,\nP yield\n4\nVef f ∼\nn λn cos(2nφ/fφ ), where fφ is the axion decay constant, and λn are dynamically generated scales\nin the instanton expansion, typically related to the UV\ncutoff via λ1 ∼ M e−α/g and with λn>1 < λ1 (see, e.g.\n[33, 34]). In QCD, λ1 happens to be the QCD scale\nΛQCD , but there are examples where it can be vastly different from a characteristic scale of the low energy theory\nwhose gauge sector yields the potential. Now, in string\ntheory it is very difficult to obtain large axion decay con> M . On the other hand, in much\nstants obeying fφ ∼\nPl\nof the quintessence model building, such scales are nec> M\nessary, since i) the axion vev needs to be ∼\nP l in order\nto yield at least an efold of late acceleration, and ii) the\npotential must remain flat enough for this to occur, so\nthat the higher order terms in the Fourier series for Vef f\n> M . In the case we have\nremain negligible for all φ ∼\nPl\ndescribed (and in contrast to the more usual models of\naxion quintessence, such as those discussed e.g. in [35]),\nthe instanton terms aren't needed to get the axion mass!\nIndeed, even if fφ < MP l , and the higher order terms\naren't negligible, as long as λ4n < m2min fφ2 the instanton\nmass term is small compared to the mass term induced by\nthe mixing with 4-forms. So to have a working candidate\nquintessence, one needs not only to select the right region\nin the landscape, but also to carefully pick the couplings\nof the lightest axion to the matter sector. Yet, this is, at\nleast in principle, a problem which is often encountered\nin the landscape model building, and presumably can be\naddressed.\nSimilar concerns arise when one encounters gravitational effects [44]. These effects also yield effective potentials given by harmonic series, but with coefficients proportional to the exponential of instanton action. When\nwe compactify the theory with dimensions which are\nlarger than the fundamental scale, the actions will rapidly\ngrow in the units of the string length. In fact, taking the\ninternal dimensions to only exceed the fundamental scale\nby one order of magnitude will yield actions of the order\nof S ∼ 10d where d is the number of compact dimensions.\nEnsuring this is O(1000) or more will render the relevant\nnormalization factors small enough to be ignored in the\nreckoning with dark energy.\n\n\f7\nOur discussion so far has centered on the existence\nof an ultralight axion quintessence. Once it's there, how\ndoes it actually come to be dark energy at late times? As\nin the Bousso-Polchinski scenario, most of the bare vacuum energy in our part of the inflating metaverse should\nbe cancelled by the 4-forms which do not mix with the\naxions. For this purpose, one needs to have a number\nof such forms in order to ensure that the bare vacuum\nenergy in some states can be cancelled with the precision set by the value of the allowed vacuum energy now,\n10−12 eV4 . When the string scale is very low, this can be\naccomplished with O(10) form fields [6]. In the course\nof cosmic evolution of our universe, the membranes are\nemitted during inflation, eventually reducing the net vacuum energy inside the sequence of inflating bubbles down\nto the presently acceptable value. Part of the effective\nvacuum energy may also come from the fluxes of the 4forms which do mix with the axions. Further, in the\nvery least the light axions will thermally drift around\nover their domain of definition, and will certainly not\nrest in the low energy vacua. In fact, the low energy\nvacua may not even be defined yet, as their actual location is set by the background 4-form fluxes, which may\nyet change by membrane emission, as is clear from Eqs.\n(12), (18). Indeed,\nfor the axion multiP\nP the potential\nplet is Vef f = 12 a (q a + b μab φb )2 . After diagonalization, the lightest direction has the effective potential\nVlightest = 12 m2min (φ + qef f /mmin )2 , where qef f is a linear combination of the 4-form fluxes which mix with the\naxions. Both qef f and φ may scan their full range of al2\n2\n2\nlowed values [45]. Generally, qef\nf ≫ MP l H0 , and so a\npart of Vef f will still be cancelled by the forms which do\nnot mix with the axions. It is then sufficient that in some\ninflating bubbles the final state vacuum energy, involving this linear combination and the additional, unmixed\n> M . The residual\n4-forms, acquires φ + qef f /mmin ∼\nPl\n2\n2\nvacuum energy can be MP l H0 and the field will sit in\nslow roll to the present time, suspended on the shallow\npotential set by mmin , with the right value to become\nthe dominant component of dark energy now, and provide an efold or so of accelerated expansion as required\nby observations. Note, that as the field eventually rolls\nto its minimum φ = −qef f /mmin and compensates the\n4-form contribution to the vacuum energy, the leftover\n\nvacuum energy might be negative. This means that the\nuniverse could collapse in a distant future, realizing a\nscenario discussed in [9, 38, 39].\nIn sum, in this work we have argued that the string\nlandscapes may naturally accommodate degrees of freedom which can play role of quintessence. These modes\nare components of higher-dimensional forms, which mix\nwith 4-forms in 4D theory after compactification. For\nlow string scale, and large extra dimensions, there may\nbe sufficiently light axions which can be quintessence\n< H ∼ 10−33 eV, that come about\nnow, with masses m ∼\n0\nthanks to incomplete cancellations between large fluxes\nof forms much like in the mechanism for canceling vacuum energy of [6]. The axion shift symmetry protects the\nquadratic potential against quantum contributions, guaranteeing the flatness of the potential and the absence of\nan η problem. We have provided an explicit example\nusing type IIB theory on a space with two large dimensions and string scale ∼ few × 10 TeV, where we assumed\nthe volume moduli to be stabilized. While so far such\ncompactifications haven't seemed exactly realistic from\nthe point of view of low energy particle physics, there\nis an effort underway searching for type IIB compactifications with only two large dimensions [40]. Moreover,\nthe main ingredients of the mechanism are sufficiently\ngeneric that they may arise in other setups too. It would\nbe interesting to search for the corners of the landscape\nwhere the Standard Model may coexist with quintessence\nmodes. Further, it is also interesting to classify more\nprecisely cosmological signatures of the quintessence dynamics, as it may accommodate discretely variable mass\ndue to membrane emission. We hope to return to these\nissues elsewhere.\n\n[1] L.\nSusskind,\ne-Prints\narXiv:hep-th/0302219;\narXiv:hep-ph/0406197.\n[2] S. Kachru, R. Kallosh, A. Linde and S. P. Trivedi,\nPhys. Rev. D 68, 046005 (2003); S. Kachru, R. Kallosh,\nA. Linde, J. M. Maldacena, L. P. McAllister and\nS. P. Trivedi, JCAP 0310, 013 (2003).\n[3] M. R. Douglas and S. Kachru, Rev. Mod. Phys. 79, 733\n(2007); F. Denef, M. R. Douglas and S. Kachru, Ann.\nRev. Nucl. Part. Sci. 57, 119 (2007).\n[4] A. D. Linde, Rept. Prog. Phys. 47, 925 (1984).\n[5] J. D. Brown and C. Teitelboim, Phys. Lett. B 195, 177\n\n(1987); Nucl. Phys. B 297, 787 (1988).\n[6] R. Bousso and J. Polchinski, JHEP 0006, 006 (2000).\n[7] J. L. Feng, J. March-Russell, S. Sethi and F. Wilczek,\nNucl. Phys. B 602, 307 (2001).\n[8] S. Weinberg, Phys. Rev. Lett. 59, 2607 (1987).\n[9] A.D. Linde, in: Three hundred years of gravitation,\n(Eds.: Hawking, S.W. and Israel, W., Cambridge Univ.\nPress, 1987), 604-630.\n[10] A. Vilenkin, Phys. Rev. Lett. 74, 846 (1995).\n[11] R. Bousso, Gen. Rel. Grav. 40, 607 (2008).\n[12] E. Witten, arXiv:hep-ph/0002297.\n\nAcknowledgements\nWe would like to thank Savas Dimopoulos, Shamit\nKachru, Fernando Quevedo and Alessandro Tomasiello\nfor valuable discussions. LS thanks the UC Davis HEFTI\nprogram for hospitality during the inception of this work.\nThe work of NK is supported in part by the DOE Grant\nDE-FG03-91ER40674. The work of LS is partially supported by the U.S. National Science Foundation grant\nPHY-0555304.\n\n\f8\n[13] T. Banks, arXiv:hep-th/0007146.\n[14] S. Hellerman, N. Kaloper and L. Susskind, JHEP 0106,\n003 (2001); W. Fischler, A. Kashani-Poor, R. McNees\nand S. Paban, JHEP 0107, 003 (2001).\n[15] J. M. Maldacena and C. Nunez, Int. J. Mod. Phys. A 16,\n822 (2001).\n[16] G. R. Dvali and A. Vilenkin, Phys. Rev. D 64, 063509\n(2001); Phys. Rev. D 70, 063501 (2004); G. Dvali, Phys.\nRev. D 74, 025018 (2006); arXiv:hep-th/0507215.\n[17] N. Arkani-Hamed, S. Dimopoulos and G. R. Dvali, Phys.\nLett. B 429, 263 (1998).\n[18] I. Antoniadis, N. Arkani-Hamed, S. Dimopoulos and\nG. R. Dvali, Phys. Lett. B 436, 257 (1998).\n[19] I. Antoniadis and B. Pioline, Nucl. Phys. B 550, 41\n(1999).\n[20] G. Aldazabal, L. E. Ibanez, F. Quevedo and\nA. M. Uranga, JHEP 0008, 002 (2000).\n[21] S. Cullen, M. Perelstein and M. E. Peskin, Phys. Rev. D\n62, 055012 (2000).\n[22] M. J. Duff, Phys. Lett. B 226, 36 (1989).\n[23] M. J. Duncan and L. G. Jensen, Nucl. Phys. B 336, 100\n(1990); Nucl. Phys. B 361, 695 (1991).\n[24] N. Kaloper, Phys. Lett. B 320, 16 (1994).\n[25] C. Beasley and E. Witten, JHEP 0207, 046 (2002).\n[26] S. Kachru and A. K. Kashani-Poor, JHEP 0503, 066\n(2005).\n[27] A. D. Linde, In *Cambridge 1982, Proceedings,\nThe Very Early Universe*, 205-249; PRINT-82-0554CAMBRIDGE; Phys. Lett. B 175, 395 (1986); Mod.\nPhys. Lett. A 1, 81 (1986).\n[28] J. F. Donoghue, JHEP 0008, 022 (2000).\n[29] P. J. Steinhardt, in The Very Early Universe, eds:\nG. W. Gibbons, S. W. Hawking, and S. T. C. Siklos (Cambridge University Press, 1983), pp. 251–266;\nA. Vilenkin, Phys. Rev. D 27, 2848 (1983).\n[30] C. Csaki, N. Kaloper and J. Terning, Phys. Rev. Lett.\n88, 161302 (2002); Phys. Lett. B 535, 33 (2002); Annals\nPhys. 317, 410 (2005).\n\n[31] N. Kaloper and L. Sorbo, Phys. Rev. Lett. 102, 121301\n(2009).\n[32] http://en.wikipedia.org/wiki/Cubic polynomial#Cardano.27s\nmethod\n[33] T. Banks, M. Dine, P. J. Fox and E. Gorbatov, JCAP\n0306, 001 (2003).\n[34] S. Dimopoulos, S. Kachru, J. McGreevy and\nJ. G. Wacker, JCAP 0808, 003 (2008).\n[35] P. Svrcek, arXiv:hep-th/0607086; P. Svrcek and E. Witten, JHEP 0606, 051 (2006) [arXiv:hep-th/0605206].\n[36] L. Smolin, Phys. Lett. B 93, 95 (1980); A. D. Linde,\nPhys. Lett. B 202, 194 (1988).\n[37] E. Silverstein and A. Westphal, arXiv:0803.3085 [hep-th].\n[38] G. N. Felder, A. V. Frolov, L. Kofman and A. V. Linde,\nPhys. Rev. D 66, 023507 (2002); R. Kallosh, J. Kratochvil, A. Linde, E. V. Linder and M. Shmakova, JCAP\n0310, 015 (2003).\n[39] J. Garriga, A. Linde and A. Vilenkin, Phys. Rev. D 69,\n063521 (2004).\n[40] M. Cicoli,\nC. P. Burgess and F. Quevedo,\narXiv:0808.0691 [hep-th].\n[41] Here, we mean a quintessence model which really comes\nfrom string theory, as opposed to various \"stringy motivated\" suggestions.\n[42] Upon the completion of this work, Fernando Quevedo\nhas informed us of another example of candidate for\nquintessence which he argued for in several recent talks.\n[43] The generation of a quadratic potential for the axion with\ndiscrete values of q is discussed in detail, in the context\nof 11-dimensional sugra, in [25].\n[44] Perturbative graviton loop effects remain fully under\ncontrol as they can only yield terms ∼ m2min R and\n2\n4\n∼ Vef\nf /MP l which remain tiny even for large values of\nthe scalar field vev [36].\n[45] Examples of fields φ defined over a large domain, > MP l ,\nin string theory were provided recently in [37].\n\n\f"}