{"id": "http://arxiv.org/abs/1002.1448v2", "guidislink": true, "updated": "2010-05-20T14:59:36Z", "updated_parsed": [2010, 5, 20, 14, 59, 36, 3, 140, 0], "published": "2010-02-07T13:19:47Z", "published_parsed": [2010, 2, 7, 13, 19, 47, 6, 38, 0], "title": "FRW cosmology in Milgrom's bimetric theory of gravity", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1002.1222%2C1002.3617%2C1002.3198%2C1002.4291%2C1002.4953%2C1002.3067%2C1002.4222%2C1002.3742%2C1002.0831%2C1002.3039%2C1002.4878%2C1002.0100%2C1002.3532%2C1002.0167%2C1002.3790%2C1002.1965%2C1002.4176%2C1002.3935%2C1002.2795%2C1002.2013%2C1002.4366%2C1002.4276%2C1002.2501%2C1002.1443%2C1002.2360%2C1002.2858%2C1002.1281%2C1002.3004%2C1002.2188%2C1002.1051%2C1002.2368%2C1002.0361%2C1002.3500%2C1002.2498%2C1002.2176%2C1002.0692%2C1002.3661%2C1002.1705%2C1002.2799%2C1002.3676%2C1002.1398%2C1002.1215%2C1002.1411%2C1002.1233%2C1002.2525%2C1002.0387%2C1002.1997%2C1002.0847%2C1002.1653%2C1002.0730%2C1002.0576%2C1002.3260%2C1002.2599%2C1002.3030%2C1002.3635%2C1002.2026%2C1002.1448%2C1002.2744%2C1002.0386%2C1002.0003%2C1002.1505%2C1002.1580%2C1002.2775%2C1002.0189%2C1002.1319%2C1002.2265%2C1002.4050%2C1002.2355%2C1002.2122%2C1002.3485%2C1002.0156%2C1002.3933%2C1002.4383%2C1002.4093%2C1002.0282%2C1002.0684%2C1002.0136%2C1002.1770%2C1002.3400%2C1002.4523%2C1002.4305%2C1002.4247%2C1002.2186%2C1002.1471%2C1002.3761%2C1002.3402%2C1002.2323%2C1002.2233%2C1002.1823%2C1002.1631%2C1002.4503%2C1002.0910%2C1002.1268%2C1002.1978%2C1002.2797%2C1002.1328%2C1002.2262%2C1002.3861%2C1002.4295%2C1002.4632%2C1002.1901&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "FRW cosmology in Milgrom's bimetric theory of gravity"}, "summary": "We consider spatially homogeneous and isotropic Friedmann-Robertson-Walker\n(FRW) solutions of Milgrom's recently proposed class of bimetric theories of\ngravity. These theories have two different regimes, corresponding to high and\nlow acceleration. We find simple power-law matter dominated solutions in both,\nas well as solutions with spatial curvature, and exponentially expanding\nsolutions. In the high acceleration limit these solutions behave like the FRW\nsolutions of General Relativity, with a cosmological constant term that is of\nthe correct order of magnitude to explain the observed accelerating expansion\nof the Universe. We find that solutions that remain in the high acceleration\nregime for their entire history, however, require non-baryonic dark matter\nfields, or extra interaction terms in their gravitational Lagrangian, in order\nto be observationally viable. The low acceleration regime also provides some\nscope to account for this deficit, with solutions that differ considerably from\ntheir general relativistic counterparts.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1002.1222%2C1002.3617%2C1002.3198%2C1002.4291%2C1002.4953%2C1002.3067%2C1002.4222%2C1002.3742%2C1002.0831%2C1002.3039%2C1002.4878%2C1002.0100%2C1002.3532%2C1002.0167%2C1002.3790%2C1002.1965%2C1002.4176%2C1002.3935%2C1002.2795%2C1002.2013%2C1002.4366%2C1002.4276%2C1002.2501%2C1002.1443%2C1002.2360%2C1002.2858%2C1002.1281%2C1002.3004%2C1002.2188%2C1002.1051%2C1002.2368%2C1002.0361%2C1002.3500%2C1002.2498%2C1002.2176%2C1002.0692%2C1002.3661%2C1002.1705%2C1002.2799%2C1002.3676%2C1002.1398%2C1002.1215%2C1002.1411%2C1002.1233%2C1002.2525%2C1002.0387%2C1002.1997%2C1002.0847%2C1002.1653%2C1002.0730%2C1002.0576%2C1002.3260%2C1002.2599%2C1002.3030%2C1002.3635%2C1002.2026%2C1002.1448%2C1002.2744%2C1002.0386%2C1002.0003%2C1002.1505%2C1002.1580%2C1002.2775%2C1002.0189%2C1002.1319%2C1002.2265%2C1002.4050%2C1002.2355%2C1002.2122%2C1002.3485%2C1002.0156%2C1002.3933%2C1002.4383%2C1002.4093%2C1002.0282%2C1002.0684%2C1002.0136%2C1002.1770%2C1002.3400%2C1002.4523%2C1002.4305%2C1002.4247%2C1002.2186%2C1002.1471%2C1002.3761%2C1002.3402%2C1002.2323%2C1002.2233%2C1002.1823%2C1002.1631%2C1002.4503%2C1002.0910%2C1002.1268%2C1002.1978%2C1002.2797%2C1002.1328%2C1002.2262%2C1002.3861%2C1002.4295%2C1002.4632%2C1002.1901&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We consider spatially homogeneous and isotropic Friedmann-Robertson-Walker\n(FRW) solutions of Milgrom's recently proposed class of bimetric theories of\ngravity. These theories have two different regimes, corresponding to high and\nlow acceleration. We find simple power-law matter dominated solutions in both,\nas well as solutions with spatial curvature, and exponentially expanding\nsolutions. In the high acceleration limit these solutions behave like the FRW\nsolutions of General Relativity, with a cosmological constant term that is of\nthe correct order of magnitude to explain the observed accelerating expansion\nof the Universe. We find that solutions that remain in the high acceleration\nregime for their entire history, however, require non-baryonic dark matter\nfields, or extra interaction terms in their gravitational Lagrangian, in order\nto be observationally viable. The low acceleration regime also provides some\nscope to account for this deficit, with solutions that differ considerably from\ntheir general relativistic counterparts."}, "authors": ["Timothy Clifton", "Thomas G. Zlosnik"], "author_detail": {"name": "Thomas G. Zlosnik"}, "author": "Thomas G. Zlosnik", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevD.81.103525", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1002.1448v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1002.1448v2", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "12 pages", "arxiv_primary_category": {"term": "astro-ph.CO", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph.CO", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "gr-qc", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1002.1448v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1002.1448v2", "journal_reference": "Phys.Rev.D81:103525,2010", "doi": "10.1103/PhysRevD.81.103525", "fulltext": "FRW cosmology in Milgrom's bimetric theory of gravity\nTimothy Clifton1∗ and Thomas G. Zlosnik2†\n1\n\n2\n\nDepartment of Astrophysics, University of Oxford, UK.\nPerimeter Institute of Theoretical Physics, Waterloo, Canada.\n\narXiv:1002.1448v2 [astro-ph.CO] 20 May 2010\n\n(Dated: May 21, 2010)\nWe consider spatially homogeneous and isotropic Friedmann-Robertson-Walker (FRW) solutions\nof Milgrom's recently proposed class of bimetric theories of gravity. These theories have two different\nregimes, corresponding to high and low acceleration. We find simple power-law matter dominated\nsolutions in both, as well as solutions with spatial curvature, and exponentially expanding solutions.\nIn the high acceleration limit these solutions behave like the FRW solutions of General Relativity,\nwith a cosmological constant term that is of the correct order of magnitude to explain the observed\naccelerating expansion of the Universe. We find that solutions that remain in the high acceleration\nregime for their entire history, however, require non-baryonic dark matter fields, or extra interaction\nterms in their gravitational Lagrangian, in order to be observationally viable. The low acceleration\nregime also provides some scope to account for this deficit, with solutions that differ considerably\nfrom their general relativistic counterparts.\nPACS numbers: 98.80.jk, 04.20.Jb, 04.50.Kd\n\nI.\n\nINTRODUCTION\n\nA natural way to extend General Relativity is via the\nintroduction of a second dynamical rank 2 metric tensor\nfield, ĝab . The so called 'bimetric' theories that result\nhave a rich phenomenology (see, for example, [1–4]), and\na long history [5–7]. They represent an application to\ngravity of the Yang-Mills approach to gauge theories, and\nallow for new and interesting behaviour.\nA new class of these theories has recently been introduced by Milgrom [8, 9], in which the interaction term\nbetween the two metric fields is constructed from a tensor defined as the difference of the connections associated\nwith each of them. The stated purpose of this approach\nis to produce a weak-field limit of the form\n∇2 Ψ − ∇ * [f (l|∇ΨN |) ∇ΨN ] = 4πGρ,\n\n(1)\n\nwhere ΨN obeys ∇2 ΨN = 4πGρ, and where time-like\ntest particles obey a force law ẍ ∼ −∇Ψ. Here Ψ is a\ngravitational potential, f (x) is a function to be specified,\nρ is the energy density and l is a constant with units of\nlength. The existence of gravitational fields of this type\nwould be of considerable interest for astrophysics [10, 11],\nand the goal of producing a viable relativistic formulation\nfor theories of this kind has been pursued for some time\n[12–20].\nLet us now try to understand why a relativistic formulation of (1) is so important. If we associate an energymomentum tensor, Tab , with the right-hand side of (1),\nthen\nρ = Tab na nb ,\n\n∗ tclifton@astro.ox.ac.uk\n† tzlosnik@perimeterinstitute.ca\n\n(2)\n\nwhere na is the unit vector normal to surfaces of constant\nt. Energy-momentum conservation then tells us that test\nparticles follow geodesics of the metric with respect to\nwhich Tab is covariantly conserved. For a perturbed metric of the form\nds2 = −(1 + 2Ψ)dt2 + (1 − 2Φ)δij dxi dxj\n\n(3)\n\nthis corresponds to ẍ ∼ −∇Ψ, as required. In order to\ngain a set of field equations that are invariant with respect to coordinate transformations, and that reduce to\n(1) for the metric (3), we must now construct a tensor\nquantity that can be associated with the left-hand side of\n(1). We immediately encounter a problem though: The\nquantity |∇Ψ| cannot be formed from any local curvature invariants of (3) alone. One may alternatively try\nand recover (1) from nonlocal functions of the space-time\ncurvature [21]. However, such attempts have prompted a\nno-go theorem [22] regarding the phenomenological viability of all theories that are constructed from the spacetime geometry and matter fields only. New structure is\ntherefore required, beyond a single space-time metric.\nIn the absence of a relativistic theory that is well motivated by other considerations, and that reduces to (1) in\nthe appropriate limit, it is not clear what this additional\nstructure should be. We are then left without any way\nof knowing when (1) should be considered valid, or when\nwe should prefer, for example, a Newtonian description.\nWe can, however, use observations of relativistic effects\nbeyond Newtonian order to gain insight. In this regard,\ncosmological solutions provide us with a very useful probe\nas they express the full non-linearity of the relativistic\nfield equations. Motivated by this, as well as the desire\nto understand further the cosmological consequences of\nbimetric theories of gravity in general, we consider here\nthe FRW solutions of Milgrom's class of bimetric theories.\nOf course, for any theory of gravity to be considered\n\n\f2\nviable it is now the case that it should be able to reproduce all of the major probes of observational cosmology.\nThese include the anisotropies in the cosmic microwave\nbackground, the matter power spectrum on large scales,\nHubble diagrams that extend out to z ∼ 1, as well as the\nratios of light elements from primordial nucleosynthesis.\nAll of these require a detailed knowledge of FRW cosmology (as well as of cosmological perturbation theory, in the\ncase of the first two). It is not our goal here to perform\nan exhaustive study of all of these areas, but rather to\nmake a solid first step in understanding the underlying\nFRW solutions, and what they imply.\nThe article proceeds as follows. In Section II we describe the theory and its field equations. The general\nform of the theory allows considerable flexibility, and so\nin Section III we discuss and motivate the specific versions of the theory that we will consider. In Section IV we\nfind the field equations in space-times with FRW symmetries, and discuss their solutions in Section V. In Section\nVI we discuss the degree to which current probes of cosmology can constrain these models, and in Section VII\nwe conclude.\nII.\n\nFIELD EQUATIONS\n\nThe theory we are considering has two metrics, gab and\nĝab . The action for the gravitational part of Milgrom's\ntheory can be written in terms of these two tensor fields\nas\nI = Ig + Iĝ + Iint ,\n\n(4)\n\nwhere Qadbcef is built from gab and ĝab , and l is a constant\nwith dimensions of length. In terms of these quantities\nwe can then write1\nZ\n√\n2\n−gσM(Q)d4 x,\nIint = 2\n(11)\nl\nwhere M(Q) and σ = σ(κ) are functions to be specified,\nand κ = (g/ĝ)1/4 .\nIn Appendix A we find the field equations for gab can\nbe written as\nβGab + Sab = 8πGTab\nwhere\nh\n\u0011i\n\u0010\nc\nc\nSab = 2 σMQ J(ab) + J(a b) − J cab\n\n;c\n\nδQgdhcef\n+2σMQ\nδg ab\n\nIĝ\n\n√\n−gRd4 x\n\nZ p\n−ĝR̂d4 x\n= α\n\n(5)\n(6)\n\nare the Einstein-Hilbert terms for gab and ĝab , and Iint\nis an interaction term between them. In the equations\nabove R is the Ricci scalar constructed from gab , and R̂\nis the Ricci scalar constructed from ĝab .\nIn Milgrom's theory the interaction term, Iint , is specified as a function of scalars formed from the rank-3 tensor\nC abc = Γabc − Γ̂abc ,\n\n(7)\n\nwhere Γabc and Γ̂abc are the metric connections of gab\nand ĝab , respectively, such that\ngab;c = 0\nĝab:c = 0,\n\n(8)\n(9)\n\nwhere ; and : indicate covariant derivatives constructed\nfrom Γabc and Γ̂abc . The general form of scalars that are\nquadratic in C abc can then be written as\nQ = l2 Qadbcef C abc C def ,\n\n(10)\n\nσ(1 + n)\nMgab ,\nl2\n\nαĜab + Ŝab = 8πGT̂ab\n\n(13)\n\nwhere\n\u0011i\nh n+1\n\u0010\n(ef )\nŜab = −2 σ n MQ 2J(a ĝ b)f − Jd cf (ĝ −1 )de ĝca ĝf b\n\n:e\n\n+2σ\nIg = β\n\nC ghc C def −\n\nand Gab and Tab are the Einstein tensor and the energymomentum tensor, defined with respect to gab in the\nusual way. We have also used the notation MQ ≡\ndM/dQ and Jd ef ≡ Qadbcef C abc , and taken σ = κ2n .\nSimilarly, the field equations for ĝab are found to be\n\nwhere\nZ\n\n(12)\n\nn+1\nn\n\nMQ\n\nδQydzcef\nδĝ ab\n\nC yzc C def +\n\nσ\n\nn+1\nn\n\nl2\n\nn\n\nMĝab ,\n\nand where Ĝab and T̂ab are the Einstein and energymomentum tensors defined with respect to ĝab . Here,\nand throughout, we write the inverse of ĝab as (ĝ −1 )ab\n(defined such that (ĝ −1 )ac ĝbc = δ ab ). Any raising or lowering of indices is otherwise always done with gab .\nIt should be noted that in (12) and (13) above we have\ntaken the matter fields described by Tab and T̂ab to be\ncoupled to gab and ĝab , respectively2 . We presume that\nwe (as observers) are made from matter coupled to only\none of these metrics, which we take to be the former without loss of generality. We further presume that there is\nno interaction between Tab and T̂ab , so that all observations we make will be of the other matter fields coupled\nto gab . Cosmological probes of the expanding Universe\nthen give us direct information about the geometry of gab\nonly.\n\n1\n2\n\nNote that in terms of the formalism used by Milgrom σ = f (κ)/κ,\nand Q = l2 Ξ.\nAlthough one could also concievably couple matter to a combination of these metrics, we prefer to restrict ourselves here to the\ncase considered by Milgrom in [8, 9].\n\n\f3\nIn the equations derived above we have not explicitly included any cosmological constant terms. However,\nfrom (12) and (13) it is clear that Λ is dynamically equivalent to a perfect fluid with p = −ρ. We therefore account for any possible cosmological constants by allowing\nfor them in Tab and T̂ab .\nIII.\n\nSPECIFICATION OF THE THEORY\n\nIn Section II we presented the field equations for the\ntheory derived from the action specified by (5), (6) and\n(11). These equations provide constraints on, and specify\nthe evolution of, the two dynamical rank two tensor fields\ngab and ĝab , but they also contain considerable freedom:\nThe tensor Qabcdef and the function M(Q) have yet to be\nspecified. In order to make progress in understanding the\ncosmological solutions of these theories, we will therefore\nnow restrict ourselves to specific cases.\n(cd)(ef )\n(ef )(cd)\nFirstly, we will only consider Qab\n= Qba\nthat are formed from the metric tensor gab . In this case\nthe most general Qabcdef that can be constructed is\nQabcdef = c1 δ f a δ db g ce + c2 δ f b δ ea g cd + c3 g cd g ef gab\n+c4 δ ca δ eb g df + c5 gab g ce g df ,\n\n(14)\n\nwhere c1 , c2 , c3 , c4 and c5 are constants, and indices are\nassumed to be symmetrized appropriately. In this notation, the 'concrete simple theory' of Milgrom is specified\nby c1 = 1, c2 = −1 and c3 = c4 = c5 = 0. The form of\nQabcdef given in (14) can then be seen to correspond to\na generalization of this theory.\nSecondly, we will consider the function M(Q) to have\nthe form specified by Milgrom in the low and high acceleration limits of the theory. That is, when |Q| ≫ 1 we\ntake\nMQ ≃ 0,\n\n(15)\n\nand when |Q| ≪ 1 we take\nMQ ≃ |Q|−1/4 .\n\n(16)\n\nThe first of these corresponds to Newtonian gravitation\nin the non-relativistic limit (when c → ∞), and the second corresponds to modified gravitational dynamics in\n\nβ\n\n\u0012\n\n\u0013\nY3\nȧ2\n+\nk\n+α 2\n2\na\na X\n\nẎ 2\nX2\n+k 2\n2\nY\nY\n\n!\n\na2 Mσ\n+\n+ 2σMQ\n3l2\n\nthe low acceleration regime of the non-relativistic limit\n(when c → ∞ and l → 0). In particular, when α + β = 0\nand T̂ab = 0 one recovers (1) in the weak field limit, with\nf = MQ [8]. The weak field limit with more general α\nand β, and with T̂ab , has been explored in [9].\nHere we will not be concerned, for the most part, with\nthe transitional behaviour between these regimes. It is\nnot clearly specified by the weak field limit of the theory,\nand is presumed to be highly sensitive to the particular\nform of M(Q) that is chosen.\nIV.\n\nFRW COSMOLOGY\n\nWe will now consider the cosmological solutions of the\ntheory discussed above. Imposing FRW symmetries on\ngab and ĝab leads to the line-elements\nds2 = gab dxa dxb = −a(τ )2 dτ 2 + a(τ )2 hij dxi dxj , (17)\nand\ndŝ2 = ĝab dxa dxb = −X(τ )2 dτ 2 + Y (τ )2 ĥij dxi dxj , (18)\nwhere hij and ĥij are the metrics of Euclidean 3-spaces\nof constant curvature, k and k̂, respectively.\nThe reason for introducing the function X(τ ) in the\nτ -τ component of ĝab is that we now only have one coordinate freedom of the form τ → f (τ ), but two τ -τ\ncomponents, in the two different metrics. It is therefore\nnot possible to redefine τ to absorb X(τ ) without introducing a second function into the τ -τ component of gab .\nThe most general expression of FRW geometry for both\nmetrics must therefore contain three functions of τ : a(τ ),\nX(τ ) and Y (τ ).\nUsing the geometry specified by (17) and (18) we can\nnow calculate the quantities that appear in the field equations (12) and (13). Of particular interest is the constraint equation, which contains only first derivatives of\na, X and Y . This equation is the analogue of the Friedmann equation in general relativistic FRW cosmology,\nand is derived in Appendix B. As an example, for Milgrom's 'concrete simple theory' with k̂ = k (which we\nwill motivate later) we find\n\nẎ\nȧ\n−\nY\na\n\n!\"\n\n#\n\n=\n\nσ=\n\n\u0012\n\nȧ Ẋ\nẎ\nY Ẏ\n2 −\n+ −2 2\na X\nY\nX\n\n8πGρa2 8πGρ̂XY 3\n,\n+\n3\n3a2\n\nwhere\n\"\n#\n3l2 ȧ Ẏ\nY Ẏ ȧ Ẋ Ẏ\nẎ 2\nẎ 2\nȧ2\nY Ẏ Ẋ\nQ= 2 2\n− 2− 2 ,\n−2 2 +2 2 +\n−\na\naY\na\nX a XY\nX3\nX\nY\n\nand\n\na4\nXY 3\n\n\u0013n\n\n\f4\nand where ρ and ρ̂ are the energy densities of the perfect\nfluids associated with the energy-momentum tensors Tab\nand T̂ab , respectively. Over-dots denote differentiation\nwith respect to τ . More general expressions for the constraint equation, and for the other quantities involved in\nthe field equations, are given in Appendix C.\nThe field equations (12) and (13) also provide secondorder evolution equations for the three variables a, X and\nY . However, these expressions are very lengthy, and so\nwe choose not to reproduce them explicitly here.\nAs usual, the energy-momentum tensors obey conservation equations. For non-interacting fluids these equations read\nȧ\nρ̇ + 3 (ρ + p) = 0\na\n\n(19)\n\nẎ\nρ̂ ̇ + 3 (ρ̂ + p̂) = 0\nY\n\n(20)\n\nand\n\nwhere p and p̂ are the pressures of the two ideal fluids3 .\nIt is convenient to treat these fluids as being polytropic,\nwith constant equations of state w and ŵ defined by p =\nwρ and p̂ = ŵρ̂. Equations (19) and (20) then give ρ ∝\na−3(1+w) and ρ̂ ∝ Y −3(1+ŵ) .\nV.\n\nSOLUTIONS\n\nWe will now look for solutions to the field equations in\nboth the 'high acceleration' limit, when |Q| ≫ 1, and the\n'low acceleration' limit, when |Q| ≪ 1.\nA.\n\nHigh acceleration limit\n\nFor |Q| ≫ 1 we have MQ ≃ 0, so the constraint and\nevolution equations for gab are given by\n2\n\nȧ\n8πGρ\nM0 (1 + n)σ\nk\n=\n(21)\n− 2−\na4\n3β\na\n3βl2\nȧ2\n4πG(ρ + 3p) M0 (1 + n)σ\nä\n− 4 = −\n, (22)\n−\n3\na\na\n3β\n3βl2\nwhile the constraint and evolution equations for ĝab are\ngiven by\n(1+n)\n\n8πGρ̂\nk̂\nM0 nσ n\nẎ 2\n=\n− 2+\n2\n2\nX Y\n3α\nY\n3αl2\n\n(23)\n\n(1+n)\n\nŸ\nẊ Ẏ\n4πG(ρ̂ + 3p̂) M0 nσ n\n− 3\n= −\n+\n2\nX Y\nX Y\n3α\n3αl2\n\n3\n\n(24)\n\nIt is, in principle, possible to have an interaction between the two\nfluids such that energy-momentum could be exchanged between\nthem. We do not consider this possibility here, but rather treat\nthe two fluids as being non-interacting, as is usual in cosmology.\n\nwhere\nσ=\n\np\n!n\n1 − k̂r2 a4\n√\n,\n1 − kr2 XY 3\n\n(25)\n\nand M0 is the constant value of M(x) when x ≫ 1. It\nis now clear that one or more of the following conditions\nmust be true:\n(i) The value of M0 is 0.\n(ii) The value of n is 0 or −1.\n(iii) The value of k̂ is equal to that of k.\nIf none of these conditions are met then the terms containing σ have an r dependence that cannot be accommodated by any of the other terms. The first two of these\nare conditions on the theory. If either, or both, of these\nconditions are met then there can exist FRW solutions in\nthe two metrics which have different spatial curvatures.\nIf neither (i) nor (ii) are satisfied, then the only FRW\nsolutions that exist are those in which the spatial curvatures of the two FRW metrics are the same.\nIf condition (i) is met then the Friedmann equations\nabove can be seen to be unchanged from their general\nrelativistic form. The two scale factors a and Y are\ncompletely decoupled, and obey constraint and evolution\nequations that are exactly the same as an FRW geometry\nin General Relativity.\nIf condition (ii) is true (but (i) is not) then either a or\nY is driven by an additional term in its field equations\nthat acts in exactly the same as a cosmological constant.\nFor n = 0 this term can be seen to appear in the Friedmann equations for a, which are otherwise identical to\ntheir general relativistic counterparts. The additional effective cosmological constant is given by\nΛef f = −\n\nM0\n.\nβl2\n\n(26)\n\nIf this is the case then Y obeys field equations that are\nunchanged from a general relativistic FRW solution. If\nn = −1 then the situation is reversed, with Y being\ndriven by an additional term, while the Friedmann equations for a are unchanged.\nIf the theory does not satisfy conditions (i) or (ii) then\nthe only FRW solutions that exist have k̂ = k. The\nvalue of σ is then independent of r, and a obeys a set\nof Friedmann equations with an additional effective fluid\nwhose energy density and pressure are given by\n\u0012 4 \u0013n\nM0 (1 + n)\na\npef f = −ρef f =\n(27)\n8πGl2\nXY 3\nThis effective fluid has an equation of state wef f = −1,\nand so we must have ρef f =constant, and therefore\na ∝ X 1/4 Y 3/4 . In this case the other set of Friedmann\nequations also has an additional effective fluid, with\n\u0012 4 \u00131+n\na\nM0 n\n.\n(28)\np̂ef f = −ρ̂ef f = −\n2\n8πGl\nXY 3\n\n\f5\nWe therefore have that one of the scale factors is driven\nby an additional positive effective cosmological constant,\nwhile the other is driven by a negative one (unless 0 <\nn < −1, in which case both effective cosmological constant terms can have the same sign).\nIt has been shown above that in all possible cases\nthe two FRW geometries effectively decouple from each\nother. Their evolution is then specified by a set of equations that are identical to the Friedmann equation of\nGeneral Relativity, but with the possible addition of an\neffective cosmological constant term. Further more, unless condition (i) or (ii) is satisfied, we must also have\nk̂ = k and a ∝ X 1/4 Y 3/4 .\nB.\n\nLow acceleration limit\n\nThe situation in the low acceleration limit is more complicated. In this case we have |Q| ≪ 1 and\n4|Q|3/4\nM ≃ sign(Q)\n+ M1 ,\n3\n\n(29)\n\nso that MQ ≃ |Q|\n. Here M1 is an unspecified constant.\nFirstly, let us consider the situation with k = k̂ = 0\nand M1 = 0 (we will return to the situation with nonzero spatial curvature, and M1 6= 0, below). In this case\nit can seen from Appendix C that we automatically have\nQ = Q(τ ) and σ = σ(τ ), and that all dependence on r\nvanishes from the field equations. Now, just as one can\ntake c → ∞ to find the non-relativistic limit of General\nRelativity, here we take l → 0 to find the low acceleration\nlimit of the present theory. Such a limit suppresses the\ncontribution of Gab and Ĝab to the left hand side of the\nfield equations, relative to Sab and Ŝab , so that (12) and\n(13) become\nSab ≃ 8πGTab\n\n(30)\n\nŜab ≃ 8πGT̂ab .\n\n(31)\n\nand\n\nThese equations are second-order, and provide a system\nof constraint and evolution equations. Assuming a perfect fluid form for both energy-momentum tensors we\nthen find the following matter dominated power-law solutions4 :\n\n4\n\nand\n\nX ∝ Y ∝ τq,\n\n1 − 3ŵ\n(1 + 2w + 8nw − 3ŵ − 8nŵ − 6wŵ)\n1 − 3w\nq =\n,\n(1 + 2w + 8nw − 3ŵ − 8nŵ − 6wŵ)\n\np =\n\n(32)\n\nBy 'matter dominated' we mean that the left-hand side of the\nfield equations scales in the same way as the right-hand side.\nThis is in contrast to 'vacuum dominated', in which the lefthand side scales independently of the right-hand side, such that\nthe influence of the matter fields on the space-time dynamics is\nnegligible.\n\n(33)\n(34)\n\nand where w and ŵ are the equations of state of the two\nfluids, as defined in Section IV. These solutions are significantly different from the corresponding solutions in\nGeneral Relativity, and some examples, for cosmologically interesting equations of state, are given in Table\nI. In this table, and throughout, we use the time coordinates t and t̂ to correspond to the proper time\nR of\ncomovingR observers in each geometry, so that t = adτ\nand t̂ = Xdτ .\nFluids\ndust & dust\n\na(t)\nt1/2\n\nY (t̂)\nt̂1/2\n\ndust & rad.\n\nconstant\n\nt̂ (3−8n)\n\nt2/3 & t1/2\n\nconstant\n\nt1/2 & t2/3\n\nrad. & dust\n\nt\n\n3\n8(1+n)\n\n3+8nC−3C\n8(1+n−C)\n\n−1/4\n\na ∝ τp\n\nwhere p and q are given by\n\n3\n\nGR\nt2/3\n\nC\n\nrad. & rad.\nt\nt1/2\nt̂\nscalar & scalar\nt1/4\nt1/3\nt̂1/4\nΛ&Λ\nexponential exponential exponential\nTABLE I: The functional form of matter dominated powerlaw solutions in the low acceleration limit of Milgrom's bimetric theory and General Relativity (GR). The fluids considered\nare dust (w = 0), radiation (w = 1/3), scalar fields (w = 1)\nand Λ (w = −1). In the left hand column, the first fluid is\ncoupled to gab , and the second fluid to ĝab . In the radiation\n& radiation case, the solutions are not specified uniquely, and\nhence there is an arbitrary constant C involved.\n\nIt can be seen that the functional form of these solutions is, in general, not only dependent on the fluid that\nis coupled to the metric in question, but also to the fluid\ncoupled to the other metric, as well as the theory, via\nthe parameter n. This mutual dependence should be expected as the two metrics are non-minimally coupled to\neach other in the action. The evolution of the two metrics can also be asymmetric under the exchange of the\ntwo fluids. This can be seen from the second and third\nrows of Table I. Again, this is expected, as Q (as specified in Section III) is asymmetric under the exchange of\ngab and ĝab . Once these power-law solutions have been\nassumed, the field equations then reduce to a set of algebraic relations between the ci 's, n, α, β, l, ρ(t0 ) and\nρ̂(t0 ), as well as the constants of proportionality in (32),\nwhere t0 is the present age of the Universe.\nIt is interesting to note that in some cases it is possible\nfor one of the metrics to be static. This is exemplified in\nTable I by the two radiation & dust solutions. In fact, it\ncan be seen from (33) and (34) that if the matter coupled\nto the second metric is radiation, then the first metric\nwill be static (unless the denominator diverges, as is the\ncase with radiation & radiation). It is also interesting\n\n\f6\nto note that in the radiation & radiation case the two\nscale factors are not uniquely determined, and can only\nbe specified up to an arbitrary constant. Clearly the\nbehaviour of these solutions is quite different to the usual\ngeneral relativistic FRW solutions, which are shown in\nthe fourth column of Table I for comparison.\nA special case that should be noted is when X equals\nY , rather than simply being proportional to it. In this\ncase the solutions that are obtained are quite different to\nthe general case, discussed above. What happens is that\nthe contributions from any terms that involve Q vanish.\nThe contribution of Gab and Ĝab can then no longer be\nconsidered to be suppressed, as the terms they were suppressed with respect to no longer exist. The system of\nequations then reduces to exactly those considered previously, in the high acceleration regime. This is, in fact,\nthe case that was considered by Milgrom in [8].\nNow let us consider non-zero spatial curvature. It can\nbe seen from Appendix C that σ and Q are, in general,\nfunctions of both τ and r, when k and k̂ take arbitrary\nvalues. Such a dependence on r is problematic, as the free\nfunctions in the line-elements (17) and (18) are all functions of τ only. This is a generalization of the problem\ninvolving the r dependence of σ found in the high acceleration regime, and although the dependence is more\ncomplicated, the solution is the same: σ and Q reduce\nto functions of τ if k̂ = k. It can then be seen that not\nonly does all r dependence drop out of σ, Q, Sab and\nŜab , but that these functions also become independent of\nk and k̂ (up to possible overall multiplicative factors of\n(1 − kr2 )). The only place that non-zero k has any effect\nin the field equations is therefore through its contribution to Gab and Ĝab , where it appears as an additional\nconstant.\nNow, although the contribution of the k-independent\nterms in Gab are suppressed by a power of l, and can\ntherefore be safely ignored in the low acceleration regime,\nthe same cannot be said for k. This term is a constant,\nand does not have the potential to become arbitrarily\nsmall at late-times, in contrast to the other terms in Gab\nand Sab . We therefore cannot ignore it, as even if it is\nnegligibly small at early times, due to suppression by a\npower of l, it can still become influential at late-times.\nHowever, as the influence of k and k̂ is limited to its appearance in the Einstein tensor, when k̂ = k, its influence\ncan be straightforwardly accounted for: It acts in exactly\nthe same way as an additional fluid with w = −1/3 coupled to gab , and a fluid with ŵ = −1/3 coupled to ĝab . We\ncan therefore calculate its influence at late-times using\nequations (33) and (34), above. We find that the corresponding power-law solution has a ∝ X ∝ Y ∝ τ 3 ∝ t3/4 ,\nindependent of n. This should be contrasted with the\nusual a ∝ t in General Relativity.\nNext, let us consider the effect of non-zero M1 . We\nfind that the inclusion of such a term requires a ∝ τ −1 ,\nif power-law solutions are to exist, which correspond to\nexponential evolution in the proper time of comoving observers, t. The solutions that exist for ĝab then depend\n\non the matter content of the theory. If we couple a fluid\nwith equation of state w to gab then we find the powerlaw solution\nX ∝ Y ∝ τ−\n\n(3+4n+3w)\n4n\n\n4n\n\n∝ t̂1+ 3(1+w) ,\n\n(35)\n\nwhile if we couple a fluid with equation of state ŵ to ĝab\nwe find\n4(1+n)\n\n4(1+n)\n\nX ∝ Y ∝ τ − (1+4n−3ŵ) ∝ t̂ 3(1+ŵ) .\n\n(36)\n\nPower-law solutions with fluids coupled to both metrics\ndo not, in general, exist, unless they result in a ∝ τ −1\nanyway (such as, for example, two Λ terms).\nFinally, let us consider what happens on approach to\na vacuum. For monotonically expanding geometries fluids with higher equations of state give way to those with\nlower equations of state, such that dust domination follows radiation domination, and so forth, in the usual way.\nIf a fluid with equation of state w = −1 (or less) exists\nthen the total energy density will eventually reach a constant (or start to increase), as all other fluids become\nnegligible in comparison. If no such fluid exists, then the\ntotal energy density will decrease monotonically forever.\nIf this happens then the right-hand side of the field equations can eventually drop below the previously neglected\nterms in the Einstein tensor. For p(1 + 3w) > 2 this\nwill mean that the matter becomes subdominant, and the\ncosmological evolution will be vacuum dominated (determined by the dynamics of the vacuum alone). In this case\nthe only power-law solutions that exist go like τ −1 , which\ncorresponds to exponential expansion. For p(1 + 3w) < 2\nthe right-hand side of the field equations will always be\ndominant over the neglected terms in the Einstein tensor, and matter dominated power-law evolution, as described above, can continue indefinitely into the future.\nIt should be noted that if spatial curvature is non-zero,\nand acts like a fluid with w = −1/3, then the condition\np(1 + 3w) < 2 is always satisfied. A curvature dominated\npower-law solution, as found above, can therefore always\nlast for an indefinitely long period, provided there are no\nfluids with equations of state w < −1/3.\nVI.\n\nVIABILITY AS A MODEL OF THE\nUNIVERSE\n\nWe will now consider the viability of the cosmological\nsolutions found above as models of the observable Universe. Our criterion for viability will be whether or not\nit is possible to account for the major probes of observational cosmology, which we take to be the primordial\nsynthesis of light elements, the position of the first acoustic peak in the CMB angular power spectrum, the growth\nof structure, and the late-time accelerating expansion of\nthe Universe. For later convenience, let us now define the\ndensity fraction of a fluid i to be\nΩi ≡\n\n8πGρi\n,\n3H02\n\n(37)\n\n\f7\nwhere ρi is the energy density of the fluid on a homogeneous hypersurface of age t0 , and H0 is the locally\nmeasured value of the Hubble parameter (in whichever\ngeometry the observers are taken to be coupled to).\nFirst consider the primordial synthesis of light elements. This process requires a cosmological evolution\nthat is close to the standard form [23], a ∼ t1/2 , and is\nhighly sensitive to the ratio of photons to baryons, η. In\nparticular, at the end of nucleosynthesis (t ∼ 200s) it can\nbe shown that the observed abundances of light elements\nimply η = (5.5 ± 0.5) × 10−10 [24]. If we now combine\nthis with a CMB photon temperature of 2.725 ± 0.001K,\nand assume that the expansion of the Universe has been\nadiabatic, then we are left with the constraint\nΩb h2 = 0.020 ± 0.002,\n\n(38)\n\nto 95% confidence, where h ≡ H0 /(100kms−1 Mpc−1 ).\nThis is a tight constraint on the matter content of the\nUniverse, and one that we expect to be applicable to any\nviable model.\nNext let us consider the positions of the acoustic peaks\nof the CMB. In general relativistic FRW cosmology their\nangular extent on the sky, θ, is essentially determined by\ntwo factors: The acoustic horizon at last scattering, Rls ,\nand the angular diameter distance to the last scattering\nsurface, d∗A , such that\nθ∼π\n\nd∗A\n.\nRls\n\n(39)\n\nHere the situation may be somewhat different. The formation of linear structure up to last scattering can be\nmodified, as the weak-field limit can now be altered from\nits usual Newtonian form. This may affect the scale of\ncorrelations on the last scattering surface, but the projection of that surface onto our sky will be unaffected by\nthis, and will therefore be sensitive to the intervening geometry of space-time in the usual way. We should therefore expect an equation similar in form to (39), but with\nRls now replaced by R̃ls , referring to the new quantity\nthat sets the scale of correlations on the last scattering\nsurface (no longer necessarily the acoustic horizon).\nA reliable calculation of R̃ls will require a detailed analysis of linear perturbation theory, and pre-recombination\nphysics, within the frame-work of the current theory. For\nour current purposes, we will simply assume R̃ls has been\ncalculated. Using the well known result that spatial curvature produces a shift in the angular scale of the first\nacoustic peak according to (1 − Ωk )−9/20 , and given the\ncompatibility of the observed CMB with a spatially flat\ngeneral relativistic FRW cosmology, we can then speculate that, in the context of the present theory, the position of the first acoustic peak is likely to imply an effective\nspatial curvature of\nΩk ≃ 1 −\n\nR̃ls\nRls\n\n!20/9\n\n.\n\n(40)\n\nThis can be seen to reduce to Ωk ≃ 0 when R̃ls ≃ R.\nBeyond the sensitivity of CMB observations to the curvature of the Universe, the growth of structure also depends on the evolution of the Universe. This is true for\nboth the linear structure that we observe at last scattering, as well as the subsequent growth of non-linear\nstructures such as galaxies, and clusters of galaxies. In\nmost cosmological models, it is usually required that one\nshould have a period of cosmological expansion where\na ∼ t2/3 in order for structure to form. Here the situation\nmay be somewhat different, as, once again, the weak-field\nlimit is modified from its usual Newtonian form. Never\nthe less, we will consider it preferable if the cosmological\nsolutions we have found can be shown to exhibit a period\nwhere a or X ∼ t2/3 .\nFinally, let us consider supernova observations. The\nHubble diagrams constructed from these events allow us\nto determine the late-time evolution of the Universe. In\nthe standard cosmological model, with the assumption of\nspatial flatness, they provide strong, direct evidence for a\ncosmological constant, or vacuum energy, with ΩΛ ∼ 0.7\n[25, 26]. If one permits non-zero spatial curvature, as will\nbe required in these models if R̃ls 6= Rls , then the resulting bounds on ΩΛ change. However, it can still be shown\nthat there exists good evidence for a non-zero cosmological constant, independent of the value of Ωk . Using\nbounds derived from the 414 supernovae of the \"Union\"\ndataset one can make the approximate statement that\n[27]\n<\n0.3 <\n∼ ΩΛ ∼ 1.4,\n\n(41)\n\nto 3σ, independent of the amount of spatial curvature5 .\nAny viable model of the Universe should therefore include\na late-time period of accelerating expansion.\nHaving discussed the constraints available from observational cosmology, let us now consider their applicability\nto the solutions found in Section V.\n\nA.\n\nHigh acceleration limit\n\nIt was shown above that when |Q| ≫ 1 the gravitational field equations reduce to their usual general relativistic form, with a cosmological constant term. For\na cosmological solution with dust and radiation we will\ntherefore have periods of cosmological evolution with\na ∼ t1/2 and t2/3 , when these two fluids dominate the cosmological dynamics, respectively. This is in good keeping\nwith the requirements of primordial nucleosynthesis and\nstructure formation.\nIf we apply the primordial nucleosynthesis bound (38)\non ΩB , and take this to make up the entire contribu-\n\n5\n\nThe precise bounds achievable depend on exactly which data one\nchooses to include, and how it is treated.\n\n\f8\ntion to the dust content of the Universe, then the supernovae results [27] imply a low value of ΩΛ ∼ 1/3, that is\nonly compatible with observations at around the 3σ level.\nWhat is more, without any other matter content this\nwould imply Ωk ∼ 2/3, which would only be compatible\nwith the position of the first acoustic peak of the CMB\nangular power spectrum if R̃ls ∼ 0.6Rls . Such a large\nchange of scale seems unlikely from previous studies using similar theories [28, 29]. We therefore find that some\nadditional non-baryonic dust-like degrees of freedom are\nnecessary, either in the form of cosmological dark matter,\nor from some other sector of the theory.\nAn effective cosmological constant term, M0 , is also\npresent in (21) and (22). This term has the attractive\nfeature of being able to reproduce the value of the cosmological constant observed in supernova data with O(1)\nvalues of M0 and n, for astrophysically interesting values\nof l. It also provides a lower limit for |Q|, as Q →constant\nin the limit that M0 dominates. This constant is zero\nin the special case X = Y , and, as already discussed, in\nthis case the dynamics in the low acceleration limit become identical to those of the high acceleration regime.\nMore generally we find that in the limit a → a0 τ −1 ,\nX → X0 τ −1 and Y → Y0 τ −1 we have\nQ→−\n\n3(3c3 + c5 )l2 (X02 − Y02 )2\n.\na20 X04\n\n(42)\n\nIf this value of |Q| is ≫ 1, and the Universe starts off in\nthe high acceleration regime, then the whole of cosmological history could have taken place there. In this case,\nas discussed above, some non-baryonic cosmological dark\nmatter would be required. Alternatively, the decelerating phase of cosmological expansion could push the value\nof Q into the low acceleration regime at some point, depending on parameters. One may then look to the low\nor intermediate acceleration regimes for the additional\ndust-like degrees of freedom.\nAs a further possibility, we note that one could consider including extra interaction terms in the action that\nwould behave like an extra dust-like contribution during\nthe matter dominated era, while staying in the high acceleration regime. Indeed, such a contribution was found\nby the authors of [3] when they considered a bimetric\ntheory with the interaction term\nZ p\nIint ∼\n−ĝ(ĝ −1 )ab gab d4 x.\n(43)\n\nOne would expect that the addition of such a term in the\npresent theory should have a similar effect in the |Q| ≫ 1\nregime, but it is not immediately clear what effects this\nwould have on the weak-field limit.\nB.\n\nLow acceleration limit\n\nAs discussed above, it seems entirely plausible that\neven if the Universe starts off in the high acceleration\n\nregime (with |Q| ≫ 1), it could end up in the low acceleration regime (with |Q| ≪ 1) after a suitable period\nof decelerating expansion. However, because Q depends\non the ci 's, as well as Hubble-parameter like terms and\nl, the values of H0 and l do not necessarily tell us anything about the value of Q today. At an extreme, if the\nci 's are chosen appropriately, the Universe could be in\nthe low acceleration limit even before recombination, independent of H0 and l. Thus, one could also envisage\na situation where the Universe is in the low acceleration\nregime throughout its entire history.\nNow let us consider what the probes of observational\ncosmology, discussed above, can tell us about the possibility of cosmological expansion in the low acceleration\nlimit. It can be seen from Table I that in this regime a\nperiod of cosmological expansion of the form a ∼ t1/2 can\nbe achieved as a result of dust-like fluids being coupled\nto each of the two metrics. We therefore have the very\nunfamiliar situation of primordial nucleosynthesis being\nable to occur during a period of dust domination. However, it can also be seen that a ∼ t1/2 can be achieved\nfor a variety of other fluids coupled to the two metrics,\n(1+4n)\n\nincluding radiation, if we allow Y ∼ t̂ (1+8n) .\nNow consider structure formation. It can be seen that\na period of expansion of the form a ∼ t2/3 can be achieved\nif two fluids with equation of state w = −1/4 are coupled\nto each of the two metrics. Having to invent two exotic\nfluids in this way is somewhat distasteful, but again we\nhave some freedom. If we are prepared to consider a second fluid with ŵ = (3+16n)−1, then we can have a ∼ t2/3\nbeing produced with a fluid of dust coupled to the first\nmetric. For a theory with n = −1/8 this corresponds\nto dust and a scalar field. Various other situations can\nbe read off from Equations (33) and (34). One particularly interesting example is for a theory with n = −1/16.\nIn this case spatial curvature dominating the first metric, and dust coupled to the second metric, also gives an\nevolution a ∼ t2/3 . Here, then, the dust coupled to the\nsecond metric acts, in a way, as if it were cosmological\ndark matter coupled to the first, which is itself an empty,\nopen universe. Clearly there is considerable scope for\nnew and interesting behaviour.\n\nC.\n\nThe intermediate regime\n\nOne may also ask whether a dust-like contribution\ncould arise from the intermediate regime, where |Q| ∼ 1.\nAs only the asymptotic limits of this function are defined,\nthere is considerable flexibility in terms of the function's\ntransitional behaviour. For example, if we consider a\ntransitional regime where M ∼ |Q|s then an analysis\nsimilar to that used in the low acceleration regime finds\nsolutions a ∝ τ p and X ∝ Y ∝ τ q where\np =\n\n2s(1 − 3ŵ)\n(3 − 2s + 3w + 12nw − 9ŵ − 12nŵ + 6sŵ − 9wŵ)\n\n\f9\nq =\n\n2s(1 − 3w)\n.\n(3 − 2s + 3w + 12nw − 9ŵ − 12nŵ + 6sŵ − 9wŵ)\n\nThese equations reduce to (33) and (34) when s = 3/4.\nIt can be seen from the above that, among very many\nother possibilities, we can arrange to have a ∼ t2/3 and\nY ∼ t̂2/3 when w = ŵ = s − 1. For a theory in which\ns = 2/3, we can therefore have the some of the effects\nof cosmological dark matter when both metrics are effectively empty, with negative spatial curvature. This is\nintended as an example only. Without any well defined\nfunctional form of M(Q) in the intermediate regime one\nclearly has considerable freedom to achieve whatever evolution is desired.\nOne final possibility arises if the entirety of cosmological history corresponds to values of Q with a different sign to that which is appropriate for the weak-field\nlimit. Here we have considered the functional form of\nM(Q) to be set by the magnitude of Q only. If one allowed its form to be different for positive or negative Q,\nthen the possibility could arise that the form of M(Q)\nthat is appropriate for cosmology is not fixed at all by\nconsiderations of the weak-field limit. Cosmological solutions could then be considered entirely independently\nfrom other phenomenology. In this case one may look to\nthe discussion of |Q| ∼ 1, above, for what the cosmological dynamics could look like for simple power-law forms\nof M(Q).\nVII.\n\nmatter fields coupled to each of the two metrics. The\nsolutions in this regime are, in general, quite different to\ntheir general relativistic counterparts, and display some\ninteresting possibilities. For example, in some theories\nit is possible to have a metric that evolves like a dust\ndominated universe does in General Relativity, while itself being empty and spatially open. This allows for the\npossibility of accounting for some of the effects of cosmological dark matter via the fields coupled to the second\nmetric.\nAcknowledgements\n\nWe are grateful to M. Bañados, P. G. Ferreira and\nT. Jacobson for helpful comments and discussions. TC\nacknowledges the support of Jesus College, Oxford and\nthe BIPAC. Research at Perimeter Institute is supported\nby the Government of Canada through Industry Canada\nand by the Province of Ontario through the Ministry of\nResearch and Innovation.\nAppendix A:\n\nTo derive the field√equations, let us consider the variations of M, σ, and −g with respect to g ab separately.\nFirstly, varying M gives\nσδM = σl2 MQ\n\nδQadbcef a d\nC bc C ef δg rs\nδg rs\n\n(44)\n\n+2σl2 MQ Jd ef δΓdef\n\nDISCUSSION\n\nWe have studied the FRW solutions of Milgrom's class\nof bimetric theories of gravity. These theories have different behaviours depending on the value of the scalar\nquantity |Q|, which is formed from the two metrics and\nvarious parameters of the theory. The two regimes that\nresult are referred to as the 'high' and 'low acceleration'\nlimits.\nWe find that in the high acceleration limit the cosmological dynamics of the two metrics essentially decouple\nfrom each another, and evolve in a similar fashion to the\nFRW solutions of General Relativity. In this regime, the\ntheory also potentially provides an explanation of the\ncosmological constant problem, as it is possible to include a constant term in the Friedmann equations that\nis constructed from a factor of order unity divided by\nthe square of the intrinsic length scale of the theory, l.\nThis results in the correct order of magnitude for the cosmological constant measured in our observable Universe.\nSolutions that stay in the high acceleration regime for\ntheir entire history, however, appear to be in conflict with\nobservations, unless non-baryonic dark matter fields, or\nextra interaction terms in the action, are also included.\nIn the low acceleration limit we find that simple powerlaw, matter dominated solutions also exist. There is\nconsiderable freedom in the form of these solutions, depending on the parameters of the theory, as well as the\n\nDerivation of the Field Equations\n\nwhere MQ ≡ dM/dQ, and Jd ef ≡ Qadbcef C abc . The\nsecond term in the equation above can then be written\n2σl2 MQ Jd ef δΓdef\n\n= σl2 MQ Jd ef g dz (δgzf ;e + δgez;f − δgef ;z )\n\u0011i\n\u0010\nh\ne\ne\n=\n ̇ l2 σMQ J(ab) + J(a b) − J eab\nδg ab , (45)\n;e\n\nwhere =\n ̇ means equal up to total divergences, and where\nwe have used the usual result δgef = −gea gf b δg ab . The\nquantities Jab e and J eab , in the equation above, have had\ntheir indices lowered with gab .\nWe also have\n√\nσ\nδ( −g)\n= − Mgab δg ab ,\n(46)\nσM √\n−g\n2\nand\nMδσ =\n\nδσ\nMδg ab .\nδg ab\n\n(47)\n\nIf σ = κ2n then δσ = − n2 σgab δg ab , and the last equation\ncan then be written\nn\nMδσ = − σgab Mδg ab .\n(48)\n2\nSumming (44), (46) and (48) gives the field equations\n(12) and (13) shown in Section II.\n\n\f10\nAppendix B:\n\nThe Constraint Equations\n\nGiven the complicated form of the full second-order\nfield equations, it is useful to look for the simpler, firstorder constraint equation. To find this, consider general\nvariations of the action of the form\nZ\n√\nδI =\nd4 x −g(Eab δg ab + Êab δĝ ab ),\n(49)\nwhere\n1\nEab = βGab − Sab − Tab = 0\n2\n\n(50)\n\nFinally, let us define the tensor J ca ≡ 2E ca + Êb a ĝ bc +\nÊ ab ĝ cb . If J 0a had second-order derivatives, then ∇c J ca\nwould contain third-order derivatives. However, we know\nfrom the vanishing of the variation of the action under\ndiffeomorphisms, δIξ = 0, that ∇c J ca = −(∇a ĝ cb )Êcb .\nNow, due to the structure of the theory we can see\nthat Êcb contains at most second-order derivatives, so\nthe right-hand side of this equation can contain at most\nsecond-order derivatives. We can therefore conclude that\nJ 0a contains up to first-order derivatives only.\nFor a given foliation of hypersurfaces with normal na ,\nand metric hab = gab + na nb , we then find that the constraint equations are given by\n\nand\nÊab =\n\ns\n\nĝ\n1\n(αĜab − Ŝab − T̂ab ) = 0.\ng\n2\n\n(51)\n\nIf we assume that Tab and T̂ab contain at most first-order\nderivatives then we do not need to consider any compensatory contributions from their evolution equations\nin order to find the desired constraint equations.\nNow consider the variation of g ab and ĝ ab due to diffeomorphisms generated by the 'infinitesimal' vector field\nξ a . Firstly, let us consider the variation of δg ab due to\nξ a , which gives\nZ\nδIξ,δg = − Eab (g ac ∇c ξ b + g cb ∇c ξ a ).\n(52)\nWe can integrate this by parts to yield a boundary term,\nthat we neglect, the Bianchi identity, ∇a Gab = 0, and\nZ\nδIξ,δg = 2 ∇c (E ca )ξa .\n(53)\nNow consider variations of ĝ ab , such that\nZ\nÊab (ξ c ∇c ĝ ab − ĝ ac ∇c ξ b − ĝ cb ∇c ξ a ) (54)\nδIξ,δĝ =\nZ\n=\n(ξc (∇c ĝ ab )Êab + ξa ∇c (Êb a ĝ bc + Ê ab ĝ cb )).\nCollecting terms then gives\nδIξ = Iξ,δg + Iξ,δĝ\n(55)\nZ\n=\nξa ((∇a ĝ cb )Êcb + ∇c (2E ca + Êb a ĝ bc + Ê ab ĝ cb )).\n\nQ\n\n(1)\n\nQ(2)\n\nJab na hbc = 0.\n\n(56)\n\nJab na nb = 0\n\n(57)\n\nand\n\nThe first of these is trivially satisfied by FRW geometry,\nwhere the hypersurfaces are taken to be surfaces of constant t, while the second gives the constraint equations\ndisplayed in Appendix C, and Section IV.\n\nAppendix C:\n\nThe Field Equations with FRW\nGeometry\n\nHere we will write explicit expressions for some of the\nquantities that appear in the field equations (12) and\n(13), for the FRW geometries (17) and (18). Firstly, we\ncan immediately write\n\nσ=\n\np\n\n1 − k̂r2 a4\n√\n1 − kr2 XY 3\n\n!n\n\n.\n\n(58)\n\nWe can also write a relatively simple expression for Q.\nTo do this we first define five new quantities via\nQ = c1 Q(1) + c2 Q(2) + c3 Q(3) + c4 Q(4) + c5 Q(5) , (59)\nsuch that Q(1) = l2 δ f a δ db g ce C acd C bef , with the other\nfour defined mutatis mutandis. We can then write\n\n\"\nl2\n2((1 − kr2 ) + 2(1 − k̂r2 )) Y Ẏ\nȧ2\nȧ Ẋ\nẎ 2\n(k − k̂)2 r2\nẊ 2\n= 2 2 2 +2\n+\n− 2 −3 2 +\na\na\naX\nX\nY\nX2\n(1 − kr2 )(1 − k̂r2 )2\n(1 − k̂r2 )\n\"\nȧ Ẋ\nẊ Ẏ\nȧ Ẏ\nẊ 2\n(k − k̂)2 r2 (3 − 2k̂r2 )\nl2 ȧ2\n−6\n− 2 −3\n+\n= 2 8 2 +2\na\na\naX\naY\nX\nXY\n(1 − kr2 )(1 − k̂r2 )2\n\nẎ\nȧ\n−\nY\na\n\n!#\n\n\f11\nẊ\nẎ\nȧ\n+3 −4\nX\nY\na\n\n!#\n\nȧ\nẊ\n((1 − kr2 ) + 2(1 − k̂r2 )) Y Ẏ\n4 +2 −\na\nX\nX2\n(1 − k̂r2 )\n\"\n#\nȧ2\nȧ Ẋ\nẊ Ẏ\n(k − k̂)2 r2\nȧ Ẏ\nẊ 2\nẎ 2\nl2\n+ 24\n− 2 −6\n−9 2 +\n= 2 − 16 2 + 8\na\na\naX\naY\nX\nXY\nY\n(1 − kr2 )(1 − k̂r2 )2\n\"\nȧ2\nȧ Ẋ\nẎ 2\n(k − k̂)2 r2 (1 + 2(1 − k̂r2 )2 )\nȧ Ẏ\nẊ 2\nl2\n+ 12\n− 2 −6 2 +\n= 2 − 10 2 + 2\na\na\naX\naY\nX\nY\n(1 − kr2 )(1 − k̂r2 )2\n\n!#\n\n((1 − kr2 ) + 2(1 − k̂r2 )) Y Ẏ\n+\nX2\n(1 − k̂r2 )\n\nQ\n\n(3)\n\n\"\nȧ2\nẊ 2\nȧ Ẋ\n(k − k̂)2 r2 (3 − 2k̂r2 )2\nl2\n− 2+\n= 2 −4 2 −4\na\na\naX\nX\n(1 − kr2 )(1 − k̂r2 )2\n\n((1 − kr2 ) + 2(1 − k̂r2 )) Y Ẏ\n+\nX2\n(1 − k̂r2 )\n\nQ(4)\nQ(5)\n\n#\n((1 − kr2 ) + 2(1 − k̂r2 )) Y Ẏ ȧ ((1 − kr2 )2 + 2(1 − k̂r2 )2 ) Y 2 Ẏ 2\n+2\n.\n−\nX 2a\nX2\n(1 − k̂r2 )\n(1 − k̂r2 )2\n\nWhen k̂ = k (motivated in Section V), the constraint equation can then be written for arbitrary c1 , c2 , c3 , c4 and c5\nin relatively simple form:\n!\n\u0012 2\n\u0013\na2 Mσ 8πGρa2\nẎ 2\nY3\nX2\nȧ\n8πGρ̂XY 3\nβ\n+\n+\nk\n+\nα\n+\nk\n−\n−\na2\na2 X Y 2\nY2\n3l2\n3\n3a2\n\"\nȧ2\nȧ Ẋ\n2σMQ\n2(c1 − 2c2 − 2c3 − 8c4 − 5c5 ) 2 + (2c1 + 5c2 − 4c3 + 8c4 + 2c5 )\n=\n3\na\naX\n3((c2 + 8c4 + 4c5 )X 2 + 2(−c1 + 2c3 + c5 )Y 2 ) ȧ Ẏ\nẊ 2\n+\n2\nX\nX2\naY\n#\n4\n2 2\n2\n2\n3((c1 + 3c4 + 2c5 )X − 2c1 X Y + (3c3 + c5 )Y 4 ) Ẏ 2\n3((c2 + 2c4 )X − 2c3 Y ) Ẋ Ẏ\n,\n−\n−\nX2\nXY\nX4\nY2\n−(c1 + c2 + c3 + c4 + c5 )\n\nwhere σ and Q are given by (58) and (59), above. The special case of the 'concrete simple theory' of Milgrom is\ngiven in Section IV. Due to their length, we choose not to display the evolution equations here, which make up the\nremaining part of the field equations.\n\n[1] M. Bañados, Phys. Rev. D77, 123534 (2008).\n[2] M. Bañados, A. Gomberoff, D. C. Rodrigues & C. Skordis, Phys. Rev. D79, 063515 (2009).\n[3] M. Bañados, P. G. Ferreira & C. Skordis, Phys. Rev.\nD79, 063511 (2009).\n[4] I. T. Drummond, Phys. Rev. D63, 043503 (2001).\n[5] C. J. Isham, A. Salam & J. A. Strathdee, Phys. Rev. D3,\n867, (1971).\n[6] N. Rosen, Gen Rel. Grav. 4, 435 (1973).\n[7] C. J. Isham & D. Storey, Phys. Rev. D18, 1047 (1978).\n[8] M. Milgrom, Phys. Rev. D80, 123536 (2009).\n[9] M. Milgrom, arXiv:1001.4444[astro-ph.CO] (2010).\n[10] M. Milgrom, MNRAS 403, 886 (2009).\n[11] M. Milgrom, ApJ 270, 365 (1983).\n[12] J. D. Bekenstein & M. Milgrom, ApJ 286, 7 (1984).\n[13] R. H. Sanders, ApJ 480, 492 (1997).\n[14] J. D. Bekenstein, Phys. Rev. D70, 083509 (2004).\n[15] T. G. Zlosnik, P. G. Ferreira & G. D. Starkman, Phys.\n\nRev. D74, 044037 (2006).\n[16] L. Blanchet & A. Le Tiec, Phys. Rev. D78, 024031\n(2008).\n[17] J-P. Bruneton, et al. JCAP 0903, 021 (2009).\n[18] A. Halle, H. Zhao & B. Li, arXiv:0711.0958[astro-ph]\n(2007) .\n[19] J. Zuntz, P. G. Ferreira & T. G. Zlosnik, Phys. Rev. Lett.\n101, 261102 (2008).\n[20] J. Zuntz, T. G. Zlosnik, F. Bourliot, P. G. Ferreira & G.\nD. Starkman, Phys. Rev. D81, 104051 (2010).\n[21] M. E. Soussa & R. P. Woodard, Class. Quant. Grav. 20,\n2737, (2003).\n[22] M. E. Soussa & R. P. Woodard, Phys. Lett B578, 253,\n(2004).\n[23] S. M. Carroll & M. Kaplinghat, Phys. Rev. D65, 063507\n(2002).\n[24] S. Burles, K. M. Nollett & M. S. Turner, ApJ 552, L1\n(2001).\n\n\f12\n[25]\n[26]\n[27]\n[28]\n\nS. Perlmutter, et al., ApJ 517, 565 (1999).\nA. Riess, et al., Astron. J. 116, 1009 (1998).\nM. Kowalski, et al., ApJ 686, 749 (2008).\nP. G. Ferreira, C. Skordis & C. Zunckel, Phys. Rev. D78,\n\n044043 (2008).\n[29] F. Bourliot, P. G. Ferreira, D. F. Mota & C. Skordis,\nPhys. Rev. D75, 063508 (2007).\n\n\f"}