{"id": "http://arxiv.org/abs/0912.1343v1", "guidislink": true, "updated": "2009-12-07T21:01:07Z", "updated_parsed": [2009, 12, 7, 21, 1, 7, 0, 341, 0], "published": "2009-12-07T21:01:07Z", "published_parsed": [2009, 12, 7, 21, 1, 7, 0, 341, 0], "title": "Weighing simulated galaxy clusters using lensing and X-ray", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0912.4946%2C0912.5394%2C0912.0042%2C0912.2754%2C0912.3697%2C0912.1674%2C0912.3982%2C0912.4050%2C0912.0666%2C0912.0639%2C0912.1205%2C0912.1085%2C0912.4200%2C0912.5389%2C0912.4216%2C0912.0788%2C0912.4171%2C0912.0161%2C0912.2414%2C0912.3563%2C0912.2041%2C0912.2019%2C0912.4624%2C0912.0985%2C0912.2303%2C0912.3117%2C0912.4802%2C0912.1924%2C0912.0299%2C0912.3107%2C0912.3066%2C0912.4661%2C0912.4318%2C0912.2887%2C0912.0894%2C0912.4259%2C0912.2341%2C0912.0012%2C0912.0870%2C0912.3745%2C0912.0102%2C0912.3312%2C0912.1812%2C0912.3734%2C0912.2060%2C0912.3173%2C0912.5459%2C0912.2665%2C0912.4459%2C0912.1734%2C0912.1654%2C0912.2438%2C0912.4637%2C0912.3494%2C0912.1606%2C0912.3323%2C0912.1739%2C0912.0703%2C0912.3438%2C0912.2433%2C0912.1518%2C0912.2628%2C0912.0006%2C0912.4715%2C0912.3371%2C0912.0939%2C0912.3920%2C0912.2528%2C0912.2420%2C0912.1382%2C0912.0537%2C0912.0560%2C0912.0026%2C0912.2894%2C0912.0834%2C0912.5397%2C0912.5130%2C0912.1976%2C0912.1343%2C0912.5069%2C0912.3892%2C0912.1680%2C0912.0428%2C0912.2012%2C0912.2664%2C0912.0748%2C0912.4017%2C0912.0727%2C0912.4015%2C0912.3486%2C0912.2214%2C0912.5234%2C0912.5062%2C0912.2962%2C0912.0497%2C0912.4108%2C0912.5438%2C0912.0258%2C0912.0804%2C0912.3652%2C0912.0977&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Weighing simulated galaxy clusters using lensing and X-ray"}, "summary": "We aim at investigating potential biases in lensing and X-ray methods to\nmeasure the cluster mass profiles. We do so by performing realistic simulations\nof lensing and X-ray observations that are subsequently analyzed using\nobservational techniques. The resulting mass estimates are compared among them\nand with the input models. Three clusters obtained from state-of-the-art\nhydrodynamical simulations, each of which has been projected along three\nindependent lines-of-sight, are used for this analysis. We find that strong\nlensing models can be trusted over a limited region around the cluster core.\nExtrapolating the strong lensing mass models to outside the Einstein ring can\nlead to significant biases in the mass estimates, if the BCG is not modeled\nproperly for example. Weak lensing mass measurements can be largely affected by\nsubstructures, depending on the method implemented to convert the shear into a\nmass estimate. Using non-parametric methods which combine weak and strong\nlensing data, the projected masses within R200 can be constrained with a\nprecision of ~10%. De-projection of lensing masses increases the scatter around\nthe true masses by more than a factor of two due to cluster triaxiality. X-ray\nmass measurements have much smaller scatter (about a factor of two smaller than\nthe lensing masses) but they are generally biased low by 5-20%. This bias is\nascribable to bulk motions in the gas of our simulated clusters. Using the\nlensing and the X-ray masses as proxies for the true and the hydrostatic\nequilibrium masses of the simulated clusters and averaging over the cluster\nsample we are able to measure the lack of hydrostatic equilibrium in the\nsystems we have investigated.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0912.4946%2C0912.5394%2C0912.0042%2C0912.2754%2C0912.3697%2C0912.1674%2C0912.3982%2C0912.4050%2C0912.0666%2C0912.0639%2C0912.1205%2C0912.1085%2C0912.4200%2C0912.5389%2C0912.4216%2C0912.0788%2C0912.4171%2C0912.0161%2C0912.2414%2C0912.3563%2C0912.2041%2C0912.2019%2C0912.4624%2C0912.0985%2C0912.2303%2C0912.3117%2C0912.4802%2C0912.1924%2C0912.0299%2C0912.3107%2C0912.3066%2C0912.4661%2C0912.4318%2C0912.2887%2C0912.0894%2C0912.4259%2C0912.2341%2C0912.0012%2C0912.0870%2C0912.3745%2C0912.0102%2C0912.3312%2C0912.1812%2C0912.3734%2C0912.2060%2C0912.3173%2C0912.5459%2C0912.2665%2C0912.4459%2C0912.1734%2C0912.1654%2C0912.2438%2C0912.4637%2C0912.3494%2C0912.1606%2C0912.3323%2C0912.1739%2C0912.0703%2C0912.3438%2C0912.2433%2C0912.1518%2C0912.2628%2C0912.0006%2C0912.4715%2C0912.3371%2C0912.0939%2C0912.3920%2C0912.2528%2C0912.2420%2C0912.1382%2C0912.0537%2C0912.0560%2C0912.0026%2C0912.2894%2C0912.0834%2C0912.5397%2C0912.5130%2C0912.1976%2C0912.1343%2C0912.5069%2C0912.3892%2C0912.1680%2C0912.0428%2C0912.2012%2C0912.2664%2C0912.0748%2C0912.4017%2C0912.0727%2C0912.4015%2C0912.3486%2C0912.2214%2C0912.5234%2C0912.5062%2C0912.2962%2C0912.0497%2C0912.4108%2C0912.5438%2C0912.0258%2C0912.0804%2C0912.3652%2C0912.0977&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We aim at investigating potential biases in lensing and X-ray methods to\nmeasure the cluster mass profiles. We do so by performing realistic simulations\nof lensing and X-ray observations that are subsequently analyzed using\nobservational techniques. The resulting mass estimates are compared among them\nand with the input models. Three clusters obtained from state-of-the-art\nhydrodynamical simulations, each of which has been projected along three\nindependent lines-of-sight, are used for this analysis. We find that strong\nlensing models can be trusted over a limited region around the cluster core.\nExtrapolating the strong lensing mass models to outside the Einstein ring can\nlead to significant biases in the mass estimates, if the BCG is not modeled\nproperly for example. Weak lensing mass measurements can be largely affected by\nsubstructures, depending on the method implemented to convert the shear into a\nmass estimate. Using non-parametric methods which combine weak and strong\nlensing data, the projected masses within R200 can be constrained with a\nprecision of ~10%. De-projection of lensing masses increases the scatter around\nthe true masses by more than a factor of two due to cluster triaxiality. X-ray\nmass measurements have much smaller scatter (about a factor of two smaller than\nthe lensing masses) but they are generally biased low by 5-20%. This bias is\nascribable to bulk motions in the gas of our simulated clusters. Using the\nlensing and the X-ray masses as proxies for the true and the hydrostatic\nequilibrium masses of the simulated clusters and averaging over the cluster\nsample we are able to measure the lack of hydrostatic equilibrium in the\nsystems we have investigated."}, "authors": ["M. Meneghetti", "E. Rasia", "J. Merten", "F. Bellagamba", "S. Ettori", "P. Mazzotta", "K. Dolag"], "author_detail": {"name": "K. Dolag"}, "author": "K. Dolag", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1051/0004-6361/200913222", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0912.1343v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0912.1343v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "27 pages, 21 figures, accepted for publication on A&A. Version with\n  full resolution images can be found at\n  http://pico.bo.astro.it/~massimo/Public/Papers/massComp.pdf", "arxiv_primary_category": {"term": "astro-ph.CO", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph.CO", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0912.1343v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0912.1343v1", "journal_reference": null, "doi": "10.1051/0004-6361/200913222", "fulltext": "c ESO 2018\n\nAstronomy & Astrophysics manuscript no. massComp ̇astroph\nOctober 25, 2018\n\nWeighing simulated galaxy clusters using lensing and X-ray\nMassimo Meneghetti1,2 , Elena Rasia3 , Julian Merten5 , Fabio Bellagamba7 ,Stefano Ettori1,2 , Pasquale Mazzotta4 ,\nKlaus Dolag6\n\narXiv:0912.1343v1 [astro-ph.CO] 7 Dec 2009\n\n1\n\nINAF-Osservatorio Astronomico di Bologna, Via Ranzani 1, 40127 Bologna, Italy\nINFN-National Institute for Nuclear Physics, Sezione di Bologna, Viale Berti Pichat 6/2. 40127, Bologna, Italy\n3\nChandra Fellow, Fellow of Michigan Society of Fellows 4 Department of Physics, University of Michigan, 450 Church St., Ann Arbor, MI\n48109-1120, USA\n4\nDipartimento di Fisica, Università \"Tor Vergata\", Via della Ricerca Scientifica 1, 00133 Roma, Italy\n5\nInstitut für Theoretische Astrophysik, Zentrum für Astronomie der Universität Heidelberg, Albert Überle Str. 2, 69120, Heidelberg, Germany\n6\nMax-Planck-Institute für Astrophysik, POBox 1317, 85741, Garching b. München, Germany\n7\nDipartimento di Astronomia, Università di Bologna, Via Ranzani 1, I-40127 Bologna, Italy\n2\n\nAstronomy & Astrophysics, submitted\nABSTRACT\nContext. Measuring the mass of galaxy clusters is a key issue in cosmology. Among the methods employed to achieve this goal, the techniques\n\nbased on lensing and X-ray analyses are perhaps the most widely used. However, the comparison between these mass estimates is often difficult\nand, in several clusters, the results apparently are inconsistent.\nAims. We aim at investigating potential biases in lensing and X-ray methods to measure the cluster mass profiles.\nMethods. We do so by performing realistic simulations of lensing and X-ray observations that are subsequently analyzed using observational\ntechniques. The resulting mass estimates are compared among them and with the input models. Three clusters obtained from state-of-the-art\nhydrodynamical simulations, each of which has been projected along three independent lines-of-sight, are used for this analysis.\nResults. We find that strong lensing models can be trusted over a limited region around the cluster core. Extrapolating the strong lensing mass\nmodels to outside the Einstein ring can lead to significant biases in the mass estimates , if the BCG is not modeled properly for example. Weak\nlensing mass measurements can be largely affected by substructures, depending on the method implemented to convert the shear into a mass\nestimate. Using non-parametric methods which combine weak and strong lensing data, the projected masses within R200 can be constrained\nwith a precision of ∼ 10%. De-projection of lensing masses increases the scatter around the true masses by more than a factor of two due to\ncluster triaxiality. X-ray mass measurements have much smaller scatter (about a factor of two smaller than the lensing masses) but they are\ngenerally biased low by 5 − 20%. This bias is entirely ascribable to bulk motions in the gas of our simulated clusters. Using the lensing and the\nX-ray masses as proxies for the true and the hydrostatic equilibrium masses of the simulated clusters and by averaging over the cluster sample\nwe are able to measure the lack of hydrostatic equilibrium in the systems we have investigated.\nConclusions. Although the comparison between lensing and X-ray masses may be difficult in individual systems due to triaxiality and substructures, using a large number of clusters with both lensing and X-ray observations may lead to important information about their gas physics\nand allow to use lensing masses to calibrate the X-ray scaling relations.\nKey words. Galaxies: clusters: general; X-ray: galaxies: clusters; Gravitational lensing\n\n1. Introduction\nGalaxy clusters are highly important test sites for cosmology.\nThey are the most massive gravitationally bound structures in\nthe universe and, in the framework of the hierarchical structure\nformation scenario, they are also the youngest systems formed\nto date. For this reason, the interplay between baryons and\ndark-matter, and its effects on the cluster internal structure, is\nless important in these than in smaller and older objects. Thus,\nthey are ideal systems for testing the predictions of the colddark-matter paradigm on the internal structure of dark-matter\nhalos (Yoshida et al. 2000; Clowe et al. 2004; Markevitch et al.\n\n2004; Sand et al. 2008). Moreover, their mass function is highly\nsensitive to cosmology, since its evolution traces with exponential magnification the growth of the linear density perturbations\n(Press & Schechter 1974; Sheth & Tormen 2002; Jenkins et al.\n2001; Warren et al. 2006).\nFor these reasons galaxy clusters are being used to constrain the cosmological parameters. Cluster masses are used\nto measure the time evolution of the mass function, which is\ncompared to the theoretical predictions to constrain the contribution of the components of the universe to the overall density\nparameter, the equation of state of dark energy and the normal-\n\n\f2\n\nM. Meneghetti et al.: Weighing simulated galaxy clusters using lensing and X-ray\n\nization of the power spectrum of the initial density fluctuations\n(e.g Vikhlinin et al. 2009; Mantz et al. 2009a,b). The measurements can be compared with those obtained from the observation of the universe on larger scales, and combined with CMB\n(see e.g. Komatsu et al. 2009), Supernovae Ia (e.g. Riess et al.\n1998, 2004; Perlmutter et al. 1999), and Baryonic-AcousticOscillations observations (e.g. Eisenstein et al. 2005; Percival\net al. 2007), in order to put tighter limits to the values of the cosmological parameters. A different approach consists of measuring the concentration-mass relation of clusters and of comparing it with the theoretical predictions (e.g. Pointecouteau et al.\n2005; Vikhlinin et al. 2005; Buote et al. 2007; Schmidt & Allen\n2007; Comerford & Natarajan 2007). For example, Buote et al.\n(2007) find that the concentration-mass relation measured with\na sample of 39 clusters is good agreement with the expectations\nin the framework of the concordance model.\nAllen et al. (2008) use the cluster gas fraction to constrain\nthe time evolution of the dark energy component of the universe. The gas fraction measured within a given angular radius\nis proportional to the distance of the cluster to the power 1.5.\nThus, the evolution of the gas fraction can be used to measure\nthe cosmic acceleration (Allen et al. 2004). Combining the results from the fgas technique with CMB and SNIa data sets,\nthey find that the time evolution of the dark energy equation\nof state is compatible with the cosmological constant paradigm\n(see also Ettori et al. 2003).\nThese techniques rely on scaling relations which link the\nmass to X-ray observables, such as temperature, pressure and\nluminosity of the X-ray emitting intra-cluster gas. The scaling\nrelations are predicted to have limited scatter in mass. For example, simulations suggest that the mass-T X and the mass-YX\nrelations have just 15% and 8% scatter in mass at fixed T X and\nYX (e.g. Evrard et al. 1996; Kravtsov et al. 2006). Despite these\nencouraging predictions, it is clearly essential to measure and\ncalibrate scaling relations empirically. To this purpose, we need\nto accurately measure the mass profiles of an as large as possible sample of galaxy clusters.\nThere are several methods to derive the masses of clusters.\nTwo widely used approaches are based on X-ray and lensing\nobservations. X-ray observations allow to derive the cluster\nmass profiles assuming that these systems are spherically symmetric and that the emitting gas is in hydrostatic equilibrium\n(e.g. Henriksen & Mushotzky 1986; Sarazin 1988; Ettori et al.\n2002). This method has the advantage that, since the X-ray\nemissivity is proportional to the square of the electron density,\nit is weakly sensitive to projection effects due to masses along\nthe line of sight to the clusters. However, it is still not well established how safely the hydrostatic equilibrium approximation\ncan be made.\nBeing the largest mass concentrations in the universe,\ngalaxy clusters are the most efficient gravitational lenses on\nthe sky. Their matter distorts background-galaxy images with\nan intensity which increases from the outskirts to the inner regions. Strong distortions, leading to the formation of \"gravitational arcs\" and/or to the formation of systems of multiple\nimages of the same source, occur in the cores of some massive galaxy clusters. Weak distortions, which can be measured\nonly statistically, are impressed on the shape of distant galax-\n\nies which lay on the sky at large angular distances from the\ncluster centers (e.g. Bartelmann & Schneider 2001). Both these\nlensing regimes can be used to map the mass distribution in\ngalaxy clusters. Determining the masses and the density profiles using lensing offers several advantages compared to Xray observations. First, lensing directly probes the cluster total\nmass, including the dark matter component, without need to\nmake strong assumptions on the equilibrium state of the lens.\nSecond, mass profiles can be measured over a wide range of\nscales, from . 100 kpc out to the virial radius. The biggest\ndisadvantage is that lensing measures the projected mass instead of the three-dimensional mass. It is much more sensitive\nthan X-ray methods to projection effects, such triaxiality and\nadditional concentrations of mass along the line of sight. Given\nthe pros and cons of each method, we can conclude that lensing and X-ray are complementary to each other in many ways.\nIn particular, the comparison of these two mass estimates can\ngreatly help to improve the accuracy of the measurements and\nto understand the systematic errors.\nThe picture arising from the comparison of lensing and\nX-ray mass estimates is puzzling. The two estimates are often discrepant, which implies that we may be missing important ingredients for fully understanding the properties of galaxy\nclusters. A systematic discrepancy has been revealed in the\nsense that masses derived from strong lensing are typically\nlarger by a factor 2-3 than masses derived from weak lensing\nand from the X-ray emitting intra-cluster-medium (ICM) (e.g.\nWu & Mao 1996; Ota et al. 2004; Smith et al. 2005; RiemerSørensen et al. 2009). The comparison between weak lensing\nand X-ray mass estimates is less problematic (see e.g. Ettori &\nLombardi 2003; Allen et al. 2001) but still the lensing masses\nare on average larger than the X-ray masses by ∼ 15 − 20%\n(e.g. Hoekstra 2007; Zhang et al. 2008). Explaining this discrepancy was found to be difficult. It was proposed that X-ray\nmasses could be systematically biased because of mergers or\nbulk motions of the gas that alter the state of hydrostatic equilibrium (Bartelmann & Steinmetz 1996; Allen 1998; Mahdavi\net al. 2008; Piffaretti & Valdarnini 2008; Ameglio et al. 2009;\nLau et al. 2009). As stated above, lensing masses could also\nbe affected by significant uncertainties (e.g. Bartelmann 1995;\nMeneghetti et al. 2007).\nIn this paper, we study the systematic effects in mass measurements done with standard lensing and X-ray techniques.\nOur work extends some previous works on the systematics on\nX-ray based mass measurements (see e.g. Rasia et al. 2006;\nNagai et al. 2007), which used synthetic X-ray observations\nof clusters obtained from hydrodynamical simulations to recover their mass distribution under the assumption of hydrostatic equilibrium. Here, we simulate both optical and X-ray\nobservations of the same simulated clusters, in order to be able\nto compare the mass estimates obtained from both kind of observations. We use three clusters obtained from hydrodynamical simulations and study them along three independent linesof-sight.\nThe paper is organized as follows. In Sect. 2 we describe\nthe sample of numerically simulated galaxy clusters, as well as\nthe techniques used to simulate lensing and X-ray observations.\nIn Sect. 3, we introduce the methods through which the mass\n\n\fM. Meneghetti et al.: Weighing simulated galaxy clusters using lensing and X-ray\n\nestimates are derived from the mock data. In Sect. 4 we show\nthe results of the analyses. Finally, in Sect. 5 we summarize and\ndiscuss the major findings of our study.\n\n2. Simulations\nIn this Sect. we describe the numerical methods used\nin the simulations. We start by considering the Nbody/hydrodynamical simulations from which the cluster models are obtained. Then, we explain the lensing and the X-ray\nsimulation pipelines.\n\n2.1. N-body/SPH simulations\nThe clusters used in this work are g1, g51, and g72 from the\nsample of numerical hydrodynamical simulations presented by\nSaro et al. (2006). These objects have been already used in several other studies (Dolag et al. 2005; Puchwein et al. 2005;\nMeneghetti et al. 2007, 2008; Rasia et al. 2006, 2008). Thus,\nwe refer the reader to these papers for more details. They are\nextracted from a parent simulation of only dark matter (Yoshida\net al. 2001) with a box size of 479h−1 Mpc of a flat ΛCDM\nmodel with Ωm = 0.3 for the present matter density parameter, h = 0.7 for the Hubble constant in units of 100 km s−1\nMpc−1 , σ8 = 0.9 for the rms fluctuation within a top-hat sphere\nof 8h−1 Mpc radius, and Ωb = 0.04 for the baryon density parameter. Each of them is subsequently re-simulated at higher\nmass and spatial resolution using the Zoomed initial condition\nmethod (Tormen et al. 1997). The re-simulations are carried\nout with GADGET-2 1 (Springel 2005). In the code we include\n(i) a description of several physical processes in the ICM (see\nSaro et al. 2006), (ii) a numerical scheme to suppress artificial\nviscosity far from the shock regions (see Dolag et al. 2005), and\n(iii) a treatment of chemical enrichment from both SNIa , SNII,\nas well as from low and intermediate mass stars (Tornatore\net al. 2004, 2007). Our simulations assume the power-law\nshape for initial stellar mass function, as proposed by Salpeter\n(1955), and galactic ejects with a speed of 500 km s−1 . They\nstart with a gravitational softening length fixed at \u000f = 30h−1 kpc\ncomoving (Plummer-equivalent) and switch to a physical softening length of \u000f = 5h−1 kpc at z = 5. The final masses of the\nDM and gas particles are set to mDM = 1.13 × 109 h−1 M and\nmGAS = 1.7 × 108 h−1 M , respectively.\nDuring the simulation 92 time slices are saved from redshift\n60 to 0. These are equidistant in time. For the current work,\nwe use the snapshots corresponding to redshift zl = 0.297 for\ng1 and g72 and to redshift zl = 0.2335 for g51. These redshifts are optimal for both the X-ray and the lensing analyses,\nsince 1) the X-ray surface brightness of these objects is high,\nand 2) the strength of the lensing signal for sources at zs ∼ 1,\nwhich is approximately the median redshift of the sources in\nour simulations, is maximal at zl ∼ 0.3. All clusters are massive, with masses M200 ranging between ∼ 7 × 1014 h−1 M and\n∼ 1.2×1015 h−1 M (see Table 1). M200 is the mass enclosed by\n1\n\nhttp://www.MPA-Garching.MPG.DE/gadget/\n\n3\n\nthe radius r200 , i.e. the radius within which the average density\nis 200 times the critical density,\n3H 2 (z)\n,\n(1)\n8πG\nwhere H(z) is the Hubble parameter.\nFor each cluster, we select a cube of 20h−1 Mpc side length\n(comoving), centered on the most bound dark matter particle.\nThis is sufficiently large to cover a wide field of view, needed\nfor weak lensing simulations. All the matter contained into this\nbox is projected along three orthogonal lines of sight, in order\nto produce three lens planes for each cluster. The surface density maps corresponding to the three projections of the clusters\ng1, g51, and g72 are shown in Fig. 1. The corresponding mass\nprofiles are displayed in Fig. 2. Note that the sample of clusters\nconsidered here comprises object with different morphologies,\ntriaxialities, and levels of substructures, although in the X-ray\nthey all appear quite relaxed (see Fig. 4). While the cluster g1\nhas the most regular morphology, the cluster g72 has a massive companion (∼ 1014 h−1 M ) located at ∼ 2.5 h−1 Mpc from\nthe cluster center. In the projection along the z−axis, this secondary clump is much closer to the main halo (∼ 300 h−1 kpc).\nAlso, the cluster g51 has some substructures within the inner\n500 h−1 kpc but their masses are smaller (. 5 × 1012 h−1 M ).\nA massive clump of mass 5 × 1013 h−1 M orbits at a distance\nof 3 h−1 Mpc from the center.\nAs demonstrated by the differences between the 2D-mass\nprofiles, all three clusters are triaxial. Their shape is prolate,\nwith the major axis oriented nearly along the z−axis of the simulation box in the cases of g51 and g72, and nearly along the\nx−axis in the case of g1. The axis ratios, measured at r200 by\ncalculating the cluster inertia ellipsoids, are listed in Table 1,\ntogether with some other relevant properties. We also report\nthere the angles between the main axes of the clusters and the\nx−, y−, and z−axes of the simulation boxes.\nThe clusters are well described by Navarro-Frenk-White\n(NFW) density profiles (Navarro et al. 1997), whose functional\nform is given by\nρs\n(2)\nρNFW (r) =\nr/r s (1 + r/r s )2\nwhere ρ s and r s are the characteristic density and the scale radius, respectively. The characteristic density is often written in\nterms of the concentration parameter, c200 = r200 /r s , as\nρcr =\n\nc3200\n200\nρcr\n.\n(3)\n3\n[ln(1 + c200 ) − c200 /(1 + c200 )]\nThe last two columns of Table 1 report the best-fit concentrations and scale-radii obtained by fitting the 3D dark-matter density profiles of the clusters with the formula in Eq. 2. The radial\nfits are done between 10h−1 kpc and r200 .\nIn the remainder of the paper, we will refer to the projections of cluster gN along the simulation axis X using the abbreviation gN-X .\nρs =\n\n2.2. Lensing simulations\nIn this section we describe the ray-tracing algorithms used to\nderive the lensing distortion fields of our simulated clusters.\n\n\f4\n\nM. Meneghetti et al.: Weighing simulated galaxy clusters using lensing and X-ray\n\nFig. 1. Surface density maps of the three projections of the clusters g1 (top panels), g51 (middle panels) and g72 (bottom panels) used in this\nwork. The size of each map is 10 h−1 Mpc comoving. Such a scale corresponds to ∼ 51.85 arcmin for g51 and to ∼ 41.47 arcmin for g1 and g72.\nIn each panel, the inner, middle, and outer boxes indicate the fields-of-view used for the HST, Chandra, and SUBARU simulated observations,\nrespectively (see text for more details).\n\nFor a summary of the lensing definitions used through the rest\nof the paper, we refer the reader to Appendix A.\nIn the following, we make use of the standard thin-screen\napproximation, i.e. we assume that the deflections occur on a\nplane perpendicular to the line-of-sight, passing through the\ncluster center. This is justified since the distances between the\nobserver and the lens and between the lens and the background\nsources are much larger than the sizes of the clusters.\nThe particles projected on each lens plane are used to calculate the deflection angles of bundles of light rays. The light\n\nrays are traced from the observer position towards the background sources through two regular grids with different spatial resolutions. The inner 1.5 × 1.5 h−2 Mpc2 region around the\ncluster center is sampled with 2048 × 2048 light rays. This\nguaranties sufficient spatial resolution for reproducing accurately the positions of multiple images in the strong lensing\n(SL) regime (Meneghetti et al. 2007). For the weak lensing\n(WL) regime, we need to sample a much wider area, while the\nspatial resolution is less important. Thus, we cover the whole\nlens plane with a grid of 4096 × 4096 light rays. The deflec-\n\n\fM. Meneghetti et al.: Weighing simulated galaxy clusters using lensing and X-ray\n\n5\n\nTable 1. Main properties of the simulated clusters used in this work. Column 1: cluster name; Column 2: redshift; Column 3: r200 ; Column 4:\nM200 ; Columns 5-6: principal axes ratios: b/a, c/a, where a > b > c; Columns 7-9: angles between the main principal axis and the x−, y−, and\nz−axes of the simulation box; Column 10: best-fit 3D-concentration; Column 11: best-fit 3D-scale radius\ncluster\ng1\ng51\ng72\n\nz\n0.297\n0.2335\n0.297\n\nr200\n[h−1 Mpc]\n1.54\n1.39\n1.30\n\nM200\n[h−1 M ]\n1.14 × 1015\n7.85 × 1014\n6.83 × 1014\n\nb/a\n\nc/a\n\n0.64\n0.78\n0.31\n\n0.57\n0.65\n0.29\n\nθx\n[deg]\n33.3\n81.5\n98.9\n\nθy\n[deg]\n57.4\n75.59\n92.8\n\nθz\n[deg]\n96.1\n16.8\n9.4\n\nc200\n4.62\n5.37\n3.99\n\nrs\n[h−1 Mpc]\n0.310\n0.241\n0.299\n\nFig. 2. Mass profiles of the clusters g1, g51, and g72. The solid black and red lines indicate the total and DM only 3D-mass profiles, respectively.\nThe total 2D-mass profiles corresponding to the x, y, and z projections of each cluster are given by the dotted, dashed, and dash-dotted lines.\na=N\ntion angles are computed using a tree-based code, which works\n1 X\nma |R0a |2 δi j .\n(6)\nas follows. First, it ranks the particles based on their distances Pi j = M\na=1\nfrom the light ray positions, building a Barnes & Hut oct-tree\nin two dimensions. The contributions to the deflection angles Assuming a Plummer softening to avoid that the deflection anfrom nearby and distant particles are calculated separately us- gles diverge, the Fk (R0 ) functions are defined as:\ning direct summation or higher-order Taylor expansions of the\n1\ndeflection potential around the light-ray positions. Precisely,\nF1 (R0 ) = 02\n(7)\n(R + s2 )\ngiven a light ray at position R in physical units, which corre−2\nsponds to an angular position θ = R/Dl , the contribution to its\nF2 (R0 ) = 02\n(8)\n(R + s2 )2\ndeflection angle by a system of mass elements, ma at positions\n8\nRa (a = 1, 2, ..., N − 1, N), with center of mass RCM , and with\nF3 (R0 ) = 02\n(9)\n|R − RCM | \u001c |Ra − RCM | for all the mass elements a, is\n(R + s2 )3\n\"\n−2\n0\n1\n4GM\n.\n(10)\n0 ij\n0\nij\n0\n0k\n0n i, j F 4 (R ) =\n02 + s2 )2\nαi (R) =\nF\n(R\n)δ\n+\nF\n(R\n)Q\n+\nF\n(R\n)(R\nQ\nR\n)δ\n1\n2\n3\nkn\n(R\n2\nc2\n#\nNearby particles are treated as point lenses and Eq. 4 reduces\n1\n0 ij\n+ F4 (R )P R0j\n(4) to\n2\n4GM\nwhere M is the total mass of the system, R0 = R − RCM , δi j is αi (R) = 2 R0i F1 (R0 ) .\n(11)\nc\nthe Kroneker function, and the tensors P and Q are defined as:\n\nQi j\n\na=N\n1 X\n0a\n=\nma R0a\ni Rj ,\nM a=1\n\n(5)\n\nThe fraction of of particles which are evaluated with Eqs. 4\nor 11 is set by the Barnes-Hut opening criterion, θBH (see e.g\nSpringel 2005), which we fix at θBH = 0.4. As shown by Aubert\n\n\f6\n\nM. Meneghetti et al.: Weighing simulated galaxy clusters using lensing and X-ray\n\net al. (2007), the optimal softening length s depends on the\nresolution of the simulation. We performed several tests to determine which values to use. Doing ray-tracing through NFW\nhalos sampled with a similar number of particles as our simulated clusters, we verified that a softening scale of 5 h−1 kpc is\nappropriate for reliably reproducing the deflection angle field\nof the input models over the range of scales relevant for both\nstrong and weak lensing.\nHaving obtained the deflection angle maps, we apply the\ncluster distortion fields to the images of a large number of\nbackground galaxies. While doing so, we simulate optical observations of each cluster under the different projections. For\nthis purpose, we use the code described in Meneghetti et al.\n(2008) (quoted as SkyLens hereafter), which has been recently\nfurther developed. In short, the code uses a set of real galaxies decomposed into shapelets (Refregier 2003) to model the\nsource morphologies on a synthetic sky. In the current version\nof the simulator, the shapelet database contains ∼ 3000 galaxies in the z-band from the GOODS/ACS archive (Giavalisco\net al. 2004) and ∼ 10000 galaxies in the B, V, i, z bands from\nthe Hubble-Ultra-Deep-Field (HUDF) archive (Beckwith et al.\n2006) . Most galaxies have spectral classifications and photometric redshifts available (Benı́tez 2000; Coe et al. 2006),\nwhich are used to generate a population of sources whose luminosity and redshift distributions resemble those of the HUDF.\nSkyLens allows to mimic observations with a variety of\ntelescopes, both from space and from the ground. In this work\nwe simulate wide field observations, on which we carry out a\nweak lensing analysis, using the SUBARU Suprime-Cam. We\nsimulate Hubble-Space-Telescope observations of the cluster\ncentral regions using the Advanced Camera for Surveys (ACS).\nAll simulations include realistic background and instrumental\nnoise. As an example, in Fig. 3 we show two color-composite\nimages of one simulated galaxy cluster (although in the rest of\nthe paper we will use simulated observation in a single band).\nThe left and the right panels show the results of simulated observations with SUBARU and with HST, respectively. Note that\nthe galaxy colors are realistically reproduced by adopting 22\nSEDs to model the background galaxies, following the spectral\nclassifications published by Coe et al. (2006).\nIn the HST image, several blueish arcs and arclets are visible behind the cluster galaxies. These are originated by background spiral and irregular galaxies strongly lensed by the foreground cluster.\nIn our analysis, we use simulated observations with the following characteristics. For the SUBARU simulations, we assume an exposure time of 6000s in the I band, with a seeing\nof 0.600 . The PSF is assumed to be isotropic and modeled using a two-dimensional Gaussian. For the HST simulations, we\nassume an exposure time of 7500s with the F775W filter. The\nfields-of-view adopted for the HST and SUBARU simulations\nare overlaid to the surface density maps in Fig. 1 (blue innerand white outer-boxes, respectively). Note that these fields of\nview do not correspond to the true fields-of-view of the ACS\nand Suprim-CAM mounted on the HST and on the SUBARU\ntelescope. For computational efficiency we limit the fields-of\n-view in the HST simulated observations to 120 arcsec, which\nis wide enough to contain the Einstein rings of our clusters. For\n\nthe SUBARU simulations, the fields-of-view are defined such\nto correspond to the same comoving scale on the lens plane, i.e.\n4 h−1 Mpc, for clusters g1 and g51. For cluster g72, we simulate a wider field-of-view, corresponding to 5 h−1 Mpc comoving in order to include a large substructure in the observation.\n\n2.3. X-ray simulations\nThe X-ray images of our simulated clusters are produced with\nthe code X-ray MAp Simulator (XMAS). The software is presented in Gardini et al. (2004) and Rasia et al. (2008), where a\nfull description of the simulation pipeline can be found. It generates synthetic event files which have the same format as real\nobservations. In this work, which is not intended to exploit any\nX-ray calibration issue, we assume a constant response over\nthe detector. In particular, the response matrix files and ancilliary response file are those of the aimpoint of ACIS-S3 CCD\non board of Chandra telescope. For each cluster projection we\nproduce an X-ray image. The X-ray images have a field of view\nof 16 arcmin on a side, which, for the considered cosmology,\ncorresponds to 2.5 h−1 Mpc at z = 0.2335 and to 2.97 h−1 Mpc\nat z = 0.297. The Chandra field-of-view is overlaid to the surface density maps of the nine clusters in Fig. 1 (green box).\nThe background is not included a priori since Rasia et al. 2006\nshowed that it does not induce any systematic on the bias. The\nspectral model used to generate the photons considers the contributions from the different metal species present in the simulation: C, N, O, Mg, Si, and Fe. The exposure time is 500 ksec.\nThe images for all the cluster projections analyzed in this paper are shown in Fig. 4. The color-bar on the bottom allows to\nconvert the color levels into counts per pixel.\n\n3. Analyses\nIn this Sect. we describe the methods used for analyzing the\npreviously outlined simulations. Firstly, we consider the mass\nestimates based on strong and weak lensing separately. Then\nwe also discuss a non-parametric method which combines both\nthe lensing regimes. Finally, we consider two methods for deriving the cluster masses from the X-ray simulated data.\n\n3.1. Strong lensing\nThe strong lensing analysis is performed by using the public software Lenstool (Kneib et al. 1993). This is very well\ndeveloped tool for strong lensing parametric reconstructions,\nwhich allows to fit the observed strong lensing features in a\ncluster field through the combination of several mass components, each of which can be characterized by a density profile\nand by a projected shape (ellipticity and orientation). The code\nuses a bayesian approach to find the best-fit lens model and to\nestimate the errors on the free parameters. We refer the reader\nto the paper by Jullo et al. (2007) for a more detailed description of the many options available in this software.\nLenstool allows the user to choose among several available density profiles to describe the lens components. In this\nwork, we use their implementation of the NFW profile (Golse\net al. 2002) to model the main cluster halo. The functional form\n\n\fM. Meneghetti et al.: Weighing simulated galaxy clusters using lensing and X-ray\n\n7\n\nFig. 3. Left panel: Color-composite image of a simulated galaxy cluster, obtained by combining three SUBARU exposures of 2500s each in the\nB, V, I bands. The field-of-view corresponds to ∼ 450\" × 450\". Right panel: an HST/ACS composite image of the the central 100\" × 100\" of\nthe same cluster. The image has been produced by combining mock observations with the filters F475W, F555W and F775W.\n\nof this profile is given in Eq. 2. Moreover, we add several subcomponents, representing the contribution from the most massive galaxies in the cluster. As shown in some previous studies,\nit is important to include the cluster members in the model, because they can affect the positions and the magnifications of the\nstrong lensing features (Meneghetti et al. 2003a; Meneghetti\net al. 2007). These are modeled using Pseudo-IsothermalElliptical-Mass-Distributions (PIEMD) described by the following density profile:\nρPIEMD (r) =\n\n(1 +\n\nρ0\n2\n2\nr /rcore )(1\n\n2\n+ r2 /rcut\n)\n\n.\n\n(12)\n\nWe choose the PIEMD model because this is widely used for\nmodeling the lensing properties of cluster galaxies in observations (see e.g. Limousin et al. 2007; Riemer-Sørensen et al.\n2009; Donnarumma et al. 2009, for some recent references).\nAs shown in the previous equation this profile is parametrized\nby a central density ρ0 , which is linked to the central velocity\ndispersion σ0 , and by two characteristic radii, namely the core\nradius rcore and the cut-off radius rcut . To incorporate the galaxy\npopulation into the global lens model we use the same approach\nused by Limousin et al. (2007), who scale the parameters as a\nfunction of the luminosity (or equivalently of the mass). The\nscaling relations are given by\n\u0012 L \u00131/2\n?\nrcore = rcore\nL?\n\u0012 L \u00131/2\n?\nrcut = rcut\nL?\n\u0012 L \u00131/4\nσ0 = σ?0 ?\n,\nL\n\n(13)\n\n?\n?\nwhere L? is a reference luminosity and the quantities rcore\n, rcut\n,\n?\nand σ0 are the corresponding core and cut radii, and central\nvelocity dispersion, respectively. In our analysis, we assume\na constant mass-to-light ratio for all the cluster members. Such\nan assumption is generally adopted when studying real clusters.\n\nObservationally, the galaxies to be included in the model\nshould be selected as those laying in the cluster red sequence\nand being brighter than a given apparent luminosity (e.g.\nLimousin et al. 2007). Of course what matters for lensing is\nnot the luminosity but the mass, which is assumed to be traced\nby the light. Indeed, the minimal luminosity should be interpreted as a minimal mass. Working with simulations, we identify the cluster galaxies using the SUBFIND code (Springel et al.\n2001) and then apply a selection based directly on the stellar\nmass. SUBFIND decomposes the cluster halo into a set of disjoint substructures and then identifies each of them as a locally\noverdense region in the density field of the background halo.\nIn our reconstructions, we include those galaxies which\nhave stellar mass M stars ≥ 109 h−1 M and which are contained\nin a region of 500 h−1 kpc around the cluster center. This is typically more than three times the size of the Einstein rings of\nthe clusters in our sample. The orientation and the ellipticity of\neach galaxy are measured from the distribution of the star particles belonging to it. Following this procedure, we typically end\nup with catalogs of several tenth of cluster members.\nThe Brightest-Central-Galaxy (BCG) is included in the lens\nmodel by optimizing its parameters individually, rather than\nscaling them with the luminosity/mass. Since the BCG forms\nin the simulations in a strong cooling region, we assume it\nmight have significantly different properties compared to the\nother cluster members. Thus, we prefer to treat it individually.\n\n\f8\n\nM. Meneghetti et al.: Weighing simulated galaxy clusters using lensing and X-ray\n\nFig. 4. X-ray maps of the three projections of the clusters g1 (top panels), g51 (middle panels) and g72 (bottom panels) used in this work. The\nsize of each map is 16 arcmin, which corresponds to 2.5 h−1 Mpc for g51 and to 2.97 h−1 Mpc for g1 and g72. In each panel, we display the\nmasked regions. The dense cold blobs are encircled in green, while we indicate to the excluded central region in white. The color-bar on the\nbottom allows to convert colors into counts.\n\nAnalogously, we use individual optimization with some other\ncluster members which lay particularly close to some multiple image systems. Indeed, their influence on the local lensing\nproperties of the cluster requires to be carefully modeled.\nThe total number of free parameters in the model depends\non the complexity of the lens. Usually we consider a clusterscale mass component, a galaxy-scale component to describe\n\nthe BCG, and other galaxy-scale terms to incorporate the relevant cluster members.\nWe distribute the sources behind the clusters such to have\n∼ 3 − 7 strong lensing systems available for the optimization.\nFor this condition to be satisfied, we randomly distribute few\nsources in a shell surrounding the lens caustics, enhancing the\nchances that they are strongly lensed. Then, we visually check\n\n\fM. Meneghetti et al.: Weighing simulated galaxy clusters using lensing and X-ray\n\n9\n\nFig. 5. Left panel: HST-like view over the central 120\" × 120\" of cluster g1 (projected along the y axis). The light emission from the cluster\ngalaxies has been removed to avoid confusion with the background multiple images. The identified systems are shown in yellow. The images i\nbelonging to the source n are indicated with the labels n.i. The inset on the left shows a zoom over the very central region of the image, where\nthe central images 1.2, 3.4, 4.2, 5.2, and 6.4 are located. We also show in green the location of the cluster members which have been included\nin the lens reconstruction. Right panel: the result of the reconstruction obtained by using Lenstool with the lensing constraints shown in the left\npanel. The critical lines for sources at redshift 1.7 are shown in red and the corresponding caustics in yellow. We also overplot the true critical\nlines of the cluster in green. Note that the shape of the critical lines is very well reproduced, especially where the lensing constraints are tighter.\n\nif the multiple images belonging to each source are detectable\nin the simulation and retain those systems which are useful for\nthe strong lensing analysis. The optimization is done using the\nbayesian method implemented in LENSTOOL with optimization\nrate δλ = 0.1. We assume the uncertainty in the lensed image\npositions to be σI = 0.3\".\nIn Fig. 5, we illustrate the reconstruction of cluster g1 − y.\nThe system has a massive galaxy at the center, labeled G1, and\nanother massive galaxy located ∼ 45\" west of the BCG (G2).\nThus, we fit the lensing observables using three lens components, namely the main halo, the BCG and a secondary PIEMD\nclump coincident with the other massive galaxy. In this particular case, adding additional cluster members does not affect the reconstruction. Among the sources, which were distributed along the caustics of the input cluster lens, seven of\nthem produce multiple image sytems detectable in this deep exposure (7500s) in the F775W filter. More precisely, two sources\n(source 3 and 6) produce five images, while the other sources\nare imaged into triplets. These are displayed in the left panel\nof Fig. 5. The bright knots in the multiple images of the same\nsource are marked with points and identified with labels. The\nfirst digit corresponds to the source number, while the last indicates the multiplicity of the image to which the knots belong.\nFor the sake of simplicity, the simulation is shown without including the light emission from the cluster members neither\nfrom other background sources that are not strongly lensed.\nThe central image of source 2 cannot be detected by eye, thus\nit is not used in the reconstruction. The other central images of\n\nsources 1, 3, 4, 5, 6 lay behind the BCG but are detectable in\nthe BCG subtracted frame. Using these observables, the reconstruction converges, finding a good fit to the lensing features\n(χ2 = 18 for 21 degrees of freedom). The best fit model consists\nof an NFW halo with concentration c = 10.57+2.82\n−1.81 and scale ra−1\ndius r s = 29.07+20.68\narcsec\n(corresponding\nto\n90+64\n−1.85\n−6 h kpc).\nThe galaxies G1 and G2 have velocity dispersions of 340+21\n−30\nkm/s and 269+12\n−17 km/s, respectively. To illustrate the result of\nthe modeling, we show in the right panel of Fig. 5 the true and\nthe reconstructed critical lines of the lens, assuming a source\nredshift of zs = 1.72 (source 3). These are displayed in green\nand red, respectively. Both the tangential and the radial critical lines of the cluster are generally quite well reproduced by\nthe model. The largest differences are on those portions of the\ncritical lines along which fewer lensing constraints are present.\nThe inner projected mass profile derived from the model,\nM(< R), is shown in Fig. 6 (dashed line), where we also show\nthe true profile of the cluster acting as lens in this simulation\n(solid line). Since the model reproduces well the lens tangential\ncritical line, it is not surprising that the model is very reliable at\nestimating the mass enclosed in the strong lensing region. The\nshaded area in the Fig. indicates the radial range of the multiple images, excluding the central images, which are located at\nR . 10 h−1 kpc. The reconstruction reproduces well the true\nmass profile up to ∼ 150 h−1 kpc from the center, where the deviation from the true mass profile is . 10%. At larger radii, the\ndifferences become significant. Thus, extrapolating the strong\nlensing model to distances where no strong lensing features are\n\n\f10\n\nM. Meneghetti et al.: Weighing simulated galaxy clusters using lensing and X-ray\n\nFig. 6. Results of the strong lensing analysis. The total projected mass\nprofile of the inner region of cluster g1−y as recovered from the strong\nlensing mass reconstruction using LENSTOOL. The dashed line shows\nthe result obtained by using seven multiple-image systems. The red\nthree-dot-dashed line shows the mass profile if only three multipleimage systems are used. The blue dot-dashed line indicates the mass\nprofile recovered by fitting all the 7 multiple-image systems, but assuming that the all the central images are not detectable. The lensing\nconstraints are shown in the left panel of Fig. 5. Finally, the true mass\nprofile, as drawn from the particle distribution in the input cluster, is\ngiven by the solid line. The shaded region shows the radial range of\nthe tangential strong lensing constraints. The bottom panel shows the\nratios between the recovered mass profiles and the true mass profile.\n\nobserved may result in largely incorrect mass estimates. This\nissue will be discussed in more detail in Sect. 4.\nIn order to evaluate how the reliability of the model degrades by reducing the number of constraints, we perform another reconstruction using only one system with five images\n(arising from the source 6) and two triplets (source 5 and 7).\nThe final reconstruction does not differ significantly from the\nprevious one. The projected mass profile for this new lens\nmodel is given by the red three-dot-dashed line in Fig. 6. This\nresult shows that reliable reconstructions can be achieved even\nwith a limited number of lensing constraints, if they are optimally distributed across the cluster. We also attempted a reconstruction by neglecting the presence of the central images\n(and using all the seven lensed systems). This is likely to be\na realistic situation, since the central images are generally demagnified and hidden behind the BCG, and thus difficult to detect. In this case, the mass enclosed by the strong lensing region is again correctly estimated, but the reconstructed profile\ndeviates more from the true one at small radii, as shown by the\nblue dot-dashed line in Fig. 6. In the following, the SL models are constructed using also the central images, when they are\ndetectable in the galaxy subtracted frames.\n\nin Skylens. The galaxy ellipticities are measured from the\nquadrupole moments of their surface brightness distributions,\ncorrected for the PSF, and used to estimate the reduced shear\nunder the assumption that the expectation value of the intrinsic\nsource ellipticity vanishes (see Eq. A.14).\nSelecting the galaxies with S /N > 10, we end up with catalogs of galaxy ellipticities containing ∼ 30 sources/sq. arcmin.\nThe median redshift of these sources is zs,true ∼ 1.05. In the following analysis we assume that all sources have the same redshift of zs = 1. Furthermore, we assume that we can separate\nperfectly the population of background galaxies from the foreground cluster members. This is intentionally very optimistic,\nsince we aim here at verifying the capabilities of several lensing\nmethods to retrieve the cluster mass in the best possible conditions. The misidentification of cluster members as background\ngalaxies leads to a dilution of the lensing signal, which causes\nto erroneous mass estimates (see e.g. Medezinski et al. 2007).\nWe will address in more detail this issue in a forthcoming paper. Increasing the distance from the cluster center, the probability that nearby substructures or additional mass clumps affect the mass estimates becomes higher. In this work, we do not\ninclude the effects of uncorrelated large-scale-structures (LSS)\non the weak-lensing signal. The effects of the LSS on the weak\nlensing mass estimates have been discussed in detail in several other papers (Hoekstra 2001, 2003; White & Vale 2004).\nUncorrelated LSS introduce a noise in the mass estimates, but\nthe importance of matter along the line sight is fairly small for\nrich clusters at intermediate redshifts, like those in our sample,\nprovided that the bulk of the sources are at high redshift compared to the cluster. Given that we are taking into account all\nthe mass in cylinders of height 20 h−1 Mpc in the lensing simulations, the effects of the correlated large-scale structure is partially included. Clowe et al. (2004) have studied the weak lensing signal of our same clusters (but in a pure dark matter version) in their cosmological environment. They find that including all the matter in a cylinder of height ∼ 100h−1 Mpc around\nthe clusters only results in small scatter being added to the measured cluster masses, compared to simulations where a cylinder\nof only ∼ 10h−1 Mpc was used. These results are in agreement\nwith the findings of Reblinsky & Bartelmann (1999).\nThe cluster masses are derived using the following approaches:\nNFW fit of the tangential shear profile: Assuming that the\n\ncluster is well described by an NFW density profile, we use\nthe corresponding formula for the reduced shear to fit the azimutally averaged profile of the tangential component of the\nreduced shear. For the NFW profile, the formulas for the radial\nprofiles of the shear and of the convergence can be found in\nBartelmann (1996) and in Meneghetti et al. (2003b). The tangential component of the reduced shear is given by\n\n3.2. Weak lensing\nThe weak lensing measurements are done using the standard\nKSB method, proposed by Kaiser et al. (1995) and subsequently extended by Luppino & Kaiser (1997) and by Hoekstra\net al. (1998). Such method is now internally implemented\n\ng+ = −Re[ge−2iφ ] ,\n\n(14)\n\nwhere the angle φ specifies the direction from the galaxy centroid towards the center of the cluster, which we identify with\n\n\fM. Meneghetti et al.: Weighing simulated galaxy clusters using lensing and X-ray\n\n11\n\nmeasure the shear but the reduced shear. To convert the observed signal into an estimate of the shear, it is usually necessary to make some assumption on the shape of the convergence\nprofile. In our analysis, we follow the method of Hoekstra\n(2007), who uses the convergence from the best fit NFW model\nto the tangential shear profile. We also use this approach to estimate the mean surface density in the annulus. For our mass\nestimates Rmax varies between ∼ 640 and ∼ 800 arcsec, depending on the cluster. We set R2 = 0.9 × Rmax .\n\n3.3. Strong and weak lensing\n\nFig. 7. Radial profiles of the tangential and of the cross components\nof the reduced shear measured from the center of cluster g1 − y. The\ndotted line shows the best fit NFW model.\n\nthe position of the BCG. The cross component of the reduced\nshear is given by\ng× = −Im[ge−2iφ ] .\n\n(15)\n\nIf the distortion is caused by lensing, this component of the\nshear should be zero.\nIn Fig. 7, we show the radial profiles of both the components of the shear for the cluster g1 − y, measured out to large\nradii (∼ 3 h−1 Mpc from the cluster center). The tangential component is well fitted by an NFW profile with c = 4.82 ± 0.64\nand r s = 0.307 ± 0.048 h−1 Mpc. As expected in absence of systematics, the cross component of the shear is consistent with\nzero.\nAperture Mass Densitometry: The aperture mass densitome-\n\ntry (Fahlman et al. 1994; Clowe et al. 1998) uses the fact that\nthe shear can be related to a density contrast. More precisely, it\ncan be shown that the following relation holds:\nζ(R1 ) = κ(< R1 ) − κ(R2 < R < Rmax )\nZ R2\nZ Rmax\n2R2\nd ln Rhγt i , (16)\n= 2\nd ln Rhγt i + 2 max 2\nRmax − R2 R2\nR1\n\nFinally, we consider a completely non parametric, twodimensional mass reconstruction. The method used here is not\nbased only on weak lensing. Instead, it combines both strong\nand weak lensing constraints to provide a map of the lensing potential. The method is fully described in Merten et al.\n(2009) (see also Bradač et al. 2005, for another similar algorithm). To obtain the underlying lensing potential ψ of the\ngalaxy cluster the reconstruction algorithm performs a combined χ2 -minimisation, which consists of a weak and a stronglensing term, in combination with an additional regularisation\nterm:\nχ2 (ψ) = χ2w (ψ) + χ2s (ψ) + R(ψ).\n\n(18)\n\nThe algorithm is grid-based and expresses the derivatives of\nthe lensing potential by finite-differencing schemes. Starting\nfrom a coarse initial grid, the resolution is steadily increased\nuntil the final reconstruction is reached. At each iteration the\nreconstruction is regularised on the former iteration by the regularisation function R(ψ). This procedure results in a smooth\nreconstruction of the lensing potential and prevents the reconstruction from following noise patterns in the data.\nThe weak lensing constraints are obtained by averaging\nover a certain number of background-galaxy ellipticities in every reconstruction pixel. The error is given by the statistical\nscatter in each pixel. Afterwards the reduced shear of the cluster is fitted:\n!\n!\nZ(z)γ(ψ)\nZ(z)γ(ψ)\nC−1\n−\n. (19)\nχ2w (ψ) = h\u000fi −\nh\u000fi\n1 − Z(z)κ(ψ) i i j\n1 − Z(z)κ(ψ) j\n\nwhere κ(< R1 ) is the mean convergence within a circular aperture of radius R1 and κ(R2 < R < Rmax ) is the mean convergence in an annulus from R2 to Rmax . This relation shows that\nthe mean surface density within a circle can be derived from\nthe tangential shear profile up to a constant. This is straightforwardly converted into a mass estimate:\n\nThe sum over i and j runs over all reconstruction pixels and the\ncosmological-weight function Z(z) describes the redshift distribution of the sources\n\nM(< R1 ) = πR21 κ(< R1 )Σcr (zl , zs ) .\n\nwhere D∞ and Dl∞ are the angular- diameter distances between\nobserver and infinity and between lens and infinity respectively.\nNote that we have to solve the full χ2 -function since the reconstruction pixels might become correlated on a high grid resolution.\nThe strong lensing constraints are based on the estimated\npositions of the critical curves of the galaxy cluster. They are\ngiven by the observed arc positions and/or multiple images\nbracketing the critical lines. Assuming a reconstruction pixel\n\n(17)\n\nIf wide field observations are avaliable, R2 and Rmax can be\nchosen to be large, so that the surface density in the annulus is\nnegligible. Otherwise, setting the annulus term to zero, ζ allows\nto estimate only a lower limit to the projected mass.\nAlthough the ζ-statistic would not require any parameterization of the lensing signal to convert the shear into a mass\nestimate, a complication arises from the fact we do not directly\n\nZ(z) ≡\n\nD∞ Dls\nH(z − zl ),\nDl∞ Ds\n\n(20)\n\n\f12\n\nM. Meneghetti et al.: Weighing simulated galaxy clusters using lensing and X-ray\n\nto be part of a critical curve, by summing over all these pixels\nwith index k, we find:\n\u0010\n\u00112\n2\n(1 − Z(z)κ(ψ))2 − |Z(z)γ(ψ)|2\n(det\nA(ψ))\nk\nk\n=\n. (21)\nχ2s (ψ) =\nσ2s\nσ2s\nThe error σ s is determined by the pixelisation of the grid.\nA final high resolution step is added, which is able to resolve\nthe positions of the critical curve estimators in greater detail.\nSince there is no reliable weak lensing information on this resolution, this step is embedded in the foregoing reconstruction\nby regularising on the former result in the cluster centre:\nχ2highres (ψ) = χ2s (ψ) + Rlowres (ψ) ,\n\n(22)\n\nThe mass analysis is then done with a convergence map, which\nis calculated from the reconstructed lensing potential of the\ncluster using Eq.A.5.\nIn Fig.8, we show the mass profiles of cluster g1 − y obtained with the weak-lensing methods described above. All the\nmethods perform well and provide consistent results for this\nparticular cluster. The mass profiles deviate from the true one\nby less than 10% at all radii. The vertical lines show the position of R2500 , R500 , and R200 , i.e. the estimated radii enclosing\nover-densities of 2500, 500, and 200 times the critical density\nof the universe, as derived from the NFW model that best fits\nthe tangential shear profile. In the case of the two-dimensional\nmass reconstruction method combining strong and weak lensing, we estimate the errors on the masses by bootstrapping 24\ngalaxy catalogs and by repeating the reconstruction with each\nof them. This is computationally very demanding, thus we reconstruct the lensing potential a coarse grid of 32 × 32 pixels\ncovering the whole cluster field (1280\" × 1280\").\n\nFig. 8. Results of the weak lensing analysis. Radial 2D-mass profiles\nof cluster g1 − y, as obtained from the three different methods used\nin this work, namely the NFW fit to the shear profile (diamonds), the\naperture mass densitometry (triangles), and the two-dimensional mass\nreconstruction combining weak and strong lensing (dotted line). The\nsolid line shows the true mass profile. The vertical lines indicate the\npositions of R2500 , R500 and R2500 as derived from the NFW fit. The\nbottom panel shows the ratios between the mass profiles recovered\nfrom the lensing analysis and the true mass profile. The dotted line\nrefers again to the SL+WL method, while the red and blue solid lines\nindicate the results for the NFW fit and for the aperture mass, respectively.\n\n3.4. X-ray\nSoft band [0.7-2] keV X-ray images are created from the event\nfiles. Using them we identify the regions of dense cold blobs\nthat we mask in any further analysis. The masked regions are\noverlaid to the X-ray images for each cluster projection in\nFig. 4. These bright point-like spots are mostly correlated to\nthe cores of previously merged substructures. Further, we exclude an inner region of 60 kpc h−1 for g51 and 70 kpc h−1\nfor g1 and g72 (white circles in Fig. 4) to exclude the central region affected by the overcooling problem. From the soft\nband image, we finally produce the surface brightness profiles\nusing 30 annuli spanning from 23 to 400 arcsec. The surface\nbrightness profile of the cluster g1 − y is given by the diamonds\nin Fig. 9. In the same radial range, we extract the spectra of\n10-15 annuli logarithmically spaced. We subsequently analyze\nthe spectra in XSPEC (Arnaud 1996) using a single temperature MEKAL model (Mewe et al. 1985; Liedahl et al. 1995)\nto obtain the temperature and the normalization. The values of\nredshift and hydrogen column density are set accordingly to the\ninput simulation. The temperature profile of g1 − y is shown in\nFig. 10.\nThe X-ray gas and total masses are recontructed using two\ndifferent methods, here labelled backward and forward method.\nIn brief, starting from the observed X-ray surface brightness\n\nFig. 9. Radial surface brightness profile of cluster g1 − y, as derived\nfrom the analysis of the x-ray observation shown in upper middle\npanel of Fig. 4 (diamonds). The dotted and the dashed lines show the\nfits to the data obtained with the forward and with the backward methods respectively.\n\nand the radially resolved spectroscopic temperature measurements and under the assumption of spherical geometry and hydrostatic equilibrium between the ICM and the underlying dark\nmatter potential, the backward puts constraints on a parametric functional form of the total mass by deprojecting the observed quantities, while the forward makes direct use of the\n3-D model of the gas density and temperature profiles estimat-\n\n\fM. Meneghetti et al.: Weighing simulated galaxy clusters using lensing and X-ray\n\n13\n\nwhere G is the gravitational constant, mp is the proton mass and\nμ=0.59 is the mean molecular weight in a.m.u. as adopted in\nthe present simulations. Further detail on variations and applications of the technique here described are presented in Ettori\net al. (2002) and Morandi et al. (2007). The best fit surface\nbrightness and temperature profiles obtained with this method\nfor the cluster g1 − y are given by the dashed lines in Figs. 9\nand 10, respectively.\nForward method. By this technique, the total mass profile is\n\nFig. 10. Radial temperature profile of cluster g1 − y, as obtained from\nthe spectral analysis of the X-ray observation (data points). The dotted\nand the dashed lines show the fits to the data obtained with the forward\nand with the backward methods respectively. See text for more details.\n\ning the model parameters by projecting the profiles and fitting\nthem to the observed ones.\nWe describe here in detail the two methods.\nBackward method. A functional form of the total mass has to\n\nbe assumed. From this, and moving backward, the profiles of\nthe observed quantities are recovered. In this work, the NFW\nmodel in Eq. 2 is used to describe the density profile of the\nclusters, so that\nMtot (< r) = 4π rs3 ρs f (x) ,\n\n(23)\n\n1\nN1\n(r/rc1 )−α [1 + (r/rc1 )2 ](3β1 −α/2) [1 + (r/r s )γ ](\u000f/γ)\nN2\n+\n[1 + (r/rc2 )2 ]3β2\n\nρ(r) =\n\nx\n.\n1+x\n\n(24)\n\nand x = r/rs .\nThe two free parameters (rs , c200 ) are constrained by minimizing a χ2 statistic defined as\nX T data,i − T model,i \u00012\n2\nχ =\n(25)\n2\n\u000fT,i\ni\nwhere T data are the either deprojected or observed temperature\nmeasurements obtained in the spectral analysis; T model are the\neither 3-D or projected values recovered from the inversion of\nthe hydrostatic equilibrium equation for a given gas density and\ntotal mass profiles; \u000fT is the error on the spectral measurements.\nThe gas density profile, ngas , is estimated from the geometrical\ndeprojection (Fabian et al. 1981, Kriss et al. 1983, McLaughlin\n1999, Buote 2000, Ettori et al. 2002) of the measured X-ray surface brightness and, in the present analysis, is used to project\nT 3D accordingly to the recipe in Mazzotta et al. (2004) to recover T model . The latter values are then compared to the results\nof the XSPEC analysis using the χ2 statistics (Eq. 25). The values of T 3D are obtained from\n\u0010\n\u0011\nngas Mtot (< r) d ngas × T 3D\n=\n,\n(26)\n−Gμmp\ndr\nr2\n\n(27)\n\nα, β1 , β2 , r s , \u000f, γ, rc1 , and rc2 are all free parameters in the\nfit. The temperature profile is modeled by a 5 parameter\n−T 0 , rt , a, b, c− function\nT = T0\n\nwhere\nf (x) = ln(1 + x) −\n\nrecovered through a direct (forward) application of the hydrostatic equilibrium equation (see Eq. 26) once a parametric form\nof the gas density and temperature profiles are estimated. In the\nfollowing analysis, we adopt the approach by Vikhlinin et al.\n(2006) that follows similar techniques presented in, e.g., Lewis\net al. (2003) and Pratt & Arnaud (2003), and extends the number of parameters to increase the modeling freedom. In particular, the formula describing the gas density is a β−model modified to accomodate a power-law behaviour in the center and the\nobserved steepening of the surface brightness in the outskirts\n(Vikhlinin et al. 1999, Neumann 2005, Ettori & Balestra 2009)\nwith the addition of a second β−model to better reproduce the\ncore profile:\n\n(r/rt )−a\nTCool .\n[1 + (r/rt )b ]c/b\n\n(28)\n\nFor these simulations, where the cool cores are well inside\nthe excluded inner regions (see Fig. 4), we consider N2 = 0 and\nT cool = 1. These profiles are then projected along the line of\nsight considering Mazzotta et al. (2004) prescription and the\nbest-fit parameters determined from a χ2 minimization technique by comparing the projected quantities with the observed\nones. The best fit surface brightness and temperature profiles\nfor cluster g1 − y are given by the dotted lines in Figs. 9 and 10.\nTo summarize, by using the observed X-ray surface brightness and temperature profiles these two methods provide:\n(backward method) starting from a given gas density profile,\nthe gas mass Mgas and the best-fit parameters (rs , c200 ) from\nwhich a total mass profile and a 3D temperature profiles are recovered; (forward method) for some given parametric forms of\nthe gas and temperature profiles, their best-fit parameters from\nwhich Mgas and Mtot are estimated. In the following analysis,\nthe results obtained from these two methods are compared to\nassess systematics in the X-ray analysis of the matter distribution.\nIn Fig. 11 we show the 3D-mass profiles of cluster g1 − y,\nobtained with both the forward (triangles) and the backward\n(diamonds) methods. In the region between R2500 and R200 the\ntwo methods are consistent with each other and they underestimate the true mass profile, given by the solid line, by\n\n\f14\n\nM. Meneghetti et al.: Weighing simulated galaxy clusters using lensing and X-ray\n\nFig. 11. Results of the X-ray analysis. Radial 3D-mass profiles of cluster g1 − y, as obtained from the forward (triangles) and from the backward methods (diamonds) used in this work. The solid line shows the\ntrue mass profile. The vertical lines indicate the positions of R2500 ,\nR500 and R2500 as derived from the lensing (see Fig. 8, dashed lines)\nand from the X-ray backward analyses (dotted lines).\n\n∼ 10 − 20%. Similar results are found for the other clusters\nin the sample, and will be discussed in detail in Sect. 4.3. The\nvertical lines in the figure indicate the estimated sizes of R2500 ,\nR500 , and R200 . In particular, the dashed and the dotted lines\nrefer to the estimates based on the weak-lensing and on the Xray forward analyses, respectively. Note that, due to the mass\nunder-estimate in the X-ray case, the radii measured through\nlensing are typically larger than those measure from the X-ray\nmethods. This is clearly shown in Fig. 12 where we report the\nratio of the extimated to the true characteristic radii calculated\nfor each cluster projection using the weak lensing signal or the\nX-ray analysis. It is worth noting even if the X-ray method always underestimate the true radii, this bias seem to have a quite\nsmall scatter. On the contrary while the weak lensing is a less\nbiased estimator, we find for it a much larger scatter. Just for\nconveniece, in the following analysis we compare the X-ray\nand the lensing masses at the same physical radii, which we\nchoose to be R2500 , R500 , R200 as derived from lensing.\n\n4. Results\nIn this Sect. we discuss the results of the analyses outlined in\nthe previous sections. We start with a discussion of the twodimensional mass estimates obtained with the lensing techniques. Then, we consider the deprojection of the lensing profiles and the X-ray 3D-mass estimates. Finally, we compare\nlensing and X-ray mass profiles and discuss how our results\nmatch the observations.\n\n4.1. Lensing 2D mass profiles\n4.1.1. Strong lensing masses\nIn Fig. 13, we compare the true and the estimated stronglensing masses of all clusters in our sample. The twodimensional masses are measured at the limits of the strong\n\nFig. 12. Ratio of the estimated to the true characteristic radii calculated for each cluster projection. Squares, Stars, and Crosses refer to\nsize derived using the weak lensing, the X-ray forward, and the X-ray\nbackward method, respectively. The continuous line indicate where\nthe true and the estimated size are equal. The Top, Middle, and Lower\npanel refer to R2500 , R500 , and R200 , respectively.\n\nFig. 13. The projected masses estimated through the strong lensing\nanalysis vs the corresponding true masses of the lenses. The dotted\nlines correspond to M2D,SL = Mtrue and to M2D,SL = Mtrue ± 10%. The\nmasses are measured within a circle centered on the BCG and having\na radius equal to the mean distance of the lensing constraints from the\ncluster center.\n\nlensing regions, given by the mean distance of the tangential\nimages from the cluster center. The agreement between the estimated and true masses is remarkable, showing that, in most\ncases, strong lensing methods based on parametric modeling\nare accurate at the level of few percent at predicting the projected inner mass. The worst results are obtained for clusters\ng51 − z and g72 − z, for which the offsets between the true and\nthe estimated mass are ∼ 15% and ∼ 20%, respectively. These\ntwo clusters have complex morphologies, as shown in Fig. 1,\nbeing characterized by multiple mass components and double\ncores. For g51 − z the mass model combines 12 mass components, three of which are optimized individually. The cluster\ng72 − z is modeled with 78 components. In this projection the\n\n\fM. Meneghetti et al.: Weighing simulated galaxy clusters using lensing and X-ray\n\nFig. 14. The relative difference between true and estimated projected\nmasses as a function of the distance from the cluster centers. The results are obtained by averaging over all the clusters in the sample. The\ndiamonds and the triangles refer to the simulations including and excluding the contribution of the BCG to the lensing signal (see text for\nmore details). The errorbars show the scatter among all the reconstructions. The regions probed by SL are typically smaller than ∼ 30 − 40\narcsec, thus the mass estimates at larger radii are extrapolations of the\nSL mass model to distances which are un-constrained by the data.\n\ncluster appears as a double cluster, with two main mass clumps\nseparated by ∼ 50\". Each of these clumps is modeled with an\nNFW profile and has a massive star concentration at the center,\nwhich is modeled as a PIEMD. These four components are optimized individually. Given the complexity of the systems and\nthe large number of free parameters (24 for g72 − z), it is reasonable to expect less accurate mass estimates for these two\nclusters.\nAlthough the mass measurement is very precise at the position of the tangential critical lines, as anticipated in Sect. 3.1,\nthe extrapolation of strong lensing models to larger radii such\nas R2500 , R500 , or R200 could lead to wrong mass estimates.\nIn particular, we find that the results are very sensitive to\nthe parameterization chosen to model the BCG, when we include the central images in the optimization. Using the wrong\nmodel leads to biased mass estimates. In our simulations we\nadopted a PIEMD which is a broadly used profile for describing the central galaxies in clusters. Such model, however, is\nnot adequate to describe the profile of the BCGs in our simulations. While the PIEMD model is isothermal, i.e. the surface\ndensity profile decreases with the distance from the center as\nΣPIEMD (R) ∝ R−1 , the true surface density distribution of the\nstars in our numerical simulations is steeper, i.e. ΣBCG ∝ R−1.7 .\nThis implies that, by fitting the lensing constraints as we do, we\nimpose that the BCG is more spatially extended, and an additional contribution to the central mass has to be provided by the\ndark matter halo. This causes to systematically over-estimate\nof the halo concentration and under-estimate of the scale radius, as shown in Table 3. For this reason, the masses extrapolated to large radii are systematically under-estimated. Such\na dependence on the BCG mass has been reported recently by\nDonnarumma et al. (2009) modeling the cluster MS2137 (see\n\n15\n\nalso Comerford et al. 2006). The diamonds in Fig. 14 show the\nmean relative differences between true and estimated projected\nmasses of the clusters at different distances from the centers.\nAs the distance from the cluster center grows, the amplitude of\nthe bias in the mass estimates increases, being of the order of\n∼ 30% at a distance of two arcmins. The size of the errorbars\nreflects the scatter among the reconstructions. Note that also\nthe scatter grows as a function of the distance from the center.\nIn order to better illustrate how the results shown above depend on the stellar component of the lenses, we ran a new set\nof lensing simulations using only the dark matter halos of the\nclusters as deflectors. Then, we repeated the fitting procedure\nand we derived the mass profiles as done before, but without\nmodeling the BCGs. In this case, even extrapolating the profiles to radii much larger than the size of the strong lensing\nregion, we find a much smaller disagreement between true and\nestimated masses. In this case, at large radii the strong lensing\nmasses tend to be on average only slightly larger than the true\nmasses (< 5%). This is shown by the triangles in Fig. 14.\n\n4.1.2. Weak Lensing masses\nWe discuss now the results obtained from the weak-lensing\nanalysis of the clusters in our sample.\nThe accuracy of the mass estimates depends on the morphology of the lenses and on their substructures. No big substructures are contained into the cylinders in the case of cluster g1. As shown in Fig. 1, the cluster appears regular in all\nthe three projections. Instead, clusters g51 and g72 have more\ncomplex morphologies. In particular, as explained above, g72\nhas a massive companion (∼ 1.4 × 1014 h−1 Mpc) located at\n∼ 2.5 h−1 Mpc from the center. When projected along the z-axis\nof the simulation box the substructure is very close to the cluster center (∼ 300 h−1 kpc). For this reason, this mass clump has\nbeen included in the strong lensing model of g72 − z. Although\nit lays outside R200 in the projections g72 − x and g72 − y, this\nsubstructure produces a significant shear which complicates the\nweak lensing mass measurements of the main cluster clump, as\ndescribed below.\nIn Fig. 15 we show the ratios of the estimated and of the true\n2D-masses of the clusters in the sample. The measurements\nhave been made at R2500 (diamonds), R500 (triangles), and R200\n(squares). The different panels refer to the three methods implemented in this work, namely the NFW fit of the tangential\nshear profile (left panel), the aperture mass densitometry (central panel), and the SL+WL method (right panel). The reliability of the methods depends strongly on the morphology of the\nlenses.\nTwo methods assume that the lensing signal is tangential\nto the center of the lens, which is assumed to coincide with\nthe BCG. This implies that all shear is assumed to be produced by a main cluster clump. These are the NFW fit and the\naperture mass densitometry methods. For some lenses, like the\nthree projections of g1, such approximation is rather well met.\nIndeed, this cluster is free of large substructures and the shear\nis dominated by the main cluster clump. For some other lenses,\nlike the three projections of g72, this is not the case. In all three\n\n\f16\n\nM. Meneghetti et al.: Weighing simulated galaxy clusters using lensing and X-ray\n\nFig. 15. Comparison between the weak-lensing and the true 2D-masses of all the simulated clusters. From left to right, the panels refer to the\nmethods based on the NFW fit of the shear profile, on the aperture mass densitometry, and on the non-parametric SL+WL reconstruction of the\nlensing potential, respectively. Shown are the ratios between the estimated and the true masses measured at three characteristic radii, namely\nR2500 (diamonds), R500 (triangles), and R200 (squares), versus the cluster names.\n\nprojections of this cluster the shear produced by the secondary\nmass clump contributes significantly to the total shear. As a\nresult, in the projection along the x− and the y−axes, the tangential shear with respect to cluster center is smaller than it\nshould be in absence of the secondary mass component. When\nfitting the shear profile with a single NFW model or converting\nthe shear into a mass estimate using the aperture mass densitometry, this causes to under-estimate the mass. The amplitude\nof this effect grows with increasing distance from the cluster\ncenter, because the secondary mass clump is approached. In the\ncase of g72− x and g72−y, using the NFW fit method, the mass\nis underestimated by ∼ 10 − 15% at R2500 and by ∼ 30 − 40%\nat R200 . Similar results are found with the aperture mass densitometry. In the case of g72 − z, where the secondary clump is\nlocated near the cluster center, the shear produced by the main\ncluster and by the substructure sum up. The resulting tangential\nshear mimics that of a lens with a larger mass and with an extended core, because of the offset between the two mass clump\ncenters. As a result, we find that the estimated M200 exceeds\nthe true value by ∼ 15 − 20%.\nIn order to validate our interpretation of these results, we\nperform the following tests. First, we place two NFW halos\nof mass M1 = 6.8 × 1014 h−1 M and M2 = 1.4 × 1014 at a\ndistance of 2.5 h−1 Mpc, and we calculate the shear field produced by these two mass clumps. Then, we sample the shear\nfield at random galaxy positions and add the noise due to the\nintrinsic galaxy ellipticities, following the method outlined in\nMaturi et al. (2005). Finally we measure the tangential shear\nprofile with respect to the center of the most massive halo and\nwe fit it using a single NFW profile, over a radial range similar\nto that used in our numerical simulations. We repeat the experiment after removing the least massive halo. We find that, if the\nshear produced by the second halo is included in the simulation, the masses at R2500 , R500 , and R200 are under-estimated,\nwith respect to the simulation including only the most massive\nhalo, by 4%, 21%, and 30%, respectively. This is qualitatively\nin agreement with the results for g72 − x and g72 − y. Note\nthat in both cases, the tangential shear profile is well fitted by\nan NFW profile, i.e. with reduced χ2 . 1. A a second test, we\nplace the least massive halo at a distance of 300 h−1 kpc from\nthe main halo. The resulting tangential shear profile is compared with that produced by a single mass component of total\n\nmass M = M1 + M2 . By fitting with NFW models, we find that,\nin the two-halo case, the masses at R2500 , R500 , and R200 are\nover-estimated, by 3%, 17%, and 25%, respectively, with the\nrespect to the single halo case. This is also in good agreement\nwith our results for g72 − z.\nFor the remaining clusters, the mass estimates obtained\nwith these two methods are more accurate. Typically, the estimated masses deviate by . 15% from the true masses. Even in\nthe case of g51, despite the presence of few substructures in the\ncluster surroundings, the mass estimates are in good agreement\nwith the input masses. The reason is that the above mentioned\nsubstructure are less massive than in the case of g72 and the\nshear is dominated by the cluster halo.\nThe non-parametric SL+WL method does not require\nany assumption on the symmetry of the lensing signal.\nSubstructures are included in the mass model by construction.\nFor this reason, the SL+WL method can recover the input mass\nwith good precision even in the case of morphologically disturbed clusters. We find that the deviations between estimated\nand true masses are typically below the 10% level.\nNote that, for all the three methods the scatter between estimated and true masses grows as a function of the radius, in\nagreement with Okabe et al. (2009).\n\n4.2. Lensing 3D masses\nAs stated several times above, lensing measures the total mass\ncontained in cylinders and projected on the sky. To convert the\n2D-mass into 3D-mass estimates, deprojection needs to be implemented. This requires to make some assumptions on the\nshape of the clusters and on their three-dimensional density\nprofile. We assume here that clusters are spherical and that their\ndensity profile is well described by the NFW model.\nDe-projection is done differently for the three methods investigated here. For the NFW fit method, we use the NFW parameters obtained from the fit of the tangential shear profile\nto calculate the 3D-mass profile of the lenses. For the aperture mass densitometry and for the SL+WL methods, we fit the\n2D-mass profiles with projected NFW models and we use the\nbest fit parameters to derive the 3D-mass profiles. These 3Dprofiles are shown in Fig. B.1 for the individual cluster projections.\n\n\fM. Meneghetti et al.: Weighing simulated galaxy clusters using lensing and X-ray\n\n17\n\nFig. 16. As in Fig. 15, but comparing the estimated and true 3D-masses.\n\nSimilarly to Fig. 15, we show in Fig. 16 the ratios between\nestimated and true 3D-masses at three over-density radii. It is\nclear that in 3D the scatter between the estimates and the input masses is significantly larger than in 2D. This is due to two\nmain reasons. First, lenses are triaxial, while we are assuming\nspherical symmetry during the de-projection. Depending on the\ndegree of triaxiality and on the orientation of the clusters with\nrespect to the line of sight, 3D-masses may result to be overor under-estimated. In particular, we find that, in the cases of\ngood alignment (i.e. small angles) between the major axis of\nthe cluster and the projection axis, the lensing masses tend to\nbe systematically larger than the true masses, while the opposite occurs in those cases where the major axis is nearly perpendicular to the line of sight. This is shown in Fig. 17, where\nthe lensing masses are derived with the SL+WL method, which\neven in 3D seems to provide the most accurate mass estimates.\nGiven that the masses of ellipsoids and spheres with the same\nazimuthal density profile tend to converge at large distances\nfrom their centers, the effect is strongest for M2500 and for M500 ,\nand mildest for M200 . However, even at R200 , the analysis of our\nsample shows that the scatter due to triaxiality is of the order\nof ∼ 20%. Similar results are found by Corless & King (2007).\nThe second factor which makes the 3D lensing mass estimates so noisy is the presence of substructures along the line\nof sight. Since their distance from the lens plane is unknown,\nthe 3D-mass estimates can be severely affected by these mass\nclumps, especially if they are located close to the cluster core\nin projection. The high ratio between the estimated and the true\nmass of g72−z is in large part due to the presence of the massive\nsub-clump previously mentioned in the paper. This accounts for\n∼ 15% of the total cluster mass, but its erroneous inclusion in\nthe central 300 h−1 kpc significantly affects the mass estimates\nat small radii.\nApart from this particular cluster projection, in the cases of\nsystems without large substructures along the line of sight, 3Dlensing masses are affected by an intrinsic uncertainty due to\ntriaxiality, which we estimate to be of the order of 20% at R200 .\nUnfortunately, at smaller radii where the lensing measurements\nof the 2D masses would be more robust, the scatter becomes\nlarger, being of the order of 50%.\nRecently Okabe et al. (2009), by studying the weak lensing\nsignal of 30 galaxy clusters observed with the SUBARU telescope, found that the mean ratios between 3D- and 2D-masses\nat Rvir and R500 are 1.34 ± 0.17 and 1.40 ± 0.10, respectively,\n\nFig. 17. Ratio between estimated and true lensing masses as a function\nof the angle between the major axis of the cluster inertia ellipsoid and\nthe axis along which the mass distribution is projected. The results\nare shown for the lensing masses obtained with the SL+WL method.\nSquares, triangles and diamonds indicate the mass measurements at\nR200 , R500 , and R2500 , respectively.\n\nwhere Rvir is the virial radius. They derive the 2D-masses using\nthe aperture mass densitometry method, while the 3D-masses\nare obtained from the NFW fits of the shear profiles. Their sample spans a range of masses which is much wider than that\ncovered by our sample. From their Fig. 8, we can estimate\nthat, limiting the analysis to masses Mvir ≥ 8 × 1014 h−1 M\nand M500 ≥ 4 × 1014 h−1 M , the ratios are smaller (∼\n1.06 and ∼ 1.37 at Rvir and at R500 , respectively). Averaging\nap\nNFW\nover our sample, we find Mvir,2D /Mvir,3D\n= 1.14 ± 0.09 and\nap\nNFW\nM500,2D /M500,3D = 1.29 ± 0.08.\nThese are quite in a good agreement with the the ratios betrue\ntrue\ntween the true 2D- and 3D-masses, which are Mvir,2D\n/Mvir,3D\n=\ntrue\ntrue\n1.13 and M500,2D /M500,3D = 1.34. From these results, we can\ndeduce that a) on average, the ratios between 2D- and 3Dmasses are well recovered, despite triaxiality and substructures\naffecting individual mass estimates, and b) the agreement between simulations and observations is an indication that the\ndensity profiles of real and simulated clusters are, within the\nerrors, compatible with each other.\n\n\f18\n\nM. Meneghetti et al.: Weighing simulated galaxy clusters using lensing and X-ray\n\nFig. 18. Top panels: comparison between the X-ray and the true 3D-masses of all the simulated clusters. The left and the right panels refer\nto the forward and to the backward methods, respectively. Shown are the ratios between the estimated and the true masses measured at three\ncharacteristic radii, namely R2500 (diamonds), R500 (triangles), and R200 (squares), as a function of the cluster name. Bottom panels: as for the\nupper panels, but comparing the gas masses derived from the X-ray analysis to the true gas masses of the clusters.\n\n4.3. X-ray masses\nIn Fig 18 we compare the true and estimated total and gas\nmasses for all the cluster in our sample. The left and the right\npanels refer to the forward and to the backward methods described in Sect. 3.4. The top panels show the ratios between\nthe estimated and the true masses measured at three characteristic radii, namely R2500 (diamonds), R500 (triangles), and R200\n(squares), as a function of the cluster name. A comparison of\nthe mass profiles at any other radius is shown in Fig. B.1. The\nforward and backward methods give results which, at the three\ndifferent characteristic radii, are consistent within 2σ for all the\nclusters. The reconstruction of the X-ray masses through the\ntwo methods can differ because, while the backward method\nassumes a functional form of the total density profile imposing the gas temperature profile for given gas density profile,\nthe forward method reproduces the gas density and temparture\nwith very flexible models that, in particular in the outer regions,\ncan induce not stable extrapolations. For the forward method,\nthe confidence intervals on mass profiles have been estimated\nby minimising the distance between the projected models and a\nset of 100 random realisations of observed profiles. These pro-\n\nfiles have been obtained assuming Gaussian statistics around\nobserved values of the surface brightness and temperature profiles with the constraint of rejecting realisations leading to nonphysical solution of non-monotonically increasing mass profiles. For the backward method, errors on Mgas,X are estimated\nby propagation of the errors on the gas density profile as obtained from the direct deprojection of the surface brightness,\nreconstructed 100 times by considering the Gaussian error in\neach radial bin. The error on M3D,X is obtained from the propagation of the errors on the concentration parameter and scale\nradius estimated through Eq. 25. Similarly to what shown in\nother work (see e.g. Rasia et al. 2006, 2008; Nagai et al. 2007,\nand references therein) we find that, overall the X-ray mass estimates are biased low by 5%-20%. More quantitatively we find\nthat, on average, both methods underestimate the true mass by\n10% with a scatter of 6% almost independently of the characteristic radius considered. The most deviant mass estimate\ncomes only from the z projection of cluster g72. This is due\nagain to the fact that this cluster is composed by two structures\nthat line-up along the line of sight (see Fig 1). When we fit\n\n\fM. Meneghetti et al.: Weighing simulated galaxy clusters using lensing and X-ray\n\nthe surface brightness profile this appears to be steeper in the\ncenter and shallower at the characteristic radius.\nIn the bottom panels of Fig. 18 we compare the gas masses\nderived from the X-ray analysis to the true gas masses of the\nclusters. Again, we find that the two methods give results consistent within 2σ errors. Furthermore, in agreement with other\nwork, we find that the total gas mass is well reconstructed\n(Nagai et al. 2007). More quantitatively we find that, on average, the gas mass is recovered to better than 1% with a 3%\nscatter at R2500 and 7% with a 3% scatter at R500 and R200 . It is\nimportant to say that the trend to slightly overestimate the gas\nmass at large radii is due to the fact that both X-ray methods\ntend to slightly overestimate the cluster density profiles in the\noutskirts due to a non perfect azimuthal symmetry of the cluster surface brightness at larger radii. The most deviant gas mass\nestimates is given by the z projection of cluster g72. Again this\nis due to the same effect explained above for the mass.\n\n4.4. NFW fit parameters\nThe best-fit NFW parameters for all the clusters in the sample, obtained both through the lensing and X-ray analyses in\nthe radial ranges listed in Table 2, are summarized in Table 3.\nIn column 4 of the table we report the best fit concentrations\nand scale radii obtained for the main cluster halo using the\nstrong-lensing constraints. These results are obtained by including also the central images in the strong lensing modeling.\nAs discussed in Sect. 4.1.1, this leads to systematically overestimate the concentration and underestimate the scale radius,\nbeing the PIEMD model used in the SL modeling inadequate\nto describe the distribution of the stars in the simulations. In\nparticular, we note that, in some cases, the concentrations are\noff by a factor of ∼ 3 with respect to the true values reported\nin the second column. On average, the concentrations derived\nfrom SL alone are almost 85% larger than the true concentrations of the DM-only profiles. Conversely, the scale radii are\nalmost ∼ 50% smaller. We remind that the SL fits refer to the\ncluster halos, while the stars are modeled apart.. Such bias is\nnot present in the simulations without stars, where the average ratio between estimated and true concentrations is around\nunity.\nThe weak lensing best fit parameters, obtained from the fit\nof the shear profiles, are given in column 5. The concentrations\ntend to be slightly larger than those of the dark-matter distriDMonly\nbutions in the input models (hcWL /ctrue i = 1.17) and the\nscale radii are on average ∼ 10% smaller that the input values\nDMonly\n(hrWL\ns /rs,true i = 0.93). Similar results are found combining\nSL and WL (columns 6). In this case the average ratio between\nDMonly\nestimated and true concentrations is hcSL+WL /ctrue i = 1.15\nDMonly\n(for the scale radius we find hrSL+WL\n/rs,true i = 0.93). The\ns\ntendency to over-estimate more the concentration when adding\nthe SL constraints is caused by the large contribution of the\nstellar and gas masses within the inner 100 h−1 kpc, as shown\nin Fig. 2. We remind that in the cases of the WL and WL+SL\nmethods the fits are done over the total projected mass profiles, thus without distinguishing the dark-matter component\nfrom the stellar and gas masses. To support this interpretation,\n\n19\n\nwe note that the largest discrepancies with the true concentrations arise for the cluster g51, which is characterized by an extended strong over-cooling region in the center, where the total density profile steepens compared to the DM only profile.\nThis mimics a larger concentration, being the mass profile still\ncompatible with an NFW model. Fitting the total density profiles of the inputs clusters indeed leads to higher concentrations\nand smaller scale radii, as reported in column 3, which are in\na much better agreement with the results of the lensing fits. As\nhighlighted in the previous sections, the WL fits of some systems, like the three projections of g72, can be strongly biased\nassuming a single mass component. Indeed, their substructures\nneed to be properly modeled when deriving the cluster mass\nfrom the shear signal. The SL+WL method provides a better\nchance to measure the density profile, at least in some cases,\nlike g72 − x and g72 − y, where the large substructure laying at\nthe edge of the cluster virial region is by construction properly\nmodeled. For g72 − z, where the substructure is near the cluster\ncore, a correct fit of the projected mass distribution would require multiple mass components also for the SL+WL method.\nComparable estimates of c and rs are obtained with the\ntwo X–ray techniques. Even the X-ray analysis probes the total mass distribution, including the gas and the stars. We note\nthat, using the Backward method, the concentration and the\nscale radius are obtained as best-fit parameters that minimize\nthe reconstructed temperature profile with respect to the observed values, whereas using the Forward method we have estimated them with a–posteriori fit with a NFW functional form\nperformed in the radial range 0.7 − 1.4 h−1 Mpc on the mass\nmodel obtained by appling the hydrostatic equilibrium equation on the gas density and temperature models described in\nEqs. (27) and (28), respectively. Overall, the deviations from\nthe true estimates go in the same direction: in g1, c is underestimated consistently by a factor 0.7 − 0.8, with a corresponding\noverestimate of rs up to a factor 1.45, if compared with the true\nconcentrations obtained by fitting the input total mass distributions of the clusters; the same considerations apply to g72,\napart from g72 − z, where the concentration (scale radius) is\ntotal\nestimated higher (lower) than ctotal\ntrue (rs,true ) by about 15 per cent\nas consequence of the alignment along the line of sight of the\ntwo main clumps; more critical is the case of g51, where both\nthe X–ray methods provide a measure of the concentration that\nis twice ctotal\ntrue , due again to the large contribution of the cool\nsubstructures in the central regions, as also shown from the\noverestimate of the total mass obtained through X-ray analysis within R2500 (see Fig. 18). Although we attempted to mask\nit in the X-ray analysis, the over-cooling region in this cluster is\nvery extended, thus it is still affecting the mass reconstruction\n(see Fig. B.1 in Appendix B). On average the X-ray concenDMonly\ntrations are ∼ 10% and ∼ 20% smaller than ctrue\nand ctotal\ntrue ,\nrespectively, if the three projections of g51 are not included.\n\n4.5. Lensing vs. X-ray 3D mass profiles\nFinally, we attempt a comparison between the lensing and the\nX-ray mass estimates.\n\n\f20\n\nM. Meneghetti et al.: Weighing simulated galaxy clusters using lensing and X-ray\n\nTable 2. Radial ranges used for fitting NFW profiles to the lensing and X-ray data. All radii are expressed in units of r200 reported in Table 1.\ncluster\ng1 - x\ng1 - y\ng1 - z\ng51 - x\ng51 - y\ng51 - z\ng72 - x\ng72 - y\ng72 - z\n\nmin-max SL\n0.002-0.08\n0.002-0.09\n0.002-0.06\n0.003-0.07\n0.002-0.05\n0.002-0.12\n0.006-0.05\n0.006-0.05\n0.002-0.05\n\nmin-max WL\n0.16-1.00\n0.16-1.00\n0.16-1.00\n0.20-1.00\n0.20-1.00\n0.20-1.00\n0.20-1.00\n0.20-1.00\n0.20-1.00\n\nmin-max SL+WL\n0.03-1.00\n0.03-1.00\n0.03-1.00\n0.05-1.00\n0.05-1.00\n0.05-1.00\n0.05-1.00\n0.05-1.00\n0.05-1.00\n\nmin-max X-ray\n0.45-0.90\n0.45-0.90\n0.45-0.90\n0.50-1.00\n0.50-1.00\n0.50-1.00\n0.54-1.08\n0.54-1.08\n0.54-1.08\n\nTable 3. The NFW concentrations and scale radii (upper and lower part of the Table, respectively) resulting from the strong-lensing (column\n4), weak-lensing (column 5), strong+weak lensing (column 6), and X-ray analyses (column 7-8 for the forward and for the backward methods)\nof the clusters in our sample. The weak-lensing estimates are obtained by fitting the shear profile with an NFW model. In columns 2 and 3,\nwe quote the true concentrations obtained by fitting the DM-only and the total density profiles of the three clusters in the radial range between\n10 h−1 kpc and r200 . Below each column, we report the mean ratios of the estimated and the true parameters. These are calculated both including\nand neglecting the three projections of g51, which strongly bias the mean concentrations and scale radii derived from the X-ray analyses. The\nnumbers in parentheses are the corresponding r.m.s. values.\ncluster\ng1 - x\ng1 - y\ng1 - z\ng51 - x\ng51 - y\ng51 - z\ng72 - x\ng72 - y\ng72 - z\nc/cDMonly\ntrue\nc/ctotal\ntrue\nc/cDMonly\ntrue\nc/ctotal\ntrue\ng1 - x\ng1 - y\ng1 - z\ng51 - x\ng51 - y\ng51 - z\ng72 - x\ng72 - y\ng72 - z\nDMonly\nrs /rs,true\ntotal\nrs /rs,true\nDMonly\nrs /rs,true\ntotal\nrs /rs,true\n\ncDMonly\ntrue\n4.62\n4.62\n4.62\n5.37\n5.37\n5.37\n3.99\n3.99\n3.99\n\nctotal\ntrue\n5.38\n5.38\n5.38\n7.20\n7.20\n7.20\n4.22\n4.22\n4.22\n\ncSL\n11.310.19\n−0.59\n10.572.82\n−1.81\n6.922.25\n−1.12\n3.360.46\n−0.11\n9.720.68\n−0.61\n8.780.19\n−0.46\n6.460.99\n−2.54\n7.261.47\n−0.14\n11.390.42\n−0.85\n1.84 (0.60)\n1.59 (0.59)\n2.09 (0.48)\n1.88 (0.45)\n\ncWL\n6.21 ± 0.87\n4.82 ± 0.64\n4.44 ± 0.62\n5.83 ± 0.96\n5.13 ± 1.05\n6.06 ± 0.93\n4.17 ± 1.54\n7.91 ± 2.86\n4.19 ± 0.62\n1.17 (0.30)\n1.01 (0.33)\n1.23 (0.35)\n1.12 (0.35)\n\ncSL+WL\n6.59 ± 0.32\n5.39 ± 0.23\n4.54 ± 0.23\n6.10 ± 0.29\n6.35 ± 0.42\n7.41 ± 0.32\n3.88 ± 0.30\n4.17 ± 0.31\n4.50 ± 0.24\n1.15 (0.15)\n0.98 (0.11)\n1.12 (0.15)\n1.00 (0.12)\n\ncX,forw\n3.580.06\n−0.06\n4.510.08\n−0.08\n4.060.07\n−0.07\n11.150.19\n−0.20\n12.390.22\n−0.22\n11.040.21\n−0.22\n3.310.05\n−0.05\n3.480.05\n−0.05\n4.920.08\n−0.08\n1.33 (0.59)\n1.09 (0.38)\n0.92 (0.15)\n0.83 (0.15)\n\ncX,back\n3.590.32\n−0.28\n4.050.40\n−0.25\n3.620.22\n−0.31\n10.760.47\n−0.65\n10.800.56\n−0.56\n11.300.65\n−0.62\n3.220.06\n−0.02\n3.290.06\n−0.02\n4.490.38\n−0.29\n1.25 (0.56)\n1.03 (0.36)\n0.86 (0.12)\n0.78 (0.13)\n\ntotal\nrs,true\n0.278\n0.278\n0.278\n0.189\n0.189\n0.189\n0.299\n0.299\n0.299\n\nrsSL\n0.0970.007\n−0.002\n0.0900.064\n−0.006\n0.1520.029\n−0.031\n0.3850.072\n−0.053\n0.0990.008\n−0.012\n0.1410.002\n−0.003\n0.0870.032\n−0.009\n0.0940.029\n−0.027\n0.0590.008\n−0.004\n0.49 (0.40)\n0.59 (0.53)\n0.31 (0.09)\n0.34 (0.11)\n\nrsWL\n0.229 ± 0.037\n0.307 ± 0.048\n0.317 ± 0.053\n0.242 ± 0.045\n0.246 ± 0.057\n0.244 ± 0.043\n0.262 ± 0.105\n0.135 ± 0.053\n0.367 ± 0.062\n0.93 (0.20)\n1.05 (0.27)\n0.88 (0.24)\n0.94 (0.26)\n\nrsSL+WL\n0.221 ± 0.012\n0.276 ± 0.013\n0.320 ± 0.017\n0.235 ± 0.012\n0.206 ± 0.014\n0.204 ± 0.010\n0.306 ± 0.025\n0.287 ± 0.023\n0.324 ± 0.018\n0.93 (0.11)\n1.04 (0.12)\n0.95 (0.12)\n1.001 (0.11)\n\nrsX,forw\n0.4080.007\n−0.007\n0.3150.006\n−0.006\n0.3510.007\n−0.007\n0.1200.002\n−0.002\n0.1070.002\n−0.002\n0.1200.003\n−0.003\n0.3660.006\n−0.006\n0.3550.005\n−0.006\n0.2230.004\n−0.004\n0.89 (0.33)\n0.98 (0.32)\n1.10 (0.18)\n1.17 (0.22)\n\nrsX,back\n0.4090.038\n−0.037\n0.3600.026\n−0.036\n0.4030.043\n−0.027\n0.1240.009\n−0.006\n0.1240.008\n−0.007\n0.1160.008\n−0.007\n0.3860.001\n−0.007\n0.3860.002\n−0.008\n0.2510.019\n−0.022\n0.97 (0.36)\n1.06 (0.34)\n1.20 (0.17)\n1.27 (0.21)\n\nno g51\nno g51\nDMonly\nrs,true\n0.310\n0.310\n0.310\n0.241\n0.241\n0.241\n0.299\n0.299\n0.299\n\nno g51\nno g51\n\nFirst of all, given the results discussed above, it is not\nsurprising that lensing and X-ray mass estimates in individual galaxy clusters can differ by up to 100%. This is clear in\nFig.19, where the lensing masses are shown as a function of\ntheir X-ray equivalents. The lensing masses are obtained with\nthe SL+WL method. The X-ray masses are obtained with the\nforward method. The discrepancies in the simulated sample are\nconsistent with those observed in several galaxy clusters. As an\nexample, we over-plot with asterisks the mass measurements\n\nof a sample of 18 galaxy clusters reported by Mahdavi et al.\n(2008) (M08 in the following discussion).\nSeveral recent studies seem to agree on the fact that the\nlensing masses are on average larger than the X-ray masses.\nFor example, analyzing a sample of 19 clusters observed with\nSUBARU and XMM-Newton, Zhang et al. (2008) find that\nM500,WL /M500,X = 1.09 ± 0.08. M08 report similar results. In\nparticular, they find a trend in the ratio between lensing and\nX-ray masses as a function of the overdensity radius. While\n\n\fM. Meneghetti et al.: Weighing simulated galaxy clusters using lensing and X-ray\n\nX-ray and the lensing masses are consistent with each other\nat R2500 (M2500,X /M2500,WL = 1.03 ± 0.07), their mean ratio\nbecomes 0.78 ± 0.09 at R500 . Correcting for excess correlated\nstructure outside the virial radius, they find M2500,X /M2500,WL =\n1.06 ± 0.07 and M500,X /M500,WL = 0.85 ± 0.10. Very recently, Zhang et al. (2009) (Z09 in the following), studying\na sample of 12 clusters divided into relaxed and unrelaxed\non the basis of their X-ray morphology, also find that the\nweak lensing masses exceed the X-ray masses at large radii\n(or low over-densities), while they are comparable at small\nradii (or high over-densities). However, they measure a shallower but still significant radial evolution of MX /ML compared to M08. For the sub-sample of relaxed clusters, they\nfind M2500,X /M2500,WL = 1.04 ± 0.08 and M500,X /M500,WL =\n0.91 ± 0.06 on average, while for the whole sample of objects\nthey find M2500,X /M2500,WL = 0.97±0.07 and M500,X /M500,WL =\n0.94 ± 0.05. Such trend is interpreted as an indication of lack\nof hydrostatic equilibrium in galaxy clusters (Churazov et al.\n2008).\nWe repeat here the analysis of M08 and Z09 using our simulated clusters. Following the terminology of M08, we indicate\nwith a∆ the ratio between the X-ray and 3D-lensing masses for\na particular overdensity ∆. We measure a∆ for ∆ = 2500, 1000,\n500, and 200. Consistently with M08 and Z09, we estimate a∆\nby minimizing a χ2 statistic defined as\nχ2 =\n\nX (M∆,X − a∆ M∆,L )2\n,\nσ2∆,X + a2∆ σ2∆,L\n\n(29)\n\nwhere σ∆,X and σ∆,L are the errors on the X-ray and lensing\nmasses corresponding to the overdensity ∆. The errors on a∆\nare estimated by by locating the values at which χ2 − χmin = 1,\nwhich correspond to the 68% condence interval. For this analysis, we use the lensing masses obtained from the SL+WL\nmethod and the X-ray masses obtained from both the forward\nand the backward methods. Note that the lensing masses in\nM08 and Z09 are obtained with the NFW fit method. We opt\nfor the SL+WL method because our sample is limited and a\nsignificant fraction of our clusters has significant substructures.\nUnder these conditions the efficiency of the NFW fit method to\nobtain reliable mass estimates is limited, as we discussed in\nSect. 4.1.2. The results are shown by the squares in Fig. 20,\nwhere we plot a∆ as a function of ∆. For comparison, we overplot the data-points taken from Fig. 4 of M08. We also plot the\nresults obtained by Z09 for their sub-sample of relaxed clusters.. We find that the ratios between X-ray and lensing masses\nare below unity at all over-density radii. For ∆ = 2500, we find\n+0.05\na∆ = 0.9+0.05\n−0.03 and a∆ ∼ 0.910.04 using the masses derived from\nthe forward and from the backward methods, respectively. For\n∆ = 500 such ratio becomes a∆ = 0.88+0.03\n−0.02 using the forward\nmethod to measure the X-ray mass, and using the backward\nmethod it is a∆ = 0.87+0.04\n−0.04 . We do not detect a strong radial trend as reported in M08 and Z09. On the contrary, the\nratios between X-ray and lensing masses decline very gently as\na function of the overdensity radius. .\nThe important question which arises now is if the ratio between lensing and X-ray masses is a robust indicator of the lack\nof hydrostatic equilibrium in the simulated clusters. This can\n\n21\n\nFig. 19. Lensing vs X-ray masses within R2500 (diamonds), R500 (triangles), and R200 (squares). The asterisks show the mass estimates\npublished by M08 for a sample of 18 galaxy clusters. The dashed lines\ncorrespond to ML = [0.5, 1.0, 1.5, 2.0] × MX .\n\nbe easily checked by measuring the mass profile of the simulated clusters using the hydrostatic equilibrium approximation.\nFor doing this, we plug the gas density and the temperature\nprofiles measured from the particle distributions into the hydrostatic equilibrium equation and we derive the mass MHEQ .\nThis mass should be recovered by the X-ray analysis, i.e. MX\nis a measurement of MHEQ . This mass is compared to the true\nmass Mtrue as in Rasia et al. (2004). By considering the three\nclusters, we obtain the median profile of the ratio between hydrostatic equilibrium and total mass, shown by the dashed line\nin Fig. 20. For comparison, we indicate with asterisks the ratios between X-ray and true masses at each over-density radius.\nIn these simulations, the median MHEQ /Mtrue is ∼ 0.9 between\nR2500 and R1000 and then it decreases to 0.84 and 0.8 at R500 and\nR200 . The X-ray masses are compatible (within the 68% confidence limit) with MHEQ . The mass derived with the backward\nmethod declines more steeply than that obtained with the forward method as ∆ decreases, and seems to follow more closely\nthe behaviour of MHEQ , although the differences are not significant given the error-bars. MX /ML is also compatible with\nMHEQ /Mtrue . This is true only at the 2σ significance level for\n∆ < 500. Thus, we conclude that lensing and X-ray observations and their comparison to the simulations can provide\nimportant information on the physics of the gas in galaxy clusters. Note that, although we have considered a small sample\nof clusters, averaging over several objects significantly reduces\nthe impact of triaxiality. Indeed, at all overdiensities, MX /ML\nis very similar to MX /Mtrue , indicating that ML ∼ Mtrue on average.\nIn Table 4 we report the mean, the r.m.s., the median, the\nfirst and the third quartiles, and the minimal and maximal values of the distributions of several mass ratios. Not only we\ncompare 3D vs 3D masses, but we also compare 3D vs 2D\nmass estimates and vice-versa. We note that triaxiality and substructure affect the 2D X-ray mass estimates consistently to the\n3D lensing mass estimates. For example the r.m.s. of the ratio\nM2D,X /M2D,L is of order ∼ 17 − 18%, similar to the r.m.s. of\n\n\f22\n\nM. Meneghetti et al.: Weighing simulated galaxy clusters using lensing and X-ray\n\nFig. 20. Ratio between X-ray and lensing masses as a function of the\noverdensity ∆ (squares). The results are shown for the X-ray masses\nobtained with the forward (red) and with the backward (blue) methods\nand for the lensing masses obtained with the SL+WL method. For\ncomparison, we also show the ratios between the X-ray masses and\nthe true masses of the clusters (asterisks) and the ratios between the\nmasses determined via the hydrostatic equilibrium equation using the\ntrue gas density and temperature profiles and the true masses (dashed\nline). The diamonds and the triangles show the results published by\nM08 and Z09, based on the analysis of a sample of 18 and 12 galaxy\nclusters, respectively. The data-points are slightly shifted along the ∆axis at each over-density, in order to avoid overlapping and facilitating\nthe comparisons.\n\nthe ratio M3D,X /M3D,L . Not surprisingly, the mass ratio which\nhas the smaller scatter is M3D,X /M2D,L , whose r.m.s. is ∼ 13%.\nHowever, the radial dependence of this mass ratio is stronger\nthan for M3D,X /M3D,L or M2D,X /M2D,L as indicated by the variation of the mean and of the median as a function of the overdensity ∆. Obviously, the mass ratio which is affected by the\nlargest scatter is M2D,X /M3D,L (∼ 25%).\n\n–\n\n–\n\n5. Summary and conclusions\nIn this paper, we have tested several methods to derive the\nmass of galaxy clusters via lensing and X-ray observations.\nTo do so, we have used two pipelines for simulating observations of galaxy clusters obtained from N-body and hydrodynamical simulations. These are the code SkyLens, which produces mock observations with a variety of telescopes in the optical bands, including lensing effects by matter along the line\nof sight, and the code XMAS, which allows to mimic X-ray observations of galaxy clusters with the Chandra and the XMMNewton telescopes. In our analysis, we have used three massive\ngalaxy clusters at redshifts between z = 0.2335 and z = 0.297.\nEach cluster has been projected along three orthogonal axes\nand each projection has been analyzed individually. For each\ncluster projection, we have carried out both the lensing and the\nX-ray analysis using standard techniques to derive the mass\nprofiles.\nOur results can be summarized as follows:\n– strong lensing parametric mass reconstructions provide\nvery accurate estimates of the projected mass, but only in\n\n–\n\n–\n\nthe regions probed by the strong lensing features. Our simulations show that within the Einstein rings, the input masses\nare recovered with an accuracy of . 20%. For most of the\ncases, the measured masses differ from the input ones by\nonly a few percent. The precision depends on the complexity of the lens and on the number of lensing constraints\navailable. For example, using central images improves the\nmass estimates in the very inner regions. On the other hand,\nextrapolating the mass models to radii larger than those\nprobed by strong lensing may easily result in mass estimates wrong by up to 40 − 50%. In particular, the assumptions made for modeling the star distribution in the BCG\naffect the mass profiles at large radii. Although the very\ncentral regions of numerically simulated clusters may be\nnot well representative of those of real clusters, given the\nuncertainties on the treatment of small-scale physics of the\nintra-cluster gas, our results warn against potential biases\nwhich may affect the strong lensing mass estimates;\nweak lensing methods for measuring the projected mass\nperform well with galaxy clusters characterized by regular mass distributions, i.e. without massive substructures\nwhich produce a significant shear. If present, such substructures need to be properly modeled. If not, the cluster masses\ncan be over- or under-estimated by up to 50%, when assuming that the shear signal is tangential to a unique mass center. Non-parametric methods combining weak and strong\nlensing, which by construction do not assume any symmetry in the lensing signal, perform well even in the case of\nclusters disturbed by massive substructures. The mass estimates at R2500 , R500 , and R200 are typically recovered within\na 20% accuracy, being more accurate at the smallest radii;\ndeprojection of the lensing masses introduces a significant scatter in the ratio between estimated and true masses.\nCluster triaxiality causes that the accuracy of 3D-mass estimates depends on the orientation of the lens with respect\nto the line of sight. For clusters whose major axis points\ntowards the observer the 3D-mass is over-estimated, while\nthe opposite happens for clusters oriented perpedicularly to\nthe line of sight. Cluster substructures also cause errors during the de-projection, as the distance of the substructures\nfrom the cluster center along the line of sight is unknown;\nX-ray masses are typically biased low by 5 − 20% due to\nthe lack of hydrostatic equilibrium in the simulated clusters. The average bias between R2500 and R200 is ∼ 10%. In\nfact, the accretion of material from the surroundings during\nthe cluster formation process causes bulk motions which\ncontribute to the pressure support of the gas. As shown\nin previous works, this effect is radial dependent, i.e. it is\nlarger in the outer regions. We investigated whether the ratio of X-ray-to-lensing masses a∆ can be used as a tracer\nof hydrostatic equilibrium. By averaging over the sample,\nwe find that such ratio is indeed reproducing the lack of hydrostatic equilibrium in the input simulations, although the\nnumber of clusters available is limited and despite the effects of triaxiality and substructures which affect the cluster\n3D-mass estimates.\nthe gas mass is well reconstructed within the region from\nwhich we can extract a surface brightness profile. Almost\n\n\fM. Meneghetti et al.: Weighing simulated galaxy clusters using lensing and X-ray\n\n23\n\nTable 4. Summary of the comparison between lensing, X-ray, and true masses. We report the mean, the r.m.s., the median, the first and the third\nquartiles, and the minimal and maximal values of the ratios between 3D and 2D masses obtained via lensing and X-ray analyses and from the\ninput simulations. The lensing masses are measured with the SL+WL method. For the X-ray masses we use both the forward and the backward\nmethods.\nratio\nforw /M\nM3D,X\n3D,true\nforw /M\nM3D,X\n3D,true\nforw /M\nM3D,X\n3D,true\nback /M\nM3D,X\n3D,true\nback /M\nM3D,X\n3D,true\nback\nM3D,X /M3D,true\nM3D,L /M3D,true\nM3D,L /M3D,true\nM3D,L /M3D,true\nforw /M\nM3D,X\n3D,L\nforw /M\nM3D,X\n3D,L\nforw\nM3D,X /M3D,L\nback /M\nM3D,X\n3D,L\nback /M\nM3D,X\n3D,L\nback\nM3D,X /M3D,L\nM2D,L /M3D,true\nM2D,L /M3D,true\nM2D,L /M3D,true\nforw /M\nM2D,X\n3D,true\nforw /M\nM2D,X\n3D,true\nforw\nM2D,X /M3D,true\nback /M\nM2D,X\n3D,true\nback /M\nM2D,X\n3D,true\nback /M\nM2D,X\n3D,true\nforw /M\nM2D,X\n2D,L\nforw /M\nM2D,X\n2D,L\nforw /M\nM2D,X\n2D,L\nback /M\nM2D,X\n2D,L\nback /M\nM2D,X\n2D,L\nback\nM2D,X /M2D,L\nforw /M\nM2D,X\n3D,L\nforw /M\nM2D,X\n3D,L\nforw\nM2D,X /M3D,L\nback /M\nM2D,X\n3D,L\nback /M\nM2D,X\n3D,L\nback /M\nM2D,X\n3D,L\nforw /M\nM3D,X\n2D,L\nforw /M\nM3D,X\n2D,L\nforw /M\nM3D,X\n2D,L\nback /M\nM3D,X\n2D,L\nback /M\nM3D,X\n2D,L\nback\nM3D,X /M2D,L\n\n∆\n2500\n500\n200\n\nmean\n0.9241\n0.8811\n0.8947\n\nr.m.s.\n0.1147\n0.0538\n0.0625\n\nmedian\n0.8854\n0.8950\n0.9162\n\n1st quart.\n0.8451\n0.8594\n0.8534\n\n3rd quart.\n0.9730\n0.9059\n0.9293\n\nmin\n0.8007\n0.7640\n0.7749\n\nmax\n1.1143\n0.9493\n0.9759\n\n2500\n500\n200\n2500\n500\n200\n2500\n500\n200\n\n0.9205\n0.8961\n0.8832\n1.0233\n0.9963\n0.9807\n0.9303\n0.9062\n0.9395\n\n0.0690\n0.0582\n0.0664\n0.1686\n0.1661\n0.1734\n0.2193\n0.1521\n0.1802\n\n0.9018\n0.8826\n0.9019\n0.9683\n0.9374\n0.8891\n0.8917\n0.9429\n1.0091\n\n0.8669\n0.8817\n0.8878\n0.9093\n0.8930\n0.8682\n0.8303\n0.8837\n0.7915\n\n0.9669\n0.9288\n0.9126\n1.1033\n1.0251\n1.0783\n1.0034\n1.0167\n1.0815\n\n0.8512\n0.7753\n0.7192\n0.8290\n0.8362\n0.8234\n0.5850\n0.5686\n0.6017\n\n1.0407\n0.9853\n0.9559\n1.3687\n1.3438\n1.2879\n1.3441\n1.0768\n1.1127\n\n2500\n500\n200\n2500\n500\n200\n2500\n500\n200\n\n0.9230\n0.9244\n0.9307\n1.4898\n1.2924\n1.2171\n1.2850\n1.0477\n0.8961\n\n0.1776\n0.1731\n0.1937\n0.2485\n0.2151\n0.2092\n0.0757\n0.0852\n0.0835\n\n0.9109\n0.9415\n1.0088\n1.4317\n1.2127\n1.1109\n1.2744\n1.0376\n0.8839\n\n0.8416\n0.8926\n0.8374\n1.3671\n1.1838\n1.0700\n1.2627\n0.9853\n0.8446\n\n0.9934\n1.0690\n1.0541\n1.5457\n1.3059\n1.3212\n1.3288\n1.0810\n0.9382\n\n0.6219\n0.5770\n0.5584\n1.1611\n1.0607\n1.0545\n1.1276\n0.9179\n0.7449\n\n1.2553\n1.1108\n1.1353\n2.0612\n1.7788\n1.6244\n1.3839\n1.1760\n1.0162\n\n2500\n500\n200\n\n1.3211\n1.1164\n1.0124\n\n0.0754\n0.1121\n0.0990\n\n1.3317\n1.1106\n1.0200\n\n1.2903\n1.0643\n0.9919\n\n1.3520\n1.1270\n1.0436\n\n1.2052\n0.9497\n0.8108\n\n1.4415\n1.3130\n1.1585\n\n2500\n500\n200\n\n0.8875\n0.8314\n0.7596\n\n0.1733\n0.1503\n0.1629\n\n0.8901\n0.8790\n0.7949\n\n0.8221\n0.7545\n0.6388\n\n0.9779\n0.9272\n0.8664\n\n0.5471\n0.5160\n0.4586\n\n1.1702\n0.9834\n0.9636\n\n2500\n500\n200\n\n0.9103\n0.8889\n0.8609\n\n0.1657\n0.1825\n0.1951\n\n0.9301\n0.9475\n0.9259\n\n0.8634\n0.8150\n0.7507\n\n1.0259\n1.0299\n0.9638\n\n0.5847\n0.5339\n0.4991\n\n1.1584\n1.0827\n1.0827\n\n2500\n500\n200\n\n1.2929\n1.0801\n0.9450\n\n0.2579\n0.2064\n0.2123\n\n1.3392\n1.1532\n0.9728\n\n1.1445\n0.9612\n0.7828\n\n1.5218\n1.1762\n1.0552\n\n0.8239\n0.6830\n0.5783\n\n1.6389\n1.3297\n1.2341\n\n2500\n500\n200\n\n1.3274\n1.1553\n1.0711\n\n0.2560\n0.2502\n0.2524\n\n1.3326\n1.2023\n1.1663\n\n1.2020\n1.0383\n0.9198\n\n1.5853\n1.3064\n1.1748\n\n0.8806\n0.7067\n0.6295\n\n1.6223\n1.4481\n1.3760\n\n2500\n500\n200\n\n0.6407\n0.6985\n0.7557\n\n0.1612\n0.1166\n0.1407\n\n0.6212\n0.7281\n0.8147\n\n0.5728\n0.6838\n0.6459\n\n0.6556\n0.7519\n0.8509\n\n0.3885\n0.4295\n0.4771\n\n0.9597\n0.8489\n0.9013\n\n2500\n500\n200\n\n0.6352\n0.7120\n0.7485\n\n0.1302\n0.1299\n0.1510\n\n0.6173\n0.7391\n0.8009\n\n0.5895\n0.7006\n0.6834\n\n0.6479\n0.7906\n0.8633\n\n0.4129\n0.4359\n0.4428\n\n0.8963\n0.8757\n0.8933\n\nindipendently of the dynamical state of the cluster the gas\nmass con be recovered, on average, with average deviation\nof 1 ± 3% at R2500 and 7 ± 4% between R500 and R200 .\nThese results indicate that the comparison between lensing\nand X-ray mass estimates in individual systems can be very\nmisleading, due to the fact that these two observables probe\ndifferent quantities. While lensing probes the matter projected\nalong the line of sight to the clusters, the X-ray emission from\nthe intra-cluster gas probes the three-dimensional gravitational\npotential. Thus, a direct comparison between lensing and Xray masses is possible only in those systems which are characterized by large degrees of spherical symmetry. Additional\ncomplications are caused by substructures, which largely affect the weak lensing measurements, at least using some methods of converting the shear into a mass estimate. Combining\nstrong and weak lensing, we obtain on average a very small\nbias in the mass estimates (∼ 2%) but the scatter is pretty high\n(∼ 17 − 23%). On the contrary, X-ray masses are affected by\n\na more substantial bias (∼ 10%) but the scatter is smaller by\nalmost a factor of three.\nFinally, strong lensing alone provides mass estimates which\nare reliable only in a very small region around the cluster core,\nwhich cannot be probed by X-ray. Extrapolating the strong\nlensing mass models to the radii probed by X-ray (and viceversa) may result in significantly large mismatches between\nmass estimates. Note however that the difficulty to fit the strong\nlensing data in simulations with cooling and star formation using the approximations which are commonly used in observations is very likely to be due to the unrealistic core structure of\nthe simulated clusters.\nNevertheless, it is remarkable that, by averaging over the\nwhole sample, we have been able to reproduce the ratio between true and hydrostatic equilibrium masses seen in the simulations, under the assumption that the former is given by lensing and the latter by X-ray. This suggests that, with a sufficiently large sample of clusters with wide-field imaging and\nX-ray observations, the impact of several noises affecting the\n\n\f24\n\nM. Meneghetti et al.: Weighing simulated galaxy clusters using lensing and X-ray\n\nmass estimates can be reduced. These are positive news and\nsuggest that weak lensing masses may be used as reliable calibrators for the scaling relations involving the X-ray observables, like the M − LX , the M − T X , and the M − YX relations.\nMoreover, the scatter due to triaxiality in the calibration can\npotentially be reduced. In fact, although its radial dependence\nis stronger, the ratio between 3D X-ray masses and 2D lensing\nmasses is affected by a smaller scatter than the ratio between\n3D or 2D X-ray and lensing masses.\nAcknowledgements. We acknoweldge financial contribution from\ncontracts ASI-INAF I/023/05/0, ASI-INAF I/088/06/0 and INFN\nPD51. Support for this work was provided also by NASA through\nChandra Postdoctoral Fellowship grant number PF5-70042 awarded\nby the Chandra X-ray Center, which is operated by the Smithsonian\nAstrophysical Observatory for NASA under the contract NAS803060. ER acknoweldges the Michigan Society of Fellow. We are\ngrateful to L. Moscardini for having carefully read the manuscript and\nprovided useful comments. MM thanks Yu-Ying Zhang and collaborators for providing a draft of their paper. MM thanks the Institut für\nTheoretische Astrophysik of the University of Heidelberg for hospitality during the preparation of this manuscript. The work has been performed under the HPC-EUROPA2 project (project number: 228398)\nwith the support of the European Commission - Capacities Area Research Infrastructures. We are grateful to Y. Suto and S. Miyazaki\nfor their help implementing the Subaru interface in the SkyLens simulator. We thank the anonymous referee for his useful comments.\nMM thanks Paolo for his cooperation during the preparation of the\nmanuscript.\n\nReferences\nAllen, S. 1998, MNRAS, 296, 392\nAllen, S. W., Ettori, S., & Fabian, A. C. 2001, MNRAS, 324, 877\nAllen, S. W., Rapetti, D. A., Schmidt, R. W., et al. 2008, MNRAS,\n383, 879\nAllen, S. W., Schmidt, R. W., Ebeling, H., Fabian, A. C., & van\nSpeybroeck, L. 2004, MNRAS, 353, 457\nAmeglio, S., Borgani, S., Pierpaoli, E., et al. 2009, MNRAS, 394, 479\nArnaud, K. A. 1996, in Astronomical Society of the Pacific\nConference Series, Vol. 101, Astronomical Data Analysis Software\nand Systems V, ed. G. H. Jacoby & J. Barnes, 17–+\nAubert, D., Amara, A., & Metcalf, R. B. 2007, MNRAS, 376, 113\nBartelmann, M. 1995, A&A, 299, 11\nBartelmann, M. 1996, A&A, 313, 697\nBartelmann, M. & Schneider, P. 2001, Physics Reports, 340, 291\nBartelmann, M. & Steinmetz, M. 1996, MNRAS, 283, 431\nBeckwith, S. V. W., Stiavelli, M., Koekemoer, A. M., et al. 2006, AJ,\n132, 1729\nBenı́tez, N. 2000, ApJ, 536, 571\nBradač, M., Erben, T., Schneider, P., et al. 2005, A&A, 437, 49\nBuote, D. A., Gastaldello, F., Humphrey, P. J., et al. 2007, ApJ, 664,\n123\nChurazov, E., Forman, W., Vikhlinin, A., et al. 2008, MNRAS, 388,\n1062\nClowe, D., Gonzalez, A., & Markevitch, M. 2004, ApJ, 604, 596\nClowe, D., Luppino, G. A., Kaiser, N., Henry, J. P., & Gioia, I. M.\n1998, ApJ, 497, L61+\nCoe, D., Benı́tez, N., Sánchez, S. F., et al. 2006, AJ, 132, 926\nComerford, J. M., Meneghetti, M., Bartelmann, M., & Schirmer, M.\n2006, ApJ, 642, 39\nComerford, J. M. & Natarajan, P. 2007, MNRAS, 379, 190\n\nCorless, V. L. & King, L. J. 2007, MNRAS, 380, 149\nDolag, K., Vazza, F., Brunetti, G., & Tormen, G. 2005, MNRAS, 364,\n753\nDonnarumma, A., Ettori, S., Meneghetti, M., & Moscardini, L. 2009,\nMNRAS, 398, 438\nEisenstein, D. J., Zehavi, I., Hogg, D. W., et al. 2005, ApJ, 633, 560\nEttori, S., De Grandi, S., & Molendi, S. 2002, A&A, 391, 841\nEttori, S. & Lombardi, M. 2003, A&A, 398, L5\nEttori, S., Tozzi, P., & Rosati, P. 2003, A&A, 398, 879\nEvrard, A. E., Metzler, C. A., & Navarro, J. F. 1996, ApJ, 469, 494\nFahlman, G., Kaiser, N., Squires, G., & Woods, D. 1994, ApJ, 437, 56\nGardini, A., Rasia, E., Mazzotta, P., et al. 2004, MNRAS, 351, 505\nGiavalisco, M., Ferguson, H. C., Koekemoer, A. M., et al. 2004, ApJ,\n600, L93\nGolse, G., Kneib, J.-P., & Soucail, G. 2002, A&A, 387, 788\nHenriksen, M. J. & Mushotzky, R. F. 1986, ApJ, 302, 287\nHoekstra, H. 2001, A&A, 370, 743\nHoekstra, H. 2003, MNRAS, 339, 1155\nHoekstra, H. 2007, MNRAS, 379, 317\nHoekstra, H., Franx, M., Kuijken, K., & Squires, G. 1998, ApJ, 504,\n636\nJenkins, A., Frenk, C., White, S., et al. 2001, MNRAS, 321, 372\nJullo, E., Kneib, J.-P., Limousin, M., et al. 2007, New Journal of\nPhysics, 9, 447\nKaiser, N., Squires, G., & Broadhurst, T. 1995, ApJ, 449, 460\nKneib, J., Mellier, Y., Fort, B., & Mathez, G. 1993, A&A, 273, 367\nKomatsu, E., Dunkley, J., Nolta, M. R., et al. 2009, ApJS, 180, 330\nKravtsov, A. V., Vikhlinin, A., & Nagai, D. 2006, ApJ, 650, 128\nLau, E. T., Kravtsov, A. V., & Nagai, D. 2009, ApJ, 705, 1129\nLiedahl, D. A., Osterheld, A. L., & Goldstein, W. H. 1995, ApJ, 438,\nL115\nLimousin, M., Richard, J., Jullo, E., et al. 2007, ApJ, 668, 643\nLuppino, G. A. & Kaiser, N. 1997, ApJ, 475, 20\nMahdavi, A., Hoekstra, H., Babul, A., & Henry, J. P. 2008, MNRAS,\n384, 1567\nMantz, A., Allen, S. W., & Rapetti, D. 2009a, ArXiv e-prints\n0911.1788\nMantz, A., Allen, S. W., Rapetti, D., & Ebeling, H. 2009b, ArXiv eprints 0909.3098\nMarkevitch, M., Gonzalez, A. H., Clowe, D., et al. 2004, ApJ, 606,\n819\nMaturi, M., Meneghetti, M., Bartelmann, M., Dolag, K., &\nMoscardini, L. 2005, A&A, 442, 851\nMedezinski, E., Broadhurst, T., Umetsu, K., et al. 2007, ApJ, 663, 717\nMeneghetti, M., Argazzi, R., Pace, F., et al. 2007, A&A, 461, 25\nMeneghetti, M., Bartelmann, M., & Moscardini, L. 2003a, MNRAS,\n346, 67\nMeneghetti, M., Bartelmann, M., & Moscardini, L. 2003b, MNRAS,\n340, 105\nMeneghetti, M., Melchior, P., Grazian, A., et al. 2008, A&A, 482, 403\nMerten, J., Cacciato, M., Meneghetti, M., Mignone, C., & Bartelmann,\nM. 2009, A&A, 500, 681\nMewe, R., Gronenschild, E. H. B. M., & van den Oord, G. H. J. 1985,\nA&AS, 62, 197\nNagai, D., Vikhlinin, A., & Kravtsov, A. V. 2007, ApJ, 655, 98\nNavarro, J., Frenk, C., & White, S. 1997, ApJ, 490, 493\nOkabe, N., Takada, M., Umetsu, K., Futamase, T., & Smith, G. P.\n2009, ArXiv e-prints 0903.1103\nOta, N., Pointecouteau, E., Hattori, M., & Mitsuda, K. 2004, ApJ, 601,\n120\nPercival, W. J., Cole, S., Eisenstein, D. J., et al. 2007, MNRAS, 381,\n1053\n\n\fM. Meneghetti et al.: Weighing simulated galaxy clusters using lensing and X-ray\nPerlmutter, S., Aldering, G., Goldhaber, G., Knop, R., et al. 1999, ApJ,\n517, 565\nPiffaretti, R. & Valdarnini, R. 2008, A&A, 491, 71\nPointecouteau, E., Arnaud, M., & Pratt, G. W. 2005, A&A, 435, 1\nPress, W. & Schechter, P. 1974, ApJ, 187, 425\nPuchwein, E., Bartelmann, M., Dolag, K., & Meneghetti, M. 2005,\nA&A, 442, 405\nRasia, E., Ettori, S., Moscardini, L., et al. 2006, MNRAS, 369, 2013\nRasia, E., Mazzotta, P., Bourdin, H., et al. 2008, ApJ, 674, 728\nRasia, E., Tormen, G., & Moscardini, L. 2004, MNRAS, 351, 237\nReblinsky, K. & Bartelmann, M. 1999, A&A, 345, 1\nRefregier, A. 2003, MNRAS, 338, 35\nRiemer-Sørensen, S., Paraficz, D., Ferreira, D. D. M., et al. 2009, ApJ,\n693, 1570\nRiess, A., Strolger, L.-G., Tonry, J., Casertano, S., et al. 2004, ApJ,\n607, 665\nRiess, A. G., Filippenko, A. V., Challis, P., et al. 1998, AJ, 116, 1009\nSalpeter, E. E. 1955, ApJ, 121, 161\nSand, D. J., Treu, T., Ellis, R. S., Smith, G. P., & Kneib, J.-P. 2008,\nApJ, 674, 711\nSarazin, C. L. 1988, X-ray emission from clusters of galaxies, ed. C. L.\nSarazin\nSaro, A., Borgani, S., Tornatore, L., et al. 2006, MNRAS, 373, 397\nSchmidt, R. W. & Allen, S. W. 2007, MNRAS, 379, 209\nSheth, R. & Tormen, G. 2002, MNRAS, 329, 61\nSmith, G. P., Kneib, J.-P., Smail, I., et al. 2005, MNRAS, 359, 417\nSpringel, V. 2005, MNRAS, 364, 1105\nSpringel, V., White, S. D. M., Tormen, G., & Kauffmann, G. 2001,\nMNRAS, 328, 726\nTormen, G., Bouchet, F., & White, S. 1997, MNRAS, 286, 865\nTornatore, L., Borgani, S., Dolag, K., & Matteucci, F. 2007, MNRAS,\n382, 1050\nTornatore, L., Borgani, S., Matteucci, F., Recchi, S., & Tozzi, P. 2004,\nMNRAS, 349, L19\nVikhlinin, A., Kravtsov, A. V., Burenin, R. A., et al. 2009, ApJ, 692,\n1060\nVikhlinin, A., Markevitch, M., Murray, S. S., et al. 2005, ApJ, 628,\n655\nWarren, M. S., Abazajian, K., Holz, D. E., & Teodoro, L. 2006, ApJ,\n646, 881\nWhite, M. & Vale, C. 2004, Astroparticle Physics, 22, 19\nWu, X.-P. & Mao, S. 1996, ApJ, 463, 404\nYoshida, N., Sheth, R., & Diaferio, A. 2001, MNRAS, 328, 669\nYoshida, N., Springel, V., White, S. D. M., & Tormen, G. 2000, ApJ,\n544, L87\nZhang, Y.-Y., Finoguenov, A., Böhringer, H., et al. 2008, A&A, 482,\n451\nZhang, Y.-Y., Okabe, N., Finoguenov, A., et al. 2009, in prep\n\nAppendix A: Lensing definitions\nIn this Sect., we summarize some lensing definitions which will be\nuseful in the rest of the paper.\nWe start with an isolated lens whose surface-mass density is Σ(θ)\nat the angular position θ on the sky. Its lensing potential is\nψ(θ) =\n\n4G Dl Ds\nc2 Dls\n\nZ\n\nd2 θ0 Σ(θ0 ) ln |θ − θ0 | ,\n\n(A.1)\n\nwhere Dl,s,ls are the usual angular-diameter distances between the observer and the lens, the observer and the source, and the lens and the\n\n25\n\nsource, respectively. The reduced deflection angle experienced by a\nlight ray crossing the lens plane at θ is the gradient of the potential,\nα(θ) = ∇ψ(θ) .\n\n(A.2)\n\nThe image positions θ for a source located at β are given by the lens\nequation\nβ = θ − α(θ) .\n\n(A.3)\n\nFor sources much smaller than the typical scales on which the lens\nproperties vary, the lens mapping can be linearised. The deformation\nof images with respect to the source is then given by the Jacobian\nmatrix\n!\n!\n∂β\n∂2 ψ(θ)\n1 − κ − γ1\n−γ2\nA≡\n=\n.\n(A.4)\n= δi j −\n−γ2\n1 − κ + γ1\n∂θ\n∂θi ∂θ j\nHere, κ is the convergence\nκ(θ) =\n\nΣ(θ) 1\n= (ψ11 + ψ22 ) ,\nΣcr\n2\n\n(A.5)\n\ni.e. the surface-mass density scaled by its critical value\nΣcr =\n\nc2 Dls\n.\n4πG Dl Ds\n\n(A.6)\n\nThe distortion is described by the two components of the shear,\nγ1 =\n\n1\n(ψ11 − ψ22 ) ,\n2\n\nγ2 = ψ12 ,\n\n(A.7)\n\nwhich are combined into the complex shear γ ≡ γ1 + iγ2 . We further\nuse the common abbreviation\n∂2 ψ(θ)\n≡ ψi j .\n∂θi ∂θ j\n\n(A.8)\n\nThe inverse of the Jacobian determinant defines the magnification\nfactor\nμ(θ) =\n\n1\ndet A(θ)\n\n(A.9)\n\nThe loci on the image plane where det A = 0, i.e. where the magnification diverges, are the tangential and the radial critical lines. These\nform where the tangential and the radial eigenvalues of the Jacobian\ndeterminant nullifies:\nλt = 1 − κ − γ = 0\n\n(A.10)\n\nλr = 1 − κ + γ = 0 .\n\n(A.11)\n\nThe inverses of the eigenvalues of the Jacobian matrix define the tangential and the radial magnifications: images forming close to the tangential or to the radial critical lines are highly elongated tangentially\nor perpendicularly to the critical lines, respectively.\nThe critical lines are mapped onto the caustics on the source\nplane, via the lens equation. The caustics encompass regions of the\nsource plane which are characterized by different multiplicities of the\nimages.\nOutside critical curves, image ellipticities are determined by the\ncomplex reduced shear\ng(θ) ≡\n\nγ(θ)\n.\n1 − κ(θ)\n\n(A.12)\n\nIn the weak-lensing limit, κ \u001c 1, and the reduced shear approximates\nthe shear, g ≈ γ, to first order.\nSource and image shapes are quantified by the complex ellipticity\n\u000f=\n\na − b 2iθ\ne ,\na+b\n\n(A.13)\n\n\f26\n\nM. Meneghetti et al.: Weighing simulated galaxy clusters using lensing and X-ray\n\nwhere a and b are the semi-major and semi-minor axes of an ellipse\nfitting the object's surface-brightness distribution. The position angle\nof the ellipse's major axis is θ. The expectation value of the intrinsic\nsource ellipticity \u000fs is assumed to vanish.\nA sufficiently small source with ellipticity \u000fs is imaged to have an\nellipticity\n\u000f=\n\n\u000fs + g\n,\n1 + g∗ \u000fs\n\n(A.14)\n\nwhere the asterisk denotes complex conjugation. This equation illustrates that the lensing distortion is determined by the reduced shear,\nwhich is the only lensing quantity directly accessible through measurements of galaxy ellipticities alone.\n\nAppendix B: Individual mass profiles\nIn this Sect. we show the 3D-mass profiles (normalized to the true\nmass profiles) of each individual cluster projection in our sample. This\nallows the reader to compare the mass estimates at any radius different\nfrom R2500 , R500 , and R200 , which are already discussed in the paper.\nThe profiles are displayed in Fig. B.1 for all the lensing and the X-ray\nmethods. Additionally, we also show the mass profiles derived from\nthe true gas and temperature profiles under the assumption of hydrostatic equilibrium. These last curves are quite noisy, especially in the\ncase of g72, because we have not applied any smoothing to the data.\nIn the case of g51 the extended cooling region in the cluster center\ncauses the hydrostatic mass MHEQ to be larger than the true mass. The\nX-ray derived profiles reproduce well the trends seen in the MHEQ profiles although some differences are present. Note that, while we mask\nmany cold blobs in the simulated observations, we are not removing\nthese structures from the input clusters when calculating MHEQ . Thus,\nsome differences between the profiles are expected.\n\n\fM. Meneghetti et al.: Weighing simulated galaxy clusters using lensing and X-ray\n\n27\n\nFig. B.1. Ratios between the mass profiles recovered from the lensing and the X-ray analyses and the true 3D mass profiles of each cluster. The\nmeaning of each line is explained in the legend. The vertical dashed lines in each panel mark the positions of R2500 , R500 , and R200 , as derived\nfrom the lensing analysis (see text for more details).\n\n\f"}