{"id": "http://arxiv.org/abs/0809.3439v1", "guidislink": true, "updated": "2008-09-19T19:00:39Z", "updated_parsed": [2008, 9, 19, 19, 0, 39, 4, 263, 0], "published": "2008-09-19T19:00:39Z", "published_parsed": [2008, 9, 19, 19, 0, 39, 4, 263, 0], "title": "Long-term operation of a multi-channel cosmic muon system based on\n  scintillation counters with MRS APD light readout", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0809.1412%2C0809.5131%2C0809.4358%2C0809.0505%2C0809.5284%2C0809.2998%2C0809.3787%2C0809.0106%2C0809.3870%2C0809.3692%2C0809.2348%2C0809.1448%2C0809.1137%2C0809.4265%2C0809.0914%2C0809.4628%2C0809.0584%2C0809.1680%2C0809.0572%2C0809.2570%2C0809.3970%2C0809.1637%2C0809.1761%2C0809.0034%2C0809.0418%2C0809.0086%2C0809.2760%2C0809.2617%2C0809.5081%2C0809.4609%2C0809.1994%2C0809.0776%2C0809.1771%2C0809.1571%2C0809.0399%2C0809.5115%2C0809.2728%2C0809.3408%2C0809.1844%2C0809.2753%2C0809.1051%2C0809.1851%2C0809.3493%2C0809.5067%2C0809.3459%2C0809.1997%2C0809.5113%2C0809.2927%2C0809.2895%2C0809.3225%2C0809.0510%2C0809.3439%2C0809.0559%2C0809.5021%2C0809.0010%2C0809.4368%2C0809.5100%2C0809.0636%2C0809.1004%2C0809.2896%2C0809.1890%2C0809.4138%2C0809.0506%2C0809.4284%2C0809.5197%2C0809.5158%2C0809.1217%2C0809.5074%2C0809.2299%2C0809.1713%2C0809.2058%2C0809.3647%2C0809.1427%2C0809.2313%2C0809.3280%2C0809.4155%2C0809.2442%2C0809.2946%2C0809.4875%2C0809.5222%2C0809.0299%2C0809.0905%2C0809.2432%2C0809.4299%2C0809.1948%2C0809.2961%2C0809.0532%2C0809.5141%2C0809.1848%2C0809.1327%2C0809.2506%2C0809.0992%2C0809.3155%2C0809.0107%2C0809.4253%2C0809.1282%2C0809.3318%2C0809.2063%2C0809.3181%2C0809.4989%2C0809.0717&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Long-term operation of a multi-channel cosmic muon system based on\n  scintillation counters with MRS APD light readout"}, "summary": "A Cosmic Ray Test Facility (CRTF) is the first large-scale implementation of\na scintillation triggering system based on a new scintillation technique known\nas START. In START, the scintillation light is collected and transported by WLS\noptical fibers, while light detection is performed by pairs of avalanche\nphotodiodes with the Metal-Resistor-Semiconductor structure operated in the\nGeiger mode (MRS APD). START delivers 100% efficiency of cosmic muon detection,\nwhile its intrinsic noise level is less than 10^{-2} Hz. CRTF, consisting of\n160 START channels, has been continuously operated by the ALICE TOF\ncollaboration for more than 25 000 hours, and has demonstrated a high level of\nstability. Fewer than 10% of MRS APDs had to be replaced during this period.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0809.1412%2C0809.5131%2C0809.4358%2C0809.0505%2C0809.5284%2C0809.2998%2C0809.3787%2C0809.0106%2C0809.3870%2C0809.3692%2C0809.2348%2C0809.1448%2C0809.1137%2C0809.4265%2C0809.0914%2C0809.4628%2C0809.0584%2C0809.1680%2C0809.0572%2C0809.2570%2C0809.3970%2C0809.1637%2C0809.1761%2C0809.0034%2C0809.0418%2C0809.0086%2C0809.2760%2C0809.2617%2C0809.5081%2C0809.4609%2C0809.1994%2C0809.0776%2C0809.1771%2C0809.1571%2C0809.0399%2C0809.5115%2C0809.2728%2C0809.3408%2C0809.1844%2C0809.2753%2C0809.1051%2C0809.1851%2C0809.3493%2C0809.5067%2C0809.3459%2C0809.1997%2C0809.5113%2C0809.2927%2C0809.2895%2C0809.3225%2C0809.0510%2C0809.3439%2C0809.0559%2C0809.5021%2C0809.0010%2C0809.4368%2C0809.5100%2C0809.0636%2C0809.1004%2C0809.2896%2C0809.1890%2C0809.4138%2C0809.0506%2C0809.4284%2C0809.5197%2C0809.5158%2C0809.1217%2C0809.5074%2C0809.2299%2C0809.1713%2C0809.2058%2C0809.3647%2C0809.1427%2C0809.2313%2C0809.3280%2C0809.4155%2C0809.2442%2C0809.2946%2C0809.4875%2C0809.5222%2C0809.0299%2C0809.0905%2C0809.2432%2C0809.4299%2C0809.1948%2C0809.2961%2C0809.0532%2C0809.5141%2C0809.1848%2C0809.1327%2C0809.2506%2C0809.0992%2C0809.3155%2C0809.0107%2C0809.4253%2C0809.1282%2C0809.3318%2C0809.2063%2C0809.3181%2C0809.4989%2C0809.0717&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "A Cosmic Ray Test Facility (CRTF) is the first large-scale implementation of\na scintillation triggering system based on a new scintillation technique known\nas START. In START, the scintillation light is collected and transported by WLS\noptical fibers, while light detection is performed by pairs of avalanche\nphotodiodes with the Metal-Resistor-Semiconductor structure operated in the\nGeiger mode (MRS APD). START delivers 100% efficiency of cosmic muon detection,\nwhile its intrinsic noise level is less than 10^{-2} Hz. CRTF, consisting of\n160 START channels, has been continuously operated by the ALICE TOF\ncollaboration for more than 25 000 hours, and has demonstrated a high level of\nstability. Fewer than 10% of MRS APDs had to be replaced during this period."}, "authors": ["A. Akindinov", "V. Golovin", "E. Grigoriev", "Yu. Grishuk", "S. Kuleshov", "D. Malkevich", "A. Martemiyanov", "A. Nedosekin", "M. Ryabinin", "K. Voloshin"], "author_detail": {"name": "K. Voloshin"}, "author": "K. Voloshin", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1016/j.nima.2009.05.105", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0809.3439v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0809.3439v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "Proceedings of NDIP-2008. 8 pages, 8 figures, 6 references", "arxiv_primary_category": {"term": "physics.ins-det", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "physics.ins-det", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0809.3439v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0809.3439v1", "journal_reference": "Nucl.Instrum.Meth.A610:431-435,2009", "doi": "10.1016/j.nima.2009.05.105", "fulltext": "In memory of Alexander Smirnitskiy\n\nLong-term operation of a multi-channel cosmic muon system based\non scintillation counters with MRS APD light readout\nA. Akindinova, V. Golovinb, E. Grigorieva,c, Yu. Grishuka, S. Kuleshova,d,\nD. Mal'kevicha, A. Martemiyanova, A. Nedosekina, M. Ryabinina,\nK. Voloshina,\na\n\nb\n\nInstitute for Theoretical and Experimental Physics (ITEP), B. Cheremushkinskaya 25,\nMoscow, 117218, Russia\n\nCenter of Perspective Technologies and Apparatus (CPTA), Preobrazhenskaya pl. 6/8,\nMoscow 107076, Russia\nc\nd\n\nUniversity of Geneva, CMU, rue Michel-Servet 1, Genève 4, 1211, Switzerland\n\nDepartamento de Física y Centro de Estudios Subatómicos, Universidad Técnica\nFederico Santa María, Casilla 110-V, Valparaíso, Chile\nAbstract\n\nA Cosmic Ray Test Facility (CRTF) is the first large-scale implementation of a scintillation\ntriggering system based on a new scintillation technique known as START. In START, the scintillation light is collected and transported by WLS optical fibers, while light detection is performed\nby pairs of avalanche photodiodes with the Metal–Resistor–Semiconductor structure operated in\nthe Geiger mode (MRS APD). START delivers 100% efficiency of cosmic muon detection, while\nits intrinsic noise level is less than 10–2 Hz. CRTF, consisting of 160 START channels, has been\ncontinuously operated by the ALICE TOF collaboration for more than 25 000 hours, and has demonstrated a high level of stability. Fewer than 10% of MRS APDs had to be replaced during this period.\nKeywords: ALICE, TOF, START, Scintillation tile, Avalanche photodiode, Geiger mode.\nPACS: 07.60.Vg; 29.40.Mc; 29.40.Wk; 85.60.Dw.\n\n1.\n\nIntroduction\n\nDuring the last 15 years, a significant breakthrough has been achieved in the development of micro-cell avalanche photodiodes operated in the Geiger mode for the purpose of visible light detection\n[1]. Avalanche photodiodes with the Metal–Resistor–Semiconductor structure (MRS APD), developed\nand produced by CPTA1, have proved to be a superior solution for Geiger-mode photodetectors with\nn+–p–π–p++ structure, optimized for the detection of light in the green-red spectrum region [2]. A special meso-structure with optical decoupling of micro-cells [3] ensures that the single-photon detection\nefficiency of MRS APD is more than 25%, while its noise measured at the level of 4 photo-electrons is\nabout 1 kHz. These characteristics, together with the low bias voltage (20–50 V), low price, tiny dimensions (sensitive area of the order of 1 mm2), and insensitivity to the magnetic field, make MRS\nAPD a competitive device as compared to multi-anode PMT [1].\nInitially developed for hadron calorimetry, the method of light collection by means of WLS fibers, positioned in ring-shaped grooves inside organic scintillating plastic plates, has been imple-\n\n1\n\nFor the address, see the authors affiliation list.\n\n\fmented in a scintillation counter\nwith MRS APD light readout\n(START). The basic idea of\nSTART operation consists of simultaneous detection of light by two\nMRS APDs coupled to the opposite\nsides of a fiber piece [4].\n\nFig. 1.\n\nGeneral layout of START (external dimensions 15\n× 15 × 1.5 cm3).\n\nThe rectangular shape of\nSTART allows for coverage of\nlarge areas with multi-channel arrays of such devices. No degradation of START characteristics has\nbeen observed in the first 32channel prototype [5]. Subsequent\nimprovement of the MRS APD performance has resulted in less stringent requirements for the quality of\nscintillating plastic, making the\nusage of relatively cheap Polisterol1652 possible in large-scale START\nimplementations. This version of\nSTART was adopted as a basic\nelement of a cosmic ray test facility\n(CRTF), intended for mass tests of\nthe ALICE TOF modules [6].\n\n6\n\n10\n\nend of plateau\n95% efficiency\n\n5\n\n10\n\n104\n\nWith a compact electronic\ncard that produces coincidence signal from the two MRS APDs and is\nmounted directly on its body (see\nphoto in Fig. 1), START represents\nan autonomous scintillation counter.\n\nCount rate [Hz]\n\n3\n\n10\n\n100% efficiency plateau\nfor cosmic muons\n\n2\n\n10\n\n10\n1\n-1\n\n10\n\n-2\n\n10\n\nSignal\nNoise\n\n-3\n\n10\n\n-4\n\n10\n\n0\n\nFig. 2.\n\n2\n\n50\n\n2. START\ncharacteristics\n\n100\n150\nThreshold [mV]\n\n200\n\nSignal and noise rates of START in response to\ncosmic radiation.\n\nProduced by Polimersintez, Vladimir, Russia.\n\n2\n\nTo measure the noise characteristics and efficiency of START\nin response to cosmic particles, a\ntested START sample, sized 15 \n15  1.5 cm3, was placed in the center between two scintillation counters with plastic dimensions of 14 \n14  1 cm3, positioned 1.7 m apart.\nCoincidence of signals from the\nscintillation counters was used to\n\n\fThreshold\n\ntrigger the passage of ionizing particles through START. Signals coming from the two MRS APDs\nwere fed to discriminators with variable thresholds, which produced 50 ns-long NIM pulses. These\npulses were then sent to two coincidence circuits with time gates of 100 ns, one of the pulses being delayed for 250 ns before arrival at the second circuit. Thus, the first circuit triggered real coincidences\n(true START signals), while the second one allowed monitoring of accidental coincidences (false\nSTART signals, or noise). Individual noise rates of the MRS APDs, F1 and F2, were measured as well.\nChanges in the threshold values were applied to both discriminators simultaneously. The rate of accidental coincidences was found to be equal to F1 F2  100 ns within 5% of accuracy at all thresholds,\nwhich proved the absence of cross-talks between two photo-diode channels. Shown in Fig. 2 are the\nrates of true and false START events for different discriminator thresholds. When the threshold exceeds 100 mV (which is above the fourth photoelectron peak) the noise rate becomes less than\n10−2 Hz, while the signal rate flattens to a quasi-plateau of 8–10 Hz, this value being consistent with\nthe intensity of cosmic radiation.\n10\n5\n0\n\nMRS APD #1\n\nEntries\nMean\nRMS\n10 UDFLW\nOVLW\nALLCHAN\n\n1264\n646.3\n81.35\n.0000E+00\n10.00\n1254.\n\n0 100 200 300 400 500 600 700 800 900 1000\n\n5\n\nMRS APD #2\n\n10\n5\n\n0\n0\n\n0 100 200 300 400 500 600 700 800 900 1000\n[ADC bins]\n\n(a)\nFig. 3.\n\n200 300 400 500 600 700 800 900 10001100\n[TDC bins]\n\n(b)\n\n(a) Amplitude and (b) timing distribution of START signals, measured at the discriminator threshold of 115 mV.\n\nAmplitude spectra of the two MRS APDs and a timing spectrum of START measured relative to\nthe trigger produced by the scintillation counters are shown in Fig. 3. After cutting off the pedestal\nevents (not related to START and probably induced by high-voltage equipment positioned close to the\nsetup), the efficiency of START was evaluated by counting the number of events accumulated in the\noverflow TDC channel. With the discriminating threshold set at 115 mV (which is the case for the data\nin Fig. 3) the efficiency was found to exceed 99%. It stays this high within a wide range of discriminating thresholds, corresponding to the quasi-plateau in Fig. 2. Precise adjustment of the thresholds for\ndifferent START samples is hence not necessary, and large arrays of STARTs may be put into action\nwithout complicated calibration.\n\n3.\n\nTriggering system for CRTF\n\nThe TOF system of the ALICE experiment is based on more than 159 000 strips of Multi-Gap\nResistive Plate Chambers (MRPC), covering the area of about 150 m2 [6]. To simplify the construction\nand tests of the system, the MRPC strips are assembled in modules of three types: central (1.2 ×\n1.6 m2), intermediate (1.5 × 1.6 m2) and external (1.7 × 1.6 m2). These modules are in turn assembled\nin 18 supermodules, 5 modules in each (external–intermediate–central–intermediate–external). Beam\n3\n\n\ftests of the ALICE TOF modules turned out to be very time- and cost-consuming and were omitted. As\nan alternative, tests with rays of cosmic muons were suggested, in which up to 6 TOF modules were to\nbe positioned over each other between two trigger layers to form a telescope. The trigger signal was\nassumed to be produced by coincidence of signals from the upper and lower trigger layers. The size,\nposition and granularity of the trigger layers had to be chosen so as to provide sufficient detection and\ntracking efficiency, the latter being determined by the size of a single MRPC cell (3.5 × 2.5 cm2) and\nthe geometry of the test facility. The triggering detectors were required to possess 100% detection efficiency towards MIP and minimum noise level. For many reasons, some of which may be found in [5],\na 15 × 15 cm2 version of START was chosen as a muon triggering counter for CRTF.\n\n(a)\nFig. 4.\n\n(b)\n\nCRTF design and operation: (a) steel support frame with the two START trigger layers, (b) installation of an MRPC module into the facility.\n\nAs the photo in Fig. 4a illustrates, each trigger layer (1.2 × 1.5 m2) consisted of 80 STARTs,\ncombined in 10 strips, 8 detectors per strip. The distance between the two trigger layers was about\n2.3 m. The total number of STARTs was therefore 160, and the number of MRS APDs equaled to 320.\nBias voltages for individual MRS APDs could be adjusted by resistive dividers positioned on electronic boards, which made it possible to use a single power supply unit for all photodiodes. The rest of the\nelectronics were powered with two identical power supply units.\nThe whole setup was assembled on a steel support frame. Insertion of TOF modules was facilitated by using rollers and horizontal rails positioned on both sides of the frame, as well as a special\nmovable shelf shown on photo in Fig. 4b.\n\n4.\n\nTrigger configuration and efficiency monitoring\n\nSince the outputs of electronic cards were logical signals, the trigger formation and system monitoring were implemented by programmable logical blocks, controlled with the Labview3 package by\n\n3\n\nNational Instruments Corporation, Austin, Texas, www.ni.com .\n\n4\n\n\f(a)\nFig. 5.\n\n(b)\n\nFront panels of the trigger controlling programs: (a) trigger configuration, (b) count rates in the\ntrigger layers and coincidence rate.\n\nmeans of a Wienner4 CC-USB controller. Fig. 5a shows the front panel of the trigger configuration\nprogram. Any counter could be included or excluded from the coincidence. This was helpful if, for instance, any part of a TOF module was not functioning well and had to be repaired: The trigger schematics made the study of a particular part of the module area possible in repeated tests.\nIn case a coincidence signal from the trigger layers was generated, a cosmic particle track was\nlined through two fired STARTs, which allowed measurement of efficiencies of the MRPC cells hit by\nthe track. Due to low intrinsic noise of STARTs, the input of noise events into these estimations was\nnegligible. Inefficient MRPC cells were therefore selected by the decrease of coincidence rate in the\ncorresponding region of module surface. Presented in Fig. 5b is the front panel of the monitoring\ngram showing distributions of count rates in the two triggering layers and the coincidence rate.\n\n5.\n\nChanges of the CRTF characteristics in the process of its\nexploitation\n\nThe coincidence count rates were measured at the beginning of CRTF operation in the absence\nof the TOF modules and in 6 months after its launch with the TOF modules present. The results are\npresented in Fig. 6. A visible distinction of mean values may be explained by rescattering of cosmics\nin the material of the TOF modules (the solid angle for each pair of STARTs is less than 2 degrees),\nfront-end electronic cards and cable lines. Different types of TOF modules varied in length which explains the dependence of the count rate on the strip number (all modules were aligned to the left, i.e. to\nthe channels 71–80). One can also see START pairs with significantly lower count rates which is a\nsign of the loss of efficiency by at least one of the two counters in a pair.\nThe consumption currents of MRS APDs could only be measured during short breaks in the test\nruns, when both trigger planes became accessible. Fig. 7 shows the relation of currents measured in 1\nand 6 months after the launch of CRTF to their initial values for each MRS APD in one trigger layer.\nThe outliers correspond to the STARTs, for which the decrease of efficiency was previously seen (bins\n\n4\n\nWIENER, Plein & Baus GmbH, www.wiener-d.com .\n\n5\n\n\f3000\n\n5\n\nCounts / 10 s\n\n2500\n2000\n1500\n1000\nat the beginning of operation\nafter 6 months of operation\n\n500\n0\n0\n\n8\n\n16\n\n24\n\n32\n\n40\n\n48\n\n56\n\n64\n\n72\n\n80\n\nSTART #\nFig. 6.\n\nComparison of START count rates in one trigger\nplane before the launch of CRTF (squares) and after 6\nmonths of tests (circles).\n\n2.6\nI c – calibration current\n(25-Oct-2005, t = 22.0–22.6 °C)\n\n2.4\n\nRelative current\n\n2.2\n\n6.\n\nStudy\nof\nbroken MRS\nAPDs\n\nAfter malfunctioning counters were disassembled, the broken photodiodes were analyzed.\nFor those MRS APDs with zero\nconsumption currents, a loss of\ncontact between the photodiode\npad and the bonding wire (see\nFig. 8a) was discovered. Although the number of these photodiodes is small, the producer\nhas been informed and is currently working on the improvement\nof the quality of bonding.\n\nI / I c (25-Nov-2005, t = 18.0–18.8 °C)\nI / I c (16-Apr-2006, t = 23.2–23.1 °C)\n\n2.0\n\n20, 57, 126 in Fig. 7 correspond\nto bins 11, 28, 63 in Fig. 6). This\nproves that the loss of efficiency\nis due to the fall of supply voltage on the protection serial resistor of 100 kΩ. After this effect\nwas discovered, the malfunctioning STARTs were replaced during the following test interruptions. Four cases were accompanied with a complete loss of efficiency by corresponding counters; measurement of the consumption current for photodiodes\nin these counters proved them to\nbe zero.\n\n1.8\n1.6\n1.4\n1.2\n1.0\n0.8\n0.6\n\nThere were a total of 27\nMRS\nAPDs that demonstrated an\nDiode #\nincreased consumption current.\nOvertime, their consumption curFig. 7.\nComparison of consumption currents of MRS APDs\nafter 1 (squares) and 6 (circles) months of CRTF oprent continued to grow up to\neration.\n20 μA and even further. The\nnoise spectrum of these photodiodes contained a high-frequency component of more than 20 MHz, with the signal amplitudes 10 times\nless than those produced by single photoelectrons. It is reasonable to assume that this effect is caused\nby an appearance of a conductive channel between the metal and p-type semiconductor layers of the\nphotodiode structure due to the thinning of the SiO2 protective layer in one or several micro-cells (see\nFig. 8b). CPTA is currently analyzing these results to improve the MRS APD production technology.\n0\n\n7.\n\n16\n\n32\n\n48\n\n64\n\n80\n\n96\n\n112 128 144 160\n\nConclusion\n\nFor the first time, a large-scale scintillation trigger system based on MRS APDs has been continuously exploited for a long time period of almost 3 years. As a result of this work, all 87 modules of\n6\n\n\fAl\nSiO 2\np+\nn+\np\n\navalanche\n\n(a)\nFig. 8.\n\n(b)\n\nIllustrations to the explanation of degradation of MRS APD characteristics (see Section 6): (a) location of the bonding wire contact on the sensitive surface of photodiode, (b) cross-section of the MRS\nAPD structure with the possible areas of SiO2 thinning marked with red circles.\n\nthe ALICE TOF system have been successfully tested and calibrated. The calibration results will be\npublished in a separate paper.\nALICE TOF CRTF built of STARTs has proved to be relatively inexpensive and easy-tooperate. The two-layer design of the trigger system makes it possible to control its efficiency based on\nthe count rate from cosmic muons without LED monitoring. Fewer than 10% of photodiodes were\nidentified as malfunctioning during the entire testing period.\nThe trigger system described in this article may be exploited both in experiments on high-energy\nphysics and in various applied sciences. For instance, the sensitivity of the system to multiple rescattering may be useful in detection of foreign objects in a homogeneous medium (customs control)\nor in detection of radioactive sources of low-intensity in wagons and vehicles (security control).\n\nAcknowledgements\nThe authors are grateful to all their collaborators from INFN-Bologna and INFN-Salerno for\nfruitful joint work on the ALICE TOF project. Our special thanks are addressed to Despina Chatzifotiadou who actively participated in the tests at CRTF.\nThis work was partially supported from the RFBR grant 08–02–91011–CERN_a and from the\nfunding program LHC-2 of the Russian Federal Agency of Atomic Energy (Rosatom).\n\nReferences\n[1]\n\nY. Musienko, S. Reucroft and J. Swain, Nucl. Instr. and Meth. A 567 (2006) 57.\n\n[2]\n\nA. Akindinov, G. Bondarenko, V. Golovin, et al., Nucl. Instr. And Meth. A 567 (2006) 74.\n\n[3]\n\nV. Golovin, G. Bondarenko and M. Tarasov, Patent of Russia No 2142175,\nhttp://www.sibpatent.ru/patent.asp?nPubl=2142175&mpkcls=H01L031&ptncls=H01L031/06&s\nort=2 (in Russian).\n\n[4]\n\nA. Akindinov, G. Bondarenko, V. Golovin, et al., Nucl. Instr. And Meth. A 539 (2005) 172.\n\n[5]\n\nA. Akindinov, G. Bondarenko, V. Golovin, et al., Nucl. Instr. And Meth. A 555 (2005) 65-71.\n7\n\n\f[6]\n\nALICE Collaboration, Time-of-flight system, Addendum to ALICE TDR 8, CERN/LHCC\n2002–16.\n\n8\n\n\f"}