{"id": "http://arxiv.org/abs/1108.3411v1", "guidislink": true, "updated": "2011-08-17T07:11:40Z", "updated_parsed": [2011, 8, 17, 7, 11, 40, 2, 229, 0], "published": "2011-08-17T07:11:40Z", "published_parsed": [2011, 8, 17, 7, 11, 40, 2, 229, 0], "title": "Implementation of Two Way Free Space Quantum Key Distribution", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1108.1388%2C1108.5427%2C1108.5345%2C1108.1465%2C1108.0193%2C1108.2659%2C1108.2904%2C1108.2318%2C1108.2867%2C1108.1733%2C1108.5799%2C1108.0897%2C1108.0666%2C1108.0682%2C1108.2883%2C1108.1674%2C1108.0774%2C1108.4146%2C1108.1407%2C1108.1340%2C1108.1476%2C1108.2109%2C1108.1386%2C1108.0158%2C1108.0925%2C1108.5929%2C1108.5870%2C1108.3411%2C1108.3391%2C1108.5135%2C1108.4359%2C1108.2386%2C1108.5220%2C1108.5360%2C1108.4682%2C1108.5703%2C1108.4929%2C1108.3436%2C1108.5219%2C1108.3561%2C1108.4626%2C1108.2798%2C1108.4812%2C1108.3083%2C1108.0033%2C1108.6142%2C1108.1637%2C1108.3549%2C1108.5148%2C1108.4411%2C1108.4925%2C1108.3267%2C1108.1318%2C1108.1040%2C1108.4614%2C1108.2641%2C1108.0828%2C1108.5021%2C1108.3980%2C1108.1337%2C1108.1612%2C1108.2238%2C1108.5275%2C1108.1025%2C1108.0056%2C1108.0885%2C1108.0909%2C1108.5898%2C1108.1811%2C1108.4522%2C1108.2536%2C1108.0454%2C1108.4351%2C1108.5272%2C1108.5676%2C1108.5458%2C1108.4752%2C1108.5932%2C1108.2626%2C1108.5563%2C1108.6300%2C1108.1046%2C1108.2546%2C1108.5837%2C1108.3388%2C1108.3402%2C1108.1425%2C1108.1524%2C1108.1793%2C1108.2994%2C1108.1253%2C1108.2746%2C1108.4362%2C1108.3406%2C1108.3032%2C1108.6117%2C1108.2416%2C1108.3982%2C1108.3706%2C1108.3858%2C1108.4027&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Implementation of Two Way Free Space Quantum Key Distribution"}, "summary": "We report an implementation over free space medium of a two way four states\nquantum key distribution (QKD) protocol namely the LM05. The fully automated\nsetup demonstrated a secure key generation rate of 3.54 kbits per second and\nquantum bit error rate (QBER) of 3.34% at mean photon number ({\\mu}) = 0.15.\nThe maximum tolerable channel loss for secure key generation considering Photon\nNumber Splitting (PNS) attack, was 5.68 [dB]. The result successfully\ndemonstrated the feasibility of a two way QKD protocol implementation over free\nspace medium.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1108.1388%2C1108.5427%2C1108.5345%2C1108.1465%2C1108.0193%2C1108.2659%2C1108.2904%2C1108.2318%2C1108.2867%2C1108.1733%2C1108.5799%2C1108.0897%2C1108.0666%2C1108.0682%2C1108.2883%2C1108.1674%2C1108.0774%2C1108.4146%2C1108.1407%2C1108.1340%2C1108.1476%2C1108.2109%2C1108.1386%2C1108.0158%2C1108.0925%2C1108.5929%2C1108.5870%2C1108.3411%2C1108.3391%2C1108.5135%2C1108.4359%2C1108.2386%2C1108.5220%2C1108.5360%2C1108.4682%2C1108.5703%2C1108.4929%2C1108.3436%2C1108.5219%2C1108.3561%2C1108.4626%2C1108.2798%2C1108.4812%2C1108.3083%2C1108.0033%2C1108.6142%2C1108.1637%2C1108.3549%2C1108.5148%2C1108.4411%2C1108.4925%2C1108.3267%2C1108.1318%2C1108.1040%2C1108.4614%2C1108.2641%2C1108.0828%2C1108.5021%2C1108.3980%2C1108.1337%2C1108.1612%2C1108.2238%2C1108.5275%2C1108.1025%2C1108.0056%2C1108.0885%2C1108.0909%2C1108.5898%2C1108.1811%2C1108.4522%2C1108.2536%2C1108.0454%2C1108.4351%2C1108.5272%2C1108.5676%2C1108.5458%2C1108.4752%2C1108.5932%2C1108.2626%2C1108.5563%2C1108.6300%2C1108.1046%2C1108.2546%2C1108.5837%2C1108.3388%2C1108.3402%2C1108.1425%2C1108.1524%2C1108.1793%2C1108.2994%2C1108.1253%2C1108.2746%2C1108.4362%2C1108.3406%2C1108.3032%2C1108.6117%2C1108.2416%2C1108.3982%2C1108.3706%2C1108.3858%2C1108.4027&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We report an implementation over free space medium of a two way four states\nquantum key distribution (QKD) protocol namely the LM05. The fully automated\nsetup demonstrated a secure key generation rate of 3.54 kbits per second and\nquantum bit error rate (QBER) of 3.34% at mean photon number ({\\mu}) = 0.15.\nThe maximum tolerable channel loss for secure key generation considering Photon\nNumber Splitting (PNS) attack, was 5.68 [dB]. The result successfully\ndemonstrated the feasibility of a two way QKD protocol implementation over free\nspace medium."}, "authors": ["M. F. Abdul Khir", "M. N. Mohd Zain", "Suryadi", "S. Saharudin", "S. Shaari"], "author_detail": {"name": "S. Shaari"}, "author": "S. Shaari", "arxiv_comment": "To appear in the April 2012 issue of Optical Engineering (Vol. 51,\n  No. 04)", "links": [{"href": "http://arxiv.org/abs/1108.3411v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1108.3411v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "quant-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "quant-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1108.3411v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1108.3411v1", "journal_reference": null, "doi": null, "fulltext": "Implementation of Two Way Free Space\nQuantum Key Distribution\nM. F. Abdul Khir1,3, M. N. Mohd Zain3, Suryadi2, S. Saharudin3, S. Shaari1\n1\n\n2\n\nPhotonic Lab, IMEN, Universiti Kebangsaan Malaysia, 43400 UKM Bangi, Malaysia\nFaculty of Science, International Islamic University of Malaysia (IIUM), Jalan Bukit Istana,\n25200 Kuantan, Pahang, Malaysia\n3\nPhotonic Lab, Micro Systems and MEMS, MIMOS Berhad, Technology Park Malaysia,\n57000 Kuala Lumpur, Malaysia\n\nAbstract:\n\nWe report an implementation over free space medium of a two way four states quantum\nkey distribution (QKD) protocol namely the LM05. The fully automated setup demonstrated a\nsecure key generation rate of 3.54 kbits per second and quantum bit error rate (QBER) of 3.34%\nat mean photon number (μ) = 0.15. The maximum tolerable channel loss for secure key\ngeneration considering Photon Number Splitting (PNS) attack, was 5.68 [dB]. The result\nsuccessfully demonstrated the feasibility of a two way QKD protocol implementation over free\nspace medium.\n\nKeywords: Quantum Optics, Secure Communications, Space Optic.\n\nIntroduction\nThe last two decades has seen a remarkable development in the field of Quantum\nCryptography (QC), broadened from quantum physics and information theory to research\n1\n\n\factivities in engineering aspect for practical implementation. The attractions of this technique\nlies in the ability of distributing keys between two parties unconditionally without having to rely\non third parties, which is something not achievable with the classical way. Rather than relying on\nmathematical difficulties as in present conventional asymmetric based cryptography schemes,\nthe security of the shared key in QC relies on the law of physics, suggesting a very reliable\nfoundation. However, as QC only solves the key distribution problem, it can only be used to\ncomplement the standard symmetrical cryptosystems [1]. This led to a more precise name,\nQuantum Key Distribution (QKD).\nSince the introduction of BB84 protocol in 1984 [2], QKD implementations have been\ndemonstrated over optical fiber [3-6] and free space [7-9] medium. Recent experiments\nsurpassing 100 km distant for free space [10] and 200 km for optical fiber [11] had been\ndemonstrated thanks to the decoy state method. Efforts to realize a QKD into current network\ninfrastructure can be seen for example in [12,13].\nIn recent years, several research groups have proposed new QKD protocols of which include\nvariants of the two way protocols [14,15,16]. Although several experiments have been conducted\nto realize the proposed protocols such as in [17-20], as compared to the rest in the group, the\nLM05 protocol has undergone quite a significant development in its realization. Several\nexperimental works on near infrared wavelength were carried out by Lucamarini et al to realize\nthe LM05 protocol [17,18]. In recent experiment, a complete system at telecommunication\nwavelength was successfully realized by Kumar et al [21]. Their system used the plug and play\ntype and had shown an almost equivalent secure key generation rate to the one developed by [22]\nfor BB84 protocol. However, a complete system that runs over a free space medium has yet to be\nrealized.\n\n2\n\n\fIn this work, we demonstrate experimentally an implementation of LM05 protocol over free\nspace medium. To the best of our knowledge this is the first time such fully automated LM05\nprotocol implementation over free space medium is realized. This setup allows to a certain\nextend an experimental investigation of the capability of a practical free space based LM05\nprotocol implementation in producing secure keys. Following [21], we simulate the effects of\ncontrol mode using a beam splitter. As such, this letter is organized as follows. Section two\nintroduces the LM05 protocol. Section three explains the experimental setup, followed by results\nand discussion in section four. Section five conclude and suggest future works.\n\n2. Protocol\nLet us briefly discuss the encoding mode of the LM05 QKD protocol realized with\npolarization states of single photon (refer to Fig. 1). Similar to BB84, two sets of non-orthogonal\nbasis states of single photon are used. However, contrary to BB84, it is Bob who would initiate\nthe quantum key distribution process by preparing random sequence of bit using one of the four\nlinear polarization states and sends them to Alice who would then use the polarized photon to\nencode a bit of information. Alice would choose to either encode a logical 0 by applying identity\noperator (I) or encode a logical 1 by applying unitary transformation iY. Alice then sends the\nqubit back to Bob who will measure the qubit in the same basis he used to prepare it. Bob then\ndecodes the returning qubit into a sequence of bit that forms the raw key. At this point, it is not\nnecessary for Alice and Bob to proceed with basis reconciliation as found in BB84 protocol due\nto the deterministic nature of the protocol. For this reason, ideally the raw key is the sifted key.\nThey then proceed for error correction and privacy amplification which results in a set of\nidentical secure keys at both sides.\n\n3\n\n\fFig. 1. The encoding mode of LM05 protocol. Bob prepares qubit with random bases (Z or X)\nand sends to Alice who would either encodes with identity operator (I) or unitary transformation\n(iY) and returns to Bob. Bob measures the qubit using same basis he used to prepare.\n\n3. Experimental Setup\nThe schematic of our experimental setup is depicted in Fig. 2. A pair of computer programs\nbased on LabVIEW 8.5 was developed at Alice and Bob to control and synchronize the whole\nactive optical components via means of field-programmable gate array (FPGA). The FPGA is a\n40 MHz Reconfigurable I/O module of National Instruments (PXI-7833R) at both Bob and\nAlice). We configured the FPGA pair down to 0.725MHz repetition rate to match the limitation\nof our Pockels cell (~ 1 MHz). All active optical components are connected to the FPGA using\ncoaxial cables.\n\n4\n\n\fATTN3\n\nIF1\n\nQuantum Channel\n(backward)\n\nWOL1\nPC4\nSPCM1\nATTN4\n\nPC3\n\nSPCM2\nSPCM3\n\nFPGA\n\nFPGA\nPC2\n\nIF3\nSF\nQuantum Channel\n(forward)\n\nHWP1 POL1\nPBS1\n\nPC1\n\nBS2\n\nSRC1\n\nBS1\nATTN2\n\nATTN1\n\nHWP2\nPOL2\n\nAlice\n\nTiming/Synchronization\n\nBob\n\nSRC2\n\nInternet (Ethernet)\n\nFig. 2. The LM05 free space QKD experimental setup consists of SRC1, photon source; SRC2,\nphoton source ; PBS1, polarization beam splitter; SF, spatial filter; PC1, first Pockels cell;\nATTN1,ATTN4, variable attenuator; BS1,BS2 50/50 beam splitter; ATTN2, ATTN3 attenuator;\nPC2, second Pockels cell; PC3, third Pockels cell; PC4, Fourth Pockels cell; IF1, IF2,\ninterference filter; WOL1, Wollaston Prism; SPCM1, H & D detector; SPCM2, V & A detector\nThe photon source consists of two pulse lasers (SRC1 and SRC2) from Coherent\nConnection CUBE with wavelength at 785 nm. Either SRC1 or SRC2 is randomly triggered one\nat a time to emit horizontally and vertically polarized pulse respectively. The optical pulse from\nboth photon sources is separately attenuated in order to ensure that they carry same intensity\nbefore being combined into the same optical path at polarization beam splitter (PBS1). To\n\n5\n\n\fimprove the spatial mode quality, the optical pulse is passed through a spatial filter which is a\nfour meters single mode three stage polarization controller from Fiber Control with operating\nwavelength 780~900nm. Optical pulse from either source then proceed through a high speed\nRubidium Titanyle Phosphate, RbTiOPO4 (RTP) non-linear material; Leysop, RTP3-20 (PC1) to\nproduce the four linear polarization states. The PC1 orientation and voltage are set so that the\nhorizontally or vertically polarized pulse from SRC1 or SRC2 is transformed to either Diagonal\nor Anti-diagonal respectively at every triggering event. That is to say, not triggering the PC1\nprepares state of rectilinear basis (|H>, |V>) while triggering the PC1 prepares state of diagonal\nbasis (|A>, |D>). The combination of randomly triggered SRC1, SRC2 and PC1 produces the\nfour linear polarization states. The optical pulse is further attenuated at variable attenuator\n(ATTN1) for intended mean photon number (μ), tracked with a 50/50 beam splitter (BS1) and a\nsingle photon counting module (SPCM3) before being launched to Alice via the quantum\nchannel. The quantum channel is a free space medium of several tens of centimeters length and\nthe public channel is an Ethernet connection for public discussion.\nThe detector part consists of an active basis selector which is a high speed Rubidium\nTitanyle Phosphate, RbTiOPO4 (RTP) non-linear material (PC4; Leysop, RTP3-20), a Wollaston\nprism (WOL1) and a pair of single photon counting modules (SPCM1 and SPCM2). The\nfunction of PC4 is similar to PC1 in terms of switching between the two measurement basis. It is\nonly triggered when PC1 is triggered where it counter rotates the Diagonal and Anti-diagonal\nbasis for measurement by the WOL1 and the single photon counting module pair. That is to say,\nwhen PC4 is not triggered, the whole detector part is set to measure the |H>,|>V basis while if\ntriggered, the whole detector part is set to measure the |D>,|A> basis. As such, the operation of\nactive basis selector (PC4) deterministically sets the measurement basis to the same basis the\n\n6\n\n\fphoton was prepared before launched to Alice. All incoming photons are filtered using an\ninterference filter (IF) to reduce noise before entering WOL1 where they were collected into two\nmultimode fibers and proceed to either SPCM1 or SPCM2 for detection. The single photon\ncounting module pair (SPCM1 and SPCM2) is a Perkin Elmer SPCM-AQR-16-PC with 55%\nefficiency. We set the detection window for 25 ns, the smallest possible with our 40 MHz FPGA\nclock to reduce contribution from background noise.\nAlice optical setup simply consists of an automated polarization flipper and a 50/50 beam\nsplitter (BS2). The function of BS2 is to simulate the effect of control mode which is absent in\nthis setup. Such similar arrangement was the approach adopted by Kumar et al in [21]. The\nflipper is constructed using two serially aligned Pockels cells (PC2 and PC3) which orthogonally\nrotate any four linear input polarization states. Since the polarization state of incoming photon is\nnot priory known to Alice, it is important that Alice must be able to orthogonally rotate any of\nthe four linear polarization states by just triggering the flipper. Its operation was discussed in\n[25]. Based on random bit obtained from pseudo random number generator in FPGA program,\nAlice would either trigger the flipper to encode bit 1 or not trigger to encode bit 0 and returns the\nencoded photon to Bob.\nIt is obvious until now that this experimental setup involves many Pockels cells which results\nin more active polarization transformations than what is found in many QKD implementations\nreported so far and hence deserves a separate section to detail out the explanation. As such, we\nrefer the readers to Appendix A for description on active polarization transformations involved\nin this setup.\n\n4. Results and Discussion\n\n7\n\n\fIt is known to date that the security of two way QKD protocols including LM05 is studied in\nthe context of selected types of attack [27]. Here, we would like to consider the case for Photon\nNumber Splitting (PNS) attack which is very much relevant to a practical QKD implementation.\nThe security of LM05 protocol against PNS attack was analyzed in detail by Lucamarini et al in\n[18] and further in [28]. As such, let us briefly review the model used in this setup following the\none in [18].\n\nA. Model\nWe assume photon source is a laser source emitting weak coherent state where the\nnumber of photon in each pulse follows Poisson distribution with mean photon number (μ). The\nprobability of finding i photons in a pulse \u0001\u0002\u0003, \u0005\u0006 is given by :\n\u0001\u0002\u0003, \u0005\u0006 \u0007\n\n\u0005\u0003\n\u0003!\n\n(1)\n\n\u0005\n\nAssuming the intrinsic loss of the system consist of loss in Bob (\n\n) and loss in Alice ( )\n\u0015\u0016\n\u0017\u0018\n\n\u0013\u0014 \u0019\n\n(measured in dB), the transmission in Bob \u000e\u000f and Alice \u000e\u0010 is given by \u000e\u000f \u0007 10\n\u000e\u0010 \u0007 10\n\n\u0015\u001a\n\u0017\u0018\n\n\u0013\u0014 \u0019\n\nand\n\nrespectively. The internal transmission of the system including the detection\n\nprobability is given by\n\u001b\n\nwhere \u001b\u001f\n\n!\n\n\u001c\u001d\n\n\u0007 \u000e \u000e \u001b\u001e\n\n\u000e\n\n(2)\n\nis quantum efficiency of Bob's detector.\n\nThe channel transmission \u000e\" is given by\n\u000e\" \u0007 10\n\n\u0013\u0014\n\n#$\"\n\u0019\n%&\n\n8\n\n(3)\n\n\fWhere ' is one way loss of the quantum channel between Bob and Alice. The factor of two is\n\nfor two way channel loss in this protocol (we assume same loss for forward and backward\nchannel).\n\nThe overall transmission (\u001b) is then given as\n\u001b \u0007 \u000e\" \u001b\u000f()\n\n(4)\n\nFrom here signal detection probability (\u0001*+,-.$ ) is given by\n\u0013/0\n\n\u0001*+,-.$ \u0007 1\n\n(5)\n\nThe overall dark count probability (\u0001\u001f.12 ) is given by\n\u0001\u001f.12 \u0007 24\u001d\n\n(6)\n\nwhere 4\u001d is the dark count per detection window. The factor of two is due to the two detectors\nin Bob which are the sources of dark count in our setup.\nThe overall detection probability which includes signal and dark counts is given as.:\n\u0001\u0010$$5 \u0001*+,-.$ 6 \u0001\u001f.12\n\n\u0001*+,-.$ \u0001\u001f.12 7 \u0001*+,-.$ 6 \u0001\u001f.12\n\n(7)\n\nwhere \u0001*+,-.$ \u0001\u001f.12 represent coincidence of detection between signal and dark count and can be\nneglected in experiment.\n\nThe overall Quantum Bit Error Rate (QBER) denoted as 8\u0010$$ is adopted from [23] and is given\nby\n8\u0010$$ \u0007\n\n& \u0001\u001f.12\n\n6\n\n9 ! :!(1 \u0001*+,-.$\n\n\u0001\u0010$$\n\n9\n\n(8)\n\n\fwhere\n\n&\n\nis erroneous detection due to background noise equal to\n\n%\n#\n\nand\n\n9 ! :!(1\n\nis probability\n\nof erroneous detection from signals.\nThe secure key generation rate against PNS attack is given by [18] as :\n;<=* \u0007 \u0001\u0010$$ >? \u00021\n\n@A\u0006\n\nB:.C: D \u0002 \u0006\n\n@ A \u0007 @\u0002 /?\u0006\n\n(9)\n\nwhere\n?\n\n: Security parameter defined as ? \u0007 <\u001a\u0015\u0015\u0013<G\n\n(10)\n\n<\u001a\u0015\u0015\n\nwhere\n\u0001A \u0007 1\nB:.C:\n@\n\n\u00021 6 \u0005 6\n\n0H\n#\n\n6\n\n% 0I\n# J\n\n\u0006\n\n\u00130\n\n.\n\n: Error correction efficiency based on cascade protocol\n: Fraction of the key to be discarded during privacy amplification.\n@\u0002 \u0006 \u0007 log # \u00021 6 4\nwhere\n\n4\n\n#\n\n\u0006 if\n\n%\n\nO and @\u0002 \u0006 \u0007 1 if\n#\n\nP\n\n%\n#\n\nis the QBER.\n\nD\u0002 \u0006 : Binary Shannon entropy.\nD\u0002 \u0006 \u0007\n\n\u001cQ#\n\n\u00021\n\n\u0006 \u001cQ# \u00021\n\n\u0006\n\nFrom here, we first obtained intrinsic parameters from our experimental setup and\nnumerically simulate the optimal mu for every distance and find the maximum secure distance\nrepresented in channel loss ( '). The intrinsic loss was measured to be 6.426 [dB] in Alice and\n3.781 [dB] in Bob. The high loss in Alice was mainly coming from the 50/50 beam splitter\n(3.378 [dB]) for simulating the effects of control mode and from the two Pockels cells (PC2 and\nPC3) that forms the flipper (1.524 [dB]). The loss in Bob came from the Pockels cell (PC4) and\n\n10\n\n\fimperfect fiber coupling which are recorded as 1.06 [dB] and 3.219 [dB] respectively. As such,\ntotal intrinsic loss of our setup is 10.705 dB.\n\nWe further obtained\n\n9 ! :!(1\n\n\u0007 0.033 and \u0001\u001f.12 \u0007 4.276 V 10\u0013J . The\n\n9 ! :!(1\n\nis the\n\nnoise related to the setup that is the optical alignment and the electronic components and is\nactually the QBER value when dark count is negligible. It is obtained by sending pulses with\nhigh mean photon number \u0002\u0005\u0006 and is almost consistent if the channel loss is not too high. \u0001\u001f.12\nis dark count probability in within the 25 ns detection window used in this setup when no pulse is\nsent. The double count was found to be very small and is neglected this experiment. We then\nconduct the experiment starting with characterization of mean photon number (μ) and followed\nby determination of maximum secure distance.\n\nB. Mean photon number (μ).\nAn optimal mean photon number (μ) is given by the ratio of counts over triggers in a\nframe [19]. It is usually measured before launching into quantum channel. A same result could\nalso be obtained if one use back end detectors (denoted as SPCM1and SPCM2 in Fig 2) by\nconsidering intrinsic loss and channel loss in between such as shown in [19]. In this setup, after a\nsimple calibration to ensure same results within experimental tolerance, each μ is measured using\nthe μ tracker (SPCM3 in Fig 2) such as found in [10,21].\nIn order to study the effects of μ over QBER, we fixed the attenuation at both forward\nand backward channel using ND filter (ATTN2 and ATTN3 in Fig. 2) and variable attenuator\n(ATTN4 in Fig 2.) which correspond to 1.14[dB] of one way channel loss and perform the\nexperiment over several different values of μ < 1.7 .\n\n11\n\n\fFor each experimental runs, we recorded the resulted QBER, obtained by evaluating the\nratio of wrong bits over total detected bits. The results are depicted in Fig 3 which shows the\nQBER for a given μ . It is obvious that at the region outside μ O 0.1, QBER remains stable\nbelow 4%. At this region, the sources of QBER are mainly from the imperfect setting of the\nsetup with dark count almost negligible. This value amounts close to the value of previously\nmentioned\n\n9 ! :!(1\n\nat 0.033 and is mainly contributed by the three Pockels cells (two in Alice\n\nand one in Bob) where each polarization encoded photon has to travel through in its way to the\ndetector. Imperfect polarization transformation had reduced the polarization contrast which as a\nresult increased the probability of reaching wrong detector. When μ decreases surpassing 0.1, we\ncan see that the QBER started to fluctuate. This is due to less photon flux reaching the detectors\nwhile dark count remains constant. We noted that it is important to keep the stable QBER value\nas low as possible since the controlling of Eves relies on this value while there is no means of\ndifferentiating the contribution of eavesdropper or imperfections of the setup. In the next subsection, we study the effects of varying channel loss and further determine the maximum secure\ndistance against PNS attack of this setup.\n\n12\n\n\fFig. 3. QBER value with varying mean photon number \u0002\u0005\u0006 corresponding to channel loss =\n1.14[dB]. The theoretical line is plotted according to Eq [8] with\n\n9 ! :!(1\n\n\u0007 0.033 , \u0001\u001f.12 \u0007\n\n8.552 V 10\u0013J .\n\nC. Secure distance.\nIt is known that apart from system intrinsic loss, the real implementation of a free space\nQKD system suffers from environmental effects such as bad weather condition or even pollution.\nThis is evident from recent field trials such as in [7~10]. All these effects eventually sum up to\ntotal channel loss. As such, in this experiment, we simulate the channel loss by varying\nattenuation level of the quantum channel as reported in several previous experiments [21,\n24][26]. We fixed the value of μ to 0.15 which is not far from optimal as suggested by numerical\nsimulation and slowly vary the quantum channel loss (denoted as ' in section A) to investigate\n13\n\n\fthe maximum secure distance of our setup. Several low ND filters were inserted at the forward\nchannel and backward channel denoted as ATTN2 and ATTN3 combined with ATTN4\nrespectively in Fig. 2. It is difficult to precisely equalize the attenuation value of ATTN3 and\nATTN4 to ATTN2 and hence the one way channel loss reported here is actually the average of\nthe two attenuation values. For each experimental run, we record the raw key and the\ncorresponding QBER. Interestingly, it is found that the QBER value has not been affected much\nby the increase in the channel loss\nWe then calculate the corresponding secure key generation rate (;<=* \u0006 for each varying\ndistance using Eq 9 with error correction efficiency B:.C: \u0007 1.22. The result is depicted in Fig. 4\nwhere we can easily spot that the maximum secure distance against PNS attack of this system is\nless than 6 [dB]. The maximum secure distance is obtained by observing the channel loss at the\nlast point before secure key generation rate hits zero. In our case, with mean photon number\n(\u0005) 7 0.15, as shown in Fig 4, the maximum secure distance is 5.68 [dB] producing 11.40 bit/sec\nsecure key at pulse repetition rate of 0.725 MHz of this system. We verified that at 5.99 [dB] the\nsecurity parameter is already negative which means that the system is not any more secure\nagainst PNS attack. The system was stable even for more than an hour of continuous operation.\n\n14\n\n\fFig. 4. Raw key rate (;1.Z \u0006 and secure key generation rate (;<=* \u0006 against channel loss [dB].\nThe secure key is calculated according to Eq (9).\n\nB. Conclusion and Future Works\nWe have successfully implemented the first fully automated QKD system based on a four\nstates two way quantum key distribution protocol namely the LM05 over free space medium.\nDespite uses of many active components for polarization encoding, the system recorded a stable\nQBER as low as 3.44% with maximum tolerable channel loss for secure key generation at 5.68\n[dB]. This strongly indicates the feasibility of two way QKD protocol over free space medium.\n\nIt is known that the secure key generation rate against PNS attack and the maximum secure\ndistance can be improved by almost double if one employs decoy state method such as reported\n15\n\n\ffor LM05 protocol in [27, 29] . It is then interesting to experimentally realize the proposed\nscheme. In our setup, it would require at least a set of identical laser sources to produce the\nminimum additional four states for the decoy scheme. This highlights possible immediate\nextension of this setup.\n\nACKNOWLEDGEMENTS\n\nThe authors would like to thank Youn-Chang Jeong and Yong-Su Kim for their assistance and\nadvice with the experimental set-up. The authors would also like to thank Iskandar Bahari,\nRupesh Kumar and Marco Lucamarini for fruitful discussion on the LM05 protocol and the\nexperiments.\n\nReferences\n[1]\n\nN. Gisin, G. Ribordy, W. Tittel, and H. Zbinden, \"Quantum Cryptography,\" Rev. Mod.\nPhys. 74, 145 (2002).\n\n[2]\n\nC. H. Bennett and G. Brassard, \"Quantum Cryptography: Public Key Distribution and\nCoin\n\nTossing,\"\n\nin\n\nProceedings\n\nof\n\nthe\n\nIEEE\n\nInternational\n\nConference\n\non\n\nComputers,Systems and Signal Processing (IEEE, New York, 1984), pp. 175–179.\n[3]\n\nC. Marand and P. D. Townsend, \"Quantum Key Distribution over Distances as Long as\n30 km,\" Opt. Lett. 20, 1695 (1995).\n\n[4]\n\nA. Muller, H. Zbinden, and N. Gisin, \"Quantum Cryptography over 23 km in Installed\nUnder-Lake Telecom Fibre,\" Europhys. Lett. 33, 335 (1996).\n\n16\n\n\f[5]\n\nD. Stucki, N. Gisin, O. Guinnard, G. Ribordy, H. Zbinden, \"Quantum Key Distribution\nover 67 km with a Plug&Play System,\" New J. Phys. 4, 41 (2002).\n\n[6]\n\nC. Gobby, Z. L. Yuan, and A.J. Shields, \"Quantum Key Distribution over 122 km of\nStandard Telecom Fiber,\" Appl. Phys. Lett. 84, 3762 (2004).\n\n[7]\n\nR. Hughes, J. E. Nordholt, D. Derkacs, C. G. Peterson, \"Practical Free-Space Quantum\nKey Distribution over 10 km in Daylight and at Night,\" New J. Phys. 4, 43 (2002).\n\n[8]\n\nM. Fürst, H. Weier, T. Schmitt-Manderbach, R. Ursin, F. Tiefenbacher, T. Scheidl, M.\nLindenthal, B. Blauensteiner, and T. Jennewein, P. Trojek, J. M. Perdigues and Z.\nSodnik,\n\nC.\n\nBarbieri,\n\nJ.\n\nG.\n\nRarity,\n\nA.\n\nZeilinger,\n\nH.\n\nWeinfurter\n\n\"Free-space quantum key distribution over 144 km, Proceedings of SPIE, Volume\n63990G (2006)\n\n[9]\n\nC. Kurtsiefer, P. Zarda, M. Halder, Ph. M. Gorman, P. R. Tapster, J. G. Rarity, H.\nWeinfurter, \"Long-Distance Free-Space Quantum Cryptography,\" Proc. SPIE 4917, 25\n(2002).\n\n[10]\n\nT. Schmitt-Manderbach, H. Weier, M. Fürst, R. Ursin, F. Tiefenbacher, T. Scheidl, J.\nPerdigues,\n\nZ. Sodnik, C.\n\nKurtsiefer, J. G. Rarity, A. Zeilinger, H. Weinfurter,\n\n\"Experimental Demonstration of Free-Space Decoy state Quantum Key Distribution over\n144 km,\" Phys. Rev.Lett. 98, 010504 (2007).\n[11]\n\nY Liu, T.Y. Chen, J. Wang, W. Q. Cai, X. Wan, L. K. Chen, J. H. Wang, S. B. Liu, H.\nLiang, L. Yang, C. Z. Peng, K. Chen, Z. B. Chen, and J. W. Pan, \"Decoy-state quantum\nkey distribution with polarized photons over 200 km\", Optics Express, Vol. 18, Issue 8,\npp. 8587-8594 (2010)\n\n17\n\n\f[12]\n\nNnake Nweke, Robert J. Runser, Scott R. McNown, Jaco B. Khurgin, \"Experimental\nInvestigation of Gain Transients in Praseodymium Doped Fluoride Fiber Amplifiers\n(PDFFA),\"Journal of Optical Engineering, 44, 095004 (2005).\n\n[13]\n\nThomas E. Chapuran, Robert J. Runser, Paul Toliver, Nicholas A. Peters, Matthew S.\nGoodman, Scott R. McNown, Jon T. Kosloski, Richard J. Hughes, Charles G. Peterson,\nKevin P. McCabe, Jane E. Nordholt, Kush T. Tyagi, Phillip A. Hiskett, Nicholas\nDallmann, Linden Mercer and Henry Dardy, \"Quantum communications over optical\nfiber networks\", Proc. SPIE 6710, 67100R (2007)\n\n[14]\n\nK Bolstrom, T Felbinger, \"Deterministic Secure Direct Communication Using\nEntanglement\", Phys. Rev Lett. (2002)\n\n[15]\n\nM Lucamarini, S Mancini,\"Secure Deterministic Communication without Entanglement\",\nPhys. Rev. Lett. 94, 140501 (2005)\n\n[16]\n\nJ.S. Shaari, M. Lucamarini, M.R.B. Wahiddin, \"Deterministic six states protocol for\nquantum communication\", Physics Letters A, Volume 358, Issue 2, 9 October\n2006, Pages 85-90\n\n[17]\n\nA. Cere, M. Lucamarini, G. Di Giuseppe, P. Tombesi, \"Experimental Test of Two-way\nQuantum Key Distribution in Presence of Controlled Noise\", Phys Rev Lett, 96, 200501\n(2006)\n\n[18]\n\nM. Lucamarini, A. Cere, G. Giuseppe, S. Mancini, D Vitali, P. Tombesi, \"Two-way\nProtocol with Imperfect Devices\", Open Systems & Information Dynamics, Vol. 14, No.\n2. (18 June 2007), pp. 169-178\n\n18\n\n\f[19]\n\nM Ostermeyer, N Walenta, \"On the Implementation of a Deterministic Secure Coding\nProtocol using Polarization Entangled Photons\", Optics Communications Volume 281,\nIssue 17, 1 September 2008, Pages 4540-4544\n\n[20]\n\nA. P. Shurupov, S.S. Straupe, S.P. Kulik, M Gharib, M.R.B. Wahiddin, \"Quantum state\nengineering with ququarts: Application for deterministic QKD protocol\",Volume 87,\nNumber 1, 2009\n\n[21]\n\nR. Kumar, M. Lucamarini, G. Di Giuseppe, R. Natali, G. Mancini, P. Tombesi, \"Twoway quantum key distribution at telecommunication wavelength\", Phys. Rev. A 77\n022304 (2008)\n\n[22]\n\nD. Bethune, M. Navarro, and W. Risk, Appl. Opt. 41, 1640 (2002)\n\n[23]\n\nX. Ma, B Qi, Y Zhao, H K Lo,\"Practical Decoy State for Quantum Key Distribution\",\nPhys Rev A 72 012326 (2005)\n\n[24]\n\nY.-S. Kim, Y.-C. Jeong, and Y.-H. Kim, \"Implementation of polarization-coded freespace BB84 quantum key distribution\", Laser Physics 18, 810 (2008)\n\n[25]\n\nAbdul Khir M F, Mohd Zain M N, Suryadi, Saharudin S, Shaari S, \"Characterization of\nFour States Polarization Flipper for Single Photon Application\", In Proceeding of the\nIEEE International Conference on Photonic (ICP2010), 5-7 July 2010, Langkawi.\n\n[26]\n\nIn fact, in this way, it forms sort of \"universal plot\" of key rate against channel loss\nwhich is independent from actual realization. We thank Andreas Poppe for pointing this\nout and for fruitful discussion on the real free space QKD implementation.\n\n[27]\n\nJ.S. Shaari, Iskandar Bahari, Sellami Ali,\" Decoy states and two way quantum key\ndistribution schemes\",Optic Communications, 284 (2011) 697–702\n\n19\n\n\f[28]\n\nM. Lucamarini, S. Mancini,\"Quantum Key Distribution and Communication using a\nTwo-way Quantum Channel \", arXiv:1004.0157.\n\n[29]\n\nM.F. Abdul Khir, Iskandar Bahari, A Annuar Ehsan, \"Two Way Quantum Key\nDistribution Protocol with Weak+Vacuum Decoy State\", accepted for 2nd IEEE\nInternational Conference on Photonic (ICP2011), 17~19 October 2011, Kota Kinabalu.\n\n20\n\n\fAppendix A\n\nIt is known that for fully polarized light, one may conveniently uses Jones calculus to represent\npolarization transformations. In this appendix, we use Jones calculus to describe polarization\ntransformations related to active components mainly Pockels cells used as polarization\nmodulators in the experimental setup starting with source and detector in Bob, followed by the\nflipper in Alice and finally summarize them in Table 1.\n\nLet us first denote Jones vector for all four linear polarization states from the two basis used in\n0\n0\n1\nthis setup as Vertical, |\\] \u0007 ^ _; Horizontal, |D] \u0007 ^ _; Diagonal, |\u001e] \u0007 ^ _ and Anti-diagonal,\n1\n1\n1\n| ]\u0007^\n\n1\n_. Jones matrix for rotatable half wave plate is given by ^cos 2b\nsin 2b\n1\n\nPockels\ne\u0007^\n\ncell\n\nnot\n\nin\n\ntriggered\n\nstate\n\nis\n\nequivalent\n\nto\n\nsin 2b\n_. While\ncos 2b\n\nidentity\n\nmatrix\n\n1 0\n_, Pockels cell at orientation b to optical axis, triggered with half wave voltage is\n0 1\ncos 2b\nsin 2b\n\nrepresented as half wave plate with the following Jones matrix f1 \u0007 ^\nReplacing b \u0007\nf1 \u0007 ^\n\n1\n1\n\n\u0013g\n,\nh\n\nsin 2b\n_ .\ncos 2b\n\nin M1 (representing matrix operation of PC1 in Fig 2) becomes\n\n1\n_ . Now, polarization state of photons coming out of the two lasers SRC1 and\n1\n\n1\n0\nSRC2 are each represented as |D] \u0007 ^ _ and |\\] \u0007 ^ _. Solving matrix multiplication against\n0\n1\nidentity matrix I for the case of PC1 not triggered and M1 for the case of triggered will result in\nall the four linear polarization states as shown in the following equation Eq 11**.\n\ne V |D ] \u0007 |D] ; f1 V |D ] \u0007 |\u001e] ; e V |\\ ] \u0007 |\\ ] ; f1 V |\\] \u0007\n21\n\n(11)\n\n\fThe treatment of Jones matrix for the case of the second Pockels cell in Bob (denoted as PC4 in\nFig 2) is almost similar to the case of the source except that they are the reverse operation since\nthe function of PC4 is to prepare the same measurement basis as it was prepared at the source.\ng\n\nAs such, treating M4 (denoted as PC4 in Fig 2) as half wave plate with orientation b \u0007 h as it\ng\n\nwas used in this setup (alternatively one can also use b \u0007 h ), results in the following equation Eq\n12.\n\ne V |D ] \u0007 |D] ; f4 V |\u001e] \u0007 |D] ; e V |\\ ] \u0007 |\\ ] ; f4 V | ] \u0007 |\\ ]\n\n(12)\n\nAs previously explained, Alice encodes logical bit to Bob using the flipper denoted as PC2 and\nPC3 in Fig 2. Note that Alice need to be able to orthogonally rotate any four states from the two\nbasis without priory knowing what the incoming state is and hence the use of two Pockels cells.\nFor this, the first Pockels cell (PC2) is used to orthogonally rotate the rectilinear basis (horizontal\nand vertical state of polarization) while the second Pockels cell (PC3) is used to orthogonally\nrotate the diagonal basis. While they are both triggered simultaneously, each operation does not\naffect the other basis and thus allow a sort of \"universal equatorial gate\" mentioned in [18]. By\ng\n\nsetting the orientation of PC2 and PC3 to b \u0007 i and b \u0007 0 respectively, the Jones matrix for PC2\nand PC3 in their triggered state are each given by f2 \u0007 ^\n\n0\n1\n\n1\n1\n_ and f3 \u0007 ^\n0\n0\n\n0\n_. We can\n1\n\nfurther combine the two operations by conducting matrix multiplication for M1 andM2 and\nobtain f23 \u0007 ^\n\n0\n1\n\n1\n_. Now, solving matrix multiplication against all four linear polarization\n0\n\n22\n\n\fstates result in the following Eq 13 for flipper not in triggered state (Alice encode bit 0)and Eq\n14 for flipper in triggered state (Alice encode bit 1), we obtain the following.\ne V |D ] \u0007 |D] ; e V | ] \u0007 | ] ; e V |\\] \u0007 |\\ ] ; e V |\u001e ] \u0007 |\u001e];\n\n(13)\n\nf23 V |D] \u0007 |\\] ; f23 V | ] \u0007 |\u001e] ; f23 V |\\ ] \u0007 |D] ; f23 V |\u001e] \u0007 | ];\n\n(14)\n\nNote that same result can also be obtained if one exchanges the position of PC2 and PC3 as each\nmatrix operation does not interfere polarization state of the other basis. The results of all matrix\noperations involving all Pockels cells used throughout this experimental setup (PC1, PC2, PC3\nand PC4) as described in this section are summarized in table 1. Based on this, the coding of\nLM05 protocol is embedded in our LabVIEW program running at Bob and Alice. Note that one\ncan also achieve the same objective using different configuration of M1 and M2 in Table 1\ncombined with the program used to realize the LM05 protocol. To aid in setting up the Pockels\ncells to achieve the intended polarization transformations, we have extensively made use of our\npolarimeter from Thorlab.\n\n23\n\n\fTable 1 Transformation of polarization states involving Pockels cells used throughout the setup\nrepresented using Jones calculus.\nBob\nQuantum\nstates\n\nLaser\nsource\n\nPolarization modulator\n\nOFF\n\n1 0\n^\n_\n0 1\nVertical,\n0\n^ _\n1\n\nSRC2\n\nDiagonal,\n1\n^ _\n1\n\nSRC2\n\nHorizontal,\n1\n^ _\n0\n\nSRC1\n\nAntidiagonal,\n1\n^\n_\n1\n\nSRC1\n\nAlice\n\nPC1\nON\n\n^\n\nFlipper\n\nOFF\n\n1\n1\n\n1\n\n1\n\n0\n^ _\n1\n\n_\n\n^\n\n1\n^ _\n0\n\n1 0\n_\n0 1\n\n1\n^ _\n1\n1\n^ _\n0\n\n^\n\n1\n_\n1\n\n^\n\nPolarization\nmodulator\n\nPC2 & PC3\nON\n\n0\n^ _\n1\n1\n^ _\n1\n\nBob\n\n1\n_\n1\n\n^\n\n0\n1\n^\n^\n^\n^\n\nOFF\n1\n\n0\n\n_ ^\n\n1\n_\n0\n1\n_\n1\n0\n_\n1\n1\n_\n1\n\nPC4\nON\n\n1 0 1\n_ ^\n0 1 1\n0\n^ _\n1\n1\n^ _\n0\n\n1\n^ _\n0\n0\n^ _\n1\n\n1\n_\n1\nSPCM2\nSPCM1\n\n1\n_\n0\n0\n^ _\n1\n^\n\nSPCM1\nSPCM2\nSPCM1\nSPCM2\n\n0\n_\n1\n1\n^ _\n0\n^\n\n*SRC1, SRC2, PC1, PC2,PC3, PC4, SPCM1, SPCM2 is from Fig 2.\n** Global phase has no influence to polarization state and hence is ignored here.\n\n24\n\nSingle\nphoton\ndetector\n\nSPCM2\nSPCM1\n\n\f"}