{"id": "http://arxiv.org/abs/0806.0795v3", "guidislink": true, "updated": "2008-06-06T18:48:53Z", "updated_parsed": [2008, 6, 6, 18, 48, 53, 4, 158, 0], "published": "2008-06-04T14:46:53Z", "published_parsed": [2008, 6, 4, 14, 46, 53, 2, 156, 0], "title": "Intermediate Phase in Germanium-Selenide glasses: A Theoretical and\n  Experimental Study", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0806.1496%2C0806.3638%2C0806.2562%2C0806.1478%2C0806.0926%2C0806.0061%2C0806.4458%2C0806.0800%2C0806.3690%2C0806.0732%2C0806.0723%2C0806.4582%2C0806.3924%2C0806.4408%2C0806.0236%2C0806.0295%2C0806.2889%2C0806.2144%2C0806.0898%2C0806.4299%2C0806.2742%2C0806.4144%2C0806.4148%2C0806.0348%2C0806.0884%2C0806.2905%2C0806.1026%2C0806.0678%2C0806.4394%2C0806.2678%2C0806.3554%2C0806.3014%2C0806.2193%2C0806.3347%2C0806.3893%2C0806.2490%2C0806.3549%2C0806.3813%2C0806.2751%2C0806.1804%2C0806.3934%2C0806.2411%2C0806.4715%2C0806.1995%2C0806.4454%2C0806.2539%2C0806.0823%2C0806.0032%2C0806.0795%2C0806.3199%2C0806.3865%2C0806.4465%2C0806.0138%2C0806.4347%2C0806.0636%2C0806.0637%2C0806.2867%2C0806.1957%2C0806.4788%2C0806.4561%2C0806.4116%2C0806.1083%2C0806.0850%2C0806.0224%2C0806.4185%2C0806.3247%2C0806.0115%2C0806.2291%2C0806.2783%2C0806.0015%2C0806.0558%2C0806.0613%2C0806.2436%2C0806.2547%2C0806.3280%2C0806.2690%2C0806.3164%2C0806.3518%2C0806.0815%2C0806.3032%2C0806.2381%2C0806.3929%2C0806.3603%2C0806.3700%2C0806.0128%2C0806.2766%2C0806.2096%2C0806.4226%2C0806.2017%2C0806.2527%2C0806.1978%2C0806.0919%2C0806.1518%2C0806.0488%2C0806.3538%2C0806.3124%2C0806.4784%2C0806.4678%2C0806.1315%2C0806.2401%2C0806.1933&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Intermediate Phase in Germanium-Selenide glasses: A Theoretical and\n  Experimental Study"}, "summary": "A theoretical and experimental study of the Intermediate Phase (IP) in\nGexSe1-x is presented. Based on ab initio molecular dynamics (MD) models of\nthese glasses, a generic atomic picture of the IP is discussed thoroughly.\nX-Ray Absorption Near Edge Structure (XANES) measurements on Ge-Se glasses over\na wide range including the IP window are presented to show the electronic\nsignature of the IP in the form of the shift in the absorption edge with the Ge\ncontent. It is shown that MD based models clearly reproduce that shift.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0806.1496%2C0806.3638%2C0806.2562%2C0806.1478%2C0806.0926%2C0806.0061%2C0806.4458%2C0806.0800%2C0806.3690%2C0806.0732%2C0806.0723%2C0806.4582%2C0806.3924%2C0806.4408%2C0806.0236%2C0806.0295%2C0806.2889%2C0806.2144%2C0806.0898%2C0806.4299%2C0806.2742%2C0806.4144%2C0806.4148%2C0806.0348%2C0806.0884%2C0806.2905%2C0806.1026%2C0806.0678%2C0806.4394%2C0806.2678%2C0806.3554%2C0806.3014%2C0806.2193%2C0806.3347%2C0806.3893%2C0806.2490%2C0806.3549%2C0806.3813%2C0806.2751%2C0806.1804%2C0806.3934%2C0806.2411%2C0806.4715%2C0806.1995%2C0806.4454%2C0806.2539%2C0806.0823%2C0806.0032%2C0806.0795%2C0806.3199%2C0806.3865%2C0806.4465%2C0806.0138%2C0806.4347%2C0806.0636%2C0806.0637%2C0806.2867%2C0806.1957%2C0806.4788%2C0806.4561%2C0806.4116%2C0806.1083%2C0806.0850%2C0806.0224%2C0806.4185%2C0806.3247%2C0806.0115%2C0806.2291%2C0806.2783%2C0806.0015%2C0806.0558%2C0806.0613%2C0806.2436%2C0806.2547%2C0806.3280%2C0806.2690%2C0806.3164%2C0806.3518%2C0806.0815%2C0806.3032%2C0806.2381%2C0806.3929%2C0806.3603%2C0806.3700%2C0806.0128%2C0806.2766%2C0806.2096%2C0806.4226%2C0806.2017%2C0806.2527%2C0806.1978%2C0806.0919%2C0806.1518%2C0806.0488%2C0806.3538%2C0806.3124%2C0806.4784%2C0806.4678%2C0806.1315%2C0806.2401%2C0806.1933&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "A theoretical and experimental study of the Intermediate Phase (IP) in\nGexSe1-x is presented. Based on ab initio molecular dynamics (MD) models of\nthese glasses, a generic atomic picture of the IP is discussed thoroughly.\nX-Ray Absorption Near Edge Structure (XANES) measurements on Ge-Se glasses over\na wide range including the IP window are presented to show the electronic\nsignature of the IP in the form of the shift in the absorption edge with the Ge\ncontent. It is shown that MD based models clearly reproduce that shift."}, "authors": ["F. Inam", "G. Chen", "D. N. Tafen", "D. A. Drabold"], "author_detail": {"name": "D. A. Drabold"}, "author": "D. A. Drabold", "links": [{"href": "http://arxiv.org/abs/0806.0795v3", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0806.0795v3", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "cond-mat.dis-nn", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.dis-nn", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0806.0795v3", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0806.0795v3", "arxiv_comment": null, "journal_reference": null, "doi": null, "fulltext": "Intermediate Phase in Germanium-Selenide glasses:\nA Theoretical and Experimental Study.\nF.Inam1, G. Chen1, D. N. Tafen2, and D. A. Drabold1\n1\n\n2\n\nDept. of Physics and Astronomy, Ohio University, Athens, OH 45701 USA\nPhysics Department, West Virginia University, Morgantown, WV 26506, USA\n\nIntroduction\nGexSe1-x glassy alloys have been a focus of extensive research since the\nmid 80's because of fascinating and often complex behavior as a function of Ge\ncontent 'x'. Much of the research on these glasses is focused on understanding the\nnetwork properties like intermediate range order (IRO) and rigidity transition. The\ntopology of the Ge-Se network, in general, is best described as the linking between\n4-fold Ge(Se1/2)4 tetrahedra and polymeric chains of 2-fold Se forming a\nchemically ordered continuous random network (CRN). IRO (which is often\nconnected to the first sharp diffraction peak (FSDP) in the static structure factor) in\nthese alloys, is reported to increase over a wide composition range [1][2][3].\nThough the atomistic origin of FSDP is still a debatable subject, there are clear\nindications that it originates from the Ge-Ge correlations [4]. In the early 1980s,\nPhillips [5][6] and Thorpe [7] introduced the idea of rigidity percolation based\nupon constraint theory, which describes the floppy to rigid transition in covalent\nnetworks. The transition occurs when the number of constraints per atom equals\nthe number of degrees of freedom of the system. Considering the constraints due to\nbond-stretching and bond-bending forces, the rigidity percolation threshold is\nfound to exist at <r> = 2.4 [7], where <r> is the mean coordination of the network.\nIn the case of GexSe1-x, the rigidity threshold corresponds to the composition x =\n0.20. From Raman spectroscopy and novel calorimetry studies, Boolchand and his\ngroup [8] showed that a 'double' rigidity transition occurs in GexSe1-x. A finite\ncomposition window (0.20 ≤ x ≤ 0.25) between two transitions is referred to as an\nintermediate phase (IP). IP is also observed in a wide range of glassy alloys\nincluding SixSe1-x and AsxSe1-x among others[9]. The atomistic nature of the IP is\nstill elusive.\nRaman mode frequency variation of the corner-sharing (CS) and the edgesharing (ES) tetrahedra provides structural evidence of the IP [9]. The Raman\n25\n© INOE Publishing House\nSeries: Optoelectronic Materials and Devices, ISSN xxx-xxx\nVolume 5, 2008, Rigidity and Boolchand intermediate phases in nanomaterials, ISBN xxx-xxx-xxxxx\n\n\ffrequency of CS tetrahedra increases linearly below the IP window and shows a\npower law behavior above IP, while it saturates within the IP range [9]. Raman\nmeasurements under pressure by Wang et. al.[10] provide further insight into the\nnature of IP. Above and below the IP range, the CS Raman mode shows a\nthreshold Pc, below which the variation in the mode frequency with composition is\nnegligible. In the IP window, the mode frequency increases monotonically with the\napplied pressure suppressing a threshold. The absence of a pressure threshold\nsuggests the stress-free nature of the IP. The evolution of the topology of the\nnetwork through the IP range has been thoroughly studied in SixSe1-x glasses [11],\nwhose topology is believed to be similar to that of GexSe1-x. The variation in the\nRaman frequencies of CS, ES and Se chain mode (CM) with Si composition x\nprovide some understanding of the evolution of the connectivity between Si\ntetrahedra and Se chains. It is observed that for x > 0.19, the CS, ES and CM\nmodes become increasingly asymmetric and require more than one Gaussian to\ndeconvolve the spectrum. Asymmetric nature of the signal suggests increase in the\ncoupling among Si tetrahedra due to the decrease in Se chain lengths as x increases\nabove 0.19. At x = 0.19, the CM splits into two modes. The intensity of the higher\nmode increases to a maximum at x = 0.26 (second rigidity threshold) and decreases\nto zero as x increases to 0.33. The lower mode decreases linearly above x = 0.19.\nThis peculiar behavior of CM suggests the appearance of short Se chain segments\nin the IP window, most probably Se dimers or trimers as suggested by the authors,\nwhich link the CS and ES tetrahedra. It is interesting to note that the total constraint\ncount for Se dimer connecting two tetrahedra (Ge-Se-Se-Ge) is equal to 3.0, the\nnumber of degrees of freedom of the network. The presence of such structural\nsegments may explain the disappearance of pressure threshold mentioned above.\nThe thermal response of the A1 (tetrahedral breathing mode) of CS tetrahedra and\nSe CM mode also shows some interesting features. Wang et. al.[12] have shown\nthat below the IP window, the frequency shift rate, between 100K and 300K, for A1\nmode remains higher than that of CM mode. Between x = 0.2 and x = 0.28, the A1\nshift rate decreases and the shift rate for CM mode increases and coincides with\nthat of A1 mode. The decrease of the shift rate of A1 mode in the IP window also\nsuggests the appearance of shorter Se chain segments, which would increase the\ncoupling between tetrahedra thus making A1 mode less sensitive to the\ntemperature.\nThe evolution of IRO through the IP has also been studied. Wang et. al. [2]\nhas performed X-ray scattering (XS) measurements on a wide range of GexSe1-x\ncompositions. They have reported a shift in the slope of FSDP position with Ge\ncontent at x = 0.2. The area of FSDP however, shows a plateau in the range roughly\ncoinciding with that of IP. They attribute these features to the diminishing of longer\nSe chain segments above x = 0.2. Change in the FSDP at x = 0.2 is also supported\nby anomalous X-ray scattering (AXS) measurements [13]. Recently, Shatnawi et.\nal. [3] have reported high energy x-ray synchrotron radiation measurements\ncoupled with x-ray absorption fine structure on these glasses. Contrary to the\nfeatures reported by Wang et al.[2] and others [1], they did not observe any\nstructural signature from the IP. All the structural parameters related to IRO evolve\nsmoothly through the IP window and no sudden change at the two rigidity\nthresholds is observed. Although the IRO signature of the intermediate phase is not\n26\n\n\fyet clear due to these conflicting reports, one can look for other structural\nresponses, for example variation in the local density of these glasses, which can be\nstudied using techniques like small angle X-ray scattering (SAXS). The appearance\nof small Se chain segments in the IP window, as suggested by Raman\nmeasurements, can affect the local densities within the crossover lengths ξ below\nwhich the network can adopt fractal like characteristics [14]. There is not much\nliterature available on the electronic features of the IP. Taniguchi et al.[15] have\nreported photoemission (PES) and inverse photoemission (IPES) studies on these\nglasses. They observed a splitting of the conduction band at the first rigidity\nthreshold with the major peak shifting towards lower energies. Recently, Novita et.\nal.[16] have observed a slight increase in the conductivity of solid electrolyte\nglasses (AgI)x(AgPO3)1-x in the IP range relative to 'stressed rigid' phase. In the\nfloppy range conductivity is found to increase linearly. We have performed X-ray\nabsorption fine structure (XAFS) measurements on these glasses and have\nobserved a clear shift in the absorption edge within the IP range, details of which\nare discussed later.\nThe first theoretical picture of the IP was developed by Thorpe et. al. [17].\nThey modified the floppy to rigid transition concept by introducing the idea that in\nthe floppy network, inclusion of extra bonding constraints create rigid but 'stressfree' regions. Thus when the system goes through the first transition, network\nbecomes rigid but still in a stress-free or isostatic state. Further inclusion of\nbonding constraints would result in the accumulation of stress in the network, and\nhence the system will go through the second transition from stress-free rigid to\nstressed-rigid transition. The isostatic state of the network in the IP range is what\nthey referred to as the 'self-organized' phase, in which the network responds to the\naddition of bonding constraints in a way to avoid the accumulation of stress. In real\nsystems, such a self-organized state must be driven by the free energy of the\nnetwork. Simulations are performed using different empirical approaches to study\nthe realization of self-organized state of the network. Thorpe et al. [17] have tried\nto achieve a stress free state starting from a floppy network by adding constraints\n(bonds) in such a way to avoid 'stressed bonds'. Micoulaut and Phillips [18] used a\nprobabilistic approach. They constructed clusters of GexSe1-x by using size\nincreasing cluster approximation (SICA). The basic idea is to construct a binary\nclustered network of species A and B by joining the BA4/2 Ge(Se1/2) 4 tetrahedra\nand A2 (2-fold Se) units according to the probabilities of different types of\nconstruction. They have shown that, starting from a floppy cluster (consisting\nmostly of A2 type units), an isostatic phase can be achieved by adding BA4/2 units\nin a A2- BA4/2 like isostatic bonding. The isostatic phase obtained from this\nconstruction shows a local minimum in the free energy, suggesting an equilibrium\nphase with respect to cross-linking of these units. Other approaches have been\nproposed by a number of authors [19].\nRecently we have studied the models of GeSe glasses spanning over a wide\ncomposition range including IP window, obtained from first principle MD\nsimulations [20]. The topological analysis of these models reveals the structural\nfeatures, which can be attributed to a kind of self-organization associated with the\n27\n\n\fIP. Such a self organization involves the re-organization of local bonding as the\nnetwork evolves from a floppy Se rich environment, consisting of long Se chains\nconnecting Ge tetrahedra, to the rigid GeSe2 network which mainly consist of CS\nand ES tetrahedra. In particular, the network maintains a relatively high\nconcentration of isostatic twofold Se units having one Se neighbor and one Ge\nneighbor through the IP window. We also observed an electronic feature of the IP\nin our models. The conduction band is found to shift in a reproducible and\ncomposition-dependent way through the IP range, while the valence band didn't\nshow any considerable change through the IP window. The shift of the conduction\nband resembles the shift observed in the inverse photoemission studies mentioned\nabove. To investigate this feature we have performed more precise measurements\nusing XAFS technique and observed a similar shift in the absorption edge.\n\nRealistic Computer Models of the Intermediate Phase\nWe have made the first realistic models of Ge-Se alloys based upon ab\ninitio atomic interactions in the IP range. For simulations, the approximate ab initio\ndensity functional code FIREBALL developed by Sankey and co-workers [21] is\nused. The method has been found successful for a variety of covalently bonded\nsystems, and most especially glassy germanium selenides [22]. A sequence of\nGexSe1−x models with Ge concentrations varying between x = 0.10 and 0.33 are\ngenerated using a quench from the melt technique. Radial distribution functions\ncalculated from these models show a reasonable agreement with X-ray diffraction\nexperiments. Details regarding model generation and their properties may be found\nelsewhere [20].\nStructural analysis of these models reveals interesting features in the IP\nrange. Topological parameters like the concentration of CS and ES tetrahedra and\nnumber of rings show saturation in the IP window, which hints at the presence of\nthe intermediate phase in our models. As the building blocks of the Ge-Se network\nare (Ge(Se1/2)4) tetrahedra and Se2 molecules, the evolution of the network from aSe to GeSe2 glass can be described in terms of the evolution of three types of Se\nneighbors (GemSe2-m), where m = 0,1,2. Concentrations of these units for all the\ncompositions are shown in Fig. 1. In the IP range, isostatic like units m = 1 rise to a\nhigher concentration compared to other units, which suggests the presence of a\nmixture of a-Se and g-GeSe2 phases. Following the SICA approach [18], we fitted\nthese concentrations with functions am + bmPm, where Pm is the binomial\nprobability of the formation of unit m and am and bm are the fitting parameters.\nParameter bm can be interpreted as the measure of the randomness in the evolution\nof the concentration of unit m, where bm = 1.0 means completely random or\nstochastic and bm = 0.0 means no randomness at all. Fig. 1, shows a reasonable\nfitting of the concentration of the three units with the bm = 0.98, 0.6 and 0.7 for m =\n0,1 and 2 respectively [20]. The lower value of b1 shows the decrease in the\nrandomness of the network connectivity in the IP range, where m = 1 units\napproach the higher concentration. The non-stochastic nature of the IP is also\nrevealed in the 129I Mössbauer spectroscopy (MS) experiments on these glasses.\n28\n\n\fStudies by Bresser et al.[23][24] show that the ratio IB/IA of MS integrated intensity\ndue to chemically disordered sites B and ordered sites A deviates from the\nprediction of the chemically ordered continuous random network (CRN) model.\nThe non-stochastic nature of the IP is the key to the understanding of\nexperimentally observed anomalies in the structural evolution of these glasses. The\n\nFigure 1. Concentration of three units (m=0,1 and 2) plotted against the Ge\ncontent. These concentrations are fitted using the probabilistic model of Micoulaut\nand Phillips discussed in the text [20].\n\nextent to what these models show non-random behavior is of course limited by the\nshort time scales involved in the MD simulations, but just having a similar nonrandom behavior in these models should be enough to understand, at least\nqualitatively, the structural and electronic signatures of the IP at the atomic level.\n\nNetwork Evolution with Composition\nThe structural units of the Ge-Se network are the Ge(Se1/2)4 tetrahedra and the\npolymeric Se chains. Addition of Ge would cause the cross-linking of Se chains,\nwhich then result in the appearance of relatively smaller Se chain segments Sen\nconnecting the Ge tetrahedra, where n = 1,2,3,... are the number of Se in the\nsegment. Fig 2a shows the concentrations of Sen (n = 2,3,4 and 5) segments. All of\nthese segments assume higher concentration in the IP window and decrease\noutside. Relatively higher concentration of n = 2 segments for the stoichiometric\ncomposition is due to higher number of 3-fold Se sites (about 18%). Average\nlengths of these segments are shown in Fig. 2b. There is a subtle correlation\nbetween the concentration of these segments and their average lengths. For n > 2\nall the chains increase in number but their lengths decrease at the first rigidity\nthreshold, while Se2 segments assume a higher concentration in the middle of the\nIP window, but their average lengths increase to maximum around x = .15 and\ndrops to a minimum at x = .22, where all longer segments show increase in their\naverage lengths. Since these segments are connected to each other through Ge sites,\n29\n\n\fit is reasonable to assume some spatial correlation between bigger (n > 2) and\nsmaller (n ≤ 2) segments. Increase in the lengths of bigger segments would result\nin the decrease of the lengths of smaller segments. To understand the changes in\nthe lengths and the concentrations of these segments, we focus on the behavior of\nn = 1 segments, which represent either CS or ES tetrahedra. We already have\nshown in Fig.1 that these segments increase from a minima in Se rich environment\nto a maxima at x = .33. Considering only the sites constituting n=1 segments, we\ncalculated the average density of these sites within radial distance range 3.0 Å to\n4.5 Å (which encloses the second shell in the total pair correlation function [20]) of\neach site (Fig. 3a). The increase in the density suggests that the Ge sites tend to\nform clusters rather dispersing uniformly in the a-Se network. Lets call the cluster\nregion of n = 1 unit as region A, which can be considered as sub-critical segments\n\na)\n\nb)\n\nFigure 2. a) The concentration of short Sen (n=2,3,4,5) chains varying with the Ge\ncontent. b) the fluctuation in the average lengths of these chains.\n\nof GeSe2 embedded in the a-Se environment. Interestingly, the increase is not\nmonotonic, density decreases in the middle of IP window before it increases again\nto a maxima. The decrease in the density around x = .22 can be explained in\nconnection with the high concentration of longer Se segments in the middle of the\nIP, as shown in fig. 2a. Shorter Se segments appear due to the cross linking which\noccur at Ge sites. Increase in Ge content increases the cross linking and thus\nincreases the concentration of these segments. As Ge sites form clusters of CS and\nES tetrahedra, it guaranties the persistence of these Se segments. The clustering of\nGe sites may be inferred from the increase in the intensity of the FSDP[3] which is\nmainly derived from Ge-Ge correlations [4][22]. Since the Se chains appear\nbetween these clusters, they act as a 'barrier' keeping these clusters apart. Lets call\nthe region filled by the Sen segments with n > 1 region B. The rest of the space\nencompassing the a-Se environment, we call region C. Fig. 3b shows the variation\nof Se concentration which lies in the three regions. Starting from x = .10, Se in\nregion A and B increases at the cost of Se sites in region C. In the IP window, the\nconcentration of Se in region B remains nearly constant, while Se sites in region C\ncontinue to decrease with increase in the Se concentration in region A. This shows\nthat Ge sites continue to nucleate clusters of CS/ES tetrahedra at the cost of region\n30\n\n\fC, until most of this region is transformed into region B. Further increase in Ge,\nthen starts the cross-linking in region B, which results in the decrease of Se\nconcentration above x = .25, and so the region A percolates over the whole space at\nx = .33. The process is further elaborated in the visual inspection of the atomic sites\nin the real space. Fig. 4a-h shows the network of region A (red) and region B\n(blue). Increase in the region A is accompanied by the increase in the B region.\nBetween x = .20 and .25 the two regions seems to coexist without any considerable\nchange in the overall volume of the region A. At x = .33 region A has spread all\nover the cell. From the above analysis an atomic picture of the IP emerges. In these\n\nFigure 3. a) Concentration of Se sites in three regions A, B and C (see the text) are plotted\nagainst 'x'. b) Variation in the Local density (between the radial distance of 3.0 Å and 4.5\nÅ) of sites in region A is shown.\n\nmodels the intermediate phase essentially appears due to the emergence of short\nSen chains, which is a consequence of the tendency of Ge sites to form clusters of\nCS/ES tetrahedra. There are clear indications of the appearance of these chains\npresent in the evolution of Raman Se chain modes [11]. It seems that the evolution\nof these short chains defines the position and the width of the IP on the\ncomposition scale. Since these chains act as a barrier against the percolating region\nA, in the IP window, causing these chains to break would result in the collapse of\nthe IP. This is what observed when iodine is introduced in x = .25 composition.\nWang et al. [25] has reported the Raman and MDSC studies on the Ge1/4Se(3/4-y) Iy\nalloys. The IP width is found to collapse considerably with the inclusion of iodine.\nIodine being a monovalent tends to break the Se chain network thus causing the IP\nto collapse as suggested by the authors.\n\n31\n\n\fFigure 4. Atomic sites constituting the region A (red) [GeSe2 fragments] and region B\n(blue) [Sen chains] are shown in real space for all the compositions.\n\nElectronic Structure\nAn earlier PES and IPES study [15] on these glasses shows some\nindication of the electronic consequences of the rigidity threshold. Recently we\nhave performed X-Ray Absorption Near Edge Structure (XANES) measurements\n32\n\n\fon a wide composition range of GexSe1-x glasses including the IP window. In the\nfollowing a brief description of the technique is given and the results are discussed.\n\nExperimental Background\nX-ray absorption fine structure (XAFS) is an experimental technique used\nto study atomic and electronic structure of materials. In the even of x-ray\nabsorption by an atom, two basic processes are invoked, i.e., photon-electron\ninteraction and electron-electron interaction. In the first process, inner shell\nelectrons of an atom are excited to the lowest unoccupied electronic states and\nbeyond. In the second process, the freed photoelectrons are backscattered by the\nneighboring atoms surrounding the absorbing atom. Interference of the outgoing\nelectrons with the backscattered electrons modulates the x-ray absorption process.\nThis modulation can be observed from a plot of x-ray absorption coefficient versus\nx-ray energy, which is called XAFS. General speaking, an XAFS spectrum is split\ninto two regions by a point that is roughly 50 eV above the absorption edge. The\nlower energy region of XAFS is called XANES, and the rest part is called extended\nx-ray absorption fine structure (EXAFS). XANES provides information about the\nmedium-range and the electronic structures around a specific element. In contrast,\nEXAFS provides complementary information about the short-range structure such\nas bond length, coordination number, and the Debye-Waller factor.\nStructural information obtained from XANES is plenteous. On the one\nhand, photoelectrons in the XANES region have large wavelengths, which make\nXANES sensitive to medium-range structure as well as spatial correlation of shortrange structure due to multiple scattering processes. On the other hand, XANES\nspectra contain information about the unoccupied electron density of states (viz.,\nthe conduction band) [26], Therefore, XANES can be used to study the conduction\nband structure.\n\nExperiment\nSamples selected for this study are bulk GexSe1-x (x = 0.16, 0.18, 0.19,\n0.20, 0.21, 0.23, 0.24, 0.27, 0.30, 0.33) glasses prepared by the traditional meltquenching method. Detailed description of materials fabrication can be found\nelsewhere[10].\n\n33\n\n\fFigure 5. Normalized spectra (red circle) and their derivative (black line) are\nshown for (a) Se and (b) Ge K edge.\n\nXANES measurements were performed on beamline 9-BM-B of the\nAdvanced Photon Source (APS), Argonne National Laboratory. The x-ray ring at\nAPS was operated at 7.0 GeV in non-topup mode. The circulation current of the\nstorage ring was between 85 and 100 mA. Synchrotron x-rays originated from an\nundulator source were selected by a cryogenically-cooled Si (111) channel-cut\nmonochromator. The energy resolution of the x-rays at 12 keV was about 1.5 eV.\nGe K-edge (Ex-ray = 11.104 keV) and Se K-edge (Ex-ray = 12.658 keV) XANES\nspectra were collected in transmission mode. The x-ray intensities before and after\nthe sample were recorded using two Oxford ion chambers. The samples were\nprepared by grinding the bulk glasses into fine powders and then spreading them\nonto kapton tape. Twelve layers of such tape were stacked together to optimize the\nsignal-to-noise ratio. A Ge0.33Se0.67 powder sample was used as a reference to\ncalibrate the absorption edge positions for all the samples. To obtain the XANES\nspectra with high precision, an energy step size of 0.25 eV was applied during the\ndata collection. Figure 5 shows the normalized Ge (5a) and Se (5b) K-edge\nXANES spectra (red circles) of a Ge0.33Se0.67 glass. Strong x-ray absorption peaks\nare observed at Ex-ray = 11.105 keV for Ge, and at Ex-ray = 12.658 for Se. These two\npeaks, usually called white lines (WL), originate from the electronic transition\nbetween the 1s orbital and the conduction band. Because of the fully screened core\nholes in the 1s orbital, the WL is an indication of the conduction band structure\n[26]. Any change in the WL peak position implies a relative shift of the electronic\nstates in the conduction band. To determine the peak position precisely, we applied\nthe first derivative to the XANES spectra, and the results are shown in the black\ncurves in Fig. 5. The absorption edge position was determined by finding the x-ray\nenergy position where the first derivative equals to zero. Fig. 6 shows the variation\nin the relative K-edge WL positions for Se and Ge atoms with Ge content (black\ntriangles). In the case of Se, the WL position decreases to a 'plateau' from x = 0.33\n34\n\n\fas x decreases, with a sudden increase at x = .24 and x = .19 close to the IP\nwindow. A similar profile is observed for the WL positions for Ge atoms, though\nthe shift is smaller compared to the shift in WL position for Se atoms. Since the\nXANES signal is mainly affected by local atomic arrangements around the probed\nsite, the difference in the WL position shift for Se and Ge reflects a wider range of\nbonding environments among Se atoms relative to Ge atoms. Note that the Ge Kedge and Se K-edge XANES spectra were obtained independently, so the observed\nshift in WL positions at x = .19 and x = .24 reinforces the existence of the\nfluctuations in conduction edge seen in the IP window. Since we have used the\nsame reference for all the samples, the uncertainty in the WL positions (±0.01 eV)\nwas determined by combining the errors from repeated measurements of the same\nsample as well as from measurements of different samples with the same\ncomposition.\n\nDiscussion\nThe shifts in the WL positions are directly related to the shift in the conduction\nband. To observe this effect in our models, we calculated the average conduction\nband energy\n\n, where\n\nis the electronic density of states\n\nFigure 6. Black points shows the variation in the WL positions of Se and Ge atoms.\nRed points are the average conduction band edges calculated from the models.\n\nand CB specifies within a quadrature range of about 1.5 eV from the conduction\nedge. In fig. 6, red points represent the variation of\nwith Ge content. The\nabsolute values are shifted with a constant for comparison. The link between\nmodels and the experiment is pleasing. The relative shift in\nis comparable\nto the shift in the WL position for Se atoms, also it shows the sudden increase at\n35\n\n\fx = .20 and .23, a feature which is quite apparent in the experimental data. A small\ndiscrepancy in the positions of the two peaks from that of experiment could be due\nto the small size and rapid quench rates used in the preparation of these models.\nApart from that, the overall profile of the shift in the absorption edge with the Ge\ncontent is clearly reproduced in the atomistic models.\nThese electronic features can be understood within the topological picture\nof the IP discussed above. To explore the underlying spatial character of the\nconduction edge states, in Fig. 7, the three lowest eigenstates at the conduction\nedge are shown for compositions around the IP window. Black and Red sites\nrepresent Se and Ge atoms, which contribute to the three eigenstates and white and\ngreen are their neighboring Se and Ge atoms.The shift in\ncan be compared\nto the appearance of Ge neighbors (green sites) around the eigen vectors. The size\nof the clusters of Ge increases till x=0.18 which corresponds to the decrease in\nfor x > 0.10. At x = 0.20 though, there are less Ge neighbors around the\n\nFigure 7. Charge from three lowest eigenstates L, L1 and L2 at the conduction edge\nare shown in real space for different compositions. Black and Red sites are Se and Ge\ncontributing to the states and white and green are their neighboring Se and Ge sites.\n\neigen vectors, which correlate with the increase in\n. Similarly at x = .22 and\nx = .25, the Ge clusters are relatively more compact as compared to x = .23\ncompositions which shows the second peak in\n. Since clustering of Ge sites\nproduces short Se chains as discussed above, the region around these clusters can\nbe considered as a strained region, which thus contribute to the localization of the\neigenstates. This visual inspection implies a correlation between the clustering of\nGe sites and the shift in the conduction edge energy. To explore this correlation\n36\n\n\fFigure 8. a) The variation in the atomic sites belonging to the three regions, which\ncontribute to the localization of ten eigenstates at the valence and conduction tails. b)\nThe variation in the average length of n=1 and n=2 Se chains.\n\nfurther, we look at the evolution of atomic sites, belonging to three topological\nregions defined above, which contribute to the conduction and valence tail states.\nFig 8a shows the concentration of atomic sites in regions A, B and C contributing\nto the localization of the tail states. As commented above, in the IP range the\nlocalized states are mostly localized on short Sen chains. Since in the IP range, the\nband tails states are mainly residing on these short Se chains (Fig. 8a), the IP would\nalso be sensitive to the light illuminations as the micro Raman studies suggests\n[27]. The strain on short n = 1 and n = 2 chains, in the IP window is clear in Fig.\n8b, which shows the variation in the average lengths of these chains with the Ge\ncontent. In the IP window, n=2 chains shows a clear decrease at x = .22 and the\naverage length of n = 1 shows a profile which correlates with the shift of\nin the IP window. To study the effect of 'bending' of these chains on the electronic\nspectrum, we used a toy model consisting of n = 1 and n = 2 chains connected with\neach other as shown in Fig.9. First the model is relaxed by minimizing the forces\nusing ab initio code VASP and the electronic density of states are calculated. To\nsee the effect due to the bending of these chains, the chains are bent by changing\nangles at the Se sites keeping all the bond lengths fixed. Indeed, the bending of the\nchain caused the shift in the eigen spectrum with major shift in the eigenvalues\nabove the Fermi level. The average shift above the Fermi level is about 0.8 eV,\nwhich suggest that the antibonding states of this system are strongly affected by the\nvariation in the bond angles on Se sites.\n\n37\n\n\fRelaxed\n\n4.35 Å\n\n3.74 Å\n\nTuned\n\n4.12 Å\n\n3.48 Å\n\nFigure 9. A toy model consisting of n=1 and n=2 chains. Dangling bonds on Ge\n(green) sites are passivated by hydrogen (red) atoms. The lengths of the chains are\naltered by changing angles situated on Se (blue) atoms, without changing the bond\nlengths and bond angles residing on Ge sites.\n\nSummary\nFrom this theoretical and experimental study, a generic atomistic picture of\nthe IP has emerged. In this picture the intermediate phase appears as a consequence\nof the competition between two phases (a-Se and g-GeSe2). It is shown that the\naddition of Ge nucleates sub critical volumes of Ge clusters, which gives rise to the\npersisting region of short Se chains in the network. The intermediate phase appears\nwhen most of the background a-Se network is transformed to short Se chains and\nthe system mainly consists of small volumes of CS/ES tetrahedra and short Se\nchains. Electronic signature of such a formation of mixed phase appears as a shift\nin the conduction band. This electronic feature is of the IP obtained from the\nmodels agrees well with the shift in the WL positions obtained from XANES\nspectra.\n\nAcknowledgments\nWe wish to strongly acknowledge Prof. P. Boolchand for providing the\nsamples we employed in the XANES work. GC thanks Ohio University Start-up\nFund for supporting this work. DAD thanks the NSF for support under Grants\nDMR 0605890 and DMR-0600073. FI thanks the NSF for a travel grant under\nDMR-0409588. Use of the APS was supported by the U. S. Department of Energy,\n38\n\n\fOffice of Science, Office of Basic Energy Sciences, under Contract No. DE-AC0206CH11357.\n\nReferences\n[1] D. Sharma, S. Sampath, N. P. Lalla, and A. M. Awasthi, Physica B 357, 290 (2005).\n[2] Y. Wang, E. Ohata, S. Hosokawa, M. Sakurai, and E. Matsubara, J. Non-Cryst. Solids\n337, 54 (2004).\n[3] M. T. M. Shatnawi, C. L. Farrow, P. Chen, P. Boolchand, A. Sartbaeva, M. F. Thorpe,\nand S. J. L. Billinge, Phys. Rev. B 77, 094134 (2008).\n[4] P. S. Salmon, J. Non-Cryst. Solids 353 2959 (2007).\n[5] J.C. Phillips, J. Non-Cryst. Solids 34 153 (1979).\n[6] J.C. Phillips, J. Non-Cryst. Solids 43 37 (1981).\n[7] M.F. Thorpe, J. Non-Cryst. Solids 57 355 (1983).\n[8] Xingwei Feng, W. J. Bresser and P. Boolchand, Phys. Rev. Lett. 78, 4422 (1997).\n[9] P. Boolchand, D.G. Georgiev and B. Goodman, J. Optoelectron. Adv. Meter. 3, 703\n(2001).\n[10] Fei Wang, S. Mmedov and P. Boolchand, Phys. Rev. B 71, 174201 (2005).\n[11] D. Selvanathan, W. J. Bresser and P. Boolchand, Phys. Rev. B 61 15061 (2000).\n[12] Y. Wang and Kazuo Murase, J. Non-Cryst. Solids 326-327, 379 (2003).\n[13] S. Hosokawa, Y. Wang, J. F. Berar, M. Skaurai and W. C. Pilgrm, J. Non-Cryst. Solids\n326-327, 394 (2003).\n[14] M. Nakamura, O. Matsuda and K. Murase, Phys. Rev. B 57, 10228 (1998).\n[15] M. Taniguchi, T. Kouchi, I. One, S. Hosokawa, M. Nakatake, H. Namatame and K.\nMurase, J. Electron Spectrosc. Relat. Phenom. 78, 507 (1996).\n[16] Deassy I. Novita, P. Boolchand, M. Malki and M. Micoulaut, Phys. Rev. Lett. 98,\n195501 (2007).\n[17] M.F. Thorpe, D.J. Jacobs, M.V. Chubynsky and J.C. Phillips, J. Non-Cryst. Solids\n266-269, 859 (2000).\n[18] M. Micoulaut and J. C. Phillips, Phys. Rev. B 67 104204 (2003).\n[19] M. V. Chubynsky, M.-A. Biere and N. Mousseau, Phys. Rev. E 74 016116 (2006).\n[20] F. Inam, M. T. Shatnawi, D. Tafen, S. J. L. Billinge, P. Chen, and\nD. A. Drabold, J. Phys.: Condens. Matter 19, 455206 (2007).\n[21] A. A. Demkov, J. Ortega, O. F. Sankey and M. Grumbach, Phys. Rev. B 52, 1618\n(1995). O. F. Sankey, D. A. Drabold and A. Gibson, Phys. Rev. B 50 1376 (1994).\n[22] D. Tafen and D. A. Drabold, Phys. Rev. B 71 054206 (2005). M. Cobb, D. A. Drabold\nand R. L. Cappelletti, Phys. Rev. B 54 12162 (1996).\n[23] W. Bresser, P. Boolchand and P. Suranyi, Phys. Rev. Lett. 56, 2493 (1986).\n[24] P. Boolchand, P. Chen, M. Jin, B. Goodman and W. J. Bresser, Physica B-Condensed\nMatter 389, 18 (2007).\n[25] F. Wang, P. Boolchand, K. A. Jackson and M. Micoulaut, J. Phys.: Condens. Matter 19\n226201 (2007).\n[26] D.C. Koningsberger and R. Prins, X-ray absorption: Principles, Applications,\nTechniques of EXAFS, SEXAFS and XANES , (John Wiley & Sons, New York 1988).\n[27] P. Boolchand, X. Feng and W. J. Bresser, J. Non-Cryst. Solids 293-295, 348 (2001).\n\n39\n\n\f"}