{"id": "http://arxiv.org/abs/0903.2872v1", "guidislink": true, "updated": "2009-03-16T23:05:04Z", "updated_parsed": [2009, 3, 16, 23, 5, 4, 0, 75, 0], "published": "2009-03-16T23:05:04Z", "published_parsed": [2009, 3, 16, 23, 5, 4, 0, 75, 0], "title": "Self-Dual $\\mathcal N$ = 8 Supergravity as a Closed String Field Theory\n  in Twistor Space", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0704.3638%2C0704.3140%2C0704.2708%2C0704.3091%2C0704.1789%2C0704.3076%2C0704.3155%2C0704.2109%2C0704.0674%2C0704.0449%2C0704.0169%2C0704.2013%2C0704.1243%2C0704.2541%2C0704.1329%2C0704.3581%2C0704.0814%2C0704.3516%2C0704.3459%2C0704.0201%2C0704.2324%2C0704.3938%2C0704.2611%2C0704.1406%2C0704.0214%2C0704.2528%2C0704.2400%2C0704.0732%2C0704.0272%2C0704.0231%2C0704.1537%2C0704.2371%2C0704.1449%2C0704.2279%2C0704.2166%2C0704.2256%2C0704.3204%2C0704.3384%2C0704.0916%2C0704.1931%2C0704.3479%2C0704.0471%2C0704.1498%2C0704.0917%2C0903.1078%2C0903.3274%2C0903.2994%2C0903.4966%2C0903.2387%2C0903.3303%2C0903.1054%2C0903.0069%2C0903.0090%2C0903.1417%2C0903.2872%2C0903.1284%2C0903.0624%2C0903.3723%2C0903.1553%2C0903.2047%2C0903.3196%2C0903.2827%2C0903.3772%2C0903.4265%2C0903.3656%2C0903.3388%2C0903.3606%2C0903.1371%2C0903.1392%2C0903.3300%2C0903.4214%2C0903.1205%2C0903.2661%2C0903.2949%2C0903.3171%2C0903.5421%2C0903.3073%2C0903.1030%2C0903.1567%2C0903.3922%2C0903.1185%2C0903.0739%2C0903.3390%2C0903.2122%2C0903.1978%2C0903.5150%2C0903.0245%2C0903.2257%2C0903.1596%2C0903.5055%2C0903.0704%2C0903.4438%2C0903.1361%2C0903.0036%2C0903.5299%2C0903.2789%2C0903.3262%2C0903.4873%2C0903.0351%2C0903.0130%2C0903.1123&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Self-Dual $\\mathcal N$ = 8 Supergravity as a Closed String Field Theory\n  in Twistor Space"}, "summary": "A Closed string field theory action is formulated for $\\mathcal N$ =8\nself-dual supergravity which is off-shell and Lorentz covariant. The bosonic\ntruncation in the quantum field theory limit gives the Plebanski type of action\nin the super space.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0704.3638%2C0704.3140%2C0704.2708%2C0704.3091%2C0704.1789%2C0704.3076%2C0704.3155%2C0704.2109%2C0704.0674%2C0704.0449%2C0704.0169%2C0704.2013%2C0704.1243%2C0704.2541%2C0704.1329%2C0704.3581%2C0704.0814%2C0704.3516%2C0704.3459%2C0704.0201%2C0704.2324%2C0704.3938%2C0704.2611%2C0704.1406%2C0704.0214%2C0704.2528%2C0704.2400%2C0704.0732%2C0704.0272%2C0704.0231%2C0704.1537%2C0704.2371%2C0704.1449%2C0704.2279%2C0704.2166%2C0704.2256%2C0704.3204%2C0704.3384%2C0704.0916%2C0704.1931%2C0704.3479%2C0704.0471%2C0704.1498%2C0704.0917%2C0903.1078%2C0903.3274%2C0903.2994%2C0903.4966%2C0903.2387%2C0903.3303%2C0903.1054%2C0903.0069%2C0903.0090%2C0903.1417%2C0903.2872%2C0903.1284%2C0903.0624%2C0903.3723%2C0903.1553%2C0903.2047%2C0903.3196%2C0903.2827%2C0903.3772%2C0903.4265%2C0903.3656%2C0903.3388%2C0903.3606%2C0903.1371%2C0903.1392%2C0903.3300%2C0903.4214%2C0903.1205%2C0903.2661%2C0903.2949%2C0903.3171%2C0903.5421%2C0903.3073%2C0903.1030%2C0903.1567%2C0903.3922%2C0903.1185%2C0903.0739%2C0903.3390%2C0903.2122%2C0903.1978%2C0903.5150%2C0903.0245%2C0903.2257%2C0903.1596%2C0903.5055%2C0903.0704%2C0903.4438%2C0903.1361%2C0903.0036%2C0903.5299%2C0903.2789%2C0903.3262%2C0903.4873%2C0903.0351%2C0903.0130%2C0903.1123&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "A Closed string field theory action is formulated for $\\mathcal N$ =8\nself-dual supergravity which is off-shell and Lorentz covariant. The bosonic\ntruncation in the quantum field theory limit gives the Plebanski type of action\nin the super space."}, "authors": ["Satchidananda Naik"], "author_detail": {"name": "Satchidananda Naik"}, "author": "Satchidananda Naik", "arxiv_comment": "18 pages, latex file", "links": [{"href": "http://arxiv.org/abs/0903.2872v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0903.2872v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "hep-th", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "hep-th", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0903.2872v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0903.2872v1", "journal_reference": null, "doi": null, "fulltext": "Self-Dual N =8 Supergravity\n\narXiv:0903.2872v1 [hep-th] 16 Mar 2009\n\nas a Closed String Field Theory in Twistor Space\n\nSatchidananda Naik\nHarish-chandra Research Institute\nChhatnag Road, Jhusi\nAllahabad-211 019, INDIA\nNovember 30, 2018\n\n1\n\n\fAbstract\n\nA closed string field theory action is formulated for the N =\n8 self-dual supergravity which is off-shell and Lorentz covariant.\nThe bosonic truncation in the quantum field theory limit gives the\nPlebanski action in the super space.\n\n\f1. Introduction:\nThe conventional quantum field theory calculation of gravity/supergravity\nloops in four dimensions is maligned with ultraviolet divergences and hence it\nis non-renormalizable [1].This is easily realized by naive power counting and\nthe presence of higher derivative terms in the Lagrangian. On the contrary it\nis claimed that N = 4 super-Yang Mills theory is a finite theory [3]. By Kawai,\nLewellen and Tye (KLT)rule the gravity tree amplitudes can be expressed as\nthe Yang-Mills tree amplitudes [4]. By the method of unitarity cutting rules it\nis shown that N = 8 supergravity has the same ultraviolet behaviour as that of\nN = 4 super-Yang Mills theory and hence it is claimed to be finite [2]. This fact\nrenews ample motivation to study off-shell behaviour of N = 8 supergravity\nin the form of closed string field theory. The usual N = 8 supergravity action\nis obtained from compactifying type II string theory on a six torous or d = 11\nand N =1 supergravity M-theory action. On the contrary we study here the\nself-dual supergravity as a N =2 closed string field theory in the Attiyah-Ward\n(AW) space-time. The reason being it is simple and in the linearized level it is\nsame as full non-selfdual theory. The action has the same field content where\nfields with negative helicities are treated as Lagrangian multiplier to the gauge\ncovariant kinetic terms of the positive helicity states. In the pioneering work of\nWitten on twistor string theory [5], all the maximally helicity violating (MHV)\namplitudes of N = 4 super-yang Mills theory are reproduced as D-instanton\ncorrections to the topological B-type string where a Calabi-Yau supermanifold\nCP 3|4 space emerges naturally as the target space of the super-twistor string.\nThe Lagrangian for this B-model is the Open String Field theory Lagrangian of\nsuper-holomorphic Chern-Simons theory, which happened to be anti-self-dual\nSuper Yang-Mills theory. Here the D-instanton correlation function plays the\nvital role in producing the full non- self- dual super Yang-Mills amplitudes.\nHowever Berkovits [6] gives an alternative formulation for the same MHV\namplitudes as the conventional open string amplitudes of the super twistor\nstring. There is a natural generalization of this twistor string proposal of\nN = 4 Super-Yang-Mills theory to that of N = 4 conformal supergravity\n[7]. The conformal supergravity is very nice in the classical level however the\nquantization is not very physically interesting due to the presence of higher\nderivative terms even in the linearized approximation. Due to this Hilbert\nspace is not positive definite and consequently S-matrix violates Unitarity.\nSo a covariant string formulation of N = 8 Einstein Supergravity is more\ndesirable. There are attempts to formulate a super twistor string theory for N\n= 8 supergravity [12]. On the contrary we start from a N = 2 critical closed\nstring theory and write a covariant string field theory lagrangian for self-dual\nN = 8 supergravity. Recently a Lorentz covariant Open string field theory\n3\n\n\fLagrangian for N = 4 self-dual Super-Yang-Mills theory has been proposed\nby Lechtenfeld and Popov [8]. In the same spirit we are trying to formulate\na closed string field theory for the N =8 supergravity. However the problems\nand intricacies are infinitely bigger for this case than the Super-Yang Mills.\nFirst of all to show the local gauge invariance of the super-space one needs to\ngenerate a target super-space from the world sheet variables. Generating super\nspcae from the Neveue-Schwarz variables is extremely complicated may be\npossible. Thus we followed Siegel's [11] approach of putting non-holomorphic\nscalar grassman variables to formulate the super-space.\nThe organization of the paper is as follows. We give adequate review of the\nN =2 critical string theory and basic tools needed for the further construction.\nFirst part of section 3. has basic review of Berkovit's formulation of Closed\nstring and also open string for the Self-dual Yang Mills. In the later part of\nsection 3. we derive our results.\n2. The Preliminaries:\nThe self-dual Yang-Mills and self-dual Gravity theories in 2 + 2 dimensions\nare described by N = 2 critical open and closed strings respectively [9]. The\nperturbative spectrum of N = 2 string has only p2 = 0 as the only ground\nstate. For the four dimensional Euclidean space as the target space there will\nbe each pi zero so that there will be no dynamics and hence this theory is not\nat all interesting. For the non-trivial dynamics of the physical ground state,\nthe target space need to have an SO(2, 2) symmetry so that momenta can\nbe complex. Also only non-vanishing S-matrix amplitude is the three point\nfunction and all higher n-point functions are zero due to the kinematics of\n(2, 2) space. So this massless scalar of the ground state of Open/closed string\ndescribes the dynamics of self-dual Yang-Mills/ Gravity which is topological in\nnature. Before proceeding further it is worthwhile to address the space-time\nsupersymmetry of the N = 2 fermionic string. The three point function is\nonly invariant under the subgroup U(1, 1) of the total Lorentz group SO(2, 2)\nof the target space. This makes the the space-time supersymmetry of N =\n2 critical string theory obscure. However the ground states of the fermionic\nstring with N = 4 world-sheet supersymmetry has larger symmetry and is\ncovariant under SU( 1, 1) × SU( 1, 1). Since the highest weight states of\nN = 4 Superconformal algebra are the same as the physical states of N = 2\nalgebra, it has been argued that both the theories are one and the same [10].\nThe four world-sheet fermions with the combinations of both periodic and\nantiperiodic boundary conditions have sixteen bosonic and sixteen fermionic\nstates as the ground states for the closed string and the spectrum is clearly\n4\n\n\fsupersymmetric. To realize explicit Lorentz covariant one needs these extra\nmissing symmetry SO( 2, 2)/SU( 1, 1) which happened to be SL( 2, R) as\ntwistor variables. The Brink and Schwarz [17] action for N = 2 string is:\nZ\n\nS =\n\nd2 σ\n\n↔\n√ n 1 ab\ng 2 g ∂a xi ∂b x̄ī + 2i ψ̄ ī γ a D a ψ i + Aa ψ̄ ī γ a ψ i\n\no\n\n− a b i\n+ (∂a x̄ī + ψ̄ ī χ+\na )χb γ γ ψ + h.c. ηīi ,\n\n(1)\n\nwhere g ab and Aa with a=0, 1, are the (real) worldsheet metric and U(1) gauge\nconnection, respectively and Da is the gravitational covariant derivative for\nthe spinor with spin connection in two dimension and γa are the worldsheet\ngamma matrices. Here xi and ψ i are complex valued in the target space with\nηīi metric which has a complex structure. In the N = 2 superconformal gauge\none has both left and right hand sectors of superconformal constraint algebras\ndenoted as T , G+ , G− and J and T̂ , Ĝ+ , Gˆ− and Jˆ respectively. In both the\nsectors one has usual (b,c) ghosts,a pair of (β± , γ± )ghosts and a pair of (u,v)\nghosts for U(1) gauge fixing. The cancelation of anomaly dictates the central\ncharge of the matter sector to be 6. It is more convenient for our purpose\nto use SL(2, R) × SL(2, R) basis instead of complex coordinate basis for the\ntarget space. In SL(2, R) × SL(2, R)′ spinor notation\n.\n\nαα\n\nx\n\n=\n\n.\n\nσμαα xμ\n\n=\n\nx4 +x2 x1 −x3\nx1 +x3 x4 −x2\n\n!\n\n,\n\nα ∈ {0, 1} ,\n\n.\nα ∈ {0, 1} , (2)\n\nwhere σμ describes the chiral γ matrices. However in these basis the associated\nconstraints in the left moving sectors are\n.\n. ..\nT = ∂z xαβ ∂z x . + ψ α β ∂z ψ . .. ,\n(3)\nαβ\n\nαβ\n\n..\n..\n. ..\n. ..\nG0 1 = ψ α 1 ∂z x0α. ,\nG1 0 = ψ α 0 ∂z x1α.\n....\n. .. ..\nJ 0 1 = ψ α 0 ψα. 1 .\n\n,\n\n(4)\n(5)\n\nThere are similar constraints for the right moving sectors as well. Here α, β,\n. .\n.. ..\nα, β are space-time spinor indices and α, β are world-sheet SL(2, R)′ internal\nindices for the N =2 R-symmetry. The operator product expansions for X and\nψ are\n. . ....\n.\n.\n..\nαγ β δ\n..\n.\n.\n.\n.\n2ǫ\nǫ\nxαα (z, z̄) xβ β (w, w̄) ∼ ǫαβ ǫαβ ln |z − w|2 , ψ α β (z)ψ γ δ (w) ∼\n. (6)\nz−w\n....\nIn case we bosonize the fermions, the U(1) current J 0 1 becomes ∂H. It is\nnoticed by Berkovits and Vafa [?] that commutation relations among exp (H),\n5\n\n\fexp (−H) and ∂H form an SU(2) or SU(1, 1) algebra. Incorprating these\nas new currents, N = 2 superconformal algebra is extended to small N = 4\nsuperconformal algebra as\n..\n..\n..\n. ..\n..\n. ..\nβ\nγβ\nαβ\nγα\n.\nJ\nGα = ψ ∂z xαγ ,\n= ψ ψγ. β .\n(7)\nThere is an elegant way to make the theory with vanishing central charge\nwithout ghosts by twisting the energy-momentum tensor T → T ′ := T +\n....\n. ..\n1\n0 1\nα0\n∂J\n.\nBy\nthis\nthe\nconformal\nweight\nof\nthe\nspinor\nψ\nhas become zero and\n2\n. ..\nα1\nthat of ψ\nhas become one. Both the fermions are now integer moded and\nalso fermion of zero weight has zero modes on the sphere. Due to the twisting\nthe curvature singularities of the world sheet are taken care of by these twisted\nfermions rather than the ghosts. In a sense the U(1) anomaly plays the role of\n..\nthe ghost anomaly and ψ's play the role of the (b, c) ghosts. Consequently Gα 0\n..\nhas spin one with conformal weight one and Gα 1 has spin two with conformal\n..\nweight two. Hence Gα 0 play the role of BRST- type of currents. Similarly\n....\n....\nJ 0 0 and J 1 1 have conformal weight zero and two respectively. This theory\nhas now N = 4 worldsheet super symmetry and also has SL(2, R) × SL(2, R)′\nspace-time symmetry. In order to formulate N = 8 supergravity we keep one\nof the SL(2, R) symmetries rigid and another to extend it to OSP(8 | 2)\nand consequently gauge it.This needs eight fermionic variables to form the\nsuperspace. Infact the ground state closed string spectrum has eight such\nstates. However it is quite obscure to use these as super cordinates. Following\nSiegel [11] we introduce eight fermionic coordinates θαi as super partner of\n.\nxαα , which are worldsheet scalars with non-holomorphic corelation function.\nInorder to maintain the conformal invariance a set of bosonic variables (bi , ci )\nare introduced. The operator product expansions of θ's and for (bi , ci ) are\nθαi (z, z̄) θβj (w, w̄) ∼ ǫαβ δ ij ln |z − w|2\n\n, bi (z) cj (w) ∼\n\nThe associated stress tensor is\n.\n. ..\n1\nT = ∂z xαβ ∂z x . + ψ α β ∂z ψ . .. + ∂z θαi ∂z θαi + bi ∂z ci\nαβ\nαβ\n2\nand also similarly its super partners\n..\n. ..\nGα 1 = ψ α 1 ∂z xαα. + ci ∂z θαi ,\n\nδ ij\n.\nz−w\n,\n\n..\n. ..\nGα 0 = ψ α 0 ∂z xαα. + ci ∂z θαi\n\n....\n. .. ..\nJ 0 1 = ψ α 0 ψα. 1 + ci bi .\n6\n\n(8)\n\n(9)\n\n,\n\n(10)\n(11)\n\n\f....\nindicating a U(1) anomaly\nHowever the OPE of these J 0 1 's are singular as 2+N\n2\n.. z\nwith charge −(2 + N ) which are 2 due to ψα. 1 and N due to (bi ci ) systems\nrespecively. In the sequel we will show the proper insertions of these ψ's and\nci 's for taking the vacuum expectation values of the vertex operators.( For\nthe closed string all the right moving anti-holomorphic fields are described as\nhatted variales.)\n3. Covariant Closed String Field theory:\nThe most conventional approach to covariant String field theory is Witten's\nOpen String Field theory (OSFT) [14], where strings join together at their\nmid point. The gauge invariance of the OSFT demands only a cubic term in\nits interaction. This procedure of joining and splitting of interacting strings\nmaintains the length of the string intact. If one extends this approach to\nclosed string and trys to maintain the length of the intercting string fixed then\nthe required prescription would be to overlap one of the closed strings with\nthe other half of another closed string by that the resulting closed string will\nhave the same length as that of the overlapping strings. The gauge invariance\nof this type of gluing procedure demands the action to be non-polynomial in\nstring field [20]. There is another school of thought for covariant string field\ntheory pursued by Hata et al. [15], who generalized the light-cone string field\ntheory to covariant one by BRST procedure. In this approach the open strings\njoin at their end points and closed string join together at one point only. The\ngauge invariance of the string fields requires that closed string should have\ncubic interaction where as open string should have non-polynomial interaction\nterm. However by this the string length cannot be held fixed hence behave as\na free parameter in the theory. Although this parameter is easily gauged away\nin the on-shell limit, the ambiguity remains for the off-shell theory. Despite\nthis ambiguity we follow this formulation for the simplicity due to the cubic\ninteraction.\n3.1 Preliminaries of closed string field theory action:\nThe basic string field Φ is a functional of the worldsheet string coordinates\n. . .. . ..\n{xαβ , ψ α β ψ̂ α β , θαi , bi , b̂i , ci , ĉi }. The basic ingredints needed for the gluing and\nsplitting of the closed strings are prescription dependent and these are presented in te appendix. For illustration we present here the Berkovits N = 2\nclosed string theory [16]. For the gluing of string fields, a curvature is created\nat the joining points which is related to the U(1) anomaly as explained in the\nappendix.. The back-ground charge due to the U(1) current which is equiva7\n\n\flent to ghost current of (b, c) system is − D2 which happens to be -2 in this case.\n. ..\nOne needs insertion of zero modes of ψ α 0 to compensate this charge in each\nvertex operator. Taking this in to account Berkovits [16] has prposed a closed\nstring field theory action for N = 2 string field theory which kinetic term is\ngiven as:\nZ\n....\n....\n..\n..\n..\n..\nS = < Φ(J00 0 + Jˆ00 0 )(G00 0 + Ĝ00 0 )(G10 0 + Ĝ10 0 )Φ >\n(12)\nHere subscript zero denotes the zero modes of the operators. More explicitly\n..\n..\n. ..\n. ..\nG00 0 = ψ α 0 ∂x∂0. and similarly Ĝ00 0 = ψ̂ α 0 ∂x∂0. and using the contraction\nα\nα\n. .. . ..\n..\nα0 β0\nαβ\n< ψ0 ψ0 > as ǫ one gets the correct kinetic term as\n.. ∂\n∂\nK.E = ǫαβ ǫαβ\nΦ.\nΦ\n∂xαα. ∂x .\n\n(13)\n\nββ\n\nThe gluing of three string A , B and C satisfy (A(BC)) = ((BA)C)+((AC)B).\nThe interaction term for covariant closed string is given as\nZ h\n..\n..\n..\n..\n..\n.. i\n..\n..\n(G01 0 − Ĝ10 0 )Φ, (G00 0 + Ĝ00 0 )(G10 0 − Ĝ10 0 )Φ (G00 0 + Ĝ00 0 )Φ (14)\nSint =\nwhere [, ] is anti-symmetric product. After a lengthy calculation taking in to\naccount all sorts of contractions and permutations we arrive at the required\nresult which gives the Plebanshki action as:\nSint =\n\nZ\n\nǫαβ ǫγδ Φ\n\n∂\n∂\n∂\n∂\n.Φ\n.Φ\nα\n.\n.\n∂xαα ∂xγ ∂x\nβ\nβ β ∂xδ\n\n(15)\n\nwhere Φ is the pre-potential.\n3.2 Berkovits-Siegel covariant string field theory for self-dual YangMills:\nBerkovits and Siegel [17] have prposed a manifestly Lorentz covariant string\nfield theory action for self-dual Yang-Mills theory where string fields are the\ngauge connection Aα which makes the BRST operator Qα gauge invariant and\nthe auxiliary field gαβ which enforces the self-dual constraint. To illustrate\n..\nfurther – the gauge covariant derivative ∇α = Gα0 + Aα and under the\ngauge transformation\n∇′α = Ω∇α Ω−1 ,\n\n′\ngαβ\n= Ωgαβ Ω−1 + ∇γ Kγαβ\n\n8\n\n(16)\n\n\fwhere Ω and Kγαβ are gauge parameters of the internal symmetry of the YangMills gauge group such that the Lorentz invariant string field theory action\nremains gauge invariant.\nS=\n\nZ\n\n< trgαβ f αβ > .\n\n(17)\n\nHere is for integral over zero modes of x space and <, > is the expectation value of string field operator products where massive unphysical modes\ncontribute in the off-shell, and\nR\n\n..\n..\nfαβ = {∇α , ∇β } = Gα0 Aβ + Gβ0 Aα + {Aα , Aβ }.\n\n(18)\n\nThe {, } denotes the symmetric product of the string fields and each product\nis the Witten's OSFT star product. Also\nI\n..\ndw ..0\n(Gα0 Aβ )(z) =\nGα (w)Aβ (z).\nz 2πi\n\n(19)\n\nThe equation of motion for the string fields from (13)gives\nfαβ = 0,\n\n..\nGα0 g αβ + [Aα , g αβ ] = 0.\n\n(20)\n\nBerkovits and Siegel [17] have also generalized this action for the N = 4 Supersymmetric Yang-Mills theory. More recently Lechtenfeld and Popov [8]\nhave given a covariant cubic string field theory action for the self-dual N = 4\nSupersymmetric Yang-Mills theory in the supertwistor space.\n3.3 Supertwistor space:\nAs mentioned in the section 2. the perturbative string spectrum has only\nmanifest SU( 1, 1) instead of space-time SO( 2, 2) Lorentz symmetry. This\nmissing SO( 2, 2)/SU( 1, 1) symmetry is treated as twistor transformation,\nwhich will be introduced to rotate all the complex structure of the SO(2, 2) and\nfinally integration over this parameter space will ensure the Lorentz covariance.\nThis geometric space H2 = SO( 2, 2)/SU( 1, 1) is a two sheeted hyperboloid.\nFor the Euclidean space R4 the quotient space SO(4)/U(2) parametrizes all the\ncomplex structure happened to be the Rieman sphere CP 1. Atiyah,Hitchin and\nSinger [13] describe the twistor space of R4 as a cmplex manifold PE = R4 ×\nCP 1 ,which is a rank 2 vector bundle over CP 1. similarly the twistor space of\nR2,2 is a complex manifold PH which is R2,2 × H2 . This space is covered by\ntwo (acyclic i.e. in one of the patches λ0 is zero and in another patch λ1 is zero\n\n9\n\n\f. α\nα\n) coordinate patches U± with complex coordinates (ω±\n, λ± ) on each patches\nwhere\n!\n!\n!\n1\n−λ±\n1\n±\nα\nα\n(λα ) =\n, (λ± ) =\n, (λ̃± ) =\n(21)\nλ±\n1\n−λ̄±\nwith the normalization\n\nν+ = (1−, λ+ λ̄+ )−1 ,\n\nν− = −(1 − λ− λ̄− )−1\n\n(22)\n\n.\n.\nα\nand ω±\n= xαα λα ± . On the overlap U− ∩ U+ it is λ+ − = λ− . Using the above\n.\n.\nα\nnormalization the inverse tranformation of xαα in terms of ω±\nis easly found.\nThis shows the reparamtrization of the twistor space. The ransformations of\nanti-holomorphic vector fields and coordinate vector fields are\n∂\n\nα\n. = ν± ǫα. β. λ±\n\nβ\n∂ w̄±\n\n.\n∂\n∂\n∂\n=\n− x1α λα\n. .\n3̇\n∂ λ̄±\n∂ w̄±\n∂xαα\n\n∂\n\n. ,\n∂xαα\n\n(23)\n\nThus the anti-holomorphic vector fields are\nv̄α±\n. = λα±\n\n∂\n\n. ,\n∂xαα\n\nv̄3̇± =\n\n∂\n∂ λ̄±\n\n(24)\n\nSimilarly one can construct holomorphic vector fields. Let us extend this ap.\nproach to superspace geometry. For the graded space {xαα , θαi }, one has a\ngraded twistor space [18, 8] as PS H which is R(2,2)|N × H2 . The local coordi.\nA\nA\nnates on patches US ± are (ω±\n, λα± ) where ω±\n= [xαα λα ± λα± θαi ] The anti\nholomorphic vector fields are\nv̄α±\n. = λα±\n\n∂\n\nv̄i± = λα±\n\n. ,\n\n∂xαα\n\n∂\n∂θαi\n\n(25)\n\n3.4 BRST formulation in Supertwistor space:\nHere we treat the twistorial parameter λα as a constant complex parameter\nunlike the usual twistor string theory where the super-twistor space is the\ntarget space and also constrained to be a superconformal theory. In this sense\nλα can be treated as a zero mode. (However we can always treat λα and its\ncanonical conjugate as a conformal theory with additional ghosts for conformal\n..\ninvariance.) As mentioned in section 2. Gα 0 has spin one and is treated as\n..\nthe BRST current for the left movers and similarly Ĝα 0 for the right movers.\nSo\nZ\nZ\n..\n..\nQαBRS = dz Gα 0 (z) ,\nQ̂αBRS = dz̄ Ĝα 0 (z̄).\n(26)\n10\n\n\fFor the closed string theory let us define\n\u0010\n\nQ = λα QαBRS + Q̂αBRS\nwhich gives\nQ = λα\n\n\"\u0012\n\nψ\n\n. ..\n\nα0\n\n+ ψ̂\n\n. .. \u0013\n\nα0\n\n∂\n\n. +\n∂xαα\n\n\u0010\n\n\u0011\n\n(27)\n\ni\n\nc + ĉ\n\ni\n\n\u0011\n\n∂\n∂θiα\n\n#\n\n(28)\n\nThe BRST operator is equivalent to the (0, 1) vector fields as described in\neq.(25). If we assume that the string field also depends on the twistor variable λ, then inorder that the gauge invariance in the entire twistor space\nis maintained we have to add to the Q another antiholomorphic differential\nQλ̄ = dλ̄ ∂∂λ̄ . One can easily show that Q2 = 0, Q2λ̄ = 0 and also the anticommutator of {Q, Qλ̄ } = 0 due to the Berezinian nature of ψ, θ and λ̄. The\ndesired vertex operator in this BRST cohomology is\n\u0014\u0012 . ..\n\u0015\n\u0011\n\u0010\n. .. \u0013\nα\nα0\ni\ni\nα0\n(29)\nψ\nV = λ\n+ ψ̂\nHαα. + c + ĉ Hαi + dλ̄Hλ̄ .\n\n. ..\nFrom eq.(9) and eq.(11) we show that ψ α 0 has conformal spin zero and charge\n. ..\n.\none and also for ci 's. (Henceforth we will use ψ α 0 as ψ α for convenience). The\nvacuum expectation of these zero modes are\n\u001c . .\n\u001d\n..\ni\nα β\nψ ψ Πi=1..N c0 = ǫαβ\n(30)\nand also similarly for right moving hatted variables. Let us define θαi = c10 θαi\njust to make θαi as fermionic coordinates of charge one.( Here any one of the\nzero modes of ci will do. We can work on either of the coordinate patches say\non U− and drop the - sign from λα− ). For the open string and N = 4, we have\nHαα.\n\n. + θαj θβk ∂β α. φlm ǫjklm\n= Aαα. + θαj ξ ̄αj\n+θαj θβk θγl ∂β α. ξγm ǫjklm + (θ4 )βγδ\n∂β α. Gγδ ,\nα\n\nHαi\n\n= (θαj φkl + θαj θβk ξ βl + θαj θβk θδl Gβδ ) ǫijkl ,\n\n(31)\n(32)\n\nand\nHλ̄ =\n\n1 2 α β i j kl ν 3 α β γ i j k\nν λ λ θβ θα φ +\nλ λ λ θα θβ θγ λ̃σ ξ σl\n2\n3!\nν4\n+ λα λβ λγ λδ θαi θβj θγk θδl λ̃σ λ̃κ Gσκ\n4!\n11\n\n!\n\nǫijkl\n\n(33)\n\n\fWitten's OSFT action is given as\nZ\n\nS =\n\n2\nT r V QV + V 3 .\n3\n\u001c\n\n\u001d\n\n(34)\n\nwhere denotes integration over all the zero modes namely dλd4 xd4 θ and Tr\nis the Trace over the Chan-Paton factors. Using vacuum expectation values\n(eq.(30)) and integrating over the fermionic variables and d2 λ one gets\nR\n\nR\n\nS\n\n=\n\nZ\n\n\u0010\n.\n.\n.\u0011\nd x Gαβ ∂αα. Aαβ + ∂β α. Aαα + [Aαα. , Aαβ ]\n4\n\n+ ξ\n\n\"\n\nαj\n\n.\n\n∇αα. ξ ̄jα\n\nij\n\n.\n\nαα kl\n\n#\n\n+ ∇αα. φ ∇ φ ǫijkl ,\n\n(35)\n\nwhere ∇αα. = ∂αα. + Aαα. . This is the N = 4 self-dual super Yang-Mills\naction.\n3.5 Closed String field theory:\nThe usual closed string field theory action [15] is given as\nS=\n\n1\ng\nV * QV + V * V ⋆ V ,\n2\n3\n\n(36)\n\nwhere * and ⋆ are explained in the appendix. Also invariant under the BRS\ntransformation\nδB V = QV + gV ⋆ V.\n(37)\nConventional bosonic closed string theory is quite subtle due to the gost number conservation. However our case here is further complicated due to the\nunusual closed string vacuum which we chose has charge - 20. So gauge invariance is unusual which we will discuss in the sequel.\nFor convenience let us rescale each θ variable with the zero modes of the\nci0 . Let us define\nθi = c10 ĉ10 λα θαi\n(38)\nwhere λ is chosen on either of the cordinate patches of the twistor space. Now\neach θi has charge +2. To avoid clutter let us define\nθi\nθijkl\n\n= θi ,\n=\n\n1 i j k l\nθθθ θ ,\n4!\n\nθij =\n\n1 i j\nθθ ,\n2!\n\nθijk =\n\nθijk =\n\n1\nǫijklmnop θl θm θn θ0 θp ,\n5!\n\n12\n\n1 i j k\nθθθ ,\n3!\n\n\fθij\n\n=\n\n1\nǫijklmnop θk θl θm θn θo θp ,\n6!\n\nθ8\n\n=\n\n1\nǫijklmnop θi θj θk θl θm θn θo θp .\n8!\n\nθi =\n\n1\nǫijklmnop θj θk θl θm θn θo θp ,\n7!\n\nThe 2N component fields will appear in the expansion of Hαα. , Hαi and Hλ̄ in\nterms θi s.\n. + θijkl ∂αα. φijkl\n. + θij Aααij\n. + θijk λ̃α χαijk\nHαα. = hαα. + θi λ̃α ξαi\n. β\n+θijk λ̃β ∂αα. χ̄ijk\nβ + θij λ̃α λ̃β ∂γ α G\n\nγ ij\n\n+ θi λ̃β ∂αα. ξ ̄iβ\n\n+θ8 λ̃α λ̃β λ̃γ λ̃δ ∂β α. Ωγδ\n\n(39)\n\nSimilarly\nαβ\nHλ̄ = θijkl φijkl + θijk λ̃β χ̄ijk\nβ + θij λ̃α λ̃β G\n\n+ θi λ̃α ξ ̄αi + θ8 λ̃α λ̃β Ωαβ\n\n(40)\n\nLet us first fix the Kinetic energy part of the string field theory action. As\nexplained in the Appendix the dot product for the conventional bosonic string\nfields satisfies\nD\nE\nΨ * Φ = R(1, 2) | b−2\n|\nΨ\n(41)\n2 |Φ1 >\n0\n\ndue to that the kinetic part of the action 12 V *QV is defined as hV (c0 − ĉ0 ) QV i.\nWhen one imposes the linear gauge invariance δV = QΛ this will be invariant only when (b0 − b̂0 )V = (b0 − b̂0 ) Λ = 0. This condition is imposed as\nthe gauge condition on string field. In this case for the vacuum charge to be\nmaintained we prescribe ( as has done in section 3.1,)\n\u0012 ....\n\u001d\nZ \u001c\n.... \u0013\n0 0\n0 0\nˆ\nV J0\n+ J0\nQV .\n(42)\nR\n\nDemanding the gauge invariance\n= QΛ\nwe can verify that the gauge\n\u0012 δV\n....\n.... \u0013\ncondition happens to be either J 1 1 − Jˆ 1 1 QV = 0 or in otherwords\n\u0012\n\nG\n\n..\n\nα1\n\n− Ĝ\n\n.. \u0013\n\nα1\n\nV =0\n\n(43)\n\n..\nThe Gα 1 are weight 2 operators which is equivalent to b0 . Hλ̄ part of the field\n.\ndoes nothave ψ α part and contains all the auxiliary fields. After contractions\n13\n\n\f.\nof ψ α we get\nSK.E =\n\nZ\n\n\u0012\n\u0013\u001d\n\u001c\n..\nd4 x d8 θd2 λ λα λβ ǫαβ Hλ̄ ∂αα. H .\n\n(44)\n\nββ\n\nThe fermionic integration will give the Kinetic energy part of all the fields of\npositive helicity. For the bosonic truncation let us take only θ8 term of Hλ̄\nwhich gives\nZ\n..\nd4 x ǫαβ Ωαβ ∂αα. hβ btd\n(45)\nThe interaction part of the action is 3g V * V ⋆ V where ⋆ operation and its\ncombinotorics are defined in the Appendix. As mentioned earlier three string\ncombinotorics are (A(BC)) = ((BA)C) + ((AC)B). Since Hαα. is fermionic\nand Hλ̄ is bosonic we have the interaction term which will be glued are in the\nform be [Hαα. H . − H . Hαα. ] * Hλ̄ . Demanding the gauge condition\nββ\n\nββ\n\n..\n.. \u0013 h\ni\nGα 1 − Ĝα 1 Hαα. H . − H . Hαα. = 0 , ,\n\n\u0012\n\nββ\n\n(46)\n\nββ\n\nshows that the two form [H, H] is a constant and hence has a poisson structure.\nMore explicitly this will be satisfied if the antisymmetric\nbracket will be taken\n\u0012 ..\n.. \u0013\nwith each form operated by its conjugate Gα 0 − Ĝα 0 . After performing\nthe vacuum contractions of ψ we get\nSint =\n\nZ\n\n\u0013\n. . .. \u0012\nd4 x d8 θ d2 λλα λβ λγ λδ ǫαγ ǫβ δ Hλ̄ ∂αα. H . ∂γ γ. H .\nββ\n\nδδ\n\n(47)\n\nSo far we have not taken the gauge part of the fermionic cordinate. Similarly\nwe shall expand Hαi as in the previous case for the N =4 super Yang-Mills.\nGoing through the same excercise we shall get interaction term in the super\nspace as\nSint =\n\nZ\n\nd4 x d8 θ d2 λ λα λβ λγ λδ W AB W CD Hλ̄ (∂αA HβC ∂γB HδD ) (48)\n\n..\nwhere W A B is the metric in the super-space as {ǫαβ , δij }. This is the main\nresult which resembles the Plebanski equation in the super-space. One can\nmake the bosonic truncation after taking only the θ8 component of the Hλ̄\nand get the usual Plebanski equation. One also get the Prepotential equation\nof Karanas and Ketov [21] once one identifies Hαald = ∂αα. Φ where Φ is the\nprepotential.\n4. The Conclusion:\n14\n\n\fWe have given here a closed string field theory formulation of N = 8 self-dual\nsupergravity. This is completely off-shell and Lorentz covariant. The field\ntheory limit gives the correct action which was earlier formulated by Karanas\nand Ketov[21] and recently by Mason and Wolf [18] in the super twistor space.\nUnlike the conventional twistor string formulation of recent times [5, ?] and\n[7, 19] where twistor space is the target space we treat here the twistor variable\nas a complex parameter of mixing the world sheet super conformal generators.\nWe will calculate the N point MHV amplitudes using the Witten and Nair's\n[5, 19] principle which enables us to calculate the higher point function in the\ntwistor space although without the twistor space more than 3 point function\nvanishes.\n\nAppendix\nIn this appendix we present very basic properties of Closed string field\ntheories.For any generic string functionals Φi (i = 1, 2, 3), the dot and the star\nproducts have the following properties:\nΦ1 * Φ2 = (−)|1||2| Φ2 * Φ1 ,\n\n(49)\n\nΦ1 ⋆ Φ2 = −(−)|1||2| Φ2 ⋆ Φ1 ,\n\n(50)\n\nΦ1 * (Φ2 ⋆ Φ3 ) = (−)|1|(|2|+|3|) Φ2 * (Φ3 ⋆ Φ1 ) ,\nΦ1 * QBRS Φ2 = −(−)|1| (QBRS Φ1 ) * Φ2 ,\n\n(51)\n(52)\n\nwhere |i| (i = 1, 2, 3) is 0 (1) if Φi is Grassmann- even or odd.\nA1. The Reflector:\nLet | Φi > is expanded as a basis in a Hilbert space and let < Φi | be its dual\nthen hΦi | Φj i = δij . Thus the dot product is defined as\nΨ * Φ = hR(1, 2) | Ψ2 >| Φ1 i\n\n(53)\n\nThe reflector maps the state | O > to its BPZ conjugate state. More explicitly\nif two string states are described by two punctured speheres with a uniformizing\ncordinate say z. The local coordinate z1 = z = 0 and another with local\ncordinate z2 = z1 = 0 So\nhR(1, 2) | Ψi (1) >| Φj (2)i = hΨi (z2 = 0)Φj (z1 = 0)i = Gij\n\n(54)\n\nThis will be non-vaishing of only when the total ghost number of the matrix\nelement vanishes. The closed string vacuum has ghost number - 6. Since any\n15\n\n\fphysical bosonic closed string has ghost number 2, inorder that the dot product\nwill be non-vanishing one defines that\nD\n\nΨ * Φ = R(1, 2)b−\n0\n\n2\n\n| Ψ2 >| Φ1\n\nE\n\n(55)\n\nwhere b−\n0 = b0 − b̂0 .\nA2. The ⋆ Product:\nThe ⋆ product is defined as mapping from two string fields to one string field\nsuch as\n| Φ >| Ψ >=| Φ ⋆ Ψ >\n(56)\nFor the three point vertex in the language of conformal field theory [22], which\nis written as three conformal mapping of {hr | r = 1, 2, 3} from a unit disk to\nsphere with cordinates z as\nhV123 || φ1 >| φ2 >| phi3 i = hh1 (φ1 )(z1 )h2 (φ2 )(z2 )h3 (φ3 )(z3 )iS2\n\n(57)\n\nEach map hr is a conformal transformation of the vertex operator at the origin\non the disk to one on the sphere.\n\n16\n\n\fReferences\n[1] G. t Hooft and M. J. G. Veltman, Annales Poincare Phys. Theor. A 20,\n69 (1974)\nG. t Hooft, Nucl. Phys. B 62, 444 (1973);\nS. Deser and P. van Nieuwenhuizen, Phys. Rev. D 10, 401 (1974);\nS. Deser, H. S. Tsao and P. van Nieuwenhuizen, Phys. Rev. D 10, 3337\n(1974)\n[2] Z .Bern ,L. Dixon and R. Roiban, Phys. Lett. B 644 265 2007\nN. E. J Bjerrum-Bohr, D. C Dunbar,H. Ita, W. Perkins, and K. Risager\nJHEP 0612 072\n[3] S. Mandelstam, Nucl. Phys.B 213 (1983)149\n[4] H. Kawai, D.c. Lewellen and S.Tye, Nucl. Phys.B269 (1986) 1\n[5] E. Witten,Perturbative gauge theory as a string theory in twistor space,\nhep-th/0312171\n[6] N. Berkovits,\nAn alternative string theory in twistor space for N=4 super-YangMills,Phys.Rev.Lett. 93 (2004)011601 hep-th/0402045;\n[7] N. Berkovits and E. Witten, Conformal supergravity in twistor-string theory, JHEP, 0408, (2004)009\nhep-th/0406051\n[8] O. Lechtenfeld and A.D. Popov, Phys.Lett. B598 (2004) 113-120\n[9] N. Marcus,A tour through N=2 strings,hep-th/9211059;\nO. Lechtenfeld,Mathematics and physics of N=2 strings,hep-th/9912281.\n[10] W. Siegel,Phys. Rev. D 46 (1992) R3235 [hep-th/9205075].\n[11] W. SiegelSelf-dual N = 8 supergravity as closed N = 2 (N = 4) strings,\nPhys. Rev. D 47 2504 [arXiv:hep-th/9207043].\n[12] M. Abou-Zeid, C. M. Hull, L. J. Mason,\nEinstein supergravity and new twistor string theories, Commun. Math.\nPhys. 282 519 [arXiv:hep-th/0606272].\n[13] M. F. Atiyah, N. J. Hitchin, I. M. Singer, Self-duality in four-dimensional\nRiemannian geometry, Proc. Roy. Soc. Lond. A 362 1972 425.\n17\n\n\f[14] E. Witten, Nucl. Phys. B 268 (1986) 253\n[15] H. Hata,K. Itoh, T. KUgo, H. Kunimoto and K. Ogawa Phys. Lett. 172\nB (1986)195\nH. Hata,K. Itoh, T. KUgo, H. Kunimoto and K. Ogawa Phys. Rev.D35\n(1987)1318\n[16] N. Berkovits,\nA New approach to Super string field theory [arXiv:hep-th/9912121\n[17] N. Berkovits and W. Siegel, Nucl. Phys. B 505 (1997) 139 [hepth/9703154].\n[18] L.J.Mason and M.Wolf\nTwistor actions for self-dual supergravities [arXiv:hep-th] 0706.1941\n[19] V.P.Nair Phys.Rev.D 71(2005)12701\nA Note on Graviton amplitudes for New twistor string theories [arXiv:hepth]0710.4961\n[20] B. Zwiebach ,\nClosed String Field theory[arXiv:hep-th/9305026]\n[21] S. Karnas and S. V. Ketov\nAn action of N = 8 self-dual supergravity in ultra-hyperbolic harmonic\nsuperspace, Nucl. Phys. B 526 597 [arXiv:hep-th/9712151].\n[22] A. Leclair, M. Peskin, C.Preitschopf\nNucl. Phys. B 317 1989 411\n\n18\n\n\f"}