{"id": "http://arxiv.org/abs/0912.2399v1", "guidislink": true, "updated": "2009-12-12T06:39:01Z", "updated_parsed": [2009, 12, 12, 6, 39, 1, 5, 346, 0], "published": "2009-12-12T06:39:01Z", "published_parsed": [2009, 12, 12, 6, 39, 1, 5, 346, 0], "title": "Temperature dependence of the pre-edge structure in the Ti K-edge x-ray\n  absorption spectrum of rutile", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0912.5161%2C0912.4145%2C0912.1031%2C0912.4544%2C0912.2833%2C0912.3671%2C0912.5498%2C0912.2376%2C0912.5374%2C0912.0818%2C0912.1108%2C0912.2087%2C0912.2431%2C0912.2399%2C0912.4712%2C0912.4882%2C0912.4029%2C0912.1168%2C0912.3823%2C0912.0427%2C0912.4940%2C0912.2589%2C0912.0944%2C0912.5252%2C0912.1190%2C0912.3489%2C0912.5021%2C0912.2810%2C0912.2927%2C0912.1131%2C0912.3887%2C0912.0400%2C0912.5362%2C0912.2918%2C0912.5421%2C0912.2889%2C0912.4053%2C0912.2935%2C0912.1838%2C0912.0655%2C0912.3709%2C0912.0603%2C0912.4673%2C0912.4711%2C0912.5424%2C0912.2996%2C0912.3227%2C0912.3785%2C0912.3535%2C0912.0812%2C0912.5157%2C0912.1909%2C0912.1345%2C0912.1107%2C0912.2371%2C0912.3302%2C0912.4745%2C0912.3054%2C0912.3654%2C0912.0684%2C0912.1204%2C0912.1084%2C0912.2675%2C0912.5385%2C0912.0991%2C0912.1563%2C0912.3303%2C0912.0678%2C0912.3853%2C0912.1831%2C0912.1450%2C0912.2177%2C0912.0717%2C0912.0002%2C0912.0255%2C0912.2707%2C0912.1405%2C0912.4897%2C0912.0736%2C0912.3643%2C0912.0451%2C0912.1644%2C0912.4034%2C0912.1948%2C0912.5203%2C0912.2283%2C0912.1311%2C0912.4598%2C0912.1930%2C0912.1143%2C0912.3987%2C0912.4430%2C0912.2508%2C0912.0046%2C0912.1339%2C0912.1342%2C0912.3216%2C0912.1615%2C0912.3408%2C0912.2291%2C0912.1189&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Temperature dependence of the pre-edge structure in the Ti K-edge x-ray\n  absorption spectrum of rutile"}, "summary": "The temperature dependence of the pre-edge features in x-ray absorption\nspectroscopy is reviewed. Then, the temperature dependence of the pre-edge\nstructure at the K-edge of titanium in rutile TiO2 is measured at low and room\ntemperature. The first two peaks grow with temperature. The fact that these two\npeaks also correspond to electric quadrupole transitions is explained by a\nrecently proposed theory.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0912.5161%2C0912.4145%2C0912.1031%2C0912.4544%2C0912.2833%2C0912.3671%2C0912.5498%2C0912.2376%2C0912.5374%2C0912.0818%2C0912.1108%2C0912.2087%2C0912.2431%2C0912.2399%2C0912.4712%2C0912.4882%2C0912.4029%2C0912.1168%2C0912.3823%2C0912.0427%2C0912.4940%2C0912.2589%2C0912.0944%2C0912.5252%2C0912.1190%2C0912.3489%2C0912.5021%2C0912.2810%2C0912.2927%2C0912.1131%2C0912.3887%2C0912.0400%2C0912.5362%2C0912.2918%2C0912.5421%2C0912.2889%2C0912.4053%2C0912.2935%2C0912.1838%2C0912.0655%2C0912.3709%2C0912.0603%2C0912.4673%2C0912.4711%2C0912.5424%2C0912.2996%2C0912.3227%2C0912.3785%2C0912.3535%2C0912.0812%2C0912.5157%2C0912.1909%2C0912.1345%2C0912.1107%2C0912.2371%2C0912.3302%2C0912.4745%2C0912.3054%2C0912.3654%2C0912.0684%2C0912.1204%2C0912.1084%2C0912.2675%2C0912.5385%2C0912.0991%2C0912.1563%2C0912.3303%2C0912.0678%2C0912.3853%2C0912.1831%2C0912.1450%2C0912.2177%2C0912.0717%2C0912.0002%2C0912.0255%2C0912.2707%2C0912.1405%2C0912.4897%2C0912.0736%2C0912.3643%2C0912.0451%2C0912.1644%2C0912.4034%2C0912.1948%2C0912.5203%2C0912.2283%2C0912.1311%2C0912.4598%2C0912.1930%2C0912.1143%2C0912.3987%2C0912.4430%2C0912.2508%2C0912.0046%2C0912.1339%2C0912.1342%2C0912.3216%2C0912.1615%2C0912.3408%2C0912.2291%2C0912.1189&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The temperature dependence of the pre-edge features in x-ray absorption\nspectroscopy is reviewed. Then, the temperature dependence of the pre-edge\nstructure at the K-edge of titanium in rutile TiO2 is measured at low and room\ntemperature. The first two peaks grow with temperature. The fact that these two\npeaks also correspond to electric quadrupole transitions is explained by a\nrecently proposed theory."}, "authors": ["Olivier Durmeyer", "Eric Beaurepaire", "Jean-Paul Kappler", "Christian Brouder", "François Baudelet"], "author_detail": {"name": "François Baudelet"}, "author": "François Baudelet", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1088/0953-8984/22/12/125504", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0912.2399v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0912.2399v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "11 pages, 2 figures", "arxiv_primary_category": {"term": "cond-mat.mtrl-sci", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.mtrl-sci", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0912.2399v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0912.2399v1", "journal_reference": "Journal of Physics: Condensed Matter 22, 12 (2010) 125504", "doi": "10.1088/0953-8984/22/12/125504", "fulltext": "arXiv:0912.2399v1 [cond-mat.mtrl-sci] 12 Dec 2009\n\nTemperature dependence of the pre-edge structure\nin the Ti K-edge x-ray absorption spectrum of rutile\nO. Durmeyer, E. Beaurepaire, J.-P. Kappler\nIPCMS, UMR 7504 CNRS-ULP, 23 rue de Loess, B.P. 43 Strasbourg Cedex 2, France\n\nCh. Brouder\nInstitut de Minéralogie et de Physique des Milieux Condensés, CNRS UMR 7590,\nUniversités Paris 6 et 7, IPGP, 140 rue de Lourmel, 75015 Paris, France\n\nF. Baudelet\nSynchrotron SOLEIL, L'Orme des Merisiers, Saint-Aubin - BP 48, F-91192\nGif-sur-Yvette cedex, France.\nE-mail: christian.brouder@impmc.jussieu.fr\nAbstract. The temperature dependence of the pre-edge features in x-ray absorption\nspectroscopy is reviewed. Then, the temperature dependence of the pre-edge structure\nat the K-edge of titanium in rutile TiO2 is measured at low and room temperature. The\nfirst two peaks grow with temperature. The fact that these two peaks also correspond\nto electric quadrupole transitions is explained by a recently proposed theory.\n\n31 October 2018\nPACS numbers: 78.70.Dm, 63.70.+h\n\n\fTemperature dependence of pre-edge XAS peaks\n\n2\n\n1. Introduction\nPre-edge peaks often arise at the K-edge of transition metal elements. This pre-edge\nstructure is sensitive to the metal valence, to the symmetry of its surroundings and to\nthe atomic species of the neighbours (see [1] for a recent review). As a consequence, the\nmeasurement and analysis of the pre-edge peaks are widely used in earth sciences [2],\nbiology [3], chemistry [4] and physics [5, 6].\nBecause of their practical importance, pre-edge features have to be well understood\nand they were the object of detailed theoretical works using various approaches:\nmultiplets [7, 8], Bethe-Salpeter equation [9], multiple-scattering [10], pseudopotential\ntheory [5, 11]. Vedrinskii and his group were particularly active to extract information\nfrom the pre-edge structure [12, 13, 14].\nIn section 2, we make a short review of the literature to show that the temperature\ndependence of pre-edge peaks is not a rare property of x-ray absorption spectra.\nHowever, this dependence is usually attributed to static off-center displacements or to\nphase transitions. Therefore, our preliminary investigation [15] showing a temperature\ndependence of the pre-edge peaks at the titanium K-edge in TiO2 (rutile) came\nout as a surprise because the pre-edge variation was observed in a temperature\nrange where no phase transition occurs and where many high-precision structural\nstudies [16, 17, 18, 19, 20] indicate that no off-center atomic displacement takes place.\nSoft modes have indeed be reported [21] but the calculated phonon spectrum shows\nexcellent agreement with experiment and no imaginary mode is present [22, 23, 24, 25]\nwhen the proper functionals are used [26].\nThus, we carried out detailed experiments to confirm and analyze this temperature\ndependence. The results of these experiments are presented in section 3. Section 4\ndescribes why such a temperature dependence is a priori surprising and sketches a\ntheoretical interpration that enables us to understand why the temperature dependence\nis restricted to the first two peaks and why no energy shift is observed. A conclusion\nsummarizes our results and provides possible extensions of this work.\n2. A short review\nIn this section, we present a short and non-exhaustive review of the temperature\ndependence of pre-edge peaks.\nAs far as we know, such a temperature dependence was first observed by Durmeyer\nand coll. [15] at the K-edge of titanium in TiO2 (rutile), Li4/3 Ti5/3 O4 and LiTi2 O4 .\nIt was subsequently measured at the titanium K-edge of a several perovskite crystals:\nPbTiO3 [27, 28, 12, 29, 30], SrTiO3 [31, 30], BaTiO3 [30], CaTiO3 [30].\nA similar temperature dependence was observed at other edges in perovskite\ncrystals: at the niobium K-edge of KNbO3 [32, 33], NaNbO3 [34], PbIn1/2 Nb1/2 O3 [35],\nat the zirconium K-edge of PbZrO3 [14], PbZr0.515 Ti0.485 O3 [14], BaZrO3 [14], at the\nK-edge of Mn in La1−x Cax MnO3 [36, 37] and at the K-edge of Fe in in La0.8 Sr0.2 FeO3\n\n\fTemperature dependence of pre-edge XAS peaks\n\n3\n\nand La0.7 Sr0.2 FeO3 [38]. In most cases, the temperature effect was intepreted in terms\nof a phase transition or of a static off-center atomic displacement due to the presence\nof very soft modes in the crystal.\nHowever, the effect is not restricted to the perovskite structure. Apart from the\nresults of Durmeyer and coll. [15], it was observed at the K-edge of titanium in TiO2\nand Mg2 TiO4 [30], at the L-edges of La in Sr-doped La2 CuO4 [39] and at the K-edge\nof V in VO2 [40]. A temperature dependence of XANES spectra was also observed at\nthe K-edge of oxygen in water [41] and in doped LaMnO3 [42, 43]. Finally, the MahanNozières-Dominics singularity can also give rise to a temperature dependence of the\nx-ray absorption spectra of metals (see Ref. [44] for a review).\nWe come now to our experimental temperature dependence at the K-edge of\ntitanium in rutile.\n3. Experiment\nThe x-ray absorption experiments were performed at the D11 (energy dispersive) and\nat the EXAFSII stations of the DCI storage ring of the Laboratoire pour l'Utilisation\ndu Rayonnement Synchrotron in Orsay (France).\nA rutile single-crystal plate (9 mm x 4 mm x 50 μm) was measured at the D11\nstation in the transmission mode. The crystal plate was placed inside a liquid-helium\ncryostat operating between 4.2 K and 300 K. Measurements were carried out for two\norientations, with the (110) face of the crystal perpendicular to the x-ray beam and\nthe c-axis either parallel or perpendicular to the linear polarization vector of the beam.\nThe polychromator consisted in a curved Si(111) crystal focusing the X-ray beam at\nthe center of the cryostat sample holder. Higher harmonics were rejected by a SiO2\nplane mirror. The x-ray intensity was measured by a photodiode array detector. Each\nspectrum was obtained as a result of four measurements: I0 (without sample and with\nthe beam), I0black (without sample and without beam), I (with sample and with the\nbeam), Iblack (with sample and without beam). The absorption spectrum was then\nobtained from the formula σ = log(I0 − I0black ) − log(I − Iblack ). The x-ray energy\ncorresponding to each detector pixel was determined by comparing the spectra with a\nspectrum measured on a two-crystal monochromator beamline. The energy resolution\nwas typically 0.8 eV.\nOur preliminary study [15] showed us that the pre-edge structure could exhibit a\nlow signal to noise (S/N) ratio when the crystal thickness was optimized for the edgejump. Therefore, we optimized the crystal thickness for the pre-edge structure and cut\nan approximately 50 μm thick crystal plate. As a consequence, we obtained excellent\nspectra in the pre-edge region but the XANES spectra after the edge had a rather\nlow S/N ratio and, for each polarization direction, we normalized the spectrum at the\ninflection point of the absorption edge instead of at the edge jump.\nTo check the validity of this procedure, we carried out additional experiments\nat the EXAFSII station. The experimental equipment consisted of a two-crystal\n\n\farb. units\n\n0.7\n0.6\n0.5\n0.4\n0.3\n0.2\n0.1\n0\n\narb. units\n\nTemperature dependence of pre-edge XAS peaks\n\n0.7\n0.6\n0.5\n0.4\n0.3\n0.2\n0.1\n0\n\nA2\n\nA3\n\nǫ||c\n\n250 K\n8K\n\nA1\n4965\n\n4970\n\nǫ⊥c\n\nA2\n\nA3\n\n255 K\n4K\n\nA1\n4965\n\n4\n\n4970\nEnergy (eV)\n\nFigure 1. Temperature variation of the pre-edge peaks at the K-edge of titanium in\nrutile, with the x-ray polarization vector parallel and perpendicular to the c-axis of\nthe crystal.\n\nSi(311) monochromator, an ionisation chamber to measure the incident beam and an\nelectron-yield detector. We measured a bulk rutile single crystal with the (110) face\nperpendicular to the x-ray beam and with the c-axis of the crystal either parallel or\nperpendicular to the x-ray polarization vector. The S/N ratio of the pre-edge region was\ncomparable to that of the Ti K-edge spectra of rutile measured on the same beamline in\nsimilar conditions [45, 46]. The experimental spectra were normalized by the standard\nprocedure and, as in our previous work [15], the temperature dependence was found\nto be negligible except in the pre-edge region. Moreover, the observed spectra and\ntemperature dependence agreed well with the transmission experiments of the D11\nstation. In the present paper we show only the results of the transmission experiments\nbecause of their better S/N ratio.\n4. Experimental results\nFigure 1 shows the pre-edge features of rutile recorded at different temperatures with\nthe polarization vector perpendicular and parallel to the crystal c-axis. A decrease of\nthe first two peaks A1 and A2 is observed at low temperature, whereas the third peak\nA3 does not show any significant variation. It is important to notice that temperature\ninduces a change in the intensity but not in the energy position of the peaks.\n\n\fTemperature dependence of pre-edge XAS peaks\n\n5\n\n1.15\n\nPeak A2\n\n1.10\n\n•\n\n1.05\n\n•\n\n1.00 • •\n0.95\n\n•\n\n0\n\n•\n\n100\n200\nTemperature (K)\n\n300\n\nFigure 2. Relative intensity of peak A2 as a function of temperature for ǫ || c,\nnormalized to 1 at 8K. Dots: experimental results; thick solid line: fit to the function\na(1 + e−θ/T ) + (1 − a); thin solid line: fit to the function a cosh(θ/2T ) + (1 − a).\n\nThe physical origin of the pre-edge peaks of titanium in rutile is well known [47].\nPeaks A1 and A2 correspond to electric quadrupole transitions towards 3d states of\ntitanium with t2g and eg symmetry, respectively. Therefore, the peaks that vary with\ntemperature are also the peaks corresponding to quadrupole transitions.\nIn the optical range, the effect of temperature is usually described by a simple\nmodel developed by Holmes and McClure [48, 49, 50], in which the intensity of the\nvibronic peak varies as 1 + e−θ/T , where θ is the energy of the first vibrational level.\nFigure 2 shows the variation of the A2 peak with temperature, fitted to the function\na(1 + e−θ/T ) + (1 − a), where a(1 + e−θ/T ) represents the fraction of the A2 peak that is\npurely vibrational and 1 − a the fraction that is due to electric quadrupole transitions\n(and to the possible tail of the electric dipole peak A3 ).\nThe result of the fit is a = 0.21 and θ = 168 K ± 10 K. Note that the value of θ\ncompares favorably to the energy of the first odd vibrational level at the Γ point obtained\nby ab initio calculations (168 K [51], 150 K [26], 169 K [25] or 181 K [23]) or by neutron\nscattering 163 K [52]. However, the simplicity of the Holmes and McClure model implies\nthat the quality of this agreement is probably fortuitous. Indeed, an alternative singlemode model is sometimes used [53, 54, 55, 56], for which the temperature dependence\nis coth θ/2T . For this second model the fit gives θ = 58 K ± 5 K and a = 0.014.\n5. Interpretation\nIt remains to understand why only the first two peaks vary with temperature while the\nrest of the XANES spectrum remains constant. We first describe the arguments that\nare usually given to explain the absence of temperature dependence of XANES spectra.\nThen, we show why, in some circumstances, this independence can be broken.\n\n\fTemperature dependence of pre-edge XAS peaks\n\n6\n\n5.1. The temperature independence of XANES spectra\nThere are many reasons to believe that the pre-edge features of x-ray absorption spectra\ndo not depend on temperature in the absence of structural transition. The first reason\ncomes from the temperature dependence of the EXAFS part of x-ray absorption spectra,\n2\nwhich is represented by a Debye-Waller factor e−2k σ in the EXAFS formula. The DebyeWaller factor accurately describes the temperature dependence of XAS in crystals,\nalthough it has to be supplemented with higher order cumulants in disordered materials.\nMoreover, it is well understood because it can be calculated ab initio with a good\nagreement with experiment [57, 58, 59, 60, 61]. If we use this factor to describes the\ntemperature dependence near the edge, we must take an energy very close to the Fermi\nenergy, so that k is very small and the factor is close to unity.\nOf course, near the edge, the effect of temperature is not supposed to be described\nby a Debye-Waller factor and we must use a more sophisticated approach. Natoli's\nrule [62] gives good results near the edge. However, it describes an energy shift through\nthe equation kR =Constant, and we do not observe any energy shift. More elaborate\ntheoretical analyses were carried out. Brouder and Goulon [63, 64] used Lie group theory\nto describe the influence of a displacement on the multiple-scattering operator. However,\nthe temperature evoluation is expected to be small near the edge, essentially because\nof Natoli's rule. Poiarkova and Rehr [57] extended the Debye-Waller factor to multiplescattering paths. Their formalism is not really valid in the pre-edge region, but if we\ntry to extend it we find a very small temperature dependence because of the presence of\nthe k 2 factor in the exponent. Fujikawa [65, 66] used Schwinger's technique to calculate\nthe effect of the Franck-Condon factors on XAFS. He concluded that this effect was not\nimportant. In a later work [67], he investigated the effect of temperature through the\nKeldysh approach to nonequilibrium systems. He found that thermal vibrations could\nbe represented by a convolution with the phonon spectral function. His result is valid in\nthe pre-edge region but leads to a small temperature effect. Moreover, the convolution\nshould give rise to a broadening of the pre-edge peaks with temperature. Again, this is\nnot compatible with our experimental results. A further elaboration of his approach [68]\nlead to similar results.\nWe can try to take vibrations into account by coming back to the BornOppenheimer approximation and writing the initial and final wavefunctions as a product\nof a vibrational and an electronic function. However, this approach looks like a dead\nend if we consider the work by Mäder and Baroni [69] who showed that, at the K-edge of\ncarbon, the vibrations in the final state are strongly anharmonic and are deeply affected\nby the presence of the core-hole. Therefore, we are not allowed to consider the vibrations\nas similar in the initial and final states and we cannot use the harmonic approximation.\nAnkudinov and Rehr [70] brought some hope by showing that the S K-edge\nspectrum of SF6 is closer to experiment when the atomic positions are slightly shifted\nwith respect to the equilibrium position. But, as can be seen in their figure, atomic\ndisplacements shift the position of the main lines and this shift is not experimentally\n\n\fTemperature dependence of pre-edge XAS peaks\n\n7\n\nobserved.\n5.2. The temperature dependence of XANES spectra\nWe recently proposed a model that enables us to understand the observed temperature\ndependence [71]. Although a detailed account of this model would be beyond the scope\nof the present paper, we can give a physical description of the underlying physics.\nWe start from the Born-Oppenheimer approximation where the wavefunctions of\nthe electron+nuclei system is the product of a vibrational function by a solution of the\nSchrödinger equation for clamped nuclei. The energy of these wavefunctions do not\ndepend on the position of the nuclei (as the eigenvalues of the Schrödinger equation\nfor an electron in a potential do not depend on position). The transitions are made\nbetween these wavefunctions. If we assume that the vibrational energies are small with\nrespect to experimental resolution, we can sum over the final state vibrational functions\nand we obtain an average over the vibrational function of the initial state of transitions\nfor which the transition energy do not depend on the atomic positions. This explains\nwhy the peak positions do not move while they move if we calculate the spectrum of a\ndistorted structure.\nThe second step of the model consists in making a different approximation for the\ninitial and the final states. The initial state is taken to be the core state centered at\nthe position specified by the vibrational wave function. For the final state, we make the\ncrude Born-Oppenheimer approximation, where the electronic wavefunction is assumed\nindependent of the position of the absorbing atom. Then, the cross-section boils down\nto an average of the x-ray absorption spectra for a shifted core wavefunction (with\nfixed energies). What happens next can be sketched by an oversimplified model of the\nshifted core wavefunction. We assume that the displacement R is small compared to\nthe electronic variable r and we obtain, to first order in R and for a spherical core state\nφ0 (r), the shifted function\nr*R ′\nφ (r).\n(1)\nr 0\nWhen multiplied by ǫ * r, the additional term gives us a factor ǫ * rR * r that can be\ntransformed into the sum of a monopole term proportional to (ǫ * R)r 2 and a quadrupole\nterm. The monopole term gives rise to transitions towards s states, the quadrupole\nterm to transition towards d states. The transition towards s states are observed at the\naluminium or silicon K-edge [71], the transitions towards d states are observed at the\nK-edge of transition metals because of the presence of a strong density of d states. This\nexplains why the temperature variation occurs at the position of the quadrupole peaks.\nFinally, the fact the temperature-dependent pre-edge peaks grow with temperature is\ndue to the corresponding increase in thermal vibration amplitudes.\nOf course, eq. (1) is not sufficient because the integration over r includes also a\nregion where r < R. The full theory [71] is more complex but the physical idea is the\nsame.\nφ0 (|r − R|) ≃ φ0 (r) −\n\n\fTemperature dependence of pre-edge XAS peaks\n\n8\n\n6. Conclusion\nIn this paper, we have presented the temperature-dependence of pre-edge features at\nthe K-edge of titanium in rutile. This temperature dependence is not due to a phase\ntransition or to a static distortion of the titanium site.\nThe temperature dependence changes only the intensities of the peaks and not their\npositions. Moreover, the peaks that vary with temperature are the electric quadrupole\npeaks of the spectrum. An explanation of this behavior was given in terms of the\ndynamic displacement of the absorbing atom.\nTwo conditions turn out to be crucial to observe temperature-dependent pre-edge\npeaks at the K-edge : (i) a large density of d states below the p states, so that\nthe transitions to final d states are significant and visible; (ii) the existence of lowenergy vibrational modes, so that the temperature effect can be observed at reasonable\ntemperatures. Both of these conditions are satisfied in rutile and in perovskites\ncontaining transition metals. In that case, the temperature dependence provides\ninformation on the local vibrations around the absorbing atom. This can be particularly\nuseful to investigate the vibrations of transition metal impurities.\nAcknowledgments\nWe thank Delphine Cabaret for very constructive comments.\nReferences\n[1] Yamamoto T 2008 Assignment of pre-edge peaks in K-edge x-ray absorption spectra of 3d transition\nmetal compounds: electric dipole or quadrupole? X-ray spectrometry 37 572–84\n[2] Chalmin E, Farges F and Jr G E B 2009 A pre-edge analysis of Mn K-edge XANES spectra to\nhelp determine the speciation of manganese in minerals and glasses Contrib. Mineral. Petrol.\n157 111–26\n[3] Arfaoui M, Cabaret D, Longa S D, Seitsonen A and Mauri F 2007 First-principles full-potential\ncalculations of the Fe K pre-edge and near-edge structure in carbonmonoxy-myoglobin in\nB Hedman and P Painetta, eds., AIP Conference Proceedings vol. 882 (AIP) pp. 331–3\n[4] Getty K, Delgado-Jaime M U and Kennepohl P 2008 Assignment of pre-edge features in the Ru\nK-edge x-ray absorption spectra of organometallic ruthenium complexes Inorg. Chim. Acta 361\n1059–65\n[5] Gougoussis C, Calandra M, Seitsonen A, Brouder C, Shukla A and Mauri F 2009 Intrinsic charge\ntransfer gap in NiO from Ni K-edge x-ray absorption spectroscopy Phys. Rev. B 79 045118\n[6] Vedrinskii R V, Kraizman V L, Lemeshko M P, Nazarenko E S, Novakovich A A, Reznichenko\nL A, Fokin V N and Shuvaeva V A 2009 Local atomic structure of niobates and titanates from\nx-ray absorption spectroscopic data Phys. Solid State 51 1394–8\n[7] Arrio M A, Rossano S, Brouder C, Galoisy L and Calas G 2000 Calculation of multipole transitions\nat the Fe K pre-edge through p-d hybridization in the ligand field multiplet model Europhys.\nLett. 51 454–60\n[8] de Groot F M F, Vankó G and Glatzel P 2009 The 1s x-ray absorption pre-edge structures in\ntransition metal oxides J. Phys.: Condens. Matter 21 104207\n[9] Shirley E 2004 Ti 1s pre-edge features in rutile: a Bethe-Salpeter calculation J. Elect. Spect. Relat.\nPhenom. 136 77–83\n\n\fTemperature dependence of pre-edge XAS peaks\n\n9\n\n[10] Wu Z Y, Natoli C R, Marcelli A, Paris E, Bianconi A and Saini N L 2003 Unified interpretation\nof pre-edge x-ray absorption fine structures in 3d transition metal compounds in A Bianconi,\nA Marcelli and N L Saini, eds., AIP Conference Proceedings vol. 652 (AIP) pp. 497–506\n[11] Juhin A, Brouder C, Arrio M A, Cabaret D, Sainctavit P, Balan E, Bordage A, Calas G, Eeckhout\nS G and Glatzel P 2008 X-ray linear dichroism in cubic compounds: the case of Cr3+ in MgAl2 O4\nPhys. Rev. B 78 195103\n[12] Vedrinskii R V, Kraizman V L, Novakovich A A, Demekhin P V, Urazhdin S V, Ravel B and Stern\nE A 1997 Pre-edge fine structure (PEFS) of the K-XAS for the 3d atoms in coumpounds: A\nnew tool for quantitative atomic structure determination J. Physique 7C2 107–10\n[13] Vedrinskii R V, Kraizman V L, Novakovich A A, Demekhin P V and Urazhdin S V 1998 Preedge fine structure of the 3d atom K x-ray absorption spectra and quantitative atomic structure\ndeterminations for ferroelectric perovskite structure crystals J. Phys.: Condens. Matter 10\n9561–9580\n[14] Vedrinskii R V, Nazarenko E S, Lemeshko M P, Nassif V, Proux O, Novakovich A A and Joly\nY 2006 Temperature dependent XAFS studies of local atomic structure of the perovskite-type\nzirconates Phys. Rev. B 73 134109\n[15] Durmeyer O, Kappler J P, Beaurepaire E, Heintz J M and Drillon M 1990 Ti K XANES in\nsuperconducting LiTi2 O4 and related compounds J. Phys.: Condens. Matt. 2 6127–36\n[16] Burdett J K, Hughbanks T, Miller G J, Jr J W R and Smith J V 1987 Structural-electronic\nrelationships in inorganic solids: powder neutron diffraction studies of the rutile and anatase\npolymorphs of titanium dioxide at 15 and 295 K J. Am. Chem. Soc. 109 3639–46\n[17] Howard C J, Sabine T M and Dickson F 1991 Structure and thermal parameters for rutile and\nanatase Acta Cryst. B 47 462–8\n[18] Sakata M, Uno T, Takata M and Howard C J 1993 Maximum-entropy-method analysis of neutrondiffraction data J. Appl. Cryst. 26 159–65\n[19] Sabine T M, Kennedy B J, Garrett R F, Goran G J and Cookson D J 1995 The performance of\nthe Australian powder diffractometer at the photon-factory, Japan J. Appl. Cryst. 28 513–7\n[20] Kumazawa S, Takata M and Sakata M 1995 An accurate determination of the thermal vibration\nof rutile from the nuclear density distribution of the maximum-entropy analysis Acta Cryst. A\n51 651–8\n[21] Jiang B, Zuo J M, Jiang N, O'Keeffe M and Spence J C H 2003 Charge density and chemical\nbonding in rutile, TiO2 Acta Cryst. A 59 341–50\n[22] Montanari B and Harrison N M 2004 Pressure-induced instabilities in bulk TiO2 rutile J. Phys.:\nCondens. Matter 16 273–92\n[23] Rignanese G M, Rocquefelte X, Gonze X and Pasquarello A 2005 Titanium oxides and silicates as\nhigh-κ dielectrics: A first-principles investigation Int. J. Quant. Chem. 101 793–801\n[24] Rignanese G M, Rocquefelte X, Gonze X and Pasquarello A 2005 Erratum: Titanium oxides and\nsilicates as high-κ dielectrics: A first-principles investigation Int. J. Quant. Chem. 103 354\n[25] Sikora R 2005 Ab initio study of phonons in the rutile structure of TiO2 J. Phys. Chem. Solids\n66 1069–73\n[26] Montanari B and Harrison N M 2002 Lattice dynamics of TiO2 rutile: influence of gradient\ncorrections in density functional calculations Chem. Phys. Lett. 364 528–34\n[27] Ravel B, Stern E A, Yacobi Y and Dogan F 1993 Lead titanate is not a classic case of a displacive\nferroelectric phase transition Jpn. J. Appl. Phys. Suppl. 32-2 782–784\n[28] Engel E, Dreizler R and Malzacher P 1987 Density functionals on the basis of the relativistic field\ntheory J. Physique 48C2 321–8\n[29] Sato K, Miyanaga T, Ikeda S and Diop D 2005 XAFS study of local structure change in perovskite\ntitanates Physica Scripta T115 359–61\n[30] Hashimoto T, Yoshiasa A, Okube M, Okudera H and Nakatsuka A 2007 Temperature dependence\nof XANES spectra for ATiO3 , A2 TiO4 and TiO2 compounds with structural phase transitions\nin B Hedman and P Painetta, eds., AIP Conference Proceedings vol. 882 (AIP) pp. 428–30\n\n\fTemperature dependence of pre-edge XAS peaks\n\n10\n\n[31] Nozawa S, Iwazumi T and Osawa H 2005 Direct observation of the quantum fluctuation controlled\nby ultraviolet irradiation in SrTiO3 Phys. Rev. B 72 121101\n[32] Shuvaeva V A, Yanagi K, Yagi K, Sakuae K and Terauchi H 1999 Polarized XAFS study of the\natomic displacements and phase transitions in KNbO3 J. Synchrotron Rad. 6 367–9\n[33] Shuvaeva V A, Pirog I, Azuma Y, Yagi K, Sakuae K, Terauchi H, Raevskii I P, Zhuchkov K and\nAntipin M Y 2003 The local structure of mixed-ion perovskites J. Phys.: Condens. Matt. 15\n2413–21\n[34] Shuvaeva V A, Azuma Y, Yagi K, Sakuae K and Terauchi H 2001 Polarized XAFS study of\nhigh-temperature phases of NaNbO3 J. Synchrotron Rad. 8 833–35\n[35] Shuvaeva V A, Azuma Y, andK Yagi I P R, Sakuae K and Terauchi H 2004 The local structure\nof PbIn1/2 Nb1/2 O3 Ferroelectrics 299 103–8\n[36] Qian Q, Tyson T A, Kao C C, Croft M, Cheong S W and Greenblatt M 2000 Thermal effects in\nthe x-ray spectra of La1−x Cax MnO3 Phys. Rev. B 62 13472–13481\n[37] Bridges F, Booth C H, Kwei G H, Neumeier J J and Sawatzky G A 2000 Temperature dependent\nchanges of the Mn 3d and 4p bands near Tc in colossal magnetoresistance systems: XANES\nstudy of La1−x Cax MnO3 Phys. Rev. B 61 R9237–R9240\n[38] Deb A, Ralph J M, Cairns E J and Bergmann U 2006 Characterization of La0.8 Sr0.2 FeO3−δ ] and\nLa0.7 Sr0.2 FeO3−δ ] as a function of temperature by x-ray absorption spectroscopy Phys. Rev. B\n73 115114\n[39] Hidaka M, Tokiwa N, Oda M, Choi J Y and Lee J M 2003 Electronic states near Fermi level\nin superconductors La2−x Srx CuO4 by means of x-ray absorption spectra near Cu-K and La-L\nedges Phase Transitions 76 905–21\n[40] Poumellec B, Cortes R, Loisy E and Berthon J 1994 Polarization dependence of the V K edge in\nVO2 through the phase transition at 68 ◦ C Phys. Status. Solidi b 183 335–50\n[41] Wernet P, Nordlund D, Bergmann U, Cavarelli M, Odelius M, Ogasawara H, Näslund L A, Hirsch\nT K, Ojamäe L, Glatzel P, Pettersson L G M and Nilsson A 2004 The structure of the first\ncoordination shell in liquid water Science 304 995–9\n[42] Mannella N, Rosenhahn A, Watanabe M, Sell B, Nambu A, Ritchey S, Arenholz E, Young A,\nTomioka Y and Fadley C S 2005 Temperature-dependent x-ray absorption spectroscopy of\ncolossal magnetoresistive perovskites Phys. Rev. B 71 125117\n[43] Tsai Y T, Chang W J, Huang S W, Lin J Y, Lee J Y, Chen J M, Wu K H, Uen T M, Gou Y S\nand Juang J Y 2009 Temperature-dependent x-ray absorption near edge spectroscopy of doped\nLaMnO3 : Ion-size and the Jahn-Teller distortion effects Physica B: Condensed Matter 404 1404\n– 1408\n[44] Ohtaka K and Tanabe Y 1990 The soft-x-ray edge problem Rev. Mod. Phys. 62 929–91\n[45] Brouder C, Kappler J P and Beaurepaire E 1990 Theory and application of angle-resolved x-ray\nabsorption spectra in A Balerna, E Bernieri and S Mobilio, eds., 2nd European Conference on\nProgress in X-Ray Synchrotron Radiation Research vol. 25 of Conference Proceedings (Bologna:\nItalian Physical Society) pp. 19–22\n[46] Poumellec B, Cortes R, Tourillon G and Berthon J 1991 Angular dependence of the Ti K edge in\nrutile TiO2 Phys. Status. Solidi b 164 319–26\n[47] Joly Y, Cabaret D, Renevier H and Natoli C R 1999 Electron population analysis by full-potential\nx-ray absorption simulations Phys. Rev. Lett. 82 2398–401\n[48] Holmes O G and McClure D S 1957 Optical spectra of hydrated ions of the transition metals J.\nChem. Phys. 26 1686–1694\n[49] McClure D S 1959 Electronic spectra of molecules and ions in crystals. Part II. Spectra of ions in\ncrystals in H Ehrenreich and D Turnbull, eds., Solid State Physics vol. 9 (New York: Academic\nPress) pp. 399–525\n[50] Triest M, Davis M J and Reber C 1999 Absorption spectroscopy and time-dependent theoretical\ncalculation of the intervalence band of [FeII FeIII BPMP(OPr)2(BPh4 )2 , a localized mixed-valence\ncompound with a nonlinear metal-bridging ligand-metal core New J. Chem. 23 425–31\n\n\fTemperature dependence of pre-edge XAS peaks\n\n11\n\n[51] Lee C, Ghosez P and Gonze X 1994 Lattice dynamics and dielectric properties of incipient\nferroelectric TiO2 rutile Phys. Rev. B 50 13379–87\n[52] Traylor J G, Smith H G, Nicklow R M and Wilkinson M K 1971 Lattice dynamics of rutile Phys.\nRev. B 3 3457–72\n[53] Pisarev R V and Prokhorova S D 1969 The temperature dependence of optical absorption in the\nantiferromagnet KNiF3 Sov. Phys. Solid State 10 1668–72\n[54] Cieślak-Golonka M, Bartecki A and Sinha S P 1980 Vibrational fine structure in the electronic\nspectra of transition metal compounds. An experimental study Coord. Chem. Rev. 31 251–88\n[55] McDonald R G and Hitchman M A 1986 Electronic \"d-d\" spectra of the planar CuCl2−\nions in\n4\nbis(methadonium) tetrachlorocuprate(ii) and bis(creatinium) tetrachlorocuprate(ii): Analysis of\nthe temperature dependence and vibrational fine structure Inorg. Chem. 25 3273–81\n[56] Taran M N, Langer K, Platonov A N and Indutny V V 1994 Optical absorption investigation of\nCr3+ ion-bearing minerals in the temperature range 77-797k Phys. Chem. Minerals 21 360–72\n[57] Poiarkova A V and Rehr J J 1999 Multiple-scattering x-ray-absorption fine-structure Debye-Waller\nfactor calculations Phys. Rev. B 59 948–57\n[58] Chun W J, Ijima K, Ohminami Y, Suzuki S and Asakura K 2004 Theoretical Debye-Waller factors\nof α-MoO3 estimated by an equation-of-motion method J. Synchrotron Rad. 11 291–4\n[59] Vaccari M and Fornasini P 2005 Thermal effects on EXAFS: Ensemble averages and real-space\napproach Phys. Rev. B 72 092301\n[60] Dimakis N 2007 Ab initio calculation of XAFS Debye-Waller factors for crystalline materials in\nB Hedman and P Painetta, eds., AIP Conference Proceedings vol. 882 (AIP) pp. 126–8\n[61] Vila F D, Rehr J J, Rossner H H and Krappe H J 2007 Theoretical x-ray absorption Debye-Waller\nfactors Phys. Rev. B 76 014301\n[62] Natoli C R 1983 Near edge absorption structure in the framework of the multiple scattering model.\nPotential resonance or barrier effects? in EXAFS and Near Edge Structure vol. 27 of Springer\nSeries in Chemical Physics (Berlin: Springer-Verlag) pp. 43–56\n[63] Brouder C and Goulon J 1989 Influence of atomic displacements on XAFS Physica B 158 351–4\n[64] Brouder C 1992 Lie group calculation of the Green function of disordered systems in W H Butler,\nP H Dederichs, A Gonis and R L Weaver, eds., Applications of Multiple Scattering Theory to\nMaterials Science vol. 253 of Materials Research Society Symposium Proceedings (Pittsburgh:\nMaterials Research Society) pp. 411–6\n[65] Fujikawa T 1996 Debye-Waller and Condon factors in XAFS J. Elect. Spect. Relat. Phenom. 79\n25–28\n[66] Fujikawa T 1996 Theory of atomic displacement effects induced by core-hole production on EXAFS\nJ. Phys. Soc. Japan 65 87–94\n[67] Fujikawa T 1999 XAFS theory at zero and finite temperature J. Phys. Soc. Japan 68 2444–56\n[68] Arai H, Ueno N and Fujikawa T 2007 Theory of electron-phonon interaction in XAFS and other\nspectroscopies in B Hedman and P Painetta, eds., AIP Conference Proceedings vol. 882 (AIP)\npp. 108–10\n[69] Mäder K A and Baroni S 1997 Vibrational broadening of x-ray emission spectra: A first-principles\nstudy on diamond Phys. Rev. B 55 9649–58\n[70] Ankudinov A L and Rehr J J 2005 Nonspherical potential, vibronic and local field effects in x-ray\nabsorption Physica Scripta T115 24–7\n[71] Brouder C, Cabaret D, Juhin A and Sainctavit P, Effect of vibrations on the pre-edge features of\nx-ray absorption spectra to be published arXiv:0912.0792\n\n\f"}