{"id": "http://arxiv.org/abs/1203.5630v2", "guidislink": true, "updated": "2012-06-12T17:54:15Z", "updated_parsed": [2012, 6, 12, 17, 54, 15, 1, 164, 0], "published": "2012-03-26T11:05:42Z", "published_parsed": [2012, 3, 26, 11, 5, 42, 0, 86, 0], "title": "Non-Markovian Decoherent Quantum Walks", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1203.1007%2C1203.1388%2C1203.0369%2C1203.2830%2C1203.1221%2C1203.6064%2C1203.1182%2C1203.6138%2C1203.3143%2C1203.1455%2C1203.4283%2C1203.1529%2C1203.1344%2C1203.1132%2C1203.2967%2C1203.1545%2C1203.6240%2C1203.0110%2C1203.1843%2C1203.0729%2C1203.4717%2C1203.0326%2C1203.0458%2C1203.3723%2C1203.6591%2C1203.5987%2C1203.3569%2C1203.4879%2C1203.5903%2C1203.6146%2C1203.3306%2C1203.5590%2C1203.6348%2C1203.5630%2C1203.6473%2C1203.2241%2C1203.0114%2C1203.2319%2C1203.2107%2C1203.0401%2C1203.5538%2C1203.1508%2C1203.6675%2C1203.5383%2C1203.2292%2C1203.0740%2C1203.4441%2C1203.1207%2C1203.3419%2C1203.2871%2C1203.0288%2C1203.2730%2C1203.0973%2C1203.3670%2C1203.0172%2C1203.3721%2C1203.1728%2C1203.6409%2C1203.0231%2C1203.1016%2C1203.0374%2C1203.0934%2C1203.4085%2C1203.2428%2C1203.6490%2C1203.3559%2C1203.2720%2C1203.1564%2C1203.2651%2C1203.3619%2C1203.4935%2C1203.5025%2C1203.1513%2C1203.0564%2C1203.2584%2C1203.2121%2C1203.4237%2C1203.5425%2C1203.4086%2C1203.5513%2C1203.5854%2C1203.2480%2C1203.1820%2C1203.3982%2C1203.0297%2C1203.4353%2C1203.2686%2C1203.3249%2C1203.2164%2C1203.5046%2C1203.6107%2C1203.3054%2C1203.0069%2C1203.5535%2C1203.5883%2C1203.5139%2C1203.2110%2C1203.4073%2C1203.5776%2C1203.5121%2C1203.0328&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Non-Markovian Decoherent Quantum Walks"}, "summary": "Quantum walk acts obviously different from its classical counterpart, but\ndecoherence will lessen and close the gap between them. To understand this\nprocess, it is necessary to investigate the evolution of quantum walk under\ndifferent situation of decoherence. In this article, we study a non-Markovian\ndecoherent quantum walk on a line. In the short time regime, the behavior of\nthe walk deviates from both idea quantum walks and classical random walks. The\nposition variance as a measure of quantum walk starts oscillating from the\nfirst several steps and tends to be linear on time and showing a diffusive\nspread in the long time limit, which is caused by the non-Markovian dephasing\naffecting on quantum correlations between quantum walker and his coin. We also\nstudy both quantum discord and measurement-induced disturbance as measures of\nquantum correlations and observe that both of them oscillate in the short time\nregime and tend to be zero in the long time limit. Therefore quantum walk with\nnon-Markovian decoherence tends to diffusive spreading behavior in the long\ntime limit, while in the short time regime it oscillates between a ballistic\nand diffusive spreading behavior, and the quantum correlation collapses and\nrevivals due to the memory effect.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1203.1007%2C1203.1388%2C1203.0369%2C1203.2830%2C1203.1221%2C1203.6064%2C1203.1182%2C1203.6138%2C1203.3143%2C1203.1455%2C1203.4283%2C1203.1529%2C1203.1344%2C1203.1132%2C1203.2967%2C1203.1545%2C1203.6240%2C1203.0110%2C1203.1843%2C1203.0729%2C1203.4717%2C1203.0326%2C1203.0458%2C1203.3723%2C1203.6591%2C1203.5987%2C1203.3569%2C1203.4879%2C1203.5903%2C1203.6146%2C1203.3306%2C1203.5590%2C1203.6348%2C1203.5630%2C1203.6473%2C1203.2241%2C1203.0114%2C1203.2319%2C1203.2107%2C1203.0401%2C1203.5538%2C1203.1508%2C1203.6675%2C1203.5383%2C1203.2292%2C1203.0740%2C1203.4441%2C1203.1207%2C1203.3419%2C1203.2871%2C1203.0288%2C1203.2730%2C1203.0973%2C1203.3670%2C1203.0172%2C1203.3721%2C1203.1728%2C1203.6409%2C1203.0231%2C1203.1016%2C1203.0374%2C1203.0934%2C1203.4085%2C1203.2428%2C1203.6490%2C1203.3559%2C1203.2720%2C1203.1564%2C1203.2651%2C1203.3619%2C1203.4935%2C1203.5025%2C1203.1513%2C1203.0564%2C1203.2584%2C1203.2121%2C1203.4237%2C1203.5425%2C1203.4086%2C1203.5513%2C1203.5854%2C1203.2480%2C1203.1820%2C1203.3982%2C1203.0297%2C1203.4353%2C1203.2686%2C1203.3249%2C1203.2164%2C1203.5046%2C1203.6107%2C1203.3054%2C1203.0069%2C1203.5535%2C1203.5883%2C1203.5139%2C1203.2110%2C1203.4073%2C1203.5776%2C1203.5121%2C1203.0328&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Quantum walk acts obviously different from its classical counterpart, but\ndecoherence will lessen and close the gap between them. To understand this\nprocess, it is necessary to investigate the evolution of quantum walk under\ndifferent situation of decoherence. In this article, we study a non-Markovian\ndecoherent quantum walk on a line. In the short time regime, the behavior of\nthe walk deviates from both idea quantum walks and classical random walks. The\nposition variance as a measure of quantum walk starts oscillating from the\nfirst several steps and tends to be linear on time and showing a diffusive\nspread in the long time limit, which is caused by the non-Markovian dephasing\naffecting on quantum correlations between quantum walker and his coin. We also\nstudy both quantum discord and measurement-induced disturbance as measures of\nquantum correlations and observe that both of them oscillate in the short time\nregime and tend to be zero in the long time limit. Therefore quantum walk with\nnon-Markovian decoherence tends to diffusive spreading behavior in the long\ntime limit, while in the short time regime it oscillates between a ballistic\nand diffusive spreading behavior, and the quantum correlation collapses and\nrevivals due to the memory effect."}, "authors": ["Peng Xue", "Yongsheng Zhang"], "author_detail": {"name": "Yongsheng Zhang"}, "author": "Yongsheng Zhang", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1088/1674-1056/22/7/070302", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1203.5630v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1203.5630v2", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "12 pages, 5 figures, new figures and references added", "arxiv_primary_category": {"term": "quant-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "quant-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1203.5630v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1203.5630v2", "journal_reference": null, "doi": "10.1088/1674-1056/22/7/070302", "fulltext": "Non-Markovian Decoherent Quantum Walks\nPeng Xue1 and Yongsheng Zhang2\n\narXiv:1203.5630v2 [quant-ph] 12 Jun 2012\n\n2\n\n1\nDepartment of Physics, Southeast University, Nanjing 211189, China\nKey Laboratory of Quantum Information, University of Science and Technology of China, CAS, Hefei 230026, P. R. China\n(Dated: July 30, 2018)\n\nQuantum walk acts obviously different from its classical counterpart, but decoherence will lessen\nand close the gap between them. To understand this process, it is necessary to investigate the\nevolution of quantum walk under different situation of decoherence. In this article, we study a\nnon-Markovian decoherent quantum walk on a line. In the short time regime, the behavior of the\nwalk deviates from both idea quantum walks and classical random walks. The position variance as\na measure of quantum walk starts oscillating from the first several steps and tends to be linear on\ntime and showing a diffusive spread in the long time limit, which is caused by the non-Markovian\ndephasing affecting on quantum correlations between quantum walker and his coin. We also study\nboth quantum discord and measurement-induced disturbance as measures of quantum correlations\nand observe that both of them oscillate in the short time regime and tend to be zero in the long\ntime limit. Therefore quantum walk with non-Markovian decoherence tends to diffusive spreading\nbehavior in the long time limit, while in the short time regime it oscillates between a ballistic and\ndiffusive spreading behavior, and the quantum correlation collapses and revivals due to the memory\neffect.\nPACS numbers: 03.67.Mn, 03.65.Ta, 05.40.Fb, 03.67.Ac\n\nI.\n\nINTRODUCTION\n\nThe quantum walk (QW) as a generalization of the random walk (RW) is important in quantum algorithm research [1, 2] because of the exponentially speed up the hitting time in glued tree graphs [3]. QWs have been demonstrated using nuclear magnetic resonance [4], trapped ions [5], single photons in bulk [6] and fibre optics [7] and the\nscattering of light in waveguide arrays [8–10]. With decoherence the spreading of the QW is transited from a ballistic\nto diffusive scaling [11, 12] and with quantumness losing the QW is transited to RW [13, 14].\nAn open quantum system loses its quantumness when information of the quantum state leaks into the environment\naround it. The unidirectional flow of information in which the decoherence and noise act consistently characterizes\na Markovian process [15]. However, there are some systems such as soft- and condensed-matter systems strongly\ncoupling to the environment and the coupling leads to a different regime where information also flows back into the\nsystem from the surroundings, which characterizes a non-Markovian process [16]. During a Markovian process, the\ndistinguishability tends to monotonically decrease for pair of states, here in this paper, the quantum walker+coin\nstates [11–14]. Memory effects caused by the information flowing back to the system during a non-Markovian process\ncan temporarily increase it for the walker+coin states. In this paper, we use quantum correlation between quantum\nwalker and his coin as a distinguishability to present the behavior of a QW on a line with a non-Markovian dephasing\ncoin. The quantum correlation between quantum walker and his coin decays quickly but is interrupted by revivals.\nCorrespondingly, in the short time regime, the position variance of a non-Markovian decoherent QW deviates from\nboth those of the ideal QW and RW. In the long time limit, the quantum correlation tends to be zero and the position\nvariance shows a diffusive spread.\nThis paper is organized as follows: in the next section, we introduce an idea QW on a line. In Sec. III, the nonMarkovian dephasing on the coin state-two-level system is shown. We study the effects from the non-Markovian\ndephasing on coin. Compared to both idea QWs and RWs, non-Markovian decoherent QWs show different behavior\nin the short time regime. In Sec. IV, the quantum correlation between quantum walker and his non-Markovian\ndephasing coin is studied via the quantum discord (QD) and measurement-induced disturbance (MID). It is observed\nthat both of QD and MID show oscillating behavior in the short time regime and tend to zero in the long time limit.\nIn Sec. V, we analyze the behavior of non-Markovian decoherent QWs in the long time limit and observe that because\nof disappearance of the quantum correlation between quantum walker and his coin, a non-Markovian decoherent QW\nin the long time regime shows a diffusive behavior. Finally we summarize the paper briefly.\n\n\f2\nII.\n\nAN IDEAL QW ON A LINE\n\nFor an ideal QW on a line [17, 18], the Hilbert space is\nH = Hw ⊗ Hc\n\n(1)\n\nwith the walker Hilbert space Hw spanned by the position vectors {|xi} and Hc the coin space spanned by two\northogonal vectors which we denote |±1i. Each step by the walker is effected by two subsequent unitary operators:\nthe coin-flip operator\n\u0013\n\u0012\n1 1 1\n,\n(2)\nC =H = √\n2 1 −1\nfor H the Hadamard matrix and the conditional-translation operator\nF = S ⊗ |1i h1| + S † ⊗ |−1i h−1| ,\n\n(3)\n\nwhere S |xi = |x + 1i and S † |xi = |x − 1i. The resultant step operator is U = F (1 ⊗ C) with 1 the identity operator\non Hw .\nThe choice of initial state ψ(t = 0) is important in studies of QWs because the interference features sensitively\ndepend on the choice of state. This sensitivity is persistent because the dynamics are unitary hence do not die out.\nOn the other hand the general properties of QWs do not depend on the choice of initial state so the choice of initial\nstate is not crucial provided that the focus is on such characterization.\nAs we are interested in general properties, the initial state is not important so we choose the initial state with the\nwalker at the origin of a line and holding a coin in an equal superposition of the +1 and −1 states:\n1\nψ(t = 0) = √ |0i (|1i + i |−1i).\n2\n\n(4)\n\nAfter t steps, the final state of the walker+coin system is\n|ψ(t)i = U t |ψ(0)i .\n\n(5)\n\nWe now follow the evolution by performing a Fourier transform of the evolution operator to the \"momentum\" k space.\nThe eigenvectors\nX\n|ki =\neikx |xi ,\n(6)\nx\n\nof S and S † in Eq. (3) have the eigenrelations\nS |ki = e−ik |ki , S † |ki = eik |ki\nfor k a continuous real quantity. The inverse transformation is\nZ π\ndk −ikx\n|xi =\ne\n|ki .\n−π 2π\nThe walker is initialized at the origin of a line so the walker's initial state is\nZ π\ndk\n|ki .\n|0i =\n−π 2π\n\n(7)\n\n(8)\n\n(9)\n\nIn the {|ki} basis for the walker, the evolution operator becomes\nU |ki ⊗ |Φic = |ki ⊗ Uk |Φic ,\n\n(10)\n\nwith |Φic the coin state and\nUk =\n\n\u0012\n\n\u0013\ne−ik e−ik\n.\neik −eik\n\n(11)\n\n\fΚ\n\n3\n\n1\n0.75\n0.5\n0.25\n0\n-0.25\n-0.5\n-0.75\n0\n\n20\n\n40\n\n60\n\n80 100\n\nt\nFIG. 1: (Color online) The rate κ as a function of time t with g0 = 1 and different η: η = 0.01 in red, η = 0.05 in green, η = 0.1\nin blue presenting non-Markovian dephasing and η = 10 in black presenting Markovian dephasing.\n\nThe general density operator for the initial state of the system in the k basis can be expressed as\nZ π\nZ\ndk π dk ′\n|ki hk ′ | ⊗ |Φ0 i hΦ0 | .\nρ(0) =\n−π 2π −π 2π\n\n(12)\n\nThe final state after t steps is\n1\nρ(t) =\n(2π)2\n\nZ\n\nπ\n\n−π\n\ndk\n\nZ\n\nπ\n\n−π\n\ndk ′ |ki hk ′ | ⊗ Ukt |Φ0 i hΦ0 | (Uk† )t .\n\nIn terms of the superoperator Lkk′ Ô = Uk ÔUk† ,\nZ π\nZ π\n1\ndk\ndk ′ |ki hk ′ | ⊗ Ltkk′ |Φ0 i hΦ0 | .\nρ(t) =\n(2π)2 −π\n−π\n\n(13)\n\n(14)\n\nThe walker's position is on a line labeled x with the initial position localized at 0. Measurement of the walker's\nposition corresponds to the projection-valued measure {|xihx| ⊗ 1; x ∈ Z} on the walker reduced state (after tracing\nout the coin).\nThe probability P (x; t) that the walker will be found at the position x is\nP (x; t) = Tr {|xi hx| ⊗ 1c ρ(t)} ,\n\n(15)\n\nwhich is obtained by tracing over the coin of the walker+coin state and then measuring the walker's position. We can\ncharacterize P (x; t) by the moments of this position distribution hxm i. The mean hxi and variance\nvar = hx2 i − hxi2\n\n(16)\n\ncan be used as the measure of QWs and show the signature of QWs compared to RWs. Instead of variance we can\nalso use its square root, namely dispersion\np\n√\nσ = var = hx2 i − hxi2 .\n(17)\n√\nFor a RW, σ ∼ t, which is characteristic of diffusive motion, whereas, for a QW, a quadratic enhancement is\nachieved: σ ∼ t [11, 12, 17, 18].\nIII.\n\nA QW ON A LINE WITH A NON-MARKOVIAN DEPHASING COIN IN THE SHORT TIME\nREGIME\n\nWe now generalize to allow for decoherence. Open quantum system loses its quantumness when information about\nthe state leaks into its surroundings. Unidirectional flow of information characterizes a Markovian process [15].\n\n\f4\nWhereas, for a non-Markovian process [3], information also flows back into the system. Recently, though it is not\nwell understood yet, non-Markovian processes with memory have become of central importance in the study of open\nsystem for both theory [19–22] and experiments [23–28].\nSuppose that before each unitary flip of the coin, a completely positive map is performed on the coin. We consider\na pure dephasing quantum process for which the density matrix ρc (t) = Trw ρ(t) of the open system evolves according\nto the master equation\nd\nǫ(t)\nγ(t)\nρc (t) = −i\n[σz , ρc (t)] +\n[σz ρc (t)σz , ρc (t)] .\ndt\n2\n2\n\n(18)\n\nHere ǫ(t) represents the time-dependent energy shift and γ(t) the time-dependent rate of the decay channel described\nby the Pauli operator σz . The dephasing process influences the coherence between the walker and his coin and the\nevolution can be described by the time-dependent function\n\u001a Z t\n\u001b\nκ(t) = exp −\ndt′ [γ(t′ ) + iǫ(t′ )]\n(19)\n0\n\nwhich is connected to the energy shift and the decay rate of the master equation (18) by the relations\n\u0015\n\u0014\n\u0015\n\u0014\nκ̇(t)\nκ̇(t)\n, γ(t) = −Re\n.\nǫ(t) = −Im\nκ(t)\nκ(t)\n\n(20)\n\nIf the relaxation rates are positive function γ(t) ≥ 0, the generator in Eq. (18) is in Lindblad form for each fixed\nt ≥ 0. Such a process with γ(t) ≥ 0 may be called time-dependent Markovian. The generalized master equation\ninvolving a certain memory kernel can describe a non-Markovian process, in which the rate γ(t) must take on negative\nvalues for some interval of time. In the Markovian regime, information of the coin state leaks into its surroundings and\n|κ(t)| is a monotonically decreasing function of time. In the non-Markovian environment, in contrast, information also\nflows back into the system of coin state and a revival of the distinguishability can be observed in the time evolution.\nWith the definition of non-Markovianity, we see that an increase of |κ(t)| leads to a negative rate γ(t) in the generator\nof the master equation (18). As an example, we consider the case of a Lorentzian reservoir spectral density which\nis on resonance with the coin qubit transition frequency and leads to an exponential two point correlation function\nf (t) = g0 ηe−η|t| /2, where g0 describes the coupling strength between the coin qubit and environment and η denotes\nthe spectral width (here we consider the coin qubit coupled to a damped Jaynes-Cummings model). The rate κ (t) is\ndefined as the solution of the integrodifferential equation,\nZ t\nd\nκ (t) = −\ndt′ f (t − t′ ) κ (t′ )\n(21)\ndt\n0\ncorresponding to an initial condition κ (0) = 1. We obtain\n\u0014\n\u0012 \u0013\n\u0012 \u0013\u0015\ndt\nη\ndt\n−ηt/2\ncosh\nκ (t) = e\n+ sinh\n,\n(22)\n2\nd\n2\np\nwhere d = η 2 − 2g0 η. We see that for weak couplings, g0 < η/2, |κ (t) | decreases monotonically. The correlation\nfunction f (t) tends to δ(t) with η increasing. For η → ∞, f (t) = δ(t) and the noise of different time is not correlated.\nWhereas, in the strong coupling regime g0 > η/2, d turns to be a complex number and |κ (t) | can be rewritten as\n\u0014\n\u0012 ′ \u0013\n\u0012 ′ \u0013\u0015\ndt\nη\ndt\n−ηt/2\ncos\nκ (t) = e\n+ ′ sin\n(23)\n2\nd\n2\nwith d′ = Im {d} and starts to oscillate, showing non-Markovian behavior [19–28].\nThe plots of κ(t) are shown in Fig. 1. In the Markovian regime, for example g0 = 1 and η = 10, the flow of\ninformation goes only from the system into the environment, and κ(t) decreases monotonically. In the non-Markovian\nregime, such as g0 = 1, and η = 0.01, 0.05, 0.1 respectively, memory effects however can temporarily increase it. The\nfunction κ(t) decreases faster at t = 0 but will be interrupted by revivals which are due to memory effects on quantum\ncorrelations between the quantum walker and his coin.\nThe corresponding dynamical map which maps the coin state ρc (0) to the state ρc (t) at time t\n00 01\n∗\n01 10\n10 11\n11\nρ00\nc = ρc , ρc = κ (t)ρc , ρc = κ(t)ρc , ρc = ρc .\n\n(24)\n\n\f5\nThis map can also be written by a set of operators {A1 , A2 } on the coin degree of freedom which satisfy\nX\nA†n An = 1,\n\n(25)\n\nn=1,2\n\nwhere\n\u0010\n\n\u0011\np\n1 − |κ(t)|2 |κ(t)|\n|κ(t)|\n|0i h0| + r\nA1 =\n\u0010\n\u0011 |1i h1| ,\n\u0011\n\u0010\np\n2\np\n2\n2\n∗\n2\n2\n|κ(t)| + 1 − 1 − |κ(t)|\nκ (t) |κ(t)| + 1 − 1 − |κ(t)|\n\u0010\n\u0011\np\n2 |κ(t)|\n1\n−\n1\n−\n|κ(t)|\n|κ(t)|\nr\nA2 = r\n\u0011 |0i h0| +\n\u0010\n\u0010\n\u00112 |1i h1| .\np\np\n2\n2\n2\n2\n|κ(t)| + 1 − 1 − |κ(t)|\nκ(t) |κ(t)| + 1 − 1 − |κ(t)|\n1−\nr\n\n(26)\n\nConsidering the initial state is\nρ(0) =\n\nZ\n\nπ\n\n−π\n\ndk\n2π\n\nZ\n\nπ\n\n−π\n\ndk ′\n|ki hk ′ | ⊗ |Φ0 i hΦ0 | .\n2π\n\nLet the QW proceed for t steps. Then the state evolves to\nZ π\nZ\nX\ndk π dk ′\nρ (t) =\nUk Ant * * * *Uk An1 |Φ0 i hΦ0 | A†n1 Uk† * * * A†nt Uk†\n|ki hk ′ | ⊗\n−π 2π −π 2π\nn1 ,...,nt\nZ\nZ π\ndk π dk ′\n|ki hk ′ | ⊗ Ltkk′ |Φ0 i hΦ0 | .\n=\n−π 2π −π 2π\nNote that for k = k ′ this superoperator preserves the trace. This implies that\n\u0010\n\u0011\n\u0010 \u0011\nTr Ltkk Ô = Tr Ô\n\n(27)\n\n(28)\n\n(29)\n\nfor any operator Ô.\nNow we consider the effect of the non-Markovian dephasing on coin. As we know, without decoherence the variance\nof position distribution of QW is quadratically dependent on time t. With Markovian dephasing on coin, in the\nlong time limit the transition from a ballistic to a diffusion spreading behavior is observed. In this paper, we will\nshow the behavior of a QW with non-Markovian dephasing coin. The variance is used as a signature of the QW\ncompared to RW. In the short time regime we can calculate the variance of position distribution numerically. In\nFig. 2 from the numerical results we can see the variance as a function of time starts to oscillate from the first several\nsteps and the period of oscillations depends on the coefficient d. Compared to that of ideal QW, in the short time\nregime (t . 100) the variance of the QW with non-Markovian dephasing coin deviates from a ballistic spreading\nbehavior. However, in comparison with RW, the oscillating variance neither shows a diffusion behavior, which is\ndue to effect on quantum correlations between quantum walker and his coin from the non-Markovian decoherence.\nFrom the numerical calculations the position variance of a RW distribution is the lower bound of that of QW with\nnon-Markovian dephasing coin.\nIn Fig. 3, we plot position distribution for a QW with a non-Markovian dephasing coin (g0 = 1 and η = 0.01) at\nthe 38th, 42nd, 46th, and 50th steps. At the 38th step, the position distribution shows RW behavior, and at the 42nd\nand 46th steps, there are two small peaks higher than the others nearby in the position distribution. It shows the\nmemory effect from non-Markovian decoherence draws QW behavior back a little. The small peaks disappear at the\n50th step. The plots of position distribution show the behavior of QW with non-Markovian dephasing coin oscillates\nbetween the quantum (ballistic) and classical (diffusive) behaviors.\nIV.\n\nQUANTUM CORRELATIONS DYNAMICS IN NON-MARKOVIAN ENVIRONMENT\n\nThe signature of a decoherent discrete-time QW on a line can be demonstrated in various ways such as the position\nprobability distribution becoming increasingly Gasussian, with a concomitant fall in the standard deviation. Both of\nthem do not recover the correlations between the quantum walker and his coin, which is known as the reason causing\n\n\fvar\n\n6\n\n3000\n2500\n2000\n1500\n1000\n500\n0\n0\n\n20\n\n40\n\n60\n\n80 100\n\n60\n\n80 100\n\nt\n\n200\nvar\n\n150\n100\n50\n0\n0\n\n20\n\n40\nt\n\nFIG. 2: (Color online) The variances for a QW on a line after t = 100 steps with a perfect coin in dotted-line, with a nonMarkovian dephasing coin with parameters\ng0 = 1 and η = 0.01 in red and η = 0.05 in green, η = 0.1 in blue and η = 10 in\n√\nblack. Here we choose (|0i + i |1i) / 2 as an initial coin state for calculations. (a) Comparison of variances between the RW\nand QW with a non-Markovian dephasing coin with parameters g0 = 1 and η = 0.01. (b) Comparison of variances between\nthe QW with a non-Markovian dephasing coin with g0 = 1 and η = 0.01, η = 0.05, η = 0.1 and η = 10.\n\nthe quantum behavior of QWs. In this section we study the quantum correlation of a decoherent QW by two popular\nmeasures, measurement-induced disturbance (MID) [29–31] and quantum discord (QD) [32, 33].\nGiven the walker+coin state ρ(t), let the density matrix for the system be diagonalized to\nX j j\npi Πi ,\n(30)\nρi =\nj\n\nfor i = w, c, where {Πji } is a complete projection-valued measure (i.e. using von Neumann measurements) for walker w\nor coin c. Summing over joint projections on the state yields the diagonalized state\nX\nΠρ(t) =\n(31)\n1w ⊗ Πkc ρ(t)1w ⊗ Πkc .\nk\n\nThe leftmost Π is an operator on the density matrix that diagonalizes it in the spectral basis corresponding to Πji\nprojective measurements. The operator Π can also be described as a 'local measurement strategy'.\nCorrelations between the walker ρw and coin state ρc are regarded as classical if there is a unique local measurement\nstrategy Π leaving Πρ(t) unaltered from the original walker+coin state ρ(t) [29–31]. We ascertain whether the\nwalker+coin state is 'quantum' by determining whether a local measurement strategy exists that leaves the state\nunchanged.\nThe degree of quantumness is given by the MID [29–31]\nQ [ρ(t)] = I [ρ(t)] − I [Πρ(t)] ,\n\n(32)\n\nfor I [ρ(t)] = S [ρw (t)] + S [ρc (t)] − [ρ(t)] the quantum mutual information and S [ρ(t)] = −Tr [ρ(t) log2 ρ(t)] denotes\nvon Neumann entropy. By construction Πρ(t) is classical. Thus, the MID is the difference between the quantum and\n\n\f0.1\n0.08\n0.06\n0.04\n0.02\n0\n\n0.08\n0.06\nP\n\nP\n\n7\n\n0.04\n0.02\n0\n0\n\n0.08\n\n0.08\n\n0.06\n\n0.06\nP\n\nP\n\n0 10 20 30 40 50 60 70\nt\n\n0.04\n0.02\n\n20\n\n40\nt\n\n60\n\n80\n\n0.04\n0.02\n\n0\n\n0\n0\n\n20\n\n40\n\n60\n\n80\n\n0\n\nt\n\n20\n\n40\n\n60\n\n80\n\n100\n\nt\n\nFIG. 3: (Color online) The position distribution for a QW on a line with a non-Markovian dephasing coin with parameters\ng0 = 1 and η = 0.01 at the 38th step (a), the 42nd step (b), the 46th step (c) and the 50th step (d).\n\nclassical mutual information, which quantify total and classical correlations. Accordingly, Eq. (32) is interpreted as\nthe difference between the total and classical correlations, which are represented by the quantum mutual information\nand the mutual information.\nQD [32, 33] is defined by\nD [ρ(t)] = I [ρ(t)] − sup I [Πρ(t)] .\n\n(33)\n\nΠ\n\nThe MID has an operational definition, unlike QD, it also tends to overestimate non-classicality because of lack of\noptimization over local measurements. Applied to QWs, we find that MID, while acting as a loose upper bound on\nQD, still tends to reflect well trends in the behavior of the latter.\nWe numerically calculate the MID and QD for a QW with perfect, Markovian and non-Markovian dephasing coins\nin the short time regime. The quantum correlation between quantum walker and his coin presented by the MID\nand QD is oscillating for the first several steps (. 100) shown in Fig. 4(a) and (b). Without decoherence there is\nno difference between MID and QD. Memory effects caused by the non-Markovianity of the environment deviate the\nMID and QD from monotonically behavior as that during the Markovian process. Both MID and QD decay steeply\nand interrupted by revivals. The period of oscillating is as same as that of corresponding position variance, which\nproves that quantum correlation between quantum walker and his coin results in the behavior of the QW. Either of\nthe MID and QD tends to zero with time increasing. Whereas for ideal QWs, both MID and QD do not decrease with\ntime as shown in [34, 35]. From the numerical results one can see the quantum correlation in the case of Markovian\ndecoherence is the lower bound of that with Non-Markovian decoherence, which explains the reason that the position\nvariance of a RW distribution provides the lower bound of that of QW with non-Markovian dephasing coin. In\ncomparison of MID and QD shown in Fig. 4(c), both of them can show the quantum correlation between quantum\nwalker and his coin changing with time and MID oscillates with bigger amplitude than QD, which makes that the\nMID might be better signature for observing in this case.\n\n\fMID\n\n8\n\n1\n0.8\n0.6\n0.4\n0.2\n0\n0\n\n20\n\n40\n\n60\n\n80 100\n\n60\n\n80 100\n\nQD\n\nt\n1\n0.8\n0.6\n0.4\n0.2\n0\n0\n\n20\n\n40\nt\n\n1\n0.8\n0.6\n0.4\n0.2\n0\n0\n\n20\n\n40\n\n60\n\n80 100\n\nt\nFIG. 4: (Color online) (a) The MID, (b) QD for a QW on a line after t = 100 steps with perfect (in black), non-Markovian\ndephasing coin (in red) and Markovian dephasing coin (in blue), respectively. Here we choose the parameters g0 = 1, η = 0.01\nand η = 10 respectively for calculations. (c) The comparison of MID in red and QD in green for a QW on a line with the same\nparameters above.\n\nV.\n\nA QW ON A LINE WITH A NON-MARKOVIAN DEPHASING COIN IN THE LONG TIME LIMIT\n\nIn the above sections we show the behavior of QW on a line with a non-Markovian dephasing coin results in the\nquantum correlation between quantum walker and his coin, which is presented by the MID and QD. We observe that\nboth MID and QD decrease with time and tend to zero in the long time limit. That means the quantum correlation will\ndisappear for long enough time. In this section, we will show in the long time regime, the behavior of a non-Markovian\ndecoherent QW.\n\n\f9\nThe probability for the walker to reach a point x at time t is\nP (x; t) = Tr{|xi hx| ρ(t)}\nZ π\nZ π\n′\n1\n=\ndk\ndk ′ e−i(k−k )x Tr{Ltkk′ |Φ0 i hΦ0 |}.\n(2π)2 −π\n−π\n\n(34)\n\nThus we can calculate the moments of this distribution:\nX\nhxm i =\nxm P (x; t)\nx\n\n(−1)m\n=\n(2π)2\n\nZ\n\nπ\n\ndk\n\n−π\n\nZ\n\nπ\n\n−π\n\ndk ′ δ (m) (k − k ′ )Tr{Ltkk′ |Φ0 i hΦ0 |}.\n\n(35)\n\nWe can then invert the order of operations and do the x sum first. This sum can exactly be carried out in terms of\nderivatives of the δ function:\n1 X m −ix(k−k′ )\nx e\n= (−i)m δ (m) (k − k ′ ).\n(36)\n2π x\nInserting this result back into the expression for hxi we get the first moment\nZ\n−i π\nd\nhxi =\ndk Tr{Ltk |Φ0 i hΦ0 |}\n2π −π dk\nZ π\nt\nX\n1\n=−\nTr{σz Ljk |Φ0 i hΦ0 |}.\ndk\n2π −π\nj=1\nWe can carry out a similar integration by parts to get the second moment:\n\n\nZ π\nj−1\nj\nt X\nt X\nX\nio\nn\nh ′\nn\no X\n′\n′\n′\n1\nj−j\nj\nj−j\nj\nhx2 i = −\n.\nTr σz Lkj\n(Lk |Φ0 i hΦ0 |)σz\nTr σz Lk (σz Lk |Φ0 i hΦ0 |) +\ndk\n\n\n2π −π\n′\n′\n\n(37)\n\n(38)\n\nj=1 j =1\n\nj=1 j =1\n\nBecause Lk is a linear transformation we can represent it as a matrix acting on the space of 2 × 2 operators. We\nchoose the representation as\nÔ = r1 1 + r2 σx + r3 σy + r4 σz .\nThe action of Lk on Ô is given by the matrix\n \n\nr1\n1\n0\n0\n0\nsin 2kRe [κ(t)] cos 2k  r2 \n0 sin 2kIm [κ(t)]\nLk Ô = \n0 − cos 2kIm [κ(t)] − cos 2kRe [κ(t)] sin 2k  r3 \nr4\n0\nRe [κ(t)]\n−Im [κ(t)]\n0\n\u0010 \u0011\n\u0011\n\u0010\nBecause r1 = Tr Ô = Tr Lk Ô . The only nontrivial dynamics results from the 3 × 3 submatrix\n\n0\n0\n0\nsin 2kRe [κ(t)] cos 2k \n sin 2kIm [κ(t)]\nMk = \n− cos 2kIm [κ(t)] − cos 2kRe [κ(t)] sin 2k \nRe [κ(t)]\n−Im [κ(t)]\n0\n\n\nWe also need to know the effects of left and\n\n0\n0\nZL = \n0\n1\n\nright multiplying by σz .\n\n\n0 0\n0 0 1\n0 i 0\n0 0\n,Z =\n−i 0 0 R 0 i\n1 0\n0 0 0\n\nThese are given by the two matrices\n\n0 1\n−i 0\n.\n0 0\n0 0\n\n(39)\n\n(40)\n\n(41)\n\n(42)\n\nLet us take these expressions and apply them to Eq. (37) for the first moment. In the integrand, the initial density\nmatrix for the coin is multiplied j times by Lk , then left multiplied by σz and finally the trace is taken. Given the\n\n\f10\nabove expression for ZL , we see that this is the same as multiplying the 3-vector (r2 , r3 , r4 ) j times by Mk and then\nkeeping only the r4 component of the result. This gives us the new expression for the first moment\n\n \nZ π\nt\nr2\n\u0001 X\n1\nhxi = −\nMkj  r3 \n(43)\ndk 0 0 1 \n2π −π\nr4\nj=1\n \nZ π\ni r2\n\u0001h\n\u0001\n1\n−1\nMk − Mkt+1 r3  .\n(44)\ndk 0 0 1 (1 − Mk )\n=−\n2π −π\nr\n4\n\nThe eignevalues of Mk satisfy 0 < |λ| < 1 and then in the long time limit, therefore Mkt+1 → 0 and the first moment\nbecomes approximately\n \nZ π\ni r2\n\u0001h\n1\n−1\nhxi ≈ −\ndk 0 0 1 (1 − Mk ) Mk r3 \n(45)\n2π −π\nr\n4\n\n2\n\n=\n\nr2 Re [κ(t)] − r3 Im [κ(t)] + r4 |κ(t)|\n.\n−1 + |κ(t)|2\n\n(46)\n\nIn the long time limit, the second moment can also be calculated as\n1\n\u0001\n′\n′\n1\nr \ndk 1 0 0 0 ZL\nLj−j\n(ZL + ZR ) Ljk   2 \nhx2 i = t −\nk\nr3\n2π −π\nj=1 j ′ =1\nr4\n \nZ π\nj−1\nt X\n0\nX\n\u0001\n′\n1\ndk 0 0 1 Mkj−j 0\n=t−\n2π −π\n2\nj=1 j ′ =1\nZ\n\nπ\n\n\n\nj−1\nt X\nX\n\n \n0\nh\ni\n\u0001\n1\n−1\n−1\n−1\n=t−\ndk 0 0 1 t − (1 − Mk ) Mk + (1 − Mk ) Mkt (1 − Mk ) Mk 0\n2π −π\n2\n\u0013\n\u0012\n4\n2\n2\n2|κ(t)| + 5|κ(t)|\n2|κ(t)|\n+\n,\n=t 1+\n2\n−1 + |κ(t)|\n(−1 + |κ(t)|2 )2\nZ\n\nπ\n\nwhich is independent on the initial coin state.\nThe position variance is obtained as\n\u0012\n\u0013\n2|κ(t)|2\nr2 Re [κ(t)] − r3 Im [κ(t)] + r4 |κ(t)|2\n2|κ(t)|4 + 5|κ(t)|2\n2\n2\nvar = hx i − hxi = t 1 +\n−\n+\n.\n2\n−1 + |κ(t)|2\n−1 + |κ(t)|2\n(−1 + |κ(t)|2 )\n\n(47)\n\n(48)\n\nIn the long time regime, κ(t) (22) tends to zero. Then the position variance is linear dependent on time t. Thus in\nthe case of the non-Markovian dephasing coin the variance grows linearly with time and a QW with a non-Markovian\ndephasing coin shows a diffusive spread in the long time limit.\nIn the long time limit, we can obtain the analytical results of the position variance of a non-Markovian decoherent\nQW. In Fig. 5, we can see that for the first several steps, the numerical and analytical results agree with each other.\nWhereas for long time, the variance becomes linear dependent on time t showing a diffusive spread, just as in the\nclassical case, though the rate of growth will greater than for the RW.\nVI.\n\nCONCLUSION\n\nIn this paper, we presented how non-Markovian decoherence can influence the evolution of a quantum walker on a\nline and showed a different behavior compared to the ballistic and diffusive spreads. We analyze the dynamics and\nquantum correlation of quantum walker and his coin. We use the MID and QD as measures for quantum correlations.\nThe QD would be a valuable measure to use and the MID also suffices to show that pure quantum correlation induced\nby having non-Markovian dephasing on the coin state. The memory effect caused by the information flowing back\nto the system during a non-Markovian process decreases the quantum correlation quickly which is later interrupted\n\n\fvar\n\n11\n\n1000\n800\n600\n400\n200\n0\n0\n\n200 400 600 800 1000\nt\n\nFIG. 5: The analytical result on the variance of position distribution for a QW on a line with a non-Markovian dephasing coin\nin the long time regime. Here we choose the parameters g0 = 1 and η = 0.01 for calculations.\n\nby revivals. In the long time limit, the quantum correlation disappears with κ(t) tending to zero, which results\nin a transition from a QW with a ballistic scaling to a RW with a diffusive scaling. We draw the conclusions as\nfollowings: in the short time the behavior of QW with non-Markovian dephasing coin oscillates between a ballistic\nand diffusive spreading behavior, and the quantum correlation between the walker and coin collapses and revivals due\nto the memory effect. Whereas in the long time limit, QW with non-Markovian decoherence does not make much\ndifference from that with Markovian decoherence. Thus our analysis is quite valuable in that we characterize this QW\non a line with non-Markovian dephasing coin carefully and devise appropriate, meaningful QD and MID as measures\nto study quantum correlation dynamics for this system.\nAcknowledgments\n\nWe would like to thank Barry C. Sanders for useful conversations. This work has been supported by the National\nNatural Science Foundation of China under Grant Nos 10974192, 11004029 and 11174052, the Natural Science Foundation of Jiangsu Province under Grant No BK2010422, the Ph.D. Program of the Ministry of Education of China, the\nExcellent Young Teachers Program of Southeast University and the National Basic Research Development Program\nof China (973 Program) under Grant No 2011CB921203.\n\n[1] D. Aharonov, A. Ambainis, J. Kempe and U. Vazirani, in Proceedings of the 33rd ACM Symposium on the Theory of\nComputing (ACM, Washington, DC, 2001), p. 50.\n[2] V. Kendon, Math. Struct. in Comp. Science 17, 1 (2007).\n[3] A. M. Childs, R. Cleve, E. Deotto, E. Farhi, S. Gutmann and D. A. Spielman, in Proceedings of the 35th ACM Symposium\non the Theory of Computing (ACM, Washington, DC, 2003), p. 59.\n[4] C. A. Ryan, M. Laforest, J. C. Boilequ and R. Laflamme, Phys. Rev. A 72, 062317 (2005); J. Du, H. Li, X. Xu, M. Shi,\nJ. Wu, X. Zhou and R. Han, Phys. Rev. A 67, 042316 (2003).\n[5] F. Zähringer, G. Kirchmair, R. Gerritsma, E. Solano, R. Blatt and C. F. Roos, Phys. Rev. Lett. 104, 100503 (2010).\n[6] B. Do, M. Stohler, S. Balasubramanian and D. Elliott, Journal of Optical Society of America (B) 22, 499 (2005).\n[7] A. Schreiber, K. N. Cassemiro, V. Potoček, A. Gábris, P. J. Mosley, E. Andersson, I. Jex and C. Silberhorn, Phys. Rev.\nLett. 104, 050502 (2010).\n[8] M. A. Broome et al., Phys. Rev. Lett. 104, 153602 (2010).\n[9] A. Schreiber et al., Phys. Rev. Lett. 106, 180403 (2011).\n[10] H. B. Perets, Y. Lahini, F. Pozzi, M. Sorel, R. Morandotti and Y. Silberberg, Phys. Rev. Lett. 100, 170506 (2008).\n[11] T. Brun, H. A. Carteret and A. Ambainis, Phys. Rev. Lett. 91, 130602 (2003).\n[12] T. Brun, H. A. Carteret and A. Ambainis, Phys. Rev. A 67, 052317 (2003).\n[13] P. Xue, B. C. Sanders, A. Blais and K. Lalumiére, Phys. Rev. A 78, 042334 (2008).\n[14] P. Xue, B. C. Sanders and D. Leibfried, Phys. Rev. Lett. 103, 183602 (2009).\n[15] H. J. Carmichael, An Open Systems Approach to Quantum Optics, Lecture Notes in Physics, Vol. m18 (Springer-Verlag,\nBerlin, 1993).\n\n\f12\n[16]\n[17]\n[18]\n[19]\n[20]\n[21]\n[22]\n[23]\n[24]\n[25]\n[26]\n[27]\n[28]\n[29]\n[30]\n[31]\n[32]\n[33]\n[34]\n[35]\n\nU. Weiss, Quantum Dissipative Systems (World Scientific, Singapore, 2001).\nJ. Kempe, Contemp. Phys. 44, 307 (2003).\nN. Shenvi, J. Kempe and K. B. Whaley, Phys. Rev. A 67, 052307 (2003).\nM. M. Wolf, J. Eisert, T. S. Cubitt, J. I. Cirac, Phys. Rev. Lett. 101, 150402 (2008).\nA. Rivas, S. F. Huelga and M. B. Plenio, Phys. Rev. Lett. 105, 050403 (2010).\nE. Laine, J. Piilo and H. Breuer, Phys. Rev. A 81, 062115 (2010).\nH. Breuer, E. Laine and J. Piilo, Phys. Rev. Lett. 103, 210401 (2009).\nJ. M. Raimond, M. Brune and S. Haroche, Phys. Rev. Lett. 79, 1964 (1997).\nT. Meunier, S. Gleyzes, P. Maioli, A. Auffeves, G. Nogues, M. Brune, J. M. Raimond and S. Haroche, Phys. Rev. Lett.\n94, 010401 (2005).\nJ. S. Xu, C. F. Li, M. Gong, X. B. Zou, C. H. Shi, G. Chen and G. C. Guo, Phys. Rev. Lett. 104, 100502 (2010).\nJ. S. Xu, C. F. Li, C. J. Zhang, X. Y. Xu, Y. S. Zhang and G. C. Guo, Phys. Rev. A 82, 042328 (2010).\nJ. S. Tang, C. F. Li, Y. L. Li, X. B. Zou, G. C. Guo, H. Breuer, E. Laine and J. Piilo, Europhysics Letters 97, 10002\n(2012).\nB. H. Liu, L. Li, Y. F. Huang, C. F. Li, G. C. Guo, E. Laine, H. Breuer and J. Piilo, Nat. Phys. 7, 931 (2011).\nS. Luo, Phys. Rev. A 77, 022301 (2008).\nN. Li and S. Luo, Phys. Rev. A 76, 032327 (2007).\nS. Luo, Phys. Rev. A 77, 042303 (2008).\nH. Ollivier and W. H. Zurek, Phys. Rev. Lett. 88, 017901 (2001).\nL. Henderson and V. Vedral, J. Phys. A 34, 6899 (2001).\nR. Srikanth, S. Banerjee and C. M. Chandrashekar, Phys. Rev. A 81, 062123 (2010).\nB. R. Rao, R. Srikanth, C. M. Chandrashekar and S. Banerjee, Phys. Rev. A 83, 064302 (2011).\n\n\f"}