{"id": "http://arxiv.org/abs/0809.4059v2", "guidislink": true, "updated": "2008-10-07T17:02:58Z", "updated_parsed": [2008, 10, 7, 17, 2, 58, 1, 281, 0], "published": "2008-09-24T00:34:13Z", "published_parsed": [2008, 9, 24, 0, 34, 13, 2, 268, 0], "title": "Information transmission in oscillatory neural activity", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0809.3090%2C0809.2452%2C0809.0798%2C0809.2210%2C0809.3073%2C0809.4245%2C0809.4761%2C0809.4682%2C0809.5047%2C0809.2024%2C0809.4501%2C0809.4702%2C0809.4481%2C0809.1823%2C0809.4849%2C0809.2563%2C0809.0574%2C0809.4207%2C0809.0819%2C0809.2823%2C0809.4556%2C0809.2647%2C0809.3172%2C0809.1297%2C0809.4059%2C0809.2752%2C0809.1181%2C0809.4911%2C0809.3950%2C0809.3216%2C0809.1462%2C0809.2770%2C0809.2707%2C0809.0043%2C0809.3007%2C0809.1267%2C0809.0217%2C0809.0638%2C0809.1568%2C0809.3475%2C0809.1648%2C0809.2451%2C0809.5255%2C0809.4165%2C0809.5112%2C0809.4343%2C0809.3387%2C0809.4905%2C0809.0035%2C0809.4298%2C0809.3236%2C0809.0324%2C0809.2546%2C0809.3147%2C0809.5083%2C0809.0389%2C0809.0777%2C0809.0165%2C0809.1845%2C0809.1326%2C0809.4435%2C0809.5075%2C0809.4194%2C0809.4412%2C0809.0662%2C0809.0255%2C0809.4074%2C0809.4827%2C0809.0293%2C0809.0387%2C0809.0993%2C0809.4789%2C0809.3107%2C0809.3335%2C0809.4845%2C0809.3854%2C0809.4016%2C0809.0880%2C0809.4596%2C0809.0924%2C0809.1704%2C0809.0234%2C0809.4448%2C0809.3221%2C0809.4904%2C0809.0079%2C0809.1191%2C0809.0842%2C0809.0111%2C0809.0378%2C0809.0570%2C0809.3888%2C0809.4389%2C0809.2178%2C0809.0334%2C0809.0754%2C0809.1151%2C0809.3251%2C0809.1228%2C0809.4891%2C0809.4807&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Information transmission in oscillatory neural activity"}, "summary": "Periodic neural activity not locked to the stimulus or to motor responses is\nusually ignored. Here, we present new tools for modeling and quantifying the\ninformation transmission based on periodic neural activity that occurs with\nquasi-random phase relative to the stimulus. We propose a model to reproduce\ncharacteristic features of oscillatory spike trains, such as histograms of\ninter-spike intervals and phase locking of spikes to an oscillatory influence.\nThe proposed model is based on an inhomogeneous Gamma process governed by a\ndensity function that is a product of the usual stimulus-dependent rate and a\nquasi-periodic function. Further, we present an analysis method generalizing\nthe direct method (Rieke et al, 1999; Brenner et al, 2000) to assess the\ninformation content in such data. We demonstrate these tools on recordings from\nrelay cells in the lateral geniculate nucleus of the cat.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0809.3090%2C0809.2452%2C0809.0798%2C0809.2210%2C0809.3073%2C0809.4245%2C0809.4761%2C0809.4682%2C0809.5047%2C0809.2024%2C0809.4501%2C0809.4702%2C0809.4481%2C0809.1823%2C0809.4849%2C0809.2563%2C0809.0574%2C0809.4207%2C0809.0819%2C0809.2823%2C0809.4556%2C0809.2647%2C0809.3172%2C0809.1297%2C0809.4059%2C0809.2752%2C0809.1181%2C0809.4911%2C0809.3950%2C0809.3216%2C0809.1462%2C0809.2770%2C0809.2707%2C0809.0043%2C0809.3007%2C0809.1267%2C0809.0217%2C0809.0638%2C0809.1568%2C0809.3475%2C0809.1648%2C0809.2451%2C0809.5255%2C0809.4165%2C0809.5112%2C0809.4343%2C0809.3387%2C0809.4905%2C0809.0035%2C0809.4298%2C0809.3236%2C0809.0324%2C0809.2546%2C0809.3147%2C0809.5083%2C0809.0389%2C0809.0777%2C0809.0165%2C0809.1845%2C0809.1326%2C0809.4435%2C0809.5075%2C0809.4194%2C0809.4412%2C0809.0662%2C0809.0255%2C0809.4074%2C0809.4827%2C0809.0293%2C0809.0387%2C0809.0993%2C0809.4789%2C0809.3107%2C0809.3335%2C0809.4845%2C0809.3854%2C0809.4016%2C0809.0880%2C0809.4596%2C0809.0924%2C0809.1704%2C0809.0234%2C0809.4448%2C0809.3221%2C0809.4904%2C0809.0079%2C0809.1191%2C0809.0842%2C0809.0111%2C0809.0378%2C0809.0570%2C0809.3888%2C0809.4389%2C0809.2178%2C0809.0334%2C0809.0754%2C0809.1151%2C0809.3251%2C0809.1228%2C0809.4891%2C0809.4807&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Periodic neural activity not locked to the stimulus or to motor responses is\nusually ignored. Here, we present new tools for modeling and quantifying the\ninformation transmission based on periodic neural activity that occurs with\nquasi-random phase relative to the stimulus. We propose a model to reproduce\ncharacteristic features of oscillatory spike trains, such as histograms of\ninter-spike intervals and phase locking of spikes to an oscillatory influence.\nThe proposed model is based on an inhomogeneous Gamma process governed by a\ndensity function that is a product of the usual stimulus-dependent rate and a\nquasi-periodic function. Further, we present an analysis method generalizing\nthe direct method (Rieke et al, 1999; Brenner et al, 2000) to assess the\ninformation content in such data. We demonstrate these tools on recordings from\nrelay cells in the lateral geniculate nucleus of the cat."}, "authors": ["Kilian Koepsell", "Friedrich T. Sommer"], "author_detail": {"name": "Friedrich T. Sommer"}, "author": "Friedrich T. Sommer", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1007/s00422-008-0273-6", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0809.4059v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0809.4059v2", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "18 pages, 8 figures, to appear in Biological Cybernetics", "arxiv_primary_category": {"term": "q-bio.NC", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "q-bio.NC", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "cs.IT", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "math.IT", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "q-bio.QM", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0809.4059v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0809.4059v2", "journal_reference": "Biological Cybernetics (2008) 99:403-416", "doi": "10.1007/s00422-008-0273-6", "fulltext": "arXiv:0809.4059v2 [q-bio.NC] 7 Oct 2008\n\nInformation transmission in oscillatory\nneural activity\n\nKilian Koepsell & Friedrich T. Sommer\nRedwood Center for Theoretical Neuroscience\nHelen Wills Neuroscience Institute\nUniversity of California, Berkeley\nBerkeley, CA 94720\n{kilian,fsommer}@berkeley.edu\n\nAbstract\nPeriodic neural activity not locked to the stimulus or to motor responses is usually ignored. Here, we present new tools for modeling and quantifying the information transmission based on periodic neural activity that occurs with quasirandom phase relative to the stimulus. We propose a model to reproduce characteristic features of oscillatory spike trains, such as histograms of inter-spike\nintervals and phase locking of spikes to an oscillatory influence. The proposed\nmodel is based on an inhomogeneous Gamma process governed by a density function that is a product of the usual stimulus-dependent rate and a quasi-periodic\nfunction. Further, we present an analysis method generalizing the direct method\n[RWvSB99, BSK+ 00] to assess the information content in such data. We demonstrate these tools on recordings from relay cells in the lateral geniculate nucleus\nof the cat.\n\n1\n\nIntroduction\n\nOscillatory activity is ubiquitous in the brain, manifesting itself on a macroscopic level in EEG and\nMEG recordings as \"brain waves\" and on the level of single neurons in micro-electrode recordings\nas periodic spike patterns. There are different forms of oscillations. Traditionally one distinguishes\noscillations that co-occur with a behavioral condition such as sensory stimulation from ongoing oscillations that are spontaneous, that is, present independently of the behavioral condition. When\nco-occurring with stimulation, two different types of oscillations have been discerned: Stimulusevoked oscillations are phase-locked to the stimulus, that is, the phase of the periodicity in neural\nactivity can be reproduced by repeating the same stimulus. In contrast, in stimulus-induced oscillations the phase is variable with respect to the stimulus and cannot be predicted from one stimulus\ntrial to the next.\nIn various sensory systems, it has been shown that neural oscillations that co-occur with stimulation play an important role for the coding of sensory information. Examples are the olfactory system in species ranging from insects to mammals [Adr42, Fre72, GT90, LD94], the\nwhisker system in rats [SBA03] and the somatosensory system in primates [AV90]. The motivation for our present study is the question whether oscillations that are spontaneous or not phaselocked to the stimulus can have roles in information coding and transmission. This is conceivable since ongoing or non-stimulus-locked oscillations could still be influenced by the stimulus\nand thereby carry stimulus information. However, to date, this question has not been satisfactory addressed. For example, consider the visual system. Over the last four decades, numerous studies of various vertebrate species have reported oscillatory activity in the early visual system [HB66, LV67, Rod67, NS96, CBNS98, IGHT05, MRM+ 08]. These oscillations are sometimes\nstimulus-evoked but often spontaneous. The question of whether they are systematically influenced\n1\n\n\fby the visual stimulus and what their functional role could be, has been subject of controversy and\nis still not resolved. One difficulty with addressing this question is the lack of applicable models\nand analysis tools. To fill this gap, we propose two new theoretical tools for studying the function of\noscillatory activity: A spiking neuron model that reproduces the characteristic statistical properties\nof oscillatory neurons and a method to quantify the information of oscillatory spike trains even in\nthe absence of stimulus-locking.\nOne possibility how ongoing oscillations can be used to convey stimulus information is in phase coding schemes, in which relative phases encode information. A prominent example is phase coding\nof spatial location by place cells in rat hippocampus. The spike phase relative to theta oscillations\nin the EEG encodes additional information about the location of the rat [OR93]. Another example\nfor phase coding was reported in the visual system. [NS96] have found that spatially extended light\nstimuli can synchronize the ongoing oscillatory activities in retinal ganglion cells and that this synchronization is transmitted by LGN neurons. Information encoded in phases of ongoing oscillations\nin synaptic input could be used by neurons in various ways: it could be recoded, transformed, or,\nlike in the LGN cells mentioned, it could simply be preserved in the spike train and thus be used to\ntransmit information to the next processing stage downstream. Here we concentrate on investigating\nthe role of ongoing oscillations in information transmission by asking how a neuron's spike train\ncan capture the phase of an oscillatory trend in its synaptic input. The methods we will describe are\ngeneral in that they examine a necessary condition that observed ongoing oscillations can have a role\nin transmitting information, independent of the coding scheme and of knowing what information is\ntransmitted.\nSpecifically, our aim is to model and measure how information in oscillation phases can be transmitted by a single neuron and how this transmission can coexist with information transmission utilizing\nspike rate. As will be shown in a model, the two information channels do not interfere and can be\nused to multiplex information if the oscillations are on a faster time scale than the rate modulations.\nFurther, we introduce a method to quantify the additional information encoded in the second channel. If this additional information is insignificant, the role in information transmission can be ruled\nout. Importantly, however, a positive result hints to a functional role of the ongoing oscillations and\nencourages further investigations addressing what specific coding scheme is employed and what\nstimulus information is encoded. Thus, our method is a first step in assessing the functional significance of ongoing oscillations and it can be applied, even if it is unknown what kind of information\nis encoded.\nWe applied our new tools to recordings from relay cells in the lateral geniculate nucleus (LGN) of\ncat from the lab of Judith Hirsch, USC. Whole-cell recordings in vivo were used to record retinal\nexcitatory postsynaptic potentials (EPSPs) and the spikes they evoke in response to naturalistic\nstimuli (movie sequences of 30s length). Cluster analysis of the intracellular signal allowed us to\nlabel excitatory synaptic inputs (EPSPs) in the intracellular signal and to separate these from spikes\n(for detailed methods of experiments and clustering, see Wang et al. 2007, Koepsell et al. 2008).\nThus, the data we use in this paper consist of pairs of spike trains for each geniculate relay cell, the\ntrain of spikes produced by the relay cell and the train of presynaptic spikes produced in the retinal\nganglion cell(s) projecting to the relay cell. Our method reveals additional information that is not\ncaptured in the classical rate-coding paradigm. Remarkably, the amount of additional information\nis commensurate with the rate-coded information and can in some cases even surmount it.\nThe paper is outlined as follows: To make the paper self-contained, Section 2 briefly revisits point\nprocess models for spike trains. In Section 3, a model is presented for reproducing the periodicity observed in measured neural spike trains. In Section 4, an information theoretical approach is\ndescribed to measure information in oscillatory activity. In Section 5, we fit the parameters of the\nmodel to reliably reproduce the properties of periodic spike trains from cells recorded in LGN. Furthermore, we quantify the information rates in spike trains with oscillations. Finally, in Section 6\nwe discuss possible interpretations of the results from the information theoretic analysis regarding\npotential computational functions of the oscillations in retina and LGN.\n\n2\n\nPoint process models for spike trains\n\nIn this section, we review the use of point processes in order to model a sequence of action potentials or spikes. Each spike is an impulse of about one millisecond duration with a stereotyped\n2\n\n\fshape [HH52]. Thus, we can characterize the activity of a neuron by its spike train, the set of time\npoints {t1 , t2 , ..., tn } at which the spikes occur.\n2.1\n\nHomogeneous point processes\n\nThe simplest case is when spikes are described as homogeneous Poisson processes, that is, point\nprocesses that occur independently with a probability density or rate λ that is constant in time. If\nthe time axis is divided into small bins dt, the probability of a spike in any of the time bins is\nλdt. The observation of an inter-event interval τi = ti − ti−1 relies on the conjunction of a spike\noccurring in the time bin at ti and the \"survival\" of a preceding empty interval of length τi . The\nsurvival probability of the spike-free interval is given by the joint probability that neither of its\nτi /dt − 1 time bins contains a spike. Thus, the probability of an inter-spike interval is given by the\nproduct of probabilities of τi /dt independent events, which can be approximated by the exponential\ndistribution:\np(τi )dt = λdt(1 − λdt)τi /dt−1 ≈ λe−λτi dt\n(1)\nThis approximation is valid for λdt << 1 and τi /dt >> 1 and becomes exact for dt → 0.\nOne can also compute the interval distribution between event pairs in a train of independent spikes\nthat are not directly consecutive but have k-1 spikes in between, which leads to the Gamma distribution with shape parameter k:\np(τ )dt = λdt\n\n(λτ )k−1\nλk τ k−1 e−λτ\n(1 − λdt)τ /dt−k ≈\ndt ,\n(k − 1)!\nΓ(k)\n\n(2)\n\nwhere Γ(k) is the Gamma function. If the shape factor in the Gamma distribution is an integer,\nit is an Erlang distribution. Note that the Gamma distribution describes the interval density in a\nsubsampled Poisson process consisting of every k-th spike. Therefore, the Gamma distribution for\nk = 1 reduces to the exponential distribution. However, as k becomes larger than one, the shape of\nthe distribution changes qualitatively: Whereas the exponential distribution decreases monotonically\nwith increasing interval size, the Gamma distribution for k > 1 is maximal for a certain intermediate\ninterval length.\nIt has been known for some time that the Gamma distribution matches inter-spike-interval (ISI)\ndistributions of real spike trains in response to stationary stimuli much better than a exponential distribution [KFB57, PGM67]. Further, it has been shown that the Erlang probability density describes\nthe ISI distribution of a non-leaky stochastic integrate and fire model with a fixed threshold that is\ndriven by excitatory Poisson inputs with constant rate [Tuc88]. However, one should add that the\nabsence of short intervals in real spike trains is caused by the neuronal refractory period, a shortlived history effect that prevents a spike from being generated briefly after another spike. For the\nsake of simplicity we will resort in the reminder to the use of Gamma distributions although explicit\nmodeling of the refractory period should yield subtle differences. For example, the Gamma process\neliminates leading and trailing spikes of short intervals with equal probability whereas modeling the\nrefractory period should preferentially remove, or suppress, the trailing spike.\n2.2\n\nInhomogeneous Gamma process\n\nWhereas the spike rate of the homogeneous point process is constant, the firing rate of a neuron is\ngenerally a function of time, λ(t). Changes in firing rate reflect changes in the stimulus, as well as\nother time dependent influences on the neuron. Rate changes that are systematic and reproducible\nare informative for understanding what the neuronal activity is encoding. Equation (2) can be generalized to describe the probability density of the inhomogeneous Gamma process [BQF+ 01]\n\u0012 Z t+τ\n\u0013k−1\n\u0012 Z t+τ\n\u0013\nkλ(t + τ )\nk\nλ(u)du\nexp −k\nλ(u)du ,\n(3)\npt (τ ) =\nΓ(k)\nt\nt\nwhere pt (τ ) is the probability of a spike interval τ given that the last spike was at time t. To model\nan actual spike train, the function λ(t) has to be estimated. In principle, this can be done by low-pass\nfiltering of the raw spike train. However, on single spike trains this estimate is noisy and thus it is\nhard to separate systematic rate changes from estimation errors and noise fluctuations. In the next\nsection we describe experimental designs and methods for using equation (3) to model spike trains\nthat are not only influenced by a time-dependent stimulus but also by an oscillatory trend.\n3\n\n\f3\n\nModeling systematic structure in spike trains\n\nHere, we model two different types of systematic structure in spike trains, stimulus-locked rate\nchanges and autocorrelative structure such as periodicities in the firing rate. Both structures can be\nsuperimposed in inhomogeneous spike trains, and both can potentially contribute to the neural code.\n3.1\n\nModeling spike trains with stimulus-dependent rate modulation\n\nTo track systematic rate changes λs (t) that are locked to the stimulus s(t), one typically chooses\nexperimental designs with repetitions of the same stimulus. Then one can average the spike train\nover stimulus repeats to form the post-stimulus time histogram (PSTH), r(t). Using optimization\ntechniques, such as adaptive kernel estimation [ROS90], one can find the best parameters for the\nlow-pass filter to estimate λs (t) from the PSTH r(t). For a given number of repeats, the power of\nλs (t) and the inter-trial variability can be estimated as described in [SL03].\nTo model a spike train with stimulus-locked rate modulation one first has to estimate the trialRT\naveraged rate λs (t) from the PSTH and the mean rate λ̄s = 1/T 0 λs (u)du. Next, the time is\nrescaled with\nZ t\nt0 = λ̄−1\nλs (u)du\n(4)\ns\n0\n\nin order to obtain a constant rate λ = 1 [BBV+ 02]. Finally, the rescaled distribution of inter-spike\nintervals from the experiment can be fitted by a homogeneous Gamma distribution (2) with fixed\nrate λ = 1 [KFB57]. The shape parameter k is determined from the moments (mean τ̄ and variance\nστ2 ) of the empirical rescaled ISI distribution as: k = τ̄ /στ2 , see [BFK57, BQF+ 01].\n3.2\n\nModeling oscillatory rate modulation\n\nStimulus-locked oscillatory structure is preserved by trial averaging and therefore directly reflected\nin the PSTH. Thus, the oscillatory spike rate can be obtained from trial averaging and used to model\nthe spike train, just as described in the previous subsection. However, neural oscillations that are\nnot stimulus-locked have to be modeled differently since they average out across multiple stimulus\nrepetitions and are therefore not captured in the PSTH. In the reminder we describe how to detect\nand quantify such oscillations and ultimately, how to model the spike trains.\n3.2.1\n\nDetecting and quantifying oscillations\n\nNeural oscillations have been assessed in the time domain based on autocorrelograms and interspike-interval (ISI) histograms. If stable oscillations are present, a modulated autocorrelogram\nreflects the periodic structure and also the ISI histogram becomes multi-peaked [HB66, OBL66,\nMHKS84, CBNS98]. Alternatively, spectral methods have been developed. Because spectral power\nestimates based on the plain Fourier transform of spike trains are quite noisy, multi-taper methods have been applied to improve the accuracy of detecting and characterizing peaks in the power\nspectrum [JM01]. Recently, the oscillation score (OS) has been proposed which exploits structure\nin time and frequency domain [MJM+ 08]. To compute the oscillation score, the autocorrelogram\nis first filtered and the central peak is removed (since it is not indicative of oscillatory structure).\nNext, the result is Fourier transformed and the peak frequency is detected in the spectrum. Finally,\nthe oscillation score is defined as the ratio between peak height and baseline in the spectrum. The\noscillation score is a reliable indicator for oscillatory trends because it is insensitive to confounding\nfactors, such as refractory effects and bursts.\nFig. 1 displays autocorrelograms and ISI histograms for relay cells of the lateral geniculate nucleus\nof the cat during visual stimulation with natural stimuli. As one can see, for this cell the oscillations\nare prominent according to either of the described criteria. The timings of synaptic inputs (EPSPs)\nof this cell are shown in Fig. 2A together with the spikes they evoke (Fig. 2B). The cell belongs to a\nsubset of relay cells in the LGN with oscillatory spike trains that otherwise behave quite regularly,\nhaving the usual center-surround receptive fields and refractory periods of about one millisecond\n(see upper panels), see [KWV+ 08] for more details.\n4\n\n\fFigure 1: Spike interval distribution, autocorrelation histogram and spike power spectrum for an\noscillatory LGN cell. A Inter-spike-interval (ISI) distribution (top panel) and autocorrelation histogram (bottom panel) of one example LGN cell (f = 56.6 Hz, OS = 39.3). B Spectral power for\nspikes (continuous line) and EPSPs (dashed line) of an example cell (same cell as in A)\n3.2.2\n\nEstimating oscillation amplitude and phase\n\nTo model the periodic structure of the spike train induced by afferent inputs to the neuron, the instantaneous oscillation phase in the input has to be estimated for each point in time (see Fig. 2).\nFor LGN cells it known that the synaptic inputs can exhibit periodicity originating from the\nretina [HB66, OBL66, Rod67, CBNS98]. The LGN recordings we analyze here are in vivo wholecell recordings and we can extract the train of excitatory postsynaptic potentials (EPSPs) –the input\nspike train– from the measured membrane potential.\nTo determine the instantaneous phase of the input oscillation of an LGN cell we compute the complex analytic signal of the input spike train (EPSPs)\nA(t) = A0 (t)exp(iφ(t))\n\n(5)\n\nby convolving the EPSP train with a complex Morlet wavelet (inset of Fig. 2A)\nw(t, f ) = Ce2πif t e−t\n\n2\n\n/2σt2\n\n(6)\n\ncentered at a frequency f with temporal width σt and normalization factor C. The amplitude A0 of\nthe analytic signal corresponds to the local power in the frequency band centered at f with bandwidth\nσf = 1/(2πσt ).\nThe angle φ(t) of the analytic signal defines the instantaneous phase of the input oscillation. To\nassess the influence of the input oscillation on the LGN spike train, we measure how the spikes are\ndistributed over the phase of the input oscillation (see Fig. 2B). The top panel in Fig. 3A shows that\nthe resulting phase histogram is peaked, that is, the spikes are more likely to occur at a certain phase\nin the input oscillation. If one uses the input phase from another trial to form the phase histogram\nof spikes (shift predictor), the resulting histogram shown in the bottom panel of Fig. 3A is flat,\nindicating that the input oscillation is not locked to the stimulus. To determine the optimal frequency\nfor this analysis we used the frequency determined from the oscillation score measurement (see\nSection 3.2.1). To quantify the spike locking to the input oscillation, the phase histogram is fitted\nwith a von Mises (or cyclic Gaussian) distribution\nM (φ|κ, μ) = eκcos(φ−μ) /(2πI0 (κ))\n\n(7)\n\nThe mean phase μ is computed from circular mean of the spike phase distribution\nheiφ i =\n\nN\n1 X iφ(tn )\ne\n= reiμ\nN n=1\n\n(8)\n\nThe concentration parameter κ is obtained by numerical solution of the equation\nI1 (κ)/I0 (κ) = r\n5\n\n(9)\n\n\fFigure 2: Timing of retinogeniculate EPSPs and thalamic spikes recorded intracellularly from a\nsingle relay cell during the presentation of natural movies. A Rasters of timings of EPSPs for 7\nrepeats of a natural movie clip. Inset: Morlet wavelet used to compute the analytical signal in B.\nB Real part of the analytical signal computed by band-pass filtering of the EPSP train (blue curve)\nand timings of LGN spikes (red markers).\nwhere I0 and I1 are the modified Bessel functions of zeroth and first order. The concentration\nparameter κ is a measure of phase locking; the phase distribution becomes uniform for κ → 0 and\napproaches a Gaussian distribution with standard deviation σ = 1/κ for large κ, see inset in Fig. 3A.\nThe phase concentration is often characterized by the circular variance\nvar(φ) := h|eiφ |2 i − |heiφ i|2\n\n(10)\n\nwhich assumes values between zero and one. The circular variance is related to the concentration\nparameter κ by var(φ) = 1−I1 (κ)2 /I0 (κ)2 . The von Mises Distribution M (φ|κ, μ) is the maximum\nentropy distribution for a given circular mean and variance.\n\nFigure 3: Phase distribution of spikes and ISI distributions after time rescaling. A Phase distribution\nof spikes with respect to oscillation extracted from the EPSP train (top panel) and Shift predictor\n- phase distribution of spikes with respect to oscillation extracted from EPSP train from other trial\n(bottom panel). B Inter-spike-interval (ISI) distribution rescaled by stimulus-influenced rate λs (top\npanel) and ISI distribution rescaled by the modulated rate used in the QPG model (11) (bottom\npanel).\n3.2.3\n\nThe quasi-periodic gamma model\n\nTo understand the effect of the combination of stimulus-dependent rate modulation and the influence of input oscillations that are not locked to the stimulus, we devised a simple model to include\nboth effects, the quasi-periodic gamma (QPG) model (Fig. 4A). It describes spike generation by an\n6\n\n\finhomogeneous Gamma process (3) with a factorial instantaneous rate λ(t) given by the product\nλ(t) = 2πλs (t)M (φ(t)|κ, μ) .\n\n(11)\n\nThe first factor λs (t) is the stimulus-locked rate determined as described in Section 3.1. The second\nfactor is a von Mises distribution M (φ(t)|κ, μ) describing the periodic modulation that can be fit\nto data as described in Section 3.2.2. In order to get independent estimates of stimulus-locked and\nperiodic modulations, it is important that the oscillations have a higher frequency than the frequency\ncontent of the stimulus-locked modulation. For LGN cells in cat these two frequency bands are\nwell separated, since the stimulus signal rolls off at frequencies well below the ones of the observed\noscillations in the gamma frequency band (40-80 Hz). In the following, we use the phase of a random\nband-pass signal with frequency f ± σf . In total, the QPG model has the five free parameters:\nk, κ, μ, f, σf . In general, however, the instantaneous phase φ(t) of the periodic activity may be a\nfunction of the stimulus. The relations between the described QPG model and previous models will\nbe considered in the discussion section.\n\nFigure 4: Quasi-periodic Gamma (QPG) model and simulated data. A Schematics of quasi-periodic\ngamma model. B ISI distribution (top panel) and autocorrelation histogram (bottom panel). C Phase\nhistogram of spikes with respect to oscillatory trend. The simulations of panel B and C use parameters fitted to the cell shown in Fig. 1 and Fig. 3.\n\n4\n\nInformation in oscillatory spike trains\n\nIn this section we describe how the information content in oscillatory spike trains can be estimated.\nVarious methods have been developed for estimating information rates of neural responses, e.g.\n[EP75, RWvSB99], for an overview, see Ref. [BT99]. Most of these methods depend on certain\nproperties of the statistics of signal and noise in the stimulus as well as in the neural response, for\nexample many models assume Gaussianity. Here, we apply the direct method which is applicable to\nsignals with arbitrary statistics to the QPG model of Section 3.2.3.\n7\n\n\f4.1\n\nDirect method\n\nThe direct method [RWvSB99, BSK+ 00] estimates the mutual information between an event E\nin the neural response and a time-varying stimulus s(t). If the information is conveyed by single\noccurrences of event E (and not temporal patterns), the information per event is given by\nI(E; s) = S[E] − S[E|s] bit/event .\n\n(12)\n\nIf the distribution of event E is uniform during the trial t ∈ (0, T ), that is, p(t) = 1/T , the unconditional entropy is simply S[E] = log2 T . S[E|s] is the conditional entropy of the event E, given a\ntime-varying stimulus s(t):\nZ T\nX\ndt p(t|s) log2 (p(t|s))\nS[E|s] =\np(s)\ns∈{s}\n\nZ\n\n0\n\nT\n\ndt p(t|s) log2 (p(t|s))\n\n=\n\n(13)\n\n0\n\nIf the stimulus is rich enough, the ensemble average over stimuli and the time average over the\nstimulus are equivalent [BSK+ 00] and thus the former can be omitted in equation (13).\nThe conditional distribution of spikes can be estimated empirically by recording neural responses\nto repeats of the stimulus s(t) and forming the PSTH r(t) (see Section 3.1). The conditional distribution is then given as p(spike at t|s) = r(t)/(T r̄). Thus, each spike transmits the information [BSK+ 00]:\n\u0012\n\u0013\nZ\n1 T\nr(t)\nr(t)\nI(spike; s) =\ndt\nlog2\nbit/spike\n(14)\nT 0\nr̄\nr̄\nThe accuracy of the information rate estimated for finite data depends on the bin width ∆t used to\ncompute the integral in equation (14). The estimate converges to the true entropy only asymptotically\n(limit of zero bin width and infinite number of trials). More specifically, narrow bin sizes with finite\ndata lead to a pronounced overestimation of the amount of information transmitted. The circles\nin Fig. 5A show how for a data set with 20 trials the information is overestimated as the bin size\ndecreases. The estimate is improved, however, by a linear extrapolation (∆t → 0) of the values\nfor larger bin size, Fig. 5A, dashed line. The resulting value is 0.50 bit/spike, see (see [BSK+ 00]).\nExtrapolating this result in addition to larger numbers of trials (N) also with a line (∆t, 1/N → 0)\nyielded 0.46 bit/spike (Fig. 5B, dashed curve).\n\nFigure 5: Information rates for experimental data (natural stimulus with 20 repeats). A Information\nrate as a function of the size of the time bin (circles). Linear extrapolation to zero bin width yields\n0.50 bit/spike (dashed line). B Information rate as a function of the inverse number of repeats\n(circles). Linear extrapolation to infinite number of trials yields 0.45 bit/spike (dashed line).\n4.2\n\nThe multiconditional direct method\n\nIn the following, we apply the direct method to the case of oscillations that are not locked to the\nstimulus. If an oscillation is present, the spike train contains information not only about the stimulus\n8\n\n\fsignal s(t) but also about the phase φ(t) of the oscillatory trend. To quantify the contribution of the\noscillation to the information rate, the two cases described in Section 1 have to be treated differently;\nstimulus-locked oscillations and oscillations that are not locked to the stimulus. Stimulus-locked\noscillations are conveyed in the PSTH and therefore equation (14) can be used directly to estimate\nthe mutual information in single spikes exerted by the stimulus and the oscillatory trend.\nOscillatory trends that are not locked to the stimulus are averaged out in the PSTH. Therefore the\nadditional information about the oscillation cannot be measured by equation (14) 1 . Here, we describe the multiconditional direct method that can measure information in oscillatory activity, even\nif not locked to the stimulus. We quantify the information I(spike; s, φ) that a spike conveys about\nboth the stimulus s(t) and the phase φ(t) of an oscillatory trend. Note that this is different from\nquantifying the stimulus information conveyed by a spike in a phase coding scheme, which would\nbe I(spike, φ; s) (see Discussion).\nThe periodic trend function can be described by an instantaneous phase φ(t) which increases monotonically with wrap-around condition φ = φ + 2π. The phase φ(t) is a quasi-periodic function in\ntime with period P (t): φ(t) = φ(t + P (t)). The probability of a spike occuring at time t now\ndepends on both influences, the stimulus and the oscillatory trend function. At any moment in time\nt, the joint influence is fully described by the stimulus s(t) and the current phase of the oscillatory\ntrend φ(t). The conditional entropy that includes both influences can then be written:\nZ T\nX\n\u0002\n\u0003\nS p(spike at t|s, φ) =\np(s, φ)\ndt p(t|s, φ) log2 (p(t|s, φ))\n0\n\ns,φ\n\n=\n\nX\n\np(s)\n\nX\n\ns\n\nZ\n=\n\nZ\ndφ\n\n0\n\nT\n\ndt p(t|s, φ) log2 (p(t|s, φ))\n0\n\nφ\nP\n\nZ\np(φ|s)\n\nT\n\ndt p(t|s, φ) log2 (p(t|s, φ))\n\n(15)\n\n0\n\nHere the same argument applies for dropping the ensemble average over the stimuli as in equation\n(13). In addition, we use the fact that the oscillations are not stimulus locked and therefore the\ninstantaneous phase does not depend on the stimulus and all phases occur equally often: p(φ|s) =\n1/(2π).\nAs before, the conditional distribution p(t|s, φ) can be acquired empirically by recording neural\nresponses during multiple repetitions of the stimulus s(t). The response varies not only with the\nstimulus but also with the instantaneous oscillation phase φ(t). To capture both dependencies, an\nextended response histogram has to be collected. The stimulus can be parameterized by the relative\nstimulus time, just as in the standard PSTH. But because the oscillations are not stimulus-locked,\nthe histogram requires a second dimension to represent the instantaneous phase φ(t). The extended\nresponse histogram r(t, φ) contains the response binned by relative stimulus time t ∈ [0, T ] and\ninstantaneous phase φ ∈ [0, 2π]. With proper normalization the conditional probability is given by:\np(t|s, φ) = r(t, φ)/(T r̄). The unconditional probability of a spike at time t is p(t) = 1/T with\nentropy S[p(t)] = log2 T as before.\nUsing equation (12) the multiconditional direct method can be formulated: The information per\nspike is given as:\n\u0012\n\u0013\nZ 2π\nZ T\n1\nr(t, φ)\nr(t, φ)\nI(spike; s, φ) =\ndφ\ndt\nlog2\nbit/spike\n(16)\n2πT 0\nr̄\nr̄\n0\nOne might ask, what the maximal amount of information is that could be encoded in the spike train\nthis way. If the stimulus-locked rate and the periodic oscillations would encode information independently, which would be optimal, their respective contribution to the right hand side of formula\n(16) would be additive. The contributions from the oscillations is bounded by the negative entropy\nof the von Mises distribution\n\u0012\n\u0013\n\u0002\n\u0003\nexp(κI1 (κ)/I0 (κ))\nS M (φ|κ, μ) = log2\n.\n(17)\n2πI0 (κ)\n1\n\nBut note that equation (14) can still be used to estimate the information in stimulus-locked rate modulation.\n\n9\n\n\fThus, the upper bound of the total information rate of single spikes in oscillatory spike trains is given\nby\n\u0002\n\u0003\nI(spike; s, φ) ≤ I(spike; s) − S M (φ|κ, μ) .\n(18)\nwith the first term on the RHS obtained from (14) and the second term from (17). A deviation from\nthis upper bound indicates mutual information between the phase and the rate signal which might\nbe utilized for redundant encoding of information (see Discussion).\n4.2.1\n\nThe phase de-jittering method\n\nAn alternative option to determine the information is a de-jittering method, proposed in\nRef. [KWV+ 08], in order to measure the information carried by single spikes in trials with different values for the instantaneous phase φ(t) of the oscillation in the inputs. Here, we shift the\nspikes by an amount corresponding to their oscillation phase −φ(t)/(2πf ) in order to correct for\nthe effect of different state of the input oscillation and subsequently measure the single-spike information using the direct method (14). This amounts to an oscillation-dependent rescaling of the time\naxis and effectively de-jitters the spike train.\nThis method relies on the fact that the stimulus-locked spike rate does not change on the time scale\nof the oscillations and therefore is not affected by the de-jittering. Even though this is only an\napproximation, the de-jittering method gives comparable estimates to the multiconditional direct\nmethod (16) and it has the advantage that it requires much less data to be feasible.\nNote that the described method of de-jittering differs from those that use the stimulus [AMG+ 05]\nor the spike train itself [ROS90].\n\n5\n\nModel fitting and simulation experiments\n\nIn this section, we describe how to fit the QPG model to measured data and apply it to intracellular\nrecordings of thalamic relay cells in cat LGN. We then use the QPG model to generate different\ntypes of surrogate data for testing and comparing the information theoretic measures described in\nSection 4.\n5.1\n\nFitting the QPG model to LGN recordings\n\nWe fitted the five free parameters (k, κ, μ, f, σf ) of the model to match the data of the cell shown\nin Fig. 1A. Specifically, frequency and bandwidth of the oscillatory component was fitted to the\noscillations measured in the input (train of EPSPs), the concentration and mean of the spike phases\nwas fitted to the experimental phase histograms and the shape factor of the Gamma distribution\nwas optimized to match the output spike train. The center frequency of the oscillation was set\nto the frequency determined by the oscillation score method (see [MJM+ 08] and Section 3.2.1)\nand for the bandwidth we chose σf = 2Hz, corresponding to the width of the peak in the power\nspectrum (Fig. 1B) and a temporal width of σt = 80ms. To generate the oscillatory component,\na bandpass filter with these parameters was applied to a white-noise signal throughout the entire\nrecording length, irrespective of stimulus onsets. Thus, the resulting phase distribution across trials\nwas flat, as in the experimental data (Fig. 3B). The concentration parameter κ and the mean phase\nμ were determined by fitting the von Mises distribution to the phase distribution of the spikes using\nequations (8) and (9). Finally, the shape parameter k of the Gamma process was determined by\nusing time rescaling [BBV+ 02] as described in Section 3.1 (see Fig. 3B).\nThe QPG model reproduces the characteristics of the real data quite well. The simulated ISI histogram and autocorrelogram in Fig. 4B is very similar to the histograms from the data in Fig. 1B\nand also the histograms of spike phases are similar: simulated data shown in Fig. 4C and real data in\nFig. 3A. Another indication that the QPG model captures the measured spike train very well is the\ngood match between the time-rescaled ISI histogram using equation (11) and the Gamma distribution, compare histogram and solid line in Fig. 3B (bottom panel). As a control we rescaled the ISI\nhistogram just by λs , ignoring the oscillations. The resulting histogram is clearly not well described\nby a Gamma distribution, Fig. 3B (top panel).\n10\n\n\fFigure 6: Information rates for simulated data using the direct method. A Information rate using\nequation (14) on 20 trials as a function of the size of the time bin (circles). Linear extrapolation to\nzero bin width yields 0.50 bit/spike (dashed line). Information estimates for simulated data without\nmodulation gives identical results (crosses). Estimates diverge for bin sizes below about 30ms due\nto limited data. Information estimates using 500 trials give reliable results for smaller bin sizes\n(crosses). B Information rate using equation (14) on 20 trials as a function of the inverse number of\nrepeats (circles). Linear extrapolation to infinite number of trials yields 0.46 bit/spike (dashed line).\n\n5.2\n\nEstimation of Information rates\n\nThe fitted QPG model was used to create three different types of simulated data. The surrogate data\nreflected the entire structure of the fitted experimental data, as well as the QPG model permitted.\nThe spike trains in the surrogate data exhibited stimulus-locked modulation and an oscillatory trend\nthat was not locked to the stimulus. Since it is very difficult to conduct in vivo recordings over long\nperiods of time, the number of stimulus repetitions available in the real data is very limited, in our\ncase to 20 trials. The surrogate data can be made arbitrarily large and thus they allow to study effects\nof data limitation. Further, surrogate data allow to estimate information measures even though the\noriginal data set would be much too small to achieve a reliable estimation.\nFor the purpose of comparison we also generated data sets with the QPG model that had systematic\ndifferences from the real data. The second type of simulated data used all the fit parameters reflecting\nthe stimulus modulation and the oscillation strength of the experimental data. However, unlike in\nthe data the oscillatory trend in the model was aligned over repeats, that is, this data set contained\nstimulus-locked oscillations. The third type of simulated data reflected only the stimulus modulation\nobserved in the data but no oscillatory structure.\nFirst we asked how the results with the standard direct method depends on the amount of data. We\ncomputed information rates with equation (14) for 20 trials (same number of trials as in the data)\nand for 500 trials from the surrogate data. Fig. 6 shows the information rates for the surrogate data\nin the same format as Fig. 5. The results for 20 trials (circles in in Fig. 6A) exhibit a similarly strong\nbias for bin sizes smaller than 30ms as is also observed for the experimental data (Fig. 5A). Using\nthe linear extrapolation from larger bin sizes to estimate the information rate as in Fig. 5, the results\nfor the surrogate data are very similar to the results on the real data in Fig. 5: 0.50 bit/spike for\nextrapolation to small time bins (∆t → 0) Fig. 6A; and 0.45 bit/spike for extrapolation to small\ntime bins and large numbers of trials (∆t, 1/N → 0), Fig. 6B. In addition, the surrogate data allow\nto verify the validity of the linear extrapolation. The information estimates for 500 trials (crosses\nin Fig. 6A) lie slightly lower than the ones for 20 trials, as expected, but follow the linear trend to\nmuch smaller bin sizes.\nNext, we used equation (16) on the surrogate data to assess the contribution of the not stimuluslocked oscillations to the information rate of the spike trains generated by the QPG model. For\ncomparison, we studied also the effect of stimulus-locked oscillations by applying the standard formula for direct information (14) to the simulated data with the oscillations aligned across trials.\nIn both cases we used 500 simulated trials. Fig. 7 depicts the resulting information rates. For the\nstimulus-locked oscillations (circles) the additional information due to the oscillations is visible only\n11\n\n\fFigure 7: Information rates for simulated data using the multiconditional direct method. A Circles\nmark the information rate on 500 trials as a function of the size of the time bin for stimulus-locked\noscillations computed with equation (14). Note the additional information compared to A below\n30ms bin size. Diamonds mark the information rate for non-stimulus-locked oscillations using\nequation (16). B Information rate using equation (16) as a function of the inverse number of trials.\nCircles mark the rates obtained with equation (14) for stimulus-locked oscillations. Other symbols\ndenote results obtained with (16) for non-stimulus-locked oscillations for different numbers of phase\nbins: 5 phase bins (crosses), 10 phase bins (diamonds), and 20 phase bins (pluses). Dashed lines are\nthe linear extrapolations. Both methods give comparable results around 1.5 bit/spike. The red triangle marks the maximal achievable amount of information rate of 2.13 bit/s computed by assuming\nindependence of oscillatory and rate-encoded information, see equation 18.\n\nat small bin sizes in Fig. 7A and therefore can easily be overlooked with limited data. In contrast,\nthe result of non-stimulus-locked oscillations (diamonds) can be extrapolated from larger bin sizes.\nBut note that the information rate of not stimulus-locked oscillations relies on an extended response\nhistogram (in time and phase) and therefore the required amount of data is not smaller than for\nstimulus-locked oscillations. Therefore, both methods we use in Fig. 7 to estimate the information\nrates rely on boosting the amount of data with the QPG model, the extrapolations to zero bin size\ncould not have been done directly on the experimental data with only 20 repeats. In the right panel\n(Fig. 7B) the obtained estimates for the information rates are extrapolated to infinite number of trials using different numbers of phase bins in the extended response histogram. Three observations\nwith the resulting asymptotic information rates should be emphasized. First, oscillations contribute\na significant amount of information. They add about 1 bit/spike for this cell, more than twice the\ninformation contained in stimulus-locked rate modulations alone (cf. Fig. 6A/B). Second, the information rates have a similar value, around 1.5 bit/spike, whether or not the oscillations are locked to\nthe stimulus. Note that the rates for not stimulus-locked oscillations converge to 1.5 bit/spike for 10\nor more phase bins. Third, the measured information rates reach about 70% of the value one would\nexpect, if stimulus-locked and oscillatory modulation were entirely independent. The upper bound\n(18) for this cell that was best fitted with κ = 2.44 is 2.13 bit/spike, as marked by the red triangle in\nFig. 7B.\nWe have investigated whether the de-jittering method in Section 4.2.1 gives comparable results to\nthe multiconditional method to estimate the information in oscillatory spike trains. The de-jittering\nmethod has been used in Ref. [KWV+ 08] to estimate information rates. However, since the limited\namount of experimental data, the information of the de-jittered spike train has been estimated using\nthe signal-to-noise ratio and the assumption of a Gaussian information channel. Here, we de-jittered\nthe simulated data as described in Section 4.2.1 and applied equation (14) to determine the information rate in single spikes. Fig. 8A/B shows that the information rate estimation using de-jittering\nagrees quite well with the results obtained by the more rigorous treatment described in this paper.\nThis comparison confirms that the de-jittering method is a viable method to estimate the information\nin oscillatory activity on limited amounts of data without explicitly modeling the data.\n12\n\n\fFigure 8: Estimating Information rate using spike de-jittering method. A Information rate as a function of bin width for single spikes obtained by formula (14) after spike de-jittering (circles): Using\na reference oscillation φ0 (t) = f * t, individual spikes have been shifted by the phase-dependent\namount φ0 − φ(t)/(2πf ). The obtained information rate is comparable to the one obtained by the\nmulticonditional method (diamonds). B Extrapolation of the information estimate in A to infinite\nnumber of trials.\n\n6\n6.1\n\nDiscussion\nPhase transmission versus phase coding\n\nThe phenomenon we have focused on in this paper is phase coupling of oscillatory neural activity between input and output of a neuron that also responds to an externally defined stimulus. Specifically,\nwe proposed a model and a method to measure information transmission rates if the oscillations are\nnot locked to the stimulus. In the phase transmission we consider, each spike provides information\nabout the external stimulus and about the phase of the input oscillation. The appropriate measure\nfor the information rate in this transmission process is I(spike; s, φ).\nIt is important to emphasize how phase transmission is different from a traditional spike phase code\nand how both schemes are related. In a spike phase code, such as in place fields of the hippocampus, information is encoded by relative shifts of spikes with respect to a reference oscillation (theta\nwaves). To read off the relative phases, the receiver has also to have independent access to the\noscillatory reference signal. Accordingly, the transmitted information rate should be measured by\nI(spike, φ; s), where φ are the relative phases between spikes and reference signal. Once oscillations are used to phase-encode information, one can ask how neurons downstream can pick up\nphase structure in the spike trains, carrying either phase encoded information or the reference signal, and reliably reproduce (or transmit) it in their output. This type of phase transmission we have\ninvestigated in oscillatory LGN cells.\nTwo recent studies provide evidence for additional phase-coded information in the visual system,\nhowever with respect to stimulus-locked oscillations: Montemurro et al. [MRM+ 08] have shown\nthat the spike phase relative to slow (< 12 Hz) oscillations in the local field potential of V1 which\nare locked to the stimulus carries additional stimulus information. Masse and Cook [MC08] have\nshown that the spike phase in MT relative to oscillations which are driven by the stimulus frame\nrefresh carries additional information. It has been an open question whether spike phases relative\nto spontaneous oscillations that are not locked to the stimulus encode additional information. For\nthe LGN data we have provided evidence that phase information is reliably transmitted. However,\nwhat type of phase code is employed and what information is encoded has not been addressed in\nthis paper.\n6.2\n\nPotential artifacts and sources of bias in parameter estimation\n\nOscillatory artifacts due to line noise or due to frame and refresh rates in the monitor are of concern\nin all studies involving oscillations in neural responses to visual stimuli. Therefore, controls have\n13\n\n\fto be conducted. To control for line noise one can search for spectral peaks centered at the line\nfrequency of 60 Hz. Weak line noise artifacts were visible in some of the raw membrane recordings, however, never in the spike or EPSP trains we extracted. Further, artifacts in the membrane\nvoltage were always easy to discern from true spectral peaks by their narrow width. To control\nfor monitor artifacts one can use the monitor refresh signal in the phase locking analysis described\nin Section 3.2.2. The resulting phase distributions were flat. Furthermore, we observed that the\noscillations persisted in spontaneous spiking activity when the eye was closed (data not shown).\nFurther, one has to exclude that the procedure described in Section 3.2.2 for estimating an oscillation\nphase from intracellular recordings introduces \"false\" phase locking between inputs and outputs of\nthe LGN cells. The phase estimation can in fact become noisy if the event rates become low and\nerrors in the event detection can introduce biases. In our case, however, the event rates where quite\nhigh, above 30 spikes/second on average (see Fig. 2A). Furthermore, the main imperfection in the\nevent detection (to miss input events near spikes) would weaken the phase locking effect and not\nintroduce false ones.\nIf the information rate is estimated with limited data it is possible that the oscillations are not fully\naveraged out in the PSTH. If the frequency bands of oscillations and stimulus-locked modulation\nare separated, the standard practice of using low-pass filtering in computing the PSTH (Section 3.1)\nreduces this effect already significantly. Potential residual oscillations in the PSTH lead to overestimation of the information in the stimulus-dependent rate modulation. Note that this potential bias\ndoes not introduce an artifactual information gain due to oscillations. Actually, it would work against\nfinding a significant gain in information through the oscillatory activity because the overestimated\nquantity is subtracted.\n6.3\n\nRelations between our methods and earlier work\n\nThe QPG model we devised to describe phase locking of neural responses to an oscillatory input\nis related to some earlier models. In the limit of zero bandwidth, the oscillation phase becomes\nφ(t) = f t and the QPG model (with constant visual input) degenerates to a modulated Gamma\nprocess with a cyclic trend [Ber81]. Koyama and Shinomoto have proposed a model for oscillatory\nspike trains that uses 1 + σ cos(φ) instead of the von Mises function as the factor to convey an\noscillatory trend [KS05]. We chose the von Mises distribution to model phase modulations since\nit is the highest entropy distribution for a given phase concentration and is able to model arbitrary\nphase concentrations. In contrast, the Koyama and Shinomoto (KS) model is limited to describing\nphase concentrations below κ = 1.2 corresponding to a circular variance of var(φ) = .75, even for\nmaximal modulation σ. This limitation of the KS model can be easily verified using Eq. (8)-(10).\nWe have derived the multiconditional information rate (16) to measure the information rate through\nsingle spikes in a neuron that experiences two simultaneous influences, a stimulus-locked rate modulation and a periodic rate modulation that is not locked to the stimulus. This method is an extension\nof the direct method applied to single-spike events (14) [RWvSB99, BSK+ 00].\n6.4\n\nFunctional roles of spontaneous oscillations\n\nIf the observed oscillations are ongoing and contain no stimulus-dependent modulation, the QPG\nmodel performs an operation similar to amplitude modulation (AM) in a radio broadcast signal: The\nstimulus-dependent rate λs corresponds to the modulation signal, the oscillations correspond to the\nhigh-frequency carrier in an AM signal. Analogous to broadcast transmission, the stimulus signal\nis modulated into the high-frequency band. However, unlike in a radio signal, the low frequency\nsignal is still present in the spike train (because the multiplication is between two positive rate functions in the QPG model and therefore the resulting signal has no symmetric amplitude envelope).\nThus, the spike train contains the stimulus signal twice, it can either be decoded by low pass filtering (usual method of rate decoding) or by band pass filtering. If the frequencies of the stimulus\nand the frequency of the ongoing oscillations are well separated, they can be transmitted and read\nout independently from each other. Furthermore, the low-pass and the band-pass signal are robust\nto different types of noise. Therefore, this redundant coding scheme could be used to achieve a\nmore reliable readout of the stimulus signal downstream. For example, band pass filtering could be\nrealized by tuned intrinsic subthreshold oscillations [Now97, HY00, FHM+ 01, TFS08].\n14\n\n\fIn addition to robustness, oscillatory structure of the afferent input into cortex could subserve various\nother functions. First, it can support time-windowing in the readout for reducing crosstalk from all\nother neural activity (that does not share the oscillation). Second, common oscillations in different\ncells can produce synchrony between LGN spikes which has been shown to improve the success\nrate to activate cortical cells [UAR00, BS06], for a model, see [KTG+ 04]. Third, it can enable\noscillatory top-down attentional mechanisms to select between specific input streams [FNS07].\n\n6.5\n\nRoles and coding mechanisms of stimulus-influenced oscillations\n\nIf the oscillations are stimulus-influenced, although not stimulus-locked, they carry information\nabout the stimulus. If this information were overlapping or identical with the information in λs , this\nredundancy could serve similar functions as described for stimulus-independent ongoing oscillations. However, if the information carried in the oscillations would represent stimulus properties not\nconveyed by λs , the oscillations would enable a multiplexing in spike trains, that is, two different\nsignals could be carried by one spike train as seen e.g. in the olfactory system [SJL03]. The multiplex scheme could employ a number of different encoding schemes. For example, the coherence of a\nspike train could be modulated or the phase of neural oscillations or of spikes relative to these oscillations could encode additional stimulus information [GKES89, NS96, SZBB06, MRM+ 08, MC08].\nThe QPG model does not explicitly model how additional stimulus properties are encoded in the\noscillatory signal. Nevertheless, we can use the QPG model to estimate the information that can\nbe submitted using the oscillations as an additional information channel. Using a simple backof-an-envelope calculation we can estimate the information in a phase code that synchronizes the\noscillations (and thus the spikes) of two cells [GKES89, NS96, SZBB06] in a population of neurons.\nSince the oscillations in the fitted model have a bandwidth of σf = 2Hz, phase alignments cannot\nbe instantaneous: The maximum relative phase adjustment necessary to synchronize two cells takes\nabout 125 ms and is therefore within the behaviorally relevant range. Even with a conservative\ninformation estimate of 1 bit per cell in 125 ms (corresponding to two possible phases for say figure\nand ground), the encoded information would be about 8 bit/s and therefore comparable to the rateencoded information of 9 bit/s (0.45 bit/spike at a typical rate of 20 spikes/s). Thus, the oscillationbased channel can encode stimulus information in the oscillation phase that is independent from the\ntype of information conveyed by the rate.\nIf such an additional oscillation-based information channel exists in the early visual system, the\nmost interesting question is, of course, what properties of the stimulus the channel conveys. So far,\nthis question has not be answered for the early mammal visual system. However, a recent study\nof the impact of retinal oscillations on the behavior of frogs suggest the intriguing possibility that\nretinal oscillations could encode nonlocal information such as spatial or temporal stimulus context\n[IGHT05].\n\n7\n\nSummary\n\nThe paper presented new theoretical tools for studying the functional roles of oscillatory activity in\nthe brain. To simulate oscillatory spike trains that are phase-locked to an oscillatory influence that\nis not stimulus-locked we described the quasi-periodic gamma (QPG) model. This model generates\nspikes using an inhomogeneous Gamma process modulated by the product of a stimulus-influenced\nrate and a quasi-periodic von Mises distribution. The QPG model can be fitted to oscillatory recordings in the LGN of the cat and reproduces the main characteristics of the data, such as ISI histogram,\noscillation score and spike-phase histograms. To capture the information in the spike train about oscillations that are not locked to the stimulus, we propose the multiconditional direct method (16), a\ngeneralization of the direct method applied to single-spike events [RWvSB99, BSK+ 00]. We estimated information rates in oscillatory LGN cells and discussed the possible consequences from our\nfinding that oscillations contribute significantly to the information carried in the spike train. However, the proposed computational methods are not confined to visual neurons, they are general tools\nfor investigating the transmission of oscillatory structure in neural activity in the brain.\n15\n\n\fAcknowledgments: We thank J. Hirsch, X. Wang, and V. Vaingankar, University of Southern California, for numerous helpful discussions and for permitting the use of their experimental data. We\nalso thank Tim Blanche and Charles Cadieu for valuable comments on the manuscript. The comments of two anonymous reviewers improved the manuscript substantially. This work has been\nsupported by NSF grant IIS-0713657. The data analysis and simulations were computed using\nIPython [PG07] and NumPy/SciPy [Oli07], all figures were produced using Matplotlib [BHM+ 05].\nReferences\n[Adr42]\n\nED Adrian. Olfactory reactions in the brain of the hedgehog. The Journal of Physiology,\n100(4):459–73, 1942.\n[AMG+ 05] Z.N. Aldworth, J.P. Miller, T. Gedeon, G.I. Cummins, and A.G. Dimitrov. Dejittered SpikeConditioned Stimulus Waveforms Yield Improved Estimates of Neuronal Feature Selectivity and\nSpike-Timing Precision of Sensory Interneurons. Journal of Neuroscience, 25(22):5323–32,\n2005.\n[AV90]\nE. Ahissar and E. Vaadia. Oscillatory activity of single units in a somatosensory cortex of an\nawake monkey and their possible role in texture analysis. Proceedings of the National Academy\nof Sciences of the United States of America, 87(22):8935–9, 1990.\n[BBV+ 02] E.N. Brown, R. Barbieri, V. Ventura, R.E. Kass, and L.M. Frank. The Time-Rescaling Theorem\nand Its Application to Neural Spike Train Data Analysis. Neural Computation, 14(2):325–346,\n2002.\n[Ber81]\nM. Berman. Inhomogeneous and Modulated Gamma Processes. Biometrika, 68(1):143–52, 1981.\n[BFK57]\nHB Barlow, R. Fitzhugh, and SW Kuffler. Change of organization in the receptive fields of the\ncat's retina during dark adaptation. The Journal of Physiology, 137(3):338–54, 1957.\n[BHM+ 05] P. Barrett, J. Hunter, JT Miller, J.C. Hsu, and P. Greenfield. matplotlib–A Portable Python Plotting Package. Astronomical Data Analysis Software and Systems XIV ASP Conference Series,,\n347:91–95, 2005.\n[BQF+ 01] R. Barbieri, M.C. Quirk, L.M. Frank, M.A. Wilson, and E.N. Brown. Construction and analysis\nof non-Poisson stimulus-response models of neural spiking activity. Journal of Neuroscience\nMethods, 105(1):25–37, 2001.\n[BS06]\nR.M. Bruno and B. Sakmann. Cortex Is Driven by Weak but Synchronously Active Thalamocortical Synapses. Science, 312(5780):1622–1627, 2006.\n[BSK+ 00] N. Brenner, S.P. Strong, R. Koberle, W. Bialek, and R.R.R. Steveninck. Synergy in a Neural\nCode. Neural Computation, 12(7):1531–52, 2000.\n[BT99]\nA. Borst and F.E. Theunissen. Information theory and neural coding. Nature Neuroscience,\n2:947–57, 1999.\n[CBNS98] M. Castelo-Branco, S. Neuenschwander, and W. Singer. Synchronization of Visual Responses\nbetween the Cortex, Lateral Geniculate Nucleus, and Retina in the Anesthetized Cat. Journal of\nNeuroscience, 18(16):6395–410, 1998.\n[EP75]\nR. Eckhorn and B. Popel. Rigorous and extended application of information theory to the afferent\nvisual system of the cat. II. Experimental results. Biol Cybern, 17(1):71–7, 1975.\n[FHM+ 01] J.M. Fellous, AR Houweling, RH Modi, RPN Rao, PHE Tiesinga, and TJ Sejnowski. Frequency\nDependence of Spike Timing Reliability in Cortical Pyramidal Cells and Interneurons. Journal\nof Neurophysiology, 85(4):1782–1787, 2001.\n[FNS07]\nP. Fries, D. Nikolić, and W. Singer. The gamma cycle. Trends in Neurosciences, 30(7):309–16,\n2007.\n[Fre72]\nWJ Freeman. Measurement of oscillatory responses to electrical stimulation in olfactory bulb of\ncat. Journal of Neurophysiology, 35(6):762–779, 1972.\n[GKES89] C.M. Gray, P. Koenig, A.K. Engel, and W. Singer. Oscillatory responses in cat visual cortex exhibit inter-columnar synchronization which reflects global stimulus properties. Nature,\n338(6213):334–337, 1989.\n[GT90]\nA. Gelperin and D.W. Tank. Odour-modulated collective network oscillations of olfactory interneurons in a terrestrial mollusc. Nature, 345(6274):437–440, 1990.\n[HB66]\nWD Heiss and H. Bornschein. Multimodal interval histograms of the continuous activity of\nretinal cat neurons. Kybernetik, 3(4):187–91, 1966.\n[HH52]\nA.L. Hodgkin and AF Huxley. Currents carried by sodium and potassium ions through the membrane of the giant axon of Loligo. J. Physiol, 116(4):449–472, 1952.\n[HY00]\nB. Hutcheon and Y. Yarom. Resonance, oscillation and the intrinsic frequency preferences of\nneurons. Trends in Neurosciences, 23(5):216–222, 2000.\n\n16\n\n\f[IGHT05]\n\nH. Ishikane, M. Gangi, S. Honda, and M. Tachibana. Synchronized retinal oscillations encode\nessential information for escape behavior in frogs. Nat Neurosci, 8(8):1087–95, 2005.\n[JM01]\nMR Jarvis and PP Mitra. Sampling Properties of the Spectrum and Coherency of Sequences of\nAction Potentials. Neural Computation, 13(4):717–49, 2001.\n[KFB57]\nSW Kuffler, R. Fitzhugh, and HB Barlow. Maintained activity in the cat's retina in light and\ndarkness. J Gen Physiol, 40(5):683–702, 1957.\n[KS05]\nS. Koyama and S. Shinomoto. Empirical Bayes interpretations of random point events. Journal\nof Physics A: Mathematical and General, 38(29):L531–L537, 2005.\n[KTG+ 04] G.T. Kenyon, J. Theiler, J.S. George, B.J. Travis, and D.W. Marshak. Correlated firing improves\nstimulus discrimination in a retinal model. Neural Computation, 16(11):2261–91, 2004.\n[KWV+ 08] K. Koepsell, X. Wang, V. Vaingankar, Y. Wei, Q. Wang, D.L. Rathbun, W.M. Usrey, J.A. Hirsch,\nand F.T. Sommer. Retinal oscillations carry visual information to cortex. submitted, 2008.\n[LD94]\nG. Laurent and H. Davidowitz. Encoding of Olfactory Information with Oscillating Neural Assemblies. Science, 265(5180):1872–75, 1994.\n[LV67]\nM. Laufer and M. Verzeano. Periodic activity in the visual system of the cat. Vision Res, 7(3):215–\n29, 1967.\n[MC08]\nN.Y. Masse and E.P. Cook. The Effect of Middle Temporal Spike Phase on Sensory Encoding and\nCorrelates with Behavior during a Motion-Detection Task. Journal of Neuroscience, 28(6):1343,\n2008.\n[MHKS84] J. Munemori, K. Hara, M. Kimura, and R. Sato. Statistical features of impulse trains in cat's\nlateral geniculate neurons. Biological Cybernetics, 50(3):167–172, 1984.\n[MJM+ 08] R.C. Muresan, O.F. Jurjut, V.V. Moca, W. Singer, and D. Nikolic. The Oscillation Score: An\nEfficient Method for Estimating Oscillation Strength in Neuronal Activity. Journal of Neurophysiology, 99(3):1333–53, 2008.\n[MRM+ 08] M.A. Montemurro, M.J. Rasch, Y. Murayama, N.K. Logothetis, and S. Panzeri. Phase-of-Firing\nCoding of Natural Visual Stimuli in Primary Visual Cortex. Current Biology, 8(5):375–80, 2008.\n[Now97]\nLG Nowak. Influence of low and high frequency inputs on spike timing in visual cortical neurons.\nCerebral Cortex, 7(6):487–501, 1997.\n[NS96]\nS. Neuenschwander and W. Singer. Long-range synchronization of oscillatory light responses in\nthe cat retina and lateral geniculate nucleus. Nature, 379(6567):728–33, 1996.\n[OBL66]\nT. Ogawa, P. O. Bishop, and W. R. Levick. Cortex Is Driven by Weak but Synchronously Active\nThalamocortical Synapses. Journal of Neurophysiology, 29:1–30, 1966.\n[Oli07]\nT.E. Oliphant. Python for Scientific Computing. Computing in Science & Engineering, 9(3):10–\n20, 2007.\n[OR93]\nJ. OKeefe and M.L. Recce. Phase relationship between hippocampal place units and the EEG\ntheta rhythm. Hippocampus, 3(3):317–30, 1993.\n[PG07]\nF. Pérez and B.E. Granger. IPython: A System for Interactive Scientific Computing. Computing\nin Science & Engineering, 9(3):21–29, 2007.\n[PGM67]\nD.H. Perkel, G.L. Gerstein, and G.P. Moore. Neuronal Spike Trains and Stochastic Point Processes: I. The Single Spike Train. Biophysical Journal, 7(4):391–418, 1967.\n[Rod67]\nR.W. Rodieck. Maintained activity of cat retinal ganglion cells. Journal of Neurophysiology,\n5:1043–1071, 1967.\n[ROS90]\nBJ Richmond, LM Optican, and H. Spitzer. Temporal encoding of two-dimensional patterns by\nsingle units in primate primary visual cortex. I. Stimulus-response relations. Journal of Neurophysiology, 64(2):351–69, 1990.\n[RWvSB99] F. Rieke, D. Warland, R.R. van Steveninck, and W. Bialek. Spikes: exploring the neural code.\nMIT Press, Cambridge, 1999.\n[SBA03]\nM. Szwed, K. Bagdasarian, and E. Ahissar. Encoding of Vibrissal Active Touch. Neuron,\n40(3):621–630, 2003.\n[SJL03]\nM. Stopfer, V. Jayaraman, and G. Laurent. Intensity versus Identity Coding in an Olfactory\nSystem. Neuron, 39(6):991–1004, 2003.\n[SL03]\nM. Sahani and J.F. Linden. Evidence Optimization Techniques for Estimating Stimulus-Response\nFunctions. In K. Obermayer S. Becker, S. Thrun, editor, Advances in Neural Information Processing Systems 15: Proceedings of the 2002 Conference, pages 109–16. MIT Press, 2003.\n[SZBB06] J.M. Samonds, Z. Zhou, M.R. Bernard, and AB Bonds. Synchronous Activity in Cat Visual\nCortex Encodes Collinear and Cocircular Contours. Journal of Neurophysiology, 95(4):2602–\n2616, 2006.\n[TFS08]\nP. Tiesinga, J.M. Fellous, and T.J. Sejnowski. Regulation of spike timing in visual cortical circuits.\nNature Reviews Neuroscience, 9(2):97–107, 2008.\n\n17\n\n\f[Tuc88]\n[UAR00]\n\nH.C. Tuckwell. Introduction to Theoretical Neurobiology. Cambridge University Press, 1988.\nW.M. Usrey, J.M. Alonso, and R.C. Reid. Synaptic Interactions between Thalamic Inputs to\nSimple Cells in Cat Visual Cortex. Journal of Neuroscience, 20(14):5461, 2000.\n[WWV+ 07] X. Wang, Y. Wei, V. Vaingankar, Q. Wang, K. Koepsell, F.T. Sommer, and J.A. Hirsch. Feedforward Excitation and Inhibition Evoke Dual Modes of Firing in the Cat's Visual Thalamus during\nNaturalistic Viewing. Neuron, 55(3):465–78, 2007.\n\n18\n\n\f"}