{"id": "http://arxiv.org/abs/0809.4949v1", "guidislink": true, "updated": "2008-09-29T11:56:31Z", "updated_parsed": [2008, 9, 29, 11, 56, 31, 0, 273, 0], "published": "2008-09-29T11:56:31Z", "published_parsed": [2008, 9, 29, 11, 56, 31, 0, 273, 0], "title": "DNS of the kappa-mechanism", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0809.3419%2C0809.2403%2C0809.2738%2C0809.2881%2C0809.0478%2C0809.1024%2C0809.2345%2C0809.4252%2C0809.0564%2C0809.0729%2C0809.5114%2C0809.3085%2C0809.2649%2C0809.0604%2C0809.0122%2C0809.3188%2C0809.0586%2C0809.0325%2C0809.2428%2C0809.2943%2C0809.2809%2C0809.4285%2C0809.2458%2C0809.3235%2C0809.4641%2C0809.4525%2C0809.1577%2C0809.1797%2C0809.4545%2C0809.2385%2C0809.0686%2C0809.5137%2C0809.4419%2C0809.3758%2C0809.1895%2C0809.4554%2C0809.4377%2C0809.4251%2C0809.2144%2C0809.0488%2C0809.4522%2C0809.5033%2C0809.1251%2C0809.2695%2C0809.1103%2C0809.2064%2C0809.4899%2C0809.3131%2C0809.2748%2C0809.1277%2C0809.5104%2C0809.0693%2C0809.2133%2C0809.2350%2C0809.1482%2C0809.0198%2C0809.3745%2C0809.0520%2C0809.4228%2C0809.4651%2C0809.0521%2C0809.3473%2C0809.1405%2C0809.4095%2C0809.1077%2C0809.4352%2C0809.1122%2C0809.2600%2C0809.2332%2C0809.4783%2C0809.5022%2C0809.3859%2C0809.4262%2C0809.2285%2C0809.1096%2C0809.4714%2C0809.3186%2C0809.2053%2C0809.2978%2C0809.1247%2C0809.3138%2C0809.4949%2C0809.4488%2C0809.4349%2C0809.3812%2C0809.3594%2C0809.4259%2C0809.4430%2C0809.3049%2C0809.0685%2C0809.0900%2C0809.2618%2C0809.2542%2C0809.2399%2C0809.0854%2C0809.0269%2C0809.3713%2C0809.3337%2C0809.0837%2C0809.2536%2C0809.2739&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "DNS of the kappa-mechanism"}, "summary": "We present a purely-radiative hydrodynamic model of the kappa-mechanism that\nsustains radial oscillations in Cepheid variables. We determine the physical\nconditions favourable for the kappa-mechanism to occur by the means of a\nconfigurable hollow in the radiative conductivity profile. By starting from\nthese most favourable conditions, we complete nonlinear direct numerical\nsimulations (DNS) and compare them with the results given by a linear-stability\nanalysis of radial modes. We find that well-defined instability strips are\ngenerated by changing the location and shape of the conductivity hollow. For a\ngiven position in the layer, the hollow amplitude and width stand out as the\nkey parameters governing the appearance of unstable modes driven by the\nkappa-mechanism. The DNS confirm both the growth rates and structures of the\nlinearly-unstable modes. The nonlinear saturation that arises is produced by\nintricate couplings between the excited fundamental mode and higher damped\novertones. These couplings are measured by projecting the DNS fields onto an\nacoustic subspace built from regular and adjoint eigenvectors and a 2:1\nresonance is found to be responsible for the saturation of the kappa-mechanism\ninstability.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0809.3419%2C0809.2403%2C0809.2738%2C0809.2881%2C0809.0478%2C0809.1024%2C0809.2345%2C0809.4252%2C0809.0564%2C0809.0729%2C0809.5114%2C0809.3085%2C0809.2649%2C0809.0604%2C0809.0122%2C0809.3188%2C0809.0586%2C0809.0325%2C0809.2428%2C0809.2943%2C0809.2809%2C0809.4285%2C0809.2458%2C0809.3235%2C0809.4641%2C0809.4525%2C0809.1577%2C0809.1797%2C0809.4545%2C0809.2385%2C0809.0686%2C0809.5137%2C0809.4419%2C0809.3758%2C0809.1895%2C0809.4554%2C0809.4377%2C0809.4251%2C0809.2144%2C0809.0488%2C0809.4522%2C0809.5033%2C0809.1251%2C0809.2695%2C0809.1103%2C0809.2064%2C0809.4899%2C0809.3131%2C0809.2748%2C0809.1277%2C0809.5104%2C0809.0693%2C0809.2133%2C0809.2350%2C0809.1482%2C0809.0198%2C0809.3745%2C0809.0520%2C0809.4228%2C0809.4651%2C0809.0521%2C0809.3473%2C0809.1405%2C0809.4095%2C0809.1077%2C0809.4352%2C0809.1122%2C0809.2600%2C0809.2332%2C0809.4783%2C0809.5022%2C0809.3859%2C0809.4262%2C0809.2285%2C0809.1096%2C0809.4714%2C0809.3186%2C0809.2053%2C0809.2978%2C0809.1247%2C0809.3138%2C0809.4949%2C0809.4488%2C0809.4349%2C0809.3812%2C0809.3594%2C0809.4259%2C0809.4430%2C0809.3049%2C0809.0685%2C0809.0900%2C0809.2618%2C0809.2542%2C0809.2399%2C0809.0854%2C0809.0269%2C0809.3713%2C0809.3337%2C0809.0837%2C0809.2536%2C0809.2739&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We present a purely-radiative hydrodynamic model of the kappa-mechanism that\nsustains radial oscillations in Cepheid variables. We determine the physical\nconditions favourable for the kappa-mechanism to occur by the means of a\nconfigurable hollow in the radiative conductivity profile. By starting from\nthese most favourable conditions, we complete nonlinear direct numerical\nsimulations (DNS) and compare them with the results given by a linear-stability\nanalysis of radial modes. We find that well-defined instability strips are\ngenerated by changing the location and shape of the conductivity hollow. For a\ngiven position in the layer, the hollow amplitude and width stand out as the\nkey parameters governing the appearance of unstable modes driven by the\nkappa-mechanism. The DNS confirm both the growth rates and structures of the\nlinearly-unstable modes. The nonlinear saturation that arises is produced by\nintricate couplings between the excited fundamental mode and higher damped\novertones. These couplings are measured by projecting the DNS fields onto an\nacoustic subspace built from regular and adjoint eigenvectors and a 2:1\nresonance is found to be responsible for the saturation of the kappa-mechanism\ninstability."}, "authors": ["T. Gastine", "B. Dintrans"], "author_detail": {"name": "B. Dintrans"}, "author": "B. Dintrans", "arxiv_comment": "4 pages, 5 figures, sf2a proceeding", "links": [{"href": "http://arxiv.org/abs/0809.4949v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0809.4949v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0809.4949v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0809.4949v1", "journal_reference": null, "doi": null, "fulltext": "SF2A 2008\n\narXiv:0809.4949v1 [astro-ph] 29 Sep 2008\n\nC. Charbonnel, F. Combes and R. Samadi (eds)\n\nDIRECT NUMERICAL SIMULATIONS OF THE κ-MECHANISM\nGastine, T. 1 and Dintrans, B.1\nAbstract. We present a purely-radiative hydrodynamic model of the κ-mechanism that sustains radial\noscillations in Cepheid variables. We determine the physical conditions favourable for the κ-mechanism to\noccur by the means of a configurable hollow in the radiative conductivity profile. By starting from these\nmost favourable conditions, we complete nonlinear direct numerical simulations (DNS) and compare them\nwith the results given by a linear-stability analysis of radial modes. We find that well-defined instability\nstrips are generated by changing the location and shape of the conductivity hollow. For a given position\nin the layer, the hollow amplitude and width stand out as the key parameters governing the appearance of\nunstable modes driven by the κ-mechanism. The DNS confirm both the growth rates and structures of the\nlinearly-unstable modes. The nonlinear saturation that arises is produced by intricate couplings between\nthe excited fundamental mode and higher damped overtones. These couplings are measured by projecting\nthe DNS fields onto an acoustic subspace built from regular and adjoint eigenvectors and a 2:1 resonance is\nfound to be responsible for the saturation of the κ-mechanism instability.\n\n1\n\nIntroduction\n\nEddington (1917) discovered an excitation mechanism of stellar oscillations that is related to the opacity in\nionisation regions: the κ-mechanism. This mechanism can only occur in regions of a star where the opacity\nvaries so as to block the radiative flux during compression phases (Zhevakin 1953; Cox 1958). Ionisation regions\ncorrespond to a strong increase in opacity, leading to the \"opacity bumps\" that are responsible for the local\ndriving of modes. These ionisation regions have nevertheless to be located in a very precise region of a star,\nneither too close to the surface nor to deep into the stellar core, in order to balance the damping that occurs in\nother regions. It defines the so-called transition region which is the limit between the quasi-adiabatic interior\nand the strongly non-adiabatic surface. For classical Cepheids that pulsate on the fundamental acoustic mode,\nthis transition region is located at a temperature T ≃ 40 000 K corresponding to the second helium ionisation\n(Baker & Kippenhahn 1965). However, the bump location is not solely responsible for the acoustic instability.\nA careful treatment of the κ-mechanism would involve dynamical couplings with convection, metallicity effects\nand realistic equations of state and opacity tables (Bono et al. 1999). The purpose of our model is to simplify\nthe hydrodynamic approach while retaining the leading order phenomenon -the opacity bump location- such\nthat feasible DNS of the κ-mechanism can be achieved.\n2\n\nHydrodynamic model\n\nWe focus our study on radial modes propagating in Cepheids and thus only consider the 1-D case. Our\nmodel represents a local zoom about an ionisation region and is composed by a monatomic and perfect gas\n(γ = cp /cv = 5/3), with both a constant gravity ~g and a constant kinematic viscosity ν. The ionisation region is\nrepresented by a parametric conductivity hollow that mimics a bump in opacity as (Gastine & Dintrans 2008a):\n\u0014\n\u0015\n−π/2 + arctan(σT + T − )\nKmax − Kmin\nK0 (T ) = Kmax 1 + A\nwith A =\nand T ± = T − Tbump ± e,\nπ/2 + arctan(σe2 )\nKmax\n\n(2.1)\n\nwhere Tbump is the hollow position in temperature, while σ, e and A denote its slope, width and relative\namplitude, respectively. Examples of common values of these parameters are provided in Fig. 1.\n1 Laboratoire d'Astrophysique de Toulouse-Tarbes, CNRS et Université de Toulouse, 14 avenue Edouard Belin, F-31400\nToulouse, France\nc\n\n\f238\n\nSF2A 2008\n\nFig. 1. Influence of the hollow parameters on the conductivity profile for Kmax = 10−2 and Tbump = 3.5: amplitude A\n(a), width e (b) and slope σ (c).\n\n3\n\nLinear stability analysis\n\nWe are interested in small perturbations about the hydrostatic and radiative equilibria. The layer is fully\nradiative and the radiative flux perturbation reads under the diffusion approximation:\n~ ′ − K ′ ∇T\n~ 0,\nF~ ′ = −K0 ∇T\n\n(3.1)\n\nwhere the \"0\" subscripts mean equilibrium quantities and primes denote Eulerian ones. The linearised perturbations obey to the following dimensionless equations:\n\n\n\nλT ′\n\n\n\n\n\n\n\n\nλu\n\n\n\n\n\n\n\n\n\n λR\n\n=\n\nγ\nρ0\n\n\u0012\n\u0013\nd2 T ′\ndu Fbot\ndK0 dT ′ d2 K0 ′\nK0 2 + 2\nT\n− (γ − 1)T0\nu,\n+\n+\n2\ndz\ndz dz\ndz\ndz\nK0\n\u0012\n\ndT ′\ndR\nd ln ρ0 ′\n+\nT + T0\ndz\ndz\ndz\n\n= −\n\nγ−1\nγ\n\n= −\n\ndu d ln ρ0\n−\nu,\ndz\ndz\n\n\u0013\n\n4\n+ ν\n3\n\n\u0012\n\nd2 u d ln ρ0 du\n+\ndz 2\ndz dz\n\n\u0013\n\n,\n\n(3.2)\n\nwhere R ≡ ρ′ /ρ0 denotes the density perturbation, u the velocity, Fbot the imposed bottom flux. We seek\nnormal modes of the form exp(λt) with λ = τ + iω (unstable modes correspond to τ > 0).\nIn order to investigate the influence of the hollow shape on stability, we fix the value of σ and vary the\nother parameters (Tbump , A and e). For each case, we first compute the equilibrium fields and second, the\neigenvalues with their corresponding eigenvectors are completed using the LSB spectral solver (Valdettaro et al.\n2007). Figure 2 displays the obtained instability strips for the fundamental mode and two main results appear:\n(i) a particular region in the layer (Tbump ∈ [1.8, 2.3]) favours the appearance of unstable modes; (ii) both a\nminimum width and amplitude (emin ≃ 0.15 and Amin ≃ 45%) are needed to destabilise the system.\n4\n\nDirect numerical simulations\n\nTo confirm the instability strips discovered previously in the linear-stability analysis, we perform direct numerical\nsimulations of the nonlinear problem. We start from the favourable initial conditions determined by the previous\nparametric surveys and advance in time the hydrodynamic equations thanks to the high-order finite-difference\nPencil Code2 .\n2 See\n\nhttp://www.nordita.org/software/pencil-code and Brandenburg & Dobler (2002).\n\n\fDNS of the κ-mechanism\n\n239\n\nFig. 2. Left panel : Instability strip for the fundamental mode in the plane (Tbump , A) for e = 0.4, σ = 7. Right panel :\nInstability strip for the fundamental mode in the plane (Tbump , e) for A = 50%, σ = 12.\n\nTo determine which modes are present in the DNS in the nonlinear-saturation regime, we first perform\na temporal Fourier transform of the momentum field ρu(z, t) and plot the resulting power spectrum in the\n(z, ω)-plane (Fig. 3a, left). With this method, acoustic modes are extracted because they emerge as \"shark fin\nprofiles\" about definite eigenfrequencies (Dintrans & Brandenburg 2004). We next integrate ρc\nu(z, ω) over depth\nto obtain the mean spectrum (Fig. 3b, left). Several discrete peaks corresponding to normal modes appear but\nthe fundamental mode close to ω0 = 5.439 clearly dominates. Finally, the linear eigenfunctions are compared to\nthe mean profiles computed from a zoom taken in the DNS power spectrum about eigenfrequencies ω0 = 5.439\nand ω2 = 11.06 (Fig. 3c, left).The agreement between the linear-stability analysis (eigenfunctions in dotted blue\nlines) and the DNS (profiles in solid black lines) is remarkable. In summary, Fig. 3 (left) shows that several\novertones are present in this DNS, even for long times. However, because these overtones are linearly stable,\nsome underlying energy transfers must occur between modes through nonlinear couplings.\nTo study this nonlinear interaction, we adopt a powerful method already used to study the sound generation\nby airplanes in aeroacoustics or by compressible convection in astrophysics (Bogdan et al. 1993). It is based on\nthe projection of the DNS fields onto a basis shaped from the regular and adjoint eigenvectors that are solutions\nto the linear-oscillation equations. By using projections onto these two respective sets of eigenvectors, the time\nevolution of each acoustic mode propagating in the DNS is obtained. The kinetic energy content of each mode is\nalso available in this formalism, highlighting the energy transfer between modes. As our problem only consists\nin an initially static radiative zone, the velocity field that develops is only due to acoustic modes, that is,\ntot\nEkin\n= Ewaves =\n\n∞\nX\n\nEn ,\n\n(4.1)\n\nn=0\n\nwhere En , is the energy contained in the n-acoustic mode.\ntot\nThe right panel of Fig. 3 displays the time evolution of the kinetic energy content En /Ekin\nfor n ∈ J0, 6K.\nAfter the linear transient growth of the fundamental mode, a given fraction of energy is progressively transferred\nto upper overtones and the nonlinear saturation is achieved above t ≃ 150. These nonlinear couplings mainly\ninvolve the n = 0 and n = 2 modes because their energy ratios are dominant (more than 98% of the total\nenergy). The reason for this favored coupling lies in the period ratio existing between these two modes: the\nfundamental period is P0 = 2π/ω0 ≃ 1.155, while the n = 2 one is P2 ≃ 0.568 such that the corresponding period\nratio is close to one half (P2 /P0 ≃ 0.491). This n = 2 mode, which represents about 10% of the total kinetic\nenergy, is involved in the nonlinear saturation of the κ-mechanism instability through a 2:1 resonance with the\nfundamental mode. Such a resonance is usual in celestial mechanics with, e.g., Jupiter's moons Io (P = 1.769d),\nEuropa (P = 3.551d) and Ganymede (P = 7.154d) and it is well known that it helps to stabilise orbits. In our\ncase, this stabilisation takes the form of a nonlinear saturation: the linear growth of the fundamental mode is\nbalanced by the pumping of energy from the linearly-stable second overtone behaving in that case as an energy\nsink, leading to the full limit-cycle stability.\n\n\f240\n\nSF2A 2008\n\nFig. 3. Left panel : a) Temporal power spectrum for the momentum in the (z, ω) plane. b) The resulting mean spectrum\nafter integrating in depth. c) Comparison between normalised momentum profiles for n = (0, 2) modes according to\nthe DNS power spectrum (solid black lines) and the linear-stability analysis (dotted blue lines). Right panel : a) Kinetic\nenergy ratio for n ∈ J0, 6K in a logarithmic y-scale. b) Zoom for the n = 0 and n = 2 modes only.\n\n5\n\nConclusion\n\nDirect numerical simulations (DNS) of the κ-mechanism that excite stellar oscillations are performed. We first\ncompute the most favourable setups using a linear-stability analysis of radial modes propagating in a 1-D layer\nof gas. In our model, a configurable hollow in the radiative conductivity profile mimics the opacity bump\nresponsible for the layer destabilisation. The instability strips found in the linear study are outstandingly\nconfirmed by the DNS and we show that the nonlinear saturation that arises involves a 2:1 resonance between\nthe linearly-unstable fundamental mode and the linearly-stable second overtone.\nReferences\nBaker, N. & Kippenhahn, R. 1962, Zeitschrift für Astrophysik, 54, 114\nBogdan, T. J., Cattaneo, F., & Malagoli, A. 1993, ApJ, 407, 316\nBono, G., Marconi, M., & Stellingwerf, R. F. 1999, ApJS, 122, 167\nBrandenburg, A. & Dobler, W. 2002, CoPhC, 147, 471 [arXiv:astro-ph/0111569]\nCox, J. P. 1958, ApJ, 127, 194\nDintrans, B. & Brandenburg, A. 2004, A&A, 421, 775 [arXiv:astro-ph/0311094]\nEddington, A. S. 1917, The Observatory, 40, 290\nGastine, T. & Dintrans, B. 2008, A&A, 484, 29 [arXiv:astro-ph/0711.1276]\nGastine, T. & Dintrans, B. 2008, A&A, in press [arXiv:astro-ph/0804.0345]\nValdettaro, L., Rieutord, M., Braconnier, T. & Fraysse, V. 2007, JCoAM, 205, 382 [arXiv:physics/0604219]\nZhevakin, S. A. 1953, Russ. A. J., 30, 161\n\n\f"}