{"id": "http://arxiv.org/abs/0706.0848v1", "guidislink": true, "updated": "2007-06-06T15:52:26Z", "updated_parsed": [2007, 6, 6, 15, 52, 26, 2, 157, 0], "published": "2007-06-06T15:52:26Z", "published_parsed": [2007, 6, 6, 15, 52, 26, 2, 157, 0], "title": "Generation of different Bell states within the SPDC phase-matching\n  bandwidth", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0706.0099%2C0706.3923%2C0706.0185%2C0706.4257%2C0706.0951%2C0706.0958%2C0706.3042%2C0706.1412%2C0706.1094%2C0706.3032%2C0706.3770%2C0706.2185%2C0706.3579%2C0706.0848%2C0706.2674%2C0706.1188%2C0706.0060%2C0706.1504%2C0706.1643%2C0706.3298%2C0706.2771%2C0706.1688%2C0706.2271%2C0706.0436%2C0706.0575%2C0706.3460%2C0706.1949%2C0706.3550%2C0706.4285%2C0706.0353%2C0706.2127%2C0706.2847%2C0706.1713%2C0706.0888%2C0706.2954%2C0706.3987%2C0706.2392%2C0706.3983%2C0706.3252%2C0706.4455%2C0706.3572%2C0706.2464%2C0706.1190%2C0706.0559%2C0706.0744%2C0706.1675%2C0706.4085%2C0706.2202%2C0706.1853%2C0706.4046%2C0706.3426%2C0706.2496%2C0706.0422%2C0706.1736%2C0706.4394%2C0706.1793%2C0706.3753%2C0706.3148%2C0706.1654%2C0706.4004%2C0706.4036%2C0706.0344%2C0706.1038%2C0706.2064%2C0706.2522%2C0706.2600%2C0706.2147%2C0706.1340%2C0706.3011%2C0706.3338%2C0706.2614%2C0706.3894%2C0706.2968%2C0706.3643%2C0706.3696%2C0706.2568%2C0706.0167%2C0706.2387%2C0706.2944%2C0706.0909%2C0706.3017%2C0706.3084%2C0706.1506%2C0706.0696%2C0706.2977%2C0706.0730%2C0706.1890%2C0706.2427%2C0706.2469%2C0706.0641%2C0706.0401%2C0706.1341%2C0706.0426%2C0706.3508%2C0706.1921%2C0706.2400%2C0706.2273%2C0706.3547%2C0706.3356%2C0706.3487%2C0706.1990&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Generation of different Bell states within the SPDC phase-matching\n  bandwidth"}, "summary": "We study the frequency-angular lineshape for a phase-matched nonlinear\nprocess producing entangled states and show that there is a continuous variety\nof maximally-entangled states generated for different mismatch values within\nthe natural bandwidth. Detailed considerations are made for two specific\nmethods of polarization entanglement preparation, based on type-II spontaneous\nparametric down-conversion (SPDC) and on SPDC in two subsequent type-I crystals\nproducing orthogonally polarized photon pairs. It turns out that different Bell\nstates are produced at the center of the SPDC line and on its slopes,\ncorresponding to about half-maximum intensity level. These Bell states can be\nfiltered out by either frequency selection or angular selection, or both. Our\ntheoretical calculations are confirmed by a series of experiments, performed\nfor the two above-mentioned schemes of producing polarization-entangled photon\npairs and with two kinds of measurements: frequency-selective and\nangular-selective.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0706.0099%2C0706.3923%2C0706.0185%2C0706.4257%2C0706.0951%2C0706.0958%2C0706.3042%2C0706.1412%2C0706.1094%2C0706.3032%2C0706.3770%2C0706.2185%2C0706.3579%2C0706.0848%2C0706.2674%2C0706.1188%2C0706.0060%2C0706.1504%2C0706.1643%2C0706.3298%2C0706.2771%2C0706.1688%2C0706.2271%2C0706.0436%2C0706.0575%2C0706.3460%2C0706.1949%2C0706.3550%2C0706.4285%2C0706.0353%2C0706.2127%2C0706.2847%2C0706.1713%2C0706.0888%2C0706.2954%2C0706.3987%2C0706.2392%2C0706.3983%2C0706.3252%2C0706.4455%2C0706.3572%2C0706.2464%2C0706.1190%2C0706.0559%2C0706.0744%2C0706.1675%2C0706.4085%2C0706.2202%2C0706.1853%2C0706.4046%2C0706.3426%2C0706.2496%2C0706.0422%2C0706.1736%2C0706.4394%2C0706.1793%2C0706.3753%2C0706.3148%2C0706.1654%2C0706.4004%2C0706.4036%2C0706.0344%2C0706.1038%2C0706.2064%2C0706.2522%2C0706.2600%2C0706.2147%2C0706.1340%2C0706.3011%2C0706.3338%2C0706.2614%2C0706.3894%2C0706.2968%2C0706.3643%2C0706.3696%2C0706.2568%2C0706.0167%2C0706.2387%2C0706.2944%2C0706.0909%2C0706.3017%2C0706.3084%2C0706.1506%2C0706.0696%2C0706.2977%2C0706.0730%2C0706.1890%2C0706.2427%2C0706.2469%2C0706.0641%2C0706.0401%2C0706.1341%2C0706.0426%2C0706.3508%2C0706.1921%2C0706.2400%2C0706.2273%2C0706.3547%2C0706.3356%2C0706.3487%2C0706.1990&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We study the frequency-angular lineshape for a phase-matched nonlinear\nprocess producing entangled states and show that there is a continuous variety\nof maximally-entangled states generated for different mismatch values within\nthe natural bandwidth. Detailed considerations are made for two specific\nmethods of polarization entanglement preparation, based on type-II spontaneous\nparametric down-conversion (SPDC) and on SPDC in two subsequent type-I crystals\nproducing orthogonally polarized photon pairs. It turns out that different Bell\nstates are produced at the center of the SPDC line and on its slopes,\ncorresponding to about half-maximum intensity level. These Bell states can be\nfiltered out by either frequency selection or angular selection, or both. Our\ntheoretical calculations are confirmed by a series of experiments, performed\nfor the two above-mentioned schemes of producing polarization-entangled photon\npairs and with two kinds of measurements: frequency-selective and\nangular-selective."}, "authors": ["G. Brida", "M. V. Chekhova", "M. Genovese", "L. A. Krivitsky"], "author_detail": {"name": "L. A. Krivitsky"}, "author": "L. A. Krivitsky", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevA.76.053807", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0706.0848v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0706.0848v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "submitted for publication", "arxiv_primary_category": {"term": "quant-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "quant-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0706.0848v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0706.0848v1", "journal_reference": "Physical Review A 76, 053807 (2007)", "doi": "10.1103/PhysRevA.76.053807", "fulltext": "Generation of different Bell states\nwithin the SPDC phase-matching bandwidth\nG. Brida, M. Genovese and L. A. Krivitsky\nIstituto Nazionale di Ricerca Metrologica, Strada delle Cacce 91, 10135 Torino, Italy\n\nM. V. Chekhova\n\narXiv:0706.0848v1 [quant-ph] 6 Jun 2007\n\nDepartment of Physics,\nM.V.Lomonosov Moscow State University,\nLeninskie Gory, 119992 Moscow, Russia\nWe study the frequency-angular lineshape for a phase-matched nonlinear process producing entangled\nstates and show that there is a continuous variety of maximally-entangled states generated for different\nmismatch values within the natural bandwidth. Detailed considerations are made for two specific\nmethods of polarization entanglement preparation, based on type-II spontaneous parametric downconversion (SPDC) and on SPDC in two subsequent type-I crystals producing orthogonally polarized\nphoton pairs. It turns out that different Bell states are produced at the center of the SPDC line and on\nits slopes, corresponding to about half-maximum intensity level. These Bell states can be filtered out\nby either frequency selection or angular selection, or both. Our theoretical calculations are confirmed\nby a series of experiments, performed for the two above-mentioned schemes of producing polarizationentangled photon pairs and with two kinds of measurements: frequency-selective and angular-selective.\nPACS numbers: 42.50.Dv, 03.67.Hk, 42.62.Eh\n\nI. INTRODUCTION\n\nSpontaneous Parametric Down-Conversion (SPDC)\nprovides the easiest way of generating polarizationentangled two-photon states, which are a fundamental\nresource for quantum communication or quantum computation [1], studies on foundations of quantum mechanics [2], quantum metrology [3], quantum imaging [4], etc.\nVarious experimental schemes can be used for this purpose [2]. The first efficient scheme suggested was the one\nbased on non-collinear type-II SPDC [6]. In this scheme,\nentangled two-photon states were generated in two angular (wavevector) modes and two polarization modes\n(polarization-wavevector entanglement). Later, 'interferometric' schemes were also proposed, where two crystals\nwere involved or two passages of the pump beam through\nthe same crystal. In most of these schemes, the set of\nmodes for entanglement also included two polarization\nmodes and two wavevector modes. Among numerous\nconfigurations, one should mention schemes with typeII crystals specially designed for the operation in the\nfemtosecond-pulsed regime [7, 8] and the scheme with\ntwo type-I crystals [9]. Less common but very useful for\ncertain applications are interferometric schemes that provide entanglement in a set of two frequency modes and\ntwo polarization modes (polarization-frequency entanglement) [10, 11].\nWe would like to emphasize that in all such experiments the goal was to achieve a certain Bell state generated within the whole bandwidth given by phase matching. By changing the settings of the optical elements,\nother Bell states can be obtained, but still for the whole\nphase-matched range of wavelengths and wavevectors. In\n\ntype-II-based schemes, this is provided by inserting a\nbirefringent optical element compensating for the delay\nbetween orthogonally polarized photons of an entangled\npair ('e-o delay compensation') [12]. Otherwise, entanglement is obtained only for the narrow frequency domain\naround exact degeneracy, selected by means of narrowband filters. In type-I schemes, e-o delay compensation\nor filtering are seemingly not necessary but, as we will\nshow further, still preferable since entanglement is not\nuniform over the whole bandwidth and changes on the\nslopes of the SPDC phase-matching line.\nIn this paper, we are interested in the fine structure\nof the phase-matching line from the viewpoint of various Bell states generation. We find that without the e-o\ndelay compensation, an interesting effect occurs within\nthe bandwidth for every phase-matched nonlinear process: the same phase mismatch that is responsible for\nthe intensity decrease induces a phase shift between the\ncomponents of the produced entangled state. In particular, we will discuss in detail the SPDC case. In this\ncase, we show that various maximally-entangled states\nand, in particular, two different Bell states are generated\nwithin the spectrum allowed by phase-matching and that\none can choose them by means of frequency or angular\nselection. This occurs for all schemes of polarizationentangled states generation - based on type-II phase\nmatching and based on the 'two type-I crystals' configuration - and involves both frequency or angular lineshapes\nof SPDC. For example, both for type II and 'two-type\nI' near-collinear production one finds inside the natuiφ\n|V Hi\n√\nral bandwidth maximally entangled states ( |HV i+e\n2\niφ\n\n|V V i\n√\nrespectively), whose relative phase beand |HHi+e\n2\ntween components, φ, ranges from 0 to π.\n\n\f2\nAfter a detailed theoretical discussion, we present experimental data demonstrating it in various cases.\nThe paper is organized as follows. In Section II, we\npresent the theory of the effect and describe a general scheme for its observation. In particular, the twodimensional (frequency-angular) spectrum of SPDC is\npresented, with the calculated domains of various Bell\nstates generation shown. Sections III and IV are devoted\nto the experimental observation of the effect. Section III\nis focused on the frequency spectrum of collinear SPDC,\nboth for type-II and 'two type-I' schemes. The effect is\nobserved in two ways: by scanning the frequency of one\nof the entangled photons and by scanning the arrivaltime difference of the pair, after transmitting it through\nan optical fibre. Section IV contains experimental results on the SPDC angular spectrum. In this group of\nmeasurements, also carried out both for type-II phase\nmatching and the 'two type-I configuration', switching\nbetween different Bell states is performed by scanning\nthe wavevector direction of one of the two photons. Finally, in Section V we draw the conclusions and discuss\npossible applications of the observed effect.\n\nII.1 Type II phase matching\n\nConsider first polarization-entangled photons produced via type-II SPDC in a homogeneous crystal of\nlength L from a cw pump with relatively large beam diameter a >> L tan θ, θ being the typical angle of scattering, so that exact transverse phase matching can be\nassumed [15]. Integration over the volume leads to a\ndelta-function of the transverse mismatch, δ (2) (k⊥ +k′⊥ ),\nand due to the strict frequency correlation between the\ntwo photons, integration over the modes k′ in Eq.(1) disappears. In the two-photon amplitude, only the longitudinal part of the wavevector mismatch is relevant, ∆z (k),\nwhere z is the direction along the pump wavevector. In\nterms of experimentally measurable quantities, integration in k means integration w.r.t. the angle of scattering\nand frequency of one of the photons belonging to the entangled pair. Further, assuming that the signal and idler\nphotons have wavevectors belonging to the plain of the\noptic axis and labeling them as o and e (ordinary and\nextraordinary), we can write the state as\n|Ψi =\n\nII. THEORY\n\n|Ψi =\n\ndkdk′\n\nZ\n\ndθ dΩe\n\ni ∆2z L\n\nsinc\n\n\u0012\n\n∆z L\n2\n\n\u0013\n\n×a†e (θ, ω0 + Ω)a†o (−θ, ω0 − Ω) |vaci ,\n\nLet us consider polarization-entangled two-photon\nstate generated via a phase-matched process, which can\nbe, for instance, SPDC or four-wave mixing [13]. Ignoring the vacuum component, we can write the state in the\ngeneral form (see, e.g., [14]),\nZ\n\nZZ\n\ndrFN L (r)ei∆(k,k )r a†P,k a†P ′ ,k′\n′\n\n|vaci ,\n\n(1)\n(with polarizations P = H, P ′ = V for type II and\nP = P ′ for type I phase matching, respectively), where\n∆(k, k′ ) is the phase mismatch depending on wavevector and frequency modes k, k′ , in which a pair is created, a†P k,k′ are photon creation operators and FN L (r) is\nthe factor containing nonlinearity and the pump (pumps)\nfield distribution over the nonlinear medium. Integration\nover the volume turns FN L (r) into its Fourier transform,\nFN L (k, k′ ), but there remains a phase factor, depending\non k, k′ . If this phase factor is not symmetric w.r.t. the\nexchange k ↔ k′ , as it indeed happens in nearly all cases,\nthen the phase between the two components of an entangled state generated at the output will change within the\nphase-matched bandwidth.\nLet us now consider the case where polarizationentangled states are generated through SPDC. We will\nseparately focus on the situations of type-II phase matching (in a single crystal) and of type-I phase matching (in\ntwo crystals pumped by the same pump and the optic\naxes oriented in orthogonal planes).\n\n(2)\n\nwhere ω0 is the central frequency of SPDC spectrum,\nthe sinc function is defined as sinc(x) ≡ sinx x , and the\nlongitudinal phase mismatch has the form\n∆z ≡ ∆z (θ, Ω) = ke (θ, ω0 + Ω) cos θ\n+ko (−θ, ω0 − Ω) cos θ − kp ,\n\n(3)\n\nkp , ke , and ko being the wavevectors of the pump, signal (extraordinary), and idler (ordinary) photons, respectively. From this, one can see that with the change in the\nmismatch ∆z , determining the lineshape of SPDC, there\noccurs a simultaneous change in the phase factor standing by the state. If we take into account both positive\nand negative values of the mismatch, we find that different types of two-photon states can be generated within\nthe spectrum allowed by phase-matching. For instance,\nthe state generated at exact phase matching (∆z = 0) is\na factorable one, but it can be turned into the Bell state\n|Ψ+ i by means of a beamsplitter. At mismatch values\n∆z = ±π/L, which can be realized by means of frequency\noffset from degeneracy, or angular offset, or both, the\nstate already becomes another Bell one, the singlet state\n|Ψ− i. At intermediate mismatch values, various maxiiφ\n|V Hi\n√\nare generated, their\nmally entangled states |HV i+e\n2\nphases φ being between 0 and π.\nExpanding the mismatch (3) around the collinear\nfrequency-degenerate point, where exact phase matching\nis assumed, up to linear terms in frequency and angular\noffsets, we obtain\n\n\f3\n\n∆z (θ, Ω) ≃ DΩ + Bθ,\n\n(4)\n\ndko\ndke\ne\nwhere D ≡ dk\ndΩ − dΩ , B ≡ dθ .\nOne can observe that the singlet state |Ψ− i is generated for a continuous set of frequencies and angles θ, Ω,\nfor which ∆z (θ, Ω) = ±π/L. This is shown in Fig.1a\nwhere the frequency-angular spectrum of SPDC is calculated for the case of collinear frequency-degenerate typeII phase matching in a 0.5 mm BBO crystal. The solid\nline corresponds to ∆z (θ, Ω) = 0, i.e. |Ψ+ i production;\ndashed lines correspond to ∆z (θ, Ω) = ±π/L, i.e. |Ψ− i\ngeneration. Note that at angles and frequencies corresponding to |Ψ− i generation, the intensity of SPDC is\nonly about 0.4 times as large as the intensity at the maximum.\nFrequency spectra. For the sake of simplicity let us\nstart by considering the collinear case, i.e. the angle between the photons θ = 0. In experiment, this can be\nprovided by a pinhole inserted into the SPDC beam. In\nthis case the two-photon state (2) can be written as a\nfrequency expansion:\n\n|Ψi =\n\nZ\n\n0\n\n∞\n\ndΩsinc(τ0 Ω)[a†H (ω0 + Ω)a†V (ω0 − Ω)eiτ0 Ω\n+a†V (ω0 + Ω)a†H (ω0 − Ω)e−iτ0 Ω ]|vaci, (5)\n\nwhere τ0 ≡ DL/2 is the e-o delay for a pair born at the\ncenter of the crystal. Here, we assume the e-photon to\nbe horizontally polarized; the integration runs only on\npositive frequency offsets.\nWe see that while at the degenerate frequency, the\nstate |Ψ+ i is created (if the photon flux is split in\ntwo beams by a beamsplitter), the state generated at\nΩ = ±π/2τ0 , i.e., at approximately half-maximum of the\nintensity, is the singlet state |Ψ− i.\nIf a birefringent plate is inserted into the beam after\nthe crystal, then an additional e-o delay τ will be added\nto τ0 in Eq. (2). The case τ = −τ0 is well known: it\nmeans that the e-o delay arising in the crystal is completely compensated. Then, for the whole bandwidth\nallowed by phase matching, one produces a |Ψ+ i. More\ninteresting for our considerations is the case where τ has\nthe same sign as τ0 . In this case the change of the relative phase between the two state components in Eq.(2)\nbecomes more rapid than the intensity variation determined by the phase matching, and both |Ψ+ i and |Ψ− i\nare generated in several domains within the linewidth.\nAngular spectra. Similarly, if one selects the frequencies of the two photons, for instance, corresponding to\nexact degeneracy, then the state can be written as the\nangular spectrum,\n\n|Ψi =\n\nZ\n\n∞\n\n0\n\ndθsinc\n\n\u0012\n\nBθ\n2\n\n\u0013\n\n[a†H (θ)a†V (−θ)ei\n\n+a†V (θ)a†H (−θ)e−i\n\nBθ\n2\n\nBθ\n2\n\n]|vaci,\n\n(6)\n\nHence, the same 'fine structure' of Bell states is present\nwithin the angular lineshape of SPDC. Similarly to the\nfrequency case, this structure can be removed or made\nfiner by, respectively, reducing (compensating) or increasing the anisotropy. Compensation of the anisotropy\ncan be achieved if an anisotropic plate is placed after the\ncrystal; for example, a similar crystal with the length\ntwice smaller and the optic axis rotated 180o with respect to the pump axis. However, in this case one should\navoid SPDC generation in the second crystal. This can\nbe easily achieved by either eliminating the pump after\nthe first crystal or slightly detuning the orientation of the\noptic axis of the second crystal from exact phase matching. In the last case the resulting change in the B value\ncan be compensated for by choosing a crystal of length\nslightly differing from L/2.\nIt is worth mentioning that the fine structure is absent\nif the angle is scanned in the plane orthogonal to the\nplane of the optic axis.\nII.2 Type I phase matching\n\nConsider now generation of polarization-entangled\nphoton pairs by placing two type-I crystals one after the\nother into a common pump beam, the optic axes of the\ncrystals being in orthogonal planes. In the following we\nconsider the case where the pump gives equal contributions to the SPDC intensities in both crystals (i.e. its\npolarization is at 45o w.r.t. the optic axis planes of the\ncrystals). For this configuration, there are two substantial differences from the type-II case considered above.\nFirst, the wavevector mismatch should be expanded up\nto quadratic terms in the angle and frequency offsets,\nsince the linear terms cancel each other:\n\n∆z (θ, Ω) ≃\n\nd2 ko 2\nΩ − ko θ2 .\ndΩ2\n\n(7)\n\nThe form of the mismatch is the same for both crystals. Second, an ordinarily polarized pair born in the first\ncrystal acquires a frequency- and angle-dependent phase\nfactor in the second crystal, where it is extraordinarily\npolarized, and the state generated at the output is\n\n|Ψi =\n\nZZ\n\n0\n\n∞\n\ndθ dΩsinc\n\n\u0012\n\n∆z L\n2\n\n\u0013\n\n×[a†H (θ, ω0 + Ω)a†H (−θ, ω0 − Ω)\n+eiφ(θ,Ω) a†V (θ, ω0 + Ω)a†V (−θ, ω0 − Ω)] |vaci ,\n\n(8)\n\n\f4\nwhere, up to second-order terms in frequency and angu2\n2\nlar offsets, φ(θ, Ω) = ( ddΩk2e Ω2 − ke θ2 + ddθk2e θ2 )L, and the\nsame assumptions on the pump are made as when deriving Eq.(2). The third term in the expression for φ(θ, Ω) is\nmuch smaller than the other two and hence can be omitted. As a result, up to the exchange ko → ke , the phase\nφ(θ, Ω) is equal to the 'mismatch phase' ∆z L, and the\nsame effect of 'switching' between different maximally\nentangled states as for the type-II case takes place for\nthis configuration. However, while for the type-II phase\nmatching 'switching' occurred between the states |Ψ+ i\nand |Ψ− i, this time the Bell states involved are |Φ+ i and\n|Φ− i. The structure of the frequency-angular spectrum\nin this case is shown in Fig.1b, with the state |Φ+ i shown\nby solid lines and the state |Φ− i by dashed lines. It is\nimportant to emphasize that, a fact that, to our knowledge has not been mentioned yet, also the 'two-type I'\nscheme of Bell-states preparation requires some filtering:\nthe Bell state produced on the slopes of the spectrum is\ndifferent from the state produced in the middle.\nFrom Fig.1b one can also observe that, when\npolarization-entangled states are produced using 'two\ntype-I' phase matching, transition between various maximally entangled states occurs at angles and frequencies\nwhere the phase mismatch changes rapidly. This domain is rather narrow; in the most part of the frequencyangular spectrum, only the state |Φ+ i is produced.\nUnlike type-II phase matching, here the 'fine structure'\nof the angular lineshape appears regardless of the plane\nwhere the angular scanning is made.\nFrequency and angular spectra. The frequency spectrum of the state in the collinear case is\nZ\n\n|Ψi =\n\n∞\n\ndΩsinc\n\n0\n\n\u0012\n\nd2 ko Ω2 L\ndΩ2 2\n\n\u0013\n\n×[a†H (ω0 + Ω)a†H (ω0 − Ω)\nd2 ke\n\n+ei dΩ2\n\nΩ2 L †\naV\n\n(ω0 + Ω)a†V (ω0 − Ω)] |vaci ,\n\n(9)\n\nand the angular spectrum in the degenerate case is\n\n|Ψi =\n\nZ\n\n∞\n\n0\n\ndθsinc\n\n\u0012\n\nko θ2 L\n2\n\n\u0013\n\nIII.1 Type-II configuration.\n\n×[a†H (θ)a†H (−θ)\n+eike θ\n\n2\n\nL †\naV\n\n(θ)a†V (−θ)] |vaci .\n\na 0.5 mm type-II crystal or a combination of 1 mm typeI crystals was split using a non-polarizing beamsplitter\nand a Glan prism was put into each output port. In one\nof the output ports, angular or frequency selection was\nperformed, the detector in the other arm collecting all\npossible conjugate modes. Coincidences of the two detectors were measured depending on the positions of the\nGlan prisms and the frequency and angle selected.\nIn particular, in the specific experimental setup\nfor testing polarization-frequency Bell states, produced\nwithin the bandwidth of collinear frequency-degenerate\nSPDC, a diffractive-grating monochromator with the resolution 0.8 nm was used as the frequency-selective element. Since the pump was continuous-wave, frequency\nselection for one of the photons of a pair automatically selected the frequency of the correlated photon. To reduce\nthe contribution of accidental coincidences, a broadband\ninterference filter centered around 702 nm was placed after the beamsplitter. Biphoton pairs were registered by\ntwo photodetection apparatuses, consisting of red-glass\nfilters, pinholes, focusing lenses and avalanche photodiodes. The photocount pulses of the two detectors, after\npassing through delay lines, were sent to the START and\nSTOP inputs of a time-to-amplitude converter (TAC).\nThe output of the TAC was finally addressed to a multichannel analyzer (MCA), and the number of photocount\ncoincidences of the two detectors was observed at the\nMCA output.\nIn a modified version of this setup, an optical fibre\nwas used as a frequency-selective element. Indeed, as it\nwas shown in [16], due to the group-velocity dispersion,\nan optical fibre performs a Fourier transformation of the\ntwo-photon spectral amplitude, which can be measured\nthrough the time distribution of the signal-idler delay after the fibre. Thus, in some of our measurements the\nmonochromator in one output port was replaced by an\noptical fibre of length 1 km inserted into the beam before\nthe beamsplitter. This specific set-up is interesting for\napplication to long-distance fiber quantum communication as the transmission fibre takes the role of transforming the frequency selection to (very easily implementable)\ntime window selection.\n\n(10)\n\nIII. EXPERIMENT:\nPOLARIZATION-FREQUENCY\nENTANGLEMENT\n\nThe general experimental setup for exploring the\nfrequency-angular Bell states structure inside the bandwith is sketched in Fig.2. Two-photon light generated in\n\nAccording to Eq.(5), the frequency spectrum of\nthe type-II configuration contains a continuum of\npolarization-frequency entangled states from |Ψ+ i to\n|Ψ− i. A usual test of such states consists of fixing one of\nthe polarization prisms at an angle Θ1 = 45◦ and measuring the coincidence counting rate as a function of the\nother prism orientation Θ2 (polarization interference).\nFor Bell states |Ψ± i, high interference visibility (100% in\nthe ideal case) should be observed, the coincidence counting rate depending on Θ1 , Θ2 as Rc ∼ sin2 (Θ2 ± Θ1 ) and\n\n\f5\nits minimum corresponding to Θ2 = ∓45◦.\nTo demonstrate the generation of various polarizationentangled states within the collinear type-II SPDC bandwidth, we measured the coincidence counting rate versus\nthe wavelength selected by the monochromator, for two\nsettings of the Glan prisms: Θ1 = 45◦ , Θ2 = −45◦ and\nΘ1 = Θ2 = 45◦ (Fig.3). The results fit well the dependence, calculated in [16] as\nRc (Ω) = sinc2 (Ωτ0 )[sin2 (Θ1 + Θ2 ) cos2 (Ωτ0 )\n+ sin2 (Θ1 − Θ2 ) sin2 (Ωτ0 )].\n\n(11)\n\nAs it follows from Eq.(11) and is confirmed by experimental spectra (Fig.3), with some specific choice of\nthe wavelengths high-visibility polarization interference\nis observed when rotating the polarization prism in channel 2. This is well-known for the case where the selected\nwavelength is the central one. Indeed, by selecting the\nwavelength of 702 nm and rotating the Glan prism in\nchannel 2 we observed polarization interference with a\nvisibility of 89%. However, we see that high-visibility\npolarization interference also takes place when the selected wavelength is 695.5 nm or 708.5 nm. Both cases\ncorrespond to the selection of the |Ψ− i state.\nTo demonstrate polarization interference for the |Ψ− i\nstate, the wavelength transmitted by the monochromator\nwas fixed at 708.5 nm and the coincidence counting rate\nwas measured depending on the orientation of polarizer\n2, the other polarizer being oriented at Θ1 = 45◦ . The\ndependence, shown in Fig.4, demonstrates a visibility of\n98%.\nFinally, we have checked the invariance of the produced\n|Ψ− i state under polarization transformations, which\nwere performed by placing quarter- and half- wave plates\n(QWP and HWP) at various orientations in front of the\nbeamsplitter. For each setting of the plates, the spectra similar to the ones shown in Fig.3 were obtained. In\nparticular, the dependencies obtained for various HWP\norientations are shown in Fig.5(a,b). As expected from\nthe theoretical prediction, the coincidence counting rate\ncorresponding to the wavelengths 695.5 nm and 708.5\nnm (the |Ψ− i state) at both positions of the Glan prisms,\n(45◦ , 45◦ ) and (45◦ , −45◦ ), does not change depending on\nthe HWP orientation, i.e., depending on the rotation of\nthe two-photon polarization state before the beamsplitter. The resulting visibility of polarization interference\nexceeds 84% for all settings of the HWP. At all other\nwavelengths (including the central one, 702 nm), the coincidence counting rate clearly depends on the HWP orientation, and for some orientations, the visibility of polarization interference becomes zero. Similar behavior is\nobserved for a QWP inserted before the beamsplitter.\nThe invariance of the |Ψ− i state to polarization transformations is also clearly seen when an optical fibre is\nused as a spectral-selecting element. Indeed, the polar-\n\nization drift, unavoidably present in optical fibres, 'deteriorates' all the Bell states except the singlet one |Ψ− i.\nTo demonstrate this, we have removed the monochromator and selected the singlet state by means of a 1 km fibre\ninserted before the beamsplitter. Coincidence distributions obtained for the (45◦ , 45◦ ) and (45◦ , −45◦) settings\nof the Glan prisms are presented in Fig.6. One can see\nthat at time delays not corresponding to the generation\nof the singlet state, the dependencies have complicated\nshapes and do not correspond to the behavior shown in\nFig.3 (a result of polarization drift in the fibre). At the\nsame time, at points pertaining to the |Ψ− i generation\nthere is a coincidence minimum for the (45◦ , 45◦ ) settings and a maximum for the (45◦ , −45◦ ) settings of the\nprisms.\nUsing an optical fibre as a frequency-selecting element\nin the analysis of the two-photon spectral amplitude is\nmost convenient whenever polarization drift can be eliminated or made inessential. In particular, one can use a\nFaraday mirror (which acts as a time reversal) and make\nthe two-photon light travel twice through the same fibre,\nthus compensating for the polarization drift. This technique, suggested in [17], was used for two-photon spectral\namplitude selection in [16].\nAnother way to avoid the influence of polarization drift\nin the fibre is to insert a single Glan prism before the\nfibre and no prisms after the fibre. Then the role of\nboth Glan prisms is played by a single one, oriented at\n45◦ ; the payoff for eliminating polarization drift is the\nimpossibility to study the coincidence spectrum in the\n(45◦ , −45◦ ) configuration. Using this technique, with a\n1 km fibre we demonstrated the action of birefringent\nplates on the state produced at various wavelength of\nSPDC bandwidth (Fig.7).\nAccording to the considerations given in Section II, if\na birefringent plate introducing an e-o delay τ is inserted\nafter the crystal, the spectral dependencies (11) become\nRc (Ω) = sinc2 (Ωτ0 )[sin2 (Θ1 + Θ2 ) cos2 (Ω(τ0 + τ ))\n+ sin2 (Θ1 − Θ2 ) sin2 (Ω(τ0 + τ ))]. (12)\nAs mentioned above, for a complete compensation of\nthe e-o delay, τ = −τ0 , the state produced is |Ψ+ i over\nthe whole bandwidth. Here we demonstrate the opposite effect, where τ is of the same sign as τ0 , and the\nfine structure of the SPDC line becomes even finer. In\nparticular, when τ = τ0 , the modulation period in (12)\nbecomes twice as large as in (11), and |Ψ+ i is produced\nat the same pair of frequency offsets Ω = ±π/2τ0 where\n|Ψ− i is produced in the absence of the birefringent plate.\nIndeed, in Fig.7 one can see that the modulation of the\nSPDC lineshape observed in coincidences becomes more\nand more frequent as we pass from no plates inserted\n(Fig.7a) to one quartz plate of thickness 1 mm (Fig.7b)\nand two quartz plates of thickness 1 mm (Fig.7c) inserted\nafter the BBO crystal.\n\n\f6\nIII.2 'Two type-I' configuration.\n\nIV. EXPERIMENT:\nPOLARIZATION-WAVEVECTOR\nENTANGLEMENT\n\nWith the same experimental setup (and the frequency\nselection performed by a monochromator), we have analyzed the frequency structure of polarization-entangled\nstates produced by two 1 mm type-I BBO crystals cut for\ncollinear frequency-degenerate phasematching with the\noptic axes oriented in orthogonal planes. The polarization of the pump was rotated to 45◦ by a half-wave plate,\nthus providing equal contributions from each crystal.\nThe phase between the contributions from both crystals\nat the central wavelength 702 nm was set to zero by tilting two quartz plates with optic axes oriented vertically,\nplaced into the two-photon beam. As it follows from\nEq. (9), in this case the lineshape of SPDC contains a\ncontinuous set of polarization-entangled states from |Φ+ i\niθ\n|V V i\n√\nat the center to |Φ− i at the slopes, with |HHi+e\n2\n(0 < θ < π) entangled states between them. When the\norientations of the prisms Θ1 , Θ2 are varied, maximum\nvisibility of polarization interference is achieved for the\nBell states |Φ± i; the coincidence counting rate depends\non Θ1 , Θ2 as Rc ∼ cos2 (Θ1 ∓ Θ2 ).\nSpectral distributions of coincidences for the (45◦ , 45◦ )\nand (45◦ , −45◦ ) configurations of the Glan prisms are\nshown in Fig.8. The theoretical dependence, similarly to\n(11), can be written as\n\n\u0013\nd2 ko Ω2 L\ndΩ2 2\n\u0012 2\n\u0013\nd ke Ω2 L\n2\n2\n×[cos (Θ1 − Θ2 ) cos\ndΩ2 2\n\u0012 2\n\u0013\nd ke Ω2 L\n2\n2\n+ cos (Θ1 + Θ2 ) sin\n].\ndΩ2 2\nRc (Ω) = sinc2\n\n\u0012\n\nAfter analyzing frequency structure of the entanglement in type-II or 'two type-I' configurations of SPDC,\nlet us pass to considering its angular structure. It was\nstudied by means of the experimental setup shown in\nFig.10 where angular selection was performed in one output port of the beamsplitter. For this purpose, we used a\nlens with the focal length 500 mm, and the detector apparatus placed in its focal plane. The detector apparatus\nincluded an avalanche photodiode, an interference filter\nwith FWHM=3 nm, centered at the degenerate wavelength 702 nm, a lens with focal length 25 mm, and a\npinhole with 1 mm diameter. Thus, the angular resolution in the angle-selective arm of the setup (arm 1) was\n2 mrad. It is important that, since the detection apparatus was placed into the far-field zone, transverse walk-off\neffects did not contribute to the results.\nThe other arm of the setup (arm 2) was designed to\ncollect all angular width of SPDC spectrum corresponding to the degenerate frequency. For this purpose, we\nremoved the lens from the detection apparatus of arm\n2 and imaged the pump beam waist (1.5 mm) onto the\nsensitive area of the avalanche photodiode (200μ × 200μ)\nwith a demagnification of 1 : 6. This was obtained by using an objective lens with a large numerical aperture and\nwith the focal length F = 100 mm. The angular bandwidth of SPDC after the lens, although increased 6 times,\nwas still within the acceptance angle of the photodiode.\nIn order to prevent a significant contribution of accidental coincidences, an interference filter with FWHM=1 nm\nand a vertical slit of diameter 2 mm were placed before\nthe detector.\n\n(13)\nIV.1 Type-II configuration.\n\nWe see that the Bell states |Φ+ i and |Φ− i are produced\nwhen the wavelengths selected are the central one (702\nnm) and the side ones (658 nm or 746 nm), respectively.\nPolarization interference for these states was observed by\nselecting the corresponding wavelength, fixing one of the\nGlan prisms at Θ1 = 45◦ , and rotating the other one\n(Fig.9).\nNote that although it is commonly believed that the\n'two type I crystals' scheme for polarization-entangled\nproduction requires neither delay compensation nor filtering, from Fig. 8 one can see that on the slopes of\nthe spectrum, the state produced is different from the\none generated in the middle. Note that this occurs even\nwhen perfectly collinear SPDC beam (θ = 0) is selected.\nHence, filtering the SPDC linewidth is also necessary in\nthis case, although the bandwidth of the filter can be\nrather large (from Fig. 8, about 30 nm).\n\nIn the case of type-II SPDC from a 0.5 mm BBO crystal, we studied the coincidence counting rate distribution\nusing two geometries of experiment. In the first geometry, the angle was scanned in the plane of the optic axis.\nThe corresponding dependence of the coincidence counting rate on the angle selected by the pinhole in arm 1 of\nthe setup, for the (45◦ , 45◦ ) and (45◦ , −45◦) settings of\nthe Glan prisms, is shown in Fig.11. The dependencies\nare well fitted by the relation\nRc (θ) = sinc\n\n2\n\n\u0012\n\nBθL\n2\n\n\u0013\n\n\u0012\n\n\u0013\nBθL\n[sin (Θ1 + Θ2 ) cos\n2\n\u0012\n\u0013\nBθL\n2\n2\n+ sin (Θ1 − Θ2 ) sin\n],(14)\n2\n2\n\n2\n\nwhich follows from Eq.(6). Similarly to the case of the\nfrequency spectrum, the state generated at the center of\n\n\f7\nthe angular lineshape is |Ψ+ i, while at the angles ±0.012\nrad the state |Ψ− i is produced. Indeed, by selecting the\nangle in arm 1 to be θ = 0, fixing the Glan prism in arm\n1 at 45◦ and rotating the other Glan prism we obtained\na polarization interference typical of |Ψ+ i, with a visibility of 96.3%. At the same time, the same measurement\nperformed for the angle θ = 0.01 rad selected, showed\na polarization-interference dependence typical of |Ψ− i,\nwith the visibility 97% (Fig.12).\nIn the other geometry of experiment, the angle of scattering was scanned in the plane orthogonal to the plane\nof the optic axis. As mentioned in Section II, in this case\nno 'fine structure' of the angular lineshape should be observed since the wavevector mismatch ∆z is symmetric\nwith respect to the interchange of the wavevectors ko , ke .\nAs a result, the produced state was |Ψ+ i for all angles\nof scattering θ, and the number of coincidences recorded\nfor (45◦ , 45◦ ) settings of the polarizers by far exceeded\nthe one obtained for (45◦ , −45◦ ) settings (Fig.13).\n\nIV.2 'Two type-I' configuration.\n\nWith a similar experimental setup (Fig.10) we performed the measurements of the spatial spectra in the\nconfiguration with two type I crystals with orthogonal\noptic axes. It is worth mentioning that in this case it is\ncritical that two production crystals are mounted face to\nface. This arrangement allows to avoid the spatial walkoff between the correlated beams produced from different crystals which leads to their spatial distinguishability. Notice that the problem of the walk-off is absent\nfor the collinear operation. Similar to the previous section we studied the coincidences dependence on the angle\nselected by the pinhole at a fixed orientations of the polarizers P1 and P2. The quartz plates installed in the\npump beam were aligned in a way that the entangled\n|Φ+ i state was generated in the collinear configuration.\nIf the pinhole filters a small angle θ within the line of\nSPDC then the generated state is given by (10). In this\ncase the dependence of the coincidences counting rate is\ngiven by (similar to (14)):\n\nRc (θ) = sinc\n\n2\n\n\u0012\n\n\u0013\nke θ2 L\n[sin (Θ1 + Θ2 ) cos\n2\n\u0013\n\u0012\n2\nk\nθ\ne L\n2\n2\n+ sin (Θ1 − Θ2 ) sin\n(15)\n].\n2\n\nko θ2 L\n2\n\n\u0013\n\n2\n\n2\n\n\u0012\n\nThe results of the experiment for the orientations of\nthe polarizers at (45◦ , 45◦ ) and (45◦ , −45◦) are presented\nin Fig.14 . As one expects from the theoretical considerations (see section II) whilst an entangled |Φ+ i state\nis generated within the wide angular bandwidth near the\ncollinear configuration, at side-bands of the spectra the\nstate is transformed into the orthogonal |Φ− i state.\n\nV. CONCLUSION\n\nFinally, let us drive some conclusions from the obtained\ntheoretical and experimental results.\nHaving analyzed two possible schemes for producing\npolarization-entangled states via cw-pumped SPDC in\na crystal of finite length L (usual type-II phasematching\nand the 'two type-I' scheme), we see that within the natural bandwidth, there is never a single Bell state produced\nfor all mismatch values. At angles and frequencies corresponding to exact phase matching, the Bell state |Ψ+ i\nis produced for type-II SPDC and the Bell state |Φ+ i,\nfor the 'two type-I' scheme. However, at the values of\nthe phase mismatch ±π/L, the state produced in these\ntwo schemes is |Ψ− i and |Φ− i, respectively. At intermediate mismatches, other maximally entangled states\nare produced. Since the mismatch variation can be performed through the variation of either frequency or angle\nof scattering, or both, there is a 'fine structure' of maximally entangled states generation in the two-dimensional\nfrequency-angular spectrum of SPDC.\nIt is well-known that for type-II SPDC, one can produce the state |Ψ+ i within the whole frequency bandwidth by compensating the delay between the two orthogonally polarized photons of a pair born in the same\ncrystal. This is usually done by placing after the crystal a birefingent plate of appropriate thickness. However,\nthis compensation, although increasing the efficiency of\nBell-states generation, still leaves the fine structure in\nthe angular lineshape. To avoid the generation of other\nBell states, in all existing experiments one usually selects\na sufficiently small angular width by means of a pinhole.\nFrom our consideration, it immediately follows that the\nfine structure of Bell-states generation within the angular\nSPDC linewidth can be compensated similarly, by placing an anisotropic crystal into the SPDC beam. This\nwould lead to a much more efficient Bell-states generation compared to the case of selecting a narrow angular\nspectrum.\nThe case of non-compensated fine structure of Bell\nstates production within the natural SPDC linewidth is\nalso very interesting. An important point that has been\nevidenced is that the frequency structure can be made\nto vary more rapidly if the birefringent plate after the\ncrystal increases the e-o delay, instead of reducing it.\nThe advantage of having such a structure is that one can\nproduce different collinear Bell states at non-degenerate\nwavelengths. They can find application in realizing, for\ninstance, quantum information protocols involving the\nsinglet state and one of the triplet states, e.g. [18].\nThe fact that the frequency structure is rather narrow\n(for a type-II crystal of thickness 0.5 mm, it is on the order of ten nanometers) is not a drawback. Indeed, if the\nBell states produced are to be applied for quantum communication, which is usually performed through optical\n\n\f8\n\n[1] M.A. Nielsen and I.L. Chuang, \"Quantum Computation and Quantum Information\", Cambridge Univ. press\n(Cambridge, 2000). D. Bouwmeester et al., \"The physics\nof Quantum Information\", Springer Verlag (Berlin,\n2000).\n[2] M.Genovese, Phys. Rep. 413 319 (2005).\n[3] G. Brida, M.Genovese, M. Gramegna, Laser Physics Letters 3 (2006) 115 and Refs. therein.\n[4] L.A. Lugiato, A. Gatti and E. Brambilla, J. Opt. B.\nQuant. Sem. Opt. 4 (2002) S176.\n[5] A. Garuccio, in \"Fundamental Problems in Quantum\nTheory\", Ed. D. Greenberger , (New York Academy of\nSciences, 1995).\n[6] P.G.Kwiat,\nK.Mattle,\nH.Weinfurter,\nA.Zeilinger,\nA.V.Sergienko, Y.H.Shih. Phys. Rev. Lett. 75, 4337\n(1995).\n[7] D.Branning, W. P. Grice, R. Erdmann, and I. A. Walmsley, Phys. Rev. Lett. 83, 955 (1999);\n[8] Y.-H. Kim, S. P. Kulik, M. V. Chekhova, W. P. Grice,\nand Y. H. Shih,Phys. Rev. A 67, 010301(R) (2003).\n[9] P.G.Kwiat, E.Waks, A.G.White, I.Appelbaum, and\nP.G.Eberhard, Phys. Rev. A 60,R773 (1999); G. Brida\net al., Phys. Lett. A268, 12 (2000); A299, 121 (2002).\n[10] Y.H.Kim, S.P.Kulik, and Y.H.Shih. Phys. Rev. A 63,\n060301(R) (2001).\n[11] A.V.Burlakov,\nS.P.Kulik,\nG.O.Rytikov,\nand\nM.V.Chekhova, JETP 95, 639-644 (2002).\n[12] M. H. Rubin, D. N. Klyshko, Y. H. Shih, and A. V.\n\nSergienko, Phys. Rev. A 50, 5122 (1994).\n\nInternal angle, rad\n\n0.02\n0.01\n\na\n\n0\n\n-0.01\n-0.02\n0.68\n\n0.69\n\n0.70\n\n0.71 0.72\n\nwavelength, mm\n0.02\n\nInternal angle, rad\n\nfibres, large wavelength separation should be avoided because of the polarization-mode dispersion. At the same\ntime, we have shown that selection of the wavelength\ncan be in this case performed by means of the fibre itself,\nthrough the time selection of the two-photon amplitude.\nThe possibility to select a Bell state by means of appropriate angular filtering may be of considerable importance since the angular filtering can be principally lossless. This can be used in applications where losses are\ncrucial such as, for instance, squeezed states generation.\nThe observed fine structure of SPDC lineshape can\nbe also applied in quantum information for the preparation of complex entangled states, for instance, states\nwith double entanglement in frequency, wavevector, and\npolarization.\nFinally, it is worth mentioning that, although here\nwe only considered collinear frequency-degenerate SPDC,\nthe same effects are also present in the non-collinear or\nfrequency non-degenerate cases.\nAcknowledgements: We would like to acknowledge Marco Terzi, Ivo DeGiovanni, Luca Giacone and\nValentina Caricato for fruitful discussions and help with\nthe experiment. This work was supported in part by the\njoint grant RFBR-Piedmont 07-02-91581-ASP, by italian\nminister of research (PRIN 2005023443-002) and by Regione Piemonte (E14).\n\n0.01\n\nb\n\n0\n\n-0.01\n-0.02\n0.61\n\n0.67\n\n0.73\n\n0.79\n\nwavelength, mm\nFIG. 1: Frequency-angular distributions of SPDC calculated\nfor the case of (a) type-II collinear frequency-degenerate phase\nmatching in a 0.5 mm BBO crystal and (b) two 1 mm typeI BBO crystals cut for collinear frequency-degenerate phase\nmatching, placed one after another, with optic axes in orthogonal planes, and pumped by the same laser beam (supposed\nto have a wavelength\n ̨  ̧ of 351 nm). Solid lines in (a) show\n ̨ the ̧\ndomains where  ̨Ψ+ is generated, dashed lines, where  ̨ ̨Ψ−\n ̧\n ̨ +\nis generated. Solid lines in (b) show\n ̨ −the\n ̧ domains where Φ\nis generated, dashed lines, where  ̨Φ\nis generated.\n\n[13] L.J.Wang, C.K.Hong, and S.R.Friberg, J. Opt. B: Quantum and Semiclass. Opt. 3, 346 (2001); J. E. Sharping, M. Fiorentino, and P. Kumar, Opt. Lett. 26,\n367369 (2001); H.Takesue and K.Inoue, Phys. Rev. A\n70, 031802(R) (2004); J.G.Rarity et al., Optics Express,\n13, No 2, 534 (2005).\n[14] D.N.Klyshko, Photons and Nonlinear Optics (Gordon\nand Breach, New York, 1988).\n[15] A. V. Burlakov, M. V. Chekhova, D. N. Klyshko, S. P.\nKulik, A. N. Penin, Y. H. Shih, and D. V. Strekalov,\nPhys. Rev. A 56, 32143225 (1997).\n[16] G. Brida, M. V. Chekhova, M. Genovese, and L. A. Krivitsky, Phys. Rev. Lett. 96, 143601 (2006); Phys. Rev. A\n75, 015801 (2007); Journ. of Phys. A, in press.\n[17] Martinelli M. 1992 Journ. Mod. Opt. 39 451; Martinelli\nM. 1989 Opt. Comm. 72 341; Breguet J. and Gisin N.\n1995 Opt. Lett. 201447.\n[18] K.Banaszek, A.Dragan, W.Wasilewski, and Czeslaw\nRadzewicz. Phys. Rev. Lett. 92, 257901 (2004).\n\n\f9\nQWP and HWP\n\nBBO\n\nD1\n\nNPBS P1\n\ntype II\n\nMonochromator\n\nP2\n\n2*type I\n\nCoincidence\ncircuit\n\nD2\n\nFibre\n\ncoincidences in 200 s\n\nFIG. 2: Scheme of the experimental setup. A type-II BBO\ncrystal or a combination of two type-I crystals cut for collinear\nfrequency-degenerate phasematching is pumped by cw Ar +\nlaser at 351 nm; NPBS, a 50/50 nonpolarizing BS; P1 and\nP2, Glan prisms; D1, D2, single-photon counting modules. A\nfrequency-selecting element is placed in one arm; in the other\narm, all frequencies are collected. Retardation plates, QWP\nand HWP, are used to study the invariance of the Bell state\n|Ψ− i under polarization transformations. In some measurements, the monochromator is replaced by a 1 km single-mode\nfiber inserted after the crystal and frequency selection is replaced by time selection.\n\n300\n250\n200\n150\n100\n50\n0\n\n692\n\n696\n\n700\n\n704\n\n708\n\n712\n\n716\n\nwavelength nm\n\ncoincidences in 200 s\n\nFIG. 3: Experimental dependence of the coincidence counting rate for type-II SPDC on the wavelength selected by the\nmonochromator for two cases: Θ1 = Θ2 = 45◦ (squares, solid\nline) and Θ1 = 45◦ , Θ2 = −45◦ (triangles, dashed line). Lines\nrepresent a fit with Eq.(11).\n\n140\n120\n100\n80\n60\n40\n20\n0\n-150\n\n-100\n\n-50\n\n0\n\n50\n\n100\n\n150\n\n200\n\norientation of the polariser, deg\n\nFIG. 4: Polarization interference fringes for the singlet Bell\nstate |Ψ− i generated in type-II SPDC (the selected wavelength is λ = 708.5nm).\n\n\fcoincidences in 200 s\n\n10\n270\n240\n\na\n\nb\n\n210\n180\n150\n120\n90\n60\n30\n0\n\n692\n\n696 700\n\n704 708\n\n712\n\n692\n\n696\n\n700\n\n704\n\n708\n\n712\n\nwavelength, nm\n\nFIG. 5: Experimental dependence of the coincidence counting\nrate on the wavelength selected by the monochromator for the\nfollowing orientations of the HWP placed after the crystal:\n7◦ (circles, dotted line); 17◦ (squares, dashed line ); 22, 5◦\n(triangles, solid line). Orientations of the Glan prisms are\n45◦ , 45◦ (a) and 45◦ , −45◦ (b). Dashed vertical bars show\nthe wavelength where |Ψ− i is generated. Lines represent the\ntheoretical fit.\n\ncounts of MCA in 2300 s\n\n180\n150\n\na\n\n120\n90\n60\n30\n0\n-8\n\n-6\n\n-4\n\n-2\n\n0\n\n2\n\n4\n\n6\n\n8\n\n4\n\n6\n\n8\n\ndelay, ns\n\ncounts of MCA in 2300 s\n\n180\n150\n\nb\n\n120\n90\n60\n30\n0\n-8\n\n-6\n\n-4\n\n-2\n\n0\n\n2\n\ndelay, ns\n\nFIG. 6: Experimental dependence of the coincidence counting\nrate on the delay between the arrivals of two photons, with the\nmonochromator replaced by a 1 km optical fibre and the Glan\nprisms set at positions (a) (45◦ , 45◦ ) and (b) (45◦ , −45◦ ).\n\n\fNormalised counts of MCA\n\n11\n\n1,0\n\na\n\nb\n\n0,8\n\n0,6\n\n0,4\n\n0,2\n\n0,0\n-6\n\n-4\n\n-2\n\n0\n\n1,0\n\n2\n\n4\n\n6\n\n-4\n\n-2\n\n0\n\n-6\n\n-4\n\n-2\n\n0\n\n2\n\n4\n\n6\n\nc\n\n0,8\n\n0,6\n\n0,4\n\n0,2\n\n0,0\n-6\n\n2\n\n4\n\n6\n\ndelay, ns\n\ncoincidences in 60 s\n\nFIG. 7: The measured shape of the second-order correlation\nfunction for the case of (a) no quartz plates, (b) one quartz\nplate of thickness 1 mm, and (c) two quartz plates of thickness 1 mm placed at the output of the crystal with the optic\naxes parallel to the plane of the BBO optic axis, and a single\npolarizer set at Θ = 45◦ before the fibre. The curves show the\ntheoretical dependencies (12) with an account for the detector\njitter time.\n\n500\n400\n300\n200\n100\n0\n640\n\n660\n\n680\n\n700\n\n720\n\n740\n\n760\n\n780\n\nwavelength, nm\n\nnormalized coincidences\n\nFIG. 8: Experimental dependence of the coincidence counting\nrate for the 'two-type I' configuration on the wavelength selected by the monochromator for two cases: Θ1 = Θ2 = 45◦\n(squares, solid line) and Θ1 = 45◦ , Θ2 = −45◦ (triangles,\ndashed line). Lines represent a fit with Eq.(13).\n\n1,2\n\n1,0\n\n0,8\n\n0,6\n\n0,4\n\n0,2\n\n0,0\n-150\n\n-100\n\n-50\n\n0\n\n50\n\n100\n\n150\n\n200\n\n250\n\n300\n\norientation of the polarizer, deg\n\nFIG. 9: Polarization interference fringes for the Bell states\n|Φ+ i (the selected wavelength is λ = 702nm) and |Φ− i (the\nselected wavelength is λ = 658nm) generated from the 'two\ntype-I' configuration.\n\n\f12\nBBO\n\nAr cw-laser\n351 nm\n\nNPBS\n\nL\n\nP1\n\nD1\n\ntype II\n\n2*type I\n\nf\n\nO\nP2\nIF\n\nCoincidence\ncircuit\n\nD2\n\ncoincidences for 150 s\n\nFIG. 10: Scheme of the experimental setup. The crystals\narrangement is the same as in fig.2 ; NPBS, a 50/50 nonpolarizing BS; P1 and P2, Glan prisms; D1, D2, single-photon\ncounting modules. Angular selection is performed in one arm\nby a lens L with focal length 500 mm and a pinhole with diameter 1 mm, placed in a focal plane of L and scanned in\nthe vertical plane together with the detector D1. In the other\narm, all angles are collected by means of an objective O with\nfocal length 100 mm. Narrow-band interference filter IF is\nused to avoid contribution of accidental coincidences.\n\n600\n\n500\n\n400\n\n300\n\n200\n\n100\n\n0\n-0,02\n\n-0,01\n\n0,00\n\n0,01\n\n0,02\n\nscattering angle, rad\n\ncoincidences in 200 s\n\nFIG. 11: Experimental dependence of the coincidence counting rate for the 'type II' configuration on the angle selected by\nthe pinhole in arm 1 of the setup for two cases: Θ1 = Θ2 = 45◦\n(squares, solid line) and Θ1 = 45◦ , Θ2 = −45◦ (triangles,\ndashed line). Angular scanning was performed in the plane\nof the optic axis. Lines represent a fit with Eq.(15).\n\n500\n\n400\n\n300\n\n200\n\n100\n\n0\n-100\n\n-50\n\n0\n\n50\n\n100\n\n150\n\n200\n\n250\n\norientation of the polarizer, deg\n\nFIG. 12: Polarization interference fringes for the singlet Bell\nstate |Ψ− i generated in type-II SPDC (the selected angle is\nθ = −0.012 rad).\n\n\fcoincidences in 150 s\n\n13\n\n600\n\n500\n\n400\n\n300\n\n200\n\n100\n\n0\n-0,030\n\n-0,015\n\n0,000\n\n0,015\n\n0,030\n\nscattering angle, rad\n\ncoincidences for 50 s\n\nFIG. 13: Experimental dependence of the coincidence counting rate for the 'type II' configuration on the angle selected by\nthe pinhole in arm 1 of the setup for two cases: Θ1 = Θ2 = 45◦\n(squares, solid line) and Θ1 = 45◦ , Θ2 = −45◦ (triangles,\ndashed line). Angular scanning was performed in the plane\northogonal to the plane of the optic axis.\n\n900\n\n750\n\n600\n\n450\n\n300\n\n150\n\n0\n-0,03\n\n-0,02\n\n-0,01\n\n0,00\n\n0,01\n\n0,02\n\n0,03\n\nscattering angle, rad\n\nFIG. 14: Experimental dependence of the coincidence counting rate for the 'two-type I' configuration on the angle selected\nby the pinhole for two cases: Θ1 = Θ2 = 45◦ (squares, solid\nline) and Θ1 = 45◦ , Θ2 = −45◦ (triangles, dashed line).\n\n\f"}