{"id": "http://arxiv.org/abs/0706.0994v2", "guidislink": true, "updated": "2007-09-21T09:46:42Z", "updated_parsed": [2007, 9, 21, 9, 46, 42, 4, 264, 0], "published": "2007-06-07T12:29:53Z", "published_parsed": [2007, 6, 7, 12, 29, 53, 3, 158, 0], "title": "Correlation Properties of the Electron-Hole Plasma Interecting with the\n  Exciton Gas and the Formation of Inhomogeneous State", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0706.0533%2C0706.4445%2C0706.1087%2C0706.1127%2C0706.1916%2C0706.2631%2C0706.1203%2C0706.1045%2C0706.0691%2C0706.3165%2C0706.4345%2C0706.2797%2C0706.2071%2C0706.2911%2C0706.3794%2C0706.4319%2C0706.2505%2C0706.0949%2C0706.2299%2C0706.3510%2C0706.0432%2C0706.1454%2C0706.0649%2C0706.1410%2C0706.2407%2C0706.1256%2C0706.0648%2C0706.4470%2C0706.3188%2C0706.2110%2C0706.1262%2C0706.0952%2C0706.2457%2C0706.0205%2C0706.0082%2C0706.0994%2C0706.0889%2C0706.4223%2C0706.2756%2C0706.2629%2C0706.2256%2C0706.2438%2C0706.1791%2C0706.0449%2C0706.1404%2C0706.4128%2C0706.1381%2C0706.4450%2C0706.0796%2C0706.2261%2C0706.1282%2C0706.2739%2C0706.0745%2C0706.1273%2C0706.2689%2C0706.2573%2C0706.1606%2C0706.2059%2C0706.1841%2C0706.1880%2C0706.1503%2C0706.3560%2C0706.0156%2C0706.4263%2C0706.1749%2C0706.0138%2C0706.1915%2C0706.2493%2C0706.2459%2C0706.1263%2C0706.3442%2C0706.0059%2C0706.3821%2C0706.4297%2C0706.1116%2C0706.1739%2C0706.0824%2C0706.2723%2C0706.3406%2C0706.2078%2C0706.3900%2C0706.4292%2C0706.0749%2C0706.4459%2C0706.1970%2C0706.1527%2C0706.3386%2C0706.2204%2C0706.2419%2C0706.0552%2C0706.3559%2C0706.3219%2C0706.1272%2C0706.3006%2C0706.1101%2C0706.0789%2C0706.4330%2C0706.0794%2C0706.3735%2C0706.2529%2C0706.3491&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Correlation Properties of the Electron-Hole Plasma Interecting with the\n  Exciton Gas and the Formation of Inhomogeneous State"}, "summary": "The correlation properties of the cold system consisting of the electron-hole\nplasma interacting with the exciton gas are analyzed. It is shown that the\nhomogeneous state of the system is unstable and in the stationary state the\ndensities of the electron-hole plasma and exciton gas are modulated.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0706.0533%2C0706.4445%2C0706.1087%2C0706.1127%2C0706.1916%2C0706.2631%2C0706.1203%2C0706.1045%2C0706.0691%2C0706.3165%2C0706.4345%2C0706.2797%2C0706.2071%2C0706.2911%2C0706.3794%2C0706.4319%2C0706.2505%2C0706.0949%2C0706.2299%2C0706.3510%2C0706.0432%2C0706.1454%2C0706.0649%2C0706.1410%2C0706.2407%2C0706.1256%2C0706.0648%2C0706.4470%2C0706.3188%2C0706.2110%2C0706.1262%2C0706.0952%2C0706.2457%2C0706.0205%2C0706.0082%2C0706.0994%2C0706.0889%2C0706.4223%2C0706.2756%2C0706.2629%2C0706.2256%2C0706.2438%2C0706.1791%2C0706.0449%2C0706.1404%2C0706.4128%2C0706.1381%2C0706.4450%2C0706.0796%2C0706.2261%2C0706.1282%2C0706.2739%2C0706.0745%2C0706.1273%2C0706.2689%2C0706.2573%2C0706.1606%2C0706.2059%2C0706.1841%2C0706.1880%2C0706.1503%2C0706.3560%2C0706.0156%2C0706.4263%2C0706.1749%2C0706.0138%2C0706.1915%2C0706.2493%2C0706.2459%2C0706.1263%2C0706.3442%2C0706.0059%2C0706.3821%2C0706.4297%2C0706.1116%2C0706.1739%2C0706.0824%2C0706.2723%2C0706.3406%2C0706.2078%2C0706.3900%2C0706.4292%2C0706.0749%2C0706.4459%2C0706.1970%2C0706.1527%2C0706.3386%2C0706.2204%2C0706.2419%2C0706.0552%2C0706.3559%2C0706.3219%2C0706.1272%2C0706.3006%2C0706.1101%2C0706.0789%2C0706.4330%2C0706.0794%2C0706.3735%2C0706.2529%2C0706.3491&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The correlation properties of the cold system consisting of the electron-hole\nplasma interacting with the exciton gas are analyzed. It is shown that the\nhomogeneous state of the system is unstable and in the stationary state the\ndensities of the electron-hole plasma and exciton gas are modulated."}, "authors": ["V. S. Babichenko"], "author_detail": {"name": "V. S. Babichenko"}, "author": "V. S. Babichenko", "arxiv_comment": "9 pages", "links": [{"href": "http://arxiv.org/abs/0706.0994v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0706.0994v2", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "cond-mat.str-el", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.str-el", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0706.0994v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0706.0994v2", "journal_reference": null, "doi": null, "fulltext": "cond-mat\n\nCorrelation Properties of the Electron-Hole Plasma Interecting with the Exciton Gas\nand the Formation of Inhomogeneous State.\nV. S. Babichenko\nR.S.C. \"Kurchatov Institute\"\n(Dated:)\n\narXiv:0706.0994v2 [cond-mat.str-el] 21 Sep 2007\n\nAbstract\nThe correlation properties of the cold system consisting of the electron-hole plasma interacting with the exciton gas are\nanalyzed. It is shown that the homogeneous state of the system is unstable and in the stationary state the densities of the\nelectron-hole plasma and exciton gas are modulated.\n\n1\n\n\fThe problem of the existence of the Bose condensed state of the exciton gas in semiconductors is the subject of the\nexperimental and theoretical investigations for a long time. However, there is no undoubted proof of the existence of\nthis state until now.\nRecently, the properties of the cold exciton gas are investigated intensively, both experimentally and theoretically,\nin double 2D quantum wells, besides, electrons are localized on one plane of these wells and the holes are localized\non the other plane. The state of the cold exciton system being observed in the experiments of different experimental\ngroups [1], [2], [3], [5], [8], [10], [11], [4], [6], [7] is nonhomogeneous, and the density of the system in these experiments\nis modulated in space.\nThe theory of this phenomenon based on the Turing kinetic mechanism of the instability [12] have been proposed in\nworks [8], [9]. In this theory the system of nonlinear diffusion equations with sources of particles for electrons, holes\nand excitons are proposed and solved. The solution of these equations demonstrates the state with the periodically\nmodulated density of the exciton system only if the constant describing the decay of excitons depends on their density.\nHowever, in the low density approximation this dependence should be neglected. Moreover, this mechanism has the\nclassical character and does not describe the systems with the quantum coherency, but for the sufficiently small\ntemperatures one can suppose the existence of the coherency in the exciton system [15], [16], [18].\nAnother theory, based on the supposition of the existence of the attraction between excitons at large distances and\nthe formation of the liquid phase in the low-density exciton system due to this attraction, has been proposed in the\nwork [13]. The supposition of the existence of the liquid phase in the low-density exciton system is baseless. The\nexistence of the attractive part of the interparticle interaction potential in 2D Bose systems results in the collapse of\nthe system to the densities of the order of the squared inverse radius of the repulsive core [? ]. However, for these\ndensities excitons can not exist as individual particles, they are destroyed and form the electron-hole liquid. Note that\nin the usual 3D case, as it was shown in the work [15], the scattering amplitude for the isotropic excitons is positive\nand is equal to the value a = 13π\n3 aB , where aB is the effective Bohr radius, and just the scattering amplitude, but not\nthe bare potential, determines the properties of the system in the case of small densities. The effective Bohr radius\n2\nmh\nis the reduced mass, me,h are electron (e)\nhas the form aB = m∗~(e∗ )2 ; where ~ is the Planck constant; m∗ = mmee+m\nh\nand hole (h) masses, which are supposed to be isotropic and of the same order me ∼ mh ; e∗ is the effective charge\n\u0010 2 \u00111/2\n; where e is the bare electron charge and κ0 is the static dielectric constant of the\nin the semiconductor e∗ = κe 0\nsemiconductor. As the result, the 3D exciton system of small density can exist only in the gas phase. The repulsion for\nthe interaction between excitons in 2D system, where electrons and holes are localized on different planes, is sharply\ndefined than in the usual 3D case due to the geometrical constraint. In this case the formation of the exciton liquid\nphase is possible only for the densities nex ≥ 1/a2ex , where aex is the size of the exciton. The size of the exciton is\nequal to the effective Bohr radius aex = aB in the case of the small distance l between the planes of the quantum wells\nl << aB , and aex >> aB for the large distance between planes when l >> aB . If the exciton density is sufficiently\nlarge nex ≥ 1/a2ex the excitons can not be considered as the individual particles. In this case the electron-hole system\nrepresents the strongly interacting electron-hole liquid.\nIn the present work the Coulomb correlations in the cold electron-hole plasma as well as the quantum effects and\nthe coherency of the exciton subsystem in quantum wells are taken into account. We suppose that the external source\nis stationary, has the frequency larger than the semiconductor gap ∆g and creates electrons and holes being localized\non different planes. Moreover, the region of the action of the electromagnetic field is supposed to be sufficiently small.\nIn this case the electron-hole plasma being created by the external source propagates along 2D planes, besides, the\nelectrons propagate along one plane and the holes along the other plane. During this propagation the electron-hole\nplasma loses the energy giving away the energy to the phonon system and comes to the equilibrium state with the\nsmall temperature T. Note that the parameters of the stationary state, such that the densities of the electron-hole\nplasma n and the exciton gas nex , are defined by the equilibrium between incoming rate of the electrons, holes and\nexcitons and outgoing rate of these particles.\nThus, the model being analyzed represents the quasi-equilibrium electron-hole plasma from which the exciton gas is\ncreated as the result of the formation of the electron-hole bound states. In the present work we consider the properties\nof the stationary state of this system, namely, the properties of the electron-hole plasma of the small density na3B << 1\ninteracting with the exciton gas of small density nex a3B << 1.\nThe small density of the electron-hole plasma and the exciton gas are necessary if we suppose the existence both\nelectron-hole plasma and the exciton gas. In the opposite case of the large density na3B >> 1 the excitons are\ndestroyed and can not exist as the individual particles. This case is not under consideration in this work. Note that\nthe experiments [1], [5], [8] demonstrate the existence of the excitons, and this means the existence of small density\nof the electron-hole plasma in these experiments.\nWe analyze the correlation properties of the electron-hole plasma of the small density and the interaction of this\n2\n\n\fplasma with the exciton gas. The energy of the ground state of the electron-hole plasma has a minimum value as the\nfunction of the density at some density n0 such that n0 a2B ∼ 1. As a result, the electron-hole plasma tends to form\nthe liquid electron-hole drops and the homogeneous state of the system becomes unstable. The inhomogeneous state\nof the electron-hole plasma creates the periodic mean field which acts on the exciton gas and makes the density of\nthe exciton system modulated in space.\nWe suppose that the system consisting of the electron-hole plasma interacting with the exciton gas is in the\n(e,h)\n(ex)\n(e,h)\nstationary state with some small temperature T obeying the inequality T << εF\n<< Eb ; where εF\nare the\n(e,h)\n\nFermi energies of the electrons and the holes correspondingly εF\n\n=\n\np2F\n2me,h ;\n\nthe Fermi momentum pF in 2D case is\n\n1/2\n\nexpressed by the equality pF = (2πn) ; the average density n of the electron-hole plasma is equal to the density of\n2\n(ex)\n(ex)\neach component n = ne = nh ; Eb\nis the exciton bound energy Eb = 2m~∗ a2 . Below we use the system of units in\nB\nwhich ~ = m∗ = e∗ = 1.\nEFFECTIVE ACTION\n\nTo analyze the properties of the exciton system interacting with the electron-hole plasma the effective action for the\nslow fields is derived. In this paper the properties of the stationary state of this system is under consideration, but in\nfuture the kinetics of the formation of this state is supposed to be analyzed. For this reason the Keldysh-Schwinger\ntechnique for the nonequilibrium processes [17], [19] in the functional integral formulation (see [20], for example) is\nused for the derivation of the effective action of the slow fields. The generation functional for the considering system\ncan be written as\n\nZ=\n\n\u0013\n\u0012\nZ Y\nI\n\u0001\nDψα Dψ α exp iSe−h + i dtd2 r J α ψα + ψ α Jα\n\n(1)\n\nα\n\nThe action of the electron-hole plasma in the electron-hole representation has the form\n\nSeh =\n\nI\n\nd3 xd3 x′\n\n\n\n\n\n\nX\n\nα=e,h\nX\n\n1\n\n\n −2\n\n\u0010 \u0011i\nh\n→\n−\np ψα (x) δ (x − x′ ) −\nψ α (x) i∂t + μα − εα c\nα+β\n\n(−1)\n\nα,β\n\n\n\n\n\n\n(2)\n\nbC ψ β (x′ ) ψβ (x′ ) δ (t − t′ ) \nψ α (x) ψα (x) U\n\n\n\n→\n→\n−\nhere x = (t, −\nr ) denotes the collection\n\u0010 \u0011\n\u0010 t \u0011and space coordinates r in 2D; ψe and ψh are fermion (Grassmann)\n\u0010 \u0011 of time\n→\n−\n→\n−\n→\n−\np =\np are the dispersive laws of the electron and hole bands εα c\np and εh c\nfields of electrons and holes; εe c\n2\n→\n−\n→\n−\n→ −\n−\n→′\n→\n−\n1\n1 c\nc\nb\n2 ∆g + 2mα p , where ∆g is the semiconductor gap; p = −i ∇ is the momentum operator; UC = UC ( r − r ) =\ne2\n−\n−\nε0 |→\nr −→\nr ′|\n\n1\n= |→\nis the Coulomb interaction. In the Keldysh-Schwinger technique the time variable t changes along\n−\n−\nr −→\nr ′|\nthe double time contour with return.\nThe effective action for the electron-hole plasma with the formation of the exciton system have been obtained in\nthe functional-integral technique in [23], [24]. In this paper we give more simple derivation of the effective action and\nintroduce some simplification transforming to the density functional for the Fermi subsystem. Integrating over the\nrapid ψα -fields, changing on the scale much smaller than the average distance between the charge carriers n−1/3 , in\nthe ladder approximation we can obtain the action for the smooth fields in the form\n\n(s)\n\nSeh =\n\nI\n\nd3 xd3 x′\n\n\n\n\n\n\nX\n\nψ α (i∂t − ξα ) ψα δ (x − x′ ) −\n\n\u0001 α=e,h\n\u0001\n1\nbC ψ e ψe − ψ h ψh δ (t − t′ ) −\n\n−\nU\nψ\nψ\n−\nψ\nψ\ne\nh\n\nh\n 2 e\n\n1\n2\n\nX\n\nα,β=e,h\n\n\n\n\n\n\nψ α ψα Γαβ ψ β ψβ \n\n\n\n(3)\n\nhere the fields ψα are the smooth Fermi fields. The vertex Γαβ is the sum of the ladder diagrams. The internal\nGreen functions of these diagrams have the large momentums, much larger than pF , and the external lines of these\ndiagrams have the small momentums, much smaller than the internal lines. The value of the boundary momentum Λ\nseparating the rapid and the smooth fields obeys the inequality a~B >> Λ >> pF . The vertex Γ can be considered as\n3\n\n\findependent of the external momentums or frequencies due to the large values of the momentums corresponding to\nthe internal lines of this vertex, on the assumption that this vertex does not contain the pole. The vertexes Γee and\nΓhh do not contain the pole parts, but Γeh has the pole part corresponding to the formation of the bound state of\nthe electron and the hole, i.e. the exciton,\n\nΓeh (P, k, k ′ ) =\n\n\u0010−\n\u0010−\n\n\n\n→\u0011 ∗ −\n→\u0011 ∗ −\n→\n− 2 ! Z 2−\n→\nZ 2−\n−\n\u0011\n\u0010\nk ψ→\n(→\nq)\n−\np\n→\n−\np ψ→\nd →\np\nq X ψn k ψn ( q )\nd →\nk\n→\n UC −\n+\nq − k′\nE−\n(n)\n−\n\n2m∗\n(2π)2  n E − Eex\n(2π)2 E − E→\np + iδ\n+ iδ\n\n(4)\n\n\u0010−\n→\u0011\nThe wave functions ψn k are the relative motion wave functions of the discreet part of the spectrum of the\n\u0010−\n→\u0011\n−\nelectron-hole pair, ψ→\nk are the wave functions of the continuous part of the spectrum of the electron-hole pair;\np\n→\n−\n(n)\nthe energies Eex are the spectrum of the bound energies of the exciton; here we denote E = Ω + μe−h − P 2 /2M ,\n→\n−\n−\n→\n→\n−\n→\n2\n∗\n′ −\n′\nwhere μ\n= p /2m . The incoming p , p and outgoing p , p momentums of the ladder diagrams can be\ne−h\n\ne\n\nF\n\nh\n\ne\n\nh\n\nrepresented in the form\n\n→\n→ −\nme −\n−\n→\nP + k;\npe=\nM\n→\n→ −\nme −\n→\n−\n′\nP + k ′;\npe=\nM\n\n→\n→ −\nmh −\n−\n→\nph=\nP − k\nM\n→\n→ −\nmh −\n→\n−\n′\nph =\nP − k′\nM\n\n→ →\n−\n→\nwhere the momentum P = −\npe+−\np h is the exciton momentum, i.e. the total momentum of the electron-hole pair\n→\n−\n→\n−\nforming the bound state. The wave functions ψn (−\nr ) and ψ→\np ( r ) of the discreet and continuous parts of the internal\nexciton spectrum obey the Schredinger equation\n!\n−2\n→\n∇\n1\n→\n→\n(n)\n−\nψn (−\nr ) = Eex\nψn (−\nr)\n− −\n2m∗\n|→\nr |\n!\n→2\n−\n1\n∇\n→\n→\n−\n→ − (−\n−\n−\n− −\nr)\nψ→\n−\np\np ( r ) = Eex ( p ) ψ→\n2m∗\n|→\nr |\nThe normalized solution of this equation in 2D for the lower energy state can be written in the momentum representation as\n→\nψ0 (−\np)=\nThe normalization of this wave function has the form\n\n√\n4 π\n3/2\n→\n(1 + −\np 2)\nR\n\nd2 p\nψ2\n(2π)2 0\n\n→\n(−\np ) = 1.\n(0)\n\nWe suppose that the energy E is near the lower bound energy of the exciton Eex . Separating the pole and the\nnon-pole terms we can write the vertex Γeh as\n\n\u0010 −\n→ −\n→\u0011\nΓeh P, k , k ′ =\n\n\u0013 \u0010 \u0011 \u0010 \u0011\n\u0010\n\u0011\u0012\n\u0010−\n→2\n−\n→′ \u00112\n→\n−\n→\n−\n(0)\n(0)\n∗\n∗\nEex − k /2m\n/2m ψ0 k ψ 0 k ′\nEex − k\nΩ + μe−h −\n\n→\n−2\nP\n2M\n\n−\n\n(0)\nEex\n\n+ iδ\n\n(c)\n\n+ Γeh\n\n(5)\n\n(c)\n\nwhere the term Γeh is the non-pole part of the vertex Γeh , which can be considered as a constant of\norder of\n\u0010 the−\n→\u0011\n(c)\nunity Γeh ∼ 1; the collection of the summarized frequency and the summarized momentum is P = Ω, P . Due\n→\n→\nto the smallness of the incoming and outgoing momentums | −\np\n|, | −\np ′ |<< ~/a = 1 the vertex Γ can be\ne,h\n\nB\n\ne,h\n\neh\n\nrepresented in the form\n\nΓeh (P ) =\n\nF\nΩ + μe−h −\n4\n\n→\n−2\nP\n2M\n\n(c)\n\n−\n\n(0)\nEex\n\n+ iδ\n\n+ Γeh\n\n(6)\n\n\fwhere the constant F in the case of the small incoming and outgoing momentums can be represented as\n\u0010\n\u00112\n(0)\nF = Eex\nψ0 (0)\n\n(c)\n\nNear the pole of the vertex Γeh the term Γeh ∼ 1 can be neglected. The vertex Γeh can be decoupled by the\nintroduction of the virtual exciton field b, and the action of the system can be written in the form\n\n(s)\n\nSe,h,ex =\n\nI\n\nd3 x\n\nwhere\n\n X\n\nψ α (i∂t − ξα ) ψα −\n\n\n1\n2\n\nα=e,h\n\nR\n\n\u0001\n\u0001 \nbC ψ e ψe − ψ h ψh + \nd2 r′ ψ e ψe − ψ h ψh U\n\n+b (i∂t − ξex ) b −\n\n√\n\u0001\nF bψe ψh + ψ h ψ e b\n\n\n\npb2\n(0)\n− μe−h + Eex\n2M\n\nξex =\n\n(7)\n\n(8)\n\n(0)\nEex\n= −EB\n\nEB is the bound energy of the internal exciton ground state. As it will be seen lower, the chemical potential for\nexcitons is connected with μe−h as\n(0)\n\n(0)\nμex = μe−h − Eex\n− < Te,h >\n\n(9)\n\n(0)\n\nat that, the value < Te,h > can be written as\n\n<\n\n(0)\nTe,h\n\n>=\n\nG(0)\ne\n\n′\n\n(x − x\n\n(0)\n) Gh\n\n′\n\n(x − x ) =\n\nZ\n\n−\n|→\np |>Λ\n\nd2 p\n2\n\n(2π)\n\n1\np2 /2m∗\n\n(10)\n\nIt is convenient to transfer from the Fermi fields of electron-hole plasma to the density variables, i.e. the density\nfunctional with respect to the Fermi fields. This transition can be accomplished by the introduction of the functional\nδ-function to the statistical sum\n\nZ=\n=\n\nZ\n\nZ\n\nDψα Dψ α DbDb exp (iSe,h,ex ) =\nDψα Dψ α DbDbDnα exp (iSe,h,ex )\n\nY \u0002\n\u0003\nδ ψ α ψα − nα\nα,x\n\nUsing the Fourier representation for the functional δ-function\n\u0013\n\u0012 I\nZ\nY \u0002\n\u0003\n\u0002\n\u0003\n3\nδ ψ α ψα − nα = DVα exp −i d xVα (x) ψ α ψα − nα\nx\n\nwe can rewrite the action in the form\n\nSe,h,ex [ψα , b, Vα , nα ] =\n\nI\n\n\u0013 \n\u0013\u0012\ni∂t − ξe − Ve\nb\nψe\n\n\n+ \nψ e , ψh\nb\ni∂\n−\nξ\n−\nV\nψ\nt\nh\nh\nh\nX\nd3 x\n1\nb\n\n\n\n\n + Vα nα − 2 (ne − nh ) UC (ne − nh ) + b (i∂t − ξex ) b \n\n\n\n\n\n\u0001\n\n\u0012\n\nα\n\n5\n\n(11)\n\n\fwhere\n\nZ=\n\nZ\n\nDψα Dψ α DbDbDnα DVα exp (iSe,h,ex [ψα , b, Vα , nα ])\n\n(12)\n\nIt is convenient to introduce new variables instead of nα and Vα , namely,\nn − δn\n2\nVh = V − δV\n\nn + δn\n;\n2\nVe = V + δV ;\n\nnh =\n\nne =\n\n(13)\n\nNote that the fields δn and δV correspond to the fluctuating violation of the electro-neutrality in the electron-hole\nplasma. The integrals over the fields ψα and δn in Eq.(12) are Gauss integrals and can be calculated. As a result we\nobtain the action in the form\n\u0014\u0012\n\ni∂t − ξe − (V + δV )\nb\nSex [b, Vα , nα ] = −iSp ln\nb\ni∂t − ξh − (V − δV )\n\u001b\n\u001a\nI\n1\n−1\n3\nb\n+ d x V n + δV UC δV + b (i∂t − ξex ) b\n2\n\n\u0013\u0015\n\n+\n\n(14)\n\nThe supposition of the low exciton density gives the possibility to expand in powers of the field b. Integrating over\nthe fields δV and neglecting the powers higher than b4 we obtain\n\u0014\u0012\n\n\u0013\u0015\ni∂t − ξe − V\n0\nSex [b, Vα , nα ] = −iSp ln\n+\n0\ni∂t − ξh − V\n)\n(\n( \u0014\u0012\n\u0014\u0012\n\u0013\n\u0013\n\u00152\n\u00154 )\n1\n1\n0 b b (0)\n0 b b(0)\nG [V ]\n+ iSp\nG [V ]\n−\n+ iSp\nb 0\nb 0\n2\n4\nI\n\b\n− Ecorr [V ] + d3 x V n + b [i∂t − ξex ] b\n\n(15)\n\nThe functional Ecorr [V ] is the correlation energy. This functional is represented as the sum of all simply connected\nclosed diagrams dressed by the internal Coulomb interaction lines and the lines of the external field V. In the case of\nconstant V the correlation energy Ecorr [V ] can be represented in the well-known form\ni\nh\n1\nbC = i 1\nEcorr [V ] == −i Sp ln 1 − Π [V ] U\n2\n2\n\nZ1\n0\n\ndg\n\nZ\n\ndωd2 k\n\nUC (k) Π [V ]\n1\n−\ngUC (k) Π [V ]\n(2π)\n3\n\n(16)\n\nwhere Π [V ] is the total polarization operator. The simple transformations of the second and third terms in (15)\ngive the action Sex in the form\n\u0014\u0012\n\n(0)\n\ni∂t − ξe − V\n0\n0\ni∂t − ξh − V\n\n\u0013\u0015\n\nSex [V, n] = −iSp ln\n− Ecorr [V ] +\n\u001a\n\u001b\nI\n\u00012\n\u0001\n1\n3\n+ d x V n + b [i∂t − ξex ] b − γex bb − γex−e,h bb n\n2\n\n(17)\n\nThe value < Te,h > has the form (10). The coupling constant γex is the exciton-exciton scattering amplitude;\nand γex−e,h = γex−e + γex−h where γex−e , γex−h are the exciton-electron and exciton-hole scattering amplitudes,\nrespectively.\nThe first order expansion of the first term in Eq.(17) over the field V gives the change\nV n → V (n− < n >),\nR 2\n−\nd rn(t,→\nr)\n, where V ol is\nwhere < n > is the average density of the electron-hole plasma in stationary state < n >=\nV ol\n6\n\n\fthe volume of the system. The second order expansion of the first term in Eq.(17) in series of the field V and the\nintegration over this field gives\nI\n\nSex [b, n] =\n\n3\n\nd x\n\n(\n\nh\n\ni\n)\n(n− < n >) − Ecorr [n] +\n\u00012\n\u0001\n+b [i∂t + μex − μe−h − ξex ] b − 12 γex bb − γex−e,h bb n\n1\n2\n\n(n− < n >) Π(0)\n\n\u0001−1\n\nwhere Π(0) is the polarization operator of the form Π(0) (x − y) = −i\n\n(18)\n\nX (0)\n(0)\nGα (x − y) Gα (y − x). Expending in\nα\n\nseries of the field V we suppose the smallness of this field. This supposition is correct when the fluctuations of the\ndensity n are small compared with < n >. This supposition is correct for the beginning of the density fluctuations\ngrowth. The derivation of the effective action in the supposition of the smooth variation of the density n at the scales\nlager than the average distance between particles without supposition of the smallness of the density fluctuations will\nbe considered in the next paper.\nINSTABILITY OF THE SYSTEM AND THE DENSITY MODULATION OF THE ELECTRON-HOLE\nPLASMA\n\nUsing the effective action for the interacting electron-hole plasma and the exciton gas Sex [b, n] Eq.(18) we show that\nthe homogeneous state of this system is unstable, and due to the Coulomb correlations the low density electron-hole\nplasma should form the inhomogeneous state. The formation of the inhomogeneous state of the low density electronhole plasma is the result of the tendency of the low density plasma to collapse to the liquid electron-hole drops. The\ninteraction of this plasma with the exciton gas results in the existence of the self-consistent nonhomogeneous periodic\nfield acting on the exciton system as the periodic external field. This periodic field results in the density modulation\nof the exciton system.\n\u0010 →\n−\u0011\nTo analyze the effective action for simplicity we put m = me = mh = 1. The polarization operator Π(0) ω, k for\n→\n−\n| k |<< pF is calculated as\n(0)\n\nΠ\n\n\u0010\n\n−\u0011\n→\nω, k =\n\n(\n\n2\nm (kVF )\n2π\nω2 \u0010\n− π1 m 1\n\n+ iπ\n\n\u0010\n\nω\nkVF\n\n\u0011\u0011\n\nfor ω >> kVF\nfor ω << kVF\n\n)\n\n(19)\n\nThe correlation energy Ecorr [n] for small densities na2B << 1 can be calculated as\nEcorr [n] = −An4/3\n\n(20)\n\nwhere the constant A is estimated as A ∼ 1. The main contribution to the integral for Ecorr [n] (16) is given by\nthe momentums k0 ∼ n1/3 >> pF ∼ n1/2 and the frequencies ω0 ∼ k02 . Note that the Hartree-Fock energy for this\nsystem is estimated as\n\nEH−F [n] ∼ −\n\nn2\n∼ −n3/2\npF\n\n(21)\n\nThus, the contribution of the Hartree-Fock energy can be neglected compared with the correlation energy\nEH−F (n) << Ecorr (n) for na2B << 1.\n\u0010 −\n→\u0011\nThe substitution of the polarization operator Π(0) ω, k Eq.(19) for ω >> kVF to Eq.(18) gives\nSex [n] =\n\nI\n\nd3 x\n\n(\n\nh\nh\ni\ni\n)\n1\nω2\n(∆n) 2π\n(∆n)\n−\nE\n(n)\n+\n2\ncorr\n(kVF )\n\u00012\n\u0001\n+b [i∂t − ξex ] b − 21 γex bb − γex−e,h bb n\n\nwhere ∆n = n− < n > and expanding in ∆n the functional Ecorr [n] we obtain\n\n7\n\n\fSex [δn] =\n\nI\n\n3\n\nd x\n\n(\n\nh\n\nω2\n1\n2π (kVF )2\n\u00012\n− 12 γex bb\n\n(∆n)\n\ni\n)\n′′\n(< n >) (∆n) + b [i∂t − ξex ] b−\n− 12 Ecorr\n\u0001\n\u0001\n− γex−e,h bb < n > −γex−e,h bb ∆n\n\n(22)\n\nIn these expressions the frequency ω should be considered as ω = i∂t . TheR term linear over ∆n, namely,\n′\nEcorr\n(< n >) ∆n, can be omitted if the total number of particles is fixed, i.e., ∆n = 0. The substitution of\n′′\nEcorr\n(< n >) (20) to (22) gives\nSex [δn] =\n\nI\n\n3\n\nd x\n\n(\n\ni\n\nh\n\nω2\n2\n1\n−2/3\n2π (kVF )2 + 9 A < n >\n\u00012\n\u0001\n− 12 γex bb − γex−e,h bb < n\n\n∆n\n\n∆n + b [i∂t − ξex ] b+\n\u0001\n> −γex−e,h bb ∆n\n\n)\n\n(23)\n\nFrom the first term in Eq. (23) it can be seen that the system is unstable relative to the phonon oscillations\nof the electron-hole \u0001plasma density. The sound velocity of the density oscillations has the imaginary value | c |2 =\n4π\n−2/3\nVF2 . Note that the sound character of the considering density fluctuations is not surprising, since\n9 A< n>\nthese fluctuations do not violate the electro-neutrality of the electron-hole plasma. This instability results in the\ngrowth of the density fluctuations of the plasma with the increment of the growth\n\nζ=\n\n\u0012\n\n\u00131/2\n4π\nA\n< n >−1/3 kVF ∼ k < n >1/6 >> kVF\n9\n\nThis increment of the growth corresponds to the frequency which is much larger than kVF , ζ >> kVF . Due to\n2\nthis inequality we can use the asymptotic of the polarization operator Π(0) (ω, k) ∼ (kVωF2 ) being correct for the large\nfrequencies ω >> kVF .\nAs the result, the stationary state of the electron-hole plasma should be nonhomogeneous, besides, the modulation\nof the density has the periodic character.\nThe modulated density of the electron-hole plasma results in the existence of the self-consistent field acting on the\nexciton system. This field has the form (23)\n−\n→\nV (→\nr ) = γex−e,h ∆n (−\nr)\nNote that this external for the exciton system potential plays the essential role, if the amplitude of this potential is\nlarger than the chemical potential of the exciton gas. This condition can be obeyed for the sufficiently large density\nof the electron-hole plasma, i.e., for the sufficiently large pump.\nAt the conclusion we estimate the radius of the character non-homogeneity of the electron-hole plasma from the\nkinetic consideration [22]. We suppose that the kinetics of the non-homogeneity formation is analogous to the kinetics\nof the electron-hole liquid drop formation or the phase immiscibility and can be described by the equation\n\u0001\nn0\n∂t πR2 n0 = 2πRVF n + 2πRVex nex − πR2\nτ\n\n(24)\n\nThe first term in the right hand side of the equation (24) is the incoming term and the second one is the outgoing\nterm; VF n is the current of Fermi particles incoming into the drop of the radius R; Vex nex is√the current of excitons\nγ nex\nincoming into the drop, Vex is the average velocity of excitons which can be written as Vex ∼ ex\n; n is the density\nm\nof the electron-hole plasma in the gas phase, nex is the density of excitons, and n0 is the density of the electron-hole\nliquid within the drop; τ is the lifetime of the carriers. There are no vapor terms in Eq.(24) since T=0, and particles\ncan not overcome work function from the liquid drop. The equilibrium value of the radius R can be found from\nEq.(24) as\n\nR0 = 2\n\nVF n + Vex nex\nτ\nn0\n\n(25)\n\nNote that the radiuses larger than R0 are not profitable due to the different dependence on R of the incoming and\noutgoing terms - the first one is the surface term and the second one has the volume character. From the point of\n8\n\n\fview of the phase immiscibility the liquid phase is the electron-hole liquid drops and the gas phase is the mixture of\nthe exciton gas and the electron-hole plasma of the small density.\nFinally, the set of drops forms the periodic structure. We suppose that this is the consequence of the homogeneity\nof the system in average. This periodic structure forms the external periodic field for the exciton gas. If this Bose\ngas could be considered as the ideal, it should be localized at the minima of the periodic external potential.\n\n[1]\n[2]\n[3]\n[4]\n[5]\n[6]\n[7]\n[8]\n[9]\n[10]\n[11]\n[12]\n[13]\n[14]\n[15]\n[16]\n[17]\n[18]\n[19]\n[20]\n[21]\n[22]\n[23]\n[24]\n\nL.V. Butov, A.C. Gossard, D.S. Chemla, Nature 418, 751(2002), cond-mat/0204482.\nD. Snoke, S. Denev, Y. Liu, L. Pfeiffer, K. West, Nature 418, 754 (2002).\nD. Snoke, Science 298, 1368 (2002).\nA.V. Larionov, V.B. Timofeev, JETP Lett, 73, 342 (2001)\nA.V. Larionov, V.B. Timofeev, P.A. Ni, S.V. Dubonos, I. Hvam, and K. Soerensen, JETP Lett. 75, 570 (2002).\nA. V. Gorbunov, V.B. Timofeev, JETP Lett, 84, 390 (2006).\nA. V. Gorbunov, V.B. Timofeev, Usp. Fiz. Nauk, 176, 652 (2006)\nL.V. Butov, L.S. Levitov, A.V. Mintsev, B.D. Simons, A.C. Gossard, and D.S. Chemla, Phys. Rev. Lett. 92, 117404 (2004),\ncond-mat/0308117.\nL.S. Levitov, B.D. Simons, and L.V. Butov, Phys. Rev. Lett. 94, 176404 (2005), cond-mat/0503628.\nD. Snoke, S. Denev, Y. Liu, L. Pfeiffer, and K. West, Solid State Comm. 127, 187 (2003).\nR. Rapaport, G. Chen, D. Snoke, S.H. Simon, L. Pfeiffer, K. West, Y. Liu, and S. Denev, cond-mat/0308150, Phys. Rev.\nLett. 92, 117408 (2004).\nA.M.Turing, Phil. Trans. R. Soc. London, Ser.B 327, 37 (1952).\nA.A. Chernyuk, V.I. Sugakov, Phys. Rev. B 74, 085303 (2006), A.A. Chernyuk, V.S. Kopp, V.I. Sugakov,\ncond-mat/ 0702392v1.\nV.S. Babichenko, JETP 64, 612 (1973)\nL.V. Keldysh, and A.N. Kozlov, JETP 27, 521 (1968).\nL.V. Keldysh, Problems of Theoretical Physics (Nauka, Moscow, 1972), p.433.\nL.V. Keldysh, JETP 47, 1515 (1964).\nL.V. Keldysh, Bose-Einstein Condensation (Cambridge University Press, 1995), p.246.\nJ. Schwinger, J. Math. Phys., 2, 407 (1961).\nV.S. Babichenko, and A.N. Kozlov, Solid State Comm. 59, 39 (1986).\nE.M. Lifshits, L.P. Pitaevskii, Physical Kinetics, (Nauka, Moscow, 1979).\nL. V. Keldysh, \"Excitones in Semiconductors\", (Nauka, Moscow, 1971).\nV. S. Babichenko, M. N. Kiselev, J. Mosc. Phys. Soc., 2, 311 (1993).\nV. S. Babichenko, M. N. Kiselev, JETP Lett., 57, 174 (1993).\n\n9\n\n\f"}