{"id": "http://arxiv.org/abs/0705.3809v2", "guidislink": true, "updated": "2007-10-29T10:01:28Z", "updated_parsed": [2007, 10, 29, 10, 1, 28, 0, 302, 0], "published": "2007-05-25T16:28:47Z", "published_parsed": [2007, 5, 25, 16, 28, 47, 4, 145, 0], "title": "The infrared behavior of Landau gauge Yang-Mills theory in d=2, 3 and 4\n  dimensions", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0705.3033%2C0705.3364%2C0705.4649%2C0705.0488%2C0705.2205%2C0705.0683%2C0705.0329%2C0705.4519%2C0705.0382%2C0705.2209%2C0705.3011%2C0705.3458%2C0705.0193%2C0705.2449%2C0705.2120%2C0705.4134%2C0705.2910%2C0705.0584%2C0705.4676%2C0705.1943%2C0705.4175%2C0705.2611%2C0705.2494%2C0705.4597%2C0705.2185%2C0705.1733%2C0705.3377%2C0705.0923%2C0705.3975%2C0705.4244%2C0705.0524%2C0705.1104%2C0705.2610%2C0705.1289%2C0705.4415%2C0705.4447%2C0705.0434%2C0705.1445%2C0705.4423%2C0705.3514%2C0705.2310%2C0705.1125%2C0705.2830%2C0705.4346%2C0705.3308%2C0705.3288%2C0705.2689%2C0705.1471%2C0705.0835%2C0705.2875%2C0705.3106%2C0705.2655%2C0705.4339%2C0705.2661%2C0705.2740%2C0705.2939%2C0705.0763%2C0705.0963%2C0705.2701%2C0705.0583%2C0705.4012%2C0705.0281%2C0705.0806%2C0705.0942%2C0705.3969%2C0705.0573%2C0705.0577%2C0705.4622%2C0705.0186%2C0705.4324%2C0705.1842%2C0705.4070%2C0705.3095%2C0705.1591%2C0705.3742%2C0705.4491%2C0705.0130%2C0705.1138%2C0705.1214%2C0705.0697%2C0705.1313%2C0705.3869%2C0705.0038%2C0705.2281%2C0705.0371%2C0705.4554%2C0705.1335%2C0705.3541%2C0705.1648%2C0705.3539%2C0705.0410%2C0705.2696%2C0705.1888%2C0705.2132%2C0705.4281%2C0705.2468%2C0705.3809%2C0705.2897%2C0705.4140%2C0705.1131%2C0705.4588&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The infrared behavior of Landau gauge Yang-Mills theory in d=2, 3 and 4\n  dimensions"}, "summary": "We develop a general power counting scheme for the infrared limit of Landau\ngauge SU(N) Yang-Mills theory in arbitrary dimensions. Employing a skeleton\nexpansion, we find that the infrared behavior is qualitatively independent of\nthe spacetime dimension d. In the cases d=2, 3 and 4 even the quantitative\nresults for the infrared exponents of the vertices differ only slightly.\nTherefore, corresponding lattice simulations provide interesting qualitative\ninformation for the physical case. We furthermore find that the loop integrals\ndepend only weakly on the numerical values of the IR exponents.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0705.3033%2C0705.3364%2C0705.4649%2C0705.0488%2C0705.2205%2C0705.0683%2C0705.0329%2C0705.4519%2C0705.0382%2C0705.2209%2C0705.3011%2C0705.3458%2C0705.0193%2C0705.2449%2C0705.2120%2C0705.4134%2C0705.2910%2C0705.0584%2C0705.4676%2C0705.1943%2C0705.4175%2C0705.2611%2C0705.2494%2C0705.4597%2C0705.2185%2C0705.1733%2C0705.3377%2C0705.0923%2C0705.3975%2C0705.4244%2C0705.0524%2C0705.1104%2C0705.2610%2C0705.1289%2C0705.4415%2C0705.4447%2C0705.0434%2C0705.1445%2C0705.4423%2C0705.3514%2C0705.2310%2C0705.1125%2C0705.2830%2C0705.4346%2C0705.3308%2C0705.3288%2C0705.2689%2C0705.1471%2C0705.0835%2C0705.2875%2C0705.3106%2C0705.2655%2C0705.4339%2C0705.2661%2C0705.2740%2C0705.2939%2C0705.0763%2C0705.0963%2C0705.2701%2C0705.0583%2C0705.4012%2C0705.0281%2C0705.0806%2C0705.0942%2C0705.3969%2C0705.0573%2C0705.0577%2C0705.4622%2C0705.0186%2C0705.4324%2C0705.1842%2C0705.4070%2C0705.3095%2C0705.1591%2C0705.3742%2C0705.4491%2C0705.0130%2C0705.1138%2C0705.1214%2C0705.0697%2C0705.1313%2C0705.3869%2C0705.0038%2C0705.2281%2C0705.0371%2C0705.4554%2C0705.1335%2C0705.3541%2C0705.1648%2C0705.3539%2C0705.0410%2C0705.2696%2C0705.1888%2C0705.2132%2C0705.4281%2C0705.2468%2C0705.3809%2C0705.2897%2C0705.4140%2C0705.1131%2C0705.4588&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We develop a general power counting scheme for the infrared limit of Landau\ngauge SU(N) Yang-Mills theory in arbitrary dimensions. Employing a skeleton\nexpansion, we find that the infrared behavior is qualitatively independent of\nthe spacetime dimension d. In the cases d=2, 3 and 4 even the quantitative\nresults for the infrared exponents of the vertices differ only slightly.\nTherefore, corresponding lattice simulations provide interesting qualitative\ninformation for the physical case. We furthermore find that the loop integrals\ndepend only weakly on the numerical values of the IR exponents."}, "authors": ["Markus Q. Huber", "Reinhard Alkofer", "Christian S. Fischer", "Kai Schwenzer"], "author_detail": {"name": "Kai Schwenzer"}, "author": "Kai Schwenzer", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1016/j.physletb.2007.10.073", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0705.3809v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0705.3809v2", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "10 pages, 10 figures, version to be published in Phys. Lett. B", "arxiv_primary_category": {"term": "hep-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "hep-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "hep-lat", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "hep-th", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0705.3809v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0705.3809v2", "journal_reference": "Phys.Lett.B659:434-440,2008", "doi": "10.1016/j.physletb.2007.10.073", "fulltext": "The infrared behavior of Landau gauge Yang-Mills theory\nin\n1\n\nd\n\n= 2, 3 and 4 dimensions\n1\n\n2\n\narXiv:0705.3809v2 [hep-ph] 29 Oct 2007\n\nMarkus Huber , Reinhard Alkofer , Christian S. Fis her\n\n1\n\nand Kai S hwenzer\n\n1\n\nInstitut für Physik, Universität Graz, Universitätsplatz 5, 8010 Graz, Austria\n2\nInstitut für Kernphysik, Darmstadt University of Te hnology,\nS hlossgartenstraÿe 9, 64289 Darmstadt, Germany\n\nAbstra t\n\nWe develop a general power ounting s heme for the infrared limit of Landau gauge SU (N ) YangMills theory in arbitrary dimensions. Employing a skeleton expansion, we \u001cnd that the infrared\nbehavior is qualitatively independent of the spa etime dimension d. In the ases d = 2, 3 and 4\neven the quantitative results for the infrared exponents of the verti es di\u001ber only slightly. Therefore,\norresponding latti e simulations provide interesting qualitative information for the physi al ase.\nWe furthermore \u001cnd that the loop integrals depend only weakly on the numeri al values of the IR\nexponents.\n\nThe infrared (IR) regime of Yang-Mills theory determines the fundamental non-perturbative properties of the non-Abelian gauge dynami s. In parti ular, the IR limit of Greens fun tions\nof the olored \u001celds are likely onne ted to the problem of on\u001cnement as demonstrated within the\ns enarios of Kugo-Ojima [1℄ and Gribov-Zwanziger [2, 3℄. Due to the intri ate nature of the problem an\ninvestigation via all available methods is desirable. Su h ombined e\u001borts via Dyson-S hwinger equations\n(DSE) [4, 5, 6, 7℄, renormalization group (RG) te hniques [8℄ and latti e gauge theory studies [9℄ led\nduring the last years to a oherent pi ture of the infrared regime in Landau gauge. Hereby, in the\nontinuum approa hes, the IR s aling limit of general Greens fun tions in four spa etime dimensions has\nbeen determined [10℄. It exhibits, as argued for in [11℄, a dominan e of the gauge \u001cxing part of the a tion,\ni.e. the Faddeev-Popov ghost. A simultaneous analysis of DSE and RG methods allowed furthermore to\nshow that this IR \u001cxpoint is unique [12℄.\nThe Greens fun tions of Yang-Mills theory in Landau gauge are studied extensively on the latti e,\nsee e.g. [9℄. These analyses show the IR in rease of the ghost dressing fun tion required in both the\nKugo-Ojima and the Gribov-Zwanziger s enario, as well as the IR s aling of the gluon dressing fun tion\nin a ordan e with DSE and RG analyses. The in\u001duen e of \u001cnite volume orre tions has been studied\nwithin DSE analyses on ompa t manifolds [13℄ whi h agree qualitatively with the \u001cnite IR limit of\nurrent latti e results. However, a on\u001crmation that even the gluon propagator vanishes weakly in the IR,\nwhi h is ne essary in the Gribov-Zwanziger s enario, has not yet been possible in four-dimensional latti e\nsimulations due to the large latti e sizes required to probe the IR regime. The situation is similar for the\nimportant but even harder determination of the s aling behavior of vertex fun tions or the quantitative\nextra tion of IR exponent. Lower dimensional latti es ould allow to test qualitative aspe ts of these\nGreens fun tions in a substantially simpler setting. Naturally, su h a surrogate study requires that the\ngeneri features are identi al to those in four-dimensional spa etime. Re ent latti e studies in two [14℄\nand three spa etime dimensions [15℄ indeed suggest a power-law behavior similar to the four dimensional\nase.\nSU (N ) Yang-Mills theory in three spa etime dimensions is also relevant from two other points of\nview. In the high temperature limit only the lowest Matsubara mode ontributes, leading to a dimensional\nredu tion and thus to an e\u001be tive \u001celd theory in three dimensions. The qualitative aspe ts of this e\u001be tive\ntheory, in parti ular with regard to its on\u001cning nature, may be overed by ordinary three-dimensional\ngauge theory [16℄. Similarly, Yang-Mills theory in the anoni al quantization approa h in Coulomb gauge\nIntrodu tion:\n\n1\n\n\f[17℄ with an appropriate hoi e for the va uum wave fun tional is stru turally similar to the orresponding\nthree-dimensional theory in Landau gauge.\nThese results motivate to study the dependen e of the infrared limit on the parameters of the theory in\nmore detail. It will turn out that the infrared solution of Yang-Mills theory is determined by the spa etime\ndimension d and one parameter κ that determines the IR exponents of propagators and verti es. In this\nwork we establish a manifest power ounting s heme for general vertex fun tions of Landau gauge YangMills theory in arbitrary dimensions. We \u001cnd qualitatively similar results as in the four-dimensional\nanalysis given in [10℄. Furthermore we dis uss the dependen e of the Dyson-S hwinger equations on the\ninfrared s aling parameter κ. In four dimensions it takes a value κ ≈ 0.595 within an approximation\nbased on the propagator DSEs and using a bare ghost-gluon vertex. A possible dressing of this vertex\nould hange this value slightly [6℄. Therefore we study to what extent these dynami al building blo ks\nin the DSEs depend on κ, employing an analysis of the IR-dominant integrals.\nIR exponents for arbitrary d: In the following we will perform a s aling analysis for the IR regime\nof Yang-Mills theory in arbitrary dimensions. In ontrast to the generi IR limit we study the limit\nwhere the oupling g is kept \u001cxed and has no inherent s aling dependen e. Instead in dimensions other\nthan four it \u001cxes the fundamental s ale of the theory. This limit is more dire tly a essible in latti e\nsimulations and has been analyzed in [14, 15℄. A similar IR analysis has previously been performed for\nthe physi ally important ase d = 4 in refs. [10, 12℄. Although the s aling in arbitrary dimension may be\nabstra ted from these results via the onsideration of the appropriate anoni al s aling dimensons, we\nhose to give a on ise and nevertheless self- ontained derivation of the general s aling relations and refer\nthe reader to the orresponding work for details. We note, that our analysis is immediately appli able\nto the gauge se tor of QCD sin e losed quark loops are IR-suppressed due to the \u001cnite urrent quark\nmasses [18℄ and therefore there are no quark ontributions to purely bosoni Greens fun tions in the IR\nregime. This has been veri\u001ced in ref. [19℄.\nAnalog to the orresponding analysis in four dimensions [10℄, the starting point for the IR analysis is the\nnon-renormalization of the ghost-gluon vertex in Landau gauge [20℄, whi h implies a \u001cnite vertex in the\ninfrared [10℄. This property depends purely on the transversality of the gluon propagator and is, as long\nas the ghost-gluon s attering kernel is not strongly IR-divergent, therefore valid in arbitrary dimensions.\nWe ome ba k to this point below.\n\n-1\n\n-1\n\n=\n\n-\n\nFigure 1: The DSE for the ghost propagator.\nThe infrared behavior of the propagators and verti es well below its inherent s ale g 2/(4−d) (respe tively\nΛQCD in d = 4) is determined via renormalization group arguments by s aling relations. The propagators\nof the gluons and ghosts\n\u0013\n\u0012\npμ pν Z(p2 )\n,\nDμν (p ) = δμν − 2\np\np2\n\nDG (p2 ) = −\n\n2\n\nG(p2 )\n,\np2\n\n(1)\n\nare given in terms of dressing fun tions whose IR behavior is des ribed by a power law ansatz\nG(p2 ) = c2,0 * (p2 )δ2,0 ,\n\nZ(p2 ) = c0,2 * (p2 )δ0,2 ,\n\n(2)\n\nand similar for the verti es. Here we denote the IR exponent of a vertex with 2n ghost and m gluon\nlegs by δ2n,m and the orresponding oe\u001e ient by c2n,m . Whereas this oe\u001e ient is a onstant for the\npropagators it is generally a fun tion of 2n−m−1 momentum ratios.\nFor the integral on the right hand side of the ghost propagator Dyson-S hwinger equation, f. \u001cg. 1, one\nan use the standard expression [6, 21℄\nZ\n\nΓ( d2 + ν1 )Γ( d2 + ν2 )Γ(−ν1 − ν2 − d2 ) 2 d +ν1 +ν2\ndd q 2 ν1\n−d\n2 ν2\n2\n=\n(4π)\n((q\n−\np)\n)\n(q\n)\n(p ) 2\n(2π)d\nΓ(−ν1 )Γ(−ν2 )Γ(d + ν1 + ν2 )\n\n2\n\n(3)\n\n\f=\n\n+\n\n−2\n\n1\n2\n\n+\n\n1\n2\n\n+\n\n+\n\n1\n2\n\n+***\n\nFigure 2: 1-loop part of the skeleton expansion of the DSE for the three-gluon vertex.\nwhi h shows that it s ales proportional to the external momentum. The left hand side of the ghost DSE,\nwhi h onsists only of the inverse dressed ghost propagator, is proportional to (p2 )−δ2,0 +1 . The 1 omes\nfrom the anoni al dimension of the ghost propagator. The s aling dimensions on the right hand side are\nd/2 from the integral, δ0,2 − 1 from the gluon propagator, δ2,0 − 1 from the ghost propagator, 1/2 from\nthe bare ghost-gluon vertex, and 1/2 from the dressed ghost-gluon vertex whi h features no anomalous\ns aling. This yields as ondition for the IR exponents\n1 − δ2,0 =\n\n1 1\nd\n+ δ0,2 − 1 + δ2,0 − 1 + + .\n2\n2 2\n\n(4)\n\nDe\u001cning the parameter κ as κ := −δ2,0 , we re over in four dimensions the well-known result δ0,2 = 2κ.\nIn d dimensions we have [5, 6℄\nδ2,0 = −κ\n\n,\n\nδ0,2 = 2κ + 2 −\n\nd\n.\n2\n\n(5)\n\nA omparison between di\u001berent dimensions via κ is not possible dire tly, be ause κ has di\u001berent values\nfor di\u001berent d [5, 6, 16℄. We dis uss this point further below.\nIn order to transform the in\u001cnite hierar hy of Dyson-S hwinger equations into a losed system we\nperform a skeleton expansion. This yields an in\u001cnite tower of graphs involving only primitively divergent\nverti es whi h we will analyze in a \u001crst step. The \u001crst order of the skeleton expansion of the DSE for the\nthree-gluon vertex is depi ted in \u001cg. 2. We start with the ghost triangle whi h turns out to be one of the\ninfrared leading diagrams. We have d/2 from the integral, 3(−κ−1) from the three ghost propagators and\n3/2 from the three ghost-gluon verti es. We subtra t the anoni al dimension 1/2 to get the anomalous\nIR exponent of the ghost triangle of the three-gluon vertex:\ngh∆\nδ0,3\n=\n\nd\n1 1\nd\n+ 3(−κ − 1) + 3 − = −3κ + − 2 .\n2\n2 2\n2\n\n(6)\n\nFor the four-gluon vertex we an apply the same pro edure. In \u001cg. 3 we show the \u001crst order of its\nskeleton expansion. Here, also the ghost re tangle gives one of the IR dominant ontributions. Simple\nounting of the powers yields for the IR exponent of this diagram\ngh\u0003\nδ0,4\n=\n\nd\n1\nd\n+ 4(−κ − 1) + 4 = −4κ + − 2 .\n2\n2\n2\n\n(7)\n\nNow we are in the position to derive the IR exponents of the other diagrams of the three-gluon vertex\nDSE in \u001cg. 2. The gluon triangle ontains three propagators as well as two dressed and one bare threegluon vertex, so in luding the loop integral and subtra ting the anoni al dimension the IR exponent is\nd/2 + 3(2κ + 1 − d/2) + 2(−3κ + d/2 − 3/2) + 1/2 − 1/2 = 0. Correspondingly, the other orre tions,\nin luding the two-loop diagrams that are not shown, are likewise subleading ompared to the dominant\n3\n\n\f=\n\n−2\n\n−2\n\n−2\n\n+\n\n+\n\n+\n\n+ 12\n\n+ 12\n\n+ 12\n\n+\n\n+\n\n+\n\n+\n\n+\n\n+\n\n+ ***\n\nFigure 3: 1-loop part of the skeleton expansion of the DSE for the four-gluon vertex.\nghost loop. The same holds for the four-gluon vertex. In general, the IR exponents of these purely gluoni\ndiagrams are independent of the dimension and therefore identi al to eqs. (13) and (15) in [10℄.\nWith the s aling information of all primitively divergent Greens fun tions at hand we have all parts\nto al ulate the IR exponent of an arbitrary n-point fun tion. The di\u001berent obje ts that an appear in\norresponding general graphs are given in table 1. In terms of these building blo ks the IR exponent of\nan arbitrary vertex v is given by\nd\nδv =(l − mi + v0,3 + v0,4 ) + (2mi − ni − 3v0,3 − 4v0,4 )κ+\n2\n1\nb\n− 3v0,3 − 4v0,4 − 2v) ,\n+ (2mi − 2ni + v2,1 + v0,3\n2\n\n(8)\n\nwhere v is the anoni al s aling dimension of the vertex. This formula an be simpli\u001ced using standard\nrelations between the number of loops, the number of verti es and the number of propagators. The\nnumber of loops is given in terms of the internal lines and verti es via the topologi al relation\nb\nb\nl = mi + ni + 1 − (v2,1 + v0,3\n+ v0,3 + v0,4\n+ v0,4 ) .\n\n(9)\n\nFurther topologi al relations that onne t the number of lines of a given spe ies with the orresponding\nverti es allow to rewrite the expression in terms of the number of external lines whi h are denoted by m\nand n for gluons and ghost-antighost-pairs, respe tively:\nb\nb\nm + 2mi = v2,1 + 3(v0,3\n+ v0,3 ) + 4(v0,4\n+ v0,4 ) ,\n\nn + ni = v2,1 .\n\nobje t\nloop\ninternal ghost line\ninternal gluon line\nghost-gluon vertex\nbare 3-gluon vertex\ndressed 3-gluon vertex\nbare 4-gluon vertex\ndressed 4-gluon vertex\n\nnumber of obje ts\nl\nni\nmi\nv2,1\nb\nv0,3\nv0,3\nb\nv0,4\nv0,4\n\n(10)\n(11)\n\ns aling dimension\nd/2\nδ2,0 − 1 = −κ − 1\nδ0,2 − 1 = 2κ + 1 − d/2\n1/2\n1/2\nδ0,3 + 1/2 = −3κ + d/2 − 3/2\n0\nδ0,4 = −4κ + d/2 − 2\n\nTable 1: Infrared behavior of the building blo ks of general loop diagrams within the skeleton expansion.\n4\n\n\fThe anoni al dimension of the vertex is \u001cnally given in terms of its external lines\nv=\n\n4 − (2n + m)\nm\n=2−n−\n.\n2\n2\n\n(12)\n\nInserting eqs. (9), (10), (11) and (12) into eq. (8) we get\nd\nb\nb\nb\nb\n+ 3v0,3\n− m + n)κ+\nδ2n,m = (−n + 1 − v0,4\n− v0,3\n) + (4v0,4\n2\nb\nb\n+ (2v0,4\n+ 2v0,3\n+ 2n − 2) .\n\n(13)\n\nThis formula is still dependent on bare verti es. However, when onsidering di\u001berent terms of the skeleton\nexpansion of an n-point fun tion, one easily sees that terms ontaining bare three- and four-gluon verti es\nare not the IR-dominant ones be ause ontributions from these terms are\nd\n+ 2) ,\n2\nd\nb\nv0,4\n(4κ − + 2) ,\n2\n\n(14)\n\nb\nv0,3\n(3κ −\n\n(15)\n\nand thereby always add a positive power of momenta. Consequently, we an negle t these diagrams,\nb\nb\nwhen ounting only IR leading ones, i.e. we an set v0,3\n= v0,4\n= 0 in (13) and obtain as a \u001cnal result\nfor the IR exponent of an n-point fun tion the simple expression\nδ2n,m = (n − m)κ + (1 − n)\n\n\u0012\n\nd\n−2\n2\n\n\u0013\n\n(16)\n\n.\n\nThis relation veri\u001ces a posteriori the assumption dis ussed above \u001cg. 1: the ghost-gluon s attering kernel\nis exa tly as IR-divergent as to make the ghost-gluon vertex \u001cnite in the IR, and this is independent of\nthe value of the dimension d.\nIt remains to dis uss higher order orre tions in the skeleton expansion. From eq. (16) we an see\nimmediately that there are in\u001cnitely many higher orders terms whi h have the same IR behavior as the\nleading term: Insertions whi h lead to higher orders only ontribute with dressed verti es and propagators,\nand these were all onsidered in the derivation of eq. (16). These insertions with their orresponding IR\nexponents are given by:\n(2κ + 1 − d2 ) + 2(−κ − 1) + 2 12 +\n\nd\n2\n\n=0\n\nA\n2(2κ + 1 − d2 ) + (−κ − 1) + (−3κ + d2 − 32 ) + 21 + d2 = 0\n\nB\n3(2κ + 1 − d2 ) + 2(−3κ +\n\nd\n2\n\n− 23 ) +\n\nd\n2\n\n=0\n\nC\n2(2κ + 1 − d2 ) + (−4κ +\n\nD\n5\n\nd\n2\n\n− 2) +\n\nd\n2\n\n=0\n\n\f2,5\n\nSolutions for κ\nFit: y = -1 + 1/2*x\nFit: y = 2/5 - 2/5*x\n\n2,0\n1,5\n\nκ\n\n1,0\n0,5\n0,0\n-0,5\n-1,0\n\n0\n\n1\n\n2\n\n3\n\n4\n\n5\n\n6\n\nd\nFigure 4: The (mostly two) possible solutions for the IR exponent κ as a fun tion of dimension d, f.\nalso refs. [11℄ and [16℄. The linear \u001cts are exa t in some ranges of dimension d and approximate the real\nsolutions to good pre ision in others. The \u001crst bran h ontains the solutions κ = 0.2, κ = 0.3976... and\nκ = 0.5953... for d = 2, 3 and 4, respe tively, whereas the se ond one in ludes the solutions κ = 0, κ = 0.5\nand κ = 1 [5℄.\nIt should be noted that in ontrast to a uniform s aling limit we have kept the (dimensionful) oupling g\n\u001cxed. The IR power laws, eq. (16), are then valid for momenta p2 ≪ g 4/(4−d) . The resulting momentum\ndependent ouplings from the ghost-gluon vertex, αgh , the three-gluon vertex, α3g , and the four gluon\nvertex, α4g , (see [10℄ for a de\u001cnition) are then given by\ng2\n[Z2,1 (p2 )]2 G2 (p2 ) Z(p2 ) −−\n−→ (p2 )(4−d)/2 ,\n4π\np2 →0\ng2\nα3g (p2 ) =\n[Z0,3 (p2 )]2 Z 3 (p2 ) −−\n−→ (p2 )(4−d)/2 ,\n4π\np2 →0\ng2\n[Z0,4 (p2 )] Z 2 (p2 ) −−\n−→ (p2 )(4−d)/2 .\nα4g (p2 ) =\n4π\np2 →0\n\nαgh (p2 ) =\n\n(17)\n(18)\n(19)\n\nHere Z2,1 denotes the dressing fun tion of the tree-level stru ture of the ghost-gluon vertex and Z0,3\nand Z0,4 the orresponding dressing fun tions of the three- and four-gluon verti es, respe tively. To\nobtain these results the s aling laws, eq. (16), have been used. From this one may better understand the\nusefulness of the skeleton expansion: apart from B all diagrammati pie es given above ontain dressing\nfa tors of the same multipli ity as the ouplings, f. eqs. (17-19). Thus all anomalous dimensions\nan el and the anoni al dimension (4 − d)/2 of these ouplings is an elled by the anoni al dimensions\nand the extra loop. As a result the skeleton expansion indeed works independent of the value of the\nspa etime dimension d as ould have been expe ted from the previously studied four-dimensional ase\n[4, 5, 6, 10, 12℄.\nFinally, let us ompare the IR behavior of the Yang-Mills Greens fun tions in di\u001berent dimensions.\nThe orresponding values for the IR exponent κ (using a bare ghost-gluon vertex) are displayed in \u001cg. 4.\nApart from the region d < 1 we always have two possible values, whi h arise from an IR analysis of the\nghost and gluon propagator DSEs. We show the IR exponents of the ghost and gluon propagators and\nthe three- and four-gluon verti es in table 2. Whereas the situation in four dimensions is not on lusive,\nyet, the solutions belonging to the \u001crst bran h in \u001cg. 4 have been found in latti e studies in two and three\ndimensions. These results for the IR exponents of the propagators, the ghost-gluon vertex [22℄ and the\nthree-gluon vertex in two dimensions [14℄ agree within errors with the orresponding values given in table\n2. One an see that for this bran h the qualitative behavior does not hange in di\u001berent dimensions. The\nother bran h in \u001cg. 4 that starts at κ = −1 for d = 0 and ends at κ = 2 for d = 6 has not been seen in\nlatti e simulations. We will give some additional arguments below that this bran h may be unphysi al.\n6\n\n\fThe Dyson-S hwinger equations involve\nloop integrals over bare and dressed vertex fun tions. As just dis ussed the orresponding dressing\nfun tions exhibit a power law with appropriate infrared exponents. The orresponding oe\u001e ients depend\non the IR exponent κ. For the respe tive oe\u001e ients of the propagators, eq. (2), whi h an be omputed\nfrom the 2-point integral, eq. (3), this κ-dependen e is shown in \u001cg. 5, where κ-independent prefa tors\nhave been dropped. The physi al requirement that the dressing fun tions have to be positive restri ts the\npossible values of κ to κ ≤ 0.5 in two, 0.25 < κ ≤ 0.75 in three and κ > 0.5 in four dimensions [23℄. We\nnote that all known solutions ful\u001cll these requirements. The de isive point is, however, that although the\nurves in \u001cg. 5 di\u001ber onsiderable, the physi al values obtained from the Dyson-S hwinger solution are\nfar away from these poles and thereby the κ-dependen e in their vi inity is rather mild and qualitatively\nsimilar in ea h ase.\nDependen e of the loop integrals on the IR-exponent:\n\n1\n\n0.4\n\n0.8\n\n0.3\n\n0.6\n0.2\n\nc2,0\n\n0.4\n0.2\n\nc0,2 0.1\n\n0\n\n0\n\n-0.2\n\n-0.1\n\n-0.4\n0\n\n0.2\n\n0.4\n\n0.6\n\n0.8\n\n1\n\n0\n\n0.2\n\n0.4\n\nκ\n\n0.6\n\n1\n\n0.8\n\nκ\n\nFigure 5: The κ-dependen e of the unrenormalized dressing integrals appearing in the DSEs for the ghost\n(left) and gluon propagator (right). The dotted, dashed and solid lines show the urves for d = 2, 3 and\n4 respe tively, see also ref. [6℄. The full and open dots represent the solutions of the \u001crst and se ond\nbran h in \u001cg. 4.\nIn general the vertex integrals feature more ompli ated tensor stru tures with an in reasing number of\nindependent tensor omponents. However, there are general methods to de ompose su h tensor integrals\nto standard s alar integrals [24℄. The tensor integrals in the DSE for the ghost-gluon and three-gluon\nvertex redu e to 3-point integrals of the form\nI3 (p, q) ≡\n\nZ\n\ndd k\n1\n1\n1\n(2π)d ((k + p)2 )ν1 ((k − q)2 )ν2 (k 2 )ν3\n\n(20)\n\nwhere any additional momenta due to vertex fun tions in the numerator are in luded in the denominators\nfor appropriate values νi . A general expression for su h s alar 1-loop 3-point integrals in arbitrary\ndimensions and with arbitrary powers of the propagators has been obtained in [21, 25℄. An expli it\nevaluation of this result requires an expression for the resulting Appell fun tion F4 whose de\u001cning series\ndoes not onverge in the onsidered Eu lidean regime. A onverging expression an be obtained by\nanalyti ontinuation and has been given in [26℄. Unfortunately, the result given there is slightly in orre t.\nThe orre t and lengthy expression whi h agrees with a dire t numeri al integration of these integrals\nDimension\nκ\n\nGhost\nGluon\n3-gluon\n4-gluon\n\n−κ − 1\n2κ + 1 − d/2\n−3κ + d/2 − 3/2\n−4κ + d/2 − 2\n\n4\n0.5953... ≈ 0.6\n−1.6\n0.2\n−1.3\n−2.4\n\n3\n0.3976... ≈ 0.4\n−1.4\n0.3\n−1.2\n−2.1\n\n2\n0.2\n−1.2\n0.4\n−1.1\n−1.8\n\n4\n1\n−2\n1\n−1.5\n−4\n\n3\n0.5\n−1.5\n0.5\n−1.5\n−2.5\n\n2\n0\n−1\n0\n−0.5\n−1\n\nTable 2: The dimension dependen e of the infrared behavior of Yang-Mills Green fun tions. For ea h d\nthe two solutions for κ orresponding to the two alternative bran hes in \u001cg. 4 are displayed.\n7\n\n\fwill be given in a forth oming publi ation [27℄ where we will also give the detailed results for the di\u001berent\ntensor stru tures and their kinemati dependen e. Here we will merely dis uss the dependen e of the\noverlap of the tree-level tensor with the IR-dominant ghost triangle. A ording to the dis ussed power\nounting, the ghost loop presents the IR-leading ontribution to the Dyson S hwinger equation for the\nthree-gluon vertex in \u001cg. 2. Sin e this loop involves only ghost-gluon verti es that remain bare to leading\norder, its IR behavior an be analyzed semi-perturbatively using the s aling form of the dressed ghost\npropagators, see eq. (2). We onsider the spe ial kinemati on\u001cguration given by the symmetri point\np2 = q 2 = r2 . At this point the dressing fun tion of the leading ghost loop orre tion to the threegluon integral s ales a ording to eq. (6) as Z0,3 = c0,3 (κ) * (p2 )−3κ+d/2−2 where the dependen e of the\noe\u001e ient on the s aling parameter κ has been made expli it. The oe\u001e ient is shown as a fun tion of κ\nin \u001cg. 6, where the full and open points represent the values for the \u001crst and se ond bran h in \u001cg. 4 and\nκ-independent fa tors have been dropped again.\n0.1\n\n0.05\n\nc0,3\n\n0\n\n-0.05\n\n-0.1\n0\n\n0.2\n\n0.4\n\n0.6\n\n0.8\n\n1\n\nκ\n\nFigure 6: The κ-dependen e of the overlap of the unrenormalized ghost triangle with the tree-level tensor\nat the symmetri point. The dotted, dashed and solid lines show the urves for d = 2, 3 and 4 respe tively.\nThe full and open dots represent the solutions of the \u001crst and se ond bran h in \u001cg. 4.\nThe vertex integral has zeros at κ = 0 in two, κ = 0.5 in three and κ = 1 in four dimensions whi h oin ide\npre isely with the solutions of the se ond bran h. These zeros depend on the kinemati on\u001cguration and\nappear at higher values of κ away from the symmetri point. (The orresponding s alar integrals, f. eq.\n(20), feature even poles at these values of κ whi h pre isely an el for the tree-level tensor.) A ording\nto eq. (18) su h zeros in the vertex dressing fun tion would lead to an IR-vanishing oupling. Sin e\nYang-Mills theory is apparently a strongly intera ting theory, this indi ates that these solutions might\nnot be physi ally relevant. As in the ase of the propagators the κ dependen e in the vi inity of the\nsolutions of the \u001crst bran h is similar in all dimensions. The negative value of the three-gluon vertex in\ntwo dimensions nevertheless leads to a positive IR limit of the oupling α3g in eq. (18). However, it would\nause problems in its renormalization group \u001dow and might be an artifa t of the skeleton expansion and\nured by higher orders.\nCon lusions: We have studied generi features of the IR limit of SU (N ) Yang-Mills theory established\nin [4, 6, 7, 10℄ in more detail. As in the four-dimensional ase, the IR behavior of Greens fun tions an be\nextra ted via a skeleton expansion in arbitrary dimensions. We \u001cnd that the IR limit of Greens fun tions is\nsurprisingly insensitive on the spa etime dimension. This already onstitutes the \u001crst important result of\nthis study. As a onsequen e Yang-Mills theory in lower dimensions has a qualitatively similar IR limit as\nthe four dimensional theory. Thus the on\u001cnement me hanism might possess identi al features in di\u001berent\n\n8\n\n\fdimensions. Corresponding latti e simulations should provide interesting qualitative information for the\nphysi al ase. Indeed a re ent study on large two dimensional latti es [14℄ \u001cnds infrared exponents in\nagreement with the value κ = 0.2 , thus on\u001crming the Gribov-Zwanziger s enario also in two dimensions.\nThe results on the mild κ-dependen e of the remaining DSE solutions suggest that ghost dominan e\nis a rather robust me hanism and should not depend on the details of the employed trun ation s heme.\nThis is further substantiated by the fa t that the main non-linearities in the DSE system, whi h enable\nthe non-trivial \u001cxpoint, arise in the propagator equations whereas there is no non-linear feedba k to\nleading order in the vertex equations.\nA knowledgements: We are grateful to A. Maas and J. Pawlowski for valuable dis ussions and to A.\nMaas for a riti al reading of the manus ript. This work has been supported in part by the DFG under\nontra t AL279/5-1, by the FWF under ontra t M979-N16 and by the Helmholtz-University Young\nInvestigator Grant VH-NG-332.\n\nReferen es\n[1℄ T. Kugo and I. Ojima, Prog. Theor. Phys. Suppl. 66 (1979) 1.\n[2℄ V. N. Gribov, Nu l. Phys. B 139 (1978) 1.\n[3℄ D. Zwanziger, Nu l. Phys. B 364 (1991) 127.\n[4℄ L. von Smekal, R. Alkofer and A. Hau k, Phys. Rev. Lett. 79 (1997) 3591, [arXiv:hep-ph/9705242℄.\n[5℄ D. Zwanziger, Phys. Rev. D 65 (2002) 094039, [arXiv:hep-th/0109224℄.\n[6℄ C. Ler he and L. von Smekal, Phys. Rev. D 65 (2002) 125006, [arXiv:hep-ph/0202194℄.\n[7℄ R. Alkofer and L. von Smekal, Phys. Rept. 353 (2001) 281; C. S. Fis her, J. Phys. G 32 (2006) R253,\n[arXiv:hep-ph/0007355℄.\n[8℄ J. M. Pawlowski, D. F. Litim, S. Nedelko and L. von Smekal, Phys. Rev. Lett.\n[arXiv:hep-th/0312324℄.\n\n93\n\n(2004) 152002,\n\n[9℄ A. Sternbe k, E. M. Ilgenfritz, M. Mueller-Preussker and A. S hiller, Phys. Rev. D 72 (2005)\n014507, [arXiv:hep-lat/0506007℄; A. Cu hieri and T. Mendes, Phys. Rev. D 73 (2006) 071502,\n[arXiv:hep-lat/0602012℄; P. O. Bowman et al., [arXiv:hep-lat/0703022℄; O. Oliveira and P. J. Silva,\n[arXiv:0705.0964 [hep-lat℄℄.\n[10℄ R. Alkofer, C. S. Fis her and F. J. Llanes-Estrada, Phys. Lett. B\n[arXiv:hep-th/0412330℄.\n\n611\n\n(2005) 279,\n\n[11℄ D. Zwanziger, Phys. Rev. D 69 (2004) 016002, [arXiv:hep-ph/0303028℄.\n[12℄ C. S. Fis her and J. M. Pawlowski, Phys. Rev. D 75 (2007) 025012, [arXiv:hep-th/0609009℄.\n[13℄ C. S. Fis her, B. Gruter and R. Alkofer, Annals Phys. 321 (2006) 1918, [arXiv:hep-ph/0506053℄;\nC. S. Fis her, A. Maas, J. M. Pawlowski and L. von Smekal, to be published in Annals Phys.,\n[arXiv:hep-ph/0701050℄.\n[14℄ A. Maas, to be published in Phys. Rev. D, [arXiv:0704.0722 [hep-lat℄℄.\n[15℄ A. Cu hieri, A. Maas and T. Mendes, Phys. Rev. D 74 (2006) 014503, [arXiv:hep-lat/0605011℄;\nA. Cu hieri, T. Mendes and A. R. Taurines, Phys. Rev. D 67 (2003) 091502, [arXiv:hep-lat/0302022℄.\n[16℄ A. Maas, J. Wamba h, B. Gruter and R. Alkofer, Eur. Phys. J. C\n[arXiv:hep-ph/0408074℄.\n[17℄ W. S hleifenbaum, M. Leder and H. Reinhardt,\n[arXiv:hep-th/0605115℄.\n9\n\nPhys. Rev. D\n\n73\n\n37\n\n(2004) 335,\n\n(2006) 125019,\n\n\f[18℄ T. Appelquist and J. Carazzone, Phys. Rev. D 11 (1975) 2856.\n[19℄ C. S. Fis her and R. Alkofer, Phys. Rev. D 67 (2003) 094020, [arXiv:hep-ph/0301094℄.\n[20℄ J. C. Taylor, Nu l. Phys. B 33 (1971) 436.\n[21℄ C. Anastasiou, E. W. N. Glover and C. Oleari, Nu l. Phys. B 572 (2000) 307, [arXiv:hep-ph/9907494℄.\n[22℄ A. Cu hieri, T. Mendes and A. Mihara, JHEP\n\n0412\n\n(2004) 012, [arXiv:hep-lat/0408034℄.\n\n[23℄ A. Maas, PhD thesis, TU Darmstadt, 2004 [arXiv:hep-ph/0501150℄.\n[24℄ A. I. Davydy hev, Phys. Lett. B 263 (1991) 107.\n[25℄ A. I. Davydy hev, Vestn. Mosk. Univ. (Ser. 3) 28, No. 3 (1987) 8 [Mos . Univ. Phys. Bull. 42, No.\n3, (1987) 6℄; E. E. Boos and A. I. Davydy hev, Theor. Math. Phys. 89 (1991) 1052 [Teor. Mat. Fiz.\n89 (1991) 56℄.\n[26℄ H. Exton, J. Phys. A: Math. Gen. 28 (1995) 631.\n[27℄ R. Alkofer, M. Huber and K. S hwenzer, in preparation.\n\n10\n\n\f"}