{"id": "http://arxiv.org/abs/0707.3392v1", "guidislink": true, "updated": "2007-07-23T14:41:03Z", "updated_parsed": [2007, 7, 23, 14, 41, 3, 0, 204, 0], "published": "2007-07-23T14:41:03Z", "published_parsed": [2007, 7, 23, 14, 41, 3, 0, 204, 0], "title": "Neon Atoms Oscillating Inside Carbon and Boron-Nitride Nanotubes: A\n  Fully Atomistic Molecular Dynamics Investigation", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0707.4413%2C0707.2368%2C0707.1079%2C0707.4335%2C0707.1345%2C0707.2347%2C0707.1791%2C0707.4108%2C0707.3656%2C0707.3514%2C0707.4653%2C0707.1686%2C0707.0163%2C0707.4332%2C0707.1912%2C0707.4333%2C0707.0786%2C0707.2191%2C0707.1627%2C0707.3463%2C0707.2687%2C0707.3631%2C0707.3392%2C0707.2988%2C0707.2889%2C0707.4500%2C0707.0500%2C0707.3167%2C0707.3802%2C0707.2985%2C0707.2283%2C0707.4169%2C0707.3743%2C0707.3702%2C0707.2460%2C0707.2747%2C0707.0374%2C0707.3215%2C0707.4449%2C0707.3394%2C0707.0092%2C0707.2744%2C0707.4654%2C0707.3632%2C0707.1973%2C0707.3930%2C0707.3388%2C0707.1317%2C0707.1046%2C0707.0808%2C0707.1200%2C0707.4023%2C0707.0748%2C0707.0522%2C0707.1232%2C0707.3179%2C0707.1948%2C0707.1433%2C0707.1727%2C0707.3106%2C0707.0689%2C0707.1895%2C0707.3150%2C0707.0642%2C0707.1530%2C0707.2521%2C0707.0301%2C0707.0421%2C0707.0445%2C0707.3790%2C0707.4581%2C0707.1434%2C0707.1525%2C0707.1389%2C0707.1292%2C0707.3763%2C0707.4595%2C0707.2944%2C0707.4344%2C0707.1421%2C0707.0429%2C0707.2883%2C0707.3289%2C0707.2839%2C0707.1799%2C0707.0077%2C0707.3678%2C0707.0804%2C0707.3335%2C0707.0717%2C0707.2338%2C0707.1249%2C0707.2913%2C0707.2186%2C0707.4199%2C0707.0818%2C0707.0150%2C0707.0083%2C0707.0896%2C0707.2168%2C0707.3588&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Neon Atoms Oscillating Inside Carbon and Boron-Nitride Nanotubes: A\n  Fully Atomistic Molecular Dynamics Investigation"}, "summary": "In the present work we discuss based on extensive fully atomistic molecular\ndynamics simulations the dynamics of Neon atoms oscillating inside\n(5,5)single-walled carbon nanotubes (CNTs) and boron-nitride (BNNT) ones. Our\nresults show that sustained high frequency oscillatory regimes are possible for\na large range of temperatures. Our results also show that the general features\nof the oscillations are quite similar to CNT and BNNT, in contrast with some\nspeculations in previous work literature about the importance of broken\nsymmetry and chirality exhibited by BNNTs.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0707.4413%2C0707.2368%2C0707.1079%2C0707.4335%2C0707.1345%2C0707.2347%2C0707.1791%2C0707.4108%2C0707.3656%2C0707.3514%2C0707.4653%2C0707.1686%2C0707.0163%2C0707.4332%2C0707.1912%2C0707.4333%2C0707.0786%2C0707.2191%2C0707.1627%2C0707.3463%2C0707.2687%2C0707.3631%2C0707.3392%2C0707.2988%2C0707.2889%2C0707.4500%2C0707.0500%2C0707.3167%2C0707.3802%2C0707.2985%2C0707.2283%2C0707.4169%2C0707.3743%2C0707.3702%2C0707.2460%2C0707.2747%2C0707.0374%2C0707.3215%2C0707.4449%2C0707.3394%2C0707.0092%2C0707.2744%2C0707.4654%2C0707.3632%2C0707.1973%2C0707.3930%2C0707.3388%2C0707.1317%2C0707.1046%2C0707.0808%2C0707.1200%2C0707.4023%2C0707.0748%2C0707.0522%2C0707.1232%2C0707.3179%2C0707.1948%2C0707.1433%2C0707.1727%2C0707.3106%2C0707.0689%2C0707.1895%2C0707.3150%2C0707.0642%2C0707.1530%2C0707.2521%2C0707.0301%2C0707.0421%2C0707.0445%2C0707.3790%2C0707.4581%2C0707.1434%2C0707.1525%2C0707.1389%2C0707.1292%2C0707.3763%2C0707.4595%2C0707.2944%2C0707.4344%2C0707.1421%2C0707.0429%2C0707.2883%2C0707.3289%2C0707.2839%2C0707.1799%2C0707.0077%2C0707.3678%2C0707.0804%2C0707.3335%2C0707.0717%2C0707.2338%2C0707.1249%2C0707.2913%2C0707.2186%2C0707.4199%2C0707.0818%2C0707.0150%2C0707.0083%2C0707.0896%2C0707.2168%2C0707.3588&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "In the present work we discuss based on extensive fully atomistic molecular\ndynamics simulations the dynamics of Neon atoms oscillating inside\n(5,5)single-walled carbon nanotubes (CNTs) and boron-nitride (BNNT) ones. Our\nresults show that sustained high frequency oscillatory regimes are possible for\na large range of temperatures. Our results also show that the general features\nof the oscillations are quite similar to CNT and BNNT, in contrast with some\nspeculations in previous work literature about the importance of broken\nsymmetry and chirality exhibited by BNNTs."}, "authors": ["Karl M. Garcez", "David L. Azevedo", "Douglas S. Galvão"], "author_detail": {"name": "Douglas S. Galvão"}, "author": "Douglas S. Galvão", "links": [{"href": "http://arxiv.org/abs/0707.3392v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0707.3392v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "cond-mat.mtrl-sci", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.mtrl-sci", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0707.3392v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0707.3392v1", "arxiv_comment": null, "journal_reference": null, "doi": null, "fulltext": "arXiv:0707.3392v1 [cond-mat.mtrl-sci] 23 Jul 2007\n\nNeon Atoms Oscillating Inside Carbon and\nBoron-Nitride Nanotubes: A Fully Atomistic\nMolecular Dynamics Investigation\nKarl M. Garcez1 , David L. Azevedo1 , Douglas S. Galvão2\n1\n\nDepartamento de Fı́sica, Universidade Federal do Maranhão, 65080-040 São Luis,\nMaranhão, Brazil\n2\nInstituto de Fı́sica Gleb Wataghin, Universidade Estadual de Campinas, CP 6165,\n13083-970 Campinas, SP, Brazil.\nE-mail: david@ufma.br, galvao@ifi.unicamp.br\nAbstract.\nIn the present work we discuss based on extensive fully atomistic molecular\ndynamics simulations the dynamics of Neon atoms oscillating inside (5,5)singlewalled carbon nanotubes (CNTs) and boron-nitride (BNNT) ones. Our results show\nthat sustained high frequency oscillatory regimes are possible for a large range of\ntemperatures. Our results also show that the general features of the oscillations are\nquite similar to CNT and BNNT, in contrast with some speculations in previous work\nliterature about the importance of broken symmetry and chirality exhibited by BNNTs.\n\nPACS numbers: 68.65. k, 61.46.+w, 68.37.Lp, 71.15. m\n\n\fNeon Atoms Oscillating Inside Carbon and Boron-Nitride Nanotubes\n\n2\n\n1. Introduction\nSince the pioneering work of Cumings and Zetttl [1] carbon nanotube (CNT) based\noscillators have became object of many studies. Cumings and Zettl demonstrated the\ncontrolled and reversible telescopic extension of multiwalled CNTs, thus realizing ultra\nlow-friction nanoscale linear bearings. Zheng and collaborators [2, 3] have proposed that\nthis phenomenon could be exploited to built nano-oscillators in the frequency range of\ngigahertz. Legoas et al. [4, 5] carried out molecular dynamics (MD) simulations and\nconcluded that sustained oscillations are possible when the radii difference between\ninner and outer oscillator moving parts are about ' 3.4 Å. Frequencies as high as\n40 GHz are possible and even clear chaotic signatures were observed [6]. Rivera et\nal. [7] studied the behavior of oscillator damping via MD and they showed that the\ndamping depends on the inverse of the CNT length, which is in good agreement with\nthe prediction of analytical models [2, 3]. They also showed [8] that the frequencies in\nthe gigahertz decrease as the length of the tubes increases. Zhao et al. [9] studied the\noscillator energy dissipation energy mechanism, also using MD simulations, and they\ndemonstrated the importance of the overlap length of double CNTs and the mechanical\ndeformation of the outmost CNT to this mechanism. In spite of the large amount\nof investigation of CNT based oscillators some aspects remain not clearly understood,\nespecially with relation to friction mechanisms [10, 11, 12]. In this sense it is important\nto study other related systems such as oscillators made of different materials and also\natoms and molecules oscillating inside the tubes. Only very few studies have been\nreported along these lines, such as oscillators composed of boron nitride nanotubes\n(BNNTs) [13], BNNTs in association with CNT ones [14], C60 molecules [15, 16] and\nrare-gas atoms [17, 18] inside CNTs. The choice for using rare-gas atoms is associated\nwith their inert nature which prevents chemical reactions with the tubes. It has been\ndemonstrated [17, 18] that sustained oscillations are possible for a large range of energy\nvariations and also, in some circunstantes, the tube chirality is important to determine\nthe oscillatory patterns. However, there are conflicting data for the behavior of the\noscillator frequency decaying with the tube diameter. Further studies are necessary to\nbetter understand these aspects. In the present work we report extensive fully atomistic\nmolecular dynamics simulations for the study of Ne atoms oscillating inside (5,5)CNTs\nand (5,5)BNNTs, to our knowledge this is the first study of rare-gas atoms oscillating\ninside BNNTs.\n2. Methodology\nWe have carried out molecular dynamics simulations using the universal force field uff\n[19, 20] as implemented in the Cerius2 package [21]. This force field includes van der\nWaals, bond stretch, bond angle bend, inversion, torsion and rotation terms. It has been\nused with success in the study of dynamical properties of carbon based nanostructures\n[4, 5, 22, 23, 24]. Initially, we perform a molecular mechanics energy minimization to\n\n\fNeon Atoms Oscillating Inside Carbon and Boron-Nitride Nanotubes\n\n3\n\noptimize the geometry of each isolated nanotube. Then, a Ne atom is placed about\n1Å from the nanotube ends and the dynamical simulations are carried out. We have\nused in all cases a microcanonical ensemble (NVE). We have used an integration step\nof 1 fs. The MD simulations were performed in the following temperatures (in Kelvins):\n5, 10, 20, 40, 80, 160, 240, and 300. In order to thermically equilibrate the system a\nrunning of 200 ps is initially performed. After the equilibration a running of 50 ps is\ncarried out and the data trajectory (positions and velocities) saved. From the trajectory\ndata we perform a fast Fourier transform(fft) to obtain the oscillatory frequencies. We\nhave considered CNT and BNNT with (5,5) chirality type. Two different lengths were\nconsidered (25 Å and 50 Å in order to investigate the frequency dependence with the\nlength of the tubes. The choice of (5,5) nanotubes is due to that they have the minimum\ndiameter that allows the Ne atom encapsulation and also this particular chirality implies\nfewer atoms in the unit cell which reduces substantially the computational cost of the\nsimulations.\n3. Results and Discussions\nIn table 1 we show the calculated oscillation frequencies for a Ne atom inside a CNT,\nfor temperatures from 5K up to 240K. For 300K we observed that the Ne atom is not\nencapsulated. In our simulations all the atoms of the nanotube are free to vibrate and\nwith the increase of temperature the amplitude of the vibrations of the atoms at the\nend of tube increase. Mainly due to the van der Walls interactions a dynamical barrier\nis created which prevents the Ne atom encapsulation. As we can see from the Table\nstable frequencies are possible for a large range of temperatures, which could be an\ninteresting aspect to be exploited in possible applications, such as clocks. For the 25\nÅ CNT from 5 up to 240 K the frequencies are 136.71 and then they drop to 117.18\nGHz. For the longer tube (50 Å), as expected, this occurs at lower temperature (160\nK), the frequencies drops from 78.12 to 58.59 GHz. This sustained oscillatory regime is\nbetter visualized in Figs. 1 and 2. These results are consistent with the ones obtained\nby Zeng et al. [18] in spite of their different protocol simulations. They used an impulse\ndynamics that can be mapped into our NVE simulations varying the initial conditions\nwith respect to the temperature of simulations.\nTable 1. Calculated frequencies (GHz) for Ne@CNT(5,5).\n\nCNT\n25 Å\n50 Å\n\n5\n136.71\n78.12\n\n10\n136.71\n78.12\n\nTemperature (K)\n20\n136.71\n78.12\n\n40\n136.71\n78.12\n\n80\n136.71\n78.12\n\n160\n136.71\n58.59\n\n240\n117.18\n58.59\n\nIn Table 2 we present the equivalent results for the case of a Ne atom inside a\n(5,5)BNNT. Again, for the cases investigated, the temperatures where the Ne atom is\n\n\fNeon Atoms Oscillating Inside Carbon and Boron-Nitride Nanotubes\n\na)\n\n4\n\n15\n\n10\n\nz (Å)\n\n5\n\n0\n\n-5\n\n-10\n\n-15\n0\n\n10\n\n20\n\n30\n\n40\n\n50\n\n30\n\n40\n\n50\n\n30\n\n40\n\n50\n\nt (ps)\n\nb)\n\n15\n\n10\n\nz (Å)\n\n5\n\n0\n\n-5\n\n-10\n\n-15\n0\n\n10\n\n20\n\nt (ps)\n\nc)\n\n25\n\nz (Å)\n\n20\n\n15\n\n10\n\n5\n\n0\n\n10\n\n20\n\nt (ps)\n\nFigure 1. Molecular dynamics simulation results for Ne atom oscillations inside a\ncnt of 25Å length for the following temperatures a) 80K, b) 160K and c) 240K\n\nnot encapsulated were 300K for the tube of 25 Å, and 240 and 300 K for the tube of\n50 Å. We believe that this occurs by the same reasons (large end atom tube movements\ncreating a dynamic barrier) as in CNT case. That this occurs at a lower temperature\nin the BNNT case can be attributed in part to different symmetries (buckling) and the\nslightly diameter differences between the CNT (6.8 Å) and BNNT (6.9 Å). We expect\nlarger fluctuations for tubes of larger lengths due to mass differences.\nTable 2. Calculated frequencies (GHz) for Ne@BNNT(5,5).\n\nBNNT\n25 Å\n50 Å\n\n5\n136.71\n78.12\n\nTemperature (K)\n10\n20\n40\n136.71\n136.71\n136.71\n78.12\n78.12\n78.12\n\n80\n136.71\n78.12\n\n160\n117.18\n78.12\n\n240\n117.18\n-\n\n\fNeon Atoms Oscillating Inside Carbon and Boron-Nitride Nanotubes\n\n5\n\n30\n\na)\n\n20\n\nz (Å)\n\n10\n\n0\n\n-10\n\n-20\n\n-30\n0\n\n10\n\n20\n\n30\n\n40\n\n50\n\n30\n\n40\n\n50\n\n30\n\n40\n\n50\n\nt (ps)\n\nb)\n\n50\n\nz (Å)\n\n40\n\n30\n\n20\n\n10\n\n0\n\n10\n\n20\n\nt (ps)\n\nc)\n\n50\n\nz (Å)\n\n40\n\n30\n\n20\n\n10\n\n0\n\n10\n\n20\n\nt (ps)\n\nFigure 2. Molecular dynamics simulation results for Ne atom oscillations inside a\nCNT of 50Å length for the following temperatures a)80K, b)160K and c)240K\n\nAgain, as observed for the CNT case, sustained oscillatory regimes are possible for\na large range of temperatures, and at almost the same frequency values. The only major\ndifferences are at what temperature we observe dropping frequency occurring values and\nthe absence of encapsulation at 240 K for the BNNT of 50 Å. This could be in part\nattribute to mass and diameter tube differences. The major point however it is that\nin contrast to some previous works [17] for the systems investigated here the symmetry\nbreaking and chirality of BNNT do not seem to play important roles in determining the\noscillatory regimes. The general oscillatory behavior (Figs. 3 and 4), frequency values\nand axial displacement movements (Fig. 5) are quite similar to the ones observed in the\nCNT case.\nIn summary, we have carried out detailed analysis of extensive fully atomistic\nmolecular dynamics simulation for Ne atom oscillating inside carbon and boron nitride\nnanotubes of (5,5) chirality and different lengths (25 and 50 Å). Our results show that\nwell defined sustained oscillatory regimes are possible for a large range of temperatures\n\n\fNeon Atoms Oscillating Inside Carbon and Boron-Nitride Nanotubes\n\n6\n\n25\n\nz (Å)\n\na)\n\n20\n\n15\n\n10\n\n5\n\n0\n0\n\n10\n\n20\n\n30\n\n40\n\n50\n\n30\n\n40\n\n50\n\n30\n\n40\n\n50\n\nt (ps)\n\n25\n\nz (Å)\n\nb)\n\n20\n\n15\n\n10\n\n5\n\n0\n0\n\n10\n\n20\n\nt (ps)\n\n25\n\nz (Å)\n\nc)\n\n20\n\n15\n\n10\n\n5\n\n0\n0\n\n10\n\n20\n\nt (ps)\n\nFigure 3. Molecular dynamics simulation results for Ne atom oscillations inside a\nBNNT of 25Å length for the following temperatures a)80K, b)160K and c)240K\n\n(from 5 up to 240 K). There are several stable frequencies for each one nano-oscillator\nconfiguration studied here, ranging from 58 to 137 GHz. Another interesting aspect of\nthese nanostructures is that we can tune the frequency by a suitable modification of the\nnanotube length and/or type. Our results showed that the results for the BNNT are\nquite similar to the CNT ones in terms of general oscillatory behavior, frequency values,\nand axial displacement movements. In this sense our results are closer to the obtained\nby Zeng et al. [18] and in disagreement with the ones obtained by Lin et al. [17]. We\nhope the present work to stimulate other studies along these lines.\n4. Acknowledgments\nThis work was supported in part by IN/MCT, IMMP/MCT, THEO-NANO, Brazilian\nNanotube Network, and by the Brazilian agencies CNPq, CAPES, FAPESP and\n\n\fNeon Atoms Oscillating Inside Carbon and Boron-Nitride Nanotubes\n\n7\n\n50\n\nz (Å)\n\na)\n\n40\n\n30\n\n20\n\n10\n\n0\n0\n\n10\n\n20\n\n30\n\n40\n\n50\n\n30\n\n40\n\n50\n\n30\n\n40\n\n50\n\nt (ps)\n\n50\n\nz (Å)\n\nb)\n\n40\n\n30\n\n20\n\n10\n\n0\n0\n\n10\n\n20\n\nt (ps)\n\n50\n\nc)\n\n40\n\nz (Å)\n\n30\n\n20\n\n10\n\n0\n0\n\n10\n\n20\n\nt (s)\n\nFigure 4. Molecular dynamics simulation results for Ne atom oscillations inside a\nBNNT of 50Å length for the following temperatures a)40K, b)80K and c)160K\n\nFAPEMA.\n[1]\n[2]\n[3]\n[4]\n[5]\n[6]\n[7]\n[8]\n[9]\n[10]\n[11]\n[12]\n\nCumming J and Zettl A, 2003 Science 289 602\nZheng Q and Jiang Q, 2002 Phys. Rev. Lett. 88 045503\nZheng Q, Liu J Z and Jiang Q, 2002 Phys. Rev. B 65 245409\nLegoas S B, Coluci V R, Braga S F, Coura P Z, Dantas S O and Galvao D S, 2003 Phys. Rev.\nLett. 90 055504\nLegoas S B, Coluci V R, Braga S F, Coura P Z, Dantas S O and Galvao D S, 2004 Nanotech. 15\nS184\nColuci V R, Legoas S B, de Aguiar M A M and Galvao D S, 2005 Nanotech. 16 583\nRivera J L, McCabe C and Cummings P T, 2003 Nano Lett. 3 1001\nRivera J L, McCabe C and Cummings P T, 2005 Nanotech. 16 186\nZhao Y, Ma C-C, Cheng G and Jiang Q, 2003 Phys. Rev. Lett. 91 175504\nKolmogorov A N and Crespi V H, 2000 Phys. Rev. Lett. 85 4727\nTangney P, Louie S G and Cohen M L, 2004 Phys. Rev. Lett. 93 065503\nKis A, Jensen K, Aloni S, Mickelson W and Zettl A, 2006 Phys. Rev. Lett. 97 025501\n\n\fNeon Atoms Oscillating Inside Carbon and Boron-Nitride Nanotubes\n\n8\n\nFigure 5. Snapshots from the molecular dynamics simulations. Left; Ne atom\noscillating inside a CNT of 25Å length for the temperatures 160K. Right; Ne atom\noscillating inside a BNNT of same length and at the same temperature.\n\n[13] Lee J H, 2006 J. Kor. Phys. Soc. 49 172\n[14] Kang J W, Hwang H J and Jiang Q, 2006 J. Comput. Theor. Nanosci. 3 880\n[15] Wang XH, Xin H, Leonard J N, Chen G H, Chwang A J and Jiang Q, 2007 J. Nanosci. Nanotech.\n7 1512\n[16] Liu P, Zhang Y W and Lu C, 2005 J. Appl. Phys. 97 094313\n[17] Lin B S and Su ZY, 2004 Chin. J. Phys. 42 673\n[18] Zeng X, Jin N Q, Teng Y Y and Li S Y, 2006 J. Phys. Chem. B 110 17329\n[19] Rappe A K, Casewit C J, Colwell K S, Goddard III W A and Skiff W M, J. Am. Chem. Soc. 1992\n114 10024\n[20] Root D, Landis C and Cleveland T, J. Am. Chem. Soc. 1993 115 4201\n[21] Cerius2 is a suite of simulation programs available from Accelrys, http://www.accelrys.com.\n[22] Braga S F, Coluci V R, Legoas S B, Giro R, Galvao D S and Baughman R H, 2004 Nano Lett. 4\n881\n[23] Troche K S, Coluci V R, Braga S F, Chinellato D D, Sato F, Legoas S B, Rurali R and Galvao D\nS, 2005 Nano Lett. 5 349\n[24] Troche K S, Coluci V R, Rurali R and Galvao D S, 2007 J. Phys.: Condens. Matter 19 236233\n\n\f"}