{"id": "http://arxiv.org/abs/0907.5122v1", "guidislink": true, "updated": "2009-07-29T14:29:15Z", "updated_parsed": [2009, 7, 29, 14, 29, 15, 2, 210, 0], "published": "2009-07-29T14:29:15Z", "published_parsed": [2009, 7, 29, 14, 29, 15, 2, 210, 0], "title": "Flavour Condensates in Brane Models and Dark Energy", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0907.4631%2C0907.5207%2C0907.4201%2C0907.5536%2C0907.1354%2C0907.4654%2C0907.5246%2C0907.3426%2C0907.2069%2C0907.2670%2C0907.0434%2C0907.1328%2C0907.1061%2C0907.4226%2C0907.2547%2C0907.1590%2C0907.0485%2C0907.4426%2C0907.3134%2C0907.1620%2C0907.1261%2C0907.1235%2C0907.1403%2C0907.0383%2C0907.1449%2C0907.2225%2C0907.2802%2C0907.1565%2C0907.5113%2C0907.4133%2C0907.0341%2C0907.1968%2C0907.3285%2C0907.3847%2C0907.1684%2C0907.5522%2C0907.4154%2C0907.4965%2C0907.3153%2C0907.5566%2C0907.0779%2C0907.4987%2C0907.2441%2C0907.2964%2C0907.5015%2C0907.3506%2C0907.4636%2C0907.5122%2C0907.0302%2C0907.5395%2C0907.4967%2C0907.3318%2C0907.1131%2C0907.4030%2C0907.1929%2C0907.1115%2C0907.1961%2C0907.0646%2C0907.4608%2C0907.2665%2C0907.4404%2C0907.3843%2C0907.4937%2C0907.1604%2C0907.4817%2C0907.2044%2C0907.4164%2C0907.2445%2C0907.1016%2C0907.3997%2C0907.4691%2C0907.1009%2C0907.3598%2C0907.4180%2C0907.1303%2C0907.3534%2C0907.2626%2C0907.1529%2C0907.1455%2C0907.4619%2C0907.2776%2C0907.2221%2C0907.4687%2C0907.0533%2C0907.4082%2C0907.0210%2C0907.1374%2C0907.2381%2C0907.0095%2C0907.2600%2C0907.4810%2C0907.2856%2C0907.2476%2C0907.1355%2C0907.0579%2C0907.2871%2C0907.1519%2C0907.2066%2C0907.3041%2C0907.2357%2C0907.4790&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Flavour Condensates in Brane Models and Dark Energy"}, "summary": "In the context of a microscopic model of string-inspired foam, in which foamy\nstructures are provided by brany point-like defects (D-particles) in\nspace-time, we discuss flavour mixing as a result of flavour non-preserving\ninteractions of (low-energy) fermionic stringy matter excitations with the\ndefects. Such interactions involve splitting and capture of the matter string\nstate by the defect, and subsequent re-emission. Quantum fluctuations of the\nD-particles induce a non-trivial space-time background; in some circumstances\nthis could be akin to a cosmological Friedman-Robertson Walker\nexpanding-Universe, with weak (but non-zero) particle production. Furthermore\nthe D-particle medium can induce an MSW type effect. We have argued previously,\nin the context of bosons, that the so-called flavour vacuum is the appropriate\nstate to be used, at least for low-energy excitations, with energies/momenta up\nto a dynamically determined cutoff scale. In this work we evaluate the\nflavour-vacuum expectation value (condensate) of the stress-energy tensor of\nthe (1/2)-spin fields with mixing in an effective low-energy Quantum Field\nTheory in this foam-induced curved space-time. We demonstrate, at late epochs\nof the Universe, that the fermionic vacuum condensate behaves as a fluid with\nnegative pressure and positive energy, but alone it cannot lead to present-day\naccelerating Universes. One needs flavoured boson contributions for this\npurpose.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0907.4631%2C0907.5207%2C0907.4201%2C0907.5536%2C0907.1354%2C0907.4654%2C0907.5246%2C0907.3426%2C0907.2069%2C0907.2670%2C0907.0434%2C0907.1328%2C0907.1061%2C0907.4226%2C0907.2547%2C0907.1590%2C0907.0485%2C0907.4426%2C0907.3134%2C0907.1620%2C0907.1261%2C0907.1235%2C0907.1403%2C0907.0383%2C0907.1449%2C0907.2225%2C0907.2802%2C0907.1565%2C0907.5113%2C0907.4133%2C0907.0341%2C0907.1968%2C0907.3285%2C0907.3847%2C0907.1684%2C0907.5522%2C0907.4154%2C0907.4965%2C0907.3153%2C0907.5566%2C0907.0779%2C0907.4987%2C0907.2441%2C0907.2964%2C0907.5015%2C0907.3506%2C0907.4636%2C0907.5122%2C0907.0302%2C0907.5395%2C0907.4967%2C0907.3318%2C0907.1131%2C0907.4030%2C0907.1929%2C0907.1115%2C0907.1961%2C0907.0646%2C0907.4608%2C0907.2665%2C0907.4404%2C0907.3843%2C0907.4937%2C0907.1604%2C0907.4817%2C0907.2044%2C0907.4164%2C0907.2445%2C0907.1016%2C0907.3997%2C0907.4691%2C0907.1009%2C0907.3598%2C0907.4180%2C0907.1303%2C0907.3534%2C0907.2626%2C0907.1529%2C0907.1455%2C0907.4619%2C0907.2776%2C0907.2221%2C0907.4687%2C0907.0533%2C0907.4082%2C0907.0210%2C0907.1374%2C0907.2381%2C0907.0095%2C0907.2600%2C0907.4810%2C0907.2856%2C0907.2476%2C0907.1355%2C0907.0579%2C0907.2871%2C0907.1519%2C0907.2066%2C0907.3041%2C0907.2357%2C0907.4790&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "In the context of a microscopic model of string-inspired foam, in which foamy\nstructures are provided by brany point-like defects (D-particles) in\nspace-time, we discuss flavour mixing as a result of flavour non-preserving\ninteractions of (low-energy) fermionic stringy matter excitations with the\ndefects. Such interactions involve splitting and capture of the matter string\nstate by the defect, and subsequent re-emission. Quantum fluctuations of the\nD-particles induce a non-trivial space-time background; in some circumstances\nthis could be akin to a cosmological Friedman-Robertson Walker\nexpanding-Universe, with weak (but non-zero) particle production. Furthermore\nthe D-particle medium can induce an MSW type effect. We have argued previously,\nin the context of bosons, that the so-called flavour vacuum is the appropriate\nstate to be used, at least for low-energy excitations, with energies/momenta up\nto a dynamically determined cutoff scale. In this work we evaluate the\nflavour-vacuum expectation value (condensate) of the stress-energy tensor of\nthe (1/2)-spin fields with mixing in an effective low-energy Quantum Field\nTheory in this foam-induced curved space-time. We demonstrate, at late epochs\nof the Universe, that the fermionic vacuum condensate behaves as a fluid with\nnegative pressure and positive energy, but alone it cannot lead to present-day\naccelerating Universes. One needs flavoured boson contributions for this\npurpose."}, "authors": ["Nick E. Mavromatos", "Sarben Sarkar", "Walter Tarantino"], "author_detail": {"name": "Walter Tarantino"}, "author": "Walter Tarantino", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevD.80.084046", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0907.5122v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0907.5122v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "19 pages revtex, three eps figures incorporated", "arxiv_primary_category": {"term": "hep-th", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "hep-th", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "gr-qc", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "hep-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0907.5122v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0907.5122v1", "journal_reference": "Phys.Rev.D80:084046,2009", "doi": "10.1103/PhysRevD.80.084046", "fulltext": "Flavour Condensates in Brane Models and Dark Energy\nNick E. Mavromatos, Sarben Sarkar and Walter Tarantino\n\narXiv:0907.5122v1 [hep-th] 29 Jul 2009\n\nKing's College London, Department of Physics, Strand, London WC2R 2LS, UK.\nIn the context of a microscopic model of string-inspired foam, in which foamy structures are\nprovided by brany point-like defects (D-particles) in space-time, we discuss flavour mixing as a\nresult of flavour non-preserving interactions of (low-energy) fermionic stringy matter excitations\nwith the defects. Such interactions involve splitting and capture of the matter string state by the\ndefect, and subsequent re-emission. As a result of charge conservation, only electrically neutral\nmatter can interact with the D-particles. Quantum fluctuations of the D-particles induce a nontrivial space-time background; in some circumstances this could be akin to a cosmological FriedmanRobertson Walker expanding-Universe, with weak (but non-zero) particle production. Furthermore\nthe D-particle medium can induce an MSW type effect. We have argued previously, in the context\nof bosons, that the so-called flavour vacuum is the appropriate state to be used, at least for lowenergy excitations, with energies/momenta up to a dynamically determined cutoff scale. Given the\nintriguing mass scale provided by neutrino flavour mass differences from the point of view of dark\nenergy, we evaluate the flavour-vacuum expectation value (condensate) of the stress-energy tensor\nof the 1/2-spin fields with mixing in an effective low-energy Quantum Field Theory in this foaminduced curved space-time. We demonstrate, at late epochs of the Universe, that the fermionic\nvacuum condensate behaves as a fluid with negative pressure and positive energy; however the\nequation of state has wfermion > −1/3 and so the contribution of the fermion-fluid flavour vacuum\nalone could not yield accelerating Universes. Such contributions to the vacuum energy should\nbe considered as (algebraically) additive to the flavoured boson contributions, evaluated in our\nprevious works; this should be considered as natural from (broken) target-space supersymmetry\nthat characterises realistic superstring/supermembrane models of space-time foam. The boson fluid\nis also characterised by positive energy and negative pressure, but its equation of state is, for late\neras, close to wboson → −1, and hence overall the D-foam universe appears accelerating at late eras.\nI.\n\nINTRODUCTION\n\nDuring recent years it has been suggested that a certain, mathematically consistent, treatment of flavour mixing\nin Quantum Field Theory could have implications at a cosmological scale [1]. Specifically, adopting a Fock-space\nquantization formalism for the \"flavour\" states [2, 3], one can define a new vacuum state which, in the thermodynamic\nlimit, is orthogonal to the mass-eigenstate vacuum. This orthogonality, in fact, extends to the entire set of Fockspace states constructed out of the flavour vacuum, relative to those constructed out of the mass-eigenstate vacuum.\nIt has been claimed [4] that the flavour-vacuum formalism, although mathematically consistent, nevertheless leads\nto no physically different predictions from the conventional formalism. However, the authors of [5] have argued\nthat probability conservation is only realised within the flavour state vacuum in quantum field theories with mixing;\nmoreover the oscillation probability among flavours is modified, compared to the traditional formalism, by extra terms\nwhich, although small, nevertheless are in principle experimentally detectable. In this sense they postulated that in\nsuch cases the flavour vacuum is the physical vacuum.\nIt has then been demonstrated [1] that the vacuum condensate due to fermion particle mixing, evaluated in the\n(physical) flavour vacuum, seems to behave as a source of Dark Energy, in the sense of yielding a non-trivial flavourvacuum energy density. In a series of papers [6], following the initial work of [1], it has also been argued that the fluid\nof flavour fermions behaves as an ideal one, in the cosmological sense, with a simple equation of state, which depends\non the Universe's epoch.\nHowever, these calculations have been performed in the context of a Minkowski space-time Quantum Field Theory,\ndespite the fact that flavour mixing gives rise to a non-trivial space-time cosmological background. A consistent\ntreatment, therefore, requires consideration of the Fock-space vacuum in the presence of such cosmological spacetimes, where non-trivial particle production takes place. Moreover, the presence of non-zero vacuum energies, and\nin general of non-vanishing tensor components of the stress tensor of the fermion fluid, indicates breaking of Lorentz\ninvariance, except in the case of de-Sitter (or anti-de-Sitter ) vacua, with an equation of state between pressure p and\nenergy density ρ of the form p = −ρ. For the flavour-vacuum, as shown in [6], and mentioned above, the fermion field\ntheory with mixing leads to equations of states that depend on the Universe era, with w → −1 approximately only at\nlate eras. We should note that, in our opinion, this latter statement has only been argued but not rigorously proved\nin [6], since the relevant calculations have been performed in Minkowski flat space-time. A first such step towards the\nconstruction of microscopic models that would provide mathematically and physically consistent realizations of the\nflavour vacuum, has been performed in [7], in the context of the so-called D-particle foam model [8], a string/brane\n\n\f2\nStage (I)\n\nStage (II)\n\nStage (III)\n\nBulk\n\nV'\n\nOpen strings\nD−particles\nV\n0\n\ntime < 0\n\nConsistent supersymmetric\nD−particle foam models\ncan be constructed\nNo recoil, no brane motion=\nzero vacuum energy,\nunbroken SUSY\n\ntime = 0 (impact)\n\nrecoil contributions to\nvacuum energy\nBroken SUSY\n\nV = V' − V\nrec\n0\ntime > 0\n\nLogarithmic conformal field theory describes the impulse at stage (II)\n\nBrane world\n\nFIG. 1: Schematic representation of a D-particle space-time foam model. The figure indicates also the capture/recoil process\nof a string state by a D-particle defect for closed (left picture) and open (right picture) string states, in the presence of D-brane\nworld. The presence of a D-brane is essential due to gauge flux conservation, since an isolated D-particle cannot exist. The\nintermediate composite state at t = 0, which has a life time within the stringy uncertainty time interval δt, of the order of\nthe string length, and is described by world-sheet logarithmic conformal field theory, is responsible for the distortion of the\nsurrounding space time during the scattering, and subsequently leads to induced metrics depending on both coordinates and\nmomenta of the string state. This results on modified dispersion relations for the open string propagation in such a situation [8],\nleading to non-trivial optical properties (refractive index etc.) for this space time.\n\ninspired model of space-time foam. According to this model, our Universe, after perhaps appropriate compactification,\nis represented as a three brane, propagating in a bulk space-time punctured by D0-brane (D-particle) defects. As the\nD3-brane world moves in the bulk, the D-particles cross it, and for an observer on the D3-brane the situation looks\nlike a \"space-time foam\" with the defects \"flashing\" on and off (\"D-particle foam\"). The open strings, with their ends\nattached on the brane, which represent matter in this scenario, can interact with the D-particles on the D3-brane\nuniverse in a topologically non-trivial manner, involving splitting and capture of the strings by the D0-brane defects,\nand subsequent re-emission of the open string state (see fig. 1). However, the flavour of the re-emitted state may not\nbe the same as that of the incident one, thereby leading to vacuum-induced flavour oscillations and mixing. It should\nbe emphasized that, due to electric charge conservation, only electrically neutral matter interacts non-trivially with\nthe D-particle \"foam\", which is transparent to charged matter [9, 10].\nIn such a model, the flavour vacuum is regarded as an effective description of the vacuum state for low-energy\nstring modes with mixing, as a result of the breaking of Lorentz symmetry locally in space-time, due to D-particle\nrecoil during the string-D-particle interactions. Nevertheless, Lorentz symmetry is preserved on the average, in the\nsense that the appropriate vacuum-expectation-values (v.e.v.) of the relevant Lorentz-breaking observables vanish.\nHowever, this is not the case for the quantum fluctuations of those observables, which may be non-trivial. We consider\nthe first-quantised string-theory framework, that describes (perturbatively) the physics of (matter) open strings either\nstretched between the D-particle and the D3-brane world, with both their ends attached to the D3-brane (c.f. fig. 1);\nquantum fluctuations of target-space background fields, in which the string propagates, are induced by appropriate\nsummation over world-sheet surfaces with higher topologies (genera). In this sense, a quantum fluctuating D-particle\nin the foam, will be described by such stretched open strings, with at least one of their ends attached to it.\nThe structure of the article is as follows: in the next section II we review briefly the D-particle foam model and\ndiscuss the formalism that leads to an induced space-time metric of the form of a conformally flat expanding Universe,\nas a result of the space-time fluctuating D-particle background. In section III we discuss a gravitational MSW effect\nas a result of the existence of the D-foam, that leads to gravitational-medium-induced flavour mixing and mass\ndifferences. We also present in that section plausibility arguments for the rôle of the flavour Fock vacuum and the\ncorresponding excitation states as the physical states in the problem. In section IV, in the context of a low-energy\nfield theory limit, we discuss the contributions of bosonic degrees of freedom to the dark energy of the brane universe,\ndefined as the appropriate vacuum expectation value of the stress-energy tensor between flavour-Fock vacuum states.\nIn section V we repeat the construction for the fermionic low-energy degrees of freedom, and evaluate the relevant\ncontributions to the dark energy of the brane. An important issue arises regarding the choice of the appropriate\nnormal ordering that should lead to the physically correct subtraction of the (field-theoretic) ultraviolet divergences,\nin a way consistent with the gravitational MSW effect. This is discussed in detail in section VI. The reader's attention\nis called at this point to the fact that in string theory there are no actual ultraviolet momentum divergencies. These\nare artifacts of the low-energy local effective field theory which is defined up to energies of the order of the string scale,\nMs , or better the Planck scale (defined as the ratio of Ms /gs , with gs the string coupling, assumed weak gs < 1).\nThus, by definition any momentum integral will be cut-off at that scale automatically. The subtraction procedure we\n\n\f3\nare applying to the bosonic or fermionic stress-energy tensors in this field-theoretic context, defines the appropriate\neffective field theory degrees of freedom, accessible to a low-energy observer, and is consistent with the fact that any\ncontributions to the vacuum energy should vanish in the absence of D-particle foam effects. In section VII we discuss\nthe emergence of a momentum cut-off much lower than the Planck scale that arises from statistical arguments related\nto particle production that characterises our expanding background. This is not a sharp cutoff, but rather defines the\nappropriate physical degrees of freedom that lead to significant contributions to the brane-world vacuum energy. We\nalso discuss in this section the equation of state of the fermionic vacuum condensate and demonstrate that, for late\neras of the Universe, it behaves as a fluid with negative pressure and positive energy; however the equation of state\nhas wfermion > −1/3 and so the contribution of the fermion-fluid flavour vacuum alone could not yield accelerating\nUniverses. However, on taking into account the contributions to the vacuum energy coming from flavoured bosons,\nwhich are natural from the point of view of the (broken) target-space supersymmetry that characterises realistic\nsuperstring/supermembrane models of space-time foam, and which should be considered as (algebraically) additive to\nthe fermion contributions, one may obtain the conditions for late-era acceleration of the Universe. Indeed, the boson\nfluid is also characterised by positive energy and negative pressure, but its equation of state is, for late eras, close to\nwboson → −1 and hence overall the D-foam universe appears accelerating at late eras. Finally, section VIII contains\nour conclusions and outlook.\nII.\n\nD-PARTICLE FOAM INDUCED METRIC\n\nThe target-space quantization of the recoil velocity of a D-particle, ui , during its interaction with a matter open\nstring is achieved [11] by a genus summation on the world-sheet, which in the case of a bosonic σ-model with a\nD-particle recoil deformation can be cast in a closed form [11, 12]. This yields a stochastic Gaussian distribution of\nthe recoil velocities ui , around a zero average, with a variance σ 2 that depends at most on target time, and not on\nthe position of the D-particle:\n< ui >= 0 ,\n\n< ui uj >= σ 2 δij ,\n\nσ 2 ∼ gs2 t20 ,\n\n(1)\n\nwhere the time t0 extends over the capture time of the string by the fluctuating D-particle. As discussed in [10, 12],\nfor a matter string with total energy p0 , the capture time is of order tc ∼ α′ p0 . Moreover in [12] we also argued, and\nshall review below, that there is a dynamically imposed upper bound scale (cutoff) for the momenta of the particle\nexcitations interacting with the D-particles, which is of order of the mass of the particles, essentially (c.f. (34),\nbelow). Even if one considers sneutrinos, their masses (as a result of supersymmetry breaking) may be assumed of a\nfew TeV in phenomenologically interesting models, which is still much smaller than a Planck-scale mass of a D-particle.\nHence the capture time t0 is small for our flavoured cases examined here. One has to average the relevant expressions\nyielding pressure and energy density of the particle fluid in the flavour-vacuum over such time scales. Because the time\nscales involved are small, such time averages may be replaced, at a good approximation, by the value of the relevant\nquantity to be averaged over a time scale t0 . This means that on a global scale, on the D3 brane Universe, the quantum\nfluctuating D-particles will fluctuate with an average variance σ 2 (t0 ) ≪ 1. On using a dilute gas approximation we\ncan take a statistical average over populations of D-particles whose density does depend on the cosmological era of\nthe Universe; the D-particle foam could then produce an isotropic and homogeneous (cosmological type) space-time\nbackground, with non-trivial particle production, in which flavour mixing takes place in a self-consistent way [7], as\nwe shall review below.\nFor the benefit of the reader, we feel it would be instructive to first review briefly the mathematical formalism\nunderlying the quantum-fluctuating D-particle \"foamy\" space time. The world-sheet boundary operator VD describing\nthe excitations of a moving heavy D0-brane is given in the tree approximation by:\nZ\nZ\n\u0001\n\u0001\ni\n0\ni\n(2)\nYi X 0 ∂n X i\nyi ∂n X + ui X ∂n X ≡\nVD =\n∂D\n\n∂D\n\nwhere ∂D denotes the boundary of the world-sheet D with the topology of a disk, to lowest order in string-loop\nperturbation\n\u0001 theory, ui and yi are the velocity and position of the heavy (non-relativistic) D-particle respectively\nand Yi X 0 ≡ yi + ui X 0 . To describe the capture/recoil we need an operator which has non-zero matrix elements\nbetween different\u0001states of the D-particle and is turned on \"abruptly\" in target time. One way of doing this is to\nput [13] a Θ X 0 , the Heavyside function, in front of VD which models an impulse whereby the D-particle starts\nimp\nmoving at X 0 = 0. This impulsive VD , denoted by VD\n, can thus be represented as\nimp\nVD\n\nd Z\n\u0001\n1 X\n=\ndτ ui X 0 Θ X 0 ∂n X i .\n2πα′ i=1 ∂D\n\n(3)\n\n\f4\nwhere d in the sum denotes the appropriate number of spatial target-space dimensions. For a recoiling D-particle\nconfined on a D3 brane, d = 3.\n\u0001\nSince X 0 is an operator it will be necessary to define Θ X 0 as a regularized operator using the contour integral\nZ ∞\n\u0001\n0\ni\ndω\neiωX\nwith ε → 0+ ,\n(4)\nΘε X 0 = −\n2π −∞ ω − iε\n\nwhere ε is a regulator, which, as discussed in [13] and will be reviewed below, is linked with a running cutoff scale\non the world-sheet of the string, on account of the requirement of the closure of the (logarithmic) conformal algebra.\nHence we can consider\nZ ∞\n\u0001\ndω\niωX 0\n.\n(5)\nDε (X 0 ) = X 0 Θε X 0 = −\n2 e\n(ω\n−\niε)\n−∞\nThe presence of a recoil deformation leads to local distortions in the neighboring space time geometry which can\nimp\nbe found as follows: let one write the boundary recoil/capture operator VD\n(3) in the Dirichlet picture as a total\nderivative over the bulk of the world-sheet by means of the two-dimensional version of Stokes theorem (omitting\nfrom now on the explicit summation over repeated i-index, which is understood to be over the spatial indices of the\nD3-brane world of fig. 1):\nZ\n\u0002\n\u0003\n\u0001 α i\u0001\n1\nimp\n2\nβ\n0\n0\nVD\n\n=\n\n1\n4πα′\n\nZ\n\n2πα′\n\nd z ǫαβ ∂\n\nui X\n\nΘ X\n\n∂ X\n\n=\n\nD\n\nβ\n\n2\n\nd z (2ui ) ǫαβ ∂ X\n\n0\n\nD\n\n\"\n\nΘε X\n\n0\n\n\u0001\n\n0\n\n+ X δε X\n\n0\n\n\u0001\n\n#\n\n∂αXi\n(6)\n\nwhere δε (X 0 ) is an ε-regularised δ-function. This is equivalent to a deformation describing an open string propagating\nin an antisymmetric Bμν -background corresponding to an external constant in target-space \"electric\" field,\nB0i ∼ ui ,\n\nBij = 0 ,\n\n(7)\n\nwhere the X 0 δ(X 0 ) terms in the argument of the electric field yield vanishing contributions in the large time limit\nε → 0, and hence are ignored from now on. We remark for completeness at this stage that, upon a T-duality canonical\ntransformation of the coordinates [14], the presence of the B-field leads to mixed-type boundary conditions for open\nstrings on the boundary ∂D of world-sheet surfaces with the topology of a disc:\ngμν ∂n X ν + Bμν ∂τ X ν |∂D = 0 ,\n\n(8)\n\nwith B given by (7). Absence of a recoil-velocity ui -field leads to the usual Neumann boundary conditions, while the\nlimit where gμν → 0, with ui 6= 0, leads to Dirichlet boundary conditions.\nAs discussed in detail in refs. [15, 16], there is also an induced open-string effective target-space-time metric. To\nfind it, one should consider the world-sheet propagator on the disc hX μ (z, z)X ν (0, 0)i, with the boundary conditions\n(8). Upon using a conformal mapping of the disc onto the upper half plane with the real axis (parametrised by τ ∈ R)\nas its boundary [15], one then obtains:\nμν\nhX μ (τ )X ν (0)i = −α′ gopen,\n\nelectriclnτ\n\n2\n\nθμν\nǫ(τ )\n2\n\n(9)\n\nũ\n1\nuc 1 − ũ2\n\n(10)\n\n+i\n\nwith the non-commutative parameters θμν given by\n[X 1 , t] = iθ10 ,\n\nθ01 (= −θ10 ) ≡ θ =\n\nwhere t is the target time; for definiteness the recoil can be assumed to be along the spatial X 1 direction, i.e.\n0 6= k1 ≡ k k u1 , k2 = k3 = 0. ǫ(τ ) is the step function having value −1 for τ < 0 and 1 for τ > 0. The quantity\n1\nũi ≡ uuci and uc = 2πα\n′ is the Born-Infeld critical field. Since the space and time co-ordinates are world-sheet fields,\nthis commutator is calculated [15] using the appropriate first-quantised string commutation relations on the world\nsheet. The effective Finsler-type open-string metric [17], due to the presence of the recoil-velocity field ~u (whose\ndirection breaks target-space Lorentz invariance) is given by:\n\u0001\nopen,electric\nμ, ν = 0, 1\ngμν\n= 1 − ũ2i ημν ,\nopen,electric\ngμν\n= ημν , μ, ν = all other values .\n\n(11)\n\n\f5\nThere is, moreover, a modified effective string coupling [15, 16]:\ngseff = gs 1 − ũ2\n\n\u00011/2\n\n.\n\n(12)\n\nIt should be mentioned here that such metrics have been suggested in the context of a T-dual Neumann picture [11]\nof the D-particle recoil process in refs. [8].\nThe presence of a critical \"electric\" field is associated with a singularity of both the effective metric as well as the\nnon-commutativity parameter and there is also an effective string coupling, which vanishes in that limit (12). This\nreflects the destabilization of the vacuum when the \"electric\" field intensity approaches the critical value, which was\nnoted in [18]. Since in our D-particle foam case, the rôle of the 'electric' field is played by the recoil velocity of the\nD-particle defect, the critical field corresponds to the relativistic speed of light. This accords with special relativistic\nkinematics, which is respected in string theory, by construction. The critical recoil velocity is of order one, which in\nturns sets the highest order of magnitude of energies of the stretched strings to the mass of the D-particle, Ms /gs ,\nas announced previously. In this sense, the variances (1) are characteristic constants, depending on microscopic\nparameters, such as the mass of the D-particles.\nIn the absence of any special knowledge, the most natural choice is to consider isotropic cases of foam, in which the\ninduced Finsler metric assumes the conformal form\n\u0001\nopen,electric\n(13)\ngμν\n= 1 − ũ2i ημν ,\nfor all μ, ν = 0, . . . 3. This is the case we shall henceforth concentrate on.\nStochastic quantum fluctuations of the recoil velocity ui , induced by the summation over genera on the worldsheet [11], imply, on account of (1), a constant metric of the form:\n\u0001\n(14)\ngμν = 1 − σ 2 ημν\n\nIn addition to the quantum fluctuations of the metric as a result of a single D-particle fluctuation considered hitherto,\none should consider the effects of a statistical population of D-particles, which characterises realistic cases of Dparticle foam. Denoting such statistical averages over populations of D-particles (as opposed to quantum averages\nover fluctuations of a single quantum D-particle) by ≪ . . . ≫, one should bear in mind that in general, in situations\nlike in fig. 1, the density of D-particles in the bulk, which essentially the statistical average depends upon, may vary\nwith the cosmological time scale, in the sense that their bulk distribution may not be uniform. Hence, on taking the\nstatistical average of the metric (14) over populations of D-particles, we obtain, in general, a time dependent induced\nmetric:\n\u0001\nstat\n≪ gμν ≫≡ gμν\n= 1− ≪ σ 2 ≫ (t) ημν ,\n(15)\n\nwhere ≪ σ 2 ≫(t) depends in general on the cosmological time, t, for reasons stated above. In fact, from the conformal\nnature of the induced cosmological metric (15), we see that the time t that appears naturally in our construction is\nstat\nacquires the standard cosmological\nthe so-called conformal time η in standard Cosmology, and indeed the metric gμν\nform in the conformal time frame:\nstat\ngμν\n= C(η)ημν ,\n\n(16)\n\nwhere the scale factor of the D-foam universe is C(η) = 1− ≪ σ 2 ≫ (η). Slightly expanding universes are obtained\nfor cases in which the D3 brane moves towards a region in the bulk space (c.f. fig. 1) characterised by a depletion of\nD-particles. Notice that in our construction of small recoil velocities, |ui | ≪ 1, for which our perturbative σ-model\ntreatment of strings suffices, the induced metrics are only slightly deviating from Minkowski space time, and as such\nthey constitute good candidates to describe late-eras in our Universe'e expansion. This is the case we shall restrict\nourselves on in this paper.\nIII.\n\nD-PARTICLE FOAM AND GRAVITATIONAL MSW EFFECT\n\nApart from the induced background space-time (16),(15), the presence of a D-particle foam has other interesting\nconsequences for matter flavoured states propagating on the D3 brane world. Specifically, as advocated in [19], the\npresence of a fluctuating \"medium\" of defects in the background space-time, may lead to induced mixing of flavoured\nstates, and as a consequence to gravitationally-induced mass differences, analogous to the celebrated MSW effect [20].\nWhen neutrinos pass through ordinary matter media such as the Sun, the mass differences and mixing angles acquire\n\n\f6\nparts proportional to the (electronic) density of the medium according to the MSW effect. The difference in the\n(quantum) gravitational case is that the induced mass differences and mixing will now be proportional to the product\nof the density of fluctuating defects in space-time and Newton's constant GN (which expresses the coupling constant\nof gravity at an effective theory level). In terms of MP , the four-dimensional Planck mass, we have GN = M12 (in\nP\nunits h̄ = c = 1) . To be precise, it is argued in [19], that the gravitationally-induced mass differences among flavour\nstates will be of order\n∆m2foam ∼ GN hndefectip\n\n(17)\n\nwhere hndefect i is an \"effective\" number density of the space-time defects (D-particles), probed by matter of momentum\n∆m2\np ≡ |~\np|. A measure of the weakness of the space-time foam is given by the smallness of the ratio mfoam\nwhere m is a\n2\ntypical mass scale of the flavoured states. Indeed, for situations in which one has an effective number N ⋆ defects per\nPlanck volume,\n\u0012\n\u0013\np\n∆m2foam ∼ N ⋆\nMP2 .\n(18)\nMP\nThe value of N ⋆ takes into account scattering cross-sections of matter with the D-particles and so is much smaller\nthan the number of D-particles per Planck volume. In the context of the string models\n√ we are considering, the fourdimensional Planck mass MP may be different from the string mass scale Ms = 1/ α′ , which is essentially a free\nparameter to be constrained by phenomenology, according to the modern approach to string theory.\nTo ensure ∆m2foam has realistically small mass differences among neutrino flavours, i.e. do not exceed the observed\nvalues of order at most 10−3 eV2 , one should have sufficiently dilute D-particle foams, such that N ⋆ ≪ 1. This will\nbe assumed throughout this work. A plausible assumption made in [19], which, we shall also adopt here, is that\nthe induced mass differences are essentially independent of the momentum of the probe, since the effective density of\ndefects decreases with the momentum p (the faster the probe, the less time it has to interact with the foam in the MSW\nframework). One should notice, however, that such an assumption is strictly necessary only if the foam-induced mass\ndifferences are to account for the entire observed mass differences, which are indeed independent of the momentum\nof the neutrinos. This is unnecessary in the case here, since the foam-induced mass differences are only a tiny part of\nthe experimentally measured ones, as required by the currently accepted experimental facts [19]. Nevertheless, due to\nthe smallness of ∆m2foam , compared to the typical neutrino mass scales, m, it is convenient to ignore such momentum\ndependence since it suffices to effect the order-of-magnitude estimates in this article. This will be assumed from now\non.\nIt is important to note that the gravitational MSW effect pertains to flavour mixing induced by the medium and\ndoes not induce any distortion of space-time per se. According to our discussion in the previous section, it is the recoil\nof the fluctuating defect that induces the background (15). This is an important distinction that should be used later\non, when we discuss ultraviolet subtractions in our effective low-energy theory of string matter interacting with the\ndefects. However, both effects are affected by the density of defects.\nIn our model the flavour mixing originates from the fact that, during the capture process of an open string (matter)\nstate by the D-particle, the mass m of the re-emitted state might be different from the incident one. In this sense,\nthe D-particle \"medium\" will induce flavour oscillations and mixing, and as a consequence the flavour Fock space\nvacuum is appropriate for quantization of those states, since the \"flavour\" states are the appropriate physical states in\nthis context [7]. Unfortunately at present, our understanding of such a mechanism from a superstring-model, such as\ntype IIB string theory, discussed by Li et al. in [10], is inadequate, due to the non-perturbative nature of the process\nof D-particle-induced mass flips, in a region of strong gravity. Such processes require knowledge of the dynamics of\nD-particles per se, and, unlike the simple recoil/capture processes that do not involve mass changes, cannot be simply\ndescribed by means of (perturbative) world-sheet methods. Nevertheless the time scale involved in such a mass flip\ncan be estimated, using stringy uncertainty relations that are independent of the details of the underlying microscopic\nstring model. We first note that when a D-particle interacts with a pair of open string states stretched between the\ndefect and the D3 brane, representing the capture and splitting process (as in fig. 1), there is an induced repulsive\nshort-range potential V, calculated by means of appropriate world-sheet annulus graphs in [21], following techniques\ndeveloped in [22]. The relevant parts of the potential for our discussion in this paper are of the form\nV ∋−\n2\n\nπ α′ u2\n,\n12 r3\n\n(19)\n\nv\nwhere u is the relative four-velocity (i.e. u2 = 1−v\n2 in units of the speed of light in (Minkowski) vacuo c = 1 and v\nis the 3-velocity) between the D-particle and the D3-brane and r is the distance between the defect and the brane\nalong the transverse directions to the brane world (c.f. fig. 1; there is no potential for D-particle motion parallel\n\n\f7\nto the brane [22]) 1 . In our case, with a fundamental\n√ string stretched between the two, the order of this distance\nα′ = 1/Ms to a (much smaller) characteristic minimum one\ncan vary typically\nfrom\nthat\nof\nthe\nstring\nlength\n√\n′\nLmin ∼ mα ≪ α′ where m is a typical mass scale of the stretched light string state representing the flavoured\n\u00013\ns\nstates [21, 22]. The corresponding magnitudes |V| are |V| ∼ Ms u2 and |V| ∼ M\nMs u2 . In this work we will\nm\nrestrict our attention to the simple case of two dominant mass eigenstates, with masses mi , i = 1, 2; one may then\ntake m ∼ 12 (m1 + m2 ). It will be convenient to collectively represent the effects of these two extreme cases for the\npotential in a single formula:\n\u0012\n\u0013q\nMs\n|V| ∼\nMs u2 ,\n(20)\nm\nwith q = 0(3) for the former (latter) case.\nA D-particle induced mass flip of a flavoured matter string state, such as a neutrino, will be between masses\nseparated by terms of order (17), (18) in our scenario. Since the recoil contribution of the D-particle cancels out\non average, one has correspondingly a momentum conservation for the neutrino state interacting with the defect. In\nthe non-relativistic limit of the D-particle recoil velocities |u| ≃ |v| ≪ 1 energy conservation and in a first quantized\nweakly coupled gs < 1 string theory framework, energy conservation implies:\nMD + ≪ (p2 + m1 2 )1/2 ≫=≪ (p2 + m2 2 )1/2 ≫ +MD +\n\n1\nMD ≪ u2 ≫ +O(u4 ) ,\n2\n\n(21)\n\ns\nwhere MD = M\ngs ∼ MP is the D-particle mass (assumed to be of order of the four-dimensional Planck mass MP ).\nThis allows us to estimate the recoil velocity fluctuations during a mass-flip process. The above relation expresses\nan average over both quantum fluctuations of the recoil velocity at the individual D-particle level and over D-particle\nfoam populations. This averaging is denoted by ≪ . . . ≫. On denoting the neutrino energy difference by ∆E, one\nmay estimate from (21):\n\nMs ≪ u2 ≫∼ 2gs ∆E .\n\n(22)\n\nHence, the recoil velocity fluctuation accompanying a mass-flip induces in turn a fluctuation in the potential (19) of\n\u0010 √ \u0011q ′ √\norder (for r ∼ m α′\nα′ , with q ′ = 0 or 1, corresponding to the two characteristic scales of the intermediate\n\nstring states discussed above) :\n\n∆V ∼ 2\n\n\u0012\n\nMs\nm\n\n\u0013q\n\ngs ∆E .\n\n(23)\n\nIn the laboratory frame from the saturation of the energy-time uncertainty relation an energy fluctuation will\nimply a life-time ∆tqmass−flip for the intermediate string state associated with the mass flip. It suffices to consider the\nlow-energy quantum mechanical version of this uncertainty, which yields (in units h̄ = 1)\n\u0013q\n\u0012\n1\n1\nm\nq\n∆tmass−flip ∼\n∼\n,\nq = 0, 3 .\n(24)\n∆V\nMs\n2gs ∆E\nWe will denote by ∆tcapture the time during which an intermediate string state, stretched between the D-particle\nand the D3-brane world, grows from zero size to its maximal one permitted by the stringy time-space uncertainty\nrelations, and back to zero size. To have the possibility of mass-flip in string theory, ∆tqmass−flip must be longer than\nthe time involved in capture, ∆tcapture . As discussed in [10], the capture time is of order\n∆tcapture ∼\n\n1\n\nα′ p0\n,\n1 − u2\n\n(25)\n\nIn the supersymmetric model of [21], the brane is a D8-brane, from which a D3-brane can be obtained by appropriate compactification.\nThe form of the (repulsive) short-range interaction, and in particular the dependence on u and r, are insensitive to such compactification\ndetails, but do depend on the dimensionality of the interacting branes [22]. On the other hand, the precise form of the numerical coefficient\ndepends on the details of the construction and on the presence of other branes and orientifold planes (the latter ensuring dynamical\ncompactification of the bulk space in the model). However, for our order of magnitude estimates such issues are not relevant. Moreover,\nthe presence of orientifold planes in the construction of [21] can cancel velocity independent terms in the potentials. Such terms are also\nirrelevant since we are only interested in potential fluctuations induced by the velocity fluctuations, see eq. (23) below.\n\n\f8\n\u00011\nwhere u2 is the D-particle recoil velocity, and p0 ∼ p2 + m2 2 is the energy of the incident string state.\nThe delays (25) are consistent with the time-space uncertainty relation ∆t∆X ∼ α′ , characteristic of string theory [23] and actually saturate it. They can be computed rigorously within superstring theory in D-particle backgrounds\nby evaluating the relevant scattering amplitudes and looking at backward scattering contributions [10, 16]. In what\nfollows we shall only be interested in contributions to leading order in small quantities, and so, when using (25), the\nrecoil velocity u will be ignored. The capture time (25) does not involve mass flip, and it is associated simply with\ncapture and re-emission of an open string state by the D-particle.\nWe reiterate that, in order for the mass-flip process to be feasible within a string theory model, it is necessary that\nthe capture time (25), which saturates the stringy time-spaced uncertainties, is shorter than, or at most equal to,\nthe mass-flip time (24). Otherwise, mass flip does not take place. Such a requirement, then, implies an upper bound\nfor the spatial momenta of the states that can possibly undergo mass flip, i.e. for the momenta associated with the\nFock-type flavour vacuum [2, 7]\nFirst let us consider the case q = 0. It is easy to see from (24) and (25) that for all momenta that define an\neffective-low energy theory, i.e. momenta smaller than the Planck scale p < Ms /gs , the condition\n∆tqmass−flip > ∆tcapture\n\n(26)\n\nis comfortably satisfied, since to violate it requires energy scales\nE>\n\nMs Ms\nMs\n.\n≫ MP ≡\ngs 2∆E\ngs\n\n(27)\n\nFor a ratio ξ of typical neutrino mass scale m to momenta, with ξ either small or large, compared to unity, this\ninequality can only be satisfied for mass differences δm2 ≡ |m21 − m22 | > Ms2 /gs . This requirement is physically absurd,\nand thus yields no physically sensible constraint on the neutrino mass differences for the case q = 0.\nHowever, on taking into account the case q = 3, the condition (26) is satisfied for all momenta smaller than the\ncutoff-scale Ms /gs provided\n\u0012\n\u0013\nm\n2\n2\n(28)\nδm ≤ m\ngs Ms\nwhich is a strong constraint for the foam-induced mass differences.\nThe bound (28) leads to very small foam-induced mass differences for large string mass scales, Ms , close to the\nPlanck scale MP , while one can get mass differences of the order of the observed ones for Ms of the order of TeV, and\ngs ∼ 10−16 , such that Ms /gs = MP ∼ 1019 GeV. Compactification details, of course, in phenomenologically realistic\nstring/brane models may affect such estimates seriously. The reader should notice that in the bound (28) there is a\ntheoretical uncertainty at most of order O(10), due to the uncertainty in the numerical coefficients in the potential\n(19), which depend on the details of the microscopic model, as already mentioned.\nHence mass flip processes, at least from the point of view of stringy uncertainties, are consistent physical processes\nthat can take place for neutrino energy differences of physical relevance. A microscopic understanding of these\nprocesses in detailed realistic superstring/supermembrane models is, of course, still pending, and hence we can only\ngive here plausibility arguments on the existence of such processes.\nIt should also be noticed that, for small masses over momenta, and on assuming, for concreteness, only a D-foaminduced mass difference (18) among flavours, one may estimate from (21) the average stochastic fluctuations of the\nD-particle foam recoil velocities:\n≪ u2 ≫ = ≪ σ 2 ≫≃ gs\n\n∆m2foam\n≃ N⋆ ≪ 1 .\nMs p\n\n(29)\n\nHere we should remember that N ⋆ denotes the effective number of D-particle defects contained in a Planck volume.\nThe reader should then notice the form similarity of (29) with the gravitational MSW-like relation (17) conjectured\nin ref. [19]. The order of the estimate, of course, may change significantly if the induced mass differences among\nneutrino flavours due to the foam constitute only a small percentage of the physically observed one ( as is most likely\nthe case) even if the D-particle foam is physically relevant [19].\nIV.\n\nLOW-ENERGY BOSONIC FIELD-THEORY MIXING AND FLAVOUR VACUA\n\nIn this article, we shall discuss mixing of field theory excitations, induced on both bosonic [7] and fermionic\nexcitations of strings by D-particles, during their topologically non-trivial interactions (spiltting/capture/re-emission)\n\n\f9\nwith strings. However, the mixing will be discussed in the presence of a slightly expanding universe (15), induced\non global scales by time varying populations of quantum fluctuating D-particles, as discussed above. The presence\nof both fermionic and bosonic \"flavoured\" field theory excitations of strings, finds a natural application in the case\nof superstrings and super-D-branes, which is the ultimate physical theory we have to consider. Indeed, even if\nsupersymmetry is eventually broken in target space, the partners (e.g. sneutrinos) do exists, and in the case of flavour,\ntheir mass differences might be of the same order as the original particles (corresponding to flavoured neutrinos in our\nexample), despite the fact that the mass differences between particles and their supersymmetry partners might be at\nleast a few TeV, due to the broken supersymmetry. The only caveat in our mathematical construction is that it is\nbased on bosonic string theory, where the resummation of leading modular divergencies in the case of recoil-velocity\ndeformed σ-models, is possible [11]. Unfortunately in the supersymmetric case, which would necessitate world-sheet\nsupersymmetry as well, such a resummation is not possible at present [24]. Thus for the (realistic) case of (broken)\nsupersymmetric D-foam we could only assume that the conclusions drawn from the bosonic case, regarding stochastic\nfluctuations properties of the foam, are sufficiently robust to be extendable here.\nWe commence our discussion with a review of the bosonic case. The (1+1)-dimensional bosonic case has been\ndiscussed in detail in [7] and will not be repeated here, apart from pertinent information needed for completeness of our\ndiscussion. It has been shown there that the vacuum condensate in the case of scalar fields, taken as a representative\nexample, behaves as a fluid with w ≈ −1 once the MSW effect is taken into account. The mixing/expansion is\nconsidered in a (1 + 1) dimensional framework, since the recoil of the D-particle has been taken parallel to the motion\nof the bosonic excitations, assumed along one spatial direction, say X 1 (c.f. (11). In view of our isotropic foam\nsituation, considered here, (13), (15) our findings should carry forward to the full (3 + 1) dimensional case.\nFor a scalar field φ, the stress-energy tensor is:\nbos\nTμν\n[φ] =\n\n1\n(Dμ φDν φ + Dν φDμ φ) − gμν L\n2\n\n(30)\n\nThe 1 + 1 dimensional version (with gμν = C(η)ημν in the conformal frame (c.f. (11)) was considered in [7], where it\nwas shown that the only non-trivial components are the diagonal ones:\nbos\nT00\n[φ] = (∂η φ)2 + (∂x φ)2 + Cef f (η)m2 φ2\n\nTiibos [φ] = (∂x φ)2 + (∂η φ)2 − Cef f (η)m2 φ2\n\n(31)\n\nThe reader should have noticed that we used the symbol Cef f in the mass term for the scalar field and not simply\nCm2 φ2 . The quantity Cef f contains both the effects of the expansion and the MSW effect and plays the rôle of an\neffective scale factor; this is in a similar spirit to standard effective field theories of inflation [25] with interactions\nof massive dark matter particles to the inflaton field. The dispersion relations of such massive particles, and the\nassociated stress tensor components, include the effective scale factors, as above. We shall come back to this point\nwith more details when we discuss the fermionic case, where an entirely analogous situation applies.\nThe expressions (31) readily generalize to 3 + 1 dimensions as follows:\nbos\n[φ] = (∂η φ)2 +\nT00\n\n3\nX\nj=1\n\nTiibos [φ] = (∂η φ)2 +\n\n3\nX\nj=1\n\n(∂xj φ)2 + Cef f (η)m2 φ2\n\n(32)\n\n(∂xj φ)2 − Cef f (η)m2 φ2 + 2(∂xi φ)2\n\nwhere the sums over spatial three-dimensional indices are explicitly denoted for clarity. Since the form of this term\ndoes not change when we go from the 1 + 1 dimensional analysis to the 3 + 1 one, the conclusion that w ≈ −1 is valid.\nAs discussed in [7], the appropriate normal ordering (subtraction) in our case of D-particle foam has to remove any\nterms that do not vanish in the limit where the variance of the D-particle fluctuations vanishes, ≪ σ 2 ≫ → 0.\nWe further assume that at late eras of the universe the D-particle fluctuations are weak, so only leading order terms\nin an expansion in powers of ≪ σ 2 ≫ are kept.\nHence, after the appropriate subtraction, discussed further in [7], one arrives at\nf h0\n\nf h0\n\nbos\n|: T00\n[φ̂] :| 0if =\n\nf h0\n\n|: Cef f (η)m2 φ̂2 :| 0if\n\n|: Tiibos [φ̂] :| 0if = −f h0 |: Cef f (η)m2 φ̂2 :| 0if .\n\n(33)\n\nAny extra contributions acquired due to the higher ((3 + 1)) dimensionality, as compared to the (1 + 1)-dimensional\ncase of ref. [7], are common to the two components; therefore the equation of state w ≈ −1 holds also in the 3 + 1\ndimensional bosonic field case.\n\n\f10\nTo recapitulate, for weak D-particle foam, the energy density of the bosonic fluid in the flavour-vacuum formalism\nis positive, while the pressure is negative, and the equation of state is consistent with a cosmological constant. There\nis however an important issue to be addressed here. The expressions in (33), which involve integration over momenta,\nare formally ultraviolet divergent [7]. Hence in the low-energy field theory limit, the momentum integrals need a\nmomentum scale cut-off kmax . It should be emphasised that in string theory there are no actual ultraviolet momentum\ndivergencies. As already mentioned in the Introduction, these are artifacts of the low-energy local effective field theory\nwhich is defined up to energies of the order of the the Planck scale Ms /gs . Thus, by definition any momentum integral\nwill be cut-off at that scale automatically. The appropriate effective field theory degrees of freedom, accessible to\na low-energy observer, are defined by the subtraction procedure that we are applying to the bosonic or fermionic\nstress-energy tensors in this field-theoretic context. Moreover any such contributions to the vacuum energy should\nvanish in the absence of D-particle foam effects. It is in this sense that a cut-off kmax is used in the model.\nIn [7], such a cutoff scale, which is, however, much smaller than the Planck mass, was determined dynamically, by\nconsidering particle production. The result of the (1 + 1)-dimensional case of [7] has yielded the cutoff scale\nr\nm21 + m22\nkmax ∼\n,\n(34)\n2\nwhere m(i) , i = 1, 2 are bosonic eigenstate masses. This is a result of the fact that the particle production falls off\nwith the momentum, in such a way that the vacuum is populated significantly by flavoured bosons for momentum\nscales below (34), and thus it is in such regimes of four-momenta that the condensate becomes significant. For small\nmass differences, compared to masses, which we assume throughout our works 2 , we may use the parametrization [7]:\nδm\n, m+ ≡ m1 ,\n2\n1 (δm)2\n,\nkmax ∼ m +\n8 m\nδm = m1 − m2 ≪ m .\n\nm(±) = m ±\n\nm− ≡ m2\n\n(35)\n\nUpon inserting the cutoff in the momentum integrals and performing the appropriate subtractions (33), based on the\nmetric (15), we arrive at the estimate for the boson-induced flavour-vacuum energy density\nρbosons ∼ sin2 θ ≪ σ 2 (t0 ) ≫ δm2\n\n\u00012\n\n(36)\n\nin the case of predominant two-flavour mixing, which we restrict ourselves here for concreteness and brevity. The\nestimate requires time averaging of (33) over small capture times, t0 , which in our model has been estimated to be\nclose to zero [7]. This fact makes oscillatory terms, that may appear in the components of the stress tensor, negligible.\nNotice in our case the extra suppression factor ≪ σ 2 ≫ (t0 ), which for the cases of weak gravitational foam is smaller\nthan one, as compared to the flat-space time flavour vacuum case of [1, 6]. In view of (36) bounds on ≪ σ 2 ≫ may\nthen be imposed by cosmological considerations, given the order of magnitude of the dark energy at present eras of\nthe Universe, observed today. It is important to note that, in our approach, we assume that the relative motion of\nD3-brane worlds in the bulk at present eras is such that the associated supersymmetry breaking due to brane motion\nand the pertinent contributions to vacuum energy are negligible compared to the flavour-vacuum ones (36). This is\nan assumption that holds also for the fermionic contributions.\nV.\n\nLOW-ENERGY FIELD-THEORY MIXING AND FERMIONIC FLAVOUR-VACUA IN\n(3+1)-DIMENSIONS\n\nAs we shall discuss below, as far as the equation of state is concerned, a crucial difference appears when one\nconsiders fermionic low-energy field theory excitations in the context of flavour vacua. When the normal ordering\nprocedure is applied, the resulting equation of state is of the form 0 > w > −1/3, a range insensitive to the cut-off.\nThus, fermions alone, cannot lead to a present-epoch acceleration of the Universe through this mechanism. However,\n\n2\n\nWe remark that, even if the bosons refer to sneutrinos, which have heavy masses due to target-space supersymmetry breaking, the\nrelative mass differences between mass eigenstates may be assumed sufficiently small, since the mass differences are independent on\nsupersymmetry, especially if, according to our D-particle foam model, these mass differences originate from foamy interactions, and\nhence are quantum-gravitational in origin.\n\n\f11\nin our D-particle supersymmetric foam, where, for reasons stated, one has both bosons and fermions as a result of\nbroken target-space supersymmetry, the contributions to the equation of state of the flavour vacuum from flavoured\nbosons (e.g. sneutrinos) can lead to a current era acceleration, by affecting the equation of state appropriately.\nBefore presenting the details of our calculation, let us briefly summarize the formalism for the mixing of two\nfermionic (spin 1/2) flavours in a Minkowski space-time background: two flavoured fermions ψe (x) and ψμ (x) can be\nconstructed from two free Dirac fields ψ1 (x) and ψ2 (x) with definite masses m1 6= m2 , by means of the relation\n\u001a\nψe (x) = ψ1 (x) cos θ + ψ2 (x) sin θ\n(37)\nψμ (x) = −ψ1 (x) sin θ + ψ2 (x) cos θ\nIt has been shown [2] that in quantum field theory (QFT) it is possible, in a finite volume, to define rigorously a\nunitary operator that behaves as the generator of the mixing transformation for fields:\n\u001a\nψ̂e (x) = Ĝ†θ (t)ψ̂1 (x)Ĝθ (t)\n(38)\nψ̂μ (x) = Ĝ†θ (t)ψ̂2 (x)Ĝθ (t)\nThis can be written as\n\u0014 Z\n\u0010\n\u0011\u0015\n†\n†\nĜθ (t) = exp θ d~x ψ̂1 (x)ψ̂2 (x) − ψ̂2 ψ̂1 (x)\n,\n\n(39)\n\nthus allowing the definition of a flavour vacuum as the state\n| 0if ≡ Ĝ†θ (t) | 0i\n\n(40)\n\nwith | 0i the mass eigenstate vacuum used in the quantization of the field theory of ψ̂1 (x) and ψ̂2 (x). We should\nrecall that in the thermodynamic, infinite-volume limit, as in the bosonic case, the vacuum states | 0i and | 0if are\northogonal. Indeed this is the case for all the Fock-space excited states constructed out of these vacua [2, 3]. However,\nas discussed in [7] and also below, in our string-inspired effective theory, flavour boson or fermion states, constructed\nout of | 0if , will exist up to a dynamically determined momentum cutoff scale. Above that scale, the pertinent states\nwill be constructed out of the mass-eigenstate vacuum | 0i. This is one way that our microscopic approach differs\nfrom that of [2, 3].\nWe wish now to study how the flavour vacuum expectation value of the stress-energy tensor varies in a weakly\ncurved space-time background. For our model of D-particle foam, this is crucial, since the mixing phenomenon and a\nnon-trivial, Robertson-Walker type, space-time background (15) are induced as a result of the quantum fluctuations\nof the D-particles. Thus, self consistency requires an analysis of the flavour vacuum in the presence of a non-trivial\ncurved space-time, where particle production takes place. To this end, it is of interest to first consider a free theory\nof two fields of definite mass in a curved space-time, that will be regarded as a classical background. Then, under the\nassumption [7] that the metric is asymptotically flat at early times, one can introduce the mixing (and therefore the\nflavour vacuum) at t → −∞ in the way presented in the literature [2]. In our model of D-particle foam (c.f. fig. 1),\nthe assumption of asymptotically flat space times at early times, t → −∞, can be justified in a scenario in which the\nD3-brane worlds at t → −∞ finds itself in a bulk region depleted of D-particles. As the cosmological time elapses,\nthe D3-brane world may move into a densely populated bulk regions of D-particles, and subsequently exit them at\nasymptotically long times in the future, t → ∞, in such a way that an interpolating cosmological space-time between\n−∞ and +∞ may be induced as a result of such D-particle configurations. For current eras of the universe, we may\nassume that the density of D-particles is low enough so that there are only slight deviations from the Minkowski\nvacuum.\nAdopting the Heisenberg picture [2, 7], one can study the vacuum condensate induced by the mixing. Hence the\nflavour vacuum expectation value (vev ) of the stress-energy tensor operator is evaluated for a time-independent flavour\nvacuum state and a stress-energy tensor that evolves with time. Therefore, we are going to construct the stress-energy\ntensor operator for a theory with two free fermions in a curved background and evaluate its vev, considering the flavour\nvacuum defined in (40) and (39) as the vacuum, for t → −∞.\nAs has been well explained in the literature [26], the classical theory for fields with spinorial structure is generalized\nin curved space-time through the vierbein formalism. The expression for the stress-energy tensor for a free 1/2-spin\nfield reads\n\u0001\n1\nTμν (ψ) = −gμν L +\nψ̄γ̃(μ D ν) ψ − D(ν ψ̄γ̃ μ) ψ\n(41)\n2\nwhere L denotes the Lagrangian of our theory, γ̃μ are the generalized γ-matrices defined by {γ̃μ , γ̃ν } = 2gμν , Dμ is\nthe gravitational covariant derivative and ψ̄ ≡ iψγ 0 , and γ 0 is the temporal component of the ordinary γ-matrices\n\n\f12\nin the tangent plane (defined by {γ a , γ b } = 2η ab , a, b = 0, . . . 3 tangent plane indices in the vierbein formalism).\nThe stress-energy tensor for two free fields is simply Tμν (ψ1 , ψ2 ) = Tμν (ψ1 ) + Tμν (ψ2 ), therefore we can focus just\non Tμν (ψ). Assuming that the flavour mixing does not affect the homogeneity and the isotropy of the universe we\ncan consider a Friedmann-Robertson-Walker (FRW) metric in conformal coordinates {η, ~x}, gμν = C(η)ημν , with\nC(η) > 0. In this case, adopting the convention ημν = diag{−1, 1, 1, 1}, the stress-energy tensor becomes\n!\n√\nC\nC′\nTμν (ψ) = −Cημν L + ψ̄\nγ(μ ∂ ν) + √ γ(μ [γ0 , γ ν) ] ψ + h.c.\n(42)\n2\n16 C\nAn important remark on notation should be made at this point: from now on (i.e. in all subsequent formulae)\nthe contraction of the space-time indices μ, ν . . . is understood with respect to the Minkowski part of the metric,\ni.e. Aμ B μ ≡ ημν Aμ B ν , since the scale factor C(η) has been factored out appropriately. The notation regarding the\ncontraction of tangent-space indices a, b . . ., remains as before, the contraction involving the tangent-space Minkowski\nmetric η ab .\nThe quantization of this theory has been specifically carried out by [27] and discussed more generally by [28].\nAccording to [27], the quantized spinor field can be written as\nψ̂(η, ~x) =\n\n! 32\nX\n1\nia\np\nâ(a,b) (~\np, η)v (a,b) (~\np, η) e\nL C(η)\np\n~\n\nR\n\np\n~*~\nx− ω(η)dη\n\na, b = ±1\n\n\u0001\n\n(43)\n\nwhere L is the parameter that enters the\ncondition ψ(η, ~x + ~nL) = ψ(η, ~x) (~n being a vector with\npperiodic boundary\n(a,b)\n2\n2\ninteger Cartesian components), ω(η) ≡ p + m C(η), v\n(~\np, η) is a spinor defined by\np\n (a,b)\n(~\np, η) ≡ v (a,b) (~\np/ C(η))\nv\np\n0\n2\n2\n(44)\np) = 0\n(−ia p + m γ + ia~γ * p~ + m)v (a,b) (~\n (a,b)†\n′ ′\nv\n(~\np)v (a ,b ) (~\np) = δa,a′ δb,b′\n′\n\n′\n\nand â(a,b) (~\np, η) are operators such that {â(a,b) (~\np, η), â(a ,b )† (~q, η)} = δa,a′ δb,b′ δp~,~q . In order to introduce the mixing at\nearly times, we first have to define our Fock space for η → −∞. The relevant operators are Â(a,b) (~\np) ≡ â(a,b) (~\np, −∞)\n′ ′\nwith {Â(a,b) (~\np), Â(a ,b )† (~\nq )} = δa,a′ δb,b′ δp~,~q. Starting with these operators, we can define a Fock space for η → −∞\nfollowing the usual prescriptions of minkowskian QFT. Moreover, if we assume that for our conformal scale factor\nbehaves as C(−∞) → 1, we can introduce the mechanism of the mixing in the way that has been explained above.\nTherefore the flavour vacuum will be defined by\n| 0if ≡ Ĝ†θ (−∞) | 0i\n\n(45)\n\nkeeping in mind that, since the space-time is asymptotically flat at early times, the fields ψ̂ behave in the usual\nrelativistic way:\nψ̂(η, ~x) =\n\n1 X\n\nL\n\n3\n2\n\nÂ(a,b) (~\np)v (a,b) (~\np)eia(~p*~x−\n\n√\n\np2 +m2 η)\n\n(46)\n\np\n~\na, b = ±1\n\nfor η → −∞. (N.B. the mass-eigenstate index i is being omitted here for brevity.) We want now to evaluate the\nevolution in (conformal) time of the flavour vacuum expectation value of the stress-energy tensor. Noticing that the\nflavour vacuum has been defined in (45) by means of the operators Â(a,b) (~\np), whereas the fields ψ̂i are defined at any\ntime in terms of the operators â(a,b) (~\np, η), we have to find explicit relations between these two sets of operators that\nhold at any time η. This can be achieved by noticing [27] that\nX\nâ(a,b) (~\np, η) =\nDca (p, η)Â(c,abc) (ac~\np)\n(47)\na=±c\n\n′\n\nwith Daa (p, η) defined through the equation\nZ\n(a)\na\n′\nD(a′ ) (p, η) = δa′ + a\n\nη\n\nη0\n\n1 C ′ (η ′ ) mp 2ia′\ndη ′ p\ne\n4 C(η ′ ) ω(η ′ )2\n\nR\n\nω(η ′ )dη ′\n\n(a)\n\nD(−a′ ) (p, η ′ )\n\n(48)\n\n\f13\nwith a, a′ = −1, 1. Hence, at any time η, the solution of the equation of motion (43) can be written as\nψ̂(η, ~x) =\n\n1\np\nL C(η)\n\n! 32\n\nX\n\nÂ(a,b) (~\np)Dca (p, η)v (c,abc) (ac~\np, η)eia~p*~x−ic\n\np\n~\na, b, c = ±1\n\nR\n\nω(η)dη\n\n.\n\n(49)\n\nThe functions Dba (p, η) encode the features of curved space-time, but an explicit solution of equation (48) for a generic\nconformal scale factor C(η) is not known. In the rest of the work we will keep them in their implicit form, with the\nunderstanding that explicit formulae have to be evaluated case by case. In particular, in our case of D-particle foam,\nin which for late eras of the Universe the conformal scale factor of the induced metric (15) is close to one, for small\nvariances ≪ σ 2 ≫ ≪ 1 of the D-particles, we can evaluate approximately such functions, in an appropriate expansion\nin powers of ≪ σ 2 ≫.\nThese tools are sufficient to show that, in the continuous limit (L → ∞), we have\nf h0\n\nZ\n| Tii (ψ̂1 , ψ̂2 ) | 0if = h0 | Tii (ψ̂1 , ψ̂2 ) | 0i + sin2 θ\n\nkmax\n0\n\nand\nZ\n2\nh0\n|\nT\n(\nψ̂\n,\nψ̂\n)\n|\n0i\n=\nh0\n|\nT\n(\nψ̂\n,\nψ̂\n)\n|\n0i\n+\nsin\nθ\n00\n1\n2\nf\n00\n1\n2\nf\n\n\u0002\n\u0003\ndp V 2 (p) (Tii (η, p, m1 ) + Tii (η, p, m2 )) + O(sin3 θ)\n\n(50)\n\nkmax\n0\n\n\u0002\n\u0003\ndp V 2 (p) (T00 (η, p, m1 ) + T00 (η, p, m2 )) + O(sin3 θ) (51)\n\nwith all the other components vanishing. Above we used the notation\np\n√\nR\nh\n\u0001 2m C\n1 8 p4 C(η)\n−2i\n−1 2\n1 2\nTii (η, p, m) ≡\n+\n1\n−\n|D\n|\n−\n|D\n|\nRe\ne\n−1\n1\n3 (2π)2 ω(η)\np\np\n\u0001\n8\n1 2\np2 ω(η) C(η) 1 − |D1−1 |2 − |D−1\nT00 (η, p, m) ≡\n|\n(2π)2\n\nω(η)dη\n\n−1∗\nD1−1 D−1\n\n!\ni\n(52)\n\nand\nV 2 (p) =\n\np\np\np2 + m21 p2 + m22 − p2 − m1 m2\np\np\n.\np2 + m21 p2 + m22\n\n(53)\n\nAs in the boson case [7], we have also introduced a cutoff kmax in the four-momenta, since all expressions are affected\nby ultraviolet divergences.\nBefore discussing these divergences let us stress that in case of θ = 0 and/or m1 = m2 (i.e. in the absence of\nmixing), the function V 2 (p) vanishes and therefore f h0 | Tμν (ψ̂1 , ψ̂2 ) | 0if = h0 | Tμν (ψ̂1 , ψ̂2 ) | 0i, consistently with\nwhat we would expect if we set ψ̂1 = ψ̂2 in (40) and (39) [2]. It is important to remark once more that, in the context\nof the Heisenberg picture we have adopted here, the flavour vacuum condensate V (p)2 , which encodes the structure\nof the flavour vacuum in terms of Fock states in the mass representation [2], has been computed in the asymptotic\npast (η → −∞), when the induced space-time (15) is assumed flat (assuming a uniform D-particle background at\nη → −∞, with no significant curvature effects. It is understood that such assumptions are highly model dependent,\nand hence the considerations here are specific to the initial conditions). In our Heisenberg picture, the term V (p)2\ndoes not evolve with time, and as such, its contribution will not be involved in any normal ordering.\nVI.\n\nNORMAL ORDERING\n\nLet us now focus on the ultraviolet divergences. These infinities, in local field theories, are conventionally removed by\nrenormalization. In flat space-time this has been achieved by a suitable normal ordering. In the case of a conventional\nlocal field theory in a time dependent metric background, the renormalization [28] would involve state dependent\ncounter terms which, in a covariant procedure, can be tensorially constructed from the metric tensor. As already\nmentioned, in the present field theory model, which is the low-energy limit of a string theory involving D-particle\ncapture of stringy matter [7] (c.f. fig. 1), the procedure of normal ordering is dictated by the underlying microscopic\nphysics; the subtraction procedure, in particular, has to be such that in the limit of the absence of D-particles and\ntheir fluctuations, ≪ σ 2 ≫→ 0 the mixing phenomenon should disappear. Moreover in our D-particle foam model\n\n\f14\none needs to distinguish two effects, as far as the structure of the underlying space-time is concerned. The first effect\nconcerns a background space-time, over which propagation of low-energy matter excitations (fermions or bosons)\ntakes place. The background space-time in our case of D-particle foam has been argued to be obtained from quantum\nfluctuations of individual D-particles, which in the case of first quantised string framework are due to a summation\nover world-sheet topologies [11], upon (statistically) averaging over populations of D-particles on the D3-brane world\n(c.f. fig. 1). This leads to a background space-time metric of the form (15).\nThe individual MSW interactions of the flavoured matter excitations with the D-foam background [19], produce\nextra back-reaction local fluctuations on the space-time structure. They do not cause metric distortions, as already\nmentioned, but affect the particle mode's energy-momentum dispersion relations. This parallels and is in a similar\nspirit to the standard result when one considers particle production at the end of inflation [25]. Hence in the effective\nQFT we have to take into account interactions of the neutrinos and the D-particle medium. In this respect, the scale\nfactor C(η) appearing in the above formulae for the fermions, should be considered as representing the background\nspace-time. The energies ω on the other hand will contain an \"effective\" scale factor\n\u0013\n\u0012\n∆C(η)\nCeff (η) = C(η) + ∆C(η) ≡ C(η) 1 +\n.\n(54)\nC(η)\nIn the dispersion relation\nωeff =\n\np\np\nm2 ∆C(η)\n,\np2 + m2 Ceff (η) ≃ p2 + m2 C(η) + p\n2 p2 + m2 C(η)\n\n(55)\n\nto leading order in the approximation |∆C| ≪ 1. The ∆C is the MSW contribution. For the MSW scenario (c.f. (18),\n(29)), one has the estimate\nm2 ∆C(η) ∼ C(η)∆m2foam ≃ C(η) N ⋆ MP p ∼ C(η) ≪ σ 2 ≫ gs−1 Ms p .\n\n(56)\n\nSuch dispersion relations, that take proper account of the non-trivial interactions of the matter probes with the\nD-particles in the foam, should replace the free-particle dispersion relations considered in [27] and used so far.\nNotice that in our model, in general ∆C would depend on both momenta and position of the mode. For the purposes\nof this work, we are only interested in an order of magnitude estimate of the induced dark energy contributions. We\ndo not need to specify the precise form of the induced distortion ∆C, apart from the fact that in the context of our\nmodel we know that this will be proportional to the stochastic fluctuations of the recoil velocity, σ 2 (η), at the time\nof the interaction. For sufficiently small ≪ σ 2 ≫ one may ignore the momentum dependence of ∆C(η) in (56). On\nthis basis, one can replace ω in Eqs. (52) by ωeff (55), leaving the initial-time condensate V (p)2 intact. In a similar\nvein, eq. (48), becomes:\nZ η \u0010p\nR\n\u0011\np\nω ′ (η ′ ) 2ia′ ω(η′ )dη′ (a)\n(a)\n′\nD(a′ ) (p, η) = δaa′ + a′ dη ′\nC(η ′ )\n(p,\nη\n)\n(57)\ne\nD\n(−a′)\n2meff (η ′ ) ω(η ′ )\nη0\np\nwith a, a′ = −1, 1 and ω(η) = p2 + m2eff (η)C(η), and m2eff C(η) ≡ m2 Ceff (η).\nAfter these necessary preliminaries, we are now in a position to discuss our subtraction (normal ordering) procedure.\nThe latter, will be defined in such a way that in the absence of any MSW interaction of the fermion matter with\nD-particles, the stress tensor should vanish. Notice that the MSW interactions, which are proportional to the density\nof defects, are disentangled from the space-time background C(η), in the sense that they contribute to mass shifts\nbut they do not induce space-time distortions. However, in view of (29), in our picture, the induced mass shifts are\nalso proportional to the stochastic fluctuations of the recoil velocity of the D-particles, which affects the space time\nbackground, c.f. (15). Hence, by subtracting the MSW-like terms from the stress tensor, no further subtraction would\nbe necessary in order to ensure that in a Minkowski space time the stress tensor would vanish. Replacing, then, ω\nby ωeff in Eqs. (52) one should use (55) to leading order in a small-∆C(η) expansion to determine the energy density\nand pressure of the fermion fluid.\nSince in our D-particle case, the change ∆C is proportional to the variance σ 2 (η) ≪ 1 of the recoil-velocity fluctuations in our weak space-time foam background (c.f. (29)), only leading order contributions proportional to σ 2 should\n′\nbe taken into account. We observe that the terms involving Daa operators become irrelevant to this leading order,\nand so the latter should be replaced by their flat-space-time counterpart, which vanish (c.f. (48), (57)). As a result,\nEqs. (52) become:\np\n2\nX\nC(η)p4\nm2i\n∆C(η)\n: Tii (η, p, m) :≈ −\n3\n3(2π)2\n2\n2\n2\ni=1 (p + m C(η))\n4\n\ni\n\n\f15\np\n2\nX\n4 C(η)p2\nm2i\n∆C(η)\n: T00 (η, p, m) :≈\n1\n2\n(2π)2\n2\n2\ni=1 (p + m C(η))\ni\n\n(58)\n\nwhere the approximate sign indicates leading orders in ∆C. Since, to leading order in σ 2 , it is expected, rather\ngenerically, that ≪ ∆C(η) ≫ ∝ ≪ σ 2 (η) ≫, the background scale factors C(η) in the above relation can be replaced\nby constants (i.e. flat space-time). Moreover, upon taking the statistical average ≪ . . . ≫ of (58) over D-particle\npopulations, to a good approximation for the weak space-time foam situations of interest, any momentum dependence\nof ≪ ∆C(η) ≫ disappears; hence the latter quantity can be taken out of the momentum integrals in (50), (51). This\nwill be understood in what follows.\nOn recalling that for a relativistic fluid T00 /C(η) represents the energy density, and Tii /C(η) the pressure, we can\neasily see from (58), (50), (51) that our fermionic vacuum condensate behaves as a fluid with negative pressure, and\npositive energy density, with an equation of state that satisfies −1/3 < w < 0. This is the result of the opposite\npowers of ω (and hence ωeff , according to our discussion above) appearing in a specific way in the pressure and energy\nexpressions (50),(51), (52).\nVII.\n\nEQUATION OF STATE, VACUUM ENERGY ESTIMATES AND DYNAMICAL MOMENTUM\nCUTOFF\n\nTo determine the precise value of both the energy density and pressure, and hence the equation of state, it is\nnecessary to have knowledge on the momentum ultraviolet cutoff kmax used to regulate ultraviolet infinities in flat\nspace-time. To leading order in the small expansion ∆C(η), such flat space-time approximation for the evaluation of\nthe cutoff function proves sufficient. As discussed in [7], a dynamical cutoff function appears if one considers particle\nproduction due to the flavour vacuum. In flat space-times, the particle number is given by:\nf h0\n\n| N̂e (~\np) | 0if = sin2 θ Ξ(p) (1 − cos [(ω1 + ω2 ) η]) + O(sin3 θ) + O(σ 2 )\n\n(59)\n\nwith\n\u00012\n(ω2 − m2 )(w1 + m1 ) − p2\nΞ(p) =\n2ω1 ω2 (ω2 − m2 )(w1 + m1 )\nand ωi =\n\n(60)\n\np\np2 + m2i , i = 1, 2. The p dependence is essentially determined by the behaviour of Ξ(p). For large p\n\nFIG. 2: The function Ξ(p) is plotted in the range p ∈ [0, 10] for the values m1 = 1 and\n(in arbitrary units, just for\n√ m2 = 2 √\nillustration purposes). Notice that there is a maximum [2], corresponding to the point m1 m2 = 2, in our arbitrary units.\n\n(compared to masses) the function falls off with an inverse forth power of momentum (for a plot of this function vs.\nmomentum, p, see fig. 2):\nΞ(p) ≈\n\n(m1 − m2 )2 ((m1 + m2 )2 + 2(m21 + m22 ))\n1 (m21 − m22 )2\n−\n2\n2\np\n8p4\n\nand so there is a scale (determined by the ratio of the two terms in the above)\nq\n1\nk0 ≈\n3m21 + 2m1 m2 + 3m22\n2\n\n(61)\n\n(62)\n\n\f16\nwhich is a plausible cut-off scale in momenta p. Thus although there is no sharp cutoff, nevertheless, the flavour\nvacuum is populated significantly by fermionic models below this scale, and hence the latter serves as our cutoff kmax ,\nappearing in (50), (51). A similar situation characterised the ((1+1)-dimensional) boson case in [7]. The reader is\ninvited to compare the order of magnitude of (62) with that of (35).\nIt is easy to show that\nf h0\n\n|: T00 (ψ̂1 , ψ̂2 ) :| 0if ≈ sin2 θ\n\nm2 (δm)2\n∆C(η)I(kmax )\nπ2\n\n(63)\n\nwhere\nI(kmax ) =\n\nkmax\n\nZ\n\ndp\n\n0\n\np4\n\n(64)\n\n5\n\n(p2 + m2 ) 2\n\nand we have considered δm ≪ m.\nSimilarly, f h0 |: Tii (ψ̂1 , ψ̂2 ) : | 0if is given by\nf h0\n\nm2 (δm)2\n∆C(η)J(kmax )\n3π 2\n\n|: Tii (ψ̂1 , ψ̂2 ) :| 0if ≈ − sin2 θ\n\n(65)\n\nwhere\nJ(kmax ) =\n\nZ\n\nkmax\n\ndp\n\n0\n\np6\n7\n\n(p2 + m2 ) 2\n\n.\n\n(66)\n\nRepresenting kmax in units of the characteristic neutrino mass scale m, i.e.\nkmax ≡ κ m ,\n\nκ>0,\n\n(67)\n\nit is easy to show that\nI(κm) = log(κ +\nJ(κm) = log(κ +\n\np\n\np\n\n1 + κ2 ) −\n\n1 + κ2 ) −\n\nκ(3 + 4κ2 )\n3\n\n3(1 + κ2 ) 2\n\nκ(15 + 35κ2 + 23κ4 )\n5\n\n15(1 + κ2 ) 2\n\n.\n\n(68)\n\nBecause of (56), we may write (63) as:\nf h0\n\n|: T00 (ψ̂1 , ψ̂2 ) :| 0if ≈ sin2 θ\n\n(δm2 )2 ∆m2foam\nC(η)I(kmax ) .\nπ2\nm2\n(69)\n\nThe reader is invited to compare this expression with the corresponding one for the boson case, (36), upon taking (56)\ninto account. Upon making the simplifying assumption that the foam is responsible for the whole of the experimentally\nobserved mass differences of light neutrino species, we observe that the factor multiplying sin2 θI(kmax ) is of order\n(δm2 )3\nC(η). For late eras, C(η) ∼ 1 (in units of the present epoch scale factor of the Universe). For the biggest\nm2\nof the mass differences observed today [29], δm223 ∼ 0.0027 eV2 (in conventional notation), this factor is of order\n7 × 10−118 MP4 . Moreover the observed mixing sin2 θ23 contributes factors slightly smaller than one (the current\nexperimental data [29] indicate sin2 (2 θ23 ) > 0.87 at 68% confidence level), and, for the ranges of cutoffs considered\nabove, the cutoff factors I(kmax ) are of order O(10) at most. The accepted magnitude of the vacuum energy, claimed\nto have been observed today in the form of a positive cosmological constant, Λ, is Λ ∼ 10−122 MP4 (MP ∼ 1019 GeV).\nIn order to reproduce such a value one needs\nsin2 θ\n\n∆m2f oam\nm2\n\n∼ 1.4 × 10−4 .\n\nThis is compatible with other phenomenological tests of space-time foam using neutrinos [19]. The reader is also\ninvited to compare this result with the bound (28), derived from stringy uncertainty considerations, in the case of a\nstring mass scale Ms = O(TeV), upon taking proper account of the theoretical uncertainties due to model dependence,\nas discussed there.\n\n\f17\nThe equation of state of this fermionic fluid in the flavour vacuum is approximately determined by:\nR kmax\nP\ndpV 2 (p) 2i=1\n1 0\nwF = − R k\n3 max dpV 2 (p) P2\n0\n\ni=1\n\nm2i\n3\n2\n(p +m2i ) 2\nm2i\n1\n(p2 +m2i ) 2\n\n.\n\nFrom (70), to leading order in δm, we can deduce that wF lies in the range −1/3 < wF < 0 since\n\u0012\n\u0013\nκ5\n1\n1−\nwF = −\n5\n3\n5g(κ)(1 + κ2 ) 2\n\n(70)\n\n(71)\n\nwhere g(κ) is a non-negative function given by\ng(κ) = log(κ +\n\np\nκ(3 + 4κ2 )\n1 + κ2 ) −\n3 .\n3(1 + κ2 ) 2\n\n(72)\n\nThe asymptotic approach of wF to − 31 as κ → ∞ is logarithmic with the cut-off and can be shown to be\n\u0012\n\u001a\n\u001b\u0013\n1\n1\n1\n7\n1\n1−\n.\n(73)\n+ 4− 2\nwF = −\n3\nlog(κ) 5 8κ\n2κ\n√\nFor the cut off of (62), wF ≃ −.17. As κ is changed from 2 the value of wF rapidly asymptotes to − 13 , e.g. with\n√\nκ = 20, wF ≃ −.27.\nIn 3 + 1-dimensions, for the fermionic case, the relative factor of 3 in the denominator of the spatial components of\nthe stress tensor (50) (as compared to the temporal component (51)) is due exclusively to the spatial dimensionality.\nIn the bosonic case, by contrast, the dimensionality of space is not relevant when evaluating the equation of state\nwB in terms of the appropriately normal ordered components of the corresponding stress tensor. Hence, in the latter\ncase, we obtain wB ≃ −1, for late eras.\nVIII.\n\nDISCUSSION AND OUTLOOK\n\nIn this work we have evaluated above the contributions from (3+1)-dimensional low-energy fermions to the flavourFock-space vacuum energy and pressure on a brane world punctured by D-particle defects. We have found that the\npertinent liquid is not describing a cosmological constant vacuum. The equation of state lies in the range 0 > w > − 31 .\nThis does not lead to acceleration of the Universe, which requires w < − 13 .\nOf course, in a D-brane setting, as that of fig. 1 examined here, there are many other contributions to the D3-brane\nworld, some of which are notably attributed to bulk D-particles [21]. At late eras (relative to the time of the cosmically\ncatastrophic brane collision corresponding to a Big Bang), there are also bulk contributions to the brane dark energy,\nwhich are due to strings stretched between D-particle defects and the D3 brane world. The reader should recall [21]\nthat the contributions to the vacuum energy from the above processes are due to the perpendicular components of the\nrelative velocity of the D-particle with respect to the D3-brane world in the bulk; the motion of a D-particle on the D3\nbrane world, parallel to its uncompactified components does not lead to any contribution. Hence it is plausible that\nthese contributions are subdominant since in late epochs the motion of the D3 brane in the bulk is extremely slow. It\nis in this sense that the dominant contributions to the D3-brane vacuum energy could come from the above-described\nprocesses of capturing and splitting of flavoured string states on the brane, corresponding to the flavour Fock-space\nvacuum contributions evaluated above.\nTo ensure that the flavour vacuum contributions to the dark energy leads to accelerating Universes at late epochs,\nas the current phenomenology indicates, one should have bosons simultaneously present with fermions. In fact the\nbosonic and fermionic contributions to the vacuum energy and pressure are algebraically additive. In the case of\nD-particle foam, only electrically neutral particles interact non trivially with the D-particle defects.\nIn the context of supersymmetric low-energy field theories, such as those derived in the low-energy limit of superstrings, the relevant bosons may be the sneutrinos, the supersymmetric partners of neutrinos, which have large masses\ndue to target-space supersymmetry breaking. However, the relative mass differences between mass eigenstates may\nbe assumed sufficiently small, since the mass differences are independent of supersymmetry, especially if, according to\nour D-particle foam model, they are quantum-gravitational in origin. Hence even if the partners have a much greater\nmass, due to supersymmetry breaking, we may assume that, among different flavours, the same small mass differences\nthat characterize the fermionic excitations also characterize the bosonic superpartner flavours. In this sense, one has\n\n\f18\ncontributions to the vacuum energy density and pressure from the bosons, which are of the same order as those of\nfermions. In realistic supersymmetric models, the total equation of state may be complicated, as it depends on the\nvarious fluids that participate in the flavour vacuum structure. Nevertheless, it is possible to have an equation of\nstate that guarantees a late-era acceleration of the universe.\nHowever, technically the extrapolation of the above results to supersymmetric cases is not a trivial task. A supersymmetric theory is by construction typically an interacting theory, while above the quantization procedure adopted\nwas based on free excitations. We hope to come back to this important issue in a forthcoming publication.\nAcknowledgements\n\nThe work of N.E.M. and S.S. is partially supported by the European Union through the Marie Curie Research and\nTraining Network UniverseNet (MRTN-2006-035863), while that of W.T. by a King's College London (UK) graduate\nscholarship.\n\n[1] M. Blasone, A. Capolupo, S. Capozziello, S. Carloni and G. Vitiello, Phys. Lett. A 323, 182 (2004) [arXiv:gr-qc/0402013].\n[2] M. Blasone and G. Vitiello, Annals Phys. 244 (1995) 283 [Erratum-ibid. 249 (1996) 363] [arXiv:hep-ph/9501263] and\nreferences therein.\n[3] C. R. Ji and Y. Mishchenko, Phys. Rev. D 65, 096015 (2002) [arXiv:hep-ph/0201188].\n[4] C. Giunti, Eur. Phys. J. C 39, 377 (2005) [arXiv:hep-ph/0312256].\n[5] M. Blasone, P. A. Henning and G. Vitiello, Phys. Lett. B 451, 140 (1999) [arXiv:hep-th/9803157].\n[6] A. Capolupo, S. Capozziello and G. Vitiello, Phys. Lett. A 373, 601 (2009) [arXiv:0809.0085 [hep-th]]; A. Capolupo and\nG. Vitiello, J. Phys. Conf. Ser. 174, 012063 (2009) [arXiv:0901.4531 [hep-th]] and references therein.\n[7] N. E. Mavromatos and S. Sarkar, New J. Phys. 10, 073009 (2008) [arXiv:0710.4541 [hep-th]].\n[8] J. R. Ellis, N. E. Mavromatos and D. V. Nanopoulos, Gen. Rel. Grav. 32, 127 (2000) [arXiv:gr-qc/9904068]; Phys. Rev. D\n61, 027503 (2000) [arXiv:gr-qc/9906029]; Phys. Rev. D 62, 084019 (2000) [arXiv:gr-qc/0006004]. J. R. Ellis, K. Farakos,\nN. E. Mavromatos, V. A. Mitsou and D. V. Nanopoulos, Astrophys. J. 535, 139 (2000) [arXiv:astro-ph/9907340]; J. R. Ellis,\nN. E. Mavromatos, D. V. Nanopoulos and G. Volkov, Gen. Rel. Grav. 32, 1777 (2000) [arXiv:gr-qc/9911055]. J. R. Ellis,\nN. E. Mavromatos and M. Westmuckett, Phys. Rev. D 70, 044036 (2004) [arXiv:gr-qc/0405066].\n[9] J. R. Ellis, N. E. Mavromatos and A. S. Sakharov, Astropart. Phys. 20, 669 (2004) [arXiv:astro-ph/0308403]; J. R. Ellis,\nN. E. Mavromatos, D. V. Nanopoulos and A. S. Sakharov, Int. J. Mod. Phys. A 19, 4413 (2004) [arXiv:gr-qc/0312044].\n[10] J. R. Ellis, N. E. Mavromatos and D. V. Nanopoulos, Phys. Lett. B 665, 412 (2008) [arXiv:0804.3566 [hep-th]]; T. Li,\nN. E. Mavromatos, D. V. Nanopoulos and D. Xie, arXiv:0903.1303 [hep-th], Phys. Lett. B in press.\n[11] N. E. Mavromatos and R. J. Szabo, Phys. Rev. D 59, 104018 (1999) [arXiv:hep-th/9808124].\n[12] N. E. Mavromatos and S. Sarkar, Phys. Rev. D 79, 104015 (2009) [arXiv:0812.3952 [hep-th]];\n[13] I. I. Kogan, N. E. Mavromatos and J. F. Wheater, Phys. Lett. B 387, 483 (1996) [arXiv:hep-th/9606102]; I. I. Kogan and\nN. E. Mavromatos, Phys. Lett. B 375, 111 (1996) [arXiv:hep-th/9512210].\n[14] Y. Lozano, Mod. Phys. Lett. A 11, 2893 (1996) [arXiv:hep-th/9610024]; For some subtleties in this canonical formalism\nfor open strings, of interest to us here, see: H. Dorn and H. J. Otto, Phys. Lett. B 381, 81 (1996) [arXiv:hep-th/9603186].\nNucl. Phys. Proc. Suppl. 56B, 30 (1997) [arXiv:hep-th/9702018]; for an extension to the case of Liouville strings, also of\ninterest to us here, see: G. Amelino-Camelia and N. E. Mavromatos, Phys. Lett. B 422, 101 (1998) [arXiv:hep-th/9711006].\n[15] N. Seiberg and E. Witten, JHEP 9909, 032 (1999) [arXiv:hep-th/9908142].\n[16] N. Seiberg, L. Susskind and N. Toumbas, JHEP 0006, 021 (2000) [arXiv:hep-th/0005040];\n[17] see, for instance: D. Bao, S. S. Chern and Z. Shen, An introduction to Finsler Geometry (Springer-Verlag (NY, 2000)).\n[18] C. P. Burgess, Nucl. Phys. B 294, 427 (1987).\n[19] G. Barenboim and N. E. Mavromatos, Phys. Rev. D 70, 093015 (2004) [arXiv:hep-ph/0406035]; G. Barenboim,\nN. E. Mavromatos, S. Sarkar and A. Waldron-Lauda, Nucl. Phys. B 758, 90 (2006) [arXiv:hep-ph/0603028]; N. E. Mavromatos and S. Sarkar, Phys. Rev. D 74, 036007 (2006) [arXiv:hep-ph/0606048].\n[20] L. Wolfenstein, Phys. Rev. D 17, 2369 (1978); S. P. Mikheev and A. Y. Smirnov, Sov. J. Nucl. Phys. 42, 913 (1985) [Yad.\nFiz. 42, 1441 (1985)]; For media with stochastically fluctuating (noisy) densities see: F. N. Loreti and A. B. Balantekin,\nPhys. Rev. D 50, 4762 (1994) [arXiv:nucl-th/9406003].\n[21] J. R. Ellis, N. E. Mavromatos and M. Westmuckett, Phys. Rev. D 71, 106006 (2005) [arXiv:gr-qc/0501060].\n[22] C. Bachas, Phys. Lett. B 374, 37 (1996) [arXiv:hep-th/9511043]; G. Lifschytz, Phys. Lett. B 388, 720 (1996)\n[arXiv:hep-th/9604156]; M. R. Douglas, D. N. Kabat, P. Pouliot and S. H. Shenker, Nucl. Phys. B 485, 85 (1997)\n[arXiv:hep-th/9608024].\n[23] T. Yoneya, Mod. Phys. Lett. A4 (1989) 1587; Prog. Theor. Phys. 103, 1081 (2000) [arXiv:hep-th/0004074].\n[24] N. E. Mavromatos and R. J. Szabo, JHEP 0301, 041 (2003) [arXiv:hep-th/0207273]; JHEP 0110, 027 (2001)\n[arXiv:hep-th/0106259].\n[25] See, for instance: D. J. H. Chung, Phys. Rev. D 67, 083514 (2003) [arXiv:hep-ph/9809489] and references therein.\n\n\f19\n[26]\n[27]\n[28]\n[29]\n\nS. Weinberg, Gravitation and Cosmology (John Wiley & Sons (1972)).\nL. Parker, Phys. Rev. D 3 (1971) 346 [Erratum-ibid. D 3 (1971) 2546].\nN. D. Birrell and P. C. W. Davies, Quantum Fields in Curved Space (Cambridge University Press (1982)).\nSee, for instance: P. Adamson et al. [MINOS Collaboration], Phys. Rev. D 77, 072002 (2008) [arXiv:0711.0769 [hep-ex]];\nD. G. Michael et al. [MINOS Collaboration], Phys. Rev. Lett. 97, 191801 (2006) [arXiv:hep-ex/0607088];\n\n\f"}