{"id": "http://arxiv.org/abs/1204.1102v2", "guidislink": true, "updated": "2012-04-06T03:03:02Z", "updated_parsed": [2012, 4, 6, 3, 3, 2, 4, 97, 0], "published": "2012-04-05T01:10:42Z", "published_parsed": [2012, 4, 5, 1, 10, 42, 3, 96, 0], "title": "Characteristics of Two-Dimensional Quantum Turbulence in a Compressible\n  Superfluid", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1204.2603%2C1204.3465%2C1204.4722%2C1204.5027%2C1204.6099%2C1204.4858%2C1204.4727%2C1204.6622%2C1204.2848%2C1204.0952%2C1204.1529%2C1204.2637%2C1204.2693%2C1204.1054%2C1204.2080%2C1204.0193%2C1204.3727%2C1204.3970%2C1204.0880%2C1204.6451%2C1204.5403%2C1204.4322%2C1204.2291%2C1204.6719%2C1204.6559%2C1204.3574%2C1204.6576%2C1204.5103%2C1204.2148%2C1204.5968%2C1204.5404%2C1204.2645%2C1204.0664%2C1204.5453%2C1204.5520%2C1204.1133%2C1204.1102%2C1204.2353%2C1204.1270%2C1204.6214%2C1204.3400%2C1204.0710%2C1204.3585%2C1204.4426%2C1204.3230%2C1204.2493%2C1204.6074%2C1204.4250%2C1204.5110%2C1204.2303%2C1204.3779%2C1204.0496%2C1204.3620%2C1204.0248%2C1204.2181%2C1204.5622%2C1204.1315%2C1204.3988%2C1204.2074%2C1204.2508%2C1204.5579%2C1204.4695%2C1204.6675%2C1204.4141%2C1204.6633%2C1204.4051%2C1204.5153%2C1204.1187%2C1204.6246%2C1204.1087%2C1204.3859%2C1204.5921%2C1204.2998%2C1204.0779%2C1204.5397%2C1204.3108%2C1204.4692%2C1204.6594%2C1204.5857%2C1204.2747%2C1204.0429%2C1204.3912%2C1204.0445%2C1204.5416%2C1204.5742%2C1204.6505%2C1204.4703%2C1204.5617%2C1204.1018%2C1204.0566%2C1204.5284%2C1204.1417%2C1204.6431%2C1204.4627%2C1204.3562%2C1204.1868%2C1204.5886%2C1204.1097%2C1204.1382%2C1204.4062%2C1204.6012&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Characteristics of Two-Dimensional Quantum Turbulence in a Compressible\n  Superfluid"}, "summary": "Under suitable forcing a fluid exhibits turbulence, with characteristics\nstrongly affected by the fluid's confining geometry. Here we study\ntwo-dimensional quantum turbulence in a highly oblate Bose-Einstein condensate\nin an annular trap. As a compressible quantum fluid, this system affords a rich\nphenomenology, allowing coupling between vortex and acoustic energy.\nSmall-scale stirring generates an experimentally observed disordered vortex\ndistribution that evolves into large-scale flow in the form of a persistent\ncurrent. Numerical simulation of the experiment reveals additional\ncharacteristics of two-dimensional quantum turbulence: spontaneous clustering\nof same-circulation vortices, and an incompressible energy spectrum with\n$k^{-5/3}$ dependence for low wavenumbers $k$ and $k^{-3}$ dependence for high\n$k$.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1204.2603%2C1204.3465%2C1204.4722%2C1204.5027%2C1204.6099%2C1204.4858%2C1204.4727%2C1204.6622%2C1204.2848%2C1204.0952%2C1204.1529%2C1204.2637%2C1204.2693%2C1204.1054%2C1204.2080%2C1204.0193%2C1204.3727%2C1204.3970%2C1204.0880%2C1204.6451%2C1204.5403%2C1204.4322%2C1204.2291%2C1204.6719%2C1204.6559%2C1204.3574%2C1204.6576%2C1204.5103%2C1204.2148%2C1204.5968%2C1204.5404%2C1204.2645%2C1204.0664%2C1204.5453%2C1204.5520%2C1204.1133%2C1204.1102%2C1204.2353%2C1204.1270%2C1204.6214%2C1204.3400%2C1204.0710%2C1204.3585%2C1204.4426%2C1204.3230%2C1204.2493%2C1204.6074%2C1204.4250%2C1204.5110%2C1204.2303%2C1204.3779%2C1204.0496%2C1204.3620%2C1204.0248%2C1204.2181%2C1204.5622%2C1204.1315%2C1204.3988%2C1204.2074%2C1204.2508%2C1204.5579%2C1204.4695%2C1204.6675%2C1204.4141%2C1204.6633%2C1204.4051%2C1204.5153%2C1204.1187%2C1204.6246%2C1204.1087%2C1204.3859%2C1204.5921%2C1204.2998%2C1204.0779%2C1204.5397%2C1204.3108%2C1204.4692%2C1204.6594%2C1204.5857%2C1204.2747%2C1204.0429%2C1204.3912%2C1204.0445%2C1204.5416%2C1204.5742%2C1204.6505%2C1204.4703%2C1204.5617%2C1204.1018%2C1204.0566%2C1204.5284%2C1204.1417%2C1204.6431%2C1204.4627%2C1204.3562%2C1204.1868%2C1204.5886%2C1204.1097%2C1204.1382%2C1204.4062%2C1204.6012&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Under suitable forcing a fluid exhibits turbulence, with characteristics\nstrongly affected by the fluid's confining geometry. Here we study\ntwo-dimensional quantum turbulence in a highly oblate Bose-Einstein condensate\nin an annular trap. As a compressible quantum fluid, this system affords a rich\nphenomenology, allowing coupling between vortex and acoustic energy.\nSmall-scale stirring generates an experimentally observed disordered vortex\ndistribution that evolves into large-scale flow in the form of a persistent\ncurrent. Numerical simulation of the experiment reveals additional\ncharacteristics of two-dimensional quantum turbulence: spontaneous clustering\nof same-circulation vortices, and an incompressible energy spectrum with\n$k^{-5/3}$ dependence for low wavenumbers $k$ and $k^{-3}$ dependence for high\n$k$."}, "authors": ["T. W. Neely", "A. S. Bradley", "E. C. Samson", "S. J. Rooney", "E. M. Wright", "K. J. H. Law", "R. Carretero-González", "P. G. Kevrekidis", "M. J. Davis", "B. P. Anderson"], "author_detail": {"name": "B. P. Anderson"}, "author": "B. P. Anderson", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevLett.111.235301", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1204.1102v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1204.1102v2", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "7 pages, 7 figures. Reference [29] updated for v2", "arxiv_primary_category": {"term": "cond-mat.quant-gas", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.quant-gas", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1204.1102v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1204.1102v2", "journal_reference": "Phys. Rev. Lett. 111, 235301 (2013)", "doi": "10.1103/PhysRevLett.111.235301", "fulltext": "Characteristics of Two-Dimensional Quantum Turbulence in a Compressible Superfluid\nT. W. Neely,1 A. S. Bradley,2 E. C. Samson,1 S. J. Rooney,2 E. M. Wright,1 K. J. H.\nLaw,3 R. Carretero-González,4 P. G. Kevrekidis,5 M. J. Davis,6 and B. P. Anderson1\n\narXiv:1204.1102v2 [cond-mat.quant-gas] 6 Apr 2012\n\n2\n\n1\nCollege of Optical Sciences, University of Arizona, Tucson, AZ 85721, USA\nJack Dodd Centre for Quantum Technology, Department of Physics, University of Otago, Dunedin 9016, New Zealand\n3\nMathematics Institute, University of Warwick, Coventry CV4 7AL, UK\n4\nDepartment of Mathematics and Statistics, San Diego State University, San Diego, CA 92182, USA\n5\nDepartment of Mathematics and Statistics, University of Massachusetts, Amherst, MA 01003, USA\n6\nSchool of Mathematics and Physics, University of Queensland, Qld 4072, Australia\n\nUnder suitable forcing a fluid exhibits turbulence, with characteristics strongly affected by the fluid's confining geometry. Here we study two-dimensional quantum turbulence in a highly oblate Bose-Einstein condensate\nin an annular trap. As a compressible quantum fluid, this system affords a rich phenomenology, allowing coupling between vortex and acoustic energy. Small-scale stirring generates an experimentally observed disordered\nvortex distribution that evolves into large-scale flow in the form of a persistent current. Numerical simulation of the experiment reveals additional characteristics of two-dimensional quantum turbulence: spontaneous\nclustering of same-circulation vortices, and an incompressible energy spectrum with k−5/3 dependence for low\nwavenumbers k and k−3 dependence for high k.\n\nA critical distinction between hydrodynamic turbulence in\na bulk fluid [1] and in one whose flows are restricted to two\ndimensions is that energy dissipation at small length scales\nis generally inhibited in the latter. In two-dimensional (2D)\nflows subject to small-scale forcing, energy flux is blocked\nthrough the small length scales and, instead, energy is transferred towards larger scales, comprising the inverse energy\ncascade of 2D turbulence [2, 3]. Small-scale forcing may thus\ngenerate large-scale flows, as seen for instance in dispersal of\natmospheric and oceanic particulates [4], flows of soap films\n[5, 6] and plasmas [7], and Jupiter's Great Red Spot [8, 9].\nHowever, the nature of 2D turbulence in quantum fluids is less\nclear. Progress in 2D quantum turbulence (2DQT) may offer innovative routes to understanding quantum fluid dynamics [10, 11] and aspects of the universality of 2D turbulence.\nHere we describe an experimental and numerical study of\nforced and decaying 2DQT in a dilute-gas Bose-Einstein condensate (BEC). Our primary result is the first clear evidence\nthat three key characteristics of 2D turbulence may also simultaneously appear in systems exhibiting 2DQT: (i) emergence\nof large-scale flow from small-scale forcing, seen experimentally and numerically, (ii) numerical observation of the formation of coherent vortex structures accompanying approximate\nenstrophy conservation [12], and (iii) numerical observation\nof an incompressible kinetic energy spectrum with k−5/3 dependence for low wavenumbers k and k−3 dependence for high\nk. Our observations are consistent with the notion that an inverse energy cascade can exist in this system.\nConcepts of significance for 2D turbulence and quantum\nfluids share a common origin. Analyzing point vortex motion\nin a bounded domain, Onsager proposed in 1949 that longlived vortices may develop via mergers of smaller vortices in\nturbulent flows of a 2D fluid, enabling the remaining vortices\nto move more freely and thereby maximize system entropy\n[13, 14]. He also proposed that vortices in superfluids have\nquantized circulation, and implied that turbulent 2D vortex\ndynamics might be ideally studied in superfluids. However,\n\nth!\n(a)a!\n\nform BEC!\n\n(b)!\n\n(b)b!\nc!\n(c)\n\nstir!\nt = 0!\n\n250 ms!\nbeam\nramp!\n\nhold!\n\ntime!\n\nt = 333 ms!\n\nd!\n(d)\n\ne!\n(e)\n\n5.7 μm!\n(c)!\n\n50 μm!\n\n50 μm!\n\nFIG. 1. (a) Timing sequence used to study 2DQT. (b) and (c) Experimental in situ column-density images of the BEC immediately prior\nto the stir, as viewed (b) in the plane of 2D trapping and (c) along the\nz axis. Lighter grayscale shades indicate larger column densities, as\nin subsequent experimental and numerical density data. (d) IllustraMonday, March 5, 12\ntion of stirring, the black arrow shows the trajectory of the harmonic\ntrap center relative to the larger fluid-free region created by the laser\nbarrier. (e) In situ image of the BEC 10 s after stirring; vortices are\nnot observable, necessitating an expansion stage to resolve them.\n\nexperimental demonstration of 2DQT has not been reported\nand has only recently been addressed numerically [15–19].\nTo experimentally reach the 2DQT regime, we utilize optical and magnetic confinement to create highly oblate BECs\n[20]. A harmonic potential with radial (r) and axial (z) trapping frequencies (ωr /2π, ωz /2π) = (8, 90) Hz confines BECs\nof up to ∼2×106 87 Rb atoms having radial and axial radii of\n52 μm and 5 μm respectively. For these conditions, vortex\nbending and tilting are suppressed [21], leading to 2D vortex dynamics. An annular trap is created with a 23-μm radius,\nblue-detuned Gaussian laser beam directed axially through the\ntrap center; the beam creates a barrier of height U0 ∼ 1.5μ0 ,\nwhere μ0 ∼ 8~ωz is the BEC chemical potential in the purely\nharmonic trap. Relative to the phase transition temperature\nT c ∼ 116 nK, the initial temperature is T ∼ 0.9T c .\nAt time t = 0 of each experimental run, a magnetic bias\nfield moves the center of the harmonic trap, but not the central\nbarrier, in one complete 5.7-μm-diameter circle over 333 ms.\n\n\f2\nThis motion induces small-scale forcing and nucleation of numerous vortices in a highly disordered distribution, which we\nidentify with 2DQT much as the notion of a 'vortex tangle'\nis identified with 3D quantum turbulence [10, 22, 23]. Afterwards, the BEC remains in the annular trap for a variable\nhold time th up to 50 s while the 2DQT decays. At th =1.17 s,\nthe system temperature is reduced to ∼0.6T c in order to decrease rates of thermal damping and vortex-antivortex recombination. At the end of the hold period, the central barrier is\nramped off over 250 ms, the BEC is released from the trap, and\nballistic expansion of the BEC enlarges the vortex cores such\nthat they are resolvable by absorption imaging. Figure 1 illustrates this sequence and shows images of the trapped BEC.\nTwo experimental time sequences of post-stir dynamics are\nshown in Figure 2(a) and (b), emphasizing the microscopic\nvariability of vortex distributions. Just after the stir (th = 0 ms)\na disordered vortex distribution appears. Large-scale superflow is evident after th ≈ 0.33 s and with increasing th , as indicated by the large fluid-free hole in the middle of the expanded\nBEC; this flow evolves into a persistent current by th ≈ 8.17 s.\nAn optional 3-s hold between barrier ramp-down and BEC release gives the vortices pinned by the central barrier time to\nseparate enough to determine the circulation winding number\nabout the barrier; see Supplemental Material Fig. S1 [27].\nOur experiment demonstrates that under suitable conditions\nof forcing and dissipation, a highly disordered vortex distribution can evolve into a large scale flow in an annular trap.\nHowever, measuring kinetic energy spectra and in situ vortex\ndynamics remain forefront experimental problems, motivating us to utilize numerical modeling and analysis for further\ncharacterizing 2DQT in a stirred, trapped BEC.\nBECs admit a first-principles theoretical approach that is\nnumerically tractable, enabling accurate modeling [24]. The\nphysical system consists of a large non-condensate component\nclose to thermal equilibrium and a BEC responding both to\nexternal forcing and to damping by the non-condensate component. Numerically, we focus on the dynamics of just the\nBEC. We simulate the experimental stirring procedure using\ndamped Gross-Pitaevskii theory [25]. The parameters most\nreadily measured are the total atom number N and temperature T . We have developed an efficient Hartree-Fock scheme\nfor determining the chemical potential μ(N, T ) and reservoir\ncutoff energy \u000fcut (N, T ) in Ref. [26], and adapt the same procedure to the present experiment, accounting for the shift in\nthe trap minimum caused by the central barrier. We thus find\nthe parameters needed to model the experimental system [27].\nFigure 2(c) shows simulations that correspond to experimental observations. Here too vortices become pinned to the\ncentral barrier to form a persistent current; at th =8.17 s, three\nvortices are pinned to the barrier, as indicated by the corresponding quantum phase profile (see Movie S1 [27]). Ramping off the obstacle beam in the simulation (over 250 ms as\nin the experiment) gives the column densities shown in Figure 2(d), with density distributions more readily compared to\n(a) and (b). Development of superflow at th = 8.17 s in (c)\nleads to a large region of low density in the trap center after\n\n0.0 s\n\n0.15 s\n\n0.33 s\n\n0.67 s\n\n1.17 s\n\n8.17 s\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\nFIG. 2. (a) and (b) 200-μm-square experimental column-density images acquired at the hold times th indicated above the images. Each\nBEC undergoes ballistic expansion immediately after the central barMonday, March 5, 12\nrier ramp-down in order to resolve the vortex cores. Each image is\nacquired from a separate experimental run. (c) In situ numerical data\n(96-μm-square images) for the hold times indicated. See also Movie\nS1 [27]. For each state represented in (c), ramping off the laser barrier in 250ms gives the data shown in (d).\n\nbarrier ramp-down, as seen in (a), (b), (d).\nAnalysis of our numerical simulations further characterizes\n2DQT through two distinct dynamical features of the system\nevolution, namely the development of a logarithmically bilinear kinetic energy spectrum, and the formation of tightly\nbound, long-lived clusters of vortices with the same sign of\ncirculation. To examine numerically the dependence of the\nkinetic energy on the wavenumber k at any instant in time, we\nuse the techniques of previous studies [16–19, 28] for extracting E i (k), the portion of a BEC's kinetic energy spectrum that\ncorresponds to an incompressible superfluid component, derived by extracting the divergence-free density-weighted velocity field that embeds vorticity; the curl-free part of this field\ncorresponds to sound waves and acoustic energy.\nThe spectra of Fig. 3 are obtained from various times of the\nsimulation and calculated using spatial grids of 18112 points\nseparated by ξ/4 = 0.1 μm, where the ξ is the healing length.\nEach curve shows the spectrum of a 2D slice through z = 0,\nalthough the spectra are little changed by averaging slices\nthrough the BEC. The ultraviolet (large k) E i (k) ∝ k−3 region of the spectrum is a conspicuous feature once vortices\nare present. This power law is a universal property of a quantized vortex core in a compressible 2D quantum fluid, as analyzed in Ref. [29], occurring for k > k s ≡ ξ−1 . The associated\nlength scale ∼2πξ thus serves to distinguish between scales\nwhere the system's physical characteristics are dominated by\nmotion of point-like vortices (k < k s ), and those where characteristics derive from the structure of individual vortex cores\n(k > k s ). The ultraviolet power law only plays a role in the\nenergy spectrum through its amplitude, which is proportional\nto the total vortex number [29]. The only mechanisms that can\nappreciably change the incompressible energy for k > k s are\ncreation and loss of free vortices.\n\n\f3\nkT ξ\n\n100\n\n100\n\nEi(k) ∝ k-5/3\nEi(k) (μ0N)-1\n\nkξ ξ\n\nkF ξ kS ξ\n\n10-2\n\n10-2\n10-4\n10-6\n10-1\n\n100\n\n101\n\nEi(k) ∝ k-3\n\n10-4\n\n331 ms\n208 ms\n\n128 ms\n\n10-6\n\n181 ms\n160 ms\n\n10-1\n\n100\n\nkξ\n\n101\n\nFIG. 3.\nLog-log plots of E i (k) (per atom) for times\n(128, 160, 181, 208, 331) ms over which forcing occurs, plotted\nagainst kξ with healing length ξ = 0.42 μm. Vertical dashed lines\nindicate kT , kF , k s , and kξ , defined in the text. Red and blue lines inMonday, March 5, 12\ndicate E i (k) ∝ k−5/3 and k−3 , respectively. A spectral peak at 181 ms\nappears at kF ≈ 2π/(11ξ). Inset: log-log plot of E i (k) vs. kξ (labels\nomitted) over the same domain as the main plot. From top to bottom,\ncurves show E i (k) ∝ k−5/3 and k−3 (solid lines), and E i (k) at 331ms,\nafter 14 s of free decay, and for a charge-3 persistent current.\n\nAs stirring injects kinetic energy into the system a Kolmogorov k−5/3 power-law spectrum develops in the k < k s region, and is determined by the vortex configuration [29]. This\nspectrum spans a decade in k-space and is established by the\nend of the stir (∼331 ms) which is also when total incompressible kinetic energy is maximal. Logarithmically bilinear spectra are also obtained after ramping off the central barrier (not\nshown). Post stir, Fig. 3 (inset) indicates a slow loss of energy\nwith approximate preservation of the Kolmogorov power law.\nEventually the system spectrally condenses via generation of\na metastable persistent current with three units of circulation.\nThree additional wavenumbers are indicated in Fig. 3. The\ncross-sectional radial thickness of the BEC approximately\ncorresponds to the length scale 25 μm = 2π/kT . At high\nwavenumbers, kξ = 2π/ξ corresponds to the scale of the healing length ξ = 0.42 μm, the approximate size of the smallest\nfeatures (e.g. vortex cores) supported by a BEC. Finally, a\nwavenumber kF is associated with the peak in the incompressible spectrum at ∼ 181ms, as we now describe.\nIn the classical theory of forced 2D turbulence [3], spectrally localized forcing is related to the injection\np rates of enstrophy (η) and energy (\u000f) density as kF = η/\u000f [1]. In\nour numerical results, the forcing that precedes the full development of the logarithmically bilinear spectrum is associated with the spectral peak at 181 ms in Fig. 3. At 208 ms\nthe peak has dispersed and the spectrum is already approximately logarithmically bilinear. We estimate the location of\nkF from the numerically computed changes in total incompressible kinetic energy, ∆E i ≈ 2.9 × 10−3 μ0 * N, and enstro2\nphy, ∆Ω ≈ 0.963 × 10−3 μ0 *N/ξ\np , occurring during this 27-ms\ntime interval. We find kF ≡ ∆Ω/∆E i = 0.57ξ−1 ' 2π/(11ξ),\nshown in Fig. 3, and coinciding with the spectral peak.\nThe physical mechanism for injection of energy and vor-\n\nticity into our BECs involves coupling between pairs of\nopposite-circulation vortices and acoustic energy. In the stirring process, density waves are first generated in the BEC,\nmost prominently where the fluid density approaches zero.\nThese density waves decay to vortices (see Movie S1 [27])\nin two characteristic ways. First, a density wave can develop\ninto a localized dark soliton and then decay to a vortex dipole.\nA second injection mechanism involves the decay of a density\nwave near the central barrier into a single vortex within the\nfluid and a partner antivortex pinned by the barrier.\nEmpirically we find that the length scale ∼2π/kF coincides\nwith the separation of phase singularities created from the decay of a localized sound pulse into a vortex dipole, visible\nin Movie S1 [27]. Examining the instances of vortex dipole\ncreation from sound during the stir period, we find dipole\nlengths d in the range 6.7ξ to 11ξ, suggesting an injection\nof incompressible energy near a wavenumber k ∼ 2π/d. During the stir, there is one case of a vortex dipole annihilating\nirreversibly to sound at t = 0.23 s, where the dipole length\nis d ∼ 6.7ξ. Two transient events during the nominal constant enstrophy period discussed below correspond to dipole\nannihilation at ∼ 6.7ξ and ∼ 8.9ξ. Furthermore, the superfluid density modulations preceding vortex nucleation at the\n181-ms spectral peak have a length scale of approximately\n11ξ ' 2π/kF ; see Fig. S2 [27]. Taken together, these observations indicate that forcing involves efficient energy and enstrophy transfer from the compressible to the incompressible\nfluid components for wavenumbers kF . k . k s .\nThe conservation of enstrophy in 2D turbulence corresponds to conservation of vortex number in 2DQT [17, 29].\nBetween ∼300 ms and ∼600 ms after the stir begins, the\ntotal vortex number is nominally constant in our simulation. When vortex-antivortex annihilation occurs, the resulting sound pulses are quickly (within ∼20 ms) refocused by\nthe inhomogeneous density, regenerating the vortices. We\nthus identify this 300-ms period of nominally constant vortex\nnumber with enstrophy conservation. During this period, we\nnumerically observe four instances of the formation of twovortex clusters (same-sign vortices). Fig. 4 shows three twovortex clusters and a vortex dipole (opposite-sign vortices)\npresent 30 ms after the end of stir. This dipole exists for 20\nms, while the longest-lived of the two-vortex clusters exists\nfor 630 ms. The vortices of this cluster orbit each other 15\ntimes, travel together halfway around the BEC, and eventually dissociate upon colliding with a vortex dipole; see Movie\nS1 [27] and Fig. 4. We see in Fig. 2(a) and (b) that there are\nlarge regions free of vortices, and regions where many vortices\nare densely packed, which is indicative of clustering, but we\nare not able to measure the vortex circulation directions to directly confirm this. Clustering was, however, experimentally\nobserved in Ref. [20] in the form of dipolar clusters reproducibly generated by a moving obstacle. In the present case\nof circular forcing, numerically we observe long-lived clusters emerging intermittently within otherwise irregular flows,\nin a manner suggestive of Onsager's statistical hydrodynamics\nresult [13].\n\n\f4\n\nth = 30 ms\n\nth = 160 ms\n\nth = 648 ms\n\nFIG. 4. Numerically obtained BEC column density shown for three\nhold times. In each 96-μm-square image, symbols indicate clusters\nof same-sign vortices, either co-rotating (red), or counter rotating\n(blue) with the stir. Each shape represents the same cluster at different times. Vortex dipoles and their propagation directions are indicated by green arrows. At th = 648 ms, one cluster remains after\nhaving traveled clockwise halfway around the BEC. See Fig. S3 [27].\nMonday, March 5, 12\n\nOver the tens of seconds after stirring stops, free vortices\ndecay either by being pinned to the obstacle beam, damping\nat the outer BEC boundary, or annihilating with free or pinned\nvortices of opposite sign. This results in the formation of a\npersistent current, reflecting the net angular momentum imparted by the stirring. The development of this superflow represents the growth of large-scale flow originating from smallscale forcing in an annular geometry, and serves as a check\nof our numerical procedures and interpretations. The mean\nnumber of vortices (pinned and free) for th = 23 s is 3.5 in\nthe experiment, and 5 in the simulation. For th = 43 s, these\nvalues decline to 2.5 and 3 respectively.\nPrevious investigations of 2DQT have centered on numerically obtaining kinetic energy spectra, but these have been inconclusive regarding the possibility of an inverse energy cascade in 2DQT, conservation of enstrophy, and correspondence\nbetween spectra and vortex dynamics. In our study, simulation of the experimentally realized forcing shows the development of an inertial range. Additionally, small-scale forcing within the trap enables the clustering of vortices; as clustering suppresses vortex-antivortex annihilation, it provides a\nmechanism to enable enstrophy conservation in a compressible superfluid. Regarding the possibility of a compressible\nsuperfluid supporting an inverse energy cascade, energy flux\ncalculations provide the most direct route to analyzing cascades, although such an approach for a trapped BEC with an\ninhomogeneous density distribution is an open problem [30].\nHowever, the following observations are consistent with the\nexistence of an inverse energy cascade in our system near the\nend of the stir: (i) vortex dipole recombination is suppressed\nand thus there is little dissipation over a forcing range kF to k s ;\n(ii) E i (k) ∝ k−3 for k > k s , a range that cannot support incompressible energy flux [29]; (iii) enstrophy is nominally conserved, and kinetic energy spectral developments occur primarily for k < k s ; and (iv) E i (k) ∝ k−5/3 for k < k s , a signature\nof conserved energy transfer across the associated scales.\nOur observations indicate that characteristics of forced and\ndecaying 2DQT in compressible quantum fluids may be analogous to those of 2D turbulence in incompressible classical\nfluids. In particular, growth of large-scale flow, aggregation\nof vorticity, nominal enstrophy conservation, and an energy\n\nspectrum with k−5/3 and k−3 spectral features occur with suitable forcing. The vortex clusters are suggestive of Onsager's\npredictions, indicating a new link between Onsager's analysis\nof 2D point-vortex dynamics [13] and the theory of 2D turbulence initiated by Kraichnan, Leith, and Batchelor [2]. Our\nobservations motivate further investigations of 2DQT, with\nfuture work focusing on energy fluxes, the roles of dissipation and boundary conditions, and direct experimental observations of turbulent vortex dynamics of a 2D quantum fluid.\nWe thank Colm Connaughton and Sergey Nazarenko for\nuseful discussions, and the US National Science Foundation\ngrants PHY-0855677 and DMS-0806762, the US Army\nResearch Office, The Marsden Fund, The Royal Society\nof New Zealand, and The New Zealand Foundation for\nResearch, Science, and Technology contracts UOOX0801\nand NERF-UOOX0703 for funding.\nReferences follow Supplemental Material.\n\n\f5\n\nSupplemental Material: Characteristics of Two-Dimensional Quantum Turbulence in a\nCompressible Superfluid\nT. W. Neely1 , A. S. Bradley2 , E. C. Samson1 , S. J. Rooney2 , E. M. Wright1 , K. J. H. Law3 ,\nR. Carretero-González4 , P. G. Kevrekidis5 , M. J. Davis6 , B. P. Anderson1\n2\n\n1\nCollege of Optical Sciences, University of Arizona, Tucson, AZ 85721, USA\nJack Dodd Centre for Quantum Technology, Department of Physics, University of Otago, Dunedin 9016, New Zealand\n3\nMathematics Institute, University of Warwick, Coventry CV4 7AL, UK\n4\nDepartment of Mathematics and Statistics, San Diego State University, San Diego, CA 92182, USA\n5\nDepartment of Mathematics and Statistics, University of Massachusetts, Amherst, MA 01003, USA\n6\nSchool of Mathematics and Physics, University of Queensland, Qld 4072, Australia\n\nHere we provide material supplementing the main text [access information to be provided by publisher]. The\nsupplemental material consists of additional description of numerical methods, three figures, and one movie.\n\nTheoretical background. The damped GPE theory used\nin our simulations can be derived rigorously for the dilutegas BEC through a detailed treatment of reservoir interactions within the Wigner phase-space representation [31],\nby neglecting thermal noise. An approximate and practical\nstochastic Gross-Piteavskii theory can be obtained [32] by: (i)\nneglecting the particle-conserving reservoir interaction processes (scattering terms) that are known to be small in the\nquasi-equilibrium regime; and (ii) neglecting the weak spatial and time dependence of the damping parameter. This allows the damping parameter to be calculated a priori, once\nthe reservoir parameters are known. The resulting stochastic Gross-Pitaevskii equation (SGPE) has been used to study\nspontaneous vortex formation [33] during Bose condensation, and vortex dynamics [21, 26] at high temperature. The\nSPGPE is derived by treating all atoms above an appropriately chosen energy cutoff \u000fcut as thermalized (incoherent region) with temperature T and chemical potential μ, leading\nto a grand-canonical description of the atoms below \u000fcut (coherent region). A dimensionless rate γ ≡ γ(T, μ, \u000fcut ) describes Bose-enhanced collisions between thermal reservoir\natoms and atoms in the BEC.\nHowever, it is not known how to extract a well-defined\ncondensate orbital from the SGPE trajectories in hightemperature systems containing vortices. To extract physical\ninformation about the condensate dynamics we nelgelct the\nthermal noise to obtain the damped Gross-Piteavskii equation\nof motion. We thus arrive at a tractable, microscopically determined equation for the condensate orbital, with a priori determined reservoir parameters. After a trivial shift of energy\nby the chemical potential μ we obtain the equation of motion\nfor the wavefunction ψ(r, t)\ni~\n\n∂ψ(r, t)\n= (iγ − 1)(μ − L)ψ(r, t),\n∂t\n\n(1)\n\nwhere the operator L\nLψ(r, t) ≡ −\n\n!\n~2 2\n∇ + V(r) + g|ψ(r, t)|2 ψ(r, t),\n2m\n\n4π~2 a/m, for s-wave scattering length a. In most cases the\ndamping parameter is small (γ \u001c 1), and is typically much\nsmaller than any other timescales characterizing the evolution.\nIn applying our approach to modeling the experiment of the\nmain text, we find the self-consistent parameters μ = 34~ω̄,\n\u000fcut = 83~ω̄, for geometric mean ω̄ = (ω2r ωz )1/3 , to describe a system of N = 2.6 × 106 atoms held at temperature\nT = 0.9T c in the combined trap, giving the damping parameter γ = 7.96 × 10−4 . The potential is characterized by halfwidth σ0 = 16.3 μm, and p\nis well contained within the coherent region: σ0 \u001c Rcut = 2\u000fcut /mω2r = 73 μm, which is the\nspatial cutoff imposed by \u000fcut . It thus has no other significant\neffect on the incoherent region. These parameters give an initial state containing ∼ 6 × 105 coherent region atoms, with the\nremainder in the incoherent region.\nThere are some technical limitations of this approach.\nFirst, the number of atoms in the simulations is approximately constant due to the fixed chemical potential of the\nthermal reservoir, while the BEC number in the experiment\nfirst grows as T/T c is reduced to ∼ 0.6, then decays with a\n1/e lifetime of 24(3) s. A related issue is the slow spatial\ndrift of the barrier beam of the experiment, which can\ndecrease the number of vortices that can be stably pinned\nto the barrier, providing a loss mechanism for the persistent\ncurrent at long times; this latter aspect of our work will be\ndiscussed in a separate publication. However, our procedure\nis suitable for simulating the BEC conditions early in the\nstir and hold process, and we do not expect detailed modeling of the evaporative cooling stage to alter our main results.\nMovie S1: Dynamics of a forced, damped BEC. A movie\nof the damped Gross-Pitaevskii equation dynamics may be\nviewed online at [URL to be provided by Physical Review].\nThe movie shows the column density and phase profile in the\nz = 0 plane generated for a simulation of damped GrossPitaevskii equation for the experimental parameters. A number of events are visible, notably:\n\n(2)\n\nis the generator of GPE evolution for atoms of mass m in\nan external potential V(r). The interaction parameter is g =\n\ni) t = 140 ms: The first evidence of a boundary vortex appears at the inside boundary of the BEC. This is most\napparent in the phase profile.\n\n\f11⇠\n11⇠\nii) t = 160 ms: A prominent density modulation feature de-\n\n6\nOD0 = on−resonance OD 2009−07−08/bec72\n−100\n\n−80\n\nvi) t = 230 ms: Vortex dipole annihilation.\nvii) t = 260 ms: Two long-lived vortex aggregates have\nformed (∼3 o'clock and 4 o'clock positions).\nviii) t = 390 − 410 ms: A vortex approaches the inner BEC\nboundary (∼4 o'clock position) and is captured by the\ncentral barrier, increasing the circulation pinned to the\nbarrier by one unit. In the process, a sound pulse is released into the BEC.\nix) t = 420−450 ms: A vortex dipole forms as two vortices of\nopposite circulation approach each other (∼ 7 o'clock position), then undergoes self-annihilation followed by revival at the outer BEC boundary.\nx) t = 480 − 520 ms: A vortex dipole forms (∼ 3 o'clock position), then undergoes self-annihilation followed by revival at the outer BEC boundary.\nxi) t = 590 − 640 ms: A vortex dipole forms (∼ 8 o'clock position), then undergoes self-annihilation followed by revival at the outer BEC boundary.\nxii) t = 600 ms: Thermalization of the sound field across the\nwhole system has occurred by this time.\nxiii) t = 790 ms: Vortex dipole annihilation.\nxiv) t = 1000 ms: A two-vortex cluster, a dipole, and a free\nvortex collide. Vortex exchange occurs; the collision results in the same vortex structures emerging.\n\n−80\n\n−80\n\n−40\n\n−40\n\n−20\n\n−20\n\n−20\n\n0\n\nvertical scale [μ m]\n\n−60\n\n−40\n\n0\n\n20\n\n20\n\n40\n\n40\n\n40\n\n60\n\n60\n\n100\n−100\n\nth = 20 s\n−80\n\n−60\n\n60\n\n80\n\n−40\n\n−20\n0\n20\n40\nhorizontal scale [μ m]\nOD0 = on−resonance OD 2009−07−08/bec83\n\n60\n\n80\n\n100\n100 −100\n\nramp + 3 s\n−80\n\n−60\n\n80\n\n−40\n\n−20\n0\n20\n40\nhorizontal scale [μ m]\nOD0 = on−resonance OD 2009−07−08/bec85\n\n60\n\n100\n100 −100\n\n80\n\n−100\n\n−100\n\n(d)\n\n−80\n\n(e)\n\n−80\n\n−60\n\n−40\n\n−40\n\n−20\n\n−20\n\n−20\n\nvertical scale [μ m]\n\n−60\n\n−40\n\n0\n\n20\n\n20\n\n40\n\n40\n\n40\n\n80\n\n60\n\n100\n−100\n\nth = 30 s\n−80\n\n−60\n\n−40\n\n−20\n0\n20\nhorizontal scale [μ m]\n\n60\n\n80\n\n−60\n\n−40\n\n−20\n0\n20\n40\nhorizontal scale [μ m]\nOD0 = on−resonance OD 2009−07−08/bec87\n\n60\n\n80\n\n100\n\n60\n\n80\n\n100\n\n60\n\n80\n\n40\n\n−80\n\n(f)\n\n0\n\n20\n\n60\n\nramp + 3 s\n\n−100\n\n−60\n\n0\n\n(c)\n\n0\n\n20\n\n80\n\nvertical scale [μ m]\n\n−100\n\n(b)\n\n−60\n\n−80\n\nv) t = 220 ms: Many vortices are now found in the bulk\nsuperfluid.\n\n−100\n\n(a)\n\nvertical scale [μ m]\n\niv) t = 190 − 210 ms: The first vortices injected into the BEC\nvia sound decay are visible.\n\nOD0 = on−resonance OD 2009−07−08/bec75\n\n−60\n\nvertical scale [μ m]\n\nvertical scale [μ m]\n\nvelops.\niii) t = 166 ms: This time is half-way through stir sequence.\n\nOD0 = on−resonance OD 2009−07−08/bec82\n\n100\n100 −100\n\nramp + 3 s\n−80\n\n−60\n\n−40\n\n−20\n0\n20\nhorizontal scale [μ m]\n\n80\n\n40\n\n60\n\n80\n\n100\n100 −100\n\nramp + 3 s\n−80\n\n−60\n\n−40\n\n−20\n0\n20\nhorizontal scale [μ m]\n\n40\n\nFigure S1. Vortices observed in experimental data. Here, BECs\nare held in the annular trap for 20 s prior to the central barrier ramp\ndown, trap release, expansion, and imaging. In (a) the expansion and\nimaging procedure takes place immediately after the barrier ramp.\nThe dark region in the center of the BEC corresponds to multiple\nunits of circulation, and is not due to the presence of the barrier itself;\ni.e., with no circulation about the barrier, a hole would not appear in\nthe BEC after ballistic expansion. In (b) and (c), BECs are held for\nan additional 3 s in the trap before the expansion imaging procedure.\nThis additional hold time allows the vortices that comprise the region\nof vorticity shown in (a) to dissociate and become experimentally\nobservable. (d)-(f) show similar images for th = 30 s.\n\ntimes where the number of free vortices has dropped to much\nless than one per image (on average), the observed vortices\ncan be attributed to current pinned at the barrier, particularly\nif they appear clustered about the position of the barrier as\nshown in Fig. S1. We note that observations of such regular\nstructures of vortices, as shown, do not always occur after\nbeam ramp down, and the vortex distribution is often more\nirregular. As stated in the main text, the mean number of\nvortices experimentally observed at th = 23 s is 3.5. If instead\nwe remove the central barrier at the beginning of the hold\nperiod, and let the system evolve in a purely harmonic trap\nfor 23 s, the mean numbers of vortices observed becomes 1.2.\nThe fluid circulation is thus maintained at significantly higher\n\nxv) t = 1.980 s: A vortex collision results in a vortex\nbeing slightly tilted with respect to the z axis (∼ 4\no'clock position), showing that this system is not strictly\ntwo-dimensional. Note that this vortex returns to an\norientation along the z axis within about 50 ms.\n\nExperimental winding number determination. Multiquantum vortices are energetically unstable, thus loose\nclustering is favorable to perfect co-location of multiple\nvortices. We make use of this energetic instability in order\nto determine the size of the persistent current formed and\nits subsequent time evolution in the experiment, as shown in\nFigure S1. By enabling extra hold time between beam ramp\ndown and expansion, we can count the total number of free\nand pinned vortices for any hold time. For long-enough hold\n\n11ξ\n\nFigure S2. Numerically obtained column density 181 ms after stirring begins. The bar indicates the scale of forcing calculated from\nthe energy and enstrophy injected during the stir (see main text). 40μm-square field of view.\n\n\f7\nramp + 0 ms\n\nramp + 0.23 s\n\nramp + 1.23 s\n\n[3]\n\nth = 0 ms\n\nth = 0 ms\n\nth = 0 ms\n\nFigure S3. Vortex clusters seen for a main sequence hold time\nof th = 0 ms, followed by the 250-ms barrier ramp-down, and an\nadditional hold time of 0 ms, 230 ms, and 1.23 s in the harmonic\ntrap (96-μm-square images). In the left-most image, five two-vortex\nclusters are seen. Only two or three of these clusters existed at th = 0\nms prior to the beam ramp (red circle, blue triangle and square of\nFig. 4 of the main text), while the remainder formed from vortices\nMonday, March 5, 12\nthat were pinned to the beam and then released into the quantum\nfluid. By 230 ms after the laser barrier has been ramped completely\noff, one of the two-vortex clusters has acquired a third vortex (red\ncircle of middle image), and these three vortices orbit each other.\nThis structure eventually grows to form a loose five-vortex cluster\nshown 1.23 s after the barrier ramp. This cluster persists for about\n200 ms. The remaining clusters have dissociated by this time, but\nthree new two-vortex clusters have formed (rectangles).\n\nlevels in the annular trap, justifying a description of this state\nas a persistent current.\nDensity modulations during forcing. Figure S2 shows the\nstir-induced density modulations observed in the numerical\nsimulations. These density modulations decay to vortices.\nAs density modulations at a wavenumber k correspond to\ncompressible energy at that wavenumber, we expect an influx\nof energy into the incompressible regime at a wavenumber\nthat corresponds to these modulations, as discussed in the\nmain text.\nVortex clusters and dynamics. In Fig. 3 of the main text\nwe show images from our simulation that contain vortex clusters that occur after the completion of the stir in the annular\ntrap. Alternatively, we may examine the distribution of vortex\nclusters in the gas after the ramp down of the stirring potential\nto determine whether such clusters might occur in the experimental system subsequent to beam ramp down. Clusters do\nindeed appear in such numerical data, as Fig. S3 shows, and\nare not limited to just two vortices per cluster.\n\n[4]\n[5]\n[6]\n[7]\n[8]\n[9]\n[10]\n\n[11]\n[12]\n\n[13]\n[14]\n[15]\n[16]\n[17]\n[18]\n[19]\n[20]\n[21]\n[22]\n[23]\n[24]\n[25]\n[26]\n[27]\n[28]\n[29]\n[30]\n\nR. Kraichnan and D. Montgomery, Rep. Prog. Phys. 43, 547\n(1980).\nJ. Sommeria, Les Houches Summer School 2001: New Trends\nin Turbulence 74, 385 (2001); P. Tabeling, Phys. Rep. 362, 1\n(2002); G. Boffetta and R. E. Ecke, Ann. Rev. Fluid Mech. 44,\n427 (2012).\nW. Kramer, H. Clercx, and G. van Heijst, Phys. Fluids 20,\n056602 (2008).\nB. Martin et al., Phys. Rev. Lett. 80, 3964 (1998).\nM. Rivera et al., Phys. Rev. Lett. 90, 104502 (2003).\nM. Shats, H. Xia, and H. Punzmann, Phys. Rev. E 71, 046409\n(2005).\nJ. Sommeria, S. D. Meyers, and H. L. Swinney, Nature 331, 689\n(1988).\nJ. Miller, B. Weichman, and M. C. Cross, Phys. Rev. A 45, 2328\n(1992).\nC. F. Barenghi, R. J. Donnelly, and W. F. Vinen, eds., Quantized\nvortex dynamics and superfluid turbulence (Springer, Berlin,\nNew York, 2001).\nW. F. Vinen and J. J. Niemela, J. Low Temp. Phys. 128, 167\n(2002).\nR\nIn two-dimensions, enstrophy Ω = dx dy ω2 is a measure of\nthe vorticity ω = [∇ × v]z about the z axis, where v is the fluid\nvelocity in the plane normal to z.\nL. Onsager, Il Nuovo Cimento 6 suppl 2, 279 (1949).\nG. Eyink and K. Sreenivasan, Rev. Mod. Phys. 78, 87 (2006).\nS. Nazarenko and M. Onorato, J. Low Temp. Phys. 146, 31\n(2006);\nT.-L. Horng et al., Phys. Rev. A 80, 023618 (2009).\nR. Numasato and M. Tsubota, J. Low Temp. Phys. 158, 415\n(2010).\nR. Numasato, M. Tsubota, and V. L'vov, Phys. Rev. A 81,\n063630 (2010).\nB. Nowak, J. Schole, D. Sexty, T. Gasenzer, arXiv:1111.6127\n(2011).\nT. W. Neely et al., Phys. Rev. Lett. 104, 160401 (2010).\nS. J. Rooney et al., Phys. Rev. A 84, (2011).\nC. Raman et al., Phys. Rev. Lett. 87, 210402 (2001).\nE. Henn et al., Phys. Rev. Lett. 103, 045301 (2009).\nP. B. Blakie et al., Adv. in Phys. 57, 363 (2008).\nL. P. Pitaevskii, Zh. Eksp. Teor. Fiz. 35, 408 (1958).\nS. J. Rooney, A. S. Bradley, and P. B. Blakie, Phys. Rev. A 81,\n023630 (2010).\nSee Supplemental Material at [URL will be inserted by publisher] for additional information.\nC. Nore, M. Abid, and M. E. Brachet, Phys. Fluids 9, 2644\n(1997).\nA. S. Bradley and B. P. Anderson, arXiv:1204.1103 (2012).\nSee Ref. [18] for one approach to calculating energy flux in a\nhomogeneous BEC evolving under decaying 2DQT.\n\nSupplemental Material References\n[1] M. Lesieur, Turbulence in Fluids (Kluwer Academic Publishers, Netherlands, 4th ed., 1990).\n[2] R. Kraichnan, Phys. Fluids 10, 1417 (1967); C. Leith, Phys.\nFluids 11, 671 (1968); G. Batchelor, Phys. Fluids 12, II (1969);\n\n[31] C. W. Gardiner and M. J. Davis, J Phys B 36, 4731 (2003).\n[32] A. S. Bradley, C. W. Gardiner, and M. J. Davis, Phys. Rev. A\n77, 033616 (2008).\n[33] C. N. Weiler et al., Nature 455, 948 (2008).\n\n\f"}