{"id": "http://arxiv.org/abs/0803.1484v1", "guidislink": true, "updated": "2008-03-10T20:00:08Z", "updated_parsed": [2008, 3, 10, 20, 0, 8, 0, 70, 0], "published": "2008-03-10T20:00:08Z", "published_parsed": [2008, 3, 10, 20, 0, 8, 0, 70, 0], "title": "Strong Near-Infrared Emission Interior to the Dust-Sublimation Radius of\n  Young Stellar Objects MWC275 and AB Aur", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0803.3474%2C0803.3278%2C0803.1662%2C0803.4149%2C0803.1899%2C0803.1935%2C0803.0646%2C0803.3754%2C0803.0389%2C0803.2947%2C0803.2453%2C0803.3779%2C0803.4437%2C0803.1168%2C0803.3147%2C0803.2176%2C0803.0356%2C0803.3065%2C0803.1946%2C0803.3189%2C0803.1636%2C0803.1484%2C0803.0738%2C0803.0387%2C0803.4164%2C0803.0040%2C0803.4201%2C0803.0283%2C0803.2150%2C0803.1641%2C0803.1519%2C0803.1991%2C0803.3317%2C0803.2627%2C0803.3269%2C0803.0757%2C0803.3912%2C0803.3937%2C0803.1545%2C0803.0097%2C0803.4265%2C0803.3930%2C0803.4482%2C0803.0527%2C0803.3722%2C0803.1593%2C0803.0876%2C0803.1391%2C0803.3445%2C0803.1340%2C0803.1039%2C0803.0459%2C0803.1337%2C0803.0371%2C0803.3078%2C0803.3222%2C0803.1625%2C0803.1329%2C0803.0874%2C0803.0651%2C0803.0660%2C0803.0794%2C0803.0633%2C0803.4121%2C0803.3997%2C0803.0997%2C0803.2361%2C0803.3275%2C0803.0181%2C0803.4024%2C0803.2347%2C0803.3816%2C0803.2021%2C0803.2078%2C0803.0227%2C0803.1286%2C0803.4094%2C0803.3907%2C0803.0812%2C0803.0238%2C0803.1558%2C0803.0975%2C0803.2909%2C0803.1025%2C0803.0309%2C0803.1970%2C0803.3334%2C0803.2992%2C0803.1010%2C0803.1013%2C0803.1256%2C0803.2555%2C0803.1368%2C0803.2320%2C0803.4157%2C0803.3091%2C0803.3172%2C0803.1676%2C0803.4388%2C0803.1711%2C0803.2670&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Strong Near-Infrared Emission Interior to the Dust-Sublimation Radius of\n  Young Stellar Objects MWC275 and AB Aur"}, "summary": "Using the longest optical-interferometeric baselines currently available, we\nhave detected strong near-infrared (NIR) emission from inside the\ndust-destruction radius of Herbig Ae stars MWC275 and AB Aur. Our\nsub-milli-arcsecond resolution observations unambiguously place the emission\nbetween the dust-destruction radius and the magnetospheric co-rotation radius.\nWe argue that this new component corresponds to hot gas inside the\ndust-sublimation radius, confirming recent claims based on spectrally-resolved\ninterferometry and dust evaporation front modeling.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0803.3474%2C0803.3278%2C0803.1662%2C0803.4149%2C0803.1899%2C0803.1935%2C0803.0646%2C0803.3754%2C0803.0389%2C0803.2947%2C0803.2453%2C0803.3779%2C0803.4437%2C0803.1168%2C0803.3147%2C0803.2176%2C0803.0356%2C0803.3065%2C0803.1946%2C0803.3189%2C0803.1636%2C0803.1484%2C0803.0738%2C0803.0387%2C0803.4164%2C0803.0040%2C0803.4201%2C0803.0283%2C0803.2150%2C0803.1641%2C0803.1519%2C0803.1991%2C0803.3317%2C0803.2627%2C0803.3269%2C0803.0757%2C0803.3912%2C0803.3937%2C0803.1545%2C0803.0097%2C0803.4265%2C0803.3930%2C0803.4482%2C0803.0527%2C0803.3722%2C0803.1593%2C0803.0876%2C0803.1391%2C0803.3445%2C0803.1340%2C0803.1039%2C0803.0459%2C0803.1337%2C0803.0371%2C0803.3078%2C0803.3222%2C0803.1625%2C0803.1329%2C0803.0874%2C0803.0651%2C0803.0660%2C0803.0794%2C0803.0633%2C0803.4121%2C0803.3997%2C0803.0997%2C0803.2361%2C0803.3275%2C0803.0181%2C0803.4024%2C0803.2347%2C0803.3816%2C0803.2021%2C0803.2078%2C0803.0227%2C0803.1286%2C0803.4094%2C0803.3907%2C0803.0812%2C0803.0238%2C0803.1558%2C0803.0975%2C0803.2909%2C0803.1025%2C0803.0309%2C0803.1970%2C0803.3334%2C0803.2992%2C0803.1010%2C0803.1013%2C0803.1256%2C0803.2555%2C0803.1368%2C0803.2320%2C0803.4157%2C0803.3091%2C0803.3172%2C0803.1676%2C0803.4388%2C0803.1711%2C0803.2670&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Using the longest optical-interferometeric baselines currently available, we\nhave detected strong near-infrared (NIR) emission from inside the\ndust-destruction radius of Herbig Ae stars MWC275 and AB Aur. Our\nsub-milli-arcsecond resolution observations unambiguously place the emission\nbetween the dust-destruction radius and the magnetospheric co-rotation radius.\nWe argue that this new component corresponds to hot gas inside the\ndust-sublimation radius, confirming recent claims based on spectrally-resolved\ninterferometry and dust evaporation front modeling."}, "authors": ["A. Tannirkulam", "J. D. Monnier", "R. Millan-Gabet", "T. J. Harries", "E. Pedretti", "T. A. ten Brummelaar", "H. McAlister", "N. Turner", "J. Sturmann", "L. Sturmann"], "author_detail": {"name": "L. Sturmann"}, "author": "L. Sturmann", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1086/587873", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0803.1484v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0803.1484v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "12 pages, 4 figures, Accepted for publication in ApJL", "arxiv_primary_category": {"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0803.1484v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0803.1484v1", "journal_reference": null, "doi": "10.1086/587873", "fulltext": "Strong Near-Infrared Emission Interior to the Dust-Sublimation\nRadius of Young Stellar Objects MWC275 and AB Aur.\n\narXiv:0803.1484v1 [astro-ph] 10 Mar 2008\n\nA. Tannirkulam1 , J. D. Monnier1 , R. Millan-Gabet2 , T. J. Harries3 , E. Pedretti4 , T. A. ten\nBrummelaar5 , H. McAlister5 , N. Turner5 , J. Sturmann5 , L. Sturmann5\nABSTRACT\nUsing the longest optical-interferometeric baselines currently available, we have\ndetected strong near-infrared (NIR) emission from inside the dust-destruction\nradius of Herbig Ae stars MWC275 and AB Aur. Our sub-milli-arcsecond resolution observations unambiguously place the emission between the dust-destruction\nradius and the magnetospheric co-rotation radius. We argue that this new component corresponds to hot gas inside the dust-sublimation radius, confirming\nrecent claims based on spectrally-resolved interferometry and dust evaporation\nfront modeling.\nSubject headings: young stellar objects - circumstellar disks - radiative transfer\n- dust sublimation - interferometry\n\n1.\n\nIntroduction\n\nThe inner tenths of an AU in disks around young stellar objects (YSOs) hosts fascinating\nastrophysical phenomena like disk winds, jets, dust sublimation/condensation and thermal\nannealing, and gas in-fall onto the star. To make spatially resolved observations of these\nphenomena, milli-arcsecond angular resolution is needed even for nearest the systems. Using\nthe sub-milli-arcsecond resolution capabilities of the CHARA (ten Brummelaar et al. 2005)\ninterferometer array (operated by Georgia State University on Mt.Wilson), we probed inner\n1\n\natannirk@umich.edu: University of Michigan, Astronomy Dept, 500 Church Street, 1017 Dennison Bldg,\nAnn Arbor, MI 48109-1042\n2\n\nMichelson Science Center, Pasadena, CA\n\n3\n\nUniversity of Exeter, School of Physics, Stocker Road, Exeter, EX4 4QL\n\n4\n\nUniversity of St. Andrews, Scotland, UK\n\n5\n\nCHARA, Georgia State University, Atlanta, GA\n\n\f–2–\ndisks of the YSOs MWC275 and AB Aur at 0.1AU scales and found NIR emission within\nthe dust destruction radius in these systems.\nMWC275 (A1e, d=122pc, V=6.86, K=4.59, M∗ =2.3M⊙ ) and AB Aur (A0pe, d=144pc,\nV=7.01, K=4.37, M∗ =2.4M⊙ ) are Herbig Ae stars - pre-main-sequence stars of intermediate\nmass. This class of stars shows a significant excess of near-infrared (NIR) flux (Natta et al.\n2001) over the stellar photospheric emission. Current theories (Dullemond et al. 2001;\nIsella & Natta 2005; Tannirkulam et al. 2007) explain this excess solely on the basis of a\n\"puffed up inner dust rim\". In these \"rim\" theories, dust sublimation terminates the circumstellar dust disk at a finite radius (the truncation radius depends on the luminosity of\nthe central star and dust properties) creating an optically-thin cavity (Millan-Gabet et al.\n1999; Tuthill et al. 2001; Eisner et al. 2004) around the star. The outer edge of the cavity\nforms a dusty rim that traps stellar photons, re-radiating the energy mostly in the NIR.\nThe rim idea seems to broadly explain much of the correlation between the NIR sizes and\nluminosities of the stars observed in a number of YSO systems (Monnier & Millan-Gabet\n2002; Monnier et al. 2005; Millan-Gabet et al. 2007).\nHowever, recent results have begun to indicate that models in which the entire NIR\nexcess arises solely from dust rims are inadequate in explaining some of the observed YSO\nproperties. Akeson et al. (2005) noted that NIR emission from the the dust rim alone was not\nsufficient to explain the spectral energy distribution (SED) of some TTauri stars. Isella et al.\n(2006) pointed out that the dust evaporation temperatures of well studied astronomical dust\ntypes (Pollack et al. 1994) were too low (producing dust rims with large inner radii) to explain the anomalously small NIR size of AB Aur. Eisner et al. (2007) and Eisner (2007)\nhad to invoke gas emission to account for the apparent decrease in NIR sizes of Herbig\nAe/Be stars with decreasing wavelength. Most recently, Kraus et al. (2007) showed that\nthe NIR visibilities of Herbig Be star MWC147 could not be explained without including\nemission from inside the dust evaporation radius. Due to the lack of sufficient spatial resolution, some of these conclusions are tentative and based on indirect arguments with multiple\ninterpretations.\n\n2.\n\nObservations\n\nTo unambiguously constrain NIR disk structure in YSOs, we began an observation campaign with the CHARA Array using the \"CHARA Classic\" beam combiner (ten Brummelaar et al.\n2005) . The targets were observed at K band (central wavelength of 2.13 microns) with the\nlong baselines of CHARA at a variety of orientations in 8 runs between June 2004 and\n\n\f–3–\nJune 2007. The longest baseline observation for MWC275 was 325m (resolution 1 of 0.67\nmilli-arcseconds) and 320m (resolution of 0.68 milli-arcseconds) for AB Aur. The data were\nreduced using standard CHARA reduction software (ten Brummelaar et al. 2005) and these\nresults were cross checked with an independent code developed at University of Michigan\n(the full calibrated OIFITS data set will be posted on OLBIN - http://olbin.jpl.nasa.gov).\nHD164031 , HD166295 (Merand et al. 2005) and HD156365 with uniform-disk (UD) diameters of 0.83± 0.08 mas, 1.274±0.018 mas and 0.44±0.06 mas were used as calibrators\nfor MWC275. AB Aur visibilities were calibrated with HD29645 (UD diameter=0.54±0.07\nmas) and HD31233 (UD diameter=0.76±0.13 mas). The visibility errors (which include\ncalibration errors, statistics and errors due to finite calibrator size) are at the ∼6% level,\ntypical for CHARA Classic. The new fringe-visibility data from CHARA were combined\nwith past measurements from IOTA (Monnier et al. 2006), PTI (Eisner et al. 2004) and the\nKeck Interferometer (Monnier et al. 2005) providing a baseline coverage from 15m-320m on\nthe targets, placing strong constraints on the geometry of the inner-most disk regions.\nThe baseline orientations used have allowed us to clearly detect the asymmetry of the\nMWC275 disk (details in a followup paper), as having inclination=48o ±2o , PA=136o±2o ,\no\no\nconsistent with the inclination of 51+11\n−9 degrees, and PA of 139 ±15 determined in Wassell et al.\n(2006). Thus, in Fig §2 the visibility of MWC275 is shown as a function of \"effective baseline\"\np\nBef f = Bprojected cos2 (θ) + cos2 (φ)sin2 (θ)\nwhere θ is the angle between the uv vector for the observation and the major axis of the disk\nand φ is the inclination of the disk. Under the flat disk assumption, the effective baseline\ncorrectly accounts for the change in resolution due to the disk inclination and PA (geometry\nof finitely thick disks is represented only approximately with optical depth effects and 3D geometry of thick disks not being taken into account), allowing us to plot the visibility\nmeasurements as a function of one coordinate, simplifying presentation and analysis. As the\nAB Aur disk is near face on (Eisner et al. 2004), we have plotted its visibility as a function\nof true projected baseline (Fig §2).\n1\n\nResolution is defined as\nlength.\n\nλ\n2D\n\n-lambda is wavelength of observation and D is the interferometer baseline\n\n\f–4–\n3.\n\nModeling\n\nTo elucidate the structure of the inner disk and the dust rim, we constructed dust-only\nrim models for MWC275 and AB Aur and fit the models to the visibility data. In these\nmodels, all of the K-band emission is assumed to come from the inner dust rim and the\ncentral star (\"standard\" model). The rim is in hydrostatic equilibrium and its shape is set\nby the pressure dependence of the dust grain evaporation temperatures (Isella & Natta 2005;\nTannirkulam et al. 2007). The normalization of the pressure dependence of the evaporation\ntemperatures (discussed in more detail in a followup paper) is adjusted so that the model\nrims fit the short baseline (< 100m) visibility data. As can be seen in Fig §1, a realistic\ntreatment of dust physics produces a curved inner rim with a sharp inner edge, set by dust\ndestruction, and a sharp outer edge, set by the fact that the rim shadows (Dullemond et al.\n2001) a portion of the disk behind it preventing direct star-light from reaching the region.\nWe are able to fit the standard model to the visibility data for MWC275 and AB Aur\nat baselines shorter than 100m (Fig §2) fairly well 2 (a result already established in multiple\nprevious studies; Monnier & Millan-Gabet (2002); Eisner et al. (2004); Isella et al. (2006) ).\nRim radii from the model fit are 0.19 AU (thickness 0.04 AU) for MWC275 and 0.21AU\n(thickness 0.05 AU) for AB Aur (see Table §1 for details). However, the standard model\nfails glaringly at fitting the long-baseline data. For baselines longer than 110m the standard\nrim predicts strong bounces in the visibility response which are not observed in the data.\nThe lack of bounce in visibility cannot be explained in the framework of the standard\nrim model. Models for NIR excess in Herbig Ae stars in which all of the excess arises in rims\nwill display bounces in visibility at long baselines because of the presence of sharp ring-like\nfeatures with high spatial frequency components in the corresponding images, even for the\nsmoothest rims physically plausible.\nThe only explanation for the absence of long-baseline visibility bounce in the data is\nthe presence of an additional smooth emission component within the dust destruction radius\nthat suppresses the large visibility bounces seen in a rim-only model (the smooth emission\ncomponent has to be on size scales similar to the dust sublimation radius and cannot arise\nfrom a compact source like magnetospheric accretion). Fig §1 shows a standard model to\nwhich NIR emission has been added within the dust evaporation radius. Our data cannot\n2\n\nThe near-IR disk size obtained from the Keck Interferometer data is ∼20% larger than the size obtained\nwith the CHARA data (June2004-Aug2006 epochs). The size determined from the S2W1 June2007 data also\ndiffers at the ∼25% level from the size obtained from earlier CHARA epochs. The size fluctuations could\nbe related to the observed variability in the infrared photometry of MWC275 (Sitko et al. 2007). Variability\ndoes not affect any of our conclusions.\n\n\f–5–\nuniquely constrain this emission profile and we assume a constant surface brightness disk (a\nuniform disk), which is a simple model. A rim + uniform disk model in which the uniform\ndisk emission (refer Table §1 for details) accounts for 40-60% of the total K-band emission\nprovides a good fit to the visibility (Fig §2) over the whole baseline range.\nBesides the interferometry, emission inside the dust evaporation radius can also help\nexplain the NIR flux budget of MWC275 and AB Aur. MWC275 and AB Aur have total\nK-band emission a factor of 10 larger than the stellar photospheric K-band emission, whereas\nthe total emission produced by standard rim models (Isella & Natta 2005) is only a factor\nof 3.5 larger (SED analysis will be presented in a followup paper) than the photospheric\nemission. The emission component inside the dust rim can supply the \"missing\" K-band\nflux in MWC275 and AB Aur. In the next section we discuss candidates for the physical\norigin of this emission.\n\n4.\n\nPhysical Interpretation\n\nWe consider 3 opacity candidates for providing the smooth K-band emission component:\na) a dusty spherical halo around the stars (Vinkovic et al. 2006), b) highly optically transparent/refractory dust extending inside the rim and c) gas inside the dust evaporation front.\nVinkovic et al. (2006) showed that halo models can fit NIR SED and some early NIR interferometry data on Herbig Ae stars. However, the detection of asymmetries in NIR emission\nof MWC275 (Section §2) and other Herbig Ae/Be stars (Eisner et al. 2004) support a disk\nmodel over the spherically symmetric halo model of Vinkovic et al. (2006). The gas densities\nin the inner disk are not high enough to let dust survive beyond 1800K (Pollack et al. 1994),\nmaking optically transparent/refractory dust an unlikely candidate for the excess K-band\nemission.\nHot gas is an excellent candidate as a NIR emission source inside the dust sublimation\nradius. Molecular gas is known to have dense NIR opacity features at kilo-kelvin temperatures (Carr et al. 2004; Ferguson et al. 2005). The required gas emission levels to explain the\nlong-baseline visibility data can be obtained with optically thin gas emission (optical depth\nτ ∼ 0.15) with a temperature range of 2500K-3500K (Muzerolle et al. 2004; Eisner 2007).\nOur claim regarding the presence of gas emission inside the dust rim is further supported\nby the detection of the Brγ line in young star HD104327 (Tatulli et al. 2007) on size scales\nsimilar to the dust destruction radius.\nThe required color excess (E(H-K)) from gas emission to match the SED in MWC275\nand AB Aur is ∼ 0.1. MWC275 and AB Aur have Brγ emission equivalent widths of\n\n\f–6–\n∼6Å (Garcia Lopez et al. 2006). The equivalent widths are in principle sufficient to explain\nthe color excess with free-free emission based on the observed correlation between color\nexcess and Brγ equivalent width for Be stars (Howells et al. 2001). Thus free-free emission\nis also a good candidate for NIR emission inside the dust evaporation front.\nAt first thought, presence of binary companions or source variability would also seem\ngood explanations for the excess K-band emission and the lack of visibility bounce at long\nbaselines. However, the presence of a binary companion within 0.5 AU of MWC275 that\ncontributes ∼50% of the total near-IR emission will cause changes of ∼0.5 in the absolute\nvisibility of the system at any given baseline over the multiple CHARA observation epochs.\nThis variation is not seen in the data (see Fig. §2). Furthermore, Monnier et al. (2006)\nobtained NIR visibility and closure-phase data on MWC275 and found no evidence for a\nbinary companion ruling out binarity as an explanation for the observations. A comparison\nbetween the Keck Interferometer and CHARA data (taken in different observation epochs)\nin Fig. §2 shows that MWC275 visibilities are time variable at the ∼20% level, suggesting\nthat variability could complicate our analysis. However, the data from the S2W1 CHARA\ntelescope pair (Fig. §2) were obtained on a single night and show a similar visibility-baseline\ntrend as the rest of the data, disfavoring variability as an explanation for the observed trends.\nThus, our conclusion on the presence of smooth gas emission inside the dust destruction\nradius is robust.\n\n5.\n\nDiscussion\n\nIn this work, we have conclusively shown the presence of strong NIR emission between\nthe magnetospheric co-rotation radius and the dust sublimation radius in Herbig Ae stars\nMWC275 and AB Aur. The underlying mechanism for this emission is not known requiring\nhigh resolution NIR spectroscopy and self-consistent modeling of the gas-dust transition\nregion to identify the gas species and the physical processes responsible for the emission.\nThe detection of continuum gas emission within the dust destruction radius through\nlong-baseline interferometry is of special importance to understanding the star-disk connection. Accretion models for YSOs have tended to focus on two separate physical scales (i)\nthe process of mass and angular momentum transport in the outer disk and (ii) gas accretion from a few stellar radii on to the stellar photosphere. Milli-meter interferometry\nand direct imaging in the mid-IR have allowed observational access to the outer disk while\nhigh-resolution optical-spectroscopy can probe the circumstellar environment around YSOs\non scales of a few stellar radii. Our near-IR interferometry results on MWC275 and AB Aur\nprovides exciting prospects for connecting the two scales and determining the structure of\n\n\f–7–\nthe gas flow from a few tenths of an AU down to the stellar surface. In the following paragraph, we describe NIR interferometry as a tool in probing accretion physics inside the dust\nrim.\nIn the regime where in the inner gas disk is optically thin, the Shakura-Sunyaev viscosity\nparameter for the gas disk can be constrained using a combination of NIR interferometry\nand optical spectroscopy. NIR interferometry in multiple wavelength bands can constrain\nthe inner gas-disk surface density and temperature profiles. The surface density of the disk\nis related to the mass accretion rate and the viscosity parameter in quasi-steady-state disks\n(Shakura & Sunyaev 1973). Thus, simultaneous measurements of mass in-fall rates (through\nmodeling of optical-emission lines and optical continuum excess above photospheric emission\n(Calvet & Gullbring 1998; Muzerolle et al. 2001) ) and the gas surface density profiles will\ndirectly constrain the viscosity parameter 'α' in the inner disk. This is key to understanding\nangular momentum transport in circumstellar disks.\nWe acknowledge contributions from Nuria Calvet, Michael Sitko, PJ Goldfinger, Christopher Farrington and Steve Golden. We also thank the anonymous referee for valuable comments and suggestions. Research at the CHARA Array is supported by the National Science\nFoundation through grants AST 06-06958 and AST 03-52723 and by the Georgia State University through the offices of the Dean of the College of the Arts and Sciences and the Vice\nPresident for Research. This project was partially supported by NASA grant 050283. This\npublication makes use of NASA's Astrophysics Data System Abstract Service. The calibrator sizes were obtained with the fBol module of getCal, a package made available by the\nMichelson Science Center, California Institute of Technology (http://msc.caltech.edu).\n\nREFERENCES\nAkeson, R. L., Walker, C. H., Wood, K., Eisner, J. A., Scire, E., Penprase, B., Ciardi, D. R.,\nvan Belle, G. T., Whitney, B. & Bjorkman, J. E. 2005a, ApJ, 622, 440\nCalvet, N. & Gullbring, E. 1998, ApJ, 509, 802\nCarr, J. S., Tokunaga, A. T. & Najita, J. 2004, ApJ, 603, 213\nDullemond, C. P., Dominik, C. & Natta, A. 2001, ApJ, 560, 957\nEisner, J. A., Lane, B. F., Hillenbrand, L. A., Akeson, R. L. & Sargent, A. I. 2004, ApJ,\n613, 1049\n\n\f–8–\nEisner, J. A. 2007, Nature, 447, 562\nEisner, J. A., Chiang, E. I., Lane, B. F. & Akeson, R. L. 2007, ApJ, 657, 347\nFerguson, J. W., Alexander, D. R., Allard, F., Barman, T., Bodnarik, J. G., Hauschildt,\nP. H., Heffener-Wong, A. & Tamanai, A. 2005, ApJ, 623, 585\nIsella, A., Testi, L. & Natta, A. 2006, A&A, 451, 951\nIsella, A. & Natta, A. 2005, A&A, 438, 899\nKraus, A., Preibisch, T. & Ohnaka, K. 2007, A&A, in press\nGarcia Lopez, R., Natta, A., Testi, L. & Habart, E. 2006, A&A, 459, 837\nHowells, Lee, Steele, I. A., Porter, J. M. & Etherton, J. 2001, A&A, 369, 99\nMerand, A., Borde, P. & Coude Du Foresto, V. 2004, A&A, 433, 1155\nMillan-Gabet, R., Schloerb, F. P., Traub, W. A., Malbet, F., Berger, J. P. & Bregman, J. D.\n1999, ApJ, 513, L131\nMillan-Gabet, R., Malbet, F., Akeson, R., Leinert, C., Monnier, J. D. & Waters, R. 2007,\nProtostars and Planets V, 539\nMonnier, J. D. & Millan-Gabet, R. 2002, ApJ, 579, 694\nMonnier, J. D., Millan-Gabet, R., Billmeier, R., Akeson, R. L., Wallace, D., Berger, J. P. &\n28 coauthors, 2005, ApJ, 624, 832\nMonnier, J. D., Berger, J. P., Millan-Gabet, R., Traub, W. A., Schloerb, F. P., Pedretti, E.\n& 10 coauthors 2006, ApJ, 647, 444\nMuzerolle, J., Calvet, N. & Hartmann, L. 2001, ApJ, 550, 944\nMuzerolle, J., D'Alessio, P., Calvet, N. & Hartmann, L. 2004, ApJ, 617, 406\nNatta, A., Prusti, T., Neri, R., Wooden, D., Grinin, V. P. & Mannings, V. 2001, A&A, 371,\n186\nPollack, J. B., Hollenbach, D., Beckwith, S., Simonelli, P. D., Roush,\nShakura, N. I. & Sunyaev, R. A. 1973, A&A, 24, 337\nSitko, S. L., Carpenter, W. J., Kimes, R. L., Wilde, J. L., Lynch, D. K., Russel, R. W. & 6\ncoauthors 2007, ApJ, submitted\n\n\f–9–\nTannirkulam, A., Harries, T. J., & Monnier, J. D. 2007, ApJ, 661, 374\nten Brummelaar, T. A., McAlister, H. A., Ridgway, Bagnuolo, W. G. Jr., Turner, N. H. &\n8 coauthors 2005, ApJ, 628, 453\nTatulli, E., Isella, A., Testi, L., Marconi, A. & 94 coauthors 2007, A&A, 464, 29\nTuthill, P. G., Monnier, J. D. & Danchi, W. C. 2001, Nature, 409, 1012\nVinkovic, D., Ivezic, Z., Jurkic, T. & Elitzur, M. 2006, ApJ, 636, 348\nWassell, E. J., Grady, C. A., Woodgate, B., Kimble, R. A. & Bruhweiler, F. C. 2006, ApJ,\n650, 985\n\nThis preprint was prepared with the AAS LATEX macros v5.2.\n\n\f– 10 –\n\nTable 1: MWC275 and AB Aur model parameters for K-band emission. The models also\ninclude extended envelopes contributing 5% of the K -band emission (Monnier et al. 2006).\nStar\nmodel\nstar\ndust-rim gas-disk\nrim\ntype\nemission emission emission inner radius\n(%)\n(%)\n(%)\n(AU)\nMWC275 dust rim only\n25\n69\n0.19\ndust rim+gas\n10\n29\n56\n0.22\nAB Aur dust rim only\n22\n73\n0.21\ndust rim+gas\n12\n45\n38\n0.25\n\n\f– 11 –\n\n0.27\n\n0.25\n\n'Standard' inner-rim model (K band image)\n\n'Standard' inner-rim + gas model (K band image)\n0.6\n\n0.4\n\n0.21\n(Surface Brightness (erg/s/cm^2) )^0.1\n\n(Surface Brightness (erg/s/cm^2) )^0.1\n\n0.23\n\n0.2\n0.19\n\n0.0\n0.15\n\n-0.2\n0.11\n\n0.4\n\n0.18\n\n0.2\n\n0.0\n0.14\n\n-0.2\n0.10\n\n-0.4\n-0.4\n0.07\n\n0.07\n\n-0.4\n\n-0.2\n\n0.0\nAU\n\n0.2\n\n0.4\n\n-0.6\n-0.6\n\n-0.4\n\n-0.2\n\n0.0\nAU\n\n0.2\n\n0.4\n\n0.6\n\nFig. 1.- Representative models for near-IR emission in Herbig Ae stars. a) Left panel. A\nstandard curved dust-rim-only model (Isella & Natta 2005; Tannirkulam et al. 2007) where\nthe dust sublimation temperature is a power-law function of gas density (Pollack et al. 1994).\nb) Right panel. Gas emission (modeled as a uniform disk centered on the star) has been\nadded inside the dust rim in order to smooth out the emission profile.\n\n\f– 12 –\n\nVisibility curve for AB Aur\n\nVisibility curve for MWC275\n1.0\n\n1.0\nDust-rim model\nDust-rim + gas model\n\nDust Rim\nDust Rim + Gas emission\n\niota data\nKI data\nchara data S2W2\n\"\n\" E1W1\n\"\n\" S1W1\n\"\n\" E2S2\n\"\n\" W1W2\n\"\n\" S2W1\n\n0.8\n\nVisibility\n\n0.6\n\nVisibility\n\n0.6\n\nIOTA data\nPTI data\nCHARA data S2W2\n\"\n\" E1W1\n\n0.8\n\n0.4\n\n0.4\n\n0.2\n\n0.2\n\n0.0\n\n0.0\n50\n\n100\n\n150\n200\nEffective Baseline (m)\n\n250\n\n300\n\n350\n\n50\n\n100\n\n150\n200\nBaseline (m)\n\n250\n\n300\n\n350\n\nFig. 2.- Visibility data and models for MWC275 (left) and AB Aur (right). MWC275\nvisibilities are plotted as a function of \"effective baseline\" (see section §2 ), which accounts\nfor the change in resolution due to disk inclination and PA.\nThe dotted lines correspond to \"Standard\" rim models tuned to fit visibility data for each\nsource for baselines shorter than 100m. The solid lines correspond to dust rim+gas models.\nThe model parameters are listed in Table §1.\n\n\f"}