{"id": "http://arxiv.org/abs/1005.5605v3", "guidislink": true, "updated": "2010-11-16T22:37:18Z", "updated_parsed": [2010, 11, 16, 22, 37, 18, 1, 320, 0], "published": "2010-05-31T07:02:31Z", "published_parsed": [2010, 5, 31, 7, 2, 31, 0, 151, 0], "title": "Charged rotating noncommutative black holes", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1005.3420%2C1005.3731%2C1005.5240%2C1005.3409%2C1005.5603%2C1005.3100%2C1005.3606%2C1005.4637%2C1005.3983%2C1005.4097%2C1005.1743%2C1005.4447%2C1005.5597%2C1005.0885%2C1005.5499%2C1005.0546%2C1005.1683%2C1005.0026%2C1005.2123%2C1005.1542%2C1005.2801%2C1005.0870%2C1005.2863%2C1005.2603%2C1005.3282%2C1005.1708%2C1005.3614%2C1005.0061%2C1005.4594%2C1005.2102%2C1005.5551%2C1005.5158%2C1005.3950%2C1005.0244%2C1005.1820%2C1005.2211%2C1005.2564%2C1005.5693%2C1005.4354%2C1005.2403%2C1005.4113%2C1005.5213%2C1005.2886%2C1005.0009%2C1005.2452%2C1005.2133%2C1005.4777%2C1005.2143%2C1005.0143%2C1005.3376%2C1005.0284%2C1005.2936%2C1005.4655%2C1005.5692%2C1005.2059%2C1005.5271%2C1005.4685%2C1005.2393%2C1005.4588%2C1005.4692%2C1005.0032%2C1005.1677%2C1005.2579%2C1005.3502%2C1005.4669%2C1005.2893%2C1005.4513%2C1005.0108%2C1005.5116%2C1005.2928%2C1005.2251%2C1005.2108%2C1005.1207%2C1005.0900%2C1005.1711%2C1005.2835%2C1005.5168%2C1005.1524%2C1005.4506%2C1005.1374%2C1005.3986%2C1005.2137%2C1005.3862%2C1005.0985%2C1005.4319%2C1005.3927%2C1005.0533%2C1005.0097%2C1005.0598%2C1005.3691%2C1005.3599%2C1005.5605%2C1005.1426%2C1005.2078%2C1005.3027%2C1005.5348%2C1005.3080%2C1005.1896%2C1005.0055%2C1005.5201%2C1005.2679&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Charged rotating noncommutative black holes"}, "summary": "In this paper we complete the program of the noncomutative geometry inspired\nblack holes, providing the richest possible solution, endowed with mass, charge\nand angular momentum. After providing a prescription for employing the\nNewman-Janis algorithm in the case of nonvanishing stress tensors, we find\nregular axisymmetric charged black holes in the presence of a minimal length.\nWe study also the new thermodynamics and we determine the corresponding\nhigher-dimensional solutions. As a conclusion we make some consideration about\npossible applications.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1005.3420%2C1005.3731%2C1005.5240%2C1005.3409%2C1005.5603%2C1005.3100%2C1005.3606%2C1005.4637%2C1005.3983%2C1005.4097%2C1005.1743%2C1005.4447%2C1005.5597%2C1005.0885%2C1005.5499%2C1005.0546%2C1005.1683%2C1005.0026%2C1005.2123%2C1005.1542%2C1005.2801%2C1005.0870%2C1005.2863%2C1005.2603%2C1005.3282%2C1005.1708%2C1005.3614%2C1005.0061%2C1005.4594%2C1005.2102%2C1005.5551%2C1005.5158%2C1005.3950%2C1005.0244%2C1005.1820%2C1005.2211%2C1005.2564%2C1005.5693%2C1005.4354%2C1005.2403%2C1005.4113%2C1005.5213%2C1005.2886%2C1005.0009%2C1005.2452%2C1005.2133%2C1005.4777%2C1005.2143%2C1005.0143%2C1005.3376%2C1005.0284%2C1005.2936%2C1005.4655%2C1005.5692%2C1005.2059%2C1005.5271%2C1005.4685%2C1005.2393%2C1005.4588%2C1005.4692%2C1005.0032%2C1005.1677%2C1005.2579%2C1005.3502%2C1005.4669%2C1005.2893%2C1005.4513%2C1005.0108%2C1005.5116%2C1005.2928%2C1005.2251%2C1005.2108%2C1005.1207%2C1005.0900%2C1005.1711%2C1005.2835%2C1005.5168%2C1005.1524%2C1005.4506%2C1005.1374%2C1005.3986%2C1005.2137%2C1005.3862%2C1005.0985%2C1005.4319%2C1005.3927%2C1005.0533%2C1005.0097%2C1005.0598%2C1005.3691%2C1005.3599%2C1005.5605%2C1005.1426%2C1005.2078%2C1005.3027%2C1005.5348%2C1005.3080%2C1005.1896%2C1005.0055%2C1005.5201%2C1005.2679&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "In this paper we complete the program of the noncomutative geometry inspired\nblack holes, providing the richest possible solution, endowed with mass, charge\nand angular momentum. After providing a prescription for employing the\nNewman-Janis algorithm in the case of nonvanishing stress tensors, we find\nregular axisymmetric charged black holes in the presence of a minimal length.\nWe study also the new thermodynamics and we determine the corresponding\nhigher-dimensional solutions. As a conclusion we make some consideration about\npossible applications."}, "authors": ["Leonardo Modesto", "Piero Nicolini"], "author_detail": {"name": "Piero Nicolini"}, "author": "Piero Nicolini", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevD.82.104035", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1005.5605v3", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1005.5605v3", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "13 pages, 3 figures, correction of a typesetting inattention, updated\n  reference list, version accepted for publication on Physical Review D", "arxiv_primary_category": {"term": "gr-qc", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "gr-qc", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "astro-ph.HE", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "hep-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "hep-th", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1005.5605v3", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1005.5605v3", "journal_reference": "Phys.Rev.D82:104035,2010", "doi": "10.1103/PhysRevD.82.104035", "fulltext": "Charged rotating noncommutative black holes\nLeonardo Modesto∗\nPerimeter Institute for Theoretical Physics, 31 Caroline Street, Waterloo, Ontario N2L 2Y5, Canada\n\nPiero Nicolini†\nFrankfurt Institute for Advanced Studies (FIAS),\nInstitut für Theoretische Physik, Johann Wolfgang Goethe-Universität,\nRuth-Moufang-Strasse 1, 60438 Frankfurt am Main, Germany\n(Dated: October 8, 2018)\n\narXiv:1005.5605v3 [gr-qc] 16 Nov 2010\n\nIn this paper we complete the program of the noncomutative geometry inspired black holes,\nproviding the richest possible solution, endowed with mass, charge and angular momentum. After\nproviding a prescription for employing the Newman-Janis algorithm in the case of nonvanishing\nstress tensors, we find regular axisymmetric charged black holes in the presence of a minimal length.\nWe study also the new thermodynamics and we determine the corresponding higher-dimensional\nsolutions. As a conclusion we make some consideration about possible applications.\nPACS numbers:\nKeywords:\n\nContents\n\nI. Introduction\nII. Newman-Janis algorithm\n\nI.\n\n1\n2\n\nIII. Regular Kerr black hole\nA. Derivation of noncommutative black holes\nB. New prescription for the complexification\nC. The nonsingular line element\nD. Thermodynamics\n\n3\n3\n3\n4\n5\n\nIV. Regular Kerr-Newman black hole\nA. The nonsingular line element\nB. Stress-energy tensor\nC. Thermodynamics\n\n6\n6\n8\n9\n\nV. Higher-dimensional rotating black holes\nA. Higher-dimensional regular Kerr black hole\nB. Higher-dimensional regular Kerr-Newmann\nblack hole\nVI. Conclusions\nAcknowledgments\n\n9\n9\n10\n10\n11\n\nA. Note on Gamma functions\n\n11\n\nB. Kretschmann invariant\n\n11\n\nC. Stress-energy tensor components\n\n12\n\nReferences\n\n∗ lmodesto@perimeterinstitute.ca\n† nicolini@th.physik.uni-frankfurt.de\n\n13\n\nINTRODUCTION\n\nWhen we talk about curvature singularities in general relativity, we often forget that they are just fictitious effects emerging where the classical description of\nthe gravitational field breaks down. In other words, to\nobtain physically reliable scenarios in spacetime regions\nplagued by curvature singularities, one has just the only\npossibility of invoking some formulation of the quantum\ntheory of gravitation. Along this line of reasoning, new\nblack hole geometries have successfully been derived, by\nimproving the classical singularities with quantum gravity mechanisms. For instance, loop quantum black holes\n(LQBHs) have been obtained starting from the prescriptions of loop quantum qravity. Inside the event horizon, a quantized version of the Kantowski-Sachs spacetime has replaced the irregular Schwarzschild geometry\n[1]. Other examples are the noncommutative geometry\ninspired black holes (NCBHs), whose line element singularities are cured by the presence of a minimal length\neffectively induced by the noncommutative character of\ncoordinate operators [2–5]. Even if LQBHs and NCBHs\nuse different tools to tame the curvature singularity, they\nshare many common features, which would suggest an\nuniversal character when quantum gravity effects are\ntaken into account. For instance, under some additional\nhypotheses, they both admit a maximum temperature,\nshowing a thermodynamically stable final phase of the\nHawking evaporation, or they both can be dirty, namely\nadmitting g00 metric components which do not coincide\n−1\nwith the usual value −g11\n[6]. While LQBHs are for\nnow known only for neutral, nonrotating, static fourdimensional geometries, the program of NCBHs includes\na richer variety of physical situations: indeed the charged\nsolution [7], the extradimensional neutral [8] and charged\nsolutions [9] and the rotating one [10] have been obtained\nand they all exhibit a deSitter core/belt as a consequence\nof quantum manifold fluctuations at the origin. The\n\n\f2\ngeneral strategy to derive NCBH solutions consists of\nprescribing an improved form of the energy-momentum\ntensor, which accounts for the noncommutative fluctuations of the manifold at the origin and being vanishing\nfor distances larger with respect to the noncommutative\ngeometry typical scale, i.e. the minimal length. Another\nrequirement is the covariant conservation of the energymomentum tensor, while energy conditions at the origin are generally violated, in agreement with the fact\nthat we are invoking a non-standard, i.e. non-classical,\nkind of matter. The derivation of the correct form of the\nenergy-momentum tensor requires great care, in particular, for the axisymmetric case. Indeed, thanks to some\nconsiderations about the Kerr-Schild decomposition and\nsome physical requirements for the regularity of the manifold, the noncommutative inspired Kerr (NCKerr) solution has been derived starting from a spinning fluid-type\nenergy-momentum tensor. On the other hand, even for\nthe spherically symmetric case, the inclusion of the electromagnetic interaction, makes the determination of the\nenergy-momentum tensor much more difficult. In particular, if we want to have a complete scenario for a regular\nblack hole endowed with all the three externally observable classical parameters, mass, electric charge, and angular momentum, we need to devise an alternative to\nthe direct derivation of the energy-momentum tensor. In\nthis paper, we propose a way to circumvent the aforementioned difficulties opening a new route on the basis of the\nNewman-Janis algorithm [11]. However this kind of algorithm works only for vacuum or Reissner-Nordström\ngeometries. As a result, we first provide a prescription\nto amend the Newman-Janis algorithm and extend its\nvalidity to the case of NCBHs. Then we show how this\nprescription lets us correctly obtain the recent regular\nspinning black hole, i.e. the NCKerr solution. Then\nwe proceed by deriving the corresponding regular KerrNewman (NCKN) solution and the higher-dimensional\nversion of NCKerr and NCKN metrics. We recall that\nthere exist other attempts to determine regular spinning\nblack hole solutions [12]. However the strategy at the basis of these derivations has been always that of matching\nan outer geometry with a regular local geometry at the\norigin. Conversely, by means of the Newman-Janis mechanism we shall present unique solutions which interpolate\nthe local regular behavior at the origin and the conventional rotating geometries at large distances. In addition, against the existing literature, our solutions have an\nintrinsic quantum gravitational character at the origin,\nsince the Newman-Janis algorithm maintains the original features of the corresponding nonrotating NCBHs.\nThe paper is organized as follows. In Sec. II, we\npresent the Newman-Janis algorithm which we will use in\nthe following sections to derive the NCKerr solution (Sec.\nIII), the NCKN (Sec. IV) and the higher-dimensional\nNCKerr and NCKN solutions (Sec. V). Throughout the\nsections, discussions are devoted both to regularity of the\ngeometry and the behavior of the Hawking temperature.\nIn Sec. VI, we draw the conclusions.\n\nII.\n\nNEWMAN-JANIS ALGORITHM\n\nThe Newman-Janis algorithm is often regarded as a\nshort cut to obtain spinning black hole solutions from\nthe corresponding nonrotating ones. According to [13],\nthe algorithm works only for vacuum solutions or the case\nof a Maxwell stress tensor at the most. After presenting\nthe general procedure, we will provide in the next section\na prescription to include the case of nonvanishing stress\ntensors. We start from the line element\nds2 = e2Φ(r) dt2 − e2λ(r) dr2 − H(r)dΩ2\ndr2\n= G(r)dt2 −\n− H(r)dΩ2 .\nF (r)\n\n(1)\n\nEmploying the outgoing Eddington-Finkelstein coordinates {u, r, θ, φ}, where\nu = t − r∗\n\n(2)\n√\nand dr∗ = dr/ GF , the above line element can be written in the following shape\ns\nG(r)\n2\n2\ndudr − H(r) dΩ2 .\nds = G(r)du + 2\nF (r)\nThe covariant metric in matrix form reads\n\n0\ne−Φ(r)−λ(r) 0\n0\n−Φ(r)−λ(r)\n−2λ(r)\n\ne\n−e\n0\n0\ng μν = \n−1\n\n0\n0\n0\nH(r)\n0\n0\n0 H(r)−1\nsin2 θ\n\n\n\n\n. (3)\n\n\nWe can write the metric in terms of null tetrad vectors\ng μν = lμ nν + lν nμ − mμ m̄ν − mν m̄μ ,\nlμ = δ1μ ,\nr\nF μ 1 μ\nμ\nn =\nδ − F δ1 ,\nG 0\n2\n\u0013\n\u0012\ni μ\n1\nδ3\nδ2μ +\nmμ = √\nsin θ\n2H\n\n(4)\n\nwhere lμ lμ = mμ mμ = nμ nμ = lμ mμ = nμ mμ = 0 and\nlμ nμ = −mμ m̄μ = 1 (x̄ is the complex conjugate of the\ngeneral quantity x). Complex null tetrads form the starting point to derive the Kerr spinning black hole metric.\nTo this purpose, we consider the following Newman-Janis\ncomplex increment\nr → r′ = r + i a cos θ,\nu → u′ = u − i a cos θ.\n\n(5)\n\nUnder the complex increment the tetrads change\nlμ = δ1μ ,\ns\n\n(6)\n\nF (r, θ) μ 1\nδ − F (r, θ) δ1μ ,\nG(r, θ) 0\n2\n\u0012\n\u0013\ni μ\n1\nia sin θ(δ0μ − δ1μ ) + δ2μ +\nmμ = p\nδ3 .\nsin θ\n2H(r, θ)\nnμ =\n\n\f3\nFor G = F and H = r2 the metric simplifies and reads\nds2 = G(r)du2 + 2dudr − r2 dΩ2 .\nIII.\nA.\n\nREGULAR KERR BLACK HOLE\n\nDerivation of noncommutative black holes\n\nwhere\n\nWe start by briefly recalling the general ideas behind\nNCBH solutions. The quest for a noncommutative formulation of general relativity is a long standing problem\nwhich seems, up to now far from being close to a solution.\nThe general procedure of employing the Moyal ⋆-product\namong vielbein fields in gravity action is mathematically\ncorrect but physically not efficient when studying specific\nsolutions. This can be explained by the fact that, for\npractical computations one must expand the ⋆-product\nin the noncommutative parameter: at any truncation at\na desired order one actually destroys the nonlocal character of the theory [14]. As a consequence, the resulting\nblack hole geometries are affected by a singular behavior at the origin as conventional classical solutions [15].\nAgainst this background, there is a possibility of circumventing the problem by changing strategy. Instead of\nformulating a theory with a nonlocal product one may\nthink to implement the nonlocal character of noncommutative geometry, by an effective deformation of conventional field equations. Roughly speaking one can average\nnoncommutative fluctuations of the manifold and work\nwith the resulting mean values. The starting point is the\nultimate fate of the classical point-like object in noncommutative geometry. In a series of papers based on the\ncoordinates coherent state approach to noncommutative\ngeometry [16] it has been shown that the mean position\nof a point like object in a noncommutative manifold is\nno longer governed by a Dirac delta function but by a\nGaussian distribution\nρθ (~x) =\n\n2\n1\ne−~x /4θ ,\n(4πθ)d/2\n\n−1\nadditional \"Schwarzschild-like\" condition g00 = −grr\ncompletely specify the form of the energy-momentum\ntensor which generates the solution [3]\n\u0012\n\u0013\n2m(r)\ndr2\n\u0011 − dΩ2 , (8)\nds2 = 1 −\ndt2 − \u0010\n2m(r)\nr\n1− r\n\nm(r) = M\n\nγ(3/2; r2 /4θ)\n,\nΓ(3/2)\n\n(9)\n\nwith M the total (constant) mass of the system and\nZ\n\nr 2 /4θ\n\nt1/2 e−t dt ,\nγ(3/2; r /4θ) =\n0\n√\nZ ∞\nπ\n1/2 −t\n.\nΓ(3/2) =\nt e dt =\n2\n0\n2\n\n(10)\n\nThis metric describes the noncommutative geometry inspired Schwarzschild\n√ (NCSchw) black hole. At large distances, i.e. r ≫ θ, the function m(r) approaches the\ntotal mass M , namely m(r) → M , and (8) matches the\nconventional\nSchwarzschild solution. At short distances\n√\nr ≪ θ a regular de Sitter core accounts for the manifold fluctuations, taming the singularity at the origin.\nThe de Sitter core is the sign of an antigravity effect.\nIndeed the matter which generates the spacetime geometry is no longer concentrated at the origin, but it is\nsmeared out with a Gaussian profile. The noncommutative fluctuations sustain this Gaussian profile, preventing its collapse into a Dirac delta. As a result, we cannot\nspeak of a vacuum solution, since Einstein equations have\na nonvanishing energy-momentum tensor. Furthermore,\nthis energy-momentum tensor, describing an anisotropic\nfluid, has a form not equivalent to that of the electromagnetic field stress tensor. For this reason, the application\nof the Newman-Janis procedure [13] is no longer straightforward, but requires additional work.\n\n(7)\n\nwhere d is the manifold dimension and θ the noncommutative parameter with dimensions of a length squared\nthat encodes a minimal length in the manifold. In addition it has been shown that primary corrections to any\nfield equation in the presence of a noncommutative background can be obtained by replacing the conventional\npoint-like source term (matter sector) with a Gaussian\ndistribution, while keeping formally unchanged differential operators (geometry sector) [4]. In the specific case\nof the gravity field equations this is equivalent to saying that the only modification occurs at the level of the\nenergy-momentum tensor, while Gμν is formally left unchanged.\nFor a static, spherically symmetric, noncommutative\ndiffused, particlelike gravitational source, one gets a\nGaussian profile for the T00 component of the energymomentum tensor. The covariant conservation and the\n\nB.\n\nNew prescription for the complexification\n\nIn this section we extend the Newman-Janis procedure\nto the case of the line element in (8). The key point is now\nhow to perform the complexification. We need to adapt\nthe general procedure, in order to include the presence\nof anisotropic stress tensors. Without loss of generality,\nwe can write the line element (8) as\n\u0013\n\u0012\n2m(r)\ndu2 + 2dudr − dΩ2 ,\nds2 = 1 −\n(11)\nr\nwhich lets us identify\n\u0013\n\u0012\n2m(r)\n2Φ(r)\n& λ(r) = −Φ(r).\ne\n= 1−\nr\n\n(12)\n\nSuppose we start from the case θ = 0. The line element\n(8) coincides with the Schwarzschild one, m(r) = M ,\n\n\f4\nand there is no difficulty in following the procedure in\n[13]. The mass term in unaffected by the complexification\nr 7→ r′ = r + ia cos θ and only the term\n\u0013\n\u0012\nr\n1\n1\n1 1\n+  ̄′ = 2\n7→\n(13)\nr\n2 r′\nr + a2 cos2 θ\nr\nis modified by the algorithm. As a consequence we write\nthe complexified metric as\n\u0012\n\u0013\n1\n2m(Re(r′ )) 1\n+\ne2Φ(r)) 7→ 1 −\n2\nr′\nr ̄′\n2m(r)r\n(14)\n,\n=1− 2\nr + a2 cos2 θ\nwhere we have expressed M in terms of m(r′ ) as M =\nm(Re(r′ )) = m(r). We show now that (14) has general\nvalidity and does not depend on the specific value θ = 0,\nchosen for the noncommutative parameter. To this purpose, we need to invoke the Kerr-Schild decomposition.\nAs shown in [10], the Schwarzschild like class of metrics\ncan be cast in the form\nds2 = ds2M −\n\nf (r)\n(kμ dxμ )2 ,\nr2\n\n(15)\n\nwhere ds2M is the Minkoswki line element and kμ is a\nlightlike vector in Minkowski coordinates. The function\nf (r) depends only on the radial coordinate and reads\nf (r) = 2m(r)r.\n\n(16)\n\nFor the conventional Schwarzschild solution we simply\nhave f (r) = 2M r. This kind of decomposition permits\nus to express spinning solutions too. Indeed even if the\nsymmetry has changed, from a spherically symmetric geometry to an axisymmetric geometry, the formal structure of the solution (15) holds\nds2 = ds2M −\n\nf (r)\n(kμ dxμ )2 ,\nr′ r̄′\n\n(17)\n\nwhere f (r) is formally the same as in (16) and kμ is\nexpressed in spheroidal coordinates. As a result we conclude that in all generality the mass term m(r) is unaffected by the complexification and (14) is valid for any\nvalue of the parameter θ.\nC.\n\nThe nonsingular line element\n\nWith the above prescription we can follow the\nNewman-Janis algorithm and write the metric in BoyerLindquist coordinates\nds2B−L = G(r, θ)dt2 −\n2\n\nΣ(r, θ) dr2\na2 sin θ + G(r, θ)Σ(r, θ)\n2\n\n2\n\n+2(1 − G(r, θ)) sin θ dtdφ − Σ(r, θ)dθ\n\u0002\n\u0003\n− sin2 θ a2 (2 − G(r, θ)) sin2 θ + Σ(r, θ) dφ2 , (18)\n\nwhere\nG(r, θ) := e2Φ(r,θ) = 1 −\n\nr2\n\nγ(3/2; r2 /4θ)\n2M r\n,\n2\n2\n+ a cos θ\nΓ(3/2)\n\nΣ(r, θ) = r2 + a2 cos2 θ.\n\n(19)\n\nWe introduce also the quantity\n∆ := r2 − 2m(r) r + a2\n\n(20)\n\nwhich is useful to express the metric in a more familiar\nform\n∆ − a2 sin2 θ 2 Σ 2\n(21)\ndt − dr − Σ dθ2\nΣ\n∆\n\u0013\n\u0012\nΣ\n∆ − a2 sin2 θ\n− dr2 − Σ dθ2 + 2a sin2 θ 1 −\ndt dφ\n∆\nΣ\n\u0014\n\u0012\n\u0013\u0015\n∆ − a2 sin2 θ\n− sin2 θ Σ + a2 sin2 θ 2 −\ndφ2 .\nΣ\nds2 =\n\nThe above metric coincides with that found in [10]. This\nis a sign of robustness of our procedure. In Kerr coordinates the metric reads\nds2(K) = G(r, θ)du2 − Σ(r, θ)dθ2 − 2a sin2 θdrdφ\n\u0002\n\u0003\n+ a2 (G(r, θ) − 2) sin2 θ − Σ(r, θ) sin2 (θ)dφ2\n+2a(1 − G(r, θ)) sin2 θdφ du.\n\n(22)\n\nHere we will not repeat all the discussion about this\nNCKerr black hole. We just provide some additional\nclues with respect to the known literature. For instance\nthe curvature singularity is claimed to be removed. To\nattack the singularity problem we can study not only the\nRicci scalar but also the Kretschmann invariant defined\nas K(r, θ) = Rμνρσ Rμνρσ . The Ricci scalar,\n\u0001\nr2\nM r2 e− 4θ r2 − 8θ\n√\n,\nR(r, θ) =\nπ θ5/2 (a2 cos(2θ) + a2 + 2r2 )\n\n(23)\n\nis regular in r = 0, θ = π/2 but it assumes two different\nvalues depending of the way one reaches the origin. This\nis the signature of the presence of the so called \"de Sitter\nbelt\". If we approach the origin moving on the equatorial\nplane, i.e. θ = π/2, we find a regular rotating de Sitter\ngeometry\n\u0012\n\u0013\n4M\n(24)\nlim R(r, θ) = − √ 3/2 .\nlim\nr→0\nθ→π/2\nπθ\nHowever if we approach the origin along an arbitrary\nplane, i.e. r → 0 with θ 6= π/2, we reach the equatorial\ndisk. Since in this region there is no matter, we find a\nMinkowski geometry, namely\n\u0010\n\u0011\n(25)\nlim R(r, θ) = 0.\nlim\nθ→π/2\n\nr→0\n\nThis feature can also be seen by studying the\nKretschmann invariant, whose general formula is given\n\n\f5\nPlot of Κ+ for r+ Î @0, 60D and a = 10,5,3,1\n\nunexplored in the literature. To define the Hawking temperature we need the surface gravity κ in order to have\n\n0.08\n\nT =\n\n~cκ\n,\n2πkB\n\n(29)\n\n0.06\n\nΚ+\n\nwhere we have temporarily restored all the constants for\nsake of clarity. The surface gravity is defined by\n0.04\n\n1\nκ2 = − ∇μ χν ∇μ χν ,\n2\n\nwhere χν are null Killing vectors. In the case of an axisymmetric geometry, the quest of null Killing vectors\nrequires a certain attention. We start from\n\n0.02\n\n0.00\n\n(30)\n\n0\n\n10\n\n20\n\n30\n\n40\n\n50\n\nχμ = ξ μ + Ω mμ ,\n\n60\n\nr+\n\nFIG. 1: Plot of the surface gravity as a function of the horizon\nradius for different values of the a. The rotation has just the\neffect of increasing the values of the mass of the black hole\nremnant.\n\nin (B1). Again we obtain two different values according\nto the way we approach the origin\n\u0012\n\u0013\n8M 2\n(26)\n,\nlim K(r, θ) =\nlim\nr→0\n3πθ3\nθ→π/2\n\u0010\n\u0011\nlim K(r, θ) = 0.\nlim\nθ→π/2\n\nr→0\n\nTo clarify this point it is worthwhile to expand the metric\nfor small r, keeping θ = π/2\n\u0013\n\u0012\nr2\nΛr2\n2\ndr2\ndt2 − 2\nds ≈ 1 −\n3\na + r2\n\u0013\n\u0012\nΛar2\nΛa2 r2\n+2\ndφ2 , (27)\ndt dφ − r2 + a2 +\n3\n3\nwhich corresponds\nto a rotating de Sitter geometry with\n√\nΛ = M/θ3/2 π. If one approaches the origin for θ 6=\nπ/2, one finds the flat disk\n2\n\n2\n\n2\n\n2\n\n2\n\n2\n\n2\n\nds ≈ dt − cos θdr − a sin θdφ .\n\n(28)\n\nThe two geometries have been explained in terms of a\nrotating string, which replaces the ring singularity [10].\nThis is equivalent to saying that instead of the conventional infinite discontinuity in the curvature, we have a\nfinite jump, i.e. 4Λ, thanks to the presence of the de\nSitter belt.\n\nD.\n\nThermodynamics\n\nTo complete the analysis of the NCKerr solution, we\nface the problem of the Hawking temperature, a fact yet\n\n(31)\n\nwhere ξ μ ≡ ∂t and mμ ≡ ∂φ are, respectively, the Killing\nvector associated with the time translation invariance\nand rotational invariance. We find Ω imposing χμ to\nbe a null vector, i.e.\n(32)\nχμ χμ = gtt + 2Ωgtφ + Ω2 gφφ = 0\ns\u0012\n\u00132\nr\ngtt\ngtφ\ngtφ\ngtt\n±\n= ω ± ω2 −\n,\n−\n=⇒ Ω = −\ngφφ\ngφφ\ngφφ\ngφφ\nwhere\n\u0002\n\u0003\n−a Σ − (∆ − a2 sin2 θ)\ngtφ\n\u0002\n\u0003,\nω=\n= 2\ngφφ\nΣ + a2 sin2 θ 2Σ − (∆ − a2 sin2 θ)\n\n(33)\n\nand therefore\n\n1\n\nΩ=ω±\n\nΣ ∆2\n\u0003.\n2\n2\nsin θ (a sin θ + Σ)2 − ∆a2 sin2 θ\n\u0002\n\n(34)\n\nOn the event horizon ∆ = 0. Thus Ω reduces to ΩH =\n2\nω(r+ ) = a/(r+\n+ a2 ), where r+ is implicitly defined by\n∆(r+ ) = 0. The surface gravity for a general function\n∆(r) is\nκ=\n\n∆′ (r+ )\n2 + a2 )\n2(r+\n\n(35)\n\nwhere ′ denotes the derivative respect to r. More specifically when ∆(r) = r2 + a2 − 2m(r)r as in the NCKerr\nspacetime we find\n\"\n#\n2\n2\n(r+\n+ a2 )r+\ne−r+ /4θ\nr+\na2\nκ=\n2 + a2 ) 1 − r 2 −\n2 /4θ) .\n2(r+\nγ(3/2; r+\n4θ3/2\n+\nAs a result the temperature becomes a function T =\nT (r+ , a). We notice that for having a positive defined\ntemperature a cannot exceed r+ . In Fig. 1, we see that\nthe profile of the temperature is roughly equivalent to\nthat of the nonrotating solution. After a temperature\nmaximum, the black hole cools down to a zero temperature black hole remnant final state. The size and the\nmass of this remnant have increased with respect to the\n\n\f6\nnonrotating case, since also the rotational kinetic energy\nis stored in the final configuration. However, this scenario\ndoes not take into account the loss of angular momentum\ndue to the Hawking emission and the consequent transition into a Schwarzschild phase. In other words the black\nhole evaporation is a multi phase process that would require further investigations.\nIV.\n\nREGULAR KERR-NEWMAN BLACK HOLE\nA.\n\nds2 = e2Φ(r) dt2 −\n\nThe nonsingular line element\n\nAfter the foreplay about the NCKerr solution, we can\nmake a step forward. We want to derive a new spacetime geometry which comprises all the three fundamen-\n\ne\n\ntal black hole parameters, mass, charge and angular momentum. In the spirit of what we found in the previous\nsection, we would like the new solution to be singularity\nfree for the presence of an effective minimal length. This\nwould close the program of the NCBHs, initiated in 2005\nwith the NCSchw solution. To tackle this problem we\nrecall the noncommutative geometry inspired ReissnerNordström (NCRN) solution described by the line element [7]\n\n2Φ(r)\n\n2\n=1−\nr\n\ndr2\ne2Φ(r)\n\n− r2 dΩ2 ,\n\nwhere exp(2Φ) is the following more involved but regular\nquantity\n\n\"\n(\n#)\nr\n\u0015\nr\nM γ(3/2; r2 /4θ)\n1 Q2 2\n2\n2\n2\n2\nγ (1/2; r /4θ) − √ γ(1/2; r /2θ) + r\nγ(3/2; r /4θ)\n.\n+ 2\nΓ(3/2)\nr\nπ\nθ\n2θ\n|\n{z\n}\n|\n{z\n}\n\u0014\n\nm(r)\n\n(38)\n\nμν\nwhere Tmatt.\ndescribes an anisotropic neutral fluid and\nμν\nTel. is formally the usual electromagnetic field stress tensor. However, the Maxwell field F μν solves the equation\n\n1\n√\n∂μ\n−g\n\n\u0001\n√\n−g F μν = J ν ,\n\n(37)\n\nq(r)2\n\nThis geometry is generated by an energy-momentum tensor made up of two parts\nμν\nμν\nT μν = Tmatt.\n+ Tel.\n,\n\n(36)\n\nand identifies the two integration constants with mass\nand charge from the behavior of the solution at infinity.\nGiven the form of the electric field (40), the actual form\nof Tμ0 |el. turns out to be rather different from the usual\nelectromagnetic stress tensor. Therefore the NewmanJanis algorithm must be reviewed. As in the previous\nsections we invoke the validity of the Kerr-Schild decomposition. The conventional Reissner-Nordström solution\ncan be written as\n\n(39)\n\nwhose source term is subjected to the noncommutative\nsmearing effect, i.e. the presence of a minimal length. As\na consequence the resulting electric field is\n\u0013\n\u0012\n3 r2\n2Q\n,\n(40)\n;\nE (r) = √ 2 γ\nπr\n2 4θ\nwhere Q = Q c2 /G1/2 is the electric charge. Another\nkey feature of the solution is its ADM mass M , which\nincludes also the regularized electrostatic self-energy of\nthe system\nI\n\u0001\n(41)\ndσ μ Tμ0 |matt. + Tμ0 |el. ,\nM=\nΣ\n\nwhere Σ is a t = const., closed three-surface at infinity.\nIn the conventional Reisnerr-Nordstöm solution this term\ndiverges and it is simply disregarded. Indeed to avoid the\nproblem of the singularity, one solves \u0001Einstein equations\nin a restricted domain R × R3 \\ {0} , i.e. in vacuum,\n\nds2 = ds2M −\n\nf (r)\n(kμ dxμ )2 ,\nr2\n\n(42)\n\nwhere the function f (r) = 2M r − Q2 . The NC geometry inspired solution has the same form. The delocalization of the source term in Einstein equations has just\nthe effect of modifying the function f (r), which now is\nf (r) = 2m(r)r − q(r)2 . This is in the spirit of what we\nhave seen for the Schwarzschild case. The function f (r)\nis mapped into f (r) = 2m(r)r, passing from the conventional to the NC geometry inspired case, but maintains\nthe structure f ∝ r × mass. In the charged case the only\ndifference is that the \"mass\" contains also the energy\nstored in the field, namely\n2 mass 7→ 2 mass −\n\ncharge2\n.\nr\n\n(43)\n\nAs a result for the class of all rotating geometries we\nstill have (17). We conclude that the function f (r) is\nformally unaffected even if expressed in spheroidal coordinates rather than spherical ones. Therefore we can\n\n\f7\nextend the validity of our prescription about the complexification of line elements not comprised by the NewmanJanis algorithm in order to include the NCRN geometry.\nFor this reason we write\n2m(r) q(r)2\n+ 2\ne2Φ(r) = 1 −\nr\u0013\nr\n\u0012\n1\n1\n1\n7→ 1 −\n+  ̄′ m[Re(r′ )] + ′  ̄′ q 2 [Re(r′ )]\nr′\nr\nrr\n=1−\n\nr2\n\nq(r)2\n2m(r)r\n+ 2\n.\n2\n2\n+ a cos (θ) r + a2 cos2 (θ)\n\n(44)\n\nThe line element is formally equivalent to the neutral one\n∆ − a2 sin2 θ 2 Σ 2\ndt − dr − Σ dθ2\n(45)\nΣ\n∆\n\u0012\n\u0013\n∆ − a2 sin2 θ\n+2a sin2 θ 1 −\ndt dφ\nΣ\n\u0013\u0015\n\u0014\n\u0012\n∆ − a2 sin2 θ\ndφ2 .\n− sin2 θ Σ + a2 sin2 θ 2 −\nΣ\n(46)\nds2 =\n\nFIG. 2: Plot of the function ∆ = 0 for the neutral rotating\ncase. The parameter a is along the z-axis there, the horizon\nradius is along the x-axis and the mass M is along the yaxis. Qualitatively this is the behaviors of the rotating charges\nsolution too.\n\napart from the function ∆(r)\n∆ = r2 − 2m(r)r + q(r)2 + a2 ,\n\n(47)\n\nr2\n\nwhich now depends on the \"charged\" f (r). Because of\nthe equivalent formal structure of the line element, considerations about the horizons are the same as in the\nneutral case. The horizon equation 1/grr = 0, gives\n∆(rH ) = 0. Again this equation cannot be solved in\na closed form as rH = rH (M, Q, a). Anyway the horizon\nequation is formally equivalent to its corresponding one\nfor the nonrotating case. There is just an extra parameter a2 which simply shifts the roots of the equation. As\na result we have the following scenario (see Fig. 2)\n1. for M > Mextr. there are two distinct horizons\nr± , corresponding to the case of nonextremal black\nhole;\n2. for M = Mextr. there is one degenerate horizon\nrextr. , corresponding to the case of extremal black\nhole;\n3. for M < Mextr. there is no horizon and the line element describes the regular geometry of a charged\nspinning object. Extending the terminology already in use we will speak of charged spinning\nmini-gravastar, a system completely governed by\nthe quantum mechanical fluctuations of the manifold.\nIn support of our claim about the regularity of the spacetime, we must study the singularity problem. The Ricci\nscalar as function of r and θ is\nR(r, θ) =\n\n−4rm′′ (r) − 8m′ (r) + 2[q 2 ]′′ (r)\n,\na2 cos(2θ) + a2 + 2r2\n\nintroducing m(r) and q(r)2 we find\n\n(48)\n\ne− 2θ\nR(r, θ) =\n(49)\n×\n4πθ3 r (a2 cos(2θ) + a2 + 2r2 )\nh √ √\n\u0010\n\u0011\n√\n√ r2\nr2\nr2\n4 π θM r5 e 4θ − 2Q2 r5 e 4θ + 8θQ2 r3\n2e 4θ + 1\n\u0013\n\u0012\n\u0001\n√ 3\nr2\n3\nr2\n1 r2 i\n,\n.\n−8 πθ 2 r2 e 4θ 4M r + Q2 + 8θ 2 Q2 r2 e 4θ Γ\n2 4θ\n\nThe plot for the Ricci scalar, with the analytical limits\nAs in the\nnear the classical singularity, is in Fig.3.\nneutral case, a jump of the Ricci scalar at the origin\nappears\n√ 2\n√ √\n2Q − 4 π θM\nlim lim R(r, θ) =\n,\nr→0 θ→π/2\nπθ2\n(50)\nlim lim R(r, θ) = 0.\nθ→π/2 r→0\n\nThese limits deserve further consideration with respect to\nthe new case. Indeed we have seen that for the NCKerr\nsolution approaching the origin on the equatorial plane\n√\nlets us experience a cosmological term Λ = M/θ3/2 π.\nThis is exactly the value seen when approaching the origin of the corresponding spherically symmetric solution,\nnamely, the NCSchw black hole. The only difference in\nthe spinning case is that such a Λ emerges only for limits\nalong the equatorial plane. But there is something more.\nThe same value emerges as far as one approaches the origin of the NCRN solution. More precisely in the latter\ncase only the bare mass term\nI\nM0 =\ndσ μ Tμ0 |matt. ,\n(51)\nΣ\n\n\f8\nour line of reasoning\n4M0\nlim lim R(r, θ) = − √ 3/2 .\nπθ\n\nr→0 θ→π/2\n\n(53)\n\nThis feature discloses new insights about the nature of\nthe energy-momentum tensor.\nB.\n\nStress-energy tensor\n\nBefore addressing the problem of the energymomentum tensor we recall some properties of the new\nsolution. The charged spinning geometry has been simply mapped from the nonrotating one, without formally\nmodifying the distributions of mass and charge. Furthermore, the charged spinning geometry can also be mapped\nfrom the neutral spinning one, simply redefining f (r) or\n∆, in order to include a charge term. We conclude that\nthe Newman-Janis algorithm does not affect the general\nform of the stress tensor, that will be\nTνμ = (ρ + pθ ) (uμ uν − lμ lν ) − pθ δνμ .\n\n(54)\n\nThe above expression can be split in two contributions\nas in the NCRN case\nTνμ = Tνμ |matt. + Tνμ |el. ,\n\n(55)\n\nwhere Tνμ |matt. is the source term for the neutral spinning\nsolution, namely\nTνμ |matt. = (ρ0 + (pθ )0 ) (uμ uν − lμ lν ) − (pθ )0 δνμ . (56)\n\nFIG. 3: Plot of the Ricci scalar as a function or r and θ for\ndifferent values of the couple (M, a). Along the equatorial\nplane, i.e. θ = π/2 ∼ 1.57 the de Sitter belt appears. For all\nother angles, one finds a flat disk i.e. vanishing curvature.\n\ncontributes to the effective cosmological constant, while\nthe electromagnetic contribution turns out to be subleading. This would imply that also in our new spinning\ncharged solution the value of Λ could be proportional\nto M0 as in the nonrotating case. Indeed if we give for\ngranted the scheme in (43), we can exploit the properties\nof the NCRN solution, for which the mass term M reads\nQ2\n.\nM = M0 + √\n2θπ\n\n(52)\n\nWe notice that by inserting the above relation in (50), the\nelectromagnetic energy exactly cancels out, confirming\n\nWe start from T00 which represents the energy density of\nthe system. We have already obtained a prescription for\nit from the form of the total mass energy of the system\n(52). If we really believe that the charged solution can\nbe obtained from the neutral one assuming a new form\nfor f (r), the resulting energy density can be obtained\ninvoking the validity of (43). Therefore it reads\nT00 ≡ ρ(r) = ρm (r) + ρq (r) ,\n\n(57)\n\nwhere ρM (r) contains both the term leading to the bare\nmass M0 and the electrostatic self-energy density\nρm (r) = ρ0 (r) + ρself (r)\nand ρq (r) can be implicitly defined through\nZ π\nZ r\nΣ2\n1 q(r)2\ndθ sin θ 2 ρq (x) = −\ndr\n2π\n.\nr\n2 r\n0\n0\n\n(58)\n\n(59)\n\nHere the integration volume in spheroidal coordinates is\nconsidered. In agreement with [10], ρ(r) is an invariant\nenergy density and the function ρm (r) is connected to\nthe mass distribution as\nρm (r) =\n\nr4\nρG (r),\nΣ2\n\n(60)\n\n\f9\nwhere ρG (r) is the original spherically symmetric Gaussian in agreement with the basic motivations of all NC\ngeometry inspired solutions\n2\nM\nρG (r) =\ne−r /4θ .\n(4πθ)3/2\n\n(61)\n\nTo check this result we need to prove that (52) is satisfied. To this purpose we recall that the mass M can be\nobtained from\nZ π\nZ ∞\nΣ2\ndθ sin θ 2 ρ(r).\ndr\nM = 2π\n(62)\nr\n0\n0\nThe integral can be written as\nM = 2π\n\nZ\n\n0\n\n∞\n\ndr\n\nZ\n\nπ\n\n0\n\nΣ2\ndθ sin θ 2 [ρ0 (r) + ρself (r) + ρq (r)] .\nr\n2\n\nThe integration of ρq (r) gives ∼ Q /r which vanishes at\ninfinity. Therefore the integral becomes\nZ ∞\nM = 4π\nr2 ρG (r),\n(63)\n0\n\nwhere ρG (r) is nothing but the profile of the NCRN case.\nTherefore we know that its integration leads to a mass\nM including the regularized electrostatic self energy as in\n(52). The other entries of the stress tensor are connected\nthrough Einstein equations to the generic functions f (r)\nand ∆\n\u0001\nd2 f\n= 16πgθθ Trr + Tθθ ,\ndr2\n\u0001\nd2 ∆\n= 2 − 16πgθθ Trr + Tθθ .\n2\ndr\n\n(64)\n(65)\n\nWe recall that also these functions can be written as\nf (r) = f0 (r) + fel. (r), ∆ = ∆0 + ∆el. , with fel. (r) =\n−q(r)2 and ∆el. = q(r)2 . As a result we have\n\u0013\n\u0012\n4\n\u0001\nd2 [q 2 ]\n2 sin θ 2\n−\n= −16π a\nTrr + Tθθ |el. .\nq\n2\ndr\nΣ\n\n(66)\n\nWhen Q 6= 0 we have that ∆ = r2 + a2 − 2m(r)r + q(r)2\nand thus\nκ=\n\nh\na2\nq 2 (r+ ) [q 2 ]′ (r+ )\nr+\n1− 2 −\n+\n2\n2\n+a )\nr+\nr+\nr+\n2\n(r2 + a2 + q 2 (r+ ))r+\ne−r+ /4θ i\n− +\n2 /4θ) .\nγ(3/2; r+\n4θ3/2\n2\n2(r+\n\nWe can write the above formula as\n\u0014 2\nq (r+ ) [q 2 ]′ (r+ )\nr+\n−\n+\nκ = κ0 +\n2 + a2 )\n2\n2(r+\nr+\nr+\n#\n2\n−r+\n/4θ\n2\n(q (r+ ))r+\ne\n−\n2 /4θ) ,\nγ(3/2; r+\n4θ3/2\n\n(69)\n\nwhere κ0 is the temperature in the neutral rotating case.\nAs in the NCRN case, the presence of the charge just\nlowers down the temperature with respect to the neutral case. Therefore we expect a temperature profile that\nqualitatively resembles what found in Fig. 1 for the neutral case.\n\nV.\n\nA.\n\nHIGHER-DIMENSIONAL ROTATING\nBLACK HOLES\nHigher-dimensional regular Kerr black hole\n\nIn view of possible appearance of microscopic black\nhole in TeV gravity experiments it is mandatory to extend our analysis to the extradimensional scenario. We\nstart from the spherically symmetric black hole\nds2(d+1)\n\n\u0012\n\u0013\n2μ(r)\ndr2\n\u0011\n= 1 − d−2 dt2 − \u0010\n2μ(r)\nr\n1\n−\n{z\n}\n|\nr d−2\nG(r)\n\nd−3\n2\n− |{z}\nr2 (dθ2 + sin2 θφ2 ) − |r2 cos\n{z θ} dΩ ,\ngΩ2\n\nThe remaining terms can be computed requiring the conservation of the stress tensor. The analytical components\nare given in Appendix C.\n\n(68)\n\ngΩd−3\n\nM\nγ(d/2; r2 /(4l2 ).\nμ(r) = d−1\nM∗ Γ(d/2)\n\n(70)\n\nand we apply our usual prescription for the complexification, i.e.\nC.\n\nThermodynamics\n\nThe thermodynamics of the NC geometry inspired\nKerr-Newman black hole can be studied in analogy to\nwhat we found for the neutral spinning case. We recall\nthat the surface gravity for a general function ∆(r) is\nκ=\n\n∆′ (r+ )\n2 + a2 ) .\n2(r+\n\n(67)\n\n\u0012\n\u0013\n\u0012\n\u0013\n2μ(r)\n2μ[(r′ + r̄′ )/2]\nG(r) = 1 − 2 d−4 7→ 1 − ′ ′ ′\nr r\nr r̄ [(r + r̄′ )/2]d−4\n2μ(r)\n= 1 − 2 d−4 ,\nR r\ngΩ2 7→ r′ r̄′ = R2 ,\ngΩd−3 = r2 cos2 θ 7→ [(r′ + r̄′ )/2] cos2 θ = r2 cos2 θ2 ,\nR2 = r2 + a2 cos2 θ.\n(71)\n\n\f10\nThe rotating metric is\n\nand we apply our usual prescription for the complexification, i.e.\n\n∆ − a2 sin2 θ 2 R2 2\ndt −\ndr − Σ dθ2\nR2\n∆\n\u0013\n\u0012\n∆ − a2 sin2 θ\ndt dφ\n+2a sin2 θ 1 −\nR2\n\u0014\n\u0012\n\u0013\u0015\n∆ − a2 sin2 θ\n− sin2 θ R2 + a2 sin2 θ 2 −\ndφ2\nR2\nds2 =\n\n−r2 cos2 θ dΩd−3 .\n\n(72)\n\nNow ∆(r) is defined by the following relation\n∆ = r 2 + a2 −\n\nThe rotating metric is (72) with the new ∆(r) function\n\n2μ(r)\n.\nrd−4\n(73)\n\nThe metric enjoys regularity at the origin as the previous four-dimensional solution. An important quantity for\nphenomenology is the temperature. To this purpose the\nsurface gravity reads\nκ=\n\n\nr+ (d − 2)\n2 + a2 )\n2(r+\n\n\n1 +\n\nB.\n\n\u0012\n\nd−4\nd−2\n\n\u0013\n\n2\n\n2\nr+\n\n2\n\nγ\n\n\u0010\n\n2\nd r+\n2 , 4l2\n\n\u0011′ \n\n+a\na\n\n\u0010 r2 \u0011  . (74)\n2 − r (d − 2)\nr+\n+\nd\n+\nγ 2 , 4l2\n\nHigher-dimensional regular Kerr-Newmann\nblack hole\n\nThe extension to higher dimension of the NCKN black\nhole follows the above line of reasoning. We start from\nds2(d+1) = G(r)dt2 −\n\ndr2\n− r2 (dθ2 + sin2 θφ2 )\nG(r) |{z}\n\nd−3\n2\n− r|2 cos\n{z θ} dΩ ,\n\ngΩ2\n\n\u0013\n\n2μ(r)\nq(r)2\n+ 2(d−2) ,\nd−2\nr\nr\nM\nμ(r) = d−1\nγ(d/2; r2 /4θ),\nM∗ Γ(d/2)\n\u0013\u0015\n\u0014\n\u0012\nd r2\nQ2\n,\n;\nq(r)2 = (d − 2) d−2 Fd (r) + dd rd−2 γ\nπ\n2 4θ\n\u0012\n\u0013\n\u0013\n\u0012\n8−3d\n2 2 rd−2 2 d\nr2\nr2\nd\nγ\n−\n,\n− 1;\n−\n1;\nFd (r) = γ 2\nd−2\n2\n4θ\n2\n4θ\n(d − 2)θ 2\n\u0001\n8−3d\n1 Γ d2 − 1\n2 2\n\u0001 ,\ndd =\n(76)\nd − 2 θ d−2\nΓ d2\n2\nG(r) =\n\n1−\n\n∆ = r 2 + a2 −\n\n2μ(r)\nq(r)2\n.\n+\nrd−4\nr2(d−3)\n\n(78)\n\nAs a final note some comments are in order. The neutral metric (72) approaches the Myers-Perry black hole\nwith a single angular momentum at large distances [18]\n(see [19] for the derivation of the Myers-Perry black\nhole by employing the Newman-Janis procedure). On\nthe other hand we must have care about classical limits of the above charged solution. In Einstein gravity\nhigher-dimensional spinning charged black holes have analytically been derived only in the slowly rotating case\n[20]. For arbitrary values of the rotation parameter the\nEinstein tensor coming from the Kerr-Shild decomposition or either from the Newman-Janis procedure fails to\nfit the higher-dimensional Maxwell spinning stress tensor. Only numerical solutions are known in the case\nof arbitrary rotation parameter [21]. As a consequence,\nsince we have employed the Newman-Janis procedure and\nthe higher-dimensional NCKN solution approaches the\nhigher-dimensional Kerr-Newman line element at large\ndistances we have the same problem as in the classical case. Therefore we can safely consider the solution only for small rotation parameter. As a result\none obtains the higher-dimensional NCKN solution as\na higher-dimensional NCRN solution [9] with additional\nfirst-order corrections in the rotation parameter.\n\n(75)\n\ngΩd−3\n\n\u0012\n\nq(r)2\n2μ(r)\n+\nr2 rd−4\nr2 r2(d−3)\nq[(r′ + r̄′ )/2]2\n2μ[(r′ + r̄′ )/2]\n+\n7→ 1 − ′ ′ ′\nr r̄ [(r + r̄′ )/2]d−4 r′ r̄′ [(r′ + r̄′ )/2]2(d−3)\n2μ(r)\nq(r)2\n= 1 − 2 d−4 + 2 2(d−3) ,\nR r\nR r\ngΩ2 7→ r′ r̄′ = R2 ,\ngΩd−3 = r2 cos2 θ 7→ [(r′ + r̄′ )/2] cos2 θ = r2 cos2 θ2 ,\n(77)\nR2 = r2 + a2 cos2 θ.\n\nG(r) = 1 −\n\nVI.\n\nCONCLUSIONS\n\nIn this paper we have derived regular rotating charged\nand higher-dimensional black hole solution in the presence of a noncommutative geometry induced minimal\nlength [16, 17]. To get this result, we reviewed the\nNewman-Janis algorithm in order to include a wider class\nof spacetimes generated by nonvanishing stress tensors.\nThen we applied this method to obtain the rotating neutral black hole, which matches the known solution found\nin [10]. We have studied how noncommutative effects\nhave smeared out the singularity, by calculating both\nthe Ricci scalar and the Kretschmann invariant: they\nare both finite at the origin. Then we extended the\n\n\f11\nanalysis in [10] to the thermodynamic properties of this\nspinning solution, providing the black hole temperature.\nAs a second step, we have applied our method to the\ncase of a charged and spinning object, determining the\nnoncommutative geometry inspired Kerr-Newman black\nhole. We studied the geometrical properties of the solution as well as the thermodynamic ones. In both frameworks the solution shows regularity. Finally we have determined the higher-dimensional extension of these metrics, providing their Hawking temperature.\nWith this paper, the program of noncommutative geometry inspired black holes, initiated in 2005 with the\nstatic, neutral solution, reached its completion. As a final\nremark, there are some comments about future applications. On the astrophysical side, charged black holes are\noften regarded as remote possibilities. On the ground of\nNewtonian gravity consideration it has been shown that\nthe Coulomb repulsion would prevents the formation of\nblack holes whose charge/mass ratio exceeds 10−18 . This\nwould mean that stellar black holes could have roughly\n102 C, a tiny charge compared for instance to the Earth\ncharge which is about half a million C. However due to\nthe rotation, an intense magnetic field might occur, for\nthe presence of superficial currents on the hole. The phenomenology of these magnetic fields would in principle\ndeserve further investigations. On the other hand, the intrinsic quantum gravitational nature of these solutions at\nsmall length scales suggests that they could play a significant role in case of microscopic black hole phenomenology. Without entering the debate about the conjectured\nproduction of a mini black hole at the LHC, we recall that\nnon-rotating higher-dimensional noncommutative geometry inspired black holes have been already the subject\nof investigations in TeV gravity phenomenology (analyses\nwith Monte Carlo event generators can be found in [22]).\nEven in the most pessimistic scenario of the absence of\nquantum gravity data at the Terascale, our new solutions\ncan play a role at least in the context of primordial black\nholes. Indeed it is widely accepted that the early universe\ncould have been populated by tiny black holes, which are\nnowadays completely evaporated. More specifically, the\nconventional scenario for the evaporation of a black hole\nconsists of four distinct phases, the spin-down phase (loss\nof angular momentum), the balding phase (loss of longrange fields, i.e. hair, i.e. the electromagnetic charge),\nthe Schwarzschild phase and the Planck phase. In light\nof the already determined NCBH solution this general\nevaporation scheme has been already reviewed. For instance the final phase is turned into a new phase, called\nthe SCRAM [24] phase, in which the black hole cools\ndown to a zero temperature configuration instead of experiencing a runaway increase of the Hawking temperature [23]. A further modification concerns the sequence\nof these phases since the discharging time depends on the\nnumber of extradimensions and on the kind of emission\n\n(brane, bulk-brane, bulk) governing both the Hawking\nand the Schwinger pair production mechanisms. Therefore the new NCKN solution is expected to provide the\nfinal answer about the black hole evolution from the very\nbeginning to the very end, i.e. taking into account the\nyet unexplored spin-down mechanism too.\n\nAcknowledgments\n\nP.N. is supported by the Helmholtz International Center for FAIR within the framework of the LOEWE program (Landesoffensive zur Entwicklung WissenschaftlichÖkonomischer Exzellenz) launched by the State of Hesse.\nP.N. would like to thank the Perimeter Institute for Theoretical Physics, Waterloo, ON, Canada for the kind hospitality during the period of work on this project. Research\nat Perimeter Institute is supported by the Government\nof Canada through Industry Canada and by the Province\nof Ontario through the Ministry of Research & Innovation. The authors thank R. Balbinot, S. P. Drake and\nE. Spallucci for valuable suggestions and M. Sampaio for\npointing out a typesetting inaccuracy in the manuscript.\n\nAppendix A: Note on Gamma functions\n\nThe lower incomplete Gamma function is\n\u0010 n \u0011 Z x dt\nγ\n;x =\ntn/2 et .\n2\nt\n0\nThe upper incomplete Gamma function is\n\u0010 n \u0011 Z ∞ dt\n;x =\ntn/2 et .\nΓ\n2\nt\nx\nThe relation between the two is\n\u0010 n \u0011\n\u0010n \u0011\n\u0010n\u0011\nγ\n−Γ\n;x = Γ\n;x .\n2\n2\n2\n\n(A1)\n\n(A2)\n\n(A3)\n\nFrom the relation\n\nΓ (z + 1) = z Γ (z)\nwe find\n\u0012\n\u0013\n\u0012 \u0013\n\u0012 \u0013\n1√\n1\n1\n1\n3\n=Γ\n=\n+1 = Γ\nπ.\nΓ\n2\n2\n2\n2\n2\n\n(A4)\n\n(A5)\n\nAppendix B: Kretschmann invariant\n\nThe Kretschmann invariant for the spinning black\n√ hole\n(Q = 0), r > 0 and introducing the notation l = θ is\n\n\f12\n\nr2\n\ne− 2l2 m2\n\n128r16 + 256a2r14 + 288a4 r12 + 2048l4r12 − 1024a2l2 r12\n8l10 π (cos(2θ)a2 + a2 + 2r2 )6\n√\nr2\n+96a4 cos(4θ)r12 − 2048e 4l2 l5 πr11 + 160a6 r10 − 1024a2 l4 r10 − 2304a4l2 r10 + 96a6 cos(4θ)r10\n√\n√\nr2\nr2\n−768a4l2 cos(4θ)r10 + 16a6 cos(6θ)r10 − 8192e 4l2 l7 πr9 + 1024a2e 4l2 l5 πr9 + 35a8 r8 − 768a4 l4 r8\n−1920a6l2 r8 + 28a8 cos(4θ)r8 − 256a4 l4 cos(4θ)r8 − 1152a6l2 cos(4θ)r8 + 8a8 cos(6θ)r8 − 192a6l2 cos(6θ)r8\n√\n√\n√\nr2\nr2\nr2\n+a8 cos(8θ)r8 + 1280a4e 4l2 l5 π cos(4θ)r7 + 53248a2e 4l2 l7 πr7 + 3840a4e 4l2 l5 πr7 + 3200a6l4 r6\n−560a8l2 r6 + 1920a6l4 cos(4θ)r6 − 448a8l2 cos(4θ)r6 + 320a6 l4 cos(6θ)r6 − 128a8 l2 cos(6θ)r6\n√\n√\nr2\nr2\nr2\n−16a8l2 cos(8θ)r6 + 24576e 2l2 l10 πr6 + 5120a4e 4l2 l7 π cos(4θ)r5 + 1152a6e 4l2 l5 π cos(4θ)r5\n√\n√\n√\nr2\nr2\nr2\n+192a6e 4l2 l5 π cos(6θ)r5 + 15360a4e 4l2 l7 πr5 + 1920a6e 4l2 l5 πr5 + 2240a8l4 r4 + 1792a8l4 cos(4θ)r4\n√\nr2\nr2\n+512a8l4 cos(6θ)r4 + 64a8 l4 cos(8θ)r4 − 184320a2e 2l2 l10 πr4 − 13824a6e 4l2 l7 π cos(4θ)r3\n√\n√\nr2\nr2\nr2\nr2\n−2304a6e 4l2 l7 π cos(6θ)r3 − 23040a6e 4L2 l7 πr3 + 46080a4e 2l2 l10 π cos(4θ)r2 + 138240a4e 2L2 l10 πr2\n\u0001\n\u0001\nr2\n−3072e 2l2 l10 cos(6θ)a6 + 10a6 − 180r2 a4 + 6 a2 − 10r2 cos(4θ)a4 + 240r4 a2 + 15 a4 − 16r2 a2 + 16r4\n\u00132\n\u0012\n\u0010\n\u0010\n\u0001\n\u00012\n\u0001\nr2 √\nr2\n3 r2\n2\n6\n, 2\n+ 8a2 7r4 r2 − 8l2 a6 − 30 48e 2l2 πl10 + 12e 4l2 πr3 12l2 − r2 l5\ncos(2θ)a − 32r Γ\n2 4l\n\u0010\n\u0011\n\u0001\u0011\n\u0001\nr2\nr2 √\n6\n4\n2 2\n−r 20l − 12r l + r4 a4 + 16r2 1440e 2l2 πl10 + 40e 4l2 πr3 4l2 + r2 l5 − 8r6 l4 − 24r8 l2 + 3r10 a2\n\u0011\u0011\n\u0010\n\u0001\nr2\nr2\nr2 √\ncos(2θ) − 4608a6e 2l2 l10 π cos(4θ)\n+32r4 −720e 2l2 πl10 + 4e 4l2 πr3 52l2 + r2 l5 − 4r6 l4 − 4r8 l2 + r10\n\u0010\n√\nr2\nr2\nr2\n−768a6e 2l2 l10 π cos(6θ) − 128e 4l2 l5 − 32r11 + 16a2 r9 − 128l2r9 + 60a4 r7 + 832a2 l2 r7 + 768e 4l2 l5 πr6\nK(r, θ) =\n\n√\n√\nr2\nr2\n+30a6r5 + 240a4l2 r5 + 3a6 cos(6θ)r5 − 5760a2e 4l2 l5 πr4 − 360a6 l2 r3 − 36a6 l2 cos(6θ)r3 + 4320a4e 4l2 l5 πr2\n\u0010\n\u0011\n\u0011\n\u0010 \u0010 r2 √\nr2 √\nr2 √\n−a2 45 8e 4l2 πl5 + 12r3 l2 − r5 a4 − 80r2 72e 4l2 πl5 + 4r3 l2 + r5 a2 − 16r4 (−360e 4l2 πl5 + 52r3 l2\n\u0010\n\u0010 r2 √\n\u0011\n\u0011\u0011\n\u0010\n\u0011\nr2 √\ncos(4θ)\n+r5 ) cos(2θ) − 2a4 9a2 8e 4l2 πl5 + 12r3 l2 − r5 − 10r2 72e 4l2 πl5 + 4r3 l2 + r5\n!\n\u0012\n\u0013\n√\n√ \u0011\nr2\nr2\nr2\n3 r2\n−24a6e 4l2 l5 π cos(6θ) − 240a6 e 4l2 l5 π Γ\n, 2 − 7680a6e 2l2 l10 π .\n(B1)\n2 4l\n\nAppendix C: Stress-energy tensor components\n\nTtt =\n\n1\n16π (a2 cos(2θ) + a2 + 2r2 )\n\nh\n4\n′′\n4\n′′\n4\n2 ′′\n4\n2 ′′\n3 2a r cos(4θ)m (r) − 2a rm (r) − a cos(4θ)[q(r) ] + a [q(r) ]\n\n(C1)\n\n+8a2 r3 cos(2θ)m′′ (r) − 8a2 r3 m′′ (r) − 4a2 r2 cos(2θ)[q(r)2 ]′′ + 4a2 r2 [q(r)2 ]′′ + 8a2 r cos(2θ)[q(r)2 ]′\ni\n\u0001\n\u0001\n−24a2 r[q(r)2 ]′ − 8[q(r)2 ] a2 cos(2θ) − 3a2 − 2r2 + 4m′ (r) a4 cos(4θ) − a4 + 8a2 r2 + 8r4 − 16r3 [q(r)2 ]′ ,\n\n\f13\nTrr\n\nTθθ =\n\n1\n2\n\n8π (a2 cos(2θ) + a2 + 2r2 )\n\nh\n\n=\n\n\u0001\nr 2rm′ (r) − [q(r)2 ]′ + [q(r)2 ]\n2π (a2 cos(2θ) + a2 + 2r2 )\n\n2\n\n,\n\n2a2 r cos(2θ)m′′ (r) + 2a2 rm′′ (r) + 8a2 cos2 (θ)m′ (r) − a2 cos(2θ)[q(r)2 ]′′\n\ni\n−a2 [q(r)2 ]′′ + 4r3 m′′ (r) − 2r2 [q(r)2 ]′′ + 4r[q(r)2 ]′ (r) − 4q(r)2 ,\nTφφ =\n\n1\n4π (a2 cos(2θ) + a2 +\n\n3\n2r2 )\n\n(C2)\n\nh\n2a4 r cos(2θ)m′′ (r) + 2a4 rm′′ (r) − a4 cos(2θ)[q(r)2 ]′′ − a4 [q(r)2 ]′′\n\n(C3)\n\n(C4)\n\n\u0001\n\u0001\na2 + 2r2 cos(2θ) + a2 − a2 r2 cos(2θ)[q(r)2 ]′′ − 3a2 r2 [q(r)2 ]′′\ni\n\u0001\n−2a2 r cos(2θ)[q(r)2 ]′ + 6a2 r[q(r)2 ]′ + 2[q(r)2 ] a2 cos(2θ) − 3a2 − 2r2 + 4r5 m′′ (r) − 2r4 [q(r)2 ]′′ + 4r3 [q(r)2 ]′ ,\n\n+2a2 r3 cos(2θ)m′′ (r) + 6a2 r3 m′′ (r) + 4a2 m′ (r)\n\nTtφ = −\n\na\n4π (a2 cos(2θ) + a2 + 2r2 )\n\nh\n\u0001\n2\n′′\n2\n′′\n′\n2\n2\n2\n3 2a r cos(2θ)m (r) + 2a rm (r) + 4m (r) a cos(2θ) + a − 2r\n\ni\n−a2 cos(2θ)[q(r)2 ]′′ − a2 [q(r)2 ]′′ + 4r3 m′′ (r) − 2r2 [q(r)2 ]′′ + 8r[q(r)2 ]′ − 8[q(r)2 ] .\n\n[1] L. Modesto, Phys. Rev. D 70, 124009 (2004)\n[arXiv:gr-qc/0407097].\nL. Modesto, Int. J. Theor. Phys. 45, 2235 (2006)\n[arXiv:gr-qc/0411032].\nL. Modesto, arXiv:gr-qc/0504043.\nL. Modesto, Class. Quant. Grav. 23, 5587 (2006)\n[arXiv:gr-qc/0509078].\nL. Modesto, Int. J. Theor. Phys. 47, 357 (2008)\n[arXiv:gr-qc/0610074].\nL. Modesto, Adv. High Energy Phys. 2008, 1 (2008)\n[arXiv:gr-qc/0611043].\nL. Modesto, arXiv:gr-qc/0612084.\nL. Modesto, arXiv:hep-th/0701239.\nL. Modesto, arXiv:0811.2196 [gr-qc].\nL. Modesto and I. Premont-Schwarz, Phys. Rev. D 80,\n064041 (2009) [arXiv:0905.3170 [hep-th]].\nL. Modesto and I. Premont-Schwarz, arXiv:0909.5421\n[Unknown].\nS. Hossenfelder, L. Modesto and I. Premont-Schwarz,\nPhys. Rev. D 81, 044036 (2010) [arXiv:0912.1823 [Unknown]].\nL. Modesto, \"Semiclassical loop quantum black hole,\" in\npress on International Journal of Theoretical Physics.\n[2] P. Nicolini, Int. J. Mod. Phys. A 24, 1229 (2009)\n[arXiv:0807.1939 [hep-th]].\n[3] P. Nicolini, A. Smailagic and E. Spallucci, Phys. Lett. B\n632, 547 (2006) [arXiv:gr-qc/0510112].\n[4] P. Nicolini,\nA. Smailagic and E. Spallucci,\narXiv:hep-th/0507226.\nP. Nicolini,\nJ. Phys. A 38,\nL631 (2005)\n[arXiv:hep-th/0507266].\n[5] Y. S. Myung and M. Yoon, Eur. Phys. J. C 62, 405 (2009)\n[arXiv:0810.0078 [gr-qc]].\nR. Garattini and F. S. N. Lobo, Phys. Lett. B 671, 146\n\n[6]\n[7]\n[8]\n[9]\n[10]\n[11]\n\n[12]\n\n[13]\n\n(C5)\n\n(2009) [arXiv:0811.0919 [gr-qc]].\nM. I. Park, Phys. Rev. D 80, 084026 (2009)\n[arXiv:0811.2685 [hep-th]].\nI. Arraut, D. Batic and M. Nowakowski, Class. Quant.\nGrav. 26, 245006 (2009) [arXiv:0902.3481 [gr-qc]].\nD. Batic and P. Nicolini, Phys. Lett. B 692, 32 (2010).\nM. Bleicher and P. Nicolini, arXiv:1001.2211 [hep-ph].\nI. Arraut, D. Batic and M. Nowakowski, J. Math. Phys.\n51, 022503 (2010) [arXiv:1001.2226 [gr-qc]].\nW. H. Huang, arXiv:1003.1040 [hep-th].\nP. Nicolini and E. Spallucci, Class. Quant. Grav. 27,\n015010 (2010) [arXiv:0902.4654 [gr-qc]].\nS. Ansoldi, P. Nicolini, A. Smailagic and E. Spallucci,\nPhys. Lett. B 645, 261 (2007) [arXiv:gr-qc/0612035].\nT.\nG.\nRizzo,\nJHEP\n0609,\n021\n(2006)\n[arXiv:hep-ph/0606051].\nE. Spallucci, A. Smailagic and P. Nicolini, Phys. Lett. B\n670, 449 (2009) [arXiv:0801.3519 [hep-th]].\nA. Smailagic and E. Spallucci, Phys. Lett. B 688, 82\n(2010) [arXiv:1003.3918 [Unknown]].\nE. T. Newman and A. Janis, J. Math. Phys. 6, 915\n(1965).\nL. Herrera and J. Jimenez, J. Math. Phys. 23, 2339\n(1982).\nA. Burinskii, E. Elizalde, S. R. Hildebrandt and G. Magli,\nPhys. Rev. D 65, 064039 (2002) [arXiv:gr-qc/0109085].\nA. Burinskii, Sov. Phys. JETP 39, 193 (1974)\nW. Israel, Phys. Rev. D 2, 641 (1970).\nV. De La Cruz, J. E. Chase and W. Israel, Phys. Rev.\nLett. 24, 423 (1970).\nC. A. Lopez, Phys. Rev. D 30, 313 (1984).\nJ. Tiomno, Phys. Rev. D 7, 992 (1973).\nS. P. Drake and P. Szekeres, Gen. Rel. Grav. 32, 445\n(2000) [arXiv:gr-qc/9807001].\n\n\f14\n[14] J. W. Moffat, Phys. Lett. B 491, 345 (2000).\n[15] F. Nasseri, Gen. Rel. Grav. 37, 2223 (2005).\nF. Nasseri, Int. J. Mod. Phys. D 15, 1113 (2006).\nM. Chaichian, A. Tureanu and G. Zet, Phys. Lett. B 660,\n573 (2008).\nM. Chaichian, M. R. Setare, A. Tureanu and G. Zet,\nJHEP 0804, 064 (2008).\nP. Mukherjee and A. Saha, Phys. Rev. D 77, 064014\n(2008).\nA. Kobakhidze, Phys. Rev. D 79, 047701 (2009).\n[16] A. Smailagic and E. Spallucci, J. Phys. A 36, L467 (2003)\n[arXiv:hep-th/0307217].\nA. Smailagic and E. Spallucci, J. Phys. A 36, L517 (2003)\n[arXiv:hep-th/0308193].\nA. Smailagic and E. Spallucci, J. Phys. A 37,\n1 (2004) [Erratum-ibid. A 37,\n7169 (2004)]\n[arXiv:hep-th/0406174].\nE. Spallucci, A. Smailagic and P. Nicolini, Phys. Rev. D\n73, 084004 (2006) [arXiv:hep-th/0604094].\n[17] R. Banerjee, S. Gangopadhyay and S. K. Modak, Phys.\nLett. B 686, 181 (2010).\nR. Banerjee, B. Chakraborty, S. Ghosh, P. Mukherjee\nand S. Samanta, Found. Phys. 39, 1297 (2009).\nM. Rinaldi, arXiv:0908.1949 [gr-qc].\nP. Nicolini and M. Rinaldi, arXiv:0910.2860 [hep-th].\nM. Rinaldi, arXiv:1003.2408 [hep-th].\nL. Modesto and P. Nicolini, Phys. Rev. D 81, 104040\n(2010) [arXiv:0912.0220 [hep-th]].\nP. Nicolini and E. Spallucci, arXiv:1005.1509 [hep-th].\n\n[18]\n[19]\n[20]\n[21]\n\n[22]\n[23]\n\n[24]\n\nP. Nicolini, arXiv:1005.2996 [gr-qc].\nM. Kober and P. Nicolini, arXiv:1005.3293 [hep-th].\nR. C. Myers and M. J. Perry, Annals Phys. 172, 304\n(1986).\nX. Dianyan, Class. Quant. Grav. 5, 871 (1988).\nA. N. Aliev, Phys. Rev. D 74, 024011 (2006)\n[arXiv:hep-th/0604207].\nJ. Kunz, F. Navarro-Lerida and A. K. Petersen, Phys.\nLett. B 614 (2005) 104 [arXiv:gr-qc/0503010].\nJ. Kunz, F. Navarro-Lerida and J. Viebahn, Phys. Lett.\nB 639, 362 (2006) [arXiv:hep-th/0605075].\nJ. Kunz, F. Navarro-Lerida and E. Radu, Phys. Lett. B\n649, 463 (2007) [arXiv:gr-qc/0702086].\nD. M. Gingrich,\nJHEP 1105,\n022 (2010)\n[arXiv:1003.1798 [hep-ph]].\nR. Casadio and P. Nicolini, JHEP 0811, 072 (2008)\n[arXiv:0809.2471 [hep-th]].\nR. Banerjee, B. R. Majhi and S. Samanta, Phys. Rev. D\n77, 124035 (2008) [arXiv:0801.3583 [hep-th]].\nR. Banerjee, B. R. Majhi and S. K. Modak, Class. Quant.\nGrav. 26, 085010 (2009) [arXiv:0802.2176 [hep-th]].\nThe term SCRAM, probably the acronym for \"Safety\nControl Rod Axe Man\" or \"Super Critical Reactor Axe\nMan\" refers to an emergency shutdown of a thermonuclear reactor. The term has been extended to cover shutdowns of other complex operations or systems in an unstable state, but it also has a standard meaning \"go away\nquickly,\" in particular, when we address children or animals.\n\n\f"}