{"id": "http://arxiv.org/abs/0912.2734v1", "guidislink": true, "updated": "2009-12-14T21:40:55Z", "updated_parsed": [2009, 12, 14, 21, 40, 55, 0, 348, 0], "published": "2009-12-14T21:40:55Z", "published_parsed": [2009, 12, 14, 21, 40, 55, 0, 348, 0], "title": "On Loops in Inflation", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0912.5337%2C0912.1443%2C0912.4092%2C0912.3166%2C0912.2883%2C0912.0166%2C0912.5359%2C0912.5263%2C0912.2683%2C0912.3566%2C0912.0493%2C0912.5298%2C0912.3277%2C0912.3711%2C0912.4613%2C0912.2653%2C0912.5260%2C0912.3568%2C0912.2155%2C0912.0679%2C0912.2173%2C0912.1921%2C0912.0990%2C0912.2237%2C0912.4250%2C0912.0750%2C0912.3719%2C0912.4018%2C0912.5276%2C0912.3133%2C0912.2800%2C0912.4812%2C0912.0436%2C0912.0103%2C0912.2185%2C0912.0642%2C0912.2472%2C0912.1438%2C0912.5454%2C0912.0728%2C0912.5250%2C0912.2558%2C0912.1235%2C0912.2439%2C0912.5500%2C0912.3657%2C0912.4974%2C0912.5335%2C0912.0262%2C0912.4240%2C0912.1696%2C0912.5435%2C0912.2661%2C0912.2229%2C0912.2284%2C0912.5386%2C0912.3758%2C0912.4112%2C0912.2460%2C0912.3722%2C0912.2593%2C0912.2208%2C0912.1927%2C0912.2365%2C0912.3284%2C0912.2083%2C0912.0155%2C0912.3752%2C0912.4989%2C0912.0267%2C0912.3027%2C0912.3393%2C0912.0091%2C0912.0351%2C0912.0700%2C0912.1722%2C0912.3984%2C0912.2124%2C0912.3695%2C0912.0559%2C0912.3536%2C0912.4960%2C0912.2161%2C0912.2419%2C0912.4404%2C0912.1794%2C0912.4657%2C0912.4962%2C0912.2617%2C0912.3888%2C0912.3280%2C0912.4437%2C0912.2734%2C0912.1620%2C0912.2470%2C0912.1866%2C0912.0998%2C0912.3026%2C0912.2506%2C0912.2648%2C0912.5219&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "On Loops in Inflation"}, "summary": "We study loop corrections to correlation functions of inflationary\nperturbations. Previous calculations have found that the two-point function can\nhave a logarithmic running of the form log(k/mu), where k is the wavenumber of\nthe perturbation, and mu is the renormalization scale. We highlight that this\nresult would have profound consequences for both eternal inflation and the\npredictivity of standard inflation. We find a different result. We consider two\nsets of theories: one where the inflaton has a large cubic self-interaction and\none where the inflaton interacts gravitationally with N massless spectator\nscalar fields. We find that there is a logarithmic running but of the form\nlog(H/mu), where H is the Hubble constant during inflation. We find this result\nin three independent ways: by performing the calculation with a sharp cutoff in\nfrequency-momentum space, in dimensional regularization and by the simple\nprocedure of making the loop integral dimensionless. For the simplest of our\ntheories we explicitly renormalize the correlation function proving that the\ndivergencies can be reabsorbed and that the correlation function for\nsuper-horizon modes does not depend on time (once the tadpole terms have been\nproperly taken into account). We prove the time-independence of the\nsuper-horizon correlation function in several additional ways: by doing the\ncalculation of the correlation function at finite time using both the\nregularizations and by developing a formalism which expresses loop corrections\ndirectly in terms of renormalized quantities at each time. We find this last\nformalism particularly helpful to develop intuition which we then use to\ngeneralize our results to higher loops and different interactions.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0912.5337%2C0912.1443%2C0912.4092%2C0912.3166%2C0912.2883%2C0912.0166%2C0912.5359%2C0912.5263%2C0912.2683%2C0912.3566%2C0912.0493%2C0912.5298%2C0912.3277%2C0912.3711%2C0912.4613%2C0912.2653%2C0912.5260%2C0912.3568%2C0912.2155%2C0912.0679%2C0912.2173%2C0912.1921%2C0912.0990%2C0912.2237%2C0912.4250%2C0912.0750%2C0912.3719%2C0912.4018%2C0912.5276%2C0912.3133%2C0912.2800%2C0912.4812%2C0912.0436%2C0912.0103%2C0912.2185%2C0912.0642%2C0912.2472%2C0912.1438%2C0912.5454%2C0912.0728%2C0912.5250%2C0912.2558%2C0912.1235%2C0912.2439%2C0912.5500%2C0912.3657%2C0912.4974%2C0912.5335%2C0912.0262%2C0912.4240%2C0912.1696%2C0912.5435%2C0912.2661%2C0912.2229%2C0912.2284%2C0912.5386%2C0912.3758%2C0912.4112%2C0912.2460%2C0912.3722%2C0912.2593%2C0912.2208%2C0912.1927%2C0912.2365%2C0912.3284%2C0912.2083%2C0912.0155%2C0912.3752%2C0912.4989%2C0912.0267%2C0912.3027%2C0912.3393%2C0912.0091%2C0912.0351%2C0912.0700%2C0912.1722%2C0912.3984%2C0912.2124%2C0912.3695%2C0912.0559%2C0912.3536%2C0912.4960%2C0912.2161%2C0912.2419%2C0912.4404%2C0912.1794%2C0912.4657%2C0912.4962%2C0912.2617%2C0912.3888%2C0912.3280%2C0912.4437%2C0912.2734%2C0912.1620%2C0912.2470%2C0912.1866%2C0912.0998%2C0912.3026%2C0912.2506%2C0912.2648%2C0912.5219&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We study loop corrections to correlation functions of inflationary\nperturbations. Previous calculations have found that the two-point function can\nhave a logarithmic running of the form log(k/mu), where k is the wavenumber of\nthe perturbation, and mu is the renormalization scale. We highlight that this\nresult would have profound consequences for both eternal inflation and the\npredictivity of standard inflation. We find a different result. We consider two\nsets of theories: one where the inflaton has a large cubic self-interaction and\none where the inflaton interacts gravitationally with N massless spectator\nscalar fields. We find that there is a logarithmic running but of the form\nlog(H/mu), where H is the Hubble constant during inflation. We find this result\nin three independent ways: by performing the calculation with a sharp cutoff in\nfrequency-momentum space, in dimensional regularization and by the simple\nprocedure of making the loop integral dimensionless. For the simplest of our\ntheories we explicitly renormalize the correlation function proving that the\ndivergencies can be reabsorbed and that the correlation function for\nsuper-horizon modes does not depend on time (once the tadpole terms have been\nproperly taken into account). We prove the time-independence of the\nsuper-horizon correlation function in several additional ways: by doing the\ncalculation of the correlation function at finite time using both the\nregularizations and by developing a formalism which expresses loop corrections\ndirectly in terms of renormalized quantities at each time. We find this last\nformalism particularly helpful to develop intuition which we then use to\ngeneralize our results to higher loops and different interactions."}, "authors": ["Leonardo Senatore", "Matias Zaldarriaga"], "author_detail": {"name": "Matias Zaldarriaga"}, "author": "Matias Zaldarriaga", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1007/JHEP12(2010)008", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0912.2734v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0912.2734v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "51 pages, 7 figures", "arxiv_primary_category": {"term": "hep-th", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "hep-th", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "astro-ph.CO", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "gr-qc", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "hep-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0912.2734v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0912.2734v1", "journal_reference": "JHEP 1012:008,2010", "doi": "10.1007/JHEP12(2010)008", "fulltext": "On Loops in Inflation\nLeonardo Senatore and Matias Zaldarriaga\n\narXiv:0912.2734v1 [hep-th] 14 Dec 2009\n\nSchool of Natural Sciences, Institute for Advanced Study,\nOlden Lane, Princeton, NJ 08540, USA\n\nAbstract\nWe study loop corrections to correlation functions of inflationary perturbations. Previous calculations\nhave found that the two-point function can have a logarithmic running of the form log(k/μ), where k is\nthe wavenumber of the perturbation, and μ is the renormalization scale. We highlight that this result\nwould have profound consequences for both eternal inflation and the predictivity of standard inflation.\nWe find a different result. We consider two sets of theories: one where the inflaton has a large cubic selfinteraction and one where the inflaton interacts gravitationally with N massless spectator scalar fields.\nWe find that there is a logarithmic running but of the form log(H/μ), where H is the Hubble constant\nduring inflation. We find this result in three independent ways: by performing the calculation with a\nsharp cutoff in frequency-momentum space, in dimensional regularization and by the simple procedure\nof making the loop integral dimensionless. For the simplest of our theories we explicitly renormalize the\ncorrelation function proving that the divergencies can be reabsorbed and that the correlation function\nfor super-horizon modes does not depend on time (once the tadpole terms have been properly taken into\naccount). We prove the time-independence of the super-horizon correlation function in several additional\nways: by doing the calculation of the correlation function at finite time using both the regularizations and\nby developing a formalism which expresses loop corrections directly in terms of renormalized quantities\nat each time. We find this last formalism particularly helpful to develop intuition which we then use\nto generalize our results to higher loops and different interactions. In particular we argue correlation\nfunctions have no long-term time dependence even if the spectator fields have a potential.\n\n1\n\nIntroduction\n\nThe purpose of this paper is to compute loop corrections to inflationary observables. Why? At first there\nseems to be no good reason. Let us consider a standard inflaton φ with action:\n\u0015\n\u0014\nZ\n1\n4 √\n2\nS = d x −g (∂φ) − V (φ) .\n(1)\n2\nIn order to have an inflationary solution, all derivatives of the potential need to be small:\n\u0012 0 \u00132\n00\nV\n2\n2 V\n\u000f = MPl\n\u001c1,\nη = MPl\n\u001c1,\n... .\nV\nV\n\n1\n\n(2)\n\n\fThis means that the inflaton is extremely weakly coupled. In fact Maldacena showed that the leading\ninteractions come from the mixing with gravity [1]. The size of the inflaton two-point function is of order\nhδφ2k itree ∼\n\nH2\n.\nk3\n\n(3)\n\nOservations of the CMB imply that the amplitude of the primordial curvature perturbation ζ is:\nhζk2 itree ∼\n\nH2 1\n−10\n,\n2 k 3 ∼ 10\n\u000fMPl\n\n(4)\n\nwhere \u000f is the slow-roll parameter and thus H/MPl \u001c 10−5 during inflation. Loop corrections will be\n2 . By dimensional analysis we expect:\nmediated by gravity, and will therefore be suppressed by MPl\nhδφ2k i1−loop ∼\n\nH2 H2\n2 .\nk 3 MPl\n\n(5)\n\nThis is at least a factor of 10−10 smaller than the tree level result. Clearly nobody should bother\ncomputing it.\nThis has been the general attitude for about the first twenty-five years after the invention of inflation\nuntil Weinberg stressed a different point of view. In the paper where he first studied these effects [2],\nhe argued that since experiments seem to be providing more and more evidence in favor of the theory\nit is worth exploring all its predictions, even those that naively appear observationally unverifiable.\nPerturbation theory ought to be well defined even for inflationary fluctuations, and therefore, given the\nwell known subtleties involved in studying de Sitter space, it is interesting to see how this works in\npractice. Many times as a result of doing a non-trivial calculation one can gain new insight into the\ntheory and explore possible subtleties or generalization. For example, this was the case for Maldacena's\ncalculation of inflationary 3-point function in standard slow-roll inflation. Though for standard slow roll\ninflation the effect was is in practice unobservable it opened the way to formulate alternative theories\nwhich predict much higher levels of non-gaussianities (see for example [3, 4, 5, 6, 7, 8, 9, 10, 11, 12]) and\nare already constrained by existing data [13, 14, 15].\nThe motivation articulated by Weinberg is of course a good one but we find two other issues to be\neven more important. The first is related to eternal inflation. This is a particular regime of inflation\nthat occurs when the potential is flat enough so that quantum fluctuations dominate over the classical\nmotion and there is a finite probability for inflation never to end. This regime of inflation has become\nmore important recently because of Weinberg's proposal to explain anthropically the smallness of the\ncosmological constant [17]. Eternal inflation provides a natural and simple mechanism, though not strictly\nnecessary, to populate a number of vacua large enough to explain the tuning of the cosmological constant.\nThe existent of such a phase was discussed in a more rigorous way only very recently [18, 19], following\nthe original works in [16]. It was shown that if we start with a volume of space with the inflaton of (1) up\nin the potential there is sharp phase transition as we make the potential flatter and flatter: at a critical\nvalue of the slope, the probability of creating an infinite volume goes from being exactly equal to zero to\nnon-zero. It was also shown that the number of e-foldings in any finite realization is bounded by SdS /6,\nwhere SdS is the de Sitter entropy at the end of inflation. This provides additional insight on how to\ninterpret de Sitter space within quantum gravity [20, 19]. A fundamental ingredient of these proofs is\n\n2\n\n\fbased on the fact that, at zeroth order in the slow roll parameters, the two-point function of the inflaton\nfield at coincidence acquires a calculable logarithmic divergency which leads to a linear time dependence:\nhδφ(x, t)2 i =\n\nZ\n\nΛa[t]\n\nd3 k\n\nH2\n∼ H 2 log(a) ∼ H 3 t + const. ,\nk3\n\n(6)\n\nwhere here Λ is a physical cutoff, and a(t) ' eHt is the scale factor during inflation. Notice that the\nlinear time dependence is in strict correspondence with the scale invariance of the two-point function.\nThis linear time dependence was essential for the fact that eternal inflation could transition from being\neternal to not eternal depending on the slope of the inflationary potential. If the time dependence were\nto be different, even by the slightest amount, inflation would be either always eternal or never eternal.\nLoop corrections have the potential of changing the time dependence and is thus interesting to verify\nwhat the dependence is.\nGoing beyond eternal inflation, it is well known that de Sitter space is a rather puzzling spacetime in\nthe context of quantum gravity [20], and inflation offers a natural regularization for the infinities of de\nSitter space. Studying in detail inflationary spacetimes can lead to some new insight about its embedding\ninto a theory of quantum gravity.\nThe first calculation of the one-loop corrections was done in [2]. We find that result rather puzzling:\n\u0012 \u0013\nH2 H2\nπ\nk\n2\nhζk i1−loop = N * 3 * 2 (c + \u000f log\n)\n(7)\nk\n6\nμ\nMPl\nwhere c is a numerical constant that depends on the renormalization procedure, \u000f is the slow roll parameter\n\u000f = −Ḣ/H 2 , and μ is a renormalization scale. N represents the number of massless spectator scalar fields\nwhich interact with the inflaton gravitationally. It is this factor of N that parametrically distinguishes\nthe effect from the spectator fields running in the loop from the effect of the gravitons. This offers a great\nsimplification to the calculation 1 . The same form of the logarithmic running was found in all subsequent\nrelated studies [2, 21, 24] 2 .\nNotice that if we take the above result at face value and we neglect the fact that it is slow roll\nsuppressed then the two point function of the inflaton at coincidence would receive a correction of the\nform:\nZ Λa(t)\nH2\nH2\nH2\nH2\nhδφ(x, t)2 i1−loop = −\nd3 k 2 * N * 3 log(k) ∼ −N * 2 * H 2 (log(a))2 ∼ −N * 2 * H 4 t2 + const.\nk\nMPl\nMPl\nMPl\n(8)\n2\nwhere we have neglected numerical constants but kept explicit the sign of the t correction, which is\nnegative. If we were to use this result to repeat the analysis of [18] we would find the very puzzling result\nthat no model of slow roll inflation is eternal.\nAnother puzzle with expressions (7) or (8) is that they seem to imply that for some large or small\nvalues of k or for some large enough time, the one-loop corrections become large enough to harm the\nperturbative expansion. This result seems to be at odds with the common intuition that, as a consequence\n1\n\nHere we are using the numerical result of [21] which corrected a mistake in [2] associated with the choice of\nthe i \u000f prescription.\n2\nIt is worth to notice that usually in the just mentioned literature the above logarithmic running was simply\nstated as log(k) + C, with C a constant containing the logarithm of a quantity with dimensions of mass.\n\n3\n\n\fof the approximate symmetry under time-translation and rescaling of the inflationary space time, every\nmode goes through the same history. The fact that the logarithm is proportional to a slow-roll parameter\nmight suggest that it is precisely the deviation from de-Sitter which is generating the effect. A closer look\nat the calculation reveals that this is not the case. Furthermore such an effect would imply the existence\nof a non-trivial correlation between very different modes which we find hard to believe.\nAn obvious problems with the result in (7) is that the argument of the logarithm is a ratio of a\ncomoving scale k and a physical scale μ. This cannot be the case and it is the sign of a mistake in the\ncalculation. In fact by its very definition the scale factor of an FRW Universe is unobservable. It just\ncorresponds to a rescaling of the spatial coordinates. This implies that every physically correct result\nshould be invariant under the following rescaling by a real number λ:\na → λa ,\n\nx → x/λ ,\n\nk → λk .\n\n(9)\n\nIf we express the result of (7) in real space, we have to do two momentum integrations by d3 k d3 k 0 (in\n(7) we neglected the momentum δ-function which of course is there because of translation invariance).\nAt this point the prefactor of the log(k/μ) is invariant under (9) while the log(k/μ) is not.\nThe minimal way the above expression could be corrected is by replacing the argument of the log\nwith k/(a(t̄)μ). But what value of t̄ should we use? There are basically three options: t̄ ∼ tearly , t̄ ∼ t\nor t̄ ∼ tk , where tearly is some early time before the mode crosses the horizon, t is the time at which the\ncorrelation function is being calculated and tk is the time when the mode k crossed the horizon. The first\noption is ruled out by adiabaticity: the mode in the past has a very high frequency and is in its adiabatic\nvacuum. It therefore has no memory of the early times. The second option would imply an additional\ntime dependence in the two-point function which would result in no model of slow roll inflation being\neternal. Furthermore after a very long time (but no time is too a long in the case of eternal inflation!) it\nwould also mean that the one loop corrections would become large, comparable to the tree level result.\nThis is at odds with the common intuition of an approximate time-translation and rescaling symmetry\nof the inflationary space-time as well as with the expectation that very different modes should be only\ntrivially correlated. More importantly as we will soon see if this were to be the case it would create\nproblems not only for eternal inflation but for inflation in general!\nIf instead the true result is the third one then since k/a(tk ) ∼ H the logarithm would just become\nlog(H/μ), a result that would make a lot of physical sense. This can be understood by recollecting how\nlogarithms appear in scattering amplitudes. They appear in the form of log(E/μ) where now E is the\ninvariant energy of the collision. This logarithm takes into account the difference between the theory\ndefined at the renormalization scale μ and at the scattering energy E. The logarithmic corrections from\nthe one-loop calculation are not large once the renormalization scale is chosen to be close to the scale at\nwhich the experiment is done, which led to the invention of the renormalization group [25, 26]. We can\nreach a similar conclusion here: the energies probed by the interactions during inflation are of order H\nand therefore the logarithms are small if we renormalize the theory at that scale.\nBefore moving on to the actual computation, we would like to stress a second motivation for studying\nloop corrections that we also find very important. There is another disturbing consequence that would\narise if the way of making the result in (7) correct was to replace the argument of the logarithm with\nk/(a(t)μ). The theory studied by Weinberg and giving rise to (7) is a theory of the form\n\"\n#\nZ\nN\nX\n√\n1\n1\nS = d4 x −g\n(∂φ)2 − V (φ) +\ng μν ∂μ σi ∂ν σi ,\n(10)\n2\n2\ni=1\n\n4\n\n\fwhere there are N massless scalar fields σi interacting gravitationally with the inflaton, sourcing the\nfluctuations of the metric ζ through the vacuum fluctuations of their stress tensor T(σ)μν . Since these\nspectator fields are massless, only their gradients are important and therefore the vacuum fluctuations\nof T(σ)μν are expected to become uncorrelated for distances longer than the horizon scale. If the correct\nanswer were log(k/(a(t)μ)) it would mean that these fluctuations are capable of sourcing a ζ fluctuation\neven on scales much longer than the horizon. This would be very surprising and would create serious\nproblems for the theory of inflation. In fact the predictivity of inflation relies on the fact that the\nperturbation ζ is expected to be constant on scales much longer than the horizon independently of what\nhappens on scales of order of the horizon. This is very important because for some epochs such as\nreheating or a GUT phase transition (if this exist), we have almost no idea of what happens on scales of\nthe order or shorter than the horizon. In principle large fluctuations on horizon scales can exist during\nthese epochs. They are correlated only over horizon scale distances and so one expects they cannot affect\na ζ mode of much longer wavelength. Instead a time dependence from the one loop corrections would\nimply the contrary. Notice that the situation can become really worrisome. The effect of the σ fields, even\nassuming a time dependence, would be very small in standard inflationary scenarios. This is so because\n2 . Basically the σ fields\nthere is not enough time to overcome the tremendous suppression of order H 2 /MPl\nare free fields and therefore do not have large fluctuations. The situation might be completely different for\nfluctuations at the time of reheating or at a GUT phase transition where the relative fluctuations might\nwell be of order one even on Hubble scales. This could induce a change of ζ of order one in a Hubble\ntime: a huge effect that would undermine our capability of making predictions out of the inflationary\nphase without having a detailed understanding of all the epochs in between us and reheating. The same\neffects would probably also alter the scale invariance of the primordial density perturbations.\nThe purpose of this paper is to show that indeed there is no time-dependence nor deviation from scaleinvariance induced by these interactions and that the one-loop logarithmic correction to the two-point\nfunction is of the form log(H/μ). Achieving this will be a rather challenging and sometimes technical\ntask and for this reason we will give several independent derivations, which will also help us in building\nintuition.\nAfter reviewing in sec. 2 the formalism for computing loop corrections, in sec. 3 we will start by\nstudying a different and simpler theory given by [3]\n\u0012\n\u0014\n\u0013\n\u0012\n\u0013\u0015\nZ\n1\n2\n1 2\n2\n4\n3\n2\n2\n4\n3\n4\n2\nS = d x a −ḢMPl π̇ − 2 (∂i π) + c3 M 2π̇ + 3π̇ − 3 2 π̇ (∂i π)\n,\n(11)\na\n3\na\nwhere π is the Goldstone boson of time translation, that are broken during inflation, and is related to\nζ by the simple relationship ζ = −Hπ. We will comment later on how this theory is derived. Here we\njust would like to point out that the scale M which controls the size of the self-interactions can make\nthem parametrically larger than gravitational. In fact, its current upper limit is just observational: the\ncubic self-interaction induces a three-point function in the CMB and is thus constrained by WMAP [14].\nTherefore we can study loop corrections induced by this self-interactions without including gravity. We\nthink this is technically a simpler example.\nWe will calculate loop corrections to the two-point function in this model. We will perform the\ncalculation with two kinds of regularization. The first, in sec. 3.1, will be imposing a fixed physical\ncutoff in frequency and momentum. We will find some power law divergencies, finite terms, and most\nimportantly logarithmic divergencies. As usual, the form of the logarithmic divergencies is computable\nin the infrared even without performing an explicit renormalization, and it represents the running of the\n\n5\n\n\finflationary two-point function. After we remove the power law divergencies through renormalization\nthe logarithmic corrections can become parametrically much larger than the remaining finite terms if the\nrenormalization scale is taken to be very different than the energy typical of the inflationary processes\nwhich is Hubble, up to the point of potentially harming the perturbative expansion of weakly coupled\ntheories. This is a situation historically known as the 'large logarithms'. Then, in sec. 3.2, we will perform\nthe same calculation in dimensional regularization (dim. reg.) finding the same result for the logarithms.\nDimensional regularization was the scheme used in all the literature that followed Weinberg's first\npaper. We point out explicitly where we believe a mistake was made and perform the correct calculation.\nStill working in this regularization, in sec. 3.2.1, we will be able to show by making the loop integral\ndimensionless that even without explicitly doing the calculation one concludes that if a logarithm is\npresent it has to be of the form log(H/μ). Finally, in sec. 3.3, we will perform the renormalization of the\ntwo point function by identifying and solving for the proper local counterterms.\nIn this process we will be able to address another issue that arises in these one-loop calculations.\nBecause of the symmetries of the space time, we will perform the loop phase space integrals using a\npartial Fourier basis where we keep time real but use spatial momentum. In doing these integrals it has\nbeen noticed that because of the nature of the interactions, the integrals in time converge even when the\nexternal time is taken to infinity. It is only the integrals in momentum that have UV divergencies, which\nare supposed to be reabsorbed by local counterterms. The calculation in dim. reg. becomes simpler if the\nintegrals are done in this order. However, as it was noticed by Weinberg [2, 22], the momentum integrals\nthat are left can be more divergent than the ones one would get if the time integral was done up to finite\ntime or if the order of integration had been switched. This implies that there is no guarantee that all\nthe divergencies, including the logarithmic ones, obtained with the outlined procedure are reabsorbable\nby local counterterms. It is in fact possible that they would disappear if one where to switch the order\nof integration at the cost of inducing a time dependence of the one-loop result. This issue had been\nsimply mentioned but not solved in the literature. We are able to address and solve this issue in several\nways. Of course, the more direct way is by explicitly performing the renormalization of the correlation\nfunction, as we do in sec. 3.3. The second way is by performing the calculation regularizing the integrals\nwith a cutoff, in which case we first integrate in momentum and then in time finding the same result as\nin dimensional regularization. This means that the divergency that we find has to be reabsorbed by a\ncounterterm. Third in sec. 3.2.2 we actually perform the dim. reg. calculation keeping the external time\nfinite finding again the same result.\nAt this point extending our calculation to the theory of (10) is quite simple. We do it in sec. 4,\nfinding again a logarithm of the form log(H/μ). For this theory, in sec. 5 we prove that there cannot\nbe any time dependence of the two point function in yet a different way that we also then generalize to\nthe case of the π self-interactions. This last proof can be thought of as computing the loop corrections\nby first doing the momentum integrals and then doing the time integral. In this way, we can assume\nthat all the UV divergencies have been reabsorbed by a counterterm. This is so because in this way of\ndoing the calculation, we are using directly the physical (renormalized) quantities defined at each time.\nIn this method, computing loop corrections becomes equivalent to solving perturbatively the equations\nof motion for the various operators. It turns out this alternative method is not powerful enough for\nus to determine the exact result of the loop calculation but it allows us to show in a very simple and\nphysical way that the ζ two-point function is time-independent. In particular, the reader not interested\nin the technical calculations but on the main result could read directly sec. 5 to see that the ζ correlation\nfunction is time-independent and then make the integrals dimensionless as in sec. 3.2.1 to see that the\n\n6\n\n\flogarithm, if it exists, is of the form log(H/μ).\nWe find this last method of dealing with loop corrections particularly physical and intuitive. In\nsection 6, we use this intuition to argue how our results extend to higher loops and different interactions.\nIn particular we will claim that contrary to what was reported in the literature [22, 27] the ζ two point\nfunction does not acquire any time dependence even in the case where the spectator σ fields have any\nform of stable potential 3 . It is conceivable that our results can be extended to other time dependent\neffects found in the literature when studying the zero mode in different theories [28]. We will summarize\nour results in sec. 7.\n\n2\n\nOne-loop corrections\n\nLet us write the metric in the standard ADM parametrization:\n\u0001\n\u0001\nds2 = −N 2 dt2 + hij dxi + N i dt dxj + N j dt .\n\n(12)\n\nWe can fix the gauge by choosing the inflaton φ to be uniform on equal time slices: δφ = 0 and by\nimposing the spatial metric hij to be of the form:\nhij = a(t)2 e2ζ δij .\n\n(13)\n\nIn inflation we are interested in computing late time expectation values of the metric fluctuation ζ.\nThis is due to the fact that we expect that for wavenumbers much outside of the horizon it is constant\nin time and more importantly independent of the local, often unknown, physical processes that happens\nduring the various epochs of the history of the Universe. Here we are going to compute the one-loop\ncorrections to its two-point function. This includes checking for its constancy in time. The expectation\nvalue for ζ is given by [1, 2, 21]\nhζ 2 (t)i = hUint (t, −∞+ )† ζ 2 (t)Uint (t, −∞+ )i ,\nwhere\n−i\n\nUint (t, −∞+ ) = T e\n\nRt\n−∞+\n\ndt0 Hint (t0 )\n\n(14)\n\n,\n\n(15)\n\nwhere Hint is the interaction Hamiltonian in the interaction picture, T denotes time-ordering, and −∞+\nmeans that the integral is performed on an analytically rotated contour t0 → t0 (1 + i\u000f), which projects\nthe free vacuum state onto the interacting vacuum state in the infinite past. The operator ζ 2 on the\nright-hand side is meant to be the freely evolving operator in the Heisemberg picture. At one-loop,\neq. (14) becomes\n\u0014Z t\n\u0015\n\u0014Z t\n\u0015\nZ t2\n(3)\n(3)\n(4)\n2\n2\n2\nhζ (t)i1−loop = −2 Re\ndt2\ndt1 hHint (t1 )Hint (t2 )ζ (t)i − 2 Im\ndt1 hHint (t1 )ζ (t)i\n−∞−\n\nZ\n\nt\n\n+\n\nZ\n\n−∞−\n\nt\n\ndt1\n−∞−\n\n−∞+\n\n−∞−\n\n(3)\n\n(3)\n\ndt2 hHint (t1 )ζ 2 (t)Hint (t2 )i ,\n\n3\n\n(16)\n\nThis of course includes and agrees with the main conclusions of [22, 27] about the absence of an exponential\ndependence in time in the two-point function.\n\n7\n\n\f(3)\n\n(4)\n\nwhere Hint and Hint represent the cubic and the quartic interaction Hamiltonian. We notice that there\nare two terms that involve two insertion of a cubic interaction, and one term that involves one insertion\nof a quartic interaction.\nWe are going to apply eq. (16) to two different physical Lagrangians that represent two different\nmodels of inflation. The first is a model of single field inflation where the inflaton is self-interacting with\na strength that is parametrically larger than gravitational, and the second is a model where the inflaton\nis gravitationally interacting with N free massless scalar fields. The fact that there are N identical scalar\nfields makes the effect coming from them as they run in the loop parametrically larger than the analogous\neffect from loops of gravitons.\nBefore actually proceeding, let us specify what is our target for the calculation. The one-loop corrections in eq. (16) will contain divergent pieces and finite pieces. It is expected that the divergent pieces\nwill be reabsorbed by counterterms in the Lagrangian, which will affect also the finite terms of the result.\nIn the present paper we will not perform the explicit renormalization of the two Lagrangians we will\nstudy, but we will rather assume that this can be done 4 . For one kind of divergencies, the logarithmic\nones, it is particularly easy to realize how they will be transformed by the renormalization procedure.\nThis is so because a logarithmic divergency will appear in the form\n\u0012\n\u0013\nΛ\nC log\n,\n(17)\nsome physical mass scale\nwhere C is the coefficient of the logarithmic divergency, Λ is the cutoff of the calculation, and in the\ndenominator we have some physical mass scale. Upon renormalization, the above expression will simply\nbe transformed by replacing the cutoff Λ with the renormalization scale μ:\n\u0013\n\u0012\n\u0013\n\u0012\nμ\nΛ\n→\nC log\n.\n(18)\nC log\nsome physical mass scale\nsome physical mass scale\nThis means that even without explicitly renormalizing the theory, we can compute the coefficient C of\nthe logarithmic running. Notice however that in principle we are unable to compute precisely what the\nmass scale which accompanies the renormalization scale is as we can always redefine it by a multiplicative\nconstant at the cost of simply changing the finite terms. These finite terms are fixed once and for all\nby imposing the two-point function to have a certain value at some energy scale. They are part of the\ndefinition of the theory. The logarithmic divergency tells us instead how the amplitude of the process\nchanges as we change the renormalization scale: it represents the running, in this case, of the two-point\nfunction and it can be large if the renormalization scale is chosen to be very different from the relevant\nenergy scale of the process. We will argue that there is only one physical mass scale that can possible\naccompany the renormalization scale in this situation, while at the same time leaving the remaining\nnumerical finite terms of order one. Several calculations of the coefficient C and of the mass scale that\naccompanies the renormalization scale have been done since Weinberg in [2], finding that the form of the\nlog divergency is\n\u0012 \u0013\nk\nC log\n,\n(19)\nΛ\n4\n\nIn particular, for one of the theories, we will explicitly verify that this is the case by identifying and computing\nthe counterterms.\n\n8\n\n\fwhere k is the comoving momentum of the ζ modes of which we compute the expectation value. We find\nthis result not to be physical, as the comoving wavenumber k is not a physical quantity. Its value can\nbe changed by simply a constant rescaling of the scale factor a, which is not physical. As we pointed\nout in the introduction, this result could have had disastrous consequences for slow-roll eternal inflation,\nand more in general for inflation as well. The main point of this paper will be to show that all of those\ncalculation are not correct, and that the mass scale accompanying the renormalization scale is the Hubble\nscale H:\n\u0012 \u0013\n\u0012 \u0013\nk\nH\nC log\n→\nC log\n,\n(20)\nμ\nμ\nproving in the same time that there cannot be any time dependence in the ζ correlation function.\n\n3\n\nLarge π̇ 3 self-interaction\n\nIn [3] an effective field theory for inflation was developed that made it possible to explore in full generality\nall the possible self-interactions of the inflaton, and in particular to clearly see that the inflaton can have\nlarge self-interactions without spoiling the background quasi de-Sitter solution. It was shown that the\nself-interactions can be parametrically larger than the one mediated by gravity and therefore we can\nconcentrate on those without worrying about metric fluctuations. This simplifies the calculation a great\ndeal. The Effective Lagrangian is a function of the field π which represents the Goldstone boson of time\ntranslations which are spontaneously broken during inflation. It is related to the ζ metric fluctuation at\nlinear level by the simple relation\nζ = −Hπ .\n(21)\nNotice that π is a scalar field with dimensions of inverse mass. Here we do not present the derivation\nof this Lagrangian, that can be found in [3], and we simply take a limit of its parameter space and use\nit for computing loop corrections. There are in general two interactions of comparable strength, π̇ 3 and\nπ̇(∂i π)2 , each one accompanied by quartic interactions due to symmetry reasons. Upon tuning [3, 14],\nwe can make the term containing π̇ 3 parametrically larger then the one containing π̇(∂i π)2 . This allows\nus to reduce the number of vertices, and therefore to simplify the calculation. In this paper we are trying\nto assess conceptual and qualitative features of the loop corrections to the inflaton two point function\nand we can therefore study a tuned theory. Following the notation of [23], the action is of the form\n\u0012\n\u0014\n\u0013\n\u0012\n\u0013\u0015\nZ\n1\n2\n1 2\n2\n4\n3\n2\n2\n4\n3\n4\n2\nS = d x a −ḢMPl π̇ − 2 (∂i π) + c3 M 2π̇ + 3π̇ − 3 2 π̇ (∂i π)\n.\n(22)\na\n3\na\nHere c3 is a dimensionless parameter, while M has dimensions of mass. The interaction picture Hamiltonian is of the form\n\"\n!\n#\nZ\n4\nc\nM\n1\n4\n3\nHint = d3 x a3 − c3 M 4 π̇ 3 − 2c3 M 4 1 + 2\nπ̇ 4 + 2c3 M 4 2 π̇ 2 (∂i π)2 .\n(23)\n2\n3\na\nḢMPl\nWe notice that we have a very simple interaction Hamiltonian at cubic level: only one interaction of the\nform π̇ 3 .\nWe are now ready to begin the computation. We will perform it in two different regularization\nschemes: the first is by putting a sharp cutoff in frequency and momentum space, and the second by\ndimensional regularization.\n\n9\n\n\f3.1\n\nRegularization by Frequency and Momentum Cutoff\n(3)\n\nWe start by computing the two contributions with two insertions of Hint , and in particular the one of\nthe form:\n\u0015\n\u0014Z t\nZ t2\n(3)\n(3)\n2\n2\n2\ndt1 hHint (t1 )Hint (t2 )π (t)i ,\n(24)\nhζ (t)i1−loop, A = −2H Re\ndt2\n−∞−\n\n−∞−\n\nthat we refer to as contribution A. After some simple algebra we are left with:\nhζ~k (t)ζ~k0 (t)i1−loop, A = −(2π)3 δ (3) (~k + ~k 0 )\n(25)\n\u0014Z t\nZ 3 Z 3\nZ t2\n\u0010\n\u0011\nd k1\nd k2\ndt1 a(t1 )3\n× 128 c23 M 8 H 2 Re\ndt2 a(t2 )3\n(2π)3 δ (3) ~k + ~k1 + ~k2\n3\n(2π)\n(2π)3\n−∞−\n−∞−\ni\n× π̇kcl (t1 )πkcl ∗ (t) π̇kcl0 (t2 )πkcl0 ∗ (t) π̇kcl1 (t1 )π̇kcl1∗ (t2 ) π̇kcl2 (t1 )π̇kcl2∗ (t2 ) .\nNotice that there are other possible contractions of the operators, giving rise to diagrams that are not\none-particle irreducible. However they involve derivatives of the wavefunctions at k = 0 which vanish. In\norder to get the coefficient of the one-loop logarithmic divergency, we realize that we can simply regulate\nthe above integral with a cutoff in frequency and momentum space. Though this regulator is not diff.\ninvariant we can exploit the fact that the logarithmic divergency receives equal contributions from all\nenergy scales and therefore its coefficient is independent of the UV regulator. The coefficient of the\nlogarithm obtained in this way is the correct one at one-loop but not at higher loops as in this case it\ndepends on the finite terms of the lower loop calculation which in turn depends on the regularization and\nrenormalization procedure.\nWe therefore regulate the momentum integral with the following replacement:\nZ\nZ Λa(t1 )\nd3 k\n→\nd3 k ,\n(26)\nwhere Λ is a fixed physical cutoff, and therefore it appears cutting off the integral in comoving momentum\nk accompanied with a factor of the scale factor a, so that kphysical = k/a(t) < Λ. Notice that the scale\nfactor a is evaluated at time t1 . This can be understood in the following way. If we look back at\neq. (14), we see that it involves the interaction picture evolution operator U acting on the vacuum. In\nthe interaction picture, we can think as the operators evolving with the free Hamiltonian, while the state\nevolving with the interaction Hamiltonian. The diagram we are computing corresponds to letting the\nvacuum state on the left (and then also the one on the right once we take the real part) evolve up to time\n(3)\nt with two insertions of the interaction Hamiltionian Hint , the first at time t1 and the second at time t2 ,\nwith t1 < t2 . Momenta which are higher than the cutoff at the earlier time t1 , do not contribute to the\nvertex at t1 , even in the case that by the time t2 they have redshifted inside the cutoff. In the case there\nis no interaction at t1 , then there can no be a subsequent interaction at time t2 and therefore we have to\nput the cutoff as Λ a(t1 ). We have also to regulate the integral in t1 . This is analogously regulated with\nthe same physical cutoff by replacing the t1 integral in the following way:\nZ t2\nZ t2 − 1\nΛ\ndt1\n→\ndt1 .\n(27)\nAt this point, the calculation becomes quite straightforward. Before actually doing it let us first gain\nsome intuition by doing the calculation in a non-expanding and then in a slowly expanding Universe.\n\n10\n\n\f• Non-expanding Universe\nWe start by completely neglecting the expansion of the Universe and take the wavefunctions to be:\nπkcl = \u0010\n\n1\n2\n−2ḢMPl\n\n\u00111/2\n\n1 −ikt\ne\n,\nk 1/2\n\n(28)\n\nwhere we have set the scale factor a to be equal to one. Notice that Ḣ enters here just to canonically\nnormalize the field, and does not play any role in our discussion. A straightforward calculation gives:\n\u0012 \u0012 \u0013\n\u0013\n2 2\n8\nΛ\n3 (3) ~\n0 c3 H M 1 6\n~\nhζ~k (t)ζ~k0 (t)i1−loop, A, No Expansion ∼ (2π) δ (k + k )\nk log\n+L ,\n(29)\n8 k3\nk\nḢ 4 MPl\nwhere L is a divergent constant and where we have neglected numerical factors. The result is clearly not\nscale invariant. Since the π̇ 3 interaction is of dimension six, the only way it gives rise to a logarithmic\ndivergency is by pulling out some powers of the external momentum k. Notice that as k → 0, the one-loop\ncorrection goes to zero, as the interaction we are dealing with has at least one derivative acting on the\nexternal leg.\n\n• First corrections from the expanding Universe: kη \u001d 1\nLet us now include the first corrections from the space expansion and use the wavefunctions in de-Sitter\nspace, taken in their high energy limit kη \u001d 1, where η is conformal time:\nπ cl = i \u0010\n\nH\n2\n−2ḢMPl\n\n1\n\u00111/2\n\nk 3/2\n\n(1 + ikη) e−ikη ' − \u0010\n\nH\n2\n−2ḢMPl\n\n\u00111/2\n\n(kη) −ikη\ne\n,\nk 3/2\n\n(30)\n\nwhere in the second passage we have taken the kη \u001d 1 limit. In this case the expansion is very slow for\nthe modes being considered. The result of the integration gives:\n\u0012 \u0012\n\u0013\n\u0013\n2 8\n8\n6\nk/a(η)\n3 (3) ~\n0 c3 H M (kη)\n~\nlog\n+C ,\nhζ~k (t)ζ~k0 (t)i1−loop, A, kη\u001d1 ∼ (2π) δ (k + k )\n8\nk3\nΛ\nḢ 4 MPl\n(31)\nWe see that, apart for the 1/k 3 term and the δ-function, every other k is accompanied by an η. In this\nway the expression, once Fourier transformed to real space, is correctly invariant under the rescaling\na → λ a, k → λ k, x → x/λ, which is a symmetry of the problem. Notice that again, in the limit kη → 0,\nthe one-loop correction goes to zero. This is due to the fact that in order for this operator to be able to\nproduce a logarithmic divergency, some powers of the external momentum have to be pulled out of the\nintegral. Symmetry arguments dictate that each additional power of momentum must be accompanied\nby a factor of η. This forces the expression, in the limit η → 0, to go to zero. Further the structure of\nthe logarithmic divergency has changed: now the factor of k is accompanied by a scale factor evaluated\nat time η. We are beginning to see the relevant effect of the expanding Universe. We can anticipate\nwhat the effect of including the expansion of the Universe even at later times (kη ∼ −1) will be. As\nthe expansion of the Universe goes on, and kη becomes more and more infrared and eventually of order\n\n11\n\n\fone, the amplitudes of the modes freeze and are evaluated when kη ∼ −1. This implies that the result\nbecomes scale invariant, and that the logarithmic divergency takes the form of\n\u0012 \u0013\nH\n.\n(32)\nlog\nΛ\nDe-Sitter space has provided an infrared cutoff to the loop corrections. At the tree-level, quantum effects\non scales larger than 1/H are larger than what they would be for the same scales in Minkowsky space.\nThe same happens here for the loop corrections: on large scale, quantum effects are parametrically larger\nthen what they would be in Minkowsky space.\nNotice two further comments. First, at least in principle, the term in (32) is a local term, and therefore\none could imagine that a local counterterm proportional to log(H/μ) could remove it completely. However\nthis is not the case because for modes that are still inside the horizon the divergency is of the form of\nlog(k/(a(t)μ)) which is not a local term and therefore cannot be removed by a local counterterm. The\ncounterterm should be the same for all the modes, and therefore we conclude the log(H/μ) is something\nthat cannot be removed by a local counterterm. Second, the way the logarithm in (31) becomes (32) as\nthe mode goes outside of the horizon tells us that the H in the logarithm should be interpreted as the\nenergy at which the process is evaluated for modes that have exited the horizon. This implies that we\nexpect the constant C to be of order one once μ is chosen to be of order H.\n\n• Calculation in the Inflationary space\nWe are now ready to do the calculation in an inflationary Universe. We use the following classical\nwavefunction, expressed in conformal time:\nπkcl = i \u0010\n\nH\n2\n−2ḢMPl\n\n1\n\u00111/2\n\nk 3/2\n\n(1 + ikη) e−ikη .\n\n(33)\n\nWe would like to stress the technical point that since the momentum cutoff is time-dependent once\nexpressed in comoving coordinates one has to perform the momentum integrals first and the time integrals\nsecond. As we will see in the next subsection, in dimensional regularization we will perform the integrals\nin the opposite order. Taking the t → +∞ limit a straightforward calculation leads to:\n\u0012 \u0013\n2H 8M 8\n1\n2\nc\nH\n3 (3) ~\n0\n3\nlog\n,\n(34)\nhζ~k (t)ζ~k0 (t)i1−loop, A, t→+∞ = −(2π) δ (k + ~k ) 3\n2\n8\nk 15π Ḣ 4 MPl\nΛ\nwhere we have neglected all the finite terms and the power divergencies. Some details of this calculation\nare given in App. A. The result is time-independent and scale invariant. The other contributions do not\nproduce any other logarithmic divergency and we will be left with log(H/Λ).\nLet us now proceed with the remaining terms. Let us analyze the additional one involving two\n\n12\n\n\finsertions of H (3) which we will label with a B:\nZ\nZ t\n2\ndt1\nhζ~k (t)ζ~k0 (t)i1−loop, B = H\n\n×\n\nπ̇kcl (t1 )πkcl ∗ (t)\n\n−∞−\nπ̇kcl0 ∗ (t2 )πkcl0 (t)\n\n(3)\n\n(3)\n\n−∞+\n\n−∞−\n\n= −(2π)3 δ (3) (~k + ~k 0 )\nZ\nZ t\n3\n2\n8 2\ndt1 a(t1 )\n× 128 c3 M H\n\nt\n\ndt2 hHint (t1 )π~k (t)π~k0 (t)Hint (t2 )i\n\nt\n3\n\ndt2 a(t2 )\n\n−∞+\ncl\nπ̇k1 (t1 )π̇kcl1∗ (t2 )\n\nZ\n\nd3 k1\n(2π)3\n\nZ\n\n(35)\n\n\u0010\n\u0011\nd3 k2\n3 (3) ~\n~k1 + ~k2\n(2π)\nδ\nk\n+\n(2π)3\n\nπ̇kcl2 (t1 )π̇kcl2∗ (t2 ) .\n\nThis integral is convergent and gives\nhζ~k (t)ζ~k0 (t)i1−loop, B,\n\nt→+∞\n\n1 331 c23 H 3 M 8\n= (2π)3 δ (3) (~k + ~k 0 ) 3\n.\n8\nk 7200π 2 Ḣ 4 MPl\n\n(36)\n\nFinally, we have to compute the contribution from the quartic interactions. It is quite easy to see\nthat they do not give rise to logarithmic divergencies. Here for brevity we just concentrate on the π̇ 4\ninteraction, as this is the only one that will give an effect proportional to c23 and so it could affect the\nlogarithmic divergency we found in the first diagram. Keeping only the term proportional to c23 , the\nexpression, that we call contribution C, reads:\n\nhζ~k (t)ζ~k0 (t)i1−loop, C = −2 Im\n× Im\n\n\"Z\n\nt\n\n−∞−\n\ndt1 a(t1 )3\n\nZ\n\nΛa(t1 )\n\nt\n\n\u0015\nc2 H 2 M 8\n(4)\ndt1 hHint (t1 )π~k (t)π~k0 (t)i = 96(2π)3 δ (3) (~k + ~k 0 ) 3\n2\nḢMPl\n−∞−\n#\nd3 k cl\n(37)\nπ̇ (t1 )πkcl ∗ (t) π̇kcl0 (t1 )πkcl0 ∗ (t) π̇kcl1 (t1 )π̇kcl1∗ (t1 ) .\n(2π)3 k\n\n\u0014Z\n\nA straightforward integration shows that this contribution contains no logarithmic divergencies and goes\nas\n\u0001\n1 c2 H 4 M 8\n4\n2 2\nhζ~k (t)ζ~k0 (t)i1−loop, C, t→+∞ = (2π)3 δ (3) (~k + ~k 0 ) 3 3\nO\nΛ\n,\nH\nΛ\n.\n(38)\n8\nk Ḣ 4 MPl\nSummarizing, we conclude that the ζ two-point function receives a logarithtmic correction of the form\nlog(H/Λ):\n\u0012 \u0012 \u0013\n\u0013\n1 2 c23 H 8 M 8\nH\nhζ~k (t)ζ~k0 (t)i1−loop, t→+∞ = (2π)3 δ (3) (~k + ~k 0 ) 3\nlog\n+\nC\n,\n(39)\n8\nk 15π 2 Ḣ 4 MPl\nΛ\nwhere C is a numerical constant. We note that the unitarity bound ΛU of this theory is of order\n\u0010\n\u00113\n2\nḢMPl\nΛ4U ∼\n,\nM8\nwhich means that the above one-loop correction scales as\n\u0012\n\u0013\nH 4\n2\n2\n.\nhζ i1−loop ∼ hζ itree\nΛU\nAs expected, the theory becomes strongly coupled when H ∼ ΛU .\n\n13\n\n(40)\n\n(41)\n\n\f3.2\n\nDimensional Regularization\n\nWe now perform the same calculation as in the former subsection but in dimensional regularization.\nDimensional regularization has the advantage of respecting diff. invariance. As we said before, this\nis not really necessary for computing the coefficient of the logarithmic running but it would be a great\nsimplification if one wished to renormalize the theory and compute the finite terms of the loop corrections.\nFurther, this is the regularization scheme that has been applied in the literature on the subject [22, 21, 24],\nand we claim that it has not been applied correctly because several terms coming from the generalization\nof the expressions to d dimensions have been omitted 5 . For these reasons we proceed to perform the\nsame calculation in dimensional regularization (dim. reg.) where we make the integral convergent by\nchanging the number of spatial dimensions.\nLet us start with the diagram A, which becomes\nhζ~k (t)ζ~k0 (t)i1−loop, A = −(2π)3 δ (3+δ) (~k + ~k 0 ) 128 c23 M 8 H 2 μ2δ\n(42)\n\u0014Z t\nZ 3+δ Z 3+δ\nZ t2\n\u0010\n\u0011\nd k1\nd k2\n(2π)3+δ δ (3+δ) ~k + ~k1 + ~k2\n× Re\ndt2 a(t2 )3+δ\ndt1 a(t1 )3+δ\n3\n3\n(2π)\n(2π)\n−∞−\n−∞−\ni\ncl\ncl ∗\ncl\n× π̇k (t1 )πk (t) π̇k0 (t2 )πkcl0 ∗ (t) π̇kcl1 (t1 )π̇kcl1∗ (t2 ) π̇kcl2 (t1 )π̇kcl2∗ (t2 ) ,\nwhere δ represents the difference between the number of spatial dimensions d and 3 and μ is the renormalization scale and it has been inserted in order to keep ζ dimensionless and π with dimensions of time.\nHere we do not extend to d-dimensions the numerical factors as they would only change the constant\nterms from the loop-corrections. At this point we have to express the wavefunction π cl in d-dimensions.\nThis reads:\n√ iπδ/4 1+δ/2\n(−kη)(3+δ)/2 (1)\nπe\nH\ncl, d\nπk = − \u0010\nH(3+δ)/2 (−kη) ,\n(43)\n\u00111/2\nk (3+δ)/2\n2 μδ\n2 −ḢMPl\n(1)\n\nwhere Hν is the Hankel function of the first kind of index ν. We do not actually need to perform\nthe integral in (42) with this wavefunction. In fact, the two wavefunctions which just depend on the\nexternal time t and the external momentum k can be brought outside of the integrals and taken to three\ndimensions and to the η → 0 limit. They give:\nπkcl, d (η → 0) =\n\ni\neiπδ/4 H 1+δ/2\n1\n1/2\n(3+δ)/2\n2\n1/2\nδ\n(2π) (−ḢMPl μ ) k\n\n→\n\ni\nH\n1\n.\n1/2\n3/2\n2\n1/2\n(2π) (−ḢMPl ) k\n\n(44)\n\nThis is justified by the fact that every logarithm coming from the external wavefunctions will be canceled\nby the contribution from the counterterm which renormalizes this interaction. The same is true for the\nδ-function of the external momenta:\nδ (3+δ) (~k + ~k 0 )\n\n→\n\nδ (3) (~k + ~k 0 ) .\n\n(45)\n\nFor the remaining wavefunctions inside the integrals we notice that we are interested in computing just the\nlogarithmic running from the loop integral and we can therefore Taylor expand the above wavefunction\n5\n\nWe will see that having forgotten those terms is equivalent to putting a cutoff in physical frequency-momentum\nspace that grows exponentially in time.\n\n14\n\n\faround δ → 0, and keep only the linear term (as we will see, the loop integral has only one simple pole).\nNotice that the momentum in the wavefunction is still the full d-dimensional one which is a sufficient\ncondition for keeping the integrals regularized. Taylor expanding (43) around δ → 0 we obtain:\nπkcl, d ' i \u0010\n\n1\n\nH\n2 μδ\n−2ḢMPl\n\n\u00111/2\n\nk 3/2\n\n(1 + ikη) e−ikη ×\n\n(46)\n\n\u0012\n\u0012\n\u0013\n1\n1\n(1 − ikη) 2ikη\n1+δ\nlog (−Hη) +\n−\ne\n(−3πi + 2 Ci(2kη) − 2 i Si(2kη))\n2\n1 + ikη 4(1 + ikη)\n\u0001\u0001\n2\n,\n+O δ\nH2\nk 1/2 η 2 e−ikη ×\n2\n1/2\nδ\n(−2ḢMPl μ )\n\u0012\n\u0012\n\u0013\u0013\n\u0001\n1\n1\n1+δ\n,\nlog (−Hη) − e2ikη (−3πi + 2 Ci(2kη) − 2 i Si(2kη)) + O δ 2\n2\n4\n\nπ̇kcl, d ' −i\n\nwhere\n\nZ\nCi(x) =\n0\n\nx\n\ncos(x0 ) − 1\ndx\n+ log(x) + γ ,\nx0\n0\n\nZ\nSi(x) =\n0\n\nx\n\ndx0\n\nsin(x0 )\n,\nx0\n\n(47)\n\nand γ is the Eulero-Mascheroni constant. We can now begin to do the integrals in (42) by starting from\nthe ones in time.\n\n• Contributions at order δ 0\nWe start by performing the time integrals in (42) for the component which is explicitly independent of\nδ (notice that k is still the d-dimensional momentum). This was the only contribution included in the\nliterature. We get:\n9 c23 H 8 M 8\n(48)\n8\n16π 3 Ḣ 4 MPl\n\u0010\n\u0011\n2\n2\nZ 3+δ\nZ 3+δ\n\u0010\n\u0011\nk\nk\n3\n(k1\n+\nk\n)\n+\n9\n(k\n+\nk\n)\nk\n+\n8k\n1\n2\n2\n1\n2\n1\nd k1\nd k2\n× 7\n(2π)3+δ δ (3+δ) ~k + ~k1 + ~k2\n,\nk\n(2π)3\n(2π)3 μδ\n(k + k1 + k2 )3\nhζ~k (t)ζ~k0 (t)i1−loop, A, t→+∞, δ0 = −(2π)3 δ (3) (~k + ~k 0 )\n\nwhere the subscript δ 0 reminds us that we are taking only the terms in the wavefunctions of order δ 0 .\nNotice that in this case, contrary to what we did in the case of a regularization with a sharp cutoff in\nfrequency and momentum space, we perform the time integral up to t → +∞ first, and then we perform\nthe momentum integral. We will come back later in sec. 3.2.2 and sec. 5 to prove that there are no\nsubtleties associated with this. By dimensional analysis, the remaining momentum integral will give a\nresult of the form\n\u0012 \u0013δ\n4 k\nk\nF (δ) ,\n(49)\nμ\nBecause of the ultraviolet divergencies F (δ) has a singularities in the limit δ → 0 of the form:\nF (δ) =\n\nF0\n+ F1 .\nδ\n\n15\n\n(50)\n\n\fIn the limit δ → 0 it leads to:\n\nk 4 (log(k/μ) + L) ,\n\n(51)\n\nwhere L is a divergent constant. It is straightforward to carry out the momentum integral and find:\n\u0012 \u0013\n2H 8M 8 1\nc\nk\n2\n3 (3) ~\n0\n3\n×\nlog\n.\n(52)\nhζ~k (t)ζ~k0 (t)i1−loop, A, t→+∞, δ0 = −(2π) δ (k + ~k )\n2\n3\n8 k\n15π Ḣ 4 MPl\nμ\nWe now turn to consider the contribution from taking in each wavefunction the terms that are linear\nin δ. These terms have been neglected in the literature.\n\n• Contribution proportional to δ log(−Hη)\nAgain, as we are linearizing in δ, we take the δ-correction only from one wavefunction at the time. We\nstart by considering the term in each wavefunction which contains the log(−Hη):\nδπkcl, d ' i \u0010\n\nH\n\n1\n1\n−ikη\n× δ log (−Hη) .\n\u00111/2 k 3 (1 + ikη) e\n2\n2\n\n(53)\n\n−2ḢMPl\n\nNotice that this part of the Taylor expansion of (46), taken as isolated, does not converge for η → 0, as\nthe log(−Hη) diverges. However we are now going to notice that the time integrals are dominated by\nη1 ∼ η2 ∼ ηk where ηk is the time of horizon crossing for the k mode (kηk ∼ −1), which implies that\nfor δ sufficiently small, we can consider this isolated part of the expansion in (46). Once we perform\nthe integral over time, the effect of this additional logarithm will be to multiply the expression in (48)\nby log(−cHηk ), where c is some order one constant. This is so because the integrals in time in three\ndimensions read\nZ\nZ\n0\n\nη2\n\ndη2\n−∞\n\n−∞\n\ndη1 η12 η22 e(k+k1 +k2 )η1 e(k−k1 −k2 )η2 ,\n\n(54)\n\nafter performing the contour rotation, and it is straightforward to see that they are dominated by the\ntimes η1 ∼ η2 ∼ 1/k which is where the exponential suppression terminates. This is not changed when\nwe add to the integral above a term of the form log(−Hη1,2 ), and therefore the result of the time\nintegrations will be just to replace log(−Hη1,2 ) with log(−cHηk ), where c is some order one constant. At\nthis point, the momentum integration is the same as before. In the limit δ → 0 this term will contribute\nto the logarigthmic divergency by multipling the coefficient of order 1/δ of F (δ) in eq. (49). This is the\nsame term that in the former contribution was multiplying the factor log(k/μ). There are six factors\nof δ log(−Hηk c)/2 coming from the six wavefunctions integrated in the loops. Notice that there is also\ntwo analogous terms coming from Taylor expanding the factors of a(η1,2 )δ in the measure of integration\naround δ = 0. In the δ → 0 limit, they also multiply the coefficient of order 1/δ of F (δ), with the only\ndifference that this time they are proportional to minus two factors of δ log(−cHηk ). Once we take the\nδ → 0 limit, all of these eight terms give the same result as in (52) with the replacement:\nlog(k/μ)\n\n→\n\nlog(−Hηk ) ,\n\n(55)\n\nthat is\nhζ~k (t)ζ~k0 (t)i1−loop, A, t→+∞, δ log = −(2π)3 δ (3) (~k + ~k 0 )\n\n16\n\n2 c23 H 8 M 8 1\n× log(−Hηk ) .\n8 k3\n15π 2 Ḣ 4 MPl\n\n(56)\n\n\fwhere we have neglected the divergent term and the order one constant c as it is irrelevant, and where\nthe δ log subscript represents the fact that this is the contribution from the terms linear in δ log(−Hη).\n\n• Remaining δ−components\nWe are now left to consider the contribution from taking in one of the wavefunctions the remaining\nterm proportional to δ. Notice that this term is dimensionless and only a function of kη1,2 and k1,2 η1,2 ,\ndepending on which wavefunction we are dealing with. So, if we were to perform the time integral, we\nwould obtain an expression similar to (48). Then the remaining momentum integral, by dimensional\nanalysis, would give a result proportional to\n\u0012 \u0013δ\nk\nδk\nF̃ (δ),\nμ\n4\n\n(57)\n\nwhere F̃ (δ) is dimensionless and divergent for δ → 0. In order for a logarithmic running to come from\nthis term, it would be necessary for F̃ to have a double pole for δ → 0. However, we saw in eq. (52)\nthat the F (δ) defined in eq. (49) had only a single pole, and it is quite straightforward to realize that the\nadditional terms proportional to δ that transform F into F̃ do not increase the degree of divergency of F .\nIn fact, it is quite tedious but straightforward to show that upon inclusion of the remaining δ-correction\nto the wavefunction in the time integrals, these are still dominated by η1 ∼ η2 ∼ 1/k. At this point,\nwe look at the part of the δ-corrected wavefunction that we are considering, which now can be thought\nof as depending on the ratio k1,2 /k (in the other case we are just left with a number of order one), and\nconcentrate only on those terms that can induce a logarighmic running. These are only those ones that\ndo not scale as a simple power law in k1,2 /k. The part we are considering of the δ-corrected wavefunction\nhas a logarighmic dependence only in the IR limit k1,2 /k → 0 as log(k1,2 /k). However, in this limit the\nintegral we started with in the limit of δ → 0 was power law convergent, and therefore the additional\ninfrared log(k1,2 /k) does not induce an additional logarithmic divergency. We conclude that F̃ (δ) has no\ndouble pole as δ → 0, and that therefore no additional logarithms appear when considering this part of\nthe δ-correction to the wavefunction.\nWe stress that these contributions proportional to δ were forgotten in the literature [22, 21, 24] and\nled to parametrically incorrect results.\nFinally, we comment on the decision we took in eq. (44) to take the external wavefunctions directly\nin d = 3 dimensions. We can notice that if we had kept them in generic dimensions and we would\nhave then expanded in δ as we did for the other wavefunctions, then naively there would be terms\nthat, multiplying F0 /δ from the loop integral would give rise to additional logarithm of the form log(k)\nor log(H/μ). However, if the divergencies are to be renormalized, than there is a counterterm that\ncancels the divergent term F0 /δ of the overall integral. This counterterm multiplies the same external\nwaveunctions as in eq. (44), canceling in this way all the additional logarithmic divergency that we would\nhave had if we had kept the external wavefunctions in d dimensions 6 . This justifies our rather intuitive\n6\nWe will perform explicitly the renormalization in sec. 3.3. However, we can anticipate that schematically the\ncounterterm will be of the form\nZ\n2\nF0 ḢMPl\ncounter term\nHint\n∼ d3+δ x μδ a3+δ (t)\n(∂ 3 π)2 ,\n(58)\n4\nδ ΛU\n\n17\n\n\fapproach of treating the wavefunctions that do not participate to the loop integral directly in three\ndimensions.\nSummarizing: in the calculation performed in dimensional regularization the effect of considering the\nterms proportional to δ in the measure and in the wavefunction has achieved the result of transforming\nthe logarithmic divergency log(k/μ) found in the literature [22, 21, 24] into\nlog(k/μ) + log(−Hηk ) ∼ log(H/μ) ,\n\n(60)\n\nwhere we have used that k ηk ∼ −1. It is straightforward to see that the contributions we called B and\nC do not result in any logarithm and therefore we conclude that in dimensional regularization we also\nobtain:\n\u0012 \u0013\n2 c23 H 8 M 8 1\nH\n3 (3) ~\n0\n~\nhζ~k (t)ζ~k0 (t)i1−loop, t→+∞ = −(2π) δ (k + k )\n× log\n.\n(61)\n8 k3\n15π 2 Ḣ 4 MPl\nμ\n\n3.2.1\n\nlog(H/μ) without evaluating the loop integrals\n\nWe would like here to show that, even without doing the actual calculation in dim. reg., it is possible to\nsee that the simple fact that the integrals are dimensionally regularized forces the logarithmic running\nto be of the form log(H/μ). In order to this, it is however necessary to assume that the ζ two-point\nfunction does not depend on time. It is possible to show this without actually having to do any loop\nintegral, as we will show in sec. 5, or, by actually doing the calculation in dim. reg. at finite time as we\nwill do in sec. 3.2.2. For the time being, we will assume this to be the case and we will therefore take the\nextremum of integration of the time integrals in the loops to plus infinity.\nAt this point, by proper redefinition of the variables of integration, it is possible to make the loop\nintegrals dimensionless functions of δ only, and from this extract the form of the logarithmic running. In\nfact we can take for example the loop term in (42) that we reproduce here for convenience:\nM 8 H 4 μδ 1\nhζ~k (t)ζ~k0 (t)i1−loop, A = −(2π)3 δ (3) (~k + ~k 0 ) 128 c23\n(62)\n2\nk3\nḢMPl\nZ 3+δ Z 3+δ\nZ η2\nZ 0\n\u0010\n\u0011\nd k1\nd k2\n3+δ (3+δ) ~\n~k1 + ~k2\ndη1 a(η1 )4+δ\n×\ndη2 a(t2 )4+δ\n(2π)\nδ\nk\n+\n(2π)3\n(2π)3\n−∞−\n−∞−\n× π̇kcl (η1 ) π̇kcl0 (η2 ) π̇kcl1 (η1 )π̇kcl1∗ (η2 ) π̇kcl2 (η1 )π̇kcl2∗ (η2 ) ,\nwhere the number of derivatives comes from imposing that the counterterm has the same powers of the cutoff ΛU\nas the terms it renormalizes, as it is standard in non-renormalizable effective field theories, and where we have\nnot been careful in distinguishing spatial or time derivatives, as in general all will appear in the counterterms. By\ntreating (58) perturbatively in (14), we will obtain terms schematically of the form\n\u0012 3\n\u00132\n2 Z η\nF0 ḢMPl\n∂ cl 0\n0 δ 4+δ 0\nhζ 2 icounter term ∼ δ (3+δ) (~k + ~k 0 )πkcl ∗ (t)πkcl ∗ (t)\ndη\nμ\na\n(η\n)\nπ\n(η\n)\n.\n(59)\nδ Λ4U\na3 k\nThe first two wavefunctions on the left are the same external wavefunctions we get in the loop. Taylor expansion\nof the integrand in δ → 0 (and using eq. (46) since the integral is dominated by kη 0 ∼ −1), shows that no additional logarithmically divergent terms linear in δ are generated by the integrand. This implies that the additional\nlogarithmically divergent pieces that comes from considering the external wavefunctions and the δ-function of the\nexternal momenta in 3 + δ dimensions get canceled by the counterterm.\n\n18\n\n\fwhere we have passed to conformal time, taken the η → 0 limit and we taken the external wavefunctions\nin three dimensions. We can make all the quantities within the integral dimensionless by multiplying or\ndividing by the external momentum k. This is possible because the scale factor is unchanged in dim. reg:\n\u0012 \u0013\nk\n1\n1\n=−\n,\n(63)\na(η1 ) = −\nHη1\nH kη1\nand because the wavefunctions in dim. reg. are just functions of kη apart for multiplicative factors:\n√\nπH 1+δ/2\n(−k1 η1 )(3+δ)/2 (1)\ncl, d\nπk1 (η1 ) = − \u0010\nH(3+δ)/2 (−k1 η1 )\n(64)\n\u00111/2\n(3+δ)/2\n2\nk\nδ\n1\n2 −ḢMPl μ\n\u0010 \u0010 \u0011\n\u0011(3+δ)/2\nk1\n\u0012 \u0012 \u0013\n\u0013\n√\n−\n(kη\n)\n1+δ/2\n1\nk\nk1\nπH\n(1)\nH\n−\n= − \u0010\n(kη1 )\n\u00111/2 (3+δ)/2\nk\nk\n(k1 /k)(3+δ)/2 (3+δ)/2\n2\nδ\n2 −ḢMPl μ\n\u0012\n\u0013\n√\n1\nπH 1+δ/2\nk1\n= − \u0010\n\u00111/2 (3+δ)/2 G k , kη1 ,\nk\n2 μδ\n2 −ḢMPl\nwhere G(k1 /k, k1 η) is a dimensionless function. By extracting the relevant powers of k and H, the\nremaining integral is just a dimensionless function of δ. We obtain:\nM 8 H 4 μδ 1\nH 4+δ\nhζ~k (t)ζ~k0 (t)i1−loop, A = −(2π)3 δ (3) (~k + ~k 0 ) 128 c23\nI(δ)\n×\n2 ) k3\n2 )3 μ3δ\n(−ḢMPl\n(−ḢMPl\n\u0012 \u0013δ\n8 8 1\nH\n3 (3) ~\n0\n2M H\n~\n= −(2π) δ (k + k ) 128 c3\n×\nI(δ) ,\n3\n8\n4\nk\nμ\nḢ MPl\n\n(65)\n\nwhere I(δ) is a dimensionless function of δ. In the limit δ → 0, the factor of (H/μ)δ can be Taylor\nexpanded to give\n\u0012 \u0013\n\u0012 \u0013δ\nH\nH\n→\n1 + δ log\n.\n(66)\nμ\nμ\nThis quantity will multiply any pole coming from the integral I(δ) as δ → 0, giving rise to a logarithm\nof the form\n\u0012 \u0013\nH\nlog\n.\n(67)\nμ\nThis shows that if there is a logarithm as a result of this contribution then it is of the form log(H/μ). It\nis straightforward to see that the same result holds also for the other diagrams. This is an alternative\nproof of the fact that the running has the form log(H/μ) that does not rely on us being able to actually\nperform the loop integrals.\n\n3.2.2\n\nCalculation in dimensional regularization at finite time\n\nIt is not difficult to generalize the calculation we did in sec. 3.2 to finite external time. Apart from the\nfact that the integrals becomes slightly more complicated the only subtlety is in how to deal with the\n\n19\n\n\fcorrections from the measure and the wavefunction that are proportional to δ (see eq. (46)). In sec. 3.2\nwe saw that, when the external time is taken to be plus infinity, the time integrals were dominated by\nη1 ∼ η2 ∼ ηk , where ηk is the horizon crossing time of the mode k. This allowed us to replace the term\nδ log(−Hη1,2 ) in the wavefuntions and in the measure with log(−Hηk ) and argue that the remaining\nδ-corrections to the wavefunctions did not induce addional logarithmic divergencies. It is clear that if\nthe external time η is late enough so that the external mode k is outside of the horizon (i.e. −kη \u001c 1),\nthis still applies. In this regime the δ-corrections can be treated exactly as in the case of infinite external\ntime.\nA straightforward calculation gives:\n\u0012 \u0013\n2 c23 H 8 M 8 1\nH\n3 (3) ~\n0\n~\nhζ~k (t)ζ~k0 (t)i1−loop, kη\u001c1 = −(2π) δ (k + k )\n(68)\n× log\n2\n3\n8\n4\n15π Ḣ MPl k\nμ\n\u0014\n\u0015\n1\n2\n× Re − (i + kη) (4 + kη (2i + kη) (4 + kη(6 + ikη))) .\n4\nAs we will discuss in detail later in sec. 5 the loop integrals performed at finite external time are, at\nleast in principle, more regular than the ones done at infinite external time. This is so because if we keep\nthe external time finite the most ultraviolet k modes are inside the horizon and therefore the integrals\nreceive additional oscillations in the UV that improve their convergence. It is therefore possible that the\nlogarithmic running that we found in the infinite external time limit disappears in the calculation done\nat finite time. It would be replaced by a time-dependent term that diverges as log(η) as we send the\nexternal time η to zero. We find that this is not the case. We will further explicitly verify this in sec. 3.3\nwhere we will find the counterterms that allow us to reabsorb the divergencies. This proves that the ζ\ncorrelation function is time-independent at one-loop, and it also shows that the logarithmic running we\ncomputed in (68) can indeed be computed without need of renormalizing the theory.\n\n3.3\n\nRenormalization\n\nWe now proceed to the actual renormalization of the correlation function of ζ(t)2 for the case of the\nlarge π̇ 3 self-interactions. This theory is so simple, that this process is not complicated. Notice that this\ninteraction is irrelevant, or equivalently non-renormalizable.\nIn non-renormalizable effective field theories, the divergencies are meant to be absorbed order by order\nin an expansion of energy over cutoff, or equivalently derivatives over cutoff. The effect we computed in\n(73) is from a dimension six operator (in canonical normalization), and therefore it is suppressed with\nrespect to the tree-level result by (H/ΛU )4 , where ΛU is the unitarity bound defined in eq. (40). If we\nwork in dim. reg. only the logarithmic divergencies appear and therefore we have to look for dimension\neight quadratic operators. There are three dimension eight quadratic operators compatible with the π\nshift symmetry [3]. The counterterm Lagrangian is therefore given by:\n\u0014\n\u0015\nZ\nM8\n1\n1\n4\nδ\n3+δ\n2\n3 2\n2 2\nSc = d x μ a(t) ḢMPl \u0010\n\u00113 C1 (∂t π) + C2 4 (∂t ∂i π) + C3 2 (∂t ∂t ∂i π)(∂t ∂t ∂i π) , (69)\na\na\n2\nḢMPl\n2 )3 represents the cutoff suppression, and\nwhere the C1 , C2 , C3 are dimensionless numbers, M 8 /(ḢMPl\n2\nwe have extracted a factor of ḢMPl that represents the normalization term of the two derivative kinetic\n\n20\n\n\fterm 7 .\nNotice that the procedure would be different if we instead decided to perform the renormalization\nusing the cutoff regularization. In this case, all the lower dimension operators would be generated with\nsome power law divergency. These include the lowest dimensional one: the wavefunction renormalization.\n2 , due to the\nNotice however that the coefficient of the term (∂i π)2 is fixed by symmetries to be ḢMPl\nfact that π is the Goldstone boson of time translations [3]. It cannot be renormalized. This is quite an\nunusual non-renormalization theorem that affects this term. This means that the power law divergent\nterms will only renormalize the π̇ 2 term out of the two lowest dimension one. This effectively induces\na speed of sound of the fluctuations cs that is different from one, unless it is tuned to be equal to one\n(and this is technically possible since we are dealing with a power law divergency) [3, 14]. This was\nexpected, as typical in effective field theories all allowed operators tend to be generated suppressed by\nthe same scale unless we perform some tuning or unless there is a symmetry protecting it. In this\ncase, there appears to be no symmetry protecting cs = 1 and we decide to tune it. Notice that in\nthis paper we are concentrating on the conceptual issues arising from the study of loop corrections to\ninflationary observable, and we consciously decide to study a consistent, though tuned, theory to simplify\nthe calculations.\nConnected to this, we notice that there are higher derivative quadratic operators of the form (∂ 2 π)2 /Λ2U\nwhich would naturally give a correction to the ζ two-point function larger then the one in (73) by a factor\nof the order (ΛU /H)2 \u001d 1. Again, we are assuming that these terms are tuned away.\nComing back to reabsorbing the divergency of the dim. reg. loop result of (73), the counterterms\ngive a correction of the form\n\u0014Z t\n\u0015\n(2)\n2\n2\n2\nhζ (t)icounter term = −2H Im\ndt1 hHint (t1 )π (t)i ,\n(70)\n−∞−\n\n(2)\n\n(2)\n\n(2)\n\nwhere Hint = −Lc , where Lc\n\nhζk (t)ζk0 (t)icounter\n\nis the counter term Lagrangian. This gives:\n\nterm\n\n= (2π 3 )δ (3) (~k + ~k 0 )\n\n1 H 8M 8 1\n8 k2\n32π 3 Ḣ 4 MPl\n\n(71)\n\n\u0002\n\u0001\n\u0003\n× − (C1 + 3C2 + C3 ) 1 + (kη)2 − 4 (3C1 + C3 ) (kη)4 + 2(C1 + C2 + C3 )(kη)6 .\nThese terms have to cancel the pole in 1/δ coming in the loop integral. At finite time, this is given\nby expression (68) with log(H/μ) taken to be equal to one. Notice that the finite time results depends\non (kη)4 , (kη)2 , (kη)1 , (kη)0 : imposing the cancellation of the poles leads to four equation in three\nunknowns: C1,2,3 . The solution still exists:\nC1 = 4π c23\n\n1\n,\nδ\n\nC2 =\n\n28 2 1\nπc ,\n15 3 δ\n\nC3 = −\n\n16 2 1\nπ c3 ,\n3\nδ\n\n(72)\n\nproviding another non trivial check of our results. The pole 1/δ represents the fact that these counterterm\nare actually divergent in three dimensions. To each one of the coefficients we can add a finite term that\n7\n\nIn the unitary gauge where the π Lagrangian is usually constructed [3], these term arise for example by\noperators such as (∂t2 δg 00 )2 , (∂t ∂i δg 00 )2 , (∂t δKii )2 , where Kii is related to the trace of the extrinsic curvature of\nuniform inflaton surfaces (see [3] for details.)\n\n21\n\n\fcan be determined by imposing the two point function at some renormalization scale to be equal to some\nquantity. We do not perform this last step here, as it is not the main point of our work.\nIn fact, our result shows that the divergency we found in sec. 3.2 are reabsorbable by local couterterms.\nThis is yet a third independent proof of this (the first one was obtained by performing the momentum\nintegration first in the loop integral regularized with a cutoff; the second one was by performing the dim.\nreg. loop integrals at finite external time in sec. 3.2.2; we will give a fourth proof of this in sec. 5).\nThough the finite terms in (72) could be determined only by performing the loop integrals in sec. 3\npaying attention to the finite terms it is worth mentioning that as usual the effect we have computed can\nbe much larger than the finite effects if we decided to renormalize the theory at an energy scale μ very\nfar from H. This is actually what makes sensible to compute the running and not the finite terms.\n\n3.4\n\nSummary of calculation with large π̇ 3 self-interaction\n\nThe case where the inflaton has a large self-interaction of the form π̇ 3 has allowed us to calculate oneloop corrections to the inflaton two-point function. We have performed the calculation in two different\nkind of regularizations: one with a sharp cutoff in momentum and frequency space, and the other in\ndimensional regularization. We have also performed the dim. reg. calculation at finite time, and we have\nalso shown the form of the logarithmic running by simply making dimensionless the loop integrals. We\nhave then performed the renormalization of the correlation function, by explicitly finding and solving for\nthe relevant counterterms.\nWe have found that all the calculations agree. The result is:\n\u0012 \u0013\n2 c23 H 8 M 8 1\nH\nhζ~k (t)ζ~k0 (t)i1−loop, t→+∞ = −(2π)3 δ (3) (~k + ~k 0 )\n×\nlog\n.\n(73)\n8 k3\n15π 2 Ḣ 4 MPl\nμ\nAs we had anticipated the logarithm is log(H/μ). We find this to be a very sensible result. First of all,\ncontrary to the log(k/μ) found in the former literature, the real space version of (73) is symmetric under\nthe rescaling\na → λa ,\nx → x/λ ,\nk → λk ,\n(74)\na symmetry of the problem. Second, it makes sense from a physical point of view: the Hubble scale\nis cutting off the infrared behavior that would otherwise be there in Minkowky space. The resulting\nlogarithm is of the form log(H/μ), which is similar to the form found in scattering amplitudes: log(E/μ)\nwhere E is the center of mass energy and μ is the renormalization scale. The energy probed by the\ninteractions during inflation is of order H.\n\n4\n\nGravitational interactions with N massless scalar fields\n\nWe now turn to the inflationary theory that Weinberg originally studied in [2]. This is a theory where\nan inflaton with a standard kinetic term is rolling down a flat potential and is interacting gravitationally\nwith N massless scalar fields. The Lagrangian is of the form:\n\"\n#\nZ\nN\nX\n1\n1 μν\n4 √\n2\nS = d x −g\n(∂φ) − V (φ) +\ng ∂μ σn ∂ν σn .\n(75)\n2\n2\nn=1\n\n22\n\n\fThough we are considering purely gravitational interactions, the contribution from the N massless scalar\nfields running in the loops will be enhanced by a factor of N with respect to the analogous interactions coming from the graviton and the inflaton running in the loop. For this reason we can avoid the\ncomplication of letting those run in the loops and concentrate on the σ scalar fields 8 .\nWe do not need to redo all the calculation. It is straightforward to include in the results of [2, 21]\nthe correction coming from the terms proportional to δ. In fact the only relevant terms proportional to δ\nwere those of the form log(−Hη) coming either from the wavefunction or from the measure of integration.\nAfter performing the time integrals, which converge and are dominated by η1,2 ∼ ηk , those terms become\nof the form log(−Hηk ). The contributions with two insertions of the cubing interaction Hamiltonian are\nof the form:\n\u0012 \u0013δ\nk\nkD\nF (δ) × (1 + δ log(−Hηk )) ,\n(76)\nμ\nwhere D is the correct number of dimension for the integral in three dimensions, while the overall factor\nof k δ comes from the two measures of integration times a (3 + δ) dimensional δ-function. As before, F (δ)\nwill be a dimensionless quantity of the form\nF (δ) =\n\nF0\n+ F1 ,\nδ\n\n(77)\n\nfor δ → 0. The coefficient of the term δ log(−Hηk ) is equal to one because this contributions involves six\nwavefunctions and two measures of integration. Eq. (76) can be expanded for small δ to give:\n\u0012\n\u0012 \u0013\n\u0012\n\u0013\u0012\n\u0013\n\u0012 \u0013\u0013 \u0012\n\u0013\nk\nF0\nF0\nH\n4\n4\nk 1 + δ log\n+ δ log(−Hηk )\n+ F1 ' k 1 + δ log\n+ F1 ,\n(78)\nμ\nδ\nμ\nδ\nwhich means that the coefficient of the logarithmic divergency is of the form\n\u0012 \u0013\nH\n.\nlog\nμ\n\n(79)\n\nThis analysis can be easily extended to the diagrams involving an insertion of the quartic interaction\nHamiltonian. In this case the integral in time converges and is dominated by the time of the horizon\ncrossing for the k-mode. The result after the momentum integration will be of the form:\n\u0012 \u0013δ\nk\nk\nF (δ) × (1 + δ log(−Hηk )) ,\nμ\nD\n\n(80)\n\nwhich is of the same form as (76). The factor in front of δ log(−Hηk ) is equal to one and this time it\ncomes from the fact that there are four wavefunctions contributing as 2δ log(−Hηk ) and one measure of\nintegration contributing as −δ log(−Hηk ). [21] shows that in the case of N spectator scalar fields, F (δ)\ndoes not have a pole at δ → 0, and therefore no logarithm can come from this term.\n8\n\nThe calculation done originally by Weinberg has a rather minor numerical mistake due to an inconsistent\nimplementation of the i \u000f prescription. This was noticed and fixed in [21]. Both [2, 21] performed their calculations\nin dimensional regularization and did not include the contributions proportional to δ from the scale factors in the\nmeasure of integration and from the d-dimensional wavefunctions and therefore obtained an incorrect logarithm of\nthe form log(k/μ).\n\n23\n\n\fSummarizing, in the case of N spectator scalar fields the form of the logarithm is log(H/μ). By\napplying our correction to the results of [2, 21] we find:\n\u0012 \u0013\nH\nπ Ḣ H 2 1\n.\n(81)\nhζ~k (t)ζ~k0 (t)i1−loop, t→+∞ = −(2π)3 δ (3) (~k + ~k 0 ) N 2 2 3 log\n6 H MPl k\nμ\n\n4.0.1\n\nTadpole diagrams and non 1PI diagrams\n\nIn computing one loop corrections to correlation functions of ζ there are important tadpole diagrams that\nhave been so far neglected. These tadpole diagrams are important not only for the one-point function, but\nalso, by attaching them to propagators, for all correlation functions. Because of translation invariance,\nthe external line attached to a tadpole diagram has to have zero wavenumber. In the former example\n(π̇ 3 interaction) these diagrams were therefore zero because the field π had an exact shift symmetry so\nthat every π had a derivative acting on it. For the N spectator scalar fields this is not case. The tadpole\ndiagrams have to be included. The expectation value of ζ in this theory is given by:\n\u0014Z t\n\u0015\n(3)\nhζ~k (t)i1−loop = −2Im\ndt1 hHint ζ~k (t)i\n(82)\n∞−\n!#\n\"Z\nt\ncl (t )\n1\nζ̇\n1\n= −(2π)3 δ (3) (~k)Im\ndt1 a(t1 )3 ζkcl ∗ (t) ζkcl (t1 ) (2hρσ (t1 )i0 − 3hpσ (t1 )i0 ) +\nhρσ (t1 )i0\n,\n2\nH\n∞−\nwhere we defined\nσ̇ 2 (~x, t) (∂i σ)2 (~x, t)\n+\ni,\n2\n2\nσ̇ 2 (~x, t) (∂i σ)2 (~x, t)\n−\ni,\nhpσ (t)i0 = h\n2\n6\n\nhρσ (t)i0 = h\n\n(83)\n\nand where the expectation value cannot depend on ~x because of translation invariance. At this order,\n(3)\n(3)\nHint = −Lint and is given by:\n!\n!\n! #\n\"\nZ\nN\nX\nζ̇\n∂\nσ\n∂\nσ\nζ\nḢ\n1\n3\nζ̇\n1\ni\nn\ni\nn\nζ+\n+ ∂i\n+ 2 2 ζ̇ σ̇n ∂i σn +\nζ−\nσ̇n2 . (84)\nLζσσ = d3 x a3\n−\n2\nH\na2\nH\nH ∂\n2\n2H\nn=1\n\nWe have assumed that the expressions for hρσ (t)i0 and hpσ (t)i0 , which are UV divergent, have been\nrenormalized and have been made finite (at most dependent on the renormalization scale). Their actual\nvalue is not important. The wavefunctions of ζ and σ in three dimensions are:\nζkcl = i \u0010\nσkcl = i\n\nH2\n2\n−2ḢMPl\n\n\u00111/2\n\n1\n(1 + ikη) e−ikη ,\nk 3/2\n\n(85)\n\nH2\n(1 + ikη) e−ikη .\nk 3/2\n\nA diagrammatic representation of this calculation is given in Fig. 1, where the distinction between\ndashed and continuous lines will be explained in sec. 5.1. The terms inside the Imaginary part in (82)\n\n24\n\n\f∂σ\nx\nζ\n∂σ\n\nFigure 1: Tadpole diagram. Dashed lines represent correlation functions, continuos lines represents\nGreen's functions. We will explain the origin of this notation later in sec. 5.1.\n\nare not real and therefore the diagram is not zero. However, the wavefunction in (85) diverges for k = 0,\nwhich means that the tadpole diagram is actually infinite even after having renormalized hρσ (t)i0 and\nhpσ (t)i0 . This is a problem that arises because eq. (13) does not fix the gauge at k = 0. For tree-level\ncalculations this is not important, as the zero mode of ζ is not observable. However, the tadpole diagram\ncan be attached to a ζ-propagator and affect at one-loop also correlation functions with k 6= 0. Notice\nthat the trilinear Lagrangian in ζ, Lζ 3 that can be found in [1] does contain vertexes of the form ζ(∂ζ)2\nand ζ 2 ζ̇ which allow for a k = 0 mode to be attached to a propagator and give a non-zero (and actually\ninfinite) result.\nHowever this problem can be dealt with in a rather straightforward way by ensuring that the zero\nmode of ζ is zero. This can be done by realizing that the tadpole is proportional to the expectation\nvalue of the stress-tensor of the σ fields in the unperturbed metric. Since translation invariance forces\nthe expectation value to depend only on t, this expectation value does nothing other than changing the\nbackground solution. The correct way to deal with the ζ zero-mode is therefore to define ζ as in equation\n(13), but where in this case the background quantities (and in particular the scale factor) satisfy the\nfollowing equations:\n1\n2\nH 2 = φ̇(t)2 + V (φ(t)) + hρσ (t)i0 ,\n3MPl\n2\n\u0010\n\u0011\n1\n2\n3H 2 + 2Ḣ = − φ̇(t)2 + V (φ(t)) − hpσ (t)i0 .\nMPl\n2\nFormally, this corresponds to manipulating the Lagrangian of (75) in the following way:\n\n\nNf\nZ\nX\n√\n1\n1\nS =\nd4 x −g  (∂φ)2 − V (φ) +\ng μν h∂μ σi ∂ν σi i\n2\n2\ni=1\n\n\nNf\nNf\nX1\nX\n1\n+\ng μν ∂μ σi ∂ν σi −\ng μν h∂μ σi ∂ν σi i .\n2\n2\ni=1\n\n(86)\n\n(87)\n\ni=1\n\nThe background solution comes from imposing that the first line of (87) starts quadratically in ζ (which\njust means solving the unperturbed equation of motions coming from the first line). Instead, the second\nterm in the second line ensures that the contribution coming from contracting the two σ's in the first term\nin the second line (i.e. every tadpole diagram or every subdiagram containing a tadpole subdiagram) is\ncancelled. This is represented pictorially in Fig. 2 for the one-point and the two-point function.\n\n25\n\n\f∂σ\nx\n\n+\n\nx\n\nζ\n\n=0\nζ\n\n∂σ\n\n∂σ\n\n!(∂σ)2\"\n\n∂σ\n\n!(∂σ)2\"\n\n+\nζ\nζ\nx\n\n=0\n\nζ\nζ\n\nζ\n\nζ\ny\n\nζ\n\nζ\n\nx\n\ny\n\nFigure 2: Upper: Cancellation of the tadpole diagram. Lower: Cancellation of the tadpole subdiagram\nin a two-point function diagram. Dashed lines represent correlation functions, continuos lines represents\nGreen's functions. We will explain the origin of this notation later in sec. 5.1\n\n5\n\nTime independence of ζ out of the horizon\n\nIn the former sections we showed that the one-loop corrections to the two point function of ζ give rise\nonly to logarithmic running of the form log(H/μ), where μ is the renormalization scale. As part of the\ncalculation we showed that loop corrections do not give rise to any additional time dependence of the\ntwo-point function of ζk , which therefore stays constant once the mode k is outside of the horizon. There\nis an important subtlety that was stressed by Weinberg in his original work [2, 22]. It is associated with\nthe fact that in order to compute the logarithmic running we did not need to renormalize explicitly the\ntheory. In other words, we had simply to assume that all the divergences could be reabsorbed by diff.\ninvariant local counter terms in the Lagrangian. It is possible that this might not be the case for the\nfollowing reason. If we take the calculation we did in dimensional regularization in sec. 3.2 we notice that\nfirst we performed the time-integrals in the loops by sending the external time to plus infinity and then\nsecond we performed the momentum integral finding a divergency that led to a logarithmic running. It is\npossible that this divergency might not be absorbable by a diff. invariant counter term in the Lagrangian.\nThis could happen if in doing the time integrals instead of sending the external time to infinity we were\nto keep it finite and the divergency only appeared as we sent this time to infinity. We are unable to say\nanything about this unless we perform explicitly the renormalization.\nWe have not ignored this issue completely in the former sections. For example when we did the\nregularization with a cut-off we first performed the momentum integrals at finite external time and\nsecond we performed the time integrals and in doing this we were able to take the external time to\ninfinity only at the very end. Since we found the same result as in dim. reg. this proved that the ζ\ncorrelation function could not depend on time and that the divergency we found should be re-absorbable\nby a counter term.\nThe only issue with this second calculation is that the cutoff in frequency and momentum space is\n\n26\n\n\fnot diff. invariant, which might lead us to suspect either that the logarithmic divergency that we found\nis not correct, or that there are additional time-dependent factors that were lost because of this. We\nbelieve that this is not the case, as the logarithmic running is an infrared quantity that should not be\nsensitive to the details of the UV regularization, particularly in our case.\nIn order to further address this point, in sec. 3.2.2 we performed the calculation in the dim. reg. for\nfinite external time. We found that the divergency was unaltered. This showed that the divergency was\nreal and had to be re-absorbed by a counter-term.\nThe calculation at finite external time we just mentioned was done only for the π̇ 3 theory. It is\npretty clear that it can be extended to the case of the N spectator σ fields, but we have not done this\nexplicitly. Here we will offer a proof of the constancy of ζ out of the horizon directly for the theory\nwith N spectator σ fields. We will then generalize it to the theory with the large π̇ 3 self-interaction.\nWe find that this additional proof improves our intuition on loop corrections to inflationary correlation\nand it will further guide us in speculating on how our results are generalized to higher loops and to\ndifferent interactions, which we will do in sec. 6. This way of doing the calculation can be thought of\nas doing the loop calculation by first doing the momentum integrals and then doing the time integrals.\nSince if one does the calculation in this order there are no subtleties with the possible appearance of fake\nUV divergencies we can assume that the quantities we will deal with after the momentum integral are\ndirectly the renormalized, physical ones. This is why this method of solving the loop will be so intuitive:\nit will reduce to solving the linear equations of ζ in Fourier space working directly with the renormalized\nstress tensor. Though very intuitive this method will be not be powerful enough to show that there is\nlogarithmic running in the two point function and calculate its coefficient. But it will make very clear\nwhy the ζ correlation function is constant in time and scale invariant once the mode is outside of the\nhorizon.\nAs we did in the introduction, we would like to stress that it would be a tragedy for inflation if the\ncorrelation function of ζ or of some other related operator did not become constant in time after horizon\ncrossing because of some loop interactions involving modes of Hubble size. If this were to be the case,\nthan we could expect the same to happen for interactions during the unknown part of the history of the\nUniverse from the end of inflation to nucleosynthesis during which the modes relevant for observation\nare well outside of the horizon. In fact, as it will become clear later in this section, the quantum nature\nof the loops is not really relevant here: any type of fluctuations can lead to the same effect, and it is\ntherefore extremely important to show that fluctuations on scales smaller or comparable to the horizon\ncannot influence modes outside the horizon. It is the constancy of ζ during the unknown parts of the\nhistory of the Universe that makes inflation, or any other theory of the early Universe, predictive.\nSummary of the section. In order to prove the constancy of ζ we will introduce a alternative way\nof looking at loop corrections to correlation functions. This will take some time and therefore we would\nlike to anticipate here the main logic and results. Concentrating on the theory with N massless spectator\nscalar fields σ, let us start by noticing that the operator ζk at time t is given by an expression of the\nfollowing form:\nZ\nt\n\nζk (t) =\n−∞\n\ndt0 GR;μν\n(k, t, t0 )Tσ,ζ;μν (k, t0 ) .\nζ\n\n27\n\n(88)\n\n\fHere T(σ)μν is the stress tensor of the σ fields:\nZ\n\u0001\nT(σ)ζ;μν (k, t) = d3 q −∂μ σζ(k) (q, t0 )∂ν σζ(k) (k − q, t0 ) + gμν (ζ(k)) ∂α σζ(k) (q, t0 )∂ α σζ(k) (k − q, t0 ) ,\n(89)\nand the subscript ζ represent the fact that in some cases the operators σ are to be computed in the\npresence of a ζ fluctuations. GR;μν\n(k, t, t0 ) is the retarded Green's function for ζ associated to the T(σ)μν .\nζ\nSince the σ's interact with the inflaton only through gravitational interactions, it is T(σ)μν that sources ζ.\nThe above expression just comes form inverting the linearized Einstein Tensor (which is invertible once\nwe fix the gauge), and in general it will be a complicated, apparently non-local expression. We will give\nthe explicit form for GR\nζ later in this section. Since we are interest in proving that correlation functions\nof ζk become constant when the mode k is outside of the horizon, we will be interested in considering t\nas a late time after horizon crossing as possible, for example the end of inflation. If t? is some time after\nwhich the mode k is outside of the horizon such that:\nk\n≡ \u000fout \u001c 1 ,\na(t? )H\n\n(90)\n\nwe can rewrite (88) as:\nZ\n\nt?\n\nζk (t) =\n\ndt\n−∞\n\n0\n\n(k, t, t0 )Tσ,ζ;μν (k, t0 )\nGR;μν\nζ\n\nZ\n\nt\n\n+\nt?\n\n(k, t, t0 )Tσ,ζ;μν (k, t0 ) ;\ndt0 GR;μν\nζ\n\n(91)\n\nThe first term on the right-hand side picks up the contribution to ζk (t) generated by the sources that\nacted up to the time t? , i.e. while the k mode is inside the horizon and as it goes out of the horizon,\nwhile the second term represents the contribution to ζk when k is already outside of the horizon. We\nwill analyze each of the two terms separately and we will show that they contribute to the ζ two point\nfunction in a way that is scale invariant and time independent. Let us anticipate the main result here.\nThe contribution from the first term on the right-hand side can be thougth of as the free evolution\nof ζ as determined by some initial condition at time t? . Because the free evolution of the ζk makes it\nfreeze after horizon crossing this means that this contribution will become time-independent after horizon\ncrossing. We will argue that this implies that the contribution is also scale invariant 9 .\nThe contribution from the second term on the right-hand side of (91) is instead a bit more complicated\nto deal with. It represents how the fluctuations in the T(σ)μν source the ζk mode when this is well outside\nof the horizon. Since the σ's have no potential term, their fluctuations are relevant only for the σ modes\nsmaller then the horizon. Still, the superposition of two short scale modes can lead to a long scale mode,\nand therefore affect ζk .\nConcentrating on the ζ two point function, there are two kind of contributions from these terms.\nThe first, that we will call cut-in-the-middle diagrams, represents how the free two-point function T(σ)μν\naffects the ζk two-point function. We will see that once the mode k is well outside of the horizon, the\nvarious Hubble patches spanned by one wavelength of ζk become uncorrelated. This means that the T(σ)μν\nfluctuations quickly average out and are not able to provide the coherent effect that would be necessary\nto source ζk on large scales. ζk becomes therefore time-independent once outside of the horizon, and\n9\n\nWe will work initially in the approximation of de-Sitter space, and we will then generalize to deviations from\nexact de-Sitter.\n\n28\n\n\fagain the symmetry under rescaling of the scale factor a will force the contribution from these terms to\nbe scale invariant.\nThe second kind of contribution from the right-hand side of (91) comes from computing the expectation value of T(σ)μν in the presence of a background ζk . The background ζk can be correlated with a\nfreely evolving ζk to obtain a two-point function. We will refer to this contribution as the cut-in-the-side\ndiagrams. The reason why this contribution shuts down as the k modes go outside of the horizon is that\nthe perturbation to the T(σ)μν due to the presence of a background ζ goes to zero. This happens because\nthe background ζ at this order in perturbation theory evolves freely. When a free ζ mode is outside of the\nhorizon it becomes constant and a simple redefinition of the scale factor a which is locally unobservable.\nThis means that the ζ mode cannot induce any physical perturbation to T(σ)μν . This implies that the\neffect of this term is again time independent, and due to the usual symmetry under rescaling of a it is\nscale invariant.\nThis will conclude the altenative proof that ζ is time-independent and scale invariant out of the\nhorizon for the case of the N spectators σ fields. Finally, we will be able to comment on slow roll\ncorrections to our calculation and extend this particular proof to the case of the large π̇ 3 self-interaction.\n\n5.1\n\nAn alternative diagrammatic expansion for loop corrections\n\nWe start the second proof of the constancy of ζk when it is outside of the horizon by presenting an\nalternative way of organizing the calculation. This approach was originally developed in [29] for a\nrestricted set of theories, and it was noted in [21] that the derivation was not consistent with the i \u000f\nprescription for choosing the interacting vacuum in the past. Here we will generalize the approach of [29]\nto more generic theories and we will show how the correct i \u000f prescription can be implemented.\nFor concreteness let us specialize to the ζ two-point function. We start by taking expression (14) and\ninserting the unit operator\n−1\nUint (t, −T̄ )Uint\n(t, −T̄ ) ,\n\nUint (t, −T̄ ) = T e−i\n\nRt\n−T̄\n\ndt0 Hint (t0 )\n\n,\n\n(92)\n\nbetween the two ζ's, to obtain\n\u0001 −1\n\u0001\n−1\nhζ 2 (t)i = h Uint\n(t, −∞− )ζ(t)Uint (t, −T̄ ) Uint\n(t, −T̄ )ζ(t)Uint (t, −∞+ ) i ,\n\n(93)\n\nHere T̄ is some arbitrary early time in the past, and we stress that no rotation of the contour of integration\nis performed for this operator. Ignoring for a moment the issue of the i \u000f prescription, we have written\nthe expectation of the operator ζ(t)2 as the product of the two freely evolved ζ(t)'s each evolved with the\ninteraction picture time evolution operator Uint . In other words, the ζ(t)2 correlation function is simply\ngiven by the correlation function of the evolved ζ(t)'s. A closer look at (93) might let us think that this\npicture does not quite work because of the difference in the extremes and the contour of integration of\nthe time integrals in the various evolutors. In order to make it clear that these differences do not play\nany significant role, we can deform the contour of integration for the two external Uint to obtain:\n\u0001 −1\n\u0001\n−1\n−1\nhζ 2 (t)i = hUint\n(−T̄ , −∞− ) Uint\n(t, −T̄ )ζ(t)Uint (t, −T̄ ) Uint\n(t, −T̄ )ζ(t)Uint (t, −T̄ ) Uint (−T̄ , −∞+ )i .\n(94)\nThe two most external Uint have the function of projecting the free vacuum into the interacting vacuum,\nwhile the rest of the U 's evolve each ζ from the time −T̄ to the time t. Notice that, in this approach,\n\n29\n\n\fwe cannot take the time −T̄ to −∞ from the beginning of the calculation because we would lose the\ncapability of projecting on to the true vacuum. We will comment shortly of the physical meaning of this\npoint.\nGoing back to eq. (93), we can Taylor expand in Hint to obtain\nhζ 2 (t)i =\nZ\nZ t\n∞\nX\nN\n=h\ndtN\ni\n\ntN\n\nZ\ndtN −1 . . .\n\n(95)\n!\n\u0015\n\u0014\nh\ni−∞− −∞−\nt2\n−∞−\ndt1 Hint (t1 ), Hint (t2 ), . . . [Hint (tN ), ζ(t)]−T̄ . . .\n−T̄\n\nN =0\n\n×\n\n∞\nX\n\niN\n\nZ\n\nt\n\nZ\n\ndt0N\n\ntN\n\ndt0N −1 . . .\n\nt2\n\nZ\n\n\u0014\n\ni−∞−\nh\n\u0002\n\u0003−∞\ndt01 Hint (t01 ), Hint (t02 ), . . . Hint (t0N ), ζ(t) −T̄ − . . .\n−T̄\n\nN =0\n\nwhere\nZ\n\nt\n\n\u0003−∞\ndt Hint (t ), ζ(t) −T̄ − ≡\n0\n\n\u0002\n\n0\n\nZ\n\nt\n\n0\n\n−∞−\n\n0\n\ndt Hint (t )ζ(t) −\n\nZ\n\nt\n\ndt0 ζ(t)Hint (t0 ) .\n\n−T̄\n\n\u0015−∞− !†\n−T̄\n\n(96)\n\n−T̄\n\nExpanding (95) up to second order in Hint , we obtain\nhζ 2 (t)i = hζ 2 (t)iCIS + hζ 2 (t)iCIM ,\n\n(97)\n\nwhere we have defined\n2\n\nhζ (t)iCIS = −2 Re\n\n\" Z\n\nt\n\nZ\ndt2\n\n\u0012Z\n+i\nhζ 2 (t)iCIM\n\n= −\n\n\u0012Z\n\nt\n\nt2\n\n!\n\u0014\nh\ni−∞− \u0015−∞−\n(3)\n(3)\ndt1 h Hint (t1 ), Hint (t2 ), ζ(t)\nζ(t)i\n−T̄\n\nt\n\nh\ni−∞−\n(4)\ndt1 h Hint (t1 ), ζ(t)\n−T̄\n\n\u0013\n\n−T̄\n\n\u0015\nζ(t)i ,\n\nh\ni−∞− \u0013 \u0012Z t\nh\ni−∞− \u0013†\n(3)\n(3) 0\n0\ndt1 h Hint (t1 ), ζ(t)\ndt1 Hint (t1 ), ζ(t)\ni\n−T̄\n\n−T̄\n\n(98)\n\nThe subscript CIS denotes what we call cut-in-the-side diagram, while CIM denotes cut-in-the-middle\ndiagram. If we remind ourselves that the ζ retarded Green's function is given by\n\u0002\n\u0003\n0\n0\n0\nGR\n(99)\nζ (x, x ) = iθ(t − t ) ζ(x), ζ(x ) ,\nwhere the commutator on the right is taken on the free fields, we can identify the structure we anticipated\nin eq. (88), with the additional subtlety that each term of the commutator is taken on a different time\npath (see eq. (98)). Alternatively, as in eq. (93), one can deform the contour of integration for the integral\nthat goes up to −∞, in such a way that it goes to −T̄ on the real axis, and then goes from there to −∞\non the imaginary axis. In this way, we can treat the integration from −∞ to −T̄ on the imaginary axis as\nthe projection of the state at time −T̄ onto the interacting vacuum, and we can interpret the diagrams\nin (98) as representing the evolution of the operators from time −T̄ to time t starting in the interacting\nvacuum. This subtlety will be largely irrelevant in proving the theorem.\nBy specializing to the case of the N spectator σ fields, we can see that there are two ways in which the\nequation solution for ζ can be perturbed by interactions of the form ζσ 2 . The first, which corresponds\nto the CIM diagrams, is by considering vacuum fluctuations of two σ fields, that combined in a T(σ),μν\n\n30\n\ni\n\n\f−p\nσ\n\np\nσ\n\nζ\nq\n\nζ\n\nt2\nt1\nσ\nσ\nq + p −q − p\n\nq\n\nFigure 3: Cut-in-the-middle diagrams. Continuos lines represents Green's functions, dashed lines represent free fields, and crosses represent correlations of free fields. Two crosses have to be contracted together\nin order for the diagram not to be zero.\n\ngenerate a ζ mode which then propagates freely. The correlation of two of these terms is the CIM\ndiagram represented in Fig. 3. The notation is such that a dashed line corresponds to a free field, while\na continuous line represents a retarded Green's function. The crosses represent correlation of free fields\n(two crosses have to be contracted together in order for a diagram not to be zero).\nThe CIS diagram represents instead the correction to the ζ correlation function due to the perturbation to the evolution of a primordial ζ fluctuation caused by the interaction with the σ fields. It is\nrepresented in Fig. 4. We see that an original ζ vacuum fluctuation interacts via the ζσ 2 interaction with\na σ vacuum fluctuation and modifies that fluctuation. This fluctuation evolves for some time and then\ninteracts again with another σ vacuum fluctuation, generating a ζ fluctuation that then propagates freely\nup to time t. The correlation among the original σ vacuum fluctations and of the original ζ fluctuation\nwith another ζ fluctuation that instead propagates undisturbed up to present gives rise to the diagram.\nNotice that the subdiagram on the left of the last ζ Green's function is nothing but the expectation value\nof the T(σ)μν at time t1 in the presence of a background ζ mode.\nThe names cut-in-the-side diagram and cut-in-the-middle diagram are meant to point out the fact\nthat in the CIM diagrams both of the ζ operators undergo a perturbed evolution, while in the CIS\ndiagram it is only one of the two ζ's that is perturbed. Though here we have concentrated only on\nthe 1PI diagrams with insertion of the cubic interaction Hamiltonian, it is straightforward to include\nalso the quartic and the non 1PI diagrams. Clearly, the CIM and the CIS diagrams are physically\nwell distinct: for example, the CIS diagram is proportional to the primordial ζ vacuum fluctuations,\nand goes to zero in the limit that there are no ζ primordial fluctuations. On the other hand, the CIM\ndiagrams are independent of the primordial ζ fluctuation. In generic situations, these two diagrams can\ngive parametrically distinct results. However in the case we are considering here where the σ and the\nζ fields are massless and undergo quantum vacuum fluctuations the two terms are comparable. In fact\nin the interacting theory the σ and ζ fields are mixed and both diagrams give equal size contributions.\nEquivalently although the overall result is independent of the time T that dependence only cancels in\nthe sum of the CIS and the CIM diagrams.\nWe will find the organization scheme and the physical intuition provided by these diagrams extremely\nuseful for proving the time-independence of the ζk correlation function once the mode k goes very well\noutside of the horizon. Furthermore in sec. 6 the intuition we will develop will allow us to generalize our\nresults in various ways.\n\n31\n\n\f−p\nσ\n\np\nσ\n\nζ\nt1\n\nq\n\nζ\n\nt2\n\nq\n\nζ\nq\n\nq\n\nζ\nq\n\nσ\nq+p\n−p\nσ\n\np\nσ\nζ\n\nζ\nt1\n\nq\n\nFigure 4: Cut-in-the-side diagrams. Continuos lines represents Green's functions, dashed lines represent\nfree fields, and crosses represent correlations of free fields. Two crosses have to be contracted together in\norder for the diagram not to be zero.\n\n5.2\n\nEarly time contribution\n\nLet us now begin to analyze the two contributions from (91), and let us start from the first term on the\nright-hand side, that we can rewrite as\nZ\n\nt?\n\nζk,1 (t) =\n−∞\n\n(k, t, t0 )T(σ)ζ;μν (k, t0 ) ,\ndt0 GR;μν\nζ\n\n(100)\n\nwhere the subscript 1 has been introduced to represent that we are talking of the contribution to ζ from\nthe first term on the right-hand side of eq. (91). Notice that since in this subsection we will automatically\nconsider the sum of the CIM and CIS diagram, the subtlety about the two different time-integration\npaths in the Green's function in (98) is irrelevant. In (100), the source is allowed to act only for the\ntime up to t? when the mode k begins to be well outside of the horizon, and therefore represents how\nζ is affected by early interactions. But exactly because of this it is easy to realize that as far as this\ncontribution is concerned the source will just create a certain ζk (t? ), ζ̇k (t? ) at time t? which will serve as\ninitial conditions for the subsequent free evolution. Therefore, this term is equivalent to study the time\ndependence of a freely evolved ζ(t) given some initial condition ζk (t? ), ζ̇k (t? ). The solutions in exact\nde-Sitter space are 10 :\ncl,∗\ncl\nζk (t) = ζk,1\n(t)a~k + ζk,1\n(t)a~† ,\n(101)\nk\n\n10\n\nWe will generalize later our results to deviations from de-Sitter.\n\n32\n\n\fwhere the wavefunction ζ1cl is given by:\ncl\nζk,1\n(t) = A1 (ζ ? , ζ̇ ? , k)\n\n1\nk 3/2\n\n(kη cos(kη) − sin(kη)) + A2 (ζ ? , ζ̇ ? , k)\n\n1\nk 3/2\n\n(cos(kη) + kη sin(kη))\n\n(102)\n\nwhere A1 (ζ ? , ζ̇ ? , k) , and A2 (ζ ? , ζ̇ ? , k) are the two integration constants determined by ζk? and ζ̇k? at time\nt? , and η is conformal time. Independently of the value of A1,2 , the solution for ζk goes to a constant\nvalue exponentially fast in cosmic time t.\nThe symmetries of de-Sitter space suggest that we demand that the contribution to the variance of\nζ in physical real space that is given by modes between two fixed physical scales (both smaller that\nH −1 ) should be independent of time. Satisfying this constraint implies that the coefficients A1,2 should\nbe independent of k which then results in a scale invariant spectrum for ζ. We thus expect that the\nk dependence of A1,2 is slow-roll suppressed and that the power spectrum of ζ is very close to scale\ninvariant.\n\n5.3\n\nLate time contribution: cut-in-the-middle diagrams\n\nLet us now analyze the contribution from the second part of eq. (91), that we denote with the subscript 2 :\nZ t\n(k, t, t0 )T(σ)ζ;μν (k, t0 ) .\n(103)\nζk,2 (t) =\ndt0 GR;μν\nζ\nt?\n\nThe contribution from these terms represents how the small scale σ's affects ζ even when the mode k is\nwell outside of the horizon. It is worth stressing that T(σ)ζ (k) is not zero in this regime. Two small scale\nσ modes can combine to create a low-k T(σ)ζ (k).\nLet us start with the CIM diagrams, where T(σ) is evaluated in the unperturbed metric. In this\ncase it is straightforward to find the equation of motion relating the σ's to ζ because the σ's live in\nan unperturbed metric. Further, since, as it will become evident soon, \u0001the CIM diagrams involve the\nself-correlation of four σ's, we can neglect all the terms of order O ζσ 2 from the equations of motion.\n\u0001\nThe simplest way to find this equation is to use the action we wrote earlier in (84) at order O ζσ 2 and\nto derive the equation of motion for ζ. Alternatively, one can solve the (0, 0) and (0, i) Einstein equations\nto find N and N i at order ζ and σ 2 (but not at order ζσ 2 ), and plug these back into the continuity\nequation\n∇μ T μ,0 = 0 .\n(104)\nOne finds:\n\nζ̇\n1\n1 i\n+\n∂ (σ̇∂i σ) ,\n2\nH\n2MPl H ∂ 2\n\u0012\n\u0013\nḢ\n1 ∂2\n1\n1\n(3H 2 + Ḣ) 1\n2\n2\n∂i N i = − 2 ζ̇ −\nζ\n−\nσ̇\n+\n(∂\nσ)\n−\ni\n2\n2 H 2 ∂ 2 ∂i (σ̇∂i σ) ,\nH\nH a2\na2\n4MPl H 2\n2MPl\nN =1+\n\n(105)\n\nand the resulting equation for ζ is\nζ̈ +\n+\n\n1\n2\nMPl\n\n!\n\n\u0012\n\u0013\n∂2\n(∂i σ)2\n1\n2\nζ̇ − 2 ζ −\nσ̇ +\n2\na\na2\n4MPl\n!\n∂t 3\nḢ\nḦ\n1 i\n+ H−\n+\n∂ (σ̇∂i σ) = 0 .\n2\n2\nH\n2Ḣ ∂ 2\n\nḢ\nḦ\n3H − 2 +\nH\nḢ\n\n33\n\n(106)\n\n\fNotice that in all of the above expressions (105) and (106) the terms of O(σ 2 ) should be understood as\nhaving the zero mode subtracted, a result of the tadpole subtraction procedure.\nThe above equation can also be written in terms of T(σ)μν :\n!\u0012\n!\n\u0013\n1\n∂2\n1\n∂t 3\nḢ\nḦ\n1\nḢ\nḦ\nζ̇ − 2 ζ −\nT\n+\nζ̈ + 3H − 2 +\n+\nH\n−\n+\n∂\nT\ni (σ)0i = 0 .\n2 (σ)00\n2\nH\na\n2\n2\nH\n∂2\n2MPl\nMPl\n2Ḣ\nḢ\n(107)\nWe are interested in solving this equation when the mode k of ζ is well outside the horizon. We can\ntherefore expand in powers of the external momentum (keeping track of the difference between ∂i (σ̇∂ i σ)\nand ∂i σ̇∂ i σ), and keep only the leading terms. We obtain:\n1\nζ̈ + 3H ζ̇ −\n2\n4MPl\n\n\u0012\n\n(∂i σ)2\nσ̇ +\na2\n2\n\n\u0013\n+\n\n3H 1 i\n2 ∂ 2 ∂ (σ̇∂i σ) = 0\n2MPl\n\n(108)\n\nNotice that at late time there are two sources for ζ: Tσ00 , which represents the energy density of the\nσ's, and ∂12 ∂i Tσ0i , which represents a non-local term proportional to the divergency of the velocity of the\nσ's.\nEq. (108) can be integrated to give:\n\u0012\n\u0013\u0012\n\u0012\n\u0013\n\u0013\nZ t\n(∂i σζ )2\n1\na(t0 )3\n1\n1 i\n0\n2\nζ2 (k, t) =\ndt\n−\nσ̇ζ +\n+ 3H 2 ∂ (σ̇ζ ∂i σζ )\n,\n(109)\n2 H 1 − a(t)3\n2\na2\n∂\n6MPl\nt?\nk\nwhere we have used the fact that we are interested in the contribution of the source from t? onwards.\nNotice how this expression is indeed of the form of eq. (103).\nWe are now ready to begin the computation of the CIM diagram. We have:\n\u0012\n\u00132 \u0012\n\u0013\u0012\n\u0013\nZ t\nZ t\n1\na(t1 )3\na(t2 )3\n0\nhζ2,k (t)ζ2,k (t)iCIM =\ndt1\ndt2\n1−\n1−\n×\n(110)\n2H\na(t)3\na(t)3\n6MPl\nt?\nt?\n\u0012\n\u0012\n\u0013\n\u0013\n\u0012\n\u0012\n\u0013\n\u0013\n1\n(∂i σ)2\n1 i\n1\n(∂i σ)2\n1 i\n2\n2\nh −\nσ̇ +\n+ 3H 2 ∂ (σ̇∂i σ) (t1 )\n−\nσ̇ +\n+ 3H 2 ∂ (σ̇∂i σ) (t2 ) i .\n2\na2\n∂\n2\na2\n∂\nk\nk0\nThere are six correlation functions to analyze. Let us start with the one involving\nh(σ̇ 2 )k (t)(σ̇ 2 )k0 (t0 )i ,\n\n(111)\n\nWe notice that this operator is divergent, and here and in the rest of the section, the operators appearing\nin the correlation functions should be understood to be regularized. Notice that here we are not interested\non the numerical value of these operators, but just on how they affect the late time behavior of ζ. The\nfact that they are regularized will be enough to show that they cannot induce a time dependence on\nζ 11 . At this point we can also notice that σ̇ 2 has a tadpole in de-Sitter space which renormalizes the\n11\n\nNotice that we can even assume that these quantities have been renormalized: contrary to the case where we\nintegrate first in time up to plus infinity and then in momentum, here we are doing the integration in opposite\norder, and therefore all UV divergencies are true UV divergencies of the theory and have to be reabsorbable either\nby a counterterm or by a field redefinition.\n\n34\n\n\fbackground Universe and its contribution to ζ is cancelled as explained in sec. 4.0.1. We can therefore\nconcentrate only on the connected part of the correlation h(σ̇ 2 )k (t)(σ̇ 2 )k0 (t0 )i.\nWe can rewrite h(σ̇ 2 )k (t)(σ̇ 2 )k0 (t0 )i as\nZ\nZ\n~\n~0 0\nh(σ̇ 2 )k (t)(σ̇ 2 )k0 (t0 )i =\nd3 x d3 x0 ei(k*~x+k *~x ) h(σ̇ 2 )(~x, t))(σ̇ 2 )(~x0 , t0 )i\n(112)\nZ\n~\n= δ (3) (~k + ~k 0 ) d3 x− e2ik*~x− h(σ̇ 2 )(~x− , t)(σ̇ 2 )(0, t0 )i ,\nwhere ~x− = |~x − ~x0 |/2. Since we are interested in small k's if this integral converges even for k = 0 then\nwe can set the oscillating exponential to one, and do the integral. In this way we will obtain a result\nwhich is exact up to corrections of order k/(a(t? )H) \u001c 1. We are therefore led to evaluate\nZ\n2\n2\n0\n(3) ~\n0\n~\nh(σ̇ )k'0 (t)(σ̇ )k0 '0 (t )i = δ (k + k ) d3 x− h(σ̇ 2 )(~x− , t)(σ̇ 2 )(0, t0 )i .\n(113)\nIn order to do this, we take the correlation function h(σ̇)(~x− , t)(σ̇ 2 )(0, t0 )i which can be constructed from\nhσ(~x− , t)σ(0, t0 )i, and take the large distance limit. The resulting expression is\nhσ(~x− , t)σ(0, t0 )i ∼ H 2 log(ΛIR ∆x2 ) ,\n\nH∆x \u001d 1 .\n\n(114)\n\nwhere ∆x2 = −(η − η 0 )2 + x2− and ΛIR is the IR cutoff. Notice that at equal times this is the standard\nlogarithmic dependence of massless scalar fields in de-Sitter space. If we define\nZ\nI(t, t0 ) ≡ d3 x− h(σ̇ 2 )(~x− , t)(σ̇ 2 )(0, t0 )i ,\n(115)\nthen we have that at large distances\nhσ̇ 2 (~x− , t)(σ̇ 2 )(0, t)i ∼\n\nH4\na(t)4 x4−\n\n(116)\n\nwhich tells us that I(t, t) is convergent in the infrared. Since the expression is regularized (or even\nrenormalized), then it converges even in the UV. This implies that I(t, t) is finite. Notice that in order\nfor I(t, t) to be compatible with the symmetry\na → λa ,\n\nx → x/λ ,\n\nk → λk ,\n\n(117)\n\nit must be proportional to 1/a(t)3 . Dimensional analysis fixes the powers of H, and we conclude that\nI(t, t0 ) goes as\ncU V H 5\nI(t, t) ∼\n.\n(118)\na(t)3\nwhere cU V is a number (expected to be or order one) that depends on the regularization and the renormalization procedure, and that controls what is the strength of the correlations of σ̇ 2 .\nEq. (118) tells us that the correlation function of σ̇ 2 is Poisson like distributed, i.e. its power spectrum\nis k independent. This is enough for us to be able to show that the contribution to ζ from the cut-inthe-middle diagram is time independent and therefore scale invariant.\n\n35\n\n\fIn fact by using that\nI t, t0\n\n\u0001\n\n≤\n\np\n|I (t, t) I (t0 , t0 )|\n\n(119)\n\nwe can write the contribution of this term to eq. (110) as follows\nhζ2,k (t)ζ2,k0 (t)i = δ\n\n(3)\n\n0\n\nZ\n\nt\n\n(k + k )\n\nZ\n\nt\n\ndt2\n\ndt1\nt?\n\n\u0012\n\nt?\n\n1\n2H\n24MPl\n\n\u00132 \u0012\n\u0013\u0012\n\u0013\na(t1 )3\na(t2 )3\n1−\n1−\nI(t1 , t2 )\na(t)3\na(t)3\n\n\u00132\n1\ndt2\n(I(t1 , t1 )I(t2 , t2 ))1/2\n≤ δ (k + k )\ndt1\n2H\n24MPl\nt?\nt?\n\u0012\n\u00132\nZ t\nZ t\n1\n1\n(3)\n0\n5\ndt2\ndt1\n∼ δ (k + k )\ncU V H\n2\n3/2\nMPl H\na(t1 ) a(t2 )3/2\nt?\nt?\ncU V H −3Ht?\n,\n∼ δ (3) (k + k 0 )\n4 e\nMPl\n(3)\n\n0\n\nZ\n\nt\n\nZ\n\nt\n\n\u0012\n\nwhere in the last passage we have neglected numerical factors. Eq. (90) implies\n\u0012\n\u0013\n1\nk\n?\nt =\nlog\n,\nH\nH\u000fout\nso we obtain:\nhζ2,k (t)ζ2,k0 (t)iCIM . δ (3) (k + k 0 )\n\n1 H4\n3\n4 cU V \u000fout N ,\nk 3 MPl\n\n(120)\n\n(121)\n\n(122)\n\nwhere we have reinserted the factor of N associated to the number of σ fields. We see that the contribution\nfrom h(σ̇ 2 )k (t)(σ̇ 2 )k0 (t0 )i to the cut-in-the-middle diagrams is time-independent and scale invariant.\nIt is worth giving some physical interpretation of this result. It is quite easy to understand why the\nresult is time-independent. In order for the CIM diagram to be able to induce a time dependence on ζk , it\nis necessary for the self correlation of T(σ)μν to be coherent on a wavelength of order a(t)/k as the external\ntime is taken to infinity. However, since the σ fields are massless, the relevant fluctuations are only at\nmost of order Hubble in size, and therefore T(σ)μν becomes quickly uncorrelated as the mode k spans\nmany Hubble regions. This is why the main effect from the CIM diagram is peaked at the smallest time\nt? when the mode k spans the smallest number of independent Hubble patches. Notice in fact how the\nsignal scales like \u000f3out which is approximately the inverse of the number of independent Hubble patches in\na box of radius a(t∗ )/k. Once the correlation function is time independent the symmetries of the problem\nforces it to be scale invariant. If we go back to real space, we have\nZ\nH4\n1\nhζ2 (~x, t)2 iCIM . 4 cU V N \u000f3out d3 k 3\n(123)\nk\nMPl\nwhich is invariant under rescaling of k.\nIt is easy to see that the contributions from all the other terms in eq. (110) behave in a very similar\nway, and results in a time-independent and scale-invariant correlation function. We compute explicitly\nthe contribution from the most interesting additional terms in App. B. We conclude that the contribution\nfrom the CIM diagrams are time-independent and scale-invariant and we proceed to study of the cutin-the-side diagrams.\n\n36\n\n\f5.4\n\nLate time contribution: cut-in-the-side diagrams\n\nWe now proceed to the study of the contribution from the CIS diagrams. These diagrams require to\ncompute the expectation value of the operator stress-energy tensor T(σ)ζ;μν of the σ's due to the interaction\nwith a ζ fluctuation at some earlier time. Let us represent this as\nhT(σ)μν (~x, t)iζ k .\n\n(124)\n\nDue to the divergencies involved in this calculation the expression of T(σ)ζ;μν needs to be regularized.\nAs in the former subsection we think of T(σ)μν directly as the regularized, or even renormalized, stress\ntensor at that time. The one-loop CIS diagram is represented in Fig. 4 where the vertex labeled by\nt2 represents the perturbation to a σ mode due to the interaction with the primordial ζ mode. There\nare three important things to notice that will make the proof possible even without having to explicitly\nperform the computation of the expectation value in (124). The first is that, because of translation\ninvariance, the wavenumber k of the ζ that perturbs the operator hT(σ)μν iζ k must be the same as the\nexternal ζ for which we are computing the expectation value, and therefore it is very outside the horizon\nfor the times of interest here: t > t? . The second important thing to notice is that because the σ's appear\nalways with derivatives the σ modes contributing to the finite part of hT(σ)μν (~x, t)iζ k have a momentum\nof order H or larger. The third important point is that at this order in perturbation theory the mode\nζ that perturbs T(σ)μν (~x, t) is the free field that lives in the unperturbed metric. This implies that the\ninitial ζk approaches a constant in time value as k/(a(t)H) → 0 and that the induced metric approaches\nthe unperturbed one, up to the simple rescaling of the scale factor\na(t) → eζk a(t) .\n\n(125)\n\nThe above points can be summarized by saying that we are left to compute how the expectation value\nof hT(σ)μν (~x, t)i gets altered in the presence of a metric that is just the unperturbed one with the simple\nrescaling of the scale factor, which is unobservable in the limit that it is spatially constant. We write\nT(σ)μν using the obervable quantities ρ, p, v in the standard way as:\nμ\nhT(σ)ν\niζk = h(ρσ + pσ )uμ uν + pσ δνμ iζk\n\nwhere\nμ\n\nu =\n\n\u0012\n\n1\n, δvσi\nNζk\n\n(126)\n\n\u0013\n(127)\n\nand\nhρσ i = hρσ (t)i0 + hδρσ iζk ,\n\n(128)\n\nhpσ i = hpσ (t)i0 + hδpσ iζk\n\nwhere the subscript ζ represent that these are expectation values taken with respect to the σ fields in\nthe background of ζ, while the subscript 0 represents that they are computed in an unperturbed metric.\nThe fact that a super-horizon wavelength becomes locally unobservable implies that for k/ (a(t)H) \u001c 1:\n\u0012\n\u0013\nk\nhδρσ (t)iζk ∼ hδpσ (t)iζk ∼ O hρσ (t)i0\nζk (t) ,\n(129)\na(t)H\n\u0012\n\u0013\nk\ni\nhδvσ (t)iζk ∼ O\nζk (t) .\na(t)H\n\n37\n\n\fThere is one subtlety in this argument that we would like to put into evidence: when we compute\nhT(σ)μν (~x, t)i, the insertion of the ζk perturbation as represented in Fig. 4 can be at such an early time\nt2 \u001c t? that the mode ζk is inside the horizon. In this case, the mode ζ is observable, and in principle\ncould imprint an effect on the T(σ)μν . However, in this regime the modes whose frequency is higher than\norder H at t ∼ t? (which are the modes contributing to T(σ)μν ) are much more energetic than the one of\nζ, and therefore they just follow their adiabatic interacting vacuum up to t ∼ t? 12 . A related subtlety\nin the above equation is also the fact that we are declaring that hδρσ (t)iζk , hδpσ (t)iζk , and hδvσi (t)iζk\ndepend on ζ evaluated at the same t. This is of course not true, and in general the relationship will be\nnon-local in time but given that at late times ζk (t) approaches a constant and that the expectation value\nis dominated by this regime we can approximate the dependence as being ζk (t).\nIt is easy to see that eq. (129) is enough for proving that the correlation function of ζ becomes timeindependent out of the horizon. In order to do this, we write again the continuity equation for the full\nstress tensor\nh∇μ T μ0 iζk = 0\n(130)\nwhich gives\nζ̈ +\n\nḢ\nḦ\n3H − 2 +\nH\nḢ\n\n!\nζ̇ +\n\nk2\nζ\na2\n\n(131)\n\nḢhṗσ i0 − Ḧ(hρσ i0 + hpσ i0 )\nH\nζ̇\n+\n(hδ ρ̇σ iζk + 3H (hδρσ iζk + hδpσ iζk ))\n2 Ḣ 2\n2 Ḣ\n2MPl\n2MPl\n!\n∂i i\nH\nḦ\nH\n2\n ̇ ζσ2 = 0\n+\nδNζσ2 + Hχζσ2 + H δN\n2 (hρσ i0 + hpσ i0 )h a δvσ (t)iζk + 6H +\n2MPl\nḢ\n\n+\n\nwhere we have defined:\nN = 1 + δNζ + δNσ2 + +δNζσ2 ,\ni\n\nχ = ∂i N = χζ + χσ2 + χζσ2 ,\n\n(132)\n(133)\n\nwith δNζ being proportional to ζ, δNσ2 to σ 2 and δNζσ2 to ζσ 2 , and similarly for χ. Notice that in\neq. (131), δNσ2 and χσ2 do not appear. This is so because the we are taking the expectation value with\nrespect to the σ field, and the tadpole cancellation ensures that those terms cancel.\nAs usual, we are interested in eq. (131) when the mode k is well outside the horizon. In this regime,\nwe can find solutions for δNζσ2 and χζσ2 at leading order in k/(a(t)H) \u001c 1. By solving at this order the\n12\n\nNotice that this same kind of reasoning applies to contributions to the ζ correlation function at times after\ninflation, for example during the period of reheating or during a GUT phase transitions (if this exists). These\nare epochs during which we know very little of what is going on. Still, the time scale associated to the thermal\nfluctuations for the case of reheating, or to bubble collisions in a GUT phase transition, is expected to be much\nfaster than the ζk mode when this is inside the horizon. Obviously, these fluctuations stay in their adiabatic vacuum\nat those times.\n\n38\n\n\f(0, 0) and the (0, i) Einstein equations we find:\nδNζσ2 ' −\nχζσ2\n\n1\n2\n2MPl\n\n\u0010\n\n3H 2 + Ḣ\n\u0013\n\u0012\nk2\n'O\nζ ,\na(t)2 H 2\n\n\u0011 hδρσ iζk\n\n(134)\n\nEq. (129) implies that δNζσ2 is of order k/(a(t)H)ζk and χζσ2 is of higher order. Therefore, by looking\nback at equation (131), in the long wavelength limit, we can see that the sources for ζ at late time decay,\nwhich is enough to see that the correlation function of ζ will not depend on time and is scale invariant.\nIn fact by taking the leading terms in k/(aH) \u001c 1 and in slow-roll parameters in eq. (131), and using\n(129), we obtain:\n\u0012\n\u0013\nZ t\nZ t\na(t0 )3\nH2\nk\nH5\nk\n0 1\n4\n0\nζk (t) ∼\ndt\nH ζk (t ) 0\ndt0 0\n1−\n∼ 2 ζk (t)\n(135)\n3\n2\nH\na(t)\na(t )H\na(t )H\nMPl Ḣ\nMPl Ḣ\nt?\nt?\n∼\n\nH5\nk 1 −Ht?\nH2\nζ\n(t)\ne\n∼\nk\n2 \u000f ζk (t)\u000fout ,\n2 Ḣ\nHH\nMPl\nMPl\n\nHere for simplicity we have dropped higher order corrections in the slow roll parameters. The result can\nbe trivially extended to include those as well. Corrections suppressed by higher derivatives in eq. (129)\nand (131) are down by further powers of \u000fout \u001c 1. For the cut-in-the-side diagrams we therefore obtain:\nhζ2,k (t)ζ2,k0 (t)iCIS ∼ δ (3) (k + k 0 )\n\n1 H4\n4 N \u000fout ,\nk 3 \u000f2 MPl\n\n(136)\n\nwhere we have reinserted the number N of spectator fields. This is a time-independent and scale-invariant\nresult.\nSo far in this section we have neglected almost completely the non 1PI diagrams that we studied\nin sec. 4.0.1. The tadpole cancellation procedure applies also in this case where we perform the momentum integration first and the time integration second. Therefore, they are automatically zero once\nthe background has been redefined according to (86). All the CIS diagrams give a time-independent\nscale-invariant result.\nFinally, we need to study the case where a ζ generated by the first term of the right-hand side of (91),\nthat we called ζ1 , correlates with a term generated by the second term on the right-hand side of (91),\nthat we called ζ2 . By using the standard property of correlation functions, we have\n|hζk ,1 (t)ζk0 ,2 (t)i| . hζk ,1 (t)ζk0 ,1 (t)i\n\n\u00011/2\n\n\u00011/2\nhζk ,2 (t)ζk0 ,2 (t)i\n.\n\n(137)\n\nSince each of the terms inside the square root is time-independent and scale-invariant, we conclude that\nso is for the correlation between ζ1 and ζ2 .\nThis last result completes the analysis of all the contributions to the correlation of ζ at late time and\ntherefore we conclude that the result is scale-invariant and time-independent. The procedure to compute\nthe loops that we used in sec. 4 is justified in yet another way.\n\n39\n\n\f5.5\n\nSlow-roll corrections\n\nSo far in the above calculation we have not included all the slow roll corrections, for example those ones\nthat come from the wavefunction of the fields as the spacetime deviates from de-Sitter. It is rather simple\nto include the first corrections due to the slow roll parameters as follows. In the former subsection 5,\nwe have seen that ζk at some late time is the result of three distinct contributions: the free evolution of\nζk from some initial condition at time t? (which is in practice just a constant), the contribution which\ncomes from the variance of T(σ)μν (which is exponentially peaked at t? ), and finally the contribution from\nthe perturbation to the expectation value of T(σ)μν due to a primordial ζ fluctuation (which is again\nexponentially peaked at t? ).\nThe last two of these contributions are exponentially sensitive only to the time t? , and so, in the case\nof some time dependence of H, Ḣ, . . ., the result will be the same as the one we obtained, just replacing\nH, Ḣ, . . . with H(t? ), Ḣ(t? ), . . . .\nThe same is true also for the first contribution if t? is chosen to be close to the time of horizon\ncrossing so that the variation of the parameters of the spacetime between t? and the time of horizon\ncrossing is negligible. This is clearly possible given the slow variation of the parameters with respect to\nthe exponential stretching of the modes. We therefore conclude that with the replacement\nH, Ḣ, . . . → H(t? ), Ḣ(t? ), . . . ,\n\n(138)\n\nwe can incorporate the leading slow roll corrections.\n\n5.6\n\nπ̇ 3 large self-interactions\n\nThe above proof of the constancy of ζ was done for the case of N spectator massless scalar fields. The\nsame result holds for the case of the π̇ 3 interactions. Considering for example the cubic interactions,\neverything in the above proof proceeds in the same way, apart from trivial combinatoric factors, if, of\nthe three π's in the vertex π̇ 3 , we consider one to be the inflaton and the other two to be two spectator\nfields. In fact, in the above proof, there were only two crucial points. The first is that for the CIM\ndiagrams,the correlation of σ̇ 2 and the similar operators was not scale-invariant, but rather Poisson like.\nThere is no difference in this case (notice that because here we could ignore metric fluctuations the proof\nwould be even simpler). The second important point of the above proof was that, in the CIS diagrams,\nhδρσ iζk , hδpσ iζk , . . . were all going to zero as k/(a(t)H) → 0. Clearly this will be the same also in this\ncase, as the free mode πkcl becomes a constant out of the horizon and π is only derivatively coupled. It is\nagain correct to assume that hπ̇ 2 iζk , , . . . are all going to zero as k/(a(t)H) → 0. We therefore conclude\nthat the correlation function of ζ is constant also in this case, justifying also in this alternative way the\ncalculation of sec. 3. Slow roll corrections can be included as before.\n\n6\n\nOther interactions and higher loops\n\nFinally we comment on how our results are expected to generalize to higher loop calculations and for\nmore generic interactions.\nThe two kind of theories we have studied resulted in logarithms of the form log(H/μ), where μ is the\nrenormalization scale. Current bounds of the non-Gaussianities of the CMB that limit the size of the\n\n40\n\n\fπ̇ 3 self-interactions [14] make these corrections extremely small. The one loop effects change with the\nk-mode only slowly due to the slight dependence of the Hubble scale on the horizon-crossing time of the\nk-mode. These slow-roll suppressed effects are in general very small but it is possible to imagine that if\nthis were not to be the case, then a procedure similar to the renormalization group could be developed\nand implemented. This lies beyond the scope of the current paper.\nOne common characteristic of the two interactions we had studied was that the fields running in\nthe loop appeared in the Lagrangian with at least one derivative. What happens when this is not the\ncase, for example if the σ fields have a (positive) mass term? This case has been studied and solved\nby Weinberg in [22]. In his first paper [2], he noticed that if the mass term was treated perturbatively\nas a two-line vertex, and one used in the loops the wavefunctions of a massless scalar field in de-Sitter\nspace, then the integral in time in the loops would not converge. This interaction might then give rise to\na time-depedence of the ζ correlation function. In a following paper [22], however, he solved the puzzle\nby noticing that summing up all the perturbative mass insertions into the propagator (i.e. using the\nwavefunction of a massive field in de-Sitter) resulted in a wavefunction that decayed exponentially at\nlate times and the time integrals in the loop converged again. The apparent time-dependence of the ζ\ncorrelation function disappeared.\nWe would like to see how this effect appears in the arguments we presented in the previous section.\nFor massive σ's there is a term proportional to m2 σ 2 in the stress energy tensor. Let us imagine treating\nthe mass term perturbatively and repeating the steps of sec. 5. We expect to find a time dependence in\nthe ζ correlation function.\nIn the cut-in-the-side (CIS) diagrams of sec. 5.4, we would have to compute the perturbation to the\nexpectation value of the σ stress tensor T(σ)μν due to a background free ζ mode. It is still true also in\nthis case that a constant ζ is unobservable and that therefore the perturbations to ρσ and pσ would be\nproportional to the first derivative of ζ. This is enough to make the source in the CIS diagrams shut\ndown at late time, and therefore there is no induced time dependence from the CIS diagrams in the case\nof massive σ's either.\nThe cut-in-the-middle (CIM ) diagrams of sec. 5.3 are different. Those diagrams involved the correlation function of T(σ)μν . In the massless case, the various terms of the stress tensor involved always\nderivatives acting on the σ fields, and this was enough to ensure that the correlation functions of the\nvarious terms of the stress tensor became Poisson like for distances longer than the horizon. This implied\nthat these fluctuations were not able to source a ζ mode once the wavelength was much outside of the\nhorizon. In the massive case things are different. The part of the stress tensor that is proportional to\nm2 does not involve derivatives of σ which means that the correlation function of this part of the stress\ntensor is not Poisson but scale invariant. This part of T(σ)μν has correlations for very long distances\nand therefore it is able to source a ζ mode regardless of how much outside of the horizon that mode is.\nPhysically this is quite easy to understand. Let us consider a ζ fluctuation of wavenumber k. At the time\nwhen this fluctuation crosses the horizon there will be a fluctuations of T(σ)μν on the same wavelength\ngenerated by two σ fluctuations one of which has a wavelength of order 1/k, while the other has a longer\nwavelength and crossed the horizon at an earlier time. At this point if we are using the massless σ wavefunctions the σ's freeze and remain constant. They remain up in their potential wherever they happened\nto land at horizon crossing. This results in a region of additional potential energy which now begins to\nexpand as the Universe expands, without never decaying very much like a space-dependent cosmological\nconstant where the space dependence is given by the wavenumber k of the T(σ)μν fluctuation. Since the\nadditional potential energy never decays it is able to coherently source the mode ζk and therefore it\n\n41\n\n\fσ\n\nm\n\nm\n\nσ\n\nm\n\nσ\n\nx\nFigure 5: Mass insertions to obtain the massive propagator.\n\ninduces a time-dependent effect. Notice that fluctuations of T(σ)μν on the same scale produced at a later\ntime by shorter scale σ's are instead suppressed, because they average out as in the massless case. It is\njust the fluctuations of the σ modes of wavelength up to order k that matter.\nIt is clear that as a result of the approximations used the above calculation does not capture what will\nactually happen. Once the mode is outside of the horizon the σ field cannot remain up its potential and\nwill move down and reach the minimum. In fact it will do so either exponentially fast in time undergoing\noscillations (if m > 3H/2) or very slowly (if m < 3H/2). We just do not see this effect above because\nwe have treated the mass term perturbatively. Since the out of the horizon solution for a massive field\nscales as [22]:\na(t)λ± ,\n(139)\nwhere\n3\nλ± = − ±\n2\n\nr\n\n9 m2\n−\n,\n4 H2\n\n(140)\n\n2\n\nm\nthe effect of the mass term is perturbatively of order H\n2 Ht. If one is interested in times when this\ncorrection is important then the only way to properly take it into account is to re-sum all the mass\ninsertions and use the wavefunctions of a massive field (see fig. 5). If one were to do so, then, after some\nlong time in the case of small m one would see that the source for the ζ mode shuts down and ζ becomes\nconstant. Notice that for small masses this happens after a time\n\ntc ∼\n\n1 m2\n.\nH H2\n\n(141)\n\nWether this time scale is long or not depends on the problem. For example, in standard inflation, this\ntime scale might be longer than the time to reheating and in this case the time dependence of ζ will be\nrelevant. Notice however that the overall effect goes down as the energy density, as m2 , and therefore it\nbecomes smaller and smaller in the limit m → 0. This time scale tc is clearly short if one wishes to study\ntime-dependence of correlation functions in eternal inflation or even in de-Sitter (which would require\nchanging gauge and defining some relevant observable [18]). In this case one can conclude that the ζ\ncorrelation function becomes constant in time a time of order tc after horizon crossing.\nWhat happens if the σ fields do not have a mass term, but for example a potential of the form λσ 4\nor even higher dimensional potentials such as σ 6 /Λ2 , where the σ = 0 point is a minimum? All these\nterms would enter if we were to do the calculation at more than one loop. Let us just concentrate on\nλσ 4 , the other cases being just a trivial higher-loop generalization of this one. Clearly if one were to treat\nthe λ term perturbatively one could exactly reproduce the argument we just made for the massive case\n(extended this time to two loops) and find that the CIM diagram produce a time dependence in the ζ\ncorrelation function. The solution is the same as in the massive case. In that case, we had to re-sum all\nthe insertion of the mass term in the propagator (see fig. 5), here we will have to re-sum all the insertion\n\n42\n\n\fσ\nσ\n\nσσ\n\nσ σ\n\nσ\n\nσ\nσ\n\nx\nFigure 6: One-loop insertions to obtain the effectively massive propagator.\n\nof the quartic interaction in the propagator (see fig. 6). This will generate effectively a mass term for\nthe σ fields and will make the field decay and the induced time dependence of the ζ correlation function\ndisappear eventually. As in the former case it is still true that the time at which a ζk mode becomes\nconstant after horizon crossing might be very long. There is just one subtlety in the above argument.\nThis is the fact that in principle a massive counter term could cancel the mass term induced by the\nquartic interaction (this would require a large amount of tuning, as we know from the Higgs particle in\nthe Standard Model but still in principle it could happen) and therefore one would still have a massless\nfield which would therefore induce a time dependence on ζ by jumping up its potential and staying there.\nWe find it very hard to imagine that this cancellation is actually possibly in a quasi de-Sitter space as we\nexpect that finite terms in the loop to inherit some time dependence from the time dependence of H and\nthe counterterm should not be able to reabsorb that. However even assuming that the mass can be tuned\naway there are other diagrams that are relevant and that make the field run down. In fact a particle in\na quartic potential rolls down to the bottom even in the absence of any explicitly quadratic term. For\nexample one could take the diagram in Fig. 7 where all σ's in the dashed lines which represent primordial\nfluctuations get correlated with other primordial ones from the right-handed part of the CIM diagram 13 .\nThis diagram will let the σ field roll down its potential and therefore make ζk constant eventually though\npossibly a long time after it has crossed the horizon.\nNotice that similarly to the apparent time-dependence of ζ induced by these kinds of interactions,\nwe expect there to be also IR divergencies associated with the momenta loop integrals. These have been\nfound for example in [24, 27, 30, 31, 32] in the context of spectator scalar fields and of the standard\nslow rolling inflaton. If we consider for example the case of the massive spectator σ fields we discussed\nat the beginning of the section, these IR divergencies are associated to the counting of all the σ modes\nthat crossed the horizon before the mode k did. If one uses the massless wavefunctions, these modes that\ncrossed the horizon arbitrarily in the past do not decay and all contribute to the correlation function,\ninducing an IR divergency. As for the induced time-dependence of ζ, we expect that the resummation of\nthe diagrams we discussed will let all the spectator fields decay, effectively multiplying the wavefunction of\nthe modes outside of the horizon by some power of (kη), where k is the wavenumber of the mode. In this\nway, the IR divergency is expected to disappear as well. Reference [31] offers an example, valid in some\nparticular theories, of the resummation techniques of the diagrams and shows that upon resummation of\nthe wavefunction this particular kind of IR divergencies disappear.\nThere are other interactions that Weinberg pointed out would make the time integrals in the loop not\n13\n\nThis diagram can be thought of as representing the difference between σσ 2 and σhσ 2 i, where it is only the\nsecond term that can be potentially removed from the mass counterterm.\n\n43\n\n\fσ\nσ\nσ\nσ\nσ\n\nσ\n\nσ\n\nx\n\nσ\nσ\nσ\n\nFigure 7: Left-handed part of one of the CIM diagram whose resummation will make σ decay out of the\nhorizon even in the absence of a mass term. Each of the σ's in the dashed lines has to be correlated with\na corresponding one on the right-handed side of the diagram.\n\nconverge and therefore apparently make ζ time-dependent 14 . Studying these interactions goes beyond\nthe scope of the current paper. We just mention here that an example of a term of this kind is ζ̇σ n with n\nbeing an integer. Such a term would for example arise when the σ fields have a potential of the form σ n .\nBut because the σ's have a potential they would roll down to their minimum and would not induce a time\ndependence of ζ even after including the ζ̇σ n vertex. We believe this is missed in Weinberg's theorem\n[2, 22] as in its proof every interaction is analyzed on its own assuming that all fields are massless. In\nreality, it seems to us these kind of interactions are highly constrained by symmetries and come in groups.\nTherefore we think they should be studied together in specific setups.\nThough we believe the above arguments to be very sound, strictly speaking we did not prove them.\nIt would be interesting to directly verify them and also to explicitly find and study cases, if they exist in\nlocal theories, where the kind of interactions we discussed in the last paragraph appear and do induce a\ntime dependent effect of the ζ correlation function even after the proper treatment of the mass term and\nof the related diagrams we discussed in Fig.s 5, 6, and 7 has been taken into account.\n\n7\n\nConclusions\n\nIn this paper we have studied one-loop corrections to the two-point function of the curvature perturbation\nζ in two kind of theories: one in which the inflation has large self-interactions, and one in which the\ninflaton interacts gravitationally with N massless spectator scalar fields.\nIn both cases, we found that the one-loop corrections are time-independent and scale-invariant. Further, we have shown that there is a logarithm of the form\n\u0012 \u0013\n1\nH\n2\nhζk i1−loop ∼ 3 × β log\n,\n(142)\nk\nμ\nwhere H is the Hubble scale during inflation, μ is the renormalization scale, and β can be thought of\n14\n\nThese are for example the ones that contain time derivatives of the fields, and that appear in the Lagrangian\nas multiplying in three dimensions a number of scale factors a equal to one, after counting as minus two powers of\na every appearance of a time derivative [2].\n\n44\n\n\fas being related to the β function of the correlation function. This result is physically sensible: loop\ncorrections for a weakly coupled theory are small if we choose the renormalization scale close to the\nenergy scale of the process we are interested in. For inflation, this energy is Hubble.\nOur results differ from the previous literature, which instead found that a logarithmic running of the\nform log(k/μ). After arguing that symmetries forbid this result we were able to identify the mistake\nin previous calculations. Dimensional regularization was applied incorrectly. We also performed our\ncalculation using a different regularization scheme finding the same result. We were also able to explicitly\nrenormalize the simplest of the two theories we studied.\nFor the first time we studied the time dependence of the ζ correlation function finding that for\nthe interactions we considered ζ becomes constant outside of the horizon even at one-loop level. This\nis the case once the background spacetime has been properly redefined in order to take into account\ntadople diagrams. These findings offer an alternative proof that the divergencies have to be reabsorbed\nby local counterterms and are not instead infrared divergencies that appear as UV divergencies because\nof the particular way the calculation is performed. We achieved this not only by explicitly renormalizing\nthe theory but also by performing the loop calculation at finite external time. We further developed\nan alternative method for computing loop corrections based on solving perturbatively the Heisemberg\nequations for the operators, which allowed us to work at every time directly with the renormalized physical\nquantities. In this approach the physical reason why ζ becomes constant outside of the horizon appears\nclearly. It is due to the combined effect of the fact that a constant ζ mode is unobservable and that the\nstress energy tensor which sources ζ becomes rapidly uncorrelated for scales longer than the horizon.\nWe are then able to use the intuition we developed to infer how our results generalize to different\ninteractions and to higher loops. In particular, contrary to claims in the literature, we argue that no long\nterm time dependence is generated by any form of spectator field, even if they have a potential term.\nWe find our result to be important not only because generally they increase our understanding of\ninflation and of de-Sitter space, but also specifically for two problems. The first is related to the fact that\nduring the evolution of the Universe from the end of inflation up to now there are various epochs, such as\nreheating, where we do not know the details of the physical processes at play and thus we could imagine\nthat there were very large fluctuations on the horizon scale. The theory of the spectators massless scalar\nfields can be thought of as a weakly coupled version of this, and it would have been worrisome if we\nhad found a time-dependence on ζ on large scales. In fact, while the effect from the σ fields would have\nbeen in any event small, the effect from fluctuations during reheating could have altered the value of ζ\ncompletely and the predictivity of inflation would have been lost. Our findings prove that this is not the\ncase.\nA second reason why we consider our findings relevant is connected to slow roll eternal inflation. If\nwe trivially extend our finding to the inflaton two-point function at coincidence, the fact that the one\nloop corrections are time-independent and scale-invariant means that the smoothed two point function\nof the inflaton field at coincidence grows linearly with time. This means that the results of [18, 19] still\napply after including the kind of loop corrections we computed, and that therefore, at least for what\nthese interactions are concerned, standard slow roll inflation exists and there is a sharp phase transition\nas a function of the slope of the potential where eternal inflation begins.\nWe think our results motivate other interesting calculations. For example, it would be interesting to\nverify with an explicit calculation our arguments of sec. 6 about the fact that the resummation of higher\nloops makes the time dependence induced by spectator fields with a potential at a fixed perturbative\norder disappear, following and generalizing the calculation of [31], and understand the issue also in the\n\n45\n\n\fcase in which the inflaton and the graviton are let run in the loops. This would be particularly important\nfor assessing the existence and the characterization of slow roll eternal inflation. Further, it would be\ninteresting to study loop corrections and how the renormalization procedure works for the most generic\ntheories of inflation. For single field inflation, this would amount to study the most general form of\nthe Lagrangian presented in [3], of which we studied only one particular limit in sec. 3. There are\nalso questions at a more fundamental level that our calculation might help answer. For example, in the\ndS/CFT correspondence [33, 34], it is speculated that the time-dependence of correlation functions, which\noccurs at perturbative level in theories where spectators scalar fields have a potential term, should be\nmapped into renormalization group running for some operators in the CFT. It would be very interesting\nto see how this happens in a concrete way. Further, it is possible that the structure of the loop corrections\nthat we found might be related, in string theory, to the density of single-string states, similarly to what\nhappens in negatively curved spaces [35]. This is another direction worth exploring.\nAcknowledgements: We thank Sergei Dubovsky for intial collaboration in the project. We acknowledge David Gross for pointing out to us the possible relevance of loop-corrections in eternal inflation.\nWe thank Peter Adshead, Nima Arkani-Hamed, Paolo Creminelli, Thomas Dumitrescu, Richard Easther,\nRaphael Flauger, Zohar Komargodski, Eugene A. Lim, Juan Maldacena, Alberto Nicolis, Steve Shenker,\nDavid Shih, Eva Silverstein, Filippo Vernizzi, Giovanni Villadoro and Steven Weinberg for many useful\nand stimulating comments. This work was supported by NSF grants AST-0506556, AST-0907969 and\nPHY-0855425, and fellowships from the David and Lucile Packard Foundation.\n\nA\n\nLoop integrals with momentum frequency cutoff\n\nHere we give some details of the calculation of the loop integrals that lead to eq. (34). The two momenta\nintegrals can be done exploiting the identity:\nZ\n\n3\n\n3\n\nd k1 d k2 δ\n\n(3)\n\n2π\n~ k2 + ~k)f (k1 , k2 , k) =\n(~k1 + +\nk\n\nZ\n\nΛa(t1 )\n\nZ\n\nk1 +k\n\ndk1 k1\n0\n\ndk2 k2 f (k1 , k2 , k).\n\n(143)\n\n|k1 −k|\n\nThe result of the two momenta integrations therefore splits into the sum of two terms: one in which we\ntake the contributions of small k1 's such that k1 − k < 0, and one where we take the contribution from\n\n46\n\n\fthe large k1 's such that k1 − k > 0. The contribution from the large k1 's gives:\n1 c23 H 4 M 8\nt→+∞\n8\nk 3 2π 2 Ḣ 4 MPl\n\u0001\n8 − 11k(η1 − η2 ) + 7k 2 (η12 − η22 )\n\nhζ~k (t)ζ~k0 (t)i1−loop, A,\nn\nh\n× H 4 η14 e2kη1\n\n= (2π)3 δ (3) (~k + ~k 0 )\n\nZ\n\n0\n\nZ\ndη2\n\n−∞\n\nη2 (1+ H\n)\nΛ\n\n−∞\n\ndη1\n\nη22\n− η2 )6\n\nη12 (η1\n\n\u0001i\n− 4e2k(2η1 −η2 ) 8 − 21k(η1 − η2 ) + 27k 2 (η1 − η2 )2 − 20k 3 (η1 − η2 )3 + 8k 4 (η1 − η2 )4 +\n\"\n\"h\n\u0010\n\u0011\u0011\nΛ η2\n\u0001\u0010\n2H\n−1\nη1\n+e\ne2kη1 H 2 η12 H 2 η12 + 2Λ Hη1 (η1 − η2 ) + 2Λ2 (η1 − η2 )2 8 − 5(η1 − η2 ) + k 2 (η1 − η2 )2 +\n\u0001\n+4Λ3 Hη1 (η1 − η2 )3 (2 − k(η1 − η2 )) + 2Λ4 (η1 − η2 )4 +\n\u0010\n\u0011\u0011\n\u0001\u0010\n+e2kη2 H 2 η12 H 2 η12 + 2Λ Hη1 (η1 − η2 ) + 2Λ2 (η1 − η2 )2 8 + 5(η1 − η2 ) + k 2 (η1 − η2 )2 +\n\u0001\u0003\n+4Λ3 Hη1 (η1 − η2 )3 (2 + k(η1 − η2 )) + 2Λ4 (η1 − η2 )4\n.\n\n(144)\n\nIt is quite straightforward to realize that integrations of the terms in the third, fourth,\nfifth\nand\u0011\u0011sixth\n\u0010\n\u0010\nΛ η2\nthe\nlines of (144) can not give rise to any logarithmic divergency. Because of the Exp 2 H η1 − 1\nintegrand becomes exponentially small as soon as |η1 − η2 | becomes larger than η2 H/Λ, which is the\nminimum distance in conformal time allowed by our cutoff. This means that for these term the integral\nis peaked at the cutoff region, and it can not give rise to any logarithmic dependence. Integrations of\nthe terms in the second and third line of (144) instead is supported on all scales, and a straightforward\nintegration leads to our result in (34).\nWe do not reproduce here the contribution from the small k1 's. It is quite straightforward and it\ngives rise only to finite terms.\n\nB\n\nAdditional correlation functions in the CIM diagrams\n\nHere we complete the calculation of the correlation functions in (110)\n\u0001 It is easy to\u0001\n\u0001 for the CIM diagrams.\nsee that the contribution to the ζ correlation from h(σ̇ 2 )k (t) (∂i σ)2 k0 (t0 )i and from h (∂i σ)2 k (t) (∂j σ)2 k0 (t0 )i\nproceeds in very similar terms to the term studied in (122), and results in a contribution parametrically\n\n47\n\n\fequal. To analize the contribution from h\n\n1 i\n∂ (σ̇∂i σ) k\n∂2\n\n\u0001\n\n(t)\n\n1 i\n∂ (σ̇∂i σ) k0\n∂2\n\n\u0001\n\n(t0 )i we have to study\n\n\u0013\n\u0013\n\u0012\ni j Z\n1 i\n1 i\n0\n(3) ~\n0 k k\n~\n∂\n(\nσ̇∂\nσ)\n∂\n(\nσ̇∂\nσ)\n(t)\n(t\n)i\n∼\nδ\n(\nk\n+\nk\n)\nd3 x− h(σ̇∂i σ) (~x− , t) (σ̇∂j σ) (0, t0 )i\ni\ni\n2\n4\n∂2\n∂\nk\nk'0\nk0 '0\n\u00131/2\n\u0012 i lZ\nkk\n3\n(3) ~\n0\n~\nd x− h(σ̇∂i σ) (~x− , t) (σ̇∂l σ) (0, t)i\n. δ (k + k )\n×\nk2\n\u0012 j mZ\n\u00131/2\nk k\n3\n0\n0\n×\nd x− h(σ̇∂j σ) (~x− , t ) (σ̇∂m σ) (0, t )i\nk2\n\u00131/2\n\u0012 i lZ\nkk\n3\n(3) ~\n0\n~\nd x− hσ̇(~x− , t)σ̇(0, t)ih∂i σ(~x− , t)∂l σ(0, t)i\n∼ δ (k + k )\n×\nk2\n\u00131/2\n\u0012 j mZ\nk k\n3\n0\n0\n0\n0\nd\nx\nh\nσ̇(~\nx\n,\nt\n)\nσ̇(0,\nt\n)ih∂\nσ(~\nx\n,\nt\n)∂\nσ(0,\nt\n)i\n×\n−\n−\nj\n−\nm\nk2\n1\n1\n∼ 2\ncU V H 5 ,\n(145)\n1/2\nk a(t) a(t0 )1/2\n\u0012\n\nh\n\nwhere we have used (114) and in particular that hσ̇(~x− , t)∂i σ(0, t)i = 0. Plugging back in the expression\nfor hζζiCIM , and proceeding as in the former example, we obtain that this term contributes in the\nfollowing way\nZ t\nZ t\n5\n1\n(3)\n0 cU V H 1\nhζ2,k (t)ζ2,k0 (t)iCIM . δ (k + k )\ndt1\ndt2\n4\n2\n1/2\nMPl k t?\na(t) a(t0 )1/2\nt?\n4 1\ncU V H 3 1 −Ht?\n(3)\n0 H\n∼ δ (3) (k + k 0 )\ne\n∼\nδ\n(k\n+\nk\n)\n4\n4 k 3 cU V \u000fout .\nk2\nMPl\nMPl\nWe find that this contribution\nis also time independent\nand scale invariant. Proceeding analogously with\n\u0001\n\u0001\n1 i\n2\n0\nthe correlation from h σ̇ k (t) ∂ 2 ∂ (σ̇∂i σ) k0 (t )i we find that\nh σ̇\n\n2\n\n\u0012\n\n\u0001\nk'0\n\n(t)\n\n1 i\n∂ (σ̇∂i σ)\n∂2\n\n\u0013\n\n1\n1\nc H5 ,\n(t0 )i . δ (3) (~k + ~k 0 )\n3/2\n0 )1/2 U V\nk\na(t)\na(t\n0\nk '0\n\n(146)\n\nwhich leads to\nhζ2,k (t)ζ2,k0 (t)iCIM . δ\n∼ δ (3) (k + k 0 )\n\n(3)\n\ncU V H 4 1\n(k + k )\n4\nk\nMPl\n0\n\nZ\n\nt\n\nZ\n\nt\n\ndt1\nt?\n\ndt2\nt?\n\n1\na(t)3/2 a(t0 )1/2\n\n(147)\n\nH4 1\n2\n4 k 3 cU V \u000fout .\nMPl\n\nwhich \u0010is again\u0011 time-independent and scale-invariant. It is straightforward to see that the contribution\n\u0001\nfrom h (∂i σ)2 (t) ∂12 ∂ i (σ̇∂i σ) k0 (t0 )i gives a parametrically equal contribution. This last one exhausted\nk\nall contributions to the late time correlation of ζ from the CIM diagrams, and we therefore conclude\nthat this contribution is time-independent and scale-invariant.\n\n48\n\n\fReferences\n[1] J. M. Maldacena, \"Non-Gaussian features of primordial fluctuations in single field inflationary models,\" JHEP 0305 (2003) 013 [arXiv:astro-ph/0210603].\n[2] S. Weinberg, \"Quantum contributions to cosmological correlations,\" Phys. Rev. D 72 (2005) 043514\n[arXiv:hep-th/0506236].\n[3] C. Cheung, P. Creminelli, A. L. Fitzpatrick, J. Kaplan and L. Senatore, \"The Effective Field Theory\nof Inflation,\" JHEP 0803 (2008) 014 [arXiv:0709.0293 [hep-th]].\n[4] M. Alishahiha, E. Silverstein and D. Tong, \"DBI in the sky,\" Phys. Rev. D 70 (2004) 123505\n[arXiv:hep-th/0404084].\n[5] N. Arkani-Hamed, P. Creminelli, S. Mukohyama and M. Zaldarriaga, \"Ghost Inflation,\" JCAP 0404\n(2004) 001 [arXiv:hep-th/0312100].\n[6] L. Senatore, \"Tilted ghost inflation,\" Phys. Rev. D 71 (2005) 043512 [arXiv:astro-ph/0406187].\n[7] X. Chen, M. x. Huang, S. Kachru and G. Shiu, \"Observational signatures and non-Gaussianities of\ngeneral single field inflation,\" JCAP 0701 (2007) 002 [arXiv:hep-th/0605045].\n[8] R. Flauger, L. McAllister, E. Pajer, A. Westphal and G. Xu, \"Oscillations in the CMB from Axion\nMonodromy Inflation,\" arXiv:0907.2916 [hep-th].\n[9] M. Zaldarriaga, \"Non-Gaussianities in models with a varying inflaton decay rate,\" Phys. Rev. D 69\n(2004) 043508 [arXiv:astro-ph/0306006].\n[10] D. H. Lyth, C. Ungarelli and D. Wands, \"The primordial density perturbation in the curvaton\nscenario,\" Phys. Rev. D 67 (2003) 023503 [arXiv:astro-ph/0208055].\n[11] D. Green, B. Horn, L. Senatore and E. Silverstein, \"Trapped Inflation,\" arXiv:0902.1006 [hep-th].\n[12] N. Barnaby, Z. Huang, L. Kofman and D. Pogosyan, \"Cosmological Fluctuations from Infra-Red\nCascading During Inflation,\" Phys. Rev. D 80 (2009) 043501 [arXiv:0902.0615 [hep-th]].\nlocal from WMAP 5-year data,\"\n[13] K. M. Smith, L. Senatore and M. Zaldarriaga, \"Optimal limits on fNL\nJCAP 0909 (2009) 006 [arXiv:0901.2572 [astro-ph]].\n\n[14] L. Senatore, K. M. Smith and M. Zaldarriaga, \"Non-Gaussianities in Single Field Inflation and their\nOptimal Limits from the WMAP 5-year Data,\" arXiv:0905.3746 [astro-ph.CO].\n[15] A. Slosar, C. Hirata, U. Seljak, S. Ho and N. Padmanabhan, \"Constraints on local primordial\nnon-Gaussianity from large scale structure,\" JCAP 0808 (2008) 031 [arXiv:0805.3580 [astro-ph]].\n[16] A. H. Guth, \"The Inflationary Universe: A Possible Solution To The Horizon And Flatness Problems,\" Phys. Rev. D 23 (1981) 347; A. D. Linde, \"Nonsingular Regenerating Inflationary Universe,\"\nCambridge University preprint Print-82-0554 (1982); P. J. Steinhardt, Natural Inflation, in The\nVery Early Universe, ed. G.W. Gibbons, S.W. Hawking and S. Siklos, Cambridge University Press,\n\n49\n\n\f(1983); A. Vilenkin, \"The Birth Of Inflationary Universes,\" Phys. Rev. D 27 (1983) 2848; A. S. Goncharov, A. D. Linde and V. F. Mukhanov, \"The Global Structure Of The Inflationary Universe,\"\nInt. J. Mod. Phys. A 2 (1987) 561.\n[17] S. Weinberg, \"Anthropic Bound on the Cosmological Constant,\" Phys. Rev. Lett. 59 (1987) 2607.\n[18] P. Creminelli, S. Dubovsky, A. Nicolis, L. Senatore and M. Zaldarriaga, \"The Phase Transition to\nSlow-roll Eternal Inflation,\" JHEP 0809 (2008) 036 [arXiv:0802.1067 [hep-th]].\n[19] S. Dubovsky, L. Senatore and G. Villadoro, \"The Volume of the Universe after Inflation and de\nSitter Entropy,\" JHEP 0904, 118 (2009) [arXiv:0812.2246 [hep-th]].\n[20] N. Arkani-Hamed, S. Dubovsky, A. Nicolis, E. Trincherini and G. Villadoro, \"A Measure of de Sitter\nEntropy and Eternal Inflation,\" JHEP 0705 (2007) 055 [arXiv:0704.1814 [hep-th]].\n[21] P. Adshead, R. Easther and E. A. Lim, \"Cosmology With Many Light Scalar Fields: Stochastic\nInflation and Loop Corrections,\" Phys. Rev. D 79 (2009) 063504 [arXiv:0809.4008 [hep-th]].\n[22] S. Weinberg, \"Quantum contributions to cosmological correlations. II: Can these corrections become\nlarge?,\" Phys. Rev. D 74 (2006) 023508 [arXiv:hep-th/0605244].\n[23] C. Cheung, A. L. Fitzpatrick, J. Kaplan and L. Senatore, \"On the consistency relation of the 3-point\nfunction in single field inflation,\" JCAP 0802 (2008) 021 [arXiv:0709.0295 [hep-th]].\n[24] K. Chaicherdsakul, \"Quantum cosmological correlations in an inflating universe: Can fermion\nand gauge fields loops give a scale free spectrum?,\" Phys. Rev. D 75 (2007) 063522 [arXiv:hepth/0611352]; D. Seery, \"One-loop corrections to a scalar field during inflation,\" JCAP 0711 (2007)\n025 [arXiv:0707.3377 [astro-ph]]; E. Dimastrogiovanni and N. Bartolo, \"One-loop graviton corrections to the curvature perturbation from inflation,\" JCAP 0811 (2008) 016 [arXiv:0807.2790 [astroph]]. P. Adshead, R. Easther and E. A. Lim, \"The 'in-in' Formalism and Cosmological Perturbations,\" arXiv:0904.4207 [hep-th]; X. Gao and F. Xu, \"Loop Corrections to Cosmological Perturbations in Multi-field Inflationary Models: I. Entropy Loops,\" JCAP 0907 (2009) 042 [arXiv:0905.0405\n[hep-th]]; D. Campo, \"Quantum corrections during inflation and conservation of adiabatic perturbations,\" arXiv:0908.3642 [hep-th].\n[25] M. Gell-Mann and F. E. Low, \"Quantum electrodynamics at small distances,\" Phys. Rev. 95 (1954)\n1300.\n[26] K. G. Wilson, \"The Renormalization Group: Critical Phenomena And The Kondo Problem,\" Rev.\nMod. Phys. 47 (1975) 773.\n[27] Our results might affect for example: M. van der Meulen and J. Smit, \"Classical approximation\nto quantum cosmological correlations,\" JCAP 0711, 023 (2007) [arXiv:0707.0842 [hep-th]]. They\nmight have influence also on the literature on the zero mode of the perturbations: V. K. Onemli and\nR. P. Woodard, \"Super-acceleration from massless, minimally coupled φ4 ,\" Class. Quant. Grav. 19,\n4607 (2002) [arXiv:gr-qc/0204065]; V. K. Onemli and R. P. Woodard, \"Quantum effects can render\nw < −1 on cosmological scales,\" Phys. Rev. D 70 (2004) 107301 [arXiv:gr-qc/0406098]; E. O. Kahya\nand V. K. Onemli, \"Quantum Stability of a w < −1 Phase of Cosmic Acceleration,\" Phys. Rev.\n\n50\n\n\fD 76, 043512 (2007) [arXiv:gr-qc/0612026]; A. M. Polyakov, \"De Sitter Space and Eternity,\" Nucl.\nPhys. B 797 (2008) 199 [arXiv:0709.2899 [hep-th]].\n[28] S. P. Miao and R. P. Woodard, \"The fermion self-energy during inflation,\" Class. Quant. Grav.\n23 (2006) 1721 [arXiv:gr-qc/0511140], S. P. Miao and R. P. Woodard, \"Leading log solution for\ninflationary Yukawa,\" Phys. Rev. D 74 (2006) 044019 [arXiv:gr-qc/0602110].\n[29] M. Musso, \"A new diagrammatic representation for correlation functions in the in-in formalism,\"\narXiv:hep-th/0611258.\n[30] N. Bartolo, S. Matarrese, M. Pietroni, A. Riotto and D. Seery, \"On the Physical Significance of\nInfra-red Corrections to Inflationary Observables,\" JCAP 0801 (2008) 015 [arXiv:0711.4263 [astroph]].\n[31] A. Riotto and M. S. Sloth, \"On Resumming Inflationary Perturbations beyond One-loop,\" JCAP\n0804, 030 (2008) [arXiv:0801.1845 [hep-ph]].\n[32] M. S. Sloth, \"On the one loop corrections to inflation and the CMB anisotropies,\" Nucl. Phys. B\n748 (2006) 149 [arXiv:astro-ph/0604488]; M. S. Sloth, \"On the one loop corrections to inflation. II:\nThe consistency relation,\" Nucl. Phys. B 775 (2007) 78 [arXiv:hep-th/0612138]; D. Seery, \"One-loop\ncorrections to the curvature perturbation from inflation,\" JCAP 0802 (2008) 006 [arXiv:0707.3378\n[astro-ph]]; D. Seery, \"A parton picture of de Sitter space during slow-roll inflation,\" JCAP 0905\n(2009) 021 [arXiv:0903.2788 [astro-ph.CO]]; Y. Urakawa and K. i. Maeda, \"One-loop Corrections to\nScalar and Tensor Perturbations during Inflation in Stochastic Gravity,\" Phys. Rev. D 78 (2008)\n064004 [arXiv:0801.0126 [hep-th]].\n[33] A. Strominger, \"The dS/CFT correspondence,\" JHEP 0110 (2001) 034 [arXiv:hep-th/0106113].\n[34] E. Witten, \"Quantum gravity in de Sitter space,\" arXiv:hep-th/0106109.\n[35] J. McGreevy, E. Silverstein and D. Starr, \"New dimensions for wound strings: The modular\ntransformation of geometry to topology,\" Phys. Rev. D 75 (2007) 044025 [arXiv:hep-th/0612121];\nE. Silverstein, \"Dimensional mutation and spacelike singularities,\" Phys. Rev. D 73 (2006) 086004\n[arXiv:hep-th/0510044].\n\n51\n\n\f"}