{"id": "http://arxiv.org/abs/0710.2491v1", "guidislink": true, "updated": "2007-10-12T15:42:39Z", "updated_parsed": [2007, 10, 12, 15, 42, 39, 4, 285, 0], "published": "2007-10-12T15:42:39Z", "published_parsed": [2007, 10, 12, 15, 42, 39, 4, 285, 0], "title": "The Rapid Outbursting Star GM Cep: An EX-or in Tr 37?", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0710.0951%2C0710.1326%2C0710.3043%2C0710.2158%2C0710.2782%2C0710.0365%2C0710.5881%2C0710.2440%2C0710.2987%2C0710.3897%2C0710.3595%2C0710.4450%2C0710.4459%2C0710.4724%2C0710.2009%2C0710.4764%2C0710.0299%2C0710.3136%2C0710.1854%2C0710.2491%2C0710.2681%2C0710.4460%2C0710.4427%2C0710.1611%2C0710.1328%2C0710.0774%2C0710.4034%2C0710.5729%2C0710.0146%2C0710.0426%2C0710.2967%2C0710.4881%2C0710.0664%2C0710.4166%2C0710.0071%2C0710.5349%2C0710.0345%2C0710.3073%2C0710.2707%2C0710.1207%2C0710.4684%2C0710.1827%2C0710.1879%2C0710.1829%2C0710.2589%2C0710.3147%2C0710.4755%2C0710.1923%2C0710.4621%2C0710.5637%2C0710.3807%2C0710.1043%2C0710.3574%2C0710.2264%2C0710.4209%2C0710.2075%2C0710.0522%2C0710.2940%2C0710.1960%2C0710.4795%2C0710.2032%2C0710.3333%2C0710.0102%2C0710.3292%2C0710.1413%2C0710.2478%2C0710.2855%2C0710.0790%2C0710.4278%2C0710.2527%2C0710.3433%2C0710.0583%2C0710.0061%2C0710.1939%2C0710.3400%2C0710.1882%2C0710.5585%2C0710.5153%2C0710.3405%2C0710.0303%2C0710.0710%2C0710.1406%2C0710.0523%2C0710.5146%2C0710.2202%2C0710.2724%2C0710.4689%2C0710.0392%2C0710.5846%2C0710.0105%2C0710.1287%2C0710.0948%2C0710.0330%2C0710.3021%2C0710.0198%2C0710.5791%2C0710.2469%2C0710.5671%2C0710.5878%2C0710.2275%2C0710.4567&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The Rapid Outbursting Star GM Cep: An EX-or in Tr 37?"}, "summary": "We present optical, IR and millimeter observations of the solar-type star\n13-277, also known as GM Cep, in the 4 Myr-old cluster Tr 37. GM Cep\nexperiences rapid magnitude variations of more than 2 mag at optical\nwavelengths. We explore the causes of the variability, which seem to be\ndominated by strong increases in the accretion, being similar to EX-or\nepisodes. The star shows high, variable accretion rates (up to ~10$^{-6}$\nMsun/yr), signs of powerful winds, and it is a very fast rotator (Vsini~43\nkm/s). Its strong mid-IR excesses reveal a very flared disk and/or a remnant\nenvelope, most likely out of hydrostatic equilibrium. The 1.3 millimeter fluxes\nsuggest a relatively massive disk (Mdisk~0.1 Msun). Nevertheless, the\nmillimeter mass is not enough to sustain increased accretion episodes over\nlarge timescales, unless the mass is underestimated due to significant grain\ngrowth. We finally explore the possibility of GM Cep having a binary companion,\nwhich could trigger disk instabilities producing the enhanced accretion\nepisodes.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0710.0951%2C0710.1326%2C0710.3043%2C0710.2158%2C0710.2782%2C0710.0365%2C0710.5881%2C0710.2440%2C0710.2987%2C0710.3897%2C0710.3595%2C0710.4450%2C0710.4459%2C0710.4724%2C0710.2009%2C0710.4764%2C0710.0299%2C0710.3136%2C0710.1854%2C0710.2491%2C0710.2681%2C0710.4460%2C0710.4427%2C0710.1611%2C0710.1328%2C0710.0774%2C0710.4034%2C0710.5729%2C0710.0146%2C0710.0426%2C0710.2967%2C0710.4881%2C0710.0664%2C0710.4166%2C0710.0071%2C0710.5349%2C0710.0345%2C0710.3073%2C0710.2707%2C0710.1207%2C0710.4684%2C0710.1827%2C0710.1879%2C0710.1829%2C0710.2589%2C0710.3147%2C0710.4755%2C0710.1923%2C0710.4621%2C0710.5637%2C0710.3807%2C0710.1043%2C0710.3574%2C0710.2264%2C0710.4209%2C0710.2075%2C0710.0522%2C0710.2940%2C0710.1960%2C0710.4795%2C0710.2032%2C0710.3333%2C0710.0102%2C0710.3292%2C0710.1413%2C0710.2478%2C0710.2855%2C0710.0790%2C0710.4278%2C0710.2527%2C0710.3433%2C0710.0583%2C0710.0061%2C0710.1939%2C0710.3400%2C0710.1882%2C0710.5585%2C0710.5153%2C0710.3405%2C0710.0303%2C0710.0710%2C0710.1406%2C0710.0523%2C0710.5146%2C0710.2202%2C0710.2724%2C0710.4689%2C0710.0392%2C0710.5846%2C0710.0105%2C0710.1287%2C0710.0948%2C0710.0330%2C0710.3021%2C0710.0198%2C0710.5791%2C0710.2469%2C0710.5671%2C0710.5878%2C0710.2275%2C0710.4567&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We present optical, IR and millimeter observations of the solar-type star\n13-277, also known as GM Cep, in the 4 Myr-old cluster Tr 37. GM Cep\nexperiences rapid magnitude variations of more than 2 mag at optical\nwavelengths. We explore the causes of the variability, which seem to be\ndominated by strong increases in the accretion, being similar to EX-or\nepisodes. The star shows high, variable accretion rates (up to ~10$^{-6}$\nMsun/yr), signs of powerful winds, and it is a very fast rotator (Vsini~43\nkm/s). Its strong mid-IR excesses reveal a very flared disk and/or a remnant\nenvelope, most likely out of hydrostatic equilibrium. The 1.3 millimeter fluxes\nsuggest a relatively massive disk (Mdisk~0.1 Msun). Nevertheless, the\nmillimeter mass is not enough to sustain increased accretion episodes over\nlarge timescales, unless the mass is underestimated due to significant grain\ngrowth. We finally explore the possibility of GM Cep having a binary companion,\nwhich could trigger disk instabilities producing the enhanced accretion\nepisodes."}, "authors": ["Aurora Sicilia-Aguilar", "Bruno Merin", "Felix Hormuth", "Peter Abraham", "Thomas Henning", "Maria Kun", "Nimesh Patel", "Attila Juhasz", "Wolfgang Brandner", "Lee Hartmann", "Szilard Csizmadia", "Attila Moor"], "author_detail": {"name": "Attila Moor"}, "author": "Attila Moor", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1086/524055", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0710.2491v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0710.2491v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "43 pages, including 10 figures, ApJ in press", "arxiv_primary_category": {"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0710.2491v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0710.2491v1", "journal_reference": null, "doi": "10.1086/524055", "fulltext": "The Rapid Outbursting Star GM Cep: An EX-or in Tr 37?\nAurora Sicilia-Aguilar1 , Bruno Merı́n2 , Felix Hormuth1 , Péter Ábrahám3 ,\nThomas Henning1 , Mária Kun3 , Nimesh Patel4 , Attila Juhász1 , Wolfgang Brandner1 ,\n\narXiv:0710.2491v1 [astro-ph] 12 Oct 2007\n\nLee W. Hartmann5 , Szilárd Csizmadia3 , Attila Moór3\nsicilia@mpia.de\nABSTRACT\nWe present optical, IR and millimeter observations of the solar-type star 13277, also known as GM Cep, in the 4 Myr-old cluster Tr 37. GM Cep experiences\nrapid magnitude variations of more than 2 mag at optical wavelengths. We explore the causes of the variability, which seem to be dominated by strong increases\nin the accretion, being similar to EX-or episodes. The star shows high, variable\naccretion rates (up to ∼10−6 M⊙ /yr), signs of powerful winds, and it is a very\nfast rotator (Vsini ∼43 km/s). Its strong mid-IR excesses reveal a very flared\ndisk and/or a remnant envelope, most likely out of hydrostatic equilibrium. The\n1.3 millimeter fluxes suggest a relatively massive disk (MD ∼0.1 M⊙ ). Nevertheless, the millimeter mass is not enough to sustain increased accretion episodes\nover large timescales, unless the mass is underestimated due to significant grain\ngrowth. We finally explore the possibility of GM Cep having a binary companion,\nwhich could trigger disk instabilities producing the enhanced accretion episodes.\nSubject headings: stars: variable - accretion disks - stars: pre-main sequence\n- stars:individual:GM Cep (13-277)\n1\n\nMax-Planck-Institut für Astronomie, Königstuhl 17, 69117 Heidelberg, Germany\n\n2\n\nResearch and Scientific Support Department, European Space Agency, ESTEC, Keplerlaan 1, 2200 AG\nNoordwijk, The Netherlands\n3\n\nKonkoly Observatory, H-1525 Budapest, P.O.Box 67, Hungary\n\n4\n\nCenter for Astrophysics, 60 Garden Street, Cambridge, MA 02138\n\n5\n\nUniversity of Michigan, 830 Dennison 500 Church St., Ann Arbor, MI 48109\n\n\f–2–\n1.\n\nIntroduction\n\nThe open cluster Tr 37 is one of the best studied intermediate-aged young star formation\nregions. Aged ∼ 4 Myr (Sicilia-Aguilar et al. 2004, 2005; hereafter Paper I, Paper II), and\nlocated at 900 pc distance (Contreras et al. 2002), it contains a rich population of T Tauri\nstars (TTS; ∼180 members with spectral types G to M2) of which about 48% still show\nIR excesses consistent with protoplanetary disks at different evolutionary stages (SiciliaAguilar et al. 2006a, b; hereafter Paper III, Paper IV). While most of the stars in Tr 37\nshow important evidence of disk evolution, with lower accretion rates and near-IR excesses\nthan in younger regions, a few objects still display characteristics of much younger systems.\nThe most remarkable one is the solar-type star 13-277, also called GM Cep (Morgenroth\n1939). Because of its spatial location within the cluster, it belongs most likely to the Tr 37\nmain population, with average ages ∼4 Myr (∼85% of the population is older than 2 Myr,\nand ∼95% is older than 1 Myr), rather than to the young population associated to the Tr\n37 globule, aged ∼1 Myr (Paper II). Its continuum spectrum and the strong and broad Hα\nemission suggested an accretion rate Ṁ∼3 10−7 M⊙ /yr, about 2 orders of magnitude over\nthe median accretion rate of TTS in Tr 37 (Paper IV). Its bolometric luminosity (L∼26 L⊙\nin 2000) is about 1 order of magnitude higher than other stars with similar late G-early K\nspectral type. Finally, we notice an unusually high mid-IR flux for a solar-type star: its\nMIPS flux at 70 μm is comparable to that of the Tr 37 Herbig Be star MVA-426, being one\nof the only four cluster members detected at this wavelength (Paper III).\nAll observations suggest that GM Cep is a variable star of the EX-or type, with an\nunstable disk and variable accretion rate, which is remarkable in an \"old\" cluster like Tr 37,\nwhere disk evolution seems ubiquitous. FU-ors and EX-or objects have been suggested to\nbe either normal stages within the very early TTS evolution (see Hartmann & Kenyon 1996\nfor a review) or a special type of young object, probably binary (Herbig 2003 and references\ntherein). Here we present the results of our photometry monitoring campaign during 200620071 , lucky imaging, millimeter continuum, and 12 CO data, together with optical spectra\n(high- and low-resolution), and a compilation of the data available from the literature. The\nmultiwavelength data are described in Section 2. In Section 3 we explore the characteristics of\nthe star: optical and IR variability, spectral type, accretion, winds, disk mass, and potential\ncompanions. Section 4 discusses the possible causes of variability and the comparison with\nsimilar stars, and in Section 5 we summarize our results.\n1\n\nBased on observations collected at the German-Spanish Astronomical Center, Calar Alto, jointly operated by the Max-Planck-Institut für Astronomie Heidelberg and the Instituto de Astrofı́sica de Andalucı́a\n(CSIC)\n\n\f–3–\n2.\n\nObservations and Data Reduction\n2.1.\n\nData from the Literature\n\nThe photometric data and epochs available for GM Cep are given in Table 1. The\nfirst reference to GM Cep, Morgenroth (1939), classifies it as a \"long-period variable\" with\nvisual magnitudes 13.5-15.5, although no epoch nor period are mentioned. Suyarkova (1975)\nstudied the light variations over several months, detecting rapid variations (days to weeks)\nbetween 14.2 and 16.4 mag, mixed with stability periods up to ∼100 days at both the\nlower and the upper magnitude. Kun (1986) lists the star among the variables in Cep OB2,\nproviding V photometry for three epochs. The databases Vizier, Simbad, and SuperCosmos\nlist optical photometric data from the USNO-A2.0, USNO-B1.0, GSC2.2, and SuperCosmos\ncatalogs, plus IR data from IRAS and MSX6C (Egan et al. 2003). There are two mentions\nof GM Cep in the amateur database of the American Association of Variable Star Observers\n(AAVSO), but they do not add any extra information to our data. Our previous studies\nof Tr 37 include optical photometry taken with the 1.2m telescope at the Fred Lawrence\nWhipple Observatory (FLWO) between 2000 and 2004 (Paper I, II), low resolution optical\nspectroscopy taken with the FAST spectrograph on the 1.5m telescope at the FLWO (Paper\nI), high-resolution optical spectroscopy from Hectochelle/MMT at the FLWO (Paper IV),\nand IRAC and MIPS data from our Spitzer study (Paper III). We also include the near-IR\ndata from 2MASS, presented in Paper I. All these data confirmed the variability of GM Cep\nand the presence of strong IR excesses from a very luminous disk.\nIn order to compare the data from the different studies in Table 1, we transformed\nthe photographic and CCD data from different filters into the UBVRc Ic system, which is\nthe closest match to the data prior to ∼1986. The photographic R63F and R59F red data\nare comparable to the modern Rc filter. Rc -R63F=0.096 and 0.081 mag, for giants and\ndwarfs, respectively, and Rc -R59F=-0.031 (Bessell 1986). Following Blair & Gilmore (1982),\nRc =R63F if Rc -Ic <0.9 mag (for GM Cep, Rc -Ic ∼0.8 mag). The GG395-Bj photographic\npassband is similar to the Johnsons B filter, although the zero point is different (Bessell et\nal. 1986). The errors involved in these conversions are less than 0.1 mag, below the typical\nerrors from the photographic plates and well below the observed variations of GM Cep. For\nthe modern observations, when contemporary V magnitude is available, RJ and IJ can be\ntransformed into Rc and Ic for comparison (Bessel 1979; Fernie 1983) with errors under 0.01\nmag for R, and around 0.1-0.2 mag for I.\n\n\f–4–\n2.2.\n\nOptical Photometry\n\nThe first set of optical observations was taken with the KING 70 cm telescope of the\nMax-Planck-Institut für Astronomie, at the Königstuhl in Heidelberg (see Table 1). The\ntelescope has a field of view of ∼18'x18', and is equipped with a Loral CCD L3-W17 detector\nand a set of standard UBVRJ IJ filters. The filters have very small color transform coefficients,\nand the second order extinction is almost zero, so relative photometry is feasible. Exposure\ntimes ranged from 30s to 3 x 120s depending on filter and weather conditions. We also\nobtained VRJ IJ photometry (Table 1)with the CAFOS imager on the 2.2m telescope in\nCalar Alto (Director's Discretionary Time, DDT), which covers a field of view of diameter\n16'. Taking 3 x 10 s or 3 x 30s exposures, we reach similar magnitude and area coverage as\nthe Königstuhl observations.\nThe data were reduced following standard routines within the IRAF2 tasks noao.imred.ccdred\nto do the bias and flat field corrections. Aperture photometry was performed within IRAF\nnoao.digiphot.apphot, and the data in each band were calibrated via relative photometry,\ncomparing with our previous observations from the FLWO (Paper I). Depending on the\nnight and instrument, ∼150-800 stars were used for calibrating VRI, and ∼20-200 for B\nand U. Since the FLWO observations used the UVRc Ic filters, the Rc and Ic bands were\ntransformed into the Johnsons system (Fernie 1983; Bessel 1979). Taking into account the\nlarge number of stars involved in the calibration, the errors derived from band transformation are minimal and the final error is dominated by the signal to noise, being typically less\nthan 0.01 mag. Due to the lack of calibrated B data in the FLWO survey, we used the B\nphotometry from the literature for the relative photometry. About 150 stars with B band\nphotometry are listed by SIMBAD, mostly bright objects from the Marshall & Van Altena\n(1987) catalog. Only 15 of these stars are not saturated in the Königstuhl frames and could\nbe used for calibration. Whereas this is insufficient for studying colors, the relative changes\nbetween different nights are unaffected.\n\n2.3.\n\nOptical Spectroscopy: HIRES/Keck and CAFOS/2.2m\n\nGM Cep was observed with the high-resolution spectrograph HIRES mounted on Keck\nI on 2001 June 30. The spectra were taken before the HIRES upgrades in 2004, using the\nrg610 filter and a 1.148\" slit, which provides a wavelength coverage between 6350 and 8750\n2\n\nIRAF is distributed by the National Optical Astronomy Observatories, which are operated by the Association of Universities for Research in Astronomy, Inc., under cooperative agreement with the National\nScience Foundation.\n\n\f–5–\nÅ , with some gaps in between orders, and a resolution R∼ 34,000. The resolution is similar\nto that of Hectochelle/MMT (Sicilia-Aguilar et al. 2005a; Paper IV), but the wavelength\ncoverage is much larger, including the Hα and Li I 6708Å regions, several forbidden lines\n([O I] at 6368 Å, [S II] at 6717 and 6731 Å, [N II] at 6548 and 6583 Å), the Ca II IR lines\nat 8498 and 8662 Å, and numerous photospheric absorption lines. The exposure time was 3\nx 900 s. The data was reduced using the MAKEE Keck Observatory HIRES data reduction\nsoftware, developed by T. Barlow. The wavelength calibration was done with a ThAr lamp,\nbeing accurate up to 1-2 km/s. No flux calibration was required.\nA low-resolution spectrum was taken with the CAFOS camera in the long-slit spectroscopic mode on the 2.2m telescope as a part of our Calar Alto DDT program. We used the\nB-100, G-100, and R-100 grisms, resulting in a wavelength coverage from 3200 to 9000 Å\nwith no gaps and some overlap, and a resolution of 2 Å per pixel (Figure 1). The spectra\nwere reduced using the standard IRAF tasks (noao.imred.ccdred and specred.twodspec), and\na wavelength solution was derived using a HgHeRb lamp. A total of 3 x 600 s exposures\nwere taken with each grism, in order to achieve a good cosmic ray removal. In addition, we\nobtained two CAFOS acquisition images in V and RJ , with exposure times of 60s. These\ntwo images, although lower in quality and with a smaller field of view than the standard\nCAFOS imaging, were reduced and calibrated using the techniques from Section 2.2, to\nprovide simultaneous photometry.\n\n2.4.\n\nLucky Imaging with AstraLux\n\nIn order to look for wide- and intermediate-distance companions, we observed GM Cep\nwith the high spatial resolution Lucky Imaging camera AstraLux, operating at the 2.2m\ntelescope in Calar Alto. AstraLux is a high-speed camera with an electron multiplying\nCCD, which allows full frame rates of up to 34 Hz with virtually zero readout noise. It has a\nfield of view of 24\"×24\" at a pixel scale of 47 mas/px. The AstraLux data consist typically\nof several thousands single frames with integration times between 15 and 100 ms. Software\npost-processing selects the frames which are least affected by distortions due to atmospheric\nturbulence, by measuring the Strehl ratio in each single frame. The high-quality frames (∼\n1–5% of all images) are combined to a final result with improved angular resolution and\nStrehl ratio (Lucky Imaging technique; Tubbs et al. 2002; Law et al. 2006). Under good\nseeing conditions and with the SDSS z' filter, AstraLux provides spatial resolution better\nthan 100 mas and Strehl ratios of up to 25%, depending on the magnitude. Observations of\nGM Cep were conducted in July and November 2006, and May and June 2007 (see Tables\n1 and 2 for details). Though the November 2006 data is slightly affected by atmospheric\n\n\f–6–\ndispersion, leading to an elongated PSF, the superb seeing of 0.6\" still resulted in a Strehl\nratio of 14%. Figure 2 shows the November 2006 data together with a simulated theoretical\nPSF, including atmospheric dispersion effects. We present a detailed analysis of these data\nin Section 3.6.\n\n2.5.\n\nJHK Photometry\n\nNear-IR photometry was obtained with the IR camera CAIN-2 at the 1.52m Carlos\nSánchez telescope in the Teide Observatory (Canary Islands) during 5 nights in early June\n2007 (see Table 1). Observations in the J H and Ks bands consist of 5 dithered exposures\naround GM Cep to ensure proper sky image subtraction. For each dither point we took\nseveral frames using short exposure time to avoid saturation, which were later averaged to\nobtain the final reduced image. The minimum exposure time was 1 s for individual exposures\nand the total integration time per filter was about 6 min. The data were reduced using the\npackage caindr developed within IRAF by J.A. Acosta-Pulido. The processing included\nsky subtraction, flatfielding and combination of the dither positions. Aperture photometry\nwas done, and the relative photometry calibration was based on 5 to 13 nearby IR sources\ntaken from the 2MASS catalog. The errors derived from this procedure are dominated by\nthe background and CCD read noise, ranging from 0.1 to 0.01 mag depending on weather\nconditions. The star remained stable during the whole run (see Table 3), taking into account\nthe errors, and its magnitude was similar to the 2MASS 2001 data. Similar stability over\na few days had been observed in the optical data taken in September 2000. Simultaneous\noptical observations cover only 1 of the nights, during which the star was near maximum.\n\n2.6.\n\nIRAM 1.3 Millimeter Continuum\n\nWe observed GM Cep at the IRAM 30m telescope in Pico Veleta using the 37 channel\nbolometer, MAMBO-1. The observations were done during night time, at 4:18h UT on June\n2nd 2006, and 2:58h on June 3rd. The opacity at zenith was Tau=0.4. Each observation\nconsisted of a 20 min integration standard onoff, with 10 min integration on source. The\nwobbler throw for the off position was 32\" and 50\", respectively, so the off measurement falls\nin different locations, to avoid the potential contamination from other sources. The data\nwere reduced using the MOPSIC software, developed by R. Zylka for the 30m bolometer\ndata. The pointing and flux calibration were done with the sources LK Hα 234, Cep A, and\nNGC 7538 from the IRAM Pool catalog, and the planet Uranus. The final flux at 1.3mm is\n13.9 ± 1.0 mJy. The 1.3 millimeter continuum observations are analyzed in Section 3.4.\n\n\f–7–\n2.7.\n\nIRAM\n\n12\n\nCO(1-0) and\n\n12\n\nCO(2-1) Observations\n\nWe also observed GM Cep with the heterodyne receivers at the 30m IRAM telescope.\nThe observations were performed under fair weather conditions on June 3rd (UT 7:00-8:15),\nJune 4th (UT 7:30-9:20), and June 5th (UT 8:00-10:00). We used the standard onoff mode\nwith wobbler shift, that results in better baselines, with wobbler throws from 70\" to 120\".\nWe used the highest resolution mode available (2 km/s), and the backends A100, B100\n(for frequencies around 115 GHz) and A230, B230 (for frequencies around 230 GHz). The\ninstrument allows to observe two frequencies simultaneously, which we tuned to the 12 CO(10) and 12 CO(2-1) transitions. Since the LRS velocity of the source (considering the average\ncluster CZ=-15.0±3.6 km/s) at the time of the observation was around 0 km/s, the receivers\nwere tuned to 115.271-115.275 GHz and 230.538-230.543 GHz, varying the central frequencies\nduring different integrations to avoid that the line falls always on the same place on the\ndetector. The total integration time was 4 h, with 2h on source. For pointing and calibration,\nwe observed the standard sources J2253+161, NGC 7027, and Cep A, from the IRAM Pool\ncatalog.\nThe data were reduced using the CLASS software within the GILDAS package, specially\ndeveloped for the reduction of IRAM heterodyne data. The single scans were examined to\nremove the bad ones, matched in frequency, and added. The baseline was fitted as a 1-order\npolynomial and subtracted. The reduced data is plotted in Figure 3. The 12 CO(1-0) is\nidentified as a 5σ detection with peak value 0.3mJy, but the weaker 12 CO(2-1) transition is\nnot detected. No line broadening was observed for the 12 CO(1-0), which may be an effect\nof the weakness of the detection, and/or a consequence of the inclination of the object.\nIn addition to the 5σ emission, we find a 4σ absorption around the line. This absorption\ndoes not seem to originate in a single point in the off position, given the changes in the\nwobbler throw and its position angles. A possible explanation would be the presence of\nsubstantial amounts of gas in the Tr 37 bubble. According to the work of Patel et al. (1998)\nusing the 14m FCRAO antenna, the region around GM Cep is relatively clean (Figure 3\nright). Nevertheless, the sensitivity of the 30m is more than double than the FCRAO, so\nthe absorption could be due to gas emission in the expanding IC 1396 H II region barely\ndetected in the FCRAO maps. The 12 CO lines are weaker than expected in typical disks\nfor the same 1.3 mm continuum emission, which could be due to oversubtraction of ambient\n12\nCO emission, and is difficult to correct without deep mapping of the area.\n\n\f–8–\n3.\n3.1.\n\nAnalysis\n\nThe Lightcurve: Outburst History\n\nThe lightcurve of GM Cep is depicted in Figure 4. The star suffers rapid and repeated\nirregular variations in all bands, with amplitudes 2-2.5 mags. It increased in brightness after\n∼1986, reached a low magnitude level in ∼2002, and raised between ∼2003 and ∼July 2006.\nFrom July 2006 on, when our time sampling is better, GM Cep experienced a decrease in\nmagnitude, followed by a 1 mag increase in January 2007, a further decline by April 2007,\nincreasing again to near-maximum levels by June 2007. The changes in magnitude can be\nvery rapid (>0.1 mag in consecutive days in 2000 and 2001; 2 mag from Dec. 15 to Dec. 29,\n2006; 1 mag from Jan. 2 to Jan. 18, 2007). This suggests that GM Cep probably suffered\nsimilar rapid oscillations during the undersampled periods.\nThe simultaneous multiband data show that the color changes are small and relatively\nrandom (Figure 5). The changes in color do not seem purely related to extinction variations,\nconsidering a typical interstellar extinction law (Cardelli et al. 1989), although the material\nsurrounding a young star is likely to be different from typical ISM matter. If the changes in\nmagnitude were due to extinction alone, we would need to assume significant grain growth\nand a non-standard extinction law: To produce the same amplitude of variations in all\nVRI bands, the obscuring grains should be very large (>10μm) to ensure grey extinction\n(Eiroa et al. 2002). Simultaneous JHK and optical observations would help to constraint\nthe effects of extinction in the lightcurve, but unfortunately only one of our JHK data\nsets has simultaneous UBVRI photometry. The small color variations suggest as well that\neclipses by a companion of different mass are not responsible for the changes. The amplitude\nof the variations (up to 2.5 magnitudes) is too large for eclipses, even if we consider an\nequal-mass companion, unless we consider some special binary configuration in addition to\nobscuring material, somehow analogous to KH 15D (Hamilton et al. 2005 and references\ntherein). Detailed studies of the periodicity in the future should clarify the presence of\neclipses. Nevertheless, both the extinction and the eclipse scenarios fail to explain the high\nluminosity of GM Cep (up to 30-40 L⊙ at maximum) unless the star had a much earlier\nspectral type (A) or belonged to another luminosity class.\n\n3.2.\n\nStellar Properties and Activity\n\nThe spectra of GM Cep are dominated by very strong and broad Hα emission with\nstrong P-Cygni profile with a deep blueshifted absorption that goes under the continuum\nlevel, characteristic of very strong accretion (Edwards et al. 1994; Hartigan et al. 1995).\n\n\f–9–\nOther emission lines associated to winds and accretion are present as well (Figures 1, 6, and\n7). The main lines are listed in Table 5. Given that none of the spectra is flux calibrated,\nit is not possible to determine the variations in the continuum level. The spectral features\nin the high-resolution data from 2001 and 2004 are very similar. The Hα equivalent width\n(EW) was larger in the 2004 (EW=-14 Å) than in 2001 (EW=-6 Å), and the 10% Hα velocity\nwidth was also higher in 2004 (660 km/s; Paper IV) than in 2001 (580 km/s), suggesting a\nhigher accretion rate in the first case. The narrow Hα feature in the HIRES spectrum may\nbe affected by nebular emission of the H II region, or may have been oversubtracted in the\nHectochelle spectrum. The low-resolution spectra give Hα EW -10 and -19 Å in June 2001\nand April 2007, respectively, suggesting Hα variability caused by variable accretion/winds\nadded to changes in the continuum level.\nIn the 2001 low-resolution FAST spectrum, the Hβ line appears in absorption. Typically,\naccreting stars show the Balmer H Series in emission, with similar profiles in all the lines,\nsuggesting that they came from the same mass of emitting gas (Muzerolle et al. 1998,\n2001). Nevertheless, in the case of very strong accretors, the strong winds can dominate\nthe most optically thick lines (Hα) overrunning the signs of magnetospheric accretion, which\nwould dominate optically thinner lines (like Hβ; Muzerolle et al. 2001). Intermediate-mass\nvariables of the UX-or class tend to have Hβ in absorption (Grinin et al. 2001; Tambovtseva\net al. 2001), but Hα P-Cygni profiles are very rare in them, and the Ca II IR lines appear\ntypically in absorption. For GM Cep, the Ca II IR triplet (λλ 8498, 8542, 8662 Å), indicator\nof accretion, shows strong emission in both the HIRES and the CAFOS spectra (Figures 1\nand 6). The lines were stronger in 2001, and the ratio of the 8498 and the 8662 line varies\nin the two epochs from ∼1.5 to ∼2.5. The profiles of these two lines are not similar either,\nbut the 8662 Å line can be blended the Paschen 13 line.\nThe high-resolution spectra show forbidden [N II] emission at 6548 and 6583 Å, typically\nassociated to winds and shocks (Hartmann & Raymond 1989). The [N II] lines are stronger\nin the 2004 data, which has the stronger Hα. In addition, the [N II] lines appear redshifted\nby about 18 km/s in 2004 with respect to 2001. The shock origin of the [N II] emission results\ntypically in small blueshifts of the lines (Hartigan et al. 1995), so the velocity shift observed\ncould be related to changes in the velocity and/or location of the shocked matter, or in the\nradial velocity of the star. Considering the strength of the lines, we believe that GM Cep\nhad stronger winds during 2004 than in 2001. The [O I] line at 6300 Å is not covered, and\nthe [O I] line at 6363Å is not detected, but the [S II] line at 6729 Å is detected in emission.\nThe forbidden emission lines ([O I], [N II], [S II]) can be used to constrain the wind and\nshock density and the temperature of the regions where they originate, given their different\ncritical densities and ionization potentials (Hartigan et al. 1990). If a jet or wind does not\nencounter matter in its way, the forbidden line emission may not be produced (Hartigan et\n\n\f– 10 –\nal. 1995). Higher densities tend to reduce the [N II] and [S II] emission compared to [O\nI], and higher shock velocities increase ionization and the [N II]/[O I] ratio. The different\nvelocities observed for the different lines suggest different formation volumes: [N II] could\nbe produced in a low-density shock far from the star, whereas the [O I] line could be related\nto denser, hotter wind maybe associated to the material producing the Hα absorption.\nGM Cep presents a remarkable, double-peaked O I emission at 8446 Å, with peaks\ncentered at 8442 and 8448 Å, respectively (∼-140 km/s and ∼+80 km/s; Figure 6). This\nline is characteristic of very strong winds, being usually present in Herbig Ae/Be stars and\nin strongly accreting TTS like RW Aur (Alencar et al. 2005). The double peak observed\nin GM Cep could in fact indicate two jet-like wind components. There is a prominent and\nbroad O I absorption at 7774Å, maybe related to the hot disk (Grinin et al. 2001). We\ndetect as well some weak Fe II and Fe I lines in emission (Table 5), which are seen in spectra\nof other strongly accreting stars like V1647 (Fedele et al. 2007).\nThe new data allow to revise the spectral type of the star. The low-resolution spectra are\nveiled and lack broad band features, giving an uncertain spectral type around G. The highresolution HIRES spectrum shows numerous photospheric lines in the whole wavelength\nrange, despite important blending due to the fast rotation of GM Cep. Comparing to\nstandard spectral libraries (Montes et al. 1997; Coluzzi et al. 1993), the Fe I and Ca I\nlines, together with the Li I absorption (0.16Å) suggest a late-type in the range G7V-K0V\n(1σ; G5-K3 for 3σ). The main contributors to the uncertainty in the spectral type are the\nmoderate veiling (∼0.2-0.4, depending on spectral type) and the fast rotation, added to the\nintrinsic lack of strong features in G-type stars.\nCross-correlation of the Hectochelle spectrum with spectra of slow rotators of a similar\nspectral type revealed a rotational velocity Vsini=51.6±9.4 km/s (Paper IV). We repeated\nthe cross-correlation with each one of the HIRES orders, removing the zones affected by\nemission lines, bad pixels, and strong atmospheric features (mostly O2 and H2 O bands;\nCurcio et al. 1994). The results of the cross-correlation are summarized in Table 7, and\ndisplayed in Figure 8. The HIRES data confirm the very high rotational velocity over a large\nrange of wavelengths, Vsini=43.2 ± 1.6 km/s in average (standard deviation σ=4.2 km/s).\nCompared to the average rotational velocity of the rest of Tr 37 members (Vsini=10.2±3.9\nkm/s), GM Cep is a very fast rotator: the next fast rotator in Tr 37 is the M0 weak-lined\nTTS 21-763, with Vsini=28.3±8.1 km/s. We do not observe any correlation between Vsini\nand the wavelength (Figure 8) nor between the line broadening and the line transition lower\nexcitation potential, as has been suggested for FU-ors (Hartmann & Kenyon 1987; Welty et\nal. 1990, 1992; Kenyon & Hartmann 1996). Therefore, we believe that the absorption lines\narise rather from the stellar photosphere than from a hot disk or shell. The cross-correlation\n\n\f– 11 –\nprovides as well a measure of the radial velocity. The average radial velocity in Tr 37 is\nCZ=-15.0±3.6 km/s, so GM Cep is slightly off-cluster with CZ=-7.5±6.7 km/s (Paper IV).\nThe HIRES data produces a different off-cluster value, CZ=-21.0±2.6 km/s. On the other\nhand, the radial velocity of the 12 CO (1-0) peak is consistent with the cluster average -15±2\nkm/s (Section 2.7). Nevertheless, the broad lines lead to large errors, so the evidence of\nspectroscopic binarity is only 2σ and therefore, not conclusive.\n\n3.3.\n\nAccretion\n\nThe U band observations combined with simultaneous VRI photometry can be used to\ndetermine the accretion rate via the excess U band luminosity (LU ; Gullbring et al. 1998;\nPaper I, II, IV). The excess in U band luminosity is well correlated to the accretion luminosity\nLacc , which can be transformed into an accretion rate. Following Gullbring et al. (1998):\nlog(Lacc /L⊙ ) = 1.09 log(LU /L⊙ ) + 0.98\n\n(1)\n\nLacc ∼ GM∗ Ṁ/R∗ (1 − R∗ /Rin )\n\n(2)\n\nThe mass and radius of the star (M∗ , R∗ ) can be obtained from the V vs. V-I diagram\nand evolutionary tracks (Siess et al. 2000). LU can be estimated as the difference between the\nmeasured U band luminosity and the photospheric luminosity, calculated from the measured\nI magnitude and using the U-I color of a non-accreting star with the same spectral type\n(Kenyon & Hartmann 1995). All magnitudes must be corrected from extinction (derived\nfrom the VRI colors using a standard galactic extinction law; Cardelli et al. 1989), and\nthe transformation of magnitudes to luminosity can be done with the zero point flux and\nthe bandwith for U band (4.19 10−9 erg s−1 cm−2 Å−1 and 680 Å, respectively). For GM\nCep, and for an spectral type G7-K0, the extinction is AV ∼2-3 mag, so the 2006-2007 data\nresults in variable LU ∼0.5 - 4 L⊙ and a variable accretion rate in the range Ṁ∼10−7 - 5\n10−6 M⊙ /yr. The mass and radius of the star are uncertain, given the variations within\nthe color-magnitude diagram (Figure 5), being the most probable values M∗ =2.1 M⊙ and a\nradius between 3 to 6 R⊙ . Added to the uncertainty in the spectral type and extinction, this\nresult is accurate within 1 order of magnitude. In any case, this accretion rate is 2-3 orders of\nmagnitude higher than the median in Tr 37 (Paper IV), and 1-2 orders of magnitude higher\nthan the rates in typical Taurus stars.\nUsing the parametrization in Natta et al. (2004), we can convert the Hα velocity wings\nat 10% of the maximum (VHα10% ) into accretion rates:\n\n\f– 12 –\n\nlog(Ṁ /M⊙ yr −1) = −12.89 + 9.7 × 10−3 VHα10% /kms−1\n\n(3)\n\nFor the measured velocities of 580 and 660 km/s, the accretion rates are 5 10−8 M⊙ /yr\nand 3 10−7 M⊙ /yr, respectively. These values may be underestimated given the wind absorption in the Hα profiles and depending on the viewing angle. As the dispersion associated\nto this parametrization is around 1-2 orders of magnitude, the 3 10−7 M⊙ /yr rate derived\nfrom Hectochelle in 2004 is roughly consistent with the values derived from U band photometry. The moderate veiling estimated from the HIRES spectrum (∼0.2-0.4) agrees with the\naccretion rate estimated from Hα assuming an intermediate luminosity for GM Cep.\n\n3.4.\n\nIR Variability and Disk Models\n\nIn order to study the structure of the disk around GM Cep, we trace the spectral\nenergy distribution (SED) using the millimeter, Spitzer, 2MASS, and optical data. The\nmain uncertainty here is that the different observations are not simultaneous. The 2MASS\nJHK data are nearly contemporary to the optical photometry (2000), but the Spitzer data\nwere taken in 2003-2004, and the millimeter continuum in 2006. Short time variations of ∼1\nmag in JHK have been observed for stars similar to GM Cep (Eiroa et al. 2002), suggesting\nstructural changes in the disks. According to the D'Alessio et al. (2005) disk models,\nthe flux at wavelengths shorter than ∼ 300 μm scales linearly with the total (stellar and\naccretion) luminosity, but the disk flux at longer wavelengths is independent (Merı́n et al.\n2004). Juhász et al. (2007) and Kóspál et al. (2007) found similar evidences of mid-IR\nexcess variations with luminosity. If the causes of the outbursts were extinction variations,\nthe mid- and far-IR variability would be milder, and the near-IR would be only moderately\nvariable. The differences between the fluxes measured by IRAS 12μm, IRAC 8μm, and the\nMSX6C A band (∼8 μm) are suggestive of IR variability. On the other hand, the millimeter\nemission reflects the total mass of the disk, changing little even if the star suffers strong\nvariability.The brightness in V varied in the whole range (∼2-2.5 mags) during the time\nwhen the different IR observations were taken (Figure 4), so for modelling the disk we take\nthe optical data from September 2000, which has an intermediate brigthness, and keep in\nmind that the SED may be affected by variable IR fluxes.\nTypical disk models assume that the disk is in hydrostatic equilibrium. Nevertheless,\nthe strong IR emission suggests that the disk is compact, dense, and, if the variability is\ntriggered by episodes of enhanced accretion, probably out of hydrostatic equilibrium (Clarke\n& Lin 1990; Eiroa et al. 2002), so we must be cautious interpreting the models. We use the\nstandard models for irradiated accretion disks around TTS of D'Alessio et al. (2005), which\n\n\f– 13 –\ntrace the flared disk self-consistently, with a flaring angle determined by the hydrostatic\nequilibrium, and include stellar illumination and accretion as heating sources for the disk.\nThe dust opacities are calculated for a collisional distribution of grain sizes, where the amount\nof grains of a given size \"a\" varies as a power law n(a)∝ a−3.5 and the maximum grain size is\n10μm. We assume an average inclination of 60 degrees; the effects of intermediate inclination\nvariations being only important for the near-IR emission. The stellar parameters, derived\nfrom the optical photometry of September 2000 using the HR diagram, are M=3.0 M⊙ ,\nR=5.14 R⊙ , T=5000 K. We also include an accretion rate of 10−6 M⊙ /yr. These parameters\nare one of the main uncertainties in the modeling, given the variability of the star. The\nbest fit model is displayed in Figure 9. The result is, not surprising, that the disk cannot\nbe modeled as a standard disk. If we try to fit the MIPS data points at 24 and 70 μm,\nthe 1.3mm continuum flux would be overestimated by more than one order of magnitude,\nand even the 24 and 70 μm contemporary data alone cannot be accurately reproduced with\nhydrostatic equilibrium disk models for any observed stellar luminosity. The mid-IR flux of\nGM Cep is comparable to that of FU Orionis itself (Quanz et al. 2006), although its disk (or\ndisk plus envelope) is less massive. Since the flux at millimeter wavelengths is independent of\nthe rapid optical variability, a standard hydrostatic equilibrium model can reproduce the flux\nat 1.3mm only if the grains are either much smaller or much larger than 10 μm (maximum\ngrain size <1μm or >1cm) or if the disk is very small (up to 30-50 AU). Even in these cases,\nan additional source of IR emission should be included to produce the high 24 and 70 μm\nflux (in a small disk) or to fit the near-IR excess (if the grain sizes have cm sizes).\nA way to increase the IR fluxes without changing the mm flux would be by varying the\nflaring angle at a certain distance from the star. The flaring angle in the D'Alessio et al.\n(2005) models is fixed by the hydrostatic equilibrium, but strong turbulence related to the\nstrong accretion can produce an unstable disk. As an experiment, the mid-IR fluxes can be\nincreased by adding a black body emission with T∼150 K to a compact 30 AU disk model.\nFor the luminosity of GM Cep, this would mean a distance of ∼ 25 AU. The excess mid-IR\nemission that needs to be added could be interpreted as an increase in the flaring angle by\na factor of ∼2 at distances of ∼20-30 AU (a \"bump\" in the disk), as an illuminated wall at\n∼25 AU, or as a shell or envelope located at a similar distance. If the innermost disk were\nvery flared or had a high inner wall, some degree of self-shadowing in the near-IR may occur,\nleading to a \"bump\" at longer wavelengths (Dullemond et al. 2001).\nA physical mechanism to produce a \"bump\" or a local change in the flaring angle could\nbe to disrupt the disk by a massive object (a stellar companion and/or a giant planet)\ntriggering thermal instability and producing rims and/or spiral waves (Clarke & Lin 1990;\nClarke & Syer 1996; Lodato & Clarke 2004). This picture would also be useful to explain\nthe observed outbursts as periods of increased accretion activity. A close-in companion, a\n\n\f– 14 –\ncompanion embedded in the disk, or a companion out of the disk (typically, at distances 2-3\ntimes the size of the disk; Artymowicz & Lubow 1994) could produce disk instabilities and\nincreased accretion episodes, with the advantage that companion-triggered outbursts can\noccur at later stages of evolution in Class II objects, more consistent with the ages of Tr 37\n(Lodato & Clarke 2004). Detailed studies of the periodicity and radial velocity will be used\nto test these scenarios.\nThe shell/envelope picture presents a main problem: the relatively low extinction of GM\nCep. Assuming the reasonable spectral type range (G5-K3) the extinction can vary between\nAV =1.5-3 mag, roughly consistent with the cluster average AV =1.67±0.45 mag (Paper II),\nand with the minimum interstellar extinction for an object located at 900 pc, AV ∼1 mag.\nTherefore, the column density in the envelope would be of the order of N(H2 )=1021 cm−2 at\nmost (Frerking et al. 1982; Taylor et al. 1993), resulting in a total mass of ∼4×10−5 M⊙ if the\nenvelope has a ∼30 AU radius, and still only 0.001 M⊙ for a ∼500 AU radius, insignificant\ncompared to the total disk mass. The envelope could be more dense and massive if it had\npolar gaps, which is reasonable given the strong winds, and if we assume a low viewing angle,\nbut it cannot be too massive to reproduce the millimeter flux. A low viewing angle would\nbe consistent with the lack of broadening in the 12 CO(1-0) line, and would suggest that GM\nCep is rotating close to the breakup velocity, ∼200 km/s. Accretion from an envelope onto\nthe disk could produce episodes of increased accretion onto the star. Extinction by a nonuniform envelope can produce magnitude changes as well, but the rapid variation timescales\nrequire that, if extinction plays an important role in the magnitude changes, the extincting\nmatter must be very close to the star. In order to distinguish between all these scenarios,\nsimultaneous observations at all wavelengths are required.\n\n3.5.\n\nDisk Mass Estimates\n\nThe millimeter continuum data can be used to estimate the total disk mass, given that\nthe whole disk is optically thin at these wavelengths. The total dust mass is written as:\nMdust = Fν D 2 /κν Bν (Tdust )\n\n(4)\n\nwhere Fν is the flux at millimeter wavelengths, D is the distance, κν is the dust mass\nabsorption coefficient at the same wavelength (2 cm2 g−1 at 1.3mm; Beckwith et al. 1990;\nMiyake & Nakagawa 1993; Krügel & Siebenmorgen 1994). Bν (Tdust ) is the Planck function\nfor the temperature of the bulk of the dust. The total mass of the disk can be obtained\nassuming a gas-to-dust ratio of 100 (Beckwith et al. 1990). The main uncertainties are the\n\n\f– 15 –\ndust absorption coefficient (if substantial grain growth has occurred), the gas-to-dust ratio\n(if the disk is older than typical disks), and, in an unstable disk, the temperature of the\nbulk of the dust. We use the dust absorption coefficient assumed for Taurus disks (Beckwith\net al. 1990; Osterloh & Beckwith 1995), which is larger than the κν for the interstellar\nmedium (1 cm2 g−1 ) or than the one of disks with grains larger than ∼100 μm (Krügel &\nSiebenmorgen 1994). The typical dust temperature for outer disks around TTS is 30-40 K\n(Dutrey et al. 1997; Thi et al. 2001). For GM Cep, the dust temperature could be higher\nif the strong accretion is adding extra heating to the disk, and/or if the bulk of the dust is\ncloser to the star (because of changes in the flaring and/or envelope configuration). In order\nto be conservative, we consider dust temperatures in the range 30-150 K, resulting in total\ndisks masses from 0.07 to 0.01 M⊙ , several times the minimum mass solar nebula.\nThe emission of optically thin transitions in molecules can be used to estimate the mass\nin cold gas (Thi et al. 2001). The 12 CO(1-0) line detected at the IRAM 30m telescope is\nmost likely optically thick, so this would underestimate the disk mass. Nevertheless, if we\nmake the approximate calculation, assuming that the line is thermalized, we have:\nF(1−0) = (hν/4πD 2 )N(CO)A1−0 χν A\n\n(5)\n\nwhere F(1−0) is the total flux in the 12 CO(1-0) line, N(CO) is the 12 CO column density,\nD is the distance, A1−0 is the Einstein coefficient for the transition, χν is the level occupation\nat a given temperature, and A is the disk surface area. The main error in this approach is\nthat the line is not optically thin. If we assume the ratio of H2 to 12 CO to be 104 (Thi et al.\n2001), and we consider the total flux integrated over the line profile F(1−0) , the mass of the\ndisk can be written as:\nMdisk = μmH2 F(1−0) 4πD 2 (N(H2 )/N(CO))/hνA1−0 χν\n\n(6)\n\nWith A1−0 and χν from the Leiden Atomic and Molecular Database (LAMBDA; Schöier\net al. 2005) and the Cologne Database of Molecular Spectroscopy (CDMS; Müller et al. 2001,\n2005), and assuming gas temperatures between 40 and 80 K (this variation results only in a\nfactor of 2), the total disk mass inferred from the integrated flux F(1−0) =0.27 Jy km/s is of\nthe order of 0.0005 M⊙ , about 100 times smaller than the estimate from the dust continuum\nemission. This is reasonable since the line is optically thick, and the typical CO depletion\nvalues in TTS disks are of the order of 10-1000 (Thi et al. 2001). Moreover, our 12 CO fluxes\nmay be underestimated because of the absorption from ambient gas (Section 2.7).\nThe disk mass obtained integrating the 30 AU disk model that gives the best fit to\n\n\f– 16 –\nthe millimeter point (Section 3.4) is about 3 times larger, 0.19 M⊙ . The model suggests\na temperature around 30-40 K for the bulk of dust. The main source of disagreement\nis the dust mass absorption coefficient, which in the model is variable with the radius of\nthe disk and depends on the distribution of grains of different sizes, having typical values\nbetween 0.4 and 1.8 cm2 g−1 , smaller than the κν from Beckwith et al. (1990). The stronger\ninconsistency is that for an accretion rate Ṁ∼10−6 M⊙ /yr, the disk would survive less than\n0.1 Myr, very little compared with the ages of Tr 37 and even with the ages of the Tr 37\nglobule. This inconsistency is not exclusive to GM Cep, but many of the strong accretors\nlike DR Tau and RW Aur have similar Ṁ and even smaller millimeter disk masses (0.03 and\n0.0003 M⊙, respectively; Beckwith et al. 1990; Osterloh & Beckwith 1995), so their survival\ntimes would be even shorter. In case of RW Aur, the problem can be solved assuming\nthat the current accretion episodes are transient events caused by disk disturbances by its\ncompanion(s) (Petrov et al. 1991; Cabrit 2005). EX-ors are supposed to have variable\naccretion, so they could spend most of their lives accreting at lower rates. Another way to\nsolve the disagreement would be to change the opacities by increasing the maximum grain\nsizes to ∼1-10 cm or decreasing it under 1μm. Such dust distributions are compatible with\nthe millimeter fluxes if the disk has a mass ∼0.5-0.6 M⊙ and outer radius >100 AU. Mannings\n& Emerson (1994) suggested that including large grains and fractal dust structures could\nincrease the disk mass of DR Tau, and Rodmann et al. (2006) found evidence of cm-sized\ngrains in RW Aur. Important grain growth seems appropriate for older TTS like GM Cep\nand should be explored with more observations in the submm range to constrain the SED\nslope.\n\n3.6.\n\nDoes GM Cep have a Wide-Orbit Companion?\n\nGiven the anomalous SED of GM Cep, the repeated outbursts, and the fact that many\nof the well-known variable and EX-or/FU-or objects are multiple systems with separations\n∼100-300 AU (Reipurth & Aspin 2004; Vittone & Errico 2005; Ghez et al. 1993), we\ninvestigate the presence of companions. The presence of binaries has been invoked as a\nmechanism to produce EX-or and FU-or outbursts in old and more evolved disks without\nan envelope (Clarke & Lin 1990; Bonnell & Bastien 1992). Some very variable TTS like\nRW Aur are such multiple systems (Ghez et al. 1993), and companions at distances ∼100\nAU affect the evolution of disks around Herbig AeBe stars (Chen et al. 2006) and TTS\n(Bouwman et al. 2006). The high-resolution spectroscopy is not conclusive, but the detection\nof spectroscopic binaries may be difficult if the star is a very fast rotator, and/or if the viewing\nangle is low. The lucky imaging data from AstraLux does not reveal a wide companion. The\nsmall elongation of the PSF is compatible with the predicted atmospheric dispersion effects,\n\n\f– 17 –\nand cannot be taken as an indicator of an unresolved companion. The ability to image\ncompanions with AstraLux is highly dependent on the magnitude difference between the two\nstars, and GM Cep was always imaged during high magnitude phases, so the identification of\ncompanions at 100-200 AU would not be possible even if the two stars have a similar mass.\nIn order to constrain the separation and magnitude difference of a possible companion,\nwe analyzed the maximum brightness differences of a hypothetical companions at different\nangular separations from GM Cep for the November 2006 AstraLux data, which has the\nbest Strehl ratio. We adopted a 5σ peak detection over the background noise as visibility\ncriterion. The absence of static aberrations and asymmetries in the AstraLux data beyond\nthe first diffraction ring allow to determine the intensity standard deviation in concentric\nannuli around GM Cep, resulting in robust estimates of the detection limits (Table 8). Binary\nsimulations were constructed by adding a scaled copy of the real observations to itself with\nthe given magnitude differences and separations (Figure 10). Since not only the stellar PSF\nis added, but also the noise, this method increases the background noise especially at small\nmagnitude differences, leading to more pessimistic estimates of the achievable detection\nlimits. The observed PSF is in good agreement with a theoretical simulation which includes\natmospheric dispersion effects, so there is no evidence for a bright companion at angular\nseparations between 50-100 mas (45-90 AU). We conclude that GM Cep does not have a\ncompanion with a magnitude difference ≤1 mag at ≈100 AU, and none farther than 200 AU\nwith a magnitude difference ≤2 mag. However, we cannot rule out the presence of a close Gor K-type companion with normal luminosity. We will obtain further AstraLux observation\nof GM Cep near its minimum in parallel to our photometric monitoring.\n\n4.\n\nDiscussion: Potential Variability Mechanisms in GM Cep\n\nThere are different mechanisms responsible for the magnitude variations of pre-main\nsequence stars. Herbst et al. (1994) classifies them in Type I, due to rotation of a star\nwith cool spots, Type II, due to rotation of a star with hot spots (related to accretion), and\nType III, also called UX-or variables. Young, accreting, solar-type stars experience Type I\nand II variations of the order of few 0.01-0.5 mag in a few days (Bertout 1989; Briceño et\nal. 2001; Eiroa et al. 2002). The irregular UX-or variations, with more complex timescales\nof days/weeks combined with few-years cycles, do not usually exceed ∆mag∼1 mag, and\noccur typically in nearly edge-on HAeBe stars (Grinin et al. 2000), although other authors\nclaim that stars as early as K0 can experience Type III variations (Herbst & Shevchenko\n1999) and that the viewing angle can be as low as 45 degrees (Natta & Whitney 2000). The\nmechanisms triggering the UX-or variations are the most controversial, and they have been\n\n\f– 18 –\ndescribed as obscuration by shells of matter close to the star (Shevchenko et al. 1993; Natta\net al. 1997; Grinin et al. 2000; Tambovtseva et al. 2001) or as thermal instabilities similar\nto those triggering FU-or outbursts (Herbst & Shevchenko 1999; Natta et al. 2000). Strong\nvariations (∆mag∼2-5 mag) due to enhanced accretion episodes are seen in FU-or or EX-or\noutbursts, which are recurrent at least in the case of EX-or objects (Hartmann & Kenyon\n1996; Lehman et al. 1995; Herbig et al. 2001). These extreme accretors tend to be very\nfast rotators (Herbig et al. 2003; although the fast rotation detected may be actually the\nrotation of the very hot inner disk), to have IR fluxes that deviate from typical disk models\n(Hartmann & Kenyon 1996), and to have in some cases companions at 100-300 AU (Reipurth\n& Aspin 2004). FU-ors and probably EX-ors could be either a normal phase within the very\nearly evolution and disk formation in TTS (Clarke et al. 1990; Hartmann & Kenyon 1996,\namong others), or a special type of systems (certain binary or multiple systems; Herbig et\nal. 2003; Quanz et al. 2006). The long-time evolution of these objects is not known, so the\nstudy of relatively old variables within these classes could help to understand their nature.\nThe lightcurve of GM Cep is not purely consistent with any known FU-or, EX-or nor\nUX-or lightcurves, although these objects are largely variable within their classes. The\nmagnitude changes (∆mag∼2-2.5 mag) and multiple maxima are consistent with an EX-or or\nUX-or type variable. The high IR flux is another characteristic of EX-or/FU-or systems, due\nto their high luminosity and/or to the presence of envelopes. The Hα and [N II] variability\nsuggest changes in the accretion rates and in the strength of the winds, and although the\nHβ absorption is typical of UX-ors, the blueshifted absorption in Hα is very rare in this\nclass. The magnitude changes are not consistent with variable obscuration alone considering\na standard galactic extinction law. Nevertheless, if the extinction were produced by material\nin the circumstellar disk/shell of GM Cep, containing reprocessed dust and large grains, the\ncolor changes during high extinction episodes could be different. The type of obscuration\nsuggested for UX-or variables (Shevchenko et al. 1993; Natta et al. 1997) results in bluer\ncolors at low magnitude, due to obscuration of the red disk and scattering (Grinin et al.\n2001), which have not been seen so far in GM Cep. Moreover, pure extinction episodes\ncannot explain the high luminosity of GM Cep unless the spectral type and/or the luminosity\nclass are changed beyond reasonable limits. Extinction variations alone could account only\nfor up to ∼1.5 mags in V and cannot produce the observed changes in color. If variable\nextinction were produced by the disk material in the vicinity of the star, the system should\nbe close to edge-on or should have an anomalous distribution of circumstellar matter. Given\nthe observed Vsini, the angle of view must be larger than ∼15 degrees to prevent breakup,\nand the near-IR fluxes and the P-Cygni Hα profile suggest an intermediate angle. If the\nexcess mid-IR emission were due to an envelope, the strong winds could contribute to clean\nthe polar gaps, reducing the extinction. GM Cep could be then one of the oldest EX-\n\n\f– 19 –\nor variables known, since these phenomena seem to occur preferentially at ages ∼1 Myr.\nAccording to the picture developed by Clarke & Syer (1996), the presence of a planetary or\nstellar companion in the disk of a Class II object at few AU distances can trigger thermal\ninstability and produce outbursts with amplitude and frequency depending on the mass of\nthe companion (Lodato & Clarke 2004). Given the ages of Tr 37, it is most likely that GM\nCep is a special object, probably a binary or multiple system, rather than a typical very\nyoung TTS.\nIn order to understand the variations of GM Cep, we compare it to similar cases:\nThe activity of the EX-ors EX Lupi and DR Tau resembles strongly that of GM Cep.\nEX Lupi suffers periods of quiescence followed by strong variability with 2-3 mag amplitude\nand changes in its emission line spectrum (Lehmann et al. 1995). Like GM Cep, it is\npresumably older than other EX-ors (Herbig 2007). The K5-K7 eruptive star DR Tau is\nknown to have irregular variability episodes since 1900, with amplitudes ∼1.5 to ∼3-5 mag.\nIts variable and strong stellar winds, large UV excess and veiling suggest high and variable\naccretion rates (Chavarria 1979; Mora et al. 2001). DR Tau can remain relatively stable at\nboth the low-magnitude and high-magnitude phases during years/decades, as was seen by\nSuyarkova (1975) for GM Cep. The variability of DR Tau cannot be explained by hot and\ncold spots and variable obscuration alone (Eiroa et al. 2002). Like for GM Cep, the mass of\nthe disk of DR Tau (∼0.03 M⊙ ; Beckwith et al. 1990) seems to be too small for its accretion\nrate if we assume the small typical grain sizes.\nSuyarkova (1975) classified GM Cep as a RW Aur-type variable. The \"extreme CTTS\"\nRW Aur shares with GM Cep the strong and variable P-Cygni Hα profile, a powerful disk, a\nlarge accretion rate, and a strong double-peaked O I emission lines at 8446 Å, with velocity\nshifts ±100 km/s (Ghez et al. 1993; Alencar et al. 2005). It is a triple system and the\nprototype of the RW Aur-class of irregular variable stars (Hoffmeister 1957), characterized\nfor rapid magnitude variations with ∆mag∼1-4 mag and a typical spectral type around G5.\nThe very small millimeter disk mass of RW Aur (∼0.0003 M⊙ ; Osterloh & Beckwith 1995)\nsuggests a timescale for disk removal of the order of centuries to millenia, too short unless we\nassume brief and transient accretion episodes (Cabrit 2005) and/or important grain growth\nto cm sizes (Rodmann et al. 2006). The accretion seems to be non-axisymmetric, as expected\nfrom interactions with a close companion (Petrov et al. 2001).\nThe 1 Myr-old star GW Ori is one of the most massive TTS known (M=2.5 M⊙ , R=5.6\nR⊙ ; Mathieu et al. 1991), resembling strongly GM Cep. With an accretion rate ∼10−6 M⊙ /yr,\nit is a very fast rotator (Vsini=43 km/s; Bouvier et al. 1986), and shows variability up to\n1 mag in JHK (Samus et al. 2004). It is a binary (maybe triple) system, with a ∼G5\nprimary with luminosity 26 L⊙ , similar to GM Cep and abnormally high for its spectral\n\n\f– 20 –\ntype (Mathieu et al. 1991). It is also has a very strong IR excess, and is one of the most\nluminous TTS at millimeter wavelengths (Mathieu et al. 1991, 1995), suggesting a disk (or\ndisk+shell) mass ∼1.5M⊙ , being the only one in its class able to sustain high accretion rates\nover several Myr.\nThe K3 star CW Tau shares with GM Cep the rapid rotation (Vsini=28 km/s; Muzerolle\net al. 1998), the Hα P-Cygni profile and a deep, and a broad OI absorption at 7773Å. It\nshows magnitude variations up to 2 magnitudes (General Catalog of Variable Stars, Kukarkin\net al. 1971), and has a strong outflow (Hirth et al. 1994; Gómez de Castro 1993) and strong\n[N II] forbidden line emission. As for GM Cep, the mass of the disk is not specially high\ndespite the signs of strong accretion (<0.02 M⊙ ; Beckwith et al. 1990).\nThe outburst of IRAS 05436-0007/V1647 (Eislöffel & Mundt 1997) revealed the bright\nMcNeil Nebula in 2004 (McNeil et al. 2004). This very extincted (AV ∼13 mag) object\nshows a flat mid-IR spectrum (in contrast to typical EX-or and similar objects, which have\nTTS-looking IR SEDs). It has been considered as a Class 0 embedded object (Lis et al.\n1999), but may be some type of EX-or or FU-or Class II object, surrounded by a massive\ncircumstellar envelope (M∼0.5 M⊙ ; Ábrahám et al. 2004), with a 5.6 L⊙ luminosity, typical\nof TTS, or an intermediate case between EX-or and FU-or objects (Fedele et al. 2007). Its\nemission line spectrum at optical wavelengths is similar to the spectrum of GM Cep.\nKH 15D is a pre-main sequence binary system with a precessing disk or ring, seen edge\non, so one of the components is permanently occulted by the disk, whereas the other is visible\nonly during half of the period (Hamilton et al. 2005). The color changes are affected by the\neclipses and scattering. Although such special configurations allow much large amplitudes\nand atypical color variations, a similar scenario fails to explain the high luminosity of GM Cep\nwithout changing its spectral type and luminosity class or introducing additional mechanims\n(i.e., hot shells) to reproduce the optical absorption lines.\n\n5.\n\nConclusions\n\nGM Cep is an extremely variable late G star in the 4 Myr-old cluster Tr 37, resembling\nyounger EX-or objects. Its complex variability in color and magnitude is not consistent\nwith a single typical variability mechanism in TTS (hot/cold spots, variable obscuration,\nor changes in the accretion rate). The amplitude of the variations, the high accretion rate,\nthe luminous mid-IR disk, and the high stellar luminosity suggest variable accretion to\nbe the stronger contributor, maybe mixed with variable extinction by circumstellar material\n(similar to UX-or variables), and some minor influence of cold spots and scattering. Increased\n\n\f– 21 –\naccretion episodes are thought to produce the strong, irregular variations in young EX-or\nand FU-or objects, typically still surrounded by massive infalling envelopes. Nevertheless,\nGM Cep has a medium-mass disk and a small or inexistent envelope, and belongs to a cluster\nwhere strong disk evolution is ubiquitous. Large changes in the accretion rates can result in\nchanges in the stellar and disk structure, and conversely, the disruption of the disk structure\n(for instance, by companions, or via gravitational instability if the disk is very massive and\ncompact), can increase the accretion rate. The presence of companions (stellar, substellar or\nplanetary) is a plausible mechanism to produce disk instabilities in a relatively old star like\nGM Cep. Simultaneous multiwavelength observations, including IRS spectra scheduled for\n2007, providing coverage in the 5-35μm range, and detailed monitoring in the coming years\nwill help us to reveal the nature of the variability in GM Cep. Sub-millimetre observations\nin the future should be used to determine the SED slope and constrain the size of the grains.\nOld but extremely accreting stars are thus a key to understand the processes of disk accretion\nand evolution and the consequences for planet formation.\nWe want to thank the Calar Alto Observatory for allocation of Director's Discretionary\nTime to this programme. We thank L. A. Hillenbrand for kindly providing the HIRES\nspectrum of GM Cep taken in 2001, J.A. Acosta-Pulido for providing us with his 'caindr'\npackage, and P. D'Alessio, for providing the tools for modelling the disk. P.Á. acknowledges\nthe support of the Hungarian Research Fund No. K62304. This publication makes use of data\nproducts from the Two Micron All Sky Survey, which is a joint project of the University\nof Massachusetts and the Infrared Processing and Analysis Center/California Institute of\nTechnology, funded by the National Aeronautics and Space Administration and the National\nScience Foundation. This research has made use of the SIMBAD database, operated at\nCDS, Strasbourg, France, of the SuperCOSMOS Sky Survey, provided by WFAU, Institute\nfor Astronomy, Royal Observatory, Blackford Hill, Edinburgh, and of the Digitized Sky\nSurveys, produced at the Space Telescope Science Institute under U.S. Government grant\nNAG W-2166. We thank as well K. Tristram, S. Birkmann, B. Braunecker, and J. Stegmaier\nfor their help at the 70 cm Königstuhl telescope, and S. Pedraz-Marcos for his help with the\nCalar Alto observations. We thank O. Fischer, J. Greiner, P. Kroll, D. Fedele, C. Eiroa, M.\nWiedner, H. Beuther, V. Roccatagliata, and B. Conn for their comments and suggestions.\nWe finally thank the anonymous referee for his/her comments and suggestions to improve\nthe quality of this paper.\n\n\f– 22 –\nREFERENCES\nÁbrahám, P., Kóspál, A., Csizmadia, S., Moór, A., Kun, M., Stringfellow, G., 2004, A&A\n419, L39\nAlencar, S., Basri, G., Hartmann, L., Calvet, N., 2005, A&A 440, 595\nBeckwith, S., Sargent, A., Chini, R., Güsten, R., 1990, AJ, 99, 924\nBessell, M., 1979, PASP, 91, 589\nBessell, M., 1986, PASP, 98, 1303\nBlair, M., & Gilmore, G., 1982, PASP 94, 742\nBonnell, L., & Bastien, P., 1992, ApJ, 401, L31\nBouwman, J., Lawson, W., Dominik, C., Feigelson, E., Henning, Th., Tielens, A., Waters,\nL., 2006, ApJ, 653, L57\nCardelli, J., Clayton, G., Mathis, J., 1989, ApJ, 345, 245\nChavarria-K., C., 1979, A&A, 79, 18\nChen, X. P.; Henning, T.; van Boekel, R.; Grady, C. A., 2006, A&A, 445, 331\nClarke, C., Lin, D., Pringle, J., 1990, MNRAS, 242, 439\nClarke, C., & Syer, D., 1996, MNRAS, 278, L23\nClarke, C., Lodato, G., Melnikov, S., Ibrahimov, M., 2005, MNRAS, 361, 942\nColuzzi, R., 1993, ILLSS Catalogue, Bull. Inf. CDS, 43, 7\nContreras, M.E., Sicilia-Aguilar, A., Muzerolle, J., Calvet, N., Berlind, P., Hartmann, L.\n2002, AJ, 124, 1585\nCouch, W., & Newell, E., 1980, PASP, 92, 746\nCurcio, J., Drummeler, L., Knestrick,G., 1964, Applied Optics Vol. 3, N. 12, 1401\nD'Alessio, P., Calvet, N., Hartmann, L., Lizano, S., Cantó, J., 1999, ApJ, 527, 893\nD'Alessio, P., Merı́n, B., Calvet, N., Hartmann, L., & Montesinos, B., 2005, Rev. Mex. A.\nA., 41, 1\n\n\f– 23 –\nDullemond, C., Dominik, C., Natta, A., 2001, ApJ 560, 957\nDutrey, A., Guilloteau, A., Guelin, M., 1997, A&A, 317, L55\nEdwards, S., Hartigan, P., Gandour, L., Andrulis, C., 1994, AJ 108, 1056\nEislöffel, J.; Mundt, R. 1997 AJ, 114, 280\nFedele, D., van den Ancker, M., Petr-Gotzens, M., Rafanelli, P., 2007, AA in press\nFernie, J., 1983, PASP, 95, 782\nFrerking, M., Langer, W., Wilson, R., 1982, ApJ, 262, 590\nGhez, A., Neugebauer, G., Matthews, K., 1993, AJ 106, 2005\nGómez de Castro, A., 1993, ApJ, 412, 43\nGrinin, V., Rostopchina, A., Shakhovskoy, D., 2000, IAUS, 200, 115\nGrinin, V., Kozlova, O., Natta, A., Ilyin, I., Tuominen, I., Rostopchina, A., Shakhovskoy,\nD., 2001, A&A, 397, 482\nGullbring, E., Hartmann, L., Briceño, C., Calvet, N., 1998, ApJ 492, 323\nHamilton, C., Herbst, W., Vrba, F., & 14 more coauthors, 2005, AJ, 130, 1896\nHartmann, L., Hewett, R., Stahler, S., Mathieu, R., 1986, ApJ, 309, 275\nHartmann, L., & Kenyon, S., 1987, ApJ 322, 393\nHartmann, L., & Raymond, J., 1989, ApJ , 337, 903\nHartmann, L., & Kenyon, S., 1996, ARAA, 34, 207\nHerbig, G., Aspin, C., Gilmore, A., Imhoff, C., Jones, A., 2001, PASP, 113, 1547\nHerbig, G., Petrov, P., Duemmler, R., 2003, ApJ, 595, 384\nHerbig, G., 2007, AJ, 133, 2679\nHerbst, W., Herbst, D., Grossman, E., Weinstein, D., 1994, AJ 108, 1906\nHerbst, W., Shevchenko, V., 1999, AJ 118, 1043\nHirth, G. A.; Mundt, R.; Solf, J., 1994, A&A, 285, 929\n\n\f– 24 –\nHoffmeister, C., 1957, IAUS, 3, 22\nJuhász, A., Prusti, T., Ábrahám, P., Dullemond, C., 2007, MNRAS, 374, 1242\nKóspál, A.; Ábrahám, P.; Prusti, T.; Acosta-Pulido, J.; Hony, S.; Moór, A.; Siebenmorgen,\nR., 2007, A&A in press\nKrügel, E., & Siebenmorgen, R., 1994, A&A, 288, 929\nKun, M., 1986, Commission 27 of the I.A.U., Information Bulleting on Variable Stars, 2961\nKukarkin B.V., Kholopov P.N., Pskovski Y.P., Efremov Y.N., Kukarkina N.P., Kurochkin\nN.E. and Medvedeva G.I., 1971, General Catalogue of Variable Stars, 3rd ed.\nKurtz, M.J., Mink, D.J., Wyatt, W.F., Fabricant, D.G., Torres, G., Kriss, G., and Tonry,\nJ.L. 1992, in Astronomical Data Analysis Software and Systems I, ASP Conf. Ser.,\nVol. 25, eds. D.M. Worral, C. Biemesderfer, and J. Barnes, 432\nLaw, N. M., Mackay, C. D., and Baldwin, J. E., 2006, A&A, 446, 739\nLehman, T., Reipurth, B., Brandner, W., 1994, AA, 300, L9\nLin, D.N.C., & Papaloizou, J., 1986, ApJ, 309, 846\nLodato, G., Clarke, C., 2004, MNRAS, 353, 841\nMannings, V., Emerson, J., 1994, MNRAS, 267, 361\nMarschall, L.A. & van Altena, W.F., 1987, AJ, 94,71\nMathieu, R., Adams, F., Latham,D., 1991, AJ, 101, 2184;\nMathieu, R., Adams, F., Fuller, G., Jensen, E., Koerner, D., Sargent, A., 1995, AJ, 109,\n2655\nMcNeil, J., Reipurth, B., Meech, K., 2004, IAUC 8284, 1\nMerı́n, B., 2004 PhD Thesis, Universidad Autónoma de Madrid\nMiyake, K., & Nakagawa, Y., 1993, ICARUS, 106, 20\nMontes, D., Martı́n, E., Fernández-Figueroa, M., Cornide, M, De Castro, E., 1997, A&AS,\n123, 473\nMora, A.; Merı́n, B.; Solano, E.; Montesinos, B.; de Winter, D.; Eiroa, C.; Ferlet, R.; Grady,\nC. A.; Davies, J. K.; Miranda, L. F.; and 12 coauthors, A&A 378, 116\n\n\f– 25 –\nMorgenroth, O., 1939, Astron. Nachr. 268, 273\nMüller, M., Thornwirth, S., Roth, D., & Winnewisser, G., 2001, A&A 370, L49\nMüller, M., Schlöder, F., Stutski, J., & Winnewisser, G., 2005, J Mol. Struct. 742, 215\nMuzerolle, J., Hartmann, L., Calvet, N., 1998, AJ 116, 455\nMuzerolle, J., Calvet, N., Briceño, C., Hartmann, L. & Hillenbrand, L., 2000, ApJ, 535, L47\nNatta, A., Grinin, V., Manings, V., & Ungerechts, H., 1997, ApJ 491, 885\nNatta, A., Whitney, B., 2000, A&A, 364, 633\nNatta, A., Grinin, V., Tambovtseva, L., 2000, ApJ, 542, 421\nNatta, A., Testi, L., Muzerolle, J., Randich, S., Comerón, F., Persi, P., 2004, A&A 424, 603\nOsterloh, M., & Beckwith, S., 1995, ApJ 439, 288\nPatel, N.A., Goldsmith, P.F., Heyer, M.H. & Snell, R.L., 1998, ApJ , 507, 241\nPetrov, P., Gahm, G., Gameiro, G., Duemmler, R., & 4 more coauthors, 2001, A&A, 369,\n993\nQuanz, S., Henning, Th., Bouwman, J., Ratzka, T., & Leinert, C., 2006, ApJ, 648, 472\nRalchenko, Yu., Jou, F.-C., Kelleher, D.E., Kramida, A.E., Musgrove, A., Reader,\nJ., Wiese, W.L., and Olsen, K. (2007). NIST Atomic Spectra Database (version\n3.1.2); http://physics.nist.gov/asd3. National Institute of Standards and Technology,\nGaithersburg, MD\nReipurth, B., Aspin, C., 2004, ApJ 608, L65\nRodmann, J.; Henning, Th.; Chandler, C. J.; Mundy, L. G.; Wilner, D. J., 2006, A&A, 446,\n211\nSamus et al., 2004, Combined General Catalogue of Variable Stars, The GCVS4.2 Catalog\n(Vol. I-III)\nSchöier, F., van der Tak, F., van Dishoeck, E., Black, J., 2005, A&A432, 369\nSchevchenko, V., Grankin, K., Ibraghimov, M., Melnikov, S., Yakubov, S., 1993, Ap&SS,\n202, 137\n\n\f– 26 –\nSicilia-Aguilar, A., Hartmann, L., Briceño, C., Muzerolle, J.,Calvet, N., 2004, AJ128, 805,\nPaper I\nSicilia-Aguilar, A., Hartmann, L., Szentgyorgyi, A., Roll, J., Conroy, M., Calvet, N., Fabricant, D., & Hernández, J., 2005, AJ, 129, 363\nSicilia-Aguilar, A., Hartmann, L., Hernández, J., Briceño, C., Calvet, N., 2005, AJ130, 188,\nPaper II\nSicilia-Aguilar, A., Hartmann, L., Calvet, N., Megeath, S.T., Muzerolle, J., Allen, L.,\nD'Alessio, P., Merı́n, B., Stauffer, J., Young, E., Lada, C., 2006,ApJ 638, 897, Paper\nIII\nSicilia-Aguilar, A., Hartmann, L., Fürész, G., Henning, Th., Dullemond, C., Brandner, W.,\n2006, AJ 132, 2135. Paper IV\nSiess, L., Dufour, E. & Forestini, M. 2000 A&A , 358, 593\nSuyarkova, O., 1975, Variable stars 20, 167\nTambovtseva, L., Grinin, V., Rodgers, B., Kozlova, O., 2001, Astronomy Reports, 45, 6, 442\nTaylor, S., Hartquist, T., Williams, D., 1993, MNRAS, 264, 929\nThi, W., van Dishoeck, E., Blake, G., van Zadelhoff, G., and 7 more authors, 2001, ApJ,\n561, 1074;\nTonry, J., & Davis, M., 1979, AJ 84, 1511\nTubbs, R. N., Baldwin , J. E., Mackay, C. D., and Cox, G. C., 2002, A&A, 387. L21\nVittone, A. & Errico, L., 2005, Mem. S.A.It., 76, 320\nWelty, A., Strom, S., Strom, K., Hartmann, L., Kenyon, S., Grasdalen, G., Stauffer, J.,1990,\nApJ 349, 328\nWelty, A., Strom, S., Edwards, S., Kenyon, S., Hartmann, L., 1992, ApJ 397, 250\n\nThis preprint was prepared with the AAS LATEX macros v5.2.\n\n\f– 27 –\n\nTable 1. Summary of Observations on GM Cep\nDate/Epoch\n\nObservatory/Telescope\n\nFilter/Mode\n\nReferences\n\nBefore 1939\n1952.556a\n1955.936\n1955.941\n1965-10-02\n1978.1:\n1983.5\n1985-10-20\n1986-09-18\n1989.757\n1990.763\n1990.789:\n1990.789b\n1991.595c\n1991.599\n1993.552\n1994.44\n1996-1998\n2000-09-03\n2000-09-04\n2000-09-05\n2000-09-06\n2000-09-07\n2000-09-08\n2000-09-09\n2000-09-21\n2001-06-30\n2001-07-11\n2001-09-21\n2001-09-22\n2001-09-23\n2001-09-25\n2002-09-03\n2003-10-20\n2003-12-20\n2004-06-23\n2004-12-01\n2006-06-02/03\n2006-06-03/05\n2006-07-07\n2006-07-03\n2006-10-18\n2006-11-10\n2006-12-15\n2006-12-29\n2006-12-31\n\nSonneberg Observatory\nPalomar\nPalomar\nPalomar\nKonkoly Observatory\nPalomar\nIRAS\nKonkoly Observatory\nKonkoly Observatory\nPalomar\nPalomar\nPalomar\nPalomar\nPalomar\nPalomar\nPalomar\nPalomar\nMSX6C\nFLWO 1.2m\nFLWO 1.2m\nFLWO 1.2m\nFLWO 1.2m\nFLWO 1.2m\nFLWO 1.2m\nFLWO 1.2m\nFLWO 0.9m 2MASS\nKeck I/HIRES\nFLWO 1.5m/FAST\nFLWO 1.2m\nFLWO 1.2m\nFLWO 1.2m\nFLWO 1.2m\nFLWO 1.2m\nFLWO 1.2m\nIRAC/Spitzer\nMIPS/Spitzer\nHectochelle/MMT\nIRAM/MAMBO I\nIRAM/Heterodyne\nCalar Alto 2.2m/AstraLux\nKönigstuhl 70 cm\nKönigstuhl 70 cm\nCalar Alto 2.2m/AstraLux\nKönigstuhl 70 cm\nCalar Alto 2.2m/CAFOS\nCalar Alto 2.2m/CAFOS\n\nVisual Photographic Plates\nR63F\nGG395-Bj , R63F\nR63F\nV\nI9\n12-25-60-100μm\nV\nV\nGG395-Bj\nR61F\nGG395-Bj\nR59F\nGG395-Bj\nGG395-Bj\nR63F\nI9\nACDE\nRc Ic\nVRc Ic\nRc Ic\nRc Ic\nRc Ic\nRc Ic\nRc Ic\nJHK\nHigh-res. spectroscopy\nLow-res. spectroscopy\nRc Ic\nRc Ic\nRc Ic\nRc\nU\nU\n3.6, 4.5, 5.8, 8.0 μm\n23.9, 70.0 μm\nHα spectroscopy\n1.3mm continuum\n12 CO(1-0), 12 CO(2-1)\nz'\nUBVRI\nUBVRI\nz'\nUBVRI\nVRI\nVRI\n\nMorgenroth (1939)\nUSNO B1.0, Monet et al. (2003)\nUSNO A2.0, Monet et al. (1998)\nSuperCosmos Catalog, Poss-I Red\nKun(1986)\nUSNO B1.0, Monet et al. (2003)\nIRAS (from Vizier)\nKun(1986)\nKun(1986)\nUSNO B1.0, Monet et al. (2003)\nSuperCosmos Catalog, Poss-II Red\nGSC 2.2 Catalogue\nUSNO B1.0, Monet et al. (2003)\nUSNO B1.0, Monet et al. (2003)\nSuperCosmos Catalog, Poss-II Blue\nGSC 2.2 Catalogue\nSuperCosmos Catalog, Poss-II IR\nMSX6C, Egan et al. (2003)\nPaper I\nPaper I\nPaper I\nPaper I\nPaper I\nPaper I\nPaper I\n2MASS\nThis work\nPaper I\nPaper I\nPaper I\nPaper I\nPaper I\nPaper I\nPaper I\nPaper III\nPaper III\nPaper IV\nThis work\nThis work\nThis work\nThis work\nThis work\nThis work\nThis work\nDDT program, this work\nDDT program, this work\n\n\f– 28 –\n\nTable 1-Continued\nDate/Epoch\n2007-01-02\n2007-01-18\n2007-04-27\n2007-05-11\n2007-06-02\n2007-06-03\n2007-06-04\n2007-06-05\n2007-06-08\n2007-06-08\n2007-06-24\n2007-06-25\n\nObservatory/Telescope\n\nFilter/Mode\n\nReferences\n\nCalar Alto 2.2m/CAFOS\nCalar Alto 2.2m/CAFOS\nCalar Alto 2.2m/CAFOS\nCalar Alto 2.2m/AstraLux\nCarlos Sánchez/Teide\nCarlos Sánchez/Teide\nCarlos Sánchez/Teide\nCarlos Sánchez/Teide\nCarlos Sánchez/Teide\nKönigstuhl 70 cm\nCalar Alto 2.2m/AstraLux\nCalar Alto 2.2m/AstraLux\n\nVRI\nVRI\nLow-res. spectroscopy\ni'z'\nJHK\nJHK\nJHK\nJHK\nJHK\nUBVRI\nz'\nz'\n\nDDT program, this work\nDDT program, this work\nDDT program, this work\nThis work\nThis work\nThis work\nThis work\nThis work\nThis work\nThis work\nThis work\nThis work\n\nNote. - Summary of the data available on GM Cep, including our own observations and the\ndata from the literature. 1952.556a : The epoch is uncertain, either 1952.556 or 1955.936. 1990.789b :\nThe epoch is uncertain, can be 1990.789, 1991.600, or 1993.070. 1991.595c : The epoch is uncertain,\neither 1991.595 or 1991.603.\n\n\f– 29 –\n\nTable 2. Summary of AstraLux Observations of GM Cep\nDate\n\nFilter\n\nTint\n\nSeeing\n\nStrehl\n\n2006-07-07\n2006-11-10\n2007-05-11\n2007-05-11\n2007-06-24\n2007-06-25\n\nz'\nz'\ni'\nz'\nz'\nz'\n\n3000x100ms\n15000x25ms\n10000x30ms\n10000x30ms\n15000x30ms\n15000x30ms\n\n1.10\n0.60\n0.80\n0.80\n0.70\n0.85\n\n0.09\n0.14\n0.08\n0.10\n0.14\n0.12\n\nComments\n\nAtmospheric dispersion\n\nNote. - Summary of observations done with AstraLux. See text.\n\nTable 3. Near-Infrared Observations\nEpoch\n\nJ\n\nH\n\nK\n\nReferences\n\n22-09-2000\n02-06-2007\n03-06-2007\n04-06-2007\n05-06-2007\n08-06-2007\n\n10.279±0.026\n10.37±0.17\n10.52±0.07\n10.24±0.04\n10.21±0.04\n10.31±0.10\n\n9.329±0.029\n9.32±0.23\n9.36±0.05\n9.35±0.03\n9.26±0.03\n9.30±0.05\n\n8.593±0.020\n8.76±0.13\n8.48±0.04\n8.71±0.08\n8.64±0.03\n8.45±0.04\n\n2MASS\nThis work\nThis work\nThis work\nThis work\nThis work\n\nNote. - JHK magnitudes from 2MASS and from the observations at the\nCarlos Sánchez telescope.\n\n\fTable 4. Optical Data\nEpoch\n\nU\n\nB\n\nV\n\nRc\n\nIc\n\nRJ\n\nIJ\n\nGG395-Bj\n\nR59F\n\nR61F\n\nR63F\n\nI9\n\nRefs.\n\n1952.556a\n1955.936\n1955.941\n1978.1:\n1965.753\n1985.803\n1986.715\n1989.575\n1990.763\n1990.789:\n1990.789:\n1990.789b\n1991.595c\n1991.599\n1993.552\n1994.44\n2000.674\n2000.677\n2000.679\n2000.684\n2000.687\n2000.690\n2000.692\n2001.723\n2001.726\n2001.729\n2001.734\n2002.674\n2003.803\n2006.504\n2006.797\n2006.956\n2006.995\n2006.998\n2006.998\n\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n16.987±0.009\n16.25±0.11\n15.04±0.02\n15.64±0.03\n16.02±0.05\n-\n-\n-\n\n-\n-\n-\n-\n-\n17.31:\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n14.51±0.01d\n15.02±0.04d\n15.33±0.01d\n-\n-\n-\n\n-\n-\n-\n-\n12.87±0.1\n14.30±0.1\n15.02±0.1\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n13.915±0.002\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n13.173±0.005\n13.613±0.004\n13.783±0.004\n14.802±0.007\n14.729±0.004\n14.727±0.008\n\n12.92±0.1*\n14.48±0.1*\n14.58±0.1*\n-\n-\n-\n-\n-\n-\n-\n-\n14.05±0.1*\n-\n-\n13.66±0.1*\n-\n12.971±0.002\n12.952±0.002\n12.979±0.002\n12.988±0.002\n12.878±0.003\n12.894±0.004\n12.885±0.002\n12.702±0.003\n12.710±0.003\n12.753±0.003\n12.715±0.003\n-\n-\n12.36±0.04*\n12.76±0.03*\n12.88±0.03*\n13.96±0.04*\n-\n13.93±0.06*\n\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n12.141±0.002\n12.141±0.002\n12.128±0.002\n12.213±0.002\n11.977±0.003\n12.030±0.002\n12.072±0.002\n11.846±0.002\n11.924±0.002\n11.857±0.003\n-\n-\n-\n11.64±0.2*\n11.98±0.2*\n-\n13.17±0.2*\n\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n12.52±0.07*\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n12.024±0.011\n12.405±0.007\n12.467±0.007\n13.60±0.02\n\n-\n\n-\n-\n-\n-\n-\n-\n-\n-\n-\n14.08\n\n-\n-\n-\n-\n-\n\n13.61±0.01\n\n-\n15.4(±0.1)\n-\n-\n-\n-\n-\n14.74\n-\n14.22\n14.52\n-\n14.44\n14.225\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n\n-\n\n13.15±0.2*\n\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n11.7±0.2*\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n11.20±0.01\n11.525±0.008\n-\n12.714±0.005\n-\n12.706±0.005\n\n12.84\n14.4(±0.1)\n14.502\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n13.58\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n\n-\n-\n-\n11.77\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n12.995\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n\n(1)\n(2)\n(3)\n(1)\n(4)\n(4)\n(4)\n(1)\n(5)\n(6)\n(6)\n(1)\n(1)\n(7)\n(6)\n(8)\n(9)\n(9)\n(9)\n(9)\n(9)\n(9)\n(9)\n(9)\n(9)\n(9)\n(9)\n(9)\n(9)\n(10)\n(10)\n(10)\n(10)\n(11)\n(11)\n\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n\n13.993\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n\n\fTable 4-Continued\nEpoch\n\nU\n\nB\n\nV\n\nRc\n\nIc\n\nRJ\n\nIJ\n\nGG395-Bj\n\nR59F\n\nR61F\n\nR63F\n\nI9\n\nRefs.\n\n2007.005\n2007.049\n2007.321\n2007.435\n2007.435\n2007.435\n\n-\n-\n-\n-\n15.26±0.13\n-\n\n-\n-\n-\n-\n14.63±0.03\n-\n\n14.728±0.008\n13.912±0.006\n14.41±0.01\n13.26±0.02\n13.302±0.009\n13.24±0.02\n\n13.91±0.04*\n13.01±0.06*\n13.46±0.06*\n-\n12.43±0.08*\n-\n\n13.19±0.2*\n12.02±0.2*\n-\n-\n11.73±0.2*\n-\n\n13.571±0.009\n12.61±0.01\n13.00±0.01\n-\n12.06±0.02\n-\n\n12.749±0.006\n11.507±0.005\n-\n-\n11.29±0.01\n-\n\n-\n-\n-\n-\n-\n-\n\n-\n-\n-\n-\n-\n-\n\n-\n-\n-\n-\n-\n-\n\n-\n-\n-\n-\n-\n-\n\n-\n-\n-\n-\n-\n-\n\n(11)\n(11)\n(12)\n(10)\n(10)\n(10)\n\nNote. - Optical data available for GM Cep. Asterisk indicates that the magnitude has been transformed into the given system, following the tranformations of Fernie\n(1983), Bessel (1979), Bessell et al. (1986),Blair & Gilmore (1982), Couch & Newell (1980). Uncertain magnitudes and epochs are marked by \":\". 1952.556a : The epoch is\nuncertain, either 1952.556 or 1955.936. 1990.789b : The epoch is uncertain, can be 1990.789, 1991.600, or 1993.070. 1991.595c : The epoch is uncertain, either 1991.595 or\n1991.603. The d index for the B band data from the Königstuhl indicates that the zeropoint is uncertain (see Section 2.2). The references to the data catalog and/or telescope\nand instruments are: (1) = USNO B1.0, Monet et al.(2003); (2) = USNO-A2.0, Monet et al. (1998);(3) = SuperCosmos Catalog, Poss-I Red; (4) = Konkoly Observatory,\nKun (1986); (5) = SuperCosmos Catalog, Poss-II Red; (6) = GSC 2.2 Catalogue; (7) = SuperCosmos Catalog, Poss-II Blue; (8) = SuperCosmos Catalog, Poss-II IR; (9) =\n4Shooter/48\" FLWO; (10) = 70cm Königstuhl; (11)=CAFOS/2.2m Calar Alto; (12)=CAFOS/2.2m Calar Alto spectroscopy mode.\n\n\f– 32 –\n\nTable 5. Emission and Absorption Lines\nLine\n\nλ (Å)\n\nEW (Å)\n\nEpoch\n\n[N II]\n\"\nHα\n\"\n\"\n\"\n[N II]\n\"\n[S II]\n[S II]\nFe II\nFe I\nLi I\n\"\n\"\n[O I]\nOI\n\"\nOI\n\"\nCa II\n\"\nCa II\nCa II\n\"\n\n6548\n\"\n6563\n\"\n\"\n\"\n6583\n\"\n6717\n6731\n6516\n6495\n6708\n\"\n\"\n6363\n7774\n\"\n8446\n\"\n8498\n\"\n8542\n8662\n\"\n\n-0.02\n-0.04\n-6\n-10\n-14\n-19\n-0.03\n-0.08\n-\n-0.12\n-0.06\n-0.04\n0.16\n-\n-\n-\n0.79\n1.2\n-0.52\n-0.2\n-3.08\n-3.8\n-2.2\n-1.25\n-2.5\n\nHIRES 2001\nHecto. 2004\nHIRES 2001\nFAST 2001\nHectochelle 2004\nCAFOS 2007\nHIRES 2001\nHecto. 2004\nHIRES 2001\nHIRES 2001\nHectochelle 2004\nHectochelle 2004\nHIRES 2001\nFAST 2001\nCAFOS 2007\nHIRES 2001\nHIRES 2001\nCAFOS 2007\nHIRES 2001\nCAFOS 2007\nHIRES 2001\nCAFOS 2007\nCAFOS 2007\nHIRES 2001\nCAFOS 2007\n\nComments\n\nBluesh. abs. V∼-80 km/s, B=-2.0Å, R=-4.0Å\nBluesh. abs. V∼-60 km/s, B=-3.5Å, R=-10.5Å\n\nV∼-100 km/s\n\nProbably undetected because of veiling\nMay be masked by nearby absorption lines\n\nV∼ -140/+80 km/s, B=-0.32Å, R=-0.20Å\n\nMay be blended with H Pa 13\nMay be blended with H Pa 13\n\nNote. - Emission and absorption lines that related to accretion and/or winds. Negative and\npositive EW correspond to emission and absorption lines, respectively. The CAFOS 2007 data has\nsimultaneous photometry showing V=14.41±0.01 and RJ =13.00±0.01. \"B\" and \"R\" indicate the\nEW of the blue- and redshifted components, respectively.\n\n\f– 33 –\n\nTable 6. Mid-Infrared Fluxes\nEpoch\n\nλ/Band (μm)\n\nFlux (Jy)\n\nReferences\n\n1983.5\n1983.5\n1983.5\n1983.5\n1996-1998\n1996-1998\n1996-1998\n1996-1998\n2003.970\n2003.970\n2003.970\n2003.970\n2004.477\n2004.477\n\n12\n25\n60\n100\n8.28/A\n12.13/C\n14.65/D\n21.0/E\n3.6\n4.5\n5.8\n8.0\n23.9\n70.0\n\n0.659±0.046\n0.836±0.075\n1.44±0.20\n<2.60\n0.622±0.031\n<0.629\n<0.482\n<1.37\n0.247±0.012\n0.219±0.011\n0.256±0.013\n0.282±0.014\n0.791±0.079\n0.829±0.083\n\nIRAS, computed by Vizier\nIRAS, computed by Vizier\nIRAS, computed by Vizier\nIRAS, computed by Vizier\nMSX6C, (Egan et al. 2003)\nMSX6C, (Egan et al. 2003)\nMSX6C, (Egan et al. 2003)\nMSX6C, (Egan et al. 2003)\nIRAC/Spitzer (Paper III)\nIRAC/Spitzer (Paper III)\nIRAC/Spitzer (Paper III)\nIRAC/Spitzer (Paper III)\nMIPS/Spitzer (Paper III)\nMIPS/Spitzer (Paper III)\n\nNote. - Mid-IR fluxes from the literature.\n\nTable 7. Radial and Rotational Velocity\n< λ > (Å)\n6370\n6470\n6590\n6710\n6840\n7110\n7410\n7730\n7910\n8670\n8270\n8470\n8470\n\nStandard/Sp.Type\n\nR\n\nCZ (km/s)\n\nVsini (km/s)\n\nHD222368/F7V\nHD222368/F7V\nHD222368/F7V\nHD222368/F7V\nHD122693/F8V\nHD222368/F7V\nHD222368/F7V\nHD122693/F8V\nHD222368/F7V\nHD126053/G1V\nHD222368/F7V\nHD122693/F8V\nHD126053/G1V\n\n3.4\n10.9\n1.3\n4.0\n1.6\n5.1\n6.7\n3.5\n4.7\n2.2\n1.6\n1.4\n1.4\n\n-22.1±8.1\n-23.9±2.7\n-19.7±12.7\n-30.7±5.8\n-27.2±12.0\n-8.0±3.9\n-25.6±4.3\n-26.3±7.0\n-14.9±4.7\n-25.4±9.9\n-13.5±9.5\n-29.0±10.7\n-28.1±12.0\n\n49.9±11.5\n41.2±3.5\n44.2±19.4\n43.3±8.7\n52.5±20.4\n49.1±8.1\n47.7±6.2\n50.4±11.3\n41.0±7.2\n42.7±13.5\n40.0±15.6\n38.0±15.7\n46.0±19.0\n\nComments\n\nFew lines\nFew lines\n\nFew lines\nFew lines\nFew lines\n\nNote. - Results of the cross-correlation for the different orders of the HIRES spectrum, including the standard used for comparison and its spectral type, the R parameter,\nindicative of the goodness of the correlation (Tonry & Davis 1979; Hartmann et al. 1986;\nKurtz et al. 1992), the radial velocity CZ, and the rotational velocity Vsini. Some parts\nof the spectra are affected by H2 O and O2 atmospheric absorption bands, leading to\nsmall regions free of absorption, few lines to correlate, and worse correlations (R<2). The\norders centered in 6970 and 8090Å are so strongly affected by atmospheric absorption\nfeatures that we could not cross-correlate them.\n\n\f– 34 –\n\nTable 8. Binary Detection Limits For AstraLux\nDistance (AU)\n60\n90\n100\n150\n200\n250\n300\n350\n400\n425\n450\n500\n600\n700\n800\n900\n1000\n1500\n2000\n2500\n3000\n3500\n\nSeparation (\")\n\n∆(mag)\n\n0.07\n0.10\n0.11\n0.17\n0.22\n0.27\n0.33\n0.39\n0.44\n0.47\n0.50\n0.56\n0.67\n0.78\n0.89\n1.00\n1.11\n1.68\n2.22\n2.78\n3.33\n3.89\n\n-0.5\n-1.2\n-1.8\n-2.0\n-2.6\n-3.2\n-3.5\n-3.8\n-3.9\n-4.0\n-4.1\n-4.4\n-4.6\n-4.8\n-5.0\n-5.3\n-5.5\n-6.2\n-6.4\n-6.6\n-6.6\n-6.6\n\nNote. - Detection limits for binary companions with AstraLux. Based on a 5σ detection\nover the background.\n\n\f– 35 –\n\nFig. 1.- Low-resolution spectra of GM Cep. The main emission and absorption features,\nas well as the atmospheric H2 O and O2 bands, are labeled.\n\n\f– 36 –\n\nFig. 2.- AstraLux observations of GM Cep in the SDSS z' filter. The left image has a\nfield of view of 2′′ ×2′′ and was generated from the best 2% of 15,000 single frames. The\neffective integration time is 7.5 s at a single frame exposure time of 25 ms. The middle image\nshows the inner 0.′′ 9×0.′′ 9. The right image is the theoretical PSF with same pixel scale,\ntaking atmospheric dispersion effects into account. All images are square root scaled up to\nsaturation.\n\nFig. 3.- Left: 12 CO(1-0) and 12 CO(2-1) spectra. The zero frequencies are 115.2712 and\n230.538 GHz, respectively. A narrow emission is seen at approximately the cluster velocity\nonly in12 CO(1-0), suggeting that the radial velocity of GM Cep is consistent with the radial\nvelocity of the cluster. Right: FCRAO CO J=1-0 peak intensity map of the IC1396 region\nnear GM Cep (Patel et al. 1998). The position of GM Cep is marked as a \"+\". The halftone\ngreyscale levels are linearly scaled from 0.5 to 8 K, with contour levels: -3, 3, 5, 10, 15, 20...\ntimes the rms of the map (0.5 K).\n\n\f– 37 –\n\nFig. 4.- Lightcurve for GM Cep, including the data in Table 4. The left pannel shows\nthe complete lightcurve. The right pannel shows a zoom on the most recent data. The\ndatapoints have been connected for better visualization, although due to the undersampling,\nfurther magnitude oscillations probably occurred in between the measurements.\n\n\f– 38 –\n\nFig. 5.- Color evolution of GM Cep, compared to the 1, 10, and 100 Myr isochrones (from\nright to left, short-dashed, long-dashed and thin lines; Siess et al. 2000) and to the reddening\nvector (dashed-dotted line marked at intervals of AV =0.5 mag). The data from September\n2000 has been converted from the Cousins into the Johnson system (Fernie 1983). The\nindividual data points have been connected to show the direction of the variations. Typical\nerrors are smaller than the dots except for the September 2000 converted data, which has\nerrors up to ∼0.07 and ∼0.2 mags in RJ and in IJ , respectively. The isochrones have been\nreddened by the cluster average (AV =1.67 mag) following a standard reddening law (Cardelli\net al. 1989).\n\n\f– 39 –\n\nFig. 6.- Emission lines in GM Cep, from HIRES (solid line) and from Hectochelle (dotted\nline) spectra. The zero velocity position has been marked according to the HIRES radial\nvelocity CZ=-21.0±2.6 km/s.\n\n\f– 40 –\n\nFig. 7.- Emission lines in GM Cep observed with HIRES. The zero velocity position\nhas been marked according to the HIRES radial velocity CZ=-21.0±2.6 km/s. The Li I\nabsorption at 6708Å and the Paschen 13 H line at 8663Å have been marked by dotteddashed lines.\n\n\f– 41 –\n\nFig. 8.- Rotational velocity (Vsini) and radial velocity (CZ) of GM Cep versus wavelength,\nderived from the HIRES spectra (dots) and from Hectochelle data (crosses). The average\nVsini and CZ of the Tr 37 members are displayed as a solid line, together with the 1σ\ndeviations seen in the cluster (dashed lines). Whereas the radial velocity of GM Cep is\nconsistent with the Tr 37 members within the errors, the Vsini is much higher than any\ntypical CTTS or WTTS.\n\n\f– 42 –\n\nFig. 9.- SED data and disk models (D'Alessio et al. 2005) for GM Cep. The fitted data\npoints (see text) are represented by filled circles. Open circles mark the rest of data points not\nincluded in the fitting, and inverted triangles are upper limits. The dotted lines trace three\ndifferent hydrostatic equilibrium disk models for a star with luminosity 26 L⊙ , accretion rates\n10−7 -10−6 M⊙ /yr, and disk radii ranging from 50 to 600 AU. The short dashed line represent\nthe model that best fits the millimetre point, consisting of a disk with Ṁ∼10−6 M⊙ /yr and\n30 AU outer radius, and the bold line is the 30 AU model plus a black body with T=150\nK to simulate an excess flaring or envelope in order to reproduce the high mid-IR fluxes.\nThe long dashed line is the photospheric emission for a K0 star (Kenyon & Hartmann 1995).\nThe data is de-reddened for AV =2.5 mag. The unability to fit simultaneously the mid-IR\n(24 and 70μm) and the millimeter point with the standard equilibrium models suggests that\nthe disk is unstable and has probably suffered considerable grain growth.\n\n\f– 43 –\n\nFig. 10.- Simulations of different binary cases as they would be imaged with AstraLux,\nfor different separations and magnitude differences. From top to bottom, and left to right:\nseparation 100 mas (90 AU), ∆(mag)=1.20 mag; separation 150 mas (135 AU),∆(mag)=1.92\nmag; separation 200 mas (180 AU), ∆mag)=2.20 mag; separation 250 mas (225 AU),\n∆(mag)=2.50 mag; separation 300 mas (270 AU), ∆(mag)=3.00 mag; separation 400 mas\n(360 AU),∆(mag)=3.50 mag. All images are displayed on a linear scale up to saturation.\nThe field of view is 3\"×3\".\n\n\f"}