{"id": "http://arxiv.org/abs/0706.4064v3", "guidislink": true, "updated": "2007-11-20T16:10:30Z", "updated_parsed": [2007, 11, 20, 16, 10, 30, 1, 324, 0], "published": "2007-06-27T16:34:50Z", "published_parsed": [2007, 6, 27, 16, 34, 50, 2, 178, 0], "title": "Cryptogauge symmetry and cryptoghosts for crypto-Hermitian Hamiltonians", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0706.2306%2C0706.3004%2C0706.1666%2C0706.1622%2C0706.3768%2C0706.2939%2C0706.1877%2C0706.3612%2C0706.0834%2C0706.1928%2C0706.3795%2C0706.3102%2C0706.1737%2C0706.4380%2C0706.1780%2C0706.1392%2C0706.1975%2C0706.3784%2C0706.1719%2C0706.4035%2C0706.1068%2C0706.2753%2C0706.1053%2C0706.4151%2C0706.3291%2C0706.1117%2C0706.0556%2C0706.4206%2C0706.0153%2C0706.1344%2C0706.0555%2C0706.3344%2C0706.3343%2C0706.3553%2C0706.1701%2C0706.0865%2C0706.3466%2C0706.2987%2C0706.1240%2C0706.1820%2C0706.3610%2C0706.3282%2C0706.3009%2C0706.2560%2C0706.3700%2C0706.3012%2C0706.4339%2C0706.0799%2C0706.3582%2C0706.4020%2C0706.2384%2C0706.4039%2C0706.1620%2C0706.1905%2C0706.3094%2C0706.2881%2C0706.2501%2C0706.3501%2C0706.3902%2C0706.1847%2C0706.4065%2C0706.2085%2C0706.2994%2C0706.0950%2C0706.1388%2C0706.1511%2C0706.3370%2C0706.1337%2C0706.3995%2C0706.2057%2C0706.2107%2C0706.3915%2C0706.4265%2C0706.0854%2C0706.0160%2C0706.3655%2C0706.1857%2C0706.3760%2C0706.1591%2C0706.0863%2C0706.1104%2C0706.1665%2C0706.1078%2C0706.0663%2C0706.4064%2C0706.2381%2C0706.1030%2C0706.2626%2C0706.0413%2C0706.2268%2C0706.4224%2C0706.2863%2C0706.2338%2C0706.2354%2C0706.2713%2C0706.1546%2C0706.2319%2C0706.3314%2C0706.2669%2C0706.0862%2C0706.1502&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Cryptogauge symmetry and cryptoghosts for crypto-Hermitian Hamiltonians"}, "summary": "We discuss the Hamiltonian H = p^2/2 - (ix)^{2n+1} and the mixed Hamiltonian\nH = (p^2 + x^2)/2 - g(ix)^{2n+1}, which are crypto-Hermitian in a sense that,\nin spite of apparent complexity of the potential, a quantum spectral problem\ncan be formulated such that the spectrum is real. We note first that the\ncorresponding classical Hamiltonian system can be treated as a gauge system,\nwith imaginary part of the Hamiltonian playing the role of the first class\nconstraint. We observe then that, on the basis of this classical problem,\nseveral different nontrivial quantum problems can be formulated. We formulate\nand solve some such problems. We find in particular that the spectrum of the\nmixed Hamiltonian undergoes in certain cases rather amazing transformation when\nthe coupling g is sent to zero. There is an infinite set of phase transitions\nin g when a couple of eigenstates of H coalesce and disappear from the\nspectrum. When quantization is done in the most natural way such that gauge\nconstraints are imposed on quantum states, the spectrum should not be positive\ndefinite, but must involve the negative energy states (ghosts). We speculate\nthat, in spite of the appearance of ghost states, unitarity might still be\npreserved.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0706.2306%2C0706.3004%2C0706.1666%2C0706.1622%2C0706.3768%2C0706.2939%2C0706.1877%2C0706.3612%2C0706.0834%2C0706.1928%2C0706.3795%2C0706.3102%2C0706.1737%2C0706.4380%2C0706.1780%2C0706.1392%2C0706.1975%2C0706.3784%2C0706.1719%2C0706.4035%2C0706.1068%2C0706.2753%2C0706.1053%2C0706.4151%2C0706.3291%2C0706.1117%2C0706.0556%2C0706.4206%2C0706.0153%2C0706.1344%2C0706.0555%2C0706.3344%2C0706.3343%2C0706.3553%2C0706.1701%2C0706.0865%2C0706.3466%2C0706.2987%2C0706.1240%2C0706.1820%2C0706.3610%2C0706.3282%2C0706.3009%2C0706.2560%2C0706.3700%2C0706.3012%2C0706.4339%2C0706.0799%2C0706.3582%2C0706.4020%2C0706.2384%2C0706.4039%2C0706.1620%2C0706.1905%2C0706.3094%2C0706.2881%2C0706.2501%2C0706.3501%2C0706.3902%2C0706.1847%2C0706.4065%2C0706.2085%2C0706.2994%2C0706.0950%2C0706.1388%2C0706.1511%2C0706.3370%2C0706.1337%2C0706.3995%2C0706.2057%2C0706.2107%2C0706.3915%2C0706.4265%2C0706.0854%2C0706.0160%2C0706.3655%2C0706.1857%2C0706.3760%2C0706.1591%2C0706.0863%2C0706.1104%2C0706.1665%2C0706.1078%2C0706.0663%2C0706.4064%2C0706.2381%2C0706.1030%2C0706.2626%2C0706.0413%2C0706.2268%2C0706.4224%2C0706.2863%2C0706.2338%2C0706.2354%2C0706.2713%2C0706.1546%2C0706.2319%2C0706.3314%2C0706.2669%2C0706.0862%2C0706.1502&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We discuss the Hamiltonian H = p^2/2 - (ix)^{2n+1} and the mixed Hamiltonian\nH = (p^2 + x^2)/2 - g(ix)^{2n+1}, which are crypto-Hermitian in a sense that,\nin spite of apparent complexity of the potential, a quantum spectral problem\ncan be formulated such that the spectrum is real. We note first that the\ncorresponding classical Hamiltonian system can be treated as a gauge system,\nwith imaginary part of the Hamiltonian playing the role of the first class\nconstraint. We observe then that, on the basis of this classical problem,\nseveral different nontrivial quantum problems can be formulated. We formulate\nand solve some such problems. We find in particular that the spectrum of the\nmixed Hamiltonian undergoes in certain cases rather amazing transformation when\nthe coupling g is sent to zero. There is an infinite set of phase transitions\nin g when a couple of eigenstates of H coalesce and disappear from the\nspectrum. When quantization is done in the most natural way such that gauge\nconstraints are imposed on quantum states, the spectrum should not be positive\ndefinite, but must involve the negative energy states (ghosts). We speculate\nthat, in spite of the appearance of ghost states, unitarity might still be\npreserved."}, "authors": ["A. V. Smilga"], "author_detail": {"name": "A. V. Smilga"}, "author": "A. V. Smilga", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1088/1751-8113/41/24/244026", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0706.4064v3", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0706.4064v3", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "24 pages, 12 figures. Final version to be published in J.Phys. A", "arxiv_primary_category": {"term": "quant-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "quant-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "hep-th", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "math-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "math.MP", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0706.4064v3", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0706.4064v3", "journal_reference": "J.Phys.A41:244026,2008", "doi": "10.1088/1751-8113/41/24/244026", "fulltext": "Cryptogauge symmetry and cryptoghosts for crypto-Hermitian\nHamiltonians\nA.V. Smilga 1 ,\n\narXiv:0706.4064v3 [quant-ph] 20 Nov 2007\n\n1\n\nSUBATECH, Université de Nantes, 4 rue Alfred Kastler, BP 20722, Nantes 44307,\nFrance ∗\nsmilga@subatech.in2p3.fr\n\nAbstract\nWe discuss the Hamiltonian H = p2 /2 − (ix)2n+1 and the mixed Hamiltonian\nHmixed = (p2 +x2 )/2−g(ix)2n+1 . The Hamiltonians H and in some cases also Hmixed\nare crypto-Hermitian in a sense that, in spite of their apparent non-Hermiticity, a\nquantum spectral problem can be formulated such that the spectrum is real. We\nnote that the corresponding classical Hamiltonian system can be treated as a gauge\nsystem, with imaginary part of the Hamiltonian playing the role of the first class\nconstraint.\nSeveral different nontrivial quantum problems can be formulated on the basis of\nthis classical problem. We formulate and solve some such problems. We consider\nthen the mixed Hamiltonian and find that its spectrum undergoes in certain cases\na rather amazing transformation when the coupling g is sent to zero. There is an\n(j)\ninfinite set of exceptional points g⋆ where a couple of eigenstates of H coalesce and\ntheir eigenvalues cease to be real.\nWhen quantization is done in the most natural way such that gauge constraints\nare imposed on quantum states, the spectrum should not be positive definite, but\nmust involve the negative energy states ( ghosts). We speculate that, in spite of the\nappearance of ghost states, unitarity might still be preserved.\n\n1\n\nIntroduction\n\nFor certain apparently complex Hamiltonians, the spectral problem can be formulated\nsuch that the spectrum has a perfectly \"normal\" form with bounded from below real\nenergies. Such Hamiltonians can thus be called \"crypto–Hermitian\" or \"cryptoreal\".\nApparently, such crypto-Hermitian Hamiltonians were first discussed in association with\nReggeon field theory back in 1976 [1]. Somewhat later, crypto-Hermitian Hamiltonians\nwere considered by mathematicians in a more habitual Schrödinger setup. Gasymov\nobserved that the Schrödinger operator with certain complex periodic potentials, like\nV (x) = eix , has a real spectrum [2]. In Ref. [3], it was proved that the spectrum of the\nHamiltonian with complex potential V (x) = x2 + iβx3 is real for small enough β. General\nproperties of crypto-Hermitian (or quasi-Hermitian as the authors called this property)\noperators were studied in Ref. [4].\n∗\n\nOn leave of absence from ITEP, Moscow, Russia.\n\n1\n\n\fBefore going further, a comment on the terminology is in order. At the moment,\nthere is no unique generally adopted name for Hamiltonians of this kind. Besides quasiHermitian, the term pseudo-Hermitian is also often used. A Hamiltonian is usually called\npseudo-Hermitian if it satisfies the property\nH † = ηHη −1\n\n(1)\n\nwith some Hermitian invertible η. However, this does not guarantee yet that the spectrum\nis real. To this end, the operator η should be representable as [5]\nη = O†O\n\n(2)\n\nor, equivalently, the norm hψ |ηψi should be positive definite for any nonzero Hilbert\nspace vector ψ [6], [4]. Anyway, the semantics of the words quasi-Hermitian or pseudoHermitian is \"not quite Hermitian\" with a flavour of inferiority, \"second-rankness\" compared to Hermitian. For example, pions are pseudo-Goldstone particles meaning that\nthey are not Goldstone particles. But we want to emphasize that, if the spectrum of the\nHamiltonian is real, the latter almost always 1 is in fact Hermitian when looking at it\nthrough proper glasses, i.e. when defining the norm in Hilbert space in a proper way. It\nwas proved in [5] that the Hamiltonian with real non-degenerate spectrum must satisfy\nthe properties (1, 2). Then η defines the norm with respect to which the Hamiltonian H\nis Hermitian, while the Hamiltonian H̃ = OHO −1 is manifestly Hermitian with respect to\nthe standard norm. In other words, the characterization \"crypto-Hermitian\" 2 (Hermitian\nin disguise) reflects more adequately, in our opinion, the essence of the phenomenon, and\nwe will stick to it in this paper. 3\nThe modern history begins with the beautiful paper [9] (see also the recent review [10]),\nwhere this property was observed for a wide class of P T -symmetric polynomial potentials,\nlike V (x) = ix3 . 4 . It was found to be discrete and real.\nSince then, many crypto-Hermitian Hamiltonians have been discovered. We can mention the paper [11] where the spectrum of the Hamiltonian with hyperbolic and generalized\nhyperbolic complex PT-symmetric potentials was shown to be real in many cases. The\nsimplest example of such cryptoreal hyperbolic problem is the problem with the potential\nV (x) = −\n\nV1\niV2 sinh x\n+\n2\ncosh x\ncosh2 x\n\n(3)\n\nwith V1 > 0 and |V2 | < V1 + 1/4.\nIn recent [12], it was shown that apparently complex Hamiltonians obtained after so\ncalled nonanticommutative deformations [13] of certain supersymmetric quantum-mechanical\nand field theory models are in fact crypto-Hermitian and enjoy a real spectrum.\n1\n\n\"Almost\" means away from exceptional points [7] where the Hamiltonian involves Jordan blocks. We\nwill discuss this issue later.\n2\nIt was used first in Ref. [8]\n3\nLet us repeat for clarity: our crypto-Hermiticity means exactly the same as quasi-Hermiticity of\nRef. [4] (a quasi-Hermitian Hamiltonian was defined there as the Hamiltonian that is Hermitian with\nrespect to a generalized positive definite norm hψ|ηψi, η † = η), the same as η-Hermiticity as defined in\nRef. [6] and the same as pseudo-Hermiticity (1) with additional requirement (2).\n4\nA P T -symmetric potential V (x) enjoys the property V ∗ (−x) = V (x).\n\n2\n\n\fThe problems with the potential V (x) = eix or the potential (3) admit explicit analytic\nsolutions. In [9], reality of the spectrum for the potentials V (x) = x2 (ix)ǫ , ǫ ≥ 0, was\ndemonstrated explicitly by numerical solution of the corresponding Schrödinger equations\nsupplemented by semiclassical analysis. Later, a rigorous proof for the discreteness and\nreality of the spectrum in this problem was constructed [14]. In Ref. [15], it was shown\nthat the Hamiltonians like\nH =\n\np2 + x2\n− g(ix)2n+1\n2\n\n(4)\n\ncan be represented for small g in the form (1, 2). In other words, they can be obtained by\na non-unitary transformation, H = e−R H̃eR , out of a manifestly Hermitian Hamiltonian\nH̃. The Hamiltonian H̃ and the operator R ≡ ln O are calculated perturbatively as an\ninfinite series in the coupling constant g.\nIn this paper we suggest an approach capitalizing on a certain hidden gauge symmetry characteristic of crypto-Hermitian systems. The origin of this symmetry is very\nsimple [16]- [18]. Consider a system with one dynamical degree of freedom. The classical\nHamiltonian is a function H(p, x), which may be real or complex. Let us complexify the\nphase space variables,\nx → z = x + iy,\np → π = p − iq ,\nH(p, x) → H(π, z) = H(p, q; x, y) + iG(p, q; x, y) ,\n\n(5)\n\nwhere H and G are real functions satisfying the Cauchy-Riemann relations\n∂H ∂G\n∂H\n∂G\n∂H\n∂G\n∂H ∂G\n+\n=\n+\n=\n−\n=\n−\n=0.\n∂p\n∂q\n∂y\n∂x\n∂q\n∂p\n∂x\n∂y\n\n(6)\n\nTwo important properties follow :\n• The function H(p, q; x, y) can be treated as the Hamiltonian of a new system with\ndouble set of degrees of freedom. Indeed, the real and imaginary parts of the complexified equations of motion for the original system,\nπ̇ = −∂H/∂z,\n\nż = ∂H/∂π ,\n\ncoincide in virtue of (6) with the Hamilton equations of motion derived from H(p, q; x, y).\n• The Poisson bracket\n{H, G}P.B. =\n\n∂H ∂G ∂H ∂G ∂H ∂G ∂H ∂G\n+\n−\n−\n∂x ∂p\n∂y ∂q\n∂p ∂x\n∂q ∂y\n\nvanishes. This means that G is an integral of motion for the system described by\nH. The space of all classical trajectories is thus divided into classes characterized\nby a definite value of G. The class with G = 0 represents a particular interest. The\ncondition G = 0 can be interpreted as a first class constraint and the dynamical\nsystem with the Hamiltonian H supplemented by the constraint G = 0 is a gauge\nsystem.\n3\n\n\fThe plan of the paper is the following. In the next section, we consider from this angle\nthe simplest possible problem - the complexified oscillator. We note that this classical\nproblem has at least three different quantum counterparts:\n1. One can impose the analyticity constraint on the wave function, ∂ψ/∂ z̄ = 0 and\nsolve the Schrödinger equation in the vicinity of the real axis. In this case, we\nreproduce the standard oscillator spectrum En = 1/2 + n. The same spectral\nproblem is obtained when the gauge constraint is resolved at the classical level with\nthe gauge choice y = 0.\n2. One can impose the analyticity constraint and solve the Schrödinger equation in the\nvicinity of the imaginary axis. In this case, the spectrum En = −1/2 − n involves\nnegative energies and is bounded from above rather from below. The same spectral\nproblem is obtained when the gauge constraint is resolved at the classical level with\nthe gauge choice x = 0.\n3. Finally, one may not require analyticity, but rather impose, following Dirac, the\ngauge constraint ĜΨ = 0 on quantum states. In this case, the spectrum is En = n,\nwhere n can be positive, zero, or negative. Still, the quantum problem is well\ndefined, and the evolution operator is unitary.\nIn Sect. 3, we consider the classical dynamics of the Hamiltonian\nH=\n\nπ2\n− (iz)2n+1 .\n2\n\n(7)\n\nWe find different sets of trajectories with positive, and also with negative energies. Sect.\n4 is devoted to the quantum dynamics of (7) and of the mixed Hamiltonian (4), with\nthe analyticity constraint imposed on wave functions. The complex plane of z is divided\nthen into several regions. In some of them, the spectrum is discrete, in some others continuous or empty. For n = 1, we reproduce the results of Ref. [9]. For n > 1, one can\nformulate n different spectral problems with discrete positive definite spectrum formulated\nin the different regions of the complex plane. 5 When g → 0, the spectrum of the mixed\nHamiltonian approaches the oscillator spectrum, but for the problems formulated in the\nsectors not comprising real axis, the transformation pattern is very nontrivial involving\nan infinite set of \"phase transitions\" in the coupling. At each of such \"phase transition\"\n(j)\n(or exceptional [7] point g∗ ), a pair of eigenstates of the mixed Hamiltonian coalesce\nsuch that at this very point the Hamiltonian involves a nondiagonalizable Jordan block.\n(j)\nBeyond this point (g < g∗ ), a pair of complex conjugate eigenvalues should appear. In\nother words, the Hamiltonian (4) is cryptoreal in this situation only for large enough\ng (and, obviously, it is Hermitian for g = 0). The last section is devoted as usual to\ndiscussions. In particular, we discuss the Dirac spectral problem for the Hamiltonian (7)\nwhen the gauge constraint is imposed on the wave functions as an operator condition.\nThis problem has no analytic solution and is difficult to resolve numerically. Still, based\n5\n\nThat was observed in Ref. [19]. The proof of reality and discreteness of the spectrum for all symmetric\n(see below) spectral problems was given in Ref. [20].\n\n4\n\n\fon semiclassical reasoning, we argue that, similar to what we had in the oscillator case,\nthe spectrum there might be discrete and unbounded both from below and above. We also\npoint out the similarity of this problem to some other previously analyzed by us systems,\nwhich are described by higher derivative Lagrangians and involve ghosts. We speculate\nthat, in spite of their presence, unitarity is not violated.\n\n2\n\nComplex oscillator.\n\nConsider the complex Hamiltonian\nH(π, z) =\n\nπ2 + z2\n.\n2\n\n(8)\n\nIts real and imaginary parts are\nH =\n\np2 + x2 q 2 + y 2\n−\n2\n2\n\n(9)\n\nand\nG = −pq + xy .\n\n(10)\n\nConsider the classical dynamics of H. The classical trajectories are\nx = A sin(t + φ1 ), p = A cos(t + φ1 ),\n\ny = B sin(t + φ2 ),\n\nq = −B cos(t + φ2 ) . (11)\n\nGenerically, they have complex energies. If we require the energies to be real, i.e. impose\nthe constraint G = 0, the relation\nAB cos(φ1 − φ2 ) = 0\n\n(12)\n\nfollows. For each value of the energy, positive or negative, there is a set of trajectories\n(cofocal ellipses) with the same period (see Fig. 1).\nIn the case under consideration, the period is the same for all energies, but this is the\nspecifics of oscillator. The fact that the period is the same for all trajectories of a given\nenergy has, however, a general nature. In fact, it is a consequence of the gauge symmetry\nof the problem.\nThe latter is simply the symmetry generated by the constraint G. Infinitesimally [18],\nδG x = −α{G, x}P.B. = −αq,\nδG p = −α{G, p}P.B. = −αy,\n\nδG y =\nδG q =\n\n−α{G, y}P.B. − αp,\n−α{G, q}P.B. = −αx .\n\n(13)\n\nThis is a phase space symmetry. To represent it as a conventional gauge symmetry acting\nonly on the coordinates, one should introduce the Lagrange multiplier λ(t) and write the\ncanonical Lagrangian as\nL = pẋ + q ẏ − H − λG ,\n5\n\n(14)\n\n\fy\n\nx\n\nFigure 1: Family of oscillator trajectories with the same positive energy. For negative\nenergies, the picture is rotated by π/2.\nExpressing out the momenta,\np =\n\nẋ − λẏ\n,\n1 + λ2\n\nq = −\n\nẏ + λẋ\n,\n1 + λ2\n\n(15)\n\nwe obtain\nẋ2 − ẏ 2 − 2λẋẏ y 2 − x2\n+\n− λxy .\nL=\n2(1 + λ2 )\n2\n\n(16)\n\nThe gauge transformations amount to shifting the Lagrange multiplier λ by (a derivative\nof) an arbitrary function of time α̇(t), supplemented by the transformations of dynamic\nvariables x, y generated by the constraint G.\nα(ẏ + λẋ)\n,\n1 + λ2\nα(ẋ − λẏ)\nδgauge y = −αp = −\n,\n1 + λ2\nδgauge λ = α̇ .\nδgauge x = −αq =\n\n(17)\n\nIndeed, one can explicitly verify that the Lagrangian (16) is invariant, up to a total\nderivative, with respect to the transformations (17).\nThe transformations δx and δy in Eqs.(13, 17) have a clear meaning. Any Hamiltonian\nsystem is invariant with respect to time translations t → t − a that transform a solution\n6\n\n\fz(t) → z(t − a). Their generator is the Hamiltonian H. In our case, however, besides\nH ≡ Re(H), we have another integral of motion G ≡ Im(H). It generates a shift of time\nby an imaginary amount, t → t − iα and transforms z(t) → z(t − iα). Infinitesimally, this\ncoincides with Eq.(17) (with partial gauge fixing λ = 0).\nThe shift z(t) → z(t − a) is the shift along the trajectory, leaving it unchanged. But\nthe shift z(t) → z(t − iα) transforms one trajectory into another. It is this shift which\nrelates different ellipses in Fig. 1 [it is straightforward to check by substituting for z(t)\nthe exact analytic solution (11) with φ1 −φ2 = π/2]. Such families of closed trajectories of\na given energy and the same period (obviously, if z(t) is periodic, z(t − iα) is also periodic\nwith the same real period) exist also for more complicated cases. We will discuss it in the\nnext section.\nLet us go over to quantum dynamics. There are two basic ways to quantize gauge\nsystems 6 : (i) by explicitly resolving the constraints and quantizing the Hamiltonian with\na reduced number of degrees of freedom; (ii) by not resolving the constraints classically,\nbut rather solving the system\nĤΨ = EΨ,\n\nĜΨ = 0 .\n\n(18)\n\nWe will see that, in the case under consideration, these two approaches are not quite\nequivalent, in contrast to what is usually assumed !\n• Let us first try to resolve the constraint G = 0 classically. This can be done by\nfixing the gauge, i.e. by imposing the additional constraint χ(p, q; x, y) = 0, where\n{G, χ}P.B. 6= 0 (so that the primary constraint G = 0 and the gauge fixing constraint\nχ = 0 are independent). Resolving the system G = χ = 0, we are left with a reduced\nnumber of dynamical variables. Generically, their number is equal to the number\nof initial degrees of freedom minus the number of primary constraints. In our case,\nNreduced = 2 − 1 = 1. One can, for example, choose χ = y = 0. The reduced\nHamiltonian system will in this case be just H ∗ = (p2 + x2 )/2 with the spectrum\nEn = 1/2 + n. On the other hand, if choosing the gauge χ = x = 0, the reduced\nHamiltonian is H ∗ = −(q 2 + y 2 )/2 with a different spectrum En = −1/2 − n. In\nother words, there are two essentially different gauge choices leading to different\nreduced Hamiltonians. One can obtain either oscillator with positive energies, or\noscillator with negative energies, but not both.\nTo understand what happened, look again at the trajectories in Fig. 1. They\nrepresent, as we have seen, gauge copies of one another. The gauge fixing procedure\nshould pick out one of these copies, while getting rid of all others. And, indeed,\nthe condition y = 0 does this job by pinpointing the trajectory going along the real\naxis. However, none of these trajectories are compatible with the condition x = 0.\nOn the other hand, for the family of the trajectories with negative energies, one can\nimpose x = 0 (and pinpoint the trajectory going along the imaginary axis), but not\n6\n\nThis problem was first posed and resolved by Dirac and is treated pedagogically in many books. See\ne.g. Ref. [21]\n\n7\n\n\fy = 0.\n\n7\n\nTwo spectral problems with positive and negative energies can alternatively be\ndefined using the approach of Ref. [9]. To this end, one should require that the wave\nfunction represents an analytic function of z = x+iy. The spectrum En = 1/2+n is\nthen realized by the standard oscillator functions continued analytically to complex\narguments. For example, the wave function of the ground state is exp(−z 2 /2).\nIt falls down exponentially on the real axis and also on the lines z = us, s ∈\n(−∞, ∞), |Arg(u)| < π/4. The spectrum En = −1/2−n is realized by the functions\nlike exp(z 2 /2) that fall down exponentially along the imaginary axis and in the sector\n|Arg(z)| > π/4 (see Fig. 2).\n111111111111111111\n000000000000000000\n000000000000000000\n111111111111111111\n000000000000000000\n111111111111111111\n000000000000000000\n111111111111111111\n000000000000000000\n111111111111111111\n000000000000000000\n111111111111111111\n000000000000000000\n111111111111111111\n000000000000000000\n111111111111111111\n000000000000000000\n111111111111111111\n000000000000000000\n111111111111111111\n000000000000000000\n111111111111111111\n000000000000000000\n111111111111111111\n000000000000000000\n111111111111111111\n000000000000000000\n111111111111111111\n000000000000000000\n111111111111111111\n000000000000000000\n111111111111111111\n000000000000000000\n111111111111111111\n000000000000000000\n111111111111111111\n000000000000000000\n111111111111111111\n000000000000000000\n111111111111111111\n000000000000000000\n111111111111111111\n000000000000000000\n111111111111111111\n000000000000000000\n111111111111111111\n000000000000000000\n111111111111111111\n000000000000000000\n111111111111111111\n000000000000000000\n111111111111111111\n000000000000000000\n111111111111111111\n000000000000000000\n111111111111111111\n000000000000000000\n111111111111111111\n000000000000000000\n111111111111111111\n000000000000000000\n111111111111111111\n000000000000000000\n111111111111111111\n000000000000000000\n111111111111111111\n000000000000000000\n111111111111111111\n000000000000000000\n111111111111111111\n000000000000000000\n111111111111111111\n000000000000000000\n111111111111111111\n000000000000000000\n111111111111111111\n000000000000000000\n111111111111111111\n000000000000000000\n111111111111111111\n000000000000000000\n111111111111111111\n000000000000000000\n111111111111111111\n000000000000000000\n111111111111111111\n000000000000000000\n111111111111111111\n000000000000000000\n111111111111111111\n000000000000000000\n111111111111111111\n000000000000000000\n111111111111111111\n000000000000000000\n111111111111111111\n000000000000000000\n111111111111111111\n000000000000000000\n111111111111111111\n000000000000000000\n111111111111111111\n000000000000000000\n111111111111111111\n000000000000000000\n111111111111111111\n000000000000000000\n111111111111111111\n000000000000000000\n111111111111111111\n000000000000000000\n111111111111111111\n000000000000000000\n111111111111111111\n000000000000000000\n111111111111111111\n000000000000000000\n111111111111111111\n000000000000000000\n111111111111111111\n000000000000000000\n111111111111111111\n000000000000000000\n111111111111111111\n000000000000000000\n111111111111111111\n000000000000000000\n111111111111111111\n000000000000000000\n111111111111111111\n000000000000000000\n111111111111111111\n000000000000000000\n111111111111111111\n000000000000000000\n111111111111111111\n000000000000000000\n111111111111111111\n000000000000000000\n111111111111111111\n000000000000000000\n111111111111111111\n000000000000000000\n111111111111111111\n000000000000000000\n111111111111111111\n000000000000000000\n111111111111111111\n000000000000000000\n111111111111111111\n000000000000000000\n111111111111111111\n000000000000000000\n111111111111111111\n000000000000000000\n111111111111111111\n000000000000000000\n111111111111111111\n000000000000000000\n111111111111111111\n000000000000000000\n111111111111111111\n000000000000000000\n111111111111111111\n000000000000000000\n111111111111111111\n000000000000000000\n111111111111111111\n000000000000000000\n111111111111111111\n000000000000000000\n111111111111111111\n000000000000000000\n111111111111111111\n000000000000000000\n111111111111111111\n000000000000000000\n111111111111111111\n000000000000000000\n111111111111111111\n000000000000000000\n111111111111111111\n000000000000000000\n111111111111111111\n000000000000000000\n111111111111111111\n000000000000000000\n111111111111111111\n000000000000000000\n111111111111111111\n000000000000000000\n111111111111111111\n000000000000000000\n111111111111111111\n000000000000000000\n111111111111111111\n000000000000000000\n111111111111111111\n000000000000000000\n111111111111111111\n000000000000000000\n111111111111111111\n000000000000000000\n111111111111111111\n000000000000000000\n111111111111111111\n000000000000000000\n111111111111111111\n000000000000000000\n111111111111111111\n000000000000000000\n111111111111111111\n000000000000000000\n111111111111111111\n000000000000000000\n111111111111111111\n000000000000000000\n111111111111111111\n000000000000000000\n111111111111111111\n000000000000000000\n111111111111111111\n000000000000000000\n111111111111111111\n000000000000000000\n111111111111111111\n000000000000000000\n111111111111111111\n000000000000000000\n111111111111111111\n000000000000000000\n111111111111111111\n000000000000000000\n111111111111111111\n000000000000000000\n111111111111111111\n000000000000000000\n111111111111111111\n000000000000000000\n111111111111111111\n000000000000000000\n111111111111111111\n000000000000000000\n111111111111111111\n000000000000000000\n111111111111111111\n000000000000000000\n111111111111111111\n000000000000000000\n111111111111111111\n000000000000000000\n111111111111111111\n000000000000000000\n111111111111111111\n000000000000000000\n111111111111111111\n000000000000000000\n111111111111111111\n000000000000000000\n111111111111111111\n\nz\n\nE<0\n\nE>0\n\nFigure 2: Sectors with positive and negative energies in the spectrum\nThe lines Arg(z) = ±π/4 are closely related with the Stokes lines of the oscillator\nSchrödinger equation. The Stokes lines are defined [22] as the lines that pass through\nturning points and satisfy the condition\n\u0012Z z\n\u0013\n\u0013 \u0012Z z\np\n2\nIm\n2(E − w )dw = 0 ,\n(19)\nπ(w)dw =\nz0\n\nz0\n\n( z0 is the position of the turning point). The asymptotes of Stokes lines at large\nvalues of |z| are the straight lines separating the sectors in Fig. 2. When crossing a\n7\n\nThe trajectories in Fig. 1 are related by gauge transformations with constant α. But one can easily\nprove that one cannot obtain a configuration with x(t) = 0 out of a configuration with y(t) = 0 by a\ngeneric gauge transformation (17). Indeed, the energy functional is positive definite when y(t) = 0 and\nnegative definite when x(t) = 0.\n\n8\n\n\fStokes line, the asymptotics of the solution to the differential equation changes its\nnature.\n• Another approach is to solve the system (18). Were the constraint ĜΨ = 0 not\nimposed, the spectrum would be Emn = n − m with the eigenfunctions |nmi =\n|nix |miy . It is infinitely degenerate at each level. The constraint G = 0 picks up\nonly one representative of the set of eigenstates of H with a given energy. For\nexample, the zero energy state annihilated by G is\nΨ0 =\n\n∞\nX\nk=0\n\n|2k, 2ki(−1)k\n\n(2k − 1)!!\n.\n(2k)!!\n\n(20)\n\n√\nAt large k, the coefficient is proportional to 1/ k, i.e. the normalization integral\nfor (20) diverges logarithmically.\nSimilarly, only one eigenstate is left at each energy level. The full spectrum is\ndiscrete,\nEn = n\n\n(21)\n\nwith positive, negative, or zero integer n. It is unbounded both from below and\nabove. This notwithstanding, the spectral problem is well defined and the evolution\noperator\nX\nK(x′ , x) =\nΨ∗n (x′ )Ψn (x)eint\n(22)\nn\n\nis unitary 8 .\nComparing the results we obtained under two quantization procedures, one can make\ntwo observations. First, the spectrum is shifted by 1/2. The ambiguity whether En = n\nor En = n + 1/2 has the same nature as the well-known ordering ambiguity - there are\nmany different quantum problems having the same classical limit. The second observation\nis that, on top of the ordering ambiguity, there is in this case also another ambiguity\nassociated with gauge choice. With any gauge choice, half of the spectrum involving\neither the states with negative or with positive energies is lost.\nA lesson that can be drawn from this simple toy model is that, for gauge systems,\nfixing the gauge classically and quantizing afterward may be dangerous. Certain essential\nfeatures of the spectral problem (18) may be lost.\n\nThe potential −(ix)2n+1. Classical dynamics.\n\n3\n\nHaving being equipped with necessary tools, we may proceed now with the analysis of\nthe Hamiltonians of interest written in Eqs.(4,7). We will concentrate mainly on the\nHamiltonian (7) without the oscillator term in the potential.\n8\n\nSee Ref. [23] for detailed discussion of this and related issues.\n\n9\n\n\fLet first n = 1. Consider the complex Hamiltonian\nH =\n\nπ2\n+ iz 3\n2\n\n(23)\n\nwith z = x + iy, π = p − iq. Its real and imaginary parts are\np2 − q 2\n+ y 3 − 3yx2 ,\n2\nG = −pq + x3 − 3xy 2 .\n\nH =\n\n(24)\n\ny\n-4\n\n-2\n\n2\n\n4\n\nx\n\n-1\n-2\n-3\n-4\n-5\n-6\n\nFigure 3: Family of trajectories with E = 64.\nConsider the dynamics of the system described by the Hamiltonian H and the constraint G. It can be treated as a gauge system. The equations of motion follow from the\nHamiltonian H + λG, where λ is the Lagrange multiplier. They have the form\nṗ = 6xy + 3λ(y 2 − x2 ),\n\nẋ = p − λq,\n\nq̇ = 3(x2 − y 2 ) + 6λxy, ẏ = −q − λp,\nG = −pq + x3 − 3xy 2 = 0 .\n\n(25)\n\nThe Lagrangian (14) is invariant up to a total derivative with respect to gauge transformations (17) with time-dependent parameter α(t). To find the classical solutions, we\nneed first to fix the gauge. A convenient partial gauge fixing corresponds to the condition\nλ(t) = 0, in which case the equations are reduced to\nṗ = 6xy, ẋ = p, q̇ = 3(x2 − y 2), ẏ = −q, G = 0 .\n\n(26)\n\nThe solutions to (26) belong to two classes: 1. Runaway trajectories, which reach\ninfinity at finite time. These are, for example, the trajectories with initial conditions\nx(0) = ẋ(0) = 0. They run away in the positive y directions. 2. Besides, there are\nfamilies of closed orbits related to each other by gauge transformations (17) with constant\nα. For positive energies, these families, depicted in Fig. 3, were found in Ref. [19]. This\nfamily has one distinguished member (one can call it a stem trajectory): the trajectory\n10\n\n\fwhich connects the turning points (the points where the monenta p, q vanish) with the\ncoordinates.\n√ 1/3\n3E\nE 1/3\n,\nx∗ = ±\n.\n(27)\ny∗ = −\n2\n2\n(there is also the turning point x = 0, y = E 1/3 , but the trajectories starting run away\nrather than coming back).\nNote that the families of trajectories with negative energies also exist (see Fig. 4).\nThey stem from the trajectories connecting the turning points\n√\n3(−E)1/3\n(−E)1/3\n,\nx∗∗ = ±\n.\n(28)\ny∗∗ =\n2\n2\ny\n2.5\n-10\n\n-5\n\n5\n\n10\n\nx\n\n-2.5\n-5\n-7.5\n-10\n-12.5\n-15\n\nFigure 4: Family of trajectories with E = −64.\nLet us calculate for future purposes the action on these trajectories. Using the fact\nthat the action for all orbits belonging to one family is the same, one can write\nZ z2 p\nI\nZ z2\nS = (pdx + qdy) = 2Re\nπdz = 2Re\n2(E − iz 3 )dz ,\n(29)\nz1\n\nz1\n\nwhere z1,2 are the turning points. For the trajectories of positive energies, the integral\ncan be easily done by deforming the contour such that it passes the origin 9 ,\nZ z∗ p\n√ Z 1√\n√\nΓ(4/3)\n3\n2(E − iz )dz = 4Re(z∗ ) 2E\n1 − s3 ds = 6πE 5/6\nS+ = 4Re\n. (30)\nΓ(11/6)\n0\n0\nTo calculate the action for negative energy orbits, one has to take into account the fact\nthat the turning points are at the same time the branching points of the integrand in\n(29). For positive energies, the corresponding cuts do not hinder the deformation of the\ncontour, but, for negative energies, they do. The cuts should be drawn such that the\noriginal path does not cross them. The deformed contour also should avoid crossing the\ncuts. The corresponding structure of the cuts, the original and deformed contour are\nshown in Fig.5.\n9\n\nThis result (in somewhat different normalization) was obtained in [19].\n\n11\n\n\fz\n\nO\n\nFigure 5: Analytic structure of πcl (z) for negative energies. Solid line - original contour,\ndashed line - deformed contour, thick solid lines - the cuts.\nIt is clear from the figure that the deformed contour involves four pieces: (i) from\nthe left turning point to the origin, (ii-iii) from the origin down the cut and up again,\n(iv) from the origin to the right turning point. A simple analysis shows that the contribution of the parts (i-iv) involves an extra factor sin(π/6) = 1/2 compared to the\ncontribution of the parts (ii-iii).\nAll together, the integral for S− involves an extra factor\n√\n[1+sin(π/6)]/ cos(π/6) = 3 compared to the integral (30) for S+ with the same absolute\nvalue of energy. In other words,\n√\nΓ(4/3)\nS− = 3 2π(−E)5/6\nΓ(11/6)\n\n(31)\n\nz\n\nFigure 6: Turning points, cuts and stem trajectories for the potential −iz 5 . Positive\nenergies.\n\n12\n\n\fConsider now the complex Hamiltonian 10\nπ2\n− iz 5\nH =\n2\nwith real and imaginary parts\np2 − q 2\n+ y 5 − 10y 3x2 + 5yx4 ,\nH=\n2\nG = −pq − x5 + 10y 2x3 − 5xy 4 → 0 .\n\n(32)\n\n(33)\n\nz\n\nFigure 7: The same for negative energies. The cuts are drawn not to interfere with the\npaths.\nAgain, there are runaway trajectories taking a finite time to reach infinity in the\npositive y direction. Besides, there are four families of closed orbits: two families with\npositive energies and two families with negative energies. The structure of the turning\npoints, associated cuts and the stem trajectories connecting the turning points is shown\nschematically in Figs. 6,7 for positive and negative energies, respectively. Let us find the\nclassical action at these trajectories. For positive energies,\nZ 1√\n√\nπ√\nπ Γ(6/5)\nup\nS+ = 4 cos\nE 7/10 ,\n2\n1 − s5 ds E 7/10 = 2 2π cos\n10\n10 Γ(17/10)\n0\nZ 1√\n√\n√\n3π\n3π Γ(6/5) 7/10\n2\n1 − s5 ds E 7/10 = 2 2π cos\nS+down = 4 cos\nE\n. (34)\n10\n10 Γ(17/10)\n0\nFor negative energies,\n\u0013\n\u0012\n√\nΓ(6/5)\nπ\n3π\nup\n+ sin\n(−E)7/10 ,\nS− = 2 2π 1 + 2 sin\n10\n10 Γ(17/10)\n\u0012\n\u0013\n√\n3π\nΓ(6/5)\ndown\nS−\n= 2 2π 1 + sin\n(−E)7/10 .\n(35)\n10 Γ(17/10)\n10\n\nThe sign of the potential corresponds to the convention (7) and to the conventions of [9, 19]. These\nconventions are convenient to make the physics of the systems (7) with different n more similar.\n\n13\n\n\fThe superscript \"up\" in Eq. (35) refers to the upper trajectory in Fig. 7 going between the\npoints e11iπ/10 and e−iπ/10 . The result for S−down is obtained in the same way as the result\n(31), with the factor 1 + sin(π/6) being replaced by 1 + sin(3π/10). When deforming the\ncontour for the upper trajectory, we find, in addition to the parts composing the deformed\ncontour of the lower trajectory and giving the factor 1 + sin(3π/10), also two extra pieces\nwith the contribution ∼ sin(3π/10) + sin(π/10). The origin of all these factors can be\nclearly seen, if deforming the contour and the cuts in the way shown in Fig. 8. All the\npieces (of nonzero length) connect the branching points to the center of the pentagon\nz = 0.\n\nz\n\nO\n\nFigure 8: The deformed upper contour wiggling around the deformed cuts.\nBy the same token, for the potential −(iz)2n+1 , there are 2n families of the trajectories:\nn families with positive energies and n families with negative energies.\nAs we have seen, the classical dynamics of the system with the potential −(iz)2n+1\nis similar in many respects to the complex oscillator dynamics: a distinct feature of\nboth systems are the families of closed orbits with positive and negative energies, the\nmembers of one family being interrelated by gauge transformations. There are also two\nimportant differences. First, the system −(iz)2n+1 involves besides closed orbits also\nsingular runaway trajectories. Second, for the complex oscillator, the stem trajectories\nfor the families of orbits could be conveniently obtained by fixing the gauge y = 0 or\nx = 0. But for the system −(iz)2n+1 , this is not true. To begin with, the stem trajectories\ndisplayed above are essentially complex. This observation is not yet sufficient, however,\nbecause it does not exclude a conceivable in principle possibility that the trajectories can\nbe put onto the real (or imaginary) axis by a complicated gauge transformation (17) with\nnontrivial α(t).\nLet us find out what happens if we do fix the gauge y = 0 for the system (24,25).\n\n14\n\n\fFrom G = 0, we deduce q = x3 /p and hence the Hamiltonian is reduced to\nH∗ =\n\nx6\np2\n− 2 .\n2\n2p\n\n(36)\n\nThe corresponding equations of motion\nẋ = p +\n\nx6\n,\np3\n\nṗ =\n\n3x5\np2\n\n(37)\n\nfollow from (25) with λ = −x3 /p2 . We see now that the reduced Hamiltonian (36)\nis neither positive nor negative definite and involves only runaway trajectories. Closed\norbits have disappeared ! This is another manifestation of the fact discussed in the\nprevious section that fixing the gauge at the classical level is not an innocent procedure\nand may lead to a loss of important dynamic features. For the complex oscillator with\nthe gauge choice y = 0, half of the orbits (the orbits with negative energies) were lost.\nFor the system −(iz)2n+1 , all closed orbits are lost and we are left only with runaway\nsolutions.\nLet us discuss the relationship of the Hamiltonian (36) to another Hamiltonian obtained from (23) by a non-unitary rotation technique in the spirit of [15]. Let us multiply\nthe potential by a coupling constant g, ix3 → igx3 , and find an operator R such that\nthe rotated Hamiltonian H̃ = eR (p2 /2 + igx3 )e−R be manifestly real. Then R can be\npresented as an infinite series over the coupling constant,\nR=−\n\ngx4\n+ O(g 3)\n4p\n\nand [24] (see also sect. V of Ref. [25])\nH̃ =\n\np2 3g 2 x6\n+\n+ O(g 4) .\n2\n2\n8p\n\n(38)\n\nWe see that the H ∗ and H̃ have similar structure, but the coefficients differ. This does\nnot represent a paradox because H̃, in contrast to H ∗ , involves the whole infinite series\nin g. Anyway, all the terms in this series are nonlocal, and one cannot obtain from this,\nsay, the spectrum of quantum Hamiltonian as a perturbative series in g. The nonunitary\nrotation techniques is better suited to the problems like (4), where all the terms in the\nperturbative series for H̃ are local.\nComing back to fixing the gauge with the condition y = 0, it does not work well also\nfor the mixed system (4), however small g is. The extra piece in H ∗ is still nonlocal and\nsingular at the turning point of the unperturbed oscillator trajectory where momentum\np vanishes. As a result, the trajectory does not turn there, but rather stumbles and runs\naway.\n\n4\n\nQuantum dynamics.\n\nLet us discuss now quantum dynamics of the Hamiltonians (23), (32). Consider Eq.(23)\nfirst. In Sect. 2, we outlined two regular ways to quantize gauge systems: (i) resolving the\n15\n\n\fconstraint(s) at the classical level and quantizing afterward, and (ii) solving the system\nof differential equations (18) with proper boundary conditions.\nTo resolve the constraints classically, one has to fix the gauge. Unfortunately, as we\nhave just seen, it is difficult to find a clever way to do it in our case. A natural gauge\nfixing leads to the problem involving only runaway trajectories. This means trouble and,\nindeed, for the highly nonlocal and not positive definite Hamiltonian (36), one cannot\nformulate a well-defined quantum problem with a unitary evolution operator.\nAnother approach is to solve the system (18). This is a nontrivial numerical problem.\nIndeed, one-dimensional spectral problems can be easily solved with Mathematica, but in\nthis case the problem is essentially two-dimensional, which is much trickier. What is even\nmore important, the operators H and G in (18) are not elliptic, as usual, but hyperbolic.\nIt is not thus evident that a reasonable solution to this problem exists... We will discuss\nthis question somewhat more in the last section, but, basically, we leave it for future\nstudies.\nThere is, however, a way to define a consistent spectral problem related to the Hamiltonian (23) [9]. Forget for a moment all what was said above about complexification and\nconsider the Schrödinger equation at the real axis,\n\u0015\n\u0014\n1 ∂\n3\n(39)\n+ ix Ψ = EΨ .\n−\n2 ∂x2\nwith the condition that the wave function falls down at x = ±∞. It is convenient to pose\nthe problem not on the whole line (−∞, ∞), but on the half-line (0, ∞). One can do it by\nexploiting the P T -symmetry of the potential (the property V (−x) = V ∗ (x)). It dictates\nthat for any solution Ψ(x) of Eq.(39), the function Ψ∗ (−x) is also the solution with the\nsame eigenvalue. The functions\nΨ± (x) = Ψ(x) ± Ψ∗ (−x)\n\n(40)\n\nwith the symmetry properties Ψ+ (−x) = Ψ∗+ (x) and Ψ− (−x) = −Ψ∗− (x) also satisfy this\nequation. We are hence allowed to consider the equations for P T -even function Ψ+ (x)\nand P T -odd function Ψ− (x) separately. In this case (in contrast, e.g. to the standard\noscillator problem), the equation for Ψ− (x) does not give anything new. Indeed, one can\nmake a P T -odd function out of a P T -even one by simply multiplying the latter by i. A\ngeneric solution to (39) is obtained by multiplying a P T -even solution by an arbitrary\ncomplex factor.\nThe condition Ψ(−x) = Ψ∗ (x) means that Ψ(0) is real while Ψ′ (0) is imaginary.\nBy turning computer on, everybody can be convinced that the equation (39) with the\nboundary conditions\n\u0012 ′ \u0013\nΨ (0)\nRe\n= 0, Ψ(∞) = 0\n(41)\nΨ(0)\nhas solutions at real positive discrete values of E. The remarkable fact is that these values\nare very close to semiclassical energies associated with the family of the closed orbits in\nFig. 3 obtained from the quantization condition\nS(Ek ) = π(2k + 1) ,\n16\n\n(42)\n\n\fwith the function S(E) being given by Eq.(30). When k → ∞, the spectral values\nextracted from Eqs.(39,41) and the semiclassical values extracted from Eqs.(30,42) rapidly\nconverge. The exact and semiclassical values for Ek for first few levels [9] are shown in\nTable 1.\nk\nk\nEexact\nk\nEsemicl\n\n0\n1\n2\n3\n0.763 2.711 4.989 7.465\n0.722 2.698 4.980 7.458\n\nTable 1. Exact and semiclassical spectra for the potential ix3 .\nOnce the solution is obtained, one need not to stay on the real axis. Actually, the\nsolution can be continued analytically to complex values of the argument z in the regions\nArg(z) +\n\nπ\nπ\n≤ ,\n10\n5\n\nArg(z) −\n\nπ\n11π\n≤ .\n10\n5\n\nIn other words, the spectral problem\n\u0014\n\u0015\n1 ∂\n3 3\n− 2 2 + is Φ Ψ = EΨ ,\n2Φ ∂s\n\u0013\n\u0012\n∂Ψ/∂s\n= 0, Ψ(∞) = 0 ,\nRe\nΦΨ\ns=0\n\n(43)\n\n(44)\n\nwith Φ = eiα , still has a solution when α lies within the interval (43), and the spectral\nvalues are exactly the same as for the problem (39,41). When\n− 7π/10 < α < −3π/10 ,\n\n(45)\n\nthe spectrum is continuous: any positive or negative energy is acceptable. This is especially clearly seen for α = −π/2 (meaning Φ = −i). The problem (44) is then reduced\nto\n\u0014\n\u0015\n1 ∂\n3\n−\n+ s Ψ = −EΨ\n2 ∂s2\nΨ(0) = 1,\nΨ(∞) = 0,\nIm [Ψ′ (0)] = 0 .\n(46)\nThe real part of Ψ′ (0) is not fixed, however, and tuning this parameter, one can obtain\nthe solution dying at infinity at any energy. 11 A numerical analysis shows that it is true\nin the whole interval (45).\nOn the other hand, for π/10 < α < 9π/10 the problem (44) has no solution whatsoever:\nthe spectrum is empty. 12 This is all illustrated in Fig. 9.\n11\n\nBy modifying the spectral problem by, for example, imposing the conditions Ψ(0) = Ψ(∞) = 0\ninstead of (41), one can force the spectrum to be discrete and negative definite. But the condition\nΨ(0) = 0 is artificial and has no physical motivation. In particular, the discrete negative definite spectrum\nthus obtained has nothing to do with the semiclassical spectrum (47).\n12\nIf lifting the requirement that the wave function dies away at infinity, the spectrum would again\nbecome continuous.\n\n17\n\n\fz\n1111111111111111111111\n0000000000000000000000\n000000000000000000000\n111111111111111111111\n0000000000000000000000\n1111111111111111111111\n000000000000000000000\n111111111111111111111\n0000000000000000000000\n1111111111111111111111\n000000000000000000000\n111111111111111111111\n0000000000000000000000\n1111111111111111111111\n000000000000000000000\n111111111111111111111\n0000000000000000000000\n1111111111111111111111\n000000000000000000000\n111111111111111111111\n0000000000000000000000\n1111111111111111111111\n000000000000000000000\n111111111111111111111\n0000000000000000000000\n1111111111111111111111\n000000000000000000000\n111111111111111111111\n0000000000000000000000\n1111111111111111111111\n000000000000000000000\n111111111111111111111\n0000000000000000000000\n1111111111111111111111\n000000000000000000000\n111111111111111111111\n0000000000000000000000\n1111111111111111111111\n000000000000000000000\n111111111111111111111\n0000000000000000000000\n1111111111111111111111\n000000000000000000000\n111111111111111111111\n0000000000000000000000\n1111111111111111111111\n000000000000000000000\n111111111111111111111\n0000000000000000000000\n1111111111111111111111\n000000000000000000000\n111111111111111111111\n0000000000000000000000\n1111111111111111111111\n000000000000000000000\n111111111111111111111\n0000000000000000000000\n1111111111111111111111\n000000000000000000000\n111111111111111111111\n0000000000000000000000\n1111111111111111111111\n000000000000000000000\n111111111111111111111\n0000000000000000000000\n1111111111111111111111\n000000000000000000000\n111111111111111111111\n0000000000000000000000\n1111111111111111111111\n000000000000000000000\n111111111111111111111\n0000000000000000000000\n1111111111111111111111\n000000000000000000000\n111111111111111111111\n0000000000000000000000\n1111111111111111111111\n000000000000000000000\n111111111111111111111\n0000000000000000000000\n1111111111111111111111\n000000000000000000000\n111111111111111111111\n0000000000000000000000\n1111111111111111111111\n000000000000000000000\n111111111111111111111\n0000000000000000000000\n1111111111111111111111\n000000000000000000000\n111111111111111111111\n0000000000000000000000\n1111111111111111111111\n000000000000000000000\n111111111111111111111\n0000000000000000000000\n1111111111111111111111\n000000000000000000000\n111111111111111111111\n0000000000000000000000\n1111111111111111111111\n000000000000000000000\n111111111111111111111\n0000000000000000000000\n1111111111111111111111\n000000000000000000000\n111111111111111111111\n0000000000000000000000\n1111111111111111111111\n000000000000000000000\n111111111111111111111\n0000000000000000000000\n1111111111111111111111\n000000000000000000000\n111111111111111111111\n0000000000000000000000\n1111111111111111111111\n000000000000000000000\n111111111111111111111\n0000000000000000000000\n1111111111111111111111\n000000000000000000000\n111111111111111111111\n0000000000000000000000\n1111111111111111111111\n000000000000000000000\n111111111111111111111\n0000000000000000000000\n1111111111111111111111\n000000000000000000000\n111111111111111111111\n0000000000000000000000\n1111111111111111111111\n000000000000000000000\n111111111111111111111\n0000000000000000000000\n1111111111111111111111\n000000000000000000000\n111111111111111111111\n0000000000000000000000\n1111111111111111111111\n000000000000000000000\n111111111111111111111\n0000000000000000000000\n1111111111111111111111\n000000000000000000000\n111111111111111111111\n0000000000000000000000\n1111111111111111111111\n000000000000000000000\n111111111111111111111\n0000000000000000000000\n1111111111111111111111\n000000000000000000000\n111111111111111111111\n0000000000000000000000\n1111111111111111111111\n000000000000000000000\n111111111111111111111\n0000000000000000000000\n1111111111111111111111\n000000000000000000000\n111111111111111111111\n0000000000000000000000\n1111111111111111111111\n000000000000000000000\n111111111111111111111\n0000000000000000000000\n1111111111111111111111\n000000000000000000000\n111111111111111111111\n0000000000000000000000\n1111111111111111111111\n000000000000000000000\n111111111111111111111\n0000000000000000000000\n1111111111111111111111\n000000000000000000000\n111111111111111111111\n0000000000000000000000\n1111111111111111111111\n000000000000000000000\n111111111111111111111\n0000000000000000000000\n1111111111111111111111\n000000000000000000000\n111111111111111111111\n0000000000000000000000\n1111111111111111111111\n000000000000000000000\n111111111111111111111\n0000000000000000000000\n1111111111111111111111\n000000000000000000000\n111111111111111111111\n0000000000000000000000\n1111111111111111111111\n000000000000000000000\n111111111111111111111\n\nempty\n\nspectrum\n\nspectrum\n\ndiscrete\n\ncontinuous\nspectrum\n\nFigure 9: Spectral problem (44) in the complex z plane.\nThe system of the lines separating the sectors in Fig.9 form together with the positive\nimaginary axis the system of the asymptotes of the Stokes lines of the Schrödinger equation\nwith the potential iz 3 . Generically, for a polynomial potential of order n, such system\ninvolves n + 2 lines forming equal angles 2π/(n + 2) [22].\nThe spectral problem (44) corresponds to the family of the classical orbits in Fig.3\nwith positive energies. As we have seen (in Fig. 4), there are also orbits with negative\nenergies. Using the result (31), it is not difficult to find the corresponding semiclassical\nenergies,\nEk\n\n\u0014\n\n(2k + 1)Γ(11/6)\n= −\nΓ(4/3)\n\n\u00156/5 \u0010\n\nπ \u00113/5\n.\n18\n\n(47)\n\nOne may suggest that a spectral problem should exist for which Eq.(47) would represent\na semiclassical approximation. However, no such problem is known. 13 At least, it is not\nknown in the standard form of boundary problem for some differential operator. One still\ncan calculate the \"exact spectrum\" of such nonexisting (or very well hidden) problem by\nk\ncalculating corrections to the result (47) and representing Eexact\nas a series in semiclassical\nparameter ∼ 1/Scl . As this series is probably asymptotic, this method gives an intrinsic\nuncertainty in the spectrum ∼ exp{−CScl }. However, the closeness of exact energies\nof positive energy states and their semiclassical approximations (see Table 1) and the\ncalculations of higher order corrections in [19] suggests that this uncertainty is not large\neven for the \"sky state\" in Eq. (47) with k = 0 and Scl = π. It rapidly decreases with\nincrease of k.\nConsider now the Hamiltonian (32). Again, one can solve the Schrödinger equation\n13\n\nAnd here is an important difference with the complex oscillator problem discussed in Sect. 2, where\nthe spectral problem with the spectrum Ek = −k − 1/2 was perfectly well defined.\n\n18\n\n\fwith the potential −ix5 at the real axis with boundary conditions Ψ(±∞) = 0 and find a\ndiscrete spectrum with real positive energies. As is seen from Table 2, these exact energies\nare very close to semiclassical values determined from the quantization condition\nS+up = π(2k + 1) ,\n\n(48)\n\nwhere S+up given in Eq.(34) is evaluated for the upper trajectory in Fig. 6.\nk\nk\nEexact\nk\nEsemicl\n\n0\n1\n2\n3\n0.710 2.660 5.458 8.788\n0.543 2.608 5.410 8.750\n\nTable 2. Exact and semiclassical spectra for the potential −ix5 .\n\nAs we see, semiclassical approximation works somewhat worse in this case than for\nthe potential ix3 . But it works.\nWe can now leave the real axis and solve the spectral problem\n\u0014\n\u0015\n1 ∂\n5 5\n− 2 2 − is Φ Ψ = EΨ ,\n2Φ ∂s\n\u0013\n\u0012\n∂Ψ/∂s\n= 0, Ψ(∞) = 0 ,\n(49)\nRe\nΦΨ\ns=0\nwith Φ = eiα . The solution with the same spectrum exists for\nα−\n\nπ\nπ\n≤ ,\n14\n7\n\nor\n\nα−\n\nπ\n13π\n≤ .\n14\n7\n\n(50)\n\nα+\n\n3π\nπ\n≤ ,\n14\n7\n\nor\n\nα−\n\nπ\n17π\n≤ ,\n14\n7\n\n(51)\n\nFor\n\nthe solution still exists, but the spectrum is different. Its semiclassical approximation\ncomes not from the quantization condition (48), but rather from the quantization condition\nS+down = π(2k + 1)\n\n(52)\n\nderived for the lower stem trajectory in Fig.6. The exact and semiclassical energy values\nfor this case are given in Table 3.\nk\nk\nEexact\nk\nEsemicl\n\n0\n1\n2\n3\n1.163 5.234 10.795 17.428\n1.080 5.186 10.759 17.400\n\nTable 3. Exact and semiclassical spectra for the potential −iz 5 in the region (51).\n19\n\n\fz\n\n00000000000000000000\n11111111111111111111\n11111111111111111111\n00000000000000000000\n00000000000000000000\n11111111111111111111\n00000000000000000000\n11111111111111111111\n00000000000000000000\n11111111111111111111\n00000000000000000000\n11111111111111111111\n00000000000000000000\n11111111111111111111\n00000000000000000000\n11111111111111111111\n00000000000000000000\n11111111111111111111\n00000000000000000000\n11111111111111111111\nempty\n00000000000000000000\n11111111111111111111\n00000000000000000000\n11111111111111111111\n00000000000000000000\n11111111111111111111\n00000000000000000000\n11111111111111111111\nspectrum\n00000000000000000000\n11111111111111111111\n00000000000000000000\n11111111111111111111\n00000000000000000000\n11111111111111111111\n00000000000000000000\n11111111111111111111\n00000000000000000000\n11111111111111111111\n00000000000000000000\n11111111111111111111\n00000000000000000000\n11111111111111111111\n00000000000000000000\n11111111111111111111\nupper\n00000000000000000000\n11111111111111111111\n00000000000000000000\n11111111111111111111\norbits\n00000000000000000000\n11111111111111111111\n00000000000000000000\n11111111111111111111\n0000000000000000000\n1111111111111111111\n00000000000000000000\n11111111111111111111\n00000000000000000000\n11111111111111111111\n00000000000\n11111111111\n0000000000000000000\n1111111111111111111\n0000000000\n1111111111\n0000000000000000000\n1111111111111111111\n00000000000000000000\n11111111111111111111\n00000000000000000000\n11111111111111111111\n00000000000\n11111111111\n0000000000000000000\n1111111111111111111\n0000000000\n1111111111\n0000000000000000000\n1111111111111111111\n00000000000000000000\n11111111111111111111\n00000000000000000000\n11111111111111111111\n00000000000\n11111111111\n0000000000000000000\n1111111111111111111\n0000000000\n1111111111\n0000000000000000000\n1111111111111111111\n00000000000000000000\n11111111111111111111\n00000000000000000000\n11111111111111111111\n00000000000\n11111111111\n0000000000000000000\n1111111111111111111\n0000000000\n1111111111\n0000000000000000000\n1111111111111111111\n00000000000000000000\n11111111111111111111\n00000000000000000000\n11111111111111111111\n00000000000\n11111111111\n0000000000000000000\n1111111111111111111\n0000000000\n1111111111\n0000000000000000000\n1111111111111111111\n00000000000\n11111111111\n0000000000000000000\n1111111111111111111\n0000000000\n1111111111\n0000000000000000000\n1111111111111111111\n00000000000\n11111111111\n0000000000000000000\n1111111111111111111\n0000000000\n1111111111\n0000000000000000000\n1111111111111111111\n00000000000\n11111111111\n0000000000000000000\n1111111111111111111\n0000000000\n1111111111\n0000000000000000000\n1111111111111111111\norbits\nlower\n00000000000\n11111111111\n0000000000000000000\n1111111111111111111\n0000000000\n1111111111\n0000000000000000000\n1111111111111111111\n00000000000\n11111111111\n0000000000000000000\n1111111111111111111\n0000000000\n1111111111\n0000000000000000000\n1111111111111111111\n00000000000\n11111111111\n0000000000000000000\n1111111111111111111\n0000000000\n1111111111\n0000000000000000000\n1111111111111111111\ncontinuous\n00000000000\n11111111111\n0000000000000000000\n1111111111111111111\n0000000000\n1111111111\n0000000000000000000\n1111111111111111111\n00000000000\n11111111111\n0000000000000000000\n1111111111111111111\n0000000000\n1111111111\n0000000000000000000\n1111111111111111111\nspectrum\n00000000000\n11111111111\n0000000000000000000\n1111111111111111111\n0000000000\n1111111111\n0000000000000000000\n1111111111111111111\n00000000000\n11111111111\n0000000000000000000\n1111111111111111111\n0000000000\n1111111111\n0000000000000000000\n1111111111111111111\n00000000000\n11111111111\n0000000000000000000\n1111111111111111111\n0000000000\n1111111111\n0000000000000000000\n1111111111111111111\n00000000000\n11111111111\n0000000000000000000\n1111111111111111111\n0000000000\n1111111111\n0000000000000000000\n1111111111111111111\n00000000000\n11111111111\n0000000000000000000\n1111111111111111111\n0000000000\n1111111111\n0000000000000000000\n1111111111111111111\n000000000001111111111\n11111111111\n0000000000000000000\n1111111111111111111\n0000000000\n0000000000000000000\n1111111111111111111\n\nFigure 10: Spectral problem (49) in the complex z plane.\nFinally, for −9π/(14) < α < −5π/(14), the spectrum is continuous while, for 3π/(14) <\nα < 11π/(14), the spectrum is empty. The corresponding regions in the complex z plane\nare displayed in Fig.10.\nFor the Hamiltonian (4), there are n different nontrivial spectral problems with discrete\nspectrum defined in the sectors\nα+\n\nπ\n2πm\n(2n − 1)π\n≤\n−\n2(2n + 3) 2n + 3\n2n + 3\n\nor\n\nmirror image ,\n\n(53)\n\nm = 0, . . . , n−1. 14 They correspond to n different families of classical orbits with positive\nenergies for the potential −(iz)2n+1 . The problem studied in details in Refs. [9, 19] was\ndefined in the sector m = 0. 15 We concentrate in this paper on imaginary potentials like\nin Eq.(7). But one can equally well [9, 19] consider the potentials\nV (z) = −(iz)2n\n\n(54)\n\nFor the quartic potential ∼ −z 4 , there are four turning points, two sets of symmetric\nclassical positive energy orbits and a corresponding spectral problem defined in the sector\n|α − π/6| ≤ π/6 and its mirror images. For the potential ∼ z 6 we have, besides the\nstandard spectral problem on the real axis, also a nontrivial problem in the sector |α −\nπ/4| ≤ π/8, etc. For generic n, the potential (54) admits n/2 different spectral problems\nwhen n is even and (n + 1)/2 different spectral problems when n is odd.\n14\nThere are also asymmetric spectral problems. One can, for example, go from infinity to zero along\nthe line α = 17π/14 and to infinity from zero along the line α = π/14. But such problems have complex\neigenvalues [20] and we are not considering them.\n15\nIn Ref. [19], the problem with m = 1 was also considered. It was represented as the problem with\nthe potential V (x) = x4 (ix)ǫ . But the results for the spectrum were given there only for negative ǫ.\n\n20\n\n\fThe presence of several different quantum problems associated with a given classical\npotential seems to be natural in view of our analysis for the complex oscillator, where two\ndifferent spectral problems exist. However, it might appear surprising in the framework\nof Mostafazadeh's approach where the crypto-Hermitian Hamiltonian is obtained by a\nnonunitary rotation out of Hermitian H̃ representing a quite definite series in g and hence\nthe spectrum of H and of H̃ represents a quite definite series in g. For example, the\nground state energy of the system\np2 + x2\n− igx5\n2\n\n(55)\n\n1 449g 2\n+\n+ O(g 4) .\n2\n32\n\n(56)\n\nH =\nis\nE0 =\n\nThe resolution of this paradox is the following. Seemingly, only one of the spectral\nproblems (49) associated with the Hamiltonian (55), the problem defined in the sector\nincluding the real axis, can be safely treated in the framework of Mostafazadeh's approach.\nThe ground state energy is plotted in Fig. 11 as a function of g. Indeed, the spectrum\ntends to the oscillator spectrum when g → 0. It is not seen on the plot, but for very\nsmall g , starting from g ≈ .01 − .02, the numerical values of the energies agree with the\nperturbative evaluation (56).\nEnergy\n0.75\n0.7\n0.65\n0.6\n0.55\n0.2\n\n0.4\n\n0.6\n\n0.8\n\n1\n\ng\n\nFigure 11: Ground state energy of (55) as a function of g. Upper region.\nThe solution for another spectral problem at the vicinity of the rays α = −3π/14 and\nα = 17π/14 behaves in a different and rather unexpectedly different way. For very small\ng, the spectrum is transformed, indeed, to the oscillator spectrum, but this transformation\noccurs in a very nontrivial manner. When g goes down, the energies of all the states go\ndown in such a way that the energy of the ground state gets closer and closer to the\nenergy of the first excited state. At some critical value of the coupling g∗ ≈ .03717, their\nenergies coincide,\nE0 (g∗ ) = E1 (g∗ ) ≈ .484 .\n21\n\n\fAt still lower values of g, the energies should become complex. On the other hand, the\nsecond excited state goes down and down with decreasing of g and approaches the ground\nstate oscillator energy without adventures, E2 (g → 0) → 1/2 (see Fig. 12).\nEnergy\n10\n8\n6\n4\n2\n-3\n\n-2.5\n\n-2\n\n-1.5\n\n-1\n\n-0.5\n\nlog g\n\nFigure 12: Three first levels of (55) as a function of g. Lower region.\nTo be more precise, there are no adventures in a sense that there is no phase transition\nand the state exists at any g and has real energy. But the asymptotics is reached only at\nrather small couplings. The energy of the second excited state finds itself at the vicinity of\nE = 1/2 only at g ≈ .01. Now, E2 (.01) ≈ .46 and does not coincide with the perturbative\nexpansion (56). It is not excluded that at still smaller values of coupling, g ≈ .001, the\nperturbative asymptotics (56) finally shows up. To see whether it is true or not, a more\ncareful numerical study is required.\nThe third and the fourth excitations of the Hamiltonian (55) coalesce and their energies\ncease to be real at g∗∗ ≈ .007 (the energy is E∗∗ ≈ 1.37 at this point), while the fifth\nexcitation approaches the first oscillator excitation E = 3/2 at very small values of g.\nOne can suggest that this pattern holds also further up: the 6-th and the 7-th excitations\nof the mixed Hamiltonian coalesce and their energy becomes complex at some very small\ng∗∗∗ , while the 8-th excitation approaches the second oscillator excitation E = 5/2, and\nso on. We thus observe an infinite sequence of \"phase transitions\" in the coupling. 16\nThis analysis shows that the Hamiltonian (55) is crypto–Hermitian for all couplings\nin the upper sectors in Fig. 10, but, in the lower sectors, it is true only for not too\n16\n\nThis kind of transition when a pair of real eigenstates of a boundary problem coalesce and become\ncomplex is a known phenomenon [7]. Its essence is clearly seen in a trivial example. The matrix\n\u0012\n\u0013\n1 1\nA=\nα 1\nhas a pair of close real eigenvalues at small positive α and a pair of complex conjugated eigenvalues for\nα < 0. When α = 0 (the exceptional point), the matrix represents a nondiagonalizable Jordan block.\nAn infinite set of such transitions in the parameter ǫ for the problem V (x) = x2 (ix)ǫ was observed\nin [9]. We observed a similar phenomenon in a completely different physical context: it happens that\nsome domain wall solutions in supersymmetric gauge theories disappear when mass of the matter fields\nexceeds certain critical values [26].\n\n22\n\n\fsmall g > g⋆ . When g < g⋆ , a pair of complex conjugate eigenvalues should appear. For\ng < g⋆⋆ , there are two such pairs, etc. It would be very interesting to see these complex\neigenvalues explicitly. Unfortunately, it is not so easy to do it with our methods - the\nspectral problems of the type (44, 49) make sense only for real energies - the boundary\ncondition\n\u0013\n\u0012\n∂Ψ/∂s\n= 0\nRe\nΦΨ\ns=0\nwas derived under the assumption that Ψ(z) and Ψ⋆ (−z) satisfy the same Schrödinger\nequation, which is only true when E is real. A special study of this issue is required.\n\n5\n\nDiscussion and Outlook.\n\nCrypto-Hermitian systems have many common features with the systems involving higher\nderivatives. In both cases, Hermiticity of the Hamiltonian and unitarity of the evolution\noperator seem to be lost, but, if treating the problem properly, it is often restored. There\nexist also a more concrete relationship between two kind of systems. We have seen that the\nreal part H of the complexified Hamiltonian [see Eqs.(9), (24)] is never positive definite\nand may give rise to ghosts. The same is true for higher-derivative theories. Actually,\nthe canonical Hamiltonians of the latter have a rather similar form with not positive\ndefinite kinetic term [23]. The resemblance between the supersymmetric system analyzed\nin Ref. [23] and the problem considered here is even more striking. A system of the type\n(24) involves besides H the integral of motion G, and we are interested with the sector\nG = 0. The system studied in Ref. [23] (the bosonic part of its Hamiltonian is\nH = pP − DV ′ (x) ,\n\n(57)\n\nwhere (p, x) and (P, D) are two pairs of canonic variables and superpotential V (x) is an\narbitrary function) also possesses an extra integral of motion N = P 2 /2 − V (x). In the\nsector with a particular value of N (including N = 0) , the spectrum is discrete involving\npositive and negative energies.\nThe latter is also true for the spectrum (21) of complexified oscillator when the constraint G = 0 is imposed on the quantum states as in Eq.(18). The Dirac quantum\nproblem (18) is more naturally posed than other quantum problems associated with the\nclassical system in hand. This problem is easily solved in the oscillator case, but, for the\npotential iz 3 , this is a difficult numerical problem, and we leave it for further studies. One\ncan speculate that its spectrum involves positive and negative energies, as the spectrum\nof the complexified oscillator and the spectrum of the Hamiltonian (57) do. However,\nit is an open question at present whether the problem (18) makes sense for potentials\nmore complicated than z 2 . As we have seen in [23], the Hermiticity of the Hamiltonian\n(57) and the unitarity of the corresponding evolution operator are corollaries of the fact\nthat classical trajectories of this system are benign enough: there are no collapsing or\nrunaway trajectories where a singularity is reached at finite time. On the other hand,\nfor the systems (4), runaway classical trajectories exist. For sure, not all the trajectories\nassociated with the systems (4) are runaway trajectories. There are also closed orbits,\n23\n\n\fand a hope that the problem (18) is well defined is associated with their existence. The\npresence of runaway trajectories may spoil the brew, however.\nRunaway trajectories definitely spoil the brew for the quantum problems obtained by\nresolving the gauge constraint G = 0 at the classical level. This procedure gives benign\nsensible Hamiltonians for the complexified oscillator. However, the Hamiltonian (36) thus\nobtained is not Hermitian and unitarity is lost too.\nThere are, however, Hermitian and unitary quantum problems associated with the\nHamiltonians (4) and (7). For one of such problems corresponding to the potential x2 /2 −\nigx5 in the sectors below the real axis, we discovered a rather interesting and nontrivial\nphenomenon: when the coupling constant g is decreased, certain quantum states coalesce\nand disappear from the physical (real energy) spectrum. The number of such phase\ntransitions is infinite, which reminds an infinite number of phase transitions in ǫ for\nthe potential x2 (ix)ǫ observed in [9]. Another phenomenon that comes to mind in this\nrespect is the marginal stability curves in N=2 SYM theory and other supersymmetric\nsystems [27]. When crossing these curves, quantum states may appear and disappear.\nHowever, the mechanism for this is quite different there.\nLet us make somewhat unusual conclusion listing again not the results obtained (that\nwas done above), but rather the points which are not yet clear.\n1. It is not clear whether the spectral problem (18) is well posed for the potential (4)\nand, if yes, what is its spectrum. Is the evolution operator unitary ?\n2. It is not clear whether one can formulate the spectral problems with discrete spectrum in the dashed region in Figs. 9,10 by resolving the gauge constraint at the\nclassical level with a clever gauge choice.\n3. It is not clear why, in contrast to the complex oscillator case, we have not found\nfor the potential (4) a spectral problem involving only negative energy states (the\ncryptoghosts !) and related to the sets of classical orbits with negative energies.\nCan such problem be formulated ?\nThe final remark is that crypto-Hermitian systems may prove to be something more\nthan a formal mathematical exercise. They can bear relevance for physics. Our own interest to these problems stems mainly from their relationship to higher-derivative systems.\nAnd we believe (the arguments were presented in Ref. [28]) that the undiscovered yet\nfundamental Theory of Everything is a higher-derivative field theory (not string theory)\nliving in higher-dimensional space-time.\nI am indebted to P. Dorey, L. Mezincescu, and D. Robert for useful discussions.\n\nReferences\n[1] J.B. Bronzan, J.A. Shapiro, and R.L. Sugar, Phys. Rev. D14 (1976) 618; D. Amati,\nM. Le Bellac, M. Ciafaloni, and G. Marchesini, Nucl. Phys. B112 (1976) 107.\n\n24\n\n\f[2] M.G. Gasymov, Funct. Anal. Appl. 14 (1980) 11; for a recent pedagogical discussion\nsee T. Curtright and L. Mezincescu, quant-ph/0507015.\n[3] E. Calicetti, S. Graffi, and M. Maioli, Comm. Math. Phys. 75 (1980) 51.\n[4] F.G. Scholtz, H.B. Geyer, and F.J.W. Hahne, Ann. of Phys. (NY) 213 (1992) 74.\n[5] A.Mostafazadeh, J. Math. Phys. 43 (2002) 2814, 3944.\n[6] M.C. Pease, Methods of Matrix Algebra, Sect. IV.10. Academic Press, New York,\n1965.\n[7] W.D. Heiss, J. Phys. A 37 (2004) 2455 and references therein.\n[8] J. Feinberg and A. Zee, Phys.Rev. E59 6433 (1999).\n[9] C.M. Bender and S. Boettcher, Phys. Rev. Lett. 80 (1998) 5243.\n[10] C.M. Bender, Rept. Prog. Phys. 70 (2007) 947.\n[11] C.S. Jia, S.C. Li, Y.Li, L.T. Sun, Phys. Lett. A300 (2002) 115.\n[12] E.A. Ivanov and A.V. Smilga, JHEP07 (2007) 036.\n[13] N.Seiberg, JHEP 0006 (2003) 010.\n[14] P. Dorey, C. Dunning, and R. Tateo, J. Phys. A, 34 (2001) 5679.\n[15] A. Mostafazadeh, J. Phys. A38 (2005) 6557-6570 [quant-ph/0411137].\n[16] A.L. Xavier Jr. and M.A.M. de Aguiar, Ann. Phys. (NY) 252 (1996) 458.\n[17] R.S. Kauschal and H.J. Kosch, Phys. Lett. A276 (2000) 47; R.S. Kaushal and S.\nSingh, Ann. Phys. (NY) 288 (2001) 253.\n[18] A. Mostafazadeh, Phys. Lett. A357 (2006) 177.\n[19] C.M. Bender, S. Boettcher, and P.N. Meisinger, J. Math. Phys. 40 (1999) 2201.\n[20] K.C. Shin, J. Math. Phys. 46 (2005) 082110.\n[21] L.D. Faddeev and A.A. Slavnov, Gauge Fields. Introduction to Quantum Theory,\nFrontiers in Physics series, 50 (1980), paragraph 2 in chapter 3.\n[22] See e.g. W. Wasow, Asymptotic Expansions for Ordinary Differential Equations,\nDover, New York, 1987; Y. Sibuya, Global Theory of a Second Order Linear Ordinary Differential Equations with a Polynomial Coefficient, North Holland, Amsterdam, 1975.\n[23] D. Robert and A. Smilga, math-ph/0611023.\n\n25\n\n\f[24] A. Mostafazadeh, J.Phys. A 39,10171 (2006).\n[25] C.M. Bender, D.C. Brody, and H.F. Jones, Phys. Rev. D70 (2004) 025001.\n[26] A.V. Smilga and A.I. Veselov, Phys.Rev.Lett. 79 (1997) 4529; Nucl.Phys. B515\n(1998) 163; Phys.Lett. B428 (1998) 303 ; A.V. Smilga, Phys.Rev. D58 (1998)\n065005.\n[27] S. Cecotti and C. Vafa, Commun. Math. Phys. 158 (1993) 569; N. Seiberg and E.\nWitten, Nucl. Phys. B426 (1994) 19;\n[28] A. Smilga, in: Gribov Memorial Volume, World Scientific, 2006 (Yu.L. Dokshitzer,\nP. Levai, J. Nuiri - eds.), p.443 [hep-th/0509022].\n\n26\n\n\f"}