{"id": "http://arxiv.org/abs/1108.2140v3", "guidislink": true, "updated": "2011-08-21T05:54:43Z", "updated_parsed": [2011, 8, 21, 5, 54, 43, 6, 233, 0], "published": "2011-08-10T10:27:03Z", "published_parsed": [2011, 8, 10, 10, 27, 3, 2, 222, 0], "title": "Spatial inhomogeneity and chiral symmetry of the lattice incommensurate\n  supermodulation in high temperature superconductor Bi2Sr2CaCu2O8+y", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1108.6176%2C1108.2480%2C1108.2413%2C1108.4555%2C1108.0054%2C1108.4655%2C1108.2933%2C1108.1661%2C1108.3632%2C1108.6116%2C1108.3814%2C1108.2822%2C1108.1504%2C1108.6167%2C1108.2140%2C1108.3717%2C1108.5896%2C1108.2352%2C1108.0986%2C1108.4447%2C1108.0494%2C1108.6139%2C1108.4837%2C1108.0207%2C1108.1360%2C1108.3909%2C1108.4429%2C1108.5915%2C1108.0306%2C1108.0406%2C1108.4780%2C1108.4824%2C1108.5217%2C1108.1166%2C1108.1921%2C1108.0355%2C1108.2029%2C1108.2946%2C1108.2247%2C1108.3420%2C1108.2465%2C1108.5179%2C1108.5636%2C1108.5694%2C1108.4761%2C1108.0437%2C1108.2969%2C1108.3716%2C1108.1056%2C1108.2157%2C1108.4556%2C1108.2828%2C1108.6262%2C1108.0186%2C1108.5107%2C1108.3159%2C1108.1564%2C1108.5543%2C1108.0660%2C1108.5289%2C1108.0734%2C1108.1934%2C1108.3126%2C1108.1204%2C1108.1351%2C1108.1631%2C1108.5777%2C1108.0386%2C1108.4032%2C1108.4834%2C1108.4687%2C1108.0758%2C1108.2376%2C1108.5899%2C1108.5295%2C1108.0360%2C1108.2830%2C1108.3311%2C1108.6234%2C1108.2365%2C1108.1168%2C1108.0285%2C1108.1463%2C1108.4297%2C1108.5885%2C1108.2995%2C1108.5698%2C1108.4104%2C1108.5044%2C1108.0429%2C1108.4701%2C1108.3880%2C1108.1682%2C1108.2331%2C1108.0076%2C1108.2721%2C1108.4856%2C1108.1656%2C1108.3152%2C1108.0398%2C1108.1668&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Spatial inhomogeneity and chiral symmetry of the lattice incommensurate\n  supermodulation in high temperature superconductor Bi2Sr2CaCu2O8+y"}, "summary": "Using scanning micro X-ray diffraction we report a mixed real and reciprocal\nspace visualization of the spatial heterogeneity of the lattice incommensurate\nsupermodulation in single crystal of Bi2Sr2CaCu2O8+y with Tc=84 K. The mapping\nshows an amplitude distribution of the supermodulation with large lattice\nfluctuations at microscale with about 50% amplitude variation. The angular\ndistribution of the supermodulation amplitude in the a-b plane shows a lattice\nchiral symmetry, forming a left-handed oriented striped pattern. The spatial\ncorrelation of the supermodulation is well described by a compressed\nexponential with an exponent of 1.5 and a correlation length of about 50\n{\\mu}m, showing the intrinsic lattice disorder in high temperature\nsuperconductors.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1108.6176%2C1108.2480%2C1108.2413%2C1108.4555%2C1108.0054%2C1108.4655%2C1108.2933%2C1108.1661%2C1108.3632%2C1108.6116%2C1108.3814%2C1108.2822%2C1108.1504%2C1108.6167%2C1108.2140%2C1108.3717%2C1108.5896%2C1108.2352%2C1108.0986%2C1108.4447%2C1108.0494%2C1108.6139%2C1108.4837%2C1108.0207%2C1108.1360%2C1108.3909%2C1108.4429%2C1108.5915%2C1108.0306%2C1108.0406%2C1108.4780%2C1108.4824%2C1108.5217%2C1108.1166%2C1108.1921%2C1108.0355%2C1108.2029%2C1108.2946%2C1108.2247%2C1108.3420%2C1108.2465%2C1108.5179%2C1108.5636%2C1108.5694%2C1108.4761%2C1108.0437%2C1108.2969%2C1108.3716%2C1108.1056%2C1108.2157%2C1108.4556%2C1108.2828%2C1108.6262%2C1108.0186%2C1108.5107%2C1108.3159%2C1108.1564%2C1108.5543%2C1108.0660%2C1108.5289%2C1108.0734%2C1108.1934%2C1108.3126%2C1108.1204%2C1108.1351%2C1108.1631%2C1108.5777%2C1108.0386%2C1108.4032%2C1108.4834%2C1108.4687%2C1108.0758%2C1108.2376%2C1108.5899%2C1108.5295%2C1108.0360%2C1108.2830%2C1108.3311%2C1108.6234%2C1108.2365%2C1108.1168%2C1108.0285%2C1108.1463%2C1108.4297%2C1108.5885%2C1108.2995%2C1108.5698%2C1108.4104%2C1108.5044%2C1108.0429%2C1108.4701%2C1108.3880%2C1108.1682%2C1108.2331%2C1108.0076%2C1108.2721%2C1108.4856%2C1108.1656%2C1108.3152%2C1108.0398%2C1108.1668&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Using scanning micro X-ray diffraction we report a mixed real and reciprocal\nspace visualization of the spatial heterogeneity of the lattice incommensurate\nsupermodulation in single crystal of Bi2Sr2CaCu2O8+y with Tc=84 K. The mapping\nshows an amplitude distribution of the supermodulation with large lattice\nfluctuations at microscale with about 50% amplitude variation. The angular\ndistribution of the supermodulation amplitude in the a-b plane shows a lattice\nchiral symmetry, forming a left-handed oriented striped pattern. The spatial\ncorrelation of the supermodulation is well described by a compressed\nexponential with an exponent of 1.5 and a correlation length of about 50\n{\\mu}m, showing the intrinsic lattice disorder in high temperature\nsuperconductors."}, "authors": ["Nicola Poccia", "Gaetano Campi", "Michela Fratini", "Alessandro Ricci", "Naurang L. Saini", "Antonio Bianconi"], "author_detail": {"name": "Antonio Bianconi"}, "author": "Antonio Bianconi", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevB.84.100504", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1108.2140v3", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1108.2140v3", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "12 pages, 3 figures; Physical Review B Rapid Communications 2011", "arxiv_primary_category": {"term": "cond-mat.supr-con", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.supr-con", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1108.2140v3", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1108.2140v3", "journal_reference": "Physical Review B 84, 100504 (2011)", "doi": "10.1103/PhysRevB.84.100504", "fulltext": "Spatial inhomogeneity and chiral symmetry of the lattice\nincommensurate supermodulation in high temperature\nsuperconductor Bi2Sr2CaCu2O8+y\nNicola Poccia1, Gaetano Campi2, Michela Fratini1, Alessandro Ricci 1,\nNaurang L. Saini1, Antonio Bianconi1*\n1\n\nDepartment of Physics, Sapienza University of Rome, P. le A. Moro 2, 00185\nRoma, Italy\n2\nInstitute of Crystallography, CNR, via Salaria Km 29.300, Monterotondo\nStazione, Roma, I-00016, Italy\nUsing scanning micro X-ray diffraction we report a mixed real and\nreciprocal space visualization of the spatial heterogeneity of the lattice\nincommensurate supermodulation in single crystal of Bi2Sr2CaCu2O8+y with\nTc=84 K. The mapping shows an amplitude distribution of the\nsupermodulation with large lattice fluctuations at microscale with about\n50% amplitude variation. The angular distribution of the supermodulation\namplitude in the a-b plane shows a lattice chiral symmetry, forming a lefthanded oriented striped pattern. The spatial correlation of the\nsupermodulation is well described by a compressed exponential with an\nexponent of 1.5±0.3 and a correlation length of about 50 μm, showing the\nintrinsic lattice disorder in high temperature superconductors.\n*E-mail: antonio.bianconi@uniroma1.it\n\nOne of the emerging common features of high temperature superconductors (HTSs) is\nthe intrinsic lattice inhomogeneity [1-4] but it remains practically unknown because of the\nlack of methods probing both the k-space and the real space from nano-scale to micronscale. The intrinsic lattice inhomogeneity is related with the co-existence of two or more\nelectronic components showing a nanoscale phase separation in the normal phase [3-4]. In\nfact two strongly correlated electronic components at the Fermi level are expected to exhibit\na phase separation between two electronic phases with different charge density [5]. The low\ndensity phase is close to the Wigner localization limit in the normal phase and below Tc\nforms a Bose-like condensate or a bipolaronic condensate in presence of electron-lattice\ninteraction [6,7]. The high density phase forms a BCS condensate below Tc, therefore the\nHTS phase appears to be at the BCS-Bose crossover in a multi-gap superconductor [6,7].\n1\n\n\fThe striped superconductor showing nanoscale phase separation of striped domains with\ndifferent gaps has been called the \"superstripes\" scenario characterized at lager scales by a\ncomplex landscape of striped patches [8].\nIn cuprates there is agreement on the experimental fact that the itinerant carriers\ninduced by doping are injected in the oxygen 2p orbitals [9] and that at the Fermi level there\nare two main electronic components [10]:\n1) the nodal particles with higher Fermi velocity with the wavevector on the Fermi\nsurface arcs around the\n\n(\" ,\" )\n\ndirection of the reciprocal k-space, i.e., moving nearly at 45°\n\nfrom the Cu-O bond direction. These states have molecular b1 orbital symmetry made of\n!\n\natomic oxygen 2px,y hybridized with pure Cu 3d x 2 \"y 2 orbital.\n2) the antinodal particles with lower Fermi velocity\nwith Fermi wavevector in the\n!\ndirections of the reciprocal k-space. In the normal phase they show a pseudo gap\n!\nbelow T*. These particules have a strong coupling to the B1g phonon [11]. This mode\n(0,\" ),(\" ,0)\n\n!\n\ninvolves the Q2 rhombic distortion of the CuO4 platelet [12]. These particles run in the real\nspace around the Cu-O bond direction and are made of molecular orbital with a1 symmetry\nmade of oxygen 2px,y orbital hybridized with mixed Cu 3d 3z 2 \"r 2 and 3d x 2 \"y 2 atomic orbital.\nTheir orbital symmetry has been determined by Cu L2,3 polarized XANES\n! and the associated\ninstantaneous pair distribution function of the Cu-O pairs by polarized EXAFS and they\n!\n!\nhave been associated with pseudo Jahn Teller polarons [13].\nThe phase separation in cuprates with the formation of lattice domains with different\ncharge densities has been clearly observed in the case of mobile dopants, oxygen interstitials\nin oxygenated La2CuO4+y both in the underdoped [14] and in the optimum doping [15,16]\nregime. In this case the domain growth and the density of mobile oxygen interstitials are\nexpected to track the hole density in the CuO2 plane.\nA second common feature of all HTSs is that their lattice architecture is a\n\"heterostructure at atomic limit\" where atomic \"layers\" of a superconducting material are\nintercalated by block \"layers\" [17]. In these superlattices the lattice misfit between the\ndifferent layers both in cuprates [18-22], pnictides [23] and chalcogenides [24,25] plays a\nkey role as the third variable in the phase diagram of the superconductors.\nMost of the studies on electronic inhomogeneity have been focused on the system\nBi2Sr2CaCu2O8+y (Bi2212). In this system the misfit strain [18-22] between the block layers\n2\n\n\f(Bi2O2-Sr2O2) and the bilayers (CuO2-Ca-CuO2) induces a lattice corrugation of both the\nBiO planes [26-29] and the CuO2 planes [30,31] appearing as a lattice supermodulation in xray diffraction that form stripes of distorted and undistorted lattice witan electronic structure\nreconstruction with multi bands and broken Fermi surface arcs [31-34]. This lattice\nsupermodulation has been recently associated with the modulation of the superconducting\ngaps [35] revealing the effect of this specific lattice modulation on the superconducting\nCuO2 layers [30,31].\nIn this work we have investigated the spatial mapping of the variation of the amplitude\nof the superstructure lattice modulation with the specific wavevector 0.21b*, 0.5c* in\nBi2212 [26-31] looking for multiscale phase separation on the micron scale [38,39]. The\nnanoscale electronic and topological inhomogeneity in Bi2212 has been widely investigated\nby scanning tunneling microscopy/spectroscopy (STM/STS) [35, 40-43]. The Fermi surface\nhas been measured by techniques like ARPES [10,44]. The k-space information obtained\nfrom these methods is spatially averaged, and it is generally difficult to quantitatively\nreconcile these results with the nanoscale structure. Here, we have attempted to overcome\nthis limit and used scanning micro X-ray diffraction (μXRD). The results provide a mixed\nreal and reciprocal space visualization of the spatial heterogeneity of the lattice\nincommensurate supermodulation in the Bi2212 system, showing quenched disorder and\ntranslational and rotational broken symmetry.\nThe μXRD experiment at the beam-line (ID13) of the ESRF takes advantage of the\nnovel focusing method of the 12KeV x-ray synchrotron radiation beam emitted by a 18 mm\nperiod undulator of ESRF 6.03 GeV storage ring, operated in multibunch mode with a\ncurrent of 200 mA. The beam-line uses two monochromators positioned in series; the first is\na liquid N2 cooled Si-111 double crystal or Si-111 (bounce); the second, is a channel cut\nmonochromator employing a single liquid nitrogen cooled Si crystal. The optics of the\nmicrofocus beamline includes compound refractive lenses, Kirkpatrick Baez (KB) mirrors\nand crossed Fresnel zone plates focusing the beam to a spot of 1 micron in diameter. The\ninteraction volume with the crystal of the 1 micron beam is\n\n1 ! 1 ! 20μm 3 .he\n\ndetector of x-ray\n\ndiffraction images is a high resolution CCD camera (Mar CCD) with point spread function\n0.1 mm, 130 mm entrance window, 16 bit readout placed at a distance of about 90 mm from\nthe sample. The measurements were made on a well-characterized Bi2212 single crystal of\n100 x 130 μm2 surface and 80 μm thickness, grown by the traveling-solvent-floating-zone\n3\n\n\fmethod (TSFZ). The growth velocity was adopted to be 0.5mm/h, and the growth\natmosphere was a mixed gas flow of O2 (20%) and Ar (80%). Structural analysis was\nperformed using a 4-axis X-ray diffraction, and the basic structure of the samples was found\nto be orthorhombic symmetry with lattice parameter of a≈542 pm , b≈547 pm, c=3070 pm, α\nand γ ≈90.0◦, β ≈92◦ with a large orthorhombic distortion in the range 0.5-1.1 % in\nagreement with other overdoped crystals grown by TSFZ technique [45,46]. The\ninvestigated samples are overdoped with an oxygen content y determined to be around\n0.26±0.01, corresponding to a hole density of about 0.21 holes per Cu site [47]. The crystal\nwas mounted on an XY mechanical translator for scanning parallel to the crystallographic\n(a,b) plane. The experimental set-up in x-ray reflection mode allows the xy-translation of\nthe sample with 4.97 μm steps in the x and y directions .\nA typical diffraction pattern of synchrotron X-ray reflections due to satellite peaks near\nthe main crystal reflection (0,0,20) is shown in Fig. 1a. There are two distinct sets of\nincommensurate superstructures. The first is a three-dimensional long-range order (3DLRO) modulation, characterized by a very sharp and resolution limited peak , the second is\na two-dimensional (2D) short-range order (SRO) modulation, characterized by a diffuse\nprofile in the c-axis direction due to 2D domain walls separating the 3D domains of 3DLRO.\n\nFor\n\neach\n\nBragg\n\nrefection\n\nthe\n\ndiffraction\n\nvector\n\nH\n\ncan\n\nbe\n\nwritten\n\nas H = ha * + kb * +1c * + mqs [qs = \"b * +(1 / ! )c*, ! = 1] .\n\n4\n\n\fFigure 1: a) X-ray diffraction pattern in the (k,l) plane of Bi2212 recorded by a CCD\ndetector showing the 3D-LRO and 2D-SRO satellites near the (0,0,20) reflection; The b)\nand c) panels show the profiles of the x-ray reflections due to the 2D-SRO (empty\nrectangles) and 3D-LRO (filled circles) satellites along c* and b*directions where l and k\nare measured in the reciprocal lattice units (r.l.u) respectively. d) Temperature dependent\nresistivity of Bi2212 superconducting crystals used in this work (green, red and blue\ncurves represent resistivity in the a, b and c axis respectively). The insert to the panel\nshows the resistivity derivatives around the Tc. The black arrow shows the Tc onset of the\nsuperconducting transition.\n\nThe qs vector, called superstructure vector, is the wavevector of the modulation,\ndefined as the linear combination of the base vectors of the three dimensional reciprocal\nlattice qs = #a * + \"b* + !c* . Fig 1b and Fig. 1c show the profiles of the x-ray scattering\n5\n\n\freflections (h,4 # n \" ! , l ) for\n\n! = 0.21 .\n\nThe experimental diffraction coherence lengths are\n\n\" c3D = 1/ #L = 944 ± 2 nm; \" b3D = 1/ #k = 190 ± 2 nm\n\nand \"c2D = 1/ #L = 146 ± 5\n\nnm; \" b2D = 1/ #K = 82 ± 5 nm ,\n\nwhere Δl, Δk are the FWHM of the diffraction reflection profiles, respectively for the 3D!\n\n!\nLRO and 2D-SRO, distinguishing the long-range\nfrom the short-range order.\n\nFigure 2:| (color online) Panels a and b: The position dependent intensities of the\nsuperstructure 3D-LRO (panel a) and the superstructure 2D-SRO (panel b) superstructure\nsatellite reflections in Bi2212. The crystallographic a-axis is along the horizontal\ndirection, and the b-axis is along the vertical direction. The very dark gray (blue color)\nindicates weak supermodulation amplitude, the light gray and dark gray (yellow and red)\nshow the regions of high XRD superstructure reflections.. Panel (c) and panel (d) (from\nreference 36,37: Atomic displacements in the BiO layer projected into the x-y plane from\nDFT bulk calculation (36,37) (panel c) and the. experimental data by diffraction (see, e.g.\nRef. 28); dashed lines are mirror planes, and X's mark points of stability found for\noxygen interstitials by DFT (Panel d) Panel e shows the topological distribution of lattice\nstripes in the CuO2 plane of BI2212 plane probed by Cu K-edge resonant x-ray\ndiffraction [30] and by Cu K-edge EXAFS [31] and The empty squares (filled rhombs)\nindicate undistorted (distorted) CuO4 plaquettes in the undistorted (distorted) stripes. The\nrhombs due to atomic Q2 local lattice distortion of the square CuO4 plaquette could order\nin the right-handed or the left-handed direction breaking the rotational symmetry of the\nlattice. The figure shows the left handed orientation of the Q2 rhombic distortions with\nthe direction of the Cu-O bond elongation of the distorted CuO4 plaquette at 45° from the\ndirection of the supermodulation parallel to the vertical direction.\n\n6\n\n\fThe x–y position dependence of the integrated satellite peak intensity (Fig. 2a,b)\nshows that the coexisting 2D-SRO and 3D-LRO structural modulations are quite\ninhomogeneous on the micrometer scale. The position dependence of the 3D-LRO and\n2D-SRO satellites is shown in Fig. 2 (panels a and b respectively). The color scales from\ndark blue (minimum) to the dark red (maximum). The intensity (satellite superstructure\nintensity integrated over a square sub-areas of the CCD detector) is normalized with\nrespect to the background intensity (Io) of the tail of the main crystalline reflections. The\nordered patches of 3D-LRO and 2D-SRO are oriented along one specific direction (left\ndirection), 45° with respect to the vertical direction (superlattice direction) implying two\ndifferent diagonal directions (left and right) in the real space. This result provides a clear\nevidence of the spontaneous breaking of the rotational crystal symmetry in the plane.\nIt was known that the atomic displacements in the BiO layers [26-29] run in the\ndiagonal direction confirmed by ab-initio calculations [36,37]. Cu-K-edge resonant x-ray\ndiffraction at the Cu K-edge have shown that the CuO2 plane is decorated by stripes of\ndistorted and undistorted lattice in Bi2212 [30] and the polarized extended x-ray\nabsorption fine structure (EXAFS) data [48,49] have shown that anomalous Cu-O-Cu\nbonds (45° from the superlattice direction) appear along only one of the two (left handed\nor right handed) diagonal directions as shown in Fig. 2c. The broken rotational symmetry\nhas also been observed later by STM experiments [43].\nThe present evidence of left-handed micro-scale inhomogeneity of the lattice\nsupermodulation intensity fluctuations provides evidence for broken lattice symmetry on\na scale three order of magnitude larger than seen before. This result confirms the\nproposed intrinsic multiscale structural complexity driven from nanoscale to microscale\nby elastic fields [38,39] in a popular model cuprate system.\nIn Fig. 3 and Fig. 4 we quantify the observed inhomogeneity of the 3D-LRO and 2DSRO superstructures, by plotting the distribution of intensities and the distance-dependent\nintensity correlations. Fig. 3 shows that the mean values of the amplitude of the 3D-LRO\nand 2D-SRO are different, the deviation from the average for both supermodulations is\naround 50-60%. Also, over a small 50 μm area the amplitude of the micro-XRD\nreflection fluctuations are of the order of 30%. The large disorder of the amplitude of\nsupermodulation can be assigned to the spatial inhomogeneity due to space variable\nstoichiometric that strongly deviates from the nominal composition.\n7\n\n\fFigure 3. (color online) The intensities distribution of the 3D-LRO reflection intensities\n(filled triangles) (panel a) and 2D-SRO (empty circles) (panel b) for the 120 x 70 μm2\nsample surface region is shown.\n\n8\n\n\fFigure 4. (color online) The spatial correlation function, G(r) of the x-ray diffraction\nintensities of the 3D-LRO superstructure reflections (filled triangles) and of the x-ray 2DSRO reflections (empty circles) recorded by the micro XRD mapping at the spots on the\nsurface of the sample. The solid lines show the fitting with the curves\n1.5\nr\nG(r) = G(r ) \" A exp[ # r $] with correlation length \" = 47μm and 78μm for the 3D-LRO and the\n2D-SRO respectively.\n!\n\n!\n\nThe spatial correlation function G(r) calculated following Ref. [15] is plotted in Fig.\n3c. The results show that the spatial correlation function can be described by compressedr\n\nexponential G (r ) = G (r ) $ A exp[# r \" ]! with the same exponent \" = 1.5 ± 0.3 and with a\ncut-off in the range of 30 μm to 80 μm . These spatial correlation lengths between\ncorrugated domains are much larger than the domain\n! size measured by the planar\ndiffraction coherence lengths\n\n\" b2D = 82 nm; \" b3D = 190 nm; .\n\nThe compressed exponential\n\nrelaxation has been observed for a variety of soft matter systems undergoing 'jamming'\n!\n\n9\n\n\ftransitions; -like collective dynamics with ! > 1 [50] instead of liquid-like fluctuations\nwith ! < 1 . It should be recalled that an exponent 1.5 has been reported for nematic liquid\ncrystal on a surface [51] and for granular matter [52].\nWe have shown that the mixed k-space and real space visualization of the Bi2212\nlattice shed new light on multiscale complexity in the HTS. These results contribute to\nthe debate on rotational symmetry breaking observed by experimental methods\nmeasuring the response of the average structure over micron-size probed domains [5358]. The large space variability in the amplitude of the lattice supermodulation underlines\nthe high level of lattice disorder implying a disorder in the electronic structure. In\nparticular small partial gaps due to the band folding determined by the striped lattice\nstructure (superstripes) [8] could be masked by the spatial fluctuations of the lattice\ncorrugation that breaks the translational symmetry. In fact a variation of 40 % in the\namplitude of the structural one-dimensional modulation should make a fuzzy landscape\nof partial gaps and complex multiple Fermi surfaces. The left-handed distribution of\nsuperstructure fluctuation amplitude gives a chiral symmetry at the mcron-scale\ncorrelated with the breaking of the rotational symmetry of the rhombic Q2 distortions of\nthe CuO4 platelets already observed by EXAFS and resonant diffraction [6-11,40]. The\nmisift strain between the superconductor and the spacer layers [18-21] is proposed to be\nthe external field that breaks the symmetry between the right-handed and the left-handed\norientation of the Q2 distortions [12,13]. The present data support the multiscale breaking\nof rotational symmetry at the microscale as well as at the previously observed atomic\nscale. Moreover these results introduces a new scenario of percolating microscopic\nsuperconducting domains in a preferential direction in a typical high temperature\nsuperconductor.\nAcknowledgements. The authors are grateful to Ginestra Bianconi for discussions\nsuggestions, and data analysis by using methods of statistical physics. We thank Manfred\nBurghammer and the ID13 beamline staff at ESRF for experimental help.\n\n10\n\n\fReferences.\n[1] E. Dagotto, Science 309, 257 (2005).http://dx.doi.org/10.1126/science.1107559\n[2] A. R. Bishop, Journal of Physics: Conference Series 108, 012027 (2008).\nhttp://dx.doi.org/10.1088/1742-6596/108/1/012027\n[3] K. A. Müller, Journal of Physics: Condensed Matter 19, 251002 (2007)\n[4] A. Bianconi, Physica C 235-240, 269-272 (1994); http://dx.doi.org/10.1016/09214534(94)91366-8 A. Bianconi, D. Di Castro, G. Bianconi, A. Pifferi, N. L. Saini, F. C. Chou,\nD. C. Johnston and M. Colapietro Physica C 341-348, 1719 (2000).\nhttp://dx.doi.org/10.1016/S0921-4534(00)00950-3\n[5] K. I. Kugel, A. L. Rakhmanov, A. O. Sboychakov, N. Poccia, and A. Bianconi, Phys. Rev. B\n78, 165124 (2008). http://dx.doi.org/10.1103/PhysRevB.78.165124\n[6] A. Bianconi Solid State Commun. 91, 1 (1994); http://dx.doi.org/10.1016/0038-1098(94)908311 A. Bianconi and M. Missori Solid State Commun. 91, 287 (1994).\nhttp://dx.doi.org/10.1016/0038-1098(94)90304-2\n[7] D. Innocenti, N. Poccia, A. Ricci, A. Valletta, S. Caprara, A. Perali, and A. Bianconi, Phys.\nRev. B 82, 184528 (2010). http://dx.doi.org/10.1103/PhysRevB.82.184528\n[8] A. Bianconi, Intern. Jour. of Mod. Phys. B 14, 3289 (2000); N. L. Saini and A. Bianconi,\nInternational\nJournal\nof\nModern\nPhysics\nB\n14,\n3649\n(2000)..\nhttp://dx.doi.org/10.1142/S0217979200004179\n[9] A. Bianconi, A. Congiu Castellano, M. De Santis, P. Rudolf, P. Lagarde, A. M. Flank, and A.\nMarcelli Solid State Commun. 63, 1009 (1987).\n[10] A. Lanzara, P. V. Bogdanov, X. J. Zhou, S. A. Kellar, D. L. Feng, E. D. Lu, T. Yoshida, H.\nEisaki, A. Fujimori, K. Kishio, J.-I. Shimoyama, T. Noda, S. Uchida, Z. Hussain and Z.-X.\nShen Nature 412, 510 (2001). http://dx.doi.org/10.1038/35087518\n[11] T. Cuk, F. Baumberger, D. H. Lu, N. Ingle, X. J. Zhou, H. Eisaki, N. Kaneko, Z. Hussain, T. P.\nDevereaux, N. Nagaosa, and Z.-X. Shen Phys. Rev. Lett. 93, 117003 (2004).\nhttp://link.aps.org/abstract/PRL/v93/e117003\n[12] Y. Seino, A. Kotani and A. Bianconi: J. Phys. Soc. Jpn. 59, 815 (1990).\nhttp://jpsj.ipap.jp/link?JPSJ/59/815\n[13] A. Bianconi, N. L. Saini, A. Lanzara, M. Missori, T. Rossetti, H. Oyanagi, H. Yamaguchi,\nK. Oka,\nand\nT. Ito,\nPhys.\nRev.\nLett.\n76,\n3412\n(1996).\nhttp://dx.doi.org/10.1103/PhysRevLett.76.3412\n[14] .J. D. Jorgensen, B. Dabrowski, Shiyou Pei, D. G. Hinks, and L. Soderholm, B. Morosin, J. E.\nSchirber, E. L. Venturini, and D. S. Ginley Physical Review B 38, 11337 (1988).\nhttp://dx.doi.org/10.1103/PhysRevB.38.11337\n[15] M. Fratini, N. Poccia, A. Ricci, G. Campi, M. Burghammer, G. Aeppli, and A. Bianconi,\nNature 466, 841 (2010). http://dx.doi.org/10.1038/nature09260\n[16] N. Poccia, M. Fratini, A. Ricci, G. Campi, L. Barba, A. Vittorini-Orgeas, G. Bianconi, G.\nAeppli and A. Bianconi Nature Materials, published online: 14 august 2011 | doi:\n10.1038/nmat3088\n[17] A. Bianconi Solid State Communications 89, 933 (1994). http://dx.doi.org/10.1016/00381098(94)90354-9\n[18] A. Bianconi, S. Agrestini, G. Bianconi, D. Castro, and N. Saini, in Stripes and Related\nPhenomena, edited by A. Bianconi and N. L. Saini (Springer US, Boston, 2002), vol. 8 of\nSelected Topics in Superconductivity, chap. 2, pp. 9-25.\n[19] A. Bianconi, N. L. Saini, S. Agrestini, D. Di Castro, and G. Bianconi, International Journal of\nModern Physics B 14, 3342 (2000). http://dx.doi.org/doi:10.1142/S0217979200003812\n[20] A. Bianconi, D. Di Castro, N. L. Saini, and G. Bianconi, in Phase Transitions and SelfOrganization in Electronic and Molecular Networks, edited by M. F. Thorpe and J. C. Phillips\n\n11\n\n\f(Kluwer Academic Publishers, Boston, 2002), Fundamental Materials Research, chap. 24, pag.\n375. http://dx.doi.org/10.1007/0-306-47113-2_24 http://arxiv.org/abs/1107.4858\n[21] A. Bianconi, G. Bianconi, S. Caprara, D. D. Castro, H. Oyanagi, and N. L. Saini, Journal of\nPhysics: Condensed Matter 12, 10655 (2000). http://dx.doi.org/10.1016/S09214534(00)00950-3\n[22] M Fratini, N Poccia, and A Bianconi Journal of Physics: Conference Series, 108, 012036\n(2008). http://dx.doi.org/10.1088/1742-6596/108/1/012036 arXiv:0812.136\n[23] A. Ricci, N. Poccia, B. Joseph, L. Barba, G. Arrighetti, G. Ciasca, J. Q. Yan, R. W. McCallum,\nT. A. Lograsso, N. D. Zhigadlo, J. Karpinski, and A. Bianconi 1, Phys. Rev. B 82, 144507\n(2010). http://dx.doi.org/10.1103/PhysRevB.82.144507\n[24] A. Ricci, N. Poccia, B. Joseph, G. Arrighetti, L. Barba, J. Plaisier, G. Campi, Y. Mizuguchi,\nH. Takeya, Y. Takano, N. L. Saini and A. Bianconi Superconductor Science and\nTechnology 24, 082002 (2011). http://iopscience.iop.org/0953-2048/24/8/082002/\n[25] A. Ricci, N. Poccia, G. Campi, B. Joseph, G. Arrighetti, L. Barba, M. Reynolds, M.\nBurghammer, H. Takeya, Y. Mizuguchi, Y. Takano, M. Colapietro, N. L. Saini and A.\nBianconi, preprint arXiv 1107.0412 (2011). http://arxiv.org/abs/1107.0412\n[26] A. Yamamoto, M. Onoda, E. T. Muromachi, F. Izumi, T. Ishigaki, and H. Asano, Phys. Rev. B\n42, 4228 (1990). http://dx.doi.org/10.1103/PhysRevB.42.4228\n[27] X. B. Kan and S. C. Moss, Acta Crystallographica Section B 48, 122 (1992).\nhttp://dx.doi.org/10.1107/S0108768191011333\n[28] A. A. Levin, Y. I. Smolin, and Y. F. Shepelev, Journal of Physics: Condensed Matter 6, 3539\n(1994). http://dx.doi.org/10.1088/0953-8984/6/19/009\n[29] D. Grebille, H. Leligny, and O. Pérez, Phys. Rev. B 64, 106501 (2001).\nhttp://dx.doi.org/10.1103/PhysRevB.64.106501\n[30] A. Bianconi, M. Lusignoli, N. L. Saini, P. Bordet, and P. G. Radaelli, Phys. Rev. B 54, 4310\n(1996).http://dx.doi.org/10.1103/PhysRevB.54.4310\n[31] A. Bianconi, N. L. Saini, T. Rossetti, A. Lanzara, A. Perali, M. Missori, H. Oyanagi, H.\nYamaguchi, Y. Nishihara, and D. H. Ha, Physical Review B 54, 12018 (1996).\n[32] A. Perali, A. Bianconi, A. Lanzara, and N. L. Saini, Solid State Communications100, 181\n(1996). http://dx.doi.org/10.1016/0038-1098(96)00373-0\n[33] A. Bianconi, A. Valletta, A. Perali, and N. L. Saini, Solid State Communications102, 369\n(1997) http://dx.doi.org/10.1016/S0038-1098(97)00011-2\n[34] A. Bianconi, A. Valletta, A. Perali, and N. L. Saini, Physica C: Superconductivity 296, 269\n(1998). http://dx.doi.org/10.1016/S0921-4534(97)01825-X\n[35] J. A. Slezak, J. Lee, M. Wang, K. McElroy, K. Fujita, B. M. Andersen, P. J. Hirschfeld,\nH. Eisaki, S. Uchida, and J. C. Davis, Proc. Nat. Acad. Sciences 105, 3203 (2008).\nhttp://dx.doi.org/10.1073/pnas.0706795105\n[36] Y. He, S. Graser, P. J. Hirschfeld, and H. P. Cheng, Phys. Rev. B 77, 220507 (2008).\nhttp://dx.doi.org/10.1103/PhysRevB.77.220507\n[37] K. Foyevtsova, H. C. Kandpal, H. O. Jeschke, S. Graser, H. P. Cheng, R. Valent'i, and P. J.\nHirschfeld, Phys. Rev. B 82, 054514 (2010). http://dx.doi.org/10.1103/PhysRevB.82.054514.\n[38] A. Saxena, Y. Wu, T. Lookman, S. Shenoy, and A. Bishop, Physica A: Statistical Mechanics\nand its Applications 239, 18 (1997). http://dx.doi.org/10.1103/PhysRevLett.91.057004\n[39] J. X. Zhu, K. H. Ahn, Z. Nussinov, T. Lookman, A. V. Balatsky, and A. R. Bishop, Phys. Rev.\nLett. 91, 057004 (2003).\n[40] N. Jenkins, Y. Fasano, C. Berthod, I. Maggio-Aprile, A. Piriou, E. Giannini, B. W.\nHoogenboom, C. Hess, T. Cren, and Ø. Fischer, Phys. Rev. Lett. 103, 227001 (2009).\nhttp://dx.doi.org/10.1103/PhysRevLett.103.227001\n[41] A. Piriou, N. Jenkins, C. Berthod, I. Maggio-Aprile, and Ø. Fischer, Nature Communications 2,\n221 (2011). http://dx.doi.org/10.1038/ncomms1229\n[42] C. V. Parker, P. Aynajian, E. H. da Silva Neto, A. Pushp, S. Ono, J. Wen, Z. Xu, G. Gu, and\n\n12\n\n\fA. Yazdani, Nature 468, 677 (2010). http://dx.doi.org/10.1038/nature09597\n[43] M. J. Lawler, K. Fujita, J. Lee, A. R. Schmidt, Y. Kohsaka, C. K. Kim, H. Eisaki, S. Uchida,\nJ. C. Davis, J. P. Sethna, and Eun-Ah Kim Nature 466, 347 (2010).\nhttp://dx.doi.org/10.1038/nature09169\n[44] N. L. Saini, J. Avila, A. Bianconi, A. Lanzara, M. C. Asensio, S. Tajima, G. D. Gu, and\nN. Koshizuka,\nPhys.\nRev.\nLett.\n79,\n3467\n(1997).\nhttp://dx.doi.org/10.1103/PhysRevLett.79.3467\n[45] I. Bdikin, A. N. Maljuk, b, A. B. Kulakov, C. T. Lin, P. Kumar, B. Kumar, G. C. Trigunayat and\nG.\nA.\nEmel'chenko\nPhysica\nC:\nSuperconductivity\n383,\n431\n(2003)\nhttp://dx.doi.org/10.1016/S0921-4534(02)01792-6\n[46] A. Maljuk, B. Liang, C. T. Lin, and G. A. Emelchenko, Physica C: Superconductivity 355, 140\n(2001). http://dx.doi.org/10.1016/S0921-4534(00)01769-X\n[47] T. Watanabe, T. Fujii, and A. Matsuda, Recent Res. Devel. Physics 5, 51 (2004). arxiv:condmat/0401448\n[48] N. L. Saini, H. Oyanagi, M. Molle, K. Garg, C. Kim, and A. Bianconi, Journal of Physics and\nChemistry of Solids 65, 1439 (2004). http://dx.doi.org/10.1016/j.jpcs.2003.12.011\n[49] N. L. Saini, A. Lanzara, A. Bianconi, and H. Oyanagi, The European Phys. Jour. B - Condensed\nMatter and Complex Systems 18, 257 (2000). http://dx.doi.org/10.1007/s100510070056\n[50] O. G. Shpyrko, E. D. Isaacs, J. M. Logan, Y. Feng, G. Aeppli, R. Jaramillo, H. C. Kim, T. F.\nRosenbaum, P. Zschack, M. Sprung, S. Narayanan and A. R. Sandy Nature 447, 68 (2007).\nhttp://dx.doi.org/10.1038/nature05776\n[51] M. Nespoulous, C. Blanc, and M. Nobili, Phys. Rev. Lett. 104, 097801 (2010),\nhttp://dx.doi.org/10.1103/PhysRevLett.104.097801\n[52] P. Wang, C. Song, Y. Jin, K. Wang, and H. A. Makse, Journal of Statistical Mechanics: Theory\nand Experiment 2010, P12005 (2010). http://dx.doi.org/10.1088/1742-5468/2010/12/P12005\n[53] A. Kaminski, S. Rosenkranz, H. M. Fretwell, J. C. Campuzano, Z. Li, H. Raffy, W. G. Cullen,\nH. You, C. G. Olson, C. M. Varma, et al., Nature 416, 610 (2002).\nhttp://dx.doi.org/10.1103/PhysRevLett.92.207001\n[54] S. V. Borisenko, A. A. Kordyuk, A. Koitzsch, T. K. Kim, K. A. Nenkov, M. Knupfer, J. Fink,\nC. Grazioli, S. Turchini, and H. Berger, Phys. Rev. Lett. 92, 207001 (2004).\nhttp://dx.doi.org/10.1103/PhysRevLett.92.207001\n[55] M. Kubota, K. Ono, Y. Oohara, and H. Eisaki, Jour. of the Phys. Soc. Japan 75, 053706 (2006)\nhttp://dx.doi.org/10.1143/JPSJ.75.053706\n[56] V. Arpiainen, A. Bansil and M. Lindroos, Phys. Rev. Lett. 103, 067005 (2009).\nhttp://dx.doi.org/10.1103/PhysRevLett.103.067005\n[57] M. R. Norman, A. Kaminski, S. Rosenkranz, and J. C. Campuzano, Phys. Rev. Lett.105,\n189701 (2010). http://dx.doi.org/10.1103/PhysRevLett.105.189701.103\n[58] R. Daou, J. Chang, D. LeBoeuf, O. Cyr-Choiniere, F. Laliberte, N. Doiron-Leyraud, B. J.\nRamshaw, R. Liang, D. A. Bonn, W. N. Hardy and Louis Taillefer Nature 463, 519 (2010).\nhttp://dx.doi.org/10.1038/nature08716.\n\n13\n\n\f"}