{"id": "http://arxiv.org/abs/1107.3115v1", "guidislink": true, "updated": "2011-07-15T17:53:25Z", "updated_parsed": [2011, 7, 15, 17, 53, 25, 4, 196, 0], "published": "2011-07-15T17:53:25Z", "published_parsed": [2011, 7, 15, 17, 53, 25, 4, 196, 0], "title": "Molecular Binding Energies from Partition Density Functional Theory", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1107.3025%2C1107.2259%2C1107.0792%2C1107.2004%2C1107.5469%2C1107.2449%2C1107.5391%2C1107.4455%2C1107.1395%2C1107.1523%2C1107.4631%2C1107.0845%2C1107.3869%2C1107.2842%2C1107.2522%2C1107.1106%2C1107.3912%2C1107.1624%2C1107.4128%2C1107.0315%2C1107.3143%2C1107.1424%2C1107.0489%2C1107.1739%2C1107.0297%2C1107.4173%2C1107.0702%2C1107.3275%2C1107.1053%2C1107.0189%2C1107.2504%2C1107.3280%2C1107.5521%2C1107.0150%2C1107.0283%2C1107.2273%2C1107.0487%2C1107.3294%2C1107.0751%2C1107.3565%2C1107.0079%2C1107.3556%2C1107.0336%2C1107.5173%2C1107.1306%2C1107.5722%2C1107.3689%2C1107.5157%2C1107.3617%2C1107.1014%2C1107.4949%2C1107.4299%2C1107.3115%2C1107.3846%2C1107.1476%2C1107.2274%2C1107.0561%2C1107.1311%2C1107.3094%2C1107.4952%2C1107.0811%2C1107.0049%2C1107.3004%2C1107.0722%2C1107.5738%2C1107.3810%2C1107.5438%2C1107.0394%2C1107.2836%2C1107.5983%2C1107.2643%2C1107.3003%2C1107.5784%2C1107.0700%2C1107.1500%2C1107.2958%2C1107.1201%2C1107.2007%2C1107.0359%2C1107.1731%2C1107.4521%2C1107.5328%2C1107.0805%2C1107.5346%2C1107.5123%2C1107.5418%2C1107.5869%2C1107.3915%2C1107.2729%2C1107.6025%2C1107.3662%2C1107.2521%2C1107.4377%2C1107.3043%2C1107.2315%2C1107.2026%2C1107.3967%2C1107.4142%2C1107.0237%2C1107.4333%2C1107.2190&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Molecular Binding Energies from Partition Density Functional Theory"}, "summary": "Approximate molecular calculations via standard Kohn-Sham Density Functional\nTheory are exactly reproduced by performing self-consistent calculations on\nisolated fragments via Partition Density Functional Theory [Phys. Rev. A 82,\n024501 (2010)]. We illustrate this with the binding curves of small diatomic\nmolecules. We find that partition energies are in all cases qualitatively\nsimilar and numerically close to actual binding energies. We discuss\nqualitative features of the associated partition potentials.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1107.3025%2C1107.2259%2C1107.0792%2C1107.2004%2C1107.5469%2C1107.2449%2C1107.5391%2C1107.4455%2C1107.1395%2C1107.1523%2C1107.4631%2C1107.0845%2C1107.3869%2C1107.2842%2C1107.2522%2C1107.1106%2C1107.3912%2C1107.1624%2C1107.4128%2C1107.0315%2C1107.3143%2C1107.1424%2C1107.0489%2C1107.1739%2C1107.0297%2C1107.4173%2C1107.0702%2C1107.3275%2C1107.1053%2C1107.0189%2C1107.2504%2C1107.3280%2C1107.5521%2C1107.0150%2C1107.0283%2C1107.2273%2C1107.0487%2C1107.3294%2C1107.0751%2C1107.3565%2C1107.0079%2C1107.3556%2C1107.0336%2C1107.5173%2C1107.1306%2C1107.5722%2C1107.3689%2C1107.5157%2C1107.3617%2C1107.1014%2C1107.4949%2C1107.4299%2C1107.3115%2C1107.3846%2C1107.1476%2C1107.2274%2C1107.0561%2C1107.1311%2C1107.3094%2C1107.4952%2C1107.0811%2C1107.0049%2C1107.3004%2C1107.0722%2C1107.5738%2C1107.3810%2C1107.5438%2C1107.0394%2C1107.2836%2C1107.5983%2C1107.2643%2C1107.3003%2C1107.5784%2C1107.0700%2C1107.1500%2C1107.2958%2C1107.1201%2C1107.2007%2C1107.0359%2C1107.1731%2C1107.4521%2C1107.5328%2C1107.0805%2C1107.5346%2C1107.5123%2C1107.5418%2C1107.5869%2C1107.3915%2C1107.2729%2C1107.6025%2C1107.3662%2C1107.2521%2C1107.4377%2C1107.3043%2C1107.2315%2C1107.2026%2C1107.3967%2C1107.4142%2C1107.0237%2C1107.4333%2C1107.2190&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Approximate molecular calculations via standard Kohn-Sham Density Functional\nTheory are exactly reproduced by performing self-consistent calculations on\nisolated fragments via Partition Density Functional Theory [Phys. Rev. A 82,\n024501 (2010)]. We illustrate this with the binding curves of small diatomic\nmolecules. We find that partition energies are in all cases qualitatively\nsimilar and numerically close to actual binding energies. We discuss\nqualitative features of the associated partition potentials."}, "authors": ["Jonathan Nafziger", "Qin Wu", "Adam Wasserman"], "author_detail": {"name": "Adam Wasserman"}, "author": "Adam Wasserman", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1063/1.3667198", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1107.3115v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1107.3115v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "cond-mat.other", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.other", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1107.3115v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1107.3115v1", "arxiv_comment": null, "journal_reference": null, "doi": "10.1063/1.3667198", "fulltext": "Molecular Binding Energies from Partition Density Functional Theory\nJonathan Nafziger∗\nDepartment of Physics, Purdue University, 525 Northwestern Avenue, West Lafayette, IN 47907, USA\n\nQin Wu†\nCenter for Functional Nanomaterials, Brookhaven National Laboratory, Upton, NY 11973\n\nAdam Wasserman‡\n\narXiv:1107.3115v1 [cond-mat.other] 15 Jul 2011\n\nDepartment of Chemistry, Purdue University, 560 Oval Drive, West Lafayette, IN 47907, USA and\nDepartment of Physics, Purdue University, 525 Northwestern Avenue, West Lafayette, IN 47907, USA\n(Dated: October 31, 2018)\nApproximate molecular calculations via standard Kohn-Sham Density Functional Theory are\nexactly reproduced by performing self-consistent calculations on isolated fragments via Partition\nDensity Functional Theory [Phys. Rev. A 82, 024501 (2010)]. We illustrate this with the binding\ncurves of small diatomic molecules. We find that partition energies are in all cases qualitatively\nsimilar and numerically close to actual binding energies. We discuss qualitative features of the\nassociated partition potentials.\n\nI.\n\nINTRODUCTION\n\nKohn-Sham Density Functional Theory (KS-DFT)\n[1, 2] provides one of the most useful methods for calculating electronic properties of molecules and materials\n[3]. The accuracy that can be achieved with modern approximations to the xc-functional [4–6], and the efficiency\nof numerical implemenations [7], make of KS-DFT one\nof the workhorses of computational quantum chemistry,\nmaterials science, and nanotechnology.\nA method has recently been proposed that exactly\nreproduces the results of approximate KS-DFT calculations via self-consistent calculations on isolated fragments [8]. Partition Density Functional Theory (PDFT)\nis based on the density-Partition Theory (PT) of ref.[9],\nand is analogous to KS-DFT in that it establishes a map\nbetween the physical system of ground-state density n(r),\nthought of as a collection of interacting fragments, and\nan auxiliary system of Nf non-interacting fragments with\nensemble-ground-state-densities {nα (r)} subject to the\nPN\ndensity constraint α f nα (r) = n(r). The appeal of this\nformalism is two-fold: on the one hand, by optimally dividing a complex system into fragments it allows one to\nbuild a rigorous foundation for chemical reactivity theory [9–11]. On the other hand, by solving the molecular\nKohn-Sham equations in a different way, it focuses attention on quantities that are amenable to new, different approximations, potentially leading to linear-scaling\nalgorithms for large systems. In that spirit, PDFT is\nsimilar to embedded-DFT [12–15]. One such quantity is\nthe partition potential, vp (r), a global molecular property (called reactivity potential in ref.[9], and equivalent\nin practice to the crystal potential of ref.[16] and the\n\n∗ Electronic\n\naddress: jnafzig@purdue.edu\naddress: qinwu@bnl.gov\n‡ Electronic address: awasser@purdue.edu\n† Electronic\n\nembedding potential of ref.[13]). It is used as an additional external potential for each fragment so that the\ndensity constraint is satisfied. If the density of the whole\nis known, as in the original formulation of PT, vp (r) is\nsimply the Langrage multiplier of the density constraint.\nWithout knowing the whole density, an iterative procedure for deriving vp (r) was designed and illustrated\nwith 1-D models [8, 17]. In this work we will show how\nthis procedure is realized for real molecules. This step is\nof course essential to be able to explore the promise of\nPDFT on both fronts mentioned before.\nThe partition potential is the functional derivative of\nthe partition energy, Ep [{nα }], with respect to any of\nthe fragment densities nα (r). This energy is defined as\nthe difference between the molecular ground-state energy\nPN\nE[n] and the sum of the fragment energies α f Eα [nα ].\nKohn-Sham equations can be established so that approximations to Ep [{nα }] yield definite predictions for\nthe ground-state energy and density of the assembly.\nWhen the exact Ep [{nα }] is employed implicitly by inversion of molecular KS equations [8], then the exact KSDFT results are recovered without ever having to solve\nthe direct problem for the assembly, but only for the fragments.\nAnalytical studies on one-dimensional models of heteronuclear diatomics [18] provide an early indication that\nthe fragment dipoles obtained by PDFT are more adjusted to chemical intuition and more transferable than\nthose obtained by other density-partitioning schemes,\nbut more studies are of course needed in real systems.\nIn this work, by employing the Wu-Yang algorithm\n[19] for iterative inversion, we demonstrate convergence\nof the PDFT equations in small diatomic molecules, and\ndiscuss qualitative features of partition potentials and\npartition-energy binding curves for He2 , H2 , and LiH.\nWe show that the partition energies and potentials are\ninteresting quantities in themselves, as they can be used\nas conceptual and interpretative tools.\n\n\f2\nFirst, we summarize the PDFT procedure in Sec.II,\nproviding details of our implementation. Convergence of\nthe PDFT equations is demonstrated in Sec.III for the\nbinding curves of He2 , H2 , and LiH, along with implications, qualitative features of patition potentials, and\nEp -binding curves (in addition to actual binding curves).\nConcluding remarks are given in Sec.IV.\nII.\n\nMETHOD\n\nFor the simplicity of discussion, we consider a compound with only two parts (A and B), but the method is\nequally applicable to any number of fragments. We also\nlimit ourselves to fragments with fixed integer number of\nelectrons, as in related recent work on embedding-DFT\n[13–15], only briefly discussing the issue of chemical potential equalization and fractional electron numbers.\nIn PDFT, the total energy is expressed as\nE[n] = EA [nA ] + EB [nB ] + Ep [nA , nB ]\n\n(1)\n\nwhere n(r) = nA (r) + nB (r), and a common functional\nfor E, EA and EB is assumed. The above equation can\nbe viewed as a formal and exact definition of Ep . To\nminimize E by variations of fragments' densities, which\nare built from their own sets of orbitals, we have the\nfollowing Kohn-Sham equations:\n\u0014\n\u0015\n1\nα α\n− ∇2 + vα (r) + vp (r) + vHXC [nα ](r) φα\ni (r) = εi φi (r)\n2\n(2)\nHere, α is a fragment index, i.e A or B in this work. The\npartition potential vp (r) is common to both fragments,\nthus has no α-index.\nvp (r) could be derived explicitly if we knew the functional form of Ep [{nα }]. Without an expression for Ep\nas an explicit functional of the {nα }, it is also possible to\nderive vp (r) through an iterative procedure, which was\nfirst proposed in ref.[8] and we reiterate here.\nSuppose that we are at the beginning of the k-th iter(k)\nation. We obtain all fragment densities nα by solving\nEq. 2. We then construct a total pro-molecule density\nP (k)\nas ñ(k) (r) =\nnα (r). Because the effect of vp (r) is to\nmake ñ(r) the same as the true ground-state density of\nthe whole system ns (r), the difference between ñ(k) (r)\n(k)\nand ns (r) should be used a guidance to update vp (r).\nFor that, we do a constrained search to find the energy\nof ñ(k) , i.e.\nE[ñ(k) ] = min E[n].\n\n(3)\n\nn→ñ(k)\n\nWe employ the direct optimization algorithm of Wu\nand Yang [19], as used in calculating the frozen density\nenergy in a recently-developed density based energy decomposition analysis [31]. Thus we rewrite the above\nequation as\nE[ñ(k) ] = Ev [ñ(k) ]+EHXC [ñ(k) ]+ min {Ts [Ψ] + EX [Ψ]}\nΨ→ñ(k)\n\n(4)\n\nfor a general hybrid functional, where EX [Ψ] represents\na fraction of the HF exchange energy calcualted from a\nSlater determinant Ψ that is constrained to yield ñ(k) .\nAt the end of this minimization, the effective potential\nfor the molecular Kohn-Sham orbitals is\nveff (r) = vα (r) + vHXC [ñ(k) ](r) − vλ (r) ,\n\n(5)\n\nwhere vλ (r) is just the Lagrange multiplier corresponding\nto the density constraint and is expanded by a linear combination of atom-centered Gaussian functions. Because\nvλ (r) is used to force the density of the whole system\nto be ñ(k) , its reverse should have the effect of making\nñ(r) more like ns (r). That is: we can set vp (r) = −vλ (r)\nand start the next iteration of fragment calculations. In\npractice, we update vp (r) as follows:\n(i)\n\nvp(i) (r) = vp(i−1) (r) − θ ∗ vλ (r) ,\n\n(6)\n\nwhere i is the iteration number, and θ is a damping factor between 0 and 1 used to control convergence. In our\ncalculation, we have used θ = 1 or θ = 0.25. The convergency criterion we use is |E[ñk ] − E[ns ]| < \u000f, where\n\u000f = 10−6 ; this guarantees the converged energy is the\nsame at the ground-state energy. The alternative choice\nof |E[ñk ]−E[ñk−1 ]| < \u000f gives essentially the same results.\nIII.\n\nRESULTS\n\nWe demonstrate our calculations of vp (r) with three\nsimple examples of diatomic systems: He2 , H2 , and LiH.\nIn all calculations, Dunning's aug-cc-pvTz basis set is\nused for molecular orbitals.\nThe counter-poise (CP) method is used to account\nfor any Basis Set Superposition Error (BSSE). This approach is crucial in PDFT since vp (r) adds features to the\nfragment's effective potential directly at the location of\nthe other atom, precisely where the ghost basis functions\nare added [32].\nThe partition potential is expanded by atom-centered\nGaussian functions, and each center has five s-type\nfunctions, with even-tempered exponents of 2n , n =\n0, ±2, ±4. In the following discussion, we will use sev0\n0\neral energy terms. Suppose EA\nand EB\nare the energies of the fragments with no influence of the parp\np\ntition potential; EA\nand EB\nare their energies with\nthe converged partition potential; and EAB is the energy of the compound. Therefore the binding energy is\n0\n0\nEbind = EAB − (EA\n+ EB\n), and the partition energy is\np\np\nEp = EAB − (EA + EB ). We also define the preparap\np\n0\n0\ntion energy as Eprep = (EA\n+ EB\n) − (EA\n+ EB\n), which\nis the energy increase associated with the deformation of\nfragments. Clearly, Ebind = Eprep + Ep .\nA.\n\nHelium Dimer\n\nRare-gas dimers are known to be weakly bound due to\nvan der Waals interactions, which are not accurately cap-\n\n\f3\n\n0.16\n\nE(bind)\nEp\nE(prep)\n\nEnergy (a.u.)\n\n0.14\n0.12\n0.1\n\n0.035\ndensity difference\n\n0.03\n0.025\n0.02\n0.015\n0.01\n0.005\n0\n−0.005\n\n−4\n\n−2\n0\n2o\nNuclear Coordinate (A)\n\n4\n\nFIG. 2: The density differences in He2 as compared to the\noriginal atoms along the line through both nuclei. The total\ndifference (dashed line) is the sum of the deformation in each\natom (solid line). The nuclei coordinates are R = ±0.8 Å.\n\nVp (a.u.)\n\ntured by most density-functional approximations. However, because our procedure is general and independent\nof the exchange-correlation functional, it is not critical to have the correct binding curve. Instead, for a\nclear demonstration, we use Hartree-Fock exchange only,\nwhich is known to be purely repulsive between nonpolar\nclosed-shell systems. As shown in Fig. 1, the binding energy for He2 is all positive and increases rapidly when the\ninternuclear distance is shortened. It also shows that the\npreparation energy is very small, which means the deformation in He atoms is small, as expected in this system,\nthough it starts to grow when the atoms are too close to\neach other. The repulsive nature of the interaction means\nthat electron densities are pushed away from each other\nwhen the two He atoms are in close contact. Thus the internuclear region has a density decrease, as shown in Fig.\n2. In PDFT, this density difference is achieved through\ndeformation of each atom, due to the action of the partition potential. In Fig. 3 we plot vp along the internuclear axis at a few representative internuclear distances.\nClearly, vp is most positive in the internuclear region, corresponding to the density deficiency. The magnitude of\nvp decreases as the internuclear distance increases, until\nto a point that no vp is needed.\n\n0.16\n0.14\n0.12\n0.1\n0.08\n0.06\n0.04\n0.02\n0\n−0.02\n−0.04\n\nR=0.8\nR=1.0\nR=1.2\nR=1.4\n\n−4\n\n−2\n0\n2o\nNuclear Coordinate (A)\n\n4\n\n0.08\nFIG. 3: The partition potentials for He2 at different internuclear distances. The nuclei are at ±R.\n\n0.06\n0.04\n0.02\n0\n\n1\n\n1.5\n\n2\no\nD(He−He) (A)\n\n2.5\n\n3\n\nFIG. 1: The Hartree-Fock energies for He2 at different internuclear distances.\n\nIt is notable that there are significantly more oscillations in the partition potential than in the density differences. Some of the oscillations are physical. But there\nare at least two other possible reasons contributing to\nthe oscillations in vp . One is pathological with gaussian\ndensities, as nicely explained by Schipper, Gritsenko and\nBaerends [33]. The other is numerical and due to the\nfact that we expand vp in a finite basis set [34]. We have\nused a small number of functions so as to limit the oscillations caused by the expansion. However, we are unable\nto use non-gaussian densities yet, which makes it difficult\nto determine the nature of the oscillations.\n\nB.\n\nHydrogen Molecule\n\nFor the covalently bonded molecule H2 , the natural\nchoice of partition is to use two open-shell H (OSH)\natoms. Because their spins are paired up in the molecule,\nwe only consider the total charge density. Mathematically one could also use half-occupied closed-shell H\natoms (CSH) as the fragments, thus without polarizing the spin. We study the energetics of both partitions as a function of the internuclear distance, using the\nB3LYP approximation to the exchange-correlation functional. For the H2 molecule, we only consider restricted\nKohn-Sham (RKS) calculations. It is well-known that a\nrestricted calculation does poorly for large internuclear\ndistances. The erroneous behavior is evident from the\nbinding energy curve when the OSH atoms are used as\nthe reference. As shown in Fig. 4, Ebind approaches a\npositive value instead of zero. On the other hand, when\nthe CSH atoms are used as the reference, Ebind does go\nto zero. However, it becomes too large at the optimal\nbond length. The two binding curves are simply differ-\n\n\f4\n\n0.15\n0.1\n0.05\n0\n−0.05\n−0.1\n−0.15\n−0.2\n−0.25\n−0.3\n−0.35\n−0.4\n0.5\n\n1\n\nEbind CSH\nEp CSH\nE(prep) CSH\nE(bind) OSH\nEp OSH\nE(prep) OSH\n1.5\n2\n2.5\no\nD(H−H) (A)\n\n3\n\n1\n0.5\nVp (a.u.)\n\n0\n−0.5\n−1\n−1.5\n−2\n\nR=0.3\nR=0.7\nR=1.1\n2o\n−2\n0\nNuclear Coordinate (A)\n\n−2.5\n−3\n\n−4\n\nequilibrated. Achieving equilibration requires treating\nfragments with fractional number of electrons in the\nspirit of PPLB [36]. In that case, the number of electrons in a fragment is also a variable to be optimized.\nBecause the partition potential will be different when\nthe fragments change, the optimization of both the partition potential and the number of electrons is mutually\ndependent and has to be achieved simultaneously. We\nwill treat this complexity in the future. In this work, we\nsimply use fixed fragments and derive the corresponding\npartition potential.\nWithout the optimal fragments, we consider all possible partitions. For LiH, there are two possibilities. First,\nwe use neutral atoms. Second, we use Li+ and H− . We\ndo the partition at the optimized internuclear distance of\n1.59073 Å. For the neutral partition, Eprep = 0.053257\na.u. and Ep = −0.146407 a.u. For the ionic partition,\nEprep = 0.034395 a.u. and Ep = −0.300161 a.u. The\nlarger partition energy in the ionic case could be the result of Coulomb attraction. However, the preparation\nenergy is smaller for the ionic partition, suggesting the\nLiH bond is closer to an ionic bond than a covalent bond.\nWhat is surprising is that the partition potential for the\nionic case looks much stronger than the neutral one (Fig.\n5), despite causing less distortion in fragment's energies.\n3\n2.5\n\n4\n\nFIG. 4: Top: The B3LYP energies for H2 at different interatomic distances. The optimized bond length is D = 0.743\nÅ. Bottom: The partition potentials for H2 at different internuclear distances.\n\n2\nVp (a.u.)\n\nEnergy (a.u.)\n\nent by a constant shift, and this shift comes from the fact\nthat OSH and CSH have different energies in the B3LYP\napproximation, while they should be degenerate with the\nexact functional [35].\n\nneutral (Li and H)\n\nionic (Li +and H −)\n\n1.5\n1\n0.5\n0\n−0.5\n\nIn PDFT, the differences in the choice of fragments\nwill not matter if the partition energy can compensate\nfor the difference and yield identical total energy. In our\ncase here, the two Ep are indeed quite different. However, the two Ep curves differ more than by a simple\nconstant shift. The non-uniform difference can be appreciated by comparing the preparation energies. Eprep of\nOSH fragments is smaller at short internuclear distances\nthan that of CSH fragments. However, the latter goes to\nzero at long distances while the former does not. At long\ndistances, a restricted H2 is essentially two half-occupied\nclosed-shell H atoms, so the asymptotic behavior is not\nsurprising. But it is interesting to see that at short distances, the OSH fragments pay less penalty to make their\ndensities resemble that of the molecule.\n\nC.\n\nLithium Hydride\n\nAs another example, we consider the heteronuclear\nLiH. Within the formal partition theory, there is a unique\nchoice of the fragments, with their chemical potentials\n\n−1\n\n−4\n\n−2\n0\n2o\nNuclear Coordinate (A)\n\n4\n\nFIG. 5: The B3LYP partition potentials for LiH. The Li atom\nis at x = 0 and H at x = 1.59073 Å.\n\nIV.\n\nCONCLUDING REMARKS\n\nWithout having to solve directly the KS equations\nfor the total external potential, we have shown how the\nPDFT algorithm of ref.[8] provides in practice the same\nanswers via fragment-KS equations. In addition, this\nmethod yields fragment densities, fragment energies, and\na partition potential that is shared by all fragments such\nthat the sum of their densities reproduces the correct total density.\nAlthough no physical meaning can be attached to a\nparition potential beyond the one implied by its definition (i.e. that it is the potential common to all fragments\n\n\f5\nsuch that the sum of the fragment densities equals the\ntotal molecular density), some generic features of partition potentials seem to go in line with chemical intuition:\nthey are positive when the interaction between fragments\nis repulsive (case of He2 within Hartree-Fock), and their\naverage magnitude is larger when the interaction between\nfragments is stronger. Similarly, the strength of the interaction between fragments is loosely measured by the\nmagnitude of the partition energy. No such conclusion\ncan be drawn for the preparation energy, however, as\nshown for the case of LiH where a somewhat larger preparation energy is associated with a much smaller partition\npotential (neutral vs. ionic partition). But the preparation energy can tell us about the character of the bond,\nan aspect that we plan to study further in future work.\nThe case of LiH also highlights the need to go beyond\ninteger numbers of electrons in our implementation of\nPDFT.\nPDFT calculations also allow us to look at the dissociation problem from a different angle. For example,\nwe found that open-shell fragments in H2 are preferred\nat short inter-nuclear separations in the sense that they\npay less penalty to make their densities resemble that\nof the molecule, but close-shell fragments are preferred\nat long separations. The respective preparation energies\ncross near the Coulson-Fischer point.\nFinally, we point out that from weak (He2 ) to rela-\n\ntively strong (H2 ) chemical bonds, partition energies are\nqualitatively similar to actual binding energies, and numerically close to them (i.e. preparation energies are\nsmall in the cases studied). This similarity of Ep -curves\nto their corresponding binding curves suggests that approximations of Ep [{nα }] as explicit functionals of the\n{nα } might be very useful for practical computations.\nNot only would they provide a direct way to obtain the\npartition potentials by functional differentiation, circumventing the need of expensive inversion steps; sensible\napproximations would also lead to energies that are close\nto actual binding energies. This is analogous to what\nhappens in KS-DFT, whose success is largely due to the\nfact that the sum of KS orbital energies is typically close\nto actual ground-state energies in chemical applications.\n\n[1] P. Hohenberg and W. Kohn, Phys. Rev. 136, B 864\n(1964).\n[2] W. Kohn and L.J. Sham, Phys. Rev. 140, A 1133 (1965).\n[3] R.M. Dreizler and E.K.U. Gross, Density Functional\nTheory (Springer-Verlag, Berlin, 1990); R.G. Parr\nand W. Yang, Density-Functional Theory of Atoms and\nMolecules (Oxford, New York, 1989); R.M. Martin,\nElectronic Structure (Cambridge University Press, Cambridge, 2004).\n[4] J.P. Perdew, K. Burke, and M. Ernzerhof, Phys. Rev.\nLett. 77, 3865 (1996); 78, 1396 (1997) (E).\n[5] J. Tao, J.P. Perdew, V.N. Staroverov and G.E. Scuseria,\nPhys. Rev. Lett. 91, 14640 (2003).\n[6] Y. Zhao and D.G. Truhlar, Theor. Chem. Acc. 120, 215\n(2008).\n[7] M. Valiev, E.J. Bylaska, N. Govind, K. Kowalski, T.P.\nStraatsma, H.J.J. van Dam, D. Wang, J. Nieplocha, E.\nApra, T.L. Windus, W.A. de Jong, Comput. Phys. Commun. 181, 1477 (2010)\n[8] P. Elliott, K. Burke, M.H. Cohen, and A. Wasserman,\nPhys. Rev. A 82, 024501, (2010).\n[9] M.H. Cohen and A. Wasserman, J. Phys. Chem. A 111,\n2229 (2007).\n[10] M.H. Cohen and A. Wasserman, Isr. J. Chemistry 43,\n219 (2003).\n[11] M.H. Cohen and A. Wasserman, J. Stat. Phys. 125, 1125\n(2006).\n[12] C. Huang and E.A. Carter, J. Chem. Phys. 125, 084102\n(2006).\n[13] C. Huang, M. Pavone, and E.A. Carter, J. Chem. Phys.\n\n134, 154110 (2011).\n[14] J.D. Goodpaster, N. Ananth, F.R. Manby, and T.F.\nMiller III, J. Chem. Phys. 133, 084103 (2010).\n[15] J.D. Goodpaster, T.A. Barnes, and T.F. Miller III,\narXiv:1102.4028v1 (2011).\n[16] P. Cortona, Phys. Rev. B 44, 8454 (1991).\n[17] P. Elliott, M.H. Cohen, A. Wasserman, and K. Burke, J.\nComp. Theor. Chem. 5, 827 (2009).\n[18] Y. Zhang and A. Wasserman, J. Chem. Theory Comput.\n6, 3312 (2010).\n[19] Q. Wu and W. Yang, J. Chem. Phys. 118, 2498 (2003).\n[20] T.A. Wesolowski and A. Warshel, J. Phys. Chem. 97,\n8050 (1993).\n[21] S.R. Gadre, R.N. Shirsat, and A.C. Limaye, J. Phys.\nChem. 98, 9165 (1994).\n[22] K. Kitaura, E. Ikeo, T. Asada, T. Nakano, and M. Uebayasi, Chem. Phys. Lett. 313, 701 (1999).\n[23] T.E. Exner and P.G. Mezey, J. Phys. Chem. A 106,\n11791 (2002).\n[24] D.W. Zhang, Y. Xiang, and J.Z.H. Zhang, J. Phys.\nChem. B 107, 12039 (2003).\n[25] S.H. Li, W. Li, and T. Fang, J. Am. Chem. Soc. 127,\n7215 (2005).\n[26] L.L. Huang, L. Massa, and J. Karle, Int. J. Quantum\nChem. 103, 808 (2005).\n[27] V. Deev and M.A. Collins, J. Chem. Phys. 122, 154102\n(2005).\n[28] R.P.A. Bettens and A.M. Lee, J. Phys. Chem. A 110,\n8777 (2006).\n[29] J. R̆ezác̆ and D.R. Salahub, J. Chem. Theory Comput.\n\nV.\n\nACKNOWLEDGMENTS\n\nWe acknowledge support from the Office of Basic Energy Sciences, U.S. Department of Energy, under grant\nNo.DE-FG02-10ER16196. This research was carried out\nin part at the Center for Functional Nanomaterials,\nBrookhaven National Laboratory, which is supported by\nthe U.S. Department of Energy, Office of Basic Energy\nSciences, under Contract No. DE-AC02-98CH10886.\n\n\f6\n6, 91 (2010).\n[30] S. Goedeker, Rev. Mod. Phys. 71, 1085 (1999).\n[31] Q. Wu, P.W. Ayers, and Y. Zhang, J. Chem. Phys. 131,\n164112 (2009).\n[32] F. Jensen, Introduction to Computational Chemistry, Wiley (1998).\n[33] P.R.T. Schipper, O.V. Gritsenko, and E.J. Baerends,\nTheor. Chem. Acc. 98, 16 (1997).\n\n[34] T. Heaton-Burgess, F. A. Bulat, and W. Yang, Phys.\nRev. Lett. 98, 256401 (2007).\n[35] A.J. Cohen, P.Mori-Sánchez, and W. Yang, J. Chem.\nPhys. 129, 121104 (2008).\n[36] J.P. Perdew, R.G. Parr, M. Levy, and J.L. Balduz, Jr.,\nPhys. Rev. Lett. 49, 1691 (1982).\n\n\f"}