{"id": "http://arxiv.org/abs/0904.4598v1", "guidislink": true, "updated": "2009-04-29T12:41:10Z", "updated_parsed": [2009, 4, 29, 12, 41, 10, 2, 119, 0], "published": "2009-04-29T12:41:10Z", "published_parsed": [2009, 4, 29, 12, 41, 10, 2, 119, 0], "title": "Modified Slim-Disk Model Based on Radiation-Hydrodynamic Simulation\n  Data: The Conflict Between Outflow and Photon Trapping", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0904.4919%2C0904.0731%2C0904.3630%2C0904.3011%2C0904.3252%2C0904.4322%2C0904.0664%2C0904.4510%2C0904.1150%2C0904.3117%2C0904.0834%2C0904.3138%2C0904.0269%2C0904.3095%2C0904.1536%2C0904.2136%2C0904.1428%2C0904.1574%2C0904.2386%2C0904.4599%2C0904.0955%2C0904.4716%2C0904.0247%2C0904.2508%2C0904.1401%2C0904.0644%2C0904.1381%2C0904.1106%2C0904.3848%2C0904.0966%2C0904.4754%2C0904.4469%2C0904.2978%2C0904.1125%2C0904.2422%2C0904.3600%2C0904.2971%2C0904.4408%2C0904.3757%2C0904.0637%2C0904.1999%2C0904.4533%2C0904.0044%2C0904.0167%2C0904.4052%2C0904.2477%2C0904.2747%2C0904.4348%2C0904.4911%2C0904.2805%2C0904.2333%2C0904.1679%2C0904.3577%2C0904.4460%2C0904.3946%2C0904.2558%2C0904.4598%2C0904.1852%2C0904.4637%2C0904.2575%2C0904.4043%2C0904.4536%2C0904.0765%2C0904.3764%2C0904.1273%2C0904.1094%2C0904.1735%2C0904.4663%2C0904.0288%2C0904.1828%2C0904.0931%2C0904.1873%2C0904.0770%2C0904.0342%2C0904.2199%2C0904.2415%2C0904.0784%2C0904.0501%2C0904.2411%2C0904.1165%2C0904.4750%2C0904.0951%2C0904.0547%2C0904.2178%2C0904.1585%2C0904.0560%2C0904.2160%2C0904.3578%2C0904.0956%2C0904.3688%2C0904.0215%2C0904.2031%2C0904.1550%2C0904.2490%2C0904.0942%2C0904.4086%2C0904.1884%2C0904.0195%2C0904.4764%2C0904.2675%2C0904.0139&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Modified Slim-Disk Model Based on Radiation-Hydrodynamic Simulation\n  Data: The Conflict Between Outflow and Photon Trapping"}, "summary": "Photon trapping and outflow are two key physics associated with the\nsupercritical accretion flow. We investigate the conflict between these two\nprocesses based on two-dimensional radiation-hydrodynamic (RHD) simulation data\nand construct a simplified (radially) one-dimensional model. Mass loss due to\noutflow, which is not considered in the slim-disk model, will reduce surface\ndensity of the flow, and if very significant, it will totally suppress photon\ntrapping effects. If the photon trapping is very significant, conversely,\noutflow will be suppressed because radiation pressure force will be reduced. To\nsee what actually occurs, we examine the RHD simulation data and evaluate the\naccretion rate and outflow rate as functions of radius. We find that the former\nmonotonically decreases, while the latter increases, as the radius decreases.\nHowever, the former is kept constant at small radii, inside several\nSchwarzschild radii, since the outflow is suppressed by the photon trapping\neffects. To understand the conflict between the photon trapping and outflow in\na simpler way, we model the radial distribution of the accretion rate from the\nsimulation data and build up a new (radially) one-dimensional model, which is\nsimilar to the slim-disk model but incorporates the mass loss effects due to\nthe outflow. We find that the surface density (and, hence, the optical depth)\nis much reduced even inside the trapping radius, compared with the case without\noutflow, whereas the effective temperature distribution hardly changes. That\nis, the emergent spectra do not sensitively depend on the amount of mass\noutflow. We conclude that the slim-disk approach is valid for interpreting\nobservations, even if the outflow is taken into account.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0904.4919%2C0904.0731%2C0904.3630%2C0904.3011%2C0904.3252%2C0904.4322%2C0904.0664%2C0904.4510%2C0904.1150%2C0904.3117%2C0904.0834%2C0904.3138%2C0904.0269%2C0904.3095%2C0904.1536%2C0904.2136%2C0904.1428%2C0904.1574%2C0904.2386%2C0904.4599%2C0904.0955%2C0904.4716%2C0904.0247%2C0904.2508%2C0904.1401%2C0904.0644%2C0904.1381%2C0904.1106%2C0904.3848%2C0904.0966%2C0904.4754%2C0904.4469%2C0904.2978%2C0904.1125%2C0904.2422%2C0904.3600%2C0904.2971%2C0904.4408%2C0904.3757%2C0904.0637%2C0904.1999%2C0904.4533%2C0904.0044%2C0904.0167%2C0904.4052%2C0904.2477%2C0904.2747%2C0904.4348%2C0904.4911%2C0904.2805%2C0904.2333%2C0904.1679%2C0904.3577%2C0904.4460%2C0904.3946%2C0904.2558%2C0904.4598%2C0904.1852%2C0904.4637%2C0904.2575%2C0904.4043%2C0904.4536%2C0904.0765%2C0904.3764%2C0904.1273%2C0904.1094%2C0904.1735%2C0904.4663%2C0904.0288%2C0904.1828%2C0904.0931%2C0904.1873%2C0904.0770%2C0904.0342%2C0904.2199%2C0904.2415%2C0904.0784%2C0904.0501%2C0904.2411%2C0904.1165%2C0904.4750%2C0904.0951%2C0904.0547%2C0904.2178%2C0904.1585%2C0904.0560%2C0904.2160%2C0904.3578%2C0904.0956%2C0904.3688%2C0904.0215%2C0904.2031%2C0904.1550%2C0904.2490%2C0904.0942%2C0904.4086%2C0904.1884%2C0904.0195%2C0904.4764%2C0904.2675%2C0904.0139&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Photon trapping and outflow are two key physics associated with the\nsupercritical accretion flow. We investigate the conflict between these two\nprocesses based on two-dimensional radiation-hydrodynamic (RHD) simulation data\nand construct a simplified (radially) one-dimensional model. Mass loss due to\noutflow, which is not considered in the slim-disk model, will reduce surface\ndensity of the flow, and if very significant, it will totally suppress photon\ntrapping effects. If the photon trapping is very significant, conversely,\noutflow will be suppressed because radiation pressure force will be reduced. To\nsee what actually occurs, we examine the RHD simulation data and evaluate the\naccretion rate and outflow rate as functions of radius. We find that the former\nmonotonically decreases, while the latter increases, as the radius decreases.\nHowever, the former is kept constant at small radii, inside several\nSchwarzschild radii, since the outflow is suppressed by the photon trapping\neffects. To understand the conflict between the photon trapping and outflow in\na simpler way, we model the radial distribution of the accretion rate from the\nsimulation data and build up a new (radially) one-dimensional model, which is\nsimilar to the slim-disk model but incorporates the mass loss effects due to\nthe outflow. We find that the surface density (and, hence, the optical depth)\nis much reduced even inside the trapping radius, compared with the case without\noutflow, whereas the effective temperature distribution hardly changes. That\nis, the emergent spectra do not sensitively depend on the amount of mass\noutflow. We conclude that the slim-disk approach is valid for interpreting\nobservations, even if the outflow is taken into account."}, "authors": ["Shun Takeuchi", "Shin Mineshige", "Ken Ohsuga"], "author_detail": {"name": "Ken Ohsuga"}, "author": "Ken Ohsuga", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1093/pasj/61.4.783", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0904.4598v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0904.4598v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "15 pages, 5 figures, accepted for publication in PASJ", "arxiv_primary_category": {"term": "astro-ph.HE", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph.HE", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0904.4598v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0904.4598v1", "journal_reference": null, "doi": "10.1093/pasj/61.4.783", "fulltext": "Modified Slim-Disk Model Based on Radiation-Hydrodynamic\nSimulation Data:\n\narXiv:0904.4598v1 [astro-ph.HE] 29 Apr 2009\n\nThe Conflict Between Outflow and Photon Trapping\nShun TAKEUCHI, Shin M INESHIGE\nDepartment of Astronomy, Graduate School of Science, Kyoto University, Sakyo-ku, Kyoto 606-8502\n\nand\nKen O HSUGA\nNational Astronomical Observatory of Japan, Osawa, Mitaka, Tokyo 181-8588\nE-mail (ST): shun@kusastro.kyoto-u.ac.jp\n(Received 0 0; accepted 0 0)\n\nAbstract\nPhoton trapping and outflow are two key physics associated with the supercritical\naccretion flow. We investigate the conflict between these two processes based on twodimensional radiation-hydrodynamic (RHD) simulation data and construct a simplified\n(radially) one-dimensional model. Mass loss due to outflow, which is not considered in\nthe slim-disk model, will reduce surface density of the flow, and if very significant, it will\ntotally suppress photon trapping effects. If the photon trapping is very significant, conversely, outflow will be suppressed because radiation pressure force will be reduced. To\nsee what actually occurs, we examine the RHD simulation data and evaluate the accretion\nrate and outflow rate as functions of radius. We find that the former monotonically decreases, while the latter increases, as the radius decreases. However, the former is kept\nconstant at small radii, inside several Schwarzschild radii, since the outflow is suppressed\nby the photon trapping effects. To understand the conflict between the photon trapping\nand outflow in a simpler way, we model the radial distribution of the accretion rate from\nthe simulation data and build up a new (radially) one-dimensional model, which is similar\nto the slim-disk model but incorporates the mass loss effects due to the outflow. We find\nthat the surface density (and, hence, the optical depth) is much reduced even inside the\ntrapping radius, compared with the case without outflow, whereas the effective temperature\ndistribution hardly changes. That is, the emergent spectra do not sensitively depend on the\namount of mass outflow. We conclude that the slim-disk approach is valid for interpreting\nobservations, even if the outflow is taken into account. The observational implications of\nour findings are briefly discussed in relation to ultra-luminous X-ray sources.\nKey words: accretion, accretion disks - hydrodynamics - black hole physics -\n1\n\n\fradiation mechanisms: general - stars: winds, outflows\n\n1.\n\nIntroduction\n\nSupercritical (or super-Eddington) accretion onto black holes remains one of the most fundamental, classical issues in the present-day astrophysics and is now discussed in wide fields of astrophysics (see Chapter 10 of Kato et al. 2008 for a concise review). It is well known for the case of\nspherical accretion that there is an upper limit to the luminosity; that is the Eddington luminosity,\nLE . It is thus impossible for gas to accrete onto a black hole at a rate exceeding the critical accretion rate, Ṁcrit [≡ LE /(ηc2 )] where c is the speed of light, η is the efficiency. Then, how about the\ncases of disk accretion? Is the supercritical accretion (accretion at a rate exceeding the Eddington\nrate) feasible? This is the enigmatic issue and has been discussed from the 1970's by many authors,\nincluding Shakura & Sunyaev (1973), but it still remains as a controversial issue because of technical\ndifficulties by the analytical approach. One of the reasons for these technical difficulties stems from\nthe multi-dimensional properties of the supercritical accretion flow.\nThere are two key processes which appear when the disk luminosity approaches the Eddington\nluminosity: photon trapping and radiation pressure-driven outflow, and both are multi-dimensional\neffects. At very high luminosity, the accretion rate should also be very high, and so is the optical\ndepth. Then, the photon diffusion timescale in the vertical direction may become shorter than the\naccretion time of gas. If this happens, photons generated deep inside the accretion flow are not able to\nreach the surface before the material is swallowed by a black hole. This is the photon trapping effects\n(Katz 1977; Begelman 1978; Begelman & Meier 1982; Flammang 1984; Blondin 1986; Colpi 1988;\nWang & Zhou 1999; Ohsuga et al. 2002). Furthermore, the flow of high luminosities are supported\nby radiation pressure, which is likely to induce outflow (Bisnovatyi-Kogan & Blinnikov 1977; Meier\n1979; Icke 1980; Tajima & Fukue 1998). For complete understanding of the supercritical accretion\nflow, we need to solve the multi-dimensional radiation-hydrodynamic (RHD) equations. This has\nbecome possible quite recently thanks to the rapid developments of high-speed computers.\nOhsuga et al. (2005) were the first to succeed in the global RHD simulations of the supercritical\naccretion flow until the flow settles down on the quasi-steady phase. They have demonstrated that the\naccretion rate can be arbitrarily high, that the Eddington luminosity can be exceeded, and that the\nluminosity increases with an increase of the mass input rate in a logarithmic fashion (see also Ohsuga\n2006). The reason for the occurrence of super-Eddington luminosity is the combination of two effects:\nsignificant radiation anisotropy and photon trapping (Ohsuga & Mineshige 2007).\nThe slim-disk model was proposed by Abramowicz et al. (1988) as a simplified model of\nsupercritical accretion flow. This model is constructed on (radially) the one-dimensional formulation,\nlike Shakura & Sunyaev (1973), and the photon trapping effects are expressed as the (radial) advection\nof radiation entropy, though the outflow effect is not considered. Despite this weakness this model has\n2\n\n\fbeen used by many authors as a \"standard model\" of the supercritical accretion because of its technical\nsimplicity (e.g., Szuszkiewicz et al. 1996; Beloborodov 1998; Watarai & Fukue 1999; Mineshige et\nal. 2000; Fukue 2000; Watarai et al. 2000; Kawaguchi 2003; Gu & Lu 2007).\nIt is not easy to construct one-dimensional models (like the slim-disk model) which incorporate both of photon trapping and outflow effects, since the combined effects are essentially multidimensional. There have been several attempts (e.g., Lipunova 1999; Kitabatake et al. 2002; Fukue\n2004; Kohri et al. 2007; Poutanen et al. 2007), but these studies rely on simplifications and assumptions. It will be much more preferable to study this issue by using the multi-dimensional RHD simulations, but such simulations are expensive and it is not easy to gain physical insight from simulation\ndata. In the present study we thus construct a one-dimensional model as an extension of the slim-disk\nmodel based on the information regarding the conflict between photon trapping and outflow, which\nwe gain from the simulation data. Our goal is to examine how the flow structure and its appearance\nare affected by the counteracting effects of photon trapping and outflow.\nThe plan of this paper is as follows: In the next section, we overview the RHD simulations of\nsupercritical accretion flow and calculate the accretion rate and the mass outflow rate of the simulated\nflow. In section 3, we present our improved slim-disk model and see some details of the flow structure.\nWe then discuss several important effects of the supercritical flow based on our simple model. The\nfinal section is devoted to summary.\n2.\n2.1.\n\nSupercritical Accretion Flows\nBasic Considerations\n\nThrough the studies based on the slim-disk model two key observational signatures of the\nsupercritical flow have become clear: smaller innermost radius and the flatter temperature profile\n(Watarai et al. 2000). The former is because of large amount of accreting material existing even\ninside the radius of the innermost stable circular orbit (ISCO), emitting significant radiation (see also\nWatarai & Mineshige 2003). The latter is due to the suppression of the radiation flux by photon\ntrapping.\nThe emergent flux distribution of the standard-type disks is determined by the energy balance,\nwhich is approximately expressed by\nGM Ṁacc\n∝ R−1 .\n(1)\nR\nThis gives the relation, Teff ∝ R−3/4 . Here, σ, G, M, and Ṁacc represent, respectively, the StefanBoltzmann constant, the gravitational constant, mass of the central black hole, and the mass accretion\nrate.\nIn the slim-disk model, by contrast, the advection effects, the relative importance of which\nincrease inward as tdiff /tacc ∝ R−1 (see Kato et al. 2008, Chap. 10), should be considered. As a\nresult, the flux distribution becomes\n4\n2πR2 * σTeff\n∝\n\n3\n\n\f4\n2πR2 * σTeff\n∝\n\nGM Ṁacc tacc\n*\n∝ R0 ,\nR\ntdiff\n\n(2)\n\nwhich lead to a somewhat flatter temperature profile, Teff ∝ R−1/2 . Here, tacc (= −R/vR ) and tdiff (=\n3Hτ /c) represent the accretion timescale and photon diffusion timescale (in the vertical direction),\nrespectively, and vR , H, and τ are radial velocity, scale-height of the disk, and optical thickness of the\ndisk, respectively. The occurrence of photon trapping gives rise to a critical radius, trapping radius\n(Rtrap ), inside which photon trapping is significant, and it is expressed as\nH\n(3)\nRtrap ≈ (Ṁacc c2 /LE ) rs ,\nR\nwhere rs (= 2GM/c2 ) is the Schewarzschild radius.\nCautions should be taken to the fact that the slim-disk model does not perfectly describe the\nproperties of the supercritical accretion flow, since outflow, one of the most important properties of\nthe supercritical flow, is not considered. The mass accretion rate is, hence, set to be constant in\nspace in the slim-disk formulation. However, it is likely to decrease inward due to the mass loss\nby the outflow. In the limit of significant mass loss by the outflow, surface density (and thus the\noptical depth) of the accretion flow will be much reduced, which may result in the total suppression\nof the photon trapping effects. That is, the slim-disk model breaks down. In the limit of significant\nphoton trapping, conversely, (outward) radiation pressure force will be weakened (or may become\neven inward, see Ohsuga & Mineshige 2007), and the mass loss by the radiation pressure-driven\noutflow will be negligible. Which is likely to be the case? Which process will dominate?\nWe wish to note that the slim-disk model is not the only models of the supercritical accretion.\nShakura & Sunyaev (1973) already discussed the supercritical flow and considered standard-type\ndisks with large outflow. They assumed that flux from each radius F (R) cannot exceed the value\nthat gives the Eddington luminosity, i.e., roughly 2πR2 F (R) = LE within certain radius, called the\nspherization radius, Rsph (see also Begelman 1979). Using the standard-disk relation [Eq. (1)], we\ncan easily derive\nRsph ≈ (Ṁacc c2 /LE ) rs\n\n(4)\n\nInside this radius, the mass accretion rate decreases inward in proportion to the radius; i.e., Ṁacc ∝ R.\nThis means, the accretion rate vanishes at a very small R, and we again have a somewhat flatter\n4\ntemperature profile, Teff ∝ R−1/2 , since 2πR2 * σTeff\n∝ Ṁacc /R ∼ const.\nComparing equations (3) and (4), one can notice that the critical radii for the photon trapping\nand outflow are on the same order because H ∼ R. In other words, both effects could be equally\nimportant in the supercritical flow. In addition, the apparent effective temperature profiles are same\nfor both cases. That is, we cannot simply conclude which effect dominates by looking at the observed\nspectra.\nTheoretically speaking, however, there is a big difference. The photon trapping is more important near the equatorial plane, since it takes longer time for photons to travel from the equatorial\nplane, than from the middle part of the disk, to the disk surface, while outflow occurs from the disk\n4\n\n\fsurface. This indicates that both effects can be simultaneously significant but at different heights. We\nthus need to carefully examine multi-dimensional simulation data.\n2.2.\n\nModel and Simulated Flow\n\nWe simulate the supercritical accretion flow, by using the two-dimensional RHD code developed by Ohsuga et al. (2005). The basic equations and the numerical method are described in details\nin Ohsuga et al. (2005). Hence we briefly summarize them. We use spherical coordinates (r, θ, φ),\nwhere r, θ, and φ are the radial distance, the polar angle, and the azimuthal angle, respectively, and\nset a non-rotating black hole at the origin. To mimic the general relativistic effects, we adopt the\npseudo-Newtonian potential, ψ given by ψ = −GM/(r − rs ) (Paczyński & Wiita 1980). As to the\nflow structure we assume the axisymmetry (i.e., ∂/∂φ = 0) and the reflection symmetry relative to\nthe equatorial plan (with θ = π/2). To solve the radiative transfer, we apply a flux-limited diffusion\n(FLD) approximation developed by Levermore & Pomraning (1981). This approximation is that the\nradiative flux and the radiation pressure tensor are expressed in terms of the radiation energy density\n(Turner & Stone 2001; Ohsuga et al. 2005).\nA difference between the present calculation and Ohsuga et al. (2005) is in the computational\ndomain. Our purpose in this study is to examine the conflict between outflow and photon trapping.\nTherefore, we have to simulate the supercritical accretion flow in a wider spatial range. Thus, we set\nthe computational domain spherical shells of 3 rs ≤ r ≤ 1000 rs and 0 ≤ θ ≤ π/2 and it is divided into\n96 × 96 grid cells, (Note that the computational domain of Ohsuga et al. 2005 was 3 rs ≤ r ≤ 500 rs .)\nWe start the calculations with a hot, rarefied, and optically thin atmosphere. There is no cold dense\ndisk initially, and we assume steady mass injection into the computational domain through the outer\ndisk boundary (r = 1000 rs , 0.45π ≤ θ ≤ 0.5π). The injected matter is supposed to have a specific\nangular momentum corresponding to the Keplerian angular momentum at r = 500rs (cf. r = 100rs in\nOhsuga et al. 2005), and we set the injected mass-accretion rate (mass input rate) Ṁinput to be constant\nin time. Throughout the present simulation, we assume M = 10M⊙ , α = 0.1, γ = 5/3, μ = 0.5, and\nZ = Z⊙ . Here α, γ, μ, and Z are the viscous parameter, the specific heat ratio, the mean molecular\nweight, and the metallicity, respectively.\nFigure 1 indicates the color contours of the matter density (left panel) and the radial inflow\nvelocity (right panel) distribution in the meridional plane, which are time-averaged over t = 190 −\n250 [s] in the case of Ṁinput = 1000 LE /c2 . In the right panel the radial inflow velocity is normalized\nby the escape velocity and the region with white color indicates the outflow region, i.e., vr > 0. The\nsupercritical accretion flow forms at r ≤ 350 rs . The disk accretion of the high density gas and the\noutflow of the low density one are clear. In the previous calculation, the supercritical accretion flow\n< 80rs . The behavior of the present simulated flow in this region is roughly consistent with\nforms at r ∼\nthat of the previous one (Ohsuga et al. 2005; see also Ohsuga & Mineshige 2007).\n\n5\n\n\fFig. 1. Color contours of the matter density (left) and the radial inflow velocity (right) distribution in the meridional\nsection. Note that these values are time-averaged over t = 190 − 250 [s].\n\nFig. 2. Schematic picture for the calculation of mass-accretion/outflow rate.\n\n2.3.\n\nMass Accretion/Outflow Rate\n\nWe assume that an accretion flow occurs in the region of θdisk ≤ θ ≤ π/2, while outflow region\ncorresponds to the region above the accretion flow region, and determine an angle θdisk (> 0) from the\nsimulation data. That is, θdisk is chosen so as to roughly coincide with the angle between the z-axis\nand the boundary separating the region with radial inflow (negative velocity) and that of the positive\nvelocity (figure 2). On the basis of this assumption, we calculated the mass accretion rate and the\ncumulative mass outflow rate as functions of radius. Since the quasi-steady flows form at r ≤ 350 rs ,\nwe set in this calculation the outer radius of the flows to be rwind = 350 rs .\nWe then calculate the accretion rate, Ṁacc (r), and the cumulative mass outflow rate, Ṁout (r),\nby\n90◦\n\nṀacc (r) ≡\n\nZ\n\nṀout (r) ≡\n\nZ\n\nrwind\n\nθdisk\n\n4πr 2 ρvr sin θ dθ,\n\n(5)\n\nand\nr\n\n4πr ′ ρvθ |θdisk sin θdisk dr ′.\n6\n\n(6)\n\n\fIn figure 3, we show the accretion rate and mass outflow rate as functions of radius in the simulated flows for Ṁinput = 1000LE /c2 (left panel) and Ṁinput = 3000LE /c2 (right panel), respectively.\nThese values are normalized by the Eddington accretion rate, i.e., LE /c2 . Here, the disk inclination\nangle is chosen to be θdisk = 70◦ in the case of Ṁinput = 1000 LE /c2 , and θdisk = 60◦ in the case of\nṀinput = 3000 LE /c2 . In each panel, the solid, dashed, and dotted curves represent the accretion rate,\nṀacc (r), the cumulative mass outflow rate, Ṁout (r) , and the sum of the these rates, respectively. In\nparticular, the following mass conservation should hold,\nṀacc (rwind ) = Ṁacc (r) + Ṁout (r) = const.\n\n(7)\n\nWe confirm this relation within errors less than 4%. The reason why Ṁacc (rwind ) < Ṁinput is because\na part of injected gases accumulates at rwind < r < 1000 rs or goes out to the outer region of the\ncomputational domain without accreting immediately.\nThe accretion rate is not constant in space due to the mass loss by outflows. In the analytical\naccretion flow model, in which an outflow is considered, the accretion rate decreases inward in proportion to the radius, i.e., Ṁacc ∝ r (e.g., Shakura & Sunyaev 1973). That is, the accretion rate should\nvanish at a very small radius. However, we find that the accretion rates still have a finite value at small\nradii, inside several Schwarzschild radii. This is because the emergence of outflow is suppressed due\nto the attenuation of radiation flux by photon trapping. In fact, the radiation flux become even negative (inward) at these radii (Ohsuga & Mineshige 2007). The outflows are difficult to blow off and\nthus the flow is easy to be accreted towards the central black hole.\n< 300 rs . As we evaluated the\nIn the case of Ṁinput = 1000 LE /c2 , the outflow blows off at r ∼\n< 150 rs\nphoton trapping radius by equation (3), we found that the photon trapping is effective at r ∼\nfor a mass accretion rate of Ṁacc (rwind = 350 rs ) = 364 LE /c2 . In the case of Ṁinput = 3000 LE /c2 , in\ncontrast, the outflow and photon trapping is already effective at rwind = 350rs . Thus, we confirmed that\nthe critical radii for the photon trapping and outflow are on the same order in the RHD simulations.\nNote that this is only a rough estimate, since we assumed constant accretion rate in the derivation.\n3.\n\nModified Slim-Disk Model\n\nOn the basis of the simulation data analysis presented in the previous section, we try to construct a modified slim-disk model, which incorporates the effects of the mass loss by an outflow, in\nthis section. The accretion flow models which incorporate the mass loss effect were proposed by\nseveral researchers (Lipunova 1999; Kitabatake et al. 2002; Fukue 2004; Poutanen et al. 2007). They\nevaluate the outflow by adopting the spherization radius. By contrast, we construct a model by using\nthe accretion rate obtained in the previous section.\n3.1.\n\nBasic Equations\n\nWe use cylindrical coordinates (R, φ, z) in this section. We assume steady and axisymmetric\nflow, and non-rotating black hole, and adopt a pseudo-Newtonian potential. We use height-integrated\n7\n\n\fFig. 3. The accretion rate and cumulative mass outflow rate as functions of radius in the simulated flows in the case\nof Ṁinput = 1000LE/c2 (left) and Ṁinput = 3000LE/c2 (right) . The solid, dashed, and dotted curves represent the\naccretion rate Ṁacc (r), mass outflow rate Ṁout (r) , and the sum of the these rates, respectively. The data of both\nsimulated flows is time-averaged over t = 190 − 250 [s]. The accretion rates at the outer radius rwind (= 350 rs ) are\nṀacc (rwind ) = 364 LE/c2 (left) and 828 LE/c2 (right). The shadowed areas indicate the photon trapping region.\nH\nH\nquantities, such as Σ = −H\nρ dz = 2IN ρH and Π = −H\np dz = 2IN+1 pH. Here, ΣAΠAp, and H\nare the surface density , height-integrated pressure, total pressure, and scale height, respectively. The\ncoefficient IN and IN+1 were introduced by Hōshi (1977). The density and the pressure are related to\neach other by the polytropic relation, p ∝ ρ1+1/N . We assign N = 3 throughout the entire calculation\n(i.e., I3 = 16/35 and I4 = 128/315).\nThe continuity equation, the radial component of the momentum equation, the angular momentum conservation, the hydrostatic equilibrium in the vertical direction, the energy equation, and\nequation of state are written as follows:\n\nR\n\nR\n\nṀacc (R) = Ṁacc (Rwind ) − Ṁout (R),\n\n(8)\n\ndvR 1 dΠ l2 − l2K Π dlnΩK\n+\n=\n−\n,\ndR Σ dR\nR3\nΣ dR\nṀacc (l − lin) = −2πR2 TRφ ,\nvR\n\nΠ\n= H 2 Ω2K ,\nΣ\n−\n−\nQ+\nvis = Qrad + Qadv ,\n(2N + 3)\n\n(9)\n(10)\n(11)\n(12)\n\n2\nkB IN+1\nΣTc + IN+1 aTc4 H.\n(13)\nμ̄mH IN\n3\nHere, the flow velocity of radial component and azimuthal one are expressed by vR and vφ , respectively, the angular momentum of the gas is given by l(= Rvφ = R2 Ω), Ω and ΩK are the angular\nspeed of rotation and the Keplerian angular speed, lK and lin are Keplar angular momentum and the\nangular momentum at inner radius of the flow, TRφ (≡ −αΠ) is vertically integrated stress tensor with\nΠ = Πgas + Πrad =\n\n8\n\n\fα being the viscosity parameter (Shakura & Sunyaev 1973), Πgas and Πrad are the gas pressure and\nthe radiation pressure, and mH , Tc , kB , and a are the hydrogen mass, the temperature on the equatorial plane, the Boltzmann constant, and the radiation constant, respectively. The last term on the\nright-hand side of equation (9) is a correction term resulting from the fact that the radial component\nof the gravitational force changes with height (Matsumoto et al. 1984).\n−\nIn the energy equation (12), the viscous heating rate Q+\nvis , the radiative cooling rate Qrad , and\nthe advective cooling rate Q−\nadv are defined by\ndΩ\n,\n(14)\nQ+\nvis = −R TRφ\ndR\n16acTc4\n−\n,\n(15)\nQrad = 2F =\n3τ\n9\nds\nQ−\n,\n(16)\nadv = vR ΣTc\n8\ndR\nwhere F is the radiative flux per unit surface area on the flow surface, s is the specific entropy, and\nτ is the optical thickness of the flow given by τ = (κes + κff )Σ. κes (= 0.4) is the electron scattering\nopacity, κff (= 0.64 × 1023 ρ̄T̄ −7/2 ) is the free-free absorption opacity, and ρ̄ and T̄ are the vertically\naveraged density and the temperature, respectively. Note that Jiao et al. (2009) point out that the usage\nof equation (11) may lead to overestimation of gravity force when the scaleheight is comparable to\nthe radius, H ∼ R.\nWe wish to note that the difference between the equations of the original slim-disk model\nand those of our model is only in the continuity equation (8). In the original slim-disk model, the\ncontinuity equation is expressed by Ṁacc (R) = const. The reason why the forms of equations (9)(13) do not change is because these expressions are written per unit mass. While Lipunova (1999)\nexplicitly expresses the outflow effect in her equations, the physical meanings of the equations are\nthe same as own (see also Kitabatake et al. 2002). The difference between the previous models and\nour model is that we construct a model which realistically considers the outflow effect by using the\naccretion rate in the previous section. In the previous study, moreover, the flow is approximated to be\nKeplarian (Lipunova 1999; see also Poutanen et al. 2007) or assumed to obey a self-similar solution\n(Kitabatake et al. 2002; see also Fukue 2004), whereas we solve numerically the radial advection, i.e.,\nequation (9) and (12). However, we need to take into account the work exerted on the outflow by the\naccretion flow material. This issue will be discussed in the next section.\nThe calculations were performed from the outer radius at R = 1 × 104 rs down to the inner radius, R ∼ 1.0 rs . In our modified slim-disk model, we approximate Ṁacc (R) = Ṁacc (r) and\nṀout (R) = Ṁout (r) within R = 350 rs . Since the range of the accretion rate which is obtained\nby the simulation in the previous section is at R ≤ 350 rs , we assume that the accretion rate at\nR = 350 rs − 104 rs is constant, i.e., Ṁacc (R′ ) = Ṁacc (Rwind ) = Ṁacc (rwind ) for 350 rs ≤ R′ ≤ 104 rs .\nIn the original slim-disk model, in contrast, Ṁacc (R) = Ṁacc (Rwind ) in the whole radius. We set the\nblack hole mass and the viscous parameter to be M = 10M⊙ and α = 0.1, respectively. We also set\nṀacc (Rwind ) = 364 LE /c2 and 828 LE /c2 .\n9\n\n\f105\n\nΣ [g/cm2]\n\nΣ [g/cm2]\n\n105\n\n104\n\n103\n\n104\n\n103\n\nwithout outflow\nwith outflow\n102\n100\n\n101\n\n102\n\nwithout outflow\nwith outflow\n102\n100\n\n103\n\n101\n\nR/rs\n108\nwithout outflow\nwith outflow\n\nwithout outflow\nwith outflow\n\nR−1/2\n\n107\n\nTeff [K]\n\nTeff [K]\n\n103\n\nR/rs\n\n108\n\n106\n\n100\n\n102\n\nR−1/2\n\n107\n\n106\n\n101\n\n102\n\n103\n\n100\n\nR/rs\n\n101\n\n102\n\n103\n\nR/rs\n\nFig. 4. The surface density Σ and the effective temperature Teff as functions of radius in the modified\nslim-disk model (dashed lines) and the original slim-disk model (solid lines) for Ṁinput = 1000 LE/c2 (left) and\nṀinput = 3000 LE/c2 (right) .\n\n3.2.\n\nFlow Structure\n\nFigure 4 indicate the surface density and the effective temperature as functions of radius in the\nmodified slim-disk model (dashed lines) and the original slim-disk model (solid lines) for Ṁinput =\n1000 LE /c2 (left panels) and Ṁinput = 3000 LE /c2 (right panels), respectively. The surface density of\nthe flow is significantly reduced due to the mass loss by outflow in both cases (see figure 3). Hence,\nthe optical depth of the flow τ (∝ Σ) also is reduced by a factor of two or three. However, the flow\nis optically thick in the whole region. Even though the mass accretion rate decreases as the radius\ndecreases, the trapping radius derived from the mass accretion rate at any radius exceeds that radius;\ni.e., photon trapping is effective.\nWe quantitatively examine the effect of photon trapping, i.e., we calculate the relative importance of the advective cooling in the energy equation. We derive the relation between tdiff /tacc and\n+\nQ−\nadv /Qvis . The advective cooling rate are expressed by\n10\n\n\f1.0\n\n0.8\n\n0.8\n\n+\nQ−\nadv /Qvis\n\n+\nQ−\nadv /Qvis\n\n1.0\n\n0.6\n0.4\n0.2\n0\n101\n\n102\n\n0.4\n0.2\n0\n\nwithout outflow\nwith outflow\n\n-0.2\n100\n\n0.6\n\n-0.2\n100\n\n103\n\nR/rs\n\nwithout outflow\nwith outflow\n101\n\n102\n\n103\n\nR/rs\n\n+\nFig. 5. Ratio of the advective cooling rate Q−\nadv to the viscous heating rate Qvis as functions of radius in the\nmodified slim-disk model (dashed lines) and the original slim-disk model (solid lines) for Ṁinput = 1000 LE/c2\n(left) and Ṁinput = 3000 LE/c2 (right) .\n\nQ−\nadv\n\n!\n\n9 vR\n3 vR\np\n∼−\n=−\nΣ e−\nHaTc4 ,\n8R\nρ\n2R\n\n(17)\n\nwhere e is the specific energy. Here, we used e = aTc4 /ρ and p = aTc4 /3. Therefore, the condition of\neffective photon trapping (tdiff /tacc > 1) is derived by\n32\n32 Q−\nQ−\ntdiff\nadv\nadv\n=\n> 1.\n− =\n+\ntacc\n3 Qrad\n3 Qvis − Q−\nadv\nAs a result, this gives the relation,\n3\nQ−\nadv\n∼ 0.09.\n+ >\nQvis\n35\n\n(18)\n\n(19)\n\n+ >\nThat is, photon trapping is effective at Q−\nadv /Qvis ∼ 0.09.\n+\nIn figure 5, we show the ratio, Q−\nadv /Qvis , for each model. In the case of the original slim-disk\n< 100rs .\nmodel, in which the outflow is not considered, photon trapping is significantly effective at R ∼\nIn the case of the modified slim-disk model, however, the advective cooling rate is smaller due to the\nmass loss by outflow (Q−\nadv ∝ Σ), and so is the ratio. Hence, the photon trapping effect is weaker in\nthe model, but the outflow is not strong enough to totally suppress photon trapping at the smaller radii\n+\n(Q−\nadv /Qvis ∼ 0.4 − 0.6). At the larger radius, there is no difference between the two models because\nthere is no outflow.\nIn addition, we understand from figure 4 that, even if outflow effects are taken into account, the\neffective temperature profiles do not change. It is Teff ∝ r −1/2 at the smaller radius, and Teff ∝ r −3/4\nat the larger radius. Why is then the effective temperature profile unchanged? This is because it is\n+ >\ndetermined by the photon trapping at small radii (note that photon trapping is effective at Q−\nadv /Qvis ∼\n0.09), while no significant outflow occurs at large radii .\nKitabatake et al. (2002) construct a model for supercritical accretion flows with mass loss,\n\n11\n\n\fadopting the self-similar treatment proposed by Narayan & Yi (1994). They mention that the effective\ntemperature profile of the flow is negligibly affected by occurrence of outflow in the case of advectivedominated flows (see also Fukue 2004). The reason is as follows. When the radiative flux F (= σTc ∝\nΠ) is reduced by the mass loss, optical depth τ (∝ Σ) is reduced at the same time. As a result, the\neffective temperature of the flow Teff (= Tc τ −1/4 ) does not depend on the mass loss. This provides\nanother explanation for the flatter temperature distribution.\n< 3rs , the advective cooling rate becomes negative. The reason is as follows.\nIn the region at R ∼\nThe optical depth of the flow τ (∝ Σ) steeply decreases inward in that region, although the flow is\n−1\noptically thick (see figure 4). Therefore, the radiative cooling rate Q−\n) steeply increases\nrad (∝ τ\n+\ninward, whereas the viscous heating rate (Qvis ∝ Ṁacc ) does not. As a result, the advective cooling\n+\n−\nrate should become negative, since Q−\nadv = Qvis − Qrad .\n4.\n4.1.\n\nDiscussion\nBrief summary\n\nIn this paper, we first carefully examined the global RHD simulation data of supercritical\naccretion flow onto black holes in order to examine the conflict between photon trapping and outflow.\nWe have confirmed that both are equally important; i.e., despite significant mass loss by the outflow,\nit is not strong enough to totally suppress photon trapping. We evaluated the accretion and outflow\nrates as functions of radius based on the simulation data and put them into the formulation of the slimdisk model, in which no outflows were considered originally and hence the mass accretion rate was\nconsidered to be constant. We compared the resultant flow structure with consideration of outflow\nby those without consideration of outflow, finding that, although surface density (and, hence, optical\ndepth) of the flow is significantly reduced, the effective temperature profile is negligibly affected\nby the occurrence of outflow. Therefore, multi-blackbody spectra are negligibly affected, either.\nThis has a profound implication when one performs spectral fitting of black hole objects, notably\nof Ultraluminous X-ray Sources (ULXs, see subsection 4.3).\nWe here remark on the reasons why we stick to the one-dimensional model, when multidimensional simulation data are available. There are a number of reasons for this. Although it has\nbecome possible to simulate the flow from the first principle, they are still subject to numerical errors\nand limitations arising from the finite mesh spacing. Also, it is not always easy to specify the physical\nprocesses from the vast simulation data with substantial fluctuations and numerical errors. Further,\nmulti-dimensional RHD simulations are very expensive and time-consuming. That is, it is impossible\nto perform extensive parameter studies. Therefore, studies based on simplified (one-dimensional)\nmodels like the present one should be useful and beneficial for understanding the physics.\n4.2.\n\nWork exerted on outflow\n\nIn our simplified one-dimensional model, we consider loss of mass, angular momentum, and\nenergy by outflow. These effects are incorporated by spatial variation of the mass accretion rate. I.e.,\n12\n\n\fwe considered angular momentum and energy loss carried by outflow material, assuming specific\nangular momentum and specific energy are the same for the outflow and the accretion flow. There\nexists, however, another important factor which should be include in the energy equation; that is the\nwork exerted on the outflow by the disk material, Q−\nwind . Obviously, outflow cannot have positive\nenergy to reach the infinity without acquiring additional energy by the underlying accretion flow.\nPoutanen et al. (2007), for example, include this effect by assuming that radiative loss of the accreting\nmaterial is partly transferred to the outflow.\nTo see how our results are affected by this additional energy loss, we reduce the specific energy\n−\nof accretion flow by hand, assuming Q−\nwind = Qrad . The results are that the effective temperature\nprofile hardly varies, even though the amount of mass loss decreases. Our conclusion of unchanged\ntemperature profile is not altered.\n4.3.\n\nModel for Ultraluminous X-Ray Sources\n\nULXs are bright, compact X-ray sources found in the off-center region of nearby galaxies.\nTheir luminosities are typically, LX ∼ 1039−41 [erg/s], and, hence, exceed the Eddington luminosity of\na neutron star (Fabbiano 1989). There are two hypotheses for the origin of ULXs. If the luminosity\nis below the Eddington luminosity, it then follows that the mass of the central black holes of ULXs\nshould be intermediate-mass black hole (IMBH), whose masses range over 102−4 M⊙ . If the luminosity can be above the Eddington luminosity, conversely, stellar-mass black holes can also account\nfor the luminosities. Unfortunately, the kinematic method, which is very powerful to estimate the\nblack hole masses in binary systems, is not applied to the ULXs because no appreciable (optical) line\nfeatures are observed.\nInterestingly, ULXs share similar spectral features with the black hole binaries (Colbert &\nMushotzky 1999; Makishima et al. 2000; see review by Done et al. 2007). Therefore, it seems possible\nto estimate the black hole mass through the spectral fitting, although the results look controversial.\nSome authors claim that the ULXs should have IMBHs. This is because the obtained blackbody\ntemperature is low, on the order of ∼ 0.1 keV (Cropper et al. 2004; Miller et al. 2004; Roberts et al.\n2005). (The blackbody temperature is proportional to M −1/4 for the same Eddington ratio.) Some\nothers claimed that the ULXs should contain stellar-mass black holes (King et al. 2001; Watarai et\nal. 2001; Okajima et al. 2006; Vierdayanti et al. 2006). Vierdayanti et al. (2008), for example, claim\nthat the spectral fitting with the conventional spectral model (with blackbody and power law spectral\ncomponents) is not reliable when the power-law component dominates, and demonstrated basing on\nthe original slim-disk model that some ULXs exhibit spectral signatures of the supercritical accretion\nflow (see also Vierdayanti et al. 2006). The present study supports their conclusions, since, even if\noutflow effects are taken into account, neither of the effective temperature profiles nor multi-color\nblackbody spectra are altered.\nWe would like to thank K. Watarai and R. Kawabata for useful comments and discussions.\nThis work is supported in part by the Grant-in-Aid of MEXT (19340044, SM), and by the Grant13\n\n\fin-Aid for the global COE programs on gThe Next Generation of Physics, Spun from Diversity and\nEmergenceh from MEXT (SM), Ministry of Education, Culture, Sports, Science, and Technology\n(MEXT) Young Scientist (B) 20740115 (KO). Numerical computations were [in part] carried out on\nCray XT4 at Center for Computational Astrophysics, CfCA, of National Astronomical Observatory\nof Japan.\nReferences\nAbramowicz, M. A., Czerny, B., Lasota, J. P., & Szuszkiewicz, E. 1988, ApJ, 332, 646\nBegelman, M. C. 1978, MNRAS, 184, 53\nBegelman, M. C. 1979, MNRAS, 187, 237\nBegelman, M. C., & Meier, D. L. 1982, ApJ, 253, 873\nBeloborodov, A. M. 1998, MNRAS, 297, 739\nBisnovatyi-Kogan, G. S., & Blinnikov, S. I. 1977, A&A, 59, 111\nBlondin, J. M. 1986, ApJ, 308, 755\nColbert, E. J. M., & Mushotzky, R. F. 1999, ApJ, 519, 89\nColpi, M. 1988, ApJ, 326, 223\nCropper, M., Soria, R., Mushotzky, R. F., Wu, K. Markwardt, C. B., & Pakull, M. 2004, MNRAS, 349, 39\nDone, C., Gierliński, M., & Kubota, A. 2007, Astron. Astrophys. Rev., 15, 1\nFabbiano, G. 1989, ARA&A, 27, 87\nFlammang, R. A. 1984, MNRAS, 206, 589\nFukue, J. 2000, PASJ, 52, 829\nFukue, J. 2004, PASJ, 56, 569\nGu, W., & Lu, J. 2007, ApJ, 660, 541\nHōshi, R. 1977, Prog. Theor. Phys., 58. 1191\nIcke, V. 1980, AJ, 85, 329\nJiao, C., Wue, L., Gu, W., & Lu, J. 2009, ApJ, in press (astro-ph/08112451)\nKato, S., Fukue, J., & Mineshige, S. 2008, Black-Hole Accretion Disks: Towards a New Paradigm (Kyoto:\nKyoto University Press)\nKatz, J. I. 1977, ApJ, 215, 265\nKawaguchi, T. 2003, ApJ, 593, 69\nKing, A. R., Davies, M. B., Ward, M. J., Fabbiano, G., & Elvis, M. 2001, ApJ, 552, L109\nKitabatake, E., Fukue, J., & Matsumoto, K. 2002, PASJ, 54, 235\nKohri, K., Ohsuga, K., & Narayan, R. 2007, MNRAS, 381, 1267\nLevermore, C. D., & Pomraning, G. C. 1981, ApJ, 248, 321\nLipunova, G. V. 1999, Astron. Lett., 25, 508\nMakishima, K., et al. 2000, ApJ, 535, 632\nMatsumoto, R., Kato, S., Fukue, J., & Okazaki, A. T. 1984, PASJ, 36, 71\nMeier, D. L. 1979, ApJ, 233, 664\nMiller, J. M., Zezas, A., Fabbiano, G., & Schweizer, F. 2004, ApJ, 609, 728\nMineshige, S., Kawaguchi, T., Takeuchi, M., & Hayashida, K. 2000, PASJ, 52, 499\n\n14\n\n\fNarayan, R., & Yi, I. 1994, ApJ, 428, L13\nOhsuga, K., Mineshige, S., Mori, M., & Umemura, M. 2002, ApJ, 574, 315\nOhsuga, K., Mori, M., Nakamoto, T. & Mineshige, S. 2005, ApJ, 628, 368\nOhsuga, K. 2006, ApJ, 640, 923\nOhsuga, K., & Mineshige, S. 2007, ApJ, 670, 1283\nOkajima, T., Ebisawa, K., & Kawaguchi, T. 2006, ApJ, 652, L105\nPaczyński, B., & Wiita, P.J. 1980, A&A, 88, 23\nPoutanen, J., Lipunova, G., Fabrika, S., Butkevich, A. G., & Abolmasov, P. 2007, MNRAS, 377, 1187\nRoberts, T. P., Warwick, R. S., Ward, M. J., Goad, M. R., & Jenkins, L. P. 2005, MNRAS, 357, 1363\nShakura, N. I., & Sunyaev, R. A. 1973, A&A, 24, 337\nSzuszkiewicz, E., Malkan, M. A., & Abramowicz, M. A. 1996, ApJ, 458, 474\nTajima, Y., & Fukue, J. 1998, PASJ, 50, 483\nTurner, N. J., & Stone, J. M. 2001, ApJS, 135, 95\nVierdayanti, K., Mineshige, S., Ebisawa, K.,& Kawaguchi, T. 2006, PASJ, 58, 915\nVierdayanti, K., Watarai, K., & Mineshige, S. 2008, PASJ, 60, 653\nWang, J.-M., & Zhou, Y.-Y. 1999, ApJ, 516, 420\nWatarai, K., & Fukue, J. 1999, PASJ, 51, 725\nWatarai, K., Fukue, J. Takeuchi, M., & Mineshige, S. 2000, PASJ, 52, 133\nWatarai, K., Mizuno, T. & Mineshige, S. 2001, ApJ, 596, 421\nWatarai, K., & Mineshige, S. 2003, PASJ, 55, 959\n\n15\n\n\f"}