{"id": "http://arxiv.org/abs/0801.1636v1", "guidislink": true, "updated": "2008-01-10T17:19:10Z", "updated_parsed": [2008, 1, 10, 17, 19, 10, 3, 10, 0], "published": "2008-01-10T17:19:10Z", "published_parsed": [2008, 1, 10, 17, 19, 10, 3, 10, 0], "title": "Massive Infrared-Quiet Dense Cores: Unveiling the Initial Conditions of\n  High-Mass Star Formation", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0801.3697%2C0801.3043%2C0801.3895%2C0801.1498%2C0801.2852%2C0801.1186%2C0801.0980%2C0801.4653%2C0801.1076%2C0801.2080%2C0801.4567%2C0801.4640%2C0801.4136%2C0801.1132%2C0801.3213%2C0801.0568%2C0801.4942%2C0801.2485%2C0801.4050%2C0801.2905%2C0801.0143%2C0801.4872%2C0801.3349%2C0801.2831%2C0801.1220%2C0801.2002%2C0801.4794%2C0801.1671%2C0801.2864%2C0801.3259%2C0801.3955%2C0801.3530%2C0801.0395%2C0801.2605%2C0801.0968%2C0801.0170%2C0801.0723%2C0801.4793%2C0801.3393%2C0801.3520%2C0801.2184%2C0801.1114%2C0801.0084%2C0801.0958%2C0801.2396%2C0801.2427%2C0801.1580%2C0801.0364%2C0801.0705%2C0801.0178%2C0801.0486%2C0801.2374%2C0801.0207%2C0801.3840%2C0801.2835%2C0801.3327%2C0801.1867%2C0801.1809%2C0801.0737%2C0801.0633%2C0801.2170%2C0801.4641%2C0801.1394%2C0801.1521%2C0801.3465%2C0801.2829%2C0801.2529%2C0801.1477%2C0801.3823%2C0801.4454%2C0801.4473%2C0801.2685%2C0801.4629%2C0801.2163%2C0801.4775%2C0801.2063%2C0801.3953%2C0801.2074%2C0801.4601%2C0801.2404%2C0801.2520%2C0801.0142%2C0801.2880%2C0801.1522%2C0801.3279%2C0801.3208%2C0801.0448%2C0801.3769%2C0801.4448%2C0801.2166%2C0801.0586%2C0801.4548%2C0801.4329%2C0801.4237%2C0801.2019%2C0801.1917%2C0801.2739%2C0801.0328%2C0801.2796%2C0801.1636%2C0801.3291&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Massive Infrared-Quiet Dense Cores: Unveiling the Initial Conditions of\n  High-Mass Star Formation"}, "summary": "As Pr. Th. Henning said at the conference, cold precursors of high-mass stars\nare now \"hot topics\". We here propose some observational criteria to identify\nmassive infrared-quiet dense cores which can host the high-mass analogs of\nClass 0 protostars and pre-stellar condensations. We also show how far-infrared\nto millimeter imaging surveys of entire complexes forming OB stars are starting\nto unveil the initial conditions of high-mass star formation.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0801.3697%2C0801.3043%2C0801.3895%2C0801.1498%2C0801.2852%2C0801.1186%2C0801.0980%2C0801.4653%2C0801.1076%2C0801.2080%2C0801.4567%2C0801.4640%2C0801.4136%2C0801.1132%2C0801.3213%2C0801.0568%2C0801.4942%2C0801.2485%2C0801.4050%2C0801.2905%2C0801.0143%2C0801.4872%2C0801.3349%2C0801.2831%2C0801.1220%2C0801.2002%2C0801.4794%2C0801.1671%2C0801.2864%2C0801.3259%2C0801.3955%2C0801.3530%2C0801.0395%2C0801.2605%2C0801.0968%2C0801.0170%2C0801.0723%2C0801.4793%2C0801.3393%2C0801.3520%2C0801.2184%2C0801.1114%2C0801.0084%2C0801.0958%2C0801.2396%2C0801.2427%2C0801.1580%2C0801.0364%2C0801.0705%2C0801.0178%2C0801.0486%2C0801.2374%2C0801.0207%2C0801.3840%2C0801.2835%2C0801.3327%2C0801.1867%2C0801.1809%2C0801.0737%2C0801.0633%2C0801.2170%2C0801.4641%2C0801.1394%2C0801.1521%2C0801.3465%2C0801.2829%2C0801.2529%2C0801.1477%2C0801.3823%2C0801.4454%2C0801.4473%2C0801.2685%2C0801.4629%2C0801.2163%2C0801.4775%2C0801.2063%2C0801.3953%2C0801.2074%2C0801.4601%2C0801.2404%2C0801.2520%2C0801.0142%2C0801.2880%2C0801.1522%2C0801.3279%2C0801.3208%2C0801.0448%2C0801.3769%2C0801.4448%2C0801.2166%2C0801.0586%2C0801.4548%2C0801.4329%2C0801.4237%2C0801.2019%2C0801.1917%2C0801.2739%2C0801.0328%2C0801.2796%2C0801.1636%2C0801.3291&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "As Pr. Th. Henning said at the conference, cold precursors of high-mass stars\nare now \"hot topics\". We here propose some observational criteria to identify\nmassive infrared-quiet dense cores which can host the high-mass analogs of\nClass 0 protostars and pre-stellar condensations. We also show how far-infrared\nto millimeter imaging surveys of entire complexes forming OB stars are starting\nto unveil the initial conditions of high-mass star formation."}, "authors": ["Frédérique Motte", "S. Bontemps", "N. Schneider", "P. Schilke", "K. M. Menten"], "author_detail": {"name": "K. M. Menten"}, "author": "K. M. Menten", "links": [{"href": "http://arxiv.org/abs/0801.1636v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0801.1636v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0801.1636v1", "affiliation": "MPIFR", "arxiv_url": "http://arxiv.org/abs/0801.1636v1", "arxiv_comment": null, "journal_reference": null, "doi": null, "fulltext": "**FULL TITLE**\nASP Conference Series, Vol. **VOLUME**, **YEAR OF PUBLICATION**\n**NAMES OF EDITORS**\n\nMassive Infrared-Quiet Dense Cores: Unveiling the Initial\nConditions of High-Mass Star Formation\n\narXiv:0801.1636v1 [astro-ph] 10 Jan 2008\n\nF. Motte1 , S. Bontemps2,1 , N. Schneider1 , P. Schilke3 , K. M. Menten3\nAbstract.\nAs Pr. Th. Henning said at the conference, cold precursors\nof high-mass stars are now \"hot topics\". We here propose some observational\ncriteria to identify massive infrared-quiet dense cores which can host the highmass analogs of Class 0 protostars and pre-stellar condensations. We also show\nhow far-infrared to millimeter imaging surveys of entire complexes forming OB\nstars are starting to unveil the initial conditions of high-mass star formation.\n\n1.\n\nIntroduction: First Discoveries of Cold Precursors of OB Stars\n\nFor long, our understanding of high-mass star formation has been exclusively\nbased on follow-up studies of bright sources found by IRAS (see, e.g., reviews\nby Beuther et al. 2007; Zinnecker & Yorke 2007). However, if the high-mass\nstar formation process goes through cold, low-luminosity phases reminiscent of\nthose of low-mass pre-stellar cores/condensations and Class 0s (see André et al.\n2000), our knowledge has been biased against these earliest phases.\nRecently, a few sources have been identified as good candidates for being\ncold precursors of high-mass stars, using mostly two methods. The first one uses\nhigh-density tracers (often submillimeter continuum) to map the surroundings\nof well-known H ii regions, H2 O or CH3 OH masers, or IRAS sources. Some\nof these mappings have serendipitously revealed dense and massive cloud fragments which remain undetected at mid-infrared wavelengths (e.g., Motte et al.\n2003; Hill et al. 2005; Klein et al. 2005; Beltrán et al. 2006). A second method\nis to search for sources seen in absorption against the diffuse mid-infrared background of square degrees images taken by ISO, MSX, and most recently Spitzer.\nIndeed, these absorption features which are called infrared dark clouds (IRDCs)\ngenerally are the footprints of large-scale cloud structures that, in a few cases,\nharbor massive cold clumps (e.g., Carey et al. 2000; Hennebelle et al. 2001;\nRathborne et al. 2006).\nThe sources identified in this way are definitively colder than the highluminosity infrared sources taken to be the precursors of ultracompact (UC)\nH ii regions (like, e.g., HMPOs by Beuther et al. 2002). The evolutionary\nstatus (pre-stellar or protostellar) of these cold cloud fragments is unclear since\nvery few of them have been surveyed for protostellar activity signatures other\n1\n\nLaboratoire AIM, CEA/DSM - CNRS - Univ. Paris Diderot, DAPNIA/SAp, CEA-Saclay,\n91191 Gif-sur-Yvette Cedex, France\n\n2\n\nOASU/LAB, CNRS - Univ. Bordeaux 1, 2 rue de l'Observatoire, BP 89, 33270 Floirac, France\n\n3\n\nMax-Planck-Institut für Radioastronomie, Auf dem Hügel 69, 53121 Bonn, Germany\n\n1\n\n\f2\n\nMotte et al.\n\nthan infrared emission. Moreover, these new sources are generally located at\nlarge and inhomogeneous distances from the Sun and thus correspond to cloud\nfragments with sizes ranging from 0.05 pc to 5 pc. As a consequence, only a\nhandful of sources have been studied with enough spatial resolution, spectral\nenergy distribution coverage, and follow-up studies to qualify as the high-mass\nequivalent of Class 0 protostars (Hunter et al. 1998; Molinari et al. 1998; Sandell\n2000; Garay et al. 2002; Sandell & Sievers 2004).\n\n2.\n\nObservational Criteria for \"Massive Infrared-Quiet Dense Cores\"\n\nTo make progress, one needs to search, in a systematic and unbiased way, for\nhigh-mass analogs of pre-stellar cores/condensations, and Class 0 protostellar\ncores/protostars. Imaging surveys of entire complexes forming OB stars in the\nfar-infrared or (sub)millimeter dust continuum are among the best tools to find\ncandidate massive dense cores. Motte et al. (2007) have made the first of such\nstudies in the Cygnus X molecular complex and identified 42 dense cores hosting\neither high-mass infrared-quiet protostars or high-luminosity infrared sources.\nFrom this experience, we establish three observational criteria to select, among\ncloud fragments, the best candidates for being \"massive infrared-quiet dense\ncores/condensations\": (1) they should be small-scale so that the majority of\ntheir mass would be concerned by the star formation process in the near future;\n(2) they should be dense enough to permit the formation of one high-mass star\nrather than several low-mass stars; (3) they should have a bolometric luminosity\nsmaller than that of a young stellar object (YSO) with a present stellar mass of\n8 M⊙ . The following subsections specify these criteria, illustrate them with our\nrecent work on Cygnus X, and interpret them as physical constraints.\nSmall-Scale (0.01–0.1 pc) Cloud Fragments\nTable 1 summarizes a few reference studies that have searched for the precursors\nof UC H ii regions. For a meaningful comparison of the massive cloud fragments\nthey identified, we choose to use the terminology recommended by Williams et\nal. (2000): \"clumps\" are ∼1 pc cloud structures, \"dense cores\" have ∼0.1 pc\nand \"condensations\" ∼0.01 pc sizes.\nFor low-mass stars, the cloud fragments believed to be the direct precursors\nof single or binary stars are dense cores in distributed star-forming regions like\nTaurus and condensations in protoclusters such as ρ Ophiuchi (see Table 1 and,\ne.g., André et al. 2000). Therefore, if the physical process of high-mass star\nformation is not radically different from that for low-mass stars, we estimate\nthat we must achieve the 0.01 − 0.1 pc scale to get access to mass reservoirs\nused to form a single high-mass star. In that respect, most of the high-mass star\nformation studies have selected sources which have the size of clumps and thus\nprobably harbor several protostars and pre-stellar condensations (see Table 1\nand, e.g., Beuther et al. 2002; Rathborne et al. 2006). Motte et al. (2007)\nhave shown that focussing on the most compact cloud fragments located in the\nclosest molecular cloud complexes is just enough to probe massive dense cores.\nHigh-resolution studies of these nearby dense cores are necessary to get access\nto high-mass starless condensations and individual high-mass protostars.\n\n\fMassive Infrared-Quiet Dense Cores\nTable 1.\n\n3\n\nHigh-mass and low-mass cloud structures of a few reference studies\n\nHMPOs IRDCs Cygnus X\nLow-mass\nρ Oph\nclumps clumps dense cores dense cores condens.\nDiameter (pc)\n0.5\n0.5\n0.13\n0.08\n0.007\nMass (M⊙ )\n290\n150\n91\n4.7\n0.15\n−3\n3\n3\n5\n4\nnH2 (cm )\n8 × 10\n6 × 10\n2 × 10\n3 × 10\n2 × 106\ndSun (kpc)\n0.3-14\n1.8-7.1\n1.7\n0.14-0.44\n0.14\nReferences\n(1)\n(2)\n(3)\n(4), (5)\n(5)\nReferences: (1) Beuther et al. (2002); (2) Rathborne et al. (2006); (3) Motte\net al. (2007); (4) Ward-Thompson et al. (1999); (5) Motte et al. (1998).\nMassive (100 M⊙ ) and High-Density (105 cm−3 ) Cores\nThe large mass of a cloud structure is a necessary but not enough condition\nto ensure that a high-mass star is forming within it. The amount of gas encompassed by cloud structures harboring a high-mass protostar is also logically\ndecreasing, from a few thousands to a few tens of solar mass, with its physical\nsize shrinking from 1 pc to 0.01 pc. Therefore, it seems judicious to use both\nthe mass and the volume-averaged density, < nH2 > = Msmm / ( 34 π × FWHM 3 ),\nof a cloud structure to estimate its capacity to form high-mass stars.\nAs shown in Table 1, the most massive Cygnus X dense cores (∼0.1 pc and\n≥ 40 M⊙ , Motte et al. 2007) are, on average, 19 times more massive and 5 times\ndenser than the pre-stellar dense cores forming low-mass stars (e.g., Motte et al.\n1998; Ward-Thompson et al. 1999). They thus do not have any equivalent in\nthe nearby star-forming regions and represent good candidate sites for forming\nhigh-mass stars. In contrast, many of the dense clumps found within infrared\ndark clouds should be neither massive enough, nor dense enough to form highmass stars in the near future (see Table 1). In order to select good candidates\nfor being precursors of high-mass stars, we estimate that a dense core should\nhave a mass ≥ 50 M⊙ and a volume-averaged density ≥ 5 × 104 cm−3 .\nIn that context, we have developed a source extraction technique aiming\nat identifying and extracting massive dense cores in (sub)millimeter continuum\nimages of nearby complexes (Motte et al. 2003, 2007). In spirit, this method is\nequivalent to an eye search of local density peaks followed by flux measurements\nwith an aperture optimized for each source. Automated, it separates dense cores\nfrom their environment by using a multi-resolution analysis of the cloud structures (MRE, Starck & Murtagh 2006) and 2D-Gaussian fits of the compact cloud\nfragments (with the Gaussclumps program, Stutzki & Güsten 1990). Setting a\nlower mass limit for the dense cores extracted by this technique selects the best\npotential sites of high-mass star formation. Indeed, in Cygnus X, 42 dense cores\nhave FWHM ∼ 0.13 pc, Msmm ∼ 91 M⊙ , and < nH2 > 2 × 105 cm−3 and are\nprobable precursors of high-mass stars (Motte et al. 2007).\nMassive Infrared-Quiet (<103 L⊙ ) Dense Cores\nWhen searching for the signature of embedded stellar embryos, the cross-correlation of compact (sub)millimeter sources with infrared catalogs is crucial.\nAmong the best-suited databases, the MSX C6 catalog provides fluxes at 8,\n\n\f4\n\nMotte et al.\n\n12, 15, and 21 μm for point sources (with a 20′′ resolution, Egan et al. 2003)\nand the Spitzer /MIPSGAL legacy project will soon publish point source catalogs at 24 and 70 μm (with higher-resolution and higher-sensitivity, Benjamin\net al. 2003). MSX maps and catalogs have been extensively used to recognize bright infrared sources and distinguish them from colder cloud fragments\n(see, e.g., Fig. 1). However, a more quantitative criterium is necessary since a\n(sub)millimeter source qualified as \"cold\" on the basis of its non-detection by\nMSX is surely weaker than the classical infrared-bright sources but could be,\nlater on, detected by Spitzer /MIPS.\n\nFigure 1. The DR22 region in Cygnus X: left) MAMBO-2 1.2 mm map in\ngray-scale and logarithmic contours, right) 1.2 mm map in contours overlaid\non the 8 μm image obtained by MSX (Jy sr−1 ). Note that the massive dense\ncores #62 and #63 are seen in absorption against the mid-infrared background\nwhile #58 is associated with a high-luminosity infrared source. By the kind\npermission of Motte et al. (2007) and EDP Sciences.\n\nIn the empirical evolutionary sequence of low-mass stars, Class 0 sources are\nyoung protostars at the beginning of the main accretion phase (Msmm > M⋆ ∼\n1 M⊙ ) while Class I sources are more evolved protostars which have already\naccumulated the majority of their final stellar mass (Msmm < M⋆ ). Applying\nthis philosophy to high-mass stars forming in Cygnus X, Motte et al. (2007)\npropose to separate high-mass protostars that have already accreted more than\n8 M⊙ from lighter and possibly younger protostars. In the context of massive\ndense cores harboring one high-mass plus a few low-mass protostars, a dense\ncore qualifies as \"high-luminosity\" (≥103 L⊙ ) if it can account for at least one\nB3 star on the zero-age main sequence. Conversely, a massive dense core is\n\"infrared-quiet\" if its bolometric luminosity is smaller than 103 L⊙ , meaning\nthat the most massive of its protostellar embryos is <8 M⊙ . Since the bolometric\nluminosity of the massive dense cores extracted from (sub)millimeter images is\nusually not well constrained, Motte et al. have converted the 103 L⊙ luminosity\nlimit into a limit on their MSX 21 μm flux. To do so, they have assumed\nthat the bolometric luminosity of these embedded sources is dominated by their\n\n\fMassive Infrared-Quiet Dense Cores\n\n5\n\nmid- to far-infrared luminosity (see Motte et al. 2007 for details) and that\ntheir average IRAS colors are defined by Wood & Churchwell (1989). Finally, a\nmassive infrared-quiet dense core should have a 21 μm MSX flux smaller than\n∼10 Jy × (dSun /1.7 kpc)−2 × (Lbol /103 L⊙ ).\nWith such a luminosity or infrared flux criterium, 17 of the 42 massive dense\ncores of Cygnus X qualify as infrared-quiet (see Fig. 2, Motte et al. 2007). Three\nof them are weak 21 μm MSX sources and we expect many more infrared-quiet\ndense cores (if not all of them, see Sect. 3) to be detected by Spitzer /MIPS.\n\nFigure 2. Separating, in Cygnus X, the high-luminosity infrared sources\nfrom massive infrared-quiet dense cores using their 21 μm flux (limit set to\n10 Jy). The high-luminosity infrared sources are either embedded UCH ii\nregions or IRAS protostellar cores. The high-luminosity dense cores are not\ndefinitively more massive than massive infrared-quiet dense cores (blue open\ncircles). By the kind permission of Motte et al. (2007) and EDP Sciences.\n\n3.\n\nThe Nature of Massive Infrared-Quiet Dense Cores\n\nMassive infrared-quiet dense cores identified with the three criteria given in\nSect. 2 could be either starless cores or protostellar cores in their earliest phase\nof evolution. Searching for protostellar activity signatures such as outflows, hot\ncores, or masers is necessary to finally determine their evolutionary status.\nMotte et al. (2007) have surveyed the most massive dense cores of Cygnus X\nin SiO(2-1) to search for shocked gas in molecular outflows. As shown in Fig. 3,\nthe SiO lines detected for massive infrared-quiet dense cores in Cygnus X are\nseveral times brighter than those observed for the high-luminosity sources. The\nassociation of high-velocity SiO emission with all massive infrared-quiet dense\ncores provides persuasive evidence that stars are already forming in each of\nthem. Moreover, their SiO lines are, on average, 3 to 4 times brighter that\nthe brightest SiO outflows of the nearby, low-mass protostars, which have a\n\n\f6\n\nMotte et al.\n\nFigure 3. SiO(2-1) lines observed toward the 28 most massive dense cores\nof Cygnus X, and thus the best candidate sites to form high-mass stars: 14\nhigh-luminosity infrared sources on the left and 14 massive infrared-quiet\nprotostellar cores on the right, both ordered by decreasing Msmm from top\nto bottom. Note that the SiO lines detected for massive infrared-quiet dense\ncores are bright but relatively simple with a main component and broad wings.\nBy the kind permission of Motte et al. (2007) and EDP Sciences.\n\n\f7\n\nMassive Infrared-Quiet Dense Cores\n\nprobability of occurence of only 6%. Therefore, the brightness and shape of\nthe SiO lines suggest that these high-density cores may host single high-mass\ninfrared-quiet protostars.\nIn summary, this first unbiased survey of the massive young stellar objects in Cygnus X shows that high-mass infrared-quiet protostars do exist in\nlarge numbers, while the high-mass analogs of pre-stellar dense cores (∼0.1 pc,\n∼105 cm−3 ) have not yet been convincingly identified.\n4.\n\nConstraining the Initial Conditions of High-Mass Star Formation\n\nOur group has embarqued a multi-tracer imaging survey of Cygnus X, one of the\nmost active star-forming complexes at less than 3 kpc. According to Schneider\net al. (2006), this massive (4 × 106 M⊙ ) molecular complex is tightly associated\nwith several OB associations (the largest being Cyg OB2) and is located at only\n1.7 kpc from the Sun. Studying all its high-density clouds will allow to set first\nconstraints on the initial conditions of the high-mass star formation process,\nrelevant at least in the Cygnus X region.\nThe millimeter imaging survey of the entire Cygnus X complex has provided\na statistically significant sample of massive dense cores harboring high-mass prestellar condensations, protostars, or UC H iis (Motte et al. 2007). Since it is\nderived from a single molecular complex and covers every embedded phase of\nhigh-mass star formation, it gives the first statistical estimates of their lifetime\n(see Table 2). Estimated relatively to the known age and numbers of OB stars in\nCyg OB2, the lifetimes of high-mass protostars and pre-stellar cores in Cygnus X\nare ∼3×104 yr and <103 yr. In rough agreement with their free-fall time estimates, these statistical lifetimes are one and two order(s) of magnitude smaller,\nrespectively, than what is found in nearby, low-mass star-forming regions (Kirk\net al. 2005; Kenyon & Hartmann 1995). These results suggest that high-mass\npre-stellar and protostellar cores are in a highly dynamic state, as expected in,\ne.g., a molecular cloud where turbulent processes dominate.\nTable 2.\n\nLifetime/age estimates (in years) of massive YSOs in Cygnus X\n\nStatistical lifetime\nFree-fall time\nLow-mass lifetimes\n\n5.\n\nPre-stellar\ncores\n≤8 × 102\n∼9 × 104\n2 × 105\n\nIR-quiet\nhigh-lum\nprotostars protostars\n1 × 104\n2 × 104\n4\n8 × 10\n2 × 104\n2 × 105\n\nH ii\nregions\n6 × 105\n\nOB\nstars\n2 × 106\n\nConclusion and Perspectives: High-Mass Class 0-like Protostars\n\nWith the advent of wide-field bolometer arrays on ground-based telescopes and\nthe Herschel satellite, we are entering a very promissing era for the studies of\nthe cold phases of star formation. Large-scale imaging surveys like ATLASGAL (with LABOCA on APEX by Schuller, Menten et al.) and HOBYS (with\nHerschel by Motte, Zavagno, Bontemps et al.) will provide unbiased census of\nmassive infrared-quiet dense cores and start constraining the initial conditions of\n\n\f8\n\nMotte et al.\n\nhigh-mass star formation. Herschel will define the spectral energy distribution\nof massive dense cores, thus allowing to measure their submillimeter to bolometric luminosity ratio that can replace the luminosity criterium for massive\ninfrared-quiet dense cores.\nHowever, the above surveys lack the necessary spatial resolution to look\nfor the high-mass analogues of pre-stellar condensations and Class 0 protostars,\nwithin the massive dense cores. For instance, the Cygnus X dense cores still\nare 20 times larger and 10 times less dense than the low-mass condensations of\nρ Ophiuchi which are believed to be the direct progenitors of single stars (see\nTable 1). High-resolution (sub)millimeter mapping of massive dense cores are\ntherefore necessary first with, e.g., the IRAM Plateau de Bure interferometer\nand soon after with ALMA (see, e.g., Bontemps et al. in prep.).\nReferences\nAndré, P., Ward-Thompson, D., Barsony, M. 2000, in Protostars & Planets IV, ed. V.\nMannings, A. Boss, & S. Russell (Tucson: Univ. Arizona Press), 59\nBeltrán, M. T., Brand, J., Cesaroni, R., et al. 2006, A&A, 447, 221\nBenjamin, R. A., Churchwell, E., Babler, B. L., et al. 2003, PASP, 115, 953\nBeuther, H., Churchwell, E. B., McKee, C. F., Tan, J. C. 2007, in Protostars & Planets\nV, ed. B. Reipurth, D. Jewitt, and K. Keil (Tucson: Univ. Arizona Press), 165\nBeuther, H., Schilke, P., Menten, K. M., et al. 2002, ApJ, 566, 945\nCarey, S. J., Feldman, P. A., Redman, R. O., et al. 2000, ApJ, 543, L157\nEgan, M. P., Price, S. D., Kraemer, K. E., et al. 2003, VizieR On-line Data Catalog,\noriginally published in: Air Force Research Lab. Technical Rep.\nGaray, G., Brooks, K. J., Mardones, D., Norris, R. P., Burton, M. G. 2002, ApJ, 579,\n678\nHennebelle, P., Pérault, M., Teyssier, D., Ganesh, S. 2001, A&A, 365, 598\nHill, T., Burton, M. G., Minier, V., et al. 2005, MNRAS, 363, 405\nHunter, T. R., Neugebauer, G., Benford, D. J., et al. 1998, ApJ, 493, L97\nKirk, J. M., Ward-Thompson, D., André, P. 2005, MNRAS, 360, 1506\nKenyon, S.J., & Hartmann, L.W. 1995, ApJS, 101, 117\nKlein, R., Posselt, B., Schreyer, K., Forbrich, J., Henning, Th. 2005, ApJS, 161, 361\nMolinari, S., Testi, L., Brand, J., Cesaroni, R., Palla, F. 1998, ApJ, 505, L39\nMotte, F., Schilke, P., Lis, D. C. 2003, ApJ, 582, 277\nMotte, F., André, P., Neri, R. 1998, A&A, 336, 150\nMotte, F., Bontemps, S., Schilke, P, et al. 2007, A&A, 476, 1243\nRathborne, J. M., Jackson, J. M., Simon, R. 2006, ApJ, 641, 389\nSandell, G., Sievers, A. 2004, ApJ, 600, 269\nSandell, G. 2000, A&A, 358, 242\nSchneider, N., Bontemps, S., Simon, R., et al. 2006, A&A, 458, 855\nStarck, J.-L., Murtagh, F. 2006, Astronomical image and data analysis, Astronomy and\nastrophysics library, Berlin: Springer\nStutzki, J., Güsten, R. 1990, ApJ, 356, 513\nWard-Thompson, D., Motte, F., André, P. 1999, MNRAS 305, 143\nWilliams,, S. J., Blitz, L., McKee, C. F. 2000, in Protostars & Planets IV, ed. V.\nMannings, A. Boss, & S. Russell (Tucson: Univ. Arizona Press), 97\nWood, D. O. S., Churchwell, E. 1989, ApJ, 340, 265\nZinnecker, H., Yorke, H. 2007, ARA&A, 45, 481\n\n\f"}