{"id": "http://arxiv.org/abs/0909.4616v1", "guidislink": true, "updated": "2009-09-25T06:09:16Z", "updated_parsed": [2009, 9, 25, 6, 9, 16, 4, 268, 0], "published": "2009-09-25T06:09:16Z", "published_parsed": [2009, 9, 25, 6, 9, 16, 4, 268, 0], "title": "Stimulated emission in erbium doped silicon rich nitride waveguides", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0909.2529%2C0909.5120%2C0909.1719%2C0909.3948%2C0909.3179%2C0909.3307%2C0909.0962%2C0909.1679%2C0909.5437%2C0909.2743%2C0909.0746%2C0909.0644%2C0909.1884%2C0909.2012%2C0909.5091%2C0909.3963%2C0909.4104%2C0909.1544%2C0909.1952%2C0909.0344%2C0909.0586%2C0909.3843%2C0909.2071%2C0909.0315%2C0909.5629%2C0909.0055%2C0909.1019%2C0909.0078%2C0909.0357%2C0909.3373%2C0909.0879%2C0909.0416%2C0909.1251%2C0909.4725%2C0909.2818%2C0909.0067%2C0909.5074%2C0909.2532%2C0909.0667%2C0909.0145%2C0909.3089%2C0909.0157%2C0909.5462%2C0909.2325%2C0909.4493%2C0909.0896%2C0909.0947%2C0909.2944%2C0909.4616%2C0909.0032%2C0909.3744%2C0909.2094%2C0909.1077%2C0909.3364%2C0909.2833%2C0909.3351%2C0909.2042%2C0909.2345%2C0909.3670%2C0909.0823%2C0909.5447%2C0909.5294%2C0909.1984%2C0909.2876%2C0909.0569%2C0909.3022%2C0909.3214%2C0909.2428%2C0909.3972%2C0909.0107%2C0909.4059%2C0909.5005%2C0909.2811%2C0909.1000%2C0909.0839%2C0909.3438%2C0909.3300%2C0909.1730%2C0909.2719%2C0909.4522%2C0909.0131%2C0909.1432%2C0909.1360%2C0909.1099%2C0909.1181%2C0909.4484%2C0909.3738%2C0909.2275%2C0909.5451%2C0909.2815%2C0909.1246%2C0909.0061%2C0909.5649%2C0909.4764%2C0909.4590%2C0909.4102%2C0909.2403%2C0909.3565%2C0909.1426%2C0909.4476%2C0909.4904&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Stimulated emission in erbium doped silicon rich nitride waveguides"}, "summary": "Stimulated emission of sensitized Erbium atoms is reported in silicon-rich\nsilicon nitride waveguides. Visible pump and infrared probe measurements are\ncarried out in waveguides fabricated from erbium-doped silicon rich silicon\nnitride. A decrease in the photoinduced absorption of the probe in the\nwavelength range of the erbium emission is observed and is attributed to\nstimulated emission from erbium atoms excited indirectly via the silicon excess\nin an SiNx matrix. A near 50% decrease in absorption is measured, corresponding\nto an 8% fraction of inverted erbium atoms. This fraction is an order of\nmagnitude higher than that obtained in counterpart oxide systems possessing\nobservable nanocrystals. Our results indicate that population inversion and\ngain at 1.54 um might be possible by optimizing the silicon excess in the SiNx\nmatrix.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0909.2529%2C0909.5120%2C0909.1719%2C0909.3948%2C0909.3179%2C0909.3307%2C0909.0962%2C0909.1679%2C0909.5437%2C0909.2743%2C0909.0746%2C0909.0644%2C0909.1884%2C0909.2012%2C0909.5091%2C0909.3963%2C0909.4104%2C0909.1544%2C0909.1952%2C0909.0344%2C0909.0586%2C0909.3843%2C0909.2071%2C0909.0315%2C0909.5629%2C0909.0055%2C0909.1019%2C0909.0078%2C0909.0357%2C0909.3373%2C0909.0879%2C0909.0416%2C0909.1251%2C0909.4725%2C0909.2818%2C0909.0067%2C0909.5074%2C0909.2532%2C0909.0667%2C0909.0145%2C0909.3089%2C0909.0157%2C0909.5462%2C0909.2325%2C0909.4493%2C0909.0896%2C0909.0947%2C0909.2944%2C0909.4616%2C0909.0032%2C0909.3744%2C0909.2094%2C0909.1077%2C0909.3364%2C0909.2833%2C0909.3351%2C0909.2042%2C0909.2345%2C0909.3670%2C0909.0823%2C0909.5447%2C0909.5294%2C0909.1984%2C0909.2876%2C0909.0569%2C0909.3022%2C0909.3214%2C0909.2428%2C0909.3972%2C0909.0107%2C0909.4059%2C0909.5005%2C0909.2811%2C0909.1000%2C0909.0839%2C0909.3438%2C0909.3300%2C0909.1730%2C0909.2719%2C0909.4522%2C0909.0131%2C0909.1432%2C0909.1360%2C0909.1099%2C0909.1181%2C0909.4484%2C0909.3738%2C0909.2275%2C0909.5451%2C0909.2815%2C0909.1246%2C0909.0061%2C0909.5649%2C0909.4764%2C0909.4590%2C0909.4102%2C0909.2403%2C0909.3565%2C0909.1426%2C0909.4476%2C0909.4904&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Stimulated emission of sensitized Erbium atoms is reported in silicon-rich\nsilicon nitride waveguides. Visible pump and infrared probe measurements are\ncarried out in waveguides fabricated from erbium-doped silicon rich silicon\nnitride. A decrease in the photoinduced absorption of the probe in the\nwavelength range of the erbium emission is observed and is attributed to\nstimulated emission from erbium atoms excited indirectly via the silicon excess\nin an SiNx matrix. A near 50% decrease in absorption is measured, corresponding\nto an 8% fraction of inverted erbium atoms. This fraction is an order of\nmagnitude higher than that obtained in counterpart oxide systems possessing\nobservable nanocrystals. Our results indicate that population inversion and\ngain at 1.54 um might be possible by optimizing the silicon excess in the SiNx\nmatrix."}, "authors": ["Debo Olaosebikan", "Selcuk Yerci", "Alexander Gondarenko", "Kyle Preston", "Rui Li", "Luca Dal Negro", "Michal Lipson"], "author_detail": {"name": "Michal Lipson"}, "author": "Michal Lipson", "links": [{"href": "http://arxiv.org/abs/0909.4616v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0909.4616v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "physics.optics", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "physics.optics", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0909.4616v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0909.4616v1", "arxiv_comment": null, "journal_reference": null, "doi": null, "fulltext": "Stimulated emission in erbium doped silicon rich\nnitride waveguides\nDebo Olaosebikan1, Selcuk Yerci2, Alexander Gondarenko1, Kyle Preston1, Rui Li2,\nLuca Dal Negro2 and Michal Lipson1*\n1\n\nDepartment of Electrical and Computer Engineering, Cornell University, Ithaca, NY, 14853, USA\n2\nDepartment of Electrical Engineering, Boston University, Boston, MA, 02215, USA\n*\nml292@cornell.edu\n\nAbstract: Stimulated emission of sensitized Erbium atoms is reported in\nsilicon-rich silicon nitride waveguides. Visible pump and infrared probe\nmeasurements are carried out in waveguides fabricated from erbium-doped\nsilicon rich silicon nitride. A decrease in the photoinduced absorption of the\nprobe in the wavelength range of the erbium emission is observed and is\nattributed to stimulated emission from erbium atoms excited indirectly via\nthe silicon excess in an SiNx matrix. A near 50% decrease in absorption is\nmeasured, corresponding to an 8% fraction of inverted erbium atoms. This\nfraction is an order of magnitude higher than that obtained in counterpart\noxide systems possessing observable nanocrystals. Our results indicate that\npopulation inversion and gain at 1.54μm might be possible by optimizing\nthe silicon excess in the SiNx matrix.\n2009 Optical Society of America\nOCIS codes: (140.5560) Pumping; (140.3500) Lasers, Erbium; (140.3410) Laser Resonators.\n\nReferences and links\n1.\n2.\n3.\n4.\n5.\n6.\n\n7.\n8.\n9.\n10.\n11.\n12.\n13.\n14.\n15.\n\nM. Lipson, \"Guiding, modulating, and emitting light on silicon - Challenges and opportunities,\" J.\nLightwave Technol. 23, 4222-4238 (2005).\nH. Rong et al, \"A continuous-wave Raman silicon laser,\" Nature 433, 725 (2005).\nO. Boyraz and B. Jalali, \"Demonstration of a silicon Raman laser,\" Opt. Express 12, 5269-5273 (2004).\nA. W. Fang, H. Park, O. Cohen, R. Jones, M. Paniccia and J. E. Bowers, \"Electrically pumped hybrid\nAlGaInAs-silicon evanescent laser,\" Opt. Express 14, 9203-9210 (2006).\nT. J. Kippenberg et al., \"Demonstration of an erbium-doped microdisk laser on a silicon chip,\" Phys. Rev.\nA 74, 051802 (2006).\nL. Dal Negro, R. Li, J. Warga, S. Yerci, S. Basu, H. Hamel, G. Galli, \" Light-emission from silicon-rich\nnitride nanostructures,\" Silicon Nanophotonics: Basic Principles, Present Status and Perspectives, L.\nKhriachtchev, ed.(Pan Stanford Publishing, 2008).\nR. Li, J. Schneck, J. Warga, L. Ziegler, L. Dal Negro, \"Carrier Dynamics and Erbium sensitization in\nSilicon Rich Nitride,\" Appl. Phys. Lett. 93, 091119 (2008).\nL. Dal Negro, R. Li, J. Warga, S.N. Basu, \"Sensitized Erbium emission from silicon-rich nitride/silicon\nsuperlattice structures,\" Appl. Phys. Lett., 92, 181105 (2008).\nS. Yerci, R. Li, S. O. Kucheyev, T. van Buuren, S.N. Basu and L. Dal Negro \"Energy transfer and 1.54 μm\nemission in amorphous silicon nitride films,\" Appl. Phys. Lett. 95, 0311107 (2009).\nJ. Warga, R. Li, S. N. Basu, and L. Dal Negro, \"Electroluminescence from silicon-rich nitride/silicon\nsuperlattice structures,\" Appl. Phys. Lett. 92, 181105 (2008).\nR.J. Walters, G.I. Bourianoff, H.A. Atwater, \"Field Effect Electroluminescence in Silicon Nanocrystals,\"\nNature Mat. 4, 143 (2005).\nB. Garrido et al, \"Excitable Er Fraction and quenching phenomena in Er-doped SiO2 layers containing Si\nnanoclusters,\" Phys. Rev. B 76, 245308 (2007).\nL. Pavesi, L. Dal Negro, C. Mazzoleni, G. Franzo and F. Priolo, \"Optical gain in silicon nanocrystals,\"\nNature 408, 440-444 (2000).\nH. S. Yan, S. Seo, and J.H. Shin, \"Optical gain at 1.54 μm in erbium-doped silicon nanocrystal sensitized\nwaveguide,\" Appl. Phys. Lett. 79, 4568 (2001).\nP. G. Kik and A. Polman, \"Gain limiting processes in Er-doped Si nanocrystal waveguides in SiO2,\" J.\nAppl. Phys. 91, 534 (2002).\n\n\f16. L. Pavesi, \"Will Silicon be the photonic material of the third millennium?,\" J. Phys.: Condens. Matter 15,\nR1169-R1196 (2003).\n17. J. T. Robinson, K. Preston, O. Painter and M. Lipson, \"First-principle derivation of gain in high-indexcontrast waveguides,\" Opt Express 16 16659-1669 (2008).\n18. A. Polman, \"Erbium implanted thin film photonic materials,\" J. Appl. Phys. 82, 1 (1997).\n19. S. Yerci, R. Li, S. O. Kucheyev, T. van Buuren, S.N. Basu and L. Dal Negro, \"Visible and 1.54 μm\nemission from amorphous silicon nitride films by reactive co-sputtering,\" accepted to J. Sel. Topics in\nQuantum Electronics\n20. R. Li, S. Yerci and L. Dal Negro, \"Temperature dependence of the energy transfer from amorphous silicon\nnitride to Er ions,\" Appl. Phys. Lett., 95, 041111 (2009).\n21. B. Zheng, J. Michel, F.Y.G. Ren, and L.C. Kimerling, \"Room Temperature sharp line electroluminescence\nat λ = 1.54 μm from an erbium-doped, silicon light emitting diode,\" Appl. Phys. Lett. 64, 2842 (1994).\n22. M. Makarova, V. Sih, J. Warga, L. Dal Negro, J. Vuckovic, \"Enhanced light emission in photonic crystal\nnanocavities with Erbium-doped silicon nanocrystals,\" Appl. Phys. Lett., 92, 161107 (2008).\n23. R. D. Kekatpure and M. L. Brongersma, \"Fundamental photophysics and optical loss processes in Sinanocrystal-doped microdisk resonators,\" Phys. Rev. A 78, 023829 (2008).\n24. P. M. Fauchet, J. Ruan, H. Chen, L. Pavesi, L. Dal Negro, M. Cazzaneli, R.G. Elliman, N. Smith, M.\nSamoc and B. Luther-Davies, \"Optical gain in different silicon nanocrystal systems,\" Optical Materials 27,\n745 (2005).\n25. J. Kenyon, C. E. Chryssou, C. W. Pitt, T. Shimizu-Iwayama, D. E. Hole, \"Luminescence from erbiumdoped silicon nanocrystals in silica: Excitation mechanisms,\" J. Appl. Phys. 91, 367 (2002).\n\n1. Introduction\nThe quest for CMOS-compatible light sources and amplifiers continues to drive interest and\nresearch in the emergent field of silicon photonics [1-5]. Potential platforms must be\nelectrically pumped and should preferably emit at the technologically relevant, 1550nm\ntelecommunications wavelength.\nIn this regard, erbium-doped silicon-rich silicon nitride (Er: SRN) is a promising material\ncandidate [6]. Localized trap states as well as small nanometer-sized silicon nanocrystals in a\nsilicon nitride host act as highly efficient sensitizers for surrounding erbium ions [7-9]. The\nexcess silicon permits electrical access [10, 11] while the erbium ions serve as emitters at\n1550 nm. Sensitized stimulated emission, erbium population inversion, and ultimately gain\nmust be achieved in an integrated waveguide, towards the end of achieving lasing with Er:\nSRN as the active material.\nInverting a significant fraction of erbium ions via nanocrystals has previously been\nproblematic with erbium inversion ratios of ~ 1% being the demonstrated state of the art [12].\nEfficient photoluminescence [7-9], electroluminescence [10, 11] and even optical gain under\nintense pulsed conditions [13] have been demonstrated in silicon nanocrystal based systems\nwithout erbium. However, gain under continuous wave excitation has not been demonstrated\nthe emission peak of the nanocrystals (~750nm) is far from the telecom band. In addition,\nwhile sensitized stimulated emission from erbium in silicon rich silicon oxide was reported in\n[14], photoinduced absorption was reported in [15]. Thus, engineering the optimal silicon rich\nmatrix for obtaining sensitized stimulated emission and gain remains an important task to be\nresolved consistently before lasing can be achieved [16].\nHere we present evidence of stimulated emission from indirectly sensitized erbium ions\nin a silicon rich nitride host matrix, and show a 50% suppression of the expected carrier\nrelated losses. This corresponds to an 8% inversion fraction of erbium. The magnitude of the\nsuppression, and the order of magnitude increase in the inversion fraction as compared to\nprevious work, suggests that the deleterious effects of generated carriers and the challenges of\ninverting erbium might not be as severe in the nitride matrix as in its oxide counterpart due to\na faster excitation of erbium [7-9] and that the optimization of silicon content and pump\nconditions could lead to net gain.\n2. Fabrication and Passive Testing of Er: SRN Waveguides and Resonators\n\n\fThe waveguides were fabricated from 400nm thick Er: SRN films. The films were deposited\nby reactive sputtering as detailed elsewhere [9, 10]. The sputtered film has a relative Si atomic\nconcentration of 47% as compared to 43% in stoichiometric silicon nitride indicating a 4%\nsilicon excess [7]. The erbium concentration has been determined from Rutherford back\nscattering measurements to be ~ 4.6 ×1020 cm−3 [9]. To verify the optical activity of the\nerbium and the sensitizing matrix, erbium photoluminescence was obtained from the films by\npumping at 457nm, away from the erbium absorption line at 488nm (Fig. 1(a)). The Er: SRN\nwas subsequently patterned via electron beam lithography, and reactive ion etching. Fig. 1(b)\nshows a cross section of the fabricated devices.\n\nPL Intensity (arb. units)\n\n(a)\n\nErbium Photoluminescence\n\n(b)\n\n4\n\n1.3um\nEr:SRN\n\n0.4um\n\n2\n\n4um\n0\n\n1450\n\n1500\n\n1550\n\n1600\n\nOxide\n\n1650\n\nWavelength (nm)\nFig. 1. (a): Sensitized erbium emission obtained by pumping at 457nm which is away from the\nerbium resonance absorption at 488nm. (b): Cross section of the fabricated Er:SRN waveguides\nwith refractive index n=2.23 cladded in oxide and on top of a 4um oxide box\n\nIn these devices, scattering limited waveguide losses of ~20dB/cm are achieved. The\nlosses were determined by measuring the transmission through near identical waveguides of\ndifferent lengths. While ultimately the losses must be brought down for net amplification, the\nsystem is already good enough to measure pump-induced losses via changes in waveguide\ntransmission.\n3. Pump-Probe Measurements of Er: SRN waveguides\nIn a pump-probe setup, we extract the dependence of the photoinduced losses on the probe\nwavelength. A continuous wave at 470nm is used to pump the Er: SRN waveguides. The\npump beam is focused with a cylindrical lens into a line directly on top of the waveguide\nbeing measured, at an estimated incident light intensity of ~ 50mW / cm2 . The probe (the\noutput of a tunable laser of picometer precision) is coupled into the waveguides and scanned\nover a 1.5 μm to 1.6 μm range.\nIn the presence of the pump, we observe a suppression of probe transmission for all\nwavelengths due to photogenerated carriers in the SRN matrix (Fig. 2).\n\n\fPump Off\nPump On\n\nTransmitted Power (nW)\n\n150\n\n100\n\n50\n\n0\n1500\n\n1530\n\n1560\n\nWavelength (nm)\n\nFig. 2. The wavelength dependence of the transmission through a 7.6 mm long waveguide is\ndepicted in pump-on and pump-off conditions.\n\nThe pump induced absorption, ∆α , is determined from the transmission in the pump-on\nand pump-off scenarios as:\n\n∆α = −\n\n1  Pon\nln \nL  Poff\n\n\n ,\n\n\n(1)\n\nPon and Poff represent the magnitude of the power transmitted through the waveguide with the\npump on and off while L denotes the length of the waveguide. Here, a positive\n∆α represents an increase in absorption.\nWe find evidence for stimulated emission from erbium in the spectral dependence of the\npump-induced absorption. When this photoinduced absorption, ∆α , is plotted as a function\nof wavelength ( Fig. 3.), there is a clear dip around the 1.54 μm erbium emission peak against\nan overall background loss. Such a feature is absent in similar waveguides fabricated from\nmaterials that were not co-sputtered with erbium (Fig. 3). These control waveguides were\nnon-resonantly pumped at 455 nm where there is a higher sensitization cross section [7-9],\nand had 20% greater confinement of the mode for increased sensitivity to changes in\nwaveguide absorption. Even in these favorable conditions, the suppression was not seen.\nThus, we conclude that the dip is related to the presence of erbium.\n\n\fPhotoinduced absorption (SRN)\nPhotoinduced absorption (Er:SRN)\n\nPhotoinduced absorption (1/cm)\n\n0.5\n\n∆α ~ 2dB\n\n0.0\n1500\n\n1520\n\n1540\n\n1560\n\n1580\n\n1600\n\n1620\n\nWavelength (nm)\nFig. 3 The photoinduced absorption in silicon rich nitride waveguides with and without erbium\nions. No dip is observed in SRN waveguides.\n\nWe note that the transmitted probe is measured directly by an InGaAs photo detector with a\nflat response in the wavelength regime studied. Thus any spontaneous emission generated by\nthe pump is detected as an overall bias in the probe signal at all wavelengths. The probe beam\nhowever, being intense and coherent can stimulate transitions in the erbium population. As the\nprobe wavelength is varied, these stimulated transitions will follow the wavelength\ndependence of the erbium emission cross section. This picture is confirmed in our\nmeasurement and is manifested in the similarity between the dip in the absorption and the\nWe deduce an 8% inverted erbium fraction from the magnitude of the absorption dip.\nConsidering that the origin of the dip in absorption is erbium stimulated emission, the inverted\nerbium population is estimated as:\n\n∆α dip = Γσ e N 2\nThe inversion fraction,\n\n(2)\n\nf , is thus given by:\nf =\n\nN2\nN0\n\nwhere ∆α dip is the magnitude of the dip in the absorption,\n\n(3)\n\nΓ is the modal confinement\n\nfactor [17], σ e is the erbium emission cross section at 1.54 μm, N 2 is the excited erbium\npopulation density and N 0 is the total erbium density. Using the appropriate material\n\n\fparameters and waveguide dimensions, we numerically obtain a value of Γ = 0.67 for the\nfundamental TM mode used in the experiment.\nTo determine the inversion fraction, we use the experimentally measured values of\n20\n−3\n∆αdip = 0.14 cm−1 and N 0 = 4.6 ×10 cm . Given the small index difference between silicon\nnitride and silica, and the fact that the emission cross section of erbium varies little across\ndifferent oxide systems; we use a value of σ e = 6 ×10−21 cm2 , which is close to the highest\nmeasured value for erbium in silica [18]. By choosing a high value for σ e , we obtain a lower\ninversion fraction and thus a more conservative estimate. Using equations (2) and (3) along\nwith the appropriate values, we get f ≈ 0.08 corresponding to an 8% inversion ratio.\nThe inversion ratio obtained is a lower limit to the true ratio since not all erbium ions are\noptically active and the pump intensities accessible in the experiment were not enough to\nsaturate the absorption dip. Both factors imply that the inverted fraction measured in this\nexperiment is not a fundamental limit and inversion might yet be possible. However, the 8%\ninversion ratio is an order of magnitude greater than that measured in silica host systems [12].\nThe method used in this work, examining the wavelength dependence of the photoinduced\nabsorption to extracting the excited erbium fraction, can be extended to oxide systems as well\nand is a fairly simple experimental tool for probing the fraction of inverted atoms in real\ndevices made from these complicated material systems.\nThe higher amount of erbium inversion measured in the Er: SRN system could be due to\nthe faster erbium sensitization in the nitride. Transfer times from the SRN matrix to the\nerbium ions are on the order of nanoseconds as compared to the microsecond times in oxide\nsystems [7-9]. Further studies of the temporal dynamics of erbium excitation and carrier\ngeneration in waveguide based structures are needed to clarify the limits to the inversion ratio\nand whether or not gain is possible.\n5. Conclusions\nThe results presented suggest less silicon rich samples than the one studied here might lead to\na smaller overall loss background that allows the dip seen in this experiment cross over into\nthe region of negative absorption (gain). Decreasing the silicon excess in the material must be\ndone with caution since the silicon network is needed for electrical access and excitation of at\nleast 50% of the erbium. Thus, a careful optimization over a range of silicon content, and\npump powers must be carried out to investigate the possibility of gain in these waveguides\nunder continuous wave conditions.\nAcknowledgements\nThe authors acknowledge C. Manolatou for the use of her FD code and thank Long Chen,\nGustavo Wiederhecker, and Prof. Farhan Rana for productive discussions. This work was\nfunded in part by the U.S. Air Force MURI program on \"Electrically Pumped Silicon-Based\nLasers for Chip-Scale Nanophotonic Systems\" supervised by Dr. Gernot Pomrenke. This\nwork was performed in part at the Cornell Nanoscale Facility, a member of the National\nNanotechnology Infrastructure Network, which is supported by the National Science\nFoundation.\n\n\f"}