{"id": "http://arxiv.org/abs/1203.5179v2", "guidislink": true, "updated": "2012-07-13T04:32:37Z", "updated_parsed": [2012, 7, 13, 4, 32, 37, 4, 195, 0], "published": "2012-03-23T05:52:51Z", "published_parsed": [2012, 3, 23, 5, 52, 51, 4, 83, 0], "title": "Exciton Mott transition in Si Revealed by Terahertz Spectroscopy", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1203.6371%2C1203.0853%2C1203.4977%2C1203.1131%2C1203.5085%2C1203.6011%2C1203.2687%2C1203.1336%2C1203.5179%2C1203.1627%2C1203.0906%2C1203.5363%2C1203.1818%2C1203.0836%2C1203.0831%2C1203.6016%2C1203.2482%2C1203.2643%2C1203.1481%2C1203.1062%2C1203.2356%2C1203.4173%2C1203.5633%2C1203.3608%2C1203.1700%2C1203.6289%2C1203.1077%2C1203.5470%2C1203.1211%2C1203.5837%2C1203.6776%2C1203.4566%2C1203.4494%2C1203.4119%2C1203.5352%2C1203.0241%2C1203.0131%2C1203.4838%2C1203.3215%2C1203.5534%2C1203.0207%2C1203.0567%2C1203.1059%2C1203.2976%2C1203.6735%2C1203.4660%2C1203.0259%2C1203.1112%2C1203.0994%2C1203.2312%2C1203.5114%2C1203.6831%2C1203.5399%2C1203.0218%2C1203.5818%2C1203.3713%2C1203.6773%2C1203.6175%2C1203.1215%2C1203.0621%2C1203.2115%2C1203.1110%2C1203.1710%2C1203.4203%2C1203.3403%2C1203.1026%2C1203.1113%2C1203.1521%2C1203.3648%2C1203.1375%2C1203.4738%2C1203.2240%2C1203.5852%2C1203.2653%2C1203.4377%2C1203.6762%2C1203.3692%2C1203.0628%2C1203.1947%2C1203.2199%2C1203.1669%2C1203.3858%2C1203.2668%2C1203.4737%2C1203.3203%2C1203.3602%2C1203.1628%2C1203.5220%2C1203.3862%2C1203.4495%2C1203.0568%2C1203.5901%2C1203.5319%2C1203.6705%2C1203.1403%2C1203.4792%2C1203.2717%2C1203.2918%2C1203.4406%2C1203.4306%2C1203.2731&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Exciton Mott transition in Si Revealed by Terahertz Spectroscopy"}, "summary": "Exciton Mott transition in Si is investigated by using terahertz time-domain\nspectroscopy. The excitonic correlation as manifested by the 1s-2p resonance is\nobserved above the Mott density. The scattering rate of charge carriers is\nprominently enhanced at the proximity of Mott density, which is attributed to\nthe non-vanishing exciton correlation in the metallic electron-hole plasma.\nConcomitantly, the signature of plasmon-exciton coupling is observed in the\nloss function spectra.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1203.6371%2C1203.0853%2C1203.4977%2C1203.1131%2C1203.5085%2C1203.6011%2C1203.2687%2C1203.1336%2C1203.5179%2C1203.1627%2C1203.0906%2C1203.5363%2C1203.1818%2C1203.0836%2C1203.0831%2C1203.6016%2C1203.2482%2C1203.2643%2C1203.1481%2C1203.1062%2C1203.2356%2C1203.4173%2C1203.5633%2C1203.3608%2C1203.1700%2C1203.6289%2C1203.1077%2C1203.5470%2C1203.1211%2C1203.5837%2C1203.6776%2C1203.4566%2C1203.4494%2C1203.4119%2C1203.5352%2C1203.0241%2C1203.0131%2C1203.4838%2C1203.3215%2C1203.5534%2C1203.0207%2C1203.0567%2C1203.1059%2C1203.2976%2C1203.6735%2C1203.4660%2C1203.0259%2C1203.1112%2C1203.0994%2C1203.2312%2C1203.5114%2C1203.6831%2C1203.5399%2C1203.0218%2C1203.5818%2C1203.3713%2C1203.6773%2C1203.6175%2C1203.1215%2C1203.0621%2C1203.2115%2C1203.1110%2C1203.1710%2C1203.4203%2C1203.3403%2C1203.1026%2C1203.1113%2C1203.1521%2C1203.3648%2C1203.1375%2C1203.4738%2C1203.2240%2C1203.5852%2C1203.2653%2C1203.4377%2C1203.6762%2C1203.3692%2C1203.0628%2C1203.1947%2C1203.2199%2C1203.1669%2C1203.3858%2C1203.2668%2C1203.4737%2C1203.3203%2C1203.3602%2C1203.1628%2C1203.5220%2C1203.3862%2C1203.4495%2C1203.0568%2C1203.5901%2C1203.5319%2C1203.6705%2C1203.1403%2C1203.4792%2C1203.2717%2C1203.2918%2C1203.4406%2C1203.4306%2C1203.2731&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Exciton Mott transition in Si is investigated by using terahertz time-domain\nspectroscopy. The excitonic correlation as manifested by the 1s-2p resonance is\nobserved above the Mott density. The scattering rate of charge carriers is\nprominently enhanced at the proximity of Mott density, which is attributed to\nthe non-vanishing exciton correlation in the metallic electron-hole plasma.\nConcomitantly, the signature of plasmon-exciton coupling is observed in the\nloss function spectra."}, "authors": ["Takeshi Suzuki", "Ryo Shimano"], "author_detail": {"name": "Ryo Shimano"}, "author": "Ryo Shimano", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevLett.109.046402", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1203.5179v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1203.5179v2", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "5 pages, 3 figures", "arxiv_primary_category": {"term": "cond-mat.mes-hall", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.mes-hall", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "cond-mat.str-el", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1203.5179v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1203.5179v2", "journal_reference": null, "doi": "10.1103/PhysRevLett.109.046402", "fulltext": "Exciton Mott transition in Si revealed by terahertz spectroscopy\nTakeshi Suzuki and Ryo Shimano\n\narXiv:1203.5179v2 [cond-mat.mes-hall] 13 Jul 2012\n\nDepartment of Physics, The University of Tokyo, Tokyo 113-0033, Japan\n(Dated: August 11, 2018)\nWe investigate the exciton Mott transition in Si by using optical pump and terahertz probe\nspectroscopy. The density-dependent exciton ionization ratio α is quantitatively evaluated from the\nanalysis of dielectric function and conductivity spectra. The Mott density is clearly determined by\nthe rapid increase in α as a function of electron-hole (e-h) pair density, which agrees well with the\nvalue expected from the random phase approximation theory. However, exciton is sustained in the\nhigh-density metallic region above the Mott density as manifested by the 1s-2p excitonic resonance\nthat remains intact across the Mott density. Moreover, the charge carrier scattering rate is strongly\nenhanced slightly above the Mott density due to nonvanishing excitons, indicating the emergence of\nhighly correlated metallic phase in the photo-excited e-h system. Concomitantly, the loss function\nspectra exhibit the signature of plasmon-exciton coupling, i.e., the existence of a new collective\nmode of charge density excitation combined with the excitonic polarization at the proximity of\nMott density.\n\nThe electron-hole (e-h) system in photoexcited semiconductors has continued to attract interest over decades\nfrom the viewpoint of fundamental quantum many-body\nphysics and also because of its crucial importance in semiconductor optoelectronic devices. As the e-h pair density\nincreases, the charge neutral excitons, i.e., hydrogen-like\ne-h pairs that are usually formed in the low-density region, are dissociated into unbound electrons and holes\nand the system turns into a metallic e-h plasma phase.\nThe transition from the insulating exciton gas to the\nmetallic e-h plasma is referred to as the exciton Mott\ntransition or crossover [1–4]. Since the phenomenon is\npurely driven by electron-electron interaction, the phtoexcited e-h system offers an ideal playground to study\nthe insulator-to-metal transition (IMT) in the ensemble\nof composite Fermionic particles. It is also crucially important to know to what extent excitons can exist and\nto understand how the two particle (e-h) correlation is\nscreened as the density is raised for the investigation of\nexciton Bose Einstein condensate (BEC) [5] and excitonic\ninsulator (also termed as e-h BCS state) [6].\nThe exciton Mott density is defined as the density\nabove which no bound state can exist. In view of the\nenergy diagram, the Mott transition or crossover [7] is\nunderstood to occur when the band edge is lowered due\nto the band gap renormalization effect and reaches the 1s\nexciton energy as the e-h pair density increases, thereby\nresulting in the exciton binding energy vanishing [3, 8].\nIn bulk systems, the 1s exciton energy is considered to\nbe almost unchanged due to the cancellation between\nthe band gap renormalization and the reduction of the\nexciton binding energy. Such a picture explained quantitatively the behavior of 1s exciton resonance, e.g., in\na bulk GaAs as observed in the near-infrared optical\npump and probe experiments [9]. However, the continuous reduction of the exciton binding energy associated\nwith the exciton Mott transition has not yet been experimentally verified clearly. Moreover, recent experiments\n\nhave shown the signature of excitons near the Mott density [10–13] that cannot be accounted for by the above\npicture. While the exciton Mott transition has been extensively studied as a fundamental problem in quantum\nmany-body theory [3, 4, 8, 14–17, 19], the experimental\ninvestigation remains elusive, particularly on the behavior of the screened Coulomb interaction and the charge\ncarrier properties that are indispensable for understanding the global phase diagram of the photoexcited e-h system in semiconductors.\nTerahertz time-domain spectroscopy (THz-TDS) sheds\na new light on this problem. The recent developments\nof the optical pump and THz probe (OPTP) spectroscopy [11, 20, 21] and the ultrafast mid-infrared pump\nand probe spectroscopy [22] have made it possible to\nprobe the exciton population with a high temporal resolution through the observation of intra-exciton transitions that are typically located in the THz frequency\nrange (1 THz=4.14 meV). Importantly, THz-TDS allows\none to determine the complex dielectric function ǫ(ω) in\nthe very relevant energy scale of the exciton binding energy, providing direct information on the screening of the\nCoulomb interaction between electrons and holes. Indeed, the ultrafast dynamics of plasma screening in GaAs\nhas been elucidated by using the OPTP spectroscopy,\nshowing the buildup of a plasmon [23].\nIn this Letter, we quantitatively study the exciton\nMott transition in Si by using the OPTP spectroscopy.\nThe long carrier lifetime of the e-h system in Si [24] makes\nit possible to investigate the density-dependent phenomena in quasi-equilibrium condition without it suffering\nfrom the carrier lifetime effect. We evaluated the exciton\nionization ratio through quantitatively analyzing the dielectric function and conductivity spectra, from which we\ncould determine the Mott density unambiguously. This\nallows us to confirm that the excitons exist above the\nMott density. A Drude-Lorentz model analysis reveals\nthe prominent enhancement of charge carrier scattering\n\n\f2\n\nFigure 1(b) and (c) show the photo-induced change of\ndielectric function (ǫ(ω)) and optical conductivity (σ(ω))\nat the different e-h pair densities expressed in terms of\n\u00011/3\nrs parameter, rs = 3/4πna3B\nwhere n is the total\ne-h pair density and aB is the exciton Bohr radius. n\nis determined from the excitation pulse energy flux and\nthe absorption coefficient. The sample temperature is\nkept at 30 K and the delay time ∆t between the pump\npulse and the probe pulse is fixed to 4 ns where the e-h\nsystem is considered to reach thermal equilibrium with\nthe lattice system [26]. Note that the Mott density at\n30 K calculated from the random phase approximation\n(RPA) theory is rs = 3.0 [27]. In the low-density region\nof rs = 6.0, the dielectric function and the conductivity\nspectra are dominated by the excitonic 1s-2p resonance\naround 12 meV with an additional Drude component as\nindicated by the negative dielectric constant in the lowenergy region below 5 meV that is caused by thermally\nionized unbound e-h pairs. As e-h pair density increases\nup to rs = 2.0, the sign of dielectric function below 5\nmeV changes from negative to positive, indicating the\n\n∆t\n\nSample\n\n14.7 meV\n\n2P\n1S\n\n1.17 eV\n\npump\n\nEopt\nprobe\n\nETHz\n\n(b) ×1/15\n\nrs=1.8\n\n×1/12\n\nrs=2.0\n\n×1/10\n\nrs=2.2\n\n×1/6\n\nrs=2.5\n\n×1/2\n\nrs=4.0\n\n0.4\n0.2\n0.0\n-0.2\n-0.4\n0\n\n(c)\n\n×1/15\n\n×1/12\n\n∆σ (Ω-1cm-1)\n\nTo investigate the spectral range covering the exciton binding energy of 14.7 meV in Si, we performed\nbroadband THz spectroscopy as schematically shown in\nFig. 1(a). For a light source, we used a Ti:sapphireregenerative amplifier with the pulse duration of 25 fs,\nthe repetition rate of 1 kHz, and the center wavelength\nof 800 nm (1.55 eV). The output from the amplifier was\ndivided into three beams for THz generation, THz detection, and for the above-gap optical excitation of e-h pairs,\nrespectively. The THz-probe pulse was generated from a\n300 μm thick (110)-oriented GaP crystal by the optical\nrectification of the laser pulse. To detect the THz-probe\npulse transmitted after the sample, the electro-optic sampling method was adopted by using a (110)-oriented GaP\ncrystal. The obtained THz spectral range was between\n0.5 THz (2 meV) to 6 THz (25 meV). For a sample,\nwe used a high-purity and high-resistivity (10 kΩcm at\nroom temperature) Si single crystal of (001) surface. The\nsample was polished to a thickness of 22 μm, which was\nthinner than the penetration depth of the optical pump\nat the measurement temperature (27 μm at 30 K), and\ndensity was distributed almost uniformly in the depth direction. The sample was freely mounted inside a He-gas\nflow cryostat and kept at temperature higher than 30 K\nin all the measurements, i.e. above the critical temperature of e-h droplets (EHD) in Si, Tc =23 K [25], to avoid\nthe formation of EHD.\n\n(a)\n\n∆ε\n\nrate slightly above the Mott density, rendering the metallic e-h plasma phase highly correlated. Moreover, the loss\nfunction spectra Im(−1/ǫ(ω)) that corresponds to the\ndensity-density correlation function exhibits a new collective mode of plasmon coupled to the excitonic polarization, which is apparently beyond the picture of standard\nsingle-plasmon pole approximation.\n\n×1/10\n\n×1/6\n\n×1/2\n\n1.5\n1.0\n0.5\n0.0\n25\n0\n\nrs=6.0\n\n5\n\n10 15\n\n20\n\n5\n\n10 15\n\n20\n\n25\n\nPhoton Energy (meV) Photon Energy (meV)\nFIG. 1: (Color online) (a) Schematics of the optical-pump\nand THz-probe experiment and the band structure of Si. (b)\nPhoto-induced change of dielectric function and (c) optical\nconductivity at the indicated e-h pair density expressed in\nterms of rs parameter (mean interparticles distance normalized by the exciton Bohr radius). The sample temperature is\nkept at 30 K, and the pump-probe delay time ∆t is fixed to 4\nns. The solid lines represent Drude-Lorentz fits (see text for\ndetails).\n\nsuppression of the Drude component. Notably, the excitonic response is sustained even above the Mott density\nas manifested by the prominent dispersive structure in\nǫ(ω) as well as by the peak structure around 12 meV in\nthe σ(ω) spectrum. At higher density (rs = 1.8), the\ndielectric function becomes negative in the whole spectral range, indicating the metallic nature of the e-h system, whereas the excitonic structure is still discerned.\nStrikingly, the excitonic 1s-2p transition energy barely\nchanges as density increases, in contrast to the conventional picture of the exciton Mott transition that predicts\nthe continuous reduction of the exciton binding energy.\nAll these features show the robustness of excitonic e-h\npair correlation in the vicinity of Mott density.\nTo view more quantitatively, we fitted the experimental results with the Drude-Lorentz model, according to\nwhich the dielectric function is written as\nǫ(ω) = ǫb −\n\n2\nωpl\n1\nnex e2\n, (1)\n−\n2 + iωγ\nω(ω + iγD )\nǫ0 μ ω 2 − ωex\nex\n\n\f3\nDensity (1016cm-3)\n10 20\n\n(d) 0.10\n0.08\n\n(a)\nωpl\nωex\n\n30\n20\n\nIm(-ε-1)\n\n40\n\n4\n\n2\n\n10\n0\n20\n\n1.0\n\n(b)\n\n0.8\n\nnD\nnex\nα\n\n15\n10\n\n0.6\n0.4\n\n5\n\n0.2\n0.0\n\n0\n\nγD\nγex\n\n15\n10\n5\n6\n\n5\n\n4\n\nrs\n\n3\n\n2\n\nω + rs=1.8\nωrs=2.5\n\nrs=3.2\n\nrs=6.0\n10\n5\n\n10\n\n15\n\n20\n\n25\n\nPhoton Energy (meV)\n(e)\n\n(c)\n\n20\n\n0\n\n0.06\n0.04\n0.02\n0.00\n0.08\n0.06\n0.04\n0.02\n0.00\n0.08\n0.06\n0.04\n0.02\n0.00\n0.08\n0.06\n0.04\n0.02\n0.00 0\n\nEnergy (meV)\n\n25\n\nIonization ratio\n\nDamping (meV) Density (1016cm-3) Energy (meV)\n\n1\n\nDensity (1016cm-3)\n\n20 1\n\n4\n\n2\n\nω+\n\n15\n10\n\nω'ex\n\n5\n0\n\n10 20\n\nω'pl\n6\n\nω5\n\n4\n\nrs\n\n3\n\n2\n\nFIG. 2: (Color online) (a)-(c) The parameters determined\nfrom the Drude-Lorentz fits in Fig. 1(b) and (c). (a) The\nplasma frequency (closed triangles) and the exciton 1s-2p\ntransition energy (open triangles), (b) the density of unbound\ne-h pairs (closed diamonds), 1s exciton (open diamonds) and\nthe ionization ratio (closed circles), (c) the damping of the\nDrude term (closed squares) and the Lorentz term (open\nsquares). The vertical dotted line represents the RPA Mott\ndensity (rs = 3.0) at 30 K. (d) The loss function spectra\nat TL =30 K and ∆t =4 ns at the indicated rs parameter.\nThe solid curves show the double Lorentz fits. (e) Density\ndependence of two peaks (ω+ and ω− ) identified in the loss\nfunction spectra. The shaded area indicates the width of the\ntwo modes obtained from the fitting in (d). Dashed lines;\n′\nthe exciton 1s-2p resonance (ωex\n) and the screened plasma\n′\nfrequency (ωpl ) determined from (a).\n\nwhere ǫb =11.7 is the background dielectric constant [28],\nγD and γex are the damping rate of free carriers (unbound\ne-h pairs) and 1s excitons, respectively. ωpl =\np\nnD e2 /ǫ0 m∗ is the plasma frequency with nD the unbound e-h pair density, ǫ0 and m∗ = 0.16m0 being the\nvacuum permittivity and optical mass of free carriers in\nSi [29]. In the low-density region where the excitons can\nbe viewed as well-defined bound states, nex corresponds\nto the 1s exciton density. μ = 0.123m0 is the reduced\nexciton mass [30].\nThe experimental results of ǫ(ω) and σ(ω) are well reproduced by the Drude-Lorentz fits, as shown by the\nsolid lines in Fig. 1(b) and (c). A slight deviation is\nobserved in the high energy side of σ(ω) spectrum at\nrs =6.0 and 4.0, which can be attributed to the higher\nlying exciton Rydberg states, which are not taken into\n\naccount in Eq. (1). This deviation decreases as the e-h\npair density increases, plausibly due to the suppression\nof higher Rydberg states with large Bohr radius in the\nhigh-density regime. The parameters determined from\nthe fits are summarized in Fig. 2(a)-(c). Figure 2(a)\nclearly shows that ωex barely changes across the Mott\ndensity(rs = 3). From the unbound e-h pair density\nnD extracted from the plasma frequency, and the exciton density nex , we can determine the ionization ratio as\ndefined by α = nD /(nD + nex ) as plotted in Fig. 2(b).\nNote that the total density nD + nex obtained from the\nDrude-Lorentz fits is consistent with the rs parameter\nwithin the accuracy of 10 % at all densities. As the density is raised, the ionization ratio first decreases toward\nthe Mott density and rapidly increases at the Mott density. Interestingly, the ionization ratio does not reach\nunity above the Mott density, which originates from the\nremaining excitonic structure in ǫ(ω) and σ(ω) spectra\nabove the Mott density. Such a density dependence of\nthe exciton ionization ratio coincides quantitatively with\nthe theoretical calculation [4, 17, 18] where the existence\nof a correlation in the scattered state of e-h pairs above\nthe Mott density was demonstrated. Recently, the pair\ncorrelation in the e-h plasma was shown to appear as a\nbroad structure near the exciton 1s-2p resonance in the\nTHz absorption spectrum [19]. At the highest density of\nrs = 1.8, the scattering rate of Lorentz term (γX ) is comparable to the transition energy (ωex ), and therefore the\nexcitonic structure observed in such high density on the\ntop of the broad Drude-like structure should be better\nviewed as e-h pair correlation rather than the population of well-defined 1s excitons. However, the damping\nrate of the Lorentz term slowly increases from below the\nMott density (Fig. 2(c)). This behavior indicates that\nthe excitons sustained above the Mott density smoothly\nchange into the unbound but correlated e-h pairs, keeping\ntheir resonance intact. In contrast, the ionization ratio\nshows a steep increase at the Mott density, suggesting\nthat above the Mott density the photo-injected carriers\nare mostly transferred into free carriers but not to the\nsustaining excitons. If there exists a spatially inhomogeneous distribution or a phase separation of charge carrier\ndensity, excitons may be sustained above the Mott density in the dilute region between the dense carrier region.\nHowever, we consider such a scenario to be implausible\nsince, as shown in Fig. 2 (a), the plasma frequency, i.e.\nthe free carrier density, continuously increases across the\nMott density without exhibiting the signature of first order phase transition that results in the phase separation.\nInterestingly, the Drude scattering term is found to increase drastically just above the Mott density and then\ndecreases as the density is raised as shown in Fig. 2(c).\nThis prominent enhancement of the Drude scattering rate\naccounts for the suppression of negative contribution in\nthe dielectric function at rs =2.5 and 2.2, giving rise to\nthe positive dielectric constant in the low-energy region\n\n\f4\nemerges around 12 meV, although broadened, which is\nassigned to the 1s-2p excitonic transition. At lower temperature, the growth of excitonic structure is discerned\nand correspondingly the red shift of the plasmon resonance is observed. This feature indicates the spectral\nweight transfer from free electrons and holes to excitons.\nConcomitantly, the plasmon peak rapidly broadens as\nshown in Fig. 3(b). Below 40 K, two peaks are clearly\ndistinguished, while these resonances should be viewed\nas the coupled modes of plasmons and excitons. Figure 3(c) plots the temperature dependence of the Drude\nscattering rate determined from the Drude-Lorentz fits at\ndifferent density of rs = 6.0 and rs = 3.1. As the temperature is raised, the scattering rate first decreases and then\nexhibits an upturn. This nonmonotonic temperature dependence becomes more pronounced at rs = 3.1 near the\nMott density. It is interesting to note that recently a similar behavior has been reported in the low-energy optical\nresponse of Bi in the vicinity of semimetal to semiconductor transition, where the pronounced damping of the\nDrude scattering rate was interpreted as evidence of the\ncoupling of plasmons to charge carriers, namely the plasmarons [33, 34]. In the present case of the photoexcited\ne-h system, the nonmonotonic temperature and density\ndependence of the Drude scattering rate, which is pronounced at the proximity of Mott density, originates from\nthe exciton that emerges below 60 K.\n200\n\n0.16\n\n180\n\n0.14\n\n160\n\n0.12\n\n(b) 0.18\n\n200 K\n\n0.12\n0.06\n0.00\n\n120 K\n\n0.12\n\n140\n\n0.1\n\n120\n\nIm(-ε-1)\n\n(a)\n\nTemperature (K)\n\n0.06\n0.00\n\n60 K\n\n0.12\n0.06\n0.00\n\n0.08\n\n30 K\n\n0.12\n0.06\n0.00\n0\n\n100\n0.06\n\n5\n\n10\n\n15\n\n20\n\n25\n\nPhoton Energy (meV)\n\n80\n0.04\n60\n0.02\n40\n5\n\n10\n\n15\n\n20\n\n25 0\n\nPhoton Energy (meV)\n\n(c)\n\n12\n10\n8\n6\n4\n2\n0\n\nγD (meV)\n\nbelow 5 meV. Such a nonmonotonic behavior of Drude\nscattering term is not accounted for by electron-hole scattering, which should be approximately linear with density. Instead, the main contribution to the enhancement\nof Drude scattering rate is attributed to the interaction\nbetween the charge carriers and the excitons, which is further confirmed by the temperature dependence as shown\nlater (Fig. 3(c)). Although the e-h system at the measured temperature of 30 K does not degenerate since\nkB T = 2.6 meV is larger than the EF ∼ 1 meV at rs =2.5\nfor both electrons and holes, the observed scattering rate\nof 25 meV is one order of magnitude larger than the kinetic energy of free carriers, suggesting the bad metal\nnature of charge carriers in this density region.\nHaving seen that the exciton is sustained in the metallic e-h plasma, we plot in Fig. 2(d) the loss function\nspectra Im(−1/ǫ(ω)). Note that the peak of Im(−1/ǫ(ω))\nindicates the longitudinal collective modes of the system.\nIn the low-density region, two separate peaks are clearly\nidentified; the sharp peak at the lower-energy side corresponds to the (q = 0) plasmons and the higher one corresponds to the longitudinal mode associated with the\nexciton 1s-2p transition. As e-h pair density increases,\nthe plasmon resonance shifts to the high-energy side but\ndoes not intersect with the exciton branch. The anticrossing behavior is more clearly seen in Fig. 2(e), where\nwe plot the density(rs )-dependence of the peak positions\ndetermined from a phenomenological double-Lorentzian\nfits (solid lines in Fig. 2(d)). The hatched area indicates\nthe FWHM of each mode determined from the Lorentzian\nfits. We also plot in Fig. 2(e) the bare exciton 1s-2p reso√\n′\nnance and the screened plasma frequency ωpl\n= ωpl / ǫb\nobtained from Fig. 1(b) (dashed lines). In the density\nregion where the level anti-crossing occurs and therefore\nthe plasmon-exciton coupling is pronounced, the plasmon rapidly broadens. This broadening of the plasmon\nmode is ascribed to the existence of the exciton. While\nthe plasmon damping caused by the single-particle excitations is restricted at q = 0, here the plasmon damping is caused by the presence of the exciton to which\nthe plasmon couples. Such a coupling between plasmons\nand other bosonic excitations is generic when their resonances come closer, as exemplified by the plasmon-LO\nphonon coupling [32]. In the present case, however, the\ncoupling is purely electronic, suggesting the coupled nature of long-wavelength charge density fluctuation with\nthe excitonic e-h pair correlation.\nFigure 3 (a) presents the temperature dependence of\nthe loss function spectra Im(−1/ǫ(ω)) under the excitation condition of rs = 3.1 and at the pump-probe delay\nof 4 ns. The loss function spectra at several temperatures are also shown in Fig. 3(b). At high temperature, the peak at 5 meV is assigned to the pure plasmon mode. As the temperature is lowered to 100 K, the\npeak gradually sharpens due to the reduction of scattering rate with phonons. Below 100 K, an additional peak\n\nrs=3.1\nrs=6.0\n40\n\n80\n\n120\n\n160\n\n200\n\nTemperature (K)\n\nFIG. 3: (Color online) (a)Temperature dependence of the loss\nfunction spectra at ∆t =4 ns and rs = 3.1. (b) Loss function\nspectra at indicated temperature. Solid curves show the fitting with a double Lorentz model. The peak positions are\nindicated by the closed and open circles. (c) Temperature\ndependence of the Drude scattering rate (Eq.(1)) for rs = 3.1\nand rs = 6.\n\nIn summary, we have investigated the exciton Mott\ntransition in Si by using OPTP spectroscopy. Moreover,\nTHz spectroscopy enabled us to evaluate quantitatively\nthe exciton ionization ratio from which the Mott density\n\n\f5\nis unambiguously determined. The energy position of the\nexcitonic 1s-2p transition barely changes as the density\nincreases and is sustained in the metallic phase above\nthe Mott density. The Drude scattering rate of charge\ncarriers is largely pronounced near above the Mott density, indicating the emergence of highly correlated metallic phase due to the existence of nonvanishing excitons.\nConcomitantly, the loss function spectrum exhibits coupled behavior of plasmons and excitons near the Mott\ndensity, giving rise to a new collective mode of charge\ndensity excitation. Since THz spectroscopy directly provides the information of e-h pair correlation through the\nspectrum of the dielectric function in the very relevant\nenergy scale, it would be useful to explore the possibility\nof exciton BEC and e-h BCS, and to investigate further\nIMT in a wide range of materials.\nWe wish to acknowledge helpful discussions with T.\nM. Rice. This work was in part supported by Grant-inAid for Scientific Research (Grants No. 22244036, No.\n23104705, No. 20110005) and by the Photon Frontier\nNetwork Program from MEXT, Japan.\n\n[1] N. F. Mott, Rev. Mod. Phys. 40, 677 (1968).\n[2] R. Zimmermann, Many-Particle Theory of Highly Excited Semiconductors, (Teubner, Leipzig, 1988).\n[3] R. Zimmermann, K. Kilimann, W. D. Kraeft, D. Kremp,\nand G. Röpke, Phys. Status Solidi (b) 90, 175 (1978).\n[4] R. Zimmerman and H. Stolz, Phys. Status Solidi (b) 131,\n151 (1985).\n[5] For a review, see e.g., A. Griffin, D. W. Snoke,\nS. Stringari, Bose-Einstein Condensation, (Cambridge\nUniv. Press, Cambridge,1995).\n[6] L. V. Keldysh and Y. V. Kopaev, Sov. Phys. Solid State\n6, 2219 (1965).\n[7] Hereafter we use the term Mott transition although it\nshould be viewed as crossover at high temperature.\n[8] H. Haug and Schmit-Rink, Prog. Quantum Electron 9, 3\n(1984).\n[9] G. W. Fehrenbach, W. Schafer, J. Treusch, and R. G.\nUlbrich, Phys. Rev. Lett. 49, 1281 (1982).\n[10] Y. Hayamizu, M. Yoshita, Y. Takahashi, H. Akiyama, C.\nZ. Ning, L. N. Pfeiffer, and K. W. West, Phys. Rev. Lett\n99, 167403 (2007), see also [14]\n[11] T. Suzuki and R. Shimano, Phys. Rev. Lett. 103, 057401\n(2009).\n\n[12] L. Kappei, J. Szczytko, F. Morier-Genoud, and B. Deveaud, Phys. Rev. Lett. 94, 147403 (2005).\n[13] R. Shimano and T. Suzuki, Phys. Status Solidi (c) 8,\n1153 (2011).\n[14] T. Yoshioka and K. Asano, Phys. Rev. Lett. 107, 256403\n(2011).\n[15] N. H. Kwong, G. Rupper, and R. Binder, Phys. Rev. B\n79, 155205 (2009).\n[16] G. Manzke, Q. Y. Peng, K. Henneberger, U. Neukirch, K.\nHauke, K. Wundke, J. Gutowski, and D. Hommel, Phys.\nRev. Lett. 80, 4943 (1998).\n[17] D. Semkat, F. Richter, D. Kremp, G. Manzke, W. D.\nKraeft, and K. Henneberger, Phys. Rev. B 80, 155201\n(2009).\n[18] H. Stolz and R. Zimmermann, Phys. Status Solidi (b) 94,\n135 (1979).\n[19] M. Kira and S. W. Koch, Progress in Quantum Electronics 30, 155 (2006).\n[20] R. A. Kaindl, M. A. Carnahan, D. Hagele, R. Lovenihc,\nand D. S. Chemla, Nature 423, 734 (2003).\n[21] R. Ulbricht, E. Hendry, J. Shan, T. F. Heinz and M.\nBonn, Rev. Mod. Phys. 83, 543 (2011).\n[22] M. Kubouchi, K. Yoshioka, R. Shimano, A. Mysyrowicz,\nand M. Kuwata-Gonokami, Phys. Rev. Lett. 94, 016403\n(2005).\n[23] R. Huber, F. Tauser, A. Brodschelm, M. Bichler, G. Abstreiter, and A. Leitenstorfer, Nature 414, 286 (2001).\n[24] R. B. Hammond and R. N. Shilver, Appl. Phys. Lett. 36,\n68 (1980).\n[25] A. Forchel, B. Laurich, J. Wagner, W. Schmid, and T. L.\nReinecke, Phys. Rev. B 25, 2730 (1982).\n[26] T. Suzuki and R. Shimano, Phys. Rev. B 83, 085207\n(2011).\n[27] G. B. Norris and K. K. Bajaj, Phys. Rev. B 26, 6706\n(1982).\n[28] M. van Exter and D. Grischkowsky, Appl. Phys. Lett.\n56, 1694 (1990).\n[29] D. M. Riffe, J. Opt. Soc. Am. B 19, 1092 (2002).\n[30] Nunzio O. Lipari and A.Baldereschi, Phys. Rev. B 3,\n2497 (1971).\n[31] S. W. Koch, W. Hoyer, M. Kira, and V. S. Filinov, Phys.\nStatus Solidi (b) 238, 404 (2003).\n[32] A. Mooradian and A. L. McWhorter, Phys. Rev. Lett.\n19, 849 (1967).\n[33] R. Tediosi, N. P. Armitage, E. Giannini, and D. van der\nMarel, Phys. Rev. Lett. 99, 016406 (2007).\n[34] N. P. Armitage, R. Tediosi, F. Lévy, E. Giannini, L.\nForro, and D. van der Marel, Phys. Rev. Lett. 104,\n237401 (2010).\n\n\f"}