{"id": "http://arxiv.org/abs/1002.2065v1", "guidislink": true, "updated": "2010-02-10T10:52:18Z", "updated_parsed": [2010, 2, 10, 10, 52, 18, 2, 41, 0], "published": "2010-02-10T10:52:18Z", "published_parsed": [2010, 2, 10, 10, 52, 18, 2, 41, 0], "title": "Molecular dynamics simulations of glassy polymers", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1002.3631%2C1002.2543%2C1002.0975%2C1002.0161%2C1002.2536%2C1002.4868%2C1002.2708%2C1002.0305%2C1002.0295%2C1002.3348%2C1002.1932%2C1002.1526%2C1002.0738%2C1002.3943%2C1002.0311%2C1002.2213%2C1002.2065%2C1002.2320%2C1002.1227%2C1002.0965%2C1002.3936%2C1002.2476%2C1002.4883%2C1002.4651%2C1002.3381%2C1002.0897%2C1002.2007%2C1002.2235%2C1002.0060%2C1002.2156%2C1002.3802%2C1002.1531%2C1002.2825%2C1002.0194%2C1002.4398%2C1002.1644%2C1002.3087%2C1002.0739%2C1002.4615%2C1002.0573%2C1002.3549%2C1002.1561%2C1002.4838%2C1002.1942%2C1002.3561%2C1002.3715%2C1002.0857%2C1002.1004%2C1002.2848%2C1002.1032%2C1002.1948%2C1002.4544%2C1002.1993%2C1002.1685%2C1002.0672%2C1002.1458%2C1002.4520%2C1002.3543%2C1002.1854%2C1002.3806%2C1002.2139%2C1002.1101%2C1002.3831%2C1002.3292%2C1002.0562%2C1002.3746%2C1002.3985%2C1002.4950%2C1002.4369%2C1002.2739%2C1002.3649%2C1002.3024%2C1002.1018%2C1002.0593%2C1002.4118%2C1002.4889%2C1002.0278%2C1002.0079%2C1002.4048%2C1002.0331%2C1002.4800%2C1002.0088%2C1002.1928%2C1002.4298%2C1002.2341%2C1002.2171%2C1002.2649%2C1002.1377%2C1002.2885%2C1002.4472%2C1002.4152%2C1002.3541%2C1002.3346%2C1002.2211%2C1002.0392%2C1002.3497%2C1002.4698%2C1002.0052%2C1002.4938%2C1002.1510%2C1002.3605&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Molecular dynamics simulations of glassy polymers"}, "summary": "We review recent results from computer simulation studies of polymer glasses,\nfrom chain dynamics around the glass transition temperature Tg to the\nmechanical behaviour below Tg. These results clearly show that modern computer\nsimulations are able to address and give clear answers to some important issues\nin the field, in spite of the obvious limitations in terms of length and time\nscales. In the present review we discuss the cooling rate effects, and dynamic\nslowing down of different relaxation processes when approaching Tg for both\nmodel and chemistry-specific polymer glasses. The impact of geometric\nconfinement on the glass transition is discussed in detail. We also show that\ncomputer simulations are very useful tools to study structure and mechanical\nresponse of glassy polymers. The influence of large deformations on mechanical\nbehaviour of polymer glasses in general, and strain hardening effect in\nparticular are reviewed. Finally, we suggest some directions for future\nresearch, which we believe will be soon within the capabilities of state of the\nart computer simulations, and correspond to problems of fundamental interest.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1002.3631%2C1002.2543%2C1002.0975%2C1002.0161%2C1002.2536%2C1002.4868%2C1002.2708%2C1002.0305%2C1002.0295%2C1002.3348%2C1002.1932%2C1002.1526%2C1002.0738%2C1002.3943%2C1002.0311%2C1002.2213%2C1002.2065%2C1002.2320%2C1002.1227%2C1002.0965%2C1002.3936%2C1002.2476%2C1002.4883%2C1002.4651%2C1002.3381%2C1002.0897%2C1002.2007%2C1002.2235%2C1002.0060%2C1002.2156%2C1002.3802%2C1002.1531%2C1002.2825%2C1002.0194%2C1002.4398%2C1002.1644%2C1002.3087%2C1002.0739%2C1002.4615%2C1002.0573%2C1002.3549%2C1002.1561%2C1002.4838%2C1002.1942%2C1002.3561%2C1002.3715%2C1002.0857%2C1002.1004%2C1002.2848%2C1002.1032%2C1002.1948%2C1002.4544%2C1002.1993%2C1002.1685%2C1002.0672%2C1002.1458%2C1002.4520%2C1002.3543%2C1002.1854%2C1002.3806%2C1002.2139%2C1002.1101%2C1002.3831%2C1002.3292%2C1002.0562%2C1002.3746%2C1002.3985%2C1002.4950%2C1002.4369%2C1002.2739%2C1002.3649%2C1002.3024%2C1002.1018%2C1002.0593%2C1002.4118%2C1002.4889%2C1002.0278%2C1002.0079%2C1002.4048%2C1002.0331%2C1002.4800%2C1002.0088%2C1002.1928%2C1002.4298%2C1002.2341%2C1002.2171%2C1002.2649%2C1002.1377%2C1002.2885%2C1002.4472%2C1002.4152%2C1002.3541%2C1002.3346%2C1002.2211%2C1002.0392%2C1002.3497%2C1002.4698%2C1002.0052%2C1002.4938%2C1002.1510%2C1002.3605&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We review recent results from computer simulation studies of polymer glasses,\nfrom chain dynamics around the glass transition temperature Tg to the\nmechanical behaviour below Tg. These results clearly show that modern computer\nsimulations are able to address and give clear answers to some important issues\nin the field, in spite of the obvious limitations in terms of length and time\nscales. In the present review we discuss the cooling rate effects, and dynamic\nslowing down of different relaxation processes when approaching Tg for both\nmodel and chemistry-specific polymer glasses. The impact of geometric\nconfinement on the glass transition is discussed in detail. We also show that\ncomputer simulations are very useful tools to study structure and mechanical\nresponse of glassy polymers. The influence of large deformations on mechanical\nbehaviour of polymer glasses in general, and strain hardening effect in\nparticular are reviewed. Finally, we suggest some directions for future\nresearch, which we believe will be soon within the capabilities of state of the\nart computer simulations, and correspond to problems of fundamental interest."}, "authors": ["Jean-Louis Barrat", "Joerg Baschnagel", "Alexei Lyulin"], "author_detail": {"name": "Alexei Lyulin"}, "author": "Alexei Lyulin", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1039/b927044b", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1002.2065v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1002.2065v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "To apear in \"Soft Matter\"", "arxiv_primary_category": {"term": "cond-mat.mtrl-sci", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.mtrl-sci", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1002.2065v1", "affiliation": "ICS", "arxiv_url": "http://arxiv.org/abs/1002.2065v1", "journal_reference": "Soft Matter 6 (2009) 3430", "doi": "10.1039/b927044b", "fulltext": "arXiv:1002.2065v1 [cond-mat.mtrl-sci] 10 Feb 2010\n\nMolecular dynamics simulations of glassy\npolymers\nJean-Louis Barrat∗\n\nJörg Baschnagel†\n\nAlexey Lyulin ‡\n\nFebruary 10, 2010\nAbstract\nWe review recent results from computer simulation studies of polymer glasses,\nfrom chain dynamics around glass transition temperature Tg to the mechanical behaviour below Tg . These results clearly show that modern computer simulations\nare able to address and give clear answers to some important issues in the field, in\nspite of the obvious limitations in terms of length and time scales. In the present\nreview we discuss the cooling rate effects, and dynamic slowing down of different\nrelaxation processes when approaching Tg for both model and chemistry-specific\npolymer glasses. The impact of geometric confinement on the glass transition is\ndiscussed in detail. We also show that computer simulations are very useful tools\nto study structure and mechanical response of glassy polymers. The influence of\nlarge deformations on mechanical behaviour of polymer glasses in general, and\nstrain hardening effect in particular are reviewed. Finally, we suggest some directions for future research, which we believe will be soon within the capabilities of\nstate of the art computer simulations, and correspond to problems of fundamental\ninterest.\n\n1 Introduction\nA polymer is a macromolecular chain resulting from the connection of a large number\nof monomeric units. The number of monomers (the chain length N) typically ranges\nbetween 103 and 105 in experimental studies of polymer melts [1]. Recently, this range\nof chain lengths has also become accessible in simulations [2, 3]. Such a long chain\nhas an open structure which is strongly pervaded by other chains in the melt [4]. The\nstrong interpenetration of the chains has important consequences for the properties\nof the melt. For instance, intrachain excluded volume interactions, which swell the\npolymer in dilute solution [1, 4], are almost screened so that a chain behaves on large\nlength scales approximately as a random coil [3]. Furthermore, chain interpenetration\nalso impacts the polymer dynamics by creating a temporary network of entanglements.\nEntanglements strongly slow down the chain relaxation and make the melt viscoelastic\nalready at high temperature [5, 6].\n∗ Université de Lyon; Univ. Lyon I, Laboratoire de Physique de la Matière Condensée et des Nanostructures; CNRS, UMR 5586, 43 Bvd. du 11 Nov. 1918, 69622 Villeurbanne Cedex, France\n† Institut Charles Sadron, Université de Strasbourg, CNRS UPR 22, 23 Rue du Loess, BP 84047, 67034\nStrasbourg Cedex 2, France\n‡ Group Theory of Polymers and Soft Matter, Eindhoven Polymer Laboratories, Technische Universiteit\nEindhoven, P.O. Box 513 5600 MB Eindhoven, the Netherlands, and Dutch Polymer Institute, P.O. Box 902,\n5600 AX Eindhoven, The Netherlands.\n\n1\n\n\fglass\n\nmelt\n\n0.48\n\nv\n\n0.46\n\nfast cooling\n\n0.44\n0.42\n0\n\nslow\ncooling\n\n0.2\n\nslow heating\n\n0.4\n\n0.6\n\n0.8\n\n1\n\nT\n\nsemicrystalline polymer\nFigure 1: Volume-temperature diagram of a coarse-grained model for poly(vinyl alcohol) [7, 8]. The volume per monomer (v) and the temperature (T ) are given in\nLennard-Jones units. In the liquid phase the chains have random-coil-like configurations and the structure of the melt is amorphous. The amorphous structure is preserved\non rapid cooling and the melt eventually undergoes a glass transition at low T . For\nslow cooling the melt transforms into a semicrystalline material in which sections of\nfolded chains order in lamellar sheets that coexist with amorphous regions. When the\ncrystal is slowly heated up (dashed line), it melts at a higher T than the temperature\nwhere crystallization occurs. This hysteresis is typical of first-order phase transitions.\nOn cooling toward low temperature the polymer melt eventually transforms into a\nsolid. Polymeric solids are either semicrystalline or glassy (Fig. 1) [9]. In the semicrystalline state amorphous regions are intercalated between crystalline lamellar sheets.\nThe sheets consist of chains which are folded back on themselves so that chain sections align parallel to each other [9, 10]. The ability to form crystals crucially depends\non the polymer microstructure. Only chains with regular configurations, e.g. isotatic or\nsyndiotatic orientations of the sidegroups or chains without sidegroups, can fold into\ncrystalline lamellae. However, even in these favorable cases full crystallization is hard\nto achieve [10].\nThis intrinsic difficulty to crystallize favors glass formation [11, 12, 13]. Polymer\nmelts either can be easily supercooled (Fig. 1) or, due to the irregular chain structure,\ndo not crystallize at all. An example for the former case is bisphenol-A polycarbonate (PC) [14], while examples for the latter involve homopolymers with atactic (bulky)\nsidegroups, such as atactic polystyrene (PS), or random copolymers, such as cis-trans1,4-polybutadiene (PBD). These polymeric glass formers share with other (intermediate and fragile) glass-forming liquids the key characteristic feature of the glass transition; that is, little change of the amorphous structure, but a huge non-Arrhenius-like\nslowing down of the dynamics on cooling toward the glass transition temperature Tg\n[12, 13, 15]. Understanding the molecular origin of this disproportionate behaviour\nrepresents a great scientific challenge [12, 13, 15, 16, 17]. In addition to this fundamental interest in the study of the glass transition, solid polymers are also integral components in many modern applications [18]. For instance, glassy polymeric materials\nare appreciated because of their spectacular mechanical properties [19, 20, 21]. Instead\nof failing abruptly when subject to strong deformations, some polymers, such as polycarbonate, may harden for large strains, leading to a tough mechanical response. A\nmicroscopic understanding, elucidating the structure-property relationship, of this be2\n\n\fhaviour is still elusive. A further example is provided by thin polymer films, extensively\nused in technological applications as protective coatings, optical coatings, adhesives,\netc. In the ongoing quest for progressively smaller structures and devices these films\nmay attain nanoscopic dimensions, where deviations from the bulk behaviour should\nbe expected [22]. Indeed, many recent studies suggest that the Tg of thin films is shifted\nby spatial confinement, a striking observation which is not well understood yet [23, 24].\nThis wide array of challenging questions-from the glass transition to the impact\nof external stimuli-bestows the theoretical understanding of glassy polymers with\nparticular significance. Molecular simulations can contribute to this research. Over\nthe past two decades, computational models and methods have been developed for\nsimulating these glassy systems. The progress made in the field has regularly been\nthe subject of topical reviews. For instance, detailed reports of chemically realistic\nmodeling approaches may be found in Refs. [25, 26, 27], while work on coarse-grained\nmodels is reviewed in Refs. [28, 29, 30, 31, 32, 27]. The purpose of the present article\nis to give a brief account of recent work.\nWe begin our survey by a short introduction to the modeling of polymers in simulations (section 2). The glass transition temperature naturally splits the following\ndiscussion into two parts, a part devoted to the properties of the model glass formers\nabove Tg (section 3) and a part addressing sub-Tg phenomena (section 4). In section 3,\nour discussion is mainly concerned with the dynamics of weakly supercooled polymer\nmelts and the impact of spatial confinement on their behaviour. Section 4 focuses on\nthe response of polymeric glasses to both weak and large external deformation, where\nrespectively the linear mechanical behaviour of the glassy melt and its approach to\nmaterial failure will be explored. The article concludes with a short summary of the\npresented results and an outlook on possible future research directions.\n\n2 Computer simulations: models and computational aspects\nMolecular simulations of glass-forming polymers face the important challenge that\nthe structure and dynamics of these systems are governed by a large spread of length\nand time scales [33, 34]. The relevant length scales extend from the atomic diameter\n(∼ 10−10 m) to the chain dimension (∼ 10−7 m for N ∼ 104 ). The spread of time\nscales is even larger; it ranges from bond vibrations (∼ 10−13 s) to the slow structural\nrelaxation close to Tg (∼ 102 s).\nFrom the inspection of these scales, it is clear that simulation approaches have some\nlimitations and also require simplifications. An obvious limitation are the accessible\ntime scales. With the currently available computer power the longest time that can\nbe reached in molecular dynamics (MD) simulations is roughly a few μ s. This time\nscale is 8 orders of magnitude smaller than the relaxation time at the experimental Tg ,\nimplying that the simulated Tg is shifted by about 25 degrees to higher temperature (T )\nb 3 K). The\nrelative to experiments (where we used the rule of thumb: 1 decade in time ≈\nsimplifications that are currently necessary concern the simulation models which are\nobtained by some kind of coarse-graining procedure, designed to eliminate (some) fast\ndegrees of freedom by incorporating them in effective potentials. This model-building\nstep can take different levels of complexity [35, 36, 2, 37], but roughly speaking, there\nare two families, atomistic models and coarse-grained models. In the following, we\nbriefly introduce these models and discuss their strengths and weaknesses as we go.\n\n3\n\n\fBefore doing so, however, we want to point out some general appealing features of\nthe simulations to balance the reservations expressed above. The simulations offer full\ncontrol over the perfectly defined system under study. For instance, it is possible to vary\nin a systematic manner parameters, such as chain stiffness, chain length, etc., while\nkeeping all other defining properties of the model, so as to single out the impact of each\nparameter on the properties of the system. Furthermore, the simulations enable one to\nstudy local properties or to explore correlations which are hard (or even impossible) to\naccess in experiments. This provides microscopic insight and a means to test theoretical\nconcepts. Examples from the recent literature involve investigations of the potential\nenergy landscape of glass-forming materials [38, 39, 40], of single-molecule diffusion\nin polymeric matrices [41, 42] or of fracture in glassy polymers [27]\nAtomistic models. Atomistic models replace electronic degrees of freedom by force\nfields, i.e., empirical potentials for bond-length, bond-angle, torsional-angle, and nonbonded interactions, whose parameters are determined from quantum-chemical calculations and experiments [26, 35]. During the past decades, force fields have been\ndeveloped for both explicit atom (EA) models, treating every atom present in nature\nas a separate interaction site, and united atom (UA) models which represent a small\nnumber of real atoms (e.g., CH2 or CH3 ) by a single site. The reduction of the number of interaction sites in the UA model has the computational advantage of allowing\nlonger simulation times. With a time step of ∼ 10−15 s a few thousand united atoms\ncan be simulated over several 100 ns, about an order of magnitude longer than an EA\nsimulation of comparable system size.\nBoth EA and UA models were employed to study the properties of glassy polymers (see e.g. [25, 26, 27] for reviews). Recent examples include polyisoprene (EA\nmodel [43, 44]), atactic PS (UA model [45, 46, 47, 48, 49]), bisphenol-A PC (UA\nmodel [48, 49]) 1,4-PBD (UA and EA models [26, 50, 51, 52, 53, 54, 55, 56]), and\npoly(ethylene oxide) or atactic poly(propylene oxide) (EA models [57]). Certainly, the\nmain strength of these modeling efforts is that the simulation results allow for a direct\ncomparison with experiments. In some cases, such a comparison is possible with commercial software packages [56], while a careful fine-tuning of the force field is often\nrequired [50, 54]. Experience from those modeling approaches-not only for polymers but also e.g. for amorphous SiO2 [31, 58]-suggests that the design of a chemically realistic model, aiming at a parameter-free comparison between simulation and\nexperiment, should involve information about both structural and dynamic properties\n[26].\nGeneric models. Atomistic simulations are ideally suited to study specific polymers,\nincluding their glass transition and the properties of the glassy state. On the other\nhand, the strong increase of the relaxation time, which eventually leads to vitrification on cooling through Tg , is common to all glass-forming polymers, irrespective of\ntheir chemical composition and architecture. This universal aspect suggests to employ simplified simulation models which only retain generic features of a polymer.\nVarious such generic models-on a lattice [31, 30, 28, 28] or in the spatial continuum [31, 30, 32]-have been studied for glass-forming polymers. In the continuum,\nthe simplest model are highly flexible bead-spring models, where spherical monomers\nare tethered together by springs and have nonbonded, Lennard-Jones (LJ) interactions\n[31, 30, 32]. More chemical realism can be introduced by making the chains semiflexible, through the addition of a bond-angle potential [59] and, possibly also, of a\n\n4\n\n\ftorsional potential [60, 61, 62]. Due to their simplicity, these generic models allow for\nan efficient simulation. This is important if one wants to vary the cooling rate [63] or\nthe strain rate [27] over decades, to explore systematically the impact of model parameters, such as chain length or chain flexibility [59, 60, 61, 62], or to obtain good statistics\nfor comparison with theory [64]. Computational expedience is also important for exploratory studies of more complex systems, such as inhomogeneous polymer systems\n(e.g., polymer films, nanocomposites, semi-crystalline polymers) or glassy polymer\nmixtures (e.g., dynamically asymmetric polymer-polymer mixtures or polymer-solvent\nsystems). Some examples will be discussed in Sects. 3 and 4.\nHierarchical models. For generic models, the gain in the accessible length and time\nscales is obtained at the expense of a loss of correlation to the atomistic conformation of the polymer. For many problems in materials research, this loss is undesirable.\nTherefore, much research efforts currently goes into the development of hierarchical\napproaches consisting of interconnected levels of modeling (atomistic, generic, macroscopic) [2, 37, 65, 66]. The idea is that each level treats phenomena on its specific\nlength and time scales and then passes on the results as input to the next, more coarsegrained level, until the desired materials properties can be predicted. Such multiscale\nsimulation methods represent a powerful approach whose potential for the modeling of\nglassy polymers is beginning to be explored (see e.g. [67]).\nRemarks on simulation methods. Sections 3 and 4 will present results from molecular dynamics (MD) simulations, a numerical method to integrate the classical equations of motion for a many-body system in a given thermodynamic ensemble [68, 69].\nTherefore, MD is the natural simulation technique to address dynamical problems,\nsuch as the glass transition. However, the realistic MD dynamics carries an obvious\nprice: the equilibration time for the system under consideration-for instance, for a\nlong-chain polymer melt close to its Tg -will exceed the maximum time of a few microseconds one is currently able to simulate.\nHere Monte Carlo (MC) techniques may provide a promising avenue because of\nlarge freedom to design MC moves [68, 70]. The hope is to find an efficient algorithm allowing one to decorrelate the configurations of glassy polymer melts rapidly\nFor long-chain polymer melts, this demand on the algorithm implies, already at high\nT , that the MC move should be nonlocal, i.e., it should modify the chain conformation\nat large scales, and it should not require empty space because the melt is a dense liquid.\nA promising algorithm satisfying these requirements employs double-bridging moves\nwhich alter the connectivity between two neighbouring chains while preserving the\nmonodispersity of the chains (for recent reviews see e.g. [3, 2]). Such a connectivityaltering move drastically changes the conformation of the two chains involved and thus\nrelaxes the length scales on the order of the chain dimension efficiently. However, it\ndoes not alter the local packing of the monomers. An inherent hazard of the algorithm\ntherefore is that, if the move is attempted repeatedly, a successful double-bridging event\nis likely to annihilate one of its predecessors by performing the transition between two\nchains in the reverse direction. To avoid this inefficiency the nonlocal chain updating\nshould be complemented by a move which efficiently mixes up the local structure of the\nmelt. At low T , efficient relaxation of the liquid structure calls for a method which alleviates the glassy slowing down in general. Thus, any algorithm achieving this aim in\nnonpolymeric liquids should also accelerate the equilibration of glassy polymer melts,\nprovided that it can be generalized to respect chain connectivity. At present, no tech-\n\n5\n\n\fnique has been established to solve this problem. However, possible candidates could\nbe parallel tempering [71, 72, 73], Wang-Landau sampling [70] or variants thereof [74],\nor transition path sampling methods [75].\n\n3 Glass transition and properties of the supercooled polymer liquid\n3.1 Bulk properties\n3.1.1 Glass transition temperature\nIn polymer melts, the transition from the glass to the liquid is accompanied by a strong\ndecrease in the shear modulus, typically of three to four orders of magnitude [21]. It\nis thus clear that the glass transition temperature is a characteristic of high engineering\nrelevance. Classical methods for the experimental determination of Tg are calorimetry and dilatometry. Both methods hint at the kinetic features of the glass transition.\nThe transition occurs when the relaxation time for volume recovery (dilatometry) or\nenthalpy recovery (calorimetry) becomes longer than the time scale of the experiment\n(i.e., than the cooling or heating rate) [11, 12, 13]. Upon cooling the polymer liquid\nfalls out of equilibrium close to Tg and freezes below Tg in a glassy state, the properties\nof which depend on the details of the cooling process and tend to age physically during\nfurther isothermal equilibration [11, 12, 13]. The glass transition temperature is located\nin the T interval where the polymer melt smoothly evolves from the liquid to the solid\nstate, and can be defined operationally through some prescription, for instance, as the\nintersection of straight-line extrapolations from the glassy and liquid branches of the\nvolume-temperature curve [11, 13].\nSimilar extrapolation procedures are also applied in simulation studies [26, 63, 30,\n47, 48, 77, 78, 76, 79, 80]. The resulting Tg values have dependences comparable to experimental ones despite the much larger cooling rate employed-typically 1012 K/min\nin simulations and 10 K/min in experiments. For instance, Soldera and Metatla find a\nlinear relationship between numerical and experimental Tg values from atomistic simulations of various vinylic polymers [77]. Figure 2 reveals that Tg decreases nonlinearly\nwith the logarithm of the cooling rate (ΓT ) [26, 63, 30, 47],\nTg (ΓT ) = Tg0 −\n\nB\n,\nln(AΓT )\n\n(1)\n\nin accordance with experimental observation [81]. Also in agreement with experiment\n[11, 82, 83, 84, 85], Tg increases with chain rigidity and chain length [60, 47, 86]. The\nchain length dependence can be fitted to the empirical Fox-Flory equation\nTg (N) = Tg∞ −\n\nK\n,\nN\n\n(2)\n\nwhich usually describes experimental data well (if the molecular weight is not too small\n[11]), although other forms have recently been discussed in the literature [84, 85] and\ncan be rationalized theoretically [87].\n3.1.2 Dynamics of the supercooled melt\nThe precursor of the glass transition is the strong slowing down of structural relaxation\nprocesses on approach to the transition from the liquid. This dynamical feature is\n6\n\n\fTg\n\nTg\n\nPS\n\nsemiflexible\n\n440\n0.5\n420\n\nflexible\n\n400\n0.4\n\n(a)\n\n380\n10\n\n-2\n\n10\n\nΓT\n\n-1\n\n10\n\n0\n\n0\n\n(b)\n\n10\n\n20\n\n30\n\nN\n\nFigure 2: Panel (a): Glass transition temperature (Tg ) versus cooling rate (ΓT ) for\nan atomistic model of atactic PS [47]. The simulation box contains 8 chains with\nN = 80 monomers each. The solid line shows a fit to Eq. 1 with T0 = 371 K, B = 110\nK, and A = 0.23 ps/K. Panel (b): Tg versus chain length (N) for a fully flexible and\na semiflexible (with angular potential) bead-spring model [76]. The simulation box\ncontains at least 192 chains and the cooling rate is ΓT = 2 × 10−5. The solid lines are\nresults of a fit to Eq. 2 with Tg∞ = 0.432, K = 0.145 (flexible model) and Tg∞ = 0.525,\nK = 0.264 (semiflexible model). All data are given in Lennard-Jones units for the\nbead-spring models.\n\n7\n\n\f10\n\n4\n\n400 K\n213 K\n198 K\n\n3\n\n2\n\ngM(t) [Å ]\n\n10\n10\n\n2\n\n10\n10\n\n10\n\n0.61\n\n2\nRg\n\n2\n\nσ\n\n1\n\n0\n\n~t\n\n2\n\n6rrsc\n\n-1\n\n-2\n\n10 -2\n-1\n0\n1\n2\n3\n4\n5\n6\n10 10 10 10 10 10 10 10 10\n\nt [ps]\nFigure 3: Mean-square displacement (MSD) gM (t) versus time t for a united atom\nmodel of 1,4-PBD (results adapted from [53], with permission). The MSD is averaged\nover all united atoms in the melt containing 40 chains of 30 repeats units. The temperatures shown are (from left to right): T = 400 K, 323 K, 273 K, 240 K, 225 K, 213\nK, and 198 K (Tc ≈ 214 K). The horizontal dashed lines indicate the radius of gyration\nR2g ≈ 218 Å2 , the average Lennard-Jones diameter of the united atoms σ ≈ 3.8 Å, and\nan estimate for the Lindemann localization length rsc ≈ 0.45 Å [43]. The dotted lines\nfor T = 400 K and 213 K show the power law ∼ t 0.61 , characteristic of Rouse-like\nmotion.\n\n8\n\n\fa hallmark of strongly interacting disordered matter, including dense colloids [88],\ngranular materials [89], and supercooled liquids [12, 16]. In simulated polymer melts,\nit is observed in all dynamic correlation functions, e.g., in dynamic structure factors,\nconformational correlation functions, or dielectric relaxation [26].\nAs an example, Fig. 3 shows the mean-square displacement (MSD) gM (t), averaged over all monomers of a chain, for a chemically realistic model of 1,4-PBD [53].\nAt high temperature, the MSD directly crosses over from ballistic motion (∼ t 2 ) at\nshort times to subdiffusive motion (∼ t x0 with x0 ≈ 0.61) at intermediate times where\nthe MSD is bound between the monomer size (σ ) and the end-to-end distance Re of a\nchain. This subdiffusive motion does not depend on the strength of the torsional barrier\n(cf. Fig. 4), is present even if the torsional potential is absent [52], and thus reflects the\nuniversal Rouse-like dynamics of nonentangled chains in a polymer melt [4]. The term\n\"Rouse-like\" stresses the fact that simulations of nonentangled chains [26, 64, 90, 91]\nfind both accord with Rouse predictions-e.g., the Rouse modes are (nearly) orthogonal for all t-and deviations from them-e.g., the Rouse modes are stretched with\nstretching exponents depending on the mode index and the MSD of the chain's center\nof mass increases sublinearly for intermediate times. The origin of these deviations is\nnot fully understood. However, for short chains the relaxation time of a chain is not\nwell separated from the (local) α -relaxation so that finite-N corrections to the Rouse\nbehaviour must be expected [64]. Moreover, even for long chains intermolecular interactions between the polymers are not completely screened on mesoscopic length\nscales, which may cause subdiffusive center-of-mass motion [92] or deviations from\nreptation theory [6], and lead to corrections to chain ideality [3, 93].\nOn cooling towards Tg the Rouse-like motion shifts to progressively longer times\ndue to the appearance of a plateau regime. In this regime, the MSD increases only\nvery slowly with time and is of the order of 10% of the monomer diameter, reflecting\nthe temporary localization of a monomer in the cold melt. For polymer models with\nintramolecular rotational barriers, such as PBD, this intermittence of large scale motion\nstems from two mechanisms of dynamical arrest [26, 51, 55]: monomer caging by\nnear neighbours in the dense melt and the slowing down of intrachain conformational\ntransitions occurring through (correlated) torsional motion.\nRecent work by Smith and Bedrov [54] suggests that the interplay of both mechanisms can explain the Johari-Goldstein β relaxation in polymers [13]. Figure 4 reproduces one of their results. Since experiments reveal that the separation of the α and β\nprocesses occurs only on time scales significantly longer than the multiple microsecond\ntrajectories generated for the chemically realistic (CR) PBD model, Smith and Bedrov\nemploy a PBD model with reduced torsional barriers (LB model) but otherwise identical interactions as for the CR model. While structural properties of the PBD melt\nremain unaffected [52, 51], the reduction of the barriers accelerates the dynamics and\nshifts the α -β bifurcation into the simulation time window. Figure 4 compares gM (t)\nwith the decay of the torsional autocorrelation function (TACF). Similar to gM (t), the\nTACF relaxes in two steps. To both steps can be associated relaxation times, τβ and\nτα , which display an Arrhenius (τβ ) and a non-Arrhenius (τα ) increase with decreasing T , characteristic of β and α processes, respectively. At low T , both processes are\nwell separated from each other, the beta process corresponding to times for which the\nmonomers displace, on average, by about 10% of their diameter. This implies that the\ncages imposed by the polymer matrix remain largely intact during the β process and\ncreate a potential energy landscape for the underlying conformational transitions. Indeed, detailed analysis reveals that (nearly) all dihedrals visit all torsional states during\nthe β relaxation. However, these visits do not occur with the equilibrium probabil9\n\n\f10\n\n-1\n\n10\n\n0\n\n1\n\n2\n\n3\n\n4\n\n5\n\n10 10 10 10 10 10\n\n6\n\n2\n\ngM(t) [Å ]\n\n140 K (LB)\n130 K (LB)\n213 K (CR)\n198 K (CR)\n\n10\n10\n\n10\n\nσ\n\n1\n\n0\n\n0\n\nTACF(t)\n\n10\n\n2\n\n10\n\n-1\n\n0.61\n\n~t\n\n2\n\n6rrsc\nτβ(140)\n\n-1\n\n10\n\n-1\n\n10\n\n0\n\n1\n\nτβ(130)\n2\n\n3\n\n4\n\n5\n\n10 10 10 10 10 10\n\n6\n\nt [ps]\nFigure 4: Monomer MSD gM (t) and torsional autocorrelation function (TACF) versus t\nfor 1,4-PBD. The data for T = 130 K and 140 K (lines) are obtained from a model with\nreduced torsional barriers (LB), but which is otherwise the same as in Fig. 3 (results\nadapted from [54], with permission). For comparison the symbols show the MSDs at\nT = 198 K and 213 K for the chemically realistic (CR) model with the full torsional\npotential. These temperatures are approximately at the same distance to Tg (≈ 170\nK) as for the LB model (Tg ≈ 102 K) [54]. The horizontal dashed lines indicate the\naverage Lennard-Jones diameter of the united atoms σ ≈ 3.8 Å and an estimate for\nthe Lindemann localization length rsc ≈ 0.45 Å [43]. The solid line for T = 140 K\nshows the power law ∼ t 0.61 , characteristic of Rouse-like motion. The vertical dotted\nlines represent the β -relaxation times (τβ = 716.5 ps for T = 130 K, τβ = 319.4 ps for\nT = 140 K).\n\n10\n\n\f5\n\n10\n\nTg(PS)\n\nτα/τα(T=600K)\n\n4\n\nTg(PC)\n\n10\n\n3\n\n10\n\nPS\nPC\n\n~exp(Ea/kBT)\n\n2\n\n10\n\n~(T-Tc)\n\n1\n\n10\n\nTc(PS)\n\n0\n\n10\n\n300\n\n-γ\n\nTc(PC)\n\n400\n\n500\n\n600\n\nT(K)\nFigure 5: Temperature dependence of the α relaxation time (τα ) for united atom models\nof atactic PS and bisphenol-A PC. τα is normalized by its value at T = 600 K for both\npolymers (PS: τ (600 K) = 1.4 ps, PC: τ (600 K) = 1.3 ps) and is obtained from the\nmonomer MSD in simulations of 1 chain with N = 80 for PS and 64 chains with N = 10\nfor PC. For both polymers, the increase of τα at high T is compatible with the MCT\nprediction τα ∼ (T − Tc )−γ (PS: Tc ≃ 375 K, γ ≃ 3; PC: Tc ≃ 450 K, γ ≃ 2.2). However,\nthe divergence at Tc is avoided and a crossover to an Arrhenius behaviour (PS: Ea ≃ 30\nkJ/mol; PC: Ea ≃ 16.8 kJ/mol) occurs close to Tg (derived from dilatometry. PS: Tg ≃\n375 K; PC: Tg ≃ 433 K). This crossover indicates the transition from the cooperative\ntranslational dynamics above Tg to activated (β process like) hoping below Tg . Results\nadapted from [48].\nity because the propensity of a dihedral to return to a preferred conformational state\nincreases on cooling, due to the stiffening of the matrix. Equilibrium occupancy of\nconformational states is only achieved for times comparable to the α time scale when\nthe \"cage effect\" of the matrix fully decays (see also [56, 57] for similar results).\nIn glass physics, the term \"cage effect\" is intimately connected to the mode-coupling\ntheory (MCT) of the glass transition, which has certainly been one of the most influential theoretical approaches in the field during the last twenty years. A comprehensive\nreview of its foundations and applications was published recently [17]. By correlating the equilibrium structure to the dynamics of a glass-forming liquid MCT provides\na framework for interpreting spatio-temporal correlations measured in experiment or\nsimulation. Analytical predictions are derived in the vicinity of an ideal glass transition which occurs at a critical temperature Tc and is driven by the mutual blocking of\na particle and its neighbours (\"cage effect\"). Extensive tests by experiments and simulations indicate that, although (the extrapolated) Tc lies above Tg and thus no structural\n\n11\n\n\fHs(r)/Hs(r')\n\nrl\n\n1\n0\n\n(a)\n\nHd(r)/Hd(r')\n\n-1\n0\n2\n\n1\n\n2\n\nrb\n\n3\n\nrmin\n\n1\n0\n(b)\n\n-1\n0\n\n1\n\n2\n\n3\n\nr\nFigure 6: Simulation results for a flexible bead-spring model: Rx (r,t) versus r for\ndifferent times from the plateau regime at T = 0.48 (Tc ≃ 0.45). Panel (a) shows Rx (r,t)\nfor the self-part of the van Hove function and panel (b) for its distinct part. In panel\n(b), the pair-distribution function g(r) is also shown (dotted line; rescaled to fit into\nthe figure). The first peak of g(r) reflects the bond length (≈ 0.97) and the minimum\nposition of the Lennard-Jones potential (≈ 1.12). In panel (a), rl (= 0.2323) denotes\nthe√zero of Rs (r,t) and the circles represent a √\nGaussian approximation which has a zero\nat 6rsc ≃ 0.2327 and a minimum around 10rsc ≃ 0.3. Here, rsc (≃ 0.095) is the\nLindemann localization length. In both panels, the dash-dotted lines correspond to the\ntime closest to t ′ which is the least precise because Rx (r,t) is undetermined for t = t ′ .\nAdapted from [94, 32].\n\n12\n\n\farrest is observed at Tc (cf. Fig. 5), MCT still describes many dynamical features well\n[17, 95]. Why this is so, represents a great challenge for the theoretical understanding\n[88, 96, 97, 98, 99, 88, 100].\nA key prediction of MCT is that structural relaxation functions should obey a factorization property in the plateau regime (also called β regime in MCT). For the self\n(Gs ) and distinct (Gd ) parts of the van Hove correlation function [101] this reads\nGx (r,t) = Fx (r) + Hx (r)G(t) (x = s, d) .\n\n(3)\n\nThe factorization property refers to the fact that the correction to the nonergodicity\nparameter Fx (r) splits into two factors, of which G(t) depends only on time (and temperature) and Hx (r) only on r [17, 95]. Therefore, the ratio (r′ = constant) [102, 103]\nRx (r,t) =\n\nHx (r)\nGx (r,t) − Gx (r,t ′ )\n=\nGx (r′ ,t) − Gx(r′ ,t ′ ) Hx (r′ )\n\n(4)\n\nshould be independent of t. For a flexible bead-spring model [94] Fig. 6 confirms this\nprediction directly from the simulation data (no fit) and additionally reveals the length\nscales pertinent for the dynamics in the plateau regime because distances for which\nHx (r) is zero will not contribute to the relaxation. For the self part of the van Hove\nfunction the dynamics involves displacements up to the monomer diameter, whereas\nfor the distinct part it includes monomers up to about the forth neighbour shell. This\nlocal character of the relaxation is a direct evidence for the cage effect.\nThe agreement between MCT and simulation, demonstrated in Fig. 6, is not limited\nto the flexible bead-spring model. Simulations of semiflexible bead-spring models\nwith rotational barriers [61, 62] and of chemically realistic models, including 1,4 PBD\n[53, 50, 55], PS and PC [48], generally find that many features of the spatiotemporal\nrelaxation in weakly supercooled polymer melts (i.e., T & Tc ) are well described by\nMCT (see however [57]). The main difference between these models and the flexible\nbead-spring model is that two coexisting arrest mechanisms-intramolecular barriers\nand monomer caging-determine the structural relaxation of the former, whereas only\ncaging operates for the flexible model. This interpretation is a key result of Refs. [51,\n52] and of the recent work by Bernabei et al [61, 62] who also make the interesting\nconjecture that, within MCT, the pertinent theoretical framework for polymer models\nwith internal rotational barriers are (so-called) higher-order transition scenarios [17],\nas it appears to be the case for other systems with distinct arrest mechanisms, such as\ndense colloidal suspensions with short-range attraction [104, 105] or polymer mixtures\nwith strong dynamic asymmetry [106, 107, 108].\nA distinctive feature of MCT is that the dynamics (beyond the short time regime)\nis fully specified in terms of the liquid structure. This opens the way for an \"ab initio\"\nprediction of the simulated dynamics, solely based on static input obtained from an independent simulation of the studied glass former. Such an atomistic theory for the slow\nrelaxation of (nonentangled) polymer melts has been developed [109] and compared to\nsimulations of a bead-spring model with N = 10 [110, 64]. The comparison gives\nsemi-quantitative agreement between simulation and theory (for models with large rotational barriers further complications might arise [62]). As an example, Fig. 7 shows\nvarious MSDs, revealing the strengths and weaknesses of the approach [64]. Certainly,\nthe agreement for the monomer dynamics is very good. MCT describes the dynamics\nin the plateau regime, the following polymer-specific subdiffusive increase, gM ∼ t 0.63\nwhich is identified as a finite-N deviation from Rouse behaviour, and the faster motion\nof the end monomer (g1 ) relative to the central monomer (g5 ) of the chain. On the\n13\n\n\f2.0\n1.5\n\ng1(t)/g5(t)\n\nMD: T=0.47\nα-process\n(α+β)-process\n\nlog10 g(t)\n\n1.0\n\n3 -8\n2\n1\n0\n-1\n-2\n-3\n-4\n\n-6\n\n-4\n\n-2\n\n0\n\n2\n\nlog10Dt\nM\n\n3\n2\n1\n0.63\n0\nC\n~t\n-1\n-2\n6Dt\n-3\n-4\n-8 -7 -6 -5 -4 -3 -2 -1 0 1 2\n\nlog10Dt\nFigure 7: Simulation results for a flexible bead-spring model: Log-log plot of the\nmonomer MSD (labeled M, left scale) and the MSD of the chain's center of mass\n(labeled C, right scale) versus Dt with D being the diffusion coefficient of a chain. The\ninset shows the ratio g1 (t)/g5 (t) (end monomer MSD over middle monomer MSD).\nThe circle refer to the MD results at T = 0.47 (Tc ≃ 0.45), the solid lines to the MCT\nα master curve, and the dashed lines to the MCT predictions including the MCT β\nprocess. The dash-dotted lines indicate the diffusive motion 6Dt and the dotted line\nshows the power law ∼ t 0.63 of Rouse-like motion. Figure taken from [64].\n\n14\n\n\fother hand, the theory is not so satisfactory for the MSD of the chain's center of mass\n(gC ). Besides underestimating the plateau height it does not reproduce the subdiffusive\ncenter-of-mass motion [92] (gC ∼ t ≈0.8 ) between the plateau and diffusive regimes.\nThe representation in Fig. 7-that is, plotting the data versus Dt with D being the\nchain's diffusion coefficient-facilitates the comparison of the time dependence in the\nβ and early α -regimes, but camouflages a systematic deviation between theory and\nsimulation. MCT predicts that the α relaxation time τα (q) has the same T dependence for all wave vectors q, whereas simulations, not only for flexible bead-spring\nmodels [32] but also for other glass formers [111, 112, 113, 114, 115], find that τα for\nwave vectors smaller than the position q∗ of the first maximum of static structure factor\nincreases on cooling more weakly than for q & q∗ . This difference also implies a violation of the Stokes-Einstein relation [116, 117, 118], i.e., the product of the diffusion\ncoefficient (corresponding to the limit q → 0) and τα (q∗ ) is not independent of T .\nThis decoupling has been interpreted as a signature of increasingly heterogeneous\ndynamics in the liquid near its glass transition [117, 118, 119, 120]). The term \"heterogeneous dynamics\" means that a glass former near Tg contains subensembles of particles with enhanced or reduced mobility relative to the average. To reveal this dynamic\nheterogeneity various methods were deployed [119, 120], including filtering techniques\nto track slow or fast particles, analysis of ensemble-averaged three- or four-point correlation functions [121, 122], or scrutiny of the self-part of the van Hove correlation\nfunction [111, 112, 115].\nHere we briefly discuss the approach of Refs. [111, 112] which has recently been\napplied to simulation data of a flexible bead-spring model [123]. Following [111, 112]\nwe define the probability distribution P(ln r;t) of the logarithm of monomer displacements in time t by\n(5)\nP(ln r;t) = 4π r3Gs (r,t) ,\nwhere Gs (r,t) is the self-part of the van Hove function, as before. This probability is\nshown in Fig. 8, together with gM (t) and the non-Gaussian parameter [111, 112]\n\u001c\n\u001d\ngM (t)\n1\n′\nα2 (t) =\n−1 ,\n(6)\n3\n|~r(t) −~r(0)|2\nwhere ~r(t) denotes the position of a monomer at time t. In the cold melt there are\nclear deviations from Gaussian behaviour at all but the shortest and longest times. The\nnon-Gaussian parameter is positive and has a maximum at time t2′ in the late√α regime.\nAt this time the distribution P(ln r;t) is very broad, exhibiting small (r & 6rsc ) and\nlarge (r & 1) displacements. This hints at large, non-Gaussian fluctuations in particle\nmobility when α2′ peaks. On cooling toward Tc the broad displacement distribution\ndevelops into a double-peak structure, indicative of large disparities in particle mobility.\nApparently, two populations of monomers coexist, \"slow\" ones which have not moved\nmuch farther than 10% of their diameter in time t2′ , and \"fast\" ones which have left their\ncage and covered a distance of about their diameter or more. This bimodal character\nof the structural relaxation is hard to predict from MCT [112], could be responsible for\nthe absence of the divergence of the relaxation time at Tc , and appears to be a general\nfeature of materials close to glass or jamming transitions [115].\n\n15\n\n\f-2\n\ngM(t)\n,\nα2(t)\n\n-1\n\n0\n\nt\n\n1\n\n2\n\n3\n\n3\n\n6\n\n10\nt't2\n\n6rrsc\n\n1\n\n4πr Gs(r,t)\n\n5\n\n10\n2\n\n0.8\n\n4\n\n10 10 10 10 10 10 10 10 10\n\n√6 rsc\n\nt=10\n\n10\nt=25000\n\n10\n\n0\n-1\n-2\n-3\n\n0.6\nGaussian\n\n0.4\n\nt't2 N=64\nT=0.43\n\n0.2\n0\n10\n\n-1\n\nr\n\n10\n\n0\n\n10\n\n1\n\nFigure 8: Simulation results for a flexible bead-spring model: Probability distribution\nP(ln r;t) of the monomer displacements (left scale) at T = 0.43 (Tc ≃ 0.415) for t =\n10, 100, 250, 500, 1000, 1500, 2500, 5000, 10000, and 25000 (from left to right).\nThe thick dotted line shows P(ln r;t) at t = t2′ , the peak time of α2′ (t). The dotted\ncurve for t = 25000 represents the Gaussian approximation for P(ln r;t). The vertical\ndashed√line indicates the displacement corresponding to the Lindemann localization\nlength 6rsc = 0.232. Right scale: Monomer MSD gM (t) and non-Gaussian parameter\nα2′ (t) at T = 0.43. The vertical dotted line indicates the peak time t2′ of α2′ (t) and the\n2\nhorizontal dashed line the \"plateau value\" 6rsc\n. Figure adapted from [123].\n\n16\n\n\f3.2 Effects of confinement on glassy polymers\n3.2.1 Brief overview of some experimental results\nDuring the past fifteen years the impact of geometric confinement on the glass transition has received considerable attention. The progress in the field is described in\nseveral comprehensive reviews [23, 124, 125, 126, 24, 127, 128]. The picture emerging from these studies is that glass formers confined to nanoscopic dimensions may\nexhibit deviations from bulk behaviour due to the interplay of spatial restrictions and\ninterfacial effects. The latter (nonuniversal) effects can result from particle-substrate\ninteractions, confinement-induced changes of the liquid structure or polymer conformations, density variations, etc. [13, 24], and often appear to dominate the behaviour\nof the confined glass former [127].\nThese interfacial effects have an important impact on the glass transition of thin\npolymer films. For films supported on a substrate, many studies [129, 130, 131, 132,\n133, 134, 135, 136, 137, 138, 139, 140, 141, 142, 143], though not all [144, 145], find\nreductions in Tg with decreasing film thickness (h) if the polymer-substrate attraction is\nweak. This is also the case for one of the most extensively studied systems, polystyrene\non a variety of substrates [129, 131, 132, 134, 135, 136, 137, 139, 140, 141, 142,\n143]. Here mesurements of surface relaxation after nanodeformation [146] or of the\npositional dependence of Tg [139] further indicate that the depression of Tg is related to\na \"free-surface effect\": Monomers near the free surface are expected to be more mobile\nbecause they feel less steric contraints than their peers in the bulk. This enhanced\nmobility should lead to reductions in Tg .\nMeasurements of (the average) Tg provide information on the dynamic reponse of\nthe polymer films on the time scale associated with Tg which depends on experimental\nconditions, such as the cooling rate [147]. Additionally, the full structural relaxation\nhas also been explored by several techniques [126, 24], in particular by dielectric spectroscopy [124, 130, 134, 135, 148, 141, 142, 143, 149, 150, 151, 152]. Dielectric spectroscopy allows for a simultaneous measurement of Tg and the relaxation spectrum,\neven for thin films. A key finding of these studies is that the α process is broadened\nrelative to the bulk. It is possible to interpret this broadening as a consequence of\nspatially heterogeneous dynamics in nanoconfinement. At the interfaces the segmental\ndynamics can be enhanced (e.g. at the free surface) or slowed down (e.g. at an attractive\nsubstrate) relative to the bulk. Chain segments in layers adjoining these interfacial layers should also have their dynamics perturbed, albeit to a lesser extent, which will lead\nto a still weaker perturbation for the next layer, and so on. This interpretation implies\nthat there is a smooth transition from interface-induced perturbations of the dynamics\nto bulk behaviour with increasing distance from the interfaces. Recently, this idea has\nbeen exploited to analyze dielectric spectra of nanostructured diblock copolymer melts\n[150], and it is also consistent with the positional dependence of Tg found in [139].\n3.2.2 Simulation work on geometrically confined glass-forming polymer systems\nSimulation studies of confined glass formers support this view of an interface-induced\ngradient in relaxation [32]. Many of these studies utilize simple models, e.g. binary\nliquids [153, 154, 155, 156] or bead-spring polymer models [157, 158, 159, 160, 161,\n162, 163, 164, 165, 166, 167, 168, 169, 170, 171, 172, 173, 174] (see however [175,\n176, 177, 178, 179] for work on chemically realistic models), to explore the impact\nof confinement in thin films [153, 155, 157, 158, 159, 160, 161, 162, 163, 164, 165,\n166, 167, 168, 169, 170, 171, 172, 173, 174, 177, 178, 179], pores [154] or systems\n17\n\n\fTg(h)/T\nTg\n\n1.0\n\nTc(h)/T\nTc\n\n0.8\n\nTc (supported)\n\n0.9\n\nTg (MC: PP)\n\nTc (free)\n\nTg (PS, low Mw)\n\n~ 10 nm\n\n0.7\n\n10\n\nTg (PS, high Mw)\n\nTc (supported+capped)\n0\n\n10\n\n1\n\n10\n\n2\n\nh/h0\nFigure 9: Tc (h)/Tc and Tg (h)/Tg (Tc and Tg denote the bulk values) versus rescaled\nfilm thickness h/h0. MD results for supported films (open circles), free-standing films\n(shaded circles), and films confined between two smooth repulsive walls (filled circles)\nare compared to the glass transition temperatures Tg (h) of three studies: (i) Monte\nCarlo simulations of a lattice model for free-standing atactic polypropylene (PP) films\n[177] (crosses). (ii) Experiments of supported atactic PS films of low molecular weight\n(open squares) [132]. (iii) Experiments of supported, high-molecular weight PS films\n[129] (stars). The solid and dashed line show Eqs. Eq. 7 and Eq. 8, respectively. The\nvertical dotted line roughly indicates a film thickness of 10 nm. Figure adapted from\n[171].\ncontaining nanofillers [180, 181, 156]. The simulations reveal a complex relaxation\nbehaviour on approach to the glass transition of the confined glass former and also\nreport shifts of Tg , qualitatively similar to the trends sketched above for experiments.\nIn the following we illustrate these results by some examples.\nFigure 9 compares the reduction of Tg with film thickness found in experiments on\nsupported PS films of low [132] and high molecular weight [129] with the Tg shifts\nobtained from simulations of free-standing films [170, 171, 177], supported films [170,\n171], and films confined between two substrates [166, 167]. The simulations study a\nchemically realistic model of polypropylene [177] or flexible bead-spring models [166,\n167, 170, 171], and use as a substrate completely smooth walls which are either purely\nrepulsive or weakly attractive. Despite the obvious differences between experimental\nand computational systems-different polymers, absence or presence of a substrate,\netc.-a master curve for the reduction of Tg can be constructed, if Tg (h) is scaled by\nthe bulk value and h by a characteristic thickness h0 that depends on the nature of\nthe system, but only (very) weakly on molecular weight. This master curve allows\nus to compare the different systems, which is instructive in several respects. First,\nthe close agreement of the PS data for low and high molecular weight suggests that\n\n18\n\n\fpossible changes of the entanglement density [137, 182] or chain conformation [183,\n182] in thin films are probably not responsible for the Tg depression. Furthermore,\nthe experimentally observed Tg shifts have stimulated several attempts to model this\nphenomenon theoretically [132, 184, 185, 186, 187, 188, 189, 190, 191, 192, 193]. For\ninstance, based on a percolation model for slowly relaxing domains Long and Lequeux\n[191] derive the formula (solid line in Fig. 9)\n\u0014\n\u0010 h \u0011δ \u0015\n0\n,\n(7)\nTg (h) = Tg 1 −\nh\noriginally suggested by Keddie et al as an empirical parametrization in their seminal\nstudy on supported PS films [129]. An alternative parameterization was proposed by\nKim et al [136] (dashed line in Fig. 9)\nTg (h) =\n\nTg\n,\n1 + h0/h\n\n(8)\n\nand an attempt was undertaken to justify this formula by a viscoelastic capillary waves\nmodel [132, 184]. Figure 9 shows both formulas and reveals that, for a typical range\nof experimental film thicknesses, 15 . h/h0 . 300, it is hard to decide whether Eq. 7\nor Eq. 8 is more accurate. However, including the simulation data for h . 10 nm,\nEq. 8 appears to provide the better description of the Tg shift. Therefore, Eq. 8 will be\nemployed later (Fig. 12) in an analysis of the local Tg of simulated polymer films.\nThe explanation for the Tg shift in the simulations rests upon the impact that the\nboundaries exert, because the average behaviour of the film-and so its Tg -aggregates\ncontributions from all layers in the film, and these layers have distinct properties. This\ncan be illustrated by an analysis resolving structure and dynamics as a function of\ndistance from the boundaries. For flexible bead-spring models Fig. 10 shows two examples of such an analysis: the layer-resolved incoherent scattering function φqs (t, z) at\nq∗ (maximum of S(q); cf. Fig. 11) for a polymer melt surrounding a highly faceted, but\nnearly spherical filler particle with a structured and attractive surface (panel (a)) [180],\nand φqs∗ (t, z) for a polymer film supported by a smooth, weakly attractive substrate\n(panel (b)) [170].\nFor the polymer melt surrounding the nanofiller the scattering function, averaged\nover all monomers (crosses in Fig. 10(a)), displays features unfamiliar from the bulk.\nThe α -relaxation seems to occur in two steps, as if there were two distinct processes,\na fast one corresponding to a bulk-like phase far away from the filler and a slow one\nassociated with interfacial relaxation. The layer-resolved analysis reveals that this interpretation is misleading. The strongly stretched tail of the average correlator results\nfrom the smooth gradient in the decay of φqs (t, z) which slows down on approach to the\nfiller particle. References [180, 181] show that the amplitude of this tail can be tuned\nby the monomer-filler interaction. Strong attraction leads to a more pronounced tail;\nvanishing attraction suppresses the tail. In the latter case, the shape of the scattering\nfunction is bulk-like.\nAdditional insight into the slow relaxation of particles in contact with a structured\nwall was obtained from studies of the self-part of the van Hove function [155, 194,\n195]. For times in the α regime and T ≫ Tc , Gs (r,t) has a clear two-peak structure. The\nfirst peak reflects particles that remain trapped in their cages, while the second peak,\nlocated on a length scale corresponding to the wall structure, reveals that particles have\nmigrated to neighbouring wells. Evidence for this kind of \"hopping motion\" is found\nfor a binary LJ mixture [155], for a polymer melt adsorbed on a structured surface\n19\n\n\f1.0\n\nlayer 1\nlayer 2\nfilm\n\ns\n\nφq(t,z)\n\n0.8\nlayer 1\n\n0.6\n\nρ(z)\n\n0.4\n\nlayer 2\n\n1\n\n0.2\n0\n\n0.0\n\n(a)\n\n10\n\n-2\n\n0\n\n2 z/Rg\n\n1\n\n10\n\n-1\n\n10\n\n0\n\n10\n\nρ(z)\n\n1.0\n0.8\ns\nφq(t,z)\n\n10\n\n2\n\n10\n\n3\n\n10\n\n4\n\nt\nT=0.42\n\n2\n\n∆z=2\n\n1\n0\n\n0.6\n\n0\n\n0.4\n0.2\n\n(b)\n\n1\n\n5\n\n10 15 20 25\nz\nsupported surface\n\nfree surface\n\n0.0\n10\n\n-2\n\n10\n\n-1\n\n10\n\n0\n\n1\n\n2\n\n3\n\n10 10 10 10\n\n4\n\nbulk\nz<10\nz=11\nz>12\nfilm\n\nt\nFigure 10: (a) Layer-resolved incoherent scattering function φqs (t, z) at T = 0.4 and\nq = 7.08 (= maximum of S(q)) for a bead-spring polymer melt surrounding an icosahedral filler particle. The chain length is N = 20, the melt density is ρ = 1 (dashed\nhorizontal line in the inset), and the filler attracts the monomers more strongly than\nthey attract each other in the bulk. The solid lines and the squares show φqs (t, z) for\ndifferent distances z from the surface of the filler particle. The location of the first\ntwo layers is illustrated in the inset which depicts the monomer density profile ρ (z/Rg )\n(Rg ≃ 2.17). The crosses indicate the average over all layers. Figure adapted from [32].\n(b) φqs (t, z) at T = 0.42 and q = 6.9 (≈ maximum of S(q)) for a bead-spring polymer\nmelt in a supported film of thickness h = 20.3 (Tc ≈ 0.392). z denotes the distance from\nover all monomers which remain for\nthe (left) wall. φqs (t, z) is obtained as an average\n20\nall times shown in a layer of width ∆z = 2 and centered at z. The average behaviour\nof the film (average over all layers) is indicated by crosses and the bulk data by filled\ncircles. Inset: Monomer density profile ρ (z) versus z. The layers for which φqs (t, z) is\nshown in the main figure, are indicated. Figure adapted from [170].\n\n\fS(q)\n0\n\n10\n\nT=0.44\nh≈7\n\n10\n\nq*~2π/σ\n\nS(q)\n\n3\n\nkBT/γ q\n\n10\n\ncapillary\nwaves\n\n2\n\n-1\n\nkBTρκT\n\n-2\n\n10\n\n-1\n\n10\n\n0\n\nq\n\n10\n\n1\n\n2\nbulk\ncenter\nfree\nwall\n\n1\nkBTρκT\n\n0\n0\n\n5\n\n10\n\n15\n\n20\n\n25\n\nq\nFigure 11: Static structure factor S(q) for a bead-spring melt (N = 10) in the bulk\n(circles) and in supported film geometry (lines) at T = 0.44 (Tc ≈ 0.405 in the bulk;\nTc (h ≃ 7) ≈ 0.361 in the film [170]). For the film S(q) is shown respectively for layers\nin film center, at wall and at the free surface. At the free surface the steep rise of\nS(q) for small moduli q of the wave vector is due to capillary waves. For the bulk the\ncompressibility plateau kB T ρκT is indicated by a horizontal dotted line (κT denotes\nthe isothermal compressibility). Inset: Same data as in the main figure, but in a log-log\nrepresentation. The small-q behaviour expected from capillary wave theory is depicted\nby a dashed line (γ is the surface tension).\n[194] or for model of liquid toluene confined in cylindrical mesopores [195]. This\nrelaxation mechanism could be generic when a liquid may lock into registry with the\nsurface topography, leading to a mechanism of structural slowing down which coexists\nwith glassy arrest at low T [196, 197]\nA similar locking is not possible at the free surface or a smooth, repulsive or weakly\nattractive wall. In thin films, one therefore expects enhanced dynamics relative to the\nbulk. Figure 10(b) shows that this expectation is borne out for flexible bead-spring\nmodels. For these models the free and smooth interfaces also create enviroments for\nnearby monomers which tend to reduce the cage effect: Local spatial correlations on\nthe scale q∗ of the maximum of S(q) are weaker in the films than in the bulk at the\nsame temperature (Fig. 11). This is an important contributing factor to the enhanced\nmonomer dynamics found at both interfaces.\nFigure 10(b) also shows that the interface-induced deviations from bulk dynamics\ncontinuously turn into bulk-like relaxation with increasing distance from the bound-\n\n21\n\n\fbulk\n\n4\n\nτα\n\nTc=0.405\n\n10\n\nT=0.42\nT=0.44\nT=0.48\nT=0.52\nT=1\n\n3\n\nτα(z,T)\n\n10\n\n2\n\n10\n\n1\n\n10\n\n0\n\n10\n\n0\n\n5\n\n10\n\n15\n\n20\n\n25\n\n30\n\nz\nFigure 12: Temperature dependence of the layer-resolved α relaxation time τα (z, T ) in\na supported polymer film (N = 10; Tc ≈ 0.405 in the bulk). The simulated system is\nthe same as in Fig. 10(b). The solid lines at the free surface show Eq. 11 (no adjustable\nparameter). The horizontal dashed lines indicate the bulk values for τα at the respective\nT . Figure adapted from [171].\n\n22\n\n\faries. The range of this crossover grows on cooling. Figure 12 illustrates this point\nby an analysis of the temperature dependence of the layer-resolved α relaxation time,\nτα (z, T ). At high temperature τα (z, T ) slightly deviates from the bulk value near the\ninterfaces. With decreasing T the interface-induced enhancement of the dynamics increasingly penetrates into the film and eventually propagates across the entire system\nfor sufficiently low T . This spatial dependence of τα (z, T ) can be modeled if two assumptions are made: (i) The average Tc (h) of the film is given by Eq. 8 and can be\nwritten as a \"democratic average\" [193] of the local Tc (z). That is,\n2\nTc\n=\nTc (h) =\n1 + h0/h h\n\nZ h/2\n0\n\ndz Tc (z) ,\n\n(9)\n\nwhich gives\nTc (z) =\n\nTc (1 + h0/z)\n.\n(1 + h0/2z)2\n\n(10)\n\n(ii) The second assumption is that the sole effect of the interface is to shift Tc from the\nbulk value to Tc (z), whereas all other parameters determining the T dependence of τα\nremain the same as in the bulk. Here we model this T dependence by the MCT power\nlaw\nτ0bulk\n.\n(11)\nτα (z, T ) =\n(T − Tc (z))γbulk\n\nFigure 12 demonstrates that Eq. 11 yields a reasonable description of the increase of\nτα from the free surface to the center of the film (solid lines in the figure) [171]. The\ndecrease of the α relaxation time on approach to the free surface therefore corresponds\nto a decrease of the local glass transition temperature, in qualitative agreement with the\nexperimental results of [139]\nThe propagation of enhanced or reduced mobility from the boundary toward the\ninterior of the film has also been observed in other simulations on freely-standing\n[158] and supported polymer films [164]. These studies carried out a cluster analysis, of highly mobile monomers in the case of the freely-standing film and of immobile\nmonomers for the supported film. In both cases, it was found that clusters start at the\ninterface and penetrate into the film.\nIn summary, simulation studies suggest that confined (polymeric) liquids display\ncomplex relaxation behaviour on approach to the glass transition because of the interplay of bulk-like slowing down of the dynamics and interfacial effects. Interfaces\ncan enhance or retard the relaxation relative to the bulk. Enhanced relaxation may be\nexpected for smooth or free interfaces, whereas strong particle-substrate attraction or\nparticle caging in cavities of the substrate tend to slow down the dynamics. These\ninterface-induced perturbations smoothly transition from the boundaries to the interior\nof the confined liquid. The range of this gradient grows on cooling so that the perburbations can propagate across the entire liquid for sufficiently strong confinement or low\nT . Similar interfacial effects may also be important for the analysis of other problems,\nfor instance, for solvent evaporation from (spincoated) polymer films [173, 174] or for\nthe modeling of the hydrodynamic boundary conditions in microfluidic devices [198].\nTherefore, it appears that those theoretical approaches, which treat the interplay of\nboundary effects and glassy slowing-down of the dynamics on the same (microscopic)\nfooting, are most likely to advance our understanding in this field. Folding in boundary\neffects is certainly a major challenge [199, 196, 197]. Simulations of model systems-\nas those reported here-should be helpful for the development of such theories.\n\n23\n\n\f4 Studies of the glassy state\nMolecular simulations are intrinsically limited in terms of time scales. Therefore studying the glassy state, in which the relaxation time scales are by definition extremely\nlarge, could seem to be out of reach for this kind of numerical approach. Paradoxically,\nhowever, the fact that the intrinsic time scales of the system are large brings the simulations very close to actual experiments. The important fact is that, deep in the glassy\nstate, segmental relaxation times [200] greatly exceed both the experimental and the\nsimulation time scales. For both laboratory and computer experiments, a time window\nis probed where segmental polymer motions are frozen and hence non-equilibrium phenomena associated with the glassy state are observed. The main issue is then rather a\nmatter of sample preparation, which is usually done with much faster quenching rates\nin computer experiments (cf. Sect. 3.1.1). As we will see below, it turns out that the\nmechanical behaviour is not strongly affected, at least at a qualitative level, and that\nsimulations can therefore be used to analyse the structure and mechanical response of\nthe glassy state with some confidence.\n\n4.1 Small deformations\nWe start our discussion by considering the small strain, elastic part of the mechanical\nresponse of a polymer glass, which can be described at the macroscopic scale by linear\nelasticity. It is now well recognized that, in spite of their homogeneity in density, glassy\nmaterials are heterogeneous at the nanoscale in terms of their elastic properties. This\nheterogeneity is reflected indirectly in some vibrational properties (e.g., the Boson peak\n[201]), and is most obviously revealed by simulation, that allows one to compute elastic constants and study elastic response at various scales [202]. For polymer glasses,\nthe first study of that kind was presented in refs [203, 204], following earlier studies\nthat indicated size dependent results for the elastic constants of nanometric systems\n[205]. This study, which uses a simple definition of local elastic constants based on\na local calculation of the usual fluctuation formulae [204, 206], shows clearly that the\nmaterial is inhomogeneous at scales of the order of 5 to 10 monomeric sizes. Small\nregions displaying negative elastic constants and therefore would be unstable if they\nwere not surrounded by regions with large local moduli. These aspects are not specific\nto polymer systems, but can be observed in simple molecular or metallic glass formers\n[207, 202], and using more sophisticated definitions of the local elastic moduli, which\npoints to their universal character. However, they are particularly important when the\npolymer glass is cast in the form of a nanostructure, as the mechanical failure of such\nstructures will be strongly affected by the presence of elastic heterogeneities.\nWhile the response of a polymer glass for deformations smaller than a few percent\ncan be described as elastic from a macroscopic viewpoint, a detailed microscopic studies show that irreversible rearrangements take place at low temperature even for very\nsmall deformations [208]. This irreversible behaviour is responsible for a dissipative\npart or the mechanical response, sometimes described as anelasticity. Ultimately, this\ndissipation is associated with strongly localized plastic events that involve only a few\nmonomers, and can be thought as the precursors of the dissipative processes that take\nplace under larger deformation.\nTwo specificities of polymer glasses,already mentioned in Sect. 3.2.2, are the interest for thin films and the ability to introduce various types of additives, from small\nmolecules to nanoparticle fillers. Relatively few studies are concerned with the thin\nfilm modifications of the glassy state itself. Jain and de Pablo [209] showed that the\n24\n\n\fvibrational density of states is modified compared to the same glass in the bulk. In\nparticular, the usual excess of low frequency modes observed in glasses (the so called\nboson peak) is enhanced in free standing thin films. This increase of the soft modes, low\nfrequency part of the spectrum is consistent with a negative shift of the glass transition\ntemperature. As the strength of the boson peak is in general, connected to a decreased\nfragility (in the sense of Angell's classification of glasses, see [12], this points to a\nreduction in fragility with film thickness.\nMany studies on the other hand have been devoted to the modification of the glassy\nstate under the influence of nanometric filler particles [180, 181, 210]. As discussed in\nSect. 3.2.2 (see Fig. 10), the vicinity of fillers was shown to modify the dynamics of\nthe polymer, with a slowing down and a shift of the glass transition temperature in the\ncase of attractive interactions. From the mechanical point of view, it was also shown\nthat the presence of attractive fillers results in the presence of a layer with enhanced\nmechanical properties (higher local moduli) [211, 210] and modifies the structure of\nthe entanglement network [212]. The spatial extension of this layer is of the order\nof a few monomer diameters and does not depend on the particle radius as soon as\nthe latter exceeds 2 to 3 monomer size. As a result the mechanical properties of the\ncomposite are enhanced, however for a well dispersed composite this enhancement\nremains moderate. Note that the existence of a glassy layer around the nanoparticles is\nexpected to affect the properties of the nanocomposite mostly in the region of the glass\ntransition, where the contrast between this layer and the rest of the polymer is maximal\n[213, 214]. As for polymer films, the fragility (inferred from boson peak strength and\nposition) appears to be decreased with respect to the pure polymer.\nFurther studies of weak deformation include the influence of an external strain on\nthe microscopic dynamics [215] (in fact the latter study also extends to large, uniaxial deformations) , and the evolution of the creep compliance upon aging [216]. It is\nfound a finite strain rate accelerates the segmental dynamics -measured by the bond\norientation relaxation time- , whether the corresponding strain is positive (dilation) or\nnegative (compression). This symmetry between compression and dilation is indicative of a stress induced modification of the potential energy landscape, with the applied\nstress lowering the local barriers and accelerating the caging dynamics. Free volume\nconsiderations, on the other hand, would not explain such a symmetry [215]. Acceleration of the dynamics under load (sometimes described as \"mechanical rejuvenation\")\nis also observed in the aging study of ref; [216], in which the creep compliance J(t,tw )\nof a simulated polymer is also shown to be well accounted for by the classical description of Struik [217], in which the creep compliance is\u0010described\n\u0011 as a scaling function\nR\n\nμ\n\nμ\n\nw\ndt ′ . This result again\nJ(te f f /tw ) where tw is the aging time, and te f f = 0t twt+t\n′\nshows that, in spite of the wide difference in time scales, the phenomenology of glassy\npolymers is reproduced by simulation work. It should also be noticed [218] that the\nrelation between segmental mobility and strain rate is also dependent on the general\nstrain history, so that, in contrast to the usual assumptions of Eyring's theory, no simple mechanical variable can relate to the local mobility. Recent theoretical approaches\n[100], based on nonlinear Langevin equation description of segmental dynamics, go\nbeyond the simple Eyring description and account for this aging behaviour.\nFinally, a rich and promising domain for simulation is the study of the complex\neffects of small molecules on the glass transition and on the glassy state. Such small\nmolecules can be described as solvent, plasticizers or antiplasticizers, and in general\ntheir presence leads to an acceleration of the dynamics and a decrease in the glass\ntransition More precisely, plasticization of the polymer means that the solvent does not\n\n25\n\n\fonly decrease Tg , but also softens the polymer glass by reducing the elastic moduli.\nBesides this normally encountered case, there are also systems in which the solvent\nantiplasticizes the polymer. That is, the solvent decreases Tg , but increases the elastic\nmoduli of the polymer glass. The origin of this antiplasticizing effect has recently been\nstudied by simulations [219, 220], and appears to be due to a more efficient packing\nassociated with solvent molecules smaller than the monomers. Small molecule fit into\nthe \"holes\" of the polymer melt, and increase the elastic stiffness. However, their\nmobility also facilitates segmental mobility. Both for antiplasticizers and plasticizers,\na strongly heterogeneous dynamics of the solvent molecules has been reported [220,\n123]. The corresponding dynamical correlation length is however decreased in the\npresence of antiplasticizres, with a fragility of the system that is also decreased.\n\n4.2 Large deformations and strain hardening\nThe mechanical properties of glassy polymers at large deformations were first investigated in the pioneering work of Röttler and Robbins [221, 222, 223, 224], and their\nresults were subsequently reproduced in a number of studies [76, 225]. Beyond the\npeak stress, whose actual amplitude depends on the strain rate in a logarithmic way,\nas in simple glasses, the stress strain behaviour depends on the type of sollicitation.\nIn pure shear or in simulations of a tensile test under triaxial conditions, the plastic\nflow proceeds through a cavitation of cavities and subsequent formation of fibrils. The\ndrawing of these fibrils is essentially at constant stress. This phenomenon is discussed\nin detail by Röttler [27] Under uniaxial, almost volume conserving conditions (Poisson\nratio close to 1/2), a marked strain hardening is observed, i.e. the plastic stress increases\nwith strain with a dependency that is close to linear. The corresponding deformation,\nhowever, is very far from elastic, and essentially non recoverable.\nThis peculiar property of polymer glasses, which strongly contributes to their practical applications, is the existence of the strain hardening regime at large deformation.\nLarge strain-hardening effect prevents the strain localization and leads to a tough response of the polymeric material; the material breaks only after a significant plastic\nstrain, as in the case for polycarbonate. For brittle polymers, as atactic polystyrene,\nthe strain-hardening effect is usually too weak, which leads to a brittle fracture due to\ncrazes formation within a few percent of strain. Understanding the microscopic origin of the strain-hardening effect provides a strategy for new tailor-made polymeric\nmaterials.\nThe microscopic origin of this regime has been clarified only recently, thanks - to a\nlarge extent - to numerical simulations. Both the generic aspects of this phenomenon,\nand the way strain-hard and strain-soft polymer materials differ in terms of segmental\nmobility and energetics, have been investigated by extensive MD simulations.\nBefore we discuss simulation results, let us recall the popular rubber elasticity models [226] which predicts that the hardening modulus Gh varies linearly with temperature T and entanglement density ρe , Gh = ρe kB T . Experimental values, however, are\ntwo orders of magnitude larger, and, more important, show decrease with increasing\nT [227, 228]. To take the dissipative nature of the plastic deformation into account\nthe rubber elasticity model describes the stress-strain relation in the strain-hardening\nregime with the help of two contributions [226].\n\nσ = σY + c2 (λ 2 − λ −1 )\n\n(12)\n\nThe first part is a constant dissipative stress σY , due to the presence of energy\n\n26\n\n\finitial configuration\n\ntriaxial\ntension\n\nuniaxial\ntension\n\nz−axis of\ndeformation\n\nεz =0.5\n\nεz =0.5\n\nFigure 13: Snapshots of three configurations of a polymer glass: initial undeformed\nstate (up), uniaxially deformed configuration (left), and triaxially deformed configuration (right). Both deformed configurations correspond to a strain of 50% along the z\naxis of the simulation box. The simulation results are obtained from a flexible beadspring model (N = 100) at T = 0.2 (Tg ≈ 0.43). Figure taken from [76].\n\n27\n\n\fbarriers. The second is the strain-dependent part, which is thought to be described by\nrubber-elasticity theory and represents the strain-hardening effect. In this description\nthe strain-hardening modulus is not affected by thermally activated processes.\nHowever, recent experiments demonstrate that such a description for the strainhardening part is invalid; the strain-hardening modulus has characteristics of a thermallyactivated process, and decreases for higher temperatures [229]. Secondly, at higher\nstrain rate the strain-hardening modulus increases [230], although for some polymers\nthe dependency on strain rate is rather weak [231]. This increase can be interpreted in a\nvery elementary manner within a barrier-crossing, Eyring like picture, which however\nas discussed above is known to be oversimplified. Finally, the external pressure affects\nthe strain-hardening modulus as well. A higher external pressure leads to an increase\nin the strain-hardening modulus [232]. Again, this behaviour is typical for thermallyactivated processes. All these three observations on the strain-hardening modulus are\nnot present within the classical rubber theory. The failure of rubber-elasticity theory\nis due to the essential difference between a rubbery state, with many possible chain\nconformations between cross-links, and a non-ergodic glassy state where chain conformations are practically frozen, and transitions between different conformations are not\npossible. Deformation of the polymer glass facilitates these transitions and is accompanied with the energy dissipation. The work for this irreversible energy dissipation is\nreflected in a dissipative stress, which is absent in the rubber-elasticity theory. The dissipative nature of a polymer strain-hardening is confirmed by experiments. It is found\nthat for PC and PS at large (> 15 − 30%) strains [233, 20, 234]) more work is dissipated\nthrough heat than converted into internal energy.\nThe increase in stress for larger strains in combination with the dissipative nature\nof the stress in the strain-hardening regime suggest that there is an increase in the rate\nof energy dissipation, i.e., more energy per unit of strain is needed for more stretched\nsamples to stretch them further. This picture is supported by the computer simulations of Hoy and Robbins [235], who showed that the dissipative stress increases with\nlarger strain and that at zero temperature the stress was directly correlated to the rate of\nchanges in Lennard-Jones (LJ) binding. Their more recent simulations of polymer toy\nmodels also demonstrated that most of the stress at large strains is due to dissipation.\n[235, 236].\nIf the rubber elasticity theory is invalid, what is then the polymer-specific part of\nthe strain-hardening modulus? Simulations of the mechanical deformation of simple\nmolecular glasses show no strain hardening [237]. Hence, for short polymer chains\nthe amount of strain hardening is expected to be small as well. Moreover, experiments\n[228] and simulations [238] show that the strain hardening modulus is positively correlated with the entanglement density. Therefore one expects the strain hardening phenomenon to disappear progressively as the chain length falls below the entanglement\nthreshold. Simulations show that this is indeed the case. In a model polymer glass, Hoy\nand Robbins [235] demonstrated that there is a gradual increase in the strain-hardening\nmodulus as a function of chain length for chains up to about the entanglement length.\nFor longer chains saturation in the modulus occurs. Similarly, in MD simulations of\natactic polystyrene [48] only a weak strain hardening was observed for chain lengths of\n80 monomers, below the experimentally observed entanglement length of about 128–\n139 monomers [239, 240].\nIn the simulations of ref. [235] it was also observed that the strain hardening is\nmore correlated with the change in the end-to-end distance of the polymer chains than\nwith the change in the global sample size. If the sample size is decreasing while the\nend-to-end distance does not, then the stress does not increase.\n28\n\n\fAfter the fundamental aspects of strain hardening have been clarified using simulations of simple, coarse-grained models, more detailed studies using realistic models are\nrequired to understand the influence of chain architecture. For example, it is known that\npolymers with a larger persistence length often have a higher strain-hardening modulus\n[226]. It was even shown by molecular-dynamics (MD) simulations that if the persistence length of a polyethylene-like polymer is artificially increased by changing the\ntrans-to-gauche ratio, the strain-hardening modulus of the resulting material increases\nas well [241]. That example illustrates that the strain-hardening modulus depends on\nthe conformation of the chain, which is frozen in the glassy state. The changes in this\nconformation are associated with plastic events, that involve a collective nanoscale segmental dynamics of individual or neighbouring chains. Understanding the differences\nin local mobility and dynamics for chemically different polymers under large deformations, and how it relates to the different mechanical characteristics, is therefore an\nimportant question, which has been studied in relatively few cases.\nAs an example of such studies, and of the possibilities offered by simulation, we\nconsider the extensive studies in refs. [242, 48, 232, 243] o̊n two glassy polymers that\nvary greatly in their strain-hardening moduli, viz. polystyrene (PS) and polycarbonate\n(PC, of which the modulus is more than a factor of two higher [244]). Moleculardynamics simulations [242, 48, 232] have reproduced these experimental findings qualitatively, with a strain-hardening modulus of polystyrene that is much lower than that of\npolycarbonate, as shown in figure 14. They also allow one to identify the microscopic\nmechanisms responsible for the observed difference in the strain-hardening modulus.\nIn particular, they show the rate of non-affine displacements (or local plastic events)\nincreases with larger strain, and that the increase is larger for PC. The non-affine displacements of particles are due to restrictions and hindrances, in particular from covalent and steric interactions. These restrictions are extremely important at the scale of\nthe covalent bond. If particles would displace affinely, then the equilibrium value of\nthis chemical bond would be excessively disturbed. To circumvent the bond stretch,\nthe bond vector will not move affinely with the deformation. At much larger length\nscales the situation is different. For a long chain the internal conformation can be adjusted, while still obeying to the equilibrium length of the covalent bond. The effective\nspring constant associated with the end-to-end distance is much less stiff. Moreover,\ndue to the glassy state the relaxation time of spontaneous rearrangements at the scale of\nthe whole chain greatly exceeds experimental and simulation time scales . Therefore,\nthe end-to-end distance cannot adjust back towards the equilibrium value by means of\nspontaneous relaxations. Hence the end-to-end distance will follow the imposed deformation much more affinely. So we expect a more affine response, as we probe larger\nlength scales.\nThis expectation is borne out by a detailed study of the affine character of the deformation of the polymer chain, as a function of the internal distance along the chain\n[243]. At the scale of 100 chemical bonds, it is found that the deformation is essentially affine up to about 15% strain for both PS and PC, while it is strongly non affine\nalready at this strain at the scale of 30 bonds, see Fig. 15. For larger strains the relative\ndeviation from affinity becomes larger for even long enough (100 backbone bonds)\nchains. This effect is present in both PS and PC, the difference being in the magnitude of the effect. For an internal distance of 30 monomeric units, the deformation\nof the polycarbonate chain is only 30% of the affine value at a strain of 50%, while\nin polystyrene under the same conditions the chain deformation is 50% of the affine\nvalue. This is because at the scale of the Kuhn length a chain cannot be stretched any\nfurther. As the Kuhn length of polycarbonate is already larger than that of PS and the\n29\n\n\f140\n120\n\nσ (MPa)\n\n100\n80\n60\n40\n20\n0\n0\n\nPS\nPC\n0.2\n\n0.4\n\nε\n\n0.6\n\n0.8\n\n1\n\neng\n\nFigure 14: The von Mises equivalent true stress σ vs. strain εeng for PS and PC. Solid\nlines are fits to Eq. 12. Fit range is εeng = 0.3–0.8. Note that the strain-hardening modulus Gh for PC (19 MPa) is almost twice that of PS (11 MPa), while their extrapolated\noffset yield values σY are about the same (PC: 88 MPa; PS: 86 MPa). Adapted from\nref. [232]\n\n30\n\n\ftotal non-affine displacement of PC is to a large extent determined by the backbone\natoms, the increase in the effective stiffness length leads to an increase in non-affine\ndisplacement, more energy dissipation and hence a higher strain-hardening effect. For\npolystyrene the Kuhn length is small and the major part of non-affine displacement\nis not caused by the backbone. Hence the expected increase in the effective stiffness\nlength during deformation does not lead to a substantial increase in plastic flow, so that\nat moderate strains PS behaves more like a simple glass without strain hardening, as\nopposed to polycarbonate.\n\n5 Perspectives\nThe present review has attempted to describe some aspects of the recent progresses in\nour understanding of glassy polymers that have been obtained from simulation work,\nwith a particular focus on microscopic dynamic, glass transition and mechanical properties. The results obtained in the past ten years show that the simulations have reached\na state of maturity that allows them to address and clarify important issues in the field,\nin spite of the obvious limitations in terms of length and time scales. While the illustrative examples we have chosen were relatively simple, they show that the general\nphenomenology of the glass transition and the properties of the glassy state can be\naccounted for using molecular simulations, in spite of the relatively small time scale\nthat can be considered in such simulations. We would like to close the discussion by\nsuggesting some directions for future research, which we believe will be soon - or\nare already - within the capabilities of state of the art simulations, and correspond to\nproblems of practical or fundamental interest.\nA major ingredient of the physics of glassy polymers - and more generally of glassy\nsystems - is the so called \"time temperature superposition principle\" which assumes\nthat relaxation processes can be rescaled by using a single, temperature dependant relaxation time τα (T ). While this \"principle\" is widely used to produce frequency dependent relaxation function from data taken at various temperature, it is also well known to\nbe applicable at best in the frequency region corresponding to the α peak, presumably\nonly above Tc . It is a challenge to understand the molecular mechanisms underlying\nthis superposition principle and the deviations thereof [118]. A prominent feature of\npolymeric glasses is the observation of secondary relaxations at higher frequency, the\nJohari-Goldstein β processes (see Sect. 3.1.2). The associated relaxation times merge\nwith the α relaxation times typically at temperatures of 0.8Tg , and the associated time\nscales are of the order of 10−6-10−7 s at such temperatures. Such time scales are beginning to be in the range attainable by MD simulations, a fact that should allow one\nto clarify the molecular origins of secondary relaxations, their relation to the existence\nof side groups, to torsional modes, and other interpretations that have been put forward\n[245]. Molecular simulation, by the flexibility it offers to block specific motions and\nto control chain properties at various scales of coarse graining, should also allow one\nto investigate the putative relations between these secondary relaxations, fragility, and\nmechanical properties.\nNanocomposites and thin films have already been the subject of a number of simulation studies (see Sect. 3.2.2). Still, the precise mechanisms that give rise to reinforcement and nonlinear behaviour in nanocomposites, and to speed up of the dynamics in\nthin films, remain to be elucidated in detail. In particular, for entangled polymers it\ncan be expected that the presence of interfaces modifies both the characteristics of the\nentanglement network and the monomeric friction coefficients. The interplay between\n31\n\n\fCn(Heng)/Cn(0)\n\natio_max1_P0006PS8x80_300K_X_id=100.mat+4 other ids+2 other\n1.7\nn=1\n1.6 n=30\nn=100\n1.5\n1.4\n1.3\n1.2\n1.1\n1\n0.9\n0\n\n0.2\n\n0.4\n\nHeng\n\n0.6\n\n0.8\n\n1\n\nCn(Heng)/Cn(0)\n\nr_ratio__ownPC64x10_300K_X_id=100.mat+4 other ids+0 other de\n1.7\nn=1\n1.6 n=30\nn=100\n1.5\n1.4\n1.3\n1.2\n1.1\n1\n32\n\n0.9\n0\n\n0.2\n\n0.4\n\nHeng\n\n0.6\n\n0.8\n\nFigure 15: The normalized characteristic ratio Cn′ (εeng ) = Cn (εeng )/Cn (0), which gives\n\n1\n\n\fthese different aspects could, in principle, be elucidated in simulations of entangled\nsystems. Again, the simulation times needed to explore such phenomena are extremely\nlarge, but, with the development of advanced simulation algorithms-as those alluded\nto in Sect. 2-and the increase of computer power they are starting to be within the\nattainable range.\nFinally, we note that many polymer materials of practical interest display a mixed\nstructure, being either partially crystalline with an amorphous fraction, or chemically\ninhomogeneous with phases (or microphases in the case of block copolymers) displaying different mechanical properties, e.g. glassy and rubbery. The properties of the\nresulting nanocomposites have, up to now, received little attention from the standpoint\nof molecular simulation (see however [108, 107, 246]). They are likely to be strongly\ninfluenced, especially for large deformations, by the interplay between chain architecture and material nanostructure. Another interesting phenomenon of that kind is strain\ninduced crystallisation, which plays an important role in the strain hardening of some\nspecific polymer. The capability of molecular simulation to describe polymer crystallization has been recently demonstrated [7, 8, 247], so that the study of strain induced\ncrystallisation -as well as studies of semi crystalline phases appears to be an interesting\ngoal for the future.\nAcknowledgments The work reported in this article was carried out in fruitful collaboration with M. Aichele, N. Balabaev, C. Bennemann, K. Binder, S.-H. Chong, C.\nDonati, M. Fuchs, Y. Gebremichael, S. C. Glotzer, O. Lamé, A. Makke, M. Mareschal,\nH. Meyer, M.A.J. Michels, S. Napolitano, J. J. de Pablo, G. Papakonstantopoulos, W.\nPaul, M. Perez, S. Peter, R. Riggleman, B. Schnell, R. Seemann, F. W. Starr, F. Varnik,\nT. Vettorel, B. Vorselaars, and M. Wübbenhorst. It is a great pleasure to thank all of\nthem. We presented results from the research of W. Paul, G. D. Smith, D. Bedrov\nand coworkers. We are grateful that they quickly provided the figures requested. Our\nsimulations were made possible by generous grants of computer time at the IDRIS in\nOrsay and at the NCF in Amsterdam, JB gratefully acknowledges financial support by\nthe IRTG \"Soft condensed matter\".\n\nReferences\n[1] T. P. Lodge and M. Muthukumar. J. Phys. Chem., 100:13275, 1996.\n[2] D. N. Theodorou. Chem. Eng. Sci., 67:5697–5714, 2007.\n[3] J. P. Wittmer, P. Beckrich, H. Meyer, A. Cavallo, A. Johner, and J. Baschnagel.\nPhys. Rev. E, 76:011803, 2007.\n[4] M. Rubinstein and R. H. Colby. Polymer Physics. Oxford University Press,\nOxford, 2003.\n[5] T. C. B. McLeish. Adv. Phys., 51:1379, 2002.\n[6] A. E. Likhtman. J. Non-Newtonian Fluid Mech., 158:158–161, 2009.\n[7] H. Meyer and F. Müller-Plathe. J. Chem. Phys., 115:7807–7810, 2001.\n[8] H. Meyer and F. Müller-Plathe. Macromolecules, 35:1241–1252, 2002.\n\n33\n\n\f[9] G. Strobl. The Physics of Polymers: Concepts for Understanding their Structures and Behavior. Springer, Berlin–Heidelberg, 1997.\n[10] M. Muthukumar. Adv. Chem. Phys., 128:1–63, 2004.\n[11] G. B. McKenna. Glass formation and glassy behavior. In C. Booth and C. Price,\neditors, Comprehensive Polymer Science, volume 2, pages 311–362. Pergamon,\nNew York, 1986.\n[12] C. A. Angell, K. L. Ngai, G. B. McKenna, P. F. McMillan, and S. W. Martin. J.\nAppl. Phys., 88:3113, 2000.\n[13] E. Donth. The Glass Transition. Springer, Berlin–Heidelberg, 2001.\n[14] P. R. Sundararajan. Can. J. Chem., 63:103–110, 1985.\n[15] K. Binder and W. Kob. Glassy Materials and Disordered Solids. World Scientific, New Jersey–London, 2005.\n[16] P. G. Debenedetti and F. H. Stillinger. Nature, 410:259, 2001.\n[17] W. Götze. Complex Dynamics of Glass-Forming Liquids: A Mode-Coupling\nTheory. Oxford University Press, Oxford, 2009.\n[18] G. H. Fredrickson. Nature Mat., 7:261, 2008.\n[19] J. Ferry. Viscoelastic Properties of Polymers. Wiley, New York, 1980.\n[20] R. N. Haward and R. J. Young. The physics of glassy polymers. Chapman &\nHall, London, 2nd edition, 1997.\n[21] I. M. Ward and D. W. Hadley. An Introduction to the Mechanical Properties of\nSolid Polymers. Wiley, Chichester–New York, 1993.\n[22] S. Granick, S. K. Kumar, E. J. Amis, M. Antonietti, A. C. Balazs, A. K.\nChakraborty, G. S. Grest, C. Hawker, P. Janmey, E. J. Kramer, R. Nuzzo, T. P.\nRussell, and C. R. Safinya. J. Poly. Sci. B: Polymer Physics, 41:2755–2793,\n2003.\n[23] J. A. Forrest and K. Dalnoki-Veress. Adv. Coll. Interf. Sci., 94:167, 2001.\n[24] M. Alcoutlabi and G. B. McKenna. J. Phys.: Condens. Matter, 17:R461, 2005.\n[25] J. H. R. Clarke. Molecular dynamics of glassy polymers. In K. Binder, editor,\nMonte Carlo and Molecular Dynamics Simulations in Polymer Science, pages\n272–306. Oxford Univ. Press, New York, 1995.\n[26] W. Paul and G. D. Smith. Rep. Prog. Phys., 67:1117, 2004.\n[27] J. Rottler. J. Phys.: Condens. Matter, 21:463101, 2009.\n[28] K Binder, J Baschnagel, W Kob, and W Paul. In Nielaba, P and Mareschal, M\nand Ciccotti, G, editor, Bridging Time Scales: Molecular Simulations For The\nNext Decade, volume 605 of Lecture Notes In Physics, pages 199–228, 2002.\nConference on Bridging the Time-Scale Gap, Constance, Germany, Sep, 2001.\n[29] K. Binder. J. Non-crystalline Solids, 307:1–8, 2002.\n34\n\n\f[30] K. Binder, J. Baschnagel, and W. Paul. Progress In Polymer Science, 28:115–\n172, 2003.\n[31] K. Binder. Phys. Complex Systems (new Adv. Perspectives), 155:17–82, 2004.\n[32] J. Baschnagel and F. Varnik. J. Physics-condensed Matter, 17:R851–R953,\n2005.\n[33] K. Binder. Introduction: General aspects of computer simulation techniques\nand their applications in polymer science. In K. Binder, editor, Monte Carlo\nand Molecular Dynamics Simulations in Polymer Science, pages 3–46. Oxford\nUniversity Press, New York, 1995.\n[34] C. Abrams, L. Delle Site, and K Kremer. Multiscale computer simulations for\npolymeric materials in bulk and near surfaces. In P. Nielaba, M. Mareschal, and\nG. Cicotti, editors, Bridging Time Scales: Molecular Simulations for the Next\nDecade, pages 143–164. Springer, Berlin, 2002.\n[35] J. Baschnagel, K. Binder, P. Doruker, A. A. Gusev, O. Hahn, K. Kremer, W. L.\nMattice, F. Müller-Plathe, M. Murat, W. Paul, S. Santos, U. W. Suter, and\nV. Tries. Adv. Polym. Sci., 152:41–154, 2000.\n[36] F. Müller-Plathe. ChemPhysChem, 3:754, 2002.\n[37] C. Peter and K. Kremer. Soft Matter, 5:4357–4366, 2009.\n[38] D. G. Tsalikis, N. Lempesis, G. C. Boulougouris, and D. N. Theodorou. J. Phys.\nChem. B, 112:10619–10627, 2008.\n[39] D. G. Tsalikis, N. Lempesis, G. C. Boulougouris, and D. N. Theodorou. J. Phys.\nChem. B, 112:10619–10627, 2008.\n[40] A. Heuer. J. Phys.: Condens. Matter, 20:373101, 2008.\n[41] R. A. L. Vallee, W. Paul, and K. Binder. J. Chem. Phys., 127:154903, 2007.\n[42] R. A. L. Vallee, M. Van der Auweraer, W. Paul, and K. Binder. Phys. Rev. Lett.,\n97, 2006.\n[43] J. Colmenero, F. Alvarez, and A. Arbe. Phys. Rev. E, 65:041804, 2002.\n[44] J. Colmenero, A. Arbe, F. Alvarez, M. Monkenbusch, D. Richter, B. Farago, and\nB. Frick. J. Phys.: Condens. Matter, 15:S1127, 2003.\n[45] A. V. Lyulin, N. K. Balabaev, and M. A. J. Michels. Macromolecules, 35:9595–\n9604, 2002.\n[46] A. V. Lyulin and M. A. J. Michels. Macromolecules, 35:1463–1472, 2002.\n[47] A. V. Lyulin, N. K. Balabaev, and M. A. J. Michels. Macromolecules, 36:8574–\n8575, 2003.\n[48] A. V. Lyulin, B. Vorselaars, M. A. Mazo, N. K. Balabaev, and M. A. J. Michels.\nEurophys. Lett., 71:618–624, 2005.\n[49] A. V. Lyulin and M. A. J. Michels. Phys. Rev. Lett., 99:085504, 2007.\n35\n\n\f[50] G. D. Smith, D. Bedrov, and W. Paul. J. Chem. Phys., 121:4961, 2004.\n[51] S. Krushev and W. Paul. Phys. Rev. E, 67:021806, 2003.\n[52] S. Krushev, W. Paul, and G. D. Smith. Macromolecules, 35:4198, 2002.\n[53] W. Paul, D. Bedrov, and G. D. Smith. Phys. Rev. E, 74:021501, 2006.\n[54] G. D. Smith and D. Bedrov. J. Polym. Sci. Part B: Polym. Phys., 45:627, 2007.\n[55] J. Colmenero, A. Narros, F. Alvarez, A. Arbe, and A. J. Moreno. J. Phys.:\nCondens. Matter, 19:205127, 2007.\n[56] A. Narros, A. Arbe, F. Alvarez, J. Colmenero, and D. Richter. J. Chem. Phys.,\n128:224905, 2008.\n[57] M. Vogel. Macromolecules, 41:2949, 2008.\n[58] Walter Kob. J. Phys.: Condens. Matter, 11:R85–R115, 1999.\n[59] T. C. Dotson, J. V. Heffernan, J. Budzien, K. T. Dotson, F. Avila, D. T. Limmer,\nD. T. McCoy, J. D. McCoy, and D. B. Adolf. J. Chem. Phys., 128:184905, 2008.\n[60] M. Bulacu and E. van der Giessen. Phys. Rev. E, page 011807, 2007.\n[61] M. Bernabei, A. J. Moreno, and J. Colmenero. Phys. Rev. Lett., 101:255701,\n2008.\n[62] M. Bernabei, A. J. Moreno, and J. Colmenero. arXiv:0909.2128v1.\n[63] J. Buchholz, W. Paul, F. Varnik, and K. Binder. J. Chem. Phys., 117:7364–7372,\n2002.\n[64] S. H. Chong, M. Aichele, H. Meyer, M. Fuchs, and J. Baschnagel. Phys. Rev. E,\n76:051806, 2007.\n[65] J. McCarty, I. Y. Lyubimov, and M. G. Guenza. J. Phys. Chem. B, 113:11876–\n11886, 2009.\n[66] T. Murtola, A. Bunker, I. Vattulainen, M. Deserno, and M. Karttunen. Phys.\nChem. Chem. Phys., 11:1869–1892, 2009.\n[67] T. Strauch, L. Yelash, and W. Paul. Phys. Chem. Chem. Phys., 11:1942–1948,\n2009.\n[68] Daan Frenkel and Berend Smit. Understanding Molecular Simulation. Academic Press, London, 2nd edition, 2002.\n[69] K. Binder, J. Horbach, W. Kob, W. Paul, and F. Varnik. J. Physics-condensed\nMatter, 16:S429–S453, 2004.\n[70] D. P. Landau and K. Binder. A Guide to Monte Carlo Simulations in Statistical\nPhysics. Cambridge University Press, Cambridge, 2009.\n[71] A. Bunker and B. Dünweg. Phys. Rev. E, 63:016701, 2000.\n[72] R. Yamamoto and W. Kob. Phys. Rev. E, 61:5473, 2000.\n36\n\n\f[73] C. De Michele and F. Sciortiono. Phys. Rev. E, 65:051202, 2002.\n[74] Q. Yan, T. S. Jain, and J. J. de Pablo. Phys. Rev. Lett., 92:235701, 2004.\n[75] M. Chopra, R. Malshe, A. S. Reddy, and J. J. de Pablo. J. Chem. Phys.,\n128:144104, 2008.\n[76] B Schnell. PhD thesis, University of Strasbourg, 2006.\n[77] A. Soldera and N. Metatla. Phys. Rev. E, 74:061803, 2006.\n[78] N. Metatla and A. Soldera. Macromolecules, 40:9690, 2007.\n[79] K. Vollmayr, W. Kob, and K. Binder. J. Chem. Phys., 105:4714, 1996.\n[80] K. Vollmayr, W. Kob, and K. Binder. J. Chem. Phys., 54:15808, 1996.\n[81] R. Brüning and K. Samwer. Phys. Rev. B, 46:11318, 1992.\n[82] Y. Ding, A. Kisliuk, and A. P. Sokolov. Macromolecules, 37:161–166, 2004.\n[83] K. Kunal, C. G. Robertson, S. Pawlus, S. F. Hahn, and A. P. Sokolov. Macromolecules, 41:7232–7238, 2008.\n[84] J. Hintermeyer, A. Herrmann, R. Kahlau, C. Goiceanu, and E. A. Rösler. Macromolecules, 41:9335–9344, 2008.\n[85] A. L. Agapov and A. P. Sokolov. Macromolecules, 42:2877–2878, 2009.\n[86] B. Lobe, J. Baschnagel, and K. Binder. J. Non-crystalline Solids, 172:384–390,\n1994.\n[87] J. Dudowicz, K. F. Freed, and J. F. Douglas. Adv. Chem. Phys., 137:125–222,\n2008.\n[88] K. S. Schweizer. Curr. Opinion Coll. & Interf. Sci., 12:297, 2007.\n[89] A. S. Keys, A. R. Abate, S. C. Glotzer, and D. J. Durian. Nature Phys., 3:260,\n2007.\n[90] C. Bennemann, J. Baschnagel, W. Paul, and K. Binder. Computational Theoretical Polymer Science, 9:217–226, 1999.\n[91] M. Brodeck, F. Alvarez, A. Arbe, F. Juranyi, T. Unruh, O. Holderer, J. Colmenero, and D. Richter. J. Chem. Phys., 130:094908, 2009.\n[92] M. Zamponi, A. Wischnewski, M. Monkenbusch, L. Willner, D. Richter,\nP. Falus, B. Farago, and M. Guenza. J. Phys. Chem. B, 112:16220–16229, 2008.\n[93] H. Meyer, J. P. Wittmer, T. Kreer, P. Beckrich, A. Johner, J. Farago, and\nJ. Baschnagel. Eur. Phys. J. E, 26:25–33, 2008.\n[94] Martin Aichele and Jörg Baschnagel. Eur. Phys. J. E, 5:229, 2001.\n[95] W. Götze. J. Phys.: Condens. Matter, 11:A1, 1999.\n[96] P. Mayer, K. Miyazaki, and D. R. Reichman. Phys. Rev. Lett., 97:095702, 2006.\n\n37\n\n\f[97] B. Kim and K. Kawasaki. J. Stat. Mech., 2:P02004, 2008.\n[98] G. Szamel. J. Chem. Phys., 127:084515, 2007.\n[99] A. Andreanov, G. Biroli, and J.-L. Bouchaud. Europhys. Lett., 88:16001, 2009.\n[100] K. Chen, E. J. Saltzman, and K. S. Schweizer. J. Phys.: Condens. Matter,\n21:503101, 2009.\n[101] Jean Pierre Hansen and Ian R. McDonald. Theory of Simple Liquids. Academic\nPress, London, 1986.\n[102] G. F. Signorini, J.-L. Barrat, and M. L. Klein. J. Chem. Phys., 92:1294–1303,\n1990.\n[103] Walter Kob and Hans C. Andersen. Phys. Rev. E, 51:4626–4641, 1995.\n[104] M. Sperl. Phys. Rev. E, 68:031405, 2003.\n[105] E. Zaccarelli and W. C. K. Poon. PNAS, 106:15203–15208, 2009.\n[106] A. J. Moreno and J. Colmenero. J. Chem. Phys., 124:184906, 2006.\n[107] A. J. Moreno and J. Colmenero. J. Phys.: Condens. Matter, 19:466112, 2007.\n[108] J. Colmenero and A. Arbe. Soft Matter, 3:1474, 2007.\n[109] S.-H. Chong and M. Fuchs. Phys. Rev. Lett., 88:185702, 2002.\n[110] M. Aichele, S. H. Chong, J. Baschnagel, and M. Fuchs. Phys. Rev. E, 69:061801,\n2004.\n[111] E. Flenner and G. Szamel. Phys. Rev. E, 72:011205, 2005.\n[112] E. Flenner and G. Szamel. Phys. Rev. E, 72:031508, 2005.\n[113] G. Foffi, W. Götze, F. Sciortino, P. Tartaglia, and Th. Voigtmann. Phys. Rev. E,\n69:011505, 2004.\n[114] Th. Voigtmann, A. M. Puertas, and M. Fuchs. Phys. Rev. E, 70:061506, 2004.\n[115] P. Chaudhuri, L. Berthier, and W. Kob. Phys. Rev. Lett., 99:060604, 2007.\n[116] S. Merabia and D. Long. Eur. Phys. J. E, 9:195, 2002.\n[117] S. K. Kumar, G. Szamel, and J. F. Douglas. J. Chem. Phys., 124:214501, 2006.\n[118] A. P. Sokolov and K. S. Schweizer. Phys. Rev. Lett., 102:248301, 2009. (Comment: Phys. Rev. Lett., 103:159801, 2009. Reply: Phys. Rev. Lett., 103:159802,\n2009.).\n[119] M. D. Ediger. Annu. Rev. Phys. Chem., 51:99–128, 2000.\n[120] S. C Glotzer. J. Non-Cryst. Solids, 274:342–355, 2000.\n[121] L. Berthier, G. Biroli, J.-P. Bouchaud, W. Kob, K. Miyazaki, and D. R. Reichman. J. Chem. Phys., 126:184503, 2007.\n\n38\n\n\f[122] L. Berthier, G. Biroli, J.-P. Bouchaud, W. Kob, K. Miyazaki, and D. R. Reichman. J. Chem. Phys., 126:184504, 2007.\n[123] S. Peter, H. Meyer, and J. Baschnagel. European Phys. J. E, 28:147–158, 2009.\n[124] L. Hartmann, K. Fukao, and F. Kremer. Molecular dynamics in thin polymer\nfilms. In F. Kremer and A. Schönhals, editors, Broadband Dielectric Spectroscopy, pages 433–473. Springer, Berlin, Heidelberg, New York, 2003.\n[125] F. Kremer, A. Huwe, A. Schönhals, and S. A. Różański. Molecular dynamics in\nconfining space. In F. Kremer and A. Schönhals, editors, Broadband Dielectric\nSpectroscopy, pages 171–224. Springer, Berlin, Heidelberg, New York, 2003.\n[126] C. B. Roth and J. R. Dutcher. Mobility on different length scales in thin polymer\nfilms. In J. R. Dutcher and A. G. Marangoni, editors, Soft Materials: Structure\nand Dynamics, pages 1–38. Marcel Dekker, New York, 2005.\n[127] C. Alba-Simionesco, B. Coasne, G. Dosseh, G. Dudziak, K. E. Gubbins, R. Radhakrishnan, and M. Sliwinska-Bartkowiak. J. Phys.: Condens. Matter, 18:R15,\n2006.\n[128] O. K. C. Tsui. Anomalous dynamics of polymer films. In O. K. C. Tsui and T. P.\nRussell, editors, Polymer Thin Films, page 267. World Scientific, Singapore,\n2008.\n[129] J. L. Keddie, R. A. L. Jones, and R. A. Cory. Europhys. Lett., 27:59, 1994.\n[130] J. S. Sharp and J. A. Forrest. Phys. Rev. E, 67:031805, 2003.\n[131] J. A. Forrest. Eur. Phys. J. E, 8:261, 2002.\n[132] S. Herminghaus, K. Jacobs, and R. Seemann. Eur. Phys. J. E, 5:531, 2001.\n[133] Y. Grohens, L. Hamon, G. Reiter, A. Soldera, and Y. Holl. Eur. Phys. J. E, 8:217,\n2002.\n[134] K. Fukao and Y. Miyamoto. Phys. Rev. E, 61:1743, 2000.\n[135] K. Fukao and Y. Miyamoto. Phys. Rev. E, 64:011803, 2001.\n[136] J. H. Kim, J. Jang, and W.-C. Zin. Langmuir, 17:2703, 2001.\n[137] O. K. C. Tsui and H. F. Zhang. Macromolecules, 34:9139, 2001.\n[138] D. S. Fryer, R. D. Peters, E. J. Kim, J. E. Tomaszewski, J. J. de Pablo, P. F.\nNealey, C. C. White, and W. L. Wu. Macromolecules, 34:5627–5634, 2001.\n[139] C. J. Ellison and J. M. Torkelson. Nature Mat., 2:695, 2003.\n[140] C. Ellison, M. Mundra, and J. Torkelson. Macromolecules, 38:1767, 2005.\n[141] R. D. Priestley, L. J. Broadbelt, J. M. Torkelson, and K. Fukao. Phys. Rev. E,\n75:061806, 2007.\n[142] V. Lupaşcu, S. J. Picken, and M. Wübbenhorst. Journal of Non-Crystalline\nSolids, 352:5594, 2006.\n\n39\n\n\f[143] S. Napolitano and M. Wübbenhorst. J. Phys. Chem. B, 111:9197, 2007.\n[144] M. Yu. Efremov, E. A. Olson, M. Zhang, Z. Zhang, and L. H. Allen. Macromolecules, 37:4607, 2004.\n[145] H. Huth, A. A. Minakov, A. Serghei, F. Kremer, and C. Schick. Eur. Phys. J.\nSpecial Topics, 141:153, 2007.\n[146] Z. Fakhraai and J. A. Forrest. Science, 319:600, 2008.\n[147] Z. Fakhraai and J. A. Forrest. Phys. Rev. Lett., 95:025701, 2005.\n[148] K. Fukao. Euro. Phys. J. E, 12:119–125, 2003.\n[149] S. Napolitano, V. Lupaşcu, and M. Wübbenhorst. Macromolecules, 41:1061,\n2008.\n[150] R. Lund, L. Willner, A. Alegría, J. Colmenero, and D. Richter. Macromolecules,\n41:511, 2008.\n[151] A. Serghei, M. Tress, and F. Kremer. Macromolecules, 39:9385, 2006.\n[152] A. Serghei, L. Hartmann, and F. Kremer. J. Non-Cryst. Solids, 353:4330, 2007.\n[153] P. Scheidler, W. Kob, and K. Binder. Europhysics Lett., 59:701–707, 2002.\n[154] P. Scheidler, W. Kob, and K. Binder. Computer Simulations Surfaces Interfaces,\n114:297–312, 2003.\n[155] P. Scheidler, W. Kob, and K. Binder. J. Phys. Chem. B, 108:6673–6686, 2004.\n[156] P. Gallo, R. Pellarin, and M. Rovere. Europhys. Lett., 57:212, 2002.\n[157] J. A. Torres, P. F. Nealey, and J. J. de Pablo. Phys. Rev. Lett., 85:3221–3224,\n2000.\n[158] T. S. Jain and J. J. de Pablo. Phys. Rev. Lett., 92:155505, 2004.\n[159] T. S. Jain and J. J. de Pablo. Macromolecules, 35:2167–2176, 2002.\n[160] T. R. Bohme and J. J. de Pablo. J. Chem. Phys., 116:9939–9951, 2002.\n[161] K. Yoshimoto, T. S. Jain, P. F. Nealey, and J. J. de Pablo. J. Chem. Phys.,\n122:144712, 2005.\n[162] R. A. Riggleman, K. Yoshimoto, J. F. Douglas, and J. J. de Pablo. Phys. Rev.\nLett., 97:045502, 2006.\n[163] A. R. C. Baljon, M. H. M. Van Weert, R. Barber DeGraaff, and R. Khare. Macromolecules, 38:2391, 2005.\n[164] A. R. C. Baljon, J. Billen, and R. Khare. Phys. Rev. Lett., 93:255701, 2004.\n[165] H. Morita, K. Tanaka, T. Kajiyama, T. Nishi, and M. Doi. Macromolecules,\n39:6233, 2006.\n[166] F. Varnik, J. Baschnagel, and K. Binder. Phys. Rev. E, 65:021507, 2002.\n\n40\n\n\f[167] F. Varnik, J. Baschnagel, and K. Binder. European Phys. J. E, 8:175–192, 2002.\n[168] F. Varnik and K. Binder. J. Chem. Phys., 117:6336–6349, 2002.\n[169] F. Varnik, J. Baschnagel, K. Binder, and M. Mareschal. European Phys. J. E,\n12:167–171, 2003.\n[170] S. Peter, H. Meyer, and J. Baschnagel. J. Polymer Science Part B-polymer Phys.,\n44:2951–2967, 2006.\n[171] S. Peter, H. Meyer, J. Baschnagel, and R. Seemann. J. Physics-condensed Matter, 19:205119, 2007.\n[172] S. Peter, S. Napolitano, H. Meyer, M. Wubbenhorst, and J. Baschnagel. Macromolecules, 41:7729–7743, 2008.\n[173] S. Peter, H. Meyer, and J. Baschnagel. J. Chem. Phys., 131:014902, 2009.\n[174] S. Peter, H. Meyer, and J. Baschnagel. J. Chem. Phys., 131:014903, 2009.\n[175] D. Hudzinskyy, A. V. Lyulin, A. R. C. Baljon, N. K. Balabaev, and M. A. J.\nMichels. J. Polym. Sci. B, submitted.\n[176] O. Alexiadis, V. G. Mavrantzas, R. Khare, J. Beckers, and A. R. C. Baljon.\nMacromolecules, 41:987–996, 2008.\n[177] G. Xu and W. L. Mattice. J. Chem. Phys., 118:5241, 2003.\n[178] K. F. Mansfield and D. N. Theodorou. Macromolecules, 24:6283–6294, 1991.\n[179] E. Manias, V. Kuppa, D.-K. Yang, and D. B. Zax. Colloids Surf. A, 187–188:509,\n2001.\n[180] F. W. Starr, T. B. Schroder, and S. C. Glotzer. Phys. Rev. E, 64:021802, 2001.\n[181] F. W. Starr, T. B. Schroder, and S. C. Glotzer. Macromolecules, 35:4481–4492,\n2002.\n[182] H. Meyer, T. Kreer, A. Cavallo, J.P. Wittmer, and J. Baschnagel. Eur. Phys. J.\nSpecial Topics, 141:167–172, 2006.\n[183] A. Cavallo, M. Müller, J. P. Wittmer, A. Johner, and K. Binder. J. Phys.: Condens. Matter, 17:S1697, 2005.\n[184] S. Herminghaus. Eur. Phys. J. E, 8:237, 2002.\n[185] P. G. de Gennes. Eur. Phys. J. E, 2:201, 2000.\n[186] J. D. McCoy and J. G. Curro. J. Chem. Phys., 116:9154, 2002.\n[187] T. M. Truskett and V. Ganesan. J. Chem. Phys., 119:1897, 2003.\n[188] J. Mittal, P. Shah, and T. M. Truskett. J. Phys. Chem. B, 108:19769, 2004.\n[189] T. S. Chow. J. Phys.: Condens. Matter, 14:L333, 2002.\n[190] K. L. Ngai. Eur. Phys. J. E, 12:93, 2003.\n\n41\n\n\f[191] D. Long and F. Lequeux. Eur. Phys. J. E, 4:371, 2001.\n[192] S. Merabia, P. Sotta, and D. Long. Eur. Phys. J. E, 15:189, 2004.\n[193] J. E. G. Lipson and S. T. Milner. Eur. Phys. J. B, 72:133, 2009.\n[194] G. D. Smith, D. Bedrov, and O. Borodin. Phys. Rev. Lett., 90:226103, 2003.\n[195] V. Teboul and C. Alba-Simionesco. J. Phys.: Condens. Matter, 14:5699, 2002.\n[196] V. Krakoviack. Phys. Rev. E, 75:031503, 2007.\n[197] V. Krakoviack. Phys. Rev. E, 79:061501, 2009.\n[198] J. Servantie and M. Müller. Phys. Rev. Lett., 101:026101, 2008.\n[199] M. Fuchs and K. Kroy. J. Phys.: Condens. Matter, 14:9223, 2002.\n[200] C. A. Angell. Polymer, 38:6261, 1997.\n[201] A. Tanguy, J. P. Wittmer, F. Leonforte, and J.-L. Barrat. Phys. Rev. B, 66:174205,\n2002.\n[202] Michel Tsamados, Anne Tanguy, Chay Goldenberg, and Jean-Louis Barrat.\nPhys. Rev. E, 80(2, Part 2):026112, 2009.\n[203] K Yoshimoto, TS Jain, KV Workum, PF Nealey, and J.J. de Pablo. Mechanical\nheterogeneities in model polymer glasses at small length scales. Phys. Rev. Lett.,\n93(17):175501, OCT 22 2004.\n[204] K Yoshimoto, GJ Papakonstantopoulos, JF Lutsko, and JJ de Pablo. Phys. Rev.\nB, 71(18):184108, 2005.\n[205] K Van Workum and J.J. de Pablo. Computer simulation of the mechanical properties of amorphous polymer nanostructures. Nano Letters, 3(10):1405–1410,\nOCT 2003.\n[206] Jean-Louis Barrat. In Garrido, PL and Hurtado, PI and Marro, J, editor, Modeling And Simulation Of New Materials, AIP Conference Proceedings 1091, Garrido et al ed., volume 1091 of AIP Conference Proceedings, pages 79–94. 2009.\n10th Granada Seminar, Granada, SPAIN, SEP 15-19, 2008.\n[207] S. G. Mayr. Phys. Rev. B, 79(6):060201, 2009.\n[208] G. J. Papakonstantopoulos, R. A. Riggleman, J. L. Barrat, and J. J. de Pablo.\nPhys. Rev. E, 77:041502, 2008.\n[209] T. S. Jain and J. J. de Pablo. J. Chem. Phys., 120:9371–9375, 2004.\n[210] G. J. Papakonstantopoulos, M. Doxastakis, P. F. Nealey, J. L. Barrat, and J. J.\nde Pablo. Phys. Rev. E, 75:031803, 2007.\n[211] G. J. Papakonstantopoulos, K. Yoshimoto, M. Doxastakis, P. F. Nealey, and J. J.\nde Pablo. Phys. Rev. E, 72:031801, 2005.\n[212] Robert A. Riggleman, Gregory Toepperwein, George J. Papakonstantopoulos,\nJean-Louis Barrat, and Juan J. de Pablo. J. Chem. Phys., 130(24):244903, JUN\n28 2009.\n42\n\n\f[213] J Berriot, H Montes, F Lequeux, D Long, and P Sotta. Europhysics Lett.,\n64(1):50–56, 2003.\n[214] H Montes, F Lequeux, and J Berriot. Macromolecules, 36(21):8107–8118, 2003.\n[215] R. A. Riggleman, H. N. Lee, M. D. Ediger, and J. J. De Pablo. Phys. Rev. Lett.,\n99:215501, 2007.\n[216] M. Warren and J. Rottler. Phys. Rev. E, 76:031802, 2007.\n[217] L.C.E. Struik. Physical aging in amorphous polymers and other materials. Elsevier, Amsterdam, 1978.\n[218] Hau-Nan Lee, Robert A. Riggleman, Juan J. de Pablo, and M. D. Ediger. Macromolecules, 42(12):4328–4336, 2009.\n[219] R. A. Riggleman, J. F. Douglas, and J. J. De Pablo. Phys. Rev. E, 76:011504,\n2007.\n[220] R. A. Riggleman, J. F. Douglas, and J. J. de Pablo. J. Chem. Phys., 126:234903,\n2007.\n[221] J. Rottler and M. O. Robbins. Phys. Rev. Lett., 89:148304, 2002.\n[222] J Rottler and MO Robbins. Phys. Rev. E, 68:011507, 2003.\n[223] J Rottler and MO Robbins. Phys. Rev. E, 68(1, Part 1):011801, 2003.\n[224] J Rottler and MO Robbins. Phys. Rev. Letters, 95(22):225504, 2005.\n[225] Ali Makke, Michel Perez, Olivier Lame, and Jean-Louis Barrat. J. Chem. Phys.,\n131(1):014904, 2009.\n[226] R. N. Harward. Macromolecules, 26:5860–5869, 1993.\n[227] E. J. Kramer. J. Polym. Sci.: Polym. Phys., 43:3369–3371, 2005.\n[228] H. G. H. van Melick, L. E. Govaert, and H. E. H. Meijer. Polymer, 44:2493–\n2502, 2003.\n[229] L. E. Govaert and T. A. Tervoort. J. Polym. Sci.: Polym. Phys., 42:2041–2049,\n2004.\n[230] S. S. Sarva, S. Deschanel, M. C. Boyce, and W. N. Chen. Polymer, 48:2208–\n2213, 2007.\n[231] M. C. Boyce and E. M. Arruda. Polym. Eng. Sci., 30:1288–1298, 1990.\n[232] B. Vorselaars, A. V. Lyulin, and M. A. J. Michels. Macromolecules, 42:5829–\n5842, 2009.\n[233] O. B. Salamatina, S. I. Nazarenko, S. N. Rudnev, and E. F. Oleinik. Mech.\nCompos. Mater, 24:721–725, 1988.\n[234] E. F. Oleinik, S. N. Rudnev, O. B. Salamatina, S. V. Shenogin, M. I. Kotelyanskii, T. V. Paramzina, and S. I. Nazarenko. E-Polymers, 29:029, 2006.\n\n43\n\n\f[235] R. S. Hoy and M. O. Robbins. Phys. Rev. Lett., 99:117801, 2007.\n[236] R. S. Hoy and M. O. Robbins. Phys. Rev. E, 77:031801, 2008.\n[237] M Utz, PG Debenedetti, and FH Stillinger. J. Chem. Phys., 114(22):10049–\n10057, 2001.\n[238] R. S. Hoy and M. O. Robbins. J. Polym. Sci.: Polym. Phys., 44:3487–3500,\n2006.\n[239] L. J. Fetters, D. J. Lohse, D. Richter, T. A. Witten, and A. Zirkel. Macromolecules, 27:4639–4647, 1994.\n[240] L. J. Fetters, D. J. Lohse, S. T. Milner, and W. W. Graessley. Macromolecules,\n32:6847–6851, 1999.\n[241] J. I. McKechnie, R. N. Haward, D. Brown, and J. H. R Clarke. Macromolecules,\n26:198–202, 1993.\n[242] A. V. Lyulin, N. K. Balabaev, M. A. Mazo, and M. A. J. Michels. Macromolecules, 37:8785–8793, 2004.\n[243] B. Vorselaars, A. V. Lyulin, and M. A. J. Michels. J. Chem. Phys., 130:074905,\n2009.\n[244] H. G. H. van Melick, L. E. Govaert, and H. E. H. Meijer. Polymer, 44:3579–\n3591, 2003.\n[245] J.E. Mark. Physical Properties of Polymers Handbook. Springer, Berlin, 2007.\n[246] A. J. Moreno and J. Colmenero. Phys. Rev. Lett., 100:126001, 2008.\n[247] T. Vettorel, H. Meyer, J. Baschnagel, and M. Fuchs. Phys. Rev. E, 75:041801,\n2007.\n\n44\n\n\f0.6\n1.0\n0.4\n\nGaussian\nGaussian\n\n∞\nTg/T\nTg\n\n4πr Gs,S\n(r,t)\ns,P\n\n3\n\n0.8\n\nsolvent √6 r1.1\n0,cr\n√6\n0,c\nφS=25%\nt't2\nt=10\n~t2\n~tt'2\n1.0\n~t2\nt=10\n\nt=25000\n\nt=25000\n\nT=0.35\n0.01 0.02 0.03 0.04\n0.05\n\nNg/N\n\n∞\nTg/T\nTg\n\n0.2\n0\n0.9\n\n0.8\n0\n\nPS-1\n0\n10\n10\nPMS\nr\nPVC\nflexible\nsemiflexible\n0.05\n\n0.1\n\nNg/N\n\nN=64\nφS=25%\n10\n\n0.15\n\n1\n\n\fv\n\n0.46\n0.44\n0.42\n0\n\n0.2\n\n0.4\n\n0.6\n\nT\n\n0.8\n\n1\n\n\f"}