{"id": "http://arxiv.org/abs/1102.2986v1", "guidislink": true, "updated": "2011-02-15T07:54:28Z", "updated_parsed": [2011, 2, 15, 7, 54, 28, 1, 46, 0], "published": "2011-02-15T07:54:28Z", "published_parsed": [2011, 2, 15, 7, 54, 28, 1, 46, 0], "title": "Sidon Sequences and Doubly Periodic Two-Dimensional Synchronization\n  Patterns", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1102.2681%2C1102.3452%2C1102.3099%2C1102.4679%2C1102.4577%2C1102.0918%2C1102.3146%2C1102.4879%2C1102.4420%2C1102.2986%2C1102.1433%2C1102.4419%2C1102.3106%2C1102.1763%2C1102.5196%2C1102.1426%2C1102.4919%2C1102.2754%2C1102.2576%2C1102.0113%2C1102.0805%2C1102.0949%2C1102.0479%2C1102.2095%2C1102.5229%2C1102.2341%2C1102.0549%2C1102.2220%2C1102.4787%2C1102.0137%2C1102.2612%2C1102.4977%2C1102.1516%2C1102.3483%2C1102.2314%2C1102.4850%2C1102.3901%2C1102.4639%2C1102.5380%2C1102.3318%2C1102.3062%2C1102.1210%2C1102.4263%2C1102.1473%2C1102.4733%2C1102.4626%2C1102.3269%2C1102.2013%2C1102.4428%2C1102.3835%2C1102.1965%2C1102.3541%2C1102.3404%2C1102.3396%2C1102.4806%2C1102.0580%2C1102.3440%2C1102.4750%2C1102.4973%2C1102.4232%2C1102.0830%2C1102.3046%2C1102.5300%2C1102.4448%2C1102.5018%2C1102.4599%2C1102.0947%2C1102.5558%2C1102.0203%2C1102.4689%2C1102.2728%2C1102.3391%2C1102.2735%2C1102.2896%2C1102.3253%2C1102.1405%2C1102.2025%2C1102.0079%2C1102.1383%2C1102.0470%2C1102.5005%2C1102.2430%2C1102.5335%2C1102.3686%2C1102.4394%2C1102.4310%2C1102.1269%2C1102.0331%2C1102.4686%2C1102.2869%2C1102.4017%2C1102.0138%2C1102.2668%2C1102.0704%2C1102.1574%2C1102.0988%2C1102.4796%2C1102.2109%2C1102.2281%2C1102.3533%2C1102.4436&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Sidon Sequences and Doubly Periodic Two-Dimensional Synchronization\n  Patterns"}, "summary": "Sidon sequences and their generalizations have found during the years and\nespecially recently various applications in coding theory. One of the most\nimportant applications of these sequences is in the connection of\nsynchronization patterns. A few constructions of two-dimensional\nsynchronization patterns are based on these sequences. In this paper we present\nsufficient conditions that a two-dimensional synchronization pattern can be\ntransformed into a Sidon sequence. We also present a new construction for Sidon\nsequences over an alphabet of size q(q-1), where q is a power of a prime.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1102.2681%2C1102.3452%2C1102.3099%2C1102.4679%2C1102.4577%2C1102.0918%2C1102.3146%2C1102.4879%2C1102.4420%2C1102.2986%2C1102.1433%2C1102.4419%2C1102.3106%2C1102.1763%2C1102.5196%2C1102.1426%2C1102.4919%2C1102.2754%2C1102.2576%2C1102.0113%2C1102.0805%2C1102.0949%2C1102.0479%2C1102.2095%2C1102.5229%2C1102.2341%2C1102.0549%2C1102.2220%2C1102.4787%2C1102.0137%2C1102.2612%2C1102.4977%2C1102.1516%2C1102.3483%2C1102.2314%2C1102.4850%2C1102.3901%2C1102.4639%2C1102.5380%2C1102.3318%2C1102.3062%2C1102.1210%2C1102.4263%2C1102.1473%2C1102.4733%2C1102.4626%2C1102.3269%2C1102.2013%2C1102.4428%2C1102.3835%2C1102.1965%2C1102.3541%2C1102.3404%2C1102.3396%2C1102.4806%2C1102.0580%2C1102.3440%2C1102.4750%2C1102.4973%2C1102.4232%2C1102.0830%2C1102.3046%2C1102.5300%2C1102.4448%2C1102.5018%2C1102.4599%2C1102.0947%2C1102.5558%2C1102.0203%2C1102.4689%2C1102.2728%2C1102.3391%2C1102.2735%2C1102.2896%2C1102.3253%2C1102.1405%2C1102.2025%2C1102.0079%2C1102.1383%2C1102.0470%2C1102.5005%2C1102.2430%2C1102.5335%2C1102.3686%2C1102.4394%2C1102.4310%2C1102.1269%2C1102.0331%2C1102.4686%2C1102.2869%2C1102.4017%2C1102.0138%2C1102.2668%2C1102.0704%2C1102.1574%2C1102.0988%2C1102.4796%2C1102.2109%2C1102.2281%2C1102.3533%2C1102.4436&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Sidon sequences and their generalizations have found during the years and\nespecially recently various applications in coding theory. One of the most\nimportant applications of these sequences is in the connection of\nsynchronization patterns. A few constructions of two-dimensional\nsynchronization patterns are based on these sequences. In this paper we present\nsufficient conditions that a two-dimensional synchronization pattern can be\ntransformed into a Sidon sequence. We also present a new construction for Sidon\nsequences over an alphabet of size q(q-1), where q is a power of a prime."}, "authors": ["Tuvi Etzion"], "author_detail": {"name": "Tuvi Etzion"}, "author": "Tuvi Etzion", "arxiv_comment": "submitted to International Symposium on Information Theory", "links": [{"href": "http://arxiv.org/abs/1102.2986v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1102.2986v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "cs.IT", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cs.IT", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "math.IT", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1102.2986v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1102.2986v1", "journal_reference": null, "doi": null, "fulltext": "Sidon Sequences and Doubly Periodic\nTwo-Dimensional Synchronization Patterns\nTuvi Etzion\n\narXiv:1102.2986v1 [cs.IT] 15 Feb 2011\n\nDepartment of Computer Science\nTechnion-Israel Institute of Technology\nHaifa 32000, Israel\nEmail: etzion@cs.technion.ac.il\nAbstract-Sidon sequences and their generalizations have\nfound during the years and especially recently various applications in coding theory. One of the most important applications\nof these sequences is in the connection of synchronization patterns. A few constructions of two-dimensional synchronization\npatterns are based on these sequences. In this paper we present\nsufficient conditions that a two-dimensional synchronization\npattern can be transformed into a Sidon sequence. We also\npresent a new construction for Sidon sequences over an\nalphabet of size q(q − 1), where q is a power of a prime.\n\nI. I NTRODUCTION\nLet A be an abelian group and let D\n=\n{a1 , a2 , . . . , am } ⊆ A be a subset of m distinct elements\nof A. D is a Sidon sequence (or a B2 -sequence) over\nA if all the sums ai1 + ai2 with 1 ≤ i1 ≤ i2 ≤ m are\ndistinct (if i1 < i2 in the definition the sequence is called a\nweak Sidon sequences). Sidon sequences have found many\napplications in coding and communication. For example,\nweak Sidon sequences are used for construction of constant\nweight codes with minimum Hamming distance 6 [1],\nand constructions of location-correcting codes [2]. Sidon\nsequences were used in constructions of two-dimensional\nsynchronization patterns [3], [4]. There is a generalization to\nBh sequences (all sums of h elements are distinct) and they\napplied for example in multihop paths related to wireless\nsensor networds [5] and error-correcting codes for rank\nmodulation [6]. A comprehensive survey on B2 -sequences\nand their generalizations was given by O'Bryant [7]. Even\nso in a Sidon sequence all sums of pairs of elements from\nD (not necessarily distinct elements) are distinct there is\na trivial connection to a set in which all differences of\nordered pairs of elements are distinct.\nTheorem 1: A subset D = {a1 , a2 , . . . , am } ⊆ A is a\nSidon sequence over A if and only if all the differences\nai1 − ai2 with 1 ≤ i1 6= i2 ≤ m are distinct in A.\nA Sidon sequence with m elements over an abelian group\nwith n elements is called optimal if all Sidon sequences over\nan abelian group with n elements have at most m elements.\nIn view of Theorem 1 bounds on the size of a Sidon\nsequence (on the number of elements m) can be derived\nby considering difference and not sums.\nis important\n\u0001 This m\n2\n+m\nwhile\nsince the number of distinct sums is m\n+m\n=\n2\n2\nthe number of distinct differences is considerably higher,\nm(m − 1) = m2 − m. This yields a better upper bound on\nm. A Sidon sequence D is a set of m elements. If the abelian\n\ngroup is Zn then D can be represented as a binary cyclic\nsequence s = [s0 s1 , * * * , sn−1 ], where si = 1 if i ∈ D.\nOne-dimensional synchronization patterns were first introduced by Babcock in connection with radio interference [8].\nOther applications are discussed in details in [9] and some\nmore are given in [10], [11]. The two-dimensional applications and related structures were first introduced in [12] and\ndiscussed in many papers, e.g. [13], [14], [15], [16], [17].\nRecent new application in keys predistribution for wireless\nsensor networks [18] led to new related two-dimensional\nproblems concerning these patterns [3], [5]. Difference pattern and Sidon sequences have an important role in the\nconstruction of synchronization patterns.\nSome of the applications of Sidon sequence is due to the\ndifference properties implied by Theorem 1. This property\nis also the basis of the applications to two-dimensional\nsynchronization patterns. There are various papers, e.g. [3],\n[4], [17] in which an one-dimensional sequence (as a Sidon\nsequence or a ruler) is transformed into a two-dimensional\nsynchronization pattern. The main goal of this paper is\nto establish the inverse transformation, in which a twodimensional synchronization pattern is transformed into a\nSidon sequence, which is a one-dimensional sequence.\nThe rest of this paper is organized as follows. In Section II\nwe define what is a period in a two-dimensional array\nand as a result we obtain a definition for a cyclic twodimensional array. In Section III we discuss various types of\ntwo-dimensional synchronization patterns. In particular we\ndiscuss periodic two-dimensional synchronization patterns.\nIn Section IV we present two operations, namely, folding\nand unfolding. Folding generates a two-dimensional array\nfrom an one-dimensional sequence. Unfolding is the inverse\noperation and it generates an one-dimensional sequence from\na two-dimensional array. In particular we will prove that\nthese operations relate periodic sequences to periodic twodimensional arrays and vice-versa. Moreover, they relate\nan one-dimensional synchronization sequence to a twodimensional synchronization array and vice-versa, if the twodimensional array is periodic. As a consequence we obtain\nthe main result of the paper that two-dimensional periodic\nsynchronization arrays which can be unfolded are equivalent\nto Sidon sequences over Zn , where n is the size of one\nperiod in the array. In Section V we present a construction\nof optimal Sidon sequences with q−1 elements over a group\nwith q(q − 1) elements, where q is a power of a prime. This\n\n\fgeneralizes a similar result where q is a prime. Section VI\ncontains conclusions and problems for further research.\nII. P ERIODICITY\n\nOF\n\nT WO -D IMENSIONAL A RRAYS\n\nA. periodic sequences and arrays\nIt is very simple to define the periodicity for onedimensional sequences. An infinite sequence S =\n. . . s−1 , s0 , s1 , s2 , . . . is periodic if there exists an integer\nπ such that si+π = si for each i ∈ Z. If π is the smallest\ninteger for which the sequence has this property then we say\nthat π is the period of the sequence and write the sequence\nas [s0 , s1 , . . . , sπ−1 ], and say that the sequences is a cyclic\nsequence or a cycle. It is well known that\nTheorem 2: If π is the period of a sequence S, and there\nexists an integer ρ such that si+ρ = si for each i ∈ Z, then\nπ divides ρ.\nUsually, an infinite two-dimensional array A is said to be\ndoubly periodic if there exists two integers κ and η such\nthat for each i, j ∈ Z we have A(i + κ, j) = A(i, j + η) =\nA(i, j). But, it appears that this definition is too restricted.\nA generalized definition, which give more information, is\nas follows. An infinite two-dimensional array A is doubly\nperiodic if there exists two linearly independent integer\nvectors (π1 , π2 ) and (ξ1 , ξ2 ) such that each i, j ∈ Z satisfy\nA(i + π1 , j + π2 ) = A(i + ξ1 , j + ξ2 ) = A(i, j). How we can\ndefine the smallest vectors with this property? What is the\nperiod of the array? and what is a cyclic two-dimensional\narray? These questions will be answered after two necessary\ndefinitions, of tiling and lattices, will be presented.\nB. Tiling\nTiling is one of the most basic concepts in combinatorics.\nWe say that a two-dimensional shape S tiles the twodimensional square grid Z2 if disjoint copies of S cover Z2 .\nThis cover of Z2 with disjoint copies of S is called a tiling\nof Z2 with S. For each shape S, in the tiling, we distinguish\none of the points of S to be the center of S. Each copy of\nS in a tiling has the center in the same related point. The\nset T of centers in a tiling defines the tiling, and hence the\ntiling is denoted by the pair (T , S). Given a tiling (T , S)\nand a grid point (i1 , i2 ) we denote by c(i1 , i2 ) the center\nof the copy of S, S ′ , for which (i1 , i2 ) ∈ S ′ . We will also\nassume that the origin is a center of a copy of S. The first\nlemma given in [4] can be easily verified.\nLemma 1: For a given tiling (T , S) and a point (i1 , i2 )\nthe point (i1 , i2 ) − c(i1 , i2 ) belongs to the shape S whose\ncenter is in the origin.\nC. Lattices and Lattice Tiling\nOne of the most common types of tiling is a lattice\ntiling. A two-dimensional lattice Λ is a discrete, additive\nsubgroup of the real two-dimensional space R2 . W.l.o.g.,\nwe can assume that\nΛ = {u1 v1 + u2 v2 : u1 , u2 ∈ Z}\n\n(1)\n\nwhere v1 , v2 are two linearly independent vectors in R2 . A\nlattice Λ defined by (1) is a sublattice of Z2 if and only if\n\n{v1 , v2 } ⊂ Z2 . We will be interested solely in sublattices of\nZ2 . The vectors v1 , v2 are called basis for Λ ⊆ Z2 , and the\n2 × 2 matrix\n\u0015\n\u0014\nv11 v12\nG=\nv21 v22\nhaving these vectors as its rows is said to be the generator\nmatrix for Λ. Note, that it is always possible to use a generator matrix G in which all the four entries are nonzeroes. It\nis also always possible to have in G exactly one zero entry.\nThe volume of a lattice Λ, denoted V (Λ), is inversely\nproportional to the number of lattice points per unit volume.\nMore precisely, V (Λ) may be defined as the volume of the\nfundamental parallelogram Π(Λ) in R2 , which is given by\ndef\n\nΠ(Λ) = {ξ1 v1 + ξ2 v2 : 0 ≤ ξi < 1, , i = 1, 2}\nThere is a simple expression for the volume of Λ, namely,\nV (Λ) = | det G|.\nWe say that Λ induces a lattice tiling of S if the lattice\npoints can be taken as the set T to form a tiling (T , S).\nD. Cyclic Arrays and Periods\nWe are now in a position to define the period of a\ndoubly periodic array and to define cyclic two-dimensional\narrays. Let A be a doubly periodic two-dimensional array.\nLet (π1 , π2 ) and (ξ1 , ξ2 ) two linearly independent vectors\nsuch that each i, j ∈ Z satisfy A(i + π1 , j + π2 ) =\nA(i+ξ1 , j +ξ2 ) = A(i, j). Let s be the volume of the lattice\nformed from (π1 , π2 ) and (ξ1 , ξ2 ). Let (π3 , π4 ) and (ξ3 , ξ4 )\nbe two linearly independent vectors for which, each i, j ∈ Z\nsatisfy A(i + π3 , j + π4 ) = A(i + ξ3 , j + ξ4 ) = A(i, j). Let\ns′ be the volume of the lattice formed from (π3 , π4 ) and\n(ξ3 , ξ4 ). If s′ ≥ s for each such pair of linearly independent\nvectors then we say that {(π1 , π2 ), (ξ1 , ξ2 )} is the period\nof A and s is the volume of A. The period in the onedimensional case has the role of the period and the volume\nin the two-dimensional case.\nClearly, the period of a two-dimensional array is not\nunique. The volume of the array is unique and can be\ncalculated from the given period. We have a theorem in the\ntwo-dimensional case which is akin to Theorem 2.\nTheorem 3: Let A be a doubly periodic array with period\n{(π1 , π2 ), (ξ1 , ξ2 )}. Let (π3 , π4 ) and (ξ3 , ξ4 ) be two linearly\nindependent vectors for which, each i, j ∈ Z satisfy A(i +\nπ3 , j + π4 ) = A(i + ξ3 , j + ξ4 ) = A(i, j). Let s′ be the\nvolume of the lattice formed from (π3 , π4 ) and (ξ3 , ξ4 ). If s\nis the volume of the lattice formed from (π1 , π2 ) and (ξ1 , ξ2 )\nthen s divides s′ .\nA shape S will be called cyclic if there is a lattice tiling Λ\nfor S. In a cyclic sequence the order of the elements, in the\nsequence, is obvious. It is less obvious for a two-dimensional\nshape. We will discuss this order in Section IV.\nIII. T WO -D IMENSIONAL S YNCHRONIZATION A RRAYS\nSeveral types of two-dimensional synchronization arrays\nare defined in the literature. We start we a general definition\nwhich was given in [3], [5]. Let S be a given shape, on\nthe square grid, with m dots on grid points. S is called\n\n\f\u0001\na distinct difference configuration (DDC) if the m\nlines\n2\nconnecting dots are distinct either in their length or in\ntheir slope. Several types of DDCs were defined in the\nliterature. The main focus of research which was done on\nthis topic is related to Costas arrays. A Costas array is an\nm×m permutation array having exactly one dot in each row\nand each column. Some results on Costas arrays are given\nin [12], [13], [19], [20], [21].\nWe now present a definition for a doubly periodic DDC.\nA doubly periodic S-DDC is a doubly periodic twodimensional array A with period {(π1 , π2 ), (ξ1 , ξ2 )} such\nthat the following three properties are satisfied.\n• The lattice formed by (π1 , π2 ) and (ξ1 , ξ2 ) is a lattice\ntiling for S.\n• Each copy of S on the two-dimensional arrays A is a\nDDC.\n• In each two copies of S in the tiling, the positions of\nthe dots are the same.\nDoubly periodic DDCs and in particular Costas array were\nconsidered in the past, e. g. [4], [22], [23]. There are two\nessential constructions for Costas arrays, both of them form\ndoubly periodic DDCs. The first construction is due to Welch\nand the second Construction is due to Golomb (with a variant\nof Lempel) [12], [13], [19]. We will present both of them\nin their doubly periodic version.\nThe periodic Welch Construction:\nLet α be a primitive root modulo a prime p and let A be\nthe square grid. For any integers i and j, there is a dot in\nA(i, j) if and only if αi ≡ j mod p.\nTheorem 4: Let A be the array of dots from the Periodic\nWelch Construction. Then A is a doubly periodic S-DDC\nwith period {(0, p), (p−1, 0)} and S is a p×(p−1) rectangle.\nThe periodic Golomb Construction:\nLet α and β be two primitive elements in GF(q), where\nq is a prime power. For any integers i and j, there is a dot\nin A(i, j) if and only if αi + β j = 1.\nTheorem 5: Let A be the array of dots from the Periodic\nGolomb Construction. Then A is a doubly periodic S-DDC\nwith period {(0, q −1), (q −1, 0)} and S is a (q −1)×(q −1)\nsquare.\nThere are many important questions concerning Costas\narrays. A few of them are related to the periodicity of the\narrays. In particular we have the following two question:\n1) Is the Welch construction generates all singly periodic\nCostas arrays? where a singly periodic Costas array\nof order n is an n × ∞ array in which each n × n\nsub-array is a Costas array. Welch Construction has\nthis property for n = p − 1.\n2) Are there more constructions for Costas arrays with\nperiodicity property?\nThe conjecture is NO for both questions. Some evidence\nthat this conjecture is true is given in [24]. In fact it should be\nsaid that is very likely that most if not all Costas arrays are\nknown since they derived from the known constructions [25].\nIn what follows we will throw more evidence for the\ndifficulty to produce new doubly periodic S-DDCs with\nmany dots, different from those constructed by folding [4].\n\nCostas arrays are only one family of DDCs, and doubly\nperiodic DDCs. Two other families which were considered\nin the literature, are the sonar sequences [12], [15], [22],\n[26], and the Golomb rectangles [14], [17].\nIV. T HE F OLDING\n\nAND\n\nU NFOLDING M ETHODS\n\nThis section is devoted to with a transformation of\na periodic sequence into a doubly periodic array and a\ntransformation of a doubly periodic array into a periodic\nsequence. The two transformations will be called folding and\nunfolding, respectively, and as one might expect these two\ntransformations are inverse of each other. As a consequence\nof the definition of folding we will be able to define the\norder of the elements in a cyclic shape. We will give the\nknown theorems on the necessary and sufficient conditions\nthat a folding exists. Based on these results we will define\nthe inverse operation of unfolding. This will lead to the\nmain theorem which will state when a doubly periodic twodimensional DDC (or a cyclic DDC) is unfolded into a Sidon\nsequences.\nThe definition of folding involves a lattice tiling (T , S),\nwhere S is the shape on which the folding is performed. A\ndirection is a nonzero integer vector (d1 , d2 ), where d1 , d2 ∈\nZ.\nLet S be a two-dimensional shape and let δ = (d1 , d2 )\nbe a direction. Let Λ be a lattice tiling for a shape S, and\nlet S1 be the copy of S, in the related tiling, which includes\nthe origin. We define recursively a folded-row starting in the\norigin. If the point (i1 , i2 ) is the current point of S1 in the\nfolded-row, then the next point on its folded-row is defined\nas follows:\n• If the point (i1 + d1 , i2 + d2 ) is in S1 then it is the next\npoint on the folded-row.\n• If the point (i1 +d1 , i2 +d2 ) is in S2 6= S1 whose center\nis in the point (c1 , c2 ) then (i1 + d1 − c1 , i2 + d2 − c2 )\nis the next point on the folded-row (by Lemma 1 this\npoint is on S1 ).\nThe definition of folding is based on a lattice Λ, a shape\nS, and a direction δ. The triple (Λ, S, δ) defines a folding\nif the definition yields a folded-row which includes all the\nelements of S. It appears that only Λ and δ determines\nwhether the triple (Λ, S, δ) defines a folding. The role of\nS is only in the order of the elements in the folded-row;\nand of course Λ must define a lattice tiling for S.\nThe first two lemmas proved in [4] are an immediate consequence of the definitions and provide us concise conditions\nwhether the triple (Λ, S, δ) defines a folding.\nLemma 2: Let (T , S) be a lattice tiling defined by the\ntwo-dimensional lattice Λ and let δ = (d1 , d2 ) be a direction.\n(Λ, S, δ) defines a folding if and only if the set {(i * d1 , i *\nd2 ) − c(i * d1 , i * d2 ) : 0 ≤ i < |S|} contains |S| distinct\nelements.\nLemma 3: Let (T , S) be a lattice tiling defined by the\ntwo-dimensional lattice Λ and let δ = (d1 , d2 ) be a direction.\n(Λ, S, δ) defines a folding if and only if (|S| * d1 , S| * d2 ) −\nc(|S| * d1 , |S| * d2 ) = (0, 0) and for each i, 0 < i < |S| we\nhave (i * d1 , i * d2 ) − c(i * d1 , i * d2 ) 6= (0, 0).\n\n\fThe next theorem determine precisely when the triple\n(Λ, S, δ) defines a folding.\nTheorem 6: Let Λ be a lattice whose generator matrix is\ngiven by\n\u0015\n\u0014\nv11 v12\n,\nG=\nv21 v22\nwhere all the entries of G are nonzeroes. Let d1 and d2 be\ntwo positive integers and τ = g.c.d.(d1 , d2 ). If Λ defines a\nlattice tiling for the shape S then the triple (Λ, S, δ) defines\na folding\n•\n\n•\n\n•\n\n•\n\nwith the direction δ = (+d1 , +d2 )\n2 v21 d2 v11 −d1 v12\n,\n) =\nonly if g.c.d.( d1 v22 −d\nτ\nτ\ng.c.d.(τ, |S|) = 1;\nwith the direction δ = (+d1 , −d2 )\n2 v21 d2 v11 +d1 v12\nonly if g.c.d.( d1 v22 +d\n,\n) =\nτ\nτ\ng.c.d.(τ, |S|) = 1;\nwith the direction δ = (+d1 , 0) if and\ng.c.d.(v12 , v22 ) = 1 and g.c.d.(d1 , |S|) = 1;\nwith the direction δ = (0, +d2 ) if and\ng.c.d.(v11 , v21 ) = 1 and g.c.d.(d2 , |S|) = 1.\n\nif and\n1 and\nif and\n1 and\nonly if\nonly if\n\nA direction δ for which (Λ, S, δ) defines a folding also\ndefines the order of the elements in a cyclic shape S. This\norder is exactly the order of the elements in the foldedrow. It is easy to verify that only |S| − 1 directions should\nbe considered for the existence of a folding. The order of\nelements on S is clearly not unique as it was proved in [4]\nthat if one direction defines a folding then φ(|S|) directions\ndefine a folding (and they come in pairs of reverse order),\nwhere φ is the Euler totient function.\nThe unfolding operation is defined directly from the folding operation. Let Λ be a lattice tiling for a two-dimensional\nshape S and a let δ be a direction, for which (Λ, S, δ) defines\na folding. Then the folded-row is the unfolded sequence\ngenerated from the shape S. In the folding, the folded-row\nindicates to which position of the array, each element of\na given one-dimensional sequence will be assigned. In the\nunfolding, the folded-row is actually an unfolded-row and\nit indicates to which position of the sequence, each element\nof the array is assigned. These definitions are completely\nnatural and there is no surprise. What is more interesting\nis the following theorem which connects two-dimensional\ndoubly periodic S-DDCs with Sidon sequences.\nTheorem 7: Let A be a two-dimensional doubly periodic\nS-DDC with period {(π1 , π2 ), (ξ1 , ξ2 )}. Let Λ be the lattice\ntiling of S formed from (π1 , π2 ) and (ξ1 , ξ2 ). If δ is a\ndirection for which (Λ, S, δ) defines a folding then the\nfolded-row generated by the unfolding of S is a Sidon\nSequence.\nProof: We will give a sketch of the proof. A proof with\nall the details will appear in the full version of this work. We\nassign colors to the points of the square grid as follows. The\npoints of the shape S whose center is in the origin (say S0 )\nare assigned colors by the order of the folded-row, where\nthe origin is assigned with a zero. Each other copy of S in\nthe tiling is assigned with the same colors as S0 in the same\nrelated positions.\n\nAssume the contrary, that the folded-row is not a Sidon\nsequence. It follows that there exists two distinct pairs of\nintegers (i1 , i2 ) and (i3 , i4 ), where i1 , i2 , i3 , and i4 , are\npositions with dots on the folded-row, such that i4 − i3 ≡\ni2 − i1 (mod n), where n = |S|. Let Sj , 1 ≤ j ≤ 4, a\ncopy of S on the grid in which a point colored with ij is\nthe center. It can be shown that in one of these four copies\nthe two pair of lines which connects the points colored with\ni1 and i2 ad those colored with i3 and i4 are equal in length\nand slope. A contradiction to the assumption that A is a\ntwo-dimensional doubly periodic S-DDC.\nIn [4] the following theorem was proved.\nTheorem 8: Let Λ be a lattice tiling for a two-dimensional\nshape S, n = |S|, and let δ be a direction. Let B be a Sidon\nsequence with m elements over Zn . If (Λ, S, δ) defines a\nfolding then there exists a two-dimensional doubly periodic\nS-DDC A with m dots in each copy of S of A.\nIn view of Theorems 7 and 8 it is tempting to prove that \"a\nSidon sequence over Zn with m elements exists if and only\nif a two-dimensional doubly periodic S-DDC with m dots in\neach copy of S exists\". But, this claim is not correct. As we\nwill conclude from the following discussion, which applies\nTheorem 7 on the known doubly periodic constructions for\nCostas Arrays.\nExample 1: The following 7 × 6 array was obtained by\nthe periodic Welch Construction for p = 7 and the primitive\nroot 3 modulo 7.\n•\n•\n•\n•\n•\n•\nBy using unfolding with direction (1, 1), where the lower\nleft dot is taken on the origin we obtain the Sidon sequence\n{0, 8, 10, 11, 33, 37} modulo 42.\nRemark 1: A construction such as the periodic Golomb\nConstruction cannot produce any Sidon sequence since the\nshape S is a square and the is no direction which defines a\nfolding when S is a square.\nV. N EW O PTIMAL S IDON S EQUENCES\nThe two celebrating constructions of optimal Sidon sequences are the ones of Singer [27] and Bose [28]. Let q\nbe a power of a prime number. Singer's construction, which\nis based on projective planes, produces a Sidon sequence\nwith q + 1 elements over Zq2 +q+1 . Bose's construction,\nwhich is based on affine planes, produces a Sidon set with\nq elements over Zq2 −1 . The construction of Ruzsa [29]\ngenerates optimal Sidon sequences with p−1 elements taken\nmodulo p2 − p, where p is a prime number. In this section\nwe generalize this construction to obtain a Sidon sequence\nwith q − 1 elements taken over (q − 1)×GF(q), where q\nis any power of a prime. Given a power of a prime q and\na primitive element α in GF(q), we construct the set Aq,α\n\n\fdefined by\ni\n\nAq,α = {(i, α ) : 0 ≤ i ≤ q − 2 }\nTheorem 9: The set Aq,α is an optimal Sidon sequence.\nProof: We have to prove that given four integers i1 ,\ni2 , i3 , and i4 , 0 ≤ i1 , i2 , i3 , i4 ≤ q − 2, such that i1 6= i3\nand i2 6= i3 then the two pairs (i1 + i2 , αi1 + αi2 ) and\n(i3 + i4 , αi3 + αi4 ) are not equal. Assume the contrary, that\nfor four such integers we have\ni1 +i2 ≡ i3 +i4 (mod q −1), αi1 +αi2 = αi3 +αi4 . (2)\nLet t ≡ i1 − i3 ≡ i4 − i2 (mod q − 1), where clearly we can\nassume that 0 < t < q − 1. Hence, we replace (2) with the\nequations\ni1 − i3 ≡ i4 − i2 (mod q − 1), αi1 − αi3 = αi4 − αi2 (3)\nWe can substitute i1 ≡ i3 + t (mod q − 1) and i4 ≡ i2 +\nt (mod q − 1) in (3) to obtain the equation\nαt+i3 − αi3 = αt+i2 − αi2 ,\nwhich is equivalent to the equation\nαi3 (αt − 1) = αi2 (αt − 1) .\n\n(4)\n\nt\n\nSince 0 < t < q − 1, it follows that α − 1 6= 0 and\nhence from (4) we have that αi3 = αi2 , i.e., i3 = i2 which\ncontradicts the original choice of i2 and i3 . Therefore, Aq,α\nis a Sidon sequence. The optimality of the sequence is a\nstraight forward enumeration.\nRemark 2: The new construction of Sidon sequences does\nnot help in constructing new doubly periodic S-DDC since\nthe abelian group is not Zn .\nVI.\n\nCONCLUSIONS AND\n\nF UTURE R ESEARCH\n\nSidon sets have many applications in coding theory and\nin communication problems. Constructions of optimal Sidon\nsequences are rare. We defined periodicity and cyclic arrays in the two-dimensional case. We proved that unfolded\noptimal doubly periodic two-dimensional synchronization\npatterns are optimal Sidon sequences. Thus, forming some\nequivalence between the two structures. All the results\nconcerning two-dimensional arrays are generalized readily\nto higher dimensions. We presented a new construction of\noptimal Sidon sequences, with q − 1 elements, over an\nalphabet with q(q − 1) elements, where q is a power of a\nprime. The main problem for future research in this direction\nis to find new constructions for optimal doubly periodic\nDDCs and new constructions for optimal Sidon sequences.\nACKNOWLEDGMENT\nThis work was supported in part by the United StatesIsrael Binational Science Foundation (BSF), Jerusalem, Israel, under Grant No. 2006097.\nR EFERENCES\n[1] A. E. Brouwer, J. B. Shearer, N. J. A. Sloane, and W. D. Smith, \"A\nnew table of constant weight codes\", IEEE Trans. Inform. Theory,\nvol. 36, pp. 1334–1380, November 1990.\n[2] R. M. Roth and G. Seroussi, \"Location-Correcting Codes\", IEEE\nTrans. Inform. Theory, vol. 42, pp. 554–565, March 1996.\n\n[3] S. R. Blackburn, T. Etzion, K. M. Martin, and M. B. Paterson,\n\"Two-Dimensional Patterns with Distinct Differences – Constructions,\nBounds, and Maximal Anticodes\", IEEE Trans. on Inform. Theory,\nvol. IT-56, pp. 1216-1229, March 2010.\n[4] T. Etzion, \"Sequence folding, lattice tiling, and multidimensional\ncoding\", IEEE Trans. on Inform. Theory, to appear.\n[5] S. R. Blackburn, T. Etzion, K. M. Martin, and M. B. Paterson, \"Distinct difference configurations: multihop paths and key predistribution\nin sensor networks\", IEEE Trans. on Inform. Theory, vol. IT-56, pp.\n3961-3972, August 2010.\n[6] A. Barg and A. Mazumdar, \"Codes in permutations and error correction for rank modulation\", IEEE Trans. on Inform. Theory, vol. IT-56,\npp. 3158–3165, July 2010.\n[7] K. O'Bryant, \"A complete annotated bibliography of work related\nto Sidon sequences\", The Elec. J. of Combin., DS11, pp. 1–39, July\n2004.\n[8] W. C. Babcock, \"Intermodulation interference in radio systems,\" Bull.\nSys. Tech. Journal, pp. 63–73, June 1953.\n[9] G. S. Bloom and S. W. Golomb, \"Applications of numbered undirected\ngraphs\", Proceedings of the IEEE, vol. 65, pp. 562–570, April 1977.\n[10] M. D. Atkinson, N. Santoro, and J. Urrutia, \"Integer sets with distinct\nsums and differences and carrier frequency assignments for nonlinear\nrepeaters\", IEEE Transactions on Communications, vol. COM-34,\npp. 614–617, 1986.\n[11] A. W. Lam and D. V. Sarwate, \"On optimum time-hopping patterns\",\nIEEE Transactions on Communications, vol. COM-36, pp. 380–382,\n1988.\n[12] S. W. Golomb and H. Taylor, \"Two-dimensional synchronization patterns for minimum ambiguity\", IEEE Trans. Inform. Theory, vol. IT28, pp. 600–604, 1982.\n[13] S. W. Golomb and H. Taylor, \"Constructions and properties of Costas\narrays\", Proceedings of the IEEE, vol. 72, pp. 1143–1163, 1984.\n[14] J. P. Robinson, \"Golomb rectangles\", IEEE Trans. Inform. Theory,\nvol. IT-31, pp. 781–787, 1985.\n[15] R. A. Games, \"An algebraic construction of sonar sequences using Msequences\", SIAM Journal on Algebraic and Discrete Methods, vol. 8,\npp. 753–761, October 1987.\n[16] A. Blokhuis and H. J. Tiersma, \"Bounds for the size of radar arrays\",\nIEEE Trans. Inform. Theory, vol. IT-34, pp. 164–167, January 1988.\n[17] J. P. Robinson, \"Golomb rectangles as folded ruler\", IEEE Trans.\nInform. Theory, vol. IT-43, pp. 290–293, 1997.\n[18] S. R. Blackburn, T. Etzion, K. M. Martin, and M. B. Paterson, \"Efficient key predistribution for grid-based wireless sensor networks,\"\nLecture Notes in Computer Science, vol. 5155, pp. 54–69, August\n2008.\n[19] R. A. Games, \"Algebraic constructions for Costas arrays\", Journal\nCombinatorial Theory, Ser. A, vol. 37, pp. 13–21, 1984.\n[20] K. Drakakis, \"A review of Costas arrays\", J. Appl. Math., vol. ???,\npp. 1–32, 2006.\n[21] S. W. Golomb and G. Gong, \"The status of Costas arrays\", IEEE\nTrans. Inform. Theory, vol. 53, pp. 4260–4265, November 2007.\n[22] O. Moreno, S. W. Golomb, and C. Corrada, \"Extended sonar\nsequences\", IEEE Trans. Inform. Theory, vol. 43, pp. 1999–2005,\nNovember 1997.\n[23] O. Moreno and S. Golomb, \"A new optimal double periodical\nconstruction of one target two-dimensional arrays\", 40th Annual\nConference on Information Sciences and Systems, pp. 518–522, March\n2006.\n[24] T. Etzion, S. W. Golomb, and H. Taylor, \"Tuscan-k squares\", Advances in Applied Mathematics, vol. 10, pp. 164–174, 1989.\n[25] K. Drakakis, F. Iorio, and S. Rickard \"The enumeration of Costas\narrays of order 28\", Information Theory Workshop, Dublin, September\n2010.\n[26] P. Erdős, R. Graham, I. Z. Ruzsa, and H. Taylor, \"Bounds for arrays of\ndots with distinct slopes or lengths\", Combinatorica, vol. 12, pp. 39–\n44, 1992.\n[27] J. Singer, \"A theorem in finite projective geometry and some applications to number theory\", Trans. Amer. Math. Soc., vol. 43, pp.\n377-385, 1938.\n[28] R. C. Bose, \"An affine analogue of Singer's theorem\", J. Indian Math.\nSoc. (N.S.), vol. 6, pp. 1-15, 1942.\n[29] I. Z. Ruzsa \"Solving a linear equation in a set of integers\", Acta Arith.,\nvol. 65, pp. 259–282, 1993.\n\n\f"}