{"id": "http://arxiv.org/abs/0710.0262v2", "guidislink": true, "updated": "2007-11-02T03:41:04Z", "updated_parsed": [2007, 11, 2, 3, 41, 4, 4, 306, 0], "published": "2007-10-01T11:11:43Z", "published_parsed": [2007, 10, 1, 11, 11, 43, 0, 274, 0], "title": "Incomplete Lineage Sorting: Consistent Phylogeny Estimation From\n  Multiple Loci", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0710.4566%2C0710.4619%2C0710.0222%2C0710.5104%2C0710.0090%2C0710.0505%2C0710.5018%2C0710.5165%2C0710.1862%2C0710.2753%2C0710.3092%2C0710.4083%2C0710.0287%2C0710.4620%2C0710.2144%2C0710.0582%2C0710.0358%2C0710.3670%2C0710.0369%2C0710.4482%2C0710.5824%2C0710.4336%2C0710.1180%2C0710.1743%2C0710.3502%2C0710.2882%2C0710.4388%2C0710.5497%2C0710.1749%2C0710.1769%2C0710.5270%2C0710.0877%2C0710.1149%2C0710.4933%2C0710.3564%2C0710.4818%2C0710.4165%2C0710.0332%2C0710.4225%2C0710.2792%2C0710.1382%2C0710.5606%2C0710.5520%2C0710.3901%2C0710.4780%2C0710.2043%2C0710.2831%2C0710.2883%2C0710.4404%2C0710.3317%2C0710.4686%2C0710.2597%2C0710.3336%2C0710.4485%2C0710.0687%2C0710.0888%2C0710.1614%2C0710.0533%2C0710.3210%2C0710.3118%2C0710.0943%2C0710.3130%2C0710.0775%2C0710.5649%2C0710.3357%2C0710.5685%2C0710.2870%2C0710.1748%2C0710.5854%2C0710.1764%2C0710.0683%2C0710.0884%2C0710.3927%2C0710.5040%2C0710.3384%2C0710.4599%2C0710.5054%2C0710.2175%2C0710.0123%2C0710.3701%2C0710.0262%2C0710.3353%2C0710.3436%2C0710.2111%2C0710.4980%2C0710.4760%2C0710.3191%2C0710.4118%2C0710.5414%2C0710.1226%2C0710.1601%2C0710.4048%2C0710.5446%2C0710.0217%2C0710.3727%2C0710.0485%2C0710.2409%2C0710.2822%2C0710.0763%2C0710.5160%2C0710.5207&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Incomplete Lineage Sorting: Consistent Phylogeny Estimation From\n  Multiple Loci"}, "summary": "We introduce a simple algorithm for reconstructing phylogenies from multiple\ngene trees in the presence of incomplete lineage sorting, that is, when the\ntopology of the gene trees may differ from that of the species tree. We show\nthat our technique is statistically consistent under standard stochastic\nassumptions, that is, it returns the correct tree given sufficiently many\nunlinked loci. We also show that it can tolerate moderate estimation errors.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0710.4566%2C0710.4619%2C0710.0222%2C0710.5104%2C0710.0090%2C0710.0505%2C0710.5018%2C0710.5165%2C0710.1862%2C0710.2753%2C0710.3092%2C0710.4083%2C0710.0287%2C0710.4620%2C0710.2144%2C0710.0582%2C0710.0358%2C0710.3670%2C0710.0369%2C0710.4482%2C0710.5824%2C0710.4336%2C0710.1180%2C0710.1743%2C0710.3502%2C0710.2882%2C0710.4388%2C0710.5497%2C0710.1749%2C0710.1769%2C0710.5270%2C0710.0877%2C0710.1149%2C0710.4933%2C0710.3564%2C0710.4818%2C0710.4165%2C0710.0332%2C0710.4225%2C0710.2792%2C0710.1382%2C0710.5606%2C0710.5520%2C0710.3901%2C0710.4780%2C0710.2043%2C0710.2831%2C0710.2883%2C0710.4404%2C0710.3317%2C0710.4686%2C0710.2597%2C0710.3336%2C0710.4485%2C0710.0687%2C0710.0888%2C0710.1614%2C0710.0533%2C0710.3210%2C0710.3118%2C0710.0943%2C0710.3130%2C0710.0775%2C0710.5649%2C0710.3357%2C0710.5685%2C0710.2870%2C0710.1748%2C0710.5854%2C0710.1764%2C0710.0683%2C0710.0884%2C0710.3927%2C0710.5040%2C0710.3384%2C0710.4599%2C0710.5054%2C0710.2175%2C0710.0123%2C0710.3701%2C0710.0262%2C0710.3353%2C0710.3436%2C0710.2111%2C0710.4980%2C0710.4760%2C0710.3191%2C0710.4118%2C0710.5414%2C0710.1226%2C0710.1601%2C0710.4048%2C0710.5446%2C0710.0217%2C0710.3727%2C0710.0485%2C0710.2409%2C0710.2822%2C0710.0763%2C0710.5160%2C0710.5207&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We introduce a simple algorithm for reconstructing phylogenies from multiple\ngene trees in the presence of incomplete lineage sorting, that is, when the\ntopology of the gene trees may differ from that of the species tree. We show\nthat our technique is statistically consistent under standard stochastic\nassumptions, that is, it returns the correct tree given sufficiently many\nunlinked loci. We also show that it can tolerate moderate estimation errors."}, "authors": ["Elchanan Mossel", "Sebastien Roch"], "author_detail": {"name": "Sebastien Roch"}, "author": "Sebastien Roch", "arxiv_comment": "Added a section on more general distance-based methods", "links": [{"href": "http://arxiv.org/abs/0710.0262v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0710.0262v2", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "q-bio.PE", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "q-bio.PE", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "cs.CE", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "cs.DS", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "math.PR", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "math.ST", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "stat.TH", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0710.0262v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0710.0262v2", "journal_reference": null, "doi": null, "fulltext": "Incomplete Lineage Sorting: Consistent Phylogeny\nEstimation From Multiple Loci∗\n\narXiv:0710.0262v2 [q-bio.PE] 2 Nov 2007\n\nElchanan Mossel\nDepartment of Statistics\nUniversity of California, Berkeley\nmossel@stat.berkeley.edu\n\nSebastien Roch\nTheory Group\nMicrosoft Research\nSebastien.Roch@microsoft.com\n\nMay 31, 2018\n\nAbstract\nWe introduce a simple algorithm for reconstructing phylogenies from\nmultiple gene trees in the presence of incomplete lineage sorting, that is,\nwhen the topology of the gene trees may differ from that of the species tree.\nWe show that our technique is statistically consistent under standard stochastic assumptions, that is, it returns the correct tree given sufficiently many\nunlinked loci. We also show that it can tolerate moderate estimation errors.\n\n1\n\nIntroduction\n\nPhylogenies-the evolutionary relationships of a group of species-are typically\ninferred from estimated genealogical histories of one or several genes (or gene\ntrees) [Fel04, SS03]. Yet it is well known that such gene trees may provide misleading information about the phylogeny (or species tree) containing them. Indeed, it was observed early on that a gene tree may be topologically inconsistent\nwith its species tree, a phenomenon known as incomplete lineage sorting. See\ne.g. [Mad97, Nic01, Fel04] and references therein. Such discordance plays little\nrole in the reconstruction of deep phylogenetic branchings but it is critical in the\nstudy of recently diverged populations [LP02, HM03, Kno04].\nTwo common approaches to deal with this issue are concatenation and majority\nvoting. In the former, one concatenates the sequences originating from several\n∗\n\nKeywords: incomplete lineage sorting, gene tree, species tree, coalescent, topological concordance, statistical consistency. E.M. is supported by an Alfred Sloan fellowship in Mathematics and\nby NSF grants DMS-0528488, and DMS-0548249 (CAREER) and by ONR grant N0014-07-1-0506.\n\n1\n\n\fgenes and hopes that a tree inferred from the combined data will produce a better\nestimate. This approach appears to give poor results [KD07]. Alternatively, one\ncan infer multiple gene trees and output the most common reconstruction (that is,\ntake a majority vote). This is also often doomed to failure. Indeed, a recent, striking\nresult of Degnan and Rosenberg [DR06] shows that, under appropriate conditions,\nthe most likely gene tree may be inconsistent with the species tree; and this situation\nmay arise on any topology with at least 5 species. See also [PN88, Tak89] for\nrelated results.\nOther techniques are being explored that attempt to address incomplete lineage\nsorting, notably Bayesian [ELP07] and likelihood [SR07] methods. However the\nproblem is still far from being solved as discussed in [MK06]. Here we propose a\nsimple technique-which we call Global LAteSt Split or GLASS-for estimating\nspecies trees from multiple genes (or loci). Our technique develops some of the\nideas of Takahata [Tak89] and Rosenberg [Ros02] who studied the properties of\ngene trees in terms of the corresponding species tree. In our main result, we show\nthat GLASS is statistically consistent, that is, it always returns the correct topology\ngiven sufficiently many (unlinked) genes-thereby avoiding the pitfalls highlighted\nin [DR06]. We also obtain explicit convergence rates under a standard model based\non Kingman's coalescent [Kin82]. Moreover, we allow the use of several alleles\nfrom each population and we show how our technique leads to an extension of\nRosenberg's topological concordance [Ros02] to multiple loci.\nWe note the recent results of Steel and Rodrigo [SR07] who showed that Maximum Likelihood (ML) is statistically consistent under slightly different assumptions. An advantage of GLASS over likelihood (and Bayesian) methods is its computational efficiency, as no efficient algorithm for finding ML trees is known. Furthermore, GLASS gives explicit convergence rates-useful in assessing the quality\nof the reconstruction.\nFor more background on phylogenetic inference and coalescent theory, see\ne.g. [Fel04, SS03, HSW05, Nor01, Tav04].\nOrganization. The rest of the paper is organized as follows. We begin in Section 2 with a description of the basic setup. The GLASS method is introduced in\nSection 3. A proof of its consistency can be found in Sections 4 and 5. We show\nin Section 6 that GLASS remains consistent under moderate estimation errors. Finally in Section 7 we do away with the molecular clock assumption and we show\nhow our technique can be used in conjunction with any distance matrix method.\n\n2\n\n\f2\n\nBasic Setup\n\nWe introduce our basic modelling assumptions. See e.g. [DR06].\nSpecies tree. Consider n isolated populations with a common evolutionary history given by the species tree S = (V, E) with leaf set L. Note that |L| = n. For\neach branch e of S, we denote:\n• Ne , the (haploid) population size on e (we assume that the population size\nremains constant along the branch);\n• te , the number of generations encountered on e;\n• τe =\n\nte\n2Ne ,\n\nthe length of e in standard coalescent time units;\n\n• μ = mine τe , the shortest branch length in S.\nThe model does not allow migration between contemporaneous populations. Often\nin the literature, the population sizes {Ne }e∈E , are taken to be equal to a constant\nN . Our results are valid in a more general setting.\nGene trees. We consider k loci I. For each population l and each locus i, we\n(i)\nsample a set of alleles Ml . Each locus i ∈ I has a genealogical history repre(i)\nsented by a gene tree G (i) = (V (i) , E (i) ) with leaf set L(i) = ∪l Ml . For two\n(i)\nleaves a, b in G (i) , we let Dab be the time in number of generations to the most recent common ancestor of a and b in G (i) . Following [Tak89, Ros02] we are actually\ninterested in interspecific coalescence times. Hence, we define, for all r, s ∈ L,\no\nn\n(i)\n(i)\n(i)\n.\n,\nb\n∈\nM\nDrs\n= min Dab : a ∈ M(i)\nr\ns\nInference problem. We seek to solve the following inference problem. We are\ngiven k gene trees as above, including accurate estimates of the coalescence times\n\u001a\u0010\n\u001b\n\u0011\n(i)\nDab\n.\n(i)\na,b∈L\n\nOur goal is to infer the species tree S.\n\n3\n\ni∈I\n\n\fStochastic Model. In Section 4, we will first state the correcteness of our inference algorithm in terms of a combinatorial property of the gene trees. In Section 5,\nwe will then show that under the following standard stochastic assumptions, this\nproperty holds for a moderate number of genes.\nNamely, we will assume that each gene tree G (i) is distributed according to a\nstandard coalescent process: looking backwards in time, in each branch any two\nalleles coalesce at exponential rate 1 independently of all other pairs; whenever\ntwo populations merge in the species tree, we also merge the allele sets of the\ncorresponding populations (that is, the coalescence proceeds on the union of both\nallele sets). We further assume that the k loci I are unlinked or in other words that\nthe gene trees {G (i) }i∈I are mutually independent.\nUnder these assumptions, an inference algorithm is said to be statistically consistent if the probability of returning an incorrect reconstruction goes to 0 as k\ntends to +∞.\n\n3\n\nSpecies Tree Estimation\n\nWe introduce a technique which we call the Global LAteSt Split (GLASS) method.\nInference method. Consider first the case of a single gene (k = 1). Looking\nbackwards in time, the first speciation occurs at some time T1 , say between popu(1)\nlations r1 and s1 . It is well known that, for any sample a from Mr1 and b from\n(1)\n(1)\nMs1 , the coalescence time Dab between alleles a and b overestimates the divergence time of the populations. As noted in [Tak89], a better estimate of T1 can be\nobtained by taking the smallest interspecific coalescence time between alleles in\n(1)\n(1)\n(1)\nMr1 and in Ms1 , that is, by considering instead Dr1 s1 .\nThe inference then proceeds as follows. First, cluster the two populations, say\n(1)\nr1 and s1 , with smallest interspecific coalescence time Dr1 s1 . Define the coalescence time of two clusters A, B ⊆ L as the minimum interspecific coalescence\ntime between populations in A and in B, that is,\nn\no\n(1)\n(1)\n: r ∈ A, s ∈ B .\nDAB = min Drs\nThen, repeat as above until there is only one cluster left. This is essentially the\nalgorithm proposed by Rosenberg [Ros02]. In particular, Rosenberg calls the implied topology on the populations so obtained the collapsed gene tree.\nHow to extend this algorithm to k > 1? As we discussed earlier, one could infer\na gene tree as above for each locus and take a majority vote-but this approach\nfails [DR06]; in particular, it is generally not statistically consistent.\n4\n\n\fAnother natural idea is to get a \"better\" estimate of coalescence times by averaging across loci. This leads to the Shallowest Divergence Clustering method of\nMaddison and Knowles [MK06]. We argue that a better choice is, instead, to take\nthe minimum across loci. In other words, we apply the clustering algorithm above\nto the quantity\no\nn\n(i)\nDAB = min DAB : i ∈ I ,\nfor all A, B ⊆ L with A ∩ B = ∅. The reason we consider the minimum is similar\nto the case of one locus and several samples per population above: it suffices to\n(i)\n(i)\nhave one pair a ∈ Mr , b ∈ Ms (for some i) with coalescence time T across\nall pairs of samples in populations r and s (one from each) and all loci in I to\nprovide indisputable evidence that the corresponding species branch before time T\n(looking backwards in time). In a sense, we build the \"minimal\" tree on L that is\n\"consistent\" with the evidence provided by the gene trees. This type of approach\nis briefly discussed by Takahata [Tak89] in the simple case of three populations\n(where the issues raised by [DR06] do not arise).\nThe algorithm, which we name GLASS, is detailed in Figure 1. We call the\ntree so obtained the glass tree. We show in the next section that GLASS is in fact\nstatistically consistent.\nAlgorithm GLASS\n(i)\nInput: Gene trees {G (i) }i∈I and coalescence times Dab for all i ∈ I and a, b ∈ L(i) ;\n′\nOutput: Estimated topology S ;\n• [Intercluster coalescences] For all A, B ⊆ L with A ∩ B = ∅, compute\nn\no\n(i)\n(i)\n;\nDAB = min Dab : i ∈ I, r ∈ A, s ∈ B, a ∈ M(i)\nr , b ∈ Ms\n• [Clustering] Set Q := {{r} : r ∈ L}; Until |Q| = 1:\n– Denote the current partition Q = {A1 , . . . , Az };\n– Let A′ , A′′ minimize DAB over all pairs A, B ∈ Q (break ties arbitrarily);\n– Merge A′ and A′′ in Q;\n• [Output] Return the topology implied by the steps above.\n\nFigure 1: Algorithm GLASS.\n\nMultilocus concordance. A gene tree with one sample per population is said to\nbe concordant (sometimes also \"congruent\" or \"consistent\") with a species tree if\n\n5\n\n\ftheir (leaf-labelled) topologies agree. When the number of samples per population is larger than one, one cannot directly compare the topology of the gene tree\nwith that of the species tree since they contain a different number of leaves. Instead, Rosenberg [Ros02] defines a gene tree to be topologically concordant with\na species tree if the collapsed gene tree (see above) coincides with the species tree.\nWe extend Rosenberg's definition to multiple loci. We say that a collection\nof gene trees {G (i) }i∈I is multilocus concordant with a species tree S if the glass\ntree agrees with the species tree. Therefore, to prove that GLASS is statistically\nconsistent, it suffices to show that the probability of multilocus concordance goes\nto 1 as the number of loci goes to +∞.\n\n4\n\nSufficient Conditions\n\nIn this section, we state a simple combinatorial condition guaranteeing that GLASS\nreturns the correct species tree. Our condition is an extension of Takahata's condition in the case of a single gene [Tak89]. See also [Ros02].\nAs before, let S be a species tree and {G (i) }i∈I a collection of gene trees. For a\nsubset of leaves A ⊆ L, denote by hAi the most recent common ancestor (MRCA)\nof A in S. For a (internal or leaf) node v in S, we use the following notation:\n• ⌊v⌋ are the descendants of v in L;\n• tv is the time elapsed in number of generations between v and ⌊v⌋;\n• tv is the time elapsed in number of generations between the immediate ancestor of v and ⌊v⌋.\nIn particular, note that if e is the branch immediately above v, then we have\nte = tv − tv .\nAlso, we call the subtree below v, clade v.\nOur combinatorial condition can be stated as follows:\n(⋆)\n\n∀u, v ∈ V, th⌊u⌋∪⌊v⌋i ≤ D⌊u⌋⌊v⌋ < th⌊u⌋∪⌊v⌋i .\n\nIn words, for any two clades u, v, there is at least one locus i and one pair of\nalleles a, b with a from clade u and b from clade v such that the lineages of a\nand b coalesce before the end of the branch above the MRCA of u and v. (The\nfirst inequality is clear by construction.) By the next proposition, condition (⋆)\nis sufficient for multilocus concordance. Note, however, that it is not necessary.\nNevertheless note that, by design, GLASS always returns a tree, even when the\ncondition is not satisfied.\n6\n\n\fProposition 1 (Sufficient Condition) Assume that (⋆) is satisfied. Then, GLASS\nreturns the correct species tree. In other words, the gene trees {G (i) }i∈I are multilocus concordant with the species tree S.\nProof: Let Q be one of the partitions obtained by GLASS along its execution and\nlet B be the newly created set in Q. We claim that, under (⋆), it must be the case\nthat\nB = ⌊hBi⌋.\n(1)\nThat is, B is the set of leaves of a clade in the species tree S. The proposition\nfollows immediately from this claim.\nWe prove the claim by induction on the execution time of the algorithm. Property (1) is trivially true initially. Assume the claim holds up to time T and let Q,\nas above, be the partition at time T + 1. Note that B is obtained by merging two\nsets B ′ and B ′′ forming a partition of B. By induction, B ′ and B ′′ satisfy (1).\nNow, suppose by contradiction that B does not satisfy (1). Let hBiւ and hBiց\nbe the clades immediately below hBi with corresponding leaf sets C ′ = ⌊hBiւ ⌋\nand C ′′ = ⌊hBiց ⌋. By our induction hypothesis, each of B ′ and B ′′ must be contained in one of C ′ or C ′′ . Say B ′ ⊆ C ′ and B ′′ ⊆ C ′′ without loss of generality.\nMoreover, since B does not satisfy (1), one of the inclusions is strict, say B ′ ⊂ C ′ .\nBut by (⋆), any set X in Q containing an element of C ′ − B ′ has\nDB ′ X < thB ′ ∪Xi ≤ thBiւ = thBi = thB ′ ∪B ′′ i ≤ DB ′ B ′′ .\n\n(2)\n\nTo justify the first two inequalities above, note that X is contained in the partition\nat time T and therefore satisfies (1). In particular, by construction\nB ′ ∪ X ⊆ C ′.\nHence by (2), GLASS would not have merged B ′ and B ′′ , a contradiction. \u0004\n\n5\n\nStatistical Consistency\n\nIn this section, we prove the consistency of GLASS.\nConsistency. We prove the following consistency result. Note that the theorem\nholds for any species tree-including the \"anomaly zone\" of Degnan and Rosenberg [DR06].\nProposition 2 (Consistency) GLASS is statistically consistent.\n\n7\n\n\fProof: Throughout the proof, time runs backwards as is conventional in coalescent theory. We use Proposition 1 and give a lower bound on the probability that\ncondition (⋆) is satisfied.\nConsider first the case of one locus and one sample per population. By (⋆),\nthe reconstruction is correct if every time two populations meet, the corresponding alleles coalesce before the end of the branch immediately above. By classical\ncoalescent calculations (e.g. [Tav84]), this happens with probability at least\n(1 − e−μ )n−1 ,\nwhere we used the fact that there are n − 1 divergences.\nNow consider the general case. Imagine running the coalescent processes of all\nloci simultaneously. Consider any branching between two populations. In every\ngene tree separately, if several alleles emerge on either sides of the branching,\nchoose arbitrarily one allele from each side. The probability that the chosen allele\npairs fail to coalesce before the end of the branch above in all loci is at most e−kμ\nby independence. Indeed, irrespective of everything else going on, two alleles meet\nat exponential rate 1 (conditionally on the past). This finally gives a probability of\nsuccess of at least\n(1 − e−kμ )n−1 .\nFor n and μ fixed, we get\n(1 − e−kμ )n−1 → 1,\nas k → +∞, as desired. \u0004\nRates.\n\nImplicit in the proof of Proposition 2 is the following convergence rate.\n\nProposition 3 (Rate) It holds that\nP[ Multilocus Discordance ] ≤ (n − 1)[e−μ ]k .\nIn particular, for any ε > 0, taking\nk=\n\n1\nln\nμ\n\n\u0012\n\nn−1\nε\n\n\u0013\n\n,\n\nwe get\nP[ Multilocus Discordance ] ≤ ε.\nProof: Note that\n1 − (1 − e−kμ )n−1 ≤ (n − 1)[e−μ ]k .\n\u0004\n8\n\n\fMultiple alleles v. multiple loci. It is interesting to compare the relative effects\nof adding more alleles or more loci on the accuracy of the reconstruction. The\nresult in Proposition 3 does not address this question. In fact, it is hard to obtain\nuseful analytic expressions for small numbers of genes and alleles. However, the\nasymptotic behavior is quite clear. Indeed, as was pointed out in [Ros02] (see\nalso [MK06] for empirical evidence), the benefit of adding more alleles eventually\nwears out. This is because the probability of observing any given number of alleles\nat the top of a branch is uniformly bounded in the number alleles existing at the\nbottom. More precisely, we have the following result which is to be contrasted\nwith Proposition 3.\nProposition 4 (Multiple Alleles: Saturation Effect) Let S be any species tree on\nn populations. Then, there is a 0 < q ∗ < 1 (depending only on S) such that for\nany number of loci k > 0 and any number of alleles sampled per population, we\nhave\nP[ Multilocus Discordance ] ≥ (q ∗ )k > 0.\nIn particular, for a fixed number of loci k > 0, as the number of alleles per populaiton goes to +∞, the probability that GLASS correctly reconstructs S remains\nbounded away from 1.\nProof: Take any three populations a, b, c from S. Assume that a and b meet T1\ngenerations back and that c joins them T2 generations later. For w = a, b, c and\n(i)\ni ∈ I, let Yw be the event that in locus i there is only one allele remaining at the\ntop of the branch immediately above w. Let Z (i) be the event that the topology of\ngene tree i restricted to {a, b, c} is topologically discordant with S. It follows from\nbound (6.5) in [Tav84] that there is 0 < q ′ < 1 independent of h such that\nP[Yw(i) ] ≥ q ′ ,\nfor all i ∈ I and w ∈ {a, b, c}. Also, it is clear that there is 0 < q ′′ < 1 depending\non T2 such that\nP[Z (i) | Yw(i) , ∀w ∈ {a, b, c}] ≥ q ′′ ,\nfor all i ∈ I. Therefore, by independence of the loci, we have\nP[ Multilocus Discordance ]\nY\n≥\nP[Z (i) | Yw(i) , ∀w ∈ {a, b, c}]\ni∈I\n\n′ 3 ′′ k\n\n≥ ((q ) q ) .\nTake q ∗ = (q ′ )3 q ′′ . That concludes the proof. \u0004\n9\n\nY\n\nw∈{a,b,c}\n\nP[Yw(i) ]\n\n\f6\n\nTolerance to Estimation Error\n\nThe results of the previous section are somewhat unrealistic in that they assume\nthat GLASS is given exact estimates of coalescence times. In this section, we relax\nthis assumption.\nAssume that the input to the algorithm is now a set of estimated coalescence\ntimes\n\u001a\u0010\n\u001b\n\u0011\n(i)\nb\nDab\n,\n(i)\na,b∈L\n\ni∈I\n\nand, for all A, B ⊆ L, let\no\nn\n(i)\nbAB = min D\nb (i) : i ∈ I, r ∈ A, s ∈ B, a ∈ M(i)\n,\nD\n,\nb\n∈\nM\nr\ns\nab\n\nbe the corresponding estimated intercluster coalescence times computed by GLASS.\nAssume further that there is a δ > 0 such that\nb (i) − D (i) ≤ δ,\nD\nab\nab\n\nfor all i ∈ I and a, b ∈ L(i) . In particular, note that\nbAB − DAB ≤ δ,\nD\n\nfor all A, B ⊆ L.\nLet m be the shortest branch length in number of generations, that is,\nm = min{te : e ∈ E}.\nWe extend our combinatorial condition (⋆) to\n(ˆ\n⋆) ∀u, v ∈ V, th⌊u⌋∪⌊v⌋i ≤ D⌊u⌋⌊v⌋ < th⌊u⌋∪⌊v⌋i − 2δ.\nThen, we get the following.\nProposition 5 (Sufficient Condition:Noisy Case) Assume that\nδ<\n\nm\n,\n2\n\nand that (ˆ\n⋆) is satisfied. Then, GLASS returns the correct species tree.\n\n10\n\n(3)\n\n\fProof: The proof follows immediately from the argument in Proposition 1 by noting that equation (2) becomes\nbB ′ X\nD\n\n≤ DB ′ X + δ\n< thB ′ ∪Xi − δ\n≤ thB ′ ∪B ′′ i − δ\n≤ DB ′ B ′′ − δ\nbB ′ B ′′ .\n≤ D\n\nCondition (3) ensures that (ˆ\n⋆) is satisfiable. \u0004\nMoreover, we have immediately:\n\nProposition 6 (Consistency & Rate: Noisy Case) Assume that\nδ<\n\nm\n.\n2\n\nThen GLASS is statistically consistent. Moreover, let\nΛ=\n\nm − 2δ\n,\nm\n\nthen it holds that\nP[ Incorrect Reconstruction ] ≤ (n − 1)[e−μΛ ]k .\nIn particular, for any ε > 0, taking\n1\nln\nk=\nμΛ\n\n\u0012\n\nn−1\nε\n\n\u0013\n\n,\n\nwe get\nP[ Incorrect Reconstruction ] ≤ ε.\n\n7\n\nGeneralization\n\nThe basic observation underlying our approach is that distances between populations may be estimated correctly using the minimum divergence time among all\nindividuals and all genes.\nActually, this observation may be used in conjunction with any distance-based\nreconstruction algorithm. (See e.g. [Fel04, SS03] for background on distance matrix methods.) This can be done under very general assumptions as we discuss\n11\n\n\fnext. First, we do away with the molecular clock assumption. Indeed, it turns out\n(i)\nthat Dab need not be the divergence time between a and b for gene i. Instead, we\n(i)\ntake Dab to be the molecular distance between a and b in gene i, that is, the time\nelapsed from the divergence point to a and b integrated against the rate of mutation.\nWe require that the rate of mutation be the same for all genes and all individuals\nin the same branch of the species tree, but we allow rates to differ across branches.\nb etc. are given in terms of this molecular\nBelow, all quantities of the type D, D\ndistance.\nFor any two clusters A, B ⊆ L, we define\no\nn\nbAB = min D\nb (i) : i ∈ I, r ∈ A, s ∈ B, a ∈ M(i) , b ∈ M(i) ,\nD\n(4)\ns\nr\nab\nas before. Let\n\nm′ = min{te ρe : e ∈ E},\nwhere ρe is the rate of mutation on branch e. It is easy to generalize condition\n(ˆ\n⋆) so that we can use (4) to estimate all molecular distances between pairs of\npopulations up to an additive error of, say, m′ /4. Then using standard four-point\nmethods, we can reconstruct the species tree correctly.\nNote furthermore that by the results of [ESSW99], it suffices in fact to estimate\ndistances between pairs of populations that are \"sufficiently close.\" We can derive\nconsistency conditions which guarantee the reconstruction of the correct species\ntree in that case as well.\n\nReferences\n[DR06]\n\nJ. H. Degnan and N. A. Rosenberg. Discordance of species trees with\ntheir most likely gene trees. PLoS Genetics, 2(5), May 2006.\n\n[ELP07]\n\nScott V. Edwards, Liang Liu, and Dennis K. Pearl. High-resolution\nspecies trees without concatenation. Proceedings of the National\nAcademy of Sciences, 104(14):5936–5941, 2007.\n\n[ESSW99] P. L. Erdös, M. A. Steel;, L. A. Székely, and T. A. Warnow. A few\nlogs suffice to build (almost) all trees (part 1). Random Struct. Algor.,\n14(2):153–184, 1999.\n[Fel04]\n\nJ. Felsenstein. Inferring Phylogenies. Sinauer, New York, New York,\n2004.\n\n12\n\n\f[HM03]\n\nJ. Hey and C. A. Machado. The study of structured populations–new\nhope for a difficult and divided science. Nat. Rev. Genet., 4(7):535–\n543, July 2003.\n\n[HSW05] Jotun Hein, Mikkel H. Schierup, and Carsten Wiuf. Gene Genealogies,\nVariation and Evolution : A Primer in Coalescent Theory. Oxford\nUniversity Press, USA, February 2005.\n[KD07]\n\nL. S. Kubatko and J. H. Degnan. Inconsistency of phylogenetic estimates from concatenated data under coalescence. Systematic Biology,\n56(1):17–24, February 2007.\n\n[Kin82]\n\nJ. F. C. Kingman. On the genealogy of large populations. J. Appl.\nProbab., (Special Vol. 19A):27–43, 1982. Essays in statistical science.\n\n[Kno04]\n\nL. L. Knowles. The burgeoning field of statistical phylogeography.\nJournal of Evolutionary Biology, 17(1):1–10, 2004.\n\n[LP02]\n\nKnowles L. L. and Maddison W. P. Statistical phylogeography. Mol.\nEcol., 11(12):2623–35, 2002.\n\n[Mad97]\n\nWayne P. Maddison. Gene trees in species trees. Systematic Biology,\n46(3):523–536, 1997.\n\n[MK06]\n\nWayne Maddison and L. Knowles. Inferring phylogeny despite incomplete lineage sorting. Systematic Biology, 55(1):21–30, February\n2006.\n\n[Nic01]\n\nR Nichols. Gene trees and species trees are not the same. Trends Ecol.\nEvol., 16(7):358–364, July 2001.\n\n[Nor01]\n\nM. Nordborg. Coalescent theory. In D. J. Baldingand M. J. Bishop and\nC. Cannings, editors, Handbook of Statistical Genetics, pages 179–\n212. John Wiley & Sons, Inc., Chichester, U.K., 2001.\n\n[PN88]\n\nP. Pamilo and M. Nei. Relationships between gene trees and species\ntrees. Mol. Biol. Evol., 5(5):568–583, September 1988.\n\n[Ros02]\n\nN. A. Rosenberg. The probability of topological concordance of gene\ntrees and species trees. Theor. Popul. Biol., 61(2):225–247, March\n2002.\n\n[SR07]\n\nM. Steel and Allen Rodrigo. Maximum likelihood supertrees. Preprint,\n2007.\n13\n\n\f[SS03]\n\nC. Semple and M. Steel. Phylogenetics, volume 22 of Mathematics\nand its Applications series. Oxford University Press, 2003.\n\n[Tak89]\n\nN. Takahata. Gene genealogy in three related population: Consistency\nprobability between gene and population trees. Genetics, 122:957–\n966, 1989.\n\n[Tav84]\n\nS. Tavaré. Line-of-descent and genealogical processes, and their applications in population genetics models. Theor. Popul. Biol., 26(2):119–\n164, October 1984.\n\n[Tav04]\n\nSimon Tavaré. Ancestral inference in population genetics. In Lectures\non probability theory and statistics, volume 1837 of Lecture Notes in\nMath., pages 1–188. Springer, Berlin, 2004.\n\n14\n\n\f"}