{"id": "http://arxiv.org/abs/0807.2511v1", "guidislink": true, "updated": "2008-07-16T07:45:32Z", "updated_parsed": [2008, 7, 16, 7, 45, 32, 2, 198, 0], "published": "2008-07-16T07:45:32Z", "published_parsed": [2008, 7, 16, 7, 45, 32, 2, 198, 0], "title": "Primordial massive supernovae as the first molecular factories in the\n  early universe", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0807.4153%2C0807.0519%2C0807.4618%2C0807.3572%2C0807.0158%2C0807.0946%2C0807.2123%2C0807.2389%2C0807.5080%2C0807.1191%2C0807.3731%2C0807.0831%2C0807.3506%2C0807.4271%2C0807.4574%2C0807.2591%2C0807.1128%2C0807.3139%2C0807.1813%2C0807.5037%2C0807.2499%2C0807.0625%2C0807.0722%2C0807.4700%2C0807.2654%2C0807.2408%2C0807.0525%2C0807.4204%2C0807.4906%2C0807.3104%2C0807.3925%2C0807.2133%2C0807.2268%2C0807.1835%2C0807.2796%2C0807.2230%2C0807.4487%2C0807.0559%2C0807.1424%2C0807.0227%2C0807.3940%2C0807.0342%2C0807.3727%2C0807.4510%2C0807.1144%2C0807.2185%2C0807.0574%2C0807.1486%2C0807.2958%2C0807.1136%2C0807.3039%2C0807.4859%2C0807.0683%2C0807.0269%2C0807.4419%2C0807.3267%2C0807.0567%2C0807.3251%2C0807.3377%2C0807.3682%2C0807.4024%2C0807.2785%2C0807.4152%2C0807.3248%2C0807.2718%2C0807.2415%2C0807.3141%2C0807.3017%2C0807.3376%2C0807.2871%2C0807.3401%2C0807.1102%2C0807.1355%2C0807.0118%2C0807.2516%2C0807.0781%2C0807.3679%2C0807.2278%2C0807.1373%2C0807.4690%2C0807.1289%2C0807.1133%2C0807.1315%2C0807.2260%2C0807.4366%2C0807.4215%2C0807.4845%2C0807.0704%2C0807.1581%2C0807.2178%2C0807.4718%2C0807.4940%2C0807.0843%2C0807.3670%2C0807.2712%2C0807.4589%2C0807.4283%2C0807.2890%2C0807.2511%2C0807.2873%2C0807.1149&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Primordial massive supernovae as the first molecular factories in the\n  early universe"}, "summary": "We study the ejecta chemistry of a zero-metallicity progenitor, massive,\nsupernova using a novel approach based on chemical kinetics. Species considered\nspan the range of simple, di-atomic molecules such as CO or SiO to more complex\nspecies involved in dust nucleation processes. We describe their formation from\nthe gas phase including all possible relevant chemical processes and apply it\nto the ejecta of a primordial 170 Msun supernova. Two ejecta cases are\nexplored: full mixing of the heavy elements, and a stratified ejecta reflecting\nthe progenitor nucleosynthesis. Penetration of hydrogen from the progenitor\nenvelope is considered. We show that molecules form very efficiently in the\nejecta of primordial supernovae whatever the level of mixing and account for 13\nto 34% of the total progenitor mass, equivalent to 21 to 57 Msun of the ejecta\nmaterial in molecular form. The chemical nature of molecules depends on mixing\nof heavy elements and hydrogen in the ejecta. Species produced include O2, CO,\nCO2, SiS, SO, SiO and H2. Consequently, molecules can be used as observational\ntracers of supernova mixing after explosion. We conclude that primordial\nmassive supernovae are the first molecule providers to the early universe.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0807.4153%2C0807.0519%2C0807.4618%2C0807.3572%2C0807.0158%2C0807.0946%2C0807.2123%2C0807.2389%2C0807.5080%2C0807.1191%2C0807.3731%2C0807.0831%2C0807.3506%2C0807.4271%2C0807.4574%2C0807.2591%2C0807.1128%2C0807.3139%2C0807.1813%2C0807.5037%2C0807.2499%2C0807.0625%2C0807.0722%2C0807.4700%2C0807.2654%2C0807.2408%2C0807.0525%2C0807.4204%2C0807.4906%2C0807.3104%2C0807.3925%2C0807.2133%2C0807.2268%2C0807.1835%2C0807.2796%2C0807.2230%2C0807.4487%2C0807.0559%2C0807.1424%2C0807.0227%2C0807.3940%2C0807.0342%2C0807.3727%2C0807.4510%2C0807.1144%2C0807.2185%2C0807.0574%2C0807.1486%2C0807.2958%2C0807.1136%2C0807.3039%2C0807.4859%2C0807.0683%2C0807.0269%2C0807.4419%2C0807.3267%2C0807.0567%2C0807.3251%2C0807.3377%2C0807.3682%2C0807.4024%2C0807.2785%2C0807.4152%2C0807.3248%2C0807.2718%2C0807.2415%2C0807.3141%2C0807.3017%2C0807.3376%2C0807.2871%2C0807.3401%2C0807.1102%2C0807.1355%2C0807.0118%2C0807.2516%2C0807.0781%2C0807.3679%2C0807.2278%2C0807.1373%2C0807.4690%2C0807.1289%2C0807.1133%2C0807.1315%2C0807.2260%2C0807.4366%2C0807.4215%2C0807.4845%2C0807.0704%2C0807.1581%2C0807.2178%2C0807.4718%2C0807.4940%2C0807.0843%2C0807.3670%2C0807.2712%2C0807.4589%2C0807.4283%2C0807.2890%2C0807.2511%2C0807.2873%2C0807.1149&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We study the ejecta chemistry of a zero-metallicity progenitor, massive,\nsupernova using a novel approach based on chemical kinetics. Species considered\nspan the range of simple, di-atomic molecules such as CO or SiO to more complex\nspecies involved in dust nucleation processes. We describe their formation from\nthe gas phase including all possible relevant chemical processes and apply it\nto the ejecta of a primordial 170 Msun supernova. Two ejecta cases are\nexplored: full mixing of the heavy elements, and a stratified ejecta reflecting\nthe progenitor nucleosynthesis. Penetration of hydrogen from the progenitor\nenvelope is considered. We show that molecules form very efficiently in the\nejecta of primordial supernovae whatever the level of mixing and account for 13\nto 34% of the total progenitor mass, equivalent to 21 to 57 Msun of the ejecta\nmaterial in molecular form. The chemical nature of molecules depends on mixing\nof heavy elements and hydrogen in the ejecta. Species produced include O2, CO,\nCO2, SiS, SO, SiO and H2. Consequently, molecules can be used as observational\ntracers of supernova mixing after explosion. We conclude that primordial\nmassive supernovae are the first molecule providers to the early universe."}, "authors": ["Isabelle Cherchneff", "Simon Lilly"], "author_detail": {"name": "Simon Lilly"}, "author": "Simon Lilly", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1086/591906", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0807.2511v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0807.2511v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "Accepted to the ApJ Letters", "arxiv_primary_category": {"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0807.2511v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0807.2511v1", "journal_reference": "Astrophys.J. 683 (2008) L123-L126", "doi": "10.1086/591906", "fulltext": "Primordial massive supernovae as the first molecular factories in\nthe early universe\nIsabelle Cherchneff & Simon Lilly1,2\n\narXiv:0807.2511v1 [astro-ph] 16 Jul 2008\n\nABSTRACT\nWe study the ejecta chemistry of a zero-metallicity progenitor, massive, supernova using a novel approach based on chemical kinetics. Species considered\nspan the range of simple, di-atomic molecules such as CO or SiO to more complex\nspecies involved in dust nucleation processes. We describe their formation from\nthe gas phase including all possible relevant chemical processes and apply it to\nthe ejecta of a primordial 170 M⊙ supernova. Two ejecta cases are explored:\nfull mixing of the heavy elements, and a stratified ejecta reflecting the progenitor\nnucleosynthesis. Penetration of hydrogen from the progenitor envelope is considered. We show that molecules form very efficiently in the ejecta of primordial\nsupernovae whatever the level of mixing and account for 13 to 34% of the total\nprogenitor mass, equivalent to 21 to 57 M⊙ of the ejecta material in molecular\nform. The chemical nature of molecules depends on mixing of heavy elements\nand hydrogen in the ejecta. Species produced include O2 , CO, CO2 , SiS, SO, SiO\nand H2 . Consequently, molecules can be used as observational tracers of supernova mixing after explosion. We conclude that primordial massive supernovae\nare the first molecule providers to the early universe.\nSubject headings: astrochemistry - supernovae: general - early universe -\nmolecular processes\n\n1.\n\nIntroduction\n\nLarge amounts of dust have been conjectured to explain the reddening of background\nquasars and damped Lyα systems in the early universe (Pettini et al. 1994, Pei & Fall 1995).\nPossible dust makers could be primordial, very massive stars exploding as supernovae, for\n1\n\nIntitut für Astronomie, ETH Hönggerberg, 8093 Zürich, Switzerland.\n\n2\n\nisabelle.cherchneff@phys.ethz.ch, simon.lilly@phys.ethz.ch\n\n\f–2–\nthe time scales at redshifts ≥ 6 imply short stellar evolution times, thus excluding lowmass, evolved stars. Dust formation in such massive objects has been studied (Nosawa et\nal. 2003, Schneider et al. 2004) using a classical nucleation theory and excluding details on\nnucleation processes of dust clusters from the gas phase. However, it is now well accepted\nthat dust forms in other evolved stellar environments under non-equilibirum conditions close\nto those encountered in laboratory dust condensation experiments where chemical kinetics\ncommands dust nucleation from the gas phase (Donn & Nuth 1985, Cherchneff et al. 1992).\nIn supernovae like in other environments, the nucleation will take place via the formation\nof a molecular phase in the ejecta. Detection of CO, SiO and H+\n3 in SN1987A, a corecollapse supernova in the Large Magellanic Cloud (Spyromilio et al. 1988, Roche et al.\n1991, Miller et al. 1992), triggered a few theoretical studies on modeling CO and SiO\nobservations (Petuchowski et al. 1989, Lepp et al. 1990, Liu & Dalgarno 1994, Gearhart\net al. 1999). Those models often used incomplete chemical networks at steady state. No\ncomplete chemical description of a primordial, massive supernova ejecta has been so far\nattempted. We present here the first results of such an endeavor and consider as a surrogate\na primordial massive supernova (hereafter PMSN) with zero-metallicity 170 M⊙ progenitor.\nWe study the formation of chemical species, some of which being dust precursors, in its\nejecta. We show that chemistry is usually not at steady state and fosters the formation of\ncomplex molecules. Up to one third of the ejecta is found to be in molecular form depending\non the level of mixing after explosion.\n\n2.\n\nEjecta physical and chemical model\n\nIn the absence of observational constraints on PMSNe, we base our study on the 170\nM⊙ PISN theoretical explosion model developed by Nozawa et al. (2003). Gas temperature\nT is determined mainly by the explosion energy (= 2×1052 ergs) and by solving the radiative\ntransfer equation taking into account the energy deposition by radioactive elements. We\nchoose the T profile for their 170 M⊙ PISN unmixed case to describe our ejecta temperature\nvariation with time t and fit it with the expression T(Mr , t) = T0 (Mr , t0 ) × (t/t0 )3(1−γ) , where\nMr is the mass coordinate, T0 is the gas temperature at t0 , and γ is a parameter equals to\n1.55 for this specific fit. The ejecta expansion is homologous very early on and the gas density\nvaries with time according to n(Mr , t) = n0 (Mr , t0 ) × (t/t0 )−3 , where n0 is the gas number\ndensity at t0 . We are interested in studying chemistry from t0 = 100 days to t=1000 days\nfor we expect molecules and dust to form at gas temperatures smaller than 4000K. High\ntemperatures thermally destroy molecules at early times whereas the gas parameters have\ntoo low values to foster efficient molecular formation at late times. In SN1987A ejecta, which\nis characterized by lower gas temperatures than those found in the present PMSN model,\n\n\f–3–\nCO, SiO and dust are detected as early as 110, 160, and 450 days, respectively (Catchpole\n& Glass 1987, Wooden et al. 1993). The ejecta velocity is kept constant at 2000 Km s−1 , a\nvalue similar to that derived by Schneider et al. (2004) for a 170 M⊙ progenitor. Values for\nthe ejecta physical parameters are summarized in Table 2.\nSN1987A light curve between 100 and 1000 days after explosion is dominated by the\nradioactive decay energy of 56 Co and is well reproduced if 0.075 M⊙ of 56 Co is assumed\nto be produced over mass cut. γ-rays produced from 56 Co radioactive decay are Comptonscattered, producing fast, energetic electrons, which are one of the dominant destruction\nprocesses to molecules. We assume that similar radioactivity-induced processes take place\nin the ejecta of our PMSN, but choose a 56 Co mass scaled on the 56 Ni mass over mass cut\naccording to the model of Umeda & Nomoto (2002) (M(56 Co) = 3.52 M⊙). The energy\ndeposition by thermalized 56 Co γ-rays is proportional to M(56 Co) and the destruction rate\nby Compton electrons for species i in s−1 is given by (Woosley et al. 1989, Liu & Dalgarno\n1995)\n(1)\nkfast e− (i ) = (3.26 × 10−2 /Wi ) exp(−t/τ56 ) × (1 − exp[−τ0 (t/t0 )−2 ]).\nwhere τ56 , 56 Co decay e-folding time, equals 111.26 days, τ0 = 31.1 at t0 , and Wi is the\nmean energy per ion-pair for species i in eV. We do not consider ultraviolet radiation coming\nfrom γ/X-rays-induced excited atoms as molecules are likely to experience self- or mutualshielding in the ejecta dense clumps (Liu & Dalgarno 1996). The early emergence of γ-rays\nfrom 56 Co decay in SN1987A spectra argues for strong mixing by Rayleigh-Taylor instabilities\nafter explosion (Pinto & Woosley 1988, Kumagai et al. 1988). Such instabilities are to be\nexpected in PMSNe where the explosion energy is far greater, resulting in macroscopic\nand/or microscopic mixing. We thus assume two extreme mixing cases as in Nozawa et\nal. (2003): a fully microscopically-mixed ejecta in which some level of H penetration from\nthe progenitor envelope occurs, and a stratified ejecta retaining the onion-like structure due\nto stellar nucleosynthesis. Chemical composition of the fully-mixed case is that of Umeda\n& Nomoto (2002) for a 170 M⊙ PISN whereas the stratified composition of Nozawa et al.\n(2003) is used for the unmixed case. We subdivide their unmixed, 85 M⊙ helium core into\n4 regions: a 20 M⊙ Si/Fe-rich zone, a 50 M⊙ O/Si/Mg-rich layer, a 10 M⊙ O/C/Mg-rich\nzone and finally a 5 M⊙ H/He/C-rich layer.\nThe chemical network encompasses all chemical processes appropriate to our ejecta gas\nparameters. They include tri-molecular reactions efficient in high density media, bi-molecular\nprocesses like neutral-neutral reactions with/without activation energy, and ion-molecule reactions (formation/destruction and charge exchange reactions). Radiative associations (hereafter RA) are also considered. In total, the system comprises 79 species listed in Table 1 and\nbetween 400 to 500 reactions, depending on the ejecta region under study. We decouple the\ndynamics and the chemistry and integrate 79 stiff, non-linear, coupled, ordinary differential\n\n\f–4–\nequations describing the continuity equation for the chemical species. The chemical network\nis applied to a physical model of SN1987A ejecta to test its relevance to molecular formation.\nThe unmixed chemical composition of Woosley (1988 - see Fig 4) is used and we divide the\n6 M⊙-He core C-rich region into two zones: zone 1 extending from 3.5 to 4 M⊙ and zone 2,\nfrom 4 to 6 M⊙. Figure 1 displays our modeled CO mass compared to CO masses derived\nfrom different fits of the CO first-overtone band in the infrared. The agreement is satisfactory in view of the different assumptions and parameters used to fit the measured spectra\n(i.e., LTE or non-LTE assumption for level populations (Spyromilio et al. 1988, Liu et al.\n1992), cool clump model including CO cooling (Liu & Dalgarno 1995)). Similar agreements\nare found for SiO and H+\n3 and are presented in Cherchneff (2008).\n\n3.\n\nResults and conclusions\n\nMolecular abundances with respect to the total gas number density are displayed in\nFigure 2 for the fully-mixed case. Here, we consider two sub-cases: the extreme case where\nthe entire H envelope is microscopically mixed to the He core (hereafter referred as H-rich\ncase), and a case for which only 1% of the H envelope mixes with the He-core (i.e. H-poor\ncase). In both cases several molecules do form but differences exist among the two situations.\nFor the H-rich case, the dominant ejected species at 1000 days are H2 , O2 , SO, CO2 ,\nand N2 . Their corresponding masses are respectively 19.3 M⊙, 15.3 M⊙, 13.0 M⊙, 8.4 M⊙,\nand 1.0 M⊙, thereby implying a total molecular mass of ∼ 57 M⊙ equivalent to 34% of the\nPMSN progenitor mass. SiO is abundant up to t = 550 days, but is rapidly depleted due to\nsilica/quartz precursor formation. Inspection of Figure 2 shows that, chemically speaking,\nthe steady state assumption does not hold for molecular formation and destruction at t ≤\n1000 days. At early times, the dominant chemical processes at play are neutral-neutral and\nRA reactions. The OH radical is a key species to molecular formation. Destruction occurs\nmainly via He+ attack. For t≥ 600 days, neutral-neutral processes without activation barrier\nand ion-molecule reactions are dominant. As for dust precursors, (SiO2 )2 , a ring precursor\nto silica/quartz nucleation, forms in large amount – 33.3 M⊙, as early as 500 days after\nexplosion, followed by AlO, the gas phase precusor to corumdum (Al2 O3 ) – 0.04 M⊙ at\n530 days, and finally (FeO)2 – 0.001 M⊙ at 750 days. For the H-poor case, the dominant\nmolecular species are SiO - 15.8 M⊙, CO - 4.6 M⊙ and CO2 - 1 M⊙, resulting in a total\nmolecular content of 21.5 M⊙, or 12.6% of the progenitor mass. When H is absent, the\nformation chemistry is powered at early times by RA reactions as opposed to neutral-neutral\nreactions involving OH. The RA forming SiO has a reaction rate 50 times greater than that\nfor O2 formation, resulting in large amounts of SiO compared to O2 . Molecular formation\n\n\f–5–\nby neutral-neutral processes without activation barrier is postponed to later times, as seen\nin Figure 2. A smaller molecular content is thus produced due to lower gas temperature and\ndensity. As for dust, (SiO2 )2 again is the dominant precursor to form at level up to 10.7 M⊙,\nwhile (MgO)2 , AlO and (FeO)2 contents are negligible.\nThe above dust nucleation sequences are different from those of existing classical nucleation studies which rely on condensation temperature analysis for solids (Todini & Ferrrara\n2001, Nozawa et al. 2003, Schneider at al. 2004). Such studies predict the condensation of\ncorundum, forsterite (Mg2 SiO4 ), quartz (SiO2 ), amorphous carbon and magnetite (Fe3 O4 ).\nThe discrepancy resides in the approach used: in the present model, molecules form from\nthe gas simultaneously to dust precursors, thereby depleting some of the available elements\nfrom the gas phase. Dust precursor formation is then commanded by chemical kinetics at\nplay in an altered gas phase whose chemical composition differs drastically from the initial\nelemental composition. The absence of carbon dust precursors in our fully-mixed case illustrates this point. Indeed, carbon is locked up in CO and CO2 despite the inclusion of\nCompton electron destruction reactions (Clayton et al. 1999), and is not available for further\nbuild-up of C-rich molecules and amorphous carbon precursors. Hence chemistry is acting\nas a bottleneck to dust nucleation. If we assume that all gas-phase precursors formed in\nour fully-mixed ejecta are included into dust during condensation, we get an upper limit for\nfreshly formed dust of roughly 33.4 M⊙ in the H-rich case and 10.7 M⊙ in the H-poor case,\nequivalent to ∼ 19% and 6% of the PMSN progenitor mass, respectively. However, such an\nassumption overestimates the dust content as dust condensation efficiencies in pyrolysis or\nflame experiments in the laboratory are usually less than one, with a residual population of\ndust precursors in the gas phase (Jäger et al. 2006). Furthermore, our H-rich case is somehow extreme and the total H envelope mixing with the He core unlikely, though H mixing\nwas observed in SN1987A and should occur in PISNe as well. Nozawa et al. (2003) and\nSchneider et al. (2004) find respectively ∼ 33 M⊙ and ∼ 39 M⊙ of dust for the fully-mixed\nHe core of a 170 M⊙ progenitor mass PISN and similar ejecta thermodynamics than that\nin the present study. These results are to be compared to the 10.7 M⊙ upper limit derived\nfor our H-poor case. Our two mixed cases highlight trends in dust formation scenarios and\ncontent in PMSNe and our limits for freshly formed dust are a few % of the progenitor mass\nonly. This is certainly lower than existing predicted dust amounts.\nFor the unmixed ejecta, molecules and their derived mass are listed in Table 2. Again,\nmolecules do form efficiently and account for ∼ 42 M⊙, equivalent to 25% of the PMSN\nprogenitor mass. Their chemical nature now traces their location in the He core and the\namount of H mixing from the progenitor envelope. In Zone 1, devoid of oxygen, SiS forms\nfrom reaction between atomic Si and S2 and traces a Si/S-rich gas. In Zone 4, we allowed for\n18 % of total mass hydrogen penetration in the C/He–rich layer as in Nosawa et al. (2003),\n\n\f–6–\nwith subsequent formation of H2 , C2 H2 , and CO. Carbon monoxide is preferably formed\nover CO2 in this layer as CO2 is rapidly destroyed by reactions with ions like C+ and He+ to\nre-form CO. Thus, CO presence in the ejecta indicates a C/O ratio greater than 1, a large\nfree carbon atom content, and some mixing with He and H. This result is supported by the\nsimultaneous detection of CO and amorphous carbon dust in SN1987A, implying carbon-rich\ninhomogeneities in the ejecta. In Zone 2, CO2 dominates over CO, because of the rapid CO\nconversion to CO2 via reaction with O2 , which is very abundant in those regions where the\nC/O ratio is less than 1. CO2 is thus a tracer of oxygen-rich ejecta regions whereas the\nmolecular composition of Zone 4 is typical of a C/H/He-rich environment. Similar chemical\nprocesses and species are encountered in the inner shocked winds of O-rich and C-rich,\nevolved low-mass stars, where the gas parameters resemble those of SN ejecta (Cherchneff\n2006). As for dust molecular precursors, we find that Zone 1 produces ∼ 1.6 M⊙ of (Si)4 and\n∼ 1.3 M⊙ of (FeS)2 , while Zone 2 produces 3 M⊙ of (SiO2 )3 . No dust precursors are formed\nin Zone 3, and Zone 4 produces 0.5 M⊙ of C3 . Again, grain types and nucleation sequences\nare different from the study of Nosawa et al. (2003). An upper limit to dust production in\nthe unmixed case is ∼ 6.5 M⊙ or ∼ 3.8% of the total PMSN progenitor mass, which is much\nless than the value of ∼ 18 % derived by Nozawa et al. for their 170 M⊙ PISN unmixed case.\nThis points again to the crucial role of chemical kinetics as bottleneck to dust formation.\nChemically speaking, we notice that Zone 4 forms carbon dust precursors via pure carbon\nchains like C3 despite the large quantities of C2 H2 available and the aromatic formation\nreactions included in our chemical network. Aromatic chemical pathways to carbon dust are\ninhibited even in the presence of hydrogen because of the high temperatures encountered in\nthe ejecta up to 600 days after explosion, and the competitive RA pathways to carbon chains\ncombined to large amounts of free C atoms. This result may be specific to supernova ejecta\nand is supported by the non-detection of polycyclic aromatic hydrocarbon infrared emission\nlines in SN1987A spectra (Wooden et al. 1993).\nWe conclude that Pop III, massive supernovae are efficient molecule providers to the\nearly universe, with 13% to 34% of their ejecta in molecular form, corresponding to 22\nM⊙ to 57 M⊙ of molecular material released to the local, pristine gas after explosion. Formed\nspecies depend on mixing in the ejecta and include O2 , CO2 , SO, CO, SiS, OH, C2 H2 and H2 .\nH mixing boosts molecular formation at early times via neutral-neutral processes, resulting\nin a large molecular component in the ejecta. In a more general context, molecules could be\nused as observational tracers of mixing in nearby core-collapse supernovae. The substantial\namounts of molecular material imply some impact on the local gas cooling if cooling time\nscales are comparable to those for the ejecta adiabatic expansion. It was recently shown that\nsome dust grains could survive the passage of the PMSN reverse shock some 104 years after\nexplosion (Nozawa et al. 2007, Bianchi & Schneider 2007). The survival of molecules in\n\n\f–7–\ncool, dense, inhomogeneities passing the reverse shock must then be studied. At later times,\nit is conjectured that Pop. II.5 stars can form in the PMSN dense shell if other cooling\nthan that of H2 is provided (MacKey et al. 2003, Salvaterra et al. 2004). If surviving\nthe reverse shock, our predicted molecules could provide part of the necessary cooling and\ntheir subsequent impact on second generation star formation needs further investigation.\nFinally, under present chemical kinetic conditions, our results show that PMSNe do form\ndust efficiently as the amounts of dust precursors produced are significant. However, the\npresent study points to lower dust contents formed in PMSNe than those predicted by\nexisting, classical nucleation studies.\nWe are grateful to the anonymous referee for useful suggestions on how to improve the\nmanuscript. IC acknowledges support from a Maria-Heim-Vögtlin Fellowship from the Swiss\nNational Science Fundation.\n\nREFERENCES\nBianchi, S., & Schneider, R. 2007, MNRAS, 378, 973\nCatchpole, R. & Glass, I. 1987, IAU Circ. N0 4457\nCherchneff, I., Barker, J. R., Tielens, A.G.G.M. 1992, ApJ, 401, 269\nCherchneff, I. 2006, A&A, 456, 1001\nCherchneff, I. 2008, A&A, in preparation\nClayton, D.D., Liu, W., Dalgarno, A. 1999, Science, 283, 1290\nDonn, B., & Nuth, J.A. 1985, ApJ, 288, 187\nTodini, P., & Ferrara, A. 2001, MNRAS, 325, 726\nGearhart, R.A., Wheeler, J.C., Swartz, D.A. 1999, ApJ, 510, 944\nKumagai, S., Shigeyama, T., Nomoto, K., Itoh, M., & Nishimura, J. 1988, A&A, 197, L7\nJäger, C et al. 2006, ApJS, 166, 557\nLepp, S., Dalgarno, A., McCray, R. 1990, ApJ, 358, 262\nLiu, W., Dalgarno, A., Lepp, S. 1992, ApJ, 396, 679\n\n\f–8–\nLiu, W. & Dalgarno, A. 1994, ApJ, 438, 789\nLiu, W. & Dalgarno, A. 1995, ApJ, 454, 472\nLiu, W. & Dalgarno, A. 1996, ApJ, 471, 480\nMacKey, J., Bromm, V., & Hernquist, L. 2003, ApJ, 586, 1\nMiller, S., Tennyson, J., Lepp, S., & Dalgarno, A. 1992, Nature, 355, 420\nNozawa, T, Kozasa, T., Umeda, H., Maeda, K., & Nomoto, K. 2003, ApJ, 598, 785\nNozawa, T. et al. 2007, ApJ, 666, 955\nPei, Y.C. & Fall, S.M. 1995, ApJ, 454, 69\nPettini, M., Smith, L.J., Hunstead, R.W., & M., King, D.L. 1994, ApJ, 426, 79\nPetuchowski, S.J., Dwek, E., Allen, J.E., & Nuth III, J.A. 1989, ApJ, 342, 406\nPinto, P.A., & Woosley, S.E. 1988, Nature, 333, 534\nRoche, P.F., Aitken, D.K., & Smith, C.H. 1991, MNRAS, 252, 39\nSalvaterra, R., Ferrara, A., & Schneider, R. 2004, New A, 10, 113\nSchneider, R., Ferrara, A., Salvaterra, R. 2004, MNRAS, 351, 1379\nSyromilio, J., Meikle, W.P.S., Learner, R.C.M., & Allen, D.A. 1988, Nature, 334, 327\nTodini, P., & Ferrara, A. 2001, MNRAS, 325, 726\nUmeda, H., & Nomoto, K. 2002, ApJ, 565, 385\nWooden, D. H et al. 1993, ApJS, 88, 477\nWoosley, S.E 1988, ApJ, 330, 218\nWoosley, S.E., Pinto, P. A., Hartmann, D. 1989, ApJ, 346, 395\n\nThis preprint was prepared with the AAS LATEX macros v5.2.\n\n\f–9–\n\nTable 1. Chemical species included in the 170 M⊙ PMSN ejecta model\nAtoms\nDiatomic species\n\nTri-atomic species\n4-atom species\n≥ 5-atom species\nIons\n\nH\nH2\nCS\nFe2\nH2 O\nSi3\nC2 H 2\nSi2 O4\nH+\nHeH+\n\nHe\nOH\nCN\n\nO\nO2\nSiH\n\nC\nCO\nSiC\n\nSi\nSiO\nSi2\n\nS\nSO\nSiS\n\nMg\nNO\nSiN\n\nFe\nMgO\nSH\n\nAl\nFeO\nN2\n\nAlO\nNH\n\nC2\nMgS\n\nH2 S\nSiO2\nSi2 O2\nSi3 O6\nH−\nC+\n2\n\nHCN\nSO2\nMg2 O2\nC3 H 3\nHe+\nCO+\n\nCH2\nNO2\nMg2 S2\nC4 H 4\nO+\nSiO+\n\nC2 H\nFe3\nFe2 O2\n\nHCO\n\nC3\n\nCO2\n\nOCS\n\nOCN\n\nSiC2\n\nFe2 S2\n\nH2 CC\n\nFe4\n\nSi4\n\nSi+\nSO+\n\nS+\nH 2 O+\n\nMg+\nHCO+\n\nFe+\n\nAl+\n\nH+\n2\n\nH+\n3\n\n\f– 10 –\n\nTable 2. 170 M⊙ PMSN ejecta parameters versus time after explosion.\nTime (days)\n\nTemperature (K)\n\nNumber density (cm−3 )\n\n100\n200\n400\n600\n800\n1000\n\n21000\n6640\n2130\n1090\n677\n470\n\n6.50 ×1011\n8.00 ×1010\n1.02 ×1010\n3.01 ×109\n1.26 ×109\n6.50 ×108\n\n\f– 11 –\n\nTable 3. Molecules excluding dust precursors in the unmixed ejecta of a 170 M⊙ PMSN\n\nZone 1\n(20 M⊙)\nZone 2\n(50 M⊙)\nZone 3\n(10 M⊙)\nZone 4\n(5 M⊙)\nTotal\n\nSpecies\n\nMass (M⊙)\n\nSiS\nS2\nO2\nSO\nCO2\nCO\nCO2\nSiO\nCO\nC2 H 2\nH2\n\n11.60\n1.48×10−4\n20.53\n1.05\n1.74×10−3\n4.28\n0.43\n0.11\n3.45\n0.43\n0.15\n42.03\n\n\f– 12 –\n\nCO mass (M sun)\n\n1,E-02\n\n1,E-03\n\n1,E-04\n\n1,E-05\n100 150 200 250 300 350 400 450 500 550 600\n\nTime (days)\n\nFig. 1.- Predicted CO mass in SN1987A as a function of time compared to CO mass derived\nfrom observations. Dotted line: zone 1 (see text for explanation), continuous grey line: zone\n2, continuous grey-crossed line: C-rich region of our unmixed model (zone 1+ zone 2), filled\ntriangle: data from Spyromilio et al. 1989, filled circle: data from Liu et al. 1992 - LTE\nassumption, filled diamond: data from Liu et al. 1992 - non-LTE assumption, open square:\ndata from Liu & Dalgarno 1995 - low T clump.\n\n\f– 13 –\n\n1,E+00\n\nH2\n\n1,E-01\nO2\n\n1,E-02\n1,E-03\n\nOH\n\n1,E-04\nN2\n\n1,E-05\n\nSO\nCO\n\n1,E-06\n1,E-07\n\nCO2\n\nH2O\n\nAbundance/n(gas)\n\nAbundance/n(gas)\n\n1,E+00\n\n1,E-01\n\nSiO\n\n1,E-02\n\nCO\n\n1,E-03\n\nCO2\nH2\n\n1,E-04\nN2\n\n1,E-05\n\nO2\n\n1,E-06\nSO\n\n1,E-07\n\nSiO\n\n1,E-08\n\nOH\n\n1,E-08\n100\n\n200\n\n300\n\n400\n\n500\n\n600\n\n700\n\nTime (days)\n\n800\n\n900\n\n1000\n\n100\n\n200\n\n300\n\n400\n\n500\n\n600\n\n700\n\n800\n\n900\n\n1000\n\nTime (days)\n\nFig. 2.- Molecular abundances with respect to total gas number density as a function of\ntime after explosion for the fully-mixed 170 M⊙ PMSN case of Umeda & Nomoto (2002).\nLeft) The total H envelope is fully mixed to the He core. Right) Only 1% of the H envelope\nis mixed to the He core.\n\n\f"}