{"id": "http://arxiv.org/abs/1109.2747v1", "guidislink": true, "updated": "2011-09-13T11:03:24Z", "updated_parsed": [2011, 9, 13, 11, 3, 24, 1, 256, 0], "published": "2011-09-13T11:03:24Z", "published_parsed": [2011, 9, 13, 11, 3, 24, 1, 256, 0], "title": "Angular dependenceof the magnetisation AC loss: coated conductors,\n  Roebel cables and double pancake coils", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1109.2833%2C1109.3279%2C1109.0821%2C1109.5792%2C1109.5835%2C1109.4901%2C1109.0271%2C1109.1739%2C1109.5767%2C1109.6545%2C1109.6098%2C1109.0187%2C1109.2747%2C1109.1760%2C1109.6571%2C1109.0509%2C1109.6339%2C1109.1605%2C1109.4134%2C1109.1877%2C1109.5096%2C1109.4371%2C1109.3386%2C1109.3873%2C1109.3305%2C1109.1450%2C1109.1745%2C1109.0404%2C1109.1827%2C1109.1107%2C1109.3827%2C1109.0142%2C1109.3479%2C1109.3889%2C1109.3705%2C1109.0728%2C1109.0153%2C1109.0274%2C1109.1717%2C1109.4293%2C1109.5633%2C1109.0776%2C1109.2968%2C1109.4545%2C1109.2578%2C1109.3576%2C1109.4238%2C1109.1014%2C1109.4800%2C1109.0747%2C1109.1645%2C1109.0926%2C1109.4241%2C1109.4832%2C1109.6149%2C1109.4327%2C1109.3722%2C1109.2202%2C1109.4259%2C1109.2300%2C1109.2366%2C1109.6589%2C1109.5258%2C1109.5187%2C1109.2321%2C1109.0043%2C1109.2000%2C1109.4418%2C1109.0519%2C1109.3662%2C1109.2831%2C1109.2690%2C1109.6174%2C1109.2486%2C1109.0105%2C1109.1464%2C1109.2539%2C1109.6342%2C1109.2248%2C1109.3427%2C1109.1619%2C1109.2897%2C1109.6151%2C1109.5294%2C1109.2883%2C1109.0486%2C1109.2867%2C1109.5888%2C1109.2909%2C1109.0892%2C1109.0325%2C1109.3524%2C1109.6748%2C1109.0184%2C1109.5006%2C1109.0449%2C1109.3768%2C1109.2354%2C1109.0618%2C1109.1279%2C1109.0754&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Angular dependenceof the magnetisation AC loss: coated conductors,\n  Roebel cables and double pancake coils"}, "summary": "The AC loss in ReBCO coated conductors is large in situations when the\nconductors are subjected to a considerable magnetic field, like in rotating\nmachines, transformers and high-field magnets. Roebel cables can reduce the AC\nloss in these cases. However, computer simulations are needed to interpret the\nexperiments, understand the loss mechanisms, reduce the AC loss by optimising\nthe Roebel cable and design the cryogenic system. In this article, we simulate\nand discuss the AC loss due to an applied magnetic field making an arbitrary\nangle with the cable and taking into account a realistic anisotropic field\ndependence of the critical current density. We study the AC loss in the\nsuperconductor parts for the limits of very high coupling currents and\ncompletely uncoupled strands. The simulations for the uncoupled case also\ndescribe a double pancake coil with no transport current. For the simulations,\nwe use two different numerical methods with complementary strengths. This\nserves as a mutual check of the correctness of the simulation results, which\nagree to each other. Opposite than expected, we found that the AC loss does not\nonly depend on the perpendicular component of the applied magnetic field. We\nalso found that the AC loss for applied fields with an orientation below 7\ndegrees with the strands surface is reduced more than one order of magnitude\ncomparing to an untransposed cable. Therefore, we recommend to use Roebel\ncables for windings with important parallel components of the magnetic field,\nsuch as transformers and high-field magnets.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1109.2833%2C1109.3279%2C1109.0821%2C1109.5792%2C1109.5835%2C1109.4901%2C1109.0271%2C1109.1739%2C1109.5767%2C1109.6545%2C1109.6098%2C1109.0187%2C1109.2747%2C1109.1760%2C1109.6571%2C1109.0509%2C1109.6339%2C1109.1605%2C1109.4134%2C1109.1877%2C1109.5096%2C1109.4371%2C1109.3386%2C1109.3873%2C1109.3305%2C1109.1450%2C1109.1745%2C1109.0404%2C1109.1827%2C1109.1107%2C1109.3827%2C1109.0142%2C1109.3479%2C1109.3889%2C1109.3705%2C1109.0728%2C1109.0153%2C1109.0274%2C1109.1717%2C1109.4293%2C1109.5633%2C1109.0776%2C1109.2968%2C1109.4545%2C1109.2578%2C1109.3576%2C1109.4238%2C1109.1014%2C1109.4800%2C1109.0747%2C1109.1645%2C1109.0926%2C1109.4241%2C1109.4832%2C1109.6149%2C1109.4327%2C1109.3722%2C1109.2202%2C1109.4259%2C1109.2300%2C1109.2366%2C1109.6589%2C1109.5258%2C1109.5187%2C1109.2321%2C1109.0043%2C1109.2000%2C1109.4418%2C1109.0519%2C1109.3662%2C1109.2831%2C1109.2690%2C1109.6174%2C1109.2486%2C1109.0105%2C1109.1464%2C1109.2539%2C1109.6342%2C1109.2248%2C1109.3427%2C1109.1619%2C1109.2897%2C1109.6151%2C1109.5294%2C1109.2883%2C1109.0486%2C1109.2867%2C1109.5888%2C1109.2909%2C1109.0892%2C1109.0325%2C1109.3524%2C1109.6748%2C1109.0184%2C1109.5006%2C1109.0449%2C1109.3768%2C1109.2354%2C1109.0618%2C1109.1279%2C1109.0754&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The AC loss in ReBCO coated conductors is large in situations when the\nconductors are subjected to a considerable magnetic field, like in rotating\nmachines, transformers and high-field magnets. Roebel cables can reduce the AC\nloss in these cases. However, computer simulations are needed to interpret the\nexperiments, understand the loss mechanisms, reduce the AC loss by optimising\nthe Roebel cable and design the cryogenic system. In this article, we simulate\nand discuss the AC loss due to an applied magnetic field making an arbitrary\nangle with the cable and taking into account a realistic anisotropic field\ndependence of the critical current density. We study the AC loss in the\nsuperconductor parts for the limits of very high coupling currents and\ncompletely uncoupled strands. The simulations for the uncoupled case also\ndescribe a double pancake coil with no transport current. For the simulations,\nwe use two different numerical methods with complementary strengths. This\nserves as a mutual check of the correctness of the simulation results, which\nagree to each other. Opposite than expected, we found that the AC loss does not\nonly depend on the perpendicular component of the applied magnetic field. We\nalso found that the AC loss for applied fields with an orientation below 7\ndegrees with the strands surface is reduced more than one order of magnitude\ncomparing to an untransposed cable. Therefore, we recommend to use Roebel\ncables for windings with important parallel components of the magnetic field,\nsuch as transformers and high-field magnets."}, "authors": ["Enric Pardo", "Francesco Grilli"], "author_detail": {"name": "Francesco Grilli"}, "author": "Francesco Grilli", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1088/0953-2048/25/1/014008", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1109.2747v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1109.2747v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "28 pages, 11 figures", "arxiv_primary_category": {"term": "cond-mat.supr-con", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.supr-con", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1109.2747v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1109.2747v1", "journal_reference": "E. Pardo and F. Grilli, Supercond. Sci. Technol., vol. 25 (2012)\n  014008", "doi": "10.1088/0953-2048/25/1/014008", "fulltext": "arXiv:1109.2747v1 [cond-mat.supr-con] 13 Sep 2011\n\nAngular dependenceof the\nmagnetisation AC loss:\ncoated conductors, Roebel cables\nand double pancake coils\nEnric Pardo1,∗ and Francesco Grilli2\n1\n\nInstitute of Electrical Engineering, Slovak Academy of Sciences,\nBratislava, Slovakia\n2\nKarlsruhe Institute of Technology, Karlsruhe, Germany\n∗\nenric.pardo@savba.sk\nAbstract\nThe AC loss in ReBCO coated conductors is large in situations when\nthe conductors are subjected to a considerable magnetic field, like in rotating machines, transformers and high-field magnets. Roebel cables can\nreduce the AC loss in these cases. However, computer simulations are\nneeded to interpret the experiments, understand the loss mechanisms, reduce the AC loss by optimising the Roebel cable and design the cryogenic\nsystem. In this article, we simulate and discuss the AC loss due to an applied magnetic field making an arbitrary angle with the cable and taking\ninto account a realistic anisotropic field dependence of the critical current density. We study the AC loss in the superconductor parts for the\nlimits of very high coupling currents and completely uncoupled strands.\nThe simulations for the uncoupled case also describe a double pancake\ncoil with no transport current. For the simulations, we use two different\nnumerical methods with complementary strengths. This serves as a mutual check of the correctness of the simulation results, which agree to each\nother. Opposite than expected, we found that the AC loss does not only\ndepend on the perpendicular component of the applied magnetic field. We\nalso found that the AC loss for applied fields with an orientation below 7\ndegrees with the strands surface is reduced more than one order of magnitude comparing to an untransposed cable. Therefore, we recommend to\nuse Roebel cables for windings with important parallel components of the\nmagnetic field, such as transformers and high-field magnets.\n\n1\n\nIntroduction\n\nReBCO coated conductors present several advantages compared to other superconductors, such as their higher operation temperature (up to the liquid nitrogen\ntemperature) and their good performance in large magnetic fields. Nowadays,\ncoated conductors are produced in long lengths with uniform properties, so they\nare ready to be used in market applications. In particular, power applications\n1\n\n\fare very promising, such as fault-current limiters, cables, rotating machines (including wind generators) and transformers. However, the AC loss in rotating\nmachines and transformers is too high because of two reasons. First, the component of the AC magnetic field perpendicular to the tape is large. Second, these\napplications usually require high-current conductors made of several coated conductors. This results in thick cables with a substantial AC loss contribution\nfrom the parallel AC magnetic field. A similar situation arises in high-field [1]\nor large-scale DC magnets (such as for particle accelerators [2] or fusion). In\nthis case, the it is still desirable to reduce the AC loss because it limits the\nramp rate and generates significant histeresis loss, especially for liquid-helium\ncooled magnets. Roebel cables [3, 4, 5, 6, 7] reduce the ac loss caused by both\ncomponents of an external magnetic field [4, 5, 8]. In spite of the progress in\nRoebel cables, many aspects of their AC loss remain unknown [2]. A similar\nsituation exists for pancake coils, widely used in windings.\nComputer simulations are needed to interpret the experiments, understand\nthe loss mechanisms, reduce the AC loss by optimising the Roebel cable or\npancake coil and design the cryogenic system. However, to the best of our\nknowledge, there are no published simulations for the angular dependence of\nthe magnetisation AC loss in Roebel cables and pancake coils.\nThe published simulations for the angular dependence of the magnetisation\nAC loss are only for a single tape or stacks of tapes. For a single tape, the published results are for a constant critical current density [9], Jc , or an anisotropic\nmagnetic field-dependent Jc [10, 11, 12, 13, 14]. However, the anisotropies and\nfield1 dependences utilized in these articles are not realistic, since they take into\naccount only a generic dependence [11], a dependence extracted from data at\nhigh applied fields (≥0.5 T) [10, 15], or without the correction for the self-field\n[12, 13]. Moreover, [9, 11] neither calculate the complete AC cycle nor the AC\nloss. The work in [14] was for only two angles (90o and 15o ). For stacks, there is\nonly one work for the coupled case (allowing the magnetisation currents to close\nin different tapes) and relatively high applied field amplitudes (50 mT) [13]. In\naddition, all these simulations were done assuming either a simplified anisotropy\nof Jc by an elliptical dependence or assuming an isotropic superconductor. In\ncontrast, actual coated conductors present complex anisotropies [16, 17, 18, 19].\nSimulations on Roebel cables are only for perpendicular applied fields [20, 21]\nor transport currents [20, 21, 22]. For double (or single) pancake coils (or stacks\nof tapes) the magnetisation AC loss of stacks of tapes was simulated only for\nperpendicular applied fields in [23, 24, 20, 25, 21, 26].\nThe only measurements on the angular dependence of the AC loss are in [27].\nHowever, there exists extensive work on coated conductors [28, 29] and stacks\nof them [30, 31, 32]. All these measurements for single tapes and stacks were for\ncoated conductors at an early stage of development, with poor artificial pinning\nand anisotropies approximately elliptical. As a consequence, they may not be\nrepresentative for the present nano-engineered material [16, 17, 18]. For Roebel\ncables there are also measurements for perpendicular applied fields [20, 33, 7, 27],\nparallel ones [34] and transport currents [20, 35].\nIn this article, we simulate and discuss the AC loss due to an applied magnetic field at an arbitrary angle with the cable and we take into account a\n1 In order to avoid unnecessary repetition, we refer to the magnetic field as simply \"field\"\nexcept when the electric and magnetic fields could be confused with each other.\n\n2\n\n\frealistic anisotropic field dependence of the critical current density. We study\nthe AC loss in the superconductor parts for the limits of very high coupling currents (coupled case) and completely uncoupled strands (uncoupled case). The\n2D simulations for the uncoupled case also describe a double pancake coil with\nno transport current. Therefore, the results and discussions for the uncoupled\ncase are also valid for double pancake coils. Additionally, we also discuss the\ndetails of the AC loss in a single tape. For the simulations, we use two different numerical methods with complementary strengths: the Minimum Magnetic\nEnergy Variation (MMEV) and a Finite Element Method (FEM) with the Hformulation and edge elements (see section 2.1). This serves as a mutual check\nof the correctness of the simulation results. Moreover, it is also a check of the\napplicability of the sharp E(J) relation from the critical-state model (E and\nJ are the electric field and the current density, respectively), because MMEV\nassumes this sharp E(J) relation and FEM, a smooth one.\nThis article is structured as follows. In section 2 we outline the simulation\nmodels and the anisotropic field dependence of Jc for the calculations. In section\n3 we present and discuss the results for a single tape and a Roebel cable in the\ncoupled and uncoupled cases. For the Roebel cable, we do not only present the\nAC loss but also the field and current distribution for some cases. Finally, in 4\nwe present our conclusions.\n\n2\n\nModels\n\nIn this section, we first outline both simulation methods, their complementary\nstrengths and some technical details (section 2.1). Afterwards, we detail the\nanisotropic field dependences of Jc in the simulations:\ntwo anisotropic (a\nrealistic one for YBCO and an elliptical one) and one isotropic field dependences\n(section 2.2).\n\n2.1\n\nSimulation methods\n\nIn this article, we use two different numerical methods to obtain the current distribution, the magnetic field and the AC loss, as we did in a previous work [21].\nThese models are the Minimum Magnetic Energy Variation (MMEV) method\nand the Finite Element Method (FEM) with H-formulation and edge elements.\nThe comparison of their results serves as a mutual check of the correctness of the\nmethods, as well as of the assumption of the critical-state model for modelling\nhigh-temperature superconductors.\nThese methods present different strengths. The MMEV method is generally\nfaster than FEM [21]. This is an advantage to calculate situations with many\ntapes, such as windings [36, 37]. Since MMEV is a user-programmed software\n(the program for this article is written in FORTRAN language), it is possible\nto control the processes, make further improvements and include it in larger\nprograms. In addition, it is possible to exploit the vast collection of existing\nfree-source numerical routines in FORTRAN or C++. The FEM model is more\nversatile because it uses a commercial software [38]. In particular, it can simulate non-linear magnetic materials interacting with the superconductor [39] and\nmulti-physics problems, as for example the coupling of electromagnetic and thermal effects [40]. Moreover, in contrast to MMEV, the FEM model can simulate\n\n3\n\n\fover-critical currents because it takes into account a smooth E(J) relation.\nBoth methods are 2D models, reducing the problem to solving the crosssection of the cable. In more detail, they assume that the transposition length\nof the cable is much larger than its thickness and width, so the cable is well\napproximated by a set of infinitely long tapes parallel to each other, as we\ndetailed in [21].\n2.1.1\n\nThe Minimum Magnetic Energy Variation (MMEV) method\n\nThe MMEV method assumes the sharp E(J) relation of the critical-state model,\nwhere E is the electrical field. It is based on a variational principle proposed by\nPrigozhin [41], which finds the current distribution by minimising the magnetic\nenergy variation, and a fast non-standard minimisation routine. This routine\nhas been developed incrementally in several articles. First, Sanchez and Navau\nsolved a cylinder in an applied magnetic field under certain restrictions [42].\nLater on, Pardo et al. developed the general method for tapes under any combination of applied magnetic field and transport current [43]. The latest stage of\nthe method is published in [44, 45, 37], where [44, 45] and [45] take into account\nthe field dependence of Jc and the interaction with linear magnetic materials,\nrespectively. Recently, we applied the method to Roebel cables [20, 21], but\nusing a constant Jc .\n2.1.2\n\nThe Finite Element Method (FEM) model\n\nThe FEM model assumes a smooth E(J) relation, usually a power law E(J) =\nEc (J/Jc )n , where Ec is the voltage-per-length criterion for the critical current\ndensity Jc (usually set equal to 10−4 Vm−1 ) and n is the flux-creep exponent.\nIn this work, we assume that n is constant, neglecting the magnetic field dependence of this parameter. The state variable of the FEM model are the magnetic\nfield components; as a consequence the implementation of the Jc (B) dependence\nis straightforward since the magnetic flux components are immediately available\nfrom the state variables by means of the B = μ0 H relation. More details about\nthe model implementation can be found in [46].\n2.1.3\n\nTape and Roebel cable parameters\n\nThe anisotropic field dependences of Jc for the simulations are detailed in 2.2.\nThese dependences are based on measurements [19] of YBCO coated conductors\nfrom SuperPower, Inc. [47]. The functions for Jc describe the experimental\nanisotropic field dependence with several degrees of approximation: realistic,\nelliptic and isotropic. For all cases, we do not take into account the metal parts\nof the tapes in the calculations, ignoring the effects of eddy currents.\nFor the single tape, the dimensions for the simulations are 4.16 mm for the\nwidth and 1.4 μm for the thickness.\nFor the Roebel cable, we chose the geometry of a cable composed of 14\nstrands, which was manufactured at the Karlsruhe Institute of Technology [20].\nThe strands are 1.98 mm wide, their lateral separation is 200 μm and their vertical separation (i.e. the distance between the superconducting films) is 140 μm.\nThe total critical current of the cable at 77 K (determined with the 1 μV/cm\ncriterion over a distance of 30 cm) is 465 A. In the simulations, the strands\n\n4\n\n\f(from now on we call them \"tapes\") have the following dimensions: width\nw = 1.98 mm and thickness d = 1.4 μm. For the power-law resistivity used\nin the FEM simulations, Ec = 10−4 V/m and n = 35 (except stated otherwise).\nThe frequency of the applied field is 100 Hz.\n2.1.4\n\nCoupled and uncoupled cases\n\nFor the cable simulations, we distinguish between the coupled and uncoupled\ncases. The coupled case assumes that the resistance per transposition length\nbetween the tapes is very small, so the magnetisation current loops can close\nfreely between any tape of the cable. The uncoupled case assumes a very large\nresistance per transposition length between the tapes, so the current loops must\nclose within each tape. From the computation point of view, this means that\nfor the coupled case there is only one current constrain (zero net current in the\nwhole cable), while for the uncoupled one there are as many current constrains\nas tapes (zero net current in each tape).\nA cable made of untransposed tapes corresponds to the coupled case because\nthe tapes are interconnected together at the current leads. Indeed, Polak et\nal. [48] experimentally found that for tape lengths of around 10 cm or above,\ninterconnected tapes in parallel are already fully coupled.\nA double pancake coil exactly corresponds to the uncoupled case. Then, all\nthe results and discussions for the Roebel cable in the uncoupled case are also\nvalid for double pancake coils.\n2.1.5\n\nDiscretisation of the superconducting domain\n\nDue to their high aspect ratio, ReBCO superconductors are often approximated\nas 1-D objects, where the variation of the electromagnetic quantities along the\nthickness is neglected. However, in certain cases, this approximation is not\ncorrect. In particular, if we consider the cases shown in this paper, this happens\nfor two reasons. First, for the uncoupled case (or a single tape) and low angles\nand low fields, the AC loss is dominated by the current penetration across the\nthickness of the tape (figures 8 and 10). Second, for a field-dependent Jc and\nthe uncoupled case (or a single tape), taking only one element in the thickness\n(or a 1D approximation) neglects the influence of the local parallel field on\nJc . This is because the parallel component of the field is anti-symmetric with\nrespect to the mid-plane of the tape, so both its value at the mid-plane and\nits average in the thickness vanish. Taking only one element in the thickness\ninduces significant errors for the uncoupled case and single tapes at applied\nfields below the self-field when Jc is not strongly anisotropic, as is the case of\nReBCO coated conductors.\nThe simulations use the following number of elements. For the coupled case,\nthere are 1 element in the thickness and between 100 and 500 elements in the\nwidth per tape, with larger values for lower applied magnetic fields. For the\nuncoupled case and single tapes, there are between 1 and 20 elements in the\nthickness and 100 and 500 elements in the width. Higher numbers of elements\nin the thickness and the width are for lower applied magnetic fields. For the\nparticular case of 0o (parallel applied field) and the uncoupled situation, we use\n50 elements in the thickness and 10 in the width.\n\n5\n\n\f2.2\n\nAngular and field dependence\n\nIn this article, we study the effect of three different field and angular dependences of the critical current density, Jc (B, θ): isotropic superconductor, elliptical anisotropy and a realistic field and angle dependence. This latter dependence\npresents a peak in both the ab and c directions and contains three different contributions with elliptical anisotropy (figure 2a). In the following sections, we\nstudy the error in the computations as a consequence of choosing a simplistic\nangular dependence, i.e. isotropic superconductor or elliptical anisotropy. In\norder to do so, we assume that the superconductor is perfectly described by the\nrealistic description. Then, we simulate a measurement of the in-field critical\ncurrent for an applied field in the ab and c directions (figure 2b). This is the\ndata available in many experiments. With this data, we extract the parameters\nassuming an elliptical anisotropy. This simplification describes well the critical\ncurrent in the ab and c directions but not for intermediate angles at large applied magnetic fields. If we simplify further, to an isotropic superconductor, we\ncould only expect to fit the critical current at one orientation. Moreover, it is\nnot possible to fit the field dependence at low applied fields and high applied\nfields at the same time because the self-field changes the orientation of the local\nmagnetic field. In this article we choose to take the parameters that fit the\ncritical current at high applied fields in the ab direction.\n2.2.1\n\nRealistic field and angle dependence\n\nMany ReBCO coated conductor tapes present an angular dependence with a\npeak in the ab and c directions. Reference [19] found that an expression based\non three contributions that describes a coated conductor manufactured by SuperPower, Inc. [47]. Here, we use a simplified version of that field and angle\ndependence of Jc , which reproduces the main features of the experimental critical current in [19].\nJc (B, θ) = max{Jc,ab [Bfab (θ)], Jc,c [Bfc (θ)], Jc,i [Bfi (θ)]}\n\n(1)\n\nwith\nJc,ab (B) =\nJc,c (B) =\nJc,i (B) =\n\nJ0p\n,\n(1 + B/B0ab )β\nJ0p\n,\n(1 + B/B0c )β\nJ0i\n,\n(1 + B/B0i )α\n\n(2)\n(3)\n(4)\n\nand\nfab (θ)\nfc (θ)\nfi (θ)\n\nq\ncos2 θ + u2ab sin2 θ,\nq\n=\nu2c cos2 θ + sin2 θ,\nq\n=\ncos2 θ + u2i sin2 θ.\n=\n\n(5)\n(6)\n(7)\n\nWe take the following values for the parameters: J0p = 4.9 * 1010 A/m2 , J0i =\n3.2 *1010 A/m2 , B0ab = 4.6 mT, B0c = 2.0 mT, B0i = 32 mT, β = 0.48, α = 0.9,\nuab = 8.3, uc = 1.8 and ui = 1.7.\n6\n\n\f2.2.2\n\nElliptical anisotropy\n\nNow, we consider the Blatter's [49] scaling law for the field and angular dependence, also known as elliptical anisotropy:\nJc (B, θ) = Jc,e [Bfe (θ)]\n\n(8)\n\nwith\nJc,e (B) =\nfe (θ)\n\n=\n\nJ0e\n,\n(1 + B/B0e )β\nq\ncos2 θ + u2e sin2 θ.\n\n(9)\n(10)\n\nFor this field and angle dependence we set the parameters in the following way.\nWe take the parameters for which the critical current Ic as a function of the\napplied magnetic field Ba for the elliptical dependence, equations (8)-(10), fits\nthe best to Ic for the realistic dependence, equations (1)-(7), if the applied field\nis in the ab or c directions (see figure 2b). For low applied magnetic fields,\nthe critical current is smaller than the integration of Jc (Ba , θ) over the volume\nbecause the self-field increases the local magnetic field. The parameters for the\nelliptical anisotropy are J0e = 4.602 * 1010 A/m2 , B0e = 4.6mT, ue = 2.015 and\nβ takes the same value as for equations (2) and (3), β = 0.48.\n2.2.3\n\nIsotropic superconductor\n\nFinally, the simplest case is that of an isotropic superconductor, with no angular\ndependence of Jc .\nJ0\n.\n(11)\nJc,iso (B, θ) =\n(1 + B/B0 )β\nFor this field dependence, we take the same parameters as the field dependence\nfor the elliptic case in the ab direction, equation (3): B0 = 4.6mT, J0 = 4.9 *\n1010 A/m2 and β = 0.48 (if we wanted to take the dependence in the c direction,\nthe isotropic field dependence would be with B0 = B0e /ue = 2.283mT).\nWith the isotropic dependence we do not find the parameters that fit the\ncritical current for the realistic dependence. This is because an isotropic critical\ncurrent density cannot describe the in-field critical current of a tape with an\nanisotropic superconductor, not even for a particular orientation.\n\n3\n3.1\n\nResults and discussion\nAC loss for a single tape\n\nIn this section we present and discuss the AC loss in a single tape for an applied\nmagnetic field with several orientations and the three angular dependences of\nsection 2.2 (results in figures 3,4). Actually, we present the loss factor relative to\n2\nthe applied magnetic field amplitude, Q/Bm\n(Q is the loss per cycle and length\nand Bm is the applied field amplitude) or to the component of the applied\n2\nmagnetic field perpendicular to the tape surface, Q/Bper\n.\nThe results from both simulation methods agree (figures 3 and 4). However,\nthere is a small discrepancy at large amplitudes because of the finite flux-creep\n7\n\n\fexponent for the FEM simulations (exponent 35). Indeed, when we increase the\nflux creep exponent to 101, this discrepancy vanishes (figure 3).\nAs expected, the AC loss decreases with decreasing the orientation angle\n[50, 10, 12, 28, 29]. This is because the AC loss in a thin tape is dominated by\nthe perpendicular component of the applied magnetic field and this component\nof the applied magnetic field decreases with decreasing the angle. Moreover,\nwith decreasing the angle, the peak in the loss factor moves to higher applied\nfields because the perpendicular component of the applied field decreases.\nThe shoulder at low applied magnetic fields for low angles (curve for 3o in\nfigures 3 and 4) is because of the current penetration across the thickness [14].\nWhen the perpendicular component of the applied field is low, the AC loss due\nto the parallel component becomes important.\n2\nThe loss factor relative to the perpendicular applied magnetic field, Q/Bper\n,\nis generally not independent on the angle (figure 4), in contrast to the conclusions of earlier work [10, 12, 28, 29, 30, 31, 32]. However, there actually is\nthis angle independence for large and moderate angles (≥30o ). Apart from the\n2\nshoulder at low amplitudes, for low angles (≤15o ) the peak of Q/Bper\nincreases,\nshifts to lower fields and becomes slightly narrower. If we compare 3o with 90o ,\nthe peak for 3o is at around 3 times lower Bper , resulting in around 3 times\nlarger ac loss for Bper close to the peak for 3o . The difference in AC loss is simi2\nlar for large Bper . This angle dependence of Q/Bper\nis caused by the anisotropy\nand field dependence of the critical current density.\nThe results for the isotropic field dependence and the elliptical one reveal\nthe different effects of the anisotropy and the field dependence, as follows.\n2\n, its shift to lower angles and its narrowing\nThe increase of the peak in Q/Bper\nwhen decreasing the angle are due to the field dependence because these effects\nare already present for the isotropic Jc (figure 4c). In particular, the shift\n2\nto lower Bper with decreasing the angle is because of\nof the peak of Q/Bper\nthe following. For the same Bper , lower angles result in higher applied field\nmagnitudes and, consequently, in a lower average Jc in the AC cycle. Then, the\ntape saturates for lower Bper and the loss factor shifts accordingly. The increase\n2\nin the peak of Q/Bper\nand its narrowing is due to the stronger field dependence\nof Jc as a function of Bper for lower Bper [51]. Indeed, the field dependence of\n(11) as a function of Bper is Jc = J0 /(1 + Bper /(B0 | sin θ|))β , resulting in an\neffective field constant B0,eff = B0 | sin θ| which decreases with the angle θ and,\ntherefore, strengthens the field dependence with decreasing the angle.\n2\nAn elliptical anisotropy weakens the angular dependence of Q/Bper\nwith\nrespect to the realistic or isotropic dependence (figure 4b). This is because\nthe angular dependence in Jc of (10) becomes fe (θ) ≈ ue | sin θ| for large enough\nangles θ, resulting in a Bper dependence independent on the angle, Jc = J0e /(1+\nBper ue /B0e )β . The angle range where Jc becomes independent of Bper becomes\nwider for larger anisotropies, that is larger ue . This explains the published angle\n2\nindependence of Q/Bper\nas a function of Bper for Bi2223, with a large anisotropy\n[50].\nThe AC loss for the realistic case presents the main features of the isotropic\ncase regarding the position, height and width of the peak. This is because the\nanisotropy of Jc is not very strong. The main difference from the isotropic case is\n2\nthat the angular dependence of Q/Bper\nloss is smaller, especially for Bper below\nthe peak. This is because for low fields, the realistic Jc approaches an elliptical\n2\ndependence (figure 2a), therefore a weaker angular dependence of Q/Bper\n.\n8\n\n\f3.2\n\nMagnetic field and current distribution in a Roebel\ncable\n\nThe magnetic field distribution for the coupled and uncoupled cases are very\ndifferent (figure 5). For the coupled case, the superconductor shields the applied\nmagnetic field as much as possible in all the cable volume. For the uncoupled\ncase, the superconductor only shields the volume of each tape individually. This\nis in accordance to the published results for perpendicular applied magnetic\nfields [23, 21]. In addition, for the uncoupled case, the superconductor shields\nthe perpendicular component of the applied magnetic field within each stack of\ntapes but not in the gap between the stacks, where it concentrates. As a result,\nthe angle of the magnetic field in this gap increases. Another consequence is that\nthe magnetic field within each stack is parallel to the tape surfaces. Moreover,\nthe magnetic field in between the tapes of the stack is uniform. Actually, this\nis always the case when the magnetic field in the horizontal separation between\ntapes is parallel to their surface [21].\nIn some cases it is not enough to take only one element in the thickness of the\ntape (1D approximation), see section 2.1.5. This is the case for the uncoupled\nsituation and low applied magnetic fields. An example is for an applied magnetic\nfield at 7o and 20 mT of amplitude, figure 8, where the AC loss is dominated\nby the current penetration across the thickness of the tape (figure 10). On\nthe contrary, for an applied field of, for example, 15o and 50 mT of amplitude\n(figure 6), one element in the thickness is sufficient for AC loss and magnetic\nfield calculations. This is because the main AC loss contribution is from the\npenetration across the width of the tape and the average parallel magnetic field\nin the tapes thickness is nonzero.\nAs expected, the current distribution between the coupled and uncoupled\ncases is very different (figures 6 and 8). For the coupled case, the current\npenetrates roughly as in a monoblock. With an oblique applied magnetic field,\nthe current penetrates faster from the top-left and bottom-right corners, figures\n6a and 8a. This is consistent with the calculations for one single tape [9] and the\nfield penetration in figure 5a. For the uncoupled case, the net current in each\ntape is zero with qualitatively similar current penetration in each tape, except in\nthe tapes at the boundaries of the cable (figures 6b and 8b). The only similarity\nbetween the coupled and uncoupled cases is that the current distribution is antisymmetric with respect to the central point of the tape. This is because of the\ngeometry of the cable and the applied magnetic field.\nThe current distribution for the 1D approximation allows an accurate quantitative comparison between the simulation methods (MMEV and FEM), rather\nthan a qualitative comparison between current distributions from colormaps like\nfigures 6 and 8 or the comparison of the AC loss in a logarithmic scale, such\nas in figures 3,4,9 and 10. The simulation methods agree very well, better than\nfor a constant Jc [21]. Moreover, the effect of the smooth E(J) relation for the\nFEM simulations is not very important for low applied field amplitudes [21].\nWith increasing the amplitude, the local electro-motive force due to the applied\nmagnetic field increases, and so does the local electric field and J for a smooth\nE(J) relation. This is indirectly seen in the higher AC loss at high amplitudes\nfor the FEM model (figures 9 and 10).\nThe sheet current density, K, at the peak of the AC cycle presents the\nfollowing features (figure 7). Thanks to the inversion point-symmetry, it is\n9\n\n\fenough to study one half of the cable, for example the leftmost half in figure\n5. For both cases, the sharp peaks in figure 7 correspond to the boundary\nbetween the regions with sheet current density equal and below its critical value\n(Kc = Jc d). This is because at this boundary |K| = Kc and the magnetic\nfield is minimum (it vanishes for the coupled case, while for the uncoupled case\nonly its perpendicular component vanishes). At the region in between the sharp\npeaks and the edge of the tape, |K| becomes Kc . There, |K| decreases toward\nthe edge because the magnetic field increases. For the FEM simulations, the\nkinks and small peaks close to the sharp peaks are not necessarily numerical\nerrors. A superconductor with a smooth E(J) relation presents a retarded\nresponse comparing to the critical-state model [52]. Then, at the peak of the\nAC field, the maximum current penetration is still not fully developed. For the\nuncoupled case, the sheet current density around the mid-width of the tapes\npresents a plateau (figure 7b), as for perpendicular applied fields, transport\ncurrents and pancake coils [21, 36]. The plateau is due to the difference in\nthe local magnetic field at both surfaces of the tape and its height does not\ndepend on Jc , as detailed in [21]. This difference in field appears because of\nthe inhomogeneous field created by the other tapes. Another issue is that the\nsheet current density close to the lowest y-edge of each tape is higher than for\nthe highest y-edge. The reason is that at these places the sheet critical current\ndensity takes the critical value and the magnetic field concentrates at the top-left\nand bottom right corners of each stack of tapes, decreasing Jc . For the coupled\ncase, the maximum sheet current density is higher because the superconductor\nshields better the magnetic field, decreasing the field and increasing Jc . The\nsheet current density in each layer of tapes is qualitatively different. In the first\nlayer (black line in figure 7a), the sheet current density roughly decreases with\nincreasing y because the magnetic field increases (figure 5). In the second layer\n(blue line in figure 7a), there is a double peak in the tape at higher y (a double\npeak for MMEV and single peak for FEM). This is because the magnetic field\nvanishes in the small region in between the peaks.\nWhen the simulations take into account the penetration into the thickness\nof the tape, they show that for the uncoupled case and low angles there is an\nsignificant penetration in the thickness (figure 8b). Actually, for the situation in\nfigure 6b, the tapes are completely penetrated with current of both signs, with\nonly a small difference corresponding to the height of the plateau in figure 7b.\nFor the coupled case, the distance of penetration across the thickness is much\nsmaller than across the width, therefore the description with a sheet current\ndensity is correct in terms of AC loss (note that the actual aspect ratio of the\ntape is 4000). Moreover, the parallel magnetic field keeps the same sign in the\nthickness of the tape and, therefore, its average in the thickness is representative\nfor the average critical current density.\n\n3.3\n\nAC loss for a Roebel cable\n\nAgain, the AC loss calculated from both simulation methods agrees with each\nother (figures 9-11). There is a small discrepancy at high amplitudes or low\nangles and low amplitudes caused by the different physical model of the superconductor (sharp and smooth E(J) relation for MMEV and FEM, respectively).\nThe results for the coupled case describe the situation of untransposed tapes.\nThen, the difference between the AC loss for the coupled and uncoupled cases\n10\n\n\freveals the maximum possible reduction of AC loss by the transposition in a\nRoebel cable. For large applied magnetic fields or low angles, the AC loss for\nthe uncoupled case is lower than for the coupled one (figures 9 and 10)). The\ndecrease by uncoupling the tapes is especially important for low angles, with a\ndecrease up to three orders of magnitude for parallel fields and high amplitudes.\nFor angles below 15o this reduction is still substantial for all the amplitudes.\nAt high applied fields and angles of 7o or lower the loss reduces more than one\norder of magnitude compared to the coupled one.\nThe AC loss for the coupled case presents the following features (figure 9).\nIt decreases with decreasing the angle until it saturates to the value for 0o .\nThis decrease with decreasing the angle is less pronounced than for a single\ntape (figure 3). The reason is that the coupled case behaves as a single block\n[23, 24, 21] and the aspect ratio of the Roebel cable is relatively small, around 5.\nThen, the difference in the penetration length across the thickness and the width\nof the cable is less important than for the tape, resulting in a less pronounced\nangular dependence.\nFor the uncoupled case (figure 10), the AC loss is qualitatively similar to a\nsingle tape (figure 3). However, there are the following differences. First, the\npeak in the loss factor is at higher amplitudes because of the stacking effect\n[23, 21, 24]. Second, the peak (or peak at higher amplitudes) is wider than\nfor a single tape because of the concentration of the perpendicular field in the\ngap between the stacks (figure 5) [23, 21]. Finally, the peak at low applied\nfields and angles, due to the parallel applied field, becomes more visible. This is\nbecause two reasons. First, the peak due to the perpendicular applied field shifts\nto higher amplitudes, so both peaks do not overlap. Second, the contribution\nfrom the parallel field becomes larger than that of the perpendicular one. The\ncause is that the stacking effect reduces the AC loss per volume created by the\nperpendicular field but the loss created by the parallel field remains the same.\nFor 0o , we can compare the simulations with the slab Bean model for a constant\nJc [53, 54] taking Jc as the self-field critical current of the tape divided by its\nvolume. The simulations are consistent with those Bean-model calculations\n(figure 10). The higher and narrower peak of the loss factor for the simulations\nare due to the field dependence of Jc [51]. Then, the Bean model is useful to\ndetermine whether the AC loss due to the parallel field is important, assessing\nthe validity of the 1D approximation at low angles without the need of lengthy\nsimulations with several elements in the thickness.\n2\nThe loss factor relative to the perpendicular applied field Q/Bper\n(figure 11),\ndoes not depend only on Bper , as is the case for a single tape (figure 3). With\ndecreasing the angle, the shift in the peak and its increase (or the peak at high\namplitudes for low angles) is less pronounced than for the single tape. However,\nfor low Bper , the increase of the loss factor due to the parallel component of the\napplied field is more important.\n2\nIn real Roebel cables, the angular dependence of Q/Bper\ncould be larger.\nThis is because there can be misalignment between the tapes, they can be\nslightly deformed (like making a circular arch) or the superconductor layer could\nhave a non-negligible roughness – see for example pictures in [27]. All these\neffects will result in larger contributions of the parallel applied field. In addition,\ncoupling currents will also increase the AC loss from the parallel applied field.\nThe AC loss for low angles will be important for long solenoids, like in\nsome transformers. Therefore, we recommend to characterise the AC loss in\n11\n\n\fRoebel cables and tapes also at low angles of the applied field, therefore avoiding\n2\nthe error committed extrapolating Q/Bper\nfor low angles assuming an angular\n2\nindependence of Q/Bper\n.\n\n4\n\nSummary and conclusions\n\nIn this article, we have presented the main features of the magnetic field, current\ndistribution and AC loss for an applied magnetic field with arbitrary orientation,\nbased on two independent numerical simulations. For the Roebel cable, we have\ntaken into account the coupled and uncoupled cases, corresponding to the limits\nof very high coupling currents and negligible coupling currents, respectively.\nThe simulations for the uncoupled case are also valid for a double pancake coil\nwith no transport current, therefore the results and conclusions for the Roebel\ncable in the uncoupled case are also applicable to double pancake coils. The\nsimulations have taken into account a realistic anisotropic field dependence of\nJc . This dependence is in accordance with Jc measurements within around 20%\nerror. Therefore, the results from the simulations are representative for real\ntapes, in contrast to those from simple dependences, such as the elliptical or\nisotropic ones.\nAbout the two simulation methods in this article, we have seen that all\nthe results agree with each other, serving as a mutual check. In addition, the\nqualitative results for the field and current distributions are well explained by\nmagnetostatic considerations.\nFor both single tapes and Roebel cables in the coupled case, we found that\nthe AC loss does not only depend on the perpendicular component of the applied\nfield, opposite to the published works [10, 12, 28, 29, 30, 31, 32]. For low\nangles between the applied field and the tapes plane and moderate and large\namplitudes, the extrapolated AC loss from purely perpendicular applied fields\nassuming independence of the parallel component of the applied field is around\n3 times lower than the actual one, therefore being this difference not negligible.\nThe discrepancy is even larger for low amplitudes. The AC loss also depends on\nthe parallel component of the applied field for two reasons. First, at low applied\nfields and low angles, the AC loss due to the penetration across the thickness\nis important. Second, because for YBCO the field anisotropy in Jc is relatively\nweak. Then, Jc reduces significantly with increasing the parallel component of\nthe applied field for the same perpendicular component of the applied field.\nFor coupled Roebel cables, the AC loss due to the parallel and perpendicular\ncomponents of the applied field is of the same order of magnitude for all the\namplitudes. This is because of the low aspect ratio of the cable, around 5.\nFinally, we have found that the highest potential of Roebel cables is to\nreduce the AC loss at applied fields with low angles with the tapes surface.\nFor angles of 7o or lower, the Robel cable reduces the AC loss more than one\norder of magnitude, comparing to a cable made of untransposed tapes with the\nsame dimensions. The reduction can be of up to three orders of magnitude for\nperfectly parallel applied fields. This is a much better reduction than the factor\n2 for perpendicular applied fields [20, 21].\nIn conclusion, transposed cables, such as Roebel cables, should be used in\nwindings with an important parallel applied field, such as the low-voltage winding of transformers. For the characterisation of the AC loss of these cables, it\n\n12\n\n\fis necessary to measure also at low angles with the tape surface (≤ 15o ). This\nconsideration is also valid for double (or single) pancake coils to be part of a\nlong solenoid, such as the high-voltage winding of a transformer. As future\nwork, we propose comparison with experiments, the prediction of the influence\nof intermediate coupling currents and the role of striated tapes in the Roebel\ncable.\n\nAcknowledgement\nThis work was supported partly by the Structural Funds of the European Union\nthrough the Agency for the Structural Funds of the European Union from the\nMinistry of Education, Science, Research and Sport of the Slovak Republic\nunder the contract number 26240220028 and partly by a Helmholtz-University\nYoung Investigator Grant (VH-NG-617). F. Grilli would like to thank Bertrand\nDutoit for the use of the computing resources at Ecole Polytechnique Fédérale\nde Lausanne.\n\nReferences\nReferences\n[1] H. W. Weijers, U. P. Trociewitz, W. D. Markiewicz, J. Jiang, D. Myers,\nE. E. Hellstrom, A. Xu, J. Jaroszynski, P. Noyes, Y. Viouchkov, and D. C.\nLarbalestier. High field magnets with HTS conductors. IEEE Transactions\non Applied Superconductivity, 20(3):576–582, 2010.\n[2] M. Turenne, R. P. Johnson, F. Hunte, J. Schwartz, and\nH. Song.\nRoebel cable for high-field low-loss accelerator\nmagnets.\nProceedings of the International Particle Accelerator Conference (IPAC), (MOPEB057), 2010.\nAvailable at\nhttp://accelconf.web.cern.ch/accelconf/IPAC10/papers/mopeb057.pdf.\n[3] W. Goldacker, R. Nast, G. Kotzyba, S. I. Schlachter, A. Frank, B. Ringsdorf, C. Schmidt, and P. Komarek. High current DyBCO-ROEBEL assembled coated conductor (RACC). J. Phys.: Conf. Ser., 43:901, 2006.\n[4] W. Goldacker, A. Frank, A. Kudymow, R. Heller, A. Kling, S. Terzieva, and\nC. Schmidt. Status of high transport current ROEBEL assembled coated\nconductor cables. Superconductor Science and Technology, 22:034003, 2009.\n[5] M. Leghissaa, V. Hussennetherb, and H. W. Neumüller. kA-class highcurrent HTS conductors and windings for large scale applications. Advances\nin Science and Technology, 47:212–219, 2006.\n[6] N. J. Long, R. Badcock, P. Beck, M. Mulholland, N. Ross, M. Staines,\nH. Sun, J. Hamilton, and R. G. Buckley. Narrow strand YBCO Roebel\ncable for lowered AC loss. J. Phys.: Conf. Ser., 97:012280, 2008.\n[7] J. K. Lee, S. Byun, B. W. Han, W. S. Kim, S. Park, S. Choi, C. Park, and\nK. Choi. Reduction effect on magnetization loss in the stacked conductor\n\n13\n\n\fwith striated and transposed YBCO coated conductor. IEEE Transactions\non Applied Superconductivity, 19:3340, 2009.\n[8] Y. Y. Xie, M. Marchevsky, X. Zhang, K. Lenseth, Y. Chen, X. Xiong,\nY. Qiao, A. Rar, B. Gogia, R. Schmidt, A. Knoll, V. Selvamanickam, G. G.\nPethuraja, and P. Dutta. Second-generation hts conductor design and engineering for electrical power applications. IEEE Transactions on Applied\nSuperconductivity, 19(3):3009–3013, 2009.\n[9] G. P. Mikitik, E. H. Brandt, and M. Indenbom. Superconducting strip in\nan oblique magnetic field. Physical Review B, 70:014520, 2004.\n[10] Y. Ichiki and H. Ohsaki. Numerical analysis of AC losses in YBCO coated\nconductor in external magnetic field. Physica C, 412-414:1015–1020, 2004.\n[11] E. H. Brandt and G. P. Mikitik. Anisotropic superconducting strip in an\noblique magnetic field. Physical Review B, 72:024516, 2005.\n[12] N. Enomoto, T. Izumi, and N. Amemiya. Electromagnetic field analysis\nof rectangular superconductor with large aspect ratio in arbitrary orientated magnetic fields. IEEE Transactions on Applied Superconductivity,\n15(2):1574–1577, 2005.\n[13] S. Stavrev, F. Grilli, B. Dutoit, and S. P. Ashworth. Comparison of the AC\nlosses of BSCCO and YBCO conductors by means of numerical analysis.\nSuperconductor Science and Technology, 18(10):1300–1312, 2005.\n[14] F. Gömöry, M. Vojenčiak, E. Pardo, M. Solovyov, and J. Šouc. AC losses\nin coated conductors. Superconductor Science and Technology, 23:034012,\n2010.\n[15] M. Kiuchi, E. S. Otabe, T. Matsushita, T. Kuga, M. Inoue, T. Kiss,\nY. Iijima, K. Kakimoto, and T. Saitoh. Angular dependence of irreversibility field in Y-123 coated tape. Physica C, 392-396:1063–1067, 2003.\n[16] V. Selvamanickam, Y. Chen, J. Xie, Y. Zhang, A. Guevara, I. Kesgin,\nG. Majkic, and M. Martchevsky. Influence of Zr and Ce doping on electromagnetic properties of (Gd,Y)−Ba−Cu−O superconducting tapes fabricated by metal organic chemical vapor deposition. Physica C, 469:2037–\n2043, 2009.\n[17] T. G. Holesinger, B. Maiorov, O. Ugurlu, L. Civale, Y. Chen, X. Xiong,\nY. Xie, and V. Selvamanickam. Microstructural and superconducting properties of high current metal−organic chemical vapor deposition\nYBa2 Cu3 O7−δ coated conductor wires. Superconductor Science and Technology, 22:045025, 2009.\n[18] Y. Zhang, E.D. Specht, C. Cantoni, D.K. Christen, J.R. Thompson, J.W.\nSinclair, A. Goyal, Y.L. Zuev, T. Aytug, M.P. Paranthaman, Y. Chen, and\nV. Selvamanickam. Magnetic field orientation dependence of flux pinning\nin (Gd,Y)Ba2 Cu3 O7−x coated conductor with tilted lattice and nanostructures. Physica C, 469:2044–2051, 2009.\n\n14\n\n\f[19] E. Pardo, M. Vojenčiak, F. Gömöry, and J. Šouc. Low-magnetic-field dependence and anisotropy of the critical current density in coated conductors. Superconductor Science and Technology, 24:065007, 2011.\n[20] S. Terzieva, M. Vojenčiak, E. Pardo, F. Grilli, A. Drechsler, A. Kling,\nA. Kudymow, F. Gömöry, and W. Goldacker. Transport and magnetization\nac losses of ROEBEL assembled coated conductor cables: measurements\nand calculations. Superconductor Science and Technology, 23:014023, 2010.\n[21] F. Grilli and E. Pardo. Simulation of ac loss in roebel coated conductor\ncables. Superconductor Science and Technology, 23:115018, 2010.\n[22] Z. Jiang, K. P. Thakur, M. Staines, R. A. Badcock, N. J. Long, R. G. Buckley, A. D. Caplin, and N. Amemiya. The dependence of ac loss characteristics on the spacing between strands in ybco roebel cables. Superconductor\nScience and Technology, 24:065005, 2011.\n[23] E. Pardo, A. Sanchez, and C. Navau. Magnetic properties of arrays of superconducting strips in a perpendicular field. Physical Review B, 67:104517,\n2003.\n[24] F. Grilli, S. P. Ashworth, and S. Stavrev. Magnetization ac losses of stacks\nof YBCO coated conductors. Physica C, 434:185–190, 2006.\n[25] W. Yuan, A. M. Campbell, and T. A. Coombs. ac losses and field and\ncurrent density distribution during a full cycle of a stack of superconducting\ntapes. Journal of Applied Physics, 107:093909, 2010.\n[26] L. Prigozhin and V. Sokolovsky. Computing ac losses in stacks of hightemperature superconducting tapes. Superconductor Science and Technology, 24:075012, 2011.\n[27] S. Terzieva, M. Vojenčiak, F. Grilli, R. Nast, J. Šouc, W. Goldacker,\nA. Jung, A. Kudymow, and A. Kling. Investigation of the effect of striated\nstrands on the AC losses of 2G Roebel cables. Superconductor Science and\nTechnology, 24:045001, 2011.\n[28] N. Amemiya, T. Nishioka, Z. Jiang, and K. Yasuda. Influence of film width\nand magnetic field orientation on ac loss in ybco thin film. Superconductor\nScience and Technology, 17:485–492, 2004.\n[29] J. Ogawa, H. Nakayama, S. Odaka, and O. Tsukamoto. AC loss characteristics of YBCO conductors carrying transport currents in external AC\nmagnetic fields. Cryogenics, 45:23–27, 2005.\n[30] M. Iwakuma, K. Toyota, M. Nigo, T. Kiss, K. Funaki, Y. Iijima, T. Saitoh,\nY. Yamada, and Y. Shiohara. AC loss properties of YBCO superconducting\ntapes fabricated by IBAD-PLD technique. Physica C, 412-414:983–991,\n2004.\n[31] M. Iwakuma, M. Nigo, D. Inoue, T. Kiss, K. Funaki, Y. Iijima, T. Saitoh,\nY. Yamada, and Y. Shiohara. AC loss properties of YBCO superconducting\ntapes exposed to external ac magnetic field. IEEE Transactions on Applied\nSuperconductivity, 15(2):1562–1565, 2005.\n15\n\n\f[32] Z. Jiang, N. Amemiya, K. Kakimoto, Y. Iijima, T. Saitoh, and Y. Shiohara.\nThe dependence of AC loss characteristics on the space in stacked YBCO\nconductors. Superconductor Science and Technology, 21:015020, 2008.\n[33] L. S. Lakshmi, M. P. Staines, K. P. Thakur, R. A. Badcock, and N. J.\nLong. Frequency dependence of magnetic ac loss in a five strand YBCO\nroebel cable. Superconductor Science and Technology, 23:065008, 2010.\n[34] L. S. Lakshmi, M. P. Staines, R. A. Badcock, N. J. Long, M. Majoros,\nE. W. Collings, and M. D. Sumption. Frequency dependence of magnetic\nac loss in a roebel cable made of YBCO on a NiW substrate. Superconductor\nScience and Technology, 23:085009, 2010.\n[35] Z. Jiang, R. A. Badcock, N. J. Long, M. Staines, K. P. Thakur, L. S. Lakshmi, A. Wright, K. Hamilton, G. N. Sidorov, R. G. Buckley, N. Amemiya,\nand A. D. Caplin. Transport ac loss characteristics of a nine strand YBCO\nroebel cable. Superconductor Science and Technology, 23:025028, 2010.\n[36] E. Pardo. Modeling of coated conductor pancake coils with a large number\nof turns. Superconductor Science and Technology, 21:065014, 2008.\n[37] E. Pardo, J. Šouc, F. Gömöry, and F. Grilli. AC loss in stacks of\npancake coils made of coated conductor: simulations agree with measurements. 2nd International Workshop on Numerical Modelling of\nHigh Temperature Superconductors, 2011. Available at http://wwwg.eng.cam.ac.uk/epec/HTSModellingWorkgroup/program/index.php.\n[38] Finite-element\nsoftware\nhttp://www.comsol.com.\n\npackage\n\nComsol\n\nMultiphysics.\n\n[39] D. N. Nguyen, S. P. Ashworth, J. O. Willis, F. Sirois, and F. Grilli. A\nnew finite-element method simulation model for computing ac loss in roll\nassisted biaxially textured substrate ybco tapes. Superconductor Science\nand Technology, 23:025001, 2010.\n[40] F. Roy, B. Dutoit, F. Grilli, and F. Sirois. Magneto-thermal modeling\nof 2nd generation HTS for resistive fault current limiter design purposes.\nIEEE Transactions on Applied Superconductivity, 18(1):29–35, 2008.\n[41] L. Prigozhin. Analysis of critical-state problems in type-II superconductivity. IEEE Transactions on Applied Superconductivity, 7(4):3866–3873,\n1997.\n[42] A. Sanchez and C. Navau. Magnetic properties of finite superconducting\ncylinders. i. uniform applied field. Physical Review B, 64:214506, 2001.\n[43] E. Pardo, F. Gömöry, J. Šouc, and J. M. Ceballos. Current distribution\nand ac loss for a superconducting rectangular strip with in-phase alternating current and applied field. Superconductor Science and Technology,\n20(4):351–364, 2007.\n[44] J. Šouc, E. Pardo, M. Vojenčiak, and F. Gömöry. Theoretical and experimental study of ac loss in high temperature superconductor single pancake\ncoils. Superconductor Science and Technology, 22:015006, 2009.\n16\n\n\f[45] E. Pardo, J. Šouc, and M. Vojenčiak. AC loss measurement and simulation\nof a coated conductor pancake coil with ferromagnetic parts. Superconductor Science and Technology, 22:075007, 2009.\n[46] R. Brambilla, F. Grilli, and L. Martini. Development of an edge-element\nmodel for AC loss computation of high-temperature superconductors. Superconductor Science and Technology, 20(1):16–24, 2007.\n[47] SuperPower, Inc. http://www.superpower-inc.com/.\n[48] M. Polak, S. Takacs, P. N. Barnes, and G. A. Levin. The effect of resistive filament interconnections on coupling losses in filamentary YBa2 Cu3 O7\ncoated conductors. Superconductor Science and Technology, 22:034003,\n2009.\n[49] G. Blatter, M. V. Feigelman, V. B. Geshkenbein, A. I. Larkin, and V. M.\nVinokur. Vortices in high-temperature superconductors. Rev. Mod. Phys.,\n66:1125, 1994.\n[50] M. P. Oomen, J. Rieger, M. Leghissaa, and H. H. J. ten Kate. Fieldangle dependence of alternating current loss in multifilamentary high-Tc\nsuperconducting tapes. Applied Physics Letters, 70:3038–3040, 1997.\n[51] D. X. Chen and A. Sanchez. Theoretical critical-state susceptibility spectra and their application to high-Tc superconductors. Journal of Applied\nPhysics, 70(10):5463–5477, 1991.\n[52] B. Klinčok, F. Gömöry, and E. Pardo. The voltage signal on a superconducting wire in ac transport. Superconductor Science and Technology,\n18:694–700, 2005.\n[53] R. B. Goldfarb, M. Lelental, and C. Thompson, edited by R. A. Hein, p.\n49. Magnetic Susceptibility of Superconductors and Other Spin Systems.\nPlenum, New York, 1991.\n[54] E. Pardo, D.-X. Chen, A. Sanchez, and C. Navau. The transverse criticalstate susceptibility of rectangular bars. Supercond. Sci. Technol., 17:537,\n2004.\n\n17\n\n\fFigure 1: The sketch shows the origin of the angle θ between magnetic field B\nand the surface of the tape.\n\n18\n\n\f140\n\ncritical current [A]\n\n120\n100\n80\n60\n40\n20\n0\n\n90\n\n180\n\n270\n\n360\no\n\napplied/local magnetic field angle [ ]\n150\n\ncritical current [A]\n\n100\n\nrealistic, no self-field\nelliptical, no self-field\nelliptical\nrealistic\n30\n1\n\n10\n\n100\n\n200\n\napplied magnetic field [mT]\n\nFigure 2: In the top graph, the applied magnetic field is, from top to bottom:\n20, 60, 100 and 200 mT. In the bottom graph, the lines are for 0o and 90o , from\ntop to bottom.\n\n19\n\n\f1\n\n10\n\n0\n\n2\n\n2\n\nloss factor Q/Bm [J/(T m)]\n\n10\n\n10\n\n-1\n\n10\n\n-2\n\n10\n\nMMEV\nFEM n=35\nFEM n=101\n\n-3\n\n0.001\n\n0.01\n\n0.1\n\n1\n\n2\n\napplied magnetic field amplitde [T]\n\nFigure 3: AC loss per unit length and cycle, Q, for a single tape with the\nrealistic anisotropic field dependence of Jc in section 2.2. The angle of the\napplied magnetic field is 90, 30, 15, 7, 3 degrees in the arrow direction.\n\n20\n\n\fQ/B2per [J/(T2m)]\n\n101\n\n100\n\n10-1\n\n90o\n60o\n30o\n15o\n7o\n3o\nMMEV\nFEM\n\n0.001\n\n0.01\nBper [T]\n\n0.1 0.2\n\nQ/B2per [J/(T2m)]\n\n101\n\n100\n\n10-1\n\n90o\n60o\n30o\n15o\n7o\n3o\nMMEV\nFEM\n\n0.001\n\n0.01\nBper [T]\n\n0.1 0.2\n\nQ/B2per [J/(T2m)]\n\n101\n\n100\n\n10-1\n\n90o\n60o\n30o\n15o\n7o\n3o\nMMEV\nFEM\n\n0.001\n\n0.01\nBper [T]\n\n0.1 0.2\n\n2\n21\nFigure 4: Loss factor Q/Bper\nas a function\nof the perpendicular applied field\namplitude Bper for a single tape for the anisotropic field dependences in section\n2.2: realistic, elliptic and isotropic (from top to bottom). The symbols distinguish different angles of the applied field and the solid/dash lines distinguish\nthe results from MMEV and FEM.\n\n\fFigure 5: The magnetic flux lines for the coupled case (up) are very different\nfrom the uncoupled one (bottom). These flux lines are calculated with the\nMMEV model at the peak of the AC cycle for θ=15o and Bm =50 mT.\n\n22\n\n\fFigure 6: This cross-section shows that the current distribution for the coupled\n(up) and uncoupled (bottom) cases are evidently different (the current distribution is calculated with the MMEV model). The situation is for the peak of the\nAC cycle for an applied field of θ=15o and 50 mT of amplitude. This current\ndistribution is for the 1D approximation: only one element in the superconductor thickness. For better visualisation, the horizontal and vertical axis are not\non scale and the represented tape thickness in not in scale with the horizontal\nseparation between tapes.\n\n23\n\n\f2\n\naverage J in the thickness [GA/m ]\n\n25\n20\n15\n10\n5\n0\n-5\n-10\n-15\n-20\n-25\n-2\n\n-1\n\n0\ny [mm]\n\n1\n\n2\n\n-2\n\n-1\n\n0\ny [mm]\n\n1\n\n2\n\n2\n\naverage J in the thickness [GA/m ]\n\n15\n10\n5\n0\n-5\n-10\n-15\n-20\n\nFigure 7: The average current density J in the thickness of the tapes for both\nsimulation methods agree (solid and dash lines are for the MMEV and FEM\nresults, respectively). The the different lines (black, blue, green and red) are\nfrom the left border to the central layers of tapes in figures 5 and 6. The\nsituation is the same as in those figures.\n\n24\n\n\fFigure 8: This cross-section shows that the current distribution for the coupled\n(up) and uncoupled (bottom) cases are evidently different (the current distribution is calculated with the MMEV model). The situation is for the peak of\nthe AC cycle for an applied field of θ=7o and 20 mT of amplitude. This current\ndistribution calculated with 20 elements in the thickness shows the details of\nthe current penetration across the tapes thickness. For better visualisation, the\nhorizontal and vertical axis are not on scale and the represented tape thickness\nis not in scale with the horizontal separation between tapes.\n\n25\n\n\f1\n\n10\n\n0\n\n2\n\n2\n\nloss factor Q/Bm [J/(T m)]\n\n10\n\n10\n\n-1\n\n0.01\n\n0.1\n\n1\n\napplied magnetic field amplitude [T]\n\nFigure 9: Loss factor, Bm is the applied field amplitude, for a Roebel cable\nin the coupled case. Solid lines with symbols are calculated by MMEV and\ndash lines with symbols are calculated by FEM. The angle of the applied field\namplitude is 90, 60, 30, 15, 7, 3 and 0 degrees in the arrow direction.\n\n26\n\n\f1\n\n10\n\n0\n\n2\n\n2\n\nloss factor Q/Bm [J/(T m)]\n\n10\n\n10\n\n-1\n\n10\n\n-2\n\n0.01\n\n0.1\n\n1\n\napplied magnetic field amplitude [T]\nFigure 10: Loss factor, Bm is the applied field amplitude, for a Roebel cable\nin the uncoupled case. Solid lines with symbols are calculated by MMEV and\ndash lines with symbols are calculated by FEM. The angle of the applied field\namplitude is 90, 60, 30, 15, 7, 3 and 0 degrees from top to bottom. The black\nsolid line is for the Bean slab model with a parallel applied magnetic field [53]\n(see text).\n\n27\n\n\f1\n\n2\n\n2\n\nloss factor Q/Bm [J/(T m)]\n\n10\n\n10\n\n0\n\n0.001\n\n0.01\n\n0.1\n\napplied magnetic field amplitude [T]\nFigure 11: The normalised loss factor relative to the perpendicular applied field\namplitude, Q/Bper, for the uncoupled case does not only depend on Bper only.\nSolid lines with symbols are calculated by MMEV and dash lines with symbols\nare calculated by FEM. The angle of the applied field amplitude is 90, 60, 30,\n15, 7 and 3 degrees from top to bottom in the arrow direction.\n\n28\n\n\f"}