{"id": "http://arxiv.org/abs/1203.0763v1", "guidislink": true, "updated": "2012-03-04T19:28:37Z", "updated_parsed": [2012, 3, 4, 19, 28, 37, 6, 64, 0], "published": "2012-03-04T19:28:37Z", "published_parsed": [2012, 3, 4, 19, 28, 37, 6, 64, 0], "title": "PSR J0737-3039B: A probe of radio pulsar emission heights", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1203.5742%2C1203.6539%2C1203.1880%2C1203.3516%2C1203.1425%2C1203.4138%2C1203.1471%2C1203.0980%2C1203.1192%2C1203.2520%2C1203.3948%2C1203.1421%2C1203.1264%2C1203.4204%2C1203.2473%2C1203.1698%2C1203.5099%2C1203.3834%2C1203.4449%2C1203.3861%2C1203.0763%2C1203.4485%2C1203.5750%2C1203.6587%2C1203.5632%2C1203.5068%2C1203.4465%2C1203.4082%2C1203.1320%2C1203.6607%2C1203.1202%2C1203.5656%2C1203.4645%2C1203.0941%2C1203.4103%2C1203.0654%2C1203.6488%2C1203.2887%2C1203.2517%2C1203.3234%2C1203.2198%2C1203.0163%2C1203.6566%2C1203.2852%2C1203.2842%2C1203.5125%2C1203.6062%2C1203.1374%2C1203.0997%2C1203.1591%2C1203.5062%2C1203.0528%2C1203.2659%2C1203.6805%2C1203.4221%2C1203.1853%2C1203.3155%2C1203.1361%2C1203.0446%2C1203.0029%2C1203.5201%2C1203.2878%2C1203.1894%2C1203.0356%2C1203.5835%2C1203.3295%2C1203.5832%2C1203.2710%2C1203.3813%2C1203.0022%2C1203.3347%2C1203.4830%2C1203.1633%2C1203.0468%2C1203.1078%2C1203.4071%2C1203.4984%2C1203.4602%2C1203.5896%2C1203.0346%2C1203.0545%2C1203.1104%2C1203.0988%2C1203.1173%2C1203.1398%2C1203.1475%2C1203.4212%2C1203.3667%2C1203.4145%2C1203.5544%2C1203.2439%2C1203.1506%2C1203.0049%2C1203.1446%2C1203.3319%2C1203.6250%2C1203.5996%2C1203.4663%2C1203.6220%2C1203.4409%2C1203.1522&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "PSR J0737-3039B: A probe of radio pulsar emission heights"}, "summary": "In the double pulsar system PSR J0737-3039A/B the strong wind produced by\npulsar A distorts the magnetosphere of pulsar B. The influence of these\ndistortions on the orbital-dependent emission properties of pulsar B can be\nused to determine the location of the coherent radio emission generation region\nin the pulsar magnetosphere. Using a model of the wind-distorted magnetosphere\nof pulsar B and the well defined geometrical parameters of the system, we\ndetermine the minimum emission height to be ~ 20 neutron star radii in the two\nbright orbital longitude regions. We can determine the maximum emission height\nby accounting for the amount of deflection of the polar field line with respect\nto the magnetic axis using the analytical magnetic reconnection model of Dungey\nand the semi-empirical numerical model of Tsyganenko. Both of these models\nestimate the maximum emission height to be ~ 2500 neutron star radii. The\nminimum and maximum emission heights we calculate are consistent with those\nestimated for normal isolated pulsars.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1203.5742%2C1203.6539%2C1203.1880%2C1203.3516%2C1203.1425%2C1203.4138%2C1203.1471%2C1203.0980%2C1203.1192%2C1203.2520%2C1203.3948%2C1203.1421%2C1203.1264%2C1203.4204%2C1203.2473%2C1203.1698%2C1203.5099%2C1203.3834%2C1203.4449%2C1203.3861%2C1203.0763%2C1203.4485%2C1203.5750%2C1203.6587%2C1203.5632%2C1203.5068%2C1203.4465%2C1203.4082%2C1203.1320%2C1203.6607%2C1203.1202%2C1203.5656%2C1203.4645%2C1203.0941%2C1203.4103%2C1203.0654%2C1203.6488%2C1203.2887%2C1203.2517%2C1203.3234%2C1203.2198%2C1203.0163%2C1203.6566%2C1203.2852%2C1203.2842%2C1203.5125%2C1203.6062%2C1203.1374%2C1203.0997%2C1203.1591%2C1203.5062%2C1203.0528%2C1203.2659%2C1203.6805%2C1203.4221%2C1203.1853%2C1203.3155%2C1203.1361%2C1203.0446%2C1203.0029%2C1203.5201%2C1203.2878%2C1203.1894%2C1203.0356%2C1203.5835%2C1203.3295%2C1203.5832%2C1203.2710%2C1203.3813%2C1203.0022%2C1203.3347%2C1203.4830%2C1203.1633%2C1203.0468%2C1203.1078%2C1203.4071%2C1203.4984%2C1203.4602%2C1203.5896%2C1203.0346%2C1203.0545%2C1203.1104%2C1203.0988%2C1203.1173%2C1203.1398%2C1203.1475%2C1203.4212%2C1203.3667%2C1203.4145%2C1203.5544%2C1203.2439%2C1203.1506%2C1203.0049%2C1203.1446%2C1203.3319%2C1203.6250%2C1203.5996%2C1203.4663%2C1203.6220%2C1203.4409%2C1203.1522&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "In the double pulsar system PSR J0737-3039A/B the strong wind produced by\npulsar A distorts the magnetosphere of pulsar B. The influence of these\ndistortions on the orbital-dependent emission properties of pulsar B can be\nused to determine the location of the coherent radio emission generation region\nin the pulsar magnetosphere. Using a model of the wind-distorted magnetosphere\nof pulsar B and the well defined geometrical parameters of the system, we\ndetermine the minimum emission height to be ~ 20 neutron star radii in the two\nbright orbital longitude regions. We can determine the maximum emission height\nby accounting for the amount of deflection of the polar field line with respect\nto the magnetic axis using the analytical magnetic reconnection model of Dungey\nand the semi-empirical numerical model of Tsyganenko. Both of these models\nestimate the maximum emission height to be ~ 2500 neutron star radii. The\nminimum and maximum emission heights we calculate are consistent with those\nestimated for normal isolated pulsars."}, "authors": ["B. B. P. Perera", "D. Lomiashvili", "K. N. Gourgouliatos", "M. A. McLaughlin", "M. Lyutikov"], "author_detail": {"name": "M. Lyutikov"}, "author": "M. Lyutikov", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1088/0004-637X/750/2/130", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1203.0763v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1203.0763v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "29 pages, 14 figures, Accepted by ApJ on 3 March 2012", "arxiv_primary_category": {"term": "astro-ph.GA", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph.GA", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1203.0763v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1203.0763v1", "journal_reference": null, "doi": "10.1088/0004-637X/750/2/130", "fulltext": "PSR J0737−3039B: A probe of radio pulsar emission heights\n\narXiv:1203.0763v1 [astro-ph.GA] 4 Mar 2012\n\nB. B. P. Perera,1 D. Lomiashvili,2 K. N. Gourgouliatos,2 M. A. McLaughlin,1,3 M. Lyutikov2\n\nABSTRACT\nIn the double pulsar system PSR J0737−3039A/B the strong wind produced by pulsar A distorts the magnetosphere of pulsar B. The influence of these distortions on the orbital-dependent\nemission properties of pulsar B can be used to determine the location of the coherent radio\nemission generation region in the pulsar magnetosphere. Using a model of the wind-distorted\nmagnetosphere of pulsar B and the well defined geometrical parameters of the system, we determine the minimum emission height to be ∼ 20RN S in the two bright orbital longitude regions.\nWe can determine the maximum emission height by accounting for the amount of deflection of\nthe polar field line with respect to the magnetic axis using the analytical magnetic reconnection\nmodel of Dungey and the semi-empirical numerical model of Tsyganenko. Both of these models\nestimate the maximum emission height to be ∼ 2500RN S . The minimum and maximum emission\nheights we calculate are consistent with those estimated for normal isolated pulsars.\nSubject headings: stars:neutron – pulsars\n\n1.\n\ncome from well above the surface (Rankin 1990;\nMitra & Rankin 2002). However, these techniques\nare limited in that we observe only a small section\nof the magnetosphere of these isolated pulsars due\nto an unchanging line-of-sight.\nPSR J0737−3039A/B is a unique binary system which provides an excellent opportunity to\nstudy different emission regions due to relativistic spin precession, allowing us to observe different portions of the magnetosphere. We can also\nexplore magnetospheric distortion, which affects\nthe observed emission pattern. The two neutron\nstars of this system orbit each other in a 2.4-hr\norbit; this is the only known pulsar binary system\nin which both neutron stars have been detectable\nas radio pulsars (Burgay et al. 2003; Lyne et al.\n2004). The first-born recycled pulsar − hereafter\nA − has a spin period of 23 ms and the second born\npulsar − hereafter B − has a spin period of 2.8 s.\nThe pulse profile of A has been stable since its\ndiscovery, but that of B has dramatically evolved\nthrough five years of observing, culminating in its\nradio disappearance in 2008 March (Perera et al.\n2010).\nDue to the unstable features of B's pulse profiles, both on long timescales and within a single\n\nIntroduction\n\nThe mechanism of pulsar radio emission and\nits origin within the pulsar magnetosphere are not\nwell understood (see, e.g., Hankins et al. 2009). In\ngeneral, it is thought to be due to coherent radiation from relativistic plasma streaming along\nopen magnetic field lines. Radio emission height\nestimates can constrain the emission mechanism\nto some extent. In normal isolated pulsars, radio emission heights have been estimated from\ntheir emission geometry inferred from radio polarization combined with the rotating vector model\n(Radhakrishnan & Cooke 1969) and the pulse profile widths (Gil & Kijak 1993; Kijak & Gil 1997;\nKijak & Gil 2003). Gangadhara & Gupta (2001)\nand Dyks et al. (2004) have also proposed a phaseshift method to determine the emission height. In\ngeneral, these methods show that core component\nemission originates very close to the surface of\nthe neutron star (NS), but the conal components\n1 Department of Physics, West Virginia University, Morgantown, WV 26506, USA.\n2 Department of Physics, Purdue University, West\nLafayette, IN 47907, USA.\n3 Also an adjunct astronomer at the National Radio Astronomy Observatory, Green Bank, WV 24944,USA.\n\n1\n\n\forbit, it is challenging to understand the emission geometry and the emission mechanism. By\nfitting a model to eclipses of A due to absorption in the magnetosphere of B, Breton et al.\n(2008) constrained the geometrical parameters\nto be α = 70.9(4)◦ and θ = 130.0(4)◦ 1 . Here\nα is the misalignment of the magnetic axis with\nrespect to the spin axis and θ is the colatitude\nof the spin axis. Unfortunately, B shows very\nlittle radio polarization, making it impossible to\nconstrain the geometry from polarization measurements (Demorest et al. 2004). Breton et al.\n(2008) also constrained the precessional phase of\nthe spin axis, measured from our line-of-sight, to\nbe φprec = 51.2(8)◦ at an epoch of 2006 May 2\n(i.e. MJD 53857) and found that this phase is\nchanging with time at a rate of 4.8(7)◦ yr−1 . This\nis consistent with the rate of 5.061(2)◦ yr−1 predicted by general relativity (Barker & O'Connell\n1975). Recently, Perera et al. (2010) analyzed the\npulse profile evolution of B and independently determined the above angles using a simple model\nbased on geodetic spin precession as proposed\nby Clifton & Weisberg (2008). According to this\nmodel, the beam must be elliptical and horse-shoe\nshaped in order to explain the observed single- to\ndouble-peak pulse profile evolution and the disappearance of radio emission. The estimations of\nthe above angles in this model are consistent with\nthose predicted by Breton et al. (2008), within the\n2-σ errors. From these studies, we believe that the\ngeometrical parameters of B are well known. We\ncan therefore use these values in this paper to\ndetermine the emission geometry.\nIn this paper, we also explore the distortion of\nthe magnetosphere of B. The almost edge-on orbital plane of the system, with inclination angle\nof 88.7◦ (Kramer et al. 2006), allows us to observe\nthe eclipses of A with a duration of about 30 seconds. By considering the relative transverse velocities of the two pulsars, 660 km/s (Lyne et al.\n2004), the estimated size of B's magnetosphere\nis about 10% of its light cylinder radius of ∼\n1.3 × 1010 cm . This implies that the wind of\nA compresses the magnetosphere of B and disturbs its polar cap (Lyutikov 2004). This is due\nto the small separation of the pulsars (∼ 9 × 1010\n\ncm or 2.9 lt-s) and the large spin-down luminosity of A (5.8 × 1033 ergs−1 ) compared to B\n(1.6 × 1030 ergs−1 ). This is analogous to the distortion of the Earth's magnetosphere due to the\nSolar wind. This interaction also results in an orbital modulation of B; we detect bright emission\nfrom the pulsar only in two orbital phase regions of\n185◦ −235◦ (hereafter BP1) and 265◦ −305◦ (hereafter BP2), and detect weak emission at phases of\n340◦ − 30◦ and 80◦ − 130◦ (Here, and throughout the paper, orbital phases are measured from\nthe ascending node). Lyutikov (2005) claims that\nthe pulsar has the same intrinsic radio intensity\nthroughout the orbit and that the orbital modulation is due to the deflection of the magnetic polar\nfield line with respect to the line-of-sight because\nof the influence of A.\nThe wind interaction with the magnetosphere\nof B produces a bow shock between A and B;\nthis is likely the boundary of the magnetosphere\nof B. The shape of this boundary depends on the\norientation of the magnetic axis of B. Lyutikov\n(2004) constrained the stand-off distance, or the\ndistance from B to the vertex of the bow shock,\nto be 3.5 × 109 cm if the bow shock interface is\na perfect resistor and 4 × 109 cm if it is partially\nresistive. These estimates inferred that the magnetosphere of B is located deep within its light\ncylinder and the open and closed field lines have\na more complicated structure than that of an isolated pulsar. Since the wind-interaction boundary model is very important to study the emission\ngeometry of B, we derive it again in this paper\nwith some improvements. This model describes\nthe shape of the boundary for any orientation of\nthe magnetic axis and allows us to model the open\nand closed field line structure more accurately.\nThis results in a method to use the derived\nfield line structure to estimate the radio emission heights of B. Since the bow shock boundary is located deep inside the light cylinder, the\ncorrection due to rotation on the static dipole\nfield, which introduced in retarded dipole field, is\nsmall (for retarded dipole field, refer appendix A of\nDyks & Harding 2004). Therefore we assume nonrotating dipole field throughout the model. In our\nmethod, we assume that the emission comes from\nthe direction tangential to the local field lines. We\nalso assume that the emission comes from above\nthe polar cap region, consistent with the narrow\n\n1 Here,\n\nand throughout the paper, the number in parentheses\nis the 1-σ uncertainty in the last quoted digit.\n\n2\n\n\fsingle- and double-peaked radio profiles.\nThe distortion of the Earth's magnetosphere\ndue to the solar wind has been studied using a\nlarge number of satellite observations and these\ndata have been extensively modeled. Since the\nwind of A distorts B's magnetosphere in the same\nway that the solar wind does the Earth's, some\nmodels for the Earth's magnetic field line structure can be used to study the distortion of the\nmagnetosphere of B and to determine the regions\nof radio emission. We use the Dungey (1961) planetary magnetosphere model and the Tsyganenko\n(2002a,b) Earth magnetosphere models to set an\nupper limit on the radio emission height of B.\nWe present our observational data in section 2\nand discuss observed mean pulse profiles. In section 3, we explain the boundary model which describes the shape of the bow shock. Then we trace\nthe dipole field lines and transform them from the\nco-rotating frame of the neutron star to the orbitfixed frame. In order to derive the required angular radius of the elliptical beam for the emission\nheight calculation, we re-analyze the beam with a\ndifferent geometrical framework in section 4. In\nsection 5, we present the method which we use to\nestimate the minimum emission height and our results. In section 6, we describe the maximum emission height calculation using two different magnetosphere models. Finally in section 7, we discuss our results and compare them with predicted\nemission heights for other pulsars. We also discuss\nheight estimations from other methods, concluding that these are not applicable to pulsar B.\n\nsuming a dispersion measure of 48.914 cm−3 pc\n(Lyne et al. 2004). The ephemeris of Lyne et al.\n(2004) was used until 2006 and since then we have\nused the ephemeris of Kramer et al. (2006) to form\nmean pulse profiles.\nThe mean pulse profiles for BP1 are shown in\nFigure 1. We aligned the peak of the profiles to the\npulse phase of 0.5 at each epoch. Note that these\npulse profiles have a better resolution than those\nin Perera et al. (2010). The second peak of the\npulse profile can be hidden with the low time resolution. Therefore, we use 1024 bins across the full\npulse phase, resulting in an effective time resolution of 0.003 s in this analysis compared to 0.01 s\nin Perera et al. (2010). For example, the second\npeak of the pulse profile of MJD 53860 around\npulse phase 0.52 in Figure 1 cannot be clearly seen\nin Figure 1 of Perera et al. (2010) on the same\nday with low time resolution. We use the pulse\nprofiles from 23 days in section 4, including 16\nepochs in Figure 1, in order to derive the beam\nshape. We include some low signal-to-noise data\n(e.g. MJD 53481) in this particular analysis because the second peak became apparent around\nthose days. Because these profiles appeared as\nsingle-peaked, we ignored them in the geometrical modeling of the previous lower time resolution\nstudy. As in Perera et al. (2010), we fit one and\ntwo Gaussians for each single and double-peaked\npulse profile, respectively, and then calculate profile widths at different intensity levels. We use\nthese data in section 4 to determine the geometry\nof the pulsar and the beam.\n\n2.\n\n3.\n\nObservations and pulse profiles\n\nBoundary model\n\nDue to the distortion of the magnetosphere, the\nproperties of pulsar B are different from those of\nnormal isolated pulsars. In isolated pulsars, we\ncan determine the size of the magnetosphere by\nmodeling the open and closed field lines, given the\nsize of their light cylinder. However, as mentioned\nearlier, the magnetosphere of B is located deep\ninside the light cylinder and the structure of the\nopen and closed field lines is more complicated due\nto the distortion from A's wind.\nIn the first step, we approximate the structure of the magnetosphere as a rotating vacuum\ndipole. Then we apply a simple model for the\nwind-magnetosphere interaction, as in Lyutikov\n\nWe observed J0737 − 3039B with the 100 m\nGreen Bank Telescope (GBT) in West Virginia\nsince 2003 December 24 at multiple frequencies.\nSince 820 MHz is the most common, we use only\nthose data in this analysis. This is the same\ndata set which we reported in Perera et al. (2010).\nHowever, we use better time resolution pulse profiles in this analysis compared to the previous paper. The data were taken using the GBT spectrometer SPIGOT with sampling time of 81.92 μs\nuntil 2009 January. After 2009 January, the spectrometer GUPPI was used with a sampling time of\n61.44 μs. All the data were dedispersed and folded\nusing the pulsar analysis package SIGPROC, as-\n\n3\n\n\fFig. 1.- Mean pulse profiles for BP1 on 16 different days including the very first observation which was\nmade on 2003 December 24 (MJD 52997). All data have been observed at a frequency of 820 MHz. There\nare 1024 bins across the entire pulse profile, resulting an effective time resolution of 0.003 s. Since predictions\nof absolute pulse phase are not available for these observations, we aligned the maximum peak to the pulse\nphase of 0.5 at each epoch. The horizontal and dotted lines show the baseline, or off-pulse mean, of the\nprofile and the standard deviation of the off-peak region, respectively. The signal-to-noise ratio (S/N) of\npulse profiles has decreased significantly from 284 (on MJD 52997) to 11 (on MJD 54552).\n\n4\n\n\f(2004). The wind of A creates a dynamic pressure\non the magnetosphere of B. The magnetosphere of\nB creates a magnetic pressure which opposes the\nwind pressure of A. At some point, these two pressures equal each other; this interface is likely the\nboundary of the magnetosphere of B. This boundary can be used to calculate the last open and\nclosed field lines. We derive an expression for this\nboundary by equating the two pressures,\n−2 −\n→\n2\n−\n→2\nB (r→\nB )/(8π) = LA cos (γ)/4πcrA ,\n\ngion. This can be written as\nLB = Ω2 B02 S 2 (1 + sin2 α)/4π 2 c\n\n(2)\n\nwhere Ω is the rotational angular frequency, B0 is\nthe polar magnetic field of pulsar B, S is the area\nof the polar cap region, and α is the magnetic inclination. As we mentioned earlier, with previous\ngeometry models (Breton et al. 2008; Perera et al.\n2010), α is taken to be ∼ 70◦ . Note that the original version of the equation (as in Spitkovsky 2006)\ncan be obtained by taking S to be the area of the\npolar cap of a dipole as defined by the open magnetic field lines with respect to the light cylinder.\nIn order to determine the boundary, we solve\nequation (1) numerically and then use equation\n(2) to determine the value of the magnetic field.\nTo do so, we simplified the problem to a 2D form\nin which the bow shock is represented by an equation involving xp and zp and lies on that plane.\nThe equation of the bow shock then has the form\nG(xp , zp ) = f (zp ) − xp , which must be solved in\norder to determine the shape of the bow shock.\nLet the radial vector r~B = f (zp )x̂p + z ẑp and the\n~ * G(xp , zp ).\nvector normal to the boundary ~n = ∇\nThen the dot product of these two gives the angle cos2 (γ) = 1/(1 + (df /dzp )2 ) and this can be\nsubstituted in equation (1). According to our 2D\nform, we can write the magnetic moment m\n~ =\nm cos δ xˆp +m sin δ zˆp and then derive the magnetic\n~ r~B ), as a function of\nfield of B at distance r~B , B(\nm, f (zp ), z and δ. Then equation (1) reduces to\na first order differential equation of f (zp ) and the\nsolution determines the shape of the bow shock.\nFirst we assume an initial value for the magnetic\nmoment, m, of B with a possible magnetic orientation, δ, and solve the problem to determine the\nshape of the bow shock. Then we find which are\nthe last closed field lines defined with respect to\nthe bow shock and finally the shape and the area\nof the polar cap.\nWe repeat the procedure for 16 values of the angle δ between the magnetic moment and the line\nconnecting the two pulsars, evenly spaced between\n0 and π/2, and we find the area of the polar cap for\neach of those orientations. In the estimation of the\naverage area of the polar cap, we have weighted\nappropriately the fact that some values of δ occur more frequently than others during an orbital\nperiod. Using the spin-down luminosity given in\n\n(1)\n\n→\nwhere r−\nB is the distance vector of the boundary\n→ →\n−\nwith respect to pulsar B, B (r−\nB ) is the magnetic\n→\nfield of pulsar B at −\nr B , LA is the spin-down lu→\nminosity of A, r−\nA is the distance vector of the\nboundary with respect to A, and γ is the angle\n→\nbetween the normal to the boundary and r−\nA (see\nFigure 2). The relative pressures lead to a boundary much closer to B. For that reason we simplify\nthe problem by setting the distance of the boundary with respect to A equal to the distance between the two pulsars and γ equal to the angle\nbetween the normal to the boundary and the line\nconnecting two pulsars. By assuming a magnetic\ndipole at the center of the coordinate system, we\ncan write the magnetic field strength of the neu→ →\n−\n3\n→\n−\n→\n−\ntron star as B (r−\nB ) = (3r̂B ( m * r̂B ) − m)/rB ,\n→\nwhere −\nm = m(cos δ cos Ωt, cos δ sin Ωt, sin δ) is the\nmagnetic moment, Ω is the rotational angular frequency, and δ is the angle between the magnetic\nmoment and the line connecting the two pulsars\n(see Figure 2).\nIn isolated pulsars, we believe that the spindown is caused by the power carried out along the\nmagnetic field lines which are open with respect\nto the light cylinder (Contopoulos & Spitkovsky\n2006). These open magnetic field lines start from\nthe polar cap region of the neutron star surface\nand their shape changes with respect to the magnetic inclination. Spitkovsky (2006) proposed a realistic form of the spin-down luminosity of an isolated pulsar as a function of the magnetic inclination angle. However, the open field line structure\nof pulsar B is somewhat different than for an isolated pulsar and, therefore, we need to define the\nmagnetic fields lines with respect to the bow shock\nboundary. Therefore, we modified the spin-down\nluminosity equation that is given in Spitkovsky\n(2006) by including the area of the polar cap re5\n\n\fZp\nBow shock\nboundary\n\nγ\n\nWind\ntowards\npulsar B\n\nrA\n\nrB\n^\nm\n\nPulsar B\n\nδ\n\nPulsar A\n\nD\nXp\n\n−Yp\n\nFig. 2.- Geometry of the wind-magnetosphere interaction model. Pulsar A is located at a distance D\n(∼ 9 × 1010 cm) away from B along the xp -axis. The wind of A comes along the −xp direction and is shocked\nnear B. The physical interface has the shape of a bow shock and this is the boundary of the magnetosphere\nof B. r~B is the position vector at any point on the interface with respect to B. r~A is the position vector of\nthis point with respect to A and γ is the angle between the normal to the boundary at this point and r~A . δ\nis the angle between the magnetic moment axis m̂ and the line connecting the two pulsars.\ndepends on the orientation of the magnetic axis.\nThe stand-off distance corresponds approximately\nto 1/3 of the light cylinder, thus for these distances the relativistic modifications are minimal\nand do not change the value of the stand-off distance by more than a few percent. For that reason we have chosen to calculate it using a vacuum\ndipole model rather than a more complicated geometry that takes into account relativistic effects\nas in Deutsch (1955). For simplicity, we assume\nthe boundary is axially symmetric around the vector connecting the two pulsars. A maximum deviation of roughly 20% of the actual shape from the\nsymmetric case occurs when the angle δ is 90◦ .\nTherefore, the shape of the boundary is sensitive\nto an angle of δ, having a range of [0◦ , 90◦ ]. If\nthe angle δ is greater than 90◦ , then the boundary\nconsidered the effective δ of 180◦ −δ. For example,\nif δ is 100◦ , then the effective δ for the boundary\nshape is 80◦ . Therefore, with the assumption that\nthe magnetic axis is nearly aligned with the line-ofsight at the radio emission detection, the effective\nangle δ is small (∼ 5◦ − 35◦ ) in the orbital longitude region of BP2. Thus, the deviation of the\n\nequation (2) with the timing-derived LB , we find\na new value for the magnetic field. We repeat this\nprocess with this new magnetic field until the value\nof the magnetic field converges. This happens after five to ten iterations for an initial guess of the\nmagnetic field within a couple of orders of magnitude away from the convergence value. In order\nto represent the 3D version of the bow shock, we\nassume that it is axially symmetric around xp .\nAccording to the best solution, the magnetic\nfield of B is constrained to be BB = 6.4 × 1011\nG, which is about a factor of two lower than the\ntiming-derived value 1.2 × 1012 G assuming a vacuum dipole with a magnetic inclination of 90◦\n(Lyne et al. 2004). This new estimate is more realistic as it accounts for the boundary of the magnetosphere as the bow shock and a realistic magnetic inclination. The stand-off distance is constrained to be either 3.8 × 109 cm or 4.5 × 109 cm\nfor the cases when the magnetic axis is either normal or parallel to the line connecting the two pulsars, respectively. Thus, the size of the boundary\ndepends on the orientation of the magnetic axis of\npulsar B. Moreover, the shape of the bow shock\n6\n\n\fboundary model from the actual geometry of the\nboundary is small and the assumption of a symmetric geometry is reasonable. However, the deviation in the orbital phase region of BP1 is significant due to large effective angles of δ (∼ 35◦ −85◦ ).\nTo derive an expression for the physical shape of\nthe boundary, we examine different shapes which\nfit our results. As a preliminary fit, a parabola\nis a good guess, but a fourth-order polynomial\ndescribes the boundary better, yielding the minimum chi-squared value when we fit to our results.\nThe coefficients of this polynomial describe the\nvariation and are functions of the angle δ. The\nbest-fit polynomial is\n\nof the boundary is a bow shock and mathematically we can represent it as a fourth-order polynomial. Moreover, this shape depends on the orientation of the magnetic moment axis with respect\nto pulsar A. Thus, the coefficients of the best fit\npolynomial depend on this orientation.\n3.1.\n\nxp = a(δ) + b(δ)(yp2 + zp2 ) + c(δ)(yp2 + zp2 )2 , (3)\nwith a B-centered coordinate system in which the\nxp axis is towards A, the zp axis is normal to the\norbital plane, and the yp axis completes the righthanded coordinate system (see Figure 2). The\nthree axes have units in centimeters. The coefficients a(δ), b(δ), and c(δ) are\n\na(δ)\nb(δ)\nc(δ)\n\n\u0013\n0.83 − 0.01δ − 0.06δ 2 − 0.05δ 3 + 0.03δ 4\n1.83 × 10−10\n\u0013\n\u0012\n−0.46 + 0.04δ − 1.43δ 2 + 1.96δ 3 − 0.64δ 4\n(4)\n=\n5.45 × 109\n\u0012\n\u0013\n−0.48 − 0.03δ + 2.15δ 2 − 2.47δ 3 + 0.74δ 4\n=\n1.62 × 1029\n=\n\n\u0012\n\nwhere the angle δ is in radians and having a range\nof [0, π/2]. Since they are functions of δ, the\nboundary changes slightly with spin and orbital\nmotions, as well as over time due to precession.\nThis boundary model is valid only up to 5 ×\n109 cm, or ∼ 40% of the light cylinder radius,\nfrom B. Beyond this limit, the physical assumption of the dynamical pressure is incorrect because\nthe wind pressure on the magnetic field should be\nzero when it is parallel to the boundary at large\ndistances. Also we have assumed an undistorted\nmagnetic field of B in the model and the distortions at large distances will be significant.\nIn summary, we determined the boundary of\npulsar B by assuming equilibrium between the dynamical pressure of the wind of A and the magnetic pressure of the field of B. The physical shape\n\nTracing the dipole field lines\n\nDue to the wind interaction with the magnetosphere of B, it is complicated to understand the\nstructure of the open and closed field lines. To\ndetermine the polar cap region that is required for\nthe emission height estimation, we calculate the\nlast closed field lines by tracing them referring to\nthe derived boundary model.\nAs is standard, we treat the magnetosphere of\nB as a magnetic dipole. For an isolated pulsar, the\nlast closed magnetic field lines are defined as those\nthat just touch the light cylinder and the ones interior to the last closed field lines are considered\nopen field lines. In our case the boundary is not\nthe light cylinder but the bow shock, with the last\nclosed field lines defined as those that just touch\nthis bow shock. The polar cap region is defined\nby these particular field lines and the shape of it\ncan be determined by the locations where these\nfield lines cross the neutron star surface. Defining\nthe polar cap is important since we think that the\nradio emission is produced above this region.\nUnlike those of isolated pulsars, the magnetosphere of B is not symmetric around the magnetic\naxis due to the shape of the boundary. This can be\nclearly seen by tracing the last closed field lines.\nIn order to trace the field lines, we use the dipole\nfield line equation in polar coordinates\n\nr\n\n=\n\nφ =\n\nr0 sin2 (λ)\nφ0\n\n(5)\n\nwhere r is the radial distance to a given point along\nthe field line and r0 is the field-line constant, or\nequatorial distance of the field line from the magnetic axis. The angle λ is the colatitude of a given\npoint along the field line and φ0 is the azimuth angle, or the longitude of the given field line. Then\nthe Cartesian components of a particular field line\nare written as\n\n7\n\n\fx\n\n= r sin(λ) cos(φ)\n\ny\nz\n\n= r sin(λ) sin(φ)\n= r cos(λ)\n\nis the spin precession phase measured from the xaxis (i.e., φprec (t) = 0 when the spin axis is in\nthe plane of xo –yo ). The spin precession phase is\ngiven by\n\n(6)\n\nφprec (t) = Ωprec (t − T0 )\n\nwhere the z-axis of the coordinate system is\naligned with the magnetic moment axis and the\nother two axes are co-rotating with the neutron\nstar.\nTo include the misalignment of the magnetic\naxis and also account for the spin phase, we transform equation (6) to another frame where the zaxis is aligned with the spin axis. In this frame\n(see Figure 3(a)), the Cartesian components are\nxs\n\n=\n\nx cos α cos φspin − y sin φspin +\n\nys\n\n=\n\nz sin α cos φspin\nx cos α sin φspin + y cos φspin +\n\nzs\n\n=\n\nz sin α sin φspin\nz cos α − x sin α\n\nwhere Ωprec is the spin precession rate of B, which\nis 5.061(2)◦ yr−1 , and T0 is the time when the\nφprec (t) is zero, defined as the time when the spin\naxis is in the xo –yo plane. By using the above set\nof equations, we can transform dipole field lines\nfrom the co-rotating frame of the neutron star to\nthe orbit-fixed frame (xo , yo , zo ) where the xo –yo\nplane is in the orbital plane and xo sin(i) is pointing towards the observer, where i is the orbital\ninclination.\nIn order to place the polynomial boundary in\nthe (xo , yo , zo ) frame, we need to account for the\norbital motion of B. Due to this motion, the orientation of the boundary changes with respect\nto our line of sight, because the location of A\nchanges with respect to B. This relative motion\nchanges the shape of the magnetosphere of B\nwith respect to the line-of-sight and then the\nshape of the polar cap region. This results a\nvariation in the emission height estimate across\nthe orbit (more details are given in section 5).\nWe place the boundary model (xp , yp , zp ) in this\norbit-fixed coordinate frame with zo k zp and\nthen rotate it corresponding to the orbital phase\nφorb with (xp cos φorb − yp sin φorb , xp sin φorb +\nyp sin φorb , zp ), where φorb = ψ + 90◦ (see Figure 3(b)). Here φorb is measured from the ascending node and ψ is the rotation angle between xo\nand xp axes. Note that this 90◦ angle is included\nto convert the rotation angle ψ to orbital phase\nφorb as measured from the ascending node. Then\nwe trace the last closed field lines according to the\norientation of the boundary for the given orbital\nphase. For example, Figure 4 shows the confined\nmagnetosphere in the boundary model with the\nlast closed field lines on MJD 54050 (2006 November 11). Here, we use our best-fit geometry of the\npulsar from the beaming model that is described\nin section 4. At this particular epoch, the spin precession phase is φprec = 46◦ and we use the orbital\nphase φorb = 223◦ and the spin phase φspin = 0 in\nthe figure. Note that, at this spin and the orbital\nphases, the spin axis of the pulsar is in the xp –zp\n\n(7)\n\nwhere α is the angle between the magnetic axis\nand the spin axis and φspin is the spin phase. We\nmeasure the spin phase from the xs axis, which\nmeans that it is zero when the magnetic axis is in\nthe xs –zs plane.\nThe spin axis is also associated with the colatitude angle and the spin precessional phase.\nGeodetic spin precession changes the orientation\nof the spin axis with respect to our line-of-sight.\nIn order to include the colatitude of the spin axis\nand effects of spin precession, we transform a particular field line to another frame which is fixed\nwith our line-of-sight. We choose the frame with\nz-axis parallel to the orbital angular momentum\naxis and x-axis in the plane of the z-axis and the\nline-of-sight (see Figure 3(b)). The Cartesian components in this frame are\nxo\n\n=\n\nxs cos θ cos φprec (t) − ys sin φprec (t) +\nzs sin θ cos φprec (t)\n\nyo\n\n=\n\nxs cos θ sin φprec (t) + ys cos φprec (t) +\nzs sin θ sin φprec (t)\n(8)\n\nzo\n\n=\n\nzs cos θ − xs sin θ,\n\n(9)\n\nwhere θ is the angle between the spin axis and\nthe orbital angular momentum axis and φprec (t)\n8\n\n\fzo , zp\n\nzs\n^\nm\n\nzs\n\nElliptical\nRadio Beam\n\nα\nφspin\n\nxp\n\nToward\nPulsar A\n\nys\n\nio\n\nθ\n\nys\nyo\n\nψ φ\nprec\n\nLine−of−sight\n\nxs\n\nxo\n(a)\n\nxs\n(b)\n\nFig. 3.- Cartesian coordinate systems that transform magnetic field lines from the co-rotating frame of the\nneutron star to the orbit-fixed frame. (a) The spin phase φspin and the misalignment of the magnetic axis\nα are defined in the frame (xs , ys , zs ). The spin phase is measured from the xs -axis. Therefore φspin = 0\nis defined when the magnetic axis is in xs –zs plane. (b) The colatitude of the spin θ and the precessional\nphase φprec is defined in the frame (xo , yo , zo ). In this frame, the xo -axis is in the plane of the zo -axis and\nour line-of-sight (LOS). The spin precession φprec is measured from the xo -axis. The frame of the bow shock\nboundary (xp , yp , zp ) is then placed in this orbit-fixed frame with zp k zo and rotate with an angle of ψ\ndefined from the xo -axis. Then the orbital phase is defined φorb = ψ + 90◦ as it measures from the ascending\nnode. io = 90◦ − i, where i is the orbital inclination.\n\n9\n\n\fFig. 4.- Confined rotating vacuum dipole in the boundary model on MJD 54050 (2006 November 11) − a\nview in the xp –zp plane (left) and a view in the xp –yp plane (right). Pulsar B is located at the center of the\ncoordinate system and the wind of A comes towards the −xp direction. The dashed line shows the derived\nbow shock from the wind-magnetosphere interaction model and this models the open and closed field lines\nof the magnetosphere. The solid lines are the last closed field lines with respect to this boundary. The field\nlines that have higher latitude than these shown closed field lines are considered open field lines. The scale\nis in units of 109 cm. Here, α = 61◦ and θ = 138.5◦; these are our best-fit geometrical parameters from\nsection 4. This view corresponds to the orbital phase of 223◦. Note, for clarity of plots, we take the spin\nphase as zero, so that the north pole of the pulsar is pointing below the zp = 0 plane. However, the shape\nof the magnetosphere changes with the spin and orbital motion and over time due to precession.\nplane.\nThe spin of the magnetic axis also results in a\nchange in the shape of the magnetosphere due to\nthe misalignment of the magnetic moment. However, the most important orientation of the magnetic axis is when it reaches the closest approach\nto our line-of-sight (i.e. where we detect the emission). In order to measure the point of this closest\napproach, or the impact parameter β(t), we use\nthe equations\n\ntrace the last closed field lines, which determine\nthe shape of the magnetosphere. Due to different\norientations of the magnetic axis with spin, the\nshape of the magnetosphere with respect to our\nline-of-sight changes, but we are interested only in\nthe spin phase which gives the closest approach to\nus. Nevertheless, orbital motion and spin precession change the shape and we need to account for\nthese in emission height calculation.\n4.\n\nRe-analysis of the beam shape\n\nFor the emission height calculation, we require the angular radius of the emission beam.\nPerera et al. (2010) claimed the beam shape of B\nto be elliptical by modifying the Clifton & Weisberg\n(2008) geometrical framework. The model in\nPerera et al. (2010) used the 2D geometry of the\nbeam after projecting it to a plane which is perpendicular to the spin axis, resulting in a projected\nangular radius. We improve this model by using a\nmore realistic 3D model in this paper in order to\ndetermine the actual angular radius.\nThe angular radius of a circular emission beam\n\ncos ζ(t) = sin θ cos φprec (t) sin i + cos θ cos i\nβ(t) = ζ(t) − α.\n(10)\nHere, ζ(t) is the angle between the spin axis and\nour line-of-sight at a given time and the other angles have the usual meaning. We calculate the spin\nphase which gives this particular closest approach,\nso that we can estimate the emission height only\nat this particular spin phase.\nNow we can transform field lines from the corotating frame of the neutron star to the orbitfixed frame. By using the boundary model, we can\n10\n\n\fwhich leads to the maximum wj (t). Therefore, by\ncombining equation (11) and (12) for a given α,\nβ(t), and ρa,j , we can calculate the pulse profile\nwidth wj (t) for any given intensity level.\nIn order to determine the geometry of B, we\nfit the model-predicted pulse profile widths to observed pulse profile widths of BP1 at different intensity levels using the same likelihood analysis\nthat was described in Perera et al. (2010). The\nfit was done by searching the entire parameter\nspace of α, θ, χ, and T0 . For each combination\nof these parameters, we vary ρa,j from 0◦ to 30◦\nfreely until we reach the best solution. Then we\nuse a maximum likelihood analysis to determine\nthe best-fit geometrical parameters. The best-fit\nmodel for BP1 is shown in Figure 6. The es-◦\ntimated geometrical parameters α = 61.0◦+7.9\n−2.4◦\n◦\n◦ +5.3\nand θ = 138.5 −4.4◦ are consistent with those\nin Perera et al. (2010) and Breton et al. (2008)\nwithin the 2-σ errors. The ratio χ is constrained\nto be 2.6+0.4\n−0.6 , lower than the estimate of the previous paper. Our new estimate is more believable\nbecause it has been derived from a full 3D viewing model. In addition to these parameters, we\nderive T0 to be MJD 57399+4\n−25 (2016 January 12),\nwhich results in a precessional phase of 46◦ at an\nepoch of MJD 54050 (2006 November 11). This\nestimate is consistent with the value predicted by\nBreton et al. (2008) at the same epoch. However,\nthis is a somewhat arbitrary parameter that can\nbe chosen from our best-fit model. Note that the\nbest-fit T0 in Perera et al. (2010) is about MJD\n33360 (1950 March 20), which results in a precessional phase of 73◦ at an epoch of MJD 54050.\nThese two best-fit φprec result in a shift of the\nhour-glass 2D pulse profile shape along the precessional phase or time axis (see Figure 6 of this\nanalysis and Figure 17 of Perera et al. 2010).\nThe angular radius across the semi-major axis\nof the beam at the maximum intensity level ρa,100\nand 10% of the maximum ρa,10 are constrained to\nbe 9.9◦ and 14.3◦ , respectively. In order to determine the effective angular radius of the beam\n(more details are given in section 5), we use these\nangular radii with the derived beam geometry.\nFor emission height estimates for normal nonprecessing pulsars, a beam shape is not essential\nbecause our line-of-sight always observes the same\nsection of the emission beam. However, for precessing pulsars, we must consider a beam shape\n\nhas been calculated using pulse profile widths and\nan assumed emission geometry (Gil et al. 1984).\nSince Perera et al. (2010) showed that the shape\nof B's beam is not circular, we attempt to derive an\napproximate equation for an elliptical beam in 3D\nand then follow the same analysis of Perera et al.\n(2010) in order to determine the geometry. First,\nwe construct the beam with a set of coaxial hollow cones representing different intensity levels in\na way such that the outermost one represents the\nlowest intensity level and then the intensity increases gradually inwards toward the maximum\nand then decreases until reaching the center of the\nbeam. All these cones have cross sections with a\nconstant ellipticity of aj /bj , where aj and bj are\nsemi-major and minor axes, respectively, of each\nhollow-cone beam. Then, for any given longitudinal angular radius ρl,j (t) (see Figure 5), magnetic\nmisalignment angle α, and impact parameter β(t),\nthe pulse profile width wj (t) can be derived from\nspherical trigonometry (i.e. from spherical triangle FBD in Figure 5) as follows\n\u0013\ncos(ρl,j (t)) − cos2 (α + β(t))\n,\nsin2 (α + β(t))\n(11)\nwhere subscript j specifies different intensity levels of the pulse profile. Note that ρl,j (t) is time\ndependent because the region where our line-ofsight cuts the beam is changing with time due to\nprecession. In order to relate ρl,j (t) with the elliptical beam shape, we derive an equation with the\nassumption that the cross-section of the beam is\nsmall enough to use 1D trigonometry. Then the\nlongitudinal angular radius ρl,j (t) can be given as\na function of β(t),\nwj (t) = 2 arccos\n\nρl,j (t) =\n\n1\nχ\n\n\u0012\n\nq\nsin2 (ρa,j ) − cos2 (ρa,j ) tan2 (β(t)),\n\n(12)\nwhere ρa,j is the angular radius across the semimajor axis of the beam (see Figure 5) for a given\nintensity level and χ = aj /bj , which is a constant for all different intensity cones. This expression shows that the minimum ρl,j (t) of zero\noccurs when the line-of-sight just encounters the\nbeam (i.e. β(t) = ρa,j ), resulting in wj (t) = 0.\nThe maximum ρl,j (t) occurs when the line-of-sight\ncrosses the center of the beam (i.e. β(t) = 0),\n11\n\n\fzs\nElliptical beam\n\nF\n\n^\nm\n\nLOS\n\nA\nE\n\nLOS trajectory\n\nB\nD\n\nα\nO\n\nC\n\nβ\n\nwj(t)/2\n\nFig. 5.- Elliptical emission cone in the frame (xs , ys , zs ). The magnetic axis of the beam represents with\nm̂ and it is misaligned with the spin axis of an angle α. The trajectory of the line-of-sight across the beam\ndue to rotation is denoted with DBE. The angle B ÔD is the longitudinal angular radius ρl,j (t) of the beam\nfor a given intensity level at a given time. The angle AÔC is the angular radius across the semi-major axis\nof the beam ρa,j for a given intensity level, which is time independent and fixed for the beam. The angle\nAÔD is the effective angular radius of the beam ρe,j (t) for a given intensity level.\nin order to determine the emission height due to\nobserving different sections of the emission beam.\nTherefore, in this particular case, we use our derived elliptical beam shape with the best-fit geometrical parameters of B to estimate emission\nheights in section 5. As we see in Perera et al.\n(2010), the pulse profile evolution is somewhat\nsimilar in both bright phases. Therefore, we use\nthe above best-fit beam parameters from BP1\nin our emission height estimates for both bright\nphases.\nPerera et al. (2010) reported that the radio\nemission of B disappeared in 2008 March, because\nthe line-of-sight precessed away from the partially\nradio-filled elliptical beam. According to the same\nargument that the beam is not entirely radio loud,\nwe can explain the radio disappearance with our\nnew elliptical beam geometry. With the partially\nfilled beam configuration, we can predict the reappearance of the radio emission as our line-of-sight\nprecess back to the radio loud region of the beam.\nWith the model described in Perera et al. (2010),\nthe reappearance is predicted to occur in around\n2035 with the same part of the beam or in around\n\n2014 if the beam has two symmetric radio-filled\nportions. However, our new model describes the\nreappearance is predicted to occur in around 2024\nwith the same part of the beam. Therefore, Figure 6 changes with the partially-filled horse-shoe\nbeam to non-detectable emission from 2008 to\n2024. If our new beam model is correct, then the\nbeam should not have two symmetric radio-filled\nparts, because our line-of-sight crossed around the\ncenter of the beam when the disappearance occurred in 2008. Therefore, if there are two symmetric parts, then we would be able to detect radio\nemission at present day. The two different predictions for the reappearance from the two models\nmainly occur due to two different best-fit T0 values. These two different T0 values give two different solutions for the geometry of B, however, the\nbest-fit values for parameters α and θ are the same\nfor the two models with the 2-σ uncertainty.\n5.\n\nEmission height calculation\n\nIn order to estimate the radio emission heights\nof pulsar B, we use the previously defined boundary model, the field line tracing technique, and the\n12\n\n\fFig. 6.- 2D pulse profile of the orbital longitude region 185◦ − 235◦ (BP1), assuming the elliptical hollow◦\n◦\n+0.4\n◦ +5.3\ncone beam. The best-fit geometrical parameters are α = 61.0◦ +7.9\n−2.4◦ , θ = 138.5 −4.4◦ and χ = 2.6−0.6 (errors\nare 1σ). The corresponding T0 is MJD 57399 (2006 November 11), which is the time where the spin axis of\nthe pulsar is in the plane of our line-of-sight and the orbital angular momentum axis. Note that these α and\nθ values are consistent with previous results (Perera et al. 2010; Breton et al. 2008). The dots are the widths\nat equal intensity levels of the observed pulse profile. Each horizontal row of dots represents an observation\nat a given epoch. Equal-intensity contours are the elliptical beam model-predicted pulse profile widths at\ndifferent intensities. The intensity increases from the inner dashed line outwards until the first solid line,\nwhich is the intensity of the peak, and then decreases outwards again. The intensity levels are, from the\ninner dashed line, 80%, 90%, 100%, 90%, 80%, 70%, 60%, 50%, 40%, 30%, 20% and 10%. The vertical axis\nis calibrated in years and can also be considered the spin precession phase. Note that, this figure shows the\nemission from the full elliptical beam. If the beam is partially-filled according to 2008 radio disappearance,\nthen the model predicts no radio pulse profiles from 2008 to 2024.\n\n13\n\n\fthe height of the radio emission. To evaluate the\n→\n→\ntangent to the field line, we take −\nr t = ∂−\nr orb /∂λ.\nThen the unit vector along the tangential direction\n→\n→\n(r̂t = −\nr t /|−\nr t |) can be written as,\n\nmodeled geometry of the beam. As we mentioned\nearlier, we assume that the radio emission is produced above the polar cap region and originates\ntangential to the local magnetic field lines.\nFirst, we need to determine the boundary of\nthe polar cap region, given by the last closed field\nlines. This can be done by tracing the field lines\nwith the derived boundary model as described in\nsection 3.1. We assume that the radio emission\ncomes from above the entire polar cap region, so\nthat the outer edge of the pulse profile (i.e. 10% of\nthe maximum intensity) corresponds to the region\nbetween the open and closed field lines, approximately equal to the last closed field line. Then\nwe determine the emission height that originates\nfrom these last closed field lines.\nIn order to determine the tangent to a particular last closed field line at a given moment, we\nrewrite the coordinate transformations in section\n3.1 in matrix form (see, e.g., Gangadhara 2004),\nso that it is easy to evaluate the equations relevant\nfor our calculation. First, we write the dipole field\nequation in the co-rotating frame of the neutron\nstar as\n\n\n\n3 cos φ sin λ cos λ\n2\n 3 sin φ sin λ cos λ  .\nr̂t = A*B*\n5 + 3 cos(2λ)\n2 cos2 λ − sin2 λ\n(17)\nThe direction of the magnetic moment axis in the\norbit-fixed frame can be written as\ns\n\nm̂ = A * B * ẑo .\n\nThen we evaluate the angle between the direction\nof the magnetic moment axis and the vector tangential to the field line (τ ) at any time through\nthe expression\n1 + 3 cos(2λ)\ncos(τ ) = r̂t * m̂ = p\n.\n10 + 6 cos(2λ)\n\n−\n→\nr cor = r0 (sin3 λ cos φ, sin3 λ sin φ, sin2 λ cos λ).\n(13)\nWe then transform it to the orbit-fixed frame\n−\n→\n→\nr orb = A * B * −\nr cor\n\n(14)\n\nwhere,\n\n\ncos α cos φspin\nA =  cos α sin φspin\n− sin α\n\n− sin φspin\ncos φspin\n0\n\n(18)\n\n\nsin α cos φspin\nsin α sin φspin \ncos α\n(15)\n\nand\n\n(19)\n\nThis is the same as equation (8) in Gangadhara\n(2004). At the point of detection of radio emission,\nwe take the angle τ to be equal to the effective\nangular radius of the previously derived emission\nbeam at the given time. According to our assumption that the outer edge of the pulse profile (10%\nmaximum) comes from the last closed field line,\nwe take τ ≈ ρe,10 (t), where ρe,10 (t) is the effective angular radius of the beam (angle AÔD of\nFigure 5) at the 10% of the maximum intensity\nlevel corresponding to a particular impact parameter β(t). We can derive an equation for ρe,10 (t)\nby using the spherical triangle F AD of Figure 5\nas\n\ncos(ρe,10 (t)) = cos(α) cos(α + β(t)) +\nsin(α) sin(α + β(t)) cos(w10 (t)/2).\n\n\ncos θ cos φprec\nB =  cos θ sin φprec\n− sin θ\n\n− sin φprec\ncos φprec\n0\n\n\n\nsin θ cos φprec\nsin θ sin φprec  .\ncos θ\n(16)\nFor the detection of radio emission, our line-ofsight must be parallel to the tangential vector of\nthe given field line at a particular point. By locating this point on the field line, we can determine\n14\n\n(20)\n\nHere, w10 (t), the model-estimated pulse width,\ncan be found through equation (11) and (12) with\nthe best-fit parameters α, θ, χ, and ρa,10 . The impact parameter β(t) for the given time can be determined through equation (9) and (10) with the\nbest-fit T0 . This w10 (t) is simply the 10% pulse\nwidth of the 2D pulse profile given in Figure 6 at\nthe given time. By simplifying equation (19), we\n\n\ffind an expression for λ, which is the colatitude of\nthe emission point. This expression can be written\n\ncos(2λ) =\n\nparameters from the beaming model. Thus, the\nuncertainty of the height estimate is in a range of\n[6,10] and [5,19] in NS radii for the leading and\nthe trailing edge of the beam, respectively, across\nthe orbit on this particular day.\nAlso, due to precession of the spin axis, the\nemission height varies with time because the angle β(t) varies with time. Again, there are two\ndifferent heights for the leading and trailing edges\nof the beam. These are shown in Figure 8 and 9.\nIn BP2, the difference between the two heights is\nnot as significant as in BP1 because of the orbital\nposition of B in BP2. In this region, pulsar B, A\nand our line-of-sight are roughly aligned, resulting a less deviation in emission heights for the two\nedges of the beam.\nIf the emission is produced from the boundary\nbetween the open and closed field lines, we can\nconsider these estimates to be the actual emission\nheights for B. If the emission is produced elsewhere\nwithin the open field line region, these are lower\nlimits on emission heights.\n\nq\n1\n[cos(ρe,10 (t)) 8 + cos2 (ρe,10 (t)) −\n3\nsin2 (ρe,10 (t))]. (21)\n\nThis is same as equation (9) in Gangadhara\n(2004), so that the colatitude angle of the emission\npoint in our complicated geometry is simplified to\nthat of an isolated pulsar. Then the emission\nheight of this point can be calculated by using the\nfirst equation of (5). However, determining the\nfield line constant, r0 , in this equation is difficult\ndue to the bow shock boundary and its variation. Kijak & Gil (1997) assumed that this r0 is\nthe light cylinder radius since the isolated pulsars\nthat they have studied have low magnetic inclinations. To determine r0 for our particular case,\nwe trace the last closed field line which is tangent\nto our line-of-sight at the closest approach of the\nmagnetic moment with respect to the bow shock\nboundary. Then we use the dipole field equation\nto estimate the emission height.\nThe orientation of the bow shock changes across\nthe orbit with respect to our line-of-sight at the\nclosest approach, so that the emission height\nchanges with orbital longitude, because the last\nclosed field lines are defined with respect to the\nbow shock. Moreover, when the central part of\nthe radio beam crosses our line-of-sight, we will\ndetect a double-peaked profile since the two edges,\nleading and trailing, of the beam cross our lineof-sight. Thus due to the different orientation\nof the magnetic moment axis at these two edges\nwith respect to us, our line-of-sight is tangent to\ntwo different last closed field lines which have two\ndifferent r0 values. Thus the height of the emission produced by the leading and trailing edges of\nthe beam are different. This is shown in Figure 7.\nFor example, the emission heights produced by the\nleading components of the beam are constrained to\nbe in a range of [24±8,31±10] and [20±6,21±7] in\nNS radii (10 km) on MJD 54050 (2006 November\n11) for BP1 and BP2, respectively. The heights\nof the trailing edge of the beam in BP1 and BP2\nare constrained to be in a range of [15 ± 5,19 ± 6]\nand [21 ± 7,38 ± 12] in NS radii, respectively. The\nerrors of the height estimates are calculated from\nthe 1-σ uncertainties of the best-fit geometrical\n\n6.\n\nUpper limit of the emission height\n\nWe may also set an upper limit to the radio\nemission height by modeling the distortions of B's\nmagnetosphere induced by the wind of A. Since\nboth the magnetosphere and the wind are strongly\nmagnetized, the distortions depend on the relative\nstrengths of the magnetic fields and thus on the\ndistance from the neutron star. Depending on the\nlocation of the radio emission region and the line\nof sight (and hence on the orbital position) an observer will detect different radiation signatures of\nthe distorted magnetosphere. Inversely, by studying the orbital modulation and using a model of\nthe distorted magnetosphere, we can deduce the\nlocation of the emission region.\nSimilar to how the Sun distorts the Earth's\nmagnetosphere, pulsar A produces a strong enough\nwind to interact with the magnetic field of B and\nshape its magnetosphere. The nature of this interaction will vary depending on the properties\nof the wind. For a wind with a substantial particle flux, the formation of a bow shock, similar to case of the Earth, is expected. In this\nMHD confinement model, the shape of the Earth's\nmagnetosphere is mostly determined by the pressure balance between the supersonic solar wind\n\n15\n\n\fFig. 7.- The model-estimated radio emission height across the orbit on MJD 54050 (2006 November 11).\nThe solid line represents the height of the emission produced by the leading edge of the beam and the dotted\nline represents that for the trailing edge of the beam. In order to consistent with observations, we used our\nbest-fit geometrical parameters of the beaming model, α = 61◦ and θ = 138.5◦. At this epoch, φprec is 46◦ ,\nthe impact parameter β is 3◦ and the corresponding spin phase is 126◦ . Note that the difference between\nthe corresponding heights for the leading and trailing components of the beam is more significant in some\nparts of the orbit . The orbital longitude regions for BP1 and BP2 are denoted with dashed and dot-dashed\nlines, respectively.\n\n16\n\n\fFig. 8.- The model-estimated radio emission heights of the orbital longitude region of BP1 vs time across\none precessional cycle. This predicted variation of emission height with time is due spin precession, making\ndifferent line-of-sight cuts across the radio beam. The solid line represents the emission height from the\nleading edge of the beam and the dotted line represents that for the trailing edge. Here, the orbital phase\nis fixed at 200◦ (BP1), but the spin phase changes with time corresponds to the β value. The time axis\nrepresents a full precession cycle, 71 yr. Here, we have used the same geometrical parameters as in Figure 7\nand assumed a full elliptical beam, not a partially filled horse-shoe beam. If the beam is partially-filled\nthen no radio emission is expected from 2008 to 2024. This is why the model still predicts radio emission\nat present-day MJDs. The emission height is zero (∼ 2030 − 2067) when the line-of-sight is out of the radio\nbeam.\n\n17\n\n\fFig. 9.- As described in Figure 8, but for BP2 (orbital longitude is 290◦ ). Note that in this bright phase,\nthe emission height difference between the leading and trailing components of the beam is not as significant\nas in BP1.\nand the Earth's nearly dipolar field. This curved\nshape of the magnetosphere is reproduced well by\ncurrent numerical models (Tsyganenko 2002a,b;\nTsyganenko & Sitnov 2007).\nOn the other hand, for a strongly magnetized\nwind, reconnection between the wind and the companion's magnetic field lines must be considered.\nThis results in an open structure for the whole\nmagnetosphere, similar to the one originally proposed by Dungey (1961) for planetary magnetospheres.\nIn the case of the double pulsar, it is unclear\nwhether a MHD confinement model or a reconnection model is more applicable due to the unknown\ncomposition of A's wind. However, we are mostly\ninterested in the overall geometric structure of B's\nmagnetosphere. For this purpose, it is sufficient to\ndiscuss magnetospheric structure in the most basic\nterms, relying on the models of planetary magnetospheres. We consider two extreme, though\ncomplimentary, models of the Earth's magnetosphere; the highly resistive, analytical reconnection model of Dungey (1961), hereafter D61, and\nthe fully screened, 3D numerical hydrodynamic\nconfinement model of Tsyganenko (2002a,b), here-\n\nafter TS02.\nWe use the D61 model of the open planetary\nmagnetosphere as a simple analytical representation of the distorted magnetosphere. The D61\nmodel states that the interplanetary magnetic field\n(IMF) may become reconnected with the terrestrial field along the day-side magnetopause, where\nthe magnetopause is the boundary between the\nEarth's magnetosphere and the solar wind. This\nresults in a distortion of the higher altitude regions\nof the inner magnetosphere.\nForbes & Speiser (1971) neglected the dynamics of the reconnection processes and modeled the\nEarth's magnetosphere as a linear superposition\nof two magnetic fields: the Earth's closed field\nand the solar wind's uniform field. Following this\napproach, we can represent B's magnetosphere as\na simple addition of the pulsar's dipole field and\nthe wind's uniform field. Similar to the IMF in\nthe D61 model, we treat the magnetic field in A's\nwind as homogeneous in the vicinity of B, with\nthe direction of the magnetic flux density vector\nperpendicular to the line connecting the two pulsars (assuming a toroidal field). However, depending on whether the large-scale toroidal field is pro-\n\n18\n\n\fThis set of parameters produces a magnetosphere\nboundary with a stand-off distance of about 10.4\nstellar radii. In order to make the spatial scaling consistent with the properties of the double\npulsar, we rescaled the stellar radius parameter\nR0 from 1 to 0.0026. This change simply ensures\nthat the stand-off distance is about 4000 stellar\nradii, which is the value assumed throughout this\nsection.\nThe obtained values of the parameters (PARMOD(14) and R0) are not supposed to be physically realistic; rather, they produce a magnetosphere with a\nshape and size (defined by the stand-off distance)\nthat match the properties of the double pulsar.\nMoreover, there could be other successful fits since\nthey are derived from the visual inspection of the\nboundaries (see Figure 11). Nevertheless, using\nthis particular set suits our purpose of modeling\nan approximate structure of pulsar B's distorted\nmagnetosphere without using large computational\nresources.\nWe employed the same criteria to estimate an\nupper limit for the emission height for both models. We assumed that the elliptical emission beam\nis located close to the polar field lines, which are\nnearly aligned with the magnetic axis at r ≪ RLC ,\nwhere RLC is the light cylinder radius. The\nanisotropic distortion of the magnetosphere by the\nwind changes the location of the polar field line relative to the undistorted magnetic axis (see Figure\n12, (b) and (d)). As a first approximation, the deflection angle can be expressed as αdef l ∼ Bw /Bp ,\nwhere Bw and Bp are the magnetic filed of pulsar\nA's wind and the magnetic field of pulsar B, respectively. Close to the neutron star's surface, the\ninfluence of the wind's magnetic field on the overall\nfield structure is negligible. Therefore, αdef l ∼ 0\nat the surface and increases outwards as the wind's\nmagnetic field becomes comparable to the pulsar\nfield near the boundary. The ratio between the\ntwo fields, and hence the amplitude of the deflection, depends on the distance from the star as well\nas on δ, the angle between B's magnetic axis and\nthe line connecting the two pulsars. There is a\ncertain height above which the distortion is strong\nenough to deflect the polar field line by more than\nthe angular radius of the beam (ρa,10 ≃ 14.3◦ ),\nwhich is determined in section 4. Furthermore,\nif the component of the distortion perpendicular\nto the trajectory of the center of the beam in the\n\ngrade or retrograde with respect to the orbit, the\ngeometric structure of the magnetosphere can be\nsignificantly different (see Figure 10).\nAlternatively, we can use TS02 for more precise, three-dimensional modeling. This model is a\ndata-based best-fit representation for the Earth's\nscreened magnetosphere based on a large number\nof satellite observations. The model provides the\noption of adding the contributions from external\nmagnetospheric sources such as the ring current,\nmagnetotail current system, magnetopause currents, and the large-scale system of field-aligned\ncurrents to the Earth's dipole field.\nWe used the GEOPACK code repository developed by Tsyganenko, with modifications to match\nthe properties of the double pulsar system. Instead of analyzing every current component in the\nTS02 model separately, we manipulated the global\ninput parameters of the code which define the geometric structure of the magnetosphere. The shape\nand scale of the magnetosphere is controlled by the\nsolar wind ram pressure and the dipole tilt only.\nVariations in the value of the ram pressure change\nthe magnetosphere self-similarly. In the numerical\nmodel, the ram pressure is represented by the parameter PARMOD(1) and has units in nPa. PARMOD(2) represents the disturbance storm time\n(Dst) index and has units in nT. The Dst index\nis a measure of the size and strength of the ring\ncurrent, which contributes to the overall field configuration in the inner magnetosphere. The TS02\nmodel is designed in such a way that the structure\nof the magnetosphere within a stand-off distance\nfrom the Earth has a very small dependence on\nthe components of the IMF. Hence, for simplicity\nwe set the transverse components of the external\nfield (PARMOD(3)=By and PARMOD(4)=Bz ) to\nzero.\nWe performed a visual fitting (see Figure 11)\nof the boundary produced by the TS02 code to\nthe boundary produced by our theoretical model\n(equation (1) and (2) in section 3). We set PARMOD(3) and PARMOD(4) equal to zero and\nchanged PARMOD(1) and PARMOD(2) until\nthe shapes of the boundaries matched. The best\nfit values that we obtained are PARMOD(1)=8\nnPa for the solar wind ram pressure, PARMOD(2)=100 nT for the Dst index, and, by\ndefault, the zero transverse components of the\nIMF (PARMOD(3)=0 nT, PARMOD(4)=0 nT).\n19\n\n\fFig. 10.- Geometric structures of Dungey-type magnetospheres in 2D. Magnetospheric models constructed\nby adding a wind's uniform field, in the direction shown by the arrows on the dashed lines, to a dipole field\nwith northward orientation. Magnetic fields of 6.4 × 1011 G and 10 G are assumed for the surface magnetic\nfield of pulsar B and the wind magnetic field, respectively. The direction of the wind is the opposite of\nthe arrow showing the direction to the pulsar A. Both (a) and (b) have the same direction of the wind\nand orientation of the dipole. Same is true for (c) and (d). However, two different possible orientations of\nthe magnetic field in the wind result in very different overall magnetospheric structures. (a) shows smaller\ndeflection of the polar field lines compared to (b). Magnetosphere in (c) is mostly open, whereas one in (d)\nis mostly closed. In the latter, a radius of the enclosed magnetosphere is about 4 × 109 cm.\n\n20\n\n\fFig. 11.- TS02 magnetosphere fitted to the theoretical boundary model. Field lines are plotted in solid.\nOut of which the green color is for the polar field lines. Dashed line represents the bow shock boundary\nmodel. Tilt of the dipole is 45◦ and rs ∼ 4 × 109 cm. We fix the shape and scale of the boundary and fit\nthe parameters of the TS02 model.\n\n21\n\n\ftion that the wind from A is strongly magnetized\n(i.e., the shape of the boundary and stand-off distance is defined solely by the magnetic pressure\nbalance). The pulsar wind is highly magnetized\nnear the light cylinder. The particle component\nonly takes over much further, closer to the termination shock. Since the wind from A reaches B\nafter only 1000 light cylinder radii, the assumption about its high magnetization is valid. Therefore, we can describe both fields by one dimensionless parameter: stand-off distance normalized\nto the stellar radius. At the moment of the closest approach, the magnetic moment of B is almost\naligned with the line of sight. In turn, due to the\npeculiarity of the double pulsar, the line of sight\nis nearly parallel to the orbital plane. Thus, at\nthe moment of the closest approach, B's magnetic\naxis and the magnetic field of A's wind are nearly\ncoplanar. Therefore, for approximate estimates,\nthe full three-dimensional analysis of the system\nis not necessary and we only carry out the calculations for the two-dimensional configuration.\nIn 2D polar coordinates (r, λ), the equation for\nthe magnetic field lines reads as\n\nvicinity of our line-of-sight is large enough, then\nthe emission beam can be pushed away from the\nline-of-sight to the extent that they do not intersect with each other for any spin phase (see Figure\n12, (b)). This will render the emission beam unseen. On the other hand, the opposite can be true\nif the distortion occurs mostly along the local trajectory of the beam. In this case, the visibility of\nthe beam stays unchanged and a small shift in the\nspin phase, at which the emission beam is seen,\nmight be the only observable imprint of the distortions (Figure 12, (d)). However, the geometry\nof pulsar B suggests that the former must be realized (Figure 12, (a) and (b)). Therefore, in order\nto be able to detect pulsed radio emission from B,\nthe deflection angle αdef l should not exceed 14.3◦ .\nThis places an upper limit on the height of the\nemission region. However, in order to be able to\nuse this reasoning, a pulsar must be detectable\nthrough its pulsed radio emission. We therefore\nrestrict our analysis to only BP1 and BP2, the\ndistinct radio-loud regions of the orbit.\nIn order to make use of this criteria, we analyzed the moments of the closest approach at the\norbital phases within BP1 and BP2. At the moment of the closest approach, the magnetic axis\nis nearly aligned with the line-of-sight, making\nthe angle δ about the same as the angle between\nthe line-of-sight and the line connecting the two\npulsars. In turn, the latter is related to the orbital phase as (90◦ − φorb )(mod 180). Therefore,\nδ∗ ∼ (90◦ − φorb ) when −90◦ ≤ φorb < 90◦ and\nδ∗ ∼ (φorb − 90◦ ) when 90◦ ≤ φorb < 270◦, where\nδ∗ is the value of δ at the moment of the closest\napproach. For instance, at the orbital phase 185◦ ,\nδ∗ ∼ 95◦ and at 305◦ , δ∗ ∼ 145◦ . Therefore, δ∗\nvaries within [95◦ , 145◦] and [145◦ , 180◦ ] for BP1\nand BP2 respectively.\nWe calculated the deflection angle αdef l using\ntwo different methods. We used a simple analytical estimation for the simplified D61 model,\nwhile employing more complex numerical calculations for the modified TS02 model. In the D61\nmodel, the system is characterized by three main\nparameters: the magnetic moment of the pulsar,\n~ w , and the angle\nthe magnetic field in A's wind B\nbetween the two. Neither of the models depend on\nthe absolute values of the pulsar and wind's magnetic fields. In both cases, only the ratio of these\ntwo fields matter. This boils down to the assump-\n\ndr\nrdλ\n= tot\nBrtot\nBλ\n\n(22)\n\nwhere λ is the colatitude and is equal to 90◦ at\nthe equator and to zero along the magnetic axis,\nwhich is the same colatitude angle that defined in\nequation (5). The angle between the local tangent\nto the field line and the vector ~r can be approximated as rdλ/dr. In order to find the deflection\nangle of the polar field line due to the distortions\nby the wind, we consider the change in rdλ/dr.\n\nαdef l =\n\n\u0012\n\nrdλ\ndr\n\n\u0013\n\n−\n\n\u0012\n\nBλp + Bλw\nBrp + Brw\n\ndistorted\n\n\u0012\n\nrdλ\ndr\n\n\u0013\n\n−\n\n\u0013\n\n.\n\nundistorted\n\n(23)\nAs a superposition of the pulsar's dipolar and wind\nmagnetic fields we take a simple addition of the\ntwo. Therefore, it follows from the equation (22)\nthat\nαdef l =\n\n\u0012\n\nBλp\nBrp\n\n\u0013\n\n.\n\n(24)\n\nHere, Brp ,Bλp and Brw , Bλw are r and λ components of the pulsar and wind magnetic fields, re22\n\n\fFig. 12.- Schematic view of the deflection of the emission direction by the wind. (a) and (c) show the\nconfiguration of the main axes of an isolated pulsar, with different orientation of the spin axis, however. (b)\nand (d) show the same picture with an addition of the wind from the companion, for the same configuration\nof axes as (a) and (c) respectively. Grey-shaded ribbon-type surfaces are the traces of the cross-section of\nthe emission beam. If the line-of-sight intersects this surface then the observer detects the radio emission.\nIn case of (a) and (b), the orientation of the line-of-sight with respect to the spin axis and magnetic axis is\nsuch that it does not intersect with the grey-shaded surface after distortion, as shown on (b). This is not the\ncase for (c) and (d) where the line-of-sight intersects with the grey-shaded surfaces, even after distortion.\n\n23\n\n\fspectively. The angle between the local components of the fields can be either δ∗ + λ + 90◦ or\n90◦ − (δ∗ + λ), depending on the orientation of the\ntoroidal field. Thus, in the frame of the dipole,\nthe magnetic field components can be expressed\nas follows\nμ0 m cos λ\n2π r3\nsin λ\nμ\nm\n0\nBλp =\n4π r3\nw\nBr = ∓B0w sin(λ + δ∗ )\n\n(27)\n\nBλw = ∓B0w cos(λ + δ∗ ).\n\n(28)\n\nBrp = −\n\nWe can rewrite equation (33) in terms of normal1/3\nized distance r̄ ≡ r/rs , where rs = (μ0 m/2πB0w )\n9\nis a stand-off distance (rs ∼ 4 × 10 cm as estimated from our boundary model),\nαdef l =\n\nμ0 m 1\n2π r3\n\n(26)\n\nr̄3 cos δ∗\n> 14.3◦ .\n1 + r̄3 sin δ∗\n\n(30)\n(31)\n\nBλw = −B0w cos δ∗ .\n\n(32)\n\n−r̄3 cos δ∗\n> 14.3◦ .\n1 − r̄3 sin δ∗\n\nB0w cos δ∗\n.\n+ B0w sin δ∗\n\nμ0 m 1\n2π r 3\n\n(36)\n\nThe minimum of the values of r̄ that satisfy equations (35) or (36) for any δ∗ corresponding to BP1\nand BP2 is the best upper limit we can put on\nthe emission height with this approach. In Figure 13, we show the solutions of the equation (35)\nand (36), represented by the shaded areas over the\ncontours of constant deflection angle of 14.3◦ . As\nwe can see in Figure 13, both orientations of the\nwind magnetic field produce almost the same upper limit, which is ∼ 2500RN S . This value corresponds to δ∗ ∼ 170◦ − 180◦ , i.e. when pulsar B, pulsar A and the Earth are nearly aligned,\nwhere pulsar B is in BP2 region. This is consistent with the method by which we estimate an\nupper limit. At superior conjunction, the wind\nmagnetic field is perpendicular to the magnetic\naxis, resulting in the largest distortion of the polar\nfield lines. Therefore, the distance from the star\nsurface, above which the deflection is more than\n14.3◦ , is smallest at superior conjunction.\nWe can use the same criteria to set an upper\nlimit on the emission height using the numerical TS02 model. We require that the numerically\ncalculated distortion angle of the polar field line\nmust not exceed the angular radius of the beam\n\nHere, we are only with left the upper signs in the\nsecond pair of equations. We get an approximate\nexpression for the deflection angle by substituting\n(29)-(32) into (24)\nαdef l =\n\n(35)\n\nBy replacing δ∗ with δ∗ + 180◦ , we get the detectability criteria for the retrograde configuration\n\n(29)\n\nBλp = 0\nBrw = −B0w sin δ∗\n\n(34)\n\nFrom the criteria for the pulsed radio emission detectability, it follows that the values of r̄ for which\nαdef l > 14.3◦ must be excluded as possible emission heights. To find such values of r̄ for any δ∗ ,\nwe use the condition that the absolute value of the\nright-hand side of the equation (34) must exceed\n14.3◦ . Hence, in the case of a prograde toroidal\nfield we have\n\n(25)\n\nHere, m is a magnetic moment of pulsar B while\nB0w is a strength of the wind magnetic field. The\nwind magnetic field structure is believed to be\ntoroidal. However, for the sake of simplicity, we\nassumed a locally uniform wind field across the\nwhole magnetosphere of B, which is feasible since\nthe radius of the light cylinder is much smaller\nthan the orbital radius. In the equations (27) and\n(28), Brw and Bλw can switch signs depending on\nwhether the large scale toroidal field of the wind\nis prograde with respect to the orbital motion of\nthe pulsars or retrograde. Mathematically it is\nequivalent to replacing δ∗ with δ∗ + 180◦ . Below,\nwe derive the approximate expression for αdef l for\nthe upper signs in the equations (27) and (28) and\nonly in the end substitute δ∗ + 180◦ instead of δ∗\nto account for both cases.\nIt is reasonable for our case (αdef l ≤ 14.3◦ ) to\nlimit our estimations to the field lines close to the\nmagnetic axis, i.e. λ ∼ 0◦ . Then we can rewrite\nthe equations (25)-(28) in the following way\nBrp = −\n\nr̄3 cos δ∗\n.\n1 + r̄3 sin δ∗\n\n(33)\n\n24\n\n\fFig. 13.- Excluded values of the radio emission height calculated by using the analytical D61 model.\nThe curtain-shaped shaded areas represent the domains for emission height and δ ∗ for which the deflection\nangle exceeds 14.3◦ . The area with blue stripes leaned to the left corresponds to the prograde configuration\n(equation 35), while the area with green stripes leaned to the right corresponds to the retrograde configuration\n(equation 36). The shaded areas between the vertical dashed lines represent the values of δ ∗ valid for the\nanalysis (i.e. those corresponding to BP1 and BP2). The black triangle marks the minimum value of\n∼ 2500N S radii within the shaded range of δ ∗ . Thus, 2500N S radii is the best upper limit for the emission\nheight within the D61 model.\n\n25\n\n\fsystem provides a unique opportunity to study\ndifferent emission regions of the magnetosphere\ndue to precession. Also, the magnetosphere is distorted, exhibiting a complicated field line structure, due to the wind of A. These distortions depend on the orbital and rotational phases of B.\nObservations of these distortions, not observed\nin isolated pulsars, via the orbital variations of\nthe radio intensity of B allow us to pinpoint the\nlocation of radio emission.\nWe have applied a simple wind-magnetosphere\ninteraction model to determine the boundary of\nthe magnetosphere of B. The best solution describes the shape of the boundary as a polynomial,\nwith coefficients dependent on the angle between\nthe magnetic axis and the line connecting the two\npulsars. Furthermore, the boundary was not axially symmetric, but for simplicity we modified it\nto be symmetric. The stand-off distance ranges\nfrom 3.8 − 4.5 × 109 cm according to the orientation of the magnetic axis with respect to the line\nconnecting two pulsars, resulting in a size of the\npolynomial boundary of less than 30% of the light\ncylinder radius. However, this size is three times\nlarger than the size inferred from eclipses of A.\nThus, a possible explanation for this is that the\nparticle density in the magnetosphere of B falls\noff significantly as a function of the radial distance\nfrom the center of the pulsar, so that the radiation\nof A penetrates the outer regions of B's magnetosphere.\nMoreover, the variation of the boundary will\nchange the shape of the open field line region. As\na result, the spin-down luminosity of B can vary\nslightly due to the variation in the area of the polar\ncap. This causes a 1.5% periodic variation in the\nspin-down luminosity. It can also lead to a correction on the spin phase, but this is very small\n(Gourgouliatos et al. 2011). Thus we did not consider this effect in our model.\nAs we determined, the range of the allowed\nemission height depends on the orbital motion\ndue to the relative orientation of the magnetic\naxis with respect to the boundary. Also, precession changes the location of the spin axis, so that\nthe emission height changes with time. In both\nof these variations, we have been calculating the\nemission heights for both the leading and the trailing edges of the conal elliptical beam. For a normal pulsar with its light-cylinder boundary, these\n\n(ρa,10 ≃ 14.3◦ ). This allows us to find the maximum emission height for each value of δ∗ .\nUsing the modified TS02 code, we can trace any\nfield line (particularly polar field lines) of B's distorted magnetosphere for any orientation of the\nmagnetic axis with respect to A's wind. This\nmeans that we can calculate the deflection angle\nfor any δ∗ at any altitude. The 14.3 contour on\nFigure 14 shows the altitudes at which the deflection angle equals 14.3◦ for all values of δ∗ . The altitude with the lowest value amongst others is the\nbest upper limit we can put on the emission height.\nSince we can only consider δ∗ 's corresponding to\nBP1 and BP2, the resultant best upper limit of the\nemission height would be 2500RN S for δ∗ ∼ 95◦\n(orbital phase of 185◦, which is in BP1)(see Figure\n14).\nIn summary, we adapted the models of the\nEarth's distorted magnetosphere to the double\npulsar system, based on the similarities between\nthe two. We adjusted the spin-orbital and magnetic field parameters corresponding to the observational data. Both magnetospheric models, the\nanalytic D61 and numerical TS02, draw simplified\nand very extreme pictures of the double pulsar.\nNevertheless, both models offer an improvement\nover a simple dipole and allow us to set an upper\nlimit on the altitude of the emission region using\na novel technique. Moreover, they would greatly\ncompliment each other if somehow unified into one\nmodel.\nWe used the criteria of the pulsar emission detectability to estimate an upper limit of the emission height. This requires the distortion angle of\nthe polar field line not to exceed the angular radius of the beam, derived from the observational\ndata.\nMoreover, we arrived at similar results by employing two very different models; the analytical, highly resistive Dungey type model and the\nnumerical, fully screened modified TS02 model.\nBoth approaches led to the conclusion that B's\nradio emission is generated within the inner 22%\nof the light cylinder.\n7.\n\nDiscussion\n\nThe determination of radio pulsar emission\nheights is important for understanding their emission mechanisms. Pulsar B of the double pulsar\n26\n\n\fFig. 14.- Fixed value contours for the deflection angle calculated by using the modified TS02 model. Each\ncontour shows the upper limits to the emission region height for the corresponding value of the deflection\nangle and δ ∗ . The shaded area between the vertical dashed lines represents the values of δ ∗ valid for the\nanalysis (i.e. those corresponding to BP1 and BP2). The black triangle on the 14.3◦ contour marks the\nminimum value of 2500 NS radii within the shaded range of δ ∗ . Thus, 2500 NS radii is the best upper limit\nfor the emission height within the modified TS02 model.\n\n27\n\n\ftwo edges give the same height due to cylindrical\nsymmetry. When the impact parameter is equal\nto the angular radius of the beam across the semimajor axis, we would detect a single-peak profile,\nresulting in one emission height. Figure 7 shows\nthat the relative heights of emission due to the\ntwo components of the beam switch in the two\nbright phase regions since the orientation of the\nboundary changes throughout the orbit. These estimated emission heights are about 1% of the light\ncylinder radius or 4% of the stand-off distance.\nAgain, these should be considered lower limits if\nthe emission does not originate on the last closed\nfield line. Moreover, the analytical and numerical\napproaches to the upper limit estimate lead to the\nconclusion that pulsar B's radio emission is generated within 22% of the light cylinder.\nIn normal pulsars, radio emission heights have\nbeen calculated by using their geometry and the\npulse profile widths (Kijak & Gil 1997). These\nrange from about 10 to 100 RN S , less than 10%\nof the light cylinder radius. Our emission height\nestimates are consistent with these results. Thus\nthe radio emission produced by B likely has the\nsame mechanism as for isolated pulsars, which is\nconsistent with Lyutikov (2005). Most theories of\npulsar radio emission place the generation region\nclose to the star, typically within one stellar radius\n(e.g. Melrose 1995). In contrast, a model based\non the anomalous cyclotron-Cherenkov resonance\n(Machabeli & Usov 1979; Lyutikov et al. 1999) requires emission to be generated much higher up in\nthe magnetosphere, at hundreds of stellar radii.\nThe fairly high emission altitudes of radio emission inferred in the present paper are consistent\nwith the latter models.\nThe magnetospheres of pulsars can be distorted\ndue to rotation as proposed in Dyks & Harding\n(2004), resulting in a rotational sweepback of the\nmagnetic field lines. They found that at low altitude the rotation deflects the local direction of\nthe magnetic field line by at most an angle of the\norder of (r/RLC )2 , where r is the radial distance\nof the field line. We applied this rotational sweepback model to pulsar B along with our boundary\nmodel and found that the rotational sweepback is\nvery small, because the deflection of the magnetic\nfield line from its local direction is of order 0.1\nradians. The estimated upper limit for the emission height implies that this effect is less than 0.05\n\nradians, negligible compared to the distortions by\nthe wind. However, this effect is significant when\nthe radial distance of the field is close to the light\ncylinder, so that it is important in normal pulsars.\nThe relativistic phase-shift method can be used\nto determine the radio emission heights of pulsars\nas described in Gangadhara & Gupta (2001) and\nDyks et al. (2004). This method uses aberration\nand retardation effects to explain the observed\npulse phase shift of pulse profiles containing core\nand conal components. We applied this method to\nthe double-peaked pulse profiles of pulsar B to estimate the emission height. Because pulsar B has\nonly a conal component, we assumed that pulse\nphase of zero was at the minimum between the\ntwo peaks. Then the phase-shift is measured from\nthe two peaks, leading and trailing, with respect to\nthis reference phase. The calculation shows that\nthe phase-shift method does not work for pulsar B.\nFor example, the emission height on MJDs 53860\nand 53939 is 6 and 23 NS radii, respectively. On\nMJD 54050 it is zero due to zero phase shift. Also\non MJD 54400, the phase of trailing component is\nlarger than the absolute phase of leading component, so that the emission height becomes negative. The reason of these calculated height fluctuations is that the pulse profile of B is not stable\nand varies significantly. Therefore, it is difficult to\nmeasure the shift in pulse phase accurately. Also,\nas there are only two peaks in the pulse profile\nof B, the determination of the pulse phase zero\nreference point is difficult. Therefore, the measured shifts and then the emission heights may\nnot be correct, concluding that this method cannot be used to constrain emission heights of pulsar\nB. However, this is a useful method of estimating\nemission heights of normal pulsars which have stable pulse profiles with both core and conal emission components (Gupta & Gangadhara 2003).\nIn summary, by using the method presented in\nthis paper, we can place limits on the radio emission height for any pulsar with well-determined\nemission geometry. The advantage of this method\nis that by estimating the field-line constant by\ntracing the magnetic field lines, we can constrain\nthe emission heights of pulsars which have high\nmagnetic inclinations that make them unsuitable\nfor the other methods. Our radio emission height\nestimations for pulsar B will be useful for future\nstudies and in particular can be used to constrain\n28\n\n\fGourgouliatos, K. N., Lyutikov, M., Lomiashvili,\nD., & Perera, B. B. P. 2011, in American Institute of Physics Conference Series, Vol. 1357,\nAmerican Institute of Physics Conference Series, 304–305\n\nproposed geometrical models such as Lyutikov\n(2005) and Freire et al. (2009) in order to accurately explain the observations.\nBBPP is supported by NRAO student observing support and MAM is supported by a WV EPSCoR grant. The National Radio Astronomy Observatory is a facility of the National Science Foundation operated under cooperative agreement by\nAssociated Universities, Inc.\n\nGupta, Y., & Gangadhara, R. T. 2003, ApJ, 584,\n418\nHankins, T. H., Rankin, J. M., & Eilek, J. A.\n2009, in ArXiv Astrophysics e-prints, Vol. 2010,\nastro2010: The Astronomy and Astrophysics\nDecadal Survey, 112–+\n\nREFERENCES\nBarker, B. M., & O'Connell, R. F. 1975, Phys.\nRev. D, 12, 329\n\nKijak, J., & Gil, J. 1997, MNRAS, 288, 631\nKijak, J., & Gil, J. 2003, ApJ, 397, 969\n\nBreton, R. P., et al. 2008, Science, 321, 104\n\nKramer, M., et al. 2006, Science, 314, 97\n\nBurgay, M., et al. 2003, Nature, 426, 531\n\nLyne, A. G., et al. 2004, Science, 303, 1153\n\nClifton, T., & Weisberg, J. M. 2008, ApJ, 679, 687\n\nLyutikov, M. 2004, MNRAS, 353, 1095\n\nContopoulos, I., & Spitkovsky, A. 2006, ApJ, 643,\n1139\n\n-. 2005, MNRAS, 362, 1078\nLyutikov, M., Blandford, R. D., & Machabeli, G.\n1999, MNRAS, 305, 338\n\nDemorest, P., Ramachandran, R., Backer, D. C.,\nRansom, S. M., Kaspi, V., Arons, J., &\nSpitkovsky, A. 2004, ApJL, 615, L137\n\nMachabeli, G. Z., & Usov, V. V. 1979, SvAL, 5,\n238\n\nDeutsch, A. J. 1955, Annales d'Astrophysique, 18,\n1\n\nMelrose, D. B. 1995, JApA, 16, 137\n\nDungey, J. W. 1961, Phys. Rev. Lett., 6, 47\n\nMitra, D., & Rankin, J. M. 2002, ApJ, 577, 322\n\nDyks, J., & Harding, A. K. 2004, ApJ, 614, 869\n\nPerera, B. B. P., et al. 2010, ApJ, 721, 1193\n\nDyks, J., Rudak, B., & Harding, A. K. 2004, ApJ,\n607, 939\n\nRadhakrishnan, V., & Cooke, D. J. 1969, ApJ, 3,\n225\n\nForbes, T. G., & Speiser, T. W. 1971, Journal of\nGeophysical Research, 76, 7541\n\nRankin, J. M. 1990, ApJ, 352, 247\nSpitkovsky, A. 2006, ApJL, 648, L51\n\nFreire, P. C. C., Wex, N., Kramer, M., Lorimer,\nD. R., McLaughlin, M. A., Stairs, I. H., Rosen,\nR., & Lyne, A. G. 2009, MNRAS, 396, 1764\n\nTsyganenko, N. A. 2002a, Journal of Geophysical\nResearch (Space Physics), 107, 1179\n\nGangadhara, R. T. 2004, ApJ, 609, 335\n\n-. 2002b, Journal of Geophysical Research (Space\nPhysics), 107, 1176\n\nGangadhara, R. T., & Gupta, Y. 2001, ApJ, 555,\n31\n\nTsyganenko, N. A., & Sitnov, M. I. 2007, Journal\nof Geophysical Research (Space Physics), 112,\nA06225\n\nGil, J., Gronkowski, P., & Rudnicki, W. 1984,\nA&A, 132, 312\nGil, J., & Kijak, K. 1993, A&A, 273, 563\n\nThis 2-column preprint was prepared with the AAS LATEX\nmacros v5.2.\n\n29\n\n\f"}