{"id": "http://arxiv.org/abs/1002.0836v1", "guidislink": true, "updated": "2010-02-03T22:47:00Z", "updated_parsed": [2010, 2, 3, 22, 47, 0, 2, 34, 0], "published": "2010-02-03T22:47:00Z", "published_parsed": [2010, 2, 3, 22, 47, 0, 2, 34, 0], "title": "CMB Isotropy Anomalies and the Local Kinetic Sunyaev-Zel'dovich Effect", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1002.2569%2C1002.4459%2C1002.4895%2C1002.2193%2C1002.4337%2C1002.3832%2C1002.1637%2C1002.1120%2C1002.0310%2C1002.1935%2C1002.1697%2C1002.0742%2C1002.0586%2C1002.2791%2C1002.3073%2C1002.3868%2C1002.3412%2C1002.0423%2C1002.1947%2C1002.2990%2C1002.2450%2C1002.3855%2C1002.4287%2C1002.1445%2C1002.0836%2C1002.4067%2C1002.2198%2C1002.3473%2C1002.2866%2C1002.3431%2C1002.1456%2C1002.3747%2C1002.0457%2C1002.4201%2C1002.2784%2C1002.0171%2C1002.2977%2C1002.4317%2C1002.3783%2C1002.0021%2C1002.0652%2C1002.1068%2C1002.1975%2C1002.2157%2C1002.3051%2C1002.4203%2C1002.2270%2C1002.0957%2C1002.2953%2C1002.4090%2C1002.3421%2C1002.0717%2C1002.3357%2C1002.1046%2C1002.0342%2C1002.1221%2C1002.1801%2C1002.3019%2C1002.1244%2C1002.2228%2C1002.4407%2C1002.2426%2C1002.4280%2C1002.3916%2C1002.2912%2C1002.2792%2C1002.2623%2C1002.0139%2C1002.2365%2C1002.0398%2C1002.3996%2C1002.2351%2C1002.3666%2C1002.1558%2C1002.0159%2C1002.1738%2C1002.0656%2C1002.3958%2C1002.3903%2C1002.3566%2C1002.0436%2C1002.0043%2C1002.1572%2C1002.3772%2C1002.2932%2C1002.0056%2C1002.1976%2C1002.3460%2C1002.1308%2C1002.4714%2C1002.1188%2C1002.4213%2C1002.3210%2C1002.0219%2C1002.2560%2C1002.0719%2C1002.5003%2C1002.2411%2C1002.4683%2C1002.4576%2C1002.3753&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "CMB Isotropy Anomalies and the Local Kinetic Sunyaev-Zel'dovich Effect"}, "summary": "Several anomalies have been identified which may imply a breakdown of the\nstatistical isotropy of the cosmic microwave background (CMB). In particular,\nan anomalous alignment of the quadrupole and octopole and a hemispherical power\nasymmetry have increased in significance as the data have improved. There have\nbeen several attempts to explain these observations which explore isotropy\nbreaking mechanisms within the early universe, but little attention has been\ngiven to the possibility that these anomalies have their origin within the\nlocal universe. We explore such a mechanism by considering the kinetic\nSunyaev-Zel'dovich effect due to a gaseous halo associated with the Milky Way.\nConsidering several physical models of an anisotropic free electron optical\ndepth contributed by such a halo, we find that the associated screening maps of\nthe primordial anisotropies have the necessary orientations to affect the\nanomaly statistics very significantly, but only if the column density of free\nelectrons in the halo is at least an order of magnitude higher than indicated\nby current observations.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1002.2569%2C1002.4459%2C1002.4895%2C1002.2193%2C1002.4337%2C1002.3832%2C1002.1637%2C1002.1120%2C1002.0310%2C1002.1935%2C1002.1697%2C1002.0742%2C1002.0586%2C1002.2791%2C1002.3073%2C1002.3868%2C1002.3412%2C1002.0423%2C1002.1947%2C1002.2990%2C1002.2450%2C1002.3855%2C1002.4287%2C1002.1445%2C1002.0836%2C1002.4067%2C1002.2198%2C1002.3473%2C1002.2866%2C1002.3431%2C1002.1456%2C1002.3747%2C1002.0457%2C1002.4201%2C1002.2784%2C1002.0171%2C1002.2977%2C1002.4317%2C1002.3783%2C1002.0021%2C1002.0652%2C1002.1068%2C1002.1975%2C1002.2157%2C1002.3051%2C1002.4203%2C1002.2270%2C1002.0957%2C1002.2953%2C1002.4090%2C1002.3421%2C1002.0717%2C1002.3357%2C1002.1046%2C1002.0342%2C1002.1221%2C1002.1801%2C1002.3019%2C1002.1244%2C1002.2228%2C1002.4407%2C1002.2426%2C1002.4280%2C1002.3916%2C1002.2912%2C1002.2792%2C1002.2623%2C1002.0139%2C1002.2365%2C1002.0398%2C1002.3996%2C1002.2351%2C1002.3666%2C1002.1558%2C1002.0159%2C1002.1738%2C1002.0656%2C1002.3958%2C1002.3903%2C1002.3566%2C1002.0436%2C1002.0043%2C1002.1572%2C1002.3772%2C1002.2932%2C1002.0056%2C1002.1976%2C1002.3460%2C1002.1308%2C1002.4714%2C1002.1188%2C1002.4213%2C1002.3210%2C1002.0219%2C1002.2560%2C1002.0719%2C1002.5003%2C1002.2411%2C1002.4683%2C1002.4576%2C1002.3753&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Several anomalies have been identified which may imply a breakdown of the\nstatistical isotropy of the cosmic microwave background (CMB). In particular,\nan anomalous alignment of the quadrupole and octopole and a hemispherical power\nasymmetry have increased in significance as the data have improved. There have\nbeen several attempts to explain these observations which explore isotropy\nbreaking mechanisms within the early universe, but little attention has been\ngiven to the possibility that these anomalies have their origin within the\nlocal universe. We explore such a mechanism by considering the kinetic\nSunyaev-Zel'dovich effect due to a gaseous halo associated with the Milky Way.\nConsidering several physical models of an anisotropic free electron optical\ndepth contributed by such a halo, we find that the associated screening maps of\nthe primordial anisotropies have the necessary orientations to affect the\nanomaly statistics very significantly, but only if the column density of free\nelectrons in the halo is at least an order of magnitude higher than indicated\nby current observations."}, "authors": ["Hiranya V. Peiris", "Tristan L. Smith"], "author_detail": {"name": "Tristan L. Smith"}, "author": "Tristan L. Smith", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevD.81.123517", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1002.0836v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1002.0836v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "10 pages, 4 figures", "arxiv_primary_category": {"term": "astro-ph.CO", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph.CO", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1002.0836v1", "affiliation": "UC Berkeley", "arxiv_url": "http://arxiv.org/abs/1002.0836v1", "journal_reference": "Phys.Rev.D81:123517,2010", "doi": "10.1103/PhysRevD.81.123517", "fulltext": "CMB Isotropy Anomalies and the Local Kinetic Sunyaev-Zel'dovich Effect\nHiranya V. Peiris1, 2, ∗ and Tristan L. Smith3, †\n1\n\narXiv:1002.0836v1 [astro-ph.CO] 3 Feb 2010\n\nInstitute of Astronomy and Kavli Institute for Cosmology,\nUniversity of Cambridge, Cambridge CB3 0HA, U.K.\n2\nDepartment of Physics and Astronomy, University College London, London WC1E 6BT, U.K.\n3\nBerkeley Center for Cosmological Physics, University of California, Berkeley, CA 94720 U.S.A.\nSeveral anomalies have been identified which may imply a breakdown of the statistical isotropy of\nthe cosmic microwave background (CMB). In particular, an anomalous alignment of the quadrupole\nand octopole and a hemispherical power asymmetry have increased in significance as the data have\nimproved. There have been several attempts to explain these observations which explore isotropy\nbreaking mechanisms within the early universe, but little attention has been given to the possibility\nthat these anomalies have their origin within the local universe. We explore such a mechanism by\nconsidering the kinetic Sunyaev-Zel'dovich effect due to a gaseous halo associated with the Milky\nWay. Considering several physical models of an anisotropic free electron optical depth contributed\nby such a halo, we find that the associated screening maps of the primordial anisotropies have the\nnecessary orientations to affect the anomaly statistics very significantly, but only if the column\ndensity of free electrons in the halo is at least an order of magnitude higher than indicated by\ncurrent observations.\nI.\n\nINTRODUCTION\n\nHigh-precision measurements of the cosmic microwave\nbackground (CMB) anisotropies and the agreement of\nthese observations with our theoretical expectations has\nelevated cosmology to a precision science. The observed\nanisotropies have been measured to follow isotropic,\nGaussian statistics with an almost scale-invariant powerspectrum. However, as observations have improved,\nanomalies which might indicate deviations from the theoretical expectations have increased in significance. Prosaic explanations for the observed anomalies may yet be\nfound as our understanding of the systematics of the observations improves, but it is also of interest to explore\nwhether these anomalies point us towards exotic and unexpected physics.\nOne such anomaly is the apparent breakdown of statistical isotropy that has been reported in the CMB fluctuations at the largest observable scales [1–5] measured by\nthe Wilkinson Microwave Anisotropy Probe (WMAP).\nTwo major observations1 that are suggestive of this statistical anisotropy refer to particular special directions\nin the sky. The first is the planarity of the quadrupole\nand octopole and their mutual alignment; this plane is\nalso roughly orthogonal to the CMB dipole direction\n[1, 2, 5]. The second is an asymmetry in the amplitude\nof the power spectrum between the northern and southern ecliptic hemispheres [3] which has also been observed\n\n∗ Electronic\n\naddress: h.peiris@ucl.ac.uk\naddress: tlsmith@berkeley.edu\nA quadrupolar anisotropy of the inferred primordial power spectrum has also been reported [6–8], which is aligned with the ecliptic. However, this signal shows significant variations between\ndifferent WMAP differencing assemblies at the same frequency\n[7], pointing to an experimental systematic which has not been\ntaken into account in these analyses.\n\n† Electronic\n1\n\nin Cosmic Background Explorer (COBE) data but at a\nlower significance [3].\nWith the evidence for these anomalies increasing as the\ndata improves [9, 10] many studies have proposed modifications of early-universe physics in order to generate\na violation of statistical isotropy (see Refs. [11–14] for a\nsmall selection). There have also been discussions of how\na violation of statistical isotropy would affect other observations assuming that its source is primordial [8, 15–17],\nenabling consistency tests of those hypotheses.\nHowever, soon after these anomalies were discovered,\nit was noticed that the directions associated with them\ncorresponded to special directions within the local universe: four of the planes associated with the quadrupole\nand octopole are orthogonal to the ecliptic, the remaining\noctopole plane is orthogonal to the Galactic plane, and\nthe hemispherical asymmetry is aligned with the ecliptic.\nThe heuristic connection between these CMB anomalies\nand our local environment has generated only a handful\nof quantitative attempts to connect the two, including\npossible foregrounds associated with the heliosphere [18],\nthe kinetic Sunyaev-Zel'dovich effect of free electrons in\nthe Galactic disk [19, 20], the thermal Sunyaev-Zel'dovich\neffect of the local universe [21, 22], the Rees-Sciama effect\nof the local superclusters [23], and the Integrated SachsWolfe effect of the low-redshift universe [24]. This is an\narea which deserves greater attention, since a very local\nsignal can affect the largest observable scales.\nIn this paper, we explore another possible local origin of the anomalies by investigating how the scattering\nof CMB photons by free electrons diffusely distributed\nwithin the Milky Way halo through the kinetic SunyaevZel'dovich (kSZ) effect may introduce an anisotropic contamination of the primordial signal and help explain the\norigin of the anomalies and their alignment with special\ndirections in the local universe. The effects of the kSZ\nfrom the Galactic halo on the CMB has been recently\ndiscussed in Ref. [25]. However Ref. [25] did not explore\n\n\f2\nhow the kSZ may impact these anomalies and instead\nconcentrated on whether the local kSZ may produce a\nforeground that must be subtracted in order to extract\nthe primordial signal.\nThe prediction of an extended gaseous halo within the\nMilky Way is quite robust. Models of galaxy formation\nfor halos with masses M & 1012 M predict infalling\ngas is shock-heated to the virial temperature (around\n106 − 107 K for the Milky Way) and remains in hydrostatic equilibrium until it is able to cool and condense\nto form stars [26, 27]. For a Milky Way-sized halo it is\nexpected that the baryonic mass fraction follows the cosmic average, f ∼ 0.1. By subtracting the total baryonic\nmass in stars and gas in the Galaxy, a reasonable estimate of the baryonic mass in an extended, hot, gaseous\nhalo is ∼ 5 × 1010 M [25]. Observations of OVII and\nOVIII X-ray absorption have also indicated the existence\nof an extended hot gaseous halo [28] associated with the\nMilky Way. Furthermore, observations of pulsars yield\nestimates for the column density of free electrons and\nlead to a free-electron fraction within the Milky Way halo\nwhich is consistent with a hot gaseous halo with a column\ndensity of ∼ 1021 cm−2 [29]. Given that the Milky Way is\nmoving relative to the CMB with a velocity v/c ∼ 10−2 ,\nthe local kSZ may produce a signal around 1 μK.\nIn § II we point out that any anisotropic optical\ndepth to Thomson scattering off local electrons, coupled\nthrough the kSZ effect with the dipole of the local electrons with respect to the CMB, induces an anisotropic\nimprint with a black-body spectrum. Its alignment is\ndetermined by the dipole direction and the anisotropy of\nthe distribution. Given that the kSZ is expected to be\nsubdominant to the cosmological signal, in § III we point\nout the disproportionate impact on anomaly statistics of\nsmall signals. We make no judgement on the usefulness\nor otherwise of such a posteriori anomaly statistics (for a\npost-WMAP 7 year discussion of this point, see Ref. [30]).\nInstead, we take at face value anomaly statistics which\nhave been invoked in a large body of literature, and study\nthe impact of the kSZ signal on their significance. In § IV\nwe derive the coupling of an anisotropic electron screen\nto the Doppler dipole, and consider several physical models of the form of the anisotropic electron distribution in\n§ V. We compute the impact of these halo kSZ models\non anomaly statistics in § VI, and discuss the results in\n§ VII.\n\nII.\n\nEFFECT OF LOCAL KSZ ON CMB\nANISOTROPIES\n\nA simple way to understand how an anisotropic optical\ndepth leads to additional anisotropy in the CMB is to\nnote that along a given line of sight, n̂, with optical depth\nτ (n̂), the fraction of photons which scatter out of the line\nof sight is given by\nh\ni\u0002\n\u0003\n1 − e−τ (n̂) T̄ + ∆T (n̂) ,\n(1)\n\nwhere ∆T (n̂) is the temperature anisotropy along that\nline of sight. In addition, there are photons that scatter\nin to the line of sight isotropically from every other part\nof the sky; thus, they contribute the mean temperature,\nT̄ , and the observed temperature anisotropy is [31]\nh\ni\u0002\n\u0003\nTobs = (T̄ + ∆T ) − 1 − e−τ (n̂) T̄ + ∆T\nh\ni\n+T̄ 1 − e−τ (n̂)\n= T̄ + ∆T (n̂)e−τ (n̂) .\n\n(2)\n\nFrom this simple calculation we can see that an\nanisotropic optical depth will couple with any inherent\ntemperature anisotropies and thereby modulate the observed anisotropy.\nA more rigorous way to derive the same result is to\nconsider the Boltzmann equation which dictates the evolution of the photon distribution function. In cosmology the application of the Boltzmann equation leads to\nthe usual evolution equations for the photon distribution function within a perturbed Friedmann-RobersonWalker (FRW) universe [32, 33]. It can also be used to\ndescribe the evolution of the photon distribution function as the photons pass through the Milky Way's halo.\nDenoting perturbations to the photon temperature by\nT̄ Θ(t, x, n̂) the Boltzmann equation gives\ndΘ\n∂Θ\n=\n− n̂ * ∇Θ\n(3)\ndt\n∂t\n\u0012\nZ\n\u0002\n\u0003\n3\n= σT ne − Θ +\nd2 m̂ Θ(m̂) 1 + (n̂ * m̂)2\n16π\n\u0013\n−n̂ * v b /c ,\nwhere the first term describes scattering out of the line\nof sight, the second term is due to scattering into the\nline of sight, the last term is the Doppler shift due to\nthe bulk motion of the electrons (with velocity v b in the\nCMB rest-frame). The Thomson scattering cross-section\nis σT = 6.65 × 10−25 cm2 .\nAny optical depth contributed by free electrons within\nthe Milky Way halo will be much smaller than unity so\nwe may solve Eq. (3) perturbatively. The zeroth order\nsolution follows dΘ(0) /dt = 0. We then find the first\norder correction to this\nZ\n∂ Θ̃(1) (k)\n− ikμΘ̃(1) (k) = d3 x eik*x σT ne (x)S (0) (x, n̂),\n∂t\n(4)\n(0)\nwhere μ = n̂ * k̂ and S\nis the term in parentheses\nin Eq. (3) evaluated for the zeroth-order solution. In\nthe case of the CMB this term is approximately given by\nS (0) = −n̂*v b since vb /c = 6×10−3 [34] and Θ̃(0) ∼ 10−5 .\nAs can be verified by substitution, the solution to Eq. (4)\nis then given by\nZ ∞\n(1)\nΘ (n̂) = −n̂ * v b σT\nds ne (sn̂),\n(5)\n0\n\n\f3\nwhere the integral extends along the line of sight. The\nobserved temperature pattern is then given by\nZ ∞\nobs\ncos\nΘ\n= Θ − n̂ * v b σT\nds ne (sn̂)\n0\n\n= Θcos − [n̂ * v b ] τ (n̂),\n\n(6)\n\nwhere we have explicitly written Θ(0) = Θcos and ne is\nthe number density of electrons\nR ∞ within the Milky Way\nhalo. Defining C(n̂) ≡ σT 0 ds ne (sn̂), the amplitude\nof the second term in Eq. (6) can be written\nZ ∞\nn̂ * v b σT\nds ne (sn̂)\n0\n\n= 1.33 × 10−6\n\n1021\n\nC(n̂) n̂ * v b\nC ̄\n, (7)\n−2\ncm\nC ̄ 600 km/s\n\nwe have defined the angle averaged C ̄ ≡\nRwhere\n2\nd n̂ C(n̂)/(4π).\nWithout any reference to a specific model for the optical depth, it is clear that the kSZ is capable of producing any modulation of the CMB that we may observe.\nLetting τ (n̂) denote the optical depth as a function of\nposition on the sky, assuming some underlying primordial temperature anisotropies then the optical depth is\ndetermined by\nτ (n̂) =\n\nIII.\n\nΘcos − Θobs\n.\nn̂ * v b\n\n(8)\n\nDISPROPORTIONATE IMPACT OF SMALL\nSIGNALS ON ANOMALY STATISTICS\n\nWhile, in principle, this effect can generate the observed large-angle isotropy anomalies, in practice (given\nthe expected column density of free electrons and the\ndipole velocity of the CMB), estimates of the kSZ are\nat the 1 μK level (compared to the ±20 μK of the\nquadrupole). Given that, at most, the kSZ can produce\n∼ 10% modulations of the primary CMB, it would appear\nas though its effect on the observed anomalies would be\nnegligible. However, as we now discuss, even a 10% modulation can have a large effect on the inferred statistical\nsignificance of these anomalies. Consider the \"angular\nmomentum dispersion\" statistic [2, 15, 35] for quantifying the planarity of multipole `:\nP`\nL2` (n̂)\n\n=\n\n2 obs 2\nm=−` m |a`m |\nP\n`\n2\n`2 m=−` |aobs\n`m |\n\n,\n\n(9)\n\nwhich, given the observed realization on the sky, is maximized in some direction n̂0 . The transformation between\nthe general frame and the maximizing frame is given by\na`m0 =\n\n`\nX\nm=−`\n\n`\nDmm\n0 (φ̃, −θ, −φ) a`m ,\n\n(10)\n\nwhere D is the Wigner matrix corresponding to the appropriate rotation between the frames, and φ̃ can take\nany value. The statistics given by the maximum values\nof L22 , L23 and L223 = L22 + L23 have been used in the literature to quantify the planarity of the quadrupole and\noctopole, and also to capture their mutual alignment, respectively.\nTable I shows the values and p-values for these statistics for the WMAP 7 year Internal Linear Combination (ILC7) foreground-cleaned map [36], with and without subtracting the kinematic quadrupole (KQ). The\np-values are computed from 10,000 isotropic realizations. The kinematic quadrupole induced by the dipole\nanisotropy due to our motion relative to the CMB is\nat the level of −1 μK → +3 μK, whereas the CMB\nquadrupole is at the −22 μK → +16 μK level. The Table shows that the subtraction of the very subdominant\nKQ signal leads to a factor of ∼ 2.7 decrease in the pvalue of the most anomalous statistic, L223 . This effect is\neven more dramatic for the alternative WMAP 5 year\nTegmark-Oliveira-Costa-Hamilton (TOH5) foregroundcleaned map [2], where the maximum value of L223 goes\nfrom 0.93 to 0.96 upon subtracting the KQ. The p-value\ncorresponding to the latter is 0.0029, making the statistic\na factor of 5.5 more unlikely under the null hypothesis of\nisotropy. This dramatic impact of subtracting the small\nKQ signal was also noticed in the WMAP first year data\nby Ref. [37], and is also present in the WMAP 5 year\nILC (ILC5) map [38]. For purposes of comparison, the\np-value for the ILC5-KQ L223 = 0.95 is 0.0062.\nTABLE I: Values and p-values (computed from 10,000\nisotropic realizations) for angular momentum dispersion\nstatistics L22 , L23 and L223 (see text) for the WMAP 7 year\nInternal Linear Combination (ILC7) map, with or without\nsubtracting the kinematic quadrupole (KQ).\nStatistic\nL22\nL23\nL223\n\nILC7\nILC7 ILC7-KQ ILC7-KQ\nmaximum p-value maximum p-value\n0.943\n0.66\n0.983\n0.38\n0.919\n0.17\n0.926\n0.15\n0.931\n0.015\n0.953\n0.0055\n\nGiven these observations, it is very important to quantify the impact of the kSZ effect of the Galactic halo for\ntwo reasons. First, the velocity of the Galactic barycenter with respect to the CMB points in the direction\n(l, b) = (266.5◦ , 29.1◦ ) [39], which is quite close to the\nSolar CMB dipole direction, (263.8◦ , 48.2◦ ) and thus relevant for the orientations picked out by the large-angle\nisotropy anomalies (see Fig. 1). Secondly, measurements\nof the column density of free electrons in the Galactic\nhalo are not very precise and come primarily from theoretical arguments; observational limits are very difficult\nto obtain and the uncertainties on constraints are large\n[40]. Thus, in the following calculations, we will consider\na number of plausible physical models of the geometry of\n\n\f4\nthe halo free electron optical depth, but allow the magnitude of the effect to float somewhat, roughly at the level\nof the KQ amplitude, while keeping it greatly subdominant to the CMB quadrupole/octopole amplitudes.\n\nExpanding T scr in spherical hamonics, we obtain\nZ\nscr\n∗\nT`m\n= e−τ̄ d2 n̂ τ scr (n̂)T dip (n̂)Y`m\n(n̂),\nZ\n∗\n= e−τ̄ (−1)m d2 n̂ τ scr (n̂)T dip (n̂)Y`m\n(n̂),\nX\n= e−τ̄ (−1)m Ad\nτ`1 m1 ×\n\nSD\n\n`1 m 1\n\nZ\n\nGD\n\nGD\nSD\n\nFIG. 1: The WMAP 5 year quadrupole and octopole, with\nthe ecliptic plane (solid line), the Solar system dipole (SD),\nand the Galactic barycenter dipole (GD).\n\n∗\nd2 n̂ Y`1 m1 (n̂)Y10 (n̂)Y`m\n(n̂).\n\n(14)\n\nThe right hand side of this equation can be expressed in\nterms of Wigner 3j symbols using the Gaunt integral\nZ\nd2 n̂ Y`1 m1 (n̂)Y`2 m2 (n̂)Y`3 m3 (n̂) =\nr\n(2`1 + 1)(2`2 + 1)(2`3 + 1)\n×\n4π\n\u0012\n\u0013\u0012\n\u0013\n`1 `2 `3\n`1 `2 `3\n,\n(15)\n0 0 0\nm1 m2 m3\nleading to\nscr\nT`m\n= e−τ̄ (−1)m Ad\n\nX\n\nτ`1 m1 ×\n\n`1 m 1\n\nr\n\nIV.\n\nCOUPLING TO DOPPLER DIPOLE\n\nAfter processing through an anisotropic Thomson scattering screen, an anisotropic temperature field Θ gets\nscreened as Θ(n̂) → Θ(n̂) exp(−τ (n̂)), as we have seen.\nConsider that the electron distribution consists of an\nisotropic part τ̄ and a (small) anisotropy τ scr (n̂). This\ncan be expanded as e−τ (n̂) ' e−τ̄ (1 − τ scr (n̂)), leading to an observed temperature anisotropy Θobs (n̂) =\ne−τ̄ [1 − τ scr (n̂)] Θ(n̂), with the screened component of\nthe temperature field T scr (n̂) = e−τ̄ τ scr (n̂)Θ(n̂).\nLet us expand the anisotropic part of the local optical\ndepth in spherical harmonics,\nτ scr (n̂) =\n\nXX\n\nτ`1 m1 Y`1 m1 (n̂),\n\n(11)\n\n`1 ≥1 m1\n\nwhich we will couple to the Doppler dipole of the CMB,\nT dip (n̂) = Ad Y10 (n̂).\n\n(12)\n\nThe screened temperature field after passing through the\nanisotropic τ scr , assuming this is much smaller than the\nisotropic part of the screening optical depth, is then given\nby\nT scr (n̂) ' e−τ̄ τ scr (n̂)T dip (n̂)\n\n(13)\n\n\u0012\n\u0013\u0012\n\u0013\n3(2`1 + 1)(2` + 1) `1 1 `\n`1 1 `\n,\n0 0 0\nm1 0 −m\n4π\nr\nX\n3(2`1 + 1)(2` + 1)\n= e−τ̄ (−1)m Ad\nτ`1 m\n×\n4π\n`1\n\u0012\n\u0013\u0012\n\u0013\n`1 1 `\n`1 1 `\n,\n(16)\n0 0 0\nm 0 −m\nwhere the second expression has made use of the symmetry property of the Gaunt integral that m1 +m2 +m3 = 0.\nThe first 3j symbol in Eq. (16) enforces the triangle condition `1 = ` ± 1, so finally we obtain\nr\n3\nscr\n−τ̄\nT`m = e Ad\n[C`−1,m τ`−1,m + C`+1,m τ`+1,m ] ,\n4π\n(17)\nwhere\nr\n`2 − m2\n(18)\nC`−1,m =\n4`2 − 1\ns\n(1 + `)2 − m2\nC`+1,m =\n.\n(19)\n(1 + 2`)(3 + 2`)\nRemember that in these expressions, the τ`00 m00 starts at\n`00 = 1. So, T0m ∝ C1m τ1m , T1m ∝ C2m τ2m , T2m ∝\n(C1m τ1m + C3m τ3m ), and so on.\nV.\n\nMODELS FOR ANISOTROPIC FREE\nELECTRON DISTRIBUTIONS\n\nIn this section we consider how an extended gaseous\npartially ionized halo couples the CMB to the Doppler\n\n\f5\ndipole through the kSZ effect, first gaining physical intuition using an analytic toy model of an anisotropic optical\ndepth distribution, and then considering physical models.\n\nA.\n\nSimple geometries for the electron distribution\n\nLet us develop a feel for some simple, plausible electron distributions. Consider τ (θ, φ), a smooth function\ndefined on the unit sphere, with (0 ≤ θ ≤ π, 0 ≤ φ ≤ 2π),\nwhich we want to expand in terms of spherical harmonics\nas\nτ (θ, φ) =\n\n∞ X\n`\nX\n\na`m Y`m (θ, φ).\n\n(20)\n\n`=0 m=−`\n\nThe spherical harmonic coefficients for τ are given as\nusual by\nZ 2π Z π\n∗\na`m =\ndφ dθ sin θ τ (θ, φ)Y`m\n(θ, φ).\n(21)\n0\n\n0\n\nA sphere only has the non-zero coefficient a00 so is not\nuseful for our purpose. Consider the ellipsoid centered\non the origin and aligned with the coordinate axes,\n\u0010 x \u00112\na\n\n+\n\n\u0010 y \u00112\na\n\n+\n\n\u0010 z \u00112\nc\n\n= 1,\n\n(22)\n\nwhere as usual, x = τ sin θ cos φ, y = τ sin θ sin φ, z =\nτ cos θ. Thus for this distribution,\nτ (θ, φ) = ac a2 cos2 θ + c2 sin2 θ\n\n\u0001−1/2\n\n.\n\n(23)\n\nThis function only depends on θ, so the only non-zero\nspherical harmonic coefficients have m = 0. Further,\nsince τ (θ, φ) is even in θ, only a`0 where ` is even are\nnon-zero. This is interesting because it says that if\nthe anisotropy in τ is axisymmetric in the dipole frame,\nscr\nT scr = T`0\nwhere only ` = odd multipole couplings would\nsurvive. While in the real world, any local free electron\ndistribution is unlikely to be anisotropic in a axisymmetric way in the CMB dipole frame, we can see that\nin general there will be an asymmetry between odd and\neven multipoles in the power spectrum of the screening\nfield. This analytic argument thus explains the \"sawtooth\" pattern of the power spectrum of the kSZ effect\nof the Galactic disk found by Ref. [19].\nHaving developed analytic intuition for the form of\nthe expected screening field, we will now present several\nphysical models for the anisotropic optical depth.\n\nB.\n\nPhysical models for the anisotropic optical\ndepth\n\nThere are two basic ways that we may imagine an\nanisotropic optical depth through the Galaxy. In the\nfirst case, the Galaxy is assumed to have a spherically\n\nFIG. 2: The power spectrum of the full screening field corresponding the four models for the free-electron distribution in\nthe halo. The solid black curve corresponds to the generalized NFW halo with a core radius of r0 = 300 kpc (SphSym).\nThe short-dashed blue and red curves correspond to a triaxial halo (with eb = ec = 0.5) aligned with (Triax) and perpendicular to (TriaxRot) the angular momentum of the disk,\nrespectively. The long-dashed black curve corresponds to the\ntriaxial model for the Milky Way halo proposed in Ref. [41]\nin order to explain the tidal tails of the Sgr dSph (TriaxLMJ).\nAs described in Eq. (7) the amplitude of the signal depends\nlinearly on the angle averaged column-density and is shown\nhere for the fiducial case C ̄ = 1021 cm−2 . The discussion in\nSec. IV gives an analytic explanation for the sawtooth pattern found in power-spectra generated by these free-electron\ndistributions.\n\nsymmetric gaseous halo and the anisotropy is a consequence of the fact that the Solar system is offset from\nthe Galactic center. The IAU standard for the Galactocentric distance of the Sun is 8 kpc; however, this value\nhas been recently revised upwards by ∼ 5% [42, 43]. We\nadopt the conservative Galactocentric distance 8.5 kpc\nto maximize the anisotropic optical depth arising from\nthis offset. In the second case, it is also possible that the\ngaseous halo is triaxial, leading to an additional source\nof anisotropy. We take the virial radius of the Milky Way\nto be 300 kpc (which corresponds to an NFW halo with\na mass of 1.5 ×1012 M and a concentration c = 12).\n\n1.\n\nSpherically symmetric halo\n\nIn order to explore the case of a spherically symmetric\nhalo we need only specify the number density of electrons\nas a function of the radial distance from the Galactic\ncenter (GC). As discussed in Ref. [25] N-body simula-\n\n\f6\nhot gaseous halo for Milky Way-like galaxies. For the\nspherically symmetric case we will consider a generalized\nNFW density profile with an inner core\nne =\n\nn0\n.\n(1 + r/r0 )3\n\n(24)\n\nSpherically symmetric profiles can be written in a selfsimilar form (where the origin is at the GC)\nne = n0 ygas (r/r0 ).\n\n(25)\n\nUsing the Galactic coordinate system (where the origin\ncoincides with the location of the Solar system and the\nGC lies on the positive x-axis) the line-of-sight density\ntakes the form\n\u0011\n\u0010p\nt2 + a2 − 2at cos(φ) sin(θ) ,\nne (t, θ, φ) = n0 ygas\n(26)\nwhere t ≡ r/r0 and a ≡ rGC /r0 . The normalization\nof the density distribution is set by requiring the mean\nangular column density be equal to 1021 cm−2 . The normalization for this model can be computed analytically\nas\n1 − a2 + 2a2 log(a)\nC ̄ = n0 r0\n.\n2(1 − a2 )2\n2.\n\n(27)\n\nTriaxial halos\n\nN-body simulations show that dark matter halos are\nnot spherically symmetric but instead are better approximated by triaxial density profiles [44–47]. This triaxiality, if reflected in the density distribution of an extended\ngaseous halo, will produce additional anisotropy in the\noptical depth. Fits to N-body simulations [47] show that\nisodensity contours are well approximated by a radial coordinate\nR ≡ x2 +\n\nFIG. 3: Sky maps of the screening field for the three cases,\nfrom top to bottom: a generalized spherical NFW halo with\na = 0.01 (SphSym); a generalized triaxial NFW halo with\nmajor axis perpendicular to the plane of the Galactic disk,\na = 0.01, and eb = ec = 0.5 (Triax); the same as before\nbut with the major axis within the plane of the Galactic disk\n(TriaxRot). In both cases the intermediate axis is chosen to\nbe perpendicular to the line connecting the Solar system and\nthe Galactic center. In the final case (TriaxLMJ) we take the\nmodel for the Galactic halo recently proposed in Ref. [41]\nin which the minor axis is aligned with the line connecting\nthe Solar system and Galactic center and the major axis lies\nwithin the Galactic disk.\n\ntions which include gas dynamics generically predict a\n\ny2\nz2\n,\n+\n2\n1 − eb\n1 − e2c\n\n(28)\n\nwhere the x-axis and z-axis run along the major and minor principal axes, respectively; eb and ec (eb < ec ) are\nthe ellipticities of the halo isodensity contours. Cosmological N-body simulations give a nearly Gaussian distribution for eb with hec i ≈ 0.8 and eb . 0.7 [47]. We also\nnote that it has been suggested the inclusion of gas cooling may make the dark-matter density distribution more\nspherical even out to the virial radius [48].\nAs with the spherically symmetric case, we consider a\ngeneralized triaxial NFW halo with a core. As suggested\nby Ref. [49] in order to obtain consistency between observations of the distribution of sub-halos about the Milky\nWay and the ΛCDM prediction, the major axis of the\ntriaxial halo must be aligned with the disk angular momentum. In order to explore how the relationship of the\ndisk angular momentum and the triaxiality of the dark\nmatter halo affects the local kSZ signal, we consider the\n\n\f7\ntwo cases where the major axis is aligned with or perpendicular to the disk angular momentum. In both cases, the\nintermediate axis is along the Galactic y-axis2 .\nWe also consider the recent triaxial Milky Way halo\nproposed in Ref. [41] in order to explain the observed\ncharacteristics of the Sagittarius dwarf spheriodal (Sgr\ndSph). Using observations of the tidal streams of the\nSgr dSph, Ref. [41] claim a Milky Way halo with a\nminor/major axis ratio eb ≈ 0.56 and an intermediate/major axis ratio of ec ≈ 0.74, with the minor axis\nlying along the Galactic x-axis and the major axis along\nthe Galactic y-axis.\n\nVI.\n\nEFFECT OF HALO KSZ ON ISOTROPY\nANOMALIES\n\nGiven a model of the anisotropic optical depth, we obtain a prediction for Tscr from Eqs. (16) or (17). We can\nadd that to the observed realization to obtain the actual\ncosmological realization, and calculate whatever anomaly\nstatistics we want for the cosmological realization.\n\nA.\n\nQuadrupole–octopole planarity and alignment\n\nFirst, let us consider the angular momentum dispersion\nstatistics of § III. Taking the four models for the halo described in § V B, labelled SphSym, Triax, TriaxRot and\nTriaxLMJ respectively, we compute the screening fields\nand add them to the WMAP ILC7 map after subtraction of the kinematic quadrupole. In order to estimate\nthe amplitude of the signal at which the p-value of the\nstatistic would be affected for each case, we scale up the\nmaximum of the screening map to an amplitude (1 μK,\n2 μK, 5 μK) which is much smaller than the primordial\nquadrupole and octopole signals, before adding to the\nILC7 map. The 1 μK signal is not large enough to make\nany difference to the statistics. The results for the other\ntwo cases are presented for the L223 statistic in Table II.\nThe L22 and L23 statistics of the ILC7-KQ map are not\nanomalous before or after the kSZ correction and thus\nwe do not repeat them here.\nIn interpreting Table II, the baseline p-value to compare with is 0.0055 for the ILC7-KQ map with no kSZ\ncorrection. The Table shows that for the Triax case, small\nsignals at the ∼ 2 − 5 μK level reduce this already small\np-value by factors of ∼ 2–7! When scaled to 5 μK, the\nTriaxRot p-value increases somewhat by factors of . 2\nand the TriaxLMJ p-value decreases by roughly the same\nfactor. The SphSym screening map is unable to affect\n\n2\n\nThe Galactic coordinate system is centered on the location of\nthe Solar system with the Galactic x-axis pointing towards the\nGalactic center and the Galactic z-axis pointing in the direction\nof the angular momentum of the Galactic disk.\n\nTABLE II: Values and p-values (computed from 10,000\nisotropic realizations) for angular momentum dispersion\nstatistic L223 for the WMAP 7 year Internal Linear Combination (ILC7) map subtracting the kinematic quadrupole (KQ)\nafter accounting for the anisotropic screening from the four\nmodels described in the text, after scaling the maximum amplitude of the screening map to 2 μK and 5 μK. We also list\nthe corresponding value for the angle-averaged free electron\n ̄ in units of 1021 cm−2 .\ncolumn density, C,\nL223\n(2 μK)\nSphSym 0.955\nTriax\n0.962\nTriaxRot 0.950\nTriaxLMJ 0.956\nModel\n\np-value\nL223\nC ̄\n(2 μK) (2 μK) (5 μK)\n0.0047\n12\n0.952\n0.0022\n22\n0.972\n0.0062\n24\n0.943\n0.0042\n4\n0.958\n\np-value\nC ̄\n(5 μK) (5 μK)\n0.0056\n31\n0.0008\n56\n0.0091\n60\n0.0036\n11\n\nthis statistic significantly at these signal levels. These\ntests show that a statistic such as L223 , which is sensitive\nto the orientation of the Galactic plane, can be highly\nsensitive to small signals oriented with this plane.\nIf the maximum amplitude of the screening map is between 2–5 μK, the average free electron column densities\nfor these maps are between 4 × 1021 – 6 × 1022 cm−2 .\nAs we discuss in more detail below, though the lower\nend of this range is possible given current observational\nconstraints, the upper range is unlikely.\n\nB.\n\nHemispherical asymmetry\n\nWe now explore the extent to which the scattering\nof CMB photons in an extended gaseous halo can account for the observed hemispherical asymmetry [3]. The\nstatistic by which this asymmetry is inferred assumes a\ndipolar modulation of an isotropic primordial CMB temperature field, and constrains the relative amplitude of\nthis modulation. The dipolar modulation leads to a coupling between modes of order ` and ` ± 1. As we saw in\nSec. IV, the kSZ also introduces such a coupling between\nmodes, so it is particularly interesting to consider how,\nthrough the kSZ, a screening field may impact the significance of the dipole modulation amplitude statistic for\nconstraining hemispherical asymmetry.\nIn order to do this, we will use the approach presented\nin Refs. [15, 35]. In that work an estimator is derived\nwhich measures to what extent the data shows a dipolar\nmodulation by looking for a non-zero coupling between\nmultipoles of order ` and ` ± 1 up to some `max ,\n1`\nf`T T R`+1,m\nT ∗ T\nT T (a`m ) (a`+1m )\n`m C`T T C`+1\n\nP\nŵ1T T =\n\n1`\n(f`T T R`+1,m\n)2\nTT\n`m C`T T C`+1m\n\nP\n\n,\n\n(29)\n\n\f8\nwhere\nTT\nf`T T ≡ C`T T + C`+1\n(30)\nr\n(2` + 1)(2`1 + 1)(2`2 + 1)\n`1 ,`2\nR`m\n≡ (−1)m\n×\n4π\n\u0012\n\u0013\u0012\n\u0013\n`1 `2 `\n`1 `2 `\n.\n(31)\n0 0 0\n0 m −m\n\nFrom the discussion in Sec. IV it is clear that the inclusion of Thomson scattering from free electrons in an\nextended Galactic halo will couple multipoles of order `\nto those of order ` − 1 and ` + 1 in the observed a`m s.\n\nlevel of the distribution at that value of `max ranging\nfrom 1 σ to 3 σ. The Figure shows the value of ŵ1 for\n(from top to bottom) for TriaxLMJ, SphSym, TriaxRot,\nand Triax. It is clear that the orientation of any triaxiality has a significant impact on the inferred amplitude\nof the hemispherical asymmetry. In particular, the TriaxLMJ orientation leads to an increase in the inferred\namplitude. This can be seen in Fig. 3 since the inclusion of the TriaxLMJ screening field adds power in the\nnorthern Galactic hemisphere and subtracts it from the\nsouthern hemisphere. For the other cases, the inferred\namplitude decreases.\nSince the anisotropies induced by a local kSZ are at the\nlevel of 10−5 μK for ` & 10 (see Fig. 2), in order for the\nscreening field to have a significant impact on the inferred\n21\n ̄\namplitude of ŵ1 , we must have C/(10\ncm−2 ) ∼ 104 . A\nfree-electron column density of this magnitude is ruled\nout by observations of OVII and OVIII absorption [28]\nand pulsar observations towards the Large Magellanic\nCloud (LMC) [29]. Therefore, we find that a local kSZ\nis unlikely to provide a plausible explanation for a hemispherical asymmetry.\n\nVII.\n\nFIG. 4: How a screening field can affect the measurement of a\nhemispherical asymmetry. The grey band indicates the confidence level of the distribution at that value of `max ranging\nfrom 1 σ to 3 σ. The solid thick black curve shows the value\nof ŵ1 evaluated on the ILC cleaned WMAP7 map. From top\nto bottom we show the resulting hemispherical asymmetry for\nTriaxLMJ, SphSym, TriaxRot, and Triax as a function of `max .\nThis Figure demonstrates how the orientation of the triaxiality of the halo greatly affects its ability to impact the inferred\namplitude of a hemispherical asymmetry.\n\nTo check the effect of the kSZ on the significance of\nthe hemispherical asymmetry, we evaluate the estimator\ncos\nŵ1T T on the inferred cosmological signal given by T`m\n=\nobs\nscr  ̄\nT`m + T`m (C) for various values of the angle-averaged\n ̄ As in the previous section, the\nelectron column density C.\nfour extended halos considered here are the spherically\nsymmetric case (SphSym), and the three triaxial halos\nwith various orientations (Triax, TriaxRot, TriaxLMJ).\nWe show the value of the estimator ŵ1 evaluated on\nthe WMAP ILC7 map in Fig. 4. Because of the scale\ndependence of the power spectra of the screening fields,\nseen in Fig. 2, we plot the value of ŵ1 as a function of\n`max in Fig. 4. The grey band indicates the confidence\n\nDISCUSSION\n\nAlthough measurements of the CMB have generally\nconfirmed our current understanding of the formation\nand evolution of the universe, there are several anomalies which appear to be at odds with our standard picture. These anomalies could suggest that there may be\nsome process which violates the statistical isotropy of the\nCMB fluctuations on large scales. Although attempts\nhave been made to modify the physics of the early universe in order to explain these anomalies, there are also\nstrong reasons to look for explanations in the local universe. First, the directionality of these anomalies seems\nto closely coincide with both the Solar CMB dipole as\nwell as the velocity of the Galactic barycenter relative\nto the CMB rest-frame. Second, given that the anomalies are on large angular scales, any non-primordial and\ncausal explanation must be local in origin.\nHere we have explored how a local kSZ signal (due to\nthe motion of any extended hot gaseous halo associated\nwith the Milky Way relative to the CMB) may affect the\nsignificance of several anomalies observed in the CMB\nanisotropies. Both theoretical and observational considerations indicate the presence of a hot gaseous halo\nwith an extent of several tens of kiloparsecs [25, 40].\nAnisotropies in the optical depth through this gaseous\nhalo can be due to the offset of the Solar system from the\nGalactic center, as well as any triaxiality in its distribution. We computed the kSZ signal from several plausible\nphysical models for the shape and orientation of the halo,\nand studied their impact on the observed CMB sky, in\nthe form of the WMAP ILC7 map.\nWe considered how a local kSZ may affect the observed\nplanarity of the CMB quadrupole and octopole moments\n\n\f9\nas well as their relative alignment, motivated by the fact\nthat kSZ from a triaxial halo can naturally relate to the\nspecial directions that appear to be associated with the\n` = 2 and 3 multipole moments. Surprisingly, we found\nthat relatively small changes in the observed amplitude\nof these moments (∼ 10%) to account for a kSZ signal\ncan reduce the already tiny p-values for these anomalies\nof up to factors of 2–7. The corresponding free electron\ncolumn density needed to affect the planarity/alignment\nstatistics at this level is 4 – 60 × 1021 cm−2 .\nA local kSZ signal couples multipole moments of order ` to those of order ` ± 1, so it is natural to consider\nhow such a signal would affect any inferred hemispherical asymmetry in the CMB anisotropies in the form of\na dipolar modulation, which gives rise to the same coupling. Using a statistic first derived in Ref. [15], we found\nthat a local kSZ signal can have a significant effect on the\ninferred amplitude of a dipolar modulation of the primary\nCMB anisotropies. In this case, the corresponding free\nelectron column density would need to be ∼ 1025 cm−2 .\nTheoretical and observational constraints on the free\nelectron fraction in a extended hot gaseous halo associated with the Milky Way place a fairly strict bound\non the column density of < 1021 cm−2 . The most precise constraints come from observations of the dispersion\nmeasure to individual pulsars [29] which find a column\ndensity in free electrons to the LMC of ∼ 3 × 1020 cm−2 .\nGiven that the LMC is ∼ 50 kpc from the Galactic center\nand that the scale-radius of the Milky Way halo is ∼ 300\nkpc, these observations indicate that the total optical\ndepth may be as large as 1021 cm−2 . In addition to this,\nobservations of local (z = 0) OVII and OVIII absorption\ntowards several quasars indicates the presence of an extended hot gaseous halo around the Milky Way [40]. The\ninferred free electron column density is quite uncertain\ngiven assumptions about the metallicity of the gas (Solar\nabundance was assumed to convert the observations to\nan electron density; sub-Solar values would increase the\ninferred density), as well as a model dependence coming\nfrom the assumed profile of the gas. Finally, theoretical considerations imply the existence of a hot extended\n\ngaseous halo with a fractional mass of the order of the\ncosmic baryon fraction, f ∼ 0.1. Therefore, for a Milky\nWay sized halo (M ∼ 1.5 × 1012 M ) with a scale radius of 300 kpc, we would expect a column density no\nlarger than 1021 cm−2 . Given that, for a local kSZ signal\nto have a significant effect on the CMB anisotropies, we\nmust have a free electron column density > 1021 cm−2 ,\nbut that both theoretical and observational considerations place the limit at . 1021 cm−2 , it is unlikely that a\nlocal kSZ signal can explain any of the CMB anomalies\nconsidered here. Even given the uncertainties, the kSZ\nsignal can at best only be at the lowest amplitude needed\nto affect the anomaly statistics.\nFinally, we note that contamination from kSZ in the\nSolar system can also, in principle, provide an anisotropic\ncontamination of the CMB sky at large angles. The geometry of the heliopause is coincidentally aligned with\nthe CMB dipole [18], providing a motivation for looking\nthere for a explanation for the special directional properties of the large-angle isotropy anomalies. However, in\npractice, the optical depth of free electrons in the Solar\nsystem is more than 7 orders of magnitude below what\nis required to produce the necessary signal.\n\n[1] C. J. Copi, D. Huterer, and G. D. Starkman, Phys. Rev.\nD70, 043515 (2004), astro-ph/0310511.\n[2] A. de Oliveira-Costa, M. Tegmark, M. Zaldarriaga, and\nA. Hamilton, Phys. Rev. D69, 063516 (2004), astroph/0307282.\n[3] H. K. Eriksen, F. K. Hansen, A. J. Banday, K. M. Gorski,\nand P. B. Lilje, Astrophys. J. 605, 14 (2004), astroph/0307507.\n[4] D. J. Schwarz, G. D. Starkman, D. Huterer, and\nC. J. Copi, Phys. Rev. Lett. 93, 221301 (2004), astroph/0403353.\n[5] K. Land and J. Magueijo, Phys. Rev. Lett. 95, 071301\n(2005), astro-ph/0502237.\n[6] N. E. Groeneboom and H. K. Eriksen, Astrophys. J. 690,\n1807 (2009), 0807.2242.\n\n[7] D. Hanson and A. Lewis, Phys. Rev. D80, 063004 (2009),\n0908.0963.\n[8] N. E. Groeneboom, L. Ackerman, I. K. Wehus, and H. K.\nEriksen (2009), 0911.0150.\n[9] K. Land and J. Magueijo, Mon. Not. Roy. Astron. Soc.\n378, 153 (2007), astro-ph/0611518.\n[10] F. K. Hansen, A. J. Banday, K. M. Gorski, H. K. Eriksen, and P. B. Lilje, Astrophys. J. 704, 1448 (2009),\n0812.3795.\n[11] L. Ackerman, S. M. Carroll, and M. B. Wise, Phys. Rev.\nD75, 083502 (2007), astro-ph/0701357.\n[12] A. L. Erickcek, M. Kamionkowski, and S. M. Carroll,\nPhys. Rev. D78, 123520 (2008), 0806.0377.\n[13] A. L. Erickcek, S. M. Carroll, and M. Kamionkowski,\nPhys. Rev. D78, 083012 (2008), 0808.1570.\n\nAcknowledgments\n\nHVP is supported by Marie Curie grant MIRG-CT2007-203314 from the European Commission, and by\nSTFC and the Leverhulme Trust. TLS is supported\nby the Berkeley Center for Cosmological Physics. We\nthank the Aspen Center for Physics, where this work\nwas initiated, for hospitality. We are grateful to HsiaoWen Chen, Priscilla Frisch, Shirley Ho, Ed Jenkins, and\nChris Thom for invaluable information about observational constraints on the free electron content of the local universe. We thank Yuval Birnboim for useful comments on some preliminary results. HVP thanks Anthony\nChallinor, Daniel Mortlock, and Andrew Pontzen for interesting discussions on related topics.\n\n\f10\n[14] A. L. Erickcek, C. M. Hirata, and M. Kamionkowski,\nPhys. Rev. D80, 083507 (2009), 0907.0705.\n[15] C. Dvorkin, H. V. Peiris, and W. Hu, Phys. Rev. D77,\n063008 (2008), 0711.2321.\n[16] C. M. Hirata, JCAP 0909, 011 (2009), 0907.0703.\n[17] M. Frommert and T. A. Ensslin (2009), 0908.0453.\n[18] P. C. Frisch (2007), 0707.2970.\n[19] A. Hajian, C. Hernández-Monteagudo, R. Jimenez,\nD. Spergel, and L. Verde, Astrophys. J. 671, 1079\n(2007), 0705.3245.\n[20] A. Waelkens, M. Maturi, and T. Ensslin, MNRAS 383,\n1425 (2008), 0707.2601.\n[21] Y. Suto, K. Makishima, Y. Ishisaki, and Y. Ogasaka, ApJ\n461, L33+ (1996), arXiv:astro-ph/9602061.\n[22] L. R. Abramo, L. S. Jr., and C. A. Wuensche, Phys. Rev.\nD74, 083515 (2006), astro-ph/0605269.\n[23] M. Maturi, K. Dolag, A. Waelkens, V. Springel, and\nT. Ensslin, Astron. Astrophys. 476, 83 (2007), 0708.1881.\n[24] C. L. Francis and J. A. Peacock (2009), 0909.2495.\n[25] Y. Birnboim and A. Loeb, JCAP 0906, 008 (2009),\n0903.3943.\n[26] D. Keres, N. Katz, D. H. Weinberg, and R. Dave, Mon.\nNot. Roy. Astron. Soc. 363, 2 (2005), astro-ph/0407095.\n[27] Y. Birnboim and A. Dekel, Mon. Not. Roy. Astron. Soc.\n345, 349 (2003), astro-ph/0302161.\n[28] J. N. Bregman and E. J. Lloyd-Davies, Astrophys. J.\n669, 990 (2007), 0707.1699.\n[29] J. H. Taylor and J. M. Cordes, Astrophys. J. 411, 674\n(1993).\n[30] C. L. Bennett et al. (2010), 1001.4758.\n[31] Z. Haiman and L. Knox, in Microwave Foregrounds,\nedited by A. de Oliveira-Costa & M. Tegmark (1999),\nvol. 181 of Astronomical Society of the Pacific Conference Series, pp. 227–+.\n[32] S. Dodelson (2003), amsterdam, Netherlands: Academic\nPr. 440 p.\n[33] A. Challinor and H. Peiris, AIP Conf. Proc. 1132, 86\n\n(2009), 0903.5158.\n[34] A. Kogut et al., Astrophys. J. 419, 1 (1993), astroph/9312056.\n[35] C. Gordon, W. Hu, D. Huterer, and T. M. Crawford,\nPhys. Rev. D72, 103002 (2005), astro-ph/0509301.\n[36] N. Jarosik et al. (2010), 1001.4744.\n[37] C. J. Copi, D. Huterer, D. J. Schwarz, and G. D. Starkman, MNRAS 367, 79 (2006), arXiv:astro-ph/0508047.\n[38] G. Hinshaw et al. (WMAP), Astrophys. J. Suppl. 180,\n225 (2009), 0803.0732.\n[39] A. Kogut, C. Lineweaver, G. F. Smoot, C. L. Bennett,\nA. Banday, N. W. Boggess, E. S. Cheng, G. de Amici,\nD. J. Fixsen, G. Hinshaw, et al., Astrophys. J. 419, 1\n(1993), arXiv:astro-ph/9312056.\n[40] J. N. Bregman (2009), 0907.3494.\n[41] D. R. Law, S. R. Majewski, and K. V. Johnston, Astrophys. J. 703, L67 (2009), 0908.3187.\n[42] A. M. Ghez, S. Salim, N. N. Weinberg, J. R. Lu, T. Do,\nJ. K. Dunn, K. Matthews, M. R. Morris, S. Yelda,\nE. E. Becklin, et al., Astrophys. J. 689, 1044 (2008),\n0808.2870.\n[43] S. Gillessen, F. Eisenhauer, S. Trippe, T. Alexander,\nR. Genzel, F. Martins, and T. Ott, Astrophys. J. 692,\n1075 (2009), 0810.4674.\n[44] C. S. Frenk, S. D. M. White, M. Davis, and G. Efstathiou,\nAstrophys. J. 327, 507 (1988).\n[45] J. Dubinski and R. G. Carlberg, Astrophys. J. 378, 496\n(1991).\n[46] M. S. Warren, P. J. Quinn, J. K. Salmon, and W. H.\nZurek, Astrophys. J. 399, 405 (1992).\n[47] Y. P. Jing and Y. Suto, Astrophys. J. 574, 538 (2002),\nastro-ph/0202064.\n[48] S. Kazantzidis et al., Astrophys. J. 611, L73 (2004),\nastro-ph/0405189.\n[49] A. R. Zentner, A. V. Kravtsov, O. Y. Gnedin, and A. A.\nKlypin, Astrophys. J. 629, 219 (2005), astro-ph/0502496.\n\n\f"}