{"id": "http://arxiv.org/abs/0903.0745v2", "guidislink": true, "updated": "2009-05-18T08:53:24Z", "updated_parsed": [2009, 5, 18, 8, 53, 24, 0, 138, 0], "published": "2009-03-04T12:17:32Z", "published_parsed": [2009, 3, 4, 12, 17, 32, 2, 63, 0], "title": "Thermodynamics and structure of simple liquids in the hyperbolic plane", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0903.0334%2C0903.0697%2C0903.1224%2C0903.5371%2C0903.4730%2C0903.4563%2C0903.1526%2C0903.1992%2C0903.4675%2C0903.1010%2C0903.2445%2C0903.2887%2C0903.4960%2C0903.5210%2C0903.4656%2C0903.0152%2C0903.0570%2C0903.1427%2C0903.0643%2C0903.4392%2C0903.4577%2C0903.3273%2C0903.0454%2C0903.2418%2C0903.2816%2C0903.2402%2C0903.1871%2C0903.3326%2C0903.4510%2C0903.4989%2C0903.5382%2C0903.2175%2C0903.4745%2C0903.0501%2C0903.1102%2C0903.1027%2C0903.3915%2C0903.0768%2C0903.5413%2C0903.2586%2C0903.2603%2C0903.5462%2C0903.3840%2C0903.2525%2C0903.1701%2C0903.0087%2C0903.3903%2C0903.1151%2C0903.0213%2C0903.1079%2C0903.2137%2C0903.1924%2C0903.0010%2C0903.3738%2C0903.1014%2C0903.2845%2C0903.0962%2C0903.4294%2C0903.1896%2C0903.5151%2C0903.2026%2C0903.0798%2C0903.2549%2C0903.5154%2C0903.1332%2C0903.2233%2C0903.2921%2C0903.4240%2C0903.0946%2C0903.5078%2C0903.4666%2C0903.0745%2C0903.1757%2C0903.4496%2C0903.3089%2C0903.2304%2C0903.2224%2C0903.0949%2C0903.1971%2C0903.4717%2C0903.1832%2C0903.5287%2C0903.3799%2C0903.2051%2C0903.3434%2C0903.3547%2C0903.1227%2C0903.1583%2C0903.2165%2C0903.5414%2C0903.3745%2C0903.5051%2C0903.2929%2C0903.3775%2C0903.3195%2C0903.2515%2C0903.5066%2C0903.5217%2C0903.2374%2C0903.5308%2C0903.3553&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Thermodynamics and structure of simple liquids in the hyperbolic plane"}, "summary": "We provide a consistent statistical-mechanical treatment for describing the\nthermodynamics and the structure of fluids embedded in the hyperbolic plane. In\nparticular, we derive a generalization of the virial equation relating the bulk\nthermodynamic pressure to the pair correlation function and we develop the\nappropriate setting for extending the integral-equation approach of\nliquid-state theory in order to describe the fluid structure. We apply the\nformalism and study the influence of negative space curvature on two types of\nsystems that have been recently considered: Coulombic systems, such as the one-\nand two-component plasma models, and fluids interacting through short-range\npair potentials, such as the hard-disk and the Lennard-Jones models.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0903.0334%2C0903.0697%2C0903.1224%2C0903.5371%2C0903.4730%2C0903.4563%2C0903.1526%2C0903.1992%2C0903.4675%2C0903.1010%2C0903.2445%2C0903.2887%2C0903.4960%2C0903.5210%2C0903.4656%2C0903.0152%2C0903.0570%2C0903.1427%2C0903.0643%2C0903.4392%2C0903.4577%2C0903.3273%2C0903.0454%2C0903.2418%2C0903.2816%2C0903.2402%2C0903.1871%2C0903.3326%2C0903.4510%2C0903.4989%2C0903.5382%2C0903.2175%2C0903.4745%2C0903.0501%2C0903.1102%2C0903.1027%2C0903.3915%2C0903.0768%2C0903.5413%2C0903.2586%2C0903.2603%2C0903.5462%2C0903.3840%2C0903.2525%2C0903.1701%2C0903.0087%2C0903.3903%2C0903.1151%2C0903.0213%2C0903.1079%2C0903.2137%2C0903.1924%2C0903.0010%2C0903.3738%2C0903.1014%2C0903.2845%2C0903.0962%2C0903.4294%2C0903.1896%2C0903.5151%2C0903.2026%2C0903.0798%2C0903.2549%2C0903.5154%2C0903.1332%2C0903.2233%2C0903.2921%2C0903.4240%2C0903.0946%2C0903.5078%2C0903.4666%2C0903.0745%2C0903.1757%2C0903.4496%2C0903.3089%2C0903.2304%2C0903.2224%2C0903.0949%2C0903.1971%2C0903.4717%2C0903.1832%2C0903.5287%2C0903.3799%2C0903.2051%2C0903.3434%2C0903.3547%2C0903.1227%2C0903.1583%2C0903.2165%2C0903.5414%2C0903.3745%2C0903.5051%2C0903.2929%2C0903.3775%2C0903.3195%2C0903.2515%2C0903.5066%2C0903.5217%2C0903.2374%2C0903.5308%2C0903.3553&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We provide a consistent statistical-mechanical treatment for describing the\nthermodynamics and the structure of fluids embedded in the hyperbolic plane. In\nparticular, we derive a generalization of the virial equation relating the bulk\nthermodynamic pressure to the pair correlation function and we develop the\nappropriate setting for extending the integral-equation approach of\nliquid-state theory in order to describe the fluid structure. We apply the\nformalism and study the influence of negative space curvature on two types of\nsystems that have been recently considered: Coulombic systems, such as the one-\nand two-component plasma models, and fluids interacting through short-range\npair potentials, such as the hard-disk and the Lennard-Jones models."}, "authors": ["François Sausset", "Gilles Tarjus", "Pascal Viot"], "author_detail": {"name": "Pascal Viot"}, "author": "Pascal Viot", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1088/1742-5468/2009/04/P04022", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0903.0745v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0903.0745v2", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "25 pages, 10 Figures", "arxiv_primary_category": {"term": "cond-mat.stat-mech", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.stat-mech", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0903.0745v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0903.0745v2", "journal_reference": "J. Stat. Mech., P04022 (2009)", "doi": "10.1088/1742-5468/2009/04/P04022", "fulltext": "arXiv:0903.0745v2 [cond-mat.stat-mech] 18 May 2009\n\nThermodynamics and structure of simple liquids in\nthe hyperbolic plane\nFrançois Sausset, Gilles Tarjus and Pascal Viot\nLaboratoire de Physique Théorique de la Matière Condensée, Université Pierre et\nMarie Curie-Paris 6, UMR CNRS 7600, 4 place Jussieu, 75252 Paris Cedex 05, France\nE-mail:\nsausset@lptmc.jussieu.fr,tarjus@lptmc.jussieu.fr,viot@lptmc.jussieu.fr\nAbstract. We provide a consistent statistical-mechanical treatment for describing\nthe thermodynamics and the structure of fluids embedded in the hyperbolic plane.\nIn particular, we derive a generalization of the virial equation relating the bulk\nthermodynamic pressure to the pair correlation function and we develop the\nappropriate setting for extending the integral-equation approach of liquid-state theory\nin order to describe the fluid structure. We apply the formalism and study the influence\nof negative space curvature on two types of systems that have been recently considered:\nCoulombic systems, such as the one- and two-component plasma models, and fluids\ninteracting through short-range pair potentials, such as the hard-disk and the LennardJones models.\n\n\fThermodynamics and structure of simple liquids in the hyperbolic plane\n\n2\n\n1. Introduction\nWhen a system is embedded in a space of nonzero curvature, its long-distance properties,\nsuch as the thermodynamic quantities and the critical behavior, are strongly modified.\nA uniform positive curvature, characteristic of spherical geometry, has the drawback of\nleading to spaces of finite extent. Genuine long-distance properties on the other hand\nare accessible in hyperbolic spaces characterized by a constant negative curvature. The\ninfluence of the negative curvature of hyperbolic space on critical phenomena has been\ninvestigated both for hard spins on hyperbolic lattices[1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13]\nand in a continuum field-theoretical description[14, 5, 15, 16].\nIn brief, the presence of an intrinsic characteristic length associated with the\nmetric makes the critical behavior of Ising-type systems mean-field-like[1, 2, 4, 15, 6, 8]\nand drastically alters, if not suppresses, critical points in models with a continuous\nsymmetry[14, 16, 9, 11] In the last decade, the thermodynamics of simple fluids in\nthe hyperbolic plane has also received special attention. This is the case for systems\ninteracting through the Coulomb potential, such as the one- and two-component plasma\nmodels[17, 18, 19] and for the hard-disk fluid[20, 21, 22].\nIn addition to being a mathematical curiosity and providing simple systems for\nstudying the influence of space curvature on long-distance properties, fluids in the\nhyperbolic plane have been considered in the context of jamming phenomena and\nglass formation in liquids. The rationale behind this comes from the concept of\n\"geometric frustration\" that describes an incompatibility between the preferred local\norder and the tiling of the whole space[23, 24]. Geometric frustration has emerged\nin the theoretical description of glasses and amorphous solids from the consideration\nof local icosahedral order in metallic glasses. No such frustration however operates\nin assemblies of monodisperse spherical particles in ordinary (\"flat\") two-dimensional\nspace, and Nelson and coworkers[25, 26, 24] have proposed to curve two-dimensional\nspace in order to introduce frustration and thereby mimic glasses in three-dimensional\nspace. Two recent investigations have been carried out along these lines. Modes and\nKamien[20, 21] have focused on isostatic packings in hyperbolic space, the isostatic\nproperty having been argued to play an important role in the physics of nearly jammed\nrandom packings of particles in Euclidean three-dimensional space[27]. On the other\nhand, building on a frustration-based approach of the glass transition[28, 29], we have\nstudied by molecular dynamics simulation the slowing down of the dynamics with\ndecreasing temperature in a monatomic liquid: a truncated Lennard-Jones model in\nthe hyperbolic plane[30].\nIn the present work, we provide a consistent statistical-mechanical treatment for\ndescribing the thermodynamics and the structure of fluids embedded in the hyperbolic\nplane. The paper is organized as follows. In section 2, we introduce the statisticalmechanical framework for systems in the hyperbolic plane. By using a variant of the\nGreen-Bogoliubov method, we relate the bulk thermodynamic pressure to the pair\ndistribution function. In section 3, we extend the integral-equation approach, which\n\n\fThermodynamics and structure of simple liquids in the hyperbolic plane\n\n3\n\nis commonly used in liquid-state theory, to calculate the pair correlation function in\nhyperbolic geometry. We discuss thermodynamic consistency and gas-liquid critical\nbehavior. In section 4, we focus on Coulombic systems, such as the one- and twocomponent plasma models. We apply the formalism developed in the previous sections\nto two cases for which the pair correlation functions are known exactly: the limit of\nhigh temperature and a special value of the temperature. In section 5, we present the\nnumerical solution of standard approximate integral equations of liquid-state physics\n(namely, the Percus-Yevick and hypernetted chain equations) that have been obtained\nafter making use of the harmonic analysis in the hyperbolic plane. We consider the\nhard-disk fluid and the (truncated) Lennard-Jones liquid and compare with existing\nsimulation data. Finally, section 6 contains our concluding remarks, and some technical\ndetails are provided in two appendices.\n2. The generalized virial equation of state\nFor an atomic liquid at equilibrium in the grand-canonical ensemble (fixed temperature\nT , total area A and chemical potential μ), the partition function is given by\nZ\nN X\n∞\nX\nX\n(Z1 eβμ )N\nN\ndA exp(−β\nu(rij ))\n(1)\nΞ(T, A, μ) =\nN!AN\ni=1 j>i\nN =1\nwhere u(r) is the pair potential with r the appropriate interatomic geodesic distance (for\nsimplicity, we only consider pairwise additive interactions), β = 1/(kB T ), and Z1 (T, A)\nis the partition function of a single particle, i.e. the ideal gas contribution. The above\nexpression is valid for any two-dimensional space with dA the appropriate infinitesimal\nsurface area. It therefore applies as well to the hyperbolic plane, with however some\nsubtelties that are discussed below.\nThe hyperbolic plane H 2 is a two-dimensional manifold of constant negative\ncurvature, whose metric in polar coodinates (r, φ) is given by\n\u00132\n\u0012\nsinh(κr)\n2\n2\ndφ2 .\n(2)\nds = dr +\nκ\nThe Gaussian curvature of H 2 is −κ2 . The curvature parameter κ > 0 therefore\nmeasures the deviation from \"flat\" (Euclidean) space; by an abuse of language, we shall\nsometimes refer to κ−1 as the \"radius of curvature\". (Note that H 2 is not embeddable\nin three-dimensional Euclidean space and is usually described through representations\nsuch as the Poincaré disk model that is a conformal projection of H 2 onto a disk of\nradius κ−1 .) In polar coordinates, the differential area is expressed as\nsinh(κr)\ndrdφ.\n(3)\nκ\nThe hyperbolic plane is of infinite extent but the exponential character of the metric at\nlarge distance (see Eqs. (2) and (3)) induces the peculiar property that the boundary\nof a finite region of H 2 grows as fast as the total area of this region when the latter\ndA =\n\n\fThermodynamics and structure of simple liquids in the hyperbolic plane\n\n4\n\nincreases. A simple illustration is provided by a disk of radius r: from Eq. (3), one finds\nthat its area is equal to A(r) = 2π(cosh(κr) − 1)/κ2 whereas its perimeter is given by\nP (r) = 2π sinh(κr)/κ, so that for large r, both A(r) and P (r) grow as exp(κr).\nAs a consequence of the above property, boundary effects are never negligible, even\nin the thermodynamic limit. Generally speaking, the statistical mechanics of fluids on\nH 2 involves multiple integral over space, as in Eq. (1). Integration is performed on both\nthe \"bulk\" and the \"boundary region\" of the system, the latter being taken as a region\nof finite width (or a width whose ratio to the linear size of the system goes to zero when\nthe latter goes to infinity) near the boundary in an otherwise very large sample. The\nboundary contribution of course depends on the boundary condition imposed on the\nsystem, but it is never negligible compared to the bulk contribution. This is already\ntrue for the ideal-gas limit. The canonical partition function Z1 is proportional to the\ntotal area A; however, the proportionality constant is not a pure bulk property and\ndepends on the type of boundary condition[21].\nIn this work, we are only interested in the bulk behavior of fluids in H 2 , which\nis what can be directly compared to fluids in Euclidean space. One way to eliminate\nunwanted boundary effects in H 2 is to consider periodic boundary conditions[31]. This\nhas been done for instance by Modes and Kamien for calculating the properties of a gas of\nhard disks in the low-density limit near ideal behavior[21]. We shall take here a simpler\nroute that has already been followed in previous studies of spin and field-theoretical\nmodels in hyperbolic geometry[1, 4, 15]: we implicitly restrict all integrals appearing\nin any statistical-mechanical expression to the \"bulk\" of the sample, i.e. the fluid far\nenough from the boundary. All resulting thermodynamic and structural quantities will\ntherefore be dubbed \"bulk\" ones. We stress again that the present problem associated\nwith the thermodynamic limit in hyperpolic geometry is a general one which is not\nrelated to the presence of long-range correlations between particles. (This point will be\naddressed further down.)\nFrom the (bulk) grand-canonical partition function in Eq. (1), one obtains the\n(bulk) thermodynamic pressure as\n∂lnΞ\n|T,μ .\n(4)\n∂A\nFor short-range interactions, the low-density expansion of the equation of state can\nbe put in the usual form[21],\nX\nβP\n=1+\nBj (T )ρj−1 ,\n(5)\nρ\nj≥2\nβP =\n\nwhere ρ = N/A and Bj is the jth virial coefficient. When restricting the calculation to\nthe bulk of the system, the second virial coefficient B2 can be expressed as\nZ\n1\ndA f (r),\n(6)\nB2 = −\n2\nwhere dA is given by Eq. (3) and f (r) = (e−βu(r) − 1) is the Mayer function. (In\nthe calculation of B2 for short-range interactions, it is easy to see that one obtains the\n\n\fThermodynamics and structure of simple liquids in the hyperbolic plane\n\n5\n\nsame result by restricting the system to the bulk region and by using periodic boundary\nconditions[21].) As a result,\nZ ∞\nsinh(κr)\nf (r),\n(7)\nB2 = π\ndr\nκ\n0\nwhich for hard disks of diameter σ simplifies to[21]\n(cosh(κσ) − 1)\n.\n(8)\nκ2\nThe above expression correctly reduces to the Euclidean result B2 = πσ 2 /2 when κ → 0.\nTo go beyond the low-density regime and describe the liquid phase, a natural\nstrategy is to relate the pressure to the pair distribution function[32]. However, the\nhyperbolic geometry prevents a direct derivation through the Clausius function[32]. We\nhave instead used a variant of the Green-Bogoliubov method[33]. To calculate the\nderivative in Eq. (4), we choose to perform an affine transformation of the elementary\narea element,\nB2 = π\n\ndA′ = (1 + ξ)dA,\n\n(9)\n\nwith ξ an infinitesimal parameter. Inserting Eq. (3) in Eq. (9) yields the following\ntransformation of the radial coordinate r to first order in ξ:\n(cosh(κr) − 1)\n.\n(10)\nr′ = r + ξ\nκ sinh(κr)\nThe presence of curvature leads to a nonlinear transformation of the coordinate, contrary\nto what occurs in flat Euclidean space[34]. We then consider the infinitesimal variation\nof ln(Ξ) generated by the affine transformation,\nZ\nZ\nβ\nδ ln(Ξ) = ξhNi −\ndA1 dA2 ρ(2) (r1 , r2 )δu(r12 ),\n(11)\n2\nwhere ρ(2) (r1 , r2 ) is the (bulk) two-particle density. By using Eq. (10), the infinitesimal\nincrease of the potential is found equal to\ncosh(κr) − 1 ′\nu (r)\n(12)\nδu(r) = ξ\nκ sinh(κr)\nwhere u′ (r) denotes the derivative of u(r) with respect to r.\nTaking advantage of the homogeneity and the isotropy of H 2 (far from the\nboundary), we then obtain the bulk thermodynamic pressure as\nZ\nβP\nπβρ ∞\n=1− 2\ndr g(r)(cosh(κr) − 1)u′(r),\n(13)\nρ\nκ\n0\nwhere we have used that ρ(2) (r1 , r2 ) = ρ2 g(r), g(r) being the bulk radial distribution\nfunction[32]. This result generalizes the virial equation of state obtained in Euclidean\nspace. The latter is recovered when taking the κ → 0 limit in Eq. (13):\nZ\nπβρ ∞\nβP\n=1−\ndr r 2 g(r)u′(r).\n(14)\nρ\n2 0\nAt large distance, g(r) goes to 1, and Eq. (13) shows that the pressure is only\nR∞\ndefined if R dr(cosh(κr)−1)u′(r) is finite, with R some irrelevant cut-off distance. This\n\n\fThermodynamics and structure of simple liquids in the hyperbolic plane\n\n6\n\nimposes that the pair potential u(r) decays faster than exp(−κr) when r → ∞. This\nrequirement prevents using any interaction potential with an algebraic decay, contrary\nto the d−dimensional Euclidean case where all potentials u(r) ∝ r −n with n ≥ d lead\nto a well-defined thermodynamic limit (for the Coulombic interaction, see below). The\nabove condition is of course satisfied for hard disks, but also for the one- and twocomponent plasma models because, as will be discussed later, the Coulomb potential\ndecreases exponentially fast at large distance in the hyperbolic plane.\nIn the case of hard disks, after introducing the auxiliary function y(r) = g(r)eβu(r) ,\nwe can express the pressure as\nZ\nπρ ∞\nd\nβP\n=1+ 2\n(15)\ndr(cosh(κσ) − 1)y(r) exp(−βu(r))\nρ\nκ 0\ndr\nand using\n\nd\ndr\n\nexp(−βu(r)) = δ(r − σ) finally leads to\n\nβP\nπρ\n= 1 + 2 (cosh(κσ) − 1)g(σ + ).\n(16)\nρ\nκ\nAt low density, the radial distribution function at contact g(σ + ) goes to one, so that one\nrecovers the virial expansion in Eq. (5) to first order with the second virial coefficient\ngiven by Eq. (8).\n3. Integral equations\nIn liquid-state theory, approximate integral equations are a standard tool to describe\nthe structure and the thermodynamics of a system. The approach is based on the\n(exact) Ornstein-Zernike equation that relates the radial distribution function g(r), or\nmore precisely the so-called pair correlation function h(r) = g(r) − 1, to the direct\ncorrelation function c(r) which is obtained from the second functional derivative of the\ngrand potential with respect to local density fluctuations[32, 35]. In the hyperbolic\nplane, the Ornstein-Zernike equation reads\nZ\nh(r) = c(r) + ρ dA′ h(r ′ )c(t(r, r′))\n(17)\nwhere t(r, r′ ) is the modulus of the displacement associated with an element of the\nhyperbolic translation group[36]. (In Euclidean space, t(r, r′ ) = |r − r′ |.) Again, Eq.\n(17) should be considered as a bulk result, in which boundary effects have been removed\nwhen taking the thermodynamic limit.\nThe Ornstein-Zernike equation is more conveniently expressed after applying a\nFourier-Helgason transform (that generalizes the Fourier transform of the Euclidean\nspace):\nh̃(k) = c̃(k) + ρc̃(k)h̃(k).\n\n(18)\n\nNote that for an isotropic function h(r) as considered here, the Fourier-Helgason\ntransform becomes a Mehler-Fock transform[37]. For more details, see Appendix A.\nThe basis of the integral-equation approach for liquids is that the direct correlation\nfunction c(r) has a simpler structure and is shorter-ranged than h(r) and, as a\n\n\fThermodynamics and structure of simple liquids in the hyperbolic plane\n\n7\n\nconsequence, is a better starting point for approximations. Common approximations\nare the Percus-Yevick (PY) and hypernetted chain (HNC) closures in which the direct\ncorrelation function is taken as[32]\nc(r) = (1 + γ(r))(exp(−βu(r)) − 1)\n\n(PY)\n\nc(r) = exp(−βu(r) + γ(r)) − (1 + γ(r))(HNC),\n\n(19)\n(20)\n\nwhere γ(r) = h(r) − c(r).\nIn Euclidean geometry and for hard spheres, the PY closure (the direct correlation\nfunction is then zero beyond σ) is amenable to an analytical solution in spaces of odd\ndimensions[32, 38, 39, 40, 41, 42] and compares rather well with computer simulation\nresults. Recently, a semi-analytical solution of the PY integral equation has also been\nobtained in two-dimensional Euclidean space[43, 44]: the first ten virial coefficients\nhave been calculated and compared to Monte Carlo results. In addition, the PY\napproximation for hard discs has been numerically solved on a sphere[45].\nDue to the approximations involved in the integral-equation approach, going from\nthe structure of the fluid to its (bulk) thermodynamic properties depends on the route\nchosen. Once the pair correlation function is known, one may find the pressure with the\nhelp of the virial equation, Eq. (13), but also through the compressibility relation or\nthat for the excess internal energy[32]. For instance, the compressibility relation reads\nZ\nρkB T χT = 1 + ρ dA h(r),\n(21)\nwhere again only bulk contributions are considered.\nAt this point, it is important to stress a peculiar feature of the Fourier-Helgason\nR\ntransform: contrary to what occurs in Euclidean space, dA h(r) 6= h̃(0). Indeed, by\nusing the results of Appendix A, one finds that\nZ\n2π ∞\ndr sinh(κr)P−1/2 (cosh(κr))h(r)\nh̃(0) =\nκ 0\nZ\n2π ∞\n6=\ndr sinh(κr)h(r),\n(22)\nκ 0\nwhere P−1/2 (x) is a Legendre function of the first kind (conical function). As a\nconsequence, the bulk compressibility in H 2 is not given by the k = 0 value of\nthe Fourier-Helgason transform of the pair correlation function. On the other hand,\nneglecting the boundary effects, one still has\n1\nR\nρkB T χT =\n,\n(23)\n1 − ρ dA c(r)\nso that the bulk pressure can be obtained by a thermodynamic integration according to\nZ\nZ\n1 ρ ′ ′\nβP\ndA c(r; ρ′)\n(24)\ndρ ρ\n=1−\nρ\nρ 0\n\nwhere c(r, ρ) denotes the direct correlation function at the density ρ.\n\n\fThermodynamics and structure of simple liquids in the hyperbolic plane\n\n8\n\nFor the hard-sphere fluid in Euclidean space, the Percus-Yevick integral equation\nprovides a very accurate equation of state when the pressure is calculated with the\nfollowing empirical rule[32]:\n2Pc + Pv\n(25)\n3\nwhere Pc and Pv denote the \"compressibility\" and \"virial\" pressures obtained from Eqs.\n(24) and (14), respectively.\nNote finally that according to Eq. (21), a finite compressibility implies that\nR\ndA h(r) is finite, which in turn requires that h(r) decays at large distance faster than\nexp(−κr). A gas-liquid critical point with a diverging compressibility may thus occur\nwith a pair correlation function that decreases exponentially as exp(−κr). Assume for\ninstance that h(r) behaves as exp(−r/ξ) at large distance. One then finds, with again\nthe restriction that the integration is only over the bulk region far from the boundary,\nthat\n\u0015\n\u0013\n\u0014\n\u0012\nZ\n(κξ)2\n1 + κξ\n−( ξ1 −κ)L\n+ reg,\n(26)\ndA h(r) ∼\ne\n1−\n1 − (κξ)2\n2κξ\nr<L\nP =\n\nwhen L → +∞, where reg denotes regular, finite terms. The above expression diverges\nwhen κξ → 1− . If ξ is a regular function of T and ρ when ξ < κ−1 , this suggests\nthat the critical behavior found near to ξc = ξ(Tc , ρc ) = κ−1 is of mean-field type,\nwith classical exponents. In particular, the bulk compressibility χT would diverge as\n1/ (1 − (κξ)2 ) ∼ (T − Tc )−1 , implying that the critical exponent γ = 1. In addition,\nassuming that h(r) ∼ exp(−κr) at large distance at the critical point and using the\nknown expression of the Fourier-Helgason transform of 1/ cosh(κr)[37], it is easy to\nderive that the Fourier-Helgason transform h̃(k) of the pair correlation function is finite\nat k = 0, even if the compressibility diverges (which is a dramatic illustration of Eq.\n(22)), and has a regular expansion in (k/κ)2 when (k/κ) → 0.\nThe expected mean-field nature of the gas-liquid critical point in H 2 has the\nvery same origin as the mean-field character of the critical point of the Ising model\nin hyperbolic geometry[1, 4, 15]: the divergence of the compressibility/susceptibility\nis controlled by the exponential growth with distance of the differential surface area\nassociated with the hyperbolic metric. An approximate description of the gas-liquid\ncritical behavior will also be provided in section 5.2.\n4. Coulombic systems\n\nWe now consider systems of particles interacting through a Coulomb potential, as\nwas done before by Jancovici and coworkers[19, 18, 17]. For a monodisperse system\n(particles with equal charges of the same sign), it is necessary to add a charged uniform\nbackground such that the global electroneutrality is satisfied, thereby allowing a proper\nthermodynamic limit. In the limit of point-like particles, this corresponds to the onecomponent plasma model (OCP). When considering a binary mixture of two species of\noppositely charged particles (with charges ±q) in equal concentrations, it is possible to\n\n\fThermodynamics and structure of simple liquids in the hyperbolic plane\n\n9\n\nobtain a well-defined thermodynamic limit without introducing a charged background:\nin the limit of point-particles, this is the two-component plasma model (TCP). In this\nlatter case, the system is stable at high temperature, down to a temperature at which\na collapse of pairs of opposite charges occurs. When the charged particles have an\nadditional hard-core interaction and at low charge density, the system undergoes a\nKosterlitz-Thouless transition at a lower temperature Tc = q 2 /(4kB )[46, 47].\nThe Coulomb potential is formally defined as the solution of the Poisson equation,\nwhich is related to the Green's function of the following inhomogeneous Laplace\nequation:\n∆v(r, φ) = −2πδ (2) (r, φ),\n\n(27)\n\nwhere ∆ is the Laplacian operator and δ (2) (r, φ) the Dirac distribution in the appropriate\nmanifold. In the Euclidean plane and for a function depending on the radial coordinate\nonly, ∆ is given by\n\u0012\n\u0013\n∂v(r)\n1 ∂\nr\n,\n(28)\n∆v(r) =\nr ∂r\n∂r\nand the solution of Eq. (27) is\nv(r) = − ln(r/L)\n\n(29)\n\nwhere L is an arbitrary length. Therefore in two dimensions, the Coulombic interaction\npotential diverges with the distance, even if the associated force remains a (slow)\ndecreasing function of the distance.\nOn the other hand, in the hyperbolic plane, the Laplacian acts on a function of the\nradial coordinate as\n\u0012\n\u0013\n∂v(r)\n1\n∂\nsinh(κr)\n.\n(30)\n∆v(r) =\nsinh(κr) ∂r\n∂r\nThe solution of the inhomogeneous Laplace equation is then given by\n\u0010\n\u0010 κr \u0011\u0011\nv(r) = − ln tanh\n,\n(31)\n2\nso that the pair interaction between two point particles with charges q1 and q2 at a\ngeodesic distance r is equal to q1 q2 v(r) with v(r) given above. The curvature of the\nhyperbolic plane thus introduces a screening of the Coulomb interaction. Indeed, v(r)\nnow decreases as exp(−κr) at large distance beyond κ−1 .\nIt is possible to derive analytical expressions for the thermodynamic quantities\nin two cases: the high-temperature limit, where the Debye-Hückel approximation is\nasymptotically exact, and the particular value of the temperature T = q 2 /(2kB ), where\na large amount of exact results have been obtained both in the Euclidean and in the\nhyperbolic plane. In the following we shall consider the two models introduced above,\nthe OCP and the TCP. (To extend the investigation beyond the two cases considered\nhere, one could use the HNC integral equation which is known to give a good description\nof the pair correlation function in flat space[32], but this is left for future work.)\n\n\fThermodynamics and structure of simple liquids in the hyperbolic plane\n\n10\n\n4.1. One-component plasma (OCP)\nFor the OCP, the charged background provides a uniform neutralizing contribution.\nAssuming a perfect compensation amounts to replace g(r) by h(r) = g(r) − 1 in the\nexpression of the virial equation of state. After taking the derivative of Eq. (31), the\nequation of state can be written as\nZ\n(cosh(κr) − 1)\nπβq 2 ρ ∞\nβP\ndrh(r)\n=1+\n,\n(32)\nρ\nκ\nsinh(κr)\n0\nwhere, we recall, P is the bulk thermodynamic pressure. (For a discussion of the different\ndefinitions of pressure in the OCP in the hyperbolic plane, see Fantoni et al.[18].) We\nshall show that the above equation of state reduces to known results in the appropriate\nlimits.\nNote that generalized Stillinger-Lovett sum rules are satisfied by the OCP in the\nhyperbolic plane[17], namely:\nZ\ndA h(r) = −1,\n(33)\n4πρβ\nκ2\n\nZ\n\ndA h(r) ln(cosh(κr/2) = −1.\n\n(34)\n\nThese rules express the fact that the system is a conductor (in which therefore electroneutrality and screening hold).\nIn the high-temperature limit, the Debye-Hückel approximation becomes\nasymptotically exact and provides an analytical expression for the pair correlation\nfunction h(r)[19, 17]:\nh(r) = −βq 2 Qν (cosh(κr)),\n\n(35)\n\nwhere q is the charge of the particles and Qν is a Legendre function of the second kind\nwith an index ν given by\nr\n1\n1\nπβρq 2\nν=− +\n+2 2 .\n(36)\n2\n4\nκ\nOne can check that the expression in Eq. (35) satisfies the two above sum rules.\nWe can now combine the generalized virial equation of state that we have derived\nwith the Debye-Hückel expression for h(r). Inserting Eq. (35) in Eq. (32) leads to the\nfollowing equation of state:\nZ\nπ(βq 2 )2 ρ ∞ Qν (x)\nβP\n=1−\n.\n(37)\ndx\nρ\nκ2\nx+1\n1\nFor a fixed nonzero curvature (κ > 0), Eq. (36) shows that ν → 0 in the high\u0001\nand using that\ntemperature limit (β → 0); knowing that Q0 (x) = 21 ln 1+x\n1−x\n\u0001\nZ ∞ 1\nln 1+x\nπ2\n2\n1−x\n= ,\n(38)\n1+x\n12\n1\n\n\fThermodynamics and structure of simple liquids in the hyperbolic plane\n\n11\n\none finally obtains that\nπ 3 (βq 2 )2 ρ\nβP\n=1−\n.\n(39)\nρ\n12κ2\nThis expression coincides with the dominant term in the high-temperature limit of the\nvirial expansion derived by Jancovici and Tellez[19].\np\nOn the other hand, when κ → 0 (faster than β 1/2 ), ν ∼ 2πβρq 2 /κ → +∞ and\none has\nZ ∞\nQν (x)\n1\ndx\n∼ 2.\n(40)\n1+x\n2ν\n1\nThe pressure is then given by\nβq 2\nβP\n=1−\n,\nρ\n4\n\n(41)\n\nwhich corresponds to the result in the Euclidean limit[48].\nWe next consider the specific value of the temperature T = q 2 /(2kB ), usually\nexpressed in terms of the coupling parameter Γ = βq 2 = 2. After a mapping onto a\nnon-Hermitian fermionic field theory, Hastings[49] has obtained the exact expression of\nthe pair correlation function for Coulomb systems in the hyperbolic plane for this value\nof the coupling. For the OCP, this provides\n1\n.\n(42)\nh(r) = −\ncosh(κr/2)8πρ/κ2 +2\nAfter introducing the change of variable x = cosh(κr/2) and inserting Eq. (42) in Eq.\n(32), we obtain\nZ\n1\nβP\n2πβq 2 ρ ∞\ndx\n(43)\n=1−\n8πρ .\n2\nρ\nκ\n1\nx3+ κ2\nSince βq 2 = 2, the bulk thermodynamic pressure is finally given by\n2πρ + κ2\nβP\n=\n.\nρ\n4πρ + κ2\n\n(44)\n\nIn the low-density limit, this gives βP/ρ = 1 − (2π/κ2 )ρ + O(ρ2 ), which leads to the\nsame second virial coefficient as found in Ref. [19].\nWhen κ → 0, one recovers from Eq. (44) the exact Euclidean limit\n\n1\nβP\n= .\n(45)\nρ\n2\nConversely when κ → ∞, the pressure goes to the ideal-gas limit. This result seems to\nbe quite general, namely: the influence of the inter-particle interactions vanishes in the\nlarge-curvature limit.\n\n\fThermodynamics and structure of simple liquids in the hyperbolic plane\n\n12\n\n4.2. Two-component plasma (TCP)\nThe TCP has been investigated in Euclidean space[50, 51, 52, 53, 54]. For point particles,\nthe plasma is stable in the high-temperature conducting phase, for a coupling parameter\nβq 2 < 2. Adding a small hard-core repulsive potential allows one to obtain a stable phase\nat lower temperatures, up to a coupling βq 2 = 4 where a Kostelitz-Thouless transition\nbetween a conducting phase and a dipolar phase takes place. As for the OCP, the model\nis solvable for βq 2 = 2 in various geometries[55, 56, 57].\nThe bulk thermodynamic pressure of the TCP in the hyperbolic plane is expressable\nas\nZ\nπβq 2 ρ ∞\n(cosh(κr) − 1)\nβP\n=1+\ndr(h++ (r) − h+− (r))\n,\n(46)\nρ\nκ\nsinh(κr)\n0\nwhere h++ (r) and h−− (r) denote the pair correlation functions between particles of equal\ncharges and particles of opposite charges, respectively. In the high-temperature/lowcoupling limit, the Debye-Hückel approximation provides an accurate description of the\nconducting phase. For the TCP, the linearized Poisson equation is similar to that of the\nOCP. The pair correlation functions are then given by\nβq 2\nQν (κr).\n(47)\n2\nAfter inserting Eq.(47) in Eq.(46), one obtains an equation of state in the Debye-Hückel\napproximation which is equal to that of the OCP in the same approximation, Eq. (39).\nFor βq 2 = 2, Jancovici and Tellez[19] have obtained the exact expressions of the\npair correlation functions of the TCP (in the limit of very small hard-core interactions).\nHowever, the calculation of the equation of state via Eq. (46) becomes much more\ninvolved than for the OCP without bringing much new insight. Therefore, we have not\npursued in this direction.\nh++ (r) = −h+− (r) = −\n\n5. Short-range potentials\n5.1. The hard-disk fluid\nAs mentioned in Introduction, the hard-disk fluid has been considered in the context\nof geometrical frustration. Approximate equations of state combining the low-density\nexpansion and a description of close or nearly close packings have been proposed[20, 21,\n22].\nWe have solved the PY integral equation, which is known to be generally better\nthan the HNC one for hard spherical particles[32], for a large density range. Fig. 1\nshows the resulting radial distribution function g(r) for different values of the curvature\n≃ 0.55 (recall that the freezing area fraction in\nat an area fraction φ = ρ 2π(cosh(κσ/2)−1)\nκ2\nthe Euclidean plane is around 0.7[58]). We have also plotted the Euclidean counterpart\ncorresponding to κ = 0. It is striking that for a range of curvature parameter, κσ\nbetween 0 and 0.5, all curves are essentially superimposable: in this range, the pair\n\n\fThermodynamics and structure of simple liquids in the hyperbolic plane\n\n13\n\n4\n1.2\n\n3\ng(r)\n\n1\n\ng(r)\n\n0.8\n\n2\n\n0.6\n1.5\n\n2\nr\n\n2.5\n\n1\nκσ=0\nκσ=0.15\nκσ=0.5\nκσ=1.5\n\n0\n0.5\n\n1\n\n1.5\n\n2\n\n2.5 3\nr/σ\n\n3.5\n\n4\n\n4.5\n\n5\n\nFigure 1. Radial distribution function g(r) obtained from the PY equation at an\narea fraction φ = 0.55 for various values of the curvature: κσ = 0, 0.15, 0.5, 1.5. Only\nfor κ = 1.5, namely a radius of curvature smaller than the particle diameter, the\nstructure displays significant deviations from the Euclidean case. The inset zooms in\nthe region of the first minimum and second maximum: g(r) for κσ = 0.15 and for the\nEuclidean case are indistinguishable, whereas for κσ = 0.5, the extrema are slightly\nless pronounced.\n\ndistribution function g(r) is rather insensitive to curvature. An evolution is on the\nother hand clearly seen for stronger curvatures, e.g. κσ = 1.5.\nFrom the PY correlation function, we have calculated the equation of state through\nEqs. (14), (24), and (25). The results are illustrated in Fig. 2. Similarly to the\nEuclidean case, the compressibility route gives a higher bulk thermodynamic pressure\nthan the virial route, and the linear combination given in Eq. (25) lies in between.\nComparison with the molecular dynamics data of Ref. [20, 21] and with the equation\nof state proposed in Ref.[22] is performed in Fig. 3. At low area fractions simulation\ndata and predictions share the same behavior controlled by the second virial coefficient.\nHowever, the situation deteriorates for even moderate area fractions. (Note that the\nnumber of atoms in the simulation cell with periodic boundary condition is very small,\nalways less than 10.)\nIt is interesting to investigate the local order of the hard-disk fluid. The geometric\nfrustration induced by the negative curvature describes the impossibility of extending\nthe local order present in the dense fluid to tile the whole space. This is true for a nonzero\nbut small enough frustration for which the local order remains that of the Euclidean\nplane, i.e. the hexagonal order. As stressed by Rubinstein and Nelson[26], there is a\nseries of increasing curvature parameters κσ for which heptagonal, octagonal, etc..., local\norder can tile space without frustration. Two points however are worth stressing. First,\nsuch regular tilings are only a few of all possible tesselations of the hyperbolic plane.\n\n\f6\n\n6\n\n5\n\n5\n\n4\n\n4\nβP/ρ\n\nβP/ρ\n\nThermodynamics and structure of simple liquids in the hyperbolic plane\n\n3\n\n3\n\n2\n\n2\n\n1\n\n1\n\n0\n\n0\n\n0.1\n\n0.2\n\n0.3\nφ\n\n0.4\n\n0\n\n0.5\n\n14\n\n0\n\n0.1\n\n0.2\n\n0.3\nφ\n\n0.4\n\n0.5\n\nFigure 2. PY equation of state of the hard-disk fluid in H 2 versus area fraction φ. (a)\nκσ = 0.15: the upper curve corresponds to the compressibility route, the lower curve\nto the virial route, and the middle curve to the empirical rule in Eq. (25). (b) PY\nequation of state obtained from Eq. (25) for different curvatures: κσ = 0.15, 0.7, 1.06\nfrom bottom to top.\n\n8\n\nβP/ρ\n\n6\n\n4\n\n2\n\n0\n\n0\n\n0.1\n\n0.2\n\n0.3\n\nφ\n\n0.4\n\n0.5\n\n0.6\n\nFigure 3. Equation of state of the hard-disk fluid in H 2 versus area fraction φ:\ncomparison between the PY result combined with Eq. (25) (for κσ = 1.06) and the\nsimulation results of Ref. [21] for κσ = 1.060 (green squares) and κσ = 1.062 (blue\ndiamonds). The dash-dotted line is the prediction of Ref. [22] and the dashed line\ncorresponds to the equation of state truncated at the second virial coefficient.\n\n.\nModes and Kamien[20, 21] have rather focused on so-called isostatic regular packings,\ni.e. tilings of H 2 in which each atom has 4 neighbors (the {4, 5} tesselation for instance\n\n\fThermodynamics and structure of simple liquids in the hyperbolic plane\n\n15\n\ncan be realized as a close packing of disks for a curvature intermediate between the two\ncurvatures studied in their simulations: κσ = 1.0612). However, such isostatic packings\nhave a small density compared to the heptagonal {7, 3}, octagonal {8, 3}, etc..., tilings\nconsidered in Ref. [26]. Second, the local order in the equilibrium hard-disk fluid has\nnot actually been investigated as a function of curvature.\nOur study sheds some light on the latter question. From the knowledge of the\nradial distribution function, we have calculated the average coordination number Z̄ via\nthe formula\nZ σm\nsinh(κr)\ng(r),\n(48)\ndr\nZ̄ = 2πρ\nκ\nσ\nwhere σm corresponds to the distance between particles when g(r) attains the first\nminimum beyond the first peak. The results are plotted as a function of area fraction\nfor different values of the curvature in Fig. 4. As expected, the average coordination\nnumber increases with density and seems to saturate (we cannot access close packing\nvalues with the approximate PY integral equation). It also increases with the curvature\nparameter. The values at high density are in semi-quantitative agreement with the\nprediction of Rubinstein and Nelson[26] based on a fictive \"ideal\" random close packing,\nπ\n\u0013,\n\u0012\nZ̄(κσ) =\n(49)\n1\narcsin 2 cosh κσ\n(2)\na prediction that interpolates between the exact values of the tesselations: Z̄ = 6\nfor the {6, 3} tiling when κ = 0, Z̄ = 7 for the {7, 3} tiling when κσ = 1.0905..,\nZ̄ = 8 for the {8, 3} tiling when κσ = 1.5285.., etc.... The coordination number is\nclearly overestimated for large curvatures, e.g. κσ = 1.06, in the PY approximation and\nwe suspect that the validity of the approximate closures quite generally gets worse as\ncurvature increases.\n5.2. The truncated Lennard-Jones potential\nThe Lennard-Jones pair potential,\n\u0014\u0010 \u0011\n\u0015\nσ 12 \u0010 σ \u00116\nu(r) = 4ǫ\n−\nr\nr\n\n(50)\n\nis commonly used to model liquids in Euclidean space. However, as shown in\nsection 3, its power-law nature makes it inappropriate for hyperbolic geometry as\nno thermodynamic limit would be reachable. Physically, the (σ/r)6 term arises from\nLondon dispersion forces and its electrostatic origin suggests that the dependence on the\ngeodesic distance should be modified in the hyperbolic plane. Indeed, even the Coulomb\npotential that (logarithmically) increases with distance in two-dimensional Euclidean\nspace is found to decay exponentially in the hyperbolic plane with an intrinsic screening\nlength which is provided by the radius of curvature κ−1 . As for the (σ/r)12 term, it is\nmerely a convenient way to mimic a steeply repulsive potential between atoms and its\nalgebraic character has no physical foundation.\n\n\fThermodynamics and structure of simple liquids in the hyperbolic plane\n\n16\n\n8\n7\n6\n\nc\n\n5\n4\n3\n2\n1\n0\n\n0\n\n0.1\n\n0.2\n\n0.3\nφ\n\n0.4\n\n0.5\n\nFigure 4. Average coordination number versus area fraction φ for different values\nof the curvature, as obtained from the PY equation. From bottom to top: κσ =\n0.15, 0.7, 0.9, 1.06. The dashed horizontal lines indicate the maximum values predicted\nby Rubinstein and Nelson[26].\n\nTo preserve a proper thermodynamic limit in H 2 , the simplest procedure is to\ntruncate the Lennard-Jones potential, Eq. (50), beyond some cut-off distance rc : this\nshould not significantly alter the behavior of the liquid, provided rc is less than the radius\nof curvature κ−1 . This cut-off procedure is anyhow most often employed in the Euclidean\ncase in order to save computer time, and this will facilitate the comparison between the\nresults in Euclidean and hyperbolic planes. In the Euclidean plane, Glandt[59, 60] has\nobtained the numerical solution of the PY and HNC integral equations for the LennardJones interaction potential. In this case, the HNC equation becomes significantly more\naccurate than the PY equation as the density increases. (A comparison with simulations\nhas been performed in Ref.[61].)\nIn the present work, we have numerically solved both the PY and HNC integral\nequations for a large range of temperature and density. As in the case of the hard-disk\nfluid, we observe a very small evolution of the structure with the curvature and the\ndifferences between the PY and HNC closures are very small too up κσ ≃ 0.5 (curves\nnot worth showing here).\nWe first focus on the region of density and temperature close to the gas-liquid\ncritical point. A simple iterative procedure (Picard method) is then inefficient for\nconverging towards the solution of the integral equation. It is necessary to proceed\nwith a more sophiscated iterative scheme. We have combined the Newton method with\na conjugate gradient procedure[62, 63] (which avoids the operator inversion otherwise\npresent in the Newton method[64]). We have adapted this method to hyperbolic\ngeometry. Details are given in Appendix B.\n\n\fThermodynamics and structure of simple liquids in the hyperbolic plane\n\n17\n\n0.8\n\nχ\n\n-1\n\n0.6\n\n0.4\n\n0.2\n\n0\n\n0.05\n\n0.1\n\n0.15\n\nφ\n\n0.2\n\n0.25\n\nFigure 5. Inverse of the isothermal compressibility versus area fraction φ for the truncated Lennard-Jones fluid in the PY approximation near but above the critical temperature: from top to bottom , T = 0.640, 0.610, 0.580, 0.560, 0.530, 0.515, 0.490, 0.472.\nThe curvarture parameter is κσ = 0.5.\n\nWe illustrate these results for the PY closure and a reduced curvature κσ = 0.5.\nDifferents isotherms above the critical temperature are shown in Fig.5. The inverse of\nthe susceptibility reaches a minimum at each temperature and the successive minima\napproach zero as one gets closer to the critical point. Figure 6a displays the pair\ncorrelation functions at a reduced temperature T = 0.515 for several area fractions;\nthe log-linear plot clearly indicates that the decay is always exponential and faster than\nexp(−κr) (dotted straight line). A more stringent test of the long-distance behavior of\nthe pair correlation function h(r) is shown in Fig. 6b , where exp(κr)h(r) is plotted as a\nfunction of the distance r. One can see the approach to a plateau for large enough r as\none approaches the critical point. (The slowest decay corresponds to the area fraction\nat which the compressibility is maximum.)\nWe have also considered the liquid at a rather high density. Recently, we have\nperformed extensive molecular dynamics simulations of the monodisperse truncated\nLennard-Jones liquid in the hyperbolic plane (with periodic boundary conditions)[30].\nWe have shown that a small curvature indeed prevents long-range hexagonal (or hexatic)\nordering and leads to glass formation as temperature is lowered. Most results were\nobtained for a density ρσ 2 = 0.852. Fig. 7 displays the radial distribution function\ng(r) at an area fraction φ = 0.669 and a high temperature T = 3.259 for a curvature\nparameter κσ = 0.1 (ρσ 2 is then equal to 0.852). At this state point, the PY solution\nprovides a slightly better description of the simulation data than the HNC equation: the\nHNC equation underestimates the structure of the liquid at short distances (see the inset\nof Fig. 7). When the temperature is lowered to T = 1.885 (i.e., still above the freezing\n\n\fThermodynamics and structure of simple liquids in the hyperbolic plane\n\n10\n\n10\n\n0.1\n0.01\n\nφ=0.047\nφ =0.118\nφ=0.174\nφ=0.205\nφ=0.261\nφ=0.284\n\nh(r)exp(κr)\n\nφ=0.047\nφ =0.118\nφ=0.174\nφ=0.205\nφ=0.261\nφ=0.284\n\n1\n\nh(r)\n\n18\n\n0.001\n0.0001\n1e-05\n1e-06\n\n0\n\n5\n\n10\n\n15\nr/σ\n\n20\n\n25\n\n30\n\n0\n\n0\n\n5\n\n10\nr/σ\n\n15\n\n20\n\nFigure 6. (a) Log-linear plot of pair correlation function h(r) = g(r) − 1 in the PY\napproximation for T = 0.472. The behavior as a function of φ is non monotonous\nand the slowest decay is for φ = 0.118, which corresponds to the maximum of the\ncompressibility. The dotted line is exp(−κr). (b) Same data multiplied by exp(κr): a\nconvergence towards a constant plateau at large r is clearly visible as one approaches\nthe critical point. The curvature parameter is κσ = 0.5.\n\ntemperature in the Euclidean plane which is around T ∗ ≃ 0.75 at this density[30]), the\nHNC and PY closures are now of comparable agreement with the simulation data, but\nthe maximum of the first peak is overestimated. Overall, the agreement appears good\nwith either the PY or the HNC prediction.\n6. Conclusion\nWe have formulated a statistical-mechanical treatment for describing the thermodynamics and the structure of fluids embedded in the hyperbolic plane, focusing on the bulk\nbehavior. We have applied the formalism to the one- and the two-component plasma\nmodels, the hard-disk fluid and the (truncated) Lennard-Jones liquid model. The negative curvature of space provides an intrinsic length that screens the long-distance behavior of the pair correlations: this is observed both for the Coulombic interactions and\nfor the vicinity of the gas-liquid critical point. The formalism correctly reproduces the\nknown results in the appropriate limits and, via approximate integral equations and\nexact thermodynamic relations, it leads to predictions that compare well with existing\nsimulation data.\nA major motivation for studying liquids in the hyperbolic plane comes from the\ntheoretical description of jamming phenomena and glass formation in terms of geometric\nfrustration. Frustrated local hexagonal order in negatively curved space provides a\nsimple model to study the glass transition. Among the many theories proposed for\nexplaining the glass phenomenology, several attribute the slowing of relaxation with\n\n\fThermodynamics and structure of simple liquids in the hyperbolic plane\n\n3\n\n19\n\n4\n\n1.5\n\n1.5\n2.5\n2\n\n3\n\n1\n\ng(r)\n\ng(r)\n\n1.25\n1\n\n1.5\n\n0.5\n\ng(r)\n\ng(r)\n\n0.75\n1.5\n\n2\n\n1\n\n2.5\nr/σ\n\n3\n\n2\n\n0.5\n\n3.5\n\n1.5\n\n2\n\n2.5\nr/σ\n\n3\n\n3.5\n\n1\n0.5\n0\n\n0\n\n2\n\n4\n\n6\nr/σ\n\n8\n\n10\n\n0\n\n0\n\n2\n\n4\n\n6\n\n8\n\n10\n\nr/σ\n\nFigure 7. Radial distribution function g(r) of the (truncated) Lennard-Jones liquid\non H 2 for a curvature parameter κσ = 0.1, an area fraction φ = 0.669, and two\ndifferent temperatures: left, T = 3.259; right, T = 1.885. The circles correspond to\nthe simulation data, the full (red) curve to the PY equation, and the dashed (blue)\ncurve to the HNC equation. The inset zooms in on the region near the first minimum\nand the following extrema.\n\ndecreasing temperature to the presence of a very large number, actually exponential in\nthe system size, of metastable states of low energy or free energy[65, 66, 67]. Techniques\nborrowed from spin-glass theory such as the replica formalism have been applied to\nliquid models in three dimensions to check for the existence of such a multitude of\nmetastable states, and evidence has been provided within mean-field-like liquid-state\napproximations[68, 69, 70]. Since in some sense, the hyperbolic metric induces in\nstatistical systems some features of mean-field models, one may wonder whether a\nglassforming liquid in the hyperbolic plane such as the truncated Lennard-Jones model\nalso possesses a complex free-energy landscape at low temperature. The integralequation approach developed in the present formalism can be combined with the replica\nmethod to address this point. Work in this direction is in progress.\nP.V. acknowledges B. Jancovici for useful suggestions on Coulombic systems.\nAppendix A. Harmonic analysis in the hyperbolic plane.\nIn H 2 it is possible to define a generalization of the usual spatial Fourier transform, the\nFourier-Helgason transform. For a generic function f of the polar coordinates r, φ, it is\ndefined as [37]\nZ\na\n ̃\nf (a, t) = drdφ sinh(r)eiaφ P−1/2+it\n(cosh(r))f (r, φ),\n(A.1)\n\n\fThermodynamics and structure of simple liquids in the hyperbolic plane\n\n20\n\na\nwhere P−1/2+it\n(x) is a Legendre function of the first kind (conical function). The inverse\nFourier-Helgason transform is given by\nZ\n1 X\na\ndt t tanh(πt)e−iaφ\n(−1)\nf (r, φ) =\n2π a∈Z\nt>0\n−a\nP−1/2+it\n(cosh(r))f ̃(a, t).\n\n(A.2)\n\nFor isotropic (SO(2) invariant) functions, the Fourier-Helgason transform reduces\nto a Mehler-Fock transform[37], the dependence on a disappears and for a curvature\nparameter κ one obtains\nZ ∞\n2π\nf ̃(k) =\ndr sinh(κr)P−1/2+i k (cosh(κr))f (r).\n(A.3)\nκ\nκ 0\nThe inverse transform is then equal to\nZ\nk\n1\ndk k tanh(π )P−1/2+i k (cosh(κr))f ̃(k).\n(A.4)\nf (r) =\nκ\n4π\nκ\nLet us show how one can recover the Euclidean limit when κ → 0. Starting from the\nintegral representation of the Legendre functions of the first kind[37],\nZ\n√\nΓ(μ + λ + 1) 2π\nμ\nPλ (z) =\ndu[z + z 2 − 1 cos(u)]λ eiμu ,\n(A.5)\n2πΓ(λ + 1) 0\none obtains that\nP−1/2+i k (cosh(κr)) =\nκ\nZ 2π\nk\n1\ndu[cosh(κr) + sinh(κr) cos(u)]−1/2+i κ ,\n2π 0\nand when κ goes to zero, one finds that\nZ 2π\n1\ndueikr cos(u) = J0 (kr)\n2π 0\n\n(A.6)\n\n(A.7)\n\nwhere J0 (r) is a Bessel function of the first kind. Finally, the Fourier-Helgason transform,\nEq.(A.3), becomes\nZ ∞\n ̃\nf (k) = 2π\nrdrJ0(kr)f (r),\n(A.8)\n0\n\nwhich corresponds to the standard Fourier transform in two dimensions.\nIn a similar way, the inverse Helgason transform goes to\nZ ∞\n1\nf (r) =\ndkJ0 (kr)f ̃(k).\n(A.9)\n2π 0\nThe Fourier-Helgason transform satisfies the convolution theorem: if f and g are\nSO(2) invariant functions, one has\n^\n(f\n∗ g)(k) = f ̃(k)g̃(k),\n\n(A.10)\n\nwhere the star denotes the convolution product[71].\nFinally, by using an exact Mehler-Fock transform, we illustrate the result given in\nEq.(22): the Fourier-Helgason transform of a given function f when k → 0 is not equal\n\n\fThermodynamics and structure of simple liquids in the hyperbolic plane\n\n21\n\nto the integral of this function in the hyperbolic plane. We consider f (r) = cosh(κr)−a .\nWith the change of variable w = cosh(κr), the integral of f is obviously equal to\nZ ∞\n1\n(A.11)\ndww −a =\n1+a\n1\nwhereas the Fourier-Helgason transform for k = 0 is given by\n\u0001\n\u0001\nZ ∞\nΓ a2 + it2 − 41 Γ a2 − it2 − 41 2a−2\na\n√\nw P1/2+it dw =\n(A.12)\nΓ (a) π\n1\nwhere t = k/κ. The second-order expansion of Eq.(A.12) is equal to\n\u0001\u00012 a\n2\nΓ a2 − 14\n√\n4Γ (a) π\n\u0001\n\u0001\n\u0001\n\u0001\n\u0001\u00012\n4 Ψ 1, a2 + 34 a2 − 4 Ψ 1, a2 + 34 a + Ψ 1, a2 + 34 + 16 2a Γ a2 − 41\nt2\n−\n2√\n16 (2 a − 1) πΓ (a)\n\u0001\n3\n+O t\n\n(A.13)\n\nApart from the limiting case a → ∞, the integral over the whole space is different from\nthe Fourier Helgason transform at k = 0. In addition, the function f (r) has a definite\nintegral only when a > 1, whereas the Fourier-Helgason transform at k = 0 is defined\nfor a > 1/2. We also note that the coefficient of the second order in the expansion in t\nis always negative for a > 1/2.\nAppendix B. Solving integral equations in H 2 : the numerical procedure.\nFor solving integral equations, the basic method is an iterative procedure, known as\nthe Picard method, which can be easily adapted to systems in the hyperbolic plane as\nfollows: Starting from an initial value of γ0 (r) = h0 (r) − c0 (r), c0 (r) is obtained by\nusing the closure equation, Eq.(19) for PY or Eq.(20) for HNC. We next perform the\nMehler-Fock transform of c0 (r). From c̃0 (k), and using Eq.(18), we calculate γ̃new (k)\nthrough the Ornstein-Zernike equation, namely,\nγ̃(k) =\n\nρc̃(k)2\n.\n1 − ρc̃(k)\n\n(B.1)\n\nFinally, we transform back γ̃new (k) to obtain a new function γ1 (r). The solution is taken\nas a barycenter of γ0 (r) and γnew (r) , namely γ1 (r) = αγ0 (r) + (1 − α)γnew (r) where α is\na mixing parameter. The whole procedure is repeated and we consider that convergence\nis reached when |γn (r) − γn+1 (r)| < ǫ where ǫ ∼ 10−8 .\nNote that the Mehler-Fock transform (Fourier-Helgason transform of SO(2)\ninvariant functions) is implemented by using the Legendre or conical functions\nP−1/2+it (r). These functions are available in the Gnu Scientific Library and are tabulated\nfor saving computer time. The number of points in real and reciprocal space was equal\nto 1600, and integration was performed with a Simpson rule. In regions of the phase\ndiagram, far from the coexistence curves and the freezing transition line, the above\nprocedure converges rapidly.\n\n\fThermodynamics and structure of simple liquids in the hyperbolic plane\n\n22\n\nHowever, in the vicinity of the critical point, the Picard method exhibits extremely\nslow convergence and a Newton method is more appropriate for solving integral\nequations. In addition, the equations of the Newton method are not solved by a\ndirect inversion of the associated operator (or of the large matrix obtained after\ndiscretization of the functions), but by a more efficient procedure, the conjugate gradient\nmethods[64, 72]: it consists in solving the equations by using an iterative method that\navoids the inversion of a large matrix (or an operator). The derivation of the method is\ndone below for the PY closure, but it can be easily modified for the HNC closure.\nAfter differenciating Eq.(18)and (19), and letting f (r) denote the Mayer function,\nthe equations involved in the Newton method are then given by\n(1 − ρc̃(k))δγ̃(k) − ρ(γ̃(k) + 2c̃(k))δc̃(k) = ρ(γ̃(k) + c̃(k))c̃(k) − γ̃(k)(B.2)\n\nδc(r) − f (r)δγ(r)\n\n= −c(r) + f (r)(1 + γ(r)) (B.3)\n\nwhere δc(r)(δc̃(k)) and δγ(r)(δγ̃(k)) are solutions of the Newton equations.\nBy taking the Fourier-Helgason transform of Eq.(B.3), one eliminates δc and one\nobtains an equation of the form\nAδγ̃(k) = B\n\n(B.4)\n\nwhere A is an operator such that\ng\nAg̃(k) = (1 − ρc̃(k))g̃(k) − ρ(γ̃(k) + 2c̃(k))(f\ng)(k)\n\n(B.5)\n\nand B is given by\n\ng\n ̃\nB = (−c̃(k)+ f(k)+\n(f\nγ)(k))ρ(γ̃(k)+c̃(k))+ρ(γ̃(k)+c̃(k))c̃(k)−γ̃(k).(B.6)\n\nThe adjoint operator A† is given by\n\nA† g̃(k) = (1 − ρc̃(k))g̃(k) − ρ(f^\n(γ ∗ g) + 2f^\n(c ∗ g))\n\n(B.7)\n\nwhere ∗ denotes the convolution product.\nIn order to solve the linear system, Eq.(B.4), the solution is built on a sequence of\nfunctions in mutually conjugate directions. We introduce the inner product in FourierHelgason space:\n\u0012 \u0013\nZ\nπk\nk\nX̃(k)Ỹ (k).\n(B.8)\n(X̃, Ỹ ) = dk tanh\nκ\nκ\nStarting with the initial conditions\nR0 = A† B\n\n(B.9)\n\nP0 = R0\n\n(B.10)\n\nthe iterative procedure is given as follows:\n• Calculate the coefficient αk ,\nαk =\n\n(Rk , Rk )\n.\n(Apk , Apk )\n\n(B.11)\n\n\fThermodynamics and structure of simple liquids in the hyperbolic plane\n\n23\n\n• The residual and the solution become\nRk+1 = Rk − αk A† APk\n\n(B.12)\n\nXk+1 = Xk + αk Pk .\n\n(B.13)\n\n• The next conjugate direction is given by the relation\nPk+1 = Rk+1 + βk Pk\n\n(B.14)\n\nwith\nβk =\n\n(Rk+1 , Rk+1 )\n.\n(Rk , Rk )\n\n(B.15)\n\nThe iterative procedure is stopped when (Rk+1 , Rk+1 ) < ǫ (ǫ ∼ 10−10 in practice).\nWe then take the inverse Fourier-Helgason transform of the solution δγ̃(k), and with\nthe help of Eq.(B.3), we derive δc(r), and finally δc̃(k) by a Fourier-Helgason transform.\nWe next update the functions γ and c in both real and reciprocal spaces :\nγ1 = γ0 + δγ and c1 = c0 + δc. The inner product b = (B, B) (where B is given\nby Eq.(B.6)) is calculated by using the updated functions γ and c. So, as long as b > ǫ′\nwith ǫ′ ∼ 10−8 , the iterative procedure is repeated.\nReferences\n[1] R. Rietman, B. Nienhuis, and J Oitmaa. The Ising model on hyperlattices. J. Phys. A: Math.\nGen., 25:6577–6592, 1992.\n[2] C. Chris Wu. Ising models on hyperbolic graphs. J. Stat. Phys., 85:251–259, 1996.\n[3] C. Chris Wu. Ising models on hyperbolic graphs II. J. Stat. Phys., 100:893–904, 2000.\n[4] J. C. Anglès d'Auriac, R. Mélin, P. Chandra, and B. Douçot. Spin models on non-Euclidean\nhyperlattices: Griffiths phases without extrinsic disorder. J. Phys. A: Math. Gen., 34(4):675–\n693, 2001.\n[5] I. Benjamini and O. Schramm. Percolation in the hyperbolic plane. J. Amer. Math. Soc., 14:487–\n507, 2001.\n[6] H. Shima and Y. Sakaniwa. The dynamic exponent of the Ising model on negatively curved\nsurfaces. J. Stat. Mech., 2006(08):P08017, 2006.\n[7] H. Shima and Y. Sakaniwa. Geometric effects on critical behaviours of the Ising model. J. Phys.\nA: Math. Gen., 39:4921–4933, 2006.\n[8] K. Ueda, R. Krcmar, A. Gendiar, and T. Nishino. Corner transfer matrix renormalization group\nmethod applied to the Ising model on the hyperbolic plane. arXiv:0704.1949, 2007.\n[9] S. K. Baek, P. Minnhagen, and B. J. Kim. Phase transition of XY model in heptagonal lattice.\nEurophys. Lett., 79:26002, 2007.\n[10] A. Gendiar, R. Krcmar, K. Ueda, and T. Nishino. Phase transition of clock models on a\nhyperbolic lattice studied by corner transfer matrix renormalization group method. Phys. Rev.\nE, 77:041123, 2008.\n[11] S. K. Baek, H. Shima, and B. J. Kim. Curvature-induced frustration in the XY model.\narXiv:0811.1895.\n[12] R. Krcmar, T. Iharagi, A. Gendiar, and T. Nishino. Tricritical point of the J1 -J2 Ising model on\na hyperbolic lattice. Phys. Rev. E, 78(6):061119, 2008.\n[13] S. K. Baek, P. Minnhagen, and B. J. Kim. Percolation on hyperbolic lattices. Phys. Rev. E,\n79(1):011124, 2009.\n\n\fThermodynamics and structure of simple liquids in the hyperbolic plane\n\n24\n\n[14] Curtis G. Callan and Frank Wilczek. Infrared behavior at negative curvature. Nuclear Physics\nB, 340:366–386, 1990.\n[15] B. Doyon and P. Fonseca. Ising field theory on a pseudosphere. J. Stat. Mech., page P07002,\n2004.\n[16] L. R. A. Belo, N. M. Oliveira-Neto, W. A. Moura-Melo, A. R. Pereira, and E. Ercolessi. Heisenberg\nmodel on a space with negative curvature: Topological spin textures on the pseudosphere. Phys.\nLett. A, 365:463–468, 2007.\n[17] B. Jancovici and G. Téllez. Charge fluctuations for a Coulomb fluid in a disk on a pseudosphere.\nJ. Stat. Phys., 116:205–230, 2004.\n[18] R. Fantoni, B. Jancovici, and G. Téllez. Pressures for a one-component plasma on a pseudosphere.\nJ. Stat. Phys., 112(1):27–57, 2003.\n[19] B. Jancovici and G. Téllez. Two-dimensional Coulomb systems on a surface of constant negative\ncurvature. J. Stat. Phys., 91:953–977, 1998.\n[20] C. D. Modes and R. D. Kamien. Hard disks on the hyperbolic plane. Phys. Rev. Lett.,\n99(23):235701, 2007.\n[21] C. D. Modes and R. D. Kamien. Geometrical frustration in two dimensions: Idealizations and\nrealizations of a hard-disk fluid in negative curvature. Phys. Rev. E, 77(4):041125, 2008.\n[22] M. López de Haro, A. Santos, and S. B. Yuste. Simple equation of state for hard disks on the\nhyperbolic plane. J. Chem. Phys., 129(11):116101, 2008.\n[23] J.-F. Sadoc and R. Mosseri. Geometrical frustration. Cambridge University Press, Cambridge,\n1999.\n[24] D. R. Nelson. Defects and geometry in condensed matter physics. Cambridge University Press,\nCambridge, 2002.\n[25] D. R. Nelson. Liquids and glasses in spaces of incommensurate curvature. Phys. Rev. Lett.,\n50(13):982–985, 1983.\n[26] M. Rubinstein and D. R. Nelson. Dense-packed arrays on surfaces of constant negative curvature.\nPhys. Rev. B, 28(11):6377–6386, 1983.\n[27] C. Brito and M. Wyart. On the rigidity of a hard-sphere glass near random close packing.\nEurophys. Lett., 76(1):149–155, 2006.\n[28] D. Kivelson, S.A. Kivelson, X. Zhao, Z. Nussinov, and G. Tarjus. A thermodynamic theory of\nsupercooled liquids. Physica A, 219:27–38, 1995.\n[29] G. Tarjus, S. A. Kivelson, Z. Nussinov, and P. Viot. The frustration-based approach of supercooled\nliquids and the glass transition: a review and critical assessment. J. Phys.: Condens. Matter,\n17(50):R1143–R1182, 2005.\n[30] F. Sausset, G. Tarjus, and P. Viot. Tuning the fragility of a glass-forming liquid by curving space.\nPhys. Rev. Lett., 101(15):155701, 2008.\n[31] F. Sausset and G. Tarjus. Periodic boundary conditions on the pseudosphere. J. Phys. A: Math.\nGen., 40:12873–12899, 2007.\n[32] J.-P. Hansen and I. R. McDonald. Theory of simple liquids. Academic Press, 1986.\n[33] J. S. Rowlinson and B. Widom. Molecular Theory of Capillarity. Clarendon, Oxford, 1982.\n[34] E. Kierlik, M. L. Rosinberg, G. Tarjus, and P. Monson. The pressure of a fluid confined in a\ndisordered porous material. J. Chem. Phys., 103(10):4256–4260, 1995.\n[35] G. Stell. Correlation functions and their generating functionals,. In Phase Transitions and Critical\nPhenomena, volume 5b. C. Domb and M. S. Green (Academic, London), 1976.\n[36] A. F. Beardon. The geometry of discrete groups. Springer-Verlag, New York, Heidelberg, Berlin,\n1983.\n[37] A. Terras. Harmonic analysis on symmeric spaces and applications. Springer-Verlag, New York,\n1985.\n[38] E. Leutheusser. Exact solution of the Percus-Yevick equation for a hard-core fluid in odd\ndimensions. Physica A, 127(3):667–676, 1984.\n[39] M. Robles, M. López de Haro, and A. Santos. Percus-Yevick theory for the structural properties\n\n\fThermodynamics and structure of simple liquids in the hyperbolic plane\n[40]\n[41]\n\n[42]\n[43]\n[44]\n[45]\n[46]\n[47]\n[48]\n[49]\n[50]\n[51]\n[52]\n[53]\n[54]\n[55]\n[56]\n[57]\n[58]\n[59]\n[60]\n[61]\n\n[62]\n[63]\n[64]\n\n25\n\nof the seven-dimensional hard-sphere fluid. J. Chem. Phys., 126(1):016101, 2007.\nRené D. Rohrmann and Andrés Santos. Structure of hard-hypersphere fluids in odd dimensions.\nPhys. Rev. E, 76(5):051202, 2007.\nM. Robles, M. López de Haro, and A. Santos. Erratum: \"equation of state of a seven-dimensional\nhard-sphere fluid. Percus-Yevick theory and molecular-dynamics simulations\". J. Chem. Phys.,\n125(21):219903, 2006.\nM. Bishop, N. Clisby, and P. A. Whitlock. The equation of state of hard hyperspheres in nine\ndimensions for low to moderate densities. J. Chem. Phys., 128(3):034506, 2008.\nM. Adda-Bedia, E. Katzav, and D. Vella. Solution of the Percus-Yevick equation for hard disks.\nJ. Chem. Phys., 128(18):184508, 2008.\nM. Adda-Bedia, E. Katzav, and D. Vella. Solution of the percus–yevick equation for hard\nhyperspheres in even dimensions. J. Chem. Phys., 129(14):144506, 2008.\nS.V. Lishchuk. Equation of state of the hard-disk fluid on a sphere from percus-yevick equation.\nPhysica A, 369(2):266 – 274, 2006.\nJ. M. Caillol and D. Levesque. Low-density phase diagram of the two-dimensional Coulomb gas.\nPhys. Rev. B, 33(1):499–509, 1986.\nJ. Lidmar and M. Wallin. Monte Carlo simulation of a two-dimensional continuum Coulomb gas.\nPhys. Rev. B, 55(1):522–530, 1997.\nA. Torres and G. Téllez. Finite-size corrections for Coulomb systems in the Debye-Hückel regime.\nJ. Phys. A: Math. Gen., 37(6):2121–2137, 2004.\nM.B. Hastings. Non-hermitian fermion mapping for one-component plasma. J. Stat. Phys.,\n90(1):311–326, 1998.\nJ.P. Hansen and P. Viot. Pair correlations and internal energy of the two-dimensional Coulomb\ngas. Phys. Lett. A, 95(3-4):155–158, 1983.\nL. Samaj and I. Travenec. Thermodynamic properties of the two-dimensional two-component\nplasma. Journal of Statistical Physics, 101(3):713–730, November 2000.\nL. Samaj. Universal finite-size effects in the two-dimensional asymmetric coulomb gas on a sphere.\nPhysica A: Statistical Mechanics and its Applications, 297(1-2):142 – 156, 2001.\nL. Samaj and B. Jancovici. Large-distance behavior of particle correlations in the two-dimensional\ntwo-component plasma. J. Stat. Phys., 106:301–321, 2002.\nL. Samaj and B. Jancovici. Density correlations in the two-dimensional coulomb gas. J. Stat.\nPhys., 106:323–355, 2002.\nM. Gaudin. Critical isotherm of a lattice plasma. J. Phys. France, 46(7):1027–1042, 1985.\nF. Cornu and B. Jancovici. The electrical double layer: A solvable model. J. Chem. Phys.,\n90(4):2444–2452, 1989.\nG. Téllez. Two-component plasma in a gravitational field. J. Chem. Phys., 106(20):8572–8578,\n1997.\nA. Santos, M. López de Haro, and S. Bravo Yuste. An accurate and simple equation of state for\nhard disks. J. Chem. Phys., 103(11):4622–4625, 1995.\nE. D. Glandt and D. D. Fitts. Percus–Yevick equation of state for the two-dimensional LennardJones fluid. J. Chem. Phys., 66(10):4503–4508, 1977.\nE. D. Glandt and D. D. Fitts. Hypernetted-chain equation of state for the two-dimensional\nLennard-Jones fluid. J. Chem. Phys., 68(10):4546–4550, 1978.\nR. R. Singh, K. S. Pitzer, J. J. de Pablo, and J. M. Prausnitz. Monte Carlo simulation of phase\nequilibria for the two-dimensional Lennard-Jones fluid in the Gibbs ensemble. J. Chem. Phys.,\n92(9):5463–5466, 1990.\nG. Zerah. An efficient Newton's method for the numerical solution of fluid integral equations.\nJournal of Computational Physics, 61(2):280–285, 1985.\nL. Belloni. Inability of the hypernetted chain integral equation to exhibit a spinodal line. The\nJournal of Chemical Physics, 98(10):8080–8095, 1993.\nM. J. Gillan. A new method of solving the liquid structure integral equations. Mol. Phys.,\n\n\fThermodynamics and structure of simple liquids in the hyperbolic plane\n[65]\n[66]\n[67]\n[68]\n[69]\n[70]\n[71]\n[72]\n\n26\n\n38(6):1781–1794, 1979.\nM. Goldstein. Viscous liquids and the glass transition: A potential energy barrier picture. J.\nChem. Phys., 51(9):3728, 1969.\nF. H. Stillinger. A topographic view of supercooled liquids and glass formation. Science, 267:1935,\n1995.\nT. R. Kirkpatrick, D. Thirumalai, and Peter G. Wolynes. Scaling concepts for the dynamics of\nviscous liquids near an ideal glassy state. Phys. Rev. A, 40(2):1045, 1989.\nY. Singh, J. P. Stoessel, and P. G. Wolynes. Hard-sphere glass and the density-functional theory\nof aperiodic crystals. Phys. Rev. Lett., 54(10):1059–1062, 1985.\nM. Mézard and G. Parisi. Thermodynamics of glasses: A first principles computation. Phys. Rev.\nLett., 82(4):747, 1999.\nG. Parisi and F. Zamponi. Mean field theory of the glass transition and jamming of hard spheres.\narXiv:0802.2180v2.\nB. J. Gonzalez and E. R. Negrin. Mehler-Fock transforms of generalized functions via the method\nof adjoints. Proc. Amer. Math. Soc., 125:3243–3253, 1997.\nJ. Brader. Solution of the Ornstein-Zernike equation in the critical region. Int.. J. Thermophys.,\n27(2):394–412, 2006.\n\n\f"}