{"id": "http://arxiv.org/abs/1011.1712v2", "guidislink": true, "updated": "2010-12-15T01:40:39Z", "updated_parsed": [2010, 12, 15, 1, 40, 39, 2, 349, 0], "published": "2010-11-08T05:02:38Z", "published_parsed": [2010, 11, 8, 5, 2, 38, 0, 312, 0], "title": "Synchrotron Blob Model of Infrared and X-ray Flares from Sagittarius\n  A$^*$", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1011.6219%2C1011.3896%2C1011.1056%2C1011.6274%2C1011.4365%2C1011.5850%2C1011.4953%2C1011.0502%2C1011.0100%2C1011.2737%2C1011.3455%2C1011.6317%2C1011.2016%2C1011.5132%2C1011.3064%2C1011.2377%2C1011.4712%2C1011.0467%2C1011.2383%2C1011.2092%2C1011.3780%2C1011.0796%2C1011.1590%2C1011.2104%2C1011.4297%2C1011.5065%2C1011.3041%2C1011.3149%2C1011.3394%2C1011.5278%2C1011.5346%2C1011.4519%2C1011.4967%2C1011.1594%2C1011.0497%2C1011.2428%2C1011.3497%2C1011.4567%2C1011.3432%2C1011.1071%2C1011.1712%2C1011.5584%2C1011.3901%2C1011.5027%2C1011.3357%2C1011.4509%2C1011.3648%2C1011.3554%2C1011.0179%2C1011.0561%2C1011.0503%2C1011.6415%2C1011.1333%2C1011.2569%2C1011.4582%2C1011.0374%2C1011.4238%2C1011.3083%2C1011.2116%2C1011.1652%2C1011.5866%2C1011.0377%2C1011.0765%2C1011.1979%2C1011.2402%2C1011.1750%2C1011.2265%2C1011.3284%2C1011.3684%2C1011.2699%2C1011.5121%2C1011.4549%2C1011.0258%2C1011.3627%2C1011.6266%2C1011.5314%2C1011.1513%2C1011.6617%2C1011.4915%2C1011.6382%2C1011.0289%2C1011.3686%2C1011.2083%2C1011.2122%2C1011.4388%2C1011.0301%2C1011.5206%2C1011.1060%2C1011.5211%2C1011.5640%2C1011.1138%2C1011.4939%2C1011.5537%2C1011.2725%2C1011.4450%2C1011.6631%2C1011.3202%2C1011.5100%2C1011.6448%2C1011.4038%2C1011.4429&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Synchrotron Blob Model of Infrared and X-ray Flares from Sagittarius\n  A$^*$"}, "summary": "Sagittarius A$^*$ in the Galactic center harbors a supermassive black hole\nand exhibits various active phenomena. Besides quiescent emission in radio and\nsubmillimeter radiation, flares in the near infrared (NIR) and X-ray bands are\nobserved to occur frequently. We study a time-dependent model of the flares,\nassuming that the emission is from a blob ejected from the central object.\nElectrons obeying a power law with the exponential cutoff are assumed to be\ninjected in the blob for a limited time interval. The flare data of 2007 April\n4 were used to determine the values of model parameters. The spectral energy\ndistribution of flare emission is explained by nonthermal synchrotron radiation\nin the NIR and X-ray bands. The model light curves suggest that electron\nacceleration is still underway during the rising phase of the flares. GeV\ngamma-rays are also emitted by synchrotron self-Compton scattering, although\nits luminosity is not strictly constrained by the current model. If the GeV\nemission is faint, the plasma blob is dominated by the magnetic energy density\nover the electron kinetic energy density. Observations in the GeV band will\nclarify the origin of the blob.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1011.6219%2C1011.3896%2C1011.1056%2C1011.6274%2C1011.4365%2C1011.5850%2C1011.4953%2C1011.0502%2C1011.0100%2C1011.2737%2C1011.3455%2C1011.6317%2C1011.2016%2C1011.5132%2C1011.3064%2C1011.2377%2C1011.4712%2C1011.0467%2C1011.2383%2C1011.2092%2C1011.3780%2C1011.0796%2C1011.1590%2C1011.2104%2C1011.4297%2C1011.5065%2C1011.3041%2C1011.3149%2C1011.3394%2C1011.5278%2C1011.5346%2C1011.4519%2C1011.4967%2C1011.1594%2C1011.0497%2C1011.2428%2C1011.3497%2C1011.4567%2C1011.3432%2C1011.1071%2C1011.1712%2C1011.5584%2C1011.3901%2C1011.5027%2C1011.3357%2C1011.4509%2C1011.3648%2C1011.3554%2C1011.0179%2C1011.0561%2C1011.0503%2C1011.6415%2C1011.1333%2C1011.2569%2C1011.4582%2C1011.0374%2C1011.4238%2C1011.3083%2C1011.2116%2C1011.1652%2C1011.5866%2C1011.0377%2C1011.0765%2C1011.1979%2C1011.2402%2C1011.1750%2C1011.2265%2C1011.3284%2C1011.3684%2C1011.2699%2C1011.5121%2C1011.4549%2C1011.0258%2C1011.3627%2C1011.6266%2C1011.5314%2C1011.1513%2C1011.6617%2C1011.4915%2C1011.6382%2C1011.0289%2C1011.3686%2C1011.2083%2C1011.2122%2C1011.4388%2C1011.0301%2C1011.5206%2C1011.1060%2C1011.5211%2C1011.5640%2C1011.1138%2C1011.4939%2C1011.5537%2C1011.2725%2C1011.4450%2C1011.6631%2C1011.3202%2C1011.5100%2C1011.6448%2C1011.4038%2C1011.4429&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Sagittarius A$^*$ in the Galactic center harbors a supermassive black hole\nand exhibits various active phenomena. Besides quiescent emission in radio and\nsubmillimeter radiation, flares in the near infrared (NIR) and X-ray bands are\nobserved to occur frequently. We study a time-dependent model of the flares,\nassuming that the emission is from a blob ejected from the central object.\nElectrons obeying a power law with the exponential cutoff are assumed to be\ninjected in the blob for a limited time interval. The flare data of 2007 April\n4 were used to determine the values of model parameters. The spectral energy\ndistribution of flare emission is explained by nonthermal synchrotron radiation\nin the NIR and X-ray bands. The model light curves suggest that electron\nacceleration is still underway during the rising phase of the flares. GeV\ngamma-rays are also emitted by synchrotron self-Compton scattering, although\nits luminosity is not strictly constrained by the current model. If the GeV\nemission is faint, the plasma blob is dominated by the magnetic energy density\nover the electron kinetic energy density. Observations in the GeV band will\nclarify the origin of the blob."}, "authors": ["Masaaki Kusunose", "Fumio Takahara"], "author_detail": {"name": "Fumio Takahara"}, "author": "Fumio Takahara", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1088/0004-637X/726/1/54", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1011.1712v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1011.1712v2", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "11 pages, 8 figures, 1 table. The title is slightly changed and\n  references are updated. Minor corrections are also included", "arxiv_primary_category": {"term": "astro-ph.HE", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph.HE", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1011.1712v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1011.1712v2", "journal_reference": "The Astrophysical Journal, 726, 54, 2011", "doi": "10.1088/0004-637X/726/1/54", "fulltext": "Synchrotron Blob Model of Infrared and X-ray Flares from\nSagittarius A∗\n\narXiv:1011.1712v2 [astro-ph.HE] 15 Dec 2010\n\nMasaaki Kusunose\nDepartment of Physics, School of Science and Technology, Kwansei Gakuin University,\nSanda 669-1337, Japan\nkusunose@kwansei.ac.jp\nand\nFumio Takahara\nDepartment of Earth and Space Science, Graduate School of Science, Osaka University,\nToyonaka 560-0043, Japan\ntakahara@vega.ess.sci.osaka-u.ac.jp\nABSTRACT\nSagittarius A∗ in the Galactic center harbors a supermassive black hole and\nexhibits various active phenomena. Besides quiescent emission in radio and submillimeter radiation, flares in the near infrared (NIR) and X-ray bands are observed to occur frequently. We study a time-dependent model of the flares,\nassuming that the emission is from a blob ejected from the central object. Electrons obeying a power law with the exponential cutoff are assumed to be injected\nin the blob for a limited time interval. The flare data of 2007 April 4 were used\nto determine the values of model parameters. The spectral energy distribution\nof flare emission is explained by nonthermal synchrotron radiation in the NIR\nand X-ray bands. The model light curves suggest that electron acceleration is\nstill underway during the rising phase of the flares. GeV γ-rays are also emitted\nby synchrotron self-Compton scattering, although its luminosity is not strictly\nconstrained by the current model. If the GeV emission is faint, the plasma blob\nis dominated by the magnetic energy density over the electron kinetic energy\ndensity. Observations in the GeV band will clarify the origin of the blob.\nSubject headings: acceleration of particles - black hole physics - Galaxy:\ncenter - radiation mechanisms: nonthermal\n\n\f–2–\n1.\n\nIntroduction\n\nVarious observations have confirmed that the Galactic center, Sagittarius A∗ (Sgr A∗ ),\ncontains a super massive black hole of mass ∼ 4×106 M⊙ (e.g., Ghez et al. 2008; Gillessen et al.\n2009a,b). It has been found that Sgr A∗ emits radiation from radio through X-rays (see\nMelia & Falcke 2001; Melia 2007, for review) and even TeV γ-rays (Tsuchiya et al. 2004;\nKosack et al. 2004; Aharonian et al. 2004; Albert et al. 2006). The bolometric luminosity\nof Sgr A∗ is ∼ 1036 erg s−1 and the emission is dominated by radio. The spectral flux sharply\nfalls off above ν ∼ 1012 Hz (\"the submillimeter bump\") (Zylka et al. 1995; Falcke et al.\n1998). In the quiescent state, X-rays at low luminosities were also observed by Chandra,\nwhich obtained the X-ray luminosity of LX ≈ 2.4 × 1033 erg s−1 in the 2 – 10 keV band\n(Baganoff et al. 2003). The quiescent state of Sgr A∗ can be described by a radiatively inefficient accretion flow (RIAF) model (Yuan et al. 2003) or a jet model (Falcke & Markoff\n2000). These models ascribe the submillimeter bump to synchrotron radiation by thermal\nelectrons in magnetic fields of ∼ 30 G. The X-ray emission in the quiescent state is explained\neither by bremsstrahlung or by inverse Compton scattering in both RIAF (Yuan et al. 2003)\nand the jet models (Falcke & Markoff 2000).\nStrong flares occur frequently in the X-ray band (Baganoff et al. 2001) and nearinfrared (NIR) band (Genzel et al. 2003). The detailed properties of the flares of NIR\nand X-rays are reviewed in Dodds-Eden et al. (2009). X-ray and NIR flares occur simultaneously, with no significant delay (Eckart et al. 2004; Yusef-Zadeh et al. 2006). X-ray\nflares are always accompanied by NIR flares, although NIR flares may occur without an\nassociated X-ray flare (e.g., Hornstein et al. 2007). It should be noted, however, that this\nmight be instrumental, because the X-ray background in the Galactic center is proportionally larger than the NIR background and, thus, only bright X-ray flares are detected. The\nduration of NIR flare in the L′ band (3.80 μm) observed in 2007 April 4 was about 100\nminutes (Dodds-Eden et al. 2009). Simultaneously, XMM-Newton observed the flare in the\nX-ray band and the X-ray flare lasted about 60 minutes (Porquet et al. 2008). The L′ -band\nlight curve of the 2007 flare has sub-structural variations on a timescale of ∼ 20 minutes.\nDodds-Eden et al. (2009) attribute the NIR substructure to the fluctuation of the magnetic\nfield.\nObservations of polarization of the IR flares are broadly consistent with that the IR flares\nare synchrotron origin (e.g., Eckart et al. 2006a; Marrone et al. 2008; Dodds-Eden et al.\n2009; Yusef-Zadeh et al. 2009). On the other hand, the emission mechanisms of the Xray flares are still debated; upscattering of submillimeter photons (Markoff et al. 2001;\nYusef-Zadeh et al. 2006), synchrotron self-Compton (SSC) scattering (Yuan et al. 2003;\nEckart et al. 2004, 2006a,b; Sabha et al. 2010), synchrotron emission from high energy\n\n\f–3–\nelectrons (Yuan et al. 2003, 2004; Dodds-Eden et al. 2009), or inverse Compton scattering\nof NIR photons by ∼ 10 MeV electrons responsible for the quiescent radio-millimeter emission\n(Yusef-Zadeh et al. 2009). An orbiting hot spot model is also proposed (Broderick & Loeb\n2005, 2006). This model requires the synchrotron cooling time longer than the orbital period\nto explain the light curve of NIR. However, the cooling time of X-ray emitting electrons is\nmuch shorter than the NIR emitting electrons. This makes the hot spot model inappropriate\nto the X-ray flare emission.\nDodds-Eden et al. (2009) explored the emission mechanisms of the 2007 IR/X-ray flare\nby various synchrotron and inverse Compton emission models. According to their model,\nSSC models need a large magnetic field such as 6000 G and a very small size of the flare\nemission region, e.g., ∼ 0.0013RS, where RS is the Schwarzschild radius. The magnetic field\nis too large compared with the inferred value during the quiescent state, i.e., 10 - 30 G, and\nthe size is too small to account for the flare timescale of 100 minutes. On the other hand, the\nflare is well explained by \"powerlawcool\" model, in which electrons with a power law with a\ncooling break emit IR and X-rays by synchrotron radiation. Recently, Sabha et al. (2010)\nexplored SSC models that include parameter regions not considered by Dodds-Eden et al.\n(2009). Their model also requires a smaller source component size to give a sufficient inverse\nCompton scattering efficiency, so that multi-components are needed to obtain a broad time\nprofile of a flare. Marrone et al. (2008) also constructed a SSC model of X-ray emission for\na flare observed in 2006 July 17. The source size of their model is ∼ RS and the strength of\nmagnetic fields is 1.5 G. The source size and the magnetic fields are smaller than those of\nour model by a factor ∼ 10 as shown in Section 3.\nBecause the origin of X-ray emission is still unclear as described above, in this paper we\npresent a model that NIR and X-ray flares can be produced by synchrotron radiation from\na single plasma blob. The simultaneity of NIR and X-ray flares favors a model of emission\nfrom a single region. The blob might be ejected from the region near the central black hole.\nAs shown below, the size of the blob of our model is about 10 RS and magnetic field is\nabout 20 G. These values are consistent with the physical parameters of the accretion flow\naround the central black hole. In this model the flare duration is determined by the injection\ntimescale of nonthermal electrons. The decay of the flares is owing to the radiative cooling\nand particle escape after turnoff of the injection of nonthermal electrons. In particular, we\nfocus on the time-dependent behavior of the flare models. Because of various timescales such\nas cooling, injection, escape, etc., time-dependent simulations are necessary to investigate\nthe flare properties in detail. It should be noted that most of the previous theoretical work\non the flare emission has been restricted to the steady state models.\nAlthough we do not consider adiabatic expansion in this paper, there are phenomena\n\n\f–4–\nsuggesting the effects of adiabatic expansion. For example, Hornstein et al. (2007) found\nthat their NIR measurements are consistent with a constant spectral index during a flare.\nMarrone et al. (2008) and Yusef-Zadeh et al. (2009), on the other hand, found that millimeter and submillimeter peaks delay the peak of NIR/X-ray flares. According to their\nmodels this delay is consistent with the adiabatic expansion of a self-absorbed source. The\nestimated expansion speed is much less than 0.1c.\nOur assumptions on the emission region are described in Section 2. Numerical results\nare given in Section 3. A summary of our results and discussion are given in Section 4.\nThroughout this paper, we assume 8 kpc as a Galactic center distance (Eisenhauer et al.\n2003) and 4 × 106 M⊙ as the central black hole mass (Ghez et al. 2008; Gillessen et al.\n2009a,b).\n\n2.\n\nBlob Model\n\nWe first assume that the emission region of the flares is a blob ejected from the central region around the black hole, e.g., from accretion flow (Wang, et al. 2000; Wang & Kusunose\n2002; Yuan et al. 2009). For simplicity of numerical calculations, we assume that the blob\nis a uniform sphere with radius R and magnetic field B. While RIAF or a jet supplies the\nquiescent component of the spectral energy distribution (SED) of radiation, mainly in radio,\nthe temporal ejection of a blob produces flare emission. Since the blob is launched from the\ninner edge or near the inner edge of the accretion flow, the blob speed might be at least\nmildly relativistic. However, we assume that the blob moves at nonrelativistic speed, so that\nthe relativistic effects such as beaming are neglected. Because relativistic jets have not been\nobserved from the region near Sgr A∗ , it is possible to neglect the effects of the motion of\nthe blob as a first step of investigation.\nIn our simulations the injection of nonthermal electrons in the blob triggers flares. Shock\nacceleration in the blob or magnetic reconnection can supply such nonthermal electrons.\nWe solve the kinetic equations of electrons and photons as in Kusunose et al. (2000) and\nLi & Kusunose (2000). We include the injection of nonthermal electrons, radiative cooling\n(synchrotron and inverse Compton scattering), and escape from the blob. The injection rate\nper unit volume and unit interval of γ, where γ is the electron Lorentz factor, is given by\n\u001a\n0,\nif γ < γmin ,\nq(γ) =\n(1)\n−p\nKγ exp(−γ/γmax ), if γ ≥ γmin ,\nwhere K, p, γmin, and γmax are parameters. The value of γmax can be a function of time, which\nallows different shapes of light curves. In our model described below, we assume that γmax\n\n\f–5–\nincreases linearly with time to fit the flare light curves of 2007 April 4. The normalization\nfactor, K, is determined by assigning the value of the injection rate per unit volume, i.e.,\nZ ∞\nqinj =\nq(γ)dγ.\n(2)\nγmin\n\nA time-dependent qinj model is also considered (see Section 3). The injection duration of\nnonthermal electrons, tinj , and the escape timescale of electrons from the blob, tesc , are also\nparameters. The emission mechanisms are synchrotron radiation by the nonthermal electrons\nand inverse Compton scattering of the synchrotron photons by the same electrons (SSC).\nIn this paper we do not consider Comptonization of external soft photons such as radiation from accretion flow. We discuss the validity of this assumption in Section 4. Furthermore, the adiabatic expansion of an initially optically thick blob is excluded, because there\nis no significant delay or asymmetry in the longer wavelength emission relative to the peak\nof the X-ray flare (Dodds-Eden et al. 2009).\n\n3.\n\nNumerical Results\n\nNumerical models are obtained for the parameters such as R, B, qinj , p, γmin, γmax ,\ntinj , and tesc . For a black hole mass MBH = 4 × 106 M⊙ , the Schwarzschild radius is RS =\n2GMBH /c2 = 1.2 × 1012 cm. The light crossing time of this size is RS /c ∼ 40 s. The particle\nescape occurs by advection, so that we set tesc ∼ several R/c. In our model the injection\nduration is strongly related to the flare timescale. The values of parameters are determined\nby the SED of IR and X-ray flares and light curves. For this purpose, we use the data of the\n2007 IR/X-ray flare given in Porquet et al. (2008) and Dodds-Eden et al. (2009).\n\n3.1.\n\nLight Curves\n\nIn our model, the emission in both IR and X-ray bands is produced by synchrotron\nradiation. The maximum value of νFν of synchrotron emission appears at ∼ 1016 Hz, which\nis in between the IR and X-rays bands, where Fν is the energy flux per unit frequency.\nThe luminosity of X-rays is sensitive to the values of γmax and tinj . This is because Xrays are emitted by the electrons in the high energy end of the electron spectrum and the\ncooling time of those electrons is short. As soon as the injection rate of nonthermal electrons\ndecreases, the X-ray luminosity declines. Because IR emitting electrons have longer cooling\ntime than X-ray emitting electrons, the IR luminosity is more dependent on tesc than the\n\n\f–6–\nX-ray luminosity. If tesc is long enough, the X-ray emitting electrons begin to pile up as\nlower energy electrons that emit IR.\nWe first examine light curves of the IR and X-ray bands for various models. For models\nin this subsection, we assume that R = 1013 cm, B = 20 G, γmin = 2, p = 1.3, tinj = 8R/c,\nand tesc = 5R/c. The blob is initially empty at t = 0 and nonthermal electrons are injected\nfor t > 0. In Figure 1, we present light curves in the L′ (3.8 μm) and 2 – 10 keV bands\nfor different models of γmax and qinj . When γmax is fixed, high-energy electrons are injected\ninstantly at t = 0. Then the light curves rise steeply (dotted lines). It is found for this model\nthat the light curve of X-rays increases faster than that of IR, which is not in agreement\nwith the flare of 2007 April 4. To obtain slower rise of the light curves, the time dependent\nγmax is assumed as shown by the dashed lines. Here we assumed that γmax increases linearly\nwith time from 500 to 5 × 104 during t = 0 and tinj . For t > tinj both models (the dotted\nand dashed lines) assume qinj = 0. By fitting model light curves with the data of the flares,\nwe found that the above models have shorter decline timescales than the observed one. We\nthen assume that the injection rate decreases gradually after t = tinj . As an example, we use\na model with q(γ) ∝ exp[−(t − tinj )/(ξtinj )] for t > tinj . In Figure 1, a model with ξ = 0.25\nis shown by the solid lines (model A). In this model γmax is constant for t > tinj .\nIn Figures 2 and 3, we compare model light curves to the observed data for 2007 April\n4. Here the model light curves are the same as shown by the solid lines in Figure 1, i.e.,\nmodel A. The details of the model parameters are given in Table 1. The size of the blob R\nis 1013 cm and this corresponds to the light crossing time of 334 s. In this figure, the peak\ntime of the luminosity of the model is shifted so that the model curves coincide with the\nobserved light curves. We assumed the linear dependence of γmax on time for t < tinj and\nthe gradual decline of the injection rate for t > tinj . The fact that IR and X-rays attain the\npeak flux almost simultaneously (Dodds-Eden et al. 2009) implies that the value of γmax\nincreases during the rising phase of the light curves, i.e., the acceleration of higher energy\nelectrons is still underway in the early phase of the flare.\nThe cooling time of X-ray emitting electrons is ∼ 11 s and much shorter than the escape\ntime tesc ∼ 1.7 × 103 s, if 10 keV of X-rays are assumed. On the other hand, NIR is emitted\nby electrons with γ ∼ 103 . The synchrotron cooling time of those NIR emitting electrons is\ncomparable with tesc , i.e., tcool ∼ 2 × 103 s. Thus the cooling is effective in X-rays during the\ndecay of the flare and the decline time of the X-ray light curve is shorter than that of NIR.\nThe decline of the NIR light curve is regulated by both tcool and tesc . As shown in Figure 7,\na bump appears at γ ∼ 103 in the electron spectrum. This is because of balance between\nradiative cooling and escape.\n\n\f–7–\n3.2.\n\nSpectral Energy Distribution\n\nWe next show the evolution of the flare SED of model A and compare the model to\nthe observations in Figure 4. The quiescent model by Yuan et al. (2003) is also shown\nfor comparison. The maximum flare luminosity is 5.0 × 1037 erg s−1 at t = 9R/c. This\nluminosity is much higher than the submillimeter luminosity in the quiescent state, but this\nflare does not strongly affect the spectrum in the submillimeter wavelength. During the\nrising phase, synchrotron emission becomes luminous and attains the peak at t ∼ 8R/c. The\npeak frequency increases because γmax increases for t < tinj . While the emission decays, the\nspectrum in the IR and X-ray bands become flatter and a dip appears at ∼ 1015 Hz.\nIt is noted that the SSC component appears in the GeV region, whose intensity might\nbe too small to be observed. However, other sets of parameter values allow a stronger GeV\nflux as shown below.\nSince the number of parameters is large and observed data are few, there is uncertainty\nin determining the parameter values to fit the data. We show another model (model B) with\np = 1.8 in Figure 5. When p has a larger value, the value of γmin should be larger for the\nradio flare not to exceed the quiescent radio emission. When the value of p is larger and the\nvalue of γmin is fixed, there are more electrons with lower energy for the same IR and X-ray\nluminosities as the observed data. This constraint on γmin may be not strong, if flares in\nradio occur simultaneously.\nAs shown in Figure 4, our model predicts the emission in the GeV band, which is\nproduced by inverse Compton scattering of IR-optical photons, i.e., SSC process. The luminosity in the GeV band is not strongly constrained in our model. In Figure 6, we show a\nmodel with a larger luminosity in the GeV band (model C). A smaller value of the magnetic\nfield and a higher injection rate produce a luminous SSC component. The difference of SEDs\nin Figures 4 and 6 also appears in the IR band of the decaying phase. In Figure 4 the IR\nspectrum becomes flat after t ∼ 12R/c, while that in Figure 6 keeps hard spectral shape.\n\n3.3.\n\nElectron Spectrum and Energetics\n\nThe time evolution of the electron spectrum of model A is shown in Figure 7. The\nnumber density of electrons increases for t < tinj because of injection. For t > tinj , the injection rate decreases exponentially with time. The higher energy electrons decrease because\nof radiative cooling. Also on timescale tesc , electrons escape from the blob.\nThe time evolution of the energy densities of the radiation urad and the kinetic energy\n\n\f–8–\nof electrons ue is shown in Figure 8 for model A. In our model the magnetic field is assumed\nto be constant. The energy content is dominated by the magnetic energy density uB , i.e.,\nuB /ue ∼ 16 at t ∼ 8R/c. This is in contrast with blazar models, where the kinetic energy\nof nonthermal electrons/positrons dominates over the magnetic energy (Kino et al. 2002).\nBlazars are relativistic jets aligned with the line of sight and the relativistic beaming effect\nenhances the luminosity, while our model of Sgr A∗ does not have relativistic motion. It\nshould be also noted that blazars have a luminous SSC or external Compton component in\nthe γ-ray band, while model A has only a weak SSC component. When the SSC component\nis more luminous as in model C, the electron energy dominates over the magnetic energy,\ni.e., uB /ue ∼ 0.1 at t ∼ 8R/c.\n\n4.\n\nSummary and Discussion\n\nWe calculated the SEDs and light curves from a blob as a model of the IR and Xray flares observed from Sgr A∗ . Because we performed time-dependent calculations, it\nwas possible to study the evolution of radiation and electron spectra in detail, which is\ndifferent from most of previous work. Our model assumes that IR and X-rays are emitted\nby synchrotron radiation of nonthermal electrons injected in the blob. This model explains\nthe characteristics of 2007 April 4 flare in IR/X-rays such as (1) the simultaneity of the\nX-ray and IR flares, (2) the steeper decline of the X-ray flare than the IR flare, (3) the flare\ntimescale of 100 minutes. The flare timescale in our model is mainly determined by the\ninjection time of nonthermal electrons, which is related to particle acceleration mechanisms\nand to be studied in future work. To compare the light curves we assumed that the value\nof γmax increases linearly with time. If the value of γmax is fixed during injection, our model\ndoes not explain the simultaneity of the X-ray and IR flares. The higher energy electrons\nresponsible for X-ray emission are thus being accelerated in the rising phase of the flare.\nWe compared the SEDs of different models. While model A has a faint SSC component\nin γ-rays and a larger value of uB /ue , model C has a bright SSC one and a smaller value of\nuB /ue . If model C is applicable, we will observe γ-rays in the GeV band. Future observations\nin the GeV band will constrain the model parameters as well as the energetics in the flare\nregions. Because the blob might be ejected from RIAF by magnetohydrodynamic processes\nand nonthermal electrons are accelerated in the collisonless shock, the observations of GeV\nγ-rays will clarify the origin of the blobs and the particle acceleration mechanisms.\nThe spectral index of NIR is almost constant during a flare in model C, while the\nspectrum becomes flatter during the decay in models A and B. In model C, the cooling time\nis longer than that of models A and B, because the magnetic field is weaker. Then only\n\n\f–9–\nescape time, which is independent of electron energy, regulates the decay of the NIR flare.\nPrevious work mainly modeled the SED of flares by steady state models and did not utilize the data of light curves. Time-dependent models were recently published by Sabha et al.\n(2010). They assumed SSC for X-ray flares and combined adiabatic expansion to account\nfor light curves of 2007 April 4. To fit the data six source components are needed. While it\nis possible to attribute the IR substructure to those multi-components of sources, it seems\ndifficult to produce many emission regions coherently to cause flares.\nIt is known that IR flares sometimes occur without X-ray flares. This might be owing\nto a small value of γmax because of inefficient acceleration, rapid radiative cooling, or adiabatic cooling. If, for example, a blob is close to RIAF and external Compton scattering is\nimportant, synchrotron X-ray flares are suppressed. If this is the case, the effect of external\nCompton scattering appears as weak X-ray flares or hard spectral X-ray emission. This\nis because when synchrotron X-ray flares are absent, the kinetic energy of electrons with\nγ & 103 are given to the RIAF photons with ν ∼ 1012 Hz, yielding X-rays with ν & 1018 Hz.\nThe intensity of these X-rays depends on the distance of the blob from RIAF.\nWe neglected the effect of the radiation from the RIAF in the flare emission spectra. By\ninverse Compton scattering of submillimeter photons with 1012 Hz, electrons with γmax ∼ 104\nproduces gamma-rays with ∼ 1 MeV. If the submillimeter emission (L ∼ 3.85 × 1035 erg\ns−1 ) is received by the blob, the energy density of the submillimeter photons in the blob is\n∼ 1.8 × 10−2 erg cm−3 . Here we assumed that the photon density decreases as the square of\nthe distance, that the distance of the blob from the submillimeter emission region is 1 AU,\nand that the submillimeter emission is isotropic. This energy density should be compared\nwith that of synchrotron photons in the blob, ∼ 0.3 erg cm−3 at t ∼ 8R/c (model A). Thus\nexternal Compton scattering of submillimeter photons is negligible, if the distance is greater\nthan about 1 AU.\nAfter completion of this work, we noticed a paper by Dodds-Eden et al. (2010). They\nsolved a kinetic equation of electrons and obtained time-dependent flare spectra of synchrotron radiation: Note that they did not calculate SSC spectra. In their work flares are\ncaused by the change in the injection rate and magnetic fields, while we assumed the change\nin the injection rate and γmax .\n\nREFERENCES\nAharonian, F. et al. 2004, A&A, 425, L13\nAlbert, J. et al. 2006, ApJ, 638, L101\n\n\f– 10 –\nBaganoff, F. K., et al. 2001, Nature, 413, 45\nBaganoff, F. K., et al. 2003, ApJ, 591, 891\nBroderick, A. E., & Loeb, A. 2005, MNRAS, 363, 353\nBroderick, A. E., & Loeb, A. 2006, MNRAS, 367, 905\nDodds-Eden, K., et al. 2009, ApJ, 698, 676\nDodds-Eden, K., et al. 2010, ApJ, 725, 450\nEckart, A. et al. 2004, A&A, 427, 1\nEckart, A. et al. 2006a, A&A, 450, 535\nEckart, A. et al. 2006b, A&A, 455, 1\nEisenhauer, F., et al. 2003, ApJ, 597, L121\nFalcke, H., & Markoff, S. 2000, A&A, 362, 113\nFalcke, H., et al. 1998, ApJ, 499, 731\nGenzel, R., et el. 2003, Nature, 425, 934\nGhez, R., et al. 2008, ApJ, 689, 1044\nGillessen, S., et al. 2009a, ApJ, 692, 1075\nGillessen, S., et al. 2009b, ApJ, 707, L114\nHornstein, S. D., et al. 2007, ApJ, 667, 900\nKino, M., Takahara, F., & Kusunose, M. 2002, ApJ, 564, 97\nKosack, K. et al. 2004, ApJ, 608, L97\nKusunose, M., Takahara, F., & Li, H. 2000, ApJ, 536, 299\nLi, H., & Kusunose, M. 2000, ApJ, 536, 729\nMarkoff, S., Falcke, H., Yuan, F., & Biermann, P. L. 2001, A&A, 379, L13\nMarrone, D. P., et al. 2008, ApJ, 682, 373\n\n\f– 11 –\nMelia, F. 2007, The Galactic Supermassive Black Hole (Princeton, NJ: Princeton Univ.\nPress)\nMelia, F., & Falcke, H. 2001, ARA&A, 39, 309\nPorquet, D. et al. 2008, A&A, 488, 549\nSabha, N. et al. 2010, A&A, 512, A2\nTsuchiya, K. et al. 2004, ApJ, 606, L115\nWang, J.-M., Yuan, Y.-F., Wu, M., & Kusunose, M 2000, ApJ, 541, L41\nWang, J.-M., & Kusunose, M. 2002, ApJS, 138, 249\nYuan, F., Lin, J., Wu, K., & Ho, L. C. 2009, MNRAS, 395, 2183\nYuan, F., Quataert, E., & Narayan, R. 2003, ApJ, 598, 301\nYuan, F., Quataert, E., & Narayan, R. 2004, ApJ, 606, 894\nYusef-Zadeh, F., et al. 2006, ApJ, 644, 198\nYusef-Zadeh, F., et al. 2009, ApJ, 706, 348\nZhao, J.-H., et al. 2003, ApJ, 586, L29\nZylka, R., et al. 1995, A&A, 297, 83\n\nThis preprint was prepared with the AAS LATEX macros v5.2.\n\n\f– 12 –\n\n35\n\n-1\n\nL' band luminosity [ergs s ]\n\n2×10\n\n1×10\n\n35\n\n-1\n\n2-10 keV luminosity [ergs s ]\n\n0\n\n2×10\n\n1×10\n\n35\n\n35\n\n0\n\n0\n\n3\n\n2×10\n\n3\n\n4×10\n\n6×10\n\n3\n\n8×10\n\n3\n\nTime [s]\nFig. 1.- Light curves of the L′ band (3.8μm) and the 2 – 10 keV band for various models.\nA model with a fixed value of γmax = 5 × 104 is shown by dotted lines. The dashed lines are\nfor a model with a time dependent γmax . Here we assume that γmax increases linearly from\n500 to 5 × 104 during t = 0 and tinj , where tinj = 2.7 × 103 s. Both models assume that the\ninjection is at a constant rate and stops at t = tinj . A model with a time dependent injection\nis shown by solid lines. This model assumes that qinj is constant for t < tinj and decreases\nas qinj ∝ exp[−(t − tinj )/(0.25tinj )] for t > tinj . The value of γmax increases linearly as for the\nmodel shown by the dashed lines. For all these models, R = 1013 cm, B = 20 G, γmin = 2,\np = 1.3, tinj = 8R/c, and tesc = 5R/c are used.\n\n\f– 13 –\n\n35\n\n2.0×10\n\n35\n\n-1\n\nIR luminosity [ergs s ]\n\n1.5×10\n\n35\n\n1.0×10\n\n5.0×10\n\n34\n\n300\n\n400\n350\nMinutes after 00:00 UT, April 4, 2007\n\nFig. 2.- Light curves of the L′ band. The flare data of the L′ band (filled squares) are\nfrom Dodds-Eden et al. (2009). The solid line depicts model A. The value of γmax increases\nlinearly with time from 500 up to 5 × 104 . In Figures 2 and 3, the peak time of model light\ncurves are shifted so that the peak time coincides with the observed peak time.\n\n\f– 14 –\n\n35\n\n3.0×10\n\n35\n\n-1\n\n2-10 keV luminosity [ergs s ]\n\n2.5×10\n\n35\n\n2.0×10\n\n35\n\n1.5×10\n\n35\n\n1.0×10\n\n5.0×10\n\n34\n\n300\n\n400\n350\nMinutes after 00:00 UT, April 4, 2007\n\nFig. 3.- Light curves of the 2 – 10 keV band. The flare data of the X-ray band (pluses)\nare from Porquet et al. (2008). Model A is shown by a solid line.\n\n\f– 15 –\n\n10\n\n10\n\nt = 9R/c\nt = 11R/c\nt = 19R/c\n\n-10\n\n10\n\n-11\n\n-2 -1\n\nνFν [ergs cm s ]\n\n-9\n\n10\n\n-12\n\n10\n\n10\n\n-13\n\n-14\n\n10\n\nt = R/c\n\n-15\n\n10\n\n10\n\n10\n\n12\n\n10\n\n14\n\n10\n\n16\n\n18\n\n10\n10\nν [Hz]\n\n20\n\n10\n\n22\n\n10\n\n24\n\n10\n\n26\n\n10\n\n28\n\nFig. 4.- Time evolution of the SED of model A. The SEDs are shown for t = R/c –\n19R/c at every 2R/c. SEDs in the rising phase are shown by thin lines and those in the\ndecaying phase by thick lines. Radio to submillimeter measurements are for the quiescent\nstate (Markoff et al. 2001; Zhao et al. 2003) (open circles). The flaring state in NIR (filled\nsquare) is taken from Dodds-Eden et al. (2009). The X-ray flare data (filled diamonds)\nare from Porquet et al. (2008). TeV emission (Aharonian et al. 2004) is also shown by\nasterisks. The quiescent state RIAF model by Yuan et al. (2003) is shown by a dash-dashdotted line for comparison.\n\n\f– 16 –\n\n10\n\n-9\n\nt = 9R/c\n10\n\n-10\n\n-11\n\n-2 -1\n\nνFν [ergs cm s ]\n\n10\n\n10\n\n-12\n\n10\n\n10\n\n-13\n\n-14\n\n10\n\nt = R/c\n\n-15\n\n10\n\n10\n\n10\n\n12\n\n10\n\n14\n\n10\n\n16\n\n18\n\n10\n10\nν [Hz]\n\n20\n\n10\n\n22\n\n10\n\n24\n\n10\n\n26\n\n10\n\n28\n\nFig. 5.- Time evolution of the SED of model B with p = 1.8. Here, γmin = 2 × 102 is\nassumed. The value of γmax is increased from 1.3 × 103 up to 1.3 × 105 linearly with time\nduring t = 0 and tinj . SEDs in the rising phase are shown by thin lines and those in the\ndecaying phase by thick lines.\n\n\f– 17 –\n\n10\n\n-9\n\nt = 9R/c\n10\n\n-10\n\n-11\n\n-2 -1\n\nνFν [ergs cm s ]\n\n10\n\n10\n\n-12\n\n10\n\n10\n\n-13\n\n-14\n\n10\n\nt = R/c\n\n-15\n\n10\n\n10\n\n10\n\n12\n\n10\n\n14\n\n10\n\n16\n\n18\n\n10\n10\nν [Hz]\n\n20\n\n10\n\n22\n\n10\n\n24\n\n10\n\n26\n\n10\n\n28\n\nFig. 6.- Time evolution of the SED with a luminous SSC component (model C). Here,\nB = 5 G and qinj = 7.5 are assumed. SEDs in the rising phase are shown by thin lines and\nthose in the decaying phase by thick lines.\n\n\f– 18 –\n\n10\n\n4\n\nt = R/c\nt = 8R/c\nt = 20R/c\n\n3\n\n10\n\n2\n\n-3\n\nγ ne(γ) [cm ]\n\n10\n\n1\n\n10\n\n0\n\n10\n\n10\n\n10\n\n-1\n\n-2\n\n10\n\n-3\n\n10\n\n0\n\n10\n\n1\n\n10\n\n2\n\n10\nγ\n\n3\n\n10\n\n4\n\n5\n\n10\n\n10\n\n6\n\nFig. 7.- Time evolution of the electron spectrum of model A. Here, ne (γ) is the electron\nnumber density per unit γ. The spectra are shown for every R/c. After t = 8R/c, the\ninjection rate decreases exponentially.\n\n\f– 19 –\n\n1.1\n1\n\nue\nurad\n\n0.9\n0.8\n\n-3\n\nu [ergs cm ]\n\n0.7\n0.6\n0.5\n0.4\n0.3\n0.2\n0.1\n0\n\n0\n\n2×10\n\n3\n\n3\n\n4×10\n\n6×10\n\n3\n\n3\n\n8×10\n\nt [s]\nFig. 8.- Time evolution of the energy densities of electrons (solid) and radiation (dashed).\nThis model assumes that the magnetic energy density is constant, i.e., B 2 /(8π) = 15.9 erg\ncm−3 with B = 20 G.\n\n\f– 20 –\n\nTable 1. Parameters\nModel\n\nB(G)\n\nA\nB\nC\n\n20\n10\n5\n\np\n\nγmin\n\n1.3\n2\n1.8 2 × 102\n1.3\n2\n\nγmax\n\nqinj (cm−3 s−1 )\n\n5 × 104\n1.3 × 105\n5 × 104\n\n1.6\n1.1\n7.5\n\nNote. - All models assume R = 1013 cm, tinj = 8R/c, and\ntesc = 5R/c. The increase of γmax during electron injection\ntime is assumed and the values of γmax listed above are those\nat t = tinj .\n\n\f"}