{"id": "http://arxiv.org/abs/0707.3557v2", "guidislink": true, "updated": "2007-11-06T13:22:42Z", "updated_parsed": [2007, 11, 6, 13, 22, 42, 1, 310, 0], "published": "2007-07-24T14:59:14Z", "published_parsed": [2007, 7, 24, 14, 59, 14, 1, 205, 0], "title": "Phase separation and competition of superconductivity and magnetism in\n  the two-dimensional Hubbard model: From strong to weak coupling", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0707.4022%2C0707.0783%2C0707.2675%2C0707.2489%2C0707.4456%2C0707.2213%2C0707.2448%2C0707.2688%2C0707.3297%2C0707.2420%2C0707.3560%2C0707.3234%2C0707.1152%2C0707.3806%2C0707.2330%2C0707.1770%2C0707.4029%2C0707.1357%2C0707.4403%2C0707.0239%2C0707.3921%2C0707.2285%2C0707.0826%2C0707.1964%2C0707.2080%2C0707.2412%2C0707.1070%2C0707.1678%2C0707.2032%2C0707.3732%2C0707.2709%2C0707.0793%2C0707.4049%2C0707.2631%2C0707.3745%2C0707.0074%2C0707.1961%2C0707.0688%2C0707.0732%2C0707.3414%2C0707.4186%2C0707.0763%2C0707.2332%2C0707.0903%2C0707.1571%2C0707.4519%2C0707.4279%2C0707.3445%2C0707.3496%2C0707.3981%2C0707.3351%2C0707.0462%2C0707.4490%2C0707.4640%2C0707.3654%2C0707.1730%2C0707.1534%2C0707.3687%2C0707.0585%2C0707.3561%2C0707.0715%2C0707.3038%2C0707.4349%2C0707.3777%2C0707.3078%2C0707.2262%2C0707.0120%2C0707.2627%2C0707.0524%2C0707.4380%2C0707.0012%2C0707.1642%2C0707.3068%2C0707.4544%2C0707.3661%2C0707.1349%2C0707.3610%2C0707.3136%2C0707.0796%2C0707.1281%2C0707.2050%2C0707.0379%2C0707.4641%2C0707.1516%2C0707.0824%2C0707.0712%2C0707.3557%2C0707.3842%2C0707.3076%2C0707.1400%2C0707.1741%2C0707.3126%2C0707.3403%2C0707.2608%2C0707.1667%2C0707.2161%2C0707.3489%2C0707.1692%2C0707.1048%2C0707.4634%2C0707.1737&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Phase separation and competition of superconductivity and magnetism in\n  the two-dimensional Hubbard model: From strong to weak coupling"}, "summary": "Cooperation and competition between the antiferromagnetic, d-wave\nsuperconducting and Mott-insulating states are explored for the two-dimensional\nHubbard model including nearest and next-nearest-neighbor hoppings at zero\ntemperature. Using the variational cluster approach with clusters of different\nshapes and sizes up to 10 sites, it is found that the doping-driven transition\nfrom a phase with microscopic coexistence of antiferromagnetism and\nsuperconductivity to a purely superconducting phase is discontinuous for strong\ninteraction and accompanied by phase separation. At half-filling the system is\nin an antiferromagnetic Mott-insulating state with vanishing charge\ncompressibility. Upon decreasing the interaction strength U below a certain\ncritical value of roughly U=4 (in units of the nearest-neighbor hopping),\nhowever, the filling-dependent magnetic transition changes its character and\nbecomes continuous. Phase separation or, more carefully, the tendency towards\nthe formation of inhomogeneous states disappears. This critical value is in\ncontrast to previous studies, where a much larger value was obtained. Moreover,\nwe find that the system at half-filling undergoes the Mott transition from an\ninsulator to a state with a finite charge compressibility at essentially the\nsame value. The weakly correlated state at half-filling exhibits\nsuperconductivity microscopically admixed to the antiferromagnetic order. This\nscenario suggests a close relation between phase separation and the\nMott-insulator physics.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0707.4022%2C0707.0783%2C0707.2675%2C0707.2489%2C0707.4456%2C0707.2213%2C0707.2448%2C0707.2688%2C0707.3297%2C0707.2420%2C0707.3560%2C0707.3234%2C0707.1152%2C0707.3806%2C0707.2330%2C0707.1770%2C0707.4029%2C0707.1357%2C0707.4403%2C0707.0239%2C0707.3921%2C0707.2285%2C0707.0826%2C0707.1964%2C0707.2080%2C0707.2412%2C0707.1070%2C0707.1678%2C0707.2032%2C0707.3732%2C0707.2709%2C0707.0793%2C0707.4049%2C0707.2631%2C0707.3745%2C0707.0074%2C0707.1961%2C0707.0688%2C0707.0732%2C0707.3414%2C0707.4186%2C0707.0763%2C0707.2332%2C0707.0903%2C0707.1571%2C0707.4519%2C0707.4279%2C0707.3445%2C0707.3496%2C0707.3981%2C0707.3351%2C0707.0462%2C0707.4490%2C0707.4640%2C0707.3654%2C0707.1730%2C0707.1534%2C0707.3687%2C0707.0585%2C0707.3561%2C0707.0715%2C0707.3038%2C0707.4349%2C0707.3777%2C0707.3078%2C0707.2262%2C0707.0120%2C0707.2627%2C0707.0524%2C0707.4380%2C0707.0012%2C0707.1642%2C0707.3068%2C0707.4544%2C0707.3661%2C0707.1349%2C0707.3610%2C0707.3136%2C0707.0796%2C0707.1281%2C0707.2050%2C0707.0379%2C0707.4641%2C0707.1516%2C0707.0824%2C0707.0712%2C0707.3557%2C0707.3842%2C0707.3076%2C0707.1400%2C0707.1741%2C0707.3126%2C0707.3403%2C0707.2608%2C0707.1667%2C0707.2161%2C0707.3489%2C0707.1692%2C0707.1048%2C0707.4634%2C0707.1737&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Cooperation and competition between the antiferromagnetic, d-wave\nsuperconducting and Mott-insulating states are explored for the two-dimensional\nHubbard model including nearest and next-nearest-neighbor hoppings at zero\ntemperature. Using the variational cluster approach with clusters of different\nshapes and sizes up to 10 sites, it is found that the doping-driven transition\nfrom a phase with microscopic coexistence of antiferromagnetism and\nsuperconductivity to a purely superconducting phase is discontinuous for strong\ninteraction and accompanied by phase separation. At half-filling the system is\nin an antiferromagnetic Mott-insulating state with vanishing charge\ncompressibility. Upon decreasing the interaction strength U below a certain\ncritical value of roughly U=4 (in units of the nearest-neighbor hopping),\nhowever, the filling-dependent magnetic transition changes its character and\nbecomes continuous. Phase separation or, more carefully, the tendency towards\nthe formation of inhomogeneous states disappears. This critical value is in\ncontrast to previous studies, where a much larger value was obtained. Moreover,\nwe find that the system at half-filling undergoes the Mott transition from an\ninsulator to a state with a finite charge compressibility at essentially the\nsame value. The weakly correlated state at half-filling exhibits\nsuperconductivity microscopically admixed to the antiferromagnetic order. This\nscenario suggests a close relation between phase separation and the\nMott-insulator physics."}, "authors": ["M. Aichhorn", "E. Arrigoni", "M. Potthoff", "W. Hanke"], "author_detail": {"name": "W. Hanke"}, "author": "W. Hanke", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevB.76.224509", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0707.3557v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0707.3557v2", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "7 pages, 8 figures, revised version to be published in Phys. Rev. B", "arxiv_primary_category": {"term": "cond-mat.str-el", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.str-el", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "cond-mat.supr-con", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0707.3557v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0707.3557v2", "journal_reference": "Phys. Rev. B 76, 224509 (2007)", "doi": "10.1103/PhysRevB.76.224509", "fulltext": "Phase separation and competing superconductivity and magnetism in the\ntwo-dimensional Hubbard model: From strong to weak coupling\nM. Aichhorn,1, ∗ E. Arrigoni,2 M. Potthoff,3 and W. Hanke1, 4\n1\n\narXiv:0707.3557v2 [cond-mat.str-el] 6 Nov 2007\n\n2\n\nInstitute for Theoretical Physics and Astrophysics,\nUniversity of Würzburg, Am Hubland, 97074 Würzburg, Germany\nInstitute of Theoretical Physics and Computational Physics, TU Graz, Petersgasse 16, 8010 Graz, Austria\n3\nI. Institute for Theoretical Physics, University of Hamburg, Jungiusstrae 9, 20355 Hamburg, Germany\n4\nKavli Institute for Theoretical Physics, University of California, Santa Barbara, CA 93106, USA\n(Dated: October 24, 2018)\nCooperation and competition between the antiferromagnetic, d-wave superconducting and Mottinsulating states are explored for the two-dimensional Hubbard model including nearest and nextnearest-neighbor hoppings at zero temperature. Using the variational cluster approach with clusters\nof different shapes and sizes up to 10 sites, it is found that the doping-driven transition from a phase\nwith microscopic coexistence of antiferromagnetism and superconductivity to a purely superconducting phase is discontinuous for strong interaction and accompanied by phase separation. At half-filling\nthe system is in an antiferromagnetic Mott-insulating state with vanishing charge compressibility.\nUpon decreasing the interaction strength U below a certain critical value of roughly Uc ∼ 4 (in\nunits of the nearest-neighbor hopping), however, the filling-dependent magnetic transition changes\nits character and becomes continuous. Phase separation or, more carefully, the tendency towards the\nformation of inhomogeneous states disappears. This critical value is in contrast to previous studies,\nwhere a much larger value was obtained. Moreover, we find that the system at half-filling undergoes\nthe Mott transition from an insulator to a state with a finite charge compressibility at essentially\nthe same value. The weakly correlated state at half-filling exhibits superconductivity microscopically admixed to the antiferromagnetic order. This scenario suggests a close relation between phase\nseparation and the Mott-insulator physics.\nPACS numbers: 71.10.-w,71.10.Hf,74.20.-z\n\nI.\n\nINTRODUCTION\n\nOne of the standard models in theoretical studies\nof high-temperature superconductors is the single-band\nHubbard model. Substantial progress in the understanding of its ground-state properties in two dimensions has\nbeen achieved by applying dynamical quantum-cluster\napproaches1, such as the dynamical cluster approximation2 , the cellular dynamical mean-field theory3,4 or the\nvariational cluster approach (VCA)5 . Several studies predict d-wave superconductivity at low6 or zero temperatures7,8,9,10,11 for intermediate interaction strengths of\nthe order of the free bandwidth.\nExperimentally, it is well known that cuprate-based\nhigh-TC compounds at low doping concentrations tend to\nform charge and spin inhomogeneities, such as stripe12,13\nor checkerboard modulations14,15,16,17 . An unbiased theoretical study of inhomogeneous phases is hardly possible within quantum-cluster approches for the presently\naccessible cluster sizes. Furthermore, for a realistic\nmodelling of charge inhomogeneities additional nonlocal interaction terms should actually be taken into\naccount18,19,20 . However, by searching for phase separation, an overall tendency towards the formation of inhomogenous phases can easily and reliably be detected\neven if only homogeneous solutions are allowed within\nthe cluster mean-field calculation.\nPhase separation (PS), i. e., separation into two homogeneous macroscopic regions with different thermody-\n\nnamical properties, is the most simple kind of inhomogeneity. It has been argued18,20 that phase separation occurring in Hubbard- or t-J-type models with short-range\ninteractions only, can transform to microscopically inhomogeneous structures, such as stripes, when long-range\nrepulsions were included19 . For this reason, the investigation of PS in the Hubbard model is a reasonable starting\npoint for an understanding of inhomogeneous phases in\nthe high-TC cuprate materials.\nThe occurrence of phase separation in the Hubbard\nmodel has been investigated in the past using several\ndifferent techniques. Calculations for finite clusters using quantum Monte-Carlo techniques21,22 found no evidence for PS in the Hubbard model with nearest-neighbor\nhopping only. Different results have been obtained in\ninfinite dimensions within dynamical mean-field theory\n(DMFT) where PS has been reported23,24,25 . PS has\nalso been discussed in the context of marginal quantum\ncriticality26,27 , where PS occurs at the first-order side\nof the marginal quantum critical point (MQCP). For\nthe two-dimensional model including hopping between\nnext-nearest neighbors, calculations within the dynamical cluster approximation yield phase separation in the\nparamagnetic state28 . VCA and cellular DMFT studies\npredict phase separation between a phase with long-range\nantiferromagnetic (AF) order at low doping and a superconducting (SC) state at high doping8,9,10,11 .\nThe new aspect of our work is to systematically investigate the fate of the phase-separated state within VCA\n\n\f2\nwhen decreasing the interaction strength. We demonstrate by using as reference systems a variety of cluster\nsizes up to 10 sites, that the tendency towards PS is lost\nat small U of the order of Uc ∼ 4. Above of this value\nwe found strong evidence from this systematic study that\nthe inhomogeneous state is indeed present in the thermodynamic limit.\nIn previous cellular DMFT work11 , a transition which\nis in certain aspects similar to ours was found around\nUc ≈ 8, using 2 × 2 clusters only. According to previous\nstudies29,30,31 it is known, however, that a physical transition for the 2D Hubbard model is taking place at much\nsmaller values, U ≈ 4. Here, the two separate energy\nscales U and J are eventually merging, as examplified\nby the transition from two energy bands (coherent lowlying and incoherent Hubbard bands) to just one single\nband. A motivation for our study was partly to investigate the relation between the metal-to-insulator transition and PS. Most strikingly, we find that the transition to a metallic state at half-filling occurs at essentially\nthe same value of U , below which PS disappears. This\nstrongly suggests a definite relation between PS and the\nMott insulator, a relation that was previously speculated\nabout32 .\nThe paper is organized as follows: In Sec. II, we introduce the model and briefly review the variational cluster\napproximation. In Sec. III, our results are presented and\ndiscussed. The conclusions are summarized in Sec. IV.\n\nII.\n\nTHEORY\n\nUsing standard notations, the Hubbard model is given\nby H = H0 (t) + H1 where\nH0 (t) = −tn.n.\nH1 = U\n\nX\n\nX\nhiji,σ\n\nc†iσ cjσ − tn.n.n.\n\nni↑ ni↓ .\n\nX\n\nc†iσ cjσ\n\n(1)\n\nhhijii,σ\n\n(2)\n\nH ′ = H0 (t′ ) + H1 . Within the VCA one takes as a reference system a lattice split up into isolated clusters of\na given size. Thereby, the effects of short-range correlations on the self-energy are included on a scale given\nby the cluster extension. Trial self-energies Σ = Σ(t′ )\nare varied by varying the parameters t′ . Inserting the\ntrial self-energy into the self-energy functional generates\na function Ω(t′ ) = Ω[Σ(t′ )] the stationary points of which\nwe are interested in. It can be shown5,33 that\n−1\nΩ(t′ ) = Ω′ + Tr ln(G0,t\n− Σ(t′ ))−1 − Tr ln Gt′ ,\n\n(3)\n\nwhere Ω′ is the grand potential and Gt′ the Green's function of the reference system and G0,t the non-interacting\nGreen's function of the physical system. While G0,t\nis easily accessible, we calculate the reference system's\nproperties using full diagonalization for small clusters,\nand the band Lanczos methods for larger ones. A description of the numerical details can be found in Ref. 10.\nSince we are interested in PS involving symmetrybroken antiferromagnetic and d-wave superconducting\nphases, our reference system includes the corresponding\n(ficticious) symmetry-breaking fields,\nX\n′\n(4a)\nHAF\n= h′AF\n(ni↑ − ni↓ )eiQRi\niσ\n\n′\nHSC\n\n=\n\nh′SC\n\nX ηij\nij\n\n2\n\n(ci↑ cj↓ + h.c.)\n\n(4b)\n\nwhere h′AF and h′SC are the strengths of a staggered magnetic and of a nearest-neighbor d-wave pairing \"Weiss\"\nfield, respectiely. Furthermore, Q = (π, π) is the AF\nwave vector, and ηij denotes the d-wave form factor\nwhich is equal to +1 (−1) for nearest-neighbor sites with\nRi − Rj in x (y) direction. In addition, an on-site potential is included in the set of variational parameters to\nensure a thermodynamically consistent determination of\nthe average particle number9 . Note that all three variational parameters couple to one-particle operators only.\n\ni\n(†)\n\nThe operator ciσ creates (annihilates) an electron with\nspin σ at the site i, and niσ is the corresponding occupation number operator. We consider both hopping\ntn.n. along nearest-neighbor bonds hiji as well as hopping\ntn.n.n. along next-nearest-neighbor bonds hhijii. U is the\nlocal Coulomb interaction. We set the unit of energy by\ntn.n. and choose tn.n.n. = −0.3tn.n. throughout the paper\nwhich is a realistic value for the cuprate materials.\nThe main idea of the variational-cluster approximation\n(VCA)5,33 is to consider a \"reference system\" to span a\nspace of trial self-energies among which the self-energy\nthat describes best the physics of the infinite-size lattice model is obtained via a dynamical variational principle δΩ[Σ] = 0. Here Ω stands for the grand potential. The reference system is given by a Hamiltonian H ′\nwith the same interaction part H1 as the physical system but with modified one-particle parameters t′ , i. e.,\n\nIII.\n\nRESULTS\n\nFor the calculations we concentrate on the hole-doped\nside of the phase diagram since it has been shown that\nthere PS is much more pronounced than in the electrondoped case8,9,10 . The occurence of PS can be best inferred from the dependence of the chemical potential on\nthe particle number. For a physical system in thermodynamical equilibrium the charge susceptibility κ = ∂n/∂μ\nmust be non-negative. Hence, κ < 0 indicates a thermodynamically unstable phase. At a fixed average density\nn lying in the instability region n1 < n < n2 , the free\nenergy can be reduced if the system develops two spatially separated homogeneous phases, one with a fraction\n−n\nx = nn22−n\nof particles at the density n1 < n and an1\nother one with the fraction 1 − x at n2 > n, rather than\nhaving a single homogeneous phase. The boundaries n1\n\n\f3\n\n1.7\n\nU = 12\n\nn1\n\nn2\n\n1.6\n\n8x 8\n\n1.8\n\n10 x 10\n\n1.5\n1.4\n\nμ\n\n1.4\n\nU=8\n\n1.3\n1.2\n1.1\n1.0\n\nFIG.\nused\nsystems in this study. The\n√ 2: Clusters\n√\n√ as reference\n√\n\" 10 × 10\" and \" 8 × 8\" clusters are marked explicitly\nin the figure.\n\nAF+SC\n\nSC\nU=4\n\n0.05\n\n0.8\n\n0.85\n\n0.9\n\nn\n\n0.95\n\n1\n\nFIG. 1: (Color online) Chemical potential μ as function of the\naverage density n, calculated with a 2 × 2 cluster as reference\nsystem for different values of U . From top to bottom: U = 12,\n8, and 4, respectively. n1 and n2 denote the boundaries of the\ninstability (PS) region. Black solid lines: Pure SC phase. Red\ndashed lines: AF+SC mixed phase. Dotted horizontal line:\ncritical chemical potential (where applicable).\n\nand n2 of the instability region can be obtained by a\nMaxwell construction (see Fig. 1), in close analogy to a\ngas-liquid system. After the Maxwell construction, the\nphysical chemical potential is independent of n between\nn1 and n2 .\nIn Fig. 1 we show results for the interrelation of the\nchemical potential μ and the average density n as a function of Coulomb interaction U . The calculations have\nbeen done with a 2 × 2 cluster as a reference system. In\nthe strong coupling regime, U = 12, we find that the\nchemical potential μ as function of the density n shows\na nonmonotonic behavior (and thus κ < 0) as mentioned\nabove. We conclude that for this coupling and within\nthe precision set by the 2 × 2 cluster reference system,\nthe results imply PS into an AF+SC mixed phase34 at\nlow doping and a purely SC phase at higher doping. The\ncritical chemical potential where the two phases coexist,\nis indicated by a horizontal dotted line in Fig. 1. This\nbehavior is very similar to the previously reported one\nfor U = 89,10 . For comparison, results for U = 8 – as\npublished in Ref. 9 – are shown in Fig. 1 in the middle\npanel.\nThe picture changes even qualitatively when going to\nweak interactions, e. g., U = 4. As shown in the lower\npanel of Fig. 1, the chemical potential as function of n\nshows a positive slope for all dopings, without an intermediate region with negative sign. We conclude that for\nweak interaction there is no tendency to the formation of\ninhomogeneities, even for the smallest cluster we used for\n\n2x2\n\n0.03\n\n8s\n\n0.02\n\n4x2\n\n0.01\n\n5x2\n\n10s\n\n0\n0.95\n\nn\n\n0.8\n\n∆μ\n\n0.6\n\n0.04\n\n0.9\n\n0.85\n\n4\n\n6\n\n8\n\n10\n\n12\n\n14\n\nU\n\nFIG. 3: (Color online) Characteristic energy ∆μ = μ∗ − μc\n(top) and critical densities n1 and n2 (bottom) as functions\nof U , calculated using the clusters\n√ shown\n√ in Fig. 2 as reference\nsystems, 2 × 2 (black, circles), 8 × 8 (blue, squares),\n4√× 2\n√\n(red, stars), 5 × 2 (magenta, triangles down), and 10 × 10\n(green, triangles up). Lower plot: Solid lines correspond to\nthe critical density n1 , dashed lines to the critical density n2 .\n\nour calculations. Instead, the AF+SC solution is stable\nup to larger dopings, and the staggered magnetization\nvanishes continuously in the stable and homogeneous solution.\nSince the occurrence of PS is subject to rather strong\nfinite-size effects10 , and in order to further elucidate the\ndifference between the coupling regimes, we have recalculated the phase diagram using larger clusters with Lc = 8\nand Lc = 10 lattice sites as reference systems (see Fig. 2).\nFor both Lc = 8 and 10 we have considered two different cluster geometries to estimate dependencies on the\ncluster shape.\nIn addition to the boundaries of the instability region,\nn1 and n2 , we define a characteristic energy ∆μ = μ∗ −μc .\nHere, μ∗ is defined as the point where the slope of\nμ(n) changes sign, and μc is the critical chemical poten-\n\n\f4\n0.8\n\n-0.85\n-0.9\n\nAF\n\n5x2\n\n-0.95\n\n0.4\n\nU=4\n\n4x2\n\nLc = 2 x 2\nLc = 4 x 2\nLc = 5 x 2\n\n0.2\n\n-0.5\n\n0\n\n-0.6\n\n0.1\n\n-0.7\n\nU=8\n\ndSC\n\nE0 / V\n\nU = 12\n\nU=8\n\nU=4\n\n0.6\n\n2x2\n\n0.05\n\n-0.4\n-0.5\n\n0\n\nU = 12\n\n-0.6\n0.85\n\n0.9\n\nn\n\n0.95\n\n0.85 0.9 0.95\n\nn\n\n1\n\nFIG. 4: (Color online) Ground-state energy per site E0 /L\nas function of electron density n, for U = 4 (top), U = 8\n(middle), and U = 12 (bottom). Results are shown for the\n2 × 2 (black solid), 4 × 2 (red dashed-dotted), and 5 × 2 (green\ndashed) reference systems.\n\ntial, i. e., the point at which ΩAF+SC (μ) crosses ΩSC (μ).\nEquivalently, μc is fixed by the Maxwell construction,\nsee Fig. 1. In the limit of infinite cluster size, the characteristic energy ∆μ must vanish as the reference system (and thereby also the original system) is solved exactly within the VCA: For Lc → ∞ (and for densities in\nthe exact instability region) the reference system spontaneouly generates the phase-separated state, and μ(n)\nbecomes flat between n1 and n2 , as discussed above. On\nthe other hand, the difference between the critical densities n2 −n1 must converge to a nonzero value for Lc → ∞\nwhenever the system in the thermodynamic limit shows\nphase separation. Notice that the difference between the\ngrand potentials ΩAF+SC and ΩSC becomes smaller and\nsmaller with increasing cluster size. Thus, together with\nthe increasing numerical effort, this makes the identification of ∆μ harder for larger clusters. Contrary, the\nslope of Ω(μ), i. e. the particle density, is not affected by\na systematic shift and, therefore, its calculation is quite\nreliable also for larger Lc .\nResults for these quantities are shown in Fig. 3. The\nupper panel shows ∆μ as a function of the Hubbard interaction U . As expected from the discussion above, ∆μ\ndecreases for increasing cluster size. Quite surprising,\nhowever, is the dependence of ∆μ on the interaction:\nAs ∆μ 6= 0 is a finite-size effect, one could expect ∆μ to\nbe smaller for stronger interactions since a cluster meanfield approach quite generally is expected to be more reliable in the strong-coupling than in the weak-coupling\nregime. At least, it is known from previous calculations35\nthat for weaker interactions finite-size effects are larger\nas could be seen from the stronger dependence of the optimal variational parameters on the size of the reference\nsystem cluster. In fact, we find for large U (see Fig. 3)\nthat ∆μ increases with decreasing interaction. Below\n\n1\n\n0.9\n\nn\n\n0.95\n\n1\n\n0.9\n\nn\n\n0.95\n\n1\n\nFIG. 5: (Color online) Order parameters as a function of\ndensity for U = 4 (left), U = 8 (middle), and U = 12 (right).\nTop: AF order parameter. Bottom: d-wave SC order parameter. Results are shown for the 2 × 2 (black solid), 4 × 2 (red\ndashed-dotted), and 5 × 2 (green dashed) reference systems.\n\nU ≈ 10, however, ∆μ starts to decrease and eventually\neven vanishes at some critical value Uc (which exhibits\na finite but weak dependence on the cluster size). This\ndecrease indicates a qualitative change of the phase transition with decreasing U .\nFrom the analysis of the critical densities we see that\nthe vanishing of ∆μ corresponds to the disappearance\nof the phase-separated state: The critical densities n1\nand n2 of the two coexisting phases are shown in the\nlower panel of Fig. 3. The dependence of their difference\nn2 − n1 on U closely resembles the dependence of ∆μ. In\nparticular, for U below some Uc , n1 and n2 collapse to a\nsingle point, i. e., phase separation disappears.\n√\n√\nIt is encouraging to see that, except for the 10 × 10\ncluster, the critical densities shown in this plot\n√ depend\n√\nonly very weakly on the cluster size. The 10 × 10\ncluster seems to behave differently. Probably, its shape\n(see Fig. 2) makes this cluster unsuitable for finite-size\nscaling. This is also confirmed by the fact that ∆μ does\nnot display the correct scaling behavior for this cluster.\nIn addition, the 5 × 2 cluster with the same number of\nsites Lc = 10 does display the correct√Lc dependence\nof\n√\n∆μ. Excluding the results from the 10 × 10 cluster,\nn1 and n2 show a very weak dependence on Lc . Close to\nUc , the Lc dependence is somewhat stronger again which\nis not surprising, of course.\nIn view of the results for different interaction strengths\nand cluster sizes we conclude that PS persists in the thermodynamic limit down to a critical interaction Uc . Admittedly, there is a rather large uncertainty in the determination of Uc : Estimates range between\nUc ∼ 4 and\n√\n√\nUc ∼ 6. Interestingly, results from the 10 × 10 cluster\ndo not only show a lower critical interaction but also an\nupper critical value Uc2 ≈ 10 above which PS disappears.\nAs discussed above, however, the question is whether results for this cluster shape are reliable or not.\n\n\f5\n1.02\n\nU=3\n\nU=5\n\nU=3.5 U=4\n\nn\n\n1.01\n1\n\nLc = 4\n\n0.99\n1.02\n\nn\n\n1.01\n1\n\nLc = 8\n\n0.99\n\n1.02\n\nn\n\n1.01\n1\n\nLc = 10\n\n0.99\n0.98\n\n1\n\n1.5\n\n2\n\nμ\n\n2.5\n\n3\n\nFIG. 6: (Color online) Closing of the Mott gap as function\nof U . √\nFrom top\n√ to bottom: Lc = 2 × 2, Lc = 4 × 2, and\nLc = 10 × 10 site clusters. From left to right: U = 3\n(green), 3.5 (blue), 4 (black), and 5 (red).\n\nFrom the grand potential we can extract the groundstate energy of the the system by E0 = Ω + μN . Results for the ground-state energy per site, i. e. E0 /L, are\nshown in Fig. 4 for U = 4, 8, and 12, resp. Although some\n(small) finite-size effects are visible, the ground-state energy seems to be well converged in our approach. As a\ncheck for consistency we found that the general relation\n∂(E0 /L)/∂n = μ is fulfilled within numerical accuracy.\nThis relation is a consequence of the Legendre transformation E0 = Ω + μN and must be true in all calculations\nindependent of the cluster used as a reference system.\nThe filling dependence of the order parameters is displayed in Fig. 5. Although some finite-size effects are visible, the results strongly indicate that superconductivity\npersists in the thermodynamic limit. We can also extract an interesting trend when comparing the results for\nU = 8 with those for U = 4: While the staggered magnetization decreases the SC order parameter increases with\ndecreasing U . At the same time the doping region where\na magnetic solution exists, extends to somewhat larger\ndopings for smaller U . Another difference is the small\nbut finite value of the dSC order parameter at half-filling\n(n = 1) for U = 4, as can be seen in the lower right plot\nof Fig. 5. This is directly related to the closing of the\nMott-Hubbard gap, as discussed below.\nThere are also some differences between U = 8 and\nU = 12, although they are considerably smaller. Taking for instance the boundary of the AF phase, i. e. the\ndensity where the AF order parameter vanishes, it is at\nn ≈ 0.82 for U = 4, n ≈ 0.87 for U = 8, and n ≈ 0.89\nfor U = 12. Also the changes of the SC order parameter\nare very small. We want to stress again that the major\ndifference, however, is the absence of PS for U = 4, see\nFigs. 1 and 4.\n\nTo understand the occurrence of a critical interaction\nfor PS as well as the finite dSC order parameter at halffilling, we study the n(μ) behavior close to half-filling\nas a function of U . Results are shown in Fig. 6 in the\nvicinity of n = 1. For U = 5 there is a flat n(μ) dependence for a finite range of chemical potentials, i. e., a\nvanishing charge susceptibility κ = 0. This indicates the\npresence of an (AF) Mott insulating state at half-filling.\nThe Mott gap shrinks with decreasing U , and eventually the system shows metallic behavior at n = 1. This\nagrees well with previous results30,31,36,37 . For the smallest system the transition to the metal takes place at an\ninteraction strength somewhat above U = 4, whereas for\nlarger clusters the critical U is shifted to slightly smaller\nvalues. For the 5 × 2 cluster\n√ (not\n√ shown) it is slightly below U = 4, and for the 10 × 10 cluster the transition\ntakes place slightly above U = 3.5. Notice that the value\nof U where the gap closes can also be read off directly\nfrom the dSC order parameter. Below the critical U , the\nsystem is metallic even at n = 1, and hence can also be\nsuperconducting at half-filling. This is seen in our calculations which give a finite order parameter at n = 1\n(see Fig. 5). We like to stress that close to half-filling the\nsolution with lowest energy is always a mixed AF+SC\none34 . We checked this by comparing this solution to the\npure AF and SC ones.\nIt is obvious that our determination of Uc is not as\nprecise as it can be done by other methods, e. g. the\npath-integral renormalisation group37 . Moreover, with\nthe cluster sizes available in the present form of the VCA,\nit is not possible to detect whether or not we have a\nMQCP26,27 with a diverging charge susceptibility κ at\nthe metal-insulator boundary. Nevertheless, our calculation allows to make a qualitative connection of the MIT\nand PS. It indicates that the collapse of the upper and\nlower dopings n1 and n2 (i. e. the disappearance of PS)\nand the closing of the Mott gap occur at almost the same\ncritical interaction strength. It appears that it is important to have a Mott insulator at half-filling in order to\nget phase separation away from half-filling. Due to the\nlimited cluster sizes available and the according limited\naccurary in the determination of critical points, however,\nthis statement is somewhat speculative. Note that a relation between phase separation and the doping of a Mott\ninsulator has been discussed in Ref. 32. There, it has\nbeen argued that a Mott insulator with broken symmetry, which is the SU (2) symmetry in our case, enhances\nthe possibility of PS.\nIn order to analyze the relation with single-particle excitations, we plot in Fig. 7 the Fermi surface\nfor\n√\n√ weak\ncoupling, U = 3.5, calculated with the 8 × 8 cluster. The closing of the Mott gap is clearly manifested\nby the occurrence of both hole and electron pockets near\n( π2 , π2 ) and (π, 0), respectively, in direct contrast to the\nFermi surface for larger coupling and U = 8 where one\nhas either hole or electron pockets at low doping9 . The\nsimultaneous occurrence of hole and electron pockets has\nalso been reported recently in weak-coupling calculations\n\n\f6\n(π,π)\n\n(0,0)\nFIG. 7: Representation of the Fermi surface for an interaction\n√\n√\nU = 3.5 < Uc and n = 1. Calculation using the 8 × 8\ncluster. Dark regions denote large spectral weight integrated\nover a small frequency window of ∆ω = ±0.05 around ω = 0.\n10\n8\n\nω-μ\n\n6\n4\nU=8\n\n2\n0\n-2\n-4\n8\n6\n\nU=4\n\nω-μ\n\n4\n2\n\nreported quite recently based on cellular DMFT calculations by Capone et al.11 for the two-dimensional Hubbard model with tn.n.n. = 0. Capone et al. inferred a\ncritical interaction of approximately Uc ≈ 8 below which\nthe doping-dependent transition to a paramagnet is continuous and above which there is a first-order transition\naccompanied by phase separation. The Uc reported for\ntn.n.n. = 0 and using cellular DMFT with 2 × 2 clusters\nis somewhat larger as in our study. A qualitative difference, however, is that we always find a mixed AF+SC\nstate at low doping whereas the authors of Ref. 11 find\na pure AF phase for strong interaction close to halffilling. One should note, however, that finding the stable solution with lowest energy can be a difficult task\nwithin quantum-cluster approaches. In Ref. 11 the calculation starts from pure AF and SC solutions and a\nmixed AF+SC solution is searched for by applying small\nperturbations to the pure ones. This procedure does not\nnecessarily lead from one local solution to another, especially if the two are well separated in parameter space.\nFinally, we would like to comment on the relation of\nour results to the t-J-model. Translating our results of\n2\nFig. 3 to J ∝ tU , we argue that PS for small J (large\nU ) should be weak, or eventually absent in the thermodynamic and U → ∞ limit, since ∆μ decreases significantly with increasing U . However, from our results it is\nnot possible to deduce a definite critical Jc below which\nPS should be absent. Nevertheless, the spectral function\nand in particular the low-lying quasi-particle band in our\ncalculations is in well agreement with the low-lying bands\nin the t-J-model.39\n\n0\n-2\n\nIV.\n\nCONCLUSIONS\n\n-4\nΓ\n\nM\n\nX\n\nΓ\n\nk\nFIG. 8: Spectral function for\n√ U =\n√ 8 (top) and U = 4 (bottom). Calculation using a 8 × 8 cluster. The horizontal\ndashed line marks the chemical potential.\n\nclose to half-filling38 .\nAnother way to see the closing of the Mott gap is to\nlook at the spectral function directly, which we plot in\nFig. 8 for U = 8 and U =√ 4, resp.\nCalculations have\n√\nbeen done using the same 8 × 8 cluster as for Fig. 7,\nbut at finite hole-doping just at the critical doping n2 in\nthe pure SC phase. From this figure, it is obvious that\nfor U = 8 one has a quasi-particle band at the Fermi\nlevel, well separated from the upper Hubbard band. For\nU = 4, however, the upper and lower Hubbard bands\nmerge, and closely resemble the band structure of the\nfree system, except for the superconducting gap around\n(π, 0).\nRelated ideas of a change of the type of the phase transition as function of the interaction strength have been\n\nTo summarize, we have studied the occurrence of phase\nseparation in the two-dimensional Hubbard model at zero\ntemperature depending on the strength of the Hubbard\ninteraction U . We have employed the variational-cluster\napproach using clusters of different shapes and sizes up to\n10 sites. Our results show that the nature of the dopingdependent transition from the antiferromagnetic and superconducting state to a non-magnetic and purely superconducting state changes from discontinuous to continuous when going from the strong- and intermediate- to the\nweak-interaction regime. Below a critical value for the\ninteraction strength no phase separation can be found.\nAbove the critcal value, there is a clear discontinuity in\nthe density as a function of the chemical potential with\na small finite-size error only. This is a strong indication\nthat PS, or at least a phase with mesoscopic inhomogeneities, should persist in the thermodynamic limit, as\nlong as the interaction is sufficiently strong.\nWe also studied the interaction-driven Mott transition at half-filling. For weak interactions (and tn.n.n. =\n−0.3tn.n.) the system is in a mixed AF+dSC state with\na finite charge susceptibility. The transition to the AF\nMott insulator with vanishing charge susceptibility takes\n\n\f7\nplace at U ≈ 3.5 − 4. As the Mott transition at halffilling takes place at the same interation strength where\nphase separation appears in the doped case, one might\nspeculate that these two phenomena are closely related.\n\nported by the Deutsche Forschungsgemeinschaft within\nthe Forschergruppe FOR 538, by the Austrian science\nfund (FWF project P18551-N16), and in part by the\nNational Science Foundation under Grant No. PHY0551164.\n\nAcknowledgments\n\nThe authors thank M. Imada for his valuable comments on the manuscript. This work has been sup-\n\n∗\n1\n\n2\n\n3\n\n4\n\n5\n\n6\n\n7\n\n8\n\n9\n\n10\n\n11\n\n12\n\n13\n\n14\n\n15\n\n16\n\n17\n\n18\n\n19\n\n20\n\nElectronic address: aichhorn@physik.uni-wuerzburg.de\nT. Maier, M. Jarrell, T. Pruschke, and M. H. Hettler, Rev.\nMod. Phys. 77, 1027 (2005).\nM. H. Hettler, A. N. Tahvildar-Zadeh, M. Jarrell, T. Pruschke, and H. R. Krishnamurthy, Phys. Rev. B 58, R7475\n(1998).\nG. Kotliar, S. Y. Savrasov, G. Pálsson, and G. Biroli, Phys.\nRev. Lett. 87, 186401 (2001).\nA. I. Lichtenstein and M. I. Katsnelson, Phys. Rev. B 62,\nR9283 (2000).\nM. Potthoff, M. Aichhorn, and C. Dahnken, Phys. Rev.\nLett. 91, 206402 (2003).\nT. A. Maier, M. Jarrell, T. C. Schulthess, P. R. C. Kent,\nand J. B. White, Phys. Rev. Lett. 95, 237001 (2005).\nD. Sénéchal, P. L. Lavertu, M. A. Marois, and A.-M.S.\nTremblay, Phys. Rev. Lett. 94, 156404 (2005).\nM. Aichhorn and E. Arrigoni, Europhys. Lett. 72, 117\n(2005).\nM. Aichhorn, E. Arrigoni, M. Potthoff, and W. Hanke,\nPhys. Rev. B 74, 024508 (2006).\nM. Aichhorn, E. Arrigoni, M. Potthoff, and W. Hanke,\nPhys. Rev. B 74, 235117 (2006).\nM. Capone and G. Kotliar, Phys. Rev. B 74, 054513\n(2006).\nJ. M. Tranquada, B. J. Sternlieb, J. D. Axe, Y. Nakamura,\nand S. Uchida, Nature 375, 561 (1995).\nJ. M. Tranquada, J. D. Axe, N. Ichikawa, Y. Nakamura, S.\nUchida, and B. Nachumi, Phys. Rev. B 54, 7489 (1996).\nM. Vershinin, S. Misra, S. Ono, Y. Abe, Y. Ando, and A.\nYazdani, Science 303, 1995 (2004).\nJ. E. Hoffman, E. W. Hudson, K. M. Lang, V. Madhavan,\nH. Eisaki, S. Uchida, and J. C. Davis, Science 295, 466\n(2002).\nT. Hanaguri, C. Lupien, Y. Kohsaka, D. H. Lee, M.\nAzuma, M. Takano, H. Takagi, and J. C. Davis, Nature\n430, 1001 (2004).\nK. McElroy, D. H. Lee, J. E. Hoffman, K. M. Lang, J. Lee,\nE. W. Hudson, H. Eisaki, S. Uchida, and J. C. Davis, Phys.\nRev. Lett. 94, 197005 (2005).\nU. Löw, V. J. Emery, K. Fabricius, and S. A. Kivelson,\nPhys. Rev. Lett. 72, 1918 (1994).\nE. Arrigoni, A. P. Harju, W. Hanke, B. Brendel, and S. A.\nKivelson, Phys. Rev. B 65, 134503 (2002).\nS. A. Kivelson, I. P. Bindloss, E. Fradkin, V. Oganesyan,\n\n21\n\n22\n\n23\n\n24\n25\n\n26\n27\n28\n\n29\n\n30\n\n31\n\n32\n\n33\n34\n\n35\n\n36\n\n37\n\n38\n\n39\n\n40\n\n41\n\nJ. M. Tranquada, A. Kapitulnik, and C. Howald, Rev.\nMod. Phys. 75, 1201 (2003).\nA. Moreo, D. Scalapino, and E. Dagotto, Phys. Rev. B 43,\n11442 (1991).\nF. Becca, M. Capone, and S. Sorella, Phys. Rev. B 62,\n12700 (2000).\nR. Zitzler, T. Pruschke, and R. Bulla, Eur. Phys. J. B 27,\n473 (2002).\nP. Werner and A. J. Millis, Phys. Rev. B 75, 085108 (2007).\nM. Eckstein, M. Kollar, M. Potthoff, and D. Vollhardt,\nPhys. Rev. B 75, 125103 (2007).\nM. Imada, Phys. Rev. B 72, 075113 (2005).\nT. Misawa and M. Imada, Phys. Rev. B 75, 115121 (2007).\nA. Macridin, M. Jarrell, and T. Maier, Phys. Rev. B 74,\n085104 (2006).\nR. Preuss, W. Hanke, and W. von der Linden, Phys. Rev.\nLett. 75, 1344 (1995).\nC. Gröber, M. G. Zacher, and R. Eder, condmat/9810246\n(unpublished).\nD. Sénéchal and A.-M.S. Tremblay, Phys. Rev. Lett. 92,\n126401 (2004).\nD. H. Lee and S. A. Kivelson, Phys. Rev. B 67, 024506\n(2003).\nM. Potthoff, Eur. Phys. J B 32, 429 (2003).\nA mixed AF+SC phase has been first obtained by cluster\nmethods in Ref. 4, and has been observed experimentally\nin Ref. 40 and recently in Ref. 41.\nM. Aichhorn, H. G. Evertz, W. von der Linden, and M.\nPotthoff, Phys. Rev. B 70, 235107 (2004).\nS. Onoda and M. Imada, Phys. Rev. B 67, 161102(R)\n(2003).\nT. Mizusaki and M. Imada, Phys. Rev. B 74, 014421\n(2006).\nJ. Reiss, D. Rohe, and W. Metzner, Phys. Rev. B 75,\n075110 (2007).\nfor a recent work on the t-J-model, see: M. M. Zemljic,\nP. Prelovsek, and T. Tohyama, arXiv:0706.1156 (unpublished).\nP. Dai, H. J. Kang, H. A. Mook, M. Matsuura, J. W.\nLynn, Y. Kurita, S. Komiya, and Y. Ando, Phys. Rev. B\n71, 100502(R) (2005).\nW. Yu, J. S. Higgins, P. Bach, and R. L. Greene, Phys.\nRev. B 76, 020503(R) (2007).\n\n\f"}