{"id": "http://arxiv.org/abs/1111.3256v1", "guidislink": true, "updated": "2011-11-14T15:50:59Z", "updated_parsed": [2011, 11, 14, 15, 50, 59, 0, 318, 0], "published": "2011-11-14T15:50:59Z", "published_parsed": [2011, 11, 14, 15, 50, 59, 0, 318, 0], "title": "Evidence of Photocatalytic Dissociation of Water on TiO2 with Atomic\n  Resolution", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1111.5286%2C1111.0535%2C1111.5417%2C1111.4637%2C1111.5169%2C1111.7059%2C1111.6544%2C1111.4754%2C1111.2651%2C1111.6765%2C1111.0604%2C1111.5546%2C1111.5000%2C1111.0360%2C1111.2092%2C1111.3259%2C1111.2393%2C1111.5470%2C1111.2176%2C1111.5257%2C1111.6493%2C1111.5954%2C1111.7228%2C1111.7007%2C1111.3756%2C1111.6227%2C1111.3150%2C1111.1376%2C1111.2275%2C1111.1071%2C1111.4261%2C1111.4497%2C1111.1246%2C1111.0267%2C1111.2869%2C1111.6662%2C1111.3256%2C1111.1082%2C1111.7029%2C1111.3166%2C1111.6372%2C1111.1471%2C1111.3032%2C1111.1092%2C1111.7021%2C1111.2322%2C1111.0612%2C1111.0255%2C1111.1146%2C1111.2014%2C1111.6693%2C1111.3773%2C1111.1041%2C1111.6142%2C1111.6418%2C1111.1108%2C1111.3584%2C1111.6202%2C1111.1066%2C1111.7235%2C1111.3772%2C1111.5044%2C1111.2362%2C1111.2496%2C1111.4092%2C1111.4269%2C1111.2597%2C1111.2203%2C1111.4043%2C1111.3412%2C1111.4168%2C1111.5344%2C1111.5691%2C1111.6222%2C1111.5908%2C1111.5648%2C1111.4975%2C1111.0073%2C1111.1798%2C1111.2031%2C1111.2278%2C1111.2424%2C1111.7113%2C1111.0320%2C1111.0411%2C1111.3782%2C1111.2665%2C1111.5292%2C1111.3601%2C1111.5977%2C1111.5172%2C1111.4568%2C1111.0068%2C1111.1679%2C1111.5147%2C1111.4503%2C1111.2460%2C1111.3765%2C1111.6191%2C1111.2826%2C1111.0766&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Evidence of Photocatalytic Dissociation of Water on TiO2 with Atomic\n  Resolution"}, "summary": "Photocatalytic water splitting reaction on TiO2 surface is one of the\nfundamental issues that bears significant implication in hydrogen energy\ntechnology and has been extensively studied. However, the existence of the very\nfirst reaction step, the direct photo-dissociation of water, has been\ndisregarded. Here, we provide unambiguously experimental evidence to\ndemonstrate that adsorbed water molecules on reduced rutile TiO2(110)-1\\times1\nsurface can be dissociated under UV irradiation using low temperature scanning\ntunneling microscopy. It is identified that a water molecule at fivefold\ncoordinated Ti (Ti5c) site can be photocatalytically dissociated, resulting in\na hydroxyl at Ti5c and another hydroxyl at bridge oxygen row. Our findings\nreveal a missing link in the photocatalytic water splitting reaction chain,\nwhich greatly contribute to the detailed understanding of underlying mechanism.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1111.5286%2C1111.0535%2C1111.5417%2C1111.4637%2C1111.5169%2C1111.7059%2C1111.6544%2C1111.4754%2C1111.2651%2C1111.6765%2C1111.0604%2C1111.5546%2C1111.5000%2C1111.0360%2C1111.2092%2C1111.3259%2C1111.2393%2C1111.5470%2C1111.2176%2C1111.5257%2C1111.6493%2C1111.5954%2C1111.7228%2C1111.7007%2C1111.3756%2C1111.6227%2C1111.3150%2C1111.1376%2C1111.2275%2C1111.1071%2C1111.4261%2C1111.4497%2C1111.1246%2C1111.0267%2C1111.2869%2C1111.6662%2C1111.3256%2C1111.1082%2C1111.7029%2C1111.3166%2C1111.6372%2C1111.1471%2C1111.3032%2C1111.1092%2C1111.7021%2C1111.2322%2C1111.0612%2C1111.0255%2C1111.1146%2C1111.2014%2C1111.6693%2C1111.3773%2C1111.1041%2C1111.6142%2C1111.6418%2C1111.1108%2C1111.3584%2C1111.6202%2C1111.1066%2C1111.7235%2C1111.3772%2C1111.5044%2C1111.2362%2C1111.2496%2C1111.4092%2C1111.4269%2C1111.2597%2C1111.2203%2C1111.4043%2C1111.3412%2C1111.4168%2C1111.5344%2C1111.5691%2C1111.6222%2C1111.5908%2C1111.5648%2C1111.4975%2C1111.0073%2C1111.1798%2C1111.2031%2C1111.2278%2C1111.2424%2C1111.7113%2C1111.0320%2C1111.0411%2C1111.3782%2C1111.2665%2C1111.5292%2C1111.3601%2C1111.5977%2C1111.5172%2C1111.4568%2C1111.0068%2C1111.1679%2C1111.5147%2C1111.4503%2C1111.2460%2C1111.3765%2C1111.6191%2C1111.2826%2C1111.0766&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Photocatalytic water splitting reaction on TiO2 surface is one of the\nfundamental issues that bears significant implication in hydrogen energy\ntechnology and has been extensively studied. However, the existence of the very\nfirst reaction step, the direct photo-dissociation of water, has been\ndisregarded. Here, we provide unambiguously experimental evidence to\ndemonstrate that adsorbed water molecules on reduced rutile TiO2(110)-1\\times1\nsurface can be dissociated under UV irradiation using low temperature scanning\ntunneling microscopy. It is identified that a water molecule at fivefold\ncoordinated Ti (Ti5c) site can be photocatalytically dissociated, resulting in\na hydroxyl at Ti5c and another hydroxyl at bridge oxygen row. Our findings\nreveal a missing link in the photocatalytic water splitting reaction chain,\nwhich greatly contribute to the detailed understanding of underlying mechanism."}, "authors": ["Shijing Tan", "Yongfei Ji", "Yang Wang", "Jin Zhao", "Aidi Zhao", "Bing Wang", "Yi Luo", "Jinlong Yang", "J. G. Hou"], "author_detail": {"name": "J. G. Hou"}, "author": "J. G. Hou", "arxiv_comment": "4 pages main text (including 4 figures, 31 references), 4 pages for\n  supporting materials", "links": [{"href": "http://arxiv.org/abs/1111.3256v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1111.3256v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "physics.chem-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "physics.chem-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1111.3256v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1111.3256v1", "journal_reference": null, "doi": null, "fulltext": "Evidence of Photocatalytic Dissociation of Water on TiO2 with Atomic Resolution\nShijing Tan, Yongfei Ji, Yang Wang, Jin Zhao, Aidi Zhao, Bing Wang*, Yi Luo, Jinlong Yang, and J. G. Hou*\n\nHefei National Laboratory for Physical Sciences at the Microscale, University of Science and Technology of China, Hefei, Anhui 230026,\nP.R. China. *Correspondence should be addressed to these authors: bwang@ustc.edu.cn and jghou@ustc.edu.cn\n\nAbstract: Photocatalytic water splitting reaction on TiO2 surface is one of the fundamental issues that bears significant\nimplication in hydrogen energy technology and has been extensively studied. However, the existence of the very first\nreaction step, the direct photo-dissociation of water, has been disregarded. Here, we provide unambiguously experimental\nevidence to demonstrate that adsorbed water molecules on reduced rutile TiO 2(110)-11 surface can be dissociated under\nUV irradiation using low temperature scanning tunneling microscopy. It is identified that a water molecule at fivefold\ncoordinated Ti (Ti5c) site can be photocatalytically dissociated, resulting in a hydroxyl at Ti5c and another hydroxyl at bridge\noxygen row. Our findings reveal a missing link in the photocatalytic water splitting reaction chain, which greatly contribute\nto the detailed understanding of underlying mechanism.\nThe discovery of photoelectrochemical water splitting\non TiO2 electrode (1) has triggered intensive study on its\nreaction mechanism (2,3), aiming for the increase of its\nefficiency and the design of better photocatalysts. This\nseemingly simple reaction actually consists of complicated\nreaction steps that have not been fully understood. It has\nlong been assumed that the hydroxyls on the TiO2 surface\nplay the key role in the whole reaction chain (4,5). How the\nreactions initiated by the hydroxyls under the light\nirradiation has been the subject of many theoretical and\nexperimental studies over the last decades (6-8). However,\nless attention has been paid to the direct dissociation of\nwater under light irradiation, the very initial step of the\nphotocatalytic reaction. It has been observed that the water\nmolecules adsorbed on bridge-bonded oxygen vacancies\n(BBOV) can dissociate into pairs of hydroxyl groups (OHb)\nresiding on bridge-bonded oxygen (BBO) rows on reduced\nTiO2 (110)-11 surface (9-13). The study of the\nlaser-induced fluorescence (LIF) spectroscopy indicated\nthe existence of another type of hydroxyls, namely OHt\nlocated at the fivefold coordinated Ti (Ti5c) sites (14),\nwhich should be a key intermediate for the successive\nreactions in photocatalytic water splitting (2,7,8), but the\norigin of OHt is not known. To identify the reaction\nprocess that generates such specie requires microscopic\nstudies with atomic resolution, but to the best of our\nknowledge, there is no such attempt has ever been made.\nWe have carried out a comprehensive experimental study\non the direct photocatalytic dissociation of water on TiO2\nsurface to address this important issue. We have chosen a\nsingle crystal rutile TiO2 (110)-11 surface under UHV\nconditions with low temperature scanning tunneling\n\nmicroscopy (STM) to highlight the fundamental physics\nand chemistry involved in the processes. We have found\nthat under UV irradiation, the OHt can indeed be\ngenerated by the photocatalytic dissociation of the\nadsorbed water, which strongly suggest that direct\nphotocatalytic dissociation of water is an important initial\nstep in the whole water splitting reaction chain.\n\nFIG. 1. Adsorption of water molecules and tip-induced\ndissociation on TiO2(110)-11 surface. (A) and (B) Images of\nTiO2(110)-11 before and after in situ H2O adsorption at 80 K.\n(Size: 13.3 11.0 nm2). (C) and (D) Magnified images superposed\nwith structural model of TiO2 surface, showing detailed H2O\nadsorption sites (6.13.6 nm2). Circles: adsorption sites of water\nat Ti5c, rectangles: adsorption sites of water at BBOV. (E) Defined\nspecific Ti5c sites with respect to the BBOV. (F) Distribution of\nwater adsorption at the different sites. (G)-(I) STM images (Size:\n3.93.0 nm2) of the tip-induced water dissociation to produce OHt\nor oxygen adatom under different applied bias voltages. (J)\nSchematic drawings showing structural models of different\nprocesses of the tip-induced water dissociation. Imaging\nconditions: 1.0 V, 10 pA, 80 K.\n\nWe characterized the adsorption behavior of water\nmolecules at 80 K, as shown in Fig. 1 (See detailed\n1\n\n\fexperimental methods in Supporting Online Materials). On\nthe clean TiO2 surface with the BBOV concentration of\nabout 0.1 ML (1 ML = 5.2  1014 cm2) (Fig. 1A), we had\nwater dosed and obtained the water coverage of about 0.02\nML (Fig. 1B, within the same area as in Fig. 1A). It is\nobserved that the adsorbed water molecules are quite\nimmobile at this temperature, showing a different behavior\nfrom those at elevated temperatures (15). The specific\nadsorption sites of water molecules are identified by\nsuperposing the structural model of the surface (Fig. 1C\nand 1D). By counting several thousands of adsorbed water\nmolecules, the distribution of the adsorbed molecules is\nobtained and plotted in Fig. 1F with respect to the defined\nsites in Fig. 1E. Most of the adsorbed water molecules\nappear at the Ti5c sites, and only 8.5% water molecules at\nthe BBOVs. Except for the relative high adsorption\npercentage of water at the BBOVs, the adsorption\ndistribution of water is somewhat similar to the CO\nadsorption (16), which may reflect the electronic nature of\nthe surface (17). It is observed that the adsorbed water\nmolecules at the BBOVs may undergo dissociation into\npairs of OHb after several scanning cycles even at 80 K\n(See Figure S1 in Supporting Online Materials). We\nattribute such dissociation of water at the BBOVs to the\ntip-induced effect at 80 K, as that of the adsorbed\nmolecular oxygen at the BBOVs (18,19).\nWhereas, the adsorbed water molecules at the Ti5c\nsites can be much stable against the tip-induced\ndissociation up to a threshold bias voltage of about 2.4 V,\nas shown in Fig. 1G-1I. It is found that for the water\nmolecules at the Ti5c sites, one of the hydrogen atoms can\nbe removed under the voltage pulse of 2.4 V, leaving a\nnoisy spot at the Ti5c site (the left panel of Fig. 1H and the\nprocess 1 in Fig. 1J). Both of the hydrogen atoms can be\neven cut off under a higher voltage pulse of 2.8 V,\nproducing an O adatom at the Ti5c site (18,19) (the right\npanel of Fig. 1H and the process 2 in Fig. 1J). The noisy\nspot is assigned to hydroxyl at the Ti5c site, OHt, which can\nbe further dissociated to an O adatom (Fig. 1I and the\nprocess 3 in Fig. 1J). These operations are a result of the\ninelastic electron tunneling, similar to what was observed\nbefore for the tip-induced desorption of hydrogen from\nOHb (20). To avoid such tip-induced dissociation, the\nmeasurements presented in the following part were\nperformed at around 1.0 V and 10 pA if not specified.\nFig. 2 shows the direct evidence that the adsorbed\nmolecules at Ti 5c sites can be dissociated under UV\n\nFIG. 2. Photocatalytic dissociation of single water molecules. (A)\nand (B) STM images (Size: 1.92.9 nm2) before and after water\nadsorption. (C) Image after 266 nm UV irradiation for 1 h. (D)\nImage showing the further dissociation of the noisy OHt to an\noxygen adatom at the Ti5c site by applying a voltage pulse of 2.4\nV. (E)-(G) Another set of images (6.36.6 nm2) showing the\nphotocatalytic dissociation of water molecules under 400 nm UV\nirradiation for 1 h. (H)-(J) Line profiles along the lines in (E), (F),\nand (G), respectively. Circles: adsorption sites of water at Ti 5c,\nrectangles: BBOV sites, upward triangles: OHb, downward\ntriangles: OHt. Imaging conditions: 1.0 V and 10 pA, 80 K.\n\nirradiation. In the set of Fig. 2A-2C, it can be seen that one\nof the water molecules disappears from its original Ti5c site\nafter 266 nm UV irradiation, accompanying with the\noccurrence of a less protruded spot at the adjacent oxygen\nof the BBO row and a noisy spot at a nearby Ti5c site (from\nthe original water adsorption site by one lattice distance).\nThe noisy spot resembles well the OHt in Fig. 1H, and the\nspot at the adjacent bridge oxygen behaves as OHb. This\nnicely demonstrates that the water can indeed be\ndissociated into an OHt and a hydrogen atom, while the\nlatter transfers to the adjacent BBO to form OHb. To\nconfirm that the noisy spot corresponds to OHt, we applied\na voltage pulse of 2.4 V on it and obtained an O adatom, as\nexpected in Fig. 2D.\nSimilar results were obtained under irradiation of UV\nlight with different wavelengths. Fig. 2E-2G show another\nset of images under irradiation of 400 nm UV light. It is\nobserved that OHb always presents at the adjacent bridge\noxygen with water dissociation under UV irradiation, as\nshown in Fig. 2G, which differs from the tip-induced water\ndissociation (Fig. 1H and 1I). Two water molecules\n2\n\n\firradiation (21,22). As a comparison, we performed the\nexperiment for co-adsorbed water and methanol under\nUV irradiation (See Figure S3 in Supporting Online\nMaterials), revealing that the dissociation of water is\nmore difficult than that of methanol (23) and ethanol\n(24).\n\ndissociate in the frame of Fig. 2G, but only one OHt can be\nobserved at a Ti5c site away from the original place by\nseveral lattice distance over the BBO rows, implying that\nOHt is quite diffusive, at least under UV irradiation. This\nfinding is consistent with the LIF results (14). The line\nprofiles shown in Fig. 2H-2J give the apparent height of\nthese different species, which have also been further\nconfirmed by the tip manipulation (See Figure S2 in\nSupporting Online Materials).\n\nFIG. 4. Illustration of photocatalytic dissociation of water. (A)\nStructural model of water at a Ti5c site. (B) Proton transfer due to\nthe reaction of the water molecule with the trapped hole. (C)\nDissociation of the adsorbed water molecule into OHb and\ndesorbed OH, or (D) OHb and adsorbed OHt at Ti5c. (E) Energy\ndiagram and relaxation time scales of the photogenerated\nelectron-hole pair (Refs. 8, 25-29) .\n\nFIG. 3. Photodissociation proportion of water at Ti5c versus light\nwavelength for different irradiation times. The vertical error bars\ngive the standard deviation of the data from more than three runs.\nThe horizontal bars for 400 and 440 nm indicate the bandwith of\nthe filters when the mercury-xenon lamp was used. Different light\nsources were used: mercury-xenon lamp for 400 (with bandwidth\n40 nm, 0.1 mW/cm2) and 440 (with bandwidth 20 nm, 0.1\nmW/cm2), Nd:YAG laser for 532, 355, and 266 nm (1~10\nmW/cm2), and excimer laser for 193 nm (1~10 mW/cm2).\n\nOn the basis of our observations, we suggest that the\ninitial reaction step should simply follow photooxidation\nprocess as\nH2O + h+  OH + H+\n(1)\nwhere h+ refers the VB hole. This fits well with the\nsuggestion of Henderson that water photoreduction on\nrutile TiO2(110) does not proceed via electron attachment\nto adsorbed water molecules (2). The mechanism for the\nobserved photodissociation of single water molecules\nunder UV irradiation is schematically illustrated in Fig. 4.\nIt shows that in this reaction the proton transferring from\nthe water molecule to the adjacent bridge oxygen always\nhappens (Fig. 4B) once the trapped hole reacts with the\nadsorbed water molecule, and the produced OH species\nmay either desorb from the surface or adsorb at a certain\nTi5c site (Fig. 4C and 4D). It is known that the\nphoto-generated hole-electron pairs can be quickly relaxed\nto their equilibria (Fig. 4E). The relaxation of deep holes to\nthe VB maximum at the surface is in the time scale of a\nfew ps (2,25,26), while the transfer of the surface trapped\nholes to the adsorbed water molecules is around several s\n(27). In comparison, the relaxation of hot electrons is in the\nscale of several tens to hundred fs (28,29), while the\ntransfer of the trapped electrons to the adsorbed water\nmolecules is in the much longer time scale of several tens\n\nWe also examined the effect of the wavelength and\nthe intensity of lights on the dissociation probability. As\nshown in Fig. 3, the dissociation events can be observed\nonly when the wavelength of light is shorter than 400\nnm, which energy accords well to the band gap 3.1 eV\nof the rutile TiO2. It is noticed that although we do\nobserve the photocatalytic water dissociation, after\ncounting thousands of adsorbed water molecules, we\nonly obtained about 2% and 4% dissociation events for\n1 and 2 h UV irradiation, respectively. It is also difficult\nto observe the dissociation event for short irradiation\ntime less than 30 min. Furthermore, the observed\ndissociation probability is not obviously dependent on\nthe wavelength (400 ~ 193 nm), nor on the light\nintensity (0.1~10 mW/cm2). The independence of\ndissociation probability on the light intensity is\nconsistent with the suggestion that the photocatalytic\nprocesses are limited to a low-intensity of UV\n3\n\n\fto hundreds s (27). Hence, the reaction of the holes with\nthe water molecules should be the dominant factor. This\nmay also explain why the dissociation process is much\ndifficult to take place through the electron attachment. The\nfast relaxation of the holes and the electrons results in the\nobserved independence of UV wavelength on dissociation\nprobability.\nTo conclude, we have provided the direct\nexperimental evidence that water molecules on TiO2\nsurface can be photocatalytically dissociated to form\nhydroxyls. The discovery of this important initial reaction\nstep in the photocatalytic water splitting reaction chain is\nsignificant. It not only contributes greatly to the\nfundamental understanding of the water splitting reaction\non TiO2, but also provides a new strategy for the design of\nbetter systems for efficient water splitting reaction in\ngeneral.\n\n11. I. M. Brookes, C. A. Muryn, G. Thornton, Phys. Rev. Lett. 87,\n266103 (2001).\n12. S. Wendt, J. Matthiesen, R. Schaub, E. K. Vestergaard, E.\nLaegsgaard, F. Besenbacher, B. Hammer, Phys. Rev. Lett. 96,\n066107 (2006).\n13. S. C. Li, Z. Zhang, D. Sheppard, B. D. Kay, J. M. White, Y.\nDu, I. Lyubinetsky, G. Henkelman, Z. Dohnálek, J. Am. Chem.\nSoc. 130, 9080 (2008).\n14. Y. Murakami, E. Kenji, A. Y. Nosaka, Y. Nosaka, J.Phys.\nChem. B 110, 16808 (2006).\n15. J. Matthiesen, J. Ø. Hansen, S. Wendt, E. Lira, R. Schaub, E.\nLaegsgaard, F. Besenbacher, B. Hammer, Phys. Rev. Lett. 102,\n226101 (2009).\n16. Y. Zhao, Z. Wang, X. F. Cui, T. Huang, B. Wang, Y. Luo, J. L.\nYang, J. G. Hou, J. Am. Chem. Soc. 131, 7958 (2009).\n17. T. Minato, Y. Sainoo, Y. Kim, H. S. Kato, K. Aika, M. Kawai,\nJ. Zhao, H. Petek, T. Huang, W. He, B. Wang, Z. Wang, Y.\nZhao, J. L. Yang, J. G. Hou, J. Chem. Phys. 130, 124502\n(2009).\n18. S. J. Tan, Y. F. Ji, Y. Zhao, A. D. Zhao, B. Wang, J. L. Yang, J.\nG. Hou, J. Am. Chem. Soc. 133, 2002 (2011).\n19. P. Scheiber, A. Riss, M. Schmid, P. Varga, U. Diebold, Phys.\nRev. Lett. 105, 216101 (2010).\n20. O. Bikondoa, C. L. Pang, R. Ithnin, C. A. Muryn, H. Onishi,\nG. Thornton, Nat. Mater. 5, 189 (2006).\n21. J. W. Tang, J. R. Durrant, D. R. Klug, J. Am. Chem. Soc. 130,\n13885 (2008).\n22. T. Yoshihara, R. Katoh, A. Furube, Y. Tamaki, M. Murai, K.\nHara, S. Murata, H. Arakawa, M. Tachiya, J. Phys. Chem. B\n108, 3817 (2004).\n23. C. Y. Zhou, Z. F. Ren, S. J. Tan, Z. B. Ma, X. C. Mao, D. X.\nDai, H. J. Fan, X. M. Yang, J. LaRue, R. Cooper, A. M.\nWodtke, Z. Wang, Z. Y. Li, B. Wang, J. L. Yang, J. G. Hou,\nChem. Sci. 1, 575 (2010).\n24. Y. Tamaki, A. Furube, M. Murai, K. Hara, R. Katoh, M.\nTachiya, J. Am. Chem. Soc. 128, 416 (2006).\n25. M. A. Grela, M. A. Brusa, A. J. Colussi, J. Phys. Chem. B 101,\n10986 (1997).\n26. Q. Shen, K. Katayama, T. Sawada, M. Yamaguchi, Y.\nKumagai, T. Toyoda, Chem. Phys. Lett. 419, 464 (2006).\n27. A. Yamakata, T. Ishibashi, H. Onishi, J. Phys. Chem. B 105,\n7258 (2001).\n28. L. Gundlach, R. Ernstorfer, F. Willig, Phys. Rev. B 74, 035324\n(2006).\n29. K. Onda, B. Li, J. Zhao, K. D. Jordan, J. L. Yang, H. Petek,\nScience 308, 1154 (2005).\n\nAcknowledgements: This work was supported by NBRP\n(grants 2011CB921400 and 2010CB923300) and NSFC\n(grants 9021013, 10825415, 10874164, 21003113,\n21121003), China.\nReferences:\n1. A. Fujishima, K. Honda, Nature 238, 37 (1972).\n2. M. A. Henderson, Surf. Sci. Rep. 66, 185 (2011); and\nreferences therein.\n3. U. Diebold, Surf. Sci. Rep. 48, 53 (2003); and references\ntherein.\n4. D. S. Ollis and H. Al-Ekabi, Photocatalytic Purification and\nTreatment of Water and Air (Elsevier, Amsterdam, 1992).\n5. W. Stumm, Chemistry of the Solid-Water Interface\n(Wiley-Interscience, New York, 1992) p. 105.\n6. H. Gerischer, in: Physical chemistry, An Advanced Treatise,\nVol. 9A, edited by H. Eyring (Academic Press, New York,\n1970) p. 463.\n7. P. Salvador, Prog. Surf. Sci. 86, 41 (2011).\n8. A. Imanishi, T. Okamura, N. Ohashi, R. Nakamura, Y.\nNakato, J. Am. Chem. Soc. 129, 11569 (2007).\n9. S. Suzuki, K. Fukui, H. Onishi, Y. Iwasawa, Phys. Rev. Lett.\n84, 2156 (2000).\n10. R. Schaub, R. Thostrup, N. Lopez, E. Laegsgaard, I.\nStensgaard, J. K. Nørskov, F. Besenbacher, Phys. Rev. Lett. 87,\n266104 (2001).\n\n4\n\n\fSupporting Materials\n\nEvidence of Photocatalytic Dissociation of Water on TiO2 with Atomic Resolution\nShijing Tan, Yongfei Ji, Yang Wang, Jin Zhao, Aidi Zhao, Bing Wang*, Yi Luo, Jinlong Yang, and Jianguo Hou*\nHefei National Laboratory for Physical Sciences at the Microscale, University of Science and Technology of China,\nHefei, Anhui 230026, P.R. China (bwang@ustc.edu.cn and jghou@ustc.edu.cn)\n\nMaterials and Methods\nOur STM experiments were conducted with a low temperature scanning tunneling microscope (Matrix, Omicron)\nin an ultra-high vacuum system with a base pressure less than 31011 Torr. The STM measurements were mainly\nperformed at 80 K. An electrochemically etched polycrystalline tungsten tip was used in STM experiments. The rutile\nTiO2 (110) sample (Princeton Scientific Corporation) was prepared by repeated cycles of ion sputtering (3000 eV Ar+)\nand annealing to 900 K with a Ta-foil heater behind the sample. Water (Aldrich, deuterium-depleted, 99.99%) was\npurified by several freeze-pump-thaw cycles using liquid nitrogen. Water was transferred directly to the TiO2 surface\nthrough a dedicated tube in the chamber. The outlet of the tube was only about 5 mm from the TiO 2 surface. This\nmethod can minimize the background water which may possibly cause misleading. During water dosing, the sample\nwas maintained at 80 K. The light irradiation experiments were performed with different wavelengths by using light\nsources of Mercury-xenon lamp (Hammatsu, L2423, with bandpass filters: centered at 400 and 440 nm with\nbandwidths of 40 and 20 nm, respectively, typical intensity: 0.1 mW/cm2), Nd:YAG laser (Spectra-Phyiscs, Pro-250,\nrepetition: 10 Hz, duration: 10 ns, for wavelength of 532, 355, and 266 nm, intensity: 1~10 mW/cm2), and Excimer\nlaser (Coherent Inc., COMPexPro 201, ArF, repetition: 4 Hz, duration: 20 ns, for wavelength of 193 nm, intensity:\n110 mW/cm2). A specially coated sapphire window was used for 193 nm UV light, which allows 90% transmission\nof 193 nm UV light. During light illumination, the tip was retracted back for about 10 μm to prevent from shadowing\neffect. We always compared the areas before and after light irradiation to trace any change of the surface (23).\n1. The different behaviors between the dissociation of water at the BBOV sites and the photocatalytic\ndissociation of water at the Ti5c sites\nWe have compared the behavior of the spontaneous dissociation of water at the BBOV sites with that of\nphotocatalytic dissociation of water at the Ti5c sites at 80 K, as shown in Figure S1. It is observed that the water\nmolecules at the BBOV sites may dissociate before UV irradiation. As shown in the marked rectangle I in Figure S1-B\nand S1-C (and see the corresponding magnified images and line profiles in upper-right panel), one of the water\nmolecules at the BBOV undergo dissociation after consecutive scanning, forming a pair of OHb. At elevated\ntemperatures, water dissociation at the BBOV sites has been widely observed before (12,13,30), which is a\nthermal-driven spontaneous process. At 80 K, such dissociation is more likely to be tip-induced, as that of molecular\noxygen at the BBOV sites (18,19,31).\nUnder UV irradiation, as also shown in the main text, we observed the dissociation of water at the Ti5c sites (Figure\nS1-D and the magnified images and line profiles in the lower-right panel). The photocatalytic dissociation of water\nalways produces a hydroxyl at the adjacent bridge oxygen, due to the product of the hydrogen atom bonding to the\nbridge oxygen, while the OH (may adsorb as OHt, see the description in the main text) diffuses away or even desorbs\n5\n\n\ffrom the surface. It is noticed that the water molecules at the BBOV sites do not show any dissociation priority under\nUV irradiation. Furthermore, the formed OHb pair is not separated under UV irradiation, unlike the thermal-driven\ndiffusion and separation of OHb pair at elevated temperatures (13). This fact also suggests that OHb is not as sensitive\nas OHt under UV irradiation. In a real reaction environment, once a BBOV site is filled with a dissociative water\nmolecule, OHb pair is consequently formed. Less BBOV sites are available, which should result in the reduction of this\nactivity. Such a drawback could be overcome by the direct photocatalytic dissociation of water.\n\nFigure S1: Comparing the dissociation of water at BBOV sites and the photocatalytic dissociation of water at Ti5c sites. (A) STM image\nof clean surface. (B) Image after water dosing. (C) Consecutively acquired image. (D) Image ffter 266nm UV irradiation for 1 hour. Size:\n11.7×7.7 nm2. Imaging conditions: 1.0 V and 10 pA. The magnified images of (A-I) to (C-I) and the corresponding line profiles showing\ndissociation of one water molecule at BBOV to an OHb pair. Size: 4.4×4.8 nm2. The magnified images of (A-II), (C-II), (D-II) and the\ncorresponding line profiles showing that dissociation of two water molecules at Ti5c sites after UV irradiation. Size: 6.5×5.0 nm2.\n\n2. Confirmation of the reaction products from photocatalytic dissociation of water.\nIn Fig. 2G in the main text, we attributed the new spots at BBO as hydroxyls (OHb) and the noisy spot at Ti5c site as\nOHt, the products from the photocatalytic dissociation of water. Here we show further experimental evidence to\nconfirm our assignments. Figure S2-A is the same as Fig.2G in the main text, which shows the changes of the\n6\n\n\fdissociation of two water molecules under UV irradiation. First, a 2.4 V pulse was applied on the OHt, resulted in the\nnoisy OHt changing to O adatom (Oa) by removing the hydrogen atom, as shown in Figure S2-B. Followed, we have\nmade another two pulses of 2.8 V on the OHbs, respectively, removing the hydrogen atoms from both of the OHbs, as\nshown in Figure S2-C. The whole process could confirm our assignments of OHb and OHt affirmatively.\n\nFigure S2: (A) STM image with photocatalyically dissociated products of OHb and OHt (the same image as shown in Fig. 2G in the\nmain text).\n\n(B) Image showing the dissociation of OHt to an oxygen adatom at the Ti5c site by applying a voltage pulse of 2.4 V. (C)\n\nImage showing the dissociation of OHbs by applying a voltage pulse of 2.8 V, respectively. Size: 6.3×6.6 nm2.\n\n3. Comparison the photocatalytic dissociation efficiency between water and methanol.\n\nFigure S3: (A) Dissociation proportion of methanol under 266 nm UV irradiation as a function of irradiation time. (B) Image of clean\nTiO2(110)-1×1 surface. (C) Image after water dosing, and (D) methanol dosing followed within the same area, obtaining a co-adsorbed\nwater and methanol sample. (E) Image after 266 nm UV irradiation for 30 min. White arrows: molecular water; yellow arrows: molecular\nmethanol; green arrows: dissociated methanol. Image size: 7.3×7.2 nm2, 1.0 V and 10 pA, 80 K.\n\nIn our previous work, we reported the photocatalytic dissociation of methanol at Ti5c via O-H bond cleavage and\nthe H transferring to adjacent Ob (23). Figure S3-A shows the dissociation proportions of methanol as the function of\nUV irradiation time. The data are obtained under 266 nm UV irradiation. After irradiation for only 5 min, ~18%\nmethanol molecules are dissociated. The dissociation proportion increases rapidly with the increase of the UV\nirradiation time from 15 to 30 min, going from ~33% to ~90%. We can observe that under UV irradiation for 60 min,\nnearly all the methanol molecules could be dissociated. However, water has low dissociation probabilities, as we\nobserved (Fig. 3 in the main text), only ~2% water dissociates under UV irradiation for 60 min and increased to ~4%\nfor 120 min. These results show that about two orders of magnitude difference of the photocatalytic reaction\nprobability between methanol and water.\nFigure S3-B to S3-E is a set of STM experiment directly illustrates the difference in the dissociation proportion\nbetween methanol and water. We conducted the co-adsorption of water and methanol in the same sample. Figure\n7\n\n\fS3-B is the original clean surface. Figure S3-C shows the image after water dosing, and Figure S3-D shows the\nimage after methanol dosing followed with similar concentration of about 0.02 ML. The methanol molecules are more\nprotruded than the water molecules (Figure S3-D). After 266 nm UV irradiation for 30 min, we can see that all of the\nfive methanol molecules are dissociated (23), but all of the water molecules remain unchanged, as shown in Figure\nS3-E.\n\nReferences\n30.\n\nX. F. Cui, Z. Wang, S. J. Tan, B. Wang, J. L. Yang, J. G. Hou, Identifying Hydroxyls on the TiO2(110)-11 Surface\nwith Scanning Tunneling Microscopy. J. Phys. Chem. C 113, 13204 (2009).\n\n31.\n\nZ.-T. Wang, Y. Du, Z.\n\nohn e , I. Lyubinetsky, Direct Observation of Site-Specific Molecular Chemisorption of O2 on\n\nTiO2(110). J. Phys. Chem. Lett. 1, 3524 (2010).\n\n8\n\n\f"}