{"id": "http://arxiv.org/abs/1010.4289v1", "guidislink": true, "updated": "2010-10-20T19:41:45Z", "updated_parsed": [2010, 10, 20, 19, 41, 45, 2, 293, 0], "published": "2010-10-20T19:41:45Z", "published_parsed": [2010, 10, 20, 19, 41, 45, 2, 293, 0], "title": "Differential Conductance Measurements of MgB2-Based Josephson Junctions\n  Below 1 Kelvin", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1010.1002%2C1010.0313%2C1010.4903%2C1010.5705%2C1010.3832%2C1010.0203%2C1010.3159%2C1010.3489%2C1010.2044%2C1010.3592%2C1010.3081%2C1010.0791%2C1010.2470%2C1010.4106%2C1010.3079%2C1010.1884%2C1010.0338%2C1010.3487%2C1010.5642%2C1010.5222%2C1010.5981%2C1010.3252%2C1010.1780%2C1010.1736%2C1010.2849%2C1010.1137%2C1010.5929%2C1010.4015%2C1010.1646%2C1010.2672%2C1010.5069%2C1010.5937%2C1010.0354%2C1010.5545%2C1010.4131%2C1010.0974%2C1010.4169%2C1010.2466%2C1010.5463%2C1010.4024%2C1010.4217%2C1010.0123%2C1010.5424%2C1010.3613%2C1010.4508%2C1010.1860%2C1010.1998%2C1010.0837%2C1010.1334%2C1010.3213%2C1010.5073%2C1010.1529%2C1010.2733%2C1010.0379%2C1010.2289%2C1010.2272%2C1010.5695%2C1010.0230%2C1010.5048%2C1010.4801%2C1010.5178%2C1010.3867%2C1010.1664%2C1010.2898%2C1010.0452%2C1010.4400%2C1010.4289%2C1010.2519%2C1010.4845%2C1010.2296%2C1010.2553%2C1010.2674%2C1010.3191%2C1010.1000%2C1010.3341%2C1010.4791%2C1010.0800%2C1010.5930%2C1010.3352%2C1010.1008%2C1010.2226%2C1010.4848%2C1010.3143%2C1010.0851%2C1010.0421%2C1010.0699%2C1010.4778%2C1010.3875%2C1010.3106%2C1010.0246%2C1010.1503%2C1010.3048%2C1010.0001%2C1010.0400%2C1010.1672%2C1010.4658%2C1010.1685%2C1010.4961%2C1010.3234%2C1010.6214%2C1010.4026&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Differential Conductance Measurements of MgB2-Based Josephson Junctions\n  Below 1 Kelvin"}, "summary": "Magnesium diboride has many intriguing characteristics, including its\nrelatively high critical temperature and two-band nature. Most prior studies of\nMgB2 thin film Josephson junctions have been conducted above 2 Kelvin. We\nreport results of sub-1 Kelvin experiments of MgB2/insulator/Pb junctions whose\na-b plane is exposed for electron tunneling. By measuring differential\nconductance at low temperature, new details in the structure of the sigma- and\npi-band gaps are observed in this data, consistent with theoretical\npredictions.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1010.1002%2C1010.0313%2C1010.4903%2C1010.5705%2C1010.3832%2C1010.0203%2C1010.3159%2C1010.3489%2C1010.2044%2C1010.3592%2C1010.3081%2C1010.0791%2C1010.2470%2C1010.4106%2C1010.3079%2C1010.1884%2C1010.0338%2C1010.3487%2C1010.5642%2C1010.5222%2C1010.5981%2C1010.3252%2C1010.1780%2C1010.1736%2C1010.2849%2C1010.1137%2C1010.5929%2C1010.4015%2C1010.1646%2C1010.2672%2C1010.5069%2C1010.5937%2C1010.0354%2C1010.5545%2C1010.4131%2C1010.0974%2C1010.4169%2C1010.2466%2C1010.5463%2C1010.4024%2C1010.4217%2C1010.0123%2C1010.5424%2C1010.3613%2C1010.4508%2C1010.1860%2C1010.1998%2C1010.0837%2C1010.1334%2C1010.3213%2C1010.5073%2C1010.1529%2C1010.2733%2C1010.0379%2C1010.2289%2C1010.2272%2C1010.5695%2C1010.0230%2C1010.5048%2C1010.4801%2C1010.5178%2C1010.3867%2C1010.1664%2C1010.2898%2C1010.0452%2C1010.4400%2C1010.4289%2C1010.2519%2C1010.4845%2C1010.2296%2C1010.2553%2C1010.2674%2C1010.3191%2C1010.1000%2C1010.3341%2C1010.4791%2C1010.0800%2C1010.5930%2C1010.3352%2C1010.1008%2C1010.2226%2C1010.4848%2C1010.3143%2C1010.0851%2C1010.0421%2C1010.0699%2C1010.4778%2C1010.3875%2C1010.3106%2C1010.0246%2C1010.1503%2C1010.3048%2C1010.0001%2C1010.0400%2C1010.1672%2C1010.4658%2C1010.1685%2C1010.4961%2C1010.3234%2C1010.6214%2C1010.4026&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Magnesium diboride has many intriguing characteristics, including its\nrelatively high critical temperature and two-band nature. Most prior studies of\nMgB2 thin film Josephson junctions have been conducted above 2 Kelvin. We\nreport results of sub-1 Kelvin experiments of MgB2/insulator/Pb junctions whose\na-b plane is exposed for electron tunneling. By measuring differential\nconductance at low temperature, new details in the structure of the sigma- and\npi-band gaps are observed in this data, consistent with theoretical\npredictions."}, "authors": ["Steve Carabello", "Joseph Lambert", "Jerome Mlack", "Roberto Ramos"], "author_detail": {"name": "Roberto Ramos"}, "author": "Roberto Ramos", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1109/TASC.2010.2089669", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1010.4289v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1010.4289v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "ASC 2010 Conference", "arxiv_primary_category": {"term": "cond-mat.supr-con", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.supr-con", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1010.4289v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1010.4289v1", "journal_reference": null, "doi": "10.1109/TASC.2010.2089669", "fulltext": "3MP1B-07\n\n1\n\nDifferential Conductance Measurements\nof MgB2-Based Josephson Junctions\nBelow 1 Kelvin\nSteve Carabello, Joseph Lambert, Jerome Mlack, and Roberto Ramos\n\nAbstract-Magnesium diboride has many intriguing\ncharacteristics,\nincluding\nits\nrelatively\nhigh\ncritical\ntemperature and two-band nature. Most prior studies of MgB2\nthin film Josephson junctions have been conducted\nabove 2 Kelvin. We report results of sub-1 Kelvin experiments of\nMgB2/insulator/Pb junctions whose a-b plane is exposed\nfor electron tunneling. By measuring differential conductance at\nlow temperature, new details in the structure of the\nsigma- and pi-band gaps are observed in this data, consistent\nwith theoretical predictions.\n\nReference [9] suggests, among other objections, that this\n\"distribution of gaps within the σ and the π sheets\" should not\nbe observable in real samples, due to the need for\nunreasonably small scattering rates. However, very high\nquality thin films have been found to meet or exceed the purity\nof single crystals [10, 11].\nIndeed, recent tunneling\nspectroscopy experiments incorporating such films at\ntemperatures from 7.0 to 1.8K have exhibited energy gap\nsubstructures consistent with these theoretical predictions [12].\n\nIndex Terms-Josephson junctions, Magnesium diboride,\nSuperconducting films.\n\nI. INTRODUCTION\n\nS\n\nOON after the discovery of superconductivity in MgB2,\nthe existence of two superconducting energy gaps was\nclearly shown by a wide variety of techniques, including\nangle-resolved photoemission spectroscopy (ARPES), specific\nheat, point-contact spectroscopy, Raman spectroscopy,\nphotoemission spectroscopy, and scanning tunneling\nspectroscopy [1]. These two distinct gaps result from different\npairing strengths between phonon modes and the σ bonds\nlocalized in the boron planes (which have a strong coupling)\nand the π bonds perpendicular to the planes (which have a\nweak coupling) [2].\nA variety of calculations have used the electron-phonon\ncoupling to derive the values of these energy gaps from first\nprinciples [2-8].\nIn the analysis by Choi et. al. [2,4], the\nEliashberg equation was solved in the clean limit, taking into\naccount the fully anisotropic electron-phonon interaction and\nthe anharmonicity of the phonons. This analysis resulted in a\ngood prediction of the critical temperature, as well as clear\nevidence of two energy gaps. The resulting density of states\nas a function of energy gap at 4K is given in Fig. 1 [2]. As\nexpected, those modes associated with the σ bonds give rise to\nstrong Cooper pairs with a large energy gap (between 6.4 and\n7.2 meV), while those associated with the π bonds give rise to\na separate, smaller energy gap (between 1.2 and 3.7 meV).\nOf particular interest is the substructure evident within each\nof these two peaks, which have generated some controversy.\nManuscript received 3 August 2010. This work was supported in part by a\ngrant in aid by Sigma Xi, for S. Carabello.\nS. Carabello, J. Lambert, J. Mlack and R. Ramos are with the Department\nof Physics, Drexel University, Philadelphia, PA 19104 USA (S. Carabello:\nphone: 215-895-1759; e-mail: sac69@drexel.edu).\n\nFig. 1. Theoretical predictions of substructure in the energy gaps of MgB 2 [2].\nρ(Δ) represents the density of states as a function of energy gap, calculated by\nintegrating the \"local gap distribution\" (introduced in [2, 4]).\n\nWe have explored the superconducting energy gaps of\nMgB2 using electron tunneling spectroscopy of Josephson\njunctions below 1K. The differential conductance curve of a\ntunnel junction has a peak at the sum of the energy gap values\nof the two leads (Δ1+ Δ2)/e, and so provides a direct measure\nof the energy gap [13]. The MgB2/native oxide/Pb tunnel\njunction used in this study incorporates a high purity MgB 2\nthin film grown by hybrid physical-chemical vapor deposition\n(HPCVD) on a single crystal 6H-SiC substrate [14]. As this\nfilm formed, the c axis of the MgB2 was tilted away from film\nnormal, exposing the a-b plane for tunneling. As a result,\ntunneling occurred both along the c-axis, and along the boron\nplanes, providing access to both the σ and the π gaps [14].\nII. OUR EXPERIMENT\nThe experiments were performed in a helium dilution\nrefrigerator with a base temperature of 20 mK. Current and\nvoltage lines were filtered using thermocoax cables and LC\nfilters encased in copper powder matrix. All leads were\nthermally grounded at the 1K pot, still, and mixing chamber.\nThe key data for this experiment are derived by gathering\ncurrent vs. voltage (I-V) curves. The current bias for our\n\n\f3MP1B-07\n\n2\n\njunction was provided by an Agilent 3220A function\ngenerator, swept at 50mHz, passing through a bias resistor.\nThe voltage across the junction was amplified, then recorded\nat a sampling rate of 10kHz by a NI 9215 16-bit data\nacquisition card.\nFrom the I-V curves thus gathered,\ndifferential conductance (dI/dV) was derived numerically.\nIII. NOISE REDUCTION: AVERAGING TECHNIQUES\nDespite the extensive filtering, low-frequency noise\nremained in our data. Given the extremely high density of\npoints due to the high sample rate, even tiny fluctuations in the\nsignal were translated into large discrepancies in the dI/dV-V\ncurve. As a result, a series of averaging steps was necessary\nto produce useful results.\n\nFig. 4. The same data as in Fig. 3, after performing a running average over 20\ndata points. The periodic structures are evidence of 60 Hz noise.\n\nFig. 5. The same data as in Fig. 3, after performing a running average over\n167 data points. The 60 Hz noise has been nearly eliminated.\nFig. 2. Raw I-V data for a single sweep (from high current to low current) of\nour MgB2/I/Pb junction. Changes in slope corresponding to both the σ and π\nbands are clearly visible, as is the hysteretic nature of our junction below 1K.\n\nFig. 2 shows a typical I-V curve of a single sweep (from\nhigh current to low current) in this experiment. Hysteretic\nbehavior is clearly visible, as are the changes in slope\ncorresponding to the π and σ energy gaps. On this scale, the\ncurve appears quite clean, with little evidence of noise.\n\nAs a final step prior to finding a conductance curve, we\nbinned this averaged I-V data into separate data points\napproximately 0.03mV apart.\nThis allows us to take\nadvantage of multiple sweeps through the I-V curve, thereby\ncausing each data point in our results (Fig. 6) to be the result\nof averaging thousands of raw data points. This final\naveraging also serves to provide additional noise suppression.\nIt is important to note, however, that all of the main features in\nthe conductance curves persist while using a wide variety of\naveraging techniques, and are even apparent (though with less\nclarity) with little averaging at all.\nIV. OUR RESULTS\n\nFig. 3. A small segment of the raw I-V data for a single sweep of our\nMgB2/I/Pb junction. Note the discrete nature of this digital data.\n\nZooming in, one can see the discrete nature of this digital\ndata (Fig. 3). As a result, the raw data points cannot form\nuseful conductance curves directly. If these points were\nrandomly distributed, then averaging even a small number\nwould produce a smoother curve. Fig. 4 shows the same data\nafter computing a running average of 20 data points. Periodic\nstructures, with a period of 167 data points (corresponding to a\nfrequency of 60 Hz) are clearly evident. So, all data used for\ncomputing conductance curves were first averaged over 167\ndata points, to minimize the effect of this spurious noise. (See\nFig. 5.)\n\nFig. 6. Differential conductance curve at T=350mK. As anticipated by the\ntheory of Choi et al. [2], evidence is seen for substructure within each energy\ngap. Additionally, the number of features, and their approximate voltages,\ncorrelate well with theory.\n\nThe resulting differential conductance curves exhibit\nfeatures very similar to theory; Fig. 6 shows the right branch\n\n\f3MP1B-07\n\n3\n\nof such a curve, using data gathered at T=350mK.\nCorresponding to theory, there are several prominent features;\neach peak corresponds to (ΔMgB + ΔPb)/e, with ΔPb = 1.376\nmeV at the temperatures of our experiment.\nThese results, and those on a similar thin film device\nmeasured from 7.0-1.8K [12], are the first to clearly illustrate\nthe substructure within each of the energy gaps of MgB2 in\nthis way. In contrast to the theory (Fig. 1), the π peak is taller\nthan the σ peak. This result is expected, since the Pb\nelectrodes of our junction had a large percentage of its contact\nwith the c axis, and less along the a-b plane.\nThe tallest point on the differential conductance curve\n(corresponding to the π peak), occurs at a voltage of 3.2 mV.\nSubtracting ΔPb, we find an energy gap value of 1.8 meV. The\nhighest voltage energy gap peak (corresponding to the σ peak),\noccurs at a voltage of 9.3 mV. Again subtracting ΔPb, we get\nan energy gap value of 7.9 meV. These results are reasonably\nconsistent with theory. One less prominent peak to the right\nof the main π peak, and substructure to the left of the σ peak,\nare also consistent with theory.\n\nbased junctions, and many important suggestions and useful\ninsights.\nREFERENCES\n[1]\n[2]\n[3]\n\n[4]\n[5]\n\n[6]\n[7]\n\nV. CONCLUSION\nWe have observed substructure in the energy gaps of MgB 2\nusing MgB2/I/Pb Josephson junctions, via differential\nconductance measurements. These results are consistent with\ntheoretical predictions using the anisotropic Eliashberg\nformalism, and were made possible due to the low scattering\nrates in high-quality MgB2 thin films. By displaying such fine\ndetails, our data helps to illustrate the importance of the\nanharmonicity of the phonon modes in MgB 2 in making\ntheoretical predictions.\n\nACKNOWLEDGMENT\nWe thank X. X. Xi and Ke Chen (Temple University,\nPhiladelphia, PA USA) for providing high-quality MgB2-\n\n[8]\n[9]\n\n[10]\n[11]\n[12]\n\n[13]\n[14]\n\nX. X. Xi, \"Two-band superconductor magnesium diboride,\" Rep. Prog.\nPhys. 71, 116501, 2008.\nH.J. Choi, D. Roundy, H. Sun, M.L. Cohen, and S.G. Louie, \"The origin\nof the anomalous superconducting properties of MgB2,\" Nature 418,\n758, 2002.\nA. Floris, G. Profeta, N. N. Lathiotakis, M. Lüders, M.A.L. Marques, C.\nFranchini, E.K.U. Gross, A. Continenza, and S. Massidda,\n\"Superconducting properties of MgB2 from First Principles,\" PRL 94,\n037004, 2005.\nH. J. Choi, D. Roundy, H. Sung, M. L. Cohen, S.G. Louie, \"Firstprinciples calculation of the superconducting transition in MgB2 within\nthe anisotropic Eliashberg formalism,\" PRB 66, 020513(R), 2002.\nA. Floris, G. Profeta, N. N. Lathiotakis, M. Lüders, M.A.L. Marques, C.\nFranchini, E.K.U. Gross, A. Continenza, and S. Massidda,\n\"Superconducting properties of MgB2 from First Principles,\" PRL 94,\n037004, 2005.\nA.Y. Liu, I.I. Mazin, J. Kortus, \"Beyond Eliashberg Superconductivity\nin MgB2: Anharmonicity, Two-Phonon Scattering, and Multiple Gaps,\"\nPhys. Rev. Lett. 87, 2001.\nY. Kong, O.V. Dolgov, O. Jepsen, O.K. Andersen, \"Electron-phonon\ninteraction in the normal and superconducting states of MgB2\", PRB 64,\n020501, 2001.\nK.-P. Bohnen, R. Heid, B. Renker, \"Phonon Dispersion and ElectronPhonon Coupling in MgB2 and AlB2\", PRL. 86 5771, 2001.\nI.I. Mazin, O.K. Andersen, O. Jepsen, A.A. Golubov, O.V.Dolgov, and\nJ. Kortus, \"Comment on „First-principles calculation of the\nsuperconducting transition in MgB2 within the anisotropic Eliashberg\nformalism,‟\" PRB 69, 056501, 2004.\nXi, X. X. et al. \"MgB2 thin films by hybrid physical-chemical vapor\ndeposition,\" Physica C 456, 22-37, 2007.\nZeng, X. H. et al. \"In situ epitaxial MgB2 thin films for superconducting\nelectronics,\" Nature Mater. 1, 35, 2002.\nK. Chen, W. Dai, C.G. Zhuang, Q. Li, S. Carabello, J.G. Lambert, J.\nMlack, R. Ramos, X. Xi, \"Momentum-dependent multiple gaps of\nMgB2 probed by electron tunneling spectroscopy of MgB2/native\noxide/Pb junctions,\" Nature Physics, submitted for publication.\nM. Tinkham, Introduction to Superconductivity, Second Edition, 1996.\nK. Chen, Y. Cui, Q. Li, C.G. Zhuang, Z.-K. Liu, and X.X. Xi, \"Study of\nMgB2/I/Pb tunnel junctions on MgO (211) substrates,\" APL 93, 012502,\n2008.\n\n\f"}