{"id": "http://arxiv.org/abs/1008.2956v2", "guidislink": true, "updated": "2010-08-25T10:24:42Z", "updated_parsed": [2010, 8, 25, 10, 24, 42, 2, 237, 0], "published": "2010-08-17T20:00:01Z", "published_parsed": [2010, 8, 17, 20, 0, 1, 1, 229, 0], "title": "Running Kinetic Inflation", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1008.3592%2C1008.4029%2C1008.4301%2C1008.0460%2C1008.5023%2C1008.0166%2C1008.4215%2C1008.0085%2C1008.1332%2C1008.1973%2C1008.0411%2C1008.3365%2C1008.1942%2C1008.4055%2C1008.1357%2C1008.4613%2C1008.0666%2C1008.0529%2C1008.2955%2C1008.1401%2C1008.5374%2C1008.3078%2C1008.2005%2C1008.4293%2C1008.2784%2C1008.0751%2C1008.1617%2C1008.0983%2C1008.2189%2C1008.0826%2C1008.2984%2C1008.3701%2C1008.0119%2C1008.3509%2C1008.3038%2C1008.1463%2C1008.0165%2C1008.1804%2C1008.2006%2C1008.4035%2C1008.1935%2C1008.0156%2C1008.2828%2C1008.3025%2C1008.5165%2C1008.2714%2C1008.1406%2C1008.1656%2C1008.1408%2C1008.1963%2C1008.2508%2C1008.0228%2C1008.1866%2C1008.1108%2C1008.1225%2C1008.4648%2C1008.3007%2C1008.4602%2C1008.5217%2C1008.3805%2C1008.2445%2C1008.1224%2C1008.2749%2C1008.4999%2C1008.0422%2C1008.3997%2C1008.0226%2C1008.3777%2C1008.5129%2C1008.2956%2C1008.4851%2C1008.1339%2C1008.4812%2C1008.1928%2C1008.5264%2C1008.4093%2C1008.3013%2C1008.0017%2C1008.4404%2C1008.4704%2C1008.1356%2C1008.1609%2C1008.1484%2C1008.0730%2C1008.1534%2C1008.0052%2C1008.0977%2C1008.4146%2C1008.0408%2C1008.3483%2C1008.2400%2C1008.3297%2C1008.2218%2C1008.0724%2C1008.1781%2C1008.3834%2C1008.4777%2C1008.1292%2C1008.1492%2C1008.3938%2C1008.2019&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Running Kinetic Inflation"}, "summary": "We study a recently proposed running kinetic inflation model in which the\ninflaton potential becomes flat due to rapid growth of the kinetic term at\nlarge inflaton field values. As concrete examples, we build a variety of\nchaotic inflation models in supergravity with e.g. quadratic, linear, and\nfractional-power potentials. The power of the potential generically increases\nafter inflation, and the inflaton is often massless at the potential minimum in\nthe supersymmetric limit, which leads to many interesting phenomena. First, the\nlight inflaton mass greatly relaxes severe thermal and non-thermal gravitino\nproblems. Secondly, the kination epoch is naturally present after inflation,\nwhich may enhance the gravity waves. Thirdly, since the inflaton is light, it\nis likely coupled to the Higgs sector for successful reheating. The inflaton\nand its superpartner, inflatino, may be produced at the LHC. Interestingly, the\ninflatino can be dark matter, if it is the lightest supersymmetric particle.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1008.3592%2C1008.4029%2C1008.4301%2C1008.0460%2C1008.5023%2C1008.0166%2C1008.4215%2C1008.0085%2C1008.1332%2C1008.1973%2C1008.0411%2C1008.3365%2C1008.1942%2C1008.4055%2C1008.1357%2C1008.4613%2C1008.0666%2C1008.0529%2C1008.2955%2C1008.1401%2C1008.5374%2C1008.3078%2C1008.2005%2C1008.4293%2C1008.2784%2C1008.0751%2C1008.1617%2C1008.0983%2C1008.2189%2C1008.0826%2C1008.2984%2C1008.3701%2C1008.0119%2C1008.3509%2C1008.3038%2C1008.1463%2C1008.0165%2C1008.1804%2C1008.2006%2C1008.4035%2C1008.1935%2C1008.0156%2C1008.2828%2C1008.3025%2C1008.5165%2C1008.2714%2C1008.1406%2C1008.1656%2C1008.1408%2C1008.1963%2C1008.2508%2C1008.0228%2C1008.1866%2C1008.1108%2C1008.1225%2C1008.4648%2C1008.3007%2C1008.4602%2C1008.5217%2C1008.3805%2C1008.2445%2C1008.1224%2C1008.2749%2C1008.4999%2C1008.0422%2C1008.3997%2C1008.0226%2C1008.3777%2C1008.5129%2C1008.2956%2C1008.4851%2C1008.1339%2C1008.4812%2C1008.1928%2C1008.5264%2C1008.4093%2C1008.3013%2C1008.0017%2C1008.4404%2C1008.4704%2C1008.1356%2C1008.1609%2C1008.1484%2C1008.0730%2C1008.1534%2C1008.0052%2C1008.0977%2C1008.4146%2C1008.0408%2C1008.3483%2C1008.2400%2C1008.3297%2C1008.2218%2C1008.0724%2C1008.1781%2C1008.3834%2C1008.4777%2C1008.1292%2C1008.1492%2C1008.3938%2C1008.2019&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We study a recently proposed running kinetic inflation model in which the\ninflaton potential becomes flat due to rapid growth of the kinetic term at\nlarge inflaton field values. As concrete examples, we build a variety of\nchaotic inflation models in supergravity with e.g. quadratic, linear, and\nfractional-power potentials. The power of the potential generically increases\nafter inflation, and the inflaton is often massless at the potential minimum in\nthe supersymmetric limit, which leads to many interesting phenomena. First, the\nlight inflaton mass greatly relaxes severe thermal and non-thermal gravitino\nproblems. Secondly, the kination epoch is naturally present after inflation,\nwhich may enhance the gravity waves. Thirdly, since the inflaton is light, it\nis likely coupled to the Higgs sector for successful reheating. The inflaton\nand its superpartner, inflatino, may be produced at the LHC. Interestingly, the\ninflatino can be dark matter, if it is the lightest supersymmetric particle."}, "authors": ["Kazunori Nakayama", "Fuminobu Takahashi"], "author_detail": {"name": "Fuminobu Takahashi"}, "author": "Fuminobu Takahashi", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1088/1475-7516/2010/11/009", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1008.2956v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1008.2956v2", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "30 pages, 7 figures. v2: references added", "arxiv_primary_category": {"term": "hep-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "hep-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "astro-ph.CO", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "hep-th", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1008.2956v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1008.2956v2", "journal_reference": "JCAP 1011:009,2010", "doi": "10.1088/1475-7516/2010/11/009", "fulltext": "IPMU-10-0138\nKEK-TH-1391\n\nRunning Kinetic Inflation\nKazunori Nakayama(a) and Fuminobu Takahashi(b)\n(a)\n\nTheory Center, KEK, 1-1 Oho, Tsukuba, Ibaraki 305-0801, Japan\n(b)\n\nInstitute for the Physics and Mathematics of the Universe,\n\narXiv:1008.2956v2 [hep-ph] 25 Aug 2010\n\nUniversity of Tokyo, Chiba 277-8583, Japan\n(Dated: August 26, 2010)\n\nAbstract\nWe study a recently proposed running kinetic inflation model in which the inflaton potential\nbecomes flat due to rapid growth of the kinetic term at large inflaton field values. As concrete\nexamples, we build a variety of chaotic inflation models in supergravity with e.g. quadratic, linear,\nand fractional-power potentials. The power of the potential generically increases after inflation, and\nthe inflaton is often massless at the potential minimum in the supersymmetric limit, which leads\nto many interesting phenomena. First, the light inflaton mass greatly relaxes severe thermal and\nnon-thermal gravitino problems. Secondly, the kination epoch is naturally present after inflation,\nwhich may enhance the gravity waves. Thirdly, since the inflaton is light, it is likely coupled to the\nHiggs sector for successful reheating. The inflaton and its superpartner, inflatino, may be produced\nat the LHC. Interestingly, the inflatino can be dark matter, if it is the lightest supersymmetric\nparticle.\n\n1\n\n\fI.\n\nINTRODUCTION\n\nThe inflation solves theoretical problems of the standard big bang cosmology, and moreover, quantum fluctuations of an inflaton generate tiny density perturbations, which can\naccount for the seed of the structure in the current Universe. The recent WMAP results [1]\nhave given strong support to the inflationary paradigm, and the Planck satellite [2] will\nnarrow down the inflation models in coming years.\nWhile there have been proposed many models, it is a non-trivial task to construct a\nsuccessful inflation model, partly because inflaton properties are poorly understood. It is\ncustomary to assume that, in the simple slow-roll inflation paradigm, an inflaton is a weakly\ncoupled field and therefore its kinetic term does not significantly change during and after\ninflation. The flat potential necessary for the inflation to occur can be realized by symmetry.\nAlternatively, without a symmetry, the slow-roll inflation may be attained by fine-tuning\nthe shape of the potential and/or the initial position of the inflaton. Also there are a variety\nof inflation models which do not come under this classification [3–5].\nRecently, a new class of inflation models was proposed by one of the authors (FT) [6], in\nwhich the kinetic term grows as the inflaton field, making the effective potential flat. This\nmodel naturally fits with a high-scale inflation model such as chaotic inflation [7], in which\nthe inflaton moves over a Planck scale or even larger within the last 50 e-foldings [8]. This is\nbecause the precise form of the kinetic term may well change after the inflaton travels such\na long distance. In some cases, the change could be so rapid, that it significantly affects the\ninflaton dynamics. We call such model as running kinetic inflation. Interestingly, the power\nof the inflaton potential generically changes in this class of inflation models. For instance, we\ncan build a model that generates a quadratic potential for the inflaton during inflation and\na quartic one after inflation. Such behavior of the scalar potential has various cosmological\nimplications.\nIn this paper we explore phenomenological aspects of the running kinetic inflation model.\nIn most cases the inflaton has a mass of order of the gravitino mass, which makes it easy to\navoid the thermal [9, 10] and non-thermal [11, 12] gravitino problems. This is because the\nreheating temperature tends to be low and because the non-thermal gravitino production\ncan be kinematically suppressed. We also estimate the amplitudes of the primordial gravity\nwaves, which may be enhanced due to a possible kination epoch after inflation, and we discuss\n2\n\n\fhow the reheating proceeds. As we will see later, it is likely that the inflaton is coupled to\nthe Higgs sector for successful reheating, and then the inflatino becomes a natural candidate\nfor dark matter, and can be produced at the LHC.\nLet us briefly mention differences from works in the past. While our model is motivated\nby a simple idea that the kinetic term may well change its form in the large-scale inflation\nsuch as the chaotic inflation, there are stringy inflation models that exhibit the similar\nbehavior of the kinetic term [13, 14]. As far as the inflaton dynamics is concerned, there is no\nsignificant difference if the potential takes the same form. However, since our model is based\non supergravity, we can unequivocally discuss the supersymmetry (SUSY) breaking effects,\nthermal and non-thermal gravitino problems, and reheating the standard model (SM) sector.\nIn particular, the last point enables us to discuss the possibility of the inflatino to become\ndark matter. There are references (e.g. Refs. [15–17]) which studied the enhancement of\nthe primordial gravity waves due to a kination epoch after inflation.1 However, the kination\nis usually realized by introducing an additional degrees of freedom with an appropriate\nproperty (such as quintessence) or assuming a fine-tuned scalar potential for the inflaton.\nIn contrast, the kination is, in a sense, built-in to the running kinetic inflation, because\nthe power of the potential generically increases after inflation. Besides, a light inflaton\nand its coupling to the Higgs sector has been considered in e.g. Refs. [18, 19] assuming\nthe λφ4 inflation, which is however disfavored by the WMAP data. To avoid a tension\nwith observation, it is often assumed that the inflaton has a non-minimal coupling to the\ngravity [20–24] (see also Refs. [25–29] for the inflation with non-minimal coupling to gravity\nin supergravity). This however entails a large coupling, which calls for explanation.2 This\nidea attracted much attention recently since the proposal of the SM Higgs inflation [31],\nand the issue of unitarity has been discussed in Refs. [32–35]. On the other hand, it is\npossible in our model to realize a situation that the scalar potential during inflation is given\nby a quadratic potential which is consistent with observation, while it becomes a quartic\none after inflation, without introducing a large non-minimal coupling to gravity. Moreover,\nas we will see below, the inflaton is assumed to respect a discrete Zk symmetry, which can\n1\n2\n\nIn our context, the kination epoch is such that the inflaton energy decreases faster than radiation.\nIt is difficult to quantify the amount of tuning until we understand how a small or large coupling arises,\nthough. For instance, an extremely small coupling ∼ 10−13 in the quartic chaotic inflation can arise from\na coupling of O(10−7 ) in the superpotential [30].\n\n3\n\n\fbe identified with the one often introduced to solve the μ-problem in the extension of the\nminimal supersymmetric standard model (MSSM). Thus, it is natural also from a symmetry\npoint of view to expect a coupling to the Higgs sector in our model.\nThe rest of the paper is organized as follows. In Sec. II, we study in detail the running\nkinetic inflation model such as the inflaton dynamics, the mass spectrum, and the reheating\nprocesses. In Sec. III, we estimate how much the gravity waves can be enhanced by the\nkination epoch after inflation. In Sec. IV we briefly point out that our running kinetic\ninflation naturally fits the so called the nearly minimal SUSY SM (nMSSM). The last section\nis devoted to conclusions.\n\nII.\n\nRUNNING KINETIC INFLATION\nA.\n\nBasic idea\n\nBefore going to a realistic inflation model, let us first give our basic idea. Suppose that\na real scalar field φ has the following Lagrangian,\nL =\n\n1\nf (φ) ∂ μ φ∂μ φ − V (φ),\n2\n\n(1)\n\nwhere the scalar φ is an inflaton. We assume that it is canonically normalized at the potential\nminimum:\nf (φmin ) = 1.\n\n(2)\n\nThis does not necessarily mean that f (φ) remains close to 1 during inflation, especially if\nthe inflaton moves over some large scale, e.g., the GUT or Planck scale. Suppose that the\nbehavior of f (φ) can be approximated by f (φ) ≈ φ2n−2 with an integer n over a certain\n\nrange of φ . Here and in what follows we adopt the Planck unit, MP ≃ 2.4 × 1018 GeV = 1,\nunless otherwise stated. Then, the scalar potential V (φ) would take a different form, when\nexpressed in terms of the canonically normalized inflaton field, φ̂ ≡ φn /n. For instance, let\n\nus consider a case of n = 2. Then the quadratic (quartic) potential, V (φ) ∝ φ2 (φ4 ), becomes\n\na linear (quadratic) term V (φ̂) ∝ φ̂(φ̂2 ). Thus, such a strong dependence of the kinetic term\non the inflaton field changes the inflation dynamics dramatically.\nLet us consider another example,\nf (φ) = κ + φ2\n4\n\n(3)\n\n\fwith 0 < κ ≪ 1. For φ &\n\n√\n\nκ, we can approximate f (φ) ≈ φ2 , and this model is reduced to\n\nthe case of n = 2 in the previous example. On the other hand, the canonically normalized\n√\n√\nfield is given by φ̂ ≈ κφ for φ ≪ κ. Such behavior of the kinetic term results in the\n√\ntransition of the scalar potential at φ ≈ κ. For instance, a mass term becomes a linear\n√\n√\npotential for φ & κ, and a quadratic term for φ . κ:\n\n m2 φ̂\nfor φ̂ ≫ κ\n1 2 2\n2\nV (φ) = m φ =⇒ V (φ̂) ≃\n(4)\nm\n\n2\nφ̂2\nfor φ̂ ≪ κ\n2κ\n\nThus we can easily realize a linear potential and the transition to a quadratic term, starting\nfrom a mass term and a relatively simple kinetic term (3).\n\nIn principle, if we write the Lagrangian in terms of a canonically normalized field from\nthe beginning, we can build a model that exhibits the same dynamics. However, it would\nthen be unclear why the potential takes such a peculiar form, and it would be non-trivial\nto construct a model like (4). This is because higher order terms usually become important\nat larger field values, and therefore, one expects that the linear term could be important\nat small field values, but it never dominates over the quadratic term at large field values.\nIn contrast to the usual notion, the scalar potential in general becomes flatter at large field\nvalues in the running kinetic inflation.\nLastly we give an extreme example, f ≈ e2φ . In this case, the canonically normalized\n\nfield is φ̂ ≈ eφ . The effective scalar potential would be extremely flat for sufficiently large\nφ, when expressed in terms of φ̂. For instance,\n1\n1\nV (φ) = m2 φ2 =⇒ V (φ̂) = m2 ln2 φ̂.\n2\n2\n\n(5)\n\nThus, a large coefficient of the kinetic term is advantageous for inflation to occur, since\nthe effective potential becomes flat.3 In general, however, we would lose predictivity if the\ngrowth of the coefficient f (φ) is not under control. As we will see in the following section, we\ncan impose a certain symmetry which controls the growth of the kinetic term. Interestingly,\nthe same symmetry also enables the chaotic inflation in supergravity.\n3\n\nIn Refs. [36, 37], it was noted that a large wave function factor helps to realize the slow-roll inflation,\nwhere the origin of the large factor could be a modulus field. In our model, the large wave function factor\nis realized dynamically by the inflaton, which results in the transition of the inflaton potential, as we will\nsee later.\n\n5\n\n\fAs an immediate consequence of the running kinetic term, we can construct a variety of\ninflation models. For example, it is possible to realize the inflaton potential which is proportional to φ during inflation, and to φ4 after inflation. This point is extremely important\nfor both cosmology and phenomenology, and we will come back to this issue later.\n\nB.\n\nSet-up\n\nLet us build an inflation model in supergravity, in which the kinetic term grows at large\nfield values in a controlled way. The running kinetic term naturally occurs if the inflaton\nmoves over more than the Planck scale during inflation. This is indeed the case in the\nchaotic inflation, which, however, is difficult to implement in supergravity because of the\nexponential prefactor ∼ eK in the scalar potential. We need to introduce some sort of shift\nsymmetry, which suppresses the exponential growth of the potential. As we will see below,\nthe shift symmetry simultaneously fixes the form of the kinetic term.\nWe introduce a chiral superfield, φ, and require that the Kähler potential for φ is invariant\nunder the following transformation;\nφn → φn + α for α ∈ R and φ 6= 0,\n\n(6)\n\nwhere n is a positive integer, and α is a transformation parameter. The symmetry (6) means\nthat a composite field φ̂ ∼ φn transforms under a Nambu-Goldstone like shift symmetry.\nIn the case of n = 2, this is equivalent to imposing a hyperbolic rotation symmetry (i.e.\n√\nSO(1,1)) on the real and imaginary components, (φR , φI ), where φ = (φR + iφI )/ 2. In\nFig. 1 we show trajectories generated by the symmetry transformation (6) for n = 2 and 3.\nThe Kähler potential satisfying the shift symmetry must be a function of (φn − φ†n ):\nX cl\nK = f (φn − φ†n ) =\n(φn − φ†n )l\n(7)\nl\nl=1\n\nwhere cl is a numerical coefficient of O(1) and we normalize c2 ≡ −1; cl is real (imaginary)\n\nfor even(odd) l. Note that the |φ|2 term, which usually generates the kinetic term for\n\nφ, is absent if n ≥ 2. Instead, the kinetic term arises from the terms of l ≥ 2, whose\n\ncontribution is proportional to (φn − φ†n )l−2 |φ|2n−2. Note that the lowest component of\nthe Kähler potential vanishes for θ = (j/n)π, where θ is a phase of φ, φ = |φ|eiθ , and\n\nj = 0, * * * , 2n − 1. The presence of such flat directions along which the Kähler potential\ndoes not grow is essential for constructing a chaotic inflation model in supergravity.\n6\n\n\fφI\n\nn=2\n\nφI\n\n2\n\nn=3\n2\n\n1\n\n1\n\n0\n\n0\n\n-1\n\n-1\n\n-2\n\n-2\n-2\n\n-1\n\n0\n\n1\n\n-2\n\n2\n\nφR\n\n-1\n\n0\n\n1\n\n2\n\nφR\n\nFIG. 1: The trajectories generated by the symmetry transformation (6) for n = 2 (left) and n = 3\n(right). They correspond to the contours of Im[φn − φ†n ] = 0, 0.2, 1, and 2, respectively. In\nthe region of |φ| & 1, each contour corresponds to an inflationary trajectory. It depends on the\ninteractions in the Kähler potential which trajectory is chosen. See the text for details.\n\nWe can impose a discrete Zk symmetry that is consistent with the shift symmetry (6).\nRequiring (φn − φ†n ), an invariant under the shift symmetry, be also invariant under the\ndiscrete symmetry up to a phase factor, we find that k must be one of the divisors of 2n. If\nk = 2n, the (φn − φ†n ) would flip its sign, and so, cl with any odd l should vanish. If k is a\n\ndivisor of n, there is no such constraint, since φn itself is invariant under Zk .\n\nIn order to have a successful inflation model, let us add two different breaking terms of\nthe shift symmetry. First, we add an interaction in the superpotential:\nW = λXφm ,\n\n(8)\n\nwhere λ is a real numerical coefficient to be fixed by the WMAP normalization of density\nperturbations. We assume that X and φ have U(1)R charges 2 and 0, respectively.4 We\nassign a Zk charge to X and φ as shown in Table I in order to suppress couplings that would\nR\nR\nspoil the inflation; e.g. d2 θ X and d2 θ X 2 are forbidden. We require m 6≡ 0 (mod k) for\nthis purpose. As we will see later, X can be stabilized at the origin during inflation, which\n\nsuppresses a negative contribution −3|W |2 in the scalar potential (15). The interaction (8)\n4\n\nIt is not possible to assign a non-zero R-charge to φ, since it would be in conflict with the shift symmetry\n(6), unless a discrete R symmetry is considered.\n\n7\n\n\fφ\n\nX\n\nU(1)R 0\n\n2\n\nZk\n\n1 −m\n\nTABLE I: The charge assignment of φ and X.\n\nthen generates a potential ∼ λ2 |φ|2m.\nSecondly, let us add a shift-symmetry breaking term,\n∆K = κ|φ|2 ,\n\n(9)\n\nto cure the singular behavior of the Kähler metric at the origin. Here 0 < κ ≪ 1 is a real\nnumerical coefficient, and the smallness is natural in the 't Hooft's sense [38]. This term is\nirrelevant during inflation, but it gives a dominant contribution to the kinetic term some\ntime after inflation. Note that, once the shift symmetry is broken in the superpotential by\n(8), symmetry breaking terms are radiatively generated in the Kähler potential. Indeed, if\nm = jn + 1 for j = 0, 1, 2, * * * , the breaking term (9) with κ = O(λ2) will be generated as\n\nradiative corrections.5 In this case, there is essentially one free parameter, κ ∼ λ2 . Also, a\ncoupling of φ to the standard model (SM) sector could induce the term (9) similarly, and\nthen κ and λ are not related to each other. In the following we consider a general case and\ntreat κ and λ independent parameters, but we sometimes set κ = λ2 as a reference value.\nThere could be other interactions which violate the shift symmetry, but throughout this\nletter we assume that those symmetry breaking terms are soft in a sense that the shift symmetry remains a good symmetry at large φ. Also, the breaking term (9) is most important\nat low energy, and so, we focus on its effect in this paper.6\nThe kinetic term of the scalar field is given by\nLK =\n\nκ−\n\nX\nl=2\n\n!\n\nn2 cl (l − 1)(φn − φ†n )l−2 |φ|2n−2 ∂ μ φ† ∂μ φ.\n\n(10)\n\nNote that the second term contains a factor of (φn − φ†n )l−2 . In fact, φn − φ†n is constant\nalong the inflationary trajectory. Then, the above kinetic term is equivalent to the second\n5\n6\n\nTaking account of the WMAP constraint, only j = 0 and 1 are allowed.\nOther symmetry breaking terms could change how the transition occurs, but neither the potential during\ninflation nor the inflaton mass at the minimum are modified. One interesting possibility, however, is the\nnon-Gaussianity; see Ref. [39].\n\n8\n\n\fexample (3) in the previous section. The novelty here is the presence of the shift symmetry\n(6), which determines the form of the kinetic term; namely, φ̂ ∼ φn is the dynamical variable\nat high energies.\nThe inflaton field value exceeds the Planck scale during inflation, |φ| > 1. Since the\n\nscalar potential has an exponential prefactor ∼ eK , the inflationary trajectory should be\nsuch that K is minimized. To be explicit, let us define η ≡ φn − φ†n so that the Kähler\n\npotential is a function of η. (Here we neglect the symmetry breaking term (9), which is not\nrelevant during inflation.) Along the inflationary trajectory, η is stabilized at ηmin satisfying\nf ′ (η)|η=ηmin ≈ 0. This condition actually means that η should be at an extremum. We\nassume that it is a local minimum, for the stability of the inflationary trajectory. As long\nas η remains at the minimum, the terms with l ≥ 3 does not change the form of the kinetic\nterm significantly, and so, we focus on the terms with l ≤ 2 in the following analysis. Then\nη is stabilized at\nηmin ≃ c1\n\n(during inflation).\n\n(11)\n\n\u0001\nκ + n2 |φ|2n−2 ∂ μ φ† ∂μ φ,\n\n(12)\n\nThe kinetic term becomes\nLK =\n\nwhere we have substituted c2 = −1. After inflation ends at |φ| ∼ 1, the terms with l ≥ 3\nbecomes irrelevant for the dynamics. Therefore Eq. (12) is valid both during and after\ninflation. Note that, while η is stabilized at ηmin for |φ| & 1, it is unconstrained for |φ| . 1.\nIn other words, the inflation is effectively driven by a single field orthogonal to η, while the\ninflaton dynamics after inflation is described by a complex scalar.\nTo summarize this section, let us write the Kähler and super-potenetials for the running\nkinetic inflation:\n1\nK = κ|φ|2 + c1 (φn − φ†n ) − (φn − φ†n )2 + |X|2 ,\n2\nm\nW = λXφ ,\n\n(13)\n(14)\n\nwhere we dropped the terms with l ≥ 3. If we impose the Z2n symmetry, c1 should vanish.\nThe scalar potential in supergravity is given by\nK\n\nV = e\n\n\u0010\n\nij̄\n\n∗\n\nDi W K (Dj W ) − 3|W |\n9\n\n2\n\n\u0011\n\n.\n\n(15)\n\n\fUsing the scalar potential, we can show that, during and after inflation, X has a mass of the\norder of the Hubble parameter, and therefore stabilized at the origin.7 Then the relevant\nLagrangian for the inflation is given by\n\u0001\nL = κ + n2 |φ|2n−2 ∂ μ φ† ∂μ φ − V,\n\n2\n eκ|φ|2− c21 λ2 |φ|2m\nV (φ) ≈\n\nλ2 |φ|2m\n\n(16)\nfor |φ| & 1 and η = c1\n\n.\n\n(17)\n\nfor |φ| . 1\n\nSince we explicitly breaks the shift symmetry (6) by the κ term (9), there appears a non√\nvanishing exponential prefactor. However, for |φ| < 1/ κ, the exponential prefactor is\nof O(1), and therefore can be dropped. Note that the inflaton does slow-roll even if the\nexponential prefactor gives a main contribution to the tilt of the potential. In Fig. 2 we\nshow the shape of the potential V (φ) with c1 = 1 in the case of n = m = 2. The flat\ndirection corresponding to the inflationary trajectory is indicated by the red arrow. One\ncan see that the η, orthogonal to the red arrow, has a large mass during inflation and the\ninflationary dynamics is effectively described by a single field.\n\nC.\n\nInflaton dynamics\n\nNow we study the inflationary dynamics based on the Lagrangian (16). During inflation,\nη is stabilized at ηmin . So, let us rewrite the Lagrangian in terms of the inflaton orthogonal\nto η.\nFor 1 < |φ| ≪ κ−1/2 , the Lagrangian can be approximated by\nc2\n1\n\nL ≈ n2 |φ|2n−2∂ μ φ† ∂μ φ − e− 2 λ2 |φ|2m ,\n= ∂ μ φ̂† ∂μ φ̂ − λ̂2 |φ̂|2m/n ,\n\n(18)\n(19)\n\nc2\n1\n\nwhere we have defined φ̂ ≡ φn and λ̂ ≡ e− 4 λ. The condition η = φ̂ − φ̂† = c1 is satisfied for\nφ\nc1\nφ̂ = √ + ,\n2\n2\n\n(20)\n\nwhere φ is a real scalar. (Remember that c1 is a pure imaginary constant.) The Lagrangian\nfor the canonically normalized inflaton is therefore given by\n\u0012\n\u00132m/n\nφ\n1 μ\n2\nL ≈ ∂ φ∂μ φ − λ̂ √\n2\n2\n7\n\nThe interaction, K ⊃ −cX |X|4 with cX = O(1), also gives a Hubble-induced mass for X.\n\n10\n\n(21)\n\n\fFIG. 2: The bird's-eye view of the scalar potential V (φ) given by Eq. (17) with n = m = 2 and\nc1 = i. The flat direction corresponding to the inflationary trajectory is indicated by the red arrow.\n\nfor 1 < φ ≪ κ−n/2 . Thus, thanks to the shift symmetry, the inflaton φ can take a value\ngreater than the Planck scale, and the chaotic inflation takes place.\nThe inflaton field durning inflation is related to the e-folding number N as\nr\n4m\nφN ≃\nN,\nn\n\n(22)\n\nand the inflation ends at φ = O(1) for m/n = O(1). The power spectrum of the density\nperturbation is given by\n∆2R ≃\n\nV3\n= (2.43 ± 0.11) × 10−9 ,\n12π 2 V ′2\n\n(23)\n\nwhere we have used in the second equality the WMAP result [1]. The coupling λ̂ is therefore\ndetermined as\nλ̂ ≃ 5.4 × 10\n\n−4\n\n\u0013\n\u0012\n\u0010 m \u0011 n−m\nm\n2n\n− 2n\n− m+n\n2n\n.\n2\nN\nn\n\n(24)\n\nWe show in Fig. 3 the λ̂ as a function of 2m/n. We can reproduce the known results for\nthe quadratic and quartic potentials. For the quadratic potential V = (1/2)m2 φ2 with\n11\n\n\f2.5x10 -5\n\n2x10 -5\n\nλ\n\n1.5x10 -5\n\n10\n\nN=50\n\n-5\n\nN=60\n\n5x10 -6\n\n1\n\n2\n\n3\n\n4\n\n2m/n\nFIG. 3:\n\nThe coupling λ̂, which accounts for the observed density perturbtion, as a function of\n\n2m/n for the e-foldings N = 50 and 60.\n\n2m/n = 2, the inflaton mass during inflation is given by m = λ̂ ≃ 2 × 1013 GeV, where we\n\nused N = 50. Similarly, for the quartic potential V = (λ̃/4)φ4 with 2m/n = 4, we obtain\nλ̃ = λ̂2 ≃ 3 × 10−13 for N = 50.\nIn order for the inflation driven by (21) to last for N e-foldings, the following inequality\n\nmust be met;\n\u0010 n \u0011 n1\n.\n(25)\nφN . κ\n⇐⇒ κ .\n4mN\nFor instance, κ must be smaller than 0.1 for for n = 2, m = 1 and N = 50 [6]. The spectral\n−n/2\n\nindex ns and the tensor-to-scalar ratio r are respectively given by\n\u0010\nm\u0011 1\nns = 1 − 1 +\n,\nn N\n8m 1\n,\nr =\nn N\n\n(26)\n(27)\n\nand they are related to each other by\n1 − ns =\n\nn+m\nr.\n8m\n\n(28)\n\nThe inflation ends when the slow-roll condition is violated at φ ∼ 1, and the inflaton\nstarts to oscillate about the origin. The η is no longer stabilized at ηmin for |φ̂| < 1. As the\namplitude of the inflaton decreases, the symmetry breaking term (9) (or the first term in\n(16)) becomes more important. For |φ| < (κ/n2 )1/(2n−2) , the Lagrangian becomes\nL ≈ ∂ μ φ̃† ∂μ φ̃ −\n12\n\nλ2 2m\n|φ̃| ,\nκm\n\n(29)\n\n\fV\nφ\n\n2m\nn\n\n~ 2m\n\nφ\n~\n\nφ2\n~\n\nφe\n\n~\n\nφb\n\nFIG. 4: The scalar potential near the origin for m ≥ 2 with respect to the canonically normalized\nfields φ̃ and φ̂. The mass term about the origin represents the soft SUSY breaking mass. We define\nφ̃b = κn/(2n−2) and φ̃e = (m3/2 κm/2 /λ)1/(m−1) .\n\nwhere we have defined a canonically normalized field at low scales, φ̃ ≡\n\n√\n\nκφ. The power of\n\nthe scalar potential changes from 2m/n to 2m after inflation. The shape of the potential for\nm ≥ 2 is shown in Fig. 4. Except for n = 1, the potential becomes steeper after inflation.\n(Note that the model with n = m = 1 is equivalent to the model of Ref. [11].) This is one\nof the features of the running kinetic inflation. In Ref. [6], the case of n = 2 and m = 1 was\nmainly studied, where the potential is linear during inflation and becomes a quadratic term\nafter inflation.\n√\nThe inflaton has a large mass at the potential minimum, mφ ≃ λ/ κ, only if m = 1. On\nthe other hand, for m ≥ 2, the inflaton remains massless in the SUSY limit. This opens up a\nvery interesting phenomenon; for instance, if take n = m ≥ 2, the inflaton is massive during\ninflation, but it becomes massless after inflation! Thus, the inflaton decay process will be\nsignificantly modified compared to the case of the massive inflaton. In the next section we\nwill study the inflaton mass at the potential minimum, taking account of the SUSY breaking\neffect.\n\n13\n\n\fD.\n\nInflaton mass spectrum\n\nOne of the features of the running kinetic inflation model is that the scalar potential\nbecomes steeper some time after inflation. In the SUSY limit, the inflaton mass at the\npotential minimum depends on the value of m. If m = 1, both inflaton and inflatino have\na large SUSY mass, while they are massless for m ≥ 2. In the latter case, once the SUSY\nbreaking effect is taken into consideration, the inflaton and/or inflatino acquire a soft SUSY\nbreaking mass that depends on n. If n = 2, both the inflaton and inflatino acquire a soft\nmass heavier than the gravitino mass, while the inflaton mass is of order of the gravitino\nmass and the inflatino remains massless for n ≥ 3. We consider these three cases.\n1.\n\nA case of m = 1\n\n√\nBoth the inflaton and X have a large and degenerate SUSY mass ≃ λ/ κ, and these\ntwo fields are maximally mixed, once a constant term in the superpotential is taken into\naccount [11]. Depending on the precise value of κ, the mass can vary from 1014 GeV up\nto the Planck mass. Since the inflaton mass is so large that the SUSY breaking effect is\nnegligible.\n\n2.\n\nA case of n = 2 and m ≥ 2\n\nIn the case of n = 2 and m ≥ 2, the inflaton is massless at the potential minimum in the\nSUSY limit. However, the l = 1 term gives a soft SUSY breaking mass much larger than\nthe gravitino mass.\nLet us consider the case of n = m = 2, and the case of m ≥ 3 can be treated in the\n\nsame way. The effective potential around the origin is proportional to |φ̃|4 (see Eq. (29)).\nTherefore the inflaton as well as X remain massless in the SUSY limit. In order to estimate\ntheir masses we need to take account of the SUSY breaking effect.\n\nTo this end, let us introduce a SUSY breaking superfield Z, which has a non-zero F-term,\n√\nhFZ i ≡ μ2 = 3m3/2 , where m3/2 is the gravitino mass. We fix hZi = 0, and do not consider\n\n14\n\n\fits dynamics in the following analysis. The Kähler and super-potentials are\n1\nK = κ|φ|2 + c1 (φ2 − φ†2 ) − (φ2 − φ†2 )2 + |X|2 + |Z|2 + * * * ,\n2\n2\n2\nW = λXφ + μ Z + W0 ,\n\n(30)\n(31)\n\nwhere W0 = m3/2 . In general there could be couplings among Z, φ and X in the Kähler\npotential, which are denoted by the dots. As long as they are suppressed by the Planck scale,\nthe following result does not change significantly, and so, we drop them in the following.\nLet us rewrite the Kähler and super-potentials in terms of φ̃:\nK = |φ̃|2 +\nW =\n\nc1 2\n1\n(φ̃ − φ̃†2 ) − 2 (φ̃2 − φ̃†2 )2 + |X|2 + |Z|2 ,\nκ\n2κ\n\nλ\nX φ̃2 + μ2 Z + W0 .\nκ\n\n(32)\n(33)\n\nUsing the supergravity scalar potential (15), one can show that φ̃ and X are stabilized at\nthe origin. Their masses at the origin are\nr\n2|c1 |\n4|c1|2\n1+\nmφ̃ =\nm3/2 ≈\nm3/2 ,\n2\nκ\nκ\nmX = m3/2 ,\n\n(34)\n(35)\n\nwhere we have used κ ≪ 1 and |c1 | = O(1). As long as the inflaton is coupled to the\nSUSY breaking field only gravitationally, the inflaton is stabilized at the origin. This is not\nnecessarily the case for X; the origin could be destabilized depending on a possible quartic\ncoupling |X|2 |Z|2 in the Kähler potential. Note that φ̃ and X do not mix in contrast to the\ncase of n = m = 1. The inflatino has the same mass as the inflaton.\nThe result changes if we impose the Z2n discrete symmetry. In this case c1 should vanish,\nand the inflaton mass becomes of order of the gravitino mass.\n\n3.\n\nA case of n ≥ 3 and m ≥ 2\n\nSimilarly we consider the case of n = m = 3; the other cases can be treated along the\nsame line. In the case of n = m = 3, the inflaton and X are massless in the SUSY limit as\nin the previous case. Let us write down the Kähler and super-potentials (13) and (14) in\nterms of φ̃:\nK = |φ̃|2 +\nW =\n\n1\nc1\n(φ̃3 − φ̃†3 ) − 3 (φ̃3 − φ̃†3 )2 + |X|2 + |Z|2 ,\n3/2\nκ\n2κ\n\nλ\nX φ̃3 + μ2 Z + W0 .\nκ3/2\n15\n\n(36)\n(37)\n\n\fUsing the supergravity scalar potential (15), one can show that φ̃ and X are stabilized at\nthe origin. Their masses at the origin are\nmφ̃ = mX = m3/2 .\n\n(38)\n\nFor a general Kähler potential, both the inflaton and X have a mass of O(m3/2 ). The\ninflatino still remains massless. As we will see later, if we couple the inflaton to the Higgs\nsector, the inflatino acquires a mass after the electroweak phase transition.\n\nE.\n\nSolution to the non-thermal gravitino production\n\nIn order to have a successful inflation model, one needs to recover the hot radiationdominated Universe after inflation. This is achieved by the inflaton decay, which transfers\nthe inflaton energy to radiation. Recently it was pointed out that a significant amount of\ngravitinos can be produced by the inflaton decay [11]; the resultant gravitino abundance is\ngiven by an increasing function of the inflaton mass and VEV at the potential minimum,\ngiving a preference to a light mass and a small VEV.\nOur running kinetic inflation model is a variant of the chaotic inflation, and so, it belongs to a high-scale inflation. Interestingly, our model avoids the gravitino overproduction\nproblem in two ways. First, the inflaton has a discrete symmetry, which forbids the inflaton\nVEV. Even if the symmetry is explicitly broken by a small amount, the induced VEV could\nbe suppressed. Secondly, the inflaton is very light at the minimum for m ≥ 2, and indeed,\nit is massless in the SUSY limit. As we have seen before, the inflaton mass is of order of\nthe gravitino mass in most cases, which can suppress the inflaton decay into the gravitinos.\nSuch a kinematic suppression of the gravitino production is a new and attractive solution\nto the non-thermal gravitino production. What is particularly nice about our model is that\nthe inflaton potential during inflation is different from that at the minimum, and the inflation model can be well within the WMAP allowed region, without invoking a non-minimal\ncoupling to the gravity.\n\n16\n\n\fF.\n1.\n\nReheating\nA case of m = 1\n\nIn order to reheat the Universe, the inflaton must have some couplings with the SM\nsector. In the case of m = 1, the inflaton mass is heavier than 1014 GeV, and the inflaton\nand X are maximally mixed in general [11]. Therefore φ can decay into the SM particles\nthrough couplings of X with the SM sector. For instance, if we introduce the coupling with\nHiggs doublets [40],\nW = λX XHu Hd ,\n\n(39)\n\nwhere λX is a numerical coefficient and Hu(d) is the up(down)-type Higgs doublet, the\nreheating temperature will become\n10\n\nTR ∼ 10 GeV\n\n\u0012\n\nλX\n10−5\n\n\u0013\u0010\n\nmφ \u00111/2\n.\n1014 GeV\n\n(40)\n\nHere we have assumed that Hu Hd has a R-charge 0 and a negative parity under the Z2\n√\nsymmetry. Alternatively, if we allow a symmetry-breaking term δ(φ + φ† ) = δ/ κ(φ̂ + φ̂† )\nin the Kähler potential, the inflaton decays into the SM particles through the gravitational\ncouplings with the top Yukawa interaction and the SU(3)C gauge sector [12, 41]. The\nreheating temperature will become\n6\n\nTR ∼ 5 × 10 GeV\n\n\u0012\n\n√ \u0013\nδ/ κ \u0010 mφ \u00113/2\n.\n10−3\n1014 GeV\n\n(41)\n\nNote that the δ-term violates both the shift and Z2 symmetries. If the inflaton mass mφ is\nabout 1016 GeV, the reheating temperature becomes about 1010 GeV, which is high enough\nfor the thermal leptogenesis to work [42, 43]. However, it is in general difficult to satisfy\nthe constraints from the non-thermal gravitino problem when the inflaton decay is induced\nby the gravitationally suppressed coupling, unless the gravitino is either extremely light\nm3/2 ≤ O(10) eV [44] or very heavy m3/2 ≥ O(102) TeV and the R-parity is broken. We also\nnote that the inflaton has an approximate U(1) symmetry at the origin, and Q-balls [45]\nmay be formed; however, the charge is relatively small and so it does not affect the reheating\nprocess.8\n8\n\nFT thanks M. Kawasaki and S. Kasuya for useful discussion.\n\n17\n\n\f2.\n\nA case of n = 2 and m ≥ 2\n\nIn this case, both the inflaton and X are massless in the SUSY limit. However, once\nthe SUSY breaking is taken into account, the inflaton becomes heavier than the gravitino,\nwhile the mass of X is of order of the gravitino mass. In contrast to the previous case, there\nis no significant mixing between φ and X. So, we need to couple φ to the SM sector. For\ninstance, we may couple φ to the Higgs sector,\nW = λφ φHu Hd ,\n\n(42)\n\nwhere we have assigned an R-charge 2 and the Zk charge −1 to Hu Hd . The numerical\ncoefficient λφ breaks the shift symmetry, and so, we may assume λφ ∼ λ, although not\nnecessarily. Assuming the inflaton mass is much heavier than the Higgs and Higgsinos, the\nresultant decay temperature would be\n7\n\nTR ∼ 10 GeV |c1 |\n\n1/2\n\n\u0012\n\nλφ\n10−5\n\n\u0013\u0010\n\nκ \u0011− 12 \u0010 m3/2 \u0011 12\n,\n10−4\nTeV\n\n(43)\n\nwhere we have used (34). Note that, for the parameters chosen in the above expression,\nthe reheating temperature is comparable to the inflaton mass. If the reheating temperature\ncalculated by equating the decay rate and the Hubble parameter exceeds the inflaton mass,\nthe decay process will be significantly affected by the back reaction. This is because, when\nthe decay products acquire a thermal mass comparable to the inflaton mass, the available\nphase space will be reduced [46]. That is, the reheating temperature cannot exceed the\ninflaton mass, as long as it proceeds through a perturbative decay. As a result, the reheating\ntemperature is given by the inflaton mass, if the naively calculated reheating temperature\nturns out to be larger than the inflaton mass:\nTR ∼ mφ =\n\n2|c1|\nm3/2 ,\nκ\n\n(44)\n\nwhich is used if TR given by Eq. (43) exceeds mφ . The validity of (44) will be discussed in\nthe next section.\n\n3.\n\nA case of n ≥ 3 and m ≥ 2\n\nThe main difference from the previous case is that the inflaton mass is of order of the\ngravitino mass, and the reheating temperature becomes lower, accordingly. In particular, in\n18\n\n\forder to reheat the Universe with such a light inflaton mass, the inflaton must have unsuppressed couplings to the SM sector. If it has only gravitationally suppressed interactions,\nthere would be cosmological difficulties; the reheating temperature is too low to be consistent with BBN, and the LSPs may be overproduced by the inflaton decay [47], as long as\nwe consider m3/2 . O(100)TeV. Thus, we consider a possibility to couple the inflaton to the\nSM particles at the renormalizable level. The only possibility is to couple φ to the Higgs\nsector as in Eq. (42). If we calculate the reheating temperature by equating the decay rate\nto the Hubble parameter, we would obtain a temperature much higher than the inflaton\nmass. Thus, according to the above argument, the reheating temperature is equal to the\ninflaton mass:\nTR ∼ mφ ∼ m3/2 .\n\n(45)\n\nAs a corollary, the inflaton mass, therefore the gravitino mass, needs to be heavier than\nO(10) MeV to be consistent with BBN [48–50], since otherwise the reheating would not be\ncompleted before BBN.\nLet us discuss the validity of the reheating temperature, TR ∼ mφ . So far we have not\ntaken into account that, before the inflaton decay is completed, the decay products, Hu\nand Hd , have masses of O(λφ |φ|), which may prevent the inflaton decay to proceed until\nthe amplitude becomes small enough. As we will see later, the inflaton moves in a nearly\ncircular orbit in the complex plane, and so, the mass of the decay products does not change\nduring oscillations. The decay into Higgs (Higgsino) becomes first kinematically accessible\n√\nwhen the amplitude of oscillations becomes φ̃ ∼ κm3/2 /λφ . If the inflaton decayed at\n−1/2\n\nthis epoch, the reheating temperature would be TR ∼ κ1/4 λφ\n\nm3/2 . If the temperature\n\nestimated this way exceeds the inflaton mass, the decay cannot complete the reheating due\nto the back reaction of the thermal mass, and the actual reheating temperature is given by\nTR ∼ mφ . This is indeed the case if κ & λ2φ . Otherwise, the reheating temperature is given\n−1/2\n\nby TR ∼ κ1/4 λφ\n\nm3/2 , but this does not modify our argument qualitatively, because the κ\n\nis expected to be not much smaller than O(λ2φ ) (see the discussion below Eq. (9)).\nIn the above analysis we implicitly assumed that the inflaton is oscillating about the\norigin with an amplitude smaller than φ̃e = (m3/2 κm/2 /λ)1/(m−1) so that the inflaton mass\nis simply given by O(m3/2 ). However, the inflaton decay may proceed before the kination\nepoch ends, namely, when the amplitude is larger than φ̃e . In particular, the inflaton has\na larger mass (i.e. the energy per unit inflaton quanta) in this regime, and so, it might be\n19\n\n\fpossible for the inflaton to transfer a significant amount of energy to radiation. The effective\nmass for the inflaton during the kination regime is given by mφ (φ̃) ∼ λφ̃m−1 /κm/2 , which\n√\ndecreases faster than the effective mass of Hu and Hd . Thus, if mφ (φ̃b ) < λφ φ̃b / κ, the\ninflaton decay does not occur during the kination epoch, where φ̃b = κn/(2n−2) is the inflaton\nfield value at the beginning of kination. This condition is rewritten as κ(m−n−1)/(2n−2) λ < λφ .\nIf this condition is not met, we need to take account of the radiation generated during the\nkination epoch. The radiation could dominate the energy density of the Universe, and the\ninflaton may be subdominant at the decay, or it may dominate the Universe again.\nFurthermore, the actual situation could be more complicated, because the inflaton also decays into the gauge bosons and gauginos through the one-loop diagram, even if the tree-level\ndecay is kinematically forbidden. Although the decay rate of such processes is suppressed, a\nsmall amount of radiation produced by the process may dominate and terminate the kination regime. Thus, the details of the reheating process and the resulting thermal history of\nthe Universe depend much on the model parameters. In Sec. IV, we fully take into account\nthe tree and one-loop decay processes.\n\nG.\n\nPreheating\n\nSo far we have focused on the perturbative decay, but since the inflaton starts to oscillate\nfrom the Planck scale, preheating could be important especially for the early stage of the\nreheating epoch. How fast and how long it proceeds depends on the interaction with the\nHiggs field as well as the inflaton trajectory. In particular, it is expected that the inflaton\nacquires a non-vanishing angular momentum when it starts to oscillate because, the U(1)\nsymmetry of the inflaton potential around the origin is just an accidental one, and at large\nscales, it is explicitly broken down to Zk . If the inflaton acquires large enough angular\nmomentum, it does not pass near the origin, reducing the efficiency of the preheating [51]. In\nfact we numerically followed the inflaton dynamics and confirmed that the inflaton acquires\na large angular momentum at the end of inflation. See Fig. 5. The exception is the case of\nthe Z2n symmetry, in which all cl with odd l vanish; the inflationary trajectory coincides\nwith the real component of φ, and so, no angular momentum is induced. Therefore, in this\ncase, preheating will play an important role in the reheating. We leave a detailed study of\nthe preheating for future work, and will focus on the case of Zk symmetry with k ≤ n.\n20\n\n\fIm[φ]\n\n1\n0.8\n0.6\n0.4\n0.2\n0\n-0.2\n-0.4\n-0.5\n\n0\n\n0.5\n\n1\n\n1.5\n\n2\n\n2.5\n\n3\n\nRe[φ]\nFIG. 5:\n\nThe inflationary trajectory for n = m and c1 = −i in the φ̂ = φ2 plane. During\n\ninflation with |φ̂| > 1, Im[φ̂] is stabilized at 1. After inflation the inflaton acquires a large angular\nmomentum.\n\nWe note that the angular momentum acquired by the inflaton is nothing but a CP asymmetry of the inflaton. Therefore, if the inflaton has a lepton- or baryon-number violating\ncoupling like\nW = λ′ φLHu ,\n\n(46)\n\nwhere the L is the lepton doublet, the asymmetry is transformed into the lepton asymmetry.\nThus, with the aid of the sphaleron process violating the B + L, the baryon asymmetry can\nbe naturally produced by the inflaton decay.\n\nIII.\nA.\n\nKINATION AFTER INFLATION\nEnhancement of gravity waves\n\nIn the present model, the inflaton potential changes its form depending on the field value\nφ. Correspondingly, the expansion law, or the equation of state, of the Universe changes\nas well. The transition of the equation of state occurs as follows. After the inflation ends\nat |φ̂| ∼ 1, the inflaton oscillates in the potential V ∝ |φ̂|2m/n until the amplitude becomes\n\n|φ̃| ∼ κ1/(2n−2) . For the amplitude smaller than κ1/(2n−2) , the potential behaves as V ∝ |φ̃|2m :\nthis is the kination regime. As the amplitude further decreases, the potential becomes\nfinally dominated by the soft mass term ∝ |φ̃|2 , which corresponds to the matter-dominated\n21\n\n\fUniverse. Then the inflaton decays and the radiation dominant Universe begins. The\nevolution of the Universe described above leaves a characteristic imprint on the spectrum\nof inflationary gravitational wave background [52–55]. In particular, the kination after\ninflation enhances the gravity waves at corresponding frequencies, and the direct detection of\ngravitational waves by spaceborne laser interferometers may support or refute the expansion\nhistory of the Universe.\nIn the following analysis we simply assume that the background plasma, which may\nalready exist in the kination regime, does not affect the expansion history. Let us denote the\nHubble parameter at the beginning and the end of kination as Hb and He , respectively. They\n1/(m−1)\nare estimated as Hb ∼ λκm/(2n−2) and He ∼ (κm/2 mm\n. If the kination regime is\n3/2 /λ)\n\nfollowed by the matter-dominated regime, the reheating temperature is given by TR ∼ m3/2 ,\nas explained before. As an extreme case, we also consider a case that inflaton decays as soon\n√\nas the kination ends, and the reheating temperature is then given by TR ∼ He , although\nsome non-trivial process may be needed to realize this situation. During the kination stage,\nthe scale factor grows as a(t) ∝ t(m+1)/(3m) . The spectrum of the gravitational waves which\n\nenters the horizon at this stage looks like ΩGW (k) ∝ k (2m−4)/(2m−1) with a comoving wave\nnumber k. Here we have defined\nΩGW (k) =\n\n1 dρGW (k)\n,\nρ0 d ln k\n\n(47)\n\nwhere ρ0 is the critical density of the Universe, and dρGW (k)/d ln k denotes the energy\ndensity of the gravitational waves per logarithmic frequency.\nTherefore, the gravitational wave spectrum behaves as\n\n\n\nk0\nfor keq < k < kR ,\n\n\nΩGW (k) ∝ k −2\nfor kR < k < ke ,\n\n\n\n k (2m−4)/(2m−1) for ke < k < kb ,\n\n(48)\n\nif kR < ke , where keq , kR , ke and kb denote the comoving horizon scale at the time\nof matter-radiation equality, reheating, the end of kination and the beginning of kination. We find kR = 2.6 × 10−5 Hz(TR /1TeV)(g∗s (TR )/106.75)1/6 , ke = (He /HR )1/3 kR and\n\nkb = (Hb /He )(2m−1)/(3m) ke . Importantly, the spectrum is enhanced in the kination regime\nfor m > 2.\nIn the extreme case that the reheating occurs as soon as the kination ends, we can set\n22\n\n\fFIG. 6:\n\nSpectrum of gravitational wave background for n = 4 and m = 3, for the case of\n\n(a) reheating immediately after kination ends, (b) κ = λ2 and (c) and κ = λ. The projected\nsensitivities of BBO/DECIGO and its correlation analysis are also shown.\n\nkR = ke in Eq. (48):\nΩGW (k) ∝\n\n\n k0\n\nfor keq < k < kR ,\n\n k (2m−4)/(2m−1) for kR < k < kb ,\n\n(49)\n\nThus the gravitational wave spectrum has no suppression in this case.\nFig. 6 shows the spectrum of gravitational waves for n = 4 and m = 3, for the case of\n(a) reheating immediately after kination ends, (b) κ = λ2 and (c) and κ = λ. The projected\nsensitivities of BBO/DECIGO [56, 57] its correlation analysis, and its ultimate sensitivities\nare also shown. We can clearly see the enhancement at high frequency corresponding to\nthe mode entering in the horizon during the kination regime where the potential is given by\nV ∝ |φ̃|6 . However, this enhancement is compensated to some extent by the suppression due\nto the subsequent matter-dominated era. Which effect dominates depends on the parameter\nκ and λ.\nIn most cases, the spectrum has characteristic features on its magnitude and/or the tilt\nat observable frequencies. If the primordial gravitational waves is discovered by the future\nCMB observations, we may have a good chance to detect them directly by the planned space\nlaser interferometers and to confirm the running kinetic inflation model.\n\n23\n\n\fB.\n\nEnhancement of unwanted relics : gravitino\n\nThe modified expansion history of the Universe enhances not only primordial gravitational\nwaves, but also the abundance of unwanted relics. The gravitino is one of such dangerous\nrelics. Let us estimate its abundance.\nAt the inflationary stage, the Universe is regarded as being filled with radiation with\nHawking temperature ∼ HI /(2π). Thus particles with masses smaller than HI would have\nthermal abundances [58]. The gravitino number density at the end of inflation is given by\nn3/2 (HI ) ≃ γHI3 , where γ ≃ 7 × 10−4 . The number density after the reheating completes is\nestimated as\n\u00133 \u0012\n\u00133 \u0012\n\u00133\na(HI )\na(Hb )\na(He )\nn3/2 (HR ) = n3/2 (HI )\na(Hb )\na(He )\na(HR )\n\u0012 \u0013(m+n)/m \u0012 \u0013(m+1)/m \u0012\n\u00132\nHb\nHe\nHR\n3\n∼ γHI\n.\nHI\nHb\nHe\n\u0012\n\nThus the gravitino abundance in terms of the number-to-entropy ratio is given by\n\u0012\n\u0013(m−n)/m\nn3/2\nHI\nγλ HI\nY3/2 ≡\n∼\n.\ns\n4 MP λMP\n\n(50)\n\n(51)\n\nThis is evaluated as\nY3/2 ∼ 7 × 10\n\n−14\n\n\u0012\n\nλ\n10−5\n\n\u0013\u0012\n\nHI\n14\n10 GeV\n\n\u0013\u0012\n\nHI\nλMP\n\n\u0013(m−n)/m\n\n.\n\n(52)\n\nHere we have taken TR = m3/2 . The constraint reads m3/2 Y3/2 . 4 × 10−10 GeV for a stable\n\ngravitino and Y3/2 . 10−16 for m3/2 ∼ 1 TeV and Y3/2 . 10−13 -10−12 for m3/2 ∼ 10-100 TeV\n\nfor an unstable gravitino [59]. Therefore, even if the gravity waves are enhanced by the\nkination epoch, the gravitationally produced gravitino is cosmologically harmless for a light\nstable gravitino (m3/2 . 100GeV) or a heavy gravitino (m3/2 & 10TeV). In the next section,\nwe consider a case that the inflaton is identified with a singlet field in the nMSSM, where it\nturns out that there is no such enhancement, and therefore no cosmological problem with\nthe gravitationally produced gravitino.\n\nIV.\n\nINFLATON EMBEDDED IN NMSSM\n\nThe inflaton and inflatino remain massless in the SUSY limit for m ≥ 2, as we have seen\nin Sec. II. If n ≥ 3, once the SUSY breaking is taken into account, the inflaton acquires\n24\n\n\fa mass of O(m3/2 ), while the inflatino acquires its mass through a coupling to the Higgs\nsector, (42). Since the inflaton and inflatino are light, they may play an important role in\nthe low energy.\nThe MSSM plus a singlet that couples to the Higgs sector as (42) is known as nMSSM.\nThe main motivation to promote the μ-parameter to the singlet superfield is to solve the μproblem. In order for the singlet to develop a VEV of the order of the electroweak scale, a Z5\nor Z7 R-symmetry is imposed on the theory; the tadpole for the singlet is then radiatively\ninduced at sufficiently high order with a desired magnitude. The difference from the so\ncalled Next to Minimal SUSY SM (NMSSM) is the absence of both the cubic self-coupling\nof the singlet and the domain wall problem associated with the spontaneously broken Z3\nsymmetry. The discrete R-symmetry adopted in nMSSM forbids the cubic self-coupling,\nand get rid of the domain wall problem from the theory without destabilizing the hierarchy.\nThe nMSSM has rich phenomenology; the singlino is a viable candidate for dark matter,\nand the electroweak baryogenesis is feasible [60]. We here show that the running kinetic\ninflation model can nicely fit with the nMSSM, with the additional singlet being identified\nwith the inflaton.\nWe have assigned non-zero discrete charges to Hu Hd in Eq. (42), and so, we may wonder\nif domain walls are produced at the electroweak phase transition. This can be solved if we\nconsider a discrete R-symmetry, which is explicitly broken by the constant term W0 in the\nsuperpotential. So far we have imposed two symmetries, the R-symmetry and the discrete\nZk symmetry on the inflaton and X. We can combine these two and consider a discrete ZkR\nsymmetry, with k being a divisor of 2n. Under the ZkR symmetry, (φn − φ†n ) is invariant\n(up to a phase factor for k = 2n). The charge assignment is given by Table II. Note here\nthat the superpotential has a R-charge 6 in this charge assignment.\nIn order to have a successful inflation, there are several operators that must be suppressed.\nIn particular, we require that W ⊃ X, X 2 and X 2 φm should be forbidden by the discrete\nR symmetry, because these operators cannot be simply set to zero by the shift symmetry.\nWe note that, although the discrete R symmetry on φ is chosen so that it is consistent\nwith the shift symmetry (6), the operators including φ in the superpotential allowed by the\ndiscrete R symmetry do break the shift symmetry. Therefore we cannot estimate naively\nthe magnitudes of those operators. In this sense, it is minimal to require that those three\noperators should be forbidden by the discrete R symmetry. We simply assume that the\n25\n\n\fother type of dangerous operators are sufficiently suppressed by the shift symmetry. This\nrestricts the possible values of m: only m = 1, 3, 6 and 8 are allowed for m ≤ 10. (In the\ncase of the Z7 R symmetry, the allowed values of m(≤ 14) are m = 1, 2, 3, 4, 8, 9, 10 and 11.)\nIn order to account for the correct abundance of the inflatino dark matter, the effective\n√\ncoupling λφ / κ must be of order unity. This is indeed the case if κ is radiatively generated\nby the interaction (42). Furthermore, the inflatino must be long-lived to account for the\ndark matter. This is the case if the inflatino is the LSP and the R-parity is conserved. We\nnote however that the fermionic superpartner of X could be the LSP, partially because we\nhave forbidden its mass term W ⊃ X 2 by the discrete R symmetry. Even in this case, the\ninflatino would be sufficiently long-lived against the decay into X̃, if m ≥ 4. Also, if m = 2\n√\nand λ/κ ≈ λφ / κ, the inflatino mass can become comparable to the X̃.\nHu , Hd Q, L U c , D c , E c φ\nZ5R , Z7R\n\n1\n\n2\n\n3\n\nX\n\nW\n\n4 6 − 4m 6\n\nTABLE II: The charge assignment of the Z5R and Z7R symmetries. Note that the charge of the\nsuperpotential is normalized to be 6.\n\nWe have estimated the spectrum of primordial gravitational waves in the setup embedded\nin the nMSSM, as shown in Fig. 7; n = 5 and m = 3 with κ = 10−5 and 10−4 (left panel), and\nn = 7 and m = 4 with κ = 10−6 and 10−5 (right panel). As explained in Sec. II, the actual\nthermal history is complicated due to the existence of the background plasma produced by\nthe loop-suppressed inflaton decay. In this plot we have fully taken into account the effect of\ndecay products by the tree and one-loop inflaton decay processes on the expansion history.\nThe spectrum becomes flat for κ = 10−6 in the right panel of Fig. 7, because the radiation\nproduced during the kination comes to dominate the Universe for some time.\n\nV.\n\nCONCLUSIONS\n\nIn this paper we have studied the running kinetic inflation model, motivated by a simple\nidea that the kinetic term may well change its form if the inflaton moves over more than the\nPlanck scale. The growth of the kinetic term is actually advantageous for the inflation to\noccur, because the effective potential for the canonically normalized field becomes flat. As a\n26\n\n\fFIG. 7:\n\nSpectrum of gravitational wave background for the case of n = 5 and m = 3 with\n\nκ = 10−5 and 10−4 (left panel), and n = 7 and m = 4 with κ = 10−6 and 10−5 (right panel),\nwhich are embedded in the nMSSM framework. The projected sensitivities of BBO/DECIGO and\nits correlation analysis are also shown.\n\nconrete example, we have constructed a variety of chaotic inflation models in supergravity.\nOne of the features of the running kinetic inflation is that the power of the potential increases\nafter inflation: the potential is given by φ2m/n during inflation, while it becomes φ2m after\ninflation. The scalar spectral index and the tensor-to-scalar ratio are given by ns = 1 −\n\u0001 1\n1\nand r = 8m\n, respectively. Interestingly, the tensor-to-scalar ratio is generically\n1+ m\nn N\nn N\n\nlarge enough to be discovered by the CMB observation in future, especially by the Planck\nsatellite.\nWe have found that the model has a lot of interesting implications. In particular, we have\n\nfocused on the case of m ≥ 2, in which the inflaton is massless at the potential minimum in\nthe SUSY limit. Once the SUSY breaking effect is taken into account, the inflaton acquires a\nmass of the order of the gravitino mass, in general. Because of such a light mass, the thermal\nand non-thermal gravitino production can be naturally avoided. Also we have seen that the\ngravity waves can be enhanced due to the kination epoch which is naturally present in the\nrunning kinetic inflation. Finally, we have pointed out that, in order to have a successful\nreheating with such a light inflaton mass, the inflaton needs to have unsuppressed couplings\nwith the SM sector. One plausible candidate is the coupling to the Higgs sector (42). Then\nthe model is similar to the so called nMSSM with the singlet identified with the inflaton. The\ndiscrete R symmetry introduced in nMSSM can be identified with the discrete symmetry\non the inflaton, and therefore the running kinetic inflation naturally fits with nMSSM. The\n27\n\n\fphenomenology of nMSSM is known to be rich; the inflatino can account for the dark matter,\nand the inflaton coupling enables the electroweak baryogenesis.\nThe running inflation model, if realized in nature, will be confirmed in coming years\nby the CMB observations. Interestingly, if m ≥ 2, the inflaton and/or inflatino may be\ndiscovered at the collider experiments such as LHC as well as the direct DM search.\n\nAcknowledgments\n\nThis work was supported by the Grant-in-Aid for Scientific Research on Innovative Areas\n(No. 21111006) [KN and FT] and Scientific Research (A) (No. 22244030) [FT], and JSPS\nGrant-in-Aid for Young Scientists (B) (No. 21740160) [FT]. This work was supported by\nWorld Premier International Center Initiative (WPI Program), MEXT, Japan.\n\n[1] E. Komatsu et al., [arXiv:1001.4538 [astro-ph.CO]].\n[2] [Planck Collaboration], arXiv:astro-ph/0604069.\n[3] C. Armendariz-Picon, T. Damour and V. F. Mukhanov, Phys. Lett. B 458, 209 (1999)\n[arXiv:hep-th/9904075].\n[4] E. Silverstein, D. Tong, Phys. Rev. D70, 103505 (2004). [hep-th/0310221].\n[5] N. Arkani-Hamed, P. Creminelli, S. Mukohyama et al., JCAP 0404, 001 (2004).\n[hep-th/0312100].\n[6] F. Takahashi, arXiv:1006.2801 [hep-ph].\n[7] A. D. Linde, Phys. Lett. B 129, 177 (1983).\n[8] D. H. Lyth, Phys. Rev. Lett. 78, 1861 (1997).\n[9] S. Weinberg, Phys. Rev. Lett. 48, 1303 (1982).\n[10] L. M. Krauss, Nucl. Phys. B 227, 556 (1983).\n[11] M. Kawasaki, F. Takahashi, T. T. Yanagida, Phys. Lett. B638, 8 (2006); Phys. Rev. D 74,\n043519 (2006).\n[12] M. Endo, F. Takahashi, T. T. Yanagida, Phys. Lett. B658, 236 (2008); Phys. Rev. D76,\n083509 (2007).\n[13] E. Silverstein and A. Westphal, Phys. Rev. D 78, 106003 (2008) [arXiv:0803.3085 [hep-th]].\n\n28\n\n\f[14] L. McAllister, et al, arXiv:0808.0706 [hep-th].\n[15] H. Tashiro, T. Chiba, M. Sasaki, Class. Quant. Grav. 21, 1761-1772 (2004). [gr-qc/0307068].\n[16] M. Sami, V. Sahni, Phys. Rev. D70, 083513 (2004). [hep-th/0402086].\n[17] D. J. H. Chung, L. L. Everett, K. T. Matchev, Phys. Rev. D76, 103530 (2007).\n[arXiv:0704.3285 [hep-ph]].\n[18] M. Shaposhnikov and I. Tkachev, Phys. Lett. B 639, 414 (2006) [arXiv:hep-ph/0604236].\n[19] F. Bezrukov and D. Gorbunov, JHEP 1005, 010 (2010) [arXiv:0912.0390 [hep-ph]].\n[20] D. S. Salopek, J. R. Bond, J. M. Bardeen, Phys. Rev. D40, 1753 (1989).\n[21] T. Futamase, K. -i. Maeda, Phys. Rev. D39, 399-404 (1989).\n[22] B. L. Spokoiny, Phys. Lett. B147, 39-43 (1984).\n[23] R. Fakir, W. G. Unruh, Phys. Rev. D41, 1783-1791 (1990).\n[24] E. Komatsu, T. Futamase, Phys. Rev. D58, 023004 (1998). [astro-ph/9711340].\n[25] M. B. Einhorn and D. R. T. Jones, JHEP 1003, 026 (2010) [arXiv:0912.2718 [hep-ph]].\n[26] H. M. Lee, JCAP 1008, 003 (2010). [arXiv:1005.2735 [hep-ph]].\n[27] S. Ferrara, R. Kallosh, A. Linde et al., Phys. Rev. D82, 045003 (2010). [arXiv:1004.0712\n[hep-th]].\n[28] S. Ferrara, R. Kallosh, A. Linde et al., [arXiv:1008.2942 [hep-th]].\n[29] R. Kallosh, A. Linde, [arXiv:1008.3375 [hep-th]].\n[30] S. Kasuya, T. Moroi, F. Takahashi, Phys. Lett. B593, 33-41 (2004). [hep-ph/0312094].\n[31] F. L. Bezrukov, M. Shaposhnikov, Phys. Lett. B659, 703-706 (2008). [arXiv:0710.3755 [hepth]].\n[32] J. L. F. Barbon, J. R. Espinosa, Phys. Rev. D79, 081302 (2009). [arXiv:0903.0355 [hep-ph]].\n[33] C. P. Burgess, H. M. Lee, M. Trott, JHEP 0909, 103 (2009). [arXiv:0902.4465 [hep-ph]];\nJHEP 1007, 007 (2010) [arXiv:1002.2730 [hep-ph]].\n[34] R. N. Lerner and J. McDonald, JCAP 1004, 015 (2010) [arXiv:0912.5463 [hep-ph]].\n[35] M. P. Hertzberg, [arXiv:1002.2995 [hep-ph]].\n[36] S. Dimopoulos, S. D. Thomas, Phys. Lett. B573, 13-19 (2003). [hep-th/0307004].\n[37] K. -I. Izawa, Y. Shinbara, [arXiv:0710.1141 [hep-ph]].\n[38] G. 't Hooft, in Recent developments in gauge theories, (Plenum Press, Cargese, 1980).\n[39] S. Hannestad, T. Haugbolle, P. R. Jarnhus and M. S. Sloth, arXiv:0912.3527 [hep-ph].\n[40] M. Kawasaki, M. Yamaguchi, T. Yanagida, Phys. Rev. Lett. 85, 3572-3575 (2000).\n\n29\n\n\f[41] M. Endo, M. Kawasaki, F. Takahashi and T. T. Yanagida, Phys. Lett. B642, 518-524 (2006).\n[42] M. Fukugita and T. Yanagida, Phys. Lett. B 174, 45 (1986).\n[43] M. Endo, F. Takahashi and T. T. Yanagida, Phys. Rev. D 74, 123523 (2006)\n[arXiv:hep-ph/0611055].\n[44] M. Viel, J. Lesgourgues, M. G. Haehnelt, S. Matarrese and A. Riotto, Phys. Rev. D 71, 063534\n(2005).\n[45] S. R. Coleman, Nucl. Phys. B262, 263 (1985).\n[46] E. W. Kolb, A. Notari and A. Riotto, Phys. Rev. D 68, 123505 (2003) [arXiv:hep-ph/0307241].\n[47] M. Endo and F. Takahashi, Phys. Rev. D 74, 063502 (2006) [arXiv:hep-ph/0606075].\n[48] M. Kawasaki, K. Kohri and N. Sugiyama, Phys. Rev. Lett. 82, 4168 (1999);\nM. Kawasaki, K. Kohri and N. Sugiyama, Phys. Rev. D 62, 023506 (2000).\n[49] S. Hannestad, Phys. Rev. D 70, 043506 (2004).\n[50] K. Ichikawa, M. Kawasaki and F. Takahashi, Phys. Rev. D 72, 043522 (2005).\n[51] Z. Chacko, H. Murayama, M. Perelstein, Phys. Rev. D68, 063515 (2003). [hep-ph/0211369].\n[52] N. Seto and J. Yokoyama, J. Phys. Soc. Jap. 72, 3082 (2003).\n[53] L. A. Boyle and P. J. Steinhardt, Phys. Rev. D 77, 063504 (2008); L. A. Boyle and A. Buonanno, Phys. Rev. D 78, 043531 (2008).\n[54] K. Nakayama, S. Saito, Y. Suwa and J. Yokoyama, Phys. Rev. D 77, 124001 (2008); JCAP\n0806, 020 (2008).\n[55] S. Mukohyama, K. Nakayama, F. Takahashi and S. Yokoyama, Phys. Lett. B 679, 6 (2009).\n[56] G. M. Harry, P. Fritschel, D. A. Shaddock, W. Folkner and E. S. Phinney, Class. Quant. Grav.\n23, 4887 (2006) [Erratum-ibid. 23, 7361 (2006)].\n[57] N. Seto, S. Kawamura, T. Nakamura, Phys. Rev. Lett. 87, 221103 (2001). [astro-ph/0108011].\n[58] L. H. Ford, Phys. Rev. D35, 2955 (1987); B. Spokoiny, Phys. Lett. B315, 40-45 (1993).\n[gr-qc/9306008].\n[59] M. Kawasaki, K. Kohri and T. Moroi, Phys. Rev. D 71, 083502 (2005); Phys. Lett. B 625,\n7 (2005). M. Kawasaki, K. Kohri, T. Moroi and A. Yotsuyanagi, Phys. Rev. D 78, 065011\n(2008).\n[60] S. J. Huber, T. Konstandin, T. Prokopec and M. G. Schmidt, Nucl. Phys. B 757, 172 (2006)\n[arXiv:hep-ph/0606298].\n\n30\n\n\f"}