{"id": "http://arxiv.org/abs/1012.0714v1", "guidislink": true, "updated": "2010-12-03T12:26:19Z", "updated_parsed": [2010, 12, 3, 12, 26, 19, 4, 337, 0], "published": "2010-12-03T12:26:19Z", "published_parsed": [2010, 12, 3, 12, 26, 19, 4, 337, 0], "title": "Field enhancement at metallic interfaces due to quantum confinement", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1012.5531%2C1012.2940%2C1012.3566%2C1012.2081%2C1012.4542%2C1012.5353%2C1012.1041%2C1012.3593%2C1012.4756%2C1012.1282%2C1012.2028%2C1012.2838%2C1012.0906%2C1012.2816%2C1012.1097%2C1012.4960%2C1012.0735%2C1012.3627%2C1012.0074%2C1012.2529%2C1012.0774%2C1012.4233%2C1012.2955%2C1012.4759%2C1012.2446%2C1012.1740%2C1012.1835%2C1012.0012%2C1012.3865%2C1012.0227%2C1012.4382%2C1012.2400%2C1012.5647%2C1012.4156%2C1012.2561%2C1012.1482%2C1012.5835%2C1012.2934%2C1012.4966%2C1012.2519%2C1012.4690%2C1012.0620%2C1012.3809%2C1012.0840%2C1012.3519%2C1012.5211%2C1012.1232%2C1012.1113%2C1012.5774%2C1012.0714%2C1012.4245%2C1012.2549%2C1012.1362%2C1012.2792%2C1012.3232%2C1012.1150%2C1012.2697%2C1012.1162%2C1012.0507%2C1012.3731%2C1012.4998%2C1012.3007%2C1012.5968%2C1012.4881%2C1012.2863%2C1012.1928%2C1012.1314%2C1012.0154%2C1012.0505%2C1012.0162%2C1012.2444%2C1012.5396%2C1012.0861%2C1012.1015%2C1012.5322%2C1012.5104%2C1012.5399%2C1012.2937%2C1012.3779%2C1012.2181%2C1012.1004%2C1012.1476%2C1012.2175%2C1012.2306%2C1012.2119%2C1012.4666%2C1012.5872%2C1012.1544%2C1012.4255%2C1012.1050%2C1012.1463%2C1012.1404%2C1012.2000%2C1012.1981%2C1012.2624%2C1012.0006%2C1012.5107%2C1012.3473%2C1012.0159%2C1012.5811%2C1012.0989&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Field enhancement at metallic interfaces due to quantum confinement"}, "summary": "We point out an apparently overlooked consequence of the boundary conditions\nobeyed by the electric displacement vector at air-metal interfaces: the\ncontinuity of the normal component combined with the quantum mechanical\npenetration of the electron gas in the air implies the existence of a surface\non which the dielectric function vanishes. This, in turn, leads to an\nenhancement of the normal component of the total electric field. We study this\neffect for a planar metal surface, with the inhomogenous electron density\naccounted for by a Jellium model. We also illustrate the effect for equilateral\ntriangular nanoislands via numerical solutions of the appropriate Maxwell\nequations, and show that the field enhancement is several orders of magnitude\nlarger than what the conventional theory predicts.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1012.5531%2C1012.2940%2C1012.3566%2C1012.2081%2C1012.4542%2C1012.5353%2C1012.1041%2C1012.3593%2C1012.4756%2C1012.1282%2C1012.2028%2C1012.2838%2C1012.0906%2C1012.2816%2C1012.1097%2C1012.4960%2C1012.0735%2C1012.3627%2C1012.0074%2C1012.2529%2C1012.0774%2C1012.4233%2C1012.2955%2C1012.4759%2C1012.2446%2C1012.1740%2C1012.1835%2C1012.0012%2C1012.3865%2C1012.0227%2C1012.4382%2C1012.2400%2C1012.5647%2C1012.4156%2C1012.2561%2C1012.1482%2C1012.5835%2C1012.2934%2C1012.4966%2C1012.2519%2C1012.4690%2C1012.0620%2C1012.3809%2C1012.0840%2C1012.3519%2C1012.5211%2C1012.1232%2C1012.1113%2C1012.5774%2C1012.0714%2C1012.4245%2C1012.2549%2C1012.1362%2C1012.2792%2C1012.3232%2C1012.1150%2C1012.2697%2C1012.1162%2C1012.0507%2C1012.3731%2C1012.4998%2C1012.3007%2C1012.5968%2C1012.4881%2C1012.2863%2C1012.1928%2C1012.1314%2C1012.0154%2C1012.0505%2C1012.0162%2C1012.2444%2C1012.5396%2C1012.0861%2C1012.1015%2C1012.5322%2C1012.5104%2C1012.5399%2C1012.2937%2C1012.3779%2C1012.2181%2C1012.1004%2C1012.1476%2C1012.2175%2C1012.2306%2C1012.2119%2C1012.4666%2C1012.5872%2C1012.1544%2C1012.4255%2C1012.1050%2C1012.1463%2C1012.1404%2C1012.2000%2C1012.1981%2C1012.2624%2C1012.0006%2C1012.5107%2C1012.3473%2C1012.0159%2C1012.5811%2C1012.0989&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We point out an apparently overlooked consequence of the boundary conditions\nobeyed by the electric displacement vector at air-metal interfaces: the\ncontinuity of the normal component combined with the quantum mechanical\npenetration of the electron gas in the air implies the existence of a surface\non which the dielectric function vanishes. This, in turn, leads to an\nenhancement of the normal component of the total electric field. We study this\neffect for a planar metal surface, with the inhomogenous electron density\naccounted for by a Jellium model. We also illustrate the effect for equilateral\ntriangular nanoislands via numerical solutions of the appropriate Maxwell\nequations, and show that the field enhancement is several orders of magnitude\nlarger than what the conventional theory predicts."}, "authors": ["Z. Fatih Öztürk", "Sanshui Xiao", "Min Yan", "Martijn Wubs", "Antti-Pekka Jauho", "Niels Asger Mortensen"], "author_detail": {"name": "Niels Asger Mortensen"}, "author": "Niels Asger Mortensen", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1117/1.3574159", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1012.0714v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1012.0714v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "cond-mat.mes-hall", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.mes-hall", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "physics.optics", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1012.0714v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1012.0714v1", "arxiv_comment": null, "journal_reference": "J. Nanophoton. 5, 051602 (2011)", "doi": "10.1117/1.3574159", "fulltext": "arXiv:1012.0714v1 [cond-mat.mes-hall] 3 Dec 2010\n\nField enhancement at metallic interfaces due to\nquantum confinement\nZ. Fatih Öztürk,a,b Sanshui Xiao,a Min Yan,a,c Martijn Wubs,a\nAntti-Pekka Jauho,d,e and N. Asger Mortensena\na\n\nDepartment of Photonics Engineering, Technical University of\nDenmark, DK-2800 Kongens Lyngby, Denmark\nb Istanbul Technical University, Istanbul, Turkey\nc Laboratory of Photonics and Microwave Engineering, Royal Institute of\nTechnology, Sweden\nd Department of Applied Physics, Aalto University, Finland\ne Department of Micro and Nanotechnology, Technical University of\nDenmark, DK-2800 Kongens Lyngby, Denmark\n\nAbstract. We point out an apparently overlooked consequence of the boundary conditions\nobeyed by the electric displacement vector at air-metal interfaces: the continuity of the normal\ncomponent combined with the quantum mechanical penetration of the electron gas in the air\nimplies the existence of a surface on which the dielectric function vanishes. This, in turn, leads\nto an enhancement of the normal component of the total electric field. We study this effect\nfor a planar metal surface, with the inhomogenous electron density accounted for by a Jellium\nmodel. We also illustrate the effect for equilateral triangular nanoislands via numerical solutions\nof the appropriate Maxwell equations, and show that the field enhancement is several orders of\nmagnitude larger than what the conventional theory predicts.\nKeywords: Nanoplasmonics, field enhancement, Friedel oscillations, zero-epsilon phenomena\n\n1 INTRODUCTION\nElectromagnetic field enhancement in nanoplasmonic structures plays an important role in a\nnumber of applications such as nano antennas [1, 2], single-photon emitters [3], and surfaceenhanced spectroscopy techniques in general [4], including surface-enhanced Raman spectroscopy (SERS) [5]. Field localization is the key to understanding and further enhancing the\nresolution of SERS, and the use of highly engineered surface plasmonic structures has been\nenvisioned [6, 7]. Strong field enhancement has so far been inherently connected to singularities [8].\nIt is commonplace to study the plasmonic response using Maxwell's equations with the bulk\ndielectric function of the metal, with an abrupt change at the air-metal interface [9]. Though\nclearly neglecting surface and confinement effects for the electrons in the metal, this is a celebrated approximation which predicts the existence of surface plasmons forming the heart of\nnanoplasmonics. However, when samples involve true nano-scale feature-sizes, the validity of\nthis approximation is challenged and new phenomena, such as non-local response and spatial\ndispersion [10–17] and inhomogeneous electron densities due to quantum confinement [18, 19]\nare expected to play an important role.\nSend correspondence to N.A.M.: asger@mailaps.org\n\n\fIn nanoscale metallic structures the electrons are subject to quantum confinement, which\nleads to a number of spectacular effects, such as the quantized conductance of atomic quantumpoint contacts [20], Friedel oscillations and confinement of electrons to quantum corrals on\nnoble metal surfaces [21], and a size-dependent structure of nanocrystals [22]. Light emission\nfrom STM has been used to reveal plasmonic properties of electrons confined to triangular\nislands on surfaces of noble metals [23]. All these studies clearly show that, at least at low\ntemperatures, quantum confinement plays an important role leading to inhomogeneous electron\ndensities at interfaces that differ from the piecewise constant bulk values.\n\n2 FROM BULK APPROXIMATION TO A LOCAL DENSITY\nAPPROXIMATION\nThe qualitative optical consequences of an inhomogeneous electron density can be explored\nwithin Lindhard's \"local density approximation\" for the dielectric function [24, 25]\nǫ(r, ω) = 1 −\n\nωp2\nΠ(r)\nω(ω + iγ)\n\n(1)\n\nwhere Π(r) = n(r)/n0 accounts for the density variations relative to the bulk density of electrons n0 = mωp2 /e2 , with ωp being the bulk plasma frequency. To mimic the Ohmic damping\nwe have included a damping rate γ and in the optical regime γ ≪ ω [26]. While several\nstudies have considered the consequences of local density variations for the surface-plasmon\ndispersion relation, the overall effects have√been reported to be minor and for planar surfaces\nthe surface-plasmon resonance at ω = ωp / 2 appears unaffected by the detailed density profile at the metal-air surface [27]. However, it remains an open question to which extent the\ndetailed field distribution will be affected by a smoothly varying electron density in contrast to\nthe discontinuous drop in the electron density assumed by the bulk approximation.\nZero-index phenomena in metamaterials are receiving increasing attention [28–33], and the\nrecent results by Litchinitser et al. [34] show that for a metamaterial with the effective constitutive coefficients varying linearly, ǫ(z) ∝ z and μ(z) ∝ z, a pronounced field enhancement will\noccur at z = 0 where ǫ = μ = 0. In this paper we show that plasmonic structures employing\nNature's own metals may support large field enhancement at the zero-ǫ surface appearing in the\nvicinity of the air-metal interface, where the real part of the polarization of the dilute electron\ngas will exactly balance the polarization of the vacuum background. As shown below, the particular position of the zero-ǫ surface depends on the frequency ω of the incident radiation, and\nmay be either in air or in the metal, depending on the local geometry.\n\n3 PHENOMENOLOGY OF FIELD ENHANCEMENT\nThe basic mechanism behind the field enhancement can be understood from the continuity\ncondition for the electrical displacement field, which stipulates that n * D = ǫ(n * E) be\ncontinuous (here n is the normal vector of a surface element). At the zero-ǫ surface the normal\ncomponent E⊥ = n * E thus has to diverge to keep the product ǫE⊥ finite.\nFrom Eq. (1) it follows that in the regions where Re(ǫ) vanishes, there will still be a small,\nbut finite imaginary part: Im(ǫ)Re(ǫ)=0 = γ/ω. For an electrical field E 0 incident at an angle θ\nwe thus expect that the normal component n*E 0 = E0 sin θ is enhanced by a factor proportional\nto 1/γ on the zero-ǫ surface. The intensity enhancement can then be estimated as\n2\u000e\n2\nE\nE 0 ∝ sin2 θ/γ 2\n(2)\nWe emphasize that this mechanism of field-enhancement is generic and robust as it only depends\non the assumed continuous negative-to-positive variation of the dielectric function at the metalair interface, in combination with a Maxwell boundary condition [35], rather than on the details\nof the excitation of strongly localized surface-plasmon resonances with pronounced sample-tosample fluctuations.\n\n\f4 EXAMPLE 1: JELLIUM MODEL FOR THE METAL SURFACE\nThe low-temperature density profile for Jellium is a function of rs /a0 only, with the radius\nof the free-electron sphere rs = (3/4πn0 )1/3 and a0 = ~2 /me2 being the Bohr radius. The\nposition-dependent electron density may be obtained self-consistently with the aid of densityfunctional theory [36], thus taking into account both exchange and correlation effects in the\ninhomogeneous electron gas. In Ref. [36], results are tabulated for a range of values of rs /a0 .\nThe resulting density n(z) is shown in Fig. 1(a) for rs /a0 = 2, a typical value for gold or silver.\nAs seen, Π(z) = n(z)/n0 varies continuously on the length scale of the Fermi wavelength\nrather than exhibiting a discontinuous drop at the surface of the metal (z = 0). In the metal\n(z > 0), there are Friedel oscillations near the surface, while for z < 0 the decay of the density\nis caused by the finite value of the work function W , which allows electron wave functions to\npenetrate into the classically forbidden region. According to Eq. (1), the dielectric function will\ninherit the Friedel oscillations in the metal, as well as approach the value in vacuum outside the\nmetal surface. As a consequence, the dielectric function passes through zero just outside the\nmetal surface [green line in Fig. 1(a)]. Similar spatial variations of the dielectric function have\nbeen reported in more elaborate studies of e.g. semiconductor quantum dots [37] and recently\nalso in doped semiconductors [38].\nIn the case of λ = 2πc/ω = 633 nm the zero-ǫ surface appears at a distance of 0.25 nm\nfrom the surface (z = 0). Fig. 1(b) illustrates the field enhancement in the case of a plane\nwave incident at an angle of θ = 60◦ . The numerical results were obtained by solving the wave\nequation\nω2\n∇ × ∇ × E(r) = ǫ(r, ω) 2 E(r)\n(3)\nc\nwith the aid of a finite-element method employing an adaptive mesh algorithm (Comsol MultiPhysics). A comparison with ǫ(z) in Fig. 1 (a) shows that the field enhancement indeed occurs\nat the point where ǫ = 0. We emphasize that this phenomenon has no counterpart within the\nclassical bulk approximation of the dielectric function. For a realistic value of the damping\n(γ = 1 × 1014 rad/s) the intensity may be enhanced by more than 3 orders of magnitude,\nwhich suggests that in a SERS experiment the Raman signal could be enhanced by 6 orders\nof magnitude [39] without the need for any geometry-induced localized resonances. To further\ntest the predictions of Eq. (2) we have explored the dependence on the angle of incidence as\nwell as the particular value of the plasmon damping. Fig. 2 (a) illustrates how the peak height\ndepends on damping. The enhancement is limited by the plasmonic damping with the slope of\nthe dashed lines being in full accordance with the power (-2) of γ in Eq. (2). Panel (b) illustrates\nthe angle dependence with the dashed line showing the sin2 θ dependence of Eq. (2), indicating\na pronounced enhancement for oblique incidence.\n\n5 EXAMPLE 2: A METALLIC NANOSTRUCTURE\nWe next explore the field enhancement in the presence of strong confinement of electrons in\nmetallic nanostructures. Here we limit ourselves to a model of non-interacting electrons in wire\ngeometries with nanoscale cross sections Ω so that the problem effectively is two-dimensional.\n~2 2\nκ + Eν with the transThe energy states of the electron system are then given by E (κ) = 2m\nverse energy components being quantized and governed by a two-dimensional Schrödinger\nequation\n\u0014\n\u0015\n~2 2\n−\n∇ + V (x, y) ψν (x, y) = Eν ψν (x, y).\n(4)\n2m xy\nFor the confinement potential V we adjust the height in accordance with the work function of\nthe metal W = V0 −μ, where μ is the chemical potential. In equilibrium the states are populated\n\n\faccording to the Fermi–Dirac distribution function and we find\n\u0010\n\u0011\nP\nEν −μ\nP\nA ψν (x, y)\nν\nkB T\nn(x, y)\n\u0010\n\u0011\nΠ(x, y) ≡\n=\nP\nn0\nP Eν −μ\nν\n\n2\n\n(5)\n\nkB T\n\nR\nwhere A = Ω dxdy is area and P (x) = Li1/2 [− exp(−x)] with Lin (x) being Jonquiére's\npolylogarithm function. Equilateral triangular nano islands have been the subject of numerous\ninvestigations [40,41] and in Fig. 3 we consider field enhancement in such a structure. Fig. 3(a)\nshows results within the bulk approximation, where an artificial rounding of the corners has\nbeen added to circumvent the effect of an otherwise divergent electrical field [7]. Clearly, field\nenhancement is modest since no pronounced surface plasmon resonances are excited. Fig. 3(b)\non the other hand is based on the spatially continuously varying dielectric function of Eqs. (1)\nand (5) and shows a pronounced field enhancement along the zero-ǫ surface. We also note that\nwhile the geometry has arbitrarily sharp corners, the electron density and dielectric function\nthemselves are still smooth, showing that quantum confinement provides a built-in smoothing\neven in the presence of sharp geometrical features. Fig. 4(a) and (b) show in more detail the\nfield enhancement along the lines indicated in Fig. 3(b). For the results in Fig. 4(b), the peak\nheight clearly matches the one-dimensional results in panel (b) of Fig. 2 for an incident angle\nof θ = 30◦ . Similarly, the result within the bulk approximation resembles typical results, see\ne.g. Ref. [35], i.e. the field enhancement is more modest. In Fig. 4(a), the incident wave propagates almost parallel to the zero-ǫ surface (θ ∼ 90◦ ), thus causing a peak that is even higher at\nthe two right-most corners of the triangle. On the other hand, at the left-most corner the wave\nhas normal impact on the zero-ǫ surface (θ = 0◦ ) so that no pronounced field enhancement is\nobserved. It is interesting to note that the enhancement may occur either outside [as in Fig. 1(b)]\nor inside [as in Fig. 3(b)] the metal, depending on the local geometry and the frequency relative\nto the plasma frequency.\n\n6 CONCLUSIONS\nWe predict that a large non-resonant field enhancement may occur at zero-epsilon surfaces near\nthe air-metal interface. Theoretically, the enhancement occurs in a wide class of models where\nthe discontinuous jump of the dielectric function of the usual bulk description of at an air-metal\ninterface is replaced by a continuous function ε(r, ω) that has the bulk values as limiting values\naway from the interface. We discussed two microscopic models for such a continuous variation\nat the interface. The predicted field enhancement has therefore no counterpart in the classical\nbulk treatment of plasmonic field enhancement, though it is intimately related to the familiar\nboundary condition for the electrical displacement field. In particular, for light impinging on an\ninterface we discussed the dependence of the field enhancement on the angle of incoming light\nand on the damping in the metal. Furthermore, the enhancement constitutes another mechanism\nfor the enhancement of Raman signals at metal interfaces (SERS).\nInterestingly, Feigenbaum et al. have recently reported their experimental observation of\nzero-index driven field enhancement at the surface of conducting oxides (i.e. with lower electron\ndensity compared to good metals) [38]. We emphasize that the decay of the electron density\ninto vacuum (or more generally into a dielectric) could have important implications also for\nnano-gap structures (such as the gap formed between the corners of two nearby triangles [40]),\nwhere quantum tunneling of electrons will introduce a small but finite electron density inside the\ngap, thus also modifying the local dielectric function and the ability to support short-circuiting\ncurrents [19].\n\n\fAcknowledgments\nWe thank Peter Nordlander, Natalia M. Litchinitser, and Vladimir M. Shalaev for useful discussions. This work is financially supported by the Danish Council for Strategic Research through\nthe Strategic Program for Young Researcher (grant no: 2117-05-0037), the Danish Research\nCouncil for Technology and Production Sciences (grants no: 274-07-0080 & 274-07-0379), as\nwell as the FiDiPro program of the Finnish Academy.\n\n\fReferences\n[1] P. Mühlschlegel, H.-J. Eisler, O. J. F. Martin, B. Hecht, and D. W. Pohl, \"Resonant optical\nantennas,\" Science 308(5728), 1607 – 1609 (2005).\n[2] L. Novotny, \"Effective wavelength scaling for optical antennas,\" Phys. Rev. Lett. 98(26),\n266802 (2007).\n[3] D. E. Chang, A. S. Sørensen, E. A. Demler, and M. D. Lukin, \"A single-photon transistor\nusing nanoscale surface plasmons,\" Nat. Phys. 3(11), 807 – 812 (2007).\n[4] M. Moskovits, \"Surface-enhanced spectroscopy,\" Rev. Mod. Phys. 57(3), 783 – 826\n(1985).\n[5] M. Fleischmann, P. J. Hendra, and A. J. McQuillan, \"Raman-spectra of pyridine adsorbed\nat a silver electrode,\" Chem. Phys. Lett. 26(2), 163 – 166 (1974).\n[6] S. Lal, S. Link, and N. J. Halas, \"Nano-optics from sensing to waveguiding,\" Nat. Phot.\n1(11), 641 – 648 (2007).\n[7] S. Xiao, N. A. Mortensen, and A.-P. Jauho, \"Nanostructure design for surface-enhanced\nRaman spectroscopy-prospects and limits,\" J. Europ. Opt. Soc. Rap. Public. 3, 08022\n(2008).\n[8] Y. Luo, J. B. Pendry, and A. Aubry, \"Surface plasmons and singularities,\" Nano Lett.\n10(10), 4186 – 4191 (2010).\n[9] S. A. Maier, Plasmonics: Fundamentals and Applications, Springer, New York (2007).\n[10] J. Lindhard, \"On the properties of a gas of charged particles,\" Mat. Fys. Medd. Dan. Vid.\nSelsk. 28(8), 1 – 57 (1954).\n[11] A. D. Boardman, B. V. Paranjape, and Y. O. Nakamura, \"Surface plasmon-polaritons in\na spatially dispersive inhomogeneous medium,\" Phys. Stat. Solid. (b) 75(1), 347 – 359\n(1976).\n[12] B. B. Dasgupta and R. Fuchs, \"Polarizability of a small sphere including nonlocal effects,\"\nPhys. Rev. B 24(2), 554–561 (1981).\n[13] R. Chang and P. T. Leung, \"Nonlocal effects on optical and molecular interactions with\nmetallic nanoshells,\" Phys. Rev. B 73(12), 125438 (2006).\n[14] F. J. Garcı́a de Abajo, \"Nonlocal effects in the plasmons of strongly interacting nanoparticles, dimers, and waveguides,\" J. Phys. Chem C 112(46), 17983–17987 (2008).\n[15] J. M. McMahon, S. K. Gray, and G. C. Schatz, \"Nonlocal optical response of metal nanostructures with arbitrary shape,\" Phys. Rev. Lett. 103(9), 097403 (2009).\n[16] J. M. McMahon, S. K. Gray, and G. C. Schatz, \"Calculating nonlocal optical properties of\nstructures with arbitrary shape,\" Phys. Rev. B 82(3), 035423 (2010).\n[17] J. M. McMahon, S. K. Gray, and G. C. Schatz, \"Optical properties of nanowire dimers\nwith a spatially nonlocal dielectric function,\" Nano Lett. 10(9), 3473–3481 (2010).\n[18] J. Zuloaga, E. Prodan, and P. Nordlander, \"Quantum description of the plasmon resonances\nof a nanoparticle dimer,\" Nano Lett. 9(2), 887 – 891 (2009).\n[19] O. Perez-Gonzalez, N. Zabala, A. G. Borisov, N. J. Halas, P. Nordlander, and J. Aizpurua,\n\"Optical spectroscopy of conductive junctions in plasmonic cavities,\" Nano Lett. 10(8),\n3090 – 3095 (2010).\n[20] A. I. Yanson, G. R. Bollinger, H. E. van den Brom, N. Agraı̈t, and J. M. van Ruitenbeek,\n\"Formation and manipulation of a metallic wire of single gold atoms,\" Nature 395(6704),\n783 – 785 (1998).\n[21] M. F. Crommie, C. P. Lutz, and D. M. Eigler, \"Confinement of electrons to quantum corrals\non a metal surface,\" Science 262(5131), 218–220 (1993).\n[22] J. V. Lauritsen, J. Kibsgaard, S. Helveg, H. Topsøe, B. S. Clausen, E. Laegsgaard, and\nF. Besenbacher, \"Size-dependent structure of MoS2 nanocrystals,\" Nat. Nanotechnol. 2(1),\n53 – 58 (2007).\n\n\f[23] G. Schull, M. Becker, and R. Berndt, \"Imaging confined electrons with plasmonic light,\"\nPhys. Rev. Lett. 101(13), 136801 (2008).\n[24] J. Lindhard and M. Scharff, \"Energy loss in matter by fast particles of low charge,\" Mat.\nFys. Medd. Dan. Vid. Selsk. 27(15), 1 – 31 (1953).\n[25] H. Nitta, S. Shindo, and M. Kitagawa, \"Classical theory of the dielectric function for an\ninhomogeneous electron gas,\" Surf. Sci. 286(3), 346 – 354 (1993).\n[26] Our qualitative conclusions do not change if a more sophisticated form for the dielectric\nfunction is adopted, such as the charge-conserving form due to N. D. Mermin, Phys. Rev.\nB 1(5), 2362 (1970).\n[27] A. Boardman, B. Paranjape, and R. Teshima, \"The effect of structure on surface plasmons,\" Surf. Sci. 49(1), 275 – 292 (1975).\n[28] N. Garcı́a, E. V. Ponizovskaya, and J. Q. Xiao, \"Zero permittivity materials: Band gaps at\nthe visible,\" Appl. Phys. Lett. 80(7), 1120–1122 (2002).\n[29] M. Silveirinha and N. Engheta, \"Tunneling of electromagnetic energy through subwavelength channels and bends using epsilon-near-zero materials,\" Phys. Rev. Lett. 97(15),\n157403 (2006).\n[30] Q. Cheng, R. Liu, D. Huang, T. J. Cui, and D. R. Smith, \"Circuit verification of tunneling\neffect in zero permittivity medium,\" Appl. Phys. Lett. 91(23), 234105 (2007).\n[31] R. Liu, Q. Cheng, T. Hand, J. J. Mock, T. J. Cui, S. A. Cummer, and D. R. Smith, \"Experimental demonstration of electromagnetic tunneling through an epsilon-near-zero metamaterial at microwave frequencies,\" Phys. Rev. Lett. 100(2), 023903 (2008).\n[32] B. Edwards, A. Alù, M. E. Young, M. Silveirinha, and N. Engheta, \"Experimental verification of epsilon-near-zero metamaterial coupling and energy squeezing using a microwave\nwaveguide,\" Phys. Rev. Lett. 100(3), 033903 (2008).\n[33] R. J. Pollard, A. Murphy, W. R. Hendren, P. R. Evans, R. Atkinson, G. A. Wurtz, A. V.\nZayats, and V. A. Podolskiy, \"Optical nonlocalities and additional waves in epsilon-nearzero metamaterials,\" Phys. Rev. Lett. 102(12), 127405 (2009).\n[34] N. M. Litchinitser, A. I. Maimistov, I. R. Gabitov, R. Z. Sagdeev, and V. M. Shalaev,\n\"Metamaterials: electromagnetic enhancement at zero-index transition,\" Opt. Lett. 33(20),\n2350–2352 (2008).\n[35] T. Søndergaard and S. I. Bozhevolnyi, \"Slow-plasmon resonant nanostructures: Scattering\nand field enhancements,\" Phys. Rev. B 75(7), 073402 (2007).\n[36] N. D. Lang and W. Kohn, \"Theory of metal surfaces: Charge density and surface energy,\"\nPhys. Rev. B 1(12), 4555–4568 (1970).\n[37] X. Cartoixa and L. W. Wang, \"Microscopic dielectric response functions in semiconductor\nquantum dots,\" Phys. Rev. Lett. 94(23), 236804 (2005).\n[38] E. Feigenbaum, K. Diest, and H. A. Atwater, \"Unity-order index change in transparent\nconducting oxides at visible frequencies,\" Nano Lett. 10(6), 2111–2116 (2010).\n[39] F. J. Garcı́a-Vidal and J. B. Pendry, \"Collective theory for surface enhanced Raman scattering,\" Phys. Rev. Lett. 77(6), 1163 – 1166 (1996).\n[40] A. Sundaramurthy, P. J. Schuck, N. R. Conley, D. P. Fromm, G. S. Kino, and W. E.\nMoerner, \"Toward nanometer-scale optical photolithography: Utilizing the near-field of\nbowtie optical nanoantennas,\" Nano Lett. 6(3), 355–360 (2006).\n[41] J. Nelayah, M. Kociak, O. Stéphan, F. J. Garcı́a de Abajo, M. Tencé, L. Henrard, D. Taverna, I. Pastoriza-Santos, L. M. Liz-Marzán, and C. Colliex, \"Mapping surface plasmons\non a single metallic nanoparticle,\" Nat. Phys. 3(5), 348–353 (2007).\n\n\f1.0\nω2\n0.8 ǫ(z) = 1 − ωp2 Π(z)\n0.6\n0.4\n0.2 Π(z) = n(z)/n0\n0.0\n-1.5\n-1.0 -0.5\n4\n\n(a)\n\n0.0\n\n0.5\n\n1.0\n\n1.5\n\nθ = 60◦\n\nlog E\n\n2\u000e\n\nE0\n\n2\u0001\n\n3\n2\n\nθ\n\n1\nz\n\nE0\n\n0\n-1\n\n(b)\n\n-2\n-1.5\n\n-1.0\n\n-0.5\n\n0.0\n\n0.5\n\n1.0\n\n1.5\n\nz (nm)\nFig. 1. (a) The blue line shows the position dependent electron density within the Jellium model\n(rs /a0 = 2). The green line shows the corresponding derived dielectric function. (b) The field\nenhancement for a plane wave incident on the surface at an angle of θ = 60◦ , for λ = 633 nm,\nωp = 1.37 × 1016 rad/s, and γ = 1.0 × 1014 rad/s.\n\n\f3.5\n\n¡ ̄  ̄2  ̄  ̄2 ¢\nlog  ̄E  ̄ / ̄E 0  ̄\n\n3.0\n\n75◦\n\n2.5\n2.0\n\nθ = 30◦\n1.5\n1.0\n\n(a)\n1.0\n\n1.5 2.0\n\n3.0\n\nγ/γ0\n\n5.0\n\n7.0\n\n10.0\n\n0.50\n\n1.00\n\n3.5\n\n¡ ̄  ̄2  ̄  ̄2 ¢\nlog  ̄E  ̄ / ̄E 0  ̄\n\n3.0\n\nθ\n\n2.5\n2.0\n\nz\n\nE0\n\n1.5\n1.0\n0.5\n\n(b)\n0.0\n0.01 0.02\n\n0.05\n\n0.10 0.20\nsin(θ)\n\nFig. 2. (a) Maximal field enhancement as a function of damping for parameters of Fig. 1(b).\nThe dashed lines indicate a γ −2 dependence. (b) The peak height as a function of incident angle\nfor γ = 1.0 × 1014 rad/s. The dashed line indicates a sin2 θ dependence, Eq.(2).\n\n\fE0\n\nλ = 633 nm\n\n0\n10\n\nnm\n\n4\n\n3\n\n2\n\n1\n(a)\n\nrs /a0 ≃ 3\n0\nr1\nr3\n\nr2\n\n−1\n\nr4\n−2\n\n−3\n(b)\n\nW/μ ≃ 1.6,\n\nkB T /μ ≃ 10−3\n\nFig. 3. (a) Intensity enhancement (log scale) for a wave incident from the left on a metallic\nequilateral triangle, computed with the bulk dielectric function, but with rounded corners (radius\nof 5 nm). (b) Field enhancement for the inhomogeneous density. Field profiles along the lines\nr1 → r2 and r3 → r4 are shown in Fig. 4.\n\n\f4\n\n2\n\n2\n\n0\n\n0\n\n-2\n\n2\n\n¡ ̄  ̄2 ± ̄  ̄2 ¢\nlog  ̄E  ̄  ̄E 0  ̄\n\n4\n\n-4\n\n(a)\nr1\n\n(b)\nr2 r3\n4\n\nr4\n\nFig. 4. Field enhancement along the lines defined in Fig. 3. (a) r1 → r2 . (b) r3 → r4 . Note that\nthe integrated density is the same for the two structures in Fig. 3, thus causing slightly different\ndensities and field suppression inside the metal structures (compare dashed and solid lines for\nthe inhomogeneous and homogeneous cases, respectively).\n\n\f"}