{"id": "http://arxiv.org/abs/1204.2488v3", "guidislink": true, "updated": "2013-09-26T14:50:57Z", "updated_parsed": [2013, 9, 26, 14, 50, 57, 3, 269, 0], "published": "2012-04-11T16:13:58Z", "published_parsed": [2012, 4, 11, 16, 13, 58, 2, 102, 0], "title": "Search for anomalous t t-bar production in the highly-boosted\n  all-hadronic final state", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1204.5216%2C1204.4207%2C1204.5875%2C1204.0967%2C1204.2037%2C1204.2007%2C1204.6629%2C1204.4365%2C1204.3349%2C1204.4329%2C1204.1285%2C1204.6192%2C1204.0443%2C1204.3073%2C1204.3258%2C1204.1956%2C1204.6213%2C1204.3896%2C1204.4506%2C1204.6272%2C1204.2595%2C1204.6725%2C1204.2440%2C1204.5480%2C1204.3853%2C1204.4164%2C1204.4444%2C1204.5819%2C1204.3045%2C1204.3784%2C1204.6534%2C1204.0648%2C1204.4724%2C1204.5481%2C1204.5309%2C1204.3131%2C1204.5326%2C1204.2488%2C1204.1490%2C1204.0992%2C1204.5717%2C1204.0411%2C1204.1075%2C1204.5019%2C1204.6509%2C1204.1917%2C1204.2401%2C1204.6240%2C1204.2544%2C1204.4964%2C1204.5885%2C1204.2014%2C1204.3213%2C1204.6087%2C1204.3526%2C1204.1247%2C1204.6727%2C1204.6017%2C1204.5120%2C1204.4284%2C1204.6064%2C1204.5497%2C1204.2669%2C1204.2237%2C1204.5055%2C1204.2999%2C1204.5066%2C1204.1535%2C1204.1175%2C1204.4213%2C1204.2038%2C1204.0551%2C1204.6613%2C1204.4924%2C1204.4282%2C1204.5932%2C1204.1550%2C1204.5888%2C1204.5610%2C1204.0565%2C1204.4280%2C1204.3927%2C1204.5202%2C1204.4711%2C1204.2756%2C1204.4435%2C1204.1517%2C1204.5964%2C1204.1107%2C1204.4523%2C1204.5871%2C1204.5171%2C1204.4741%2C1204.2652%2C1204.3556%2C1204.1173%2C1204.0345%2C1204.0122%2C1204.0491%2C1204.6055%2C1204.0873&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Search for anomalous t t-bar production in the highly-boosted\n  all-hadronic final state"}, "summary": "A search is presented for a massive particle, generically referred to as a\nZ', decaying into a t t-bar pair. The search focuses on Z' resonances that are\nsufficiently massive to produce highly Lorentz-boosted top quarks, which yield\ncollimated decay products that are partially or fully merged into single jets.\nThe analysis uses new methods to analyze jet substructure, providing\nsuppression of the non-top multijet backgrounds. The analysis is based on a\ndata sample of proton-proton collisions at a center-of-mass energy of 7 TeV,\ncorresponding to an integrated luminosity of 5 inverse femtobarns. Upper limits\nin the range of 1 pb are set on the product of the production cross section and\nbranching fraction for a topcolor Z' modeled for several widths, as well as for\na Randall--Sundrum Kaluza--Klein gluon. In addition, the results constrain any\nenhancement in t t-bar production beyond expectations of the standard model for\nt t-bar invariant masses larger than 1 TeV.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1204.5216%2C1204.4207%2C1204.5875%2C1204.0967%2C1204.2037%2C1204.2007%2C1204.6629%2C1204.4365%2C1204.3349%2C1204.4329%2C1204.1285%2C1204.6192%2C1204.0443%2C1204.3073%2C1204.3258%2C1204.1956%2C1204.6213%2C1204.3896%2C1204.4506%2C1204.6272%2C1204.2595%2C1204.6725%2C1204.2440%2C1204.5480%2C1204.3853%2C1204.4164%2C1204.4444%2C1204.5819%2C1204.3045%2C1204.3784%2C1204.6534%2C1204.0648%2C1204.4724%2C1204.5481%2C1204.5309%2C1204.3131%2C1204.5326%2C1204.2488%2C1204.1490%2C1204.0992%2C1204.5717%2C1204.0411%2C1204.1075%2C1204.5019%2C1204.6509%2C1204.1917%2C1204.2401%2C1204.6240%2C1204.2544%2C1204.4964%2C1204.5885%2C1204.2014%2C1204.3213%2C1204.6087%2C1204.3526%2C1204.1247%2C1204.6727%2C1204.6017%2C1204.5120%2C1204.4284%2C1204.6064%2C1204.5497%2C1204.2669%2C1204.2237%2C1204.5055%2C1204.2999%2C1204.5066%2C1204.1535%2C1204.1175%2C1204.4213%2C1204.2038%2C1204.0551%2C1204.6613%2C1204.4924%2C1204.4282%2C1204.5932%2C1204.1550%2C1204.5888%2C1204.5610%2C1204.0565%2C1204.4280%2C1204.3927%2C1204.5202%2C1204.4711%2C1204.2756%2C1204.4435%2C1204.1517%2C1204.5964%2C1204.1107%2C1204.4523%2C1204.5871%2C1204.5171%2C1204.4741%2C1204.2652%2C1204.3556%2C1204.1173%2C1204.0345%2C1204.0122%2C1204.0491%2C1204.6055%2C1204.0873&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "A search is presented for a massive particle, generically referred to as a\nZ', decaying into a t t-bar pair. The search focuses on Z' resonances that are\nsufficiently massive to produce highly Lorentz-boosted top quarks, which yield\ncollimated decay products that are partially or fully merged into single jets.\nThe analysis uses new methods to analyze jet substructure, providing\nsuppression of the non-top multijet backgrounds. The analysis is based on a\ndata sample of proton-proton collisions at a center-of-mass energy of 7 TeV,\ncorresponding to an integrated luminosity of 5 inverse femtobarns. Upper limits\nin the range of 1 pb are set on the product of the production cross section and\nbranching fraction for a topcolor Z' modeled for several widths, as well as for\na Randall--Sundrum Kaluza--Klein gluon. In addition, the results constrain any\nenhancement in t t-bar production beyond expectations of the standard model for\nt t-bar invariant masses larger than 1 TeV."}, "authors": ["CMS Collaboration"], "author_detail": {"name": "CMS Collaboration"}, "author": "CMS Collaboration", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1007/JHEP09(2012)029", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1204.2488v3", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1204.2488v3", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "Submitted to the Journal of High Energy Physics; this version\n  includes a minor typo correction that will be submitted as an erratum", "arxiv_primary_category": {"term": "hep-ex", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "hep-ex", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1204.2488v3", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1204.2488v3", "journal_reference": "JHEP 09 (2012) 029", "doi": "10.1007/JHEP09(2012)029", "fulltext": "EUROPEAN ORGANIZATION FOR NUCLEAR RESEARCH (CERN)\n\nCERN-PH-EP/2012-077\n2013/09/27\n\nCMS-EXO-11-006\n\narXiv:1204.2488v3 [hep-ex] 26 Sep 2013\n\nSearch for anomalous tt production in the highly-boosted\nall-hadronic final state\nThe CMS Collaboration∗\n\nAbstract\nA search is presented for a massive particle, generically referred to as a Z0 , decaying\ninto a tt pair. The search focuses on Z0 resonances that are sufficiently massive to\nproduce highly Lorentz-boosted top quarks, which yield collimated decay products\nthat are partially or fully merged into single jets. The analysis uses new methods to\nanalyze jet substructure, providing suppression of the non-top multijet backgrounds.\nThe analysis is based on a data sample of proton-proton collisions at a center-of-mass\nenergy of 7 TeV, corresponding to an integrated luminosity of 5 fb−1 . Upper limits in\nthe range of 1 pb are set on the product of the production cross section and branching fraction for a topcolor Z0 modeled for several widths, as well as for a Randall–\nSundrum Kaluza–Klein gluon. In addition, the results constrain any enhancement in\ntt production beyond expectations of the standard model for tt invariant mass larger\nthan 1 TeV/c2 .\n\nPublished in the Journal of High Energy Physics as doi:10.1007/JHEP09(2012)029.\n\nc 2013 CERN for the benefit of the CMS Collaboration. CC-BY-3.0 license\n∗ See\n\nAppendix A for the list of collaboration members\n\n\f\f1\n\n1\n\nIntroduction\n\nAmong scenarios for physics beyond the standard model (SM) are possibilities of new gauge\ninteractions with large couplings to third-generation quarks [1–11]. These interactions predict\nnew massive states, generically referred to as Z0 bosons, that can decay into tt pairs. Typical\nexamples are the topcolor Z0 described in Refs. [4–6], and the Randall–Sundrum Kaluza–Klein\n(KK) gluons of Ref. [12]. Other models [13–16] have recently been proposed to resolve the\ndiscrepancy in the forward-backward asymmetry in tt production reported at the Tevatron\n[17–21]. Model-independent studies of the implications of a large forward-backward asymmetry suggest that a strong enhancement of the production cross section for tt pairs would be\nexpected at the Large Hadron Collider (LHC) for invariant masses mtt > 1 TeV/c2 , if the observed discrepancy with the predictions of the standard model (SM) is due to new physics at\nsome large mass scale [22, 23]. Searches for new physics in top-pair production have been performed at the Tevatron [24–26], and provide the most stringent lower limits on the mass (mZ0 )\nof narrow-width (ΓZ0 ) resonances, e.g. excluding a topcolor tt resonance with ΓZ0 /mZ0 = 1.2%\nfor masses below ≈ 0.8 TeV/c2 .\nIn this Letter, several models of resonant tt production are considered, including a Z0 resonance with a narrow width of 1% of the mass, a Z0 resonance with a moderate width of 10%\nof the mass, as well as broader KK gluon (g0 ) states [12]. An enhancement over tt continuum\nproduction at large tt invariant masses is also considered.\nThis study examines decays of produced tt pairs in the all-hadronic channel, taking advantage\nof the large (46%) branching fraction of tt → W+ bW− b → 6 quarks, and focuses on final states\nwith mtt > 1 TeV/c2 . For lower masses, the background from quantum-chromodynamic (QCD)\nproduction of non-top multijet events makes the search prohibitively difficult in this channel.\nAt high mtt , using new techniques in jet reconstruction to identify jet substructure [27–31], it is\npossible to study highly boosted top quarks (E/mt c2 > 2, where E and mt are the energy and\nmass of the top quark). The decay products of these highly boosted top quarks are collimated,\nand are partially or fully merged into single jets with several separate subjets corresponding\nto the final-state quarks (one from the bottom quark, and two light-flavor quarks from the\nW decay). The data sample corresponds to an integrated luminosity of 5 fb−1 collected by the\nCompact Muon Solenoid (CMS) experiment [32] in proton-proton collisions at a center-of-mass\nenergy of 7 TeV at the LHC.\nIn the following Letter, Sec. 2 describes the CMS detector and the event reconstruction. Section 3 explains the strategy for the analysis and the derivation of the efficiency and misidentification probability of the substructure tools that were used. Section 4 gives the systematic\nuncertainties in the analysis. Section 5 describes the statistical methodology used. Section 6\npresents a summary of the results.\n\n2\n\nCMS detector, event samples, and preselection\n\nThe CMS detector is a general-purpose detector that uses a silicon tracker, as well as finely segmented lead-tungstate crystal electromagnetic (ECAL) and brass/scintillator hadronic (HCAL)\ncalorimeters. These subdetectors have full azimuthal coverage and are contained within the\nbore of a superconducting solenoid that provides a 3.8 T axial magnetic field. The CMS detector uses a polar coordinate system with the polar angle θ defined relative to the direction (z)\nof the counterclockwise proton beam. The pseudorapidity η is defined as η = − ln tan(θ/2),\nE+ p c\nwhich agrees with the rapidity y = 21 ln E− pzz c for objects of negligible mass, where E is the energy and pz is the longitudinal momentum of the particle. Charged particles are reconstructed\n\n\f2\n\n2\n\nCMS detector, event samples, and preselection\n\nin the tracker for |η | < 2.5. The surrounding ECAL and HCAL provide coverage for photon, electron, and jet reconstruction for |η | < 3. The CMS detector also has extensive forward\ncalorimetry that is not used in this analysis. Muons are measured in gas-ionization detectors\nembedded in the steel return yoke outside the solenoid.\nEvents were selected with an online trigger system, with decisions based on the transverse\nmomentum (pT ) of a single jet measured in the calorimeters. The instantaneous luminosity\nincreased with time, hence two thresholds were used for different running periods. Most of\nthe data were collected with a threshold of jet pT > 300 GeV/c, and the rest with a threshold of\n240 GeV/c. Offline, one jet is required to satisfy pT > 350 GeV/c.\nThere are several Monte Carlo (MC) simulated samples in the analysis. The continuum SM tt\nbackground is simulated with the M AD E VENT/M AD G RAPH 4.4.12 [33] and PYTHIA 6.4.22 [34]\nevent generators. The M AD G RAPH generator is also used to model generic high-mass resonances decaying to SM top pairs. In particular, a model is implemented with a Z0 that has\nSM-like fermion couplings and mass between 1 and 3 TeV/c2 . However, in the MC generation\nof the Z0 , only decays to tt are simulated. The width of the resonance is set to 1% and 10% of mZ0 ,\nso as to check the predictions for a narrow and a moderate resonance width, respectively. Here,\nthe 10% width is comparable to the detector resolution. The PYTHIA 8.145 event generator [35]\nis used to generate Randall–Sundrum KK gluons with masses mg0 = 1, 1.5, 2, and 3 TeV/c2 , and\nwidths of ≈ 0.2mg0 . These Randall–Sundrum gluons have branching fractions to tt pairs of 0.93,\n0.92, 0.90, and 0.87, respectively. PYTHIA6 is also used to generate non-top multijet events for\nbackground studies, cross-checks, and for calculating correction factors. The CTEQ6L [36] parton distribution functions (PDF) are used in the simulation. The detector response is simulated\nusing the CMS detector simulation based on G EANT 4 [37].\nEvents are reconstructed using the particle-flow algorithm [38], which identifies all reconstructed observable particles (muons, electrons, photons, charged and neutral hadrons) in an\nevent by combining information from all subdetectors. Event selection begins with removal of\nbeam background by requiring that events with at least 10 tracks have at least 25% of the tracks\nsatisfying high-purity tracking requirements [39]. The events must have a well-reconstructed\nprimary vertex, and only charged particles identified as being consistent with the highest Σp2T\ninteraction vertex are considered, reducing the effect of multiple interactions per beam crossing\n(pile-up) by ≈ 60%.\nThe selected particles, after removal of charged hadrons from pile-up and isolated leptons, are\nclustered into jets using the Cambridge-Aachen (CA) algorithm with a distance parameter of\nR = 0.8 in η-φ space, where φ is the azimuthal angle [40, 41], as implemented in the FASTJ ET software package version 2.4.2 [42, 43]. The CA algorithm sequentially merges into single\nobjects, by four-vector addition, the pairs\np of particle clusters that are closest in the distance\nmeasure dij = ∆R2ij /R2 , where ∆Rij = (∆η )2 + (∆φ)2 and R = 0.8, until the minimum is less\nthan or equal to the so-called beam distance diB , which equals unity in the CA algorithm. More\n2n\n2\n2\n2n\ngenerally these distance measures are equal to dij = min( pT 2n\ni , pT j ) ∆Rij /R and diB = pT i .\nIn the more common cases of the kT and anti-kT algorithms [44], n = 1 and n = −1, respectively, however for the CA algorithm n = 0, and hence only angular information is used in\nthe clustering. When the beam distance for particle cluster i is smaller than all of the other dij ,\nparticle cluster i is identified as a jet and the clustering proceeds for the remaining particles\nin the event. Jet energy scale corrections are applied as documented in Ref. [45]. All jets are\nrequired to satisfy jet-quality criteria [38], as well as |y| < 2.5. The rapidity is used in this case\nbecause the jets acquire a finite mass as part of the imposed jet-quality criteria.\n\n\f3\n\n3\n\nAnalysis method\n\nThe analysis is designed for cases in which the tt system has sufficient energy for the decay\nproducts of each top quark to be emitted into a single hemisphere, implying that E/mt c2 >\n2. As a consequence, the top quarks can be either partially merged when only the W decay\nproducts are merged into a single jet, or fully merged when all top decay products are merged\ninto a single jet. Thus, this analysis becomes inefficient for low masses, and upper limits are\nnot evaluated for Z0 masses below 1 TeV/c2 .\nThe largest background in this search is the non-top multijet (NTMJ) background. This is\nhighly suppressed by requirements on the jet mass and substructure. The remaining NTMJ\nbackground is estimated by computing the probability for non-top jets to pass the top-jet selections (misidentification probability) in control regions of the data. These control regions\nare constructed by inverting substructure selections while keeping mass selections fixed. This\nmistagging probability is then applied to the signal region to estimate the contribution from\nthe NTMJ background.\nIn this section, the jet topologies in the analysis are defined in Sec. 3.1, the signal estimate is\ndescribed in Sec. 3.2, and the background estimate is shown in Sec. 3.3. Finally, the results of\nthe event selection and the background estimate are presented in Sec. 3.4.\n\n3.1\n\nAnalysis of jet topologies\n\nThe events are classified into two categories, depending on the number of final-state jets that\nappear in each hemisphere. The 1+1 channel comprises dijet events in which each jet corresponds to a fully merged top-quark candidate, denoted as a Type-1 top-quark candidate. The\n1+2 channel comprises trijet events that fail the 1+1 criteria, with a Type-1 top-quark candidate\nin one hemisphere, and at least two jets in the other, one being a jet from a b quark (although no\nidentification algorithms are applied) and the other a merged jet from a W. These two separate\njets define a Type-2 top-quark candidate in the 1+2 channel. Further channels, such as 2+2,\nwhich would correspond to two Type-2 top quarks, are not considered in this analysis. The\n1+1 and 1+2 selections are now discussed in detail.\nThe 1+1 events are required to have at least two Type-1 top-quark candidates, each reconstructed with pT > 350 GeV/c. Both candidates are tagged by a top-tagging algorithm [27, 28]\nto define merged top jets. In the case of more than two top-tagged jets, the two top-tagged jets\nwith the highest pT are considered. The top-tagging algorithm is based on the decomposition\nof a jet into subjets, by reversing the final steps of the CA jet-clustering sequence. In this decomposition, particles that have small pT or are at large angles relative to the parent cluster are\nignored. At least three subjets are required in each jet. While the subjets of generic jets tend to\nbe close together, and one of them often dominates the jet energy because of gluon emission\nin the final state, the decay products of the top quark share the jet energy more equally and\nemerge at wider angles. The mass of the summed four-vector of the constituents of the hard\njet must be consistent with the mass of a top quark mt ≈ 175 GeV/c2 (140 < mjet < 250 GeV/c2 ,\nwhere the values chosen are optimized through MC simulation). Figure 1a shows the expected\njet mass for the Z0 signal from MC as a dotted histogram, and the expected jet mass for the\nNTMJ background from MC as a solid yellow histogram. As expected, the Z0 signal has a\npeak at the top mass corresponding to fully merged top jets, and has a shoulder at the W mass\ncorresponding to partially merged top jets. The minimum pairwise invariant mass of the three\nsubjets of highest pT is required to be > 50 GeV/c2 , because the combination with the minimum\npairwise mass often (> 60%) consists of the jet remnants from the W decay.\n\n\f4\n\n3\n\nAnalysis method\n\nThe 1+2 events are required to have exactly one hemisphere containing a top-tagged Type-1\ncandidate with pT > 350 GeV/c. That is, only events that fail the 1+1 criteria are considered\nfor the 1+2 selection. In the hemisphere opposite the top-tagged Type-1 candidate, there must\nbe at least two jets, one identified as a W-jet candidate, with pT > 200 GeV/c, and another jet\nfrom a b quark (although no identification algorithm is used) with pT > 30 GeV/c. The W jet\nis required to be tagged by a W-tagging algorithm, based on the jet pruning technique [29, 30].\nThe W-tagging algorithm requires two subjets, a total jet mass consistent with the mass of\nthe W boson mW = 80.4 GeV/c2 (60 < mjet < 100 GeV/c2 ), and an acceptable \"mass-drop\"\nparameter μ of the final subjets relative to the hard jet [31]. The mass-drop μ is defined as\nthe ratio of the mass of the more massive subjet m1 to the mass of the complete jet mjet , and\nis required to be smaller than 40% (m1 /mjet ≡ μ < 0.4). This selection helps to discriminate\nagainst generic jets, which usually have larger μ values. The W-jet and b-jet candidates combine\nto form the Type-2 top-quark candidate, whose mass must be consistent with that of the top\nquark (140 < mjet < 250 GeV/c2 , where the values chosen are optimized using MC simulation).\nWhen there are more than two jets in the Type-2 hemisphere, the b-quark candidate is taken as\nthe one closest to the W-tagged jet in η-φ space.\nThe jet-pruning technique used to select W jets removes a portion of the jet, which is not accounted by the ordinary jet energy scale corrections. The jet corrections used in this analysis\nare derived from unpruned jets, and the impact on pruned jets is therefore investigated using\na dijet MC sample. In particular, the pT of reconstructed pruned jets are compared to the pT\nof matched generator-level particle jets, that also underwent the pruning procedure, and the\ndifference of 2–3% observed in absolute response suggests a systematic uncertainty in the jet\nenergy from this source. An uncorrelated 3% uncertainty is therefore added to the uncertainties for standard jet energy corrections. This uncertainty is applied for both the top-tagging and\njet-pruning algorithms, and is added in quadrature to the general jet energy scale corrections\nof Ref. [45], which are ≈ 2–4%, depending on pT and rapidity.\n\n3.2\n\nSignal efficiency\n\nFor both the Z0 signal and the (subdominant) tt background, the efficiencies of the analysis\nselection are estimated from Monte Carlo simulation, with scale factors to account for measured\ndifferences with respect to the data. Figure 1b shows the efficiency for tagging a true top jet as\na function of pT . Above ≈ 500 GeV/c, the efficiency plateaus between 50–60%.\nThree scale factors are applied to the efficiency. The first scale factor is used to correct for the\ntrigger in simulated signal events. Its value is equal to the trigger efficiency: it rises from ≈ 75%\n(60%) for 1+1 (1+2) events at mtt = 1.0 TeV/c2 and becomes fully efficient for mtt > 1.5 TeV/c2 .\nThe value of the trigger efficiency is estimated per jet on a sample of simulated NTMJ events\npassing the top-quark candidate selections, it is then applied to simulated signal events. The\nsystematic uncertainty is assigned to be 50% of the trigger inefficiency from MC. The difference\nbetween the measured trigger efficiency in data and MC is roughly in this range, but suffers\nfrom large statistical uncertainties. The second scale factor is used to correct for any differences\nin jet-energy scale for the subjets and for the full jets. This is referred to as the subjet jet-energy\nscale factor. The third scale factor is used to correct for the impact of any differences between\ndata and MC in efficiencies for finding jets with substructure. This is referred to as the subjet\nselection-efficiency scale factor. The derivation of the second and third scale factors is now\ndiscussed in detail.\nThese second two scale factors are both determined in a control sample comprising events with\na single muon (referred to as the muon control sample), usually from the decay of t → Wb,\n\n\f3.2\n\n5\n\nSignal efficiency\n\nProbability / 5 GeV/c2\n\nCMS Simulation, s = 7 TeV\n0.07\n\nZ'→ t t MC\n\n0.06\n\nNon-top multijet MC\n\n0.05\n0.04\n0.03\n0.02\n0.01\n0\n0\n\n50\n\n100\n\n150\n\n200\n\n250\n\n300\n\n350\n\n400\n\nm(top jet) (GeV/c2)\n\nTop Mistag Rate\n\n(a)\n\n1\n\nCMS, L = 5 fb-1 at\n\ns = 7 TeV\n\n10-1\n\n10-2\nMC Signal Efficiency\nMistag Probability\n\n10-3\n400\n\n600\n\n800\n\n1000 1200 1400 1600 1800 2000\n\nJet p (GeV/c)\nT\n\n(b)\n\nFigure 1: (a) The simulated jet mass for NTMJ MC (light yellow histogram) and Z0 MC (open\nhistogram). (b) The type-1 per-jet top-tagging efficiency for Z0 MC events is shown as red\nsquares with error bars (see Sec. 3.2), and the type-1 per-jet mistag probability for top tagging\nmeasured in data is shown as black circles with error bars (see Sec. 3.3), both as a function of\njet pT .\n\n\f6\n\n3\n\nAnalysis method\n\nwith W → μν, and at least two jets. The event selection is nearly identical to that in Ref. [46],\nexcept for larger pT requirements for the jets. The leading jet is required to satisfy pT > 200\nGeV/c, and the sub-leading jet is required to satisfy pT > 30 GeV/c. Due to a small number of\nfully-merged (Type-1) top jets in this sample, it is not possible to construct a sufficiently large\nnumber of true Type-1 top jets. Instead, the characterization of jets with substructure is studied\nwith moderately-boosted tt events where there is a large fraction of partially-merged (Type-2)\ntop-quark candidates and the W-jets within them.\nThe events in the muon control sample used to study W-tagging are dominated by tt decays,\nand the leading-jet pT requirement (> 200 GeV/c) favors the topology in which the two top\nquarks are produced back-to-back, thereby facilitating jet merging on the side of the \"hadronic\"\ntop quark, containing jets from t → Wb → qq0 b. In the other hemisphere, these events contain\none isolated muon, consistent with originating from the primary collision vertex, with pT >\n45 GeV/c and |η | < 2.1. Events are rejected if they contain other isolated electrons or muons\nwithin |η | < 2.1 with pT > 15 GeV/c or pT > 10 GeV/c, respectively. The remaining events are\nthen required to have ≥ 2 jets with pT > 30 GeV/c, and at least one jet with pT > 200 GeV/c.\nUnlike the all-hadronic channel discussed in this Letter, in the muon control sample, there are\ntwo well-separated jets originating from b quarks, so in order to enhance the tt fraction of this\ncontrol region, the events are required to contain at least one jet tagged with a secondary-vertex\nb-tagging algorithm [47], also used in Ref. [46]. The b-tagging algorithm combines at least two\ntracks into at least one secondary vertex, and forms a discriminating variable based on the\nthree-dimensional decay length of the vertex.\nThe subjet jet-energy scale factor is estimated by extracting a W mass peak in the muon control\nsample, and comparing the peaks in data and MC. The mass distribution of the jet of largest\nmass in the hadronic hemisphere is shown in Fig. 2a.\nIn this figure, the MC tt contribution is normalized to the approximate next-to-next-to-leadingorder (NNLO) cross section for inclusive tt production of 163 pb [48–50]. The non-W mulitjet\ncomponent is based on sidebands in data that have the muon isolation criterion reversed. The\ncontributing spectrum is normalized through a fit to the missing transverse energy. The stringent criteria of this analysis provide very few W+jets events that pass the required selections.\nThis distribution is therefore taken to be the same as that of the generic non-W multijet background. This is acceptable because the mass structure within the candidate top-quark jets are\nvery similar in these two samples, and the sideband data has many more events that pass the\nselection criteria. The W+jets contribution is normalized to the inclusive W production cross\nsection of σW→`+ν = 31.3 ± 1.6 nb computed at NNLO with FEWZ [51]. A fit of the sum of two\nGaussian functional forms to data is given by the solid line, and a similar fit to the simulated\nevents is shown as a dashed line. The centers of the main Gaussian distributions in data and\n2\nMC are mDATA\n= 83.0 ± 0.7 GeV/c2 and mMC\nW\nW = 82.5 ± 0.3 GeV/c , respectively. The subjet jetenergy scale factor for W jets is determined by taking the ratio of these two values, and equals\n1.01 ± 0.01, including statistical uncertainty only.\nThe subjet selection-efficiency scale factor is estimated by comparing the observed selection\nefficiency in the muon control sample in data and MC. The ratio of the number of events in\nthe W mass window (60 < mjet < 100 GeV/c2 ) in Fig. 2a, after W tagging, to the number of\nevents in the muon control sample, defines the W selection efficiency within the mass window.\nDATA = 0.49 ± 0.01 and eMC = 0.50 ± 0.01, respectively.\nFor data and MC the values are em\nmW\nW\nSimilarly, the mass-drop selection is checked in data and Monte Carlo, following the W-mass\nwindow selection, and a similar efficiency is extracted, with the observed values being eμDATA =\n0.64 ± 0.01 and eμMC = 0.64 ± 0.01. Combining efficiencies of the mass-drop and mass selections,\n\n\f3.3\n\nBackground estimate\n\n7\n\nthe subjet selection-efficiency scale factor, to be applied to the MC to obtain the same efficiency\nas in data, is determined to be 0.97 ± 0.03. The same scale factor and uncertainty are assumed\nfor Type-1 jets, which is consistent with results from the statistics-limited control sample of\nmuon events that contain Type-1 jets. As two top-quark tags are required in each event, the\ncorrection for both 1+1 and 1+2 events is the square of the single-tag scale factor, yielding\n0.94 ± 0.06.\nThe Type-1 jet selection cannot be checked at the same level of precision as the W-jet selection\nbecause of the small number of Type-1 jets in the muon control sample. However, the Type-2\ntop-quark candidate selection can be tested in the muon control sample, as shown in Fig. 2b.\nThe same procedure is used to construct these Type-2 top-quark candidates as in the 1+2 selection, including the W-mass and mass-drop selections. Within the statistical uncertainty, good\nagreement is observed in the data and simulation. Since the selection of Type-2 top-quark candidates considers a boosted three-body decay as well as a W tag, the agreement between the\ncharacteristics of candidates in data and in MC provides further confidence for the assumption\nthat the scale factor for the efficiency of W-tagging is appropriate for three-body decays such\nas the Type-1 top-quark system.\nTo check the dependability of our assumption, namely that the data-to-MC scale factors are\nthe same for the muon control sample as for the Z0 signal, the scale factor is measured in a\ncontrol sample using more stringent kinematic requirements to select a part of phase space\nsimilar to that of a Z0 signal with m ∼ 1 TeV/c2 . The b-tagging requirement is dropped in order\nto collect more tt events. Also, to capture the kinematics of the background, instead of using\nthe distribution for W+jets from the sidebands in data without isolated muon candidates, as is\ndone in the fit to the W mass, the distribution for W+jets is taken instead from the W+jets MC.\nIn all samples with large pT thresholds, the data-to-MC scale factor is found to be consistent\nwith the measured value of 0.97 ± 0.03. The selection that provides sideband regions most\nsimilar in kinematics to that of the signal region is a requirement that the Type-2 top candidate\nsatisfy pT > 400 GeV/c. Fig. 3a shows the pT distribution for the Type-2 candidates in the muon\ncontrol sample, and Fig. 3b shows the pT of the W-jet within the Type-2 top-quark candidate,\nas defined by the jet of largest mass in the event. Arbitrarily normalized distributions for a Z0\nsignal with m = 1 TeV/c2 are overlaid for comparison. For completeness, Figs. 4a and 4b show\nplots identical to Figs. 2a and 2b, but with selections that require Type-2 top-quark candidates\nwith pT > 400 GeV/c. The scale factor extracted from this higher-pT subsample is 0.99 ± 0.11,\nwhich is consistent with the quoted data-to-MC scale factor of 0.97 ± 0.03.\n\n3.3\n\nBackground estimate\n\nSince this analysis focuses on signatures with high-pT jets, the main backgrounds expected are\nfrom SM non-top multijet production and tt production. The background from NTMJ production is estimated from sidebands in the data as described below. For the Z0 masses considered\nin this analysis, the irreducible SM tt component is significantly smaller than the NTMJ background contribution, and is therefore estimated from MC simulation using the same correction\nfactors as found for the Z0 MC described in Sec. 3.2. It is normalized to the approximate NNLO\ncross section described in Sec. 3.2.\nIn both 1+1 and 1+2 channels, estimates of the dominant NTMJ background are obtained from\ndata as follows. First, the probability is estimated for mistaking a non-top jet as a top-quark jet\nthrough the top-tagging algorithm. This procedure defines the mistag probability (Pm ). Higher\nmomentum jets have a larger probability to radiate gluons, and as the jet pT increases, they\nare more likely to have top-like substructure and thereby satisfy a top tag [52]. The mistag\n\n\f8\n\n3\n\nEvents / 5 GeV/c2\n\n-1\n\nCMS, L = 5 fb at\n\nAnalysis method\n\ns = 7 TeV\n\n180\n160\n\nmDATA\n= 83.0 ± 0.7 GeV/c2\nW\n\n140\n\nmMC\n= 82.5 ± 0.3 GeV/c2\nW\n\n120\n\nData\ntt\nW+Jets\nNon-W MJ\nData fit\nMC fit\n\n100\n80\n60\n40\n20\n0\n0\n\n20\n\n40\n\n60\n\n80\n\n100 120 140 160 180 200\n\nm(W-jet) (GeV/c2)\n(a)\n\nEvents / 10 GeV/c2\n\n-1\n\nCMS, L = 5 fb at\n\ns = 7 TeV\n\n120\n100\nData\ntt\nW+Jets\nNon-W MJ\n\n80\n60\n40\n20\n0\n0\n\n100\n\n200\n\n300\n\n400\n\n500\n\n600\n\nm(W+b) (GeV/c2)\n(b)\n\nFigure 2: (a) The mass of the highest-mass jet (W-jet), and (b) the mass of the Type-2 top candidate (W + b), in the hadronic hemisphere of moderately-boosted events in the muon control\nsample. The data are shown as points with error bars, the tt Monte Carlo events in dark red,\nthe W+jets Monte Carlo events in lighter green, and non-W multijet (non-W MJ) backgrounds\nare shown in light yellow (see Ref. [46] for details of non-W MJ distribution derivation). The\njet mass is fitted to a sum of two Gaussians in both data (solid line) and MC (dashed line), the\nlatter of which lies directly behind the solid line for most of the region.\n\n\f3.3\n\n9\n\nBackground estimate\n\nEvents / 10 GeV/c\n\n-1\n\n140\n\nCMS, L = 5 fb at\n\ns = 7 TeV, Leading pT > 200 GeV/c\nData\ntt\nW+Jets\nNon-W MJ\nZ' (1 TeV), arb. norm.\n\n120\n100\n80\n60\n40\n20\n0\n0\n\n100\n\n200\n\n300\n\n400\n\n500\n\n600\n\np (W+b) (GeV/c)\nT\n\n(a)\n\nEvents / 10 GeV/c\n\n-1\n\nCMS, L = 5 fb at\n220\n200\n180\n160\n140\n120\n100\n80\n60\n40\n20\n0\n0\n\ns = 7 TeV, Leading pT > 200 GeV/c\nData\ntt\nW+Jets\nNon-W MJ\nZ' (1 TeV), arb. norm.\n\n100\n\n200\n\n300\n\n400\n\n500\n\n600\n\np (W-jet) (GeV/c)\nT\n\n(b)\n\nFigure 3: (a) pT of the Type-2 top-quark candidate in the muon control sample. The color\nscheme is the same as in Figs. 2a and 2b. (b) pT of the W-candidate from within the Type-2 topquark candidate, after a selection on the jet mass of the highest-mass jet in the muon control\nsample. Overlaid on both (a) and (b) are the corresponding distributions from a Z0 MC signal\nwith m = 1 TeV/c2 (with arbitrary normalization for visualization) to compare kinematics in\nthe muon control region to the signal region.\n\n\f10\n\n3\n\nEvents / 5 GeV/c2\n\n-1\n\n24\n22\n20\n18\n16\n14\n12\n10\n8\n6\n4\n2\n0\n0\n\nCMS, L = 5 fb at\nData\ntt\nW+Jets\nNon-W MJ\nData fit\nMC fit\n\n20\n\n40\n\nAnalysis method\n\ns = 7 TeV, pT(W+b) > 400 GeV/c\nmDATA\n= 80.1 ± 3.2 GeV/c2\nW\nmMC\n= 81.7 ± 1.0 GeV/c2\nW\n\n60\n\n80\n\n100 120 140 160 180 200\n\nm(W-jet) (GeV/c2)\n(a)\n\nEvents / 10 GeV/c2\n\n-1\n\n14\n\nCMS, L = 5 fb at\n\ns = 7 TeV, pT(W+b) > 400 GeV/c\n\n12\n10\nData\ntt\nW+Jets\nNon-W MJ\n\n8\n6\n4\n2\n0\n0\n\n100\n\n200\n\n300\n\n400\n\n500\n\n600\n\nm(W+b) (GeV/c2)\n(b)\n\nFigure 4: (a) The mass of the highest-mass jet (W-jet), and (b) the mass of the Type-2 top candidate (W + b), in the hadronic hemisphere of moderately-boosted events in the muon control\nsample. The Figure corresponds to Figs. 2a and 2b, except there is an additional requirement on\nthe Type-2 top candidate pT to be similar to the signal region. Figure 3a shows the distribution\nof the Type-2 top candidate pT .\n\n\f3.3\n\n11\n\nBackground estimate\n\nprobability is therefore obtained as a function of total jet pT , using the following procedure.\nEvents with ≥ 3 jets are selected for the 1+2 topology, with the three leading jets in the event\nrequired to pass pT thresholds of 350, 200, and 30 GeV/c, respectively, without any requirements\nplaced on the jet mass of the Type-1 candidate. The mass of the W-boson candidate within the\nType-2 candidate is required to fall within the W-boson mass window, and the invariant mass\nof the Type-2 candidate is required to fall within the top-quark mass window. However, the\nmass-drop requirement is inverted (μ > 0.4) to define a signal-depleted sideband. The small\ncontribution from the SM tt continuum is subtracted using MC expectation, and the mistag\nprobability Pm ( pT ) is defined by the fraction of Type-1 candidates that are top-tagged, as a\nfunction of their pT . The resulting mistag probability appears in Fig. 1b.\nNext, the 1+2 and 1+1 samples are defined using a loose selection: (i) in trijet events, two jets in\none hemisphere are required to pass the Type-2 selection and (ii) in dijet events, one randomlychosen jet is required to pass the Type-1 selection. In both cases, the other high-pT jet in the\nevent (the probe jet) is not required to be top-tagged. These samples are dominated by NTMJ\nevents. For each event in the loose selection (i), the probability that the event would pass the\ni\nfull selection in the signal region (PNTMJ\n) equals the mistag probability (Pm ( pT )), evaluated at\ni\nthe pT of the probe jet in event i (pT ),\ni\nPNTMJ\n= Pm ( pTi ).\n\n(1)\n\nThe total number of NTMJ events (NNTMJ ) is then equal to the sum of the weights from Eq. 1.\nNloose\n\nNNTMJ =\n\n∑\n\ni =1\n\ni\nPNTMJ\n=\n\nNloose\n\n∑\n\nPm ( pTi ),\n\n(2)\n\ni =1\n\nwhere Nloose is the number of events passing the loose selection and the other quantities are\ndefined above.\nThe ensemble of jets in the loose pretagged region have, on average, a lower jet mass than\nthe jets in the signal region. Consequently, the mtt spectrum in this sideband is kinematically\nbiased. To emulate the event kinematics of the signal region, the jet mass of the probe jet is\nignored, and instead it is set to a value randomly drawn from the distribution of jet masses of\nprobe jets from NTMJ MC events in the range 140 to 250 GeV/c2 .\nThis procedure is cross-checked on a NTMJ MC sample to ensure that the methodology achieves\nclosure. In this cross-check, half of the events in the MC are used to derive a mistag probability using the above procedure, and then used to predict the expected number of tags for the\nremaining events, which is compared to the observed number of tags in these events. The\nobserved and expected number of tags agree within statistical uncertainties.\nPossible biases in the calibration procedure from the presence of a new Z0 have also been investigated in the analysis. For instance, a Z0 signal with mZ0 = 3 TeV/c2 and a width of 30 GeV/c2\ncontributes less than 1% to the events defined through the loose selection criteria as well as to\nthe sideband regions used to determine the probability of mistagging jets.\nThe uncertainty on this procedure is taken as half the difference between the mtt distributions\nobtained using the modified and unmodified probe-jet masses. Two choices of alternative prior\ndistributions for the probe-jet mass were investigated, the MC-based prior described above,\nand a flat prior. The systematic uncertainty estimated with the current method is slightly more\nconservative.\n\n\f12\n\n3\n\nAnalysis method\n\nTable 1: The number of events observed in the loose selection (Nloose ), which is used as input\nto compute the number of events predicted in the signal region for the mistagged NTMJ background (NNTMJ ). Both appear in Eq. 2 and are described in detail in Sec. 3.3. Figure 1b shows\nthe value Pm ( pT ) used in Eq. 2. For NNTMJ , the first and second uncertainties are statistical and\nsystematic, respectively.\nmtt =0.9–1.1 TeV/c2\nmtt =1.3–2.4 TeV/c2\n1+1\n1+2\n1+1\n1+2\nNloose\n22015\n70545\n18401\n30253\nNNTMJ 443 ± 4 ± 22 1239 ± 6 ± 31 741 ± 6 ± 30 817 ± 6 ± 36\n\nTable 2: Expected and observed number of events in two different tt mass windows for the 1+1\nand 1+2 samples. The expected SM tt is taken from MC predictions, and the expected NTMJ\nbackground is derived in Table 1.\nmtt =0.9–1.1 TeV/c2\nmtt =1.3–2.4 TeV/c2\n1+1\n1+2\n1+1\n1+2\nExpected SM tt events\n69 ± 36\n110 ± 62\n65 ± 42\n24 ± 15\nExpected non-top multijet events 443 ± 23 1239 ± 32 741 ± 32 817 ± 38\nTotal expected events\n512 ± 43 1349 ± 70 806 ± 53 841 ± 41\nObserved events\n506\n1383\n809\n841\nTable 1 provides an estimate for the mistagged NTMJ background for two tt mass windows:\n0.9–1.1 TeV/c2 and 1.3–2.4 TeV/c2 . The first row corresponds to the number of events observed\nin the loose selection (Nloose from Eq. 2) to which the mistag probability is applied. The second\nrow corresponds to the number of expected events from the mistagged NTMJ background in\nthe signal region (NNTMJ in Eq. 2). As can be observed in Table 1, the primary uncertainty on the\nNTMJ background is from the systematic uncertainty assigned to the procedure for modifying\nprobe-jet masses.\n\n3.4\n\nResults of event selection\n\nObserved mtt distributions for 1+1 and 1+2 events in data are compared to the expected backgrounds in Fig. 5. The NTMJ background expectation determined from data is given by the\nyellow (light) filled histograms. The SM tt estimate is shown as red (dark) filled histograms,\nand the data are shown as solid black points. The hatched gray regions indicate the total uncertainty on the backgrounds. Figure 5 also shows for comparison the signal expectation from\nMC for several hypothetical Z0 signals with masses from 1 to 3 TeV/c2 with a width of 1%, in\nthe 1+1 and 1+2 samples, but with cross sections taken from the expected limits discussed in\nSec. 5.1.\nFrom Fig. 5, it is clear that the dominant background in this analysis is from NTMJ events\nrather than from SM tt production. The implementation of b-quark selections has not as yet\nbeen introduced to improve the sensitivity of this search, and must await an improvement in\nperformance of b-tagging in merged top jets.\nTo demonstrate the components of the background estimate, Table 2 lists the number of events\nexpected from background sources in the 1+1 and 1+2 channels, along with the observed number of events, for two tt mass windows: from 0.9–1.1 TeV/c2 , and 1.3–2.4 TeV/c2 . The systematic\nuncertainties on these values are now summarized in Sec. 4.\n\n\f3.4\n\n13\n\nResults of event selection\n\nEvents / 100 GeV/c2\n\nCMS, L = 5 fb-1, s = 7 TeV\n\nType 1+1\nObserved\nNon-top multijet\nt t simulation\nStat. ⊕ sys. bkgd uncert.\nZ'(1 TeV/c2) σ = 1.0 pb\nZ'(1.5 TeV/c2) σ = 0.18 pb\nZ'(2 TeV/c2) σ = 0.06 pb\nZ'(3 TeV/c2) σ = 0.03 pb\n\n102\n\n10\n\n2\n500\n\nNσ\n\n0.5\n1000 1500 2000 2500 3000 3500 4000\n4500 5000\nNσ\n\ntt mass\n(GeV/c2)\n(Data-Pred)/Pred\n\n1\n0\n\n0\n\n-1\n-2\n500\n\n1000\n\n1500\n\n2000\n\n2500\n\n3000\n\n3500\n\n4000\n\n4500\n\n-0.5\n5000\n\nData − Predicted\nPredicted\n\n1\n\ntt mass (GeV/c2)\n\n(a)\n\nEvents / 100 GeV\n\nCMS, L = 5 fb-1, s = 7 TeV\n\nType 1+2\n\n3\n\n10\n\nObserved\nNon-top multijet\ntt simulation\nStat. ⊕ sys. bkgd uncert.\nZ'(1 TeV/c2) σ = 1.0 pb\nZ'(1.5 TeV/c2) σ = 0.18 pb\nZ'(2 TeV/c2) σ = 0.06 pb\n\n102\n\n10\n\nNσ\n\n2\n500\n1\n0\n\n0.5\n1000 1500 2000 2500 3000 3500 4000\n4500 5000\nNσ\n\ntt mass\n(GeV/c2)\n(Data-Pred)/Pred\n\n0\n\n-1\n-2\n500\n\n1000\n\n1500\n\n2000\n\n2500\n\n3000\n\n3500\n\n4000\n\n4500\n\n-0.5\n5000\n\nData − Predicted\nPredicted\n\n1\n\ntt mass (GeV/c2)\n\n(b)\n\nFigure 5: Results for (a) 1+1 and (b) 1+2 event selections and background estimates. The yellow\n(light) histograms are the non-top multijet (NTMJ) estimates from data, as described in the\ntext, and the red (dark) histograms are the MC estimates from SM tt production. The black\npoints are the data. The hatched gray boxes combine the statistical and systematic uncertainties\non the total background. For comparison, expectations for some Z0 hypotheses are shown\nfor the assumption of 1% resonance width, with cross sections taken from the expected limits\ndiscussed in Sec. 5.1. Also shown are the ratio of the fractional difference between the data and\nthe prediction, shown in red circles, with the y-axis on the right of the plot, and the number of\nstandard deviations (Nσ ) of the observation from the prediction, shown as a black histogram\nwith the y-axis on the left of the plot, where the binning is adjusted to have at least 20 events in\neach bin.\n\n\f14\n\n4\n\n5\n\nStatistical treatment\n\nSystematic uncertainties\n\nThe sources of systematic uncertainty on the tt invariant mass spectrum fall into three categories: (i) the determination of the efficiency, (ii) the mistag probability, and (iii) the shape of\nthe tt invariant-mass distribution. Several sources of systematic uncertainties can simultaneously affect these three categories, and in such cases, any changes in parameters have to be\nvaried in a correlated way. The uncertainties on efficiency include uncertainties in the overall\njet-energy scale for tagged jets (≈ 2–4% from standard jet energy corrections, ≈ 3% from the\napplication of the jet corrections to pruned jets, and ≈ 1% to account for the uncertainty on\nthe determination of the W mass in data and MC, as described in Sec. 3.2), integrated luminosity (2.2%), subjet-selection efficiency (≈ 6%, as described in Sec. 3.2), jet energy resolution\n(< 1%), and jet angular resolution (< 1%). The trigger uncertainty for 1+1 events is 13% for\nmtt = 1 TeV/c2 , and < 1% for tt masses above 1.5 TeV/c2 . The trigger uncertainty is larger for\n1+2 events: 20% for mtt = 1 TeV/c2 , and 3% for mtt > 1.5 TeV/c2 , as described in Sec. 2. The\nimpact of changes in parton distribution functions [53] is found to be negligible.\nSimilar uncertainties affect the tt continuum background and are estimated in the same manner.\nIn addition, the large uncertainty on the renormalization and factorization scales (a factor of\ntwo) is found to have significant impact on SM tt production, resulting in a 50% variation in\nthe yield, estimated from MC studies. This is reflected in the uncertainties on the number of tt\nevents in Table 2. Table 3 provides a summary of this information.\nTable 3: Summary of relative systematic uncertainties on signal efficiency for two tt mass windows. All values are in percent. The central value of the subjet selection scale factor is 0.94, it\nis the only scale factor that has a non-unit mean.\nSource\nVariation mtt =0.9–1.1 TeV/c2 mtt =1.3–2.4 TeV/c2\n1+1\n1+2\n1+1\n1+2\nMC Statistical\n2.0\n1.6\n0.7\n1.6\nTrigger\nSee text\n13\n20\n<1\n3\nJet energy scale\n≈ ±5\n19\n19\n2\n2\nSubjet efficiency scale factor\n±6\n6\n6\n6\n6\nLuminosity\n± 2.2\n2.2\n2.2\n2.2\n2.2\nTotal\n24\n28\n7\n8\nThe uncertainties on the mistagged NTMJ background include the statistical uncertainty on\nthe sample after loose selection, to which the mistag probability is applied; the statistical uncertainty on the mistag probability itself, ranging from < 1% at 1 TeV/c2 to ≈ 10% at 3 TeV/c2 ;\nand the systematic uncertainty on the mistag probability application, as described in Sec. 3.3,\nwhich is in the range of 1 to 5% depending on the tt mass. The total background uncertainty\nis ≈ 5% for the low-mass region, dominated by the systematic uncertainty, and ≈ 100% for the\nhigh-mass region, dominated by statistical uncertainty associated with the sample after loose\nselection.\n\n5\n\nStatistical treatment\n\nThe main result of this analysis is the fit to data assuming a resonance hypothesis for the new\nphysics, in which a likelihood is fit to the expected tt invariant mass distributions for signal and\nbackground. The second result corresponds to a counting of events relative to some generic\nmodel of an enhancement of the tt continuum assuming the SM efficiency for the additional\ncontribution. These two results are discussed below.\n\n\f5.1\n\n5.1\n\n15\n\nResonance analysis\n\nResonance analysis\n\nThe first analysis uses a resonant signal hypothesis to search for localized contributions to the\nmtt spectrum. A cross-check of the analysis is performed by counting the number of events in a\nmass range defined for each resonant mass value. Two such mass ranges are shown in Tables 13. In the main resonance analysis and the cross-check, the number of observed events, Nobs , is\ncompared to the expectation Nexp , based on the production cross section σZ0 , branching fraction B(Z0 → tt), signal reconstruction efficiency e, integrated luminosity L, and the predicted\nnumber of background events NB :\nNexp = σZ0 × B(Z0 → tt) × e × L + NB .\n\n(3)\n\nThe likelihood is computed using the Poisson probability to observe Nobs , given a mean of\nNexp , with uncertain parameters L, e, and NB , all defined through log-normal priors based\non their mean values and their uncertainties. The shapes and normalizations of signal and\nbackground distributions are varied within their systematic uncertainties until the likelihood is\nmaximized. This procedure effectively integrates over the parameters describing the systematic\nuncertainties, thereby reducing their impact.\nThe upper limits at 95% confidence level (CL) on the product of the Z0 production cross section\nand the branching fraction to the tt final state are extracted for the combination of the 1+1 and\n1+2 tt mass spectra, as a function of mZ0 in a range from 1 to 3 TeV/c2 with a 0.1 TeV/c2 increment.\nA CLS method [54–56] is used to extract the 95% CL upper limits, with the posterior based on\na Poisson model for each bin of the mtt distribution.\nFigure 6 shows the observed and expected upper limits for: (a) a Z0 hypothesis with ΓZ0 /mZ0 =\n1%, (b) a Z0 hypothesis with ΓZ0 /mZ0 = 10%, and (c) a Randall–Sundrum Kaluza–Klein gluon\nhypothesis. Also shown are the theoretical predictions for several models to compare to the\nobserved and expected limits. In√\nFigure 6a, predictions are also shown for a topcolor Z0 model\nbased on Refs. [4–6] updated to s = 7 TeV in Ref. [57], with ΓZ0 /mZ0 = 1.2% and ΓZ0 /mZ0 =\n3%, compared to limits obtained assuming a 1% width. Higher-order QCD corrections to the\nZ0 production cross section were accounted for through a constant K-factor, computed to be\n1.3. The same Z0 model, but for ΓZ0 /mZ0 = 10%, is compared to the limits obtained assuming a\n10% width in Fig. 6b. Finally, in Fig. 6c, the prediction of the Randall–Sundrum Kaluza–Klein\ngluon model from Ref. [12] is compared to the limits from data.\nUsing the upper limits for the Z0 with 1% width, mass ranges for two Z0 models are excluded\nas seen in Fig. 6a. First, the mass range 1.0–1.6 TeV/c2 is excluded for a topcolor Z0 with width\nΓZ0 /mZ0 = 3%. Second, two mass ranges, 1.3–1.5 TeV/c2 and a narrow range (smaller than the\nmass increment) close to 1.0 TeV/c2 , are excluded for the same topcolor Z0 with width ΓZ0 /mZ0 =\n1.2%. Similarly, using the upper limits for the Z0 with 10% width as seen in Fig. 6b, the mass\nrange 1.0–2.0 TeV is excluded for a topcolor Z0 with width ΓZ0 /mZ0 = 10%.\nFinally, as seen in Fig. 6c, upper limits in the range of 1 pb are set on σg0 × B( g0 → tt) for\nm g0 > 1.4 TeV/c2 for a specific Randall–Sundrum gluon model [12], which exclude the existence\nof this particle with masses between 1.4–1.5 TeV/c2 , as well as in a narrow region (smaller than\nthe mass increment) close to 1.0 TeV/c2 .\nThe resonant analysis is cross-checked by counting events in specified mass windows of mtt .\nThe signal region is defined by a window in mtt , and the background estimates from Figs. 5a\nand 5b are integrated over this range. The results obtained from this cross-check are consistent\nwith the analysis of the mtt spectrum, but are not as sensitive. Table 2 shows the number\n\n\f16\n\n5\n\nUpper Limit σZ' × B (pb)\n\n-1\n\n102\n\nCMS, L = 5 fb at\n\ns = 7 TeV\n\nStatistical treatment\n\n1% Width Assumption\nObserved (95% CL)\nExpected (95% CL)\n± 1 s.d. Expected\n\n10\n\n± 2 s.d. Expected\nZ', 1.2% width, Harris et al\n\n1\n\nZ', 3.0% width, Harris et al\n\n10-1\n\n10-2\n\n1\n\n1.5\n\n2\n\n2.5\n\n3\n\ntt Invariant Mass (TeV/c2)\n(a)\n\nUpper Limit σZ' × B (pb)\n\n-1\n\n102\n\nCMS, L = 5 fb at\n\ns = 7 TeV\n\n10% Width Assumption\nObserved (95% CL)\nExpected (95% CL)\n\n10\n\n± 1 s.d. Expected\n± 2 s.d. Expected\nZ', 10.0% width, Harris et al\n\n1\n\n10-1\n\n10-2\n\n1\n\n1.5\n\n2\n\n2.5\n\n3\n\ntt Invariant Mass (TeV/c2)\n(b)\n\nUpper Limit σg' × B (pb)\n\n-1\n\n102\n\nCMS, L = 5 fb at\n\ns = 7 TeV\n\nKK Gluon Assumption\nObserved (95% CL)\nExpected (95% CL)\n\n10\n\n± 1 s.d. Expected\n± 2 s.d. Expected\nKK Gluon, Agashe et al\n\n1\n\n10-1\n\n10-2\n\n1\n\n1.5\n\n2\n\n2.5\n\n3\n\ntt Invariant Mass (TeV/c2)\n(c)\n\nFigure 6: The 95% CL upper limits on the product of production cross section (σ) and branching fraction (B) of hypothesized objects into tt, as a function of assumed resonance mass. (a)\nZ0 production with ΓZ0 /mZ0 = 1% (1% width assumption) compared to predictions based on\nRefs. [4–6] for ΓZ0 /mZ0 =1.2% and 3.0%. (b) Z0 production with ΓZ0 /mZ0 = 10% (10% width\nassumption) compared to predictions based on Refs. [4–6] for a width of 10%. (c) Randall–\nSundrum Kaluza–Klein gluon production from Ref. [12], compared to the theoretical prediction of that model. The ±1 and ±2 standard deviation (s.d.) excursions are shown relative to\nthe results expected for the available luminosity.\n\n\f17\n\n5.2 tt enhancement analysis\n\nTable 4: Expected number of events with mtt > 1 TeV/c2 from SM tt and non-top multijet\nbackgrounds, along with their total, compared to the observed number of events. The efficiency\nfor SM tt production, which is used in the limit setting procedure described in the text, is shown\non the final line.\n1+1\n1+2\nExpected SM tt events\n194 ± 106\n129 ± 80\nExpected non-top multijet events\n1546 ± 45\n2271 ± 130\nTotal expected events\n1740 ± 115\n2400 ± 153\nObserved events\n1738\n2423\n−\n4\ntt efficiency\n(2.5 ± 1.3) × 10\n(1.6 ± 1.0) × 10−4\nof events observed and expected in two mass windows for the 1+1 and 1+2 channels, 0.9–\n1.1 TeV/c2 corresponding to the 1 TeV/c2 Z0 sample, and 1.3–2.4 TeV/c2 corresponding to the\n2 TeV/c2 Z0 sample. The observed 95% CL upper limits on signal cross section change from 1.0\nto 2.0 pb at 1 TeV/c2 , from 0.10 to 0.26 pb at 2 TeV/c2 , and from 0.02 to 0.05 pb at 3 TeV/c2 . Most\nof the difference is attributed to a better statistical handling in the resonance analysis of the\nbins with large background in the mass distribution.\n\n5.2\n\ntt enhancement analysis\n\nIn the second analysis, general enhancement is assumed in modeling the tt mass spectrum due\nto some new phenomenon (NP), assuming the same signal efficiency as for the SM tt continuum, as described in Refs. [22, 23]. The limit on any possible enhancement is presented in terms\nof a variable S , the ratio of the integral of the mtt distribution above 1 TeV/c2 corresponding to\nSM tt production and a contribution from some NP, to that from just SM tt production:\n\nR\nS=\n\ndσSM+ NP\ndmtt dmtt\n.\nR\ndσSM\ndmtt\nmtt >1 TeV/c2 dmtt\n\nmtt >1 TeV/c2\n\n(4)\n\nThe events used for setting the limit are selected to have reconstructed mtt > 1 TeV/c2 , which\ndoes not correspond to the same range for the true mass. Consequently, a correction factor\nmust be applied to the reconstructed tt mass distribution to estimate the true mass distribution.\nThis is estimated by dividing the number of simulated tt events with a reconstructed mass\n> 1 TeV/c2 by the number of simulated tt events with a true mass > 1 TeV/c2 . This ratio is 1.24\n± 0.08 for the Type 1+1 analysis and 1.41 ± 0.11 for the Type 1+2 analysis. These differences are\napplied as multiplicative factors to obtain the yields for the true tt mass above 1 TeV/c2 . These\nfactors do not affect the quantity S since they cancel in the ratio.\nThe approximate NNLO cross section for inclusive tt production is taken to be 163 pb [48–\n50]. The efficiency for Type 1+1 events, relative to inclusive SM tt production, is found to\nbe (2.5 ± 1.3) × 10−4 , and for Type 1+2, the efficiency is (1.6 ± 1.0) × 10−4 . The numbers of\nobserved and expected events for the SM tt and NTMJ backgrounds are shown in Table 4,\nalong with these efficiencies. Following the statistical procedure outlined above, it follows that\nthe enhancement factor to the tt production cross section for mtt > 1 TeV/c2 (S in Eq. (4)) must\nbe < 2.6. The a priori expectation is for this limit to lie in the interval 2.0–3.5 at 68% CL, and\n1.7–5.5 at 95% CL, with a most probable value of 2.5.\n\n\f18\n\n6\n\n6\n\nSummary\n\nSummary\n\nIn summary, a search is presented for a massive resonance (Z0 ) decaying into a tt pair in the\nall-hadronic final state using an integrated luminosity of 5 fb−1 collected with the CMS detector at 7 TeV. A Z0 with standard-model couplings is considered as a model of such a resonance.\nTwo widths are considered (ΓZ0 /mZ0 = 1% and 10%), as well as an additional model of a\nRandall–Sundrum Kaluza–Klein gluon. The search focuses on high tt masses that yield collimated decay products, partially or fully merged into single jets. The analysis therefore relies\non new developments in the area of jet substructure, thereby providing suppression of non-top\nmultijet production.\nNo excess of events is observed over the expected yield from SM background sources. Upper\nlimits in the range of 1 pb are set on the product of the Z0 cross section and branching fraction\nfor a topcolor Z0 modeled for several widths, as well as for a Randall–Sundrum Kaluza–Klein\ngluon.\nFinally, results are presented for any generic source of new phenomena with the same reconstruction efficiency as standard-model tt production, and limits are placed on any enhancement\nto the cross section from such a contribution. In particular, the tt production cross section (in\ntotal) must be less than a factor of 2.6 times that of the SM expectation for mtt > 1 TeV/c2 . This\nconstrains generic enhancements to standard-model tt production, which can be used to check\nmodels that seek to interpret the forward-backward tt production asymmetry observed at the\nTevatron as a sign of new physics.\nThis is the first publication to constrain tt resonances in the kinematic region of mtt > 1 TeV/c2 ,\nand is also the first work to use the jet-substructure tools described above.\n\nAcknowledgements\nWe thank Seung J. Lee for the computations of the Kaluza-Klein gluon cross sections at 7 TeV.\nWe congratulate our colleagues in the CERN accelerator departments for the excellent performance of the LHC machine. We thank the technical and administrative staff at CERN and other\nCMS institutes, and acknowledge support from: FMSR (Austria); FNRS and FWO (Belgium);\nCNPq, CAPES, FAPERJ, and FAPESP (Brazil); MES (Bulgaria); CERN; CAS, MoST, and NSFC\n(China); COLCIENCIAS (Colombia); MSES (Croatia); RPF (Cyprus); MoER, SF0690030s09 and\nERDF (Estonia); Academy of Finland, MEC, and HIP (Finland); CEA and CNRS/IN2P3 (France);\nBMBF, DFG, and HGF (Germany); GSRT (Greece); OTKA and NKTH (Hungary); DAE and DST\n(India); IPM (Iran); SFI (Ireland); INFN (Italy); NRF and WCU (Korea); LAS (Lithuania); CINVESTAV, CONACYT, SEP, and UASLP-FAI (Mexico); MSI (New Zealand); PAEC (Pakistan);\nMSHE and NSC (Poland); FCT (Portugal); JINR (Armenia, Belarus, Georgia, Ukraine, Uzbekistan); MON, RosAtom, RAS and RFBR (Russia); MSTD (Serbia); MICINN and CPAN (Spain);\nSwiss Funding Agencies (Switzerland); NSC (Taipei); TUBITAK and TAEK (Turkey); STFC\n(United Kingdom); DOE and NSF (USA).\nThis work was supported in part by the DOE under under Task TeV of contract DE-FG0296ER40956 during the Workshop on Jet Substructure at the University of Washington.\n\n\fReferences\n\n19\n\nReferences\n[1] S. Dimopoulos and H. Georgi, \"Softly Broken Supersymmetry and SU(5)\", Nucl. Phys. B\n193 (1981) 150–162, doi:10.1016/0550-3213(81)90522-8.\n[2] S. Weinberg, \"Implications of Dynamical Symmetry Breaking\", Phys. Rev. D 13 (1976)\n974–996, doi:10.1103/PhysRevD.13.974.\n[3] L. Susskind, \"Dynamics of Spontaneous Symmetry Breaking in the Weinberg- Salam\nTheory\", Phys. Rev. D 20 (1979) 2619–2625, doi:10.1103/PhysRevD.20.2619.\n[4] C. T. Hill and S. J. Parke, \"Top production: Sensitivity to new physics\", Phys. Rev. D 49\n(1994) 4454–4462, doi:10.1103/PhysRevD.49.4454, arXiv:hep-ph/9312324.\n[5] C. T. Hill, \"Topcolor: Top quark condensation in a gauge extension of the standard\nmodel\", Phys. Lett. B 266 (1991) 419–424, doi:10.1016/0370-2693(91)91061-Y.\nUpdates in arXiv:hep-ph/9911288 and arXiv:hep-ph/1112.4928.\n[6] C. T. Hill, \"Topcolor assisted technicolor\", Phys. Lett. B 345 (1995) 483–489,\ndoi:10.1016/0370-2693(94)01660-5, arXiv:hep-ph/9411426.\n[7] R. S. Chivukula, B. A. Dobrescu, H. Georgi, and C. T. Hill, \"Top quark seesaw theory of\nelectroweak symmetry breaking\", Phys. Rev. D 59 (1999) 075003,\ndoi:10.1103/PhysRevD.59.075003, arXiv:hep-ph/9809470.\n[8] N. Arkani-Hamed, A. G. Cohen, and H. Georgi, \"Electroweak symmetry breaking from\ndimensional deconstruction\", Phys. Lett. B 513 (2001) 232–240,\ndoi:10.1016/S0370-2693(01)00741-9, arXiv:hep-ph/0105239.\n[9] N. Arkani-Hamed, S. Dimopoulos, and G. R. Dvali, \"The hierarchy problem and new\ndimensions at a millimeter\", Phys. Lett. B 429 (1998) 263–272,\ndoi:10.1016/S0370-2693(98)00466-3, arXiv:hep-ph/9803315.\n[10] L. Randall and R. Sundrum, \"A large mass hierarchy from a small extra dimension\",\nPhys. Rev. Lett. 83 (1999) 3370–3373, doi:10.1103/PhysRevLett.83.3370,\narXiv:hep-ph/9905221.\n[11] L. Randall and R. Sundrum, \"An alternative to compactification\", Phys. Rev. Lett. 83\n(1999) 4690–4693, doi:10.1103/PhysRevLett.83.4690,\narXiv:hep-th/9906064.\n[12] K. Agashe et al., \"LHC signals from warped extra dimensions\", Phys. Rev. D 77 (2008)\n015003, doi:10.1103/PhysRevD.77.015003, arXiv:hep-ph/0612015.\n[13] Y. Bai, J. L. Hewett, J. Kaplan, and T. G. Rizzo, \"LHC Predictions from a Tevatron\nAnomaly in the Top Quark Forward-Backward Asymmetry\", JHEP 03 (2011) 003,\ndoi:10.1007/JHEP03(2011)003, arXiv:1101.5203.\n[14] P. H. Frampton, J. Shu, and K. Wang, \"Axigluon as Possible Explanation for p p̄ → tt̄\nForward-Backward Asymmetry\", Phys. Lett. B 683 (2010) 294–297,\ndoi:10.1016/j.physletb.2009.12.043, arXiv:0911.2955.\n[15] M. I. Gresham, I.-W. Kim, and K. M. Zurek, \"On Models of New Physics for the Tevatron\nTop A FB\", Phys. Rev. D 83 (2011) 114027, doi:10.1103/PhysRevD.83.114027,\narXiv:1103.3501.\n\n\f20\n\nReferences\n\n[16] O. Antunano, J. H. Kuhn, and G. Rodrigo, \"Top quarks, axigluons and charge\nasymmetries at hadron colliders\", Phys. Rev. D 77 (2008) 014003,\ndoi:10.1103/PhysRevD.77.014003, arXiv:0709.1652.\n[17] CDF Collaboration,\n\"Forward-Backward Asymmetry in Top Quark Production in pp\n√\nCollisions at s = 1.96 TeV\", Phys. Rev. Lett. 101 (2008) 202001,\ndoi:10.1103/PhysRevLett.101.202001, arXiv:0806.2472.\n[18] D0 Collaboration, \"First measurement of the forward-backward charge asymmetry in top\nquark pair production\", Phys. Rev. Lett. 100 (2008) 142002,\ndoi:10.1103/PhysRevLett.100.142002, arXiv:0712.0851.\n[19] CDF Collaboration, \"Evidence for a Mass Dependent Forward-Backward Asymmetry in\nTop Quark Pair Production\", Phys. Rev. D 83 (2011) 112003,\ndoi:10.1103/PhysRevD.83.112003, arXiv:1101.0034.\n[20] D0 Collaboration, \"Forward-backward asymmetry in top quark-antiquark production\",\nPhys. Rev. D 84 (2011) 112005, doi:10.1103/PhysRevD.84.112005,\narXiv:1107.4995.\n[21] CDF Collaboration, \"Evidence for a Mass Dependent Forward-Backward Asymmetry in\nTop Quark Pair Production\", Phys. Rev. D 83 (2011) 112003,\ndoi:10.1103/PhysRevD.83.112003, arXiv:1101.0034.\n[22] C. Delaunay et al., \"Implications of the CDF tt̄ Forward-Backward Asymmetry for Hard\nTop Physics\", JHEP 08 (2011) 031, doi:10.1007/JHEP08(2011)031,\narXiv:1103.2297.\n[23] J. A. Aguilar-Saavedra and M. Perez-Victoria, \"Probing the Tevatron tt asymmetry at\nLHC\", JHEP 05 (2011) 034, doi:10.1007/JHEP05(2011)034, arXiv:1103.2765.\n[24] CDF\n√ Collaboration, \"Limits on the production of narrow tt resonances in pp collisions at\ns = 1.96 TeV\", Phys. Rev. D 77 (2008) 051102, doi:10.1103/PhysRevD.77.051102,\narXiv:0710.5335.\n√\n[25] CDF Collaboration, \"Search for resonant tt production in pp collisions at s = 1.96 TeV\",\nPhys. Rev. Lett. 100 (2008) 231801, doi:10.1103/PhysRevLett.100.231801,\narXiv:0709.0705.\n√\n[26] D0 Collaboration, \"Search for a Narrow tt̄ Resonance in p p̄ Collisions at s = 1.96 TeV\",\nPhys. Rev. D 85 (2012) 051101, doi:10.1103/PhysRevD.85.051101,\narXiv:1111.1271.\n[27] D. E. Kaplan, K. Rehermann, M. D. Schwartz, and B. Tweedie, \"Top Tagging: A Method\nfor Identifying Boosted Hadronically Decaying Top Quarks\", Phys. Rev. Lett. 101 (2008)\n142001, doi:10.1103/PhysRevLett.101.142001, arXiv:0806.0848.\n[28] CMS Collaboration, \"A Cambridge-Aachen (C-A) based Jet Algorithm for boosted\ntop-jet tagging\", CMS Physics Analysis Summary CMS-PAS-JME-009-01, (2009).\n[29] S. D. Ellis, C. K. Vermilion, and J. R. Walsh, \"Techniques for improved heavy particle\nsearches with jet substructure\", Phys. Rev. D 80 (2009) 051501,\ndoi:10.1103/PhysRevD.80.051501, arXiv:0903.5081.\n\n\fReferences\n\n21\n\n[30] S. D. Ellis, C. K. Vermilion, and J. R. Walsh, \"Recombination Algorithms and Jet\nSubstructure: Pruning as a Tool for Heavy Particle Searches\", Phys. Rev. D 81 (2010)\n094023, doi:10.1103/PhysRevD.81.094023, arXiv:0912.0033.\n[31] J. M. Butterworth, A. R. Davison, M. Rubin, and G. P. Salam, \"Jet substructure as a new\nHiggs search channel at the LHC\", Phys. Rev. Lett. 100 (2008) 242001,\ndoi:10.1103/PhysRevLett.100.242001, arXiv:0802.2470.\n[32] CMS Collaboration, \"The CMS experiment at the CERN LHC\", JINST 3 (2008) S08004,\ndoi:10.1088/1748-0221/3/08/S08004.\n[33] J. Alwall et al., \"MadGraph/MadEvent v4: the new web generation\", JHEP 09 (2007)\n028, doi:10.1088/1126-6708/2007/09/028, arXiv:0706.2334.\n[34] T. Sjöstrand et al., \"High-energy physics event generation with PYTHIA 6.1\", Comput.\nPhys. Commun. 135 (2001) 238–259, doi:10.1016/S0010-4655(00)00236-8,\narXiv:hep-ph/0010017.\n[35] T. Sjostrand, S. Mrenna, and P. Z. Skands, \"A Brief Introduction to PYTHIA 8.1\", Comput.\nPhys. Commun. 178 (2008) 852–867, doi:10.1016/j.cpc.2008.01.036,\narXiv:0710.3820.\n[36] J. Pumplin et al., \"New generation of parton distributions with uncertainties from global\nQCD analysis\", JHEP 07 (2002) 012, doi:10.1088/1126-6708/2002/07/012,\narXiv:hep-ph/0201195.\n[37] J. Allison et al., \"Geant4 developments and applications\", IEEE Trans. Nucl. Sci. 53 (2006)\n270, doi:10.1109/TNS.2006.869826.\n[38] CMS Collaboration, \"Particle-Flow Event Reconstruction in CMS and Performance for\nJets, Taus, and MET\", CMS Physics Analysis Summary CMS-PAS-PFT-09-01, (2009).\n[39] CMS Collaboration, \"Tracking and Vertexing Results from First Collisions\", CMS\nPhysics Analysis Summary CMS-PAS-TRK-10-001, (2010).\n[40] M. Wobisch and T. Wengler, \"Hadronization corrections to jet cross sections in deepinelastic scattering\", DESY-PROC 02 (1998) arXiv:hep-ph/9907280.\n[41] Y. L. Dokshitzer, G. D. Leder, S. Moretti, and B. R. Webber, \"Better Jet Clustering\nAlgorithms\", JHEP 08 (1997) 001, doi:10.1088/1126-6708/1997/08/001,\narXiv:hep-ph/9707323.\n[42] M. Cacciari and G. P. Salam, \"Dispelling the N**3 myth for the k(t) jet-finder\", Phys. Lett.\nB 641 (2006) 57–61, doi:10.1016/j.physletb.2006.08.037,\narXiv:hep-ph/0512210.\n[43] M. Cacciari, G. P. Salam, and G. Soyez, \"FastJet user manual\", (2011).\narXiv:1111.6097.\n[44] M. Cacciari, G. P. Salam, and G. Soyez, \"The anti-kt jet clustering algorithm\", JHEP 04\n(2008) 063, arXiv:0802.1189.\n[45] CMS Collaboration, \"Determination of Jet Energy Calibration and Transverse\nMomentum Resolution in CMS\", JINST 6 (2011) P11002,\ndoi:10.1088/1748-0221/6/11/P11002, arXiv:1107.4277.\n\n\f22\n\nReferences\n\n[46] CMS Collaboration, \"Measurement of the t t̄ Production Cross Section in pp Collisions at\n7 TeV in Lepton + Jets Events Using b-quark Jet Identification\", Phys. Rev. D 84 (2011)\n092004, doi:10.1103/PhysRevD.84.092004, arXiv:1108.3773.\n[47] CMS Collaboration, \"Performance of the b-jet identification in CMS\", CMS Physics\nAnalysis Summary CMS-PAS-BTV-11-001, (2011).\n[48] M. Aliev et al., \"HATHOR: HAdronic Top and Heavy quarks crOss section calculatoR\",\nComput. Phys. Commun. 182 (2011) 1034, doi:10.1016/j.cpc.2010.12.040,\narXiv:1007.1327.\n[49] U. Langenfeld, S. Moch, and P. Uwer, \"Measuring the running top-quark mass\", Phys.\nRev. D 80 (2009) 054009, doi:10.1103/PhysRevD.80.054009, arXiv:0906.5273.\n[50] N. Kidonakis, \"Next-to-next-to-leading soft-gluon corrections for the top quark cross\nsection and transverse momentum distribution\", Phys. Rev. D 82 (2010) 114030,\ndoi:10.1103/PhysRevD.82.114030, arXiv:1009.4935.\n[51] K. Melnikov and F. Petriello, \"Electroweak gauge boson production at hadron colliders\nthrough O(α2s )\", Phys. Rev. D 74 (2006) 114017, doi:10.1103/PhysRevD.74.114017,\narXiv:hep-ph/0609070.\n[52] S. D. Ellis et al., \"Jets in hadron-hadron collisions\", Prog. Part. Nucl. Phys. 60 (2008)\n484–551, doi:10.1016/j.ppnp.2007.12.002, arXiv:0712.2447.\n[53] G. Watt, \"Parton distribution function dependence of benchmark Standard Model total\ncross sections at the 7 TeV LHC\", JHEP 09 (2011) 069,\ndoi:10.1007/JHEP09(2011)069, arXiv:1106.5788.\n[54] A. L. Read, \"Presentation of search results: the CLs technique\", J. Phys. G 28 (2002) 2693,\ndoi:10.1088/0954-3899/28/10/313.\n[55] T. Junk, \"Confidence level computation for combining searches with small statistics\",\nNucl. Instrum. Meth. A 434 (1999) 435, doi:10.1016/S0168-9002(99)00498-2.\n[56] ATLAS and CMS Collaborations, \"Procedure for the LHC Higgs boson search\ncombination in summer 2011\", ATL-PHYS-PUB-2011-011, CMS NOTE-11-005, (2011).\n[57] R. M. Harris and S. Jain, \"Cross Sections for Leptophobic Topcolor Z' decaying to\ntop-antitop\", Eur. Phys. J. C 72 (2012) 2072, arXiv:1112.4928.\n\n\f23\n\nA\n\nThe CMS Collaboration\n\nYerevan Physics Institute, Yerevan, Armenia\nS. Chatrchyan, V. Khachatryan, A.M. Sirunyan, A. Tumasyan\nInstitut für Hochenergiephysik der OeAW, Wien, Austria\nW. Adam, T. Bergauer, M. Dragicevic, J. Erö, C. Fabjan, M. Friedl, R. Frühwirth, V.M. Ghete,\nJ. Hammer1 , N. Hörmann, J. Hrubec, M. Jeitler, W. Kiesenhofer, M. Krammer, D. Liko,\nI. Mikulec, M. Pernicka† , B. Rahbaran, C. Rohringer, H. Rohringer, R. Schöfbeck, J. Strauss,\nA. Taurok, F. Teischinger, P. Wagner, W. Waltenberger, G. Walzel, E. Widl, C.-E. Wulz\nNational Centre for Particle and High Energy Physics, Minsk, Belarus\nV. Mossolov, N. Shumeiko, J. Suarez Gonzalez\nUniversiteit Antwerpen, Antwerpen, Belgium\nS. Bansal, K. Cerny, T. Cornelis, E.A. De Wolf, X. Janssen, S. Luyckx, T. Maes, L. Mucibello,\nS. Ochesanu, B. Roland, R. Rougny, M. Selvaggi, H. Van Haevermaet, P. Van Mechelen, N. Van\nRemortel, A. Van Spilbeeck\nVrije Universiteit Brussel, Brussel, Belgium\nF. Blekman, S. Blyweert, J. D'Hondt, R. Gonzalez Suarez, A. Kalogeropoulos, M. Maes,\nA. Olbrechts, W. Van Doninck, P. Van Mulders, G.P. Van Onsem, I. Villella\nUniversité Libre de Bruxelles, Bruxelles, Belgium\nO. Charaf, B. Clerbaux, G. De Lentdecker, V. Dero, A.P.R. Gay, T. Hreus, A. Léonard,\nP.E. Marage, T. Reis, L. Thomas, C. Vander Velde, P. Vanlaer\nGhent University, Ghent, Belgium\nV. Adler, K. Beernaert, A. Cimmino, S. Costantini, G. Garcia, M. Grunewald, B. Klein,\nJ. Lellouch, A. Marinov, J. Mccartin, A.A. Ocampo Rios, D. Ryckbosch, N. Strobbe, F. Thyssen,\nM. Tytgat, L. Vanelderen, P. Verwilligen, S. Walsh, E. Yazgan, N. Zaganidis\nUniversité Catholique de Louvain, Louvain-la-Neuve, Belgium\nS. Basegmez, G. Bruno, L. Ceard, C. Delaere, T. du Pree, D. Favart, L. Forthomme,\nA. Giammanco2 , J. Hollar, V. Lemaitre, J. Liao, O. Militaru, C. Nuttens, D. Pagano, A. Pin,\nK. Piotrzkowski, N. Schul\nUniversité de Mons, Mons, Belgium\nN. Beliy, T. Caebergs, E. Daubie, G.H. Hammad\nCentro Brasileiro de Pesquisas Fisicas, Rio de Janeiro, Brazil\nG.A. Alves, M. Correa Martins Junior, D. De Jesus Damiao, T. Martins, M.E. Pol, M.H.G. Souza\nUniversidade do Estado do Rio de Janeiro, Rio de Janeiro, Brazil\nW.L. Aldá Júnior, W. Carvalho, A. Custódio, E.M. Da Costa, C. De Oliveira Martins, S. Fonseca\nDe Souza, D. Matos Figueiredo, L. Mundim, H. Nogima, V. Oguri, W.L. Prado Da Silva,\nA. Santoro, S.M. Silva Do Amaral, L. Soares Jorge, A. Sznajder\nInstituto de Fisica Teorica, Universidade Estadual Paulista, Sao Paulo, Brazil\nT.S. Anjos3 , C.A. Bernardes3 , F.A. Dias4 , T.R. Fernandez Perez Tomei, E. M. Gregores3 ,\nC. Lagana, F. Marinho, P.G. Mercadante3 , S.F. Novaes, Sandra S. Padula\nInstitute for Nuclear Research and Nuclear Energy, Sofia, Bulgaria\nV. Genchev1 , P. Iaydjiev1 , S. Piperov, M. Rodozov, S. Stoykova, G. Sultanov, V. Tcholakov,\nR. Trayanov, M. Vutova\n\n\f24\n\nA\n\nThe CMS Collaboration\n\nUniversity of Sofia, Sofia, Bulgaria\nA. Dimitrov, R. Hadjiiska, A. Karadzhinova, V. Kozhuharov, L. Litov, B. Pavlov, P. Petkov\nInstitute of High Energy Physics, Beijing, China\nJ.G. Bian, G.M. Chen, H.S. Chen, C.H. Jiang, D. Liang, S. Liang, X. Meng, J. Tao, J. Wang,\nJ. Wang, X. Wang, Z. Wang, H. Xiao, M. Xu, J. Zang, Z. Zhang\nState Key Lab. of Nucl. Phys. and Tech., Peking University, Beijing, China\nC. Asawatangtrakuldee, Y. Ban, S. Guo, Y. Guo, W. Li, S. Liu, Y. Mao, S.J. Qian, H. Teng, S. Wang,\nB. Zhu, W. Zou\nUniversidad de Los Andes, Bogota, Colombia\nC. Avila, B. Gomez Moreno, A.F. Osorio Oliveros, J.C. Sanabria\nTechnical University of Split, Split, Croatia\nN. Godinovic, D. Lelas, R. Plestina5 , D. Polic, I. Puljak1\nUniversity of Split, Split, Croatia\nZ. Antunovic, M. Dzelalija, M. Kovac\nInstitute Rudjer Boskovic, Zagreb, Croatia\nV. Brigljevic, S. Duric, K. Kadija, J. Luetic, S. Morovic\nUniversity of Cyprus, Nicosia, Cyprus\nA. Attikis, M. Galanti, G. Mavromanolakis, J. Mousa, C. Nicolaou, F. Ptochos, P.A. Razis\nCharles University, Prague, Czech Republic\nM. Finger, M. Finger Jr.\nAcademy of Scientific Research and Technology of the Arab Republic of Egypt, Egyptian\nNetwork of High Energy Physics, Cairo, Egypt\nY. Assran6 , S. Elgammal, A. Ellithi Kamel7 , S. Khalil8 , M.A. Mahmoud9 , A. Radi8,10\nNational Institute of Chemical Physics and Biophysics, Tallinn, Estonia\nM. Kadastik, M. Müntel, M. Raidal, L. Rebane, A. Tiko\nDepartment of Physics, University of Helsinki, Helsinki, Finland\nV. Azzolini, P. Eerola, G. Fedi, M. Voutilainen\nHelsinki Institute of Physics, Helsinki, Finland\nS. Czellar, J. Härkönen, A. Heikkinen, V. Karimäki, R. Kinnunen, M.J. Kortelainen, T. Lampén,\nK. Lassila-Perini, S. Lehti, T. Lindén, P. Luukka, T. Mäenpää, T. Peltola, E. Tuominen,\nJ. Tuominiemi, E. Tuovinen, D. Ungaro, L. Wendland\nLappeenranta University of Technology, Lappeenranta, Finland\nK. Banzuzi, A. Korpela, T. Tuuva\nLaboratoire d'Annecy-le-Vieux de Physique des Particules, IN2P3-CNRS, Annecy-le-Vieux,\nFrance\nD. Sillou\nDSM/IRFU, CEA/Saclay, Gif-sur-Yvette, France\nM. Besancon, S. Choudhury, M. Dejardin, D. Denegri, B. Fabbro, J.L. Faure, F. Ferri, S. Ganjour,\nA. Givernaud, P. Gras, G. Hamel de Monchenault, P. Jarry, E. Locci, J. Malcles, L. Millischer,\nA. Nayak, J. Rander, A. Rosowsky, I. Shreyber, M. Titov\n\n\f25\nLaboratoire Leprince-Ringuet, Ecole Polytechnique, IN2P3-CNRS, Palaiseau, France\nS. Baffioni, F. Beaudette, L. Benhabib, L. Bianchini, M. Bluj11 , C. Broutin, P. Busson, C. Charlot,\nN. Daci, T. Dahms, L. Dobrzynski, R. Granier de Cassagnac, M. Haguenauer, P. Miné,\nC. Mironov, C. Ochando, P. Paganini, D. Sabes, R. Salerno, Y. Sirois, C. Veelken, A. Zabi\nInstitut Pluridisciplinaire Hubert Curien, Université de Strasbourg, Université de Haute\nAlsace Mulhouse, CNRS/IN2P3, Strasbourg, France\nJ.-L. Agram12 , J. Andrea, D. Bloch, D. Bodin, J.-M. Brom, M. Cardaci, E.C. Chabert, C. Collard,\nE. Conte12 , F. Drouhin12 , C. Ferro, J.-C. Fontaine12 , D. Gelé, U. Goerlach, P. Juillot, M. Karim12 ,\nA.-C. Le Bihan, P. Van Hove\nCentre de Calcul de l'Institut National de Physique Nucleaire et de Physique des\nParticules (IN2P3), Villeurbanne, France\nF. Fassi, D. Mercier\nUniversité de Lyon, Université Claude Bernard Lyon 1, CNRS-IN2P3, Institut de Physique\nNucléaire de Lyon, Villeurbanne, France\nC. Baty, S. Beauceron, N. Beaupere, M. Bedjidian, O. Bondu, G. Boudoul, D. Boumediene,\nH. Brun, J. Chasserat, R. Chierici1 , D. Contardo, P. Depasse, H. El Mamouni, A. Falkiewicz,\nJ. Fay, S. Gascon, M. Gouzevitch, B. Ille, T. Kurca, T. Le Grand, M. Lethuillier, L. Mirabito,\nS. Perries, V. Sordini, S. Tosi, Y. Tschudi, P. Verdier, S. Viret\nInstitute of High Energy Physics and Informatization, Tbilisi State University, Tbilisi,\nGeorgia\nZ. Tsamalaidze13\nRWTH Aachen University, I. Physikalisches Institut, Aachen, Germany\nG. Anagnostou, S. Beranek, M. Edelhoff, L. Feld, N. Heracleous, O. Hindrichs, R. Jussen,\nK. Klein, J. Merz, A. Ostapchuk, A. Perieanu, F. Raupach, J. Sammet, S. Schael, D. Sprenger,\nH. Weber, B. Wittmer, V. Zhukov14\nRWTH Aachen University, III. Physikalisches Institut A, Aachen, Germany\nM. Ata, J. Caudron, E. Dietz-Laursonn, D. Duchardt, M. Erdmann, A. Güth, T. Hebbeker,\nC. Heidemann, K. Hoepfner, T. Klimkovich, D. Klingebiel, P. Kreuzer, D. Lanske† ,\nJ. Lingemann, C. Magass, M. Merschmeyer, A. Meyer, M. Olschewski, P. Papacz, H. Pieta,\nH. Reithler, S.A. Schmitz, L. Sonnenschein, J. Steggemann, D. Teyssier, M. Weber\nRWTH Aachen University, III. Physikalisches Institut B, Aachen, Germany\nM. Bontenackels, V. Cherepanov, M. Davids, G. Flügge, H. Geenen, M. Geisler, W. Haj Ahmad,\nF. Hoehle, B. Kargoll, T. Kress, Y. Kuessel, A. Linn, A. Nowack, L. Perchalla, O. Pooth,\nJ. Rennefeld, P. Sauerland, A. Stahl\nDeutsches Elektronen-Synchrotron, Hamburg, Germany\nM. Aldaya Martin, J. Behr, W. Behrenhoff, U. Behrens, M. Bergholz15 , A. Bethani, K. Borras,\nA. Burgmeier, A. Cakir, L. Calligaris, A. Campbell, E. Castro, F. Costanza, D. Dammann,\nG. Eckerlin, D. Eckstein, D. Fischer, G. Flucke, A. Geiser, I. Glushkov, S. Habib, J. Hauk,\nH. Jung1 , M. Kasemann, P. Katsas, C. Kleinwort, H. Kluge, A. Knutsson, M. Krämer, D. Krücker,\nE. Kuznetsova, W. Lange, W. Lohmann15 , B. Lutz, R. Mankel, I. Marfin, M. Marienfeld,\nI.-A. Melzer-Pellmann, A.B. Meyer, J. Mnich, A. Mussgiller, S. Naumann-Emme, J. Olzem,\nH. Perrey, A. Petrukhin, D. Pitzl, A. Raspereza, P.M. Ribeiro Cipriano, C. Riedl, M. Rosin,\nJ. Salfeld-Nebgen, R. Schmidt15 , T. Schoerner-Sadenius, N. Sen, A. Spiridonov, M. Stein,\nR. Walsh, C. Wissing\n\n\f26\n\nA\n\nThe CMS Collaboration\n\nUniversity of Hamburg, Hamburg, Germany\nC. Autermann, V. Blobel, S. Bobrovskyi, J. Draeger, H. Enderle, J. Erfle, U. Gebbert, M. Görner,\nT. Hermanns, R.S. Höing, K. Kaschube, G. Kaussen, H. Kirschenmann, R. Klanner, J. Lange,\nB. Mura, F. Nowak, N. Pietsch, D. Rathjens, C. Sander, H. Schettler, P. Schleper, E. Schlieckau,\nA. Schmidt, M. Schröder, T. Schum, M. Seidel, H. Stadie, G. Steinbrück, J. Thomsen\nInstitut für Experimentelle Kernphysik, Karlsruhe, Germany\nC. Barth, J. Berger, T. Chwalek, W. De Boer, A. Dierlamm, M. Feindt, M. Guthoff1 , C. Hackstein,\nF. Hartmann, M. Heinrich, H. Held, K.H. Hoffmann, S. Honc, U. Husemann, I. Katkov14 ,\nJ.R. Komaragiri, D. Martschei, S. Mueller, Th. Müller, M. Niegel, A. Nürnberg, O. Oberst,\nA. Oehler, J. Ott, T. Peiffer, G. Quast, K. Rabbertz, F. Ratnikov, N. Ratnikova, S. Röcker, C. Saout,\nA. Scheurer, F.-P. Schilling, M. Schmanau, G. Schott, H.J. Simonis, F.M. Stober, D. Troendle,\nR. Ulrich, J. Wagner-Kuhr, T. Weiler, M. Zeise, E.B. Ziebarth\nInstitute of Nuclear Physics \"Demokritos\", Aghia Paraskevi, Greece\nG. Daskalakis, T. Geralis, S. Kesisoglou, A. Kyriakis, D. Loukas, I. Manolakos, A. Markou,\nC. Markou, C. Mavrommatis, E. Ntomari\nUniversity of Athens, Athens, Greece\nL. Gouskos, T.J. Mertzimekis, A. Panagiotou, N. Saoulidou\nUniversity of Ioánnina, Ioánnina, Greece\nI. Evangelou, C. Foudas1 , P. Kokkas, N. Manthos, I. Papadopoulos, V. Patras\nKFKI Research Institute for Particle and Nuclear Physics, Budapest, Hungary\nG. Bencze, C. Hajdu1 , P. Hidas, D. Horvath16 , A. Kapusi, K. Krajczar17 , B. Radics, F. Sikler1 ,\nV. Veszpremi, G. Vesztergombi17\nInstitute of Nuclear Research ATOMKI, Debrecen, Hungary\nN. Beni, J. Molnar, J. Palinkas, Z. Szillasi\nUniversity of Debrecen, Debrecen, Hungary\nJ. Karancsi, P. Raics, Z.L. Trocsanyi, B. Ujvari\nPanjab University, Chandigarh, India\nS.B. Beri, V. Bhatnagar, N. Dhingra, R. Gupta, M. Jindal, M. Kaur, J.M. Kohli, M.Z. Mehta,\nN. Nishu, L.K. Saini, A. Sharma, J. Singh, S.P. Singh\nUniversity of Delhi, Delhi, India\nS. Ahuja, B.C. Choudhary, A. Kumar, A. Kumar, S. Malhotra, M. Naimuddin, K. Ranjan,\nV. Sharma, R.K. Shivpuri\nSaha Institute of Nuclear Physics, Kolkata, India\nS. Banerjee, S. Bhattacharya, S. Dutta, B. Gomber, Sa. Jain, Sh. Jain, R. Khurana, S. Sarkar\nBhabha Atomic Research Centre, Mumbai, India\nA. Abdulsalam, R.K. Choudhury, D. Dutta, S. Kailas, V. Kumar, A.K. Mohanty1 , L.M. Pant,\nP. Shukla\nTata Institute of Fundamental Research - EHEP, Mumbai, India\nT. Aziz, S. Ganguly, M. Guchait18 , A. Gurtu19 , M. Maity20 , G. Majumder, K. Mazumdar,\nG.B. Mohanty, B. Parida, K. Sudhakar, N. Wickramage\nTata Institute of Fundamental Research - HECR, Mumbai, India\nS. Banerjee, S. Dugad\n\n\f27\nInstitute for Research in Fundamental Sciences (IPM), Tehran, Iran\nH. Arfaei, H. Bakhshiansohi21 , S.M. Etesami22 , A. Fahim21 , M. Hashemi, H. Hesari, A. Jafari21 ,\nM. Khakzad, A. Mohammadi23 , M. Mohammadi Najafabadi, S. Paktinat Mehdiabadi,\nB. Safarzadeh24 , M. Zeinali22\nINFN Sezione di Bari a , Università di Bari b , Politecnico di Bari c , Bari, Italy\nM. Abbresciaa,b , L. Barbonea,b , C. Calabriaa,b,1 , S.S. Chhibraa,b , A. Colaleoa , D. Creanzaa,c ,\nN. De Filippisa,c,1 , M. De Palmaa,b , L. Fiorea , G. Iasellia,c , L. Lusitoa,b , G. Maggia,c ,\nM. Maggia , B. Marangellia,b , S. Mya,c , S. Nuzzoa,b , N. Pacificoa,b , A. Pompilia,b , G. Pugliesea,c ,\nG. Selvaggia,b , L. Silvestrisa , G. Singha,b , G. Zitoa\nINFN Sezione di Bologna a , Università di Bologna b , Bologna, Italy\nG. Abbiendia , A.C. Benvenutia , D. Bonacorsia,b , S. Braibant-Giacomellia,b , L. Brigliadoria,b ,\nP. Capiluppia,b , A. Castroa,b , F.R. Cavalloa , M. Cuffiania,b , G.M. Dallavallea , F. Fabbria ,\nA. Fanfania,b , D. Fasanellaa,b,1 , P. Giacomellia , C. Grandia , L. Guiducci, S. Marcellinia ,\nG. Masettia , M. Meneghellia,b,1 , A. Montanaria , F.L. Navarriaa,b , F. Odoricia , A. Perrottaa ,\nF. Primaveraa,b , A.M. Rossia,b , T. Rovellia,b , G. Sirolia,b , R. Travaglinia,b\nINFN Sezione di Catania a , Università di Catania b , Catania, Italy\nS. Albergoa,b , G. Cappelloa,b , M. Chiorbolia,b , S. Costaa,b , R. Potenzaa,b , A. Tricomia,b , C. Tuvea,b\nINFN Sezione di Firenze a , Università di Firenze b , Firenze, Italy\nG. Barbaglia , V. Ciullia,b , C. Civininia , R. D'Alessandroa,b , E. Focardia,b , S. Frosalia,b , E. Galloa ,\nS. Gonzia,b , M. Meschinia , S. Paolettia , G. Sguazzonia , A. Tropianoa,1\nINFN Laboratori Nazionali di Frascati, Frascati, Italy\nL. Benussi, S. Bianco, S. Colafranceschi25 , F. Fabbri, D. Piccolo\nINFN Sezione di Genova, Genova, Italy\nP. Fabbricatore, R. Musenich\nINFN Sezione di Milano-Bicocca a , Università di Milano-Bicocca b , Milano, Italy\nA. Benagliaa,b,1 , F. De Guioa,b , L. Di Matteoa,b,1 , S. Fiorendia,b , S. Gennaia,1 , A. Ghezzia,b ,\nS. Malvezzia , R.A. Manzonia,b , A. Martellia,b , A. Massironia,b,1 , D. Menascea , L. Moronia ,\nM. Paganonia,b , D. Pedrinia , S. Ragazzia,b , N. Redaellia , S. Salaa , T. Tabarelli de Fatisa,b\nINFN Sezione di Napoli a , Università di Napoli \"Federico II\" b , Napoli, Italy\nS. Buontempoa , C.A. Carrillo Montoyaa,1 , N. Cavalloa,26 , A. De Cosaa,b , O. Doganguna,b ,\nF. Fabozzia,26 , A.O.M. Iorioa,1 , L. Listaa , S. Meolaa,27 , M. Merolaa,b , P. Paoluccia\nINFN Sezione di Padova a , Università di Padova b , Università di Trento (Trento) c , Padova,\nItaly\nP. Azzia , N. Bacchettaa,1 , P. Bellana,b , D. Biselloa,b , A. Brancaa,1 , R. Carlina,b , P. Checchiaa ,\nT. Dorigoa , U. Dossellia , F. Gasparinia,b , A. Gozzelinoa , K. Kanishcheva,c , S. Lacapraraa,28 ,\nI. Lazzizzeraa,c , M. Margonia,b , A.T. Meneguzzoa,b , M. Nespoloa,1 , L. Perrozzia , N. Pozzobona,b ,\nP. Ronchesea,b , F. Simonettoa,b , E. Torassaa , M. Tosia,b,1 , S. Vaninia,b , P. Zottoa,b\nINFN Sezione di Pavia a , Università di Pavia b , Pavia, Italy\nM. Gabusia,b , S.P. Rattia,b , C. Riccardia,b , P. Torrea,b , P. Vituloa,b\nINFN Sezione di Perugia a , Università di Perugia b , Perugia, Italy\nG.M. Bileia , L. Fanòa,b , P. Laricciaa,b , A. Lucaronia,b,1 , G. Mantovania,b , M. Menichellia ,\nA. Nappia,b , F. Romeoa,b , A. Saha, A. Santocchiaa,b , S. Taronia,b,1\n\n\f28\n\nA\n\nThe CMS Collaboration\n\nINFN Sezione di Pisa a , Università di Pisa b , Scuola Normale Superiore di Pisa c , Pisa, Italy\nP. Azzurria,c , G. Bagliesia , T. Boccalia , G. Broccoloa,c , R. Castaldia , R.T. D'Agnoloa,c ,\nR. Dell'Orsoa , F. Fioria,b , L. Foàa,c , A. Giassia , A. Kraana , F. Ligabuea,c , T. Lomtadzea ,\nL. Martinia,29 , A. Messineoa,b , F. Pallaa , F. Palmonaria , A. Rizzia,b , A.T. Serbana,30 , P. Spagnoloa ,\nR. Tenchinia , G. Tonellia,b,1 , A. Venturia,1 , P.G. Verdinia\nINFN Sezione di Roma a , Università di Roma \"La Sapienza\" b , Roma, Italy\nL. Baronea,b , F. Cavallaria , D. Del Rea,b,1 , M. Diemoza , C. Fanellia,b , M. Grassia,1 , E. Longoa,b ,\nP. Meridiania,1 , F. Michelia,b , S. Nourbakhsha , G. Organtinia,b , F. Pandolfia,b , R. Paramattia ,\nS. Rahatloua,b , M. Sigamania , L. Soffia,b\nINFN Sezione di Torino a , Università di Torino b , Università del Piemonte Orientale (Novara) c , Torino, Italy\nN. Amapanea,b , R. Arcidiaconoa,c , S. Argiroa,b , M. Arneodoa,c , C. Biinoa , C. Bottaa,b ,\nN. Cartigliaa , R. Castelloa,b , M. Costaa,b , N. Demariaa , A. Grazianoa,b , C. Mariottia,1 , S. Masellia ,\nG. Mazza, E. Migliorea,b , V. Monacoa,b , M. Musicha,1 , M.M. Obertinoa,c , N. Pastronea ,\nM. Pelliccionia , A. Potenzaa,b , A. Romeroa,b , M. Ruspaa,c , R. Sacchia,b , A. Solanoa,b , A. Staianoa ,\nA. Vilela Pereiraa\nINFN Sezione di Trieste a , Università di Trieste b , Trieste, Italy\nS. Belfortea , F. Cossuttia , G. Della Riccaa,b , B. Gobboa , M. Maronea,b,1 , D. Montaninoa,b,1 ,\nA. Penzoa , A. Schizzia,b\nKangwon National University, Chunchon, Korea\nS.G. Heo, T.Y. Kim, S.K. Nam\nKyungpook National University, Daegu, Korea\nS. Chang, J. Chung, D.H. Kim, G.N. Kim, D.J. Kong, H. Park, S.R. Ro, D.C. Son\nChonnam National University, Institute for Universe and Elementary Particles, Kwangju,\nKorea\nJ.Y. Kim, Zero J. Kim, S. Song\nKonkuk University, Seoul, Korea\nH.Y. Jo\nKorea University, Seoul, Korea\nS. Choi, D. Gyun, B. Hong, M. Jo, H. Kim, T.J. Kim, K.S. Lee, D.H. Moon, S.K. Park, E. Seo\nUniversity of Seoul, Seoul, Korea\nM. Choi, S. Kang, H. Kim, J.H. Kim, C. Park, I.C. Park, S. Park, G. Ryu\nSungkyunkwan University, Suwon, Korea\nY. Cho, Y. Choi, Y.K. Choi, J. Goh, M.S. Kim, B. Lee, J. Lee, S. Lee, H. Seo, I. Yu\nVilnius University, Vilnius, Lithuania\nM.J. Bilinskas, I. Grigelionis, M. Janulis, A. Juodagalvis\nCentro de Investigacion y de Estudios Avanzados del IPN, Mexico City, Mexico\nH. Castilla-Valdez, E. De La Cruz-Burelo, I. Heredia-de La Cruz, R. Lopez-Fernandez,\nR. Magaña Villalba, J. Martı́nez-Ortega, A. Sánchez-Hernández, L.M. Villasenor-Cendejas\nUniversidad Iberoamericana, Mexico City, Mexico\nS. Carrillo Moreno, F. Vazquez Valencia\n\n\f29\nBenemerita Universidad Autonoma de Puebla, Puebla, Mexico\nH.A. Salazar Ibarguen\nUniversidad Autónoma de San Luis Potosı́, San Luis Potosı́, Mexico\nE. Casimiro Linares, A. Morelos Pineda, M.A. Reyes-Santos\nUniversity of Auckland, Auckland, New Zealand\nD. Krofcheck\nUniversity of Canterbury, Christchurch, New Zealand\nA.J. Bell, P.H. Butler, R. Doesburg, S. Reucroft, H. Silverwood\nNational Centre for Physics, Quaid-I-Azam University, Islamabad, Pakistan\nM. Ahmad, M.I. Asghar, H.R. Hoorani, S. Khalid, W.A. Khan, T. Khurshid, S. Qazi, M.A. Shah,\nM. Shoaib\nInstitute of Experimental Physics, Faculty of Physics, University of Warsaw, Warsaw, Poland\nG. Brona, M. Cwiok, W. Dominik, K. Doroba, A. Kalinowski, M. Konecki, J. Krolikowski\nSoltan Institute for Nuclear Studies, Warsaw, Poland\nH. Bialkowska, B. Boimska, T. Frueboes, R. Gokieli, M. Górski, M. Kazana, K. Nawrocki,\nK. Romanowska-Rybinska, M. Szleper, G. Wrochna, P. Zalewski\nLaboratório de Instrumentação e Fı́sica Experimental de Partı́culas, Lisboa, Portugal\nN. Almeida, P. Bargassa, A. David, P. Faccioli, P.G. Ferreira Parracho, M. Gallinaro, P. Musella,\nJ. Pela1 , J. Seixas, J. Varela, P. Vischia\nJoint Institute for Nuclear Research, Dubna, Russia\nI. Belotelov, P. Bunin, M. Gavrilenko, I. Golutvin, V. Karjavin, V. Konoplyanikov, G. Kozlov,\nA. Lanev, A. Malakhov, P. Moisenz, V. Palichik, V. Perelygin, M. Savina, S. Shmatov, V. Smirnov,\nA. Volodko, A. Zarubin\nPetersburg Nuclear Physics Institute, Gatchina (St Petersburg), Russia\nS. Evstyukhin, V. Golovtsov, Y. Ivanov, V. Kim, P. Levchenko, V. Murzin, V. Oreshkin, I. Smirnov,\nV. Sulimov, L. Uvarov, S. Vavilov, A. Vorobyev, An. Vorobyev\nInstitute for Nuclear Research, Moscow, Russia\nYu. Andreev, A. Dermenev, S. Gninenko, N. Golubev, M. Kirsanov, N. Krasnikov, V. Matveev,\nA. Pashenkov, D. Tlisov, A. Toropin\nInstitute for Theoretical and Experimental Physics, Moscow, Russia\nV. Epshteyn, M. Erofeeva, V. Gavrilov, M. Kossov1 , N. Lychkovskaya, V. Popov, G. Safronov,\nS. Semenov, V. Stolin, E. Vlasov, A. Zhokin\nMoscow State University, Moscow, Russia\nA. Belyaev, E. Boos, M. Dubinin4 , L. Dudko, A. Ershov, A. Gribushin, V. Klyukhin, O. Kodolova,\nI. Lokhtin, A. Markina, S. Obraztsov, M. Perfilov, S. Petrushanko, L. Sarycheva† , V. Savrin,\nA. Snigirev\nP.N. Lebedev Physical Institute, Moscow, Russia\nV. Andreev, M. Azarkin, I. Dremin, M. Kirakosyan, A. Leonidov, G. Mesyats, S.V. Rusakov,\nA. Vinogradov\nState Research Center of Russian Federation, Institute for High Energy Physics, Protvino,\nRussia\nI. Azhgirey, I. Bayshev, S. Bitioukov, V. Grishin1 , V. Kachanov, D. Konstantinov, A. Korablev,\n\n\f30\n\nA\n\nThe CMS Collaboration\n\nV. Krychkine, V. Petrov, R. Ryutin, A. Sobol, L. Tourtchanovitch, S. Troshin, N. Tyurin,\nA. Uzunian, A. Volkov\nUniversity of Belgrade, Faculty of Physics and Vinca Institute of Nuclear Sciences, Belgrade,\nSerbia\nP. Adzic31 , M. Djordjevic, M. Ekmedzic, D. Krpic31 , J. Milosevic\nCentro de Investigaciones Energéticas Medioambientales y Tecnológicas (CIEMAT),\nMadrid, Spain\nM. Aguilar-Benitez, J. Alcaraz Maestre, P. Arce, C. Battilana, E. Calvo, M. Cerrada, M. Chamizo\nLlatas, N. Colino, B. De La Cruz, A. Delgado Peris, C. Diez Pardos, D. Domı́nguez Vázquez,\nC. Fernandez Bedoya, J.P. Fernández Ramos, A. Ferrando, J. Flix, M.C. Fouz, P. Garcia-Abia,\nO. Gonzalez Lopez, S. Goy Lopez, J.M. Hernandez, M.I. Josa, G. Merino, J. Puerta Pelayo,\nI. Redondo, L. Romero, J. Santaolalla, M.S. Soares, C. Willmott\nUniversidad Autónoma de Madrid, Madrid, Spain\nC. Albajar, G. Codispoti, J.F. de Trocóniz\nUniversidad de Oviedo, Oviedo, Spain\nJ. Cuevas, J. Fernandez Menendez, S. Folgueras, I. Gonzalez Caballero, L. Lloret Iglesias,\nJ. Piedra Gomez32 , J.M. Vizan Garcia\nInstituto de Fı́sica de Cantabria (IFCA), CSIC-Universidad de Cantabria, Santander, Spain\nJ.A. Brochero Cifuentes, I.J. Cabrillo, A. Calderon, S.H. Chuang, J. Duarte Campderros,\nM. Felcini33 , M. Fernandez, G. Gomez, J. Gonzalez Sanchez, C. Jorda, P. Lobelle Pardo, A. Lopez\nVirto, J. Marco, R. Marco, C. Martinez Rivero, F. Matorras, F.J. Munoz Sanchez, T. Rodrigo,\nA.Y. Rodrı́guez-Marrero, A. Ruiz-Jimeno, L. Scodellaro, M. Sobron Sanudo, I. Vila, R. Vilar\nCortabitarte\nCERN, European Organization for Nuclear Research, Geneva, Switzerland\nD. Abbaneo, E. Auffray, G. Auzinger, P. Baillon, A.H. Ball, D. Barney, C. Bernet5 , G. Bianchi,\nP. Bloch, A. Bocci, A. Bonato, H. Breuker, K. Bunkowski, T. Camporesi, G. Cerminara,\nT. Christiansen, J.A. Coarasa Perez, D. D'Enterria, A. De Roeck, S. Di Guida, M. Dobson,\nN. Dupont-Sagorin, A. Elliott-Peisert, B. Frisch, W. Funk, G. Georgiou, M. Giffels, D. Gigi,\nK. Gill, D. Giordano, M. Giunta, F. Glege, R. Gomez-Reino Garrido, P. Govoni, S. Gowdy,\nR. Guida, M. Hansen, P. Harris, C. Hartl, J. Harvey, B. Hegner, A. Hinzmann, V. Innocente,\nP. Janot, K. Kaadze, E. Karavakis, K. Kousouris, P. Lecoq, P. Lenzi, C. Lourenço, T. Mäki,\nM. Malberti, L. Malgeri, M. Mannelli, L. Masetti, F. Meijers, S. Mersi, E. Meschi, R. Moser,\nM.U. Mozer, M. Mulders, E. Nesvold, M. Nguyen, T. Orimoto, L. Orsini, E. Palencia Cortezon,\nE. Perez, A. Petrilli, A. Pfeiffer, M. Pierini, M. Pimiä, D. Piparo, G. Polese, L. Quertenmont,\nA. Racz, W. Reece, J. Rodrigues Antunes, G. Rolandi34 , T. Rommerskirchen, C. Rovelli35 ,\nM. Rovere, H. Sakulin, F. Santanastasio, C. Schäfer, C. Schwick, I. Segoni, S. Sekmen, A. Sharma,\nP. Siegrist, P. Silva, M. Simon, P. Sphicas36 , D. Spiga, M. Spiropulu4 , M. Stoye, A. Tsirou,\nG.I. Veres17 , J.R. Vlimant, H.K. Wöhri, S.D. Worm37 , W.D. Zeuner\nPaul Scherrer Institut, Villigen, Switzerland\nW. Bertl, K. Deiters, W. Erdmann, K. Gabathuler, R. Horisberger, Q. Ingram, H.C. Kaestli,\nS. König, D. Kotlinski, U. Langenegger, F. Meier, D. Renker, T. Rohe, J. Sibille38\nInstitute for Particle Physics, ETH Zurich, Zurich, Switzerland\nL. Bäni, P. Bortignon, M.A. Buchmann, B. Casal, N. Chanon, Z. Chen, A. Deisher, G. Dissertori,\nM. Dittmar, M. Dünser, J. Eugster, K. Freudenreich, C. Grab, P. Lecomte, W. Lustermann,\n\n\f31\nA.C. Marini, P. Martinez Ruiz del Arbol, N. Mohr, F. Moortgat, C. Nägeli39 , P. Nef, F. NessiTedaldi, L. Pape, F. Pauss, M. Peruzzi, F.J. Ronga, M. Rossini, L. Sala, A.K. Sanchez,\nA. Starodumov40 , B. Stieger, M. Takahashi, L. Tauscher† , A. Thea, K. Theofilatos, D. Treille,\nC. Urscheler, R. Wallny, H.A. Weber, L. Wehrli\nUniversität Zürich, Zurich, Switzerland\nE. Aguilo, C. Amsler, V. Chiochia, S. De Visscher, C. Favaro, M. Ivova Rikova, B. Millan Mejias,\nP. Otiougova, P. Robmann, H. Snoek, S. Tupputi, M. Verzetti\nNational Central University, Chung-Li, Taiwan\nY.H. Chang, K.H. Chen, A. Go, C.M. Kuo, S.W. Li, W. Lin, Z.K. Liu, Y.J. Lu, D. Mekterovic,\nA.P. Singh, R. Volpe, S.S. Yu\nNational Taiwan University (NTU), Taipei, Taiwan\nP. Bartalini, P. Chang, Y.H. Chang, Y.W. Chang, Y. Chao, K.F. Chen, C. Dietz, U. Grundler, W.S. Hou, Y. Hsiung, K.Y. Kao, Y.J. Lei, R.-S. Lu, D. Majumder, E. Petrakou, X. Shi, J.G. Shiu,\nY.M. Tzeng, M. Wang\nCukurova University, Adana, Turkey\nA. Adiguzel, M.N. Bakirci41 , S. Cerci42 , C. Dozen, I. Dumanoglu, E. Eskut, S. Girgis,\nG. Gokbulut, I. Hos, E.E. Kangal, G. Karapinar, A. Kayis Topaksu, G. Onengut, K. Ozdemir,\nS. Ozturk43 , A. Polatoz, K. Sogut44 , D. Sunar Cerci42 , B. Tali42 , H. Topakli41 , L.N. Vergili,\nM. Vergili\nMiddle East Technical University, Physics Department, Ankara, Turkey\nI.V. Akin, T. Aliev, B. Bilin, S. Bilmis, M. Deniz, H. Gamsizkan, A.M. Guler, K. Ocalan,\nA. Ozpineci, M. Serin, R. Sever, U.E. Surat, M. Yalvac, E. Yildirim, M. Zeyrek\nBogazici University, Istanbul, Turkey\nM. Deliomeroglu, E. Gülmez, B. Isildak, M. Kaya45 , O. Kaya45 , S. Ozkorucuklu46 , N. Sonmez47\nIstanbul Technical University, Istanbul, Turkey\nK. Cankocak\nNational Scientific Center, Kharkov Institute of Physics and Technology, Kharkov, Ukraine\nL. Levchuk\nUniversity of Bristol, Bristol, United Kingdom\nF. Bostock, J.J. Brooke, E. Clement, D. Cussans, H. Flacher, R. Frazier, J. Goldstein, M. Grimes,\nG.P. Heath, H.F. Heath, L. Kreczko, S. Metson, D.M. Newbold37 , K. Nirunpong, A. Poll,\nS. Senkin, V.J. Smith, T. Williams\nRutherford Appleton Laboratory, Didcot, United Kingdom\nL. Basso48 , K.W. Bell, A. Belyaev48 , C. Brew, R.M. Brown, D.J.A. Cockerill, J.A. Coughlan,\nK. Harder, S. Harper, J. Jackson, B.W. Kennedy, E. Olaiya, D. Petyt, B.C. Radburn-Smith,\nC.H. Shepherd-Themistocleous, I.R. Tomalin, W.J. Womersley\nImperial College, London, United Kingdom\nR. Bainbridge, G. Ball, R. Beuselinck, O. Buchmuller, D. Colling, N. Cripps, M. Cutajar,\nP. Dauncey, G. Davies, M. Della Negra, W. Ferguson, J. Fulcher, D. Futyan, A. Gilbert,\nA. Guneratne Bryer, G. Hall, Z. Hatherell, J. Hays, G. Iles, M. Jarvis, G. Karapostoli, L. Lyons,\nA.-M. Magnan, J. Marrouche, B. Mathias, R. Nandi, J. Nash, A. Nikitenko40 , A. Papageorgiou,\nM. Pesaresi, K. Petridis, M. Pioppi49 , D.M. Raymond, S. Rogerson, N. Rompotis, A. Rose,\nM.J. Ryan, C. Seez, P. Sharp† , A. Sparrow, A. Tapper, M. Vazquez Acosta, T. Virdee, S. Wakefield,\nN. Wardle, T. Whyntie\n\n\f32\n\nA\n\nThe CMS Collaboration\n\nBrunel University, Uxbridge, United Kingdom\nM. Barrett, M. Chadwick, J.E. Cole, P.R. Hobson, A. Khan, P. Kyberd, D. Leggat, D. Leslie,\nW. Martin, I.D. Reid, P. Symonds, L. Teodorescu, M. Turner\nBaylor University, Waco, USA\nK. Hatakeyama, H. Liu, T. Scarborough\nThe University of Alabama, Tuscaloosa, USA\nC. Henderson, P. Rumerio\nBoston University, Boston, USA\nA. Avetisyan, T. Bose, C. Fantasia, A. Heister, J. St. John, P. Lawson, D. Lazic, J. Rohlf, D. Sperka,\nL. Sulak\nBrown University, Providence, USA\nJ. Alimena, S. Bhattacharya, D. Cutts, A. Ferapontov, U. Heintz, S. Jabeen, G. Kukartsev,\nG. Landsberg, M. Luk, M. Narain, D. Nguyen, M. Segala, T. Sinthuprasith, T. Speer, K.V. Tsang\nUniversity of California, Davis, Davis, USA\nR. Breedon, G. Breto, M. Calderon De La Barca Sanchez, S. Chauhan, M. Chertok, J. Conway,\nR. Conway, P.T. Cox, J. Dolen, R. Erbacher, M. Gardner, R. Houtz, W. Ko, A. Kopecky, R. Lander,\nO. Mall, T. Miceli, R. Nelson, D. Pellett, B. Rutherford, M. Searle, J. Smith, M. Squires,\nM. Tripathi, R. Vasquez Sierra\nUniversity of California, Los Angeles, Los Angeles, USA\nV. Andreev, D. Cline, R. Cousins, J. Duris, S. Erhan, P. Everaerts, C. Farrell, J. Hauser,\nM. Ignatenko, C. Plager, G. Rakness, P. Schlein† , J. Tucker, V. Valuev, M. Weber\nUniversity of California, Riverside, Riverside, USA\nJ. Babb, R. Clare, M.E. Dinardo, J. Ellison, J.W. Gary, F. Giordano, G. Hanson, G.Y. Jeng50 , H. Liu,\nO.R. Long, A. Luthra, H. Nguyen, S. Paramesvaran, J. Sturdy, S. Sumowidagdo, R. Wilken,\nS. Wimpenny\nUniversity of California, San Diego, La Jolla, USA\nW. Andrews, J.G. Branson, G.B. Cerati, S. Cittolin, D. Evans, F. Golf, A. Holzner, R. Kelley,\nM. Lebourgeois, J. Letts, I. Macneill, B. Mangano, J. Muelmenstaedt, S. Padhi, C. Palmer,\nG. Petrucciani, M. Pieri, R. Ranieri, M. Sani, V. Sharma, S. Simon, E. Sudano, M. Tadel, Y. Tu,\nA. Vartak, S. Wasserbaech51 , F. Würthwein, A. Yagil, J. Yoo\nUniversity of California, Santa Barbara, Santa Barbara, USA\nD. Barge, R. Bellan, C. Campagnari, M. D'Alfonso, T. Danielson, K. Flowers, P. Geffert,\nJ. Incandela, C. Justus, P. Kalavase, S.A. Koay, D. Kovalskyi1 , V. Krutelyov, S. Lowette,\nN. Mccoll, V. Pavlunin, F. Rebassoo, J. Ribnik, J. Richman, R. Rossin, D. Stuart, W. To, C. West\nCalifornia Institute of Technology, Pasadena, USA\nA. Apresyan, A. Bornheim, Y. Chen, E. Di Marco, J. Duarte, M. Gataullin, Y. Ma, A. Mott,\nH.B. Newman, C. Rogan, V. Timciuc, P. Traczyk, J. Veverka, R. Wilkinson, Y. Yang, R.Y. Zhu\nCarnegie Mellon University, Pittsburgh, USA\nB. Akgun, R. Carroll, T. Ferguson, Y. Iiyama, D.W. Jang, Y.F. Liu, M. Paulini, H. Vogel,\nI. Vorobiev\nUniversity of Colorado at Boulder, Boulder, USA\nJ.P. Cumalat, B.R. Drell, C.J. Edelmaier, W.T. Ford, A. Gaz, B. Heyburn, E. Luiggi Lopez,\nJ.G. Smith, K. Stenson, K.A. Ulmer, S.R. Wagner\n\n\f33\nCornell University, Ithaca, USA\nL. Agostino, J. Alexander, A. Chatterjee, N. Eggert, L.K. Gibbons, B. Heltsley, W. Hopkins,\nA. Khukhunaishvili, B. Kreis, N. Mirman, G. Nicolas Kaufman, J.R. Patterson, A. Ryd,\nE. Salvati, W. Sun, W.D. Teo, J. Thom, J. Thompson, J. Vaughan, Y. Weng, L. Winstrom, P. Wittich\nFairfield University, Fairfield, USA\nD. Winn\nFermi National Accelerator Laboratory, Batavia, USA\nS. Abdullin, M. Albrow, J. Anderson, L.A.T. Bauerdick, A. Beretvas, J. Berryhill, P.C. Bhat,\nI. Bloch, K. Burkett, J.N. Butler, V. Chetluru, H.W.K. Cheung, F. Chlebana, V.D. Elvira, I. Fisk,\nJ. Freeman, Y. Gao, D. Green, O. Gutsche, A. Hahn, J. Hanlon, R.M. Harris, J. Hirschauer,\nB. Hooberman, S. Jindariani, M. Johnson, U. Joshi, B. Kilminster, B. Klima, S. Kunori, S. Kwan,\nD. Lincoln, R. Lipton, L. Lueking, J. Lykken, K. Maeshima, J.M. Marraffino, S. Maruyama,\nD. Mason, P. McBride, K. Mishra, S. Mrenna, Y. Musienko52 , C. Newman-Holmes, V. O'Dell,\nO. Prokofyev, E. Sexton-Kennedy, S. Sharma, W.J. Spalding, L. Spiegel, P. Tan, L. Taylor,\nS. Tkaczyk, N.V. Tran, L. Uplegger, E.W. Vaandering, R. Vidal, J. Whitmore, W. Wu, F. Yang,\nF. Yumiceva, J.C. Yun\nUniversity of Florida, Gainesville, USA\nD. Acosta, P. Avery, D. Bourilkov, M. Chen, S. Das, M. De Gruttola, G.P. Di Giovanni,\nD. Dobur, A. Drozdetskiy, R.D. Field, M. Fisher, Y. Fu, I.K. Furic, J. Gartner, J. Hugon, B. Kim,\nJ. Konigsberg, A. Korytov, A. Kropivnitskaya, T. Kypreos, J.F. Low, K. Matchev, P. Milenovic53 ,\nG. Mitselmakher, L. Muniz, R. Remington, A. Rinkevicius, P. Sellers, N. Skhirtladze,\nM. Snowball, J. Yelton, M. Zakaria\nFlorida International University, Miami, USA\nV. Gaultney, L.M. Lebolo, S. Linn, P. Markowitz, G. Martinez, J.L. Rodriguez\nFlorida State University, Tallahassee, USA\nT. Adams, A. Askew, J. Bochenek, J. Chen, B. Diamond, S.V. Gleyzer, J. Haas, S. Hagopian,\nV. Hagopian, M. Jenkins, K.F. Johnson, H. Prosper, V. Veeraraghavan, M. Weinberg\nFlorida Institute of Technology, Melbourne, USA\nM.M. Baarmand, B. Dorney, M. Hohlmann, H. Kalakhety, I. Vodopiyanov\nUniversity of Illinois at Chicago (UIC), Chicago, USA\nM.R. Adams, I.M. Anghel, L. Apanasevich, Y. Bai, V.E. Bazterra, R.R. Betts, J. Callner,\nR. Cavanaugh, C. Dragoiu, O. Evdokimov, E.J. Garcia-Solis, L. Gauthier, C.E. Gerber,\nD.J. Hofman, S. Khalatyan, F. Lacroix, M. Malek, C. O'Brien, C. Silkworth, D. Strom, N. Varelas\nThe University of Iowa, Iowa City, USA\nU. Akgun, E.A. Albayrak, B. Bilki54 , K. Chung, W. Clarida, F. Duru, S. Griffiths, C.K. Lae,\nJ.-P. Merlo, H. Mermerkaya55 , A. Mestvirishvili, A. Moeller, J. Nachtman, C.R. Newsom,\nE. Norbeck, J. Olson, Y. Onel, F. Ozok, S. Sen, E. Tiras, J. Wetzel, T. Yetkin, K. Yi\nJohns Hopkins University, Baltimore, USA\nB.A. Barnett, B. Blumenfeld, S. Bolognesi, D. Fehling, G. Giurgiu, A.V. Gritsan, Z.J. Guo, G. Hu,\nP. Maksimovic, S. Rappoccio, M. Swartz, A. Whitbeck\nThe University of Kansas, Lawrence, USA\nP. Baringer, A. Bean, G. Benelli, O. Grachov, R.P. Kenny Iii, M. Murray, D. Noonan, V. Radicci,\nS. Sanders, R. Stringer, G. Tinti, J.S. Wood, V. Zhukova\n\n\f34\n\nA\n\nThe CMS Collaboration\n\nKansas State University, Manhattan, USA\nA.F. Barfuss, T. Bolton, I. Chakaberia, A. Ivanov, S. Khalil, M. Makouski, Y. Maravin, S. Shrestha,\nI. Svintradze\nLawrence Livermore National Laboratory, Livermore, USA\nJ. Gronberg, D. Lange, D. Wright\nUniversity of Maryland, College Park, USA\nA. Baden, M. Boutemeur, B. Calvert, S.C. Eno, J.A. Gomez, N.J. Hadley, R.G. Kellogg, M. Kirn,\nT. Kolberg, Y. Lu, M. Marionneau, A.C. Mignerey, A. Peterman, K. Rossato, A. Skuja, J. Temple,\nM.B. Tonjes, S.C. Tonwar, E. Twedt\nMassachusetts Institute of Technology, Cambridge, USA\nG. Bauer, J. Bendavid, W. Busza, E. Butz, I.A. Cali, M. Chan, V. Dutta, G. Gomez Ceballos,\nM. Goncharov, K.A. Hahn, Y. Kim, M. Klute, Y.-J. Lee, W. Li, P.D. Luckey, T. Ma, S. Nahn,\nC. Paus, D. Ralph, C. Roland, G. Roland, M. Rudolph, G.S.F. Stephans, F. Stöckli, K. Sumorok,\nK. Sung, D. Velicanu, E.A. Wenger, R. Wolf, B. Wyslouch, S. Xie, M. Yang, Y. Yilmaz, A.S. Yoon,\nM. Zanetti\nUniversity of Minnesota, Minneapolis, USA\nS.I. Cooper, P. Cushman, B. Dahmes, A. De Benedetti, G. Franzoni, A. Gude, J. Haupt, S.C. Kao,\nK. Klapoetke, Y. Kubota, J. Mans, N. Pastika, V. Rekovic, R. Rusack, M. Sasseville, A. Singovsky,\nN. Tambe, J. Turkewitz\nUniversity of Mississippi, University, USA\nL.M. Cremaldi, R. Kroeger, L. Perera, R. Rahmat, D.A. Sanders\nUniversity of Nebraska-Lincoln, Lincoln, USA\nE. Avdeeva, K. Bloom, S. Bose, J. Butt, D.R. Claes, A. Dominguez, M. Eads, P. Jindal, J. Keller,\nI. Kravchenko, J. Lazo-Flores, H. Malbouisson, S. Malik, G.R. Snow\nState University of New York at Buffalo, Buffalo, USA\nU. Baur, A. Godshalk, I. Iashvili, S. Jain, A. Kharchilava, A. Kumar, S.P. Shipkowski, K. Smith\nNortheastern University, Boston, USA\nG. Alverson, E. Barberis, D. Baumgartel, M. Chasco, J. Haley, D. Trocino, D. Wood, J. Zhang\nNorthwestern University, Evanston, USA\nA. Anastassov, A. Kubik, N. Mucia, N. Odell, R.A. Ofierzynski, B. Pollack, A. Pozdnyakov,\nM. Schmitt, S. Stoynev, M. Velasco, S. Won\nUniversity of Notre Dame, Notre Dame, USA\nL. Antonelli, D. Berry, A. Brinkerhoff, M. Hildreth, C. Jessop, D.J. Karmgard, J. Kolb, K. Lannon,\nW. Luo, S. Lynch, N. Marinelli, D.M. Morse, T. Pearson, R. Ruchti, J. Slaunwhite, N. Valls,\nJ. Warchol, M. Wayne, M. Wolf, J. Ziegler\nThe Ohio State University, Columbus, USA\nB. Bylsma, L.S. Durkin, C. Hill, R. Hughes, P. Killewald, K. Kotov, T.Y. Ling, D. Puigh,\nM. Rodenburg, C. Vuosalo, G. Williams, B.L. Winer\nPrinceton University, Princeton, USA\nN. Adam, E. Berry, P. Elmer, D. Gerbaudo, V. Halyo, P. Hebda, J. Hegeman, A. Hunt, E. Laird,\nD. Lopes Pegna, P. Lujan, D. Marlow, T. Medvedeva, M. Mooney, J. Olsen, P. Piroué, X. Quan,\nA. Raval, H. Saka, D. Stickland, C. Tully, J.S. Werner, A. Zuranski\n\n\f35\nUniversity of Puerto Rico, Mayaguez, USA\nJ.G. Acosta, X.T. Huang, A. Lopez, H. Mendez, S. Oliveros, J.E. Ramirez Vargas,\nA. Zatserklyaniy\nPurdue University, West Lafayette, USA\nE. Alagoz, V.E. Barnes, D. Benedetti, G. Bolla, D. Bortoletto, M. De Mattia, A. Everett, Z. Hu,\nM. Jones, O. Koybasi, M. Kress, A.T. Laasanen, N. Leonardo, V. Maroussov, P. Merkel,\nD.H. Miller, N. Neumeister, I. Shipsey, D. Silvers, A. Svyatkovskiy, M. Vidal Marono, H.D. Yoo,\nJ. Zablocki, Y. Zheng\nPurdue University Calumet, Hammond, USA\nS. Guragain, N. Parashar\nRice University, Houston, USA\nA. Adair, C. Boulahouache, V. Cuplov, K.M. Ecklund, F.J.M. Geurts, B.P. Padley, R. Redjimi,\nJ. Roberts, J. Zabel\nUniversity of Rochester, Rochester, USA\nB. Betchart, A. Bodek, Y.S. Chung, R. Covarelli, P. de Barbaro, R. Demina, Y. Eshaq, A. GarciaBellido, P. Goldenzweig, Y. Gotra, J. Han, A. Harel, S. Korjenevski, D.C. Miner, D. Vishnevskiy,\nM. Zielinski\nThe Rockefeller University, New York, USA\nA. Bhatti, R. Ciesielski, L. Demortier, K. Goulianos, G. Lungu, S. Malik, C. Mesropian\nRutgers, the State University of New Jersey, Piscataway, USA\nS. Arora, A. Barker, J.P. Chou, C. Contreras-Campana, E. Contreras-Campana, D. Duggan,\nD. Ferencek, Y. Gershtein, R. Gray, E. Halkiadakis, D. Hidas, D. Hits, A. Lath, S. Panwalkar,\nM. Park, R. Patel, A. Richards, J. Robles, K. Rose, S. Salur, S. Schnetzer, C. Seitz, S. Somalwar,\nR. Stone, S. Thomas\nUniversity of Tennessee, Knoxville, USA\nG. Cerizza, M. Hollingsworth, S. Spanier, Z.C. Yang, A. York\nTexas A&M University, College Station, USA\nR. Eusebi, W. Flanagan, J. Gilmore, T. Kamon56 , V. Khotilovich, R. Montalvo, I. Osipenkov,\nY. Pakhotin, A. Perloff, J. Roe, A. Safonov, T. Sakuma, S. Sengupta, I. Suarez, A. Tatarinov,\nD. Toback\nTexas Tech University, Lubbock, USA\nN. Akchurin, J. Damgov, P.R. Dudero, C. Jeong, K. Kovitanggoon, S.W. Lee, T. Libeiro, Y. Roh,\nI. Volobouev\nVanderbilt University, Nashville, USA\nE. Appelt, D. Engh, C. Florez, S. Greene, A. Gurrola, W. Johns, P. Kurt, C. Maguire, A. Melo,\nP. Sheldon, B. Snook, S. Tuo, J. Velkovska\nUniversity of Virginia, Charlottesville, USA\nM.W. Arenton, M. Balazs, S. Boutle, B. Cox, B. Francis, J. Goodell, R. Hirosky, A. Ledovskoy,\nC. Lin, C. Neu, J. Wood, R. Yohay\nWayne State University, Detroit, USA\nS. Gollapinni, R. Harr, P.E. Karchin, C. Kottachchi Kankanamge Don, P. Lamichhane,\nA. Sakharov\n\n\f36\n\nA\n\nThe CMS Collaboration\n\nUniversity of Wisconsin, Madison, USA\nM. Anderson, M. Bachtis, D. Belknap, L. Borrello, D. Carlsmith, M. Cepeda, S. Dasu, L. Gray,\nK.S. Grogg, M. Grothe, R. Hall-Wilton, M. Herndon, A. Hervé, P. Klabbers, J. Klukas, A. Lanaro,\nC. Lazaridis, J. Leonard, R. Loveless, A. Mohapatra, I. Ojalvo, G.A. Pierro, I. Ross, A. Savin,\nW.H. Smith, J. Swanson\n†: Deceased\n1: Also at CERN, European Organization for Nuclear Research, Geneva, Switzerland\n2: Also at National Institute of Chemical Physics and Biophysics, Tallinn, Estonia\n3: Also at Universidade Federal do ABC, Santo Andre, Brazil\n4: Also at California Institute of Technology, Pasadena, USA\n5: Also at Laboratoire Leprince-Ringuet, Ecole Polytechnique, IN2P3-CNRS, Palaiseau, France\n6: Also at Suez Canal University, Suez, Egypt\n7: Also at Cairo University, Cairo, Egypt\n8: Also at British University, Cairo, Egypt\n9: Also at Fayoum University, El-Fayoum, Egypt\n10: Now at Ain Shams University, Cairo, Egypt\n11: Also at Soltan Institute for Nuclear Studies, Warsaw, Poland\n12: Also at Université de Haute-Alsace, Mulhouse, France\n13: Now at Joint Institute for Nuclear Research, Dubna, Russia\n14: Also at Moscow State University, Moscow, Russia\n15: Also at Brandenburg University of Technology, Cottbus, Germany\n16: Also at Institute of Nuclear Research ATOMKI, Debrecen, Hungary\n17: Also at Eötvös Loránd University, Budapest, Hungary\n18: Also at Tata Institute of Fundamental Research - HECR, Mumbai, India\n19: Now at King Abdulaziz University, Jeddah, Saudi Arabia\n20: Also at University of Visva-Bharati, Santiniketan, India\n21: Also at Sharif University of Technology, Tehran, Iran\n22: Also at Isfahan University of Technology, Isfahan, Iran\n23: Also at Shiraz University, Shiraz, Iran\n24: Also at Plasma Physics Research Center, Science and Research Branch, Islamic Azad\nUniversity, Teheran, Iran\n25: Also at Facoltà Ingegneria Università di Roma, Roma, Italy\n26: Also at Università della Basilicata, Potenza, Italy\n27: Also at Università degli Studi Guglielmo Marconi, Roma, Italy\n28: Also at Laboratori Nazionali di Legnaro dell' INFN, Legnaro, Italy\n29: Also at Università degli studi di Siena, Siena, Italy\n30: Also at University of Bucharest, Bucuresti-Magurele, Romania\n31: Also at Faculty of Physics of University of Belgrade, Belgrade, Serbia\n32: Also at University of Florida, Gainesville, USA\n33: Also at University of California, Los Angeles, Los Angeles, USA\n34: Also at Scuola Normale e Sezione dell' INFN, Pisa, Italy\n35: Also at INFN Sezione di Roma; Università di Roma \"La Sapienza\", Roma, Italy\n36: Also at University of Athens, Athens, Greece\n37: Also at Rutherford Appleton Laboratory, Didcot, United Kingdom\n38: Also at The University of Kansas, Lawrence, USA\n39: Also at Paul Scherrer Institut, Villigen, Switzerland\n40: Also at Institute for Theoretical and Experimental Physics, Moscow, Russia\n41: Also at Gaziosmanpasa University, Tokat, Turkey\n42: Also at Adiyaman University, Adiyaman, Turkey\n\n\f37\n43: Also at The University of Iowa, Iowa City, USA\n44: Also at Mersin University, Mersin, Turkey\n45: Also at Kafkas University, Kars, Turkey\n46: Also at Suleyman Demirel University, Isparta, Turkey\n47: Also at Ege University, Izmir, Turkey\n48: Also at School of Physics and Astronomy, University of Southampton, Southampton,\nUnited Kingdom\n49: Also at INFN Sezione di Perugia; Università di Perugia, Perugia, Italy\n50: Also at University of Sydney, Sydney, Australia\n51: Also at Utah Valley University, Orem, USA\n52: Also at Institute for Nuclear Research, Moscow, Russia\n53: Also at University of Belgrade, Faculty of Physics and Vinca Institute of Nuclear Sciences,\nBelgrade, Serbia\n54: Also at Argonne National Laboratory, Argonne, USA\n55: Also at Erzincan University, Erzincan, Turkey\n56: Also at Kyungpook National University, Daegu, Korea\n\n\f"}