{"id": "http://arxiv.org/abs/1012.1166v1", "guidislink": true, "updated": "2010-12-06T13:26:58Z", "updated_parsed": [2010, 12, 6, 13, 26, 58, 0, 340, 0], "published": "2010-12-06T13:26:58Z", "published_parsed": [2010, 12, 6, 13, 26, 58, 0, 340, 0], "title": "MIMAC : A micro-tpc matrix for directional detection of dark matter", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1012.0390%2C1012.2157%2C1012.0293%2C1012.0823%2C1012.5283%2C1012.0815%2C1012.5067%2C1012.4766%2C1012.1430%2C1012.2685%2C1012.2071%2C1012.5120%2C1012.0426%2C1012.0860%2C1012.0758%2C1012.1624%2C1012.2684%2C1012.5477%2C1012.0877%2C1012.3418%2C1012.3803%2C1012.5255%2C1012.4884%2C1012.5674%2C1012.4374%2C1012.3785%2C1012.5148%2C1012.3097%2C1012.5795%2C1012.3362%2C1012.3137%2C1012.5176%2C1012.2156%2C1012.5165%2C1012.2452%2C1012.2590%2C1012.4372%2C1012.1166%2C1012.5100%2C1012.3470%2C1012.1106%2C1012.2128%2C1012.0904%2C1012.1556%2C1012.4068%2C1012.5651%2C1012.0009%2C1012.3853%2C1012.3864%2C1012.0034%2C1012.5007%2C1012.2361%2C1012.0184%2C1012.4547%2C1012.1698%2C1012.5175%2C1012.3449%2C1012.3372%2C1012.2646%2C1012.3005%2C1012.0291%2C1012.2985%2C1012.3488%2C1012.0166%2C1012.3172%2C1012.1247%2C1012.4485%2C1012.2215%2C1012.4951%2C1012.5439%2C1012.4288%2C1012.2435%2C1012.2537%2C1012.5656%2C1012.5951%2C1012.4425%2C1012.0978%2C1012.1410%2C1012.0608%2C1012.3694%2C1012.5347%2C1012.2769%2C1012.2686%2C1012.2922%2C1012.0375%2C1012.4526%2C1012.0131%2C1012.5701%2C1012.0456%2C1012.0659%2C1012.1814%2C1012.3705%2C1012.0389%2C1012.4032%2C1012.0309%2C1012.2338%2C1012.4963%2C1012.3578%2C1012.2552%2C1012.4026%2C1012.0701&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "MIMAC : A micro-tpc matrix for directional detection of dark matter"}, "summary": "Directional detection of non-baryonic Dark Matter is a promising search\nstrategy for discriminating WIMP events from background. However, this strategy\nrequires both a precise measurement of the energy down to a few keV and 3D\nreconstruction of tracks down to a few mm. To achieve this goal, the MIMAC\nproject has been developed. It is based on a gaseous micro-TPC matrix, filled\nwith 3He, CF4 and/or C4H10. The first results on low energy nuclear recoils (1H\nand 19F) obtained with a low mono-energetic neutron field are presented. The\ndiscovery potential of this search strategy is discussed and illustrated by a\nrealistic case accessible to MIMAC.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1012.0390%2C1012.2157%2C1012.0293%2C1012.0823%2C1012.5283%2C1012.0815%2C1012.5067%2C1012.4766%2C1012.1430%2C1012.2685%2C1012.2071%2C1012.5120%2C1012.0426%2C1012.0860%2C1012.0758%2C1012.1624%2C1012.2684%2C1012.5477%2C1012.0877%2C1012.3418%2C1012.3803%2C1012.5255%2C1012.4884%2C1012.5674%2C1012.4374%2C1012.3785%2C1012.5148%2C1012.3097%2C1012.5795%2C1012.3362%2C1012.3137%2C1012.5176%2C1012.2156%2C1012.5165%2C1012.2452%2C1012.2590%2C1012.4372%2C1012.1166%2C1012.5100%2C1012.3470%2C1012.1106%2C1012.2128%2C1012.0904%2C1012.1556%2C1012.4068%2C1012.5651%2C1012.0009%2C1012.3853%2C1012.3864%2C1012.0034%2C1012.5007%2C1012.2361%2C1012.0184%2C1012.4547%2C1012.1698%2C1012.5175%2C1012.3449%2C1012.3372%2C1012.2646%2C1012.3005%2C1012.0291%2C1012.2985%2C1012.3488%2C1012.0166%2C1012.3172%2C1012.1247%2C1012.4485%2C1012.2215%2C1012.4951%2C1012.5439%2C1012.4288%2C1012.2435%2C1012.2537%2C1012.5656%2C1012.5951%2C1012.4425%2C1012.0978%2C1012.1410%2C1012.0608%2C1012.3694%2C1012.5347%2C1012.2769%2C1012.2686%2C1012.2922%2C1012.0375%2C1012.4526%2C1012.0131%2C1012.5701%2C1012.0456%2C1012.0659%2C1012.1814%2C1012.3705%2C1012.0389%2C1012.4032%2C1012.0309%2C1012.2338%2C1012.4963%2C1012.3578%2C1012.2552%2C1012.4026%2C1012.0701&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Directional detection of non-baryonic Dark Matter is a promising search\nstrategy for discriminating WIMP events from background. However, this strategy\nrequires both a precise measurement of the energy down to a few keV and 3D\nreconstruction of tracks down to a few mm. To achieve this goal, the MIMAC\nproject has been developed. It is based on a gaseous micro-TPC matrix, filled\nwith 3He, CF4 and/or C4H10. The first results on low energy nuclear recoils (1H\nand 19F) obtained with a low mono-energetic neutron field are presented. The\ndiscovery potential of this search strategy is discussed and illustrated by a\nrealistic case accessible to MIMAC."}, "authors": ["D. Santos", "J. Billard", "G. Bosson", "O. Bourrion", "C. Grignon", "O. Guillaudin", "F. Mayet", "J. P. Richer", "E. Ferrer", "I. Giomataris", "F. J. Iguaz", "J. P. Mols", "A. Allaoua", "C. Golabek", "L. Lebreton"], "author_detail": {"name": "L. Lebreton"}, "author": "L. Lebreton", "arxiv_comment": "Proceedings of Identification of Dark Matter 2010-IDM2010 conference", "links": [{"href": "http://arxiv.org/abs/1012.1166v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1012.1166v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "astro-ph.IM", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph.IM", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "astro-ph.CO", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1012.1166v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1012.1166v1", "journal_reference": null, "doi": null, "fulltext": "arXiv:1012.1166v1 [astro-ph.IM] 6 Dec 2010\n\nMIMAC: A micro-tpc matrix for directional detection\nof dark matter\n\nD. Santos∗, J. Billard, G. Bosson, O. Bourrion, C. Grignon, O. Guillaudin, F. Mayet,\nJ.P. Richer\nLPSC, Universite Joseph Fourier Grenoble 1, CNRS/IN2P3, Institut Polytechnique de Grenoble\nE-mail: Daniel.Santos@lpsc.in2p3.fr\n\nE. Ferrer, I. Giomataris, F.J. Iguaz, J.P. Mols\nIRFU,CEA Saclay, 91191 Gif-sur-Yvette cedex\n\nA. Allaoua, C. Golabek, L. Lebreton\nLMDN, IRSN Cadarache, 13115 Saint-Paul-Lez-Durance\nDirectional detection of non-baryonic Dark Matter is a promising search strategy for discriminating WIMP events from background. However, this strategy requires both a precise measurement\nof the energy down to a few keV and 3D reconstruction of tracks down to a few mm. To achieve\nthis goal, the MIMAC project has been developed. It is based on a gaseous micro-TPC matrix,\nfilled with 3 He, CF4 and/or C4 H10 . The first results on low energy nuclear recoils (1 H and 19 F)\nobtained with a low mono-energetic neutron field are presented. The discovery potential of this\nsearch strategy is discussed and illustrated by a realistic case accessible to MIMAC.\n\nIdentification of Dark Matter 2010-IDM2010\nJuly 26-30, 2010\nMontpellier France\n∗ Speaker.\n\nc Copyright owned by the author(s) under the terms of the Creative Commons Attribution-NonCommercial-ShareAlike Licence.\n\nhttp://pos.sissa.it/\n\n\fMIMAC: Directional detection\n\nD. Santos\n\n1. Introduction\nDirectional detection of Dark Matter is based on the fact that the solar system moves with respect to the center of our galaxy with a mean velocity of roughly 220 km/s [1]. Taking into account\nthe hypothesis of the existence of a galactic halo of DM formed by WIMPs (Weakly Interacting\nParticles) with a negligible rotation velocity, we can expect a privileged direction for the nuclear\nrecoils in our detector, coming out from elastic collision with those WIMPs.\nThe MIMAC (MIcro-tpc MAtrix of Chambers) detector project tries to get these elusive events\nby a double detection: ionization and track, at low gas pressure with low mass target nuclei (H, 19F,\n3He). In order to have a significant cross section we explore the axial, spin dependant, interaction\non odd nuclei. The very weak correlation between the neutralino-nucleon scalar cross section and\nthe axial one, as it was shown in [2], makes this research, at the same time, complementary to the\nmassive target experiments.\n\n2. MIMAC prototype\nThe MIMAC prototype consists of one of the chamber of the matrix allowing to show the\nionization and track measurement performances needed to achieve the directional detection strategy. The primary electron-ion pairs produced by a nuclear recoil in one chamber of the matrix are\ndetected by driving the electrons to the grid of a bulk micromegas[3] and producing the avalanche\nin a very thin gap (128 or 256μ m).\n\nFigure 1: Track reconstruction in MIMAC. The anode is read-out every 25 ns and the 3D track is recontructed, knowing the drift velocity of primary electrons, from the consecutive number of images, defining\nthe event, from the anode.\n\nAs pictured on figure 1, the electrons move towards the grid in the drift space and are projected\non the anode thus allowing to get information on X and Y coordinates. To access the X and Y\ndimensions with a 100 μ m spatial resolution, a bulk micromegas with a 4 by 4 cm active area,\nsegmented in pixels with a pitch of 350 μ m is used as 2D readout. In order to reconstruct the\nthird dimension Z of the recoil, the LPSC developed a self-triggered electronics able to perform\nthe anode sampling at a frequency of 40 MHz. This includes a dedicated 16 channels ASIC [7]\nassociated to a DAQ [8].\n2\n\n\fMIMAC: Directional detection\n\nD. Santos\n\nIn order to get the total recoil energy we need to know the ionization quenching factor (IQF)\nof the nuclear recoil in the gas used. We have developped at the LPSC a dedicated experimental\nfacility to measure such IQF. A precise assessment of the available ionization energy has been\nperformed by Santos et al. [4] in He + 5%C4 H10 mixture within the dark matter energy range\n(between 1 and 50 keV) by a measurement of the IQF. For a given energy, an electron track in a\nlow pressure micro-TPC is an order of magnitude longer than a recoil one. It opens the possibility to\ndiscriminate electrons from nuclei recoils by using both energy and track length informations, as it\nwas shown in [5]. The 3D tracks are obtained from consecutive read-outs of the anode, every 25 ns,\ndefining the event. To get the length and the orientation of the track, an independent mesurement\nof the drift velocity is needed. Preliminary measurements, with different gases in the MIMAC\nprototype, of the drift velocity have been performed and they fit well with Magboltz simulations\n[6].\n\n3. First experimental results\nThe first result concerning the ability to detect tracks with the prototype was performed with\na\nX-ray source in order to reconstruct the 5.9 keV electron tracks produced by photoelectric\neffect in the active volume.\n55 Fe\n\nFigure 2: A 5.9 keV electron track in 350 mbar 95% 4 He + C4 H10 . The left panel represents the 2D\nprojection of the recoil seen by the anode, the center panel represents a 3D view of the track after using the\nreconstruction algorithm and the right panel represents a projection of the 3D track on the XZ plane\n\nFigure 2 presents a typical electron track seen by the anode (X,Y) (left panel), its projection on\nthe XZ plane (right panel) and reconstructed in 3D (center panel). This result shows the MIMAC\ncapability to reconstruct the track of low energy electrons which are the typical background in dark\nmatter experiments.\nOn fig 3 (left panel), a 3D track reconstruction is achieved for high energy (5.5 MeV) alpha\nparticles issued from the natural radioactivity (222 Rn) present in the chamber. However, the final\nvalidation concerning the possibility for MIMAC to get directional detection had to be done with\nneutrons giving nuclear recoils in the range of a few keV. In order to have monoenergetic neutron\nfields, in the range of a few tens of keV, we perform an experiment at the AMANDE facility (IRSNCadarache) allowing to select the energy of the neutrons by the angle with respect to a proton beam\nproducing a neutron resonance on a LiF target.\n3\n\n\fMIMAC: Directional detection\n\nD. Santos\n\nFigure 3: From left to right: recoil of 5.5 MeV He nuclei in 350 mbar 4 He + 5%C4 H10 , 8 keV hydrogen\nnucleus in 350 mbar 4 He + 5%C4H10 and fluorine nucleus leaving 50 keV in ionization in 55 mbar 70% CF4\n+ 30% CHF3\n\nOn fig 3 (center and right panel), 3D tracks of nuclear recoils following elastic scattering of\nmono-energetic neutrons are represented. On the center panel, a 8 keV proton recoil leaving a track\nof 2.4 mm long in 350 mbar 4 He + 5%C4 H10 is represented. This event is a typical kind of signal\nthat MIMAC will expect for dark matter search. The right panel presents a 50 keV (in ionization)\nfluorine recoil of 3 mm long obtained in a 55 mbar mixture of 70% CF4 + 30% CHF3 . In addition,\nthe electron-recoil discrimination, a very important point for dark matter detection, showing the\nability to separate gamma background from nuclear recoils, has been presented in pure Isobutane\nor 4 He + 5%C4 H10 mixture in ref. [5].\n\n4. Directional detection of Dark Matter and its discovery potential\nDirectional detection of non-baryonic Dark Matter is a promising search strategy for discriminating WIMP events from background offering a complementarity to massive detectors [9, 10].\nThe directionality gives a solid and unambiguous signature of the correlation between the galactic\nhalo and a signal in our detector. This is achieved by searching for a correlation of the WIMP\nsignal with the solar motion around the galactic center, observed as a direction dependence of the\nWIMP flux coming roughly from the direction of the Cygnus constellation [1]. This is generally\nreferred to as directional detection of Dark Matter and several projects are being developed for this\ngoal [11, 12, 13, 14, 15].\nThe main asset of directional detection is the fact that the WIMP angular distribution is pointing towards the Cygnus constellation while the background one is isotropic (fig 4). The right\npanel of figure 4 presents a typical recoil distribution observed by a directional detector : 100\nWIMP-induced events and 100 background events generated isotropically. For an elastic axial\ncross-section on nucleon σn = 1.5 × 10−3 pb and a 100 GeV.c−2 WIMP mass, this corresponds to\nan exposure of ∼ 7 × 103 kg.day in 3 He and ∼ 1.6 × 103 kg.day in CF4 , on their equivalent energy\nranges as discussed in ref. [16]. Low resolution maps are used in this case (Npixels = 768) which\nis sufficient for the low angular resolution, ∼ 15◦ (FWHM), expected for this type of detector. In\nthis case, 3D read-out and sense recognition are considered, while background rejection is based\non electron/recoil discrimination by track length and energy selection [5]. It is not straightforward\n4\n\n\fMIMAC: Directional detection\n\nD. Santos\n\nFigure 4: From left to right : isotropic background distribution, WIMP-induced recoil distribution in the\ncase of an isothermal spherical halo and a typical simulated measurement : 100 WIMP-induced recoils and\n100 background events with a low angular resolution. Recoils maps are produced for a 19 F target, a 100\nGeV.c−2 WIMP and considering recoil energies in the range 5 keV ≤ ER ≤ 50 keV. Figures from [16].\n\nto conclude from the recoil map of figure 4 (right) that it does contain a fraction of WIMP events\npointing towards the direction of the solar motion.\nTo extract information from this example of a measured map, a likelihood analysis has been\ndeveloped. The likelihood value is estimated using a binned map of the overall sky with Poissonian\nstatistics, as shown in Billard et al. [16]. This is a four parameter likelihood analysis with mχ ,\nλ = S/(B + S) the WIMP fraction (B is the background spatial distribution taken as isotropic and\nS is the WIMP-induced recoil distribution) and the coordinates (l, b) referring to the maximum of\nthe WIMP event angular distribution.\n\nAxial cross-section on proton (pb)\n\n10\n\n1\n\n10-1\nSuperK\n\n10-2\nAllowed region\n\n10-3\nKIMS\n\n10-4\n\nXenon10\nNAIAD\n\nSUSY\n\nCOUPP\nPicasso\n\n10-5\n\n2\n\n10\n\nWIMP mass (GeV/c 2)\n\nFigure 5: On the left, marginalized probability density functions of λ (top), l, b (bottom) after the likelihood\nanalysis of the simulated recoil map shown before. On the right, allowed regions presented in the plane of\nthe spin dependent cross-section on proton (pb) as a function of the WIMP mass (GeV/c2 ). Input value for\nthe simulation is shown with a star.\n\nThe result of this map-based likelihood method is that the main recoil direction is recovered\nand it is pointing towards (l = 95◦ ± 10◦ , b = −6◦ ± 10◦ ) at 68 % CL, corresponding to a nonambiguous detection of particles from the galactic halo. This is indeed the discovery proof of this\ndetection strategy (left panel of fig. 5) [16]. Furthermore, the method allows to constrain the WIMP\nfraction in the observed recoil map leading to a constraint in the (σn , mχ ) plane (right panel of fig.\n5). As emphasized in ref. [16], a directional detector could allow for a high significance discovery\n5\n\n\fMIMAC: Directional detection\n\nD. Santos\n\nof galactic Dark Matter even with a sizeable background contamination. For very low exposures,\ncompetitive exclusion limits may also be imposed [17].\n\n5. Conclusions\nDirectional detection is a promising search strategy to discover galactic dark matter. The\nMIMAC detector provides the energy of a recoiling nucleus and the reconstruction of its 3D track.\nThe first 3D tracks observed with the MIMAC prototype were shown: 5.9 keV electrons (typical\nbackground) and low energy proton and fluorine recoils (typical signal). The next step will be to\nbuild a demonstrator of 1 m3 to show that the large micro-tpc matrix for directional detection of\ndark matter search is accessible.\n\n6. Acknowledgements\nThe MIMAC collaboration acknowledges the ANR-07-BLANC-0255-03 funding.\n\nReferences\n[1] D. N. Spergel, Phys. Rev. D 37 (1988) 1353.\n[2] E. Moulin, F. Mayet et D. Santos. Phys. Lett. B 614 (2005) 143-154.\n[3] I. Giomataris et al., Nucl. Instrum. Methods A 560 (2006) 405.\n[4] D. Santos et al., arXiv:0810.1137.\n[5] C. Grignon et al., JINST 4 (2009) P11003, arXiv:0909.0654.\n[6] S.F. Biagi, Nucl. Instrum. and Meth. A421 (1999) 234-240.\n[7] J.P. Richer et al., Nucl. Instrum. Methods A 620 (2010) 470.\n[8] O. Bourrion et al.,Nucl. Instrum. and Meth. A662(2010) 207.\n[9] E. Aprile et al., arXiv:1005.0380.\n[10] E. Armengaud et al., Phys. Lett. B 687 (2010) 294-298.\n[11] D. Santos et al., J. Phys. Conf. Ser. 65 (2007) 012012.\n[12] G. J. Alner et al., Nucl. Instr. Meth. A 555 (2005) 173.\n[13] S. Ahlen et al., arXiv:1006.2928.\n[14] K. Miuchi et al., Phys. Lett. B 654 (2007) 58.\n[15] S. Ahlen et al., Int. J. Mod. Phys. A 25 (2010) 1.\n[16] J. Billard et al., Phys. Lett. B 691 (2010) 156-162.\n[17] J. Billard et al., Phys. Rev. D 82 (2010) 55011.\n\n6\n\n\f"}